{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1591747026,
			"title": "Everybody Deserves What They Get",
			"body": "*We strive for justice and morality, but a just and moral way of life is impossible to us. From ancient times to the modern age, the life of a human being has been nothing more than a frantic striving to be the criminal and not the victim. A vast majority of the people (I would say 99.99% of them) end up as the victims—there is no way of remedying the situation because the victims are mired in ignorance, cowardice, and malice, and are incapable of confronting the criminals.*",
			"added": 1591747025
		},
		{
			"topic_id": 1591822356,
			"title": "Can't trust a soul in this hellscape, I recon...",
			"body": "Jews took it all, we just live in the fallout getting raped and murdered by our own governments.",
			"added": 1591822354
		},
		{
			"topic_id": 1591828065,
			"title": "Why can't people just be normal?",
			"body": "Is it really so hard to not to be a disgusting perverted liar and a thief?\n\nIs it so hard to be an intelligent functioning contributing member to society that doesn't engage in criminal activity?\n\nWhy are so many people degenerates?\n\nWhy are there child sacrificing, sex slaving, cannibalistic Satan worshiping faggots and whores controlling society?\n\nKikes!",
			"added": 1591828062
		},
		{
			"topic_id": 1591924953,
			"title": "The U.S. Constitution is a failed experiment, like Communism",
			"body": "It failed pretty much on day one, and it was a joke by the time of Lincoln, Wilson, or FDR. It has become a propaganda symbol for justifying government power - the very opposite of what it was intended!\n\nWe need something a thousand times stricter and more explicit in its checks on government! All power to municipalities, no Federal power except for protecting borders and killing commies! Anyone who advocates expanding the government gets tortured to death on pay-per-view!",
			"added": 1591924949
		},
		{
			"topic_id": 1592089664,
			"title": "Coalfax.me has apparently been FBI'd",
			"body": "A lot of people are asking, so I'm going to copy-paste the same reply to them all.\n\nSomething happened. Our web dev guy took the site down and deleted the source code. It took me forever to get an update out of him, and he won't discuss any details. I believe he got a visit from the FBI or local law enforcement. He's being way too cagey about the whole thing, more reluctant to discuss it than I consider normal from this person. He'd tell me if it were any other reason. I believe he's under legal pressure not to discuss it. I feel bad for him.\n\nSo, we got on the news twice, we made a lot of people very very angry, and we showed the world that there are still people who don't subscribe to the Gospel of Diversity. I feel like we accomplished our goals. I'm sad the site died, but I'm glad my friend wasn't disappeared into an FBI black site. Someone else may take up the Coalfax mantle now. Our cause will never die.\n\nThank you to everyone who submitted coalburners and supported us. We, the silent majority, still exist.",
			"added": 1592089659
		},
		{
			"topic_id": 1592177736,
			"title": "AS A UPSCALE RICH JEWISH MAN OF FAITH………",
			"body": "NOTHING MAKES US MORE HAPPY TO SEE THUG NIGGERS KILLED BY POLICE. THEY DESERVE WHAT THE GET AND WE ARE GLAD THERE ARE IN PAIN.\n\nTHEN WE LOVE IT MORE WHEN WE SEE THEM BURNING THEIR OWN \"SHITHOLE\" LIVING HOVELS.\n\nTHEY LIVE IN 3RD WORLD COUNTRY STANDARDS BUT THEN THEY LOVE TO BURN THE SHITHOLESDOWN. LOL!!!\n\nWE ALSO LOVE HOW 97 OUT OF EVERY 100 NIGGERS ARE KILLED BY NIGGERS\n\nIN THE END WE WILL CONTINUE TO OWN YOU.\n\nHERE IS SOME ADVICE:\n\n1. FALL BACK IN LINE AND BE GOOD PORCH MONKEYS' LIKE YOUR WEAK ASS PUNK BITCH ANCESTORS DID\n\n2. HERE IS THE BIG ONE, \"DON'T BREAK THE FUCKING LAW\"!!!!!\n\nThese FILTHY PORCH MONKEYS NEED TO BE BATHED AND RE-INTRODUCED TO THE WHITE MAN'S LIFE STYLE \"OR\" GO BACK TO FUCKING AFRICA.\n\nWE ARE IN CONTROL, DEAL WITH IT AND WITH (\"WIF\" FOR THE NIGGERS) THE WHITE US POPULATION OF 62%, THE LATINO AT 18%, THE US NIGGER IS 13%, THEREFORE YOU WILL NEVER BE IN CONTROL!!!!\n\nNOW BACK TO YOUR MOPS AND SHINE BOXES OR GET SLAPPED HARD \"AGAIN\"!",
			"added": 1592177730
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1592177248_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": [
			{
				"comment_id": 1,
				"body": "Can't live forever if there is no food.",
				"added": 1592192800
			}
		],
		"1592432175_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": ">I want ZeroNet to be safer for all\nSafe for the jew, that it is.",
				"added": 1592449504
			}
		],
		"1592765143_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": [
			{
				"comment_id": 3,
				"body": "Useless, your firmware is unsafe.",
				"added": 1592837201
			}
		],
		"1593090212_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": [
			{
				"comment_id": 4,
				"body": "Better hire mercs, Gibson style.",
				"added": 1593102237
			}
		]
	},
	"comment_vote": {}
}