{
	"posts": [
		{
			"id": "3fe757d9-f05a-44ad-9976-beca87550a56",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "e0a6634e-bb76-4cb6-9c34-719011e548da",
			"body": ">>bd6dcf09-23ab-470b-8f9c-e1272f0c6d24\nAll they need to do is push it through once and they're golden, so they'll keep trying until they manage to do it. It's not like they haven't already substantially eroded the 1st and 2nd, and would likely get a cheer for it from their drones.",
			"time": 1565161392254,
			"files": "[]"
		},
		{
			"id": "69537318-157c-4f7a-838d-96c55785f9b2",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "e0a6634e-bb76-4cb6-9c34-719011e548da",
			"body": ">>06c75b55-e57e-4464-957a-88db3540cb5a\nI'm not particularly optimistic about our odds of coming through this. If they're actually starting an investigation chances are Jim will simply decide fullchan is not worth the bother, and where do we go from there?\n\nNone of the alternatives available can handle the load or are easily accessible, and those that are already compromised - and while many would argue that it's better to be a sikrit club, we also need an organic inflow of users if we don't want to die simply because there's no activity and people leave due to boredom.\n\nIt may very well be that this is the last hurrah for imageboards as we know them.",
			"time": 1565163037370,
			"files": "[]"
		},
		{
			"id": "05ae6cfa-8ce6-46c2-ab8d-cd53d4c635eb",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "e0a6634e-bb76-4cb6-9c34-719011e548da",
			"body": "So, any new developments or is fullchan still kill?",
			"time": 1565189354940,
			"files": "[]"
		},
		{
			"id": "b9867515-d651-4c8b-b806-342df8467756",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "e0a6634e-bb76-4cb6-9c34-719011e548da",
			"body": ">>2b2f699e-b53c-4bd3-8f99-a6b46559590f\nWhich is fucking hilarious when you consider Facebook and Twitter are routinely used to share gruesome videos and pictures of executions, death threats, pedophilia et al, yet we get fucked over because some leftist cuck that doesn't even frequent the board decided to post \"his\" manifesto on Instagram and someone (likely) /leftypol/, uploadad it on /pol/.\n\nThese hypocritical, false-flagging golems have no fucking shame, and Jim's testimony in front of Congress will be no less of a travesty.\n\nI imagine if fullchan comes back it will be a neutered, highly moderated shithole where you can't even say nigger or tell /leftypol/ to kill themselves already.",
			"time": 1565192255744,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}