{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1569552691,
			"title": "Why is anyone fooled into thinking Donald Trump is any better than Hillary Clinton?",
			"body": "They're almost literally the same person.",
			"added": 1569552690
		}
	],
	"topic_vote": {},
	"next_comment_id": 188,
	"comment": {
		"1566984204_1DWcgvD7uuH61JxvRZnHhgjwdT4FQnXhqG": [
			{
				"comment_id": 1,
				"body": "> [tempofunktron](#comment_10_14HL4TtDqn72eNpfEQE5WSYjRsYDr2pZ81): It was also a Simpsons reference that I hope you would catch on to\nCalm down Clancy",
				"added": 1567002779
			}
		],
		"1566953714_17YLe3Jg9YRvVknLPRrtzuKcTs43TKkfhz": [
			{
				"comment_id": 2,
				"body": "Why is a fool so easy to you?",
				"added": 1567003145
			}
		],
		"1566939301_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 3,
				"body": "I'm pretty sure mine is not synaptics but there's a setting called tap to click or some shit that you have to turn off",
				"added": 1567003283
			}
		],
		"1567301440_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU": [
			{
				"comment_id": 4,
				"body": "Hit mute on the people you don't like?",
				"added": 1567304084
			}
		],
		"1567815493_14vGy5BMcRS26xrfaVZfcTuVm8XTaZv3mi": [
			{
				"comment_id": 5,
				"body": "not worth. your loved one would want you to continue on. it's hard as fuck but you must for them.",
				"added": 1567912212
			}
		],
		"1567851023_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 6,
				"body": "Hey! We found the minecraft player!",
				"added": 1567912389
			}
		],
		"1568417535_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 7,
				"body": "Not if I shit on your grave first.. but I'm a piberal, cause I drink Mr Pib",
				"added": 1568433019
			}
		],
		"1568405412_14BhfodWhzPjujQB97t8A5R4r59T7iqopJ": [
			{
				"comment_id": 8,
				"body": "Isreal has to keep track of Satan",
				"added": 1568433095
			}
		],
		"1569725313_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 9,
				"body": "If you give a coin to the ferryman on the river Styx you can meet them all there ;D",
				"added": 1569730356
			}
		],
		"1569697321_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": [
			{
				"comment_id": 10,
				"body": "This is brought up at least once a year for years.. It's really a game in Malcolm in the Middle.. and you've been had",
				"added": 1569730616
			}
		],
		"1569534830_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 11,
				"body": "I'm encouraging everyone to vote for NO ONE. end the cycle.",
				"added": 1569730684
			}
		],
		"1569552691_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": [
			{
				"comment_id": 12,
				"body": "> [jokercrusader01a](#comment_1_157VVUxncF9T6AJyBqccov3387r13ru7ir): Not even a good try troll. hahaha\n\nIt's not a troll. It's a legit question. For which you don't have an answer.",
				"added": 1569730859
			}
		],
		"1569889210_1LhSwRbe5DT25JGcce1HFRWq75qQDW2YT5": [
			{
				"comment_id": 13,
				"body": "There's some hot Brazilian bitches tho.",
				"added": 1569898610
			}
		],
		"1569889390_1NVmsWAF88eiamogSRiUzzSVKbsakUnn62": [
			{
				"comment_id": 14,
				"body": "Uh, run your own server?",
				"added": 1569898680
			}
		],
		"1569605502_17xMbJPXvnaePZLbYtkWeAoznqRsoTtG4U": [
			{
				"comment_id": 15,
				"body": "Not from the UK so I can only go by what I've read, but the previous comment seems right.. the one report I read titled Thomas Cook bosses stuck in the past.. that's the problem with some of these old heads.. no idea of how to innovate. Just keep doing things the old way. Many VERY OLD companies have fallen to that ideology. There will always be new popping up in their ashes.",
				"added": 1569899006
			}
		],
		"1569695244_1MKHBc72uGEBSuHxagbgTWGmverPtzD1tH": [
			{
				"comment_id": 16,
				"body": "Qanon is a 7 year old in Wales",
				"added": 1569899052
			}
		],
		"1569865169_17gocsxsD85erCtJ7mp3n7dM27347N5y2k": [
			{
				"comment_id": 17,
				"body": "In a trap house.. duhhhh",
				"added": 1569899184
			}
		],
		"1570044887_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd": [
			{
				"comment_id": 18,
				"body": "This, but in real life, but not real.",
				"added": 1570072896
			},
			{
				"comment_id": 22,
				"body": "Did you miss the Saudi connection to Trump?? He's selling arms to SA",
				"added": 1571286644
			}
		],
		"1567460587_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": [
			{
				"comment_id": 19,
				"body": "> [aspidochelone](#comment_164_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Alright, I hadn't looked in on Daily Stormer in months.  It's kind of a weird site in that they talk half about freedom of speech and half about racist bullshit, but I'm pro freedom of speech so there's usually something in there.  I mean, if the only people defending my basic freedoms are Nazis, where does that put me?  # -> p  I would say!  This time they had their \"BBS\" (a comments section) going at http://bbs.dstormer6em3i4km.onion/ and on it I found a very surprising thing, which they seem to prove via the following link:  https://archive.is/zfVts  Namely that the nearly unnamable gunman from Texas two days ago, Seth Ator, identified only as a white male shooter by so many media, whose shooting article on Wikipedia has been repeatedly modified not even to give his name, was described online as \"Native American/Jewish\".  Now, I'm NOT riding on Daily Stormer's crazy train, but I am sick as fuck of having people who think they are much much better than me lying to me and keeping me in the dark in the name of \"ethics\" and \"what might happen\".  FUCK ETHICS.  Ethics is just a fancy word for profit - profit for somebody who is perhaps justifiably afraid of political pushback, deplatforming, or lost donations, but not any profit for me!\n\nNative American AND Jewish is nearly impossible to happen. But he was neither. A psycho is what he was.",
				"added": 1570234520
			}
		],
		"1570222572_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX": [
			{
				"comment_id": 20,
				"body": "Do you mean BUSHES cause I see no brushes",
				"added": 1570234619
			}
		],
		"1571190639_15mJzWiShxgyYjrp6uAgRBbme4wWPUjwZn": [
			{
				"comment_id": 21,
				"body": "America hasn't won a war in a long time.. do you think it could win a war against itself???",
				"added": 1571198410
			}
		],
		"1571339336_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": [
			{
				"comment_id": 23,
				"body": "You may be a faggot",
				"added": 1571372721
			}
		],
		"1572807733_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 24,
				"body": "There was a thread on reddit a while back that listed a couple decent safe Nintendo rom sites..",
				"added": 1572827189
			},
			{
				"comment_id": 25,
				"body": "https://www.reddit.com/r/Roms/comments/9gzto2/safe_rom_sites/\nhere it is",
				"added": 1572827232
			}
		],
		"1572739729_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 26,
				"body": "gopher.. I miss gopher\nSeriously. when I first got on the internet it was essentially subculture.. Now it's just mainstream.\nThere was no Google either. Or Internet Explorer. Just good old Netscape Navigator",
				"added": 1572827579
			}
		],
		"1572836262_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 27,
				"body": "Firefox on Ubuntu under VM\ncrashed VM when it loaded the page",
				"added": 1572915629
			}
		],
		"1573157871_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": [
			{
				"comment_id": 28,
				"body": "> [turdfaceshitmast](#comment_14_1Kz1dLDCnaWKYGVDsfCLRGLGAqM3QqDjr5): http://educate-yourself.org/cn/The-Hidden-Tyranny1976.shtml#top [...]\n\nWhat is I told you Jesus was a Jew?",
				"added": 1573271804
			},
			{
				"comment_id": 29,
				"body": "> [captainkirk](#comment_1_1DfS5W4f4uaamYXGawCNnG4niUe4ue5MiC): avoid their toilet paper money system - buy precious metals (especially silver)\n\nNah, they love silver! Buy bitcoin, they don't know what it is!",
				"added": 1573271903
			},
			{
				"comment_id": 32,
				"body": "Sol Invictus, literally the sun god becomes the son of god. go figure",
				"added": 1573366118
			}
		],
		"1573267199_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 30,
				"body": "If it is fairly certain that they are your very distant relatives, what does that make you?",
				"added": 1573272011
			}
		],
		"1573303435_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": [
			{
				"comment_id": 31,
				"body": "Wait 980 years and then visit a suicide booth",
				"added": 1573365818
			}
		],
		"1560968142_1GnMepQGSHSi7yBqqi86T65hRgon3KyJtS": [
			{
				"comment_id": 33,
				"body": "> [qingqing](#comment_8_1dUopDebW9j3LuiBuSm54faMWQRvBU6S4): this is so long  i cannot understand your meaning\n\nHe's asking why the old testament has god telling people to go kill everyone that doesn't  believe in him",
				"added": 1573446644
			}
		],
		"1573764857_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 34,
				"body": "so why not enlighten people with understanding instead of insulting them?\nWhen you have something like ZeroNet that recommends using Tor and Tor Browser I think most people will believe they should.",
				"added": 1573963673
			}
		],
		"1573864603_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 35,
				"body": "> [brianhanson2nd](#comment_46_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE): You know what's funny though? The people with the guns will win, it happens every time. An unarmed person is no match for a person with a gun, and thems the facts.\n\nIdk. Indiana Jones did a good job of it.",
				"added": 1573963994
			}
		],
		"1574000003_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 36,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1137_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): what I mean is that the organs function independently  [...]\nI dare you to remove any of your organs to see how well they function independently.",
				"added": 1574144080
			}
		],
		"1574259710_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 37,
				"body": "A Man Chooses, A Slave Obeys",
				"added": 1574299221
			}
		],
		"1574357441_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 38,
				"body": "Do you have anything to say?",
				"added": 1574384190
			}
		],
		"1574424024_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": [
			{
				"comment_id": 39,
				"body": "How is it illegal? I mean, if you succeed it's not like they can arrest you..",
				"added": 1574479693
			}
		],
		"1574806526_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 40,
				"body": "> [styromaniac](#comment_1344_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I'm gonna have to disagree with your thesis.\n\nI don't think you're legally allowed to disagree with a point that well explained without posting a counterpoint.",
				"added": 1574819188
			}
		],
		"1574812874_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 41,
				"body": "> [styromaniac](#comment_1347_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Among all the far-fetched stories, Abrahamic religions had appropriated the science of food-communical diseases. Kosher/Halal is based on this, but without any explanation except for the consumer being deemed \"unclean 'til evening.\" What this shows is that science mattered a tiny bit to the holy script authors just enough to say that a god (Yahweh/Elohim/Allah) commanded them to avoid these foods, effecting avoidance of the risk of the diseases these foods potentiate, but to the followers, the science mattered not. It had to be commanded by a book of fiction to persuade them.\n\nI'm pretty sure the authors weren't all that aware of what really caused the disease either. Other than this food makes people sick. These people didn't cook meats to correct temperatures which is why most of the safe meats are those that are generally cooked to medium rare or so anyways.",
				"added": 1574819719
			}
		],
		"1574848015_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 42,
				"body": "I really like the look of the ASUS Zenfone 6",
				"added": 1574915032
			}
		],
		"1574812694_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 43,
				"body": "> [z3n5if](#comment_92_17ZzQakCby5cKd1FduZm4DX7SYFZMVWYsD): Why does it seem like everyone on znet wants to off themselves like it feels better than sex?\n\nCause none of them can have sex",
				"added": 1575000153
			}
		],
		"1574929776_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 44,
				"body": "> [z3n5if](#comment_94_17ZzQakCby5cKd1FduZm4DX7SYFZMVWYsD): Gravity and evolution are both theories that attempt to explain physical phenomena. I don't deny the physical phenomena but the accuracy of any interpretation, or theory, can be good or bad. Based on what I know about both phenomena, both theories adequately describe the resulting phenomena. They don't, however, describe all of the functions by which they operate. Further, quantum theory is wholly inadequate while dna evidence explains quite a lot, comparatively.I find it quite interesting that you use a less understood field of knowledge to prove a better understood one.\n\nWill you two just fuck already.. geez",
				"added": 1575000399
			}
		],
		"1575161695_1KDpaUh79hAu9u5dFdZeJptTi2u3wQcCUT": [
			{
				"comment_id": 45,
				"body": "Nah, Freenet's been around for.. I think around 20 years",
				"added": 1575168791
			}
		],
		"1575180863_11xvtkLUfeD7brvyLqn93txTVbwFP85bg": [
			{
				"comment_id": 46,
				"body": "> [4br4xa5](#comment_1_12zTX1YWUT1ZHMjweMRTmahsaDLtnPBdeR): Fuck off, we're full.\n\nFull of Shit lol!",
				"added": 1575264285
			}
		],
		"1575282377_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 47,
				"body": "Eventually everything turns to shit anyways",
				"added": 1575351484
			}
		],
		"1575303702_1Ggn5eJwFKVHhjZq5D1kJuGpgqAkVuCTgy": [
			{
				"comment_id": 48,
				"body": "which country?",
				"added": 1575351535
			}
		],
		"1575466445_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 49,
				"body": "He worked??? Woz worked. Jobs was the showman",
				"added": 1575956009
			}
		],
		"1576099007_1A1JcKDgksT5pQJoSo7g1P1cC9kAKvG93m": [
			{
				"comment_id": 50,
				"body": "He can't. He's 12 and his parents would have to take him.",
				"added": 1576120527
			}
		],
		"1576347710_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": [
			{
				"comment_id": 51,
				"body": "Can you use tor?",
				"added": 1576640970
			}
		],
		"1576697039_1JorDyDxuLrircDbzzmn4B1ndcbSJahXLH": [
			{
				"comment_id": 52,
				"body": "> [thewhispering](#comment_11_1JorDyDxuLrircDbzzmn4B1ndcbSJahXLH): I didn't mean to offend anyone, honestly. I thought this Zeronet place would maybe be less judgmental and than the clearnet and maybe treat people with respect even if someone happens to not share the same views...I am sorry.\n\nDon't worry about them",
				"added": 1576811319
			},
			{
				"comment_id": 53,
				"body": "http://192.168.2.85:43110/1FCtRjQtyE4Es9XbS2WCzweyvnaehKfLG6/?tag:56",
				"added": 1576811616
			}
		],
		"1576246850_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": [
			{
				"comment_id": 54,
				"body": "Not an entirely perfect system but better than the recent pasts blame on \"demons\" controlling a person.\nThere's got to be a better solution than the old standards Risperdal, Haldol, and Prolixin but they're cheap and for the most part work.",
				"added": 1576812538
			}
		],
		"1577593821_1Hrz1rynf2scp9MZ7Abt6FfRgUMCmZ8H2v": [
			{
				"comment_id": 55,
				"body": "These bush fires have been going on for centuries. It's how the land purges and resets.\nIt's not some agenda it's the way nature works",
				"added": 1577595650
			}
		],
		"1577433117_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 56,
				"body": "Humanity is ultimately doomed. whatever we do humans will eventually be extinct.",
				"added": 1577595916
			}
		],
		"1578105095_1G79HnSxfCixN2HD2jP1Zabs1B8xzw298s": [
			{
				"comment_id": 57,
				"body": "eh, the signs have been there for thousands of years.. still skidding into the endzone",
				"added": 1578200682
			}
		],
		"1578136139_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 58,
				"body": "Green Hill Zone will always be a favorite, very nostalgic. Mute City is great as well",
				"added": 1578200850
			}
		],
		"1578305039_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 59,
				"body": "He's just saying learn more useful skills for today's market. which is pretty much what any sane person should be doing.",
				"added": 1578367218
			}
		],
		"1578244855_1M1qF4xa5hYtGE1BikxTpZxLtAyQRXsJ4v": [
			{
				"comment_id": 60,
				"body": "I assure you that is not the first religion to distinguish good from evil",
				"added": 1578367296
			}
		],
		"1578603520_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 61,
				"body": "there will be money. micro-tipping with crypto is already possible",
				"added": 1578620031
			}
		],
		"1579517170_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 62,
				"body": "> [bigbadbob](#comment_900_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I can say yes.   Some people are overly interested in what I do with my time.   Sucks to be them and I wish they would find better interests.\n\nTheir interests are finding out what your interests are so they can make money",
				"added": 1579578540
			},
			{
				"comment_id": 63,
				"body": "> [bigbadbob](#comment_902_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Guess you are too grumpy to even joke around with these days.   Or ya just gotta shit on everything, lol   either way.Legit curious thought...  You like 80 or what?\n\nHe's one of them I'm Smarter Than Everyone types lol",
				"added": 1579579409
			}
		],
		"1578573647_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 64,
				"body": "If this system is supposed to be decentralized and uncensored than censoring him would be against what zn stands for. don't like what he says, maybe mute him?",
				"added": 1579658847
			}
		],
		"1579890249_16cUVejYswnQhxY6LRP6ftoC9WezKzpKbe": [
			{
				"comment_id": 65,
				"body": "So why are so many homosexuals attracted to older men? seems to destroy your argument",
				"added": 1580016060
			}
		],
		"1579399038_1KMFhezc9fqBCbWg8xbu6HimdG5nMSQwBD": [
			{
				"comment_id": 66,
				"body": "The second amendment talks about going up against the government. Would you actually do this? If it came to it would you risk your life to fight the government?",
				"added": 1580016389
			}
		],
		"1578064771_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 67,
				"body": "> [jdahmer](#comment_2_1MncXrdH1L6Cf7DvtpG2goSwPNNCacpqUU): If any country actually started a full, all-out war against the U.S., all they would notice is a bright flash. [...]\n\nAnd soon after the world would end",
				"added": 1580273908
			},
			{
				"comment_id": 68,
				"body": "There will be no WW3 at this time. To say there will never be WW3 is absurd. Though MAD prolly keeps it less likely",
				"added": 1580274066
			}
		],
		"1580070228_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 69,
				"body": "> [draugrdeathlord](#comment_499_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): DONT TAKE THE VACCINE do not believe a single thing they say about it this virus is part of \"event 201\" and the vaccine is already ready to go the delay is to wait for pandemic panic so people beg for it.\n\nUhm. there is no corona virus vaccine you nutter",
				"added": 1580274513
			},
			{
				"comment_id": 70,
				"body": "> [lightingball](#comment_12_14waGGyqPBKFdRMxWBKAtg4Ux1b8a16QbK): My father believed that alcohol cures coronavirus and drinks more often. There's even some scientific evidence that alcohol can be used to kill virus.\n\nThat might've just been his excuse to drink lol",
				"added": 1580274736
			}
		],
		"1580289800_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 71,
				"body": "There's a canine coronavirus vaccine but not human. So unless you're canine it's worthless to you",
				"added": 1580528443
			}
		],
		"1582197021_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 72,
				"body": "Money = Paranoia = Mental Illness. Most of the rich go insane believing someone is going to take everything from them. And they will stop at nothing to make sure that doesn't happen",
				"added": 1582947671
			}
		],
		"1582577947_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 73,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1879_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"\"That's a loss of 4.4% – the worst one-day drop in history.The Dow Jones/NYSE is down 1,191 points today. It was already volatile, but when the news came out that all public health statements had to go through Mike Pence first, they really took a nosedive. \" [...]\n\nFear is a hell of a thing",
				"added": 1582948506
			}
		],
		"1584141897_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid": [
			{
				"comment_id": 74,
				"body": "It became sentient and ran!",
				"added": 1584154266
			},
			{
				"comment_id": 75,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1904_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): youand your 'delusional you'\n\nIs he related to Despicable Me?",
				"added": 1584249048
			}
		],
		"1585525602_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 76,
				"body": "The simulation has gone off track. We have to reset the system to fix it. We apologize for any inconvenience.",
				"added": 1586154280
			}
		],
		"1586599656_12DKigk2DkPNoUCFWcgzeW7CXu6kgX2NaL": [
			{
				"comment_id": 77,
				"body": "The data has to be stored somewhere, where is it going to go?",
				"added": 1586928770
			}
		],
		"1587670973_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 78,
				"body": "There are no wings they've both been clipped",
				"added": 1587876301
			}
		],
		"1585234073_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 79,
				"body": "> [ranshit](#comment_139_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): Country [...]\n\nCured is a misnomer. Recovered is correct.",
				"added": 1588050327
			},
			{
				"comment_id": 80,
				"body": "> [jesuschrist](#comment_4_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW): What Virus?\n\nThere are no viruses .. We're in a simulated world",
				"added": 1588913968
			},
			{
				"comment_id": 81,
				"body": "You dropped your tinfoil hat",
				"added": 1588913995
			},
			{
				"comment_id": 92,
				"body": "idk if bitchute is doing some funk tracking now or someones watching people on there now.\nnothing loads thru tor even with everything temp trusted with noscript\n> [thorburn](#comment_76_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): And there you have it https://www.bitchute.com/video/VKkb6hQFDmjU/",
				"added": 1589690839
			},
			{
				"comment_id": 111,
				"body": "> [commandantecero](#comment_46_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro): No, all phony. If it was as dangerous as the Spanish Flu we would have known by now. There is no way to hide that much illness. [...]\n\nStrange, months ago the puppets said the left wouldn't allow the lock downs. Then said they were blocking the stimulus payments.. so which way is it?",
				"added": 1591237999
			}
		],
		"1587403903_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": [
			{
				"comment_id": 82,
				"body": "Don't worry. the WorldSim might just need a reboot. This virus is transmitting to all computers now",
				"added": 1588914434
			},
			{
				"comment_id": 83,
				"body": "5G uses the frequency range between 25Ghz and 39Ghz tho.. \n> [planespherev4](#comment_12_1KSMTkAKXzbiXa7d2HWy3rNVSUJDXExpXg): Exactly. There is probably a correlation. It is said that at 60Ghz, oxygen electrons spin faster, and then it is more difficult for hemoglobin to fix them, thus the respiratory insufficiency potentially caused by 5G, and the people dropping unconscious on the streets in 5G covered areas in China.An other possibility is that at 60Ghz, oxygen become ozon (so O2 becomes O3), and ozon cause, again, respiratory insufficiency.There are not a lot of material proof for this, because guess what, the 5G telecom carriers didn't do much research, and if they did, they didn't publish it, much like what happened with Big tobbaco, who knew cigarettes cause cancer since the 1950s/1960s, but didn't publish the results for obvious reasons. There are also no independant researches on the effect of 5G on health.https://youtu.be/hsil3VQE5K4?t=157",
				"added": 1589085495
			}
		],
		"1588796526_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 84,
				"body": "Don't commit fraud you won't get in trouble..",
				"added": 1589086130
			},
			{
				"comment_id": 85,
				"body": "> [cexy](#comment_69_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): ?\n\nThey got raided for committing medical insurance fraud",
				"added": 1589172724
			}
		],
		"1589118404_1Ak954F5JD1uxGvAduUz9YwZFrVGe1L8Cw": [
			{
				"comment_id": 86,
				"body": "The aliens are coming",
				"added": 1589174173
			},
			{
				"comment_id": 87,
				"body": "> [edgelordofdecent](#comment_524_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): HAHAHA you are so funny!\n\nAt least I made you laugh lol",
				"added": 1589347916
			},
			{
				"comment_id": 88,
				"body": "> [aassddff](#comment_14_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): I'd say it's true, but the Aliens are demons.\n\nSee this guy gets it",
				"added": 1589347943
			},
			{
				"comment_id": 90,
				"body": "> [aassddff](#comment_27_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): Just wait. It'll be \"enlightened Aliens\" that say there is no God and we should just focus on being progressive, or some shit like that.The great deceivers.\n\nDon't worry there will be a Resistance",
				"added": 1589431133
			},
			{
				"comment_id": 91,
				"body": "> [aassddff](#comment_40_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): Gotta shut down those pesky traditionalist Catholics who sing in Latin because they teach discipline, to love God, to love your family and not to be a sex addict, I guess.\n\nNot be a sex addict?? You must not know too many Catholics",
				"added": 1589517164
			}
		],
		"1574346417_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 89,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1223_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): we know what you want commie,a new world war'it would please you'but it won't happen\n\nYooooo where you been",
				"added": 1589348113
			}
		],
		"1590076293_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 93,
				"body": "Did you just say white nationalists should blow themselves up?",
				"added": 1590124555
			}
		],
		"1590041703_19y1ZG2DVeRM65kYxKcLz7MLGTfTfoUWSm": [
			{
				"comment_id": 94,
				"body": "Theres used to be a lot of underage porn stars in the States",
				"added": 1590124930
			}
		],
		"1590079338_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 95,
				"body": "There is a lot of bugs in this mess",
				"added": 1590208925
			}
		],
		"1590241272_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 96,
				"body": "What would you suggest as a good desktop Linux distro?\n\n> [driud](#comment_54_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Ubuntu; to już nie jest linux. Jego dziadkowie, byli linuxem. Po sprzedaży do Canonikal; Jest to już windows.Życzę powodzenia, w rozwiązywaniu problemów na windowsie..Ubuntu; it's not linux anymore. His grandparents were linux. After sale to Canonikal; It's already windows.Good luck troubleshooting your windows.",
				"added": 1590296688
			},
			{
				"comment_id": 100,
				"body": "If they want a census they should ask for their users to volunteer for it",
				"added": 1590383817
			},
			{
				"comment_id": 101,
				"body": "Just installed ZorinOS 15.2 and you can opt out during installation",
				"added": 1590548442
			},
			{
				"comment_id": 102,
				"body": "> [cexy](#comment_20_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): So you don't mind that? Gee, I think people should consider carefully your zeronet 'act of kindness' IT department. You also see no problem with 'newer versions' of zeronet made by [since 2018] faceless and voiceless @nofish Koscis?  [...]\n\ndoood what language are you speaking",
				"added": 1590549638
			},
			{
				"comment_id": 103,
				"body": "> [cexy](#comment_21_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): If you are an advanced IT person you can do so much especially with Lin Distro. [...]\n\nFirst time playing with it, seems decent enough for a prebuilt desktop distro . If I really wanted good security I'd prolly use Gentoo or Arch and build it myself lol",
				"added": 1590636550
			}
		],
		"1590192659_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": [
			{
				"comment_id": 97,
				"body": "Freenet ran into the same problem. if you want free speech you have to deal with all the shit. including illegal shit",
				"added": 1590296728
			},
			{
				"comment_id": 99,
				"body": "> [gdafvcxcvx](#comment_1_14X7YqX1gTpjnnsLEbLfk1V3Wjs8tNztaA): I bet you love niggers :)\n\nfound the shill",
				"added": 1590383200
			}
		],
		"1590345225_14X7YqX1gTpjnnsLEbLfk1V3Wjs8tNztaA": [
			{
				"comment_id": 98,
				"body": "This is where freedom of speech hits a wall. When people use it to attack others. To call violence on others. As long as it's continued to be used that way it will continue to be attacked.",
				"added": 1590382187
			}
		],
		"1590689346_13gz7jEayVZjubcAGS16kR3Ze4RJSgVFVw": [
			{
				"comment_id": 104,
				"body": "Now who is accountable for slander? Will the users need to be held accountable?",
				"added": 1590724695
			},
			{
				"comment_id": 105,
				"body": "what are good decentralized alternatives?",
				"added": 1590725126
			}
		],
		"1590778185_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": [
			{
				"comment_id": 106,
				"body": "I can't watch the video but pandemics make a good story to the point that several books and movies based on those books have been written. \nThis is just how the world works, there's little things that \"want\" us dead, and they might win one day",
				"added": 1590807379
			}
		],
		"1591039498_1H6ZycKwvxf9U55ei8jXpaanmxDEK9Tbp": [
			{
				"comment_id": 107,
				"body": "Is there any anon forums?",
				"added": 1591066894
			}
		],
		"1590981433_19mfoWfh42vCabe3TVkFSXRTJKyFqmiMUA": [
			{
				"comment_id": 108,
				"body": "Blacks blame problems on whites, whites blame problems on blacks. If everyone worked together to build a community we would have a solid society. But those up above don't want that.",
				"added": 1591067231
			}
		],
		"1591131478_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 109,
				"body": "prolly qanon",
				"added": 1591152739
			},
			{
				"comment_id": 112,
				"body": "I find it funny that some of the pics of bricks being shown are the same pics from last time. Is there any new ones? With gps data?",
				"added": 1591238197
			},
			{
				"comment_id": 113,
				"body": "> [ransbits](#comment_56_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A): I seen it in some Minecraft video that if a Player smashes a hammer on a grey corner, it will conjure a brick fairy who will drop +7 Rock.\n\nThat would be good. I need some rocks",
				"added": 1591326455
			}
		],
		"1591016734_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 110,
				"body": "E: Unable to locate package siderus-orion",
				"added": 1591153794
			}
		],
		"1590898064_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": [
			{
				"comment_id": 114,
				"body": "> [nekololi](#comment_465_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): let's burn our own houses down in protest! #justantifathings\n\nAntifa don't own houses",
				"added": 1591326633
			},
			{
				"comment_id": 149,
				"body": "> [nekololi](#comment_465_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): let's burn our own houses down in protest! #justantifathings\n\nThey don't live where they're burning",
				"added": 1593229408
			},
			{
				"comment_id": 150,
				"body": "> [styromaniac](#comment_2369_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Officers are trained ready to kill and white people are affected by this too. We definitely need some police reform.\n\nThe bigger problem is officers aren't well trained at all",
				"added": 1593229470
			}
		],
		"1591403223_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 115,
				"body": "No you're wrong. They're paid by Trump to topple Soros!",
				"added": 1591409098
			},
			{
				"comment_id": 116,
				"body": "If those calling for violence were calling to start to boogaloo who would that be?",
				"added": 1591498660
			},
			{
				"comment_id": 117,
				"body": "> [thorburn](#comment_80_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): If they are paid by Trump why do you think Soros publicly state that Trump would be removed by 2020 if not sooner? Are you suggesting that Trump and Soros are best buddies, and that they are working together to deceive us all? [...]\n\nTrump is batting for Trump and his family",
				"added": 1591499408
			},
			{
				"comment_id": 118,
				"body": "> [styromaniac](#comment_2314_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It was a joke comment.\n\nMostly, though I'm not too sure Soros is in that much of control either",
				"added": 1591499922
			},
			{
				"comment_id": 119,
				"body": "The only one I've ever known was an unemployed straight-edge vegan",
				"added": 1591590705
			}
		],
		"1591644770_13gz7jEayVZjubcAGS16kR3Ze4RJSgVFVw": [
			{
				"comment_id": 120,
				"body": "Minds seems pretty decent",
				"added": 1591679858
			},
			{
				"comment_id": 121,
				"body": "Minds seems pretty decent",
				"added": 1591681427
			}
		],
		"1591821395_19ev8HmfPQ2VC8aWDA4Ck7E2vLYDYFgw9P": [
			{
				"comment_id": 122,
				"body": "They're only talking about this library here: https://archive.org/details/nationalemergencylibrary\nA quick browse doesn't show anything that should even still be in copyright so it looks like they're just being dicks",
				"added": 1591848544
			},
			{
				"comment_id": 146,
				"body": "> [merithtk](#comment_46_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): 150k per book. 1.4mil books. Do the math. They gonna go bankrupt.\n\nIs anything on there actually copyrighted? They won't have much of a case if there isn't. they can bring a suit but if it doesn't hold water it won't matter",
				"added": 1592531822
			}
		],
		"1591822356_1gn57j2UokAkXvA1VyhkHvKZvg59RoXuW": [
			{
				"comment_id": 123,
				"body": "Are you dead yet?",
				"added": 1591848561
			},
			{
				"comment_id": 125,
				"body": "> [brianhanson2nd](#comment_57_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE): An armed society is a polite society.Go out and buy yourself some guns and ammo.\n\nThose that lived in the wild west would beg to differ",
				"added": 1591848782
			}
		],
		"1591776814_1EisAdDMyEXWtPiKWM8t4wme5yXX1q9552": [
			{
				"comment_id": 124,
				"body": "Just block him maybe?",
				"added": 1591848596
			},
			{
				"comment_id": 136,
				"body": "Nah keep Trump's twitter open. It's the only way we get to see him put his foot in his mouth everyday",
				"added": 1592019049
			},
			{
				"comment_id": 138,
				"body": "> [smegma](#comment_2_15g72KYgiV72kHQbS8PgVGPqxh2qqZAgjR): It's kind of funny how the American media does everything in their power to make the people hate trump and aren't seen as an enemy of the state. I thought there would be less of you retards on here. This kind of posting is literally all the clearnet is.\n\nTrump has been hated by the media etc for a LONG time. The fact that he's president doesn't change that.\nClearnet, Zeronet, whatever. you're going to find the same people. except here freedom of speech is king",
				"added": 1592191980
			},
			{
				"comment_id": 141,
				"body": "Minds.com",
				"added": 1592278521
			}
		],
		"1591828065_1gn57j2UokAkXvA1VyhkHvKZvg59RoXuW": [
			{
				"comment_id": 126,
				"body": "Y B NORMAL",
				"added": 1591849174
			},
			{
				"comment_id": 130,
				"body": "Because all the people in control will point fingers at each other and vilify each other. And you will believe them.",
				"added": 1591933904
			}
		],
		"1591900871_19Nh4E7nU8DstH29eriZNvAxg6nHuXCrqk": [
			{
				"comment_id": 127,
				"body": "Right now? Look in the past. Humans don't like each other much. Most you can do is live your life",
				"added": 1591931818
			},
			{
				"comment_id": 133,
				"body": "> [getit](#comment_2_19Nh4E7nU8DstH29eriZNvAxg6nHuXCrqk): what world do you live in??\n\nTo be fair, things have been worse.",
				"added": 1592018923
			},
			{
				"comment_id": 134,
				"body": "> [cexy](#comment_33_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): Only when they are brainwashed.\n> [thorburn](#comment_86_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): I have no idea what is that you're trying to say? [...]\n\nSame thing happens every pandemic. Turns out germs aren't real",
				"added": 1592018981
			}
		],
		"1591900169_1NMBe5SUr5hbYNTzBMuvdBCAxQ81ivWzeL": [
			{
				"comment_id": 128,
				"body": "Same as issues with Freenet. No censorship means all the shit is here. You just have to watch where you step.",
				"added": 1591931986
			},
			{
				"comment_id": 132,
				"body": "Shit, many of the porn stars of the 70s and 80s were minors. It starts to get hard to tell after about 14 or so. There's 20 year olds that look like 13 and 13 year olds that looks 20.",
				"added": 1592017489
			}
		],
		"1591795514_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": [
			{
				"comment_id": 129,
				"body": "> [commandantecero](#comment_53_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro): Go in there, give them 1 hour to vacate, and then gun them all down.\n\nSounds like something a true dictatorship would do",
				"added": 1591933511
			},
			{
				"comment_id": 142,
				"body": "> [bigbadbob](#comment_1088_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Do people actually have jobs or is this just another tent city?\n\nWhy do they need jobs? Job is Just Over Broke. They'd be better off working for themselves",
				"added": 1592278652
			}
		],
		"1591167020_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": [
			{
				"comment_id": 131,
				"body": "Go to the temple and flip over the money changers tables. Wait for the Romans to come. Boom! Crucified.",
				"added": 1592016519
			}
		],
		"1591924953_1gn57j2UokAkXvA1VyhkHvKZvg59RoXuW": [
			{
				"comment_id": 135,
				"body": "We should've just kept the Articles of Confederation",
				"added": 1592018996
			}
		],
		"1592157079_1LZUsLPdv5RUx1VVGP81RyKwiHTfSxgSL1": [
			{
				"comment_id": 137,
				"body": "What is love? baby don't hurt me. don't hurt me no more.",
				"added": 1592191852
			}
		],
		"1592177248_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": [
			{
				"comment_id": 139,
				"body": "That only works on The Simpsons",
				"added": 1592192380
			}
		],
		"1592059237_1QPc2ZGPDgxrTJc4jMdEH4XrEb7gQBs4t": [
			{
				"comment_id": 140,
				"body": "Before Google and Facebook it was slower. because we were on 14.4k modems",
				"added": 1592193212
			}
		],
		"1592432175_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 143,
				"body": "> [pharaon](#comment_2_1gn57j2UokAkXvA1VyhkHvKZvg59RoXuW): Safe for the jew, that it is.\n\nYeah, cause only jews would want to block child porn",
				"added": 1592451962
			},
			{
				"comment_id": 147,
				"body": "> [brianhanson2nd](#comment_62_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE): I don't think they would. You know what the rabbi do to baby boys after they are circumcised right???\n\nMost don't do that anymore. Did you know the Vatican didn't consider a person a minor over 14 years old until December 2019? That would mean according to the Catholic church, a 14 year old was fair game",
				"added": 1592712039
			},
			{
				"comment_id": 148,
				"body": "> [styromaniac](#comment_2363_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): http://127.0.0.1:43110/zeromeluna.zn/?Post/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd/1590884101\n\nI'm prolly missing whatever passes out the .zn addresses but I can't get to that",
				"added": 1592798125
			}
		],
		"1592521813_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 144,
				"body": "Would a dino be furry or leathery? Or feathery?",
				"added": 1592531377
			}
		],
		"1592460872_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji": [
			{
				"comment_id": 145,
				"body": "it would be interesting if something like nextcloud could be implemented on zeronet",
				"added": 1592531557
			}
		],
		"1593359750_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 151,
				"body": "> [scotcyguy2](#comment_42_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX): That's one interpretation....or he's been heavily investing in big pharma for years and using his wealth to push big pharma solutions into third world countries for profit. [...]\n\nGive him huge amounts of money? that he intends to donate most of? yeah, makes sense",
				"added": 1593405811
			},
			{
				"comment_id": 152,
				"body": "> [glosrozsadku](#comment_7_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG): Windows 10 is embarassing. Fuck you, willie.\n\nI'm fairly sure he left before 10. But I don't think before the disaster of Vista lol",
				"added": 1593667294
			}
		],
		"1593637021_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 153,
				"body": "Can this be routed through on a localnet like tor or zeronet?",
				"added": 1593669539
			}
		],
		"1594185414_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 154,
				"body": "No Pity for the Majority",
				"added": 1594266308
			}
		],
		"1594225869_1FYnqRnNx4xbmec3dhwMaq1aE8WCqAVPHL": [
			{
				"comment_id": 155,
				"body": "I used to know a guy who made really good money selling drugs. If you know a good distributor you could try that. Just stay away from the law and competition..",
				"added": 1594267024
			}
		],
		"1594047986_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 156,
				"body": "Considering Zeronet is his baby he should have a bug report system on Zeronet",
				"added": 1594441798
			}
		],
		"1595194844_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": [
			{
				"comment_id": 157,
				"body": "why does it use resources from clearnet?",
				"added": 1595302055
			}
		],
		"1594607040_1BBu2iPW8AneVKE5SecmYytsgSectqxGdL": [
			{
				"comment_id": 158,
				"body": "Is every company going to have their own coin??",
				"added": 1595471585
			}
		],
		"1595746827_192xAupujZXB6jpoWqpwobPnEdQovAKiXc": [
			{
				"comment_id": 159,
				"body": "You realize most of the work is done by the House and Senate. Trump is jump a mascot.",
				"added": 1595821203
			}
		],
		"1595861716_1BjmA3jeeStMXDjordfpDvk75HaWCUWuVn": [
			{
				"comment_id": 160,
				"body": "Actually is was probably mostly Spanish. but since there was technically a slave trade before then, it just became expanded to the new world",
				"added": 1595906370
			}
		],
		"1595854660_1BjmA3jeeStMXDjordfpDvk75HaWCUWuVn": [
			{
				"comment_id": 161,
				"body": "zips? containing what? viruses?",
				"added": 1596080117
			},
			{
				"comment_id": 162,
				"body": "zips? containing what? viruses?",
				"added": 1596080319
			}
		],
		"1596284934_12BoU1NpWC9niVqBeRueg6Mox5PehgjEU9": [
			{
				"comment_id": 163,
				"body": "Swine flu killed maybe 500k",
				"added": 1596339923
			},
			{
				"comment_id": 165,
				"body": "> [legends](#comment_5_12BoU1NpWC9niVqBeRueg6Mox5PehgjEU9): True\n\nNot true. Vaccines save lives. They're prolly why you're still alive",
				"added": 1596427233
			}
		],
		"1596269492_1ETarTu7fyokpgRoBMiGZc8L3FwnDTGstL": [
			{
				"comment_id": 164,
				"body": "So basically trust no one. Not even yourself. Got it",
				"added": 1596340123
			}
		],
		"1596593236_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": [
			{
				"comment_id": 166,
				"body": "Seems to have been a fireworks warehouse.. so maybe Bart Simpson?",
				"added": 1596597646
			},
			{
				"comment_id": 167,
				"body": "I initially read fireworks. Apparently the fireworks set off the fertilizer. Both were being illegally stored at the port. Bart Simpson either way :D",
				"added": 1596684342
			}
		],
		"1596649883_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 168,
				"body": "Must be something fucky. Noscript keeps blocking all kinds of shit",
				"added": 1596684992
			},
			{
				"comment_id": 169,
				"body": "> [0mega](#comment_2_192xAupujZXB6jpoWqpwobPnEdQovAKiXc): right wing trump tiny dick sucking content. Stick to fox news and infowars ya fucking piece of shit. When trump is assassinated don't cry too much, shit fly\n\nI'm pretty sure if Trump was going to be assassinated the time bandits would've made it here by now to do it",
				"added": 1596943656
			}
		],
		"1596497359_12kkzRK2n9vRvQLcycbGZNsD3vqzWe1Jeh": [
			{
				"comment_id": 170,
				"body": "> [planespherev4](#comment_31_1KSMTkAKXzbiXa7d2HWy3rNVSUJDXExpXg): Meme answer.\n\nTrue answer",
				"added": 1596943745
			}
		],
		"1596865203_1EdFvRMCSsjRQDSwKEaYDu3aU2o5PfzhrX": [
			{
				"comment_id": 171,
				"body": "Are you implying that all zn users must far right wing wackos?",
				"added": 1596943885
			},
			{
				"comment_id": 173,
				"body": "> [thorburn](#comment_97_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): @zaron, do you seriously expect an answer to such a retarded question?\n\nI think you just did",
				"added": 1597023257
			},
			{
				"comment_id": 174,
				"body": "> [thorburn](#comment_99_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Why point ZN users to the WHO website? The WHO is available on the clear net and it's part of the problem ffs!\n\nWhy point ZN users to the bitchute website? bitchute is available on the clear net and it's part of the problem ffs!",
				"added": 1597115879
			}
		],
		"1596608855_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": [
			{
				"comment_id": 172,
				"body": "Was it ever actually proven that the CCP gets anything from TikTok?",
				"added": 1597023243
			}
		],
		"1597038290_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2": [
			{
				"comment_id": 175,
				"body": "> [zerolady](#comment_14_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p): Information for new comers, some people may come to Zeronet, and post nonsense.  Those messages can be filtered by a special function.Quasi-administrator’s customization of ZeroNet For example, go tohttp://127.0.0.1:43110/zeroid.bit/search userIDedgelordofdecentthen click “mute user”, and confirm.Nonsense information will not be displayed then.\n\nIf you truly want no censorship you'll censor noone",
				"added": 1597196532
			}
		],
		"1597510687_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": [
			{
				"comment_id": 176,
				"body": "It's still there. must be fake",
				"added": 1597543690
			},
			{
				"comment_id": 177,
				"body": "Remember this is all for entertainment only",
				"added": 1597809398
			},
			{
				"comment_id": 181,
				"body": "> [otbtechnologies](#comment_66_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd): Again, as I mentioned in the other thread, IGNORE THESE SUBHUMAN FUCKS! [...]\n\nAnyone that disagrees with you is a subhuman fucks? Wow. such intelligence",
				"added": 1597983357
			}
		],
		"1597847864_15HwpjShZKp2dpMuZqFaariQtJvMawYLVq": [
			{
				"comment_id": 178,
				"body": "All censorship is bad!  \n<someone starts posting child porn> \nCensor that shit! You see the problem is there has to be some censorship or moderation at some point. It's not tyranny. It prevents anarchy",
				"added": 1597894834
			}
		],
		"1594305760_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 179,
				"body": "> [vcrovuep4lnye2b9](#comment_5_1JHhs98RB4734pGx6sL9i88ATF7GF2d1Ex): That is what happens when Supreme Court Justices are mostly far left wing.   Perhaps because nearly all US States are broke they simply don't want the responsibility and push it back on the native Americans (Indians) ...  Wait until a great many other native tribes start claiming land...  Good bye USA!\n\nThe Supreme Court is currently 5 red and 4 blue. You mind trying again?",
				"added": 1597895565
			},
			{
				"comment_id": 180,
				"body": "> [itspecialist876](#comment_10_1NyRWK8Lnvfh58CyJhq1tAXpSr9XXhdLwG): Alot of stuff going on right now is geared towards dividing America. Divide and conquer.\n\nYou should've been there in the 1800s. They really were trying to divide the country",
				"added": 1597895602
			}
		],
		"1598036610_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 182,
				"body": "Prolly related to them linking Facebook messenger and Instagram chat",
				"added": 1598068060
			}
		],
		"1598242145_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF": [
			{
				"comment_id": 183,
				"body": "Q is a troll. that's what it is",
				"added": 1598326965
			}
		],
		"1598405387_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb": [
			{
				"comment_id": 184,
				"body": "A bunch of bois circle jerking is meaningless. How do we know you're not all the same person?",
				"added": 1598412367
			},
			{
				"comment_id": 185,
				"body": "Communists fight socialists, socialists fight capitalists. Who are you?",
				"added": 1598503224
			}
		],
		"1598581805_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e": [
			{
				"comment_id": 186,
				"body": "hey! how did my name get in the middle of this?",
				"added": 1598673128
			}
		],
		"1598631792_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 187,
				"body": "The first time I heard of Pizzagate I thought it was about pineapple on pizza lol",
				"added": 1598673403
			}
		]
	},
	"comment_vote": {}
}