{
	"posts": [
		{
			"id": "0fef4ff8-081e-44fe-a735-91db81626666",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "970aea10-19b2-473a-9ed1-da6aea653c7b",
			"body": ">>4cbeda5e-32d6-4679-80a7-416cabdca96d\nDon't do that lol. There's no way to prove that you deleted the key, and any attempts at censorship should be fairly transparent anyways, because you would have to blacklist posts in some publicly accessible way, especially if you move over to non-minified javascript based on open source code. That should allow for fairly deterministic compilation (https://en.wikipedia.org/wiki/Reproducible_builds), and make it possible to easily explain any differences between what the javascript code for the zite is and what it should be based on the openly available source code.\nThe \"but someone should have the power to modify the code making the whole system works to make improvements\" weakness of distributed networks is one that's almost impossible to solve. Even the Tor developers theoretically have the power to censor people by pushing software with blacklists. They just don't because they're nice guys.\nThe way to work around it if they did would be to fork the project.\nWith ZeroNet forking a site is kinda difficult because as far as I know there's no way for a zite to be based on another zite's already downloaded data, but there's no rule saying such functionality couldn't be added to it.\n\n>>793ed090-0829-4842-be23-fd8cd0dcfcaa\nYou're overthinking it. If the update breaks something, then you can always go back, unless you break it so hard that the update mechanism stops working. Which should be basically impossible, as that's handled by ZeroNet proper and not Millchan.\nAt most just find some way of enabling \"anonymous mode\" by default and port over the old CSS. I've seen multiple people complaining about the names, only one user expressed a weak preference for the old CSS, and another actually liked the new looks.\n>It appears that Millchan changed their entire file structure to accommodate their new additions.\nIf you mean the user files, that can't be the case, otherwise the board wouldn't work at all when monkey patching the code on the client side. If you mean the source tree, sure.",
			"time": 1565758658200,
			"files": "[]"
		},
		{
			"id": "f432ce7d-597b-45dd-860d-fff825d08d16",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "aba4ac79-aaa3-4b4f-97a0-4f780a322074",
			"body": ">>a930ffb9-5101-428a-a549-7854eaa59788\nSomebody upload the pasta of the guy who lived in worlds.com 24/7",
			"time": 1565761266900,
			"files": "[]"
		},
		{
			"id": "a7f9e310-40d0-4611-9d13-73ca336691b1",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "970aea10-19b2-473a-9ed1-da6aea653c7b",
			"body": ">>4fed792e-2da1-40b3-9779-95ee19d17cef\n>I lean towards no on patching up to another projects development path.\nYou are also a retarded QBoomer, so your opinion literally doesn't matter.\n>The swelling user-base we have here is going to bring with it many brilliant minds.\nYou've never done any software development. You have no idea what kind of skills and time investment doing what you are proposing would take. You just saw the admin was hesitant to update, and decided to be a good cock sucker and jump on the bandwagon.\nYou are the worst kind of imageboard dweller. The kind that would suck as much dick as necessary to be given a scrap of power **and become a jannie**.\n>And it already seems to be a solid majority opinion that namefagging should be something that you have to OPT IN to, not something that is a requirement to participate.\n>So, that would need to be adjusted in the millchan patch, right off the bat.\n>And as famefaggy of a perspective as it is, going with the millchan patch for the whole zite would basically make this place more like 'the other' millchan, than 08chan.\nNewsflash. It already is, dumbass. Where do you think the code this imageboard is running on comes from? That's right, a really old version of Millchan. You are already a namefag, it's just that you're so retarded you probably don't even know it.\n>(I assume that is not to difficult, but still, I prefer that we develop this ourselves)\n<LARPing\n>>96a274fd-e71d-47e2-84bd-96354eb5a68d\nYou were trying to upload files that aren't supported by the board. You'd know that if you were using Millchan, because it tells you the file is not supported instead of hanging on processing files forever like a retard.\n>I have attempted to transfer the data file out of the 08chan directory in my ZeroNet file location into a brand new instance, and for some reason I couldn't get the new instance to recognize the content pasted from the old instance.\n>I am obviously retarded and doing something wrong, because it appears this is an intended feature;\nIt's perfectly possible to do it. You're just retarded.",
			"time": 1565761240641,
			"files": "[]",
			"last_edited": 1565761442679,
			"subject": null,
			"capcode": null
		},
		{
			"id": "791ea56c-5cf1-4ce1-8bc0-76ea1b9fdc89",
			"directory": "users/17wVyfuXoQmWbo8pMvzWx7iSNdA3446NdF",
			"uri": "misc",
			"thread": "44c736d6-6830-434e-86ab-b9389483b2dc",
			"body": ">>6447000c-aa49-4e6c-aecc-f68373b9a7d7\nInteresting. Tor has variable route length too (although you have to open multiple processes if you want different settings at once).",
			"time": 1565764809068,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}