{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1598185671,
			"title": "2 + 2 = 17 ?",
			"body": "#HackThePlanet\n\nhttps://www.history.com/news/what-was-operation-paperclip\nhttps://military.wikia.org/wiki/Operation_Paperclip\nhttps://www.history.com/topics/us-government/history-of-mk-ultra\nhttps://rationalwiki.org/wiki/MKULTRA\nhttps://en.wikipedia.org/wiki/Unethical_human_experimentation\nhttps://kurtnimmo.blog/2020/04/18/covid-19-and-the-qanon-psyop/\nhttps://www.thetruthseeker.co.uk/?p=211962\nhttps://humansarefree.com/2020/08/new-zealand-to-put-covid-19-patients-into-mandatory-quarantine-camps.html\n\nDoes 2 + 2 = 17 ?\n\nOr is this some alternative dimension of reality where history neither exists nor repeats?\n\n#FollowTheWhiteRabbit\n#WakeUpAmerica\n#WWG1WGA\n#QArmy",
			"added": 1598185670
		},
		{
			"topic_id": 1603147210,
			"title": "Biden Calls Media BLACKOUT Until Thursday - The Democrats are WORRIED!",
			"body": "I've been explaining it to people all year as things unfolded and the swamp began fighting back against us, but NOW the cat is truly out of the bag and the Democrats are WORRIED!\n\nJoe Biden's connections to China are being exposed, and his campaign doesn't know what to do now!\n\nThey tried to censor discussion about this on Twitter and Facebook in a last ditch effort to limit the damages, but it only made the leftists look even worse as a result! Any time Joe Biden is asked about the expose he avoids the topic; his campaign made claims that it was a disinformation campaign  by Russia to favor Trump. However, this claim was promptly exposed by the Director of National Intelligence as a blatant lie by the Democrats to try to sway public opinion back in their favor!\n\nhttps://theblacksphere.net/2020/10/biden-calls-media-blackout-until-thursday/\nhttps://infosurhoy.com/news/twitter-blocks-sharing-links-to-nyposts-hunter-biden-emails-story-invoking-hacked-materials-policy-for-first-time-ever/\nhttps://floridianpress.com/2020/10/biden-answers-hard-hitting-question-about-milkshakes-runs-away-when-asked-on-hunter-biden-inquiry/\nhttps://madworldnews.com/adam-schiff-hunter-biden-laptop/",
			"added": 1603147208
		}
	],
	"topic_vote": {},
	"next_comment_id": 19,
	"comment": {
		"1598185671_1V2NizfDpQK4UxTp54zsm9AtkWeSv2BXe": [
			{
				"comment_id": 1,
				"body": "bump! ^_^",
				"added": 1598227478
			}
		],
		"1597510687_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": [
			{
				"comment_id": 2,
				"body": "> [kapec](#comment_29_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): No, as I said I'm being suspicious.For me being suspicious is a part of being careful. There's nothing wrong with being careful now is it? [...]\n\nTag! You're it! :)\n\nGood job boys!!!\n\n@WWG1WGA\n@otbtechh22f4wcuo\n@OTBTechnologies\n@OTBTechnologies3\n@OTBTechnologies7\n\n#Psycho #NutJob #Insane #Crazy #MentallyIll #Deranged #Neurotic #Delusional #ConspiracyTheorist #Whacko #Bonkers #Loopy #Foolish #Mental #Screwy #FuckedUp #ScrewedUp #HasAFewScrewsLoose #MadAsAHatter\n\nNow, can you imagine trying to prove to an entire country that you are in fact #NotCrazy when the system is designed to make you look insane when you expose the truth? That's a pretty shitty situation right?\n\nWhat if I told you Donald Trump, in some sense, saved our lives by making people realize that we were not \"crazy,\" but rather we were smarter than your Average Joe...? So now, instead of having our lives threatened by the Satanists that have controlled this country for a very VERY long time, we are revered as heroes among our fellow Americans..\n\nWhat say you now fella?\n\n#TheGreatAwakening\n\nP.S. They've already tried to kill me once....\n\nHave you ever been hit by a Ford F-250 that was going 50+ miles per hour while you were riding a bike?\n\nDid God ever speak to you and tell you to move \"a few inches to the right\" moments before you were hit by that truck?\n\nNo...? Weird... I have... If God didn't tell me to get over a few more inches, then (according to the doctors) I would probably have died... Oh, did I mention the text message I got that read, \"We're Watching You...\" moments after leaving the hospital where I was being treated for my injuries? Oh, and did I mention all the Satanic symbols it contained? No.\n\nSure I did... Just now :)\n\n#WWG1WGA",
				"added": 1598228497
			},
			{
				"comment_id": 3,
				"body": "The 1976 Church Committee report found that, in the MKDELTA program, \"Drugs were used primarily as an aid to interrogations, but MKULTRA/MKDELTA materials were also used for harassment, _discrediting_ or disabling purposes.\"",
				"added": 1598229838
			},
			{
				"comment_id": 4,
				"body": "Feel free to inquire with the #FBI for more information regarding what was done to me...\n\nI reported everything to them...\n\nThe culprit running the operations that I brought to light to the police literally \"vanished\" weeks later according to one of the culprit's associates who I later contacted to ensure the job was done so to speak... #CIA #NSA #FBI :)\n\n#MakeAmericaFreeAgain",
				"added": 1598229975
			},
			{
				"comment_id": 5,
				"body": "> [dietznuts](#comment_2_1N4DrYgNWGNwYAvzatbyveU1QuMNyteCk1): Yes, unfortunately though, the reverse engineering process that took place was questionable morality wise. [...]\n\nAlso, take into account that was well over 7 years ago...\n\nAnd, besides, I believe that part of my programming was to do the \"reverse engineering\" as you described it...\n\nThe Nazis knew very well what they were doing and the US Government definitely did a great job at refining the work of the Nazi Scientists... Sigh... I really hope the Fourth Reich ends a little better than the Third Reich though... :'(\n\nIt was a MIND CONTROL PROGRAM that aimed to GET PEOPLE TO PERFORM ACTIONS UNWITTINGLY...\n\nSo, I don't know man... Does 2 + 2 = 17?...\n\nOr, is this in fact an alternative reality in which history neither exists nor does it repeat?\n\nSorry Folks....\n\nhttps://www.cia.gov/library/readingroom/search/site/MKultra\n\n#Boom\n#MicDrop",
				"added": 1598234344
			},
			{
				"comment_id": 6,
				"body": "> [wwg1wga](#comment_52_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF): Are you the guy everyone has been talking about who reverse engineering the CIA?!?!?! [...]\n\nLol, is the Space Pope reptilian?\n\n#BishIMightBe\n#Gucci\n\nhttps://en.wikipedia.org/wiki/The_Art_of_War",
				"added": 1598238192
			}
		],
		"1598405387_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb": [
			{
				"comment_id": 7,
				"body": "> [dietznuts](#comment_5_1N4DrYgNWGNwYAvzatbyveU1QuMNyteCk1): Vote for OTB or you ain't black... xD [...]\n\nLOL! Got 'em!\n\nHahahaha ^_^\n\nhttps://OTB-Technologies.com\n\n#OTB4PreSid3nT\n#MakeAmericaFreeAgain\n#BLMisATerroristOrganization",
				"added": 1598475710
			},
			{
				"comment_id": 8,
				"body": "> [kapec](#comment_33_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): Cool samefaging m8.\n\nP.S. Samefagging is when you have no audience, however if you look closely, you will see that otbtechh22f4wcuo's previous posts have had some pretty good reception. Some better than others, but regardless he still accomplished his goals. One of which was to piss off/annoy the communist fucks that linger here on ZeroNet such as yourself.\n\nSo thank you...\n\nThank you very much! ^_^",
				"added": 1598475928
			},
			{
				"comment_id": 9,
				"body": "> [kapec](#comment_35_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): I'd say you're not very intelligent to majority of us on zeronet. [...]\n\nLmfao! This fuckboy doesn't even understand how a publicity stunt works! xD\n\nHere, let me help...\n\n\"In marketing, a publicity stunt is a planned event designed to attract the public's attention to the event's organizers or their cause. Publicity stunts can be professionally organized, or set up by amateurs. Such events are frequently utilized by advertisers, and by celebrities who notably include athletes and politicians.\" --DietzNuts",
				"added": 1598563672
			}
		],
		"1601914818_1HtdMXVRbEqpADNig6MvbCLQjuNzwDZHYg": [
			{
				"comment_id": 10,
				"body": "hello interpol?\n\nyes, i would like to report yet another incident of suspected human trafficking.",
				"added": 1602126582
			}
		],
		"1602100079_1L8aDU3W6ecnjZDQURTV7d5tx9aXjMybrS": [
			{
				"comment_id": 11,
				"body": "You're late to the party, but thanks! :)\n\nhttps://storj.io/",
				"added": 1602214970
			}
		],
		"1602349275_1PZGm95frq3d9vSuQCNWdGbvC3G6TzRGa7": [
			{
				"comment_id": 12,
				"body": "> [weatheralex1](#comment_2_1PZGm95frq3d9vSuQCNWdGbvC3G6TzRGa7): ?\n\nIdk what he's got in mind for you, but be warned this is where some pretty shady people can lurk.\n\nSo, just be careful since he's asking you to direct message him.\n\nFair warning lol\n\nAs far as what can do. Lots.\n\nCheck out https://privacytools.io before all else if you have not yet done so please and thank yourself.",
				"added": 1602351863
			},
			{
				"comment_id": 18,
				"body": "> [edgelordofdecent](#comment_667_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Guy named qarmy. No wonder I am not seeing his posts. He was one of otbtechnologies's alts, yes?\n\nGreat. So now I am part of the stupid krombopulusmike conspiracy theory?\n\nTerrific, just what I wanted!\n\nHeh.",
				"added": 1603337599
			}
		],
		"1602257402_1abBjBW8axFAtcZN11jv527Wi2noBZurv": [
			{
				"comment_id": 13,
				"body": "> [ksnde](#comment_5_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji): Help to Trump and Q.\n\nYes, please help.\n\nThank you!",
				"added": 1602352100
			}
		],
		"1598581805_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e": [
			{
				"comment_id": 14,
				"body": "conspiracy theories are hard to kill.\nideas are bulletproof.\nyou cannot kill an idea.\n\nonce a conspiracy theory like this begins to propagate whether intentionally or non-intentionally, the person who created the theory then is immortalized in a sense. Its sort of like how ZeroNet works based on distributed servers all serving the same content making it so that it is damn near impossible for a government take-down to be effective if traditional means are used. In the sense of a conspiracy theory, extremist beliefs and opinions can then become attached to the core components of the theory which will lead to potential political gain for the original author.\n\nFor example's sake: https://www.isdglobal.org/isd-publications/investigating-natural-news/",
				"added": 1602644385
			}
		],
		"1603147210_1V2NizfDpQK4UxTp54zsm9AtkWeSv2BXe": [
			{
				"comment_id": 15,
				"body": "> [ksnde](#comment_14_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji): Why only thursday?\n\nThat's the date of the next Presidential Debate, and it will be interesting to see how the Mainstream Media tries to spin this in his favor since we all know they always work in favor of the Leftists. Regardless, we will continue to expose him even if the Mainstream Media tries to twist things around. His campaign can no longer save him.\n\n> [ksnde](#comment_17_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji): How I can contact with you? Is it true about unclassified identity of Q and block his site?\n\nContact can be done via ZeroMail a this time. I do not prefer to communicate outside of this network for the sake of security. As far as the \"unclassified identity of Q and block his site,\" I will assume you mean Qmap.Pub being linked to an executive of Exxon Mobile which is likely the identity of the individual in control of this resource. In terms of who actually is in control of Q at this time though, there is no 100% way to be certain due to the level of anonymity that is always in place regarding the identity. There are many logical deductions, but nothing beyond a reasonable doubt. So, at this time, no matter what people claim there is no way to be 100% certain of who is controlling the character Q. For more information, contact via ZeroMail. Thank you!",
				"added": 1603295582
			},
			{
				"comment_id": 16,
				"body": "> [ksnde](#comment_20_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji): I can't to sent message to you in ZeroMail, but I have an one idea.Read this please first (Pubmed): https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2597487/And remeber about lection of Bill Gates for Pentagon about God gene. VideoAnd that the point! They want to impact to God gene for making people zombies. Nanoparticles used for transfer genes connecting to neurons! = Controlled consciousness.(sorry for my english)\n\nCannot connect to the video, but it sort of makes sense to an extent.\n\nI mean they already try to calcify the pineal gland and make people confused due to fake religions instead of teaching true religion and spirituality, so this is not too far fetched to believe though proper evidence is lacking.\n\nAlso, why not just do it with a zombie virus though if this is the case? It would be much easier than with nanoparticles.",
				"added": 1603337139
			}
		],
		"1603297511_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": [
			{
				"comment_id": 17,
				"body": "Cannot connect to the video, but it sort of makes sense to an extent.\n\nI mean they already try to calcify the pineal gland and make people confused due to fake religions instead of teaching true religion and spirituality, so this is not too far fetched to believe though proper evidence is lacking.\n\nAlso, why not just do it with a zombie virus though if this is the case? It would be much easier than with nanoparticles.",
				"added": 1603337208
			}
		]
	},
	"comment_vote": {
		"3_1DFBWoEHaYgbjX4sATAH8vpn5AgiutX8tH": 1,
		"4_19uAt7evT6ejhbTih1UTvPokD9KrBQ4RnY": 1,
		"4_1abBjBW8axFAtcZN11jv527Wi2noBZurv": 1,
		"5_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": 1,
		"1_18hoZQZsweaLpw7nB9wJkqVA9ZSkbSAeQp": 1,
		"1394_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1395_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1_1DwXAyvPbc3Uvc5bW3o2JTkisHPYBxtJRC": 1,
		"7_1N4DrYgNWGNwYAvzatbyveU1QuMNyteCk1": 1
	}
}