{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1613124829,
			"title": "Koniec 0net-proxy.pl",
			"body": "\"Prawie rok temu został uruchomiony [serwis](http://127.0.0.1:43110/krzotr.bit/?Post:17) 0net-proxy.pl. Patrząc na statystyki odwiedzin to 98% ruchu pochodzi ze Stanów Zjednoczonych i są to niemalże same boty. Tylko 1% to ruch z Polski.Dla takiego małego procenta według mnie nie warto utrzymywać serwisu. Wygodniejszym rozwiązaniem jest pobranie klienta ZeroNet, poczekanie na synchronizację i przeglądanie zasobów.\" [krzotr.blog](http://127.0.0.1:43110/krzotr.bit/?Home)",
			"added": 1613124828
		},
		{
			"topic_id": 1615281374,
			"title": "Brave: znowu niefajnie: założyciel posądzany.",
			"body": "Współzałożyciel i prezes Brave broni się przed zarzutami nieuczciwości pisze [coinspice.io](https://coinspice.io/news/brave-co-founder-ceo-defends-against-charges-of-dishonesty-no-innovation-freeloading/) 15 Gru 2019.\n\"Za pomocą Brave\", Amerykański adwokat Matthew Butterick argumentował, \" Pan Eich chce zrujnować moją pracę - i każdego innego twórcy, który nadal wspiera to, co pozostało z Internetu bez reklam—tak, aby on (i jego inwestorzy venture) mogli czerpać zyski. Jak? Umieszczając reklamy na mojej stronie bez reklam, przekonując internautów, że są częścią jakiejś cnotliwej nowej gospodarki.” Wspomniany Brendan Eich jest też twórcą `JAVASCRIPT`.\n...\nButterick twierdzi, że Brave \"celowo utrudnia\" możliwość wykrywania takich reklam, jak stosowane do witryn on-celowych, które chcą zapewnić swoim czytelnikom doświadczenie bez bycia reklamowanym. Butterick uważa, że \" wielu wydawców chciałby zrobić to samo—zadbam o to, aby każdy użytkownik Brave zobaczył to jako swoją stronę docelową [(zobacz wyróżniony obraz)]. Bo zasługują, by wiedzieć, że Brave to bzdura.”\n\nAdwokat i twórca treści podkreśla, że wydawcy online mają już do dyspozycji to, co Brave zasadniczo próbuje rozwiązać: jeśli witryny chcą zarabiać więcej, mogą zdecydować się na reklamy, a ich użytkownicy z kolei zdecydują, czy to dobra decyzja. \"Hej, ja też nie lubię tych reklam. Chociaż jestem sceptyczny, żeby blokowanie ich robiło wiele dobrego w ogóle \" - wyjaśnił Butterick. Dalej podkreśla, że wszystkie przeglądarki mają dostępne wtyczki blokujące reklamy, ale \" Brave jest pierwszym, który wypowiedział wojnę totalną gospodarce reklamowej w Internecie.”\n...\nEich Odpowiada\nZasadniczo Butterick podkreśla, że Eich i jego biznes niszczą jedną stronę gospodarki internetowej, aby wspierać własną, i nie ma innego powodu, niż opłacanie inwestorów Brave, promując swój token, BAT. Uważa, że Brave jest łatwy do rozgrywania, do oszukańczego użycia i ostatecznie zawiedzie w kwestii ekonomii.\n\nDo tego ostatniego punktu Eich przyznał w odpowiedzi: \"wyeliminowaliśmy toksycznych pośredników śledzenia w sposób domniemany bronionych przez Butterick, pozwalając jednocześnie użytkownikom wybierać lepsze prywatne modele przychodów, aby wspierać ich najlepszych twórców. Jeśli nasze stałe opłaty, < = użytkownik dostaje, nie wystarczy, aby utrzymać nas, zginiemy. Jak dotąd żyjemy i rozwijamy się.”\n\n`Tłumaczenie translate.yandex.com`",
			"added": 1615281372
		},
		{
			"topic_id": 1631358855,
			"title": "Iluzja",
			"body": "\"Iluzja będzie to tak wielka, tak rozległa, iż tego nie spostrzegą.\nCi którzy to spostrzegą zostaną uznani za wariatów. \nStworzymy oddzielne fronty, aby nie dostrzegli związku między nami.\nBędziemy się zachowywać jakbyśmy nie mieli nic wspólnego aby utrzymać iluzję.\nNasz cel będzie realizowany kropla za kroplą, aby nigdy nie wzbudzić podejrzeń.\nTo uniemożliwi im spostrzeżenie zmian gdy będą się działy.\n\nBędziemy pracować razem zawsze i pozostaniemy związani krwią i sekretnością.\nŚmierć przyjdzie na tego kto mówi.\nBędziemy utrzymywać ich życie krótkim, a ich umysły słabymi udając, iż jest odwrotnie.\nBędziemy używali naszej znajomości nauki i technologii subtelnie, aby nigdy się nie zorientowali.\"\n\nCytat na dzisiaj. Jakie macie refleksje?",
			"added": 1631358852
		}
	],
	"topic_vote": {
		"1616836050_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": 1,
		"1617137397_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"1616980579_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"1618103384_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"1606360383_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"1618726346_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": 1,
		"1618429064_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": 1,
		"1618368827_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": 1,
		"1619237581_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": 1,
		"1618579779_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": 1,
		"1618791207_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": 1,
		"1618366115_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": 1,
		"1619526269_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": 1,
		"1619880888_1CfWNmALwroEPSsRqZrrdFcatYizitZ6r3": 1,
		"1615135071_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": 1,
		"1608757149_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": 1,
		"1607453657_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"1604624997_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"1620662392_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"1620994683_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"1621638953_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": 1,
		"1622292811_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"1622035388_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": 1,
		"1621854532_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": 1,
		"1621774948_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": 1,
		"1621674323_1MUXpeXL4m6WZ6JDgCUfSvQerJopfLxCM6": 1,
		"1622035903_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": 1,
		"1622418520_1MUXpeXL4m6WZ6JDgCUfSvQerJopfLxCM6": 1,
		"1621556211_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": 1,
		"1618538921_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": 1,
		"1622818687_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": 1,
		"1623926456_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": 1,
		"1625955253_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": 1,
		"1623191172_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": 1,
		"1625871045_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": 1,
		"1623615171_193fCp5MWKjfmbNuSd5thzbfDsCj5whHTQ": 1,
		"1626053945_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": 1,
		"1624997273_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": 1,
		"1626571418_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": 1,
		"1627522666_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": 1,
		"1627505214_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": 1,
		"1627502800_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": 1,
		"1626904569_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": 1,
		"1626719398_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": 1,
		"1626943982_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": 1,
		"1624223308_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": 1,
		"1628313902_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": 1,
		"1628512255_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": 1,
		"1629763452_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": 1,
		"1610339813_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": 1,
		"1633712778_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": 1,
		"1633477933_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": 1,
		"1632945787_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": 1,
		"1632379028_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": 1,
		"1620938699_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": 1,
		"1634582490_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": 1,
		"1635374346_1EYjF4EgbCCDsCxtVFTNAUJVBckvPeByx6": 1,
		"1636101927_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": 1,
		"1636109745_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": 1,
		"1636327067_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": 1,
		"1637232450_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": 1,
		"1637657368_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": 1
	},
	"next_comment_id": 70,
	"comment": {
		"1609762064_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 1,
				"body": "@krzotr Kiedy wysłana zostanie kopia z fałszywym kluczem winna być odrzucona. Szczegóły pewnie zależą od przypadku. @adam2 twe uwagi nie padają na głuche uszy.",
				"added": 1613314808
			},
			{
				"comment_id": 8,
				"body": "Rozumiem. Sugerowałem tobie, żebyś prowadził kolejny blog na temat jaki ciebie interesuje. Masz doświadczenie. To treści sciągają nowych, na tym opiera się popularność każdego portalu. Czasy wąskich specjalizacji się skończyły.",
				"added": 1613746106
			}
		],
		"1613426915_1JZ8pyPNPtaH5pdLNzcifFLoBppBZj3SaC": [
			{
				"comment_id": 2,
				"body": "Praca u trola.... słabo.",
				"added": 1613469935
			},
			{
				"comment_id": 5,
				"body": "Z twoim całkowitym brakiem ogłady w komunikacji współpraca z hindusem byłaby doprawdy owocna.",
				"added": 1613630547
			},
			{
				"comment_id": 6,
				"body": "> [klempa](#comment_13_1JZ8pyPNPtaH5pdLNzcifFLoBppBZj3SaC): Moja strona to www.dyplom.edu.plChcę ją przenięść do ZeroNet i udostępniać w WWW .\n\nOk. Kolega miał rację. Strona www i strona zeronet to co innego. Możesz opublikować swoją strone html+ z serwera na którym jest na zeronet przez co stanie się zite zeronet. Wtedy jedyny sposób żeby była dostępna na WWW to serwer proxy a domena nawet ta co już masz. Klon zeronet wiki nie jest konieczny.  Klucze dostępu możesz poszerzyć dla wybranych i być administratorem. Czyli graniczy to z trolowaniem. Weź poucz się trochę informatyki i webdesign wtedy pytaj i opisuj z większym sensem.",
				"added": 1613671628
			},
			{
				"comment_id": 7,
				"body": "Jest jeszcze inaczej. Nie potrzebujeszz robić proxy, wystarczy, że sklonujesz samą stronę zeronet edu na serwer. Natomiast taka kopia będzie statyczna. Interaktywna tylko przez klienta zeronet.",
				"added": 1613692030
			}
		],
		"1613519322_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 3,
				"body": "Mądrość - praktyczne zastosowanie inteligencji.",
				"added": 1613553072
			},
			{
				"comment_id": 4,
				"body": "Spostrzegawczość może nie mieć praktycznego efektu. Ona swoją bystrość zostowała, aby osiągnąć cel. Ale w tym nie ma sprzeczności.",
				"added": 1613562947
			}
		],
		"1615281374_1AimmuFnBKDmQaYHzZerAJEHwsyBUddhMY": [
			{
				"comment_id": 9,
				"body": "@driud będę złośliwy i wykręcę to co powiedziałeś. Zachód to koncepcja. Ogólnie tam dominuje gen R1B, celtycki, moża rzec zachodnio słowiański. Nie istnieje taka nacja jak angole - to jest mieszanka celtów R1B i anglosaksonów I od których anglicy są trochę wyźsi częściej blondynami (trochę).  To jest twór być może Rzymski? Ktoś może twierdzić, że  R1B to gen niemiecki czy angielski, bo angielski i niemiecki to podobne języki łacińskie. Ślązacy mają sporo r1b, a ktoś zauważył, że kiedy irlandczycy i anglicy byli w konflikcje w swojej retoryce ignorowali fakt, że te dwie nacje mają 70-90% genów celtyckich.  Problem z anglikami jest taki, że u nich panuje kult królowej, która pochodzi skądśtam, mają pomieszane w swojej świadomości historycznej. Niemcy są narodem genetycznie celtycko-słowiańskim, a ich język z koloni rzymskiej? A gdy spojrzymy na hiszpanię to w uproszczeniu hiszpanie to mieszanka celtów, słowian z arabami, jedna wygląda jak dziewczyna z a. saudyjskiej a druga jak z irlandii, mówią jezykiem romańskim, łacińskim. Europa jest ofiarją kolonializmu i niszczenia kultury przez watykan. Starożytne świeta celtyckie i słowiańskie są uderzająco podobne. Spójrzmy na Turcję, mieszanka celtów słowian z plemionami turów. Mają tam trochę genu G, który często występuje u koniokradów. Na zachodzie problemem jest zakłamanie kulturowe i zaślepienie tą elitą z doliny krzemowej i london city. To jest temat rzeka jak to ustrojstwo funkcjonuje. Masy ludzkie są odcięte od wiedzy o swojej historii i ogłupione technologią, którą są kontrolowani przez klasy rządzące -kradów. Są mamieni propagandą o najwyższym standardzie życia i wzorcach cywilizacyjnych. Zakręca się to znowu to rzymu i watykanu. Świadomość starych europejskich filozofi i kultury jest żadna na zachodzie. Ten konflikt między zachodnią i wschodnią europą jest sztuczny. \n\nYandex przeglądarka jest do tej pory świetna, a to wersja beta dopiero. Putin i Rosja nie prowadziły żadnej poważnej wojny z nikim. Waszyngton i wnuk nazisty Busha zamordowali 1mln Irakijczyków i znisczyli ich kraj. Od trucizn z bomb w iraku chorują dzisiaj na raka. Także tyle jeśli chodzi o wartości demokratyczne i zbrodniczą Rosję.",
				"added": 1615315217
			}
		],
		"1615196015_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 10,
				"body": "Momentami gubiłem wątek ze względu na dobór słów tłumacza, ale to co zrozumiałem jest bardzo ciekawe. Duzo na koniec wzmianek o ciekawych kwestiach, ale nie wiem gdzie można przeczytać materiały źródłowe? ",
				"added": 1615727045
			},
			{
				"comment_id": 12,
				"body": "Rozumiem.",
				"added": 1615738337
			}
		],
		"1615135071_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 11,
				"body": "Jeżeli nie jesteś psychopatą, nie zrozumiesz zachowania psychopatów. Możesz jedynie zrozumieć jak coś robią, ale niekoniecznie dlaczego to robią. Jedna rzecz jest pewna, psychopaci u władzy nie chcą mieć pod sobą inteligentnych i buntowniczych jednostek - zagrażają ich władzy. Natomiast nie zniechęcam do dzielenia się podejrzeniami w tej kwesti.",
				"added": 1615728958
			},
			{
				"comment_id": 13,
				"body": "Zastanawia mnie, zakładając, że Watykan rzeczywiście blokuje czakry, dlaczego ludzie bez chrztu katolickiego,  też są zablokowani.  Jaki procent Amerykanów został ochrzczony w wierze katolickiej? To głównie byli protestanci. A zostali otępieni bardzo. Jeżeli nie trzeba przejść rytuału kościelnego, żeby być zablokowanym, co jest fundamentalną przyczyną blokady? Czy może chodzi o życie w syntetycznym otoczeniu i byciu oderwanym od natury? Chrześcijanie głoszą, że człowiek rodzi się zepsuty i brudny i ktoś musi go naprawić. Naukowcy uważają, że człowiek rodzi się zepsuty i brudny i ktoś musi go naprawić. Oni się tego podejmą - naprawią to 'śmieciowe DNA'. Identyczna filozofia. Chrześcijanie, uwarzają, że świat jest potępiony, a naukowcy, że natura jest wypadkiem. To dlatego, jest głód i wojna i przestępstwa. Razem dopuszczają tylko jedną możliwość, że czas jest liniowy - wszystko ma jeden początek i koniec. To może takie pranie mózgu zakłada największą blokadę na ludziach? Są inne wielkie filozofie, a ta skrajnie spłyca i blokuje umysł.",
				"added": 1615921509
			},
			{
				"comment_id": 14,
				"body": "> [driud](#comment_261_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Naszym ludzkim problemem jest to, że nie potrafimy patrzeć szeroko i perspektywicznie. Przewidywanie, paru ruchów do przodu. To właśnie za to są odpowiedzialne blokady umysłu. Dlatego to jest takie ważne.\n\nTe trzy zdania trafiają w samo sedno. Nic dodać nic ująć. Cierpimy na brak kultury, gdzie dziadkowie nie mają nic poważnego do przekazania swoim wnukom, oprócz traum i kilku upominków. A tam są wielopokoleniowe tradycje, gdzie tajne sekrety sztuki rządzenia są przekazywane przy rodzinnej herbatce, a wszyscy żyją w paranoi przed konkurencją. Populacja bez kultury nie stanowi żadnej konkurencji. \n\nDziadkowie dla pokolenia 80siąt, unikali jakichkolwiek rozmów o zdarzeniach z drugiej wojny światowej. Dlaczego? Bo to było 'straszne'. Dowiedziałem się ostatnio, przypadkiem, że 'wszyscy' wiedzą, że polskich żołnierzy wysyłano na wojnę bez amunicji. Najpierw dowiedziałem się tego z sieci, a potem okazało się, że wszyscy już to wiedzieli. To jest czysty absurd.",
				"added": 1615977892
			},
			{
				"comment_id": 15,
				"body": "Wow niesamowite! Co do szczepionek, słyszałem opinię, że ten chemiczny atak na układ nerwowy, doprowadza do różnych form i stopni autyzmu, przez co paradoksalnie jednostki mają wyostrzone wyższe funkcje umysłu. Jednakże ze skutkami ubocznymi i selektywnie. To, samo w sobie, może działać na niekorzyść konktrolerów. Podobno jednostki autystyczne są porządane w programach wojskowych bo są podatne i zdolne w nietypowy sposób.\n\nStalin podobno powiedział: \"Polakom komunizm pasuje tak, jak krowie siodło\". Nie znam szczegółów i kontekstu. Historia o przekierowaniu polskich wojsk na odosobniony front jest niesamowita. Została pominięta w szkole. Wiadomo.",
				"added": 1616160553
			},
			{
				"comment_id": 34,
				"body": "Ściągnąłem ten dokument fundacji Rockefellera. To jest sekta a materiał jest dla średniego szczebla wyznawców. My jesteśmy 'Hack Attack' czyli wynalazki tworzące zagrożenie dla nadzoru. haha!",
				"added": 1620593005
			}
		],
		"1616836050_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 16,
				"body": "> [klempa](#comment_23_1JZ8pyPNPtaH5pdLNzcifFLoBppBZj3SaC): W obozach koncentracyjnych również potrzebni byli ss-mani i kapo...Może warto zostać ss-manem w republice bananowej...\n\nO i to jest myśl. Jak ojciec Schwarzenegera.",
				"added": 1617051327
			}
		],
		"1617137397_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 17,
				"body": "Driud niesamowite badana jak zwykle!",
				"added": 1617294757
			}
		],
		"1616980579_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 18,
				"body": "Kwasy omega 3,6,9 utrzymane w odpowiednim balansie, oraz witmina e z awokado regulują mechanizm zapalny w organizmie.",
				"added": 1617295255
			},
			{
				"comment_id": 19,
				"body": "> [driud](#comment_268_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): są pewne ograniczenia\nJakie ograniczenia? Kapo zadzwonią na policję?",
				"added": 1617315672
			},
			{
				"comment_id": 20,
				"body": "> [driud](#comment_269_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): techniczne; ziemia, czas na uprawę, umiejętności uprawy\n\nWszystko jasne driud.",
				"added": 1617346800
			}
		],
		"1618103384_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 21,
				"body": "> [spiskowiec](#comment_3_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b): \"Bezpieczne systemy operacyjne? Jaki to ma sens? Z niemożliwości spełnienia dalszych warunków.\" [...]\n\nZnacie to 'ciepło, cieplej, gorąco'?",
				"added": 1618215006
			}
		],
		"1618579412_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": [
			{
				"comment_id": 22,
				"body": "Korporacyjne media używają takiej techniki przyciągania czytelnika cały czas. Czy modele telefonów nie mają blokad przeciw instalowaniu innych wersji androida czy Replicant ten problem rozwiązuje?",
				"added": 1619087162
			}
		],
		"1618429064_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": [
			{
				"comment_id": 23,
				"body": "Bardzo fajny wpis. Agenci, jak ci z ubuntu, absolutnie bezwstydnie trolują linuksa. Wojny z linuksem nie da się wygrać dlatego szpiedzy mogą już tylko trolować. Co jeszcze więcej można tu powiedzieć?",
				"added": 1619088270
			}
		],
		"1618368827_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 24,
				"body": "efi3 wrzuciłeś fajne nowe filmy na youtubepl. Pozdrawiam \n: 'Wiedza-Cyfrowy System Monetarny'.",
				"added": 1619088463
			},
			{
				"comment_id": 31,
				"body": "tomasz jak zwlykle ciekawe, bede sprawdzal zaraz youtubepl.\nzastanawia mnie jak daleko producent moze posunać się w ukrywaniu prawdziwego składu przetworzonego przez siebie jedzenia bez spotkania konsekwencji? pozdr",
				"added": 1619886614
			}
		],
		"1619237581_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 25,
				"body": "Niektóre kraje szczepionkę skasowały a sąsiadujące dalej jej używały. Jest to doprawdy żałosne zachowanie i nie obejdzie się bez konsekwencji. Podobno tym razem przed szczepieniem rozdawali książke z obszerną ulotką. Zasłanianie dupska!?",
				"added": 1619258508
			}
		],
		"1618579779_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": [
			{
				"comment_id": 26,
				"body": "Usunąłem ich aplikację. Aplikacja do wysyłania tekstu, kilka emotikon i zdjęcia zaczyna jako 20 megabajtowa aplikacja. Aktualizacje co 2 miesiące. W najnowszej wersji tło jest trochę zmienione i robi generalnie dalej to samo, a aplikacja ma już 120 megabajtów. Jest to gmiot, taki chory żart.",
				"added": 1619280644
			}
		],
		"1618791207_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 27,
				"body": "A kto to wszystko zatwierdza do spożycia? Chore!",
				"added": 1619337148
			}
		],
		"1618366115_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 28,
				"body": "To jest kompilacja jakiej trzeba było.",
				"added": 1619341476
			}
		],
		"1619526269_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 29,
				"body": "Kolejny świetny wpis. Może i jest tu mało ludzi, ale za to informacje świetne.",
				"added": 1619732214
			}
		],
		"1619880888_1CfWNmALwroEPSsRqZrrdFcatYizitZ6r3": [
			{
				"comment_id": 30,
				"body": "Ktoś słusznie zauważył, że nie wiemy kto jest prezydentem w tej chwili, bo nie ma zbyt wielu świadków obecności Bidena w białym domu. Pozatym jego zaprzysiężenie, jakie rzekomo się odbyło, miało miejsce o złym czasie. Biden ma poważną demecje starczą, problemy z koncentracją i wchodzeniem po schodach. Także wiem o co chodzi ze śpiącym prezydentem. Chodzą plotki, że plan jest wstawić panią vice, Harris na jego miejsce jak tylko coś mu się stanie. Czy to możliwe, że wystąpienia wideo prezydenta mogą być grafiką wideo? Mózg paruje.",
				"added": 1619886389
			},
			{
				"comment_id": 32,
				"body": "tomasz2, Rosjanie uruchominili oficjalne pobory do wojska. Mam nadzieje,  że decydenci w usa zejdą z tego świata lub zostaną zamknięci w więzieniu czy psychiatryku. Cokolwiek, żeby tylko ten żałosny gówno-występ się skończył.",
				"added": 1620461838
			},
			{
				"comment_id": 33,
				"body": "> [driud](#comment_279_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): CIEKAWE; warto zobaczyć, Wypowiada się fachowiec w tej branży wojskowej..Broń Biologiczna | COVID | Dr. Lee Merrit | Polski Lektor [...]\n\nCzy wideo na rumble ładuje się u ciebie sprawnie? U mnie na bardzo szybkim łączu, w niskiej rozdzielczości ledwie działa. Serwer słaby czy służby działają? \n\n//: Po kilku minutach załadowało się na tyle, że odtwarza bez rwania.",
				"added": 1620484042
			}
		],
		"1607453657_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 35,
				"body": "Z perspektywy widzimy, że póki co to Rosjan atakują. [10 maja 2021]",
				"added": 1620634468
			}
		],
		"1608757149_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 36,
				"body": "Czy Chiny bronią się przed zachodem? Ta koncepcja, że to autorytarna tyrania a zachód to liberalne kochańce jest słaba. Kto ich w to wciągnął? Apple, Microshit czyli CIA. Jeżeli oni tam mają fabryki to znaczy, że podoba im się łupienie ich. To kto jest zły wtedy?",
				"added": 1620635031
			}
		],
		"1620662392_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 37,
				"body": "Gady od 140 lat za sterem na szczycie piramidy.",
				"added": 1620809081
			}
		],
		"1620994683_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 38,
				"body": "Czy ten wpis miał wielu autorów? Ktoś tu chyba mocno wali głupa.",
				"added": 1621072026
			}
		],
		"1621638953_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 39,
				"body": "Znowu na czasie i konkretnie. Polecam",
				"added": 1621675077
			}
		],
		"1622292811_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 40,
				"body": "\"przesyłania danych biometrycznych (takich jak wskaźniki aktywności życiowej)\"\nhahahaha to są jaja rodem z filmu sci-fi! Driud świetnie znowu!",
				"added": 1622314793
			}
		],
		"1622035388_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 41,
				"body": "Właśnie nadawali na ten temat na lbry.tv \nA czarne-media jęczały, że to strasznie niedemokratyczne? Napewno, hh.",
				"added": 1622315008
			}
		],
		"1621854532_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": [
			{
				"comment_id": 42,
				"body": "Poważne teksty, w standardzie.",
				"added": 1622315120
			},
			{
				"comment_id": 57,
				"body": "@fornatker Mylisz się. Koniec judeo-chrześcijaństwa z całym jego blokowaniem umysłu.",
				"added": 1627907962
			}
		],
		"1621674323_1MUXpeXL4m6WZ6JDgCUfSvQerJopfLxCM6": [
			{
				"comment_id": 43,
				"body": "Czy to jest karma za śmiercionki? Ale dostali fenomenalnie po dupie za bezczelność i głupotę.",
				"added": 1622317239
			}
		],
		"1622418520_1MUXpeXL4m6WZ6JDgCUfSvQerJopfLxCM6": [
			{
				"comment_id": 44,
				"body": "Podczas plandemi umarło wielu czołowych działaczy. Pobicia, seryjni samobójcy i nawet nie próbowali testów na cowida robić.",
				"added": 1622622337
			}
		],
		"1621556211_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": [
			{
				"comment_id": 45,
				"body": "Ojciec, sześciu dzieci, każde z próbówki i z innym DNA. \nPsychopata.\nSuperzłoczyńca.",
				"added": 1622622570
			}
		],
		"1618538921_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": [
			{
				"comment_id": 46,
				"body": "To nie prawda co twierdzi tutaj fornakter. Informatyka jest podstawą aby zdobywać informacje. Po uzyskaniu szerokiej ogólnej wiedzy o zdrowiu, finansach i polityce szybko wykrywa się oszustwa i znajduje specjalistów. Co to ma wspólnego z podziałem pracy w firmach?",
				"added": 1622623242
			}
		],
		"1622818687_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": [
			{
				"comment_id": 47,
				"body": "hh widzę, że agresja werbalna. To przekleństwo dla świata zdechnie.",
				"added": 1622837906
			}
		],
		"1623926456_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": [
			{
				"comment_id": 48,
				"body": "Wróciłem. Moric, dzięki.",
				"added": 1625474135
			}
		],
		"1626053945_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 49,
				"body": "Zamaskowani ludzie jak chorzy umysłowo wariują nad 'wirusem', a rozkręcają nad nimi prawdziwą wojnę i nic nie robią.",
				"added": 1626332178
			}
		],
		"1624997273_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": [
			{
				"comment_id": 50,
				"body": "> [fornakter](#comment_116_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY): bez wątpienia postrzega swoje inwestycje w kilka firm farmaceutycznych, w tym Merck, Pfizer, Johnson & Johnson, jako inwestycje etyczne, czyniące świat lepszym, a przy okazji jego bogatszym.\n\"Szacuje się, że Pfizer może zarobić 100 miliardów dolarów na szczepionkach w ciągu najbliższych pięciu lat.\nFundacja Gatesa jest drugim co do wielkości sponsorem WHO po Stanach Zjednoczonych. Gates założył również i sfinansował The Vaccine Alliance (GAVI) i Global Fund. W latach 2018-19 ich łączny wkład był o 27% większy niż w przypadku Stanów Zjednoczonych, co czyniło wpływy Gatesa silniejszymi niż \"\n←\nO co chodzi z tym ukrytym komentarzem!? !?\n↓\n\"bez wątpienia postrzega swoje inwestycje w kilka firm farmaceutycznych, w tym Merck, Pfizer, Johnson & Johnson, jako inwestycje etyczne, czyniące świat lepszym, a przy okazji jego bogatszym.\nSzacuje się, że Pfizer może zarobić 100 miliardów dolarów na szczepionkach w ciągu najbliższych pięciu lat.\nFundacja Gatesa jest drugim co do wielkości sponsorem WHO po Stanach Zjednoczonych. Gates założył również i sfinansował The Vaccine Alliance (GAVI) i Global Fund. W latach 2018-19 ich łączny wkład był o 27% większy niż w przypadku Stanów Zjednoczonych, co czyniło wpływy Gatesa silniejszymi niż \"",
				"added": 1626332291
			}
		],
		"1626571418_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 51,
				"body": "Szczepionka to syf. Można iść na wojnę bo wszyscy idą. To poniżej rozumu co ci idioci robią.",
				"added": 1626597842
			},
			{
				"comment_id": 52,
				"body": "> [fornakter](#comment_117_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY): Jest jeszcze trzecia strona medalu(?)Dlaczego się zaszczepiłeś? [...]\n\nZwierzątka. Mój 10 miesięczny kot ma więcej mądrości.",
				"added": 1626897013
			},
			{
				"comment_id": 62,
				"body": "\"Ale jak się nie zaszczepisz, to zwolnią z pracy\" To jest panowie aparthajd!",
				"added": 1633334056
			}
		],
		"1627502800_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 53,
				"body": "Nasi przyjaciele bardzo ciężko pracowali kiedy wszyscy spali!",
				"added": 1627584615
			}
		],
		"1627522666_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 54,
				"body": "\"w walce z zagrożeniami w cyberprzestrzeni\". Z mossadem.",
				"added": 1627584886
			},
			{
				"comment_id": 56,
				"body": "Czarni za sterami. Będą robili to co zawsze.",
				"added": 1627732970
			}
		],
		"1626943982_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 55,
				"body": "Seeduję!",
				"added": 1627732754
			}
		],
		"1624223308_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": [
			{
				"comment_id": 58,
				"body": "Porażka",
				"added": 1628284646
			}
		],
		"1628313902_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 59,
				"body": "To jest więcej niż Orwell. Dużo.",
				"added": 1628347324
			}
		],
		"1628512255_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 60,
				"body": "\"Gdy widzę bierność, głupotę i bezmyślność otaczających mnie tłumów odczuwam bezsilną wściekłość.\"",
				"added": 1629535015
			}
		],
		"1610339813_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 61,
				"body": "Bardzo dobry wpis.",
				"added": 1632249829
			}
		],
		"1633477933_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 63,
				"body": "Ale jak latami to powtarzaliśmy, że tam czas jest policzony to nic nie zrobili.",
				"added": 1633889487
			},
			{
				"comment_id": 66,
				"body": "> [efi3](#comment_73_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ): Myślę że nadszedł czas nawiązywania znajomości niezależnych. \n\nbrawo",
				"added": 1635972003
			}
		],
		"1620938699_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 64,
				"body": "> [jsc](#comment_13_1NCBwJXYPawrYJNFZjU6eXd86fYVWqyYyh): (...)Teraz przejdźmy do sedna, jakie dane chcą od Polaków Żydzi z PIS podczas spisu w roku 2021 ? Lista może zszokować, dokładność i zakres danych budzą najwyższy niepokój.(...)Przecież te dane są w już istniejących bazach danych...\n\nNo czyli kosztowny spis można odwołać.",
				"added": 1634900525
			}
		],
		"1635491830_1CkXEBfYnBdZQEu7ZCQmvd723DjJwFjLx7": [
			{
				"comment_id": 65,
				"body": "Ale wiagry mu napewno nie przepisze.",
				"added": 1635794412
			}
		],
		"1636101927_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 67,
				"body": "Co myślicie o rowolucji francuskiej?\nSłyszałem ze przejęta ale podoba mi się styl przyznaję.",
				"added": 1636177324
			}
		],
		"1636327067_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 68,
				"body": "> [kapec](#comment_56_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): Bardziej chodziło mi o to że obserwacja poprawna ale wnioski z kosmosu.\n\nWiedza wyższa = kosmos.",
				"added": 1637583346
			}
		],
		"1637657368_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 69,
				"body": "\"nic nie posiadam, nie jestem za nic odpowiedzialny, nie myślę, jestem szczęśliwy\"\nTu już delikwentowi nawet bóg nie pomoże.",
				"added": 1637777989
			}
		]
	},
	"comment_vote": {
		"50_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": 1,
		"13_1MUXpeXL4m6WZ6JDgCUfSvQerJopfLxCM6": 1,
		"32_1AimmuFnBKDmQaYHzZerAJEHwsyBUddhMY": 1,
		"279_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"18_1MUXpeXL4m6WZ6JDgCUfSvQerJopfLxCM6": 1,
		"292_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"9_17L8tN9xz17h6MX5JY5fqfGFocsMF34xBf": 1,
		"4_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": 1,
		"9_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": 1,
		"12_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": 1,
		"18_1CfWNmALwroEPSsRqZrrdFcatYizitZ6r3": 1,
		"7_1Me1VCYRwZ9whErbbhew63eKJFS8L8Jyka": 1,
		"89_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": 1,
		"27_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": 1,
		"42_1CfWNmALwroEPSsRqZrrdFcatYizitZ6r3": 1,
		"71_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": 1,
		"24_1Me1VCYRwZ9whErbbhew63eKJFS8L8Jyka": 1,
		"73_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": 1,
		"36_1MUXpeXL4m6WZ6JDgCUfSvQerJopfLxCM6": 1,
		"29_1Me1VCYRwZ9whErbbhew63eKJFS8L8Jyka": 1,
		"35_1MUXpeXL4m6WZ6JDgCUfSvQerJopfLxCM6": 1,
		"32_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": 1,
		"35_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": 1
	}
}