{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1572478148_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 1,
				"body": "I think that's pretty funny if you ask me",
				"added": 1574636601
			},
			{
				"comment_id": 2,
				"body": "> [styromaniac](#comment_1328_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): One thing I see as horribly ignorant was ssd promoting ZeroNet on chan sites. That helped to bring in a bunch of low-quality, spammy types. [...]\n\nWell, just to let you know, the larger influx has stopped and has slowed down considerably as far as I can tell. It started in Aug.",
				"added": 1574741916
			}
		],
		"1575466445_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 3,
				"body": "> [xcape2net](#comment_586_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): There is research that shows that when one person has an IQ 30 or more points above another person, the two are incapable of forming a meaningful relationship\n\napplies to having meaningful conversations with people too. not just relationships",
				"added": 1575870025
			}
		],
		"1579767328_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 4,
				"body": "I was hoping that there was more discussion in here regarding this outbreak of the Wuhan Corona Virus.\nMost people are ignorant to it, it seems, as far as right now goes, but there are some of us who are aware of what is going on, even if it doesn't spread any further. Good luck china.",
				"added": 1579831520
			}
		],
		"1584973143_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 5,
				"body": "just have two separate directories with the zeronet \"installation\" inside each of them, run them separately. I've done it in linux, (I deleted it anyway) never tried in winblows though, since I really don't use it anymore.",
				"added": 1585114187
			}
		],
		"1585090638_1nADL2gz5MoAsEjnoARpP4hPTVfBk5ri3": [
			{
				"comment_id": 6,
				"body": "> is it like deepweb? Government secrets, ufo,\nhahaha no\nthink of it as uncensored internet\nif you don't want to have anything to do with something, don't actively look for it\nPersonally, I think the only thing it is missing is some kind of search engine",
				"added": 1585114357
			}
		],
		"1572121659_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 7,
				"body": "Having Africans live with and around Europeans, for example, was a mistake. They lived on separate continents for a reason. They should just keep their continents for themselves. Same with Asia. \nIf one continent cannot thrive, then too bad. They have their own continent and can waste it or make it thrive. Its up to each continent.\nEach continent had its own unique culture, arts, and sciences (well, except Africa) before they started to get all mixed together.\nEveryone needs to be separate.\nDay to day living will be more peaceful.\nOne race doesn't have to put up with the quirks of another race.\nEveryone would understand each other because they are all of the same race.\nThis mixing was supported by well-meaning and altruistic people, but it has backfired on everyone.\nYes, everyone.\nNo exceptions.",
				"added": 1585117097
			}
		],
		"1584777793_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 8,
				"body": "> more people staying at home\n> more people on the internet\n> more people on ZeroNet\n> more seeders\nWhere's the problem?",
				"added": 1585117443
			}
		],
		"1584983883_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 9,
				"body": "> [bigbadbob](#comment_1045_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): They have amazing immune systems from eating garbage and shitting everywhere?\n\nUNIRONICALLY      T H I S",
				"added": 1585117594
			}
		]
	},
	"comment_vote": {
		"1_1EyUrUV7UnDzr36fJefTvkARKSNdcJdi14": 1,
		"7_1EyUrUV7UnDzr36fJefTvkARKSNdcJdi14": 1
	}
}