{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1591036220,
			"title": "разыскивается мессенджер.",
			"body": "подскажите Уважаемые, мессенджер, опенсоурс, отправка прием голосовых сообщений, как в зелло. желательно без SIP и и RTP",
			"added": 1591036219
		},
		{
			"topic_id": 1592930911,
			"title": "сайты хакерюг",
			"body": "интересуют сайты с эксплойтами или сообщениями об уязвимостях;). кто что знает;)?",
			"added": 1592930909
		},
		{
			"topic_id": 1607193064,
			"title": "жопа, просто жопа;)",
			"body": "чето мне кажется что галактико в апастности;)\n\n# gdb i2pd\nGNU gdb (Debian 8.2.1-2+b3) 8.2.1\nCopyright (C) 2018 Free Software Foundation, Inc.\nLicense GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>\nThis is free software: you are free to change and redistribute it.\nThere is NO WARRANTY, to the extent permitted by law.\nType \"show copying\" and \"show warranty\" for details.\nThis GDB was configured as \"i686-linux-gnu\".\nType \"show configuration\" for configuration details.\nFor bug reporting instructions, please see:\n<http://www.gnu.org/software/gdb/bugs/>.\nFind the GDB manual and other documentation resources online at:\n    <http://www.gnu.org/software/gdb/documentation/>.\n\nFor help, type \"help\".\nType \"apropos word\" to search for commands related to \"word\"...\nReading symbols from i2pd...done.\n(gdb) \n\n19:46:01@610/warn - Tunnels: test of tunnel 3224084037 failed\n\nThread 10 \"Tunnels\" received signal SIGSEGV, Segmentation fault.\n[Switching to Thread 0xb32ffb40 (LWP 1096)]\n__memcpy_ia32 () at ../sysdeps/i386/i686/memcpy.S:71\n71      ../sysdeps/i386/i686/memcpy.S: Нет такого файла или каталога.\n(gdb) up\n#1  0x011d9f08 in ?? ()\n(gdb) up\n#2  0x005c497c in i2p::crypto::TunnelEncryption::Encrypt (this=0x11e882c, in=0xb33329f4 \"\\002.\\260\\363\\326\\333/\\316H\\330So{\\246\\220\", \n    out=0x11d9f08 \"\\235\\201w\\213\\t\\216\\274bM\\032\\206\\275\\003\\204\\250\\364\\371:\\275٭\\324͢/\\252y\\332\\351S\\312K\\364\\375\\337ל(H\\373\\326c\\355I\\327\\064\\322\\345Qb\\251\\267\\201M\\254\\035PS\\016C\\202\\034\\325\\333\\345\\310mp\\214\\177\\354\\021\\221\\302}n\\030\\005\\003\\302\\214\\327P$\\371\\206d\\204\\240\\337\\036\\275\\212\\376k\\352\\005#\\305\\063\\327r\\351V\\320\\002FZ9%X\\322\\371뭷\\372\\320Q\\215\\066\\247︅b\\210-w\\025F\\223c\\222\\370\\235\\351\\264\\374\\370\\255\\217HȂ2\\r;\\252j\\332\\354l\\261\\004\\b\\005b\\237\\az\\313\\321\\a=\\300\\274\\231\\344n\\205\\202\\253\\022\\341\\353\\362\\373\\b\\265\\275h\\036\\264\\225\\211\\207`c\\bBbϹ\\365W\\037\\030\", <incomplete sequence \\356>...) at libi2pd/Crypto.cpp:1069\n1069                            m_LayerEncryption.SetIV (out);\n(gdb) up\n#3  0x00614969 in i2p::tunnel::TransitTunnel::EncryptTunnelMsg (this=0x11e87fc, in=std::shared_ptr<const i2p::I2NPMessage> (use count 3, weak count 0) = {...}, \n    out=std::shared_ptr<i2p::I2NPMessage> (use count 2, weak count 0) = {...}) at libi2pd/TransitTunnel.cpp:32\n32                      m_Encryption.Encrypt (in->GetPayload () + 4, out->GetPayload () + 4);\n(gdb) up\n#4  0x00614a7c in i2p::tunnel::TransitTunnelParticipant::HandleTunnelDataMsg (this=0x11e87fc, tunnelMsg=std::shared_ptr<const i2p::I2NPMessage> (use count 3, weak count 0) = {...})\n    at libi2pd/TransitTunnel.cpp:43\n43                      EncryptTunnelMsg (tunnelMsg, newMsg);\n(gdb) \n\n(gdb) info reg\neax            0x0                 0\necx            0x4                 4\nedx            0x11e882c           18778156\nebx            0x9a5000            10113024\nesp            0xb32ff0a0          0xb32ff0a0\nebp            0xb32ff0f8          0xb32ff0f8\nesi            0x9a5000            10113024\nedi            0x61490a            6375690\neip            0x614a7c            0x614a7c <i2p::tunnel::TransitTunnelParticipant::HandleTunnelDataMsg(std::shared_ptr<i2p::I2NPMessage const>)+110>\neflags         0x210246            [ PF ZF IF RF ID ]\ncs             0x73                115\nss             0x7b                123\nds             0x7b                123\nes             0x7b                123\nfs             0x0                 0\ngs             0x33                51\n\nтестов много - говорит double free;).",
			"added": 1607193061
		},
		{
			"topic_id": 1609498589,
			"title": "Microsoft заявил о проникновении хакеров...",
			"body": "судя по новостям кто то имел доступ к гиту  текстами. Уважаемые, а никто не слышал, тексты скопировали или нет? может выложили где то?;)",
			"added": 1609498585
		}
	],
	"topic_vote": {},
	"next_comment_id": 119,
	"comment": {
		"1585772185_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 1,
				"body": "во всей этой хрени отсуствует простая ф-ция - записать и отправить голосовое/видео сообщение. во всех этих мессенджерах (тор и т.д.) проблема какая - латентность канала связи. т.е. просто включить srtp/zrtp и увеличить буфферизацию - не получится. разборчивость будет кка в рельсу. выход простой - зашифровать и передеть медиа-сообщение (как в зелло, только шифровать непадецки). почему не делают - загадка...",
				"added": 1586844664
			},
			{
				"comment_id": 2,
				"body": "> [anotherneko](#comment_187_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Помоему это прекрасно.\n\nну как бы стучать по клавиатуре не всегда уместно, особенно с мобильного клиента. раз оно все шифрованное, там почему просто не воспользоватся голосовым сообщением?;)\nps. в данной ситуации клиент Technitium Mesh только под десктоп - это мертвый клиент, можно посмотреть статистику с любого сайта, больше 50% мобилы, андроид. все идет к тому что десктопы как мамонты - вымрут.",
				"added": 1586955707
			}
		],
		"1590655214_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 3,
				"body": "нет повести печальнее на свете, чем повесть о миньете в туалете",
				"added": 1590820145
			},
			{
				"comment_id": 29,
				"body": "жертва медреформы? https://korrespondent.net/ukraine/4238158-ubyitsu-troykh-luidei-v-fastove-ne-braly-v-psykhbolnytsu-yz-za-otsutstvyia-deneh .",
				"added": 1591854187
			},
			{
				"comment_id": 40,
				"body": "украинский историк доказал украинское происхождение ноя, потопа и греков.",
				"added": 1595228872
			}
		],
		"1590598686_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 4,
				"body": "та да. найди 0-day, баблом поделимся;).",
				"added": 1590820400
			},
			{
				"comment_id": 5,
				"body": "https://www.exploit-db.com/ , там еще files_exploits.csv есть.",
				"added": 1590823593
			},
			{
				"comment_id": 11,
				"body": "ссылку, если не сложно на софт. кроме поиска по exploit-db не вижу там ничего.",
				"added": 1590868933
			}
		],
		"1590837476_1JQ4t8CN9SneVvs69mGzgjwotoqPm6rL8N": [
			{
				"comment_id": 6,
				"body": "https://collapseos.org/ отакое надо!",
				"added": 1590848739
			},
			{
				"comment_id": 7,
				"body": "десктопов все меньше. https://v8.1c.ru/platforma/mobilnaya-platforma-1s-predpriyatiya/ это допилят + хрень которая голос распознает (чтоб редактором не пользоватся для набора текста). и капец будет тому виндавсу. не нужен он будет. даже для игр",
				"added": 1590851375
			},
			{
				"comment_id": 8,
				"body": "медленно(не очень то и медленно) и уверенно микрософт переходит от продажи товаров (програмного обеспечения) к продаже услуг - облако, да хотя бы тот же оффис365. от ие уже отказались в пользу прямого конкурента, хрома. ну и кому спрашивается нужен клон, когда оригинал не очень то востребован.",
				"added": 1590851762
			},
			{
				"comment_id": 9,
				"body": "> [cra](#comment_113_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): Ну, поверьте, ещё рано хоронить десктопные ОС. Правда ReactOS ну... такое себе...\nв смысле пользователя. что дает виндовс?(массово) оффис, приложения с ним связанные, таже самая бухгалтерия, игры.  в текущий момент - хорошо или плохо реализовано на андроид (оффисные приложения), игры - не хуже.\nзадачи не массового использования системы - кад, сапр. программирование - понятное дело, связанные именно платформой виндовс. можно придумать кучу задач весьма специфических. т.е. что то типа aix - до сих пор живет в узком кругу. какую то узкую нишу виндовс возможно и будет занимать, но то что было раньше - уже не будет. а реактос - клон виндовс, с вытекающими из этого.",
				"added": 1590868737
			},
			{
				"comment_id": 10,
				"body": "ps. дектопы не исчезнут, просто их станет существенно меньше;).",
				"added": 1590868789
			},
			{
				"comment_id": 12,
				"body": "прямо скажем - попытки сесть в уехавший паравоз очень сильно напоминают перенос виндовс на мобильные платформы. что касается виндовс. если взять мануал программирования по vms/openvms,\nто к удивлению набор ioctl по названиям совпадает с виндовс. и разрабатывался виндовс NT под процессоры alpha2 конторой под названием диджитал (давно уже там). после развала вышеуказанной, билли очень удачно перекупил подразделение которое занималось разработкой ос. родное микрософт - винд 3.11, от NT - как небо от земли. в дальнейшем, уже в микрософт перенесли NT на x86. т.е. к чему это я - виндовс новизной не блещет, идеями тоже. максимум нишевое существование. реактос... смысл в нем? совместимость? тогда с чем?",
				"added": 1590870811
			},
			{
				"comment_id": 13,
				"body": "м$ dos, cp/m, os/2 - это полноценные ос:). многозадачности в них в полном смысле слова не было. но на 64кб оно и не сильно было нужно. в 3.11 в виде эмуляции присутсвовала многозадачность. а про реактос - я полностью согласен. как способ убить личное лишее время - может быть. но практического смысла система не имеет.",
				"added": 1590872137
			},
			{
				"comment_id": 14,
				"body": "в зеронет выложили сайт с эмулятором - zero-8. выложат когда то и вин-сапера с какой то древней версией вайна;). если сам зеронет доживет:). основная масса - телефоны, реже планшеты. в качестве отображения -\nхуавей к 2022 году собирается выпустить очки, стоимость бюджетная. где там виндовс? чет не видно;).\nкстати, проблема всех этих p2p-систем, в т.ч. зеронета - мобильный клиент, прям скажем не дотягивает\nдо уровня. собственно из за этого пользуются ими единицы.",
				"added": 1590904598
			},
			{
				"comment_id": 15,
				"body": "reactos - исчадье десктопного ада;), вымирает вместе с сегментом;).",
				"added": 1590917394
			},
			{
				"comment_id": 16,
				"body": "> [twsparkle](#comment_2_1JQ4t8CN9SneVvs69mGzgjwotoqPm6rL8N): Если я правильно понимаю, рос нужен был для тех, кто любит виндовские приложения, но не хотят, чтобы билли джин их чипировал.\nвроде того. но успевать за микрософт не получилось, сделать что то большее чем виндовс тоже.\nсо временем смысл вообще потерялся.",
				"added": 1590951986
			},
			{
				"comment_id": 17,
				"body": "http://emergedesktop.org/ выдает 404, заходил через tor. https://en.wikipedia.org/wiki/Emerge_Desktop и выгрузка с sourceforge работает. последние обновления - 5 лет назад. издохло по той же причине что и реактос. не успели за обновлениями виндовс.",
				"added": 1591035382
			},
			{
				"comment_id": 19,
				"body": "ну как раз связно, слегка так. попробуй убери дефендер из виндовс. тоже самое и с плиточным гуи.",
				"added": 1591110146
			},
			{
				"comment_id": 23,
				"body": "менеджер завязан на системе, интересно запустить explorer.exe с xp в windows 10",
				"added": 1591250502
			},
			{
				"comment_id": 24,
				"body": "та я понимаю, что менеджер выполняется в контексте пользователя а не ядра;). но как бы есть ньюансы. и чтоб оно запустилось эти ньюансы надо всунуть в \\windows\\system32\\*.dll . что так бы нарушит работу остальной части системы (скорее всего так произойдет). ставить в эмуляторе xp а потом переносить explorer.exe в 10-ку;))... я еще не перешел на этот уровень;))).",
				"added": 1591342257
			},
			{
				"comment_id": 25,
				"body": "да те \"альтернативные\" вещи как раз связаны, с версией виндовс, api и т.д. \"hello world\" может и работает на всех версиях виндовс (в некоторых defender его блокирует;))) ), а менеджер врядли. в 10 даже где то была галочка насчет обратной совместимости с xp. простой способ проверить - смахнуть тот менеджер с sourceforge и запустить его под win10. у меня в наличии андроид и raspberry pi, негде эмулятор запустить, давно проверил бы;).",
				"added": 1591433281
			},
			{
				"comment_id": 26,
				"body": "т.е. приложения на реактос будут работать древние, с win10 - не все и не всегда.",
				"added": 1591433346
			},
			{
				"comment_id": 27,
				"body": "реактос с нуля не разрабатывался. в качестве примера user-mode использовались наработки wine. с ядром - тоже маловероятно, что все сами с нуля. src kernel win2k по всему инету валяется. скопировать может и не копировали, но тексты смотрели.\nps. я понимаю что роскомнадзор - кровавый монстр способный на все;)). но обойти блокировку reactos.org и 7-zip.org... Вы прикинте ,что будет если заблокируют инстаграм. В течении 15 минут все гламурные кисо и любители просмотра кисовых видео, установят себе на смартфонах тор;)))). даже те у которых в голове две кнопки или одна на два положения;))).",
				"added": 1591506462
			},
			{
				"comment_id": 28,
				"body": "не по теме:).\nкисо за рекламу в инсте получает столько бабла, что 15 минут, это я загнул, слишком много. если инстаграмм отпадет, то процесс установки тор произойдет где то за 45 секунд.\nps. лайки, фолловеры и пр., как то общался с представителями этого бизнесса.",
				"added": 1591724356
			},
			{
				"comment_id": 50,
				"body": "1C есть на мобиле. вендекапец.",
				"added": 1597683164
			},
			{
				"comment_id": 51,
				"body": "есть еще такое http://menuetos.net/ - бесконечный руль...",
				"added": 1597728617
			},
			{
				"comment_id": 52,
				"body": "https://collapseos.org/ - живее всех живых;).  в эмуляторе https://schierlm.github.io/CollapseOS-Web-Emulator/2020-06/emul1.html даже 2 3 + . складывает на раз;).",
				"added": 1597731938
			},
			{
				"comment_id": 53,
				"body": "по поводу колибри, гит живой: https://repo.or.cz/kolibrios.git",
				"added": 1597771139
			}
		],
		"1591036220_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC": [
			{
				"comment_id": 18,
				"body": "ну да;)с voip клиентом проблема - канал не стабилен, а типа рации, самое оно. задержка секунд 5 некритична.",
				"added": 1591110068
			},
			{
				"comment_id": 20,
				"body": "p2p интересует а не ватсап с телеграмом:). токс - пользовался им с полгода. во первых нет отправки голосовых сообщений (через тор латентность канала такая что разобрать голос иногда весьма сложно).\nну и периодически токс-core начинает грузить проц на 100%. с чем это связано - я не знаю.\nпо поводу jami - это сип клиент к которому прикрутили dht. в локальной сети оно работает. через тор понятное дело rtp over tcp еще хуже, по качеству чем токс.\nпо поводу xmpp - ткните плз в клиента который это умеет;).",
				"added": 1591165413
			},
			{
				"comment_id": 21,
				"body": "jami - https://ru.wikipedia.org/wiki/Jami_(%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B0) . сигнализацию клинетов, ip и порт, абонента B прикрутили через dht, и + понятное дело священная война с NAT.",
				"added": 1591166043
			},
			{
				"comment_id": 22,
				"body": "да я хочу сделать кхм... корпоративный мессенджер. с почтой передачу голосовых сообщений (автоматом аттач цепляется и отправляется) уже сделали, более что в почтовом клиенте никто не мешает включить шифрование pgp. какой ньюанс - много надо нажать кнопок. даже не ptt нужно, а просто отправка голосовых сообщений как в этих всех ватсапах, вайберах и прочих. в силу организационно-технических условий;) передача через сервер нежелательна, соединение с интернетом - тоже.",
				"added": 1591175374
			},
			{
				"comment_id": 30,
				"body": "conversations - жаббе(')р. спасибо!!!;) попробую из его жаббе(')р выкинуть;).",
				"added": 1591898580
			},
			{
				"comment_id": 31,
				"body": "> [undyingfirewall](#comment_20_19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S): Помню, пробовал ещё в 2016. Тот же лучший файлообменник (в хорошем смысле), только без офлайн-доставки, и аккаунты локально хранит. Если я когда-нибудь и замучу свой Linux-КПК (а планы такие определённо есть), то qTox/uTox (зависит от того, что под armhf соберётся), скорее всего, будет штатным приложением для звонков. А Pechkin (и даже не XMPP!) - штатным мессенджером^W аналогом почтовика.\nв токс указать в качестве прокси тор. оно конечно эпизодически слышно, но до голосывых сообщений, по качеству - весьма далеко.токс к сожалению не умеет;(.",
				"added": 1592414955
			},
			{
				"comment_id": 32,
				"body": "ps. и код в том токсе кривой что наша жизнь. в кору валится случайным образом. qTox не пробовал, из за qt, uTox и toxic - было дело использовал регулярно.",
				"added": 1592415047
			},
			{
				"comment_id": 33,
				"body": "совсем забыл. toxic на раз собирается на raspberry pi.",
				"added": 1592415194
			},
			{
				"comment_id": 34,
				"body": "> [allarsan](#comment_1_1JgAgF2CmW4iSHFGTEBj2aaunAEhp7G8bR): чем RIOT не устраивает ?\nв riot есть голосовые сообщения?",
				"added": 1592548176
			}
		],
		"1592930911_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC": [
			{
				"comment_id": 35,
				"body": "> [boolean](#comment_1_1FPKYTmF41xFttxus5AVQFr9L1YYEH29a7): база https://www.exploit-db.com/сами эксплоиты можно найти на Github.com\n\nкак раз вопрос о том что  exploit-db.com,  packetstormsecurity начали новости реже опубликовывать.\nсудя по всему они берут их с одного источника, который иссякает;).",
				"added": 1593274048
			},
			{
				"comment_id": 36,
				"body": "ну хрен уже с 0-day. хотя бы удобочитаемая база старых, но рабочих...",
				"added": 1593411691
			}
		],
		"1593644510_1DsDKkrbdNHdbm1wfWi4AwZvhgJn8jUKNz": [
			{
				"comment_id": 37,
				"body": "http://v1.lordfilm7.tv/527-chuzhie-sredi-nas-1988.html",
				"added": 1593687524
			},
			{
				"comment_id": 87,
				"body": "ну тогда уже 'армагедец. или всем хана'",
				"added": 1604991857
			},
			{
				"comment_id": 104,
				"body": "\"сумеречная зона\" забыли;).  1959—1964, 1983, 1985—1989, 2002—2003, 2019 годов.",
				"added": 1613725122
			}
		],
		"1594971941_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 38,
				"body": "если есть возможность запустить прокси, то очевидно а-ля тор будет работать и в той сети.",
				"added": 1595184532
			},
			{
				"comment_id": 39,
				"body": "> [ragfat](#comment_3_1J4G2evnydnAMBRGeAxpTmyfva2xv6FM7s): Тут скорее пахнет гильятиной чем вероятностью запустить прокси. Если я правильно помню, как раз китайцы смогли сломать когда-то Tor. Скорее всего, с этим новым протоколом будут или выпускать новые маршрутизаторы, или подписывать договора с производителями маршрутизаторов.Так что рискуя головой пытаться их \"ломать\" и писать под них прошивку. Конечно, если за это кто-то вообще возьмётся, что очень вряд ли, но всё-таки.\n\nзнакомые возят с китая всякий хлам (правда ковид облажал), общаются, живут там по месяцу. есть категории китайцев которые на все вопросы про прокси орут про великого мао. есть те которые уходят от разговора. знакомые на vps запускают openvpn, нестандартный порт и т.д. и звонят пишут через его.\nкроме того великий китайский файервол пропускает такие шайбы типа cjdns, yggdrasil. привязать адрес к пользователю (кстати cjdns, yggdrasil это позволяют сделать) это можно конечно, но если не лезть в политику, то нафиг кто кому нужен.",
				"added": 1595228442
			}
		],
		"1596397447_1EbPbm1iWibJ41UUk5ENKNHrW7pVH9ui81": [
			{
				"comment_id": 41,
				"body": "....Учитывая, что примерно две трети выпускаемых долларов уходит за пределы страны[13], глобальный сеньораж США в 2010 г. составил около 36 млрд долларов. \n\nфрс это типа глист планетарного масштаба. а бумажки с дохлыми президентами - 1001 способ облапошить.\nhttps://ru.wikipedia.org/wiki/%D0%AD%D0%BC%D0%B8%D1%81%D1%81%D0%B8%D1%8F_%D0%B4%D0%B5%D0%BD%D0%B5%D0%B3\nа тут в цифрах - зачем им это нужно.\nhttps://ru.wikipedia.org/wiki/%D0%A1%D0%B5%D0%BD%D1%8C%D0%BE%D1%80%D0%B0%D0%B6",
				"added": 1596441955
			}
		],
		"1596965084_14qehPmJvdCxmQ3Dfs5gEHovBXxPhTgzcQ": [
			{
				"comment_id": 42,
				"body": "битмессаге резко сократилось после того как в последней версии PyBitmessage выявили RCE. ну типа удаленное выполнение произвольного кода...",
				"added": 1597051869
			},
			{
				"comment_id": 43,
				"body": "набираем в гугле: \"bitmessage exploit\"\nвыпадает:\n_ttps://thehackernews.com/2018/02/bitmessage-bitcoin-hackers.html\nну и т.д. после такого аудитория bitmessage резко сократилась.",
				"added": 1597146761
			},
			{
				"comment_id": 44,
				"body": "ps. разработка pybitmessage как бы тоже тормознулась. есть еще такое: _ttp://busydoingnothing.co.uk/notbit/ , но как бы смысла в нем немного без живой сети.",
				"added": 1597146880
			},
			{
				"comment_id": 45,
				"body": "нат наименьшая из всех проблем. вот когда анонимоус думает что все хорошо, а со стороны сети на его компе можно выполнить любую команду - ото все плохо.",
				"added": 1597208222
			},
			{
				"comment_id": 68,
				"body": "было сообщение о RCE в bitmessage. предложили, как решение откатится на предыдущую версию",
				"added": 1600518545
			},
			{
				"comment_id": 70,
				"body": "notbit можно в тор запустить, можно в yggdrasil . оживить проблемы нету.",
				"added": 1600630748
			},
			{
				"comment_id": 73,
				"body": "да нат в ситуации - это вообще дело 150. notbit (клиент bitmessage) можно через тор запустить и на нат и пр. просто будет все равно.",
				"added": 1600784834
			}
		],
		"1597169972_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 46,
				"body": "кирины в хонорах стоят. выпуск киринов прекратили, хуавей подался в медиатек. новость недельной давности.",
				"added": 1597208438
			},
			{
				"comment_id": 75,
				"body": "> [3573453456942357](#comment_1_1H7o7LDAzpdbTrbdT6NFzoJJeUKKh3XbUx): Никогда не покупай Mediatek, это голимое китайское говно. Твой GPS будет искать спутники 10 минут после любого отключения даже на 1сек, BT и WiFi тоже будут работать еле как, сам проц жрёт батарею больше нормы. Единственный плюс - смена IMEI в 1 клик.\n\nчего так долго? того шо стучит куда нада. одень пионерский галстук на шею, сделай фото c телефона и повтори с гпс - сразу спутники найдет;)))",
				"added": 1602399859
			}
		],
		"1597184444_1LBxgBiCcnTFh4mEyaF3ycmPY2ciC3c3Kj": [
			{
				"comment_id": 47,
				"body": "https://github.com/clostra/newnode исходные тексты... какие то изменения в днях, пока еще живое.",
				"added": 1597209098
			},
			{
				"comment_id": 48,
				"body": "в doc описание протокола (криво, но хоть как то).",
				"added": 1597259885
			},
			{
				"comment_id": 49,
				"body": "скорее всего это нерабочий прототип:) :\n\n#include \"network.h\"\n\nssize_t d2d_sendto(const uint8* buf, size_t len, const sockaddr_in6 *sin6)\n{\n    return -1;\n}",
				"added": 1597293075
			}
		],
		"1598358733_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 54,
				"body": "может просто перебухал? хотели бы замочить, так шею бы на ступеньках свернул. нахрена этот цирк с пилюлями? \"клиент всегда мертв\"",
				"added": 1598597898
			},
			{
				"comment_id": 55,
				"body": ">Препараты, регулирующие ацетилхолин, используются для борьбы с нейродегенеративными >заболеваниями.\n>Короче вы не поверите но я через это проходил в 98-2000 годах был пиздюком совершал косяки сажать >меня не могли по возрасту это случилось в маленьком городке с населением менее 50 742 человека люди >которые это сделали сделали это не просто так это вещество вызывает нарушения нервной системы и >нарушает память выводит человека из строя до конца его жизни вот уже 12 лет я пытаюсь вычисли эту >мразь\nЕсть 1001 способ отправить клиента на свидание с давно усопшими родственниками.  Вопрос в том, что правильный ответ - самый простой. Про Навального забывать стали, утратил актуальность (это раз). Т.е. особой угрозы никому он не представлял, а в чем то был (есть) даже удобен (не нужно заморачиватся с новыми клиентами). Дабы истину узреть, рассмотрим, что происходило в UA несколько ранее (2004 году). Все со слов человека умудренного жизненным опытом. Подпишусь под каждым словом.\nКлиент - Витя (погяняло - пчеловод). отравление - диоксином. Крику - \"всех не перетровите\" в ушах звон стоит. далее, клиент - в президенты (морду конечно покарежило, но то такое. злые языки конечно утверждают не диокcин а неудачная пластическая операция). в начинающей демократии конечно по факту отравления заводят дело (покушение на убийство, не говоря про покушение на кандидата в президенты). по факту - де дело? это ж мокрота, все проще простого. закрыть - не получится, что то доказать - де круг подозреваемых????. ну и все по тихому спускается на тормозах... вопрос, а кому это все было выгодно? пчеловода супруга говорят какую то клинику строила... и дебет с кредитом слегка не совпал на кучу бабла среднего размера... да и пострадавшего почки должны были давно отвалится. а он до сих пор кислород портит...\nлично я предлагаю посчитать кому это выгодно (Навайльный отровлен, героический противник кровавому режиму и т.д.) и кто будет иметь из под этого дивиденты;).  может это просто вариант с жертвенным телом? (страховая компания \"альбатрос\") или может просто перебухал?",
				"added": 1598629806
			},
			{
				"comment_id": 56,
				"body": "никто никого не подставляет. у пациента (навального) были видать проблемы со здоровьем. а ситуацию задним числом пытаются прикрутить к решению каких то вопросов. по поводу санкций - как раз в точку.\nс тем же газом. даже ежу понятно что сжиженный газ от амеров, за счет логистики и двойной переработки (сначала в жидкий, потом обратно) будет по себестоимости выше трубного. едиственный способ его продать (а это актуально, в революцию бабла вбили нереально много) - сделать так чтоб трубный был дороже. и после этого начинаются санкции. кто больше всех воняет по поводу? амеры - источник сланцевого чада. следующие по новостям - поляки. причина - в терминал по приему амерской мачмалы вкатили кучу бабок. как его окупить если оно по стоимости выше получается трубного??? только один способ - либо сделать трубный дорогим, либо создать его дефицит, шоб покупателю некуда было деватся.\nничего личного, только бизнесс.",
				"added": 1598676957
			},
			{
				"comment_id": 58,
				"body": "ну типа в мыльной опере висит себе и висит на стене ружье. и в нужный момент стреляет... новичек!!!!!\nот спрашивается, нахрена травить опозиционера к которому все потеряли интерес? наоборот он был крайне удобен. опозиция есть, а толку с ее никакого!. и тут нате... новичек... ба-бах...\nсдается мне господа, это была комедия (с) \"Человек с бульвара Капуцинов\"",
				"added": 1599071728
			},
			{
				"comment_id": 59,
				"body": "ну вопрос кто дуста подсыпал - не раскрыт. и самое главное когда оно (дуст) попало в организм (а может только в анализах?) пациента. в конце сюжета навальный чудесным образом выздоравливает? как витя пчеловод, в 2004?",
				"added": 1599108824
			},
			{
				"comment_id": 60,
				"body": "ps. все источники \"информации\"... что есть те кто верит что они пишут/говорят???? единственный способ проверить - подождать и посмотреть как оно будет. если выздоровеет как скрипали (невероятная победа западной медицины), то это вызовет смутное подозрение что нас кто то обманывает...",
				"added": 1599109072
			},
			{
				"comment_id": 61,
				"body": "как нам показывают. видео - два сотрудника спецслужбы прилетают в англию, рассматривают достопримечательности, посещают дома терпимости и пользуются услугами представительниц секс индустрии. потом совершают свое черное дело.\nкак на это посмотреть со стороны. два дебила идут на мокроту, абсолютно не подготовленных, не прочитавши правила конспигации от феликса эгмундовича, да не то, что руководство... чтиво с rutor \"начинающий кладмен\" тоже не читали. прилетают вдвоем одним рейсом, слоняются под камерами по всему городу, ходят по бл$^&м и после этого идут тровить скрипалей...\nвыясняется что ангицкая полициия при осмотре места проишествия тоже не нашла флакон с йадом...\nПотом данный флакон находят два наркомана (копи не нашли) и нюхают его до полного изнеможения...\nВы верите в эту историю? не ну конечно на агента 007 очень похоже...\nps. а те двое вокруг дома де бухал навальный в деревне случаем не ходили????",
				"added": 1599126454
			},
			{
				"comment_id": 62,
				"body": "> [nxzr](#comment_2_17AFLJs8xeL5rEZd9BuBfgPPAtRcReErBm): да они в наглую просто зделали не скрываясь я надеюсь что рашки за это хуев натолкают и за кошку скрипалей спросят\nте два клиента просто попали под камеру и все...  то что скрипаль как и навальный - отработанный материал, ежу понятно. а кто с этого \"отработанного материала\" решил получить бонусы... самое простое обяснение - самое правильное.",
				"added": 1599321918
			},
			{
				"comment_id": 63,
				"body": "> [nxzr](#comment_2_17AFLJs8xeL5rEZd9BuBfgPPAtRcReErBm): да они в наглую просто зделали не скрываясь я надеюсь что рашки за это хуев натолкают и за кошку скрипалей спросят\n\nps. как обьяснить, что могучий скотланд ярд не нашел флакон с отравой на месте преступления?",
				"added": 1599321977
			},
			{
				"comment_id": 64,
				"body": "на 100% выйдет из комы и будет дальше разглагольствовать... причем в отличии от простых смертных, тяжелое отравление на нем практически не скажется. типа витька, которого пчелы покусали (почки должны были выпасть в трусы, по факту ходил даже разговаривал). анекдоты про йад начинают потихоньку приедатся...",
				"added": 1599487903
			},
			{
				"comment_id": 65,
				"body": "скоро будет опять водку пить и понятное дело обличать отровителей. даже не смешно.",
				"added": 1599808735
			},
			{
				"comment_id": 67,
				"body": "можно жрать попкорн. i'll be back, практически. восставший из пепла и полностью излечившийся от йада пообещал, что он вернется. ну и будет пить водку и обличать кровавый режим.",
				"added": 1600147664
			},
			{
				"comment_id": 79,
				"body": "заглохла тема с анальным... не смог он возглавить движение по развалу кровавого режима...",
				"added": 1602951321
			},
			{
				"comment_id": 91,
				"body": "да табуреткой в пьяной драке по башке... и всех делов... какие то понты с дустом развели, зачем - непонятно.",
				"added": 1609498669
			},
			{
				"comment_id": 92,
				"body": "пьяная драка в коммунальной квартире это не какой нить сраный шаолинь!!!",
				"added": 1609602171
			},
			{
				"comment_id": 93,
				"body": "а белая лошадь будет в момент прилета? анальному еще б двух донских казаков для порядка - зильбертовича и черного негра тома...",
				"added": 1610725255
			},
			{
				"comment_id": 94,
				"body": "х-з говорят...;)",
				"added": 1610783105
			},
			{
				"comment_id": 95,
				"body": "замели терпилу...",
				"added": 1610960936
			},
			{
				"comment_id": 105,
				"body": "скорее всего обычный дуст...",
				"added": 1614529461
			}
		],
		"1598849641_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 57,
				"body": "translate.google.com в отличии от google.com капчу не запрашивает почему то...",
				"added": 1598953756
			},
			{
				"comment_id": 76,
				"body": "нас много. нас рать.",
				"added": 1602694895
			},
			{
				"comment_id": 78,
				"body": "нас рать;))).",
				"added": 1602829510
			},
			{
				"comment_id": 83,
				"body": "?в смысле *.gov?",
				"added": 1603729182
			}
		],
		"1599993973_1LBxgBiCcnTFh4mEyaF3ycmPY2ciC3c3Kj": [
			{
				"comment_id": 66,
				"body": "полная херня. нет текстов, не возможно проанализировать шо оно представляет собой на самом деле.",
				"added": 1600057787
			}
		],
		"1600474283_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 69,
				"body": "про тор + торрент - вроде на каждом углу пишут, не делайте такого.",
				"added": 1600523081
			},
			{
				"comment_id": 71,
				"body": "> [anonymouslogin](#comment_32_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Пишут, но если инструмент будет работать , то не вижу причин его не использовать. [...]\n\nпроблема в том что при таком типе файлообмена, анонимность просто напросто теряется. если анонимность не условие - то проблемы конечно нет.",
				"added": 1600683926
			},
			{
				"comment_id": 72,
				"body": "retroshare рулит;) _ttps://retroshare.cc/",
				"added": 1600751141
			},
			{
				"comment_id": 77,
				"body": "[anonymouslogin](#comment_33_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Ап, актуально.. [...]\nпро то что сидеры могут быть TCP, в частности http я понимай. но дело в с корости. падает существенно\nи чем тогда торрент будет отличатся от всего остального? типа wget http://....onion/... ?",
				"added": 1602829481
			},
			{
				"comment_id": 81,
				"body": "1) по поводу wget - заменит обычный браузер.\n2) по поводу тор:\nНапример, адрес книжной Флибусты в глубинном Интернете\nhttp://flibustahezeous3.onion\nДописываем в конце ссылки .cab \nПолучается http://flibustahezeous3.onion.cab\nПопадаем в книжное братство Флибусты через обычный браузер.\n\nвзято: _ttps://www.liveinternet.ru/users/lagad/post387633527\nтаких прокси - пруд пруди...\n\nps. надо просто поднять сайт в тор и все.",
				"added": 1603097994
			},
			{
				"comment_id": 82,
				"body": "\"то тарелками пугают,  дескать подлые летают....\" (c) В.Высоцкий",
				"added": 1603122095
			},
			{
				"comment_id": 84,
				"body": "> [smashbuckler](#comment_11_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): https://notopening.com/site/flibustahezeous3.onion - не загружается в тор-браузере... Умерло?\n_ttp://lostapp.ru/soft/onion-cab можно другие глянуть.",
				"added": 1603872438
			}
		],
		"1602197157_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": [
			{
				"comment_id": 74,
				"body": "земля хоть не плоская?",
				"added": 1602225936
			}
		],
		"1603054791_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": [
			{
				"comment_id": 80,
				"body": "а про то как агент молдер гнал летающий тазик нема ничего?;)",
				"added": 1603097714
			}
		],
		"1604363170_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": [
			{
				"comment_id": 85,
				"body": "yggdrasil тоже работает",
				"added": 1604433059
			},
			{
				"comment_id": 86,
				"body": "в чем то проблема? на роутере (прошить openwrt) поставить tor, а на компе убрать default route? ну чтоб уже с гарантией ничего не лезло;). можно еще на роутере sysctl -w net.ipv4.ip_forward=0 , sysctl -w net.ipv6.conf.all.forwarding=0 . чтоб даже если и впоймал через все это (tor, zeronet и т.д.) какую то спирохету, которая отправляет \"чувствительную информацию\":), то она не шмогла б ее никуда отправить;).\nps. в настройках браузера, зеронет и т.д. ясен пень надо указывать в качестве прокси - роутер;).",
				"added": 1604644801
			}
		],
		"1605002924_1KBkXs64bRMnZoTXzq5gdrsd1ZupSfMrwE": [
			{
				"comment_id": 88,
				"body": "арканоид браузерный уже есть;).",
				"added": 1605007865
			}
		],
		"1607389065_14qehPmJvdCxmQ3Dfs5gEHovBXxPhTgzcQ": [
			{
				"comment_id": 89,
				"body": "_ttps://wiki.bitmessage.org/ . \nA remote code execution vulnerability has been spotted in use against some users running PyBitmessage v0.6.2. The cause was identified and a fix has been added and released as 0.6.3.2 here. If you run PyBitmessage via code, we highly recommend that you upgrade to 0.6.3.2. Alternatively you may downgrade to 0.6.1 which is unaffected. .\nBitmessage developer Peter Šurda's Bitmessage addresses are to be considered compromised. \nRCE? RCE! я бы не стал им пользоватся вообще. идея может и не плохая,  реализация - кал.",
				"added": 1607670363
			}
		],
		"1607193064_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC": [
			{
				"comment_id": 90,
				"body": "периодически падает i2pd - поделка i2p. падает с ошибкой - двойное освобождение памяти. \n судя по состоянию стека, с какого то кривого пакета, что наводит на грусные мысли о том что в i2pd есть ошибка приводящая к удаленному выполнению кода. раньше такое было регулярно, сейчас затихло. нашел фуззер, попробую на новый год его натравить.",
				"added": 1609021514
			}
		],
		"1611078994_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY": [
			{
				"comment_id": 96,
				"body": "а яхта куда делась? помню яхта еще была.",
				"added": 1611143387
			}
		],
		"1612044848_17JnHiRfgz1bvhsC2ii8naN9tMwMHzG1zg": [
			{
				"comment_id": 97,
				"body": "тяжела и неказиста жизнь простого анархиста....",
				"added": 1612514789
			},
			{
				"comment_id": 98,
				"body": "потом... как обычно;))) серпом по яйцам, молотком по голове!!!!",
				"added": 1612549418
			},
			{
				"comment_id": 99,
				"body": "ps. проклятым капиталистам, ясен пень;)))",
				"added": 1612549440
			},
			{
				"comment_id": 106,
				"body": "как Вы не поймете;) нету ни большевиков, ни эссеров, ни анархистов. давно все прошло. это уже история.\nВы посмотрите по сторонам. народ ходит, тупит в свои телефоны... в новостях, по одной шкале ценностей, авария восем трупов и какая то овца забыла на показе мод надеть трусы... многие даже не смотрят куда идут, под ноги не смотрят. А Вы хотите им толковать про справедливое распределение материальных ценностей которое создает общество;). Они увязли в своем иллюзорном мире;). Осталось только зарядку смартфона сделать так чтоб она работала от владельца;)) (кстати был такой прект;) ).",
				"added": 1614848656
			}
		],
		"1612805001_17JnHiRfgz1bvhsC2ii8naN9tMwMHzG1zg": [
			{
				"comment_id": 100,
				"body": "без экспроприации экспроприаторов как то грусно и не интересно;).",
				"added": 1612817408
			},
			{
				"comment_id": 101,
				"body": "левацкая бредятина... истинный коммунизм... ааа, и еще гулаг. а напомните мне, что было с японцами американского происхождения после перл харбора? когда их выпустили? поинтересуйтесь уважаемый, англоязычными источниками. если не хотите утруждать себя переводом: _ttps://ru.wikipedia.org/wiki/%D0%98%D0%BD%D1%82%D0%B5%D1%80%D0%BD%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5_%D1%8F%D0%BF%D0%BE%D0%BD%D1%86%D0%B5%D0%B2_%D0%B2_%D0%A1%D0%A8%D0%90 . почти как у нас клеймили гулаг, кстати.",
				"added": 1613246998
			},
			{
				"comment_id": 102,
				"body": "jk7, может вам интересны и другие демократические \"подвиги\"? опять же, гугль, англоязычные источники. тоже самое без усилий по  переводу: _ttps://ru.wikipedia.org/wiki/%D0%AD%D0%BA%D0%BE%D0%BB%D0%BE%D0%B3%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B0%D1%8F_%D0%B2%D0%BE%D0%B9%D0%BD%D0%B0_%D0%A1%D0%A8%D0%90_%D0%BF%D1%80%D0%BE%D1%82%D0%B8%D0%B2_%D0%92%D1%8C%D0%B5%D1%82%D0%BD%D0%B0%D0%BC%D0%B0 . причем все как то молчат и не вспоминают о том сколько граждаских там погибло.",
				"added": 1613248273
			},
			{
				"comment_id": 103,
				"body": "> [praid256](#comment_11_17JnHiRfgz1bvhsC2ii8naN9tMwMHzG1zg): Забань jk7, как я это сделал. Он токсик ужасный.\nта нехай пишет;)).  у нас же тут свобода слова;). максимум что он может написать - это пересказать то, что ему говорят по телевизору. Один знакомый сказал, что еще три поколения должно пройти, пока сидя в говне по самые уши, не начнут думать головой;). обьективный ход истории;).",
				"added": 1613376105
			},
			{
				"comment_id": 107,
				"body": "как пересекаются бабло и экономические взгляды?;)",
				"added": 1615138339
			}
		],
		"1615506931_1LJx7UWxfu1L7KZeNxdggqQqewk2CwEXWG": [
			{
				"comment_id": 108,
				"body": "зауважал зеронет",
				"added": 1615666791
			}
		],
		"1615652099_15JFnMnQDvpoERDBankFjwVSpiaLSsTTxq": [
			{
				"comment_id": 109,
				"body": "а для линупса?",
				"added": 1615669039
			}
		],
		"1616908801_13RFu1n9Bc3vCg8vWLtYhWux6WEoXvayxA": [
			{
				"comment_id": 110,
				"body": "пида-сы из твиттера залочили мне аккаунт, причем я вообще ни слова не написал, только читал. письма в службу поддержки - ни ответа ни привета... никаких обяснений в т.ч. вразумительных... аккаунт жалко;) привык, давно он у меня был:)",
				"added": 1616955488
			},
			{
				"comment_id": 111,
				"body": "так я ж вообще ничего не делал! ничего не комментировал, ничего не заявлял;). просто читал;). правда не помню когда поcледний раз заходил туда не через tor. единственное предположение, что эти уроды не смогли идентифицировать кто читает. а зачем им это?;)",
				"added": 1617086552
			},
			{
				"comment_id": 112,
				"body": "> [geekless](#comment_452_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): У меня круче было. [...]\nпробовал и это - не восстанавливает.",
				"added": 1617098682
			},
			{
				"comment_id": 113,
				"body": "> [nahttoter](#comment_7_1P72q2Lvd9BiogLZFScvQ1sU38fSY6GMsf): Вы - это не только то, что вы пишете, но и то, что вы читаете. Круг ваших интересов таких образом определяется.  Если нет привязки к уникальному ID (вы же через Tor читаете), то сложно составить и профиль ваших интересов. Соответственно и сложно подсовывать вам контекстную рекламу. А без оной вы им и не нужны. Раз заблокировали, то вероятно вы слишком хорошо прятаться научились.\n\nт.е. смысл этой хрени - всунуть контекстную рекламу?;) проще некуда - бабло?;)",
				"added": 1617966845
			},
			{
				"comment_id": 114,
				"body": "т.е. мы пришли к простому выводу - все разговоры про свободу слова, какую то демократию и дальнейший набор букв - это просто туфта, ширма, за которой стоит банальное бабло. не так ли?;)",
				"added": 1618073386
			},
			{
				"comment_id": 115,
				"body": "оказывается не один я так думаю;)))).",
				"added": 1618130100
			},
			{
				"comment_id": 116,
				"body": "они все такие;). фидронет может чище был;). а сейчас - только есть инфа которая не вписывается в рамки той, которую они проталкивают - сразу цензура.",
				"added": 1618661192
			}
		],
		"1621742818_1Hv6XQPZGmAkb47zJy7ednE7gBRCCJCQYp": [
			{
				"comment_id": 117,
				"body": "говорят этот долбоеп хотел взорвать 500мегатонн и померять уход прецессии земной оси. ну типа дайте мне рычаг и я сдвину землю. вроде как Хрущев как истинно колхозный жлоб сказал что и 50 хватит. что собственно и спасло;).  уход прецессии удалось зафиксировать даже при 50мегатоннах. и ударная волна раз 20 вокруг земли обошла.",
				"added": 1622277248
			},
			{
				"comment_id": 118,
				"body": "результат конечно был.... любители нюхать портянки Хо-Ши-Мина после этого как то перестали планировать нанесение ядреного удара и у них там развелось полно хиппи, дети и цветы, борцы за мир всякие... колхозного с генсеков поперли. даже в твердых умах членов цк кпсс созрела мысль о том что за рулем паравоза который вперед летит без остановки, находится не совсем адекватно понимающий, что на все кнопки подряд нажимать нельзя. ну а академик... так он до того с носаря открывал любые двери в кремле, а тут его, с его идеями в третьесортный институт на незаметную должность - сильно обиделся и начал боротся с тоталитарным режимом...",
				"added": 1623328488
			}
		]
	},
	"comment_vote": {}
}