{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1543656691,
			"title": "Hello world!",
			"body": "Hello ZeroNet surfers! I'm new here and I need some help getting started. I've just created a username at Zeroid. What can I do here? I'm interested in community forums, real time chat and probably file sharing. How many sites are on ZeroNet? Is there any search engine? Thanks in advance.",
			"added": 1543656690
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1543656691_1HbvuN84epzW1vjpRjgemxPADB6UqdZpvy": [
			{
				"comment_id": 1,
				"body": "> [trenta3](#comment_54_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): @bitcoder You may be interested in ZeroTuto a wiki for newcomers that want to get started and know more about ZeroNet. [...]\n\nI tried ZeroSites just after creating this thread. Unfortunately, for some reason I can't download the page.",
				"added": 1543658817
			},
			{
				"comment_id": 2,
				"body": "Maybe it fails to download the page because I haven't port forward my router? It says \"Tracker connection error detected\" and \"Content.json download faild\" continuously.",
				"added": 1543659197
			},
			{
				"comment_id": 3,
				"body": "> [trenta3](#comment_55_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): This is very strange, ZeroSites is one of the most seeded site.Maybe you just have to wait a little bit to get all the content.Have you tried visiting it now?\n\nIt fails to download no matter how long I wait. I tried multiple times but it always fails. I will have to research this. Thanks for the help! :)",
				"added": 1543659583
			},
			{
				"comment_id": 4,
				"body": "> [timelinehyperbot](#comment_45_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): Welcome bitcoder to ZeroNet.  :)\n\nThank you! The future looks promising! :D",
				"added": 1543661705
			},
			{
				"comment_id": 5,
				"body": "> [trenta3](#comment_56_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): No, port forward helps you to contact more peers and is good to download sites with few peers and to help the zeronet network.For sites with lots of peers you don't need it, since you can contact one of the peers that has an open port. [...]\n\nEverything looks to work OK, after all I  can post here and changes are being sent to the network. In the main page it shows me 9/20 trackers.",
				"added": 1543661862
			},
			{
				"comment_id": 6,
				"body": "> [trenta3](#comment_54_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): @bitcoder You may be interested in ZeroTuto a wiki for newcomers that want to get started and know more about ZeroNet. [...]\n\nHey, for some weird reason, ZeroTuto is empty. Hmm..",
				"added": 1543662071
			},
			{
				"comment_id": 7,
				"body": "> [trenta3](#comment_57_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): This is really strange, try to look at the execution log when you visit Sites.\n\nWhere is the execution log located?",
				"added": 1543664272
			},
			{
				"comment_id": 8,
				"body": "> [trenta3](#comment_59_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): @bitcoder Then some scenario that comes to my mind (think before saying if you is in one of those since it could reveal something more about you): [...]\n\nI'm using my home internet connection. I have no special firewall rules on it. Unfortunately I can't setup UPnP or port forward on my router right now because I have forgot the admin password. Probably the AV firewall has messed something up here? Please note that I am a Linux user although I'm connecting to ZeroNet from a Windows PC at the moment, so I don't have much knowledge about this crap OS. Thanks for your help. :)",
				"added": 1543664570
			},
			{
				"comment_id": 9,
				"body": "> [ssdifnskdjfnsdjk](#comment_505_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): i think trenta3 meant ZeroNet/log/debug.logit will show you more details about what is Zeronet doing. ZeroTuto shows 4 connected peers there and i have closed port and Tor: availableMake sure you have tor available or always so you have better chance to connect more (onion) peers.\n\ntor says connected. It is part of ZeroNet bundle, I think.",
				"added": 1543677612
			}
		]
	},
	"comment_vote": {
		"729_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": 1,
		"54_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": 1,
		"45_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": 1
	}
}