{
	"next_comment_id": 21,
	"user_name": "Quantumworld",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"post_like": {
		"1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1551272253": 1551280617,
		"1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1554083879": 1554159141
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "The Linux Verson of this is a total joke. No executable and no documentation.  Not worth downloading and wasting time on. And why do we need a browser just for zeronet?",
			"post_uri": "1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u_1544514738",
			"date_added": 1544671981
		},
		{
			"comment_id": 2,
			"body": "Gab Rocks! They are kicking out all the LibTards just like Twitter is. Welcome to Censorship Ya Faggot Cross Dressing Tranny Cartoon Fapping Cry Baby!!! ",
			"post_uri": "15VYBx1CGRe4VfqmywRjjB5Z3XtT6pMx6k_1544717859",
			"date_added": 1544860090
		},
		{
			"comment_id": 3,
			"body": "@PussySlayer: I have seen dumber shit posted by LibTards. They all seem to want to start a fight but cant finish one. They love censorship and cant wait to play Nazi victim while the spew Hitlers New World Order garbage all over the web in a Gay Parade.",
			"post_uri": "15VYBx1CGRe4VfqmywRjjB5Z3XtT6pMx6k_1544717859",
			"date_added": 1544890178
		},
		{
			"comment_id": 4,
			"body": "Added to my ban list!  LOL.. Just kidding..\nThe fact that Zeronet is able to be used in China just shows you how good Zeronet is.  ",
			"post_uri": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1549226208",
			"date_added": 1549227544
		},
		{
			"comment_id": 5,
			"body": "That needs to be updated. That is kinda odd..\n",
			"post_uri": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1549228743",
			"date_added": 1549229036
		},
		{
			"comment_id": 6,
			"body": "@FraYoshi: Enjoy the quiet for now. It will change very soon.  I expect 100% growth rate of Zeronet minimum in 6 months and that is super super conservative.  I am basing this on how much censorship is going on and how much survalence is going on. Unless there is a major change Zeronet most likely will be bigger than clearnet in the future.",
			"post_uri": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1549226208",
			"date_added": 1549229275
		},
		{
			"comment_id": 7,
			"body": "@FraYoshi: Now all we need is good content posters.",
			"post_uri": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1549226208",
			"date_added": 1549229682
		},
		{
			"comment_id": 8,
			"body": "@Realjohndoe: A government run healthcare system is totally garbage. I was turned down from Obama care because I was a white male. Nothing is free. Socialism is nothing more than a giant scam that makes money from smashing all opposition to there tyranny. ",
			"post_uri": "1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u_1549323740",
			"date_added": 1549365684
		},
		{
			"comment_id": 9,
			"body": "@Mytesd: I never liked reddit. Don't know why but never did. And still don't. ",
			"post_uri": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1549226208",
			"date_added": 1550564277
		},
		{
			"comment_id": 10,
			"body": "Good question! ",
			"post_uri": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1551272253",
			"date_added": 1551280632
		},
		{
			"comment_id": 11,
			"body": "@Pubg: Is there a man page on this graphic? If not can some one make one? ",
			"post_uri": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1551272253",
			"date_added": 1551286197
		},
		{
			"comment_id": 12,
			"body": "Can you define that a little more?",
			"post_uri": "1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1_1553706057",
			"date_added": 1553706055
		},
		{
			"comment_id": 13,
			"body": "I like that idea, and I hate that idea. And you can only do that on Windows systems. Linux wont let you do it.",
			"post_uri": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1554083879",
			"date_added": 1554159312
		},
		{
			"comment_id": 14,
			"body": "When will this be officially be released? (Out of beta testing.)",
			"post_uri": "1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u_1556911721",
			"date_added": 1557011675
		},
		{
			"comment_id": 15,
			"body": "Cool another SJW Safe space for cry babies.. Right??",
			"post_uri": "174zuaSY2Fh9K6ZVFHe3EP45wnAsvAghGd_1557088633",
			"date_added": 1557112530
		},
		{
			"comment_id": 16,
			"body": "@KxoBot: Technically I am independent. And I never get offended by anyone's posts or comments. Everyone has a right to an opinion. And thank God they are different enough that there is some separation between Logical thought and illogical ideology based on lies and slander.\nEither way a good solid block list tool may be necessary in the future on Zeronet. Code on you have my 100% support.",
			"post_uri": "174zuaSY2Fh9K6ZVFHe3EP45wnAsvAghGd_1557088633",
			"date_added": 1557114116
		},
		{
			"comment_id": 17,
			"body": "@KxoBot: I think there is only about 200 active English speaking Zeronet users on here. I get allot of blow back from very odd people when I post links about Zeronet, who hate Zeronet even though they have never used it. Most likely government intel related. Cant prove it but they all seem to say the exact same things which makes it very interesting to say the least. A good solid block list tool with lots of logical user choice options is a good idea. Would be nice to see one that had a timer block. Like the ability to block some one for a day week month year etc. We all have our moments of stupid rants about what ever subject. A timed unblock would be really good for some one who hits social media on a drunken posting spree crap posts. ",
			"post_uri": "174zuaSY2Fh9K6ZVFHe3EP45wnAsvAghGd_1557088633",
			"date_added": 1557115033
		},
		{
			"comment_id": 18,
			"body": "I like it and i don't like it. To bad it can't it censor Mark Zukaberg or Jack Dorcey. ",
			"post_uri": "174zuaSY2Fh9K6ZVFHe3EP45wnAsvAghGd_1557305240",
			"date_added": 1557306007
		},
		{
			"comment_id": 19,
			"body": "Drama Queen.. lol",
			"post_uri": "174zuaSY2Fh9K6ZVFHe3EP45wnAsvAghGd_1557292748",
			"date_added": 1557306375
		},
		{
			"comment_id": 20,
			"body": "Wow, it is back? Usually remakes of old TV shows totally suck. Especially now days. You cant offend anyone so the shows totally suck.",
			"post_uri": "1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u_1557667807",
			"date_added": 1557689528
		}
	]
}