{
    "title": "Poster",
    "description": "A simple blog for zeronet",
    "next_post_id": 11,
    "modified": 1432515194,
    "post": [
        {
            "post_id": 8,
            "date_published": 1563032111444,
            "body": "<h1 class=\"title\">Introduction à \"poster\"</h1><br>\"Poster\" est un système de blog clonable, comme le Zero blog classique, mais il s'en distingue par les caractéristiques suivantes :<br><br>- L'édition se fait en HTML restreint.<br>- Possibilité de charger des images ou des documents d'une manière simple.<br><br>La barre du haut de la fenêtre d'édition facilite la vie de ceux qui ne sont pas familiers avec HTML.<br>Un bouton dans cette barre permet de charger  des images ou des documents dans le blog et aussi fabrique <br>la balise de lien html correspondante.<br><br>Ci-dessous l'aspect de cette barre d'édition.<br><br><img src=\"uploads/barre_edi.png\"><br><br>On trouve de gauche à droite :<br><br>- le bouton pour charger images ou documents dans le dossier \"upload\"<br>- le bouton pour entrer des titres<br>- la création d'un paragraphe<br>- l'édition en italiques<br>- l'édition en caractères gras<br>- les lignes barrées<br>- les listes numérotées<br>- les listes simples<br>- les liens<br>- l'édition de blocs de code (pas d'interprétation html de ce qu'on écrit) <br><br>On peut élargir la fenêtre d'édition, en tirant avec la souris sur les trois petits traits en bas à droite.<br><br><h1 class=\"title\">Essais</h1><br>Ci-dessous exemple d'une photo chargée simplement avec le bouton de gauche.<br><br><a href=\"uploads/test.png\" target=\"test.png\"><img src=\"uploads/test.png\"></a><br><br><h1 class=\"title\">Remarque</h1><br>Ce qui est dommage avec poster, c'est que l'édition d'un nouveau bloc se fait toujours en tête. Il aurait été intéressant de pouvoir choisir la position du nouveau bloc.<br><br>En effet, dans le cas d'un BLOG, il n'y a pas de soucis, mais si on veut créer un site, il faut pouvoir insérer des blocs à n'importe quelle position.<br><br>Mais bon !  poster a été fait pour les BLOGs<br><br>Si quelqu'un connaît un autre système aussi sympa que POSTER mais qui comble les manques précisés ici, merci de poster un message.<br>"
        }
    ]
}