{"cert_user_id": "fermmm@github", "next_comment_id": 3, "comment": {"1604065299_mirrored_Tomas-M_github": [{"comment_id": 1, "body": "I heard IPFS protocol is being added by default in Firefox. If I understand everything correctly, IPFS can be used to implmenet a faster and better zeronet without the user installing anything.", "added": 1520549656, "modified": 1520549703, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/449#issuecomment-371687446", "source_type": "github"}], "1604065695_mirrored_fermmm_github": [{"comment_id": 2, "body": "> allow their phones to be serving P2P requests all day for the site to continue being operational - that tends to be bad for battery life and data caps.\r\n\r\nWhy not host the application only while using it? An application made with this can contain a ZeroNet client that stops when the application stops.\r\nThe creator of the app can rent a server to seed the application just in case nobody is using it, maybe is not necessary in a successful application. The cost of renting a seed server should be low, affordable for anyone.\r\nAlso the app can be multi platform so web users can also help with the hosting.\r\nMaybe I don't understand something about how ZeroNet works.", "added": 1484195347, "modified": 1484195964, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/763#issuecomment-272095404", "source_type": "github"}]}, "next_topic_id": 2, "topic": [{"topic_id": 1604065695, "title": "Idea: Something like Phonegap but with ZeroNet", "body": "Is it technically possible to create like a Phonegap/Cordova compiler to build mobile applications that are Zeronet sites? Is this planned?\r\n\r\nThis can be a revolution, bringing Zeronet to all the people, enabling devs to make networking native apps for mobile without needing big amounts of money to rent servers, non profit and working.\r\n\r\nJust an example: A dating app like Tinder that is much better because the guy with the best ideas does not need money and a business model to pay the rent of the servers and is super populated because there is no need to pay because there is no cost. This is just an idea that came to my mind while writing this, imagine the possibilities and the revolution of a non profit quality mobile networking apps.\r\n\r\nPhonegap it's a compiler that creates a an application with a \"hidden browser\" that only loads your website, it's just a way to create native applications using html/js/css. Is based on Apache Cordova which is open source as far as I know,\r\n\r\nMaybe there is a way to replace the \"hidden browser\" of Cordova with something like a \"zeronet hidden browser\" so we can convert any zeronet website into a native mobile application.\r\n\r\nI think ZeroNet is much more usefull in the native application world than in the web because an extra download to browse ZeroNet is something that stops potential users.", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1484183766, "modified": 1484195964, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/763", "source_type": "github"}]}