{
	"next_comment_id": 15,
	"comment": [
		{
			"comment_id": 1,
			"body": "EDIT: @moor: I've added a little paragraph mentioning blocklists and moderation before I delve into the scaremongering article. I still think the original was clear enough, but it can't hurt to mention one more time.\nI'm not convinced ZeroTalk needs moderation. Although from the “front page of ZeroNet” perspective I do understand it could be a good idea. It's one of the first zites any newcomer will visit, and having it plastered from top to bottom with profanities could be detrimental to platform growth. But in principle I think ZeroTalk is the type of zite that can function with no moderation at all. A link is just text, even if it leads somewhere we'd rather not go. I understand that some governments consider links to copyrighted content to be grounds for legal action in themselves these days, but by that metric Facebook, Twitter, Youtube, etc. are some of the most illegal sites on the internet.",
			"post_id": 5,
			"date_added": 1565305985
		},
		{
			"comment_id": 2,
			"body": "> [anonymouslogin@zeroid.bit](#comment_1_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Where is the article?\n\nit hasn't been written yet :-p",
			"post_id": 3,
			"date_added": 1571385490
		},
		{
			"comment_id": 3,
			"body": "> [fractalzoomer@zeroid.bit](#comment_1_1CJc7iRKb8yncAkdF29t1M85mhfYEKgAFj): What cryptocurrencies/intermediaries are you planning to use for payment processing?\n\nI've looked into Paypal and that looks feasible, public ledger cryptocurrencies like Bitcoin should also be feasible. Verifying payments in the site is not a priority though.",
			"post_id": 8,
			"date_added": 1585683074
		},
		{
			"comment_id": 4,
			"body": "> [pyra@zeroid.bit](#comment_1_1F87dd49JyvrShxjTz6jszGnxm7bn8if6m): you spelled MayVaneDay wrong\n\nThank you! I've corrected it.",
			"post_id": 10,
			"date_added": 1594435959
		},
		{
			"comment_id": 5,
			"body": "> [ryzen1600x@zeroid.bit](#comment_1_12yZYqzpjUwq8UWdoCuA8PmoNyef5tdkku): Golang can compile to wasm .\n\nYes, but I prefer Rust, which can also compile to wasm.",
			"post_id": 7,
			"date_added": 1595723749
		},
		{
			"comment_id": 6,
			"body": "> [mg0@zeroid.bit](#comment_1_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): yeah..., so the oxygen at the other side of the fabric isn't enough for it?\n\nHonestly, I don't believe so. I've read people theorize in multiple places that the loophole was introduced because of mounting opposition rather than scientific data, but it'd be a nice test for a channel like tKoR to try.\n\nPoliticians do tend to prefer what sounds nice over what is true.",
			"post_id": 14,
			"date_added": 1598253154
		},
		{
			"comment_id": 7,
			"body": "> [bimmyql@zeroid.bit](#comment_2_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW): In an earlier thread on zerotalk, someone proposed doing this to deal with videos:\n> > j4s0f: qBitTorrent is still better for videos (the technology behind Zeronet discriminates against large files). The best is to create a website on Zeronet for linking to qBitTorrent posts.\n>\n> What do you think of that? In general, is there much ability to use different networks/protocols for different problems like this? Something resembling the \"UNIX Philosophy\" but applied to the internet instead of pipeline components.\n\nIt's a fair point, but, bittorrent still has a problem when it comes to videos (that ZeroNet also has) and that is that files are not content-addressed. With content-addressing (or deduplication) in ZeroNet that would mean that whether a peer for a file is on site A or B, peers will be able to download the file from them, in the case of bittorrent multiple torrents can point to the same file without the peers finding each other.\nThis is something IPFS has managed to solve, unfortunately IPFS makes your IP public, so it's a no from a privacy perspective (they've said Tor support is on the roadmap, but they've been saying that for 4 years and nothing has happened, although from what I hear OpenBazaar may have been able to unofficially get them to work together). There is interest among developers to extend ZeroNet with this feature as well, but so far there has not been much progress.\nNofish has stated it is more difficult to do than he expected, Blurhy said he was going to do so (then again I'm still not convinced he can actually program, only complain - forgive me my bad manners) and I had a failed attempt at a plugin for this. It's a feature that's still on the roadmap for me, but there's a lot of projects I'm working on and not much time with a full-time job.",
			"post_id": 18,
			"date_added": 1610380068
		},
		{
			"comment_id": 8,
			"body": "> [barbados@zeroid.bit](#comment_1_1EzoDvaFqLcYTBBTSFhLuHoF6C5L8x2GVg): Could technologies like IPFS help more social network style zites maintain scalability?\n\nThe scalability issue with social network sites mostly comes from querying, not so much data addressing and transmission (which is what IPFS is good at). For small communities it's easy to keep a local database with the data necessary for the site to function, but as communities grow so will the database and at some point it grows too big to expect each user to have a copy of it. Sites can (and some do) mitigate this through *ephemerality* (deleting stale content) as done by e.g. Retroshare and Aether. (As an aside: this is a problem that any blockchain-based social networks will experience multifold)\n\nIn the long term the only viable solution IMHO is *distributed search* as seen with Yacy, but also Retroshare in a way. This would mean you only have a small part of the database locally and you need internet access to communicate with peers to query other parts of the database, ideally your ZeroNet instance would favor downloading the parts of the database relevant to your follows/followers/friends, as these are the ones you're most likely to query.\nI haven't investigated the feasibility of this at all, but it's going to be a lot of work for sure. Hopefully as urgency and demand for censorship resistance rise, so will the number of developers willing to contribute their efforts.",
			"post_id": 18,
			"date_added": 1610386143
		},
		{
			"comment_id": 9,
			"body": "> [blurhy@zeroid.bit](#comment_3_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): If you have any motivation of improving the situation, why writing articles for an outdated project ?\n\nBecause I'm working on improving the situation, however slowly that may be.",
			"post_id": 18,
			"date_added": 1611791302
		},
		{
			"comment_id": 10,
			"body": "> [mg0@zeroid.bit](#comment_3_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): I noticed that the page view for each manga page isn't fit to the window width like the way 1+Gallery already does, also, every time I click the page to render the next it issues an error\n\nThank you for the report. I think I already know what the error is about, it's probably the deserialization of the settings. It's best to file these issues on the Git Center repo.\n\nAs for the page width, I'm not quite sure what you mean. The default view should shrink/grow to fit the window size. There's also chapter view which should try to fill the width and scroll through an entire chapter.",
			"post_id": 20,
			"date_added": 1614646474
		},
		{
			"comment_id": 11,
			"body": "> [mg0@zeroid.bit](#comment_3_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): every time I click the page to render the next it issues an error\n\nCould you try again? At some point the results per page limit was stored as a string and parsing the user settings was likely failing on that field.",
			"post_id": 20,
			"date_added": 1614711497
		},
		{
			"comment_id": 12,
			"body": "> [mg0@zeroid.bit](#comment_4_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): Sorry, I haven't been able to test it. It doesn't load for me anymore and I can't update 1+gallery fully, the file g4z_bg.wasm is always pending.\n\nSorry about that, it's because I tend to push updates shortly before going to bed and then forget to give them time to propagate. It's morning now so my PC will be seeding for the rest of the day.",
			"post_id": 20,
			"date_added": 1614845111
		},
		{
			"comment_id": 13,
			"body": "What I think needs reiterating is that Facebook decided for me that *the password I set five years ago was no longer valid identification*, and that they took it upon themselves to deprive me of that log-in method while I was gone. And that of all the recovery methods the only one they didn't allow me to use was the one I had set to be my *primary e-mail*.",
			"post_id": 23,
			"date_added": 1624015659
		},
		{
			"comment_id": 14,
			"body": "*An earlier version of this poem said “A deal was made, 't was far from lean, And part of it was for the queen.” This I later realized was incorrect as the British monarch in 1773 was King George III. The poem has thus been altered to refer to “the crown” instead.*",
			"post_id": 22,
			"date_added": 1624023754
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {}
}