{
	"next_comment_id": 13,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [ssdifnskdjfnsdjk](#comment_1_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I am usually using command: hostname -iDo not work always.\n\nIndeed, it doesn't seems reliable, It gives me ::1 (IPv6 localhost) even though I've IPv6 disabled :)\n\n",
			"post_id": 1,
			"date_added": 1516537791
		},
		{
			"comment_id": 2,
			"body": "> [nullpointer](#comment_1_1LTNeHLX2niwZ1Qsucq8YEe9Zwkvb7b4pw): Just installed your extension. It indeed needs some polishing, since it's not lined out right on my client. Making it configurable would be great.\n\nThank you for testing it ! Making it configurable is definitely my next focus, I'm diving into the documentation and examples :) For the positioning on-screen, it's indeed a bit hit or miss right now and I'm not satisfied either, I'll try to improve that as well.",
			"post_id": 5,
			"date_added": 1517743090
		},
		{
			"comment_id": 3,
			"body": "> [nullpointer](#comment_2_1LTNeHLX2niwZ1Qsucq8YEe9Zwkvb7b4pw): Can't help but read \"znqa\" as zin-ca. Have you thought of a name for the release of this extension? Or are you going to keep it \"znqa\"?\n\nYep, I am not super satisfied with znqa either I must say ! I had \"zndock\" or \"ZeroNet Navigator\" (with a tongue-in-cheek rework of the icon ala \"Netscape Navigator :p) in mind but maybe I should drop the \"zn\" prefix altogether, thoughts ? Any name crossing your mind ? :P",
			"post_id": 6,
			"date_added": 1517899281
		},
		{
			"comment_id": 4,
			"body": "> [ssdifnskdjfnsdjk](#comment_2_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I was always worried about automated sleep, not to interrupt something important in future. Maybe checking CPU, HDD activity before sleep can help.\n\nGood idea, adding the load average in the last 15 minutes in the max adds some more info about the \"state\" we're in ! ",
			"post_id": 8,
			"date_added": 1518251145
		},
		{
			"comment_id": 5,
			"body": "> [piloth](#comment_1_1FKuNsExQML7APuNmkCV8uzB5pKupcmnck): Yay! I can see it!! LOL. I also used my other machine to visit too so you have two more peers. Have a great day :)\n\nAwesome, thanks ! I just saw you had a blog on your own, I'll read & seed as well :)",
			"post_id": 9,
			"date_added": 1527870038
		},
		{
			"comment_id": 6,
			"body": "> [piloth](#comment_3_1FKuNsExQML7APuNmkCV8uzB5pKupcmnck): I have a question that maybe you can help with. I want to clone a GitCenter repo. I am using Windows 10 with Git installed. Do I simply just go into Git CMD and run the git clone command with the ZeroNet data directory like it says?\n\nI guess if you click on the \"clone\" button there http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/?1NaRTgwxsn17BCVSfvq6LG8NVPb9srKG5X you'll be able to clone the repo properly. But in fact, I'm not really familiar with Gitcenter on ZN which is a bit different from the usual Git servers I'm used to. Maybe @Gitcenter on ZeroMe can help ?\n\nIn any case, if you want the code, I can zip it and share it with you, just let me know :)",
			"post_id": 6,
			"date_added": 1528140114
		},
		{
			"comment_id": 7,
			"body": "> [caryoscelus](#comment_1_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Wow, apparently i'm subscribed to another suddenly revived blog ;)\n> \n> Have you tried using triple \"back-quote\"? ` ` `  (without spaces; starts and ends \"raw\" block)\n\nYou are, I do not post frequently but I sure hop in from time to time :)\n\nThanks for the tip, I'll definitely try next time",
			"post_id": 13,
			"date_added": 1560529100
		},
		{
			"comment_id": 8,
			"body": "> [somename666](#comment_1_1DccAuEVfpyANY3pgJUA9GF5YYXdJ7DHxZ): I'm interested\n\nedit : See my last post, it's up !\n\nHello and thanks for the interest ! I'll see what I can do, I tried to re-install it manually but it doesn't work anymore since it's unsigned and Firefox blocks unsigned by default now, I'll see if I can re-upload it through the formal process on Firefox Add-ons and also make it compatible with Firefox \"Quantum\". 'll post if/when I have results :)",
			"post_id": 10,
			"date_added": 1560959737
		},
		{
			"comment_id": 9,
			"body": "> [somename666](#comment_2_1DccAuEVfpyANY3pgJUA9GF5YYXdJ7DHxZ): Thank you! :-)\n\nYou're welcome ! Any ideas to improve it, feel free to share them :)",
			"post_id": 17,
			"date_added": 1561047100
		},
		{
			"comment_id": 10,
			"body": "> [somename666](#comment_3_1DccAuEVfpyANY3pgJUA9GF5YYXdJ7DHxZ): Is there a way to choose a port rather than IP? I use a private proxy to access ZeroNet, so that would be usefull.\n\nI am not sure I understand your use case ? Where do you need to set the port rather than IP ? On your favorite zites ? The favorite zites field is freetext so anything put there will be tentatively translated by the browser (even clearnet sites) so there's no restrictions if you want to include a proxy URL I think.",
			"post_id": 20,
			"date_added": 1561234448
		},
		{
			"comment_id": 11,
			"body": "> [somename666](#comment_4_1DccAuEVfpyANY3pgJUA9GF5YYXdJ7DHxZ): The extension works only if the IP is 127.0.0.1, but I use a ZeroNet proxy, so the IP I use is 192.168.70.5 or my external IP, so it would be more useful for me if the IP could be anything (I don't have a static external IP), but a specific port (*:43110). But I could always use an SSH tunnel instead of port forwarding.\n\nAh, I see, thanks for clarifying ! It doesn't seems possible though, it's denied by the regex Firefox use to define the scope of the add-on :\n\nThere was an error during installation: Extension is invalid\nReading manifest: Error processing content_scripts.0.matches.0: Value \"http://*:43110\" must either: be one of [\"<all_urls>\"], must either [match the pattern /^(https?|wss?|file|ftp|\\*):\\/\\/(\\*|\\*\\.[^*/]+|[^*/]+)\\/.*$/, or match the pattern /^file:\\/\\/\\/.*$/], or match the pattern /^resource:\\/\\/(\\*|\\*\\.[^*/]+|[^*/]+)\\/.*$|^about:/",
			"post_id": 20,
			"date_added": 1561235609
		},
		{
			"comment_id": 12,
			"body": "> [ssdifnskdjfnsdjk](#comment_3_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Hello, the znqa description on the Firefox addons website is not enough to understand what this addon does. I mean this part: \"icons in Zeronet\" - zeronet has many icons, can you tweak the description so it is apparent on which page these icons will be located and which functions these icons will have?\n\nI edited the description, hopefully it's a bit better :\n\n> Since Zeronet doesn't have a persistent navigation bar, forcing you to go back to ZeroHello to browse your saved zites, I made this WebExtension navigation bar where you can save up to 4 zites. ",
			"post_id": 20,
			"date_added": 1561484571
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}