{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1565995598,
			"title": "A thief walked out with a $2 beer. A hero shot him to death",
			"body": "Harris had spent about seven seconds inside the store. The Top Stop Shop in Memphis was busy that night, about 10 p.m. on March 29, 2018, and when the unarmed teenager waltzed through the door, he didn't waste any time being sneaky. Dressed in purple pants and a hoodie, he grabbed a $2 beer from the shelf in plain view of Ghazali, turned and left, as the clerk raced around the counter.\n\nGhazali burst toward the door past bewildered customers milling near the counter. Beverly Loverson was one. She saw Harris and the beer, and Ghazali and the gun, \"and as he passed me,\" she remembered while testifying on the stand this week, \"I said: 'Don't kill him. Don't kill him. It's just a beer.'\"\n\nGhazali spun around looking for Harris in the parking lot before spotting him bolting down the block. Ghazali took off at a sprint. He caught up and fired his gun, one, two, at least three times. Then, he went back to the store.\n\nAs he walked back inside he said, \"I think I shot him,\" according to an arrest warrant, and returned to the cash register to ring up the next guest. He never called 911.\n\nTwo days later, Harris was found dead on the same block, collapsed in a man's backyard.\n\nOn Thursday, Ghazali was convicted of second-degree murder, marking the end of a tragic case that has sparked protests and boycotts and inflamed racial tensions in Memphis as hundreds mourned the African American teenager. Ghazali is set to be sentenced next month, facing between 15 and 60 years in prison.\n\n\"This defendant took it upon himself to be the judge, the jury and the executioner over a $2 beer,\" prosecutor Lora Fowler told the jury, according to footage of the trial from WMC-TV.",
			"added": 1565995597
		},
		{
			"topic_id": 1566159714,
			"title": "#SwapACommie",
			"body": "Greetings. I’ve always strived to be a force of good in this world, to help the needy and ultimately contribute as much as I humanly can to Make the world a better place™\n\nIn that sense and following the steps of countless useless virtue signalling hashtags, I am proud to stroke my dic– I mean, ego, and present to you: The #SwapACommie Campaign!\n\nWhat is the #SwapACommie Campaign?\n\nAs its name implies, it’s a campaign that aims towards one purpose: To trade away 1st world Internet Communists for hard working 3rd world Capitalists, thus Making the world a better place™.\n\nIs this a serious campaign?\n\nOf course, why wouldn’t it be?\n\nAre you sure you want to cede your spot in that wondrous socialist utopia for a stranger?\n\nA noble sacrifice yes, a burden I along with my fellow capitalists would endure with pride so that dozens (or more) Internet Communists can live in the utopia of their dreams.\n\nAlright, what would it take to achieve such a daunting task?\n\nWhen there’s a will, there’s a way! A quick rundown of this program would go like this:\n\nStep 1: Contact your Local representative or related institutions and inform them of the proposal. After all, reducing the amount of communists living in USA is a matter of public health.\n\nStep 2: These groups acquire the necessary funds and fill the necessary paperwork to make this all happen.\n\nStep 3: A list of commie candidates is presented for approval.\n\nStep 4: These Internet Commies are given a few Starbucks coupons to allure them into a false sense of safety, before they’re snatched into helicopters and thrown into the– Whoops, my bad! I got carried away there! Disregard this step–or not! ¯\\_(ツ)_/¯\n\nStep 5: A list of capitalists is presented as part of the exchange. We’re willing to do a 1:1 exchange ratio if the standard rate of ten (10) commies for one (01) capitalist feels like a bit too much.\n\nStep 6: Both sides get a one way plane ticket.\n\nStep 7: ???\n\nStep 8: Profit!\n\nSounds feasible. What would these Virgin Internet Commies be getting in return?\n\nThey will get to live in the Socialist Utopia of their dreams of course! They will be able to partake in many great activities, included but not limited to:\n\nThe authentic experience of living with only ~$5-10 a month. They’re commies, they don’t like money anyways, right?\n\nWaiting in line for food when the last number of their passport matches the corresponding day of the week.\n\nBuying things like flour, eggs, and oil from food smugglers and resellers at absurd prices once they realize how futile it is to wait in line for food without the appropriate contacts.\n\nHunt for meds across all the pharmacies in the country.\n\nTaking expired pills cause good luck finding meds in pharmacies. (one of my current personal activities)\n\nHunt for that rare and elusive unicorn ATM that somehow still has cash (and pray to God or your Fedora that it belongs to your bank otherwise they will get jack shit, and even if its their bank’s ATM they get just a meager amount of cash)\n\nAttend mandatory Govt rallies and events, unless you want to lose your job in the public sector. You get your fancy red shirt and hat, and get to sing and chant praises to the politburo during their speeches!\nWatch our superior state tv and all those mandatory state broadcasts.\n\nAs a result of hyperinflation, they will be able to buy less and less each week with their ~$5-10 a month. What a great way to lose weight!\n\nLearning how to hide their power-level in public, good luck flashing that brand new iPhone bought with daddy’s credit card on the street!\n\nCrime imposed curfew hours, good luck trying to stay outside after sunset!\n\nOnly getting running water a few days at a week.\n\nA precarious electric grid and telecommunications system.\n\nA public health system that’s in complete shambles, and a private health system that’s struggling to stay afloat.\n\nAnd what would these Chad Capitalists Venezuelans be getting in return?\n\nThe escape from this Socialist Nightma–Utopia. As well as:\n\nFreedom of Speech.\n\nBurgers.\n\nTo be able to receive fair and just wages for our honest labor.\n\nWhile it might seem that us capitalists would be getting the short end of the stick, I assure you the exchange is as balanced as it gets for both parties.\n\nHang on. Are you just trying to push this meme campaign as a desperate ploy to get your family out of Venezuela?\n\nYou can bet your ass I am! (All my jokes are cries for help)\n\nThoughts? Suggestions? Feel free to leave comments below! I ain’t some commie that deletes, blocks, or forces people to register (no ten bux required to post).",
			"added": 1566159712
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}