{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Familia Dinossauros - A função ideológica da TV",
			"body": "Familia Dinossauros - A função ideológica da TV\n- https://ipfs.infura.io/ipfs/QmZuozt7xMmQ68ZpUGDzzsEfseq7iZmTZNMoJJi3zx3Ztd\n\nNa época que a série “Família Dinossauros” (1991-1994) ia ao ar no início dos anos 1990 não existia a TV digital. Mas um episódio da série em 1993 explicava o porquê do atual esforço concentrado e inédito envolvendo Governo, emissoras, Federação de indústrias e ONGs para evitar que massas de telespectadores ficassem sem televisão com o desligamento do sinal analógico na Grande São Paulo. Praça responsável por 70% do faturamento das emissoras, apenas as possíveis consequências financeiras da perda de telespectadores não explicam esse esforço que até envolveu a entrega de Kits de TV digital gratuitos através do “assistencialista” e “populista” Bolsa Família. O humor ácido da “Família Dinossauros” previa que jamais em uma crise econômica o Governo permitiria que cobradores tirassem a TV de pessoas endividadas: o sistema que as endivida precisa que a TV mantenha os endividados distraidos e confiantes. Conhecemos bem a função da TV em momentos de conflagração política (censura e manipulação das notícias) mas prestamos pouca atenção à sua função cotidiana e silenciosa: fazer as pessoas acreditarem que a força de vontade, o mérito e o trabalho são moralmente bons e que vale à pena acordar toda manhã confiantes e cheios de esperanças.\n\n- Fonte: https://invidious.ggc-project.de/hkeLN9nSiVs",
			"added": 1590599934
		}
	],
	"topic_vote": {
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1,
		"4_1GsRfuDKJuXwTjpAzk9rHWaeQkrh5c9RbF": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"8_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": 1,
		"1_1ExYhecdNveJBbZnjsxEyjs6FWq7XDv9dr": 1,
		"1_1KWJorqBBmmjX5CrnjVWoQS2kwQig2q4hY": 1
	},
	"next_comment_id": 34,
	"comment": {
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 1,
				"body": "#Equilíbrio de Nash\n- https://ipfs.infura.io/ipfs/QmSM9TtSED11UQbR2Mot47bbygkBDaMzvfX7rdcGrAkLEU\n\nDois jogadores A e B estão em um [Equilíbrio de Nash](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Nash_equilibrium.html) se a estratégia adotada por A é a melhor dada à estratégia adotada por B e a estratégia adotada por B é a estratégia ótima dada a adotada por A. Ou seja, nenhum dos jogadores pode aumentar seu ganho alterando, de forma unilateral, sua estratégia.",
				"added": 1590599634
			},
			{
				"comment_id": 2,
				"body": "#Enciclopédia de Matemática\n\nhttps://encyclopediaofmath.org/",
				"added": 1590599687
			},
			{
				"comment_id": 7,
				"body": "#Fundamentos de Matemática Elementar - Coleção Completa\n\nhttps://gateway.pinata.cloud/ipfs/QmYxggRuuxjemvJYZsDXyJ6fdBeibixASrtGNU7SYA7skG",
				"added": 1590602823
			},
			{
				"comment_id": 8,
				"body": "#Matemática Volume Único - Gelson Iezzi, Osvaldo Dolce, Mauro Degenszajn, Roberto Périgo.\nhttps://gateway.pinata.cloud/ipfs/QmUD1V1QBbTwJXSdLcWwSaRBhLXLgyDhL5pLzCL4EZoxy6",
				"added": 1590602888
			},
			{
				"comment_id": 10,
				"body": "#Livros de [Newton da Costa](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Newton_da_Costa.html)\n\n- https://gateway.pinata.cloud/ipfs/QmSb21ewZCamejmm9JK5edFbKxHuXwcwKQ517R8xzZwUPL",
				"added": 1590603140
			},
			{
				"comment_id": 11,
				"body": "#Livros de [Elon Lages Lima](https://pt.wikipedia.org/wiki/Elon_Lages_Lima)\n- https://gateway.pinata.cloud/ipfs/QmbV4PYJHkXSAMDC6qRkAdiRdxdA3GhCyLETPpT9VAdQNE",
				"added": 1590603305
			},
			{
				"comment_id": 12,
				"body": "#Geometria Euclidiana Plana - João Lucas Marques Barbosa\n- https://gateway.pinata.cloud/ipfs/Qmah8L1fQsGC2T6bWQLsrTNLh2Ch8HEd1gZz2H5tmjGmsz\n\nEste livro dá ao professor uma visão ampliada do que ele ensina em sala de aula. O autor mostra a geometria euclidiana plana de um ponto de vista que vai além dos tópicos do ensino básico e médio. A obra pode ser utilizada na disciplina de geometria para alunos de cursos de licenciatura em matemática. Ela permite a familiaridade com os fatos geométricos a partir da apresentação da teoria, exercícios, problemas e comentários de João Lucas Marques Barbosa.\n\nA exposição axiomática da geometria permite iniciar e aprofundar o aprendizado sobre os axiomas de incidência e ordem, axiomas sobre medição de segmentos e de ângulo. O método da geometria axiomática permite uma demonstração convincente da força do pensamento puro. Os livros de Euclides, pelo rigor com que exploram esse campo, foram referências para o filósofo Espinoza, em sua Ética demonstrada à maneira dos geômetras, e para o físico Newton, em sua obra Principia (Princípios Matemáticos da Filosofia Natural).",
				"added": 1590603399
			},
			{
				"comment_id": 13,
				"body": "#Geometria Elementar de um Ponto de Vista Avançado (3ª Edição) - Edwin Moise\n- https://gateway.pinata.cloud/ipfs/QmX6hed2FjsG8Kf6dZwcrm47aC963HW34dqdEYXuD3gWpN",
				"added": 1590603540
			},
			{
				"comment_id": 14,
				"body": "#Geometrias Euclidianas e Não Euclidianas: Desenvolvimento e História\n- https://gateway.pinata.cloud/ipfs/QmVqiGMXfAgwtWXcNgByKzXzkVL6ezu3vXBSBQG4RDDWWq\n\nEsta é a apresentação definitiva da história, desenvolvimento e significado filosófico da geometria não euclidiana, bem como dos fundamentos rigorosos para ela e para a geometria euclidiana elementar, essencialmente de acordo com [Hilbert](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/David_Hilbert.html). Apropriado para estudantes de artes liberais, futuros professores do ensino médio, matemática. graduações e até alunos brilhantes do ensino médio. Os oito primeiros capítulos são acessíveis principalmente a qualquer leitor educado; os dois últimos capítulos e os dois apêndices contêm material mais avançado, como a classificação de movimentos, trigonometria hiperbólica, construções hiperbólicas, classificação dos planos de Hilbert e uma introdução à geometria riemanniana.",
				"added": 1590603980
			},
			{
				"comment_id": 15,
				"body": "#Caderno perdido de [Ramanujan](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Srinivasa_Ramanujan.html)\n\n- https://gateway.pinata.cloud/ipfs/QmZU5qcWFJTS4bfDftRHCVgYhn4r5dWZvzLxqTsKyGySxH\n\n\nO caderno perdido de Ramanujan é o manuscrito em que o matemático indiano Srinivasa Ramanujan registrou as descobertas matemáticas do último ano de sua vida. Seu paradeiro era desconhecido para todos, exceto alguns matemáticos, até que foi redescoberto por George Andrews em 1976, em uma caixa de efeitos de G. N. Watson armazenados na Biblioteca Wren no Trinity College, Cambridge. O \"caderno\" não é um livro, mas consiste em folhas de papel soltas e não ordenadas - \"mais de cem páginas escritas em 138 lados na caligrafia distintiva de Ramanujan. As folhas continham mais de seiscentas fórmulas matemáticas listadas consecutivamente sem provas\".",
				"added": 1590604267
			},
			{
				"comment_id": 16,
				"body": "#Geometria moderna - Edwin E. Moise, Floyd L. Downs\nhttps://gateway.pinata.cloud/ipfs/QmUspsqu4aZ7NVU7waYUZdei6bLoYG6oD7UKH7YAD9n58u",
				"added": 1590604892
			},
			{
				"comment_id": 17,
				"body": "#Fundamentos da Geometria - Fernando Manfio\nhttps://gateway.pinata.cloud/ipfs/QmfP7FzkMX24dDKSkEAbJjFNTr1CvSHwhQbbZSg7BbZAse",
				"added": 1590605561
			},
			{
				"comment_id": 18,
				"body": "#Geometria Euclidiana Plana - Almir Rogério Silva Santos, Humberto Henrique de Barros Viglioni\nhttps://gateway.pinata.cloud/ipfs/QmVDndCmPjQFGxAeC9TMucqwkZb8TpP6wPJXApj1t2kCFx",
				"added": 1590605685
			},
			{
				"comment_id": 19,
				"body": "#Fundamentos de Matematica Elementar 9: Geometria Plana - Osvaldo Dolce; Jose Nicolau Pompeo\nhttps://gateway.pinata.cloud/ipfs/QmUPUMgN6uVUhx3XUcmHQyyihg9u1mZUaBCt1aRZo5o3ez",
				"added": 1590606318
			},
			{
				"comment_id": 20,
				"body": "#Geometria euclidiana plana e construções geométricas - Eliane Quelho Frota Rezende e Maria Lúcia Bontorim de Queiroz\n- https://gateway.pinata.cloud/ipfs/QmbPgq7XiVHaBkYMe72LhjFTvX1cSsTiaQMhwQxCYbe9DG",
				"added": 1590607465
			},
			{
				"comment_id": 28,
				"body": "Livros de [Ian Stewart](http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1KWJorqBBmmjX5CrnjVWoQS2kwQig2q4hY_0)\n- https://gateway.pinata.cloud/ipfs/QmSNjTb9NZmLBsJxaFwUg63vNxqXrPBoj5v7ZoTtNxVkhw",
				"added": 1590611353
			},
			{
				"comment_id": 30,
				"body": "#Cálculo com Geometria Analítica: Volume 1, de George F. Simmons\nhttps://gateway.pinata.cloud/ipfs/QmbB9WvNXg9ejV4qfcARkwrTwjynybXzHybmjfGV5GAWny",
				"added": 1590612061
			},
			{
				"comment_id": 31,
				"body": "#Introdução à geometria axiomática - Mark Barsamian\nhttps://gateway.pinata.cloud/ipfs/QmVKmc4cAzP2DekpkcZhXqgWu1ASU39z7zDQwfyvcehkVY",
				"added": 1590612143
			},
			{
				"comment_id": 33,
				"body": "#Homens de matemática: as vidas e realizações dos grandes matemáticos de Zenão a Poincaré - Eric Temple Bell\nhttps://gateway.pinata.cloud/ipfs/Qmb7DCsLTf15aGtsDEGr3BBCtiEsJZwQmzbPDsLm8LKEeL",
				"added": 1590617139
			}
		],
		"4_1GsRfuDKJuXwTjpAzk9rHWaeQkrh5c9RbF": [
			{
				"comment_id": 3,
				"body": "#Hex (jogo)\n- https://ipfs.infura.io/ipfs/QmVAPCLMF1zq5a1E33n3D8XSfh9YQjhNhx5bLAofyW2KuY\n\nHex é um jogo de tabuleiro jogado em uma grade hexagonal, teoricamente de qualquer tamanho e diversas formas possíveis, mas tradicionalmente como um losango 11x11. Outras dimensões populares são 13x13 e 19x19 como resultado da relação do jogo com o antigo jogo asiático Go. De acordo com o livro A Beautiful Mind, John Nash defendeu 14x14 como o tamanho ideal.",
				"added": 1590600308
			},
			{
				"comment_id": 4,
				"body": "> [zetapi](#comment_16_1GsRfuDKJuXwTjpAzk9rHWaeQkrh5c9RbF): Como Jogar Go\n> Go é um jogo no qual dos jogadores disputam o território; é talvez o mais antigo jogo de tabuleiro no mundo. As regras são simples e você pode aprendê-las em minutos. Muitos entusiastas consideram Go uma arte; o jogo tem tantas variações que até mesmo os computadores mais avançados têm dificuldades em jogá-lo. Aprender a jogar é fácil, mas aprender a jogar bem leva tempo e treino. Continue a ler para se familiarizar com esse jogo antigo, intrigante e inteligente.\n> \n> https://pt.wikihow.com/Jogar-Go\n\n#Como Jogar Go\n- https://gateway.pinata.cloud/ipfs/QmWASkxB64juWBvzUmyiLG75uHzSnNEpRL5RD4YxU2dpfx",
				"added": 1590600626
			},
			{
				"comment_id": 29,
				"body": "#[GOdroid](https://sourceforge.net/projects/godroid/) é uma aplicação Android para jogar o jogo de tabuleiro estratégico Go contra o motor GPL Go [GNU Go](https://www.gnu.org/software/gnugo/gnugo.html).\n - APK: https://gateway.pinata.cloud/ipfs/QmTfzDjTqjPF6bzd6z7Qy17j8nwyt8MPYrzAVpjtmvg3Pn/GOdroid_v1.3.9.apk\n\n- Código fonte: https://gateway.pinata.cloud/ipfs/QmbdVpbJ1uWYN2hNLqqogveXUram2Bt7CE9weKSSyX69M4/godroid-git.zip",
				"added": 1590611889
			}
		],
		"1_1ExYhecdNveJBbZnjsxEyjs6FWq7XDv9dr": [
			{
				"comment_id": 5,
				"body": "#Como Vencer Quase Sempre no Xadrez\nhttps://gateway.pinata.cloud/ipfs/QmWXYpsKvJVGFFSdTduoZLD6h5ky6qThAhn3h2x2VjEfqJ",
				"added": 1590600750
			}
		],
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": [
			{
				"comment_id": 6,
				"body": "Código fonte - [Bitcoin](https://bitcoin.org/pt_BR/), [Ethereum](https://ethereum.org/pt-br/), [Monero](https://getmonero.org/pt-br), [Nano](https://nano.org/pt), [Pascal](https://www.pascalcoin.org/), [Zcash](https://z.cash/pt/)\n\n- https://gateway.pinata.cloud/ipfs/Qmf9CKpciNjiQpNR8ubytgAC69dHuneX3jPGSi6rLn4ePj",
				"added": 1590602485
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 9,
				"body": "#Tópicos de Física (Newton,Helou, Gualter)\nhttps://gateway.pinata.cloud/ipfs/Qmbv4Ei8oofmQGSiTW6WPRAmqvpQS2YkFL38e1JtrCGQLL",
				"added": 1590603015
			},
			{
				"comment_id": 21,
				"body": "#Fundamentos de Física Volumes 1, 2, 3 e 4 – Halliday, Resnick, Walker\nhttps://gateway.pinata.cloud/ipfs/Qmf1TaBoPmG5Af7Abexc6PTYpbuw3AEFkwkEfwPY2GK954",
				"added": 1590608429
			}
		],
		"8_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 22,
				"body": "#A Violência do Pacifismo Dogmático\nhttps://gateway.pinata.cloud/ipfs/QmVDunDTJNS3HYx7YnTF1LcVjbFAsBNXxJSwXkFrF99zDP",
				"added": 1590608546
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 24,
				"body": "Todos os publicanos e \"pecadores\" estavam se reunindo para ouvi-lo.\nMas os fariseus e os mestres da lei o criticavam: \"Este homem recebe pecadores e come com eles\".\nEntão Jesus lhes contou esta parábola:\n\"Qual de vocês que, possuindo cem ovelhas, e perdendo uma, não deixa as noventa e nove no campo e vai atrás da ovelha perdida, até encontrá-la?\nE quando a encontra, coloca-a alegremente sobre os ombros\ne vai para casa. Ao chegar, reúne seus amigos e vizinhos e diz: ‘Alegrem-se comigo, pois encontrei minha ovelha perdida’.\nEu lhes digo que, da mesma forma, haverá mais alegria no céu por um pecador que se arrepende do que por noventa e nove justos que não precisam arrepender-se\".\n\"Ou, qual é a mulher que, possuindo dez dracmas e, perdendo uma delas, não acende uma candeia, varre a casa e procura atentamente, até encontrá-la?\nE quando a encontra, reúne suas amigas e vizinhas e diz: ‘Alegrem-se comigo, pois encontrei minha moeda perdida’.\nEu lhes digo que, da mesma forma, há alegria na presença dos anjos de Deus por um pecador que se arrepende\".\nJesus continuou: \"Um homem tinha dois filhos.\nO mais novo disse ao seu pai: ‘Pai, quero a minha parte da herança’. Assim, ele repartiu sua propriedade entre eles.\n\"Não muito tempo depois, o filho mais novo reuniu tudo o que tinha, e foi para uma região distante; e lá desperdiçou os seus bens vivendo irresponsavelmente.\nDepois de ter gasto tudo, houve uma grande fome em toda aquela região, e ele começou a passar necessidade.\nPor isso foi empregar-se com um dos cidadãos daquela região, que o mandou para o seu campo a fim de cuidar de porcos.\nEle desejava encher o estômago com as vagens de alfarrobeira que os porcos comiam, mas ninguém lhe dava nada.\n\"Caindo em si, ele disse: ‘Quantos empregados de meu pai têm comida de sobra, e eu aqui, morrendo de fome!\nEu me porei a caminho e voltarei para meu pai, e lhe direi: Pai, pequei contra o céu e contra ti.\nNão sou mais digno de ser chamado teu filho; trata-me como um dos teus empregados’.\nA seguir, levantou-se e foi para seu pai. \"Estando ainda longe, seu pai o viu e, cheio de compaixão, correu para seu filho, e o abraçou e beijou.\n\"O filho lhe disse: ‘Pai, pequei contra o céu e contra ti. Não sou mais digno de ser chamado teu filho’.\n\"Mas o pai disse aos seus servos: ‘Depressa! Tragam a melhor roupa e vistam nele. Coloquem um anel em seu dedo e calçados em seus pés.\nTragam o novilho gordo e matem-no. Vamos fazer uma festa e comemorar.\nPois este meu filho estava morto e voltou à vida; estava perdido e foi achado’. E começaram a festejar.\n\"Enquanto isso, o filho mais velho estava no campo. Quando se aproximou da casa, ouviu a música e a dança.\nEntão chamou um dos servos e perguntou-lhe o que estava acontecendo.\nEste lhe respondeu: ‘Seu irmão voltou, e seu pai matou o novilho gordo, porque o recebeu de volta são e salvo’.\n\"O filho mais velho encheu-se de ira, e não quis entrar. Então seu pai saiu e insistiu com ele.\nMas ele respondeu ao seu pai: ‘Olha! todos esses anos tenho trabalhado como um escravo ao teu serviço e nunca desobedeci às tuas ordens. Mas tu nunca me deste nem um cabrito para eu festejar com os meus amigos.\nMas quando volta para casa esse seu filho, que esbanjou os teus bens com as prostitutas, matas o novilho gordo para ele! ’\n\"Disse o pai: ‘Meu filho, você está sempre comigo, e tudo o que tenho é seu.\nMas nós tínhamos que comemorar e alegrar-nos, porque este seu irmão estava morto e voltou à vida, estava perdido e foi achado’ \".\n\n- Lucas 15:1-32",
				"added": 1590608846
			},
			{
				"comment_id": 25,
				"body": "Jesus disse aos seus discípulos: \"O administrador de um homem rico foi acusado de estar desperdiçando os seus bens.\nEntão ele o chamou e lhe perguntou: ‘Que é isso que estou ouvindo a seu respeito? Preste contas da sua administração, porque você não pode continuar sendo o administrador’.\n\"O administrador disse a si mesmo: ‘Meu senhor está me despedindo. Que farei? Para cavar não tenho força, e tenho vergonha de mendigar...\nJá sei o que vou fazer para que, quando perder o meu emprego aqui, as pessoas me recebam em suas casas’.\n\"Então chamou cada um dos devedores do seu senhor. Perguntou ao primeiro: ‘Quanto você deve ao meu senhor? ’\n‘Cem potes de azeite’, respondeu ele. \"O administrador lhe disse: ‘Tome a sua conta, sente-se depressa e escreva cinqüenta’.\n\"A seguir ele perguntou ao segundo: ‘E você, quanto deve? ’ ‘Cem tonéis de trigo’, respondeu ele. \"Ele lhe disse: ‘Tome a sua conta e escreva oitenta’.\n\"O senhor elogiou o administrador desonesto, porque agiu astutamente. Pois os filhos deste mundo são mais astutos no trato entre si do que os filhos da luz.\nPor isso, eu lhes digo: usem a riqueza deste mundo ímpio para ganhar amigos, de forma que, quando ela acabar, estes os recebam nas moradas eternas.\n\"Quem é fiel no pouco, também é fiel no muito, e quem é desonesto no pouco, também é desonesto no muito.\nAssim, se vocês não forem dignos de confiança em lidar com as riquezas deste mundo ímpio, quem lhes confiará as verdadeiras riquezas?\nE se vocês não forem dignos de confiança em relação ao que é dos outros, quem lhes dará o que é de vocês?\n\"Nenhum servo pode servir a dois senhores; pois odiará a um e amará ao outro, ou se dedicará a um e desprezará ao outro. Vocês não podem servir a Deus e ao Dinheiro\".\n\n- Lucas 16:1-13",
				"added": 1590609095
			},
			{
				"comment_id": 26,
				"body": "\"Havia um homem rico que se vestia de púrpura e de linho fino e vivia no luxo todos os dias.\nDiante do seu portão fora deixado um mendigo chamado Lázaro, coberto de chagas;\neste ansiava comer o que caía da mesa do rico. Em vez disso, os cães vinham lamber as suas feridas.\n\"Chegou o dia em que o mendigo morreu, e os anjos o levaram para junto de Abraão. O rico também morreu e foi sepultado.\nNo Hades, onde estava sendo atormentado, ele olhou para cima e viu Abraão de longe, com Lázaro ao seu lado.\nEntão, chamou-o: ‘Pai Abraão, tem misericórdia de mim e manda que Lázaro molhe a ponta do dedo na água e refresque a minha língua, porque estou sofrendo muito neste fogo’.\n\"Mas Abraão respondeu: ‘Filho, lembre-se de que durante a sua vida você recebeu coisas boas, enquanto que Lázaro recebeu coisas más. Agora, porém, ele está sendo consolado aqui e você está em sofrimento.\nE além disso, entre vocês e nós há um grande abismo, de forma que os que desejam passar do nosso lado para o seu, ou do seu lado para o nosso, não conseguem’.\n\"Ele respondeu: ‘Então eu lhe suplico, pai: manda Lázaro ir à casa de meu pai,\npois tenho cinco irmãos. Deixa que ele os avise, a fim de que eles não venham também para este lugar de tormento’.\n\"Abraão respondeu: ‘Eles têm Moisés e os Profetas; que os ouçam’.\n\" ‘Não, pai Abraão’, disse ele, ‘mas se alguém dentre os mortos fosse até eles, eles se arrependeriam’.\n\"Abraão respondeu: ‘Se não ouvem a Moisés e aos Profetas, tampouco se deixarão convencer, ainda que ressuscite alguém dentre os mortos’ \".\n\n- Lucas 16:19-31",
				"added": 1590609196
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 32,
				"body": "#Os Meninos Super Poderosos - Filme 2009\n- https://gateway.pinata.cloud/ipfs/QmUs4DYEj7cC6hhjHkpL82yHsfUkxXZLy3tuUoXUf3yjct\n\nWut (Nantawooti Boonrapsap), Kat (Sasisa Jindamanee), Pong (Paytaai Wongkamlao) e Jib (Nawarat Teharathanapraset) são grandes amigos, que cresceram em uma escola de artes marciais. Uma briga com uma gangue local faz com que Jib passe mal. Logo é descoberto que ele tem um problema cardíaco e que precisará passar por um transplante. Só que o hospital onde está o coração que será transplantado foi ocupado por terroristas, que exigem um resgate. Sabendo que o transplante precisa ser feito em, no máximo, quatro horas, os amigos decidem se unir para combatê-los.",
				"added": 1590616083
			}
		]
	},
	"comment_vote": {}
}