{
	"title": "Блокнот Шизофреника",
	"description": "[ReadMe](http://127.0.0.1:43110/Shiza.ZAlex.bit/?Post:3:Intro) | [Home](http://127.0.0.1:43110/ZAlex.bit) \n\nВсё сказанное здесь - ИМХО",
	"links": "",
	"next_post_id": 10,
	"demo": false,
	"modified": 1460864813,
	"post": [
		{
			"post_id": 9,
			"title": "Суть прямой линии с Крабе",
			"date_published": 1460864769.785,
			"body": "![krabe-picture-here](img/krabe.jpeg)"
		},
		{
			"post_id": 8,
			"title": "КиберУтопия 2.0",
			"date_published": 1456574867.847,
			"body": "*Данный текст не является продолжением КиберУтопии. Это, скорее, более масштабная КиберУтопия, ориентированная на более широкую публику. Это - речь, подкреплённая презентацией (так что, иногда будут попадаться вставки, выделенные курсивом, извините уж). А если у мне выпадет достаточно много свободного времени (которого у меня, к слову, катастрофический недостаток), то я **возможно** сделаю видео-выступление, основанное на этом тексте. А если некто с мощным компьютером поможет мне с рендером, то видео **возможно** будет сопровождаться анимацией.* \n\n*Пожалуй, сделаю особый акцент на ключевом слове **\"возможно\"**. Вероятность этого мала, у меня и так дел полно, да еще и PocketMod с джойстиком...*\n\n---\n\nЗдравствуйте.\n\nЯ, в числе многих из вас, понимаю, как удобна повседневная рутина, как безопасно хорошо знакомое однообразие. Но давайте ненадолго отвлечёмся от повседневной жизни и немного побеседуем. Я хочу рассказать вам об одном интереснейшем молодом проекте. Но чтобы вы лучше поняли меня, я, пожалуй, сделаю небольшое лирическое отступление. И хочется подчеркнуть, что всё сказанное мною - не более чем моя личная точка зрения, которая может не совпадать с вашей.\n\nИтак. Со Всемирной паутиной творится что-то неладное, что-то ужасное. В этом универсальном пространстве, где когда-то была свобода инакомыслия, где человек мог говорить то, что думает, теперь властвует цензура и тотальный надзор, принуждающие к подчинению и навязывающие непротивление.\n\nПравительства получают свою власть по соглашению с управляемыми. Но правительства различных стран, как Россия и Китай не просили и не получали нашего согласия. Мы не приглашали их. Они не знают нашего мира. Киберпространство лежит вне границ какого-либо государства.\n\nНо кого это волнует?.. Новые законопроекты, нацеленные на ущемление свобод и прав, успешно принимаются с молниеносной скоростью. И те, у кого в руках власть или большие деньги (что во многих случаях одно и тоже) диктуют свои правила. Они блокируют ту информацию, которая им не неудобна. Чиновники хотят зачистить поисковики от информации, которая может подорвать их авторитет; правительство хочет наказывать за использование криптовалют, которые они любят называть якобы \"суррогатами\"; правообладатели-толстосумы \"выжигают\" всё подряд, что им просто не нравится, даже если это пойдет в ущерб независимым авторам и даже если эта информация полностью соответствует законам о добросовестном использовании; кто-то пытается выжимать конкурентов и так далее. А дальше будет только хуже.\n\nОбязательно найдутся те, кто скажет \"пф-ф, да какая цензура, да чего вы говорите? как работали ВКонтакте, да YouTube, так и работают. Они только всякие незаконные сайты блокируют, вы вообще преступники...\" И таких людей немало. Они и будут так говорить, пока они сами не вкусят плоды цензуры, пока эти ограничения не достигнут их.\nИ если вы ничего не замечаете, если преступления нынешней власти для вас не очевидны, то можете проигнорировать моё послание. \n\nПравительство в основном использует давление на провайдеров. Я их (провайдеров) понимаю и не осуждаю. Они в безвыходной ситуации. Они располагаются на территории определённого государства, у них нет выбора. Но кроме провайдеров есть еще несколько \"точек давления\".\n\n*(здесь должна начаться анимация, рассказывающая о централизованных сетях)* \n\nКогда вы хотите получить некоторую информацию, скажем, статью из Википедии, ваше устройство не может связаться с сервером напрямую. На пути будут стоять определённые центры - провайдер, DNS-сервера, иногда прокси и некоторые другие вещи. Но достаточно надавать лишь на одно из звеньев этой цепи - и цепочка \"посетитель-сайт\" уже рвётся.\n\nЕсли заставить провайдеров - доступ к информации ограничат.\nЕсли надавить на регистраторов доменов - домен могут разделегировать.\nЕсли надавить на хостинг, то он может \"прогнуться\".\n\nНо не всё потеряно. Есть средства, которые помогут оказать сопротивление.\nВ большинстве случает эти средства являются пиринговыми и децентрализованными сетям. Например, Tor вернет вам права на свободу слова, доступ к информации и анонимность, а Bitcoin и его аналоги позволят вам распоряжаться вашими деньгами именно так, как это захотите вы.\n\nКонечно, Tor и прочие средства позволяющие \"прорубить окно в Европу\" - полезные вещи. Однако, если надавить именно на сервер\\хостинг, то это бесполезно. Да, он поможет нам, если давят на провайдера. Но и на сам Tor можно надавить. К тому же, в Эфиопии от Tor'a вообще избавились (он там совсем не работает). А учитывая, что в России начинают затыкать рты тем, кто говорит о способах обхода цензуры... Возможно, настанет тот день, когда наш бастион Свободы под названием Tor будет терпеть осаду, со стороны нашего правительства.\n\nА представьте себе сеть, где цензура просто невозможна, где не надо платить за хостинг; где нет центральных DNS-серверов; сеть, которая никому не подвластна; сеть, которую строят сами пользователи, даже обыкновенные посетители сайтов.\n\nИ вот в этом моменте нам стоит разобрать в чем отличие интернета от Всемирной паутины, ведь в повседневной речи, говоря об Интернете, часто имеют в виду именно Всемирную паутину. Однако важно понимать, что это не одно и то же.\n\n*(анимация о взаимоотношениях интернета и WWW)* \n\nИнтернет - это огромная сеть, состоящая из бесчисленного количества устройств. А Всемирная паутина - лишь часть Интернета. Если не вдаваться в технические подробности, то грубо говоря, Всемериная паутина - это сайты, к которым вы получаете доступ с помощью браузера. Поисковые системы, социальные сети, и так далее. Но некоторые технологии являются именно частью Интернета, и работают независимо от Всемирной паутины. Например, торренты, Bitcoin и ZeroNet - технология, о которой я и хочу рассказать.\n\nZeroNet - это децентрализованная пиринговая сеть. Сейчас я расскажу, что это значит.\n\n*(нижесказанное сопровождается анимацией об устройстве p2p-сетей)* \n\nВ централизованных сетях есть сервер, откуда посетители получают контент. В пиринговых сетях нет серверов. Такие сети также называют одноранговыми, т.е. у каждого одинаковый ранг. Каждый равен. Каждый, кто получает информацию раздаёт её другим.\n\nДопустим, я хочу поделиться с людьми неким файлом. Некто второй, желающий получить эту информацию, подключается ко мне, и загружает данные к себе на компьютер. Теперь у нас обоих есть этот файл. Третий человек тоже захотел получить этот файл, и он подключается к двум предыдущим участникам сети. Они оба передают третьему информацию одновременно, что позволяет повысить скорость загрузки. И так далее - каждый следующий участник обмена данными подключается к некоторым предыдущим участникам сети, получает информацию, и помогает другим получить её. При этом пиринговые сети часто очень эффективно использую соединение - при передаче больших объёмов информации пиры (участники пиринговой сети) начинают обмениваться друг с другом кусочками данных. Каждый раздаёт те части, которые у него есть, и принимает от других те кусочки, которых у него нет.\n\nТакая сеть распределённая, информация есть у каждого участника сети. Конечно, у всего есть свои минусы, однако такая сеть имеет некоторые преимущества. Здесь невозможна цензура. Даже если некоторые участники обмена прекратят раздавать данные, то (если сеть достаточно большая) обмен всё равно не прекратится. Даже если самый первый пир уйдет, то информация останется в сети, обмен данных прекратить очень трудно, как правило, практически невозможно.\n\nИменно так работают такие технологии, как те же самые торренты и Bitcoin. И в основе ZeroNet лежит именно такой принцип.\n\nЗдесь нет серверов и хостингов.\nКаждый посетитель сайта раздаёт его другим. Чем популярнее сайт, тем больше посетителей, а следовательно - тем больше скорость загрузки. И да, здесь не придётся платить за хостинг. Но не переживайте, что кто-то из пиров сможет отредактировать ваш сайт, и раздавать его под видом вашего - всё надёжно защищено стойкой криптографией и шифрованием. И лишь если владелец сайта наделит посетителей некоторыми правами (например, оставлять комментарии), то они смогут производить некоторые действия сами.\n\nЗдесь нет центрального DNS-сервера, принадлежащего определённой компании или лицам. Вместо домена каждому сайту присваивается уникальный хеш - по сути длинный набор случайных символов. Но и присутствует система доменов, для удобного набора и запоминания. И разработчик сети поступил в этом вопросе очень мудро - он ввёл систему доменов, основанную на Namecoin'е. Это криптовалюта, очень похожа на Bitcoin, но в отличии от последнего Namecoin позволяет регистрировать домены в зоне *.bit, и здесь всё также замешано на криптографии. Эта система также децентрализована, и можно не бояться, что кто-то разделегирует ваш домен - это не возможно. К слову, такие домены стоят крайне дёшево - буквально не более 10 копеек за год.\n\n*(дальнейший текст сопровождается скринкастами)*\n\nЯ всё рассказываю о нём, но так ничего и не показал из этой сети. Давайте взглянем на сам ZeroNet. Установить его на Windows очень просто - надо зайти на ZeroNet.io, скачать архив, распаковать его и запустить один файл. Всё. Пройдёмся по некоторым сайтам.\n\nСамым первым нас встречает ZeroHello - стартовая страница. Слева мы видим присоединённые сайты т.е. те, которые хранятся на диске и раздаются другим пользователям. Справа мы видим приветствие, но если использовать подписки на новости, то тут будут видны обновления сайтов. Например, новые записи в блогах и новые сообщения на форумах.\n\nПервым делом стоит зайти на ZeroID - местный \"пункт регистрации\". Это необязательно, но большинство здешних сайтов работают именно с ZeroID.\nКстати, здесь нет паролей. Вместо них используются приватные ключи. И самый лёгкий путь сохранить свой логин при себе - скопировать в надёжное место файл *%ZeroPath%/Data/Users.json*.\n\nЕдем дальше - ZeroBlog. Конкретно этот блог принадлежит разработчику проекта (его ник - nofish), но сам ZeroBlog можно склонировать в 2 клика и сделать себе такой же блог. Что-то наподобие WordPress, но минималистичный и лёгкий. \n\nКстати, здесь стоит сделать небольшое отступление. Здесь не будут работать популярные CMS как WordPress, Joomla и т.д. Тут вообще не получится просто так взять и перенести динамический вебсайт так, чтобы он работал. Дело в том, что тут нет PHP. Это из-за специфичный архитектуры сети. На мой взгляд это один из главных минусов ZeroNet, который наверняка многих будет отталкивать. Чтобы разработать стоящий динамический сайт придётся немного попотеть...\n\nZeroTalk - местный форум. Его, кстати, тоже можно легко склонировать и настроить под себя. Например, Ru-ZeroTalk - русскоязычный форум. Вообще этот ZeroTalk вещь очень интересная. Чего только не создали на основе этого движка - кто-то прикрутил возможность вставлять картинки; другой собрал на коленке (если честно, кривенький и сырой) аналог YouTube; третий сделал не хилый каталог сайтов - 0list.\n\nZeroMail - аналог электронной почты. Стоит отметить, что этот сервис работает исключительно внутри ZeroNet - отправить письмо во \"внешний мир\" не получится.\n\nМой сайт - ZAlex.bit. Здесь вы найдёте моё творчество и ссылки на другие мои сайты и проекты. \n\nИ это лишь пара сайтиков, ресурсов в этой сети намного больше. Торрент трекер, множестно блогов, коллекция GIF-ок, имиджборды...\n\nНо это лишь начало. ZeroNet'у всего год. Но он активно развивается.\nЭта сеть всё ещё мала. Но если мы будет пользоваться ею, если мы будем размещать там уникальный контент, если мы будем помагать в разработке, то тогда это будет крупномасштабная сеть, которая никому не подвластна.\n\nЧecтнocть, cпpaвeдливocть и cвoбoдa — этo нe просто cлoвa. Этo жизненные принципы. Если вы видите то, что вижу я, чувствуете то, что чувствую я, если вам дорого то, что дорого мне, тогда я предлагаю присоединиться ко мне.\n\nМы создаём мир, в который могут прийти все, без привилегий или ограничений в зависимости от расы, экономического могущества, военной силы или положения по рождению.\n\nМы создаём мир, в котором каждый, откуда бы он ни был, может выразить свои идеалы, сколь бы непривычны они ни были, не опасаясь быть принуждённым к молчанию или единомыслию.\n\nМы создадим цивилизацию Разума в Киберпространстве. И пусть она будет более гуманной и справедливой, чем тот мир, который создан под правлением живущих в прошлом.\n\nСпасибо."
		},
		{
			"post_id": 7,
			"title": "Платить нельзя пиратить [копирайт]",
			"date_published": 1456103413.386,
			"body": "> -...Экономическое состояние большинства наших компаний развивается по системе спирали...\n> -Ага, спирали, спираем и будем спирать...\n\nНекоторые люди не понимают моих позиций и взглядов. Иногда я рву их шаблоны.\nКогда я сказал, что разделяю идеологию Пиратской Партии, то некоторые автоматически предполагают, что я - заядлый пират, считающий, что платить ни за что не обязан. И эти некоторые недоумевают, узнав о том, что я отказываюсь от пиратства. А может, я действительно псих и шизофреник?\n\nНо оказалось, что есть еще одно стереотипное мнение - если я не пирачу, значит трачу много денег. Это не так.\n\n---\n\nКакова же моя позиция? Производители и авторы обязательно должны получать награду за свои труды. И я считаю, что пиратство - это не есть хорошо. Но вот в чем дело... Авторов (софта, музыки, кино - чего угодно) сильно беспокоят пираты. И это не мудрено, ведь они действительно несут потери от этого. Что же я считаю неправильным?\n\n- Устраивают войну, вместо того, чтобы договориться. Пример - Rutracker давал всем ~~копирастам~~ правообладателям право удалить раздачи. Они пользовались этой возможностью. Но некоторые не захотели мирного пути, и подали в суд. Итог - Rutracker заблокирован (но это не проблема), а возможность удаления раздач упразднена. Браво, толстосумы! Независимые исполнители негодуют, а вы таки ничего не добились.\n\n- Запрещают все подряд вместо того, чтобы немного снизить цены в кризисное время.\n\n- DRM. Я редко играю в игры. Но однажды купив диск, я просто положил его на полочку, и скачал игру через торрент. \"Щито?\" Да всё очень просто - я не хотел гадить в систему этими вашими \"Старфорсами\" и прочей неудобной фигнёй. Я с чистой совестью скачал пиратскую версию игры, и пиратством это не считаю. Я ведь уже купил игру! DRM только лишь вредит и создает проблемы не только пиратам.\n\n- А ведь DRM входит в стоимость продукта, кстати...\n\n- Торможение прогресса. Переписчики книг жаловались на печатный станок в своё время. А звукозаписывающие компании добывались запрета на продажу карманных плееров. А теперь они негодуют из-за интернета...\n\n- И много чего ещё...\n\nМоя позиция заключается вовсе не в отмене копирайта и авторских прав, вовсе нет. Я против злоупотребления этими правами.\n\nА знаете, кто бóльшие враги для, допустим, Microsoft - пираты или предпочитающие альтернативы? На первый взгляд, вторая группа вообще не приносит вреда, а пираты якобы \"воруют\" их продукты. Но не все так просто. Если пират будет стоять перед безвыходной ситации, когда нужно использовать только легальное ПО, то ему придется либо покупать софт, либо болезненно привыкать к альтернативам. Если такой выбор падёт предо мною, то мне выбирать и не придётся. Я привык к Linux и LibreOffice, у меня даже не будет мысли о покупке.\n\nИтак, я отказываюсь от пиратства. И дело не только в \"борьбе\" против копирастов. Я чувствую, что открытое и свободное ПО больше \"уважает\" меня, что-ли. В Linux я чувствую себя хозяином в системе. А Windows словно считает себя умнее.\nДавайте пройдёмся по моим текущим результатам отказа от пиратства:\n\n- Софт. Я полностью свободен от пиратского ПО. К сожалению, абсолютно отказаться от проприетарного софта не могу, но я иду к этому. Я больше не использую Windows и MS Office, я переехал на GNU\\Linux (openSUSE) и LibreOffice. Я ожидал множество проблем, однако всё наоборот. ВНЕЗАПНО, Linux намного лучше работает с аппаратным обеспечением. В Windows нужно было обязательно устанавливать мегатяжёлый драйвер HP, если я хотел пользоваться принтером; та же история с видеокартой; звук также не работал \"из коробки\"; картридеры (SD, MicroSD) и вовсе работали когда им вздумается... Переезжая на Linux я ожидал большее количество проблем. Но всё как раз наоборот: картридеры работают исправно исключительно на Linux; драйвера на звук и принтер уже в комплекте; а с видеокартой и вовсе разрыв шаблона - открытый драйвер Nouveau работает намного лучше чем родной проприетраный от Nvidia! Чудеса...\n\n- Игры. Я почти в них не играю, так что 2-3 раза в год могу себе позволить купить что-нибудь на GOG.com (а если там нет желаемого - в мерзком Steam).\n\n- Музыка. У меня таки за годы собрана нехилая коллекция Creative Commons музыки. А насчет платной - медленно, но верно удаляется  пиратская коллекция, переезжаем-с на Яндекс.Музыку. Кстати, если-бы не закрытие Muz.ru, то, возможно, я не стал-бы переезжать. Может, вы сможете мне в комментариях посоветовать альтернативы?\n\n- Мульт\\Фильмы. Иногда грешу :D Если-бы не непростая экономическая ситуация...\n\nКак-то так."
		},
		{
			"post_id": 4,
			"title": "КиберУтопия [политота & свобода]",
			"date_published": 1456048299,
			"body": ">Перед прочтением рекомендую ознакомиться с Декларацией Независимости Киберпространства\n\nНекоторые меня спрашивают, почему я пользуюсь ZeroNet'ом? В чем я вижу его преимущества, если эта сеть еще очень мала, и до уровня интернета ей ещё расти и расти? Попробую объяснить.\n\nНа мой взгляд, сколько мир не менялся - всё к худшему. Это относится и к интернету. Новые идиотские законы, цензура (не только в России), DDoS-атаки, разделегирование доменов и т.д. Это универсальное и свободное пространство становится всё менее свободным.\n\n---\n\nИтак, я вижу две главные (но не единственные) причины хаоса:\n- наличие центров\n- неравенство\n\nРазберём это подробнее.\n\nДекларация Независимости Киберпространства говорит нам:\n\n>У наших сущностей нет материальных тел, поэтому, в отличие от вас, нами нельзя управлять с помощью физического принуждения. \n\nУвы. Это немного не так. Кэп оперативно сообщает, что как ни крути, интернет привязан к физическому миру. Хотим мы этого, или нет. К сожалению, физическое принуждение возможно. Кому-то проще повредить сервер, кто-то через суды давит на хостинг-компании, Роскомнадзор давит на провайдеров. Есть еще много других \"точек\" давления. И причина возможности давить - централизованность. Надавил на центр - вся система рухнет. Надавил на регистраторов доменов, и цепочка \"посетитель - сайт\" рвется. Достаточно надавить на одно из звеньев, и всё.\n\nКонечно, у нас есть такие вещи, как Tor. Однако, если надавить именно на сервер\\хостинг, то это бесполезно. Да, он поможет нам, если давят на провайдера. Но и на сам Tor можно надавить. Насколько помню, где-то задержали человека за то, что он разместил у себя \"Relay\" Tor'a, т.е. (в двух словах) трафик проходящий через Tor, мог проходить и через него. К тому же, в Эфиопии от Tor'a вообще избавились (он там совсем не работает). А учитывая, что в России начинают затыкать рты тем, кто говорит о способах обхода цензуры... Возможно, настанет тот день, когда наш бастион Свободы под названием Tor будет терпеть осаду, со стороны нашего правительства.\n\nА теперь про неравенство. С первого взгляда, неравенства в интернете нет. Но это не так. То же правительство имеет больше привилегий, чем \"простые смертные\", ~~копирасты~~ правообладатели с помощью судов выпилавают неугодную им информацию. Вроде бы два участника сети полностью равны, как два человека. Но стоит одному из них взять пистолет, то один уже может командовать другим.\n\nЧто же есть \"утопия\" в моем понимании? Равенство. Одинаковые привилегии. Мир, где каждый может говорить то, что думает. Конечно, я против оскорблений, унижения, пропаганды терроризма. Но если кто-то оскорбляет меня, я просто буду игнорировать его. Я не буду жаловаться кому-то. Я не буду требовать наказания\\извинений\\удаления этой информации.\n\nК сожалению, утопия в физическом мире (да и вообще где угодно) не возможна на практике. Но мы может идти к этому. А попытаться создать равенство в киберпространстве можно с помощью технических ограничений. Воплощение такой утопии я вижу в ZeroNet. Не важно, есть у тебя деньги или нет; не важно, какой у тебя статус в физическом мире. Здесь все равны. Каждый может создать свой ресурс, без зависимости от сервера\\хостинга. Здешний DNS в лице Namecoin'a никому не подвластен.\n\nВ интернете уже торжествует цензура, отжимаются домены, один правит над другим. Нам затыкают рты. Оказывать сопротивление, и уметь обходить беззаконие - это хорошо. Но наши противники сильны. Так давайте оставим интернет всей этой \"Илите\" и равнодушным людям. Давайте построим свою сеть! Сеть, где все равны. Сеть, которую поддерживаем мы сами, участники этой сети.\n\n>Мы создадим цивилизацию Разума в Киберпространстве. И пусть она будет более гуманной и справедливой, чем тот мир, который создан под вашим правлением."
		},
		{
			"post_id": 3,
			"title": "Intro",
			"date_published": 1456048182.24,
			"body": "\n\nИтак, добро пожаловать на страницы блокнота шизофреника!\n\nТак как в ZeroBlog нет деления на теги и рубрики, будет лучше сделать отдельный блог. Да, я уже расплодил несколько сайтов вместо одного большого, знаю :D\n\nКонтент и тематику данного блога трудно описать. Здесь я буду делиться с вами моими мнениями, взглядами, рассуждениями, с которыми далеко не каждый будет солидарен. Также, тут могут быть отредактированные части Вместо того, чтобы пытаться описать весь этот бред, я порекомендую почитать пару “статей”, и сделать для себя выводы.\n\nА пока здесь нет тегов, я буду обозначать тематику записей с помощью [квадратных скобочек] в названии.\n\nСледует ещё раз отметить, что наверняка будут те, кто не согласен с моими точками зрения. В таком случае прошу не засирать комментарии, а просто игнорировать сие место.\n"
		}
	]
}