{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1577740713,
			"title": "Beer",
			"body": "Any hop heads around here?\n\nBeer is the only alcoholic drink I like (I don't like alcohol in general) and I'm a HUGE fan of craft beer.\n\nI have drank, reviewed and rated a few beers -> https://www.beeradvocate.com/user/beers/?ba=rex_4539\n\nCould be fun to start a beer discussion in ZeroNet :)",
			"added": 1577740712
		}
	],
	"topic_vote": {
		"1578236236_1Y7bUwSNLFn6pLdzGyqWkMu2bieAdYsba": 1,
		"1580584100_141cDEZpTXUnEtreAL9ELWzcNqdNtgLnLh": 1,
		"1583986918_1FRms99LhV6SmTBPxkNbr99GXGjf8na3k2": 1,
		"1587888954_1EsynzasFzW2SVpMKwWaxag5u2DXcL5W1Y": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1572464062_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "There is a decentralized alternative, called Aether, but it has it's own quirks.\n\nhttps://getaether.net/\n\nUsed it for a while but then dropped it too.",
				"added": 1572464965
			}
		],
		"1573293451_1DfS5W4f4uaamYXGawCNnG4niUe4ue5MiC": [
			{
				"comment_id": 2,
				"body": "I exercise a combination of 2 things.\n\n1. Hold.\n2. Generate passive income by lending a percentage of my potfolio, utilizing an interest account.",
				"added": 1573297134
			}
		],
		"1573734530_17Tr1vdXC29zwecUt2pyPNMcHsqpJt8Xfj": [
			{
				"comment_id": 3,
				"body": "You do not NEED to use tor but using it gives you greater anonymity, if that's what you're looking for. And using Tor Browser enhances that anonymity even further. Any other browser can be fingerprinted and leak metadata.",
				"added": 1573805797
			}
		],
		"1575530407_1NHiaCL2VFiEeiQZcaR3LMnJ53tkepwY9T": [
			{
				"comment_id": 4,
				"body": "It's working on \"normal\" browsers but not on Tor Browser, which is probably blocking stuff.",
				"added": 1575560301
			}
		],
		"1575485461_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn": [
			{
				"comment_id": 5,
				"body": "There is only one reliable source for fitness gadgets. DCRainmaker. Ask him to do such a security test. He's got the technical skills and would probably be up for it.\n\nhttps://www.dcrainmaker.com",
				"added": 1575560571
			}
		],
		"1577740713_18F1Ga3hcY5ZSPoD5jeFow6w7uHyRtocdf": [
			{
				"comment_id": 6,
				"body": "I also visit a few pubs here from time to time (one of which brews the best beer in the country, in-house) but to be honest I enjoy most drinking beer at home with the company of my significant other (or friends!) who also loves beer. Perhaps one reason for this is that the pubs are 1 to 1,5 hour away from my neighborhood by public transport (vehicle is not an option due to alcohol consumption). The big plus of visiting pubs is getting fresh beer on tap and meeting potentially interesting people so I try to visit the pubs as often as I can.",
				"added": 1577743206
			}
		],
		"1580047559_14waGGyqPBKFdRMxWBKAtg4Ux1b8a16QbK": [
			{
				"comment_id": 7,
				"body": "I'm not aware of any such zite but for trading crypto I highly recommend Bisq.\n\nhttps://bisq.network",
				"added": 1580051202
			}
		],
		"1580643454_17FotRRc6msHBzM2jrs6tQCmpLaXi1kHd5": [
			{
				"comment_id": 8,
				"body": "http://127.0.0.1:43110/1PffaPsQp81gec3GbLDTzH3cY57WuRfC36/services.html\n\nScroll down to ZeroNet section.",
				"added": 1580765626
			}
		],
		"1584541101_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": [
			{
				"comment_id": 9,
				"body": "I see Zeronet links but they fail to open.\n\nI get \"Zeronet client was NOT detected on your computer\".\n\nTried with Tor Browser and Safari on macOS.\n\nZeronet is always running on this machine.",
				"added": 1584565084
			}
		],
		"1585101196_1Ahyyr1tEzvP9hZC2iocNTZfEp7zfJwbCJ": [
			{
				"comment_id": 10,
				"body": "https://retroshare.cc",
				"added": 1585119127
			}
		],
		"1585933227_15cApprVFcr1skAkWssq5aAXKa7pDwJJve": [
			{
				"comment_id": 11,
				"body": "If you want to use ZeroNet as a decentralized, uncensorable platform, then you don't necessarily need to use Tor Browser.\n\nBut if you want to preserve your privacy, then you should always use Tor Browser. ZeroNet or clearnet.\n\nThe main goal of ZeroNet is \"open, free and uncensorable websites\". Anonymity is an extra feature you get by using Tor. It is not the reason ZeroNet was built.\n\nI think many folks here think that ZeroNet is all about being anonymous, which is not.\n\nNothing wrong to being anonymous but this not what ZeroNet is all about.",
				"added": 1585944970
			}
		],
		"1606040168_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 12,
				"body": "I don't think it's possible at the moment because no one ported it to iOS.",
				"added": 1606116190
			}
		]
	},
	"comment_vote": {
		"10_1KRJTDNcfHhogWdZRoMSkfS1FZoCCPvjer": 1,
		"229_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"26_1e6paNoDoqwCZGNa4o4uX43GrawvJuVB5": 1
	}
}