{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1621790517_1BDov7xo2ezh8RNpumtUozsEv9C4yJAF9d": [
			{
				"comment_id": 1,
				"body": "(How can I reply/quote the OP?)\n\n@harbringerofdoom Your post is interesting and just like you imagine, marxists are on a boulevard of broken dreams... \n\nHowever, I think that famine is a rulthless, efficient way to wipe entire nations having surrender to this demonic ideology. To achieve it, you have to understand that your biggest struggle, will be your back front, ie all those idiotics and morons with their little hearts who will try to oppose the massacre of the infants of the marxists. You will have to be careful and clever to eliminate them (the domestic front).\n\n1 proposal I would make, is to be able to quickly classify them as domestic enemies (FBI, NSA all the security gig), by using a false flag attributed to a close by marxist country like cuba (and invade) so that they will expose themselves more (in short a pretext to execute them).\n\nSecondly,  I like how you want to ignore them, one cool way is to avoid all sources reducing your time to achieve your individulastic objectives, for example censored social medias, or the Time Vampire system (TVs). So rather than provide attention which those enemies of freedom monetize to grow stronger, do as you say, and become better than them, in all aspects ( I recommend to record for example \"the profit with markus on cnbc\" for rest time). \n\nFinally, it's of course necessary to send to the sewer all marxists operatives in first the corporate world (firing them and replacing them with young recruits) and then cleaning the state operatives (social workers) from this plagues...\n\nTo do it, tax erosion, suppression, etc is the best way to put them toward the fiscal cliff of death (ala greece).",
				"added": 1621798970
			},
			{
				"comment_id": 2,
				"body": "> [elr23423nksdasd](#comment_4_1KFTNuxkQipsabR2q9XhxxTTtqn9QiSxeP): Not sure if serious or troll...\n\nFrom what I understand it's more a battle cry, leading to the extermination and final domestic solution against this plague (marxism) seeking to erode the social, economic, political, judicial and national construct to replace it with their agents, with the goal for them to end up, like the castrists (cuba), on yachts with state sponsored for the nomenclature privileges aka looted from we the people.\n\nI believe too that it's a serious threat, if left unattended. Are you a \"marxist\"?",
				"added": 1621799256
			},
			{
				"comment_id": 3,
				"body": "> [philipp](#comment_5_12US2VukWu67qaeerMVwtm85mg8ExmqhWV): Yes, nice thoughts, I agree. That's why I try to become as independent as possible. To be not governed. And as marxist it sounds, to become independent from money. That's how they can get you. Produce your own stuff you need. If they come up with this and that, say no thank you, and you can do this if you are self sustainable. A strong individual!\n\nI think you are losing one important side of the equation with your isolation / independence strategy. \n\nIt's the trading network that will make us stronger against the marxist plague. The capability for us to be able against financial retribution, to harvest the potential of other non contaminated market participants, to extend collectively our power and reach over those demons seeking control over our lives.\n\nthat leads to the concept of specialization, if you are better in doing something for example : sniping marxists who seek to topple down statue, why would you learn everything about medical operations on a battlefield? I know it may sound harsh, we aren't there yet, but if left unattended, the marxist threat will necessitate such definitive measure. A more peaceful example, if your current location is suitable for rabbits why would you grow cows?\n\nAnd that's the thing about the most powerful tool in our arsenal money ! If you become moneyless, you will naturally reduce your field of possible to fight this war against marxists. Rather you have to think about what you consider money : a medium of exchange? a store of value? buying power? selling accounting result? It's very important for you to be clear about it.\n\nFor example, you can beat inflation, if the marxists in power, start to debase, by increase the velocity of your trade... the faster you refocus your asset portfolio to your real need, the less impact the financial debasement will have on you. You need a scope for your ar-15? but this ps4 is for what for? to buy an ar-15 scope. You need bullets for your ar-15 training week end? maybe rather than buy this stupid starbucks coffee, brew your own (with www.infowarsstore.com) and spend the rest in bullets !\n\nNow I think one of the problem of marxist take over, is their lust for bank account, ie as you have imagined, they are after everything you own, to control everything you are. And there comes, legally, off shore banking ! Why not open a banking acount in Irak ! I know it may sound a little extreme, but do you think that \"marxists\" have a chance against Irak? Maybe you think it's too risky, Dubai... then what to store in those 3rd trusted party systems, be it cryptos too, MOBILITY !\n\nIn fact it's important that marxists seek to exploit and harvest submissive and defeated people from all that belonged to them, as such in such conflicts, it's important to lose all sense of ground value (or heritage, birth place, legal rights, ownership of the soil). War against Marxists are flux wars.\n\nIt means that vast stretch of land will have to be burned down, be it to deny them, or prevent them from moving. As such by becoming too much tree like, you lose the dynamic potential of the battlefield, and may be, even on our side, engulf in the flames of scorch earth necessities.\n\nso it's great to be a strong self reliant individual, however, in don't forget to trade castor fur for next gen rifles... What I mean is that the trade network is our power, let's cultivate it.\n\nOne by avoiding all marxists controlled corporations, all marxists controlled things, and secondly, to replace those by those supporting our liberties. In short by making your neighbor and market side giger stronger, you move the contact line with the marxists further away from yourself, increasing even more your resilience to the plague.\n\nThen, rather than waste time on the censored social medias and others time consumming entreprises, keep attention to the local, national and even international laws... from the uno agenda 2020, 2030, to the national translation of those edicts, to your state/city/neighbor situation. Don't trust the medias to be your trusted 3rd party news providers, they have already betrayed you. \n\nFinally, when they come for you, it's to send you to the gulag or shoot you. there is no middle ground or rational or logic to try to find with those things. EXTERMINATE.\n\nAnd to exterminate : stronger individually, stronger locally, stronger nationally, and finally internationally, to start to hunt them down, worldwide, but first, the home front.\n\nmoney, mobility, intelligence, trade network, support network, time allocation, focus, safety first.\n\nRest assured : the marxists are always defeated, by famine, that they self induce on themselves, every single time, more exactly, famines that those they elevated to their agendas (by taking everything from them) endure...\n\nand to be fully complete : \n\nI believe there is only one context where communism can work, it's post wars / post feudal / colonial transition, in the sense that the entire industrial/social/economical/political/judicial structures have already been destroyed (which the marxists are right now undermining, rather than to evolve/modernize/reform), as a \"collective phaze\", like on a ship, is necessary to survive the next waves of attacks from the enemies and to reestablish a marxistless system.\n\nSecondly, a free market, to me, implies well though regulations, like the ban of trading of children as sex slaves or sacrificial corpses. Another example to illustrate that we aren't in a well regulated free market, plants of the creation (coca, poppy, weed) aren't legal in most so called free markets... \n\nand thridly that some causes that the marxists use to aggregate deserve attention, like the drug war, or abortion, or gay rights etc not in the objective to make us stronger, but in the idea to remove any possibility of grip that the marxist could exploit.\n\nAs fundamentally marxism isn't an ideology, but a mean to gain power for group refusing to participate in the well regulate market, for them to climb the social ladder, by gaining power, as illustated by bernie sanders and his drive to accumulate personal wealth...\n\na little question : are we gonna win? of course the marxists have 0 chances against Islam...\n\nthey will come and say they fight for the final battle...\n\nhear be they will... (always, people speaking about the final battle, interests)\n\nand when they will say, that they are against God, fast their demoniac lives, will they lose over the mighty sands...\n\n\nso rest assured little marxists traitors of the fbi, cia, dod, we have strong fundation, way longer than your little empire, and even our divide, even dwarfs the existence of your former nation... shall I even say language?",
				"added": 1621801095
			}
		]
	},
	"comment_vote": {}
}