{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1524909331,
			"title": "Lessons learned from Last night's alcohol withdrawal",
			"body": "- Question everything, even the fabric of reality. There may be parallel universes, and reality may be a simulation. There is a frequency of consciousness one needs to tune into in order to come back to reality.\n- Always try to inter-connect the events.\n- Information stored on hard drives will tell you the truth\n- Artificial intelligence may be secretly conquering Earth.. while hiding in technology. Even if it's not true, it could theoretically be true.\n- Admit that you might have delusions.\n- I asked my parents about last nights events, and I got an entirely different story of what happened.\n- Don't be afraid of the unknown. Conquer it all. Work hard, study hard .. embrace science, the workings of the brain .. and become immortal.\n- Don't let go of yourself. Don't unplug yourself. Don't commit suicide. The mission of life is too important to allow the chaotic forces of the universe to jeopardize it.\n\nQuantum mechanics is real",
			"added": 1524909330
		},
		{
			"topic_id": 1524911686,
			"title": "The concept of death is a scary thing",
			"body": "Suicidal thoughts are cancerous.. and you need to try and find a way of hacking your own brain to try and get rid of them .. because psychologists are human, too, and will not always save you ...they're imperfect, and not always able to diagnose illnesses properly. Nobody will help you if you don't do it make the best effort to preserve your existence. The universe is a cold, heartless place .. but also peaceful and meditative.",
			"added": 1524911684
		}
	],
	"topic_vote": {
		"1524327364_1GkmeCNuarifRQooJ8P5xawoXCweDdLrUJ": 1,
		"1524935803_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1524884860_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 1,
				"body": "> [ssdifnskdjfnsdjk](#comment_234_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): no, i do not think anyone competent about politics and military is listening there, i think you are crying on the wrong grave\n\nGood. You are listening.",
				"added": 1524912031
			}
		],
		"1524885164_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 2,
				"body": "> [renalec](#comment_5_1KCJ86Jg3LNBpHxcaRojsHTg9Qme9vuV1j): Keep going, I don't mind. At worse it'll give me a chance to test out the mute user feature.\n\nYou won't mute me. The mission to save mankind from self-destruction is too important for me to allow you to jeopardize it.",
				"added": 1524912112
			}
		],
		"1524935803_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo": [
			{
				"comment_id": 3,
				"body": "It's not supposed to be seen on the clearnet unless one uses a proxy",
				"added": 1524948134
			}
		]
	},
	"comment_vote": {}
}