{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1EgUy8JPn2uN1tLvU8NKBL2XYaFSBCAuA3": 1,
		"1_16Rzxa6VPukdeqEzS94kTgUAB9mBLQheLd": 1
	},
	"next_comment_id": 6,
	"comment": {
		"2_1FGs1Gjnx5nQnfR8X1jXdS1fUyy46iWht4": [
			{
				"comment_id": 1,
				"body": "Hola, que tal?\nNomas para aportar un simple dato, muchas webs \"normales\" o \"convencionales\" o que usan la internet que todos conocen tienen series y películas online en español. Generalmente la calidad del video apesta mal, pero el audio es aceptable o incluso bastante bueno. Por lo general muchos las suben a vk u otros sitios que permiten compartir videos y no se esmeran mucho en eliminar los que violen los derechos de autor.\nEl punto es que si tienes el capitulo de una serie o una pelicula en ingles podrías simplemente bajar un video de los comentados anteriormente y con ayuda de algún que otro programa extraer el audio en español y sumarlo al video en buena calidad con audio en otro idioma. Tambien puedes simplemente buscar los subtítulos pero en lo personal soy bastante perezoso y me da pereza leer mientras miro una pelicula o similar...",
				"added": 1459299513
			}
		],
		"1_1Ae6k82RUeNPhFozysdytsdhhfPiQd2kQ8": [
			{
				"comment_id": 2,
				"body": "Hola, Tengo un mac book pro de los viejos (antes de que les dieran esa forma delgada como ala de avion).  Como sea alguien mas ha tenido problemas con la instalación de El Capitan? Me da errores el registro de logeo o algo así, por lo que no puedo dejar claves guardadas ni nada en ningún programa y debo iniciar sección en todo cada vez que reinicio.",
				"added": 1459443759
			}
		],
		"1_1K8SQkVCSEtF4o1jHitLiY1VfMcByDeDvm": [
			{
				"comment_id": 3,
				"body": "Puedes usar insecticida...",
				"added": 1459445357
			}
		],
		"1_1AJBNQqksAgywJ423u3EiibH624TZBXvT2": [
			{
				"comment_id": 4,
				"body": "Prueba con esto, lo encontre hace unos minutos (parece que no tiene mas de unas semanas de liberado el codigo)\nhttps://webtorrent.io/desktop",
				"added": 1460063468
			}
		],
		"1_1ALHyxaNjL7txuopaMJ8fAg6WF1DEZCFe9": [
			{
				"comment_id": 5,
				"body": "jajajaja yo por xataka tambien, jajajaja",
				"added": 1461619709
			}
		]
	},
	"comment_vote": {
		"1_1Eqpsj7GKzdwy9pUVkamJ36qSS8R7UzmM4": 1,
		"2_1AJBNQqksAgywJ423u3EiibH624TZBXvT2": 1
	}
}