{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1543505232,
			"title": "11- 29- 2018 Used zeronet update option and it destroyed user acct and all data",
			"body": "I am a new user to zeronet and decided to do a check for an update and it showed up with a server error and then zeronet went down.  I LOST EVERYTHING IN THE CRASH!!! \nIs this a bug? or a server issue?  And I do not know where to post this as a bug report. \n\nOver all I like zero net but the GUI is a piece of Eye Candy SHIT!.  Put some dam functions in the site and stop wasting you time and my time looking at pretty graphics and colors moving around doing nothing but sucking up cpu time and my time to get where I want to go.",
			"added": 1543505231
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1543505232_1LRrXQL18q4U54Zv8mafCCGm2WAYSe79hu": [
			{
				"comment_id": 1,
				"body": "> [glightstar](#comment_99_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): You can report bugs here: https://github.com/HelloZeroNet/ZeroNet/issues/new\n\nThanks.",
				"added": 1543512685
			},
			{
				"comment_id": 2,
				"body": "> [wanditoast](#comment_18_1LJMKSLPgM8fqQSMRrLzWB2DhVm1zoEVfZ): you manually reinstall in the same folder and it's the same as the automatic update from the menu .\n\nThere was a server error and only half of the files got updated from what it looked like to me then it crashed.\nThe json file was missing. Glad I did not do anything important on here.",
				"added": 1543512861
			},
			{
				"comment_id": 3,
				"body": "> [thunder33345](#comment_341_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): did it destroy data in /data/user.json?\n\nYes. I am still having some issues after I wiped the folder and did a fresh re install. I am getting a invalid hashtag error. And this is a fresh install.",
				"added": 1543518779
			},
			{
				"comment_id": 4,
				"body": "> [thunder33345](#comment_342_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): can you show us the errors?\n\nI wish. For the last hour I was not getting any content from any site. Now I am getting content.  All errors are gone.",
				"added": 1543518912
			}
		]
	},
	"comment_vote": {
		"99_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1
	}
}