{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"4_1DzzCLZPTRXVQCDf7AGyr6ZEyeqg9NJDQ1": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 1,
				"body": "#A arte da Guerra – Sun Tzu\nA Arte da Guerra, é um tratado militar escrito durante o século IV a.C. pelo estrategista conhecido como Sun Tzu. O tratado é composto por treze capítulos, cada qual abordando um aspecto da estratégia de guerra, de modo a compor um panorama de todos os eventos e estratégias que devem ser abordados em um combate racional.\n- https://gateway.pinata.cloud/ipfs/QmNniaRmEipXTmbDETPzGZ5ShZXgne1KAMzrG7qa8FiVEG",
				"added": 1576932770
			},
			{
				"comment_id": 2,
				"body": "#As 48 Leis do Poder – Robert Greene\nO livro mostra como agiram personalidades que estiveram enfronhadas no poder no decorrer da história, além de oferecer 48 estratégias para o leitor atingir as rodas do poder.O poder é um jogo. É preciso saber jogá-lo para conquistar o que se deseja na política, nos negócios, na vida pessoal e até nas relações amorosas. As 48 Leis do Poder ensinam de maneira rápida e didática como agem os grandes mestres nesta arte que envolve inteligência, perspicácia, planejamento e principalmente dissimulação. As Leis incluem, entre outras, a capacidade de esperar o momento certo para atacar, criar uma aura de mistério para confundir os inimigos, saber conquistar corações e mentes de pessoas e encobrir os atos em cortina de fumaça.\n- https://gateway.pinata.cloud/ipfs/QmdrtUv3KGoYeGwxdaWVn5VnnPfUa8HjUX35ZU5ssceRFL",
				"added": 1576932793
			},
			{
				"comment_id": 3,
				"body": "#38 Estratégias para Vencer Qualquer Debate – A Arte de ter Razão – Arthur Schopenhauer\nA forma como nos comportamos socialmente não mudou muito desde Aristóteles. Partindo dos escritos do pensador grego, Schopenhauer desenvolve em sua Dialética Erística, 38 estratégias sobre a arte de vencer um oponente num debate não importando os meios. E, para isso, mostra os ardis da maior ferramenta que todos possuímos, a palavra. Usar argumentos e estratégias certas numa conversa é uma arma poderosa em qualquer momento. E tanto vale para quem quer reforçar um talento, evitar ciladas dialéticas, ou simplesmente estar bem preparado para negociações ou qualquer outra ocasião que exija argumentação… o que acontece em todos os momentos da vida. Essas estratégias não foram inventadas por Schopenhauer. Seu trabalho foi identifica-las, reuni-las de modo coerente, mostrando como são utilizadas, em quais momentos elas surgem em meio a uma discussão, de modo que você possa utilizar-se deste livro até mesmo para desmascarar o uso das estratégias. Em discussões, o objetivo de todos é persuadir. No entanto, o melhor resultado é obtido pela pessoa mais hábil em manter a sua posição. Esta obra cataloga os truques utilizados por profissionais de todas as áreas. Pode ser que você esteja com a razão, mas, uma vez que você entre num debate, estar certo não é o suficiente. Você precisa conhecer os movimentos dessa arte para ter força no jogo. Este livro ensinará tudo o que você precisa saber.\n- https://gateway.pinata.cloud/ipfs/QmWmLquYqeBjo1yUMT23F67z6bqd7kScVXAukUU3NS4HW6",
				"added": 1576932835
			},
			{
				"comment_id": 4,
				"body": "#Sobre a Guerra: a Arte da Batalha e da Estratégia - Napoleão Bonaparte\nConheça a incomparável experiência militar de um dos mais famosos e bem-sucedidos líderes da história mundial Napoleão Bonaparte é reconhecidamente um dos maiores estrategistas de todos os tempos. Seu domínio sobre batalhas e sua capacidade de mobilizar exércitos revolucionaram a arte da guerra. Além de ter vencido quase todos os cinquenta embates campais que empreendeu, foi um importante administrador do Estado. Grande parte do seu código civil, embasado nos preceitos da Revolução Francesa, vigoram até hoje na França. Porém, Bonaparte não chegou a escrever uma obra organizada sobre guerra e estratégia. O especialista Bruno Colson foi responsável por reunir pela primeira vez todos os escritos de Napoleão — cartas, relatos orais anotados pelos memorialistas e inéditos encontrados em arquivos —, construindo um livro original, que revela as maiores qualidades do imperador francês.\n- https://ipfs.infura.io/ipfs/QmanPKSvhHB8Kwg4WTfjnmW4TQwRX3fw62nFWqTS7o4gNc",
				"added": 1576933500
			}
		],
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": [
			{
				"comment_id": 5,
				"body": "#PascalCoin\n\nA PascalCoin não vai eliminar o bitcoin a curto prazo, mas emprega novas estratégias interessantes para criar uma criptmoeda. Em vez de confiar no histórico de transações em blockchains, como na maioria das outras criptomoedas, o PascalCoin usa um ‘safebox com um hash’.\n\nO recurso safebox torna desnecessário que o usuário final baixe um bloco de operações históricas, tornando a PascalCoin a primeira criptomoeda a fazer isso nativamente. O balanço é incluído em cada bloco da blockchain para que a cadeia possa ser excluída sem afetar a capacidade de fazer transações.\n\n- https://www.pascalcoin.org/\n- https://github.com/PascalCoin/PascalCoin.git",
				"added": 1576934505
			}
		]
	},
	"comment_vote": {}
}