{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1568049053_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1568049053_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": [
			{
				"comment_id": 1,
				"body": "> [moor](#comment_231_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): she blew the whole thing up indeed. and what liberals do? shame a porno star to suicide...\n\nOr encourage more women to take the same path.",
				"added": 1568263049
			},
			{
				"comment_id": 2,
				"body": "> [alternedleanings](#comment_6_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy): if the left cared about women at all, they would assault the porn industry as a whole. it is a destructive scourge that is doing its best to ruin as many young women as possible.\n\nExactly, but they don't, because they are profiting from this on one way or another. They also profit from being hypocrites and pretend they care. This cripples society, and liberalism is a cancer.",
				"added": 1568263244
			},
			{
				"comment_id": 3,
				"body": "> [kidcourageous](#comment_141_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): Porn and sex work make girls money. That's why you're bitter. I've appeared in a number of films with friends and we fuck all the time. You're just upset because you're a shit person and people don't wanna put out for people like you.\n\nWow, you care so much about women that you'd like them to get used up and thrown in trash. I guess you'd do the same to your daughter too? You're fucking trash.",
				"added": 1568263613
			},
			{
				"comment_id": 5,
				"body": "> [kidcourageous](#comment_199_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): oh no some incel called me trash what am I gonna do?\n\nHey, let's call everyone we don't agree with an incel.",
				"added": 1568389003
			},
			{
				"comment_id": 6,
				"body": "> [trotski](#comment_18_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV): Who threw Jenni Lee in the trash? A cold, Puritanical society too busy minding everyone else's business.  [...]\n\nCountries that choose to regulate prostitution end up having the most amount human trafficking, thus doing the opposite helping women. It may look good on paper, but it doesn't work in practice, rather it makes the situation worse. \n\nThe solution is to establish a support network for women that are dragged into prostitution and educate society so that people understand that this is never a good option. Part of this support network should be a welfare system. We need to maintain a welfare system for people in need, a roof over our heads, food and clothing are human right that everyone of us is deserving of! No one should feel the need to prostitute him-/herself. Another part of the support network must be a police/military. Without force you can't get rid of the gangsters/pimps that are taking the role of being a virus in our society.",
				"added": 1568390144
			}
		],
		"1566570350_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 4,
				"body": "You can have mass deception and slavery under liberal atheism too. It's not really an improvement in that regard. Christianity placed certain obstacles in front of progress, but so does atheism and liberalism, but in different ways.\n\nTry to challenge liberal ideas in public and see what happens.",
				"added": 1568264245
			}
		],
		"1568379812_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3": [
			{
				"comment_id": 7,
				"body": "> We can ditch the part all humans have from our consideration, because, well, its pretty irrelevant. We can also drop the part that varies from person to person because we are talking about the context of races here, even though im not saying that it cannot allow any individual to rise about his peers.\n\nYeah, let's ditch a very important point that contradicts your idea. How do you differentiate between races, and what's the difference RELATIVE to the whole (of which a huge portion you chose to ditch). Besides, a slightly smaller genetic distance to apes doesn't necessarily prove inferiority. We have a pretty small genetic distance to pigs as well, how do you explain that?\n\nSorry dude, without explaining what those genes do and how they affect us relative to other genes, there is no way for you to make your point.\n\n> even after somebody brought them things like modern technology or medicine.\n\nWell, you don't seem to understand it very well.\n\n> With most races it would be a difficult to objectively point at any of them as the best one, however one of them very clearly falls behind all the others - niggers\n\nThey did just fine 3-4 thousand years ago relative to everybody else if I'm not mistaking, Back then, genetics wasn't much different at all from what it is today. It's mainly things like cultural/economical differences that judge how successful a nation or race is. Generally black people are at a disadvantaged state because of various reasons. Had things been different then maybe you would've been the nigger, and arrogant blacks would've made similarly stupid points about you.",
				"added": 1568391376
			}
		]
	},
	"comment_vote": {
		"6_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": 1,
		"7_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": 1,
		"41_1HQa2NE5CRuVJsvHKLNMNrund5qwAxud9Z": 1
	}
}