{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1637341086,
			"title": "Has Tamas (Nofish) abandoned Zeronet users?",
			"body": "I've just never known anyone to run Zeronet without Tor, and without an update Zeronet won't work much longer.",
			"added": 1637341085
		}
	],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1628101623_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": [
			{
				"comment_id": 1,
				"body": "ZeroID has always been a problem. You just need to mess with it.\n\nTry this: Hit CTL-C in the server window, then restart the server. If your new ID doesn't magically appear, resubmit using Firefox (not the tor browser). If it still hangs, let it sit for an hour - then shutdown and restart the server again.\n\nGood luck!",
				"added": 1628381171
			}
		],
		"1637305080_18DQw1RXP4gQcqPcYrxZEPzc55fXAv16eQ": [
			{
				"comment_id": 2,
				"body": "It's a people's network. Hosted by thousands of people around the world. The talking heads in government and media hold no sway here. But if you are just a domestic farm animal - you should leave. What you read here may upset your programming.",
				"added": 1637338325
			},
			{
				"comment_id": 3,
				"body": "> [ibudder](#comment_1_18DQw1RXP4gQcqPcYrxZEPzc55fXAv16eQ): i mean if i come aross ilegal p*rn a cop isn't gonna show up on my door right???, i mean i don't technically host anythyng on this network (exept the things i upload/download)\n\nIf you find such, blacklist that site and delete any files you downloaded. Best way to protect yourself is to fully encrypt a separate drive with a long password to host your zeronet files. That way, if you missed deleting something, it will stay unrecoverable after powerdown.  Windows users shoudl look at \n\nGenerally, like any dark web...you must look for trouble to find it. For all the whining about porn...it really is rare. Windows users should look at Diskcryptor. Linux users  have LUKS (built into almost all distros).",
				"added": 1637338773
			}
		],
		"1637322366_172aTiZARYuYxYznMn42L36cZGuUjv11dr": [
			{
				"comment_id": 4,
				"body": "Everything is noise now since we really have no journalists.",
				"added": 1637338869
			}
		],
		"1632001629_178KvFeW5b16fZsNtWY3pDjLHj8aiLdTMK": [
			{
				"comment_id": 5,
				"body": "Forced association never works.",
				"added": 1637338983
			}
		],
		"1636765653_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 6,
				"body": "New series on HBO. Hi$tory. His argument? Always follow the money. That's the real show. There are no others.",
				"added": 1637339242
			}
		],
		"1636071087_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 7,
				"body": "Events should be really focusing your mind on your reliance to such organizations. I think many of us have concluded that most present government is truly worthless - so it's time to look for the exit.\n\nSelf sufficiency on food is the big one, but keeping government paws off your limited resources may be equally important.\n\nDo that, and you have substantially reduced their power over you.",
				"added": 1637340074
			},
			{
				"comment_id": 8,
				"body": "> [tarka](#comment_1_1P52LQ4PSWFYvAUU7TPYJwLjHAdjaC3Ht): Agreed literally with every word you said, European governments are getting out of control. If you have some technical skills perhaps you'd be interested to know you can play a part in fighting against this tyranny with like-minded sane people.\n\nDo Europeans really agree with their governments, or are they stunned by their impudence?\n\nPersonally believe protests like we've witnessed in Australia are absolutely useless, as are transportation strikes. You only get their attention when you kill them, but the chances of escape are slim.\n\nSo maybe it's a good idea to be friendly toward terminal cancer patients? If they take out twenty politicians for you - those people won't be coming back. Loons are hard to replace.\n\nIt's difficult for most so grasp this reality.",
				"added": 1637341611
			}
		]
	},
	"comment_vote": {}
}