{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1623615171,
			"title": "Utopia P2P",
			"body": "Cześć użytkownicy!\nNatknąłem się na komunikator Utopia P2P i nie wiem czy jest bezpieczny.\nNa stronie tego komunikatora można wyczytać, że jest odporny na inwigilację i cenzurę, ale to tylko słowa. Nie jest otwartoźródłowy, więc nie wiem czy to prawda.\nJak sądzicie? Można mu zaufać?\n\nLink do Utopia P2P:\nhttps://u.is/en",
			"added": 1623615170
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1623615171_193fCp5MWKjfmbNuSd5thzbfDsCj5whHTQ": [
			{
				"comment_id": 1,
				"body": "Wyczytałem, że kod źródłowy jest zamknięty, bo twórcy nie chcą rozwidleń (forków) i dlatego, że chcą zjednoczyć ludzi o podobnych poglądach. Dobrze że powstrzymałem się od zakładania konta.",
				"added": 1623698592
			},
			{
				"comment_id": 2,
				"body": "> [kapec](#comment_47_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): zamknięty kod źródłowy = niech spieprzają [...]\n\nDzięki!\nNapewno sprawdzę.",
				"added": 1623766208
			},
			{
				"comment_id": 3,
				"body": "> [moric](#comment_6_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda): Sprawdź kto jest Właścicielem tego interesu? I nie chodzi o figuranta. Inaczej, kto to sfinansował? Ten jestwłaścicielem. Ta aplikacja nie jest Tania.\nPrawdziwi właściciele nigdy się nie ujawnią.\n\n< Cytat z https://u.is/pl/faq.html  [ Kto opracował ekosystem Utopia i kto za tym stoi? ] >\n\nPrzez ostatnie 6 lat Utopia była opracowywana przez grupę entuzjastów technologii sieciowej. (!)Aby wyeliminować jakikolwiek wpływ na projekt, programiści Utopii na zawsze pozostaną anonimowi(!). Nie będziemy mogli zmienić algorytmów ekosystemu po jego uruchomieniu. Żyjemy w świecie totalnej inwigilacji, gdzie brak prywatności staje się normą, a poufność należy do przeszłości. Czujemy, że taki stan rzeczy nie może trwać długo i naszą odpowiedzią jest Utopia. Wierzymy w podstawowe prawa i wolności, do których wszyscy ludzie mają prawo i które obejmują prywatność komunikacji i wolność wyrażania siebie. Naszą misją jest zachowanie tych wartości dla ludzkości i przygotowanie gruntu dla wysoce technologicznego społeczeństwa przyszłości. Utopia jest naszym wkładem w rozwój samoregulującego się społeczeństwa, humanizmu i wolności. Utopia jest instrumentem, który przywróci wolność wyrażania do Twojego życia. Czas wziąć prywatność komunikacji we własne ręce!\n\nOstatnie zdanie trochę mnie rozbawiło.",
				"added": 1623861156
			}
		]
	},
	"comment_vote": {}
}