{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1542861175,
			"title": "Gab.ai",
			"body": "Anyone here ever used Gab.ai?",
			"added": 1542861174
		}
	],
	"topic_vote": {
		"1542060084_12c3mbFn8EzBa5Tw3WnZ12azK99YsNHszA": 1
	},
	"next_comment_id": 15,
	"comment": {
		"1542060084_12c3mbFn8EzBa5Tw3WnZ12azK99YsNHszA": [
			{
				"comment_id": 1,
				"body": "Holy fuck and here I thought that Poland was a safe haven.  Good to hear there are safe zones though",
				"added": 1542860614
			},
			{
				"comment_id": 2,
				"body": "Holy fuck and here I thought that Poland was a safe haven.  Good to hear there are safe zones though",
				"added": 1542860624
			},
			{
				"comment_id": 3,
				"body": "Holy fuck and here I thought that Poland was a safe haven.  Good to hear there are safe zones though",
				"added": 1542860647
			},
			{
				"comment_id": 5,
				"body": "I'm glad they are doing safe zones instead of having no-go zones like in other European countries.",
				"added": 1542860782
			},
			{
				"comment_id": 6,
				"body": "Sorry about the quad post there.",
				"added": 1542860816
			},
			{
				"comment_id": 9,
				"body": "@1pgallery - I'm using the alpha android version.  Seems no way to delete currently.  I think what I'll do though is vnc a little Linux box.  Really interested in zeronet and it's potential but mobile right now isn't the best yet.",
				"added": 1542868214
			},
			{
				"comment_id": 10,
				"body": "I'll delete when I figure out the desktop. For the record the posts were tripled as I had recieved object errors for each post but ended up posting after I refreshed.",
				"added": 1542868284
			},
			{
				"comment_id": 11,
				"body": "But to keep with OP and related posts here, I think it's not a nazi thing for European countries to try and keep their culture and their kids there working. \n   Lot of media blur on the forces at work, and tough to figure things out, main thing being dangerous no go zones is a real thing in Europe. Unfortunately these are Muslim areas. \n   I've never heard of safe zones before in Poland so it's interesting.",
				"added": 1542868408
			},
			{
				"comment_id": 12,
				"body": "> [1pgallery](#comment_12_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE): you can delete posts, hover left of your text and click to edit then a button at the bottom should appear to delete a post\n\nJust notice the reply option here.  I need to give you a point to reply.",
				"added": 1542868460
			},
			{
				"comment_id": 13,
				"body": "> [npc4921](#comment_12_1PkVAeJswTgCVG4MN6BZG7YdWpzgmek5WZ): Just notice the reply option here.  I need to give you a point to reply.\n\nWhich seems to turn into a quoting mechanism but starting a new thread.  It's pretty cool",
				"added": 1542868496
			},
			{
				"comment_id": 14,
				"body": "> [npc4921](#comment_13_1PkVAeJswTgCVG4MN6BZG7YdWpzgmek5WZ): Which seems to turn into a quoting mechanism but starting a new thread.  It's pretty cool\n\nNope not a new thread.  So same as quote function on mobile anyways .",
				"added": 1542868536
			}
		],
		"1542766666_1Bcm7BpVuYsQaE8wGB8CrLWzef32rrMy1r": [
			{
				"comment_id": 4,
				"body": "Yeh likely best to cold store everything, go to sleep and open my eyes again in 2040",
				"added": 1542860709
			}
		],
		"1542278485_1ELQXPkiUPmfR2ZCJLyhEucP5vqkLWaJdv": [
			{
				"comment_id": 7,
				"body": "Kodachi is nice.",
				"added": 1542860902
			},
			{
				"comment_id": 8,
				"body": "But if you want something that runs on everything fedora 29 or Ubuntu 18",
				"added": 1542860939
			}
		]
	},
	"comment_vote": {
		"12_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": 1,
		"12_1PkVAeJswTgCVG4MN6BZG7YdWpzgmek5WZ": 1,
		"13_1PkVAeJswTgCVG4MN6BZG7YdWpzgmek5WZ": 1
	}
}