{
	"next_topic_id": 9,
	"topic": [
		{
			"topic_id": 1534955222,
			"title": "Blog of Indeep",
			"body": "Hi 0net people ! I've launched my blog. The first post is a borderline rant & also a statement of intent, in homage to freedom of speech. I'm planning to use the blog to elucidate on some of the content that I'm planning to upload to 0net, including music, pictures, printed material, video-clips & films. Please visit the blog to seed it & stay tuned. Thanks :)",
			"added": 1534955221
		},
		{
			"topic_id": 1535627547,
			"title": "India’s upcoming encryption wars",
			"body": "In the space of two decades, encryption has gone from being a heavily restricted technology falling under the arms-control regime, to becoming a key enabler of all online communications and commerce. India’s regulations concerning encryption, however, continue to be sclerotic and in some ways hearken back to the wild days of the 1990s crypto wars. \n\nAs India currently scrambles to update its laws and regulatory structures for the data-driven future, encryption is likely to become one of the most keenly contested fronts in the battle between privacy, commerce, and national security.\n\nhttps://factordaily.com/indias-upcoming-encryption-wars/",
			"added": 1535627545
		},
		{
			"topic_id": 1535633348,
			"title": "What Europe Can do to Catch Dark Web Criminals",
			"body": "from https://www.infosecurity-magazine.com/opinions/what-europe-can-do-to-catch-dark/\n\n\"In a celebratory tweet, Europol, the pan-European law enforcement organization, wrote after a meeting in May establishing a task force on the dark web that “the Dark Web is no longer a hiding place for criminals!” For good measure, they added a fist emoji to the tweet.\"\n\nThis 'opinion' article commences with a very common socially-conditioning statement describing the 'dark web' as \"the infamous home of hackers, pedophiles, terrorists, and other undesirables.\"\n\nThis rhetoric is routinely applied to the users of anonymity networks & has been for years, to ensure the general public accept this notion & fully believe there's no valid purpose or use for anonymity networks. Of course, we know that's not true. \n\nYes, the most famous examples of the nefarious use of anonymity networks are very well documented - I'm not disputing the fact that certain uses of anonymity networks are reprehensible (that's my opinion & I'm entitled to it). \n\nHowever I also consider the continually reiterated negative statements about anonymity networks, communicated by the media to be a blanket generalization & broadly applied by government-compliant media as part of the long-term strategy of numerous governments, who want to eventually outlaw the use of anonymity networks by civilians. For this reason, government-compliant media organizations seem only too willing to reinforce the viewpoint that the use of anonymity networks can only be bad, bad, bad.  \n\nMeanwhile, around the world, we're seeing the steady erosion of freedom of speech. \n\nRant over! LoL :)",
			"added": 1535633345
		},
		{
			"topic_id": 1535639513,
			"title": "Two 'super spotters' led novichok hunt",
			"body": "Two detectives with a rare skill in memorizing faces have spearheaded the search for two Russians suspected of carrying out the Salisbury nerve agent attack, it emerged yesterday. \n\nhttps://www.pressreader.com/uk/daily-mail/20180829/282114932440858",
			"added": 1535639509
		},
		{
			"topic_id": 1535777936,
			"title": "Electromagnetic Field 2018 - Streaming :)",
			"body": "https://streaming.media.ccc.de/emf2018/\n\nElectromagnetic Field 2018 will be held on 31st August – 2nd September 2018 at Eastnor Castle Deer Park, Ledbury. http://emfcamp.org \n\nEMF 2018 includes talks, workshops, installations, and more. https://www.emfcamp.org/cfp \n\nYou don't have to be an experienced speaker to talk at EMF - impostors are welcome. \n\nElectromagnetic Field is a non-profit UK camping festival for those with an inquisitive mind or an interest in making things: hackers, artists, geeks, crafters, scientists, and engineers! \n\nA temporary town of more than two thousand like-minded people enjoying a long weekend of talks, performances, and workshops on everything from blacksmithing to biometrics, chiptunes to computer security, high altitude ballooning to lockpicking, origami to democracy, and online privacy to knitting. \n\nTo help matters along, we provide fast internet, power to the tent, good beer, and amazing installations, entirely organised by a dedicated team of volunteers.",
			"added": 1535777931
		},
		{
			"topic_id": 1535780554,
			"title": "How to Delete Content from big.kopykate.bit",
			"body": "See: http://127.0.0.1:43110/big.kopykate.bit/?Video=1535779369_1LYAhznicuncP8P6qiJFv6E1cw9ccCoqbX\n\nIt's an mp4 not too sure why there's an issue with this format on big kopykate although it's less than 10mb but this wasn't flagged during the upload process.\n\nI can't find any options to delete this file in the seedbox section of my big kopykate account or anywhere else on the zite. \n\nHow can I remove this file?",
			"added": 1535780548
		},
		{
			"topic_id": 1535890275,
			"title": "Researchers Shine Light on Smart-Bulb Data Theft",
			"body": "The attack allows snooping of data from environments that are highly secure or air-gapped, using infrared signals from smart bulbs.\n\nhttps://threatpost.com/researchers-shine-light-on-smart-bulb-data-theft/137003/",
			"added": 1535890268
		},
		{
			"topic_id": 1535993180,
			"title": "bittorrent-tracker-zeronet",
			"body": "I'm connecting to Zeronet using Tor & I'm noticing how the tracker connections frequently fluctuate. On average Zeronet reports 3-5 tracker connections. At the moment I've got 3/5 tracker connections:\n\n2 at 100%; 1 at 99%; 1 at 96%; 1 at 95%\n\nThis seems to be OK, however at other times the connections drop as low as 1/5 or 2/5. \n\nWhen I don't use Tor to connect to Zeronet I find I have around 10/12 tracker connections on average.  \n\nIs there a way to increase the number of connected trackers when I connect to Zeronet using Tor?\nI've not seen 0/5 connections so maybe the average of tracker connections I'm reporting is enough? Any advice on this would be appreciated - thanks!\n\nThis also got me thinking: should I host a Zeronet tracker? If so, is there a guide someone could point me to? I came across this:\n\nhttps://github.com/ZeroNetJS/zeronet-tracker\n\nFrom what I've read it would seem a Zeronet tracker is capable of providing connections to a number of different protocols. In addition to the details provided in the link (above) are there any further actions I'd need to take to run a Zeronet tracker as an onion hidden service? Any thoughts or suggestions are appreciated. Thanks :)",
			"added": 1535993172
		}
	],
	"topic_vote": {
		"1534897557_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"1534738261_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": 1,
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1533888643_1CTQURZnuvV9ijaHTqffTbKv8NQmNUqBTn": 1
	},
	"next_comment_id": 12,
	"comment": {
		"1534897557_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 1,
				"body": "zerosearch\nrabbit hole (from Alice in Wonderland)\nclouseau (from the name of Inspector Jacques Clouseau, from the Pink Panther movies)\nhunter",
				"added": 1534925353
			},
			{
				"comment_id": 2,
				"body": "sorry dude! only just seen this post",
				"added": 1534925383
			},
			{
				"comment_id": 3,
				"body": "i might have a few more - if it's not too late? still drinking my morning coffee LoL",
				"added": 1534925413
			},
			{
				"comment_id": 4,
				"body": "OK dude",
				"added": 1534925487
			},
			{
				"comment_id": 5,
				"body": "blurhy...here's some more suggestions of names for you!\n\nsift [verb] used with object. \n1. to separate and retain the course parts of (flour, aches, etc) with a sieve*.\n3. to separate by or as if by a sieve. \n\nsieve: meaning of sieve: noun an instrument with a meshed or perforated bottom, used for separating coarse from fine parts of loose matter. for straining liquids etc, especially one with a circular frame and fine meshes or perforations. \n\nHere's a few names for fictional search engines from the world of Film & TV\n\nFinder-Spyder  - is the name for a fictional search engine included in a number of TV series, including Breaking Bad, Weeds, Without a Trace, the X-Files, etc. zer0net variations of this name could be something like:\n\nZer0-Spyder\n\nSupernatural  - from the American hit TV show Supernatural\n\nSearchling  - from the Law & Order TV series\n\nother possible names inspired by sci-fi\n\nTARDIS  -  from Doctor Who\n\nother suggestions:\n\nLabyrinth\n\nScope\n\nClaw\n\nconcierge  -  meaning 2. usually a multilingual hotel staff member who handles luggage and mail, makes reservations, and arranges tours; broadly : a person employed (by a business) to make arrangements or run errands.",
				"added": 1534928015
			}
		],
		"1534955222_1LYAhznicuncP8P6qiJFv6E1cw9ccCoqbX": [
			{
				"comment_id": 6,
				"body": "http://127.0.0.1:43110/15BWJ4UVg3GQz88D2nUXdLt7hM5UB4LhUp/\n\nsorry dudes I've got chronic fatigue syndrome with fibromyalgia - it can affect my ability to concentrate on 'bad' days, like today. thanks for letting me know :)",
				"added": 1534966226
			},
			{
				"comment_id": 7,
				"body": "> [ssdifnskdjfnsdjk](#comment_463_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @indeep Hi, what is the link to your blog? Consider adding your blog to zeronet site directories..\n\nthanks! just added it to 0list :)",
				"added": 1534967394
			},
			{
				"comment_id": 8,
				"body": "> [styromaniac](#comment_29_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I'm sorry I made my comment earlier. It's deleted. I'm keeping in mind now that illnesses and other causes of impairment can be at the heart of such things. [...]\n\nThanks for your reply & your understanding - that's really appreciated! I can relate to the challenges you described from my own experience of interfacing with healthcare 'professionals' . I know it can be especially frustrating, to be treated for a medical condition that doesn't neatly fit into any convenient diagnosis &/or treatment. \n\nCFS/ME & Fibromyalgia are categorized as 'spectrum' conditions because the symptoms can fluctuate drastically & suddenly & my medical condition is often described as an 'invisible disability', because there's often no obvious signs, to others around me, that I'm unwell until I get the full-on symptoms. For that reason I've had to learn to let people know what's wrong with me.  \n\nOne significant & depressing facet of my medical condition is mental exertion can drain my physical energy just as much as physical exertion & poor concentration is one of the resulting symptoms, along with so-called 'Fibro-Fog'.  \n\nI'm grateful for your understanding, in a world of online communication that's become increasingly thoughtless, reactive & judgemental. It's both refreshing & reassuring to find a place to hang out online where some of the people can exhibit positive human characteristics like empathy :)",
				"added": 1535021964
			}
		],
		"1535743365_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": [
			{
				"comment_id": 9,
				"body": "nice doing business with you Donovo :)",
				"added": 1535778538
			}
		],
		"1535788306_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 10,
				"body": "thanks robione :) some weekend reading!",
				"added": 1535794727
			}
		],
		"1535780554_1LYAhznicuncP8P6qiJFv6E1cw9ccCoqbX": [
			{
				"comment_id": 11,
				"body": "thanks kai0! I deleted at [file] via zerohello :)",
				"added": 1535794973
			}
		]
	},
	"comment_vote": {}
}