{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"7_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"4_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": 1,
		"8_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1
	},
	"next_comment_id": 6,
	"comment": {
		"7_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 1,
				"body": "> [geekless](#comment_172_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Нет, от балды подписать одним сертификатом другой произвольный, разумеется, нельзя.\n> Из всего этого следует таковый вывод, ИМХО: Мы используем инструменты не по назначению. Отдельно должен быть код (\"приложения\"), отдельно личные данные пользователей (\"персональные сайты\"), отдельно коллективные данные (\"тематические агрегаторы\"). Существующие движки в такое не могут, но ядро все нужные API даёт. Нужно въёбывать и писать код, создавать новые движки.\nВооот от создателя WWW есть solid - где реализуется такая-же концепция: пользовательские данные у пользователей ,а приложения (сайты) запрашивают их частичное прочтение перед использованием. Прямо как в андроиде.\n\n> \"Классический\" централизованный форум в ZeroNet тоже возможен и в каких-то случаях оправдан, например, если это официальный сайт какой-то организации. Я сейчас концентрируюсь именно на централизованном варианте, потому что это вещь известная из опыта, и понятно, как её создать. А потом добавлю туда шардирование для перехода на модель с персональными хабами.\n> Меня расстраивает, что люди подменяют техническую возможность свободы слова пустыми лозунгами про свободу. Сидят на ZeroTalk и кукарекают о свободе. Ну-ну.\nТак время такое: никто не имеет воли действовать ,зато все имеют волю помыслить.",
				"added": 1561840644
			}
		],
		"8_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 2,
				"body": ">ZeroNet сама по себе не является свободным обществом и не предоставляет инфраструктуру для функционирования свободного общества. Это технология, инструмент. Создать общество, среду для коммуникации мы должны сами. И каким будет это общество - зависит от нас. Какие мы есть, чего мы достойны - то у нас и получится. Если же получится диктатура похлеще чем в реале, значит именно этого мы и стоим.\nЕсли бы мы смогли соединить ZeroNet с progect solid (то есть добавить \"собственные сайты\" - файлы ,где хранится ваша личная информация ,и где вы решаете давать ли доступ сайту к ней или нет) ,то мы бы могли бы получить неплохой такой ZeroSolid - интернет будущего. Вот только я не программист ,да и Zero делают не только русские ,но и другие люди. Чтож надеюсь что-нибудь из этого да выйдет ,надеюсь мы всё таки да признаем - выбор делать надо ,нужно действовать ,добиваться своего.",
				"added": 1561841791
			}
		],
		"6_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 3,
				"body": ">Как мне повернуть русских на путь демократии\nДемократия - херня. Панархия - вот что лучше всего. УДИВИТЕЛЬНО как здесь ещё панархистов не нашлось ,как-бы нецензурируемость ,активные обсуждения и прочая \"прогрессивная\" повестка.\nВообще на ютубе есть ролик: эволюция или революция ,что ждёт россию (дебаты) ,так вот там дебатирующие и приводят интересные мысли ,что люди ещё не поняли что всё зависит от их решения ,что власти бояться нечего ,что она слаба ,что наступает эпоха понимания : \"а что так можно было [жаловаться]?\" ,что для революции нужно подгадать момент ,так сказать \"сегодня рано ,завтра поздно\" и прочее. Остаётся только ждать.\n\nВот вам копипаста-определений\n\n>Панархия – это форма человеческих отношений, при которой каждый человек имеет свободу выбора своего собственного социального и политического управления без чужого принуждения. Панархизм означает, что люди могут свободно вступать в социальные и политические отношения и свободно выходить из них. А это значит, что правительство [ЭКЮ] существует только с согласия и благодаря согласию с ним тех, кем оно управляет.\n--------\n>Контрактные юрисдикции [КЮ, ЭКЮ чтобы лишний раз подчеркнуть экстерриториальность] — «государства», а точнее организации, поставляющие государственные услуги, лишившиеся своей территориальной монополии. Панархизм  — это идея демонополизации власти государства на конкретной территории. Контрактные юрисдикции  — экстерриториальны. Контрактные юрисдикции не навязывают вам что такое хорошо, и что такое плохо, как это может делать либертарианство или консерватизм.\n--------\n>Простыми словами, антрогосударство [ЭКЮ] – это виртуальное государство, законы которого применяются только к отдельным лицам, а не к целым географическим регионам. Полигосударство [панархия] – это совокупность антрогосударств в гипотетическом человеческом обществе.\n------\n>Все люди, являющиеся гражданами страны, обладают равными «естественными» правами, прежде всего, правом на применение к себе насилия. В стране есть некоторое количество правительств [ЭКЮ], причём это количество никак специально не ограничено. Каждый гражданин свободно выбирает из предлагаемых разными правительствами «пакетов условий и услуг», после чего «подписывается» на один из них (или не подписывается ни на один). В договоре подробно прописаны все обязательства, которые берут на себя стороны. Также в договоре присутствуют ссылки на все созданные этим правительством законы, регулирующие поведение граждан, вступивших под его юрисдикцию.\n\nАлексей Шустов, политолог, автор книги «После государства».\n-----\n>Панархия — это состояние общества, в котором издержки от смены юрисдикции стремятся к нулю и присутствует значительное количество юрисдикций. Панархия — это состояние общества, в котором присутствует рыночная конкуренция государства за налогоплательщиков.\n-----\n>Он [Кукатас (???)] обращает внимание на то, что человечество разделено не только на государства, но и иными способами; что каждый человек принадлежит к множеству сообществ и делит лояльность между ними; что эти лояльности конфликтуют друг с другом и меняются; и что члены отдельных сообществ не обязательно географически соседствуют друг с другом. Люди имеют право объединяться и устанавливать правила для членов этих объединений. При необходимости они могут учреждать власть [ЭКЮ], которая следила бы за соблюдением этих правил. В легитимные границы сообщества и учрежденной им власти входят те, кто добровольно готов им подчиняться. Гарантией свободы является режим взаимной терпимости [в том числе, обеспеченный через доктрину сдерживания] между различными сообществами и безусловное право выхода из любого сообщества. Право выхода является «единственным фундаментальным правом индивидуума поскольку все остальные права либо вытекают из него, либо даруются индивидууму сообществом».",
				"added": 1561842526
			},
			{
				"comment_id": 4,
				"body": "> [dalida](#comment_3_1JXt6o6VHCEur5cAv2P3tmywxCz36r5u8q): Алексей Шустов, политолог, автор книги «После государства».\nАй яй ,я то думал всех авторов потёр...",
				"added": 1561842579
			}
		],
		"2_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 5,
				"body": "Проблема то состоит в том что капитализм этот регулируется (государством). В общем то и всё. Посмотрите в википедии:\n>Капитали́зм — экономическая система производства и распределения, основанная на частной собственности, юридическом равенстве и свободе предпринимательства. Главным критерием для принятия экономических решений является стремление к увеличению капитала, к получению прибыли.\n\n>Понятие «капитализм» — это экономическая абстракция, в которой выделены характерные черты экономики на определённом этапе её развития и при этом отброшены менее значимые. Реальная экономика конкретных стран никогда не основывалась только на частной собственности и не предоставляла полной свободы предпринимательства. Всегда в той или иной мере присутствовали несвойственные капитализму черты — сословные привилегии; государственная собственность; ограничения на владение имуществом, в том числе ограничения на размеры недвижимости или земельных участков; таможенные барьеры; антимонопольные правила и т. п. Часть из них являются наследием предыдущих эпох, часть — следствием развития самого капитализма.\n\nВыделю специально для ленивых.\n>Реальная экономика конкретных стран никогда не основывалась только на частной собственности и не предоставляла полной свободы предпринимательства.",
				"added": 1561842828
			}
		]
	},
	"comment_vote": {
		"71_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2": 1,
		"16_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": 1,
		"64_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": 1,
		"168_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"82_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"169_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"84_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"1_1LB5A2qJU57xRuyJtUNWBNMnKTPkSmdF2h": 1,
		"43_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N": 1,
		"4_1PNNLHx1b2tCBWA8B8TkW4r9rCEi7TeTKy": 1
	}
}