{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1619250997,
			"title": "Free healthcare? In my internets?  It's more likely than you think.",
			"body": "Doctors hate this one weird trick.\n\nFaster healing, reduced inflammation, increased antibody production, normalized cortisol levels, better sleep, improved mood, and improved blood flow?    We haven't even studied it all yet.\n\nEarthing aka grounding is free healthcare. \n\nYour body receives a large number of health benefits when put your bare feet on clean soil or damp concrete for 30 mins a day.  \n\nOr you can sleep for 8 hours a night on a silver threaded sheet that is connected to a wire that is grounded to the earth's surface.\n\n(15 min doc)\nhttps://www.youtube.com/watch?v=EcHEWH8Eh0Q\n\nThere have been 40+ studies done - many double-blind and placebo controlled. They show a physiological response. These are very simple measurements that anyone can repeat.  See studies here: http://www.earthinginstitute.net/research\n\nShills, skeptics, and bots will gas light you and say it's a placebo. It's not.\n\nJalepeno plants don't have placebos. These grounded plants produced double the yield of ungrounded plants.\n\nhttps://browntia.files.wordpress.com/2013/10/theories-in-action-poster-william-gasner.pdf\n\nPre-term infants don't have the cognition for a placebo effect either.\n\nhttps://pubmed.ncbi.nlm.nih.gov/28601861/\n\nDoctors have even tried earthing on COVID long haulers in Iraq with some good case reports:\n\nhttps://www.researchgate.net/publication/346734751_Prevention_and_treatment_of_COVID-19_infection_by_earthing\n\nCool book on this topic - Return to Nature - from 1903!  Page 65 of pdf is where this topic is covered.\n \nhttps://soilandhealth.org/wp-content/uploads/02/0201hyglibcat/020162.Just.pdf\n\nGo outside and try it right now.  Then tell everyone and get weird looks.",
			"added": 1619250996
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1618945192_12vij5EwmiAG1R9wqX5VVkuqopsBKrBhTa": [
			{
				"comment_id": 1,
				"body": "> [roaringturtles](#comment_92_1LQt9gDDNMnknHDQ43S4WYaXxocLyFzpVd): While typically thought of as mute, turtles make various sounds when communicating. Various species of both freshwater and sea turtles emit numerous types of calls, often short and low frequency, from the time they are in the egg to when they are adults. These vocalizations may serve to create group cohesion when migrating... [...]\n\ni like turtles",
				"added": 1619217448
			}
		],
		"1619250997_1JMgYVF1m2q5WmTzMt38fheBfogLL3Uwq8": [
			{
				"comment_id": 2,
				"body": "> [slfsrvingpltcn](#comment_101_1B7Rs1nGkNUzS2ccFdn34ANbxS2KVb2mTE): personally, sometimes, I feel like a refreshing emptying... If you felt it you understand what I mean, it's like if something (energetic) went away, like was drained...\n\nYea, it is a relieving/refreshing feeling.    The theory is you pick up electrons, but it may be magnetics or something.\n\nI notice my vision sharpens ever so slightly while I'm grounded.   Especially when looking at a screen all day.  It's like hitting that degauss button.",
				"added": 1619252598
			}
		],
		"1619252102_16dVbybDseQBQnxdJDuQhCzYAij8iR8YEc": [
			{
				"comment_id": 3,
				"body": "Nice summary.\n\nAdd earthing to your protocol.  I just made a topic on it.\n\nTea plants hyper accumulate fluoride and other toxins:\nhttps://www.rdhmag.com/patient-care/patient-education/article/14033922/hidden-fluoride-in-tea-and-other-foods-and-beverages\n\nRe: nose breathing technique.  Improves nitrous oxide intake and oxygen levels by nasal breathing easy and low.\nhttps://articles.mercola.com/sites/articles/archive/2016/07/30/buteyko-breathing.aspx",
				"added": 1619253985
			}
		]
	},
	"comment_vote": {
		"101_1LQt9gDDNMnknHDQ43S4WYaXxocLyFzpVd": 1,
		"101_1B7Rs1nGkNUzS2ccFdn34ANbxS2KVb2mTE": 1
	}
}