{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1565215415_1Azwyo4W2zSSRbHECg7DBQEt19iwyPwcxf": [
			{
				"comment_id": 1,
				"body": "content.json couldn't be downloaded. Awfully curious what you've got!",
				"added": 1565222322
			}
		],
		"1565570944_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 2,
				"body": "> [bvcfbfbcbcvd](#comment_4_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7): Also, I fear that Google will quickly harass/block ZeroNet when it grows beyond a certain point.\n\nImpossible. Google has no power over ZeroNet because it's distributed across thousands of users. The very posts you're reading are stored and seeded across each participant's PC and not a singular network, so the content is pretty much immutable unless you choose to block the user id. ZeroNet is not beholden to the constraints of clearnet. No DNS so CloudFlare cannot censor it. It cannot be indexed nor blacklisted by Google. The only way to kill ZeroNet is to kill the trackers, as far as I know.",
				"added": 1565575726
			}
		],
		"1565819093_1J6JfEeFfwmkogEHaMgs8MohbzpzMyQUqv": [
			{
				"comment_id": 3,
				"body": "Hector Berlioz, a hopeless French Romantic. Perhaps one of the earliest remixers who mixed his previous compositions into his Symphonie Fantastique. It tells the tale of an artist overdosing on opium because of unrequited love, and goes through a strange series of dreams where he kills the woman he loves, goes to the hangman's noose and finds himself attending his own funeral at an infernal sabbath of shades and witches.\n\nBerlioz is a name often overshadowed by his predecessors and more notable romantics like Mozart, Schumann, and Wagner however I personally have an affection for his abilities to recreate the feeling of young, dumb love in a way that wouldn't be seen again until the formation of Air Supply in '76.",
				"added": 1565834725
			}
		],
		"1565922890_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W": [
			{
				"comment_id": 4,
				"body": "Is there any conclusive research to support this claim? Science is absolutely not unquestionable. How can I be certain that gender is a spectrum when presented with research that supports that claim? Who's going out of their way to disprove this claim, and can I be certain that research supporting this claim isn't being funded or biased by people with a pro-LGBT+ agenda? How could I be certain that research *disproving* this claim isn't being funded or biased by people with ab anti-LGBT+ agenda? Are there any impartial experiments and datasets that can empirically prove this? And if I, the layman, were presented with this data how do I contextualize it without a background in that field to draw my own conclusions?\n\nYou seem to think that because \"*science*\" yields a specific result, it cannot be questioned but the very nature of science is questioning everything, deconstructing existing theories and ideas, and putting forth the results of your experiments. Please stop blindly trusting \"*science*\" like it's a religion or something. Faith is for God, not data.",
				"added": 1565979773
			}
		]
	},
	"comment_vote": {}
}