{
	"next_topic_id": 58,
	"topic": [
		{
			"topic_id": 1,
			"title": "用公用手机号对抗实名制",
			"body": "如题\n一种思路\n\n国内网站都特么要实名\n用公用手机号 (比如https://www.bing.com/search?q=receive+sms+online) 骗过他们",
			"added": 1501658690,
			"parent_topic_uri": "19_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 2,
			"title": "在明网，很多人知道你是一条狗",
			"body": "https://zhuanlan.zhihu.com/dashijian",
			"added": 1503928783,
			"parent_topic_uri": "19_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 3,
			"title": "实名 = 裸奔",
			"body": "https://www.zhihu.com/question/60205725/answer/177824557",
			"added": 1504315854,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 4,
			"title": "政治板块黑名单（欢迎分享）",
			"body": "- zerocatty\n傻逼提问\n\n- 0emaneht0\n民科\n\n- nullnone\n傻逼钓鱼\n\n- humanrights777 lawyer newera unitychina\n四个小号刷屏",
			"added": 1505561972,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 5,
			"title": "GFW技术评论",
			"body": "http://127.0.0.1:43110/12ddrrRKkABAWTU48ZL3THfypHtVJ3aVF5/",
			"added": 1506862514,
			"parent_topic_uri": "10_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 6,
			"title": "这是很长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长的标题",
			"body": "test",
			"added": 1508155843,
			"parent_topic_uri": "1_15PkTh9DC2wPmrGrQoYVQ6xJLobdanakd4"
		},
		{
			"topic_id": 8,
			"title": "中国模式：共产党资本主义",
			"body": "《中国人权双周刊》首发，转载请注明出处。（第 185 期 2016 年 6 月 10 日 — 6 月 23 日）\n作者：程晓农\nhttp://www.hrichina.org/chs/zhong-guo-ren-quan-shuang-zhou-kan/cheng-xiao-nong-zhong-guo-mo-shi-gong-chan-dang-zi-ben-zhu-yi\n\n从上世纪 90 年代末开始，中国的改革中就出现了明显的权贵资本主义特色。近 30 年来，海内外一直在谈权贵资本主义，但对它的评价始终围绕着腐败这个话题转悠，却没有进一步深入下去，因此也留下了一些值得思考的问题。首先，说中国有权贵资本主义，大概没有多少人反对，但是，能够据称判断，中国早已是资本主义经济制度吗；如果是，中国又是在哪一年告别社会主义、步入资本主义的，有明显的政策轨迹可寻吗？其次，权贵资本主义如果确实是中国模式的产物，那么它似乎就不单纯是部分权贵的不当个人行为，而是体制型产物，因此反腐败也就无法铲除权贵资本主义的制度基础了？对这两个问题，笔者的回答都是 Yes。之所以这样看，是基于以下的基本判断：中国早在 1997 年底就通过国企私有化，正式把经济制度改变成资本主义经济制度；但是，在政治制度层面，中国的资本主义经济制度并没有产生民主化的社会动力，相反，中国的资本主义经济制度与红色政权「结婚」了，因此产生了人类历史上独一无二的独特政治经济制度结构，既非社会主义，亦非民主资本主义，而是共产党资本主义（communist capitalism）；笔者首次提出的共产党资本主义这个概念（已有英文论文发表），指的是共产党领导下的资本主义经济体制，它用资本主义制度来巩固共产党的专制政权，这就是中国模式的真谛。\n\n## 一、中国模式：社会主义国家转型的最差道路\n\n共产党的传统目标本来是消灭资本主义，毛泽东时代的红色中国便彻底消灭了私有制，资本家的绝大部分财产都被剥夺；与此同时，中共的政治精英以及「红二代」们虽然拥有政治特权，却没有任何祖上留下来的企业或财产。但从邓小平时代开始，中共的红色政权与资本主义经济制度「结婚」了，这不仅仅是指共产党政权容忍资本主义的发展，而是共产党精英自身变成中国最富有、最有权势的资本家。社会主义国家早晚会重新变成资本主义国家，这不是什么新奇观点。1988 年在奥地利首都维也纳召开过一个关于社会主义国家改革的讨论会。在那次会上，一位来自共产党国家匈牙利的经济学家语惊四座：所谓社会主义，无非就是从资本主义到资本主义的过渡时期。按照他的意思来理解，也就是说，社会主义的寿命总是短暂的，不会太长久，这些国家之前从资本主义被改造成社会主义，然后又不得不从社会主义回到资本主义。一年以后，这位匈牙利人的看法就被苏联东欧共产党阵营的解体所证实。\n\n但是，社会主义国家的改革就只有权贵资本主义一条路吗，中国模式的这种结局是必经之途吗？笔者多年研究社会主义国家的转型后发现，从社会主义回到资本主义，不是只有一条路，而是至少有三条路，中国则选择了其中最糟的那条。\n\n共产党国家一旦告别了传统的斯大林社会主义模式，就走上了制度转型的道路。所谓转型，指的是在经济制度方面实行自由化，即经济转型，包括用私有化取代公有制和用市场化取代计划经济，而在政治方面则是实现民主化，即政治转型。从 1989 年到现在，世界上的共产党政权除了北朝鲜之外，其它国家或者完成了转型，或者正在转型途中。纵观这些国家的转型道路，可以发现，经济转型相对容易，而政治转型则比较艰难。在 20 世纪 80 年代，中国曾经一度成为共产党国家经济转型的先行者，现在却因为拒绝民主化而沦为转型国家当中的落后者，这种落后指的是制度层面的落后。\n\n在所有共产党国家，转型一旦开始，红色精英试图窃国自肥，乃是通例，但是，这种局面并非不可避免。迄今为止，原社会主义国家的经济和政治转型大致有三种模式。第一种是中欧模式（波兰、匈牙利、捷克、斯洛伐克）。这些国家的政治转型为异议知识分子所主导，红色精英染指经济转型过程的企图受到遏制；异议知识分子的基本主张不是与原红色精英们分享权力或和解、宽容，而是通过清除共产主义污垢，尽可能铲除共产党文化的残余。而在中欧国家许多民众的眼里，共产党政权不过是一个苏联扶植的傀儡政权，应当被唾弃。结果中欧国家的前红色精英无法在转型中为所欲为，他们面临巨大的社会压力，既不能操纵议会，也无法通过私有化发财；最后，原来的红色精英多半未能从转型当中获得好处，大约三分之一的原红色精英的社会经济地位下降，一半左右提前退休。有美国学者把中欧国家的这一转型称为「建设资本主义但不产生资本家」（making capitalism without capitalists），这个说法比较含蓄，所谓的不产生资本家，其实是指不产生红色资本家，因为在共产党国家里旧的资本家早已被消灭，假如在短短几个月或者一年里就冒出来许多暴富者，那他们多半是原来的红色权贵。简言之，中欧模式其实就是，重建资本主义，但没有红色权贵的份。这样的转型具有自稳定性，与红色历史彻底告别，很难再出现反复。\n\n第二种是俄国模式，其结果是，原来的共产党精英摇身一变成了民主派精英，然后他们分享转型当中的好处，从中发横财；同时，老百姓也在私有化过程当中获得了一部分产权。这是典型的「老权贵带入新社会模式」；与中欧模式相比，俄国的转型属于「同志们的资本主义」(comrade capitalism)，因为新权贵的大多数都是原来的党内同志。这样的资本主义也是权贵资本主义；但与中国不同的是，出身于旧权贵的新权贵们不再是共产党员。俄国模式下，民主制度虽然不至于被完全颠覆，但很容易就被旧权贵们所操纵，使得新制度带有深深的旧痕迹。\n\n第三种则是中国模式，其主要特点是：中共政权虽然把前 30 年毛泽东时代通过革命建立起来的社会主义经济制度，如全面公有制和计划经济抛弃了，但是，它用共产党资本主义巩固了毛泽东留下来的专制体制。红色权贵及其亲属成为最容易致富、又理所当然地通过政治权力来保护自己的特权集团。在权贵私有化过程中产生的种种黑暗行为，例如红色家族的疯狂敛财，导致整个国家高度腐败。这种腐败政治必然产生严重的社会分配不公，当财富与上升机会都被社会上层垄断时，庞大的社会底层必然产生对精英阶层的仇恨，仇官、仇富情绪在全社会蔓延。\n\n## 二、私有化在中国：掩耳盗铃 20 年\n\n在中国的官方宣传里通常把 1992 年的邓小平南巡视为改革的一个新起点。其实，如果从制度转型的角度去看，中国的社会主义经济制度正式走向寿终正寝的准确时间点是 1997 年，因为从这一年开始，中国开始推行国有企业的私有化。社会主义经济制度的支柱之一是企业的国有制，而一旦国有企业的大多数都私有了，社会主义经济制度就彻底解体了，而以企业私有为特征的经济制度其实就是资本主义。但有趣的是，中共对自己实行的私有化政策至今仍然是掩耳盗铃，明明已经做完了，却从不承认它 10 多年前就已完成了私有化。当局用来掩盖私有化的词语是国企「改制」，至于改成什么所有制，则故意避而不谈。其实，要改变国企的公有制，只有两种可能性，或者是全部私有化（一个企业完全变成私有），或者是部分私有化（一个企业的国有产权部分转化为私有，但国有股份仍占主要部分）。中国政府选择私有化方向并刻意模糊转型的实质，自然有其苦衷。\n\n时任总理朱镕基之所以如此决策，主要出自两点考虑。第一，国企成了政府的沉重经济负担，导致银行系统濒临崩溃。由于邓小平时代的经济改革无法解决国企的严重问题，企业长期依赖国有银行的无条件贷款，但经营状况日益恶化，许多国企停止偿还银行贷款，甚至连利息也不再支付。从 90 年代中期开始，整个银行系统的潜在金融危机日益暴露。90 年代初四大国有银行 20％以上的贷款属于坏帐；1994 年全国银行业出现了历史上第一次严重的全面亏损；到了 1996 年银行系统的坏帐加上逾期呆滞贷款已占贷款总额的 70％左右。为了使银行系统免于崩溃，1997 年下半年政府不得不全面推行国企改制（即私有化），把十多万家国有工业企业当中的大多数作为「包袱」甩掉。第二，当时中国急于加入 WTO，以便扩大出口，而 WTO 接纳中国有个前提，那就是以 15 年为期，中国必须建立市场经济，即取消计划经济和实行国企私有化，中国如果不能证明它实行了国企的私有化，就无法获准加入 WTO。\n\n由于政府和国内媒体掩盖真相，所以至今许多从未在国企工作过的人仍然不了解何谓「国企改制」。其实，所谓的「改制」，就是让中小企业私有化，同时让大型国企上市，实行部分私有化。当局让国有企业的厂长经理和地方政府官员充当「改制」和裁员下岗的操作者，同时也就把私有化可能产生的社会不满和愤怒，从政府身上转移到了国企的厂长经理身上，而政府则置身事外。当然，国企的厂长经理们也不会白白当这个「替罪羊」，他们得到了巨大的好处。私有化的关键是谁来购买国有企业。中国与俄罗斯一样，国企厂长经理们的家庭积蓄根本无法满足收购企业所需要的百万、千万、甚至上亿元的资金需要；而外资在国企私有化的过程中发挥的作用微乎其微。在这种情况下，中国的国企厂长经理们能成为各自企业的新老板，其实基本上靠的是非法手段。正因为这重重黑幕，所以中国政府一直不许国内研究者研究私有化过程，国内媒体也基本上不报道国企私有化的真相。具有讽刺意味的是，尽管私有化在中国国内是新闻和研究「禁区」，但对境外研究者却是完全开放的，境外研究人员可以通过一些国际组织如世界银行等，自由进入中国，对私有化过程和私有化之后的企业所有权状况做全国范围的抽样调查。过去十多年里，这些参与调查的研究者发表了多本英文著作，介绍中国私有化的成果；然而，这些书籍却一本也未能在中国翻译出版。当局之所以准许境外研究人员对国企私有化做调查，是为了向世界银行等国际组织提供中国私有化进展状况的资料，为中国加入 WTO 铺路。由于中国国企私有化的结果早已在国际社会公开，所以，当局对私有化的态度也仅仅是在国内掩耳盗铃而已。\n\n## 三、共产党干部是如何变成资本家的 ------ 中国式私有化的奥秘\n\n私有化过程本身就是建设资本主义经济制度的过程，但不同的私有化方法会建设出不同的资本主义。朱镕基于 1997 年底开始推行国企改革，当时这一政策被称为「抓大放小」，所谓「抓大」，就是指资产规模大且与国计民生有关的金融、能源、电力、电信、交通等企业准许重组上市，向国民和外资出售部分股份，但国家仍然控股（即政府继续「抓住」这些企业不放）；所谓「放小」，就是指资产规模较小或亏损严重的国企准许其私有化，以甩掉政府的包袱。中小企业私有化的关键在于：由谁用什么方式来「购买」国企。当时国企厂长经理们的平均月薪只有几百元人民币而已，红色权贵及其亲属也同样没有多少金融资产。中共采取的办法是，一方面，让近百万国企管理者用企业的名义担保，从银行借款，「购买」国有财产，并准许这些管理精英把企业重新注册在本人或家族成员名下，然后以企业所有者的身份，动用企业公款，归还他们私人购买企业的贷款；另一方面，由国企管理者逼迫员工出资购买企业的部分股份，职工为了保住饭碗，只能拿出家庭储蓄来购买本企业的股份，但普通职工拥有股份后，企业管理层并不许职工股东过问企业经营和资产转让，所以等于是逼迫职工出资帮企业管理层获取企业的所有权。同时，当局纵容红色权贵家庭的妻子儿女利用关系网，帮助大国有企业获准上市，以此无偿获得上市公司的股份，然后通过抬高股价大获其利。\n\n中国的私有化始自 1997 年下半年，到 2009 年基本完成。1996 年全国国有工业企业为 11 万家，到了 2008 年底只剩下 9,700 家，其中还包括已经实行部分私有化、但政府仍控股的大型国企。中国的私有化分为两个阶段。第一阶段是中小国企的私有化，从 1997 年下半年到 2001 年，历时 4 年左右。其结果是大部分企业被厂长、经理私有化了。笔者曾分析了 29 个省市 130 个国企的私有化案例，归纳了数种典型手法，发现了国企私有化的黑暗过程。他们的做法通常是，首先有意低估企业资产净值；然后，或直接动用企业公款，或以企业的名义去银行贷款，或向私人借款，买下自己管理的企业，注册在本人或亲属名下；最后，以新企业主的身份，用私有化之后的企业资金偿还自己购买企业所借的款项。也就是说，他们虽然购买了自己管理的企业，个人却往往只付很少的钱，甚至分文不付。第二阶段是大中型国企的部分私有化（partial privatization），大约从 2002 年开始，到 2009 年基本完成，其手段包括把国企改组后上市、管理层持股（MBO）、职工股份化、与外资合资、与私企合资等。由于这些企业资产规模庞大，管理层无法独自侵吞，所以通常是动用公款购买企业股份送给管理层干部，同时也用送股份的办法贿赂那些有权批准企业上市的政府部门官员及其家属，形成利益共谋。这些国企干部和政府官员不花任何成本，便成为大中型上市公司的持股总经理或常务董事之类，跻身于富人行列。\n\n中国的私有化完成之后，究竟哪些人成为企业的所有者？根据两个全国性抽样调查的数据，大约 50% 到 60% 的企业都由企业管理层私人拥有；大约四分之一的企业的买主来自企业外部，属于国内其他行业的投资者，但其中外资所占份额不足 2%；由管理层和职工共同私有化的仅占一成（俄国私有化之后企业职工持有的本企业股份大约占 40% 左右），但管理层不允许职工股东过问企业的资产管理和转移，所以，这类私有化的结果相当于职工出钱，但管理层拥有企业。这种「国企改制」几乎就是企业管理层伙同其上级（地方政府官员）和红二代们对国有资产的公开瓜分和掠夺，当局无论如何没法把这种掠夺解释成正当行为，公开的讨论更会导致公众的愤怒，所以政府不许国内媒体讨论私有化，中国的学者们也基本上不能从事关于私有化过程的研究。\n\n从 1998 年到 2003 年，当红色精英通过私有化大范围侵吞中小型国有企业的资产时，当局特地关闭了负责监管国有资产的国有资产管理局，在这私有化高潮的关键 6 年里制造了国有资产监管「空窗期」，为红色精英们侵吞国企资产提供了方便。尽管 2003 年以后又重新恢复了国有资产管理局，但该局对私有化过程中侵吞国资的行为极少追究。在私有化期间，从 1997 年到 2005 年，全国到处都发生大规模的劳资冲突，根源都是厂长、经理通过私有化侵吞公有资产，而政府基本上都站在厂长、经理一边，因为政府官员从中也可以得到好处。俄国在私有化过程中，社会福利制度仍然正常运转，少数失业工人可以领取社会福利而勉强生存；但中国推行私有化的时候，原来以企业为基本单位的福利体系垮了，许多企业给工人很少一点钱，把他们赶走，就死活不问。当时中国政府广泛宣传，国企工人下岗是为改革作出必要的牺牲，但政府却不愿意为下岗职工建立统一的失业救济，而是把这项支出甩给私有化之后的红色老板，如果企业的新老板不想付，政府也不管。其实，如果国企私有化了，企业付不起社会福利开支，政府对原本为国家职工的下岗人员有无可推卸的责任，但是中国政府当时采取了耍赖的态度。对比之下，俄国政府从未推行过强制下岗之类的政策，相反还用税收优惠鼓励企业保留职工岗位。比起中欧国家和俄国的私有化，中国的私有化是最不公正的，也最冷酷无情。显然，专制政体下的经济转型可以罔顾社会公正而不必担心选举压力，对权贵精英来讲，这样的模式自然是优越的；但普通民众的评价恐怕恰恰相反。西方有学者认为，共产党国家的威权体制有利于经济转型和经济发展，因为政府的强权可以克服来自民间的阻力，中国往往被他们视为一个最好的例子。但是，中国的私有化过程说明，威权政府在经济转型中往往会漠视社会公正，剥夺民众的权利和利益，而作出有利于统治精英的制度安排。\n\n## 四、共产党资本主义：马克思的苦恼\n\n自从马克思创立共产主义学说以来，中国模式是人类历史上首次出现的共产党领导下的资本主义经济体制。中共以消灭资本主义（化私为公）起家，但无法让社会主义经济体制获得长远的成功，最后只能改用资本主义经济体制来延续共产党政权的统治；而在化公为私的改革过程中，红色家族及共产党的各级官员及其家属摇身一变，成为企业家、大房产主、巨额金融资产所有者这样的资本家。他们积聚财富的过程充满了肮脏与犯罪，既需要红色政权保护其财产和生命安全，也需要通过政府垄断的行业继续聚敛更多的财富。因此，他们是中国现行体制的坚定支持者，而不是民主化的促进者。\n\n中共的红色权贵们在短短的 20 到 30 年内如何从一无所有变成巨富家族群，这是共产党资本家们发财的秘诀，也是理解共产党资本主义制度和判断中共利益集团未来政治走向选择的指南。简单来说，这个秘诀和指南就是，不法侵吞国产，垄断重要行业，操控政策获利，维持专制统治。不法侵吞国产，是指中共的经济管理精英们利用国企私有化过程，或者直接侵吞中小国有企业的资产，或者无偿获取上市大国有企业的股份；垄断重要行业是指，保留国有大企业在金融、能源、电力、交通、电信等行业的垄断地位，让红色精英或红二代占据这些大企业的要津，这类规模往往进入世界企业 500 强的超级大企业既提供大量税收以支撑红色政权，也让高管们通过获取股份、项目回扣和高薪、高奖金而迅速成为富翁；操纵政策获利是指，红色精英及其亲属通过参与或影响政策制定，抢先插手到政策给以优惠的行业或项目中，从而轻而易举地摄取巨大的利益；而维持专制统治则是指，红色权贵们极端敌视民主化，希望能够「永保红色江山千秋万代」，也就是希望让共产党的专制永久地保护自己的特权和巨额不法财富。\n\n当这个国家的大批企业和财富掌握在身为共产党员的红色资产阶级手中的时候，对红色资本家来说，唯一可以信赖的制度性保护，既不是市场经济体制，也不是法治，而是「无产阶级专政」，也就是他们对全社会其他成员的永久型专政。他们很清楚，传统社会主义那套经济制度丝毫不值得留恋，现在他们不但拥有比民主国家的企业家更容易获得的财富，也拥有无需竞争的优越政治地位，还可以阻止民主化可能造成的政治、经济清算，这就是中国模式的实质。很明显，在共产党政权之下，这种红色资本主义不会自发地转型成为民主制度下的资本主义。长期以来西方学者中有一种看法以为，经济自由化之后，原来的红色精英会自然地拥抱民主和自由。中国的转型结果证明，这种想法不但幼稚，而且是错误的。但是，红色权贵们也很清楚，「中国模式」时刻面临来自社会底层的威胁，因此，他们一面把个人的巨额资产向西方国家转移，一面把亲属移民到西方国家，以便留下后路。他们的「用脚投票」实际上宣布了「中国模式」的前途十分渺茫。\n\n1989 年初，邀请笔者访德的德国艾伯特基金会安排几位访问学者参观位于特里尔的马克思故居。当时留言簿上有人用中文写下一句话：「老马啊，你可把咱害惨了。」现在看来，这话只说对了一半，因为马克思也被中国模式害惨了。若让马克思现在来评价共产党资本主义，他可能既恼怒又欣慰：恼怒的是，共产党居然要靠「嫁」给自己的敌人资本主义才能存活下去，这对他的理论和主义是最大的讽刺；而欣慰的是，不管采用什么样的反马克思主义手段，总算还有个别机会主义的共产党政权依然活着，证明他也不是一无是处。但是，马克思仍然无法摆脱一个巨大的困惑：他的理论的基本框架奠基于「经济基础决定上层建筑」的假设之上，强调先进的生产力必然改变落后的上层建筑；但是，中国模式却逼着马克思不得不彻底推翻他的核心概念，从而也推翻整个马克思主义。在共产党资本主义制度之下，「无产阶级专政」这一上层建筑，其实是依靠资本主义的经济基础而维系下去的；那么，这个上层建筑究竟属于已经消失了的旧的社会主义经济基础的落后残余，因此将被历史淘汰，还是因其「先进」性，将必然孕育出又一次铲除共产党资本主义的新共产主义革命？或者，为了从中国模式里吸取教训，马克思必须把他的「经济基础决定上层建筑」一说，改成「上层建筑决定经济基础」？这不仅对马克思来说几乎是天问，而且对中共来说，也是一个无法回避的意识形态危机。现在马克思的肖像仍然立在天安门广场上，因为他能为红色资产阶级的特权身份和「无产阶级专政」的延续提供意识形态上的合法性解释。吊诡的是，中国模式本身是反马克思主义的；但中共生存下去的诀窍就在于，举着马克思主义的旗号和招牌，建设和巩固反马克思主义的资本主义经济制度。中国模式既挑战了马克思主义，也挑战了民主化理论。",
			"added": 1510576855,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 10,
			"title": "VOA停播事件本身就是最大价值所在",
			"body": "应该这么说，在经历了巴拿马文件曝光后的风平浪静，习班底对舞台上各方的暗潮涌动是心中有数、波澜不惊的。像巴拿马文件中涉及如此多的敏感信息，都未能在国内搅起哪怕一点小小涟漪，说明一：匪党内所谓「改革派」「开明派」早已烟消云散；二：官僚集团、团派已经基本丧失反制能力；三、太子党、红二代内部也没有挑战者。至于各种国内外民运、异议人士，连这种事件上都不能掀起任何风浪来，更是被窝匪从心底里取消了对弈资格。流感并不可怕，可怕的是你不知道身体是否处于免疫良好状态。出现打喷嚏后又迅速康复，比一直不感冒更能代表身体状态良好。\n\n故此次郭文贵无论如何曝料，即便分量能达到巴拿马文件，也仅产生一点小麻烦而已，连癣疥之疾也算不上。迄止目前最有价值的部分，根本不在郭那一丁点严重注水的信息量，而在于VOA的停播事件。而停播事件最有可能的受益方，是美国政府。因为过去十几年内新闻媒体、政治团体被渗透、腐蚀已是不争的事实。具体渗透多严重、腐蚀到什么程度，哪些还有救、哪些连根都烂掉了？这个要靠自查是很难办到的，因为之所以是渗透，就是像白蚁蛀空木梁，是悄悄地侵蚀，而非像狮子般血淋淋咬下一块肉。任何预先计划的调查都会受到匪谍、潜伏者有组织有计划地伪装干扰，甚至蒙混过关。\n\n只有当诸如停播这种突发事件发生，就像冒失鬼突然往池子里扔了个石块，水花四溅、波纹迭起。各方面须立即作出本能反应，来不及做周密的预案，全凭一贯性在短时间作出动作。夜总会音乐放到一半突然大灯全开，各种咸猪手就暴露无遗了。如果能抓住些暴露的迹象，顺藤摸瓜，宁枉毋纵，搞点麦卡锡主义，美国政府就是这次事件最大的受益者。\n\n> https://medium.com/@FreeBashulia/VOA停播事件本身就是最大价值所在-a57dbb2a3ef7",
			"added": 1510657480,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 11,
			"title": "中国医疗：一分钱饭店里的离奇故事",
			"body": "关于中国医疗的一篇旧文章\n作者：凡人医生\nhttp://blog.sina.com.cn/u/1690414945\n\n瓷器村有一家饭店，每顿饭只收1分钱的饭费。我在这家饭店工作多年，目睹了许多离奇的故事，今天要讲给你听。你一定会感兴趣的。\n\n（一）公益食堂\n\n这家饭店始建于上世纪七十年代末，是生产队的食堂，主要靠生产队拨款维持运转。村民们每顿饭只要交1分钱的饭费就可以随便吃。当然饭菜也很简单，就是萝卜白菜馒头。\n\n生产队领导曾经教导我们：「食堂是公益机构，要体现公益性。食堂职工要履行‘救饥扶饿’的神圣职责。」我们一直把这些教诲铭记在心。有的村民连1分钱的饭费都交不起，我们就让他进来白吃；食堂门口经常有乞讨者，我们就从后厨给他们拿饭吃。反正这些都会由生产队给买单。就这样，我们食堂的口碑一直很好。由于我们工作时都穿着白大褂，甚至有人称我们为「白衣天使」。\n\n到了八十年代，食堂归村委会管理。虽然每顿饭的成本已经涨到了5角，但村委会给食堂足额补贴，所以村民们一直享受着「1分钱吃饱」的优惠价，食堂职工也一直在履行着「救饥扶饿」的神圣职责。\n\n（二）聪明绝顶的村长\n\n九十年代初，村长说，村委会的平房太寒酸了，要盖一座办公大楼。村干部们异口同声地表示支持，负责基建的村长小舅子和负责后勤的村长表弟更是热烈欢呼。村委会的分支机构很多，有犁地部、播种部、浇水部、收割部、打场部、拾荒部、养猪部、喂猪部、杀猪部、卖猪部……等等，按照每人400平方米的办公面积计算，至少要盖80层大楼。可是钱从哪里来呢？\n\n村里开会研究了三天三夜，最后，聪明绝顶的村长想出了一个聪明绝顶的办法：把食堂改名为「瓷器饭店」，也就是「市场化」；村委会只给食堂拨款40%，让食堂自筹60%。所谓「自筹」，就是让食堂向吃饭的村民收钱。这样，就可以减轻村里的财政负担，省出盖大楼的钱。\n\n村委会的会计算了算帐，说道：「现在每顿饭的平均成本是3元，村里补贴1.2元，食堂只要把饭费从1分涨到1.8元就可以了。我散会之后就去安排。」\n\n村长瞪了会计一眼，喝斥道：「你脑子有毛病吗？现在村民们本来就对物价敏感，村委会要是宣布把饭费涨到原来的180倍，村民们还不把村委会砸了？」\n\n会计说：「那咋办？不涨饭费，食堂靠啥自筹资金？」\n\n村长笑了笑，说道：「我自有办法！」\n\n（三）以餐具养食堂\n\n第二天，瓷器村村委会发布了一份名为《以餐具养食堂》的红头文件。文件规定，为解决公立食堂经费不足的问题，现允许食堂向顾客收取「餐具费」。餐具费的收入，将用于弥补饭费收入的不足。\n\n从此以后，村民们到食堂吃饭，除了支付1分钱的饭费以外，还要支付1至5元的「餐具费」。「1分钱吃饱」的时代一去不复返了。村民们纷纷议论：「村委会控制了饭费的上涨，真是亲民爱民！食堂加收了餐具费，真是贪得无厌！」\n\n九十年代，瓷器村的经济形势一片大好，是大好，不是小好。村委会陆续购买了18辆奔驰、18辆广本、18辆帕萨特，村长包养了两个小媳妇，还把儿子送到河对岸的阿麦瑞克村上学。其他村子受了灾，村委会慷慨捐款。村干部的工资，也一次又一次地上涨。\n\n当然，村民们不知道，村委会对食堂的拨款比例却是逐年减少的。到了1998年，拨款比例下降到了10%。这10%的拨款，还经常无法按时到位，有时还会被村委会赖帐不给。这时的「瓷器饭店」，虽然对外还宣称是「公立食堂」，但实际上已经跟自负盈亏的私营饭店相差无几了。\n\n这期间，村委会也觉得1分钱的饭费实在是低得可笑，于是也给上调了几次。1998年，饭费调到了2元。但是，这时的饭菜档次也提高了很多，物价也涨了很多，每顿饭的成本已经涨到了5元至20元，饭费加上餐具费收入仍然不足以收回成本。食堂没办法，只好采购了一些中高档餐具，以便提高「餐具费」收入，用于弥补饭菜的亏损。此外，食堂还引进了南非鲍、澳洲龙虾、神户牛肉等高档菜，这些菜可以在2元饭费之外单独定价，卖到上百元，既可以满足高端顾客的需求，也可以增加一些收入。\n\n（四）四个难题\n\n2000年，村委会的会计奉命对食堂进行调查，发现了几个问题，汇报给了村长。\n\n第一个问题：随着物价的上涨和食谱的更新，每顿饭的成本已经涨到了10至30元。但是，按村委会的定价，饭费仍然只能收2元钱。即使加上餐具费和少量高档菜的收入，食堂仍然是亏损的。照这样下去，食堂就会倒闭。如果食堂倒闭了，村民们没处吃饭，就会来找村委会算帐。如何避免食堂倒闭？\n\n第二个问题：随着村民的餐饮需求的增长，食堂的工作量比以前增加了好几倍。但是，食堂的职工编制没有增加。因此，食堂现有职工不得不长期、常态超负荷工作。他们每天凌晨3点就要上班，晚上23点才能下班。遇到吃夜宵吃到后半夜的顾客，他们只能强打精神，加班奉陪。增加了的这部分工作量，不是靠增加人员来完成的，而是靠现有职工无偿加班、放弃节假日、牺牲个人.权益来完成的。食堂职工对此有意见，如何平息？\n\n第三个问题：在这二十多年中，餐饮行业发生了巨大的变化。现代餐饮已经变成了一门高技术含量的行业。一个人要想当厨师、服务员，先要以高分考入大学，读5年本科，其中大部分人又读了3年硕士，厨师长、厨师、领班等职位甚至只录用博士。新职工在正式工作前，要经过漫长、艰苦、低薪的见习期和轮转期，从摘菜、刷碗、拖地、端盘子做起。正式步入工作岗位后，终生都要进修、学习、钻研，紧追餐饮行业前沿，才能胜任工作、保住饭碗。顾客对饭菜的口味、色泽、形态、火候、营养、卫生、充饥能力、刀工精度、数量精度等方面以及配套服务的要求非常高，食堂职工必须遵循复杂而严格的技术标准，精工细作，精心服务；一旦出现疏漏，就可能被告上法庭、定罪判刑。因此，食堂职工的工作难度、工作量、心理压力和从业风险都比较大。食堂职工的付出显著超过了其他大部分职业，但是，食堂职工的工资标准却并不高。食堂职工对此有意见，如何平息？\n\n第四个问题：村民们缴纳了沉重的税赋，却不能享受「1分钱吃饱」的福利待遇，每顿饭除了要花2元饭费以外，还要花几元、几十元的餐具费。如果想吃鲍鱼、龙虾，还要花成百上千元。因此村民们纷纷抱怨「吃饭贵」。食堂的职工、灶位、桌位、餐具等资源都比较紧张。在高峰时段，前来吃饭的村民甚至会找不到桌位，上菜速度也会变慢。因此村民们纷纷抱怨「吃饭难」。如果村民们发现「吃饭贵」和「吃饭难」是由村委会缩减食堂拨款引起的，就会责怪村委会。如何避免村民们发现？\n\n村长听完这四个问题，一言不发，只顾眯着眼睛抽烟。会计不敢多嘴，也只是一言不发地看着村长。等到一袋烟抽完了，村长才转过头来，问会计：「你说，食堂的职工是人还是神？」会计弄不清村长葫芦里卖的什么药，只好老老实实地回答道：「当……当然是人，不是神。怎么啦？」村长点了点头，说道：「这就好！只要他们是人，不是神，就好办了。」\n\n村长显然已经有了一个好办法！\n\n（五）一箭四雕\n\n第二天下午，被村长派去食堂查账的会计兴冲冲地跑回来，向村长报告：「查到了！我查到了！」\n\n村长说：「别着急，坐下慢慢说。」\n\n会计坐下，喘了一口气，继续说道：「我仔细审查了食堂的餐具帐目，终于发现，他们在采购鲍鱼的时候收取了供应商的1000元回扣。其中500元用于购买消毒柜，100元用于维修灶具，100元用于更换灯泡、水龙头；给几名干部和厨师长每人发了30元的奖金；最后给厨师和服务员补发了上月拖欠的工资，每人5至10元不等。」\n\n听完汇报，村长狡黠地笑了：「好啊！我就知道，他们是人，不是神！」\n\n会计不明白，就问村长：「您这是什么意思？」\n\n村长说：「他们不是神仙，所以他们不可能凭空变出米面肉菜、水电煤气、桌椅碗筷。如果没有拨款，他们就只能靠歪门邪道来维持食堂运转。他们不是神仙，所以他们忍不住疾苦清贫、高付出、低回报，他们会自己设法用歪门邪道来弥补收入。」\n\n会计讪讪地问：「那，咱们村里是不是要严查一下，刹刹他们的歪门邪道？」\n\n村长斩钉截铁地说道：「不！我就是要让他们搞歪门邪道！」\n\n会计纳闷了，问村长：「为什么？」\n\n村长叹了一口气，说道：「亏你跟了我这么多年，怎么还是不开窍啊？你昨天说的四个问题，第一是食堂入不敷出，第二是职工又苦又累，第三是职工收入微薄，第四是村民吃饭贵、吃饭难。你说，这四个问题的原因是什么？」\n\n会计不假思索地答道：「这个我知道！食堂入不敷出是因为村里给食堂的拨款少，又不允许食堂涨价；食堂职工又苦又累是因为村里给食堂的编制太少，食堂又没钱雇临时工；食堂职工收入微薄是因为村里给食堂定的工资标准太低；村民吃饭贵，是因为村里给食堂拨款少，食堂只能向村民收钱，村民跟以前的‘1分钱吃饱’比较，觉得现在吃饭贵；村民吃饭难，是因为村里给食堂的拨款和编制少，食堂建设和人员不足。」\n\n村长说：「不错，你这个会计还算没白当。那你说，这四个问题，归根结底是谁的责任？」\n\n会计张口刚想说，又给咽回去了。\n\n村长厉声问道：「你说，是谁的责任？」\n\n会计诚惶诚恐地看着村长，结结巴巴地答道：「是、是、是村委会的责任……」\n\n村长冷笑了两声，干笑了两声，又大笑了两声，最后和颜悦色地对会计说：「你答对了。但是，我要让全村人都相信，这是食堂职工的责任！」\n\n会计纳闷地问：「怎么让他们相信呢？」\n\n村长说：「就是要让食堂搞歪门邪道！村委会表面上要打击回扣，但实际上要纵容甚至鼓励食堂从供应商手里拿回扣！」\n\n村长接着讲道：「回扣可是个好东西。第一，回扣给食堂提供了资金来源，弥补了饭费价格过低和拨款不足造成的亏损，维持了食堂运转，掩盖了村里拨款不足的事实。第二，回扣可以用来给职工发工资奖金，安抚职工队伍，让他们忘记辛苦劳累，甘心做牛做马，卖命加班劳动。第三，按照村民们的一般观念，「回扣」肯定是非正义的。村民们一听说食堂收了回扣，肯定会非常痛恨食堂，于是就把眼光全都盯在食堂职工身上，向他们发泄怨恨，就不会找咱们村委会的麻烦了；同时，村委会隔三差五地假装打击一下回扣，还会赢得村民的拥护和爱戴。这样，你昨天所说的四个问题就全都解决了，村委会还不用花一分钱！」\n\n会计的嘴巴张得老大，半天才回过神来，赞叹道：「村长，您真是太高明了！这是一箭四雕啊！」\n\n（六）发动村民斗食堂\n\n晴空万里，阳光明媚。瓷器村办公大楼的第44层，4444房间，正在召开「瓷器村宣传工作动员大会」。会议由村长亲自主持，广播站站长、板报组组长、标语队队长、治保会主任等人参加了会议。\n\n村长指示，在今后针对食堂的宣传报道中，要掌握几个「混淆」。\n\n第一，要混淆「被动避害」和「主动趋利」。食堂如果没有供应商回扣、高档餐具的餐具费、高档饭菜的饭费等收入，只靠拨款和2元饭费，根本不可能维持运转。食堂的厨师、服务员如果不向顾客推荐高档餐具和高档饭菜，就拿不到工资，久之则被辞退。食堂不可能坐等倒闭，职工不可能坐等辞退，因此他们主要是在执行政策、被动避害、维持生计。但必须通过宣传教育，让村民们认为他们是在主动趋利、利用专业技术进行敛财致富，以激发村民们对他们的仇恨。\n\n第二，要混淆「合理收入」和「暴利收入」。从行业的技术含量、难度、风险、工作量、付出代价等方面来衡量，食堂职工的合理收入水平应在1000元左右，但现在大多数职工即使加上回扣工资也只能拿到600元。必须通过宣传教育，抹杀这个行业的特殊性，用低学历、低技术、低难度、低风险、低劳动强度的职业的低微收入水平与之做比较，充分利用村民们「患不均」的心理，让村民们认为食堂职工拿600元就是暴利，以激发村民们对食堂职工的仇恨。\n\n第三，要混淆「府败领导」和「普通职工」。在食堂里，确实有些领导，依靠回扣拿到了每月数千元的暴利收入，但这部分人的比例在1%以下。实际上，99%的普通职工拿着偏低的工资，却在加班加点、受苦受累、牺牲奉献。必须通过宣传教育，让村民们认为，所有食堂职工都依靠回扣拿到了暴利收入，都富得流油，都有八套房、十辆车、一百个小老婆，以激发村民们对他们的仇恨。\n\n第四，要混淆「正当的高价账单」和「不正当的高价账单」。有些高档饭菜本来就应该是高价，但在宣传报道时，必须淡化饭菜本身的档次和价值，而要强调账单上的高额数字，让村民们认为食堂在宰人，以激发村民们对食堂的仇恨。\n\n村长最后总结道：「食堂职工都是普通人，必然会带有普通人的各种缺点。你们要细心挖掘，将小事扩大化，将个案普遍化，将鸡毛蒜皮上纲上线，让村民们认为食堂职工都是十恶不赦的大贪屋犯、大杀人犯、大渎职犯。顾客与食堂发生纠纷时，你们要大篇幅报道顾客的声音，尤其要用浓墨重彩渲染顾客多么悲惨、痛苦、无助，同时，要少报道或者不报道食堂的声音，不给食堂任何辩解的机会。要抢在事实查清之前，先行认定食堂职工一定有罪，先行认定顾客一定有冤。要通过「一言堂」式的报道，把食堂彻底批倒、斗臭。等到食堂的负面形象树立起来之后，他们的正当做法也会被怀疑为营私牟利，他们的好心好意也会被怀疑为驴肝肺，村民们将再也听不进他们的澄清辩解，他们一张嘴就会被村民们视为狡辩，他们中的大多数人加班加点、吃苦受累、牺牲奉献更是会被完全忽略。村民们会认为，「吃饭贵」「吃饭难」是食堂职工造成的！」\n\n从此以后，揭批食堂和食堂职工的新闻报道就没有停歇过，每隔一两年还会掀起一次高潮。\n\n（七）两千元的馒头\n\n2008年的某一天，村民张三到食堂吃馒头，咬了一口，就抱怨道：「一点味都没有！来个水煮鱼！」服务员端上水煮鱼，张三吃了一口，又说道：「太辣了，没法吃！拿菜谱来！」服务员拿来菜谱，张三点了一只1200元的龙虾和一瓶1000元的茅台。酒足饭饱之后，张三叫服务员结帐。服务员拿来账单，一共是2235元。张三跳了起来：「什么？这么贵？你们想钱想疯了？」\n\n第二天，瓷器村村头的黑板报上登出了一条新闻，标题用醒目的特大号黑体字写道：「吃个馒头竟花2200元」。正文里说：「村民张某，来到食堂，仅仅是想吃个馒头。最后结帐的时候，他却要面对2200多元的天价账单！当张某质询食堂收费的时候，食堂经理竟然理直气壮地说，收费合理，计费无误！」看了这条新闻之后，村民们都气愤无比，异口同声地指责食堂黑心宰人。\n\n（八）吃饭饿死\n\n2009年的一天，村民李四在食堂里吃饭，吃着吃着，忽然想起了前几天跟邻居因宅基地打架的事。他越想越气，竟然气得心脏病发作，倒地身亡。李四的老婆孩子、三姑六舅、街坊邻居听说李四死在了食堂，赶忙扛着锄头锹镐，跑到食堂，让食堂赔钱。他们说：「在你们食堂吃饭时死了，所以就是被你们给活活饿死的！是你们没有尽到救饥扶饿的义务！」\n\n瓷器村板报组在第一时间赶到现场，采访了李四的家属，连夜赶写了一篇催人泪下的板报文章。文章说：「李某，一个身板硬朗的汉子，谈笑风生地走着进了食堂，一个小时后，却身躯冰冷地蒙着白被单，被抬了出来。他只是想来吃一碗白米饭，他的老婆孩子还在家里等着他。他的儿子明天就要满6周岁了，李某早就答应儿子，要在家里陪他过6周岁生日，要送给他一本漫画书作礼物。然而，谁能想到，仅仅一顿饭的功夫，父亲与儿子，阴阳两隔。刚买来的漫画书还在李某的衣兜里，还带着他的体温，但他再也不能亲手送给儿子了。他还有个12岁的女儿，正在上小学。李某是家里唯一的劳动力，他死后，谁来负担女儿的学费？恐怕女儿只能辍学，去城里打工，用她那双稚嫩的小手去赚钱养家……」最后，文章义正词严地说道：「食堂，本来是救饥扶饿的神圣殿堂，现在却变成了要命的鬼门关，把顾客活活饿死。厨师的道德何在？服务员的良心何在？呜呼哀哉！呀买代！」\n\n板报发表几个小时后，黑板周围的墙面上就写满了村民们义愤填膺的跟帖。村民们说：「把厨师捆起来，也让他活活饿死！」「把服务员千刀万剐，以告慰冤死的顾客！」「所谓食堂，就是榨干你的钱再把你活活饿死的地方！」\n\n（九）天价芦笋\n\n2010年初，村广播站的记者小刘为了搜集新闻素材，开始调查食堂饭菜的原料价格。终于，在一个偏僻的深山林区，他发现农民出售鲜芦笋的价格只要0.1元一斤，而一盘烧芦笋在瓷器村食堂里却要卖到10元。他敏感地意识到，这可能是个绝好的新闻素材！经过调查，他发现，农民以0.1元的价格把芦笋出售给本村蔬菜商，蔬菜商以0.2元的价格出售给乡蔬菜站，蔬菜站以0.4元的价格出售给蔬菜商贸公司，蔬菜商贸公司以0.8元的价格发往各地的蔬菜商贸公司；食堂本地的商贸公司以0.8元的价格购进后，以1.6元的价格出售给蔬菜批发站，蔬菜批发站以3.2元的价格出售给食堂；食堂制作烧芦笋这道菜时，还用到了肉和蘑菇，除去肉和蘑菇之后，芦笋折合6.4元。\n\n看着这些数据，小刘有些失望，因为每个环节的毛利率都是50%，食堂环节并不比其他环节的利润更大。而且，食堂还提供了高技术含量的烹饪和配套服务，烧芦笋的利润还要用于补贴廉价饭菜的亏损。小刘又了解到，一个蔬菜推销员，收入相当于一个博士学历的厨师的几倍、十几倍，这也从侧面说明了，食堂应该不是获利最多的环节。最后他还发现，食堂大多数饭菜的加价率没有芦笋这么高，芦笋只是少数特例。小刘不禁发起愁来，这稿子该怎么写呢？广播站站长听了小刘的汇报之后，哈哈大笑：「这很容易写嘛！来，我教你。」\n\n几天以后，题为《天价芦笋，百倍利润》的文章在村广播站播出了：「一斤芦笋的出厂价只要1角钱，但食堂卖给村民的价格却是100角！芦笋的价格暴涨了100倍！这天价的芦笋，简直比黄金还要暴利，比贩毒还要暴利啊！看到如此确凿的铁证，我们终于知道‘吃饭贵’的原因是什么了！食堂本是公益机构，应以‘救饥扶饿’为天职，但如今却成了厨师、服务员、洗菜工们敛财致富的暴利机构，吃饭焉能不贵！」\n\n这正义的声音，从村广播站的大喇叭里播出来，传到瓷器村的家家户户。村民们听到这「百倍利润」的芦笋，气得肺都要炸了，恨不能立刻把食堂砸了，把厨师、服务员、洗菜工们碎尸万段。\n\n（十）女工喝水330公斤\n\n2011年，为了让村民们「明白消费」，村委会规定，食堂必须给顾客打印「收费明细」，要细到每种原料、每项服务。比如说，洗菜所用的水，不能直接摊到菜价中，而必须单独列在「水费」一栏中。菠菜、油菜等绿叶蔬菜，按村委会规定，需要多次浸泡清洗，以便除去农药、化肥，因此用的水比较多，平均每盘菜要用5升水。\n\n村里有个女工，在食堂吃了一个月的饭，每天都要点两盘炒菠菜，因此每天都会用10升左右的洗菜水。再加上炒菜做饭过程中用到的水，每天的「收费明细」上总共会列出11升水。一个月下来，就是330升。\n\n村板报组的组长听说了这件事，赶忙责令板报员小张写一篇文章，报道一下。\n\n小张犯了难，对组长说：「每天用11升水，其中10升是洗菜的，很正常的嘛，有什么可报道的？」\n\n组长启发道：「洗菜用10升水很正常，但如果喝10升水呢？还正常吗？每天总共11升水，听起来不多，但一个月的加起来就是330升，就是330公斤！听起来多不多？一个女工的肚子里能装下330公斤水吗？」\n\n小张听完之后，豁然开朗，赶忙跑回去奋笔疾书。不多时，一篇义正词严、文采飞扬的文章诞生了。村头板报刊载了这篇文章，标题叫做《女工在食堂「被喝水」330公斤》。文章写道：某女工，仅仅是想吃一盘炒菠菜，但在最后结帐但时候，却看到收费明细清单上赫然写着「自来水330公斤」！一个女工的肚子里能装下330公斤自来水吗？食堂的乱收费已经到了不顾常识、不知廉耻的地步！\n\n正巧，村里的「老大妈合唱团」正在村头排练红歌。团长张大妈看到板报标题后，都没看正文，就把嘴一撇，评论道：「不用问，肯定是食堂乱收费！」旁边的李大妈、刘大妈、赵大妈、王大妈纷纷附和：「对！肯定是乱收费！」\n\n孙大爷、钱大爷遛早，路过板报墙，看了板报之后，用拐棍指着食堂方向，气呼呼地说道：「食堂太不象话了！人怎么能喝下330公斤自来水？拿我们当傻子呢？我们的眼光可是雪亮的！」\n\n（十一）结局\n\n村委会的大楼依然矗立着，村干部的生活依然滋润着。村民们依然自费掏钱吃饭，怨气冲天。食堂职工依然加班加点、累死累活、忍气挨骂。厨艺比较好的厨师，大都辞职改行，或者去别的村子当厨师了。年轻人看到食堂里的工作状况和厨师的社会地位，也都不愿意学厨师专业。食堂里剩下的职工，因为待遇差、身体疲劳、心情憋闷，工作积极性也不高。因此，食堂的服务水平越来越差，饭菜越来越难吃。由于工作太繁忙、太劳累，后厨和前堂都经常出错，比如把盐当成白糖、把醋当成酱油、把菜上错桌、给顾客算错账。村民们当然因此更加痛恨食堂的厨师和服务员们。\n\n村长的儿子在阿麦瑞克村读书毕业了，把户口留在了阿麦瑞克村。村长和媳妇带着金银细软，投奔儿子去了。跟村长有关系的人，诸如村长的小舅子、表弟、外甥，村长老婆的「相好的」，以及村长老婆的「相好的」的「相好的」，都在村里的历次「民心工程」中发了大财，盖起了别墅，开上了豪车。\n\n村民们依然觉得「吃饭难」「吃饭贵」。每次觉得心里堵得慌的时候，就跑到村头的板报墙前面，虔诚地拜读每天晚上准时更新的板报。读完板报，顿时觉得瓷器村是世界上最幸福的村子，自己是世界上最幸福的村民。当然，村民们依然不能忘记那个可恨的食堂。在茶余饭后，村民们经常会骂上几句：「他娘的！砸烂这个黑心食堂！打死这群黑心厨师！」",
			"added": 1512046364,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 12,
			"title": "澳大利亚挺郭后援会：郭文贵爆料100问答",
			"body": "郭文贵爆料总概括，不想看郭视频的可以看这个\nhttps://hqsbonline.wordpress.com/2017/11/27/郭文贵爆料100问答澳大利亚挺郭后援会主编\n\n郭文贵爆料是2017年最重大的政治事件，成为震撼世界的特大新闻。郭文贵先生以大量事实、证据揭露向世人揭露了中共高层令人怵目惊心的贪污腐败罪行，特别是王岐山家族及海航的巨额资产。他的爆料已经并正在影响着中国社会政治发展的进程，对中国的社会转型的影响不可估量。郭文贵的名字已经载入史册。澳大利亚挺郭后援会特此将郭文贵有关资料编辑成100问答，以推动中国的民主宪政、依法治国的进程。\n\n澳大利亚挺郭后援会主编\n\n本文为待定稿，请审阅提出最后需修改不当之处\n\n2017-11-26\n\n1.郭文贵是谁？\n\n答：郭文貴、山东省聊城市莘県人，70年生，今年47岁，企业家、艺术品藏家、社会活动家，目前身在美国纽约。2017年开年后，郭文贵相继接受明镜、美国之音的采访，4月开始在视频网站Youtube开设直播视频，推特粉丝按照每天1万的速度突破40多万，内容多涉及中国在任高阶官员，包括时任中共中央政治局常委、中央纪委书记王岐山及其妻姚明珊、外甥姚庆、养女孙瑶的家族式贪污行为。政法委书记孟建柱及其手下孙立军、傅政华等的腐败及以黑治国犯罪行为。\n\n2.什么是郭文贵现象？\n\n答：「郭文贵现象」是由郭文贵爆料引发的一系列现象。比如，现在海内外朋友见面，稍微知道一点郭文贵的，必谈郭文贵爆料。国内千万网友，不畏艰难，纷纷翻墙到推特，油管关注爆料进展，一到爆料直播，热闹非凡。郭文贵爆料带动海外民运再次兴起。另外，在油管的自媒体蓬勃发展，就郭文贵爆料各抒己见。互联网的力量空前勃兴。\n\n3.郭文贵为什么爆料？\n\n答：2015年1月10日，郭文贵在中国国内的家人、亲属、下属企业高管被中国公安以骗取贷款罪、骗购外汇罪、撕毁票据罪等一系列罪名逮捕。据郭文贵陈述，此一系列罪名均为中共高层对郭文贵发起的诬陷和迫害行动。在郭文贵接下来与中共高层代表的历时两年沟通、谈判无果之后，郭文贵决定以爆料的形式，揭开他所掌握的中共官员贪腐、滥权等一系列违法违纪行为的黑幕，在促使自己家人、亲属、企业员工重获自由的基础上，促进中国的政治体制改革，以此推进中国的依法治国乃至民主、人权的进步。\n\n4.郭文贵的爆料宗旨是什么？\n\n答：①使郭文贵在国内的家人、员工重获自由，在国内的资产解封，结束中共高层「盗国贼」集团在中国的统治，追回他们的非法所得，并使他们得到应有的审判。\n②在此基础上通过本次爆料，推动促进中国的民主法治进程，避免今后再发生盗国贼集团统治中国的情形。\n\n5.什么是郭七条？\n\n答：郭七条包括四反（反对以黑反黑、反对以贪反贪、反对以黑治国、反对以警治国）和三不反（不反中国、不反中华民族、不反习主席）这七条原则。\n\n6.郭文贵的料是怎么来的？\n\n答：有四个途径：a、据郭文贵本人透露，他创业期间，和军方及国安均有合作，他早期的料主要来自这种合作，或从合作的对方获得。b、参与国安工作时的领导（如马建）为了自己的安全所给予的。c、郭文贵爆料开始之后，国内支持者透过各种渠道，将自身掌握的相关信息资料提供给郭本人，支持者包括网友、体制内人士及部分中共高官「老领导」。\n\n7.郭文贵的爆料是真的吗？\n\n答：据郭文贵本人在接受媒体采访及社交平台直播中表示，爆料证据均由其律师团队经过了法律认证和调查机构的鉴定，属于事实（个别打字，金额计算等人为疏忽的失误不计）。郭文贵欢迎被爆料的人到美国与他在媒体上或法庭上对质。\n\n8.怎么证明郭文贵爆的料是真的？\n\n答：被郭文贵爆料的人物并未澄清和反驳爆料事实，也没有拿出来一条证明自己清白的有效证据，反而在郭爆料之后，「盗国集团」操纵国家机器，在国内加剧对他家人、支持者的迫害打压，在海外则造谣抹黑甚至策划暗杀郭文贵的行动，通过各种手段劝诱美国政府遣返郭文贵。这反证了郭文贵爆料的真实性。\n\n9.郭文贵的钱是怎么赚来的？\n\n答：1992年开始经营河南大老板家具工場，隔年与夏平女士成立香港愛蓮有限公司。1993年起在中国国内创立的地产产业（裕达、盘古、政泉等系列企业），而後分別於96年成立郑州伟仁貿易有限公司、98年與朱時茂先生共同成立北京文茂投资顾问有限公司。2001年朱時茂先生撤股退出。不久後、公司更名為北京摩根投资有限公司，再後來就是如今的」北京盤古氏投資有限公司」。另外，投資不动产开发及投资国外基金，逐渐积累財富至今!\n\n10.郭文贵有什么成就？\n\n答：①、通过爆料，让中国广大草根老百姓看到了政治铁幕后的惊人真相，认清了盗国集团的丑陋面目。②、让数千年为奴的底层百姓认识到了做人的尊严要自己去争取。③、1997年在河南郑州建成裕达国贸（五星级酒店）。④，2008年在北京建成盘古大观（包括盘古七星酒店、公寓等）。⑤、2016年10月31日被发布的胡润百富榜显示，郭文贵以资产180亿元人民币位列中国首富第132位。据维基百科记载，郭文贵的净资产为1000亿人民币。\n\n11.郭文贵的家人是什么情况？\n\n答：①家中兄弟八人，郭文贵排行第七；②妻子岳庆芝，女儿郭美，今年5月开始至今在纽约；③儿子郭强现在纽约；④郭文贵大哥、二哥、四哥、五哥、六哥现在国内，身体、处境较差；⑤其中郭文贵五哥郭文印于2017年10月31日被河南开封市中级法院以故意销毁会计凭证、会计账簿、财务会计报告罪判刑三年；⑥郭文贵姪女郭丽杰以类似罪名判有期徒刑二年；⑦郭文贵三哥已离世；⑧郭文贵八弟1989年死于警察的暴力执法；⑨郭文贵父母在国内，身体较差，由郭的三嫂照顾。以上信息来自郭文贵本人叙述，其家人现状是中共盗国贼集团迫害的结果。\n\n12.郭文贵的身份和签证是什么？\n\n答：①　郭文贵4月19日VOA采访中透露其20年来没有使用中国身份，在中东三个国家与欧洲共有11本护照，已经不是中国公民，身份证被国家安全部注销；②　未对外表明采用哪个身份进入美国；③　2017年9月，郭文贵正式向美国申请政治庇护。\n\n13.郭文贵与国安是什么关系？\n\n答：据郭文贵本人表示，他和他的企业与国安部有商业挂靠关系。商业挂靠关系是指中共的安全部，对一些有影响的商人，可以利用的商人，建立名为商业挂靠关系，利用商人的钱财和海外资源去达到安全部的目的，同时商人也会得到一些国内政策的倾斜和支持来补偿。中共官方的说法为「以商养情，商情两旺」。\n\n14.郭文贵的官司是怎么一回事？\n\n答：①　据郭文贵叙述，与其相关的国内的企业官司，为郭文贵指控的「盗国集团」成员策划、诬陷、迫害其的一系列行动的一部分。包括6月16日大连市西岗区法院、10月31日开封市中级法院的官司；②　海外的官司，主要由「盗国集团」组织企业和个人，以各种相关名义（包括债务拖欠、诽谤、强奸等罪名），到纽约起诉郭文贵。目的是消耗郭文贵的资产与精力，抹黑郭文贵的人物形象。包括并不限于：数家中国企业联名起诉、潘石屹的诉讼、黄艳的诉讼、范冰冰、许晴的诉讼、海航的诉讼、博讯的诉讼、香港合作企业的诉讼（已败诉）等。\n\n15.为什么郭文贵要求推友博友微友给他三年时间？\n\n答：郭文贵爆料信息量巨大，涉及人物众多，正常的调查取证，以及和「盗国集团」的斗争是一项旷日持久的工作，实现「郭七条」促进中国平稳转型为民主法治国家，需要长期复杂艰巨的工作，不是一蹴而就。郭文贵爆料的传播和广为人知，也需要时间。\n\n16.为什么郭文贵反对动不动就募捐？\n\n答：郭文贵发现海外有些人常年以各种名义骗捐骗吃骗喝骗色，他认为必须揭露这种丑恶现象。\n\n17.郭文贵为什么要打击假民运？\n\n答：郭文贵认为必须清除海外的民主民运的环境，让有志之士能到海外来有一个好的土壤，让真正的需求民主自由法治的人能在海外慢慢地开起花来，然后长成参天大树长成树林，形成一个正义的力量。真民运不会脆弱，不是口炮党，不是骗捐党，不是专门欺压女性，欺压同胞的这些所谓的假民主分子。我们一定要恢复民主民运的本来的、伟大的、光荣的、神圣的面目！\n\n18.郭文贵如何评价民主运动？\n\n答：民运是个伟大的名字，给我们带来安全、法治、民主和自由、追求民族灵魂的组织，绝不能再让一些人骗色、骗财、骗信任后玷污了民运的这个旗帜和我们精神与灵魂的殿堂。\n\n19：郭文贵如何评价六四运动？\n\n答：郭文贵：所有参与六四，不光是流了鲜血的英雄和家属们，还有很多人今天没有站出来说话的那些幕后的英雄，那是文贵心目中永远的英雄。谁去污辱他们，谁去污辱他们，上天会给他惩罚的！上天会灭他的！任何人去尝试否定六四，任何组织想否定六四，任何人在六四这个问题上做文章，那都是不能得好死的。那是得报应的，要受到历史的唾弃！那是永远不可逾越的上天设定的最高的一个惩罚的线。六四所有的精神，六四所有的死去的英雄，六四所有的家人们，没有一个人愿意看到海外有些人天天打着六四民运的名义骗奸，诈捐，淫捐，以它骗色骗钱骗名，动不动把那些人的伤口拿出来揭开，让大家看。藉此让别人家给钱，骗得同情之心。任何人在六四上骗捐，诈捐，骗名，骗利，那都是上天不容忍的，任何人都不容忍的。\n\n20.如何评价郭文贵与海外民运的关系？\n\n答：郭文贵爆料改变了海外民运低迷不振的局面，千百倍激活了海外民运新的活力，海外各国挺郭后援会纷纷成立与各路民主人士携手努力共同作战，一支崭新的、愿意无私付出的、具有巨大道义感召力集体行动力的民主运动生力军正在快速集结壮大。在郭文贵爆料之前，海外民运长年一盘散沙不能团结协作，这是众所周知的基本事实，那种指责郭文贵分裂民运到海外维稳的说辞完全是颠倒黑白的。少数「老民运」不但看不到郭文贵爆料带来振兴海外民运契机，反恶毒攻击和辱骂郭文贵及家人，更是丧尽天良。\n\n21王歧山是谁？\n\n答：1989－1997年历任中国人民建设银行行长\n、中国人民银行副行长。1997－2007年历任广东省副省长，海南省委书记、北京市市长。2007－2008年中央政治局委员2008－2011年国务院副总理，2012.11－2017中央政治局常委，中央纪律检查委员会书记.\n\n22.海航集团是怎么回事？\n\n答：海航集团有限公司于1993年组建，产业覆盖航空、实业、金融、旅游、物流和其他相关产业。海航创办人兼董事长陈峰与王岐山早有渊源。1988年王岐山创办中国农业信託投资公司并任总经理，同年陈峰离开民航总局，任该公司世行贷款项目办公室主任。2002年王岐山出任海南省委书记，再成为陈峰上司。海航集团发展如有神助，起步初期已将买入的航机向银行重复质押，旗下A股上市公司多次互相担保，屡屡犯规，但均获金融监管机构放行，海航更获王岐山曾主政的海南省政府大力关照。海航集团成立24年来，创造了奇迹般的增长。1993年，其创业资产仅有1000万元；2016年，其收入则超过了6000亿元。资产两万亿。\n\n23.为什么说海航是王歧山的？\n\n答：海航的陈峰是王岐山的手下，是王岐山安置在商界的一枚棋子。不过是王歧山操纵的一名前台傀儡，白手套。海航的股权分配情况是，海南的慈航基金占22%，美国纽约的慈航占29.5%，陈峰和王健加一起29%，其他人才百分之十几。郭文贵爆料指出海南的慈航背后的受益人是刘呈杰。纽约慈航的受益人是贯君和王岐山的家族信托基金，包括姚明珊，姚明端，孙凤山，孙瑶，姚庆。\n\n24.为什么说王歧山是盗国贼？\n\n答：近几年，海航实现了人类历史从未见过的疯狂扩张。钱那来的？是银行贷款。王歧山做过二大银行的行长。人马遍布金融界。将大量国家的钱贷给私人企业，再将钱转到私人信托基金和私人账号。这不是盗国贼是什么？！\n\n25贯军是谁？\n\n答：贯军或贯君，此人非常神秘。极少公开露面。海航第一大股东，占比29.5%。30多岁拥有六千亿资产，郭文贵爆料海航后，将股份捐给纽约慈航基金。让王健林汗颜，让盖茨羞愧，让14亿人瞠目结舌!这一切都像大卫的惊天魔术一样神奇。其实该基金的最终受益人还是贯军。\n\n26.刘呈杰是谁？\n\n答：刘呈杰，与贯军一样神秘。极少公开露面。海航集团第二大股东，占比22%。四十多岁。拥有四千亿资产，郭文贵爆料海航后，将股份捐给海南慈航基金。该基金的最终受益人还是刘呈杰。\n\n27.为什么说贯军是王歧山的私生子？\n\n答：郭文贵通过特殊渠道从301医院采集到王歧山，贯军，刘呈杰的血液，在美国权威机构做了亲子鉴定。得出结论为，刘呈杰不是王起山的私生子，贯军是王歧山的私生子。现代DNA亲子鉴定技术，否定亲子关系的准确率几近100%，肯定亲子关系的准确率可达到99.99%。\n\n28郭文贵爆料中的最大迷团是什么？\n\n答：最大的谜团是刘呈杰的亲爹是谁。郭文贵说，贯君的爹是王岐山，刘呈杰爹是谁？更加吓人说，我说了真地怕中国乱，吓死我了，真把我给吓懵了，我这才明白，为什么我爆料以后，倾一国之力对付我一个郭文贵，所有事情都是欲盖弥彰。这不是盗国贼了，这是盗国集团。\n\n29.海航飞行记录藏有什么秘密？\n\n答：郭文贵在2016年通过民航局空管局原管制员宋军、海航集团原员工马丛二人，收集到海航专机的一批飞行记录。通过分析可以发现，王歧山家族成员的名字确凿无疑的在这些飞行记录中。而且使用专用飞机的频率非常高。每星期约两次。行李中经常标有易碎物品。山西窝案发生时，海航专机飞到太原，将大批查没的珠宝，贵重书画，古玩秘密运往美国。飞行记录里的秘密太多了。海航专机的水太深了。\n\n30.什么是沉船计划？\n\n答：据郭文贵爆料，2017年5月11号，王歧山就提前启动了沉船计划，提前启动了洗钱计划，海航告诉老百姓说：我把钱捐给慈善基金了。陈峰开记者招待会，说这个贯君私人股权要捐给基金了，不是我们的了！而恰恰中国十几亿人就没有一个人敢站出来说实话：这还是他的！更是他的了！不但是他的，更夸张的是，717暴露了以最短的时间，5月11号到5月22号，仅差11天，把一个中国6000亿的资产附带着一个几万亿公司财务的公司股权，未经发改委国家工商特殊行业金融机构的审批，直接划到了美国，就不在你中国玩了，直接送到美利坚去。到了美利坚你想再拿走，不可能了！美国人那给你玩命的！\n\n31.海航的钱是哪里来的？流到哪里去了？\n\n答：海航现有资产官方数字只是四千多亿，而郭文贵爆料估计实际资产高达2万亿。海航原为国有企业，后变为私人股份企业。王歧山当常委期间，海航3年资产扩大6万倍。该公司可以轻易地从银行贷款，全球疯狂并购，参股上千家公司。中国只有两家公司可以处理不良资产，一个是长城公司，一个是中箭头公司。海航从这两个公司，以非常便宜的价格，捞取大量的因反腐罚没的资产。海航买飞机的钱，贷款的钱，50%，100%流向360私人帐号。海航已被盗国贼集团淘空。\n\n32.国安对王歧山和海航的早些年的调查结果如何？\n\n答：国家安全部马健副部长和孟会青曾经对王歧山和海航的疯狂盗国活动经行过调查，掌握了一些视频和档案，调查报告交到当时政法委书记孟建柱。孟建柱书记与王歧山书记在中南海的办公室是对门。两人工作来往密切，就是你整人我抓人的关系。私交甚密，可以说是狼狈为奸。结果是凡是参与调查，知道内情的国安人员都被逮捕判刑，包马建付部长，纪检人员孟会青。\n\n33.王歧山的后台是谁？\n\n答：朱镕基是王歧山的老领导，是王的教父。王岐山是中国经济沙皇朱镕基选定的继承人。\n\n34.王歧山的家人是谁？什么身份？\n\n答：姚明珊（王歧山太太，姚依林之女），美国公民，社保号：614-58-4035，姚明端（姚明珊妹妹），美国公民，社保号：609-38-7380，孙风山（姚明端的丈夫），美国公民，护照号码：H0019488501，孙瑶（王歧山养女），美国公民。贯军（王歧山私生子），姚庆（姚依林之孙）。\n\n35，王歧山家人海外有那些资产？\n\n答：拥有很多神秘的信托基金。家族资产不下两万亿人民币。在美国藏有大量反腐罚没的金银珠宝。王岐山家族在美国至少持有17个物业，遍及加州、华盛顿及马里兰州，总值超过3,384万（约2.6亿港元）。姚明珊有份持有其中五个物业，全都是位于加州硅谷地区的独幢豪宅，加起来总值约1,202万（约9,356万港元），大部份是她与妹妹姚明端、妹夫孙凤山联名持有。而登记业主为孙瑶的九个物业，有六个位于加州、两个在马里兰州及一个在首都华盛顿。14个物业中，最贵是加州硅谷森尼维尔（Sunnyvale）的独立屋，面积约2.6万平方呎，巿值497万美元（约3,867万港元），据当地商业名册，物业是一间软件商店，由姚明珊、姚明端及孙凤山联名持有。\n\n36、王歧山为什么要打那些大老虎？\n\n答：王岐山以反腐的名义打击政治对手，同时取得对人力资源和经济资源的控制，为其家族的腐败利益服务，是典型的以贪反贪。\n\n37王歧山为什么要迫害郭文贵？\n\n答：郭文贵通过特殊渠道掌握了王歧山，孟建柱等人的淫秽视频和海航的犯罪档案，王歧山和孟建柱等特别惧怕郭文贵将这些资料公诸于世，因此举一国之力迫害郭文贵，要杀人灭口毁灭犯罪资料。\n\n38.王歧山是集权左派还是开明右派？\n\n答：姚依林是中共左派，作为姚依林的得意女婿，王歧山深受姚依林的影响。六四前夕，他曾在中科院叫嚣，杀二十万人，保二十年的太平。王歧山的反腐，只是想保红二代的江山，执行江的秘密指令。他信奉毛泽东那套，打着民族复兴的旗号，搞极左那套。蔑视依法治国的理念。一边反腐，一边盗国。官场人称「鬼子六」。\n\n39.金融四人帮是谁？为什么金融不打大老虎？\n\n答：朱镕基，王岐山，周小川，楼继伟被人们称为金融四人帮。二十多年来，这四人把持中国金融的命脉，广布人脉，非常腐败。金融领域是腐败的重灾区。然而，王歧山在金融领域一个大老虎也没打，将他们视为自家人。\n\n40王歧山的情人有那些人？\n\n答：据郭文贵爆料，王岐山的情人有高燕燕，许晴，範冰冰等。还睡过无数港台明星。特别喜欢睡朋友的老婆。\n\n41孟建柱是谁？\n\n答：2001-2006江西省委书记。2007-2011公安部部长。2012-2017政法委书记。\n\n42孟建柱在江西干了什么？\n\n答：将情人苏晓琴从景德镇书记调到南昌任政法委书记。私吞江西铜业的股份。与省长苏荣有矛盾。后来苏荣以反腐名义被抓。\n\n43南普陀会议有什么秘密？\n\n答：2011年，江胡矛盾加剧，江派人马投靠胡锦涛。南普陀秘密会议决定几件大事，一是杀掉令计划的儿子，抓令计划。由孟建柱和孙力军实施；二是由习近平任傀儡总书记；三是由王歧山任中纪委书记，搞掉那些背叛江泽民总书记的人；四是由孟建柱任政法委书记，监察习近平。因此人称孟建柱为孟监国。\n\n44.孟建柱与江家的关系是怎么来的？\n\n答：孟建柱曾在上海任职，认识了江家的实际掌门人，中国影子政府的实际控制人江绵恒。孟建柱在2011年以移植器官救了江棉恒的命而得江家重用。孟建柱是江家的利益代言人，按需杀人的杀手。\n\n45.什么叫按需杀人?\n\n答：江绵恒做过三次器官移植。孟建柱安排杀了五个人。因为有两个器官不匹配，搞错了。有一个新疆小伙子因小事被抓，因器官匹配，硬是诬陷人家搞恐怖活动，杀了。这就是按需杀人。现在器官移植高度产业化，一条龙服务。按需杀人，偷器官的罪恶不知到有多少。\n\n46.孟建柱有那些情人？\n\n答：据郭文贵爆料，孟建柱的情人有：苏晓琴，江西政法委书记，国家信访办主任。王芳，歌手，著名五毛周小平代持夫人。杨澜，原央视主持人。\n\n47王芳是孟建柱什么人？\n\n答：最宠爱的情人。独霸春晚，让宋祖英哭倒在厕所的人。让官场敬畏的人。让赵本山，冯小刚惧怕的人。\n\n48.孟建柱的家人是谁？什么身份？\n\n答：老婆蒋琪梅，女儿孟海晶身在美国，有护照号码，还有美国绿卡。第二夫人王梅，私生子王孟辉，美国公民。\n\n49孟建柱的资产有那些？\n\n答：袁宝璟的部分资产，江西苏荣的资产，肖建华家的很多钱，都到了他女儿的帐上。王梅在澳洲有5-7亿美元，15套房产（部分）。孟海晶有100多亿美元资产。孟建柱家族总资产不会少于王歧山的两万亿人民币。\n\n50孟建柱与雷洋案什么关系？\n\n答：雷洋死因背景复杂，他因为知道孟建柱与杨澜、王芳的秘密关系而被灭口。\n\n51、孟建柱与袁宝璟案有什么黑幕？\n\n答：孟建柱和部分中央及辽宁相关办案人员为侵吞袁宝璟巨额财产，将他判了死刑，并将其大部分钱财转到了孟自己女儿的名下。\n\n52.马航失踪与孟建柱有什么关系？\n\n答：孟建柱為江泽民之子江棉桓及孟的母亲換肾，按需殺人，而馬航飞机上有公安办案人員及換肾相关人員，馬航失踪事件疑有人为因素。\n\n53.孟建柱与王歧山有什么关系？\n\n答：孟建柱为政法委书记，王岐山为纪委书记，他们一起进行选择性反腐，制造了大量冤假错案，并将腐败官员财产归为已有。\n\n54.孟建柱对新疆干了什么？\n\n答：孟建柱以反新疆暴乱為名，活埋了許多新彊人，奸污了許多新彊少女，并抓捕新疆人，活摘器官。\n\n55.孙力军是谁？\n\n答：孙力军原是孟建柱的秘书，后被孟提拨为公安部副部长，管公安部一局，与孟一起犯下滔天罪行。\n\n56.孙力军的妻子叫李莉，澳洲护照，并和孙在澳洲生一儿子叫孙尚华，姐姐叫孙莉莉，新西兰护照，他还有多名私生子女。\n\n57.孙力军的资产有那些？\n\n孙力军的资产在其妻李莉名下就有现金存款100多亿美元在澳洲，有多个信托公司，家人都是信托受益人。文贵爆了孙立军在澳洲的四处房产和他弟弟的五处房产。\n\n58.孙力军低三下四称兄道弟，用花言巧语骗文贵回国，证明了文贵爆料揭露了他们的腐败，是真实的有依据的，让盗国贼极度恐惧，给他们以致命打击。\n\n59.刘彦平是谁？\n\n答：刘彦平是国家安全纪委书记，来美国劝返郭文贵回国。\n\n60.刘彦平与郭文贵的通话录音说明什么？\n\n答：这么高级的中共国安领导跟一个被他们称为犯罪嫌疑人谈判，历史上从没有过。而且是这么低声下四的哀求不要再爆料。从头到尾不敢说郭文贵的爆料是假的。通过这个谈话录音，郭文贵的爆料真实性得到极大的验证。广大网友对爆料的真实性更加深信不疑。\n\n61.刘彦平劝返郭文贵的过程发生了什么？\n\n答：刘彦平到文贵家劝说出来后，被美国FBI抓住，让他24小时内出境，因为他拿的是商业签证，不应做任何执法行为。但他并没有出境，又第二次去见文贵，所以在机场被FBI抓住，没收了手机等电子设备。FBI反复要文贵证实，是否受到刘彦平的威胁，在文贵的否认下，FBI才放他回国。\n\n62.马云是怎么发起来的？\n\n答：马云发家原因部分是自己过人的聪明才智，更主要的是通过与江家等中共高层子女的官商勾结，垄断通讯、金融市场而发家的。有N个常委，政治局委员及子女，以及高干子弟，女婿帮，情人帮，秘书帮，私生子女帮与马云结成利益共同体共同腐败，靠淘宝网卖假货获巨利也众所周知。\n\n63.马云对郭文贵做了什么？\n\n答：由于郭文贵的爆料牵涉到马云的利益，马云反诬蔑抹黑郭文贵，并且到美国游说政府官员，想让美国遣返文贵。郭文贵在直播视屏中指出马云还计划谋害郭文贵。\n\n64.杨澜的真实身份是什么？\n\n杨澜的真实身份是文化特务，配合吴征执行大外宣对外渗透任务，分化、蓝金黄、绞杀异议人士。\n\n65.吴征是谁？\n\n吴征是杨澜的丈夫，阳光媒体投资控股有限公司主席，中共情报部门高级资深间谍，持美国护照，还是国安公安中纪委专案成员。\n\n66.吴征杨澜对郭文贵做了什么？\n\n吴征杨澜到美国打着习主席彭丽媛的名义，编故事，欺骗美国官员，打击郭文贵，吴征说他找了老布什，布什及奥巴马总统，给川普写信要遣返郭文贵。\n\n67.刘延东是谁？\n\n刘延东是国务院副总理，是中国职位最高的女性。\n\n68.刘延东权力有多大？\n\n刘延东曾经是统战部副部长，还主管文教卫生及体育部门。她的工作与安全部有密切关系。中国对外的情报部门，海外六千万华侨的统战政策及利益输送，就是通过统战部和安全部，也是海外大使馆及孔子学院的重要力量。中国的对外VIP医院掌握外事人员及运动员的医疗信息，以及高官的医疗保密信息，都与统战部安全部密切相关。\n\n69.刘延东家族是怎么发起来的？\n\n答：刘延东有批建医院学校的大权，她的女儿及丈夫都在与她联手在这里发财。中国南方的所有大的房地产项目，福建的几个大的医疗项目，以及所有与教育和医疗相关的影子，都有刘延东家族的利益，她的家族持有东方能源的股票，方正证券，北大医药等各大公司主要股份。她还与海外及香港的大生意人有权力利益输送，所以她的财产不亚于海航。\n\n70.刘彦平与刘延东有过什么故事？\n\n答：刘延东曾跪求刘彦平放她一马，不要查她。\n\n71.美国之音断播郭文贵是怎么回事？\n\n答：郭文贵4月19日在美国之音接受直播专访，节目预告三小时。一个多小时后直播突然中断。事件引起美国之音听众和广大民众强烈不满。许多人认为美国之音是受到来自北京的压力。美国之音节目主持人也透露，此前北京分社社长已遭到中国公安部门约谈。而在直播前一天，即4月18日，中国政府利用操控的国际刑警组织对郭文贵发出红色通缉令。这一切都表明，美国之音停播事件与中共干预有直接关系。其后，美国之音更无理对参与直播的三名工作人员开除。目前事件仍在调查中。\n\n72.哈得逊研究所取消郭文贵演讲是怎么回事？\n\n答：美国智库哈德逊研究所（HudsonInstitute）原定10月4日举办「对话郭文贵」活动，邀请郭文贵先生演讲。但该研究所10月3日致信受邀者称活动延期。此次演讲是郭文贵在美国公众社会的首次公开露面。而哈德逊研究所给出的取消理由是「时机不佳」。据美国媒体透露，「对话郭文贵」活动取消前，哈德逊研究所曾接到来自中国驻美大使馆的电话。尽管活动取消具体原因不明，但郭文贵演讲时间正好与中美执法及网络安全对话的时间重叠，引发外界猜想。很显然，这是中国盗国贼集团对郭文贵的封杀。\n\n73.脸书facebook为什么封锁郭文贵账号？\n\n答：郭文贵爆料令中共如临大敌，他们想方设法封堵郭文贵的声音。脸书为进入中国市场，密集地和中国政府协调，希望能尽快进入中国进行运作。他们因此向中国政府的压力低头，关闭了郭文贵脸书帐号功能。这是自由媒体脸书的历史耻辱。在最近美国国会听证会上，面对质疑，脸书副总裁正式承认收到中国有关部门的威胁信件。\n\n74.推特twitter为什么封号郭文贵？\n\n答：因郭文贵运用推特这个自由网络大量爆料，揭露中共盗国贼集团的贪污腐败。他们以倾国之力，运用一切手段阻断郭文贵使用推特。郭文贵的推特帐号曾多次被封。至10月18日中共19大召开前夕，他的推特账号再次被封，从此再未恢复使用。相信推特公司受到来自中共的巨大压力，也不排除推特内部「沉默的力量」在发挥作用。同时中共也可能通过网络手段，组织大量水军，向推特公司投诉、发难。郭文贵已诉诸法律，状告推特公司，要讨回公道。\n\n75．郭文贵YouTube为什么被暂停直播？\n\n答：郭文贵YouTube爆料直播刺痛盗国集团，震撼海内外华人。遭遇红色党国压力，YouTube以因接获身份不明人士投诉，郭文贵的视频涉嫌冒犯他人，以及透露敏感个人讯息为由，根据相关政策，暂停郭帐户的直播功能三个月90天。\n\n76.什么叫蓝金黄计划？\n\n答：据郭文贵爆料揭露，蓝金黄是早在二十年前中共对香港台湾的政策。蓝就是互联网，即通过收买港台的通讯商，网络商，名人媒体把网络控制，即控制新闻金融等。金色计划就是金钱，通过在上海及广东的台胞来输送利益，让港商到东莞去嫖娼，到广东去投资，进行前期利益输送，到后期的违法绑架，对台湾的民进党及国民党进行收买，与中共高官勾结，使其腐败。黄色就是嫖，录像掌握港台名人商人的性丑闻，毒及赌丑闻，用此来绑架威胁他们。\n\n76.蓝金黄计划的发展如何？\n\n答：近二十年来中共蓝金黄计划已经将香港台湾沦为中共控制势力范围，控制了港台政坛，进行利益绑架。如中共通过掌握马英九嫖娼视频，从而控制台湾，并使陈水扁入狱。近几年蓝金黄计划已向西方渗透，美国高层及新闻界，澳洲政界及媒体，以及华人社团很多已被中共收买渗透。\n\n77.什么是3F计划？\n\n答：3F计划是中共对美国的计划，就是搞弱美国，搞乱美国，搞死美国。盗国贼巳经在美国实行这一计划非常成功，将对美国人民产生巨大危害。\n\n78.郭文贵为什么说该我们赢一回了？\n\n答：说我们会赢一次，是指爆料掀起中共的内裤，看到了世界上最肮脏的内幕。郭文贵的爆料确实在国内传播，但是封堵的实在厉害，所以需要我们一起宣传，悄悄地翻墙小心地收听。\n\n79，什么叫一人战一国？\n\n答：郭文贵以一己之身，指控一个凶恶的盗国集团，挑战中共庞大的极权专制国家机器。\n\n80.郭文贵有什么个人魅力？\n\n答：郭文贵虽无意成为政治家，但有政治智慧，有政治家一般的演讲技巧、能量和感染力：几个小时不用看稿，时而慷慨激昂时而娓娓而谈。大家喜欢郭文贵的亲切，诚恳和幽默感。一人战一国，郭文贵的应变能力和应对压力的能力都是出自他惊人的意志力。国外的政治家演讲技巧是从小在贵族学校练成的。而郭文贵的演讲技巧是跟魔鬼打交道历炼出来的。郭文贵的勇敢、智慧、坚强意志，以及超凡的口才和个人气质魅力，使他成为人们心中的英雄偶像。\n\n81.推特党筹委会什么时候宣告成立？\n\n答：2017年7月19日推特党筹委会宣告成立。筹委会主要任务是推选及选举推特党主要服务人员候选人、建立推特党服务中心的。与此同时，筹委会要在推上推动诸多重大活动，首先要推动的是支持郭文贵爆料。\n\n82.第一个挺郭会什么时候在哪成立？\n\n2017年8月12日「澳大利亚挺郭后援会」在原「纽澳顶郭联盟「的基础上在悉尼宣告成立。随后新西兰、欧洲、加拿大、日本、法国、英国、美国、东南亚等挺郭后援会纷纷响应建立。\n\n83.「全球挺郭后援会联盟」什么时候成立？\n\n答：2017年9月21日「全球挺郭后援会联盟」宣告成立？\n\n84.全球挺郭后援会的目地和任务是什？\n\n答：①正确宣传郭文贵爆料的目的和意义；②积极配合郭文贵爆料的计划和行动；③努力促进郭七条发扬光大普照中华。\n\n85.挺郭会前景如何？\n\n答：各地挺郭会前景看好壮大有望三理由：1、挺郭者不图利还甘愿奉献冒险（郭赢果实全民共享，盗国贼赢挺郭者受难），具有巨大道义公义感召力；2、郭爆料影响扩至英语世界，西方价值理念中质疑指控公权力天经地义，更多西人挺郭必带动更多华人挺身而出；3、墙内朝野挺郭暗流涌动，告别恐惧公开力挺者日众。\n\n86.如何加入各地挺郭后援会？\n\n答：发私信给当地的挺郭后援会的成员，经介绍即可加入。\n\n87.没加入挺郭后援会，如何挺郭？\n\n一样可以以自己的方式和努力支持郭文贵爆料。譬如上推特、YouTube关注文贵爆料，向朋友家人传播文贵爆料，就是支持郭文贵爆料。\n\n88.海外有那些受欢迎的挺郭自媒体？\n\n答：海外受欢迎的挺郭自媒体主要有：「明镜」、「澳洲之声」、「郭宝胜政论」、「长青论坛」、「深哲深谈」、「小民之心」、「小哥谈政事」、「大师兄」、「书斋夜话」、「赵岩」、「耿言说事」等。\n\n89.挺郭自媒体联盟的产生背景？\n\n答：郭文贵爆料引起巨大反响，也在全球范围内带动了自媒体的蓬勃兴起和快速发展，引起中国盗国集团的极大恐慌。为了打压郭文贵的声音，盗国集团采取收买、五毛举报，黑客攻击等等手段阻止海外媒体传播郭文贵爆料。2017年9月中旬，为对付中共大外宣的进逼，一些挺郭自媒体决定成立全球挺郭自媒体联盟，以加强各地挺郭自媒体之间的团结协作，以更大力度传播郭文贵爆料。\n\n90.为什么郭文贵经常说一切刚刚开始？\n\n答：郭文贵手上还有很多料未引爆，他有三年实现自由民主法治的计划，所以一再强调一切刚刚开始。\n\n91.郭文贵爆料下一步的计划是什么？\n\n答：继续爆两个新常委、四个军中大老虎的料，但会根据政局变化调整目标和战略。\n\n92．我们每个中国人，面对郭文贵爆料应当做什么？\n答：监督、指控公权力是公民的职责，每个中国人、海外华人都应大力支持郭文贵。\n\n93.郭文贵爆料对十九大有什么影响？\n\n答：郭文贵的爆料已经对中共19大产生了重大影响。被郭文贵爆料的王岐山、孟建柱、孙力军都已出局，不再连任。预计日后还会将他们清算，追究他们的刑事责任。而在此前，王岐山及其追随者不断造势，想让他留任，意在夺取最高权力。经郭文贵爆料，他们已彻底失败。\n\n94.郭文贵爆料在国内的传播情况怎么样？\n\n答：郭文贵的爆料开始在海内外广泛传播，但由于党国盗国集团家的信息屏蔽和封锁，需要我们一起努力以各种方式把郭爆料传进墙内。\n\n95.为什么郭文贵说自己就是澳洲的荆棘鸟？\n\n答：澳洲的荆棘鸟一生都在寻觅长满荆棘的灌木丛，一旦找到，即将它脆弱的胸膛往最尖锐的长刺撞去，在临死前会鸣出最动人的天籁之音。郭文贵将自己的宿命比作荆棘鸟，他冒着生命危险，面对来自各方面的攻击，打压，威胁，恐吓，承受常人无法想象的盗国集团的巨大压力和家人、亲人和员工遭受折磨的悲切痛楚，用一次次的爆料来唤醒在黑暗中沉睡的中国人，发出时代的最强音。\n\n96.郭文贵有无跟盗国贼妥协和交易的可能？\n\n答：郭文贵自己多次阐明，与盗国贼的斗争绝不妥协，也无退路。\n\n97.郭文贵有没有被引渡和暗杀可能？\n\n答：郭文贵被引渡可能性几乎为零。盗国集团敢暗杀郭文贵的可能性极低，因为他们会付出海外亲人、情人、私生子等高昂代价。\n\n98.郭文贵追求的喜马拉雅到底是什么？\n\n答：以「郭七条」改变中国，实现中国的自由民主法治。\n\n99.为什么郭文贵说该我们赢一回了？\n\n答：郭文贵说该我们赢一回了，是指他这次爆料一定能推翻盗国集团，赢回中国人民的尊严和安全保障。说我们会赢一次，是指爆料掀起了盗国贼们的内裤，让世界看到了中国铁幕政治高墙内的肮脏龌龊。爆料唤醒了广大中国人民，包括九千万党员。互联网时代，盗国集团已无法掩盖真相，无法阻止真相的传播。只要人民团结起来，就能实现中国的民主、自由和法治。\n\n100.为什么说郭文贵已经青史留名？\n\n答：郭文贵爆料是2017年最重大的政治事件。郭文贵爆料成为震撼世界的特大新闻。他以大量事实，大量证据，揭露中共高层令人怵目惊心的贪污腐败罪行，特别是王岐山家族及海航的巨额资产。他的爆料已经和正在影响中国社会政治发展进程，并将继续发酵，对中国的社会转型的影响不可估量。郭文贵的名字已经载入史册。\n\n鸣谢：「郭文贵爆料100问答」的编写得到日本挺郭后援会同道的协助，特此鸣谢！\n\n（注：本问答根据网络资料汇编，收到读者反馈后，我们将进一步修改完善，敬请广大网友指正！）\n\n澳大利亚挺郭后援会",
			"added": 1512215366,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 13,
			"title": "低人权优势",
			"body": "发表于 2015 年 06 月 17 日\n作者：秦晖\nhttp://hx.cnd.org/2015/06/17/秦晖：当中国梦遭遇权贵资本主义\n\n今天国际经济学界对中国认识千奇百怪，但荦荦大者不外乎三：其一曰「中国崩溃论」，即认为中国经济的高增长只是浮夸造成的假相，实际则是内部危机与全球化压力日益严重，难免崩溃。其二和其三都相反，认为中国经济创造了增长与繁荣的奇迹，但对此则按西方经济学两大阵营的传统学理形成两种相反的解释：古典自由经济学把「中国奇迹」归功于经济自由化或市场化的成功，而左派经济学或凯恩斯经济学则归功于「社会主义」或政府干预、管控的成功。\n\n我认为这三大主流认识都有严重偏差：中国经济持续高增长、在全球化中应对自如是事实，「虚假论」、「崩溃论」不对。但这种增长，既不像偏左的论者那样可以解释为「政府成功」，也不像偏右论者所言可以解释为「市场成功」，更与所谓「市场与政府双重成功」的「北京共识」不相干。除了低工资低福利的传统优势外，中国更以「低人权」的「优势」，人为压低四大要素（人力、土地、资金和非再生资源）价格，以不许讨价还价、限制乃至取消许多弱势者谈判权的办法「降低交易成本」，以拒绝民主、压抑参与、漠视思想、鄙视信仰、蔑视公正、刺激物欲来促使人的能量集中于海市蜃楼式的单纯求富冲动，从而显示出无论自由市场国家还是福利国家都罕见的惊人竞争力，也使得无论采用「渐进」的还是「休克疗法」的民主转轨国家都瞠乎其后。\n\n当然如果不对外开放，这种冲动也不会有多大能耐。但是在全球化时代对外开放后，中国不像其他转轨国家受到「民主分家麻烦大，福利国家包袱多，工会吓跑投资者，农会赶走圈地客」的「拖累」，便出现了空前快速的原始积累。而这种方式造成的危机，则靠外部资源（资本流入、商品输出）的增益来缓解，同时通过全球化把危机向外部稀释：在靠铁腕压住自己的内部矛盾而维持「稳定」的同时，「中国因素」却使他国的内部矛盾增加：大量资本流出、商品流入和产业结构变化，使发达国家百年来形成的劳资力量平衡趋于瓦解。民主国家（不仅欧美，连印度这种发展中民主国家亦然）的资本对本国的工会农会「惹不起躲得起」，他们在中国式的「专制市场经济」国家找到了既无工会又无农会、没有讨厌的环保组织挑刺、只要搞定了官员就可以为所欲为、甚至连税都可以优免掉的投资乐园。同时依靠「低人权优势」，大量中国廉价商品涌入各国，排挤了当地的相应产业。如此一进一出使各国劳工谈判实力面临崩溃，工会衰落，福利萎缩，移民、就业和公共财政陷入困境。不仅福利国家无法应付这种局面，自由市场国家也因无法与「血汗工厂」竞争而难以为继。\n\n于是，最近张五常便声称今天中国经济「比美国更自由」，是「全球最好的制度」，而世界的潮流将是「欧洲学美国，美国学中国」！\n\n其实谁都知道，今天中国不仅工农没有结社、谈判的自由，资本在连《产权法》都难产的情况下又有何自由可言，但是「低人权优势」的确使全球化中「中国的竞争」势不可挡，它既迫使福利国家降低福利水平，也迫使自由国家重树贸易壁垒，还使得不发达国家在吸纳资金、获得资源等方面面临更大困难。\n\n吊诡的是，在此种趋势尚属初显的今天，他们各方都力图以「中国的成功」来证明各自的理论：中国经济的非自由色彩令左派欣赏，而它的非福利色彩则令右派欣赏，同时它又以穷国快速发展的形象令第三世界艳羡。于是本来对现代左派和右派、对福利国家和自由国家、对发达国家和发展中国家都构成严重挑战的中国，却同时受到上述各方的称赞。\n\n然而他们还能称赞多久？由于上述「中国优势」不可复制（没有中国式的铁腕，任何国家无论左派还是右派执政，实行自由市场政策还是凯恩斯式的乃至社会民主的政策，都不可能这样来搞原始积累），而「中国挑战」又客观存在而且不可回避地日益严重，各方的对华关系长远地看能乐观吗？\n\n## 中外规则的碰撞\n\n实际上，全球化中的中西（乃至中外）规则「碰撞」已经日益昭示了其中的实质：\n\n一方面外资入华后引起对比。中国不少人指出：就重视劳工权益而言，国内如今是欧美资企业最好，东亚（日韩）资就较差，港台企业更差，而国内企业，包括私企与非垄断部门的国企在内最差。以地区论，尽管珠三角等开放地区的「血汗工厂」已经令人触目惊心，由于当地相对开放，人们也议论最多，但事实上劳工权益最差的恐怕还是内地企业：内地的「夺命矿山」有甚于深圳的「断指工厂」，而深圳的「工棚现象」其实比国外的 slum 已经更不人道而且引起了诸多议论，然而内地很多单位不但不允许农民工自建陋房（我国颇有人以此自豪，谓之「中国没有贫民窟」，但他们却缄口不言：那么农民工住哪儿？），而且连「工棚」都不提供，而是任其露宿街头！许多欧美外资本来就是规避本国劳工权利而跑到「低人权」的中国，但民主福利国家的长期「社会主义传统」仍然使其初入时诸多「不习惯」，不习惯于如此对待劳工，不习惯于如此巴结官府，甚至有劳工维权、外资企方已答应条件、而官府却以破坏「招商引资」大计而出面弹压的。但久而久之，这些欧美外资有的也入乡随俗，学会了镇压劳工，学会了「搞定」官府。以至于回到本国已经无法适应，只能「扎根」中国，而我们的传媒则宣传为「不但留住了『资』，而且留住了心！」\n\n另一方面，我国的企业一旦赴外投资，首先感到的第一个障碍，便是那里强大的工会、农会。欧美就不要说了，拉美被我们的舆论说成是所谓「新自由主义」的典型，似乎是资本最神气、工人最受欺负的地方了。然而我们的「中资」一进去，立即发现恰恰相反：那里的工人把资本「欺负」得够呛！拉美最大中资企业「首钢秘铁」违法（当地的劳工法）镇压工潮、开除罢工工会成员，造就了「秘鲁工人英雄」胡安 • 坎查理，在工人支持下他先当选议员，后成为秘鲁劳工部长，他的女儿则民主当选「首钢秘铁」所在市的市长。而「首钢秘铁」则被劳工运动「折腾」得七荤八素，不但经济上损失惨重，而且政治上声名狼藉。国内传媒因此一片惊呼：「海外投资须防工会陷阱！」我们的国企老爷可算知道了什么叫「咱们工人有力量」。\n\n拉美工人不好惹，咱们「中资」又看上了非洲，那里不但穷，工资低，而且政治比拉美落后，很多地方还是独裁统治，也不像拉美那样，中了「西方社会主义」即社会民主主义的「毒」，不会成天鼓捣劳工权利。并且我们不管「人权」，跟当地的独裁者特别处得来，不但不干涉他们的「内政」，而且对这种「内政」如鱼得水——我们的「中资」在国内「搞定」官员的那套本事在这种「内政」中最能大行其道，令「西资」望尘莫及，于是「中资」大举挺进非洲，而且在竞争中屡屡击败西方公司。\n\n但是很快「中资」就发现非洲毕竟不是中土，虽然那里的劳工不像欧美乃至拉美那么厉害，毕竟那些前殖民地也沾染了些西方「劣习」：首先是传媒「自由度」仍比国内为大，民主虽然受枪杆子左右而不成气候，毕竟还有反对派和一定程度的竞争，双方要拉劳工的票，工会虽很难持政治异议，在劳工权益上也还有所作为。而近年来，西方传入的环保和原住民权益 NGO 更为麻烦，「中资」在那里圈地，甚至到自然保护区和国家公园去采采挖挖，被搞定了的官员也就袖手旁观而已，靠他们来弹压刁民，像在国内的定州、汕尾那样，则嘎嘎乎难哉！后来不少中资发现窍门：非洲人现代民族国家观念淡漠，相对较富的沿海国家有不少跨境劳工来自更穷的内陆国家，他们是非法移民，不受劳工法保护也没有工会。于是大量雇佣他们便成为非洲中资经营的诀窍之一。然而不久又发现：非洲人国家意识虽淡，部族意识却强，跨境劳工多是在本部族区打工，在当地虽无国家与现代工会保护，还是有部族、亲缘关系可依，一旦发生劳资纠纷，他们往往有当地本部族人的声援。\n\n最后，中资发现普天之下还是中国劳工最顺从。国内的农民工本来就习惯于「低人权」，到非洲更举目无亲，语言不通，没有任何社会联系可依，往工棚里一关，还怕你不就范？于是非洲的许多中资企业最终都转向在当地获取资源、销售产品，却千方百计从国内大量输入劳工，为此不惜采取非法手段。如南非某中资企业从国内输入「保安」150 多人，占全部雇员的 80％以上，实际都是一线工人，以规避当地一般工人必须雇当地人的法律。这种做法已引起当地舆论的强烈恶评。中资既倾销廉价商品挤垮了当地产业，本身又只掠取资源而无助于当地人就业，就算是独裁者青睐、官员行「方便」，其奈民心不齿何？不过，正是由于中国不像东欧，不但「低人权」，而且经济块头特大。你可以不让中资进去，却挡不住你自己的资本投奔中国，而外资一旦争相入华，非洲要「招商引资」，舍中资还能引谁？\n\n## 只有中国能救资本主义？\n\n于是在市场日益全球化、而人权却不能全球化的背景下，「中国因素」在全球范围内对「社会主义」——福利国家和劳工权利构成的挑战也日益严重。笔者 2004 年在美国时曾到过密歇根州弗林特市，那里曾是 GM（通用汽车公司）早期总部所在地，后来是汽车工人聚居中心，其市政历来为强大的工会势力所控制，实行典型的高税收高福利和全方位社会保障制度，是美国著名的「社会主义城市」。当年这里曾经非常繁荣，人均产值比附近的世界车都底特律还高得多。为工人服务的城市公共设施也非常完备。「从摇篮到坟墓」的生活公益，直到工会疗养院与度假村，从技工学校、通用汽车学院、社区大学直到 GM 资助的公立密歇根弗林特大学等一整套教育体系，还有全美第一流的斯隆博物馆、朗维天文馆、市立美术馆，可谓美轮美奂、应有尽有。\n\n可是如今随着资本撤出，汽车产业衰败，税源枯竭，市政破产，人口外迁，这座「社会主义城市」已经几乎完全垮掉，居民大半退休，设施严重老化，晚上那里不少街区甚至连路灯都不亮。GM 总部的研究人员告诉我，GM 在美国已经连续 10 余年完全没有招收新的蓝领职工。由于工会不允许解雇工人，但公司可以以不降待遇为条件在所属各厂间调配工人，于是公司便借退休自然减员，减一批关一个厂，并把工人调充余下各厂维持生产，再减一批又关一个厂…… 如今一些厂蓝领职工平均年龄已达 50 多岁。过不了几年，公司在美的全部汽车厂都将关闭。而盛极一时的美国汽车工会及其「社会主义城市」也将彻底没落。\n\n那么 GM 的资本转到哪里？当然不止中国，但最主要是中国。GM 全公司如今已经连续多年巨额亏损，濒临破产。当年这个全球第一大公司，现在度日维艰，不仅美国本土各厂巨亏，在全球各地、包括在印度的 GM 生产基地也多数亏损，只有在中国是大量盈利！因此 GM 在中国的产量比重目前还不算高，但盈利比重已经是 100％乃至无穷大（分母已为负数）！所以只要可能，GM 仍打算把生产线继续向中国转移。这位研究人员感慨地说，这世界上如果不是有中国这么个无工会无福利制度的地方可去，我们就只有改行不做汽车了。\n\n这不成了「只有中国能救资本主义」了吗？然而还不止于此。我们知道其实 GM 全部转移中国只是这位先生的一厢情愿。中国本土汽车业也在大发展，不可能有太多地盘让给 GM。但是中国本土汽车业与 GM 不同的是，它只能在无工会无福利权利的情况下发展。最近上汽收购韩国双龙汽车后遭遇「工会陷阱」的事，说明 GM 在工会如此大的压力下能撑到今天实在不易，上汽岂能如此，也何须如此？\n\n东欧的经历表明共产党无法战胜资本主义，而西方的经历则表明资本主义在民主条件下也无法战胜社会主义——或者说「资本」在民主条件下无法战胜「劳动」，然而，近年来中国的经历却似乎在表明：专制加资本主义可以征服劳工！因此，无论是 GM 转移到中国来逃避工会压力继续发展其汽车产业，还是此路不通而 GM 只好破产、或者改业移资到没有工会与福利压力的新行业，而把汽车生产让给中国的「无工会企业」，让美国人都来买中国产廉价汽车，从「国家」角度看或有不同，从「主义」角度看其实一样：两者都意味着一个真正「劳工神圣」的行业在垮台、一个相对平等程度最高的福利体制在消亡。\n\n## 全球化中的社会主义危机\n\n而且不仅是汽车业，在美国以至欧洲，凡是百年来劳工运动的社会主义成果积累最多、工会影响与福利权利最强大的制造业，如钢铁、造船、纺织等等，都已经或正在发生类似的过程。当然，过去人们早已注意到这一趋势。但是大多只把它看成产业角度上的升级转移和「全球化」时代的梯次发展：工资成本高的发达国家劳动密集型产业向低工资的发展中国家转移。这种现象当然存在，并且也不是坏事，或者说应该是好事。\n\n然而，GM 在同样低工资（可能还低于中国）但工会强大的印度赚不到钱、而在中国就能大赚的事实，中资汽车业到了国外就陷入「工会陷阱」的事实，乃至连印度的塔塔财团也想把其在本国的汽车生产向工资（与印度相比）稍高但无工会的中国转移的事实——所有这一切都在在说明：这种全球性变革，不仅仅是高工资地区的产业向低工资地区的转移，甚至可能主要不是这种性质的转移，而是「高人权」地区的产业在向「低人权」地区转移。它不仅是经济水平上的梯次发展，而且是、或许更重要的是体制上的此盛彼衰，甚至是「劣币驱逐良币」。\n\n它并非如弗朗西斯 • 福山所说的那样意味着自由民主的胜利和「历史的终结」，但却很可能意味着两百年劳工运动和社会主义理想、一百年民主福利制度、上千年人类平等愿望的失败。由于前者，自由主义者朋友们不能太乐观；由于后者，社会主义者（而非斯大林主义者）朋友们更不能乐观。\n\n应该说，现代经济史上的「梯次发展」已有较长历史了。1970 年代的石油危机、1980 年代后的信息产业革命都曾推动发达国家传统制造业向外转移，并相应造成传统蓝领工人在发达国家人口比重下降和与此相联系的一系列社会变化。那时「中国因素」还没什么影响。今天中国融入全球化，其庞大的经济容量非当年「四小龙」等「新兴工业化地区」可比，对梯次发展自然是一大推动。\n\n然而，过去的梯次发展与今天不同之处在于：首先那时传统制造业的移出虽然可能削弱了发达国家的传统工会，然而它却把这种「工业社会主义文明」传入了产业的移入国，在拉美、东亚、印度都造成工会农会兴起、劳工权益、社会民主与公益福利大发展的局面。虽然发达国家 1980 年代已经开始出现「福利国家困境」的苗头，但从全球看仍然是社会民主主义扩张时期。而今天就不一样了：制造业移出地区「福利困境」固然更严重，移入制造业的中国尽管至少在一些东部沿海地区产业密集程度已不下于当年的拉美和东亚，更远远超过了印度，可是却完全没有接受「工业社会主义文明」，那里仍然禁止（自治）工会农会，盛行血汗工厂，靠「低人权优势」进行原始积累。这才真正是社会民主主义的全球性低潮。\n\n与此相关的是：传统蓝领阶层人口比重和社会重要性下降通常被视为当代工会衰落的原因。据说是因为替代制造业的服务业和高科技产业不同于大工厂，其经营方式不适合形成社团。但这种说法不能解释何以发达国家工会衰落的同时农民的组织和集体谈判能力却空前得高。与过去马克思主义关于产业工人最有组织性、农民则是原子化的「一口袋马铃薯」的说法相反，今天发达国家农民的集体博弈能力常常强于工人，乃至只占人口百分之几的农民往往在代议政治中能影响多数票。难道他们的经营方式与大工厂的差别不是更大吗？进而言之，今天服务业与高科技产业和传统制造业的区别何在？据说就是「知本」的重要、「小即美」和「在家上班」等等。当年的工匠其实不也具有类似特点吗？过去手工业时代的工匠尚且有同业公会组织，为什么今天的「后现代工匠」就只能靠大工厂才能联合，否则就只能原子化？显然，仅仅以产业结构改变不足以说明工会——民主福利体制的困境。更重要的原因在于当今这种类型的全球化进程中，「低人权优势」导致的「劣币驱逐良币」效应——这种「优势」的压力使人们不得不向「低人权」看齐！\n\n## 存在「中国模式」吗？\n\n而中国，如果说它在全球经济水平上的梯次发展中地位重要，那么它在上述那种体制盛衰中扮演的角色则更为突出。这只要看看一些中国人自己的「经验总结」就可以明白。\n\n事实上，如今关于「中国优势」的议论已经悄悄在发生改变。以中国人最津津乐道的中印比较而言，毛泽东时代中国与印度排除不可比因素外其实并无明显优势（不少方面甚至中国是劣势），可是那时中国人都一口咬定中国因「社会主义」而有优势，印度的劣势则是因为搞了「资本主义」。到了改革后中国的经济起飞真正把印度甩在了后面、而印度的拉吉夫 • 甘地在邓小平之后 10 年也开始搞市场化改革了，主流的中国人就说印度的劣势是由于搞了「苏式计划经济」，而我们的优势是比印度更早开始了改革。果然，这些年来拉吉夫改革使印度经济明显提速，但仍然次于中国，而且市场化改革本身在民主印度也遇到中国所没有的「阻力」，即「工会吓跑投资者，农会赶走圈地客」，于是近期更多的中国人开始强调印度的劣势是由于劳工权益、福利保障、工会农会等因素太强大。即印度（相对于中国而言）的「失败」既不是因为「资本主义」，也不是因为「苏式体制」，而就是因为「民主社会主义」！\n\n同样的变化也发生在中国——东欧比较上：过去东欧处在转型期阵痛时，一些国人说这是「复辟资本主义」的恶果，而另一些人则认为东欧的市场化民主化是正道，阵痛过后发展会更快，中国则回避民主化，市场化也很不够，将来会吃苦头。10 多年过去，东欧渡过阵痛而进入了稳定发展，怀念旧体制的人越来越少，尤其是加入了欧盟的那些东欧国家，正以比西欧更快的增长速度追赶「老欧洲」。同时多数东欧国家属于社会民主党执政的「粉红色欧洲」，在废除专制后也保留了旧体制中的一些福利因素，并在欧盟民主福利国家传统的影响下有所发展。相比之下，倒是中国本来旧体制下的低福利状态在「官府卸责不限权」的改革中更加恶化，同时市场化和「掌勺者私占大饭锅」却在「只做不说」的「智慧」下不断加深。\n\n因此，像张五常那样认为今日中国比东欧更资本主义（当然并非更民主）的人越来越多。而东欧从阵痛中恢复后发展虽然加快（在欧洲算是最快），但增长速度仍然不如中国。于是过去那种关于「中国社、东欧资」的两种论调（事实判断类似，而价值判断相反）都在消退，而像张五常那样，认为中国的「共产党专政加资本主义」战胜了东欧的「民主社会主义」的声音，则响亮起来。实际上，先于张五常，我国的内部调研中早就有这种声音。已故的中共中央对外联络部资深研究员、长驻波兰的郭增麟先生，10 年前就曾尖锐批评波兰民主化之后颁布的《劳工法》，认为该法只强调劳工权益保障而不讲劳资两利，妨碍了波兰经济的发展，云云。\n\n然而，当今中国的政治背景下，那种对东欧、印度的传统斯大林主义式的指责并未消失，反而在近两年的舆论控制中重新突出。本来从邓小平时代起，批判斯大林在中国就已不是禁忌（只要不批判列宁），但近两年却开始压制「批斯」，包括著名的《历史研究》在内的一些刊物都因刊登「批斯」文章而受到处理。于是斯大林主义式的「东欧、印度批判」又突然高调起来，它指责东欧、印度搞民主自由、「资本主义」等等。于是我们又看到了中国景观的另一面：与「中国经济的非自由色彩令左派欣赏，而它的非福利色彩则令右派欣赏」相应，东欧和印度则因给老百姓自由而受到「左派」的批判，同时又因给老百姓福利和维护工农权益而受到「右派」批评。而两种批评显得振振有词的共同基础，就是中国当前这种既无自由又无福利的体制在「低人权优势」下实现的经济高增长。\n\n## 「低人权优势」的未来展望\n\n然而我国这种「低人权优势」的发展模式，虽然现在很风光，但隐患也不容忽视。在对国外的民主福利国家形成挑战的同时，这种模式也在中国国内形成「尺蠖效应」：「左」则自由受损而福利未必增加，「右」则福利丧失而自由未必增进。「左」时政府扩权却不可问责，「右」时政府卸责却不愿限权。「左」起来侵犯平民私产而公共财富却未必受保障，「右」起来公共资产严重「流失」而平民私产却未必受保护。一边「新国有化」一边又「权贵私有化」。「左」时「公权」侵夺个人领域却无心公共服务，「右」时放弃公共产品却不保护个人权利。政策趋「左」则压缩个人自由却并不开放公共参与，趋「右」则抑制民主参与却同时限制自由竞争。「左派」建不起福利国家，「右派」搞不成公平市场。正如孙立平所言，无论向左还是向右，得利的都是同一些强势者，而吃亏的也是同一些弱势者。用老百姓的话说就是：「一个萝卜两头切，左右都是他得。」\n\n这样就使社会矛盾在一放一收的尺蠖式进程中，日益发展和积累，而不能像宪政民主体制中那样，以左派争福利、右派争自由的「天平效应」，来维护社会的平衡。\n\n因此，中国的快速发展并没像有些人设想的那样「把饼做大」就能缓解「分饼不公」的矛盾，而是出现了经济发展与内部外部矛盾同步持续深化的现象。我们曾把合法性建立在经济增长上，说东欧垮了而我们没垮，就是因为我们经济搞得好。但是现在，经济高增长和社会不稳定同时发展的现象使人对此说日益怀疑。正因为此，胡温政府大力提倡「和谐」，比过去更强调公平和公共服务责任，这一趋势应当肯定。然而「尺蠖效应」机制不改变，只怕权易扩而责难问，现有体制下回复「大政府」只会形成扩权—卸责的又一轮循环。而走出「尺蠖效应」，就需要进行权责对应的宪政改革。\n\n中国这么大的国家，这么多人口，中国经济这么大的量，将来作为全球商品供应者和资本吸纳者的作用日益凸显，一旦出问题可能比 1929 年美国股市崩盘对全球的冲击更大。因此中国平稳顺利地转型不仅是国人之福，也是世界之福。而中国因「尺蠖效应」而发生社会爆炸，或因现行原始积累方式与福利国家和自由国家的双重冲突而导致国际秩序崩溃，则不仅是国人之祸，也是世界之祸。\n\n在全球化形势下，世界关切中国是必然的。如今发达国家压中国把人民币升值，这实际上就是中国现行原始积累方式与福利国家和自由国家体制冲突的初步体现。但人民币升值实际上不能解决问题。事实上，中国制造业工资水平如今不低于印度，但竞争力仍高于印度，显然靠的并非单纯经济性的低工资低汇率优势。「低人权优势」作用更大。正是这种只要搞定官员就可以任意圈占农地、役使劳工、耗用资源的「优势」，使中国成为举世罕见的「投资乐园」，连印度的塔塔财团也想躲开工资虽低但工会农会很厉害的本国，而向中国转移资本。何况其他？\n\n显然，中国的「优势」既不在于其市场更「自由」，也不在于其国家更「福利」，而就在于其更铁腕。笔者反对专制的态度众所周知，但从来不以「专制妨碍经济增长」为理由。事实上，专制「刺激」经济增长，在非市场条件下有斯大林和纳粹德国的例子，在市场条件下也有近代早期中东欧「二度农奴化」使商品性农业大发展的例子，而美国经济史家福格尔的研究也表明，内战前美国南方奴隶制经济的「效率」不亚于、很可能还「优于」北方自由经济。但是专制仍然应当反对，这不仅由于其不人道，也由于这种「效率」的畸形。中国今天靠「低人权优势」在全球吸纳资本、输出商品而形成惊人的高额「双顺差」，不仅让别国头疼，一般中国人又能得益多少？超廉价的劳力、土地、资源付出，形不成有效进口需求，只换来巨额的「绿纸」（账面美元）。中国人埋怨美国开动印钞机卷走了咱们的血汗，美国人埋怨中国廉价货砸了他们的饭碗，而一旦美元狂贬，美国完了，我们的血汗也白搭。\n\n所以，改变这种状况，不仅是别人希望的，更是我们中国公民希望的。但是逼中国升值人民币改变不了它。只有改善人权，尤其是维护工农权益，才能改变这种状况。在市场经济全球化之际如果没有人权的全球化，「全球化」确实可能带来弊病乃至灾难。而消除了「低人权优势」后，中国不可能维持如今的原始积累方式，靠官商勾结压制工农吸引投资输出廉价商品来扩大「双顺差」的「竞争力」将大打折扣。对福利国家和自由国家体制的冲击也将减少。\n\n那时中国经济还能如此高速地增长吗？这的确是个问题。但这种畸形的高增长真就那么值得不惜代价地维持吗？到了不可持续、难以为继时内外危机爆发不更危险吗？印度与民主转轨国家的成就都表明，没有了「低人权优势」，中国作为发展中国家仍然会保持一定程度的低要素成本优势（只是不会被人为压低得那么离谱），加上体制改善与中国人勤奋而富于创造性的特点，中国经济度过转型期危机而保持合理增长速度是完全可以预期的。当然可能没有现在「快速」，但增长效益的内部与外部分配都会比如今合理，内外关系会比现在和谐，而给中国与世界人民带来的福利增进更会远胜于如今。",
			"added": 1512307136,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 14,
			"title": "请给我加配额，谢谢",
			"body": "",
			"added": 1512308047,
			"parent_topic_uri": "14_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 16,
			"title": "数理逻辑发展的基本动机",
			"body": "Basic intention for the development of mathematical logic\n数理逻辑发展的基本动机\n作者：赛义甫 时间：2017-09-12 05:19:59   精\nhttp://wap.sciencenet.cn/blogview.aspx?id=1075495\n\n---\n\nWe know that mathematicians care no more for logic than logicians for mathematics. The two eyes of exact science are mathematics and logic, the mathematical sect puts out the logical eye, the logical sect puts out the mathematical eye; each believing that it sees better with one eye than with two. —— Augustus De Morgan\n\n「我们都知道数学家对逻辑的关心从未比逻辑学家对数学的关心更多。数学和逻辑学是精密科学的两只眼睛，但是数学家对逻辑视而不见，逻辑学家对数学视而不见。双方都相信自己只用一只眼比用两只眼视物更清楚。」——德摩根\n\n莱布尼兹曾经有两个梦想：\n\n1. 创建一种「普遍语言」（characteristica universalis）使得任何问题都可以用这种语言表述；\n2. 找到一种「判定方法」（decision method）以解决所有可以在「普遍语言」中所表述的问题。\n\n这两个问题是上百年来数理逻辑、数学哲学和数学基础问题的核心、实质。对前一个问题的回答就是自弗雷格、罗素开始，经公理集合论运动的最终结果：以一阶谓词逻辑为语言所形式化阐述的集合论，现在已经成为数学的普遍语言，现代逻辑学、特别是将符号逻辑应用于数学领域所产生的数理逻辑，其最重要的目标就是为整个数学提供一个严格精确的语言。这是我们在学习数理逻辑时应当把握的方向。\n\n而第二个问题则是现代哲学和计算机科学最关注的问题之一：是否可以解决用这个「普遍语言」所形式化描述的所有问题？这个问题就是所谓「可判定性问题」（Entscheidungsproblem，decision problem）。对这个问题的研究最终导致了理论计算机科学的诞生：阿隆佐·丘奇和阿兰·图灵分别以各自的方式对这个问题做出了否定的回答。他们在研究这个问题时首先对「可判定的」（decidable）这个直觉概念进行了深入研究并给出了形式化定义和解释，进一步把这个问题归结成「可计算的」（computable）问题，并最终将其定义为「可计算函数」（computable function）问题的研究。为此，丘奇和图灵分别提出了关于可计算函数的模型。图灵的模型就是著名的图灵机，它已经成为现代计算机科学的理论基础；而丘奇的模型则是lambda演算，这成为后来计算机语言Lisp和现代函数式程序语言的理论基础。其后图灵证明了这两个模型其实定义了同一类别的可计算函数。可以说，丘奇和图灵对数理逻辑的研究是从传统的解决数学基础问题出发开创了一个崭新的领域：计算科学。\n\n与此同时，美国数理逻辑学家哈斯凯尔·克里（Haskell Curry，又称柯里）在研究怀特海/罗素的类型理论时发现了逻辑中的蕴含命题可以归结成类型问题，从而使得证明论研究可以转化为对类型理论的研究。对这个问题的更深入研究始于1969年威廉·霍华德（William Howard），他的研究表明，逻辑与类型论之间的对应关系可以从多个逻辑系统得到，从而将逻辑学的证明论与计算理论归结为同一理论的两个侧面，这就是著名的克里-霍华德同构（Curry-Howard isomorphism）。\n\n由此来看，数理逻辑所研究的最本质主题有两个：形式系统的表述能力（the expressive power）和形式证明系统的演绎能力（the deductive power）。对一阶谓词的语义学的研究导致了模型论的出现，而对逻辑的核心问题推理的形式化研究特别是20世纪初希尔伯特的公理化研究演化成证明论、而对自然数集合及其函数的研究催生了递归论的出现，而集合论则是所有数学分支的基础语言。从这些领域出发又可派生出和其它领域相关的子分支，例如从模型论派生出形式语义学，从证明论派生出以产生式系统为核心概念的形式句法，从递归论派生出可计算性和计算复杂性以及可计算函数的研究。从集合论出发，产生出了更抽象的范畴论，而集合论本身已经成为所有数学分支的基础语言。\n\n因此，现代数理逻辑的学习，大致包括了两个方面：符号逻辑学基础：一阶逻辑（莱布尼兹第一问题，语言问题），逻辑应用（演绎推理问题）：数学公理化和建构性数学（constructive mathematics）、以及理论计算机科学的核心问题：可计算函数的研究以及相关的可计算问题和计算复杂性问题。\n\n「所有科学的宏大目标都是：从最小数量的假说或公理出发通过逻辑演绎推理说明最大数量的实验事实。」——阿尔伯特·爱因斯坦\n\nThe grand aim of all science is to cover the greatest number of empirical facts by logical deduction from the smallest number of hypotheses or axioms. —— Albert Einstein",
			"added": 1512916817,
			"parent_topic_uri": "19_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 17,
			"title": "破娃被人肉 & SSR安全性",
			"body": "破娃被人肉出来了，思路各个回答和网络上各个博客都有了。有意思的是，六扇门的能力肯定要比各个泥腿子三脚猫答主们要强的，这是大家所知道的。那么，为何六扇门只ks了clowwindy而没有ks破娃呢？（所以大家不要关心破娃的安危了，要是一个普通人都能人肉到他的话，你想想他凭什么能活这么久呢？）嗯，ssr的可靠性也就不言而喻了。\n\nhttps://www.zhihu.com/question/58530288/answer/271084140",
			"added": 1513679296,
			"parent_topic_uri": "10_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 18,
			"title": "论坛内置屏蔽(mute)功能",
			"body": "@p2p 你自己替换吧\nhttps://github.com/0polar/GFW-Talk/tree/master",
			"added": 1513757809,
			"parent_topic_uri": "14_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 19,
			"title": "新疆12天见闻：政府监控如何渗透日常角落",
			"body": "位于中亚的中国边疆城市乌鲁木齐可能是全世界受到最严密监控的地方之一。中国为打击一些分裂分子的暴力活动而采取的措施让这里成为了高科技社会控制的试验场。\nhttp://127.0.0.1:43110/12ddrrRKkABAWTU48ZL3THfypHtVJ3aVF5/?Post:19",
			"added": 1513764610,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 20,
			"title": "贵州某三甲医院停用部分医疗耗材是因为医保没钱了吗？",
			"body": "https://www.letscorp.net/archives/125256\n小病自治，大病自杀",
			"added": 1513766187,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 21,
			"title": "中国特色恐怖主义的六大特色",
			"body": "胡平\n中国人权双周刊 第137期 2014年8月8日~8月21日\nhttp://biweekly.hrichina.org/article/20072\n\n---\n\n7月23日，中新社自纽约发出报道，世界著名风险评估公司梅波克洛夫公司(Maplecroft)23日发布的数据显示，全球与恐怖袭击有关的平民死亡数量正在大幅上升。最近一年，全球超过1.8万人因恐怖主义行为遇难。报道显示，中国的恐怖袭击正在上升，在全球197个国家和地区中排在第32位，为「中等风险」，其中许多恐怖袭击将交通枢纽作为袭击目标。报告称，今年中国有76人死于恐怖袭击，而2013年前6个月为16人。\n\n这份报告表明，中国的恐怖主义已经引起国际社会的关注。\n\n如今，无论什么事在中国，就会带上中国特色。恐怖主义也不例外。那么，中国特色的恐怖主义到底有哪些特色呢？\n\n依据中共官方的文件、讲话和报道，我归纳出以下六点：\n\n一、以政府机构和军警为主要攻击目标；\n二、用简陋工具；\n三、本土化，即和境外恐怖组织没有直接联系；\n四、非组织化，即没有成型的恐怖组织；\n五、大多数事件中，攻击者自己的现场死亡数量反倒超过被攻击者一方；\n六、作案者总是维族人。\n\n以下，我对这六点特色分别加以说明。\n\n### 一、中国的恐怖活动是「以政府机构和军警为主要攻击目标」，这一点出自中国政府最具权威的官方文件《国家安全蓝皮书》。\n\n从网上看到两幅照片，在乌鲁木齐，几个荷枪实弹的武警站在铁笼子里面站岗。一位香港记者说，他在新疆曾见到武警小分队巡逻，其中，倒数第二个武警背上背着一面大镜子，以便让最后一个武警能从镜子里看到后面的动静。可见，警察是袭击的主要对象应该是实情。\n\n再有，从已知的攻击事件看，所谓攻击政府机构，实际上主要是攻击派出所或公安局。按说，攻击者若抱有明确的政治诉求，在攻击政府机构时应该选取更能象征权力的党委和政府，何况党委和政府的武力防范能力较低，攻击更容易；可是攻击者却偏偏主要攻击派出所公安局。这一特点也不应忽略。\n\n尽管到目前为止，国际社会对恐怖袭击还没有一个公认的统一的定义，但一般人都认为，针对平民的攻击才算恐怖袭击，针对政府、尤其是针对军警的攻击不算恐怖袭击。本文开头引用的那份梅波克洛夫公司报告讲明它所说的因恐怖袭击而死亡的人数是指平民，不包括政府官员和军警。这也就是说，被中国政府指为恐怖袭击的大多数事件，既然其攻击目标是政府机构和军警，因此在梅波克洛夫公司那里并不算恐怖袭击。有人指责美国政府对恐怖主义持双重标准，对中国政府宣称的恐怖袭击往往不予谴责；那也是因为那些攻击不符合美国关于恐怖主义的定义。\n\n《国家安全蓝皮书》公布于今年5月6日，其定稿的时间当然要早一些。自今年3月1日昆明火车站事件以来，针对平民的暴力袭击事件有显著增长。这一变异应当引起注意。考虑到这一变异恰恰是发生在当局大力加强反恐防恐的背景之下，不能不使人感到讽刺与诡异。\n\n### 二、中国《国家安全蓝皮书》称，中国的恐怖活动一大特点是：「恐怖势力使用冷兵器等简陋工具作案」。\n\n中国的反恐专家说，「斧头汽油成恐怖分子首选」。有些恐怖活动，作案者使用了某种爆燃装置。是什么爆燃装置呢？根据官媒报道，在这次乌鲁木齐文化宫早市恐怖袭击事件中，引发汽车爆炸的是煤气罐。按照《纽约时报》报道，作案者从车内往外投掷的爆燃物「像个油漆罐」。\n\n看来，新疆的恐怖分子，大约是全世界最寒酸的恐怖分子。那么，为什么他们不去使用厉害点的工具呢？原因很简单，因为政府管制得太严太紧，他们根本得不到杀伤力大的作案工具。自己在家里偷偷制作土炸药也很难，因为警察和社工人员可以随意进入家中搜查，发现可疑物品就没收，连刀具多了几把都不行。只有斧头、汽油、煤气罐、油漆罐一类家居生活的必需品才不会被没收，因此也才有可能成为作案工具。\n\n最近发布的几条新闻很能说明，当局为了防范暴恐分子获得作案工具已经把工作做到了什么地步。一条是：4月1日，乌鲁木齐市政府下令，严禁非法收购煤气罐。另一条是：为了防止暴恐分子利用，7月8日，新疆阜康警方销毁2万余盒火柴。还有一条是：今年7月，杭州、长沙和广州分别发生公交车纵火案，造成多人伤亡，7月27日，新疆乌鲁木齐当局下令禁止公交乘客携带液体、打火机和不明粉状物上车。\n\n本来是杭州、长沙和广州发生了公交车纵火案，杭州、长沙、广州等地政府并没有下令禁止乘客携带液体、打火机和不明粉状物上公交车，反倒是没有发生公交车纵火案的乌鲁木齐下令禁止了。严禁非法收购煤气罐和销毁火柴也只限于新疆。\n\n### 三、本土化，即和境外恐怖组织没有直接联系。\n\n尽管每逢发生恐怖袭击事件，政府总要声称是和境外恐怖组织相勾结，但随后就没了下文，没拿出什么真凭实据，可见只是官样文章，当不得真的。《国家安全蓝皮书》的措辞就比较谨慎，它只说部分恐怖袭击事件的背后有深刻的国际背景。现在的中国既非闭关锁国，又赶上信息全球化，境内的人要获得境外的信息并不难，也很可能受到某种影响，但是这和与「境外敌对势力」，尤其是和「境外恐怖组织」有勾结不是一回事。\n\n6月24日，中国国家互联网信息办公室举行新闻发布会，发布了一部题为《恐怖主义的网上推手－－「东伊运」恐怖音视频》的电视专题片。国信办称，这部电视片将境外「东伊运」组织指挥、在网上传播涉暴恐音视频、煽动境内恐怖活动的行径公之于世。不过，在当天出版的英文版《环球时报》发表文章，承认「东伊运」和新疆暴恐团伙没有直接联系。\n\n《环球时报》援引专家的话承认，由于新疆的恐怖团伙散布在新疆各地，被当局称为新疆恐怖活动策划者的「东土耳其斯坦伊斯兰运动」（即「东伊运」），实际上和松散地处于新疆各地的大多数暴力恐怖团伙并没有直接的联系。「东伊运」对他们的影响仅限于在思想和意识形态方面。《环球时报》援引专家的话说，新疆的暴恐袭击者可能接触过一些宗教和种族极端主义的出版物，以及「东伊运」发布的一些视频，但他们之间并没有直接的接触，同时也并非以上下级的关系运作。甚至连「东伊运」本身是否作为一个组织而存在以及存在于何处都大有疑问。中国现代国际关系研究院反恐怖研究中心主任李伟就说，虽然一般认为，「东伊运」在南亚，实际上东伊运居无定所，并不是一个成建制的组织。\n\n### 四、非组织化，即没有成型的恐怖组织。\n\n新疆恐怖活动的另一个特点是非组织化。非组织化是指恐怖分子并没有形成恐怖组织，而是单独的个体，或者是一个家庭、家族或朋友之类的关系。昆明火车站事件的作案者有七八个，但按照官媒报道可知，他们的作案带有某种随机性，也就是说，他们并不是为了一块儿策动恐怖袭击而聚到一起的。你可以把他们叫做团伙，但不能说他们是恐怖组织。\n\n前面提到的英文版《环球时报》文章也承认，新疆的大部分恐怖分子散布在各地，并非在一个有组织有领导的恐怖机构中运行，形态呈非结构化，也没有一个严密的从上到下的中央控制的机构。\n\n### 五、大多数事件中，攻击者自己的现场死亡数量反倒超过被攻击者一方。\n\n但凡恐怖袭击，除非是偶然失手，否则，攻击者一方的现场死亡数量总是大大地低于被攻击的一方（事后被打死被判死刑的不算）。通常，自杀式恐怖袭击是以一当十，一个人肉炸弹造成十人死亡，1：10。美国的911事件是1：168（19个恐怖分子造成3201人死亡）；车臣的黑寡妇虽是女性，杀伤力很大，平均是1：20。\n\n然而，中国特色恐怖主义的现场死亡比例要低得多，除去昆明火车站事件大约1：7和乌鲁木齐文化宫早市事件大约1：8以外，大多数事件中，攻击者自己的现场死亡数量反倒超过被攻击者一方。例如，2011年新疆和田7•18事件，攻击者当场被击毙14人，警察和民众死4人；2012年12月新疆皮山事件，暴恐分子当场被击毙7人（其中2名是女性），公安干警只死了1人；2013年10月天安门撞车事件，暴恐分子死3人，民众死2人；2013年年底喀什事件，暴恐分子当场被击毙8人，公安民警和民众零伤亡；今年4月30日乌鲁木齐火车站事件，暴恐分子被炸死2人，民众死1人；6月21日叶城事件，暴恐分子当场被击毙13人，只有3个民警轻伤，无民众伤亡；这次7•28莎车事件，官方称，暴徒被当场击毙59人，无辜民众37人死亡。\n\n如此说来，新疆的恐怖分子，实在是天底下最笨拙最低能的恐怖分子。这不能不令人怀疑：他们真的都是恐怖分子吗？那些事件真的都是「有组织有预谋」的「恐怖袭击」吗？\n\n### 六、作案者总是维族人。\n\n我们注意到，在被中国政府认定为恐怖袭击的事件中，作案者总是维族人。或者说，只有维族人作案的暴力事件，才会被当局认定为恐怖袭击。\n\n同样是袭击警察（包括城管），如果发生在汉区，如果当事者是汉人，例如杨佳袭警，民间称为大侠，当局虽然判处死刑，但也没有把杨佳定为暴恐分子，没有把杨佳的袭警行为定为恐怖袭击。\n\n同样是发生在人群密集的公共场所，同样是针对一般平民的暴力攻击，甚至同样是连妇女儿童都不放过，在汉区发生的多起枪杀案、屠童案、公交车纵火案，等等，哪怕这些事件给一般平民所造成的伤害和恐怖更大更严重（例如2013年6月7日，厦门发生一起公交车纵火案，造成47人死亡，死亡数量超过今年3月1日昆明火车站事件、5月22日乌鲁木齐文化宫早市事件和7月28日莎车事件），只要作案者是汉人或什么族的人而不是维族人，当局就没有把它们定性为恐怖袭击。\n\n中央党校的靳薇教授最近撰文指出，发生在新疆的「暴恐事件」，有不少其实并不是蓄谋的，而是偶发的，是没有明确政治诉求的，是个体因经济家庭或社会因素产生的暴力对抗和宣泄，其背景应该与内地因拆迁、征地、讨薪等日益频繁出现的对抗和暴力事件相似。\n\n以上六大特色，是我根据中共官方文本归纳出来的。在这里，我不打算对这六大特色进行深入的道德评判，我只是把它们作为事实、作为现象罗列出来，而把价值判断交给读者。我相信，任何人，一旦他意识到中国特色的恐怖主义具有上述六大特色，他就不能不质疑：在中国，被当局定性为恐怖袭击的那些事件，究竟有多少真的是恐怖主义？为何在如此的高压态势下，还频繁发生这一类暴力事件？造成这些暴力流血事件的，在多大程度上是恐怖主义，在多大程度上是国家恐怖主义？",
			"added": 1514096380,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 22,
			"title": "建议清理合并三个置顶帖",
			"body": "「三个置顶帖」分别是：\n- 新人都来看置顶帖，请不要重复提问\n- 常见问题FAQ\n- 新增ZeroNet Android APK 官方下载地址、彻底屏蔽刷屏的人的方法\n\n目前的置顶帖，太啰嗦，太零碎\n建议：\n一份指南（原理 安装 使用 建站 开发，这几个方面分别概述）\n一份版规",
			"added": 1514217233,
			"parent_topic_uri": "14_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 23,
			"title": "苹果电池",
			"body": "作者：[唐滢松](https://www.zhihu.com/people/tang-ying-song-51)\n链接：https://www.zhihu.com/question/264553427/answer/282541339\n来源：知乎\n著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。\n\n---\n\n不说别的，只来说说iphone的电池。\n\n最早iphone用的是sony在中国原厂的电池，当时市面最好的源，嗯，加个之一吧。\n然后iphone的电池厂就一个一个的换，咱也不能下定论这些厂的产品品质肯定是差了，但是至少它们在业界的口碑是都知道的。\n\n我三年前得知最早给iphone代工的那个老sony电池厂已经关了。\n苹果后来又找过一家sony的电池厂，但是品质就不如之前的。\n此外苹果的产品电池本身来源好几家，都是混用的，比如有：\nsony无锡\n德赛惠州\n华普常熟\n欣旺达\n新能源东莞\nLG南京\n喔，还有上回note7爆过的SDI三星\n\n其实SDI都算是iphone的电池厂里比较好的了，至少是来源可控的那种。\n在5s之前，苹果的电池代工厂就控制在四五家以内，主要是索尼、三星、LG、新能源、力神这样的知名老牌电池代工厂。而在5s之后，苹果的采购商突然就换了一批，一堆你听都没听说过的名字如雨后春笋一样冒了出来。我上面列出的那些名字都是我尽可能去找了，实际上还有很多厂我根本扒不到名字，但是也在给苹果代工电池。\n\n对了，之前不是有人拿过5s做实验吗，老5s没换过电池，升级系统以后，跑分不但没怎么降，有的项目分数还上升了？\n你看，要么是苹果推送给5s的系统里忘了根据电池限制性能的这条，要么就是四年前的5s的电池状况比两年前的6和6s还要好。\n\n过去都讲苹果赢在供应链，从原材料上就控制。\n嘛，现在看来是从原材料上就控制成本吧。\n四五年前，大家换个电池，甚至买了新iphone，都得查查是不是苹果原装的。\n现在嘛，谁换原装电池谁sb。\n\n我们都知道的普通锂离子电池循环充放500次以后，容量衰竭少的5%多的20%是很正常的事。\n但是我这就要给大家说一点，好的电池和坏的电池真的差别特别大。\n就是锂电池底端的18650，很多笔记本老爱用的，这玩意儿就联想自己的产品线里面，普通本子18650一年不到衰竭个百分之四五十，甚至坏掉的，跟ThinkPad的T系列用两年还杠杠的。\n5s我弃用的时候，电池衰竭10%，60块钱买了个电池换了放那了。\nipad mini，现在偶尔用用，打开不关机放一个月还有电。\n去年买的7，已经感觉电量扛不住了，而且升级ios11以后各种奇怪的卡顿。\n\n---\n\n我发现很多人对于这个电池还是有认识误区，我就补充几点吧。\n\n首先，人们常说的锂离子电池循环充电寿命是500次左右，注意，这个是锂离子电池，你要是信了手机厂商的这套说辞，你就输了。\n从锂电池，到锂离子电池，再到现在的高分子锂离子电池即锂聚合物电池。不要听某些人说的电池技术很久没进步了的话，至少这种断代式的进步还是有的。\n锂离子电池寿命300到500的说法是因为，早先锂离子电池好的才有500次，普通的就300次。\n但是工艺成熟以后，正常的18650绝对能保证500次以上不明显衰退。而特斯拉上面的18650配合其电路和系统设计，能达到四十万公里以上的的寿命，电池号称可循环充放1000次以上。\n\n然而手机本身用的是锂聚合物电池，这种电池从诞生之初就普遍比锂离子电池寿命更长。我知道的五年前的A品锂聚合物电池就能做到循环充放800次以上都保证5%以内的衰竭。\n就算考虑到电池本身的时间寿命，好的手机电池你用个三五年也是不会有明显容量减退表现的。\n注意，这个是五年前的生产工艺做出来的电池。\n\n评论区有讲到很多电池代工厂其实就是pack厂，它们自己不生产电芯的。\n这就是关键了，为什么苹果要把原来自己生产电芯的大厂换掉，去找pack厂代工呢？\n比如sony老厂自己只做A品电芯，苹果找它代工，它当然也只会用自家的A品电芯给苹果做电池。\n但是，假如换了华普、欣旺达或者别的不知名小厂，苹果给它们定死了一千五百毫安的电池出厂只给30，或者直接给指定一类极便宜的电芯，你觉得结果如何呢？\n另外要说的一点，这么多年电池生产技术的进步，不只是在于如何生产更薄、更耐用、更安全的电池，也有——不断下探的更低成本。\n\n18650这一块，松下做到了宣称1500次以上寿命的电芯。\n与此同时，很多人这两年买到的笔记本，还有一年去一半，两年报废的电池。还有各种寿命极短的移动电源，和便携式「炸弹」。\n\n所以聪明如你知道为什么现在你的iPhone既不耐用还莫名卡顿的原因了吗？",
			"added": 1514565038,
			"parent_topic_uri": "19_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 24,
			"title": "应试教育 & 教育公平",
			"body": "各省高考，南京考不过苏北，石家庄考不过衡水，成都考不过绵阳，现成的例子就摆在眼前，某些京巴沪瘪一说起统一高考就突然关心起西藏新疆的教育了，真有意思。\n\n中国特色应试教育最大的问题在于「一国两制」。其实我觉得中国的应试教育不配称为应试教育，应该叫等级制教育才对。\n\n应试教育会被东亚儒家社会推崇的原因，主要是因为公平。但是全东亚只有日韩台可以说自己的应试教育是公平的，请你国这种辣鸡国家不要偷取日韩台应试教育的优点，往自己的b脸上贴金！！\n\n你要搞应试教育，就学日本韩国台湾一样不分出身不分地区地统考，统一录取标准，谁的分高谁上大学，彻底贯彻分数线下人人平等的原则。\n\n你要搞素质教育，就老老实实搞素质教育。先别管贫困山区能不能学钢琴油画，请不请得起大学教授做辅导，暑假能不能去美国游学，你把素质教育是啥给说清楚，然后让别的省也有机会依葫芦画瓢。\n\n现在的中国是什么个情况呢？\n一边鼓吹应试教育好应试教育公平，一边又疯狂压低应试教育做得最好的高考大省录取率，把大量名额给北上津这种号称素质教育的地区。\n\n你说应试教育好，可是搞应试教育的地区明明被你国压榨得最惨啊，莫非你们说的好不好是比谁为党国牺牲多？\n一个国家不要b脸到了这种程度上了，还有一群废物粉红洗地，真是人类历史上罕见的奇观。\n\n> https://www.zhihu.com/question/31009331/answer/258797457",
			"added": 1514627579,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 25,
			"title": "如何充分利用互联网上的爱国主义者们？",
			"body": "很简单，可以做生意啊。\n\n你看那个林超，靠着剽窃别人的梗画漫画名利双收。\n你再看那个周小平，伪造当兵经历，办黄网被抓。文章写得烂的不行，还是能有粉丝，能成为御用文人。\n你再看看花千芳，没什么文化，竟然说中国是司马昭之心。这妥妥的乳滑啊，但是依然能有粉丝，还能进辽宁抚顺作协找一份职务。\n你看看那个胡杨麟，只能在微博上瞎骂。但是依然能众筹赚到钱。\n还有那个组合，天府尸变。那唱的算是什么东西？可依然能有粉丝，依然能赚到钱。\n还有那兔手游。停运一次，又出了个新的，还是有不少人充钱。\n还有侯聚森，约架打输了马上发动宣传攻势，高考零分硬是被大学录取了。\n\n所以，资源就在这里。善于利用肯定是能获利的。\n\n> https://www.zhihu.com/question/39642555/answer/164903841\n\n---\n\n用偶像明星、动漫、二次元同人等素材从爱国话题切入宣传女德。\n\n比如模仿那兔，搞个汉服风格的萌系动漫，用年轻女性喜爱的口吻潜移默化地宣传儒家需要的模范女性形象。\n\n再比如给偶像明星开个工作会议，要求所有偶像明星公开或半公开表示自己喜欢三从四德的古典女子形象，吸引广大年轻女性模仿，如果谁不从就爆点酗酒吸毒危险驾驶不爱国发表不当言论等黑材料，甚至搞钓鱼执法。\n\n再比如让自干五大V带头反女权，宣传处女情结，同时让网评员带节奏挑起无知少女的舆论倾向，谁敢宣传女权、反婚、性别歧视就发动同性网友就骂她婊子。\n\n真的，现在女德班主要问题是开讲座的人又老又丑而且内容还老套，要是用宣传星辰大海的手段宣传女德效果绝对拔群。\n\n> https://www.zhihu.com/question/39642555/answer/174091555\n\n---\n\n最好的办法，就是隐身幕后不要乱蹦。尽量不要背责任，只拿好处。\n\n红色「公知」之所以好当，就是因为天朝是我们的祖国————我们爱她。但是也难当————我们也知道她并不是天堂，尤其是现在有太多人认为现行政治制度要为所有的不足负责的时候。\n\n那个领导人和教皇对话的笑话怎么说来着？教皇说：「我们也宣传天堂，但是我们没有让这个天堂被看到。」\n\n所以在现阶段，要想消费小粉红，最好取巧，不要讲太多现实。\n\n比如说复兴汉服，同时讲古代历史（光荣的屈辱的都行）只要提升民族自豪感就行了。这个方法的好处就是不用为现在的乱象负责。但是缺点就是要做大量功课，而且没有办法那么快变现。\n\n或者你也可以针对留学生群体，留学生群体往往接触到了国外的黑暗面，而接触不到国内的黑暗面，这个也是一个好方法。不过你要先做留学中介。\n\n最好的方法，可能还是那兔那样以动画为载体，或者成、为、偶、像！小说、漫画、动画、电影、电视剧、歌曲。事实上最早的小粉红应该就是从这些地方确立了信念，但是却没有得到更好的引导。\n\n其他的跟风卖面膜，虽然也OK，但是毕竟和政治没有太大联系，主要还是拿言情小说做招牌吧。\n\n当然学蓝色「公知」的道路也可以，不过可持续性不高。\n毕竟小粉红也是会长大的，上一代小粉红发现被骗之后发生了什么，不用说你也知道。\n\n> https://www.zhihu.com/question/39642555/answer/173965908",
			"added": 1514663244,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 26,
			"title": "房价/比特币，哪一个会先崩溃？",
			"body": "我当然知道这两个都要崩溃的，问的是哪一个会**【先】**崩溃？",
			"added": 1514991445,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 27,
			"title": "扬州十日、嘉定三屠的事实真的如网上流传的那样夸张吗？",
			"body": "事实部分前面答主说的很多了，既然来的晚，那就要说个新角度。既然大家说是「是不是」，我就来说说「为什么」。\n\n为什么在几乎在每个涉满问题上，各种奇谈怪论都有很大的市场。\n\n因为中国共产党坚决、一贯、从不动摇的**在涉少数民族历史问题上使用双重标准甚至多重标准**，屁股坐在党建团建，民族宗教，学术教学，国家主义，经济发展，政治博弈等各个角度的每一个个体面对的政治正确都是不一样的。在有明确目的性的平台，比如说上到政协下到铁血，问题很容易被关在笼子里。但是在知乎，讲道理，虽然知乎问题不少，但还是比政协和铁血多元化很多，各种花式问题自然也就满天乱飞。\n\n执行双重标准虽然不利于学术上把道理讲清楚，不利于让群众把事情看明白，但是有利于建立更广泛的统一战线啊，对外有利于同仇敌忾，对内有利于降低抗争精神啊。\n日本政府说，我们很困难，但不能苦了东京和大阪，那只好苦了满洲人民了，于是死了几十万东北人。\n中国政府说，我们很困难，但不能苦了北京和上海，那只好苦了四川人民了，于是死了几十万四川人。\n这两件事，是无论如何都不可能在现行的政治正确标准下被一视同仁的，一定要找出其中的区别，拉着少数民族打日本打国民党打党内反动势力境外反动势力建立广泛的统一战线，最后找到的这个区别就叫内外有别。\n同样的恶心事，外国人干了就是境外反华势力，党要发动群众斗境外反动势力。本国干了就是一点点小曲折小弯路，党要群众们不要乱动。\n涉满问题就尴尬在这里，它一半是内部问题，一半是外部问题。假如现在山海关以北都不属于中国，失去了内部性，那「中国人」自然可以很容易的把满洲国和日本国放在一起骂。假如现在中国的主体民族是满人，失去了外部性，满洲共产党洗地的功夫那可是亚洲一流。可是偏偏两者都不是，这就很麻烦了。\n\n所以大家要看到，这个问题的根源不是什么大满洲主义者，什么前清遗少，而是我们自己在思想界就没有一个统一的标准来对事实进行衡量。我们现行的衡量标准是什么？**凡是涉外的就要抨击，凡是涉内的就要洗地**，这才是问题所在。\n两个凡是思想的土壤是什么？不惟真理而唯某些人嘛。\n就算你证明了在扬州总共杀了十亿人，如果某些人需要把这个问题人民内部化，那凡是涉内的就要洗地。\n就算你证明了在扬州总共杀了十个人，如果某些人需要把这个问题敌对外部话，那凡是涉外的就要抨击。\n至于真正杀了多少人，某些人，某些搞统一战线的人，某些搞思想斗争的人，某些想把问题内部化的人，某些想把问题外部化的人，他们在乎么？\n\n> https://www.zhihu.com/question/31213759/answer/98899420",
			"added": 1515162565,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 28,
			"title": "在广东等粤语区，如何才能有效地继续推广普通话的使用？",
			"body": "学习对上海成功的做法。\n1.先是在影视作品和舆论上搞臭上海，让各地对上海人人人喊打，利用上海人在媒体界的弱势和他们所谓排外的特点，扩大矛盾，引导舆论，竖立上海人各种鲜明的形象。\n2.既然大家都讨厌上海人，而且也听不太懂上海话，自然容易会讨厌上海话，觉得阴阳怪气。\n3.一旦在上海厌恶上海人和上海话的基数大了，自然有人会出头抨击上海人和上海话。因为他们知道有许多人会支持他。\n4.厌恶上海的人由于他们的立场就会抵制上海话和声援出头者，拉偏架。\n5.许多人进一步从抵制上海人到抵制上海人说上海话。导致出现许多上海人在上海不敢主动开口说上海话的事情，不然容易被扣上个有意对外地人说上海人，趾高气昂，是歧视同胞。\n6.出现说「公交车上增加上海话报站是歧视外地人，你们上海人有什么了不起的。」与「我讨厌上海话，太恶心了，你们上海的地方电台可不可以不要说上海话」的事情，而且许多人喜闻乐见的支持，一部分上海人不满意这种言论，一部分上海人发扬风格说说的好，的确不应该。舆论上前者被围着打，前者玩完后，后者自然更加不会主张要说上海话了。\n7.当然也许多地方官的立场和作为，上海地方官主动让上海人别说上海话再配合上海各省市朋友里那部分厌恶上海人和上海话的人，实的上，公共场合上海话越来越少，虚的上，你敢说上海话，舆论就敢理直气壮嘲讽你。\n\n广东朋友还是好的。有了上海的先例后，事先敏感许多。而且广东的舆论和形象比上海好太多了。\n像这个问题里，许多广东朋友还有其他地区的朋友都在支持方言，换成上海的话，估计就许多人跟着踩上海了。\n\n要推广普通话最重要的就是占据大义，让大部分人对小部分人人人喊打。可以拉拢一部分当地的犹豫者，再消灭一部分不配合者。\n要支持方言最重要的是，形象和舆论不能臭，不能被扣帽子，要长袖善舞。不能让说普通话是对的，说方言是错的，这种概念变成常识。要坚持以「要会说普通话，说普通话是好的，但不是说说方言就是错的，方言不应该被和普通话对立。」广东的和广东的在一起就尽量说粤语，和外省市的朋友说普通话，为人友善。自然不会被抓到什么机会扣帽子，被扣了帽子由于舆论上不弱势，也不会被打到无底深渊。\n希望广东别成下一个上海，上海的方言是基本药丸了。\n\n> https://www.zhihu.com/question/49652777/answer/117561798",
			"added": 1515260312,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 29,
			"title": "如何评价知乎 Live 员工爆料「被离职」事件？",
			"body": "分两方面来讲：\n\n员工 和 知乎。我不对过程中的事实做道德判断。仅仅就双方的行为进行一个马后炮式的点评。\n\n**1，爆料的方式错误**\n\n员工：\n\n该员工最幼稚的地方在于没有让传播最大化。尤其是核心的图1-图9 在第一波传播中没有被截图保存下来。导致现在新闻稿、八卦群里的都是没啥石锤的文字截图传播。\n\n马后炮：\n\n简单版：应该发出文字+图片后（开仅自己可见）快速截图1-9，然后公开发一遍再快速截图 1-9，然后丢进各种互联网群（我相信做运营的都有类似的群）。然后任由其发酵。而不是打了一堆话，然后被赶来的同事删掉。让第一波刷到的吃瓜群众只有一个全是文字的罗里吧嗦的流水账在传播。\n\n复杂版：一句话（必须标题党：知乎某某某干了啥震惊世人的事，e轮融资告吹） + 一张模棱两可、八卦到极致的类似 今晚来我房间睡 这种聊天截图。随后把剩下的料丢一些职场app或者贴吧、或者私信给某些喜欢爆料的互联网大v，让知乎第一波公关力量对素材的传播难以控制。陷入四面灭火但火源越来越多的状态。\n\n至于具体是啥震惊世人的事儿，你可以从扒灰、当小三、喂芥末等等啥吸引眼球用啥，这个考量标准入手。\n\n**2，爆料的矛头错误**\n\n员工：\n\n错误的地方在于怼一个莫名其妙的路人甲。实话说我对这个孟女士任人为亲，高压管理，工作方式不当，没有工作经验（按照爆料文描述）这种纯粹属于 **个人作风** 式的素材完全不感兴趣。换言之，如果我是这个姑娘的领导，就像现在的知乎官方一样，相比较她最后能完成的 KPI，她的人品的好与坏，手法是否得当完全不重要。\n\n所以打蛇根本没打到七寸。你要弄臭一个人，也没有花时间和脑子想想怎么才能弄臭一个人。\n\n马后炮：\n\n杀人诛心，要搞臭一个人，就得从下三路动手。销售live有没有跟人上床？有没有拿回扣？怎么莫名奇妙空降到这个位置上的？是不是跟 hr 有见不得人的关系？在以前公司有什么瞠目结舌的黑历史？\n\n如果爆料的东西一定要配文字的话，你的内容（吃瓜群众也很忙的）请一定放在这些足够有爆炸性、反常识、反公德和反私德的事上。\n\n**3，究竟是泄私愤，还是维权**\n\n错误就在此。估摸着是上头了自己完全没想清楚。\n\n泄私愤，搞臭人，请走私下、不可控渠道。\n维权，请走公开的、合法的渠道。\n\n你可以离职之后用个人微博发。这样不耽误你找工作，也十分敞亮。也可以离职后写长邮件发知乎管理层。同样，也可以离职后把各种素材包装起来，私信给各互联网大 V。是要锤够实，肯定能有用。\n\n但用公开的官方账号，就是自己蠢了。\n\n1、账号不是完全自己可控，并且提前暴露了目的（所以快速被删）\n2、给公司留下把柄\n3、本来属于自己的合法利益会因此而损失\n4、给未来找工作带来麻烦\n\n所以，如果要在互联网爆料撕逼，一定搞明白目的是什么。哪些渠道可控，哪些料吃瓜群众喜欢。哪怕被反转，但吃瓜群众在求证的过程中总能发现点什么。你只需要做好渠道的控制，和信息的预埋，就可以完美的对一个人进行爆破清除。\n\n但同时你也会承担一定的风险，看你自己有多咽不下这口气了（互联网机构的法务很倾向于走诽谤诉讼这条路）。\n\n* * *\n\n知乎：\n\n很多人说知乎这个回应很蠢。但我觉得这个回应是在当下**很得当**的。\n\n家丑不可外扬。\n\n处理这种爆料事件最重要的，就是立马截断外界获取料的可能性，所谓截断传播，到此为止。不要再让后续的事情因为新料的产生而做二次传播和发酵。所以知乎官方只字不提任何爆料中的内容。轻描淡写一笔带过就够了。\n\n家里的事，私下关起来讲。哪怕孟女士要因为这个被处罚，但也是私下处罚。凭什么因为被爆料了就要被处罚？那以后知乎官博的不爽了，发个爆料怼周源，那还了得？！\n\n况且了，这事以我的判断，大概率孟女士不会被处罚。否则，招这么一个关键岗位的领导面子怎么挂？签这个招聘命令的HR 面子怎么挂？当时力推 live 商业化战略的高层面子怎么挂？\n\n找来一个中层帮忙执行这种XX战略，人中层卖力艹下属搞业绩的时候，你把人处罚了。公司还开不开了？\n\n* * *\n\n所以看完这出闹剧，估摸着一些大学生觉得义愤填膺，小年轻觉得很爽，纷纷点赞大仇得报。但是觉得爽的兄弟，不妨反思一下，你道行，是不是太浅了？\n\n你们这些小朋友，进了公司，又不会手腕，也不动脑子，只图自己怼的爽，是会被活活玩死的。\n\n> https://www.zhihu.com/question/67883500/answer/257552599",
			"added": 1515333061,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 30,
			"title": "贫富差距 & 价值观撕裂",
			"body": "在我们看来，我们国家政府似乎每天都在做蠢事：电影不分级，瞎XX剪切；没有审美观，瞎XX审核；新闻联播没新闻，每天输出价值观，根本没人看；像个处男一样觉得全世界什么都是敏感词，瞎XX和谐；周小平们那么弱智，瞎XX捧。\n\n仿佛整个国家是由一群弱智在管理，按理说每年那么多人去国考，国家政府里应该全是精英，国家领导人都是清华北大毕业的，不应该比那些学者差啊。\n\n先说一个故事：\n\n我上中学那会儿，每个月要开一次年级大会，老师总要输出一些价值观。\n\n一次年级大会上语文老师讲到以前一位学姐的作文写得特别好，因为她从小是看着《人民日报》认字的。那位德高望重的语文老师把‌‌「人民日报‌‌」几个字咬得特别重，显示出对这位同学的钦佩。显然她希望向我们输出的价值观是基于‌‌「人民日报很牛逼‌‌」的基础上的。\n\n没想到同学们根本不买账，私下里纷纷可怜那位学姐说：‌‌「这学姐意志力真是坚强。‌‌」\n\n老一辈人没办法理解我们为什么对权威的东西那么不屑一顾，我们也不能理解为什么老一辈可以对着人民日报那么无聊的东西一撸一下午，然后还非要让我们学习这种精神。\n\n这是一种巨大的代沟。事实上，这种巨大的价值观差异在中国无处不在。\n\n在知乎上发‌‌「年薪20万活不下了‌‌」的IT民工理解不了平均月收入只有400多的贵州农民是怎么生存下来的，他们是不是真的吃不起茶叶蛋。30岁还觉得自己结婚早了的人不理解那些20岁小孩就能打酱油的夫妻是为了什么。而天天撸动漫的人自然也不懂每天叫着踏平日本岛的愤青是什么心态。\n\n中国已经就‌‌「城乡‌‌/年龄段‌‌/贫富‌‌」几个关键词被撕扯成了很多个群体，这些群体之间的差距已经大到完全没有办法互相理解甚至没办法想象对方生活的地步了。\n\n认识到这点，中国那么多让人费解的问题就能理解了。\n\n我们这些整天上网，知道世界事，读过太多书，每天接受到无数信息的人想要的是言论自由，审查放开，真正放权。但当权的那一批人则不同。\n\n他们大多出生在1940到1960年之间，他们成长成熟的这段时间正好是中国最黑暗的一段时间。在人生最得意的一段时间经历了文革的洗礼，洗去他们身上的文艺细胞，让他们显得强硬又固执——用黄薄码的话来说就是一个个‌‌「直男癌晚期‌‌」。\n\n所谓一朝天子一朝逼格。\n\n所以从小喊着万岁，男女私下接触就会被判流氓罪的他们不能接受和理解那些弹幕上露骨而直接的描写和批判，也不能接受把那些裸露情色的镜头放到大庭广众之下播放。（即使是成年人也不行。）\n\n所以一点点看着中国经济强大起来，体会过中国人民如何从不能解决温饱问题到吃得饱穿得暖居然还买得起小汽车的他们不能理解过得这么舒坦的80，90后一辈为什么不感恩，反而还有那么多不满。而及时感恩的周小平之流自然被他们所推崇。\n\n所以看到文革时候暴民政治是多么可怕的他们根本不相信宪政可以引导民意，实现民主。他们真的相信党可以代表人民的根本利益。更简单的说，精英政治的他们觉得人民都是傻逼。\n\n于是我们经济高速发展但有着这样那样弊端的社会形成了。\n\n中国这几年经济文化发展得都很快。\n\n和几十年都不会有什么大变化的旧社会相比，这种高速发展的社会中，过多的经验其实是有害的。新一辈的人从这种爆炸式的信息更新中学到了比老一辈人多得多的东西，\n\n可怕的是，他们整整一代人都认同这种价值观，特别是中国9亿农村户口，7.5亿农民。在他们那里，新的那些理论是不可想象的。甚至每年春晚出现点‌‌「不和谐‌‌」的东西，全国各地好事老人的信件就像纸片一样向中央飞过去了。为了照顾这些大多数以及别的一些原因，可以说当今这种做法可能是最适合中国的。\n\n这还不是年轻人的时代。\n\n我几年前去边境支教，住老乡家，那地方甚至没有有线电视，快50岁的老两口的电视只能收到几个台，他们说他们就爱看新闻联播，喜欢看祖国是怎么一点点强大起来的。\n\n‌‌「据说你们上海人人都有电脑用了？中国真强大啊！‌‌」那时候我正在喝老乡自己酿的老白酒。而他满脸红光，自豪地说，‌‌「跟着共产党就是好。‌‌」\n\n那一刻我觉得‌‌「中国梦‌‌」绝对不是我们的。至少现在不是我们的。\n\n以后会不会是我们的我不知道，但前段时间看的一句话我觉得很好：无论你承认不承认，祖国可能正在失去这一代年轻人，无论是大陆，台湾，还是香港。\n\nP.S. 我觉得我现在过得很好，我很知足。所以改掉了文中所有会引起‌‌「我比国家更聪明‌‌」错觉的地方\n\nP.P.S. 我文盲",
			"added": 1515334287,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 31,
			"title": "App",
			"body": "最近，工作地所在的园区推出了一款 App，宣传的主要功能是获取园区动态以及扫码付款，感觉这样吃饭可以方便一些，因此就下载了。\n\n应用的名字叫「园圈」，在 App Store 上搜索出来，底下是一个没有见过的开发商。我觉得还算正常吧，一般这种小范围应用，不都是外包的吗。只是，这使我对于这个应用的使用埋下了一丝戒心。（后来我搜索了一下这家公司，网站充斥着强烈的国企风）\n\n进入应用，首先要我注册，这很简单，手机号码验证码啪啪啪就输完了。然后，它要求我输入一个密码。我毫不犹豫地就输入了常用密码，在即将要点下一步的时候，却犹豫了一下。\n\n我在想的是：\n\n    它是一个不知名的小公司\n    它已经知道了我的手机号码\n    它即将要知道我的常用密码\n\n虽然我已经在不知道多少地方用过这个密码，但是这一次我就是不想在这用了。其它很多手机应用，提供了手机号码就会让用户直接登录，然而这个应用却强制要我再填一个密码。这对于它来说太简单了，获得一个用户的手机号以及常用密码，它可以用来做任何事情。并且，更可怕的是，没有人会关注它。\n\n于是我清除输入并换了一组密码。\n\n接下来，它要求我输入一个手势密码。\n\n我从来没有用过手势密码，但它没有提供跳过选项，因此就画了个圈以示敬意。\n\n但是，我想，如果是在其它地方用过手势密码的用户，这里应该是毫不犹豫的吧。虽然得到这个貌似用处并没有像手机号加密码那么明显，但是，不论怎么说，这家公司又获得了一项用户信息。\n\n并且，这个以园区动态发布以及小额支付为主要（或者说唯二）功能的应用，有什么必要同时使用密码与手势密码呢？不得而知。\n\n历尽千辛，终于来到了主界面，界面其实就是支付宝和咸鱼的结合体，没什么特别的。动态都是一些领导视察之类的文章，于是我就点开了「付款」功能。\n\n首先，我要同意一个用户协议。\n\n然后，输入六位数的支付密码。\n\n至此，这是它要求我输入的第三个密码。并且是较为敏感的六位数密码。\n\n这样就很不好了。\n\n然而，不知道为什么，我当时还是如实填写了。\n\n一切都填好以后，我终于可以仔细查看一下它的付款功能。很简单，支付宝或者微信充值，然后二维码扫码支付，却缺少了重要的一项：余额转出。\n\n这真 TM 是一个忧伤的故事，说到底还是跟充饭卡没什么区别，只要你用不完，那么充进去的钱就算是捐了。\n\n唯一的区别是，我向这家公司无偿提供了我的手机号码，以及密码，手势密码以及支付密码。\n\n我突然觉得，这是一波实实在在的送温暖行动。\n\n这让我想起几个月前在一家米粉店付款的时候，我选择使用支付宝，从店家的微信公众号直接跳转到了一个要求输入账号密码的，UI 跟支付宝一模一样的页面。几乎是本能反应的我点了「使用浏览器打开」，果然这不是一个 alipay 域名下的网站。\n\n然而，如果用户不是一个程序员，或者不熟悉互联网的点点滴滴，他有多大几率能注意到并且发现诸如此类的事情呢？\n\n> https://blog.wxsm.space/p/untitled-3",
			"added": 1515335348,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 32,
			"title": "再论推广普通话不应砍尖音",
			"body": "转自湘里妹子学术论坛 来源北大中文 发表者：虎子 发表 2005-12-13\n\n1923 年 8 月，「国语统一筹备会」第五次常年会议，按照「国罗派」学者的单方面的意见，修改了「老国音」，合并了尖团，取消了尖音。八十年来，「新音派」（国罗派及其继承人）学者都为此大唱赞歌，认为是汉语发展的自然规律；而「老音派」学者和广大北方话社区特别是中原地区的老年人却对此痛心疾首，以为是谬种流传，践踏汉语，让炎黄子孙「咬舌子」；推普以来北方话社区的各级各类学校时时在纠正学生「分尖团的语病」，而以京剧界为代表的多种戏曲界「至今讲究尖团音的区别」。在尖团音问题上存在着尖锐的分歧。尖团合流是不是汉语发展的必然规律，有没有人为的因素？以尖团合流的语音为民族共同语的标准音是否科学，对民族共同语的完善和发展有利还是有弊？对此类问题有必要作一番认真的讨论，让国人了解其来龙去脉，分清良莠之后，再决定弃取，才是完善民族共同语的正确途经。**而自推普以来，中国的语言学界把尖团音等有观点分歧的问题当成「敏感」的问题，不准学界讨论，只准批判「分尖团的方言」，不准说分尖团有理**。如此推行愚民政策和语言学理论霸权，不但阻碍了语言学的完善和发展，也阻碍了民族共同语的完善和发展。区别尖团与合并尖团的两种观点和方案，究竟谁是谁非，谁代表着民族共同语发展的方向，谁应当成为民族共同语的标准音？\n\n笔者愿冒天下大不韪作一番剖析，以引起学界的历史反思，尽快纠正尖团合流的语音偏差，挽救濒临毁灭的民族语音的优秀成分。笔者的观点陈述如下：\n\n> http://bbs.cantonese.asia/thread-13897-1-1.html",
			"added": 1515778841,
			"parent_topic_uri": "19_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 34,
			"title": "论坛内的梯子广告很可能是赵家梯，请谨慎使用",
			"body": "",
			"added": 1517799177,
			"parent_topic_uri": "10_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 35,
			"title": "都一样先生",
			"body": "原文地址：http://weibo.com/5174241267/BqgcKlNqa\n\n---\n\n你知道你国最有名的人是谁？\n\n提起此人，人人皆晓，处处闻名。他姓都，名一样，是各省各县各村人氏。你一定见过他，一定听过别人谈起他。都一样先生的名字天天充斥在公共论坛的评论里，因为他是你国人的代表。\n\n都一样先生的相貌都一样。他有一双眼睛，能透过现象看本质；有两只耳朵，一只进水，另一只进面；有鼻子，能把臭味儿自动转化成香气；也有嘴，保证了肠胃的通畅；他的脑袋可真不小，里面满满当当，装的全是辩证法。\n\n他常说：「认真你就输了」\n\n他小的时候，他妈叫他去买红糖，他买了回来白糖。他妈骂他，他摇摇头说：「没什么区别。」\n\n他在学堂的时候，先生问他：「专制和民主哪个好？」他说都一样。先生问为什么？他说：「就算专制，也有民主成分，而民主之专制才是真的专制呢。」先生翘起大拇指，点了三十二个赞。\n\n他最喜欢稳定，最讨厌不同意见，最恨的就是唯恐天下不乱的公知了，每次看到打了鸡血的公知们夸夸其谈，发表治国高论，大言不惭，批判制度问题的时候，就怒从心头起，但作为高素质的人民，他并不恶语相向，最多是发现有人即将被公知蛊惑，才挺身而出，淡淡的轻敲键盘，点拨一二：谁上台都一样。\n\n他周游列国，跑遍了全世界，对社会、政治、文化、历史、法律等都有深刻的见解，是众所周知的聪明人，经常为人民群众指点迷津，保驾护航。看到有批评言论不自由的，他就摆摆手，说：「都一样，外国的媒体也不自由，都是政府亲手掌控的，哪儿能想说啥说啥，那不乱了营了么？您说是不是这个理儿？」；遇到有指责意识形态污染严重的，他就撇撇嘴角，说：「都一样，外国的教育也洗脑，都是为了政权服务，哪儿能撒手不管啊，那不乱了营了么？您说是不是这个理儿？」更有义愤填膺制度腐败的，若是让他碰到了，便浅浅的笑，点上一支烟，说：「都一样，外国的官员也腐败，别赖制度，华尔街的大佬，啧啧，奢华，淫靡，一场货币战争，实现了资本独裁，残酷程度，嗬，可比我们要严重多了。」末了，留下一个思考题——「知道共济会么？」如当头棒喝，将众生从蒙昧中唤醒。\n\n他妹妹在街上摆了个小摊儿，被城管跺了头，他去医院探望，说：「都一样，外国也有暴力执法」；他媳妇怀胎七个月，被计生办的拉去流产，有人通报，他不着急，说「都一样，外国也有计划生育」；他妈在老房子里不肯搬出去，半夜三更被抬出来给扔了，房子也被推平，他知道了，说：「都一样，外国也不允许妨碍公共利益」；他爸去上访，被劳动改造，他去送棉衣，说：「都一样，外国更糟糕，阿桑奇和斯诺登都被通缉了。」\n\n有一天，他出去办事儿，乘地铁，过安检的时候忘了一个包，被警察打了一耳光，路人为他鸣不平，觉得这一耳光不太合适，他立时便恼了，认为人家奚落自己，冲上去就打，一边动手一边大骂：「都一样，要在外国，老早就被爆头了。」有人打架，地铁站里顿时乱作一团，乘客们避之不及，纷纷往外跑，警察从天眼系统里一瞧，哟，这是恐怖分子啊，天罗地网，如临大敌，顺手给了他一枪，立刻就奄奄一息了。都一样先生快要死的时候，家里人问他有什么遗愿，他一口气断断续续地说道：「下辈子想当一头猪，人和猪都…… 都…… 都一样…… 都是吃饭和睡觉…… 做猪烦恼还少一点儿…」说完了这句话，他方才绝气。\n\n他死后，大家都称赞都一样先生样样事情看的透，想的通；大家都说他当小朋友的时候就不爱分对错，成年之后更是只看利弊，真是一位有德行的人。于是大家给了他最高规格的葬礼：挂路灯。还撰写了墓志铭贴在电线杆子上，就在治性病的广告旁边，浓墨重彩的一行大字，写道：生前便已经实现了遗愿的中华第一人。\n\n他的名誉越传越远，越久越大。无数无数的人都学他的榜样。于是人人都成了都一样先生——所以你国就成为现在这个屌样了。",
			"added": 1518792958,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 37,
			"title": "怪名乱神",
			"body": "我想给大家介绍一门语言。\n\nC*。\n\nC* 有什么特点呢？很著名很流行。\n\n我们可以看看 TIOBE Index：到 2017 年 12 月，这门语言的 rating 达到了 30.965% 以上，比 Java，下一个最热的语言，高了一倍有余。\n\n这门语言被广泛使用于各种领域：操作系统（Linux, Windows），分布式（Spark），深度学习（部分 tensorflow），区块链（bitcoin），游戏引擎（Unity）。\n\n...\n\nhttp://127.0.0.1:43110/1DxU6bWh1GfUjtxwaXt87sBjvPHXWo8UWw/?Post:12",
			"added": 1518955570,
			"parent_topic_uri": "19_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 38,
			"title": "【特务无処不在】《当代中国研究》杂志 2009 年被破坏始末",
			"body": "**原《当代中国研究》杂志主编程晓农**\n\n内容简介：\n一、陈一谘与《当代中国研究》杂志\n二、《当代中国研究》杂志获得国内知识界高度认可与赞扬\n三、「六四」文献片成为陈一谘陷人于罪的工具\n四、陈一谘等人葬送《当代中国研究》始末\n五、于大海代表 CMC 起诉我的两起诉案之失败\n六、沉渣泛起\n\n从 1997 年到 2009 年间，在美国普林斯顿出版的《当代中国研究》杂志曾在中国获得巨大反响，深受欢迎。但是，2009 年这份面向国内的杂志遭到破坏，从此国内知识分子失去了一个他们渴望的阅读和写作平台，许多人深敢惋惜。唯惜者虽众，知其中奥秘者甚少。许多人曾经私下或 在网上询问，为什么这个杂志国内再也看不到了。作为主持这家杂志长达 12 年的主编及项目负责人，我亲历了所有的相关事件。2017 年 12 月 22 日，瑞典的茉莉在万维读者网她的博客上发表题为「程晓农在《当代中国研究》的财务黑洞」一文，散布歪曲事实的情节，试图误导舆论。为澄清事实，专此公布该 杂志被破坏过程的主要情节，以便读者们了解真相。\n\n《当代中国研究》杂志项目 2009 年 10 月在美国遭到陈一谘及其同伙李少民、于大海的蓄意破坏，其面向国内的功能因此夭折。那时《当代中国研究》杂志项目经历了陈一谘等人制造的两次危机，陈一谘 等人还用不实指控在美国对我先后提起民事和刑事诉讼。其中民事诉讼一案因我提起反诉，陈一谘等人为避免承担法律责任而弃诉；陈一谘等人告我「贪污」的刑事 诉讼一案由美国国务院总检察官办公室（Office of Inspector General for the U.S. Department of State，简称 OIG）处理。该机构具司法调查权，派员对诉讼文件中所提情节详细调查。最后美国国务院总检察官办公室的调查结论是：程晓农没有欺诈行为，他是无辜的，对 该案的调查因此终止，此讼状不立案。茉莉上述博文提到的涉及财务的情节均已由 OIG 调查过，从中未发现任何问题。这一结果说明，茉莉此文无视唯一的司法调查结论，就某些细节恶意歪曲或掩盖真相，以达到故意误导的目的，涉嫌诬陷。\n\n### 一、陈一谘与《当代中国研究》杂志\n\n陈一谘于 1990 年在美国普林斯顿创建当代中国研究中心（英文全称为 Center for Modern China，简称为 CMC），同年开始印刷《当代中国研究中心论文》小册子，自 1994 年开始，改为《当代中国研究》杂志。1996 年陈一谘在普林斯顿中国学社的访问学者项目结束后迁往纽约居住，此后一直未就业，其生活费用主要取自当代中国研究中心所申请的项目经费。从 1997 年到 2009 年，中心的主要活动以出版《当代中国研究》杂志为主，其资金来自美国国家民主基金会（National Endowment for Democracy，以下简称 NED），我是 NED 资金项目的负责人，承担杂志的所有工作。\n\n2002 年以前，陈一谘控制中心在普林斯顿的银行开设之所有账户。NED 的资金来自国会拨款，受国会和财政部的相关法规约束，NED 详细规定各类支出的数额和标准，其中并没有供陈一谘个人使用的资金。**但从 1997 年到 2001 年陈一谘从 NED 的拨款中非法留下 $38,650 作为私用，占同期 NED 拨款数的 13.8%；此外，从 1997 年到 2001 年，经中心多位董事协助，我为中心共申请到 12.3 万美元的杂志出版资助，这些资金也全被陈一谘个人占用**。（正文内黑体字摘自 2009 年 9 月 1 日我给中心董事会成员的工作报告及 2009 年 9 月 29 日我给中心董事 会成员的财务报告，下文不再就黑体字专作说明）。\n\n陈一谘的上述做法违反了关于财政资金使用的相关法律和 NED 的资金管理规定。我反复要求陈一谘依法管理和使用 NED 的资金，但他拒绝改变上述做法。直到 2001 年 11 月，银行向陈一谘查询其开具的一张支票的真实性，而陈一谘不懂英文，从不答复银行的信函和电话，他要我去银行答复查询，当时银行便要求变更中心的 NED 资金账户的联络人，由陈一谘变更为本人，以保持有效沟通。2002 年 2 月 NED 项目资金的财务年底即将结束，而该财务年度尚有 $15,000 元 NED 的项目拨款留在陈一谘手中，《当代中国研究》项目却因资金短缺而运转受阻。**为避免中心及杂志因陈一谘的上述行为而陷入危机，当时我不得不在银行开设 NED 资金的专用账户，以保证 NED 关于项目资金管理的规定和有关财政资金使用的相关法律得到遵守，并将此事详细函告中心董事长丘宏达教授、陈一谘及若干工作同仁。此后我多次向 NED 申请增加中心的行政管理费（专供陈一谘使用），但每次均被 NED 否决。陈一谘本人也数次向 NED 直接申请资金，从未获准。从 2003 年起，陈一谘要求由他女儿或妻子承担杂志的部分工作，以领取工作报酬（从 2002 年到 2009 年共领取 $58,000），但每年他的女儿或妻子签了工作合同后却从不承担合同规定的工作任务。为维持杂志的正常运转，我不得不请何清涟多年无偿为陈一谘的女儿或妻子完成她们的工作合同规定的任务。**\n\n### 二、《当代中国研究》杂志获得国内知识界高度认可与赞扬\n\n**《当代中国研究》1997 年以前仅在部分留美学生、学者中传播，与国内知识分子无联系，国内读者也看不到。从 1998 年起我在国内发展了多位编委，通过他们的帮助，与国内数百位思想界活跃人士建立了联系。与此同时，我将杂志的国内发行逐步改为国内印刷、就地邮寄，国内发行量因而逐步上升，1 千多所大学图书馆及数百位读者按时收阅，许多大学图书馆和公共图书馆均收藏此刊物并上架开放阅览。此外，国内还有大批读者从杂志的网站上下载往年各期杂志的内容，另有两千人长期订阅其电子版。从 1997 年到 2009 年，《当代中国研究》逐步变成了海外出版的中文学术性刊物中的佼佼者，其高水准在国内和海外得到公认。随着《当代中国研究》在国内的影响日益扩大，NED 也逐步增加资金。2009 年该杂志在国内的影响进一步扩大，国内发行量上升到 2,200 余份，收存该杂志的大学图书馆达 1,490 所。《当代中国研究》2009 年共开设 4 个网站，据网站服务器统计，仅 2009 年 5 月到 7 月《当代中国研究》所刊文章的阅读人次为 29.2 万人，这些网上读者来自世界上 90 多个国家，其中 70.6% 来自中国国内。**\n\n然而，正当该项目处于巅峰时刻，陈一谘及李少民、于大海接连制造了下述两次危机，令《当代中国研究》遭受重创，从此这家学术季刊在国内消失了。\n\n### 三、「六四」文献片成为陈一谘陷人于罪的工具\n\n2007 年陈一谘发起制作纪念天安门事件 20 周年的「六四」文献片，并称他病势日增，这是他生前的最后愿望。**为此我向 NED 申请追加预算，用于制作此文献片，获 NED 批准。从 2008 年冬开始我与几位董事及多位参与者为此片的制作投入了大量精力，到 2009 年春顺利完成了该片的大部分技术制作（包括旁白、配音、配乐、画面剪辑等）。此文献片长约 100 分钟，其中自己采访摄制的部分仅占 20 分钟；其他内容均为港、台、美国、欧洲各电视台的历史资料画面，这些录像由陈一谘提供；他提供这些录像时告知我及制作团队，有一份关于各段录像来源的清单。我于 2009 年 4 月聘请了知识产权律师，准备向各相关电视台申请录像片段的知识产权使用豁免，申请信函业已准备完毕。据知识产权律师介绍，由于我们的文献片用于公益而非盈 利目的，完全可能获得各电视台的授权并免收费用。但是，若未经授权便擅自使用这些历史资料画面，便构成侵权，相关电视台可提出版权诉讼。中心的多位董事都 认为，应按照国际版权公约和相关各国的版权法获得各相关电视台的授权，资金提供方 NED 也是如此要求。但此议遭到陈一谘的坚决反对，他认为该文献片不必遵守知识产权法规，无需获得各电视台的授权，并拒绝提供各电视台录象节目清单，使得申请知识产权授权的工作受阻。**\n\n**在文献片中历史资料画面的版权尚未获得授权的情况下，陈一谘突然通知，他将委托香港某小公司翻制并散发该文献片，理由是「六四」将临，不能拖延。但中心其他多位董事担心，如此做法可能造成侵犯知识产权的事实；一旦发生知识产权诉讼，中心及其法人代表程晓农将面临巨额诉讼费用。**为 避免出现这种可能令中心信誉和财务破产的情况，几位董事反复商量后决定于 2009 年初夏采取两项措施：一方面要求所有参与制片的人不得擅自扩散无版权许可的「六四」文献片半成品；另一方面，时任执行局主席、CMC 法人代表程晓农代表 CMC 向陈一谘发出律师函，要求他以及由他控制的其它机构在未获得各电视台授权的情况下不得使用此文献片的半成品。\n\n以上措施保证了当代中国研究中心以及所有参与制作此片的个人不会因陈一谘擅自翻制该文献片而承担知识产权纠纷可能带来的法律后果。但陈一谘因此对此 文献片再无兴趣。2009 年冬此文献片的所有光碟转交陈一谘时，我已从 CMC 辞职，因此该文献片知识产权的法律责任主体由我变成了他。陈一谘委托一个收费极其昂贵的纽约律师安排交接，特地要求我保证今后不会扩散未获知识产权授权的 这个文献片，以免他承担法律后果。然后，此文献片被陈一谘封存，无论其生前或身后均未问世。陈一谘的这些举动表明，他其实完全清楚此片若未获知识产权授权 便擅自发行、确实可能承担知识产权纠纷带来的法律后果。当 CMC 及其法人代表程晓农通过律师函从陈一谘企图非法翻制并扩散而发生的法律后果中解脱之后，陈一谘既不申请解决此文献片的知识产权授权问题，也不再翻制这部文 献片，最后，这部已经制成的「六四」文献片便在他手中消失了，仿佛从未存在过。\n\n### 四、陈一谘等人葬送《当代中国研究》始末\n\n我对上述文献片危机的处理避免了当代中国研究中心及《当代中国研究》杂志因此事而陷入危机，但陈一谘随即制造了第二个危机，即破坏当代中国研究中心 董事会和执行局的正常管控结构，导致 NED 因此终止对当代中国研究中心的任何资助，《当代中国研究》杂志无法再如常运转。该杂志 2009 年第 3 期当时已印刷完毕，然而，由于陈一谘的破坏行动，国内读者再也看不到了这本杂志了。\n\n2008 年秋，多年任 CMC 董事长的丘宏达教授因病不能工作，陈一谘辞去中心执行局主席和副董事长职务，改任中心董事长，程晓农则改任中心执行局主席（President）和副董事 长。按照中心的法规（bylaw），中心执行局主席是机构的法人代表，负责机构的所有日常事务；董事会集体决定执行局主席的任免，听取其工作汇报，并监督 财务管理；董事长的责任是召集董事会会议。\n\n陈一谘在「六四」文献片问题之后与中心董事李少民一起，在未告知中心董事会的情况下，邀请与《当代中国研究》杂志项目无关的于大海（《北京之春》杂志发行人，也是《北京之春》从 NED 获得资助的项目负责人），介入了当代中国研究中心的内部事务。\n\n由于「六四」文献片一事发生后部分董事会成员尚不了解情况，我于 2009 年 9 月 1 日向所有董事会成员提交了一份关于《当代中国研究》杂志项目多年来的成就和「六四」文献片版权问题上的内部争议问题的工作报告。对此报告中涉及的陈一谘试 图违反知识产权法、可能造成侵害中心权益一事，陈一谘对董事会未作任何解释，却在 9 月 9 日要求董事会解除我的职务。除陈一谘、李少民之外，董事会的其他成员均不赞同陈一谘的提议。于是陈一谘于 9 月 30 日通知董事会所有成员，他个人决定解除我的所有职务。陈一谘的这一要求完全违反当代中国研究中心的章程（by law），依法无效；然而，由于陈一谘将个人凌驾于董事会之上，违法剥夺董事会集体投票、任免执行局主席的法定权力，改由他个人任意操控这个机构的人事， 因此完全破坏了当代中国研究中心这个非盈利机构的法定管控结构。这种局面使得该中心当时失去了获得美国国家民主基金会（NED）资助的合法条件。\n\n陈一谘宣布他对 CMC 实行独裁的两天之后，2009 年 10 月 2 日，美国国家民主基金会正式通知当代中国研究中心的时任和前任董事会成员，鉴于该机构法定管控结构存在的问题，NED 被迫立即中止对当代中国研究中心的资助。面对这一后果，陈一谘坚持己意，完全拒绝其他董事对他的批评和建议。于是有中心的资深董事在董事会内部通信中提 出，该中心当时已无资金来源，徒有其名，不如解散，董事们当自选去留。当时中心共有 13 名董事，在此事件期间，除陈一谘和李少民之外，余英时、丘宏达、苏绍智、黎安友、高英茂、许倬云、程晓农、吴国光、何清涟、洪朝辉等 10 位董事均决定辞职。原本在国内声誉卓著的《当代中国研究》杂志的国内发行就这样被陈一谘等人葬送了。\n\n### 五、于大海代表 CMC 起诉我的两起诉案之失败\n\n我与当代中国研究中心大多数原董事一起被迫辞职后，陈一谘、李少民、于大海采取了一系列诬陷我的行动，包括两次对我提告，但他们以诬陷为目的之诉讼均以失败而告终。\n\n由于陈一谘在 2009 年 9 月 23 日发给部分董事的信中提供了关于中心过去 12 年当中财务管理的不实信息，同时在此信中暴露出他侵吞了以中心名义募得的巨额款项，我于 9 月 29 日向中心董事会提交了一份详细的财务报告，以便董事们了解真相。该报告指出，**按中心的资源来源与资金使用管理的透明度，中心的资金可分三类：第一类完全由陈一谘个人掌控，其来源与用途均属黑箱作业。据陈一谘 9 月 23 日信中透露的信息，他从 1997 年到 2008 年共为中心募得 50 万美元。据我所知，这 50 万美元中，12.3 万属于下述第二类，剩下的 38 万美元之来源、募集时间、使用情形等所有细节，陈一谘既对董事会隐瞒，也对会计隐瞒，自然也未向税务署申报。无论是中心成立以来便担任董事的资深教授们，还是 2008 年底开始担任董事的人，或是中心的会计，无一人此前知道这笔款项的存在。第二类是经中心老董事的帮助、由我申请获得的各种资助，共 12.3 万美元，来源完全透明，但使用不透明，亦由陈一谘个人支配。第三类即 2002 年以后的 NED 资金，由于 NED 实行严格的审计，其资金来源和用途均完全透明。**陈一谘 2008 年底从他长期担任的执行局主席职位上卸任，由我接任，在双方的工作交接中，陈一谘从未告知上述 38 万美元的存在，更未提供相关资金的银行账户资料或财务记录，因此，**我与其他董事一样，不了解其详情，无法向董事会作进一步的说明，只能由陈一谘书面向董事会提交相关的财务报告，以便董事会了解事实真相。**在我提交财务报告的次日，陈一谘的反应是，他个人决定解除我的所有职务。\n\n李少民和于大海对陈一谘涉嫌侵占中心巨额资产的行径佯作不见，完全回避讨论上述第一、第二类资金；同时，针对资金来源和用途均完全透明的第三类资金，反复捏造关于我「贪污」的材料。而他俩的这一做法恰恰是他们所提告的两次试图打击我的诉讼都归于失败的原因。\n\n2010 年 5 月下旬于大海向美国新泽西州高等法院（Supreme Court of New Jersey）提交了针对我的民事诉状，理由是我「侵占」了「23 万多美元」的 NED 资金。该诉状中所谓我「贪污」的「证据」，均基于陈一谘、李少民、于大海对项目资金支出用途的个人猜测，并未与任何收据核对查证，例如，我的工资以及我经 手支出的部分正常项目开支均被他们视为「贪污」，因此诉状中所作判断与事实不符。我的律师仔细研究了相关情形及当代中国研究中心当时的董事会文件（如我提 交的工作报告和财务报告）之后，向控方律师提出了如下问题：第一，此诉状所涉情由发生在 2009 年 10 月之前，而原告代表于大海当时与当代中国研究中心无关，只是个外部人，不可能了解情况，只有陈一谘才是适当的原告；第二，辩方律师的看法是，程晓农没有财 务问题，倒是陈一谘可能涉嫌侵吞当代中国研究中心的资金；第三，辩方将反诉，而根据当代中国研究中心的章程，如果程晓农胜诉，诉讼费用将由当代中国研究中 心（2010 年由于大海代表）承担。控方律师对这些问题的反应颇令人意外，他问辩方律师，「Who is Yizi Chen（谁是陈一谘）?」此外他还请求辩方律师，能否把当代中国研究中心的董事会文件（如我提交的工作报告和财务报告）之英文本送一份给他。看来，为了 保护陈一谘，于大海提起诉讼时将陈一谘排除在外，以至于控方律师根本不知道此诉讼涉及的最重要的当事人是谁；同时，于大海可能只向法院提交了与陈一谘无关 的文件，而我 2009 年提交董事会的工作报告和财务报告都涉及陈一谘，因此控方律师看不到这两份此诉讼中最关键的合法文件。这位控方律师为了解此诉讼的基本背景和最重要的案件 必读材料，不得不再与于大海商量。以后控方律师不再与我的律师联系，此案无疾而终。\n\n于大海在民事诉讼上失败后，陈一谘、李少民和于大海立即转向针对我的刑事诉讼。2010 年 8 月于大海将与民事诉讼内容类似的刑事诉讼提交新泽西州法院，案由仍然是指控我「贪污」。由于他所列内容均系 NED 资金，即美国联邦政府的资金，州法院缺少必要的调查权，因此州法院按司法管辖权将此诉讼直接转给专门处理相关案由的美国国务院总检察官办公室 （Office of Inspector General for the U.S. Department of State，简称 OIG）处理。\n\nOIG 属于美国执法机构的一个重要环节，依法拥有司法调查权，其功能和任务详见该机构网站（[https://oig.state.gov/）。它与州法院的相同](https://oig.state.gov/）。它与州法院的相同) 之处在于，OIG 的总检察官和法官一样，完全独立办案，既不对举报者偏听偏信，也不对被举报者作有罪推定，仅根据事实和法律作裁断。而 OIG 与州法院的不同之处在于，州法院法官会与控辩双方律师沟通，双方进入庭辩；OIG 的检察官虽然鼓励民众举报侵占联邦政府资金的可能情形，不追究不实举报的责任，却不会对举报者通报 OIG 的调查进度或调查结果，一切依法按 OIG 的规则和政策自行处理。\n\n在此案中，OIG 听取了当代中国研究中心若干辞职董事对相关情况的介绍，调取了该中心董事会当时的相关文件和内部通信，以及中心的财务资料、相关的信用卡使用记录；同时， 就数年内该中心银行账户（不包括被陈一谘隐瞒不报的账户）的所有资料、所有用于报销的收据、以及所有支票、现金支出、信用卡支出的合法性，安排专人逐一核 查比对，完成了极为严格的审计。2011 年 12 月，美国国务院总检察官办公室（OIG）作出的调查结论是：程晓农在管理当代中国研究中心（CMC）的项目资金时没有欺诈行为，他是无辜的，对该案的调查 因此终止，此讼状不立案。OIG 的调查结论事实上完全否定了陈一谘、李少民和于大海举报内容的可靠性。\n\n### 六、沉渣泛起\n\n陈一谘、李少民和于大海破坏《当代中国研究》杂志项目一事已于 2009 年 10 月造成即成事实，而他们通过司法途径对我的指控则终于 2011 年底 OIG 的裁决。本文仅陈述此过程中的主要相关事实，也澄清了茉莉的「程晓农在《当代中国研究》的财务黑洞」一文中的无端指责和误导。\n\n唯有茉莉文中所涉我退回顾问费一事，尚需在此稍作说明。这笔顾问费系制作「六四」文献片的工作报酬（包括文献片的制作和英文字幕内容的翻译），在我 从 NED 申请的该文献片专项资金的预算中列有此项开支。由于该文献片申请知识产权一事遭到陈一谘的故意阻挠，耽误了大量时间，为赶在 2009 年「六四」之前完成最后的技术制作，已来不及外聘英文字幕的翻译人员，我只能自己承担此项翻译任务。与文献片相关的工作属于我在《当代中国研究》杂志项目 工作任务之外的额外任务，因此依据 NED 的追加资金项目的列支许可而领取了文献片制作的部分工作报酬。在 OIG 的调查过程中，审查方考虑到我已领取《当代中国研究》杂志项目的工作报酬，不宜再支领这部分文献片的工作报酬，故而我将这部分工作报酬退回。此事与「贪 污」毫无关系。\n\n茉莉对本文上述情节基本上一无所知，其指责基本上与于大海的诉状内容相同。对于大海诉状的司法调查结论既已于 6 年前明确，重新翻出当年被 OIG 否定的指控来误导舆论，实属别有用心的诬陷。茉莉作为一个外国人，对美国的司法系统缺少了解，情有可原。象 OIG 这样的美国执法机构应当如何运作，美国选民可以通过其选区议员提出建议，或向国会提出议案。但茉莉仅仅因为举报者于大海的诉状经 OIG 调查后未被采信，就轻率地否定美国执法机构的公正性及其调查程序、调查结果的正当性，并认定该机构没有司法职能，实属荒唐。\n\n我担任《当代中国研究》杂志主编 12 年，为这个杂志在国内的成功和影响而自豪。2009 年我曾为挽救这个杂志尽了最大的努力，终未成功，此乃本人终身之憾，就此我必须向国内热爱这个杂志的读者们表示歉意，也深为他们失去这个平台而感到悲哀。 从本文介绍的后续事件中读者们想必可以看出，此事件之复杂性远超出人们通常的想象，这篇短文仅能略述一二。\n\n2017 年 12 月 28 日\n\n> http://heqinglian.net/2017/12/28/2009-cmc-crisis\n\n---\n\n## 侧记\n\n**何清涟**\n\n一、程晓农多年来为何没写这段故事？\n二、我与陈一谘打交道亲历的两件事\n三、陈一谘「再回家」治病之路\n四、「铁哥们」何维凌评述陈一谘的用人之道与友道\n五、劫后余感\n\n2009 年 10 月，在中国国内知识界享有盛誉的《当代中国研究》杂志停刊，已经印好的 2009 年秋季号（第三期）成为未发行出去的杂志。同名杂志一年后复刊，只是国内读者再未见过，在他们看来，《当代中国研究》已经「死亡」。\n\n程晓农为这本杂志尽了许多力，花时甚巨，甚至耽误了其博士论文的写作，直至杂志停刊后他才完成论文写作及答辩。这点，竟然被于大海、李少民及茉莉等人用作攻击的口实，太过无聊且无耻。从 1998 年程晓农确定向国内拓展的路线之后，我作为这家杂志在国内拓展的关键人物之一、编委，长期为这个杂志付出大量心力，我认为我有义务写出自己的亲身经历。程晓农在「[《当代中国研究》杂志 2009 年被破坏始末](http://heqinglian.net/2017/12/28/2009-cmc-crisis/)」一文中的陈述，只是那黑幕故事的二、三成而已。作为该事件最深的受害人，程晓农能够将这段经历写得如此波澜不惊，哀而不怨，伤而不怒，是他的修养。\n\n但是，我觉得还有些未尽的话，即使不能一吐为快，我也得写一些出来，以解读者之疑。\n\n### 一、程晓农多年来为何没写这段故事？\n\n《当代中国研究》杂志「死亡」之后，国内多有人向晓农打听此事，每听他在电话里与人谈及此事，我就烦闷。算下来，这些年来，我至少曾有五次非常认真地要求他写出此事经过始末。说「认真」，乃因我写了纸条，上面记有我认为为何必须要写的理由，与他专门抽出时间谈这事。但他都没写。写作此事经过让人不快，并非主要原因，而是外界一直有人在「劝说」（实为阻止）。事件发生之后，体改所的旧同事当中有人劝告，老陈是体改所的创办人、旗帜，如果要写，会伤害体改所的形象，当然也包括很多同事的感情，这些同事都以曾在国家体改所工作过为荣。2014 年，陈一谘死后，又有人来劝说，人死恩怨了，老陈已经走了，天大的过节也揭过去了。再则，老陈在生时你不写，死后才写，就算你写的全是真事，也会有人说你胸怀不宽。其中为难之处，晓农作为当事人，当然比我更能体会。\n\n上述劝说不能说全无道理。20 世纪 80 年代的中国改革，陈一谘确实是位代表人物，这改革又与六四事件相关，更有一层道义色彩。中国人又有为尊者讳的传统。加之民运圈内是非从来不断，不仅将自身，也将外界折磨得精疲力尽。几乎已经没人愿意再听这类纠纷与故事。因此，晓农只好打掉牙齿和血吞，让所有的委屈与愤怒烂在心里。直到 2017 年 12 月茉莉出面，抄录当年于大海的诬告状主要内容，再加上一些自己的评述，写成「程晓农在《当代中国研究》的财务黑洞」，造谣诬蔑。晓农这才动手，将当年的资料全部翻出来，择要写成「《当代中国研究》杂志 2009 年被破坏始末」。\n\n如果体改所的旧同事要因此怪罪程晓农，不如去怪罪陈一谘，以及于大海、茉莉等人。因为让人负屈含冤还要默不作声，在美国 OIG 司法调查作出程晓农无过错结论之后还要继续造谣抹黑，天下没有这道理。\n\n### 二、我与陈一谘打交道亲历的两件事\n\n对于陈一谘，我与他交道甚少。晓农几乎也不多谈陈这个人。晓农为了杂志运作，让我承担了陈一谘先后以女儿与妻子名义承担的工作。本人研究、写作、家务已经累得不可开交，还要为他做这部分工作，而陈视为理所当然，从未表示过谢意。我有时会对晓农发几句牢骚，他总是安抚说：老陈生病，时日不久，你就算帮我的忙吧。我则一忍再忍，前后为陈做义工长达七年。\n\n真正认识到陈的不讲道理，是在 2009 年他设计知识产权陷阱陷害晓农的过程中。为了让晓农承担未获各电视台允许而发行晓农应他反复恳求而主持制作的文献片的法律后果，2009 年 5 月间，他要求晓农去纽约与八位他委托的民运人士会谈。一个人的能力，不在于其拥有多少资源，更体现在其动员资源的能力上。当时接获陈的一位（女）旧部这一电话通知之后，我想起了「虎倒余威在」这句老话。这八位人士，有的我认识，有的我不认识。由于担心晓农个人应付不了这么多人，我以中心董事与杂志编委的身份陪他一道前往。\n\n当我们讲清楚为什么必须要依据美国知识产权法规、在获得各电视台授权之后才能发行这部所谓纪录片。王军涛赞成这样做，认为在美国，必须遵从美国法律。紧接着有个情节可以说明陈一谘的不讲理。他的忠实随从王 SJ 在电话向陈请示后讲了一番话：「老陈说，使用这些电视台的录相不说明来源，是合法的。一位美国资深记者向老陈说了，根据知识产权法律规定，凡电视台制作的片子公开播放三次以上，产权就归社会共有，可以自由使用。」我当时就向这位王先生提出：「既然有这样的法规存在，事情就非常好解决。请老陈将那位记者的电话与电邮告知我们，我们与他联系，向他打听，这条法规在何处可找到。或者，请老陈问好法规出处后告诉我们，以供我们查询。」王再次打电话请示陈，然后告知我们：「老陈说了，美国记者说过的话非常靠得住，不需要查询，纪录片的发行必须由当代中国研究中心负责」。\n\n程晓农是当代研究中心的执行局主席、法人代表，如果有什么知识产权纠纷，自然由程晓农负全部法律责任。中心的经费有限，专款专用，届时连律师费用都将由晓农个人负责。考虑到我们听到的一些消息，在赴纽约与这八位人士见面之前，程晓农及参与纪录片制作的另外两位董事已经做了决定，如果陈一谘一定要坚持在未获各电视台允准的情况下发行这部「纪录片」，我们将通过律师将此纪录片的所有权益移交给当时由陈一谘任法人代表的胡赵基金会或者其他由陈一谘指定的机构。因此，在王 SJ 代表陈一谘表态之后，晓农向王表达了这一共同决定，请他转告陈。八位当中的其他几位，也觉得无可再谈。\n\n这次会面后，表面上安静了三个月左右。八月某日，我突然接到一位董事的电话，说要向晓农转告陈一谘的意见与几条建议。当时晓农不在家，电话由我代接。这位董事转达的意见如下：「程晓农必须就纪录片一事向陈一谘认错，写个认错书，老陈就既往不究了」。我听后当即表示：「这件事情上，错的是陈一谘，不是程晓农。要写认错书，应该是陈一谘，不是程晓农」。这位董事软言劝说：「就写个认错书，大事化小，小事化了。要不然，老陈说要撤销程晓农的当代中国研究主编职务。晓农就委屈求全吧」。我回答说：「撤销程晓农当代中国研究主编职务，应该召开董事会。董事会做出的任何决定，程晓农都会遵守。这事不是由陈一谘个人说了算」。\n\n这位董事继续劝说，提出三条建议：\n\n「一、老陈这个人擅长权力斗争。过去这些年，他想整谁，谁就会倒霉，晓农是斗不过他的，识事务者为俊杰。老陈身体也不好，不能生气，你们就让着老陈，给他一点面子吧。第二，打官司，要花很多钱。你们应该知道，老陈背后有支持，你们那点钱，根本陪不起。第三，老陈的动员能力很强，完全可以发动网络大字报攻势，让你们非常狼狈，到时候你们根本说不清楚。老陈还让我转达，如果程晓农不认错，他一定要将程晓农送进美国的牢房里。」\n\n我当即表示：「正因为陈一谘擅长搞权力斗争，这种别人没有任何错处，但为了老陈的面子也要认错的认错书决不能写，否则就会成为把柄捏在陈的手里，他想整人就拿出来晃一下，不明就里的人还当成真事了。我听说过他擅长整人，也知道他过去在中国，出国后在民运圈的故事，确实是战无不胜。但这是在美国，美国是法治国家，大有美国法律，中有 NED 规则，小有当代中国研究中心的章程。我们就按法律走吧。如果他能证明晓农触犯美国法律，法院判决是什么结果，我们都接受」。\n\n几天以后，有朋友转来陈一谘到处散发的诬陷信。涉及的内容均属捏造。我们当即给陈一谘发函，让他将那封诬陷信直接发给我们，我们将请律师提告。如果不寄给我们，就必须立即停止散发，在 10 月份原定召开的董事会内部讨论。我有一封在董事会内部给陈一谘的公开信，一一驳斥了他的诬陷与不实之词，要求他道歉。其中他诬说我与程晓农开夫妻店牟利，我则将他女儿与妻子的工作合同出示，表明我从未领取他以其女儿与妻子的名义签订工作合同的那部分工作报酬，这部分工作报酬实际上被他长期占用。这一情况，见程晓农「《当代中国研究》杂志 2009 年被破坏始末」。（[http://heqinglian.net/2017/12/28/2009-cmc-crisis/](http://heqinglian.net/2017/12/28/2009-cmc-crisis/)）\n\n这次董事会的情况，晓农在文中已经讲明，但我还想补充一句，那位奉命打电话转述陈一谘意见及建议的董事在退出董事会后对晓农说了一句：「这次是老陈赢了，但赢得身败名裂。」\n\n### 三、陈一谘的「回家」治病之路\n\n海外民运的内斗从未断过。互相攻击的内容主要有两类，一是特务，二是贪污。不少人含冤莫白，成为人生中一大痛事。因此，今年茉莉成为于大海的枪，出面攻击程晓农的「腐败」时，我很庆幸 2009 年做出的选择：从陈一谘构陷开始，每一步都走司法途径。在关于知识产权陷害时，请的是版权律师；在资料交接过程中，由双方律师接洽移交；在应对于大海代表 CMC 提告的两场诉讼中，我们都严格按照司法程序走。于的刑事诉讼移交国务院 OIG，最后，通过 OIG 将近一年半的调查，还了程晓农清白。我当然知道这事让陈一谘极不痛快，据说除了六四之外，陈一谘在权力斗争中很少失败。因此，我猜想，从 OIG 宣布不予立案、程晓农未能如他之愿被「送进美国的牢房」之后，他的心情不会好，这种郁闷会一直持续到 2014 年他死去之时。\n\n我一直想探究陈一谘缘何谋划知识产权陷阱来陷害程晓农在先，继之又动用一切力量，想用构陷与罗织罪名的方式将程晓农「送进监狱」。从私交来说，这么多年来，程晓农为他做了很多事，包括让我义务为其打工以便陈一谘取酬。有人说过，陈一谘这人是政治动物（好听的说法是精于政治谋略），但能够将事情做到这种恶劣的地步，应该另有原因。\n\n当时，有关陈一谘「回国治病」的各种传说沸沸扬扬，有文字为证并且是正面阐述的有这么几篇，按时间先后罗列于下：\n\n《陈一谘拒签「保证书」  斥胡锦涛教条主义》 （博讯北京时间 2009 年 5 月 24 日，[http://www.boxun.com/news/gb/pubvp/2009/05/200905241828.shtml](http://www.boxun.com/news/gb/pubvp/2009/05/200905241828.shtml) ）这篇文章是博讯转载。文章要点是：香港朱耀明等人为海外流亡人士发起一个「我要回家运动」，并拟出版一本以《再回家》为题的书。该书的采访队于 2009 年初到美国洛杉矶探望病中的陈一谘。当时陈透露，他曾透过曾庆红向国家主席胡锦涛转达信函﹐表示希望回国治病。曾庆红知道他病情这么重之后也同意转达﹐药费也可以考虑代为筹谋﹐不过胡锦涛方面其后向陈一咨在北京的女儿表示﹐陈要先写保证书﹐同意不参加治病以外的任何活动才可回国。此后，海外中文媒体也持续以此为报道主题，比如自由亚洲电台曾发表《洛民运界促当局允陈一谘返国求医》（自由亚洲电台记者萧融，2009 年 11 月 5 日，[http://www.rfa.org/mandarin/yataibaodao/chen-11052009095227.html](http://www.rfa.org/mandarin/yataibaodao/chen-11052009095227.html)）\n\n我们关注到这类消息，多少也有点理解为什么会发生 2009 年《当代中国研究》杂志被破坏事件。但想归想，却不想就这事公开谈论。「哀兵必胜」，一个昔年的改革重镇级人物、如今 70 多岁且身负重病，希望回国治疗，并希望当局解决昂贵的医药费用，不管怎样，其情可悯。但我们不谈，别人会猜测，为了维护陈一谘的「改革重镇」之光辉形象，在陈生命最后几年，与陈同居一城、往还甚密的草庵居士写了一篇《关于陈一咨先生申请回国治病一事的澄清》（独立评论，2014 年 4 月 17 日，[http://www.duping.net/XHC/show.php?bbs=11&post=1302221](http://www.duping.net/XHC/show.php?bbs=11&post=1302221) ，草庵居士文章中用的是陈一咨，为不发生混乱，我统统改成陈一谘），概述了 2007 年陈一谘患病之后申请回国治病的一些情况：「2008 年，陈先生的中国一些故旧部下计划之中国北京或上海为陈先生寻找一个可以安身治病的优美之地，同时方便采取中医治疗」，该文附有陈一谘写给中国国家主席胡锦涛的签名信（经晓农查对，签名出自陈手），以及陈一谘「写给曾庆红先生的信件原件（与本文无关的部分有删节）」。草庵还说，「曾庆红签署意见请胡锦涛考虑安排陈一咨回国治疗事宜。习近平未做任何意见签署，但对转送此信的本居士原部下夏 X 龙带来口信，如果（政治局）公开讨论，不会反对，可以根据情况尽量安排资金和医生。」\n\n草庵在该文最后结尾声明：「在此过程中，陈一谘先生从未因为期望返国治病而写过任何有辱自身人格的悔过书，更未为了回国治疗而放弃原则祈求任何人，更未从事所谓的为了自己的性命而出卖台湾及美国利益」。其中，独独没有提到《当代中国研究》杂志被破坏一事。也许，作为当代中国研究中心及《当代中国研究》杂志的创办人，陈一谘从未将这个中心与这本杂志当作社会公器，而视之为私家领地。在陈一谘申请回国养病的同一年，他亲手毁坏这本由程晓农苦心主办了 12 年的杂志，似乎是抱着梁武帝的心情。公元 549 年，建康城被攻破，梁武帝被囚于台城。面对国灭身囚之境，梁武帝完全无视黎民百姓的生死哀痛，只是漠然地说了一句，「天下自我得之，自我失之，亦复何恨？」\n\n### 四、「铁哥们」何维凌评述陈一谘的用人之道与友道\n\n陈一谘在 2009 年破坏当代中国研究杂志的行为实在不堪。但我毕竟是学者，一生阅历可算丰富，知道人在得志与没落时的表现不会一样，但本性却不会大变。也因此，我后来很关心陈一谘当年的朋友、旧部对陈的公开评价。各种私下评价虽然很多，但只要没写成文字，我都忽略不计，也不会在此文中引用。一位朋友为晓农寄来了一本《传说中的何维凌手稿》（香港大风出版社，2015 年出版，以下简称《何维凌手稿》），算是让我了解了陈一谘青壮年时期的为人处世。\n\n经历过 20 世纪 80 年代改革时代且与京城多少有些联系的人，大都会知道何维凌这个多少有点神秘色彩的人物。他的神秘来自于他是邓小平长公子邓朴方的密友，他的重要在于两点，一是他利用这邓公子这一特殊关系，为中青年改革者们与体制内高层的沟通起了重要桥梁作用；二是在于他是京城中青年改革派的一个灵魂人物。他担任过走向未来丛书的编委，其一生事业与陈一谘交叉之处甚多。这本传说中的遗稿，由其朋友黄晓京整理，另一朋友王小强在香港的大风出版社出版，其前妻秦燕亲笔书写《何维凌生死书》为序，真实性不容怀疑。全书涉及陈一谘的笔墨甚多，通篇看完，何维凌对陈一谘的能力、开创性都有较高评价，但也不回避他的性格弱点。其中我注意到与陈一谘「友道」有关的两段话：\n\n一段出现在《何维凌手稿》第 13 章（第 239 页 - 240 页），这一章几乎是为陈一谘开辟的专章。何维凌谈到，「谘先生有收拢人才的真本领」，在「拢人的时候 ，他真能做到礼贤下士，也真能做到待人宽以约。然而，一旦拢过来了，关系近了，成了圈内人了，就立即出现了反比效应。看别人的缺点过多，察得细、察得紧，……」，「以察察之明待之，不仅起不了关心的效果，而且会造成误解乃至反感。王彦经常说：『老陈就是爱搞远交近攻，谁跟他越近，对他越好，就越得不到好果子吃』。也确实大致如此。特别是在谘先生一帆风顺的时候。」\n\n另一段出现在该书最终篇第 25 章（第 502 页）。这章的主题是回忆京城中青年改革派聚散离合中的合与斗：「中国人喜欢聚，但一聚就斗，斗了必然散，散了又想聚，聚了还得斗，如此循环往复，乃致无穷。」整篇文字不免沧桑之感，但写得克制。只是写到陈一谘，何维凌还是忍不住要说道几句：「陈一谘大概早就想通了，他认为人的一生，朋友是经常要更换的。早年文革中一位与他生死与共的战友樊立勤，对这个观点，大不以为然。…… 樊立勤曾就此劝我，慎重择友；但我却当作耳旁风。」\n\n我看到这些话，忍不住划上红道让晓农观看，问他认不认识王彦与樊立勤，或者听到过陈的老友对陈的类似评价。但晓农与陈在国内的关系就是普通上下级关系，没有任何私人交往，陈一谘是中国经济体制改革研究所所长，程晓农是该所综合研究室主任，他不认识陈的这些老朋友（他们自称为「老八队」成员，仿李自成义军的称呼），他当然也无从听到这些考评。\n\n### 五、劫后余感\n\n《当代中国研究》杂志 2009 年被破坏这一事件，所涉及的当然不止晓农文中所述的人与事，我们不仅眼看着一棵亲手浇灌的小树在硕果累累时被拦腰砍伐，还要承受各种精神压力与诉讼负担。但即使在茉莉那篇严重歪曲事实的「财务黑洞」发表之后，晓农仍然坚持只在讲述中谈及与财务相关的事情，以及事情相关的结果，其余的人与事均不再涉及。我充分理解这一点，董事们大都是体面人，被迫搅在这件极不体面的事情中，已经很感委屈了。但我还是想说一句，在这场风波中卷入很深的除了于大海、李少民之外，还有那么一位复旦校友，一篇文章都没编过，却迅速地挂上陈一谘封赏的《当代中国研究》杂志副主编头衔，以此名义到处招摇。不幸的是，在这位人士的利用价值丧失之后，他被该中心现任负责人踢出门外。这位人士曾私下向晓农两次道歉。但我认为，这种丧失原则、唯利是图的人不值得为友。\n\n民运中内斗不断是常事，我作为旁观者都深感疲累。在此郑重向海外民运人士认真建议：今后凡涉及所谓「腐败」指控时，如果有可能，建议他们走司法途径解决，以免背上不明不白的污名。回溯 20 世纪中国的政治史，这种内斗，几乎是中国政治活动尤其是中共及中共体制培养的政治反对活动中的常青戏码。韦君宜女士晚年反思自己一生革命经历，在《思痛录》增订版「结语」中痛陈：「还有不能忘记也不能释怀的是：也不知有多少革命者受到莫大冤屈，遭受自己人带给他们的多少磨难，因而后悔走上所谓革命道路。参加革命之后，竟使我时时面临是否还要做一个正直的人的选择。这使我对于『革命』的伤心远过于为个人命运的伤心。」中共革命的参加与支持者，与中共政权培养的不少反对者，是精神特质上的同构物。我与晓农对此深有同感：只要我们还在坚持对中共的批评，来自所谓昔日「同道」的伤害，几乎就是我们在海外生活的宿命。\n\n1940 年代出生的人，无论在朝在野，基本都退出中国的舞台中心；1950 年代出生的人，也行将退出这个嘈杂不堪的舞台。但愿这两个年代的人，除了进行内斗之外，还能留下更多的正面遗产。\n\n> http://heqinglian.net/2017/12/29/2009-cmc-crisis-2",
			"added": 1520859093,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 39,
			"title": "当代中国大灾难的开端：反右运动",
			"body": "## 一、当代中国四大灾难\n\n8 年抗日战争和 3 年国共内战之后，中国人民渴望一个安居乐业的和平建设时期。可是，在毛泽东独揽大权的「人民共和国」，人民得不到喘息的机会。内战结束后不到一年，就参加了朝鲜战争。随后在国内每年都开展一次甚至两次整人的政治运动。如 1951 年电影《武训传》的批判，1951~52 年「三反、五反」运动和知识分子思想改造运动，1953 年俞平伯《红楼梦》研究的批判，1954 年胡适思想的批判，1955 年「胡风反革命集团」的批判和「肃反运动」。所谓「胡风反革命集团」，是毛泽东一手制造的冤案，波及 2,000 多人。我因 1952 年介绍胡风朋友方然入党而受到历时一年的批判和停职审查。\n\n1956 年是难得的平静的一年。这要归功于赫鲁晓夫在苏共 20 大所作的揭露斯大林罪行的秘密报告。关于斯大林个人迷信及其恶果的揭露，震撼了所有由共产党专政的国家，毛泽东不得不暂时有所收敛。但一年后他即疯狂反扑，发动了以打击知识分子为主要目标的反右运动（即反右派斗争），把当时全国 500 万知识分子中的 11%（55 万）打成「反党反社会主义」的「右派分子」。「右派分子」属于「阶级敌人」，「专政对象」。实际上当时被打成右派的，不止 55 万人，而是 100 万人左右。由于反右运动后期，中共中央作出决定：在小学教师和乡镇干部中不划右派，那些已划为「右派」的，改划成「地主」或「坏分子」，他们以后的遭遇比右派还要惨。他们的总人数估计约 50 万人。在一次运动中把全国 20% 的知识分子定为「敌人」，这是史无前例的大灾难。\n\n不仅如此，由于反右运动前后毛泽东使尽阴谋诡计，「反右」胜利后又冲昏头脑，自诩为暴君秦始皇，自己坑的儒比秦始皇多一百倍。于是是非、真假完全颠倒，谎话、假话满天飞，人人在谎言中生活。毛泽东更是在谎言中自我膨胀，反右尚未结束，就提出「超英赶美」的「大跃进」，幻想 3 年实现共产主义，结果饿死了 4,000 万人，造成了又一个史无前例的大灾难。\n\n为医治由「大跃进」所引发的三年大饥荒，在 1962 年七千人大会上，一向逢迎毛泽东并被指定为接班人的刘少奇说了一句「三年困难」是由于「三分天灾，七分人祸」。毛泽东由此认定刘是睡在身边的赫鲁晓夫。经过 4 年的精心策划，于 1966 年发动了打倒「走资本主义道路当权派」的「无产阶级文化大革命」。这场以「除四旧」、打杀中学校长开始的十年浩劫，是中华民族最荒唐而血腥的大灾难，最后也葬送了毛泽东的神话。\n\n承袭毛泽东衣钵的邓小平，对直接伤害他的文化大革命当然完全否定，但对他自己负执行总责的反右运动（当时他是中共中央总书记），却断言「是完全正确和必要的」。并于 1981 年 9 月作过如此危言：目前形势比 1957 年还严重，知识分子要向我们夺权！显然他是想再搞一次反右运动，可惜力不从心，只能每隔一年搞一次冷冷清清的反对「资产阶级自由化」或「清除精神污染」的运动。1989 年 4 月，因反自由化不力而被他罢黜的胡耀邦含冤去世，几十万学生到天安门广场悼念，称胡耀邦为「中国魂」，招致邓小平忌恨，扬言要以「流血」来镇压。结果就是 6.4 大屠杀。这是邓小平继毛泽东之后所创造的第四个史无前例的大灾难。\n\n纵观四次大灾难，后面三次与第一次反右灾难都有因果关系，因此，要了解和研究当代中国的历史，反右运动史应该是关键。\n\n## 二、毛泽东为什么要发动反右运动？\n\n在毛泽东心目中，具有独立思想的知识分子是妨碍他统治的祸患，但国家建设又离不开知识，于是建国伊始就发动改造知识分子运动，要把他们改造成驯服工具。对那些他认为不完全驯服的人，就飨以铁拳。反右运动就是这样发生的。其根源在于毛泽东敌视知识分子的心态。对于这个问题，王来棣 2003 年的论文《一贯敌视知识分子的毛泽东》进行了全面系统的分析，此处介绍两个令人瞠目结舌的史实。\n\n在国共合作时期的 1925 年，任国民党宣传部代理部长的毛泽东，发表论文《中国社会各阶级的分析》，把受过高等教育的知识分子，一部分定为「极端的反革命派」，大部分定为「半反革命派」。此文同时在 3 个刊物上刊出，并出过单行本。1951 年出版《毛泽东选集》时，此文是开篇，但文字删去近半，上述这些话全不见了，却又加上原文所没有的「工业无产阶级是我们革命的领导力量」。这一公然伪造历史的铁证，以前未引起学界注意，连王若水的《新发现的毛泽东》也未发现。\n\n1957 年 7 月 7 日，毛泽东沉醉于反右运动的胜利，在上海接见 30 多位文教工商界人士。翻译家罗稷南壮着胆问毛泽东：要是鲁迅今天还活着，他会怎么样？毛泽东回答：「鲁迅么──要么被关在牢里继续写他的，要么一句话也不说。」这个曾被毛泽东赞誉为「文化新军的最伟大和最勇敢的棋手」的鲁迅，在 1957 年必然也会成为右派，并且还要坐牢！\n\n## 三、毛泽东是怎样发动反右运动的？\n\n这个问题，在 1977 年出版的《毛泽东选集》第五卷的 1957 年 1 月《在省市自治区党委书记会议上的讲话》中可以找到基本答案。请听：\n\n「苏共『二十大』的台风一刮，中国也有那么一些蚂蚁出洞。」「党内外那些捧波、匈事件的人捧得好呀！开口波兹南，闭口匈牙利。这一下就露出头来了，蚂蚁出洞了，乌龟王八都出来了。」「在一些教授中，也有各种怪议论，不要共产党呀，共产党领导不了他呀，社会主义不好呀，如此等等。他们有这么一些思想，过去没有讲，百家争鸣，让他们讲，这些话就出来了。」「他们不搞什么大民主，不到处贴标语，还不晓得他们想干什么。他们一搞大民主，尾巴就被抓住了。匈牙利事件的一个好处，就是把我们中国的这些蚂蚁引出了洞。」\n\n为了引蚂蚁出洞（以后改称「引蛇出洞」），毛泽东于 1956 年 4 月提出「百花齐放、百家争鸣」（即「双百」）方针。一个月后，我还听到中宣部长陆定一向知识界的报告。他强调，要贯彻「双百」方针，必须「有独立思考的自由，…… 有发表自己的意见、坚持自己的意见和保留自己的意见的自由」，「有宣传唯心论的自由」。我都信以为真，并深受鼓舞，以为中国的思想自由、学术繁荣的黄金时代即将来临。\n\n可是毛泽东 1957 年 1 月的这篇讲话中，向党内高级干部泄露了天机：\n\n「康德和黑格尔的书，孔子和蒋介石的书，这些反面的东西，需要读一读。」「毒草，非马克思主义和反马克思主义的东西，只能处在被统治的地位。」\n\n「百家」中马克思主义以外的 99 家，原来都必须臣服于马克思主义的「统治」，这算什么「争鸣」？所谓争鸣，要不是滑稽双簧的闹剧，就是冒出洞来遭诛灭。\n\n为了巧设诱敌深入的圈套，2 月 27 日毛泽东在最高国务会议上作了关于人民内部矛盾问题的历时 4 小时的讲话，给人一个假象：经历肃反运动后，靠工资生活的工作人员，都是自己人，可以享有人民的自由权利，可以自由地鸣放。随后又召开了历时 8 天的全国宣传工作会议。会议期间，他召开了 5 次各界知识分子的座谈会，并对全体作了一次长篇讲话，反复重申人民内部矛盾讲话的精神。最后提出共产党准备整风，恳切地希望党外人士提批评意见，即所谓「整风鸣放」。\n\n3 月 17 日，毛泽东启程去杭州。路过天津、济南、南京、上海时，他都召集当地干部讲话，交代鸣放政策的底细。4 月 27 日，中共中央发出开展整风运动的指示。\n\n为了显示请党外人士帮助共产党整风的「诚意」，毛泽东于 4 月 30 日又召开了一次最高国务会议，抛出不少诱人的钓饵，如说「教授治校恐怕有道理」。但附和这一意见的人，40 天后统统被打成右派。\n\n经毛泽东和全党组织「诚恳」的动员，并在「言者无罪」的保证下，鸣放开始了。党报天天整版刊载对共产党的批评意见。不到半个月，毛泽东向党内中层以上干部打招呼，通报 4 个月前向高级干部部署的计划，用一个障人耳目的题目《事情正在起变化》，说即将可以「聚而歼之」了。他自欺欺人地斥责「右派猖狂进攻」，并估计：「右派大约占 1%、3%、5% 到 10%，依情况而不同。」\n\n6 月 8 日，反右斗争终于出笼了，《人民日报》发表了一篇假惺惺的社论《这是为什么？》\n\n这对于沉浸于由「双百」方针产生黄金时代的幻想之中的我来说，是一个晴天霹雳。我无法容忍这种背信弃义的行为，公开反对反右运动，于是成为科学院第一个受全院批判的右派，后被定为「极右分子」，回老家当了 20 年农民。\n\n## 四、反右运动的恶果\n\n反右运动，策划准备了 5 个月，正式演出了 10 个月。正式定为右派的 55 万人，占当时知识分子总数的 11%，超额完成了毛泽东估计的 10% 的指标。实际上当时被划为右派的大约比此数多一倍，只因为小学教师和乡镇干部中的右派改称为「坏分子」或「地主」。\n\n由于共产党的株连政策，一个人被划为右派，全家和所有亲属都连带遭殃。我的妻子就被开除党籍，控制使用；弟弟也被划为右派；一个哥哥被撤销公职；高中毕业的侄儿不准考大学。以此类推，反右运动受害者至少 500 万。\n\n为了处置右派，毛泽东创立了劳动教养制度，不经法律程序，可以随意剥夺公民的人身自由，进行无限期关押，并强迫劳动。大饥荒年代，各地劳教所都有人饿死。例如 1960 年甘肃省酒泉县的夹边沟农场 2,400 名右派饿死了 1,300 人。\n\n除了对右派及其亲属进行非人的精神摧残和人身摧残以外，反右运动另一个恶果是，摧毁了人类文明赖以生存的道德准则，毒害了全国人民。精于权术诡计的毛泽东，用信誓旦旦的许诺和甜言蜜语引诱「鸣放」，即所谓引蛇（或蚂蚁）出洞，然后聚而歼之。他得意地称为「阳谋」，实际上是最卑鄙阴险的阴谋。他为自己的胜利而陶醉，得意忘形，毫无顾忌地兜出自己丑恶的暴君心态。他自称是马克思加秦始皇，甚至炫耀自己比秦始皇还凶残一百倍。不仅如此，他还公然挑战人类的良心，说什么对待资产阶级，良心还是少些好。这无异于供认，他策划的反右运动，就是昧着良心干的阴谋。在他的怂恿和威逼利诱下，背信弃义成为时尚，说假话受奖，说真话遭罪。整个社会道德沦丧，是非颠倒，黑白混淆，良心被鄙弃，人性遭践踏，是人类历史上一次罕见的精神浩劫。\n\n反右运动所导致的不讲诚信，好说假话、空话、大话的风气，造成随后「大跃进」中的神话：「人有多大胆，地有多大产」；亩产几十万斤的「卫星田」；三年实现共产主义！这类自欺欺人的谎言，「文革」中又以另一种形式出现。因此可以说，「大跃进」和「文化大革命」都是反右运动的恶果。\n\n## 五、关于 20 年前的「反右运动历史学术讨论会」\n\n最近读到何家栋 2006 年 6~7 月间写的遗稿《刘宾雁与共产党》（《开放》杂志 2006 年 12 月号），其中谈到：「反右 20 年纪念活动的事。这事刘宾雁做得不好。他未找我商量，由他和许良英、方励之和我四个人发起」。又说，「他要出去采访，回来再把我们的发起信拿来你签名，我也答应了。可是宾雁（？）又把这事告诉钱伟长了，又邀请钱伟长来参加发起这个活动。」读后感到十分意外和诧异，有必要对事实作个澄清。\n\n何家栋文中所谓「反右 20 年纪念活动」显然是指 1986 年 11 月我们发起的「反右运动历史学术讨论会」。这个设想是方励之首先提出来的。他想与我、刘宾雁三人共同发起。1986 年 11 月 14 日方励之夫妇和刘宾雁来我家聚会，讨论此事。我与方、刘都有将近 10 年的交往。会上刘宾雁并未提出要请何家栋参加发起，而且那时我和方励之对何家栋并不了解，即使刘宾雁提出来，我们也未必会同意，因为我们并不是想搞一般的纪念活动，而是要开一个学术讨论会，邀请参加者都要求有一定的学术水平。3 年后，我与何家栋在一次会上第一次见面，他告诉我，1986 年刘宾雁曾要他编一本右派回忆录。很可能，他把这两件事记混了。\n\n至于钱伟长，刘宾雁并不熟悉，而我在 1953 年就认识，方励之对他也很熟悉。刘宾雁不可能找他谈这个讨论会的事。我们 3 人在讨论邀请名单时就有他的名字。参加会议的通知是我邮寄给他的。想不到他出卖了我们。作为奖赏，邓小平赐给他全国政协副主席的官位。\n\n这里不妨顺便说明一下，1987 年 1 月随着胡耀邦被迫下台，方励之、刘宾雁都被开除党籍，我为何得以幸免。\n\n1986 年 12 月，合肥、武汉、上海、杭州、南京、北京相继出现学生上街要求民主的游行，当局认为是受了方励之的影响。12 月 30 日上午，邓小平召胡耀邦、赵紫阳、胡启立等人训话，严厉批评胡耀邦反对自由化和制止学潮不力。当他批评方励之的「自由化」言论时，赵紫阳插话：方励之和刘宾雁、王若望要开反右 30 周年纪念大会。于是邓说，要把这 3 人立即开除出党。赵紫阳把我误为王若望，把「历史学术讨论会」误为纪念大会。方、刘、王 3 人受公开批判时，官方都为各人印发了言论摘编。《刘宾雁言论摘编》中最后一篇竟是《许良英、刘宾雁、方励之发起召开「反右运动历史学术讨论会」通知》全文。要刘宾雁对这个会负主要责任，实在冤枉。因为这件事是方励之创意的，通知也由他执笔；3 人名字的排序又以我在先；而刘宾雁已在中途宣布退出。在邓小平宣布开除方、刘、王 3 人党籍后，还准备再开除 10 人，王震在中央党校宣布了。这 10 人中，我首当其冲。大概由于赵紫阳发了善心，我们得以暂时幸免。\n\n许良英\n2007 年 5 月 11 日\n\n> http://xu-liangying.hxwk.org/2013/04/12/%E5%BD%93%E4%BB%A3%E4%B8%AD%E5%9B%BD%E5%A4%A7%E7%81%BE%E9%9A%BE%E7%9A%84%E5%BC%80%E7%AB%AF%EF%BC%9A%E5%8F%8D%E5%8F%B3%E8%BF%90%E5%8A%A8%E2%94%80%E2%94%80%E7%BA%AA%E5%BF%B5%E5%8F%8D%E5%8F%B350%E5%91%A8",
			"added": 1520862145,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 40,
			"title": "袁世凯为什么想当皇帝？采访手记",
			"body": "袁世凯在中国历史中创造了诸多第一，然而，人们对他的荣辱功过各有评说，有人说他是「独夫民贼」、「窃国大盗」，也有人认为他是中国真正的改革家。他为何要当皇帝呢？一个记者的「手记」曝光了鲜为人知的往事。\n\n这篇关于袁世凯为什么当皇帝的始末的历史文章——《「我为什么想当皇帝」——袁世凯采访手记》，在 2004 年就曾广泛传播，近期又开始在网上流传开来。\n\n不过，这篇文章明显是托古之作。\n\n该文的作者在文章的结尾揭开了谜底，交代了文章的真实性。作者没有说文章纯属虚构，而是说，在采访的前一天，袁世凯去世了。也就是说，记者的采访是在袁世凯死后的第二天。由此可以看出，这是作者故意虚构的文章。\n\n以下为原文。\n\n---\n\n他明显老了，一脸的倦容，坐在太师椅上慢慢地摇晃。睁眼看到我的时候，有些突然和尴尬。屋子里灯光柔和但是有点灰暗，依稀能看到椅子上的龙垫和龙套，墙头上挂的精致的军刀。他穿的是青色丝绸长袍。1916 年 6 月，在北京东城的一个胡同的深宅大院里，我采访中华民国第一任总统，洪宪王朝的第一位君主。\n\n他其实已经在等我的到来。早就听说袁对美国记者彬彬有礼，我还是小心翼翼地开始了我们的对话，请问怎么称呼您，皇上、陛下还是袁大总统？此时袁世凯称帝一事已经举国哗然，两个多月前被迫退位。他是河南人，在北京居住也很多年，看得出他听到我的一口京腔京韵的中文，脸上掠过一丝不易觉察的惊讶。「什么总统、皇上的，现在一介平民，就叫我老袁吧。」\n\n我的时间有限，直接切入了正题。「现在再看恢复帝制一事，如果时间能倒流，你还会再做同样的决定吗？」袁世凯一声长叹，「这事没干好，一失足成千古恨……」想继续说下去却半晌无语，他努力控制着自己的情绪，眼睛还是忍不住开始有点湿润了。这正是一个将流芳百世的采访需要的情绪和气氛，但我不能让他失控，开始引导他：「为什么会想到恢复帝制，大总统不已经能号令天下了吗？」袁有点激动了：「他们都说这是民心所向，说中国国情适合君主制，说是为了中国的稳定和长治久安……」\n\n我问：他们是谁？袁伸出他的手指，「全国各地的劝进请愿团，包括『各省公民请愿团』、『军警请愿团』、『商会请愿团』、『人力车夫请愿团』、『孔社请愿团』、『女子请愿团』，甚至『乞丐请愿团』、『妓女请愿团』等等，不一而足。这些『请愿团』都是一致要求『君主立宪，恢复帝制』。不仅如此，为劝进而成立的『筹安会』，请愿团还成立『全国请愿联合会』。一时间，各种请愿团云集北京，齐集新华门外，跪呈劝进表，请求我『俯顺民意，早正大位』」。袁说到激动处，「连美国哥伦比亚大学法学博士古德诺写了一篇题名为《共和与君主论》的文章，登载在美国《亚细亚日报》上，强调中国人只宜『君主立宪』。」\n\n说到民意，我问他平常看哪些报纸。「有三四份报纸，主要是《顺天时报》。」我追问那你读到的民意是什么？袁有一声长叹：「克定害我…… 他自掏腰包购买报纸印刷设备，每天按照《顺天时报》的固定格式印制一份「宫廷版」《顺天时报》，把反对帝制的言论一律改为歌功颂德，让我读着高兴。直到有一天我家的丫头到外面买零食五香蚕豆，用整张真版《顺天时报》包着带回来，被三女儿袁静雪发现，这张前几天的报纸和他们平时所看到的《顺天时报》的文章调子不同，赶忙找到同一天的报纸来查对，结果大吃一惊。两张报纸的日期虽然相同，而内容却有很多都不一样。」\n\n当记者多年，这是我第一次听说新闻传播业历史上只有一个读者的报纸，为中国人的创造性吃惊。我好奇地问后来呢。「袁静雪觉得很奇怪，便去找二哥袁克文问是怎么回事。袁克文早就看见了和家里不同《顺天时报》了，只是不敢说破，并鼓动袁静雪去跟我说。袁静雪把真的《顺天时报》拿给我看，我气得吐血，用皮鞭将袁克定痛打一顿。」\n\n我仍然不明白，既然知道真相，为什么不改变做法呢？袁说：「都到那个份儿上了，中国的事情你还不太明白，这生米已经煮成了半熟饭，这让我这个大总统也一定要煮下去。再说了，有反对意见其实也不奇怪，还有那么多支持者呢。中国的事情，是没做成时，很多人都反对，做成功了，大家就都赞成了。」1915 年 12 月，众院以 1,993 票全数无异议通过袁世凯当皇帝。于是，袁世凯在 1916 年的元旦，穿上了龙袍，册封了他的 9 个姨太太为后、嫔、妃，接受了百官「三呼万岁」的朝贺，把民国五年改为「洪宪元年」，当上了「洪宪皇帝」。\n\n我问他当了皇帝之后，有哪些事情意想不到？袁的脸看着由灰变黑，然后变青，嘴唇有些颤抖，「没有想到全国各地的劝进声变成了声讨和反对，我最亲信的参谋长陈宦最先在四川宣布独立，接着湖南汤芗铭独立…… 克定害我，克定害我！」\n\n这是袁世凯对他的大太子袁克定的第三次斥责了。「为什么袁克定是帝制最积极的拥戴者？」「是因为他想继位当皇帝。」我听得目瞪口呆，这中国深不可测的宫廷政治原来有些道理如此浅显，浅显得吓人。\n\n我看着这个只有五十多岁却显得垂垂老矣的中国政治领袖的眼睛，「你怎么评价自己的历史地位？」\n\n「李鸿章死后，朝纲崩弛。我是体制内渐进改革的领军人物，支持地方自治和君主立宪，任内阁总理而统领新政，既得到国内改革派康有为、梁启超、严复、章太炎等人的支持，也赢得了西方的普遍支持。在我的倡导下，清廷颁布了『预备立宪先行厘定官制谕』。一场声势浩大的立宪运动在全国兴起，各地纷纷成立民间的立宪团体，向民众普及宪政知识和敦促政府加快立宪进程，为后来建立民国做了良好的准备。如果我的新政渐进改革，不被体制内的保守派与体制外的激进的学生和知识份子合力夹击所中断，中国早就实现现代化了。」\n\n他的脸上露出了光芒，「即便后来革命党闹事，我是中国终结满清王朝，开辟共和的开国总统啊。从清末到民初，尤其是北洋政府时期，推行经济、政治、外交、文化等政策，与时俱进。兴学重教，开通民智，对教育的重视和投入，前无古人。正是由于政治上的宽松政策，陈独秀、李大钊、胡适、鲁迅等一批新文化大师才脱颖而出；蔡元培成功地改造了北京大学；邵飘萍、黄远庸两大新闻巨擘一则则独家新闻、一篇篇时论文章众口交传；报刊如雨后春笋般涌现，中国出现了前所未有的言论出版结社自由。」我翻阅过去的报纸杂志，舆论确实普遍评论袁有驾驭复杂国际国内局势的能力。\n\n袁越来越兴奋，仿佛这不是采访，而是美国的总统竞选演说。袁世凯也不象全是自吹自擂，我的同事《纽约时报》记者汤玛斯 F 米拉德于 1908 年 4 月采访了他，在汤玛斯的眼中，袁世凯「虽然不是清国的改革之父，但他能让改革继续进行下去。袁世凯是中国改革总设计师李鸿章的最佳传人，一直负责推动整个大清国的现代化进程」，是少数可以左右李鸿章之后的大变局、带领中国走向现代化的政治人物。他「素质全面」，具有「异常才智」且「野心勃勃」，善于利用政治时机并有能力把自己推上最高权力的宝座；他吸取了中日战争和义和团式反西方的教训，主张尽量寻求西方国家对中国的支持和谅解，以便推动改革。\n\n我没有打断他，等他停下来，我问他：「那二十一条呢？」他的声音明显提高好几度，「那二十一条，我不签字，也有别人签字。再说签字与不签字，日本人亡我之心都不死，路人皆知，以它的实力强行索要，谁能挡得住吗？这只是缓兵之计而已，这个国家就是我的，我为什么要卖？」\n\n为了避免他失控，我把话题叉开，在问他怎么评价中美关系？袁表现出强烈的亲美倾向：「美国一直是大清国的朋友，从未错过任何机会以无私的方式表示出这一点，我们更加信任美国。因为美国一直对东方国家非常友好，从未显示过哪怕是轻微的军事部署要去攻击它们。大清国如果遭遇国家主权和领土完整的严峻时刻，我们抗争会期待并信赖美国能够为保护我们的权利而在国际上善施影响。中美关系之重要这在门户开放政策中如此，日清战争中如此，在未来也会如此。」\n\n「您对中国未来改革开放的前途怎么看？」他看上去不愿意触及这个伤心的话题，袁世凯作为体制内渐进改革的头面人物，推动的是允许进步分子在维护皇权的前提下适当采取些行动的改革，并反对引起新旧体制的决定性对抗的措施。当谈到中国民众对民主制度的态度时，袁世凯说：「我们的管理体制必须从根本上加以改革，但说起来容易做起来难啊。因为它牵涉诸多因素盘根错节。如果给我时间再加上机遇，我能够实现改革的大部分目标，当前压倒一切的是稳定问题，没有稳定就什么也谈不上。」\n\n我又回到他的名声和地位问题，引用了民间报纸的评论：「报纸上说，你当上大总统之后，暗杀宋教仁、操纵国会、媒体、法院和选举…… 干尽下流勾当；你的称帝为自己留下了千古骂名，更遗留下军阀可能混战的局面，使中国现代化进程崩溃…… 面对这些指责，你的回答是什么？」。我已经做好准备看到他的爆发。没想到他却平淡地笑了笑。\n\n「我比赵匡胤、朱元璋还是差一点啊，」他端过茶杯细细喝了一口。「在中国谁不想当皇帝呢？过去的人想当皇帝，现在的人想当皇帝，未来的人还会想当皇帝的，你还年青，可以观察中国的未来，不信就等着看吧。你刚才看到我哭了，我不是哭做错了决定，而是哭这事干砸了。中国有着出产皇帝的肥沃的土壤，天天以揣摩上意见风使舵谋生的寄生虫满地都是？『十三太保』里边有个声称最具理想色彩的杨度，称帝一事还没谱呢，不是也已经把自己想成新朝宰相赶着在巴黎定做大礼服吗？我只要使个眼色，杨度就网罗名流组织『国体研究学术团体』，到全国请愿联合会。再看看那 20 省区军事首长，个个都通电『速正大位』。看看冯国璋那段词儿了：您老功德巍巍，群情望治，到了天与人归的时候，只怕要推也推不掉的啊！中国有的是这等人才啊。」\n\n「那个反贼孙文，自己当总统的时候，就要总统制，我当总统的时候，就要实施内阁制。他还远未成气候的时候，就要人宣誓向他个人效忠。他也就是这辈子没有真正掌握过权力，要掌握了大权，一样是个想当皇帝的主。」\n\n袁显然是说到了兴头上，忘记了这是采访，他继续滔滔不绝地不容我打断。「我不就杀了个宋教仁吗，他还是个娃娃，三十二岁，去了几天日本，研究了几天宪政就觉得了不起，他懂个屁啊。现在批评的人多一点，都是那报纸杂志惹的祸，培养出一些自以为是，知识越多越反动的人。要是我称帝成功了，只需要一两代人的努力，就能把中国重新建设成一个文盲国家。我还是心慈手软了点，原来想杀鸡给猴看，吓唬一下其他人。我要是狠点，把他们全弄到北京，一网打尽。」\n\n「现在这些人骂我，要是我招安了各省将军，各地诸侯，一个一个杯酒释兵权，马放南山；到那时候，每杀一个人，都有全国人民给我叫好，对我佩服得五体投地，现在杀人是独夫民贼，那时候杀人就是伟大领袖。我们这个文化就兴这个，我也没办法。」\n\n我原来以为很了解中国哲学，这下又被中国文化的博大精深再一次弄糊涂了，我问他：你曾经说「天下最愚蠢的事情，莫过于做皇帝」,「万一有人要逼迫我，我就出国到伦敦，从此不问国事」。袁世凯笑了笑，「嘿，这话是说给愚民百姓的，说说而已，中国的四万万愚夫愚妇会当真，你怎么当真了！」\n\n袁世凯于 1916 年 6 月 6 日去世了，也就是在接受我采访前一天。他给我留下精明但和蔼的领袖印象，多少年过去了，还能看到他隐隐约约的身影，总觉得他还活在中国人中间。",
			"added": 1520862280,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 41,
			"title": "生于0715：中国大物理（天涯论坛版）",
			"body": "从结构上，《中国大物理》主要分为四部分：\n\n### 第一篇 大物理序幕（已经贴完）\n\n从经济变化和社会心理两方面，对「大物理」之前的社会经济表象进行总结和分析\n\n### 第二篇 大物理基础机制\n\n主要包括三部分：\n第一章 社会基础模式——论述人类社会与自然环境之间的关系\n第二章 中国communist模式和发展——总结1949年前communist发展的关键原因\n第三章 communist经济结构——对communist社会进行总结，对比不同的communist级别形式，总结communist的根本原理\n\n### 第三篇 大物理的演变方向\n\n主要包括三部分：\n第一章 前30年的进程（1949年后）\n第二章 后30年的进程\n第三章 「大机器」与社会系统状况\n\n### 第四篇 大物理的发生模式\n\n主要包括三部分：\n第一章 大物理的社会准备\n第二章 大物理的城市模式\n第三章 大物理的农村模式\n\n---\n\nhttp://127.0.0.1:43110/1DxU6bWh1GfUjtxwaXt87sBjvPHXWo8UWw/doc/34260/1.txt\nhttp://127.0.0.1:43110/1DxU6bWh1GfUjtxwaXt87sBjvPHXWo8UWw/doc/34260/2.txt\nhttp://127.0.0.1:43110/1DxU6bWh1GfUjtxwaXt87sBjvPHXWo8UWw/doc/34260/3.txt\nhttp://127.0.0.1:43110/1DxU6bWh1GfUjtxwaXt87sBjvPHXWo8UWw/doc/34260/4.txt",
			"added": 1521219947,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 42,
			"title": "言论管制与中共溃败",
			"body": "2013 下半年开始，中国的言论管制急剧加强，日益严厉。这个行为表明中共已经溃败，需要言论管制保持所谓的稳定。但是由于中国经济的特点，言论管制效果有限，中共溃败不可阻挡，且全面加速。\n\n共产主义是自身毁灭型的全民奴隶制经济机制。共产党的主要特点是高喊自由平等民主人权等口号，吸引广大希望不劳而获的民众支持，获得统治权力；进而建立一系列共产主义经济系统，实施现代的全民奴隶制经济，为共产党统治集团的利益服务。由于奴隶制经济的净产出能力低，同时共产党集团群体的物质消耗高，导致经济入不敷出。共产党集团为了自身生存，在面临经济困难时，以毁灭社会价值和竭泽而渔方式，进一步加大对于社会经济的压榨。随着社会经济枯竭时，民众日益穷困，共产党集团开始遭遇生存危机。为了维持自身统治，共产党集团实施一系列瘦身措施，减少经济消耗，并且加强谎言宣传，尤其是强化言论管制。共产中国是共产经济的代表，是实施价值毁灭的典型。2008 年后，中国进入最后的疯狂，在表面经济数字一枝独秀的下面，中国的清洁水源、宜耕土地、资源矿产和人力资源加速毁灭性消耗。随后，中国开始衰竭性崩溃，反过来推动经济崩溃，中共进入新的危机阶段。（详细机理分析参见我的著述《中国大物理》）\n\n暴力和谎言是两个主要基石，支持共产党起家，并且维持其统治。其中，暴力是后盾，强化共产党自身的力量，支持共产党对社会的掠夺，实现共产党集团的经济利益。谎言则弱化社会的抵抗意识和能力，引导民众顺从甚至支持共产党集团的掠夺行为。谎言的维持需要两方面的工作：1、掌控宣传洗脑机器，包括中共的洗脑机构（大中小学等等）和喉舌机构（文化宣传机构），以对民众灌输对共产党的恐惧感，而且极力鼓吹正面信息（正能量），制造欢乐祥和、稳定安宁的氛围，让民众喜迎和支持掠夺，或者情绪稳定地接受掠夺；2、实施言论管制，淡化或者防止真实信息暴露，重点防止经济真相的暴露，尤其严防人们认识共产党的虚弱本质，也就是所谓的负面信息（负能量）。其中，言论管制是维持统治的关键，是共产党极为关注和警惕的部分。一般来说，共产党暴力越强的时候，对于维护谎言的要求较低，言论也相对宽松；反之，当共产党较弱时，需要加强谎言宣传，更需要实施言论管制。\n\n当中共陷入危机时，首先实施言论管制。一般来说，言论管制可以总结为两步：先封口，再灭口。言论管制的作用在于通过对被管制者封口，强化自身的道德优势地位，更方便使用暴力；同时削弱被管制者的抵抗心理，甚至摧毁被管制者的心理，使被管制者束手待毙，进而对被管制者灭口。其中，毛泽东最善于使用言论管制，通过管制强化自己的地位，保证自身的生存。\n\n在抗日时期的延安，中共将自己宣传成为抗日圣地，完全平等的理想场所，吸引大量知识分子和学生到延安。但是在延安，在物质条件非常差、严重男多女少的情况下，中共领导集团既不缺吃穿，又不缺女人。王实味作为中共的理论家之一，在当时的刊物《野百合花》中批评共产等级制度「衣分三色，食分五等」，尤其指向毛泽东生活特殊。王实味批评中共不顾抗日的艰难境况，而且和中共自身宣传的完全平等脱节，引起其他知识分子和学生的共鸣和仿效。开始中共还试图辩解，说是中共革命的需要，但是被动辩解的效果不佳，知识分子对中共和毛的质疑日益增加。后来，中共采取主动出击的方式，在延安整风的时候，将王实味打成反革命，托派奸细。当时，有人找到毛，要毛手下留情，毛态度极为激烈，要求对方不得插手。在将王实味关押数年后，最终秘密处死。在打倒和关押王实味后，敢于批评的声音消失，延安重回纯洁圣地的形象。在大多数国统区知识分子的宣传和支持下，延安一方面吹捧美国的民主自由，另一方面抨击国民政府的独裁腐败，成为中国大多数民众盼望的大救星，并在苏联指挥和美国支持下，成功统治中国大陆。\n\n另外，言论管制也是在经济转差时，中共内部斗争的关键手段。在 1949 年后，毛通过言论管制，成功发动一次次的大清洗，打垮竞争对手，在斗争中生存下来。1957 年，毛故技重施，开始要求知识分子大鸣大放，对中共提出批评；随后立即变成引蛇出洞，随即进反右，对知识分子抓关杀，消灭所有反对的声音。到 1959 年，大饥荒开始，成批饿死人的情况出现。但是多地官员投毛所好，给毛耗巨资建造大量行宫。大饥荒扩散到全国后，毛号称不再吃红烧肉，和中国人民共度困难，被广泛宣传。当然，毛根据医嘱，已经改吃鱼虾和西餐。这时候，毛的饮食改变没人会提起，因为知情者为了防止自己被灭口，乖乖自我封口。\n\n通过言论管制，毛泽东在中国民众心目中的红太阳形象树立。毛纠集刘少奇、林彪等人打倒彭德怀；随后发动文化大革命，与周恩来、林彪等人，共同打倒刘少奇；再与周恩来一道，消灭林彪。在一系列运动过程中，毛充分利用言论管制的优势，没人敢于从言论上与毛进行抗衡。尤其是在文革开始时，毛背负着大跃进和大饥荒的责任，而且整个中国经济陷入困境，还被中共的官僚集团很大程度孤立。毛自己跳出来，亲自写大字报，变被动为主动，发动文化大革命，砸烂公检法。因为毛在言论管制后，掌控话语权，而官僚系统无法从言论上回击，结果很快溃败。在随后的十年中，大部分中共官僚机构被废弃，多波中共军队将帅和部下遭到清洗和下放，同时大量年轻人上山下乡、去修理地球。这些行为都有效保障毛系和周系的庞大消耗，同时降低中共系统的消耗，并且通过斗争瓦解民众的反抗能力，保持中共的生存。\n\n1990 年代后，中共逐渐实施关键信息管制，非关键内容放开的模式。例如，关键信息包括 64 屠杀、各种中央集权的经济政策、教育医疗养老住房等甩包袱政策、还有农业税及相关抗暴事件等。这些信息反映江朱上台的基础，增强中共体制经济的关键措施，以及中共利益集团的关键获利模式。通过关键信息管制，以及长期的宣传洗脑灌输，绝大多数年轻人都不了解中共经济实质，积极支持中共统治。人们按照中共的指挥开展经济生活，成为血汗工厂经济的主要支持者。例如，80 后群体具有上学缴费、毕业不包分配、高价买房、缴纳高额社保和个税、社保养老无望等经历，但是仍然对未来充满希望，积极上学买房交税。另外，由于非关键信息放开，社会中很多表面和细枝末节问题暴露，让人们感觉到社会中有很多坏人。由于 80 后的群体懦弱和依赖心理，以及不了解经济系统的真实信息，因此将愤怒迁怒于各种表面现象上和坏人身上。\n\n中共利用 80 后群体的心理，引导民众对于坏人的愤怒。80 后群体自己无法解决或者不敢面对这些坏人，所以更希望政府出面解决，更依赖中共统治。在很多情况下，问题直接指向中共的地方势力，民众对地方政府和官员失去希望，甚至恨之入骨。于是民众更希望依靠中央，觉得中央是好人，地方是坏人，渴望中央的英明领导给自己做主，解决地方的坏人。在这样的社会环境下，出现一批小骂大帮忙的表演经济学家和所谓的公知。表面上在指出缺点问题，甚至指责很尖锐，但是给出的答案都是依靠政府。如果是地方政府的问题，就要希望中央政府开恩，惩治地方政府。例如，柴静号称自费拍摄《穹顶之下》，在强调一些地方和行业的坏人造成雾霾后，结果要求大家「从我做起」减少雾霾，以及拨打电话 12360 请求政府解决。这种表述模式迎合民众的心理，因此迅速走红，柴静也被看作英雄。\n\n表面开明的关键信息管制极大支持中共经济统治。从 1990 年代中后期开始，中共全面实施血汗工厂政策，通过血汗工厂出口、引入外资和政府投资等手段，支持经济运转，度过中共生存危机。尤其在中国加入 WTO 之后，血汗出口和外资进入规模急剧扩大，进一步支持中共的强大。在这样的背景下，各级学校和报纸电视全面宣传中共成就，让人们感觉到中国经济在经历盛世。在社会和网络上，小骂大帮忙的公知们虽然指出问题，但是让人觉得这个社会并不完美，还有很多问题需要解决。但是，人们看到公知们提出来的问题，觉得属于发展中的问题，最后会解决。结果是，绝大多数人完全支持中国经济，或者相信主流是好的。\n\n在整个社会中，即使少数人明白中共的整体系统运作，但是由于宣传洗脑机构都掌控在中共手中，再加上关键信息管制，无法对真实情况大范围传播。这些人的认识只能在小圈子中传播，对中共统治毫无影响，还能够给很多人以中国具有言论自由的印象。而且，由于绝大多数人只看到短期的收益，只相信眼前能够赚到的钱。即使告诉人们真相，绝大多数人也没有兴趣听，因为有这个时间还不如想办法赚钱。\n\n从 2013 年开始，中共的言论管制急剧加强。习作为毛时代出生和成长起来的人，出于对毛的崇拜，自然习惯地采取各种毛的做法。其中一个关键做法就是通过媒体造势，以和蔼亲民的形象出现，随后开始树立自己的地位，希望能够达到毛的地位和威望。同时，习看到西方自由思想对权威地位的影响，自然极为敌视自由思想。在习上台后不久，开始认识到一个关键问题，就是他得到地位和可掌控的利益完全不匹配。习自己亲口说：「容易的、皆大欢喜的改革已经完成了，好吃的肉都吃掉了，剩下的都是难啃的硬骨头」。所以，习要通过打老虎，把饭碗和肉都抢过来。在这样的导向下，言论管制急剧加强，媒体态度明显变得严厉。在言论一边倒的情况下，先是一堆苍蝇被打，随后一只只大老虎被揪出，毫无抵抗之力。\n\n不论打苍蝇，还是揪出大老虎，民众看到的都是巨额财产被抄。一个体制内的小官员，就可以在家里藏匿上亿元现金；涉及到大老虎，家中甚至可以成为藏宝库。中共在国内外的喉舌机构也开足马力，一步步按照领导意图，适时透露下一只老虎是谁，有什么问题。在严厉的言论管制下，喉舌机构只能引导民众注意具体的坏人大老虎贪了多少钱，有多么可恶，应该严厉处理。同时，严厉禁止讨论：为什么苍蝇成堆，而连苍蝇都可以成为亿万富翁；更重要的是，大老虎成群，每个人甚至比和绅贪的都多？为什么贪腐的苍蝇老虎能够如此猖獗，根本问题到底出在哪里？\n\n其实，只需要稍微延伸一下就知道，史无前例的贪腐源于史无前例的共产经济系统。如果想彻底打掉这些老虎苍蝇，并且消灭其生存的土壤，只有消灭共产经济。但是，如果让民众讨论到经济系统的问题，中共等于自掘坟墓，习也跟着被埋葬。所以，必须通过加强言论管制，只准讨论老虎苍蝇是坏人，让民众对这些坏人愤怒，将问题都集中到坏人身上；同时，强调打老虎苍蝇的习是英明领袖，民众的大救星，让民众充满感谢感恩之情。\n\n不过，由于中国的整体经济模式的改变，言论管制的作用基本失效。言论管制只是系统操作中的一个环节，必须依靠整个经济系统生存。在经济模式已经改变的环境下，虽然言论管制的操作者们一厢情愿，希望按照过去的模式生存，但是因为与系统不匹配，难以达到预期目的。而且，言论管制越严厉，表面上负面信息被过滤，实际上反而说明中共正在全面快速走向崩溃。这样的情况如同刻舟求剑，时间和地点都变了，船已经不是从前的船，结果也不可能是从前的结果。\n\n只有在封闭系统中，言论管制才能起到作用。言论先于行动，并且是行动的指导。如果想让一个社会中，所有人都发出相同的声音，进而形成相同的行动，首先要将整个社会封闭起来。改革开放前，中共的系统是有进无出，通过暴力保障。不论周恩来对顾顺章一家灭门，毛泽东三湾改编，中共苏区和延安，还是 1949 年之后的中国大陆，都实施封闭系统管制，并对离开中共系统的人采取致命的暴力措施。尤其在 1949 年之后，采取完全的闭关锁国模式。\n\n当大量知识分子响应中共的号召，从美国回到中国大陆，希望参加中共的建设，这时候中共是开放的。但是，这些人回到大陆后，遇到被打倒、被迫害的情况，再想出国，就没门。这些人只能在国内，接受批判、酷刑、或者在夹皮沟被饿死。在封闭系统中，当一部分人被弄死后，另一部分人为了活命，或者为了家人不被灭门，只敢对中共歌功颂德，完全拥护中共的各种决策（包括迫害和弄死自己的决策）。\n\n当人们从言论上都拥护决策时，言论的力量就变成行动的力量。暴力在言论的支持下，很顺利地实施。例如，在造反有理，革命无罪的口号下，各地公然打砸抢活动。而且，这些行动受到言论的支持和进一步鼓励，暴力得到进一步加强，对整个内部清洗和打击。\n\n当言论管制失去暴力支持，就变成空洞的声音。暴力只适用于封闭系统之内，难以超出封闭系统之外。当言论失去系统内部的暴力支持，不论人们如何叫嚣，言论多么恶毒，都像是只会叫的狗，对外部的人不会起到作用。例如，在朝鲜战争中，共死亡数十万到一百万左右的精锐部队。后来，虽然中共一直叫嚣美国是纸老虎，但是不敢再与美军正面交锋。而且，美军高空侦察机无数次入侵中共领空的过程，中共无数次的抗议和警告，丝毫不影响美军在大陆高空侦查，即使中共一直宣传，敌人在一天天烂下去，我们在一天天好起来。\n\n而且，中共一直在号称打击美帝霸权，并且准备解放处于水深火热中的美国人民。但是，美帝并没有受到这些言论的影响，仍然是世界头号强国，美帝的人民也没有得到中共的解放。倒是中国在宣传中，从胜利走向胜利后，突然有一天说，经济已经处于崩溃的边缘，不得不实施改革开放。\n\n在改革开放之后，暴力界限变得隐形化。中共为了吸引外国资金来支持中国经济，积极请外国人到中国。当外国人进入中国后，中共暴力不仅不敢针对外国人，而且还保护外国人。虽然中共一直在国内媒体上，挑动民众仇美仇日的氛围，但是对美日等外国人仍然享受超国民待遇。日本人在中国旅游的时候丢了自行车，整个警局出动找回自行车。中共煽动民众反日游行，支持反日的人砸日本产品店、砸日本汽车时，也将财产关系区分的非常清楚。打砸日货的人群，都是喊着口号，破坏中国平民的日本品牌产品。当这些人看到日货的警车，立即转过脸去，就好像没看到一样。而且，真碰到日本人财产，只要有个警察给日本人站岗，或者打砸的人知道是日本人的财产，财产就不会遭到破坏。这种砸车时的不同待遇，反映言论背后的暴力界限。\n\n即使在中国，由于改革开放，过去以国界为主的显形暴力界限，变成以国籍为导向的隐形暴力界限。中国大陆国籍的人，因为受到暴力管辖，必须接受言论管制，也得接受言论引导的暴力危害。中国欢迎的美日德等大国的国民和财产，因为拥有美日德等国的后盾，在中国的暴力系统下，也拥有特殊的保护。\n\n随着中共实施更严厉的言论管制，等于对世界表明中国更加封闭。江朱时代开始的言论管制，适应中国改革开放后的隐形暴力区隔，既能够达到言论管制的目的，又能够给外国资金以开放的假象。由于外国资金对开放的印象，较为放心地对中国进行投资。但是，习上台后，采取类似于毛时代的模式，试图回到毛时代的言论管制模式。而且，言论管制模式不仅仅涉及到言论本身，更开始对言论系统改造。\n\n在对互联网的言论控制上，一方面形成压倒性的舆论环境，不仅随时删除所谓负能量信息，而且开始在全国高校大规模动员，扩展 5 毛大军宣传所谓的正能量。另一方面，管制延伸到大规模屏蔽国外网站，逐渐建立封闭的大局域网。很多人因为与国外的沟通被屏蔽，而导致经济往来受阻、经济利益受损。越来越多的人意识到，中国重新开始闭关锁国的模式，不仅仅在思想上的封闭，还包括经济上的封闭。\n\n由于中国经济严重对外依赖，言论管制引发国外舆论的强烈反弹。在改革改革开放后，中共是对外经济的主要既得利益者，通过持续加强出口和吸引外资，中共的统治才得以延续。而严厉的言论管制和大局域网的发展，等于阻断中共自身的经济命脉。虽然习近平因为红小兵出身，希望通过毛式言论管控和偶像地位，实现自己的利益目标；但是相当一部分中共内部的既得利益者，看到严厉管制的危害，对未来的形势忧心忡忡。不过，由于习对既得利益集团的攻势，让既得利益集团难以在国内发出声音。但是，在国外媒体上，既得利益集团没有有效表达了自己的声音。例如，沈大伟作为中共在美国的传声筒，长期为中共歌功颂德的美国大五毛，也开始高唱中国崩溃论。\n\n沈大伟的突然转向反映出，其代表的中共内部既得利益集团已经极为恐慌，通过沈大伟来表达最高程度的危机感。由于沈大伟身在美国，而且在华盛顿有较大的影响力，中共言论管制对沈大伟不起作用。对于资深大五毛沈大伟的突然反水，中共积极在中国国内发表文章驳斥，同时组织喉舌式专家与沈大伟对垒，但是明显不如反水的沈大伟更可信。\n\n在经济开放的环境下，言论管制实质上失效。言论管制的根本作用在于，通过统一社会言论，规范社会中大多数人的思想，通过消灭一部分人，减少部分经济消耗。但是，在经济开放的环境下，无法通过言论管制而减少经济消耗。首先，外资企业虽然数量少，但是在中国经济中占据相当份额。虽然外资无法在社会中发出声音，但是中共的舆论宣传和言论管制也无进入外资企业。外资企业按照自己的分析和判断说话，并且采取相应的行动。一旦言论管制进一步严厉，促使外资企业大规模撤退，中国经济直接崩溃，这是中共无法承受的结果。而且，即使在外资没有撤退的时候，也采取对中共越来越强硬的立场。例如，Google、微软和火狐浏览器几乎同时决定，不承认 CNNIC 的安全认证，就是对中共的有力打击。\n\n其次，中共内部既得利益集团虽然表面沉默，但是在私下积极活动。在封闭环境下，当毛发动文化大革命，对以刘少奇为代表的官僚系统反扑时，刘失去说话的机会就等于失去生命。但是在经济开放的环境中，当既得利益集团受到打压后，已经做好了两手准备：一是在国外建立经济基础，家人已经安然在国外降落，自己也敢于到时候放手一搏；二是利用国外的基地，随时反扑，让一边倒的言论随时失效。例如，郭文贵与胡舒立的争执，本来是媒体一边倒批斗郭文贵的模式，进而准备深入打击郭文贵依附的势力。但是身在美国的郭文贵发声，与胡舒立针锋相对，变成互咬的乱局。这种境外反击让初始的言论攻势完全失效，最初的言论优势方甚至可能引火烧身。\n\n言论管制失效的背后，是开放经济条件下的利益流失。在封闭环境中，中共通过言论调动底层民众（穷人），参与到瓜分和消灭有钱人的行动中。其中，言论掌控者获得主要利益，穷人们跟着中共起哄后，短期获得精神快感。中共从最初开始打土豪分田地，到最近的反腐行动，都是同样的模式。不过，由于经济开放的基本模式，反腐的经济效果已经大打折扣。\n\n在中共打土豪的封闭经济中，中共通过掘地三尺的手段，将地主家的金银全部收缴。而在最近的反腐行动中，收缴大量现金和藏品，也都主要针对封闭思维的个人，将大量财物藏在家中。反腐针对这些人，也获得相应的收益。但是在中共内部，更多的人已经将大部分资产转移到国外，无法通过反腐的方式从这些人身上获利。其中，少部分人在国外还握有各种证据，保持对中共的威慑力，保证自身的生命和财产安全。从这个角度来说，不论言论还是反腐行为，只能加速一些人加快将资产向国外转移的速度，让中共经济更加困难。\n\n所以，中共的言论管制看上去似乎日益严厉，但只是能够覆盖穷人阶层。同时，最有钱的外企依靠母国的力量和自身的经济实力，可以隔离言论管制，随时向外转移资产。同时，在体制内的既得利益者群体中，一部分思维开放，随时将自己的财产向国外转移。对于这些人来说，言论管制越言论，意味着内部斗争越激烈，他们的财产转移也越坚决。个人即使被卷入体制内的斗争，只要财产在国外，家人可以在国外享福。如果有机会，自己也可以随时出逃，和家人团聚。\n\n最根本的是，言论管制已经无法约束主要的目标群体。任何一个政策的有效实施，都必须有明确的目标群体。言论管制的主要目标群体是知识分子，防止知识分子群体产生和散步不利于暴力统治者的言论。平民阶层一般不关注言论，主要关注实实在在的好处。有的平民即使想表达自己的想法，也往往因为缺乏表达能力，而有话说不出。有的人即使能够说话、说的很好，但是因为不在知识分子圈内，无法享受知识分子之间相互吹捧的扩散效应，说了话也没人听。\n\n中国知识分子群体以无神论为主，普遍特点是见利忘义，贪婪加懦弱。在北洋政府和蒋中正时期，高薪供养着这些知识分子，给这些人足够的说话空间，这些知识分子反而以各种方式攻击北洋和蒋中正。同时，中共对知识分子采取极为严厉苛刻的手段，王实味说几句不中听的话，就被直接处决，知识分子反而在国统区为中共唱赞歌。等到国民党大势已去，蒋派飞机专门接知识分子到台湾，知识分子们还希望迎接中共，获得更大的利益，能够进政府分羹，基本都坚决留在大陆。\n\n1949 年后，中共统治大陆，大量知识分子偷窃美国技术，回到大陆报效中共。没想到，中共除了放过最无耻的郭沫若和钱学森等少数人做牌坊之外，剩下的都送去牛棚、扫厕所、夹皮沟和其它劳改营。很多在三年大饥荒没有饿死的人们，到了文革被批斗而死。曾经最效忠中共、给中共做了大量工作的吴晗，到后来也被批的最臭、最惨。活下来的一部分人，在改革开放后，对中共的提高知识分子待遇感激涕零，齐声赞扬党的政策好。同时，知识分子痛批毛的各种迫害手段，显得自己是受害者。在封闭环境下，知识分子们在被批斗的时候懦弱地接受中共改造，在得到一些利益后又向周围宣扬中共的好处，在不同时期都表现出中共的英明正确。\n\n进入 21 世纪，当江朱提出三个代表之后，无数在国外留学的人们再一次感觉到发财的机会，为自己可能获得的利益欢欣鼓舞。这些人了解中共历史，而且目睹中共的各种邪恶行为，但仍然为中共唱赞歌，吸引更多的外资进入中国，支持中共的统治，自己也期望从中得利。\n\n随着言论管制日益严厉，中国知识分子的挫败感日益增强，更多开始与中共唱反调。需要说明的是，挫败感并不在于言论管制本身，因为这些知识分子本身就参与言论管制，在各个领域帮助中共给年轻人洗脑，让无知的年轻人相信中共的力量。知识分子抱怨管制的背后，是因为看到管制代表着经济开始崩溃，自己难以获得预期的利益。而且，习所代表的红二代集团，将中国看作自己家的江山，其他人都是家奴。习打老虎拍苍蝇的结果，也是抓出来没有红色家庭背景的人。真正掌控中国主要经济命脉的邓王李叶江朱等家族，可以说丝毫不为所动。这种平民背景被打被拍的结果，让知识分子们感到心寒，也就是再也没有获得特别利益的机会。\n\n所以，在中共的中层和中低层官员中脑子稍微聪明的人加速移民，或者让孩子出国留学。在欧美的投资移民指标中，中国人占据主要位置，就是这些人加速行动的一个表现。前几年，欧美国家的中国人仍然谈论中国经济发展，自己也准备回中国。到了最近，这种回国的言论基本偃旗息鼓，更多转而强调更喜欢平淡的生活。其实，人们心知肚明，并不是自己喜欢欧美，而是觉得回国已经无利可图。而拿着外国护照正在中国发财的人，也随时做好离开中国的准备，只要有风吹草动，就毫不犹豫地逃离。\n\n由于知识分子有离开的选择，在言论上反而更加激进。李开复在多年支持中共后，后期逐渐改变言论，随后离开大陆，属于最初期的表现。沈大伟的反水，代表高级 5 毛们的重大转向。随着中国经济崩溃，中共没有利益给知识分子群体后，不论中共的言论管制如何严厉，知识分子群体都将发出越来越强的声音，与中共唱反调，瓦解中共的管制模式。\n\n简言之，日益严厉的言论管制，与开放的经济模式相悖，反映出中共溃败的实质。在过去，中共是以知识分子为主力而起家，其生存基础是创造封闭的环境，并且在封闭环境中以言论管制为关键手段，反复清洗，形成一个声音、一个力量，以此生存下来。在目前，中共所有的生存要素已经基本瓦解。从环境角度，中国经济主要依靠外资输血，如果中国与国外经济隔离，外资完全退出中国，中国很快进入超大规模人口减损的中国大物理模式。所以，虽然习在国内试图推行毛模式，但是到国外还表现出开放的姿态，以挽留和吸引外资。在经济开放的背景下，想实施严厉的言论管制，并且与暴力相配合，达到排除异己、垄断经济的目的，等于是缘木求鱼、刻舟求剑。\n\n这样的结果只可能是，一方面与中共内部的既得利益集团斗争，促使既得利益集团加速将财产撤离中国的同时加剧你死我活的斗争；另一方面是，知识分子群体看到无利可图，通过反对言论管制的方式表达对无利可图的不满。当外部经济崩溃和内部分裂相结合，中共加速溃败，世界将很快目睹其土崩瓦解。\n\n> http://www.iocecs.com/chinaeconomy/shownews.php?lang=cn&id=223",
			"added": 1521221507,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 44,
			"title": "中国的未来（各种崩溃论简介）",
			"body": "很多人推导未来的方法其实跟赶时髦差不多\n比如很多月兑友听个大物理就觉得什么崩溃论都是大物理一般。\n刚好有点时间，给你们普及下各种看空神州论点的谱系。\n\n\n生于 0715：「中国大物理」\n根源：环境的彻底破坏导致的断水断粮\n高危地点：城市尤其是特大城市\n主张应对手段：退守乡村。\n另有衍生版「大化学」，根源：环境破坏导致人因污染死亡\n\n蛮族勇士：「两脚羊时代」\n根源：美国停止输出购买力导致底层普遍失业\n高危地点：城市\n主张应对手段：团练\n\n左小雨：「枯萎论」\n根源：美国重振制造业，神州以印钞维持僵尸企业，此过程（枯萎）可能长达拾年\n高危地点和应对手段：N/A\n\n刘仲敬：「大洪水」\n根源：人口红利耗尽后寄主亟需新营养来源，否则上层建筑会因缺乏养料而饿死。\n　上层星流云散的副作用：ISIS 东进并扎根成为可能\n高危地点：从河西走廊直至安徽苏北\n应对手段：东南互保 2.0 版，建立亲西方阵营寻求地缘支持\n\n黄金神棍：文革 2.0\n根源：被排挤出世界贸易体系\n高危地点：普天之下，莫非王土，率土之滨，莫非王臣\n主张应对手段：月兑，走不了的熬\n\n\n这些谱系理不清楚说明你对现状好听点说是管中窥豹，难听点说是两眼一抹黑\n\n> https://www.tuo8.co/thread-31864-1-1.html",
			"added": 1521424750,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 45,
			"title": "中囯政治概览与启蒙",
			"body": "能看到並読完這些帖子，你就已經超越了99.9999%囯人。\n\n- 文化 [[1]](/Me.ZeroNetwork.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/13aB79mzuRLgDYzQthn9wzycjw77WyDXh6/1513652657) [[2]](/Me.ZeroNetwork.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/13aB79mzuRLgDYzQthn9wzycjw77WyDXh6/1513945083) [[3]](/Me.ZeroNetwork.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/13aB79mzuRLgDYzQthn9wzycjw77WyDXh6/1521530120) [[4]](/Me.ZeroNetwork.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/14ytAKDfNjArMTqGecTi7ginG3aZTsRAum/1523159556)\n\n- 泛亞主义\n\n- 共产主义\n\n- [二十世紀](/1DxU6bWh1GfUjtxwaXt87sBjvPHXWo8UWw/?Post:27)\n\n- [文明的灰烬](?Topic:51_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6)\n\n---\n\n- [大物理](?Topic:41_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6)\n\n- [共产党資本主义](?Topic:8_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6)\n\n- [低人權优势](?Topic:13_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6)\n\n---\n\n- [各種崩潰論簡介](?Topic:44_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6)\n\n- [大洪水](?Topic:16_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum)\n\n- [沉船計划](?Topic:10_1KoZ6vDCXeDavsQjCToc95SZJu7uVVd9Yi)\n\n- [阳光灿烂的貴囯](?Topic:6_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum)\n\n---\n\n- [編程隨想](https://program-think.blogspot.com)（計算机技術/邏輯思維）\n\n- [阿姨](https://twitter.com/liuzhongjing) / [BigBrotherWatch](https://twitter.com/sunsetofwestern) / [Sinophobe](https://twitter.com/iroughchina)\n\n---\n\n- [品蔥](https://www.pin-cong.com)（政治問答）\n\n- [中囯网絡审查技術評論](/12ddrrRKkABAWTU48ZL3THfypHtVJ3aVF5)\n\n- [Polar Blog](/1DxU6bWh1GfUjtxwaXt87sBjvPHXWo8UWw)",
			"added": 1521534722,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 46,
			"title": "何清涟：默克尔如何毁掉德国的未来",
			"body": "作为一国总理与欧盟最重要的领导人，默克尔忘记她的职责一是对本国人民负责，二是对欧盟负责。为了挽回与里姆对话造成的冷血形象，她将自己变成了联合国难民署及相关 NGO 负责人。2015 年 9 月 7 日，默克尔声称「空前的移民潮将会在未来改变德国」，并承诺拨款 60 亿欧元修建供难民居住的住房，并称要在欧盟内部分摊移民。\n\n以后发生的一切，都证明这位欧洲女王无论是对难民的即期需要花费，还是未来融入德国社会的难度，以及对欧盟各国接收难民的态度，都缺乏缜密的考虑。\n\n**默克尔为几代德国人增加的经济重负**\n\n事实证明，默克尔不仅根本不了解「空前的移民潮」将会如何「改变德国」，甚至大大低估了德国因接收难民而新增的财政负担，那 60 亿欧元完全是拍脑袋想出来的可能花费。\n\n事实是：光是 2015 年，难民开支是 210 亿（据 Ifo 经济研究所所长辛恩的研究）。而这是一个不应该犯的错误，因为每个难民所需的生活费、医疗、教育及各种相应增加的公共设施费用、治安费用等，完全可以按照她当年准备接收的人数再加上 20% 的意外开支预估。所谓 60 亿与 210 亿之间的财政缺口用什么办法弥补？不可能当年增加税收，只能是发债与印钞。\n\n人自身有再生产需要。来的难民大多数是青壮年男子，少部分幼童与妇女。这些青壮年必然要成家，穆斯林家庭一向将孩子看作真主的礼物，家庭生育率远高于其他族群，三至五年后就得由德国政府支付家庭抚养费用。为什么需要由德国政府支付？事实很无情，[德国劳动部长 Andrea Nahles 今年发出警告](https://twitter.com/haniawiatrek/status/767600134792351744?%E2%80%A6)：因难民，德国将增加 100 万领哈尔茨 4 福利者。必须说的事实是：[这位部长一年前曾说过](http://www.mmnews.de/index.php/politik/47806-nahlers-flucht?%E2%80%A6)：难民是专业人才，将为德国经济做出重大贡献。\n\n默克尔信口开河地说「我们能做到」之时，不但极大地少算了当年度的即期开支，甚至不对难民未来开销做一预测。[德国弗莱堡大学经济学教授拉斐尔旭申（Bernd Raffelhüschen）以 100 万难民的人数计算](https://twitter.com/WilderMohn/status/669845041578426368)，指出：「难民危机可能要耗资近 1 万亿欧元」。纳税人每年负担 170 亿。如难民能在 6 年内融入劳动市场，此间需 9000 亿欧元，相当于德国国民总产值的 1/3。\n\n拉斐旭申的研究还是比较乐观的，因为他假设了一个 6 年内融入劳动市场的前提，且难民数量限于 100 万。但事实无情，[贝塔斯曼基金会委托经济学家 Iván Martín 主持调查欧盟 9 国让难民融入劳动市场的研究](http://derstandard.at/2000042982568/Studie-Kein-Land-hat-bisher-Erfolg-bei-Integration-am-Arbeitsmarkt?ref=article?%E2%80%A6)。研究组对 9 国的 94 项措施进行了分析，结果发现，无一国成功地让难民融入劳动市场。\n\n德国人利用全球化的机会与辛苦工作赢来的好日子，被默克尔轻易地毁掉了。有人计算过德国债务及难民对德国未来的负担，痛心地发现：「7.7 万亿欧元的缺口等着我们的孩子。德国总欠债 6,2 万亿。这代难民耗资 8780 亿，下代不如德国孩子，会使难民费用升至 1,5 万亿。德国正式欠债是 GDP 的 75%，只为实际欠债的 1/3，其余隐藏在福利保险中。（《[等待我们孩子们的是 7.7 万亿欧元的缺口](https://twitter.com/WilderMohn/status/755710517868716036)》）今年，[26% 外国人领哈尔茨 4，人数为 154,1 万，比上年增加 12,4%；与此同时，德国人领福利者降至 436 万人，降低 5,2%](https://twitter.com/WilderMohn/status/760010542882979840)。\n\n虽然不能要求每个国家领导人都懂经济学，但至少要知道「量力而行」这个财政支出原则。默克尔一年前说「我们能做到」，尚可说她没有意识到难民问题有多困难。但在今年 8 月，德国陷入了难民危机，她还继续夸称「我们就是能做到」，实在要算是知错不改，顽固之极。\n\n**默克尔不愿意了解欧洲的穆斯林融入实情**\n\n迄今为止，世界人口中的穆斯林约 12 亿至 15.7 亿，约占 2009 年估计的世界人口 68 亿的 23％，约有 2％分布在欧洲及美洲。事实证明，穆斯林人在欧洲的融合并不成功。\n\n《查理周刊》恐袭事件发生于 2015 年 1 月，犯罪者就是出生于法国的穆斯林二代。此事发生后，国际社会讨论欧洲穆斯林融入问题的文章可谓汗牛充栋，但默克尔显然对这一问题了解不多，她甚至不愿意了解近邻法国的穆斯林问题。\n\n法国从二战以后就开始接收穆斯林移民，并采取法国一贯坚持以「共和模式」为原则的移民政策，在移民问题上属于强同化、高认同模式。在承认外来移民的公民权利的同时，要求其必须首先认同共同的法兰西价值，放弃本身的宗教文化与传统价值。现在，法国有 642 万穆斯林移民，约占法国总人口的 10%，基本都是外来移民及其后代，其中有不少人属于「对抗同化型」，即拒绝接受世俗化，生活在自我封闭的小圈子里，与法国社会格格不入。法国近年恐袭事件多由本土出生的穆斯林制造，法国朝野均承认融入失败，目前陷入困境。\n\n法国做不到的事情，你默克尔凭什么认为自己一定能够做到？\n\n**对恐怖主义采取鸵鸟政策**\n\n在搭上美国提供的全球秩序与安全这班车之后，德国政界显然认为安全无需自身负责了，将福利与政治、人权做秀当作主要政治任务。以下是 联邦刑警公务员联盟主席安德烈 · 舒尔茨（André Schulz）的批评：「外事领域和德国安全部门早就对难民潮的威胁性进行了提醒。……『阿拉伯之春』始于 2010 年 12 月。2011 年时，比如德国刑警部门 BKA 就已经看到了蛇头犯罪增长势头带来难民数量增加给予了联邦范围内的预警。预警在 2012、2013 和 2014 年也同样做出了。欧盟和德国决定层中的政治家，要是不以 3 个猴子的原则（不听、不见和不说）来排斥这些认知的话，那么，我们所面临的状况就完全是另样了」。（《[难民政策：今儿这样，明儿那样 -- 欧洲没有计划](https://www.bdk.de/der-bdk/aktuelles/der-kommentar/asylpolitik-heute-hu-morgen-hott-europa-hat-keinen-plan) 》）\n\n关于蛇头走私人口的严重情形，德国政治杂志 Compact 在 2014 年 12 月发表一篇揭露真相的文章《[隐秘而龌龊的德国难民产业链](https://juergenelsaesser.wordpress.com/2014/11/28/asylindustrie-wer-macht-den-reibach-compact-klopft-den-profiteuren-auf-die-finger/?%E2%80%A6)》（中译文：[http://www.dooo.cc/2015/09/38599.shtml），其中谈到蛇头与德国政界、从事慈善的](http://www.dooo.cc/2015/09/38599.shtml%EF%BC%89%EF%BC%8C%E5%85%B6%E4%B8%AD%E8%B0%88%E5%88%B0%E8%9B%87%E5%A4%B4%E4%B8%8E%E5%BE%B7%E5%9B%BD%E6%94%BF%E7%95%8C%E3%80%81%E4%BB%8E%E4%BA%8B%E6%85%88%E5%96%84%E7%9A%84) NGO（红十字会为代表）、律师界、政府的移民部门、公房出租部门勾结合作。有「难民公爵」（Asyl-Baron）之称的 Michael Klemmer，其父是德国社会民主党的重量级人物，与前联合国秘书长达哈默司克德（瑞典政治家）过从甚密，据说其第一捅金就是因为拿到了来自联合国的难民遣散费分配权。这些利益集团勾结起来瓜分联邦政府的难民拨款，唯恐比别人少拿，曾经出现过「这样喜剧的一 幕，被各个集团收买的移民局官员在 2013 年叙利亚毒气丑闻发生后的碰头会上，北烕州和黑森州的难民营的总负责人为了争夺更多的难民名额当场打了起来」。这条产业链有多大？文中提到一位来自叙利亚的难民阿赫迈德 · 萨义德，依靠出售难民信息给电话公司、网络公司、私立医院、甚至是地下的贩毒黑帮。2013 年靠着 2000 多名难民的各种资料就纯获利 65 万欧元。\n\n这篇文章无情地揭示了与难民有关的人道关怀后面潜藏的肮脏不堪的利益需求。作者 Marc Dassen 很气愤地指出：「这些赚的盆满钵满的既得利益者背后可曾想过德国的未来，可曾为焦虑迷茫的德国土著有过半分怜悯？金钱面前，良知无非廉价。」\n\n如此公开的信息，担任了三任总理的默克尔以精明强干著称，居然「不知道」与「不作为」，2015 年 9 月还以人道之名为蛇头们大开方便之门，不能归咎于所谓「失误「。选民如今用选票抛弃她所在的党，算是最客气的做法。\n\n最近，一篇《[55 万避难被拒者在德国生活 ：Pro-Asyl 组织阻挠遣返](http://www.epochtimes.de/politik/deutschland/550-000-abgelehnte-asylbewerber-leben-in-deutschland-pro-asyl-verhindert-rueckfuehrung-systematisch-a1358872.html?%E2%80%A6)》指出，截止今年 6 月，德国境内有 55 万名被判定不符合难民标准的非法移民未被遣返，四分之三滞留时间长达 6 年以上。警察工会主席 莱纳尔 · 温特说，在德国有「系统的阻止遣返的产业」。Pro Asyl （拥护避难）人权组织曾于 2015 年 8 月曾向德移民局问询审批叙利亚难民避难作业程序，并将移民局内部工作程序在难民原所在地散播。\n\n**默克尔让德国失去了安全**\n\n如今反恐成了世界性难题，德国的邻居法国被反恐折腾得焦头烂额，但默克尔对此充耳不闻，仿佛恐怖主义与德国无关。曾一度支持其难民政策的官员也开始发出警告，2016 年 4 月 10 日，德国宪法保护局局长马森 Maa Ben 说：「伊斯兰恐怖主义的潜在人员有大约 1100 人」，此外，还有 8650 名萨拉菲主义者。德国内政部长德美齐埃在今年 9 月 16 号说：有进行恐怖袭击威胁的人是 520 人，另外还有 360 人是所谓的「重要性人物」。\n\n7 月底，德国遭遇一系列暴力袭击，其中三起事件中的袭击者是在德国寻求庇护的穆斯林难民。就在纸完全包不住火的时候，政府主导的民意调查还显示，将近 70% 的德国人不认为默克尔的难民政策是导致袭击事件的原因之一。\n\n对默克尔政府的荒唐作为，美国政治学者福山实在忍不住了，今年 8 月在接受媒体采访时指责：「对欧洲来说，默克尔是比 ISIS 更严重的威胁」（[SHOCK CLAIM: Merkel is BIGGER threat to Europe than ISIS, claims US professor](http://www.express.co.uk/news/world/695927/Angela-Merkel-bigger-threat-Europe-than-ISIS-claims-Professor-Francis-Fukuyama)）。\n\n时光不能倒流，世界上没有后悔药可吃。默克尔的政治生涯总有一天会终结，但她留下的重要政治遗产，即难民大量涌入造成的人口结构的变化、经济负担、文化摩擦以及安全麻烦，将会长久影响德国。历史将如此总结这场德国的戏剧：源远流长的左派文化创造出了默克尔这样的领袖，以及以「人道」为名蚕食德国纳税人血汗的难民产业链，最终这些势力合力葬送了德国的未来。至于默克尔作为欧盟最重要的领袖对欧盟产生的影响，还需要另文专论。\n\n（本文德文资料由德国网友野罂粟 @WilderMohn 女士翻译并核查，特此鸣谢）\n\n> https://www.voachinese.com/a/heqinglian-blog-german-future-20160926/3524932.html",
			"added": 1521617506,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 47,
			"title": "如何看待在日中国人因为翻译日本杂志文章而被捕？",
			"body": "不想看完的，看完下面一段就可以关了。\n海盗精神是黑客精神的衍生物，而你们做字幕组 / 汉化组 / 供源的人，要时刻记住你们既是海盗也是黑客，由于这些行为在你们的所在国是犯罪，你们还是戴着黑帽子的黑客。\n既然在你们的所在国，海盗行为也可以算作广义的黑客行为，你们在进行翻译 / 汉化 / 上传等的时候，必须时刻记住要像一个黑客一样保护自己。首先，不要用自己常用的社交网络账号发布资源以及与其他成员交流，因为一个人常用的社交网络账号一般是不会时刻使用代理之类手段登录的（甚至不少社交网络软件还会因为安全性而限制使用代理），很容易因为登录了社交网络账号而泄露真实 IP，同时由于实名制等原因（国内有些人可能不知道，日本的手机、宽带实名制做得比中国好太多了，而且早了快 10 年）直接暴露真实身份；然后，要做到进行海盗行为时专号专用甚至专机专用，尽量不使用实名制或者能轻易追踪到自己的互联网接入手段；使用 P2P 是兵家大忌，不仅不要在发布资源时直接使用 P2P，平时自己也不要使用 P2P，因为这东西在西方国家是被监控得很严的，在日本也一样；进行海盗行为的机器 / 系统要具有必要时迅速自毁的能力。\n然后，要防止社会工程学攻击和被现实中认识的人举报。尽量单线联系，使用 IM 群之类联系甚至线下聚会的后果是只要有一人被抓，或者有一人是警方的特洛伊木马，所有人都面临危险；切勿在现实生活以及常用社交账号中声张自己在干「汉化」「字幕」之类，否则你的熟人随时可能出卖你，警方也很可能因此注意到你。尽量做到任务分解，降低耦合度，最好能做到不仅不知道你的协作者是谁，也不知道他们做了些什么。\n\n------\n\n现在感觉，警方调查这些东西的形式其实和间谍、反间谍、黑客活动差不多。\n1、通过搜索公开信息并分类汇总，以确定侵权行为的规模和大致范围。比如，成立一个有多名精通中文和中国网络文化的专家的调查组，使用中文和中国搜索引擎搜索各种「在线观看」「下载」「汉化」等信息，使用中国 app 等，进行详细的观察和分析，并得出初步报告。\n2、通过人力情报手段直接获得所需信息。这里的人力情报，如果按照间谍活动的来说，就是以伪装身份直接潜入目标组织内部或其附近来获取情报，或者是在组织内部发展变节人员以为自己所用，再以此获取情报。「汉化组」「资源组」等和现实中的重要部门不同，一般没有严格的组织形式和纪律，很多就是以毫无安全性可言的 IM 软件包括「群」功能、公开或半公开的论坛 BBS、未加密的电子邮件等作为主要联系方式，使得警方能够肆无忌惮地使用人力情报手段来进行入侵。比如，警方成立一个专家小组，其中精通汉语的人以「热心供源者」为名，以部分得到授权的真实贡献物来加入「汉化组」，参加「汉化」「供源」活动甚至成员间线下聚会，但是在这个过程中得到的其他成员的所有信息以及「汉化」「供源」活动的证据都会在「汉化组」无法监督的情况下全部提供给警方。也可以在组织内部制造矛盾，在组织内部及周围散布关于其他成员的虚假信息和部分真实信息（如奖学金不正、论文造假等），导致组织内讧，以获得更多有效的情报甚至使得其他成员互相举报，直接把情报送到警方手中。这种方式在黑客界也称为「社会工程学」的一种，不过是直接接触目标的。\n3、间接运用「社会工程学」手段。一旦获得了目标「汉化组」部分成员的公开信息和一些秘密信息，就可以用这些公开信息通过各种搜索引擎以及其他合法和非法的手段进行搜索，以获得能直接确定其身份和所在位置的信息。\n4、运用技术手段进行电子取证。这个配合人力情报手段尤其有效，比如自己在以成员身份通过私有 FTP、论坛等上传 / 分享贡献物的时候全程抓包，并交出自己使用的访问凭据，就可以轻易获取目标组织在进行非法上传活动时的数据包特征供网监部门（别以为日本没有）进行监控并取证。至于 P2P，就更简单了，像 BitTorrent 这样的协议，记得是有算法可以确定一个节点加入网络的时间的。另外，如果得知了部分成员的常用社交网络账号，只要获得 ISP、移动运营商的配合，再加上解析其登录用的协议等技术手段，完全可以将其定位或者和实际用户绑定，只是成本高不高而已。\n\n> https://www.zhihu.com/question/269970035/answer/351175996",
			"added": 1523156273,
			"parent_topic_uri": "19_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 48,
			"title": "左棍是怎样炼成的",
			"body": "老灯\n\n儿子问艾华：老爸，孙中山不是民主革命的先行者吗？\n艾华：现在不是了。因为他破坏大清国的改革开放。那时大清虽然想继续维护封建统治，但是也想政治改革，孙大炮却偏要搞民主革命，所以是罪人。\n\n儿子：那共产党当年也是搞暴力革命上台的，你为什么不说它们是罪人啊？\n艾华：共产党搞暴力革命当然也是不对的，可是我们不能明说，不能得罪中国政府。\n\n儿子：既然共产党上台执政是非法的，那你在海外还支援它干什么？\n艾华：你爷爷是中共的干部，共产党对咱们家不薄，咱们不支援中共支援谁？再说这年月应该谁硬帮谁，要帮就帮有权有势的，那些穷老百姓你帮他有啥好处？\n\n儿子：中共执政后，尽干坏事了，什么反右、大跃进、文革、六四，这些你咋解释？\n艾华：反右是正当防卫，大跃进是正常建设，文革是锻炼群众，六四是镇压暴乱，都是正当的。\n\n儿子：那以后再发生六四式的事件怎么办？\n艾华：还是杀。中国老百姓都是软骨头，就怕硬的。八九年只杀了几百个，就稳定了这十多年。再有六四，杀它几万个，还不稳定个几百年。历史上哪个封建王朝，没有几百年的寿命。中国人多，杀个一亿两亿的，还有十多亿呢！\n\n儿子：可是中国现在太专制腐败，我在网上看到好多揭露这方面的东西．．．\n艾华：专制是中国的必然选择。中国那么大，人口那么多，老百姓又那么愚昧，必须用专制的手段来统治。中国要想强大，必须再专制一百年。至於腐败，中国历朝历代都腐败，几千年了还不都过来了。党的干部为人民服务，呕心沥血，人民就应该让这一部分人先富起来。\n\n儿子：中国的那些下层老百姓，孩子上不起学，有病没钱治，民工得不到工资，房子被强迫拆迁，还是很可怜的。\n艾华：别管他们，他们活该倒楣！孩子不上学是他们不重视教育，有病是他们不注意锻炼身体，得不到工资是他们根本不该从农村出来打工，拆他们破房子是逼他们住别墅。\n\n儿子：就怕这样下去，以后中国会乱的。\n艾华：我们不怕。你爷爷把咱们送到美国来，就是狡兔三窟，防备万一。中国不乱，你爷爷在国内继续贪污；中国乱了，我们已经出来了，你爷爷随时可以出来。再说共产党敢下狠手杀人，估计乱不了。\n\n儿子：哦。这两年我在美国受的这些西方化教育，什么善良诚实、博爱人权等等，看来没什么用。\n艾华：儿子你真聪明！人活着就是自私自利，这世界就是弱肉强食。现在你要多学习中国的厚黑术，经常和国内来的官方考察团打交道，锻炼拉关系走后门，准备毕业了回国当大官、赚大钱。\n\n儿子：我明白了！可是你现在整天泡在网上，为共产党宣传，跟右派骂得天翻地覆的，你能得到什么好处啊？\n艾华：无利不起早。咱家这吃的用的，不都是我上网骂右派挣得吗？你没看我总去中国使馆领钱嘛。再说将来我回中国做生意，他们也得照顾我嘛。\n\n儿子：那你和右派论战都有什么办法啊？\n艾华：办法多了去了！\n第一要冒充参加过八九民运，出国后幡然悔悟，转而支援政府镇压，使劲儿糟践当年的绝食学生。反戈一击比较有说服力，也有杀伤力。\n第二要比中共当局还左，说中共想说而不便说、不敢说的心里话，既气了右派又让中共心里高兴。要有我是左派我怕谁、我是流氓我怕谁的劲头。\n第三要连蒙带唬，吓唬网友说：在中国一民主肯定乱、一自由肯定散、一人权肯定全民族都完蛋。只有共产党才能领导中国，稳定中国。中国人乱怕了，为了稳定当奴隶都行。\n第四要混淆概念和是非，把爱国和爱党联系在一起，把民主和卖国联系在一起，把右派和汉奸联系在一起。\n第五要中共反谁咱反谁，反法轮功、反民运、反台独、反民主、反自由、反人权，要反得比中共还激进。\n第六要中共支援谁咱支援谁，支援萨达姆、支援本拉登，支援赵忠祥、支援宋祖英。\n第七要身在西方反西方，在美国反美国、在日本反日本、在欧洲反欧洲，反正在民主国家说什么都没事儿，讨好中共才是真格的。\n第八要注意拉帮结派。右派靠真理、左派靠利益，要拉拢一些人搞人海战术，群攻群哄，人多势众。\n第九要经常造谣，比如说据传丁子霖贪污天安门母亲的捐款，据传王希哲和魏京生同居搞同性恋，据传郑义接受基地组织的训练等等。\n第十是一旦辩论不过右派，便索性开骂，威胁他们的人身安全。\n总之，就是啥不是人说啥，啥理歪讲啥，啥损干啥，这样就是一个标准的左派啦。\n\n儿子：我全知道了！老爸，我也跟你一起上网当左派吧！\n艾华：好儿子！今晚起，咱爷儿俩轮班上！\n\n> http://beijingspring.com/bj2/2005/360/2004123114310.htm",
			"added": 1523179459,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 49,
			"title": "独裁专制主义有可能回归席卷世界吗？",
			"body": "全世界人民都需要意识到：随着人类发展，不仅民主制度在发展，专制制度同样在发展。并且由于专制者强烈的自保意识，专制制度的发展速度会比民主制度更快。\n\n那么 20 世纪中后期到 21 世纪初，专制制度有哪些发展呢？我在这里随便讲三点：\n\n\n### 一、保证生产力发展\n\n这一点是现代专制得以维持的核心。 生产力的发展保证了：①消除民众的反抗倾向。②拥有自保的武力。③和民主国家之间的友好\n\n专制从来不会单纯因为所谓「人民对民主的追求」而崩塌。如果一个人在专制国家生活得不错，那他有什么理由冒着坐牢甚至杀头的风险推翻专制呢？生产力的发展使得统治阶级能够在保证民众生活水平较高的前提下维持专制制度。朝鲜之流不过是失败的古代专制国家。现代专制国家对政务官和事物官进行分割，政务官负责把持权力，而事务官负责制订与执行科学的统筹规划。在这种规划下，专制国家完全可能带给民众超出世界平均水平的生活条件。\n\n生产力的发展可以让统治阶级拥有强大的军事力量。这种军事力量可以保证外部力量无法干涉专制国家的制度。\n\n资本是无国界的，商品也是不看政治属性的。生产力的发展使得专制国家拥有资本与商品，而民主国家通常不会因为对方是专制国家就拒绝进行贸易。如果专制国家带来的经济利益够大，民主国家的政客们甚至会因此支持对方维持专制体制。\n\n解释了生产力发展对专制的好处之后，我们还遗留着一些问题：为什么专制没有压制生产力的发展？发展过程中受阻是否会瓦解专制？——这里暂时不做展开。\n\n\n### 二、世袭制的弱化\n\n专制制度中最容易引起人民不满的就是世袭制度。世袭使得绝大多数人因阶级固化而绝望，这种绝望带来的是生产力的下降以及反抗的可能。\n\n到了 21 世纪，专制国家对于世袭的兴趣急剧下降。科学的发展与宗教的式微使得统治阶级更注重自身的权力，而非权力无损耗地向子代传递。中国古代的皇帝是要立宗庙、建陵寝的。因为皇帝们期望自己死后依旧享福。但现代的专制者就不会信这么一套。对于现代专制者而言，通过自己的权力让子孙身处富人阶级足矣。维持世袭实在是费力不讨好。\n\n\n### 三、专制意识形态建设\n\n包括「证明民主不是好东西」、「证明我们不是专制」、「爱国主义教育」等方面。相信大家都很熟悉，不多赘述。\n\n目前为止，专制国家在意识形态上的建设还是落后的。但我们也要意识到他们的发展。比如中国《建国大业》、《战狼 2》、《红海行动》等融入了商业元素的爱国主义电影，就取得了很好的商业成绩。\n\n---\n\n回归题主的问题：「独裁专制主义有可能回归席卷世界吗？」——我的答案是：在可见的未来内，发达国家不会走向专制，但是欠发达国家从民主走向专制是很可能的，这一点在埃及等国家已经得到了体现。\n\n民主势力能够抑制这种趋势吗？——我对此表示悲观。我请身在民主国家，有投票权的朋友们思考这么一个问题：你们能够在所在的国家通过民主程序，让这个国家拒绝和专制国家发生贸易么？如果这个问题的回答是否定的，那么民主国家就没什么阻止这种趋势的能力。\n\n> https://www.pin-cong.com/p/43707",
			"added": 1523376913,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 50,
			"title": "劉仲敬評台灣、中國與日本",
			"body": "先跟大家打個預防針，這次他對台灣、中國與日本的評論，\n算是爭議性會比較大的，應該也會有不少人反彈。\n我自己是沒有完全相信，但是因為論點很有趣，還是po出來給大家看看。\n\n\n《【非洲四講第一講】走出中世紀 歐洲國家憲制與國際體系的共同演化》\n\n(前略)\n某聽眾：我認為美國制度是迄今為止最先進和文明的制度。\n\n劉仲敬：我倒覺得它是比較古老而野蠻的制度。美好的制度都是比較野蠻的，因為一個文\n明發展到比較末期的情況下，它的成員就會變得比較無賴了。系統之所以能夠良好的運轉\n，為什麼呢，因為它比較年輕啊，狡猾的人還太少，賴皮的人還太少。文明進入晚期的時\n候就比較像現在的希臘一樣，習慣於耍賴了。這種情況下，在全體國民都習慣於耍賴，沒\n有血性的情況下，你很難僅僅依靠有形的契約建立一個美好的社會了。相反，蠻族還比較\n好，因為蠻族雖然沒有文明，但是他比較有血性，他說話算話，比較有尊嚴。這種人在加\n以適當的訓練以後，很容易製造出比較好的文明。但是已經文明了，然後又變得軟弱和墮\n落的人，那他很可能把他的聰明才智全部用在無賴方面，這種人，才是真正不可救藥的。\n現在的希臘，你跟伯利克里時代比較起來，那不是很明顯麼。\n\n文明這個東西太容易產生出搭便車者。比如說你如果足夠不要臉的話，你在複雜的文明體\n系中間當剝削者是比較容易的，在野蠻時代很難。你要在原始部落中間，經常跟大自然作\n鬥爭或者是各部落相互殘殺，在這樣的環境中間，你想做一個寄生蟲是很難的，寄生蟲很\n容易在第一時間被淘汰掉。能夠幸存下來的那都是有勇氣、有擔當的人，才能夠幸存下來\n。多半來說，部落裡面比較有名望的人都是部落勇士那種類型的人，他們要麼是像赫拉克\n勒斯一樣，跟豺狼虎豹搏鬥，比其他人更能幹一些，因此贏得尊重；要麼是在戰爭中間，\n比別的人更善於打仗。所以這些原始部落經過這樣的淘汰產生出來的人，一般是比較有尊\n嚴有血性的。但是文明人當中，他很可能是依靠耍狡猾的。文明越是複雜，你中間可以鑽\n的空子越多，就越容易產生出寄生性的人格來。\n\n某聽眾：那為何新加坡不一樣呢？\n\n劉仲敬：李光耀就是一個馬基雅維利主義者，他已經看透了中國人的沒落性質，所以他就\n不把中國人當作文明人來對待，它用從日本人那裡學來的那種抽鞭子的手段來對付他。如\n果你不用這套手段的話，很可能新加坡還是松松垮垮，還一塌糊塗呢。但是這種做法對於\n日耳曼人大概就沒有必要，因為他們比較有榮譽感，用孔子的說法來說，他們比較知恥，\n他不會說是像比較頑鈍無恥那種人，他們是吃硬的不吃軟的。中國人就不是這樣，因為他\n是沒落民族，跟希臘人印度人這些文明古國比較相似，你給他講孔子時代的禮義廉恥，這\n不頂用了，宋朝明朝都已經講了多少次了，最後都是無賴贏。比較老實的人，認真按照孔\n子的那種做法去，那你就做了文天祥，被人消滅掉了；而比較無賴那種人，慷慨激昂一通\n，然後自己就出去投降了。這種人繼承了世界。\n\n這種情況在中國文明的晚期是一次又一次的出現，而且一次比一次更無賴的厲害。你從中\n國本身的歷史就可以看出這個無賴化的傾向。我相信這個傾向其實對印度、埃及這樣的，\n跟中國比較相似的文明古國，都是適用的。像滿洲人打進明朝的時候，它對明朝就有一個\n評判就是，明朝人號稱是天朝大國，怎麼不如朝鮮呢？我們打到朝鮮去的時候，俘虜的那\n些朝鮮女子都是痛不欲生，被我們強姦了、侮辱了，但是都是恨不得要死；到明朝的時候\n，怎麼一個個都倒貼上來，還想利用我們去迫害其他人。明朝社會還真是這樣的。\n\n蒙古人打進宋朝的時候，宋朝士大夫也就是死了就算了，要不投降，老老實實投降就行了\n；明朝士大夫，滿洲人一進來以後，他們馬上採取的措施是什麼呢，盡可能的說服滿洲人\n去消滅他們的敵人。東林黨和閹黨都是這個樣子的。後來你說滿洲人搞文字獄，其實好幾\n次文字獄，就是山東人整江蘇人或者是江蘇人整山東人。他們在明朝末年的時候就相互之\n間整了很多次了。現在清朝人來了以後，他們就想辦法把這些沒有文化的滿洲人騙一騙，\n盡可能的去說服你，哎~那些江蘇的蠻子是反清復明的，包藏不軌的，把他們殺了比較好\n；或者說是，山東那些人，他們不是好人，都是魏忠賢的餘孽，殺了他們比較好。他們等\n於都是，一股腦的都跑到滿洲主人那兒去，利用滿洲人去殺他們的敵人。明末清初的時候\n，東林黨和閹黨的衝突，很大程度上就是江東士大夫和山東士大夫之間的衝突。馮銓啊，\n像李精白那些人是什麼地方的人？山東河南那一帶的人。而張家兄弟、錢謙益那批人是從\n哪裡來的？江蘇南部，江浙一帶出來的。這個地域衝突和黨派衝突是連在一起的。\n\n中國人確實是很賴的。很賴這一點就很麻煩，就是說，很賴的民族是比較適合於專制統治\n，因為你用文明和民主的方法去對付他的話，他會把你活活賴死的。你如果用鞭子去收拾\n他的話，他反而會乖乖的聽話。結果構成了一種自然淘汰，就是說能夠在這塊土地上站得\n住腳的人，都是比較狠比較壞的人。中國人服二球，服殘忍的人，但是不服講道理的文明\n人。講道理的文明人，他會覺得你是個傻瓜，還要佔你的便宜。\n\n某聽眾：日耳曼民族的民族意識是怎麼來的？\n\n劉仲敬：因為他們是從部落武士發展到封建騎士，還沒有進入官僚政治階段。等進入官僚\n政治階段以後，他就會慢慢的越來越壞了。日本在這方面就比中國佔便宜，日本是武士，\n而中國是官僚。你從清朝末年就可以看出來，日本武士要比中國官僚要老實得多，沒那麼\n狡猾。而且他們是像春秋戰國時代孔子時代的中國人一樣，是仗義任俠的那種角色，是動\n不動要拼命，但是說話比較誠實，比較有廉恥。孔子時代，有子路那樣的弟子，可以看出\n，當時春秋時期的士大夫的特點。當然那時候的中國還處在封建階段。等你進入官僚階段\n以後，那你就主要靠厚黑了。厚黑比較厲害的那種人就會戰勝不那麼厲害的角色。\n\n某聽眾：春秋時各小國打仗特別文明，講規矩。\n\n劉仲敬：他有榮譽感。如果用卑鄙的手段，打贏了也不光彩。\n\n某聽眾：如何解釋台灣、韓國相對還是好一些？\n\n劉仲敬：我想，台灣、韓國都不如日本，這是很明顯的。我剛剛從它們這兩個地方走過來\n，感覺就很清楚：日本人是一絲不苟，無比清潔；而台灣人呢，在這方面就比較像中國，\n比較混亂，有很多腐敗的多神教什麼的，賄賂性的信仰比較多。他們那些民間信仰基本上\n是許願行賄那種性質的，而且跟政治是連在一起的。我覺得他們那種民主政治跟他們上香\n拜鬼也是有點相似之處。我給你許願，給你做些什麼事情，我們支持你，這種情況，一種\n短期交易的情況。而日本人的政治呢，他比較有家族性、傳承性，榮譽感比較強，責任感\n比較強，他好像是，像麻生太郎那些家族，他就不是拿小恩小惠來收買選民的，他自己就\n是一面旗幟，我們家的人說話是不會不算話的。就是那種感覺。像是中國這種動不動學術\n造假被揭發出來，然後大家也不當回事，這種事情在日本是不大可能的事情。偶爾出一件\n這樣的事情，當事人都要去自殺。中國哪一個科學家會去自殺？這是絕對不可想象的事情\n。\n\n某聽眾：美國人也是這樣，也不會去造假的。\n\n劉仲敬：美國人他也是日耳曼系統的。歐洲國家，你把北歐和南歐一比就可以看出了：日\n耳曼系統的人就是比較講榮譽、講誠信的；而南歐系統的，經過了羅馬帝國，他已經是比\n較費拉了。他就比較像東方了，像意大利人和希臘人，主要是這兩國。我覺得法國人好像\n還比意大利和希臘稍微好一點，它是介於南歐和北歐之間的。最賴的應該是意大利人和希\n臘人，他們比較像東方帝國。\n\n某聽眾：按照歷史來講，這種腐敗的民族都是要遭報應的。\n\n劉仲敬：對，蠻族征服，把他們殺得精光。其實殺光了可能還是比較好的。我覺得英國或\n者是北歐比較好的原因之一，就是因為當年羅馬帝國滅亡的時候，入侵的蠻族基本上是把\n羅馬不列顛的人都給殺絕了。但是南方的人口比較稠密，蠻族雖然也進了倫巴第，但他沒\n有把意大利人給殺光。所以北方等於是，經過了消毒以後，文明重啓了。而中國呢，比如\n說是蒙古人來了以後把中國人殺光了，像日耳曼人一樣，蒙古部落重新造出新文明，可能\n還比較好一點。但是恰好又是這一點沒法做到。就要經過一個中世紀的野蠻和黑暗，然後\n重啓。但是這樣重啓的新文明可能像是日本或者是封建歐洲一樣，比較有騎士精神，不那\n麼賴，不那麼腐敗。\n\n某聽眾：是不是日本三七年進攻中國就有這個目的？\n\n劉仲敬：那倒不是。老實說三七年進攻中國也跟中國的賴債有點關係。因為中國人老打敗\n仗，打了敗仗以後就簽署一個割地賠款的條約，然後簽署了以後，等日本兵撤退了以後，\n他又撕毀了條約。結果日本人覺得你純粹是賴皮，不狠狠揍你一頓出不了這一口氣。\n\n某聽眾：您如何看台灣的民主？\n\n劉仲敬：可能台灣大概是沒有能力獨立搞民主的，但是在美國和日本的保護之下是可以的\n。\n\n某聽眾：我覺得台灣的政府因為有監督，根本就沒有像內地那樣大吃大喝的。\n\n劉仲敬：這個嘛，台灣社會，你得把這個結果主要歸功於殖民主義。因為台灣在日本人剛\n剛來的時候，社會可以說是比福建廣東那些地方相比起來的話，也許好一點，但是好一點\n也不是好得很多。劉銘傳時代也好，雖說它是一個新政典範，但是當時貪污的人還是很多\n的。台灣的士紳階級開始的時候也是比較腐敗的。也就是經過了日本人整肅的五十年以後\n，台灣社會變得比較健康了。後來蔣介石到了台灣以後就覺得台灣社會跟大陸不一樣：第\n一是沒有匪諜，沒有遍地都是共產黨滲透分子和左派文藝青年。這些人是，等於說是，除\n了做官或者做革命家以外，在社會上找不到固定地位的；第二就是民風比較淳樸、比較老\n實。他覺得這個地方比起千瘡百孔的大陸來說更適合作為基地。後來他在台灣搞白色恐怖\n，你不知道有沒有注意到他殺的那些人，殺了很多人，但是除了台獨那一系列的人以外，\n可以說是，有匪諜嫌疑的，大部分恰好就是蔣介石自己帶過來的大陸人，特別是大陸知識\n分子。台灣的日本社會中間，反倒不大容易出這種人。\n\n某聽眾：為何很多台灣人都恨國民黨而喜歡日本人？\n\n劉仲敬：那是肯定的。蔣介石一方面是殺共產黨、親共的左派，一方面是殺親日的台獨分\n子，那些人其實就是台灣本地的精英。像林獻堂那些人，日本人在的時候，他是日本的貴\n族院議員，又是台灣自治運動的領袖。二二八事變一髮生他就跑到日本去，再也不會來了\n。回來絕對沒啥好日子過。蔣介石整肅的目的就是要把台灣本土社會，那些日本人教出來\n的那些精英給你打掉。打掉了這些精英，剩下的都是比較窮的比較散的老百姓，那就無能\n為力了。其實這是一個非常古老的[手段]。當年亞述人打到猶太的時候，也是把富人和有\n影響力的人抓走，然後剩下的這些窮人他就不管了。因為你反正都已經很窮，又是一盤散\n沙，你鬧不起什麼事情來，我已經把可以給你們當領袖的人都給做掉了，沒有領袖，那是\n蛇無頭不行，你人多也不管用的。蔣之所以能夠後來在台灣統治這幾十年，就是因為他能\n夠通過土改和二二八以後的鎮壓，把台灣本地的精英做掉了。\n\n其實毛澤東搞出來也是這個意思。中國農村傳統的統治者就是地主士紳，不把這些人搞掉\n的話，共產黨人搞的那些地痞流氓在地方上就沒有威望，還不一定佔領得了呢。這件事情\n上，財政方面可能還是次要的問題，可能權力才是最主要的。不把有可能跟你競爭的人搞\n掉的話，那你的權力根基就不容易扎穩。這一點上是達到目的了。共產黨的政權能夠比北\n洋軍閥什麼的站得更穩，關鍵就在於他殺人殺得更多，而且他把原來的精英階級消滅掉了\n，沒有競爭對手了，他就容易站的住腳了。北洋政府為什麼站不住腳呢？像張作霖到了江\n蘇，然後江蘇本地的士紳就這樣刁難他，那樣刁難他，然後過不了多久又把孫傳芳給引進\n來了，結果把他給趕出去了。如果他也像毛澤東一樣，首先就把你們這些地主資產階級統\n統給你殺光，讓你們再也沒有機會到上海去借兵，到浙江去借兵，那我不是在這兒坐幾十\n年都沒問題麼？這就是殺人殺的不夠多的情況。\n\n某聽眾：看史記的刺客列傳，感覺在看日本當年。\n\n劉仲敬：黃遵憲寫《日本國志》那個時代，日本就是那樣的，動不動就行刺暗殺什麼的，\n動不動就要決鬥什麼的。\n\n其實中國歷史的最大災難就是什麼呢？沒有被殺得太徹底。本來漢朝滅亡就跟羅馬滅亡一\n樣，蠻族入侵，如果這一次被徹底滅亡了以後，鮮卑人什麼民族重新啓動一個程序的話，\n可能就比較像歐洲了。但是這一點沒有做到，等於說是把以前屍體上留下來的腐敗因素又\n給繼承下來了，於是又產生了宋代和明代，比以前漢代更加腐敗。宋代比漢代更腐敗，然\n後明代又比宋代更腐敗。\n\n某聽眾：但是宋朝是中國歷史朝代中最繁榮的朝代。\n\n劉仲敬：最繁榮的時代應該是清代，如果單從經濟上來講，那毫無疑問是清代。\n\n某聽眾：那是不是說從人權自由這個角度，宋代更加好一些？\n\n劉仲敬：那不能這麼說。宋代的人權和自由，就算是從士大夫階級角度來講，也肯定是遠\n不如唐代的。因為皇權比唐代擴張了不少，所以整人的技術也擴張了不少。北朝和唐代的\n皇帝，對大臣和世家是有一定忌憚的。這一點其實也還是因為它是一個遊牧民族進來的、\n封建因素還沒有完全消失的王朝。北魏皇帝他不能享有絕對的權力，因為他手下還有一些\n部落貴族，還有漢魏留下的世家大族，這些都是勢力還相當大，不能隨便想怎麼地就怎麼\n地。所以唐太宗還很嫉妒那些山東的門第，因為魏徵他們，如果嫁女兒的話，寧可嫁給那\n些世家大族，也不願意跟皇室聯姻，也就是說，在他們眼裡看來，皇室還沒有那些世家大\n族來得高貴。但是在宋朝就再也沒有這種現象了。\n\n某聽眾：唐代是不是從武則天開始也漸漸的削弱世家大族？\n\n劉仲敬：武則天的恐怖政治，很大程度上就是為了消除原來北魏留下來的鮮卑武士貴族和\n山東留下來的那些儒學大族，然後用科舉搞出來的寒門子弟替代他們。科舉是什麼人考的\n呢，就是屌絲考的嘛。就是因為，如果我本來是有錢人，那就像是陳寅恪先生考證的那樣\n，所謂李德裕他們家族，州官縣官求我做官我都不做，因為我本人是當地大土豪，做官對\n我沒啥好處。但是窮人家的子弟，通過科舉有一個做官機會就已經了不起了。這樣的人，\n當然是皇帝要你幹什麼你就得幹什麼。但是如果你本來就是土豪或者貴族的話，那麼皇帝\n給你下命令，你還不一定願意聽。皇帝要科舉就是為了利用窮人、利用下等人來削弱貴族\n和世家的勢力。然後皇權擴張以後，必然的，他任用的官員就比以前的貴族或者是世家更\n有平民性，更有奴隸性，必然就更加無賴了。更腐敗更無賴，這是很自然的事情。\n\n你不可能單從道德修養和精神建設上來做到這一點，因為物質上的差距是明擺著的。像唐\n代那些世家子弟，北朝世家子弟，他可以免費的做官，不支薪水，因為他家裡面本來就有\n錢，他做官就像英國貴族一樣，他是為了實現某一個政治目的做的，他不是為錢才做的。\n但是宋代以後的科舉，那你絕對不可能這麼做的。好不容易，讀書是要花錢，然後向親戚\n朋友借多少多少債，然後好不容易從邊緣省份跑到京城考了這趟試，為了考這趟試你就要\n欠不少債。好不容易考上了做官了以後，你說我不做了，那你向你那些親戚朋友怎麼交待\n？你那些親戚朋友都指望你做了官以後，然後好好貪污腐化一下，把貪污的錢分一點給他\n們。我們當初資助你不就是為了這一點麼？你不腐敗不就是對不起我麼？\n\n什麼樣的制度能夠不腐敗呢？只有兩種制度不腐敗：一種是貴族政治，一種是財閥政治。\n貴族本來就是不求錢的；而財閥呢，他是資本家，他本來就有錢，做官，出來從政，像布\n什他們從政之類的，都不是為了錢。他本來可以做董事長掙幾百萬，做個總統掙幾萬，人\n家圖什麼呢？人家頂多就是圖執行他自己的政策，青史留名。如果你本來就是無產階級，\n那麼可以保證你絕對不會代表人民，你一旦好不容易從無產階級中間，好不容易脫離了無\n產階級，不好好整一整無產階級，給自己發一筆財，那簡直對不起自己。\n\n某聽眾：那不就可能變成世襲政治了麼？\n\n劉仲敬：就是那種政治世家。你得承認，哪怕是在民主政治上，像雅典，最有政治節操的\n是誰呢？像伯利克里他們家族，伯利克里他們家族是幾代從政的，多少年都是雅典的世家\n。他們那個家族就是一面旗幟。像羅馬就是布魯圖他們家族，像日本麻生他們家族，跟平\n民政治家就不一樣。平民政治家，像田中那樣的人，那就是以腐敗而著名的。田中號稱是\n平民宰相，但他個人的生活是不檢點的，又搞女人又腐敗。麻生那種家族他是不會搞腐敗\n的。他連上公立大學都不肯上，麻生小時候要去上大學，想去考公立大學，他爸爸媽媽罵\n了他一頓，說你簡直混賬！公立大學是給誰上的？是給那些家裡沒錢的人去上的。你又不\n是缺錢，憑什麼去搶那些窮人子弟的飯碗？這就是貴族子弟的風格，就是這樣的。\n\n貴族制度不容易腐敗，越平民越容易腐敗。可以說腐敗是一個文明退化的結果.可以說是\n社會日益傾向於民主化和平民化，那也就同時的：一方面是政治越來越腐敗；另一方面是\n社會越來越散、團結力越來越低。它社會上缺乏天然的領袖。最後散到一定程度，他就抵\n擋不住比較野蠻、但比較團結的民族。然後歷史就要重新啓動。經常都是這個樣子的。\n\n某聽眾：中國確實是翻天覆地的變化，但是也越來越腐敗。\n\n劉仲敬：這對中國來說是很自然的嘛。腐敗是平民政治的一個自然現象。腐敗那就是因為\n它本來就是非常散沙的性質，這樣的民族，你可以利用他的天然的自私和相互競爭來創造\n一些經濟財富，但他很容易被蠻族征服的。可以說是在現代以前的時代，像中國目前這種\n狀態，肯定會吸引蠻族的。比較窮困但是有戰鬥力、比較團結的蠻族，肯定會利用各種各\n樣的機會入侵你，然後把你的財富變成他的財富，然後他來統治你。只有在國際體系的保\n護之下，你才能夠勉強苟延殘喘。\n\n但是在這種情況下你的物質力量也轉化不成你的政治力量。像以前埃及就是這個樣子的，\n埃及很像中國，它比羅馬要富得多，但是從來不敢惹羅馬。羅馬更窮，但是他們的公民團\n體更有戰鬥力。像中國現在跟美國相比，就很像是當年埃及和羅馬的對比。所以你就不能\n相信GDP什麼東西。即使中國的GDP超過了美國，就像當年埃及比地中海其他國家更富裕一\n樣，它還是不堪一擊。他可靠的做法就是通過賄賂、腐敗、收買的辦法，才是可靠的，他\n自己組織的軍隊肯定是沒有戰鬥力的。因為軍隊的戰鬥力，那是直接反映了國民的團結能\n力。國民自己是這個樣子，由這樣的國民組成的軍隊是不可能有戰鬥力的，雖然你可以給\n他買很先進的武器，就像宋代的軍隊一樣，它裝備著各種當時肯定是最先進的武器，火器\n啦，什麼神臂弓之類的東西，但是實際上他肯定，一方面不如唐朝那些自費充兵的府兵，\n一方面不如蠻族士兵和春秋戰國時期的貴族武士。\n\n某聽眾：可是我覺得共產黨的軍隊自成立以來在什麼條件下都很能打。\n\n劉仲敬：共產黨的特點是，不把軍人當人看，他可以讓你死的很多。但是共產黨真的沒有\n什麼戰鬥力，而且中國共產黨跟蘇聯和東歐的共產黨相比起來，這一點暴露的非常清楚，\n它確實沒有什麼戰鬥力。它打過什麼仗呢？三大戰役那是吹出來的。三大戰役實際上都是\n依靠蘇聯武器和蘇聯將領指揮的。中國人把林彪說成軍神，但是林彪就沒有打過什麼仗，\n他也就是在平型關搞了一次襲擊日本後勤部隊的仗，死了幾百人，而打了這一仗以後，他\n再也不敢打第二仗了。朝鮮戰爭基本上是失敗了，而且失敗的方式非常之慘，基本上朝鮮\n戰爭，你真看那些紀錄片的話，那就是比二戰後期日本人還要慘。基本上是你躲在洞裡面\n，人家火力掃過來，露出去的人都死了，整建制整建制的部隊被俘。\n\n某聽眾：但有說法稱，就是朝鮮戰爭讓世界對中國刮目相看的。\n\n劉仲敬：那是自己吹的。朝鮮戰爭時期的時候，當時的西方世界一般都是把中國作為蘇聯\n的附庸來考慮的。而且實際上也就是這個樣子。朝鮮戰爭基本上是靠蘇聯飛行員和蘇聯武\n器，中國只是負責出炮灰的。\n\n(中略)\n\n某聽眾：我覺得在中國，各個方面都是逆向淘汰，想有高尚情操是不可能的。\n\n劉仲敬：我越來越覺得高尚情操這個東西跟騎士精神是有非常密切的關係的。文明到晚期\n以後，過度的忌憚武力和屠殺，實際上反而是一件壞事，因為它損害了淘汰腐敗成分的一\n種機制。而早期比較年輕的民族，之所以顯得比較健康，那實際上就是因為他們在部落環\n境中間和封建式的環境中間，把這些比較腐敗的東西自動的給刪除掉了的結果。\n\n某聽眾：我覺得許多人從中國搬到美國以後，就逐漸遵守美國的遊戲規則了。\n\n劉仲敬：我覺得你作為一個孤立的人去進入人家的社會環境中間，那恐怕是比較容易的。\n但是另一方面，中國從整體上來講是全世界的一種腐敗力量，他不是僅僅腐敗自己，他也\n在腐敗包括美國在內的各種地方，中國的政治獻金什麼的，那些肯定就是中國人在美國搞\n腐敗活動了。\n\n某聽眾：那該怎麼改變呢？\n\n劉仲敬：有些事情確實是很難的，幾百年都很難改變。像麥考萊那個時代，他對意大利那\n種評價，好像跟現在也是很相似。大體上的意思就是說，意大利人跟北歐人相比起來，是\n太賴、太陰暗了：北歐人頂多也就是殘忍，彼此鬥起來的話，大家決鬥殺人；而意大利人\n在同樣的情況下，他不會直接跟你撕逼，而是暗中用各種各樣狡詐的陰謀詭計來對付你。\n其實現在還都是這個樣子，現在的意大利跟北歐比起來也還是這個樣子的。雖然意大利自\n己的改革已經改了好多次了，在憲法形式上，他已經是一個徹頭徹尾的西方民主國家了，\n但是人民的品德和社會風氣還是很不行，很差勁的。像希臘現在加入歐盟，多多少少應該\n是被德國、被北歐帶動的，但是他一旦到關鍵時刻就故態重萌的耍起賴來了。這種事情，\n民眾的德行幾百年都升不上去。\n\n某聽眾：一些台灣人認為台灣走向民主後，民風好了一些。\n\n劉仲敬：我覺得他們如果乾脆把國民黨趕回大陸，然後全民講日語的話，可能還會好很多\n的。\n\n某聽眾：但是我覺得不能完全否定民主對民德的改變。\n\n劉仲敬：在小的環境中間可能能管用。但是在中國這樣龐大的國家內實行民主，至少我是\n覺得，從直覺感覺到很危險，很沒信心。在這個演化過程中，我覺得最有可能勝出的那種\n人，很像是民國初年那些清流知識分子那種，講空話，會吹牛的人，還有就是那種比較耍\n賴皮那種人。比較老實肯幹但是不大會耍嘴皮的人，大概是沒什麼希望的。我覺得中國如\n果真要是搞民主了以後，經過短期的混亂以後，多半會土崩瓦解的。因為共產黨畢竟不是\n國民黨，國民黨的黑材料少多了，共產黨那些黑材料真要公開了以後，他自己大概就不存\n在了吧。\n\n某聽眾：您怎麼看亞投行和一帶一路？\n\n劉仲敬：我覺得這種行動危險得很。我覺得中國，像現在這種情況，他就是維持一定的封\n閉才能夠維持，像木乃伊不能見陽光一樣。如果一旦突然放開了以後，可能一下子就融化\n了。我覺得這肯定是一個絕對的賠本生意，賠五到六年時間，把錢賠光了他就玩兒不動了\n。而且這件事情實際上是暴露出整個決策機制混亂到驚人的地步。我覺得他好像根本就沒\n有參考過工程技術成員的意見，很可能就是拿著紅鉛筆在世界地圖上畫了一條線，覺得這\n條線很好。而畫了這條線的人多半都是文科生。像巴基斯坦那條線，我就想不通，他們到\n底怎麼樣打算越過喀喇崑崙山附近那個長達240公里的缺口。我查了一下，好像是，至今\n為止，全世界到目前為止，打高山隧道，最多也就是打到三十幾公里，還沒有人說是誰能\n夠連打240公里的隧道的。在巴基斯坦和中國邊境上。這條鐵路，你在瓜達爾港靠沿海的\n地方還比較好修，但是修到靠近邊境的地方，那個洞你怎麼打法呢。\n\n某聽眾：您如何看南海問題？\n\n劉仲敬：這個是輸定了的格局。首先你搞的這些事情在國際法上完全站不住腳，你把一些\n水下的暗礁或者是沙灘，堆上一些水泥，就算是一個島，如果日本人這麼幹，那怎麼辦，\n日本在西太平洋有那麼多的島，他一個一個給你堆起來，那西太平洋三分之一都是日本的\n領海了。這事人人都可以幹的。幹起來以後，中國不是佔便宜最大的，絕對是日本和加拿\n大那種國家佔便宜比較大。當然，美國人絕不會讓你做成功的。這種做法就很像以前利比\n亞人在他海域上劃一條什麼什麼線，這條線以南全是我們的領海，然後美國人就派艦隊進\n去，他宣佈，絕對不承認這個地方是你的領海，我說這是公海這就是公海，你有本事來打\n啊~然後打了一仗，結果就是，把利比亞的攔截飛機給打下來了。現在就是這種結局。你\n敢不敢攔截？他之所以過來，就是說我不承認你這些地方是你的領海，你填出來的島不能\n作為領海的依據。我過來飛一下，你有本事就打。\n\n某聽眾：會不會由於利益驅使，中美存在背後的默契？\n\n劉仲敬：這個不大管用。這種做法，老實說，符合中國人的思想，但是照美國那種政治層\n次來說，你要想把政治精英全部收買進來，讓他們彼此之間不掐起來，那是絕對沒可能的\n事情。\n\n某聽眾：可是如果存在一個小集團達成這樣的默契，對美國和世界都有好處啊。\n\n劉仲敬：可是美國人不是這樣考慮問題的。美國那些參議員，他會考慮按照對美國發展有\n好處麼？那不是的。他一直考慮的是他本選區的利益。所以這個辦不到。照美國那種地方\n性政治運作邏輯來說的話，你這樣一個小集團是沒法過關的。人家很容易就把你給顛覆掉\n了。\n\n某聽眾：您如何看待廣東的黑人？\n\n劉仲敬：可以考慮組織一些黑人雇傭兵。他們的戰鬥力應該比普通的中國人要強得多。擁\n有這支雇傭兵的人，可以佔到很大的便宜。像張宗昌他們當時的白俄部隊那樣的。像南明\n不是就有一支黑人火槍手嗎，幾百人就能發揮很大的作用了。這主要是社會團結度在起作\n用。我相信黃種人的戰鬥力是比較差的，而中國人又是其中最差的，因為他團結力太差了\n。\n\n某聽眾：但是日本的戰鬥力世界排名很靠前的。\n\n劉仲敬：日本還是它的那個封建優勢，它像春秋時期的中國一樣，它是有[組織度]的。在\n這方面日本人不像亞洲人。亞洲專制主義統治下的臣民都是一盤散沙。\n\n某聽眾：有人說日本人是早期的中國人傳過去的，反而現在的中國人混雜比較嚴重。\n\n劉仲敬：這倒是有點道理。日本人可能比較接近於周漢之際的中國人，而後來的中國人都\n已經滅絕過好幾次了。\n\n可以組織一支黑人雇傭軍，然後首先佔據廣州，然後從廣州北伐，然後成立一個黑人政權\n，以後黑人就變成第五十七個民族了~~~\n\n某聽眾：聽您這麼一說我覺得中國真是爛透了，走向民主也要完蛋。\n\n劉仲敬：我覺得中國人如果走向民主的話，那等於是一個曝光行動，把本來可以在神秘中\n間維持的那些東西一下子整個給戳破了。\n\n某聽眾：為之奈何？\n\n劉仲敬：我現在覺得沒有辦法。你如果要我幹的話，我就首先把廣東划出來，以它現有的\n資源建立一個類似於台灣的小共和國，或者在上海成立一個新加坡共和國。這兩件事情我\n覺得是有把握能做成的。內地那我就沒把握了。\n\n=========================================\n\n其實個人看劉的文章也有一段時間了，\n我覺得他講解國家或民族強盛的「外生性」原因是非常好的，\n可是講到「內生性」因素總覺得好像缺了點什麼，在內生性因素的部分，\n個人還是比較信「國家為什麼會失敗」這本書。\n\n> https://btrend.amassly.com/post/KNceRMbyStaOQZW7CX1nXg%3D%3D",
			"added": 1523686490,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 51,
			"title": "刘仲敬：文明的灰烬——我们在世界中的位置",
			"body": "受访人：刘仲敬，现为武汉大学历史学院在读博士，网名：数卷残编。1996 年毕业于华西医科大学，后在新疆维吾尔自治区某公安局担任法医长达 10 年，于 2012 年在四川大学获得世界史硕士学位。译有大卫 · 休谟《英国史》，著有《民国纪事本末》。华东师范大学教授许纪霖评价此书为「奇书」，对刘仲敬评价为「奇人」、「通古今中西，有难得的大见识」。梁文道在《开卷八分钟》亦对《民国纪事本末》评价甚高，称其为：2013 年读过的最奇特，但又让人印象最深的书。\n\n互联网上流传着关于他的一些事迹，比如：2009-2012 年就读川大时，最常干的事情就是四处在教室走廊散步，看到听不惯的推门进去反驳完就走；考武大博士的时候，有人戏问历史学院有教得了他的人么，刘仲敬戏答武昌首义地方不错……\n\n刘仲敬这样描述自己现在的状态：除了个人生活琐事以外，三分之一的时间用于看书，三分之一的时间用于翻译，另外三分之一时间用来上网。目前他已与广西师大出版社达成多本书的出版协议。\n\n## 如果你是一点雪花，就不要急于落在红炉上\n\n共识网：我们注意到，您在从事学术研究有一段比较有意思的经历，那就是，您曾经在乌鲁木齐公安局当了十年法医，在我们看来，您的这份工作跟现在所做的学问简直可以说是「风马牛不相及」，不知道是什么因素促使您在人生选择上做出了这样大的转变呢？\n\n刘仲敬：我没有变化，世界变了。在新疆的十年，我本能的感觉到了某些潜在的危险，并且法医这个职业，只是落脚于技术层面，对案件起到的作用是微乎其微的，绝大多数案件最终的解决并不依靠技术，而是靠政治谈判。\n\n很多人觉得我现在学的东西跟我以前做的工作完全是风马牛不相及。其实，对我来说，职业根本算不上人生选择。我也没有强烈的动机，非要做某种学术不可。我真正关心的，是我能不能控制的环境改变，如果环境恶化以致我感觉到自己没法控制，我会有强烈的动机，在环境恶化以前避开危险的位置。\n\n职业这个词只有对新教徒创造的近代世界才有意义。职业这个词是由「召唤」这个宗教词汇转化而来的。所以切斯特顿说，美国人对工作有一种宗教性的热忱。他们多多少少认为，工作是一种侍奉上帝的神圣举动。切斯特顿之所以对「职业」这个词感觉到不对劲，因为他是天主教徒。虽然天主教文化也主张履行许多行善的义务，但他们觉得世俗的赚钱根本没有什么神圣可言。神圣应该具有某种高于世俗的特征，世俗的追求至多不过勉强容忍而已。\n\n在中国而言，孔孟老庄和纵横家混合的意识形态造就了另一种行为模式，也就是一种否定公共德性的哲人。他的礼法和道德是针对个人的，而在公共事务上是世界主义者和流浪者。你可以从卜式（西汉大臣，以牧羊致富）和汉武帝的故事中看出这种伦理。汉武帝发动战争，号召人民捐款；但他其实并不指望捐款，而是抄没工商业者的财富满足需要。卜式居然真的捐款，皇帝惊讶地派出使者问他：你到底有什么不好出口的要求？只管说就是。是不是有冤屈，要皇帝替你伸冤？是不是有仇人，要皇帝替你报仇？\n\n这种模式暴露了华夏世界最根本的习惯法：没有针对陌生人的义务，只有私人对私人的关系。即使对于皇帝，效忠也是形式，实质的付出，必须另有知遇之恩。这种文化没有职业道德（对无名陌生人的底线）和事业心（对无形仲裁者的信服），只有等价交换的游士原则（良禽择木而栖，危邦不居乱邦不入）。这里不能产生不断积累的知识传统，只能偶尔产生像张衡一类的聪明人。他们灵机一动，发明了某些东西，然后被人遗忘，直到下一位聪明人偶然地出现。\n\n这种社会的聪明人是智力测验产生的，测验内容完全无关紧要。正如苏东坡所说：无论折腾策论还是经义，反正选出的人都是同一批。同一智力级数的人，肯定能在同一层次内相互交换职业；但在更高或更低的层次内，即使保持同样的职业也不能胜任。所谓君子不器（没有专业），但必须知天命（不以个人意志为转移的趋势）就是这个意思。就像有些参天大树的根须已经腐烂，有些鲜美的果实结在寄生的藤萝上。你必须重视隐藏在外表之下的演变趋势，然后判断某种环境是否具备投机价值。如果你是一点雪花，就不要急于落在红炉上。\n\n## 所谓的民族矛盾 其实是中国和世界结构性冲突的暴露\n\n共识网：还是结合您在新疆工作的经历，稍许对中国政局有些观察的人都会发现，近些年来，民族问题愈来愈成为一把悬在执政者头上的达摩克利斯之剑。您能否结合自己在新疆工作那些年的感受，谈谈您对这个问题的思考。\n\n刘仲敬：这显然是伪问题。莎士比亚说过：当我们开始说谎，我们编织了多么可怕的罗网。我们必须编造更多的谎言，遮蔽原先较小的谎言。在伪问题的框架内，没有正确或有效的答案。\n\n我认为，内亚其实只有两个问题：正统性的失败和地缘政治的紧张。这两者都不是民族问题，「民族」只是一个方便的借口而已。正统性的失败是中国整体的失败，而地缘政治的紧张才是内亚的特殊问题。做个类比，如果德国失去了柯尼斯堡，原因不是因为日耳曼人和斯拉夫人的民族问题。根本原因在于：大日耳曼的自我塑造步入歧途，造成了德国和世界不可调和的结构性冲突，地缘政治的理由注定东普鲁士形同绝地，它像阑尾一样插入斯拉夫世界，在任何冲突中都会首先被切断。只有巧妙的外交手腕才能勉强保全这条三面受敌的领地，即使和平时期也防止不了各方向的渗透。你只要把德国换成中国，把东普鲁士换成内亚，就会明白地缘形势的危险性，这不是人力所能改变的。\n\n内亚斗争的升级不是地方性因素造成的，也不可能局部解决。只要中国在世界体系内的合法性建立不起来，她最脆弱的地缘断层就会首先溃败。所谓的民族矛盾，其实是中国和世界结构性冲突的暴露。就像如果你的脚肿起来，原因其实是心脏衰竭的原因，在脚上贴膏药，基本上不起作用。\n\n内亚只有一项真正的地方性问题：跨国走私网络的发展成熟。如果没有地方强力部门的长期参与和分利，这种情况是不会出现。但是地方政府往往是武断的、任人唯亲的、机会主义的，全中国大概都是这样。\n\n## 民族是流动的 不能把它当做静态的东西\n\n共识网：对于当前民族问题的种种症结，有人将板子打在了「民族区域自治」政策，认为今天很多问题都肇始于这一政策，您怎么看？当然，也有人认为是全球化导致了问题的激化，他们主要指的是信仰伊斯兰教的民族，从根上就很难认同汉族（或者所谓的中华民族）及其政权的统治。\n\n刘仲敬：我觉得「民族区域自治」政策是否存在，不会比九三学社是否存在更加重要。除了极少数依靠统一战线基金为生的人，谁都不在乎这些政策存在不存在。这一政策浪费了一点点统战经费，但在巨大的国库开支中只是沧海一栗。它制造不了任何问题，也解决不了任何问题。难道有人当真相信民族区域自治政策统治了新疆吗？我从没有见过任何人相信政协会议统治中国。\n\n信仰伊斯兰教的民族，不可能跟异教徒融合，但并非不能接受异教徒的统治。他们曾经愿意接受杨增新的统治，后者比共产党更有资格称为汉族政权。列宁主义政党基本不可能实施民族统治，除非以八千万党员自身构成独立共同体（民族）。照葛兰西的定义，共产党和群众的关系不是有机的。\n\n全球化造成的问题在另一方面：在无根的国际资本主义刺激下，地方主义发育为民族主义的速度骤然加快了。我们必须正视：资本主义不是自由主义者和社会主义者想象的普世化、理性化进程，而是一个创造民族的世界性进程。创造民族会不会导致矛盾激化，要看政治结构的包容性。比如魁北克在加拿大没有问题，但是科索沃在塞尔维亚就有问题。\n\n中国这套民族理论有一个概念，就是把民族当成一种静态的东西，好像挖掘化石一样，挖出化石以后给它分类，分到这一组就是这一类，分类完了以后它就永远不动了，但是民族显然是流动的。古代有很多国其实是民族，比如在屈原那时候，楚国就是一个民族，之所以他死活不肯服秦国，是因为他跟秦国不是同一个族，而不仅仅是不同政权。而放在元末，陈友谅的手下去投奔朱元璋大概也是没有问题的。当然后来秦和楚民族都慢慢消失了，但是新的民族不断产生，这是一个不断流动的过程。\n\n共识网：还有一种观点认为，刻意划分民族会增强他自己的认同感，原来他可能没有这种身份意识，但是因为刻意划分，就会加强对自己的身份认同，比如高考加分。\n\n刘仲敬：现在高考的问题的确是这样。高考入学的时候让你上学好像让你占便宜，但是毕业的时候就不这样了，毕业的时候你发现让你上学你吃了很大的亏，因为没有对接了。以前高考制度之所以有价值是因为它是公务员制度，上学的时候是一个候补官僚，毕业以后就变成了政府官员，现在是后半截砍掉，一毕业的时候你就从悬崖上跳下去了。从体制上讲，把教育制度后半截砍掉，就相当于废科举一样，把社会一个循环机制打乱了，又没有很好的替代品，这样就造成了严重的社会紊乱。\n\n民国时期的政治动乱很重要的原因就是毕业生没有出路了。以前科举考试出来是有出路的，他该去哪儿是很清楚，即便是回老家，他也是当地有名望的人士。但是新学培养出来的人他们去哪儿连自己都不知道，只有参加革命。\n\n共识网：如果这个方面纠偏的话能怎么做呢？难道把原来大学的扩招再收缩回来？\n\n刘仲敬：这样的话又很难，一旦扩招以后再收缩的话，现在大学教授怎么办？就像通货膨胀一样，开始最好就不要通货膨胀，但是通货膨胀以后再收回来就非常困难。\n\n---\n\n## 「大一统」只有不断破坏社会生态的自然发展才能维持\n\n共识网：同样还是民族问题，就我们看到的一些观点而言，其中有这样一种担忧，那就是随着中国的政治现代化进一步发展和完善的话，像新疆、西藏这样的民族可能会闹分裂，而这样的局面是国人不愿意看到的。当然，您也曾经说「大一统」是个陷阱，但我想对此很多人还是难以理解，能否结合这个问题再谈一谈您的这个观点？\n\n刘仲敬：如果你用分裂、而非独立的辞令，那就说明你不是真正的民主爱好者。请注意，这里的民主只是中性词。印度独立时，宪法之父安德佩卡尔（他自己就是少数民族）力主印巴分离。他的理由是：如果一亿心怀不满的穆斯林留在印度；印度要么不再有民主，要么不再有国家。当年邱吉尔很高兴爱尔兰天主教徒终于自己决定滚蛋，因为他们在下议院的存在严重干扰了两党政治的和谐。本 · 古里安也根据同样的理由，不肯吞并阿拉伯人的土地。孟德斯鸠早就说过：共和国的主权就是公民权的总和，将主权的一部分交给心怀贰志的外邦人无异于颠覆行动。你能想象美国人渴望吞并中国，然后让中国人做他们的总统么？民主需要价值观的高度认同，肯定会导致小邦林立的世界。这样的世界最多只能容许雅典帝国或罗马帝国，就其根本而言，其实只是最强大的共和国对盟邦和外邦行使世界警察的权力。\n\n大一统的意义是普世统治，就是「已知文明世界的统一」或「历史的终结」。秦始皇曾经设想，他已经终结了历史。此后的朝代政治从理论上讲都是普世统治。但是我们必须首先明白：朝代不是地方性邦国，朝代没有地理边界，班固所谓「王者无外」就是这个意思，但是邦国肯定是要划分边界的。例如明代的琉球不是外国，而是藩属。藩王和总督只是管理形式的不同，权威都来自天子。从历史上看，大明和大清的对应物不是英格兰和法兰西，而是神圣罗马帝国和普世天主教会。中国作为相当于全欧洲的文明体，自居地方性的民族国家。其荒谬的程度相当于，罗马教皇自居梵蒂冈的领主。你要求共同文明传统的中国人只能建立一个地方性邦国，等于要求全体拉丁天主教徒都是法兰西的国民。自从韩国独立以后，这种幻想本该早已破灭。\n\n大一统从暴秦开始，从未走出秦政的阴影，给华夏世界带来了永无止境的灾难。汉儒呻吟叫嚣，举起周公孔子的旗号，号召用「周政」打倒「秦政」。三代上古的理想世界构成儒家的核心价值，回响在二十四史当中。儒家非常清楚：周政就是小邦林立的孔子时代。周政之所以是仁政，因为天子只有礼仪性、荣誉性的最高权力。各邦君主、贵族、国人分享权力，不时爆发《大宪章》式的阶级冲突。这时的中国酷似欧洲，充满了混乱和生命力。秦政之所以是暴政，因为唯一的君主垄断了所有权力。儒家除了教育这头老虎爱民如子以外，想不出别的高招。这种办法的不可靠是显而易见的，因此儒生天天「是古非今」。古，当然就是三代之治。今，当然就是暴秦开创的大一统帝国。\n\n大一统是在野心家谋杀众多有机共同体的血腥现场建立起来的，只有不断破坏社会生态的自然发展才能维持。没有秦政的残酷收割，民间社会势必不断发育产生富人和强人。这些土豪注定会变成郑成功和钱王，割裂帝国的疆土。一旦割草机停止运转，多国体系就会永久化。小邦的国民注定像屈原和项羽的同胞，不能安心服从邻国的统治，犹如波兰人不会热爱俄罗斯的和平。大一统需要另一种居民，他们完全不在乎统治者的更换，大一统需要的是顺民。而顺民在大一统之下享有的自由，远远低于古今大多数被征服民族在征服者铁蹄下享有的自由。举例为证，犹太人在波斯人和罗马人的统治下，仍然产生了自己的评议会；而所谓的英印帝国只有六万军人，总督只拿走了外交和战争的权力，像对待女王一样对待襁褓中的土邦王子。对比我国，明清帝国的臣民至多担任地方政府的临时工。如果他们有幸科举成功，那么永远不能在家乡任职。短期在任的流官非但不能为居民着想，反而以破坏为主要任务。他们不能允许民兵太强，如果他们还能允许民兵存在的话；不能允许土豪太富，如果他们还能允许土豪存在的话。\n\n任何地方的超前发展，都是统一的隐患。向上看齐很难，向下看齐很容易。举个例子，就拿吴国来说，如果贸易和矿业使他们不用纳税，那么「大一统」要做的就是应该消灭他们，使他们跟内地小农一样贫困，反向的改造却做不到。只有在分裂时代，小邦为了竞争的理由，才会允许昙花一现的经济进步，例如吴越和闽国。宋朝的时候其实是有过机会的，杭州和泉州就是他们留给宋朝的遗产，宋朝却用吏治国家和垄断贸易制度将他们渐次削平。在他们眼里，除了京师，谁也不应该强大，除了官吏，谁也不应该富有…… 结果就是鸦片战争，英国人的军舰打进国门。\n\n反观历史，我们可以发现，当年吴越的人口远远超过英国、泉州的人口远远超过伦敦。如果大一统帝国曾经为吴楚、七国、南朝、十国、郑成功父子留下机会，世界并非一定属于欧洲。相反，欧洲人知道他们应该感谢谁。如果奥兰治亲王或其他人宣布，他保障了欧洲的自由，意思就是他保障了欧洲的分裂，阻止了某些雄主统一欧洲的邪恶企图。\n\n## 在思想史上 马克思主义远没有有些人看得那么重要\n\n共识网：下边这个问题，还是同您的个人选择有关，我们注意到，您曾经说过，正规教育对于「情境模拟能力」没有任何帮助，还说高学历的意识形态教育会培养出大批「人类的祸根」，那么为什么您会选择读研进而读博？这似乎是一个矛盾的选择啊？\n\n刘仲敬：我经常分析环境，有时利用环境，从未改善环境。除了顺水推舟和撒手不管以外，我迄今没做过别的事情。\n\n共识网：刚才那个问题，提到了意识形态，我们有一个感觉，现下意识形态给人感觉日趋式微了，虽然执政者也在某种程度上意识到了这个问题，但似乎一时半会还没有更好的解决办法，您认为造成这种局面的主要原因是什么？我们还很关心，您个人对马克思主义的看法。\n\n刘仲敬：马克思主义本来就是边缘理论，只有非主流人群才会认真对待。人类的绝大多数始终相信宗教。极少数自以为特别聪明的世俗人文主义者当中，有极少数曾经相信马克思主义。仅此而已。\n\n据我所知，冷战结束以后，西方马克思主义者已经很难凑钱维持同仁杂志。当今绝大多数马克思主义者和马克思主义资金都在中国。问题不是马克思主义为什么衰落，而是为什么唯独在中国似乎没有衰落。答案当然是：强制力和资金。\n\n我读过几乎所有的马克思著作，敢于断定他是优秀的杂文家和政论家，但其他方面都是杂凑起来的。他在广泛的政治和社会活动中，以笔为批判的武器，配合武器的批判，因此并不重视前后连贯和体系建构。他的哲学是剪刀加浆糊，没有个人独创的部分，而且剪贴的各部分并不协调。他的经济学偏离了最近百年的主流，变成一种民科亚文化。由于数学方面门槛的上升，他的门徒大概不可能回归学院了。马克思主义者残余的空间在文化批判方面，因为这里几乎没有任何专业门槛。\n\n我相信：在苏联势力不及之处，马克思主义从来不曾有过变成主流的机会。有些人把马克思主义看得很重要（很伟大或者很邪恶），是因为他们对世界思想史缺乏了解。他们就像没有出过远门的乡下孩子，以为村里的老师非常伟大。其实这位老师只是落第秀才，在名流大儒的圈子里地位很低。\n\n---\n\n## 民国一开始就建立在流沙上\n\n共识网：习近平最近在欧洲的一次演讲中，谈到中国道路时，说过这样一段表述，他说：1911 年，孙中山先生领导的辛亥革命，推翻了统治中国几千年的君主专制制度。旧的制度推翻了，中国向何处去？中国人苦苦寻找适合中国国情的道路。君主立宪制、复辟帝制、议会制、多党制、总统制都想过了、试过了，结果都行不通。我们知道，您在研究辛亥及其之后的这段历史上做了不少工作，比如您那本《民国纪事本末》写的就是这一段的宪制演变情况。结合习近平的话，我们的问题是，从历史脉络而言，中国是怎么一步步走上当下选的这条路呢？\n\n刘仲敬：辛亥革命不是孙中山领导的，虽然他及时地利用了革命造成的机会。革命是八旗中央集权派和地方精英的冲突造成的，这种冲突破坏了曾国藩和恭亲王建立的满汉互信和朝廷 - 地方协调体系。十八省的独立（分裂）带来了多种路径的可能性。首先就是：建构中国是否有必要，有可能？如前所述，共同体的价值认同是民主的前提。试想，一个波兰俄罗斯哈萨克联邦共和国能站得住脚吗？五族共和其实就是这样的产物，民国一开始就建立在流沙上。以大清版图为基础构建大中华，本质上是政治决断，民意和历史的基础几乎不存在。决断的基础有二。其一，梁启超以来江南知识分子的希望。其二，条约体系的需要。当时，第二点更重要。大清是东亚诸条约的政治主体。重新谈判签约非常麻烦，民国直接替代可以简化问题。老布什也曾经出于同样的理由，反对苏联解体。这样的继承国只能是十八省联邦和蒙藏特殊政权的邦联，否则根本不能指望后者哪怕是象征性的同意。\n\n这样尴尬的联盟比 1848 年的日耳曼邦联更加脆弱，注定是过渡性的安排。如果听任内部因素自然发展，解体的可能性显然占压倒优势。袁世凯重建中央集权的尝试失败后，1923 年宪法进一步扩大了各省的权力。二十年代的趋势是东南各省制宪工作顺利进展，沿海地区经济迅速起飞，东北和内地的差距稳步扩大，蒙藏独立性日益增强。听其自然，大清版图大概会建立四五个独立政权。满洲（很可能包括内蒙）只需要二三十年，就会成为东亚第一号工业强国。东南各省各自行宪后，可能以 1923 年宪法为蓝本，建立模范联邦国家，建立外贸取向的现代化经济。蒙古和西藏各自独立建国。北方和内地各省虽然会陷入长期混乱和贫困，但共同体认同会随着时间自然形成。江南联邦会以正统自居，但不必否定诸夏姊妹国家的合法性，正如德国不必吞并奥地利和瑞士，小日耳曼主义和小俄罗斯主义是欧洲和平的必要保障，大德意志主义和大俄罗斯主义肯定会导致国际性战争。\n\n但是民国的精英更加倾向于大中华主义，因此对自己的悲剧负有极大责任。但是我们不能忘记，中国的命运主要是由国际体系的演变造成的。如果以英国为首的列强不能或不愿维护远东条约体系，和平演变的自然趋势肯定会遭到破坏。二十年代，苏联和国民党是主要破坏者；三十年代，日本及其支持的满蒙独立派、北洋联省派开始报复；共产党作为苏联供养的集团，在夹缝中投机。无论从国际体系的角度看，还是从宪法秩序的角度看，苏联都是主要责任者，国民党是次要责任者，日本只是在报复过程中手段比较简单粗暴而已。在 1912 年和 1923 年宪法体系中，五族是平等的宪法主体。十八省根本没有单方面修改宪法的权利，何况国民政府甚至没有取得十八省的同意和国会多数派的授权。这样的情况放在欧洲，如果奥地利皇帝用同样的手段对待匈牙利王国，匈牙利肯定会在列强干涉下独立。南斯拉夫就是这样解体的。国民党能够掩饰自己的错误和失败，仅仅因为日本后来犯下了更大的错误和罪行。但敌人的错误不能使自己正确，敌人的失败也不是自己的胜利。\n\n国际体系在欧洲无法重建，首先体现于拉巴洛会议和苏德事实合作；在远东无法重建，首先体现于列宁的亚洲革命外交和国际军售禁令的失败。早期民国之所以没有出现改朝换代例行的割据争雄局面，主要原因在于：任何军阀都需要跟公使团交涉，在国际社会面前维持一个统一国家的假象。如果可能，这个假象最好具备西方立宪政体的形式。如果国际社会自身四分五裂，立宪政体在西方颓势显然；脆弱的宪制很快就会荡然无存，国际协调外交也会同时丧失存在的理由。\n\n列宁的对华政策可以概括为：以废除不平等条约为饵，诱使中国加入瓦解国际体系的革命外交。北洋政府没有勇气对抗即使已经四分五裂的列强，苏俄的交涉对象很快就转向广州。这无疑意味着中国内战的升级。英国首倡的国际军售禁令原本是为了阻止中国内战，结果却只能约束遵守决议的主流国家。这些国家在亚洲内地的利益有限，野心不大。利益和野心最大的苏俄和日本则完全不受约束；因此中国内战很快就造成了苏日争霸东亚、列强不断退缩的局面，没有获得苏日任何一方支持的政治势力迅速萎缩、消失。\n\n国民政府在无力统一中国的情况下清党，陷入了比北洋政府更恶劣的外交绝境。她不能完全放弃革命外交和民族主义原则，因为这意味着取消北伐革命的合法性。她在内地收回关税自主权和教育权，至多获得西方勉强的容忍；在内亚边区强化中央权力，立刻激起了苏联和日本的军事反击。这时，她再依靠国联和国际协调外交，处境远不如北洋政府在凡尔赛 - 华盛顿时代。在俾斯麦式现实主义的眼光审视下，革命外交的自杀性是一目了然的。清除西方在中国的条约利益，列强就不再有动机维护中国的领土完整。中国没有能力单独应对苏联和日本的野心，这种野心会直接导致中国的肢解。废除条约体系意味着取消列强的集体干预，然而只有列强的相互牵制才能防止个别强国的冒险行动。\n\n只有在中国迅速实现军事和军事工业近代化的前提下，革命外交才能取得预期的效果。在当时的历史约束条件下，只有一种路径可以在一代人之内将农业国改造为军事工业强国——那就是斯大林模式，其代价是对农村施行超经济剥夺。其他任何发展模式都需要更长的时间积累基础。国民政府一面要求在短期内废除不平等条约，一面无法在短期内实现军事工业化。这种自相矛盾的政策注定了自身的毁灭。她在短暂和平时期取得的建设成就得不到和平外交或强大武力的保护，实际上已经破坏殆尽。如果没有在统计数据中加入日本建立的东北重工业，中国 1945 年的各项经济指标还会更加恶劣。\n\n国民政府主要的外交成就在于：加入西方主流国家的联盟，利用盟军的力量摧毁了日本的霸权。不过，这是一个皮洛士式的胜利。她付出的代价比北洋政府大得多。敌人的失败不一定等于自己的胜利，一战后的法国早已发现了这个事实。\n\n历史经验显示：只有在多国势力接近于平衡的情况下，国际体系才能维持相对的稳定。在原有平衡遭到破坏、新的平衡未能建立的时期，胜利者通常得到的不是国际平等、而是战争与动荡。弱小国家更有可能为了安全，寻找新的霸权，而不是追求平等。在霸权冲突的不稳定的地区，霸权的转移或毁灭通常导致弱小国家内部的革命。\n\n二战在东亚的外交后果是：经过日本的侵占和国民政府的废除不平等条约，西欧各国的条约利益已经荡然无存。中国经济、社会全面崩溃，日本彻底毁灭；为更加强大的苏联留下了舞台。美国是最后一个强大的西方国家，但她面对亚洲大陆的地缘形势非常类似十九世纪英国面对欧洲大陆的形势。她的最佳选择莫过于离岸平衡策略：独霸海上，控制重要岛屿和战略要地；一般情况下，对大陆奉行不干涉政策；一旦有某个强国接近于获得绝对优势，立刻集结其他弱国坚决反对。\n\n历史发展到这一步，随后的事态已经不难预期。日本在东北和亚洲内地的遗产必然落入苏联手中，在太平洋的征服必定落入美国手中。如果中国发生内战，掌握东北重工业基地（也就是中国百分之七十的重工业）的一方享有绝对优势，而东北的仲裁权掌握在苏联手中。国民政府这时除了她实际上采取的行动，只有另外两种选择。她可以实施捷克式的强烈亲苏政策，能够满足苏联对东北、内蒙、新疆的要求，这样虽然能够避免内战和革命，但无法避免贝奈斯式的结局：通过联合政府实现体面失败，最终加入苏联卫星国的行列。或者，她可以试图夸大苏联霸权的威胁，说服美国更早、更多地干涉，这样或许能保存台湾以外的某些沿海土地，甚至南中国。不过，在中国法定领土同时包括东北和台湾（也就是横跨内亚和太平洋）的前提下，跨海分治就是最合理、最可能稳定的结局。\n\n中华人民共和国是冷战的女儿、二战的孙女，正如中国共产党是共产国际的女儿、一战的孙女。先在的双重约束决定了她的路径和命运。\n\n---\n\n## 共产主义是乌托邦，但列宁主义不是\n\n共识网：紧接着上一个问题，今天，我们回过头来看，在 20 世纪初期，对中国向何处去这个问题，可供选择的方案其实有很多，这从当时活跃的各种思潮及其实践也可窥得一二。但国人的选择，却日趋激进，及至最后选择了苏俄共产主义这样一个乌托邦道路，您认为个中因由为何？\n\n刘仲敬：共产主义是乌托邦，但列宁主义不是。列宁主义是总体战在亚细亚社会的变形，严格说来不符合马克思时代的共产主义标准。\n\n民国知识界的激进化是十九世纪欧洲思想史在远东的投射，激进是针对世俗人文主义和功利主义而言、不是指列宁主义。列宁主义一开始就是苏联卢布植入的结果，很难说是国人的选择。李大钊在自己的政治保护人垮台后，不得不依靠苏联的金钱，不得不放弃了自己原先鼓吹的理论。这种情况跟严复或梁启超引进西方自由主义或国家主义完全不同。难道严复或梁启超也是英国和日本情报机关的成员吗？国民党需要苏联的金钱和武器，半心半意地接受列宁主义。而共产党一开始就是共产国际的分支，不仅完全依靠苏联的资助，而且生杀大权都掌握在苏联手中。这些选择都是出于现实政治的考虑，一点都不乌托邦。\n\n共产主义的思想和组织都是外来的，但组织才是重要的。思想起的作用，连点缀都算不上。国际共产主义理论当中，中国人的地位还不如匈牙利。\n\n共识网：下一个问题，对于这种激进化的道路选择，彼时的知识分子有无责任？比如，他们在译介自由主义思想的时候，总是不自然地会根据自己认为的需要，多有歪曲。\n\n刘仲敬：某些知识分子的机会主义显然有责任，但责任显然不大。李大钊在接受卢布以前是坚决镇压国民党的国家主义者，在接受卢布以后变成国民党的主要代理人。这种行径不可能由思想内在演化解释。知识分子可能充当策士和间谍，但李大钊这种是政治投机问题，不是思想认识问题。如果没有他们，苏联不难另找代理人，例如瞿秋白这样「毕业就失业」的俄文学生。民国不缺游民知识分子和游民无产者，不愁招不到人或是培养不出人。\n\n自由主义的思想（或任何思想）和国共两党的政治军事集团根本不在同一个层次上，思想引进的忠实性对政治路径影响甚微。反过来却不是这样，胜利者不难扶植和培养自己喜欢的思想。启蒙创造历史的学说符合知识分子的自我陶醉，在真正的历史上却没有什么依据。自由主义思想的歪曲程度低于国家主义和社会主义，因为后两者有机会获得政治集团的扶植。歪曲和迎合是资助的代价。\n\n## 英国宪法是社会集团博弈出来的 不是理论家设计出来的\n\n共识网：相关的一个问题是，从历史上来讲，以休谟、洛克为代表的自由主义脉络为基础的一套宪政实践缘何没能在中国生根落地？据我们所知，其实我们也曾有过这样的机会的。问这个问题，也是基于您正在进行的一项写作–《英格兰宪法溯源》，此书进展如何？我们甚是期待。\n\n刘仲敬：这种机会不大可能存在。中国只存在另一种机会，某种拉美式的威权主义披上立宪主义外衣。经过长期和平发展，最终和平演化成功。\n\n欧洲由封建自由的各阶级分权演化为立宪君主制，这种可能性在秦政以后的中国已经消失，虽然在周政下或许曾经存在。你不可能在近代中国复制中世纪晚期欧洲的历史背景。欧洲思想家是事后的总结者，不是事前的设计师。英国宪法是贵族、新教徒等等社会集团博弈出来的，不是理论家设计出来的。历史创造思想，思想创造不了历史。根据某种理论设计未来的发展，这种做法就很不自由主义。\n\n至于我那本书，需要好几年吧。\n\n## 中国道路摸索成功的理由很难在马克思主义中找到\n\n共识网：对于现在走的这条路，也就是所谓的中国道路，除了官方意识形态给出的中国特色社会主义这个解释外，国内以汪晖等人为代表的新左派也做了不少合理性论述，比如前几年提出的「中国模式优越性」即为一例，您作何评判？相关的问题是，您又怎么评价以齐泽克等西方左派的思想？\n\n刘仲敬：中国道路摸索成功自然有其理由，不过这些理由在马克思主义当中找不到。你可以在桑弘羊、王安石和蔡京的改革中发现中国模式，也可以在托勒密王朝的财政家手中找到中国模式：比如对国家权力进行商业承包，对消费者进行超经济剥削。吏治国家和散沙顺民有互补关系，他们的 SM 关系可以在经验中形成。在比较野蛮和比较团结的民族中，这种模式没法推广。例如，罗马共和国很难对公民征尼罗河水税，还必须倒贴钱修管道引水，免费供应市民，所以财政一直不如埃及。埃及模式的优越性，就体现于两者可以颠倒过来。\n\n如前所述，当代西方左派就是文化左派。他们没有别的地方可去，这是一种无可奈何的逃避。\n\n## 思想影响社会的机会窗口已经关闭\n\n共识网：当然，国内也有不少思想流派对现下体制多有建言和批评，其中比较有代表性的有毛左、新儒家、以及新权威主义，不知您有无关注，又是否能在这儿做简短点评？\n\n刘仲敬：除了空洞的标签以外，他们没有任何实质性内容。思想影响社会的机会窗口已经关闭，谁还会根据他们的意见行事呢？他们是一群不大有希望的策士，早已被买主抛弃。\n\n毛本人不是左派，而是善于利用左派的机会主义者。他的真正才能类似朱元璋，比其他人更能把握转瞬即逝的机会。这种才能来自他的传统教育和个人经验，他的追随者复制不了。\n\n新儒家没有一点儒家的东西，甚至连南洋儒家的新康德主义都放弃了，很快就会变成导游和土风舞演员。他们实际上是在要求国教会的地位，同时又说不清国教的内容应该是什么。历史上的儒家不是教会，也很难改造为教会。\n\n新权威主义是冷战体系为朴正熙和蒋经国一流人物准备的，这种非常特殊的历史背景是无法复制的。\n\n---\n\n## 新权威主义对体量比较大的国家未必行得通\n\n共识网：现在很多学者把袁世凯当做是一个新权威主义的代表人物，您对袁世凯这人怎么看，他是不是所谓的新权威主义的代表人？\n\n刘仲敬：新权威主义不是没有确定的内容，是一种机会主义。袁世凯本人模仿墨西哥的迪亚斯，后者引进外资来发展墨西哥经济，用军事独裁维持稳定。袁世凯和他差不多是同时代的人，但新权威主义对体量比较大的国家未必行得通。迪亚斯自己的下场就很惨，而且给墨西哥带来了长期的动乱。从迪亚斯的结果看，袁世凯的路应该是走不了多远的，这是内在的限制。类似的情况是：有人遗憾战争打断了国民党的黄金十年。实际上就算没有战争，最初十年的势头也不能一直维持下去。袁世凯路线的长期结果大概是：经过一段时间的经济发展以后，浙江、江苏、广东这样的省份慢慢就会独立出去。袁世凯的政治基业在比较落后的北方，仅仅依靠威权主义或军人干政的手段不足以瓦解南方各省的分离主义。照这种情况发展，中国分裂是早晚的事。袁世凯没有国民党和共产党的组织力量，所以他多半压不住局面，就像墨西哥没有办法阻止德克萨斯独立一样。这样，中国通过某种比较合法的方式逐步分裂。沿海地区大概就会变成泰国和马来西亚那种情况，内地可能还是长期处在强权统治下，有些地方就会让俄罗斯和日本吞并。这对沿海各省并非不是好事，因为国家统一的经济意义就是落后的内地剥削东南发达地区。\n\n共识网：我们注意到，您对当下中国知识分子所进行的「构建共识」努力不是很看好，比如您说「底线就是用来破坏的，共同底线就是大家从各方面一起破坏的。」当然，一直以来，您以局外人自居，但前述评判是否太过轻飘？\n\n刘仲敬：有共同体，然后才能达成共识（或达不成共识）。谁和谁达成共识？谁又能代表谁？流沙社会没有共同体，因为你没有确定的身份和利益。重复博弈塑造共同体，游士的实际作用是削弱重复博弈的可能性。游士不代表任何人，甚至不代表自己。他只能开出一系列不能兑现的空头支票，以明日之我反对今日之我。\n\n## 美国是今天的罗马 在国内是共和国 在世界上是帝国\n\n共识网：您在一次采访中提到自己比较欣赏斯宾格勒，我们都知道，他在汉语世界以《西方的没落》一书而闻名。那么，到我们这儿的问题是，您怎么看现在这个由美国主导的世界格局呢，它还能持续多久？真的会如有些人宣扬的那样，未来的世界将是中国的世界，东方的世界吗？\n\n刘仲敬：美国是今天的罗马，在国内是共和国，在世界上是帝国。今天相当于共和晚期和帝国前夜，格拉古以后、西塞罗以前。现在，辛辛那提和华盛顿的淳朴已经一去不复返，格拉古正在攻击先人的美俗，但凯撒和庞培的世纪还不一定会出现。迦太基和安条克已经灭亡，希律王和托勒密正在垂死挣扎。格拉古和西塞罗之间，罗马权力已经强大到任何外部势力无法挑战的地步。然而，罗马的伟大传统正在面临内部的考验。小加图只担心托勒密的腐化侵蚀，从不畏惧东方的武力。罗马军团在此期间毁灭东方僭主，以便拯救亚历山大留下的城邦。这不是忒修斯和莱库古建国行动的复制，而是罗马秩序和帝国正义的自我发现。\n\n世界秩序不能片刻缺少罗马帝国，帝国肯定会导致东方和蛮族的内部腐蚀。三种因素正在跟时间赛跑。基督教的美国比异教的罗马抵抗力更强。民主输出比蛮族世界建立城邦的效果好。消灭僭主的速度比腐败感染的速度快。因此，凯撒可能永远不会来临。即使凯撒无法逃避，目前也在凯撒以前的共和时代，罗马的力量还没有达到顶峰。在我有生之年，任何挑战者都会自取灭亡。中国或东方并不例外，他们的机会还不如以前的德国和苏联。中国世纪已经过去了。孔子和屈原是她的伯利克里时代，秦皇汉武是她的凯撒时代。今天所谓中国，无非像阿拉伯人的埃及一样借用了古老光荣的名字。中国是文明耗尽以后的灰烬，能否构成新文明的原材料尚在未定之中。她是文明的输入者，不是生产者。她目前没有足够的德性和能力诚实地学习，没有表现出将来可能生产文明的任何迹象。至于现实政治意义上的崛起，那是一条自取灭亡的捷径。\n\n东方化的定义就是共同体德性的衰退，无法维持自由邦必须的秩序，陷于拜占庭式的专制和停滞。这种情况当然是人类的灾难，但在凯撒来临以前并无可能。在目前的世界秩序之下，东方人只会创造西方文明。日本人曾经共同创造华夏文明，后来又共同创造西方文明。比如说，今天所有的学术都是西方学术。中国人在中国做的物理学也是西方物理学。你不能像纳粹一样说，我们的物理学是日耳曼物理学。水户藩研究的孔孟之道，是中国人和朝鲜人的同一个孔孟之道。\n\n## 不能既反对世界警察 又反对大屠杀\n\n共识网：20 世纪，亨廷顿和福山分别提出了两套影响甚巨的理论——「文明冲突论」和「历史终结论」，而且此后的世界演变也在一定程度上印证了这两个看似有些矛盾的理论，我不知您如何评估它们的合理性？毕竟，在非基督教文化国家（和地区），英格兰式宪制的引进还是多有水土不服表现的，而这一点在那些信奉伊斯兰教的国家（和地区）体现尤为明显。\n\n刘仲敬：亨廷顿其实是在谈论认同政治和共同体的建构问题。如果共同体的主权属于全体国民，国民就必须有高度的价值认同。如果没有或不能维持价值认同，共和国就不是此时此地最理想的政体。亨廷顿没有把这句话说出来，但他的逻辑只能引出这样的结论。在现实世界中，情况差不多就是这样。进一步推论，只有两种解决方法。要么发动输出民主价值观的十字军战争，要么在没有正确价值认同的地区实施变相的帝国主义。除此之外，任何手段都是后患无穷的权宜之计。十字军战争和帝国主义的主体必须具备非常特殊的性质，除了美国以外谁也无法胜任。\n\n历史终结论的理论如果正确，那么现实政治的历史尚未终结。苏联集团演变而成的威权主义国家需要再次解体和重构，最终像波兰一样加入自由世界。世界其他国家也要通过其他方式，最终殊途同归。由于可欲的模式已经确定，这其实只是时间问题。东欧和阿拉伯世界的变化并没有违反终结论，但他的框架忽略了罗马 - 美国的特殊地位。如果美国和韩国都是性质相同的普通自由国家，世界秩序就会解体。即使在北约内部，美国和欧洲的关系也是不平等的，美国承担了单方面的保护义务。\n\n英格兰宪制是不能移植的，即使在拉丁国家都不可能，除非以殖民主义的方式。殖民主义为大多数殖民地留下了法统。即使在巴基斯坦这样的国家，英国传统的法官仍然在军事政变和恐怖主义之间岿然不动。当然，自治能力的差异始终存在。统治是必然的，自治却不是必然的。世界不是平的，政治德性的落差构成了帝国存在的正当性基础。换句话说，不能自治的结果肯定是被人统治或干脆灭亡。如果不能采用直截了当的帝国主义辞令，就只能实施代理人统治，但实质不变。只有在各邦自治能力完全相等的情况下，世界才能不需要帝国主义。如果地方性邦国的合法性理论不足以解释世界，那就有必要回到奥古斯汀和但丁的帝国理论。帝国理论允许而且需要罗马的存在，只有罗马才能实施超越身份政治的普遍正义。你不能既反对世界警察，又反对大屠杀。只有世界警察才能制止大屠杀，地方性邦国没有到远方维持秩序的义务。\n\n采访：袁训会、邵思思\n来源：共识网\n\n> http://www.bw40.net/3751.html",
			"added": 1523689114,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 52,
			"title": "遠東的線索：台灣戰略地位的下降與台北流亡政權的本土化",
			"body": "## 第六章　世界革命的失敗\n\n### 一、列寧主義的復辟與冷戰末期的機會主義聯盟\n\n（前略）\n\n### 臺灣戰略地位的下降\n\n華盛頓─東京─北京非正式聯盟牽制莫斯科─河內聯盟，發揮了舊金山體系編外保安的作用，降低了世界警察維持遠東秩序的成本。莫斯科遭到了實實在在的圍堵，北京只得到了登堂入室的幻覺。復辟政權暫時得到安全，卻始終沒有得到合法性。從板門店到金門的冷戰邊界只能淡化，無法抹去。北京鑑於自身地位的脆弱性，決定滿足於自己能夠得到的東西，共同抵抗蘇聯擴張的大局。\n\n國會堅持美國法律高於外交政策的原則，通過了《臺灣關係法》，目的在於防範未來的尼克森，在羅馬義務面前保護美國的憲法自由。遠東的合縱連橫在國會政治的百年大計當中，只能構成微不足道的周邊因數。一九七九年三月三日，中國駐美大使柴澤民對美國國務卿范錫說：「美國政府與國會制定什麼法律是美國的內政，中國不予干涉。」三月中旬以後，北京才發現《臺灣關係法》繼承了《美台共同防禦條約》的核心內容：安全和軍售。此後的談判重複了一九七二年交易的格局，停留在「坦率交換意見」層面，擱置沒有共識的項目，經營利害一致的項目。只要蘇聯的威脅尚未解除，求同存異的原則就能解決問題。南越和臺灣是一九七二年交易的主要受害者──美國過去以臺灣和南越為亞洲反蘇的前線國家，一九七二年後以中國為亞洲反蘇的前線國家。臺灣和越南的戰略地位自然相應地下降，體現為美台斷交和美軍撤出南越。北京從西貢的陷落得到安慰，以為臺灣早晚會重複南越的命運。\n\n一九八二年，廖承志致蔣經國書宣稱：「臺灣終必回歸祖國，早日解決對各方有利。」「外人巧言令色，意在圖我臺灣，此世人所共知者。當斷不斷，必受其亂。願弟慎思。」「偏安之局，焉能自保。有識之士，慮已及此。事關國民黨興亡絕續，望弟再思。」「歲月不居，來日苦短，夜長夢多，時不我與。」蔣經國作為資深的聯共（布）黨員和情報工作者，完全懂得怎樣翻譯統戰語言。北京實際上在說：「無論你如何偽裝，國民黨都不是美國秩序的合格成員。大中華主義並不比泛亞主義更符合威爾遜主義，新三民主義跟列寧主義都不符合美國憲制。美國人可以出於權宜之計保護你們，但早晚會培植更加接近這兩種標準的本土派取代你們。你們為什麼不在為時太晚以前，恢復自己的本來面目呢？**半列寧主義的政黨離不開列寧主義的保護，歷史已經證明了這一點。大中華主義是你們的優勢和我們的白手套，所以你們不用擔心失去利用價值。**」\n\n## 台北流亡政權的本土化\n\n國民黨習慣將特務工作交給黨內左派，以及真實或偽裝的前共產黨人。蔣經國深厚的蘇聯背景使他特別適合駕馭這些人。他麾下的前共產黨人對五○年代的白色恐怖負有最大的責任，老派軍人或體面的資產階級人士遠不如他們擅長斬草除根。他們一方面消滅了本土士紳，實質上完成了對岸同黨的階級鬥爭工作；另一方面又消滅了自己在島內的同志和晚輩，實質上完成了對岸同黨的自相殘殺工作。他們在前一方面的徹底性不及對岸，結果導致臺灣新生代土豪提前以民主名義復辟；在後一方面的徹底性大於對岸，結果導致臺灣技術官僚提前以建設名義搶班奪權。\n\n蔣經國本人從特務首腦轉型為內閣首腦，本身就反映了這兩種相反相成的發展趨勢。他主持的保密局和國防安全會議在五○年代初期取代了鄭介民和毛人鳳的舊班底，在五○年代中晚期模仿美國中央情報局和聯邦調查局，轉型為正規的技術官僚組織，中層幹部的培訓和技術裝備的補給完全依賴美國的對口機構。國防部情報局對應美國中央情報局，司法部調查局對應美國聯邦調查局。國家安全會議模仿美國的類似做法，不設實際管理機構，協調所有情報治安機構，包括駐外武官處和島內憲兵司令部，論實權僅次於總統和行政院長。\n\n臺灣情報機構的現代化先於軍隊和政府，現代化的節奏恰好跟蔣經國從保密局到國防部和行政院的節奏同步。現代化的成功就是中原流亡領導人武斷權力的結束，或者說是美國世界秩序的內化。工作人員對無論民選還是任命的領導都沒有多少依賴性，但美國導師和同儕的交流共用只要中斷六個月就會讓他們混不下去。從此以後，周恩來和李克農的匪運工作模式實際上已經過時了。\n\n江南案的政治意義在於，美國情報機構一般能夠先於臺灣政治領導人瞭解臺灣情報部門的真實做法。正式的聯盟條約和外交協議是必須執行的，日常的技術培訓和後勤支援不是必須執行的。前者是剛性約束，後者是柔性約束，但柔性約束產生的影響和依賴性，並不一定低於剛性約束。美台關係在剛性約束解除以後，柔性約束反而更加強大。這種基於溝通習慣的柔性規訓和基於天花板約束的剛性規訓構成了臺灣不成文憲法的核心部分。\n\n臺灣民主化的主要動力不在內部，而在美國主導的世界體系。如果盟主不是強調民主價值的美國，臺灣內部的力量不一定能產生民主。同樣，大清和民國的立憲政體是歐洲自由主義體系的延伸。遠東的共產主義運動的驅動力和規範力量也不在內部，而是來自世界共產主義的戰略佈局。成文憲法必須通過重新解釋契合世界憲制的基本框架，重新解釋的主要規範性力量不在臺灣內部，正如十九世紀條約體系和二十世紀共產主義的核心動力不在遠東。\n\n遠東的早期共產主義者知道他們是世界共產主義的一部分，也知道東亞不是世界的中心。**毛澤東封閉培訓出的新一代人缺乏國際視野，被前一代人發明的歷史神話欺騙。**華國鋒就是這方面的典型，他在東南亞的共產主義運動已經窮途末路時仍然宣稱，我們共產黨人在哪裡鬥爭，就會在哪裡勝利。鄧小平集團在臺灣問題上至少犯了三個致命的格局性錯誤，這是李大釗和毛澤東非常不可能犯的。他們以為北京和臺灣的鬥爭是東亞大陸常見的南北朝鬥爭，時間對北朝有利，忘記了自己作為失去內亞太上皇支持的石敬瑭政權，並不是時間的朋友。他們以為國民黨流亡者同時面臨共產黨和本土勢力的威脅，最終會選擇投靠共產黨，沒有料到國民黨首鼠兩端，使自己喪失了統戰價值。他們以為美國像以前的國民黨保護人和蘇聯保護人，可以在自己羽翼豐滿以後反戈一擊，沒有想到自己的統戰價值是依靠出賣蘇聯得到的，吞併臺灣的可能性在蘇聯垮臺以後必然迅速減少。北京的復辟政權在世界邊緣停留過久，已經喪失了前輩掌握世界秩序的良好感覺。蔣經國理解他們所說的一切，但做出了恰好相反的選擇。\n\n蔣經國似乎沒有預見到自己的死亡，並不希望出現吸引眾望的明確繼承人。他不斷提拔技術專家和政治外行擔任副手，然後在他們積累到足夠的經驗和聲望以後，重新換上新一代沒有經驗和聲望的技術專家和政治外行。如果他像自己以為的那樣，還可以多活十幾年，李登輝是沒有多少機會在一九九○年代繼續擔任副總統的，很可能會在後來的繼承人面前扮演類似林洋港的角色。不過，李登輝的仕途和本土化的政策是兩回事。後者是蔣經國在繼位以前就已經開始的佈局，非常不可能因為具體人選的更動而改變。蔣經國自己主持的本土化不一定導向民主化，但肯定包括了封鎖統派路徑的意圖。他是國民黨內最瞭解蘇聯政治語言的人，而廖承志的遊說已經暴露了特洛伊木馬的未來安置方式。有限、可控的本土化恰好能讓對方吃啞巴虧，而自己仍然處在可進可退的有利地位。可惜人算不如天算，他啟動的遊戲在自己身後完全失控。這主要不是他個人的問題，而是臺灣憲制必須適應世界憲制演化的問題。\n\n蘇聯在八○年代末葉的突然潰敗，超出了所有各方的預料，然而就列寧主義─史達林主義的憲制模式而言，只能認為極其自然：列寧主義以社會的敵人自居，企圖以最快速度砸爛罈罈罐罐，將所有資源投入世界革命，導致下一步革命的難度大大增加。史達林主義為了克服更加強大的免疫機制，必須將顛覆和突襲升級為長期的戰爭，將大部分資源投入軍事相關產業。列寧主義繼承者在看得見的國家層面必然比看不見的社會層面強大得多，引起的對抗自然會超出境內社會能夠支援的限度，差額只能靠不斷擴大捕食物件來解決，擴大的邊界一旦停滯，就是滅亡的開始。\n\n**北京復辟政權的存在價值取決於莫斯科對美國秩序的威脅能力，臺北流亡政權的存在價值取決於北京對美國秩序的收買價值。**柏林圍牆倒塌以後，兩者都要面對不再需要自己的世界。華盛頓只有在自己無力單獨封鎖蘇聯的情況下，才會擔心中國過於軟弱，蘇聯解體以後，中國的強大反而有害。美國自十九世紀以來，一直維護中國的領土完整，因為中國的軟弱或瓦解不是對日本有利，就是對俄羅斯有利。日本的戰敗取消了前一個理由，蘇聯的解體取消了後一個理由。**美國不再需要維持中國的強大和統一，首先就體現在不再需要維持國民黨流亡者在臺灣的統治。**\n\n印度支那的革命政權在八○年代重演了莫斯科的二○年代和北京的五○年代，然而世界對他們的寬容度已經急劇下降。免疫反應總是比病毒入侵慢一步，在人類的歷史上就相當於數十年時間。他們勉強趕上了最後一扇機會視窗，他們的後輩就只能以毒品販子和叢林盜匪的身分了此一生了。\n\n> http://www.thinkingtaiwan.com/content/6342",
			"added": 1523887211,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 53,
			"title": "刘仲敬：郭文贵现象及中印冲突、一带一路、新疆西藏问题的由来",
			"body": "[00:00:44]主持人：最近郭文贵现象引起了很大争议。中国政府不得不做出很多回应，包括中央电视台、环球时报和新华社，在关于海航的问题上造假，找出“姚庆”，不断派人到纽约来告郭文贵。美国政府这方面也做了很多积极回应，像纽约总检察长对海航的慈善机构致函，要求它正式登记为慈善机构。最新的消息就是，白宫的新闻主管下台，仅仅坐了十天，可能是美国历史上在位时间最短的一位新闻主管，据美联社报导，他下台的其中一个原因就是，他也是个投资银行家，与海航有1.8亿美元的交易，海航打算以低于市场的价格购买他的基金，这牵涉到利益交换的问题，美国的监管机构一直在调查。针对这些现象，你觉得郭文贵爆料对中国政局的影响有多大？中共在海外的大外宣，目的是影响海外的政局，郭文贵能否阻止中共的大外宣达到目的？\n\n[00:02:55]刘仲敬：撇开枝节问题谈实质，1989年以后的中国之所以能够存在，而且一直存在到现在，就是因为它扮演了西方世界半心半意的代理人的角色。这一点是历史基本格局决定的。自古以来，无论在什么时候，国际政治都是有中心也有边缘的。中心区对边缘区的影响，永远大于边缘区对中心区的影响。在古罗马时代，埃及的托勒密国王和克莱奥帕特拉女王谁能够上位，不是取决于他们自己谁强谁弱或者谁更聪明能干，而主要是取决于罗马元老院的意见。罗马元老院的意见对于埃及人来说至关紧要，但是反过来却不是这样。罗马元老院本身处理问题，主要是根据罗马内部各个政治集团，而不是根据海外的利益，海外对于它来说只是一个额外和附加的东西。但是对于埃及各派来说的话，取得罗马的支持或者遭到的罗马的反对就是生死存亡的问题了。近代以来的世界秩序，中心一直是在西方，包括美国——第二次世界大战以后中心移到了美国，所以美国打一个喷嚏，东亚就要感冒。\n\n[00:04:07]国民党的支持者一向有一个判断：就是因为抗战结束以后的那几年美国采取了近乎孤立主义的态度，同时国务院又有很多亲共人士，所以害死了蒋介石。这个判断是有根据的，差不多在同样一个时期，美国对东欧采取消极政策，结果让斯大林在这个时期把波兰、匈牙利和捷克斯洛伐克都毁掉了，然后美国积极起来以后，苏联就拿不动柏林了。中国共产党，我们也都知道，它能够打败国民党而统治整个东亚大陆，有一个关键因素就是，第一，它利用了美国粉红色左派对罗斯福和杜鲁门政策的操纵，利用了美国在战后初期的那一个消极时期，抓紧这个时期打击国民党，第二就是它得到了苏联的积极支持。但是1990年以后，柏林墙倒塌以后，苏联不复存在了，中国共产党不能够像是1972年以后和八十年代那样在苏美之间左右逢源，当然也更不能像是1958以前那样完全依靠苏联了，它自身的实力仍然只能够处在边缘区。\n\n[00:05:18]实际上无论它的意识形态色彩是怎样的，它就只能面对两种前途：要么说服美国人相信，现在的共产党人不是真正的共产党人，而是一个普普通通的威权主义政权，经过适当的改造，发展市场经济到了一定程度以后，最终是可以改好的，最终是可以加入西方世界的；如果它不能说服美国人相信这一点的话，那它就会立刻遭到毁灭。前南斯拉夫就是它的前车之鉴，前南斯拉夫以前存在的理由也是，跟苏联发生冲突，美国愿意保护它对抗苏联，但是在苏联不复存在以后，西方世界没有必要再保护它，它一旦失去西方世界的支持以后，立刻就土崩瓦解了。\n\n[00:06:02]共产党的中国要想避免这一点，那就只能够做出比它原来愿意做的更多的牺牲。邓小平就用这样的方法来描绘说：我们愿意给西方的资本家做出更大让步，“我就不相信资本回来以后，资本家的政府不回来”。这种让步就是秦晖教授和其他许多人说的“低人权优势”。因此共产党在九十年代以后采取了很多从经济方面来看是属于接近自由主义、接近资本主义的政策，愿意给西方的企业很多优惠条件，甚至比它们在其他第三世界国家——例如在非洲和东南亚得到的优惠条件更多。例如，拉丁美洲和东南亚的工会往往很强大，非洲的劳工保护法往往是跟欧洲一样严格，使资本家不能赚到太多的利润；而中国共产党不顾它共产主义的出身，坚决地愿意给西方的投资者更多的好处。因此，中国经济在西方输入资本和技术的情况下有了很大的发展。\n\n[00:07:05]在2004年和以后，台湾问题发生胶着或者是人权问题和其他问题在西方引起批评的时候，中国外交官和院外活动集团说服美国放中国一马的主要理由就是，中美之间有很大的共同经济利益。美国看在这方面才压住了台湾，同时也不太认真追究中国方面在人权问题和其他问题上面的越轨行为。所以可以说，包括大外宣在内的中共在西方——特别是在美国的院外活动，对于中共来说是一个生死存亡的问题。如果中共不能够得到西方——特别是美国的拥抱熊猫派的合作，对于它来说，它的政权就很快会支持不住。\n\n[00:07:50]当然这样做对西方的政治体制——特别是对美国的政治体制是一个腐蚀。当年在罗马帝国的时候，小加图这样比较正直的元老院议员也就说，很多罗马元老已经不像以前比较淳朴的时代那样正直了，他们不再代表罗马选民本身的利益，而是接受了东方各君主的贿赂，在元老院里面为东方各君主说话了，他要求恢复罗马古代纯正的古风，消除这些腐败现象。其实现在发生的情况与此非常类似。共产党的院外集团在美国活动，对于美国的政治体制是一个腐蚀。美国的议员或者政治活动家本来应该全心全意为选举了他们的选民服务，为美国的国家利益服务，不应该为外国服务的。但是实际上，由于美国的超强地位，俄罗斯的活动家、伊斯兰世界的活动家和共产党中国的活动家都把在美国的院外活动看成自身的生命线。所以川普当选就引起很多人对他的攻击，说俄罗斯对他施加了不正当的影响，诸如此类。其实这种事情也就是过去埃及和叙利亚对罗马元老院所做的同样的工作。这种攻击对川普和共和党也许是不公正的，但是我们要看到，这种现象存在的背后是有国际形势的基础的。\n\n[00:09:05]郭文贵，无论他最初的动机是什么，他现在所做的事情就等于是把共产党在美国和西方世界的间谍活动和院外活动挑出来，而这样一挑出来的结果，就会引起西方主流政治家的警惕：这样做是不是会毁坏西方民主制度的传统呢？如果这样做对西方民主制度的传统不利的话，那么无论经济合作得到多大的好处，这种现象都不应该被容许继续下去。所以共产党当然会反对这种现象。他们可以报复郭文贵，包括采取骚扰行动。你不是要在美国人面前出我们的丑吗，那么我们就派人到美国来骚扰你，跟你打官司，用各种方法来分散你的时间精力，让你没有办法全心全意对付我。\n\n[00:09:48]这种做法他们当然是很擅长的，但是仅仅这么做是不足以挽回败局的，因为政治形势的根本发展还是取决于美国政治的内圈，就现在来说就是取决于共和党主流派和川普周围的这个私人班底之间的问题。如果他们双方能够和谐相处的话，那么川普内阁要推行他们的政策是不会有太大问题的；如果发生了冲突，美国自身政治的走向出现不确定因素，那么美国打一个喷嚏，全世界都要跟着感冒，东亚的前途，包括中国共产党的前途和郭文贵以及他朋友的前途，都要取决于这些不确定因素了。所以对于他们来说，尽管双方之间正在相互斗争，其实他们的大部分命运都要取决于他们自身控制不了的许多因素，最主要的就是美国共和党建制派对川普班底的看法。这个因素是共产党和郭文贵本身都控制不了的，但是美国人将来会做什么主要就取决于这个因素。郭文贵的爆料和共产党施加的各种影响都只是在这个因素之上加了一些胡椒或者佐料，给它调了调味，但是主要的前途还是要看美国政治阶级内部之间的合作和冲突。\n\n[00:14:41]郭文贵对中国的影响是这样的：因为美国的国体是以基督教和自由民主为立国之本的，跟中共是根本不能相容的，所以要让美国对共产党宽容了这么几十年，这本身就只能用那些不太光明正大的人才能做到，只能用那些看重利益而不看重原则的人才能做到，只能用那些相对而言比较腐败而不太正直的人才能做到，而这些人的共同特点就是，他们只能依靠密室交易，而不能够让事情揭得太开，所以只要把锅盖揭开了，结果总是对他们不利的，对他们不利，也就是对中共不利。中共跟美国的基本盘不对等，美国如果不跟中国发生关系的话，那么对中共的损害远远超过对美国的损害。所以任何清除美国政坛腐败现象的结果，最终都将对共产党不利。哪怕这个爆料的人是阿拉伯人，揭露的是伊斯兰教或者普京手下的人对美国政坛进行腐蚀的材料，只要在美国政坛制造出了一种反对腐败、恢复美国立国精神的气氛，造成的结果就同样也会对中共不利。\n\n[00:15:56]对于中共内部的权力结构，我们可以用比较简单粗暴的话来说，中共内部的权力结构是包括有两种人。一种是洋务派，包括那些部分负责对外交涉的红二代和改革开放以后才通过科举和高校或者团组织进入体制内的高级干部。这一批人为共产党服务的主要贡献就是，帮助共产党搞经济建设，同时帮助共产党跟西方世界发生关系——这两者其实是一码事，因为如果没有西方的资金和技术输入，中国的改革开放是根本搞不起来的。这种人在体制内的地位比较接近于李鸿章。他们被某些人认为相当强大，甚至被许多乐观的评论家认为能够推动改革开放，能够促使中国向民主化和资本主义化的方向走，但是实际上这些判断都是太高估了。2012年以后的趋势已经很明显，这一派在中共体制内已经明显失势。\n\n[00:16:56]体制内的新一派在习近平时代占了上风，他们包括两种人：第一就是最老的共产党的核心，也就是苏联共产国际培养出来的那批核心干部，他们对资本主义是没有信心的，同时他们也知道自己不可能真正见容于资本主义世界，如果交出了政权、放弃了权力，他们就要落到任人摆布的下场；另一部分则是我称之为土鳖派的干部，就是说像陕西这样的内地的干部，他们即使是在改革开放这三十年，由于工作方面的原因，他们很少跟西方接触，同时也不大从事关于经济、技术建设这些需要一定含金量的工作，这些人在内地的干部当中和在强力集团——也就是公检法部门中还有相当大的势力。习近平所依赖的势力也就是这两种势力的总和。\n\n[00:17:49]现在中共目前处在这样一个阶段，很像是甲午战争和戊戌变法失败以后的那种状态：李鸿章集团和康有为集团如果不是已经彻底失败，至少已经是濒临失败；而在李鸿章时代和康有为时代好像是一度能够主持大清改革开放的那些力量不存在以后，原先好像是只在肃顺时代以前才存在、现在已经失势的那些力量又重新站起来了。这些力量在清朝就体现为端王那些支持义和团势力的力量，他们不了解西方的强大，也不了解改革开放本质上是沾西方的光，还以为大清真的有力量，要求大清走原教旨主义道路，最后导致了义和团战争。现在习近平周围的人明显是属于这一流派的。所以孙政才倒台以后，你可以合理地推测，当初重用郭文贵、跟郭文贵关系比较好或者是跟郭文贵保持着一定联系的那些集团——主要就是我刚才描述的那个洋务派集团，在最近几年内是处在节节败退的状态，很可能会在十九大上遭到全军覆没的下场。而郭文贵在美国的出现即使不是他们策划的，至少也代表了他们相当一部分人的看法——他们不希望中美之间关系发生恶化。但是如果美国回归立国之本的基督教和自由民主的路线，那么中国无论如何都是要倒霉的。\n\n[00:19:21]同时，美国方面这样采取强硬政策，对中国党内斗争来说的话，实际上是会发挥不利于洋务派的作用，因为洋务派能够生存的基础就是要搞好中美关系，要继续推动改革开放，如果国内的政策急剧左转，使改革开放变得不必要——目前已经有很多蛛丝马迹显示出这方面的迹象了，或者是中美关系趋向于紧张，以至于最高决策层认为，和经济发展相比，维持政权更加重要，宁可让中国人都去吃土豆，也不愿意让共产党的统治发生动摇，宁可让中国人吃土豆而在共产党的统治之下继续活下去，也不愿意让中国人都吃上牛肉而让他们觉得共产党已经变得没有存在的必要了，如果他们这么考虑的话——事实上他们很可能就是这么考虑的，那么郭文贵的出现会给习近平和他周围的强硬派提供更多的论据，让他们下定决心，宁可牺牲掉改革开放派、洋务派和他们代表的资本和技术，也要维护共产党本身的政权，把郭文贵作为洋务派的一个罪名来加以使用，用他来证明，我们重新走回闭关自守的道路，重新走回对抗西方的道路，不但必要，而且正确。这种事情是很有可能发生的。\n\n[00:20:41]这样一来的话，那么郭文贵在国内的朋友就必须得面临选择了：要么像郭文贵一样，干脆放弃了中国这个盘；要么就下一个最大的赌注，试一试你自己的政治实力够不够资格再召开一次遵义会议。照我看，在不久的未来，国内的改革开放派、洋务派或者技术官僚派如果没有足够的实力和决心开一次遵义会议的话，他们将来的下场是很惨的。能够跑到西方、像郭文贵一样在西方的庇护下做寓公，就已经是很不错了。如果既不能够把政策的决定权重新夺回到自己手里面，又不肯下决心抛弃共产党的整个体制、完全投靠西方的话，那么脚踩两条船的结果是，他们将会成为最大的输家，被双方撕到五马分尸的下场。\n\n[00:22:21]主持人：如果洋务派不断走下坡路，会不会很快就出现上面是慈禧太后、下面是义和团的那种局面？\n\n[00:22:49]刘仲敬：这种可能性已经是非常大了，已经是近在咫尺了。实际上，历史上的事情总有一个图穷匕首见的时候。当初改革开放开始的时候，双方都是抱着一定程度上的误解的。美国方面的情况是，美国方面有屠龙派和拥抱熊猫派：屠龙派认为共产党总是共产党，没有什么温和派共产党和开明派共产党，我们只有把共产党彻底消灭了，才能保护自由民主和文明；拥抱熊猫派的意见就是，共产党内部还是有一些开明派的，可以希望通过他们和平演变，把中国引向民主和资本主义的道路，这样做比起直接消灭了共产主义来说的话，成本要低一些，对中国人民也要更好一些。结果是拥抱熊猫派占了上风，才有改革开放三十年的成就。\n\n[00:23:38]但是习近平政府的所作所为等于是向美国人证明，拥抱熊猫派错了，而屠龙派是正确的。考虑到大部分实力和绝对优势毕竟是在美国这一边，一旦美国的政治核心做出这方面的决定，那么一种类似于麦卡锡时代的政治转变就会开始。当年美国就是从罗斯福时代袒护苏联，帮助苏联消灭德国和日本，容许苏联占领东欧和中国，然后急剧地转向保卫德国和日本不受共产主义的进一步扩张。也就是说，我们以前太相信苏联了，结果上当受骗了，现在证明苏联是不可信的，我们只有硬对硬了。然后就是几十年的冷战，最后证明苏联仍然不是美国的对手。\n\n[00:24:22]现在的情况也是非常相似。美国国内的智囊早在两年前就已经开始争论了。原先主持中美友好的那些拥抱熊猫派的官员和知识分子都感到非常痛苦，因为北京政府的所作所为实在是打了他们的脸，实在是让他们在政府面前没有面子。他们信誓旦旦地说，我们只要对中国人好，给共产党多一点机会，中国人是会改好的，共产党是可以改造的。但是共产党用实际行动来证明，共产党把美国人当傻瓜，在从美国人这里取得了很多资金和技术、弄得自己羽翼丰满以后，现在准备反咬一口了。这就是斯大林从1945年到1949年这段时间对西方做的事情。\n\n[00:25:09]考虑到大部分实力还是在西方这边，很快的，如果现在的局势按照过去这几年的方向继续发展下去，过不了五年，美国又要进入一个麦卡锡主义时代。过去的拥抱熊猫派的知识分子和专业官僚都要完全失势，像过去的谢伟思一样，在政府内部混不下去，结果只有去教书了。这个关系还小，他们去教书对他们自己也没有什么损害，但是对于中国来说，一旦美国下定决心以它的巨大实力把中国封锁一下，中国就算是整个完蛋了。共产党固然要完蛋，中国国内的人民也要得到吃土豆或者是比吃土豆更加悲惨的遭遇。而共产党内的强硬派呢，要么是不清楚西方的实力，要么就是因为他自己罪行太大，算定了自己在转型以后也得不到宽恕，所以宁可让中国人民全都饿死，也要下定决心去做这件事情。\n\n[00:26:03]所以唯一的疑问就是，洋务派到底有多大实力？如果洋务派像以前的李鸿章和康有为一样，只是在舆论界势力还比较强大，但是在强力部门并没有很大的力量、很容易被搞掉的话，那么我们可以合理地推断，他们死了不要紧，中国境内的十几亿人是要遭到极其悲惨的命运的，这个悲惨的命运很可能会使1960年的大饥荒相形见绌。但是从目前的情况来看，我也看不出还有多大机会可以避免这种命运，除非是洋务派实力真的很强，在以前可以韬光养晦诱敌深入、目前已经没有多少时间的最后这段时间，仍然可以发动逆袭，仍然可以来一个类似政变的、类似遵义会议的拨乱反正，把政策主导权抢到自己手里面。\n\n[00:26:56]如果他们做不到这件事情的话，那么照共产党内的游戏规则，失败者的下场是极其悲惨的。孙政才没有好下场，郭伯雄没有好下场，他们没有好下场以后，胡锦涛、江泽民身边的那些重臣也不会有什么好下场，整个在江泽民和胡锦涛时代主持政策的技术官僚都会落到很惨的下场。而比他们的地位更不如、依靠对西方的贸易和西方的经济技术吃饭的几亿人民，下场还会比他们更难看。现在这种可能性是超过六、七成的，其他的可能性加起来都达不到三、四成。\n\n[00:28:06]主持人：你怎么看最近的中印边境冲突问题？\n\n[00:28:53]刘仲敬：这个问题有两方面，一个层次是技术上的，一个层次是格局上的。技术上的问题就是，从封建主义来的所有国家，它们都没有明确边界的，经常是两属的。像欧洲的安道尔大公国，它就同时是法兰西国王和西班牙国王的藩属，这在封建时代是很正常的。一个小国，像琉球或者安道尔那样，有两个以上的宗主，同样的，一个宗主也在其他领主的领地里面拥有很多藩属，这都是非常正常的现象。像西藏就是一个典型的封建体系。一方面，西藏的主要权力是掌握在教会贵族的手里面，教会贵族和北京的满洲皇帝产生了这样一种关系——类似于罗马教廷和日耳曼人的神圣罗马皇帝之间的关系，满洲皇帝用军事力量给拉萨的教会提供支持，拉萨的教会用宗教和文化力量来支持皇帝。同时，西藏本身和西藏周边的地区都有很多小的封建领地，包括像春丕河谷，包括像锡金、不丹这样的领地，它们也是两属的。它们一方面是拉萨达赖喇嘛及其政权的藩属，跟它有宗教上和封建性的联系，一般来说要给它寄送一些礼物或者贡品，有的时候还要经常到拉萨去朝圣；另一方面它们也是南方英印帝国的藩属，接受英印帝国的保护。\n\n[00:30:25]像冲突发生的地点春丕河谷，在英印帝国时期就相当于是英印帝国的上都，类似西姆拉那样的地方。因为印度是个很热的地方，所以英印帝国的英国官员往往夏天就要到那里去避暑，避暑的过程中没事干，就要捉捉蝴蝶，采集植物标本。所以你如果是植物学家的话就可以看到，很多植物品种都是用春丕这个地方来命名的。这就说明英国人早就在这里面行使了相当大的权利。这个权利跟现代民族国家所谓的那种边界性的、排他性的主权是不一样的，它是一种宗主权。也就是说，大不列颠和爱尔兰联合王国的国王兼任印度帝国的皇帝，然后以印度帝国皇帝的身份，接受包括锡金（哲孟雄）、不丹或者其他诸如此类的地方的封建领主的效忠。同时，作为印度的皇帝，他在拉萨也行使了很多封建权利。等于说，整个西藏都有复杂的封建关系，一方面它跟北京的皇帝有封建关系，另一方面跟大英帝国派去的那个副王也有封建关系。所以英印帝国在拉萨享有很多封建特权，在春丕河谷也把当地的封建诸侯视为自己的藩属。春丕河谷的封建诸侯等于同时是德里副王的藩属和拉萨达赖喇嘛的藩属。\n\n[00:31:55]所以这里面本来就是留有不确定因素的。你如果讲自古以来的历史权利，那么达赖喇嘛可以提出一定的历史要求，认为不丹和锡金在历史上的某一时期都是它的藩属，同时印度人也可以提出要求，认为它作为大英帝国在东方的继承者，不仅继承了大英帝国对锡金和不丹的保护权，继承了对喜马拉雅边境各封建领主的宗主权，同时也继承了西藏境内的许多封建权利。这些权利是大清帝国、大英帝国和达赖喇嘛的政府都承认过的，所以北京的中华人民共和国政府和南京的中华民国政府一样，是没有权力单方面取消这些封建权利的。要取消，也还得要印度、西藏和南京或北京政府三方共同协商才能够修改。\n\n[00:32:48]因为现在的印度联邦共和国就是大英帝国在东方的继承者，大英帝国在撤出东方的时候是把大英帝国在东方的所有权利都交给了印度联邦共和国和巴基斯坦的，所以印度联邦共和国继承了大英帝国对锡金和不丹的保护权，也继承了大英帝国在西藏的众多封建权利，所以印度可以根据这个权利对不丹施加保护。如果不丹和中国之间的边界没有划定、或者说是不丹和西藏发生冲突的话，那么印度有义务来保护不丹。所以尽管发生纠纷的地方是在不丹边境上，但是印度有权代表不丹来保卫这些地方，就像以前如果大清帝国跟尼泊尔和不丹发生纠纷、那么大英帝国就有义务来保卫这些小国是一样的，印度现在就是在行使这个保护权。印度对不丹的保护权，是英印帝国所继承的封建权利的一部分，这部分现在由印度继承下来了。这是从技术上的方面。\n\n[00:33:51]历史上的封建国家转化为现代民族国家，像法国和西班牙的边境之类的，都要对过去的封建权利做一番清理。现在呢，这个清理工作在欧洲是基本已经完成了，法国和西班牙的边境、法国和德国的边境都已经划定，但是在世界上的大多数地方其实都还没有解决。像东亚的围绕着西藏的各个问题，从法律意义上来讲都是过去的封建性历史权利如何转型的问题。这些权利是真实存在的，而且是重叠的。封建权利是可以有重叠性权利的，就像琉球群岛既是大清帝国的、又是日本帝国的那种情况。像春丕河谷这种地方，它既是西藏的，又是印度的。如果西藏是属于中国的，那么它就同时面临着过去的宗主权利现在应该怎样分配的问题，同时，不丹和印度之间的关系到底是应该最终转型为完全平等的民族国家之间的关系，还是继续维持大英帝国和印度帝国时期留下来的那种封建式或半封建式的宗藩保护关系，现在还都在未定之中。它可以通过双方都同意的协商方式来解决，也可以通过战争方式来解决。这是法律的方面。\n\n[00:35:09]从政治的方面来讲就是，现在的中华人民共和国虽然是一个共产主义国家，但是它由于历史的关系继承了大清帝国的许多历史边疆，包括在西藏这一片，所以它在西藏、在内亚这一片行使的是帝国的权利，而不是民族国家的权利。这就是因为东亚本身转型不彻底。如果是像韩国或日本那样，它已经转型为现代的民族国家，等于是已经阶梯性解体了，那就是说，大清帝国不能拿着朱元璋时代或者康熙时代的规律说，你韩国是我的藩属国，韩国和日本的纠纷要由大清帝国的继承国——中华民国和中华人民共和国来处理。这个问题之所以能够解决，就是因为韩国已经转型为民族国家，它跟中国的关系不再是过去封建时代的、帝国时代的那种宗藩关系。\n\n[00:35:59]但是中国和西藏的关系就很成问题。大清和西藏的关系，原先是类似朝鲜的那种宗藩关系，它不是民族国家的那种领土关系，但也不是说大清帝国对西藏就毫无权利、西藏就是个完全独立的实体，而是介于两者之间的关系。它跟西藏的关系就比较接近于法兰西共和国和安道尔大公国之间的关系。安道尔大公国是依附于法兰西君主国的；但是法兰西共和国跟安道尔的关系呢，就是一种保存了原先一部分封建遗产的那种既平等又不平等的关系。因为法兰西共和国是一个民族国家，它不能够承认藩属关系，但是安道尔大公国过去是依靠法兰西国王保护的，法兰西共和国又不能撕毁这个保护的义务。\n\n[00:36:47]现在中国在西藏的处境就是处在这种模糊的状态。中国共产党坚持说，中国是一个民族国家，西藏是中国的领土。这在历史上讲是站不住脚的，因为宗藩关系和民族国家不一样，而且民族国家无论在欧洲还是在东亚都是近代以来才存在的，就是中世纪的法兰西王国也不是民族国家，明朝和清朝当然也更不是民族国家。所以，你用民族国家的规律去讨论西藏问题，本身是没意义的。但是它坚持“中国已经是一个民族国家”这一点，就使得问题陷入僵局，没有办法解决。中国等于是依靠帝国的历史权利，试图行使民族国家的资格，自身陷入严重的矛盾之中。\n\n[00:37:31]但是另一方面，印度也不是一个彻底的民族国家。首先，过去的印度，无论是以前的莫卧儿帝国、孔雀帝国还是后来的英印帝国，它们都不是民族国家，而是帝国。英印帝国不仅统治了印度，还对阿富汗、中亚的很多埃米尔国、对西藏和缅甸行使宗主权。也就是说，作为印度皇帝的英国国王不仅是印度本身的统治者，不仅是印度各邦和各土邦的统治者，而且也对中亚的穆斯林国家、西藏的佛教国家和缅甸的小乘佛教国家行使着很多封疆意义上的宗主权。这些权利最终都由印度来继承了。所以印度无论是从法律上讲、从地缘政治上讲还是从国际形势上讲，它都是过去的英印帝国在东方的继承者。现在的大不列颠和北爱尔兰联合王国以民族国家的姿态出现在欧洲，不管东方的事情了，但是现在的印度联邦共和国却继承了大英帝国的东方遗产，它在中亚、东南亚和西藏本身都继承了帝国的遗产，以帝国的姿态办事。像它现在不为了自己出头，而是为不丹出头，它自己不要求争议地区的领土主权，而是要求代表不丹来保护这些地方，实际上本身就是一种帝国权利。\n\n[00:39:00]以前印度因为自己经济形势不太好，实力不足，所以没有明显地显示出这种帝国权利，但是印度的精英非常清楚，“印度之大，大于世界”，印度也是和中国一样相当于整个欧洲的。如果世界上有哪个国家像帝国而不像民族国家，那就是印度和中国。印度比中国好一点，因为它至少是承认联邦制度的，它内部的各个族群和过去的各个土邦通过联邦制的形式得以部分地满足了它们的权利要求，因此不会像中国的西藏问题这么尖锐。但是印度的规模仍然是帝国的规模，它不是民族国家。南方的各小邦宁愿用英语也不用印地语，它们跟北方邦和中央邦这些北方核心邦的关系一直是相当紧张的。所以印度就它自身的帝国规模和它的发展态势来说的话，它早晚要染指中亚、东南亚和其他地方，行使它的帝国权利的。\n\n[00:39:56]这两种帝国权利的冲突，使得围绕着不丹的边境冲突注定不可能按照民族国家和民族国家的方式来解决，最终会演化成为两个帝国权利之间的冲突，而这两个帝国权利之间的冲突又会跟国际政治联系在一起。例如，中国可能会联系一些中东的伊斯兰国家打通一带一路，而印度的自然选择是，连接东南亚深受印度文化影响的国家和它的传统友邦越南与日本，从日本、越南、东南亚国家到印度，连成一条线，这条线路跟中国和穆斯林国家的线路隐然形成对抗之势。不丹的这场游戏，本质上讲是这个大博弈的一小部分，这个大博弈是直接继承了过去大英帝国、沙皇俄国和大清帝国之间的那场大博弈。\n\n[00:41:19]主持人：你觉得一带一路的前景如何？\n\n[00:41:57]刘仲敬：从国际体系的角度来看，首先，核心的国际体系始终是西方的国际体系，过去以大英帝国为中心，现在以美国为中心。中华人民共和国最初是像北朝鲜一样，是作为苏联的附庸国加入到这个国际体系当中的。苏联垮台以后，它就实际上是只有两种选择了。选择之一就是顺着改革开放的路，跟着美国走，最终和平演变成为美国国际体系的一部分。走这条路的结果，无论中间经过多少波折，但是最后的结果肯定是共产党不复存在。美国愿意支持你改革开放的前提就是，目前你是条件不具备，条件具备了以后，经济发展起来、中产阶级成长以后，你早晚要走民主和资本主义道路的，只有走了这条道路，你才能够融入以我们西方为主的国际俱乐部。但是共产党是不想走这条路的，走这条路就是它的政治自杀。\n\n[00:42:48]那么不走这条路还有什么办法呢？以前它还可以选择要么做苏联的附庸国，要么在苏联和美国这两个体系之间玩三国演义，左右逢源；但是现在，既然苏联已经不存在了，它要么长远看来最终会加入美国的体系而宣判共产党自身的政治末日，要么就利用跟美国交好的改革开放这一段时间捞取的这些经济上和技术上的好处，以此为资本，另外建立一个独立于西方的国际体系。它依靠这个国际体系，就可以逃避我刚才描绘的那种最终融入美国的国际体系、导致共产党政权不复存在的结局，所以为共产党自身考虑，这是一个必要的选择。但是为中国的那些居民考虑就不一样了，就中国的十几亿普通老百姓来说的话，跟着美国走没有什么不好的。跟着美国走，首先改革开放搞好了经济，然后再搞政治改革，把共产党去掉，这简直是天上掉下的福气，有什么不好的呢？但是共产党怕的就是这个。对于这些十几亿人民有好处的事情，对共产党没有好处，等于是宣判了共产党的死刑。因此它要避免这种命运，就只能绑架这十几亿人，欺骗美国，把从美国拿来的好处作为背叛美国的资本，另外搞一个一带一路。\n\n[00:44:07]一带一路在经济上是无利可图的，这是很明显的。如果某些地方在经济上是有利可图的话，那么私人资本家不是傻瓜，他们早就去投资了。之所以不去投资，就是因为私人去投资的话是无利可图的，要么是像阿富汗这样充满战乱，要么就是有其他方面的不利条件，总之是赚不到钱。如果能赚钱的话，人家能不去么。一定要在这个不赚钱的地方去投资，那么动机就只能是政治的而不是经济的，就只能是算政治账而不是算经济账。例如通过巴基斯坦的那条道路，那就跟蒋介石通过缅甸的那条道路一样，如果你想通过上海搞运输的话，那你走缅甸干什么，走缅甸的成本不是比走上海要高得多吗？蒋介石这么考虑，是考虑他将来如果跟日本打仗的话，海路被封锁了以后，那么缅甸这条道路无论成本多么高，都是他唯一的生命线了。巴基斯坦这条道路从经济上讲，同样根本不能跟上海相比，它纯粹是赔本生意。为什么要这样做？就是假定有朝一日要跟西方全面冲突，东部的海岸线都不能用了，那么这时候通向西部的这条管道才会变成生命线。只有在这种前提之下，一带一路在经济上才是有意义的。\n\n[00:45:18]修起了交通线，把过度的产能和投资搞出去，跟伊斯兰国家搞好关系，形成一个平行的国际体系。一方面在这个国际体系当中，北京可能希望自己出来当领导，领导巴基斯坦和许多伊斯兰国家，就不再像是在西方国际体系里面只能跟着美国走了；另一方面就是，这样做我就不用在美国不断的压力之下由经济改革转向政治改革了，我依靠这些穆斯林国家的支持，我自己当老大，我也不靠你西方的经济和市场了。但是最后这一点是问题最大的，在经济上和技术上比较内行的洋务派是根本不可能相信这条道路能够起替代作用的。对于他们来说，这就等于像是以前在毛泽东时代支持坦桑尼亚那样，这是个赔本生意。我们有点钱拿出去赔本，赔一点也就算了，但是你想指望这笔钱能够代替中美贸易的巨大好处，那是根本不可能的，而且因为这是赔本生意，你还得必须依靠从中美贸易赚到的钱来填补这个亏空。如果中国能够继续跟美国保持良好关系，额外赔一点钱也就算了，如果搞这条路线的目的根本上就是为了将来中美关系恶化以后给自己找退路的话，那么可以合理地推断说，中美关系一旦恶化，从中美贸易中得到的这些好处一旦中断，中国马上就养不起这帮穆斯林国家了。这些穆斯林国家从政治上、文化传统上和现实利益上讲，只有在中国能够给它们好处的时候才会跟着中国，一旦中国养不起它们，立刻就会背叛中国的。\n\n[00:46:48]所以一带一路的整个战略都是泡沫，建立在最高当局不可明言的政治野心和最高当局周围这些不负责任的专家提出的一些虚假建议之上。一旦中美发生决裂，中国养不起这些穆斯林国家，造成的后果是没有任何人能够收得起场的，目前也没有任何人提出合理的收场办法。他们提出的所有方案，实际上都是在假定中国经济能够像过去三十年那样不断增长的前提之下，才能够维持得起通向巴基斯坦、通向伊朗、通向叙利亚的这条道路。一旦中国经济增长开始减速，即使中美没有发生冲突，只要经济减速的话，这条路线就要养不起。如果中美像我刚才推理的那样很快就要发生冲突的话，那么这条路线就要变成中国的死亡之路。它打开的这条路线不但不能够对中国造成政治上的好处，反而会导致在历史传统和文化传统上讲比东亚要强固得多的伊斯兰社会对东亚的全面入侵。他们的人口年轻，他们的宗教组织充满了活力和扩张性，而东亚的人口已经老化，社会在列宁主义的长期管制之下已经基本上丧失了自我结社和自我保护的能力。这样一场冲突无论在国家层面上会是怎样，在社会层面上必然将有利于穆斯林而不利于东亚。\n\n[00:49:16]主持人：你觉得一带一路对新疆有什么样的意义？\n\n[00:49:26]刘仲敬：对新疆而言当然是一场灾难。从历史上来看，新疆自古以来跟中亚和西亚的关系比跟东亚的关系要密切得多。我们从最早的历史——就是周朝和汉朝看起，当时的种族结构跟现在不同。现在是甘肃省河西走廊的那一块，当时主要是伊朗系的居民在居住，他们的语言、文化和肤色都比较接近于伊朗人，也就是说比较接近于金发碧眼的那种类型。像唐代所谓的昭武九姓，安禄山那种昭武九姓，就是东伊朗系的代表。他们的昭武城，照主流考古学家的意见，昭武这个地名就出自甘肃，也就是说，甘肃这个地方主要是金发碧眼、像我们现在看到的楼兰女尸那样的人种所居住的，他们并不是蒙古人种。\n\n[00:50:14]在汉武帝通西域、“开河西四郡，以断匈奴右臂”以前，这块地方的主要居民是月氏人。月氏后来迁到中亚去，所以他们的种族背景是比较清楚的：他们明显是伊朗系的人，是金发碧眼的人。河西走廊一带和今天新疆一带的居民在周朝和汉朝基本上都是楼兰女尸那种金发碧眼的外伊朗系的居民，是属于塞种或者吐火罗系的居民。黄种人或者说是蒙古人种开始进入这块地方，就是从汉武帝通西域、开河西四郡开始。而他开河西四郡以后，移到河西四郡的居民很多，但是移到西域各国的居民很少。随着汉朝的覆亡，很快就消失了。\n\n[00:51:03]直到唐朝，像龟兹人或者昭武九姓那些居民仍然是以伊朗系为主的。他们在安史之乱的时候，有一部分参加了安禄山的集团，反对唐朝，另一部分则参加了李抱玉、李光弼他们的集团，帮助唐朝打那些安史叛军集团。但是无论是支持唐朝的人还是反对唐朝的人，他们有一个共同特点：他们都是伊朗系的人，跟西亚的关系比跟东亚的关系要密切得多。直到五代十国时期，五代十国中间除了朱温的后梁那一代，其他四代都是出自河东的沙陀人集团。沙陀就是唐代的处月部落，处月部落东迁以后变成后来的沙陀人。照现在的考古学证据来判断的话，他们主要也是白种人。\n\n[00:51:51]直到沙陀人灭亡、宋朝消灭了五代十国以后，伊朗系人口对东亚的优势地位在东亚本土才变得不太明显。同时，在内亚发生了突厥语居民替代伊朗语居民的过程：原先大体上是讲伊朗语的包括新疆、包括哈萨克斯坦的七河流域、包括今天乌兹别克和塔吉克斯坦的河中地这一大块地方，由讲伊朗语的居民逐步转化为讲突厥语的居民。今天的维吾尔人、哈萨克人和中亚的大多数民族，从语言上来讲，除了塔吉克人还是伊朗系以外，其他各民族在语言上讲都是突厥系的；但他们在人种上讲则是过去的伊朗人和后来的突厥人、蒙古人的混血儿，也就是说，包括了一部分雅利安的血统，也包括了一部分蒙古人的血统。\n\n[00:52:49]例如像维吾尔人是现在新疆的最大民族，他们就明显地包括了蒙古帝国征服时期察合台汗国和窝阔台汗国带到西域去的蒙古人，这些人主要集中在吐鲁番到龟兹这一带——也就是比较靠东部的地区，也包括过去从汉朝到唐朝伊朗语系占优势的地区的那批伊朗语居民——这批人主要集中在阿图什、喀什这些西部地区。所以，现在的维吾尔民族是二十世纪初叶构建的，从种族、血统上来讲是伊朗-雅利安系和蒙古系的一个混血。吐鲁番一带的维族人，从体质人类学的角度来看，比较接近于蒙古高原上的居民；而西部阿图什和喀什的居民，在体质人类学上比较接近于乌兹别克人，也就是说比较接近于白种人。所以你现在看到的维族人的相貌，有很多金发碧眼的、比较接近于白种人长相的，可能是西部血统比较重的；比较接近于蒙古人长相的，就可能是吐鲁番血统比较重的。\n\n[00:53:54]而突厥语的核心现在无疑是在土耳其，土耳其是北约成员国，也是突厥语各国当中实力最强大的，也是泛突厥主义的中心，所以维吾尔人在海外的流亡者有很多都跑到土耳其去了。像塔吉克这样的伊朗系居民呢，他们在文化上的母体当然是伊朗。但是无论是伊朗系还是突厥系，今天新疆的主流居民，他们的根都在西方。从文化上来讲，他们要么因为伊斯兰宗教的影响要去麦加朝圣，因此他们的心向着西方，要么是从世俗文化的角度来讲，突厥文化的人心向着土耳其，伊朗系文化的人心向着伊朗。而伊朗和突厥从历史传统上来讲，都是跟东亚儒家文明平起平坐甚至更胜一筹的强势文明。像土耳其人就认为，中国古代历史所谓的伏羲和五帝其实都是突厥人，突厥人是中亚的文明民族，汉朝也好，唐朝也好，都要依靠从内亚的突厥人那里输入文明。\n\n[00:54:57]这一点有部分的依据，就是说，内亚确实是向东亚输出了很多技术和文明。当然这个交流也不是单向的，东亚人从内亚那里学到了很多东西，内亚人也从东亚那里引进了很多。葡萄酒是东亚人从内亚引进的，但是丝绸技术可能就是伊朗人从东亚引进的。伊朗现在的里海海岸一带是伊朗的一个大的稻米产区，也是丝绸产地，他们的丝绸技术和稻米技术也是在一定程度上——特别是在蒙古帝国打通了东亚和内亚的交通线以后从东亚学到的。文化交流是双向的，双方都有一定的理由说，你学了我，我也学了你。\n\n[00:55:36]但是从历史上来讲，可以说，文明首先是在西亚产生而不是在东亚产生，东亚文明比西亚文明要晚了一千年。所以要么我们说文明不分高下，大家都是相互学习的，要么一定要分出高下的话，那么无可争议的是，西亚的文明比东亚的文明高级，主要是东亚学西亚，而不是西亚学东亚。而内亚人主要是西亚向东亚输出文明的一条轨道，所以内亚各文明无论是从宗教上看还是从文化上看，它跟西亚的关系都比跟东亚的关系要密切得多，跟土耳其、伊朗和麦加的关系比跟北京、南京和曲阜的关系要密切得多。\n\n[00:56:18]之所以新疆目前是属于中国的，只是出于外交上的安排，由于中华民国当了两次世界大战中的战胜国的缘故，而奥斯曼帝国当了世界大战的战败国。但是如果下一次发生风吹草动，比如说就像习近平现在思想中的计划，得罪了美国，最终导致中国在对美国的冲突中一败涂地，那么要么中国像以前的德国和日本一样，帝国遭到肢解，要么就像苏联一样，虽然没有在军事上打败仗，但是国内的社会经济全面崩溃，导致自身的瓦解，这两种情况只要发生任何一种，那么新疆的主流居民必然会向着西亚而不会向着东亚。\n\n[00:56:57]所以中华民国和中华人民共和国过去控制新疆的政策就是，尽可能地切断新疆跟西亚的关系。这对新疆本身的社会经济是相当不利的。例如在元朝时代和元明之间，像喀什、叶尔羌一带一度是天文学和各种文化交流的主要中心。叶尔羌的经学院在伊斯兰世界是非常有名的，喀什的天文台是仅次于撒马尔罕的天文台。跟北京相比，喀什的天文学家毫不逊色。叶尔羌的宗教学者也会觉得，自己不比南京和北京的儒家学者差劲。和田的丝绸匠人也会觉得，自己不会比广州的丝绸匠人和景德镇的瓷器匠人逊色。但是这些经济和文化繁荣的先决条件就是，现在的新疆这块地方能够维持它通向西亚和内亚的贸易和文化交通线。叶尔羌在清朝实行锁国政策以后，就急剧地衰退了。喀什过去是繁荣的商埠，但是在清朝封锁以后，就渐渐退化了。在清朝后期，喀什和叶尔羌的经济文化再也不能跟元朝的时候相比，主要就是因为封闭。\n\n[00:58:11]你从喀什人和叶尔羌人的角度来看，他们有理由憎恶清朝，也有理由憎恶蒋介石和毛泽东，因为他们过去在元朝和明朝时期是独立邦国的时候，依靠发展西方的经济和贸易关系，一度是非常繁荣和先进的，现在被你们封锁起来，就变得贫困和落后了。广州和上海的商人有理由讨厌毛泽东，也是出于类似的理由。以前在大英帝国还在的时候，上海和广州是非常繁荣的；你毛泽东一把它们封锁起来以后，它们就变得非常贫困了，变得跟香港和新加坡没法比了。其实在大英帝国和中华民国初期的时候，上海和广州本来是比香港和新加坡强的。蒋介石跟日本一打仗，毛泽东跟着苏联对西方开战，结果就是坑害了广州人和上海人。如果能够理解广州人和上海人对毛泽东的痛恨，自然就能够理解喀什人和叶尔羌人对大清帝国、对国民党和共产党的痛恨。在他们看来，他们如果不是跟着你东亚的大帝国走，而是跟着西亚的土耳其或者伊朗走，或者是干脆独立的话，在经济上和社会上讲对他们都更加有利，他们不会像现在这样穷困的。一旦东方的帝国发生解体、他们有了这样的机会的话，他们是很可能会利用这样的机会的。\n\n[00:59:25]而一带一路等于是破坏了过去清朝、蒋介石和毛泽东都采取过的那种政策，它把过去封闭的西部边境重新打开了，然后新疆的突厥语居民和伊朗语居民、新疆的穆斯林现在终于可以像过去他们在元朝的时候那样跟他们在西方的同宗发生关系了。这个关系一旦重新建立起来，实力对比就立刻发生变化了。可以说，中国在新疆的统治当局，连同它在新疆的移民，能够在闭关锁国的前提之下对付新疆边界之内的突厥语居民和伊朗语居民，但是一旦边界开放，他们面对着边界内外连成一体的大批突厥语和伊朗语居民，面对着整个伊斯兰世界的力量，立刻就会落到安史之乱以后安西节度使和北庭节度使面对着回鹘人、阿拉伯人和西方的各个部族的那种状态。他们等于是穆斯林和突厥语居民汪洋大海之中的一个孤岛，任何一个波浪都会使他们遭到灭顶之灾，他们没有抵抗能力的。更何况一带一路的实际含义就是反对西方，在反对西方的情况下，北京政权恐怕是自身难保，更不可能有多余的资源来支持他们在西部的当局了。\n\n[01:00:51]所以我判断，如果习近平和他周围的人员真的能够获得成功，把洋务派彻底消灭掉，能够把中国再列宁化起来，重新组织起来，在长达二十年的时间内把整个东亚和新疆的资源都组织起来向西方挑战的话，那么它将不可避免地会使目前新疆的军政当局和新疆的非穆斯林移民遭到灭顶之灾，像唐代的安西节度使和北庭节度使的残军一样，在历史上彻底消失。这些人目前仅有的机会就是，洋务派取得胜利，然后中国重新回到跟着西方走的那条路线去，在这种情况下，他们还有一定的存活机会。如果中华人民共和国跟西方对抗，向穆斯林敞开大门，依靠穆斯林的势力来对抗西方的话，他们必定要成为穆斯林的手下败将。\n\n[01:02:55]主持人：西藏的文化更接近印度，但是为什么它在1950年代归附到中国而不是被印度所接纳？西藏问题在中印冲突中占何种地位？\n\n[01:03:59]刘仲敬：西藏是一个特殊的封建邦国。这样的封建邦国在中世纪的欧洲是非常常见的。它可以跟北京发生宗藩关系，但是自身又是印度边境上若干封建领主的宗主。同一个邦国既是很多邦国的藩属，同时又是其他邦国的宗主，这在封建体系中是极其正常的。在近代欧洲转型的过程中，自然就是解体论发挥了作用。最后是，像哈布斯堡帝国、神圣罗马帝国和俄罗斯帝国这样的大帝国最终解体了，原先只是封建小邦和族群的各群体最后都演化成为民族国家了，用这种方式解决了问题。\n\n[01:04:38]但是这样做当然也不是免费的，中间是打了很多仗、流了很多血的。所以如果我们假定欧洲式的国际模式——威斯特伐利亚式的国际体系能够普及到全世界，比如说普及到包括西藏和中国在内的东亚的话，那么为了使这块地方改造成为符合欧洲威斯特伐利亚体系的民族国家状态，还需要流很多血，发生很多政治冲突。这就要引到我所谓的“诸夏”那个概念，也就是说，中华人民共和国继承的这个大清帝国版图，必须由它现有的帝国状态重新瓦解组合成为一系列像欧洲式的民族国家，然后天下才能太平。在这之前，无论如何都是免不了冲突的。西藏只是这一系列冲突当中的一个。\n\n[01:05:27]它以前的特殊之处在于，清政府和英印帝国政府一般情况下都不想干涉西藏的政务，因为这样的干涉是倒赔钱的事情，他们只想保持这样一种资格，就是说，其他的强权不要染指西藏。英国人的立场是，只要俄国人不染指西藏的话，英国就不会出兵西藏，但是如果俄国南下的话，英国就要进军西藏，不是想要贪图西藏的领土，而是避免西藏落入强大的俄罗斯帝国手里面。只要清朝跟西藏维持过去的宗教性质的关系，大英帝国也不反对，但是西藏如果跟清朝发生了政治性的冲突，大英帝国就要站出来充当调解人，以免双方之间的冲突影响到英印帝国的太平。这就是说，英国人采取的是一种模糊的调解人政策，它并不要求西藏归属于英印帝国，只是要求俄罗斯帝国不要染指西藏，清朝政府不要跟西藏引起太大的冲突，只要冲突保持低烈度状态，英国人是不管的。\n\n[01:06:32]以后印度人所继承的就是英国人这种政策和状态。它并不要求西藏归属印度，也不要求西藏正式独立，但是它要求继承清帝国的南京国民党政府和北京共产党政府尊重西藏人的特殊权利，以及尊重印度从大英帝国继承下来的在西藏的若干特权。我们都知道，国民政府不承认这些权利，但是它也没有力量改变西藏的状况，所以双方没有接触。而共产党1959年用突然袭击的方法出兵西藏，撕毁了原先大清帝国、西藏和英印帝国三方达成的协议，这个严格说来是不合法的，但是印度也没有以武力反对。直到达赖喇嘛出逃，北京政府全面改变西藏的现状，也取消了印度在西藏的所有特权，印度人才提出抗议，但它也是仅仅抗议而已，没有采取实际行动。真的到了边境发生冲突的情况下，印度的政策才全面转向反对中国。印度目前的政策是，保护流亡印度的西藏人，但是并不对中国实际控制西藏的现状实行挑战，但它保护流亡西藏的这个事实本身也就是埋下了伏笔。可以合理地预期，中国如果再发生周期性的动乱的话，那么流亡在印度的西藏人也会像是1912年流亡印度的达赖喇嘛和他周围的人那样，轻而易举地反对西藏，然后重新取消中国对西藏的统治。\n\n[01:08:12]从中国的角度来看，这样做当然是不彻底的，它要求印度承认中国对西藏的所作所为，把流亡的藏人从它那里驱逐出去。但这是印度所不能接受的，不仅在外交上不能接受，在宪法上也不能接受。因为印度毕竟是一个民主国家，虽然是一个结构不完善的民主国家，但是所有民主国家都有尊重避难者的传统义务，无论中国和西藏之间发生了什么事情，西藏流亡者并没有做对不起印度的事情，那么他们在印度如果要求的仅仅是安全和庇护的话，印度是没有法定的权力拒绝庇护他们的，所以印度为了维持自身的民主性质和宪法秩序，它不能不庇护这些流亡者。然而只要它做到了这一点，它就必定会跟中国发生冲突。同时，印度除了西藏以外，在不丹、锡金这些地方还有大英帝国留下的很多封疆权利，这些权利必然要构成它和中国之间长期纠纷的根源。因此，西藏人虽然得不到印度人在政治上的积极支持，它至少可以以印度为基地，继续发展它的政治组织和文化组织，而这些政治组织和文化组织就像是漂流到海外的种子一样，在海外长大了，很容易就会回到海内的。中国共产党除非能够保证自己的江山能够万年，否则是没有办法避免在将来的某一个真空期重新把西藏送给这些流亡者的。\n\n[01:09:38]对于这一点来说，共产党其实是处在一个绝路。它对境内的西藏人可以想怎么干就怎么干，可以对他们实行强制的汉语教育，可以强迫他们批判达赖喇嘛，但是这些东西都是像济慈的墓志铭说的那样，是你写在水上的字，你无论在水上写字写得有多深，多么用力，都会被波浪所吞没，所谓电光影里斩春风。但是要想消灭藏人在海外的势力，那么就要求它打败印度，打败整个西方世界，这在技术上显然是不可能的，没有任何人会认真考虑这件事的现实可能性，所以这个僵局是无法解决的。中国在目前这种情况下就很像是饮鸩止渴，它每取得一个成功，就需要扩大它的战场，在海外打击藏人，打击一次成功以后，它就必须扩大它的打击范围，进行进一步的控制，但是这个控制范围的扩大就意味着它自身负担的扩大，它早晚会接近这样一个临界点——它自身的经济资源不足以支持这种扩张。例如，我可以在意大利收买意大利的一些政客，让他们打击海外的藏人——但是这当然是需要钱的，藏人可能会跑到德国去活动，我又要在德国搞类似的活动，一个一个搞活动，最后搞下来的结果就是，我除非把整个西方世界都买下来，否则我还是达不到这个目的，但是早在我能够把整个西方世界买下来以前，我自己早已经破产了。\n\n[01:11:06]请问，如果我有买下西方世界的这么多钱和这么大的力量的话，那么我为什么不干脆搞一场共产主义革命，把整个西方世界都颠覆了，由我自己当世界老大？答案当然是，因为我没有这样的力量。但是我既然没有推翻西方世界的力量，那么我用这样的小动作搞收买又怎么能达到目的呢？凡是没有能力在正面战场上打倒对方的人，用侧面的小动作也是打不倒对方的，因为正面的斗争需要资源，侧面的收买也需要资源，双方面都是有临界点的。你不敢正面冲突，只敢侧面收买，实际上已经是承认自己处在弱势一方，你预先就已经失败了一半了，然后用这种不光明正大的收买手段，结果到达临界点。要么就是你自己力量不够了，支持不住了，像毛泽东在援助坦桑尼亚的时候，国内都快要饿死了，最终还是支持不住；要么就是，你步子走得太大，引起对方的反弹，导致西方普遍地采取麦卡锡主义的方法，这种事情目前也到了临界点了。无论哪一种前途，你一开始就可以看出，都是注定走不通的。\n\n[01:12:11]注定走不通也就是因为有两个原因：第一个原因就是因为共产主义是注定要失败的，你为了避免共产主义失败所采取的所有迂回动作，实际上只是延长了你失败的痛苦和延长了你失败的时间而已，延长时间就是付出更多的代价，使你更加痛苦；第二就是，大清帝国遗留下来的这个超民族的帝国结构是没有办法在民族国家为主流的世界中站住脚的，无论是共产党、国民党还是其他什么人，只要你接了这个盘子，最终都要面临这方面的现实，无论你怎么处理，都不可能使所有人同样满意——这个问题跟共产党本身是没有直接关系的，但即使在没有共产党的情况下和没有共产党以后，仍然会继续发挥作用。\n\n[01:14:32]主持人：你对郭文贵有何建议？\n\n[01:14:47]刘仲敬：我对他本人的建议就是，现在他已经上了战场，处在暴露的位置上，就要一不做二不休了，如果退缩，会导致更大的危险。前进会有危险，但是危险较小；退缩，危险就会更大。所以如果碰上犹豫不决的事情，宁可冒较小的危险，让敌人在你的正面，不要冒较大的危险，让敌人在你的背面。第二就是，在目前这几个月内，注意自己的人身安全。几个月，顶多是一年。过了这个窗口期，他的安全形势就会大大好转。但是如果他在这个窗口期被人做掉了，比如被莫名其妙的交通事故做掉了，那再怎么样也都没有什么办法了。\n\n[01:15:32]过了这个阶段，情况就会明朗化，因为尽管如裴敏欣教授所说的那样，2012年是一个转折点，2012年以后共产党中国对西方的态度由防御性转为进攻性，以至于原先属于拥抱熊猫派的很多西方学者都感到沮丧，都开始公开地修改意见了，但是从历史纵向比较的话，共产党在西方扎的根和它能够动员的力量，比起当年斯大林在第二次世界大战中所部署的那些匪谍来说是远远不如的。也就是说，如果比较的话，今天的中国尽管已经比1978年的中国强大了很多，但是仍然远远赶不上1945年的苏联；而美国虽然出了很多腐败分子，今天它的实力仍然是远远超过1945年的美国。\n\n[01:16:25]按照现实政治的原则，在人类已知的历史上，从来没有一次是现实政治力量处于优势的一方会主动放弃自己的优势的。如果不讲现实而讲道义的话，那么无论是美国作为一个基督教国家的道义，还是它作为自由民主国家领袖的道义，这两种道义都不会容许它跟共产主义发生关系；如果不讲道义而讲实力的话，一个比1945年更加强大的美国不可能比1945年的美国更乐意放弃自己的优势。这个基本盘决定了共产党必然会失败。我们如果对什么事情还有争议，那就是，我们不知道它会怎样失败，是以珍珠港式突袭的方式失败，还是不敢突袭，只敢做小动作，最后把自己耗得油干灯尽。\n\n[01:17:12]在这个失败的过程中间，它完全可能咬死很多像郭文贵这样的人，也可能咬死很多像你我这样的人，但是即使这种事情真的发生，就是你我他这样的人在临死的那一刻，也会像是1944年被日本人杀死的国军战士一样，尽管我没有看到广岛原子弹落下的那一刻，也完全清楚，杀死我的人是死定了的，是一定会失败的。目前的形势就是这样。你没有必要在这个窗口期增加自己的风险，但是你更没有必要在目前这个基本格局对中国共产党极为不利的情况下对自己最终的胜利失去信心。\n\n[01:17:54]对郭文贵来说的话，我认为他最安全的做法就是，他应该培养一个政治型团队，这样他就不必担心自己的死亡了。个人的死亡是无关紧要的，如果你的继承人会在你自己选择的那个战场上战胜你选择的敌人的话，那你死了不过像是一个军官在战场上英勇牺牲一样，不但不是失败，反而是你的成功；但是如果你只是一个想要保护自己的财产和生命的逃亡者，那么你牺牲了就是你绝对失败了。所以你要避免自己的失败，最好是进一步而不要退一步。\n\n---\n\n刘仲敬20170801访谈整理：郭文贵现象及中印冲突、一带一路、新疆西藏问题的由来\n\nhttps://www.youtube.com/watch?v=1rMvFVuxV4E\n\n时间：2017年8月1日美东时间晚07:20（北京时间8月2日早07:20）\n\n主持人：郭宝胜\n\n注：本稿由三马兄整理。主持人的发言均经过精炼。\n【请关注Twitter @mhb218，转发请注明出处。】",
			"added": 1523951302,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 54,
			"title": "傅志彬：中国未来之我见",
			"body": "这几日，在叙利亚毒气弹攻击平民事件之外，在华文界最热闹的事大约有两件，这两件事都与文化娱乐有关。\n\n不管是内涵段子还是郭德纲的德云社，勒令其下架或关闭的理由都是低俗。\n\n郭德纲的相声我还零星地听过一些，内涵段子如果不是这次被禁，我压根就不知道。网上有人说内涵段子的段友们很是助人为乐，也有人说这些段友们很多是爱国小粉红。这些都不重要了，重要的是不管你爱国不爱国，下场和老傅的新浪微博和微信公共号一世一样烟消云散，驾鹤西去了。\n\n老傅的微博和微信公共号之所以被销号，是因为针砭了时弊，牵扯到政治。其实老傅的新浪微博和微信公共号已经因为本尊肉身在 2014 年到 2016 年身陷囹圄，躲过了封号最高潮，已经活得比别的大 V 们长一点了，但还是分别在 2016 年 12 月和 2018 年元月被一一枪毙。现在我已经厌倦了等待审查，索性转战推特和谷歌博客，与审查 Say goodby。\n\n德云社和内涵段子被禁止，与他们的政治倾向无关，与他们的影响有关，因为他们太受欢迎，党国的媒体们比不过他们了，那就得死。\n\n先是反对的声音被禁言，然后是不一致的声音被禁言，再后一定是不称赞的声音被禁言，最后就是赞扬声不大的被禁言，最最后就是祖国江山一片红，8 亿人民同看 8 个样板戏了，不对，错了，现在是 14 亿人口，也许中国人可以看 14 个样板戏了。\n\n你别撇嘴，老傅给你说说并不久远的故事。\n\n1949 年大陆政权刚刚转换，现在掌权者们的父亲们就通过土改和镇压反革命将几百万与之前的政权有牵连的人处死。这些被处死的人基本都是属于有文化，有自己想法的人。\n\n1952 年，院系调整，将私立学校，不管大学、中学、小学统统关闭，教师全部纳入国家干部行列，不同意政府思想的人就没得饭碗。\n\n在此之前，1951 年 5 月，人民日报发表耄亲自修改的社论《应该重视电影〈武训传〉的讨论》，在全国掀起了对电影《武训传》的批判。《武训传》从四十年代开拍，一直到 1951 年 2 月才上映，讲述清代山东一名叫武训的人靠乞讨募集资金办免费学校的故事。故事上映后获得很多好评，但《人民日报》的社论认为这部电影宣扬资产阶级改良主义，说「武训精神」已经「成为人民教育事业前进的严重的思想障碍」，要求把对电影的批评普及到每一个学校、每一个教育工作者和文艺工作者，并要联系实际检查自己。接着，《人民日报》接连七天在显著位置上报道上海等地文化界开展批判活动的动态新闻，还专门刊登一批赞成批判的「读者来信」。（这个我们很熟悉，现在是普通市民说）批判后期，当时的中宣部副部长，文化部副部长周扬写了一篇总结性质的长篇文章，题目是《反人民、反历史的思想和反现实主义的艺术》，电影《武训传》成了反革命的工具。7 月 27 日至 28 日，《人民日报》在第三版上刊登了署名「武训历史调查团」的《武训历史调查记》，结论是：「武训是一个以『兴义学』为手段，被当时反动政府赋予特权而为整个地主阶级服务的大流氓、大债主和大地主」。\n\n最后的处理结果是导演孙瑜、演员赵丹写自我批评，还有相关的数十人都做了自我批评。这种处理对当事人还算温和，因为当时还处在朝鲜战争当中，在镇压反革命运动之后，有关方面正忙着搞「三反」「五反」，收割工商业者的财产，忙的很，所以对知识分子就放了一码。\n\n《武训传》因为在 1983 年被平反而为很多人所知。其实当时还有一部由小说改编的电影《我们夫妻之间》也在同一时期被批判。这个批判的始作俑者是当时的中宣部文艺处处长丁玲。丁玲在 1951 年 8 月 25 日发表文章《作为一种倾向来看——给萧也牧同志的一封信》, 将萧也牧作为反对耄提出的为工农兵写作的代表人物来加以批判。认为这是一个举什么「旗帜」和谁来举「旗帜」的重大原则问题。 在文章结尾，丁玲说:「希望你老老实实地站在党的立场，站在人民的立场，思索你创作上的缺点，到底在哪里。群众的眼睛是雪亮的…… 尤其是知识青年，他们很快就会丢开你，而且很快就会知道来批判你的。」俨然是一副判官嘴脸了。 要知道，这个萧也牧本身是抗战前期就参加中共的知识分子，时任《中国青年》副总编，他的《我们夫妻之间》不过说了一个出身于知识分子的干部李克进城以后和出身农村的妻子之间发生矛盾的故事。他希望生活能有一些个人趣味，并努力培育妻子也能像自己一样去体验城市生活。最后两人人和好如初，共同进步，满是正能量。\n\n最初对萧也牧的批判还是限于说他「依据小资产阶级观点、趣味来观察生活，表现生活」\n\n然后升级到用「读者李定中」来信表示:《反对玩弄人民的态度，反对新的低级趣味》」。\n\n这个读者李定中认为：萧也牧「对我们的人民是没有丝毫真诚的爱和热情」，对女主人公张同志，「从头到尾都是玩弄」「因此，我觉得如果照作者的这种态度来评定作者的阶级，那么，简直能够把他评为敌对的阶级了，这种态度在客观效果上是我们的阶级敌人对我们劳动人民的态度」。\n\n这个读者李定中是谁呢，他就是当时的中国作家协会副主席，党组书记，人民文学出版社社长兼主编冯雪峰。\n\n后来萧也牧在 1957 年的「大鸣大放」中撰文说：对他的批判「多少有点对待敌人的『一棍子打死』的味道」，并且说「批评要恰如其分，要讲究分寸，不要把错误提高到不应有的高度，更不要把『莫须有』罪名加在他头上，不要污蔑他的人格。」 当然这也成了他被评为「右派」的证据，再后来，在「文革」中，萧也牧在批斗中被打死，埋在一个乱坟岗上。 \n\n当时，被批判的电影还有《清宫秘史》，这部由香港永华影业公司 1948 年拍摄，1950 年在中国大陆上映的电影被认为是宣传卖国主义。\n\n1951 年还有一部电影也遭到批判。那就是由文华影业公司出品，石挥自导自演的《关连长》。在影片中，石挥扮演的关连长在上海战役中为了保护孤儿院的儿童，为了将战争对社会和市民的伤害降到最低，带领八连战士以白刃战顽强抗争。最后他们成功占领了阵地，但关连长却牺牲了。这样一部充满了满满正能量的电影，却遭到了严厉的政治批判。批判的理由是国统区孤儿院孩子的政治成分不干净，他们完全无法与伟大的无产阶级解放军战士的性命相提并论，因此关连长宁愿牺牲解放军性命也要拯救国统区孤儿院孩子的举动，是无法接受和不可原谅的，是没有阶级立场的。\n\n被批判的电影有很多，就不一一列举了，理由基本都是「资本主义生活情调」「低俗」「阶级感情不强烈」。被批判的人基本做个检讨就能过关，但在文化界造成了一种恐怖气氛，人人都要自我审查。\n\n1954 年，曾与鲁迅交好的左翼作家胡风向中共中央提交了一份长达 30 万字的信，阐述了自己在文艺创作方面的看法。从这封信开始，在全国整出了一个胡风反党集团，要不是 1956 年因为苏联的领导人赫鲁晓夫在苏共 20 大上公布了斯大林滥杀无辜的秘密，举世震惊，由胡风反党集团而引发的全国性的肃清反革命（简称肃反）运动还不知道会有多少人头落地。即使这样，在这场运动中，还是有 21 万 4 千 4 百 70 人被捕，2 万 1 千 7 百 15 人被判死刑，在运动中被打死、折磨死的人数达到 5 万 3 千 2 百 30 人。这次运动主要在文化人当中进行，其中很多是在校大学生。\n\n在这场运动中，丁玲中枪落马，成了胡风反党集团的一员，而且还有自己单独的小团伙，叫做「丁玲、陈企霞反党集团」。后来冯雪峰倒霉后又变成了「丁玲、冯雪峰反党集团」。\n\n接下来就到了 1957 年，先是耄鼓励知识分子帮助共产党整风，号召大家「大鸣大放」，半个月之后开始反击右派对党的进攻。这就是著名的反右运动，在这场运动中，共有 3 百 17 万 8 千人被打成右派。其中年龄最小的右派是四川达县的张克锦，12 岁。全国全部城镇人口卷入这场运动。\n\n经过这几轮清洗，中国的知识分子中间，不听话的都收拾干净了，剩下的都老老实实地唱赞歌。在接下来的大跃进里不管卫星放得多么荒唐，也没有一丝反对声音。到大规模饿死人的时候还是一片赞歌。\n\n但这样耄还是不满意。在 1962 年又搞出个利用小说《刘志丹》反党事件，整出一个「习贾刘」反党集团，六万多西北出身的干部受牵连。\n\n1962 年秋天，开始批判新编昆曲《李慧娘》，说鬼魂之类的形象与社会主义精神不符，用现在的话来说就是负能量。\n\n1963 年 12 月，耄写了一个批示：「各种艺术形式——戏剧、曲艺、音乐、美术、舞蹈、电影、诗和文学等等，问题不少，人数很多，社会主义改造在许多部门中，至今收效甚微。」「许多共产党人热心提倡封建主义和资本主义的艺术，却不热心提倡社会主义的艺术，岂非咄咄怪事。」还多次说文化部是「帝王将相部」、「才子佳人部」、「外国死人部」。就是说，不发表不同意见已经不行了，你赞歌唱得不好就是反党。\n\n从 1964 年开始，对《李慧娘》、《谢瑶环》等许多戏曲，对《北国江南》、《早春二月》等许多电影，对许多文艺理论观点，公开进行政治批判。同年夏天，这种批判又扩大到学术界，从哲学、经济学，到历史学，各个学术领域都有一些代表人物和理论观点在研究机构、高等学校和全国报刊上受到猛烈批判。整个知识分子队伍的大多数再次被称为「资产阶级知识分子」。\n\n1965 年 11 月，姚文元秉承耄的旨意，在上海《文汇报》发表《评新编历史剧 < 海瑞罢官 >》，矛头直指北京市副市长，历史学家吴晗，认为《海瑞罢官》是右倾机会主义反案，是为彭德怀伸冤，是一颗大毒草。\n\n到了 1966 年夏天，文化大革命正式开展，全国人民跳起了忠字舞，喊起了「万寿无疆」「无限忠于」。在此之外，全国只有耄或耄的妻子江青钦点的 8 个样板戏是正确的，大家可以观看，其它的都被作为毒草禁止演出。这八个样板戏我还记得有：京剧：《红灯记》《智取威虎山》《沙家浜》《海港》《奇袭白虎团》，芭蕾舞剧《红色娘子军》《白毛女》，交响音乐《沙家浜》，大家戏称八亿人民看八个样板戏。当然实际还有九个样板作品，比如《杜鹃山》《龙江颂》《平原作战》等，但因为它们极其相似，所以大家很容易混淆。不过，记住那个时候大家除了跳忠字舞以外没啥娱乐就行了。\n\n那个时候只要伟大领袖一出现，一定是欢声雷动，现场人群如痴如醉，现在金三胖出现时是什么场景那时就是一模一样的。\n\n讲过去是为了理解今天，规划明天。\n\n（明天发表下部，告诉大家中国政府现行政策的真实目的，以及我们应该怎样应对，敬请注意！）\n\n> https://fuzhibin.blogspot.com/2018/04/blog-post_17.html\n\n---\n\n（上部将 1949 年到 1966 年中共从文艺娱乐入手控制人们思想的历史捋了一遍）\n\n无论是内涵段子还是德云社，被封的理由都是低俗，这个理由在前面我们已经很熟悉了。这几天有句话很精彩：你老说我们庸俗，但你也从没优雅。其实哪里是什么低俗和高雅的事，不过是要控制人们的大脑而已。\n\n如果大家老是玩有趣的东西，谁会再去看那无聊的党八股。所以有趣的东西必须死。等到那些不唱赞歌的娱乐企业死光了，就该轮到那些赞歌唱得不合领导意图的企业了。因为对那些将统治中国看成是自己的家业的人来说，最希望中国人的思想回到 1966 年以前，1957 年以后。前些年网上传中国高层希望中国的宣传部门向北朝鲜学习应该不是空穴来风的，那是他们的愿望。\n\n对他们来说，中国最好是这样的：\n\n思想上，领导说什么，百姓就信什么。哪怕领导说人可以吃土活命，立马就会有人写文章证明这办法可行，而且所有媒体都一致说行，老百姓也就会去吃土。\n\n经济上国有经济控制所有能挣大钱的行业，小商小铺允许个体经营，但用高税收高收费管着，让你为生计忙碌，无暇去管什么国家民族前途。一旦你不听话，逃税、非法经营的罪名就等着你。\n\n最终的目的是：在长期稳定统治中国的同时，成为领袖世界，成为世界舵手，为世界人民指出前进的方向。\n\n从这个目标出发，我们就能够理解目前中国发生的事情。\n\n首先要统一思想，控制舆论工具。报纸、电台、电视、电影这些传统宣传工具从来就在中共手里，大型的搜索工具，门户网站也基本上收拾得服服帖帖，不敢乱说乱动了。各种大 V、意见领袖抓得抓，臭得臭，不抓不臭的也被禁言，根本没有发出声音的阵地。理性如我也坐了将近两年的牢房，出来后凡是谈时事的文章一律不能发出，偶尔漏网的也会在 12 小时之内被删，逼得我只能在谷歌上开博客，用图片的方式发朋友圈。中共通过大外宣行动甚至将海外的华文媒体收买一空，连一些外文媒体也不能幸免。\n\n在将反对意见压到最低限度以后，就开始收拾影响力大的娱乐自媒体。对意见领袖扣得帽子是反政府、反社会、不爱国，对娱乐自媒体给的帽子必然是「低俗」，不高尚。\n\n在未来我们一定会看到有些大的媒体或主管这些媒体的大人物因为唱的赞歌不合领导胃口而倒霉。前段时间倒台的鲁炜还只是盆开胃菜。\n\n经济上我们看到中国政府已经要求中国各大互联网巨头接受至少 10% 的国有股份，尽管这些公司实际上都是在美国上市的公司；成立各类国有投资基金，这是为最后成立类似新加坡国有投资公司淡马锡的国家控股机构做准备。各个行业的大佬也都识相地说自己的企业国家啥时候要拿都行。其实上，你说不行有用吗？贵为邓家外孙女婿的吴晓辉不是说拿下就拿下，以万亿计算的资产转眼被国家接管，连个法院程序都不走。要知道，这法院本来就姓党，敢说个不？这样一纸通告万亿私产归国家，吃像都顾不上了。不过人家也许根本不在乎外界是怎么看的。\n\n2017 年中国宣布税收总收入 12.6 万亿元人民币，同比增长 8.7%。而中国 2017 年 GDP 增长率才是 6.9%。中国 GDP 数据造假是全世界人民都知道的事，就是与这造假抛高的 GDP 增长数字相比，中国企业的税务负担增长也是远超经济增长，可见中国企业赋税之重。不管谁一再宣称要为企业减负，但老傅可以在这里告诉大家，中国的税负只会增高，不会减低，因为一则领导们为了实现自己的目标需要钱，二则中国的制度要求一年要比一年好，没有后一年比前一年税收差的事，所以忘掉减税负的事吧。\n\n收到这么多钱干吗？\n\n对内：为军队、警察加工资，增加忠诚度，以保证政权稳定。对待各级官员，现在的中国领袖们相当地不在乎，甚至视如草芥，想杀想剐随心所欲，所以最近公务员们日子很难过，以后会更难过。\n\n对外：砸钱搞一带一路，在国际上收买小弟跟随自己。在自身力量不够的情况尽量利用 WTO 的有利条款占尽发达国家便宜，对高新技术能买则买，不能买就偷。一旦能在军事技术上超过西方国家或者差距不大，那就可以在全世界为所欲为了，因为没有哪个西方发达国家会不惜本国人民的性命来和一个可以不惜一切人民的代价来打仗的国家拼命的。到那时，台湾、南海问题也不再话下，至于是不是共产主义，谁敢怀疑？反正世界皇帝是坐上了。\n\n为了达到这个目的，我们看到现在的中国，警察已经不再列入公务员序列，而是与军队一样另眼看待，给予高薪。这是明显的军国主义化。在检察院系列之外再建设独立的监察委，可以对所有的人先抓后审，完全是明代厂卫制度的翻版。\n\n对有不同意见的人只有一个字：抓！对为有不同意见的人做辩护的人还是一个字：抓！发展到现在，对为坐牢的政治犯提供经济帮助的人还是一个字：抓！（最近中国微信群旅游群和送饭群被强制解散，管理人员被抓，其中有两个是我的朋友：刘春林和周筱霖，一个是建筑设计师，一个是公务人员），领袖们真的相信，有兵在，什么都不怕！\n\n说到这里你们应该懂了为什么要修宪了！不修宪，世界皇帝的宝座还没做几年就下来有什么意思，红色江山要万年长！\n\n那么，中国的未来会怎样，现在中国领袖们成为世界领袖的宏伟蓝图能实现吗？红色基因能传万代吗？\n\n要回答这个问题，就要看下面实现红色江山万年长的必要条件能否达到：\n\n第一，   统一舆论，统一思想。想要做到 1966 年文革以前，1957 年以后对舆论的控制程度，或者简单而言做到现在北朝鲜对舆论控制的程度，就必须将中国大陆与世界彻底隔绝，与文革前，或者与现在的北朝鲜一样。这首先得做到人员往来隔绝，只有少数信得过的人才能与外界接触，外国人到中国也得受到严密监控。与世界互联网实行物理断绝，将所有 VPN 关闭，彻底将中国互联网变成一个大区域网。\n\n第二，   中国经济一直运行良好，收入不断增长，能够给不断加大的军事和维稳需求、外交撒钱收买行动提供充足的资金。\n\n但最大的问题是，上面两点却完全是相互矛盾的。因为要搞好经济，就必须持续开放，与世界接轨，和世界做生意，你才能够得到足够的硬通货，才能去收买各路人马，才能有听话的马仔。靠背书单是没人理你的，靠印钞也只能哄哄国内人。而要开放，就没法做到与世隔绝。就像传闻很久的 VPN 将被封杀的消息为什么迟迟不见动静，就是因为一旦 VPN 彻底被封，所有外贸单位，外国在华企业就没法做生意了，没了外汇收入，中国就真的会成西朝鲜，手里没了狗粮的领袖们怕是真的要变成打狗的肉包子了。所以中国的领袖们对美国发动贸易战是如此愤怒，这种愤怒恰恰是害怕的表现。\n\n所以，中国大陆是不可能像东朝鲜那样做到与世界完全隔绝的，除非它不想活了。\n\n既然做不到完全与世隔绝，那么现在中国领袖们致力打造的统一思想，统一舆论的努力必定失败。不管他们抓多少人，中国的真实情况总是会被外人知道，外面的思想也会被中国人所认识。秦始皇梦想从他而起一世、二世、三世传到万代，所以修长城，收天下兵器铸金人，焚书坑儒，想尽了一切办法控制国人的思想和行动，结果不过到他儿子那就玩完了。在人权高于主权已经成为世界主流意见的现代社会，想让什么红色基因传万代基本就是中国梦了。东朝鲜的胖子们不过才传了三代，现在已经走到了死亡的门口，那还得感谢第二次大战以后的国际形势让他们苟延残喘了这么长。现在还有人想将开放以后的中国变成西朝鲜，实在我不太理解他们的脑子里面是什么，肉馅吗？\n\n虽然红色基因传万代肯定是个中国梦，但中国在梦醒时分必定要有一个阵痛，这个阵痛就是经济的崩溃和社会的动荡。\n\n经济的崩溃是必然的，因为如果一个政府不停地扩大人数，增加支出，总有一天是会达到它的临界点的。不管指导这个政府的思想多么牛逼，这个国家的国民多么能忍受压迫，如果不创造财富的政府不受约束地加大开支，这个国家破产就是早晚的事，古今中外没有例外，只有在倒台前能熬多久的区别。\n\n在《人性兽性各走半边——智者们的幸福路》一书中我说过，科学技术的进步是财富增长的主要因素。而科学技术进步的前提是自由思想，自由竞争。现代科学技术出现在欧洲，就是因为欧洲具有这种环境。人类的重大科学技术进步主要发生在 5500 年以前，即国家形态出现以前的新石器时代和大航海时代以后的时间里，中间的 5000 年基本乏善可陈，原因就是这一段时间里面全世界都处在一个兽性发达的专制时代，一伙强人玩着屠杀、控制、再屠杀、再控制的游戏，人类的理性被兽性的专制所压制，凭着勃发的兽性就能够获得足够的好处，为何还要什么科技的发明创造。（希望阅读《人性兽性各走半边——智者们的幸福路》一书的朋友可参加本月 22 日举行的「学逻辑，知幸福」初级班讲座，可免费得到该书的 PDF 版，顺便做个广告）。\n\n中国当局一方面从幼儿园到大学一直强调孩子们要听话，要忠诚，要随时做共产主义的接班人，极力扼杀孩子们的任何思想火花。从这种教育体制下出来的孩子，怎么可能有什么创造性思维。所以当我在狱中听到中国政府在全社会提倡「大众创业，万众创新」的时候，不禁哑然失笑。这就像忽然要一个太监去谈性生活太多对身体不好一样怪异。\n\n像中国这样的国度，是出现不了改变世界的技术发明的，所以只能去抄袭，去偷窃。这也是最近美国政府为什么要和中国打贸易战的原因。一旦中国企业不能抄袭、偷窃欧美的技术，加上人口红利消失，所谓经济奇迹将瞬间蒸发，加上环境污染严重，将进入癌症高发时段，以前的环境欠债将一一补回，除了疯狂压榨国民，收取重税，我看不出这个政府有任何解决办法。（关于中国财富问题我写过一篇题为《中国财富的来源和未来》的文章，发表在我的微信公共号傅志彬二世当中，希望阅读的扫码微信号）\n\n压榨国民，收取重税，势必激起反抗，信奉「有兵在，不怕」的政府一定会加强军队、警察的力量来进行镇压。我们现在已经看到了这种趋势，国内维稳费用已经持续多年高过国防费用，而且在未来一定还会继续增加。为了筹集这个费用，就必须收取更多的税和费，又会激起更多的反抗，就得召集更多的维稳力量，这种狗咬尾巴的游戏只能在经济崩溃中结束。\n\n随着经济崩溃的来临自然是社会动荡，这个很好理解。不过在这里老傅还要告诉大家，由于数十年如一日的愚民化教育、仇恨教育，很多中国人是没有多少理性的，加上在经济崩溃之时，当局一定会把崩溃的原因归于外来势力、知识分子、为富不仁的商人，挑动内斗，以推卸责任，获得存在的理由，挽救政权，所以针对中产阶级的抢劫，对知识分子的仇视一定会卷土重来。未来对财富的抹黑，对知识的仇视一定是五毛水军的工作重点，这一套我们在文革前的历史中已经看得很清楚了，以目前中国领袖们的水平，也只能按个重复键了。\n\n我们知道中国最终总会走向世界大多数国家都在走的民主之路，但在滚滚向前的历史长河中，也会偶尔掀起一些浪花，偶尔也会有些逆流。这些浪花或逆流在历史的长河中非常短暂，但对个人来说，却可能是一辈子的事，甚至是几辈子的事，所以我 2017 年新年致辞的标题是《走留之间》，想想 1949 年走和没走的地主、商人、知识分子的命运，多的话就不用说了，你还没看懂也就不用看懂了。\n\n> https://fuzhibin.blogspot.com/2018/04/blog-post_18.html",
			"added": 1524931018,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 55,
			"title": "中美贸易战，击碎了多少谎言？",
			"body": "中美贸易战告一段落，毫不意外地，咱们又赢了。不过与以往不同的是，这次美国也赢了，是双赢。据报道，咱们答应了美国减少贸易逆差的要求，所以美国赢了；而因为要减少贸易逆差，中方将大量增加自美购买商品和服务，这样可以满足咱们不断增长的消费需求和促进高质量经济发展，所以咱们也赢了。\n\n但让我感觉不可思议的是，这么好的事情，为什么一直不做呢？为什么要在美国政府的逼迫下去做呢？是因为没有想到？那岂不是说那些人能力低下？是因为想到了而不做，那岂不是证明了那些人很坏？\n\n而且在美国高调启动贸易战之初，咱们是抱着多大的决心，宁为玉碎不为瓦全，一定要打赢的，一定要粉碎美国人阻挡咱们大国崛起的阴谋的。当美国提出 500 亿的清单时，咱们针锋相对；当美国提出 1000 亿的清单时，咱们继续应战；而当美国把清单的总价提高到 2000 亿的时候，一夜之间，美国就不是阻挡咱们大国崛起，而是有利于咱们大国崛起了。美国的要求原来是有利于咱们的发展，而不是遏制咱们的发展了。我恍然大悟：原来以前的针锋相对，是用的激将法，是为了刺激美国不断地提高价码，以使双方都赢得更多。\n\n我相信这个结果真的是双赢的。因为这种结果，至少对中国人来说，会有更多的机会享受到来自国外的物美价廉的商品，而不再一边挂着「世界工厂」的名号，一边全民海淘。而对美国来说，如果不利，他们更不会主动「宣战」。而且从常识来说，贸易平衡才是对双方有利的，无论是过大的顺差还是逆差，都会对双方的正常经济发展造成伤害。\n\n然而这结果戳穿了一些流传已久的谎言。\n\n首先，戳穿了美国人靠中国人养活的谎言。原来往美国低价倾销商品，并不是美国人在剥削中国，美国人并没有从中获得多大好处，恰恰相反，美国人认为自己受到了极大的伤害，这正是美国要发动贸易战的主要原因。事实上，各大经济体都有一部《反倾销法》，反对任何境外商品在本地的低价倾销，原因就在于低价倾销会破坏本地的正常经济商业环境。因此，这个谎言完全违背了常识。\n\n这次贸易战还戳穿了美国靠印钱，靠美元霸权来收割世界财富的谎言。如果美国真的是靠这一手段，它不需要关心贸易逆差，恰恰相反，逆差越大，对它越有利。因为印出来的钱，如果在美国国内流转，收割的只是美国人自己的财富，不会伤害到其他国家的人，只有流转到国外，才等于用那一张纸把别国的财富换回到了美国。而当美国视贸易逆差为对美国的巨大伤害时，只说明一个问题：美元是代表货真价实的财富的，因此贸易逆差意味着美国财富的流失，而不是骗回了别人的财富。\n\n美国遏制中国「大国崛起」的谎言也不攻自破。既然承认了是双赢，也就意味着承认了美国没有阻挡中国的「崛起」之路。也就是说，承认了美国只是不能接受咱们用损害美国利益的方式去发展自己，只要咱们的发展不建立在损害他人利益的基础之上，没有人会反对。这也符合基本常识：没有谁会痛恨有道德的富人，人们痛恨的是不道德的甚至是血腥的致富手段。\n\n联合声明中重点提到，美国希望扩大对中国的能源出口，这意味着美国以前消灭萨达姆卡扎菲等等的战争是为了石油的谎言不攻自破。美国自己的能源都用不完而希望出口，却为了抢夺别人的能源而耗费巨大的财力物力，以及昂贵的美国人的生命，美国人疯了吗？我们一直听说美国要遏制中国的能源进口，而咱们花费巨大的代价发展海军，要冲破第一岛链，要在巴基斯坦建立军事基地和港口，其首要目的就是为了保卫能源生命线。而现在的实际情况是，美国原来想卖能源给咱们！\n\n还有一个有意思的现象：这次贸易战，至始至终没有听到一丝「抵制美货」的声音。特别是美国对中兴的制裁，再一次教育了中国人，也戳破了一个流传久远的谎言：原来美国人卖东西给中国人，不是占中国人便宜，而不卖东西给中国人，才是对中国最致命的打击。而那些抵制美货的人，则无异于帮助自己的国家自杀。现在，也许那些人明白了「抵制美货」是自杀，但他们会举一反三，明白抵制日货抵制韩货也同样是自杀吗？真不一定。\n\n这次贸易战，堪称一堂「胜读十年书」的专家课，不同的是，它远比一堂专家课波澜壮阔，它把很多真相赤裸裸地暴露在了光天化日之下。它印证了一个真理：现实是最好的教科书，最能启迪人的智慧。\n\n作者：荒猫\n来源：荒猫之舞",
			"added": 1527054516,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 56,
			"title": "為什麼共產主義者聲稱蘇聯不是「真正的共產主義」？",
			"body": "這是一種方便的方式，可以方便地辯解：共產國家的共產黨員為「追求共產主義理想」所做的無數暴行。\n\n通常的解釋是，蘇聯不符合一些馬克思主義者所說的馬克思恩格斯的共產主義。 實際上，這是**沒有真正的蘇格蘭人**，可以用來支持任何政治立場。 這裡有幾個例子：\n\n「由於我們正在經歷社會市場經濟，而不是『真正的』資本主義，工人們並沒有受到資本主義的壓迫，剝削和疏遠。」\n\n「納粹不是『真正的』法西斯主義，它是一個掠奪性的黑手黨國家，而不是德國競選意願的表現。」\n\n「沒有哪個國家是民主的，因為代議制民主不是『真正的』民主，所以西方國家不應該批評 [任意一個威權國家] 的政府制度。」\n\n不勝枚舉。\n\n在這一天結束的時候，蘇聯對資本主義制定了極端的左翼對策，將自己定義為共產主義，並被世界公認為是共產主義。是否有少數學者和愛好者認為它是『真正的』共產主義對此事沒有多大影響。\n\n> https://www.quora.com/Why-do-Communists-claim-that-the-USSR-wasnt-real-Communism/answer/Andrei-Istrate-3",
			"added": 1527231331,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 57,
			"title": "为什么要独立",
			"body": "何岸泉洋洋洒洒的说了这么多，唯独最重要的「为什么要独立」一直没有提及。\n我替他答。\n\n这个答案分四个部分：\n\n1.  大一统民主不可行\n2.  中国联邦化必然导向大一统\n3.  台湾的民主\n4.  中国的本质\n\n* * *\n\n### 1\\. 大一统民主不可行\n\n讲个很多人都知道，但不敢面对的故事：\n\n六四的时候中共特意调了外地部队来镇压，试问为什么不用本地的卫戍部队？因为当时的解放军和现在不同，都是当地人守卫当地。军队一看到要镇压的是自己的妻儿老小，那不得哗变吗？\n\n所以六四之所以失败，不怪中国太大，怪谁？怪中国军备太先进？难道齐奥塞斯库不是结结实实在街头被打死的？\n\n书斋民主人士们总喜欢喊一些自己压根没有认真考虑过的口号，比如说什么「把权力关进笼子」，是，权力是应该关进笼子，关键是怎么做？你还真以为投个票就是限制政府权力了？美国人为什么要保卫自己的持枪权？当然自卫和自由是一个原因，但更重要的是通过暴力来确保民主制度不被野心家颠覆。而在太平洋另一边，共产党取得政权之前经常在新华日报上发表一些支持民主的言论，后来很多人拿着这些东西到处黑共产党，却没有人认真想过一个问题：如果有人试图效法新华日报故事，通过高呼民主口号上台然后实施专制统治，你怎么办？\n\n我再问一个问题：历史上那些大帝国，什么罗马啊拜占庭啊神罗啊波斯啊阿拉伯啊，除了中国，还有哪个存在的吗？\n\n对，还有俄罗斯呢。\n\n**——你们 TMD 喜欢俄罗斯那样吗？？？**\n\n罗马尼亚的先例告诉我们，小国维护民主，远比大国要容易的多。甚至都不需要什么罗马尼亚，就从常理上讲，和小组织打交道难道不比和大组织打交道更容易？\n\n当然现实中不可能真的避免大组织，那我们只能尽量做到权力下放，这就是联邦制的精髓，也是美国能够存在的原因。\n\n那么，中国能实现联邦化吗？\n\n### 2\\. 中国联邦化必然导向大一统\n\n方向错了。\n\n你去翻历史嘛，看看联邦国家历史上是不是要么本来就是一堆国家，要么干脆连国家都没有，后来按部落什么的建加盟国？\n这些加盟国在联邦成立之前已经有了深厚的内部联系和自治组织，联邦不可能摧毁这种内部联系。\n\n如果原本就是单一制国家，那么问题来了：加盟国怎么划分？\n\n这里有个很坑的历史：中国明朝为了防止本国人造反，刻意将相同文化圈的地区划分到不同的省份。这造就了后来「大内斗省」等等人类奇观。你直接把这样的省改置为加盟国，然后指望它们发挥出加盟国该有的作用，基本是在做梦。\n\n我们还可以退一步讲，假如中国真的出了一个震古烁今的大牛逼人物，他的知识无比广博，因而能够奇迹般的按照文化圈画出加盟国边境线，没出任何差错，那联邦化就没有问题了吗？\n\n很遗憾，这还是不行。因为在这种特殊体制的长期破坏之下，所谓的「相同文化圈」只是生活习俗上接近罢了，它不存在足以支撑起加盟国的地方自治组织。而这意味着强大的中央可以毫无制约的扩张自己的权力，缩小地方的权力。最终重新把国家变成单一制。\n\n在这个问题上你还别说中国特殊，事实上，欧美国家的白左们一直都在主张扩大中央权力，而白左们闹的有多凶大家都看到了。只不过欧美的加盟国们在长期的自治传统之下还有对抗能力，中国？得了吧。\n\n而且我们就退一万步讲，就算一定要沿着美国路径将中国联邦化，那美国是怎么做的？美国最初只有十三州！照这么讲，中国当然也应该先分裂，直到各国自治组织完全建立之后，再在自愿的前提下联邦化——但那还是中国吗？\n\n更不要说，如果按照中国大一统癌的想法，美国<u>「自古以来就是英国神圣不可分割的一部分」</u>。\n\n### 3\\. 台湾的民主\n\n中国人老是说台湾的民主证明中国人能民主。是，住在称为「中国」的这块土地上的人是有民主的希望，但中国能民主就是放屁。\n\n台湾人为了民主一直在和国民党坚持不懈的斗争，然而在中国人口中，台湾的民主居然是蒋经国赐予的。\n我不知道别人能不能民主，但我知道说这话的肯定不能。\n\n何况拿台湾来举例子是想论证什么？证明中国人血统没问题？这不逗吗？民主又不是写在基因里的，关血统什么事？\n中国之所以不能民主，一是大（这个上面论证过了），二是它的本质不对。\n\n### 4\\. 中国的本质\n\n我经常在推特上这样讽刺大一统癌：别人把强盗消灭了，你跳出来宣称要维护贼赃的统一和完整，请问你是什么东西？\n\n当然有人会说，本朝建立以前中国就存在了。呵呵，请问先前的统治者又是什么东西？\n\n夏商都是小范围统治（夏存不存在还很成问题），周是封建，中国真正的大一统其实仅仅只是自秦而始。而秦的统一，是由两个千古恶人奠定的：嬴政和商鞅。\n\n我们不要看共产党的历史课本上怎么美化这两个人渣，我们直接读商君书原文：\n\n> 使商无得籴，农无得粜。农无得粜，则窳惰之农勉疾。商不得籴，则多岁不加乐。多岁不加乐，则饥岁无裕利。无裕利，则商怯；商怯，则欲农。\n\n——抑制商业发展。\n\n> 壹山泽，则恶农、慢惰、倍欲之民无所于食。无所于食，则必农。农，则草必垦矣。\n\n——古代国企。怪不得共产党喜欢商鞅。\n\n> 重刑而连其罪，则褊急之民不斗，很刚之民不讼，怠惰之民不游，费资之民不作，巧谀、恶心之民无变也。五民者不生于境内，则草必垦矣。\n> 使民无得擅徙，则诛愚。乱农农民无所于食而必农。愚心、躁欲之民壹意，则农民必静。农静、诛愚，则草必垦矣。\n\n——秦国的户口严苛程度令共产党望尘莫及。\n\n> 善为国者，其教民也，皆作壹而得官爵，是故不官无爵。国去言，则民朴；民朴，则不淫。民见上利之从壹空出也，则作壹；作壹，则民不偷营；民不偷营，则多力；多力，则国强。今境内之民皆曰：「农战可避，而官爵可得也。」是故豪杰皆可变业，务学《诗》、《书》，随从外权，上可以得显，下可以求官爵；要靡事商贾，为技艺，皆以避农战。具备，国之危也。\n\n——抵制文艺，实施军国主义。\n\n> 民弱国强，国强民弱。故有道之国，务在弱民。朴则强，淫则弱。弱则轨，淫则越志。弱则有用，越志则强。故曰：以强去强者，弱；以弱去强者，强。\n\n——共产党就是这么做的，但是他们敢把话说得这么露骨？\n\n理客中们当然会说：秦始皇有功绩啊，不能只看到一面啊…… 呵呵，什么功绩？书同文车同轨？欧洲大陆从来都没有书同文车同轨，妨碍他们把你国吊起来打了？而所谓的书同文车同轨背后，又是多少草民的血泪？\n\n这些狗屁的功绩从来没有给东亚做出任何贡献，仅仅只是对嬴政个人有利而已。\n\n当然，出个暴君也没什么大不了的（外国也有暴君），但是像中国一样，把暴君捧为千古一帝万世称颂的，世所罕见。\n\n当然，仅仅只是秦一朝，并不足以彻底摧毁东亚人的精神。但是后朝大体上也是延续这一套政策（当然严苛程度多多少少会放宽，以防止像秦一样二世而亡），时间久了，中国人的精神也就被阉割干净了。\n\n然而就是这样，统治者依然对民众不放心，还要想方设法消除民间组织，以防造反，消灭民间组织还不够，保甲连坐什么的还要放下去。所以我们看到小粉红说什么「制度不重要，吃饭最重要」，你得理解，毕竟中国人的祖先连活着都得竭尽全力了。\n\n当然中国人肯定会洗地说外国人也不好，这个时候他们就把「把制度关进笼子」忘到九霄云外去了。马丁路德写九十五条论纲，教会难道就很喜欢他吗？当然不可能。可是架不住德国贵族愿意保护他呀。喜欢李贽的人也很多，谁保的了他？\n\n就这么个环境，能诞生什么优秀文化？即使有，那也是吞噬诸夏文明得到的。就像郭敬明的小说也有很多写的好的地方一样——横竖还不是抄来的？\n\n* * *\n\n还是回到前面那个问题上面：什么罗马啊神罗啊现在还在吗？\n\n这些都是普世帝国，不是民族，其下的日耳曼波兰等等才是民族。本来帝国随着民族思想的觉醒是要完蛋的。大清朝仗着草民不敢反抗给自己续命，把自己降格为和英国德国平级的国家，结果下面的诸民族被抹杀成了一个叫做「汉族」或者「中华民族」的东西。「汉族」指的就是帝国之下丧失反抗能力的民族，「中华民族」就是帝国所有草民的总和。帝国以政绩选拔官僚，官僚们害怕那些属于「中华民族」但不属于「汉族」的群体闹事影响自己的官场前途，就牺牲「汉族」的利益来屈就「中华民族」，「汉族人」误以为自己是国家的主人，不敢相信主子竟然会压迫自己，只能把结果解释为「中华民族」渗透到了主子当中，并得出「汉族」要抱团维护国家的结论——问题是你一个伪民族怎么可能抱团？就算抱成了主子又不瞎，怎么可能容忍你存在？\n\n而现实中真正存在的民族抱团行为则被斥之为「地域歧视」——当然我不是说这就对，毕竟民族主义不见得一定就是健康的，纳粹也是民族主义嘛。更不要说你国制度这么糟心，能孕育出啥健康的东西来——但关键是，这一现象的存在证明了真实民族的存在。南方诸民族很多人一直都反感春晚要吃饺子，因为这本质就是文化入侵，是要消灭本民族文化的。\n\n好了，外来文化要消灭当地民族文化，外部制度要牺牲当地民族的利益，那当地民族可不得独立吗？而对于那些大一统癌来讲，没民主你尚且都要文化侵略，有了民主你就会放弃侵略，这可能吗？\n\n* * *\n\n### 总结：\n\n唠唠叨叨说了这么多，把中国人也黑惨了，但我唯独没有说过中国人种有问题，有问题的是文化。垃圾制度创造垃圾文化，垃圾文化又反过来维护垃圾制度。所以中国不能民主，那有什么可奇怪的？\n\n当然，我没说过中国人种有问题，这意味着这块土地上的人还是有希望的——只要放弃中华文化，拥抱自己的真实民族。但是中国「民族大融合」这么多年，即使是这些真民族也很难找对边界，就像何先生跟吴越人也有争端一样。不过那都是细节问题，大方向总归是对的。\n\n> https://www.pin-cong.com/p/24298/?s=78333",
			"added": 1528662431,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {
		"9_1CwbqLCD6TdkinNNNb4GneZxbsoJ6Mw6oE": 1,
		"1_16nddfMjTUY7rXzuhYXaop1T78gLYT94YR": 1,
		"13_12Ugp53jiMdvj1Kxa1w7c2LcXUBdGPs1oK": 1,
		"2_1LESBhM9ResjKhCCNhgbNDVFKcfdQractA": 1,
		"2_15gwgVTGFA1RANT53NhudZP6e3ZMjfm3jZ": 1,
		"8_1Q2yjutP8VevpmW5ZuKzNcDUQbUFn3gsVT": 1,
		"1_1BKPA7GUqMpdKnsn4v2tvm9THoU1kf3og7": 1,
		"1_1Q3pgQCFsrCkLWpdVZ7FihSuHHVistLBEA": 1,
		"11_1FHN4oukAG7zFUpiC9L2iz7QpQVTuT3xkz": 1,
		"433_1DcMmKhgdfkR1GDA6zhWhoFRreaej4wLmW": 1,
		"2_18cRWp8EGniDTB1itbx5WXenypdjStLmoh": 1,
		"1_197rZZrY6sHsYEQ9U1bJEq51M6R4oyhRRS": 1,
		"1_1MmfDp2ghmcGgXqFwXgAdn5aVmbjt4r5vX": 1,
		"30_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": 1,
		"1_121nbwrxZZz6PJ1WQ324jojCnRE96xUnRr": 1,
		"1_1CPJqQQK9TGSE9XA5Lr8gqoKXrEX8CWckt": 1,
		"2_1NWJxLty8kDfNQifWm3C366GJ58oqwN9yR": 1,
		"6_1Np58q7bCfW7hmHuXvoYux3ij6M4Qecfb3": 1,
		"1_1wzoUid12tvLt3h4KtbXAAjjjPhYN7rAd": 1,
		"3_1FvnsJWRafUBWfdGpLm9DbtMQwFTaGjQBD": 1,
		"1_1CV1zQjkdRKBd9NNXBpVELvzXDp7puzUmX": 1,
		"2_1ALch91Z2a2knQdzWhAP1GqPZuvk4QNUzU": 1,
		"1_1FRNx9yv1CvfcQBZc4XzhrUNEnreqxjqQ7": 1,
		"1_14qkCANgpwdN9rLmjeEWyyxEzAjmwFVkom": 1,
		"2_1CwbqLCD6TdkinNNNb4GneZxbsoJ6Mw6oE": 1,
		"1_1H8kdhfuxvXfWsfcZ9LpX1jULxunde625U": 1,
		"1_1NXaLXjkm7jfmc4QBXtWM1g8wiT9odzwZs": 1,
		"10_1FYGNAGGPjzRuubJGmq86t4iyEiMXxpuwL": 1,
		"21_1M6V4wECbz5e1aUmuij2BB72ensHCYNFmd": 1,
		"1_1Ki3HYqzaNr3BMKP34wTz9xLnVsAXENw4b": 1,
		"35_1FHN4oukAG7zFUpiC9L2iz7QpQVTuT3xkz": 1,
		"10_1KoZ6vDCXeDavsQjCToc95SZJu7uVVd9Yi": 1,
		"12_1KoZ6vDCXeDavsQjCToc95SZJu7uVVd9Yi": 1,
		"1_1vjjRJpiNosn98M8cc1R6FnhgwY2bAekr": 1,
		"1_12wLAUU1FGfs1T6mEwEp9ZciscfE5zHZHo": 1,
		"1_17dUbhrge994QBLHEAGxU3hRmhHsziaumB": 1,
		"17_1KoZ6vDCXeDavsQjCToc95SZJu7uVVd9Yi": 1,
		"18_1KoZ6vDCXeDavsQjCToc95SZJu7uVVd9Yi": 1,
		"33_1FHN4oukAG7zFUpiC9L2iz7QpQVTuT3xkz": 1,
		"37_1FHN4oukAG7zFUpiC9L2iz7QpQVTuT3xkz": 1,
		"2_1Q7Ebizvdsta5fdhrojC6eyUzRKrPKY5Cb": 1,
		"2_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": 1,
		"7_1HUPjBfWJgsoGfmXbkxHx999oNnP6MdUji": 1,
		"1_188Uit7FJJgyMWE3yh6934fKSucopDHgDz": 1,
		"31_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": 1,
		"6_1CwbqLCD6TdkinNNNb4GneZxbsoJ6Mw6oE": 1,
		"2_1JbRRo7M1pengKrQsNyYGDJHCuac9KFD1y": 1,
		"68_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": 1,
		"2_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": 1,
		"10_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1": 1,
		"6_19GERHBm21zJiPeytTwPgt4ffo9eV5gDvv": 1,
		"48_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": 1,
		"2_1MpUdwe28gwynzoKg9ziFCRWcQK2FqNunb": 1,
		"13_1958F7oCppj78MP966AfojMQwHg2WUupzq": 1,
		"1_1Lvkcqq796u3e3UAMxJxo7RZLzjvnR9bbE": 1,
		"7_1GVM7nNzmYJ3ppPCmDTPLozrJF2Z9mgFpF": 1,
		"7_1PcUqgLkcgRnfD88w2FPsdTrBHWaBuPTHW": 1,
		"1_1Ktpupt6fQP4sWYv5ZzYuwTW8drzqUL8Nm": 1,
		"7_164S7NQPD3KDoiVyU8oKx1VmsZM7z161tB": 1,
		"19_145kg9WZryLeefr2FuGERptM7frEf7ySGH": 1,
		"84_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": 1,
		"198_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": 1,
		"14_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": 1,
		"2_1Kgw38fVSxUaW1CiMQmf2TyR7C57B8z491": 1,
		"13_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum": 1,
		"81_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": 1,
		"1_1BQETpwmri2WDBeyjFWPXDNH7ob4cuczPX": 1,
		"44_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": 1,
		"3_1F77QJqo1JG2kZzHZHTK458nZYNBHYvmFA": 1,
		"11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa": 1,
		"96_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": 1,
		"16_1Q2yjutP8VevpmW5ZuKzNcDUQbUFn3gsVT": 1
	},
	"next_comment_id": 97,
	"comment": {
		"1_1BB36JjPmTXBJKjtJZ1N6qHE6CYznRFc2s": [
			{
				"comment_id": 1,
				"body": "你这是裸奔啊\n常识：远离国产网络产品",
				"added": 1501542437
			}
		],
		"428_1DcMmKhgdfkR1GDA6zhWhoFRreaej4wLmW": [],
		"330_1DcMmKhgdfkR1GDA6zhWhoFRreaej4wLmW": [
			{
				"comment_id": 3,
				"body": "http://127.0.0.1:43110/NewGFWTalk.bit/?Topic:1_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6/",
				"added": 1501727433
			}
		],
		"1_16nddfMjTUY7rXzuhYXaop1T78gLYT94YR": [
			{
				"comment_id": 4,
				"body": "> 顺路，我转载 clowwindy 最后一次演讲\n> [clowwindy](https://github.com/clowwindy) commented [on Aug 18, 2015 ](https://github.com/shadowsocks/shadowsocks-windows/issues/293#issuecomment-132253168)\n\n那是自然的咯。这边加了什么功能，它马上扒过去合并了。它那边加了什么却不会贡献出来给其他人用，久而久之，不就是它那边功能更多了吗。\n\n一直以来我什么都没说是因为我对他还有点希望，所以得给他一点面子不是。一开始我还只是纳闷他为什么不发 pull request，过了一段时间我才明白，这个世界上也有这一类的人。不尊重 GPL 就算了，把作者名字换成自己的，还在主页上加上官方的字样。为什么我们这边反而不说官方呢？因为我希望这个项目是没有官方的，人人都是贡献者。想不到这个社会人人都围着官转，人人都巴不得当官 。\n\n既然他没有尊重别人劳动成果的意愿，那他那些不开源的理由想必也只是借口。说因为加了一些试验性功能会不兼容所以暂不开源。他弄了一个混淆 TCP 协议头功能，在界面上标注提升安全性，吸引用户打开，然后安装他自己的不兼容服务端。然而我分析了一下之后发现这个功能的设计就是想当然，用得多了以后反而会增加特征。如果你真有什么试验性功能，不是更应该开放出来让所有人帮你分析么，大家一起讨论么？在加密算法领域，只有经过足够多人和机构的审视的算法，才能视作是安全的，闭门造出来的怎么能用。。\n\n当然啦，大部分用户才不会管这些，他们不会分析你是不是真的安全，也不会做道德判断，只要他们觉得好用就行。所以可以看到，这种环境下开源其实并没有什么优势，只不过为一些人抄袭提供了便利。这种环境下最后留下来的都是这些人。\n\n我一直想象的那种大家一起来维护一个项目的景象始终没有出现，也没有出现的迹象。维护这个项目的过程中，遇到 @chenshaoju 这样主动分享的同学并不多。很多来汇报问题的人是以一种小白求大大解决问题，解决完就走人的方式来的，然而既不愿提供足够的信息，也不愿写一些自己尝试的过程供后人参考。互帮互助的气氛就是搞不起来。对比下国外的社区差好远。\n\n最适合这个民族的其实是一群小白围着大大转，大大通过小白的夸奖获得自我满足，然后小白的吃喝拉撒都包给大大解决的模式。通过这个项目我感觉我已经彻底认识到这个民族的前面为什么会有一堵墙了。没有墙哪来的大大。所以到处都是什么附件回帖可见，等级多少用户组可见，一个论坛一个大大供小白跪舔，不需要政府造墙，网民也会自发造墙。这尼玛连做个翻墙软件都要造墙，真是令人叹为观止。这是一个造了几千年墙的保守的农耕民族，缺乏对别人的基本尊重，不愿意分享，喜欢遮遮掩掩，喜欢小圈子抱团，大概这些传统是改不掉了吧。\n\n现在维护这些项目已经越来越让我感到无趣。我还是努力工作，好好养家，早日肉翻吧。",
				"added": 1501730472
			}
		],
		"1_1PctriJ155UjQV4HrXw9qr7rznf8MNBkaj": [
			{
				"comment_id": 5,
				"body": "> 试问有其他语言的使用者在百度贴吧呼吁不要使用自己的本土语言么？\n\n在百度贴吧发英语也会被喷的\n你有见过老外来贴吧发一通英文帖子，然后振振有词的吗\n\n请互相尊重",
				"added": 1501730771
			},
			{
				"comment_id": 6,
				"body": "> [valdalee](#comment_3_1Gh5KrrtnJ1ZAsbWwZPahYiBNEos3fNyCK): 这是中文论坛谢谢\n\nZeroTalk 是英语论坛\nGFW Talk 才是中文论坛",
				"added": 1502273283
			},
			{
				"comment_id": 11,
				"body": "最终的硬化解决方案，按需取用：\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:4_15Q5U52Aqgjb66GkzhkGKDYgWsqR8TEkJG/The+userscript+to+hide+show+only+Chinese+posts",
				"added": 1502438735
			}
		],
		"43_157kFKiaEbRUds2HCBUpv33t4Unezi6dR6": [
			{
				"comment_id": 7,
				"body": "已看，已屏蔽",
				"added": 1502273293
			}
		],
		"4_1MTmai86ouh5TsBGfihyrYvcQUx4PhhBDg": [
			{
				"comment_id": 8,
				"body": "# 自由不分民族",
				"added": 1502292273
			}
		],
		"467_1DcMmKhgdfkR1GDA6zhWhoFRreaej4wLmW": [
			{
				"comment_id": 9,
				"body": "搞笑\n一个工业化程度低，武器到处买的的也配中国打仗？",
				"added": 1502294685
			}
		],
		"468_1DcMmKhgdfkR1GDA6zhWhoFRreaej4wLmW": [
			{
				"comment_id": 10,
				"body": "对\n投资拉动经济，但实际上投资拉动了房价\n房价跌了=经济堕落",
				"added": 1502294753
			}
		],
		"1_12CQEQ7HAM5o8p48nMHpXDEMjRFf5bndAJ": [
			{
				"comment_id": 12,
				"body": "有\n\nB站动画已经不能看了（版权，弹幕素质）\n推荐：C站、D站",
				"added": 1502639701
			}
		],
		"527_1DcMmKhgdfkR1GDA6zhWhoFRreaej4wLmW": [
			{
				"comment_id": 13,
				"body": "你很无聊啊",
				"added": 1503504667
			}
		],
		"2_1CogrjsFiTL3nHH74BXnAcM1S3KsNaLtEx": [
			{
				"comment_id": 14,
				"body": "不知道立场\n但他的帖子姿势水平太差，无聊",
				"added": 1503504863
			}
		],
		"1_121nbwrxZZz6PJ1WQ324jojCnRE96xUnRr": [
			{
				"comment_id": 15,
				"body": "翻墙出来，却说墙好的\n我已经找不到词语来形容了",
				"added": 1503511928
			}
		],
		"2_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 16,
				"body": "我是想说，在明网，隐私泄露严重，有人下决心要查，你就躲不掉\n我是在讽刺这句话：On the Internet, nobody knows you're a dog",
				"added": 1503961421
			}
		],
		"2_1CPJqQQK9TGSE9XA5Lr8gqoKXrEX8CWckt": [
			{
				"comment_id": 17,
				"body": "党国**敢不敢**光明正大的反对64，而不是支支吾吾删帖？",
				"added": 1504447111
			}
		],
		"1_1EyvbL9jSFGCPcvPJLvBmpMSo8NMksF1Hr": [
			{
				"comment_id": 18,
				"body": "## 唐 山 条 约\n\n庆丰五年（公元2017年9月3日），赵国政府与清真族签订条约：\n\n- 赔款500万，分39年还清\n- 割让唐山，划定唐山为租界，答应清真族在唐山地区的一切特权\n- 帮助清真族修建清真寺\n- 严禁漢族人参加反清真运动",
				"added": 1504691611
			}
		],
		"4_19SxyZeLrqy2AUUG9hhtK8Pd5CUxtsP15Z": [
			{
				"comment_id": 19,
				"body": "如果从词义上来讲，「支那」一词并不含轻蔑意。「支那」和英语、德语的「China」、法语「Chine」、内陆斯堪的纳维亚语[1]「Kina」等等的词源一样，都是梵语Ci^na的译称。英语因为历史音变的缘故，开音节的i读成[ai]音，造成不读「支那」而读「拆拿」极为特殊的读法[2]。对梵语Ci^na的由来学界说法不一，可能源自波斯语Chin。再追溯下去，起源于春秋时对秦国国名的音译。「秦」，得号于地名，《说文解字》释曰：「秦，伯益之后所封国。地宜禾。从禾，舂省。一曰秦，禾名。」甲骨文的「秦」字形上部是双手持杵，下部为成堆稻谷，造字本义即打谷脱粒，造词作「五谷丰饶之地」，如「秦岭」。\n\n「支那」这个词正是中国人自己首先创造和使用的，首见于唐玄奘等僧侣将古印度对中国的称呼「Mahachinasthana」音译成「摩诃脂那国」、「摩诃至那国」等。《大唐西域记》载：「王曰：『大唐国在何方？经途所宣，去斯远近？』对曰：『当此东北数万余里，印度所谓摩诃至那国是也。』」唐玄宗有诗曰：「鹤立蛇形势未休，五天文字鬼神愁。支那弟子无言语，穿耳胡僧笑点头。」梵语「Mahachinasthana」中「Maha」是「大」的意思，「sthana」即「斯坦」，地名后缀，「china」则转自「秦」的发音，「Mahachinasthana」意译为「大秦国」[3]。另一个对中国的称呼「震旦」就是音译自这个「chinasthana」。这些音译词此后在汉语典籍中虽不时露面，但出现频率不高，大都作为历代中国的统称使用[4]。历代中国佛教徒使用这个名词来称中国，如明代四大高僧之一的憨山大师藕益智旭在《楞伽经玄义》中自称为「支那藕益沙门释智旭」。\n\n「支那」一词由中国传入日本可追溯到九世纪初。日本文献中「支那」之名最早出现于唐朝日僧空海的《性灵集》。在镰仓南北朝僧虎关师炼《元亨释书》等佛教典籍中，皆有使用「支那」一词的记录，但并不普遍。江户末期和明治初期，随着日本的对外开放，受荷兰语等西欧语言中对中国称呼的影响，喜欢标新立异的人不再称中国为「汉土」，而是按外文音译改以「支那」。相传由朱舜水传入日本的拉面，当时被称为支那面[5]。但使用「支那」之名，仍以佛教典籍为主，如日僧大玄的《净土颂义钞探玄钞》等[2]。\n\n明治维新后，日本书籍传入中国，「支那」之名在中国复兴。严复在其《国富论》、《支那教案论》等译作中，以「支那」来译「China」，也曾以「支那」入诗。与林纾同译《黑奴吁天录》的魏易，在序中以「支那」自称。林纾称「支那」一词并无贬义[2]。在义和团运动前后去往日本的狄平子认为，使用「支那」这一名称并不耻辱，比「中华民国」等国号更广义、更恰当。佛经中「支那」可解释为「边远之地」、「思想之国」，狄平子以为佛教典籍中「支那」意为「深思」，在国家邦交之中有赞美之意[6]。\n\n日本官方历来以当朝的国名称呼中国，晚清时日本政府在正式场合把中国称为「清国」或「大清帝国」。但在清末民初，称呼「支那」是对中国汉人的尊敬，「支那人」一词甚至还是美称，正如现在一些网友互相礼称「你国」一样。甲午战争以后，日本一时间成了中国革命家的乐园，当时的日本是亚洲革命的圣地。那时反清志士到日本的头两件事就是：一，剪辫子，表示不再效忠清廷；二，借用日式称呼自称为「支那人」，拒绝承认自己是「清国人」。鲁迅在日留学时登记籍贯，当时中国的国号还是「清」，鲁迅本可在籍贯一栏填上「大清国」，但鲁迅大笔一挥，写上「支那」二字。鲁迅所住旅馆的店主见是中国人，认为是贵客，免费给鲁迅升级了房间[7]。\n\n不仅孙中山、黄兴、宋教仁、秋瑾、章太炎等革命党人称「中国」为「支那」，黄遵宪、陈寅恪、鲁迅等知识分子也自称「支那人」。1902年，章太炎等在日本东京发起《支那亡国二百四十二年纪念会》，提出「光复汉族，还我河山，以身许国，功成身退「的誓词（「支那亡国」指明亡于清的那一年）。1904年，宋教仁在东京创办了《二十世纪之支那》杂志，成为后来同盟会党报《民报》的前身。即使是提出「少年中国说」、政治观念更保守的的梁启超，也用「支那少年」作为笔名[8]。康有为次女康同璧也曾在诗中自夸称「我是支那第一人」，并得到毛泽东的赞赏。另如孙中山的革命伙伴，日本人梅屋庄吉，在辛亥革命成功后在日本发起成立「支那共和国公认期成同盟会」，敦促日本政府承认中华民国[2]。。\n\n辛亥革命以后，日本不能再称呼中国为「清」，故沿用了「支那共和国」的汉字国号称呼中国，直接译自「Republic Of China」。1913年7月，日本政府明文规定：今后不论中国的国号如何变化，日本均以「支那」称呼中国。1914年，孙中山给日本首相的密函中即自称「支那」、「对支政策」、「支那革命党」、「支那国民」、「支那人」等，共计34次。彼时「中国」这个称呼尚没有流行，这个称呼是在中国进入资本主义，晚清民族主义初步形成后才开始广泛使用的，民国时期才得以流行。1925年，诗人闻一多在其诗歌《我是中国人》中自称「我是中国人，我是支那人」。1929年，柳亚子写诗赞扬孙中山与毛泽东，有「并世支那两列宁」诗句[2]。再如，鲁迅在《华盖集续篇》中更是直接讽刺道：「他们（外国人）……则不但外交上一定胜利，还要取得上等『支那人』的好感情。这时须连『支那人』三个字也不说，代以『华人』，因为这也是关于『华人』的体面的。」\n\n1919年五四运动反日热潮之际，爱国人士提出一个抗日话题，就是日本称呼中国为「支那」。有人上书政府要求日本不得使用「支那」或「支那共和国」的说法。1919年11月留日学生王拱壁在国内出版的《东游挥汗录》是当时极具煽动性的代表著作，书中对日本称中国为「支那」一事进行了猛烈的抨击，写道：\n\n「假扮[9]虽继承了中国体统，读汉文、朗佛经，却朝野上下不把『中华民国』四字、甚至『中国』二字当成回事；并且蔑视我国，连『摩诃震旦』也不照用，只称切掉前面二字后剩下来的语音支那。报纸、着述、讲演都只称支那。在政府公文中抛弃『中华民国』四字，特意使用『支那共和国』五字。不仅不符合国际礼仪，而且简直不把我国看成国家。中华民国成立已经八年了，倭人至今还不承认。尤忆当民国肇造之初，倭人闻我将以『中华民国』民我国，即由著名浪人某固请我民党领袖，易之以『大汉』，希冀离我五族，从可知堂哉皇哉之『中华民国』四字早为岛国君民所不喜矣，推其用心，直不愿地球有中华民国之产出也。」\n\n《东游挥汗录》里说「倭人易之以『大汉』」或许不假，但说「希冀离我五族」就很荒唐了。「希冀离我五族」不是别人，正是革命党。满清覆灭前，革命党人的口号是「驱逐鞑虏」，一致主张「汉地十八省建国」。民族主义者希望用「中国」而不是「支那」的一个原因也是在于此。前面提到，民族主义者用「支那」一词对抗「清国」一词，正是因为「支那」是汉族聚居区超越朝代与政权变迁的称呼。辛亥革命后，资产阶级才突然意识到了继承清朝统治下的满洲、蒙古、新疆、青海、西藏的益处，于是搞出一个「五族共和」、搬出一套「中华民族」的概念，变成了各民族共同构成「中国」这个民族国家。这个时候，如果日本再以「支那」相称，在中国方面看来自然就是不合时宜的「倭人易之以大汉」了。\n\n在留日学生纷纷表示不堪忍受被日本称作「支那」之时，中国国内反对日本称中国为「支那」的呼声也日益高涨。尤其在北伐成功、南京国民政府形式上统一中国之后，这种呼声达到了顶点[4]。1930年日本官方在中华民国政府的要求之下，改以「中华民国」代替「支那」在官方文书的称呼，但1937年的七七事变仍被叫做「支那事变」[2]。抗日战争期间，日本政府在受汪精卫政权请求后，承诺今后分阶段停止使用「支那」这一称呼[6]。\n\n第二次世界大战后，日本政府应中华民国政府之要求，发布《关于回避使用支那称呼之事宜》通告，通令全国官民，媒体、教科书、公文、公务员禁止使用「支那」，改以「中华民国人」、「民国人」、「华人」等称呼[10]。日本本州岛西南部自古以来被称为「中国地方」，如果将China称为「中国」，在日本国内易造成混乱。为此，「中国地方」也被改称为「山阳地方」和「山阴地方」。现代日本民间已不再使用「支那」一词，但在谈论「中国」一词时有时仍会产生歧义。一些日本右翼分子，如石原慎太郎则继续使用该词[11]。有时日本右翼政客也用英语China的日语发音「チャイナ」作为折中说法。\n\n可以看出，「支那」一词就跟「小姐」一样，原本没有任何歧视性词义，甚至曾是一种敬称，然后就被好事者玩坏了，其中的演变不妨视为中国民族资产阶级和民族主义发展的一个观角。\n\n然而事情还没有完。「支那」和「China」，按理来说是一个词，只不过翻译不同，「支那」被视为歧视性称呼，「China」却被贴金。好事者可能会辩称，歧视性称呼只是针对「支那」这一翻译。事实却并非如此。印尼曾称中国为Tjina/China/Cina，来源于荷兰语，当地华人认为这个词就是「支那」，有侮辱意，直到去年在华人要求下改成了Tiongkok，闽南语「中国」的音译。同一个词，美英德法翻译出来不是歧视，印尼翻译出来就是歧视，甚至印尼的邻国马来西亚仍在使用Cina一词[12]，也未见大马华人有何不满，还真是耐人寻味。反倒是日本的称呼由Nippon改成了Jepang。\n\n可能许多人都注意到了，英语中用构词前缀Sino-表示「中国的；汉族的」，同样也很常用。如，中国石化——「Sinopec」、《中英联合声明》——「Sino-British Joint Declaration」、甲午战争——「Sino-Japanese War」、汉学——「Sinology」、汉藏语系——「Sino-Tibetan language family」、国际汉语教师联合会——「SINO International Chinese Teachers Association」。Sino-的词源当然和「China」一样，转借自拉丁语「Sina」，也可以被翻译为「支那」。我想有些人大概很不乐意知道这一点。\n\n五毛不是要复兴中国传统文化么？那也该用「支那」而不是「中国」一词啊。「中国」一词自《尼布楚条约》起才用作中国国家的代名词，「中华」一词更是1912年以后才被用作代称中国政权和范围，这两个词被广泛接受就更晚了。「支那」一词可是源于大秦帝国，自产自销，用了上千年了。真正有歧视意味的，反而是「中国」一词，这个词明示使用该词的政权乃华夷秩序中的天下中心，别国别族都是「蛮夷」。历史上「中华」、「中国」是为了与周边异民族相区分的用词。中华和夷蛮的关系不是对等关系，而是上对下的朝贡关系，是「文明」与「蛮夷」的夷夏之辨。日本人认为，自称「中国」，含有天下至尊、文化优越的骄傲感，改称「支那」为「中国」，有承认自己是「东夷」的被侮辱感。这也是日本当年不愿意称「中华民国」为「中国」的原因之一，毕竟扶桑国也是儒教的好学生。不承认对方是天下至尊，就是侮辱对方，怎么看都是很无理的逻辑啊……\n\n刻意强调自己的半殖民地身份，用刻画被殖民历史的方式乔装成道貌岸然、人畜无害的受害者，自认为是殖民遗产的惟一继承者，反过来行强盗之实，是中国、朝鲜/韩国、泰国、印尼等东亚国家惯用的「国耻政治」手段。为了装成受害者，不惜妄想受迫害，前面列举的留日学生就是一个典型例子。昨天的民族主义者说资产阶级革命先烈自称的「支那」是蔑称，今天的民族主义者又不断制造「日本人把煤买去藏大海里」、「第二代身份证由日本制造」、「韩国人不用日货」这种转发过500也不用担责的谣言。\n\n20世纪上半叶共产国际指导殖民地各国共产党附和民族资产阶级的运动，结果这种民族主义也变成了共产党的政治正确，其影响一直延续至今。后来成了各国共产党与其国内资产阶级寻找「共同敌人」以便妥协时的良好切入点。\n\n大概2000年的时候，网上流传说新浪的外文名「Sina」就是「支那」，新浪拿了日本人的钱歧视中国人云云。这事要搁在今天，共青团和军方在媒体和网络上一冲锋，人民网批个亲日媚日，中宣部喊个意识形态斗争，非逼得当时规模尚小的新浪改名不可。《东游挥汗录》里王拱壁虽愿意中国被称作「震旦」，但倘若现在的五毛知道了「震旦」这个词含有穆斯林国家常用的「斯坦」词尾[13]，可以译为「支那斯坦」的意思，恐怕也会把「震旦」引为对中国的蔑称吧。\n\n**注释**\n[1] 在语言学里，原则上互相之间不能通话的应被定性为语言而非方言。之所以称是「原则性」的，是因为这一理论并未被彻底执行。如瑞典语、挪威语、丹麦语三种语言可互通，葡萄牙语与西班牙语亦能互相理解，但由于政治因素却被划分为不同语言。汉语的方言甚至次级方言间都不可相通，却被称为同一种语言。阿拉伯语、德语、日语方言间亦不都能互通，但仍被视作统一的语言。这里将瑞典语、挪威语、丹麦语统称为「内陆斯堪的纳维亚语」。\n[2] [中文维基百科：支那](https://zh.wikipedia.org/wiki/支那) 中国大陆境内需翻墙访问。\n[3] 方汉文：《关于「支那」名称的来源》，郑州，《寻根》，2003，3，第51-57页。\n[4] 周程：[《「支那」与「sina」》](http://web5.pku.edu.cn/csss/teachers/works/sina.htm)\n[5] 另有说法，支那面的名称起于日本昭和年间。\n[6] [日文维基百科：支那](https://ja.wikipedia.org/wiki/支那)\n[7] 许寿裳：《我所认识的鲁迅》\n[8] 林思云：[《「支那」问题纵横谈》](http://www.nextftp.com/chn/04/0308.htm)\n[9] 留日学生除使用「倭人」一词外，因英语中japan的意思是漆器，而演艺被保守分子视为低俗行业，且日本想脱亚入欧，故音意合译，蔑称日本为「假扮」。近来民族主义者流行把日本叫「脚盆」，同样是音译自japan的蔑称。\n[10] [中文维基百科：支那人](https://zh.wikipedia.org/wiki/支那人) 中国大陆境内需翻墙访问。\n[11] 环球网：[《石原撰文鼓动野田「视察」钓鱼岛 称中国为「支那」》](http://news.ifeng.com/mainland/special/diaoyudaozhengduan/content-3/detail_2012_08/13/16768636_0.shtml)\n[12] 同注释[1]所述情况相同，印尼语和马来语实际上是同一种语言，印尼语可视为一种规范过的马来语。\n[13]「斯坦」词尾其实与伊斯兰教没有关系，而是源自印欧语系印度-伊朗语族中表示地名的词尾，意为「人或物聚集之处」。「斯坦」和英语中的stand、stay、state等词同源，共享st词根，由「站立」延伸出「立足之地」的意思。\n\n> https://www.zhihu.com/question/47274871/answer/105626287",
				"added": 1505564545
			}
		],
		"1_1BiouZaoK2zKaqSihxi7LudLqix6ynXYtj": [
			{
				"comment_id": 20,
				"body": "> [fengyun007](#comment_26_12pu2MFpjqWpNd4TqLC6edzMtEczQ2vLti): 中文发那里又怎么了？看不懂的可以不看啊，谁让你们看了？\n\n请看英文论坛的版规：\n**Please use English, you can reach other language forums at the top of this page**\n\n（[截图](/Me.ZeroNetwork.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/13aB79mzuRLgDYzQthn9wzycjw77WyDXh6/1507607113)）",
				"added": 1507606781
			}
		],
		"6_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 21,
				"body": "a",
				"added": 1508155858
			}
		],
		"1_1Ki3HYqzaNr3BMKP34wTz9xLnVsAXENw4b": [
			{
				"comment_id": 22,
				"body": "易语言表示不服",
				"added": 1508643109
			}
		],
		"4_1MFGmjNKnH1WtuUBDngF8hD7J9DaP4bUda": [
			{
				"comment_id": 23,
				"body": "呵呵，怕不是活在梦里\n[中国网络审查技术评论](/12ddrrRKkABAWTU48ZL3THfypHtVJ3aVF5)",
				"added": 1508643351
			}
		],
		"13_1FJCJm9PPaL2Lcfv64fSCuXXBHQcE4JdGY": [
			{
				"comment_id": 24,
				"body": "Firefox",
				"added": 1508644117
			},
			{
				"comment_id": 65,
				"body": "Pale Moon",
				"added": 1517410117
			}
		],
		"10_1KoZ6vDCXeDavsQjCToc95SZJu7uVVd9Yi": [
			{
				"comment_id": 25,
				"body": "看不懂正常，建议先看这篇文章，了解背景：[程晓农：中国模式 共产党资本主义](?Topic:8_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6)\n简单来说，中国模式（权贵资本主义）维持不下去了，权贵们要跑路了",
				"added": 1510579954
			}
		],
		"9_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 26,
				"body": "",
				"added": 1510601963
			}
		],
		"1_12v4reBZbKrP3m6Ceiz7YR4ahPKQBg5ATt": [
			{
				"comment_id": 27,
				"body": "家长争着给书院洗地\n奴才太多，权贵不够用啊",
				"added": 1510655612
			}
		],
		"2_1B4HAuapkMBUARLKGgApRuMuf88WiJahVP": [
			{
				"comment_id": 28,
				"body": "美帝是红色权贵的野爹（红色权贵海外转移财产），小粉红可以继续脑补中修吊打美帝，反正开嘴炮不要钱",
				"added": 1510755085
			}
		],
		"1_17yRitg3BzogUsUPa77AodAdappawzVqAE": [
			{
				"comment_id": 29,
				"body": "没有，以后也永远不会有，除非你是全知全能的神",
				"added": 1511101117
			}
		],
		"1_12wLAUU1FGfs1T6mEwEp9ZciscfE5zHZHo": [
			{
				"comment_id": 30,
				"body": "大悲无言。",
				"added": 1511443181
			},
			{
				"comment_id": 31,
				"body": "https://www.bannedbook.org/forum2/topic742.html",
				"added": 1511444295
			}
		],
		"1_1BHcv5eMFiza4gCBXmPXwxMLhF9oodThhD": [
			{
				"comment_id": 32,
				"body": "> [apapapp](#comment_2_1BHcv5eMFiza4gCBXmPXwxMLhF9oodThhD): 现在用「支那」的人除了藏独，疆独和港独以外，就只剩你们了。\n\n就是啊，顺便提醒你，千万不要说China\n怕你不知道**China=支那**，特此提醒",
				"added": 1511609382
			}
		],
		"11_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 33,
				"body": "点评：\n\n公立医院的状况是，政府该拨付的钱不到位，逼着医生通过灰色收入维持一个正常的平衡。但政府又掌握了话语权，一旦民众抱怨医疗问题，就推说医生道德水平低。\n其次，私立医院开放本意是好的，鼓励竞争增添活力。但是准入门槛太低，经营者又是逐利，小病当大病治或者滥用抗生素都是很正常的事情。\n第三点，就是民众自身没有医学常识，无法分辨这医生到底是想救我还是坑我的钱。没有常识就算了，还特别容易偏听偏信，于是出现医托这个黑色行业链。\n第四点，医疗本身就是极其费钱的活动，政府鼓吹全民医疗保障，但是作为最基础的劳动者没有创造那么多的财富。就会出现这样那样的纰漏。\n第五点，患者和医生的地位不平等。患者一口咬定出了医疗事故天天来闹，医院承受不了那么多的损失，即使在理也是要赔钱的。反正患者给你先治疗再交钱，你偷偷摸摸跑了我也只能放在坏账处理里面了。即使抓到他，脖子一伸，我就没钱，你杀了我吧。\n第六点，执法者的作用在这里不突出，有医疗纠纷，先搬出来死者为大这顶道德制高点的帽子，你怕不怕？在这顶帽子下，一切的不合理举动都是合理的。比如堵大门，打医生等。\n第七点，超级恶心的。患者无力支付费用，亲属又不关心。医院又不能直接丢出去，尤其是停止维护就要垂危的。还得请看护守着。一赖就是两三年的舒坦日子。哪天没挨过去死了，亲戚朋友一大帮子都来了。甚至怕自己态度不够狠，雇些五大三粗的壮汉天天闹。那真是医院欲哭无泪。这种情况我反而希望医院态度狠一点，一开始就拒绝接收病人。\n\n> https://www.zhihu.com/question/21923229/answer/42167794",
				"added": 1512049259
			}
		],
		"1_17dUbhrge994QBLHEAGxU3hRmhHsziaumB": [
			{
				"comment_id": 34,
				"body": "「排华事件」反映中国模式破产\n2017年12月1日 卢峰\nhttps://www.letscorp.net/archives/125962\n\n最近一段时间香港有不少政经名人吹嘘中国发展模式如何厉害、如何超英赶美令中国成为全世界模仿学习的对象。前特首董建华近一、两个月就一再说中国今时不同往日，港人该改变过往的态度学懂欣赏国家的成就，抓紧机遇。然而，只要看看最近在北京发生的事就知道所谓中国模式不把人民当人，只是把人民当成生产要素，用完即弃。这样的模式可说毫无人性，根本没有任何优越性，更谈不上什么为人民服务。有一天若果香港或其他地方真正学习中国模式的话，只怕除了权贵、党干以外一般人将无立锥之地。\n\n将人民视为工具用完即弃\n\n北京大兴区不合规公寓大火赔掉十九条生命已是悲剧，紧接下来的所谓排查安全及火灾隐患却酿成更大的悲剧。在北京市政府的「死命令」下，大批公安、城管进驻北京市各区的民工公寓、临时住宅区，逼居民在三天内连同个人财产迁出，并且即时停水停电，不让居民有任何时间准备或找合适的地方搬迁。\n\n于是，北京街头形同出现难民潮一样，被逼迁的居民扶老携幼卷起被铺四处找居所，一脸茫然仓皇之情。「难民」背后的则是一排排穿制服的公安、城管，只差没有动武驱赶而已。像这样的情景内地网民有的狠批为「排华事件」，有的则指是北京市政府乘机藉火灾清除「低端人口」。\n\n不管是「排华」还是排除「低端人口」，实质上反映的就是北京市政府根本不把居民当人，对他们最基本的生存权及生活安全肆意践踏，一有事就像驱赶牛羊一样把他们无情的赶走。\n\n可是，这些住在临时住宅、违规公寓的居民、民工是促进北京及中国城市经济迅速发展的重要动力。他们为新发展的服务业、第三产业提供充沛的劳动力，为北京市其他居民提供各种各样的个人及商业服务，并作为廉宜劳动力提升北京及大城市企业的竞争力。但由于他们没有北京户籍，又或付不起高昂的租金，民工们只能在寒伧的公寓甚至不合规格的住宅栖身，希望将来挣到钱能改善环境。\n\n今次遇上重大火灾，中共官员们要拯救政绩，要显示自己重视安全，他们就毫不犹豫的拿民工、「低端人口」开刀，把他们当成「毒瘤」、难题、必须去之而后快，对他们在经济及社会发展上的贡献一点不感激，一点也不重视。中共官员把民众「用完即弃」的态度比任何无良雇主、资本家还要冷血。像这样的发展模式即使GDP再高也不管用，因为没有丝毫人性，没有任何对人的关怀。\n\n历史可见中共擅利用群众\n\n应该看到，把民众及人民视为「工具」、「毒瘤」的不仅是北京市政府领导，这样的思维本就深植于中共的DNA中。过往搞政治运动及斗争，中共最高层就一再借群众之手批斗政敌。刘少奇、林彪等一时是亲密战友、好同志；运动一来就成为叛徒、内奸、工贼、阴谋家，教群众无所适从，甚至因为站错队而受牵连，万劫不复。\n\n改革开放后不再大搞政治运动，可人民仍然只是党的工具及「螺丝钉」，拼经济的时候让大家捱低工资及「血汗工厂」，捱水污染空气污染，捱不安全的住宅。出了什么意外或人祸，被遗弃、当殃的又是民众，他们被视为制造各种危机的元凶，逼他们离开，要他们硬食雾霾恶果。而今次北京的做法不过是其中一次最丑陋、粗暴的表现而已。\n\n过往不少人认为，中国模式的坏处主要是专权，主要在于限制言论、集会及其他自由，民众只要不乱说话，不打抱不平，不像刘晓波先生那样坚持要做自主的人，而是乖乖做个顺民，他们便可以安居乐业，享受经济成果。今次北京排除「低端人口」事件显示，安份守己生活仍然会飞来人祸，仍可能忽然因党领导要搞政绩工程而无家可归，流离失所，街头捱冻。换言之，在中国模式下，敢言固然不行，乖乖听话默默做经济螺丝钉同样没好结果。这样的模式还有什么优越性？有什么好学呢？",
				"added": 1512127579
			}
		],
		"14_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 35,
				"body": "> [p2p](#comment_1239_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ): 配额已加，并且把你设成了超版\n\n谢谢",
				"added": 1513426150
			}
		],
		"29_1FHN4oukAG7zFUpiC9L2iz7QpQVTuT3xkz": [
			{
				"comment_id": 39,
				"body": "> [guanliyuansb](#comment_20_1vr4cnus1yUJ1Jpf7jm2NhT19hSpMUNvJ): 推荐一个自用的shadowsocks SS/SSR服务商，一直在用，速度杠杠的~|价|格|优|惠|低至5元/50G/月。\n\n你这不是在广告，你这是在刷屏，希望你明白",
				"added": 1513748633
			}
		],
		"4_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 37,
				"body": "zeronetimwulv\n\n名言：\n> 各位蛆虫们肯定是不知道一个基本的新闻传播学的知识：如果媒体大量的报道自杀的新闻，当地的自杀率就会飙升，因为新闻在潜意识的推动有自杀倾向的人自杀。虐童新闻也是一样，**这种新闻不控制**，只会让有虐童倾向的幼师变成真正的施虐狂。这涉及新闻传播伦理。而且说的难听点，别说虐童了，**就是杀婴，对土共的统治有个屁影响？**就凭你们这些键盘侠？别特么往自己脸上贴金了。",
				"added": 1513603587
			}
		],
		"1_1DZ2pHTAGRN6fwrC7GaQuhMvu33LpmzkXU": [],
		"1_1CZg1ExEqw1DqjFD7ssKKHEXt4oY1ne8qJ": [
			{
				"comment_id": 40,
				"body": "您能不能别给我们加戏了呀，反共=轮子？",
				"added": 1513769459
			}
		],
		"4_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 41,
				"body": "> [zeronetimwulv](#comment_23_1CZg1ExEqw1DqjFD7ssKKHEXt4oY1ne8qJ): 比起所谓哀嚎，无数个体安居乐业，柴米油盐的安稳日子在你们眼里都是狗屁。。说到底还是反华。。。扯什么犊子？装哪门子逼？谁还不知道你们啊？\n\n**低端人口**安居乐业，啊哈哈哈哈哈哈哈哈\n**红黄蓝**安稳日子，啊哈哈哈哈哈哈哈哈",
				"added": 1513852751
			}
		],
		"19_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [],
		"18_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 44,
				"body": "> [p2p](#comment_1240_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ): @polar 另外多问一句，你这次貌似只加了屏蔽功能而不是同步zerotalk最新代码？\n\n你魔改太厉害了，没法直接替换，这是我手动diff的",
				"added": 1513922416
			}
		],
		"21_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 45,
				"body": "另外：http://news.sina.com.cn/zl/zatan/2014-08-03/11212011.shtml",
				"added": 1514096919
			}
		],
		"22_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 46,
				"body": "> [p2p](#comment_1242_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ):\n\n动画引导太花哨，何况有些是不能用动画的（安装，开发……），文字已经很好了\n另外，site check point是什么？",
				"added": 1514220406
			}
		],
		"1_1V6tWdNJijVi2kmzs24Wq98c8yJhkXtyW": [
			{
				"comment_id": 47,
				"body": "http://127.0.0.1:43110/NewGFWTalk.bit/?Topic:63_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ/+C+S+ZeroNet",
				"added": 1514298567
			}
		],
		"23_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 49,
				"body": "公告总共四个部分，总结一下就是：\n\n一、电池的使用寿命：\n「电池不行不是我们的错」\n\n二、防止意外关机\n「我这是为了你们好」\n\n三、近期得到的用户反馈\n「你们说的朕知道了」\n\n四、解决用户的担忧\n1.「我们会继续降频，不过这次改成光明正大地降频了」\n2.「更换电池服务优惠限时一年，2019 年起当然要恢复 608 元的定价咯」\n\n> https://www.zhihu.com/question/264781572/answer/285262249",
				"added": 1514566572
			}
		],
		"24_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 50,
				"body": "More: https://www.zhihu.com/question/56695957/answer/150781141",
				"added": 1514629017
			},
			{
				"comment_id": 63,
				"body": "我为什么反对教育部减负令？新中国建国以来，政府总共推出了 56 个减负法令，结果学生的负担还是与日俱增，不但没有减少反而更重！中国的家长最担心的就是政府胡乱出法令，我想通过《郎咸平说：改革如何再出发》这本书告诉我们的教育有关单位，你搞懂了教育制度的本质之后再决定下一步怎么做，好吗？\n\n## 美国教育的「拼爹模式」\n\n美国教育体系是什么样的？我把它叫作「拼爹模式」。各位千万不要对美国有太多的幻想，美国的教育制度是全世界最不公平的教育制度。它不是看你的学习能力，而是看你的爸爸妈妈有没有钱。也就是说，它是一个真真正正的资本主义市场经济国家，你出生家庭的财富决定了你能够上什么样的学校。\n\n2012 年按照升学比例来看，全美 32 所最好的高中，其中 31 所都是私立的，只有一家，排在第 9 位的亨特学院是免费的公立学校。顶级私立学校占美国高中的 4%，是真正培养美国精英的学校，学费一年 3 万~4 万美金，学生的父母必须有钱否则交不起学费。学校用这些钱聘请最好的老师，买最好的设备，建最好的环境，来培养美国最好的学生，这些顶级私立学校的升学率比一般的公立高中多出 20%。\n\n除了这 4% 的顶级私立学校，还有一类是名牌公立高中，占高中总数的 5%。这些名牌公立高中怎么来的呢？基本上地方政府收的房产税 50% 以上都投到了教育里，高的能达到 70%。所以很简单，如果是富人居住的高档社区，那么房价就高，房产税自然也高，因此学校的经费就特别充足。富人区能收的房产税肯定多过中产阶级社区，中产阶级社区能收到的房产税又高于城市的贫民窟，教育的差别就产生了。因此这 5% 的名牌公立高中往往是在富人区，也不是一般人可以读的。\n\n因此，美国的教育制度就是以财富为基础的制度，我称为「拼爹模式」，父母的经济状况决定了子女能上什么样的学校。美国社会的权力基础是金钱，比如说美国总统要竞选，州长要竞选，议员要竞选，人人可以参选，很公平对不对？但你如果要当选就需要大量的金钱。教育也是一样，美国人人都能享受免费教育，但如果你想获得最好的教育，想上 4% 的顶级私立学校，那么你必须出生在大富大贵之家。我当然不建议我们学习这样的美国。\n\n## 日本教育的「公平模式」\n\n日本教育是另外一个极端，叫作「公平模式」。日本的成功和它的教育制度是密不可分的。日本的教育制度是绝对公平的教育制度，它有两个政策，第一硬件标准化，第二师资标准化。硬件标准化在日本一百年前就已经时兴了。全国每个学校的教室、图书馆、宿舍、运动场都是一样的，连午饭吃什么菜都是一样的，每个学校像是克隆出来的。而且请你记住，全部是由国家财政补贴。这就是日本的教育。\n\n师资标准化这一点很值得我们关注。我们市区学校的条件好，农村学校的条件差，所以农村老师都想往城市挤，城里老师打死也不去农村。日本不是这样的。日本的小学、初中的老师薪水最高，其次是幼儿园老师，再次是高中老师，大学老师最低。你知道为什么？因为日本的小学、初中基础教育的老师必须要轮岗，六年一次，在市区的老师每六年就得从这个区转到另外一个区，甚至还要到农村去，因此必须给他们最好的待遇。为了激励中小学老师，不但薪水高，同时还把他们纳入日本的公务员体系，进入体制内，给编制。这就叫师资标准化，我可以说，全世界能够做到这一点的国家是凤毛麟角，日本做到了。\n\n所以这两点，第一硬件标准化，第二师资标准化，塑造了一个公平的日本教育制度。日本的高考制度和我们不一样，我们的高考制度是非常奇怪的，各地有各地的考卷，而日本是全国统考，同一张考卷，你考得上你就念东京大学，你考不上也不会抱怨，因为它是一个绝对公平的制度。\n\n## 中国模式综合了美国与日本模式的缺点\n\n我为什么要谈美国模式和日本模式？那就是因为我们这几年非常辛苦地学了日本模式，也学了美国模式，但很不幸的是，我们学的都不是优点，而是缺点。我们各学两个国家的缺点，然后自己加以发扬光大，就成了我们的教育模式。\n\n我们学习日本的教育公平制度，看起来很公平，其实一点都不公平。我们也用国家财政的钱补贴各个学校，这个好像是对的，是不是？但是我们既没有硬件标准化，也没有师资标准化，到最后我发现我们拿着国家财政的钱又学习美国模式，拿很大一部分比例去搞了重点学校、重点班。你们猜一下中国的重点学校有多少？这比例非常巧合，刚好就是 5%，和美国的顶级私立学校比例差不多，也就是说我们拿老百姓纳税的钱去补贴给这 5% 的重点学校。\n\n各位朋友一定知道名牌学校有多么重要吧。比如 2010 年清华、北大在陕西省招生，考上的学生 98.9% 来自于陕西省五所名牌重点高中，其他高中就是三个字，没希望。这就是为什么家长们一定要千方百计利用权力、利用金钱，用各种方法让自己的子女进入这些重点学校。那谁去念重点学校呢？我们就以北京市为例，叫三三制。1/3 的学生是这些学校自己培养的「占坑班」的学生，或者是成绩好的，或者是奥数好的，这些凭成绩进来的占 1/3；学区房（户籍标准）的学生占 1/3；另外，靠领导批条子进来的「条子生」占 1/3。所以你发现有 2/3 的学生是靠着金钱和权力进入了所谓的重点学校。\n\n问题就在这里，用全体老百姓的钱，来学习美国的教育模式，来建设这 5% 的重点学校，这公平吗？美国老百姓对所谓的顶级私立学校没什么好抱怨的，人家是学生家长自己出钱。那我们的重点学校呢？不是学生自己出钱，是国家财政出钱，也就是全体老百姓出钱。凭什么全体老百姓出钱培养少数人的子女？所以这才是最大的教育不公平。\n\n我们学日本的公平制没学会，学美国的财富制也没学好，再加上我们自己的区域歧视制，形成了一个前所未有的特权制，这才是我们的教育制度改革要搞明白的问题。\n\n> [郎咸平：中国教育综合了美国「拼爹模式」与日本「公平模式」的缺点](http://blog.sina.com.cn/s/blog_4120db8b0102eb6v.html)",
				"added": 1517275187
			}
		],
		"1_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": [
			{
				"comment_id": 53,
				"body": "1. Copy file to site folder\n2. Insert `<video src=\"...` into blog body",
				"added": 1515063904
			}
		],
		"13_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 54,
				"body": "户籍=国籍，至于你信不信，我反正信了",
				"added": 1515158229
			},
			{
				"comment_id": 55,
				"body": "> [beidou](#comment_3_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2): 户籍=国籍？\n\n低端人口被驱逐，这件事忘记了？",
				"added": 1515160106
			}
		],
		"27_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 56,
				"body": "蒙古人对汉人的屠杀有：\n1215年，铁木真攻陷中都（现在的北京），对城中的汉人居民进行了长达一个月之久的大屠杀，超过100万人为此殒命（大多数是汉人）。\n1227年，铁木真出征西夏。临死前命令他的继承者拖雷在西夏投降后，将西夏境内的汉族系数屠杀。仅西夏都城兴庆府（今银川）就有超过80万的居民被屠杀。\n1231年，拖雷引兵攻掠四川，大肆屠杀成都的汉族居民。千年古城只落得民无谯类，城中遗骸达到惊人的140万！\n1274年，蒙元攻下南宋死守多年的常州，因为常州守将多次拒绝投降蒙元，忽必烈大怒，于是下令屠杀城内的汉族居民70万人，妇孺老人皆一个不留！！！！\n1352年，红巾军已起义，蒙元行将灭亡时，蒙古统治者还对徐州、杭州的汉族居民进行了野蛮的大屠杀。并计划要消灭张王刘李赵汉族五大姓。只是由于红巾军的奋起一击，这项种族灭绝政策才没有被最后执行。\n\n满族人更过份，对汉族的大屠杀有：\n扬州十曰、嘉定三屠、苏州之屠、南昌之屠、赣州之屠、江阴之屠、昆山之屠、嘉兴之屠、海宁之屠、济南之屠、金华之屠、厦门之屠、潮州之屠，沅江之屠、舟山之屠、湘潭之屠、南雄之屠、泾县之屠、大同之屠、汾州、太谷、泌州、泽州等。\n这些惨绝人寰的屠杀，模式基本一致：根据清军头子发布的屠城令，实施的残忍的集体杀戮，和无耻的集体强奸。而屠杀后，不仅人头被堆积成「京观」，甚至还将女性的敏感部位割下，作为论功行赏的凭据！「取阴肉或割乳头，验功之所，积成丘阜」。\n广州大屠杀，死难70万人。嘉定三屠杀了50多万。\n潮州大屠杀，「纵兵屠掠，遗骸十余万」，揭阳县观音堂海德和尚等收尸聚焚于西湖山，将骨灰葬在西湖南岩。福建同安县屠城死难5万余人，梵天寺主持释无疑收尸合葬于寺东北一里之地，建亭「无祠亭」，墓碑上则刻「万善同归所」。\n常熟大屠杀，「通衢小巷，桥畔河干，败屋眢井，皆积尸累累，通记不下五千余人，而男女之被掳去者不计焉。」「沿塘树木，人头悬累累，皆全发乡民也。」（《海角遗编》）\n在南昌，八旗军把掠来的妇女分给各营，昼夜不停的轮奸（「各旗分取之，同营者迭嬲无昼夜」）。这些女性「除所杀及道死、水死、自经死，而在营者亦十余万，自愿在营而死者，亦十有七八。而先至之兵已各私载卤获连轲而下，所掠男女一并斤卖。其初有不愿死者，望城破或胜，庶几生还；至始知见掠转卖，长与乡里辞也，莫不悲号动天，奋身决赴。浮尸蔽江，天为厉霾。」（徐世溥《江变纪略》）此书是满清查禁的重点，在乾隆44年被明令销毁，靠着手抄本流传下来。\n\n唉呀，太多了。这只是其中的一部分。\n这些是不是真的呀？\n怎么现在成吉思汗，努尔哈赤在我们汉族的课本上，怎么都是英雄呀？\n感觉他们怎么和以前的日本人侵略者一样呢？\n\n> 转载 百度 文化艺术分类达人 曹爱雅",
				"added": 1515162867
			},
			{
				"comment_id": 57,
				"body": "南京大屠杀拿到中国历史上，那简直就是小菜一碟。之所以被大家所铭记，只是因为发生在近代，再有就是国家的宣传。**至于更早些的历史，全他妈忘了。**\n\n举几个例子：\n\n满清入关大屠杀：1000万以上\n\n扬州十日、嘉定三屠、苏州之屠、南昌之屠、赣州之屠、江阴之屠、昆山之屠、嘉兴之屠、海宁之屠、济南之屠、金华之屠、厦门之屠、潮州之屠，沅江之屠、舟山之屠、湘潭之屠、南雄之屠、泾县之屠、大同之屠、汾州、太谷、泌州、泽州等等等。清初的大屠杀政策使中国人口由明光宗泰昌元年的五千一百多万下降到一千多万。这近三分之二人口的灭绝，虽然还有其它天灾人祸，但满清是最大的凶手。清兵的扬州大屠杀后，幸存者所著《扬州十日记》中记载屠杀共持续十日，仅被收殓的尸体就超80万具。\n\n太平天国死亡平民：1000万以上\n\n洪秀全领导太平天国起义，义军在起义后的六年中，不过牺牲4千余人；然而内讧中的1856年，洪秀全利用韦昌辉杀害杨秀清及亲信6千余人，两个月总共杀了文武官员2万人。后来又利用石达开来天京靖难，凌迟处死韦昌辉，将其尸体寸磔，割成许多块，每块皆二寸，挂在各处醒目的栅栏处，标上「北奸肉，只准看不准取」的字样。「洪杨之变」导致了十几万人被杀。1864年曾国藩的部下曾国荃率湘军攻入「天京」后，杀害数十万人的生命。太平天国强盛时，南京最多有100万人，可曾国荃杀过10多年后，到光绪登基时，南京也还不到50万！\n\n五胡乱华死亡平民：1000万以上\n\n五胡乱华是中国南北朝时期北方多个少数民族大规模南下而造成与汉族政权对峙的时期。又称永嘉之乱或五胡十六国。入塞胡族中，羯、白匈奴、丁零、铁弗、卢水胡、鲜卑、九大石胡等部落主体都是金发碧眼的白种人，这些来自蛮荒之域的野蛮胡族还保留着原始的食人兽性，其中以羯族，白种匈奴，鲜卑族三族最为凶恶。公元304年，慕容鲜卑大掠中原，抢劫了无数财富，还掳掠了数万名汉族少女。回师途中一路上大肆奸淫，同时把这些汉族少女充作军粮，宰杀烹食。走到河北易水时，吃得只剩下八千名少女了，慕容鲜卑一时吃不掉，又不想放掉，于是将八千名少女全部淹死，易水为之断流。史书记载羯族军队行军作战从不携带粮草，专门掳掠汉族女子作为军粮，羯族称之为「双脚羊」，意思是用两只脚走路像绵羊一样驱赶的性奴隶和牲畜，夜间供士兵奸淫，白天则宰杀烹食。在羯族建立的羯赵政权统治下，曾经建立了雄秦盛汉的汉民族已经到了灭族的边缘。到冉闵灭羯赵的时候，中原汉人大概只剩下400万（西晋人口2000万），冉闵解放邺都后一次解救被掳掠的汉族女子就达二十万。\n\n冉闵《杀胡令》死亡平民：保守估计100万\n\n五胡乱华时期，原来居于中华大地周边的各少数民族大举侵入中华大地，大肆的对汉人进行着屠杀和奴役，出于报仇，冉闵以扫清中原为号召，扬言要六胡退出中土，否则将其统统杀绝。这就是有名的《杀胡令》。仅山西中南部和河北常山以南被杀的白奴（匈奴分化为白奴和黄奴，黄奴自称夏后依，白奴被冉闵和各路山西义军杀绝）多达六十万之多，其中四十万被冉闵正规军杀绝。两次屠羯达三十二万之众，羯族从此从中国历史上消失。\n\n其中屠杀人数之最还数蒙古帝国大屠杀，死亡平民：2亿。\n\n这次屠杀空前绝后，已载入世界吉尼斯记录。估计中国直接死于屠杀的有3000--4000万。连同中亚西亚和东欧共死亡约2亿人。1122年全国人口9347万，到元初1274年，人口887万。损失率高达91%。蒙古人灭花剌子模，屠寻思干（撒马尔罕）城约百万人口；灭西夏，屠八十余万。蒙古人数次西征，凡有抵抗即屠城，共屠数百城，包括屠杀了巴格达的数十万人口，整个中亚一片废墟。忽必烈屠杀了中国人1800万人，中国北方90%汉族平民惨遭种族灭绝。四川在蒙古帝国屠杀前，估计有1300-2000多万人，屠杀后竟然不满80 万人，几乎成了无人区。在蒙古人杀戮和统治下，中国丧失了7000多万人口。蒙古帝国在中国境内的种族灭绝，作为世界记录放在《吉尼斯世界记录大全》 1985年版。蒙古人统治下的汉人、南人是贱民。杀蒙古人偿命，杀回回罚银八十两，杀汉人罚交一餐头毛驴价钱。汉人村里新媳妇的头一夜一定要给蒙古保长，中国人甚至连姓名都不能有，只能以出生日期为名，不能拥有武器，只能几家合用一把菜刀。公元1215年，铁木真攻陷金国都城中都（也就是现在的北京），对城中居民进行了长达一个月之久的大屠杀，超过100万人为此殒命。公元1220？1221年，蒙古人第一次西征时，对多思汗也就是撒马尔罕（还有说是玉龙劫赤的）进行了疯狂屠杀。当时共计5万蒙古兵，平均每人手刃24个百姓之多。被屠杀者多达120万。公元1227年，铁木真去世于六盘山。其后它的继承者实现了对西夏的征服。出于报复，将西夏境内的居民系数屠戮。仅西夏都城兴庆府（今银川）就有超过80万的居民被屠杀，党项民族也从此灭绝于中华大地。1231年，拖雷引兵攻掠四川，大肆屠杀成都居民。千年古城只落得民无谯类，城中遗骸达到惊人的140万！ 1258年，旭列兀（拖累的儿子，忽必烈的兄弟）的蒙古铁骑攻陷巴格达，大屠巴格达居民。据说120万人死于屠刀下，以至于底格里斯河河水为之一片血红！直到公元1352年，蒙古统治者还对徐州、杭州居民进行了野蛮的大屠杀。并计划消灭张王刘李赵汉族五大姓。只是由于红巾军的奋起一击，这项种族灭绝政策才没有被最后执行。\n\n---\n\n再更新几个国外的大屠杀\n\n卢旺达大屠杀死亡平民：100万\n\n1994年4月6日凌晨，卢旺达总统哈比亚利马纳在邻国坦桑尼亚参加完和平谈判后，其座机在返国途中被不明飞弹击落，机毁人亡，胡图族激进分子迅速掌控卢旺达政府。4月7日，震惊世界的卢旺达大屠杀开始。胡图族激进分子因为不满哈比亚利马纳准备与图西族政党签订权力共享协议而制造了这起暗杀。随后，他们依照计划开始杀害胡图族温和派政治人物和图西族领袖，然后他们试图消灭整个图西族。据估计，在接下来的100天内，将近100万人被屠杀，这堪称世界上速度最快的大屠杀。直到图西人领导的军队赢得了这场内战并开始掌权时，大屠杀才被制止。\n\n亚美尼亚大屠杀死亡平民：150万\n\n亚美尼亚位于外高加索南部，与土耳其东部接壤，在历史上曾被土耳其奥斯曼帝国统治。据亚美尼亚方面的史料记载，1915至1923年期间，奥斯曼帝国对亚美尼亚人实施了惨无人道的种族灭绝政策，导致150万人死亡。\n\n罗马帝国屠杀犹太人死亡平民：150万余\n\n公元1世纪，罗马帝国攻占巴基斯坦后，犹太人举行过多次大规模反抗罗马占领者的起义，但都遭到了罗马统治者的血腥镇压。到公元135年的犹太人起义再义惨遭失败为止，在这1个多世纪的时间里，罗马统治者屠杀了一百五十万犹太人，最后把还把余者全部赶出马勒斯坦土地，使他们流散到西欧完全处于落后的小生产的农牧社会。\n\n德国屠杀犹太人死亡平民：600万\n\n1939年9月1日，德国部队进攻波兰。第二次世界大战初期，德国取得了军事上的胜利，成功控制了欧洲本土的大部分地区以及苏联和北非的大片领土。1941年，德国开始了大屠杀（Holocaust），有组织地杀害了大约600万犹太人和大约25万德国籍残疾人（所谓的「安乐死项目」）、以及强迫其他「劣等民族」作为强制劳工。德军占领苏联欧洲大片领土后，德军的党卫队等对苏联和波兰等斯拉夫民族也进行了灭绝性的大屠杀。\n\n---\n\n注：屠杀未必只发生在一个城市，更可能是全国性大屠杀。而且屠杀的理由，和其所用的方式和手段比日军可能还要凶残的多。\n\n> https://www.zhihu.com/question/22663514/answer/44961720",
				"added": 1515163192
			}
		],
		"9_1AztBTbD25eZtkKSsmUjQG8MXKP3KQQSy": [
			{
				"comment_id": 58,
				"body": "OK.",
				"added": 1515592864
			}
		],
		"32_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 60,
				"body": "## 壹、区别尖团音是民族语言的传统\n\n区别尖团音是汉语的传统，不论是上古、中古、近代和现代（1955 年「现代汉语规范化学术会议」以前），汉语北方话的大众语音大都是分尖团的，这是不可否认的事实。早在造字时代，汉语就区别尖团音，这从上古字书中的直音注音和尖音字与团音字的谐声偏旁丝毫不乱的事实可以得到证明。自从东汉末年有了反切注音的方法，尖团音的区别就更加明显，凡是见系齐撮呼的读音就是团音，凡是精系齐撮呼的读音就是尖音，从切脚上字看得明明白白，例如：团音字「剑」用居欠切（jian），「九」用己有切（jiu），而尖音字「箭」用子贱切（zian） ，「酒」用子有切（ziu）。自此一千八百年来，凡用反切注音的字书、韵书无不分尖团。较早的如梁的《玉篇》，较晚的如清的《康熙字典》，民国时的《中华大字典》。不仅传统的字书分尖团，就是学界普遍承认的反映北方话（包括北京话）实际语音的字书、韵书也都是分尖团的，如元代周德清的《中原音韵》，明代兰茂的《韵略易通》、徐孝的《等韵图经》、叶秉敬的《韵表》，清代樊腾凤的《五方元音》、陈廷敬的《字母切韵要法》、无名氏的《圆音正考》、李光第的《音韵阐微》、贾存仁的《等韵精要》、高静亭的《正音撮要》、张象津的《等韵简明指掌图》等。又不止中国人的字书、韵书分尖团，就是反映清代官话语音的外国人的字书、韵书也是分尖团。一如朝鲜人的《伍伦全备谚解》、《汉清文鉴》、《译语类解补》、《重刊老乞大谚解》等书中标注的汉字字音分尖团。二如清末西洋人的「威妥玛拼音方案」和「邮政式拼音方案」（1906 年制定，国际上使用到 1977 年）也是分尖团。最重要的是现代人制定的两套拼音方案仍然分尖团：一是 1913 年全国「读音统一会」审定的法定标准音——「国音」里分尖团，二是 1929 年 CCP 人瞿秋白创立的反映「北方话大众语音」的「北方话拉丁新文字」（1931 年公布，民间使用到 1955 年）里分尖团。古今中外的字书、韵书和拼音方案，无不证明分尖团是汉民族共同语的传统语音。\n\n---\n\n## 贰、尖音舌面化是旗人入关带来的语病\n\n既然分尖团是汉语的传统，为什么现代汉语里尖团合流了呢？要说明这个问题，就需要追溯尖团合流的起源。1616 年努尔哈赤建立「大金」奴隶制国家后，为了逐鹿中原，满州贵族开始学习汉语，说汉话。1644 年清军入关，数量众多的以满洲旗人为主体的东北人进入北京。\n\n为了统治的需要，他们都学习和使用了汉语。满语虽被汉语所同化，但满语和汉语不属于同一语系。\n\n**满语比之汉语，有两点差异：**\n\n一是满语的语音成分比汉语贫乏，不但没有汉语精系齐撮呼的读音——尖音，而且平舌音（尖后 - 齿龈音）z c s 和轻度翘舌音 zh ch sh 没有明显的音位区别。二是发音特点有所不同，满人的舌身后缩、舌尖上翘，发 zh 组声母时，变汉语的轻度翘舌音为「舌尖抵硬腭后部」的卷舌音；发 z 组声母时，变汉语舌尖抵下齿背为「舌尖抵上齿背」。舌尖抵下齿背发音的 z c s 能自然和谐地与齐撮呼韵母拼出响亮清晰的尖音，而舌尖抵上齿背发音的 z c s 则难以和齐撮呼韵母相拼，即使勉强相拼，也只能拼出尖细刺耳的带儿化音味的尖音，与汉语传统的尖音大相径庭。由于满人舌身后缩、舌尖上翘这一特点，就把尖音的发音部位后移，由舌叶移到舌面前，发得近似于舌面音 j q x 了（但不等同于舌面音）。这就是满人说汉话出现尖音舌面化语病的原因。\n\n清初的满洲统治者，尖音舌面化的语病非常普遍，不用说一般的八旗首领、王公贵族，即使是对汉语有专门研究的「博雅名儒、辞林硕士」也是「往往一出口而失其音」（见道光十年《乌扎拉氏文通序》）。但是清初的满洲统治者并没认识到这个语病，自认为他们说的话就是标准的官话而加以推广。雍正皇帝就曾带头在朝堂上说这样的近似于尖团合流的官话，在南方开设的「正音书院」里，定要以驻防的旗人为正音教师。清初的满州大人推行这种「洋泾帮」式的尖团合流的官话，顺者昌，逆者亡，近似于无形的「剃发令」，大有「不随本朝者，杀勿赦」的严酷。这样，满大人的尖音舌面化的语病就传染给了在官场混事的许多汉族或其他民族的官员和知识分子。凡是满洲旗人驻防、管辖、或居住的重要城市，尖音舌面化的程度就重，如北京、天津、太原等地；凡是满族人不去或少去的地方，如山区和农村，尖音舌面化的程度就轻，或完全没有。这种尖音舌面化的程度和满州旗人影响成正比的情况在全国随处可见。满洲贵族的这种语病虽被汉族知识分子发现，但慑于异族征服者的自尊和森严的政令，谁都不敢犯颜直谏，明白指出。清初的学者傅山，只能借谈太原人的语音变异进行曲折地批评。他说：「太原人语多不正，最鄙陋恼人，吾少时听人语不过百人中一二耳，今尽尔矣，如酒为九，九为酒，见为箭，箭为见之类，不可能辨。」（见《霜红龛全集．咳唾珠玉补遗》）。民族主义十足的傅山先生的这番话，带着愤激的心情，夸张的语言，一方面批评满洲旗人的语音不正，一方面讥刺趋炎附势的官场汉人随从旗人语音的鄙陋行为。「今尽尔矣」并不是实指太原人，而是指随从旗人语音的官场汉人。清军入关九十多年后，满族知识分子才自我发现这种语病，于是在 1743 年（乾隆八年）专为纠正这种语病，分辨尖团音而出台了《圆音正考》，明确指出「试取三十六字母审之，隶见溪郡晓匣五母者属团，隶精清从心邪五母者属尖，判否泾渭，与开口、闭口，轻唇、重唇之分，有厘然其不容紊者……」但此时满人的语病早已形成，纠此语病已是困难的事情。纠此语病虽然困难，但毕竟取得了成绩，到十九世纪初，就有不少满族人能部分的分辨尖团音了。1810 年高静亭依照北京官场语音编写的《正音撮要》里，尖团音半分半合的情况（齐齿呼分尖团，撮口呼不分）就反映了满大人的语音正在向分尖团的方向发展。1830 年《乌扎拉氏文通序》对尖音舌面化语病的回顾也反映了满州贵族认识和改正尖音舌面化语病的情况。\n\n---\n\n## 叁、北京人的尖团音有了分与不分的分歧\n\n清军入关前的北京人是区别尖团音的，是和中原语音一致的。因为北京早在夏商周三代就是华夏政权的诸侯国，「北京的汉族人大都是从中原地区迁徙去的」，「同时又长期受到以洛阳话为标准音的共同语的影响」，「本来与黄河中心地带的其他北方话差别不是太大」（摘自唐作藩《普通话语音史话》）。清军入关以后，大量的以满州旗人为主题的尖团不分的东北人进入北京，成为新北京人，他们的语音又影响了许多在京的汉人，特别是那些投靠满州大人的在京官吏、「投充」到满州贵族门下的奴婢以及住在官街御路、王公府第或满人宅舍附近，经常和八旗子弟打交道的人，他们大都随从了满人的尖团不分。但是，那些不入官场、很少和满人打交道的人，那些住在偏僻胡同里的平民百性，尤其是那些足不出户的家庭妇女，还有以口舌为生的说书、唱戏、唱唱的「下九流」，他们仍然分尖团。这就是北京人尖团音分歧的实际情况和历史原因。\n\n北京人的这种语音分歧，从清初到清末始终存在着，从民国到现代也仍然存在着，这既有史料作证明，又有活人的语音作证明。\n\n**一、语音史料的证明**\n\n语音史料的证明可见诸以下四个方面：\n\n（一）、反映清代北京音的言论和韵书：一如康熙初年《霜红龛全集》傅青主先生对太原人（借指北京满大人）尖团不分的批评；二如乾隆八年《圆音正考》对满州人分辨尖团音的要求；三如 1810 年高静亭《正音撮要》反映的北京官场语音中尖团音半分半合的情况；四如 1830 年（道光十年）《乌扎拉氏文通序》对满大人尖团不分情形的回顾。这些史料一则说明分尖团是官话北京音的正统语音，尖团合流是北京满州旗人的语病，二则说明北京人有分尖团和不分尖团的语音分歧。\n\n（二）、洋人字典上尖团音的矛盾：1876 年，英国驻华使馆的秘书威妥玛设计的《威妥玛方案》里有舌尖音的两套声母，一套是 tz、tz'、sz，一套是 ts、ts'、ss，一套拼精系洪音，一套拼精系细音，表明《威妥玛方案》是分尖团的。但是英国公使多和尖音舌面化的满大人交往，受满大人语音的影响，把满大人的语音当成了官话标准音，即 Mandarin。1892 年翟理斯就修改了《威妥玛方案》，尖音字的声母不用 ts、ts'、ss 而改用了 chi、ch'i、hsi（相当于舌面音 j、q、x）（见 1892 年初版的《华英字典》），开了汉字注音尖团合流的先河。但翟理斯尖团合流的注音方式并未得到国内和国际的公众承认，在 1906 年帝国邮电会议上制订的「邮政式方案」里，尖音字的声母又改为 ts、ts' s。从英国人拼音方案的反复改变，也可看出北京音内部尖团音分歧的情况。\n\n（三）、「以京音为主」制定的「国音」分尖团：1911 年清症苦的「中央教育会议」就决定统一国语「以京音为主」，1912 年蔡元培主持召开的「临时教育会议」也是「以京音为主」，1913 年「全国读音统一会」审定的法定标准音——「国音」仍是「以京音为主」，仍是分尖团。在「国罗派」未崛起之前，在清末民初讨论民族共同语标准音的那一阶段，赞成以北京音为标准音的学者占多数，而赞成尖团合流的学者占少数，从这里也能看出北京人有尖团音的分歧。\n\n（四）、国语运动非常人物的态度：张一麟先生在担任北洋症苦「读音统一会」会长时，一再强调国语标准音应以北京音为准，但他自始至终地主张分尖团，他不但积极宣传推广分尖团的「老国音」，而且极力拥护分尖团的「北方话拉丁新文字」；蔡元培先生担任过北洋症苦和国民党症苦的大学院院长，一直坚持以北京音为准。他虽以「南京症苦大学院」的名义公布过「国语罗马字」，但他后来却极力拥护分尖团的「北拉」，而不赞成尖团合流的「国罗」。从这两位国语运动的非常人物的态度上也能看出这一点。\n\n以上这四个方面的语音史料都说明北京人有尖团音的分歧，说北京人全部不分尖团谁也没有确绝的证锯。\n\n**二、现代北京人的语音证明**\n\n不但语音史料能证明北京人有尖团音的分歧，现时活着的北京人的语音更能证明北京人的语音分歧。首先看看戏曲、说唱界的语音：以京剧界为代表的北京戏剧界、曲艺界都主张分尖团。北京老一代艺人，不论是京剧、评剧、昆曲，还事大鼓、弹唱、平词，都有区别尖团音的名家，虽然许多人已经故去，但他们的录音还在。难道说说唱艺人和听众之间有天然的鸿沟吗？众所周知，任何戏曲、说唱都来自民间，活动在民间，其语音必然和它生存空间的民众的语音相一致，因为听众是上帝，你的口齿不清就不受欢迎，你说的唱的民众听不清就会「散场子」，你就生存不下去。任何以口舌说唱谋生的人，最怕听众说你口齿不清。难道说北京是另样的天下，只会产生分尖团的说唱艺人，而不会产生分尖团的听众？譬如京剧，不止演员分尖团，戏迷也分尖团。北京是京剧艺术的中心，京剧票友数以万计，他们谁都能唱段「西皮」或「二黄」，有谁不分尖团呢？不论是知名人士罗建文（国家围棋手）、刘曾复（胜友会会长），还是普通票友马凤春、苗过林，他们都清清楚楚地分尖团。以京剧界为代表的戏曲界是分尖团的，以歌坛明星为代表的说唱界也是分尖团的。北京的老中青三代歌星都能分尖团，如关牧村（北京是其第二故乡）、蔡国庆、臧天朔、崔健、黎明、老狼、雨泉、田震、李子一、章子怡等。虽然有的歌星尖团音相混甚至趋向于「女国音」（如蔡国庆、章子怡），但仍应认为是分尖团的语音，因为在尖团合流的人造「标准音」的逼迫下，人们的尖团音被扭曲，中青年人谁也做不到整齐分尖团了。也许有人认为戏剧界和歌坛都不能代表北京音，那就看看普通老百姓的发音：河南新乡大学的陈泓教授指出「北京郊县…… 就有明显的尖团音」（见《学界京剧界对尖团音认识的区别和辩证》浙江海洋学院学报，1999 年 12 月）。现代语言学家唐作藩先生说「北京西诚区多能区别尖团音」（2000 年与笔者的通话纪录）。北大语音论坛的五星会员上海闲话发贴谈到：「…… 北京外城的汉族百姓分尖团，却被忽视，内城的满清八旗子弟不分尖团，被重视……」。易仓居士的凋查发现，北京各城区都有区别尖团音的老年人，尤其是民间只读过私塾没上过学堂的老书生、七十岁以上的文盲老太太和以说唱为生的老艺人大多区别尖团音。诸如北京戏剧院院长扬非，陶瓷绘画大师稽锡贵、把其四子常正明告上法庭的 92 岁老太太高金花、创老年人踢毽子吉尼斯纪录的张玉坤，基督教牧师袁相忱之妻梁惠珍…… 不胜枚举。即使是使用普通话的现代中青年，分尖团的也大有人在，诸如中央电视台「焦点访谈」2003 年 11 月 30 日报道中，北京石景山劳动争议办公室的干部付新生分尖团；同年 × 月 × 日报道的天桥区和平里民政干部马润海及在场发言的多位妇女群众分尖团；基督教「十字架」影谍上北京基督笃信者陈秀繁等人分尖团…… 不仅为数众多的北京人分尖团，而且许多北京人对「北京人不分尖团」的说法很不满意，曾在中原油田工作过的北京人石耕山先生（现住中原油田退休二十站），就很不服气地说：「谁说北京人不辩尖团音？我来读给你们听」（指笔者的《尖团音辨音字表》），他清清楚楚地把酒、箭等字读为尖音，把九、剑等字读为团音。\n\n不论是语音史料，还是方言调查，都充分证明从清初到现代的北京人在尖团音上有分与不分的两个群体，学界对北京尖团音的认识也一直存在着分歧。\n\n---\n\n## 肆、「国罗派」学者硬砍尖音\n\n既然区别尖团音是民族共同语的传统，是北方话的大众语音，既然北京音里也有尖团音的分歧，为什么 1923 年「国语统一筹备会」的第五次常年会议决议取消尖音呢？这种反常现象的出现，既有时代因素和政治因素，又有方言因素和人为因素。分述如下：\n\n一、国语罗马字运动的兴起和「国罗派」学者左右「国语统一筹备会」\n\n清末唯新变法之后，中国掀起了「文改运动」和「国语运动」两个热潮。在这相辅相成的两项改革运动中，一直存在着保守稳健派和左倾急进派的分歧，也就是中（老派）、西（新派）两派的分歧。1908 年，以吴稚晖（就是后来「国语统一筹备会」的会长吴敬恒）为代表的深受西洋文化影响的急进派认为：汉字、汉语「野蛮」、「落后」，都必需改革，要用拼音字取代汉字，要用世界语取代汉语。这种观点遭到了学术大家张炳麟为代表的中派（老派）学者的批判。1913 年「全国读音统一会」审定的「老国音」体现了保守稳健的中派学者的意愿：字母形体是汉字笔划式，字母功用是给汉字注音而不是代替汉字；语音系统是传统的北方话，不但有 24 个声母，而且分尖团、有入声（声调）。左倾急进而轻视传统的西洋派学者对此并不满意，多方面挑剔非难，一方面指责汉字笔画式的注音字母不利于中文西化（拼音化），一方面指责「国音」的语音成分太繁杂，说分尖团、有入声「这种兼顾古今南北的国音是无法推广的」（见《中国大百科全书》李荣先生的《赵元任》条）。1918 年，随着「打倒孔 家店」口号的提出，左倾急进思潮成为时代潮流。钱玄同发表了《中国今后的文字问题》一文，赞成吴稚晖废除汉字和汉语，采用世界语的主张。陈独秀、胡适等新文化运动的领袖们，又发表文章赞成钱玄同废除汉字采用罗马字的主张。随之，「五、四」先贤们都认为「汉字不废，中国必亡」，于是在中国的语文学界掀起了国语罗马字运动。随着国语罗马字运动的兴起，凡事通晓欧文、撰文鼓吹汉字拉丁化的西派学者，诸如钱玄同、赵元任、黎锦熙、黎锦辉、汪怡、周辨明、林语堂等等就都成了时代明星。凡是倡导「国罗」有了些名气的西派学者，大多被「国语统一筹备会」（1919 年成立）的主席吴稚晖（吴敬恒）和权威人士黎锦熙选进或请进「国语统一筹备会」，成为会中的主要成员。而保守稳健的中派（老派）学者通晓欧文者甚少，在「国语罗马字」面前成了蹩脚，英雄失去了用武之地，不断地受到「国罗派」的排挤，不断地有人辞朝下野。于是「国语统一筹备会」里新、老两派的人数比起了变化，新派学者的人数大大超过了老派。随之，「国语统一筹备会」被左倾急进的西洋派——「国罗派」学者所主宰，成了「国罗派」的一言堂，稳健保守的中派（老派）学者勿容置喙了。「国罗派」控制了「国语统一筹备会」之后，于 1923 年八月下旬召开了「国语同一筹备会」的第五次常年会议，一方面决议组织「国语罗马字拼音研究委员会」来议定取代汉字的「国语罗马字」，一方面决议成立「国音字典增修委员会」来修改「国音」，简化语音、合并尖团。\n\n二、国罗派简化语音、合并尖团的原因\n\n国罗派（激进派、西洋派、新音派）学者为什么要简化语音、合并尖团呢？原因大致有如下几点：\n\n1、罗马字母的限制\n\n要搞「国语罗马字」就不能超越 26 个罗马字母。赵元任 1923 年发表的「国语罗马字的草稿」就规定：限用 26 个拉丁字母，声调用字母拼法上的变化表示，不造新字母，不加符号。赵元任的这些规定，特别是用字母表示声调的规定，严重束缚了手脚，因为要用 26 个罗马字母来表示汉语复杂的声、韵、调是极为困难的。既要用字母标调，又不能增添符号，26 个拉丁字母怎么够用呢？要解决这个难题就必然要求尽量简化汉语的语音系统。要简化语音，去掉入声（声调），合并尖团，合并 iai ai，合并舌尖、舌面二鼻音是他们的首要选择，一是因为这些语音成分在当时有所争议，二是因为不这样做就难以解决音素多而字母少的矛盾。例如入声，在近代北方话中是五个声调（阴平、阳平、上声、去声、入声）中的一个，而在南方却似辅音韵尾，有所争议；字母表调的罗马字又难以表示五个声调，由此两个原因，「国罗」里去掉了入声。合并尖团与此类似，一是在尖团音上有争议，二是字母表调的罗马字难以表示尖音。尖音的表示向来是拼音方案设计的难题，要表示尖音，只有两种方法：第一种方法是承认「零韵母」（相对「零声母」），即承认 z c s 自成音节，如「北方话拉丁新文字」里，精系洪音的资雌私用 z c s 表示，精系细音（尖音）的积七西用 zi ci si 表示，疽蛆须用 zy cy sy 表示（「北拉」的 y 为<）。「老国音」里也是这样，资雌私用ㄗㄘㄙ表示，尖音字积七西用ㄗㄧ　ㄘㄧ　ㄙㄧ表示，疽蛆须用ㄗㄩ　ㄘㄩ　ㄙㄩ表示。第二种方法是单立一组尖音声母，如「威妥玛方案」把舌尖音分为洪、细两组——ts ts's 和 tz tz' sz。用 tz tz'sz 拼洪音，用 ts ts' ss 拼细音。可是这两种表示尖音的方法「国罗」里都不能采用。一是因为「国罗」是用字母表调，不能采用「零韵母」（让 z c s 自成音节）的方法；二是因为「国罗」不用送气符号，只好把「威妥玛方案」的洪、细两组舌尖音——ts、ts'、ss 和 tz、tz'、sz 合并为一组——tz ts s。这样一来，「国语罗马字」就山穷水尽，想不出拼写尖音的办法了，就只好砍掉尖音了。假若有表示尖音的理想方法，赵元任先生很可能不放弃自己坚持过的分尖团的意见。在「限用 26 个拉丁字母，声调用字母拼法上的变化表示，不造新字母，不加符号」的严格限制下，砍尖音也是无可奈何的办法。这或许是「国罗派」砍尖音的主要原因。\n\n2、《华英字典》的影响\n\n崇尚西洋的「国罗派」学者，之所以胸有成竹的要用罗马字母拼音取代汉字，是因为他们深受翟利斯的《华英字典》的影响。《华英字典》里每个汉字都注有罗马字母拼音，只是还不能从拼音音节上区别声调。他们认为只要给这些拼写汉字的字母音节加上表调字母，再把有了表调字母的「拼音字」连写成单词，就能像英语那样记录语言了。1923 年赵元任在《国语罗马字母的研究》一文中强调声调用字母拼法上的变化表示，几乎同时黎锦熙在《汉字革命军前进的一条大路》一文中强调「词类连书」，表明他们具有同样的观点——在《华英字典》的基础上创造「国语罗马字」。《华英字典》成为「国罗派」「国语罗马字」的脚本，只要对比一下「国语罗马字」和《华英字典》的字母形式和语音体系就明明白白。如《华英字典》里用翘舌音的细音表示舌面音（j q x ），「国语罗马字」里也用翘舌音的细音表示舌面音（j q x ），真是也步也趋。殊不知这是极为悖谬的，完全不符合汉语语音的发展规律。现代学者谁不承认，舌面音（j q x ）是从见系舌根音（g k h）里腭化出来的，是舌根音（g k h）的细音？洋人不尊重汉语语音的发展规律有情可原，「国罗派」的核心人物赵元任、黎锦熙也这样做实在令人遗憾。一味的崇拜西洋就会忘记传统，忘记祖宗，这可能是二十世纪中国知识界的通病。「国罗派」不但违背传统照搬了洋人的字母形式，而且违背传统照搬了洋人的汉字注音。前文说过，翟利斯的《华英字典》的汉字注音多是满州皇室贵族的语音——Mandarin，是尖团合流的形式。「国罗派」未曾对北京人的语音作认真详细的调查，就把《华英字典》的尖团合流的注音形式，搬进了「国语罗马字」。\n\n**3、汉语语音知识的缺陷**\n\n1923 年崛起的 以黎锦熙和赵元任为核心的十来位「国罗派」学者，大多是刚过「而立」之年的江南方言区的中年人，大多是欧美留学生。通晓欧文，懂些现代语言学的新知识，成为他们叱咤风云，傲视老音派、否定「老国音」的资本，而对中国历史语言学和音韵学的研究，除钱玄同、黎锦熙有些成绩之外，大多处于起步阶段，还没有什么建树。他们又都是来自江南方言区，在北京生活的时间又不长，既未曾做过较为全面的北方话的语音调查，又未曾做过较为全面的北京音的调查，都还不是老练成熟的学术大家。就是被学界誉为「现代汉语之父」的「国语罗马字」首席缔造者赵元任先生，虽然在「语音方面有异常的天赋」，但毕竟是初出茅庐之人。赵元任于 1910 年（不满十八岁）到美国去留学，主攻数学，1914 年毕业后又继续留美深造，主攻物理学和哲学。1918 年获得哲学博士学位后，就留在美国任教，先后任物理学、哲学的讲师和教授，直到 1924 年才回国工作。1923 年的赵元任先生，虽然有统一国语和实现汉字拉丁化的激情，但是既未曾潜心研究过汉语音韵学，又未曾做过较为全面的包括北京音在内的汉语方言的调查，怎能是通晓汉语的老练成熟的学术大家呢？不隐晦的说，他对民族共同语标准音的裁定带有一定程度的盲目性和片面性。一如前面谈到的舌面音 j q x，凡是研究过汉语音韵学的都会知道，它是见系舌根音齐撮呼的读音，是从舌根音 g k h 里腭化出来的，在寻不到表示它们的恰当字母的时候，用舌根音的齐撮呼来变读是最合理的，瞿秋白的「北方话拉丁新文字」的这种表示法得到学界的普遍认可。而赵元任的「国语罗马字」里用翘舌音的齐撮呼来变读，就不符合汉语声纽分化的规律。再如尖团音的取舍，当时分尖团的人群在全国各地方言特别是在大北方话中占有多大的比例？尖团合流的语音是北京人的一部分还是全体北京人？是尖团合流代表了民族共同语发展的方向还是分尖团代表了民族共同语发展的方向？要弄清这些问题，如果没有对历史语言学的全面深入的研究，没有大规模的方言调查的资料，没有北方话社区语言学者的共同讨论，是不能轻易下结论的。以章炳麟、黄侃等为代表的老派学术大家历来主张分尖团，以张一麟、蔡元培、鲁迅、陈望道、瞿秋白等为代表的新派学者也主张分尖团，就是赵元任本人也赞成过「老国音」的分尖团，这些都能说明尖音不当砍。赵元任先生在 1922 年还积极热情的宣传分尖团的「老国音」，而 1923 年就转而赞成黎锦熙的尖团合流，也说明他的学术观点当时还不够成熟。年轻激进的江南「国罗派」主观武断的砍掉具有全民代表性的语音成分——尖音，并不代表他们「在语音方面有异常的天赋」，掌握了汉语语音发展的规律，只能说明他们对民族语音的了解还不够全面，不够深入。\n\n**4、激进的时代偏见**\n\n1923 年「国语罗马字」狂热的时代，正是「新文化」运动的高潮时代，也是提倡大众语的时代。在这个激进的时代潮流中，新派学者一致认为，要启开民智就必须普及文化，要普及文化，就必须让传乘文化的汉语和汉字得到简化。汉字的简化就必须废除汉字实现拼音化，汉语的简化就必须砍掉「老国音」里的尖音、iai 音、舌面鼻音等语音成分。把拼音化看成是汉字改革的唯一出路，把语音简化看成是「国语统一」和普及文化的先决条件，既是「国罗派」学者的偏见，也是激进的时代偏见。时代偏见一但形成，就不容易纠正，就必须等待时间，等到科学发展了，认识提高了，这种偏见才有可能得到纠正。「国罗派」的「汉字落后」、「汉字必亡」、「汉字必须拉丁化」的文改观点，是时代偏见。这种偏见统治了中国语文学界八十余年，直到袁晓园、徐德江的《汉字文化》问世、国家《语言文字法》公布，才将要退出历史舞台。「国罗派」的语音简化的观点也是时代的偏见，这种偏见虽然仍占着统治地位，但它也必将随着「国语罗马字」的消亡而消亡。新千年以来觉察醒悟的仁人志士越来越多了，纠此偏差已经为时不远了。\n\n5、「国罗派」的方言偏见\n\n1923 年形成的国罗派（新音派），没有汉语发源地——中原地区的学者，也没有黄河流域的学者，几乎是青一色的江南学者。众所周知，汉语的南北方言是有差异的。以洛阳音为代表的中原地区的语音，是汉语的基础语音，是所有汉语方言、次方言的「祖音」。五千年来，中原语音的发展和完善一直走在各地方言的前面。中古前期中原语音从端、精两系声纽里分化出「舌上音」和「正齿音」（现代合为舌尖后音 zh ch sh）。中古后期（学界多认为是近代）又从见系声纽里分化出舌面 - 中腭音 j q x；从精系声纽里分化出舌叶 - 龈后音（尖音的声母）zi ci si。这样，汉语北方话里就增加了三组塞擦音和擦音，形成了口腔内的六组声母。这六组声母在《康熙字典》卷首的《字母切韵要法》的《十二摄韵首法》的六字诀里表现得很清楚，如：「岗张江将良穰」六个字就代表了从舌根到舌尖的六组声母：「岗」代表舌根音 g k h；「张」代表「舌上音」（舌尖后音）zh ch sh；「江」代表舌面音 j q x；「将」代表舌叶音（尖音声母）zi ci si；「良」代表舌尖中音 d t n l；「穰」代表舌尖音 z c s [z]（那时「日」母的音值近似舌尖浊塞音[z]）。但是，在长江以南的各个方言区内，声纽的分化比较慢（长城以北也是这样），中古以来分化出来的三组塞擦音和擦音——翘舌音 zh ch sh、舌面音 j q x、舌叶音 zi ci si，有的缺一组，有的缺两组，有的甚至三组全缺，象闽语那样，仍保持上古十五音。由于江南各地三组塞擦音和擦音不齐全，有的 g k h 与 j q x 不分，zh ch sh 与 z c s 不分，还有的 j q x 与 zh ch sh 不分，j q x 与 z c s 不分，z c s 和 zi ci si 不分，较为普遍的是 j q x 与 zi ci si 不分，即没有现代意义上的尖团音的对立（北部吴语区例外）。江南「国罗派」学者，特别是主张语音简化的轴心人物黎锦熙先生，自身有这种声母不全的语音缺陷，对分尖团的语音不敏感，反映迟钝，所以他们觉察不到北京人也有分尖团的语音；同样的原因，也使他们对汉语语音的发展方向认识不清楚，没有认识到分尖团是汉语语音发展的方向，没有认识到各地方言或早或晚都要向中原「祖音」靠拢，而盲目地把满大人的尖团合流当做汉语语音发展的方向。所以，他们不赞成标准音的声母系统太复杂，尤其不赞成分尖团。\n\n由于以上五个方面的原因，再加上北京人的语音分歧，就促成了江南「国罗派」合并尖团音意见的形成。所以，在 1923 年「国罗派」学者占了统治地位的「国语统一筹备会」的第五次常年会议上，在作出议定「国语罗马字拼音法式」决议的同时，作出了修改「老国音」，简化语音，合并尖团的决定。\n\n---\n\n## 伍、关于尖、团音的激烈争斗\n\n民族共同语标准音里是否应当分尖团是「新」、「老」国音派争论的焦点，从 1923 年「国语统一筹备会」的第五次常年会议到 1955 年「现代汉语规范问题学术会议」的三十二年中，新、老国音派在尖团音上经历了三次激烈的争斗。其争\n斗情况如下：\n\n一、二十世纪二十年代的争斗\n\n「国罗派」学者简化语音、合并尖团的提议虽然被「国语同一筹备会」通过，但遭到了以章炳麟为代表的许多学术大家的强烈反对，因此，用「新国音」注音的字书迟迟未能公布。1925 年，国罗派的核心人物钱玄同、黎锦熙、赵元任、林语堂、汪怡、刘复等六人组成了「数人会」，于 1926 年 9 月议定出了尖团合流的「国语罗马字拼音法式」。他们一不征求各界的意见 ，二不召开全国性的学术会议讨论，11 月就以「国语统一筹备会」的名义匆匆忙忙地予以公布，并在布告中说：「此后增修《国音字典》，即以校订之国语标准音拼成罗马字，添记于《注音字母》之后，教育、交通、工商各界，如遇需用罗马字时，即以此种拼音法式为标准，以昭划一而便通行」。从其公布之速，从其布告内容的武断，足见其当时的「国语统一筹备会」已经成了「国罗派」的一言堂，「国语罗马字」已被「国罗派」强行定为《国音字母》第二式了。「国罗派」学者为了增强「国罗」的法定地位，进一步压倒「老音派」，于 1928 年 9 月，又促请刚刚成立的南京症苦大学院（教育部）公布「国罗」。对新、老学术观点一贯「兼容并包」的南京大学院院长蔡元培先生在「国罗派」的再三促请下和「汉字拉丁化」左倾思潮的推动下，被动地公布了「国罗」为《国音字母》第二式。「国罗」一经大学院（教育部）公布，就算取得了法定地位。这样，「国罗派」便通过「国语罗马字」将分尖团的「老国音」改造成为尖团合流的「新国音」，于 1932 年以教育部法定语音的名义公布了尖团合流的「国语常用字汇」，形成了法定语音尖团合流的既成事实。\n\n二、二十世纪三十年代的争斗\n\n坚持北方话大众语音的「老音派」，坚决抵制尖团合流的「国语罗马字」。为了适应拉丁化的时代，为了坚持分尖团的民族语音，瞿秋白等 CCP 人代表「老音派」的意见于「国罗」公布的第二年——1929 年创立了分尖团的「北方话拉丁化新文字」与「国罗」抗衡。这对在国民党症苦教育部当权的「国罗派」来说，无异于太岁头上动土。当 1934 年中国知识界热烈宣传「北拉」的时候，国罗派学者为了维护「国罗」的法定地位，更是为了维护自身既得的名誉和地位，便极力诋毁「北拉」，攻击「北拉」的分尖团是「国语不同一主义」，认定「他们那一套‘拉丁化的中国字母’是绝对的不使用」，断言「新文字只有一种‘国语罗马字’」（见黎锦熙《国语‘不’同一主义》1934 年北京《文化与教育旬刊》第二十一期）。以黎锦熙为轴心的「国罗派」学者不但大搞关门主义和宗派主义，「甚至还常常不是争论学术问题而是掺杂着政治和党派问题」（见吴玉章的讲话）。1934 年，正当国民党反苏剿共登峰造极的时候，黎锦熙发表《国语运动史纲》，污蔑「北拉」是「苏联人越俎代庖」，以激起国民党症苦对「北拉」的仇视。他们不惜借助国民党「白色恐怖」的行政手段来封锁禁止「北拉」，欲置「北拉」于死地，欲置「北拉」的创始人于死地，成为毛泽东怒斥的反对「北拉」的「新老顽固党」（见 1936 年 9 月 22 日毛泽东写给蔡元培的信）的死硬势力。\n\n尽管「北拉」遭到国民党症苦的封禁和「国罗派」权威学者的恶毒攻击和拼死抵制，但它却深受国人的欢迎，很快传遍了神州大地。1934 年，就得到了鲁迅、陶行之、陈望道、张一麟等全国各界上千名知名人士以及 CCP 领导人的拥护和倡导；1935 年，文化界人士蔡元培、鲁迅、郭沫若、茅盾等 688 人又提出《我们对于推行新文字的意见》，要求国民党症苦推行「北拉」新文字。特别值得注意的是在担任北洋症苦「读音统一会」会长时一再强调「国音应以北京音为准」的张一麟先生和担任过南京症苦大学院院长公布过「国罗」的蔡元培先生积极热情地支持了分尖团的「北拉」。与此相反，尖团合流的「国罗」虽然获得了「法定」地位，却一直坐在「冷板凳」上无人理睬，用赵元任先生的话说「国语罗马字推行的成绩等于零」。「北位」取代「国罗」已成为众望所归。但「国罗」派学者坚持关门主义和宗派主义，拒不采纳「北拉」分尖团的正确主张，利用已获得的南京症苦教育部「国语统一筹备委员会」的种种职权，一意孤行地推行尖团合流的「国罗」音系——「新国音」，不单把分尖团的《国音字典》修改为不分尖团的《国语词典》，把全国的各种字典都该为尖团合流的注音形式，还通令全国的国民学校都必须教学尖团合流的「新国音」。就是在 1938 年国民党症苦迫于舆论宣布了「北拉解冻」之后，教育部当权的「国罗派」仍然是我行我素地抵制「北拉」，一如既往的地推行尖团合流。\n\n三、二十世纪五十年代的争斗\n\n新中国成立后，在国民症苦时期被禁止的「北拉」得到了较为广泛的传播和应用。北拉新文字不但应用于东北铁路电报和海军的手旗、灯号、无线电通信，而且应用于一些课本和字典的注音、速记、索引以及外国人学习汉语方面。北拉新文字书刊的销售量猛增，单是一部用新文字注音的《四角号码新词典》，从 1950 年 8 月到 1955 年 7 月就出了 42 版，25 万多册。「北拉」事实上已取代了「国罗」，成为注音字母的第二式。「北拉」的受欢迎，也说明全国的广大知识界是赞成分尖团的，特别是以口舌为业的说唱家更赞成分尖团。各种戏曲界，特别是京剧界，都「讲究尖团音的区别」，因为他们是从事「耳治语言」的实际家，需要用口舌去影响听众，生怕吐字不清晰，而不象那些主要从事「目治语言」的学者，舞文弄墨写写则可。建国初期的种种情势表明，纠正「国罗」的语音偏差，在共同语里恢复尖团音的区别是大有可能的。但是，新中国的语言文字机关，很快又被「国罗」派学者所掌握。新中国刚一成立，「国罗」顽固派的轴心人物、「北拉」的死敌黎锦熙先生就当上了中国文字改革协会的付主席兼拼音方案研究委员会的付主任。不久，和「国罗」派同气相求尖团不分的满族学者罗常培又当上了中国语言研究所的所长。国罗派学者在新中国的语言文字部门又占了优势，一步步掌握了「规范」语言的裁决权。从建国初到 1955 年「现代汉语规范化学术会议」之前，有些学者提出了重新分尖团的意见，有些学者设计了分尖团的拼音方案，但都被他们否定了，就是 1952 年 10 月中国文字改革委员会拼音方案组通过的方案，因其有 24 个声母、分尖团，也未逃脱被否定的命运。1955 年，汉语拼音方案的制订到了关键时刻，尖团音的争论也到了白热化的程度。要解决民族共同语里要 不要分尖团的问题，就必须对官话区的尖团音做一番调查。而「尖团合流」早已成了「国罗顽固派」的定势思维，他们为了压服主张区别尖团音的学者，达到尖团合流的目的，就预谋策划了一次「函调尖团音」来欺骗视听。要认识「函调尖团音」的欺骗性，就必须从函调的方法、对象、结论和后果几个方面来分析：\n\n1、「函调尖团音」方法和对象的荒唐\n为了了解官话区方言中分不分尖团的情况以确定汉语拼音方案是否应当分尖团，中国社会科学院语言研究所在 1955 年七、八月间做了一次通信调查，以县市作为调查单位，共对官话区的 1279 个县进行了调查。每县市发一封信，请当地文教科（或局）找生长在县城的人填调查表。调查表上有两对尖音字：前和钱、秀和绣；两对团音 字：气和器、机和基；二十对一尖一团的字：精和经、酒和九、清和轻等。把这二十四对字交互混杂地列在表上，如果填表的人认为两个字同音，就请他在中间画个等号（＝），如果认为两个字不同音，就请他在中间画个差号（×）。这样来调查尖团音从表面上看似乎是认真的、合理的、公正的，但若把当时的语音现状作点分析，就会发现这是有史以来语音调查的最荒唐的一幕。\n\n众所周知，早在 1923 年「国罗派」控制的「国语统一筹备会」第五次常年会议上就作出了取消尖音的决定，1926 年「国语罗马字」出台以后，就否定了分尖团的「老国音」，推行「尖团合流」的「新国音」，废弃了分尖团的《国音字典》，公布了尖团合流的「国语常用字汇」和《国语词典》。三十多年来，「国罗派」一直在教育部当权，出版的一切教科书和一切字典、词典的汉字注音都不分尖团，所有学校的教师都必须教尖团合流的「国语」。凡是在官办学校里读书的学生，学的都是尖团不分的「新国音」，特别是师范的学生和老师，都受到了「国语标准音」的培训，如果让他们填表，绝不能反映方言的实际。想要真正了解各地方言分尖团的情况，就应该选择三十年来未受「国语标准音」影响的人——没上过学的文盲或者只读过私塾，没上过学堂的老书生。这一点推行了三十年「国语」的以黎锦熙为首的国罗派学者定然很清楚。正因为清楚，他们才故意选择「函调」这种不能得到尖团音实际情况的方法。为什么说「函调」不能得到尖团音实际情况呢？原因有二：其一，因为是函调，就必须找知识分子填表，这就排斥了能反映尖团音实际情况的普通老百姓，因为他们大都是文盲和半文盲，填表绝对找不着他们。其二，让教育部门找县城驻地的知识分子填表，他们又启发引导去找师范的学生和老师，这又排斥了能反映尖团音实际情况的老派知识分子。据笔者的调查，当年所找的填表的人大多是县市驻地的师范学生和老师。这些受尖团合流的「国语标准音」培训的学生和老师，大多认为区别尖团音是方言土语，而按照字典的标音填了表。这样一来，就把许多原本分尖团的方言错报成不分尖团的方言。这有事实例子可作证明：\n\n笔者的家乡是山东省临沂地区，原本是分尖团的方言，而当年填表的是临沂师范的学生，他就依赖字典的标音填表，把临沂县原本分尖团的方言填成了不分尖团的方言。不单 1955 年的函调是这样，1957 年的方言调查也是这样。受过「普通话语音研究班」培训的方言调查员冯晓先生（笔者的老师，历任苍山一中教导主任、党委书记，现已退休），在调查临沂各县的方言时，也是受指导者的启发，选择了临沂师范的学生为调查对象，结果把临沂、苍山等许多原本分尖团的县都错填成不分尖团的县。又因为方言调查员冯老先生自幼在官办学堂里上学，学的是尖团合流的「新国音」，虽出生在分尖团的方言区，但本人口语中已不分尖团，对分尖团的语音不敏感。他虽然一直在分尖团的临沂和苍山任教，但却从来没有觉察到临沂和苍山分尖团，一直认为自己报告得很正确。他在苍山一中工作了二十年以后，才发现自己的调查报告全错了（笔者亲自走访了这位调查员）。像临沂和苍山这样的颠倒事实的填表，是 55 年函调尖团音的特例吗？不是，这种现象非常普遍，是各地填表的缩影。\n\n2、「函调尖团音」结论的荒谬\n根据一千二百多封回信，整理出尖团音调查统计表，算出了官话区域分尖团和不分尖团的百分比。分尖团的百分比如下：黑龙江 0%、内蒙 0%、吉林 2.6%、辽宁 2.2%、河北 35%、山东 50.4%、河南 53.2%、山西 4.5%、陕西 39.8%、甘肃 14.7%、四川 3.9%、青海 0%、云南 7.5%、贵州 1.7%、湖北 5.6%、安徽 0%、江苏 6.8%、广西 84%。总计官话区域分尖团的占 20.3%，不分尖团的占 79.7%。这次「函调尖团音」从表面上看似乎是认真的、合理的、公正的，调查数据是真实可靠的，但实际上，这个调查数据是极不真实的，分尖团和不分尖团的比例是完全颠倒的。笔者多年的调查发现，除了广西省的调查数据（分尖团的占 84%）较为接近实际之外，其余各省都不附和实际。下面仅对山东、河南、河北、安徽四省的尖团音情况做些分析：\n\n一如山东省。近代人都承认，分尖团是「山东侉子」的语音特点，就连瞿秋白的「北拉新文字」的分尖团也被学界普遍地认为是依据的山东音，谁能相信 49.6% 的山东人不分尖团呢？笔者到过山东的许多地方，接触过本省许多县市的人。在笔者调查的几十个所谓「不分尖团」的县市里，几乎都找到了分尖团的人证，就是学界反复调查结论的不分尖团音的济南和潍坊也不例外。笔者除了走访调查和收听山东电视广播之外，还收集各县的影谍、唱片，在那些所谓「不分尖团」的县市里的戏曲演唱者（京剧、吕剧、梆子、柳子、四合、柳琴等等）和歌曲演唱者的行列里，分尖团的人占了绝对多数，完全尖团合流的老年戏曲名家和说唱名家实为罕见。可以肯定地说，山东分尖团的县市只占 50.4% 函调数据是绝对不真实的。\n\n二如河南省。河南省绝大部分地区属于古老的中原地区，既是民族文化的发源地，也是民族共同语的发源地。这里的声韵系统最完整，中古后分化出来的三组塞擦音和擦音（翘舌音 zh ch sh、舌面音 j q x、舌叶音 zi ci si）一组也不缺。这里分尖团的县市至少在 95% 以上，这一点只要是敢说真话的人谁都会承认。《辞源》里有「唯河南口音尖团最分明」的字句，《中文大辞典》里也有「惟河南语尖团最清晰」的陈述，而在河南的函调表上却出现了 51 个县市不分尖团，几乎占了河南省的一半。笔者赴河南实地的调查发现，这是绝对不真实的，因为在这些所谓「不分尖团」的县市里，随处听到分尖团的语音，不但许多老年人分尖团，而且有许多没有文化和文化水平较低的中青年人也能分尖团。你如果无暇去调查，听听这些县市的地方戏就能觉察到。河南是豫剧、曲剧的故乡，在上个世纪五、六十年代的时候，几乎每个县市都有豫剧团或曲剧团，许多老演员还健在。你听听那些所谓的「不分尖团」的县市的戏曲老演员的发音，有几个是不分尖团的呢？笔者已购得了从豫东到豫西，从豫南到豫北，几十个县市的戏曲影碟，没发现一个剧组的全部演员是尖团合流的，凡是老年名家的唱段都是分尖团的。河南 51 县不分尖团的函调数据是绝对不可信的。\n\n三如河北省。1955 年的函调表上，分尖团的县市仅有 50 个，1957 年的方言调查，分尖团的县市就增加到 58 个，2003 年河北师院语言学系黄卫静等硕士生仅对保定市以南的县市作调查，就发现了有 61 个县市分尖团。更有意思的是黄卫静女士在《河北方言的尖团音分混问题研究》一文中指出：「我们发现在不分尖团的地区，几乎所有方言点都不约而同的保留了全、泉、俊、黢、旋、宣、选等几个字的尖音。」这个调查结果发人深思：在推普已近半个世纪的今天，分尖团的方言点不但没减少反而大量增加了，这说明了什么？在不分尖团的地区都不约而同的保留了部分字的尖音，这又说明了什么？1955 年的函调表上保定市以北没有一个分尖团的县市，但是笔者在廊房和香河等县寻到了许多分尖团的人。尤其是河北评剧老演员，几乎都能分尖团，不论是中国评剧院演出的《花为媒》的角色新凤霞、李忆兰、赵连喜、赵丽荣，还是锦州评剧院演出的《凤还巢》的角色刘辉、黄静波、刘红、武翠红，他们都分尖团音。他们大多是保定市以北的人，怎么能说保定市以北都不分尖团呢？河北仅有 35% 的县市分尖团的函调数据也是绝对不可信的。\n\n四如安徽省，「函调表」上安徽全省各县都是不分尖团的，分尖团的县市为 0。而实际上安徽多数县市是分尖团的。笔者虽未去安徽作实地调查，间接调查也能发现。首先从地方戏曲上能够听见：一如黄梅戏，上个世纪五十年代拍成电影的《天仙配》、《女驸马》等戏中王少舫、严凤英、潘景丽、陈文明、田玉莲、王鲁明等等绝大多数演员是分尖团。《女驸马》CCP 有九个角色，在他们的唱段中只有张云凤（饰黄帝）分尖团不够明显，其他角色的唱段都明显的分尖团。即使是普通话已经普及了的今天，众多的黄梅戏的新秀仍然分尖团，诸如蒋建国、吴亚玲、黄新德、潘雪萍、张辉、扬敏、刘华、李文、李龙斌等不胜枚举。安徽文化音像出版社发行了一套《黄梅戏经典》的影牒，共有十六位名家的唱段，除了韩再芬、赵纯刚是「女国音」（全尖音）之外，其他人仅有少数尖团音混杂现象，大多是分尖团的。又不止黄梅戏的演员至今分尖团，安徽各地的各种地方戏曲、说唱，其演员也仍然大多数分尖团，如最近几年安徽音像出版社出版的影碟：柳琴戏《赵美荣戏嫂》、《小姨戏姐夫》、《憨子闹事》、《老少换妻》、《三千里寻母记》；泗州戏《兄妹哭爹娘》；梆子戏《吴汉杀妻》、《李天保吊孝》；淮海戏《皮秀英四告》；大鼓书《罗通扫北》；民间小调《卖饺子》、《跑四川》…… 举不胜举。从新闻媒体里也可以听到该省的涡阳、阳\n\n表二、现代汉语的尖团合流表（尖团音辩音字表）\n\n等县市众多的群众分尖团。难道说安徽这些多如繁星的分尖团的人是从天上掉下来的吗？你真的相信安徽省没有分尖团的语音吗？硬说安徽没有尖团音的学者究竟是听觉迟钝呢，还是别有用心呢？\n要把各省的情况都列举出来实在太繁琐，就凭这四省情况的分析也可窥豹一斑。这些事实都说明 55 年函调尖团音不能反应方言的实际，完全颠倒了分尖团和不分尖团的比例数据。其原因就在于填表人大多是接受了「新国音」的知识分子，按字典的「标准音」填的表。\n\n3、「函调尖团音」后果的荒唐\n函调得到的官话区域分尖团的占 20.3%，不分尖团的占 79.7% 统计数据，尽管不切合实际，但是这个脱离实际的黑白颠倒的统计数据却成了「国罗顽固派」压服「老音派」或「北拉」派的「上方宝剑」。他们把「函调」统计表在 1955 年 10 月召开的「现代汉语规范问题学术会议」上广为散发，大事渲染，用这个「分尖团的方言占少数」的「事实」，来否定分尖团的意见。在这个统计数据面前，别说是一般的学者不能在坚持分尖团的意见，就是「北拉」派的权威人士吴玉璋先生也不得不放弃分尖团的意见。坚持尖团合流的「国罗派」利用「函调」打倒了「老音派」，扫清了尖团合流的障碍，于是国罗顽固派的轴心人物黎锦熙先生及其门派弟子王力先生等就可以按照他们的既定方针拟定和修改《汉语拼音方案》了，就可以在《汉语拼音方案》里搞尖团合流了。尖团合流的《汉语拼音方案》一经通过，尖团合流就被称之为普通话的「标准音」，区别尖团音就被称之为「方言」或「古音」；合并了尖团音的汉语，就称之为「现代汉语」，区别尖团音的汉语就称之为「古代汉语」。他们不但给尖团合流涂上了「现代汉语」、「标准音」的时髦而亮丽的色彩，而且加上了「方案组」、「文改会」、「语研所」、「国务院」、「人大」等国家政权机关的法定保护伞，真可谓「固若金汤」了。综观 1955 年「函调尖团音」的方法、结论和后果，不难看出，这次「函调」是坚持尖团合流的「国罗」顽固派学者欺骗视听的手段，是事先预谋的圈套。\n\n自 1923 年「国罗派」提出简化语音、合并尖团的方案到 1958 年《汉语拼音方案》的公布，经过了以上三个阶段的激烈争斗，「国罗派」终于战胜「老音派」获得了胜利。「胜者为王败为寇」，「国罗派」学者成了天下独尊的学术大家、语言学权威，甚至被尊奉为「现代汉语之父」。他们掌握了新中国语言文字的各种大权，就可以畅行无阻地打起「现代汉语」，「规范化」、「标准音」的金子招牌简化语音、合并尖团了。\n\n---\n\n## 陆、分尖团和尖团合流的注音形式\n\n所谓尖团合流，就是把尖音字改为团音，就是把精系齐撮呼的读音改为见系齐撮呼的读音，或者说是把尖音字的声母由原来的 z c s 改为 j q x，如尖千先三字原属精系舌尖音，本应为 zian cian s5ian，而尖团合流后就改为 jian qian xian，归并到见系舌面音里去了。为了弄清传统语音的分尖团和「国罗派」的尖团合流在\n注音形式的改变，下面列出两表作以对比：\n\n表一、传统的切音、「老国音」、邮政式拼音、北方话拉丁新文字、国语罗马字、现代汉语在尖音字（积妻西）和团音字（基期希）注音形式上的对比：\n\n表二、现代汉语的尖团合流表（尖团音辩音字表）\n\n---\n\n## 柒、「国罗派」学者根除尖音的学术手段\n\n「国罗派」学者凭借函调尖团音的荒唐数据，第三次否定了老音派分尖团的主张，在「现代汉语」（普通话）里砍掉了尖音，合并了尖团。为了根除尖音，防止尖音「复辟」，就从舌尖音 z c s 的发音部位和拼写方法上作文章。对其砍尖音的学术手段剖析如下：\n\n一、改变 z c s 的发音部位\n「国罗派」学者为了根除尖音，不惜曲解发音学，改变 z c s 的发音部位。汉语 z c s 的发音部位，本来是舌尖抵下齿背，舌叶前沿抵上齿龈成阻发音。这个发音部位既可以用活生生的现代人语音来验证，又可以从语言学资料里找证明。一如解放前出版的《最新学生字典》的「注音符号说明」：「ㄗ 读音滋，舌尖下着齿龈塞擦不送气」（举ㄗ以代表ㄘㄙ ，以下同）；再如 1955 年前出版的带有「北拉新文字」的《四角号码新词典》的「注音符号发音法」：「ㄗ 发音时舌叶抵住上齿龈……」。这两部字典都明确指出ㄗㄘㄙ（z c s）是舌尖抵下齿背（含齿龈），是舌尖稍后的舌叶与上齿龈成阻发音的尖后 - 齿龈音。 而《汉语拼音方案》公布后，z c s 的发音部位就改为舌尖抵上齿背，如 1959 年出版的《学生小字典》的「拼音字母（附注音字母）发音法」：「z （ㄗ）舌尖向前伸，抵住上门牙背后，然后微微放松……」朱川先生又作了更详细的描述：「在 z 组发音时，z c s 都存在横向凹槽（指舌面），所以舌尖都是往上翘起的」。舌尖微垂抵下齿背发音的 z c s 能自然和谐地与齐撮呼韵母拼出尖音音节，而舌尖上翘抵上齿背发音的 z c s 就难以与齐撮呼韵母相拼，即使勉强相拼，也只能拼出尖锐刺耳的带儿化音味的尖音。「国罗派」学者改变 z c s 发音部位的目的，就是让人们无法拼出尖音。这是根绝尖音的手段之一。\n\n「国罗派」学者为了根除尖音，擅自改变了 z c s 的发音部位，使 z c s 的发音违背了民族性、科学性和大众性。说其违背民族性，是因为 z c s 三个声母是由传统声纽精清心变来的，传统声纽精清心能与齐撮呼韵母相拼的特点足以证明其发音是舌尖微垂抵下齿背。舌尖上翘抵上齿背发音是东北满语的特点，与传统的汉语不协调。说其违背科学性，是因为舌尖抵下齿背发音比舌尖抵上齿背发音简捷省力。因为人在不发音时候的自然舌位是舌尖触及下齿背，又因为汉语的 a o e i u <六个元音的发音，甚至除了 er 韵母之外的所有韵母的发音，舌尖都是触及下齿背的，所以舌尖抵下齿背发 z c s 的音节，就简捷省力，自然顺当；如果让舌尖抵上齿背发 z c s 的音节，发音时舌尖有个上翘过程，发音后又有个恢复到自然舌位的过程，费时费力，很不经济，而且还会给无上齿和上齿露风的人带来不便，这是违背了科学性。说其违背大众性，是因为所有汉语社区的人们，不论是方言群体还是普通话群体，90% 以上的人们 z c s 的音节都是舌尖抵下齿背，只有少数东北老年人、「国罗派」语言学者和少数死记「标准音」发音要领的学生，才去用舌尖抵上齿背发音，这是违背了大众性。虽然舌尖抵上齿背也能发出 z c s 的近似音来，听觉上没有多大的差别，但「失之毫厘，谬以千里」，如果仔细对比两种发音舌位，就会感到舌尖抵上齿背发音与大众语音极不协调。由舌尖抵下齿背改为舌尖抵上齿背，完全违背了民族语音的传统性、科学性和大众性。\n\n二、改变了舌尖音 z c s 的拼写规则\n「国罗派」学者为了根除尖音，不仅改变了 z c s 的发音部位，还改变了 z c s 的拼写规则。众所周知，汉语拼音的 z c s 是从「北拉」里移植来的，《汉语拼音方案》的前身就是「北拉」。将「北拉」的字母符号和拼写规则稍加改造，割掉「北拉」分尖团的灵魂，就变成了《汉语拼音方案》。例如，「北拉」的 z c s 读为洪音资雌私，zi ci si 读为细音（尖音）绩七西，而《汉语拼音方案》规定，z c s 不与齐撮呼韵母 i <相拼，规定 zi ci si 是「整体认读音节」，读为资雌私。这样一来，凡是学过汉语拼音的学生，谁也不会把 zi ci si 读为尖音绩七西了。不单一般学子不会发尖音，就是单纯凭借音标符号研究语言学的人也难于发尖音，因为音标的尖音符号是 [tsi tsi5 si]，而[tsi tsi5 si] 又和汉语拼音的 zi ci si 相混淆，他们能凭借音标符号发尖音吗？显而易见，改变 z c s 的拼写规则也是「国罗派」学者根除尖音的手段。\n\n「国罗派」学者为了根除尖音硬性规定了 z c s 不与齐撮呼韵母 i <相拼，砍掉了舌叶音（尖音声母）zi ci si，这是人为地削减汉语的语音成分，减少汉语的音素和音位，让汉语的音位少于印欧语系的音位。自我戕害了民族语音而不自知，令人可恨又可悲！\n\n三、隐瞒北京人的语音分歧，曲解「女国音」\n因为现代汉语（普通话）是「以北京音为标准音」的，「国罗派」学者为了维护尖团合流的既定方针，就矢口否认北京人的语音分歧，死死地肯定「北京音里无尖音」，绝不承认北京人能够分尖团。其实，受满州旗人语音影响轻的北京人不但有尖音，而且分尖团（详见本文第叁部分「北京人的语音分歧」）。「国罗派」自 1923 年作出了取消尖音的决议之后，就一直采取自欺欺人的做法，不但掩盖北京人的语音分歧而且曲解北京人的尖音。例如「国罗派」元老黎锦熙先生，在上个世纪的二十年代虽然觉察到北京人有尖音，但却说是北京的女学生特有的语音现象，是北京女性群体语音的变异，把北京人的尖音叫做「女国音」。黎锦熙先生把北京人的尖音归咎于女学生，归咎于女性群体语音的变异，这种标新立异的观点便成为「国罗派」学者的表率。1940 年赵元任、罗常培、李方桂诸先生在翻译高本汉的《中国音韵学研究》时，就「女国音」现象说「北平女中学生近年有全用齿音的风气，几成一种有性别的语音了。」黎锦熙先生的女学生的「女国音」和赵元任先生的女学生的「性别语音」，居然成了北京人尖音的代名词，「女学生」成了北京人尖音的「发源地」，现代学者无不随声附和。诸如徐世荣先生的《普通话和北京土音的界限》、曹耘先生的《北京话 j 组声母的前化现象》、林涛先生的《普通话和北京音》、胡明扬先生的《北京话「女国音」调查》等宏论，都是异曲同工，万变不离其宗，有的说这是北京女孩子特有的语音现象，有的说这是北京家庭妇女的群体语音变异现象，有的说来自部分北京人的「土语」，有的说来自部分女性追求时尚在「装嗲」，还有的说是北京青年人故意模仿南方人的语音…… 说法上虽然花样翻新，但其底韵未变。谈到「女国音」的音值，大多是含糊其词，一般不是直截了当的指出其声母就是 zi ci si。曹耘先生只说是舌面音声母 j q x 的发音部位前移，近似于 z c s ；沈炯教授俨然以学术大家的口气说：「普通话里没有女国音的地位」，「女国音未必就是 z c s 那么简单。」…… 为了给尖团合流的错误做法辩护，「国罗派」学者及其门派传人极力曲解「女国音」。为了还历史的本来面目，特对「女国音」的意义、来源和发音部位作番分析：\n\n北京「女国音」的音值是什么呢？北京「女国音」就是传统的尖音——精系齐撮呼的读音。其声母就是舌叶 - 龈后音 zi ci si，这是从精系舌尖音 z c s 中分化出来的一组独立的音位，它的音值既不等于 z c s，也不等于 j q x。传统的精系齿头音精清心——舌尖抵下齿背发音的 z c s 在和齐撮呼韵母 i <相拼时，受 i <的牵动而发音部位后移，成阻点由尖后 - 齿龈移到舌叶 - 齿龈后（硬腭的最前部），形成一组独立的尖音音位（这里应当强调的是，精系发音部位的后移绝不是现代学者所说的「移到舌面，变为舌面音 j q x」）。这和见系舌根音分化为 g k h 和 j q x 两组声母是同样的道理。从 z c s 里分化出来的 zi ci si 这组尖音音位，明明白白地出现在清代和现代的许多字书、韵书和拼音方案上。1716 年问世的《康熙字典》的《字母切韵要法》里有「精系正韵」、「精系副韵」、「见系副韵」三套声母的对立；1810 年问世的描写北京音的《正音撮要》里有「正口尖音」、「撇口尖音」、「小卷唇音」三套声母的对立；1905 年的「邮政式拼音方案」、1913 年的「老国音」、1931 年的「北拉新文字」都有这三套声母的对立。舌叶 - 龈后音 zi ci si 这组音位既存在于近、现代的字书中，也存在于近、现代北方话的大众语音中，它既是传统尖音的发音部位，也是现代「女国音」的发音部位。这组尖音音位被患有语音简化癖的「国罗派」学者砍掉之后，不敢承认北京人的尖音，就只好拐弯抹角地去解释「女国音」，简直是拿语音学开玩笑。\n\n「女国音」是怎样形成的呢？「女国音」的形成可从三个方面来分析：一是女性音质清晰，善于区别细微的语音，早在满人入关学汉语出现尖音舌面化语病的时侯，就有许多满族女子率先学会了发尖音。二是因为在整个清代女性不介入官场，受满大人尖音舌面化语音的影响较轻，能够保持分尖团的传统语音。三是推行尖团合流的「新国音」以来的北洋症苦和国民症苦时期，女子上学的少，受「新国音」的影响轻，受母亲、祖母语音的影响重，仍能发尖音、分尖团，只是在新、老「国音」的交互影响下尖团音混杂不整齐了，把部分团音字也发成尖音了。不论是黎锦熙发现的「女国音」还是赵元任发现的「性别语音」，其实都是这种不整齐的尖音偏多的尖团混杂音。以上三点，就是「女国音」真正的历史来源。\n\n「女国音」又是怎样发展的呢？自 1923 年「国罗派」学者人为地规定了尖团合流之后，就迫使尖团音向两极发展。正向发展是「尖音舌面化」，发团音；逆向发展是「团音舌尖化」，发尖音。大凡上学的人，查阅字典按拼音学字音的人，都受了尖团合流的「新国音」的影响，必然发团音；大凡不上学的人，受「新国音」的影响轻，受老辈人的传统语音（尤其是家长和传艺的师傅）影响重的人，必然会保留传统的分尖团的语音。凡是能区别尖团、发尖音的人就觉得尖音清晰悦耳，得心应口，自然而然地发尖音，但在尖团合流的长期侵蚀下，又逐渐混淆了尖音和团音的界限，把许多团音字也发成了尖音，成了尖音偏多的尖团混杂音——「女国音」。在合并尖团音的前三十年间，男子上学的多，女子上学的少，「女国音」没有形成「气候」。但在近五十年来，女孩子也都陆续上学了，她们逐渐的把尖音偏多的尖团混杂音——「女国音」带进了学校。男、女生之间相互影响，「女国音」逐渐失去了性别界限，男生发「女国音」的（如歌星蔡国庆）也越来越多了，「女国音」迅速发展了（其实「女国音」本来就没有绝对的性别界限，历来分尖团、发尖音的并不都是女孩子，受传统语音影响重的男孩子也同样发尖音、分尖团，只不过比例小些罢了）。这就是现代「女国音」发展的真正原因。\n\n分析「女国音」的音值、来源和发展，可以清清楚楚地看到，现代「女国音」的形成，既是受分尖团的传统语音的影响，也是「国罗派」尖团合流的「人造标准音」逼迫下的扭曲。因为尖音不是从天上掉下来的，而是民族语音里固有的。尖音和团音都是老祖宗世代口耳相传的语音，想消灭尖音并不那么容易。你不是要求「尖团合流」吗？你能把尖音发成团音，我也能把团音发成尖音。这里有两个个活生生的例子可作证明：一如安徽省黄梅戏剧团的著名演员王少舫和严凤英等人，在推广普通话之前演的《天仙配》里是清清楚楚分尖团的，而在推广普通话之后演的《牛郎和织女》里，不单是严凤英变成了「女国音」，就是王少舫也同样变成「女国音」——把团音字也发成尖音了。二如歌坛明星李谷一，本来能够分尖团，而在标准音胁迫下又不得不合流。她唱《妹妹找哥泪花流》一歌，起初用了全团音（见电影《小花》），而后来又用了全尖音——「女国音」（见河北音像出版社出版的歌碟《南泥湾》李谷一专集）。由此二例足以看出，现代「女国音」就是分尖团的语音在「人造标准音」胁迫下的扭曲。尖团合流如不丢失尖音 zi ci si，就得丢失团音 j q x，二者必居其一。「女国音」和「国罗派」唱对台，丢掉的不是 zi ci si，而是 j q x，真是可悲又可喜！ 发尖音的人数增加了，「标准音」受到了冲击，「法不治众」了，因此「女国音」迅速发展，全国蔓延，就连原本不分尖团的东北满蒙地区也新产生了「女国音」（尖音）。「国罗派」学者一直在隐瞒北京人的语音分歧，曲解北京「女国音」，黎锦熙和赵元任是这样，他们的门传弟子更是这样。这种隐瞒和曲解，在改革开放以前确实起作用，因为媒体落后、信息闭塞，各省各地的人很少听到北京人的声音，但现在不同了，媒体先进了，交流增加了，各省各地的人都能听到北京人的声音了。人们不但能听到北京人的尖音很普遍，还能听到为数众多的北京老年人分尖团。在隐瞒和曲解日异无力的情况下，就必须加强行政手段和语言学理论霸权，把尖团音等当成违禁的「敏感」的问题，任何刊物、任何论坛都不能说北京人有尖音，更不能说北京能区别尖团音。你要说北京人有尖团音，或者说汉语应当分尖团，你就会被戴上「历史的反动」、「给普通话制造知识混乱」、「参加了一种大合唱」、「想捞稻草」等等的大帽子，你就没有立足之地。在这种语音专政的政策下，学术界结成了「庸庸向卫的铁壳」，打顺风旗成了最高时尚。「谣传千遍成真理」，这句俗话倒成了实话了！\n\n---\n\n## 八、「国罗派」维护尖团合流的语言学谬论\n\n「国罗派」学者为了维护尖团合流的既定「标准音」，便在语言学上大做文章，编织出「尖团合流论」、「语音简化论」、「绝对京音标准论」、等一系列歪曲汉语语音发展规律的理论。对这些歪理邪说有必要逐条澄清：\n\n（一）、荒谬的「尖团合流论」\n\n「国罗派」尖团合流论的荒谬性首先表现于歪曲「普通话」，把少数人的方言说成是民族共同语——「普通话」。这在黎锦熙、赵元任的学生王力先生的代表作《汉语史稿》里最明显。《汉语史稿》121 页写道：「普通话里舌根音的舌面化，可能比舌尖音的舌面化早些，也可能是同时。在十八世纪以前，不但齐撮呼的见溪群晓匣已经变了 j q x（原文是音标符号，因不便使用，故以汉拼字母代替，以下皆然），连精清从心邪也变为 j q x 了。」这段话的大意是说：汉语普通话早在十八世纪以前就尖团合流了。王力先生这一结论的得出，其论据只是一条注释：「清无名氏作《圆音正考》，在序里说：‘试取三十六字母审之，隶见溪群晓匣五母者属团，隶精清从心邪五母者属尖’，可见当时尖团已不分。」（见《汉语史稿》124 页注释 2）。众所周知，《圆音正考》是专为纠正满洲旗人尖团不分的语病而出台的，这从序言的下一句看的出来：「爰辑斯篇，凡四十八音，为字一千六百有奇。每音各标国书（满洲人称满文为国书）一字于首，团音居前，尖音居后……」此书如果是写给汉人看的，就用不着标「国书」，因为满洲大人只要求满洲子弟学满文，从不要求汉人学满文。王力先生把满洲旗人自行纠正语病的语言割来半句作为普通话不分尖团的证据，未免捉襟见肘。为什么这么重要的结论仅用一条引用了半句话的注释作论据呢？不论是从逻辑思维上还是逻辑形式上，都显得灰白无力，态度暧昧。其实。王力先生，强说汉语普通话早在「在十八世纪以前」就尖团合流了，「连精清从心邪也变为 j q x 了」，旨在为给师门合并尖团音的既定标准辩护，他自己也觉得烫嘴心虚，因为在这句结论之后马上写道「舌根音的舌面化，所占方言区较广；舌尖音的舌面化所占方言区较小。在京剧界中，见系字被称为团音，认为应念 j q x；精系字被称为尖音，认为应念 zi ci si（原文是音标符号）」。这句话含含糊糊地告诉人们：「舌尖音的舌面化所占方言区较小」，「小」到连京剧界的北京人都不承认。众所周知，「普通话」是汉民族共同语的代名词，只有具有全民代表性的语音成分才能称得上「普通话」的语音成分，把「所占方言区较小」的连北京京剧界都不承认的尖音舌面化说成是「普通话」能站得住脚吗？「国罗派」学者把满大人尖团不分的语病说成是「普通话」，这不单是对民族共同语（普通话）的曲解，更是对民族共同语（普通话）的诬蔑！\n\n「国罗派」学者既然把尖音舌面化塞进了普通话，就必然要用发音学来阐释。王力先生在《汉语史稿》207 页上写道：「语音的演变主要是舌头的升降和前后推移…… 舌头的向前移动或向后移动，要看韵母来决定。近代 j q x（音标符号，下同）的形成是一个典型的例子。齐撮呼的 [k k5 x] 从后面来，[ts ts5 s]从前面来，汇合在舌面上，因为舌面的中部正是齐撮呼的韵头 [i y] 的发音部位，同时也正是辅音 j q x 的发音部位。」他的意思是说，齐撮呼韵头 [i y] 的发音部位在舌面，就「决定」的把和它相拼的舌根音 [k k5 x] 和舌尖音 [ts ts5 s] 都毫无例外地拉到舌面上去，变为舌面音 j q x。如果按这样的逻辑，舌尖中音 d t n l 也应该变为 j q x，因为他们也有齐撮呼。实际上，齐撮呼韵头 [i y] 虽有牵动它们前面的声母向舌面移位的功能，但不是都千篇一律的移到舌面中部变为 j q x，而是向它们适度靠近。诸如：舌根音 g k h 受它们的牵动，发音部位前移（约 3 厘米）变为舌面音 j q x（位置在舌面中部和硬腭中部）；舌尖音 z c s 受它们的牵动，发音部位后移（约 1 厘米）变为舌叶音 zi ci si（位置在舌叶和上齿龈后）；舌尖鼻音 n 受它们的牵动，发音部位后移（约 2 厘米）变为舌面鼻音（音标为拐右腿的 n）；舌边音 l 受它们的牵动，发音部位也稍微后移（对比鲁和吕的发音成阻点就能觉察）。王力先生以齐撮呼的韵头 [i y] 的发音部位在舌面为由，强说精系细音也成为舌面音 j q x，也是站不住脚的。现代学者的「尖团合流论」完全是为尖团合流的既定政策服务的理论，是脱离实际的理论，是机会主义的理论。\n\n（二）、「语音简化论」的荒谬\n\n简化语音、合并尖团，是 1923 年国语罗马字运动中，搞汉字拼音化的以黎锦熙为轴心的「国罗派」学者提出来的，认为简化语音，不但利于「国语罗马字」的设计，而且利于「国语」的普及和推广。在任何改革大潮中，一些左倾幼稚的偏见被激进派接受是司空见惯的事情，不足为奇，也无可厚非。民族共同语的语音标准的制定不可能一步到位，必须经过较长时间的讨论、修改和补充才能逐步完善。不可思议的是自 1926 年公布了尖团合流的「国语罗马字」之后，「国罗派」学者把「国罗」音系绝对化，一步步「发展了宗派主义和关门主义」，视分尖团的意见为仇敌，为了维护继定标准音，就去为「尖团合流」辩护，就去编织「语音简化论」。而「语音简化论」歪曲了语音发展的规律，使汉语语言学误入了歧途。\n\n以王力为代表的第二代「国罗派」（新音派）学者，主要从浊音清化和入声消逝两个方面论证「汉语语音简单化是语音发展的一般趋势」（见《汉语史稿》207 页）。「国罗派」（新音派）的第三代学者对「语音简化论」又进一步的发挥。一如朱德熙先生，就大肆夸大上古汉语声母、韵母的复杂性，说「在先秦时代塞音声母和塞擦音声母都有浊音、不送气清音和送气清音三套。鼻音声母也分清浊两套，很可能还有 [kl、pl 、gl、bl 、sn、st 、sk] 等形式的复辅音。所有的音节都以辅音收尾，没有开音节。辅音韵尾除了见于现代方言（例如广州话）的 [m、n、η、d、t、k] 之外，还有 [b、d、g ]」（见《中国大百科全书》<汉语> 条）。又如徐世荣先生，不但津津乐道地奢谈从古到今汉语声、韵调的简化，说「从上述声、韵、调的古今变化来看，则是由繁向简，古时多分，后世多合。」尤其出格的是强调了声调的简化，说「古音四声还各分阴阳」，「调类也如声韵，是古多而今少，也是由繁向简的」（见《汉字正音字典》的序言）。新音派的第四代学者——当代中年语言学教授，「语音简化论」不单成了定势思维，而且更是畸形发展，大都把眼睛盯在各地语音的简化上。一如无为先生为了阐明「语言融合的结果往往是词汇变多，音系变简单」这一观点，列举了近几十年来成都话、西安话音系简化的许多例子（见北大语音论坛）；再如广州中山大学的麦耘教授在给笔者的信中谈到「语音简化是个大趋向。我是搞广州话的，现在广州音日益简化」；又如民族学院的黄行教授，为了阐明「语音简化」的科学性，竞拿计算机和人类语言相比较，说「计算机本身的代码只有 0 和 1 两个，信息负荷量应该说比任何自然语言都高，但却是最合理的」（给笔者的复信）。「国罗派」的「语音简化论」现已发展到荒谬至极的程度，汉语语言学出现了畸形怪胎。\n\n汉语语音的发展是不是越来越简化，音位和音节是不是越来越少？还是看看从古至今汉语语音发展的事实吧：\n\n1、声母方面： 钱大昕证明了「古无舌上音」，「古无轻唇音」。即是说，中古后期的三十六字的舌上音知彻澄娘，是从上古舌头音端透定泥里分化出来的；轻唇音非敷奉微是从上古重唇音帮旁并明里分化出来的。钱大昕还说「古人多舌音，后世多变齿音，不独知彻澄三母为然」，后经章炳麟、黄侃进一步地考证，证实中古正齿音照穿床审来自上古音端、精两组声纽：照系二等来自上古齿头音精清心；照系三等来自上古舌头音端透定。由此考证，可知从上古到中古汉语声母增加了「舌上音」——今翘舌音 zh ch sh 和舌面鼻音（具体音值姑且不论），增加了「轻唇音」——今唇齿音 f 和 v。从中古到近代，见精两系声母又分化：见系声纽的分化在元代周德清的《中原音韵》里，还比较模糊，舌根音 g k h 和舌面音 j q x 的分野还不十分清楚，到了明代万历年间叶秉敬著的《韵表》里才有了明确的理论阐释，「在其‘辨韵有粗圆有细尖’一条中已透露出见系分化为粗圆（「庚干公官」——开、合两呼）和细尖（「经坚扃涓——齐撮两呼）两类（见唐作藩《普通话语音史话》第 43 页）。也就是说，见系声母分化为舌根音 g k h 和舌面音 j q x，直到这时才得到了理论上的承认。见系声母分化的同时，精系声母也分化。精系和见系的分化可能是同步的，分化的原因也近似，都是因为 i 介音 的影响。见系分化为 g k h 和 j q x，精系分化为 z c s（资雌丝的声母）和 zi ci si（尖音积七西的声母）。对于精系的分化，究境是从 z c s 里分化出 zi ci si，还是从 zi ci si 里分化出 z c s，学界的看法不同。王力先生是这样叙述的：「十二世纪（或稍后）ts ts s 在 i 韵的前面时，引导舌面元音 i 转化为 [ ]（少点歪头的 i ）；到了十四世纪（或稍前）……ts ts s 又和 i 碰在一起，但是它不再引导 i 变为[ ] 了」（见《汉语史稿》208 页）。z c s 和 zi ci si 谁为母音，谁为子音，究竟是 i 引导 z c s 的发音部位后移，变为 zi ci si，还是 z c s 引导 i 的发音部位前移变为[ ]（少点歪头的 i ）且不去分析，精组声纽因为 i 介音的作用而分化为两组，却是公认的事实。\n\n综上所述，可以清楚地看出：汉语的声母，从上古到中古增加了唇齿音 f 和 v ，舌尖后音 zh ch sh ，舌面鼻音[ ]（右腿拐弯的 n）。从中古到近、现代（1923 年）又增加了舌面音 j q x ，舌叶音（尖音声母）zi ci si。前后共增加了 12 个声母。增加的这十二个声母，从黄侃的「古本音」和全国「读音统一会」审定的「老国音」的对比中也能明显地看到。黄侃的古本音共有 19 个声纽，如果把其中的「并」、「定」、「从」、「匣」四个浊声母归并到同音位的清音里去，那就只有 15 个声纽，和厦门 15 音近似。而「老国音」里有 24 个声母，又有尖音音节ㄗㄧ　ㄘㄧ　ㄙㄧ（即 zi ci si），如果把尖音的声母 zi ci si 也看成是独立的音位，「老国音」的声母就有 27 个，比古本音的 15 个声母正好多出 12 个。尽管「国罗派」学者把「老国音」的声母体系否定了，把尖音和舌面鼻音等语音成分砍掉了，但从上古到现代，汉语里增加了 12 个声母的事实是难以否认的。\n\n谈到声母的增加，「国罗派」学者定然会用「浊音清化」来反驳。王力先生就以「浊音清化」作为「语音简化论」的首要依据。他说「从中古到近代，汉语普通话的声母趋向于简化。最普遍存在的一个简化规律就是浊音清化……，所有的浊音声母都变了清音……」（见《汉语史稿》110 页）。认为浊音清化，汉语消失了十个浊音声母，意味着汉语语音成份的减少。实际上这是一种偏见。因为中古的「浊音」含义与现代的「浊音」含义并不完全相同。现代发音学的研究发现，同一音位的辅音很难有清与浊、送气与不送气、平声与仄声（尤其是去声）的三套对立。这样的对立，日耳曼语系里没有，斯拉夫语系里也没有，世界各种语系里都很难找到。南方某些方言里虽有浊音，但和同声调的清音近似，好象仅有发音轻重的区别，并没有音位的区别。浊音声母的平声字读为吐气的清音，仄声字读为不吐气的清音，有可能中古时期的北方话的音值本来就是这个样子，只不过是古今语言学的分类方法不同，概念术语不同。这种设想不无根据，例如代表中古音系的《广韵》是在北宋初年成书，代表中古音系的三十六字母也是在北宋初年形成。《广韵》和三十六字母里的浊音的音值怎样？反映「宋初汴洛音」的《皇极经世书》里的「声音唱和图」（邵雍著），就明显地反映出，浊音声母的平声字读为吐气的清音，仄声字读为不吐气的清音。由此看来，中古的浊音，并不是独立的音位，也并不等同于南方某些方言的浊音；浊音清化，也不能认为是声母的减少。退一步说，即使是声母的减少，而减少的声母也不如增加的多。「国罗派」学者以浊音清化为由，否认语音成份的增加，断言语音成份的减少，实在是一叶蔽目不见泰山。\n\n2、韵母方面：上古音的韵母有多少，具体音值是什么？不论是清代学者还是现代学者，都还没有确绝的或令人信服的结论。韵母究竟是古多而今少，还是古少而今多？新、老音派的分歧很大，因为争论古今韵部的多少，又涉及到入声辅音韵尾的有无。顾炎武分古韵为十部，江永分为十三部，段玉裁分为十七部，孔广森分为十八部…… 分部越来越多，现代学者王力先生则分为十一类二十九部。王力先生之所以分的部数最多，是因为他的二十九部里含有十一部带 [p t k ] 韵尾的入声韵。就是王力先生的二十九部也并未得到诸如朱德熙、徐世荣等「语音简化论」狂热鼓吹者的认可。他们认为上古的入声韵尾不但有 [d、t、k]，还有 [b、d、g ]，「所有的音节都以辅音收尾，没有开音节」。而笔者则认为上古的入声有没有辅音韵尾还在于两可之间，上古的所谓入声，很可能只是一种声调而不是什么[d、t、k] 甚至 [b、d、g ] 的辅音收尾。一是因为许多学者证明了《诗经》、《易经》等古经韵文里，入声字大多和阴声字押韵，是开音节而不是闭音节。二是因为上古汉字的谐声偏旁绝大多数是入声和阴声相通，这一点连王力先生都承认。三是许多史料都证明先秦时期的古汉语音节响亮清晰，既便于歌唱，又便于远距离交谈，隔河隔山都能听得清楚，这都是闭口韵难以办到的。四是现代北方话里凡保留入声的方言，入声字的读音大多是一种开音节的声调，调值为 23，近似于普通话的阳平，如药的读音为 yu ， 脚的读音为 ju ，雪的读音为 su 。由此四点足以证明上古的入声绝不是什么辅音收尾的入声韵，而只是一种声调。既然上古入声的辅音韵尾不存在，中古入声的辅音韵尾也就成了无本之木。尽管《广韵》里入声只和阳声韵相配，但中古的韵文里，入声和阴声韵相配的也随处可见。特别是和《广韵》同一时代问世的《皇极经世书》的「声音唱和图」（邵雍著）里入声字大都和阴声字相配，是开音节。新派学者凡是认为入声有辅音韵尾的，大多是迷信了瑞典学者高本汉的学说。其实高本汉是有偏见的，把他们印欧语系的辅音韵尾强加于中国古代汉语是主观主义的，他所使用的历史比较法以及闽、粤方言的证据也未必全部可靠。当代有些学子去调查粤语的入声，并没发现有什么 [d、t、k] 和[b、d、g ] 之类的辅音韵尾，即使闽、粤方言有入声韵尾，也不一定就等同于古代的入声。再一说，汉语的发源地是黄河流域的中原地区，而中原地区凡保留入声的方言，其入声大都是一种声调，是开音节，难道说中原地区丝毫不能保留古音？中国的现代学者都师法西洋，死死地肯定中古的入声有辅音韵尾，只怕是误入歧途。如果排除了上古和中古入声的辅音韵尾，上古和中古的韵母还会有现代汉语的三十八个（如不砍 iai 韵母应是三十九个）吗？现代和古代相比，在韵母方面起码增加了 er 韵母和儿化音，还可以说从 e 里分化出 o ，从 eng 里分化出 ong（因为 1913 年审定的「老国音」里没有 o 和 ong），汉语在从古至今的发展中，韵母也是有增无减的。\n\n3、声调方面：徐世荣先生的「调类也如声韵，是古多而今少，也是由繁向简的」的理论绝对不可信。许多语音史料证明，上古的韵文只讲平仄，不讲四声。平、上、去、入并没形成完整的体系，《诗经》和《易经》里，入声字不但和去声字混押，而且和平声字混押。中古时期虽形成了四声体系，但又和声母的清浊搅混，韵文仍是以平仄为主，四声时有混淆。中古后期韵图的出现，才使四声更加明确。元代平声分化，打乱了入声，许多明清时代的学者依据语音现状变四声为五声，即阴平、阳平、上声、去声和入声。明代西洋人金尼阁纪录汉语的《西孺耳目资》、清代直隶（今河北）人樊腾凤的《五方元音》等字书都反映了这种语音情况。1913 年「全国读音统一会」审定的法定标准音——「老国音」明确规定了五个声调，1924 年刘复的《四声实验录》指出北京音的入声与「下平（阳平）相近，却也并不全同」，也承认北京话实有五个声调。但由于入声调在各地方言的分歧很大，（如受满语影响重的东北官话区无入声，受中原语音影响重的其他官话区有入声，受东北音和中原音双重影响的北京官话虽还有入声，但调值已与中原音不同；北方官话区的入声是声调，而江南方言区的入声近似于闭音节），不易统一和推广，所以 1923 年「读音统一筹备会」决议取消入声，把入声字分派到阴平、阳平、上声和去声里去，又形成新的四声。现代汉语即使取消了入声，仍然有五种声调，因为增加了轻声。汉字的声调，在上古是「平、仄」二分，中古是「平、上、去、入」四分，近代是「阴、阳、上、去、入」五分，现代是「阴平、阳平、上声、去声、轻声」五分。语音史料证明，汉语在从古到今的发展中，声调也是逐步增加的。\n\n4、音节方面：汉语在从古至今的发展中，声、韵、调增加了，音节肯定是逐步增加的，因为声、韵、调的增加必然带来音节的增加。但要作出明确的对比又较为困难。一是由于古代和现代的语音分类方法不同，古今音节的数量不容易对比。古代使用的是等韵学，而现代使用的是音位学。在等韵学里不但把韵母分为四等，甚至把声母也分为四等，譬如，现代的一个 a 元音，在古代韵书里近似于四个元音。二是「现代汉语」人为地砍掉了尖音、舌面鼻音、iai 韵母和部分 ei 韵母音节（如 gei kei zhei chei shei zei cei sei 等），使汉语失掉了五十多个音节，古今音节的数量又难以对比。几千年来音节递增的情况且不详论，单看最近 50 年来音节增加的实况，便可窥豹一斑：现代汉语字典上，五十年代后期增加了一个 zhei 音节（这边的「这」），六十年代后期增加了一个 kei 音节（克刂），七十年代后期增加了一个 dia 音节（嗲）。八十年代以来英文 VCD 闯进了汉语，VCD 的 C 的音值是什么？有的发成尖音音节 si（不读整体认读音节「四」），有的发成「古音」sei，而这两个音节都是现代汉语里没有的音节，汉语里增加 si 音节或 sei 音节又是势在必然。这些事实不都说明汉语的音节在增加吗？\n\n综观汉语语音从古到今的发展规律，是和人类语音的发展总规律是一致的，是从简单到丰富，从粗疏到精密，音素是逐步增加的，而不是减少的。具体的表现有以下四大规律：一是音素递增规律，即是音素逐步增多，声、韵、调的增加大于失落（前文以论，不在重复）。二是音位分布均衡规律，即是从古音中分化出来的新音音位占据了口腔和舌的闲置部位，让发音位置不论是在主动发音器官上还是在被动发音器官上的分布都趋于均衡。音素递增规律和音位分化均衡规律相辅相成，就促使汉语从舌根音 g k h 里分化出舌面音 j q x ，从舌尖音 z c s 里分化出舌叶音（尖音的声母）zi ci si ，从舌尖中音 d t 和舌尖音 z c s 里分化出舌尖后音 zh ch sh，从重唇音 b p 里分化出轻唇音 f v，从舌尖鼻音 n 里分化出舌面鼻音[ ]（右腿拐弯的 n）等。这些分化让声母均匀的分布在口腔、舌上和唇上，使口腔内的声母（不包括唇音）由上古的三组（见系舌根音 g k h、端系舌头音 d t n、精系齿头音 z c s）变成了近、现代的六组（舌根音 g k h、舌面音 j q x、翘舌音 zh ch sh r、舌叶音 zi ci si、舌尖中音 d t n l、舌尖音 z c s），达到了音位科学分配的顶峰。除了以上两条使音素增加的规律之外还有两条使音素减少的规律：一条是浊音清化规律，即全浊音同化于同音位的清音，发音省力了。一条是开音节规律，即闭口韵发展为开口韵。在黄河流域的北方话中，不但假想的 m 韵尾和入声韵尾消逝，就连 an ang 等 n ng 收尾的闭口韵也发展为开口的鼻化韵了，较之闭口韵更为响亮清晰了。综合这四条规律，可以看出汉语语音向着表音响亮、清晰、科学、精密的方向发展，是语音成分逐步增加，而决不是语音逐步减少，逐步简化与合并。\n\n「语音简化」的观点，本来是江南「国罗派」学者的方言偏见。如前文所叙，1923 年左右了「国语统一筹备会」的以黎锦熙为轴心的「国罗派」学者，几乎是清一色的江南方言区的学者，他们不但自身的语音有缺陷，而且对中原「祖音」和北京方言都还未作认真全面地调查，未能掌握北方话的全部声韵系统，也就未能看清汉语语音发展的方向。他们发现部分北京人的尖音舌面化现象，就认为尖团合流是语音发展的方向，就认为语音成分的简化与合并是汉语发展的方向。他们没有认识到以洛阳音为代表的中原官话是发展最快、最完整、最成熟的声韵系统，是最具有全民族代表性的语音系统；没有认识到民族共同语发展的不平衡性，汉语的语音成分也有先进和后进之分；没有认识到某些地区在声母方面的尖团不分（j q x 和 zi ci si 不分）、n l 不分、b f 不分、i r 不分、z c s 和 zhi chi shi 不分、g k h 和 j q x 不分、z c s 和 zi ci si 不分以及在韵母方面 i ei 不分、ai iai 不分、en in 不分、en eng 不分等等， 是因为受中原语音影响的时间短、程度轻，语音发展不完全，是暂时性的不分；没有认识到这些语音成分不完全的地区一定会向中原共同语靠近，暂时没有分化的语音成分会逐渐分化出来，暂时不能区别的语音成分会逐渐区别开来。「语音简化论」的初期阶段，只是对汉语语音发展的规律认识不清，属于幼稚和偏见，而后来逐渐变成了「国罗派」学者为简化语音、合并尖团的既定方针服务的地地道道的机会主义的理论。二十世纪初，年轻、幼稚又激进的「国罗派」，对汉语、汉字的科学性认识不足，又急于实现国语统一和汉字拉丁化（国语罗马字），要求简化语音、合并尖团是有情可原的，是「立党为公」？",
				"added": 1515779811
			}
		],
		"2_1JbRRo7M1pengKrQsNyYGDJHCuac9KFD1y": [
			{
				"comment_id": 61,
				"body": "> [xiaofan](#comment_9_1G58PQ7Ena3mARGX2p5mYH7yHcBWRLX2Pa): 这个套路好熟悉……\n\n百度赶走谷歌……",
				"added": 1516028285
			}
		],
		"2_15FDfY8PxKsonSWAs2XTbDMuAzVkK4oyYD": [
			{
				"comment_id": 62,
				"body": "You need [Filecoin](https://filecoin.io).",
				"added": 1516982705
			}
		],
		"17_1PBMVMMVVtSK6FmMbfz4fhEw5fv6eZs5Dn": [
			{
				"comment_id": 64,
				"body": "本论坛谢绝宗教战争",
				"added": 1517410011
			}
		],
		"4_14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF": [
			{
				"comment_id": 66,
				"body": "- http://127.0.0.1:43110/NewGFWTalk.bit/?Topic:12_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6\n- http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/13aB79mzuRLgDYzQthn9wzycjw77WyDXh6/1504479781",
				"added": 1517759830
			},
			{
				"comment_id": 67,
				"body": "> [chengxing](#comment_16_14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF): 只是认为其表达方式太乱了，和农村中国大妈差不多样。\n\n建议所有对中国感兴趣的人好好看看郭文贵视频，他整得那些景，他满嘴跑火车但又似乎说了点什么，虚情假意但又掏心掏肺。可以想象，跟他打交道，他说的任何一个字都不能信，但同时也不能随意放过。这是窥视**中国特色成功人士**的绝佳窗口。想在中国扑腾的可以先掂量掂量自己有没有那两下子和这样的人比划。",
				"added": 1517825441
			}
		],
		"4_1467emba7EjG4SpESPiaRY6LBgPhUVkRuD": [
			{
				"comment_id": 68,
				"body": "卧槽",
				"added": 1518114503
			}
		],
		"1_1FCUxdEX5AU1HWZnph7spBmsgFeeWMzXTz": [
			{
				"comment_id": 69,
				"body": "> 大容量的机器即可\n\n呵呵。現在的搜索基於 SQL LIKE，性能太差。還得做性能優化（架構基本上要大改）",
				"added": 1518263450
			}
		],
		"15_1KiszkwMfgRjBcSkmnqN69q8bLjueE7pL": [
			{
				"comment_id": 70,
				"body": "笑死我了，你幹的事要不要我發個公告廣播一下？",
				"added": 1518327164
			}
		],
		"1_1ET5XVEQK7s2eE6Y8Sqa6M4RvvRVkGs3YE": [
			{
				"comment_id": 71,
				"body": "優點：多用户 / SQL / 使用簡單\n缺點：安全性有待評估 / 开發力量少",
				"added": 1518532454
			}
		],
		"2_19VaXZCcmMKoQtq1x4FH98SLkZ6YhmEE1S": [
			{
				"comment_id": 72,
				"body": "用 公用賬號",
				"added": 1518611556
			}
		],
		"8_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L": [
			{
				"comment_id": 73,
				"body": "您幾月幾日發的？我的存檔系統裡查不到您的記錄，我覺得您根本沒發過",
				"added": 1518612561
			},
			{
				"comment_id": 75,
				"body": "還有，先詢問 再下結論，不要武斷，不要 一驚一乍 搞個大新聞",
				"added": 1518612874
			}
		],
		"1_1M54tXvq9WvmbAPBDdwCx72ZxQpeQdMCzw": [
			{
				"comment_id": 74,
				"body": "> [13570](#comment_2_16DDxzufw38iTrjRgDnuLa1geGPh5tdJQx): 基于区块链技术，去中心化\n\nZeroNet**不用**区块链技术",
				"added": 1518612659
			},
			{
				"comment_id": 76,
				"body": "> [nassau](#comment_115_1M6V4wECbz5e1aUmuij2BB72ensHCYNFmd): 相比freenet,  zeronet 的优势是啥？\n\n這個帖子，請：http://127.0.0.1:43110/NewGFWTalk.bit/?Topic:1_1ET5XVEQK7s2eE6Y8Sqa6M4RvvRVkGs3YE",
				"added": 1518612939
			}
		],
		"6_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L": [
			{
				"comment_id": 77,
				"body": "你沒有被禁言，可能是你网絡不好",
				"added": 1518613766
			}
		],
		"1_18wngUSE9AqMa1q4EM19ZRQriRYNKZ5NDK": [
			{
				"comment_id": 78,
				"body": "1. 进入想要删除的站点\n2. 拉开右侧抽屉\n3. 向下滚动，关闭 “This is my site”\n4. 点击 “Delete”",
				"added": 1518613867
			}
		],
		"14_1Ddehzu7BzcL9bKYbNQX8TPcFqZHiid9GH": [
			{
				"comment_id": 79,
				"body": "故意的，New GFW Talk 不希望人們在首頁發帖。\nhttp://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/13aB79mzuRLgDYzQthn9wzycjw77WyDXh6/1518178616",
				"added": 1518787023
			},
			{
				"comment_id": 80,
				"body": "> [dssde](#comment_17_1Ddehzu7BzcL9bKYbNQX8TPcFqZHiid9GH): 不是，站长都发不了帖了\n\n**對，故意的**\n\n所以你需要克隆 nofish 寫的网站【[ZeroBlog](/Blog.ZeroNetwork.bit)，[ZeroTalk](/Talk.ZeroNetwork.bit)】\n不要 clone 第三方修改版网站【[New GFW Talk](/NewGFWTalk.bit)，[浮生网誌](/mosen.bit)等】",
				"added": 1518787281
			}
		],
		"7_1PcUqgLkcgRnfD88w2FPsdTrBHWaBuPTHW": [
			{
				"comment_id": 81,
				"body": "> [dssde](#comment_22_1Ddehzu7BzcL9bKYbNQX8TPcFqZHiid9GH): 0chn是可信的吗，是开源的吗？是真正匿名吗？后台是怎么工作的？\n\n自己看源碼去",
				"added": 1518792894
			},
			{
				"comment_id": 82,
				"body": "> [dssde](#comment_24_1Ddehzu7BzcL9bKYbNQX8TPcFqZHiid9GH): 源码在哪？\n\n`你的ZeroNet安裝地址/data/15F7Tv4ccnVrvR3FymQ4GMqVyuAYcrPa6n`",
				"added": 1518793232
			}
		],
		"7_1GVM7nNzmYJ3ppPCmDTPLozrJF2Z9mgFpF": [
			{
				"comment_id": 83,
				"body": "笑死，**連續2分鐘**批評",
				"added": 1518793592
			}
		],
		"102_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 84,
				"body": "（如果）支持习近平搞终身制，中国（就）会像俄罗斯一样成为垮掉的国家……\nhttp://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1ABFCaadiEa3bFNzN3RcCZSsviqMNTbz3m/1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC/1519654466",
				"added": 1519824764
			}
		],
		"1_1GDC9WtGFWbdtKm4so8dsfbHeUrPaUbGPd": [
			{
				"comment_id": 85,
				"body": "1. 請你自己擦除元数据，ZeroNet 沒有這個義務\n2. ZeroMe 會自動幫你擦除，你可以用它",
				"added": 1520865762
			}
		],
		"71_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 86,
				"body": "重回五十年代",
				"added": 1521287252
			}
		],
		"41_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 87,
				"body": "中國政治/歷史啟蒙書\n比國內垃圾教材好太多了",
				"added": 1521287978
			}
		],
		"75_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 88,
				"body": "大規模監控\nhttp://127.0.0.1:43110/12ddrrRKkABAWTU48ZL3THfypHtVJ3aVF5/?Post:19\nhttp://127.0.0.1:43110/1DxU6bWh1GfUjtxwaXt87sBjvPHXWo8UWw/?Post:7\nhttp://127.0.0.1:43110/NewGFWTalk.bit/?Topic:5_1NZsz5ugkzg27d9jmc8qrT9GxcLZdiuBGP",
				"added": 1521291797
			}
		],
		"11_133isGmcrRR5LNGVmCPrEWjWC287AWDQb2": [
			{
				"comment_id": 89,
				"body": "> 然后当他说道: 我只是彻底认识到黑暗面\n> 然后我当时半开玩笑的说: 是不是什么黑暗势力 (因为到下一句话之前 我都认为 jsw 是开玩笑的)\n> 结果 jsw 本人回答: **跟公安部长有一腿的黑暗势力**\n\nwow",
				"added": 1521466711
			},
			{
				"comment_id": 93,
				"body": "結論：以編程隨想為標準，徹底的匿名",
				"added": 1521469676
			}
		],
		"27_145kg9WZryLeefr2FuGERptM7frEf7ySGH": [
			{
				"comment_id": 90,
				"body": "> 创造易语言的初衷是进行用中文来编写程序的实践，方便中国人以中国人的思维编写程序，并不用再去学习西方思维。\n\n易语言那狗屁语法有什么脸自称「中国人的思维」，不要再给中国人抹黑了",
				"added": 1521468021
			}
		],
		"18_12Ugp53jiMdvj1Kxa1w7c2LcXUBdGPs1oK": [
			{
				"comment_id": 91,
				"body": "http://127.0.0.1:43110/1QHbf72f4vdx3QAxN1LTN9KP19J428Q85R/",
				"added": 1521468081
			}
		],
		"1_15LYZz82LwdFA4tqWVgv3zJ8ZsWam784VV": [
			{
				"comment_id": 92,
				"body": "> [birdvd](#comment_59_1Ko7622HKggRGbJny5hCS4n9wwMAVVLTSf): 啥意思，，，\n\n來詐騙的，還用了谷歌翻譯",
				"added": 1521468132
			}
		],
		"53_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": [
			{
				"comment_id": 94,
				"body": "> 立即清仓，提现至银行卡！\n\n提现也要换成美元，人民币就算了",
				"added": 1523153709
			}
		],
		"51_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 95,
				"body": "- [秦始皇为什么修长城 - 冲虚志](/19CY4ZtRDoWugjsRSBBDcniKWB7rdPNCqD/?Post:3)\n- [胡适：联省自治与军阀割据](https://www.douban.com/note/66590531)\n- [马勇：五千年文明是否只有大一统一个选项？](http://www.aisixiang.com/data/67141.html)",
				"added": 1523716161
			}
		],
		"57_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 96,
				"body": "我在[如何看待「上海独立运动」？](https://www.pin-cong.com/p/24298/?s=78333)已经论述过中国解体的好处了，不过今天我不想直接复制粘贴那个帖子，想谈点别的。\n\n我们为什么痛恨大一统？如果大一统真的只是方法上不对的话，那也犯不着这么反感它呀。\n\n### 1\\. 大一统是反民主的\n\n想象一个问题：就是假定中国有一天真的民主化了，要不要统一台湾？\n\n如果台湾不接受统一，要不要武力攻台？\n\n如果中国的大多数人不接受武力攻台（毕竟要死人），那怎么办？如果放弃攻台，你有脸说你支持大一统？如果强行攻台，你有脸说你是民主的？\n\n你看，大一统的问题在于它将一个本该民主决策的事务强行预定了，而解体不是强行预定，如果某地人反对独立，他们可以公投决定不独立，这和民主是不抵触的。立场一旦在表决之前被预设了，它就不可能尊重民意。因此如果你选择了大一统这一预设立场，那么你将来就会强奸民意，摧毁民主。\n\n### 2\\. 大一统的边界在哪？\n\n我们就再退一步讲，就算大多数人支持武力攻台，看起来好像民主问题不存在了，对不对？\n\n但是接下来衍生出另一个问题：既然支持武力攻台，那是不是也应当支持武力统一符拉迪沃斯托克、蒙古、阿鲁纳恰尔？毕竟自古以来嘛。\n\n如果这三个地方真打下来了，接下来是不是又要进攻哈萨克斯坦、印度、越南？\n\n有人会狡辩了：这些不是中国领土啊。\n\n得了吧，我们的预设前提是「大多数人支持武力攻台」，既然中国人这么好战，会介意多块领土？\n\n何况中国的边界线本来就是不固定的，你说台湾自清以来就是中国领土，那明朝的时候不是啊？既然古代中国边境线就变来变去的，以后再大一点有什么大不了的？\n\n### 3\\. 所谓「大一统铸造和平，分裂会造成战乱」，是贼喊捉贼。\n\n上文中我把藏南称为阿鲁纳恰尔，某些人是不是得疯？\n\n问题是那地方现今居住的已经差不多都是印度人了，你拿什么统一？我们可以姑且假定中国在一系列军事行动中击败了印度的正规军，但是接下来，不甘离开印度的当地人势必要在当地发动一连串的报复活动，并将阿鲁纳恰尔变成帝国永不愈合的伤口。你接下来是不是还得派个「藏南建设兵团」过去？如果兵团出现了人口危机，又怎么办？八千湘女上藏南？\n\n真 TM 迫真民主啊。\n\n甚至都不用等到阿鲁纳恰尔，我们可以肯定的讲，只要中国敢进攻台湾，这种事就一定会发生。\n\n这些问题，大一统支持者们敢面对吗？\n\n他们当然不敢，他们只能一味夸大分裂的危害，说分裂了就会战乱频仍，但问题是：**在分裂状态之下掀起战争的人，不都是大一统爱好者吗？**\n\n战国时期，制造最大战乱的，是试图统一的嬴政；\n三国时期，制造最大战乱的，是试图统一的魏蜀两国；\n五胡十六国时期，制造最大战乱的，是试图统一的符坚等人；\n五代十国时期，制造最大战乱的，是建立了北宋的赵氏兄弟；\n民国时期，制造最大战乱的，是试图统一的蒋介石和共产党。\n\n（关于日本，有两种看法：如果认为日本是在保护战前的合法利益，那么日本就不是战争的挑起者；如果认为日本是战争的挑起者，那么它一样也在制造大一统）\n\n而那些反大一统的人，我举个栗子：晋绥军阀阎锡山，他主政的时候在控制区修建窄轨铁路，物资进入三晋都要换车。大一统爱好者们攻击他割据一方，却不敢面对一个事实：晋绥军要向外打，他们也要换车，从而为自己制造后勤困难。\n\n说白了这就是在维护和平。但是大一统爱好者们敢承认吗？\n\n当然我们也不要把民国军阀抬的太高，很多人像张作霖唐继尧也是有大一统野心的。但这恰恰证明了民国军阀不求独立只求割据的做法是错的，因为它给军阀们制造战乱提供了借口，至于蒋氏政权掘黄河御敌和共产党所谓土改和特货更不必提了。\n\n而大一统又真的和平吗？\n\n修长城修阿房宫搞到民不聊生，不是在你统一的大秦发生的？\n绿林赤眉蜂起，不是在你统一的大汉发生的？\n三征高丽，一败再败，不是在你统一的大隋发生的？\n黄巢作乱，以人为食，美其名曰两脚羊，不是在你统一的大唐发生的？\n实现中古社会主义，民不聊生，不是在你半统一的大宋发生的？\n连年人相食，喋血土木堡，不是在你统一的大明发生的？\n对内剃发易服，对外一败再败，不是在你统一的大清发生的？\n三年饥荒，十年文革，不是在你统一的共和国发生的？\n\n至于剥削农民、抑制工商、宦官当权、奸臣作伥、尊奉孝道、践踏契约、盐业专营、特供中央、盗匪蜂起、遍地饥荒、文字禁锢、扼止海航、敌视民主、盲目排外、大炼钢铁、夹边灾荒、计划生育、工人下岗、礼崩乐坏、道德不张…… 难道不是你国一直以来的常态？？？\n\n还有，**分裂本身，难道不是因为大一统王朝无法持续，才会发生的吗？**\n\n* * *\n\n另外我在上文中还有一个假定：\n「我们可以姑且假定中国在一系列军事行动中击败了印度的正规军」\n\n然而这个假定本身都是未必成立的。\n\n你国不敢进攻阿鲁纳恰尔，是因为有印度；不敢进攻符拉迪沃斯托克，是因为有俄罗斯；不敢进攻台湾，是因为有美国…… 说白了吧，**你国之所以暂时和平了一段时间，也不过是因为你国没有统一你球而已。**\n\n**你国要是对你球实现了大一统，它的胡作非为还有谁治的了？？？**\n\n### 4\\. 大一统是帮助独裁者扩张权力的工具\n\n不论其初衷为何，大一统爱好者们强行夸大分裂时期的战争，无视大一统时期的灾祸，从结果上看是不是也是在为专制统治者洗地？\n\n很多人说啦，不对，中国这么烂都是共产主义的错。\n\n不全是。\n\n共产党统治的国家只有两种：一是大一统国家，二是大一统国家通过暴力强行建立的卫星国。\n\n为什么会这样？\n\n共产党并没有他自己宣称的那么招人喜欢。但凡民间有充足反抗能力，共产党都无法当权。\n\n所谓得民心者得天下，这句话其实是对的，只不过不适用于发明了这句话的中国。\n\n因为中国的民间组织早就被过去的大一统王朝破坏殆尽了，它拿什么抵抗共产党？\n\n另外，大一统王朝把草民的生活压低到了仅仅只能维持最低限度地生存，甚至不少时候连生存都无法维持的地步，那么中国人面对共产党的许诺，能不动心吗？\n\n还有，军人无法杀死自己的家人，但独裁者不会让他们到外地去杀别人的家人？\n\n以上一切铸就了一个权力无远弗届的中国，别说共产党了，就是把你我放到那个位置上去，你敢摸着良心说，你能抵御权力的诱惑？\n\n我反正不能。\n\n于是就有迫真民主人士说了：哎呀，暴力推翻共产党也不好呀，因为新上台的人也不一定比共产党好呀。\n\n呸，伪问题。\n\n如果你有暴力反抗公权力的能力，他敢欺负你？\n\n* * *\n\n你问我，为什么要主张中国解体？为什么那么反感大一统？\n\n当然是因为不想用虚假希望欺骗自己啊。",
				"added": 1528662885
			}
		]
	},
	"comment_vote": {
		"5_13Np9JiwGXfhpFVLD9kE1XS4TELhdL4Rjt": 1,
		"2_1BdC5k155xY8M7uuksXynSgXgVnmekivem": 1,
		"1_16wPPrDnQDFadgTmhZRUW7YojAxtWijSrY": 1,
		"35_1Q2yjutP8VevpmW5ZuKzNcDUQbUFn3gsVT": 1,
		"118_1LESBhM9ResjKhCCNhgbNDVFKcfdQractA": 1,
		"5_1Sj3zigR2ha9rzJiR6igKtoZs6XCkohfe": 1,
		"6_1Sj3zigR2ha9rzJiR6igKtoZs6XCkohfe": 1,
		"8_1GVM7nNzmYJ3ppPCmDTPLozrJF2Z9mgFpF": 1,
		"12_1Np58q7bCfW7hmHuXvoYux3ij6M4Qecfb3": 1,
		"22_15veLatSdM1bDkPzfQ13NGY4urYWFYvvDU": 1,
		"36_13R8RSMeUBKKsjpftt3vbKCVh7E513ThRp": 1,
		"117_1LESBhM9ResjKhCCNhgbNDVFKcfdQractA": 1,
		"6_16XBhwsVCqtAdYmJT85NoQXhZRths6SUji": 1,
		"4_1MwamfDqgf1eYoyQdta21hrgXqHPWyAuNZ": 1,
		"97_1LESBhM9ResjKhCCNhgbNDVFKcfdQractA": 1,
		"36_1Np58q7bCfW7hmHuXvoYux3ij6M4Qecfb3": 1,
		"13_18LtMTFdyyGXJkePz1HB2twWhcXho7uDf8": 1,
		"123_1LESBhM9ResjKhCCNhgbNDVFKcfdQractA": 1,
		"64_1CyDAKDD4C3x14NQMmh5MxfKJZ5xxLF24g": 1,
		"125_1LESBhM9ResjKhCCNhgbNDVFKcfdQractA": 1,
		"2_1BqBYvoVCrsBD7Mhfh5F2rZtFphTzdShS3": 1,
		"127_1LESBhM9ResjKhCCNhgbNDVFKcfdQractA": 1,
		"53_13R8RSMeUBKKsjpftt3vbKCVh7E513ThRp": 1,
		"85_1FYGNAGGPjzRuubJGmq86t4iyEiMXxpuwL": 1,
		"100_1LESBhM9ResjKhCCNhgbNDVFKcfdQractA": 1,
		"2_1BXCYRHwwev9cdgoMdWvhgKrMvUp19p2R2": 1,
		"10_1QAL99HQw6mKLZU2mWGMDoELo4kb7cBgmZ": 1,
		"328_1FHN4oukAG7zFUpiC9L2iz7QpQVTuT3xkz": 1,
		"16_13R8RSMeUBKKsjpftt3vbKCVh7E513ThRp": 1,
		"2_1AtYs31SjaTJhjMF4r72zitAnaxj1DyEC6": 1,
		"79_1LESBhM9ResjKhCCNhgbNDVFKcfdQractA": 1,
		"3_1HABFyuoohZ13drjwyJsECp4zDKjvggyNp": 1,
		"57_1MZ6f3V1cBuhNwzajMVPu8vb1wRt1p6dpt": 1,
		"37_1LHdPBTEdLuBDgLcfqZtNwSTMec3EgejiM": 1,
		"60_1MZ6f3V1cBuhNwzajMVPu8vb1wRt1p6dpt": 1,
		"111_157d61UG24B66Yw2qwEQWY7yFAWp1HoAST": 1,
		"63_1MZ6f3V1cBuhNwzajMVPu8vb1wRt1p6dpt": 1,
		"10_1L4fuhUB75eAdVbDY9AJ4z2i2dwMho7MV8": 1,
		"20_1PAARvV1fn3tVSuePAqmxptPBsqkZVNfmn": 1,
		"3_1H5Mnsc9pAYUHa7v5RTBA1Q6pEozhJvkFn": 1,
		"1_1JVAcfhCCnogm4eeDLVamJXFYg3aCbfa5S": 1,
		"54_12e4EcUWaMHVa31rkuzWWxstByasqAp7RV": 1,
		"141_1LESBhM9ResjKhCCNhgbNDVFKcfdQractA": 1,
		"1_1G9As2oYPJBg9ex5BHq82qh1yVZSqU28cY": 1,
		"6_1L6rvvBV2EUc9HVT8yjE2129FWutCwkdcR": 1,
		"42_1CdwZ24MZhBc2XNT2vAjk2MQjJuEnybP5W": 1,
		"5_1MmfDp2ghmcGgXqFwXgAdn5aVmbjt4r5vX": 1,
		"26_1JmBwcsrovPGXG9c2VHbYHe7WBBF4xuTq6": 1,
		"1_13R8RSMeUBKKsjpftt3vbKCVh7E513ThRp": 1,
		"14_1CyDAKDD4C3x14NQMmh5MxfKJZ5xxLF24g": 1,
		"349_1958F7oCppj78MP966AfojMQwHg2WUupzq": 1,
		"6_1LNpoyKNhp2VFnDzZA6k5uMtj66EZWkjBc": 1,
		"72_1FYGNAGGPjzRuubJGmq86t4iyEiMXxpuwL": 1,
		"242_139DmfQr5fT7Xkcn71DpXBaXhA4X9u873q": 1,
		"73_1CyDAKDD4C3x14NQMmh5MxfKJZ5xxLF24g": 1,
		"2_19rEhH2gHfNqFDL2i9HyxR6kNKMwJUEXMo": 1,
		"58_12e4EcUWaMHVa31rkuzWWxstByasqAp7RV": 1,
		"22_1NWJxLty8kDfNQifWm3C366GJ58oqwN9yR": 1,
		"11_1NYWTSatcLAGwMBsCBAqceqwLoC5dmhh5o": 1,
		"1_1CqdJU5GnjUuFsD6JSJAy5hZ7oyrvXpjca": 1,
		"9_1UzEPVqHeweVKJuV4ii9hV6ivvrHX1oim": 1,
		"48_1GVM7nNzmYJ3ppPCmDTPLozrJF2Z9mgFpF": 1,
		"8_1E5VGMgW6YQBnwx7EeAZ477J7i9faQmNtf": 1,
		"95_1A5Uw4pejzgKx4c3yZkz8whBcqMaypp1Wo": 1,
		"2_1KaHc8BraRw9YyWQbDz2ZA1cwHi2fnayt1": 1,
		"1_1L34ssdxfxnnSFEoUmy48LocCxnVAHtqSV": 1,
		"24_12yaKkoqVKBUi66uB5pYXamWguKFaWdDnx": 1,
		"23_1MZ6f3V1cBuhNwzajMVPu8vb1wRt1p6dpt": 1,
		"37_1BqBYvoVCrsBD7Mhfh5F2rZtFphTzdShS3": 1,
		"33_1LNpoyKNhp2VFnDzZA6k5uMtj66EZWkjBc": 1,
		"1_18fU7yoTV5qije65xoLPX1hnoo8t2TKb8N": 1,
		"2_1Q27zpeugHBXp1SVN6ABEchFyUXsnAZwgJ": 1,
		"9_12KdbW38LcjavV8eF3TZ6Rc8MaGT8a8qzD": 1,
		"40_15veLatSdM1bDkPzfQ13NGY4urYWFYvvDU": 1,
		"30_16tWPYFLbad3R8iGcMuetyiwC2q5qXp45T": 1,
		"48_1PcUqgLkcgRnfD88w2FPsdTrBHWaBuPTHW": 1,
		"48_1FJCJm9PPaL2Lcfv64fSCuXXBHQcE4JdGY": 1,
		"145_1A5Uw4pejzgKx4c3yZkz8whBcqMaypp1Wo": 1,
		"154_1FYGNAGGPjzRuubJGmq86t4iyEiMXxpuwL": 1,
		"6_19wMFS5AMRnmgwybFryDJ6MwnWji1S1HKv": 1,
		"1_17a5mhwnQqpej8rx3MgDvzfRy86Hzw8NMU": 1,
		"4_16LCrfQSugEPYW7kMpHL1DyLRXbzZqpCct": 1,
		"2_171sXvnp9RmuZbCYE2dJTZjTQE2qG36Pab": 1,
		"1_17FoxCrm6XhYTaLKxYH2rSHRHkCGyJKLrt": 1,
		"214_1M6V4wECbz5e1aUmuij2BB72ensHCYNFmd": 1,
		"1_1KMXpBAFyqCfoPCU98YW6RaFBwX7eguX7b": 1,
		"8_1MQphYd4nY26ckat1XQMp6R2PeDa48hrnr": 1,
		"32_1JmBwcsrovPGXG9c2VHbYHe7WBBF4xuTq6": 1,
		"68_12e4EcUWaMHVa31rkuzWWxstByasqAp7RV": 1,
		"11_17a5mhwnQqpej8rx3MgDvzfRy86Hzw8NMU": 1,
		"25_17a5mhwnQqpej8rx3MgDvzfRy86Hzw8NMU": 1,
		"5_1Lag7pfbM5eFgLm3g5YhescMXgdm4bLQsh": 1,
		"3_1LWnGUnGnp5XZCfYPqaLWKwivd98j3Hx5L": 1,
		"13_1Hunoy87CSuMrkWVLLELNUK874e6Nmtnwm": 1,
		"28_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"6_1KoZ6vDCXeDavsQjCToc95SZJu7uVVd9Yi": 1,
		"65_1LNpoyKNhp2VFnDzZA6k5uMtj66EZWkjBc": 1,
		"73_12e4EcUWaMHVa31rkuzWWxstByasqAp7RV": 1,
		"75_12e4EcUWaMHVa31rkuzWWxstByasqAp7RV": 1,
		"27_1NWJxLty8kDfNQifWm3C366GJ58oqwN9yR": 1,
		"28_1NWJxLty8kDfNQifWm3C366GJ58oqwN9yR": 1,
		"29_1NWJxLty8kDfNQifWm3C366GJ58oqwN9yR": 1,
		"68_1LNpoyKNhp2VFnDzZA6k5uMtj66EZWkjBc": 1,
		"7_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5": 1,
		"10_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5": 1,
		"9_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5": 1,
		"9_15Qz21RyBSR9xhBng8Y6RUMpuMykozFxPJ": 1,
		"40_1PicuSmcwTaCY7W4kmWYbgDoVCm2mYG9pz": 1,
		"96_12e4EcUWaMHVa31rkuzWWxstByasqAp7RV": 1,
		"39_1JmBwcsrovPGXG9c2VHbYHe7WBBF4xuTq6": 1,
		"105_1GVM7nNzmYJ3ppPCmDTPLozrJF2Z9mgFpF": 1,
		"2_144RhCfirmUB7speT85Asmad8nGYkzt5xJ": 1,
		"1_1P33sgPqao8Sm3NcrujAUhcDFWQPL3uYpz": 1,
		"117_12e4EcUWaMHVa31rkuzWWxstByasqAp7RV": 1,
		"1_15pJpUoFdfioXCUXTFUp1mdgbGarXDSW7K": 1,
		"7_13KQJtgKeFPqLo8WigZh9o1bKpunxi2a16": 1,
		"53_1Ceg5F9KEWkCyTu3r1QBSuiU8C1PYsd8PJ": 1,
		"20_1KyNzrBTMpi7LSmsrjnKS6mf15jRuFFN4H": 1,
		"274_1N2eNZ5w1dpoBcwatsSuTaeNzHgSLjyrpU": 1,
		"3_1Lag7pfbM5eFgLm3g5YhescMXgdm4bLQsh": 1,
		"13_1QDDwttgyYsmR9xy6YxdqLimfauGCvkepH": 1,
		"112_12e4EcUWaMHVa31rkuzWWxstByasqAp7RV": 1,
		"6_192QiJtwfzw9NemSqGN1oCZGH7SP2ZXRWW": 1,
		"5_192QiJtwfzw9NemSqGN1oCZGH7SP2ZXRWW": 1,
		"21_16bCdVbS1TN3QLTALixv338oAk1DDSsu8p": 1,
		"10_17xeFZRG9nokuGNj8WZQU5V9ZdfUGr2gGT": 1,
		"8_14HrdUQiZ96WEUXiNguyE4KXgvBxhcbK6o": 1,
		"1239_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": 1,
		"71_1LNpoyKNhp2VFnDzZA6k5uMtj66EZWkjBc": 1,
		"2_1Pq3Pb5gFUmgjcZQEkUdTSSe4ZdrK1mNiL": 1,
		"23_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": 1,
		"59_1Ceg5F9KEWkCyTu3r1QBSuiU8C1PYsd8PJ": 1,
		"11_1ByshMDtswTbSxNZj6MW2Rqf6ED1wkA14q": 1,
		"363_1FHN4oukAG7zFUpiC9L2iz7QpQVTuT3xkz": 1,
		"9_14HrdUQiZ96WEUXiNguyE4KXgvBxhcbK6o": 1,
		"120_1GVM7nNzmYJ3ppPCmDTPLozrJF2Z9mgFpF": 1,
		"186_1LESBhM9ResjKhCCNhgbNDVFKcfdQractA": 1,
		"62_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": 1,
		"531_1958F7oCppj78MP966AfojMQwHg2WUupzq": 1,
		"10_1N2fYbovAXWNHLeBADB7uvL611Q7Q3ULwZ": 1,
		"17_1PicuSmcwTaCY7W4kmWYbgDoVCm2mYG9pz": 1,
		"1_1J1ajRKr7wbm8ERfhXCnoTjSbZBhds6HRQ": 1,
		"1_1KGXyTfCaaiFWrqoUeY1ku5ULVnEatNhpE": 1,
		"4_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"3_14GnsKSrGzRNRMEWtUAZRyYoKtciv211cL": 1,
		"31_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"23_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"6_1yXxrH58KKbqpyLDfy26nxeTLwSZnan5f": 1,
		"64_12e4EcUWaMHVa31rkuzWWxstByasqAp7RV": 1,
		"9_16cHYtC8kNdRu59xsaXRtM9qjQU38kn253": 1,
		"96_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": 1,
		"1_1G9zSma9ku5MpqT26vFf95BEidzudtoSTr": 1,
		"7_1CoMVWZDiGBYRBfViuCs3d5ECGhP9zaSuw": 1,
		"1_1B4wXqC3MmyVxavFzDb8iCPCsY96mUYwGy": 1,
		"8_1G9zSma9ku5MpqT26vFf95BEidzudtoSTr": 1,
		"145_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": 1,
		"303_1N2eNZ5w1dpoBcwatsSuTaeNzHgSLjyrpU": 1,
		"2_1AWX3eVrga65Yph9HX5BKHQjpXQFVNVBGF": 1,
		"31_1Q3pgQCFsrCkLWpdVZ7FihSuHHVistLBEA": 1
	}
}