{
	"file": {
		"2018.05.21.03.Polityka-Wspcz. Jan Zbigniew Potocki cz.3-[16,3min]-.mp4": {
			"title": "2018.05.21.03.[PL]-Polityka-Współcz. Jan Zbigniew Potocki cz.3-[16,3min]-",
			"type": "video",
			"description": "Podsumowanie poprzednich odcinków czyli kwintesencja kantu na grubą kasę.Robienie kariery politycznej.",
			"is_featured": 0,
			"image_link": "http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/data/users/1FZYhmAxsjUgUsDb3maysDUc9nRjfJNQm5/youtube.gif",
			"size": 32396511,
			"date_added": 1539167619
		},
		"2018.01.03.05.Zdrowie-dzieci-Zimba-Jestem zawiedziony postaw pol.Kocioa-[15,2min]-.mp4": {
			"title": "2018.01.03.05.[PL]-Zdrowie-dzieci-J.Zięmba-Jestem zawiedziony postawą pol.Kościoła-[15,2min]-",
			"type": "video",
			"description": "Apel-do lekarzy-Skuteczność leczenia-Informacje zabronione-Nasze dzieci.",
			"is_featured": 0,
			"image_link": "http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/data/users/1FZYhmAxsjUgUsDb3maysDUc9nRjfJNQm5/youtube.gif",
			"size": 47432430,
			"date_added": 1539172415
		},
		"2019.01.17.01.Muzyka-Gitara elektr.Last of the Mohicans-[5min]-.mp4": {
			"title": "2019.01.17.01.[PL]-Muzyka-Gitara elektr.Last of the Mohicans-[5min]-",
			"type": "video",
			"description": "Mistrzowskie wykonanie przeboju na gitarze elektrycznej.",
			"is_featured": 0,
			"image_link": "http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/data/users/1FZYhmAxsjUgUsDb3maysDUc9nRjfJNQm5/youtube.gif",
			"size": 19210165,
			"date_added": 1547851454
		},
		"2019.05.03.[EN]-The Persecution of David Noakes  Lyn Thyer-[86min]-.mp4": {
			"title": "2019.05.03.[EN]-The Persecution of David Noakes & Lyn Thyer-[86min]-",
			"type": "video",
			"description": "David Noakes and Lyn Thyer are being persecuted by Big Pharma for developing & producing an EXTREMELY EFFECTIVE CANCER TREATMENT ... This is THEIR STORY!",
			"is_featured": 0,
			"image_link": "img/media.gif",
			"size": 243185781,
			"date_added": 1556893342
		},
		"2019.01.17.01.[PL]-Muzyka-Gitara elektr.Last of the Mohicans-[5min]-.mp4": {
			"title": "2019.01.17.01.[PL]-Muzyka-Gitara elektr.Last of the Mohicans-[5min]-",
			"type": "video",
			"description": "No information",
			"is_featured": 0,
			"size": 19210165,
			"date_added": 1566502266
		},
		"2017.04.15.01.[PL]-Polityka-Szokujcy wywiad z Rabinem Abe Finkelsteinem-[56min]-.mp4": {
			"title": "2017.04.15.01.[PL]-Polityka-Szokujący wywiad z Rabinem Abe Finkelsteinem-[56min]-",
			"type": "video",
			"description": "Ciekawy wywiad przeprowadzony po między tą samą rasą człekokształtnych. ",
			"is_featured": 0,
			"size": 118052213,
			"date_added": 1566990530
		}
	},
	"comment": {
		"1542132835_1FZYhmAxsjUgUsDb3maysDUc9nRjfJNQm5": [
			{
				"body": "Z historją ,to jest zawsze trochę nie wiadomo. Kto mówi prawdę? a kto kłamie? Ale wraz z upływem czasu,zaczynają wypływać fakty,które kiedyś były tajemnicą.Dopiero wtedy okazuje się jak było naprawdę.A na niektóre fakty trzeba bardzo długo czekać.I mogą nigdy nie wypłynąć.Ciekawa historia widziana oczami świadków.Oraz druga strona która chciała coś ukryć zatuszować,oraz jej niejasne  cele.To rzutuje światło na całość sytuacji. Pytanie zasadnicze,czy byli tam ludzie i ile ich tak naprawdę było?Brak jakich kolwiek znalezionych zwłok,oraz części  w innym rejonie oceanu?Wiele zagadek,wiele pytań,bardzo wiele domysłów.Jeśli podjołeś się obejrzeć ten film,spróbuj odpowiedź znaleźć samemu.",
				"date_added": 1542138741
			},
			{
				"body": "Z historią ,to jest zawsze trochę nie wiadomo. Kto mówi prawdę? a kto kłamie? Ale wraz z upływem czasu,zaczynają wypływać fakty,które kiedyś były tajemnicą. Dopiero wtedy okazuje się jak było naprawdę. A na niektóre fakty trzeba bardzo długo czekać.I mogą nigdy nie wypłynąć. Ciekawa historia widziana oczami świadków. Oraz druga strona która chciała coś ukryć zatuszować,oraz jej niejasne  cele. To rzutuje światło na całość sytuacji. Pytanie zasadnicze,czy byli tam ludzie i ile ich tak naprawdę było? Brak jakich kolwiek znalezionych zwłok,oraz części  w innym rejonie oceanu? Wiele zagadek,wiele pytań,bardzo wiele domysłów. Jeśli podjąłeś się obejrzeć ten film,spróbuj odpowiedź znaleźć samemu.",
				"date_added": 1542139342
			}
		],
		"1542236629_1FZYhmAxsjUgUsDb3maysDUc9nRjfJNQm5": [
			{
				"body": "Tak,piękne czasy. Ta muzyka -  jak się słucha, nogi same zaczynają tańczyć. Te dziewczyny i prywatki do białego rana. Piękne wspomnienia. Kto tak potrafi tańczyć dzisiaj?",
				"date_added": 1542238482
			}
		],
		"1542922363_1FZYhmAxsjUgUsDb3maysDUc9nRjfJNQm5": [
			{
				"body": "Wikileaks - niebezpieczna prawda. Ściśle tajne dokumenty wojskowe USA  zostały odtajnione - Wikileaks – odtajnia  dokumenty USA - Film dokumentalny - cały film - lektor PL - dane z wojny w IRAKU – i nie tylko  - Cała prawda o polityce prowadzonej przez Stany Zjednoczone wobec innych państw . Zapraszam do oglądania - doskonale dokument przedstawia co się dzieje w polityce i jak jesteśmy manipulowani przez media. To co widzisz w telewizji, nie do końca jest prawdą, a Ty słyszysz to co masz słyszeć i widzieć. Obejrzyj dokument i sam oceń wszystko !",
				"date_added": 1542923346
			}
		],
		"1543846691_1FZYhmAxsjUgUsDb3maysDUc9nRjfJNQm5": [
			{
				"body": "Witam; Pomału wszystkich biorą za pysk. Kwestią czasu jest kiedy dobiorą się do nas. W tym filmie mówi i tak naprawdę nie wynika nic z tego.Co on ma na myśli, co chce zasugerować?O jakich możliwościach jest mowa?",
				"date_added": 1544024620
			}
		],
		"1543176010_1FZYhmAxsjUgUsDb3maysDUc9nRjfJNQm5": [
			{
				"body": "Witam; Na razie nabierają wprawy. Następny pójdzie szybciej i sprawniej. Dopiero się uczą. Tyle elektroniki, i zabezpieczeń, i wszystko o kant dupy rozbić. Chyba dobry łańcuch i solidna kłótka lepiej by zabezpieczyła. Albo zrobić tak jak JAŚ-FASOLA-  Kierownicę zabrał ze sobą do domu. I wtedy niema mocnych.",
				"date_added": 1544024969
			}
		],
		"1542407438_1FZYhmAxsjUgUsDb3maysDUc9nRjfJNQm5": [
			{
				"body": "Ładnie pojechali. Trochę umiejętności potrzeba jednak mieć. Ciekawe jak długo ćwiczyli? I ile pokiereszowali samochodów? W sumie to są artyści. Pełną gębą.",
				"date_added": 1544025300
			}
		],
		"1543176292_1FZYhmAxsjUgUsDb3maysDUc9nRjfJNQm5": [
			{
				"body": "Dobre pytanie. Kto liczy głosy? Ten liczy kto ma władzę. Najbardziej to podoba się mnie, to powiedzenie ,że kobiety do 35-lat należą do wszystkich. To taki żart ( ponury ). Krótko ,to wszystko to nazywa się depopulacja pełną gębą. Można do ludzi nie wiem jak apelować. Nic do nich nie dociera. Są ślepi i głusi, są bez rozumni. Jak w końcu się obudzą , a tu ręka jest w nocniku. Reasumując  straszne  są te wyliczenia , gdzie idą te pieniądze. Tak jakby idą za granicę. Przewlekłe leczenie -  i zastrzyk śmierci na koniec. Strach iść do szpitala? Można pójść i już nie wrócić. Wniosek, lepiej zostać w domu i samemu się leczyć. Dużo ciekawego materiału. ",
				"date_added": 1544026231
			}
		],
		"1545144386_1EyH4ytbpPAq8QVXdL9Rowg8tL5t6EsDG9": [
			{
				"body": "Muzyka; Jaki styl to nie za bardzo wiem. Kiedyś na dyskotekach była taka muzyka. No cóż starość powoduje ,ze wolę coś bardziej spokojnego bardziej dla ciała i duszy. Teraz już taka muzyka mnie meczy. Ale to jest wszystko rzecz gustu.  Jeden lubi córkę a drugi  teściowę.  Taki żart,  Ważne że jest muzyka, lubię muzykę. Dobrze by było żeby krótki opis dać co to za muzyka.  Pozdrawiam.",
				"date_added": 1545263701
			},
			{
				"body": "Muzyka; Jaki styl to nie za bardzo wiem. Kiedyś na dyskotekach była taka muzyka. No cóż starość powoduje ,ze wolę coś bardziej spokojnego bardziej dla ciała i duszy. Teraz już taka muzyka mnie meczy. Ale to jest wszystko rzecz gustu.  Jeden lubi córkę a drugi  teściowę.  Taki żart,  Ważne że jest muzyka, lubię muzykę. Dobrze by było żeby krótki opis dać co to za muzyka. To nie jest , że się czepiam  ale dobrze by było  trochę rozruszać  YouTube żeby aktywować ludzi, To przyciągnie następnych. Jak będzie nas dużo, to nabierzem siły.            Pozdrawiam.",
				"date_added": 1545263964
			}
		],
		"1546730476_1At298vUijuhjA2GtqXEydC8csRnhETzdH": [
			{
				"body": "Powiedział prawdę, to się nie spodobało. Z nazwiska wymienił sprawców. A na sali śmiech, Są pewni swojej nietykalnosci. A dokumenty nie ujrzały światła dziennego, bo ten co przechowywał  dokumenty był agentem sł. spec.",
				"date_added": 1546790232
			}
		],
		"1546902077_1At298vUijuhjA2GtqXEydC8csRnhETzdH": [
			{
				"body": "Przestępcom się nie grozi; Popatrzcie na te twarze, na sali sejmowej. Śmieją się do rozpuku z Lepera. On jeden chce sam walczyć z mafią, to jest w tym kraju absolutnie nie możliwe. Jeszcze nikomu to się nie udało, i jemu to nie mogło sięe udać. Musiał zginąć, takie jest bandyckie prawo. Jesteś z nami?  jeśli - NIE- , to znaczy jesteś przeciw -NAM- . Zasadą jest, mało mówić - a dużo  robić. Szkoda człowieka.",
				"date_added": 1546968163
			}
		],
		"1546811693_1At298vUijuhjA2GtqXEydC8csRnhETzdH": [
			{
				"body": "Ciekawy punkt widzenia? Czy tak naprawdę jest? A może jest inaczej. Nauka drepcze w miejscu. A ci co mają -WIEDZĘ – na ten temat,milczą przekornie. Bardzo trudno jest walczyć z kłamstwem. Kłamstwo powtarzane wiele razy staje się prawdą i wszyscy zaczynają  w to wierzyć. W tym miejscu nie ma już miejsca  na naukę, która zresztą jest utrzymywana ( dotowana ), za pieniądze najbogatszych. Mają pieniądze, mają władzę, tworzą religie, tworzą wiarę. Więc ona musi być tworzona na zamówienie. I tak została  utworzona. A w efekcie mamy co mamy, głupota która urosła do wielkości „Mont Everestu”. ",
				"date_added": 1546976749
			}
		],
		"1546811711_1At298vUijuhjA2GtqXEydC8csRnhETzdH": [
			{
				"body": "Dobrze opisane. Szkoły wyznaniowe, wirus wiary. Dzieci uwierzą we wszystko co im się powie. Potem zrobią wszystko, to czego ich nauczono. Stają się, jak  roboty. Nie potrafią samodzielnie myśleć, jako dorośli ludzie. Choć wydaje się im, że myślą samodzielnie. To tylko wydaje się „IM”.",
				"date_added": 1546983517
			}
		],
		"1547033752_1At298vUijuhjA2GtqXEydC8csRnhETzdH": [
			{
				"body": "Porusza ważne tematy; ale nie jest to do końca prawda. Jego wiedza pochodzi tylko z jednej strony. Albo niewie? Albo idjota?/",
				"date_added": 1547057136
			}
		],
		"1548694134_19mLKVaQ1tZmZcKnmfPhrAHXK5aqeTDzg1": [
			{
				"body": "Nie odnaleziono wideo w obsługiwanym formacie i typie MIME.",
				"date_added": 1552780412
			}
		],
		"1553459973_1PMJncxnJAR5UnoxHX7ymFrEZEedmbSdku": [
			{
				"body": "To nie jest okropne; To jest zrobione z premedytacją, i celowe. Europa już nie jest krajem cywilizowanym. ",
				"date_added": 1553532785
			}
		],
		"1553777592_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"body": "Bardzo ciekawe, i interesujące, doświadczenie. Ciekawe jak zadziała coś takiego na większą skalę? Pozdrawiam autora.",
				"date_added": 1553871672
			}
		],
		"1553432009_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"body": "Oczeń horoszo. Spasiba.",
				"date_added": 1553872051
			}
		]
	}
}