{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1617087999_16u7ApvQbcH9sGVJV5ELBvY1AQiZLnbDKN": 1
	},
	"next_comment_id": 14,
	"comment": {
		"1618959746_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG": [
			{
				"comment_id": 1,
				"body": "Completely based, who cares why they dunnit",
				"added": 1619053899
			},
			{
				"comment_id": 7,
				"body": "> [houtje](#comment_62_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA): opinion discarded\n\n>name is a string of letters\n>has a cry \n5g is no better than 4g, and has a slew of issues, it is more expensive, and the only upside in the governments point of view is an increased ability to spy. there is a mountain of evidence supporting claims 5g is unsafe as well, so yes, I could care less why lefties did the kabangbang, its good for all of us",
				"added": 1619115987
			},
			{
				"comment_id": 10,
				"body": "> [houtje](#comment_65_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA): They literally did a miserable FOUR antennae... this was a symbolical act and they didn't do it for the right reason so it means jack shit. Sorry captaincumslut.  [...]\n\nand how many did you firebomb again?\nkek",
				"added": 1619126032
			},
			{
				"comment_id": 13,
				"body": "> [houtje](#comment_66_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA): 'member when they set those 5G towers on fire in Bongland, last year? 'member how they used it to portray conspiracy theorists as crazy and dangerous? If you burn a tower, it is purely a symbolical act. But if the symbol is condemned by mass media... then what the fuck is the point?  [...]\n\nsee I'm of the opinion that post riggening the average person wherever they live has had it revealed to them how awful the media and the police states in general they live in, I've yet to see someone actually agree with the media this year outside of bot generated autism on various social media sites, I can't see optics being a useful consideration anymore when people don't trust what they're told about events",
				"added": 1619200285
			}
		],
		"1618008531_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "I want to get linux running but i have a shitsung galaxytab, so i guess ill replace it soon",
				"added": 1619054022
			}
		],
		"1572478148_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 3,
				"body": "I've been shilling it on pol because frankly the rest of the web is broken,I think if we come from the chans we don't give a shit about le bully",
				"added": 1619054269
			}
		],
		"1617087999_16u7ApvQbcH9sGVJV5ELBvY1AQiZLnbDKN": [
			{
				"comment_id": 4,
				"body": "thats awesome, good job!",
				"added": 1619054603
			}
		],
		"1618903442_1ExytFkUZYj844g1P5D3USjzzczUdHvm9E": [
			{
				"comment_id": 5,
				"body": "is this like that time a fed samefagged on 8chan for 60 fucking posts trying to get someone to say something illegal? what the kek",
				"added": 1619109795
			}
		],
		"1619113988_14E5dZE7svnmyJGuhStVqtuFGrXkXBeGWv": [
			{
				"comment_id": 6,
				"body": "he's dead, i don't think he cares",
				"added": 1619115503
			},
			{
				"comment_id": 11,
				"body": "I don't know who inspired him, but he was a cool dude at least",
				"added": 1619128854
			},
			{
				"comment_id": 12,
				"body": "> [leonarddurden](#comment_2_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD): Was he a cool dude though?\n\nhe asked the real questions, and didn't just sit in the white man bad npc camp, most people who like him think the illuminati/jews/your particular poison had him killed",
				"added": 1619163498
			}
		],
		"1616487804_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 8,
				"body": "> [warfare](#comment_51_14E5dZE7svnmyJGuhStVqtuFGrXkXBeGWv): Alex Jones like to pretend that all the ouighors are in death camp waiting to be organ harvested. What alex jones the liar of the nwo, pedotrump sucker doesn't tell you, beyond that it's only the terrorists (those who commited act of violence against the people of china (Which for the low iq includes the oygors)... [...]\n\nyou need to see a therapist",
				"added": 1619116111
			}
		],
		"1619121928_19AuD3C3VusewLWehweVi29XupaG5TkPVC": [
			{
				"comment_id": 9,
				"body": "with all the unrest it wouldn't make sense to destroy viable civilian communications in the usa so i doubt they will, this is all very interesting though",
				"added": 1619124515
			}
		]
	},
	"comment_vote": {
		"38_14E5dZE7svnmyJGuhStVqtuFGrXkXBeGWv": 1,
		"10_1F5H5zYxjS7G4C66ajhZLjkD8yvBHCwBJG": 1
	}
}