{
	"title": "ShadowTux Blog",
	"description": "My Personal Blog.\nEnglish is my second language.\nI'm a geek and like to watch a lot of series and movies. \nI also like InfoSec\nEuropean",
	"links": "- [AirVPN](https://airvpn.org/?referred_by=229034)\n- [Donate Some Doge](dogecoin:DTTmThbGKgLKsNCo7eT6ZtrGht4danRMyc)\n- [Donate Some BTC](bitcoin:15HS6tzvuptiVVb2SduxALHV4kEjHwveU9)\n- [Contact Me](http://127.0.0.1:43110/Mail.ZeroNetwork.bit/?to=shadowtux)\n",
	"next_post_id": 21,
	"demo": false,
	"modified": 1584799840,
	"post": [
		{
			"post_id": 20,
			"title": "Folding@Home",
			"date_published": 1584794812.425,
			"body": "If somebody hasn't already heard about of Folding@Home it is a distributed computing project for simulating protein dynamics, including the process of protein folding and the movements of proteins implicated in a variety of diseases. \n  I've ran the software here and there about 3,5 years now. During this     COVID-19 outbreak I now have started folding again with my few extra computers that I have laying around. I suggest that you should start folding tool. You can download the software from <a href=\"https://foldingathome.org/start-folding/\">Folding@Home Website</a>. Here's also the files on ZeroNet click <a href=http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1MCsyW6W243LY69ZYm99XbV3M8Gbbrp5hF/1584795861-FoldingAtHome.zip>HERE</a>\nand on IPFS: Click <a href=\"https://ipfs.io/ipfs/QmS1oH7nhyQVKJQ7n9kQXjrZdnCDfFmyD8qwBKax3oQ2aM\">HERE</a>\n  I suggest you to join LTT Team: 223518"
		},
		{
			"post_id": 19,
			"title": "Bought a Mac Mini 2018",
			"date_published": 1555071151.239,
			"body": "About a month ago I bought a Mac Mini 2018 with 6 core i7, 16GB Ram, 512GB SSD  as my new main computer. I some times move a lot of files and my old computer with Linux Mint wasn't able move files and do basic stuff at the same time. I feel that when moving files this is about 2x faster than the old computer. Soldered NVME SSD might have to do something with it but at least I can do more than one task at a time. All tho I had i5-4690, Nvidia GTX 1060, 480GB SSD and 16GB ram I feel that this is a major upgrade even without and external graphics card that I'm probably going to get in the future. \n  I've never owned proper Mac before so this is little learning curve but coming from linux I find MacOS quite similar. It's probably the unix base that MacOS. I noticed some time ago that I didn't want to tinker with my main computer anymore and wanted it to just work. I use mainly windows at work and can say that it has many problems still so that's why I decided to go with a Mac. \n  So far I'm very happy. I've haven't noticed many bugs or hiccups and has worked like a charm."
		},
		{
			"post_id": 18,
			"title": "A new cable modem, Google WiFi, 700Mbps internet connection = Awesome",
			"date_published": 1543416684.97,
			"body": "Less than a year ago I fought with my ISP that they have given me a broken modem they offered to change it to a new one. I was quite a surprised  because the modem that I had was about 4 years old and out of warranty. The complaining to it ISP was worth it I guess. \n  When the new one arrived the setup was normal plug it in and wait some time and the internet started working again. That was the first time when I had 5Ghz WiFi also and it was the full network speed 100Mbps that I had at that time I was very happy with it. \n  Few weeks later the modem started having the same problems as the old one had. Dropped out of the internet and I had to manually restart the modem to get it working again. I contacted the ISP again and said what I was experiencing. They did some repairing on their end to get it working as it should. No more internet outages for this house for now. \n  Half a year later my ISP enabled faster speeds to my area. The speeds that they promise are 700-300Mbps. I decided that I had to have the fastest available internet. I upgraded the internet as soon as I could get it. When the upgrade happened the speed was and still is very fast. I get about 650-300Mbps Download and 60-50Mbps Upload speed depending on the time of the day.\n  The WiFi speeds that I got when I tested it with my phone OnePlus 6 and iPad mini 4. I could only get Max 250Mbps download speeds with the cable modem WiFi so I looked in to buying WiFi router. My house is not that big so I thought that I only might need quite cheap one that support 1200 AC but I wasn't sure that when there's a lot of load on the WiFi it wouldn't crash or something so I decided to look into mesh router. I compared all the modern consumer mesh routers and decided to buy Google WiFi and oh boy it has been working for 2 and a half months nonstop and keeps working. The WiFi speeds are the same as the wired speed at that time of the day. I must say I'm impressed with the device."
		},
		{
			"post_id": 17,
			"title": "Updating Graphics Card and moving to 4k era",
			"date_published": 1511807739,
			"body": "On Black Friday I bought new Nvidia GTX 1060 OC 3GB graphics card. It was on sale at 199€ price point so I had to take the opportunity to buy it. The installation process was quite easy process. Take the old GTX 750 ti out and put the new one in. \n  I use linux so I do not need to update any of the drivers. It just works out of the box. \n  I'll be buying new 4k display in few days so it might me little challenge to fix the scaling to good position. I still haven't found a setting that would zoom the display 4 times the normal and scale it on the one screen only."
		},
		{
			"post_id": 16,
			"title": "Why I hate my ISP",
			"date_published": 1497349211,
			"body": "I have 100Mpbs down and 5Mbps upload on my internet contract. This only seems to be working only 46Mbps/5Mbps. Some times the whole internet is down and my ISP doesn't even know that. I've asked my ISP on twitter that why is internet down in the whole area. They answered that it's may have been a malfunction in a system but they don't know why. This happened today after mid night.\n  I've called my ISP multiple different times and said that my internet is slow and asked why is that. They've said that they would look in to that. In a couple of days the internet speed goes close to my full internet speed but it only lasts for a week or two.\n  I'm just getting tired for this. I just want an intenet connection what I'm paying for. Even tho I would have 50/5 intenet for the reason that they could not provide better but why they then are providing 10/1, 50/5, 100/10 and 200/20 speeds and not only 10/1 and 50/5 that they are able to provide."
		},
		{
			"post_id": 15,
			"title": "Same data on all of my devices with Resilio Sync",
			"date_published": 1488441585.985,
			"body": "I have Resilio Sync running on one of my servers to sync all my important data for example my school work. If I do a change on my computer and save it. Then it will automatically update to the sync and when I get home all my files will be synced from the VPS to my main PC. This way I don't have to worry about losing any of my data or think where I've put some file. They are all in the same folders in every computer that I have because of Resilio Sync. If I delete some file by accident it will go automatically to the archive folder under \".sync\" folder where I can restore the file. This archive feature can also be turned off if you are working on bigger files that will fill up your PC. I've been using Resilio Sync (former BitTorrent Sync) for the past few years and I've noticed that this is the most fastest and the most easyest way to move files between computers. "
		},
		{
			"post_id": 14,
			"title": "Paying with your mobile phone",
			"date_published": 1487577543,
			"body": "I've recently got interested in mobile paying and its implications. It would be very useful to just tap your phone in to the paying terminal and go on with your day. But I've discovered that in order to make these available in stores you need to buy a device that you tap. Yes it's the same kind of thing that's already on many paying terminals but seller needs to buy a new one to process that kind of transactions. And when I'm trying to find out where I can pay with my phone in stores. It only shows McDonald's. It'll be interesting to see how the people and companies integrate these to their services. "
		},
		{
			"post_id": 13,
			"title": "My fault",
			"date_published": 1486972695,
			"body": "Today I may have lost all my school work while trying to install YunoHost on my VPS. Installing YunoHost you need Debian 8 run it. Before I had Ubuntu 16.04 on that server. So I decided to install Debian 8. After installing Debian on that VPS I remembered that I had all my school work on it. I sent a support ticket to the VPS provider. Now we shall see if I get my school work back.\n\nUpdate: I didn't get any of my school works back from the VPS provider. Now I shall do my school work all over again that I have not returned yet. Also I didn't pay for them to backup my stuff. What I've learned today that you should always backup your stuff even tho you firstly think that you don't have anything important on that device or server you should still backup. \n\nUpdate: I've passed all those courses that I had stuff on that VPS. :D"
		},
		{
			"post_id": 12,
			"title": "Controlling all the services is time consuming",
			"date_published": 1486972652,
			"body": "I'm using few different VPS:es to manage my files and websites on day to day bases. This is sometimes quite hard to manage and watch what's on what VPS. Every single one of my VPS and other websites/domains are on a different service. Why they use different service you ask? Because that service at a time of buying is the cheapest and the best alternative on that kind of use. My goal is to organize how I manage them. First thing is that I put all the VPS and website services in same bookmarks folder so I don't forget to pay or manage them. Second thing may be to put them under same email address. Maybe create new Email address to just manage my web services all together. In this blog I'll be updating this how I manage them and my other life regarding to technology."
		},
		{
			"post_id": 11,
			"title": "New shows that I've found interesting",
			"date_published": 1476872391,
			"body": "<li>Westworld</li>\n<li>Timeless</li>\n<b>Westworld</b> is a new series that can be found on HBO. It's about Robots that don't know they are robots. They think they are humans. If you find it interesting here's the link to the trailer: <a href=\"https://www.youtube.com/watch?v=IuS5huqOND4\"><b>Link</b></a>\n\n<b>Timeless</b> is about time travelling and catching the bad guy that changes the present time and trying to erase one thing form existing. Here's the <a href=\"https://www.youtube.com/watch?v=zSYZJGAGvww\"><b>Link</b></a> to the trailer. "
		},
		{
			"post_id": 10,
			"title": "Samsung Galaxy S7 after 2 months",
			"date_published": 1464190925.683,
			"body": "I bought my Galaxy S7 about 2 moths ago and I upgraded from LG Nexus 5. There was some noticeable performance boost compared to Nexus 5 but benchmark wise there was huge boost in performanse on antutu. I got about 3600 points on nexus 5 but on Galaxy S7 I got a score of 130000. I have rooted my nexus 5 and installed Cyanogenmod on it. But with my new S7 I haven't rooted it yet. I have had temptation to do it but I'm not ready to lose my data yet. This is my first Samsung device and I'm very satisfied with it. On the first day I installed Google Now Launcher and the basic social media apps like twitter and instagram. On the following week I installed Zeronet on it and it was quite easy to do with <a href=\"http://127.0.0.1:43110/1CiAFnnf6kb2G1GzDV1FhttTWNxCa4mShn/?Post:38:ZeroNet+on+Android+\">Musickiller's guide on his zite</a>. I've noticed only one fixable downside: it's very slippery. Over all it's fast and high-end android phone with Samsung's skin on top of it. I recommend this product."
		},
		{
			"post_id": 8,
			"title": "Batman V Superman \"Review\"",
			"date_published": 1459001175,
			"body": "There was the Batman part of the movie, the Superman part of the movie and fighting scenes. I liked the Superman and the fighting parts most because I've seen Batman origin from 5 different series and movies with different actors. \n I didn't like the first half of the movie but the second half was action packed and more to my liking. \n My favorite part of the movie was when Bruce opens Lex Luthor's files which he stole few scenes ago. In the files he discovers Wonder Woman, Flash, Aquaman etc. The files are a sneak peek to future films from the DC. I got goose bumps when I saw Wonder Woman on the big for the first time. All in all it was a good movie. I'll give it 80% on Rotten Tomatoes scale. Now I just need to wait a year for this to continue. But first I need to see Wonder Woman -movie next year. :D\n\nHere's the DC movie release date schedule form Wikipedia:\n<img border=\"0\" alt=\"W3Schools\" src=\"img/dcreleaseschedule.png\" width=\"500%\" height=\"500%\">"
		},
		{
			"post_id": 7,
			"title": "Batman V Superman",
			"date_published": 1458760883.512,
			"body": "Going to see it on friday. Hopes are high so hopefully it satisfies :D\n<img border=\"0\" alt=\"W3Schools\" src=\"img/b-vs-s.jpg\" width=\"80%\" height=\"80%\">"
		},
		{
			"post_id": 6,
			"title": "Grimsby movie review ",
			"date_published": 1457873415.082,
			"body": "<img border=\"0\" alt=\"W3Schools\" src=\"img/grimsby.jpg\" width=\"40%\" height=\"40%\" align=\"left\">Well.. Hmmm.. How could I start this? Well There's two brothers and at first they both live in Grimsby, England. And their parents die and they go to foster home and only one of the boys get adopted. The adopted one grows up to be agent and the other non adopted one grows to be a dumass at Grimsby. After 28 years of searching his little brother (the adobted one Sebastian) Nobby found him in WHO Conference where Sebastian is trying to protect the leader of WHO. But when Nobby finds him he accidentally shoots the leader of the organisation and then they go to adventure to find the real killer of The WHO leader to South Africa and Latin America. I liked the movie and I recommend it to all little dirty minded people that can laugh to a poop jokes. I give the movie 65% on rotten tomatoes scale :D "
		},
		{
			"post_id": 5,
			"title": "I like to watch a lot of series",
			"date_published": 1457542333.239,
			"body": "At the moment I'm watching:\n<ul><li>Arrow</li><li>The Flash</li><li>Super Girl</li><li>Shadow Hunters</li><li>Marvel Agents of S.H.I.E.LD</li><li>Super Girl</li><li>DC's Legends of Tomorrow</li><li>The 100</li><li>Colony</li></ul>There's quite a lot watching during the week. My all time favorite series at the moment is recently ended The Shannara Chronicles. I liked the music, filming angles lot's of other things of the show. I'm a Geek. :D "
		},
		{
			"post_id": 4,
			"title": "How I found ZeroNet\n",
			"date_published": 1457523414.899,
			"body": "I found ZeroNet throug TorrentFreak. Yes I know some people found it first by searching services like ZeroNet. Since I found this place I've been here everyday. Hell I'm even writing this on school. :D At the moment I can get more attention here than on normal website."
		},
		{
			"post_id": 1,
			"title": "I Guess this is my first blog post on ZeroNet.",
			"date_published": 1457520979,
			"body": "Sooo.. Hello World! Agess :D"
		}
	]
}