{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Por que combater a reforma da previdência de Bolsonaro?",
			"body": "- https://invidio.us/CVSvbQEuo30\n- https://gateway.pinata.cloud/ipfs/QmZZ1XkFckxZXR4mAYgRejW8EmfF12pcmmdG83z9w2UiHe",
			"added": 1576548779
		},
		{
			"topic_id": 2,
			"title": "A quem interessa o desmonte do Brasil?",
			"body": "- https://invidio.us/5yYk7YTnKdo\n- https://gateway.pinata.cloud/ipfs/QmQ3FCM6xSGWQ1Hox1CACL7YSGcNmqkxUrMwFqFNgJb6gU",
			"added": 1576551589
		}
	],
	"topic_vote": {
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": 1,
		"8_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"1_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": 1,
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": 1,
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1,
		"1_191jE4Non1JY7Ux14wbD1vy4kwxDRJGbGe": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"2_191jE4Non1JY7Ux14wbD1vy4kwxDRJGbGe": 1
	},
	"next_comment_id": 31,
	"comment": {
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 1,
				"body": "#Por Que Socialismo?\nAlbert Einstein explica, de maneira clara e objetiva, os problemas fundamentais que enxerga na sociedade capitalista e porque uma sociedade socialista poderia ser o caminho para superá-los.\n- https://telegra.ph/Por-Que-Socialismo-12-16-3\n\n#O Projeto Socialista e a Classe Trabalhadora\n“As pessoas na Esquerda estão unidas em seu objetivo de uma sociedade em que cada indivíduo encontre meios aproximadamente iguais para o pleno desenvolvimento de suas capacidades diversas. O que distingue os socialistas é o reconhecimento de que a forma específica como a sociedade está organizada para reproduzir a si mesma também reproduz grandes desigualdades sociais nos padrões de vida, emprego, condições de trabalho, saúde, educação, habitação, acesso à cultura, meios de desenvolvimento e frutos do trabalho social, etc.“\n- https://telegra.ph/O-Projeto-Socialista-e-a-Classe-Trabalhadora-12-16-3\n\n#O País Já Não é Meio Socialista?\nNão, Socialismo não é só sobre mais governo – é sobre propriedade e controle democráticos.\n- https://telegra.ph/O-País-Já-Não-é-Meio-Socialista-12-16\n\n#Pelo Menos o Capitalismo é Livre e Democrático, né?\nPode parecer que é assim, mas Liberdade e Democracia genuínas não são compatíveis com o Capitalismo.\n- https://telegra.ph/Pelo-Menos-o-Capitalismo-é-Livre-e-Democrático-né-12-16\n\n#O Socialismo Soa Bem na Teoria, Mas a Natureza Humana Não o Torna Impossível de Se Realizar?\nNossa natureza compartilhada na verdade nos ajuda a construir e definir os valores de uma sociedade mais justa.\n- https://telegra.ph/O-Socialismo-Soa-Bem-na-Teoria-Mas-a-Natureza-Humana-Não-o-Torna-Impossível-de-Se-Realizar-12-16\n\n#Os Ricos Não Merecem Ficar Com a Maior Parte do Seu Dinheiro?\nA riqueza é criada socialmente – a redistribuição apenas permite que mais pessoas aproveitem os frutos do seu trabalho.\n- https://telegra.ph/Os-Ricos-Não-Merecem-Ficar-Com-a-Maior-Parte-do-Seu-Dinheiro-12-16\n\n#Os Socialistas Vão Levar os Meus CDs do Calypso?\nSocialistas querem um mundo sem Propriedade Privada, não sem Propriedade Pessoal. Você pode guardar seus discos.\n- https://telegra.ph/Os-Socialistas-Vão-Levar-os-Meus-CDs-do-Calypso-12-16\n\n#O Socialismo Não Termina Sempre em Ditadura?\nO Socialismo é muitas vezes misturado com autoritarismo. Mas historicamente, Socialistas tem estado entre os defensores mais convictos da Democracia.\n- https://telegra.ph/O-Socialismo-Não-Termina-Sempre-em-Ditadura-12-16\n\n#Um Mundo Socialista Não Significaria Só Uma Crise Ambiental Maior Ainda?\nSob o Socialismo, nós tomaríamos decisões sobre o uso de recursos democraticamente, levando em consideração necessidades e valores humanos, ao invés da maximização dos lucros.\n- https://telegra.ph/Um-Mundo-Socialista-Não-Significaria-Só-Uma-Crise-Ambiental-Maior-Ainda-12-16\n\n#O Socialismo Não é Só Um Conceito Ocidental?\nO Socialismo não é Eurocêntrico por que a lógica do Capital é universal – e a resistência a ela também.\n- https://telegra.ph/O-Socialismo-Não-é-Só-Um-Conceito-Ocidental-12-16\n\n#E Sobre o Racismo? Os Socialistas Não Se Importam Só Com Classe?\nNa verdade acreditamos que a luta contra o Racismo é central para desfazer o poder da classe dominante. \n- https://telegra.ph/E-Sobre-o-Racismo-Os-Socialistas-Não-Se-Importam-Só-Com-Classe-12-16\n\n#O Socialismo e o Feminismo Não Entram às Vezes em Conflito?\nEm última análise, os objetivos do Feminismo radical e do Socialismo são os mesmos – Justiça e Igualdade para todas as pessoas.\n- https://telegra.ph/O-Socialismo-e-o-Feminismo-Não-Entram-às-Vezes-em-Conflito-12-16\n\n#Os Socialistas São Pacifistas? Algumas Guerras Não São Justificadas?\nSocialistas querem erradicar a guerra por que ela é brutal e irracional. Mas nós pensamos que existe uma diferença entre a violência dos oprimidos e a dos opressores. \n- https://telegra.ph/Os-Socialistas-São-Pacifistas-Algumas-Guerras-Não-São-Justificadas-12-16\n\n#Por Que os Socialistas Falam Tanto Sobre Trabalhadores?\nOs trabalhadores estão no coração do sistema capitalista. E é por isso que eles estão no centro da política socialista. \n- https://telegra.ph/Por-Que-os-Socialistas-Falam-Tanto-Sobre-Trabalhadores-12-16\n\n#O Socialismo Vai Ser Chato?\nO Socialismo não é sobre induzir uma branda mediocridade. É sobre libertar o potencial criativo de todos.\n- https://telegra.ph/O-Socialismo-Vai-Ser-Chato-12-16",
				"added": 1576515018
			},
			{
				"comment_id": 2,
				"body": "#Perestroika e glasnost na URSS\n\nO governo de Mikhail Gorbatchev à frente da União Soviética ocorreu entre 1985 e 1991, representando o fim da tentativa de construção do capitalismo de Estado soviético, chamado em alguns meios políticos de socialismo soviético.\n\nAs principais características da política interna do governo de Gorbatchev estiveram relacionadas a duas palavras russas que indicavam as tentativas de mudanças no sistema soviético: perestroika e glasnost.\n\nEm russo, perestroika tem o significado de reestruturação. A utilização da palavra tinha por objetivo indicar os caminhos a serem traçados para realizar mudanças estruturais na economia e na sociedade soviética. A economia da URSS não alcançou nas décadas de 1970 e 1980 os altos índices de crescimento econômico verificados em tempos anteriores. A situação era resultado do esgotamento das formas de organização social soviética, na qual a centralização política e econômica no Estado e no Partido Comunista impedia o desenvolvimento de mecanismos que garantissem o aumento da produtividade.\n\nJá a palavra glasnost tem por significado transparência e foi utilizada para representar o processo de abertura política que pretendia Gorbatchev e o grupo de burocratas soviéticos que o auxiliava. Era uma tentativa de dar um pouco de transparência aos mecanismos de decisão política da URSS, rigidamente controlada pela nomenklatura, a classe de burocratas que controlava a sociedade soviética.\n\nA perestroika e a glasnost eram, dessa forma, uma tentativa de Mikhail Gorbatchev de por fim à crise social pela qual atravessava a sociedade soviética. E essa crise estava relacionada com o próprio desenvolvimento da URSS.\n\nNo capitalismo, o aumento da produtividade é garantido principalmente com o aumento do consumo da classe trabalhadora. Isto se dá, pois, ao consumir os bens necessários à sua reprodução física, a classe trabalhadora impulsiona a produção material em todos os seus níveis, desde a agricultura, passando pela indústria, até os serviços que oferecem as condições para a efetivação desse consumo dos trabalhadores.\n\nPorém, a classe trabalhadora não consegue esse aumento de consumo “de mão beijada”. Ela ocorre geralmente após lutas por aumentos de salário e melhorias nas condições de trabalho. Geralmente essas lutas acontecem através de greves ou outras mobilizações que pressionam os capitalistas a atenderem as reivindicações dos trabalhadores.\n\nO aumento salarial quando é atendido diminui a margem de lucro dos capitalistas, que, por sua vez, são obrigados a encontrar maneiras de aumentar o seu lucro, para reproduzir a acumulação de capital, situação conseguida com o aumento da produtividade da classe trabalhadora. O aumento da produtividade é possibilitado, principalmente, através de inovações tecnológicas, necessitando, dessa forma, de investimentos em ciência e educação.\n\nPorém, para que esse sistema funcione de forma a garantir a reprodução do lucro dos capitalistas, é necessário que os trabalhadores possam expressar minimamente suas insatisfações, substituindo a repressão aberta das forças policiais e estatais pela negociação, principalmente através de sindicatos.\n\nTal situação era verificada nos países da esfera de influência do capitalismo dos EUA. O que havia na URSS era a repressão aberta contra os trabalhadores. As medidas de Gorbatchev, a glasnost e a perestroika, pretendiam mudar esse cenário, garantindo uma maior liberdade aos trabalhadores, mas também às oposições existentes dentro da própria burocracia do Partido Comunista, buscando uma descentralização das decisões que estavam nas mãos da nomenklatura.\n\n#O que houve na URSS não foi o socialismo ou o comunismo. O que houve foi a existência de um capitalismo não baseado na propriedade privada. O capitalismo soviético era baseado na propriedade estatal. Os dois tipos de capitalismo se assemelham por manterem como base de seu funcionamento a exploração econômica e social da classe trabalhadora.\n\n#No capitalismo de propriedade privada, a classe exploradora geralmente é associada à burguesia. No capitalismo de propriedade estatal, a classe exploradora é a burocracia de Estado. Em ambos os tipos de capitalismo, os trabalhadores estão afastados do controle dos meios de produção e do processo de trabalho.\n\nGorbatchev pretendia com a perestroika e com a glasnost resolver a crise que atravessava a URSS, mas foi incapaz de conter a desagregação do sistema soviético. Em 1991, tinha fim a URSS. E o tipo de capitalismo desenvolvido na esfera de influência dos EUA aparecia ao mundo como o vitorioso de uma disputa que marcou o século XX.\n\n- Fonte: http://brasilesco.la/b121880",
				"added": 1576515592
			},
			{
				"comment_id": 3,
				"body": "#Dicionário de Política - Norberto Bobbio, Nicola Mateucci, Gianfranco Pasquino\n\n O ponto de partida dos organizadores deste \"Dicionário\" é a ambigüidade da linguagem política: seus termos ganham significados diversos em contextos diferentes, tanto em função das mutações históricas que sofrem palavras como \"democracia\" ou \"déspota\", quanto da circunstância de não existir até hoje uma ciência política tão rigorosa que tenha determinado e imposto de modo unívoco e universal o significado dos vocábulos mais utilizados.\n\n Assim, este \"Dicionário\" pretende oferecer a leitores não-especialistas, aos homens cultos e aos estudantes de ensino médio e nível superior, aos que ouvem conferências e discursos ou participam de debates e comícios, uma explicação e uma interpretação simples e abrangente dos principais conceitos que fazem parte do universo do discurso político. Para isso expõe-se sua evolução histórica, analisa-se sua situação atual e fazem-se referências aos conceitos afins, indicando os autores e obras a eles diretamente ligados.\n\n- https://gateway.pinata.cloud/ipfs/QmNi7rQ3vNoABZXTE55rk5pyWC2mboaDGfAW6AEfY6iyFf/Norberto%20Bobbio,%20Nicola%20Matteuci,%20Gianfranco%20Pasquino%20-%20Dicion%C3%A1rio%20de%20Pol%C3%ADtica-UnB%20%282004%29.pdf",
				"added": 1576516134
			},
			{
				"comment_id": 4,
				"body": "#Existe Mesmo Algo Como Um “Livre-Mercado”?\nTodo mercado tem algumas regras e limites que restringem a liberdade de escolha. O mercado só parece livre porque estamos tão condicionados a aceitar as suas restrições subjacentes que deixamos de percebê-las.\n- https://telegra.ph/Existe-Mesmo-Algo-Como-Um-Livre-Mercado-12-16\n\n#O Mercado é Mesmo Bom?\nHá um elemento comum, nas manifestações recentes da direita: o discurso de que o Estado deve recuar e o mercado deve regular uma porção maior das interações humanas. Se a lógica do mercado opera, dizem eles, no final das contas todos ganham. Será que é mesmo assim?\n- https://telegra.ph/O-Mercado-é-Mesmo-Bom-12-16\n\n#Uma Filosofia Para o Proprietariado\nO “Libertarianismo” não oferece solução alguma para a política plutocrática de hoje em dia – não passa de uma rejeição reacionária à luta política.\n- https://telegra.ph/Uma-Filosofia-Para-o-Proprietariado-12-16\n\n#O Livre-Mercado Faz Países Pobres Ficarem Ricos?\n “Os supostos lares do livre comércio e do livre mercado ficaram ricos por meio da combinação do protecionismo, subsídios e outras políticas que hoje eles aconselham os países em desenvolvimento a não adotar. As políticas de livre mercado tornaram poucos países ricos até agora e poucos ficarão ricos por causa dela no futuro.”\n- https://telegra.ph/O-Livre-Mercado-Faz-Países-Pobres-Ficarem-Ricos-12-16\n\n#Os Socialistas Querem Tornar Todos Iguais? Querem Acabar Com a Nossa Individualidade?\n- https://telegra.ph/Os-Socialistas-Querem-Tornar-Todos-Iguais-Querem-Acabar-Com-a-Nossa-Individualidade-12-16\n\n#O Marxismo Está Ultrapassado? Ele Só Tinha Algo a Dizer Sobre a Inglaterra do Século XIX, e Olhe Lá?\n- https://telegra.ph/O-Marxismo-Está-Ultrapassado-Ele-Só-Tinha-Algo-a-Dizer-Sobre-a-Inglaterra-do-Século-XIX-e-Olhe-Lá-12-16\n\n#O Marxismo é Uma Ideologia Assassina, Que Só Pode Gerar Miséria?\n“O Marxismo é uma ideologia sanguinária e assassina, que só pode gerar miséria compartilhada? Socialismo significa falta de liberdade e uma economia falida?”\n- https://telegra.ph/O-Marxismo-é-Uma-Ideologia-Assassina-Que-Só-Pode-Gerar-Miséria-12-16-2\n\n#O Comunismo Não Passa de Um Sonho de Utopia? Só Funcionaria Com Pessoas Perfeitas?\nO Comunismo é apenas um sonho de ingenuidade, utopia e perfeição? Ele ign0ra a maldade e o egoísmo que estariam na essência da natureza humana? Um tal sistema precisaria que todos pensassem e agissem de uma única maneira, só poderia funcionar com pessoas perfeitas e harmoniosas como peças de relógio, nunca com os seres humanos diversos e falhos que realmente existem?\n- https://telegra.ph/O-Comunismo-Não-Passa-de-Um-Sonho-de-Utopia-Só-Funcionaria-Com-Pessoas-Perfeitas-12-16-3\n\n#Reivindicando o Companheiro Orwell\nGeorge Orwell se tornou um espelho no qual qualquer posição política pode olhar e se ver olhando de volta. Mas não se engane – Orwell pertence à Esquerda.\n- https://telegra.ph/Reivindicando-o-Companheiro-Orwell-12-16",
				"added": 1576517101
			},
			{
				"comment_id": 5,
				"body": "#ABCs do Socialismo\n\nO especial pode ser baixado na íntegra em inglês aqui: https://gateway.pinata.cloud/ipfs/QmRJfyCWv4kGKuexVQTBp9ME7t5sxpbPqgcaNXMzpJw1zJ",
				"added": 1576517221
			},
			{
				"comment_id": 6,
				"body": "#O Capitalismo deu certo e o Socialismo fracassou? Não é bem assim\nDesde a queda da URSS o Capitalismo segue triunfante e impondo sua hegemonia, mas será que isso o torna algo bom e o socialismo algo que deve ser esquecido? A História tem a resposta.\n- https://telegra.ph/O-Capitalismo-deu-certo-e-o-Socialismo-fracassou-Não-é-bem-assim-12-16",
				"added": 1576517678
			},
			{
				"comment_id": 7,
				"body": "\"O socialismo seria encalçado quando o operário organizado passasse a controlar os meios de produção, que seria usado para o bem estar coletivo. Nada disso aconteceu na Rússia.\"\n\n- Fonte: https://avoyager.net/historia/o-papel-do-socialismo-na-historia/",
				"added": 1576517764
			},
			{
				"comment_id": 8,
				"body": "#O que você precisa saber antes de falar que a esquerda é totalitária\nBem diferente do que diz o discurso conservador, a consolidação da democracia no Ocidente como conhecemos hoje só foi possível devido às demandas da esquerda.\n\n- https://telegra.ph/O-que-você-precisa-saber-antes-de-falar-que-a-esquerda-é-totalitária-12-16",
				"added": 1576517853
			},
			{
				"comment_id": 10,
				"body": "#6 medos do comunismo que se tornaram reais no capitalismo\nSerá que aquilo que os reacionários mais temem do “comunismo”, já não é uma realidade no próprio capitalismo?\n- https://telegra.ph/6-medos-do-comunismo-que-se-tornaram-reais-no-capitalismo-12-16",
				"added": 1576518343
			},
			{
				"comment_id": 11,
				"body": "#As 10 falácias mais comuns criadas pela direita para atacar a esquerda\nAo abusarem da falácia do espantalho e nada proporem, nossos conservadores apenas acabam expondo a miséria intelectual em que eles próprios estão afundados.\n- https://telegra.ph/10-falácias-criadas-pelos-defensores-do-capitalismo-pra-atacar-a-esquerda-12-16",
				"added": 1576518460
			},
			{
				"comment_id": 12,
				"body": "#Liberalismo e Nazifascismo possuem mais afinidades do que você imagina\nOposição entre Liberalismo e Nazifascismo é mito: liberais e neoliberais legitimaram o nazifascismo, já os nazifascistas aplicaram políticas de inspiração liberal em suas ditaduras.\n- https://telegra.ph/Liberalismo-e-Nazifascismo-possuem-mais-afinidades-do-que-você-imagina-12-16",
				"added": 1576518576
			},
			{
				"comment_id": 13,
				"body": "#“Nazismo é de esquerda”: A falácia que afronta a História e a Filosofia\n- https://telegra.ph/Nazismo-é-de-esquerda-A-falácia-que-afronta-a-História-e-a-Filosofia-12-16",
				"added": 1576518670
			},
			{
				"comment_id": 14,
				"body": "#Sim, o Neoliberalismo existe e sua negação é ideológica\nO termo Neoliberalismo incomoda os defensores do livre mercado porque o seu prefixo “neo” lembra que o liberalismo falhou e admitir isso os assusta.\n- https://telegra.ph/Sim-o-Neoliberalismo-existe-e-sua-negação-é-ideológica-12-16",
				"added": 1576518762
			},
			{
				"comment_id": 15,
				"body": "#Industrialização da Inglaterra: Liberalismo ou Intervencionismo?\nA Inglaterra é uma defensora histórica do livre mercado, mas seu desenvolvimento nos mostra que essa defesa está mais para retórica do que para uma real prática.\n- https://telegra.ph/Industrialização-da-Inglaterra-Liberalismo-ou-Intervencionismo-12-16",
				"added": 1576518871
			},
			{
				"comment_id": 16,
				"body": "#10 célebres cientistas destroem o mito do \"esquerdista de humanas\"\nSurpreenda-se com o que pensavam 10 famosos cientistas, alguns laureados com o Nobel, sobre política, sociedade, costumes e o próprio papel da ciência.\n\n- https://telegra.ph/10-célebres-cientistas-destroem-o-mito-do-esquerdista-de-humanas-12-16",
				"added": 1576518953
			},
			{
				"comment_id": 17,
				"body": "#Cherry Picking: uma das falácias mais usadas na Internet em 10 exemplos\nConheça a falácia Cherry Picking ou Cata-Cereja, muito utilizada pela direita nas discussões políticas na internet, principalmente nas redes sociais como o Facebook.\n- https://archive.ph/g4Mcl",
				"added": 1576519188
			},
			{
				"comment_id": 18,
				"body": "#Culpar o socialismo pela queda do Império Romano é ignorância profunda\n- https://telegra.ph/Culpar-o-socialismo-pela-queda-do-Império-Romano-é-ignorância-profunda-12-16",
				"added": 1576519305
			},
			{
				"comment_id": 19,
				"body": "#9 razões pelas quais é falso acusar a esquerda crítica de Israel de antissemita\n“Se o nazismo é de direita, por que é a esquerda que odeia Israel?”: entenda por que esse questionamento não possui sentido algum.\n\n- https://telegra.ph/9-razões-pelas-quais-é-falso-acusar-a-esquerda-crítica-de-Israel-de-antissemita-12-16",
				"added": 1576520130
			},
			{
				"comment_id": 20,
				"body": "#Como se definem Direita e Esquerda? - Conceitos Históricos\n- https://gateway.pinata.cloud/ipfs/QmTAthEcJw5kKD4nxfZGikgVtUU7Gpe4M2RLheHwwpxYTz",
				"added": 1576522613
			},
			{
				"comment_id": 24,
				"body": "#O anticomunismo: como ganhou força e como combater \n- https://invidio.us/7be2UFZfFXQ\n- https://gateway.pinata.cloud/ipfs/QmUPQXxyokA8CtRLmfiWjGVcDC1fKRB8qFtK34tsQoB8RF",
				"added": 1576546006
			},
			{
				"comment_id": 26,
				"body": "#Ditadura empresarial-militar: mitos e verdades\n- https://invidio.us/sJHNPQc2514\n- https://gateway.pinata.cloud/ipfs/QmfMLMAids58SMW5aHpuXcZGeuLwaPi5Xp412asVHDyh6x",
				"added": 1576546968
			},
			{
				"comment_id": 27,
				"body": "#Dicionário do pensamento marxista\nUm guia dos conceitos clássicos do marxismo e dos pensadores e escolas que contribuíram para a sua evolução.\n- https://gateway.pinata.cloud/ipfs/QmSZksGKEZC86WerZKAj2397A8rxV3tUZ5nwfJa5ANtQNM",
				"added": 1576547060
			},
			{
				"comment_id": 28,
				"body": "#Manifesto do Partido Comunista\n\nManifesto do Partido Comunista: um dos mais significativos documentos programáticos do comunismo fundado em bases científicas, que contém uma exposição coerente das bases da grande doutrina de Marx e Engels. \"Esta obra expõe, com uma clareza e um vigor geniais, a nova concepção do mundo, o materialismo consequente aplicado também ao domínio da vida social, a dialéctica como a doutrina mais vasta e mais profunda do desenvolvimento, a teoria da luta de classes e do papel revolucionário histórico universal do proletariado, criador de uma sociedade nova, a sociedade comunista.\" (Ver Obras Escolhidas de V. I. Lénine em três tomos, Edições \"Avante!\"-Edições Progresso, Lisboa-Moscovo, 1977, t. 1, p. 5.)\nO Manifesto do Partido Comunista armou o proletariado com a demonstração científica da inevitabilidade do derrube do capitalismo e da vitória da revolução proletária, definiu as tarefas e objectivos do movimento proletário revolucionário.\nO Manifesto do Partido Comunista foi elaborado por Marx e Engels como programa da Liga dos Comunistas por decisão do seu II Congresso realizado em Londres entre 29 de Novembro e 8 de Dezembro de 1847. Representava o triunfo dos defensores da nova linha proletária no quadro das discussões havidas no interior do movimento.\nNo âmbito deste debate Engels havia elaborado já um projecto de Profissão de Fé Comunista (ver Grundsätze des Kommunismus, MEW, vol. 4, pp. 361-380; cf. Princípios Básicos do Comunismo, in OE, 1982, t. I, pp. 76-94) segundo a forma de \"catecismo\" ao tempo utilizada com frequência em documentos de diferentes organizações operárias e progressistas.\nNo entanto, Marx e Engels rapidamente chegaram à conclusão de que a forma de \"manifesto\" seria a mais adequada à nova fase e aos objectivos da luta (ver Engels, carta a Marx de 23-24 de Novembro de 1847, MEW, vol. 27, p. 107).\nAinda em Londres e depois em Bruxelas, Marx e Engels trabalharam juntos na redacção do texto. Tendo Engels partido para Paris em finais de Dezembro, a versão definitiva foi elaborada por Marx fundamentalmente durante o mês de Janeiro de 1848 e remetida finalmente para Londres, onde viria a ser publicada pela primeira vez em fins de Fevereiro do mesmo ano. O manuscrito não chegou até nós. Apenas se dispõe de um esboço de plano para a secção III e de uma página do rascunho (ver a presente edição, pp. 77-79). A presente edição inclui, para além do próprio Manifesto os prefácios às edições de 1872, 1882, 1883, 1888, 1890, 1892 e 1893.\n\n- https://gateway.pinata.cloud/ipfs/QmT5pGwGVkFeAP8CbXSnzYfPmLZv21JLzN331aZdRZxNVy",
				"added": 1576547487
			}
		],
		"8_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 9,
				"body": "#Defende capitalismo e protesta com a máscara do V de Vingança? Você entendeu nada\nV de Vingança foi criado por um anarquista e é uma obra crítica a qualquer tipo de hierarquia e autoritarismo, e isso inclui o próprio capitalismo.\n- https://telegra.ph/Defende-capitalismo-e-protesta-com-V-de-Vingança-Você-entendeu-nada-12-16",
				"added": 1576517969
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 21,
				"body": "#O Conhecimento Mais Importante da Física\n- https://open.lbry.com/The-Most-Important-Knowledge-of-Physics:f",
				"added": 1576524740
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [],
		"1_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": [
			{
				"comment_id": 25,
				"body": "#Quem derrotou os nazistas? Mitos e verdades sobre a Segunda Guerra Mundial\n- https://invidio.us/5xqnAkAovUw\n- https://gateway.pinata.cloud/ipfs/QmfCQYek5As7CrAfEMdG7WhfroorSrMktbT87DL8yz82zj",
				"added": 1576546576
			}
		],
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": [
			{
				"comment_id": 29,
				"body": "#Quilombo dos Palmares e escravidão: mitos e verdades\n- https://invidio.us/0wHVr6F-Ujw\n- https://gateway.pinata.cloud/ipfs/QmPGDx7SMGQ4nJXaQPUJBxES5oUGHhUyqK7hMW5FxQNNKu",
				"added": 1576547886
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 30,
				"body": "#A Onda - 1981\nTem início com o professor de história Burt Ross explicando aos seus alunos a atmosfera da Alemanha, em 1930, a ascensão e o genocídio nazista. Os questionamentos dos alunos levam o professor a realizar uma arriscada experiência pedagógica que consiste em reproduzir na sala de aula alguns clichês do nazismo: usariam o slogan 'Poder, Disciplina e Superioridade', um símbolo gráfico para representar 'A onda', etc. O professor Ross se declara o líder do movimento da 'onda', exorta a disciplina e faz valer o poder superior do grupo sobre os indivíduos. Os estudantes o obedecem cegamente. A escola inteira é envolvida no fanatismo d'A onda, até que um casal de alunos mais consciente alerta ao professor ter perdido o controle da experiência pedagógica que passou ao domínio da realidade cotidiana da comunidade escolar.\n- Dublado: https://gateway.pinata.cloud/ipfs/QmewsJmds5MDdUJbXaFh9qGnzdv6gVUCpAUA16Jc5ktJY5\n- Legandado: https://gateway.pinata.cloud/ipfs/QmbPwFTTEuTPSDc5ph5p8ubAwzf9ztegw8sAM5N3Z5rLgA",
				"added": 1576549528
			}
		]
	},
	"comment_vote": {
		"1_191jE4Non1JY7Ux14wbD1vy4kwxDRJGbGe": 1,
		"2_191jE4Non1JY7Ux14wbD1vy4kwxDRJGbGe": 1,
		"3_191jE4Non1JY7Ux14wbD1vy4kwxDRJGbGe": 1,
		"4_191jE4Non1JY7Ux14wbD1vy4kwxDRJGbGe": 1,
		"5_191jE4Non1JY7Ux14wbD1vy4kwxDRJGbGe": 1,
		"7_191jE4Non1JY7Ux14wbD1vy4kwxDRJGbGe": 1,
		"6_191jE4Non1JY7Ux14wbD1vy4kwxDRJGbGe": 1,
		"8_191jE4Non1JY7Ux14wbD1vy4kwxDRJGbGe": 1,
		"9_191jE4Non1JY7Ux14wbD1vy4kwxDRJGbGe": 1,
		"10_191jE4Non1JY7Ux14wbD1vy4kwxDRJGbGe": 1,
		"11_191jE4Non1JY7Ux14wbD1vy4kwxDRJGbGe": 1,
		"20_191jE4Non1JY7Ux14wbD1vy4kwxDRJGbGe": 1,
		"12_191jE4Non1JY7Ux14wbD1vy4kwxDRJGbGe": 1,
		"13_191jE4Non1JY7Ux14wbD1vy4kwxDRJGbGe": 1,
		"14_191jE4Non1JY7Ux14wbD1vy4kwxDRJGbGe": 1,
		"15_191jE4Non1JY7Ux14wbD1vy4kwxDRJGbGe": 1,
		"16_191jE4Non1JY7Ux14wbD1vy4kwxDRJGbGe": 1,
		"17_191jE4Non1JY7Ux14wbD1vy4kwxDRJGbGe": 1,
		"18_191jE4Non1JY7Ux14wbD1vy4kwxDRJGbGe": 1,
		"19_191jE4Non1JY7Ux14wbD1vy4kwxDRJGbGe": 1,
		"30_191jE4Non1JY7Ux14wbD1vy4kwxDRJGbGe": 1
	}
}