{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1576342242,
			"title": "ساخت وی پی ان برای اتصال اینترانت به اینترنت",
			"body": "دوستانی که تخصص دارند در این زمینه نحوه ساخت کانفیگ که از اینترانت به اینترنت وصل بشیم رو توضیح بدن . یعنی کانفیگ اول وصل بشه به ایران بعد وصل بشه خارج به صورت مستقیم نه به صورت وصل شدن با پروکسی به وی پی ان !",
			"added": 1576342241
		},
		{
			"topic_id": 1576483795,
			"title": "اینبار سرورهای مجازی کار نمیکنند",
			"body": "متاستفانه سری پیش که اینترنت قطع بود کامل قطع نکرده بودند ..... اینبار احتمالا سرور های ایرانی  هم قطع میشه تنها شرکت های تولید داخلی تعدادی از صرافی ها اینترنت دارند و خود دولت و بانک ها که در حال ساخت یک کانفیگ اختصاصی برای خودشونن شاید اینبار زیرونت هم قطع هم بشه.... قطع شد خواهش میکنم خیابان ها رو رها نکنید و کمک کنید دست به دست هم این رژیم فاسد رو نابودش کنیم . پنج دی یادتون نره",
			"added": 1576483793
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1576048921_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": [
			{
				"comment_id": 1,
				"body": "> [1zeronet](#comment_13_1Dp8kaXeyJF29n4HDDbDys61M5gqEcayJX): اره امکانش هست.ولی هرچی اعضا بیشتر باشن سرعتش بیشتره و بهتر.چون برا اپدیت کردن باید چند نفر انلاین پیدا شن ک از اونا بگیره اپدیتا رو\n\nموقعی که اینترانت هست یعنی اپدیت بیاد کسی به اینترنت وصل نباشه کار نمیکنه ؟",
				"added": 1576072848
			}
		],
		"1576332422_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": [
			{
				"comment_id": 2,
				"body": "اینجا الان فقط خبر گزاری کم داره",
				"added": 1576342387
			}
		],
		"1576185412_16VNPV97D22nLggFssEwQXScnyUGX2cHjq": [
			{
				"comment_id": 3,
				"body": "> [mmtech](#comment_4_1K8NrwqEfy49zAMWzHgywnToZib7PRaQMP): جی میگید شماها؟ یکم فکر کنیدمگه انقلاب قبلی به نفع مردم شد که این بشه؟ اونچه که باید تغییر کنه فکر من و توعهبا این فکر هرکسی از هرجایی بیاد وضعیت همینه\n\nهمین آبادی که میبینی از ایران رژیم قبلی آباد کرد. شما میگی ما چیزی نگیم هر کار خواستن انجام بدند ؟  انشالله که روزای اخرشون هست بوی حلواشون که پیچیده .....",
				"added": 1576483982
			}
		],
		"1576342242_19GLaMks6RC8w69H2QqkQNH4UKj95ne1Cz": [
			{
				"comment_id": 4,
				"body": "> [atma](#comment_2_1FDUmbPehgEescyLqUChY56usMRdsbkkoh): برا اینکار دو سرور داخلی و خارجی میکروتیک میخواد . به سرور داخلی توسط سرور خارجی اینترنت ازاد میدن سپس وقتی به سرور داخلی وصل میشی اتوماتیک میری روی اینترنت اون سرور خارجی ! اموزش کانفیگ و ... هم باید گوگل کنی یا از پشتیبانی سرورتون بپرسی شاید پولی گرفتن واست ردیف کردن و یا تو این انجمنهای فروش هاست و ...\n\nخواستم مستقیم یه کانفیگ باشه برای وصل شدن  وگرنه کانفیگ میکروتیک رو  بلدم !",
				"added": 1576484097
			},
			{
				"comment_id": 5,
				"body": "> [rashedheydari](#comment_7_19auC98Nvg4jXwZpKzvs3UdDazi4kUappa): اگر الان دنبال نکنیم 5 آذر باید خماری بکشیم خخخخخ همه معتاد شدیم در ضمن برای آزادی به اینترنت نیاز داریم که اطلاع رسانی کنیم\n\nاینبار دیگه سرور هم کار نمیکنه",
				"added": 1576484135
			}
		]
	},
	"comment_vote": {}
}