{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 1,
				"body": "> [28eb9](#comment_20_18Eg3doTf26uabVuTnryFMUk9cKEz9idu7): 4chan is still accessible on the clearnet, and there's still decent, relatively free discussion. at some point a \"manifesto\" is going to get posted to it and their providers will pull support just like 8chan\nThat won't happen. 4chan has been used as a CIA honeypot since 2009, no need to shut that down any time soon.",
				"added": 1565388760
			},
			{
				"comment_id": 2,
				"body": "> [28eb9](#comment_28_18Eg3doTf26uabVuTnryFMUk9cKEz9idu7): basically if democrats win majority in the legislative and executive branch - and they eventually will, as it's purely a numbers game - they will give the illegals in the US amnesty and secure an eternal voter base.\nThis will work in theory, however, they don't understand the culture of the people they're importing and that will result in unforeseen consequences.\n\n> [aspidochelone](#comment_37_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): \"Contingency C - Mass Shooting 20 Casualties\" or some such, and the second the news report came it was put into action. That probably included law enforcement finding the shooter's manifesto and immediately uploading it to 8chan.\nExactly. Now if there's a mass shooting, it's always in line with the wants of the government. I'm pretty sure El Paso was entirely a government op as well.",
				"added": 1565389323
			},
			{
				"comment_id": 3,
				"body": "> [undisclosed](#comment_5_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK): I have an infographic saved in the last hour of 8ch which convincingly shows initial /pol/ posting of the P. Crusius manifesto occurred twelve minutes AFTER the El Paso Police Dept. twitter feed announced an active shooter.  That's with Mountain Time converted to Coordinated Universal Time.  I don't keep or want any social media footprint.  The last time I had to use a burner phone for Twitter to get their voice confirmation code.  That account lasted all of four hours, so maybe some journo will want to Tweet this instead.  I'm not buying another phone.  It really needs no accompanying message.  I'll just leave it here. [...]\nNo Journo would post this. (((Journalists)) are tools of the state, and I'm not talking about Congress or the White House.",
				"added": 1565406631
			}
		],
		"1565601077_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 4,
				"body": "> [r6uysrgw4g4tg](#comment_18_1DJDoGruBajCdDVznWRKd2MBLZZUYpM8EJ): The Free Market has absolutely zero mechanisms available to clean up such a mess.\n> [r6uysrgw4g4tg](#comment_19_1DJDoGruBajCdDVznWRKd2MBLZZUYpM8EJ): Capitalism means endless corporate lobbying\nCorporate lobbying is to the state, which means that any country with a government that regulates a market is no longer free. In other words, the free market doesn't even exist. Every corporation that holds a monopoly or is unable to be toppled organically is the result of state interference. That's in every single scenario.",
				"added": 1565647139
			},
			{
				"comment_id": 6,
				"body": "> [memesadler](#comment_39_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): If the corporations buy it out and promote these puppets and charlatans in it, the state will no longer represent the interest of the people that built it but the interest of corporations. \n\"If\"? What you're describing has already occurred.",
				"added": 1565650380
			}
		],
		"1565641104_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 5,
				"body": "Why don't you take a nap, Califag",
				"added": 1565647871
			}
		],
		"1565645808_1NkqJSocDr3nAa6WWDCAHgtf3ftwBUGGCK": [
			{
				"comment_id": 7,
				"body": "\"Free speech\" means people can say whatever they like, even things you don't like. Thought that was implied in the concept.",
				"added": 1565650426
			}
		],
		"1565704796_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU": [
			{
				"comment_id": 8,
				"body": "I'd rather a system native to 0talk that lets you upload files and link them to the post without leaving the page?",
				"added": 1565714523
			}
		],
		"1565910085_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5": [
			{
				"comment_id": 9,
				"body": "Over here FBI",
				"added": 1565910759
			}
		]
	},
	"comment_vote": {
		"21_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": 1,
		"9_1LW31sbmLZebhhgTx2bhzeUNYbZ5cYnBfe": 1,
		"27_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn": 1,
		"5_13oVVVvkDc7ekDw3xkrYVQPiTqLurrrgqN": 1,
		"6_19ouxiGbVPzjqbCeAWLx4udeggoUsfEhdV": 1,
		"37_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK": 1,
		"84_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"13_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"2_155YW8Qn715edvfqPMrsPscUHqut4JCphb": 1,
		"108_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1
	}
}