{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_15ugkXYAt4RKhwHV85jTK6FcpVS6nqScCV": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": [
			{
				"comment_id": 1,
				"body": "#Batalhas A.C. - The History Channel (2009)\nPara eles a guerra era uma aventura criativa, com o destino de civilizações inteiras em jogo. Através de diferentes episódios conheceremos as verdades e os mitos que se escondem por trás do mundo dos heróis épicos e dos vilões. Suas estratégias militares serão estudadas graças à tecnologia da computação gráfica, que recriará antigas batalhas no estilo de sua época. Conheça aqui a história de Alexandre, dos Espartanos, do Rei Davi e de Aníbal, entre muitos outros mais.\n- https://www.youtube.com/playlist?list=PL2jLlkjcFW5hmUSYYl8q-0IiJPkbltncV",
				"added": 1550169497
			},
			{
				"comment_id": 2,
				"body": "#GRANDES ESTRATEGISTAS \n\n#Genghis Khan\n\nComo um contra ponto aos desenvolvimentos Europeus na arte da estratégia, o Imperador Mongol Genghis Khan fornece um exemplo útil. Os sucessos de Genghis Khan e de seus sucessores foram baseados na dominação e no terror. O aspecto da estratégia de assalto de Genghis Khan era nada menos que a psicologia de contrapor-se a população. Através de uma implementação meticulosa e cuidadosa de sua estratégia, Genghis Khan e seus descendentes foram capazes de conquistar a maior parte da Eurásia.\n\nOs blocos de construção do exercito de Genghis Khan e sua estratégia eram levas tribais de arqueiros montados e (o ponto importante) o vasto rebanho de cavalos da Mongólia. Cada arqueiro tinha pelo menos um cavalo extra; (havia uma média de 5 cavalos por homem) portanto o exército inteiro poderia se mover com inacreditável rapidez. Alem disto desde o leite de cavalo e seu sangue eram os pratos principais da dieta mongol. As tropas de cavalos de Genghis Khan funcionavam nem somente como seu meio de movimentação, mas também como seu suporte logístico. Todas as outras necessidades poderiam ser exploradas ou saqueadas.\n\nComparado aos exércitos de Genghis Khan, todos os outros exércitos eram passados e comparativamente imóveis. Através de assaltos contínuos, os exércitos europeus, chineses, persas e árabes puderam ser estressados até sua queda, e então aniquilados em perseguição. Quando se confrontavam com cidades fortificadas, os imperativos mongóis de manobrabilidade e velocidade que possuíam eram facilmente superados. Aqui o medo engendrado pela terrível reputação dos mongóis ajudava. Também uma primitiva guerra biológica era utilizada. Uma trebuche ou outros tipos de armas de balística poderia ser usada para lançar animais mortos e corpos em dentro de uma cidade sitiada, espalhando doenças e morte entre seus habitantes. Se uma cidade ou vila em particular desagradasse o Ka Mongoliano, todos na cidade poderiam ser mortos para servir de exemplo para todas as outras cidades. Isto pode ser encarado como uma forma de guerra psicológica.\n\nA estratégia mongol era direcionada a um objetivo (no qual o (foco principal) era inicialmente e nada menos que a psicologia de contrapor-se a população) alcançado através da ofensiva; a ofensiva era caracterizada pela concentração de forças, manobras, surpresas e simplicidade. Por isto as hordas mongóis alcançaram por dois séculos um domínio sem paralelo na Eurásia.\n\n\n#Hanibal\n\nAníbal ou Hanibal, nascido em 247 a.C. em Cartago e falecido em 183 a.C.em Bitínia foi um general e estadista cartaginês considerado por muitos como um dos maiores táticos militares da história. Aníbal e seu exército - O inferno de Roma uma inesquecível derrota ensinou aos romanos que a inteligência é uma grande arma contra a força bruta.\n\nO grande estrategista pensava em fazer de Cartago, uma colônia fenícia do mediterrâneo, bastante rica, a senhora dos mares. Sua rival era Roma, pela qual nutria ódio implacável.\n\nAníbal invadiu a Itália atravessando os Pirinéus e os Alpes a partir de um desembarque com elefantes ali derrotou os romanos em grandes batalhas campais como a do lago Trasimeno ou a de Canas. Apesar de seu brilhante movimento, Aníbal não chegou a capturar Roma. Existem diversas opiniões entre os historiadores, que vão desde carências materiais de Aníbal em máquinas de combate a considerações políticas que defendem que a intenção de Aníbal não era tomar Roma, senão obrigá-la a render-se.\n\nNão obstante, Aníbal conseguiu manter um exército na Itália durante mais de uma década, recebendo escassos reforços. Por causa da invasão da África por parte de Cipião, o Senado púnico lhe chamou de volta a Cartago, onde foi finalmente derrotado por Cipião na Batalha de Zama de onde fugiu, dirigindo-se para a Ásia. Os romanos, porém, sabiam que enquanto ele estivesse vivo não haveria possibilidade de permanecerem em paz, uma vez que odiava os romanos e era hábil em realizar ataques. Por este motivo seguiram e encontraram Aníbal protegido pelo rei da Prússia da Bitínia. Aníbal preferiu morrer a se entregar aos romanos, por isso envenenou-se (183 a.C)..\n\nO historiador militar Theodore Dodge o chamou de pai da estratégia. Foi admirado inclusive por seus inimigos — Cornélio Nepos o batizou como o maior dos generais, assim sendo, seu maior inimigo, Roma, adaptou certos elementos de suas táticas militares a seu próprio arsenal estratégico. Seu legado militar o conferiu uma sólida reputação no mundo moderno, e tem sido considerado como um grande estrategista por grandes militares como Napoleão ou Arthur Wellesley, o duque de Wellington. Sua vida tem sido objeto de muitos filmes e documentários.\n\n#Napoleão\n\nA Revolução Francesa e as Guerras Napoleônicas que se seguiram revolucionaram a estratégia militar. O impacto deste período foi ainda sentido na Guerra Civil Americana e nas primeiras fases da Primeira Guerra Mundial. Com o advento de armas pequenas baratas e o surgimento de tropas de soldados civis, os exércitos cresceram rapidamente em tamanho tornando-se formações de massa. Isto trouxe a divisão dos exércitos primeiro em divisões e mais tarde em batalhões. Juntamente com as divisões veio a divisão de artilharia; leve, móvel e com grande alcance e poder de fogo. A rígida formação de lanceiros e mosqueteiros disparando conjuntamente abriu caminho para infantaria leve combater na linha de frente.\n\nNapoleão I da França obteve vantagem destes desenvolvimentos para prosseguir em uma brutalmente efetiva estratégia de aniquilação que pouco se importa com a perfeição matemática da estratégia geométrica. Napoleão invariavelmente buscava obter o controle na batalha, usualmente alcançando o sucesso através manobras superiores. Como regra geral, ele lidava com a grande estratégia como também com a estratégia operacional, fazendo uso de meios políticos e econômicos. Napoleão só foi finalmente derrotado quando seus oponentes adotaram a estratégia que ele tinha desenvolvido.\n\nO triunfo da estratégia pratica de Napoleão inspirou um novo campo de estudo na estratégia militar. Os dois estudos mais significativos de seu trabalho foram feitos por Carl von Clausewitz, um Prussiano como formação em filosofia, e Antoine-Henri Jomini, que foi um dos oficiais sob seu comando. On War de Clausewitz tornou-se uma bíblia da estratégia, dividindo-se entre a liderança militar tanto quanto política. Um das suas mais famosas afirmações é:\n\n - A guerra não é meramente um ato político, mas também um instrumento político real, uma   continuação da política conduzidas por outros meios.\"\n\nEm contraste á Clausewitz, Antoine-Henri Jomini lidava principalmente com a estratégia operacional, inteligência & planejamento, a condução da campanha, e liderança ao invés da política. Ele propôs que a vitória poderia se obtida pela ocupação do território do inimigo ao invés da destruição de suas armas. Tal que, considerações estratégicas foram proeminente em sua teoria da estratégia. Os dois princípios básicos da estratégia de Jomini era a concentração contra a fragmentação das forças do inimigo de uma única vez e atacar o objetivo mais decisivo.\n\nUma notável exceção da estratégia de aniquilação de Napoleão e uma precursora da guerra de trincheiras foi a Linha de Torres Vedras usada durante a campanha Peninsular. O exercito Francês se encontrava fora de seu território e quando eles foram confrontados por uma linha de fortificações as quais não poderiam ser flanqueadas, eles foram incapazes de continuar o avanço e foram forçados a se retirar uma vez que consumiram todas as provisões da região na linha de frente.\n\nA campanha peninsular foi notável para o desenvolvimento de outros métodos de Guerra os quais permaneceram intocados com passar do tempo, mas tornaram-se mais comuns no século XX. Foi a ajuda e encorajamento que os Britânicos deram para os Portugueses o que forçou os Franceses a desperdiçar a maioria dos bens da armada Espanhola na proteção das linhas de comunicação de seus exércitos. Isto foi um custo muito efetivo movido pelos Britânicos, porque era mais barato para ela ajudar os insurgentes de Portugal do que equipar e pagar uma unidade exercito Britânico para ocupar o mesmo número de tropas Francesas. Como o exercito Britânico poderia ser correspondentemente menor ele seria capaz de abastecer suas tropas por mar e terra sem ter que abandonar território como era norma naquele tempo. Além disto, por eles não terem de procurar por alimento eles não tinham o antagonismo dos moradores locais e por isto eles não tinham que guarnecer suas linhas de comunicação da mesma forma que os Franceses. Então a estratégia de ajudar seus aliados Portugueses na guerrilha beneficiou os Britânicos de muitas formas, algumas das quais não são imediatamente obvias.\n\n#Alexandre, o Grande\n\nConta a lenda que a mãe de Alexandre, Olympia, no momento da concepção, sonhou que uma serpente entrou silenciosamente no seu quarto. Insinuando-se entre os cobertores, deslizou entre suas pernas e seus seios, e a possuiu sem machucá-la. E o seu sêmen se misturou com aquele que o marido, o rei Filipe 2º, lhe dera momentos antes de ser vencido pelo sono e pelo vinho.\nAlexandre era filho de Filipe da Macedônia, que se tornou rei em 338 a.C., dominando toda a Grécia, com exceção de Esparta. Aos 13 anos recebeu como preceptor ninguém menos que Aristóteles, um dos homens mais sábios de sua época e de todos os tempos. Com ele, Alexandre aprendeu as mais variadas disciplinas: retórica, política, ética, ciências físicas e naturais, medicina, geografia; e conheceu as obras de autores como Eurípides e Píndaro.\n\nAo mesmo tempo, o príncipe se interessava pelas artes marciais e pela domesticação de cavalos. Na arte da guerra, Filipe 2º, militar experiente e corajoso, instruiu o filho com conhecimentos de estratégia e de comando. Alexandre, com 18 anos, pôde mostrar seu talento quando, à frente de um esquadrão de cavalaria, venceu o batalhão sagrado de Tebas, na Batalha de Queronéia, em 338 a.C.\n\nDepois do assassinato de seu pai em 336 a.C., Alexandre assumiu o trono da Macedônia enfrentando resistência em algumas cidades gregas. Com o poder nas mãos, o jovem rei que viria a ser conhecido como Magno (ou o Grande) deu início à expansão territorial do reino e ao seu ambicioso projeto de conquistar o Império Persa. Contava com um exército poderoso e organizado, dividido em infantaria, cuja principal arma eram lanças de grande comprimento, e em cavalaria, que constituía a base do ataque rápido ao inimigo.\nEm 334 a.C., Alexandre cruzou o Helesponto - o estreito de Dardanelos, na atual Turquia -, e já na Ásia avançou até o rio Granico, onde enfrentou os persas pela primeira vez e alcançou a vitória. Prosseguiu triunfante em sua jornada, arrebatando cidades aos persas, até chegar a Górdia. Diante das perdas, o rei da Pérsia, Dario 3º, foi ao encontro do inimigo. Na batalha de Isso, em 333 a.C., consumou-se a derrota dos persas e começou o ocaso do grande império. \n\nEm seguida, Alexandre empreendeu a conquista da Síria em 332 a.C. e entrou no Egito. Seu sonho, além de aumentar em poder e em glória, era unir a cultura oriental à ocidental. Respeitou os antigos cultos aos deuses egípcios e até se apresentou no santuário do Oásis de Siwa, onde foi reconhecido como filho de Amon e sucessor dos faraós. Mas a tendência à fusão das duas culturas gerou desconfianças entre seus oficiais macedônios e gregos, que temiam um excessivo afastamento dos ideais helênicos por parte de seu monarca.\nEm 332 a.C. fundou, no Egito, Alexandria cidade que viria a converter-se num dos grandes focos culturais da Antiguidade. Um ano depois, Alexandre enfrentou novamente Dario 3º na batalha de Gaugamela, cujo resultado determinou a queda definitiva da Pérsia em poder dos macedônios. Morto Dario, Alexandre foi proclamado rei e sucessor da dinastia persa em 330 a.C. \n\nNo ano 328 a.C casou-se com Roxana, filha do governante da Bactriana, com quem teve um filho de nome Alexandre 4 o. Em 327 a.C. dirigiu suas tropas para a Índia, onde fundou colônias militares e cidades, entre as quais Nicéia e Bucéfala, às margens do Rio Hidaspe. Ao chegar ao Rio Bias, porém, suas tropas, exaustas, se negaram a continuar.\n\nAlexandre decidiu regressar à Pérsia, viagem penosa, sob o ataque de povos hostis, na qual foi ferido mortalmente e acometido de uma febre misteriosa, que nenhum de seus médicos soube curar. Alexandre morreu na Babilônia, a 13 de junho de 323 a.C., com apenas 33 anos.\nO império que edificou, em 12 anos, ia do rio Indo ao Nilo, com as culturas helênica e oriental interpenetrando-se e produzindo uma nova civilização que talvez tenha sido o maior legado de Alexandre à humanidade.\n\n- Fonte: Who Was Who in Greek World, Diana Bowder, Phaidon Press",
				"added": 1550169665
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 3,
				"body": "Dêem graças ao Senhor porque ele é bom; o seu amor dura para sempre.\nQue Israel diga: \"O seu amor dura para sempre! \"\nOs sacerdotes digam: \"O seu amor dura para sempre! \"\nOs que temem o Senhor digam: \"O seu amor dura para sempre! \"\nNa minha angústia clamei ao Senhor; e o Senhor me respondeu, dando-me ampla liberdade.\n#O Senhor está comigo, não temerei. O que me podem fazer os homens?\nO Senhor está comigo; ele é o meu ajudador. Verei a derrota dos meus inimigos.\n#É melhor buscar refúgio no Senhor do que confiar nos homens.\n#É melhor buscar refúgio no Senhor do que confiar em príncipes.\nTodas as nações me cercaram, mas em nome do Senhor eu as derrotei.\nCercaram-me por todos os lados, mas em nome do Senhor eu as derrotei.\nCercaram-me como um enxame de abelhas, mas logo se extinguiram como espinheiros em chamas. Em nome do Senhor eu as derrotei!\nEmpurraram-me para forçar a minha queda, mas o Senhor me ajudou.\nO Senhor é a minha força e o meu cântico; ele é a minha salvação.\nAlegres brados de vitória ressoam nas tendas dos justos: \"A mão direita do Senhor age com poder!\nA mão direita do Senhor é exaltada! A mão direita do Senhor age com poder! \"\nNão morrerei; mas vivo ficarei para anunciar os feitos do Senhor.\nO Senhor me castigou com severidade, mas não me entregou à morte.\nAbram as portas da justiça para mim, pois quero entrar para dar graças ao Senhor.\nEsta é a porta do Senhor, pela qual entram os justos.\nDou-te graças, porque me respondeste e foste a minha salvação.\nA pedra que os construtores rejeitaram tornou-se a pedra angular.\nIsso vem do Senhor, e é algo maravilhoso para nós.\nEste é o dia em que o Senhor agiu; alegremo-nos e exultemos neste dia.\nSalva-nos, Senhor! Nós imploramos. Faze-nos prosperar, Senhor! Nós suplicamos.\nBendito é o que vem em nome do Senhor. Da casa do Senhor nós os abençoamos.\nO Senhor é Deus, fez resplandecer sobre nós a sua luz. Juntem-se ao cortejo festivo, levando ramos até as pontas do altar.\nTu és o meu Deus; graças te darei! Ó meu Deus, eu te exaltarei!\nDêem graças ao Senhor, porque ele é bom; o seu amor dura para sempre.\n\n- Salmos 118:1-29",
				"added": 1550169756
			},
			{
				"comment_id": 4,
				"body": "#Pergunta: \"Onde o Antigo Testamento prediz a vinda de Cristo?\"\n\n- Resposta: Há várias profecias do Antigo Testamento sobre Jesus Cristo. Alguns intérpretes dizem que existem centenas de profecias messiânicas. Veja a seguir as que são consideradas as mais claras e mais importantes.\n\nQuanto ao nascimento de Jesus - Isaías 7:14: \"Portanto o Senhor mesmo vos dará um sinal: eis que uma virgem conceberá, e dará à luz um filho, e será o seu nome Emanuel.\" Isaías 9:6: \"Porque um menino nos nasceu, um filho se nos deu; e o governo estará sobre os seus ombros; e o seu nome será: Maravilhoso Conselheiro, Deus Forte, Pai Eterno, Príncipe da Paz.\" Miqueias 5:2: \"Mas tu, Belém Efrata, posto que pequena para estar entre os milhares de Judá, de ti é que me sairá aquele que há de reinar em Israel, e cujas saídas são desde os tempos antigos, desde os dias da eternidade.\"\n\nQuanto ao ministério e morte de Jesus - Zacarias 9:9: \"Alegra-te muito, ó filha de Sião; exulta, ó filha de Jerusalém; eis que vem a ti o teu rei; ele é justo e traz a salvação; ele é humilde e vem montado sobre um jumento, sobre um jumentinho, filho de jumenta.\" Salmo 22:16-18: \"Pois cães me rodeiam; um ajuntamento de malfeitores me cerca; transpassaram-me as mãos e os pés. Posso contar todos os meus ossos. Eles me olham e ficam a mirar-me. Repartem entre si as minhas vestes, e sobre a minha túnica lançam sortes.\"\n\nA profecia sobre Jesus que provavelmente é a mais clara é o capítulo 53 do livro de Isaías. Isaías 53:3-7 é especialmente inequívoco: \"Era desprezado e o mais rejeitado entre os homens; homem de dores e que sabe o que é padecer; e, como um de quem os homens escondem o rosto, era desprezado, e dele não fizemos caso. Certamente, ele tomou sobre si as nossas enfermidades e as nossas dores levou sobre si; e nós o reputávamos por aflito, ferido de Deus e oprimido. Mas ele foi traspassado pelas nossas transgressões e moído pelas nossas iniquidades; o castigo que nos traz a paz estava sobre ele, e pelas suas pisaduras fomos sarados. Todos nós andávamos desgarrados como ovelhas; cada um se desviava pelo caminho, mas o SENHOR fez cair sobre ele a iniquidade de nós todos. Ele foi oprimido e humilhado, mas não abriu a boca; como cordeiro foi levado ao matadouro; e, como ovelha muda perante os seus tosquiadores, ele não abriu a boca.\"\n\nA profecia das “setenta semanas” em Daniel capítulo 9 predisse a data exata em que Jesus, o Messias, seria “morto”. Isaías 50:6 descreve corretamente a surra que Jesus teria que aguentar. Zacarias 12:10 prediz que o Messias seria “traspassado”, o que ocorreu depois de Jesus ter morrido na cruz. Poderíamos providenciar muitos outros exemplos, mas esses devem ser suficientes. O Antigo Testamento com certeza profetiza sobre a vinda de Jesus como o Messias.",
				"added": 1550169841
			},
			{
				"comment_id": 6,
				"body": "#Bíblia bilingue coreano-inglês\n\n- https://mega.nz/#!yiBDgIxZ!d0Y4RgEf1KWeBGmfHoGbNICi9u-lz1WCIxXRKOubcr4\n- SHA-256: f5d93388dcf51add76d2d748ebc34fa3742b46e8fbcc987e42ac216edf05f06d",
				"added": 1550174715
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 5,
				"body": "#Pedagogia da Autonomia - Saberes Necessários À Prática Educativa\n\n\nNa Pedagogia da autonomia, de 1996, Paulo Freire nos apresenta uma reflexão sobre a relação entre educadores e educandos e elabora propostas de práticas pedagógicas, orientadas por uma ética universal, que desenvolvem a autonomia, a capacidade crítica e a valorização da cultura e conhecimentos empíricos de uns e outros. Criando os fundamentos para a implementação e consolidação desse diálogo político-pedagógico e sintetizando questões fundamentais para a formação dos educadores e para uma prática educativo-progressiva, Paulo Freire estabelece neste livro novas relações e condições para a tarefa da educação.\n\n\n- https://web.archive.org/web/20181223094320/http://forumeja.org.br/files/Autonomia.pdf",
				"added": 1550170480
			}
		]
	},
	"comment_vote": {}
}