{
	"posts": [
		{
			"id": "decc5da9-0ecf-4373-987c-a36e27bb2030",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f9af075f-7555-4274-91e6-282390f63244",
			"body": "Are the usernames necessary or can you hide them?",
			"time": 1565332946203,
			"files": "[]"
		},
		{
			"id": "9ed39623-8280-4d6b-a83b-08525615cc56",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "e65979fa-51b5-4874-831d-9f8e9dcd1205",
			"body": "lmao, they can arrest me for protecting my privacy if they want. They just have to find me first.",
			"time": 1565333592945,
			"files": "[]"
		},
		{
			"id": "5128182c-d1c9-4d02-aed5-ad73ee10e062",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "b",
			"thread": "0dbe9c93-fbe6-42c2-8601-4a44f0082cde",
			"body": ">>d7a0f193-b7eb-48ff-a61f-1bf79a76a426\nHey kid, **wanna bomb the american government?**",
			"time": 1565367842655,
			"files": "[]"
		},
		{
			"id": "7735bf83-8f4c-4cef-942e-86586ade2f2f",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "b0cfa239-461f-481e-87b9-1ed5fd58eaed",
			"body": "The usernames are terrible. It changes everything when we can recognize each other, I dont think theres ever been a single namefag or avatarfag I didnt grow to hate",
			"time": 1565375910633,
			"files": "[]"
		},
		{
			"id": "07eb3f90-89a4-4611-8309-b36dc9a326b2",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "25e41ec7-13d5-4a07-881a-b3b05b3ec8a1",
			"body": ">>eb979972-1213-4efd-84aa-9dcdd8a66f89\nI didnt need to do any of this, unless you cant read this I guess.",
			"time": 1565376179714,
			"files": "[]"
		},
		{
			"id": "70fcdb25-88c5-4800-8a21-cefc7e93caa3",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"subject": "Internet security for Boomers and other mental deficients",
			"body": "Here Im going to explain how to isolate your online activity from your physical identity and why you dont need TOR browser as long as you trust your VPN. Now that 8chan is a terrorist organization this is mandatory minimum knowledge you need to **shitpost online safely** so pay attention\n\n==What you should be concerned about==\nThe most obvious way Mossad is going to identify you is with your IP, but if that were all they could do we wouldnt live in an advertisement driven dystopia ready to send you a targeted advertisement for toilet paper if you make the mistake of watching youtube while you shit. The bare minimum you need to understand to keep yourself safe from our jewish overlords is how Javascript and cookies work to turn your internet browser into the most effective spyware thats ever existed, and how to tell it to fuck off.\n\nFirst youre going to install 2 tools and start using firefox instead of google chrome. Obviously you can do more than this, but youre an idiot and this is where you start. If you dont already use an adlocker install ublock origin as well.\n\n==cookie autodelete==\nyoure going to configure this to automatically delete all cookies on url change with a zero second delay. Cookies are like niggers, sometimes you need 1 or 2 on your computer for the sake of diversity quotas, but the vast majority are not only functionally useless, theyre actually harmful and should be eliminated **automatically with a zero second delay**. It might take you a little while to learn to recognize them, but some cookies serve to keep you logged into websites and these are mostly benign adna ctually convenient. As far as i can tell these are the only cookies that do anything beyond virtue signal to google analytics so you might want to keep them. If the average website puts 30 cookies onto your computer, 1 of them serves a purpose.\n\n==noscript==\nyoure going to leave this on the standard configuration I guess, but from now on whenever you visit a website youre going to take a quick second to open up this panel and determine which scripts are necessary for site functionality, and which ones are watching you masturbate. If a site needs 1 script to function, the other 40 scripts are spyware so its a good idea to get in the habit of using this and learn how to use it well.\n\nWe do all this because Javascript can read your cookie data in addition to all the other shit,  its a really big deal.\n\nYoure already doing most of what TOR browser does for you at this point but you can fill in the blanks here **you can also not use firefox in fullscreen mode like tor suggests if you really think your screen resolution is something unique, but most of you are honestly fine**. its important to note that a lot of the following is redundant as long as you dont enable javascript on a website, but NOT ALL JAVASCRIPT are bad, so take 5 minutes and follow these instructions.\nhttps://www.privacytools.io/browsers/#about_config\nadditional notes:\n>Ever notice that tor browser runs like shit? thats the about:config option to isolate cookies to first party. It says on the site as well, but DO NOT ENABLE THIS if youre using cookie autodelete. Its redundent and it actually makes exhentai unusable in addition destroying your performance.\n>If you disable browser fingerprinting you will exprerience the same white image bug torposters experience here. Disable it anyway, update the site script you fucking boomer.\n>do not change cookie behavior if it appears as 4, thats a custom setting from cookie autodelete\n>you should set firefox to clear everything except cookies and logins on close, because cookie autodelete already does that, except you can set more specific rules.\n>If you enable these settings you wont be able to use things like yandex or google search **youtube works, switch to invidio though, you can make an account and subscribe to all your favorite ecelebs with less effort than any of this was**, this is because they think youre a bot. Thats great, that means its working. You might also recieve additional captchas elsewhere as well, live with it.\n\nIf youve followed these instructions, and also erase every instance of mozilla.com from about:config, your browser is now harder to track than TOR browser is without any of the inconvenience. so what else does TOR do? It hides your ip. As we all know, a lot of TOR nods are run by the cia or some shit, so even better than that is a trustworthy VPN. I wont tell you what I use, but its sure as shit not that sketchy as fuck Nord VPN that everyone in the world suddenly got a sponsorship for. Do some research and buy one you fucking incel. TOR is now useless, you protect yourself from online fingerprinting better than tor does, and your ip is hidden, did you think TOR was magic? Thats a hollywood hacker fantasy. The next thing you need to learn to do is **install gentoo** because of course this is all useless if youre running windows.",
			"time": 1565381599956,
			"files": "[{\"name\":\"unklar.jpg\",\"thumb\":\"65cebf1af03032548b192e538fc9859ef1e36ad5-thumb.jpg\",\"size\":26022,\"type\":\"image/jpeg\",\"original\":\"65cebf1af03032548b192e538fc9859ef1e36ad5.jpg\",\"directory\":\"13CiguQujy3Uj58UyfqVX5mvaUTao4mw1U\"},{\"name\":\"162ad2691d4cbff664f703ded5438f9a_480.jpg\",\"thumb\":\"85778e274e903d30068ed7c2c9d2dd29514dc6fc-thumb.jpg\",\"size\":48068,\"type\":\"image/jpeg\",\"original\":\"85778e274e903d30068ed7c2c9d2dd29514dc6fc.jpg\",\"directory\":\"13CiguQujy3Uj58UyfqVX5mvaUTao4mw1U\"}]"
		},
		{
			"id": "783f10e8-f383-49c6-88b3-73f7fefbb6c9",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "70fcdb25-88c5-4800-8a21-cefc7e93caa3",
			"body": "(continued from \"Do s\" because it just fucking cut me off)\n\nDo some research and buy one you fucking incel. TOR is now useless, you protect yourself from online fingerprinting better than tor does, and your ip is hidden, did you think TOR was magic? Thats a hollywood hacker fantasy. The next thing you need to learn to do is **install gentoo** because of course this is all useless if youre running windows.",
			"time": 1565381902686,
			"files": "[]"
		},
		{
			"id": "dd986263-fabd-485f-815b-bfd3019f5d18",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "b0cfa239-461f-481e-87b9-1ed5fd58eaed",
			"body": ">>a4bf7624-553e-439d-a171-945330c3f8f5\nIt must be. Thats probably why the admin didnt notice",
			"time": 1565382265717,
			"files": "[{\"name\":\"sdgsdg.png\",\"thumb\":\"c03bb92edee1dd302e9277dcf4e0e1ab63d08245-thumb.png\",\"size\":71046,\"type\":\"image/png\",\"original\":\"c03bb92edee1dd302e9277dcf4e0e1ab63d08245.png\",\"directory\":\"13CiguQujy3Uj58UyfqVX5mvaUTao4mw1U\"}]"
		},
		{
			"id": "750094b5-fe2a-4535-8de3-7f721f647daa",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "970aea10-19b2-473a-9ed1-da6aea653c7b",
			"body": "Maybe it only looks like less people are here becasue most of the posts were from the same few federal agents?",
			"time": 1565382486080,
			"files": "[]"
		},
		{
			"id": "628d3e61-d633-42bf-a8ea-e9aa212455dc",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "aa8ff392-866d-4d81-b3eb-697f3e3ceabb",
			"body": "I dont undrstand why the ip thing is so effective at scaring people off tbh, obviously a place like 4chan and regular 8chan is harvesting ips as well, if your ip concerns you then you should already have methods in place to hide it",
			"time": 1565383933313,
			"files": "[]"
		},
		{
			"id": "4380647b-497a-40c6-aa65-36a429d9850b",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "b0cfa239-461f-481e-87b9-1ed5fd58eaed",
			"body": ">>ca264716-1d86-453e-b7de-28d4130fe69d\nI dont like the idea of anyone even having the option to see usernames. if it could somehow be obfuscated entirely that would be great, because right now it feels like im using reddit or some shit. Obviously im not going to disable it for myself as long as the bug is present either, that would put me at a disadvantage.",
			"time": 1565384204595,
			"files": "[]"
		},
		{
			"id": "a0bcff1b-987e-4338-ad9b-e1f0cf8c7d7e",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "70fcdb25-88c5-4800-8a21-cefc7e93caa3",
			"body": ">>8f0275c0-481f-44a5-9158-95c48b064f2f\nExplain to me in what way tor is superior to this then. I dont trust the tor network at all, and ive found it to be completely redundant in any case. The only point of failure here is your VPN provider. You can run all of your internet activity on Tails if you want, but youre wasting your time. A lot of this isnt necessarily applicable to zeronet either due to the way zeronet works, this is a general browsing guide for the most part. I would not trust zeronet on Tor if i didnt have a VPN behind it, and I dont trust TOR to begin with",
			"time": 1565385385030,
			"files": "[]"
		},
		{
			"id": "15707c57-e399-43e4-99dd-4b67f3a3643a",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "70fcdb25-88c5-4800-8a21-cefc7e93caa3",
			"body": ">>8f0275c0-481f-44a5-9158-95c48b064f2f\nThis is for you then. Ill show you how to route zeronet activity through tor without using the tor browser.\nFirst go to the arch wiki and follow these steps\nhttps://wiki.archlinux.org/index.php/ZeroNet#Tor\nYou now route all zeronet activity through tor in the background and can access it from any browser",
			"time": 1565386171868,
			"files": "[]"
		},
		{
			"id": "736e0997-09cb-41a7-90b7-9e0ca51893cd",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "70fcdb25-88c5-4800-8a21-cefc7e93caa3",
			"body": ">>b0d6b52c-5b06-4a7d-8897-cba2a4b29bfc\nYour own personal ip address is the websites ip address, so is mine and so is everyones whos hosting it. Look at your traffic if you dont believe me, even just leave the console open when you run zeronet.py. Internet traffic on zeronet is not routed through your browser, it is uploaded directly to the internet from your computer and the website loadsfrom a file in your zeronet folder. Follow the steps and youll see. Do you undrstand how tails runs all internet traffic through tor? this is the same way this configuration works >>15707c57-e399-43e4-99dd-4b67f3a3643a",
			"time": 1565386801068,
			"files": "[]"
		},
		{
			"id": "2fac011e-f953-46ff-ab63-051e5f682b01",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "70fcdb25-88c5-4800-8a21-cefc7e93caa3",
			"body": ">>b0d6b52c-5b06-4a7d-8897-cba2a4b29bfc\n>why is it redundant\nTor browser hides your online fingerprint (lazily) and it protects your ip address. I just showed you how to protect your online fingerprint (effectively) and a good vpn protects your ip even better than the TOR network.",
			"time": 1565387016468,
			"files": "[]"
		},
		{
			"id": "70235717-283c-4951-b905-062609be968a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "970aea10-19b2-473a-9ed1-da6aea653c7b",
			"body": ">>b5aa1a65-4c06-4788-a37f-e29d2edb6cd2\nThats probably part of it, I posted a few times with the old id before I switched and they seemed to upload fine **or maybe thats just what they want me to thing **",
			"time": 1565388707933,
			"files": "[]"
		},
		{
			"id": "fdc859cf-995d-4569-8ed5-6866b6af21fb",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "70fcdb25-88c5-4800-8a21-cefc7e93caa3",
			"body": ">>20d5a407-312f-44ee-ad26-b557ca1296ed\nIf youre just here to shit on VPNs you can feel free to, Im only explaining to you how things work.\n>you didnt even mention canvas fingerprinting. \nI did, you didnt read my thread.\nedit: its covered in the about:config link, every tor confiuration is there.\n\nTOR browser is frefox you brainlet, its just shitty NSA firefox",
			"time": 1565389679459,
			"files": "[]",
			"last_edited": 1565389831859,
			"subject": null,
			"capcode": null
		},
		{
			"id": "dea4ca9c-34ee-4e99-a4b0-2905fed4d587",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "70fcdb25-88c5-4800-8a21-cefc7e93caa3",
			"body": ">>20d5a407-312f-44ee-ad26-b557ca1296ed\n>the javascript in your browser\nZronet javascripts run from your computer as well. The entire site runs from a folder in your computer",
			"time": 1565390184737,
			"files": "[]"
		},
		{
			"id": "f3e3e798-4f78-4eff-a8ed-4551631267e4",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "70fcdb25-88c5-4800-8a21-cefc7e93caa3",
			"body": ">>20d5a407-312f-44ee-ad26-b557ca1296ed\nHere I made this for you because you didnt read how zeronet works before you came here. I hope it helps. It clearly shows how the system works in a friendly way\nNow Ill just remind everyone that the above privacy tips are not for the zeronet, theyre for the internet.",
			"time": 1565390861037,
			"files": "[{\"name\":\"Blueprints.png\",\"thumb\":\"91bff7271f49258606a369f7ff3f3d96cc906566-thumb.png\",\"size\":13760,\"type\":\"image/png\",\"original\":\"91bff7271f49258606a369f7ff3f3d96cc906566.png\",\"directory\":\"13CiguQujy3Uj58UyfqVX5mvaUTao4mw1U\"}]"
		},
		{
			"id": "91041153-645a-41f7-92fe-c4fac5cd1977",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f9af075f-7555-4274-91e6-282390f63244",
			"body": ">>aece14ac-417e-4c6a-9791-96166a99ee48\ndid it work?",
			"time": 1565392067073,
			"files": "[]"
		},
		{
			"id": "6a9e35cf-3070-4757-acda-82f2c7559344",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "70fcdb25-88c5-4800-8a21-cefc7e93caa3",
			"body": ">>532c80b2-ead5-4837-a2a4-5d9dc082a58e\nwelcome boomer",
			"time": 1565392895327,
			"files": "[]"
		},
		{
			"id": "9d26bce9-4f64-4ec5-b73a-e629ca205ceb",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "70fcdb25-88c5-4800-8a21-cefc7e93caa3",
			"body": ">>16f42b43-70c3-4416-a970-5abc5341baef\n>he didnt understand my drawing\nThis is not the internet, zeronet works like this >>f3e3e798-4f78-4eff-a8ed-4551631267e4 Thats why you can configure it through tor without tor browser like this >>15707c57-e399-43e4-99dd-4b67f3a3643a\nTor is absolutely a honeypot, but thats fine because VPNs arent, and my vpn protectsmy DNS",
			"time": 1565393758927,
			"files": "[{\"name\":\"Woman-Laughing.gif\",\"thumb\":\"acb36ea8467d40835582a5aa84884aba5d6586e9-thumb.jpg\",\"size\":44390,\"type\":\"image/gif\",\"original\":\"acb36ea8467d40835582a5aa84884aba5d6586e9.gif\",\"directory\":\"13CiguQujy3Uj58UyfqVX5mvaUTao4mw1U\"}]",
			"last_edited": 1565393881027,
			"subject": null,
			"capcode": null
		},
		{
			"id": "9393c7d8-ebdf-4836-a053-9a461ec17227",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "70fcdb25-88c5-4800-8a21-cefc7e93caa3",
			"body": ">>a9c954e6-33ec-408d-93e6-3f37bc02717d\nthank god it wont be pinging my ip then, because even if this somehow isnt routing all zeronet activity through tor like everything seems to imply, I use a VPN. \nWhat youre saying is also true when youre using tor browser anyway, they recommend you only visit .onion sites through the browser because its essentially useless software for protecting your privacy outside of the .onion network.",
			"time": 1565395546374,
			"files": "[]"
		},
		{
			"id": "d6b84f0f-c9ca-4ef7-a5db-a35efa412abd",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "70fcdb25-88c5-4800-8a21-cefc7e93caa3",
			"body": ">>5858a83f-b1ee-46b6-bdf5-8f51bccda387\nWell we've come full circle here, your browsers proxy configuration doesnt matter because youre not sending data out through your browser, youre sending it through your computer. \nOn that subject, I also run a proxy, it forces all of my network traffic through my vpn network and protects my dns on a system level, a level appropriate for Zeronet\n==BUT==\nthis is also all irrelevent, because when I start TOR in the background, when it opens a connection to the tor network, it also routes all activity through a proxy, whichis clearly visible in the logs upon runnin zeronet.py\n\nEDIT: this is why you open localhost 127.0.1 in your proxy configuration on tor browser. That excludes yourself from tor.",
			"time": 1565396480143,
			"files": "[]",
			"last_edited": 1565396618743,
			"subject": null,
			"capcode": null
		}
	],
	"boards": [],
	"modlogs": []
}