{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1610394057_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "\"the borrower is the slave of the lender.\" Proverbs 22:7\n\nInformation technology stack is delivered as layered services. \nSaaS (Software as a Service)\nPaaS (Platform as a Service)\nIaaS (Infrastructure as a Service)\n\nParler was providing a SaaS for people to consume.\nParler was consuming the PaaS provided by AWS (Amazon)\nAmazon as the provider of IaaS and PaaS, knows everything that Parler does on top of their stack. \n\nIn the case with Parler, it was most likely not Parler but Amazon that turned over their data.\n\nTake Away Lesson: Build on your OWN IT Stack.\n\nHence, Zeronet/Decentralized internet, i.e. you hosting your own data on the internet. You own the data. \n\nSpectre of evil is afoot and is coming to enslave, seek and destroy. Are you ready?\nThink you can stand own your own?  \n\nAs for me, I'm a sinner, bound for hell to pay for my sin against God. Yet, in God's mercy, He sent his Son, Jesus to pay the debt of death in hell that I should have paid, when Jesus died on the cross for me and the sins of the world and rose from death on the third day,  showing that God's wrath and justice was satisfied.  Hence, Jesus  can offer eternal life to all who repents, trusts in him.  \n\nIn the world of uncertainty, oppression and evil that is to come, I have no where else to turn but the God who made the Heaven and Earth.  I personally will trust the God who came to save us from death.\n\nWhat will you trust in?",
				"added": 1610573527
			}
		],
		"1610506203_12BSeHrHaz9gyid4AFkYdFYRcmFsSQkGAN": [
			{
				"comment_id": 2,
				"body": "Here is one of many possible approaches you can try...\n\nStage 1:  Survey Stage -  Welcome to Decentralized Internet\nLook around.  Try not to post anything. You are most likely easy to be tracked.  Use this stage to just take in all the crazy, illegal, perverted, wickedness of man hearts and the vetting of frustrated patriots longing for freedom.\n\nStage 2: Baby Step Stage - Ween off of Big Brother Information Technology that is tracking you.  You may want to consider getting off Windows OS, Chrome browser, Edge, and others on to opensource Linux Distro like Debian or Linux Mint.  Get used to Opensource Information technology. \n\nStage 3: Crawl Stage - Install Tor and Zeronet in your linux distro. Learn to mount storage and try running Zeronet on that storage. Try using different persona. Don't posting anything crazy.  You still maybe leaking data, trace-able back to you.\n\nStage 4: Walk Stage - Learn to encrypt your hard drive or portions of hard drive, i.e. debian/luks/zulucrypt and try running Zeronet there.  I pray that you are a patriot and not a pedo. Again, use different persona. \n\nStage 5: Jog Stage - Learn Qubes OS. Install Zeronet /Tor/ Whonix in encrypted partition.  \n\nStage 6:  Run Stage - Seed the content you like to preserve history and information you want people to know.  Spectre of evil always lies and spreads propaganda.  Help preserve truth and share truth. Invest and share terabytes and petabytes of data.\n\nStage 7: Pass the baton - Please learn as much about IT as possible and train others.  Freedom is not Free.  It will cost you time to learn and teach the next generation.  Information is power.  Big Tech has it. Patriots don't.  Unless this changes, we will most likely remain slaves.\n\nLastly,  God exists and knows all things. No one will be able to hide from God who made the heavens and earth. Day of judgement will be faced by all when they transition from this life to next.  You will have to give an account for everything you ever thought and done before God/judge who knows all things.  If you are like me, a sinner, we deserve death and hell.   Yet, in God's mercy, He sent his Son, Jesus to pay the debt of death in hell that I should have paid, but Jesus died on the cross for me and the sins of the world and rose from death on the third day, showing that God's wrath and justice was satisfied. Hence, Jesus can offer eternal life to all who repents, trusts in him. \n\nI pray that anyone reading this will get right with God. Find out how...\n\nhttp://goodpersontest.com/\n\nThanks for wanting to help build the decentralized internet. Good Luck.\n\nPH76",
				"added": 1610576664
			}
		]
	},
	"comment_vote": {}
}