{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1538835755,
			"title": "Admin panel for zeroblog",
			"body": "Is anyone working on an admin panel for zeroblog? It really needs one for non-coders.",
			"added": 1538835754
		},
		{
			"topic_id": 1580580478,
			"title": "WebStudio",
			"body": "I found something called WebStudio that also lets people create decentralized websites and it seems to be a lot better than Zeronet because you don't need to know coding. With Zeronet you can clone a blog but you still have to be able to code if you want to add banners or change the background of your site, but with WebStudio it has a WYSIWYG so you don't need to code anything at all. Give WebStudio a try. https://getweb.studio/ Zeronet is a four year old project and it seems that Zeronet has failed at creating a way for non-coders to create a nice website on Zeronet, so if your a non-coder try WebStudio.",
			"added": 1580580476
		},
		{
			"topic_id": 1624835115,
			"title": "Zeronet Dead",
			"body": "Since Zeronet is dead and nofish is apparently no longer around, maybe someone should create something better than Zeronet.",
			"added": 1624835112
		}
	],
	"topic_vote": {
		"1525943428_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"1532143672_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa": 1,
		"1533074344_1NpBDnpSGkXGKLtq9x75Lb846dfgLCWNtn": 1,
		"1534737982_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": 1,
		"1535195569_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1535303318_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1535211258_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": 1,
		"1535186853_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1535458873_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"1535451536_1EoqbSwvxRuRKj7vpeK79wuGXdpq2wbqfM": 1,
		"1534205182_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": 1,
		"1536337537_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1537956104_1HrQ48VceWqeGu9qmC2Y8VxUsGNSJwbNiV": 1,
		"1538689247_1GnUB5DsGg5LkeHr8hP5Qg2hcVTRVYEH6f": 1,
		"1536069895_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": 1,
		"1538835755_129GZPA7VpPa3YaRRW2ani34CaowY5hYB8": 1,
		"1580580478_129GZPA7VpPa3YaRRW2ani34CaowY5hYB8": 1
	},
	"next_comment_id": 18,
	"comment": {
		"1521962808_1He5bfTsvbUXQXp5HCuKLdYutSiqDUjBrs": [
			{
				"comment_id": 1,
				"body": "The general public will never use Zeronet because Zeronet doesn't  have the features that people want. Zeronet is a three year old project and I've tried to get people to use it for all those years but I've had no luck. The main reason I found that people won't use it is because the Zeroblog does not have some form of an admin panel so non-coders can create a their own nice website without getting into the CSS and other files to code. Most of the general public hate coding. The people I've tried to get to use Zeronet wanted to create a nice Zeroblog with an Image for the background instead of having the white background but to do that you have to get into the CSS file and code and they were unwilling to do that. The only way Zeronet will be more popular with the general public is to give them the features they want but I don't ever see that happening. Creating a admin panel for Zeroblog should be top priority to attract all the people who hate coding.",
				"added": 1523138646
			}
		],
		"1523121756_1AYaudumvgqdyrJs42jyAG9FUUmGHsoiFh": [
			{
				"comment_id": 2,
				"body": "Sex",
				"added": 1523145663
			}
		],
		"1532143672_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa": [
			{
				"comment_id": 3,
				"body": "I wish the Zeroblog had features like GrapesJS. I hate coding and I don't want to get into the CSS file or any other file to code anything. I want to be able to drag and drop images in my site to use as a header, banner or background.",
				"added": 1532644149
			}
		],
		"1534205182_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [
			{
				"comment_id": 4,
				"body": "Create a content management system for Zeroblog so people can change the background from white and add a header without needing to get into the CSS file or any other file to code. Some people hate coding and the Zeroblog needs a lot of improvement.",
				"added": 1534590807
			},
			{
				"comment_id": 6,
				"body": "> [pad](#comment_1_1HeEWnYs69J1BV4P4niDN775yBVqNijhjG): Zeroblog just a demo site of Zeronet, you can make a zite yourself, like Hexo\n\nYou can make a zite like Hexo if you want to code shit. I hate coding. I want an admin panel or something for ZeroBlog so I can add a header or change the background of the Zeroblog, something like the admin panel that wordpress has. Non-coders will never create a zite on Zeronet if there is coding involved. The white background of Zeroblog looks like crap and I want to use a photo for the background.",
				"added": 1534689709
			},
			{
				"comment_id": 7,
				"body": "> [daniell](#comment_33_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe): ZeroMedium can achieve it.\n\nWhat's ZeroMedium?",
				"added": 1534725402
			},
			{
				"comment_id": 8,
				"body": "> [daniell](#comment_34_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe): I can tell you how to change the background, if you want.Regarding about coding, me too, I don't like it.I'm creating a app to create zites without programmation knowledge, with events: conditions/actions in a visual event sheet editor.\n\nI hope the app your working on turns out ok.",
				"added": 1534726077
			}
		],
		"1534470841_1Kh3qLdTH2QKewUb6cWZa2dMveMT5EcVer": [
			{
				"comment_id": 5,
				"body": "No it won't.",
				"added": 1534646314
			}
		],
		"1535303318_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 9,
				"body": "You can name my site after I create one, but you might have to wait a very long time before I create a site because I'm still waiting for someone to create some kind of admin panel (CMS) for Zeroblog before I create my site.",
				"added": 1535305991
			}
		],
		"1535211258_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 10,
				"body": "I think Decentralized networks will always lose till they become more user friendly for non-coders. Example I've been waiting to create a Zeroblog for three years now but still haven't because Zeroblog has no CMS similar to wordpress's. To create a good looking Zeroblog with a header or banner you have to get into the CSS file to code. You can't even use a photo for the background without getting into a file to code it in. I hate coding with a passion like many other people do and we will not use anything that involves coding. If people who create projects like Zeronet really want to attract people to Decentralized networks you have to be willing to give user what they want. I've tried to get many people to use Zeronet and create a site on it but they wouldn't for the same reason I wont create a site on Zeronet, it doesn't have any form of a CMS. Decentralized networks will always lose till they start creating things like CMS's for us non-coders.",
				"added": 1535308770
			}
		],
		"1538835755_129GZPA7VpPa3YaRRW2ani34CaowY5hYB8": [
			{
				"comment_id": 11,
				"body": "> [geekless](#comment_18_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): I'm currently working on various zeroblog improvements. [...]\n\nWell in wordpress it's called the dashboard, but what I mean is the Zeroblog needs a dashboard/admin panel that people can use to add a header or change the background and maybe  few more features. Here's a pic of what I'm talking about and I marked a red square around some of the things in the pic that Zeroblog needs. https://imgur.com/a/4hNidWH",
				"added": 1539386188
			}
		],
		"1552858206_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 12,
				"body": "Most people I've tried to get to use ZeroNet won't use it because there's no kind of admin panel for the Zeroblog. The Zeroblog is ugly as fuck and to make a nice site you have to code in the CSS file or the other files. Most people hate to code and they will not use anything like Zeronet. Zeroblog needs an admin panel similar to the one Wordpress has. An admin panel for the blog would attract a lot more people but sadly the creator of Zeronet seems unwilling to create a admin panel of some kind for Zeroblog. Zeronet is a four year old project and even I don't have a Zeroblog yet because there's no admin panel for me to create a nice site.",
				"added": 1553803648
			},
			{
				"comment_id": 13,
				"body": "> [beeurself](#comment_1_1GRDS1JW6LWg1GJJR8tBMyVFg7nkyX9ZRg): ZeroNet is new bro\n\nZeronet is not new, it's a four year old project.",
				"added": 1553803912
			},
			{
				"comment_id": 15,
				"body": "> [quantumworld](#comment_340_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Omg, this may end up being a community thing where everyone gets a headache reading how to code html. It cant be as bad as learning lisp.\n\nI can't stand to code at all, that's why I wish someone that likes to code would create an admin panel for Zeroblog for us non-coders.",
				"added": 1553873808
			}
		],
		"1580580478_129GZPA7VpPa3YaRRW2ani34CaowY5hYB8": [
			{
				"comment_id": 16,
				"body": "> [filips](#comment_424_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Decentralized... But still relies on centralized servers and domains. Although it uses Blockstack ID, it uses it in centralized way. [...]\n\nI tried the link you posted but when I hit the edit button it wants me to grant NOSANDBOX permission and next to it says Dangerous so I didn't grant permission because I didn't know if it was safe to do so.",
				"added": 1580681536
			},
			{
				"comment_id": 17,
				"body": "> [bigbadbob](#comment_963_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Learn to code...\n\nfuck coding",
				"added": 1624651309
			}
		]
	},
	"comment_vote": {
		"85_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1,
		"2_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa": 1,
		"87_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1,
		"5_129GZPA7VpPa3YaRRW2ani34CaowY5hYB8": 1,
		"242_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"34_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": 1,
		"35_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": 1,
		"4_129GZPA7VpPa3YaRRW2ani34CaowY5hYB8": 1,
		"9_12H7WVVjVfiug4YJ3zcMnTzbbKSWf8Uk7g": 1,
		"11_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4": 1,
		"23_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4": 1,
		"12_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"9_1CJ5AjJzyRcmGBtRrd7qrtik88see6Mjj3": 1,
		"1_1HrQ48VceWqeGu9qmC2Y8VxUsGNSJwbNiV": 1,
		"3_1GjNQs4ic7BAXGaA6tGQgcZULxYW2taRY6": 1,
		"18_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"4_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"83_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"425_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"8_1PYse2fs94EphqFApJnUCBPa4wMNTvTddn": 1,
		"7_1PYse2fs94EphqFApJnUCBPa4wMNTvTddn": 1
	}
}