{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1553596906,
			"title": "How would EU's Article 17 (previously called Article 13) affect ZeroNet?",
			"body": "I guess the question is, rather, \"would Article 17 affect ZeroNet and other P2P services _at all_?\" Below you have an extract from the document wherein Article 17 is established; it explicitly says that it will affect services \"the main or one of the main purposes of which is to *store* and enable users to upload and share a large amount of copyright-protected content [...]\". I reckon that would leave any P2P network out, since it is not the service _per se_ that stores the content, but the user, which would be the one liable for its copyright infringements. Anyhow, I am glad that big corporations have to deal with this upheaval; I wish this really makes a dent on their shields. I know this is a very unpopular opinion, but at the end of the day it is doing more good than harm.\n\nExtract:\n\n\"The services covered by this Directive are services, the main or one of\nthe main purposes of which is to store and enable users to upload and share a\nlarge amount of copyright-protected content with the purpose of obtaining profit\ntherefrom, either directly or indirectly, by organising it and promoting it in order\nto attract a larger audience, including by categorising it and using targeted\npromotion within it. Such services should not include services that have a main\npurpose other than that of enabling users to upload and share a large amount of\ncopyright-protected content with the purpose of obtaining profit from that activity.\nThe latter services include, for instance, electronic communication services within\nthe meaning of Directive (EU) 2018/1972 of the European Parliament and of the\nCouncil 14 , as well as providers of business-to-business cloud services and cloud\nservices, which allow users to upload content for their own use, such as\ncyberlockers, or online marketplaces the main activity of which is online retail,\nand not giving access to copyright-protected content.\"",
			"added": 1553596905
		}
	],
	"topic_vote": {
		"1535458873_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"1553463903_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1552858206_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "Aren't we here precisely to get rid of \"most people\", or mass media? I don't think decentralized networks are suited to take over centralized ones, in terms of mass adoption. Our aim should be to make them functional, as in getting them to satisfy our ordinary needs regarding access to information and communication. That's it. If we can begin to do that, we will emancipate from the clearnet eventually.",
				"added": 1553360502
			}
		],
		"1553530288_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": [
			{
				"comment_id": 2,
				"body": "Good job, dude.",
				"added": 1553546355
			}
		],
		"1553596906_1Lh89nAb4YeizEER15JUcpscy37mZwDUer": [
			{
				"comment_id": 3,
				"body": "> [caryoscelus](#comment_108_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): On the other hand, i have no idea whether donations or other optional payments can count as profit; if they do, somebody may try to fit 0net into breaking this if/when it becomes law, though my impression is that this article is directed at large corporations. But what do i know?\n\nYes, I was thinking about donations and how they would qualify as indirect profit as well. Anyhow, if someone is benefiting from copyright infringement, by means of donations or otherwise, they can get fucked for all I care.",
				"added": 1553601902
			},
			{
				"comment_id": 4,
				"body": "\"The Copyright Directive protects freedom of expression, a core value of the European Union. It sets strong safeguards for users, making clear that everywhere in Europe the use of existing works for purposes of quotation, criticism, review, caricature as well as parody are explicitly allowed. This means that memes and similar parody creations can be used freely. The interests of the users are also preserved through effective mechanisms to swiftly contest any unjustified removal of their content by the platforms.\"\n\nFrom their final press release http://europa.eu/rapid/press-release_STATEMENT-19-1839_en.htm.",
				"added": 1553613303
			}
		]
	},
	"comment_vote": {
		"811_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"665_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"1_16FndcswfX4YLENW8svDyhUdrmyjSczLtN": 1,
		"633_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"349_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"682_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}