{
	"next_topic_id": 10,
	"topic": [
		{
			"topic_id": 1518942060,
			"title": "PayPal创始人 协助文贵，为全球提供无死角的卫星宽带网络！",
			"body": "他是PayPal创始人，\n他是特斯拉创始人，\n他的飞船30天就可以飞到火星，航天技术远超NASA水平。\n他的猎鹰重型火箭比联邦政府签约的阿波罗火箭更强大且造价更低。\n现在他又要放卫星了，为全球提供无死角的宽带网络。\n他是谁？\n他就是——马斯克，\n一个造福人类，神一样的男人。\n\n**[传播“习氏”真理、全民上街、分房分钱!!!](http://127.0.0.1:43110/zybbs.bit/?Topic:1_1GvFma4ejwEgao2GjFZ8SjwZw4YzPHuFg9/)**",
			"added": 1518942059,
			"parent_topic_uri": "10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		},
		{
			"topic_id": 1520438946,
			"title": "关于修宪...",
			"body": "http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/ \n\n居然有个信息是在为支那丛林暴政进行辩护的，而这种辩护信息居然不在支那专政国的主流媒体上，而是跑到零网来了 — 激烈讨论修宪的一个记录 ... 这种乱象本身说明支那丛林专政国甚至不允许为支那丛林专政辩护的信息在支那国传播，由此可见支那丛林专政国是五千年以来最荒谬的丛林之国。但愿这种奇葩不只是空前的，也是绝后的乱象！ \n\n链接分享：\nhttps://iteoedugr0-my.sharepoint.com/personal/0_xxxo_ga/_layouts/15/guestaccess.aspx?folderid=1a9ac9411acbd40d6be0541eb927a90fa&authkey=AapYrABjsLc5PkF9nj8WDVc \n**[传播“习氏”真理、全民上街、分房分钱!!!](http://127.0.0.1:43110/zybbs.bit/?Topic:1_1GvFma4ejwEgao2GjFZ8SjwZw4YzPHuFg9/)**",
			"added": 1520438944,
			"parent_topic_uri": "10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		},
		{
			"topic_id": 1532419178,
			"title": "The Restoration of America  — The Dawn of A New Civilization! 重振美国、振兴中华",
			"body": "The Restoration of America \n— The Dawn of A New Civilization!\n重振美国、振兴中华\n— 新文明征程!\n\n\n1) The essence of American vitality \n\"Make America Great Again!\" \nIt’s not just a slogan belonging to President Trump only. It’s a public consensus supported by the whole USA nation, also by the majority of mankind who firmly support the fundamental essence of modern civilization — a Purified Civilization initially launched up by the Puritans centuries ago, who upgraded the medieval Christendom into modern civilization, by setting up a clearly-defined constitution that firmly protects human rights by gun rights.   \n\nThe secret why the USA can keep sustainable vitality is not two-party competition or checked balance system, but is a Purified Faith in human civilization which respects God, respects the human rights of individuals, and more importantly, protects such principle with constitutional rule of gun rights.  \n\nBefore the Purified culture with gun rights system is destroyed, it is impossible for any one to realize their attempt to overthrow the whole USA federation, including the notorious atheism gang from East Asia, which is described by Steve Bannon as a country with \"incalculable power\". \n\nAmerican system is not perfect yet. There're loopholes, which may be infiltrated by the atheism dictatorship virus from East Asia by various secret means.  Accumulation of those secret infiltrations can pose big threat against the security of the whole federation. \n\nNo matter how imperfect the current system is, the USA still keeps leading influence of human civilization. When the whole nation is awakened up by the accumulated infiltrations from the atheism gang, American whole system will react vigorously, to fight back the evil forces, to protect the bottom line of justice.  One prominent example is related to the former BAI(Beijing Intelligence Agent) Guo Wen Gui whose open identity is a real estate businessman ( http://www.washingtonexaminer.com/china-reportedly-used-us-casino-magnate-and-gop-fundraiser-steve-wynn-to-lobby-trump-and-it-almost-worked/article/2638366 ). \n\nPresident Trump is good at trading anything, but can be timely prevented from trading justice, which is the soul of American value. \n\nIndian Saint Mahatma Gandhi once said, \"All compromise is based on give and take, but there can be no give and take on fundamentals. Any compromise on mere fundamentals is a surrender. For it is all give and no take.\" - \n\nThere is an over-crazy environment of ecommerce which tends to make any tangible thing as \"tradable\", with an evil attempt of creating money worship to replace the holy purified civilization which respects both God and individual dignity. Despite such crazy environment, many top-rank elite in the USA keep good common sense of the basic principle on justice, as is shown in the above typical case. \n\n2) The Dark War — Concerns about New Cold War \n2.1) New Cold War or Dark War? \n\nBased on the inside secrets disclosed by the former BIA \n( https://www.rfa.org/mandarin/zhuanlan/xinlingzhilyu/dayangliangan/mind-10092017172828.html ) , there's a BGY Infiltration scheme which aimed to control prominent figures in both the East and the West through various means, including bribery, lucrative business stimulation and blackmail by scandal maneuver;  furthermore, there’s a 3F scheme focused on destroying the USA system by all possible means so as to frustrate the efficiency of the leading civilization.   \n\nSo concerns arise, with experts discussing about the New Cold War between major powers.\n\nHowever, the New Cold War will be surely be ended quickly, since the features of both BGY and 3F schemes show that the atheism regime in China mainly operate based on collusion of crimes, money lure and intimation by scandal traps against some prominent figures in the society, which means none of the spies choose to work for the atheism gang based on voluntary choice of the so-called \"communism\" ideal which was once proclaimed by them to be \"glorious and holy\", but was not believed by any one of themselves!    \n\nInstead of the New Cold War, BGY and 3F schemes are in fact a new form of war — a Dark War which was started nearly 20 years ago after the Tian An Men Incident in 1989, and aimed to corrode the whole USA system by various secret means, which can't operate openly and may paralyze easily upon exposure in light.  \n\n2.2) To End the Dark War \nTo fight back against the Dark War, the most efficient way is to expose all those crimes in light.  A typical crime by the atheism gang is the man-made disaster of Malaysian Airline MH370 Incident, which not only killed family members of professional doctors who helped with organ harvesting in order to save the top-rank masters of the atheism gang, but also killed many top-rank Beijing Intelligence Agents who know too much of the inside stories of the atheism gang!  \n\nInspired by the USA's strategic adjustment, more and more people are enlightened up by the bright course which will Make America Great Again, with despair replaced by hope! \n\nDespite the panic among the atheism regime which made them tighten their control of the cyberspace in mainland, China, the number of cyberspace activists rose quickly from hundreds up to dozens of thousands, and still rising on the way with more and more people joining in the bright course voluntarily.  They’re spreading not only the truth, but also a new era of civilization!  \n\nThe rising troop of cyberspace volunteers include people from all walks of life. Many of them are from Family Church Association (Family Church is often called as \"Underground Church\" in the atheism China, since the physical expansion of church is curbed down by tightened procedures of censorship, people seeking God, seeking Truth have to gather through unregistered, private family churches).   \n\nBy integrating the shocking truth, the bright course of a new civilization is spreading quickly, with overwhelming influence.  \n\nSome teenagers are too angry to keep calm, they expressed their rage openly and were beaten by the secret police brutally; which could not be stopped for the time being, for some awakened police officer who now begin to hate the atheism system also see that before the jungle dictatorship system is converted into modern civilization, no one is secure, including the dictators themselves.\n\nIn view of the special circumstances, experienced technicians are actively working on a new way of message delivery based on uncensored, decentralized P2P network which was originally developed by BitCoin Technology.  \n\n  2.3) Global Enemy — The Fake-Communism Dictatorship \n\nThe cyberspace has somehow become a battlefield. Fortunately, the cyberspace activists are not alone, since more and more well-educated netizens join in the campaign voluntarily.  More importantly, at the international stage, though Chinese people suffer the bitterest disaster caused by the atheism regime, due to USA’s leading influence with strategic adjustment at a critical stage of history, more and more governments and institutions in other parts of the world are awakened by the necessity to fight against the spreading of the atheism dictatorship virus.  \n\nThis is a very inspiring trend of civilization, which not only helps volunteers conquer many obstacles, but also attract more and more volunteers to join in the bright course, since the bright course not only stands for justice, but also attracts the majority of mankind, which itself indicates that victory surely belongs to the just course, and the dawn of a new civilization is coming nearer and nearer! \n\nMore and more incidents show that the so-called Confucius Institutes are actually a disguised tool for spreading atheism dictatorship virus.  Senator Rubio and other top-rank elite in the USA make efficient decisions to contain the abnormal expansion of Confucius Institute.   \n\nThere’re many other exposures of the atheism virus, such as fake democracy advocator exposed — a man named \"李伟东\" cheated nearly USD300,000.00 annually from American fund for democracy.  But that guy is actually a spy who worked for the atheism gang, and used all those money for the destruction of USA federation.\n\nSuch phenomenon might be tolerated by the former USA administration in the past. But things are different now.  Even President Trump can't neglect the voice of justice, so in the new circumstances that aim to Make America Great again, active efforts should be made in order to let some democracy institutions support the right course which complies with the American value.\n\nThe repeated activities of history have show that, common sense of justice may be more important than splendid political slogans!  \n\nIn the atheism-gang-dictatorship China, there’re organized terrorism crimes that occur frequently, from organ harvesting to oppression of Christendom, with conscientious Christian associates pronounced to be guilty for their good deeds on rescuing orphans, which is termed as a crime of “buying popularity” that may impact the miserable confidence of the fake-communism dictatorship.   \n(the url of true story https://www.rfa.org/cantonese/news/priest-01062017084816.html ) \n\nIn the fake-communism-dictatorship China, there’re some very unimaginable absurdities, such as destruction of Church Cross, hanging of the notorious Blood-Red Flag over the holy Church Cross with an evil attempt to satisfy those non-confident atheism officials' dirty aspiration for proof of their authority that the holy Church is now obedient under the leadership by those vicious gang masters who are not even communists either, for one simple logic, the word \"communism\" itself has the connotation of \"equality on wealth\", yet it’s ridiculous that a small group of atheism gang masters who dare not disclose their personal wealth to their own people now proclaim that they have high confidence, with the holy Church Cross also obedient to their greedy dictatorship of power!  \n\nPresident Trump often emphasizes the absurdities of \" fake news\" and \"fake media\". Such emphasis is necessary, for it’s indeed ridiculous that some traditional medias choose to overlook those simplest absurdities and pretend not to see a simple logic — under those unimaginable appearances of fake-\"communism\" confidence which is as greedy as to make God obedient to the Atheism Gang, how many crimes are covered?  \n\nAs to those traditional medias who pretend to be blind, are they affected by the atheism gang's BGY and 3F schemes? Are they betrayers of the American value? \n\nAt a critical stage of history, righteous and wise people should often reflect upon such phenomena. \n\nThe former Chinese democracy leader Liu Xiao Bo (刘*晓*波) once said, \"we’re not the enemy of the communist party” (我们不是中国*共*产*党的敌人). \n\nThese words are partially correct, but it’s not crystal clear enough. For one simple logic, the small group of the atheism gang leaders even dare not to disclose their own wealth to the Community of their own people, to the Community of their own party members, which are proclaimed to have dozens of millions of members, how can they have the authority to represent a true communism, or a true communist party?  \n\nThey are nothing, but just a small group of atheism gang!  \n\nSo the actual enemy of true democracy advocators is just a small group of atheism gang leaders. That small group of the atheism gang leaders are not only the enemy of justice, they are now being hated by an increasing number of ordinary Chinese people; and furthermore, they are becoming the biggest shame of the Communist Party itself, which was once the largest organization in the world, but now with no one believing in the organization, which may quickly collapse at any moment. \n\nMore dramatically, due to the over-confidence that their party-flag hung over the Church cross symbolizing that the atheism gang have made God obedient to them, such crazy arrogance finally becomes the last straw that breaks the camel's back. \n\nWith wide-spreading exposure of crimes by the atheism gang, the majority of civilized world is awakened up by the necessity to fight back against the atheism dictatorship virus! \n\nThe term \"Fake-Communism Dictatorship\" might not be used by other people in the past to describe the atheism gang in mainland China.  But one broad common sense is that the atheism gang controlled China is NOT a republic, with none of the party's representatives elected by Chinese people ( as is emphasized by the well-known program — 'Death By China: How America Lost Its Manufacturing Base\"  https://www.youtube.com/watch?v=mMlmjXtnIXI ) \n\n3) The Phenomenon of Guo Wen Gui’s Revenge \n\nSteve Bannon may describe China as a country with \"incalculable power\" so as to better show his talent of politics on how to compete with \"incalculable power\".   \n\nBut the atheism gang’s powerfulness is only superficial. Domestically, the gang’s dictatorship confidence mainly relies on \"Real-Name Verification System of Choppers\" (菜刀实名制), which was very difficult to understand by Chinese people as well, not to mention foreigners. After the BIA Guo Wen Gui’s exposure of crimes going in Xin Jiang everyday, now it’s understandable that the gang is afraid that choppers going freely at markets may result in raged Uygur people's rebellion with choppers, while the atheism gang's mercenary troops are no longer willing to dedicate their lives just for a few dictators' pleasures.  \n\nOn high-tech aspect, there's no chance to exceed the USA's leading technology. The thing that can be done is the Dark War — secret infiltration through any means, including the BGY, 3F schemes. \n\nNo matter how sophisticated their plan is. The jungle nature of the atheism regime remains the same. \n\nThe internal struggle among the atheism regime, which is without any bottom line of conscience, finally goes out of control, with former BIA Guo Wen Gui who has no choice but to defect the gang, choose justice, in order to protect himself and his family members. \n\nThe prominent features of Guo Wen Gui's revenge include below points:\n3.1) The Dross to be Discarded \nWith nearly all of his family members suffering bitter torture by the atheism gang, Guo Wen Gui still insists on obedience with the puppet ruler Emperor Xi whom he praised as A Great Emperor in one thousand years (千年圣君)。 Such phenomena show that China's long history of dictatorship mainly relies on the \"Eunuch Dross\" which are skillfully hidden in some of Confucious ideology that emphasizes obedience without principles. \n\nConfucious obedience ideology may work well in the past when many people were illiterate.  \n\nAs part of the 3F scheme aimed to destroy the USA civilization, the stopped Confucious Institute was involved to export \"Eunuch Dross\" from the atheism China into the USA, in order to paralyze people’s common sense of justice. \n\n3.2) New Possibilities \nAs a man with middle school education, real life in the USA certainly helped improve his consciousness of individual’s human rights.  Despite some tint of \"Eunuch Dross\" in his mentality, Guo Wen Gui conquered the fear imposed upon him by the atheism gang, and openly fought back. \n\nThe special tint of \"Eunuch Dross\" may be a special tactic by him in order to paralyze the arrogant atheism gang? Some observers like to explain in this way, yet it's highly possible that the \"Eunuch Dross\" may be totally discarded finally, since America is a land of opportunities for all beings to constantly improve themselves! \n\nAs a businessman without much political sensitivity, Guo Wen Gui may need some time to see the trend of development, that some adjustment may be needed, with the slogan of \"Not Oppose Emperor Xi\" replaced by \"To Resume Constitutional Democracy in China\", since a broad sense of Constitutional Democracy is much more important than being restrained on a narrow topic on the appropriateness of \"To Oppose or Not To Oppose\" certain politician or puppet ruler. \n(以恢复宪政的整体概念取代反对/不反对某个具体政客，具有最广泛的正义诉求意义！)\n\nThough there are things that need improvement, the ongoing incident of Guo Wen Gui's Revenge is a great phenomenon with great symbolic significance!  \n\nThe majority of netizens in China have similar education level as Guo Wen Gui. Guo Wen Gui’s Revenge indicates that most of ordinary people are clearly aware of the importance of individual’s human rights. Even if the Dictator Mao Tse Dong went onto stage once more in contemporary China, there'd be no chance for them to resume another Cultural Revolution that destroys the nation. \n\nBased on all these inspiring facts, more and more people see the prospect of a peaceful revolution coming nearer and nearer.  It’s the dawn of a new civilization!\n\n顺便加个汉语说明：\n既然枪支的火药来自于中华文明，因此重振美国就是“振兴中华”，真正的中华文明，在海外才有 —— 美国文化是吸收了中华文明之后，反而比赵宋王朝更加规范地传承了儒家文化的“核心理念”，与“己所不欲、勿施于人”的普世原则相对应的，是对自由的规范—正当的自由是“不侵犯别人的同等权利的自由”(freedom without violation of other people's equal rights)。\n\n没有“持枪权” 的民主自由是跛脚的，容易被希特勒、斯大林、麦卡锡等政客们颠覆。真正的普世价值需要“持枪权捍卫真理”的“普世原则”来保驾护航，在郭文贵乱象引起越来越多人们关注的时代，希望中华文明在重振美国的文明征程上重返东亚大陆，坚守“持枪权捍卫真理”的“普世原则”，推动世界的持久和平！\n\n**[香港和大陆联合起来！洗雪国耻，重振中华！ ](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)**\n**[废除网络柏林墙，洗雪国耻！ 零网 — 零封锁，全民行动 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)**",
			"added": 1532419175,
			"parent_topic_uri": "10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		},
		{
			"topic_id": 1534693977,
			"title": "和平革命三部曲",
			"body": "(比较繁忙的朋友，看看摘要、革命檄文和说明C部分，就可以。)\n\n摘要：\n和平革命三部曲：\n1) 标语革命 —抛弃伪共，恢复宪政！\n把反对目标界定为一小撮“伪共”“黄俄蛆”，与基层党员无关！这有利于最大化地减少潜在的冲突，促进和平革命。 \n2) 独立工会革命 — 扎根本地的工会、维权联盟比频繁地进京维权更实在，符合长远之道！\n3) 民变和兵变 — 恢复选举，恢复宪政！是彻底保障退伍老兵利益的长远之道。\n额外说明：\na) 郭文贵病毒 —砸烂太监糟粕，是为了更好地促进郭文贵维权。\nb) 文明转型 — 和平革命的终极目标，恢复中华文明，“持枪权捍卫真理”的“普世原则”。 \nc) 营救董瑶琼符合“重振美国”的战略，更是在维护“自由女神”！\n\n+ **前言—革命檄文**\n 详情见：\n...... \nhttp://127.0.0.1:43110/zybbs.bit/?Topic:5_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg  \n（好像几十KB的文字额度快用完了） ",
			"added": 1534693973,
			"parent_topic_uri": "10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		},
		{
			"topic_id": 1596775198,
			"title": "Why face mask is a must?",
			"body": "Photo Illustration is in the below URL:\nhttp://127.0.0.1:43110/168x9d56MSBjrq6TYoDaSvxXSux3nPzw37/?Topic:2_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/Why+you+must+wear+a+mask",
			"added": 1596775193
		},
		{
			"topic_id": 1601582366,
			"title": "It's A Special Festival in A Special Year ! ",
			"body": "http://127.0.0.1:43110/1H1DB7PXNUNo8LNLYZZZKd5qaRadLg8Uzk/?Topic:1601582223_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/Special+Greetings+on+A+special+Festival \nSee if the eCard can be displayed smoothly?",
			"added": 1601582360
		},
		{
			"topic_id": 1613048641,
			"title": "A small test ….",
			"body": "It's the eve of Spring Festival. \nMany people are witnessing the coldest winter in the past dozens of years. \nAfter the brutal cold winter season, spring will come with everything warmed up. \nAt the unusual beginning of 2021, wish everybody peace and good health! \n\nA special greeting card is uploaded in two ways: \none is displayed as content of message, \nhttp://127.0.0.1:43110/168x9d56MSBjrq6TYoDaSvxXSux3nPzw37/?Topic:4_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/An+unusual+Spring+Festival \nthe other is displayed as **file attachment**:\nhttp://127.0.0.1:43110/1GupPNSnTxRq14Jk6crAQ4ceu8rdRoWLtx/?Topic:1613047820_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/An+unusual+Spring+Festival \n\nThere's feedback that access to Zeronet encounters more difficulties in China after a recent upgrade of GFW in late January.  Any friends from China?  \n **Try to see if the photo can be displayed well on mobile version Zeronet**.",
			"added": 1613048634
		},
		{
			"topic_id": 1614357511,
			"title": "Happy Lantern Festival!",
			"body": "[Happy Lantern Festival! ](http://127.0.0.1:43110/1H1DB7PXNUNo8LNLYZZZKd5qaRadLg8Uzk/?Topic:1614354645_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/Happy+Lantern+Festival)\n \nPlease share the glorious pursuit with other friends.\n\"You and I have a rendezvous with destiny.\nWe'll preserve for our children this, the last best hope of man on earth\" – **the Freedom Beacon as represented by America's Constitution**.",
			"added": 1614357503
		},
		{
			"topic_id": 1634709308,
			"title": "Can vaccines work?",
			"body": "[Great Awakening ](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1634708439_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/Great+Awakening)",
			"added": 1634709299
		}
	],
	"topic_vote": {
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1519826875_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 1,
				"body": "顶起来！ \n居然有个信息是在为支那丛林暴政进行辩护的，而这种辩护信息居然不在支那专政国的主流媒体上，而是跑到零网来了 — 激烈讨论修宪的一个记录 ...  这种乱象本身说明支那丛林专政国甚至不允许为支那丛林专政辩护的信息在支那国传播，由此可见支那丛林专政国是五千年以来最荒谬的丛林之国。但愿这种奇葩不只是空前的，也是绝后的乱象！",
				"added": 1520438729
			}
		],
		"1521244899_1G2szKPSGdhKtyLitMs8qtHCjshkCv8Sjt": [
			{
				"comment_id": 2,
				"body": "若为自由故，(“故”/“顾\"?)\n二者皆可抛！\n\n非常好！\n**[全民共振、全民上街!顺应天意、符合民心! ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:5_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD/)**\n**[零网节点—数据战争！ ](http://127.0.0.1:43110/168x9d56MSBjrq6TYoDaSvxXSux3nPzw37/?Topic:1_1DbrSfnbumfV45oVXiprzK6N9qSHCsWGx/)**\n\n**[江泽民丧尽天良... 太恐怖了！没理由不转发！](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:3_1DbrSfnbumfV45oVXiprzK6N9qSHCsWGx/)**\n\n链接分享：\nhttps://iteoedugr0-my.sharepoint.com/personal/0_xxxo_ga/_layouts/15/guestaccess.aspx?folderid=1a9ac9411acbd40d6be0541eb927a90fa&authkey=AapYrABjsLc5PkF9nj8WDVc",
				"added": 1521275854
			}
		],
		"1596087920_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD": [
			{
				"comment_id": 3,
				"body": "其它细节见零网的FAQ页面：\nhttp://127.0.0.1:43110/NewGFWTalk.bit/?Topic:37_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ/+FAQ",
				"added": 1596277323
			}
		],
		"1596775198_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg": [
			{
				"comment_id": 4,
				"body": "If those particles won't break through the brain barrier, then what problems resulted in the serious symptoms that\n  **the infected people can no longer detect smells and taste** ?   \n\nThis issue should be studied by more scientists.  \nThe above short essay was produced by a retired scientist, whose major was not in medical sector.  However, he's very curious mind about how the brain controls one’s action.  At the severe situation of global pandemics, he chose to spend much time on the research of why people infected with the disease can lose smell and taste …  \n\nHope more professionals can join in the topics.",
				"added": 1596865466
			}
		],
		"1623735445_1NWMPpwxp9EJJZFrhDybeZdmg48zwx5urf": [
			{
				"comment_id": 5,
				"body": "[Sites for Learning … ](http://127.0.0.1:43110/1GupPNSnTxRq14Jk6crAQ4ceu8rdRoWLtx/?Topic:1623818490_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/Sites+for+Learning)",
				"added": 1623818583
			}
		],
		"1623961112_1ASusrn34PQJr8ipd1LcBamudPHxQEWheA": [
			{
				"comment_id": 6,
				"body": "For [Special Topics …  ](http://127.0.0.1:43110/1H1DB7PXNUNo8LNLYZZZKd5qaRadLg8Uzk/?Topic:1624002662_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/Special+Topics)\n[50 K limit to be avoided! ](http://127.0.0.1:43110/1H1DB7PXNUNo8LNLYZZZKd5qaRadLg8Uzk/?Topic:1624003018_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/50+K+limit+to+be+avoided)\nNo one can reach the Gate of Heaven. People can get infinitely close to it!  \n...",
				"added": 1624003169
			},
			{
				"comment_id": 8,
				"body": "More efforts are needed,\n[ to light up the civilization. ](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1631979939_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/Candle+May+Light+or+Be+Extinguished)",
				"added": 1631980245
			},
			{
				"comment_id": 10,
				"body": "[Science is just a special part of human being's recognition of the universe ... ](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1634708439_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/Great+Awakening)",
				"added": 1634715045
			}
		],
		"1631962234_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY": [
			{
				"comment_id": 7,
				"body": "[Candle May Light or Be Extinguished! ](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1631979939_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/Candle+May+Light+or+Be+Extinguished)",
				"added": 1631980077
			}
		],
		"1634119367_1KVqHY2XVEyYYjmSaoH3v6qNRGLqkf5nDz": [
			{
				"comment_id": 9,
				"body": "For people in East Asia where abnormal data blockade often occurs, the flexible ways can help reduce the obstacles.\n[Great Awakening ](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1634708439_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/Great+Awakening)\n[50 K limit to be avoided! & code to enhance Browsing … ](http://127.0.0.1:43110/zybbs.bit/?Topic:6_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p/a+Special+code+related+to+trackers)",
				"added": 1634709649
			}
		],
		"1636071087_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 11,
				"body": "[Special Thanksgiving! ](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1637764188_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/Special+Thanksgiving) \nThe festival card can be displayed smoothly or not?  ",
				"added": 1637764291
			},
			{
				"comment_id": 12,
				"body": "[Higher passions!  ](http://127.0.0.1:43110/168x9d56MSBjrq6TYoDaSvxXSux3nPzw37/?Topic:7_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/Happy+Thanksgiving)",
				"added": 1637806754
			}
		]
	},
	"comment_vote": {}
}