{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1577863956,
			"title": "How to install kxoid P2P message",
			"body": "How to do that can you send the pictures and tell me. Please.",
			"added": 1577863955
		}
	],
	"topic_vote": {
		"1577863956_15Jmu7DkbxqtQ6mFhu6gLT1pbiMM55oywF": 1,
		"1578289189_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1
	},
	"next_comment_id": 14,
	"comment": {
		"1577863956_15Jmu7DkbxqtQ6mFhu6gLT1pbiMM55oywF": [
			{
				"comment_id": 1,
				"body": "> [shiruka](#comment_25_1MHdmQEW2HS6sZNgfi3VmtegHc6fUEyVkW): if you mean peermessage, then go here: http://127.0.0.1:43110/1CeEXxqemr5CcVQAAmrW13QYwZV4kAkQz6/ and then just click install. If there is no install option it's because you probably have it installed.  [...]\n\nIf i do in my phone, what should I do?",
				"added": 1577899120
			},
			{
				"comment_id": 2,
				"body": "> [shiruka](#comment_25_1MHdmQEW2HS6sZNgfi3VmtegHc6fUEyVkW): if you mean peermessage, then go here: http://127.0.0.1:43110/1CeEXxqemr5CcVQAAmrW13QYwZV4kAkQz6/ and then just click install. If there is no install option it's because you probably have it installed.  [...]\n\nIt still doesn't working, can you send the pictures to me for instructe?",
				"added": 1577899781
			},
			{
				"comment_id": 3,
				"body": "> [filips](#comment_371_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): What isn't working? Could you please send picture of problem?\n\nDo you have any contact ways and I will sand the problem?",
				"added": 1577936906
			},
			{
				"comment_id": 5,
				"body": "internal error, OSError, dlopen failed library \"library 32\" not found",
				"added": 1577937584
			},
			{
				"comment_id": 6,
				"body": "> [filips](#comment_372_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): You can use ZeroMail or create public issue on GitHub repository.\n\nSorry, my zeromail sometimes has a trouble, maybe for receive only, would you mind in send by protonmail?",
				"added": 1577989033
			},
			{
				"comment_id": 7,
				"body": "> [filips](#comment_373_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Oh, you are trying to do this on phone? Then it is a bit harder as ZeroNet for Android currently only supports only version in Python 2.7. [...]\n\nI want to ask the folder is peer Message or peer Db is it the same folder?",
				"added": 1577990176
			},
			{
				"comment_id": 8,
				"body": "> [filips](#comment_374_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): It is PeerMessage. But you need to create that folder yourself.\n\nOMG, I still can't assces for PeerMessage, there still has a bug, can I send you pictures by protonmail?",
				"added": 1578037611
			},
			{
				"comment_id": 9,
				"body": "> [gitcenter](#comment_1175_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I have just fixed a bug in PeerMessage, can you please try reinstalling it?\n\nSorry, I repeated many times for installation. It still doesn't work.",
				"added": 1578039086
			},
			{
				"comment_id": 10,
				"body": "> [secretcr](#comment_9_15Jmu7DkbxqtQ6mFhu6gLT1pbiMM55oywF): Sorry, I repeated many times for installation. It still doesn't work.\n\nWhen I do it by phone",
				"added": 1578039118
			},
			{
				"comment_id": 11,
				"body": "Actually I have a screen shots but I forgot how to type that code for upload my screen shots",
				"added": 1578039571
			},
			{
				"comment_id": 12,
				"body": "> [gitcenter](#comment_1177_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Hm, looks so. We might want to ping @mkg20001 though. Anyways, I still can't help without screenshots.\n\nHi please find my profile in zeroMe, I post my screen shots on it",
				"added": 1578058883
			}
		],
		"1578289189_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 13,
				"body": ">testuser3\n\nDo you have any informations for Hong Kong movement?",
				"added": 1578302341
			}
		]
	},
	"comment_vote": {
		"3_15Jmu7DkbxqtQ6mFhu6gLT1pbiMM55oywF": 1
	}
}