{
	"next_comment_id": 6,
	"user_name": "Mappedmind",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "If I search on youtube, \"assad didn't gas his own people\", it seems like a lot more mainstream news sites showed up then use to show up in the past. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1536981099",
			"date_added": 1536982134
		},
		{
			"comment_id": 2,
			"body": "I did see on secular talk:\n\n \"Alex Jones Responds To Bans By Putting On Donkey Mask, Melting Down\"\nhttps://www.youtube.com/watch?v=gS00jcIBRsA\n\n, that youtube did take down a lot of Syria affiliated channels. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1536981099",
			"date_added": 1536986486
		},
		{
			"comment_id": 3,
			"body": "@Colkurtz: There was a story once where supposed chemical attacks were due to the bombing of a near by chemical plant. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1536981099",
			"date_added": 1536997801
		},
		{
			"comment_id": 4,
			"body": "@Solved: How is the fact that google removed a lot of so called \"Syrian Affiliated Webites\" Russian propaganda? I'm not saying that the removed sites were or were not Syrian Affiliated but such censorship seems like the precursor propaganda for a war. Were the removed sites also propaganda? Maybe or maybe not but now people can't decide for themselves and most news is to a degree propaganda anyway, if for no other way they won't say bad things about their sponsors.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1536981099",
			"date_added": 1537203121
		},
		{
			"comment_id": 5,
			"body": "Let's not forget about the pulling the babies from the incubator lie.\n\nFrom Wikipedia:\n\"Nayirah al-Ṣabaḥ during her testimony. It was later revealed that she was the daughter of the Kuwaiti ambassador to the United States and that her testimony could not be verified.\"\nhttps://en.wikipedia.org/wiki/Nayirah_testimony ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1536981099",
			"date_added": 1537259172
		}
	]
}