{
	"title": "JZA Blog",
	"description": "Blog for the Cryptoverse and Altweb.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 16,
	"demo": false,
	"modified": 1469088147,
	"post": [
		{
			"post_id": 15,
			"title": "Back to ZeroNet",
			"date_published": 1469087958.735,
			"body": "I have been out of zeronet for a while but now I am returning and seen how to get this zeronet automated. Seems that because I create a particular user everytime I want to start the service I need to do:\n<code> sudo -u zeronet /opt/zeronet/zeronet.py</code>\nDoesnt look that bad, but it took me a good 10 minutes remembering the damn command. I should probably do an alias or something."
		},
		{
			"post_id": 14,
			"title": "Weird disappointment",
			"date_published": 1464002089.769,
			"body": "So today I had a weird disappointment on my user skills, I find out to my surprise that my right hand is kind of useless on the keyboard. Turns out that I mostly use my index for everything on the keyboard. Sure my thumb is always on my spacebar and also my pinky sometimes operate the arrow keys every now and then. However I find it trully hard to believe that I cant type P or O because... well my index always was faster. \n\nSo from now on I am on a quest to try to type fully with my right hand's fingers. I find the single quotes hard to type as well as all those weird =-)( keys. \n\nOh well let see if I can pick it up by the end of the month."
		},
		{
			"post_id": 13,
			"title": "Developing for offline webapps",
			"date_published": 1463002491.017,
			"body": "I am looking forward to improve my software to create an offline version of the webapps I have been developing. Starting with moving resources from a LAMP to Python-Django. However since I am on the Python bug, I am looking also into the possibility to generate new sites with other languages like a frontend webapp. Most of the one I have seen use NodeJS, but it could be a frontend-only framework like CoffeeScript or something that allows me to have frontend databases.\n**ZeroNet** use frontend apps ONLY, and here is why I think is relevant, having my apps working \"front-only\" can help with some of the locations that I can promote the apps with async of their data.\nThis means that anyone can just provide \"temporary wifi\" to a device and be able to update the local database without needing to have constantly updating the data."
		},
		{
			"post_id": 12,
			"title": "Teaching about code",
			"date_published": 1462995996.362,
			"body": "Recently I finally start teaching my friend how to code. And it seems interesting how learners can conceptualize coding. At the same time a talk with another friend made me re-watch some of the _Seymour Papert_ talks about computers and learners. The learning process, and the way to assimilate through experiences, gave me the ideas to position the knowledge in a way that they can discover it on her own. \nI agree that spoon feeding them is not a great situation but also creating the environments to get them to research what they don't know. \nMy motto at the moment is:\n<blockquote>\" Code is more like a sport than a history lesson. So you got to practice, practice and practice. \"</blockquote>\nHope this is good enough to get them get the idea that they need to create projects and research on what they need to learn to achieve their goals."
		},
		{
			"post_id": 11,
			"title": "Cavs stomping on the East",
			"date_published": 1462902002.419,
			"body": "Cavs have been incredible since the start of the Playoff with a 8-0 run with a high posibility of going 12-0 to the Finals.\nI would love to see this finals with Kirye and Love actively on the court and going full potential on offense. However there are a lot of defensive issues that might not be as kosher as days past. Specially when Miami dominated on D and got Wade and LeBron on open court. Let see if these 3pt exibitions can outscore the potential adversaries in the west. \nHope next week the scenario is much better and can get the real picture of who would be the candidates to win this year championship."
		},
		{
			"post_id": 10,
			"title": "Cryptoverse and altweb",
			"date_published": 1461067793.754,
			"body": "The Cryptological internet are the networks that are all based on criptology, some are based on Peer-to-peer too, but it includes also centralized services or just are security practices on top of this traditional Internet services. Something like using OTR (off the record) plugin on top of a regular Facebook/XMPP network.\nAlternative webs or altwebs are commonly known as darknets, like Freenet, Tor, I2P, and others. \nThe way these protocols aligned are through different mediums, languages and exchanges. Some like Tor are managed through an array of applications that monitor de traffic of the nodes and analyze for potential threats to the nework. Others like Freenet, are more monopolistic on the way information is being managed on the network and focused on trying to gather most of the data locally. I am still not an expert on I2P and how things are managed on the inside. But expect a more thorough report about this in the future.\nIPFS is also a smart protocol to manage files and other things on a network that is decentralized as well as used to move large files across these networks. \nThe biggest issue at the moment is that most of all these technologies are a bit too young or too underground to be used at lenght, so is hard to connect with a community that is constantly exchanging information. Also the quality of this information is not exactly the best. In all regards, is good to understand them in case is needed or want to be used for a particular porpouse."
		},
		{
			"post_id": 9,
			"title": "ZeroWiki links",
			"date_published": 1458669688.948,
			"body": "So I need to learn a new wiki language, I think is markup which is the same language than this blog. However I need to learn the upper level elements like internal links vs external links and image format manipulation as well as tables and other objects. \nInternal links are double bracked enclosed while the external ones is a link withing parenthesis and a label with single quotes, like this:\n\\[ something \\]\\(http://....)"
		},
		{
			"post_id": 8,
			"title": "Namecoin domains lessons",
			"date_published": 1458518443,
			"body": "So after registering a handful of domains. I finally think I got it locked down. The registration process is not that hard, but is good to be logging everything you do. I registered all my domains from the CLI which might be a very hard way to achieve this since there is a GUI and my system supports it plently. But I really didnt feel like experimenting with it. \nFirst step was backing up my wallet, and loading it with some namecoins. The command to generate an address was surprisingly, **getaccount &lt;namecoinaddress&gt;** and **getaccountaddress &lt;account&gt;**. To list the addresses you could use the command: **listaccounts**. \nDecide what to register?\n-------------------------------\nYou need to decide what to register, an __application?__ __domain?__ or __identification__. So a/name d/name id/name would be your choice. The next command you need to understand is **name_new**. \nThe registration process takes a while, because the blockchain needs to catch up after every registration. 12 blocks to be exact. is good to track the transaction."
		},
		{
			"post_id": 7,
			"title": "Finally domains for everyone",
			"date_published": 1457948457.45,
			"body": "I was finally able to register domains on the namechain, I used to have a wallet but the vps is no longer accesible for me, meanwhile I was able to \"build\" the namechain on my laptop. The process was painful, specially since the first build didnt had wallet capabilities and the other builds didnt really work on me. Finally I had to download the namecond binary, and was able to operate the wallet from CLI which is what I wanted on the first place. However the first big issue was the blockchain, I am not sure how this happened but the blockchain from the fisrt package was only a few hundred MB while the second one went the whole full 40GB having my disk completely boarked. I had to delete a bunch of big files to maek it able to reach the blockcount. But in the end I was able to get my full wallet and start registering domains. I wont keep this wallet for obvious reasons and will delete this blockchain as soon as I get the privatekeys setup and removed from the transactions in a TXT. \nBut meanwhile I was able to get all these domains:<ul><li> JZA (all caps)</li>\n<li> TQVCancun/tqvcancun</li>\n<li> bitnacion</li>\n<li> Ƀitcuners</li></ul>etc.\nUnfortunately I cant get uppercase names to get on ZeroNet, but at least I am holding something that could work in the future."
		},
		{
			"post_id": 6,
			"title": "IPFS and ZeroNet",
			"date_published": 1457836027.016,
			"body": "This is a great post that I saw on the ZeroNet blog of <a href=\"http://127.0.0.1:43110/14weBe8CQHen9U1LG4gE2bxg76QMCGsQoS/?Post:12:IPFS+%28La+pareja+perfecta+de+ZeroNet\">Bond</a>. Fortunately here is the summary of what he said on his post, not that you couldnt find it on IPFS website. But basically IPFS is a decentralized protocol just like ZeroNet. Is similar to a Bittorrent swarm, and like Bittorrent is decentralized in nature. <br />\n<strong>Why IPFS?</strong> Well basically because of the distribution of larger files will make it hard for ZN to be able to host everything through ZN local data. So instead IPFS takes care of these larger files. <br />\nTambien existe una especie de web-filesystem inteligente donde tiene la contabilidad de todos los archivos existentes en la red y si un archivo se sube, la red fusionara ambos sin necesitar duplicarlo. \n<em>That's freakin' awesome, right?</em>"
		},
		{
			"post_id": 5,
			"title": "Issues with Tor",
			"date_published": 1457507024.653,
			"body": "So today I was able to update my site. But with great pains, turns out that Tor resources werent up to par with what I needed. \nThe torrc was missing the following items:\n```CookieAuthentication 1\nCookieAuthFileGroupReadable 1\nCookieAuthFile /var/run/tor/control_auth_cookie```\nHowever it wasn't as easy, the Tor resource had issues with some of the instruction set.\nPermissions issues from the zeronet group and the tor group.\nFinally some non existent file at /var/run/tor/control_auth_cookie\nIn the end and after all permissions were given the site ran but there was some post configuration to be done, like move my previous site to the new data/ home."
		},
		{
			"post_id": 4,
			"title": "New blog post",
			"date_published": 1457507013.642,
			"body": "Blog post body"
		},
		{
			"post_id": 3,
			"title": "Editing this blog and templates",
			"date_published": 1457277260.491,
			"body": "Not really big on doing tutorials but with the newness of this technology and my screwup on the tiles and all of that. I want to call out on how to edit the default template. It seems the HTML is not very standard UI, the left menu is not expanded as it should be. So if you want to have a side menu, here is what you do.\nFirst the BODY seems to have some margin 10px all around, so take that off and if you want to keep the right that's fine, but eliminate the top and left one.\nSecond is the height of the .left class which will now expand to the bottom of the window. Mainly because there is a width, but not height, 100% should do the trick.\nTo make sure you dont end up with the content of the left panel way too high, you can insert a padding-top so the content keeps at the same position that you saw it. 10px will compensate for the margin: 10px you took off earlier.\nSo this is it, try to put a background color to make sure that the whole thing fits on the window. Enjoy applying more styles and changing colors to the fonts. \nThat's it."
		},
		{
			"post_id": 2,
			"title": "Hello CC",
			"date_published": 1457256070.944,
			"body": "First of many posts to come, ZeroNetwork seems like the future of the altweb. (yes I am coining the term #altweb )"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}