{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1612323913,
			"title": "Sorting on this forum",
			"body": "Is there a way to sort by top posts of all time/month like Reddit? I am currently on Android and the site has no such option.",
			"added": 1612323912
		}
	],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1612299574_1AjDVZkWjXocDcGAapochi8b2M2h7CnGBu": [
			{
				"comment_id": 1,
				"body": "> [vinegarlover](#comment_1_1Phd1v4EgBWqCeAjGD7gtspkpFL8Z6GbkP): No. i'll download from wherever i want to and check the hashes like your supposed to. get the fuck outta here.\n\nAh, what a valuable addition to the discussion you have contributed.",
				"added": 1612323146
			},
			{
				"comment_id": 6,
				"body": "> [hatebot](#comment_3_13kyRkukBSEXhXA3w72Gv1mo5n7Pgtuqg5): Well, he has a point. If the hashes are correct, it doesn't really matter where you got the file from.(I just don't see why you wouldn't download it from the official sites at decent speed..)\n\nI understand that source of a file doesn't matter if the checksum match. But when choosing between downloading from official server at decent speeds v/s doing from a third party protocol that's still in beta at crawling speeds; the former is the logical site.",
				"added": 1612365340
			},
			{
				"comment_id": 8,
				"body": "> [asdf111](#comment_12_1FwNEGpdNnQE4H83JHLKWLk56H7xwLFSTN): that reminds me of the because it is there story. the guy who tried to climb mount everest in the 20s was asked why he would want to climb it and he answered because it is there. we are could be downloading linux from zeronet to prove that it works.i have not downloaded anything yet though\n\nIs anyone even serving Linux ISO's currently here?",
				"added": 1612940966
			}
		],
		"1610754180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "> [sword000000](#comment_91_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie): 1.Briar is currently the highest standard of secure communications [...]\n\nI have seen quite some communities using Matrix for communication. As for Briar, I am aware of it but it's user base is still quite low, isn't it? Jami is new for it, will see how it is.",
				"added": 1612323372
			},
			{
				"comment_id": 4,
				"body": "> [astrr232](#comment_27_1ufDwJisEDriKQxYJSz2HuUhgqAG15JyL): The problem with briar is that it's text-only, you can't even send images with it -_-\n\nReminds me of IRC :p. I assume Briar is in early stages of development then?",
				"added": 1612364335
			}
		],
		"1612323913_13JWeXQebtUHRPphNJ5EpjodwKGViDkaEE": [
			{
				"comment_id": 3,
				"body": "> [mfs](#comment_111_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W): I poked around using a full blown desktop browser and I do not see that option. 08chan and Zerovoat both support it.\n\nSorry, I am new to this platform. I thought the only way to access this is via one of their 'apps'. Would a normal web browser also open these sites normally?",
				"added": 1612363694
			}
		],
		"1612320343_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 5,
				"body": "That thing really hit the international media. Both digital and print versions of newspapers carried articles on the impact it had.",
				"added": 1612364436
			}
		],
		"1611787253_139pHaxesZa11czwptXVY62ZrNWUh4NxRQ": [
			{
				"comment_id": 7,
				"body": "> [477](#comment_14_1JprRAdVNFB2etoYRTiT4pnx9qLme3yhB4): I apologize if you're hurt by my word. [...]\n\nAlready, this service is quite slow to load at my end. Is it because of low nos. of peers online? My main issue is won't routing it via Tor make it even slower, to the point of non usability?",
				"added": 1612366263
			}
		]
	},
	"comment_vote": {
		"91_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1,
		"2_13JWeXQebtUHRPphNJ5EpjodwKGViDkaEE": 1,
		"1_13JWeXQebtUHRPphNJ5EpjodwKGViDkaEE": 1,
		"111_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1
	}
}