{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1565197761_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 1,
				"body": "> Also plz no leftypol, they're braindead morons too. [...]\nNot sure what's up with the hate for leftypol... they've been consistently anti-censorship and anti-corporate, even if their old BO was nuts",
				"added": 1565223848
			}
		],
		"1565207629_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 2,
				"body": "Already seeing calls (blue checkmarks) for everyone that browsed 8chan to be put on a terror watchlists...\nSheepish morons jumping to conclusions and supporting baseless witchhunts have created more tyrannies than any \"lone wolf terrorist\"\nA China-tier social credit system with perpetual surveillance from the cradle, that bans all 'wrongthink' is the end-goal here.",
				"added": 1565224183
			}
		],
		"1565211401_17Z4Nn5umMdKxmgypwHXfe34rqnPPAq6nP": [
			{
				"comment_id": 3,
				"body": "\"Border Security\" is buzzword and a scheme to funnel money to corporations, organized crime and other oligarchic outlets.\nThe feds already have the tools to investigate, track, and crack down on businesses violating labor and migration laws. But they don't. I wonder why that is...\nLikewise, the \"sovereignty\" crowd never seems interested in unionizing illegals - which would remove them as an easy source of revenue - or improving labor rights and living conditions abroad - which would stop them from coming entirely.\n\nThe only people that suffer are the desperate poor, and tax-paying workers.",
				"added": 1565224937
			}
		],
		"1565163816_1JwnMobAn82kxrY5FXnjwMBFbLyziYijwa": [
			{
				"comment_id": 4,
				"body": "> [223556](#comment_25_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): Barbara Spectre\nBarbara Spectre is a 'literally who'. And most \"pro-immigration\" lobbying comes the private sector, the owners and execs of which are majority non-jewish.\nAlso no one is getting \"genocided\" because a bunch of people aren't having more children. Which btw, is mostly because of the cost of child-rearing, and stagnant (real) wages since the late 70s.\n\nWhy is it that the alt-right spends so much time ranting about minorities, and so little on solving the underlying causes for immigration, poverty and unemployment?\nAnd let's not forget that most \"based\" politicians and pundits worshiped at places like /pol/, voat and gab are rabid zionists themselves.",
				"added": 1565229985
			},
			{
				"comment_id": 5,
				"body": "> [lumenwood](#comment_6_1KZKeEyDG87Yz9dVn9q4GVaPp78YWtRxxn): What was the Holodomor again?\nYou're just deflecting, which is a typical alt-right tactic.\nBut I'll bite: The Holodomor was famine affecting predominantly the eastern Ukraine and the Caucasus (and not just Ukraine as often stated). One following severe droughts, and exacerbated by bureaucratic incompetence, cruelty and misguided class warfare.\nNone of that proves what you just said however, nor disprove what I posted.",
				"added": 1565230654
			},
			{
				"comment_id": 6,
				"body": "Adding to that: Periodic famines have plagued Russia since before (and during) Tsarist times. And were only ended during Soviet times. (Who cares about all the ethnic Russians, Ukrainians, and others who died during Imperial times, right?) The total death toll - excluding demographic deficits - has been estimated as between ~2 and 4 million.\nContrast that with the death-toll in Nazi occupied Europe, which - even when excluding jews - surpasses over 20 million.\n\nThat's real White Genocide.",
				"added": 1565230991
			},
			{
				"comment_id": 7,
				"body": "> [lumenwood](#comment_7_1KZKeEyDG87Yz9dVn9q4GVaPp78YWtRxxn): A plague is one thing, but the insurrection and takeover of malicious (((Communists))) and deliberate disarmament / mass starvation of Kulaks (farmers) is another story. [...]\nAnd here it is: Typical alt-right hypocrisy.\nThe starvation of millions is an atrocity. But the intentional slaughter of dozens of millions, the systematic annihilation of the Polish nation and it's cultural heritage (See the razing of Warsaw), the strategic bombing of non-military targets (Coventry, Rotterdam, etc.), the genocidal siege of Leningrad (~600,000-1 million deaths), the planned destruction of Paris, the occupation of Czechoslovakia,  the anti-partisan actions in the Balkans and Greece, Generalplan ost, the Dutch famine of 1944, slave labor of native White Europeans? Just a statistic.",
				"added": 1565231864
			},
			{
				"comment_id": 8,
				"body": "> [223556](#comment_28_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): The holocaust never happened. It was a lie they have been milking for the last 75 years.\nAnd here it is, more deflection.\nI didn't even mention the holocaust, and already stated all figures posted exclude jews. \nHere's a question: If the holocaust didn't happen, what justifies Hitler's rampage across Europe, and the wholesale slaughter of dozens of millions of White Europeans?",
				"added": 1565272303
			},
			{
				"comment_id": 9,
				"body": "> [lumenwood](#comment_9_1KZKeEyDG87Yz9dVn9q4GVaPp78YWtRxxn): Self defense is not a rampage, Stalin had already mobilized 40,000 tank ahead of time to attempt a mass blitzkrieg (ironic lmao) of Europe. The entirety of Europe would've become a Bolshevik hellhole the likes you couldn't even possible imagine. It is well documented that Hitler attempted to contact Churchill numerous times, both BEFORE and DURING the war, to negotiate for peace. He stated that the Brits and the French were both a noble people and to go to war with them would be a disaster. But what did Churchill say?? \"LOL no, fuck off faggot, I like being a slave to International Rootless Cosmopolitan Desert Tribesmen!!! Why don't you? Are you an anti-Semite or something? :^)\"\nAnd yet more denials, lies and deflections.\nThe Poles weren't Bolsheviks; in fact they fought them (and won) from 1919-1921. \nThe Czechs weren't Bolsheviks.\nThe Danes and Norwegians weren't.\nNor the Dutch, the Belgians, the Greeks, the Serbs, the French or even - after 1943 - the Italians.\n\nThe war against Poland was a war of aggression. In a direct violation of the Polish-German non-aggression pact (Which Hitler unilaterally rescinded), and the Munich agreement. \nContrary to Nazi propaganda, the invasion of Poland was planned way before the Gleiwitz incident - as reported by Clare Hollingworth, with tanks and camps being positioned days before the war.\nChurchil - for all his flaws - can't be blamed for not taking up Hitler at his word, considering agreements with the Nazis were already proven not to be worth the paper they were written on.",
				"added": 1565277270
			}
		]
	},
	"comment_vote": {
		"40_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"2_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx": 1,
		"19_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW": 1,
		"880_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1
	}
}