{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1528175266_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1528175266_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "to make this very clear, i have had autism my whole life, so i honestly know the feelings of having things changed on a very constant basis (which i hate)\n\non the other hand, the sudden sporadic changes in diagnoses in my honest opinion, is actually quite common, which i view as quite depressing. if you ever need someone to talk to, im here. \n\nedit: as for all of the points that you made, i also have this to say on that front. \n\nin all honesty it doesn't make sense how those would grant you the title of having autism, i, personally have disrespect for authority which ended up in ODD, obsessive interests would make sense. does that come with hyper focusing? because i show those traits as well. lack of empathy is honestly a big one for me, i have 0 friends and social skills so i relate hard on that. as for hospitalization... i honestly really, really doubt that. it does happen, yes. but if it ends up being constant it may sound like psychosis or schizophrenia, depending on how severe we are talking. but it has no part in autism to any aspect, so that point doesn't even make sense to me at all.",
				"added": 1528176718
			},
			{
				"comment_id": 2,
				"body": "> [blazar](#comment_37_1P1baCe1LLjror4CZjChWFy7D7cVWyPL83): In total: these psychiatrists are incompetent at all. They can't even determine correct diagnosis. [...]\n\nagreed. 100%",
				"added": 1528180054
			}
		]
	},
	"comment_vote": {
		"1_1CTJQefD2QwMr6aHXXjCNywWbMpuY69hiH": 1,
		"37_1P1baCe1LLjror4CZjChWFy7D7cVWyPL83": 1,
		"2_1CTJQefD2QwMr6aHXXjCNywWbMpuY69hiH": 1,
		"2_11WQHH4nhf1MGx2f75r95FKjbbQo8bA2u": 1,
		"73_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1_1FLbJrE3opN7ptsTYvRGJduf9uR9Fc71mL": 1,
		"71_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"72_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}