{
	"title": "Some Thoughts on Games",
	"description": "Sometimes I have thoughts, and sometimes those thoughts are about video games.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 7,
	"demo": false,
	"modified": 1472596151,
	"post": [
		{
			"post_id": 4,
			"title": "Nitpickery: Dark Souls II",
			"date_published": 1472573427.135,
			"body": "![DS2 Title](data\\img\\DS2\\tumblr_inline_o1qhx08SFb1trtncw_1280.jpg)\n\nIn this series, I want to take a look at the small, the mundane, the easily overlooked or excused. Those parts of gaming that most won’t ever think about sometimes make all the difference and drive those of us on the edge of liking or disliking a game right over the edge into the extremes of endless devotion or unrelenting hate. And it’s all thanks to a cut-scene you can’t skip or a sound effect that seems out of place. This is the madness that is nitpicking.\n---\n<i>Dark Souls II</i> really has become the punching bag for fans of the <i>Souls</i> series of games. Much of the criticism is valid: the mechanics are functional, but tweaks to the physics make everything slower and more laborious, the storytelling is done seemingly without any coherence taken into account as everything is explained away by characters losing their memories, the bosses are often lifted in concept from <i>Dark Souls</i>, and in one case, stolen outright. But the game is an easy target. It was made with an ambitious release schedule and headed by the secondary From Software team sans Hidetaka Miyazaki, the director and figurehead of the previous games. Without the time to really think up fundamental improvements, From Software settled on simply tweaking the existing framework, and because the core elements of <i>Dark Souls</i> were so good, it’s really no surprise that the sequel suffered. It’s a good game, and had it been the only game in the series, well, there would be no comparison and so complaints would probably be overlooked a lot more.\n\nSo instead of harping on about all of the things wrong with this game, I want to focus on one very small thing that’s wrong with it: the descriptions of unique souls. One of the ways that the <i>Souls</i> series has made the economics of the games interesting is by tying pretty much any and all upgrades, be it character or equipment, to the amount of souls the player receives when they defeat enemies. When a player defeats a boss, a unique soul is awarded to the player that can be redeemed for a larger amount of souls or, instead, used to create something unique that the player can use. This began with <i>Demon’s Souls</i>. Defeating a demon would award you the soul of that demon and the description of that soul would tell the player what they could do with it.\n\n![Inventory1](data\\img\\DS2\\tumblr_inline_o1qhc8QMTw1trtncw_1280.png)\n\nThe description is extremely straightforward, if a little dull. What’s nice about it is that there is absolutely no ambiguity about its uses. The player is made aware that these souls are special and perhaps worth holding onto for something they may want a bit later. If you are a magic user, maybe trade in that demon soul for a powerful spell or miracle. If you rely on melee combat, maybe look at what unique weapons you can get to beef up your arsenal. What’s especially good about the simplicity of the presentation is that the player has to learn for themselves the specifics for each soul. Knowing that there is a practical reward, the initiative is handed over to the player to explore all of the levels thoroughly, talk with the various NPCs, do more in the game than the bare minimum, all the while doing so in a non-intrusive way so that the player still ultimately has choice.\n\nUnique souls in <i>Dark Souls</i> use almost exactly the same types of descriptions as were used in <i>Demon’s Souls</i>.\n\n![Inventory2](data\\img\\DS2\\tumblr_inline_o1qhdcy79B1trtncw_1280.jpg)\n\nWhile unique souls can no longer be traded in exchange for magic or miracles, the ability to craft weapons with them remains and is explained to the player very clearly. The descriptions don’t give away the surprise of what the weapon will be, nor do they explicitly tell the player what other materials will be necessary. Instead, they plant the knowledge that crafting weapons is possible within the game world, then giving the player the option to follow through, reinforcing that exploring and interacting with the world, despite its perils, will ultimately reward the player if they are willing to put in the effort.\n\nAlthough <i>Dark Souls</i> is extremely similar to <i>Demon’s Souls</i>, great care was taken to make sure that knowledge of <i>Demon’s Souls</i> was in no way required to understand and enjoy <i>Dark Souls</i>. It probably helps a great deal that the two games were financed by different publishers, thus forcing From Software to act as if <i>Dark Souls</i> was being created completely from scratch. With <i>Demon’s Souls</i> being exclusive to the PlayStation 3, and <i>Dark Souls</i> being published on multiple platforms, it was very likely that a player of <i>Dark Souls</i> would have never heard of the previous game. In every critical way, <i>Dark Souls</i> avoided being a sequel. Unfortunately, this need to start over did not exist when it came time to make <i>Dark Souls II</i>.\n\n<i>Dark Souls II</i> is an obtuse game. The player is given goals with no ultimate objective given to them, the NPCs seem to only talk about how baffling the game world of Drangleic is and how they’ve forgotten why they’ve come to it. The game tried to distinguish itself from its predecessor by going all in on the limited details that <i>Dark Souls</i> gave the player to help them piece a narrative together. A side effect of this, is that <i>Dark Souls II</i> is not very careful about what they tell the player and what they don’t, resulting in very key pieces of information being obfuscated. The soul descriptions are, perhaps, the clearest example of this.\n\n![Inventory3](data\\img\\DS2\\tumblr_inline_o1qhe2rOI41trtncw_1280.jpg)\n\nWhere in the previous games, the soul description would tell the player what the soul could do without giving away the exact details, <i>Dark Souls II</i> opts to only tell the player about acquiring souls and give nothing but the most basic clue that they might be used for something else. It assumes that the player has played the first game by describing the souls this way. While that is doubtlessly true for many players, it is no guarantee. Furthering the obscure nature of the hint, only one NPC in the game, Ornifex, can make use of the unique souls. Unfortunately, finding Ornifex turns out to be quite the chore. The player has to use an item to heal a petrified enemy, defeat that enemy, then use the appropriate key to unlock the cell Ornifex is locked away in. To make matters far, far worse, there are enemies that can kill her, rendering all that work a waste. And that’s if the player doesn’t accidentally kill her themselves, since she is a non-human character and is a tall, menacing figure. It doesn’t help that in <i>Dark Souls</i>, creatures similar to her acted as adversaries, so players familiar with the first game might instinctively attack. Finally, when the rescue is complete, the player has to find Ornifex again once she’s returned to her home. Mercifully, once all this is complete and the player talks to her, she will initiate a conversation that reveals that unique souls can be used to create unique weapons. A free weapon upgrade is included to sweeten the deal.\n\nIt’s true that <i>Dark Souls II</i> in no way requires that unique souls be turned into weapons to play through the game, but the benefits to using these unique and often very powerful weapons can make a great deal of difference, especially for new players. Of course, if you’ve never played a <i>Souls</i> game before, your odds of ever figuring out what else unique souls can be used for and then find Ornifex your first time through are not great. It also takes place late enough in the game where there’s a good possibility the player has already upgraded a starting weapon that is more powerful than the unique weapon they could have made with a unique soul. On the most basic level, players are going to do what they understand. For many, the simplest transaction is souls for stats, an increase in soul level. If a player is having trouble with a boss, or a particular stage, the path of least resistance is to acquire enough souls to level up to where eventually the boss or stage becomes easy enough to get through. While the game can be completed in this way, it risks reducing the experience to a grind fest, and in a game as punishing as <i>Dark Souls II</i> can be, grinding goes from being a chore to downright Sisyphean in its futility.\n\nThe biggest miss of <i>Dark Souls II</i> is that it forgets that there are such a thing as new or unfamiliar players. Maybe this is more the fault of Bandai Namco rather than From Software. If so, it’s easy to see how it could happen. Bandai Namco wants to sell games, but a publisher’s distance from the developers and from the players of those games means that the things that captivated players get misinterpreted, and the wrong things get focused on and pushed for during development of a sequel. The consequence, of course, is that interesting and helpful elements like the unique weapons feel more like an afterthought, something to include only because the other games had them. They are a little bonus for players who have spent a good deal of time in the previous games, and who probably don’t even really need them anymore, anyway. This lack of care on such a small and simple detail highlights how easy it is for sequels to get caught up in themselves, how basic elements can be taken for granted and forgotten and how a lack of clear direction and purpose can make a good game bad just by not trying to be great.\n\n"
		},
		{
			"post_id": 3,
			"title": "Immersion Break: Bioshock",
			"date_published": 1472520677,
			"body": "![Bioshock Title Screen](data/img/Bioshock/tumblr_inline_nzh480KrMX1trtncw_1280.png)\nI began playing <i>Bioshock 2</i>, mostly just to give my XBOX 360 something to do. I also wanted to play a first person perspective game and I remembered <i>Bioshock</i> as an enjoyable game that didn’t demand a ridiculous amount of time like so many contemporary games. My hopes weren’t particularly high, but spending more time in Rapture, the underwater city that served as the setting for the first game was a compelling enough reason. Sequels always have to walk a very fine line. If you deviate from the original too much, you risk becoming <i>The Adventure of Link</i>, where no matter how good a game you actually are, you will be deemed an outlier, weird, or perhaps worst of all, not part of the core franchise. On the other hand, if you make a game that is too similar to the original, you often end up forgotten. That’s roughly the position that <i>Bioshock 2</i> finds itself in.\n---\nIt is a remarkably similar game to the original. To me, that’s certainly not a death sentence, though. <i>Bioshock</i> was an interesting game with great art direction and even better sound design. Its characters were memorable and it worked extremely hard to create its much lauded atmosphere. Rapture, after all, was a pretty believable place. The architecture stands out as being obviously inspired by art deco, but twisted to make the underwater nature of the city stand out in what should be a stark contrast of metal world and natural ocean bed. Instead of a jarring disconnect, Rapture seeming eerily complementary to the blue void that surrounds it. It’s compelling. Unfortunately, unlike the more open ended exploration of an even more deteriorated Rapture that I had hoped for, instead we are treated with the same exact gameplay style of the original. People tell you where to go and what to do and you do it. And it was only after spending time in the sequel that I remembered just how much of a game <i>Bioshock</i> is, and how no amount of veneer could cover up that up.\n\nThe most iconic imagery of <i>Bioshock</i> is the Big Daddy. With the overly mechanical look of their dive suits, the numerous, haunting yellow lights on their helmets that turn red when provoked, and terrifying weaponry, they are the reason I wanted to play the game. Of course, I initially thought that you get to play as this unique, awesome figure when I booted up the game (I didn’t end up playing it until 2014), only to find out that instead, they are occasional antagonists that must be killed. Fair enough. It was really a big surprise later on, then, to discover that towards the end of the game, you must collect the various elements of the Big Daddy (the suit, helmet, boots, pheromones) to mimic one so you can continue on in the story. This excited me. The whole game, I’d tiptoed around these beasts, engaging in combat with them only when absolutely necessary. They were slow moving and heavy footed when docile, but had frightening speed and ferocity when aggravated. They hit hard, took a ton of damage and persisted after you until one of you was dead. That’s the power I wanted to feel. I wanted the various regular, strung out and mutated enemies of the game to fear me the way I had feared the Big Daddy.\n\n![Big Daddy](data/img/Bioshock/tumblr_inline_nzh48i8BeF1trtncw_1280.png)\n(You come to really dread his ability to drill you in the face.)\n\nUnfortunately, that moment never came. Once I’d acquire all of the pieces of the suit, I expected a satisfying transformation, but that satisfaction never came. I don’t know exactly what I expected when going from regular man to relentless death machine, but I definitely imagined more than what I got. This is a first person perspective game where walking through falling water blurs my vision and smoke filled rooms renders me blind. But putting on the massive helmet offers surprisingly little in visual difference. The view is now rounded the way a port hole would be with the edges blurred a little bit to simulate the curvature of glass, which is a nice touch. You walk a little more slowly and there’s a clunky sound added. Also nice. Unfortunately, these additions that help to enhance immersion are betrayed by the most baffling choice: my hands, which should be swimming in huge gloves, are bare, the tattoos on my wrists clearly visible at all times because of the way they are held out in front of the player at all times.\n\n![Before](data\\img\\Bioshock\\tumblr_inline_nzh493LyBu1trtncw_1280.png)\n(Before)\n\n![After](data\\img\\Bioshock\\tumblr_inline_nzh49fASgS1trtncw_1280.png)\n(After)\n\nIt’s a bizarre and jarring thing to see bare hands holding a shotgun the way I’d been doing the entire game and serves as a beacon that the donning of the Big Daddy suit was really only half considered. For instance, the fishbowl that I must now view the game through does not fog up from my breath. Similarly, there’s no indication that I have bright lights attached to my head. I should have a permanent glow in front of me at all times, but my shotgun is clearly shrouded in darkness when not near an external light source. Upon playing through the game again, what I’ve come to realize is that the most iconic pieces of the Big Daddy suit are not present in the suit that the player actually acquires. The suit itself has no gloves, the helmet has not lights. In fairness to this game’s age, I should note that <i>Bioshock</i> was released in 2007. The missing components may have been due to technical limitations. Adding lights would have changed the way lighting for the whole game was done after putting on the helmet. Adding gloves would have required completely new animations to be added in conjunction with the firearms and plasmids that the player has become accustomed to using. However, if you compare the use of first person in <i>Bioshock</i> to 2002’s <i>Metroid Prime</i>, which featured a helmeted protagonist whose peripheral vision is constricted, who had various informational items on screen at all times, and whose reflection would occasionally show up on the glass visor of the helmet when in cold environments, you realize that <i>Bioshock</i> falls very short in its execution of such a great idea. Prime even featured four different visor options that would change the way the environment looked in significant ways, such as thermal reading of enemies and x-ray. <i>Bioshock</i>, for all its effort put into the atmosphere, betrayed me in the most flagrant way possible. They had promised me the Big Daddy and I was not him.\n\n![Samus](data\\img\\Bioshock\\tumblr_inline_o0hqhzTfQ51trtncw_500.gif)\n(Not a Big Daddy, but much more immersive.)\n\nAfter this moment, <i>Bioshock</i> failed to get me to believe in it anymore. It had done such a great job of suspending my disbelief for so long, but failing to make the player feel such a huge change, the rest of the game started to reveal itself to me more and more clearly. The way hacking is implemented, for example, has no in game justification. Various things in the game’s environment (security cameras, mounted turrets, vending machines that dispense health and ammunition) can be “hacked” by the player. What this means is you go up to something, press a button to switch you into a mini game, and if completed successfully, it does something that is beneficial to you. In theory, I love this idea. It allows players to interact with the game world in a meaningful way so it all feels like more than scenery. Unfortunately, it comes across as extremely clumsy. The hacking game is a pipe fitting puzzle where you have to put various pipe pieces together so that the flow of a green goo can go uninterrupted from one side of the puzzle to the other. It’s not a bad puzzle, but it doesn’t make any sense with regard to the objects you are using it on. All of the things you hack are mechanical or electronic in some way. So why, then, is the puzzle based around glass piping and a plasmid liquid? Instead, a puzzle involving rewiring a circuit board or something along those lines would have fit much more closely to the reality of the game world. It seems to be an issue of the glass tubes were a better aesthetic fit, matching the glass tube hallways of Rapture and thus were chosen despite the utter lack of practical application.\n\nOn an even more basic level, the things that can be hacked only half commit to any kind of authenticity to the game world. With a city full of depraved maniacs all killing each other over precious resources, why do the security cameras and turrets only focus on the player character? It’s presumed that Andrew Ryan is somewhat in control, but because each camera and turret operate independently, there is a disjointed feeling where everything seems to be placed for the player to have something to do. This issue is never explained or explored, but mechanically it works from a gameplay perspective, so it exists. Hacking things is fun the first ten or so times you do it and stacking the deck in your favor feels good. For Irrational Games, it seemed this was justification enough. The machines that dispense health for cash (another element that would make absolutely no sense in the city itself but has to exist because the player has a health bar) will hurt enemies if you hack it. This is a fantastic gameplay element as enemies can also regain health by using the unhacked health stations. But the health station is the only element that behaves this way. Enemies can’t hack turrets to specifically protect them, they can’t use or hack ammunition stations since they have an unlimited supply of ammo. So why, then, is the health station set up the way it is? It seems to exist this way only to promote hacking. The side effect of this, of course, is that the enjoyment of the playing the mini game wears extremely thin when every health station, every ammunition vending machine, every camera and every turret needs to be hacked for maximum effect. On the easiest mode of the game, resources like health items and money are abundant, making hacking extremely trivial. On the harder difficulties, hacking becomes much more of a necessity, but is also even more annoying as  the punishments for failing to hack things (hurting the player or tripping an alarm for helicopter drones) are much more impactful.\n\nThe truth is, hacking is not really necessary. It can make taking on the hoards of enemies a bit easier, but most of the hacks provide only small benefits. In many cases, a more effective strategy is simply to destroy cameras and turrets to take them out of the equation entirely. <i>Bioshock</i> is the first game in this particular series, and normally issues like this could be overlooked in the spirit of adding new ideas and gameplay elements. In reality, <i>Bioshock</i> was not particularly innovative as its core concepts were established in both <i>System Shock</i> and <i>System Shock 2</i>. That makes it all the more frustrating that <i>Bioshock 2</i> does absolutely nothing to remedy the problems of its predecessors. The game environment, health stations and all, work in exactly the same way. The hacking mini game this time around boils down to timing button presses. Admittedly, it is much faster and more fun to play than the often frustrating pipe game, but it is even more arbitrary and made no attempt whatsoever to relate the gameplay to the object being acted upon. It’s truly unfortunately that the game does very, very little to incentivize one of its core features.\n\nWhile my immersion was completely broken the moment I failed to inhabit the Big Daddy character, <i>Bioshock</i> goes into a complete nosedive in believability as you get nearer to the end. You kill the game’s supposed main antagonist, Andrew Ryan, who pontificates on what it means to be a human being (“man” is the term used by the character) or a slave. He commands you to kill him and he puts up no fight, so the player is basically treated to a murder simulator for a few minutes, which is basically no different from the rest of the game. You then go on to take on the true enemy of the game, Frank Fontaine. In a relatively weak twist, Fontaine had been commanding you throughout the whole game by masquerading as a man named Atlas. So you discover his plot and invade his personal space by riding a very long elevator up to where he is being infused with ADAM, the stuff that has given you all of your special abilities, in an effort to become even more superhuman. It’s boss fight time.\n\n<i>Bioshock</i> ha several boss fights. They were fairly well done, as they are mostly more difficult enemies that have some plot relevance. There’s really nothing wrong with the way they play out in general, and their personalities usually add a fair bit to the overall feel of the game with their backstories and motivations usually revealed over time leading up to the encounters with them. They are distinguished more by their dialogue and where you fight them more than how you fight them. Still, they were interesting set pieces for what they were. Fontaine is a unique case. Firstly, you have to go up to his boss room, which takes quite a bit of time and separates you from the rest of Rapture. Secondly, the combat quirks you’ve gotten used to throughout the entire rest of the game are thrown out the window. Normally, when you die, you respawn in a Vita-Chamber. This whole concept is pretty immersion breaking on its own as you get to infinitely respawn when you die while the enemies around you maintain the level of damage they’ve taken and the rest of the world around you progresses through time. It makes no sense but it works as a concession for those of us who are not good at shooters. Unfortunately, for Fontaine’s room, there is no Vita-Chamber. If you die fighting him, which is pretty easy to do if you’re like me, you have to reload your save and try the whole thing all over again. This means riding up the long elevator and fighting both Fontaine and the hordes of regular enemies that fill the room. The room is large, but it lacks vending machines for more ammunition, a resource that was liberally dispersed throughout the rest of Rapture. Getting more health is also off the table and you are relentlessly pursued by various enemies. It can be a nightmare of a fight for those who didn’t take the time to level their character up to maximum.\n\nNormally, this kind of thing wouldn’t bother me. There are numerous games where the boss fights are difficult. The issue with the way <i>Bioshock</i> does this fight in particular is that it follows none of the rules it established during the rest of the game. One could argue that the player should have mastered all of the game’s combat mechanics in order to be good enough to beat the game. That would be true, except <i>Bioshock</i> makes no effort to make sure players become good at combat. I am awful at first person shooting games. Most of them I play  until I can’t progress, then just accept my skill level and retire. For <i>Bioshock</i>, it doesn’t really matter how bad you are. You can respawn as many times as needed in order to kill enemies. You could conceivably never even bother with first aid kits or anything because running up, hitting an enemy with a wrench, then dying is a viable strategy since the punishment for death is so small. At most, you’d have to hack a health station in order to keep the enemy from replenishing their life, but that’s it. That’s as difficult as the game gets. Fontaine, in contrast, was extremely difficult. It wasn’t even as if I hadn’t leveled my character up, either. I’d acquired numerous abilities, upgraded my weapons sufficiently, but was so inferior tactically  to the game that I nearly didn’t finish it. There didn’t really seem to be much point. I played through all of the story, so the only satisfaction would have come from doing a very video game thing: beating the final boss. Eventually I succeeded, but had I not, my view of the game would have gone unchanged. This weird, unexpected departure from what I had been used to only served to remind me that I was playing a game that had arbitrary rules that were manufactured to suit specific circumstances, whether it made contextual or logical sense or not. There didn’t seem to be much evidence of an overall game mechanic philosophy that was considered or followed, which set it in opposition to its visual and sound designs, which were painstaking in their effort to make sure the world looked and sounded as convincing as possible.\n\nI like <i>Bioshock</i>. It is a good game that is fun to play and had some occasional great moments. I like <i>Bioshock</i> as well. While it suffers the exact same immersion problems as its predecessor aside from the missing gloves, it is still an enjoyable experience. The reason for pointing out these issues with immersion is not to say <i>Bioshock</i> is a bad game, but merely to point out that it is a game, and a game that does very little to hide that fact from you, despite trying, on its surface, to surpass the traps and pitfalls that sometimes befall the medium. There is a clear disconnect in the way the story tellers and the designers of this game conceived of the project. So while <i>Bioshock</i> tried to pair one of the most popular game genres with a more driven narrative akin to film, they did so with very limited success. They were more willing to look at how to make the game fun and visually interesting, than making sure the game had everything it needed to be believable, and nothing more."
		},
		{
			"post_id": 2,
			"title": "The Idea",
			"date_published": 1472518147.217,
			"body": "When I should be doing other things I instead tend to be thinking about video games. Since those thoughts don’t tend to stop all that often I figured I’d start writing those thoughts down and sharing them. This is where those thoughts will go. Good luck."
		}
	]
}