{
	"title": "冥想时空",
	"description": "冥想是对存在的鸟瞰 ",
	"links": "- [College 34](http://127.0.0.1:43110/1Mr11twqYfgYE8DGB6USc3QqvGwiqjmzqt/)",
	"next_post_id": 9,
	"demo": false,
	"modified": 1466522514,
	"post": [
		{
			"post_id": 8,
			"title": "冥想的三个流派",
			"date_published": 1466522285.694,
			"body": "\n印度式\n\n性质：静态或动态，起源于印度教。\n\n操行时间：任何时间。\n\n方法：适合在安静场所、单独或集体进行。\n\n第一步：全身放松，平躺于地面。\n\n第二步：调息，即呼吸控制练习。\n\n第三步：身体静止，精神放松，摆脱对身体功能的注意。\n\n第四步：将外在意识长时间固定在一个意念对象上，不间断地默念自己沉思的对象，超越任何有关自我的回忆，达到一个更高的境界。\n\n效果：提高自身体质，改善心理物理平衡。\n\n   \n\n\n日本式\n\n性质：静态，即打坐参禅，起源于日本传统佛教。\n\n操行时间：早晚各一次，或者一日多次。\n\n方法：在完全安静的环境中，单独或集体打坐。\n\n第一步：弯腰，面壁，盘腿坐于坐地垫上。\n\n第二步：把注意力集中在距地面一米处。\n\n第三步：呼吸均匀，停止一切思考和欲念。\n\n第四步：保持心无杂念。\n\n第五步：松开盘腿，缓缓站立，双手合十，弯腰再盘腿而坐。\n\n效果：远离日常的烦恼，保持头脑清醒，使注意力集中。\n\n   \n\n\n中国传统式\n\n性质：静态，起源于中国西藏的绕式打坐修行术。\n\n操行时间：一日一次或多次。\n\n方法：盘腿坐于静室，默念经文，可用音乐做背景，单独或集体静坐参禅。\n\n第一步：盘腿坐于莲花坐垫，眼睛微闭。\n\n第二步：按传统方式，先三叩首。\n\n第三步：将意识固定在一个对象上，如呼吸、佛、直觉或同情心上。\n\n第四步：调息，心中默念自己沉思的对象，超越任何自我，达到全身心的放松。\n\n第五步：暂时把自己带回到现实中，然后再次入定进入沉思。\n\n效果：超越自我，解脱烦恼，调节心境。"
		},
		{
			"post_id": 7,
			"title": "冥想的主要方法",
			"date_published": 1466522053.233,
			"body": "\n主要方法\n\n想向术：明确自己的“方向性”而冥想。如希望\n\n摆脱罹患已久的气喘病，希望不再咳嗽等等，全力以赴地投入冥想。\n想欲术：这是因为有某种欲望，而希望将它改正的“私欲整理”。如冥想治好气喘后，读书会聚精会神；对工作会认真负责等。\n\n想整术：为了达到上述目的，要努力整理好自己每天的生活。如拟定作息时间表，安排好饮食、呼吸、运动、休息等。\n\n想和术：对于自己的计划是否都保持调和了呢？要加以核对，使之相互间保持均衡调和。\n\n想心术：无论你操练什么功法，心中都要保持乐观，而不是注意动作姿势的好坏，要保持快乐地投入。\n\n想定术：将自己所希望的事和所要求操练的事都彻底而具体地表现出来。如果你想减肥，就要毫不犹豫地想：“我的体重现在是**公斤，一定要减至‘多少’公斤!”\n\n想念术：这是你的实际行动了，你要按照自己的目标，调和五事，再进行冥想。如冥想自己杀死体内病毒的过程，冥想自己身体逐渐强壮起来等等，使自己的潜意识发挥强大的活动能量。"
		},
		{
			"post_id": 6,
			"title": "从外到内",
			"date_published": 1466521773.483,
			"body": "Breathing in, I know I am breathing in. (In) Breathing out, I know I am breathing out. (Out)\n\n吸气，我知道我正在吸入空气（吸气）。呼气，我知道我正在呼出空气（呼气）。\n\nBreathing in, my breath grows deep. (Deep) Breathing out, my breath goes slowly. (Slow)\n\n吸气，我的呼吸逐渐深入（深吸）。呼气，我的呼吸渐渐放缓（放缓）。\n\nAware of my body, I breathe in. (Aware of body) Relaxing my body, I breathe out. (Relaxing body)\n\n感知我的身体，我吸入空气（感知身体）。放松我的身体，我呼出空气（放松身体）。\n\nCalming my body, I breathe in. (Calming body) Caring for my body, I breathe out. (Caring for body)\n\n镇静我的身体，我吸入空气（镇静身体）。关照我的身体，我呼出气体（关照身体）。\n\nSmiling to my body, I breathe in. (Smiling to my body) Easing my body, I breathe out. (Easing body)\n\n向我的身体微笑，我吸入空气（向我的身体微笑）。松弛我的身体，我呼出空气（松弛身体）。\n\nSmiling to my body, I breathe in. (Smiling to body) Releasing the tensions in my body, I breathe out. (Releasing tensions)\n\n向我的身体微笑，我吸入空气（向我的身体微笑）。释放我身体的紧张，我呼出空气（释放紧张）。\n\nFeeling joy (to be alive), I breathe in. (Feeling joy) Feeling happy, I breathe out. (Feeling happy)\n\n感受愉悦（为存在），我吸入空气（感受愉悦）。感受快乐，我呼出空气（感受快乐）。\n\nDwelling in the present moment, I breathe in. (Being present) Enjoying the present moment, I breathe out. (Enjoying)\n\n活在当下，我吸入空气（活在当下）。享受当下，我呼出空气（享受）。\n\nAware of my stable posture, I breathe in. (Stable posture) Enjoying the stability, I breathe out. (Enjoying)\n"
		},
		{
			"post_id": 5,
			"title": "咒语",
			"date_published": 1466521711.771,
			"body": "咒语的文义解释是“心灵的守护者”。因此轻念咒语可以以精神之力保护你。还有说法说当你念咒的时候，咒语的能量会提升你的呼吸和能量。同样的，选择来自于你的精神文化传统中对你有意义的东西：如玫瑰经。藏传佛教通过轻念真言（如六字真言，“嗡、嘛、呢、叭、咪、吽”）来获得内心的平和、康复、转化和疗愈。Rinpoche写道：“轻念咒语，注意力高度集中，让你的呼吸、咒语，和你的注意力逐渐合而为一。”"
		},
		{
			"post_id": 4,
			"title": "冥想：精于内心平和的艺术",
			"date_published": 1466521664.931,
			"body": "Blog post body"
		},
		{
			"post_id": 3,
			"title": "做冥想时，一个人必须暂时脱离现实世界。",
			"date_published": 1466521642.835,
			"body": "Blog post body"
		},
		{
			"post_id": 2,
			"title": "人成了造物主",
			"date_published": 1466521377.402,
			"body": "在冥想时，人成了造物主，宇宙和地球成为远景，在存在之眼中变得小了很多；自身的生命也成为远景，变得蜉蝣般的渺小，无足轻重。"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}