{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1629402955_19BXHBD1GfYpSpvdHsuHJsJ97mYpxWjUE": 1,
		"1633270153_14NiXkEXrFAHokAohyiCv5PCAXLcEsvEUp": 1,
		"1634226877_1NAbpFqUHZXi4CmoA2v9pZrRrXNwvAJz8b": 1,
		"1636765653_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1637126540_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha": 1,
		"1636696143_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"1637214620_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1
	},
	"next_comment_id": 23,
	"comment": {
		"1629402955_19BXHBD1GfYpSpvdHsuHJsJ97mYpxWjUE": [
			{
				"comment_id": 1,
				"body": "`If you want a picture of the future, imagine a boot stamping on a human face—forever.` \n\nas in 1984 the power to take back control is in the paroles but they are to stupid to revolt.",
				"added": 1629802532
			},
			{
				"comment_id": 2,
				"body": "> [xcape2net](#comment_921_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I disagree with mandatory vaccination.  That's not the issue.  The issue is that people are willing to accept even a \"low\" 5% risk of a long, expensive, extremely uncomfortable ICU stay and perhaps a 2% chance of death in exchange for what?  A political statement?  Is the \"freedom\" you are talking about the freedom to choose to die for no reason?  Donald Trump said you have nothing to fear from Covid-19, so even knowing the statistics, you are willing to follow him?  Trump received the blood products treatment--which is NOT without potentially serious side effects.  So, obviously, even he didn't believe what he was telling the public.  [...]\n\nCOVID has a total of 4,457,729 but deaths from air pollution sit at 8.9 million per year (twice that of COVID) and this was true before COVID for many number of years.\n\nyou don't see lock downs to reduce the pollution do you?  why do COVID deaths matter but pollution doesn't?\n\nHow about all the preventable deaths from smoking (14% death rate)?",
				"added": 1629806881
			}
		],
		"1628077482_19BXHBD1GfYpSpvdHsuHJsJ97mYpxWjUE": [
			{
				"comment_id": 3,
				"body": "> [justasking](#comment_2_19BXHBD1GfYpSpvdHsuHJsJ97mYpxWjUE): true. who is unvaxxed here? and who is dying on this hill?\n\nyou can still get covid19 when vaxed and can still die from it. infect the vaxs are doing very little to slow the spread of the virus.\n\n> The Delta variant will still infect people who have been vaccinated. And that does mean that anyone who’s still unvaccinated at some point will meet the virus … and we don’t have anything that will [completely] stop that transmission.\n\nhttps://www.theguardian.com/world/2021/aug/10/delta-variant-renders-herd-immunity-from-covid-mythical",
				"added": 1629807054
			}
		],
		"1632001629_178KvFeW5b16fZsNtWY3pDjLHj8aiLdTMK": [
			{
				"comment_id": 4,
				"body": "care to state your reasons?",
				"added": 1632144799
			}
		],
		"1633270153_14NiXkEXrFAHokAohyiCv5PCAXLcEsvEUp": [
			{
				"comment_id": 5,
				"body": "> [xcape2net](#comment_986_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Unfortunately, Zerosites is not actively managed, so whatever is posted there stays up forever.  The number of peers have not been updated in years, so sites may be listed as having no peers when they actually have many peers.\n\nwas last updated jan of this year \n\nhttps://github.com/HelloZeroNet/ZeroNet/commits/py3",
				"added": 1633426768
			}
		],
		"1632925044_19TrKZA9ifR8bvPbL64AbNqttCDkWfErWF": [
			{
				"comment_id": 6,
				"body": "Can you please post the git related links, I am not downloading random files from mega",
				"added": 1633426871
			}
		],
		"1635050930_143N4eNqa9axJbroSdZfz8RLtPkJeS2HcE": [
			{
				"comment_id": 7,
				"body": "> [zarftmarf](#comment_1_1LFcUMNS2edhEW33Agtzh17kphr7kBSWWM): Its illegal\n\nyeah because things being illegal definitely stops people from doing them.",
				"added": 1635161187
			}
		],
		"1631131497_1LpWbu62NgT4wzh1k1XVDCW9qwENC7AQi1": [
			{
				"comment_id": 8,
				"body": "This is because the law requires you to save who accessed your service, not that this information would be much use to them as all your email data is encrypted by your login and no one but you can see it.\n\nAlso this is no long the case (saving of IPs) as they just appealed it in court and won\n\nhttps://www.swissinfo.ch/eng/business/proton-wins-appeal-in-swiss-court-over-surveillance-laws/47052196",
				"added": 1635162249
			}
		],
		"1635188644_1H6E7oCSjVBWLzepwc6BEtMxn4LcdtYSJ9": [
			{
				"comment_id": 9,
				"body": "well we were cave men, then we had machines now AI? \n\nSeeing as the human race spent thousands of years living in caves and shitting in holes then suddenly all this?",
				"added": 1635324256
			}
		],
		"1636134204_12rAw78P4EdKZWbBv2t3VYRFMiJEaf17SS": [
			{
				"comment_id": 10,
				"body": "> [styromaniac@kxoid.bit](#comment_196_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Protonmail cannot be trusted. They'll rat you out. [...]\n\nthe `only` information they can give is the IP and possible the two step information (SMS verification) they cannot access the email contents which lets face is where 99.9% of the incriminating information lies.\n\nIf this where gmail/outlook not only would they have the IP but the contents of all emails, buying habits, movments information (android tracking), YouTube watch history, browser history,\n\nbasically every place you have ever visited, every website, basically your whole life. \n\nlets not make the mistake of a mixing company in with the others who able to give out an IP address vs other providers that will lay out your whole life from any warrant no matter how vague.\n\nprotonmail is a cut above the rest in terms of privacy.",
				"added": 1636385645
			}
		],
		"1636488901_17um7PR1kBcpsubiDZi7Be7uP6HYDFjyyV": [
			{
				"comment_id": 11,
				"body": "doesn't post new threads",
				"added": 1636539001
			}
		],
		"1636622898_1L3gLHdxExJ1LT3z6PKLuzsynvf81oF5z4": [
			{
				"comment_id": 12,
				"body": "Uncaught (in promise) TypeError: Cannot set properties of undefined (setting 'answered')\n\nquestions[0].answered = answer.length ? answer[0].answer_id : -1; <- this line",
				"added": 1636636358
			}
		],
		"1636969808_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 13,
				"body": "1. article has no mention of bitcoin \n2. thats not how quantum computers work",
				"added": 1636983657
			}
		],
		"1637126540_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha": [
			{
				"comment_id": 14,
				"body": "yeah this annoys me a lot, if you look at Disney right now almost all new movies for on coloured skins. \n\nnot that i have anything against anyone of that skin colour but i'm white, everyone i know is white, almost everyone where is live is white.",
				"added": 1637142165
			},
			{
				"comment_id": 18,
				"body": "> [killerwhale905](#comment_6_1PB1YKkXjDp7fy4WC1bB9iw6V9Hp2thxWN): Also, while we are on the subject: saying/believing that a specific race of people are worse than another race of people, is  illogical. There are bad apples in every race and country on the planet. basing a complete race off of one persons or groups actions is ridiculous.\n\nIf you look at the chart [0] total number of murders was 7,964, white offenders 3,650, black 4,078\n\nblacks make up 14% of the population [1]. \n\nYou have 14% of the population causing 51.21% of murders.\n\nYou might think that i am picking my numbers so lets go for the total crime\n\ntotal: 6,816,975\nwhites: 4,729,290 (69.38%)\nblacks: 1,815,144 (26.63%)\n\nEven in the total crime numbers you still have 14% of the population causing over a quarter of all crimes.\n\n\n[0] https://ucr.fbi.gov/crime-in-the-u.s/2019/crime-in-the-u.s.-2019/topic-pages/tables/table-43\n[1] https://blackdemographics.com",
				"added": 1637230359
			}
		],
		"1636696143_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 15,
				"body": "> [styromaniac@kxoid.bit](#comment_245_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): I just found out that there's a script in the folder that you need to execute as root: install-dep-packages.sh [...]\n\nyou defiantly should be using a virtual python environment to install dependencies",
				"added": 1637152940
			},
			{
				"comment_id": 16,
				"body": "just installed this today and it does feel faster i think",
				"added": 1637160564
			}
		],
		"1637214620_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 17,
				"body": "what if the 3 owners all go like nofish? same situation.",
				"added": 1637229737
			}
		],
		"1637100321_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH": [
			{
				"comment_id": 19,
				"body": "Nice to see tax payers money being used to solve meaningful crime.",
				"added": 1637233103
			}
		],
		"1637504933_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 20,
				"body": "there is already this one https://github.com/zeronet-enhanced/ZeroNet",
				"added": 1637668658
			},
			{
				"comment_id": 21,
				"body": "> [6283822](#comment_143_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe): There are some issues with that fork, I will contact geekless to merge his commits into new fork as well, if he agree to do so.\n\nbeen running it for a week now and haven't had any issues",
				"added": 1637752879
			}
		],
		"1631527719_12ftwUykzZMAF7aq5Sd3qGh8HUNmnPh8Fn": [
			{
				"comment_id": 22,
				"body": "> [epistemic](#comment_37_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L): The Cold and COVID are not the same class of viruses, and one did not lead to the other.Corona just means it is spreadable between species; not all Corona viruses are closely related.Why do people just make things up? Stop pathologically lying and treating it like you're an expert.You don't even get the basics right.\n\nactually they were named Coronavirus after their distinctive morphological appearance. It has nothing to with transport methods.\n\nThe common cold is caused by a number of virus\n\nrhinovirus (30–80%),  human coronaviruses (≈ 15%), influenza viruses (10–15%), adenoviruses (5%)",
				"added": 1637837628
			}
		]
	},
	"comment_vote": {
		"1_12ftwUykzZMAF7aq5Sd3qGh8HUNmnPh8Fn": 1,
		"29_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L": 1,
		"109_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"110_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"2_1Hiqq5zy6pScwUbR3wzLL2MrprBEDBfK9z": 1,
		"103_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": 1,
		"16_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha": 1,
		"88_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH": 1,
		"39_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L": 1,
		"37_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L": 1,
		"4_1FUkPfD34wCeLic9wKe2JPrPccqPh8gTdM": 1,
		"160_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1
	}
}