{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 16,
	"comment": {
		"2_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 1,
				"body": "> [ultraviolet](#comment_90_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Всё так, всё как Ленин описывал в своей статье про империализм ещё почти сто лет назад\n> \n> Только не государственных а общественных. Вспомните слова известной премьер-министра Великобритании - нет никаких государственных денег, есть деньги налогоплатильщиков....\nЭто брехня. Госбюджет на финансирование армии есть в любой стране и это государственные деньги. Вам пытаются внушить мысль, что Армия должна следовать не конституционному порядку, а интересам капитала. Такая позиция превращает армию в вооруженных бандитов на службе капитала. Существует только государственная армия, которая получает именно государственные деньги. \n> \n> В любом случае этот срок конечен и судя по опыту \"первого русского капитализма\" 19-го, начала 20-го века врядли может быть более полувека, притом что как минимум половину этого срока мы уже прошли",
				"added": 1566218658
			},
			{
				"comment_id": 3,
				"body": "> [ultraviolet](#comment_132_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): месье не слышал про каперов  или про ЧВК?Армии далеко не всегда существуют за счёт бюджета\n> \nЧВК и другие воооруженные отряды за пределами конституции - банды.\n\n> конституционный порядок, законы и приказы и есть выражение воли правящего класса т.е. устремлений капитала (в случае капиталистического общества)\nКонституционный порядок - он и есть конституционный порядок признаный на международном уровне. Какой-бы он ни был.\n> \n> Так оно и есть.А вы что думаете армия защищает народ?  Жители Донбаса передают пламенный привет зашивающей их украинской армии:-)\n\n> \n> про каперов  или про ЧВК писал уже выше.\n> В докапиталистические эпохи так совсем всё интересно было в плане финансирования армии",
				"added": 1566242760
			},
			{
				"comment_id": 4,
				"body": "> [ultraviolet](#comment_133_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): месье возможно следует изучить политическую историю.  Существуют и конечно же существовали страны в которых письменной конституции не было и нет\nТогда, это просто территория или временно неподконтрольная или утратившая конституционность. Разве не бывает конституционной монархии?\n> Более того, даже в случае государства с письменной конституцией правящий класс при необходимости отменяет действие отдельных её положений (ограничивающих его власть) путем введения чрезвычайного положения в  той или иной форме.\n> Пример - база тюрьма Гуантанамо - в ней действие конституции США было временно отменено.\n> Или Германия после принятия закона о чрезвычайных полномочиях в 1933\n> Или Аргентина или Чили во времена правления военных. Или современная Украина или Россия.\n> \n> 1) Любой закон не более чем выраженная определённым образом воля правящего класса\n> Законность есть признак силы а не справедливости\n> 2) Исполнение этой воли основано на аппарате насилия называемом \"государство\"  а не на международном признании\n> Какая разница что думают в соседнем государстве если правящий класс способен добиться исполнения своей воли в своей стране?\n> Что бы правители соседнего государства или государств не думали единственный случай когда это имеет значение - когда они способны силой добиться выполнения своих желаний.",
				"added": 1566423583
			},
			{
				"comment_id": 7,
				"body": "> [ultraviolet](#comment_136_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Ваше исходное утверждение было - \"...ЧВК и другие вооруженные отряды за пределами конституции - банды...\"  из него следует что любая военная организация не опирающаяся на нормы конституционного права есть банда.  \nТак и есть.\n\n> Моё возражение состоит в том что существуют государства БЕЗ письменной конституции но с армиями (которые не банды) и вообще говоря существуют не правовые государства.\nНазовите хоть одно?\n> Вы с чего-то решили вспомнить про конституционные монархии, где очевидно конституционное право всё же в некой форме существует.",
				"added": 1566666729
			},
			{
				"comment_id": 8,
				"body": "> [ultraviolet](#comment_133_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): месье возможно следует изучить политическую историю.  Существуют и конечно же существовали страны в которых письменной конституции не было и нет\nНазовите хоть одну?\n\n> Более того, даже в случае государства с письменной конституцией правящий класс при необходимости отменяет действие отдельных её положений (ограничивающих его власть) путем введения чрезвычайного положения в  той или иной форме.\n> Пример - база тюрьма Гуантанамо - в ней действие конституции США было временно отменено.\n> Или Германия после принятия закона о чрезвычайных полномочиях в 1933\n> Или Аргентина или Чили во времена правления военных. Или современная Украина или Россия.\n> \n> 1) Любой закон не более чем выраженная определённым образом воля правящего класса\n> Законность есть признак силы а не справедливости\n> 2) Исполнение этой воли основано на аппарате насилия называемом \"государство\"  а не на международном признании\n> Какая разница что думают в соседнем государстве если правящий класс способен добиться исполнения своей воли в своей стране?\n> Что бы правители соседнего государства или государств не думали единственный случай когда это имеет значение - когда они способны силой добиться выполнения своих желаний.",
				"added": 1566666815
			},
			{
				"comment_id": 10,
				"body": "> [ultraviolet2](#comment_1_14WQ9yBL9dh7Yv15otLGmr41QRGDp1L4Sg): Саудовская Аравия,  Российская Империя до 1905-го года,  Австрийская Империя в начале 19-го века\n\nТипичная большевистская пропаганда.",
				"added": 1566840141
			},
			{
				"comment_id": 11,
				"body": "> [ultraviolet2](#comment_6_14WQ9yBL9dh7Yv15otLGmr41QRGDp1L4Sg): Месье может найти законадательные акты ограничивающие власть императора в России или Австрии до революции 1905-го года и до 1849-го года в Австрии?\n\nДля этого надо иметь доступ к архивам.",
				"added": 1566973987
			},
			{
				"comment_id": 12,
				"body": "> [ultraviolet2](#comment_7_14WQ9yBL9dh7Yv15otLGmr41QRGDp1L4Sg): Учебник истории, страноведческий справочник или энциклопедия не подходят.  Сразу нужны архивы?\n> Что про Саудовское королевство ответишь - тоже к архивам направишь?\n> wikipedia.org - не пойдёт для начала?\nКогда началась вторая мировая война?",
				"added": 1566989489
			},
			{
				"comment_id": 13,
				"body": "> [ultraviolet2](#comment_6_14WQ9yBL9dh7Yv15otLGmr41QRGDp1L4Sg): Месье может найти законадательные акты ограничивающие власть императора в России или Австрии до революции 1905-го года и до 1849-го года в Австрии?\n\nАвстрия меня не интересует.\nУ вас странное мышление. Если мы говорим об ограничении власти императора - так должен быть именно \"акт ограничения\"? Мне кажется, что должны существовать акты переназначения отдельных полномочий парламенту. Если просто \"ограничить власть\" по каким-то вопросам а не переназначить, то эти вопросы тогда вообще никак решаться не будут - а это неправильно. Очень похоже на административную диверсию.",
				"added": 1566991979
			},
			{
				"comment_id": 14,
				"body": "> [ultraviolet2](#comment_8_14WQ9yBL9dh7Yv15otLGmr41QRGDp1L4Sg): Стоп стоп стоп!\n> Вы сказали :  ...Назовите хоть одну... \n> В ответ на моё сообщение:\n> ....месье возможно следует изучить политическую историю. Существуют и конечно же существовали страны в которых письменной конституции не было и нет....\n> Я вам привёл целых три примера.\n> Теперь вы увиливаете!\n> \nНеужели после стольких лет войны и страданий вы все еще слепо копируете все с запада.\nВы, пожалуйста, не забывайте, что марксизм, который мы слепо скопировали у немцев, комунизм построить не мог. Оригинальный комунизм французского разлива состоял всего из нескольких постулатов.\nСамоуправление и республиканская форма правления. Самоуправление нации как-раз на основе конституции и выполняется, и другого способа самоуправления не существует. Вы еще скажите, что в австрии не существовал свод законов. Что бы власть короля, или кто там еще был, была законной должны существовать законы, не так-ли? А подводить меня к нацистской риторике времен аншлюса 38-года меня не следует.\n> Во всех трёх странах в условиях абсолютной монархии не было парламента\n> \n> Есть устоявшаяся терминология - вы сейчас пытаетесь играть словами и некорректно использовать термин \"ограничение власти\"",
				"added": 1567028267
			}
		],
		"6_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 5,
				"body": "> [if0](#comment_202_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): И тогда сразу настанет полная демократия...\n\nВи хотя-бы можете определить диктатура какой идеологии у вас установлена?",
				"added": 1566496183
			},
			{
				"comment_id": 9,
				"body": "> [caryoscelus](#comment_124_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Диктатура — это таки (почти) безграничная власть одного человека / кучки людей; идеология тут параллельна, можнт быть, а может и не быть\n\nНет.\nДиктатура установлена именно в идеологии кырла-мырла. И описана именно как \"диктатура пролетариата\".",
				"added": 1566838558
			}
		],
		"2_14JmpT6tbroLtkGYQMAkUJHQLRmqWk2pxz": [
			{
				"comment_id": 6,
				"body": "CQEGAcKZxsDNBF1fHhABDADYE/qS2hwy/qh2jV57nBac8X7neVhd8l/r96MyTjN4\nPyunRaLZcj+g6C6Ts8gsUlEVwCCEnDWa40AUOBM3sZuGsl11Tpw5GIJYFpo9jeMS\nEEoQwVbBsgzVJSXv2fllYYdkiid208Exam9J49CUGmg99O3/dBjIOjaNe6r2tMfB\nWzz0dgYbqmPDfPB6+hjzUt6m0XEKiB+mzUNWnfsMnST3sgHt8uLYGWFmTxBYwLxr\n6S/IPMMzryilU1FgRT0eDTFhrL9ZZBPLkOnQd5UDZ+ejaNSvGacEa6SUBhJDNkUu\nLjDbjHORPdxXABfsbP1S8HrmmboKh6MEVvKJ5hPuRvEPeKOBAbQSOW6uAbMNos/Z\nugM00uNXFbs87k36IsOfG5wqn1g7eSQ2X0HwnZAUo9cgTMAszVx6ST2irTLC/DYq\nGBossEc7JrDmxKBbS/39m1B6WaZp5EaDpQO/SOfNKxOeYJzypn6ir27gEnMHsGRa\nVauvgfCr6PAEBkNO/thf2R0AEQEAAc0lVHV4LWJvb2sgKEdlbmVyYXRlZCBieSBS\nZXRyb1NoYXJlKSA8PsLA3wQTAQIAEwUCXV8eEAkQvvxHqAyOVmACGQEAAA9vDACC\nDBXuhWl5SSonMrm24WGwgo+x9SLisWxVV6OiBRtyof8GoP12vAdgZeLQYMfZM3z/\naMQ6A8zGhRm3wxHEsm58uo329hc64WNCxeh4Db6Ewh7ThcOkUgoJ8PR2mzOLRwP5\nJ89u3n6KfYH7CkYtc9GsWE1uWkf11uagOq6Yq2H/C4S8lGtUGIgl+i3FrHIUuI7C\nLmEBsBjf+CIqID2q4oQDSCEWpw/Sq+DNtEZ3RTb+Yb1Y3XyswfziSGjV/r7XMMpP\ne0GdmSiC1J7u5rpmQHp0rpVgCfvvcb2tSd6K+S0PQxeO9NqLsXEAPH8FDO4I/iiC\nHgMxfKS5JVOyZbIpnj3i9EgsPCd7ZAhe/eEOnGhmqzRG+53rgofY4J86CviYXOVj\neRKj1MiM+IcokJP2mHatr8FZ6F6ANMb/VV4sg5cb8PqrGbJi6dZKydjpPGr30aSW\nV3rbsQ+Fty+mskAi2sU+WSLS0St0MJK/UNUnVTIZYrBd2nrOAJJ0ntmhRa3GgrEI\nHGRvamhmeWl0ejRvZmpoanIub25pb246NTYzNDUGB25vb2Jvb2sFENm9KBBWgoI5\naTFCyFpI9fkHA7DpQA==",
				"added": 1566515057
			}
		],
		"6_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": [
			{
				"comment_id": 15,
				"body": "> [ultraviolet](#comment_122_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Очевидно что это язык на котором вы написали вопрос на который я отвечаю и на котором я пишу ответ\n> https://ru.wikipedia.org/wiki/%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9_%D1%8F%D0%B7%D1%8B%D0%BA\n\nЭто советский язык. Идеологически заточеный под войну против капитализма - \"буржуинов\".",
				"added": 1567951234
			}
		]
	},
	"comment_vote": {}
}