{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 78,
	"comment": {
		"1598188181_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 1,
				"body": "Jeden komputer z Linuxem (Ubuntu), drugi z Windowsem 10. Na obu pracuje klient ZeroNet, bez zauważalnych problemów. Dostawcy: kilku różnych dostawców w różnych lokalizacjach, gdzie korzystam z tych komputerów - nie Orange.",
				"added": 1598286228
			}
		],
		"1608039600_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 2,
				"body": "Wtrącę coś na temat potencjalnie płaskiej Ziemi. Problem polega na tym, że każde bezpośrednie doświadczenie, przeprowadzone  z udziałem naszych  zmysłów sugeruje, że ziemia jest płaska. Bez bawienia się w rozważania teoretyczne: jeśli Ziemia jest (w przybliżeniu) kulą o podawanych wymiarach, to \"przewyższenie\" na odcinku 10 km powinno wynosić ok. 2 metry. Wynika to z twierdzenia Pitagorasa. Tak więc np. na jeziorze Śniardwy, stojąc na jednym brzegu, nie można by było zobaczyć pasa trzcin na odległym brzegu (15 km). A przez lornetkę je widać. Sprawdziłem. Czy ktoś znajdzie jakieś wyjaśnienie tego \"fenomenu\"? Statki znikające za \"horyzontem\" na morzu zostały dawno wyjaśnione. Pojawiają się oglądane przez lornetkę. Sprawdziłem. Widok Ziemi z samolotu (10 km) czy z balonu (1 km) w żaden sposób nie sugeruje zakrzywienia jej powierzchni. Sprawdziłem. Można zrobić jeszcze kilka podobnych doświadczeń. O tym, że może być inaczej, dowiadujemy się tylko z \"relacji\" innych i nie mamy  żadnej możliwości bezpośredniego potwierdzenia tego własnymi zmysłami. Kulistość Ziemi możemy zobaczyć np. na filmie, na zdjęciach ale nie bezpośrednio. Jeśli jest inaczej, to proszę o jakiś przykład. Ja, jak dotąd, nie znalazłem.",
				"added": 1608114963
			},
			{
				"comment_id": 3,
				"body": "Jak się \"bawimy\", to może \"na całego\"? Jak ktoś może mnie przekonać, że nie widzę przez lornetkę tych trzcin na drugim brzegu? Łapówki mnie brzydzą, a więc tzw. kijem? Kolejnym bardzo istotną kwestią, która tu się sama nasuwa, jest cel takiego działania. Do zastanowienia się. Dlaczego \"ktoś\" miałby ponosić od dawna tak duże nakłady, aby nas przekonać, że Ziemia nie jest płaska? Bo bez tego nie przeszłyby inne podobne \"głupoty\"? Samo nasuwa się, że to może być swoisty \"test na inteligencję\" ale takim ogromnym kosztem? Do jakichś badań statystycznych populacji? - np. % myślących samodzielnie - \"budzą się masowo\", czy jeszcze nie? Trochę za bardzo przypominałoby to eksperymenty prowadzone przez hodowców. Wprowadza się jakąś głupotę i potem sprawdza się, czy zauważą to, czy nie. Jeśli nie, to można im wcisnąć kolejną i kolejną, czego jesteśmy dzisiaj świadkami. Problem potencjalnie płaskiej Ziemi nie jest jedynym tego rodzaju i można bardzo łatwo znaleźć kolejne. Wystarczy z uwagą oglądać otaczający nas świat. Poruszę może panujące przekonanie o szkodliwości CO2. Tu cel jest bardziej oczywisty, ale sprawdzenie tego własnymi zmysłami jest dużo trudniejsze, ale dalej możliwe. Okazuje się, że nawet nieduże podniesienie stężenia CO2 (do 1-2%) sprawia, że tkanki ciała stają się lepiej natlenione, co prowadzi do \"cudownych\" wyzdrowień. A przecież potrzebna jest chora populacja. Dlaczego? - to już kolejny problem. Problem CO2 potwierdzają i wyjaśniają podstawowe nauki biologiczne, ale kto do nich dotrze? A każdym razie tu bezpośrednie cele, nazwijmy to jednopoziomowe, łatwo można określić. Z potencjalną kulistością Ziemi nie jest już tak łatwo.",
				"added": 1608118245
			},
			{
				"comment_id": 4,
				"body": "Pewną ilustracją dyskutowanego zagadnienia może być \"działalność\" Terry Pratchetta w latach 80 i 90 ubiegłego wieku. Można pomyśleć, że \"ktoś\" chciał sprawdzić: \"a jak zareagują, jak im powiemy prawdę?\" - pojawiła się cała seria książek Pratchetta, rozeszła się po całym świecie. Jak zareagowaliśmy? - nijak. Wniosek - \"śpią, można wciskać\". Po co? np. aby zarabiać ogromną kasę. Po co ta ogromna kasa, to już już inny temat. Co wciskać? - wystarczy rozejrzeć się, co nam wciskają, a bez czego moglibyśmy doskonale obejść się, z korzyścią dla nas. \n\nChętnie wysłucham rzeczowych argumentów podważających te obserwacje (poza kijem i marchewką)",
				"added": 1608122883
			},
			{
				"comment_id": 5,
				"body": "No to coś do harcerzy... Życie w lesie - temat robi się jeszcze bardziej aktualny teraz, bo dyskusja zaczęła się przecież od sądnego dnia, a właściwie od potencjalnej możliwości, że coś się wydarzy. Choćby te prorokowane 3 dni ciemności, co to nikt nie wie, co to może znaczyć. Zauważyłem, że niektórzy gromadzą, na wszelki wypadek, jakieś zapasy jedzenia. A może podejść do zagadnienia odwrotnie? Czy można np. nauczyć się nie jeść? Wtedy zapasy przestają być potrzebne. Znikasz w lesie, zapewniasz sobie ciepło i czekasz komfortowo, aż jakaś zawierucha minie. I nikt nie ukradnie ci zapasów. Inny przykład, który się może nasunąć, jeśli któryś z was chodził albo chodzi z plecakiem po górach. Dużą (i chyba jedyną?) uciążliwością chodzenia po Bieszczadach zawsze była konieczność ciągania ze sobą zapasów jedzenia na tydzień, albo dłużej.  Bo kompletna dzicz. Plecak ważył często ponad 20 kg, z jedzeniem często dla dwóch osób, bo kobiety zawsze mają lżejsze plecaki, a więcej ubrań. Odchudzenie plecaka np. o 10 kg, to byłoby coś. Czy macie jakieś doświadczenia w tym zakresie?  - tzn. czy rzeczywiście, jak mówią, można nauczyć się nie jeść, a jeśli tak, to jak to zrobić? Łatwe, trudne, czy niemożliwe?  Dlaczego?",
				"added": 1608141509
			},
			{
				"comment_id": 6,
				"body": "Wracając na chwilę do tematu CO2. Aby nie próbować wyważać otwartych drzwi proponuję najpierw zapoznać się, o czym mówi na ten temat dr Jan Pokrywka. Od lat korzystam z zalet normobarii. Będąc ogólnie zdrowy, nie czuję specjalnej poprawy zdrowia. Ludzie chorzy - zdecydowanie tak, opowiadają o skokowych wręcz zmianach. Dotyczy wszelkich dolegliwości. Mogę na swoim przykładzie potwierdzić, że 2 godziny spędzone w atmosferze zawierającej 1-2% tego dwutlenku na pewno nie truje, w żaden sposób. W ciągu ostatniego czasu obserwuję wręcz lawinowy przyrost liczby komór normobarycznych w Polsce. Co oznacza, że podaż próbuje nadążać za popytem. A popytu nie nakręca przecież wszechobecna reklama. Dlaczego tylko w Polsce? - ciekawe pytanie...  Inne spojrzenie na ten sam temat: proponuję sprawdzić, o czym opowiada Wim Hoff, jeśli ktoś go jeszcze nie zna.",
				"added": 1608194380
			},
			{
				"comment_id": 10,
				"body": "Kolego fornakter, przytaczasz argumenty już dawno i wielokrotnie wyjaśnione. Oba wyjaśnienia  (za i przeciw) zjawisk, których nie możemy zobaczyć z bliska własnymi oczami, można uznać za jednakowo prawdopodobne. Wyjaśnienie dnia i nocy jest akurat najprostsze. To nie żarówka nad kartką papieru. Masz 20 tysięcy km od Bieguna północnego do tzw. południowego. A na jakiej wysokości jest słońce? Atmosfera nie jest próżnią, metr sześcienny powietrza waży sporo ponad kilogram. To coś pochłania światło, tylko w naszej mikroskali wydaje się przejrzyste. Argumentów za płaską ziemią jest chyba 5 razy więcej, niż za okrągłą. Opartych na różnych doświadczeniach. A więc ok. 50 do ok. 10. To pomijamy na razie, bo są potrzebne różne przyrządy i przygotowanie teoretyczne, aby zrozumieć co się bada. \nJa przedstawiam obserwacje, które może zrobić łatwo KAŻDY człowiek własnymi zmysłami. Jeśli Ziemia jest kulą, to takie obserwacje, o których mówię, są niemożliwe. Albo jedno, albo drugie. Ja nie stwierdziłem, że w coś wierzę. Spróbujmy wyjaśnić te podstawy, to może uda się ruszyć dalej.\nA jeśli chodzi o dwutlenek... Spotkałem już w wielu dyskutantów, którzy nie spróbują wykonać żadnego własnego doświadczenia, bo przecież nauka mówi co innego. I zaliczają mnie od razu do \"płaskoziemców\" i \"antyszczepionkowców\", bo to dla nich największe dno. Zacytowałem tylko typowe \"obelgi\". Zbieżność z tematem jest przypadkowa (może nie do końca :-)). W każdym razie można zaliczyć oba dyskutowane tematy do tej samej kategorii ściemy w określonym celu.\n\nPo prostu przekonaj mnie, że na dowolnych 10 kilometrach płaskiej powierzchni Ziemi  (powierzchnia wody, a może długa autostrada przez ocean?) zobaczysz kopułę o wysokości 2 metry. Nie 2 cm, nie 20, ale 200 cm. W żadne sposób nie dałoby się tego nie zauważyć, gdyby była. Wychodzi z obliczeń na poziomie chyba podstawówki, przynajmniej kiedyś tak było. Wtedy ten argument odpadnie. A może światło ugina się wzdłuż powierzchni wody? Wzdłuż drogi nad wodą - też? Ale promień lasera raczej nie ugina się. Widziałem filmy z laserem, które pokazywały i jedno i drugie. W obu dowodach promień lasera nie uginał się i przyjęli za pewnik. Którym byś uwierzył? Po czym poznać, w którym z nich oszukują? - tzn. łatwo można. Podstawowa zasada ciągłości obrazu, ale mało kto z oglądających to zauważa.\n\nA może tę dwoistość da się jakoś wytłumaczyć, a tylko my nie wiemy jak? \n\nZa bardzo to wszystko przypomina bajkę dla dzieci \"Król jest nagi\". Przytoczyłem te dwa przykłady, a w pogotowiu jest może z 10 kolejnych? - ale są trudniejsze, bo do zrozumienia wymagają bardziej specjalistycznej wiedzy, niż twierdzenie Pitagorasa.",
				"added": 1608225901
			},
			{
				"comment_id": 12,
				"body": "Normobaria to JEST sprawdzoną metodą leczenia i zapobiegania potencjalnym problemom. Po tytule filmu sądzę, że to dr Jan Pokrywka. \nZwróćcie uwagę na swoistą pokrętną logikę, dzięki której normobarii nie ma na świecie. Powszechne zastosowanie normobarii w skali świata (a więc cudowne wyleczenia ludzi), miałyby co najmniej dwa \"negatywne\" skutki. 1. Ludzie by przestali chorować. 2. Nie dałoby się utrzymać mitu o szkodliwości CO2. Te dwa są oczywiste, pozostałe - trochę mniej oczywiste. \nTo samo dotyczy postu, nawet \"negatywne\" skutki są podobne: 1. Ludzie przestaliby chorować. 2. Nie dałoby się utrzymać mitu o konieczności tak olbrzymiej konsumpcji, jaką obserwujemy dzisiaj. 5 posiłków dziennie? a może 1 na tydzień? Komu to przeszkadza? \n\nStwierdzenie \"komu to przeszkadza\" wywołuje kolejne tematy. Np. komu tak bardzo przeszkadzały konopie, że nagle stały się \"strasznym narkotykiem\"?  \n\nGarść znanych faktów dotyczących Indii. Ale czy na pewno znanych? Ich tradycyjna medycyna opiera się na Księgach Wedy, liczących kilka tysięcy lat. Do Indii Księgi Wedy trafiły z terenów środkowej Europy, czyli z...? Dzisiaj specjaliści z Rosji, jeśli natrafiają na jakieś trudności z przestawieniem metabolizmu na tryb postu, sięgają do Wedy, bo tam wszystko jest wyjaśnione. Czy już kółko się zamyka? Dzisiaj genetycy potwierdzają, że na tych terenach MY jesteśmy STALE od umownych 10 tysięcy lat. A archeologia odkrywa zaawansowane struktury z tamtego okresu. Komuś chyba to przeszkadza, bo jakoś cicho na ten temat. \n\nA harcerstwo? - no, trochę rozmarzyłem się do wspomnień... Tak było, jak mówi driud.",
				"added": 1608228767
			},
			{
				"comment_id": 14,
				"body": "Uderzasz efi3 w stół i gafel2 się odzywa...\nOprócz farmacji i chemii (podobno roczne dochody poszczególnych firm znacznie przekraczają budżet Polski) -całe rolnictwo zbożowe, cały przemysł cukrowy i wiele innych. Konopie stały się groźne, jak w USA wynaleziono kombajny do zbioru konopi. Przemysł papierniczy (papier z drewna) poczuł się zagrożony, pojawiły się liny nylonowe - konkurencja dla konopnych, i mamy. Papier z konopi jest dużo lepszy, niż z drewna. Akcja medialna i konopie stały się marihuaną. Zakazane. \nSkutek? - między innym Ziemia potwornie zanieczyszczona plastikiem (z ropy naftowej), samym wydobywaniem ropy... Bo właściciele papierni poczuli się zagrożeni. Chyba, że to był element większego planu. Ktoś inny wyłożył kasę i wykorzystał właścicieli papierni, bo konopie stawały się zbyt niebezpieczne. Roślina, która nie potrzebuje żadnej chemii??? Z której można robić prawie wszystko? - paliwo, ubrania, tworzywa konstrukcyjne, materiały budowlane, doskonała pasza dla zwierząt, lekarstwa. Jak to, ponad 500 pozycji znika z apteki, bo wchodzą konopie? bez skutków ubocznych? A co z leczeniem skutków ubocznych? Kolejne leki znikają? Takich ciągów zależności można tworzyć dużo. Czy ktoś już wcześniej o tym wiedział i pojawił się genialny plan usunięcia konopi? A może zamiast zbóż uprawiać konopie? A dlaczego nie? Dlaczego nie... - bo większość ludzi żyje, aby jeść? - nie pozwolą. Chyba, że staną pod ścianą i zrozumieją. Albo coś im się przemodeluje i zaczną odróżniać dobro od zła.",
				"added": 1608240374
			},
			{
				"comment_id": 15,
				"body": "Dotyczy opisu do polecanego filmu 2018.11.11.02.[PL]-Zdrowie-Nauka-Dwutlenek węgla a długowieczność-[39min]:\nKomora normobaryczna jest trochę podobna konstrukcyjnie do hiperbarycznej. Skutki przebywania - całkowicie inne. W komorze hiperbarycznej nie można być za długo, bo zniszczy płuca. W normobarycznej - można cały czas. Sugeruję, aby nie mylić tych pojęć, bo można sobie zaszkodzić.",
				"added": 1608240873
			},
			{
				"comment_id": 16,
				"body": "Jeszcze o filmie dr Pokrywki. Widzę, że został nagrany ze 6-7 lat temu. Na samym początku eksperymentów dr Pokrywki. I wtedy jeszcze chyba nie pojawiła się nazwa \"komora normobaryczna\". Mówią o komorach \"hiperbarycznych fizjologicznych\"",
				"added": 1608241405
			},
			{
				"comment_id": 17,
				"body": "Kolego fornakter. Przecież ja nie namawiam Ciebie do wiary w wiedzę pokazaną na filmy na YT. Namawiam do obserwacji otaczającego świata i wyciągania wniosków. Weź kartkę papieru (albo arkusz typu Excel) i policz sobie różnicę między wysokością a długością ramion trójkąta równobocznego. Ramiona to promień tej kuli (łatwo znaleźć) Ziemskiej, a podstawa to te 10 km. Mi uparcie wychodzi z obliczeń 2 metry. Nie chcą wyjść 2 cm, których bym nie zauważył w naturze. Potem znajdź jakiś kawałek płaskiej Ziemi, o długości 10 km, najlepiej jezioro, i spróbuj zobaczyć taką kopułę patrząc na to własnymi oczami. Jeśli Tobie to się oda, to zacznę szukać, co jest ze mną nie tak. Jeśli nie zrobisz tego doświadczenia, bo jesteś przekonany, że to niemożliwe, to...\n\nPowtarzasz dwa argumenty, na temat kulistości, które są chyba najlepiej wyjaśnione, do znalezienia na YT, chyba że cenzura już zadziałała...\n\nCzym różni się wiedza przekazana przez myślącego człowieka, robiącego film opublikowany na YT, od wiedzy przekazanej w szkole? Dlaczego miałaby być gorsza? Czy tylko dlatego, że tę szkolną popierają autorytety i była układana przez wiele lat? Ja dzisiaj widzę powszechny upadek autorytetów. Najwyraźniej to widać w medycynie. Większość wiedzy, na której opiera się dzisiaj medycyna, jest odpowiednią mieszanką prawdy i kłamstwa, przygotowaną tak, aby ten fałsz wydawał się prawdziwy. To nie jest oparte tylko na filmikach. Można to znaleźć w wielu publikacjach naukowych. Zagłębiając się w temat: dzisiejsza wiedza medyczna, oparta na naukach biologicznych, bardzo daleko odeszła od medycyny stosowanej. W wielu przypadkach głoszą rzeczy całkowicie sprzeczne. Opierając się na \"autorytetach\" stwierdzisz jedno. Sięgając do prawdziwych publikacji naukowych - coś zupełnie przeciwnego. Zrobił to np. dr. Jan Pokrywka, który oparł się autorytetom i sięgnął do źródeł wiedzy. Zbudował swój dom normobaryczny i potwierdził wszystkie jego teoretyczne zalety. Po tych 7 latach w Polsce mamy prawdopodobnie 50 takich komór, dostępnych dla wszystkich i nieznaną liczbę prywatnych. Nie ma reklam namawiających do korzystania, a powstają ciągle nowe. Bo jest popyt, bo ludzie widzą, jak to działa. Nie jest to popyt wykreowany przez media. Ja sam, osobiście, korzystam z bardzo pozytywnym skutkiem z tej wiedzy, nie tylko w komorze normobarycznej. A że jest przeciwne oficjalnej nauce? To może trzeba wyciągnąć wniosek, że coś z tą nauką jest nie tak? \n\nA więc, zaczynając od podstaw - spróbuj popatrzeć krytycznie na powierzchnię jeziora i znajdź na nim kopułę. Daleko? - znajdź zdjęcia w internecie i popatrz, czy widzisz tę kopułę. To naprawdę nie boli.",
				"added": 1608358175
			}
		],
		"1607981410_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 7,
				"body": "Coś mi chodzi po głowie z historii (nie tej ze szkoły), że oni, od kiedy istnieją, kradną i kradli wszystko. Jedna z hipotez mówi, że ta nacja pojawiła się na świecie dopiero jakieś 600 lat przed naszą erą. A prawdziwy naród wybrany, jeśli tak to można określić, był zupełnie inny. Ten pierwszy, najważniejszy, był tu od wielu tysięcy lat (jeśli systemy datowania są prawdziwe) i dalej jest, tylko zagubił swoją historię. To ci drudzy ukradli im, tym pierwszym, ich historię. Dorobili sobie paskudną ideologię, jak wyżej, której nawet nie chcę czytać, bo to samo zło i jest jakby oczywista bez czytania. Potem spodobała się ta ideologia innej, trzeciej grupie, bo najbardziej pasowała do dążeń tej trzeciej grupy. Możliwe, że to ta trzecia dołożyła coś od siebie do ideologii tej drugiej. Bo ta trzecia od zawsze próbowała zniszczyć tę pierwszą. Wtedy ta druga grupa stała się narodem wybranym, ale wybranym do pacyfikacji, do podmiany przez tych trzecich. Niby dalej jest ta druga grupa, ale istoty (bo to nie są ludzie) tworzące tę grupę są już zupełnie inne. Trochę tych drugich jeszcze zostało (do pacyfikacji). Wszystkie te działania obserwujemy dzisiaj w całej okazałości. Nie pogubiliście się? :-) - próbowałem maksymalnie uprościć to, co mi chodzi po głowie i układa się w jakiś obraz na podstawie strzępków danych z różnych źródeł, ogólnie dostępnych dla każdego. Oczywiście nie w TV. Prawdziwa prawda może być jeszcze bardziej skomplikowana. I nie twierdzę, że dobrze to poskładałem, ale dzisiaj taki obraz wydaje mi się najtrafniejszy.",
				"added": 1608204756
			},
			{
				"comment_id": 8,
				"body": "I jeszcze coś. Wiem, że nie tylko mi chodzą po głowie takie teorie, ale tu jakoś chyba nikt o tym nie pisze. No to napisałem, w odpowiedzi na zachętę do dzielenia się wiedzą. Z jakich to strzępków składa się ten mój obraz? Z ciekawostek może powiem, bo o tym to chyba mało kto wie, że dwaj naukowcy, Niemiec i Włoch, po analizie zachowanej próbki pisma narodu, zwanego Filistynami stwierdzili, że to był język słowiański. Opublikowane w fachowym wydawnictwie 2-3 lata temu. Wyciągnął to dla nas Marian Nosal. I tak kawałeczek, po kawałeczku...",
				"added": 1608206052
			},
			{
				"comment_id": 9,
				"body": "Komentarz do: Byli gotowi??? bo sami je organizowali.\nNa przykładzie tej błyskawicy, która rozpaliła tak wiele emocji. Pojawiła się pierwszy raz ze 2 lata temu. Sprawdzono - przyjęta pozytywnie przez większość. A więc mieli gotowy symbol do tegorocznych zamieszek. I wykorzystali go. A wielu ludzi odrzuca od tego symbolu, bije z niego ogromna, zła energia. Okazuje się, że naprawdę wielu to zauważa, ale siedzą cicho, bo rozjuszone baby spacyfikują... Nie wytłumaczysz im, jak dały się podejść, bo rozjuszona baba zawsze wie lepiej. Emocje tłumią zdolność odróżniania dobra od zła.",
				"added": 1608206689
			}
		],
		"1607453657_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 11,
				"body": "Towarzystwo mniej więcej \"znane\" z innych dyskusji, to się wtrącę... Taki mały argumencik do dyskusji. Mam przed oczami scenę, w której Putin przekazuje Trumpowi do rąk własnych twardy dysk z pedofilską korespondencją Hilary. A może mi się wydawało? Ale jeśli tak naprawdę było, to gra może toczyć się na dużo wyższym poziomie. \n\nA może te wszystkie debilne działania, które nas otaczają, są tylko po to, aby ludzie w końcu obudzili się i powiedzieli - dosyć? Czy to nie byłby jeszcze wyższy poziom gry? No bo jak ich wszystkich obudzić, bez stawiania pod ścianą?",
				"added": 1608226601
			},
			{
				"comment_id": 13,
				"body": "no to mamy: ograniczenia dotyczące świąt, sylwestra, brak ferii... W Hiszpanii rząd rozważa eutanazję z dostawą do domu... Wiem, ciągle jeszcze za mało, aby dostatecznie dokuczyć. Ze 2 miesiące temu (chyba) minister powiedział, że restrykcje mają być przede wszystkim dotkliwe. To teraz, to jeszcze nie jest wstrząs, szok, grom z jasnego nieba. Raczej powolne gotowanie żaby. Taki test: wytrzymują? - to jeszcze... Kiedy i czy zorientuje się (ta żaba), że już jest za późno? A może ktoś zastanowi się, dlaczego właściwie te restrykcje mają być dotkliwe. Cel? - i obudzi się?\n\nDla kogo są przeznaczone te przecieki? - to (możliwe) przekazanie dysku momentalnie odsłoniło mi wyższe, możliwe poziomy gry. Czy tylko na mnie to tak podziałało? A może to był właśnie cel tego przecieku? uzmysłowić ludziom poziom tej gry? I zwiększyć prawdopodobieństwo określonej linii czasowej dzięki naszym intencjom?",
				"added": 1608236842
			}
		],
		"1608360093_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 18,
				"body": "Głos poparcia. Na pierwsze wątpliwości trafiłem kilka lat temu. Wypowiedzi noblistów na ten temat brzmiały wtedy dosyć niewiarygodnie. Kolejne znajdowane materiały coraz bardziej potwierdzały, że teoria głosząca, że to wirusy wywołują choroby, zaczyna się sypać. A jak w końcu pojawiło się tak dużo publikacji (cały czas chodzi o publikacje medyczne, nie o jakieś S-F) o egzosomach, to już trudno naprawdę w te wirusy dalej wierzyć. Za opublikowanie wiedzy o egzosomach też ktoś dostał nagrodę Nobla. Wszystko do sprawdzenia. Dzisiaj nie ma technologii pozwalającej odróżnić egzosom od wirusa. Jedyny wyróżnik, na jaki trafiłem, to wynik badania PCR. Konkluzja była następująca: jeśli wyjdzie pozytywny, to mamy C19. Jeśli negatywny, to egzosom. Naprawdę ciekawe podejście :-)  \n\nPozorna epidemia z 1918 też doczekała się wielu publikacji. Wszystko, tylko nie grypa. Chociaż, samo określenie \"grypa\" może nabrać zupełnie innego znaczenia, wraz z wiedzą. Nie jako \"choroba\" wywołana wirusami, ale jako naturalny proces, który dzisiaj nie do końca jest rozumiany i wyjaśniony.   \nJako przykład przytoczę (z pamięci) fragment dyskusji: \"... udało mi się w końcu złapać grypę, z temperaturą. Mam nadzieję, że uda mi się utrzymać ją (tę temperaturę), przez kilka dni. Pomoże mi pozbyć się borelii\". Dla nie wiedzących: borelie, wysoko zorganizowane \"bakterie\" - krętki, wywołujące boreliozę, której większość tak bardzo boi się dzisiaj.\n\nJak bardzo różni się to od tego, co możemy usłyszeć w TV i od przeciętnego lekarza...",
				"added": 1608417138
			},
			{
				"comment_id": 19,
				"body": "Na poparcie teorii, że patogenem mogą być fale radiowe, przytoczą dwie informacje. Do sprawdzenia. Specyfikacja 5G mówi, że fale radiowe w zakresie 60 GHz są silnie pochłaniane przez obiekty żywe. Zalecają !!! pozbyć się obiektów żywych na drodze nadajnik - odbiornik. A co im przeszkadza? Fizyka mówi, że atomy tlenu mają pik pochłaniania energii przy  częstotliwości 60 GHz właśnie. Pochłanianie energii, to zamiana jej na ciepło. I układanka się składa. Gdzie były ogniska epidemii? - tam, gdzie były uruchomione sieci 5G w podanym pasmie. Dlaczego u nas nie wyszło? 5G niby już jest, w kilku miastach (ja bym wiał jak najdalej) ale (podobno) pracuje (na razie?) w innym zakresie częstotliwości. Czy mamy tu jakiegoś speca od telefonii komórkowej, który mógłby potwierdzić albo zaprzeczyć zasłyszane informacje o tych stosowanych u nas częstotliwościach?",
				"added": 1608417812
			},
			{
				"comment_id": 21,
				"body": "komentarz do wypowiedzi sasza\nSą już takie kręgi, w których alkohol jest jednoznacznie klasyfikowany jako broń biologiczna. Moźe to niespodzianka dla niektórych, ale w Rosji też. Wygląda na to, że młodzi się budzą...",
				"added": 1608467913
			},
			{
				"comment_id": 22,
				"body": "komentarz do wypowiedzi efi3.\nPodwyższenie temperatury, jest od dawna potwierdzone, mówią o tym nauki biologiczne i praktyka. Co ciekawe, uczą o tym na studiach medycznych!!! Jakoś zaraz po studiach zapominają o tym. Poprawka , nie wiem, jak dzisiaj, ale 10 lat temu na pewno uczyli. Drugi element leczenia, to post. Leczy wszystko (dosłownie), pod warunkiem, że przebiega komfortowo. Przynajmniej ja tak myślę, że to jest warunek, tzn. post musi być przechodzony bez stresu wywołanego tym postem. \nJa nie wierzę w to, że można nie jeść, np. przez tydzień i dłużej. Ja wiem, bo sam spróbowałem, wielokrotnie. Inni, którzy spróbowali, mówią to samo. Są oczywiście warunki wstępne, ale to jest tylko (albo aż) - wiedza.",
				"added": 1608468545
			},
			{
				"comment_id": 26,
				"body": "Ja bym nie pomijał wpływu ograniczenia jedzenia na gojenie złamanej nogi. Podstawowa logika nakazuje, w takim przypadku, przestać obciążać organizm trawieniem, czyli uruchomieniem skomplikowanej fabryki biochemicznej. A może ograniczyć się do absolutnie podstawowych dodatków: kolagen, witaminy, minerały, aby całą dostępną energię przeznaczyć na szybsze gojenie tego złamania? Tu już może wchodzić w grę celowe działanie, oparte na zrozumieniu działania organizmu. Będę głodny? - to może lepiej byłoby wcześniej nauczyć się nie odczuwać głodu? - przyda się również na inne okazje.",
				"added": 1608716338
			}
		],
		"1608325060_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 20,
				"body": "Pozwolę sobie dodać coś, bo moim zdaniem nie do końca mocno zostało podkreślone, czym skutkuje zawartość hormonu hormonu ciążowego. Zaszczepiona kobieta nie może zajść w ciążę. A więc - depopulacja. Kilka lat temu wyszło to na jaw w Kenii przy okazji innej, \"zbawczej\" szczepionki. Tysiące kobiet straciło zdolność zajścia w ciążę. Ten przykład jest wielokrotnie przytaczany i nigdy nie był wiarygodnie obalony. \n\nZwartość trujących substancji przestanie zadziwiać, jeśli zapoznamy się z wynikami badań dwojga włoskich toksykologów, opublikowanych  kilka lat temu. Przebadali wszystkie szczepionki dostępne w Europie i tylko w jednej nie znaleźli tych trucizn. W szczepionce dla koni. Szczepionki dla ludzi mają działać na tyle dyskretnie, aby trudno było powiązać skutek z przyczyną. Trafiłem na wypowiedzi naukowców biologów twierdzących, że w przypadku tej nowej, wektorowej, negatywne skutki będą obserwowane masowo, ze względu na zaplanowane działanie + te wszystkie toksyny. Nie takie działanie, jak nam (podobno) obiecują w TV. A więc, kto rozsądny pozwoli wcisnąć do własnego ciała sobie coś takiego?",
				"added": 1608454905
			}
		],
		"1608488270_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 23,
				"body": "Dzięki driud za dobre podsumowanie... Dodam może coś. Eutanazja? - a dlaczego ludzie tak ciężko chorują i w końcu chcą tego czegoś? Nie lepiej nie chorować i odejść sobie spokojnie, kiedy przyjdzie czas?\nParacetamol: mądrzy ludzie piszą, że nie tylko uszkadza wątrobę, ale powoduje stymulację mikrogleju. Można sobie poczytać o tym, albo zapytać lekarza. W tym drugim przypadku raczej nie uda się dostać odpowiedzi...\nZ tego, co można znaleźć w książkach, to coś znacznie gorszego, niż uszkodzona wątroba.",
				"added": 1608495096
			},
			{
				"comment_id": 25,
				"body": "Może coś dodam, na zachętę, bo jakoś nie widać chętnych do czytania. Skutki długotrwałej stymulacji mikrogleju to coś, o czym mówią podstawowe nauki medyczno - biologiczne, ale co zupełnie nie pasuje do drogi obranej przez współczesną medycynę stosowaną. Jest już wiele znanych stymulantów mikrogleju (aluminium i rtęć też). Stymulacja mikrogleju ma usunąć zagrożenie, potem mikroglej ma wrócić do stanu spoczynku i uruchomić naprawy. Przedłużający się stan wzbudzenia mikrogleju oznacza brak napraw. A jakie są skutki takiego przedłużającego się stanu? np. autyzm, demencja na starość. Ta przyczyna wysuwa się dzisiaj na pierwsze miejsce, oczywiście wydatnie wspomagana innymi metodami, np. nadmiernym spożyciem węglowodanów.  Uszkodzona wątroba to albo szybkie wyleczenie (jeśli człowiek \"zmądrzeje\"), albo szybka lub odwlekana śmierć, ale z zachowaniem świadomości. Autyzm, spektrum Aspargera i demencja - to ogromne obciążenie, fizyczne i psychiczne dla rodziny. Wywraca całe życie.",
				"added": 1608536701
			},
			{
				"comment_id": 30,
				"body": "\"Tlen\" leczy. Całkowita prawda. Ale tak mało ludzi wie, że do skutecznego działania tlenu potrzebny jest jeszcze dwutlenek węgla, w określonych ilościach. Nie za dużo, nie za mało. Medycyna (ta prawdziwa) doskonale o tym wie, potwierdzenia można znaleźć w licznych publikacjach i BARDZO łatwo można sprawdzić w praktyce. A więc, dlaczego nam \"wciskają\", że ten dwutlenek nam szkodzi? Takich aspektów jest bardzo dużo. Poznanych już i tych jeszcze (prawdopodobnie) nie znanych...",
				"added": 1608973187
			},
			{
				"comment_id": 31,
				"body": "Jest jeszcze jedna istotna rola CO2. W lekko (odpowiednio) zakwaszonym środowisku hemoglobina lepiej oddaje tlen do tkanek. Do tego lekkiego zakwaszenia służy dwutlenek węgla. Jest to tzw. efekt Bohra, znany naukom medycznym od ponad 100 lat. Można o tym poczytać w literaturze fachowej. Organizm ma oczywiście inne, awaryjne sposoby. Jeśli są one wykorzystywane przez cały czas, to skutki są takie, jak obserwowane dookoła. To dlatego starożytna medycyna indyjska sugeruje, aby zwolnić oddech - w celu oszczędzania dwutlenku węgla. Dlaczego trzeba go oszczędzać? - bo jest go za mało w otaczającym nas powietrzu. Dlaczego jest go za mało? - są różne hipotezy. Zaczynając od katastrofy kosmicznej, kończąc na rodzaju testu. To wszystko wyjaśnia dr Jan Pokrywka w swoich wykładach. Mądrego dobrze posłuchać...",
				"added": 1609055166
			}
		],
		"1608467155_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 24,
				"body": "Konkurencja? - niektórzy mówią, że to święto zostało ukradzione przez ten kościół... Nie lubię złodziei, jakoś tak się składa...",
				"added": 1608495486
			}
		],
		"1608946398_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 27,
				"body": "W artykule przewija się wątek braku witaminy D, który wydaje się być kluczowy. Poziom metabolitu 25 (OH), powiązanego z poziomem witaminy D, łatwy do zbadania, wydaje się być najlepszym wskaźnikiem przynależności do grupy ryzyka. Powyżej 80 ng/ml, jak podają źródła, ryzyko jest (podobno) zerowe. Niezależnie od wieku. Wniosek jest prosty. Dużo witaminy D, innych niezbędnych witamin - i po strachu. Czy to naprawdę może być aż tak proste????",
				"added": 1608970713
			},
			{
				"comment_id": 34,
				"body": "Czy 1 zł na dobę jest wygórowaną ceną pozbycia się strachu? Na tyle szacuję dzienną porcję witaminy D, do połykania w czasie, kiedy nawet w południe słońce jest za nisko, aby produkować tę witaminę... Aha, glifosat, powszechnie stosowany przez naszych rolników, blokuje wchłanianie tej witaminy. Trzeba przemyśleć, jak to obejść... Jakieś pomysły?",
				"added": 1609058533
			},
			{
				"comment_id": 36,
				"body": "Obawiam się, że jedyną obroną przed glifosatem jest dzisiaj unikanie. Potrzebne byłoby coś do wykrywania tego w kupowanym pożywieniu. Jeśli przestaniemy kupować żywność z glifosatem, to rolnicy przestaną to lać na uprawy.",
				"added": 1609149174
			},
			{
				"comment_id": 37,
				"body": "Zgadza się. Nie wiedzą, albo nie chcą wiedzieć, że zabijają ludzi. Dosłownie. I leją go na wszystko.",
				"added": 1609188046
			},
			{
				"comment_id": 38,
				"body": "Pomysł... Czy sądzicie, że podręczny, tani miernik zawartości glifosatu w kupowanej żywności miałby sens? Ciekawe, czy jest możliwość pomiaru bezdotykowego? - chodzi o produkty w opakowaniach. Przypominam: najważniejsze  niebezpieczeństwo glifosatu dla nas to dewastacja mikrobiomu i blokowanie produkcji witaminy D w organizmie, ze wszystkimi tego skutkami. Glifosat raz wpuszczony do środowiska nie ulega rozkładowi.",
				"added": 1609303591
			},
			{
				"comment_id": 39,
				"body": "Ta sonda wbijana w mięso to było raczej urządzenie do badania zawartości azotanów albo azotynów. To pokazuje w swoich filmikach Marcin Bustowski. Zaufanie do producenta to jedno, a sprawdzenie - to inna sprawa. A na przykład jajka? Owszem, kurki biegają po trawie, a co było wcześniej lane na tę trawę? Zamarzył mi się taki nieinwazyjny miernik... Inaczej ich nie zmusimy do zmiany zachowań, jak ekonomicznie. Nie kupując skażonego towaru. Od lat to znamy: inaczej produkują dla siebie, inaczej - do sklepu.",
				"added": 1609328304
			},
			{
				"comment_id": 41,
				"body": "Pierwszy wniosek, który mi się nasunął po przeczytaniu ostatnich komentarzy, to to, że człowiek miotający się w labiryncie,  jeśli nie umie spojrzeć na ten labirynt z góry, to prawdopodobnie nigdy nie znajdzie wyjścia z tego labiryntu. Takim labiryntem może być to poruszone \"pseudo eko\", czy \"jak przekonać milion konsumentów\". W labiryncie, czyli w tym Matriksie, w którym teraz żyjemy, jest to niemożliwe. Przeczytałem wczoraj nowy, styczniowy raport energetyczny Anny Architektury. Ubiera ten raport w słowa wszystko to, co jest możliwe. A więc jest możliwe prawdziwe EKO i jest możliwe przekonanie milionów konsumentów.",
				"added": 1609493166
			},
			{
				"comment_id": 42,
				"body": "GROCH Z KAPUSTĄ, DOKŁADNIE WYMIESZANY? - chyba zagubiłem się, jakiego zestawu linków to dotyczy? \n\nKomentarz do raportów energetycznych Anny Architektury. Jestem absolutnie pewny, że kilka lata temu przestał bym to czytać po kilku linijkach. Teraz żałuję, że tak późno na to trafiłem. Pierwsza moje odczucie, kiedy czytam to dzisiaj: to nie jest materiał, który służy to budzenia. Odbieram to raczej jako rodzaj potwierdzenia, że inni myślą tak samo. Jest garstka takich, którzy też na to trafili - patrzcie komentarze pod tekstem. Oczywiście, że publikując coś takiego można dostać łatkę \"oszołoma\", jeśli trafią na to tacy, jakim ja byłem kiedyś. Zdaję sobie sprawę, że dzisiaj wielu znajomych z dawnych czasów przykleja mi taką łatkę.\nTo, co się wokół nas dzieje, dawno już przeszło granice absurdu. Zauważyłem, w bezpośrednich kontaktach z ludźmi, że te granice są bardzo różne u różnych ludzi. Ale faktycznie zagorzali zwolennicy (niedawni), zaczynają głośno mówić: \"co oni odwalają? - to bezsens\". Jest szansa, że człowiek wytrącony z równowagi, zacznie się zastanawiać: co tu się naprawdę dzieje?\n\nCo robi z nas niewolników? - mówię o populacji. Wg. mojej wiedzy to nie jakiś \"gen\". Geny to tylko matryce, służące do wytwarzania określonych białek w określonych warunkach. Mówi o tym nauka zwana epigenetyką.\nA więc, co robi z nas niewolników? \n1. Dieta. Sięgając do starożytnych źródeł wiedzy, mamy dietę kapłanów i dietę niewolników. Czy wiemy, czym się różnią? Czy umiemy zastosować to w praktyce? Dlaczego niewolnik, za próbę przejścia na dietę kapłanów, był karany śmiercią? Pewnym problemem jest to, że niewolnik na diecie niewolników nie zrozumie zalet diety kapłanów, zanim nie przejdzie na nią. Niewolnik miał być tępy i nie chorować. Dzisiaj chorujemy (jako populacja), bo stosujemy coś gorszego, niż dietę niewolników. Większość populacji biologicznie działa w trybie awaryjnym. Nieefektywne procesy biochemiczne oznaczają szybkie zużycie rezerw, przechodzenie w jeszcze mniej wydajne procesy  biochemiczne, zużywające jeszcze więcej rezerw i w końcu możliwości adaptacji się kończą. Tak żyje dzisiaj większość populacji. Nasze organizmy to doskonałe maszyny biologiczne, ale będą działać maksymalnie wydajnie tylko w optymalnych warunkach. \n\n2. Zatrucie. Od dawna wiadomo, że fluor to neurotoksyna, która służy przede wszystkim do zablokowania szyszynki. Od czasów starożytnych wiadomo, że szyszynka jest przekaźnikiem służącym do bezpośredniego kontaktu z duszą. Pasta do zębów bez fluoru? - życzę powodzenia w szukaniu.\n\nTo dwa przykłady, które nasunęły się z marszu. W ewentualnej dyskusji z pewnością pojawi się więcej. Przecież są takie pojęcia, jak \"cukrzyca typu III\", \"stan zapalny mikrogleju\" - i z pewnością wiele innych.\nBlokady mentalne, wspomniane przez któregoś z kolegów.\nPranie mózgów w uczelniach dla \"elit\" - \"więźniowie lewej półkuli.  I co tam jeszcze przewijało się przez różne dyskusje.\n \nEfekt setnej małpy. Po mojemu to jest tak, że jak już ta setna małpa czegoś się nauczy (czyli 100 małp już wie), to zostaje przekroczona masa krytyczna i \"nagle\" nauczy się tego cała populacja. Tysiące - miliony? Czy próbowaliście zapoznać się z pracami Davida R. Hawkinsa? Dla mnie doskonale współgra ze starą już teorią pól morfogenetycznych - efektem setnej małpy.  \n\nDlaczego ciągle większość ludzi jest \"uśpionych\"? - bo codziennie jedzą \"chleb powszedni\"?",
				"added": 1609579512
			}
		],
		"1608770890_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 28,
				"body": "Nikomu nie życzę śmierci w męczarniach. Może niech po prostu odejdą, niech poczują, że są nieważnym marginesem, który już nikogo nie interesuje. Ich głosy przestaną docierać do naszych uszu...",
				"added": 1608971284
			},
			{
				"comment_id": 33,
				"body": "Spotkałem się z informacją, że u naszych przodków najwyższą karą za przewinienia było właśnie całkowite wykluczenie ze społeczności. Zdaje się, że to było powiązane z jakimś nieusuwalnym \"piętnem\" tego wykluczenia. Czy dla zwyrodnialca z wybujałym ego, sprowadzenie go do zera będzie adekwatną \"karą\"? - ze świadomością bezwzględnej i nieuchronnej pacyfikacji przy jakiejkolwiek próbie agresji? Jakoś trudno mi przychodzi skazywanie kogoś na tortury.  Z drugiej strony, drwiący uśmiech, typu \"nic mi nie zrobicie\", też mi nie pasuje... Co o tym sądzicie?",
				"added": 1609057756
			}
		],
		"1608910860_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 29,
				"body": "Co może oznaczać powszechna \"POBUDKA\"? Olśnienie, że to \"ego\" rządzi \"firmą\", określoną nazwą \"ja\"?- zamiast prawdziwego szefa tej \"firmy\"? Olśnienie, dotyczące związków przyczynowo skutkowych w otaczającym nas świecie? Gdzie i jak nas oszukują? Czy można wyobrazić sobie, że większość nagle zrozumie idiotyzm zakazów i przestanie się do nich stosować? Że zaczną zastanawiać się, co im jest naprawdę potrzebne do życia? Do szczęścia? Że zignorują tych wszystkich, którzy próbują nas wykorzystywać? Sprowadzą ich do nieistotnego marginesu?  Czy musimy ich \"rozliczać\"? - czy nie wystarczy, że staną się niepotrzebni i \"odejdą\"?",
				"added": 1608972339
			},
			{
				"comment_id": 32,
				"body": "Bez spojrzenia na cały problem \"z góry\" - taka POBUDKA jest rzeczywiście bardzo trudna. Człowiek w labiryncie może całe życie szukać wyjścia. Chyba że spojrzy na problem z góry. Co może być takim spojrzeniem  góry, w naszym przypadku? np. uświadomienie sobie, że to jest realizacja określonego planu, w określonym celu. Ułatwi to odróżnienie prawdy od fałszu, a w rezultacie - spojrzenie z góry i znalezienie drogi wyjścia. Im więcej ludzi \"nadaje\" do pola informacyjnego, tym łatwiejsza jest ta POBUDKA. Patrz \"efekt setnej małpy\"...",
				"added": 1609056965
			}
		],
		"1608998976_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 35,
				"body": "Koledzy. Po przeczytaniu od razu nasunęło mi się rozwiązanie, znane pod nazwą HEALY. Określanie problemów i przywracanie równowagi dzięki określonym częstotliwościom. Duże urządzenia, działające na tej zasadzie, mają służyć do szybkiego określania stanu zdrowia. Działanie można przyrównać do biorezonansu, ale badanie zamiast godzin zajmuje minuty.",
				"added": 1609059158
			},
			{
				"comment_id": 40,
				"body": "Oprócz wspomnianych wcześniej urządzeń HEALY, dostępnych komercyjnie z szeregiem programów (znam ludzi, którzy to stosują na co dzień), te krzesła kojarzą mi się z wystąpieniami Jana Taratajcio sprzed kilku (5?) lat. Opowiadał wtedy o czymś takim. Na razie nie bardzo mam czas szukać...",
				"added": 1609330004
			},
			{
				"comment_id": 43,
				"body": "Chciałbym zwrócić Waszą uwagę na pewien aspekt, poruszony w rozmowie \"Promieniowanie wokół nas\". Jesteśmy w lesie, otaczają nas kojące dźwięki. Pojawia się ktoś z głośnym ACDC. Bardzo przeszkadza. Nie technologia, nie sztucznie wytworzony dźwięk, ale rodzaj przekazu. Jeśli w domu puścimy sobie muzykę relaksacyjną (typu 528 Hz), albo nagrane odgłosy lasu, to dalej działają one relaksacyjnie. \nA więc problemem jest otaczający nas chaos i natężenie częstotliwości, a nie częstotliwości same w sobie. Tak, jak stworzono muzykę działającą relaksacyjnie, tak samo można stworzyć częstotliwości z wyższego zakresu, które będą dla nas pozytywne. Doświadczenia pokazują, że mogą być one lecznicze, uspokajające, dające energię, moc przekonywania, pewność siebie i prawdopodobnie wiele innych. \nOd dawna wiadomo, (ale chyba nie powszechnie?), że 50 Hz w sieci energetycznej jest jedną z najgorszych częstotliwości. Niektórzy twierdzą, że specjalnie... Chyba w Szwecji od dawna instalacje elektryczne w domach są wyłączane na noc (poza np. lodówką). Mówi się też o ekranowaniu przewodów elektrycznych w domu. Swój dom budowałem kilka lat temu i niestety instalację elektryczną mam nieekranowaną. Wtedy nie wiedziałem jeszcze...\nZ drugiej strony mamy informację, jakie częstotliwości na pewno szkodzą, nie ze względu na naniesioną na nie informację (harmonię, albo chaos), ale same w sobie są szkodliwe. 2,4 GHz - gotuje wodę. Nasze maszyny biologiczne zawierają dużo wody. 60 GHz (docelowe dla 5G) to pik absorpcji atomów tlenu. Przegrzany tlen, którego potrzebujemy do wielu procesów metabolicznych, raczej nam zaszkodzi, niż pomoże.\nI tak dalej...\nJa bym nie wylewał dziecka z kąpielą",
				"added": 1609665210
			},
			{
				"comment_id": 44,
				"body": "Nieprecyzyjnie wyraziłem się w poniższym komentarzu. Chodziło mi oczywiście o natężenia promieniowania o określonej częstotliwości, a nie o natężenie częstotliwości. Taki skrót myślowy mi wyszedł niechcący...",
				"added": 1609665494
			},
			{
				"comment_id": 47,
				"body": "Cieszę się, że ktoś jeszcze WIE, że częstotliwości mogą leczyć :-)\nNie tylko szkodzą.\nHarmonia leczy. Chaos szkodzi.\nUziemianie... od kilku lat skarpetki i buty zakładam tylko wtedy, gdy jadę do miasta. Z reguły raz w tygodniu, maks. 2 dni. Chodzenie boso po trawie, również zimą - rewelacja. Po śniegu - też.\nKiedy nauczymy się nosić buty z przewodzącego materiału? - indiańskie skórzane mokasyny zdaje się przewodziły?\nKto pamięta, że jeśli musimy rozmawiać przez komórkę, najlepiej jest robić to boso, na trawie. Ochronny potencjał ziemi przenosi się na całego człowieka i chroni przed szkodliwym promieniowaniem.\nKto stosuje w pracy ochronne uziemione maty pod bosymi stopami?",
				"added": 1609715540
			},
			{
				"comment_id": 51,
				"body": ":-) Czy któryś z Was sprawdzał komercyjną dostępność takich butów? Bo może ktoś już pomyślał?\nJa mam \"biuro\" w domu w lesie. Siedząc przy komputerze mogę trzymać stopy na uziemionej macie. Takie maty, produkowane w tym właśnie celu, są dostępne komercyjnie. Może buty - też?\nNie bardzo sobie wyobrażam siedzenie bez butów w normalnym biurze.\nObserwuję przyjeżdżających do mnie gości. Każdy wkłada plastikowe klapki, wychodząc na zewnątrz. Mimo, że widzą, co ja robię. Dziwak jakiś...\nPomysł na biznes w \"odnowionym\" świecie? W trudnych warunkach nie da się chodzić boso, za dużo zagrożeń.",
				"added": 1609837962
			},
			{
				"comment_id": 52,
				"body": "Uziemianie butów\nhttps://www.groundology.pl/earthing/uziemiajace-obuwie",
				"added": 1609838121
			},
			{
				"comment_id": 57,
				"body": "Przytoczyłem tę informację (o uziemianiu przez buty) butów nie jako rozwiązanie do korzystania (za drogie, jak mówi driud), ale jako potwierdzenie, że inni też tym się interesują i może jako inspirację. Np. jakieś pomysły, z czego zrobić tanią matę pod stopy, do pracy przy biurku, dostępną dla wszystkich? Może jakaś miedziana siatka? Pierwszy pomysł to styropianowy ekran pokryty folią aluminiową, ale to aluminium budzi sprzeciw. Czy to pewno jest bezpieczne w kontakcie z bosymi stopami? Niby tlenki aluminium są nieaktywne chemicznie, ale pewności nie mam.\n\nA tak przy okazji...\nDieta \"kapłana\" może być bardzo tania. A więc dostępna dla wszystkich.",
				"added": 1609927686
			}
		],
		"1609543281_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 45,
				"body": "Zastanawiam się nad tego typu podejściem, jak w komentarzu sj29msn5kz0ldmn... Jakoś za bardzo przypomina mi to tzw. \"wylewanie dziecka z kąpielą\".\nZ takim podejściem nigdy bym nie poznał np. Dziada, Jacka, Anny, Anastazji i wielu, wielu innych...",
				"added": 1609668468
			},
			{
				"comment_id": 48,
				"body": "Mam wrażenie, że o wszystkim, co jest planowane, jesteśmy uprzedzani z jakimś wyprzedzeniem. Jakby ktoś \"chciał\", abyśmy w końcu obudzili się (jako społeczeństwo). Poziom absurdu spada już niepokojąco nisko - ciągle nic. Przykład: uprzedzali, że restrykcje będą przede wszystkim dotkliwe. Są? a może jeszcze za mało? - że do przekonywania nas zatrudnią \"celebrytów\". Zatrudnili. W żenujący sposób, odwołując się do doświadczeń z PRL-u. Do wpychania się w kolejki bez kolejki. Czy na młodych też to działa???\n\nJak odróżniacie prawdę od fałszu? Czy też tak macie, że to od razu \"wiadomo\"?\nAle... byłem dzisiaj w mieście i jakiś klient rzucił się na mnie z pyskiem, że nie zasłoniłem nosa i ust. Ja WIEM, że to jest całkowicie zbędne, a on WIERZY, że jest inaczej. A więc jego \"prawda\" jest zupełnie inna, niż moja. Skąd więc wiadomo, która prawda jest prawdziwa? Zwracam uwagę: je nie WIERZĘ, ja WIEM. Ale kto jest w stanie dostrzec różnicę? Ten w sklepie? - raczej nie.\nPowiecie - ten w sklepie to prymityw. Ale mam okazję dyskutować z 40 latkami po ekskluzywnych uczelniach. Na topowych \"managerskich\" stanowiskach. Dla nich jestem głupkiem, który nic nie wie. Oni dla mnie, niestety, też. Czy macie jakieś własne opinie na podobne tematy?",
				"added": 1609784511
			},
			{
				"comment_id": 49,
				"body": "1. katar. Masz katar? - proponuję potraktować to, jako najwyższe zagrożenie. Twój układ odpornościowy jest niewydolny. Zdrowy człowiek nie miewa katarów.\n2. IQ? Ja miałem na myśli (kilka \"pięter\" niżej dyskusje z ludźmi mającymi bardzo wysoki IQ. Święcie wierzą we współczesną medycynę, w C19 i wszystko, co jest z tym związane. Taki człowiek, przy tym człowiek tzw. sukcesu uważa, że we wszystkim ma rację i po prostu nie przyjmuje żadnych argumentów. Dominacja lewej półkuli nie przeszkadza mieć wysokie IQ, a może nawet ułatwia - bo kto tworzy takie testy?\n\nA więc musi być coś innego, co pozwala ludziom odróżniać prawdę o fałszu.  \n\n3. Czy włączymy w tę dyskusję hipotezę: wirusy nie istnieją? Nie do przeskoczenia dla większości lekarzy... Określenie \"dla większości\" oznacza, że są tacy lekarze, którzy to zrozumieją.",
				"added": 1609800876
			},
			{
				"comment_id": 50,
				"body": "Zdrowy - wydaje mi się najlepszym określeniem. Odporny na infekcje to tylko podzbiór. Dla mnie zdrowy organizm to taki, który ma stabilną homeostazę i duże zapasy na różne nieoczekiwane tryby awaryjne. A więc odporny na zakażenia bakteryjne, odporny na zimno, odporny na promieniowanie (w tym - poparzenia słoneczne), szybko leczy rany, odporny na uszkodzenia ścięgien (nie rwie sobie wiązadeł kolanowych na nartach), na złamania (w poważniejszych wypadkach), a ewentualne złamania leczy sobie nie 6 tygodni, a np. 6 dni (a może krócej?), odporny na głód i trucizny - i co tam jeszcze może nas dotknąć ze strony środowiska. \nJeśli 40 latek przy zwykłym upadku łamie sobie obojczyk, to powinno być dla niego ostrzeżenie o najwyższym stanie zagrożenia. Nie jest zdrowy, w sensie przytoczonym wyżej.\n\nIntuicja? - a w czym moja intuicja (obiektywnie) jest lepsza od \"intuicji\" tej drugiej strony? Nie mówię o kłamcy, tylko człowieku, który głęboko wierzy w to, co mówi. \n\nWirusy - nauczyliśmy się traktować je jako patogeny, a więc coś, co szkodzi. A tymczasem coraz więcej doniesień naukowych wskazuje na to, że ich rola jest zupełnie inna. Że przypisywanie im roli chorobotwórczej jest pomyleniem skutku z przyczyną. A więc, jak powiedział efi3, walka z nimi to strzał w kolano. Słowo wirus samo w sobie niesie dzisiaj informację: \"patogen\". Może więc trzeba je zastąpić innym określeniem. Na razie mamy: egzosom, pęcherzyk informacyjny (dotyczy tzw. \"wirusów otoczkowych\").\n\nDużo mamy takich strzałów: walka z cholesterolem, \"leczenie\" cukrzycy insuliną, \"leczenie\" antybiotykami, \"leczenie\" nadciśnienia, powszechne metody \"leczenia\" nowotworów ... Dużo wskazuje na to, że cała współczesna medycyna jest oparta na takich \"nieporozumieniach\". Nie jest do końca jasne: celowych, dla uszkadzania ludzi (depopulacji), celowych, dla ściągania pieniędzy, czy z głupoty? Prawdopodobnie wszystkie trzy, zależnie od poziomu podejmowania decyzji. \nTe uwagi nie dotyczą medycyny ratunkowej, która potrafi dzisiaj zdziałać cuda, np. poskładać \"połamańca\". Chociaż mogłaby to robić dużo lepiej, przy pełniejszym wykorzystaniu dostępnej wiedzy biologii i nauk medycznych. Nie trochę lepiej - DUŻO lepiej, DUŻO szybciej, DUŻO skuteczniej. To ostanie dotyczy kategorii: życie - śmierć - kalectwo.\nPanowie, ja w tym SIEDZĘ, dlatego uważam, że wiem, co mówię. To nie są jakieś moje wyobrażenia. Mam wyjaśnienia każdego poruszonego zagadnienia.",
				"added": 1609831608
			}
		],
		"1606360383_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 46,
				"body": "Proponuję posłuchać, co jeszcze na temat tej szcz... na C19 powie dzisiaj Jerzy Zięba, o 21...\nZapowiada, że ma nowe informacje, jeszcze gorsze niż to, co wiemy do tej pory. Wiemy? - chyba nie wszyscy, jeśli ktoś tu chce skorzystać z tej \"szansy\". \nA ten udział \"celebrytów\" w tym \"zachęcaniu\" jest po prostu prymitywnie żenujący. Czy naprawdę ktoś się na to złapie?",
				"added": 1609699626
			}
		],
		"1609762064_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 53,
				"body": "Próba odpowiedzi na pytanie: Jak chcesz korespondować z nieznaną Osobą, szyfrując wiadomości do Niej ??? Nie używając przy tym , - POŚREDNIKA-?\n\"Bawiłem\" się tym do 2000 roku. Potem rozwiało się, bo nie było chętnych. PGP, potem GPG. Sam tworzysz klucz prywatny i tylko Ty jesteś jego właścicielem. Udostępniasz wszystkim Twój klucz publiczny. Był cały system potwierdzania wiarygodności kluczy publicznych. Przy długim kluczu masz dużą pewność, że nikt po drodze nie przeczytał korespondencji i nikt jej nie zmienił. Oczywiście, że wszystko można złamać, ale nie za darmo. Czy dostęp do Twojej korespondencji jest warty poświęcenia określonej (prawdopodobnie dużej sumy? (np. koszt pracy jakiegoś \"superkomputera\". Budżety podglądaczy nie są przecież nieograniczone.\nDzisiaj powszechnie są dostępne tego typu programy, tzn. z kluczem prywatnym i publicznym. Ale twój klucz prywatny ktoś tworzy za Ciebie (dla ułatwienia?)... Poziom zaufania zdecydowanie spada.",
				"added": 1609839254
			},
			{
				"comment_id": 55,
				"body": "Szyfrować i odszyfrowywać wiadomości można na komputerze, który nie jest podłączony do internetu. Który nie jest fizycznie (lokalną siecią) połączony z tym, który wysyła i odbiera. Para kluczy wygenerowana i klucz prywatny tylko w komputerze całkowicie odizolowanym od sieci. Kod programu przeglądany przez setki (tysiące?) niezależnych, najlepszych programistów. Może właśnie dlatego PGP a potem GPG były tak bardzo \"niepromowane\" w tamtych czasach, kiedy się tym \"bawiłem\"? Może ktoś z Was wie, co dzisiaj się z tym dzieje? Też poszukam w wolnej chwili.",
				"added": 1609921263
			},
			{
				"comment_id": 56,
				"body": "Tak na szybko znalazłem małe podsumowanie wiedzy na temat PGP - GPG. Chyba sprzed 10 lat, ale wygląda na całkowicie zgodne z tym, co pamiętam sprzed 20 lat.\nhttps://osworld.pl/pgp-gpg-bezpieczne-szyfrowanie-dla-kazdego/\nA jak to wygląda dzisiaj? Czy jest coś lepszego? W informatyce 10 lat to kupa czasu...",
				"added": 1609924063
			},
			{
				"comment_id": 58,
				"body": "Na razie nie bardzo mam czas na powrót do tematu, ale mam pamięć. 20 lat temu było to bardzo proste w obsłudze.\nZaszyfrowane teksty można wysyłać jako załączniki.\nChyba każdy klient e-mail, na wszystkie dostępne wtedy systemy, miał odpowiednią wtyczkę, do bezpośredniego korzystania - ale tu pojawia się poruszony przez efi3 problem \"drzwi z tektury\" z mocnymi zamkami. W każdym systemie można było używać wiersza poleceń na konsoli albo nakładki graficznej. Fajnie i bezproblemowo działał system weryfikacji kluczy prywatnych (podpisywania ich). \n\nPodstawową różnicą funkcjonalną (dla mnie), nie wchodząc w szczegóły dotyczące jakości stosowanych algorytmów szyfrujących i długości kluczy jest to, kto generuje parę kluczy i kto jest posiadaczem klucza prywatnego.  W GPG mogłem to sobie zapewnić. Tylko ja miałem mój klucz prywatny.\nJuż wtedy mówiło się, że można złamać system, ale tylko pod warunkiem dostępu do klucza prywatnego.",
				"added": 1610005294
			}
		],
		"1609436911_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 54,
				"body": "Życzę Wam wszystkim, aby udało się nam wykreować taką przyszłość, jakiej najbardziej pragniemy dla nas. przy okazji - szczególne podziękowania driudowi za wkład w utrzymanie tej sieci i wnikliwe analizy oglądanej rzeczywistości. Cieszę się, że mogłem Was tu spotkać. Każdy jest inny, ale idziemy w tym samym kierunku. Wszystkiego najlepszego.",
				"added": 1609920470
			}
		],
		"1610376246_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 59,
				"body": "U mnie otwiera się normalnie. Grzegorz Braun.",
				"added": 1610443907
			},
			{
				"comment_id": 60,
				"body": "Tytuł:\nNowy Porządek Świata. Horror, który czeka ludzkość\nArtykuł z 2009\nBraun mówi, że wisiało to długo na Onecie",
				"added": 1610444040
			},
			{
				"comment_id": 61,
				"body": "Wtedy \"hipoteza\" - a opisuje dzisiejszą rzeczywistość",
				"added": 1610444162
			},
			{
				"comment_id": 62,
				"body": "Musiałem poczekać kilka minut, zanim coś ruszyło.\nOstatni film mam ten, który opublikował fornakter\nPoprzedni - Komentarzoapel od efi3",
				"added": 1610466324
			},
			{
				"comment_id": 64,
				"body": "Czy możesz sprecyzować, o jaki film chodzi? Jeden, który wrzuciłem (chyba) wczoraj, właśnie usunąłem i spróbuję jeszcze raz.",
				"added": 1610644963
			},
			{
				"comment_id": 75,
				"body": "Dotyczy:\n2021.01.20.02.[PL]-Prawo-kóre próbują łamać.\nJest dostępny, otwiera się. Za pierwszym razem odtwarzał się z przerwami. W plikach mam, że pobrany w 100% i 4 użytkowników",
				"added": 1611227478
			}
		],
		"1610039932_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 63,
				"body": "Panowie. A może trzeba na to spojrzeć jeszcze bardziej z góry? Co doprowadziło USA do takiego stanu, w jakim jest dzisiaj? Wszystkie punkty w tym artykule trafiają do mnie bez sprzeciwu. Jest jedno \"ale\". Zakładamy ciągłość historii. A coraz więcej wskazuje na to, że USA, podobnie jak cały świat, bardzo zmieniły się pod koniec 19 wieku. Czy zawsze były bandyckie i złodziejskie? Mówią, że wtedy (1871) pojawiły się frędzelki na ich fladze. Stały się korporacją. A wszystkie sygnały od Dziada, co mówią? - wszyscy go znają? To mniej więcej wtedy wyginęła rządząca \"rasa\" z prostymi nosami. I wiele innych ciekawych ciekawostek. Czy na pewno wiemy, co było wcześniej? I u nich i u nas? Czy nie byliśmy jedną wspólną cywilizacją, którą wtedy właśnie spacyfikowali Anglicy, z czyjąś wydatną pomocą? Pamiętacie tę rosyjską bajkę - kreskówkę, która pojawiła się z rok temu? O gadach, które \"zaatakowały\" Ziemię, dogadały się z Anglikami na rządzenie światem i o \"pięknej\", która pociągnęła za sobą ludzi i wyzwoliła świat? Pamiętam tę bajkę i ciągle jakby wszystko się sprawdza. A to, co się teraz dzieje, zostało precyzyjnie ogłoszone z 10 lat temu. Nawet nasz \"poczciwy\" Onet pisał o tym w 2009 roku. Było na tym forum. A więc ciągle mamy realizację planu. Czy wszyscy oglądali \"Upadek Kabały? Dlaczego to wszystko tak się sprawdza? Osobiście, od 15 mniej więcej lat jestem ćwiczony w zmaganiu się z przewrotną logiką, która zamienia skutek z przyczyną. Na wielu polach. A może właśnie wtedy zacząłem zauważać tę przewrotność? Co mi to dało? - może nabrałem wprawy? a może \"pole morficzne\" coś podpowiada? Dlaczego we wszystkich przekazach od razu widać, co jest manipulacją, a co prawdą? Od razu widać, co jest prowokacją, a co normalnym działaniem? No dobrze, ale dlaczego większość daje się na to nabrać? Dlaczego większość posługuje się jednopoziomową logiką? Matrix - blokada - pranie mózgu?\nMedycyna jest bardzo dobrym przykładem. Zakłamanie doszło do takiego poziomu, że coś musi walnąć. A jak walnie, to kto się z tego pozbiera? Co to znaczy \"walnie\"... Czy potraficie wyobrazić sobie, że za 20 lat połowa dzieci będzie miała autyzm? To oznacza całkowity koniec cywilizacji. Siedzę w tej medycynie (zawodowo) od lat i widzę narastanie absurdów, takich jak ten przytoczony. Wszystko to pokazuje niechybny koniec dzisiejszej medycyny, albo zniszczenie ludzkości. Szansę na przetrwanie ma tylko ten, kto ma wiedzę. Bezwzględne dążenie do zysku oczywiście przyczyniło się do takiego stanu, ale dzisiaj coraz bardziej jestem przekonany, że to też jest częścią wielkiego planu. Aż poraża ta skala... \n\nTak, trzeba na wszelki wypadek robić zapasy, albo nauczyć się nie jeść. Ja wolę to drugie :-) Przy okazji może być początkiem drogi uzdrawiania świata. \n\nJak myślicie, czy wolne, nieskorumpowane Stany (bo dzisiaj są skorumpowane - do granic obrzydliwości) będą dalej stanowiły zagrożenie dla świata? - pod warunkiem, że to się uda, co chcemy, aby się stało. A co może znaczyć określenie \"mocne\"? Przez ostatnich wiele lat to był bandyta, narzucający swoją wolę innym. Ale przecież nie z woli tych normalnych ludzi. \nA może \"mocne\" = gotowe wyciągnąć pomocną rękę?",
				"added": 1610639647
			}
		],
		"1610822859_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 65,
				"body": "oglądałeś \"serial\" Upadek Kabały? - wydaje mi się, że bardzo wiele tłumaczy. Relatywnie stary film o przyszłości, która stała się teraźniejszością.",
				"added": 1610832678
			},
			{
				"comment_id": 66,
				"body": "Np. tu\nhttps://www.cda.pl/video/5088131ad",
				"added": 1610832817
			},
			{
				"comment_id": 68,
				"body": "Dalej uważam, że bez obejrzenia \"Upadku kabały\" nie da się rozumieć aktualnych wydarzeń. Przekazy Hanny rzeczywiście wyglądają na oparte na najlepszych źródłach. Ostatnio pokazały się inne ciekawe doniesienia, jak np. to \nhttps://www.youtube.com/watch?v=2ZCUa9D3wfA",
				"added": 1610872061
			},
			{
				"comment_id": 69,
				"body": "Dla tych, którzy nie mają dostępu do starego YT, publikowałem na YT PL dzisiejszy filmik Hanny Kazahari, na temat  aktualnych wydarzeń w USA i na świecie\nhttp://127.0.0.1:43110/15Lr9YZ4DC9ZF2BSwZc7S1wDr9hTDx9w5h/?watch=1610897036_18pL2XYAH4CcNJpsRiwBPh1HkyG9m3iGW7",
				"added": 1610897469
			},
			{
				"comment_id": 70,
				"body": "Co mogę zrobić, aby pojawił się ten \"ślad\"? Rozumiem, że problemem jest wersja Zero, jak to było opisywane. Czy należy to rozumieć jako \"sabotaż\"? - czyli: mając wersję Zero, jaką mam, jestem pozbawiony możliwości publikowania filmów?",
				"added": 1610909199
			},
			{
				"comment_id": 71,
				"body": "Hm.... pisać, nie pisać... Nawiązując do myśli przewodniej... Co mi wychodzi z lektury różnych materiałów, jako najbardziej prawdopodobne, nie twierdzę, że to są moje poglądy. To tylko analizy teoretyczne. Różne źródła, w zasadzie zgodne ze sobą sugerują, że pod koniec 19 wieku nastąpił jakiś ogólnoświatowy \"reset\", w wyniku którego tzw. Anglicy, przy pomocy sił chyba \"nadprzyrodzonych\", uzyskali dominację nad światem i napisali nową historię świata. Spychając w cień osiągnięcia istniejącej wcześniej ogólnoświatowej cywilizacji, które dzisiaj są odkrywane jako zadziwiające artefakty. Ta \"pomoc\" jest jakoś powiązana z siłami zła (tzw. Czarnogłowi?), które od dawna dążą do dominacji nad światem. Nie \"spodobało się\" to grupie wysoko postawionych wojskowych z USA, a może nie tylko. Zaczęli \"knuć\", jak się wyzwolić spod tej dominacji. Obie strony tworzyły swoje plany. Z jednej strony siły zła chcą wziąć cały świat za mordę i pławić się w najgorszych do wyobrażenia \"obrzędach\", które dają im siłę dzięki ogromnemu cierpieniu innych. Wchodzą w to modry rytualne i gwałcenie noworodków i małych dzieci, pozyskiwanie adrenochromu itp. Z drugiej strony, grupa ludzi chce się przeciwstawić. Za naszych czasów doszło do kulminacji tego procesu, na zasadzie: albo albo. Bo zaczęła budzić się ogólnoświatowa świadomość ludzi i to ostatni moment, aby wziąć świat za mordę. Albo ta świadomość zwycięży, albo zostanie stłamszona na zawsze.\nTe siły dobra znalazły Trumpa i poprosiły go, aby był ich \"twarzą\". Zadziwiające jest, jak on dzisiaj \"podpuszcza\" tę drugą stronę, na zasadzie: przestępstwo staje się przestępstwem dopiero wtedy, kiedy zostanie dokonane. Te siły (podobno) mają do dyspozycji dużo dowodów na przestępczą działalność tej drugiej strony. Druga strona szarpie się (drapieżnik zapędzony w ślepy zaułek) i próbuje zniszczyć Trumpa, aby nie wyszło na jaw to, co wie o nich grupa, której on jest twarzą. Dlatego wyłączają mu konta w mediach społecznościowych. Dlatego rozpaczliwie próbują wyeliminować go z życia politycznego. Jak dotąd ci źli zachowują się jak dzieci z przedszkola. Za każdym razem dają się wpuszczać. Przyznam, że przyglądam się temu z podziwem. Sztuka wojenna Sun Zi na najwyższym poziomie. Wygląd to jak porównanie logiki jedno poziomowej z logiką np. 5 poziomową.\nTo, o czym napisałem, to oczywiście duże uproszczenie i nie twierdzę, że na pewno dobrze interpretuję docierające informacje. Jeśli się mylę, to prawdopodobnie nas wszystkich zgnoją.\nJeśli dobro wygra w skali świata, to \"pejsaci\" raczej odejdą. \"Koniokradów\" też już chyba nie będzie. Co znaczy \"odejdą\"? - to sformułowanie wzięte z Raportów energetycznych Anny Architektury. Ostatnio coraz lepiej to rozumiem. Patrzę, jak odchodzą ludzie z bliskiego otoczenia, z rodziny. Najnowszy przypadek - dzisiaj rano. Dlaczego nie pomogłem, skoro \"tyle\" wiem? - nie chcieli, nie rozumieli... :-( .  Wg. Anny Architektury - wybrali przestrzeń 3D. \nPrzyznam, że \"coś\" mnie zmusiło do napisania tego",
				"added": 1610919162
			},
			{
				"comment_id": 72,
				"body": "Z dyskusji z różnymi ludźmi wynika, że bez takiego założenia, zachowanie Trumpa może sugerować, że to ktoś nie do końca normalny, że mu odbiło, wręcz że to niebezpieczny szaleniec. Tak właśnie jest odbierany przez wielu i taki wizerunek chcą wykorzystać jego przeciwnicy.  Dlaczego pozwolił sobie na utworzenie takiego wizerunku? - aby zmylić przeciwnika? - że z głupkiem łatwo sobie poradzą? To jest dobry przykład tego, jak argumentacja zależy od przestrzeni informacyjnej, w której jest dokonywana. Podobnie wielu ludzi wierzy, że szczepienia na C19 ich ochronią, a wierzą, bo nie mają wiedzy. Brakuje im tego dodatkowego wymiaru, spojrzenia na problem z góry (umownej).\nWracając do Trumpa. Przy takim przyjętym założeniu, jak w komentarzu niżej, wszystkie klocki układanki zaczynają do siebie pasować. Bez tego, potrzebne są jakieś łamańce logiczne, aby wyjaśnić sobie, o co tu może chodzić. Oczywiście, że poruszone wątki można rozwijać i dodać do tego jeszcze inne, ale miało być prosto: same podstawy. Co ciekawe, jak dotąd wszystkie dodatkowe wątki, ich rozwinięcia i powiązane argumentacje pasują do tego podstawowego obrazu. Bez tego - wyglądają na jakiś chaos. \nMożna próbować wprowadzić jeszcze kolejne wymiary do analizy tego problemu. Dla mnie relatywnie słabym punktem tej układanki są te gubione/kradzione laptopy/dyski z obciążającymi dowodami. Jakby celowo zaplanowane zwroty akcji. Jakim cudem ludzie mają w swoich komputerach takie rzeczy? Powszechna ignorancja? I zadziwiająca jest rola \"narratora\" tego \"filmu\", który się przed nami rozgrywa, czyli tzw. Q.",
				"added": 1610943215
			},
			{
				"comment_id": 74,
				"body": "Konkurencja oszukiwała i oszukuje dalej. Problemem jest, kiedy ludzie to zauważą, a więc obudzą się. A może takim \"budzikiem\" będzie dopiero rosnąca lawinowo liczba powikłań po zastrzykach C19? Np. za 2-3 lata masowa liczba  przypadków zwłóknienia płuc.  Zmiana na lepsze może być możliwa dopiero wtedy, kiedy większość zaakceptuje jej potrzebę. Będzie żądać tej zmiany. Zaglądam do FoxNews i widzę coś w rodzaju: nowa administracja chce, aby 75 mln amerykanów, którzy głosowali na Trumpa, zostało oflagowanych jako terroryści przeznaczeni do \"utylizacji\". To tylko przykład nowego sposobu przedstawiania rzeczywistości, bo takich \"kwiatków\" widzę więcej. W tym czasie CNN i podobne wychwalają pod niebiosa nową rzeczywistość. Mamy więc dysonans poznawczy. Ciągle mało, aby obudzić ludzi? Siły zła mają ogromną moc i możliwości, aby pacyfikować świat, ale pod warunkiem, że ten świat im na to pozwala. Jeśli ogół na to pozwala, to mogą pokonać siłowo każdy bunt. Jeśli z tym buntem nie będzie utożsamiać się dostatecznie duża większość (niekoniecznie liczbowo większa).\nW którejś dyskusji przewinął się wątek dostępu do najnowszych technologii. Dostęp - oznacza dostęp ludzi. Po mojemu w każdej grupie ludzi mogą być dwie strony. Skoro był zamach na Melanię ze strony najbliższego otoczenia. A więc dostęp do technologii \"technicznych\" raczej chyba jest. Gorzej z możliwościami wykorzystania na masową skalę, bo do tego prawdopodobnie potrzebne są jakieś \"fabryki\". Czy to tylko kwestia nazewnictwa: dostęp a możliwość wykorzystania? A może ten \"dostęp\" oznacza możliwość korzystania z możliwości tzw. komputerów kwantowych, które podobno nie istnieją? Nowa technologia to może być również np. możliwość wykorzystania siły i możliwości pola morfogenetycznego, nie tylko nowe generatory fal, plazmy czy pól torsyjnych.   \n\nPo mojemu to, co się dzieje, to już nie jest polityka, w której analizuje się różne niuanse. Tu chodzi o odróżnienie dobra od zła. Określenie podstaw, a reszta to są już mniej istotne szczegóły. Czyli: nie interesuje mnie, kto zarządza firmą i szczegóły tego zarządzania, jeśli robi to dobrze (np. zgodnie z prawem naturalnym).",
				"added": 1611214143
			},
			{
				"comment_id": 77,
				"body": "Rumble... Anna Kazahari tam właśnie opublikowała swój film. Wcześniej nie wiedziałem, że coś takiego istnieje. Podchodzę do tego tak: ona ma dostęp do wiedzy z samej góry. To ona wybrała ten kanał. Tu chyba niczego nie trzeba instalować? - tylko korzystać",
				"added": 1611514503
			}
		],
		"1610658422_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 67,
				"body": "Mnie zastanowiły inne fragmenty. Czy patrioci dysponują gorszą technologią, niż BigTech? A poza tym... zdecydowanie wolałbym współpracować ze wszystkimi, niż walczyć z kimś/czymś. A może lepiej wyeliminować to ZŁO? Może spróbujmy wykreować taką rzeczywistość, w której go NIE MA?",
				"added": 1610839063
			}
		],
		"1610847501_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 73,
				"body": "Szczerze mówiąc, określenie \"drukowanie pieniędzy\" potraktowałem, jako tworzenie pieniędzy z powietrza właśnie (przez kogoś), a nie rzeczywiste drukowanie ich przez nasz rząd. A więc - skrót myślowy. Użyty zresztą w omawianym artykule. Myślę, że Sebastian o tym wie, a pani prowadząca faktycznie nie ma pojęcia.",
				"added": 1611051700
			}
		],
		"1611351944_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 76,
				"body": "Wszystko się zgadza i jest potwierdzane w różnych innych źródłach. I na \"wyczucie\". Jedyne, co bym poprawił, to określenie \"chemiczne\" zamieniłbym na \"biochemiczne\".\nA więc określone \"siły\" chcą nas wytępić, między innymi dlatego, że ich zdaniem jest nas za dużo. Ale wg. informacji przekazanych ostatnio przez Dziada, przed ostatnim wielkim resetem pod koniec 19 wieku było nas na ziemi kilka razy więcej. I (chyba) nie było to uciążliwe na co dzień. Chyba, że coś źle usłyszałem...",
				"added": 1611432039
			}
		]
	},
	"comment_vote": {}
}