{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1565256550,
			"title": "What features do you think ZeroTalk lacks?",
			"body": "Hello. \n\nI want to make an improved ZeroTalk-like decentralized discussion app. I have some experience developing ZeroNet apps but need your input on what people actually need. What features do you think need to be added to ZeroTalk? \n\nThis is what I came up with so far:\n\n* Ability to attach files to messages. No auto-displayed image thumbnails: we don't want any files downloaded automatically when you load a page. File download can be a security risk and should be performed after user's explicit permission to do so. There is no need for an imageboard format to discuss things, imageboards were made to share images.\n* \"Super seeder\" peers that always download and seed all \"optional\" uploaded files so that we won't have the situation where someone posted a file and then went offline, making the file inaccessible. This can be done very simply by setting up a server with ZN running 24/7. \n* Ability for users to create their own \"boards\" and manage them. This should be done using MergerSites feature, like \"user hubs\" on ZeroMe work. In this way user-created boards are basically their own sites that they can moderate. This further contributes to decentralization and removing the single point of failure that a \"main\" site owner can be.\n* Private messages. Yes I know ZeroMail exists, but a feature-rich discussion software should have the basic ability to privately message someone.\n* Ability to post anonymously, like on 0chan and Millchan (locally generated identities without the need of zeroid)\n* Numerous quality-of-life improvements of UI, including but not limited to: catalog view, various sorting options for topics and comments, etc \n* Transparency: interface to see information about a user's identity that is publicly available from his user data (i.e. post history). Anyone with some basic tech skills can look this up already, so there is no reason not to make it available to people who are not tech-savvy.\n",
			"added": 1565256549
		}
	],
	"topic_vote": {
		"1565139032_1Bgm4LkHQ6dvAkh8XBNuWDqKa5czmosBNH": 1,
		"1565197761_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1565142042_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": 1,
		"1565132888_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565237461_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565261539_19P54y9K3sV4nbe7Cm3yCZfuwxzckti8C1": 1,
		"1565288290_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1565305639_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1565493657_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565874585_17zkACeRCDqPEswrUFFZxJf3NuwtskPrzR": 1
	},
	"next_comment_id": 51,
	"comment": {
		"1565185775_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": [
			{
				"comment_id": 1,
				"body": "> [fantoski](#comment_69_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3):  just mute the user ID of the creator of the board, that should delete the content. [...]\n\nThat's not how it works.",
				"added": 1565189855
			},
			{
				"comment_id": 5,
				"body": "> [styromaniac](#comment_871_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You're horribly misinforming people here. Files have to be manually deleted. 08chan runs on outdated Millchan code.\n\nEven the up-to-date Millchan code still leaves muted users data on your hard drive.",
				"added": 1565191462
			},
			{
				"comment_id": 6,
				"body": "> [styromaniac](#comment_872_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): No. Just hovering a board name or link downloads thumbnails. This is why Millchan ended up on my blocklist and so did 08chan. Nekololi reported an unwanted thumbnail of CP downloading just by hovering with the cursor by accident.\n\nThis is why thumbnails should not be displayed by default. We need something like ZeroTalk which is focused on text but also with the ability to attach files, create and manage your own board, in-built private messaging (like zeromail) etc",
				"added": 1565191655
			},
			{
				"comment_id": 7,
				"body": "> [styromaniac](#comment_873_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Yes, optional files downloaded at explicit user request is best.\n\nI made 0chan a few years ago. I abandoned it precisely because of security concerns like that one. Now I'm thinking of doing something new. Like ZeroTalk+ZeroMail on steroids, focused on security and usability.",
				"added": 1565191900
			},
			{
				"comment_id": 8,
				"body": "> [styromaniac](#comment_874_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Now that you mention it, I think 0chan should be on MOAB. [...]\n\nI'm afraid I don't know what MOAB means. \n\nZeroMe is good in their approach to \"user hubs\". They are basically separate Zites that can be managed by their respective owners. This functionality can be used to allow people to create and manage their own boards. In fact, Millchan is currently developing that feature, as far as I know. \n\nBut yes. My biggest concern about ZeroNet is how easy it is to break/disrupt its apps. Even if you somehow figure out a way to minimize the chance of unwillingly getting CP bombed, you still are not protected against disruptive spam / wipe. It's very easy to write a script that will generate and distribute thousands/millions of posts that will clutter up the board and prevent you from communicating normally. \n\nI believe addressing these issues is key to developing a secure and reliable ZeroNet communications app.",
				"added": 1565192769
			},
			{
				"comment_id": 11,
				"body": "> [mfs](#comment_2_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W): I posted a graphic to one of the boards and the ZN app told me it was sending that graphic to 5 peers. Those peers now have the graphic on their machines and they never clicked on it.\n\nThat's not how it works. All known imageboards use optional files. ZN app told you it sent update to your JSON data file. The actual files are not posted by default, they are only downloaded from your machine when someone views them.",
				"added": 1565194032
			},
			{
				"comment_id": 12,
				"body": "> [anshorei](#comment_5_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): @styromaniac: I doubt it downloads thumbs hovering over boards, don't you mean hovering over threads in the recent threads list? You can disable this behavior in the settings (which should probably be default) [...]\n\nLink to MOAB please. I've been away for 2 years and need to catch up to recent developments.",
				"added": 1565194062
			},
			{
				"comment_id": 13,
				"body": "> [mfs](#comment_3_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W): But if I go offline my graphics have to be posted somewhere else in order to be available right?\n\nThat's why you sometimes see image thumbnails that just won't load however long you wait for them. Because there is no one around to seed them. If you \"post\" a file to an imageboard and then go offline immediately, that file will not be available to anyone.\n\nThat said, ZN users also have the ability to enable super-seeder mode, where they automatically download and seed all \"optional\" files such as file uploads to imageboards.",
				"added": 1565194301
			},
			{
				"comment_id": 14,
				"body": "> [mfs](#comment_4_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W): @theosis and @anshorei: [...]\n\nNo problem, feel free to message me on ZeroMail if you need something else.",
				"added": 1565194673
			},
			{
				"comment_id": 16,
				"body": "> [unconqueredsun](#comment_1_1AbcdjqfVPUHJsKbvTjzCJJ5isjs7wRZxk): None of the \"just delete everything\" solutions are acceptable and thus far they seem the only way. I agree that text-only places are way of the future. I'm interested in illgal opinions, not illegal graphics. Does anyone know of any text-only platforms/forum that can be hosted on ZN? I'm interested in creating such a place. What I'm worried is that even though you won't host images, you can still host LINKS to illegal graphics, which is just as bad. Is hosting illegal content an inherent problem in the system?\n\nLinks to illegal shit is not as bad as actually downloading said illegal shit on your machine because you visit an imageboard thread with a thumbnail. \n\nI believe that we still should have the possibility of sharing files, even pictures, just without the auto-download which cna get you in trouble.",
				"added": 1565202997
			},
			{
				"comment_id": 17,
				"body": "I believe we need some kind of a forum which is mostly text-based but with ability to attach files to messages. Let's all remember that imageboard software was designed specifically to share images. What we currently face is a censorship of ideas, not images. So it's only logical that a decentralized solution to modern censorship would be designed for discussions first and foremost. But sometimes images and other attached files can support discussion, so there is no reason to remove the ability to post them. We just don't need anything auto-downloaded (as is the case with image thumbnails right now on existing imageboard engines). \n\nWhat I think would work is something like ZeroTalk, but with addition of following features:\n* file attachments (optional and with explicit warnings when you click download button)\n* private messaging (ZeroMail exists but it would be good to have that functionality embedded into discussion software)\n* the ability to create your own \"board\" of discussion and moderate it to your liking",
				"added": 1565203407
			}
		],
		"1565188740_1JpWZr3hPmL8cYSKQCzuqUyhG25UuQsjPh": [
			{
				"comment_id": 2,
				"body": "I'm completely convinced that most of the 8ch refugees will fuck right back off to 8ch.net once it's on clearnet again.",
				"added": 1565190124
			},
			{
				"comment_id": 4,
				"body": "> [unadu](#comment_1_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W):\n\nZeroNet is not an anonymity software, it's a p2p web-app platform. Complete privacy is not implied. If you care about privacy you should know your opsec already.",
				"added": 1565190895
			},
			{
				"comment_id": 9,
				"body": "> [zerodud](#comment_2_1NFJShBdHywQbAzqKUVzAv4Qekh1BkXRR9): Devs need to make proper replacements for services like youtube/twitter/reddit if they want this to really take off with normies, right now the chan site is too feature basic, \"youtube\" Zite doesn't work at all, the Voat Zite is shit and i don't even know if there is a twitter replacement.\n\nDo you really think that there is a need for people who use youtube/twitter/reddit?",
				"added": 1565193428
			},
			{
				"comment_id": 10,
				"body": "> [zerodud](#comment_3_1NFJShBdHywQbAzqKUVzAv4Qekh1BkXRR9): Yes, thats the whole point, to replace the mainstream sites that have gone full orwellian censorship, if you want ZeroNet to take off, thats what you need to do, if not, it will stay your little tree house club forever and it will never achieve its ojbective of true freedom in the web.\n\nI was completely satisfied with the Internet when it was my little tree house club in the 90s. Everything went to shit once corporations brought millions of people in who only care about menial shit like social networks and cat videos.\n\nAnyway, due to the nature of p2p platforms it won't be easy to replicate huge centralized behemoths like Youtube and Facebook.  ZeroNet is a good step in that direction but that won't be it. ",
				"added": 1565193775
			},
			{
				"comment_id": 18,
				"body": "> [aim64c](#comment_4_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): I know, right.  Those deplorable, backward degenerates should just be the labor for our properly cultured and elite society.  Or, better yet... just dead or dying...... Sometimes, the more things change, the more they stay the same, am I right?\n\nI don't want to sound as elitist. More like a defeatist. Common sense says that the majority of people don't care about this stuff. And they won't magically start caring about it en masse. P2P networks and other decentralized cryptoanarchist tech will always be a \"tree house club\" of dissidents. The important thing is for us to have that ability to communicate at all, for those who need it. Because corporations will no doubt do everything in their power to suppress all dissenting opinions on the internet. Successful competition with Facebook and Youtube may come as a byproduct of that goal, if and when we reach critical mass of developers and enthusiasts so that p2p tech will grow.\n\nPersonally I think it is crucial to support decentralization because freedom of speech is an ideal worth following. Political differences should be set aside, because without free speech there is no politics, only tyranny.",
				"added": 1565203852
			}
		],
		"1565139032_1Bgm4LkHQ6dvAkh8XBNuWDqKa5czmosBNH": [
			{
				"comment_id": 3,
				"body": "Former 0chan dev here. The site is now restored to how it's been since before I put a redirect to Millchan. \n\nI abandoned the site due to lack of free time and motivation. Now with the centralized censorship machine of 2019 I am getting my motivation back. I have the necessary skillset for making decentralized means of communication. In our current circumstances inaction is a choice I can't afford to make. \n\nI'm thinking of making something new. Not necessarily an \"image\" board, since pictures (specifically, their thumnails which are traditionally always displayed on an imageboard) are the highest security risk right now (CP bombing). \n\nCurrently I'm just looking around and thinking of what features ZeroNet users (and future newcomers). Maybe I'll get some ideas on how to improve Millchan's security and reliability and join its development. Maybe I'll do something new.",
				"added": 1565190786
			}
		],
		"1565197963_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": [
			{
				"comment_id": 15,
				"body": "I have 10/16.",
				"added": 1565198142
			}
		],
		"1565204231_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o": [
			{
				"comment_id": 19,
				"body": "I guess you'll find that out when you die.",
				"added": 1565204296
			}
		],
		"1565251237_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 20,
				"body": "Assuming emotion behind someone's words is an ad hominem.",
				"added": 1565254207
			},
			{
				"comment_id": 22,
				"body": "> [anonkraut](#comment_8_1JpWZr3hPmL8cYSKQCzuqUyhG25UuQsjPh): Communism owes me 20 years of my life because I've been there (unlike most of the  people glorifying it nowadays).\n\nCommunism murdered our royal family and took over our country for 100 years. I understand what you're talking about.",
				"added": 1565255364
			}
		],
		"1516098717_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 21,
				"body": "If you don't use it, you won't lose it. I paid a very small amount of money (don't remember how much exactly, less than 5$ probably) for 0chan.bit domain in 2015 or 2016, it still exists to this day.",
				"added": 1565255240
			}
		],
		"1565140432_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": [
			{
				"comment_id": 23,
				"body": "Which government?",
				"added": 1565256796
			}
		],
		"1565256550_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": [
			{
				"comment_id": 24,
				"body": "> [bober](#comment_29_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6): sort messages from oldest to newest (like other boards) so that old messages appear on top and newer are at the bottom.\n\nThis is easy and definitely should be done. Things like that I didn't even consider to write since it's so obvious to you and me. But thanks for reminding anyway. I also think of it in terms of old-fashioned message board software. \n\n> [filips](#comment_131_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): It should be more decentralized than ZeroTalk. It should probably use merger sites for data and central site for UI. [...]\n\nThis is possible, but there is no guarantee that ZeroNet's dev will accept drastic changes in this app. File upload, even if done securely to avoid unintentional download, is still a big deal (think about the CP). I also think there should be an option to post anonymously (with local site-generated identity like 0chan and Millchan does). nofish may not agree with that since this app is like ZeroNet's face that newcomers see and he probably wants to keep it at least somehow civil.\n\nAlso, there are already concerns about ZeroNet being too centralized because of how many people use its \"core\" apps developed by nofish that he alone has control over.",
				"added": 1565257032
			},
			{
				"comment_id": 25,
				"body": "> [zeronetanon4](#comment_16_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v): Finer grain control over what parts of a website you want to seed.  Take 08chan for instance...  I have a lot of resources I'd like to dedicate to a select few boards, while at the same time not help host gay furry porn and whatever \"other\" stuff is posted.  I wish there was some simple automated way to support certain segments, while avoiding others.  There is an option to help seed the entire site with all future files, but it seems like you must blacklist every single board manually (out of hundreds) that you don't wish to help. [...]\n\nThis is completely true, and security and safety is my main concern about such apps. User-created boards should be opted-in, not opted-out. I already said that in the OP. Files should not be automatically downloaded. Filters should work and actually delete data from users that you decide to mute.",
				"added": 1565257384
			},
			{
				"comment_id": 26,
				"body": "> [zerowatchdog](#comment_7_1CN9rdrWkKbk8EmDSQNZZrwGmd8TvVbgjM): friend-to-friend (F2F) https://en.wikipedia.org/wiki/Friend-to-friendthis could be extended / linked to sites and auto-download / preview permissions etc.\n\nInteresting concept. Unfortunately ZeroNet still doesn't support private sites. I'm thinking maybe allow people to create encrypted topics that only people who have encryption key can view and comment to? They would have to share the key to their friends via private messaging first.",
				"added": 1565258103
			},
			{
				"comment_id": 27,
				"body": "> [filips](#comment_132_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Encryption is already supported for ZeroMail so it should probably not be hard to also support full-site encryption.\n\nClient-side encryption of user-data can be done. But you'd have to distribute encryption keys first, using some other communication method. I think there should be an option to create encrypted topics/threads which would basically be private group chats.",
				"added": 1565261237
			},
			{
				"comment_id": 28,
				"body": "> [filips](#comment_133_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): This should probably be possible without changing ZeroNet core code.\nCorrect. This can be done client-side without any need to modify ZeroNet code. \n\n> [filips](#comment_133_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): What about integration with other ZeroNet services such as Nodis Chat, ThunderWave, ZeroTalk, ZeroBlog and other?\nNot sure how that can be done. What kind of integration are you talking about? The ability of one app to interact with another is very limited on ZN. \n\n> [filips](#comment_133_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Also, what about \"central\" ZeroNet profile? Each user would have central storage for their profile which will then be used across all official and unofficial ZeroNet communication and other sites (such as that mentioned above). Here I don't mean centralized site to store all data but site completely decentralized and managed by user. This would solve many problems because even if ZeroID is same across multiple sites, actual profile data can be different so users would have to modify them multiple times.\nGood idea, but it would require other sites to implement their support for \"centralized\" profile storage. This is an interesting question but it is out of scope of what I want to do in the near future, which is a forum-like message board software.",
				"added": 1565263191
			},
			{
				"comment_id": 30,
				"body": "> [holeyhouseofair](#comment_53_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57): Hierarchical structuring of talks, a bit like how reddit has subreddits. any structure at all.\n\nThis is what I was talking about in OP: User-created and user-managed boards. Think like subreddits on Reddit or boards on 8chan: you can create them and moderate them to your liking.",
				"added": 1565264300
			},
			{
				"comment_id": 31,
				"body": "> [watteau](#comment_13_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o): I wouldn't bother unless you can guarantee the footfall to justify it.\n\nI want to build something that people will use, so I'm interested in ideas.",
				"added": 1565267402
			},
			{
				"comment_id": 33,
				"body": "> [ntp](#comment_1_185ieYf6sEZrW5juQmXsp5nfajWYTdwPaD): how about some censorship for the viewer. This thing is going to get infested by pedos and not nice people. I know you guys have good intents, but people beyond your screen not. Hence if we get some option to block an user or being able to simply use some key words to blur the comments in my end, that will be wonderful.\n\nThis is already implemented (albeit poorly) in Millchan and surely will be done on my new platform.\n\n> [zerowatchdog](#comment_9_1CN9rdrWkKbk8EmDSQNZZrwGmd8TvVbgjM): Additionally, I would like to see a user ranking based on \"likes\", posts and/or relationship (trust level). Maybe something like https://steemit.com/faq.html#Does_it_cost_anything_to_post__comment__or_vote but without crypto money. As a result it could be a kind of social self-regulated ecosystem. Limits trolls and haters, supports ZeroNet to gain value by good content.\n\nThe problem with likes on ZN is how easy they are to fake. Especially if a zite supports self-signed certificates. I can write a script to register 1000 identities and post \"likes\" to artificially enhance someone's reputation. \n\nWithout a central authority likes/upvotes/whatever are useless.",
				"added": 1565275628
			},
			{
				"comment_id": 37,
				"body": "> [jamiedemon](#comment_8_1Hbt9rJ8U9kpEFaxHAfLWzxWtKRYiEDb2G): muting anyone who have joined zn after a specific date !\n\nThere is no way to know when someone \"joined\" zn.",
				"added": 1565347655
			},
			{
				"comment_id": 38,
				"body": "> [jamiedemon](#comment_9_1Hbt9rJ8U9kpEFaxHAfLWzxWtKRYiEDb2G): yeah, but perhaps when someone registered \"joined\" on ZeroID\n\nI don't think it's possible to access ZeroID's data files from another application. Furthermore, I think that anonymous certificates should be allowed, and they can be registered any time (and it's also a good practice to change them every once in a while to avoid people tracking your post history).",
				"added": 1565348077
			}
		],
		"1565261539_19P54y9K3sV4nbe7Cm3yCZfuwxzckti8C1": [
			{
				"comment_id": 29,
				"body": "Just got back to ZN after 2 years of absence. Looking at current state of events and discussing what features people would appreciate from a forum-like message board software. \n\n> [trevorlaneray](#comment_1_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): That and playing Elite Dangerous at 04:00AM when I have to head to work nine hours from now...\n\nHow is E:D right now? I used to play it a lot when it was released.",
				"added": 1565263383
			}
		],
		"1565272923_1NFJShBdHywQbAzqKUVzAv4Qekh1BkXRR9": [
			{
				"comment_id": 32,
				"body": "Video content is the least convenient to share via ZeroNet. There are better alternatives.",
				"added": 1565273208
			}
		],
		"1565288290_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 34,
				"body": "What a joke. They should have done a bit more research before writing that.",
				"added": 1565290496
			}
		],
		"1565337741_16vtDQkRKY8atc9K3oCBTvMW1ojLLVxry5": [
			{
				"comment_id": 35,
				"body": "What exactly do you download that takes up space? My data folder takes up 400mb and I have 2tb ssd so it doesn't really matter. Who cares? Disk space is dirt cheap nowadays.",
				"added": 1565338516
			}
		],
		"1565338450_1Hbt9rJ8U9kpEFaxHAfLWzxWtKRYiEDb2G": [
			{
				"comment_id": 36,
				"body": "Cry more",
				"added": 1565338545
			}
		],
		"1565346520_1CN9rdrWkKbk8EmDSQNZZrwGmd8TvVbgjM": [
			{
				"comment_id": 39,
				"body": "60 gigabytes is a lot more disk space than most of the people running ZeroNet peers want to contribute.",
				"added": 1565348476
			}
		],
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 40,
				"body": "LMAO who cares? It isn't illegal.",
				"added": 1565359458
			},
			{
				"comment_id": 41,
				"body": "> [capitanjack](#comment_4_1DNJ1b7d7bqeZHigy35ZKBwwe8PBv8o7Gk): Type netstat and start collectingBut who cares? They are going to jail us just for speaking? Better they should try fixing their heads first :^)They are crazy more most of those 8ch anons\n\nMost of 8ch people are poltards and retarded boomers who believe in this Qanon nonsence. Not exactly the brightest when it comes to tech.",
				"added": 1565360006
			},
			{
				"comment_id": 42,
				"body": "> [trevorlaneray](#comment_11_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): Am I doing it right? >.<\n\nThe thing is, you can go ahead and use it even without Tor. If you're not doing anything illegal you have nothing to worry about. The fact that your IP is exposed to peers means nothing. They can't reliably connect your ZN identity to your peer IP. It's not illegal to run ZN software. This \"muh exposed IP\" scare is silly.",
				"added": 1565361122
			},
			{
				"comment_id": 43,
				"body": "> [trevorlaneray](#comment_17_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): Awesomesauce. I just kinda enabled it on a whim, since I was (relatively) familiar with onion routing's benefits.\n\nIf you're ok with slower speeds you can continue running it through Tor to feel more secure. But ultimately, unless you're sharing some kind of illegal content like CP, you have nothing to worry about.",
				"added": 1565361485
			},
			{
				"comment_id": 44,
				"body": "> [aspidochelone](#comment_31_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): They can certainly connect your IP to the file they are downloading from you. [...]\n\nFile downloads are a security risk, yes. So they never should be downloaded automatically, like image thumbnails on imageboards. But you should also consider that it's not so easy to link your public IP address to your real life identity. Most of us are behind IPS's NATs (we share the same IP with lots of other people).\n\n> [aim64c](#comment_17_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): No, it's just a bit of a bug on the board at the moment.  The board owner published an update after we got spammed, and it doesn't seem to work as well as he thought it did before he either went to work or to sleep.  So, it will be a bit of a hiccup.  If it's not resolved by time the weekend is over, I'll get a board going over the week.\n\nYou can head over to http://127.0.0.1:43110/0chan.bit in the meantime.",
				"added": 1565364866
			}
		],
		"1565321266_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": [
			{
				"comment_id": 45,
				"body": "This is exactly what I've been talking about. There is simply no way to have reliable protection against spam/cluttering. If your app has user-submitted content and accepts self-signed certificates, it can and will be spammed. I don't see a way to stop it.\n\nWhoever does this spam, you're a good guy. I actually hoped that this issue would have been exposed earlier. ",
				"added": 1565369677
			},
			{
				"comment_id": 47,
				"body": "> [28eb9](#comment_12_18Eg3doTf26uabVuTnryFMUk9cKEz9idu7): what about giving each newly created site its own genesis block, then drawing captchas to canvas from the last few characters of random hashes?\n\nGenerating and drawing the captcha is not a problem. What is not possible right now is validating that a user actually did solve the captcha and his content should be accepted by peers.",
				"added": 1565516981
			}
		],
		"1565095300_1PnHUGmQkYq4NKZBxFp8o1Wb1ZZijeeYvF": [
			{
				"comment_id": 46,
				"body": "I hope China just annexes Taiwan already and executes all CIA agents involved in stirring up protests.",
				"added": 1565371041
			}
		],
		"1565519074_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 48,
				"body": "doge.jpg",
				"added": 1565519848
			}
		],
		"1565493657_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 49,
				"body": "The modern liberal atheists regard cummies as their god, so even suggesting that one should practice self-restraint is heretical to them.",
				"added": 1565519999
			}
		],
		"1565868212_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 50,
				"body": "Atheists should be hanged.",
				"added": 1565873299
			}
		]
	},
	"comment_vote": {
		"126_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"368_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"874_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"6_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"876_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"230_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"2_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf": 1,
		"2_1AbcdjqfVPUHJsKbvTjzCJJ5isjs7wRZxk": 1,
		"17_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6": 1,
		"887_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"8_1JpWZr3hPmL8cYSKQCzuqUyhG25UuQsjPh": 1,
		"29_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6": 1,
		"131_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"16_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"8_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W": 1,
		"892_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"2_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3": 1,
		"2_1QGLB3N8RDWXaUSjvnZYjpU2X6t8NAgmtU": 1,
		"690_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"3_1JGLcd9SrxuxdEYR2AGTVR6MeyVw8qQt9L": 1,
		"14_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5": 1,
		"14_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"4_1DNJ1b7d7bqeZHigy35ZKBwwe8PBv8o7Gk": 1,
		"18_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"7_15QMtSMe3Ckgr3m3bajRgDbNsChibX6sK4": 1,
		"4_15QMtSMe3Ckgr3m3bajRgDbNsChibX6sK4": 1,
		"1_15QMtSMe3Ckgr3m3bajRgDbNsChibX6sK4": 1,
		"15_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"223_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"49_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": 1
	}
}