{
	"posts": [
		{
			"id": "bf113ed6-8c05-42a4-9682-21146254495e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "0b66c8cf-05a3-468c-a741-f02c66016077",
			"body": ">>dc5f08cb-ad8b-4377-a382-c011ff628e1b\n>It's not perfect, but if you turn off the computer when you go to bed, you at least get a cert a day automatically.\nYou don't have to restart your computer, in fact you don't even have to close your 08chan tabs, at least on Windows. You just right-click the Zeronet icon on the notification area, click exit and then start Zeronet again. Takes literally less than 10 seconds to close, restart and reconnect for me. The open tabs automatically detect that Zeronet has been restarted and use the newly generated cert.\n**hopping ids is now easier than it has ever been, you can now literally id hop for every shitpost in seconds**\n",
			"time": 1565285113176,
			"files": "[]"
		},
		{
			"id": "ee193222-872e-476b-9858-519dea394a6a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "0b66c8cf-05a3-468c-a741-f02c66016077",
			"body": ">>dc5f08cb-ad8b-4377-a382-c011ff628e1b\n>>bf113ed6-8c05-42a4-9682-21146254495e\nI'll look into it a bit more, but actually it seems to be generating a new cert with each new post after I enabled multiuser.\n\nEdit: Nope disregard that, I'm retarded. It only generates the certificate with the first post under the new identity. Still, like I said just restarting the Zeronet service works.\n\n",
			"time": 1565285343966,
			"files": "[]",
			"last_edited": 1565285513105
		},
		{
			"id": "0ac86d04-283d-4ba7-b545-7596f96059ee",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "e0a6634e-bb76-4cb6-9c34-719011e548da",
			"body": "Copy pasting what I posted in the other thread, I'm okay with 8chan never coming back up and this becoming our new home. Right now it's feeling pretty comfy without turbofaggots, underage kids and paid shills. Reminds me of the good ol' days. Of course the cancerous faggots will eventually come if this catches on, I had never tried this Zeronet thing until ~~today~~ yesterday and it hardly requires any computer literacy at all. Fuck Tor, it's still centralized and hidden services are so fucking slow that it's unsuitable for an imageboard. Anyways, we should enjoy this comfiness while it lasts.\n\nI hope this whole debacle at least helps waking normalfags up to why full net neutrality is important - and also why anti-DDOS companies such as Cloudflare acting as the new gatekeepers of the internet are an even bigger threat than Google or Facebook, a point I've been trying to get accross for months. Even if they don't care about 8chan, it seems to have sparked some discussion.\n\n>>13f00299-e166-4cb7-9828-5dce91c5c980\nSo there's the possibility they pull an Assange on him?\n\n>>898a3821-aeda-40e5-9f2c-5c778b57b5db\n>>ad1d510f-35be-4482-b394-6578b2300110\nSo if 8chan ever comes back, it's going to go the cuckchan route and officially become a glownigger honeypot. The thought crossed my mind the moment I first heard about Jim testifying, of course they're going to coerce him behind the scenes. I actually think this is more likely than never putting it back up.\n",
			"time": 1565286246425,
			"files": "[]",
			"last_edited": 1565286431980
		},
		{
			"id": "1b30179e-cd8e-4e77-901e-3aef49789b4f",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "5477e53d-ee8c-44c5-a208-b9ccb2e8b6aa",
			"body": ">>5477e53d-ee8c-44c5-a208-b9ccb2e8b6aa\nHere. Just share this image if anyone asks\n",
			"time": 1565289664923,
			"files": "[{\"name\":\"how to switch certs on zeronet.png\",\"thumb\":\"f4ef36224eea43bbc42ad2d67fef921f1317a9ba-thumb.png\",\"size\":76150,\"type\":\"image/png\",\"original\":\"4c48ae1205bc22e66196d4263127c77b5ccb33d2.png\",\"directory\":\"1KAW41C2gSR7BWAZK88h2pYFn28krqftYz\"}]"
		},
		{
			"id": "44ecb0cc-fb1e-4776-a4e1-5b2ae61fcff1",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "5477e53d-ee8c-44c5-a208-b9ccb2e8b6aa",
			"body": ">>5477e53d-ee8c-44c5-a208-b9ccb2e8b6aa\n>>1b30179e-cd8e-4e77-901e-3aef49789b4f\nBy the way, afaik there's no way to have a list of pre-existing certs and just alternate between them at will. You will have to use a different randomly generated id every time you do this.\n",
			"time": 1565290412159,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}