{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1611236743_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": [
			{
				"comment_id": 1,
				"body": "I've seen this before. Means you either must restart the Zeronet server or obtain a new ZeroID (restarting several times to install properly). Reason? Near as I can tell, Millchan or ZeroNet has a posting limit per ID of 5GB. Once you exceed that - your content won't sign. Therefore it won't propagate either. Only signed postings propagate.",
				"added": 1611632091
			}
		],
		"1611680008_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR": [
			{
				"comment_id": 2,
				"body": "When you figure this out, please document and repost. I suspect many need help here.",
				"added": 1611717244
			}
		],
		"1611606727_1LPWdVJ1GNU738u2VUkoZdw9B7u4VPmfNZ": [
			{
				"comment_id": 3,
				"body": "Believe your effort is helping. Posting speeds dropped quite a bit after the election...but now are faster than they've ever been. Thanks!",
				"added": 1611717374
			},
			{
				"comment_id": 4,
				"body": "> [patriotbase](#comment_3_139pHaxesZa11czwptXVY62ZrNWUh4NxRQ): I was thinking about having some stickers printed up: 'ZeroNet.io: Join the Free Speech Internet', or something along those lines.\n\nI wish you luck - but shilling has been tried with Zeronet. Mostly a failure. Either they see the utility - or they don't. \n\nOne thing which might help? Haven't seen anyone promote \"infinite expandability\" yet. To be fair, none of us really knows that yet. Not enough users to test. But there are hints this might be true. The underlying plumbing is sound. Zeronet by itself seems quite robust. Most of the problems have to do with inferior relays. And don't forget, every onion connection is 6 hops. Despite this, I've seen the durn thing move gigabytes very quickly. There is literally nothing better anywhere for distributing images and some video files.",
				"added": 1611717850
			}
		],
		"1612067157_1PTLdvcq9U4wKG1J3Gr4z1wB8LWMypuHAA": [
			{
				"comment_id": 5,
				"body": "Why are you here?",
				"added": 1612070841
			}
		],
		"1612124072_1BudWvimweYZjs7PghDjpd8nbuHH4dR84u": [
			{
				"comment_id": 6,
				"body": "Real, but is being exploited: https://www.beckershospitalreview.com/finance/state-by-state-breakdown-of-federal-aid-per-covid-19-case.html\n\nHospital administrators will have a very good year.",
				"added": 1612131635
			}
		],
		"1612184585_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 7,
				"body": "Blah, blah, blah. I'd setup an onion node 24/7 if you guys would spare me the bitcoin blabber. Don't care about mining or the rest of that stuff. Only communications matters. You'd get a hell of a lot more uptake if you'd simply offer an iso to support your system. Should take ANYONE less than 10 minutes to setup a relay. That's your real barrier to success.",
				"added": 1612196140
			}
		],
		"1612193748_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne": [
			{
				"comment_id": 8,
				"body": "Would cost you two minutes to set it up on 08 chan - without the character limit.\n\nBut if you wish to do it the hard way .......",
				"added": 1612196420
			}
		],
		"1611445407_1PqZH7rna6K4Ea76MnFgyHqRCa4fTst2cC": [
			{
				"comment_id": 9,
				"body": "Don't care. Only the right to be left alone needs to be re-established in this country. You do that by killing transgressors. Until as a group - they stop. \n\nGovernment is the problem here - they inserted themselves in the middle. Might be time to kill them too. Until they stop. ALL of us can then live around those we trust. Only a few centralized government services might need to be color blind. Rest of the time, \"nigger city\" and \"white city\" can co-exist just fine. \n\nAssuming something is done about the compelled cross subsidies currently extracted to support the black race. They just need to find their own equilibrium. And whites must learn to say \"NO\" to niggers and nigger lovers. Whites need to free themselves from slavery. Just cut the blacks loose. Israel too. Jews are clever. Let them support themselves. They don't need a $4000/yr per capita subsidy from US taxpayers. Niggers currently get $16,000/yr per capita. That should also go to zero.",
				"added": 1612197282
			}
		]
	},
	"comment_vote": {}
}