{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Guarde suas fotos para sempre gravadas em DNA",
			"body": "#Fotos para gravar em DNA\n\nPesquisadores estão procurando 10.000 imagens originais de todo o mundo para preservá-las indefinidamente em DNA sintético, que é promissor como um meio de armazenamento revolucionário que dura muito mais e que é muitas ordens de magnitude mais densa do que as tecnologias magnéticas atuais.\n\nPara isso, a equipe do projeto #MemoriesInDNA está convidando o público a enviar fotografias originais que gostariam de ver preservadas em DNA por milênios - estima-se que dados gravados em DNA poderão durar por 1 milhão de anos.\n\nAs imagens - que deverão ser transmitidas para o site do projeto - serão codificadas em DNA sintético e disponibilizadas para pesquisadores de todo o mundo. A equipe também está encorajando as pessoas a compartilharem as mesmas imagens nas redes sociais com a hashtag #MemoriesInDNA e incluir uma história sobre por que a fotografia ou o vídeo são importantes para eles.\n\n\"É a sua vez de nos mostrar o que deve ser preservado em DNA para sempre,\" disse o professor Luis Ceze, da Universidade de Washington, nos EUA. \"Queremos que as pessoas saiam e tirem uma foto de algo que eles querem que o mundo se lembre. É uma oportunidade divertida de enviar uma mensagem às gerações futuras e ajudar a nossa pesquisa\".\n\nA equipe já codificou obras importantes em moléculas de DNA, incluindo a Declaração Universal dos Direitos Humanos, os 100 melhores livros do Projeto Gutenberg, músicas do Festival de Jazz de Montreux e agora pretende codificar aproximadamente 10.000 das imagens que o público enviar, tudo em fragmentos de DNA sintético.\n\nO armazenamento de dados em moléculas de DNA está emergindo como uma alternativa para fechar o crescente hiato que está-se abrindo entre a quantidade de dados digitais gerados e nossa capacidade de armazená-los de forma acessível e eficiente.\n\nSe você quiser participar, as imagens deverão ser enviadas para o site do projeto, no endereço http://memoriesindna.com.",
			"added": 1561757009
		},
		{
			"topic_id": 2,
			"title": "DNA Storage",
			"body": "A quantidade de dados digitais produzidos há muito tempo supera a quantidade de armazenamento disponível. Este projeto permite o armazenamento de dados de nível molecular em moléculas de DNA, aproveitando os avanços da biotecnologia na síntese, manipulação e sequenciamento de DNA para desenvolver armazenamento arquivístico. Os pesquisadores da Microsoft e da Universidade de Washington estão colaborando para usar o DNA como um meio de armazenamento de alta densidade, durável e fácil de manipular.\n\nA demanda por armazenamento de dados está crescendo exponencialmente, mas a capacidade da mídia de armazenamento existente não está sendo mantida. Atualmente, a maioria dos dados do mundo é armazenada em mídia magnética e óptica. Apesar das melhorias nos discos ópticos, armazenar um zettabyte de dados ainda levaria muitos milhões de unidades e utilizaria um espaço físico significativo. Se quisermos preservar os dados do mundo, precisamos buscar avanços significativos na densidade e durabilidade do armazenamento. Usar o DNA para arquivar dados é uma possibilidade atraente porque é extremamente denso (até cerca de 1 exabyte por milímetro cúbico) e durável (meia-vida de mais de 500 anos).\n\nEmbora isso ainda não seja prático devido ao estado atual de síntese e sequenciamento de DNA, essas tecnologias estão melhorando rapidamente com os avanços da indústria de biotecnologia. Dados os limites iminentes da tecnologia de silício (fim da Lei de Moore), acreditamos que sistemas híbridos de silício e bioquímicos merecem séria consideração. A biotecnologia beneficiou-se tremendamente do progresso da tecnologia de silício desenvolvida pela indústria de computadores; agora é a hora de os arquitetos de computadores considerarem a incorporação de biomoléculas como parte integrante do projeto de computadores.\n\n- https://www.microsoft.com/en-us/research/project/dna-storage/",
			"added": 1561757278
		},
		{
			"topic_id": 3,
			"title": "UNetbootin",
			"body": "UNetbootin permite a você criar discos USB Live inicializáveis para Ubuntu e outras distribuições Linux sem queimar um CD.\n\nhttps://unetbootin.github.io/",
			"added": 1561764817
		}
	],
	"topic_vote": {
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"1_1EUXGJs9UuQb1mjngjsS1ZyZioEGxA84RC": 1,
		"2_1EUXGJs9UuQb1mjngjsS1ZyZioEGxA84RC": 1,
		"3_1EUXGJs9UuQb1mjngjsS1ZyZioEGxA84RC": 1,
		"2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": 1,
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1,
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1
	},
	"next_comment_id": 14,
	"comment": {
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 1,
				"body": "#Processador anti-hacker\n\nUma nova arquitetura de processador de computador desenvolvida na Universidade de Michigan, nos EUA, promete nada menos do que lançar as bases de um futuro no qual os computadores se defendem proativamente contra ameaças, tornando obsoleto o atual modelo de segurança de encontrar bugs e lançar atualizações.\n\nO novo chip, batizado de Morpheus, bloqueia possíveis ataques de hackers criptografando e reorganizando aleatoriamente bits chave de seu próprio código e de seus dados 20 vezes por segundo.\n\nIsso é infinitamente mais rápido do que um hacker humano consegue trabalhar e milhares de vezes mais rápido do que as mais rápidas técnicas de hacking eletrônico.\n\n\"A abordagem atual de eliminar erros de segurança um por um é um jogo perdido. As pessoas estão constantemente escrevendo código e, tão logo há um novo código, haverá novos bugs e vulnerabilidades de segurança. Com o Morpheus, mesmo que um hacker encontre um bug, a informação necessária para explorá-lo desaparece 50 milissegundos depois. É talvez a coisa mais próxima de um sistema seguro à prova do que surgir no futuro,\" disse o professor Todd Austin.\n\n- https://sci-hub.tw/10.1145/3297858.3304037",
				"added": 1561753182
			},
			{
				"comment_id": 2,
				"body": "#Criptografia neurocientífica gera senha que você usa sem conhecer\n\nMesmo os mais sofisticados sistemas de segurança eletrônica podem ser desmontados forçando alguém a revelar uma senha.\n\nMas que tal se as informações sensíveis pudessem ser armazenadas em seu cérebro de tal forma que você não pudesse acessá-las conscientemente, não importando o quanto você tentasse?\n\nEssa é a promessa de uma nova técnica que combina a criptografia com a neurociência.\n\nNos testes iniciais, os voluntários aprenderam uma senha, e a utilizaram posteriormente para passar por um teste, mas não conseguiram lembrar e verbalizar a senha quando isso lhes foi solicitado.\n\n- https://web.archive.org/web/20170423043130/http://bojinov.org/professional/usenixsec2012-rubberhose.pdf",
				"added": 1561753311
			},
			{
				"comment_id": 3,
				"body": "#Criptografia inviolável imita coração e pulmões\n\nUma equipe da Universidade de Lancaster, no Reino Unido, criou um modelo matemático que descreve a complexa interação entre o coração e os pulmões, necessária para coordenar os seus ritmos, e usaram esse modelo para criar uma nova forma de criptografar informações.\n\n\"Criamos um novo esquema de criptografia derivado da biologia, radicalmente diferente de qualquer procedimento anterior. Inspirado na natureza temporalmente variável das funções de acoplamento cardiorrespiratória recentemente descobertas em humanos, propusemos um novo esquema de criptografia que é altamente resistente aos métodos convencionais de ataque,\" disse Tomislav Stankovski, líder do trabalho.\n\n\"Como acontece frequentemente com avanços importantes, esta descoberta foi feita exatamente na fronteira entre duas áreas diferentes - estamos aplicando física à biologia,\" disse sua colega Aneta Stefanovska.\n\nA vantagem é que o método oferece uma infinidade de opções para a criação das chaves secretas compartilhadas entre o remetente e o destinatário para que só eles consigam ler as informações.\n\nIsso torna praticamente impossível para os hackers decifrar o código.\n\nO novo método também mostrou-se excepcionalmente resistente à interferência das flutuações aleatórias - ou \"ruído\" - que afeta todos os sistemas de comunicação.\n\nOutra vantagem é que é possível transmitir vários fluxos de informação diferentes simultaneamente, permitindo que todos os dispositivos digitais de casa, por exemplo, operem usando uma única chave de segurança, em vez de dezenas de chaves diferentes.\n\n- https://sci-hub.tw/10.1103/physrevx.4.011026",
				"added": 1561753427
			},
			{
				"comment_id": 4,
				"body": "#Criado um gerador quântico de números realmente aleatórios\n\nPesquisadores criaram um novo tipo de gerador de números aleatórios que foi certificado como sendo realmente aleatório pelas leis da física quântica.\n\n- https://sci-hub.tw/10.1038/nature09008",
				"added": 1561753772
			},
			{
				"comment_id": 5,
				"body": "#Proteção definitiva contra hackers tem poucos átomos de espessura\n\nMuitos especialistas em ciência da computação e segurança da informação afirmam que só estaremos a salvo de hackers e roubos de informações quando a segurança for incorporada no hardware.\n\nAté agora a indústria não encontrou uma forma de viabilizar essa nova camada de proteção aos usuários, por isso tem havido um interesse crescente no desenvolvimento de mecanismos que sejam baratos e que possam ser incorporados nos aparelhos eletrônicos convencionais.\n\nUma opção promissora acaba de ser desenvolvida por Abdullah Alharbi, da Universidade de Nova Iorque, nos EUA.\n\nEle usou cristais de molibdenita, um dos materiais mais promissores para o futuro da computação, para criar primitivas de cibersegurança virtualmente impossíveis de serem clonadas.\n\nAs estruturas em camadas incorporam a aleatoriedade, um comportamento essencial para a construção das primitivas de segurança que devem criptografar e proteger os dados do computador - fisicamente, direto no hardware, e não por programação.\n\n- https://sci-hub.tw/10.1021/acsnano.7b07568",
				"added": 1561753959
			},
			{
				"comment_id": 6,
				"body": "#Cartão de crédito quântico será imune à clonagem\n\nEmbora os bandidos possam ter acesso a técnicas para replicar as informações dos cartões de crédito e débito tradicionais, é virtualmente impossível clonar a informação quântica guardada em um qubit.\n\n- https://sci-hub.tw/10.1073/pnas.1203552109",
				"added": 1561754041
			},
			{
				"comment_id": 7,
				"body": "#Dados criptografados são processados sem serem decifrados\n\nImagine a solução definitiva da criptografia: você poder responder a uma pergunta sem saber a própria pergunta.\n\nDe forma mais simples, suponha que alguém pense em dois números e, em seguida, peça a outra pessoa para somar ou multiplicar os dois, sem que essa pessoa saiba quais são os dois números.\n\nIsso já é possível desde que a pessoa receba um código criptografado dos dois números - mesmo não conhecendo a senha para decifrá-los.\n\nA técnica tornará possível, por exemplo, que uma empresa envie seus dados criptografados para processamento em um computador de terceiros, sem correr o risco de que seus dados sejam lidos.\n\n- https://web.archive.org/web/20110721022913/http://www.info.unicaen.fr/M2-AMI/articles-2009-2010/smart.pdf",
				"added": 1561754349
			},
			{
				"comment_id": 8,
				"body": "#Criptografia quântica foi hackeada\n\n- https://sci-hub.tw/10.1103/PhysRevA.75.042327",
				"added": 1561754606
			},
			{
				"comment_id": 9,
				"body": "O PureOS é uma distribuição GNU / Linux baseada no Debian. É uma distribuição de área de trabalho que pode ser usada como mídia ao vivo (CD ou USB) ou como sistemas operacionais completos instalados em um disco rígido. O PureOS usa exclusivamente software livre e de código aberto e é endossado pela Free Software Foundation. Ele vem com alguns recursos de privacidade ativados por padrão, como o uso do DuckDuckGo como mecanismo de pesquisa e a extensão do navegador HTTPS Everywhere está ativada.\n\n- https://pureos.net/",
				"added": 1561764750
			}
		],
		"2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": [
			{
				"comment_id": 10,
				"body": "O VeraCrypt é um software para estabelecer e manter um volume criptografado on-the-fly (dispositivo de armazenamento de dados). A criptografia instantânea significa que os dados são automaticamente criptografados antes de serem salvos e descriptografados logo após serem carregados, sem qualquer intervenção do usuário. Nenhum dado armazenado em um volume criptografado pode ser lido (descriptografado) sem usar a senha / arquivo de chaves corretos ou corrigir as chaves de criptografia. Todo o sistema de arquivos é criptografado (por exemplo, nomes de arquivos, nomes de pastas, conteúdo de cada arquivo, espaço livre, metadados, etc).\n\n- https://github.com/veracrypt/VeraCrypt\n- https://github.com/veracrypt/VeraCrypt-DCS",
				"added": 1561764907
			},
			{
				"comment_id": 11,
				"body": "O Libreboot é um projeto de software livre que visa substituir o firmware proprietário do BIOS encontrado na maioria dos computadores por um sistema leve e livre projetado para executar apenas o número mínimo de tarefas necessárias para carregar e executar um sistema operacional moderno de 32 bits ou 64 bits.\n\n- https://notabug.org/libreboot/libreboot.git",
				"added": 1561764990
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 12,
				"body": "#Mahouka Koukou No Rettousei\nMagia não é um produto de lendas ou contos de fada, na verdade ela se tornou uma tecnologia da realidade desde um tempo desconhecido para as pessoas. Poderes sobrenaturais se tornaram um sistema tecnológico através da magia, enquanto a magia se tornou uma habilidade técnica. Um \"Usuário de Poder Sobrenatural\" se tornou \"Técnico em Magia\". Técnicos de Magia, ou Magos, são estimulados em Escola e Universidades Mágicas.\n\n\n\n- https://www.superanimes.site/anime/mahouka-koukou-no-rettousei",
				"added": 1561765654
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 13,
				"body": "#As 48 Leis do Poder – Robert Greene\n\nO poder é um jogo. É preciso saber jogá-lo para conquistar o que se deseja na política, nos negócios, na vida pessoal e até na corte amorosa. \"As 48 Leis do Poder\" mostra como agem os mestres nesta arte que envolve inteligência, perspicácia, planejamento e, principalmente, dissimulação, seja no Japão feudal ou na corte de Luís XVI, na renascença italiana ou na Chicago dos tempos da Máfia. As Leis incluem, entre outras, a capacidade de esperar o momento certo para atacar, criar uma aura de mistério para confundir os inimigos, saber conquistar corações e mentes das pessoas e encobrir todos os atos em cortinas de fumaça. Reis, políticos, generais, diplomatas e religiosos - assim como cortesãs, bandidos e charlatões - servem de base para as 48 Leis que regem o poder e a influência sobre outras pessoas.\n\n\n- https://webcache.googleusercontent.com/search?q=cache:http://sou.gohorseprocess.com.br/wp-content/uploads/2017/05/As_48_Leis_do_Poder_completo.pdf",
				"added": 1561784412
			}
		]
	},
	"comment_vote": {}
}