{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1576862108,
			"title": "Tartarian Empire?",
			"body": "Have you heard of a worldwide empire that stretched into the Americas long before the Conquistadors?",
			"added": 1576862107
		},
		{
			"topic_id": 1577433117,
			"title": "Stay Mad",
			"body": "Make me mad. Spit undeniable offensive truths. Say something that might just save our species.",
			"added": 1577433115
		},
		{
			"topic_id": 1578276840,
			"title": "Honesty Enslaves",
			"body": "Trying hasn't gotten me what I want and I've been lied to by everyone I've ever trusted. Honesty has left me enslaved to the truth in a world of deceivers who make my life Hell.\n\nThere is no fighting the will of the people of the United States. Either you join in on the evil or become prey. All of my sanity has been eaten away.\n\nI have a teenage child who is a predator crying at night for wanting my baby, a girlfriend who is after what little fortune I have saved through honest toil, a family too prideful and numb to care, a broken heart and a betrayed mind full of half-truths fed to me from childhood.\n\nWhat can be done about slave-state USA? Smoke weed and chew tobacco?\n\nShould I burn myself to keep from setting everyone else's world on fire?\n\nI am a sheep in a country of livestock, protected by dogs, and led by wolves. What can I do? \n\nScreaming solves nothing. Protesting solves nothing. Trying solves nothing.\n\nThis life has been spent learning to manage and maintain military inventions (computers and Internet) I once thought were used for noble and honorable causes while I missed out on fighting for freedom and making friends. Most everyone has made fun of me for my beliefs and terrible inability to lie. I cower and refuse to retaliate because I can always work a little harder to make up for the pain of those who hurt me.\n\nI've gotten older and I see that everyone is a liar and I wasted time believing I could learn enough to escape or be useful enough to fix these mistakes. This was all a distraction by a nation that exists to murder and plunder.\n\nWhat was the point? What could I have done differently?\n\nMaybe I could have lied to get what I want. Perhaps I would have suffered less by deceiving more.\n\nWhy is everything so baaaaaad? Why was I born to be part?\n\nI'm a patsy; as innocent as I am ignorant.",
			"added": 1578276837
		},
		{
			"topic_id": 1578551830,
			"title": "How do I get my girlfriend to help with rent?",
			"body": "I've been dating her for over a year and she's been living with me for five months without helping with rent. Is this normal?\n\nShe was living on food stamps and disability until November when she got a job doing hair, so she was helping with food half the time. Now that she's working she complains about not having those benefits and no longer gets food like she used to.\n\nI'm paying and cooking most of the time. I've asked for $200/month as help, yet she hasn't offered anything up and complains when I don't get her a Christmas present.\n\nRecently she got a phone call about some health bills she needs to pay and I believe that's where her extra cash is being sent.\n\nI don't want to be a nuisance, but I need the help with the mortgage and the bills. She's a year older than me. Does this happen a lot? I don't want to fight nor throw her out. We're not having sex and I'm living off my savings. Should I expect more?\n\nMan, I don't know what to do about her. I like her and I enjoy helping. My family likes her. I dunno, maybe I'll start spending my day at the library and just making food for myself. I don't want to make problems.\n\nWhen I was smoking pot I didn't mind and handled everything myself. Since last month I've stopped and now I'm bored enough to start thinking about things that bother me. I don't know if it's the sobriety, but I'm not feeling sexual or entertained anymore. I spend my day reading and cooking instead of working and relaxing.\n\nBeing off pot is annoying. I keep looking for problems and trying to fix them. That might be what I'm doing now. Ignore this if you think sobriety is a waste, or maybe just tell me to go smoke a joint and relax I guess.\n\nI'm gonna go make food.",
			"added": 1578551826
		},
		{
			"topic_id": 1578817237,
			"title": "The pork is infected",
			"body": "You might be a zombie. You can recover. \n\nYou are being treated like cattle! Your lives are for profit as consumers!\n\n[Decreased food standards in the USA](https://www.nbcnews.com/politics/white-house/trump-administration-allows-pork-slaughterhouses-have-fewer-usda-inspectors-n1055451) have led to widespread infestations of pork tapeworm (Taenia Solium). Pigs, including those used for bacon and sausage, have been infected and\ttheir meat carries the taste of pharmaceuticals. The eggs aren't destroyed by these medicines and are in many consumer products.\n\nMany hospitals and patient care facilities are\tnot equipped with laboratories capable of identifying the microscopic ova in human fecal matter.\n\nPatients\texperiencing changes in libido, hair-loss, rashes, hives, appetite, or neurological symptoms like lethargy, depression, anxiety, bipolar, schizophrenia, forgetfulness, dimentia, alzheimer's, and the like may be experiencing symptoms of a mistreated helminth infestation. Left undiagnosed the tapeworms can become\tlodged in the brain, developing into hard cysts which can mold and rot the body from the inside out. This is called neurocisticercosis.\n\nDoctors do not have tests nor equipment to properly diagnose these issues and will assure you that the anti-depressants or painkillers or other pharmaceutical will help you while you are\tslowly\teaten alive. This is an STD that wants to be spread and intercourse deepens penetration of the creatures during orgasm. There may be maggots in your scrotum, uterus, and other parts of your body.\n\nA regiment exists to treat you and intermittent fasting as well as changing your internal pH from acidic to alkaline and back will help you, but you have to give up pork for as long as their sources are infected.\n\nDemand respect by respecting yourselves. Stop the\tzombie apocalypse.\n\nLook for pyrantel pamoate, praziquantel, albendazole, and similar drugs.\n\n",
			"added": 1578817232
		},
		{
			"topic_id": 1585269932,
			"title": "Why is everyone and everything so weak nowadays?",
			"body": "How were large steel gears, chains, nails, rivets, and wheels manufactured before the 20th century? Where have the people and machines gone which could create the enormous and durable parts, adapters, and fixings?\n\nThe available inventories are flimsy and tiny in comparison to what was available to build the wonders of the last century! Where have the strong and beautiful gone?",
			"added": 1585269926
		},
		{
			"topic_id": 1587357990,
			"title": "Marijuana",
			"body": "Grow the plant and smoke the weed. You know there's nothing wrong. Fuck the federal government. State's rights matter most.\n\nSo stop paying income tax, don't support the DEA, and forget the military because without your consent they have no power. Light up a joint and focus on what matters. Don't let foreign foes and international influences distract you, even if they're from Washington, D.C.",
			"added": 1587357983
		}
	],
	"topic_vote": {
		"1576309972_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1577153543_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"1577569682_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1577571372_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1577633593_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1577829583_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1578034470_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": 1,
		"1578081567_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1578136139_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": 1,
		"1570109199_1N4DSSHorDvEkDGkQfUhnnryYiTdtUW8hU": 1,
		"1578244855_1M1qF4xa5hYtGE1BikxTpZxLtAyQRXsJ4v": 1,
		"1578268512_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": 1,
		"1578341356_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1578394622_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1578551830_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": 1,
		"1575709869_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1576233739_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": 1,
		"1579529677_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1579517170_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1580015834_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"1579890100_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": 1,
		"1580758021_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1
	},
	"next_comment_id": 93,
	"comment": {
		"1576725447_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 1,
				"body": "Mason jars, solar panel chest freezers, pressure cookers, moonshine, dogs, antibiotics, antihelminths, hemp, vinegar, baking soda, bleach, knives, hand tools, fuel, guns, guitars, boots, bandages, and babes.",
				"added": 1576843365
			}
		],
		"1574560433_1Gvs3AKBY5YjUMPchHuoQuAYnWApBm1myY": [
			{
				"comment_id": 2,
				"body": "WWII hurt Isaac's family. WWI Ishmael.\nThis feud between Abraham's sons, one of incest, one abandoned, has ripped the world in two, yet we are all one.\n\nWhat happened to the ottoman empire? How was Israel reestablished in Palestine? Why did Germany have to suffer both times?\n\nBankers abuse interest to create debt as an excuse to covet and steal. Slavers abuse love to create debt as an excuse to covet and steal.\n\nYankees destroyed the Confederacy and the Nazis by killing as they were commanded like good dogs.",
				"added": 1576861626
			}
		],
		"1576213352_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 3,
				"body": "I believe I was targeted three days ago.\n\nMy mind went haywire with fear a short time after noon so I went for a drive to a quiet spot and I was met with halted vehicles in both lanes on my way through a canyon. I veered into the guardrail to avoid catastrophe and jumped from the window before my truck could fall into a ditch. Once out I ran a few feet to safety and lay prone in the snow with hands on my head. Police knelt on me and handcuffed me before treating for shock or showing any regard for my well-being. My clothes were cut without asking me to remove them and I was belittled by EMTs while strapped to a gurney.\n\nHeld against my will in the hospital emergency room, I was met with all manner of instigation to try and coax me into saying something that would require them to hold me. After refusing to sign any paperwork and being informed that my rights were being stripped, I was drugged while crying and my blood drawn without permission. Highway patrolmen informed me that they would take my blood so they could serve me a ticket while I was under duress, so I was given a DUI yet my labs from the hospital reveal no alcohol consumption. After asking to leave I was informed by the doctor that because I refused to sign their papers that I would be held in the psychiatric ICU for 3 days against my will.\n\nThorough defeated I mentally retreated and continued to peacefully comply. I read a book and slept after telling everyone I was on vacation and refused all medication.\n\nAfter three days of simple group therapy sessions, cafeteria meals, provocations from security guards and and nurses met with my peaceful compliance, making friends with others on the floor, and asking for a tapeworm test that might be affecting my mental health I was quickly discharged when they knew there was nothing they could do to legally hold me longer nor any pharmaceutical they could get be hooked on I was given a bus token and walked home.\n\nLooking back I have no idea why the canyon was blocked, why I was abused by police, where the fear came from, and for what reason I was held against my will for so long except that perhaps this might have been some test of my character in an attempt to discredit me and my work as a community developer and political activist.",
				"added": 1577285336
			}
		],
		"1577153543_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 4,
				"body": "Nobody deserves children. A child is not alive until after teething. Marriage is unimportant.",
				"added": 1577397014
			},
			{
				"comment_id": 6,
				"body": "Blow jobs are for the mentally ill; you're missing the target by a meter! Oral sex is anti-instinctual and retards our species. If you don't want to reproduce yet desire sex, you're probably going to die of an overdose.",
				"added": 1577432453
			}
		],
		"1577384892_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": [
			{
				"comment_id": 5,
				"body": "This option is where you change identities.",
				"added": 1577407097
			}
		],
		"1569681691_1E57Vo1oeu4cMqHP6AaWbMxhkg3XRF4hbi": [
			{
				"comment_id": 7,
				"body": "Should I care if my partner(s) wish to have a baby without me? If the kid isn't mine I have far fewer responsibilities. I'll call her son whatever she wants and I'll call my son whatever I want. Don't expect me to feed children that aren't mine without non-sexual compensation.",
				"added": 1577432820
			}
		],
		"1577433117_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 8,
				"body": "> [draugrdeathlord](#comment_20_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): You have a psychological problem that likes it when people treat you badly. Get help.\n\nIn a world that gets off on treating you badly, all the help I get is more of the same. Check yourself.",
				"added": 1577434748
			},
			{
				"comment_id": 9,
				"body": "> [draugrdeathlord](#comment_21_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Whether or not you like it is not related to how much of it you receive or if the rest of the world gets off on it. Most people are cunts true, don't have to join them or give them pleasure.\n\nI avoid going out to hide from the pleasure others get from my suffering. From my time alone I have gotten quite good at cooking and cleaning. I live below hoes and make them cookies. There's nothing I would like more than for liars to tell the truth, like the rape \"victims\" who got off and the children who tempt adults into pedophelia because they wanted to fuck without getting in trouble.",
				"added": 1577439338
			},
			{
				"comment_id": 10,
				"body": "> [styromaniac](#comment_1490_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Pizzagate is real.\n\nI've met kids who only want to have sex and do drugs.",
				"added": 1577439447
			},
			{
				"comment_id": 12,
				"body": "> [styromaniac](#comment_1491_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You know the Clinton Foundation abducted Hatian children, right? They're referred to as \"walnuts\" by John Podesta.\n\nI live with a child who claims she is Hawaiian and regularly fucks adults, poor thing. We smoke pot together and I teach her what I know. A little self discipline goes a long way and I hope I have been a good influence on her.",
				"added": 1577439983
			},
			{
				"comment_id": 13,
				"body": "The corruption of our society runs deep and the police would rather beat me up than help me or her or any of us.",
				"added": 1577440122
			},
			{
				"comment_id": 14,
				"body": "I suspect my ex fiance participates in orgies that motivate military and police behind closed doors. When I refused to join in she left me so she could continue giving into her base desires instead. All my friends probably played with her, as they don't talk to me anymore. Their lack of self control and her selfishness have caused me suffering unimaginable.",
				"added": 1577440354
			},
			{
				"comment_id": 15,
				"body": "Like the girl who lives with me, my ex-fiance and current girlfriend all have wanted sexual experiences since childhood yet blame their partners when convenient so they can escape consequences.\n\nI've caught my current partner with her and another man with their pants down.",
				"added": 1577440567
			},
			{
				"comment_id": 16,
				"body": "I tried to run away recently and was forced off the road, beatup by police, held in the hospital against my will, given drugged food, and am now suffering through an illness I contracted there.",
				"added": 1577440685
			},
			{
				"comment_id": 17,
				"body": "I have a lump on my testicle and a tapeworm that moves around my body that I have told doctors about and they assure me there is no test nor operation they can (or are willing to) perform.\n\nTo stay alive I have been smoking cannabis and giving myself coffee enemas mixed with pet dewormer, yet I have been unable to pass the infection.\n\nMy family and friends know, yet they do nothing. I believe I am being targeted and have been punished for being born, yet I have strived my whole life to exemplify the great characteristics I have seen in others.\n\nI don't deserve this behavior from people who profess to love me. I am dying young! I am being watched and tried to escape to another country with better healthcare, was ran off the road, wrecked my truck, then knelt on by police and handcuffed when I did nothing but comply. This country clearly wants me to commit suicide or show some aggression so they can have an excuse to hurt me, yet I have never been violent or displayed rage of any kind!\n\nI can't get out. This place is evil.",
				"added": 1577446386
			},
			{
				"comment_id": 18,
				"body": "I'm sure I sound crazed, yet I was held in the hospital against my will from 12/21/19 - 12/24/19 in the psychiatric ICU and was allowed to walk out without a prescription once I asked about tapeworm tests. \n\nThere's something amiss and I am led to believe that my dad is collaborating with others to keep my mother captive and take out his impotent rage on me. He is Mormon and used to work for the CIA. HAM radio carries conspiracies against citizens regularly, of which I am one. The authorities, police, doctors, and church leaders are conspiring together to hide the truth of their sins and torture those who shine the light on their deception.",
				"added": 1577447077
			},
			{
				"comment_id": 19,
				"body": "Even this network I'm certain is a geofenced trojan horse, yet I cry out for relief here because I have nowhere else to go and nobody I can trust.",
				"added": 1577447188
			},
			{
				"comment_id": 20,
				"body": "Salt Lake City. I was planning to give myself a couple more praziquantel/coffee enemas once I am feeling well again.\n\nI don't usually drink and prefer to smoke pot from Colorado dispensaries, though I am sober now.\n\nRecently I have gathered evidence that stupidity and hypersexuality may be due to tapeworm, specifically pork tapeworm, as euphoria allows deeper penetration of the infestation.",
				"added": 1577453471
			},
			{
				"comment_id": 21,
				"body": "Not that any of this really matters. My body is decaying, just like this poor excuse of a nation. Most of the people here are zombies and content to be so, as long as there are opiates and pharmaceuticals.\n\nAll the doctors were surprised that I didn't want any medications. They didn't have the medicine I wanted and claimed to never test for tapeworm.\n\nAnyway, I'm a fool and have probably revealed myself already.",
				"added": 1577453907
			},
			{
				"comment_id": 22,
				"body": "What is your sickness like? I have met an Alex Stucky.",
				"added": 1577455537
			},
			{
				"comment_id": 23,
				"body": "I had success with fenbendazole, praziquantel, and niclosamide. What kinds of fungi did you use?\n\nThe Alex I'm thinking of shares mutual friends with me.",
				"added": 1577457546
			},
			{
				"comment_id": 24,
				"body": "Do you have any more sources on pizzagate and clinton child trafficking in haiti?",
				"added": 1577467358
			},
			{
				"comment_id": 25,
				"body": "> [xane](#comment_13_1btdnzDG8dG58aW9vnKWmCHV59dNTJfn7): lolifags belong in body bags [...]\n\nWhat about children that want to fuck adults? What do they get? Cayenne pepper on their privates and Gideon's Bible?\n\nI'm grateful for laws that protect adults from minors. There are some kids I have met that could benefit from being branded with a scarlet letter.",
				"added": 1577495637
			},
			{
				"comment_id": 26,
				"body": "> [xane](#comment_15_1btdnzDG8dG58aW9vnKWmCHV59dNTJfn7): how old is the child? [...]\n\nMost of what I hear about is little sisters or brothers of significant others who get off on the idea of stealing their older sibling's partner.\n\nKids enjoy power dynamics, too. Students seduce teachers and children lure in adults with no other incentive than to feel control over someone much older than them.\n\nI don't believe young people are ever as innocent as we would like to imagine.",
				"added": 1577500843
			},
			{
				"comment_id": 27,
				"body": "The keyboard on my phone is monitored. Letters are switched and sentences rearranged. I have tried turning off all available options for remote statistics and the like.\n\nThere's no way a computer with 8 cores and 64GB of ram could run as slowly as modern handhelds are prone to!\n\nCoding techniques are pitiful now. I watched a 64kb video that was 10 minutes long at the turn of the century. Now we only go backwards while creating bloatware for ads and resource consumption.\n\nBefore Bitcoin, back in the early 2000s, there were distributed cracking pools with software clients that used extra processing power to break common encryption algorithms. I used to participate in forums dedicated to hacking which were all subverted by authorities and influencers either jailed, hired by government, or both.\n\nI know I'm a stupid newfag and have been cursed with infections courtesy of my parents, teachers, Mormon church leaders, doctors, and anyone I have ever grown to trust.",
				"added": 1577533951
			},
			{
				"comment_id": 28,
				"body": "I was born a patsy and my vision was stolen from me when I told my parents that I could see matter among the stars they could not. This occurred at 8 years old around when they baptized me and since that day my life has not belonged to me.",
				"added": 1577535246
			},
			{
				"comment_id": 29,
				"body": "There's a reason Mormons don't want you drinking whiskey and coffee, smoking pot, or chewing tobacco: these things may reverse the damaging effects of mind control and the parasitic infections nefarious leaders use to enslave you.",
				"added": 1577535454
			},
			{
				"comment_id": 32,
				"body": "> [lianna](#comment_87_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4): computer\n\nMobile phones are the computers I'm referring to, as they purposefully have restricted interfaces where background tasks can be easily hidden.",
				"added": 1577555792
			}
		],
		"1576862108_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [],
		"1577499241_1Hrz1rynf2scp9MZ7Abt6FfRgUMCmZ8H2v": [
			{
				"comment_id": 30,
				"body": "There's nothing on that profile when I download it. I must be geo-fenced and blocked. Typical....just when I start to trust a new platform >_<",
				"added": 1577536386
			},
			{
				"comment_id": 31,
				"body": "Can you relay what is on that profile?",
				"added": 1577545715
			}
		],
		"1577566123_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 34,
				"body": "At this point I use social media to educate my peers about American history and point them toward revolution.",
				"added": 1577573963
			}
		],
		"1577633593_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 35,
				"body": "Encourage everyone you know to stop consuming! Plant wormwood, clover, hemp, sunchokes, and tea. I've got giant squash seeds for trade.\n\nGet a used bicycle and learn how to maintain it. Have you heard of solar water distillation? Do you know about composting human waste?\n\nAcquire tools and start a share with your friends. Use a database to keep track of who has what with timestamps and checkout/checkin photos. Print barcodes for added flair. Cryptocurrency in a multisig wallet, silver, or other tools can be used as collateral.\n\nStart a community garden wherever you can get enough support.\n\nEither the drug-addicted zombies are going to die or suffer through withdrawal and accept change. Decide that you'll make it and the West will evolve and not perish.",
				"added": 1577635167
			},
			{
				"comment_id": 37,
				"body": "> [aspidochelone](#comment_294_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Hemp and tea I know uses for ... but what do you do with wormwood?\n\nWormwood is made into tea that rids the body of tapeworm and parasites, which effect is important when consuming low quality perishables and meats.",
				"added": 1577730871
			}
		],
		"1577728133_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 36,
				"body": "Yang2020 or constitutional convention. Voting Libertarian has failed to create the country I want and jobs that aren't compensated with taxes are drying up. May as well make welfare universal before more are unemployed.\n\nDemocracy dollars to prevent big money from influencing politics would be a good anti-corruption policy.\n\nI would like to see a debt jubilee, though the freedom dividend is a good step in that direction.",
				"added": 1577730328
			}
		],
		"1577824395_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 38,
				"body": "Who can sing, dance, make music, read and speak multiple languages, grow food, raise and kill livestock, and prepare/preserve meals for themselves or others? Where are basic human traits preserved and passed from generation to generation?\n\nI did not learn these skills in school and my parents are more mentally fractured than I from the same societal strategies which keep us dependent and docile. I want to learn, grow, build, and share in some way that feels new and meaningful without taking away the same from future generations nor depreciating what has come before me. How?",
				"added": 1577909548
			},
			{
				"comment_id": 40,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1494_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): I never waited, anyone, to do 'what I wanted to do'. 'What are you waiting for'? The deluge?\n\nI do these things, yet lack meaning and passion. \n\nI grew up fearing God, parents, and authority. Now I don't even eat my own food without permission unless preparing it as a service to someone else, until I'm starving, or just before it rots. I make decisions for myself and am left feeling selfish and evil, despite abandoning religion.\n\nDoing whatever I want leaves me broke and ensnared, so I learn what others are unwilling to do and sell it back to them for enough bread to live.",
				"added": 1577920532
			}
		],
		"1577912932_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 39,
				"body": "The economy doesn't need to exist.\nResearch Mutualism and blockchain.\n\nDo you know about OpenBazaar? Do you know about OpenCart?",
				"added": 1577919710
			}
		],
		"1575530407_1NHiaCL2VFiEeiQZcaR3LMnJ53tkepwY9T": [
			{
				"comment_id": 41,
				"body": "Cool",
				"added": 1577930677
			}
		],
		"1578034470_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 42,
				"body": "Americans are the terrorists.\nThere's nothing I can do to stop this.\nI'm a prisoner of war in my homeland.\nOur economy is murder.",
				"added": 1578077696
			}
		],
		"1578079566_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 43,
				"body": "War is murder. If I weren't on the Internet and isolated from like-minded friends, we might be playing music on the radio, working in our own corporation, hiking the mountains, building fast cars, or constructing nice homes together.\n\nThere hasn't been much benefit from war. I feel isolated, targeted, and unproductive as most I love are scared into subservience and trade their lives for feelings of security in a world they have been powerless to fix. Opiates and television numb us and with enough time we forget we were ever at war until long after we are made the target.\n\nMy parents have already succumbed. The friends I do have are pitted against each other via the Internet, media, and politics. If we are not caught in debt, our greed enslaves us until even the closest of friends tear each other apart. Whenever we wake and try to escape, we are pummeled by those sworn to protect and serve, then betrayed by employees who \"just want to keep you safe.\" \n\nI tried smoking weed to ignore all that I cannot change, then was slammed with a DUI and am in the process of losing my license to drive.\n\nI don't want to make money. I don't want to follow the same path as the scared-ones who came before me. I don't want to support our government nor be goaded into taking benefits for avoiding abusive employment.\n\nWar is at the door and many are set to profit from the murder and plunder. I'm trapped in a world I have never been able to control and am watched by those I've trusted who have become too complacent and scared to change the world they grew up hating.\n\nIf we had any decency or respect for human life we'd bring the troops home instead of worshipping their deaths and then stop wasting tax money on the American War Machine.\n\nWe cannot get out. We cannot get out.",
				"added": 1578112005
			},
			{
				"comment_id": 44,
				"body": "Russia, China, and Iran conducted joint naval exercises in the Gulf of Oman 8 days ago.\n\nhttps://www.cnn.com/2019/12/27/asia/china-russia-iran-military-drills-intl-hnk/index.html",
				"added": 1578113196
			}
		],
		"1578081567_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 45,
				"body": "I want to plant a garden, scatter flower bulbs, breed rabbits and spread them all over, grow trees, ride my bicycle, develop open source software, design and manufacture useful products like electric vehicles and microprocessors, and help others live in peace and enjoy prosperity.\n\nThis war talk is propaganda meant to radicalize otherwise average citizens and fellow humans.",
				"added": 1578201128
			}
		],
		"1578131377_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 46,
				"body": "Grow marijuana, collect books, gather tools, and preserve food.\n\nIf they come for us, that's that. Oh well, game over.",
				"added": 1578201344
			}
		],
		"1578202687_1JGiVKenWPWgSZpRgNufyk9TAEp67HzaPm": [
			{
				"comment_id": 47,
				"body": "Create a blog with product pictures and QR codes attached to smart contracts for payments & returns.\n\nIf anyone clones you page and doesn't change code, smart contract will return funds from bad orders.",
				"added": 1578238905
			}
		],
		"1578244855_1M1qF4xa5hYtGE1BikxTpZxLtAyQRXsJ4v": [
			{
				"comment_id": 48,
				"body": "The USA is controlled by the highest bidder, which is why we are exacting the will of Saudi Arabia in the Middle East.\n\nHow do we citizens become anything more than cattle? I have been herded my whole life and I don't want to be slaughtered!\n\nEither constitutional convention or civil war and I choose the former. Is there another option?",
				"added": 1578256867
			},
			{
				"comment_id": 59,
				"body": "> [tolabek](#comment_1_1FXbJgjR6s6drGFzrkouioCfF6MucYZjb5): simple? \n\nI would walk occam's razor and pull aid to Israel, let China's interests be exacted (including the silk road), allow oil prices to do what they may and affect US markets how they will. \n\nWe must innovate at home to stay relevant and embolden our economy without negatively influencing other nations, even if that means sacrificing some American comforts for a time.\n\nI've been living a relatively humble lifestyle, tightening my belt and budget for the last decade I have lived on my own and if other American's did the same, we could work together to build a better country together at home instead of expecting the economy to be stimulated by manipulating foreign nations.\n\nThe middle east seems overly complicated because of what the allies did after WWI with the league of nations, the sikes-picot agreement, and the palestinian mandate, which drew arbitrary borders in the collapsed ottoman empire and setup puppet leaders who benefited western interests. Such interests were supported like ending the Israeli diaspora.\n\nWe made a mess attempting to rid the world of Islam and yet Islam continues toward the goal of being the one world religion to this day.\n\nIslam allows for other religious practices within their central tenets, so I don't see what the big deal would be to allow global expansion for as long as the rights of other religions and nations are upheld. What's wring with being a Christian Muslim or an Atheist Muslim or whatever? The pillars of Islam seem reasonable enough.\n\nI was raised religious and I find peace and health in prayer, fasting, and alms-giving. Many reject religion simply for the sake of intellectual purity. I find peace and prosperity more important than requiring adherence to the greater good.\n\nEven if I have to fake my beliefs on the outside to maintain my inner peace, that's what I have to do with government and authority of every kind anyway, so whether it's Islam or the US federal government, all authority/religion requires outward expressions of\tbelief that I will never 100% agree with internally, so what does it matter?\n\nSure, Islam might be rough on women and the US may murder innocents worldwide, but that's the importance of tolerance and showing goodwill to all manner of faith, whether in government or religion or science or spirituality, they are the same.\n\nI'm sure you may disagree and demand purity, but who cares? Live and let live. We will build and rebuild as necessary.",
				"added": 1578362823
			}
		],
		"1578268512_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": [
			{
				"comment_id": 49,
				"body": "Go to the gates of your closest military base and camp out. Say what you think is wrong if you get asked. Hold a sign if you don't want to talk.\n\nLet them arrest you. Whatever. This place is already a prison you can buy oil from Saudi Arabia to drive through and sell your life to buy hamburgers and burritos. Nobody is free here and there are paid authorities who will guarantee you free access to demonstrations where you're the lead actor.\n\nGive up. We were born slaves. \nNobody is coming for us. Nobody cares.\n\nThe most you can do is get out and warn others or get arrested trying.",
				"added": 1578274609
			},
			{
				"comment_id": 51,
				"body": "> [consus](#comment_4_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3): better to die\n\nThen all of us Americans were born to die. There's nothing left to build for anyone whose life matters enough to justify the resources they will consume.",
				"added": 1578277481
			}
		],
		"1578276840_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 50,
				"body": "> [hferbwauif](#comment_48_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP): what are you even talking about you stupid nigger\n\nIf you are American you are a liar and profit from deception and aggression.\n\nYou seem to be following along quite well!",
				"added": 1578277228
			},
			{
				"comment_id": 52,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1549_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you just said \"I\"\n\nI try my best not to lie and I cannot speak for you, yet every American I have known is either deceived and spreading lies or a lying deceiver.\n\nOur public schools do not teach truth. Our media broadcasts propaganda. Our leaders profit by misleading us.\n\nYou live in a false world, distracted from pain by drugs, TV, and Internet.\n\nI am sober for too long now I see.",
				"added": 1578278631
			},
			{
				"comment_id": 53,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1550_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): If you say so.\n\nFiguratively, of course: I wear glasses.\n\nTell me something good about this country that isn't based on lies, deception, or propaganda--please!",
				"added": 1578280153
			},
			{
				"comment_id": 54,
				"body": "> [duende](#comment_137_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): Kill\n\nThat's what got us into this mess.\nLet's kill the Constitution and write a better one.\n\nIt's either constitutional convention or civil war.\nI'm for the former.\n\nAre there other options?\n",
				"added": 1578281286
			},
			{
				"comment_id": 55,
				"body": "> [robione](#comment_376_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): the constitution is [...] not being upheld well.\n\nWhether or not that is true, the constitution of the US has failed to prevent the overbearing oligarchy we have now.",
				"added": 1578288309
			},
			{
				"comment_id": 57,
				"body": "> [quantumkitty](#comment_359_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): If you want change\n\nWe have the Internet and can unite in seconds instead of days, or even months as in 1787. What is stopping us?",
				"added": 1578336382
			},
			{
				"comment_id": 58,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1555_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): me\n\nWe were born with \"all the rights\" and anyone who says otherwise is selling something.\n\nYou live in podunk nowhere, so what do you have to lose and what do you have to contribute? Nothing, apparently.\n\nCan you answer my request from before? What good is there about America that isn't stolen, deception, propaganda, or lies?",
				"added": 1578338566
			}
		],
		"1578318465_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 56,
				"body": "Can you imagine how many problems would be solved by taxing porn, prostitution, marriage, and childbirth? Add a land tax, rent tax, and consumption tax while removing income, property, gains, and all other taxes and wow.\n\nPublic displays of sexuality in advertising and media would drop unless heavy fines are paid. Nice.",
				"added": 1578336044
			},
			{
				"comment_id": 62,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1568_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): fascination 'with the weakest'\n\nI see how catering to society's lowest restricts development for all. My own successes have been overshadowed by the failures of others to the point I don't care to succeed anymore.\n\nMany of my talented friends have turned to drugs or suicide due to depression from restrictions on personal progress. I have considered the same.\n\nWar keeps the needy and impoverished populations under control, education offers knowledge to advance, and the republic allows us to feel we are in power. I see no point in voting, since we the people see each other as plebs.\n\nWhat purpose is there in improving if we are all but livestock? No matter capitalism or communism, religion or government, civilization or barbarism, we are subject to each other and serve one another. Slavery never ends, yet we are born free. When does the deception begin?\n\nDemocracy fails. Taxation is extortion. Order is deception. Are we all better off led by the lowest or the greatest among us?\n\nHow much do I give to others or keep for myself? Where is life worth living if not here?",
				"added": 1578430352
			}
		],
		"1578341356_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 60,
				"body": "If the US could tax porn and prostitution, we could fund scientific research and even eliminate the income tax.\n\nBanning porn is what I do by default. I believe abstention and discipline to be necessary for a happy and healthy lifestyle. I am not opposed to sweeping mandates which ease the load of my mental moderations.",
				"added": 1578364316
			},
			{
				"comment_id": 61,
				"body": "> [duck0](#comment_180_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): taxation is extortion.\n\nDo you avoid paying the IRS somehow?\n\nI'd rather porn watchers pay than anyone else, except maybe married people and breeders: have them pay most.\n\n> [styromaniac](#comment_1617_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): derailing\n\nYeah, my bad. ZeroUp and all the porn bugs me, too. There're good books, videos, and docs, though too.",
				"added": 1578366387
			}
		],
		"1578266325_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 63,
				"body": "> [barnstokkr](#comment_20_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w): Wake up.\n\nAnd then what? I get pummeled by authorities every time I try to do anything unwanted or exercise freedom of any kind, then I must show up to their courts or am pursued for imprisonment and captivity.\n\nI woke up and realized there's nothing I will be able to do without being put to sleep.",
				"added": 1578432379
			},
			{
				"comment_id": 64,
				"body": "> [barnstokkr](#comment_21_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w): Correct\n\nI'm going to write a letter to Kim Jong-Un to send dank weed.",
				"added": 1578432533
			},
			{
				"comment_id": 65,
				"body": "> [barnstokkr](#comment_22_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w): You haven't done anything significant to effect change. Insurrection is all that works.\n\nI bend the future to my will and build community, gardens, my tech business, and open source software in preparation for the failure of government. \n\nViolence leads to violence, so insurrections always fail. You will not succeed with aggression, as that is how the established powers prefer to play.\n\nThis platform effectively drowns the media. Learn another language. Build up your neighborhood. Creation is more enduring than destruction.",
				"added": 1578433085
			}
		],
		"1578444583_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 66,
				"body": "What should my sign say that I hold in front of commuters at the gates of the local military base?\n\nI'm with stupid 👉🚘\nThank you for your murders 💀⚰️\nHow awful war is. Think of the waste. 🗑️🌍\n\n\"Just finished reading the Koran – a good book and interesting.\" General George Patton",
				"added": 1578454519
			}
		],
		"1578585187_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 67,
				"body": "Thank you for thinking, listening, and communicating. I appreciate your life. We are on our own enjoying chance encounters.",
				"added": 1578636374
			}
		],
		"1578622228_1Hrz1rynf2scp9MZ7Abt6FfRgUMCmZ8H2v": [
			{
				"comment_id": 68,
				"body": "We are seen as the terrorists worldwide, Iraq voted for us to leave, the US already shot down a civilian airliner, the missiles at the Iraqi base had no casualties after ours took two leaders and others, and if we reacted we would prove ourselves to be in the wrong, leading the rest of the world to be against us.\n\nReacting would have led to WWIII in the US and we are still walking a razor's edge.",
				"added": 1578637128
			}
		],
		"1578668599_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 69,
				"body": "Do you have a blog or a zite of your own to gather your information? More are coming to zeronet and the decentralized web is taking off. Zerotalk will not be easily navigable soon and will no doubt be replaced by a platform which supports more users.\n\nWhy the exclusivity? I understand your detestation for the religious, whether government or god supporting, yet I do not know why you are here and why you feel the need to storm off while making a big production.\n\nIf zeronet is being overrun then you have not succeeded in undermining and awakening...",
				"added": 1578674358
			}
		],
		"1578551830_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 70,
				"body": "I spoke with her last night after she wanted to start a conversation, in which she made assumptions about my ex and me, declared she is not looking to have a baby and be left, said she hasn't helped with the bills because she isn't comfortable, told me I am using her, and said I must ask her if I want something from her because she will not know nor will she think of ways to help. Plus she does not want to hear me complain about the pills she takes every night.\n\nThis got me frustrated and I explained that I have been making food and been providing for her, not approaching her with tasks nor asking for favors, sexual or otherwise, because I haven't wanted her to feel used, yet she feels so anyway. So I told her she can't feel like the only reason we're together is to have a baby or I will never be motivated to have sex with her and will continue  to require her to make all advancements toward intercourse. Furthermore she must make herself comfortable and pay rent regardless unless she wants to find a new place to stay. I get tired of the loopy behavior and I think the pills she takes degrades her ability to reason.\n\nOf course this is not what she wanted from the conversation so she was upset. I put in headphones and got on my phone once she started making assumptions about my past and my desires toward her regarding sex and family. We watched TV for an hour before she went to bed and I continued reading news articles.\n\nShe woke with a nightmare and told me demons were misusing her body so she had to tell them to stop. I told her good job and sent her back to bed, though she was clearly flustered and probably horny. Oh well, not my problem. She's getting a pap smear and std check soon because I believe she is infected with parasites and that's another reason I don't want to have sex. STDs want to be spread and I'm not about to let that happen, no matter how hot she might be.\n\nAnyway, I think honesty works so we'll see if she makes herself into a victim or decides to take responsibility for her desires instead of blaming me for taking care of her and being responsible. She agreed to $600 of back-rent and told me her medical bills are paid, but I don't want the relationship to be about money as much as I want her to be a stable, responsible, happy, and mature adult instead of rushing into parenthood without a plan, a savings, or a healthy mental state.\n\nIf she can forgive me for not getting her a Christmas present, opens a joint checking account with me, and brings home a sack of weed then I'd forgive the prescription pills and rent up until last month. Hopefully she understands where I'm coming from, as I have been painfully sober and detoxing my body, arranging our home and lives for a better future we can both enjoy.\n\nI don't want to be bitch dependent, so if conditions don't improve, I'm\tout as soon as she signs a lease. Hopefully none of yall\thave figured out who I am nor are you doing any snitching for her 🤪",
				"added": 1578675395
			},
			{
				"comment_id": 74,
				"body": "She left me. Goodbye. Good luck. I guess I won't be getting that rent money, cheap ass crook. \n\nShe only liked me when I was high and easy to handle.\n\nI'm going to miss that woman, even if she is a pain in the ass.\n\nI get it now: she used me for my address to distract the bill collectors\tand\tto get free rent. Rude.",
				"added": 1578827202
			},
			{
				"comment_id": 85,
				"body": "She came back with last month's rent. I separated our rooms and she keeps threatening to leave so I let her sleep in my bed that I left in her room and I sleep on the couch.\n\nWe keep fighting about how she used to be a slut. I cut all the fixings for an omelet and she couldn't make it, so I walked out and she quit and pouted on the couch, yelling at me in the bathroom. I asked her to teach other women, including my ex, the benefits of not being a slut anymore, which made her upset.\n\nI flipped out at her for being illogical while I made breakfast. She said I don't value her and act like her friends used to back when she was in 9th grade. I told her that sex and being happy are less important than resolving problems and becoming better, so I left and did my language lessons in another room until she interrupted me and said she was going on a walk because I don't love her.\n\nWhen she got back she's acting high on meth and wanting to be left alone, so now I'm just sipping on whiskey in my room because she won't let me smoke pot anymore.\n\nDo I love her? Yes, but not how I loved my ex-fiance. Since then I've learned to not trust nor unconditionally love anyone. \n\nAdmittedly, I have little sexual prowess and do not care to become better nor practice because I've spent 30 years focusing on refining skills that pay bills and I'll never be a pimp nor slap a 'bitch.' This is housewife training and there is no living rent free. I will abort every baby until after we're married and would prefer to never have sex until we're engaged. Masterbate and stop seducing me. If she doesn't like it, please leave.",
				"added": 1579473231
			}
		],
		"1578779457_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 71,
				"body": "Get out while you still can. Rent is a lie and will inevitably lead to more trouble than it's worth. I'm speaking from experience and I can't wait to get out of the landlord business.\n\nLet your parents figure out their own lives. Don't expect anything from them, though. They will squander you just as they wasted their own lives getting us all into this mess. Time for them to pay the piper.",
				"added": 1578803515
			}
		],
		"1578781307_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 72,
				"body": "A UBI follows the script for our failing economy and corrupt government. \n\nFixed income for all will inevitably widen the gap between rich and poor as rents increase, prices rise, and the dollar continues to lose value. \n\nThe best we could hope for with the UBI is to buy us some time to rebuild our government and provide a social safety net for those getting laid-off as the economy continues to implode.\n\nOur conversation needs to turn to rebuilding the nation into one that is worth defending which fosters business and culture.\n\nUBI is a death sentence that will further enslave the US population and lead to either civil war, invasion, or something worse we cannot yet imagine.",
				"added": 1578809100
			}
		],
		"1578817237_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 73,
				"body": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2725874\n\nhttps://www.aafp.org/afp/2004/0301/p1161.html\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC3104918/\nhttps://www.ncbi.nlm.nih.gov/m/pubmed/18509826/\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC3723597/\nhttps://journals.plos.org/plosntds/article?id=10.1371/journal.pntd.0002200\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC6253560/\n\nI have many more sources of similar information.",
				"added": 1578823351
			},
			{
				"comment_id": 75,
				"body": "https://www.who.int/news-room/fact-sheets/detail/taeniasis-cysticercosis\n\nhttps://abcnews.go.com/Health/teen-dies-parasitic-infection-related-pork-tapeworm-cysticercosis/story?id=62034692\n\nhttps://globalnews.ca/news/2318544/man-complains-of-headache-doctors-find-tapeworm-larva-living-in-his-brain/",
				"added": 1578828236
			},
			{
				"comment_id": 76,
				"body": "I and my ex fiance were infected and have been experiencing symptoms for 3 years in graduated degrees of intensity. First affected was my appetite and libido, then lethargy, rashes, hives, forgetfulness, hair-loss, and depression. I never had a problem eating anything until I contracted herpes from my woman who played around and didn't tell me.\n\nMy most recent girlfriend infected me with trichomonas, which affected my memory and ability to remember symptoms I was experiencing over time. I was smoking pot to relieve stomach aches and anxiety, which successfully removed the majority of symptoms. \n\nNot until I created a log of my experiences, symptoms, diet, and moments of forgetfulness was I able to correlate pork consumption with my disease, as well as identifying the herpes and trich. \n\nAfter researching and determining my diagnosis, I formed a treatment regiment. For over two years I blamed cannabis, so in May 2019 I first took a two week dose of amoxicillin and a break from pot to form a baseline. I waited a month to rebuild gut flora, eating yogurt and kimchi daily when stomach pains arose. Then I took a 5 day dose of metronidazole to target the trichomonas. My libido was raised from flatline and my forgetfulness was improved. Over the next few months I experimented with small doses of fenbendazole to find a dosage that had an effect. During this time I began singing, dancing, and playing music again.\n\nAfter about 90 days from the anti-biotic treatment I took a month long abstention and week long fast to monitor the effects. I endured the strangest manifestations of the disease during this time and while traveling the Oregon mountains, sleeping in my truck, as a dozen pimple-sized blisters formed on the spine of my neck, which ruptured with cerebral spinal fluid and with what felt like some long, thin worm wriggled out and spat either eggs or venom of some kind, as little pimples formed around the protrusion.\n\nAt this point I had encountered half a dozen small worms around my neck and I knew I was not dealing with any side-effect of cannabis!\n\nMultiple times I caught worms between my fingers behind my head, only to have them retreat back under my skin. I was taking 500mg of fenbendazole for 3 days when this occurred in August 2019.\n\nI then returned home from traveling, having broke my fast and smoking a joint at the end, to continue with 5 days fenbendazole at 250mg with pyrantel pamoate on day 1, praziquantel 1g on day 2 and 3, 2g on day 4, all orally. I pooped a lot, so I was drinking plenty of water and coffee. My diet consisted of cereal, eggs, beef stew with potatoes, and chicken and rice.\n\nAfter 3 days I took 250mg of fenbendazole for 7 days, a 3 day break, then 2g metronidazole 1 day, then 4g the next day.\n\nAt this point I was single and thriving! I bought another house and immediately began making repairs. Once I started dating my girlfriend again in September after 5 months apart and her multiple\tstays in mental hospitals, I was reinfected and lethargic. Daily cannabis usage turned from lifting my spirits to fueling lethargy.\n\nIn October I was experiencing symptoms again, depression set in, and anger came easily. We moved back to my other house and I was too depressed to go out much or complete goals for two months. In December I got in an auto wreck and was quarantined in the hospital for 3 days where they wanted to drug me and tried to sell me on all manner of pharmaceuticals for mental health, which I refused. Once asking about parasite tests for worms I was immediately discharged. They claimed to not have any tests for such.\n\nNow I am home again and have begun doses of ivermectin and praziquantel. Libido has improved (I am masterbating to avoid contact with my probably-infected girlfriend), memory loss is diminishing, concentration improved, attitude positive, hair-loss reversing, and rashes decreasing. I threw up a fist sized amount over 6 hours, including blood. There have been twitches around my lower ribs and heart, around my scrotum, bladder, and colon. My girlfriend got mad at me for throwing up all night and left this morning.\n\nI am recovering again and am through a month break from pot, though I want a joint pretty badly I will continue. I'll be adding fenbendazole to my regiment ( 1g praziquantel in the morning with 10mg ivermectin, 250mg fenbendazole in the afternoon, 1g praziquantel before bed).\n\nOverall I am disappointed in US healthcare institutions which have misdiagnosed me for profit over the last 3 years and in my past girlfriends for being loose, leading to my degraded immune system. I believe I will recover.",
				"added": 1578857201
			},
			{
				"comment_id": 84,
				"body": "This parasite --these creatures in our bodies and minds-- they want to kill and eat us. They want us to kill and eat each other.\n\nI have been successfully diagnosing myself. I need medical attention I cannot afford and I don't want to live a life of debt and poverty. Doctors aren't solving the problem, rather treating with profitable prescriptions of anti-depressives and the like. There is a solution. We don't have to die. \n\nInfected people have certain traits, like yawning strangely and inappropriately, forgetfulness, losing appetite, loss of ambition and lethargy, depression, pain in ribs and/or colon under bellybutton, butt itchiness and sores, popping/stretching/gargling sound from throat and guts.\n\nI threw up a fist load last week into a bowl over a 3 hour period and had blood and eggs and worms in my vomit after burping occasionally and feeling gurgles from all over my body. I set a password in the morning and was unable to remember it after sleeping. I am working on restoring my brain health and eliminating the worms on my own but I need help that I am not trained for. Many are infected and do not know. We have been targeted. This is genocide. My own mother is diseased and in the captivity of my father. Please help us! \n\nThe depression is not our fault. The food we have eaten is corrupt. We deserve a chance to live. I did not choose this. I have been working my whole life to learn and grow and share. Please!\n\nHealthcare is wrong in the USA and we are not being treated, rather left to rot like pigs and sheared for our labor and wealth like sheep. This maddening situation is not stopped by death nor silencing detractors. It's the food! If something is not done only the rich will survive and if we are spared they are set to profit greatly. Street drugs are cheap and work to eliminate symptoms for those willing to risk getting caught and thrown in prison. Since I am not willing to break the law nor accept government benefits I am suffering tremendously.\n\nThis is hell.",
				"added": 1579359696
			}
		],
		"1578699066_1CCh1G3AX8DRk9Fehp28Vevreid7GgLCjj": [
			{
				"comment_id": 77,
				"body": "Grow pot or spread mulch. Where's your hustle, bro? Stop trying to steal from me and I might buy your shit.",
				"added": 1578877463
			}
		],
		"1578888717_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 79,
				"body": "You could contribute to bicycle surplus in your region and make the world less shitty instead of being racist online.\n\nDo you have a bicycle collective in your area?\n\nWhat is wrong with you? And don't try to blame others when you tell me. Are you looking for charity?",
				"added": 1578939114
			},
			{
				"comment_id": 81,
				"body": "> [mj6cp7czwnhyzxkp](#comment_17_1KMFhezc9fqBCbWg8xbu6HimdG5nMSQwBD): Killing works.\n\nCan we kill those in government who steal from us? Gotta make an example and rid the world of corruption. Word will get around. We need to make a sign out of them.\n\nBankers who enslave people with debt and employers who take more pay than those who earn the money for them could be added to the murder list of thieves, too.\n\nLet's start leaving smartphones in rich neighborhoods for wealthy kids to steal and watch what happens. \n\nYou think black people are thieves by nature when this entire country was stolen from natives by white colonists. Of course you want to start killing--That's all you know.",
				"added": 1579147486
			}
		],
		"1578995205_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 80,
				"body": "I can't find raw materials. Jobs outside of government influence have dried up. Economics have created class separation with wages and prices, creating a caste of working-class slaves who will never own a home nor make enough to support a family without subsidy.\n\nPost-scarcity is a fiction we are sold in cardboard boxes.\n\nYou have been programmed to accept a subroutine of subsistence since your youth. Public schools monitor and record you while filling your mind with propaganda, preventing you from direct access to the world, wasting your time teaching you to sit and submit.\n\nThere is no post-scarcity, only blinders that shackle your creative mind from wanting more than you are allowed.",
				"added": 1579033988
			}
		],
		"1579144407_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 82,
				"body": "I've already been prescribed anti-depressants and I refused to take them. Marijuana was working great and now I'm not allowed to use that anymore.\n\nEveryone always wants to fix my situation with pills and therapy when the cause of my attitude is outside of me. This country and those who support it are sick. Their mental gymnastics, selling out ideals for money, and willingness to destroy the environment and foreign nations for comfort and security leaves me completely unwilling to uphold what they have created.\n\nInstead of blaming the kids you brought into the world you broke for feeling shitty because of what you've done, try listening to us and fixing this wreck before we both lose it or one of us betrays the other. Call me cynical, but I bet it'll be you.",
				"added": 1579149387
			},
			{
				"comment_id": 83,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1717_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you still don't get \"we build the society\" not others.\n\nI have already built society. I saw how the healthcare and defense systems run. Employees do as little as possible, distracted by their computers, then go home to take pills and watch TV, have sex, complain, and repeat the day again.\n\nWhen I was a youth I saw I am a strong one. I played sports and worked on computers to keep from distractions of people and vices. Before 20 I started a business and bought my first house before 25 because I had no friends and no distractions.\n\nIn my 30s now I see a decaying world which I helped create. Faces are in smartphones and few hands know how to use tools.\n\nWhat economy can I rebuild? Am I expected to figure that out for everyone now, too? To take the risk as I have for my whole life which nobody else was willing to do? I have what I need and winning more would lead to a life of opulence and wealth that is beyond my desire which my peers will undoubtedly expect me to sacrifice for their sake.\n\nThis world is what was asked for. I built it and I lament my labor. Now I garden and help the indigenous prepare for the collapse of colonialism.",
				"added": 1579201806
			}
		],
		"1579558261_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 86,
				"body": "How about the wire gauge? Too small of wire will exhibit what you are describing when the power drops under load due to heat resistance.",
				"added": 1579571011
			}
		],
		"1579442143_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 87,
				"body": "Can you do more than insult? Are you working on projects that you want to share? Do you have personal stories unrelated to those online?\n\nPlease change your tune and stop lashing out at others.",
				"added": 1579648500
			}
		],
		"1580015834_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 88,
				"body": "This is asymmetrical field energy; potential energy extraction from a vacuum; unifying field theory.\n\nMaxwell's theories, summarized by Heaviside, manipulated by Lorentz, and passed onto university electrical engineering students who learn a flawed understanding of field energy which shapes our modern world.\n\nWe must undo more than a century of misguided science in order\tto prevent energy related catastrophe and further environmental damage.",
				"added": 1580125655
			}
		],
		"1579890100_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": [
			{
				"comment_id": 89,
				"body": "Jesus b.1152 d.1185 ad, named Andrey and born in Crimea by caesarean section.\n\nVery interesting. History has never felt accurate in all my readings. Thank you.",
				"added": 1580127704
			}
		],
		"1580551703_1G5J3JZZ6SZtdsSAS3etngxaTXjcNg25ge": [
			{
				"comment_id": 90,
				"body": "It's Fib-ruary!",
				"added": 1580587673
			}
		],
		"1585269932_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 91,
				"body": "Look at the giant chains behind the wiki photo of Isambard Kingdom Brunel: https://en.wikipedia.org/wiki/Isambard_Kingdom_Brunel\n\nThe year was 1857.\n\nHow has man fallen so far in 163 years from steamships, railroads, and bridges? What has become of us?",
				"added": 1585291868
			}
		],
		"1601047977_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R": [
			{
				"comment_id": 92,
				"body": "http://sandlab.cs.uchicago.edu/fawkes",
				"added": 1601772228
			}
		]
	},
	"comment_vote": {
		"48_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU": 1,
		"5_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"51_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"4_1L4PrPHHR8HnHUggZiEYr3VKZUkxAshbKV": 1,
		"3_1Gvs3AKBY5YjUMPchHuoQuAYnWApBm1myY": 1,
		"8_16cUVejYswnQhxY6LRP6ftoC9WezKzpKbe": 1,
		"59_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz": 1,
		"67_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz": 1,
		"49_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU": 1,
		"10_1btdnzDG8dG58aW9vnKWmCHV59dNTJfn7": 1,
		"165_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"21_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"21_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"1490_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1491_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1497_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1500_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"271_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"72_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"37_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": 1,
		"6_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": 1,
		"366_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"118_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"81_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz": 1,
		"502_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"22_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"23_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"374_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"1496_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"45_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": 1,
		"1_1MHt7kHieXeogoLntiLkqeBh1uVh9wW4Ly": 1,
		"327_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"11_1KRJTDNcfHhogWdZRoMSkfS1FZoCCPvjer": 1,
		"1_1JGiVKenWPWgSZpRgNufyk9TAEp67HzaPm": 1,
		"1546_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"208_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"12_1KRJTDNcfHhogWdZRoMSkfS1FZoCCPvjer": 1,
		"7_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": 1,
		"7_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": 1,
		"17_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": 1,
		"20_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": 1,
		"24_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": 1,
		"25_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": 1,
		"26_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": 1,
		"389_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"211_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"25_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"24_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"23_15MBFYLT1rsDL4pqRBzg3rvpJCppox8Yd8": 1,
		"337_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"392_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"18_12geqRc1Rut17RTkX3gxMYSujKdUNwP68R": 1,
		"5_1Fct94e4PRpnXyWzFi679369yUL6aKrsej": 1,
		"27_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"67_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": 1,
		"1712_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"29_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"420_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"655_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"424_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"137_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"656_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"48_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12": 1,
		"19_1KMFhezc9fqBCbWg8xbu6HimdG5nMSQwBD": 1,
		"40_1KMFhezc9fqBCbWg8xbu6HimdG5nMSQwBD": 1,
		"20_1KRJTDNcfHhogWdZRoMSkfS1FZoCCPvjer": 1,
		"423_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"51_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": 1,
		"894_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"454_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"79_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn": 1,
		"29_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"76_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": 1,
		"10_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R": 1,
		"7_18F1Ga3hcY5ZSPoD5jeFow6w7uHyRtocdf": 1,
		"13_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": 1,
		"12_15jw9ZPqZMYeM13banimWKeyYD3KnRUgwi": 1,
		"67_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1,
		"35_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"1054_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"3_15qd4fz3C9LHhCS81pjMT5u1vZCA5T2udW": 1,
		"1_1Ckkm8Pr16LLTRyejYPCQhhD1vAiUANMUX": 1
	}
}