{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Очередные вопросы нубов.",
			"body": "Задаём самые идиотские вопросы, отвечаем на них, бугуртим. Собственно, мой первый вопрос таков: зашифрован ли трафик зеронета хоть как-нибудь сам по себе, если он идёт не через тор, или всё хуярится плейнтекстом?",
			"added": 1524874595
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1_1HjPcm98huSQdRkf5F1VQs4w8caUgq6eA": [
			{
				"comment_id": 1,
				"body": "Не видел чего-то подобного по функционалу. Максимально близким могу назвать i2p, но там проблема в том что сами сайты хостятся на одной машине, которая если упадёт, то всему сайту пизда. Нет распределённости, но зато есть шифрование и полная анонимность. Бикер я пробовал, но он больше подходит для раздачи файликов, чем для создания полноценных сайтов, потому что там можно только статических страничек наебашить. У всех файлов есть история версий и можно достать файл любой версии. Скорее это своеобразная децентрализованная замена Git, в общем-то сам протокол Dat уж очень напоминает гит по своей структуре.",
				"added": 1524873899
			}
		],
		"1_1LUMCFAnp4YvKKufrot9Weq15gDvRrQUCu": [
			{
				"comment_id": 2,
				"body": "Шапку из фольги уже надел?",
				"added": 1524874125
			}
		],
		"5_1E4vzAAE4vRWc4TnnDJiJ5SvbNTq17emb": [
			{
				"comment_id": 3,
				"body": "https://hub.docker.com/r/schors/tgdante2/",
				"added": 1524874199
			}
		],
		"1_1H6rUrbroXkZvGGjVwmtjqCmA8iWVhZ5ZR": [
			{
				"comment_id": 4,
				"body": "> [nicolaith](#comment_7_1EA2A9K7M1agtM6gE2MWtiF26dYcaSLbh): 3proxy\n\nМне больше CCProxy понравился.",
				"added": 1524874294
			}
		],
		"1_16ViRrCEqRCH6tyZekTUzyLtYQTtNAW1RY": [
			{
				"comment_id": 5,
				"body": "> [balancer73](#comment_347_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Не знаю, зашифрован ли открытый трафик, но какой смысл его шифровать? В ZN же все данные по самой сути открытые и отдаются любому запрашивающему. ZeroMail шифруется ещё до передачи.\n\nСмысл на самом деле есть, особенно учитывая российские реалии, где трафик каждого скоро будут снифить. Если трафик идёт прямо в чистом виде, легко вычислить, что такой-то абонент пользуется зеронетом, заодно и содержимое легко поймать, в случае же наличия шифрования, с энного пк просто отправлялись бы абракадабры на рандомные адреса. По крайней мере, это защищает от пассивных атак. Понятное дело, что тор решает эту проблему полностью, защищая как от пассивных, так и от активных атак, но и шифрование обычных зеронетовских соединений не помешало бы.",
				"added": 1524883374
			}
		],
		"2_16LkVPwKk9BRw1dzV241FPrPCcmw7effZo": [
			{
				"comment_id": 6,
				"body": "> [gluckman](#comment_19_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy):\n> Также весьма вероятна фашизация режима, как минимум до уровня украинского,.\nКак там в 2010-ом? Она уже вовсю хуярит не переставая.",
				"added": 1534373143
			}
		]
	},
	"comment_vote": {}
}