{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1605027510,
			"title": "People who still believe in this corona hoax should have no right to comment online anywhere or to vote or have any authority in this world",
			"body": "This is all so tiresome. When do the sheeple finally shut up and accept that they have never any idea what is going on on this planet?",
			"added": 1605027509
		}
	],
	"topic_vote": {
		"1605027510_15BPbETpjWmZoVdS4YGMg4qWiguXi1ASGz": 1
	},
	"next_comment_id": 9,
	"comment": {
		"1605027510_15BPbETpjWmZoVdS4YGMg4qWiguXi1ASGz": [
			{
				"comment_id": 1,
				"body": "Why? Maybe there should be a test of proofing that one is capable of thinking logical. But it should be more something like a physical fight, so nobody can make a stupid pc test, which would just prove that you're politically correct and think what the \"elites\" want from you.",
				"added": 1605028247
			},
			{
				"comment_id": 2,
				"body": "Politically Correct: You're politically correct, if you always agree on any topic which is hold by the highest authority, while you have no arguments based on your own experience but only on this authority.",
				"added": 1605038604
			},
			{
				"comment_id": 3,
				"body": "> [bigbadbob](#comment_1193_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): People do not need rules regarding their speech, thoughts, beliefs, etc.  Corporate media is mind pollution and dumb laws should be ignored.  The best way to deal with control freaks and psychopaths is to ignore them.  They can shove their fake crisis's and fear mongering straight into their pee holes.\n\nThis is all true. But big media could not exist if mindless people have no voice. Without those who support big media there would be no big media. Any time big media announces an agenda and then these idiots jump on the band wagon and comment in support of the agenda, big media gets stronger. These people feed it. Without their feeding, big media would die no matter how much money the owners of big media throw at it.\n\nI know there is no easy solution to this problem, but it should be discussed anyway.",
				"added": 1605091369
			},
			{
				"comment_id": 4,
				"body": "Ok, I must admit that, I was just rage posting. Because I still can not get it, why still so many people among the internet believe this horse shit and comment in its favor. It should be better questioned, why in the world do these idiots still believe in this hoax and what can we do about it?",
				"added": 1605101107
			},
			{
				"comment_id": 5,
				"body": "It may sound stupid but maybe we need some kind of counter-cult to beat the news. It is not the news alone, it is also the people who support the news. Maybe we should call them \"news nazis\" or maybe \"mainstream nazis\".  They should just feel ashamed whenever they clueless repeat the narrative of fake news. The same way they did this with anybody who disagrees with fake news all the years before. Better ideas?",
				"added": 1605103931
			},
			{
				"comment_id": 6,
				"body": "> [ksnde](#comment_46_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji): Wikileaks declassify everythingENJOY\nIt seems that it can not. If it would,  all idiots wouldn't still believe in the hoax.",
				"added": 1605118183
			},
			{
				"comment_id": 7,
				"body": "ok, what happened today?",
				"added": 1605130336
			},
			{
				"comment_id": 8,
				"body": "> [bigbadbob](#comment_1196_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): All people could do is ignore them completely.   It's easier said than done.  I get sucked back in all the time because they are expert trolls.\n\nAh, didn't even read your comment because of  **ksnde **(spammer?) . Yes ignoring is good, but seems like impossible. People want to know \"what is going on\" so they will be always be prone to news of any kind. So calling them \"fake news\" to give them a worse image seems not to be enough. People need a source of real trust for new information.",
				"added": 1605130896
			}
		]
	},
	"comment_vote": {}
}