{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "狗鸡鸡",
			"body": "http://127.0.0.1:43110/1K6pAEUkroJyv8Le4MXhQ9iHZSkFNxkvn5/",
			"added": 1465273127
		},
		{
			"topic_id": 2,
			"title": "how to generate pyc (python executible file) file from py file?",
			"body": "",
			"added": 1465796442
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"6_125zRLcgr1TdUL3WeWkPxPnHiGARj12AXv": [
			{
				"comment_id": 1,
				"body": "or you can simply use window provided folder based search function, find all the py files and delete them all.",
				"added": 1465796361
			}
		],
		"2_1JHLiLCM7BdYWg3aiZFVhFEkjqSnEa6FKZ": [
			{
				"comment_id": 2,
				"body": "How do I create a .pyc file?\n.\n\nPython automatically compiles your script to compiled code, so called byte code, before running it.\n\nWhen a module is imported for the first time, or when the source is more recent than the current compiled file, a .pyc file containing the compiled code will usually be created in the same directory as the .py file. When you run the program next time, Python uses this file to skip the compilation step.\n\nOne reason that a .pyc file may not be created is permissions problems with the directory. This can happen, for example, if you develop as one user but run as another, such as if you are testing with a web server. Creation of a .pyc file is automatic if you’re importing a module and Python has the ability (permissions, free space, etc.) to write the compiled module back to the directory.\n\nRunning a script is not considered an import and no .pyc will be created. For example, if you have a script file abc.py that imports another module xyz.py, when you run abc, xyz.pyc will be created since xyz is imported, but no abc.pyc file will be created since abc.py isn’t being imported.\n\nIf you need to create a .pyc file for a module that is not imported, you can use the py_compile and compileall modules.\n\nThe py_compile module can manually compile any module. One way is to use the py_compile.compile function in that module interactively:\n>>> import py_compile\n>>> py_compile.compile('abc.py')\n\nThis will write the .pyc to the same location as abc.py (you can override that with the optional parameter cfile).\n\nYou can also automatically compile all files in a directory or directories using the compileall module.\npython -m compileall .\n\n\nIf the directory name (the current directory in this example) is omitted, the module compiles everything found on sys.path.\n\nIf you’re curious, you can look at the byte code using the dis module:\n>>> def hello():\n...     print \"hello!\"\n...\n>>> dis.dis(hello)\n  2           0 LOAD_CONST               1 ('hello!')\n              3 PRINT_ITEM\n              4 PRINT_NEWLINE\n              5 LOAD_CONST               0 (None)\n              8 RETURN_VALUE",
				"added": 1465796518
			},
			{
				"comment_id": 3,
				"body": "You can use compileall in the terminal. The following command will go recursively into sub directories and make pyc files for all the python files it finds. The compileall module is part of the python standard library, so you don't need to install anything extra to use it. This works exactly the same way for python2 and python3.\n\npython -m compileall .",
				"added": 1465796979
			}
		]
	},
	"comment_vote": {}
}