{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "NullPaste",
			"body": "#NullPaste: um pastebin descentralizado\n- http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/",
			"added": 1548162453
		},
		{
			"topic_id": 2,
			"title": "Jair Bolsonaro e Eduardo Bolsonaro processam Revista Fórum",
			"body": "#Jair Bolsonaro e Eduardo Bolsonaro processam Revista Fórum\n\n- https://www.revistaforum.com.br/jair-bolsonaro-e-eduardo-bolsonaro-processam-revista-forum/\n- https://www.tecmundo.com.br/seguranca/138045-jair-bolsonaro-processa-revista-forum-foto-conversa-whatsapp.htm",
			"added": 1548169832
		}
	],
	"topic_vote": {
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"1_183j7y1ArHbMyMvdxH2yaMndEvZzddKpD1": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1,
		"1_1G8X5xnLri7S9dzMLveQisPkejtJa8hNWm": 1,
		"3_1CRBWHy3yPiavkJiSey48SQsMW3vtvCVhE": 1,
		"2_183j7y1ArHbMyMvdxH2yaMndEvZzddKpD1": 1,
		"1_1Anr114gznurn8nhMnQAwkfSTri4fZ7W9X": 1,
		"2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1,
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1
	},
	"next_comment_id": 26,
	"comment": {
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 1,
				"body": "#No Coin\nO No Coin é uma extensão para Chrome, Firefox e Opera, que bloqueia todas as tentativas de crypto mining que venham de qualquer site que visitas.\n\nO código deste produto está disponível na Internet pelo que, de forma transparente, se poderá ver a sua integridade.\n\nEsta extensão é muito leve e não tem qualquer impacto na lentidão do teu browser. Ter isto instalado é sem dúvida uma mais valia para te protegeres das ameaças digitais.\n\n- https://github.com/keraf/NoCoin.git",
				"added": 1548162384
			},
			{
				"comment_id": 5,
				"body": "#Vuvuzela\nVuvuzela é um aplicativo de chat privado que oculta metadados, incluindo com quem você conversa e quando está conversando. O Vuvuzela suporta milhões de usuários e é seguro, mesmo se a rede e a maioria dos servidores estiverem comprometidos.\n\nA Vuvuzela é construída sobre fundamentos matemáticos. Para ocultar metadados, as mensagens são roteadas por vários servidores e cada servidor adiciona ruído. Os servidores adicionam ruído suficiente para garantir a privacidade diferencial, uma definição formal de privacidade que permite aos usuários quantificar sua privacidade de metadados depois de enviar muitas mensagens pelo sistema.\n- https://vuvuzela.io/\n- https://github.com/vuvuzela/vuvuzela.git",
				"added": 1548167936
			},
			{
				"comment_id": 7,
				"body": "#Trisquel\nTrisquel GNU/Linux é uma versão do sistema operacional GNU que utiliza o núcleo Linux-libre e é baseado no Ubuntu. Os principais objetivos do projeto são a produção de um sistema operacional totalmente livre e com suporte a vários idiomas.\n- https://trisquel.info/en",
				"added": 1548170792
			},
			{
				"comment_id": 9,
				"body": "share.riseup.net — upload de arquivos (pastebin e imagebin).\n- https://share.riseup.net/",
				"added": 1548172060
			},
			{
				"comment_id": 10,
				"body": "#Lufi\nLufi é um programa de reserva gratuita (como na liberdade de expressão) de ficheiros.\nOs ficheiros enviados no Lufi são codificados antes de serem enviados ao servidor: o administrador do servidor não pode ver o conteúdo dos ficheiros.\nO administrador pode apenas ver o nome do ficheiro, o seu tamanho e o tipo de mime (o tipo de ficheiro: texto, vídeo, etc.).\n- https://upload.disroot.org/\n- https://github.com/ldidry/lufi.git",
				"added": 1548173078
			},
			{
				"comment_id": 15,
				"body": "#MEGApwn\nMEGApwn é um bookmarklet que funcione em seu Web browser e indique sua chave mestra suposta secreta MEGA, mostrando que não é cifrado realmente e pode ser recuperado por MEGA ou qualquer um mais com acesso a seu computador sem você que sabe.\n- https://nzkoz.github.io/MegaPWN/ | Source: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?183j7y1ArHbMyMvdxH2yaMndEvZzddKpD1_1\n\n#Um bookmarklet é um marcador armazenado em um navegador da Web que contém comandos JavaScript para estender a funcionalidade do navegador. https://en.wikipedia.org/wiki/Bookmarklet",
				"added": 1548186719
			},
			{
				"comment_id": 16,
				"body": "#sslstrip\nEm 2009, o pesquisador de segurança Moxie Marlinspike criou uma ferramenta chamada sslstrip, que permite a um invasor interceptar e interromper uma conexão SSL. O cracker pode, então, espionar todos os dados que o usuário envia para o site falso.\n- https://github.com/moxie0/sslstrip.git",
				"added": 1548186762
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 2,
				"body": "#O Livro dos Cinco Anéis\nO Livro dos Cinco Anéis - Gorin No Sho - é o mais importante tratado estratégico dos samurais. Seu autor, Miyamoto Musashi (1584-1645), é considerado o samurai mais famoso de todos os tempos. Em sua época, derrubou escolas consagradas e venceu guerreiros formidáveis, impondo-se como um oponente imbatível. Lutou mais de 60 duelos, esteve presente em diversas batalhas e nunca foi derrotado.\n- https://web.archive.org/web/20171215145149/http://files.seishinkyokushin.webnode.com.pt/200001010-9abf39b86d/livro%20dos%205%20aneis.pdf",
				"added": 1548162629
			},
			{
				"comment_id": 21,
				"body": "#Como Resolver Problemas Matemáticos - Terence Tao\n\nEscrito por um destacado matemático, esse estimulante e claramente apresentado texto conduz o leitor através de várias táticas para a resolução de Problemas Matemáticos. Cobrindo teoria dos números, álgebra, análise,geometria euclidiana e geometria analítica, Como Resolver Problemas Matemáticos inclui ao longo do seu corpo numerosos exercícios e modelos de solução.\n\n- Download: https://anonfiles.com/L3E2ver3b1/Solving_Mathematical_Problems_A_Personal_Perspective_Second_Edition_pdf\n- SHA-256: cf2d0adb98151814f875869d30c97dee8e36044aeda9442abc142847a6859ffd",
				"added": 1548214741
			}
		],
		"3_1CRBWHy3yPiavkJiSey48SQsMW3vtvCVhE": [
			{
				"comment_id": 3,
				"body": "#Criptografia - S. C. Coutinho\n\n- https://web.archive.org/web/20160303191853/http://www.obmep.org.br/docs/apostila7.pdf",
				"added": 1548162849
			},
			{
				"comment_id": 11,
				"body": "#Criptografia pós-quântica\n- https://web.archive.org/web/20090920002905/http://www.pqcrypto.org/www.springer.com/cda/content/document/cda_downloaddocument/9783540887010-c1.pdf\n- https://web.archive.org/web/20180505003432/http://www.sbmac.org.br/eventos/cnmac/xxxiii_cnmac/pdf/729.pdf\n- https://github.com/open-quantum-safe/liboqs.git\n- https://github.com/open-quantum-safe/openssl.git\n- https://github.com/NTRUOpenSourceProject/NTRUEncrypt.git\n- https://github.com/Microsoft/Picnic.git",
				"added": 1548173994
			}
		],
		"1_1G8X5xnLri7S9dzMLveQisPkejtJa8hNWm": [
			{
				"comment_id": 4,
				"body": "#Apostilas\nAqui você encontra as apostilas utilizadas no PIC, que estão disponíveis para download.\n- http://www.obmep.org.br/apostilas.htm",
				"added": 1548163023
			},
			{
				"comment_id": 17,
				"body": "#Do ITA para a X\nEsse texto busca esclarecer as principais dúvidas que possam surgir aos estudantes do ITA e falar um pouco sobre coisas que possam ser úteis para guiar o curso visando o concurso da École Polytechnique, uma das mais antigas, célebres e prestigiadas escolas de engenharia da França e do mundo.\n- http://www.brasilnax.com/ita/do-ita-para-a-x",
				"added": 1548204455
			},
			{
				"comment_id": 18,
				"body": "#Mademática\nEste blog tem por intuito divulgar a Matemática e auxiliar estudantes que estejam se preparando para os concursos das escolas militares e para olimpíadas de Matemática.\n- http://madematica.blogspot.com/",
				"added": 1548210582
			}
		],
		"1_1Anr114gznurn8nhMnQAwkfSTri4fZ7W9X": [
			{
				"comment_id": 6,
				"body": "#Jair Bolsonaro e Eduardo Bolsonaro processam Revista Fórum\n\n- https://www.revistaforum.com.br/jair-bolsonaro-e-eduardo-bolsonaro-processam-revista-forum/\n- https://www.tecmundo.com.br/seguranca/138045-jair-bolsonaro-processa-revista-forum-foto-conversa-whatsapp.htm",
				"added": 1548170245
			}
		],
		"2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": [
			{
				"comment_id": 8,
				"body": "#Repositório de blobs de firmware para uso com o kernel do Linux\n- https://git.kernel.org/pub/scm/linux/kernel/git/firmware/linux-firmware.git/",
				"added": 1548171795
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 12,
				"body": "#Nabari No Ou\n\nNabari no Ou se passa no Japão moderno, contando a saga de um grupo de ninjas. A história gira em torno de Miharu Rokujou, um garoto comum, pouco interessado pelo mundo que o cerca. Por esse motivo, ele procura levar a vida no seu próprio ritmo. Entretanto, devido a uma desconhecida técnica de batalha chamada de Shinra Banshou, o cotidiano do jovem não será nada tranquilo. Por algum motivo misterioso, essa poderosa habilidade está presa dentro do corpo de Miharu, e além da força incontestável, o Shinra Banshou é visado pela maioria dos ninjas existentes.\n\n\n- https://www.superanimes.site/anime/nabari-no-ou",
				"added": 1548179763
			},
			{
				"comment_id": 13,
				"body": "#Strike The Blood\nA história de fantasia e ação escolar de Strike the Blood gira em torno de Akatsuki Kojou, um garoto considerado o vampiro mais perigoso do mundo (que pensavam existir apenas em mitos e lendas), e Himeragi Yukina, uma garota que recebeu a missão de ficar de olho no vampiro e, se preciso, eliminá-lo.\n- https://www.superanimes.site/anime/strike-the-blood\n\n#Strike The Blood II\nSegunda temporada de Strike the Blood.\n- https://www.superanimes.site/strike-the-blood-ii\n\n#Strike The Blood III\nTerceira temporada de Strike the Blood.\n\n\n- https://www.superanimes.site/ova/strike-the-blood-iii",
				"added": 1548179905
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 14,
				"body": "#CÓPIAS - DE VOLTA À VIDA\nDepois de um grave acidente de trânsito que matou toda a sua família, um neurocientista (Keanu Reeves) sente que perdeu o sentido da vida. Utilizando seu meio de trabalho, ele se torna obcecado em trazê-los de volta, mesmo que isso signifique desafiar boa parte do governo e, principalmente, as leis da física.\n- https://www.rapidvideo.com/e/FZEKRCUEER",
				"added": 1548184549
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 19,
				"body": "#Desafios da Matemática \n\nDesafios da Matemática é um aplicativo criado para comemorar o Biênio da Matemática 2017-2018. Estimula o raciocínio e a lógica, apresentando um problema por dia em três níveis diferentes: iniciante, intermediário e avançado. Você escolhe o nível que deseja praticar e treina seus conhecimentos em qualquer lugar que estiver. \n\nOs problemas são criados pelos professores da OBMEP (Olimpíada Brasileira de Matemática das Escolas Públicas), a partir do Banco de Questões da OBMEP e da OBM (Olimpíada Brasileira de Matemática), além de contribuições de pesquisadores do IMPA (Instituto de Matemática Pura e Aplicada). O aplicativo é direcionado a todos que querem se divertir com a matemática, de forma prática e objetiva! \n\n- https://play.google.com/store/apps/details?id=impa.desafiosdamatematica",
				"added": 1548214418
			},
			{
				"comment_id": 20,
				"body": "#Como Resolver Problemas Matemáticos - Terence Tao\n\nEscrito por um destacado matemático, esse estimulante e claramente apresentado texto conduz o leitor através de várias táticas para a resolução de Problemas Matemáticos. Cobrindo teoria dos números, álgebra, análise,geometria euclidiana e geometria analítica, Como Resolver Problemas Matemáticos inclui ao longo do seu corpo numerosos exercícios e modelos de solução.\n\n- Download: https://anonfiles.com/L3E2ver3b1/Solving_Mathematical_Problems_A_Personal_Perspective_Second_Edition_pdf\n- SHA-256: cf2d0adb98151814f875869d30c97dee8e36044aeda9442abc142847a6859ffd",
				"added": 1548214684
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 22,
				"body": "Portanto, agora já não há condenação para os que estão em Cristo Jesus,\nporque por meio de Cristo Jesus a lei do Espírito de vida me libertou da lei do pecado e da morte.\nPorque, aquilo que a lei fora incapaz de fazer por estar enfraquecida pela carne, Deus o fez, enviando seu próprio Filho, à semelhança do homem pecador, como oferta pelo pecado. E assim condenou o pecado na carne,\na fim de que as justas exigências da lei fossem plenamente satisfeitas em nós, que não vivemos segundo a carne, mas segundo o Espírito.\nQuem vive segundo a carne tem a mente voltada para o que a carne deseja; mas quem, de acordo com o Espírito, tem a mente voltada para o que o Espírito deseja.\nA mentalidade da carne é morte, mas a mentalidade do Espírito é vida e paz;\na mentalidade da carne é inimiga de Deus porque não se submete à lei de Deus, nem pode fazê-lo.\nQuem é dominado pela carne não pode agradar a Deus.\nEntretanto, vocês não estão sob o domínio da carne, mas do Espírito, se de fato o Espírito de Deus habita em vocês. E, se alguém não tem o Espírito de Cristo, não pertence a Cristo.\nMas se Cristo está em vocês, o corpo está morto por causa do pecado, mas o espírito está vivo por causa da justiça.\nE, se o Espírito daquele que ressuscitou Jesus dentre os mortos habita em vocês, aquele que ressuscitou a Cristo dentre os mortos também dará vida a seus corpos mortais, por meio do seu Espírito, que habita em vocês.\nPortanto, irmãos, estamos em dívida, não para com a carne, para vivermos sujeitos a ela.\nPois se vocês viverem de acordo com a carne, morrerão; mas, se pelo Espírito fizerem morrer os atos do corpo, viverão,\nporque todos os que são guiados pelo Espírito de Deus são filhos de Deus.\nPois vocês não receberam um espírito que os escravize para novamente temer, mas receberam o Espírito que os adota como filhos, por meio do qual clamamos: \"Aba, Pai\".\nO próprio Espírito testemunha ao nosso espírito que somos filhos de Deus.\nSe somos filhos, então somos herdeiros; herdeiros de Deus e co-herdeiros com Cristo, se de fato participamos dos seus sofrimentos, para que também participemos da sua glória.\nConsidero que os nossos sofrimentos atuais não podem ser comparados com a glória que em nós será revelada.\nA natureza criada aguarda, com grande expectativa, que os filhos de Deus sejam revelados.\nPois ela foi submetida à futilidade, não pela sua própria escolha, mas por causa da vontade daquele que a sujeitou, na esperança\nde que a própria natureza criada será libertada da escravidão da decadência em que se encontra para a gloriosa liberdade dos filhos de Deus.\nSabemos que toda a natureza criada geme até agora, como em dores de parto.\nE não só isso, mas nós mesmos, que temos os primeiros frutos do Espírito, gememos interiormente, esperando ansiosamente nossa adoção como filhos, a redenção do nosso corpo.\nPois nessa esperança fomos salvos. Mas, esperança que se vê não é esperança. Quem espera por aquilo que está vendo?\nMas se esperamos o que ainda não vemos, aguardamo-lo pacientemente.\nDa mesma forma o Espírito nos ajuda em nossa fraqueza, pois não sabemos como orar, mas o próprio Espírito intercede por nós com gemidos inexprimíveis.\nE aquele que sonda os corações conhece a intenção do Espírito, porque o Espírito intercede pelos santos de acordo com a vontade de Deus.\nSabemos que Deus age em todas as coisas para o bem daqueles que o amam, dos que foram chamados de acordo com o seu propósito.\nPois aqueles que de antemão conheceu, também os predestinou para serem conformes à imagem de seu Filho, a fim de que ele seja o primogênito entre muitos irmãos.\nE aos que predestinou, também chamou; aos que chamou, também justificou; aos que justificou, também glorificou.\nQue diremos, pois, diante dessas coisas? Se Deus é por nós, quem será contra nós?\nAquele que não poupou a seu próprio Filho, mas o entregou por todos nós, como não nos dará juntamente com ele, e de graça, todas as coisas?\nQuem fará alguma acusação contra os escolhidos de Deus? É Deus quem os justifica.\nQuem os condenará? Foi Cristo Jesus que morreu; e mais, que ressuscitou e está à direita de Deus, e também intercede por nós.\nQuem nos separará do amor de Cristo? Será tribulação, ou angústia, ou perseguição, ou fome, ou nudez, ou perigo, ou espada?\nComo está escrito: \"Por amor de ti enfrentamos a morte todos os dias; somos considerados como ovelhas destinadas ao matadouro\".\nMas, em todas estas coisas somos mais que vencedores, por meio daquele que nos amou.\nPois estou convencido de que nem morte nem vida, nem anjos nem demônios, nem o presente nem o futuro, nem quaisquer poderes,\nnem altura nem profundidade, nem qualquer outra coisa na criação será capaz de nos separar do amor de Deus que está em Cristo Jesus, nosso Senhor.\n\n- Romanos 8:1-39",
				"added": 1548215042
			},
			{
				"comment_id": 23,
				"body": "O Senhor é o meu pastor; de nada terei falta.\nEm verdes pastagens me faz repousar e me conduz a águas tranqüilas;\nrestaura-me o vigor. Guia-me nas veredas da justiça por amor do seu nome.\nMesmo quando eu andar por um vale de trevas e morte, não temerei perigo algum, pois tu estás comigo; a tua vara e o teu cajado me protegem.\nPreparas um banquete para mim à vista dos meus inimigos. Tu me honras, ungindo a minha cabeça com óleo e fazendo transbordar o meu cálice.\nSei que a bondade e a fidelidade me acompanharão todos os dias da minha vida, e voltarei à casa do Senhor enquanto eu viver.\n\n- Salmos 23:1-6",
				"added": 1548215257
			},
			{
				"comment_id": 24,
				"body": "Aquele que habita no abrigo do Altíssimo e descansa à sombra do Todo-poderoso\npode dizer ao Senhor: Tu és o meu refúgio e a minha fortaleza, o meu Deus, em quem confio.\nEle o livrará do laço do caçador e do veneno mortal.\nEle o cobrirá com as suas penas, e sob as suas asas você encontrará refúgio; a fidelidade dele será o seu escudo protetor.\nVocê não temerá o pavor da noite, nem a flecha que voa de dia,\nnem a peste que se move sorrateira nas trevas, nem a praga que devasta ao meio-dia.\nMil poderão cair ao seu lado, dez mil à sua direita, mas nada o atingirá.\nVocê simplesmente olhará, e verá o castigo dos ímpios.\nSe você fizer do Altíssimo o seu refúgio,\nnenhum mal o atingirá, desgraça alguma chegará à sua tenda.\nPorque a seus anjos ele dará ordens a seu respeito, para que o protejam em todos os seus caminhos;\ncom as mãos eles o segurarão, para que você não tropece em alguma pedra.\nVocê pisará o leão e a cobra; pisoteará o leão forte e a serpente.\n\"Porque ele me ama, eu o resgatarei; eu o protegerei, pois conhece o meu nome.\nEle clamará a mim, e eu lhe darei resposta, e na adversidade estarei com ele; vou livrá-lo e cobri-lo de honra.\nVida longa eu lhe darei, e lhe mostrarei a minha salvação. \"\n\n- Salmos 91:1-16",
				"added": 1548215293
			},
			{
				"comment_id": 25,
				"body": "Surgiu também uma discussão entre eles, acerca de qual deles era considerado o maior.\nJesus lhes disse: \"Os reis das nações dominam sobre elas; e os que exercem autoridade sobre elas são chamados benfeitores.\nMas, vocês não serão assim. Pelo contrário, o maior entre vocês deverá ser como o mais jovem, e aquele que governa como o que serve.\nPois quem é maior: o que está à mesa, ou o que serve? Não é o que está à mesa? Mas eu estou entre vocês como quem serve.\n\n- Lucas 22:24-27",
				"added": 1548215534
			}
		]
	},
	"comment_vote": {
		"5_183j7y1ArHbMyMvdxH2yaMndEvZzddKpD1": 1,
		"6_183j7y1ArHbMyMvdxH2yaMndEvZzddKpD1": 1,
		"11_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": 1,
		"6_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"17_183j7y1ArHbMyMvdxH2yaMndEvZzddKpD1": 1,
		"18_183j7y1ArHbMyMvdxH2yaMndEvZzddKpD1": 1
	}
}