{
	"next_comment_id": 9,
	"comment": [
		{
			"comment_id": 1,
			"body": "Oh, do these work?",
			"post_id": 4,
			"date_added": 1447487928
		},
		{
			"comment_id": 2,
			"body": "> [o4zw5vmpoz5hz78z](#comment_1_1KTjPe9MxoYkcXj78GuZgCcj3R3f3Twh7r): if you say the site is down because owner does not seed anymore is wrong.\n> a zeronet site is down when there are no peers anymore.\n> what you are refrering to is if a site is not maintained anymore.\n\n\"If any go down, aka their owner has stopped peering them, and so has everyone else\" I said when the owner and everyone else stops seeding.",
			"post_id": 14,
			"date_added": 1447655906
		},
		{
			"comment_id": 3,
			"body": "> [pycole](#comment_1_1KwTTgPRSTHFmmJAFBt6kQfdyNeSM5KJuH): Sounds like a nice idea. I would suggest scraping Zeroname and ZeroSearch as part of the process, and allowing people to submit their newly-made sites (maybe Zeroindex could host them briefly too, at least until they are well-seeded).I suggest you browse through some coffeescript tutorials and maybe ask nofish for his take on it.\n\nThanks, I'll look into coffeescript. Looks like a cool language, just never really been a huge web programmer.",
			"post_id": 14,
			"date_added": 1447655951
		},
		{
			"comment_id": 4,
			"body": "> [petko](#comment_1_1N4gn1fTkSb7DmjvxiXDVHVx9REgJZk2CR): There's no difference between amd64 and x86_64\n\nReally? Okay then. I've never done any stuff like this, thanks for the heads up!",
			"post_id": 20,
			"date_added": 1449792817
		},
		{
			"comment_id": 5,
			"body": "> [klauszimmermann](#comment_1_15QGRquMETTn5LnCHjTm1qa9eaXGtq7gpT): Awesome, man! How did you do it?\n> I see you also have this feature of favorites in your blog. Did you clone it or implement it yourself? I can't seem to enable it on my own...\n\nDo you mean the tiny hearts? I just cloned the generic blog. About the domain name, I converted some of the tiny amount of bitcoins I had into namecoins and then used the client to register the name. Pretty simple stuff, but it took forever.",
			"post_id": 19,
			"date_added": 1449792983
		},
		{
			"comment_id": 6,
			"body": "> [petko](#comment_2_1N4gn1fTkSb7DmjvxiXDVHVx9REgJZk2CR): as others already noted, there are already some attempts for index sites like ZeroSearch. I think we need a more decentralized solution.\n\nYeah, that's been my general line of thinking. ZeroSearch is good, but there's no way to find any content that you don't know you want to find. The same is true to a certain extent on the normal web, but it's a lot easier to browse with the centralized structure.",
			"post_id": 14,
			"date_added": 1449793087
		},
		{
			"comment_id": 7,
			"body": "Yeah, that would work. As new sites get created, they get added to a per-node client side list. The same mechanism would be useful for reply notifications on comments.\n\nWhat happens when a site is stopped being seeded by anyone? I know the goal of this network is to not have that happen, but it will eventually. Should the sites just stay in the client side list?",
			"post_id": 14,
			"date_added": 1449876009
		},
		{
			"comment_id": 8,
			"body": "> [muja](#comment_1_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr): Relevant xkcd: https://www.xkcd.com/353\n\nThat is actually what it feels like, no joke.",
			"post_id": 26,
			"date_added": 1450632764
		}
	],
	"comment_vote": {},
	"post_vote": {
		"25": 1
	}
}