{
	"title": "陆公子 Blog",
	"description": "\n探索自由品味，\n步入三混之年。",
	"links": "- [0net123.bit](http://127.0.0.1:43110/0net123.bit/)\n- [零网-教学](http://127.0.0.1:43110/1NCezLP8aXjABVreBB1CKGPub2tKTtyhWU/)",
	"next_post_id": 99,
	"demo": false,
	"modified": 1507511964,
	"post": [
		{
			"post_id": 98,
			"title": "《网络安全法》法案",
			"date_published": 1504511316,
			"body": "来源：BBC ifeng DW\n2017年08月11日  中国国家互联网信息办公室周五（8月11日）公布，腾讯微信、新浪微博、百度贴吧涉嫌违反《网络安全法》而被立案调查。\n2017年08月11日  习告诉这项“极端重要”工作怎么干：经济建设是党的中心工作，意识形态工作是党的一项极端重要的工作。\n2017年09月04日  据近日在社交媒体上流传的一份刑事判决书，广东东莞一家法院判决书中写道，被告人邓杰威犯提供侵入、非法控制计算机信息系统程序、工具罪，判处有期徒刑九个月，并处罚金人民币5000元；随案移送的手提电脑，违法所得予以追缴。"
		},
		{
			"post_id": 97,
			"title": "朝美隔空对峙",
			"date_published": 1507448756,
			"body": "来源：BBC\n2017年10月08日  美国总统特朗普警告，在处理朝鲜问题几年都未见成效之后，“只有一种方法管用”。\n2017年08月11日  继8月9日称将用\"从未有过的战火与怒火\"对付朝鲜威胁后，特朗普周四（8月11日）再次警告朝鲜不要试图攻击关岛或者美国盟友，并表示自己之前的\"战火与怒火\"说还不够强硬。\n2017年08月10日  朝鲜表示将在8月中旬做好向美国领土关岛附近发射4枚导弹的战斗准备。\n2017年09月03日  朝鲜中央电视台播报，试验于平壤时间星期天（9月3日）12:00（03:30 GMT）在“北部核试验场”举行。朝中社称，朝鲜劳动党当天上午召开政治局常委会议，“金正恩亲自署名进行氢弹试验的命令”。"
		},
		{
			"post_id": 95,
			"title": "也门霍乱疫情",
			"date_published": 1501502626,
			"body": "来源：TRT UN\n2017年07月31日    “也门新闻社”7月31日报道称，四月底暴发的霍乱疫情仍在全国范围蔓延，全国已有约2000人因该病而死亡，现在每一小时就有一名也门人死于霍乱。\n2017年07月11日  红十字国际委员会10日通报，也门霍乱疫情呈爆发态势，目前霍乱疑似病例超过30万人。\n2017年06月23日  联合国儿基会表示，也门霍乱疫情严重，目前已有19万多个疑似病例，其中一半为儿童。霍乱已经造成1265人死亡，其中四分之一为儿童。\n2017年06月04日  聯合國兒童基金會(UNICEF)周六表示，發生戰亂的也門霍亂疫情迅速蔓延，每日估計有3000至5000宗新症。\n2017年05月31日 儿基会表示，在过去三天当中，也门共出现一万多起霍乱新病例报告，致使疑似病例达到6万5300起。每天有超过1000名患有急性水样腹泻的儿童到卫生机构就诊。在短短的一个月内，霍乱至少夺取了532人的生命，包括109名儿童。\n2017年05月23日  国际红十字会委员会说，也门霍乱疫情中丧生的人数升至350人，在全国范围内染上霍乱疫情的人数超过3万人。"
		},
		{
			"post_id": 94,
			"title": "马拉拉将成为联合国和平大使",
			"date_published": 1491653085.415,
			"body": "来源：DW\n2017年04月08日 下周一（4月10日），马拉拉（Malala Yousafai）将在联合国秘书长古特雷斯的主持下，正式担任这一新职务。由此，她将成为获得这一殊荣的人中最年轻的一位。\n古特雷斯赞扬才19岁的马拉拉说，即使是在最危险的环境下，她也坚定地为女性、儿童和所有人类的权利而奋斗着，她为女孩子的受教育权而作出的努力让很多人受到了激励，做同样的事情。"
		},
		{
			"post_id": 93,
			"title": "雪地留痕，删贴记忆",
			"date_published": 1498310402,
			"body": "来源：ABL RFA 茉莉花 苹果日报 BBC\n2017年06月24日  四川省阿坝州茂县叠溪镇新磨村一处山体周六（6月24日）凌晨6点左右发生高位垮塌，导致46户家庭超过141人被掩埋。\n2017年04月02日  #尉氏女学生被迫卖淫案  河南开封尉氏县爆女学生被迫卖淫案！当地至少30名未成年少女，被迫卖淫女学生来自尉氏县实验中学、尉氏县电大附中等四所中学，其中7人案发时不足14岁。嫖客包括当地官员及富商：面业公司赵天勇，人大代表、政府机关人员。\n2017年04月01日  #泸洲泸县太伏案  上午6时左右，泸县太伏中学一学生（赵某，男，14岁）在住宿楼外死亡。有说是校园暴力以及警方和校方的不作为，赵某被五名校霸勒索保护费，据说一为政府工作人员的儿子，一为老师的儿子。死者母亲悲痛欲绝，拒绝给出的100万的赔款和解，誓要讨回公道。"
		},
		{
			"post_id": 92,
			"title": "李明哲之妻李净瑜救夫",
			"date_published": 1505215270,
			"body": "来源：BBC NyTimes RFA\n李明哲19日从澳门关闸关卡转到珠海拱北口岸入境后音讯全无，其妻子后来间接获释丈夫被国安部门拘留。李明哲现年42岁，长期关注中国民间社会发展及维权人士议题。\n2017年09月11日  在中国湖南省岳阳市，台湾NGO工作者李明哲与中国大陆籍被告人彭宇华，因涉嫌\"颠覆国家政权\"被审理。李明哲供称，对一切指控没有异议。李明哲也称自己的口供\"是真实的，没有逼供\"，对此深表悔改之意。\n2017年05月23日  李明哲太太李净瑜前往美国国会出席听证会返台举行记者会。\n2017年04月10日  李净瑜前往北京营救丈夫，出发前台胞证被注销，航空公司拒绝办登机手续。\n2017年04月09日  国台办9号在李明哲妻子李净瑜赴北京上访寻夫前晚，突然发出书面声明指，已通过“台湾有关团体”转交李明哲亲笔信给李妻，李净瑜质疑对岸私下派掮客“威胁利诱”，她相信李明哲是在“非自由意志”下被迫写信，也相信她10号赴北京习近平会还她公道。\n2017年03月31日  李明哲的妻子李净瑜经过一天一夜关机长考，31号紧急召开记者会，宣布重大决定“我将放弃聘请律师，不做法律性的辩护我决定，亲自前往北京了解状况，去营救我的先生”\n2017年03月30日  北京的一名官员周三表示，一名来自台湾的人权倡导人士被怀疑对国家安全构成威胁，在大陆被拘，这进一步表明，中国开始对与陷入困境的中国人权律师 和团体合作的外来者进行更加严厉的打击。\n2017年03月29日  国台办发言人马晓光周三（3月29日）在例行记者会上说：“台湾居民李明哲因涉嫌从事危害国家安全活动，已接受有关部门调查，目前身体状况良好。 “\n"
		},
		{
			"post_id": 91,
			"title": "新疆加强管控 禁蒙面罩袍",
			"date_published": 1490918358.209,
			"body": "来源：BBC\n2017年3月31日  中国新疆当局4月1日起将实施《新疆维吾尔自治区去极端化条例》条例，加强了在这一偏远地区打击宗教极端主义的力度。遭到禁止的行为包括：\"以非正常蓄胡须、起名渲染宗教狂热\"，\"自己或强迫他人穿戴蒙面罩袍、佩戴极端化标志\"，以及\"排斥、拒绝广播、电视等公共产品和服务\"，等等。"
		},
		{
			"post_id": 90,
			"title": "New blog post",
			"date_published": 1486472489,
			"body": "Blog post body"
		},
		{
			"post_id": 89,
			"title": "New blog post",
			"date_published": 1486472462,
			"body": "Blog post body"
		},
		{
			"post_id": 88,
			"title": "New blog post",
			"date_published": 1486472334,
			"body": "Blog post body"
		},
		{
			"post_id": 87,
			"title": "New blog post",
			"date_published": 1486472334,
			"body": "Blog post body"
		},
		{
			"post_id": 86,
			"title": "New blog post",
			"date_published": 1486472333,
			"body": "Blog post body"
		},
		{
			"post_id": 85,
			"title": "New blog post",
			"date_published": 1486472333,
			"body": "Blog post body"
		},
		{
			"post_id": 84,
			"title": "New blog post",
			"date_published": 1486472332,
			"body": "Blog post body"
		},
		{
			"post_id": 83,
			"title": "New blog post",
			"date_published": 1486472332,
			"body": "Blog post body"
		},
		{
			"post_id": 82,
			"title": "New blog post",
			"date_published": 1486472330,
			"body": "Blog post body"
		},
		{
			"post_id": 81,
			"title": "中国男子在巴黎被警员开枪打死",
			"date_published": 1490877869.517,
			"body": "来源：德国之声\n2017年3月28日  中国外交部周二（3月28日）表示，已紧急约见法国驻华使馆负责人提出交涉，并将与驻法国使馆一道“继续密切跟踪、关注事件进展”。\n2017年3月27日  周一晚间的示威行动最初气氛平静，但在警方试图驱散人群时出现冲突。最终一辆警车和垃圾堆被点燃，警方逮捕了35人。\n2017年3月26日  20时左右巴黎19区发生一起不幸事件，一名中国人因与法国警察发生冲突被打死。"
		},
		{
			"post_id": 80,
			"title": "退伍老兵的行动",
			"date_published": 1492087005,
			"body": "来源：茉莉花\n2017年04月13日  河南省过千名退役军人，不满下岗多年得不到合理补偿，周二(11日)到省信访局外抗议，其间与警察发生冲突。\n2017年03月30日  来自中国各地约8000名越战老兵，日前在广西凭祥进行了扫墓活动。一名福建老兵告诉记者，扫墓于3月25及26日举行，福建省约有数百人到场。今年是越战38周年纪念。"
		},
		{
			"post_id": 79,
			"title": "特朗普大总统治下大美国白宫",
			"date_published": 1495531454,
			"body": "来源：新闻 维基\n2017年05月23日  美国总统特朗普此前访问沙特时，第一夫人梅拉尼娅及第一女儿伊万卡随同出访，她们既没有黑袍加身，也没有佩戴头巾，裙装红唇一个不少。\n2017年4月01日  白宫富豪团队身价表出炉 特朗普内阁总身价约120亿美元\n2017年3月30日  美国第一女儿伊万卡（Ivanka Trump）3月29日宣布，将在白宫正式任职，但是不要薪水。\n2017年1月23日  特朗普签署了上任后的第一份行政命令，正式宣布美国退出跨太平洋战略经济伙伴关系协议。\n2017年1月20日  唐纳德·特朗普就任美国总统。\n2016年11月8日  赢得了大选，他成为了历史上就任总统的最老的、最富有的，以及第一个先前没有担任过任何军职或公职的人，他也是第五位未获得多数普选票但当选总统的人。"
		},
		{
			"post_id": 78,
			"title": "google 公司进军中国？",
			"date_published": 1490876365.292,
			"body": "来源：BBC \n2017年3月29日  美国公司谷歌星期三上线了一款特别为中国用户设计的手机翻译应用，并被允许进入中国市场。这被认为是谷歌重整旗鼓，试图再次进军中国的信号。\n2017年3月14日  一个月前，有消息称，谷歌或将以与网易成立合资公司的方式，将它的移动应用和数字媒体商店Google Play带到中国，从而尝试重返中国。"
		},
		{
			"post_id": 58,
			"title": "于欢护母杀人案",
			"date_published": 1498176000,
			"body": "来源：网易 凤凰\n2017年06月23日  山东省高级人民法院对上诉人于欢故意伤害一案二审公开宣判，以故意伤害罪改判于欢有期徒刑五年，维持原判附带民事部分。\n2017年05月27日  备受关注的于欢故意伤害案二审在山东省高级人民法院公开开庭审理。\n2017年04月03日  于欢案处警干警在警情处置过程中存在处警不力、对现场处置严重失责等失职行为。聊城市纪委、市监察局责成冠县纪委、县监察局对郭增金、朱秀明等人立案审查。\n2017年03月29日  最高人民法院官微刊登《“于欢案”热评：静待花开 是相信它一定会开》。\n2017年03月26日  山东省高级人民法院通报，24日已经受理于欢故意伤害一案的二审，并已经组成合议庭，将依照法定程序公正、公开予以审理。\n2017年03月26日  最高人民检察院派员赴山东阅卷并听取山东省检察机关汇报，正在对案件事实、证据进行全面审查。\n2017年02月17日  聊城市中级法院一审以故意伤害罪判处于欢无期徒刑。\n2016年04月14日  杜志浩等10余人到位于山东冠县的山东源大工贸有限公司催要高利贷，并对企业法人苏银霞及其子于欢有侮辱谩骂言行。民警出警后，于欢欲离开被阻止，与讨债人发生冲突，于欢持尖刀将杜志浩等4人捅伤，杜志浩于次日凌晨死亡。",
			"date_modified": 1490866796.336
		},
		{
			"post_id": 33,
			"title": "中国在南海三处人造岛屿",
			"date_published": 1490748499.423,
			"body": "来源：BBC 德国之声\n2017年3月27日  位于华盛顿的战略和国际研究中心（Center for Strategic and International Studies/CSIS）分析最新卫星图片之后发现，中国在位于南中国海的这三处人工岛屿上所建设的飞机跑道、机库、雷达站和钢筋混凝土构造的地对空导弹发射基地均已完工或即将完成。",
			"date_modified": 1490754396.26
		},
		{
			"post_id": 32,
			"title": "VPN翻墙的危机",
			"date_published": 1501546652,
			"body": "来源：腾讯 凤凰 推\n2017年08月01日  据BBC了解，本周末至少有60个VPN被苹果（Apple）下架。\n2017年07月11日  据彭博新闻社星期一报道，中国政府通知电信运营商在18年2月1日前截断个人用户对虚拟专用网络（VPN）的接入。要求中国最大的三家国营电信公司—移动、联通、电信—禁止个人用户使用VPN。\n2017年06月22日  Green VPN关闭服务，据说7月1日全面封杀VPN。政府开始清理互联网接入服务，至2018年3月止。\n2017年03月28日 重庆市政府发布了《重庆市公安机关网络安全管理行政处罚裁量基准》。自2016年7月27日起施行，有效期至2021年7月26日。对擅自建立、使用非法定信道进行国际联网的；对接入网络未通过互联网络接入国际联网的；对未经批准擅自进行国际联网的；不以盈利为目的，初次实施上述违法行为，责令停止联网，给予警告。\n2017年01月22日，中国工信部发布的一条通知，即日起至2018年3月31日，会“在全国范围内对‘互联网接入服务市场’开展清理规范工作”，“未经电信主管部门批准，不得自行建立或租用专线（含虚拟专用网络VPN）等其他信道开展跨境经营活动”，而“涉及VPN等跨境链接的企业将被整改、建档和管理”。"
		},
		{
			"post_id": 31,
			"title": "人祸强拆 江西一乡干部遭镰铲袭击身亡",
			"date_published": 1490237707.735,
			"body": "来源：自由微信 茉莉花\n2017年3月22日  明经国代理律师郭莲辉要求会见遭当局拒绝，并受到其所在律所和司法局的约谈。当局还持续对明经国的家人进行稳控，儿子被警方拘留，强拆现场的视频和照片等证据也全部遭到删除。\n2017年3月17日  赣州市南康区十八塘乡樟坊村发生故意伤害致死案，该乡人大主席卓某和4名村干部做拆“空心房”工作，明经国用镰铲袭击，因伤势过重死亡。"
		},
		{
			"post_id": 30,
			"title": "人祸 河南小学发生踩踏事件",
			"date_published": 1490236878.069,
			"body": "来源：腾讯 德声 维基\n2017年3月22日  上午9时许，濮阳县第三实验小学发生一起学生踩踏事故，目前已致2人死亡，20人受伤，其中2人重伤。\n2015年9月24日  伊斯兰教圣城麦加发生的踩踏事故，沙特阿拉伯公布的官方死亡人数是7百多人。\n2014年12月31日  晚23时35分许，上海外滩陈毅广场发生踩踏事故致36人死亡。\n2014年9月26日  下午14时30分许，云南省昆明市盘龙区明通小学发生踩踏事故，造成6名学生死亡、21人受伤。"
		},
		{
			"post_id": 29,
			"title": "恐怖袭击 又是 英国",
			"date_published": 1496659158,
			"body": "来源：德国之声 BBC\n2017年06月03日  夜间一辆小货车在伦敦桥上冲上人行道，撞倒多名行人。此外还有人用刀刺伤行人。据目击者称，货车司机是故意撞向路人的。\n2017年05月23日  英国中部城市曼彻斯特周一晚间体育馆举行的演唱会现场发生爆炸袭击事件，目前确认造成22人死亡，约60人受伤。\n2017年04月09日  在耶稣受难节来临之际，埃及接连发生两起科普特东正教堂爆炸事件，共夺走至少43人的性命，100多人受伤。极端组织伊斯兰国宣称对这两起教堂爆炸事件负责。\n2017年04月03日  俄罗斯当局说，现在已经有11人死于圣彼得堡地铁炸弹袭击，40多人受伤。攻击被视为恐怖袭击。\n2017年03月22日  英国议会大厦外面中午约2点40分发生一起“恐怖袭击”事件，一名男子驾驶汽车从西敏寺大桥上冲撞行人，包括袭击者和1名警员在内的5人死亡。该事件还造成至少40人受伤，其中有3名警员。2017年3月23日  据支持恐怖组织“伊斯兰国”的阿马克新闻社报道，“伊斯兰国”宣布对周三伦敦袭击案负责。"
		},
		{
			"post_id": 28,
			"title": "韦石与博讯",
			"date_published": 1490106666.661,
			"body": "来源：推特@wmeng8 博讯\n2017年3月28日  不久的将来，美国主流媒体会有一个深度报道，关于中国神秘富豪。他定会让西方刮目相看\n2017年3月21日  博讯倒下可能：1、本人生命受危害，最近被发现三个车跟踪，没发现的呢？2、本人一直不愿卷入是是非非，洗手转行。"
		},
		{
			"post_id": 27,
			"title": "郭文贵网络爆料反腐记",
			"date_published": 1497853676,
			"body": "来源：推特@KwokMiles 维基 新浪\n2017年06月16日  明镜电视陈小平专访郭文贵（第三集）。拟7月17日更多爆料。\n2017年05月02日  5月1日下午5时，美国之音负责中文网路的资深编辑李肃，被联邦政府保安人员押送离开，被宣布无限期不得重返。普通话语主任龚小夏、节目主持人东方、资深编辑宝申、资深记者杨晨等也接到无限期休假，接受调查的命令。\n2017年04月24日  郭称几周内召开全球新闻发布会，主题为：2013-2017反腐真相。\n2017年04月19日  美国之音对郭文贵的「三小时」直播采访，进行到刚一个小时多点，就被突然中断了，引来网上一片骂声。\n2017年04月19日  国际刑警组织已向郭文贵发出红色通缉令\n2017年3月29日 公布胡舒立女亲自签名给习主席的信。\n2017年3月17日 郭文贵有偿募集证据公告四。收集李友案资料和虐待其员工视频资料。\n2017年3月15日 表明，全力支持三位书记依法反腐。\n2017年3月14日 郭公开函一二三（有偿收集李友及虐待员工资料）。\n2017年3月13日 发表给前北京大学校长王恩哥的公开信，要求北大退回他捐赠给北大的十亿人民币捐款及利息。\n2017年3月11日 掲开胡舒立女士．吴征先生．韦石．西诺先生的真实身份．会帮助三位书记查处以傅政华等的假反腐政治集团。\n2017年3月08日 明镜电视专访郭文贵（第二集）。\n2015年3月25日 郭文贵与他的神秘“盘古会”，中国网。\n",
			"date_modified": 1490865938.789
		},
		{
			"post_id": 26,
			"title": "广东乌坎村土地维权事件",
			"date_published": 1490435054,
			"body": "来源：新唐人 维基 凤凰 南方日报\n2017年3月25日  陆丰市东海镇乌坎村举行第七届村民委员会选举大会，依法选出5名村委会成员。\n2017年3月19日 庄烈宏母亲被几个政府人员从家里抓走，直到下午5点多钟才被放出来，期间这些人不给他母亲吃饭，威胁他母亲令庄烈宏封口。\n2017年3月11号 广西柳州农民陈永宗，成功突破重重监控进入乌坎村，之后又平安离开。\n2017年2月7日  流亡美国纽约的乌坎村委庄烈宏在联合国大楼前焚烧了一面中共党旗，抗议中共对乌坎村民持续的镇压行动。\n2016年12月26日 海丰县法院发表公告称，魏永汉、洪永忠、杨锦贞、吴芳、张炳钗等九名村民罪名成立，分别被判处2年至10年有期徒刑。\n2016年9月11日  南方日报刊发文章《汕尾陆丰依法推动乌坎问题妥善解决》 。\n2016年9月8日  法院当庭宣判林祖恋受贿罪和非国家工作人员受贿罪成立，判处有期徒刑3年1个月，罚款20万元人民币。官方报道林祖恋表示不上诉。一些乌坎村民当天发起小规模的罢市及游行活动，声援林祖恋。\n2014年9月中旬，洪锐潮及杨色茂二人被陆丰市法院以“受贿罪”分别判处有期徒刑四年及两年。\n2014年2月初，村代表之一的庄烈宏与妻子到纽约寻求政治庇护。\n2011年12月11日，薛锦波在汕尾市看守所羁押期间（第三天），突感身体异常，被紧急送往汕尾市逸挥基金医院抢治。经持续抢救无效，在当天上午11时许宣告死亡”。\n\n"
		},
		{
			"post_id": 24,
			"title": "美国政府招标修筑\"新长城\"",
			"date_published": 1489996884.003,
			"body": "来源：德国之声\n2017年3月19日 美国国土安全部公布了修墙招标计划。一个项目官员告诉美联社，项目将耗资210亿美元，但美国政府公布的2017/18年度财政预算给界墙规定的总支出为43亿美元。"
		},
		{
			"post_id": 23,
			"title": "纪录片《夹边沟祭事》 制作者艾晓明",
			"date_published": 1489709882.979,
			"body": "来源：新唐人\n讲述甘肃右派劳改农场人间惨案的纪录片《夹边沟祭事》的制作者、中山大学退休教授艾晓明近日表示，她本人不仅受到多次约谈，当局还调查和骚扰她拍片采访过的受害者家属。\n2017年3月13日  在微信上发文表示，为“夹边沟祭事”一片已经第5次被约谈，但已无话可说。\n2017年2月25日  总长近7个小时的《夹边沟祭事》在香港首映。\n"
		},
		{
			"post_id": 22,
			"title": "YouTube封明镜新闻帐号",
			"date_published": 1489550144.549,
			"body": "来源：美国之音\n2017年3月14日 据明镜新闻报道，明镜电视在YouTube上开设的“明镜火拍”等频道星期二（3月14日）遭到关闭。明镜直播了流亡美国的中国富商郭文贵的第二次爆料，而“明镜火拍”上传了有郭文贵爆料的视频。\n2017年1月30日 在明镜电视1月29日直播郭文贵第一次爆料的几天之后，明镜新闻网站就被黑过长达一个星期，明镜电视的多个YouTube频道也遭到关闭。\n"
		},
		{
			"post_id": 21,
			"title": "香港提选特首较量",
			"date_published": 1490500455,
			"body": "来源：BBC 雅虎\n2017年3月26日  被称为“小圈子选举”、结果毫无悬念的香港第五届特首选举的投票，获北京“钦点”和中央政府驻港机构中联办全力拉票支持的前政务司司长林郑月娥，获得777票当选，成为香港首位女行政长官。\n2017年 3月25日  法官拒颁记协临时令 网媒无缘特首选战。\n2017年 3月22日  李嘉诚指，希望新任特首可以像“女娲补天”般，解决社会撕裂问题等人为问题，并与中央沟通合作，为香港带来新面貌。\n2017年 3月14日  香港3名行政长官候选人曾俊华、林郑月娥及胡国兴周二（14日）出席7家电子传媒合办的“2017行政长官选举辩论”，这是3人首次同台较量。\n香港行政长官选举将于2017年3月26日举行，三位候选人政纲比拼。"
		},
		{
			"post_id": 20,
			"title": "华西村家底被揭--缩小的中国社会",
			"date_published": 1489371946.974,
			"body": "来源：腾讯 搜狐 新唐人\n2017年3月13日 如今负债近400亿的华西村还是以前那个富有的村庄吗？2017年3月8日 华西村旗下华西集团家底：总资产542亿 负债389亿。3月7日，公司秘闻在深交所网站上找到了一份债券说明书，截至2016年一季度，华西集团控制旗下公司达到208家，总资产541.93亿元。\n2013年3月20日 華西村村長去世 “天下第一村”騙局曝光\n"
		},
		{
			"post_id": 19,
			"title": "韩国首位被弹劾女总统朴槿惠",
			"date_published": 1495499606,
			"body": "来源：德国之声 BBC\n4年前，朴槿惠成为韩国政坛上首位当选的女总统，4年后，她又成了韩国历史上第一位被弹劾的民选女总统。\n2017年05月23日  受到贪腐敲诈滥权指控的韩国前总统朴槿惠抵达首尔中央法院首次出庭受审。\n2017年03月31日  韩国官员说，刚刚被罢黜的前总统朴槿惠因涉嫌腐败被逮捕。\n2017年03月30日  韩国前总统朴槿惠(Park Geun-hye)周四上午抵达首尔一家法院参加听证会。\n2017年03月21日 朴槿惠抵达首尔的检察官办公室说：“我向人民表示歉意。我将对调查竭诚合作。”\n2017年03月14日  朴槿惠乘车离开青瓦台总统府，回到位于首尔的私宅。朴槿惠：“总有一天会真相大白”\n2017年03月11日 成千上万韩国人在首尔街头举行大规模示威抗议。\n2017年03月10日  韩国宪法裁判所（宪法法院）全体一致通过，将身陷亲信干政风波的朴槿惠总统予以弹劾。\n\n"
		},
		{
			"post_id": 18,
			"title": "中国一边民死于缅军流弹",
			"date_published": 1489278718.34,
			"body": "来源：自由亚洲\n缅甸果敢地区老街的战事还在持续，已有两万多难民进入中国境内避难。中缅边境南伞口岸的居民称，3月10日，当地的学校继续停课，中国军警要求居民不要到边境线围观。之前一天，一位杨姓边民在中国境内遭缅军流弹炸死。"
		},
		{
			"post_id": 17,
			"title": "美国对中兴通讯开出12亿美元罚单",
			"date_published": 1488932904.009,
			"body": "来源：新唐人\n2017年03月08日 时值中共对韩国乐天施以重罚之际，美国于日前对大陆中兴通讯开出高达12亿美元的天价罚单，其中立即缴纳近9亿美元。\n2015年02月11日 国家发展改革委日前对高通公司滥用市场支配地位实施排除、限制竞争的垄断行为依法作出处理，责令高通公司停止相关违法行为，处该公司2013年度中国市场销售额8%的罚款，计60.88亿元。"
		},
		{
			"post_id": 16,
			"title": "两会奇言神迹收集",
			"date_published": 1488676498.171,
			"body": "来源：BBC新闻\n2017年3月3日  BBC记者沙磊采访遭暴打被迫签认罪书。采访计划：前往湖南省新渡村与一位女性访民杨晴华会面再一道前往北京，一路跟拍。\n杨晴华指称，自家土地遭到强征，父亲在随后的争议中遭到毒打，最终不幸去世。杨灵华本周试图前往北京有特别的原因是，一年一度的全国人大会议3月5日将在北京召开。"
		},
		{
			"post_id": 15,
			"title": "一号提案：建议将学前3年教育纳入义务教育",
			"date_published": 1488512847.349,
			"body": "来源：每日经济新闻 凤凰\n2017年3月3日 获悉，全国政协十二届五次会议提案0001号题目是《关于将学前三年教育纳入义务教育的提案》，第一提案人是中央财经大学校长王广谦。"
		},
		{
			"post_id": 14,
			"title": "美在韩部署萨德系统",
			"date_published": 1499741937,
			"body": "来源：VOA BBC\n2017年07月11日  华盛顿周二（7月11日）宣布，美军当天成功测试\"萨德\"反导系统，拦截了模拟发射的远程弹道导弹。\n2017年05月02日  美国在韩国部署的引起争议的导弹防御系统萨德已经\"投入运作\"。\n2017年04月26日 美国军方周三（4月26日）开始在韩国正式部署\"萨德\"导弹防御系统。\n2017年03月20日 韩国贸易部长在首尔表示，就中国因美国在韩部署萨德导弹防御系统抵制韩国在华企业，韩方已向世贸组织提起诉讼。\n2017年03月07日 美国开始在韩国部署“萨德”。\n2017年03月07日 中国外交部发言人耿爽指出，“在萨德问题上，中方的立场已经非常明确，而且会坚决采取必要的措施来维护自身的安全利益，由此产生的一切后果，由美韩来承担。”\n2017年03月03日 共青团中央官方微博转发了新华社的文章，同时煽动网民要“远离乐天”，抵制韩国商品。\n2017年02月27日 韩媒报导，韩国国防部和韩国的乐天集团计划于星期二（28日）签署萨德系统用地交换合同，实际部署可在今年6月底前完成。\n\n\n\n "
		},
		{
			"post_id": 13,
			"title": "伊斯兰国圣战者威胁血洗中国",
			"date_published": 1488422431.11,
			"body": "来源：BBC新闻 http://www.bbc.com/zhongwen/simp/chinese-news-39135501\n2017年3月1日 由来自中国的维吾尔人组成的\"伊斯兰国\"激进分子发誓要返回家乡让中国\"血流成河\"，这是\"伊斯兰国\"首次对中国目标发出的威胁。这段长达30分钟的视频由在伊拉克西部的一个\"伊斯兰国\"分部发出。\n2017年2月28日 新疆自治区在乌鲁木齐举行反恐维稳誓师大会。赴和田、喀什、阿克苏等地执行反恐任务。\n"
		},
		{
			"post_id": 12,
			"title": "退伍军人中纪委衙前请愿、再上京告御状",
			"date_published": 1487853765,
			"body": "来自：http://www.ntdtv.com/xtr/gb/2017/02/23/a1313040.html\n2017年2月22日，来自中国各地的上万名（德国之声称数百名）退伍老兵，不满地方政府未落实国务院及相关部门的安置政策，冲破地方官员阻挠再度聚集北京，在中纪委大楼前集会请愿，要求中央军委主席习近平解决他们的安置问题。地方当局则在公路上设卡阻挠，多人被打伤。\n2016年10月，大量退伍军人也曾聚集在中央军委大楼外抗议，要求当局妥善处理拖欠退伍军人福利待遇、改善安置等问题。 "
		},
		{
			"post_id": 11,
			"title": "中国女权组织微博账号被禁言封杀",
			"date_published": 1487847169.548,
			"body": "来源：http://www.voachinese.com/a/news-chinese-disident-20170223/3736392.html\n2017年2月23日 在今年人大政协两会召开之前，成立于2009年的女权之声2月21日通过微博账号“还女生平等”，该组织2010年6月启用的新浪微博号“女权之声”，帐号近日被禁言30天，女权活动面临新的压制。\n微博表示，可能与2月14日发布的一篇已遭删除的有关美国女权团体计划在三八国际妇女节，举行一场女性罢工活动的文章有关。这场活动名为“没有女性的一天”(A Day Without a Woman)，由1月21日华盛顿反川普女性大游行的组织者协调。"
		},
		{
			"post_id": 10,
			"title": "中国爆发四年来最严重禽流感疫情",
			"date_published": 1487685778.903,
			"body": "来源：BBC中文 凤凰\n2017年3月25日  2017年3月18日至24日期间，江西省报告H7N9新增病例1例，死亡病例1例。\n2017年3月7日  南昌市政府决定延长该市所有活禽经营市场休市时间，具体为3月8日至3月31日。\n2017年2月23日  国务院常务会议关注了近期在我国多地爆发的H7N9疫情。会议指出，保证药物供应，将相关治疗费用纳入医保。\n2017年2月21日  官方上周二公布的数据显示，上个月，中国有192人感染了H7N9禽流感病毒，其中79人死亡。\n百度搜索“H7N9或禽流感疫情”结果中没有最新情况，到卫计委官方也搜索不到，只有疫情可控和工作布置。还有湖北抓造谣者和台湾疫情升温的新闻。"
		},
		{
			"post_id": 9,
			"title": "郭文贵与韦石论战",
			"date_published": 1487662505.056,
			"body": "来源：郭文贵  @KwokMiles  和韦石  @wmeng8 \n2017年3月7日 郭推文称 韦石和西诺同意删除有关我的虚假信息。\n2017年3月4日（纽约时间） 郭、韦、西诺见面发律师信视频发布。\n2017年3月1日 郭推称同意现身直播，同意明镜陈小平设定直播规则。\n2017年2月23日 郭文贵 发推称推号解封了，美国有关部门以在调查之中。\n2017年2月21日 双方同意在明镜Tv接受一个陈小平先生的直播采访。\n佐拉@zuola 梳理：\nhttp://www.zhoushuguang.com/2017/02/guowenguiVSweishi.html\n\n\n"
		},
		{
			"post_id": 8,
			"title": "香港“占中”期间七警殴打案：全部有罪",
			"date_published": 1487661886.533,
			"body": "来源：http://www.voachinese.com/a/news-hongkong-protests-verdict-20170217/3728882.html\n\n2017年2月21日 香港法庭星期五判决在2014年的民主抗议活动中殴打戴着手铐的民运人士的七名警察两年监禁。该案是在香港引发对警察暴力执法公愤的少见案例。\n在历时79天的“占领中环”民主抗议活动中，警察2014年10月15日被拍摄到将已被带上手铐的抗议者曾健超拖到黑暗角落，对已经倒在地上的曾健超不断踢打。\n区域法庭法官杜大卫判决所有七名涉案警察至少两年监禁，并说这些警员损害了香港警察的“名誉”，殴打行为没有任何理由。\n法庭外，被告的支持者抗议法庭判决，称法官为“洋奴狗官”。\n支持民主的人士赞扬法庭裁决。\n香港正义联盟的邓德诚说，“实在不可想象！太严厉了，实在太严厉了。我们相信正义，我们相信法律。但法律应该对所有人都公平，而不是某一方。”"
		},
		{
			"post_id": 7,
			"title": "前香港特首 曾荫权 被判刑囚20个月",
			"date_published": 1487412934.99,
			"body": "来源：苹果新闻 BBC新闻\n2017年2月24日  到赤柱监狱服刑。\n2017年2月22日  被判刑囚20个月，惟不得缓刑。\n2017年2月18日  香港高等法院法官判决指曾荫权利用公职做出不当行为。现年72岁的曾荫权是香港历史上首位遭刑事起诉和被判有罪的前特首，即香港最高级别政府官员。\n曾荫权被控一项行政长官收受利益罪，\n另外两项系公职作出不当行为的控罪。\n\n"
		},
		{
			"post_id": 6,
			"title": "大庆市民抗议污染项目 忠旺铝业  数十人被捕",
			"date_published": 1487412934.131,
			"body": "2017年2月18日来源 http://www.ntdtv.com/xtr/gb/2017/02/17/a1312136.html\n2017年2月14号，黑龙江省大庆市上万人齐聚在市政府前广场，抗议政府引进高污染项目忠旺铝业，市政府宣布暂停该项目，却持续在施工。16号，当局出动大批警察带着警犬，阻挡示威者靠近市政府，驱离在外围的示威者，约有数十人被捕。民众齐声喊口号，唱国歌。\n据了解，目前市政府已对学校、企业等单位发出通告，禁止参加忠旺项目的游行行动，参加者一律开除。\n"
		},
		{
			"post_id": 5,
			"title": "国师、中国版斯诺登 王林 未言先逝",
			"date_published": 1487141015.948,
			"body": "2017年2月15日 摘自维基 王林（1952年5月6日－2017年2月10日），江西萍乡芦溪县人，气功师，95年取得香港居留权，90年代通过气功成名，2013年王林逃至香港，将自己比作斯诺登。2015年7月15日，王林在深圳因涉嫌绑架杀人被萍乡警方带走，后因病转入医院监管治疗。\n2017年2月10日  多器官功能衰竭死亡。    \n媒体曾展示他出版相册中和许多明星、官员、企业家的合照，其中包括李双江、马云、赵薇、成龙、王祖贤、利智、曾荫权、何鸿燊、吴官正、钱其琛、李瑞环、贾庆林、刘志军、朱明国、李冰冰、李湘、王菲、李亚鹏、周迅、费翔、刘大印、蒋大为、刘晓庆、朱军、李连杰、童非、陈坤、葛军、刘芳菲、江泽玲等，这些合照让他在网络大出风头，其府邸“王府”极其豪华。"
		},
		{
			"post_id": 4,
			"title": "金正恩长兄金正男13日在马来西亚遇害",
			"date_published": 1487122639.639,
			"body": "来源：http://chinese.yonhapnews.co.kr/  BBC新闻\n2017年3月17日 国际刑警就刺杀金正男疑犯发出“红色通缉令”。\n2017年3月5日 马来西亚驱逐朝鲜大使限48小时内离境。\n2017年2月24日 马来西亚警方宣布，用于杀死金正男的毒药是VX神经性毒剂，这是一种被列为化学武器的物质。\n2017年2月21日  马来西亚拒绝了朝鲜的要求，没有交出金正男的遗体。\n2017年2月16日  金正恩前往锦绣山太阳宫向金正日同志表示崇高敬意。\n2017年2月14日  电 金正恩的长兄金正男当地时间13日上午在马来西亚遇害。坊间猜测金正恩暗杀同父异母兄弟为搞个人崇拜扫清障碍。\n\n\n\n\n"
		},
		{
			"post_id": 3,
			"title": "你国法院旁边不能随便静坐围观。",
			"date_published": 1486648329.843,
			"body": "20170209来源，新华网：人民法院落实《保护司法人员依法履行法定职责规定》的实施办法   http://news.xinhuanet.com/legal/2017-02/07/c_1120425905_2.htm          第十一条（十）对于在人民法院周边实施静坐围堵、散发材料、呼喊口号、打立横幅等行为的人，人民法院应当商请公安机关依法处理；对危害人民法院工作人员人身安全的，可以由机关安全保卫部门会同司法警察做好相关应急处置工作，并及时商请公安机关依法处理；构成聚众冲击国家机关罪、聚众扰乱社会秩序罪、聚众扰乱交通秩序罪、聚众扰乱公共场所秩序罪、妨害公务罪等犯罪的，依法追究刑事责任。"
		},
		{
			"post_id": 2,
			"title": "搞定博客发布",
			"date_published": 1486082986.2,
			"body": " 2017年2月3日正月初七，摸索出了博客怎么发布。从博客复制、改变、签名、发布、修改内容、发表博客内容，从头学起，查看教程，#Zeronet 。"
		},
		{
			"post_id": 1,
			"title": "新司机!",
			"date_published": 1486083379,
			"body": "来到 Zeronet 世界的第一篇，欢迎联络\n推特 @windixz"
		}
	],
	"tag": [
		{
			"value": "中国国情",
			"post_id": 18
		},
		{
			"value": "国际政治",
			"post_id": 17
		},
		{
			"value": "中国国情",
			"post_id": 16
		},
		{
			"value": "中国国情",
			"post_id": 15
		},
		{
			"value": "国际政治",
			"post_id": 14
		},
		{
			"value": "国际政治",
			"post_id": 9
		},
		{
			"value": "中国国情",
			"post_id": 5
		},
		{
			"value": "国际政治",
			"post_id": 4
		},
		{
			"value": "中国国情",
			"post_id": 3
		},
		{
			"value": "中国",
			"post_id": 58
		},
		{
			"value": "人权民生",
			"post_id": 58
		},
		{
			"value": "中国国情",
			"post_id": 27
		},
		{
			"value": "反腐",
			"post_id": 27
		},
		{
			"value": "中国国情",
			"post_id": 21
		},
		{
			"value": "香港",
			"post_id": 21
		},
		{
			"value": "中国国情",
			"post_id": 26
		},
		{
			"value": "土地",
			"post_id": 26
		},
		{
			"value": "国际政治",
			"post_id": 29
		},
		{
			"value": "恐袭",
			"post_id": 29
		},
		{
			"value": "中国国情",
			"post_id": 31
		},
		{
			"value": "土地",
			"post_id": 31
		},
		{
			"value": "中国国情",
			"post_id": 30
		},
		{
			"value": "国际",
			"post_id": 28
		},
		{
			"value": "中国国情",
			"post_id": 23
		},
		{
			"value": "人权民生",
			"post_id": 23
		},
		{
			"value": "中国国情",
			"post_id": 20
		},
		{
			"value": "人权民生",
			"post_id": 20
		},
		{
			"value": "中国国情",
			"post_id": 13
		},
		{
			"value": "恐袭",
			"post_id": 13
		},
		{
			"value": "中国国情",
			"post_id": 12
		},
		{
			"value": "人权民生",
			"post_id": 12
		},
		{
			"value": "中国国情",
			"post_id": 11
		},
		{
			"value": "人权民生",
			"post_id": 11
		},
		{
			"value": "中国国情",
			"post_id": 10
		},
		{
			"value": "疫情",
			"post_id": 10
		},
		{
			"value": "中国国情",
			"post_id": 8
		},
		{
			"value": "香港",
			"post_id": 8
		},
		{
			"value": "中国国情",
			"post_id": 7
		},
		{
			"value": "香港",
			"post_id": 7
		},
		{
			"value": "中国国情",
			"post_id": 6
		},
		{
			"value": "人权民生",
			"post_id": 6
		},
		{
			"value": "中国国情",
			"post_id": 78
		},
		{
			"value": "网络",
			"post_id": 78
		},
		{
			"value": "技术",
			"post_id": 78
		},
		{
			"value": "中国国情",
			"post_id": 32
		},
		{
			"value": "网络",
			"post_id": 32
		},
		{
			"value": "翻墙",
			"post_id": 32
		},
		{
			"value": "国际",
			"post_id": 19
		},
		{
			"value": "总统",
			"post_id": 19
		},
		{
			"value": "国际政治",
			"post_id": 24
		},
		{
			"value": "美国",
			"post_id": 24
		},
		{
			"value": "国际",
			"post_id": 22
		},
		{
			"value": "明镜",
			"post_id": 22
		},
		{
			"value": "中国国情",
			"post_id": 33
		},
		{
			"value": "南海",
			"post_id": 33
		},
		{
			"value": "中国国情",
			"post_id": 80
		},
		{
			"value": "老兵",
			"post_id": 80
		},
		{
			"value": "法国",
			"post_id": 81
		},
		{
			"value": "枪杀",
			"post_id": 81
		},
		{
			"value": "华人",
			"post_id": 81
		},
		{
			"value": "中国国情",
			"post_id": 91
		},
		{
			"value": "管控",
			"post_id": 91
		},
		{
			"value": "中国",
			"post_id": 92
		},
		{
			"value": "台湾",
			"post_id": 92
		},
		{
			"value": "人权民主",
			"post_id": 92
		},
		{
			"value": "中国国情",
			"post_id": 93
		},
		{
			"value": "人权民生",
			"post_id": 93
		},
		{
			"value": "网络删贴",
			"post_id": 93
		},
		{
			"value": "国际",
			"post_id": 94
		},
		{
			"value": "政治",
			"post_id": 94
		},
		{
			"value": "联合国",
			"post_id": 94
		},
		{
			"value": "国际",
			"post_id": 95
		},
		{
			"value": "疫情",
			"post_id": 95
		},
		{
			"value": "自然灾害",
			"post_id": 95
		},
		{
			"value": "国际政治",
			"post_id": 79
		},
		{
			"value": "美国",
			"post_id": 79
		}
	]
}