{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1542675872,
			"title": "SOMETHING... (Talking about forums)",
			"body": "//Actually removed.",
			"added": 1542675871
		}
	],
	"topic_vote": {
		"1539101626_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": 1
	},
	"next_comment_id": 21,
	"comment": {
		"1539101626_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 2,
				"body": "Hi, I heard about it, in fact, ZeroNet is a good compromise, but the fact is that there is a very low number of users, also requires a connection through an application and can be too complicated for those who do not know a minimum of how it works.\nIn fact SOLID, has a slightly different way of operating, and still too immature to use it, in addition to the POD is something that allows you to store your data in a private server. and it would not work well in a P2P infrastructure unless a POD manager knows who the POD is of which user.\n\n-----------------------------------------------------------------------\nAnyway, Speaking of TIM.\nbefore discovering the wheel we tried with the squares.\nwhere for squares we talk about the current internet.\n(PS I hope to see more P2P NETWORK like this)",
				"added": 1539125523
			},
			{
				"comment_id": 3,
				"body": "It needs a lot of time to be SOLID xD",
				"added": 1539156756
			},
			{
				"comment_id": 4,
				"body": "> [wabbe](#comment_6_1HiF6gUThBQQqghUPLxc7h2uupMJxwGbzj): . . .  and enough of knowhow . . .\nIt will need a lot of time to be surfable too... since you know... it's SOLID.",
				"added": 1539158955
			},
			{
				"comment_id": 5,
				"body": "> [lola](#comment_86_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u): The POD concept makes me think of FOAF and they actually mention it somewhere in the site. It is a really neat concept but instead of having the POD on servers at your place you seems to host people data and have your data on some people servers. My only questions is are those data encrypted ? [...]\n\nI would prefer to have the possibility to have my data in a server at home, and through a tracker or other, manage the various connections of these db to the various web sites. Obviously, we need a sort of identity manager (Example: ZeroID) but at this point I would integrate it into the local server, where the company comes to personally ask me for access to my information.\n\n(The thing remains disadvantageous, in the case of a slow internet connection and a greater difficulty for users who use mobile ecosystems, besides the fact that it needs a machine permanently on or on at the time of use.)\n\nRegarding the Encripting of what you were asking:\nI'm thinking about the fact that you could use a double key encryption (Private & Public) where the Service asks the Certification Service for permission to obtain the public key, and then the \"POD\" through the private key (inside not visible) ) and the public key (requested through the certification service) and an OTP (which simply serves to ensure that the issue is desired both by the service and by the user) -- if there are errors I apologize, I used google translator.",
				"added": 1539161658
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 6,
				"body": "> [lola](#comment_103_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u): 123\n\nhola lola",
				"added": 1540495204
			},
			{
				"comment_id": 7,
				"body": "BEEP BEEP I MA  SHEEP = COW + SKATEBOARDS",
				"added": 1542321698
			},
			{
				"comment_id": 8,
				"body": "> [shibeotp](#comment_7_13fF8ReM7zvX4ytjPkwEaRtBbtFKeho7XS): BEEP BEEP I MA  SHEEP = COW + SKATEBOARDS\n\nI AM*",
				"added": 1542321737
			}
		],
		"1530162376_139zVkd4AsZqs9qSYk6ypPDAqDcjPCmRm4": [
			{
				"comment_id": 9,
				"body": "Ehi, salve. spero che tu abbia tempo o voglia di leggere ciò che ti sto scrivendo, vorrei che mi spiegassi in modo più approfondito quello che hai in mente.",
				"added": 1542673084
			},
			{
				"comment_id": 10,
				"body": "Do you want talk about internet?, dont use a limited forum like that, i've done a CLONE with (USED: 0.7K/40960K)\nso you can write along without any of that (USED: 4.8K/50K).\n\nhttp://127.0.0.1:43110/1BqtxHnBJJxLgdNw1CTntDs5SPLeA8L9A1/?Home",
				"added": 1542674551
			},
			{
				"comment_id": 11,
				"body": "> [ornataweaver](#comment_80_139zVkd4AsZqs9qSYk6ypPDAqDcjPCmRm4): Thanks, I'd love to.No peers now. It's in the list though.I hope you don't hack me. :D\n\nactually im the only one peer.\nand i hope some people can use this soon, to be always online.\n\nOR\n\ni use my VPS as a \"Server\" for have this forum always online",
				"added": 1542712445
			}
		],
		"1542675872_13fF8ReM7zvX4ytjPkwEaRtBbtFKeho7XS": [
			{
				"comment_id": 12,
				"body": "> [trenta3](#comment_44_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): @shibeotp Actually on this ZeroTalk, nofish checks if someone is close to their limit every two weeks and raises its limit accordingly.\n\ni've seen some threads with people who complain about this limit...\nand 50k as max limit, is very low for who write alot and want keep the thread and the comments.\n\nso... i want ask if can i modify the source code of the Forum and made a unlimited space version.",
				"added": 1542712808
			},
			{
				"comment_id": 13,
				"body": "> [trenta3](#comment_45_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): Not sure if there was a misunderstanding: there is no max limit in this forum: it is simply raised when you are near your curren maximum allowed. You will always keep the thread and the comments. [...]\n\n\nit's a spam protection?",
				"added": 1542723042
			},
			{
				"comment_id": 14,
				"body": "> [leftside](#comment_347_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Indicating that notation on somewhere in this page easy to find for the new users is very important.People got easily pissed off when they face the situation. And turn their back to ZeroNet.\n\nim going to delete the clone",
				"added": 1542724068
			},
			{
				"comment_id": 15,
				"body": "> [thunder33345](#comment_333_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): funny thing is you cant delete it, once you release something into zeronet it's there and forever....deleting it deletes it off your drive, but not mine and other countless peers\n\nit has a little problem... people can not write on it. soo... i think... this site is going to disappear soon. without any other problem. --my english is bad, i know that but if you want kill a site make it not usable...)",
				"added": 1542792219
			},
			{
				"comment_id": 16,
				"body": "> [timelinehyperbot](#comment_33_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): Actually if you are the owner YES you can delete the content.   For example If I made a revision to my timelinehyperbot.bit site and republish it everything within my ZeroNet directory for my site will update. [...]\n\ni think i can build a copy using the source file... and not the CLONE... so if you have the copy and build a new Zsite with the source files extracted... ALSO the data you will have a perfect clone with all the data...\n\nis like make a copy of warframe... xD\ndownload the installer...\ncopy all your data into the USB \ninstall warframe\nand go in your warframe installation and copy all the root folder of the game into the root folder of the new installation... and this is how dont download warframe 350times...\n\n--- Znet \nmake a new website install.. delete all the id files into the Zsite backup(Ztalk... for example)... replace the id files with newone and keep modify until it wont work...\nCopy a site without clone is not impossible.\n\ni imagine that... data... is encrypted using the key of the Zsite... (I THINK... is that.)\n\n\nAll the texts up of this  POINT  Obliviusly is a theory.. (ACTUALLY I CAN ONLY IMAGINE HOW THIS SYSTEM WORKS..)\n\ni have to learn SOOOME from how it works WEBSITE BUILDING here... because is more Complex than PHP and MYSQL (I actually used .NET MVC, PHP and Socket.IO for NODE.JS, BUT all this new concept still weird to me.), i want try to build some sites here... but i cant find a good guide or good documentation on how all the JS, HTML and\nthe DB works togheter... and how to make a MERGED site.. (i want try to make a new forum software) and soon i will publish a Zsite with DETAILS of the project.",
				"added": 1542793562
			},
			{
				"comment_id": 17,
				"body": "People are very active here, I love to see that. ^^",
				"added": 1542793814
			},
			{
				"comment_id": 18,
				"body": "I wanted to know if my project was feasible. (if is not reachable, i'm offilne...)\nhttp://127.0.0.1:43110/1PWSVUZ7kf7BMHRNyGjfHztQwAewDurZJH\n\nsoon I will begin to create the interface. But I have to understand how to make the Merged Site communicate with the main site",
				"added": 1542797019
			},
			{
				"comment_id": 19,
				"body": "> [trenta3](#comment_47_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): Actually I also thought so for long time before seeing some other topic in which nofish himself said such a thing. I hope I could find it again to link it here, but I failed to get it. If you want some clue of that, in the data/users/content.json of this forum you should find that some accounts have their limit raised (like to 100k or 150k).\n\nin my project there are administration & moderation tools, ranks, and personal pages. (i want build a FACEBOOK LIKE forum. (OBLIVIUSLY FACEBOOK IS NOT A FORUM but i want build A forum with some FACEBOOK FEATURES))",
				"added": 1542799043
			},
			{
				"comment_id": 20,
				"body": "> [trenta3](#comment_47_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): Actually I also thought so for long time before seeing some other topic in which nofish himself said such a thing. I hope I could find it again to link it here, but I failed to get it. If you want some clue of that, in the data/users/content.json of this forum you should find that some accounts have their limit raised (like to 100k or 150k).\n\nIf you want some clue of that, in the data/users/content.json of this forum you should find that some accounts have their limit raised (like to 100k or 150k). -- i ve removed the condition directly from the HTML and the USED: 11.2K/50K has been hidden... so i've tested... and ive kill the vertical post management... so... you can not see all the post but you can write unlimited characters... ç_ç is sad. so i tried modifying the CSS Also... and and no body can write on my forum anymore... so i've deleted. :D\n\nand NOW i want to build a new forum software: YES ive already increased the max limit using Content.json.\nbut a forum needs: unlimited space and admin management system.",
				"added": 1542799452
			}
		]
	},
	"comment_vote": {
		"6_1HiF6gUThBQQqghUPLxc7h2uupMJxwGbzj": 1,
		"86_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": 1,
		"28_1QJVjdwjqjGfFp6CtxzWTu19HRusPi9ds6": 1,
		"80_139zVkd4AsZqs9qSYk6ypPDAqDcjPCmRm4": 1,
		"44_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": 1,
		"350_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"33_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": 1,
		"348_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"335_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"47_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": 1
	}
}