{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1585214522,
			"title": "Irish Government tells to only listen to 'trusted media' about COVID-19",
			"body": "\"If we want to halt the spread of COVID-19 it is for all of us to act responsibly in our day-to-day lives, listen to what our public health officials, international health organisations (WHO and ECDC) and trusted media tell us and act accordingly. \"\n\n\"(...) we all have a social responsibility to educate ourselves and others about COVID-19 so that we can protect everyone from catching the infection. Trusted sources of information are those providing advice and information which is public health-led and based on sound scientific evidence. These include websites of the Government, HSE and health agencies, official posters and leaflets in public places, as well as reputable news organisations. >>IT IS IMPORTANT NOT TO RELY ON OR SHARE UNKNOWN AND UNSOURCED COMMENTARY FOR YOUR UPDATES<<.\"\n\nSo Guys, no zeronet conspiracy theories about covid-19.\n\nsrc: https://assets.gov.ie/71728/2b46989c737f4b689eb87842ce80325b.pdf\nIn Ireland's official 16th of March COVID-19 response plan.",
			"added": 1585214521
		},
		{
			"topic_id": 1585214852,
			"title": "COVID-19 Ireland official: 80% light, 14% severe, 6% serious symptoms. Child most immune!",
			"body": "\"(...)Its symptoms, which can take up to 14 days to show, may include a cough, shortness of breath,\nbreathing difficulties and fever (high temperature). Information from the European Centre for Disease\nControl (ECDC) suggests thatʹ\n\n- 80% of people infected will experience a mild to moderate illness, which can be managed at home\nand will make a full recovery,\n- 14% of patients may experience more severe symptoms,\n- 6% of people may become more seriously infected and will require hospital care. \"\n\"Children can be infected and become ill but\nseem less susceptible than persons over the age of 20 years.\"\n\nIreland's official 16th of March COVID-19 response plan:\nsrc: https://assets.gov.ie/71728/2b46989c737f4b689eb87842ce80325b.pdf",
			"added": 1585214850
		},
		{
			"topic_id": 1589887393,
			"title": "➤➤ Not enough death! Russians are too healthy according to USA papers.",
			"body": "American media has no interest in food quality or toxicity levels in Russia however they insist too few Russians die of virus and clearly Russians must be lying about real numbers. Guys and gals, this is rich! It is amusing to see how desperate the American press is.\n\nhttps://www.rt.com/usa/488690-western-media-russia-coronavirus-numbers/\nhttps://www.rt.com/op-ed/488640-covid-msm-russia-death-toll/\nhttps://www.rt.com/news/488543-lockdown-who-coronavirus-russia-vujnovic/\n\n\"WHO representative to Russia, Melita Vujnovic: Nations must develop “a capacity to quickly detect new cases, to quickly identify all the contacts, test them and quarantine them – instead of going for full lockdowns,” the health expert added.\" Let me clarify that in my own words: 'We need to able to battle surround and terrorize into submission all dissidents abusing freedom of speech'.",
			"added": 1589887390
		}
	],
	"topic_vote": {
		"1584287601_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": 1,
		"1584527258_1HeEWnYs69J1BV4P4niDN775yBVqNijhjG": 1,
		"1585024413_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1585101196_1Ahyyr1tEzvP9hZC2iocNTZfEp7zfJwbCJ": 1,
		"1578266325_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"1585212415_19913irDUyBcw4rBHtdPdsMFW5vkqKBTY6": 1,
		"1585234073_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1589899914_1KtGicZG6oM7qTvNE6nW4qbXkNjSo2vifT": 1,
		"1613068421_1Knfo3Xr91jYnAA1idYY9Ce8TDk41LgaH8": 1
	},
	"next_comment_id": 50,
	"comment": {
		"1584324810_19913irDUyBcw4rBHtdPdsMFW5vkqKBTY6": [
			{
				"comment_id": 1,
				"body": "It's the black heads who are going to get most out of this.",
				"added": 1584461165
			}
		],
		"1584527258_1HeEWnYs69J1BV4P4niDN775yBVqNijhjG": [
			{
				"comment_id": 2,
				"body": "Man, what are you talking about?\n\nThe numbers!?",
				"added": 1584529680
			},
			{
				"comment_id": 3,
				"body": "> [32767](#comment_15_1CQXqzcFLdzbuFCAeBSprGqn8nvZpHyySR): Nice calculator skills OP, but this data is only for people who decided to seek medical attention and not self-medicate. So the actual numbers are likely much higher.\n\nAnd those who decide to self medicate might be exactly the people who knew about big farma conspiracy. They might have boosted their immune systems by eating clean organic farm produce and detoxed with herbs periodically. Their death rate would be vastly smaller!",
				"added": 1584534953
			},
			{
				"comment_id": 4,
				"body": "> [ranshit](#comment_111_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): The populous of the planet has been complaining about dwindling resources with no concern over population growth for a long time now.  [...]\n\nIt's the Corporations and Socialist Governments that degraded human experience and polluted the earth. Fuck them to hell for that.\n\nSwapped reusable glass for toxic plastic. Ruined immune systems and make money on farma.\nAND THE FOLK COMPLIED AS PER USUAL.",
				"added": 1584567187
			},
			{
				"comment_id": 9,
				"body": "> [thorburn](#comment_39_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): The universities and the Marxist academics are controlled by the same psychopathic vermin that have lied about anthropogenic climate change, peak oil, the effectiveness and safety of vaccines, historical narratives and the over population myth etc.  [...]\n\nWell said brother, well said!",
				"added": 1584713832
			}
		],
		"1584572234_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY": [
			{
				"comment_id": 5,
				"body": "> [styromaniac](#comment_1951_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): At first I was like \"Wat,\" but then I realized this isn't some cookie cutter bot shenanigans. [...]\n\nMaybe he is .... a paid humanbot \nLOL\n\nhumano botino",
				"added": 1584604720
			},
			{
				"comment_id": 6,
				"body": "> [styromaniac](#comment_1952_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): That website looks like a classifieds for helping out people concerning the pandemic.\n\nNot to sound harsh; Immune system and detox people. The information on how to keep your body at its best so it can defeat against virus toxins is the best way to help. What are we to donate for masks or gloves?",
				"added": 1584657582
			},
			{
				"comment_id": 7,
				"body": "> [mariage](#comment_15_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY): I'm not a human bot. Thanks for the link robione ;)\nhttps://covidbase.com :\n\"We hope that this helps you get involved. COVID-19 is a historic event. We want to be on the right side of history.\" \n\nI wonder; What is THE RIGHT SIDE OF HISTORY?",
				"added": 1584690575
			},
			{
				"comment_id": 8,
				"body": "> [robione](#comment_501_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): https://covidbase.com for all sorts of projects\n\nSome thrive on crisis, some thrive on preventing crisis from ever happening.\n\n'Filantropy' done daily, when almost nobody notice the good deed but the good deeds add up over time and the difference is made. \n\nNo applause, just personal satisfaction.",
				"added": 1584690951
			}
		],
		"1584769181_13W2cW8ZhgjC9KJXzvPXyCkafHsiegKvyu": [
			{
				"comment_id": 10,
				"body": "> [sfs9](#comment_68_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD): I wonder, will some of the merchants be executed for the deaths that the CV-19 caused within the Chinese(...)?\n\nAre you out of your fracking mind or trolling? Millions of people in the world don't wash their tables or hands and most of the time nothing dangerous infects people. One in a million case somebody doesn't clean something people get infected. And suddenly they should be executed? How do you prove the virus would not get into population some other way completely?",
				"added": 1584788777
			}
		],
		"1584867258_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 11,
				"body": "Thanks!\n\nWhat do you think of the new vs older versions of zeronet? \nAren't you sensing newer 0.7.1 is another step in the wrong direction?",
				"added": 1584871018
			}
		],
		"1581976802_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 12,
				"body": "Hi guys!\nHow actually needed and beneficial is this proxy server? Wouldn't it hurt zeronet more than build it up? \nWhat are your opinions?",
				"added": 1584872489
			}
		],
		"1585024413_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 13,
				"body": "Go for it! Waiting.",
				"added": 1585044231
			},
			{
				"comment_id": 20,
				"body": "> [geekless](#comment_189_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Just noticed, the site doesn't open on outdated ZeroNet versions, since content.json contains utf8 paths.\n\nOh man! Here we go again. Updates will destroy zeronet.",
				"added": 1585242468
			},
			{
				"comment_id": 21,
				"body": "Арби Цураев, Chechen and Russian subtitles:\nIt sounds cool. Oldschool.",
				"added": 1585242810
			},
			{
				"comment_id": 22,
				"body": "Your videos seem to be incredibly well seeded! Fair play to you.",
				"added": 1585243249
			}
		],
		"1585004492_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 14,
				"body": "> [aspidochelone](#comment_382_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Why would the vaccine be a mark of the beast?  A good tree bears good fruit ... if the vaccine saves lives, how can it be evil?  Don't be turned into a tool for the virus.\n\nOh man, thats funny!",
				"added": 1585044691
			}
		],
		"1585150775_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 16,
				"body": "As they say 'One loses one gains'.",
				"added": 1585164956
			},
			{
				"comment_id": 17,
				"body": "> [memnoch](#comment_6_1DN3VWX7wRD71B6i3GYvVkBXzJWWUGFb1Q): Heard of swatting? Now just call the police and tell them your neighbor coughed on you.\n\n3 months arrest just for start.",
				"added": 1585174157
			}
		],
		"1585212415_19913irDUyBcw4rBHtdPdsMFW5vkqKBTY6": [
			{
				"comment_id": 18,
				"body": "Turns me on.",
				"added": 1585217031
			}
		],
		"1585234073_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 19,
				"body": "I saw buzzfeed and then I turned around. Bye",
				"added": 1585241816
			},
			{
				"comment_id": 25,
				"body": "> [thorburn](#comment_41_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Sounds like more BS. [...]\n\nThat's what I call a heavy delivery!",
				"added": 1585312700
			},
			{
				"comment_id": 32,
				"body": "> [xcape2net](#comment_732_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz):  I guess covid-19 must be one of nature's means of culling the human population of idiots!\nYou are so incredibly retarded psychologically and intellectually that I literally gave up making a statement about uselessness of cv-19 tests and how it's all a scam and a hoax.\n\nHere is a debunking of Covid-19 anyway. http://127.0.0.1:43110/big.kopykate.bit/?Video=1587400553_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL",
				"added": 1588172701
			}
		],
		"1578266325_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 23,
				"body": "Just look who is his 'top adviser' and husband of his daughter and that's all you need to know.",
				"added": 1585292951
			}
		],
		"1585214522_1DWCrTtmJ1g3gLgwENAmzG75QvTkmjmoFv": [
			{
				"comment_id": 24,
				"body": "> [thorburn](#comment_42_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): The problem is the sources they cite as trustworthy are the least trustworthy sources based on past performance. This occasion is no different...the real fallout from this is yet to come, and it a crime equal to if not greater than the finical crash and bank bailouts of 2007/8. The economic issues they have created as a result of this BS will have long reaching effects on a massive scale!  [...]\n\nYou said it brother. They claim that they order a close down only of places deemed not necessary. So bicycle repair is closed. Who the fuck has the nerve to decide that this one is unnecessary? So if my car breaks and my bike is the only means of transporting food.... Those cunts also tried and did ban 'high dose of toxic' vitamin A fish oil source. Some countries in europe go after vitamin D. \n\nI mean fucking democracy. Where's high treason executions?",
				"added": 1585294207
			}
		],
		"1585314197_13EafRdDw5sZF42dTn68uDdcssTWKbdauJ": [
			{
				"comment_id": 26,
				"body": "Idiocracy!",
				"added": 1585314862
			},
			{
				"comment_id": 27,
				"body": "> [deepnude](#comment_11_13EafRdDw5sZF42dTn68uDdcssTWKbdauJ): ok... if you are telling the truth, why all this are happening now?\n\nI never said it's not true. I only said peoples behavior especially in the emergency time like this says about them. Like buying out toilet paper and white flour (God only knows how many even know how to use it). For any preppers thats useless crap.",
				"added": 1585342725
			}
		],
		"1585342480_1HJtxgNm8uvChV6fixT4Y3FiupwfkAjC3d": [
			{
				"comment_id": 28,
				"body": "Great question one i asked in the past. I'll try to find the answer.",
				"added": 1585342785
			},
			{
				"comment_id": 29,
				"body": "> [aassddff](#comment_75_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): How many breads have you eaten in your life?\n\nMost breads contains glyphosates. I cut it down to a loaf per six months by now for a few years. BTW Reduced greatly my health issues. That estimate is easy in my case.",
				"added": 1585382583
			}
		],
		"1585399613_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 30,
				"body": "> [arione](#comment_1_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY):\" install cameras everywhere so 'good guys' can watch everybody or do we educate people in self defense and allow them guns?\"\n\n\"Victims complied with this demand, fearing the exposure of their personal information. The criminals then ordered the victims to send nude photographs of themselves. The victims did so in hopes that this dreadful situation will stop in a week.\"*\n\nThis whole thing is based on mistake 1: 'Allowing to reveal ones personal info' and mistake 2:'Giving in to a fraudulent blackmail'. Just as Arione said; educate people in self defense ie preventing the criminal from ever getting to us. Lack of IT skills and psychological element. \n\n*reddit.com/user/Invisibleuser444/comments/fmj3zv/nth_room_rise_of_digital_sexual_slavery_and/",
				"added": 1585405129
			},
			{
				"comment_id": 31,
				"body": "> [bisks](#comment_5_1Pf7ntfCB66Jxn5dkCubd28dB5saz4z9uS): Which one of your suggestions will stop the violent crime? I know which one will create more violent crime.\n\nWhich one? Seriously!?",
				"added": 1585405338
			}
		],
		"1588322954_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": [
			{
				"comment_id": 33,
				"body": "Didn't you just post that same thing under a different user? Weird.",
				"added": 1588323379
			}
		],
		"1589901479_1MizsvcH4wSCPrUrB2uiRwbSzSSjngP42t": [],
		"1589887393_1DWCrTtmJ1g3gLgwENAmzG75QvTkmjmoFv": [
			{
				"comment_id": 35,
				"body": "In Russia there's been too many tests done somehow and MSNBC is not happy. You see in the west big issue is that expensive tests are too few so they always spin it 'we cannot go back to normal life' because asymptomatic people are spreading covid-19 it's claimed (hocus pocus harry potter boom!). If you say tests are unreliable you hear there is many kinds made by different companies. Alright, lets accept that. So no one is taking responsibility for a single scientific standard. Now Russians make many tests and test their population and say things are getting better, UV light of the summer sun will further kill viruses while UN says it will come back. You know, somehow they know that but cannot produce tests and cannot give any scientific details. Just imagine the sheer extremity of frustration when massive country like Russia might question basis for 'the state of emergency' and power grab.",
				"added": 1589906691
			}
		],
		"1589754742_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 36,
				"body": "@storymaniac you need to seriously start researching this topic so your opinions and judgments are solidly based on science and logic. You do not have a shred of evidence virus can work or spread they way it is claimed. It is known people had unusual breathing problems this year. If you had seen and read the reports I have, you would be aware that some postmortem showed people had their lungs destroyed in a way similar to an instant exposure to 10 000 feet altitude. Experienced medical doctors know of no way any virus can ever do such extreme damage to human lungs. Furthermore you should know such effect might be related to a situation where normal atmosphere loses its normal oxygen level. Going a step further it should be pointed that emitting 60 GHz radio wave could break down oxygen molecules in the atmosphere possibly making it harder for the body to obtain oxygen into its blood.\n\nI cannot understand how your suggestion makes sense and why would people not following it be 'assholes'. Why don't you wear gloves and a very tight builders or altitude mask if you are concerned?     \n\nUsing some untested method against an invisible unidentified enemy doesn't sound like a likely victory. Lot's of paranoia though. Maybe people should consider paying attention if there are some locations where it is harder to breathe for many people?",
				"added": 1589908333
			}
		],
		"1589742530_19ZUAyEjVPBC7EDfQoBfaugohL6HzE1qWt": [
			{
				"comment_id": 37,
				"body": "> [18ah](#comment_3_12fCWwfnxJDBdHDfUeocZTaopYmsvJadbP): That's ridiculous! [...]\n\nAnd a brothel.",
				"added": 1589908519
			}
		],
		"1589783095_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": [
			{
				"comment_id": 38,
				"body": "Here at least, you can talk things out. On YouTube you cannot have any meaningful arguments.",
				"added": 1589912565
			},
			{
				"comment_id": 41,
				"body": "> [ransbits](#comment_15_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A): Adding the user to my local blacklist was my response to his files appearing in my seedbox without my authorization \n\nWas this because of an exploit?",
				"added": 1589961395
			},
			{
				"comment_id": 43,
				"body": "> [p0rtal](#comment_32_1A5NgDyiTqhcBgrm8SuSEhaygTXuc7ogt2): We need the universal file system in ZN. Otherwise it will be pointless having stuff scattered around small zites and endlessly trying to find what you search for. \n\nAll eggs in one basket?",
				"added": 1589971122
			}
		],
		"1589899830_18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF": [
			{
				"comment_id": 39,
				"body": "On a side note [some nice graphics on IFS](http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:main+type:image+f_type:jpg+page:11) ",
				"added": 1589913733
			},
			{
				"comment_id": 40,
				"body": "As an example [this](http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f1_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_item_2050+type:image) There is much more there.",
				"added": 1589914740
			},
			{
				"comment_id": 42,
				"body": "> [eroge](#comment_18_18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF): ... where a woman are raped and killed .... [...]\n\nEither report this to somebody who has admin control so this person can ban the user or stop raising alarms and make accusations in public! So far you are the only one who makes wreckless things and a mess on other people's zites. #metoobs",
				"added": 1589970910
			},
			{
				"comment_id": 44,
				"body": "> [eroge](#comment_19_18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF): You know who is the IFS admin? maybe all these files disappeared because a bug not because an human. i'm doing only hypothesis.\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1589783095_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A\n\nreport and ask everything the author preferably zeromail for really private things if is not able to deal with all you need he might know who is able",
				"added": 1589974643
			}
		],
		"1590076293_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 45,
				"body": "> [aassddff](#comment_58_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): Easier to say that X is a honeypot with backdoors than to prove that it truly is.It's like people forcing the idea that Tor isn't safe because the US Navy made it. Obvious CIA tactic to get less people to use tor.\n\nreverse psychology, sure",
				"added": 1590138312
			},
			{
				"comment_id": 46,
				"body": "> [zaron](#comment_93_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): Did you just say white nationalists should blow themselves up?\n\ni read; keep story super short whites are easy target for fraudulent litigation (persecution).",
				"added": 1590138501
			}
		],
		"1611787253_139pHaxesZa11czwptXVY62ZrNWUh4NxRQ": [
			{
				"comment_id": 47,
				"body": "@patriotbase then don't download them! Talk to your patriot friends and create your zite, open and seed only your zites. Invite newb to your zites only to seed your content only. Simple! Use zerohello left zite list to delete all zites from your hardrive that you don't want.\n\nStaying Safe on ZeroNet - who the f talks like that!? Blauhhhh!",
				"added": 1611921048
			}
		],
		"1612458385_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": [
			{
				"comment_id": 48,
				"body": "USA is ending",
				"added": 1612554576
			},
			{
				"comment_id": 49,
				"body": "> [radiator](#comment_58_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE): agreed. got preps?\n\nYes. That's the end of the corporation not the people.",
				"added": 1612613174
			}
		]
	},
	"comment_vote": {
		"15_1CQXqzcFLdzbuFCAeBSprGqn8nvZpHyySR": 1,
		"2_1PHntD2ruZCta8SpVvFTjvDSKaCZZEaXRG": 1,
		"18_1GhYmYygr9AwgLDix4ge5AAQiMa4voJGuC": 1,
		"1_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": 1,
		"3_12fCWwfnxJDBdHDfUeocZTaopYmsvJadbP": 1
	}
}