{
	"posts": [
		{
			"id": "793c9343-05f6-4eb3-85db-861c058e87a8",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "8fd34724-1136-4992-8b39-45434706b9bc",
			"body": "Thanks for posting this. Cuckchan is full of shill spam, Voat isn't paying attention to anything meaningful, and Ron's twitter comments are full of drooling evangelical qtards.",
			"time": 1567735358336,
			"files": "[]"
		},
		{
			"id": "53054a5c-d415-47da-b988-1576a9832d53",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "516c8312-9c2d-4f0f-9755-7b62503dd0a1",
			"body": ">>948c3dfc-42ba-4b6d-8567-a783db0e4e85\nGreat post. So use platforms like this with higher skill barriers of entry to create memes/messages, then distribute them on other platforms to circulate to normies? I like that, it allows us to create effective memes and refine them without discussion being bogged down by idiots. Even if 8ch comes back we can just use it as another avenue to spread memes, and save the meaningful discussion for here.\n\nFire up those image editors gentlemen, and let's do what we've always done best.",
			"time": 1567810995779,
			"files": "[{\"name\":\"weeb neighborhood.png\",\"thumb\":\"3da8c1bf20a183b279337a305ea7bb9a2b422960-thumb.png\",\"size\":235989,\"type\":\"image/png\",\"original\":\"3da8c1bf20a183b279337a305ea7bb9a2b422960.png\",\"directory\":\"1B2qzik7dRzaCRqwuGUNjTjuxQNPwSiPbi\"}]"
		},
		{
			"id": "bc6367df-5540-4015-b7da-c27c00d5cf1a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "516c8312-9c2d-4f0f-9755-7b62503dd0a1",
			"body": ">>5bf48df6-2d01-43ba-ae15-61731d00da38\nTwitter has become extremely heavy handed lately. The best advice I've seen for dealing with the mobile number issue is using a cheap burner phone you bought with cash and using that to confirm your account. It would probably be best to buy it, and confirm your account with it away from home so you can't be pinpointed via GPS. Then turn it off and store it if you end up needing it again.",
			"time": 1567829218485,
			"files": "[]"
		},
		{
			"id": "26c8d303-8cb7-4c21-a30e-0e372b47318c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "516c8312-9c2d-4f0f-9755-7b62503dd0a1",
			"body": ">>5bf48df6-2d01-43ba-ae15-61731d00da38\nAnother option would also be to initiate private discussions with people who already have a decent social media presence that would be sympathetic and ask them to post your content. They'll get a vanity boost from it, so it will appeal to them as well.",
			"time": 1567829614985,
			"files": "[]"
		},
		{
			"id": "17c47442-b981-4b8c-9f7f-eff85d631007",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "516c8312-9c2d-4f0f-9755-7b62503dd0a1",
			"body": ">>c8b2a0a1-98b6-4997-84c0-aa544395066c\nYou miss it, don't you? That's why they've attacked it to this point of taking it offline. That's why it likely wont come back easily without tools implemented to control/manipulate it. They're frightened at the power it had in hands like yours.\n\nIt might be best to just embrace our new home and try and contribute to it as much as possible. If 8chan was going to come back without methods of controlling discussion (aka more than just 'Odin' as Ron said) then I think it would be back up by now.\n\n'Odin' itself will need multiple people watching things 24/7 to be meaningful. Ron/Jim aren't going to start paying people salary to carefully watch the site around the clock in order to control discussion surrounding major happenings. That mean's they'll have to outsource the job to feds.",
			"time": 1569194652903,
			"files": "[{\"name\":\"4741ce0acfc1e2288788ed9377722604d674864180615b0bd9f3b05b2850ad84.png\",\"thumb\":\"59603957549d0688417de54d574930852b52a5dd-thumb.png\",\"size\":357946,\"type\":\"image/png\",\"original\":\"59603957549d0688417de54d574930852b52a5dd.png\",\"directory\":\"1B2qzik7dRzaCRqwuGUNjTjuxQNPwSiPbi\"}]"
		},
		{
			"id": "0253a3c1-ed14-4a28-b44f-e8ae51f75ab4",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6d0b84ff-2133-47ce-9c4f-dc3c7d8881d3",
			"body": "It ended up as nothing more than some zoomers begging for subs on their streams while they played with plastic thanos gloves while wearing capes. Whenever people told them to actually cross any lines on the base their faces turned into masks barely concealing horror at the possible consequences. They also got approached by multiple, obvious undercover cops and literally signed multiple papers that strangers were handing them.\n\nIt amounted to a handful of idiots attention whoring, funny at least.",
			"time": 1569204869378,
			"files": "[]"
		},
		{
			"id": "47f59f3c-cec1-4dcc-be38-da872a67912f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4c662606-d87c-4429-9166-7badef17c4c8",
			"body": ">hotwheels becomes a fat leftist christian\n\nHis mind is now as crippled as his body.",
			"time": 1569807194011,
			"files": "[]"
		},
		{
			"id": "2aec61d0-3a4e-4a7d-838e-ae3984f220ce",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5dfa8ea9-aead-4412-8f9e-77120e1d216d",
			"body": ">>6e988aed-4d56-4b9d-a87e-0a846b33deeb\nI believe you're spot on regarding their desire to alter the human diet to weaken humanity in general, making them easier to control. This is actually how modern prisons operate. We've grown up to think prisons are full of crazy muscle heads by the media but it's actually the opposite. Most prisons now underfeed prisoners so they can't build muscle at all, and they end up looking like half starved drug addicts. Obviously that diet will effect their minds as well.\n\nI don't believe they want to limit travel though. They're investing in ways to broaden travel if anything, especially to places like africa so they can flood the world with lower IQ genes they can more easily control. That's a huge reason they push race mixing so hard.  They know humans build unity most along racial lines, unity in groups means competitors for control will arise, competitors mean they're power could potentially be challenged.\n\nThe earth's climate and overall structure changes naturally on it's own and is effected in large part by the sun, note the sun seems to be entering a GSM as sunspots have been mute for a while now. The \"climate change\" crowd seems to be focused exclusively on developing means of control on western nations while ignoring massive polluters like India and China:\n\nhttps://www.cnbc.com/2019/05/23/china-emits-illegal-greenhouse-gas-that-destroys-ozone-layer-study.html\n\nI believe their push in the climate change crowd is for 3 purposes:\n1. They see a natural bottleneck forming and are trying to act as gatekeepers of tech that could help humanity survive a changing climate, thus allowing them to gain more wealth and power over humanity in general. AKA: exploit a problem instead of fixing it.\n2. Using it to further put in methods of control over advanced nations.\n3. Use the entire topic as another means of \"divide and conquer\" amongst the general population.",
			"time": 1570242218388,
			"files": "[{\"name\":\"go getter.png\",\"thumb\":\"8d64b6a70b427a2e09e5bc88c19060d0b1a29d78-thumb.png\",\"size\":72351,\"type\":\"image/png\",\"original\":\"8d64b6a70b427a2e09e5bc88c19060d0b1a29d78.png\",\"directory\":\"1B2qzik7dRzaCRqwuGUNjTjuxQNPwSiPbi\"}]"
		},
		{
			"id": "c08859ff-46e7-42cb-ac2c-889b77751fe2",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "a566a0e7-2761-41e5-966e-3d40ae56d581",
			"body": ">>c4d3d013-97ac-4916-963e-e87d45fd41e3\n>>6d49e949-2cac-439b-9cbf-2867594863a4 has a point. Several other boards/sites tried that tactic with poor results. It's obnoxious and comes off as manipulative, so it immediately creates a negative association. It's also very easy to wordfilter. You're better off creating a short, catchy meme image to pass around at varying sizes to avoid spam detection. Then talk about it in threads using vague terms (like \"4+4chan\" was used on 4chan) to spark people's curiosity in checking it out. If anyone mentions the illegal content on the \"dark web\" just remind them that as long as they don't seek the content, it isn't an issue. Unlike Tor that content doesn't touch your machine unless you actually seek it out.",
			"time": 1570439917918,
			"files": "[]"
		},
		{
			"id": "46655a0f-afd2-4d8d-9c6e-dd6f7959cdb2",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4dedafae-793a-42dc-a493-fb2287fb2b1a",
			"body": ">>e2f7a771-a03c-419c-bd9a-96ce0b69e545\nHe stated that he wanted to only use the admin capcode shortly and then stop using it from then on so he could just be another anon. He may be doing so at this point.",
			"time": 1570521553926,
			"files": "[]"
		},
		{
			"id": "c1917bb5-7a3a-4126-aedf-02cf5cb46446",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "a566a0e7-2761-41e5-966e-3d40ae56d581",
			"body": ">>dcb20305-12b6-40b6-a510-239c5588b844\nThat's informative, but a bit too busy. Try this.",
			"time": 1570704726397,
			"files": "[{\"name\":\"zeronet2.png\",\"thumb\":\"fd6ee3e0a6c41d5bc2001748d96705a25a0c8a17-thumb.png\",\"size\":542728,\"type\":\"image/png\",\"original\":\"fd6ee3e0a6c41d5bc2001748d96705a25a0c8a17.png\",\"directory\":\"1B2qzik7dRzaCRqwuGUNjTjuxQNPwSiPbi\"}]"
		},
		{
			"id": "6b9e1faf-b3fd-4a15-94ec-c7b71246452b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "26e54f93-d288-4c77-81e6-a8636d45beff",
			"body": "I was annoyed by what he was doing, but now I'm pretty amused. If you do a traceroute on 8kun.net, you'll find two hops in which it goes through the DoD subnet. The bitter little cripple may be stepping on more toes than he realizes.",
			"time": 1571432682574,
			"files": "[{\"name\":\"DoD subnet.png\",\"thumb\":\"0d0645987df6abecc1461df86cedaf50540da9c7-thumb.png\",\"size\":28397,\"type\":\"image/png\",\"original\":\"0d0645987df6abecc1461df86cedaf50540da9c7.png\",\"directory\":\"1B2qzik7dRzaCRqwuGUNjTjuxQNPwSiPbi\"},{\"name\":\"traceroute 8kun.jpg\",\"thumb\":\"e2756fc789bc92d00e6fc12dd0e4a3c56cb51772-thumb.jpg\",\"size\":224636,\"type\":\"image/jpeg\",\"original\":\"e2756fc789bc92d00e6fc12dd0e4a3c56cb51772.jpg\",\"directory\":\"1B2qzik7dRzaCRqwuGUNjTjuxQNPwSiPbi\"}]"
		},
		{
			"id": "200e4375-bec5-471d-a73a-5a3163eae093",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c13a92f0-34e5-4a30-83c9-b9d89b593ee6",
			"body": "Thank you for your continued work admin, we appreciate it.\n\nI wouldn't get too bent up about the cripple. 8kun is routing directly through the DoD. Traceroute 8kun.net and you'll see multiple hops through the 11.xxx.xxx.xxx subnet, which is DoD exclusive. Ol' freddy got too overzealous in playing the judas, and by the looks of it is standing directly in the way of a massive hardwired honeypot.\n\nRegarding traffic, maybe some sort of standalone \"pocket\" version of everything to distribute would help attract and hold more users. Something like a zip file that has zeronet, the required version of python that is portable, a portable browser, and a shortcut to 08chan in it. Something kind of all-in-one like the tor browser that removes the extra legwork of getting everything set up? I'll try putting something like that together.",
			"time": 1571655236445,
			"files": "[]"
		},
		{
			"id": "02704c82-38ad-4f48-9c0a-9af60e498781",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c13a92f0-34e5-4a30-83c9-b9d89b593ee6",
			"body": ">>182cb33e-114c-4363-8730-6998db97b3cc\nYoutube-dl is a great tool for the video issue. It works with a simple command line argument, is cross platform, and supports several sites (such as twitter) in addition to youtube. Try rehosting them on bitchute afterwards.",
			"time": 1571687546700,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}