{
	"next_comment_id": 15,
	"user_name": "Krixano",
	"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
	"post_like": {
		"17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P_1554236092": 1554297036,
		"1DjCUmkQqfrh4PZueVGAdMS1f4EmUAc3yJ_1555574400": 1555604799
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Nickwa: A lot of people don't have money - so it's nice to be able to donate to someone with CPU mining (if it is actually worth it - haven't done the math).",
			"post_uri": "1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj_1554240040",
			"date_added": 1554254980
		},
		{
			"comment_id": 2,
			"body": "Hello!",
			"post_uri": "1HyfQZJewq333XifGc1UMiwEazYMyFosjX_1",
			"date_added": 1554580838
		},
		{
			"comment_id": 3,
			"body": "There's also PEX and Local Peer Discovery that's been implemented. This is essentially what Kaffie is alluding to.",
			"post_uri": "1EFLroGh9zMMx1bAuzhLvjLDnTyqQLwqdC_1554973809",
			"date_added": 1555008812
		},
		{
			"comment_id": 4,
			"body": "Yes, it works both on KxoVid and by going directly to it. The video already has a few peers for me.",
			"post_uri": "14L1inX5hW3xqPPL5HZ9zw1M1ne9ywEM6y_1554993263",
			"date_added": 1555008986
		},
		{
			"comment_id": 5,
			"body": "@Smopro: We don't know your filesystem, so there's no way of us knowing where you put your ZeroNet folder - that's *your* responsibility. Also, you have \"user\" as the user - is that really your username? If not, replace that with your username.",
			"post_uri": "1DjCUmkQqfrh4PZueVGAdMS1f4EmUAc3yJ_1555537507",
			"date_added": 1555556113
		},
		{
			"comment_id": 6,
			"body": "Ok, first of all... It was never released. Secondly, it's not finished - which is why it was never released. **Not every github repo is finished/released or should be used (and to think so *is* dumb).** Thirdly, because it's not released, there isn't any need yet to have documentation until it's released. Additionally, nobody's expecting anybody to use it yet (hence why it wasn't released), so why are you complaining.\n.\nSo the question is, why do you want to use something that's unfinished, not released, and has no documentation *because* it's not released? Additionally, why are you complaining about something that's unfinished, unreleased, and especially when you don't even know if it's close to being finished or even works?\n.\nBtw, if you looked at the one issue in the repo, the creator already says everything I've just told you.\n.\n> maybe this buddy thinks everything is clear\n\nOR MAYBE IT'S UNRELEASED *AND* UNFINISHED (asshole).",
			"post_uri": "1D5T43r4Ty2RDUa5a99WDyzvB4juRthkbH_1555524795",
			"date_added": 1555556202
		},
		{
			"comment_id": 7,
			"body": "@Smopro: I didn't mean the filesystem type - I meant we can't see your folder/file structure - so we don't know where the paths to things are.\n.\nAnyways, I suspect it's actually a problem with **that specific repo** - because just tried it and it doesn't work for me.\nOther repos from GitCenter work for me though - so it's a problem with only that repo.",
			"post_uri": "1DjCUmkQqfrh4PZueVGAdMS1f4EmUAc3yJ_1555537507",
			"date_added": 1555568770
		},
		{
			"comment_id": 8,
			"body": "@Smopro: Talking to @gitcenter now. He knows the problem and is thinking about a fix right now. This particular git repo uses packed-refs with empty refs folder. Since the refs folder is empty - ZeroNet doesn't publish it (so rather than the folder being empty, the folder simply doesn't exist). Git checks for this refs folder in order to determine whether it's an actual repo. Because of this, it thinks it's not a proper repo.",
			"post_uri": "1DjCUmkQqfrh4PZueVGAdMS1f4EmUAc3yJ_1555537507",
			"date_added": 1555569393
		},
		{
			"comment_id": 9,
			"body": "@Smopro: Did you not read what I just said? **It's a gitcenter bug with this specific repo** and @gitcenter is working on a fix. Also, nobody called you a looser.\n.\nForking the repo just *copies* the repo... that won't fix anything.",
			"post_uri": "1DjCUmkQqfrh4PZueVGAdMS1f4EmUAc3yJ_1555537507",
			"date_added": 1555570013
		},
		{
			"comment_id": 10,
			"body": "@James Archer: You should read my comments. I already explain what the bug is and how I've already told @gitcenter: about it.",
			"post_uri": "1DjCUmkQqfrh4PZueVGAdMS1f4EmUAc3yJ_1555537507",
			"date_added": 1555604650
		},
		{
			"comment_id": 11,
			"body": "You're messages aren't stupid. You were occurring a legitimate problem that happens to be a bug on Gitcenter. And git's messages aren't always the most useful or good.",
			"post_uri": "1DjCUmkQqfrh4PZueVGAdMS1f4EmUAc3yJ_1555574400",
			"date_added": 1555604839
		},
		{
			"comment_id": 12,
			"body": "There's the PeerMessage plugin - KxoId, 0Play Game Center, and now StreamZ use it to get real-time communication *and broadcasting* in ZeroNet. Goto the Wiki page Here: https://github.com/HelloZeroNet/Plugin-PeerMessage/wiki\nThere's also an explanation on KxoNetwork on how KxoId uses the PeerMessage plugin - http://127.0.0.1:43110/kxonet.bit/?/kxoid",
			"post_uri": "1gyp68xGQMYy4CBjedTvYU6xsyxPv1Bzc_1555954604",
			"date_added": 1555993800
		},
		{
			"comment_id": 13,
			"body": "There's also [KxoVid](/kxovid.bit) and ShareTube. KxoVid has music videos, a documentary in 4K, some tv shows I've uploaded, and some other videos - of course, klu9 already knew that, but chose not to tell you this (which is a deliberate disservice to you, imo - but of course he probably didn't like that I told him off for being a jerk, lol).",
			"post_uri": "1Fnk5S9aU2kCvTFtYMWosbE9NFaRjgeemo_1555930698",
			"date_added": 1555994395
		},
		{
			"comment_id": 14,
			"body": "@Ovzrand: Click the pencil icon when you hover over the posts body, then click the Delete button.",
			"post_uri": "1FGrET9DDJFjD8KDT4TiGmjDN3FUaPD6vK_1556901160",
			"date_added": 1556903290
		}
	]
}