{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1525589246,
			"title": "My institutionalisation is now Semi-permanent.",
			"body": "I should have never turned myself in.. but oh well, as long as I have my small tablet, I can work on things like KopyKate and javascript projects. Write a book, too. My GTX-1070 rig is safe at home. God knows how long I'll be in here, tough. Could be 2 days. Could be 6 months.\n&nbsp;\nI should do fine. I've lived in near-isolation for nearly half my life. As long as I have internet access, a quiet place and a computer, I am free.",
			"added": 1525589245
		},
		{
			"topic_id": 1525594763,
			"title": "Jordan Peterson's Crusade; Backfired.",
			"body": "https://www.mercurynews.com/2018/05/03/jordan-peterson-is-on-a-crusade-to-toughen-up-young-men-its-landed-him-on-our-cultural-divide-2/\n&nbsp;\nSeems to me that we really do need new heroes and role models in this world. It's not the 90s and 00s anymore. We may well be heading toward the most difficult period in human history.. in terms of our psychological wellbeing. Oh and that artificial intelligence thing...\n&nbsp;\nWe all dream of space travel and robots .. but is space travel something you can Psychologically handle? Can you trust robots to always do as they're told? hm..",
			"added": 1525594761
		},
		{
			"topic_id": 1525633769,
			"title": "Monday is Judegment Day",
			"body": "God created Earth in 7 days. Now we all get to go home.",
			"added": 1525633766
		},
		{
			"topic_id": 1525663104,
			"title": "I give up",
			"body": "Got sentenced to life in a mental institution. Oh well.. I'll let the silence speak for itself. At least now I can program all day without worrying about rent and bills.",
			"added": 1525663100
		},
		{
			"topic_id": 1525667222,
			"title": "Once you've been there, done that... gotten the shirt...",
			"body": "Only then, can you achieve enlightenment.",
			"added": 1525667217
		}
	],
	"topic_vote": {
		"1525566365_1KpyUiV4979ikm29guQEqDmMrNZG4SFfLY": 1,
		"1525258130_18NrbxMytZcJcDcsUadLeSAfZ2f49jzPXK": 1,
		"1525516596_1KY1YYCNH5sDor7yu19jEr5yMtiZ5QyWwu": 1
	},
	"next_comment_id": 17,
	"comment": {
		"1525566365_1KpyUiV4979ikm29guQEqDmMrNZG4SFfLY": [
			{
				"comment_id": 1,
				"body": "We usually put audiobooks in ZeroUp. But I don't think there's a zite specifically dedicated to audio books.",
				"added": 1525589087
			}
		],
		"1525589246_14AqVUuAqS3HsxsPzNgheYJEYWSQnUk7NW": [
			{
				"comment_id": 2,
				"body": "Get busy living. Or get busy dying.",
				"added": 1525589425
			}
		],
		"7_15ATNsS6aHGvBg5xoMP94sXpNaLX4fSHjN": [
			{
				"comment_id": 3,
				"body": "A community blacklist would make the best sense. Then again, anything that breaks the rule of freedom of speech and decentralization will encourage others to create split and alternate zeronet-like projects.\n&nbsp;\nI'd say, we should stay true to our roots, if we want ZeroNet to have visitors. It's up to the individual to blacklist zites they don't want to see. Otherwise, we're just reinventing the wheel.\n&nbsp;\nWe can no longer rely on cheap tricks to make things work the way we want to .. at least on the internet. There needs to be moral pressure, and a strong community participation.. or else, you'll have 10000 different ZeroNets. We don't want that. We want one big project that will rise above all else. You can't hack your way out of this one.",
				"added": 1525594194
			}
		],
		"1525597646_1CT7RxDQNPEE8X78bDkUPhuaaUUixTmDhC": [
			{
				"comment_id": 4,
				"body": "We can always work on one soon.",
				"added": 1525633826
			}
		],
		"1525624122_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 5,
				"body": "A dating site.",
				"added": 1525633871
			},
			{
				"comment_id": 12,
				"body": "> [darkalleyrambler](#comment_2_1PdAWkEHsyXJZ3corovrztbyQQSkBtepcc): Debating if I should work on it myself (I am a terrible novice-level programmer), but a fiction hosting site would be nice. Kind of like archiveofourown but maybe not so focused on fanfictions and allows authors to ask for donations or just some other way to profit off all that work. [...]\n\nYour sense of sarcasm comes across as a gasp of desperation.",
				"added": 1525675254
			}
		],
		"1525258130_18NrbxMytZcJcDcsUadLeSAfZ2f49jzPXK": [
			{
				"comment_id": 6,
				"body": "Artificial intelligence is the only politician worth electing, unfortunately. Humans have emotion .. but none of the good deeds can compensate for the severity of evil acts performed around the world. The AI decision-maker would need to apply the principle of Utilitarianism, cooperative game theory as well as the Asimov laws of robotics.",
				"added": 1525647961
			},
			{
				"comment_id": 7,
				"body": "> [theanswerer0](#comment_27_1F2ZbgkHvpknveTB6wFa5xNEQBb8yxQnCR): A hard AI, which I assume is what you're talking about, is only going to be as good and well-intentioned as the people who created it. [...]\n\nI have good intentions. All I was doing earlier this year was hypothesising about possible evil uses of Artificial Intelligence. Grey hat tests, if you will. It turns out - uncontrolled AI could be very, very dangerous.. and needs to be stopped.",
				"added": 1525658032
			}
		],
		"1525494845_1EHjrNgbVBWHQ7BiKwqKD6pSbowepFP8sf": [
			{
				"comment_id": 8,
				"body": "> [theanswerer0](#comment_28_1F2ZbgkHvpknveTB6wFa5xNEQBb8yxQnCR): I'm aware that they aren't being consistent with their religion's teachings, but I wholeheartedly support their freedom to defend themselves, their land, and their property and I believe that it's wise and good for them to do so. I'm glad they're being inconsistent on this point, for their sake. [...]\n\nI have already learned my lesson. Violence is a bad thing.",
				"added": 1525658138
			},
			{
				"comment_id": 11,
				"body": "Just remember - You're no exception. You're not a special snowflake. It's those who have been there and done that who will be the most likely to re-shape their own lives in the best possible way.",
				"added": 1525666742
			}
		],
		"1525633769_14AqVUuAqS3HsxsPzNgheYJEYWSQnUk7NW": [
			{
				"comment_id": 9,
				"body": "It's 13:56 and .. probably still Judgement Day.",
				"added": 1525658214
			}
		],
		"1525594763_14AqVUuAqS3HsxsPzNgheYJEYWSQnUk7NW": [
			{
				"comment_id": 10,
				"body": "Jordan Peterson was right.",
				"added": 1525663014
			}
		],
		"1525663104_14AqVUuAqS3HsxsPzNgheYJEYWSQnUk7NW": [
			{
				"comment_id": 13,
				"body": "> [zrunner](#comment_4_1GEf23jHEorBnKoQ5pKgh4WdZgCCaZL8Hc): u can program in a mental hospital?  also if youre in america you can still be released if the doctors decide you should be\n\nYes, although it's nearly impossible to program with a somewhat agitated state of mind. Mental breakdowns teach you valuable life lessons, after all. You simply cannot grow up without a handful of breakdowns here and then.",
				"added": 1525675442
			},
			{
				"comment_id": 14,
				"body": "My mental state should be fine by tomorrow. There's no more conspiracies left for me to crack. It's time to pick a reality for me to live in.",
				"added": 1525675579
			},
			{
				"comment_id": 15,
				"body": "> [homulilly](#comment_43_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD): How's the food?\n\nSome of it was meh in the beginning. Now It's getting better. Mum came to visit. :)",
				"added": 1525676321
			}
		],
		"1525516596_1KY1YYCNH5sDor7yu19jEr5yMtiZ5QyWwu": [
			{
				"comment_id": 16,
				"body": "Preach.",
				"added": 1525676381
			}
		]
	},
	"comment_vote": {
		"4_1GEf23jHEorBnKoQ5pKgh4WdZgCCaZL8Hc": 1,
		"43_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD": 1
	}
}