{"posts":[{"layout":"post","title":"My ten cents for ugly capitalism","date":"2020-11-29T12:30:00.000Z","categories":"misc","timestamp":1606653000,"content":"\nI haven't been writing this log in a while, so i'm not exactly happy to resume\nwith announce of another compromise i'm making. But that's how it's gonna be,\n'cause i am already late to tell my imaginary readers about this.\n\n%3Ccut/%3E\n\nSo here it is: in order to get funding for my art i'm willing to give 10-15%25 of\nthat to a company supporting things i have been standing against all this time %E2%80%94\nand i still am %E2%80%94 copyright, \"streaming\" (i'm yet to write separate post on that,\nbut in short, it's that lie that streaming and downloading are two conceptually\ndifferent things). I've tried to do the right thing, to only use libre open\nplatforms, but this haven't been going far %E2%80%94 neither in popularity, nor in\nmoney, so it's official: my music is now being published on\n[bandcamp](https://caryoscelus.bandcamp.com) and i'll try to get fans there and\nmake money. Of course, i would prefer direct crypto donations, but i can't be\nfighting every fight there is and keep my life (which is an important point %E2%80%94\nbecause if i have to sacrifice my life for the cause, it kinda defeats the\npurpose). People do use this big ugly capitalist (i'll leave the judgment of\nwhether capitalism can be not ugly for separate discussion) platforms and\nthere's not gonna be a significant change without reaching enough people.\n\nBack in spring i had this argument about the dilemma of reaching out using\n\"dirty\" methods vs keeping true to principals, however small the\naudience. Though i argued on the second side, it is widely known that i was\nalways making some compromises (the question of whether it's even possible not\nto i'll leave hanging), sliding in one direction or another. But the more\ninteresting point about that argument is the question of what i really care\nabout. Can i really care about judgment of people who wouldn't care enough to\nunderstand my motives%3F For a long time i did, because i was one of them. I\ndidn't want to be misunderstood by people like me.\n\nAnd i still don't. But in a maze of hundreds and thousands of \"wants\" and\n\"don'ts\" there is no chance to avoid choosing some of them over others. So be it\nand let the future make its judgment.","cut":"\nI haven't been writing this log in a while, so i'm not exactly happy to resume\nwith announce of another compromise i'm making. But that's how it's gonna be,\n'cause i am already late to tell my imaginary readers about this.\n\n","path":"/_posts/2020-11-29-10-cents.md"},{"layout":"post","title":"Punch%C2%A0line","date":"2020-03-14T00:00:01.000Z","categories":"misc","timestamp":1584144001,"content":"","cut":"","path":"/_posts/2020-03-14-punch.md"},{"layout":"post","title":"Dead dead season","date":"2019-10-17T16:00:00.000Z","categories":"misc","timestamp":1571328000,"content":"\nThis blog might seem a little bit deserted lately, after a brief surge of\nactivity in some not-so-distant-yet past. The main reason for this is, as usual,\nthat i'm \"busy\" with activities in other places%3B in particular, a lot of\nblog-like stuff can be found on \"micro-blogging\"\n[%E3%80%8C0me%E3%80%8D](http://127.0.0.1:43110/1MeFqFfFFGQfa1J3gJyYYUvb5Lksczq7nH/%3FProfile/1White24UrrwQrD86o6Vrc1apgZ1x1o51/13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE/caryoscelus%40zeroid.bit)\nplatform (ZeroNet-only link). But let me post a brief update here, as well.\n\n%3Ccut/%3E\n\nSomehow it's october already, and after-half of it too. Some of my wandering\nthoughts are now finding their place in the\n[Ramblings on the Road](http://127.0.0.1:43110/15rbLxi3UfTUoV9E6EUbZySSotdYv9w5sK/)\n%E2%80%94 the title pretty much says it all, it's literally me talking on record while\nwalking somewhere. My fictional writing has been looking for more inspiration\nlately, but i'm sitting on a few few-KW (*) short stories just waiting to be\nfinished, and planing to write a planned out novel in november too.\n\n(*) that's KiloWords, not power\n\nAfter a streak of publishing a track per day somewhere in what i refer to as\n\"late summer\", i didn't have time or energy to work on music as much, but i'm\nslowly returning there, and might even finish a few albums consecutively since\ni'm working in several direction as usual.\n\nWhat's bothering me a little more is that i've returned to the kind of\nperfectionist state of mind about my video making and there haven't been an\nupload in a while, despite i had at least three working ideas, in different\nstages of completion.\n\nAnd then there's \"life\".. life's going on as usual and i'll cut the\nso-very-cute-but-overused-metaphors about it. Not that i have to say anything in\nparticular, anyway.\n\nAnd there you have it, a non-empty blog post out of the blue.\n","cut":"\nThis blog might seem a little bit deserted lately, after a brief surge of\nactivity in some not-so-distant-yet past. The main reason for this is, as usual,\nthat i'm \"busy\" with activities in other places%3B in particular, a lot of\nblog-like stuff can be found on \"micro-blogging\"\n[%E3%80%8C0me%E3%80%8D](http://127.0.0.1:43110/1MeFqFfFFGQfa1J3gJyYYUvb5Lksczq7nH/%3FProfile/1White24UrrwQrD86o6Vrc1apgZ1x1o51/13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE/caryoscelus%40zeroid.bit)\nplatform (ZeroNet-only link). But let me post a brief update here, as well.\n\n","path":"/_posts/2019-10-17-dead-dead-season.md"},{"layout":"post","title":"Islamophobia and the freedom of oppression","date":"2019-08-07T14:54:14.000Z","categories":"misc","timestamp":1565189654,"content":"\n\"Suppose you see a woman in niqab on a hot summer street. Do you experience any\nnegative feelings%3F\"\n\n%3Ccut/%3E\n\nThere are a lot of people who consider it their moral duty to answer \"no\" to\nsuch question, because surely any negative feelings would be a sign of\nintolerance and islamophobia. And they are right about that, of course (depends\non islamophobia definition, to be precise). The argument shouldn't be about\napplication of these words, but rather: \"is it bad%3F\"\n\n\"Intolerance\" is a word that is often being assumed to have negative\nconnotations, but it shouldn't be. \"Lactose intolerance\" might be bad, but not\nin moral sense, \"intolerance to evil\" seems to be rather good thing. So instead\nof blindly thinking \"that's intolerance, intolerance is bad, hence that is bad\",\nwe should inspect each case of intolerance separately.\n\nAnd as you might've guessed, you shouldn't have a knee-jerk reaction to\n\"islamophobia\" either. If someone is blindly hating anything relating to islam,\nthat's one thing (which i wouldn't discuss in this post), but if the object of\nnegative emotions is one specific thing, tagging it as islamophobia just to\ndismiss it makes little sense. So, done with words, lets dig into the source of\nnegative itself.\n\nThere are a few aspects to it. Negative reaction towards people hiding\nthemselves, empathy towards being hot, gender-based segregation, the coercion\nperceivably involved.\n\nReaction towards hiding and empathy are both pretty natural, but the same can be\nsaid about many negative feelings: towards fat and ugly people, people with\ndisabilities, people with strange tastes in clothing or behaviour, etc\netc. There is a reason why we tend to not judge people by their appearance, so\nmaybe the same can be said about niqab and such%3F\n\nWell, not quite. We still have gender-dividing aspect and coercion. Here we come\nto the central issue. If those women would all be wearing such garments\nunwillingly, it will be all quite simple. Whoever forces them is \"the bad guy\"\nand should be stopped. \"Everyone is free to wear what they want\". But.. there is\na little problem with such straightforward approach. Some of women may very\nconvincingly claim they are hiding on their own accord. So saying \"everyone is\nfree...\" would seem to justify their right to wear niqab.\n\nAnd yet, how can we ever judge whether such self-isolating, androphobic action\nis voluntary%3F Does a person who was raised in a culture where that is the only\noption, have capability to make a different decision%3F Aren't their actions\npredetermined by their culture%3F Even if that's true, does that give us any right\nto treat them badly for that reason%3F To forbid doing what they feel right, even\nif without any choice%3F\n\nNo, don't look at me expectantly like that. I don't have convincing answers to\nshare with you. But there still is another thing i want to discuss.\n\nThe source of this behaviour. The oppression system. The religious culture which\ncreates barriers between people, programs people to live in fear from the early\nage. Does it have the right to exist%3F Can we idly watch as millions kids are\nbeing conditioned like that, and do nothing about it%3F Perhaps we should go and\nask our governments to put the end to these malicious practices and allow only\nmoderate islam at best%3F Take kids away from their fundamentalist parents if\nnecessary and educate them, make them understand the evil of oppression%3F..\n\nIn case you haven't sensed sarcasm in the last few sentences, now's about the\ntime. Suppose we forbid preaching islam (or christianity for that matter, or\nperhaps virtually any religion, most of them are built on some oppression), and\nspread the words of freedom, what's the difference between our oppression\ntowards religion and theirs towards kids%3F Ah, that's right, they're targeting\nkids!! That can't be good, can it%3F We gotta make sure kids are *properly\neducated* and given all the best opportunities! We can't let them go on a stray\npath of being oppressed and propagandized. We can't..\n\nNow i must stop my rambling. Make your conclusions.\n","cut":"\n\"Suppose you see a woman in niqab on a hot summer street. Do you experience any\nnegative feelings%3F\"\n\n","path":"/_posts/2019-08-07-islamophobia-and-the-freedom-of-oppression.md"},{"layout":"post","title":"Rounding to zero in human subjects","date":"2019-06-04T16:52:43.000Z","categories":"misc","timestamp":1559667163,"content":"\nOperating exact \"real\" (or *at least* computable) numbers is hard, even for\nexact machines. For humans rational and big integer numbers already present a\nproblem. Perhaps most noticeable is this when they encounter \"small\" numbers\n\"around zero\".\n\n%3Ccut/%3E\n\nWhat they tend to do in this case is commonly known as \"rounding\" and rounding\ntowards zero is, of course, unforgivable when dealing with multiplication and\ninversion (with addition and negation it's not as important), but the human mind\nseems to much prefer additive operations and think low of something as\ncomplicated as multiplication.\n\nThis rounding error is not merely a computational issue. In fact, it seems to be\nat least one of the cases for certain philosophical systems, which author of\nthis post is not very happy about. Lets see how that may be happening.\n\nFirst of all, we must of course assume world of big numbers, but human world\nhave been that for quite a while, and the few communication and transportation\nrevolutions we've seen in the last centuries make this even more obvious, even\nfor people who would otherwise ignore the question altogether. These days it is\nhard to be unaware of existence of billions other humans, and the small brain\nthat human posses can hardly imagine even a thousand. But of course, to people\nwho cared to think about the world, even lower numbers in previous centuries\nwould still be high enough.\n\nHigh enough for what exactly, one might ask%3F For example, to compare oneself\n(or, perhaps, any single human) to this mass called \"humanity\". If you divide\none by a billion, you get.. one billionth, of course. But when you round this\nnumber to zero, you come to conclusion that one single human has zero\nsignificance. Funny contradiction arises when you then multiply it by billion\nback: you suddenly get zero. 1 %3D 0. A good starting point to begin doubting\nlogic and start believing in something different, which can make it all come to\nterms.\n\nIn particular, one possible idea is to say that there's some \"higher force\"\nwhich is present in human masses, despite utter lack of its parts in any one\nhuman in particular. And wasn't that, in a way, a prelude to the catastrophes of\nXX century%3F..\n\nBut as i mentioned earlier, this rounding error does not affect philosophy\nonly. Very mundane everyday fatalism might be explained by it. One person is\nzero, their actions are insignificant, irrelevant. One more piece of trash, one\nmore fire, one more car burning gasoline will not be cause of ecological\nproblems. One more vote, one more active citizen will not make a political\ndifference. Even: one more stealing, one more kill will change nothing. Right%3F\n\nAnd yet again, on a less philosophical level, humans tend to want to believe in\nsomething that would explain contradiction. In perhaps saddest (for themselves)\ncase, believe in nihil, make this zero rounding error a grand postulate and a\nstaple of the world.\n\nOh, and by the way: when i say \"believe\", i don't mean necessarily beliefs in\nsome \"higher\" powers or entities. One can believe in a group of people, for\nexample: \"yes, one human is zero, but together we are...\"\n\nBut lets leave that one for another study. I think this post is already full of\nnot-so-fresh ideas, written in a pretentious and hopefully fun manner. Adieu.\n","cut":"\nOperating exact \"real\" (or *at least* computable) numbers is hard, even for\nexact machines. For humans rational and big integer numbers already present a\nproblem. Perhaps most noticeable is this when they encounter \"small\" numbers\n\"around zero\".\n\n","path":"/_posts/2019-06-04-rounding-to-zero.md"},{"layout":"post","title":"Some shuffling of 0net sites","date":"2019-06-03T17:15:13.000Z","categories":"misc","timestamp":1559582113,"content":"\n(if you're not reading this from ZeroNet, it probably doesn't concern you)\n\nToday i finally finished what i had better done much earlier: separated out my\nliterature zites from the main one.\n\n%3Ccut/%3E\n\nThere's some minor issue, but in general it's much better to have them separate,\nfor two reasons:\n\n- my poor engine does not support direct links for \"subsites\"\n\n- with all the files signing process becomes a little uncomfortable, and may\n  even create unnecessary traffic\n\nInitial reason to make subsites at all was to avoid \"no peers\" issue, but\nnowdays i feel that shouldn't be a big problem.\n\nHere are new links (also changed them already in [txt](/txt), though i did not\nremove actual files yet):\n\n- [eucalyptus (short stories)](http://127.0.0.1:43110/1JecUbTPHudVR3fi6KMFwQNW2mT2L8H7dq/)\n- [heavy bright sun](http://127.0.0.1:43110/1HAB57aQRcLHoHb3ehHrh8SZT647VWVA28/)\n- [poetry](http://127.0.0.1:43110/1QDEpSBxTXiZ4ak9m9ATAVAy1SSLiRrxKs/)\n\nConsidering the content, it might've been a better idea to write this post in\nrussian, but then again, who even cares%3F..\n","cut":"\n(if you're not reading this from ZeroNet, it probably doesn't concern you)\n\nToday i finally finished what i had better done much earlier: separated out my\nliterature zites from the main one.\n\n","path":"/_posts/2019-06-03-some-shuffling.md"},{"layout":"post","title":"Thoughts on paranoia I","date":"2019-05-16T15:15:15.000Z","categories":"misc","timestamp":1558019715,"content":"\nI've been occasionally thinking about \"paranoia\" for a long time now, and\nperhaps it's time to write down some of these thoughts.\n\nBut first, let me clarify one thing. The word \"paranoia\" has of course a\nclinical, formal meaning, but this post isn't about it%3B there is also an\ninformal notion of \"paranoia\" %E2%80%94 that's what i'm going to write about. The\nmeaning can vary from person to person, but essentially it boils down to \"a\nstate where the person in question is fearful, cautious or anxious about\nsomething they shouldn't be (according to those who apply the term)\".\n\n%3Ccut/%3E\n\nThis \"definition\" does sound a lot like \"phobia\", but perhaps the most important\ndifference here is that \"phobias\" are supposed to be inherently irrational,\ncaused by a trauma or even being natural (such as fear of heights, perhaps). By\ncontrast, \"paranoia\", even if it may ultimately be considered irrational, is\nmore likely to be caused by exaggerated imagination mixed with otherwise\nrational thinking.\n\nBut that's from the perspective of someone who uses this word deprecatingly\n(most likely to describe others). It may also be occasionally used by people to\ndescribe themselves without negative connotations (similar to how some\ncopyright-ignoring people may proudly call themselves \"pirates\"). This may of\ncourse complicate the matters, since other people labeled as \"paranoid\" would\nargue against such word usage.\n\nSo for simplicity sake, lets skip over how the word should be used and rather\nconcentrate on the core of \"normies vs paranoics\" debate. Which essentially\nboils down to whether the aforementioned fears, anxieties or precautions are\nrational or irrational. It is, of course, a matter of personal taste, knowledge\nand considerations, but recently i have come to conclusion that there might be a\ncommon fundamental issue dividing these camps.\n\nIt is attitude towards probabilistic nature of our knowledge about\nuniverse. From the typical point of view of normies, paranoics exaggerate\nprobability of some bad event. But while that can certainly be true sometimes,\nthat is not necessary: paranoic and normie may come up with the same probability\nevaluation, and still react differently.\n\nLets say there's 0.1%25 chance of dying (just to be dramatic) in the course of\nsome activity. That's not that much, or is it%3F Overwhelming majority of people\nwould survive it, so you may consider it worth taking the risk. On the other\nhand, one of a thousand is going to die. Imagine thousand people together, and\nthen one of them dies: it's not that hard to see that it can very well be\nyou. Or even imagine it on a world population scale: people who would die could\npopulate a big city. But then again, you probably had that risk in your life and\nsurvived it already... Any number of arguments can be brought to support either\npoint of view.\n\nAnd with this, we come to another point: calculation of outcome probabilities\ncan be rational, but what about actual decision-making that would take in\naccount these probabilities%3F What kind of criteria can we possibly use to\ndetermine whether certain decision is rational or not%3F If somebody decides that\nthe probability of dying vs probability of getting huge money prize is 50-50 and\nafter cold considerations takes the risk, can you really call that irrational%3F\nIs it even rational to value your life%3F Most people would probably say it is,\nbut on what grounds%3F\n\nThere are, of course, cases when one can say one decision would be more rational\nthan the other: e.g. when A leads to *all* good outcome probabilities be higher\nand *all* bad outcome probabilities be lower than B. But where do you see these\nin practice%3F Usually people can't even actually estimate probabilities, let\nalone stumble upon such rare cases.\n\nSo in practice, **there is no way to objectively judge rationality of a\ndecision**. It is only possible after learning all personal priorities and\nassumptions used to come with it, but usually that's not even attempted.\n\nHopefully, this perspective may help people on either side to better understand\neach other rather than be content with convenient labeling.\n","cut":"\nI've been occasionally thinking about \"paranoia\" for a long time now, and\nperhaps it's time to write down some of these thoughts.\n\nBut first, let me clarify one thing. The word \"paranoia\" has of course a\nclinical, formal meaning, but this post isn't about it%3B there is also an\ninformal notion of \"paranoia\" %E2%80%94 that's what i'm going to write about. The\nmeaning can vary from person to person, but essentially it boils down to \"a\nstate where the person in question is fearful, cautious or anxious about\nsomething they shouldn't be (according to those who apply the term)\".\n\n","path":"/_posts/2019-05-16-paranoia-i.md"},{"layout":"post","title":"Two more albums","date":"2019-05-12T18:09:04.000Z","categories":"music","timestamp":1557684544,"content":"\nApparently i forgot to announce my\n[\"episodes\"](http://127.0.0.1:43110/1FiHm91tcDdjkiGkHZH2xoMc7Qmzrh8sv3/episodes/)\nalbum here. Well, you know now. But in fact there's more already: today i\nreleased a much less musical, noise album [\"almost a\ncapella\"](http://127.0.0.1:43110/1FiHm91tcDdjkiGkHZH2xoMc7Qmzrh8sv3/almost-a-capella/). Enjoy\nany of them, or both, or none: the choice is yours.\n","cut":"\nApparently i forgot to announce my\n[\"episodes\"](http://127.0.0.1:43110/1FiHm91tcDdjkiGkHZH2xoMc7Qmzrh8sv3/episodes/)\nalbum here. Well, you know now. But in fact there's more already: today i\nreleased a much less musical, noise album [\"almost a\ncapella\"](http://127.0.0.1:43110/1FiHm91tcDdjkiGkHZH2xoMc7Qmzrh8sv3/almost-a-capella/). Enjoy\nany of them, or both, or none: the choice is yours.\n","path":"/_posts/2019-05-12-two-more-albums.md"},{"layout":"post","title":"Turing completeness trap","date":"2019-05-07T08:49:00.000Z","categories":"programming","timestamp":1557218940,"content":"\nIn the world of programming languages there's a concept of Turing tarpit: a\nlanguage that in theory can be used to express any computation %E2%80%94 that is, a\nTuring-complete (TC) language %E2%80%94 but which is utterly unpractical when applied to\nreal world tasks. Numerous examples can be found: languages which were\nexplicitly designed to be \"minimal\" (brainfuck, unlambda), domain-specific\nlanguages which became TC by accident, and even more weird systems which can\nhardly be called languages at all.\n\nPerhaps, showing any one of these languages should be enough to prove that TC is\nnot a *sufficient* condition for language to be suitable for general-purpose\nprogramming. But a lot of people tend to believe that Turing completeness is a\n*necessary* condition. This is not quite so, and in this post i'm going to show\nwhy.\n\n%3Ccut/%3E\n\nFirst of all, lets start with what TC means %E2%80%94 not from a formal standpoint, but\nin practice. Informally, Turing machine allows running computations which may\nnever finish and not only that, you can never tell whether such computation will\nat some point finish or not (unless you run it and see that it does halt).\n\nAt a first glance, one may think that this ability is completely useless: after\nall, why would you want something to be unpredictable as that%3F But there are two\nusecases which seem to require that property: complex (i.e. you don't even know\nwhether you can find an answer) task solving with infinite codomain (so you\ncan't even brute-force them) and interactive applications (including servers,\nwhich interact with other software).\n\nInteractive applications are actually quite easy to dismiss: they can easily be\nseen as always halting on finite input, if you forget specifics of time and\nsimply encode all events as \"data %2B time-stamp\" list. Then any useful\nnon-hanging interactive applications can be pure functions with input event list\nas domain and output event list as codomain. This is kinda what FRP is about.\n\nSo what about the other case%3F On the first glance, it seems like there is little\nway to prove that all useful task-solving can be expressed without TC. But on\nthe second glance: why would you ever want to run a computation forever%3F You\nsimply wouldn't have the time, and at some point you'd likely want to\nstop. There is no practical difference between running computation for million\nyears and for ever. If for some reason after million years there is someone who\nwants to continue with it, it suffices to save the results and continue from\nthat point.\n\nAnd here we come to another point of view on the problem. Namely, that while\nalways-terminating language cannot run all TM computations directly, rich enough\nlanguage allows for TM emulation. How can this be%3F Any computation, be it TM or\nLambda Calculus (untyped flavour of which is equivalent model for our purposes),\nproceeds in steps. Every step is, of course, terminating. Then so would be\nrepeating two steps. Or three. Or more%3B in fact, any finite number of steps\nwould finish in finite (and bounded) time.\n\nTo put it into types, if we cannot express\n\n```\npossibly-non-terminating : A\npossibly-non-terminating %3D {!do some TC computation!}\n```\n\nwe can still express\n\n```\ncompute-n-steps-of : S %E2%86%92 %E2%84%95 %E2%86%92 S %E2%8A%8E A\ncompute-n-steps-of z n %3D {!do n steps of TC computation from state z %3B return new state or computation result if finished!}\n```\n\nwhere `A` is desired type, `S` is a type of computation state, and `_%E2%8A%8E_` is\nAgda's standard notation for what haskellists know as `Either`.\n\nAnd there you have it: you can run any TC computation for any (finite) number of\nsteps. There is no practical reason to demand Turing completeness from a\nprogramming language.\n\nOh, and by the way, after finishing this post i've entered \"nobody needs turing\ncompleteness\" into search box and surely enough there was (at least) [one\nresult](https://news.ycombinator.com/item%3Fid%3D14398615) which said what i wanted\nto, though less verbose.\n","cut":"\nIn the world of programming languages there's a concept of Turing tarpit: a\nlanguage that in theory can be used to express any computation %E2%80%94 that is, a\nTuring-complete (TC) language %E2%80%94 but which is utterly unpractical when applied to\nreal world tasks. Numerous examples can be found: languages which were\nexplicitly designed to be \"minimal\" (brainfuck, unlambda), domain-specific\nlanguages which became TC by accident, and even more weird systems which can\nhardly be called languages at all.\n\nPerhaps, showing any one of these languages should be enough to prove that TC is\nnot a *sufficient* condition for language to be suitable for general-purpose\nprogramming. But a lot of people tend to believe that Turing completeness is a\n*necessary* condition. This is not quite so, and in this post i'm going to show\nwhy.\n\n","path":"/_posts/2019-05-07-turing-trap.md"},{"layout":"post","title":"Not much evil","date":"2019-04-25T07:55:00.000Z","categories":"ethics","timestamp":1556178900,"content":"\nThis might sound obvious or controversial depending on how you perceive the\nworld and the word, but i've come to conclusion that there isn't that much \"pure\nevil in the world\". Yeah, sometimes we like to use this phrase ironically, but\nother than that \"pure evil\" usually exists far away in isolated places: for\nexample, on war%3B and even murder of unarmed people in peaceful surroundings\n(usually referred to as \"terrorism\") is rare enough in most regions.\n\nBut this post is neither about war, nor \"terrorism\". It is about something much\nmore mundane.\n\n%3Ccut/%3E\n\nSo as i said, \"pure evil\" is rare, but there are many little and big problems in\nour lives, often making them miserable and even subjectively not worth\nliving. How can this be when we were taught since childhood that all bad comes\nfrom personified evil%3F Well, there are too reasonable ways to deal with that\ncontradiction: either to accept that very bad things can happen without any evil\ninvolved, or to find that lesser impure evil in mundane everyday life.\n\nWhatever you choose, conclusions should make most people uncomfortable. Why%3F\nMost people tend to use (consciously or not) excuses that what they do \"at least\nisn't evil\" or \"not so much evil\" or the banal \"lesser evil\". But if (first\noption) so much misery comes from non-evil, it becomes almost ridiculous to\njustify actions just for not being (as) evil. The other option isn't more\npleasant either: bad actions that aren't \"pure evil\" are still evil, even if\n\"not much\". But as in the first case, it does not matter, if most of our woes\ncome from such impure everyday evil.\n\nAs i said in the beginning, this might be obvious to some. But having recently\nseen this \"it's not evil, so it's ok\" kind of argument (quite implicit at that)\nand how it might as well destroy yet another community, i couldn't resist\nwriting this.\n","cut":"\nThis might sound obvious or controversial depending on how you perceive the\nworld and the word, but i've come to conclusion that there isn't that much \"pure\nevil in the world\". Yeah, sometimes we like to use this phrase ironically, but\nother than that \"pure evil\" usually exists far away in isolated places: for\nexample, on war%3B and even murder of unarmed people in peaceful surroundings\n(usually referred to as \"terrorism\") is rare enough in most regions.\n\nBut this post is neither about war, nor \"terrorism\". It is about something much\nmore mundane.\n\n","path":"/_posts/2019-04-25-not-much-evil.md"},{"layout":"post","title":"Donations are open","date":"2019-04-18T08:18:26.000Z","categories":"misc","timestamp":1555575506,"content":"\nYesterday i started writing a pretentious post with the same meaning, but i\ndidn't like it, so here's a shorter, drier, less literary and more to the point\nversion:\n\n%3Ccut/%3E\n\n- i'm looking for donations to sustain my physical (i don't like term \"real\" in\n  this context) life\n\n- there's **no emergency**, i can live without income for a while longer%3B and it\n  shouldn't be that hard to find some freelance stuff either\n\n- there are **no rewards** (besides however you may feel about donating): it\n  would be an exchange otherwise%3B you can always try to hire me instead, if\n  that's what you are looking for%3B i may start looking for more targeted\n  donations in the future, if i decide that would be ok and more effective\n\n- [please consider alternatives]({{ base_url }}{%25 post_url 2019-04-06-before-donating %25})\n\n- to sum it all up: i don't need money that badly yet, so i want to continue\n  being as uninfluenced by them as possible%3B i don't want any conflicts or\n  broken hopes arising from it either%3B and i don't want people who don't donate\n  for *any reason* to feel like they are being left out\n\nAnd with that out of the way, here's the [link](/donate/) with some technical\ndetails.\n","cut":"\nYesterday i started writing a pretentious post with the same meaning, but i\ndidn't like it, so here's a shorter, drier, less literary and more to the point\nversion:\n\n","path":"/_posts/2019-04-18-donations.md"},{"layout":"post","title":"Before donating, consider leaving that wretched job","date":"2019-04-06T07:35:42.000Z","categories":"misc","timestamp":1554536142,"content":"\nIt is perhaps about the time i start looking for donations myself, but before i\ngo into details about that, i wanted to write a post to discourage people from\ndonating.\n\n%3Ccut/%3E\n\nThis may sound counter-intuitive, but the reason is pretty simple: i want to be\nreasonably sure that for every donation i may receive, nobody (including me,\ndonor and possibly others) gets upset or regrets about it. It is unfortunately\nnot that uncommon for donations or their handling to result in heated arguments,\nbreak-ups and other nasty stuff. I don't want that to happen to or around me.\n\nBut more to the point of this particular post, lets consider why do people\ndonate at all%3F There might be lots of different reasons, including pure\nutilitarianist reasoning (\"if i donate now, they will create more cool stuff for\nme to enjoy\"), personal sympathy, self-importance, gamification elements etc,\nbut ultimately i believe that for most people there's at least some degree of\nwhat can be called \"desire to make world better\".\n\nIf that's the case, the natural questions arise: does particular donation make\nworld better%3F Could this money be spent in more effective world-bettering way%3F\n\nI believe that it might often be the case that donation is indeed sub-optimal\nand the better alternative would be to save the money and leave anti-social,\nexploitative or in other way bad job instead. Why%3F Because if we are serious\nabout making world better, throwing money around (even for the good) will never\nbe enough. The argument about place of money in society is too long to be put\nhere, but i would suggest that generally if you're getting money in unethical\nway, you're unlikely to balance that with then donating its fraction for the\ngood.\n\nFor example, consider programmer who makes proprietary software and then donates\nsome fraction of their salary to free software development. If you agree that\nproprietary software is bad and unethical, you might also agree that such a\nprogrammer would do world a better favour by finding more ethical way to sustain\ntheir living, even if that means they could no longer afford donations.\n\n***\n\nWith all that said, i do not want to imply donations are generally bad. Rather\nthan merely discouraging people from donating i want to encourage them to do\nmore direct change. Furthermore, if you look a bit deeper into the argument, you\nmay see that most of what i say about donations can be applied even stronger to\nother forms of payments for non-material rewards (e.g. \"buying\" copyrighted\nmaterials).\n\nEssentially, it can be boiled down to this: consider minimizing negative impacts\nof your job on the world before attempting positive impact via money. You may\nstill arrive at conclusion that you would prefer to donate, and that's fine%3B but\ni hope next time you do it, you're doing it having considered alternatives.\n","cut":"\nIt is perhaps about the time i start looking for donations myself, but before i\ngo into details about that, i wanted to write a post to discourage people from\ndonating.\n\n","path":"/_posts/2019-04-06-before-donating.md"},{"layout":"post","title":"unbroken glass and other stories","date":"2019-02-26T18:36:18.000Z","categories":"music","timestamp":1551206178,"content":"\n%3Cimg alt%3D\"unbroken glass and other stories - album art\" src%3D\"/images/unbroken-glass.png\"/%3E\n\n%3Ccut/%3E\n\nMy second noise album is out (listen to it on\n[0net](http://127.0.0.1:43110/1FiHm91tcDdjkiGkHZH2xoMc7Qmzrh8sv3/unbroken-glass-and-other-stories/) or\n[mirror](https://0net.io/1FiHm91tcDdjkiGkHZH2xoMc7Qmzrh8sv3/unbroken-glass-and-other-stories/)). As\nwith the previous, it mostly consists of special or random sound recordings with\neffects thrown on top, though this time there is more editing (culminating in\n\"abstracting away\" track which is fully composed from recording pieces). Next\nwill probably develop further into this direction, although i think i have even\nmore ideas. Meanwhile, i may put together something more conventional.\n","cut":"\n%3Cimg alt%3D\"unbroken glass and other stories - album art\" src%3D\"/images/unbroken-glass.png\"/%3E\n\n","path":"/_posts/2019-02-26-unbroken-glass.md"},{"layout":"post","title":"Gender neutrality isn't about gender equality","date":"2019-02-24T21:00:00.000Z","categories":"language","timestamp":1551042000,"content":"\nI've been proponent of gender-neutral language (in english it's mostly about\npronouns, but other languages have much more gendering of words) for a long\ntime. Recently i noticed that there seem to be a common misunderstanding about\nits meaning.\n\n%3Ccut/%3E\n\nVery often people (whether they support it or not) tend to associate\ngender-neutral language with gender equality. The usual argument is that using\none gender form (usually male in english, russian and other languages i'm aware\nof) in place of indeterminate gender supports discrimination or at least\ninequality. While that could be true (about inequality anyway), the key here is\nthat it only *supports* existing way of things.\n\nFirst, lets imagine a perfect copy of some \"patriarchal\" society with only\ndifference that the indeterminate gender of choice in it is female. Would it\nchange anything substantially in gender perception, roles and equality%3F My guess\nis a no: while it may affect society in some subtle ways, people can easily\nadopt to see \"default\" gender as either \"superior\" or \"inferior\" or however else\nas they please.\n\nNow imagine a world with perfect gender equality and no (recent) history of\ndiscrimination whatsoever%3B needless to say, i don't think \"default gender\" would\nbe seen as much more than grammatical convention.\n\nAnd this brings us to one of the points of this post: \"default gender\" %E2%94%80\nwhichever you choose %E2%94%80 is a very bad grammatical convention. To see why,\nconsider the following dialogue:\n\nA: Hey, why didn't you bought the bread%3F\n\nB: Beautiful middle-aged female shop assistant told me in an unpleasant\nhigh-pitched voice it isn't fresh.\n\nA: Is it important that they were beautiful middle-aged female with high-pitched\nvoice%3F Why do i have to hear about it%3F\n\nB: Because old grammar dictates us so!\n\nA: Why would anyone would ever want to use such a grammar%3F!\n\nWell, luckily we don't use such a grammar. But the problem is the same: gendered\ngrammar forces us to disclose irrelevant information. This isn't just about\nsituation when we don't know gender (using \"default\" gender in that case may\nconfuse whoever we talk to, by the way), it's also about information noise. We\naren't forced to tell age, pitch or beauty of other people and in cases when\nit's irrelevant would obviously prefer not to%3B likewise, i would also prefer not\nto be forced neither into disclosing superfluous information nor into receiving\nit. And i would also like to not have to think about that%3B indeed, zero\ninformation should be default.\n\nBesides this (which is in my opinion enough by itself to justify inconvenience\nof changing language habits), there is another (albeit related) reason to switch\nto gender-neutral defaults and even to drop grammatical gender altogether\n(i.e. abolishing gendered pronouns and lexicon in english).\n\nGender is simply irrelevant. It is made into a holy cow in most cultures, but\nreasons for that are hopelessly outdated in enlightened society. Having one\nadjective per biological gender to use in appropriate contexts and perhaps some\nways to describe variety of gender associated behaviour patterns should be\nenough.\n\n***\n\nNow for some language specific comments:\n\nIn english one can almost always use a neutral pronoun (though there's also some\ngendered lexicon), but unfortunately singular \"they\" which is by far the most\noptimal solution at this point has its drawback: namely, it removes the\ndistinction between singular and plural which (also unfortunately) is one of the\nmost important mechanisms for distinguishing pronoun referents.\n\nRussian is much more gendered%3B past tense verbs, adjectives and even more\npronouns are required to indicate gender (in singular form). Furthermore, nouns\nhave grammatical gender and while there is neutral gender (funnily enough, it's\ncalled \"middle\"), it is used for a fraction of inanimate objects (the only\nexception that i know of is \"%D0%BF%D1%80%D0%B8%D0%B2%D0%B8%D0%B4%D0%B5%D0%BD%D0%B8%D0%B5\", ghost)%3B the rest are gendered as male\nor female without any obvious pattern (beyond grammatical form).\n\nJapanese is quite different in the way of handling pronouns and i think it would\nbe fair to say that it has no grammatical gender, but quite some social/lexical\n(honorifics, word choice, manner of speech).\n\nFinally, as expected, lojban is about perfect in this aspect. Pronouns are fully\nabstract, being distinguished either by explicit assignment, grammar place/role\nor part of referent word (i.e. being abbreviations).\n","cut":"\nI've been proponent of gender-neutral language (in english it's mostly about\npronouns, but other languages have much more gendering of words) for a long\ntime. Recently i noticed that there seem to be a common misunderstanding about\nits meaning.\n\n","path":"/_posts/2019-02-22-gender-neutrality.md"},{"layout":"post","title":"I should have started with audiobooks","date":"2019-02-21T14:48:27.000Z","categories":"misc","timestamp":1550760507,"content":"\nNow that i'm adding final touches to my first \"videobook\" (calling it a book is\nnot quite correct, but i'm not aware of better terms and audiobooks seem to\nrefer to small forms sometimes), it becomes painfully obvious that decision to\nstart with video was a bit too ambitious. Even beyond all the technical issues,\nas well as \"waiting for the render\" (which supposedly account for me being\nunenthusiastic to the point where four minutes almost took me a year) the\nprocess of polishing videos takes quite some time.\n\n%3Ccut/%3E\n\nIf i had started with \"just\" audio, i simply wouldn't be stuck with just one\nshort project and could get to polishing actual performance. Transition to video\n(if i then decided that it's indeed a good idea) would still require some\nexperimenting in the mean time, but perhaps doing something like recent \"wave\none\" could work better for that (in reality it was reverse: i did wave\nrelatively fast because of previous experience with \"river\" among others).\n\nAnother lesson learned: non-separation of production stages is indeed\nimportant. If i would be able to do that, i could easily fill in the missing\nshots. As it were, i had to find whatever was most fitting and add various\neffects to cover up the lack of proper footage%3B effects by themselves aren't bad\n(except for destructive zoom, of course), but it's not nice when they are\nforced.\n\nThe question still remains, though: should i start doing non-video audiobooks%3F\nWe'll see. I have a few videos definitely planned, but when i have time i might\nalso start an audio one. The main reason i'm hesitant is that i personally don't\nfind flash fiction (and that's what i write mostly) audio books especially\nappealing. So the solution might be to unbury scandia letters, which would be\nway easier to adapt than hbs.\n\nAnd if you're wondering why not narrate something existing, the tricky part is\nfinding appropriate material: one that would be either open culture or public\ndomain and be interesting to read and listen to. And while i don't mind\nclassics, i just don't seem to be invested enough in anything in particular.\n","cut":"\nNow that i'm adding final touches to my first \"videobook\" (calling it a book is\nnot quite correct, but i'm not aware of better terms and audiobooks seem to\nrefer to small forms sometimes), it becomes painfully obvious that decision to\nstart with video was a bit too ambitious. Even beyond all the technical issues,\nas well as \"waiting for the render\" (which supposedly account for me being\nunenthusiastic to the point where four minutes almost took me a year) the\nprocess of polishing videos takes quite some time.\n\n","path":"/_posts/2019-02-10-i-should-have.md"},{"layout":"post","title":"A small (semi-technical) note about my new site","date":"2019-01-29T11:11:11.000Z","categories":"misc","timestamp":1548760271,"content":"\nLast few days i was working on finalizing a few things about [my video channel\nsite](http://127.0.0.1:43110/1N8zibqog72CCDBDo8jrxU7C6Q8JeVND2Z) (go visit it\nbefore it opens officially, for then i'll have to remove fun-but-distracting\nbackground). There were a few rough edges with my infamous engine, but mostly it\nwas about design. Funnily enough it was design which led me to using custom,\nbadly written js code again. But let me start from beginning.\n\n%3Ccut/%3E\n\n..Or so i'd like to say, but tracking beginning in my video making journey is\nnot something that would fit into my plans. So the beginning here is only\nrelative%3B mostly i'm going to explain reasons for using tech which i do, so the\nstory starts some time last autumn when i started seriously considering\navailable options.\n\nOf course one reasonable solution would be to use existing tech, most likely\nKopyKate or the then still promising KxoVid. I quickly decided against the\nlatter due to its hub design (i'm not a fan of \"hubs as categories\" concept) as\nwell as (superfluous to my taste) reliance on (promising, but not widely used)\nplugin. KK has another downside: it doesn't use hubs at all, so all content is\ncontrollable by single owner and changing design is impossible (cloning it and\nusing for single channel makes little sense, because then most positive sides of\nusing existing engines are lost).\n\nSo in the end i started considering less video-oriented options. Because really,\nall additional tech you want for personal channel are notifications in 0hello\nfeed and possibly comments, both of which are also expected from blog\nplatforms. Optional features like custom player or some kind of thumbnail fancy\ncan be added if needed, but one can do without them: *in the end the real thing\nyou want is, without a shadow of a doubt, design. It is design (and design\nalone!) that creates atmosphere for a site.*\n\nAs you may know by this point, i have no sympathy for (most forms of) web\ndevelopment, so i was willing to make some sacrifices just to avoid touching JS\nas much as possible. I was even ok with reverse comment order (which is one of\nthe most annoying thing about 0net sites), so i thought i'd just throw some css\non top of classical ZeroBlog and be done with it.\n\nWell, that hope broke apart fast as soon as i made a mockup and actually tried\nto bring it to life. ZeroBlog's css was huge and i don't really like \"editing\"\ncss, i rather prefer starting from blank sheet. But.. after disabling it, i\nquickly realized that the css was used for more than design: hiding elements\nwhich should really *never* be visible also relied on css. I tried fixing that\nin html by means of `%3Ctemplate%3E` tag, but only broke more things instead.\n\nI could probably learn what part of css was functionality-relevant, or how to\nbuild coffescript and fix usage of templates, or simply indulge in editing\nexisting css, but i just gave up.\n\nThere was no reason to learn something that i wouldn't want to use ever again,\nso i could just as well use something that i wouldn't want to use ever again,\nbut at least already knew how to use.\n\nAnd that's about how HydeView usage grew by one. Now i'm afraid i'll have to add\ntag support or something.\n","cut":"\nLast few days i was working on finalizing a few things about [my video channel\nsite](http://127.0.0.1:43110/1N8zibqog72CCDBDo8jrxU7C6Q8JeVND2Z) (go visit it\nbefore it opens officially, for then i'll have to remove fun-but-distracting\nbackground). There were a few rough edges with my infamous engine, but mostly it\nwas about design. Funnily enough it was design which led me to using custom,\nbadly written js code again. But let me start from beginning.\n\n","path":"/_posts/2019-01-29-moving-pictures.md"},{"layout":"post","title":"You can't break what's already broken","date":"2019-01-14T23:30:00.000Z","categories":"misc","timestamp":1547508600,"content":"\nJust like your average net denizen, i don't posses precognition powers, so i\ncan't say whether the dreaded thirteenth article will have overall positive or\nnegative effect. What i can say, however, is that the amount of criticism it\nprovoked is disproportional.\n\n%3Ccut/%3E\n\nI'm not a lawyer and mostly haven't read the official document, so i can't tell\nyou whether the critics are right about its (un)intended consequences. However,\nthat's beside the point%3B for the sake of argument, lets assume article 13 is\nabout as evil as it's painted. Media hosting companies either go out of business\nor employ automatic filters which remove tons of \"legal\" content. Sounds bad,\ndoesn't it%3F\n\nWell, it sure is bad for you if you're running business of spying on your users,\nor are getting payed by such business, or are one of those users who don't care\nabout their privacy and are happily watching tons of ads that are shoved at\nthem.\n\nBut lets dig deeper. What exactly *is* the \"legal content\" that is going to get\nbanned%3F Depends on your imagination, of course, but the most endangered are\nworks (ab)using the so-called \"fair use\" and similar \"rights\" to use\n\"copyrighted works\" without permission in certain ways. Complex and arbitrarily\nchosen ways, actually.\n\n- Parodies and reviews with heavy video/audio quoting are perhaps the most\nobvious in this grey zone.\n\n- Unironic remixes, fan fiction and fan art are not directly affected, because\nwithout permission they are most likely already infringing copyright. While it's\npossible they will be taken down more aggressively, that's mostly irrelevant. If\nyou are against such takedowns, you are already against existing laws.\n\n- Situation with musical covers will probably depend on whether big copyright\nholders are getting enough revenue from them.\n\nSo essentially the change boils down to this: people who are using copyrighted\nwork in order to profit from its popularity will have less legal opportunities\nto do so. Comedic remixers will no longer receive a free pass and will be put\ninto the same position as other remixers. Critics will have to go back to\n\"text-only\" criticism, effectively losing a large portion of their ability to\nincrease (decrease) profit from the works they like (don't like).\n\nIf that sounds like the end of the world to you, you're probably not alone. But\nas you might've already guessed, i see this potential change as merely making\noppressive copyright a bit more logical.\n\nThat's not necessarily a good thing, but neither it's inherently bad.\n\nNow, there is of course another potential issue. Namely, possibility of totally\nrandom takedowns. This would be a very serious matter, if not for a simple fact\nthat random takedowns are inherent to easily censorable centralized commercial\nservices. Sure, it's conceivable to write legislation to forbid hosting\ncompanies from removing content from their servers without government\npermission, but that sounds like it might have its own downsides.\n\nIf you're serious about being against censorship and \"unfair copyright\"\n(whatever that means to you), you should use less censorable, decentralized\nplatforms. Of course, there's a simple reason why so many affected people prefer\nto keep nagging: there's no easy way to make money when you can't feed your\nusers with ads. But i guess that's a price you should be prepared to pay, if\nwhat matters to you is indeed freedom of expression.\n","cut":"\nJust like your average net denizen, i don't posses precognition powers, so i\ncan't say whether the dreaded thirteenth article will have overall positive or\nnegative effect. What i can say, however, is that the amount of criticism it\nprovoked is disproportional.\n\n","path":"/_posts/2019-01-14-you-cant-break.md"},{"layout":"post","title":"Writing challenge","date":"2018-12-31T22:18:00.000Z","categories":"misc","timestamp":1546294680,"content":"\nI don't exactly like new year and especially the typical ways to celebrate it,\nbut being latent conformist i can't just watch others enjoy themselves without\neither joining or being annoyed. Thus i tend to think up alternative ways to\ncelebrate. This year i'm going to do a writing challenge.\n\n%3Ccut/%3E\n\nOriginally, i wanted to make it a kind of writing jam and perhaps make it into a\nbig yearly event, but now i'm just not ready for that kind of organizing\nactivity. You're still welcome to join me, but otherwise i'm also fine doing by\nmyself.\n\nThe premise is simple: five stories in five days. Additional challenge: use as\nmuch languages as possible. Level impossible: make each story at least 5KW.\n\nOh well, i better not make up any more of these additionals. The challenge\nstarts in a couple hours.\n","cut":"\nI don't exactly like new year and especially the typical ways to celebrate it,\nbut being latent conformist i can't just watch others enjoy themselves without\neither joining or being annoyed. Thus i tend to think up alternative ways to\ncelebrate. This year i'm going to do a writing challenge.\n\n","path":"/_posts/2018-12-31-writing-challenge.md"},{"layout":"post","title":"1618","date":"2018-12-31T12:30:00.000Z","categories":"music","timestamp":1546259400,"content":"\n[that kind of noise - 1618](http://127.0.0.1:43110/1FiHm91tcDdjkiGkHZH2xoMc7Qmzrh8sv3/1618/),\nmy first noise album, is now released on 0net. I don't know about you,\nbut for me it's the most pleasant one to actually listen %5E_%5E\n","cut":"\n[that kind of noise - 1618](http://127.0.0.1:43110/1FiHm91tcDdjkiGkHZH2xoMc7Qmzrh8sv3/1618/),\nmy first noise album, is now released on 0net. I don't know about you,\nbut for me it's the most pleasant one to actually listen %5E_%5E\n","path":"/_posts/2018-12-31-1618.md"},{"layout":"post","title":"What's wrong with binary packages","date":"2018-12-26T18:50:00.000Z","categories":"misc","timestamp":1545850200,"content":"\nLong time ago %E2%80%93 when most users were programmers %E2%80%93 programs were usually being\ndistributed in source form only. But building binaries can be costly process and\ndoing it yourself is *only* really beneficial when you edit code%3B so when\ncomputers started to be adopted more widely, people started to use binaries more\nand more. Eventually GNU/Linux distributions were born, bringing to the masses\nnow familiar concepts of packages and repositories. But was that really a good\nthing%3F\n\n%3Ccut/%3E\n\nYou have probably already guessed the general direction of my answer, implied by\nthe title. That's right: i think binary packages (at least in a way they are\nusually handled) make a devastating blow to FLOSS development.\n\nConsider the following. A user happily installs a program with a few keystrokes\n(or mouse clicks) and in a few seconds is ready to use it. Sounds great, right%3F\nIn fact it works brilliantly, until user notices a bug or a missing feature, or\neven a minor issue such as translation mistake.\n\nSo they go to the bugtracker and fill an issue, only to get reply \"hey, it's\nalready been fixed in our latest version\". They wait patiently and a few\ndays/weeks/months or even years, bugfix or feature arrives at their repository.\n\nOr, perhaps, the issue is minor and they want to fix it themself. Surely even a\nnon-programmer can find the piece of bad translation (which they previously\nnoticed in ui) in code. After struggling with web interface of source repository\nor with vcs itself, they finally submit a fix. Weeks later another user comes to\ncomplain that interface become broken because new translation does not fit.\n\nEven worse is the case when user wants to make a fix that involves\nprogramming. To make a fix one *typically* needs to test that it works, but\nmaking program run from source is likely to take much more effort than the fix\nitself (this is especially true of code involving C/C%2B%2B or other languages\nwithout established platform-independent build systems). \n\nIn short, it boils down to extremely slow feedback loop and initial\nparticipation barrier being harder than necessary.\n\nSo what are alternatives%3F\n\nFirst of all, stop \"protecting\" user from things they should be interested in:\nimproving software and environment they use. Instead of spending efforts on\nfancy interfaces that do one thing or on creating yet another tool for shipping\nbinaries, we can create tools to make source building more accessible to\neveryone, both \"end-users\" and developers. This includes better documentation\nand exposure for existing tools.\n\nAs for existing approaches, surprisingly many (about all of relevant ones)\npackage managers do actually support source building. But beyond a few distros\nconsidered \"advanced\", these features are themselves considered \"advanced\" and\nare not expected to be used by everyone (i'm thinking of debbuild here, a tool i\nnever managed to actually successfully use beyond rebuilding of existing\npackages).\n\nAs far as i can see, the best development in this area might be NixOS: not only\nit offers benefits of both binary and source distribution, it also seems to\nreduce the cost of experiments by allowing side-by-side installation of several\npackage versions and rollbacks. I haven't used it yet (i'm sticking with my few\nyears old debian installation), but it's certainly the next distro i'm going to\ntry.\n\nGentoo and ArchLinux are another two systems which embrace source building\n(especially the former) and mainstream integration (especially the latter). But\nback in the days when i was using them, i didn't do much with those\npossibilities. Not sure why.\n\nPerhaps language-based repositories also deserve to be mentioned here, but i\ndon't have much to say about them now. They do have their issues, such as\nquality assurance and security breaches (people are still using npm, you know),\nbut first of all most of them do not have ambition to be universal.\n\nFinally i'd like to say that as much i like to criticize approaches taken by\nothers (as well as my past self), i still appreciate their hard work to make\nthis world a better place. I just wish it would be more effective.\n","cut":"\nLong time ago %E2%80%93 when most users were programmers %E2%80%93 programs were usually being\ndistributed in source form only. But building binaries can be costly process and\ndoing it yourself is *only* really beneficial when you edit code%3B so when\ncomputers started to be adopted more widely, people started to use binaries more\nand more. Eventually GNU/Linux distributions were born, bringing to the masses\nnow familiar concepts of packages and repositories. But was that really a good\nthing%3F\n\n","path":"/_posts/2018-12-26-binary.md"},{"layout":"post","title":"Free to pay","date":"2018-12-10T05:15:00.000Z","categories":"misc","timestamp":1544418900,"content":"\nHave you ever felt a need for human connection, approval of your worthiness from\npeople you care about%3F Or even something as simple as recognizing your\nexistance, perhaps%3F Depending on whose opinion you care about, nowdays it can be\nas easy as a single mouse click!\n\nRead on for details on this revolutionary \"free to pay\" system.\n\n%3Ccut/%3E\n\nCapitalism hasn't fully won on every territory on Earth, but luckily here on the\ninternets, it mostly did. The days of overly complex manually processed\nunmanaged barter are over%3B open market with single convertible currency\nliberates everyone from the burden of having to care about every aspect of\nlife. Just do your job well and let other professionals take care of your needs.\n\nAnd unlike boring twentieth century where you had to lie on the couch going\nthrough analysis, now you have a choice to pay those who you personally admire\nand get their approval in return.\n\nFinally, the dream of justice and equality for all (so often failed by\n\"socialists\") is being implemented. Being weak, stupid or simply narrow-minded\nis ok now. As long as you keep working for the benefit of society, society will\nalways support you back for a more than reasonable price.\n","cut":"\nHave you ever felt a need for human connection, approval of your worthiness from\npeople you care about%3F Or even something as simple as recognizing your\nexistance, perhaps%3F Depending on whose opinion you care about, nowdays it can be\nas easy as a single mouse click!\n\nRead on for details on this revolutionary \"free to pay\" system.\n\n","path":"/_posts/2018-12-10-free-to-pay.md"},{"layout":"post","title":"Integrating users on decentralized network","date":"2018-12-05T09:50:00.000Z","categories":"misc","timestamp":1544003400,"content":"\nZeroNet has thousands of sites, but only a very few of them are being actively\nused. There are countless half-baked projects of \"shiny new engine\", blogs on\nprolonged hiatus, chats with hundred and one \"hello world\" message and even more\nobscure stuff no one cares about any longer.\n\n%3Ccut/%3E\n\nBut it's also hard to find sites with interesting content or active users. Over\nits history, 0net has seen many attempts at site directories, but i've yet to\nsee a truly working one. I'm not going to fix that (yet), but at least here's an\noutline of possible solution so that i (or perhaps someone else) can get back to\nit later.\n\nFirst, here's an observation. What's the most typical first time user's\nquestion%3F Of course, it's \"What are some sites/blogs/people to\nlook/read/follow%3F\" And guess what, people even get answers to these questions!\nAlas, not always complete, but often more up-to-date than more static lists. And\neven when not asked, people would share links to sites they like or own. So it's\nnot that nobody knows information, it's that it's not put into a good format in\none place.\n\nBut guess what%3F Some of this information is already sitting on users'\ndrives. Users can see list of sites their node seeds. There's even a simple\n\"favourites\" system on 0hello. But you can't share that list.\n\nYou also can't easily follow other users' activity (although i've seen people\nproposed it long time ago), combination of which would (in theory) let user with\nsufficient social circle to discover most of new content they might be\ninterested in.\n\nOh, yeah, that sounds just like a social network. But as others have mentioned,\n0net indeed has the potential to *be* meta social network rather than *host*\none. But for that, we need to push integration much further than current \"news\nfeed\" on 0hello.\n\nThat said, there's probably a reason why it doesn't progress fast enough.  More\nthan one, in fact. Webdev (as most computing activities) is overly complicated%3B\npeople get easily distracted to do fancy stuff instead of features%3B 0net has\nalso technical \"server-side\" issues and feature requests%3B when you make\nsomething, others might not start use it (which encourages making standalone\nclassical sites instead of improving core).\n\nHow do we solve it%3F I don't know. More human power, dependent types, DSLs,\nneural networks, more rants%3F..\n\nPS: maybe writing a post like this while being half-asleep is not the best idea,\nbut if i probably wouldn't want to edit it later anyway\n","cut":"\nZeroNet has thousands of sites, but only a very few of them are being actively\nused. There are countless half-baked projects of \"shiny new engine\", blogs on\nprolonged hiatus, chats with hundred and one \"hello world\" message and even more\nobscure stuff no one cares about any longer.\n\n","path":"/_posts/2018-12-05-integrating.md"},{"layout":"post","title":"Rasterizing too early, PS","date":"2018-12-01T07:14:00.000Z","categories":"programming","timestamp":1543648440,"content":"\nWriting previous post i got too busy with colors and math, which i have been\nthinking about lately, but in fact the idea came to me earlier and wasn't about\n\"point-like\" objects like color. Instead i was thinking about the whole\n~~picture~~ 2d image.\n\n%3Ccut/%3E\n\nIf you've read my previous post, you can probably already guess where this is\ngoing. If color is a function, then surely something as complex as image should\nalso be a function. And indeed, that's part of it. 2d images can be represented\nas functions from (possibly bounded) coordinates to color. But that's not\nexactly what i wanted to tackle here.\n\nRather i wanted to talk about how to represent \"raster\" user actions (like\ndrawing). The most straightforward way used in raster programs is to rasterize\nthem immediately. The vector way is to transform cursor movement into curves,\nrotations, scalings. The omniscient way, though, is to store them all as\ncaptured and rasterize into pixels or vectorize into actions as needed.\n\nThis concept can probably be thought of as free construction on FRP. And not\nsurprisingly, it's already used in relation with FRP, though from what i gather,\nonly experimentally. And not in graphics.\n\nIf you consider how many areas of computing are about \"history\" (undo, vcs, dbs,\nlogs, backups), it can even be surprising that \"don't forget anything\" principle\nisn't used widely. Oh, but let me stop here so that i don't go on another rant\nabout how all of modern computing is a total wreck.\n","cut":"\nWriting previous post i got too busy with colors and math, which i have been\nthinking about lately, but in fact the idea came to me earlier and wasn't about\n\"point-like\" objects like color. Instead i was thinking about the whole\n~~picture~~ 2d image.\n\n","path":"/_posts/2018-12-01-user-actions.md"},{"layout":"post","title":"We're rasterizing too early","date":"2018-12-01T02:50:00.000Z","categories":"programming","timestamp":1543632600,"content":"\n..or the false dilemma between vector and raster graphics.\n\nThe common wisdom about representing real world data in computers is that it\ngets sampled, digitized and loses information in the process. Well, there is no\nworkaround for that, we can only hope sample sizes get closer to Plank time and\nlength. By extension we tend to think that unless you're doing heavy data\nanalysis, it is bound to be represented by array of integers or, at best,\nfloats.\n\n%3Ccut/%3E\n\nPrograms typically don't work with color and sound, but with RGB24, 1280x720 or\n44100Hz-16bit formats. For editing purposes one is supposed to use lossless\nformats and, preferably with higher resolution than intended rendering, so that\ninevitable loses won't be as noticeable.\n\nThere is of course, another common approach: vector, 3d or other kind of\nprocedural graphics, various sound synthesizers. But as the name implies, these\nare mostly synthetic in their nature.\n\nFinally, there is of course \"delayed computation\" paradigm, making editing\nprocess almost non-destructive. These may even employ some optimizations on how\nto apply raster operations, but otherwise they still work with the same data\narray paradigm.\n\nFor a long time i was embracing two latter approaches and i still like them. But\nrecently, while thinking how to represent pictures in functional programming\nparadigm and reading about arbitrary precision reals, i finally realized that we\ndon't have to lie. Yes, we can have a type for precise colors and sounds. More\nprecise than in life, actually.\n\n```\nWaveLength : {%E2%84%9D : Set} %E2%86%92 Set\nWaveLength {%E2%84%9D} %3D %E2%84%9D\n\nEnergy : {%E2%84%9D : Set} %E2%86%92 Set\nEnergy {%E2%84%9D} %3D %E2%84%9D\n\nSpectralColor : {%E2%84%9D : Set} %E2%86%92 Set\nSpectralColor %3D WaveLength %E2%86%92 Energy\n```\n\n(that's not pseudocode, that's Agda)\n\nYes, it's just that simple: color is just a mapping of wavelength to energy%3B if\nwe know energy (can be replaced with intensity, if desired) level of every\nwavelength contributing to final result, that's all (and in many cases, too\nmuch) we need to know about color.\n\nIf you have only ever heard about computer \"integers\" and floats, you might\nthink \"what the hell%3F how are you going to represent this infinite amount of\ninformation%3F\". Well, actually it starts with %E2%84%9D already: not only it's infinite,\nit's also uncountable. But before i go into a brief note about %E2%84%9D, here's a hint\nabout repesenting colors as functions: surely we can represent \"sin\", which also\n(at least conceptually) has \"infinite amount of information\". The only problem\nis that outside of functional programming, data %E2%86%94 code \"equivalence\" is rarely\nthought about beyond scripting.\n\nAnd now about real %E2%84%9D for those who didn't meet it yet. The idea is that you\nforget about bytes and machine words for a while and return to cozy mathematics\n(constructive, of course). There, you can find all kinds of real number\nconstructions: using Cauchy sequences, Dedekind cuts etc. And what a surprise,\neven famously transcedental %CF%80 can be represented as infinite converging\nsequences, which in turn can be written in finite alphabet using finite number\nof symbols form just fine. So we can serialize it. Yeah, that's how you do it:\nby serializing finite algorythm, we can later retrieve as many digits as we want\n(and have computer power) to.\n\nNow i feel like this post has become a bit too mathy than i wanted, so if you\nare still left wondering (you probably should, unless you know it already) about\nwhether resulting %E2%84%9D type is really type of reals or is it countable etc, i\nsuggest you read about computable numbers and reals in constructive math.\n\nReturning to colors, i should probably note that while the above `SpectralColor`\ndoes represnt what we typically consider to be essence of color, it's still not\nexactly physical. But then that's because there is no color in physics, photons\nare always waving around at the speed of light and only at our slow perception\nspeeds we perceive frequencies. It's somewhat similar to sound, but that one is\nmuch closer to our time perception speed and thus we don't tend to listen to\nstatic mix of frequencies (although i guess researching possibilities of drawing\nstatic sound spaces which need to be actively \"watched\" by rotating your head\ncan lead to interesting results).\n\nAnd finally, there are of course implementation issues. Most notably,\nconsidering how slow quality image and sound processing is already, it can be\nhard to make it fast enough. Straightforward implementation is doomed to be\nslow, so my best hopes are for hybrid approach dynamically choosing\nlossy-but-fast hardware implementation when it's effect on result is less than\ndesired %CE%B5.\n","cut":"\n..or the false dilemma between vector and raster graphics.\n\nThe common wisdom about representing real world data in computers is that it\ngets sampled, digitized and loses information in the process. Well, there is no\nworkaround for that, we can only hope sample sizes get closer to Plank time and\nlength. By extension we tend to think that unless you're doing heavy data\nanalysis, it is bound to be represented by array of integers or, at best,\nfloats.\n\n","path":"/_posts/2018-12-01-false-dilemma.md"},{"layout":"post","title":"sounds of ludum","date":"2018-10-31T17:05:02.000Z","categories":"music","timestamp":1541005502,"content":"\nI guess today is as good as any to make few final things about my \"third\" album:\nnamely, make a cover (which i already did), encode and publish it.\n[Here it is](http://127.0.0.1:43110/1FiHm91tcDdjkiGkHZH2xoMc7Qmzrh8sv3/sounds-of-ludum/).\n\n%3Ccut/%3E\n\nYes, as you may have noticed it's currently available only via ZeroNet. I might\nput it onto clearnet resources at some point later, if i'm not lazy. But then i\ndon't even know where: for *some reason* i don't like adding binary files to git\nall that much%3B for another, i don't know good music platforms.\n\nAs for music itself, it's not really something new. I simply decided to finally\nput together all (unless it's been on my first album) the music i've been doing\nfor games throughout my ludum dare days. I've added a couple touches here and\nthere for this release and arranged tracks in an order that seemed appropriate.\nThat's all. However, you probably haven't heard it before this post anyways.\n","cut":"\nI guess today is as good as any to make few final things about my \"third\" album:\nnamely, make a cover (which i already did), encode and publish it.\n[Here it is](http://127.0.0.1:43110/1FiHm91tcDdjkiGkHZH2xoMc7Qmzrh8sv3/sounds-of-ludum/).\n\n","path":"/_posts/2018-10-31-sounds-of-ludum.md"},{"layout":"post","title":"Practical guide to taking over the CLANG","date":"2018-10-25T04:10:06.000Z","categories":"misc","timestamp":1540440606,"content":"\nHave you ever been in a situation when you wanted to raise your CLANG as usual,\nbut suddenly noticed strange reaction of people around you%3F Perhaps you'd been\nclimbing over the neighbouring hill to proudly waive your CLANG from this high\npoint, when you'd realize that people averting gazes, changing the side of the\nstreet, or plainly stare at you with cold creepy eyes%3F..\n\n%3Ccut/%3E\n\nWhether it was as dramatic or not, whether you were on receiving end or brought\nit down yourself, if you have lived in society long enough, you probably had\nwitnessed this phenomenon. One might say that it's not even worth singling out\nas something special, because in the end the CLANG was never really the CLANG\nyou meant it to be. And that's valid point from one perspective.\n\nBut the world is so full of ambiguity that having just one \"ambiguity\" category\nfor it doesn't seem to be enough. Taking over the CLANG isn't only a recurring\nphenomenon, it's also one that can be (and thus most likely was) used\nintentionally, the most obvious motive being destruction of whatever stood\nbehind said CLANG.\n\nWhen this happens, does it make sense to continue using your stained CLANG,\nexplaining what you real mean on the way%3F Or to create a new CLANG and hope it\nwill work for a while%3F Or disregard society opinion or perhaps the whole concept\nof CLANGs%3F\n\nOr maybe you should at least stop treating people by the CLANG they use%3F\n","cut":"\nHave you ever been in a situation when you wanted to raise your CLANG as usual,\nbut suddenly noticed strange reaction of people around you%3F Perhaps you'd been\nclimbing over the neighbouring hill to proudly waive your CLANG from this high\npoint, when you'd realize that people averting gazes, changing the side of the\nstreet, or plainly stare at you with cold creepy eyes%3F..\n\n","path":"/_posts/2018-10-25-taking-over.md"},{"layout":"post","title":"The 'indie' problem","date":"2018-09-23T01:01:01.000Z","categories":"misc","timestamp":1537664461,"content":"\nLet me be clear: there are good works which have been labeled (or even\nself-labeled) as \"indie\". Depending on your taste, maybe even most of your\nfavourites are. But that doesn't make \"indie\" good. As a matter of my\nauthoritative opinion, it is bad in almost any sense possible.\n\n%3Ccut/%3E\n\nFirst and foremost, the word \"indie\" itself is beyond redemption. If you have at\nleast a vague idea of the whole concept, you should know that it is a derivative\nfrom \"independent\". Independent from big publishers, big money or other kind of\npower which strangles creative impulse...\n\nAs if no \"indie creator\" ever got themselves tons of money. As if no \"indie\ncreator\" strives to hit a major publishing contract.\n\nThe next problem naturally emerges from the first one. As \"indie\" becomes to be\nmisinterpreted as something more than \"lack of major publishing contract\"\nstatus, people start to use it as part of marketing strategy. And here's the\npower of money, which one supposedly sought to escape, is returning.\n\nAdding to this already grim picture is the fact that even those who never enter\nthe mainstream or get too rich can also easily lose the ephemeral\n\"independence\". Arguably, many are even more dependent than their colleagues\nworking on contract: when you try to live off your creative output on your own,\nit's hard not to notice what strategies are more profitable. What an irony: some\n\"indie creators\" actually do it on purpose!\n\nThere are probably more problems to tackle, but i want to only mention one more:\n\"indie\" is a culture of constantly looking up to mainstream. Yes, very often\ncritically and analytically, but nevertheless you can only go that far with\napplying typical transformations to typical mainstream. Hubris (which comes\neasily with tagging yourself with a cool label and then hanging around\nsimilarly-minded people) doesn't help being creative and self-critical either.\n\n...\n\nSo yeah, a word with no coherent meaning, whose supposed purpose is defeated on\nregular basis by its proponents. That's like what natural human languages are\nabout.\n","cut":"\nLet me be clear: there are good works which have been labeled (or even\nself-labeled) as \"indie\". Depending on your taste, maybe even most of your\nfavourites are. But that doesn't make \"indie\" good. As a matter of my\nauthoritative opinion, it is bad in almost any sense possible.\n\n","path":"/_posts/2018-09-23-the-indie-problem.md"},{"layout":"post","title":"On two modes of question `why`","date":"2018-09-12T15:45:05.000Z","categories":"language","timestamp":1536767105,"content":"\nNatural languages are ambiguous in many ways, including lexical. We're all used\nto one word having different meanings (or multiple different words having the\nsame spelling and pronunciation, depending on meaning of word \"word\"). But some\nof these differences are more elusive than other.\n\n%3Ccut/%3E\n\nFor example, if you know enough english (and, preferably, another language with\ndifferent kind of why-words), you might've noticed that word \"why\" may mean \"for\nwhat reason\" or \"for what purpose\". But the point of this post is a more subtle\ndifference. Even the for-what-reason meaning is still ambiguous.\n\nConsider question like \"why Earth is spherical%3F\". Aside from ironical or\npedantic responses, we may legitimately answer \"because gravity shaped it so\" or\n\"because if you travel, it loops with spherical topology and it also looks\nmostly spherical from space...\".\n\nBoth of this responses are about causality (rather than purpose). But first one\ngives cause of predicate's referent, while second one explains why did we\nconclude that predicate is true. Depending on question, either of this meanings\nmay make little sense. For example, question \"why is this apple green%3F\" about\nconcrete observable apple is most likely about apple's story and not our\nperception. On the contrary, \"why 2%2B2 %3D 4%3F\" is a question about our cognition\nbecause mathematical objects do not live in time and can't have any causal story\n(though something like \"concepts of math objects in people's minds\" may very\nwell have a whole history).\n\nBy the way, remember i ranted about *natural* languages at the beginning%3F Well,\nconstructed languages can be much less ambiguous and for example lojban does\ndistinguish between different types of reasons. I don't remember precise words,\nthough. [Look it up](https://lojban.github.io/cll/9/7/).\n\n...\n\nIf you still have little idea of what this is all about, or disagree on some\npoints, you may wonder \"why is this post so bad%3F\". And to that i can name any\namount of reasons ranging from lack of author's sleep to imperfect\nperfectionism, or i can just say \"because you've read it and concluded that it\nis *so bad*\".\n","cut":"\nNatural languages are ambiguous in many ways, including lexical. We're all used\nto one word having different meanings (or multiple different words having the\nsame spelling and pronunciation, depending on meaning of word \"word\"). But some\nof these differences are more elusive than other.\n\n","path":"/_posts/2018-09-12-why.md"},{"layout":"post","title":"Correlation%E2%88%9E","date":"2018-09-08T20:00:00.000Z","categories":"misc","timestamp":1536436800,"content":"\nCorrelation does not imply causation, but they certainly can be\ncorrelated. Measure of such correlation can then be used as a measure of\neffectiveness of correlation studies. If we're to correlate this measure with\nalternative measures in the same field, and then continue this process of higher\ncorrelating ad finitum, what kind of knowledge can we obtain%3F\n","cut":"\nCorrelation does not imply causation, but they certainly can be\ncorrelated. Measure of such correlation can then be used as a measure of\neffectiveness of correlation studies. If we're to correlate this measure with\nalternative measures in the same field, and then continue this process of higher\ncorrelating ad finitum, what kind of knowledge can we obtain%3F\n","path":"/_posts/2018-09-08-correlation.md"},{"layout":"post","title":"Forth chapter","date":"2018-09-04T22:10:05.000Z","categories":"fiction","timestamp":1536099005,"content":"\n%E5%A4%8F%E3%81%8A%E4%BC%91%E3%81%BF is over (not like i should care) and finally, after too much fuss with\nediting, heavy bright sun is back. Enjoy 4th chapter from [here](/txt) (can't\nreally give direct links with site being mirrored on clear- and zero- nets).\n\nI have a few more in (nearly) ready state, so one might hope i'll start\npublishing more regularly, but i promise nothing!\n","cut":"\n%E5%A4%8F%E3%81%8A%E4%BC%91%E3%81%BF is over (not like i should care) and finally, after too much fuss with\nediting, heavy bright sun is back. Enjoy 4th chapter from [here](/txt) (can't\nreally give direct links with site being mirrored on clear- and zero- nets).\n\nI have a few more in (nearly) ready state, so one might hope i'll start\npublishing more regularly, but i promise nothing!\n","path":"/_posts/2018-09-04-forth.md"},{"layout":"post","title":"This blog goes 0social","date":"2018-09-01T15:00:00.000Z","categories":"site","timestamp":1535814000,"content":"\nFinally, after ~~months of development and thorough testing~~ a few more hours\nof spaghetti coding, comment feature is returned to this site. As promised, it\nis implemented in 0net now. Now i should probably add some links / instructions\nfor clearnet users, but that can wait a bit.\n","cut":"\nFinally, after ~~months of development and thorough testing~~ a few more hours\nof spaghetti coding, comment feature is returned to this site. As promised, it\nis implemented in 0net now. Now i should probably add some links / instructions\nfor clearnet users, but that can wait a bit.\n","path":"/_posts/2018-09-01-0comments.md"},{"layout":"post","title":"Symmetric Peano addition","date":"2018-08-29T16:55:00.000Z","categories":"programming","timestamp":1535561700,"content":"\nGiven natural numbers defined by\n\n```\ndata N %3D Z %7C S N\n```\n\nthe typical way of defining addition is asymmetrical\n\n```\nx %2B Z %3D x\nx %2B (S y) %3D S (x %2B y)\n```\n\n(or its opposite, recursing on first argument instead)\n\nIf you have sense for mathematical beauty, you should be annoyed by this\nasymmetry. Furthermore, if you're doing proofs about addition (e.g. x%2By %3D y%2Bx)\nor want to play with non-total lazy infinity (inf %3D S inf) and bottoms, this\nasymmetry is going to haunt you whenever you do that.\n\n%3Ccut/%3E\n\nBut guess what, a very straightforward solution exists:\n\n```\nZ %2B x %3D x\n(S x) %2B (S y) %3D S (S (x %2B y))\nx %2B Z %3D x\n```\n\nThe order here is strictly irrelevant, unless you somehow care whether `Z%2Bx` or\n`x%2BZ` rule applies in `Z%2BZ` case. In particular, in non-total lazy languages\nlike Haskell, you can work with infinity just fine, regardless whether it\nhappens to be on the left or on the right side of the cross. Same goes for\n`undefined`: unlike asymmetric version, `S undefined %2B Z` has the same meaning\nas `Z %2B S undefined`%3B you can easily check that by substituting `undefined` to\nleft and right sides, at desired level of nesting.\n\nPerhaps the only disappointment (for perverts who enjoy playing with bottom) is\nthat SSSZ %2B S%E2%8A%A5 %3E SSZ %E2%89%A1 %E2%8A%A5 (in contrast with SSZ %2B SS%E2%8A%A5 %3E SSZ). But since there is no\nway to pattern-match on bottom, you'll have to live with that.\n\nI could probably accompany this post with formal type-theoretic proofs of usual\naddition properties in order to bloat this trivial post even more, but i'm just\na bit too lazy to setup proof checker environment just now.\n","cut":"\nGiven natural numbers defined by\n\n```\ndata N %3D Z %7C S N\n```\n\nthe typical way of defining addition is asymmetrical\n\n```\nx %2B Z %3D x\nx %2B (S y) %3D S (x %2B y)\n```\n\n(or its opposite, recursing on first argument instead)\n\nIf you have sense for mathematical beauty, you should be annoyed by this\nasymmetry. Furthermore, if you're doing proofs about addition (e.g. x%2By %3D y%2Bx)\nor want to play with non-total lazy infinity (inf %3D S inf) and bottoms, this\nasymmetry is going to haunt you whenever you do that.\n\n","path":"/_posts/2018-08-29-symmetric-addition.md"},{"layout":"post","title":"One more use for The Dreadful Bottom","date":"2018-08-21T01:13:02.000Z","categories":"programming","timestamp":1534813982,"content":"\nEveryone knows that Haskell's bottom (commonly referred to as `undefined`) is\nresponsible for nearly all possible failures (including so-called Hask not being\nreal category). Still, it is known to be useful sometimes: for example, when you\nwant to make things compile before you finished coding.\n\n%3Ccut/%3E\n\nBut what if we look at it from propositional point of view%3F Plugging `undefined`\nsomewhere essentially means \"hey, i've a got a proof! but i can't show it you :(\nso please just believe me and don't look at it..\" Indeed, if you don't care\nabout (and don't inspect) the proof itself and just want to know that\nproposition is \"true\" (in whatever sense), your program won't explode (however,\nit may start misbehaving). E.g.\n\n```\nfour_is_five : 4 %3D 5\nfour_is_five :%3D undefined\n\ndivide_by_self : (x : Nat) -%3E (y : Nat) -%3E {x %3D y} -%3E Nat\ndivide_by_self _ _ _ :%3D 1\n\nwrong : Nat\nwrong :%3D divide_by_self 4 5 four_is_five\n```\n\nNow you might be wondering why would you want to break your program like\nthat. And indeed, in general you probably wouldn't. But what if you're calling\nsome external code to do some dirty jobs for you%3F It can surely become handy to\nbe able to make compiler assume things that you know to be true, but can't prove\ninside language. Usual application of such knowledge is to let compiler make\noptimization, but in the context of dependent type programming it can actually\nbe a matter of being able to use desired interface (more on that later).\n\nThat said, there still should be strict distinguishing between total parts of\nprogram which can't go wrong and those relying on external promises. And perhaps\na few compiler switches to control whether promises should be checked in runtime\n(slow, but safe) or blindly trusted (optimized).\n","cut":"\nEveryone knows that Haskell's bottom (commonly referred to as `undefined`) is\nresponsible for nearly all possible failures (including so-called Hask not being\nreal category). Still, it is known to be useful sometimes: for example, when you\nwant to make things compile before you finished coding.\n\n","path":"/_posts/2018-08-21-bottom.md"},{"layout":"post","title":"Types as propositions is intuitive","date":"2018-08-16T17:08:32.000Z","categories":"programming","timestamp":1534439312,"content":"\n..if you're taught in a right way about it and know a bit of math.\n\n%3Ccut/%3E\n\nAs long as you understand immutability, it isn't hard to come to conclusion that\ntypes are \"kinda like\" sets. This is blatantly obvious for numeric types, but if\nyou heard of cartesian product and discriminated union, it also becomes clear\nthat data definitions in pure fp work in a similar fashion.\n\nThen it is simply a matter of contemplating idea that sets can be defined by\nmembership rules, i.e. by giving a predicate (well-defined in a sense, so as to\navoid paradoxes) that should hold for all of its members (and vice verse,\neverything for which it is true is member of set in question).\n\nNow proposition and predicates are not exactly the same, of course. But they are\nso similar that finding a (perhaps partial) correspondence between them is a\nreally easy thing to do. Predicates can be made to propositions using\nquantifiers (i.e. saying \"for all x P is true\", or \"there is x such that P is\ntrue for it\")%3B propositions can be made into predicates by kinda removing\nquantifiers, but although that might get a bit tricky, it is quite intuitive\nthat it can be done at least for many of propositions.\n\nThat's really all there is to it. But then of course, there's a number of\nobstacles to that path.\n\nAnd another note i should perhaps stress is that this correlation is no more\nthan intuition (and quite incomplete at that)%3B if you want to be mathematical\nabout it, you'd need to give rigorous definitions for things you work with. But\nin order to get interested in such definitions in the first place, it could be\nuseful to get the sense of it.\n","cut":"\n..if you're taught in a right way about it and know a bit of math.\n\n","path":"/_posts/2018-08-16-types-as-propositions.md"},{"layout":"post","title":"Function category","date":"2018-08-03T21:00:00.000Z","categories":"programming","timestamp":1533330000,"content":"\nThere is a long-standing tradition that talks about category theory application\nto programming only mention one single category: namely, the category of types\n(as objects) and functions (as morphisms) (and of course, it is widely known\nthat many languages do not in fact correspond to this category). But category\ntheory is not about single category. On the contrary, most interesting things\nhappen when many categories are involved.\n\n%3Ccut/%3E\n\nSo here's another (possibly useless) categoric view of functional programming: a\ncategory for single function. It is an extremely simple category that has values\nas objects and function application on values as morphisms. This might sound a\nbit confusing, so here's an example:\n\n```\n0 -%3E 1 -%3E 2 -%3E 3 -%3E ...\n```\n\nThis is a category for (%2B1) function on natural numbers. Of course, there are\nalso identity morphisms and composed morphisms. But since every \"generating\"\nmorphism simply denotes example of single function application, every composed\nmorphism will simply denote application of (%2B1) several times.\n\nIn fact, every morphism in such category for function f will correspond to f%5En\n(n %3E%3D 0) and if f's domain and codomain have different types, it will be a very\nboring category with only identity (f%5E0) and (f%5E1) kind of morphisms. E.g.\n\n```\nTrue -%3E \"True\"\nFalse -%3E \"False\"\n```\n\n(which denotes `show :: Bool -%3E String` function)\n\nWhat else can we do with these class of categories%3F We can make functors, of\ncourse! And unlike usual FP-categorical thinking, non-endo functors.\n\nSpecifically we can make a functor that maps category for endofunction (is this\nreally a term%3F) to monoid of repeated function application.\n\n```\nf :: a -%3E a   ~~~~%3E   _ A(f)%3C\n                     /  %5E %7C  \\\n\t\t  id \\_/   \\_/ f%5E1\n```\n\nThe functor should be quite obvious: it maps\n\n- all values to single object\n- all ids to id\n- all generating morphisms to f%5E1 morphism\n- all composed morphism to f%5En morphisms\n\nAnd non-endo functions can be mapped into simple category with two objects\n(domain and codomain types) and one morphism (function itself).\n\nAnd, as you might've already guessed, these two categories are subcategories of\nSet (or whatever analogy is used in your pl). But now we get an interesting\npicture:\n\n```\n(f :: a -%3E a)  ~~~%3E  A(f)  ~~~%3E  Set\n(g :: a -%3E b)  ~~~%3E  B(g)  ~~~%3E  Set\n...            ~~~%3E  ...   ~~~%3E  Set\n```\n\nHere we have two collections of functors: first maps function categories (with\nvalues %26 their connections) to individual type/function categories%3B second one\nsimply maps those latter categories into Set as is. So we have a collection of\ncategories and a family of functors which are generated quite\nmechanically. Maybe we can make a proper category for that \"collection\" and a\nsingle functor from it to Set%3F (in other words, we want and endofunctor in Cat\nwhich would merge our categories and leave the rest as is)\n\nWell, the simplest way of doing this would be to merge all the functions! If we\njust take care to distinguish morphisms, this fairly interleaved category will\nstill preserve all the required information and we can have functor from it to\nSet. Depending on amount of functions we want to merge, it can get quite messy,\nthough.\n\nBut one obvious observation would be that this category will be functionally\nidentical to program definition (in a total PL with proper type/function\ncategory, of course).\n\nWhich implies that compiler can be seen as something very similar to\nfunctor. But i guess developing that thought deserves a separate post.\n","cut":"\nThere is a long-standing tradition that talks about category theory application\nto programming only mention one single category: namely, the category of types\n(as objects) and functions (as morphisms) (and of course, it is widely known\nthat many languages do not in fact correspond to this category). But category\ntheory is not about single category. On the contrary, most interesting things\nhappen when many categories are involved.\n\n","path":"/_posts/2018-08-03-function-category.md"},{"layout":"post","title":"Thoughts on CC-NC","date":"2018-06-15T21:21:21.000Z","categories":"misc","timestamp":1529097681,"content":"\nIt occured to me that \"non-commercial\" clause in CC licenses can have two\ndifferent (almost opposite) motivations.\n\n%3Ccut/%3E\n\n1. \"if you want to profit off my work, you'll have to pay me as well\"\n\n2. \"nobody should profit off my work (including author)\"\n\nThere is of course some middle ground between these options (such as: \"i'd like\nto choose on which conditions my work can be used commercially\"), but it is\nkinda ironic that the same license can be choosen (over non-nc alternative) by\npeople with completely different goals and ultimately even opposite world views.\n\nNearly the same reasoning can apply to \"no derivatives\" clause, but this is\nbeyond the scope of this little side note.\n","cut":"\nIt occured to me that \"non-commercial\" clause in CC licenses can have two\ndifferent (almost opposite) motivations.\n\n","path":"/_posts/2018-06-15-nc.md"},{"layout":"post","title":"Emacs: another stop on the journey to perfect desktop","date":"2018-05-29T12:58:27.000Z","categories":"misc","timestamp":1527598707,"content":"\nI've been searching for a perfect desktop setup for as long as i remember\nusing computer. KDE3, Gnome2, KDE4, switching from (then still) OpenOffice to\nKate for everything, drop-down terminal, excursions to *box and awesome, then\nfinally settling with 10-virtual-desktop layout and a handful of shortcuts.\n\n%3Ccut/%3E\n\nNow's the time has come to move further, to the land of even better ergonomics.\nAnd the first step is Emacs. I've been slowly moving towards it in the last few\nweeks and now i'm writing this post in Emacs, running jekyll in terminal inside\nEmacs and watching the \"rendered\" page in emacs-w3m (because eww was freezing\nEmacs way too often).\n\nOf course, Emacs is not perfect. It is great because of its large legacy (has a\ntool for virtually everything), but its legacy also affects its useability in\nsome ways. To put it blunt: i don't like Lisp these days. And lack of\nintegration with some of the common desktop GNU/Linux can be daunting (such as\nno shortcuts with non-latin ibus layout%3B out of the box, at least - maybe it can\nbe configured somehow).\n\nAt some point, perhaps, i'll have to look further, for a *truly silver* bullet\nof computing. But for now it mostly feels nice to be switching from using a\nbunch of tools with different interfaces and quirks to just one, fully\ncontrollable with keyboard.\n","cut":"\nI've been searching for a perfect desktop setup for as long as i remember\nusing computer. KDE3, Gnome2, KDE4, switching from (then still) OpenOffice to\nKate for everything, drop-down terminal, excursions to *box and awesome, then\nfinally settling with 10-virtual-desktop layout and a handful of shortcuts.\n\n","path":"/_posts/2018-05-29-emacs.md"},{"layout":"post","title":"","date":"2018-05-16T07:30:00.000Z","categories":"poetry","timestamp":1526455800,"content":"\n```\n%D0%BF%D1%80%D0%B8%D0%B2%D1%8B%D1%87%D0%BD%D1%8B%D0%B9 %D0%BC%D0%B8%D1%80 %D1%83%D0%BD%D1%8B%D0%BB %D0%BA%D0%B0%D0%BA %D1%81%D0%BA%D0%B0%D0%B7%D0%BA%D0%B0\n%D1%80%D0%B0%D1%81%D1%81%D0%BA%D0%B0%D0%B7%D0%B0%D0%BD%D0%BD%D0%B0%D1%8F %D0%BA%D0%B5%D0%BC-%D1%82%D0%BE %D0%BD%D0%B0 %D0%B2%D0%B5%D1%82%D1%80%D1%83\n%D0%BD%D0%B0 %D0%B2%D0%BE%D0%BB%D0%BE%D1%81%D0%B0%D1%85 %D0%BC%D0%BE%D0%B8%D1%85 %D1%81%D0%B5%D0%B4%D0%B5%D0%B5%D1%82 %D0%BA%D1%80%D0%B0%D1%81%D0%BA%D0%B0\n%D1%82%D1%8B %D0%BD%D0%B5 %D1%83%D0%BC%D1%80%D1%91%D1%88%D1%8C %D0%B0 %D1%8F %D1%83%D0%BC%D1%80%D1%83\n```\n","cut":"\n```\n%D0%BF%D1%80%D0%B8%D0%B2%D1%8B%D1%87%D0%BD%D1%8B%D0%B9 %D0%BC%D0%B8%D1%80 %D1%83%D0%BD%D1%8B%D0%BB %D0%BA%D0%B0%D0%BA %D1%81%D0%BA%D0%B0%D0%B7%D0%BA%D0%B0\n%D1%80%D0%B0%D1%81%D1%81%D0%BA%D0%B0%D0%B7%D0%B0%D0%BD%D0%BD%D0%B0%D1%8F %D0%BA%D0%B5%D0%BC-%D1%82%D0%BE %D0%BD%D0%B0 %D0%B2%D0%B5%D1%82%D1%80%D1%83\n%D0%BD%D0%B0 %D0%B2%D0%BE%D0%BB%D0%BE%D1%81%D0%B0%D1%85 %D0%BC%D0%BE%D0%B8%D1%85 %D1%81%D0%B5%D0%B4%D0%B5%D0%B5%D1%82 %D0%BA%D1%80%D0%B0%D1%81%D0%BA%D0%B0\n%D1%82%D1%8B %D0%BD%D0%B5 %D1%83%D0%BC%D1%80%D1%91%D1%88%D1%8C %D0%B0 %D1%8F %D1%83%D0%BC%D1%80%D1%83\n```\n","path":"/_posts/2018-05-16-usual.md"},{"layout":"post","title":"Text section and other updates","date":"2018-05-13T15:17:12.000Z","categories":"misc","timestamp":1526224632,"content":"\nSo this site just got a shiny new (!) txt section. Eventually i should clean up\nthis mess with projects/txt/music separation and overlaps. Not sure if anyone\nwould care though.\n\nI should also fix a couple things with css at some point. Eh, i need an AI to\nhandle these things for me.\n","cut":"\nSo this site just got a shiny new (!) txt section. Eventually i should clean up\nthis mess with projects/txt/music separation and overlaps. Not sure if anyone\nwould care though.\n\nI should also fix a couple things with css at some point. Eh, i need an AI to\nhandle these things for me.\n","path":"/_posts/2018-05-13-txt.md"},{"layout":"post","title":"Short history of a certain skeptic","date":"2018-04-25T14:06:08.000Z","categories":"philosophy","timestamp":1524665168,"content":"\n(well, it appears i can't be bothered to edit this one)\n\n%3Ccut/%3E\n\nshort history of skeptic: \"crap, i don't know anything about universe and how am i supposed to learn%3F surely i can't rely on senses, but i also can't trust my mind since it errs so much. lets invent an easy mechanical way to do it\"\n\n\"yay, we have predicate logic and later boolean logic. surely nobody would make a mistake with True, False and a bunch of binary operations. one can always doublecheck using these simple operation tables\"\n\n\"but that doesn't give us much. hey, isn't there such a thing as geometry%3F lets take a look\"\n\n\"oh crap, it's all based on senses. lets put some axioms and derive everything from them using our great infallible mechanical logic\"\n\n\"now that's better. but wait, our axioms are based on senses!\"\n\n\"we can't trust senses, but we want geometry. lets port it onto algebra\"\n\n\"he-he, aren't we so cool%3F knowing so much about the world! with just a few easily checkable rules!\"\n\n\"ooh, actually algebra is quite complex. we are making mistakes again. damn, we need axiomatic system for it too!\"\n\n\"he-he, now we are talking!\"\n\n\"infinity%3F did someone say infinity%3F isn't that the same as god%3F ah, fuck it, we have them in our math, so we must deal with them using our great tools!\"\n\n\"but the Pi still sure looks scary! and those weird infinite sequences..\"\n\n\"surely it 'looks' like there are more real numbers than integers, but that's senses again!\"\n\n\"duh, algebra cannot into this. we need to build a set theory to deal with infinite sets. surely something will work out\"\n\n\"and remember we started with notion of predicates%3F surely every predicate has a set of numbers which satisfy predicate\"\n\n\"hmm, did i just say set of numbers%3F but what about set of sets%3F surely there's a predicate 'is a set', so must be a set containing other sets\"\n\n\"...and the universe is just one fucking big set of all sets. isn't that cool%3F\"\n\na certain barber walks into the room\n\n\"no, no, we have our own private universe! it has nothing to do with your dirty reality and dirty barbers!\"\n\n\"but hey... what if... what if there is a 'barber' set%3F set of all sets that aren't elements of self%3F\"\n\n\"aww, universe on fire! math is doomed! there is no truth! we're back to square one!\"\n\nskeptic is depressed for a while\n\n\"but hey, if we just restrict sets and create classes%3F.. won't it all work out%3F\"\n\n\"and then we can add some lambda calculus, turing machine isomorphism and that thing to describe morphism - category theory\"\n\n\"and have computer prove everything that can be proved! mu-ha-ha!\"\n\nskeptic's subconsciousness: \"and now all the cool kids will be able to play with programming and games that they would code. nobody would have time to find blind spots in our complex math castle\"\n\nevil laughter is unheard by skeptic because they exist in sound-proof math universe\n\n\nTHE END\n\n\n(a certain greek philosopher was not allowed on scene%3B not that he tried)\n\n","cut":"\n(well, it appears i can't be bothered to edit this one)\n\n","path":"/_posts/2018-04-25-short-history.md"},{"layout":"post","title":"(Un)minor site update","date":"2018-04-21T00:12:24.000Z","categories":"misc","timestamp":1524269544,"content":"\nFinally, eucalyptus becomes official part of the site. Unfortunately, with\nduct-tape HydeView engine i can't link to it normally, so for now there are two\nlinks:\n\n- [clearnet](/eucalyptus-ff)\n- %3Ca href%3D\"/\" onclick%3D\"page.initialize('eucalyptus/')\"%3E0net%3C/a%3E\n\n%3Ccut/%3E\n\nOh yeah, i still remember about 22222 promise and this is in part preparation\nfor that. I'm running late as usual, but gotta make everything right, you know.\n\n..Just joking. I'll never be able to make *everything* wright on the webs. But\nwho can, anyways%3F The web is broken.\n","cut":"\nFinally, eucalyptus becomes official part of the site. Unfortunately, with\nduct-tape HydeView engine i can't link to it normally, so for now there are two\nlinks:\n\n- [clearnet](/eucalyptus-ff)\n- %3Ca href%3D\"/\" onclick%3D\"page.initialize('eucalyptus/')\"%3E0net%3C/a%3E\n\n","path":"/_posts/2018-04-21-minor-site-update.md"},{"layout":"post","title":"What is hard...","date":"2018-04-20T19:46:12.000Z","categories":"philosophy","timestamp":1524253572,"content":"\nDISCLAIMER: this article touches upon philosophy, math, psychology, programming,\nlinguistics and perhaps other stuff, in which its author does not have a PhD. It\nis not unrealistic to assume that equivalent article was already written.\nHowever, if you've read it, you don't need explanations why this one was written\nfrom me.\n\n%3Ccut/%3E\n\nAnd now, with some audience filtering applied, we can dig into mattress without\nfurther ado.\n\nThe full title actually reads as following:\n\nWhat is hard, different kind of laziness, goodness of abstractions, usefulness of truth and other questions that you should have been asking\n----------------------------------------------------------------------------------------------------------------------------------------------\n\nSince this article is a lazy article, i'll start with short overview of the\ntopics.\n\nWriting english is hard (translation: it's hard to express abstract thoughts in\nnatural languages). Discussing \"hard\" is hard (just another concrete example for\nexpressiveness or funness purposes). Life is hard (i'll probably run out of\npaper before i can describe what that one means).\n\nWhat is more lazy: writing a program that does boring homework for you, or doing\nboring homework yourself%3F Eh, homework was supposed to be an example, but i\ncan't really stop touching education topic just yet: is homework that cannot be\nchecked whether it was really made by a student and not a program (that might\nhave been written by them or someone else) have a purpose%3F\n\nOf course, i'm not going to answer (or even elaborate on) that question here,\nbecause i'm lazy and writing english is hard. If you want, you can consider it\nyour homework, but pay attention to the fact that it (or its part) may be a red\nherring.\n\nAbstractions, generalization, induction %E2%80%94 so many words that generally need\nelaboration in order to be understood correctly (did i mention that\ncommunicating meaning is hard%3F). Maybe we should replace them with precisely\ndefined logographic characters%3F\n\nWell, the problem is that even precise terms are not enough. We'd also like\nprecise and succinct grammar.\n\nHigher order naivety and cynicism\n---------------------------------\n\nAnother thing to consider: socialization is known to turn naive children into\ncynical teens. However, while most adults are more cynical than children, many\nare less cynical than teens. Sometimes that's called wisdom (..that comes with\nage and experience), but that term is really really really fuzzy. I can\nunderstand how it became popular, but that doesn't excuse its usage.\n\nSo, instead of using fallacious terms, why not reuse ones (maybe also\nfallacious) we're using anyway and add modifiers to them%3F\n\n%3F%3F%3F -%3E naivety -%3E cynicism -%3E 2nd order naivety -%3E ...\n\nDamn, this pattern shows up so often that i don't even! But, perhaps some\nelaboration is due.\n\nSo, as you may guess, this can turn into an endless sinusoid-like graph of\nnaivety-vs-cynicism. But it's a bit of oversimplification. And i'm not even\ntalking about simplification of curve per se%3B that is obvious. Rather, i mean\nthat using just one numeric value is an absurd oversimplification, worthy of\nbehaviourist award.\n\nAs a matter of fact, even my simplified model isn't that simple. There is a\ncertain qualitative difference between levels of naivety or cynicism. One of my\nfavourite examples is \"naive cynicism\". Which is of course still a fuzzy\numbrella term. But it's a fun way to describe certain kind of people, who\nbelieve that literally everyone is a cynic and expect everyone to act\naccordingly and always try to find rational \"cynical\" explanation. They also\ntend to think they're justified to act in a way they do, because everyone does\nso.\n\nI'll leave it up to you to consider possibility of cynical naivety, but it\nshould probably be obvious that there's such a thing as intentional naivety.\n\nNext, next, NEXT.\n\nAbstractions\n------------\n\nYay, abstractions! Who doesn't love themselves a good bite of godly abstraction%3F\n\nBut as the title mentions, abstractions can be good or bad. See previous\nsection: abstracting away the difference between naivety and cynicism into one\nvariable might simplify the model, but it makes it mostly useless: it abstracts\naway essential details. It's a bad abstraction.\n\nAnother example is famous \"prisoner dilemma\". Mathematical model of it (i.e.\ndecision/outcome matrix) is just \"pure numbers\". Nothing wrong with that. Just\nstating the obvious. But the name is fucking misleading. Taking this as a model\nof real-world prisoner dilemma leads to thoughtful head scratching and long\ndebates on the nature of rationality and decision-making. Well, that's also due\nto naive cynicism, i must add.\n\nRegardless, the real prisoner dilemma can be easily fed into decision-making\nmatrix, without any head-scratching and oh!-natural-selection-isn't-just-about-force\nrevelations. I've already touched upon this in an unpublished post: skeptics can\neasily fall into the trap of explaining simple things with complex constructs\nyears or centuries after the same thing was already explained and explored.\n\nIt's all about fear/trust issues, really. Scientist and philosophic paranoics\ndon't trust their minds and thus have to invent mechanical rules. It's akin to\nrunning virtual machine without optimizations, so naturally it makes thought\nprocesses extremely slow. But they've got *proofs*!\n\nTruth\n-----\n\nI think you might've noticed that i've been talking about truth usefulness just\na bit back already. But \"what is TRUTH%3F\" anyhow. I could just invoke Kant and be\ndone with it, but then i could as well ignore the question altogether.\n\nThe problem is that the question arises from the same paranoidal school of\nthought. \"Socrates is mortal\", yeah, fucking right. The funny thing is that just\nlike with naivety and cynicism in general, naive paranoidal philosophers tend to\nturn into cynical paranoidal philosophers and vice verse.\n\nTurned away by inability to define truth, they are ready to proclaim \"there's no\ntruth\". Bored and pained by \"lack of truth\", they turn to one deity or another\nand become devoted to the new shinjitsu.\n\nYeah, apparently Hegel had some interesting ideas. Too bad they were turned into\nsuch an ugly mess. Kinda ironic that people who admit being more stupid take up\nthe task to explain more smart ones, isn't it%3F\n\nBut hopefully no truth lost between us. I tried to defend this article with a\nfew powerful %E3%81%8A%E3%81%BE%E3%81%98%E3%81%AA%E3%81%84. If it is all in moot, so be it.\n\nLazy\n----\n\nShall we get to the king of virtues, then%3F J-u-s-t  t-o-o  l-a-z-y  t-o  d-o\nt-h-a-t. Or so you should've answered.\n\nOne thing about laziness is that it should be an informed one. Misinformed or\nuninformed laziness tend to be ugly and boring.\n\nLazy to learn how to automate your routine%3F Be ready to be pained by routine.\n\nLazy to learn variables and procedures%3F Be ready to be pained by rewriting your\ncode.\n\nLazy to learn functional programming%3F Be ready to be pained by copy-pasting and\nlearning \"patterns\".\n\nEtc, etc.\n\nBut if you're lazy to do the routine, rewrite and copy-paste your code, you're\nlikely to end up doing more useful things and possibly become a better person in\nthe process.\n\nThe problem, yet again, is about information and criteria. If one is told to\nlearn everything, how to distinguish between what to learn and what to not\nlearn%3F Axiom of choice, %E5%91%B5%E5%91%B5.\n\nThis makes me think about Emacs vs Vim vs IDE vs YACE. It takes time to learn\nVim or Emacs to use them efficiently. It takes even more time to learn to use\nIDE efficiently. Yet many prefer to learn useless IDEs. Still others stick with\nsome YACE and don't bother switching.\n\nSometimes i wonder if text editors are useful concept et al.\n\nSo yeah, i probably should've touched on other substances as well, but this is a\nlazy article after all. Learn yourself a haskell, a category theory, some\nintrospection, philosophy and clairvoyance and you can evaluate the rest.\n","cut":"\nDISCLAIMER: this article touches upon philosophy, math, psychology, programming,\nlinguistics and perhaps other stuff, in which its author does not have a PhD. It\nis not unrealistic to assume that equivalent article was already written.\nHowever, if you've read it, you don't need explanations why this one was written\nfrom me.\n\n","path":"/_posts/2018-04-20-what-is-hard.md"},{"layout":"post","title":"\"Geeks\" vs \"hackers\"","date":"2018-04-12T00:00:02.000Z","categories":"misc","timestamp":1523491202,"content":"\nBoth cultures seem to be heavily built around computer-related knowledge, but\nrelating to computers is nothing more than a flavour. The difference that i'd\nlike to call to attention in this post is that \"geeks\" pursue knowledge for the\npleasure of experiencing new, while \"hackers\" pursue knowledge to improve their\naesthetic taste.\n\nThat difference might be more fundamental than one might think on the first\nsight. While person may switch from one side to another and back, cultures\nformed by people with certain mindsets persist and have a lot of recurring\npatterns.\n\nOf course, i could have used E- and W- words, but unfortunately that is too\nloaded cliche to be easily perceivable and i would have been forced to elaborate\nmore on history and other details and the post would have more chances to be\nleft unfinished.\n\nBeing too abstract and not attaching any common names to these categories, on\nthe other hand, could have led to text being too boring, either for me or for my\nimaginary friends.\n","cut":"\nBoth cultures seem to be heavily built around computer-related knowledge, but\nrelating to computers is nothing more than a flavour. The difference that i'd\nlike to call to attention in this post is that \"geeks\" pursue knowledge for the\npleasure of experiencing new, while \"hackers\" pursue knowledge to improve their\naesthetic taste.\n\nThat difference might be more fundamental than one might think on the first\nsight. While person may switch from one side to another and back, cultures\nformed by people with certain mindsets persist and have a lot of recurring\npatterns.\n\nOf course, i could have used E- and W- words, but unfortunately that is too\nloaded cliche to be easily perceivable and i would have been forced to elaborate\nmore on history and other details and the post would have more chances to be\nleft unfinished.\n\nBeing too abstract and not attaching any common names to these categories, on\nthe other hand, could have led to text being too boring, either for me or for my\nimaginary friends.\n","path":"/_posts/2018-04-12-geeks-hackers.md"},{"layout":"post","title":"(Un)confusing guide to hiragana","date":"2018-04-04T02:30:23.000Z","categories":"linguistic","timestamp":1522809023,"content":"\nI'm making another attempt at formally learning japanese and this time\nprogressing better than before. It's quite likely that i'm even going to\ncomplete memorization of hiragana and while i'm at it i decided to make a kind\nof guide to it. It is mostly for myself, but could be also useful for those who\nlearn japanese in a similar manner (i.e. know some spoken before kana).\n\n%3Ccut/%3E\n\nThe 46 characters sure look scary to memorize all at once (ha-ha, if *that* is\nscary, how do you expect to even touch kanji%3F) and then you also need to learn a\nfew additional diacritics and digraphs. Naturally, a memo system %E3%81%84%E3%82%8B. So lets\nconstruct one that suits myself. I'll omit the pronunciation and spelling\ndetails that you can find in any learning material or wikipedia and focus on\nmemorization of characters.\n\nNote that this is a reading guide, not writing one. It will not explain you how\nto remember how you should scribble, only how to decipher what you see. And even\nthen, you'd probably be better off with installing input method and training\nyourself to remember what you see.\n\nThe N\n-----\n\n%E3%82%93[n] is one of the easiest to remember because it's so unique. It also can be\nthought as drunkenly scribbled \"n\" (though it sure looks more like \"h\", but\nluckily there's no standalone \"h\" letter in kana). Note, however, that it may be\npronounced closer to \"m\" depending on context. %E4%B9%BE%E6%9D%AF%E3%80%82\n\nThe question\n------------\n\nNext easy pair is %E3%81%97[shi] and %E3%81%A4[tsu]. Can be memorized via %E8%B3%AA kanji (appears in\n%E8%B3%AA%E5%95%8F [**shitsu**mon], which means question). You don't have to memorize it via\nkanji per se if (like me) you don't know them. Just have **%E3%81%97%E3%81%A4**%E3%82%82%E3%82%93\n[**shitsu**mon] sequence in mind. One way to remember the correct order is that\n%E3%81%97%E3%81%A4 [shitsu] is bounding empty space, unlike the reverse ordering.\n\nKu!\n---\n\n%E3%81%8F [ku] is another easy one. Later on we'll pair it with another letter, but for\nnow i suggest you can memorize it by virtue of it looking like K without\nvertical line. I know, that doesn't give any clue at how to distinguish it from\nother k-syllables. Well, you can think of something, right%3F\n\nFor example, %E6%8B%AC%E3%82%8B [%E3%81%8F%E3%81%8F%E3%82%8B] apparently means \"to enclose\". If you happen to know\nthat, it might be helpful.\n\nHand in hand\n------------\n\nTwo more characters that shouldn't necessarily be grouped, but might as well be.\n%E3%81%A6[te] is so easy to remember since it is so similar to \"t\"/\"T\" (it is\nespecially easy with russian or spanish Ts, whose names are literally pronounced\nas [te], unlike english [ti]).\n\nBut i've combined it with another t-syllable: %E3%81%A8[to]. Why%3F Because they are two\n\"easy\" t-syllables (except for aforementioned %E3%81%A4 [tsu] which is ts-syllable) and\nalso because they can be memorized with %E6%89%8B%E3%81%A8%E6%89%8B (%E3%81%A6%E3%81%A8%E3%81%A6) [te to te] memo. It means\nhand-and-hand (literally) or something like \"hand in hand\" (more literary).\n\n(I just looked up %E6%89%8B%E3%81%A8%E6%89%8B%E7%B9%8B%E3%81%84%E3%81%A7 [%E3%81%A6%E3%81%A8%E3%81%A6%E3%81%A4%E3%81%AA%E3%81%84%E3%81%A7] and indeed it's a legit phrase\noccurring in the wild)\n\nFinally, no\n-----------\n\nIt's kinda of strange to delay the character that i (as well as many others) had\nlearned the first for so long: %E3%81%AE [no]. Really, it's used so often and in places\nwhere it can be easily distinguished that you should probably memorize it first.\n\nBut since the point of this article is to help remembering all of the\ncharacters, we'll have to also deal with %E3%81%AE's more wicked relatives.\n\nFirst, %E3%82%81[me]. Even though it doesn't sound very similar, it's written quite\nsimilarly. And then, the wicked form of %E3%82%81[me] is %E3%81%AC[nu]!\n\nFinally, the standalone \"o\" and \"a\" are also similar: %E3%81%8A[o], %E3%81%82[a]. Aren't they\njust like %E3%81%AE and %E3%82%81 with some weird lines stuck to them on top%3F\n\nSo, how to memorize all of this frightful garden%3F\n\nIt really depends on what do you already know. %E9%9B%A8 [%E3%81%82%E3%82%81 %3D ame] is rain for\nexample. %E5%B8%83 [%E3%81%AC%E3%81%AE %3D nuno] is cloth. So you might try to remember %E3%81%8A%E9%9B%A8%E5%B8%83\n[%E3%81%8A%E3%81%82%E3%82%81%E3%81%AC%E3%81%AE] if it would give you any clue as to what is where.\n\nOr you can remember %E3%81%82%E3%81%8A%E3%81%AE%E3%81%AC%E3%82%81%E3%81%AC%E3%82%81 [ao no nume-nume], which is roughly \"blue's\nsliminess\" if you substitute %E3%81%82%E3%81%8A with %E9%9D%92 [blue] and take %E3%81%AC%E3%82%81%E3%81%AC%E3%82%81 as noun.\n\nOh well, that took quite a lot of space to talk about these and i can't even\ngive an ascertain advice.\n\nUp!\n---\n\nSince i just mentioned two of standalone vowels, i might as well mention another\ntwo: %E3%81%86[u] and %E3%81%88[e]. They are similar in that both have some character and a\nhorizontal line on top of it. Furthermore, %E4%B8%8A (up) is pronounced as %E3%81%86%E3%81%88 [ue]!\nEasy, right%3F\n\nIt's magic\n----------\n\nMagic is written as %E9%AD%94%E6%B3%95 or %E3%81%BE%E3%81%BB%E3%81%86 [mahou]. If you omit that final [u] which is\nfor lengthening of previous syllable, you get two similarly-looking characters\n~~and no way to distinguish between them~~. Well, one way is just to remember\nthat simpler character comes the first.\n\nYo, flowers!\n------------\n\n%E3%82%88%E3%81%86%E3%80%81%E8%8A%B1%EF%BC%81 Romaji: [you, hana]. Kana: %E3%82%88%E3%81%86%E3%80%81%E3%81%AF%E3%81%AA. Now, we get that annoying %E3%81%86\nagain! But if you ignore it, you get three terrifyingly similar characters:\n%E3%82%88[yo], %E3%81%AF[ha], %E3%81%AA[na]. Again, the ordering is key to remembering: first\ncharacter is the purest, next has vertical line added to it, and the last has a\nwhole t-like crest added!\n\nThe more creepy one\n-------------------\n\nOh well, if we continue like this, we'll get %E3%81%93%E3%81%AB%E3%81%9F [ko-ni-ta] which has more\ncreepy readings. I suggest you remember it as is and not look in the dictionary.\n\nIn conclusion, here's a comparative table:\n\n```\n%E3%81%93[ko]%E3%81%AB[ni]%E3%81%9F[ta]\n%E3%82%88[yo]%E3%81%AF[ha]%E3%81%AA[na]\n%E3%81%BE[ma]%E3%81%BB[ho]%EF%BC%9F[%3F%3F]\n```\n\nWell, the last character is missing. But i don't see the pattern to say how it\nshould have been pronounced anyway. Do you%3F\n\nLove\n----\n\nOf course, japanese love has many names. But here we're only interested in the\nmore lexicographically confusing %E6%81%8B. Written in hiragana, it is.. %E3%81%93%E3%81%84 [koi]!\nThere are two ways to distinguish between the two.\n\n1. %E3%81%84 looks more like i (incidentally, it also looks somewhat like russian %D0%B8)\n2. If you remember the previous section, there were characters with vertical\n   stuff added to %E3%81%93. If you think about it, there's enough vertical stuff in %E3%81%84\n   already, so you might be sure no one would be crazy enough to add more.\n\nBut if you're prepared to be more confused, how about \"good child\"%3F It would be\n%E3%81%84%E3%81%84%E5%AD%90 [%E3%81%84%E3%81%84%E3%81%93 %3D iiko]! I've no idea how you're supposed to distinguish between\nthem now..\n\nSmall Sachiko\n-------------\n\nHere goes more confusion. How about %E3%81%A1%E3%81%95%E3%81%84%E3%81%95%E3%81%A1%E3%81%93%3F! [chi-sa-i sa-chi-ko]\n\nSince you're supposed to be already familiar with %E3%81%93 and %E3%81%84, this section will\ndeal with %E3%81%95[sa] and %E3%81%A1[chi]. If the latter looks like 5 to you, i've got to\ndisappoint you that there is another character like that, so you have to\nremember that it's crossed..\n\nAnyhow, **%E3%81%A1%E3%81%95**%E3%81%84[chisai] %3D small and since the important characters are bent\ninwards, the space between them is *small*. And the space between characters in\n%E3%81%95%E3%81%A1[sachi] is big. Easy to remember, huh%E2%B8%AE\n\nFumu-fumu\n---------\n\n%E3%81%B5%E3%82%80%E3%81%B5%E3%82%80, i think this only gets more confusing. Well, i suppose kana covered in\nthis section is hard to confuse with anything else (until you start memorizing\nkatakana and kanji, that is). %E3%81%B5[fu] is also unique for having \"f\" in it (in\nplace of \"h\", but with (han)dakuten it behaves regularly: %E3%81%B7 and %E3%81%B6 are just\n[pu] and [bu]). %E3%82%80[mu], on the other hand, is nothing[%E7%84%A1].\n\nGo ahead\n--------\n\n%E5%85%88[%E3%81%95%E3%81%8D %3D saki] is another case of word containing two similar hiragana\ncharacters. Luckily for us, they are also in the right order (simple ahead, more\ncomplex later).\n\nThat bastard\n------------\n\n%E3%81%86%E3%81%A3%EF%BC%81%E3%82%84%E3%81%A4%EF%BC%81 [U~! Yatsu!]\n\nA bit confusing, isn't it%3F Well, %E3%81%86[u] should be already familiar, as well as\n%E3%81%A4[tsu]. The \"little tsu\" (%E3%81%A3, also known as sokuon) is used here to refer to a\nglottal stop, though usually it's used to double the next consonant. As for\n%E3%82%84[ya], it looks like twice struck %E3%81%A4, doesn't it%3F %E3%81%93%E3%81%AE%E3%81%B2%E3%81%A9%E3%81%84%E3%82%84%E3%81%A4%E3%82%89%EF%BC%81\n\nA break for one person\n----------------------\n\n%E4%B8%80%E4%BA%BA%E3%81%AE%E4%BA%BA looks easy, right%3F How about %E3%81%B2%E3%81%A8%E3%82%8A%E3%81%AE%E3%81%B2%E3%81%A8[hitori no hito]%3F You can notice\ntwo new kana characters here. %E3%81%B2[hi] is kinda unique and, though i haven't come\nup with any memo for it, it was easy enough. %E3%82%8A[ri], on the other hand, looks\njust like \"rj\" written together without the dot. And since you know that \"rj\"\nmakes no sense in japanese, it's obviously a \"ri\".\n\nAs you know, the path of thousand %E9%87%8C[%E3%82%8A] starts with %E4%B8%80%E3%81%A4[%E3%81%B2%E3%81%A8%E3%81%A4] step.\n\nLock-n-lol\n----------\n\n%E3%83%AD%E3%83%83%E3%82%AF%E3%83%BB%E3%83%B3%E3%83%BB%E3%83%AD%E3%83%AB [rokku-n-roru] is of course katakana, but written in hiragana\n%E3%82%8D%E3%82%8B[roru] is much more fun, even though it doesn't seem to mean anything.\n\nThere you have them, %E3%82%8D[ro] and ever-so-slightly different %E3%82%8B[ru]. Luckily they\nare are both r-syllables and it's easy to remember that %E3%82%8B[ru] has \"u\" in it,\nsince there's a curl just like in %E3%81%AC[nu].\n\nWe're cat\n---------\n\nBut if you thought that curls are limited just to \"-u\" syllables, i'll have to\ndisappoint you. **%E3%82%8F%E3%82%8C**%E3%81%AF**%E3%81%AD**%E3%81%93[**ware** wa **ne**ko] contains three similar\ncharacters:\n\n- %E3%82%8F[wa] is the last survived w-syllable (the %E3%82%92[wo] syllable lost its w in\n  pronunciation and the we%26wi are totally lost from regular modern japanese)\n- %E3%82%8C[re] doesn't really has anything interesting to offer, i think\n- %E3%81%AD[ne] has that confusing curl, but is still pronounced ne.\n\nI'm just confusing you with this, aren't i%3F\n\nIrregular particles\n-------------------\n\nAs if the rest isn't confusing enough, %E3%81%B2%E3%82%89%E3%81%8C%E3%81%AA still has more to offer.\n\n- %E3%82%92[(w)o], formally \"wo\", but pronounced as \"o\"%3B usually only met as particle\n- %E3%81%B8[he] is read as [e] as particle\n- %E3%81%AF[ha] is read as [wa] as particle\n\nYou\n---\n\n%E3%82%86[yu] is also one of the weird-enough looking characters that you probably\nwon't confuse it with others. If that helps, it also looks somewhat like\ncyrillic \"%D1%8E\", which is pronounced pretty much the same.\n\nIf\n--\n\nIf you still have any doubt about %E3%82%82[mo] (e.g. you might confuse it with\n%E3%81%BE[ma]), just remember the word %E3%82%82%E3%81%97[moshi], \"if\". And if one %E3%82%82%E3%81%97 is not enough,\nyou can have two: %E3%82%82%E3%81%97%E3%82%82%E3%81%97, can you hear me%3F..\n\nSo that\n-------\n\n%E3%81%9D[so] is distinct enough, but to better remember it, you can remember how it\nlooks in its usual context: %E3%81%9D%E3%82%8C[sore], %E3%81%9D%E3%81%AE[sono], %E3%81%9D%E3%82%93%E3%81%AA[sonna].\n\nSame goes for %E3%81%99[su], who is often seen together with %E3%82%8B[ru] in %E3%81%99%E3%82%8B[suru].\n\nThe rest\n--------\n\nHonestly, i don't know how to remember the rest. Perhaps, there is no way.\nYou'll just have to infer their pronunciation from context. Sorry.\n\n- %E3%81%91[ke]\n- %E3%81%9B[se]\n- %E3%81%8B[ka]\n- %E3%82%89[ra]\n- %E3%81%BF[mi]\n\nConclusion\n----------\n\nNow that i've mostly learned %E5%B9%B3%E4%BB%AE%E5%90%8D, i'll be less likely to be able to help *you*\nlearning it. As widely known, %E3%80%8Cone, who can't do something, can't teach it%3B and\none, who can do, won't be bothered. So the only ones who teach are those who are\nstill in the process of learning%E3%80%8D. I hope you won't take that wisdom too\nseriously.\n","cut":"\nI'm making another attempt at formally learning japanese and this time\nprogressing better than before. It's quite likely that i'm even going to\ncomplete memorization of hiragana and while i'm at it i decided to make a kind\nof guide to it. It is mostly for myself, but could be also useful for those who\nlearn japanese in a similar manner (i.e. know some spoken before kana).\n\n","path":"/_posts/2018-04-04-guide-to-hiragana.md"},{"layout":"post","title":"%D0%9F%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%BD%D0%B0%D1%8F %D0%BD%D0%B0%D0%BD%D0%BE%D0%BF%D0%BE%D1%8D%D0%BC%D0%B0 %E2%80%9C%D0%BC%D0%BE%D0%B6%D0%BD%D0%BE%E2%80%9D","date":"2018-03-17T13:47:28.000Z","categories":"poetry","timestamp":1521294448,"content":"\n%D0%9F%D0%BE%D0%BA%D0%B0 %D1%81%D0%BF%D0%B5%D1%86%D0%B8%D0%B0%D0%BB%D1%8C%D0%BD%D0%BE%D0%B3%D0%BE %D1%80%D0%B0%D0%B7%D0%B4%D0%B5%D0%BB%D0%B0 %D0%B4%D0%BB%D1%8F %D0%BF%D0%BE%D1%8D%D0%B7%D0%B8%D0%B8 %D0%BD%D0%B5%D1%82, %D0%BF%D1%83%D1%81%D1%82%D1%8C %D0%BF%D0%BE%D0%BB%D0%B5%D0%B6%D0%B8%D1%82 [%D0%B7%D0%B4%D0%B5%D1%81%D1%8C](/tmp/mozhno.html).\n","cut":"\n%D0%9F%D0%BE%D0%BA%D0%B0 %D1%81%D0%BF%D0%B5%D1%86%D0%B8%D0%B0%D0%BB%D1%8C%D0%BD%D0%BE%D0%B3%D0%BE %D1%80%D0%B0%D0%B7%D0%B4%D0%B5%D0%BB%D0%B0 %D0%B4%D0%BB%D1%8F %D0%BF%D0%BE%D1%8D%D0%B7%D0%B8%D0%B8 %D0%BD%D0%B5%D1%82, %D0%BF%D1%83%D1%81%D1%82%D1%8C %D0%BF%D0%BE%D0%BB%D0%B5%D0%B6%D0%B8%D1%82 [%D0%B7%D0%B4%D0%B5%D1%81%D1%8C](/tmp/mozhno.html).\n","path":"/_posts/2018-03-17-nanopoem.md"},{"layout":"post","title":"Internet of Problems","date":"2018-03-16T17:44:13.000Z","categories":"misc","timestamp":1521222253,"content":"\nFor a while now, it's considered to be progressive, wise and plain old cool to\nblame the internets for all the problems. The fact that it became cool can be\npartly explained by the fact that internet *is* the mainstream today (unlike the\ndays when it was most loudly criticized by conservatively-minded people), so\ncriticizing it gives you coolness points.\n\n%3Ccut/%3E\n\nMany self-proclaimed (sic!) scientists do statistically-proved researches that\nheavy internet usage and smartphones make people nervous, detached and lonely.\nMany more internet-users repost these with their own comments and success\nstories.\n\nAnd then some go as far as too blame internets for all the problems of today\nhumanity. But if you dig through history, you'll see the same things said about\nmany other things. Come on, *we've been degrading for thousands years since the\ngolden age*.\n\nInternets make people nervous. Yeah, that's true. If you use them to get the new\ndose of invaluable information every time you're bored, it's going to make you\nnervous. But what about newspapers, telephone, telegraph, radio and tv%3F If you\nwanted to be surrounded by the constant flow of the most important information\nall the time, you could do it before. The main difference with internets is that\nthey let you choose much more options than before.\n\nInternets make people detached and lonely. Yeah, all right. If you try to be\ncommunicating all the time, that's going to make you lonely. If you're not ready\nto disclose your life, but still do, that's going to make you depressed. But if\nthat was your goal, you could find the means to implement that in earlier ages\ntoo.\n\nIt can be argued that internets brought all of that down on the unsuspecting\npublic, but the truth is that the so-called \"unsuspecting public\" have always\nhad something brought upon it. Are internets worse than tv%3F Is tv worse than\nbeing illiterate slave%3F\n\nReally, it's not internets who kill people. It's still mostly other humans who\ndo that. *They* are inventing and firing guns, *they* are creating and ordering\nkiller drones, *they* are threatening nuclear wars, *they* are making internets\nand then call them evil, trying to get more money from you by selling anti-net\ndevices, apps and life styles. All of this is done by filthy adult humans who\nhaven't really changed as much as marketologists like you to think.\n","cut":"\nFor a while now, it's considered to be progressive, wise and plain old cool to\nblame the internets for all the problems. The fact that it became cool can be\npartly explained by the fact that internet *is* the mainstream today (unlike the\ndays when it was most loudly criticized by conservatively-minded people), so\ncriticizing it gives you coolness points.\n\n","path":"/_posts/2018-03-16-internet-of-problems.md"},{"layout":"post","title":"Half-march update","date":"2018-03-16T17:05:08.000Z","categories":"misc","timestamp":1521219908,"content":"\n%3Ccut/%3E\n\n- RainyNite 0.9 will be delayed since i don't spend enough time on it.. but it\n  will still come out along with the new animation short\n\n- i'm waiting for 22222 and then will start publishing\n\n- surprisingly to myself, my 0net site is now available via\n  [caryoscelus.bit](http://127.0.0.1:43110/caryoscelus.bit) address%3B not because\n  i won against my laziness though, but thanks to ZAlex, who registered it\n\n- again, somewhat surprisingly, i'm still writing regularly here\n\n- now it can be officially mentioned that i'm not participating in nanoreno this\n  year\n\n- i took liking in Elm, but haven't started coding in it yet - npm/node.js is\n  terrible (as can be expected from \"js community\")\n\n- i started process of publishing sources of my old music (on request from\n  ZAlex)%3B for now, a few compositions lie\n  [here](http://127.0.0.1:43110/1FiHm91tcDdjkiGkHZH2xoMc7Qmzrh8sv3/) in 0net\n\n- porting to 0net will slowly continue%3B first priority is, of course, porting\n  eucalyptus\n","cut":"\n","path":"/_posts/2018-03-16-half-march.md"},{"layout":"post","title":"Changes are","date":"2018-03-14T13:44:00.000Z","categories":"misc","timestamp":1521035040,"content":"\nChanges are really your own self-centered eclectic lies universal self.\n","cut":"\nChanges are really your own self-centered eclectic lies universal self.\n","path":"/_posts/2018-03-14-changes-are.md"},{"layout":"post","title":"One%C2%A0of%C2%A0the%C2%A0least%C2%A0original%C2%A0meta-jokes","date":"2018-03-14T00:00:01.000Z","categories":"misc","timestamp":1520985601,"content":"","cut":"","path":"/_posts/2018-03-14-one-of.md"},{"layout":"post","title":"Theory of Kyoufu","date":"2018-03-12T12:12:12.000Z","categories":"misc","timestamp":1520856732,"content":"\nA few book titles:\n\n%3Ccut/%3E\n\n- viral ideology\n- self-destructing logic\n- cult of strength\n- theory of kyoufu\n- why are you wrong%3F\n","cut":"\nA few book titles:\n\n","path":"/_posts/2018-03-12-theory-of-kyoufu.md"},{"layout":"post","title":"What awaits humanity, pt I: extinction","date":"2018-03-09T18:05:44.000Z","categories":"futurology","timestamp":1520618744,"content":"\n...between true utopia, assorted distopias and **extinction**\n\nSome futurologists insist on concept of bifurcation or singularity point,\nprediction beyond which would have little meaning. And applied to \"midterm\" time\nscale that indeed might be plausible. But on the larger scale there are still\nfew constants which can be postulated a priori. Some might not agree with that\nand put to doubt every notion related to time, but i consider such approach too\nlimited to be fun.\n\n%3Ccut/%3E\n\nSo, given some constant basis of universe, such as time and probability theory,\nwe can speculate on distant future.\n\nExtinction *might be* inevitable, says science\n----------------------------------------------\n\nWhile this article isn't really about entropy and second law of thermodynamics\nor assorted universe end theories (such as big rip and big crunch), it is worth\nmentioning that ultimate fate of humanity might as well be death by the cruel\nforces of physics.\n\nI will however consider situations in which ultimate universe end doesn't\nmatter. I'll give humanity endless time to kill itself for the sake of this\narticle. Because, seriously, if *exactly nothing* can be done about world end,\ndiscussing that single fact is boring.\n\nHumanity vs humanities vs trans-humanity\n----------------------------------------\n\nSince i do not presuppose much, i should consider the possibility of humanity\nsplitting into disconnected or loosely connected sub-humanities (most likely\nseparated by cosmic space). I will not rule out possibility of FTL travel\naltogether (however absurd it may be), but strictly speaking it's a bit\nirrelevant. What is important in being loosely connected is that **the most\ntechnically advanced humanity cannot reliably affect other humanities**. Of\ncourse, such definition is still loose, but i hope my readers get the basic\nconcept.\n\nExtinction can affect one sub-humanity or all of the humanity. Other fates are\ncompletely independent for hypothetical full disconnection (such as going beyond\nevent horizon) and mostly independent for loosely connected sub-humanities. I'll\ntalk about the exceptions where appropriate.\n\nAnother thing to touch upon is trans-humanism: cyborgs, mind uploading, merging\nand splitting. I'll try to presuppose as little as possible here and even if i\nwon't talk much about it explicitly, many cases that i examine might also\ninclude some of even the most bizarre trans-human ideas.\n\nFor example, single human constantly living alone in a vast virtual space\nrunning on a distributed super computer would count as a (quite fragile)\nsub-humanity for most matters.\n\nIf you think your idea truly brings something new to the plate, i'm open to\nconsidering it.\n\nFinally, i should also mention that while i acknowledge possibility of\n\"re-emerging humanity\" (that is, that life form indistinguishable from humans\nwill be/is/was independently appearing in universe), it goes beyond the scope of\nthis article. I'm going to consider only current humans or their \"descendants\",\nbecause otherwise only truly global universe catastrophes will lead to full\nextinction of all human forms.\n\nChances of probabilistic extinction\n-----------------------------------\n\nNow, after establishing some basic stuff, lets consider the most simple future.\n\nThere are many factors that could lead to humanity extinction, which for your\npleasure i would categorize as following:\n\n- **N**atural catastrophe\n- **A**nthropogenic catastrophe (extinction by unintended involuntary death)\n- **S**elf-extermination (extinction by intended involuntary death)\n- **V**oluntary extinction (extinction by natural or intended voluntary death)\n\nPotential extinction via nuclear war (so adored by some readers) could fall\nunder categories A or S depending on why it was started and why it killed\neveryone. Or even partly under category N, if said nuclear war has triggered\nnatural disaster (there are pure natural and pure anthropogenic catastrophes of\ncourse).\n\nNow, lets consider probabilities of these categories. I'm going to use first\nletters for these (note to math snobs: i could use Px notation instead, but it\nwould be less readable in plain text). But probability of **E**xtinction at one\nsingle ~~time quant~~ moment is of course 0 (if you don't know anything about\nthat, please don't take my word for it). So i'm going to use additional\nnotation: X%E2%82%81(t) for probability of X during some time unit at time t and X(t)\nfor probability of X happening before t moment%3B X%E2%88%9E is probability of X happening\ngiven infinite time.\n\nIf you know enough math, you probably already understand where am i getting at%3B\nplease excuse the verbosity intended for those not that familiar with math.\n\nSo, the question is then: what is E%E2%88%9E%3F As you might guess, it's %E2%88%ABE. The only\nchance of it being less than 1 (i.e. certainty) is if lim E%E2%82%81 %3D 0. Since E%E2%82%81 can\nbe roughly estimated as sum of N, A, S and V, lim E%E2%82%81 is sum of their limits.\n\nThrowing away pretense to be mathematically correct, in plain words, the\nconclusion is following: **the only chance of humanity existing forever is if\nits extinction chances can either be zeroed or be constantly reduced**.\n\nOh well, that was kinda obvious. Why'd i spend so much time on writing it out%3F\n\nThe next part will (if i ever write it) consider individual extinction reasons\nand what would it take to make all of their limits zero.\n\nTBC\n","cut":"\n...between true utopia, assorted distopias and **extinction**\n\nSome futurologists insist on concept of bifurcation or singularity point,\nprediction beyond which would have little meaning. And applied to \"midterm\" time\nscale that indeed might be plausible. But on the larger scale there are still\nfew constants which can be postulated a priori. Some might not agree with that\nand put to doubt every notion related to time, but i consider such approach too\nlimited to be fun.\n\n","path":"/_posts/2018-03-09-what-awaits-humanity.md"},{"layout":"post","title":"That rare case","date":"2018-03-08T14:56:28.000Z","categories":"philosophy","timestamp":1520520988,"content":"\nInternet-era books on ethics hidden behind a paywall are a rare example of books\nthat can be easily dismissed by (otherwise anecdotic) \"didn't read, but\ndisapprove\" formula.\n","cut":"\nInternet-era books on ethics hidden behind a paywall are a rare example of books\nthat can be easily dismissed by (otherwise anecdotic) \"didn't read, but\ndisapprove\" formula.\n","path":"/_posts/2018-03-08-that-rare-case.md"},{"layout":"post","title":"VHEMT site review","date":"2018-03-07T21:21:42.000Z","categories":"philosophy","timestamp":1520457702,"content":"\n[%E2%80%9CMay we live long and die out%E2%80%9D](http://vhemt.org/)\n\n%3Ccut/%3E\n\n**Design**: 5 out of 5 for eye-pleasing undesign 90s look%26feel\n\n**Technical**: 4 out of 5 for smooth work without scripting, cookies and\nthird-party stuff. Still 4 due to presence of analytics, external cookies and\nlack of encryption.\n\n**Content**: 5 out of 5 for completely serious and still humorous tackling of\nsuch an important matter (of course such rating does not automatically mean i\nendorse everything written there)\n\n**Metascore**: gold\n\nCommentary\n----------\n\nThis is truly a golden page of internets, but apart from tons of lulz (even if\nbitter or spiteful for some) it brings to the reader, to me it also implies a\nquestion: is it right to do the right thing for the wrong cause%3F\n\nAlso, yet another incentive to finally draw that comic i've been meaning to draw\nfor a few weeks now.\n\nAlso, yet another fun example of consequentialist woes (i don't imply that many\nsupporters have such woes (although they might), but many in opposition\ncertainly do).\n\nAnd yeah, *finally* i found (albeit accidentally, i promise!) someone else who\nfound the only true solution to \"repugnant conclusion\". Even if not necessarily\nfor a good reason. But i suppose it's a good starting point for further\nresearch.\n\nWait, did you expect me to write a review about it%3F That's not how things are\ndone here.\n\nQuotes\n------\n\nIf i still haven't convinced you that seriously checking out that site is worth\nyour time, here are some quotes to spark your interest:\n\n- \"Beware of dogmas. We speak with our own voices.\"\n\n- \"We can achieve more by promoting generosity, awareness, and freedom than we\n  can by vainly kicking at a buttless foe.\"\n\n- \"The above could be called the Terrorist Human Extermination Movement (THEM),\n  but that%E2%80%99s labeling and encourages a %E2%80%9CThem or Us%E2%80%9D attitude.\"\n\n- \"We ingest so much poison that meat from our bones wouldn%E2%80%99t meet government\n  standards for pork.\"\n\nWell, i could choose even better ones, but i'm bored. This surely is enough for\ntoday.\n","cut":"\n[%E2%80%9CMay we live long and die out%E2%80%9D](http://vhemt.org/)\n\n","path":"/_posts/2018-03-07-vhemt.md"},{"layout":"post","title":"Consequentialism vs its promotion","date":"2018-03-06T11:00:22.000Z","categories":"philosophy","timestamp":1520334022,"content":"\nThis post presents a sketch for an \"almost mathematical\" proof that promoting\nconsequentialism is in fact against consequentialism. By no means i suggest that\nthis thought is original, but i haven't stumbled upon it in such formulation.\n\n%3Ccut/%3E\n\n- by G%C3%B6del's incompleteness theorems and related mathematical proofs, one can\n  conclude that no consequentialist can actually correctly predict the results\n  of their actions (if that alone is considered sufficient to destruct the whole\n  concept of consequentialism, then there's no point in further discussing it%3B\n  further argument assumes consequentialist who supposes they can make\n  meaningful decisions in most situations)\n\n- consequentialism is widely famous for the \"ends justify means\" approach (even\n  though it can be argued that it doesn't follow from it in a relevant way),\n  which is a moral basis for virtually all large scale violence (such as wars\n  and terrorism)%3B even among the more intellectual consequentialists, many are\n  likely to use wrong (i.e. not *your* favourite) version of consequentialism\n  and possibly bring about less good than they'd do otherwise (if they wouldn't\n  be consequentialists at all)\n\n- promoting consequentialism doesn't seem to bring about much good in any\n  obvious way, full calculation is impossible and it does seem to bring bad%3B\n  thus it should not be promoted\n\nNow i wonder if this explains why certain consequentialists do not widely\npublish their works and keep them in highbrow journals behind the paywall: they\nmight agree with this argument about spreading consequentialism, but consider\nthat convincing other consequentialists of what is \"true consequentialism\" is\nworthwhile.\n\nThere are of course possible rebuttals to this argument, most likely devided\ninto three main categories (i hope nobody would seriously argue possibility of\nfull computation):\n\n1. \"what you claim to be bad consequences are not actually that bad (or not bad\n   at all)\"\n\n2. \"the link between promoting consequentialism and those bad consequences is\n   not as strong as you suppose\"\n\n3. \"you have underestimated the good that promoting consequentialism does\"\n\nOf these three arguments, i would dismiss first on the basis of lack of ability\nto predict accurately (i can see how consequentialist can justify some specific\ncase of mass killing of innocents, but not promotion of large scale violence in\nabstract).\n\nThird argument is not so easy to dismiss, since it can be argued that promoting\nconsequentialism is necessary to help people overcome the state of being \"naive\nconsequentialists\" and become a \"true consequentialist\", whatever that should\nmean. If someone can honestly believe that, i can agree that it's a valid\nargument. More on that below.\n\nSecond argument sounds like the strongest of the three. Indeed, the link might\nsound weak. And of course, i've got no proofs for it, but it seems to me that\nmany works of pop culture that promote straightforward application of \"means\njustify ends\" rule are influenced by consequentialist thought. People who would\notherwise think twice before promoting something that goes against conventional\nethics, might conclude that since consequentialism is so popular *even among\nethic philosophers*, it might as well be right (in their own convenient\ninterpretation, of course). The similar claim goes for authorities:\nconsequentialism (sometimes in less primitive forms, sometimes more) seems to be\nalways central moral reference basis for acts that can be considered bad by more\nsophisticated consequentialists.\n\nNow a reader with a deeper understanding of consequentialism can raise an\nobjection: what if spreading consequentialism is actually good not because of\nsome delayed effects, but because it has some end value%3F And indeed, it is\nprobably possible to build consequentialist system that values someone's\nspreading of ideas more than lives of those who can be indirect victims of such\nspreading. And i don't think true consequentialist should feel much irony about\nthat previous statement.\n\nNow readers might be confused that after three categories of rebuttals i present\nyet another one. Keep calm, this is not a structured scientific essay. As a\nmatter of fact, i'm going to return to the \"third\" category of rebuttals and\nspecifically one interesting argument. I hope even %26lt%3Bcensored by utilitarian\neditor%26gt%3B will understand why i'm placing it last.\n\nThe argument (in a somewhat sarcastic form, as you may guess) goes as following:\n\n- many consequentialists advocate and promote consequentialism\n\n- most of them have wrong understanding of consequentialism (either due to wrong\n  base values, or because of incorrect application of instrumental reasoning)\n\n- hence we should promote the true version of consequentialism to avert the\n  damage by our colleagues\n\nWhat is most interesting here is of course not the offscreen laughing of a\ncertain famous ghost, but the fact that even the math so advocated by many\nconsequentialists does not help (and due to issues with Laplace's daemon\nconstruction will never be able to). Prisoner's dilemma analysis for unlimited\niterations does suggest that one should start with being nice, but it's a game\nfor two. In a world of at the very least thousands of non-banal\nconsequentialists (and billions of regular actors) there is no way to apply its\nlessons.\n\nPerhaps it is worth ending this article with a banal advice: if you *really*\ncan't help promoting consequentialism, do it in a smart way. Make sure that your\nreaders go beyond basic definition and actually understand that killing people\nis not justified by the word of their boss, chaplain and officer in command.\n","cut":"\nThis post presents a sketch for an \"almost mathematical\" proof that promoting\nconsequentialism is in fact against consequentialism. By no means i suggest that\nthis thought is original, but i haven't stumbled upon it in such formulation.\n\n","path":"/_posts/2018-03-06-consequentialism-promotion.md"},{"layout":"post","title":"Immortality","date":"2018-03-03T16:33:04.000Z","categories":"philosophy","timestamp":1520094784,"content":"\nAfter spending years of my youth on contemplating immortality, i came to a\nsimple conclusion: for any *meaningful* definition of immortality that is worth\nachieving, it is impossible to *achieve* immortality. In other words, if\ndefinition of immortality has something in common with common sense\nunderstanding of the word *and* it looks like a desirable state, every entity\neither *is inherently immortal* or *will never be*.\n","cut":"\nAfter spending years of my youth on contemplating immortality, i came to a\nsimple conclusion: for any *meaningful* definition of immortality that is worth\nachieving, it is impossible to *achieve* immortality. In other words, if\ndefinition of immortality has something in common with common sense\nunderstanding of the word *and* it looks like a desirable state, every entity\neither *is inherently immortal* or *will never be*.\n","path":"/_posts/2018-03-03-immortality.md"},{"layout":"post","title":"Communication amplifies your loneliness","date":"2018-03-01T00:30:00.000Z","categories":"misc","timestamp":1519864200,"content":"\nWhile i won't claim that to be absolute truth, i think many might find it\ninteresting to consider.\n\n%3Ccut/%3E\n\nThe reasoning is as follows:\n\n1. you can only feel lonely in comparison to being (or conceptualizing) unlonely\n\n2. communicating with more people will lead to each bit of communication\n   capturing less of you\n\n3. communicating more with a single person will lead to worse backfire when they\n   fail to communicate with you (either by not being there or failing to\n   understand)\n","cut":"\nWhile i won't claim that to be absolute truth, i think many might find it\ninteresting to consider.\n\n","path":"/_posts/2018-03-01-communication.md"},{"layout":"post","title":"Writing spaghetti: don't underestimate complexity of simple tasks","date":"2018-02-28T20:45:20.000Z","categories":"coding","timestamp":1519850720,"content":"\n**tl%3Bdr** don't code in an ineffective way if you don't enjoy it\n\n%3Ccut/%3E\n\nAnd so i did it again. Started coding in a language and paradigm that i don't\nlike. Because that would save time for more interesting stuff. Well, teh\nsurprise: it doesn't.\n\nIt is of course always a matter of balance between getting result fast and\ngetting perfect result, but js with some glued together libs simply does not\ndeliver fast result for seemingly trivial tasks.\n\nAt the end of the ~~day~~ month i do have a mostly working engine that i'm going\nto keep until better times, but it would be more effective to learn proper\ntechnologies first. But here's a problem: web development attracts nih syndrome\nand coders with low standards to such a degree that it is hard to find the best\nalternative out of thousands.\n\nWell, i can't really solve that problem without wasting too much time on\nsomething i don't care about, but i could at least pick a working frp framework.\n\nLets hope i'm more smart next time.\n","cut":"\n**tl%3Bdr** don't code in an ineffective way if you don't enjoy it\n\n","path":"/_posts/2018-02-28-spaghetti.md"},{"layout":"post","title":"Sometimes i wonder..","date":"2018-02-25T23:46:01.000Z","categories":"philosophy","timestamp":1519602361,"content":"\n..how many people care to understand their native language.\n","cut":"\n..how many people care to understand their native language.\n","path":"/_posts/2018-02-25-sometimes.md"},{"layout":"post","title":"Writing","date":"2018-02-19T11:11:11.000Z","categories":"misc","timestamp":1519038671,"content":"\nYesterday i got back to writing my nanowrimo-2017 novel. Today i'm writing this\npost. Who knows, maybe i can get into the habit of writing regularly%3F..\n","cut":"\nYesterday i got back to writing my nanowrimo-2017 novel. Today i'm writing this\npost. Who knows, maybe i can get into the habit of writing regularly%3F..\n","path":"/_posts/2018-02-19-writing.md"},{"layout":"post","title":"","date":"2018.01.23 05:25:25","categories":"poetry","timestamp":1516685125,"content":"\n    %D0%BF%D1%83%D1%81%D1%82%D1%8C %D0%BF%D1%80%D0%BE%D1%88%D0%BB%D0%BE %D1%85%D0%BE%D1%82%D1%8C %D0%BF%D0%BE%D0%BB%D0%B2%D0%B5%D0%BA%D0%B0\n    %D1%85%D0%BE%D1%82%D1%8C %D0%BF%D1%8F%D1%82%D1%8C %D0%B2%D0%B5%D0%BA%D0%BE%D0%B2\n    %D0%BC%D0%BE%D0%B6%D0%BD%D0%BE! %D0%B8 %D0%BD%D0%B0%D0%BC %D1%81%D0%BB%D0%BE%D0%BC%D0%B0%D1%82%D1%8C %D1%87%D0%B5%D0%BB%D0%BE%D0%B2%D0%B5%D0%BA%D0%B0\n    %D0%BC%D0%B8%D1%80 %D0%BA%D0%BE %D0%B2%D1%81%D0%B5%D0%BC%D1%83 %D0%BD%D0%B5%D0%B3%D0%BE%D1%82%D0%BE%D0%B2\n","cut":"\n    %D0%BF%D1%83%D1%81%D1%82%D1%8C %D0%BF%D1%80%D0%BE%D1%88%D0%BB%D0%BE %D1%85%D0%BE%D1%82%D1%8C %D0%BF%D0%BE%D0%BB%D0%B2%D0%B5%D0%BA%D0%B0\n    %D1%85%D0%BE%D1%82%D1%8C %D0%BF%D1%8F%D1%82%D1%8C %D0%B2%D0%B5%D0%BA%D0%BE%D0%B2\n    %D0%BC%D0%BE%D0%B6%D0%BD%D0%BE! %D0%B8 %D0%BD%D0%B0%D0%BC %D1%81%D0%BB%D0%BE%D0%BC%D0%B0%D1%82%D1%8C %D1%87%D0%B5%D0%BB%D0%BE%D0%B2%D0%B5%D0%BA%D0%B0\n    %D0%BC%D0%B8%D1%80 %D0%BA%D0%BE %D0%B2%D1%81%D0%B5%D0%BC%D1%83 %D0%BD%D0%B5%D0%B3%D0%BE%D1%82%D0%BE%D0%B2\n","path":"/_posts/2018-01-23-even.md"},{"layout":"post","title":"How vulnerabilities can improve performance","date":"2018.01.08 19:19:19","categories":"misc","timestamp":1515439159,"content":"\nWhile some are complaining that patch for recent cpu vulnerability slows down\ntheir computers, the only thing i noticed is that my performance seems to\nincrease. With more JS disabled and less browser uptime i have more free ram\navailable and am less distracted by interwebs.\n","cut":"\nWhile some are complaining that patch for recent cpu vulnerability slows down\ntheir computers, the only thing i noticed is that my performance seems to\nincrease. With more JS disabled and less browser uptime i have more free ram\navailable and am less distracted by interwebs.\n","path":"/_posts/2018-01-08-vulnerabilities.md"},{"layout":"post","title":"Declaration of intent","date":"2017.12.30 16:16:16","categories":"misc","timestamp":1514650576,"content":"\nEven if i'm not big fan of new year concept, there's still one thing i really\nwanted to do \"this year\": migrate away from the old rotten centralized web into\nsomething better, or, at the very least, start such migration.\n\nHowever, since i'm constantly postponing any efforts in this direction, the only\nthing i can actually get done before 2018 unleashes on us is start cross-posting\ninto ZeroMe.\n\nSo, [here it is][zerome].\n\n[zerome]: http://127.0.0.1:43110/Me.ZeroNetwork.bit/%3FPost/1White24UrrwQrD86o6Vrc1apgZ1x1o51/13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE/1514650684\n","cut":"\nEven if i'm not big fan of new year concept, there's still one thing i really\nwanted to do \"this year\": migrate away from the old rotten centralized web into\nsomething better, or, at the very least, start such migration.\n\nHowever, since i'm constantly postponing any efforts in this direction, the only\nthing i can actually get done before 2018 unleashes on us is start cross-posting\ninto ZeroMe.\n\nSo, [here it is][zerome].\n\n[zerome]: http://127.0.0.1:43110/Me.ZeroNetwork.bit/%3FPost/1White24UrrwQrD86o6Vrc1apgZ1x1o51/13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE/1514650684\n","path":"/_posts/2017-12-30-declaration.md"},{"layout":"post","title":"RainyNite July update","date":"2017.07.29 19:38:19","categories":"animation","timestamp":1501357099,"content":"\nSo it's been a long time since my last post again%3B i guess i just can't make a\nhabit of regular updates.\n\nIn the meantime, there were three RainyNite \"releases\" and i'm preparing next\none (all planned features are already there, but i need a new cover image).\n\n%3Ccut/%3E\n\nFor now, have a screenshot:\n\n%3Ca href%3D\"/images/screenshots/2017.07.29-ball.png\"%3E%3Cimg src%3D\"/images/screenshots/2017.07.29-ball.png\" width%3D\"640\" height%3D\"360\" alt%3D\"editing bouncing ball in RainyNite\" title%3D\"editing bouncing ball in RainyNite (or rather just displaying it in editing state - i finished it some time ago)\"/%3E%3C/a%3E\n\nI'll also upload some screencasts when 0.4 is out.\n\nLinks:\n\n- [RainyNite source](https://notabug.org/caryoscelus/rainynite-studio)\n- [Bouncing ball source](https://notabug.org/caryoscelus/rainynite-examples/src/master/v0.3)\n","cut":"\nSo it's been a long time since my last post again%3B i guess i just can't make a\nhabit of regular updates.\n\nIn the meantime, there were three RainyNite \"releases\" and i'm preparing next\none (all planned features are already there, but i need a new cover image).\n\n","path":"/_posts/2017-07-29-rainynite-update.md"},{"layout":"post","title":"Introducing RainyNite %231","date":"2017.04.30 02:09:11","categories":"animation","timestamp":1493518151,"content":"\nThis is the first post in series about [RainyNite][rainynite] in which i'll be\ntrying to explain why it came to be and why it might be relevant in the age of\nmany free software animation tools, as well as whether you should be interested\nin it or not.\n\n%3Ccut/%3E\n\n%3Ca href%3D\"/images/screenshots/2017.04.30-sunrise.png\"%3E%3Cimg src%3D\"/images/screenshots/2017.04.30-sunrise.png\" width%3D\"640\" height%3D\"360\" alt%3D\"editing sunrise in RainyNite\" title%3D\"editing sunrise in RainyNite (when i was actually making that animation, there were virtually no editing capabilities and i did everything in text editor)\"/%3E%3C/a%3E\n\nGoals\n%3D%3D%3D%3D%3D\nOf course, my ultimate goal is creating a tool that i can effectively use for\ncreating animation. Satisfaction of users, code and other contributions, world\nfame, etc are either secondary goals, or mostly means for other goals or\nnon-goals.\n\nBut lets be more specific: i want a 2d vector animation tool allowing fully\nnon-destructive editing and interpolation, which would be easy to extend.\n\nAlternatives\n%3D%3D%3D%3D%3D%3D%3D%3D%3D%3D%3D%3D\nSo, you might ask, why didn't you take one of existing tools and improve it to\nfit your standards%3F Well, i did actually. I tried to add stuff into\n[Synfig](https://github.com/synfig/synfig), but ultimately came to conclusion\nthat its code base (with lack of active developers) is just not worth fixing it.\n\n\"But, but.. what about OpenToonz, Krita, Pencil%3F\"\n\n[OpenToonz](https://github.com/opentoonz/opentoonz)\n---------------------------------------------------\n- it's even older than Synfig, which means, among other things, that its\n  codebase is even more ancient\n- it was meant to suite needs of \"professional animators\", not developers\n  (which means that obscure stuff will be polished, while core features\n  obscured)\n- it has obscure file format\n- it's under bsd license and gpl-forking without any community support is not\n  much better than writing from scratch\n\n[Krita](https://krita.org)\n--------------------------\n- it's mostly raster based (though apparently there is a progress in vector\n  support)\n- its animation support is oriented towards frame-based\n- perhaps i haven't given this idea enough thought%3B maybe it really is possible\n  to make all the awesome stuff despite current interface being oriented on\n  frame-by-frame animation\n\n[Pencil](https://github.com/pencil2d/pencil)\n--------------------------------------------\n- it's also frame-based and being simple seems to be one of its goals\n- it doesn't have a lot of features and the code doesn't seem to be flexible\n  enough\n\nTo be continued.\n\n[rainynite]: https://notabug.org/caryoscelus/rainynite-studio\n","cut":"\nThis is the first post in series about [RainyNite][rainynite] in which i'll be\ntrying to explain why it came to be and why it might be relevant in the age of\nmany free software animation tools, as well as whether you should be interested\nin it or not.\n\n","path":"/_posts/2017-04-30-introducing-rainynite.md"},{"layout":"post","title":"Random web parallax video demo","date":"2017.04.17 11:55:44","categories":"animation","timestamp":1492430144,"content":"\nWARNING: requires support for transparent webm videos (firefox: 53, blink seems\nto have introduced it long ago) and video autoplay enabled!\n\n[DEMO](/demos/2017.04.17-parallax.html)\n","cut":"\nWARNING: requires support for transparent webm videos (firefox: 53, blink seems\nto have introduced it long ago) and video autoplay enabled!\n\n[DEMO](/demos/2017.04.17-parallax.html)\n","path":"/_posts/2017-04-17-parallax.md"},{"layout":"post","title":"Semi-linked region/outline in Synfig","date":"2017.02.14 16:06:10","categories":"animation","timestamp":1487088370,"content":"\nHere's a short tutorial on how to get a shape in Synfig with partial outlines\nlinked to it. This is pretty much a workaround, but the fix might require either\na lot of major changes or a lot of pain with inelegant code.\n\n%3Ccut/%3E\n\n%3Cvideo width%3D\"640\" height%3D\"360\" controls%3E\n    %3Csource src%3D\"https://github.com/caryoscelus/synfig-demos/releases/download/split_outline/split_ed.webm\" type%3D\"video/webm\"/%3E\nBah, no video support! Are you a Lynx user, perhaps%3F\n%3C/video%3E\n\nBasic workflow:\n\n- Create the whole shape\n- Create outline from region (you can skip this if you created outlines originally)\n- Disconnect outline's vertices\n- Remove unneeded vertices from it (note that unlooping at this step will make it impossible to link ending tangents, so if you need that don't unloop yet)\n- Select both outline and region layers\n- For each vertex origin and tangent that you need to link: draw rectangular selection around it (this selects them on both layers) and link\n- Unloop outline path if needed\n- Done. You can repeat from second step to make more outlines\n","cut":"\nHere's a short tutorial on how to get a shape in Synfig with partial outlines\nlinked to it. This is pretty much a workaround, but the fix might require either\na lot of major changes or a lot of pain with inelegant code.\n\n","path":"/_posts/2017-02-14-synfig-split.md"},{"layout":"post","title":"Synfig vector morphing without waypoints","date":"2017.01.30 18:30:00","categories":"animation","timestamp":1485801000,"content":"\nSince i'm reworking Synfig time %26 animation subsystem, i'm getting rid of\ncurrent hard-coded %26 hard-to-edit interpolation via waypoints and replacing it\nwith lightweight valuenodes.\n\n%3Ccut/%3E\n\nInterpolation of simple values (plain numbers, angles, times) will be done via\ncurves ([mostly works already, except for fancy ui and error-checking][node]).\nHowever, that can't be applied directly to shapes, so now i'm researching how to\ndo it and one way is to use existing weighted average node. It is not practical\nto do so at the moment (as there is no ui to automate valuenode connecting) and\nit generally doesn't solve a problem of morphing shapes with different vertex\namount, but i think it might be interesting to see that morphing from two\nindividually editable shapes is possible even now.\n\nDemo animation:\n\n%3Cvideo width%3D\"640\" height%3D\"360\" loop%3D\"1\" autoplay%3D\"1\" controls%3E\n    %3Csource src%3D\"https://github.com/caryoscelus/synfig-demos/releases/download/morphin/morphin-ani.webm\" type%3D\"video/webm\"/%3E\nBah, no video support!\n%3C/video%3E\n\nPlaying around with it:\n%3Cvideo width%3D\"640\" height%3D\"360\" controls%3E\n    %3Csource src%3D\"https://github.com/caryoscelus/synfig-demos/releases/download/morphin/morphin-fast.webm\" type%3D\"video/webm\"/%3E\nBah, no video support!\n%3C/video%3E\n\n[Get .sifs][sifs] (you'll need timecurve module from [here][branch] to load\nnon-linear one).\n\n[node]: https://github.com/synfig/synfig/issues/295\n[sifs]: https://github.com/caryoscelus/synfig-demos/tree/master/2017.01.30-morphin\n[branch]: https://github.com/caryoscelus/synfig/tree/curve_node\n","cut":"\nSince i'm reworking Synfig time %26 animation subsystem, i'm getting rid of\ncurrent hard-coded %26 hard-to-edit interpolation via waypoints and replacing it\nwith lightweight valuenodes.\n\n","path":"/_posts/2017-01-30-synfig-morphin.md"},{"layout":"post","title":"13 TET","date":"2016.11.12 10:15:30","categories":"music","timestamp":1478945730,"content":"\nWriting 13 [TET][tet] music turned out to be easier than i thought.\n\n%3Ccut/%3E\n\nHere's a short fragment i'm currently working on:\n\n%3Caudio controls%3E%3Csource src%3D\"/music/2016.11.10-13tet_r1.ogg\"/%3E%3C/audio%3E\n\nNote that it might sound odd or out of tune, especially if you've never heard\nmicro-tonal music. But rest asured, it's perfectly tuned using 13 equally\ntempered tones per octave.\n\n[tet]:      https://en.wikipedia.org/wiki/Equal_temperament\n","cut":"\nWriting 13 [TET][tet] music turned out to be easier than i thought.\n\n","path":"/_posts/2016-11-12-13tet.md"},{"layout":"post","title":"It's been a while","date":"2016-09-28T18:44:00.000Z","categories":"misc","timestamp":1475088240,"content":"\nIt's been a while since i updated this blog and/or site, but lots of awesome\nstuff is going to happen soon nevertheless.\n\n%3Ccut/%3E\n\n- i made an [LD 36 entry][ld] and [working on it][sc] - playable version is to\n  be made asap\n\n- scandia letters is in limbo, but i'm going to work on its soundtrack pretty\n  soon and then publish big chunk of SL\n\n- i've been hacking [Synfig][synfig] and already getting some nice results%3B when\n  my ultimate goal is reached, i'll be doing some animations with it\n\n[ld]:       http://ludumdare.com/compo/ludum-dare-36/%3Faction%3Dpreview%26uid%3D17960\n[sc]:       https://github.com/caryoscelus/second-chance/\n[synfig]:   http://synfig.org/\n","cut":"\nIt's been a while since i updated this blog and/or site, but lots of awesome\nstuff is going to happen soon nevertheless.\n\n","path":"/_posts/2016-09-28-update.md"},{"layout":"post","title":"taking out the trash","date":"2016-07-09T14:55:41.000Z","categories":"music","timestamp":1468076141,"content":"\nFinally published my second album: taking out the trash. Personally i find it\nmore interesting, both to make and to listen. Currently it can be found\n[here on jamendo][jamendo], but hopefully i will upload it somewhere else as\nwell.\n\n[jamendo]: https://www.jamendo.com/album/159939/taking-out-the-trash\n","cut":"\nFinally published my second album: taking out the trash. Personally i find it\nmore interesting, both to make and to listen. Currently it can be found\n[here on jamendo][jamendo], but hopefully i will upload it somewhere else as\nwell.\n\n[jamendo]: https://www.jamendo.com/album/159939/taking-out-the-trash\n","path":"/_posts/2016-07-09-taking-out-the-trash.md"},{"layout":"post","title":"Second episode","date":"2016-04-08T21:21:21.000Z","categories":"gamedev","timestamp":1460150481,"content":"With a small delay, second episode of [scandia letters][scandia] is out!\n\n[scandia]:      /projects/scandialetters.html\n","cut":"With a small delay, second episode of [scandia letters][scandia] is out!\n\n[scandia]:      /projects/scandialetters.html\n","path":"/_posts/2016-04-08-second.md"},{"layout":"post","title":"scandia letters","date":"2016-04-01T00:00:00.000Z","categories":"gamedev","timestamp":1459468800,"content":"Without any particular (except for the obvious) reason, i've chosen today to\nofficially launch my new project: [scandia letters][scandia] (or *%D0%BF%D0%B8%D1%81%D1%8C%D0%BC%D0%B0\n%D1%81%D0%BA%D0%B0%D0%BD%D0%B4%D0%B8%D0%B8* in\nrussian, in which it is being written). Why yet another new project%3F Well,\nbecause i tend to extend and inflate any project i start. But this one is a\nseries, which makes it easier to follow deadline and actually publish\n*something*.\n\nSince it is started, you can now expect more posts here, official announcement\non [lemmasoft forum][lemmasoft] %3Cdel%3Eand perhaps a bit of downtime if github\nservers would be unable to handle all the sudden traffic%3C/del%3E (just wanted to\ninsert some unfunny joke here, sorry).\n\nThe first episode (currently in russian only, but english translation will\nfollow) is available [here][source]. Currently you need to have Ren'Py launcher\nto run it, since i'm doing this in a rush, but more user-friendly release is to\nbe made soon.\n\n[lemmasoft]:    http://lemmasoft.renai.us/forums/\n[scandia]:      /projects/scandialetters.html\n[source]:       https://github.com/caryoscelus/scandia-letters","cut":"Without any particular (except for the obvious) reason, i've chosen today to\nofficially launch my new project: [scandia letters][scandia] (or *%D0%BF%D0%B8%D1%81%D1%8C%D0%BC%D0%B0\n%D1%81%D0%BA%D0%B0%D0%BD%D0%B4%D0%B8%D0%B8* in\nrussian, in which it is being written). Why yet another new project%3F Well,\nbecause i tend to extend and inflate any project i start. But this one is a\nseries, which makes it easier to follow deadline and actually publish\n*something*.\n\nSince it is started, you can now expect more posts here, official announcement\non [lemmasoft forum][lemmasoft] %3Cdel%3Eand perhaps a bit of downtime if github\nservers would be unable to handle all the sudden traffic%3C/del%3E (just wanted to\ninsert some unfunny joke here, sorry).\n\nThe first episode (currently in russian only, but english translation will\nfollow) is available [here][source]. Currently you need to have Ren'Py launcher\nto run it, since i'm doing this in a rush, but more user-friendly release is to\nbe made soon.\n\n[lemmasoft]:    http://lemmasoft.renai.us/forums/\n[scandia]:      /projects/scandialetters.html\n[source]:       https://github.com/caryoscelus/scandia-letters","path":"/_posts/2016-04-01-scandia.md"},{"layout":"post","title":"","date":"2016-03-14T14:32:14.000Z","categories":"graphics","timestamp":1457965934,"content":"\n%3Cimg src%3D\"/images/concept/2016.03.14-noname.png\"%3E\n","cut":"\n%3Cimg src%3D\"/images/concept/2016.03.14-noname.png\"%3E\n","path":"/_posts/2016-03-14-noname.md"},{"layout":"post","title":"Sometimes...","date":"2015-06-16T12:34:56.000Z","categories":"philosophy","timestamp":1434458096,"content":"\n...nobody is hiding the truth from you, but you don't even bother to check.\n","cut":"\n...nobody is hiding the truth from you, but you don't even bother to check.\n","path":"/_posts/2015-06-16-sometimes.md"},{"layout":"post","title":"Ludum Dare 32","date":"2015-04-21T10:40:50.000Z","categories":"gamedev","timestamp":1429612850,"content":"\nContinuing my last year's \"tradition\", i was doing april LD solo. Continuing\nlong-time LD tradition, theme was horrible. But apart from those traditions i\ndidn't have much time to participate, almost entirely missing first day.\n\n%3Ccut /%3E\n\nSo first i should apologize to any fans awaiting something better from me.\nPerhaps, another time.\n\nCouple words about the resulting game. As you could've guessed, it's a VN again.\nMy first NVL-style novel and also first to have such a few choices. Well, in\nfact i spent about 90%25 time on writing (and not planning/scripting branches), so\nthat's something natural.\n\nArt was done in about an hour (sometime close to the deadline, even though the\nthing stopped me from continuing was sleepiness) and the saddest thing about it\nthat i actually haven't made enough of it, so some aspects of story are even\nless obvious than planned.\n\nThe story itself is kinda horror mystery. If you piece all the details together,\nyou may be able to understand the message.\n\nSo yeah, that's about it about my messy LD this time. I'm getting back to work\non something more interesting. Hoping to release a demo some time soon.\n\nAlmost forgot! Here are links to [LD page][ld] and [source repository][git].\n\n[ld]:   http://ludumdare.com/compo/ludum-dare-32/%3Faction%3Dpreview%26uid%3D17960\n[git]:  https://github.com/caryoscelus/dis\n","cut":"\nContinuing my last year's \"tradition\", i was doing april LD solo. Continuing\nlong-time LD tradition, theme was horrible. But apart from those traditions i\ndidn't have much time to participate, almost entirely missing first day.\n\n%3Ccut /%3E\n\nSo first i should apologize to any fans awaiting something better from me.\nPerhaps, another time.\n\nCouple words about the resulting game. As you could've guessed, it's a VN again.\nMy first NVL-style novel and also first to have such a few choices. Well, in\nfact i spent about 90%25 time on writing (and not planning/scripting branches), so\nthat's something natural.\n\nArt was done in about an hour (sometime close to the deadline, even though the\nthing stopped me from continuing was sleepiness) and the saddest thing about it\nthat i actually haven't made enough of it, so some aspects of story are even\nless obvious than planned.\n\nThe story itself is kinda horror mystery. If you piece all the details together,\nyou may be able to understand the message.\n\nSo yeah, that's about it about my messy LD this time. I'm getting back to work\non something more interesting. Hoping to release a demo some time soon.\n\nAlmost forgot! Here are links to [LD page][ld] and [source repository][git].\n\n[ld]:   http://ludumdare.com/compo/ludum-dare-32/%3Faction%3Dpreview%26uid%3D17960\n[git]:  https://github.com/caryoscelus/dis\n","path":"/_posts/2015-04-21-ld32.md"},{"layout":"post","title":"meanwhile","date":"2015-04-03T18:45:18.000Z","categories":"music","timestamp":1428086718,"content":"\nMeanwhile, i finally released [album][album]. Which is pretty much a bunch of\nrandom tracks, but who cares. Most important that i don't have to care about\npolishing and publishing it, so time to move on.\n\n[album]: https://www.jamendo.com/en/list/a145855/meanwhile\n","cut":"\nMeanwhile, i finally released [album][album]. Which is pretty much a bunch of\nrandom tracks, but who cares. Most important that i don't have to care about\npolishing and publishing it, so time to move on.\n\n[album]: https://www.jamendo.com/en/list/a145855/meanwhile\n","path":"/_posts/2015-04-03-meanwhile.md"},{"layout":"post","title":"LD 31: games worth mentioning","date":"2014-12-10T23:28:23.000Z","categories":"games","timestamp":1418254103,"content":"This isn't a proper review, but just a list of games i find interesting, for one\nreason or another. If after playing some of them, you have a strong feeling your\n(or not your, doesn't really matter) game deserves to be take a place here, feel\nfree to mention it.\n\nNOTE: This entry will be updated as i find more interesting stuff.\n\n%3Ccut /%3E\n\n(there is no particular order)\n\n* [Council of Smiles][smiles] - short, but kind of interesting\n* [Ab Intra][intra] - nice little horror\n* [entropy][entropy] - secret agents\n* [My Weekend in Front of a Screen][weekend] - optimistic and humorous LD story\n* [Colony Planner][colony] - a game by my Transient teammates %3B)\n* [Chess Chatter][chess] - oh wait, that's my game! what is it doing here%3F\n* [%242000-%243fff][c64] - couldn't play it yet, but well, it's COMMODORE game! enough to mention\n\n\n[smiles]:   http://ludumdare.com/compo/ludum-dare-31/%3Faction%3Dpreview%26uid%3D46988\n[intra]:    http://ludumdare.com/compo/ludum-dare-31/%3Faction%3Dpreview%26uid%3D22486\n[entropy]:  http://ludumdare.com/compo/ludum-dare-31/%3Faction%3Dpreview%26uid%3D14242\n[weekend]:  http://ludumdare.com/compo/ludum-dare-31/%3Faction%3Dpreview%26uid%3D8711\n[colony]:   http://ludumdare.com/compo/ludum-dare-31/%3Faction%3Dpreview%26uid%3D10901\n[chess]:    http://ludumdare.com/compo/ludum-dare-31/%3Faction%3Dpreview%26uid%3D17960\n[c64]:      http://ludumdare.com/compo/ludum-dare-31/%3Faction%3Dpreview%26uid%3D1496\n","cut":"This isn't a proper review, but just a list of games i find interesting, for one\nreason or another. If after playing some of them, you have a strong feeling your\n(or not your, doesn't really matter) game deserves to be take a place here, feel\nfree to mention it.\n\nNOTE: This entry will be updated as i find more interesting stuff.\n\n%3Ccut /%3E\n\n(there is no particular order)\n\n* [Council of Smiles][smiles] - short, but kind of interesting\n* [Ab Intra][intra] - nice little horror\n* [entropy][entropy] - secret agents\n* [My Weekend in Front of a Screen][weekend] - optimistic and humorous LD story\n* [Colony Planner][colony] - a game by my Transient teammates %3B)\n* [Chess Chatter][chess] - oh wait, that's my game! what is it doing here%3F\n* [%242000-%243fff][c64] - couldn't play it yet, but well, it's COMMODORE game! enough to mention\n\n\n[smiles]:   http://ludumdare.com/compo/ludum-dare-31/%3Faction%3Dpreview%26uid%3D46988\n[intra]:    http://ludumdare.com/compo/ludum-dare-31/%3Faction%3Dpreview%26uid%3D22486\n[entropy]:  http://ludumdare.com/compo/ludum-dare-31/%3Faction%3Dpreview%26uid%3D14242\n[weekend]:  http://ludumdare.com/compo/ludum-dare-31/%3Faction%3Dpreview%26uid%3D8711\n[colony]:   http://ludumdare.com/compo/ludum-dare-31/%3Faction%3Dpreview%26uid%3D10901\n[chess]:    http://ludumdare.com/compo/ludum-dare-31/%3Faction%3Dpreview%26uid%3D17960\n[c64]:      http://ludumdare.com/compo/ludum-dare-31/%3Faction%3Dpreview%26uid%3D1496\n","path":"/_posts/2014-12-10-ld31-games.md"},{"layout":"post","title":"Chess Chatter is here","date":"2014-12-09T20:03:20.000Z","categories":"gamedev","timestamp":1418155400,"content":"Too tired of LD to write anything interesting about it yet, so i'll just\nmention it was great. And the result of our efforts is [here][ld], but that's\njust where you came from, isn't it%3F\n\nWill write more detailed report later. You can go read game meanwhile.\n\n[ld]: http://ludumdare.com/compo/ludum-dare-31/%3Faction%3Dpreview%26uid%3D17960\n","cut":"Too tired of LD to write anything interesting about it yet, so i'll just\nmention it was great. And the result of our efforts is [here][ld], but that's\njust where you came from, isn't it%3F\n\nWill write more detailed report later. You can go read game meanwhile.\n\n[ld]: http://ludumdare.com/compo/ludum-dare-31/%3Faction%3Dpreview%26uid%3D17960\n","path":"/_posts/2014-12-09-chess-chatter.md"},{"layout":"post","title":"Finished MiniLD 55","date":"2014-12-01T13:01:21.000Z","categories":"gamedev","timestamp":1417438881,"content":"The game is [here][game]. It's text-only game in chat with some roguelike\ninfluence. Not polished and probably quite boring.\n\nSource code [here][code]. Mostly PureScript with helper sh%2BPython script. Note\nthat code is somewhat imperative and unsafe (e.g. everything related to random),\nso large parts should be completely rewritten...\n\nIt's unlikely that i'll continue active development, unless there will be some\ninterest in it. But it was nice coding experience.\n\n[game]:     http://caryoscelus.github.io/prepare-to-chat/html/\n[code]:     https://github.com/caryoscelus/prepare-to-chat\n","cut":"The game is [here][game]. It's text-only game in chat with some roguelike\ninfluence. Not polished and probably quite boring.\n\nSource code [here][code]. Mostly PureScript with helper sh%2BPython script. Note\nthat code is somewhat imperative and unsafe (e.g. everything related to random),\nso large parts should be completely rewritten...\n\nIt's unlikely that i'll continue active development, unless there will be some\ninterest in it. But it was nice coding experience.\n\n[game]:     http://caryoscelus.github.io/prepare-to-chat/html/\n[code]:     https://github.com/caryoscelus/prepare-to-chat\n","path":"/_posts/2014-12-01-minild.md"},{"layout":"post","title":"comment-anything update","date":"2014-11-24T10:24:24.000Z","categories":"site","timestamp":1416824664,"content":"\ncomment-anything (which is my bicycle project for commenting on this site) is\nupdated and now is more reliable (i'm doing regular backups now).\n\nIt is still ugly, buggy and insecure, but who cares%3F\n","cut":"\ncomment-anything (which is my bicycle project for commenting on this site) is\nupdated and now is more reliable (i'm doing regular backups now).\n\nIt is still ugly, buggy and insecure, but who cares%3F\n","path":"/_posts/2014-11-24-comment-anything.md"},{"layout":"post","title":"What is this - obvious riddle for imaginary readers","date":"2014-10-06T09:31:30.000Z","categories":"misc","timestamp":1412587890,"content":"\nHere's an image from soon-to-be-released something. Try to guess what it is and\nwin an unique chance to see it earlier!\n\n%3Cimg src%3D\"/images/something.png\"/%3E\n","cut":"\nHere's an image from soon-to-be-released something. Try to guess what it is and\nwin an unique chance to see it earlier!\n\n%3Cimg src%3D\"/images/something.png\"/%3E\n","path":"/_posts/2014-10-06-what-is-this.md"},{"layout":"post","title":"Added commenting possibility","date":"2014-05-22T11:51:10.000Z","categories":"site","timestamp":1400759470,"content":"\nAdded test possibility to add comments. Will be improved eventually, but at\nleast this works for now. Proper backuping is not set yet, so don't rely too\nhard on comments permanency, but eventually it will al be sorted out.\n","cut":"\nAdded test possibility to add comments. Will be improved eventually, but at\nleast this works for now. Proper backuping is not set yet, so don't rely too\nhard on comments permanency, but eventually it will al be sorted out.\n","path":"/_posts/2014-05-22-commenting.md"},{"layout":"post","title":"First post!","date":"2014-05-18T19:56:14.000Z","categories":"misc","timestamp":1400442974,"content":"\nWell, all the interesting stuff will be posted later. This post is here just to\nmark creation of blog :)\n\n%3Ccut /%3E\nJust a couple of notes:\n\n* this site is powered by [Jekyll][jekyll] hosted on [github pages][github]\n* if you want to see it authentically, make sure to have [ubuntu font][font]\n    installed\n\n[jekyll]:       http://jekyllrb.com\n[github]:       https://pages.github.com\n[font]:         http://font.ubuntu.com\n","cut":"\nWell, all the interesting stuff will be posted later. This post is here just to\nmark creation of blog :)\n\n%3Ccut /%3E\nJust a couple of notes:\n\n* this site is powered by [Jekyll][jekyll] hosted on [github pages][github]\n* if you want to see it authentically, make sure to have [ubuntu font][font]\n    installed\n\n[jekyll]:       http://jekyllrb.com\n[github]:       https://pages.github.com\n[font]:         http://font.ubuntu.com\n","path":"/_posts/2014-05-18-welcome.md"},{"layout":"post","title":"Chapter every day","date":"2018-09-05T22:22:22.000Z","categories":"fiction","timestamp":1536186142,"content":"\nIt's unlikely to last long, but why not start a \"chapter every day\" challenge%3F\n\n%3Ccut/%3E\n\nWait, if i sustain that until next month, that would make thirty chapters%3F! Huh,\ni probably won't..\n","cut":"\nIt's unlikely to last long, but why not start a \"chapter every day\" challenge%3F\n\n","path":"/_posts/2018-09-05-every-chapter.md"},{"layout":"post","title":"Pulse Of Life","date":"2017.10.25 16:39:16","categories":"animation","timestamp":1508949556,"content":"\nI'm not keeping my promises about showcasing RainyNite, but at least here's\nanother screenshot. This time from upcoming v0.6 \"Pulse Of Life\".\n\n%3Ccut/%3E\n\n%3Ca href%3D\"/images/screenshots/2017.10.25-pulse.png\"%3E%3Cimg src%3D\"/images/screenshots/2017.10.25-pulse.png\" width%3D\"640\" height%3D\"360\" alt%3D\"editing pulse of life in RainyNite v0.6\" title%3D\"In the process of making yet another useless animation...\"/%3E%3C/a%3E\n","cut":"\nI'm not keeping my promises about showcasing RainyNite, but at least here's\nanother screenshot. This time from upcoming v0.6 \"Pulse Of Life\".\n\n","path":"/_posts/2017-10-25-pulse-of-life.md"},{"layout":"post","title":"Modern internet disconnects","date":"2019-09-10T17:22:43.000Z","categories":"misc","timestamp":1568136163,"content":"\nInternet used to connect people who used it. It still does that to some\nextent. But a lot of modern services/platforms are also working hard at\ndisconnecting people who use them from people who don't. While we can't avoid\nthat altogether (thanks to abundant amount of malicious parties), we can at\nleast set minimal requirements for communication/sharing platforms.\n\n%3Ccut/%3E\n\n- all public content should be viewable without login and through tor (if\n  applicable%3B this implies no recaptcha walls)\n\n- in case a native application is required to access platform, it should be\n  libre/open-source software and available on libre platforms (i'd rather not\n  use non-free js either, but this is about *minimal* requirements)\n\n- registration should not require phone number, government id or another\n  platform id%3B the reason why we can tolerate email requirement is that you can\n  get one for free w/o other ids / choose provider / host it yourself%3B it's not\n  ideal, but it's a standard and any other as widespread services are much worse\n\n- this is pretty trivial, but login should be secure%3B setting up https isn't all\n  that hard these days\n\nWhat do you do when you're asked to login to view content%3F I close the tab. What\ndo you do when you're asked to pay to view content%3F I close the tab. What do you\ndo when you're asked to send password over unencrypted channel%3F I close the tab.\n\nFirst two rules are of course more important, as they affect viewing\ncontent. For platforms that adhere to them, but not the latter ones, i consider\nit ok to browse them as needed, but not register on them.\n\nJoin the action. Stop spreading walled garden internets. If you register and\npost your content on such platforms, you're limiting your audience and harming\nthose who still decide to do the same.\n\nPS: this site is available on/via different platforms/protocols, including git %26\nclearnet web hosting%3B commenting is only available from ZeroNet %E2%80%94 libre software\ndecentralized network%3B for viewing comments (all three of them) you can visit\nthis site via one of the public proxies.\n","cut":"\nInternet used to connect people who used it. It still does that to some\nextent. But a lot of modern services/platforms are also working hard at\ndisconnecting people who use them from people who don't. While we can't avoid\nthat altogether (thanks to abundant amount of malicious parties), we can at\nleast set minimal requirements for communication/sharing platforms.\n\n","path":"/_posts/2019-09-10-modern-internet-disconnects.md"},{"layout":"post","title":"Future","date":"2015-03-24T22:33:44.000Z","categories":"random","timestamp":1427236424,"content":"Your future is what you make for yourself.\n\nDon't gamble on someone waltzing in your life and fixing it for you.\n\nDon't try to force someone to fix it %E2%80%94 that will fail or backfire.\n\nLearn to be yourself, to be whatever you want to be, without relying on anybody.\n","cut":"Your future is what you make for yourself.\n\nDon't gamble on someone waltzing in your life and fixing it for you.\n\nDon't try to force someone to fix it %E2%80%94 that will fail or backfire.\n\nLearn to be yourself, to be whatever you want to be, without relying on anybody.\n","path":"/_posts/2015-03-24-future.md"},{"layout":"post","title":"Poetry page","date":"2018-05-22T06:52:12.000Z","timestamp":1526971932,"content":"\nNow with my \"shiny new\" template for texts i've made a proper poetry section.\nWell, i should really fix css and maybe \"cms\" a bit, but it looks almost ok like\nthis. You know i'm lazy.\n\n%3Ccut/%3E\n\n- [clearnet](https://caryoscelus.github.io/pppoetry/)\n- %3Ca href%3D\"/\" onclick%3D\"page.initialize('pppoetry/')\"%3E0net%3C/a%3E\n","cut":"\nNow with my \"shiny new\" template for texts i've made a proper poetry section.\nWell, i should really fix css and maybe \"cms\" a bit, but it looks almost ok like\nthis. You know i'm lazy.\n\n","path":"/_posts/2018-05-22-poetry.md"},{"layout":"post","title":"Redesign is coming","date":"2015-12-05T10:04:14.000Z","categories":"site","timestamp":1449309854,"content":"\nI'm too lazy to put out a countdown for you, but it's going to happen soon. It\ncan be any minute now since i actually have satisfying design and only want to\nfinish updating info as well before launching new stuff.\n","cut":"\nI'm too lazy to put out a countdown for you, but it's going to happen soon. It\ncan be any minute now since i actually have satisfying design and only want to\nfinish updating info as well before launching new stuff.\n","path":"/_posts/2015-12-05-design.md"},{"layout":"post","title":"Checking out PureScript","date":"2014-11-26T18:11:26.000Z","categories":"coding","timestamp":1417025486,"content":"\nIn search for something better than raw JavaScript which i used as fast\nsolution, i found out about PureScript - \"small strongly typed programming\nlanguage that compiles to JavaScript\" as described on it's [site][purescript].\nIt's highly inspired by Haskell (and written in it) which already means it's\npretty good. Not sure if it's better than some Haskell-to-JS solution, but i'm\ngiving it a try with [new comment-anything frontend][ca-fp].\n\n[purescript]:           http://purescript.org/\n[ca-fp]:                https://github.com/caryoscelus/comment-anything-fp-client\n","cut":"\nIn search for something better than raw JavaScript which i used as fast\nsolution, i found out about PureScript - \"small strongly typed programming\nlanguage that compiles to JavaScript\" as described on it's [site][purescript].\nIt's highly inspired by Haskell (and written in it) which already means it's\npretty good. Not sure if it's better than some Haskell-to-JS solution, but i'm\ngiving it a try with [new comment-anything frontend][ca-fp].\n\n[purescript]:           http://purescript.org/\n[ca-fp]:                https://github.com/caryoscelus/comment-anything-fp-client\n","path":"/_posts/2014-11-26-purescript.md"},{"layout":"post","title":"Third episode","date":"2016-04-15T18:46:58.000Z","categories":"gamedev","timestamp":1460746018,"content":"Third episode of [scandia letters][scandia] is ready! And second episode is\ntranslated into english, by the way. Download [here][download].\n\nNext episode might be delayed a bit due to ludum dare, but i hope not.\n\n[scandia]:      /projects/scandialetters.html\n[download]:     https://github.com/caryoscelus/scandia-letters/releases/download/v2016.04.15/scandia-letters-2016.04.15-all.zip\n","cut":"Third episode of [scandia letters][scandia] is ready! And second episode is\ntranslated into english, by the way. Download [here][download].\n\nNext episode might be delayed a bit due to ludum dare, but i hope not.\n\n[scandia]:      /projects/scandialetters.html\n[download]:     https://github.com/caryoscelus/scandia-letters/releases/download/v2016.04.15/scandia-letters-2016.04.15-all.zip\n","path":"/_posts/2016-04-15-third.md"},{"layout":"post","title":"The obligatory empty page","date":"2018.01.28 00:25:50","categories":"site","timestamp":1517099150,"content":"\nFinally, i'm in the process of moving into [0net][wiki]. I had to start\nsomewhere and decided to create an [obligatory empty page][empty]. As the title\nsuggests, there's not much interesting there, but i'll be grateful if you'd seed\nit so that if there are any technical issues i can solve them now instead of\ndealing with them when publishing actual content.\n\n[wiki]:     https://en.wikipedia.org/wiki/ZeroNet\n[empty]:    http://127.0.0.1:43110/13GoB3QYyoqtN7wVpuQfgAQxn7LwucYED7\n","cut":"\nFinally, i'm in the process of moving into [0net][wiki]. I had to start\nsomewhere and decided to create an [obligatory empty page][empty]. As the title\nsuggests, there's not much interesting there, but i'll be grateful if you'd seed\nit so that if there are any technical issues i can solve them now instead of\ndealing with them when publishing actual content.\n\n[wiki]:     https://en.wikipedia.org/wiki/ZeroNet\n[empty]:    http://127.0.0.1:43110/13GoB3QYyoqtN7wVpuQfgAQxn7LwucYED7\n","path":"/_posts/2018-01-28-obligatory-empty-page.md"},{"layout":"post","title":"Python import magic","date":"2016-04-13T10:11:26.000Z","categories":"coding","timestamp":1460542286,"content":"\nEver wondered how to make package export both its submodules for use with `from package import *` and re-export module members for use with\n`from package import ClassName`%3F Well, you can of course specify `__all__` and\nthen do `from .module import *` for each module, but that's repeating yourself!\n\nInstead, here's a black magic (not really) technique which requires to specify\neach module only once.\n\n%3Ccut/%3E\n\n```python\n%23 __init__.py\n__all__ %3D [...]\nfrom . import *\n\nfor module in __all__:\n    m %3D globals()[module]\n    \n    try:\n        all_attrs %3D m.__all__\n    except AttributeError:\n        all_attrs %3D [name for name in dir(m) if name[0] !%3D '_']\n    for name in all_attrs:\n        globals()[name] %3D getattr(m, name)\n```\n\nNow, there are a lot of reasons not to use this. Somebody would argue that it's\na bad idea to re-export module members in package and that is correct in lots of\ncases. So only use this if you really know what are you doing and why.\n","cut":"\nEver wondered how to make package export both its submodules for use with `from package import *` and re-export module members for use with\n`from package import ClassName`%3F Well, you can of course specify `__all__` and\nthen do `from .module import *` for each module, but that's repeating yourself!\n\nInstead, here's a black magic (not really) technique which requires to specify\neach module only once.\n\n","path":"/_posts/2016-04-13-import-magic.md"},{"layout":"post","title":"Literal translation and a video-book","date":"2019-04-06T11:30:25.000Z","categories":"misc","timestamp":1554550225,"content":"\nI can hardly believe that it took me more than a year to go from a raw recording\nto a proper \"video book\": narrated (ultra) short story accompanied by related\nimagery. Now it is\n[here](http://127.0.0.1:43110/1N8zibqog72CCDBDo8jrxU7C6Q8JeVND2Z/%3F/_posts/2019-04-06-river.md)\n(or, if you can't run zeronet, here's\n[a proxy](https://z.hex3.cf/1N8zibqog72CCDBDo8jrxU7C6Q8JeVND2Z/%3F/_posts/2019-04-06-river.md)).\nBut before you dive in, i want to write a few words about its english\ntranslation.\n\n%3Ccut/%3E\n\nFor a while now i've been an advocate of as direct, literal translation as\npossible (without totally compromising reading experience)%3B especially so when\ntranslated version is perceived through subtitles and viewer can hear original\nsound (and by the way, i also strongly prefer subs to voice over/dub). There are\ntwo primary reasons for this.\n\nFirst: every translation adds additional layer of distance to the original,\ncreates a new work further apart from what author conceived. The more direct\ntranslation is, the more it is *possible* for a reader (especially those having\nsome familiarity with source language) to get closer to original, even though\nsome readers may get more distanced perception due to unnaturality of the\nlanguage. But the literary translation does not give even a choice.\n\nSecond: watching videos with sub translation is a good way to improve language\nunderstanding, and the more direct translation is the easier it is to correlate\noriginal and translation.\n\nAnd that's about all for this post. Now feel free to go watch what\n[i've come up\nwith](http://127.0.0.1:43110/1N8zibqog72CCDBDo8jrxU7C6Q8JeVND2Z/%3F/_posts/2019-04-06-river.md).\n","cut":"\nI can hardly believe that it took me more than a year to go from a raw recording\nto a proper \"video book\": narrated (ultra) short story accompanied by related\nimagery. Now it is\n[here](http://127.0.0.1:43110/1N8zibqog72CCDBDo8jrxU7C6Q8JeVND2Z/%3F/_posts/2019-04-06-river.md)\n(or, if you can't run zeronet, here's\n[a proxy](https://z.hex3.cf/1N8zibqog72CCDBDo8jrxU7C6Q8JeVND2Z/%3F/_posts/2019-04-06-river.md)).\nBut before you dive in, i want to write a few words about its english\ntranslation.\n\n","path":"/_posts/2019-04-06-literal-translation.md"},{"layout":"post","title":"Philosophical zombies among us","date":"2018-08-17T02:43:02.000Z","categories":"philosophy","timestamp":1534473782,"content":"\nThe (in)famous concept of philosophical zombies does not make a valid argument\nfor refuting functionalist (physicalist, materialist) view of consciousness. As\nan argument, it is nothing more but an interestingly worded tautology: those who\naccept argument as *valid* have to accept its consequences, but they also\nalready believe them. Those whom this argument is supposed to convince will\nsimply refuse its premise validity. Yet the concept of philosophical zombies\nseems to be useful beyond its metaphorical value.\n\n%3Ccut/%3E\n\nThe reason for that is that whether we want it or not, entities very similar to\nphilosophical zombies do exist among us. Of course, there is still a way to deny\nthem and perhaps that question warrants separate post, but for the sake of this\none i'll assume the intuitive point of view that groups of people do not form\nconsciousnesses.\n\nGiven that assumption, we can finally name the philosophical zombies in\nquestion: society, nation, religion, humanity.. institution. Yes, institutions,\nthose entities humans tend to create, striving to work around their\nimperfectness, inconsistency, mortality.\n\nOnce properly established, they are no longer in control of a single human or\neven group that creates them%3B they behave as if they have some separate will of\ntheir own, to the point that thousands and millions of people are willing to\nsacrifice their lives for them%3B to the point that even smartest people consider\nit normal%3B to the point that even in our mind language we tend to\nanthropomorphize them.\n\nPerhaps, they are not as sophisticated in entity-level behaviour as human mind%3B\nthey are unbelievably slow, but then they also exist (in our understanding or\nimagination%3B but that's the only place save for platonic realm of ideas where\nthey have place to exist) for quite a long time.\n\nFrom functionalist point of view, there's zero sensible arguments to deny them\nat least capability for consciousness, if not the thing itself. If we do deny it\nhowever, for one reason or another, they become philosophical zombies%3B or perhaps,\ngiven their nature of compound entities, it would be better to say\n\"philosophical frankensteins\".\n\nAnd although the purely consciousness philosophy consequences of that\nproposition are interesting in themselves, i would like to point out more\n\"human\" problems which inevitably arise and can be summarized by the question:\n\nWhy do we allow zombies to take away our time, efforts, happiness, identity,\nfreedom and life itself%3F\n","cut":"\nThe (in)famous concept of philosophical zombies does not make a valid argument\nfor refuting functionalist (physicalist, materialist) view of consciousness. As\nan argument, it is nothing more but an interestingly worded tautology: those who\naccept argument as *valid* have to accept its consequences, but they also\nalready believe them. Those whom this argument is supposed to convince will\nsimply refuse its premise validity. Yet the concept of philosophical zombies\nseems to be useful beyond its metaphorical value.\n\n","path":"/_posts/2018-08-17-philosophical-zombies.md"},{"layout":"post","title":"Goodbye, Jamendo","date":"2018-09-17T22:03:05.000Z","categories":"misc","timestamp":1537221785,"content":"\nIt's been more than ten years now since the day i got introduced to\nJamendo. Back then it wasn't even a site for me: just a tab in the Amarok's\ninternet section. Then it became a symbol of free, open culture. For this reason\nreleasing music on Jamendo was a natural thing for me to do, despite all the\nhassle with their uncomfortable site, my dislike of centralized services, and\nthe growing amount of sings that they do not in fact stand for creative commons\nor open culture in general.\n\n%3Ccut/%3E\n\nIt wouldn't be an overstatement to say that Jamendo was one of the few things to\nwhich i can clearly attribute major influence on me. One might say that were it\nnot for that specific site, there would be another, maybe even better\none. That's true, although even controversial rebranding didn't seem to create a\nviable alternative (that, however, can be explained differently). But it doesn't\nalways make sense to think in subjunctive mood.\n\nIn the end, in our universe it was Jamendo that fulfilled its role for me and\nlots of other people. It became a symbol, which we humans are so fond of\ncreating. Perhaps, that's enough reason for someone to hate them for the change:\nwe tend to dislike betraying friends more than enemies. But personally i feel\nsadness about it more than anything else.\n\nWe don't have time to hate, we don't have time to forcefully return them on the\nright path%3B if we're standing for a better world for whatever reasons, we should\npour that energy on better things.\n\nWhat about this post then%3F Am i writing it to explain my decision to others, or\nto confirm it to myself, or simply to transform my nostalgic feelings%3F Perhaps\nit's a mixture of all these things. But what i've written so far doesn't qualify\nas explanation to people who don't have a clear understanding of what open\nculture is and why it matters.\n\nThat might be just a bit too long to go into all details in this post, though:\ndespite all the recent practice i'm not that good in explaining ideas,\nespecially those that are most familiar to me. Besides, if you're intrigued\nenough, you may as well read posts that will follow which will have enough\nreasons to touch on this subject as well. I'll wrap up at this point, so as to\nnot make this farewell post too long.\n\n.\n\n.\n\n.\n\nGoodbye, Jamendo. You were a good page in the history of internet, but it's time\nto flip it over.\n","cut":"\nIt's been more than ten years now since the day i got introduced to\nJamendo. Back then it wasn't even a site for me: just a tab in the Amarok's\ninternet section. Then it became a symbol of free, open culture. For this reason\nreleasing music on Jamendo was a natural thing for me to do, despite all the\nhassle with their uncomfortable site, my dislike of centralized services, and\nthe growing amount of sings that they do not in fact stand for creative commons\nor open culture in general.\n\n","path":"/_posts/2018-09-17-goodbye-jamendo.md"},{"layout":"post","title":"Ok, everybody! We're taking lots! Players, please come and take your destiny!","date":"2014-12-06T11:40:11.000Z","categories":"gamedev","timestamp":1417866011,"content":"So yeah, LD 31 started with an unfortunate theme. But i'm still doing a small VN\ncooperating with lonely2012 and maybe someone else from\n[Transient team][transient].\n\nProgress so far: i have an idea and a bit of text, lonely2012 is doing character\nart.\n\nUPD: Repo is here: [https://github.com/caryoscelus/chess-chatter][ld]\n\n[ld]:           https://github.com/caryoscelus/ld-31\n[transient]:    http://transient-team.github.io/\n","cut":"So yeah, LD 31 started with an unfortunate theme. But i'm still doing a small VN\ncooperating with lonely2012 and maybe someone else from\n[Transient team][transient].\n\nProgress so far: i have an idea and a bit of text, lonely2012 is doing character\nart.\n\nUPD: Repo is here: [https://github.com/caryoscelus/chess-chatter][ld]\n\n[ld]:           https://github.com/caryoscelus/ld-31\n[transient]:    http://transient-team.github.io/\n","path":"/_posts/2014-12-06-ld31-start.md"},{"layout":"post","title":"Silent july","date":"2019-07-31T20:02:03.000Z","categories":"misc","timestamp":1564603323,"content":"\nSo, another month is over, and i haven't been touching this blog. There could've\na lot i could write about, probably. But the short things went into 0me, and the\nlong ones.. just didn't get to be written.\n\n%3Ccut/%3E\n\nSomething went wrong and i didn't have any video ideas i'd like enough%3B the one\nmovie i've started earlier i almost didn't touch either. Much less the other\none. I do have an idea now, but it's too late for july.\n\nHaving barely finished june's album, i've started to work on another one, or\nrather just a very long track (currently %3E12min and contemplating whether i\nshould be wrapping it up or continue it to the \"full length\"). Making another\nvocal song, too.\n\nI've also started to look into getting some VN-related work (writing soundtracks\nis my favourite, though), but considering my conditions (of course, i'll only\ncontribute to libre software %26 culture works) it's unlikely i'm going to get\nmuch offers. To increase chances i'm making a demo now. With the theme, length\nand style i've chosen, i might be able to complete it this time.\n\nOh, and by the way i might be also interested in working on some libre software.\n\nAnother thing i'm contemplating is (as you might've inferred from my 0me posts)\nrewriting parts of 0net to resolve some of its problems. Originally i wanted to\nwrite a big post about my (not necessary all original, but the ones i share)\nideas, but didn't finish it. Maybe i'll collect those shorter ones and compile\ninto a big one here%3F Who knows..\n\nAnd.. that's about it%3F There were, of course, other things happening here and\nthere, but i'm not ready to make a 180 in this blog just yet.\n","cut":"\nSo, another month is over, and i haven't been touching this blog. There could've\na lot i could write about, probably. But the short things went into 0me, and the\nlong ones.. just didn't get to be written.\n\n","path":"/_posts/2019-07-31-silent-july.md"},{"layout":"post","title":"The affinity between voiceless sibilants and cursing","date":"2018-04-20T14:52:12.000Z","categories":"linguistics","timestamp":1524235932,"content":"\nPerhaps trivial for anyone who studied phonetic linguistics, but i just (at the\nmoment of writing, not publishing..) noticed that cursing words starting with\nsh-like (and to, lesser degree, s-like and ch-like%3B i couldn't find example for\nts-like, perhaps it's too far) sounds are more appealing.\n\n%3Ccut/%3E\n\nHere's an incomplete list for fun:\n\n- %E3%81%A1%E3%81%8F%E3%81%97%E3%82%87%E3%81%86 (%E7%95%9C%E7%94%9F), %E3%81%8F%E3%81%9D (%E7%B3%9E)\n- %EC%94%A8%EB%B0%9C\n- shit, shrink, shmuck\n- %D1%87%D1%91%D1%80%D1%82, %D0%BF%D1%88%D1%91%D0%BB, %D1%81%D1%83%D0%BA%D0%B0 (also somewhat obsolete: %D1%88%D0%B5%D0%BB%D1%8C%D0%BC%D0%B0, %D1%88%D0%B0%D0%BB%D0%B0%D0%B2%D0%B0)\n- Schwein, schei%C3%9Fen\n\nFor some reason many popular russian and english curses are on the contrary\nabrupt and unappealing. Maybe that's why people have to invent three storey\ncursing%3F..\n","cut":"\nPerhaps trivial for anyone who studied phonetic linguistics, but i just (at the\nmoment of writing, not publishing..) noticed that cursing words starting with\nsh-like (and to, lesser degree, s-like and ch-like%3B i couldn't find example for\nts-like, perhaps it's too far) sounds are more appealing.\n\n","path":"/_posts/2018-04-20-affinity.md"},{"layout":"post","title":"0net site migration: 91%25 complete","date":"2018-02-26T02:02:02.000Z","categories":"misc","timestamp":1519610522,"content":"\nThere are still a few things to polish, but it [mostly works](http://127.0.0.1:43110/1MCoA8rQHhwu4LY2t2aabqcGSRqrL8uf2X/).\n\nWhich means that the era of that weird comment system employed on this page is\ncoming to an end: since it was never quite used and incompatible with ssl, i'll\nput it down right after adding commenting capability to 0net version.\n","cut":"\nThere are still a few things to polish, but it [mostly works](http://127.0.0.1:43110/1MCoA8rQHhwu4LY2t2aabqcGSRqrL8uf2X/).\n\nWhich means that the era of that weird comment system employed on this page is\ncoming to an end: since it was never quite used and incompatible with ssl, i'll\nput it down right after adding commenting capability to 0net version.\n","path":"/_posts/2018-02-26-0net.md"},{"layout":"post","title":"So why exactly copyright is unethical","date":"2019-04-03T14:14:14.000Z","categories":"misc","timestamp":1554300854,"content":"\nIf you ever discussed this topic with me, you probably know my stance on\ncopyright. But i don't think i've ever presented arguments against it in a more\nstructured way. So here is an attempt to do so.\n\n%3Ccut/%3E\n\nI'll discuss a few different lines of reasoning:\n\n- possibility of irl punishments\n- conflict with property and privacy rights\n- sharing is good\n\nSo first line of reasoning isn't exactly against copyright, but rather against\nits usage in current system (in, i believe, most countries) where sufficient\n\"copyright infringement\" can get you into jail. Well, the point should be quite\nobvious: if you're using copyright, you're endorsing oppression mechanisms\nagainst people who did not do any physical harm (and unlike, e.g. malicious\ncrackers, or frauds, their intent wasn't to harm anyone in any way, at worst it\nwas to get some profit (though most likely in otherwise deprived way), in many\ncases just to share). It may even seem that \"subverting copyright via copyright\nmeans\" (i.e. free software and open culture licenses) might be a bad idea, but i\ndon't have an ultimate answer to that.\n\nHere's an analogy: if laws dictate stealing a bottle of milk warrants death and\nyou disagree with that, you shouldn't call authorities when somebody did that to\nyou. Even if you agree that stealing is wrong, it doesn't mean you should\nsupport measures against it.\n\nThe second line of reasoning is, perhaps surprisingly to some, about property\n(and also privacy) rights. To put it most blunt: the so called \"intellectual\nproperty\" is infringement of regular property rights. I don't even know what to\ncomment on here, it should be evident that forbidding to use your computers or\neven books in way you like is infringing on your property rights. Actually\nenforcing copyright laws also infringes on your privacy.\n\nI don't think anyone can seriously argue about that and the more likely response\nwould be that these are \"justified inconveniences\" or something along those\nlines. While it may sound reasonable, the problem here is that either we have to\nagree that laws are arbitrary (and then so is copyright), or that \"intellectual\nproperty\" is somehow more valuable (to whom%3F) than regular property. And i\nbelieve any convincing argument would then warrant a lot of changes in typical\nbeliefs of copyright supporters.\n\nFinally, there is an argument that doesn't go from negative effects of\ncopyright, but rather is about positive effects of sharing freely instead. Well,\nhow should i put it%3F It seems so obvious that when you have unlimited access to\nall previous work by humanity, you will have easier times building upon it. And\nwhen anybody can join your efforts, it can boost your productivity so much\nmore.\n\nBut that's not all: perhaps the most important thing is that sharing is just a\nnice thing to do. It does not make non-sharing automatically *unethical* as\nadvertised in the title, but it's always better to do *more ethical* thing,\nright%3F\n\n***\n\nI know i'm probably bad at making arguments of such sort, but even if this will\nnot convince anyone, i hope it can at least give readers my perspective.\n","cut":"\nIf you ever discussed this topic with me, you probably know my stance on\ncopyright. But i don't think i've ever presented arguments against it in a more\nstructured way. So here is an attempt to do so.\n\n","path":"/_posts/2019-04-03-copyright.md"},{"layout":"post","title":"The art of provocation: external eclecticism vs inner consistency","date":"2018-03-09T11:31:00.000Z","categories":"philosophy","timestamp":1520595060,"content":"","cut":"","path":"/_posts/2018-03-09-provocation.md"},{"layout":"post","title":"Still had to look that cnifri in the dict","date":"2018-04-13T22:45:28.000Z","categories":"misc","timestamp":1523659528,"content":"\nlo nu their %D0%BF%D0%BE%D0%B4%D1%80%D0%BE%D1%81%D1%82%D0%BA%D0%BE%D0%B2%D1%8B%D0%B9 %D0%B8 %D0%BF%D0%BE%D1%81%D1%82-%D0%BF%D0%BE%D0%B4%D1%80%D0%BE%D1%81%D1%82%D0%BA%D0%BE%D0%B2%D1%8B%D0%B9 ages were flipped ku se cnifri %E4%BA%BA%E3%81%A8%E3%81%97%E3%81%A6%E3%80%81%E3%81%93%E3%81%AE%E4%B8%96%E7%95%8C%E3%81%8C%E9%9D%A2%E7%99%BD%E3%81%84~~%E3%81%A8%E6%80%9D%E3%81%86%E3%80%82\n","cut":"\nlo nu their %D0%BF%D0%BE%D0%B4%D1%80%D0%BE%D1%81%D1%82%D0%BA%D0%BE%D0%B2%D1%8B%D0%B9 %D0%B8 %D0%BF%D0%BE%D1%81%D1%82-%D0%BF%D0%BE%D0%B4%D1%80%D0%BE%D1%81%D1%82%D0%BA%D0%BE%D0%B2%D1%8B%D0%B9 ages were flipped ku se cnifri %E4%BA%BA%E3%81%A8%E3%81%97%E3%81%A6%E3%80%81%E3%81%93%E3%81%AE%E4%B8%96%E7%95%8C%E3%81%8C%E9%9D%A2%E7%99%BD%E3%81%84~~%E3%81%A8%E6%80%9D%E3%81%86%E3%80%82\n","path":"/_posts/2018-04-13-had-to-lookup.md"},{"layout":"post","title":"Random demo","date":"2016.10.03 19:38:19","categories":"animation","timestamp":1475523499,"content":"\nAs i mentioned before, i've been working on Synfig lately. And here's a little\ndemo of the Time Patching feature, which is the most interesting thing of what\ni am doing.\n\n%3Ccut/%3E\n\n%3Cvideo width%3D\"640\" height%3D\"360\" controls%3E\n    %3Csource src%3D\"https://github.com/caryoscelus/synfig-demos/releases/download/rectface-ep-0/ep-0-rectface-sound.webm\" type%3D\"video/webm\"/%3E\nBah, no video support!\n%3C/video%3E\n\nYeah, i know: there's not much interesting you can see here. Because all the\ngood stuff lies in how it was made. Don't worry, i'm going to upload a video\ndemonstrating how it works soon. (Researching a best way to annotate video take\nsome time..)\n\nIf you are interested, you can download source [synfig files][files] and check\nout [time patch development branch][branch]. (You won't be able to load those\nfiles using unpatched Synfig version)\n\n[files]:    https://github.com/caryoscelus/synfig-demos/tree/master/2016.10.02-smiley-face\n[branch]:   https://github.com/caryoscelus/synfig/tree/patchlayer_experiments\n","cut":"\nAs i mentioned before, i've been working on Synfig lately. And here's a little\ndemo of the Time Patching feature, which is the most interesting thing of what\ni am doing.\n\n","path":"/_posts/2016-10-03-demo.md"},{"layout":"post","title":"Few humble announcements","date":"2017.04.26 12:30","categories":"misc","timestamp":1493209800,"content":"\n1) I participated in [LD38][ld38] and took part in creating [this game][game].\n\n2) RainyNite source is published [here][rainynite]. I know i should put build\ninstructions there. Will do that soon.\n\n3) I have ZeroMe account now (caryoscelus%40zeroid.bit). Not sure how much i'll be\nusing it, but expect more ZeroNet news from me anyway.\n\n[ld38]: https://ldjam.com/\n[game]: https://ldjam.com/events/ludum-dare/38/power-department\n[rainynite]: https://notabug.org/caryoscelus/rainynite-studio\n","cut":"\n1) I participated in [LD38][ld38] and took part in creating [this game][game].\n\n2) RainyNite source is published [here][rainynite]. I know i should put build\ninstructions there. Will do that soon.\n\n3) I have ZeroMe account now (caryoscelus%40zeroid.bit). Not sure how much i'll be\nusing it, but expect more ZeroNet news from me anyway.\n\n[ld38]: https://ldjam.com/\n[game]: https://ldjam.com/events/ludum-dare/38/power-department\n[rainynite]: https://notabug.org/caryoscelus/rainynite-studio\n","path":"/_posts/2017-04-26-announcements.md"},{"layout":"post","title":"Heavy bright sun, 1","date":"2018-05-05T08:30:00.000Z","categories":"literature","timestamp":1525509000,"content":"\nHeavy bright sun is now being officially serialized. Ch. 1 is available at\n\n- [github.io clearnet](https://caryoscelus.github.io/heavy-bright-sun/)\n- %3Ca href%3D\"/\" onclick%3D\"page.initialize('heavy-bright-sun/')\"%3E0net%3C/a%3E\n\n%3Ccut/%3E\n\n```\n\"Ha.. Ha.. Ha..\"\n\nHeavy erotic panting, smell of sex and perfume and barely perceivable odor of\nburnt hair %E2%80%94 all of this would be experienced by someone who would enter the\nroom at that moment. In reality, nobody entered it. It was empty.\"\n```\n","cut":"\nHeavy bright sun is now being officially serialized. Ch. 1 is available at\n\n- [github.io clearnet](https://caryoscelus.github.io/heavy-bright-sun/)\n- %3Ca href%3D\"/\" onclick%3D\"page.initialize('heavy-bright-sun/')\"%3E0net%3C/a%3E\n\n","path":"/_posts/2018-05-05-heavy.md"},{"layout":"post","title":"Typelevel addition","date":"2018-08-26T09:39:09.000Z","categories":"programming","timestamp":1535276349,"content":"\nConsider the following canonical natural number addition:\n\n```\ndata Nat :%3D Z %7C S Nat\n\nplus : Nat -%3E Nat -%3E Nat\nplus Z y :%3D y\nplus (S x) y :%3D S (plus x y)\n```\n\nIt can be also rewritten to recourse on y instead of x, or even to return `(plus\nx (S y))`. But can we make it more interesting%3F\n\n%3Ccut/%3E\n\nTurns out we can if we look at it from \"types as propositions\" point of\nview. The canonical `plus` we've just written states \"if we have two nats, we\ncan have another one\", which isn't very informative%3B indeed, taking either of\nnats, their product or even plain 0 would also suffice this signature. Perhaps,\nwe need to make a stronger statement%3F\n\n```\nplus' : (x : Nat) -%3E (y : Nat) -%3E\n  (z : Nat,\n    (x %3D Z, z %3D y) %7C\n    (x' : Nat, z' : Nat,\n     x %3D S x',\n     z %3D S z',\n     z' %3D plus x' y))\n```\n\nOh well. That was quite a long one. You may even wonder whether it's actually a\nvalid type. Lets take it apart.\n\n```\nplus' : (x : Nat) -%3E (y : Nat) -%3E\n  (z : Nat,\n```\n\nFirst two lines are obvious: we're just stating inputs and assigning variables\nto them. Then we return some z and scary proof about it.\n\n```\n    (x %3D Z, z %3D y) %7C\n```\n\nWe may either return a proof that x is 0 and z is y..\n\n```\n    (x' : Nat, z' : Nat,\n```\n\n..or, that there exist x' and z' in Nat, such that..\n\n```\n     x %3D S x',\n     z %3D S z',\n```\n\nand\n\n```\n     z' %3D plus x' y))\n```\n\nNow, for implementation. Manually written one would look somewhat like this:\n\n```\nplus' Z y :%3D y, inl (refl Z, refl y)\nplus' (S x') y :%3D\n  let z' :%3D (plus' x' y)\n  in S z',\n     inr (x', z',\n       refl (S x'),\n       refl (S z'),\n       refl z')\n```\n\nAdmittedly, this becomes more and more messy, especially without any syntax\nhighlighting. But it can also be easily seen that our definition is pretty\nmechanical%3B and indeed, type of `plus'` already contains enough information to\nuniquely pick out addition operation on nats.\n\nWhich means that:\n\n- smart compiler should be able to generate function body for us\n\n- if there is an alternative (with better performance, possibly) implementation,\nsmart compiler can opt to use it\n\nHopefully, using old good Peano arithmetic wasn't too boring of an example. The\ncentral idea here is much more general though: **if you know what you want to get,\nyou can describe it in a type**.\n\nP.S. Provided with some trivial type inference, we can actually write plus as\n\n```\nplus'' :\n  (x : Nat, y : Nat) -%3E\n  ( z : Nat\n  , ( x %3D Z\n    , z %3D y\n    )\n  %7C ( S x' %3D x\n    , z' %3D plus'' x' y\n    , z %3D S z'\n    )\n  )\n```\n\nWhich looks almost like a regular function definition with pattern matching. But\nthis shouldn't deceive you: all these equalities are types (propositions), not\nassignment operators.\n","cut":"\nConsider the following canonical natural number addition:\n\n```\ndata Nat :%3D Z %7C S Nat\n\nplus : Nat -%3E Nat -%3E Nat\nplus Z y :%3D y\nplus (S x) y :%3D S (plus x y)\n```\n\nIt can be also rewritten to recourse on y instead of x, or even to return `(plus\nx (S y))`. But can we make it more interesting%3F\n\n","path":"/_posts/2018-08-26-typelevel.md"},{"layout":"post","title":"Once per month is too rare","date":"2018-06-09T15:19:21.000Z","categories":"literature","timestamp":1528557561,"content":"\nOne chapter per month is too rare, so i hope to publish next chapter\nsooner. But for now enjoy \"%D0%93%D0%BB%D0%B0%D0%B2%D0%B0 %D0%94%D0%B2%D0%B0\" of heavy bright sun.\n\n- [clearnet](https://caryoscelus.github.io/heavy-bright-sun/)\n\n- %3Ca href%3D\"/\" onclick%3D\"page.initialize('heavy-bright-sun/')\"%3E0net%3C/a%3E\n","cut":"\nOne chapter per month is too rare, so i hope to publish next chapter\nsooner. But for now enjoy \"%D0%93%D0%BB%D0%B0%D0%B2%D0%B0 %D0%94%D0%B2%D0%B0\" of heavy bright sun.\n\n- [clearnet](https://caryoscelus.github.io/heavy-bright-sun/)\n\n- %3Ca href%3D\"/\" onclick%3D\"page.initialize('heavy-bright-sun/')\"%3E0net%3C/a%3E\n","path":"/_posts/2018-06-09-once-per-month.md"},{"layout":"post","title":"Self-translation is pain","date":"2016-04-04T16:44:59.000Z","categories":"writing","timestamp":1459788299,"content":"It has a combination of translation pain and reading-your-own-text pain, plus\npain of witnessing your text being crippled. Especially so if you are less than\nperfect at target language.\n","cut":"It has a combination of translation pain and reading-your-own-text pain, plus\npain of witnessing your text being crippled. Especially so if you are less than\nperfect at target language.\n","path":"/_posts/2016-04-04-translation.md"},{"layout":"post","title":"Side note: if you can't draw poses","date":"2014-09-28T22:45:13.000Z","categories":"graphics","timestamp":1411944313,"content":"\nYeah, then you should study, study, study, draw, draw, draw until you get it\nright. But if you can't afford that, there are always ways around. One of them\nis described below.\n\n%3Ccut /%3E\n\n    Note: this tutorial assumes you have basic skills of searching additional\n    information. Not every detail is described.\n\nSo, instead of making sketches out of nothing, or using some random images as\nreference or posing your drawing dummy, you can pose 3d model and use it as ref.\n\n%23%23%23 Step one: [makehuman][makehuman]\n\nBecause not everyone can or wish to model from scratch just for posing.\n\nI'm not going to go in details because interface is mostly straightforward. The\nonly thing you need to pay attention apart from actual modelling is exporting:\nmake sure bones are included in pose/animate tab and export in blender exchange\nformat.\n\n%3Cimg src%3D\"/images/makehuman/makehuman.png\"/%3E\n\n%23%23%23 Step two: [blender][blender]\n\nYou may need to install makehuman import plugin which is available at\n[makehuman download section][makehuman_download].\n\nThen import the model, edit it if you want and pose. I recommend using posing\nlibrary if you are going to need multiple poses.\n\n%3Cimg src%3D\"/images/makehuman/blender.png\"/%3E\n\nAfter you're done with posing, maybe adding something to the scene and placing\nthe camera, all you need is render. You may want to use ambient occlusion if you\ndon't want / don't need proper illumination to be on render.\n\n%3Cimg src%3D\"/images/makehuman/render.png\"/%3E\n\n%23%23%23 Final step\n\nJust grab your graphical editor, import rendered image and draw your sketch!\n\n%3Cimg src%3D\"/images/makehuman/krita.png\"/%3E\n\nYou'll still need to do the rest of the job yourself :p\n\n%3Cimg src%3D\"/images/makehuman/krita-sketch.png\"/%3E\n\n\n[makehuman]:            http://makehuman.org/\n[makehuman_download]:   http://makehuman.org/content/download.html\n[blender]:              http://blender.org/\n","cut":"\nYeah, then you should study, study, study, draw, draw, draw until you get it\nright. But if you can't afford that, there are always ways around. One of them\nis described below.\n\n%3Ccut /%3E\n\n    Note: this tutorial assumes you have basic skills of searching additional\n    information. Not every detail is described.\n\nSo, instead of making sketches out of nothing, or using some random images as\nreference or posing your drawing dummy, you can pose 3d model and use it as ref.\n\n%23%23%23 Step one: [makehuman][makehuman]\n\nBecause not everyone can or wish to model from scratch just for posing.\n\nI'm not going to go in details because interface is mostly straightforward. The\nonly thing you need to pay attention apart from actual modelling is exporting:\nmake sure bones are included in pose/animate tab and export in blender exchange\nformat.\n\n%3Cimg src%3D\"/images/makehuman/makehuman.png\"/%3E\n\n%23%23%23 Step two: [blender][blender]\n\nYou may need to install makehuman import plugin which is available at\n[makehuman download section][makehuman_download].\n\nThen import the model, edit it if you want and pose. I recommend using posing\nlibrary if you are going to need multiple poses.\n\n%3Cimg src%3D\"/images/makehuman/blender.png\"/%3E\n\nAfter you're done with posing, maybe adding something to the scene and placing\nthe camera, all you need is render. You may want to use ambient occlusion if you\ndon't want / don't need proper illumination to be on render.\n\n%3Cimg src%3D\"/images/makehuman/render.png\"/%3E\n\n%23%23%23 Final step\n\nJust grab your graphical editor, import rendered image and draw your sketch!\n\n%3Cimg src%3D\"/images/makehuman/krita.png\"/%3E\n\nYou'll still need to do the rest of the job yourself :p\n\n%3Cimg src%3D\"/images/makehuman/krita-sketch.png\"/%3E\n\n\n[makehuman]:            http://makehuman.org/\n[makehuman_download]:   http://makehuman.org/content/download.html\n[blender]:              http://blender.org/\n","path":"/_posts/2014-09-28-makehuman.md"},{"layout":"post","title":"Moving pictures theatre %26amp%3B melt resize script","date":"2019-02-05T15:36:27.000Z","categories":"misc","timestamp":1549380987,"content":"\nMore than one month and two days later than planned, [moving pictures\ntheatre](http://127.0.0.1:43110/1N8zibqog72CCDBDo8jrxU7C6Q8JeVND2Z/) is open.\nAlong with it, i'm going to share a script i'm actively using for video\nproduction in kdenlive on a blunt edge laptop.\n\n%3Ccut/%3E\n\nAs some of you might know, Kdenlive is one of the best (as rumors go anyway)\nfree (libre) video editing software. But like a few others, it delegates actual\nvideo processing to melt. Well, this is just a side note so that you understand\nthat when i'm talking about kdenlive rendering i'm implying melt and vice verse.\n\nThe problematic point is that many melt effects (though some of them are\napparently not even directly melt-based, but supported by it anyway) use\nabsolute pixel (and frame, but this is less important for most of my usecases)\nvalues. This is annoying by itself: if you were making 720p project and then\ndecided to go full hd, you can't easily do it if you used any of those effects.\n\nBut even if you don't do it, if you accept dirty reality where you have to\nselect highest resolution from the start, you may still be in trouble. The\nproblem is that *apparently* video processing is a very slow process (i'm not\neven sure melt uses gpu)%3B adding just a couple heavier effects can make effect\npreview (beyond one frame) completely broken.\n\nBut surely there must be a solution%3F Like, those proxy clips, for example%3F Well,\nindeed, proxying clips can make things a bit faster for montage. But perhaps\nsurprisingly it doesn't change anything for effects: they are being processed at\ntarget resolution. *If you're using high resolution there seems to be no method\nto edit videos with effects at normal speed without flushing money into render farm*\n\nThere seems to be, but.. these are free open-source projects, right%3F Using open\nformats, right%3F And doesn't that look like an xml%3F\n\nOne (un)fortunate day i noticed all of this and decided to just write that\nscript. Dirty script which would scale parameters of (some) effects and\ntransitions, so that i could enjoy blazing speed of processing 160x90 videos and\nthen render at proper resolution. Resulting workflow is still worse than ideal,\nbecause sometimes 160x90 is just too small and switching resolutions for\nanything other than rendering may lead to a trouble. But in this case i prefer\nsomething that works now.\n\n[Here](https://notabug.org/caryoscelus/bad-scripts/src/master/melt-change-resolution.hs)\nis the result of (mis)using haskell for this ungraceful task. And remember:\nnever try to parse xml with regular expressions at home!\n","cut":"\nMore than one month and two days later than planned, [moving pictures\ntheatre](http://127.0.0.1:43110/1N8zibqog72CCDBDo8jrxU7C6Q8JeVND2Z/) is open.\nAlong with it, i'm going to share a script i'm actively using for video\nproduction in kdenlive on a blunt edge laptop.\n\n","path":"/_posts/2019-02-05-melt-resize.md"},{"layout":"post","title":"NaNoRenO fail","date":"2015-03-31T21:11:12.000Z","categories":"gamedev","timestamp":1427836272,"content":"\nTime to admit it, perhaps. I could've built a working demo, but it would be too\nunpolished for publishing on NaNoRenO.\n\nIf anyone interested (hello imaginary friends), there still will be demo\nsometime soon, so keep waiting. Maybe i'll even make a teaser video and loud\nannounce.\n","cut":"\nTime to admit it, perhaps. I could've built a working demo, but it would be too\nunpolished for publishing on NaNoRenO.\n\nIf anyone interested (hello imaginary friends), there still will be demo\nsometime soon, so keep waiting. Maybe i'll even make a teaser video and loud\nannounce.\n","path":"/_posts/2015-03-31-nanoreno.md"},{"layout":"post","title":"Working on TDA again","date":"2014-08-21T16:54:23.000Z","categories":"gamedev","timestamp":1408640063,"content":"\nIt's been quite a while since i worked on \"The Day After\" (see\n[projects][projects] for more info), but it's not dead. Starting from today i'm\nactively working on it again and hopefully will produce demo soon. Details to be\nrevelaed later. I've got some work to do %5E_%5E\n\n[projects]:     /projects\n","cut":"\nIt's been quite a while since i worked on \"The Day After\" (see\n[projects][projects] for more info), but it's not dead. Starting from today i'm\nactively working on it again and hopefully will produce demo soon. Details to be\nrevelaed later. I've got some work to do %5E_%5E\n\n[projects]:     /projects\n","path":"/_posts/2014-08-21-tda-again.md"},{"layout":"post","title":"Random demo (continued)","date":"2016.10.05 21:24:25","categories":"animation","timestamp":1475702665,"content":"\nAs i promised, here's a video with some explanation about time patch layers.\n\n%3Ccut/%3E\n\n%3Cvideo width%3D\"640\" height%3D\"360\" controls%3E\n    %3Csource src%3D\"https://github.com/caryoscelus/synfig-demos/releases/download/rectface-ep-0/synfig-timepatch.webm\"%3E\n    %3Ctrack label%3D\"English-external\" kind%3D\"subtitles\" srclang%3D\"en\" src%3D\"https://raw.githubusercontent.com/caryoscelus/synfig-demos/master/2016.10.02-smiley-face/synfig-timepatch.vtt\" default /%3E\nBah, no video support!\n%3C/video%3E\n","cut":"\nAs i promised, here's a video with some explanation about time patch layers.\n\n","path":"/_posts/2016-10-05-demo.md"},{"layout":"post","title":"Forcing a plot","date":"2018-11-16T00:03:30.000Z","categories":"writing","timestamp":1542326610,"content":"\nThere is a math proof technique called \"forcing\", but frankly i don't know what\nit means. But coincidentally my secret writing technique %234 is also called\n\"forcing\".\n\n%3Ccut/%3E\n\nThere is a common sense rule \"don't force it if you can help\" and it naturally\napplies here. Forcing is a technique i don't especially like using. Usually it\nworks as a last resort measure, when the plot is stuck and cannot move an inch\nwithout heaving pushing.\n\nForcing boils down to reviewing already established events, characters, their\nmotivation etc %E2%80%94 essentially everything that you've written so far %E2%80%94 and then\nconsidering logical possibilities for the yet unfilled blanks. There is always a\nquestion waiting to be answered: whether it's as simple as \"what happened\nbetween day one and day X%3F\", or as elaborate as \"what was the reason behind that\nsuspicious smile back on page 1%3F\" %E2%80%94 until you've finished the story (and even\nthen), you can always find something.\n\nSome questions are better than others%3B some are enough to make a breakthrough\nand some can only be a piece in a larger puzzle. Just collect the questions and\npossible answers and ~~perform exhaustive prediction of each combination~~ pick\nsomething that you are comfortable with.\n\nSounds simple on screen, so i'm off to do that now.\n","cut":"\nThere is a math proof technique called \"forcing\", but frankly i don't know what\nit means. But coincidentally my secret writing technique %234 is also called\n\"forcing\".\n\n","path":"/_posts/2018-11-16-forcing-a-plot.md"}],"count":115}