{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 15,
	"comment": {
		"2_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 1,
				"body": "Проблема не в том что нет Ъ капиталистов (они есть), проблема в том что им никто не даст. У нас как - сел царь и сидит, пока вперёд ногами не вынесут. Исключения по пальцам пересчитать можно.",
				"added": 1551195737
			},
			{
				"comment_id": 4,
				"body": "> А что именно, по вашему мнению, капиталистам должны именно \"дать\"?\n\nРаботать в рамках рынка, очевидно. У нас любой бизнес целиком и полностью зависит от чиновников различных уровней и их интересов. Внимание не обращают только на совсем уж редкие области (или уровень прибыли очень низок).",
				"added": 1551231485
			},
			{
				"comment_id": 5,
				"body": "Я что-то вообще не уловил нити мысли.  Вопрос был о возможности капиталистической экономики и общества в России - да, это возможно при условии что действующую власть попячат. А \"капиталисты виноваты\" это всего лишь старый и удобный жупел работающий со времен революции, вне зависимости от того кто сидит на троне.\n\nИ проблема содержания денег в российских банках в том что деньги там перестают быть твоими собственными, а легко и непринужденно меняют владельца по первому же хлопку щёк сверху.",
				"added": 1551258679
			},
			{
				"comment_id": 7,
				"body": "Традиционное развлечение же. Спорили, спорят и будут спорить. И без какого либо результата.",
				"added": 1551319843
			}
		],
		"34_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 2,
				"body": "Все бы ничего, но всратый электрон портит идею. Кстати, а чего заглохла тема с выкладыванием БД трекеров? Вот рутрекер держал раздачу официальную одно время (сначала зашифрованную, потом в открытом виде), кто-то этот же рутрекер парсил на предмет magnet ссылок ну и бухта само собой. А сейчас как-то тухло с этим.",
				"added": 1551195884
			}
		],
		"1_19nB39bXLXo8trU1gs1XZPzPq58NGiNLKX": [
			{
				"comment_id": 3,
				"body": "Есть два стула - более-менее безопасный и бесплатный. Выбирай.",
				"added": 1551195970
			}
		],
		"1_1LB5A2qJU57xRuyJtUNWBNMnKTPkSmdF2h": [
			{
				"comment_id": 6,
				"body": "Нужно! Я список со всяких помоек собираю, где половина адресов не работает.",
				"added": 1551319751
			}
		],
		"4_1LB5A2qJU57xRuyJtUNWBNMnKTPkSmdF2h": [
			{
				"comment_id": 8,
				"body": "> конституционные свободы граждан\n\nлол",
				"added": 1551406626
			}
		],
		"3_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": [
			{
				"comment_id": 9,
				"body": "Возьми да сделай pull request если ты такой умный и знаешь что прикрутить DHT просто. До сих пор ни в одном торрент клиенте нормальный поиск не завезли. Все что было в основном по хэшам, ибо текстовая индексация в p2p не хер собачий.",
				"added": 1551437624
			}
		],
		"3_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 10,
				"body": "Люминь и медь стыковать нельзя. Проводка из люминя хрупкая и неудобная в подключении, в отличии от медной.",
				"added": 1551504729
			}
		],
		"1_1Ae4VAbPLC6ZzSEBoVBS76M8URVBJ9Fwqx": [
			{
				"comment_id": 11,
				"body": "1) не взлетит\n2) https://rutracker.org/forum/viewtopic.php?t=5591249\n3) сложна (с)\n4) > рекламу на zeronet\nСовсем крышей поехал? Подружиться то конечно можно и даже не особо сложно, но вот реализовать сложную структуру рутрекера в рамках зеронета - ооочень сложная задачка, заново движок писать считай.",
				"added": 1551581938
			}
		],
		"1_1FPE99DFTjYKHk5naTwhJkWhkfzh22SqaL": [
			{
				"comment_id": 12,
				"body": "А я считаю что ты хуй. Опровергни.",
				"added": 1551582025
			}
		],
		"6_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 13,
				"body": "Демократия нежизнеспособна.",
				"added": 1553175719
			}
		],
		"5_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 14,
				"body": "RT ядро на декстопе нахер не нужно, это для критичных к времени задач типа ЧПУ и обработки сигналов.",
				"added": 1554730056
			}
		]
	},
	"comment_vote": {}
}