{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 12,
	"comment": {
		"1560002823_1Fdubdz82XUxNMuaHGYC3uKD95XbnW7JTs": [
			{
				"comment_id": 1,
				"body": "So how does this cryptocurrency differ from Bitcoin? The link to the \"original whitepaper\" in the Starwels Github is just a link to Satoshi's Bitcoin whitepaper.",
				"added": 1560027346
			},
			{
				"comment_id": 2,
				"body": "> [bounty](#comment_2_1Fdubdz82XUxNMuaHGYC3uKD95XbnW7JTs): There is a very important advantage here - the speed of transactions and the preservation of decentralization.\n\nHow does Starwels speed up transactions and preserve decentralization versus Bitcoin?",
				"added": 1560043562
			},
			{
				"comment_id": 6,
				"body": "> [bounty](#comment_3_1Fdubdz82XUxNMuaHGYC3uKD95XbnW7JTs): Blocks move in seconds one second new block\n\nHow does Starwels prevent double spending if transactions are instantaneous?",
				"added": 1560124726
			},
			{
				"comment_id": 9,
				"body": "> [bounty](#comment_6_1Fdubdz82XUxNMuaHGYC3uKD95XbnW7JTs): How technology works I can advise you to look at the source code if you understand the technical part.\nThat's an absolutely unacceptable answer. Linking to the Bitcoin whitepaper and calling it the Starwels \"original whitepaper\" (as the Starwels Github does) is deceptive to begin with, while making changes to the Bitcoin source code with no apparent documentation or explanation and saying \"read the code lol\" is shady to say the least. There's very little information about this project or who is behind it, and all of the marketing I can find for it, including your posts, is filled with vague cryptocurrency-world buzzwords. \n\nFor all I know, the only function of the software is to find my cryptocurrency private keys and transmit them to some server in China or the CIS. \n\nIt's possible that this isn't a scam or malware, but I have no reason to believe that, and nothing about your posts convinces me otherwise.",
				"added": 1560392305
			}
		],
		"1560053525_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 3,
				"body": "I'm glad ZeroTalk is accommodating to schizophrenics. Even loonies need a place they can express themselves.",
				"added": 1560055096
			},
			{
				"comment_id": 4,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_205_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): We HAVE NOT EVOLUATED IN THE PAST 200 YEARS.\nWE HAVE --REGRESSED--\nON -ALMOST EVERY LEVEL OF LIFE-.[...]\nWell, that's what happens when you let the kikes destroy your civilization. They're currently flooding North America and Europe with endless streams of 85 IQ brown sludge from Central America, North Africa/ME, and Central Asia. In fifty years, Canada/the U.S. and Europe will look and function like Brazil or South Africa.",
				"added": 1560116031
			},
			{
				"comment_id": 5,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_205_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"In the olden days, even the sewage treatment plant was ornate.\"That's what people CAN'T UNDERSTAND; [...]\n\nTo be clear, I still think you're a nutjob who can barely form a coherent sentence. But even a broken clock is right twice a day.",
				"added": 1560116162
			},
			{
				"comment_id": 7,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_209_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"Turn on your TV (haven't personally watched anything on it since 2005 and any sports since 2002) or check out the DVD's in any store and all you see is violence, sex and plenty of degradation of humans. Who or what would encourage such an attack on the dignity of us all and why?\"\n\nKikes. You want to remain blind to that fact, and that's fine. But if you'd pull your head out of your ass and realize that while Jews are ~2% of the U.S. population, they make up a much larger portion of the Hollywood directors, producers, and writers pumping out the content you're complaining about. Look at who owns the largest porn streaming companies, too. \n\nBut, nah, you're right. It's probably just a cohencidence.",
				"added": 1560125075
			},
			{
				"comment_id": 8,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_212_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): fuck off, you know shit, you pretend that's all. that makes you the tic-tac-toe of this thread.when you will start to think, maybe never.the problem is way beyond your own life problem.\n\nLearn English if you want to write in it. Most of what you say makes no sense.",
				"added": 1560130965
			}
		],
		"1560807628_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ": [
			{
				"comment_id": 10,
				"body": "If they don't block ssh, you can get a cheap VPS and set up an ssh tunnel with a local SOCKS proxy, then set up tor to connect through that. Or if they do block ssh on port 22, you can set the sshd on your VPN to listen on port 443, as long as you're not also going to try to serve HTTPS over that port. E.g.\nssh -D 2222 myuser@my.vps\nand set your torrc file to use a SOCKS proxy of localhost:2222\nor \nssh -D 2222 -p 443 myuser@my.vps\nif they block port 22 at your school.\n\nI've used this setup before and it was OK speedwise.",
				"added": 1560824866
			}
		],
		"1560968142_1GnMepQGSHSi7yBqqi86T65hRgon3KyJtS": [
			{
				"comment_id": 11,
				"body": "You seem shocked. Is it because these things might actually have happened, or because these things are regarded as holy scripture by billions of people, or both?\n\nIf it makes you feel any better, it's my understanding that most modern archeologists don't believe that the accounts of the conquest of Canaan are historical. See here: https://ehrmanblog.org/historical-problems-with-the-hebrew-bible-the-conquest-of-canaan/ for example. Also, most modern archaeologists don't believe that there was an enslavement of large numbers of Hebrews in Egypt, so there was no need to conquer Canaan: the Hebrews (or the people who became them) were always there, in some form, back into prehistory.\n\nOf course, there are textual literalists who insist that everything really did happen as it did in the Bible.\n\nBut if the modern archaeologists are right, that means that the horrific things described in the Old Testament* are more of a reinterpretation of old oral traditions about the creation of Israel than an attempt to accurately record history. It was writing that served the religious agenda of the time in which it was written. Canaanite gods bad. YHWH good. That sort of thing. And it was really outside of the power of the Israelites to be more than local troublemakers, even at the height of their power. The Hebrews spent most of history being raped and pillaged by pretty much everyone around them: the Egyptians, the Hittites, the Hyksos (IIRC), the Babylonians, the Persians, the Greeks, the Romans, and later (though this was after Biblical times), the Muslims. Except for maybe a brief period at the beginning of the Iron Age, Israel has always been somebody's bitch. Maybe all of those massacres are a kind of nationalistic fantasy? I don't think that's a scholarly opinion, I'm just psychologizing them.\n\nIf your problem isn't that these are historical stories, but scripture, recording what people believe are God's orders, fair nuff. Many modern people would be as horrified as you are.\n\nOf course, Christians (and Jews) have had 2000 years to explain away this stuff. You can look into that if you like. Funny that you're focusing on this instead of some of the other, earlier (in Genesis) stuff that a lot of people find fucked up, like God scattering people because they built a tower, or wiping out everyone except for Noah's family and two (or seven) of each animal.\n\nAs for the New Testament, I don't recall that it ever addresses the slaughters of the Old Testament. I doubt most people of that era would have viewed it as even remotely a problem. And depending on your interpretation of the New Testament, there's a lot worse in store for billions of souls than a mere slaughter. That'd be eternal torture in hell. Interestingly, not all Christian denominations believe in that. Seventh Day Adventists and Jehovah's Witnesses, for example.\n\n*Plenty of Christians would say it's not horrific at all, but merely God's righteous judgement on idolaters.",
				"added": 1561013235
			}
		]
	},
	"comment_vote": {}
}