{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"2_1LeZqbLv8mMF9Q9qvQeJX8mivvG7ykJUeC": [
			{
				"comment_id": 2,
				"body": "Create-torrent seems to sometimes dislike long filenames with a certain amount of spaces.\n\nThen again, I'm not sure if spaces is the issue.. lots of other filenames with tons of spaces and even Japanese characters have made it through. Then again, for now.. the workaround would be to use lower-case names with underscores.",
				"added": 1504731800
			}
		],
		"1_18KZys3ybA1k5NT7n9qV4atENhao8742XB": [
			{
				"comment_id": 3,
				"body": "lol..",
				"added": 1504734130
			},
			{
				"comment_id": 4,
				"body": "I guess even a kid can figure it out..\n\nOf course, i noticed that this particular video has trouble streaming smoothly. You have to scroll 1 second forward to get it to play.. let me know if everyone else has the same problem.",
				"added": 1504734284
			},
			{
				"comment_id": 5,
				"body": "fixed the video.. lol\n\nthe problem had something to do with the first 2 seconds of the video. It was filmed with webcam, and webcams sometimes screw up the framerate and bitrate at the start of the video.. interrupting the streaming process.",
				"added": 1504735487
			}
		],
		"1_1LeZqbLv8mMF9Q9qvQeJX8mivvG7ykJUeC": [
			{
				"comment_id": 6,
				"body": "I'm starting work on the Katy-Torrent client today.\n\nThe client will essentially be a SeedBox in an of its own, and have an interface similar to Kittify. When you upload a torrent, it keeps the file inside a folder.. then seeds it. You can install it on a VPS running Ubuntu server.\n\nIt will listen on port 1337 (or any port you want, for that matter). That means that if you open that port, you'll be able to access your torrent client from another computer, and permanently upload and seed files to it.. by simply typing: http://<my.ip.address>:1337/ . It would also have to come with some optional password protection, unless you're running a proper server that you intend to be publicly accessible.\n\nUnlike Kittify, it will be purely torrent-based. Only the web-interface GUI will be based on a node.js HTTP webserver.\n\nI'm pretty sure Instant.io and Btorrent.xyz already use a similar technology, but the owners seem to have lost interest in these projects.. and the code is just all over the place. I want to strip it down to the very basic essentials, and also provide tons of documentation so that we can get more people involved in the project.",
				"added": 1504750228
			}
		]
	},
	"comment_vote": {
		"3_18KZys3ybA1k5NT7n9qV4atENhao8742XB": 1,
		"2_18KZys3ybA1k5NT7n9qV4atENhao8742XB": 1
	}
}