{
	"next_post_id": 6,
	"next_comment_id": 2,
	"next_follow_id": 2,
	"avatar": "generate",
	"user_name": "Adam Grass",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"intro": "Adam Grass is the owner and CEO of Adam Grass Enterprises,\nthe first and only on-line clothing retailer supplying quality custom t-shirts to the burgeoning zero nets market.",
	"post": [
		{
			"post_id": 1540852410,
			"body": "Dear Janet,\n\nI am writing to apologize for moving a log from behind the rear wheels of your car, causing it to it roll backwards into the lake, sinking to the bottom, and almost certainly causing the loss of your great-grandfather's antique typewriter, memoir transcript, remains, as well as your own ant-farm which also was also unfortunately stored in the back seat at that time.\n\nThe rest:\n\nhttp://127.0.0.1:43110/ZeroMedium.bit/?/1C9Mjsqo27xycjPyaJzKyithvXgsutsSHo/the-letters-of-adam-grass---october-18-2018",
			"date_added": 1540852408
		},
		{
			"post_id": 1541130890,
			"body": "Dear Archer,\n\nI am writing to invite you to my home next month for a visit. I want to assure you that my house is safe and that you will be safe within it. Pay no heed to what you may have heard of five workmen dying of fright or supernatural effect during the recent renovations, ridiculous stories of apparitions appearing in the windowpanes, and numerous townspeople petitioning to have the house demolished. All of this is nonsense.\n\nThe rest:\nhttp://127.0.0.1:43110/ZeroMedium.bit/?/1C9Mjsqo27xycjPyaJzKyithvXgsutsSHo/the-letters-of-adam-grass---october-30-2018",
			"date_added": 1541130887
		},
		{
			"post_id": 1542241716,
			"body": "Dear Hamid,\n\nI am writing to congratulate you on being elected Premier of your great nation. Although the world largely howled with indignation at the news of your ascent, and I admit there are very good reasons for that antagonism which I agree with, the news also made me feel glad for you. I myself may be merely the first and only on-line distributor of custom T-shirt products to the zero nets, but I will say this: perhaps now that you have risen to a position of power and much respect, you can finally feel secure enough to announce to the world that about yourself which you have hidden in unwarranted shame for so long.\n\nThe rest:\nhttp://127.0.0.1:43110/ZeroMedium.bit/?/1C9Mjsqo27xycjPyaJzKyithvXgsutsSHo/the-letters-of-adam-grass-%E2%80%93-november-14-2018\n",
			"date_added": 1542241712
		},
		{
			"post_id": 1542601956,
			"body": "Dear Dr. Huttinson,\n\nI am writing in appreciation of the interview you gave recently to a PBC science journalist, which I had the pleasure of listening to on my wireless radio set last week. As the world's foremost authority in the bio-tech field of gene-driving, you spoke at length of how elimination of malaria-carrying mosquitos is currently the most debated application. If I may be so bold, I would like to make a personal request of you: if you intend to make field tests of gene driving techniques to eliminate a species, and mosquitos prove to be too controvertial, please consider elimination of the common brown duck. I detest the common brown duck.\n\nThe rest:\nhttp://127.0.0.1:43110/ZeroMedium.bit/?/1C9Mjsqo27xycjPyaJzKyithvXgsutsSHo/the-letters-of-adam-grass---november-18-2018\n",
			"date_added": 1542601951
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "Blast! Why does the this hyperlink not work. Well, see my writings at ZeroMedium. http://127.0.0.1:43110/ZeroMedium.bit",
			"post_uri": "1C9Mjsqo27xycjPyaJzKyithvXgsutsSHo_1542241716",
			"date_added": 1542601780
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "191jbK3GNmVritcMymKkFuxyYFXxqv2xpC",
			"user_name": "Eightyfour",
			"date_added": 1542339640
		}
	]
}