{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1560988180,
			"title": "Initial Impression",
			"body": "Ive played with dat:// and some block chain / torrenting decentralized networks. This by far impresses me the most. The way that zn works and the large community using this is amazing! I love it. Before I had always though that decentralized networks were a thing of the future but this has suspended my belief! It is here!\n\nThat being said I would like to ask you, the people of zn what your favorite sites / programs are. Im looking to get deeper into zn!",
			"added": 1560988179
		}
	],
	"topic_vote": {
		"1560988180_1CKKbdH99PeFfraMKFZNmCMAUsTfTQxsKU": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1560684873_1AqPs23HT3V8rwqey5F5bXsLMUZUmcMnep": [
			{
				"comment_id": 1,
				"body": "Beaker Browser to me is super lame and boring! The dat:// protocol is well flushed out the problem is content and keeping the files alive! The way that zeronet automatically downloads and shares the files / websites with you is a pirates ideal concept. Torrenting is all fun and games until you have no peers and have to wait 1y+ to get a file or website.",
				"added": 1560987691
			},
			{
				"comment_id": 2,
				"body": "> [caryoscelus](#comment_162_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Heh, that's about what i thought when i first heard of \"beaker browser\". But the dat protocol existed before beaker and i believe is still useable now without it. The idiotic marketing rules dictate to obscure such info from users though and only advertise \"beaker browser\"\n\nI agree with this. That concept was inherently flawed",
				"added": 1560987715
			}
		],
		"1560883011_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 3,
				"body": "It frustrates me some times how connected people are to their devices. Every day kids are on their phones drowning in drama or other issues. It reminds me of a episode of black mirror.",
				"added": 1560987885
			}
		]
	},
	"comment_vote": {
		"2_1CKKbdH99PeFfraMKFZNmCMAUsTfTQxsKU": 1,
		"2_1Gww3egxQHxqa1ktvbUYYQp7KamrCb9Ag3": 1,
		"5_12w3zJ6gRrcAw2kSCQXDkorgqxuXnkKkF8": 1
	}
}