{
	"next_comment_id": 51,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [nippletwister](#comment_1_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Wow, that is interesting! Good luck with further improvments.\n\nThanks! Glad you liked it ;)",
			"post_id": 3,
			"date_added": 1455055775
		},
		{
			"comment_id": 2,
			"body": "> [gomzik](#comment_1_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): I'll wait for your details\n> Thanks\n\nI'll try to write a tutorial over the weekend, shouldn't take too long, now that I know how it works it's not that much code :) And in theory the same technique can be used to add comments, just have to figure out how the replies work that you can follow and see on ZeroHome.",
			"post_id": 4,
			"date_added": 1455272020
		},
		{
			"comment_id": 3,
			"body": "> [shift](#comment_1_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): looks like young reddit =)\n\nHaha :) I hope someone develops a real, full featured ZeroNet Reddit clone at some point. Could attract lots of people since Reddit had that huge exodus after the censorship and Victoria/AMA scandal and people are still looking for good alternatives. Needs to fully work on mobile by that point though, or it won't take off.",
			"post_id": 2,
			"date_added": 1455272887
		},
		{
			"comment_id": 4,
			"body": "> [nippletwister](#comment_2_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Technically it can work on mobile though gateways. It could work for the first times.\n\nTrue, as long as the UI is actually enhanced for mobile. Running a ZeroNet server on a mobile (once that becomes a thing) might also drain the battery too much for some people. Mobiles are getting smaller and faster but the battery stays as crappy as it always was :)",
			"post_id": 2,
			"date_added": 1455273686
		},
		{
			"comment_id": 5,
			"body": "> [shift](#comment_2_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): \n\nProbably easier to write it in a cross platform language that compiles to Objective-C and Java so the core only has to be written once to support both iOS and Android natively. Otherwise it's just too much work for a small team, at that point you'd have to keep three separate implementations updated (Python, Swift, Java). Then you could even scrap the Python version and just use that cross platform language for Win/Mac/Linux/iOS/Android, all native.\n\nIs Swift usable yet? When it was first released and Apple said it's so darn fast, I remember seeing a few companies write angry articles a month or two later saying Apple lied and it's multiple times slower than Objective-C (I think it was 5 to 15 times slower depending on what you're doing) so they had to scrap all their Swift work and go back to Objective-C because Swift was just way too slow for them (still a lot faster than interpreted languages of course).",
			"post_id": 2,
			"date_added": 1455276273
		},
		{
			"comment_id": 6,
			"body": "> [nippletwister](#comment_3_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Awesome! This site gets better and better every day. It would be cooler though if when I choose 'most voted' mode votes were visible without needing to point the cursor to quotes. The same goes to creation data in 'ordered by date' mode.\n\nThat's a great idea! By creation data, do you mean the date the quote was created? And thanks for the kind words :)",
			"post_id": 6,
			"date_added": 1455453831
		},
		{
			"comment_id": 7,
			"body": "> [nippletwister](#comment_5_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): By the way it would be nice if there is ability to choose/filter quotes by language. It also needs additional field to fill though.\n\nRight, good idea I thought about that too. I will add a drop down list to the quote submitting area to select a language and make it default to English or maybe even remember the last selection. For all old quotes without language selected it would show English too, but I can manually fix that, I think there is only one non-English quote so far.\n\nOh and as for the creation date, we meant the same thing, the date the quote was submitted, not when whoever said it said it :)",
			"post_id": 6,
			"date_added": 1455471200
		},
		{
			"comment_id": 8,
			"body": "> [nippletwister](#comment_7_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Amazing work! Is it possible to use the same tasks list on PC and mobile?\n\nThanks! :)\n\nYour todos you should be able to access from any computer where you copied your user information to. I've never tried this but I believe you just have to copy the YourZeroNetFolder/data/users.json file over to the other computer. Maybe also the sites.json file in the same directory, that I am not sure about, but the information should be easy to find on ZeroTalk and maybe you already know about that.\n\nIf you make a change on one computer and you have the site opened on both, you will even see the other update live as you make changes (unless there are unsaved changes on the other computer, then it ignores them so your changes aren't lost and you can decide what to do).\n\nBut as far as I know, the way most people use ZeroNet on mobile right now is by using a proxy like bit.no.com:43110. You obviously should not use your main user data there, you'd give your private key (which is also used for the encryption) over to a third party and that isn't safe. So an alternative if you do want to use a proxy would be to create an account on that proxy and use that proxy on both mobile and PC whenever you want to access your todos. Then if it turns out the proxy is malicious or was hacked or whatever, only your todos are compromised, not your whole main ZeroNet account.\n\nMuch safer though would be if you run your own server or if your home computer is on all the time so you can use that as the server, or maybe a Raspberry Pi or something like that which doesn't drain much power. Or if ZeroNet adds official support for mobile so you can install the client on your phone, which I assume will be the case at some point in the future :)",
			"post_id": 7,
			"date_added": 1455964976
		},
		{
			"comment_id": 9,
			"body": "> [nippletwister](#comment_8_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Yep, If this site could have some additional useful features like Task Coach or Todo.txt do and ZeroNet become available on mobile it could be real and pretty attractive alternative for mentioned apps.\n\nI'm sure to add a few more features over time :)\n\n> [muja](#comment_3_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr): Beautiful.\n\nThanks :)",
			"post_id": 7,
			"date_added": 1455978107
		},
		{
			"comment_id": 10,
			"body": "> [gomzik](#comment_2_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): So, do you like vue.js now? I hope, you not spend time in vain :)\n\nI love it so far :) Thanks again for recommending it to me. Was very easy to get into, I had the basic version of ZeroTodos finished in the same evening I started learning Vue.js, The Vue guide is really easy to understand, well written.\n\nI think the overall way it makes you structure your apps is also very neat. I've written ZeroTodos just as a general web app first using just Vue.js and then when that was done I added ZeroNet support (which was really simple at that point), which is completely separate, the Vue app doesn't know anything about ZeroNet.\n\nThere are just three callbacks you need to implement and register with the Vue app and  it could easily work with Firebase for example instead of ZeroNet, you don't have to rewrite any code. Really neat. And all of the functions are really short since Vue takes care of so much of the work for you that you really don't have much left to do :) The majority of the actual time spent I think went into the design, the CSS.",
			"post_id": 7,
			"date_added": 1456080527
		},
		{
			"comment_id": 11,
			"body": "> [zozon](#comment_1_1QBLGLcgKfcpfLmiDYuDzUKVXFfmTAew55): excellent! well done! presentation, function, reasonable effectsgood example of what can be done with aid of some nice lib + of course mastery of putting it together.One possible idea - use of local storage of todo's one don't want to store in p2p 'cloud' and would use on one main device\n\nThanks for your kind words :)\n\nOn the effects I still have to work a bit, I want to get rid of the initial animation when opening the site and maybe use a different animation when switching between todo lists, right now it uses the animation for adding/deleting tasks. Haven't figured out how to do that in Vue.js yet, but I'm sure I will :)\n\nI'm currently converting ZeroQuotes to use Vue and that included converting all of the jQuery animations 1:1 to CSS3 animations (which was easier than I thought it would be) so that I can get rid of jQuery completely, which means I'm learning a lot more about animations right now anyhow.\n\nLocal storage of todo lists will be an option in a future update, haven't done that yet since localStorage is temporary storage in TorBrowser which means 40% of ZeroNet users couldn't use it (according to nofish about 40% of peers use Tor, including myself), but I think I can just write todos to a file that ZeroNet ignores and doesn't share with other users. I also plan to add public todo lists, so that I can share my ZeroQuotes and ZeroTodos todo lists so people can see what I'm working on, what bugs are known, etc.",
			"post_id": 7,
			"date_added": 1456600323
		},
		{
			"comment_id": 12,
			"body": "> [muja](#comment_4_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr): Would a feature to drag todos to different positions be a reasonably easy thing to do?\n\nI'll look into it, for both todo lists and tasks. And I think I need it myself, I've got seven todo lists now, would be nice to reorder them a bit :)",
			"post_id": 7,
			"date_added": 1456607591
		},
		{
			"comment_id": 13,
			"body": "> [muja](#comment_4_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr)\n\nIt's done, took a bit longer than it would have because Firefox/TorBrowser is a bit more picky than Chrome when it comes to HTML5 drag and drop, but after a bit of googling I found the issue  (you need to define data to be transferred with the drag event even if you don't use the data, otherwise it won't work in Firefox, so I just transfer dummy text, literally the string \"dummy\").\n\nYou can drag both todo lists and tasks now to reorder them. Afterwards you need to click save (or just reload the page to cancel any reordering).",
			"post_id": 7,
			"date_added": 1456617006
		},
		{
			"comment_id": 14,
			"body": "> [muja](#comment_5_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr): Wow you are an amazing person! \n\nThanks :) Still have to figure out how to add an animation for the tasks/todos being swapped with one another to make it more visible that everything worked fine, for some reason that isn't animated even though I think it should be automatically. Probably some Vue caching of HTML elements going on that prevents the animation that is displayed for removing/adding elements.",
			"post_id": 7,
			"date_added": 1456660448
		},
		{
			"comment_id": 15,
			"body": "> [angristan](#comment_1_1MEWJRMLgvofqG9Mbsb2Rc4hFFyv7HeRx7): Awesome,  I answered every question :p\n\nThanks :) Looks like the percentage calculation IS a little off, I knew it, gets up to 101% in some cases.",
			"post_id": 10,
			"date_added": 1457383679
		},
		{
			"comment_id": 16,
			"body": "> [eventi](#comment_1_1DcDDitsjFJohvwonPmpibRChmA7uGxqL7): Polls have questions, questions have answers, answers have votes... How did you wind up doing it?\n\nBest to take a look at the source code, it is very complicated. It's in ZeroPolls.coffee in YourZeroNetFolder/data/1K28kQFMquNzto2iQf4GGjr6oFUbC1NddE/js\n\nBasically, answers are concatenated into a string so there is just one column in the database for all answers a question has, it's then split again in the code into multiple answers. For the votes, I had to do one SQL query for every poll displayed on the site to get all the votes for that poll, which is why this won't scale that well.",
			"post_id": 10,
			"date_added": 1457383986
		},
		{
			"comment_id": 17,
			"body": "> [gomzik](#comment_4_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Ekaterina, you're awesome! How do you find so much time for your projects?\n\nHaha thanks :)\n\nIt didn't take that long, I only started working on ZeroPolls yesterday. But I did work the whole day today on it. In total maybe 15 hours of work, plus/minus a few hours.",
			"post_id": 10,
			"date_added": 1457384093
		},
		{
			"comment_id": 18,
			"body": "> [nippletwister](#comment_9_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Really cool site. Just created my own poll there).\n\nThanks! And I voted on it, haha :)\n\nReal time vote updating makes the polls flicker a bit, probably due to my little workaround, hopefully I can improve that a bit in the next update.",
			"post_id": 10,
			"date_added": 1457387120
		},
		{
			"comment_id": 19,
			"body": "> [cub3](#comment_1_1LRrd96P7FiTcsyNXVzPM5jtpQoH1B4gYf): Well done!! do you plan push the code of your projects to github?\n\nThanks! :)\n\nNot right now, but I do plan to host the code for all my sites directly on ZeroNet once the Github clone is done. You can however already look at the source code (just can't send any pull requests which is unfortunate), I upload the original .coffee files with all my sites, so if you go into YourZeroNetFolder/data/1K28kQFMquNzto2iQf4GGjr6oFUbC1NddE you will find all of the uncompiled source files for ZeroPolls.",
			"post_id": 10,
			"date_added": 1457387518
		},
		{
			"comment_id": 20,
			"body": "> [poltechgnos](#comment_1_1BKURP8uJbQhPam8ub2ddqAXPgkmyAjpMR): I too shall call them dragons Khaleesis\n\nI get the reference, but I have to admit I've only watched the first 6 or so episodes of Game of Thrones, I just couldn't get really into it. Maybe the next time I try it'll work out :) I also never watched Lost, shame on me! And The Walking Dead was too brutal, I just couldn't... Don't judge me! :P Did play the first 3 episodes of the game though, video game violence I can deal with better.\n\nOh and yes they are vicious little buggers, those ~~bugs~~ ahem dragons, I'm tracking down two right now and then there shall be an epic fight, bards will sing about it for years to come.",
			"post_id": 10,
			"date_added": 1457393175
		},
		{
			"comment_id": 21,
			"body": "> [kaffie](#comment_1_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): In safari/osx the polls don't wrap the site correctly, and they veer off into the far right, making it really unusable. Fix soon?\n\nWeird, in Chrome it works fine and they both use WebKit. I don't have a Mac so I can't try it out myself, but I'll add a few vendor prefixes in the CSS, maybe Safari is a bit lagging behind Chrome and Firefox and still needs those.\n\nIf possible a screenshot would be great so I can better see what the problem is. And you do mean the whole poll, not the text or anything like that but the whole white box a poll is in veers off to the right without wrapping?",
			"post_id": 10,
			"date_added": 1457397161
		},
		{
			"comment_id": 22,
			"body": "> [kaffie](#comment_2_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Clearnet link for a screenshot of what's happening: http://i.imgur.com/nbO9Aud.png\n> Also, I went ahead and checked with chrome, it indeed works there. So I guess it's just a safari issue.\n\nI just pushed a new update which removes the flickering when polls are updated in real time and I added the vendor prefixes, give it a try, maybe it works now :) Might have to clear the cache to get the new css to display (Hold shift and click the reload button in Safari, according to Wikipedia that ignores the cache when reloading a site).",
			"post_id": 10,
			"date_added": 1457398215
		},
		{
			"comment_id": 23,
			"body": "> [kaffie](#comment_3_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Hmmm... It's still doing it. I tried shift+reload, reloading, incognito/private mode, etc. Doesn't work.\n\nThen I either haven't added all the necessary vendor prefixes yet or your version of Safari is too old. Is it at least version 6.1? That one does in theory support all the features I make use of, as long as the right vendor prefixes are used.\n\nI'll try to look over it again tomorrow, maybe I forgot to add a prefix somewhere or made a typo.",
			"post_id": 10,
			"date_added": 1457400844
		},
		{
			"comment_id": 24,
			"body": "> [kaffie](#comment_4_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): \"Version 9.0.2 (11601.3.9)\" from the about section. Perhaps the cache hasn't caught up yet? I've had similar problems when working on Kaffiene. Where the site won't update in the cache for a while...\n\nCould be, the cache is a bit weird sometimes. When I made some changes to the CSS earlier today, I closed the web inspector and suddenly all changes where gone. Opened it, there they were again. Closed it, gone. So it used the cached css whenever the inspector got closed, was really weird. Don't remember what fixed it, either restarting ZeroNet or signing the website again.",
			"post_id": 10,
			"date_added": 1457401138
		},
		{
			"comment_id": 25,
			"body": "> [hello](#comment_1_15YUzYgogtiHYqXP5HXtdLS2dLZuxnvuRQ): Nice work!Please add body { backface-visibility: hidden } to sites you developing, it solves some scroll preformance issue with Chome.\n\nCool, thanks, just added it to ZeroPolls :) I'll add it to ZeroQuotes and ZeroTodos in their next update.",
			"post_id": 10,
			"date_added": 1457440756
		},
		{
			"comment_id": 26,
			"body": "> [nippletwister](#comment_11_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Yes, it looks amazing now!\n> About throwaway ZeroIDs... I think the very idea of polls may become useless with the sybil attack issue. Maybe we need something like Proof of individuality here.\n\nTrue, hadn't thought of that. So it would be better if you couldn't create any number of ZeroIDs but still more than just one. So if there is more than one ID provider (right now ZeroID.bit is the only provider) it would be better. Someone is working on it, already has a prototype, it uses Bitcoin-JS to create the IDs decentralized as far as I understand, didn't have time yet to look at it in detail but sounded really cool. Here is a test site for it: http://127.0.0.1:43110/16KzwuSAjFnivNimSHuRdPrYd1pNPhuHqN\n\nSince a ZeroNet site can define which ID provider it wants to allow, I could choose 2 or 3 for ZeroPolls so you can have a separate identity to your main identity but could at most vote 2 or 3 times if you tried to game the system, but could not create a thousand accounts and vote a thousand times to really make a difference.",
			"post_id": 15,
			"date_added": 1457549695
		},
		{
			"comment_id": 27,
			"body": "> [vethit](#comment_1_1JdKZXpUz9vvevT99mmfTdbs3hjszJzqDX)\n\nYeah with the multi user plugin you have to copy & paste a private key in to the UI every time you want to switch accounts, right? Like it works on ZeroNet proxies?",
			"post_id": 15,
			"date_added": 1457559615
		},
		{
			"comment_id": 28,
			"body": "> [nippletwister](#comment_12_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): In order to prevent spam with multiple IDs some cryptocurrencies could be used. The same way as it is done with ZeroName for domains registration.\n\nZeroName works through a central server/node, you can make it work decentralized, there is a plugin for that in the plugins folder, but then you need to spend hours/days downloading the Namecoin blockchain. Blockchains are huge and cumbersome, sadly, don't scale well.",
			"post_id": 15,
			"date_added": 1457560808
		},
		{
			"comment_id": 29,
			"body": "To the person who donated 0.2 BTC to me yesterday, you are nuts. Amazing and generous, but nuts. Thanks! That was a huge surprise.\n\n> [odd](#comment_2_1EMpuiFM1NLZmAVyoAWnwi8VwiZVV4dcnN): It's possible to donate directly to a site address and the site owner can import the private key into bitcoin to receive the funds. It's probably a bit technical though for authors to go through the private key import process.\n\nI thought about doing that at first, it doesn't seem to be that hard and maybe in the future ZeroNet can make that easier, in the interview with nofish in an article that was published shortly after the Torrentfreak article, I believe he said it's a possibility to build a Bitcoin wallet right into ZeroNet at some point to make this really simple. But I decided against it for now because then I'd have to give people a different address for every one of my ZeroNet sites and I wanted it to stay on my blog for now, not cluttering up the UI of the sites themselves, or putting it too much in the face of people.\n\nI always feel bad about accepting donations. I shouldn't of course, like I said in the blog post hard work should be rewarded and getting into the habit of donating and being donated to might in the long term let us create a better internet without the privacy invasion and making people buy things they don't even want or need of advertising, but I still always feel a little bad about it, as if I'm telling people give me money or else you won't get anything from me, even though I would still make ZeroNet sites with no donations at all because I love doing it.\n\nAlso, security implications. If the ZeroNet dev ever fucks up and leaks the private keys of ZeroNet sites through a bug in ZeroNet, and that can always happen, we are all just human, someone could just empty your wallet. We have to keep in mind ZeroNet is only version 0.36 right now, we cannot expect perfect security this early, that would be putting an unfair amount of responsibility on poor nofish's head :) I know the Bitcoin devs had to deal with that when they kept telling people not to use it with real money yet because it's too early but nobody listened and of course people lost money.\n\n> [cub3](#comment_2_1LRrd96P7FiTcsyNXVzPM5jtpQoH1B4gYf): It's impressive what you have achieved with ZeroPolls so far. Well done!\n\nThanks! :) It's all built on the things I learned while making ZeroQuotes and ZeroTodos. No idea what my next ZeroSite is going to be (and yes there are going to be more), but my todo list already has half a dozen ideas. I'm also completely rewriting ZeroQuotes at the moment to make it use Vue.js so all my ZeroNet sites use the same JavaScript framework so that I can share code easily between them. Things like the data usage display are the same on all of my sites for example, doesn't make sense to rewrite that every time I make a new site :)",
			"post_id": 16,
			"date_added": 1457695065
		},
		{
			"comment_id": 30,
			"body": "> [erkan](#comment_1_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): \"there's now another ID provider at ZeroVerse.bit\n\nHi, sorry for not replying earlier, I must have overlooked this comment in my ZeroHello newsfeed. This sounds like a cool project which would solve the throwaway ZeroID for voting issue, I'll have to check out Bitmessage, never used that before. When I've done that and if it all works well I'll add it to ZeroPolls :)\n\nAnd yeah, sites do have to add support for a ZeroID provider manually before it works on that site, so that the site owner can decide for himself which ZeroID provider he considers trustworthy I assume.\n\nCan people create more than one ZeroVerse.bit ID? Or is it like ZeroID.bit where you can only have one? That is important for ZeroPolls so that people can't create a hundred accounts and vote a hundred times.",
			"post_id": 15,
			"date_added": 1457700741
		},
		{
			"comment_id": 31,
			"body": "> [erkan](#comment_3_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): Now that I have commented on polls with text that doesn't fit, I'd need a delete/edit button. I should have started those comments with: \"Testing new comment feature, please ignore!\". Probably a feature for moderators to do the same would be nice also\n\nThanks for testing and finding these issues! :) I'll fix that text bug so long sentences are broken up and add a delete button. Edit button I'll add in a later update.\n\nBy the way, since you added quite a few comments, did the animation when you added comments play for just that new comment (like it should be) or did it always play for all comments again on a poll when you added a new comment? That gave me trouble yesterday, it should be fixed but I wasn't 100% sure. That's the peril of using a framework, you don't know how it works it's magic :)",
			"post_id": 20,
			"date_added": 1457867739
		},
		{
			"comment_id": 32,
			"body": "> [nippletwister](#comment_13_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): That is amazing! IMHO, next best feature to add would be an ability of modifying the poll by its author: rephrasing, deleting or adding new options to it. After a poll was edited users which have already voted on it see a notification with suggestion to change their vote.\n> It is really often situation when you add new poll and then suddenly realize that you forgot to add some options to it.\n\n> [basxto](#comment_1_1PVcdu7USZH2kHMETbqDYLPjJZKCDWM52k): You would need to discard the old votes, otherwise you could fake polls easily. This would need to save the voting time for every vote.\n\nI might allow editing polls at some point, I've been thinking about that since I started working on ZeroPolls. My idea was that I'd add a cryptographic hash for every vote (calculated from a concatenation of the question and the answer) which makes sure the question and the answer voted on is still the same as of the time of voting, if not, it is not counted and you can vote again. Adding more options would work as long as they are added at the end, not somewhere in between, because I actually use the order of the answers as an index for the votes, saves space and is more efficient.",
			"post_id": 20,
			"date_added": 1457868273
		},
		{
			"comment_id": 33,
			"body": "> [erkan](#comment_4_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): animation: I remember it, but I don't remember if it animated for each of them :-( I didn't have my coffee yet\n\nWhich reminds me it is time for my second cup of coffee this morning! :) Well, noon. But I worked on the comments till 5 am so it is morning now! :P",
			"post_id": 20,
			"date_added": 1457868418
		},
		{
			"comment_id": 34,
			"body": "> [erkan](#comment_5_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): oh, such a long night... enjoy your coffee!\n\nThanks ;) Deleting comments works now (button in the top right corner of comments) and long text is broken up so it doesn't overflow anymore.\n\nI've also disabled the comment animation for now while I figure out what the problem is, it did not work right and played whenever someone voted or submitted a comment. Really weird since it works exactly the same as the animation for polls and there it works fine. It's probably something so obvious that I can't see my error! :)\n\n**Edit:** Fixed the problem now, comment animations are back in. Looks like Vue.js can only track changes to main data nodes not sub nodes when rendering lists, when I turned the comments into a main node it all worked like it should :)",
			"post_id": 20,
			"date_added": 1457873722
		},
		{
			"comment_id": 35,
			"body": "I'm away for a couple of days and this is what happens. So many comments! :P\n\n> [erkan](#comment_6_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): small text change: on the main page where all polls are shown: the comment summary says \"1 comments\". Could be better like: \"1 comment\" or \"\"1 comment(s)\"\"\n\nYes that is pure laziness on my part :) Will be fixed sometime (TM), probably very soon. Same for vote/votes.\n\n> [erkan](#comment_7_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): Also, I'd like to have the \"8 comments\" clickable: meaning, when I click on it, it opens the comment section. At begin, my mouse always moved automatically to there to open the comments\n\nYeah that should be a link, the reason why I didn't do it is nonsense really if I think about it now, will add that in the next update :)\n\n> [erkan](#comment_9_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): Also, it'd be great to have a summary of the ongoing things people reported (status of those then would also be nice, but not necessary)\n> If something is reported, I don't need to report again.Also, I'd save me the time to read through all the various blog entries for ZeroPoll and their comments\n\nThat is actually a feature planned for ZeroTodos. I will add public readable todo lists that you can share through a link with people, just like you can share polls. Then I will make my todo lists for ZeroQuotes, ZeroPolls and ZeroTodos public so you can see what features and bugs I'm working on.\n\n> [erkan](#comment_10_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): While making this (1) I wished there would be multi-select of answers possible (not only selecting 1 answer)\n> (1) http://127.0.0.1:43110/1K28kQFMquNzto2iQf4GGjr6oFUbC1NddE/?Poll:4-1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf\n\nMulti-select is coming, was always a planned feature but I didn't get to it yet :)\n\n> [erkan](#comment_11_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): I'd like to make available some additional info via tooltip or so, see (1) I am doing it with saying, \"look in comments\". I did it like that, because I thought, too much text will bother people too much. Now they have to additonally click somewhere to read first, before voting. (1) http://127.0.0.1:43110/1K28kQFMquNzto2iQf4GGjr6oFUbC1NddE/?Poll:4-1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf\n\nThat is a nice idea, didn't think of that. Yeah that could be really useful. I could add a little note icon to answers if there is additional info and then if you hover over that more info is shown.",
			"post_id": 20,
			"date_added": 1458587214
		},
		{
			"comment_id": 36,
			"body": "> [erkan](#comment_13_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): Is this normal? I can not comment without voting? see here\n\nJust tried, it worked fine for me. I'll try it through a proxy later (have to go now) with a different ZeroID in case it only works with my account for some reason. You didn't hit the data usage limit by any chance? If so I'll raise the default, 30kb seems too low with commenting now enabled, I've nearly reached it myself.",
			"post_id": 22,
			"date_added": 1458834449
		},
		{
			"comment_id": 37,
			"body": "> [erkan](#comment_14_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf)\n\nAh alright I will try that when I get back in a few hours. I did change the code for the poll pages in the update so I probably forgot to change something there. It used to be that displaying a poll page would still load all polls in the background, just hidden from view, I changed it so that only the one poll that is shown is loaded, as it should be.",
			"post_id": 22,
			"date_added": 1458835189
		},
		{
			"comment_id": 38,
			"body": "> [erkan](#comment_14_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf):\n> I created the poll, but didn't vote\n> but the comment section was just black\n> as I voted: comment section showed fine + I could comment\n\nFixed, should work fine now, it did in my test after I was able to reproduce the problem exactly like you described.\n\nThe SQL query didn't work for a very peculiar reason when there are 0 votes and only one poll is retrieved (it does work fine with 0 votes and multiple polls). Don't understand why, have to learn more about SQL :)",
			"post_id": 22,
			"date_added": 1458849367
		},
		{
			"comment_id": 39,
			"body": "> [nab](#comment_1_1KVbKJBqXdkUr4ogZGJEjDFsm2y9vtX8Bj): infinite scrolling is the worse idea ever. It's even worse on zeronet. just put a fucking next button.\n\nNo idea why you would prefer a well to running water, but I do plan to add settings to ZeroPolls anyhow, then you can choose to give progress the finger and click on buttons instead ;)",
			"post_id": 22,
			"date_added": 1458888323
		},
		{
			"comment_id": 40,
			"body": "> [proba](#comment_1_1KkMG9dp4HYwhmjGZJYgUcKS3aV1AmfxYq): Wow! That was fast.I guessed, it was a rounding related thing.\n> Sorry, for giving you feedback via a poll, but I thought it will be more fun this way. \n> By the way ZeroPolls is a cool Zite, one of my favorites.\n\nThanks! :) Giving feedback via a poll is fine, there are quite a few of those already and I do take them into account when working on new features or improvements. Can be really helpful to see if a suggested improvement is really something a lot of people want or if most want it to stay how it is.",
			"post_id": 25,
			"date_added": 1459306206
		},
		{
			"comment_id": 41,
			"body": "> [erkan](#comment_15_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): \"Raised the default data limit to 100kb\": +1\n\nI was at nearly 50kb :) When I run into the limit of my own sites I usually raise the default instead of just my own, because if it happens to me so fast, it'll happen to others as well. Now I only need more ZeroMail storage, had to delete so many messages but I'm at the limit again! :)",
			"post_id": 26,
			"date_added": 1459419876
		},
		{
			"comment_id": 42,
			"body": "Updated the update description to add ONE MORE THING (TM). The statistics at the top of the site now also show the number of users. We're at 212, yay!",
			"post_id": 26,
			"date_added": 1459424395
		},
		{
			"comment_id": 43,
			"body": "> [binchan2](#comment_1_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h): Welcome back :) If in future some interviewer asks you why there is a blank period in your resume, just tell him that it's the time when you were in love ;)\n\nThanks, glad to be back! Not sure that excuse works. Maybe like this \"I was young! I wanted to see the world! So I traveled all over Europe for a year  and eventually fell in love... with the idea of working for your company, so I came back!\" ;)",
			"post_id": 27,
			"date_added": 1507276731
		},
		{
			"comment_id": 44,
			"body": "> [gomzik](#comment_6_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): I very much in this doubt. It does not seem that Google at all strongly puts on Dart\n\nI can only go by what Google themselves say, they've been heavily pushing Dart + Flutter and that's also the language and framework used to create apps for Fuchsia, that's been widely reported and Google employees have also mentioned it in videos. Google also said their main income comes from Dart at this point. It's not as popular outside of Google (although popularity has increased dramatically last year) but inside of Google it's being used for their most critical apps, everything that actually makes them money, like AdSense. Maybe Fuchsia will support other languages at some point, but that is speculation, right now it's all Dart+Flutter apps.",
			"post_id": 28,
			"date_added": 1507916027
		},
		{
			"comment_id": 45,
			"body": "> [cadenoro](#comment_1_1vAdpJiyYEHcDZoJn93QcjzaFVKHHPg1F): Perhaps Go rather than dart?\n\nNo, it's Dart alright, but you'd think that it would be Go since it is so much more popular outside of Google. It's going to be interesting to see if Google will finally manage to make Dart popular with this move, they've apparantly tried and failed for years and some people already thought it dead but now they're back in full force on making it popular. But it's of course totally possible that they give up at some point and just go with Go. Ha! Go with Go :D",
			"post_id": 28,
			"date_added": 1507916395
		},
		{
			"comment_id": 46,
			"body": "> [gomzik](#comment_5_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Welcome back, commander!\n\nHaha, thanks! X-Com 2 is great by the way. Haven't played any of the older titles, but X-Com 2 I got a bit addicted to for a while. The character customization alone can keep you occupied for hours! And then your best soldier dies and you reload a save game three times until she finally survives. Grrrr. Now I remember why I haven't played it in a while! :)",
			"post_id": 27,
			"date_added": 1507917053
		},
		{
			"comment_id": 47,
			"body": "> [cadenoro](#comment_2_1vAdpJiyYEHcDZoJn93QcjzaFVKHHPg1F): You know far more about this subject than me and spend more time considering the \"what\" and \"how.\" Dart programmers will likely thank you; I prefer Perl, Mathematica, Maple and the like, :)\n> Best of luck with your project.\n> Is mise le meas.\n\nThanks! I'm still learning everything myself, I just watched a lot of Google Developer videos and interviews with Google employees on the Dart team over the past week, that's the only reason why I know a little about that stuff in the first place :)\n\nHaven't used many languages yet, so I don't know Perl and the others you mentioned, it's just a hobby for me, I don't have a degree or anything and Mathemathics never returned any of my calls in school. JavaScript + CoffeeScript is what I'm most comfortable with, or rather was, haven't done much programming over the last year. Looked a bit into Go and Python before (Python would be neat to know since that's what ZeroNet is written in), but most of that still goes way over my head. With Dart I might be able to start writing some small apps for my Android phone now which would be cool! :)",
			"post_id": 28,
			"date_added": 1507920842
		},
		{
			"comment_id": 48,
			"body": "> [cadenoro](#comment_3_1vAdpJiyYEHcDZoJn93QcjzaFVKHHPg1F): You may find an MIT project, App Inventor, of interest. Simply, a Web based GUI interface to a programing environment for Android. You do not use a programing language, more like assembling a puzzle where the pieces represent program constructs. http://appinventor.mit.edu/explore/front.html\n> Is mise le meas.\n\nThanks for the tip! I've tried something similar before, SketchWare, which you can use directly on your Android phone/tablet. It's quite neat since you don't even need a computer then and the puzzle piece programming works even on a tiny screen with no keyboard, but it was ultimately too basic and much slower than just typing code. Google's Flutter is really easy to use, feels a lot like web development, but has none of the limitations so it seems to be the perfect tool for me so far :)",
			"post_id": 28,
			"date_added": 1508007593
		},
		{
			"comment_id": 49,
			"body": "Looks like there were two bugs in the first release, they are fixed now, so the site should now work for everyone.\n\nThe issues only showed up when you have never saved a todo list before, so I didn't notice it during my testing. The Save button got stuck on \"Saving...\" because I used the fileGet API command from ZeroNet to load saved todos without turning the \"required\" setting off. With it turned on, ZeroNet will keep trying to sync the file which interfered with the actual \"fileWrite\" command trying to create the file in the first place! :) Sounds insane? It was.",
			"post_id": 29,
			"date_added": 1508332763
		},
		{
			"comment_id": 50,
			"body": "> [cadenoro](#comment_4_1vAdpJiyYEHcDZoJn93QcjzaFVKHHPg1F): A question, as I know very little about Dart. Based on your experience, why use Dart rather than Javascript?\n> Is mise le meas.\n\nThe original goal for Dart as I understand it was to replace JavaScript which was quickly hacked together in a week or two, with a more well thought out language that fixes the issues with JavaScript, takes the best concepts from languages created over the years (mostly from a language called Smalltalk), and design it specifically to run as fast as possible inside of a virtual machine because it's getting harder and harder to make JavaScript faster in browsers, JavaScript just was not designed for what it's being used for today.\n\nMicrosoft and Mozilla (the two other big browser vendors) didn't want to cooperate with Google though despite them giving up control over Dart to a standards committee, understandable albeit unfortunate, so Google had to scrap the idea of Dart replacing JavaScript in web browsers and now just compiles it to JavaScript like most languages do, which means it's not faster anymore (in the browser) but still has all the other improvements.\n\nAs for why use Dart instead of JavaScript? They are very similar, not just the language but also the ecosystem. Instead of node.js to write server side and command line apps you've got the Dart VM, instead of npm for package management you've got pub. Instead of something like React Native for mobile development you've got Flutter. So Dart has all of that in an improved form and since it's made by one entity, Google, and everything was built to work together (for example when the team who made Flutter needed changes in Dart, the Dart team made those changes to the language), everything naturally does work much better together, Dart basically comes with batteries included it does everything you need out of the box. So if the choice is between Dart and JavaScript it's not really a hard choice, Dart wins hands down.\n\nThe more interesting question though is how Dart compares to other JavaScript competitors, there are probably a hundred now, and there I can't tell you much because I only really know CoffeeScript well. How does Dart compare to it? It's better IMHO, but CoffeeScript has a nicer syntax (Python like), but that depends on your taste/personal perference. And interacting with JavaScript is easier in CoffeeScript since it's not really a new language, it's just a new syntax. In Dart you have to add types for everything you want to use like in Microsoft's TypeScript. You can however automatically compile a TypeScript file for a JavaScript library if it exists, so you can profit from both the Dart and the TypeScript community's work.\n\nSo far I found working with Dart really nice, much nicer than CoffeeScript/JavaScript. The types really help a lot in figuring out how stuff works, and the IDE shows you not just what you did wrong but also often how to fix the problem, live while you write code so you don't even have to compile first. Flutter is amazing. Feels easier to use than even web development is but you get native mobile apps as a result (no web views, no virtual machine), I'll be continuing to use Dart for that reason alone.\n\nAngularDart for web development I don't really like yet, I much prefer Vue.js (although components are a lot easier in AngularDart, you don't need to use something like webpack). Maybe it will grow on me. It seems to be a case of \"it makes simple things hard and hard things simple\". It definitely needs better documentation. Some of the code examples are outdated and don't work anymore (unless I did something wrong). I think Google is so focused on Flutter right now they forgot a bit about AngularDart because not many people use it outside of Google. Someone from Google is already working on an unofficial web version of Flutter though, so maybe I'll switch over to that when it's ready :) ZeroDart would work with it too, I developed it independently from AngularDart.\n\nOut of the box, without AngularDart, you can use Dart for web development as well. It has a lot of nice additions that basically make it comparable to JavaScript + jQuery. So you don't have to use any framework at all with it if you don't want to, ZeroDart also works just fine that way.\n\nThe only real drawback that I can see to Dart right now is that the community is tiny so you have to figure out things on your own, you can't just look something up in a thousand places like you can do with JavaScript. That also makes it kind of exciting though! :D Forces you to learn. So probably not that great if you just need to get things done, quickly. Flutter might make it more popular in time.",
			"post_id": 29,
			"date_added": 1509327283
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}