{
	"next_comment_id": 14,
	"comment": [
		{
			"comment_id": 1,
			"body": "podpinam się do zapytania @driud nie chce się aktualizować ani na windowsa ani na debianie.",
			"post_id": 15,
			"date_added": 1583406995
		},
		{
			"comment_id": 2,
			"body": "Witaj, zapoznałem się z tym serwerem w pierwszej chwili pomyślałem \"super sprawa!\" lecz po głębszym zastanowieniu zacząłem myśleć o tym czy przez taki krok nie stracimy użytkowników którzy jednak są \"zmuszeni\" do instalacji zero netu czyli podjęcia jakiegoś działania \n\nPlusem+ tego jest łatwa dostępność z każdego urządzenia i wszędzie, wystarczy pisać adres i gotowe.\nJednak wielkim minusem wydaje mi się to że użytkownicy którzy powinni zainstalować zeronet i jednocześnie pomagać w udostępnianiu stron wybiorą tą łatwiejszą opcje...\n\nidą zeronetu (o ile dobrze ją zrozumiałem) było to że nie ma serwera dzięki czemu cząstki materiałów wideo czy stron są przechowywane u wielu ludzi na komputerach co się równa temu że jeśli jedna czy dwie osoby wypadną z tej sieci to dany materiał itp nie zostaną utracone. \nJeśli jest serwer i ludziom będzie wygodniej tam wchodzić to wystarczy go wyłączyć i materiały przepadają... nie ma do nich dostępu, ponieważ nie zostały rozpowszechnione do innych ludzi za pomocą sieci p2p i nie ma ich na innych komputerach.\n\nbyć może się mylę i błędnie interpretuję Twój pomysł jeśli tak to popraw mnie i wytłumacz mi Twoje zamiary.\n\n\n\n",
			"post_id": 13,
			"date_added": 1583684408
		},
		{
			"comment_id": 3,
			"body": "i bardzo dobrze, serwer przeczy działaniu zeronet to ma się odbywać tu i być przechowywane miedzy ludźmi w p2p",
			"post_id": 17,
			"date_added": 1613064465
		},
		{
			"comment_id": 4,
			"body": "> [tajny2z@zeroid.bit](#comment_1_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr): \"> trueerin@zeroid.bit: \n> \n> A czy nie jest tak ze ci ktorzy zainstaluja zeronet beda tworzyli siec kopi a przelotni uzytkownicy przez serwer proxy beda zwiekszac popularnosc zeronet co da wieksza liczbe instalujacych zeronet? Realistycznie: Ile osob uzywa YouTube, a ile tworzy kanaly i udostepnia 'kopie' materialow na YouTube?\n> Dzieki tym przelotnym ilu nowych 'tworzacych'? Swoja droga instalacja zero np na windowsie jest bardzo latwa. Ale trzeba jednak troche danych sciagnac.\n\ndokładnie o to mi chodziło, sorry że odpisuje niemal po roku hehe",
			"post_id": 13,
			"date_added": 1613064613
		},
		{
			"comment_id": 5,
			"body": "jeśli sieć tor to fikcyjna prywatność to po co spowalniać sieć ? tak tylko pytam, pozdro.",
			"post_id": 19,
			"date_added": 1613494766
		},
		{
			"comment_id": 6,
			"body": "> [krzotr@zeroid.bit](#comment_7_1Jgcm8RpHNjFQjthZWfLHi6QdeqU5b7N4F): W poście wyraźnie zaznaczyłem zwiększyć prywatność, nie napisałem zachować w pełni prywatność. Jest to zasadnicza różnica. Użytkownik ma prawo wyboru czy wymusić połączenia z użyciem Tor bądź nie.\n\njak widać w ustawieniach tam jest jeszcze jedna opcja tora na dodatkowe spowolnienie\npoza tym nie wyczerpuje to mojego zapytania bo nadal uważasz że tor zwiększa prywatność a są przesłanki że jest to ściema - nie Twoja, nie atakuje Ciebie tylko próbuję się dowiedzieć czy faktycznie tor cokolwiek pomaga...\n",
			"post_id": 19,
			"date_added": 1613495769
		},
		{
			"comment_id": 7,
			"body": "> krzotr@zeroid.bit Domyślnie w kliencie ZeroNet Tor jest włączony.\n\nwydaje mi się że powinieneś dodać info że domyślnie w kliencie windows chyba że coś się zmieniło i w linuxie też zaimplementowano w wersji 7.x.x +\n",
			"post_id": 19,
			"date_added": 1613511629
		},
		{
			"comment_id": 8,
			"body": "> [pizz@zeroid.bit](#comment_2_1GcPQswRskdfDPjH9jihgBWpJFGgLHLaC8): do linux debia prosze tez\n\nmasz racje, pamiętajmy że coraz więcej ludzi korzysta z linuxowych systemów\n@krzotr, pamiętaj o tym przy nowych publikacjach na blogu, z góry dzięki :)",
			"post_id": 14,
			"date_added": 1613683702
		},
		{
			"comment_id": 9,
			"body": "zrobiłem testy na debianie, nie potrzeba osobno pobierać kodeka *(prawdopodobnie jest w paczce)* by ściągać `18 360p` *(nie oszukujmy się na monitory większej rozdzielczości nie potrzeba)* \nco istotne jak pobierzemy na debian [stąd](https://packages.debian.org/pl/sid/all/youtube-dl/download) z rozszerzeniem instalacyjnym tego systemu *(deb)* to po instalacji, w głównej konsoli wystarczy użyć kodu  `youtube-dl -F link_do_filmu` lub jak wyżej krzotr napisał `youtube-dl -f 18 link_do_filmu` *(dla 360p)*   -  ***chodzi mi o to że nie trzeba przechodzić terminalem do rozpakowanego folderu i dopiero tam używać `youtube-dl` tak, jak było w innych instrukcjach na linux***.",
			"post_id": 14,
			"date_added": 1613719286
		},
		{
			"comment_id": 10,
			"body": "> [arione@zeroid.bit](#comment_8_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY): Zależy czyj. Ważny materiał powinień być zachowany i łatwo dostępny i nie szkodzi jeśli to 360. Dla mnie kiedyś 240p był potrzebny tak słaby sygnał miałem. To jest taktyka i logistyka.\n\nWięc sprawdzasz używając parametru `-F` i stosujesz z `-f` dla 720p np. 22 o ile dostępne.",
			"post_id": 14,
			"date_added": 1613743008
		},
		{
			"comment_id": 11,
			"body": "widzę po wstawkach głównego wstawiającego że na youtube PL są wrzucane głównie 360p i źle ich się nie ogląda, dostępność dzięki temu też jest lepsza przy tak małej ilości ludzi...",
			"post_id": 14,
			"date_added": 1614085364
		},
		{
			"comment_id": 12,
			"body": "dlatego też, mam ciągle tego wątpliwego tora włączonego chociaż \"usługodawca\" mniej widzi... a ostatnio mi coś przez telefon pier.... o telemetrii za mniejszy rachunek.... wyśmiałem ich.",
			"post_id": 23,
			"date_added": 1614454071
		},
		{
			"comment_id": 13,
			"body": "fajnie ale laik i tak nie wie o co chodzi, pozdro.",
			"post_id": 24,
			"date_added": 1615629893
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"20": 1
	}
}