{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1566034184,
			"title": "the EU is FUCKING us",
			"body": "few things that i noticed\n\n- GDPR\n- Article 13\n- End of the 500 € note\n- Buying and Selling cryptocurrency becomes more and more difficult\n- The limit for anonymous precious metals purchases has been lowered drastically in almost every EU country\n- Additional fee for cash payments is being considered\n- You need verify yourself with a picture of your face and your ID in order to get a phone number\n- Fingerprints will become mandatory in ID cards",
			"added": 1566034183
		},
		{
			"topic_id": 1566289473,
			"title": "i've just made 3 SEPA transfers",
			"body": "and it required me to solve Google's Recaptcha and entering about 10 TAN's all sent via SMS\n\nWELL DONE EU !",
			"added": 1566289471
		},
		{
			"topic_id": 1566291581,
			"title": "what do you think about school?",
			"body": "i would like to hear your opinion about school.\n\nAlthough i had good grades back then, i always hated it and have had problems listening to teachers because to me it was nothing but remembering boring bullshit that i forgot weeks later.\n\nIsn't it just a prison for kids? You learn to do something boring repeteadly as long as possible.",
			"added": 1566291578
		}
	],
	"topic_vote": {
		"1566375802_1C7X6AtuFz4ARoxZAj1XaEjPprGoz6o2Vn": 1
	},
	"next_comment_id": 35,
	"comment": {
		"1566034184_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F": [
			{
				"comment_id": 1,
				"body": "> [undisclosed](#comment_48_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK): (((Who))) runs the conversion business between crypto and cash?\n\nthere was BitPay\n\nhttps://cointelegraph.com/news/bitpay-says-it-has-paused-processing-bitcoin-payments-in-germany",
				"added": 1566034967
			},
			{
				"comment_id": 2,
				"body": "> [undisclosed](#comment_49_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK): You might have misunderstood my sarcasm.  How much spread (juice, vigorish, cut, charge, etc.) do you forfeit when cashing out of crypto into the form of money the local food store will accept?\n\nidk 2 % - 3 %",
				"added": 1566037160
			},
			{
				"comment_id": 3,
				"body": "https://www.telegraph.co.uk/personal-banking/current-accounts/eu-rules-mean-might-cut-online-banking-unless-have-mobile-phone/",
				"added": 1566037270
			},
			{
				"comment_id": 4,
				"body": "the EU seems to be at war against its own people",
				"added": 1566037435
			},
			{
				"comment_id": 5,
				"body": "> [undisclosed](#comment_50_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK): It's a much larger spread where I am.  Anyhow, my point was which ethnic group primarily owns the currency conversion process, and why currency conversion for profit in the first place?\n\nI'm not converting it to Cash, BitPay was doing it, and they charged a fee for their service. Since they stopped their service here i don't think Crypto can be used to buy things easily.",
				"added": 1566039053
			},
			{
				"comment_id": 6,
				"body": "> [numismatist](#comment_39_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy): Hm interesting. What is the limit these days?\n\nGermany has lowered it from 15000€ to 10000€ and from 2020 it is 2000€\n\nidk the exact limits for precious metal purchases in other EU countries, however most of them do have a cash payment limit",
				"added": 1566115841
			},
			{
				"comment_id": 7,
				"body": "https://ec.europa.eu/info/consultations/eu-initiative-restrictions-payments-cash_en",
				"added": 1566115923
			},
			{
				"comment_id": 8,
				"body": "> [xcape2net](#comment_332_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): What people don't seem to realize is that to kill crytocurrencies, all a government has to do is make it illegal to exchange it for fiat currency.  Then, for all practical purposes, no one can use it, because no one can get any of it.\n\nCryptos can be used as an economic weapon by governments against other governments. Should the US make them illegal i'm sure their enemies will then become crypto friendly.",
				"added": 1566198653
			},
			{
				"comment_id": 9,
				"body": "A way better solution would be to simply allow anonymous crypto and precious metal trades and charge a fair amount of tax. Most people won't have a problem with 3% - 5% tax when converting it to fiat.\n\nBut this is something you cannot expect from those motherfuckers. They rather declare war on their own people and ruin everything rather then getting a little less revenue.",
				"added": 1566200282
			},
			{
				"comment_id": 10,
				"body": "> [xcape2net](#comment_326_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): This is an indication that fiat money is actually worthless.\n\nIt is indeed worthless toilet paper. Even North Korea is capable of producing billions of undetectable counterfeit US dollars.",
				"added": 1566207330
			}
		],
		"1566289473_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F": [
			{
				"comment_id": 11,
				"body": "> [okdude](#comment_8_1PLAQpocjo8gqX6DmtFDij9pcrEx8RbCUr): I can demand companies delete secret dossiers about me that would make the STASI drool? [...]\n\nwe need a chip implanted !!!!!!!",
				"added": 1566292758
			}
		],
		"1566291581_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F": [
			{
				"comment_id": 12,
				"body": "Kids get programmed in school to become a robot as an adult. I honestly think school is intentionally made boring because your future job will most likely be boring too.",
				"added": 1566296168
			},
			{
				"comment_id": 13,
				"body": "> [okdude](#comment_9_1PLAQpocjo8gqX6DmtFDij9pcrEx8RbCUr): Well, there's your answer. \"Modern\" schools are a relic from when the masses needed to be mindless factory drones. That's why you learn to memorize rather than think. That's why you learn to sit down and respect authority rather than stand up to injustices.\n\nLearning to respect authority doesn't require a kid to be locked in a room for 10+ years 6-8 hours per day",
				"added": 1566297707
			},
			{
				"comment_id": 14,
				"body": "> [xcape2net](#comment_340_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): The only thing that has changed is that instead of mindless factory drones, they now want mindless office worker drones.  Rich people's kids are taught how to think, and poor people's kids are taught how not to think.\n\nexactly",
				"added": 1566298902
			},
			{
				"comment_id": 15,
				"body": "> [watteau](#comment_86_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o): In return they are given an automobile and are fed and clothed. They have a television or games console for recreation and may go on a holiday a year.\n\nHaving a console, TV , car , 2 weeks holiday, even a huge house doesn't mean anything, especially not if someone has to waste 60 years of their life doing boring things",
				"added": 1566302242
			},
			{
				"comment_id": 16,
				"body": "> [xcape2net](#comment_340_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): The only thing that has changed is that instead of mindless factory drones, they now want mindless office worker drones.  Rich people's kids are taught how to think, and poor people's kids are taught how not to think.\n\nwhats so ironic is that rich people's kids are the unhappiest from my experience",
				"added": 1566302314
			},
			{
				"comment_id": 17,
				"body": "> [watteau](#comment_87_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o): Are you some sort of nihilist?\n\nidk, could be ;)\n\nbtw. i have all those things and it didn't made me a happier person",
				"added": 1566303068
			},
			{
				"comment_id": 18,
				"body": "> [watteau](#comment_88_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o): It was a 'thing' recently, a lot of Generation Y turned around in their mid-thirties and realised their jobs were actually pointless.\n\nJoke aside, i'm Generation X-Y, in my late thirties and not a Nihilist. Opted out from a \"regular type of life\" in my early twenties and never regretted that decision",
				"added": 1566386457
			}
		],
		"1566448853_12XcKUGvjkDZ5ufLFESyYLYXgELagrHyxz": [
			{
				"comment_id": 19,
				"body": "Precious metals and crypto are both way better options than governments toilet paper money.\n\nPrecious metals are a better store of value but only if you have a good hiding place and no plans to move in the near future.\n\nFor transferring value into another country of course crypto is the better choice. Also you don't have much risk of buying counterfeit cryptos unlike with precious metals.",
				"added": 1566461917
			},
			{
				"comment_id": 26,
				"body": "> [xcape2net](#comment_345_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): If 47 people each create their own version of bitcoin with the exact same algorithms as bit coin, call them bitcoin1 through bitcoin47, how will you decide which one to invest in?  If you decide to invest in bitcoin27 and I decide to invest in bitcoin5, neither of us will be investing in the original bitcoin.  That is inflation, just the same as if we were talking about dollars or marks or yen.  There is a finite investment pool being spread over more investment units.\n\nthe majority of people would invest in the original bitcoin not in bitcoin27, bitcoin47",
				"added": 1566553991
			},
			{
				"comment_id": 27,
				"body": "The original Bitcoin is mostly considered as \"digital gold\" and i don't think that this will change anytime soon. I cannot predict the future but i think perhaps 5-10 crypto currencies will survive.\n\nBTC dominance is 68,4% on Coinmarketcap",
				"added": 1566556298
			},
			{
				"comment_id": 28,
				"body": "> [xcape2net](#comment_349_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Why do you think that?  Where did you get the number 68.4%?\n\nhttps://coinmarketcap.com",
				"added": 1566557183
			},
			{
				"comment_id": 30,
				"body": "> [xcape2net](#comment_349_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Why do you think that?  I remember seeing 51% somewhere recently, but that may have been earlier this year when the price of bitcoin was down.\n\nIt looks like that to me. Bitcoin, Ethereum, Monero and a few other cryptos will survive.",
				"added": 1566557806
			},
			{
				"comment_id": 31,
				"body": "> [xcape2net](#comment_351_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I've given what I think are very good reasons for thinking no cryptocurrency will survive over the long term.  I've not heard good reasons for why you think they will.  I'm open-minded and willing to listen to anyone who can refute my arguments based on something other than feelings and wishes.  Believe me, I would love to have some form of currency that could replace the thoroughly corrupt system we have in place today.  I would love for cryptocurrencies to be the solution.  But, given the arguments that I've made against cryptocurrencies, I just don't see that they are capable of doing that.  Depending on public perceptions of cryptocurrencies, they could survive for another 10 years, perhaps another 100 years, but eventually they are doomed to fail (at least as a store of value), because they are incompatible with the fundamental economic principle of supply and demand.\n\ncryptos will survive because they give power back to the people. i mean in what else other than cryptos or precious metals can you invest? investing in anything that the gov can take away from me easily will never be an option for me.",
				"added": 1566559342
			},
			{
				"comment_id": 32,
				"body": "> [xcape2net](#comment_352_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): If you want to invest in things governments can't take from you, invest in education, friendships, life experiences, and other things that are intangible. [...]\n\nExactly, thats why quality lifetime, fewer open-minded friends etc. is so important to me. btw i really enjoy reading your posts",
				"added": 1566560887
			},
			{
				"comment_id": 33,
				"body": "to destroy cryptos every country has to do it and that is i'm sure unlikely going to happen. cocaine, marijuana etc. is illegal in almost every country but the people don't give a **+ and pay money for it",
				"added": 1566563896
			},
			{
				"comment_id": 34,
				"body": "> [hurr](#comment_9_17JUgv1Am5PSRNJj3xtZKCZKd31E8eRjtS): gonna laugh so fucking hard when cryptocucks are kicked onto their knees and shot in the back of the head like the kike leeches they are. hopefully with an extensive torture session beforehand. you contribute NOTHING. you are no better than a central banker.\n\nAlways keep your head held high! you were just too late to join the party ;)",
				"added": 1566632612
			}
		],
		"1566424243_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": [
			{
				"comment_id": 20,
				"body": "Late evening alone at home with ice cream, cashew nuts and good music",
				"added": 1566467619
			},
			{
				"comment_id": 21,
				"body": "> [styromaniac@kxoid.bit](#comment_143_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Before bedtime for optimal sleep.\n\nTHC always had the opposite effect to me. It kept me awake.",
				"added": 1566467703
			}
		],
		"1566375802_1C7X6AtuFz4ARoxZAj1XaEjPprGoz6o2Vn": [
			{
				"comment_id": 22,
				"body": "> [chinchin](#comment_21_18HYVwCAgri1SgiYZcEZMehKoXZo6Eg7im): Well first of all more corporations need to accept cryptos.. [...]\n\nCorporations are forced to \"play by the rules\". They must use governments money for selling their products and therefore rely on a payment processor. BitPay was the major payment processor in Germany and has been stopped recently. Governments will always interfere they are only best at stopping things.",
				"added": 1566550886
			},
			{
				"comment_id": 23,
				"body": "Cryptocurrencies are scaring them to death !\nRich granddaddies - whose grandchildren are facing a 30% inheritance tax - might have found out that Cryptos can easily be used to circumvent ...",
				"added": 1566551247
			},
			{
				"comment_id": 24,
				"body": "> [hurr](#comment_13_17JUgv1Am5PSRNJj3xtZKCZKd31E8eRjtS): yeah yeah we get it, you bought silver and are trying to justify the buyer's remorsenot our fault you're a retard who invests in shit with no practical use\n\nEnlighten us! What has a practical use to invest money in then?",
				"added": 1566552049
			},
			{
				"comment_id": 25,
				"body": "> [hurr](#comment_14_17JUgv1Am5PSRNJj3xtZKCZKd31E8eRjtS): may i recommend a gallon of bleach so i don't have to read your dumb posts anymore?\n\nwhen you don't know an answer... :)))",
				"added": 1566552238
			}
		]
	},
	"comment_vote": {
		"340_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"209_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1
	}
}