{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Alienet",
			"body": "Alienet\n\nRede oculta baseada em VPN. Garante o anonimato, privacidade e segurança.\nEm Alienet você será capaz de visitar os domínios \".anon\".",
			"added": 1492293219
		},
		{
			"topic_id": 2,
			"title": "Hacking",
			"body": "Hacking em geral",
			"added": 1492293411
		}
	],
	"topic_vote": {
		"1_1CEzchEWM961SEdamhHtAsV4cnwtHiWJkw": 1,
		"39_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1,
		"1_1PKLrtvEiL2a7ttYUx7Y42U8XysNKwjNP4": 1
	},
	"next_comment_id": 27,
	"comment": {
		"1_1GCBbTCjGZsJL7BqdRx13gEbueEnY6gsMm": [
			{
				"comment_id": 1,
				"body": "https://youtu.be/jzeBaizybgs",
				"added": 1489884226
			},
			{
				"comment_id": 2,
				"body": "https://github.com/ragmondo/BitcoinWifi.git",
				"added": 1489884246
			}
		],
		"1_1CEzchEWM961SEdamhHtAsV4cnwtHiWJkw": [
			{
				"comment_id": 3,
				"body": "O projeto Ghost OS está em fase BETA\n\nhttp://ghost-os.webnode.com/download/",
				"added": 1489884330
			},
			{
				"comment_id": 4,
				"body": "> [lordch4c4l](#comment_1_1KGgJFsRwVVi3QNYWhA8pS4MyMiYc5JkmY): O que você está precisando??\n\ndicas, ferramentas, etc",
				"added": 1489884422
			},
			{
				"comment_id": 12,
				"body": "> [franqueduarte](#comment_2_1ECu8YbijEri133nVD12iUTt1po33jZ9P4): Gente com o faz um site aqui?\n\nhttps://linuxroot1.github.io/Criando-Site-Na-ZeroNet/",
				"added": 1492292921
			}
		],
		"38_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 5,
				"body": "ProtonMail \n\nhttps://protonirockerxow.onion/",
				"added": 1489884485
			},
			{
				"comment_id": 6,
				"body": "http://ghost-os.webnode.com/",
				"added": 1489884506
			}
		],
		"42_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 7,
				"body": "NÃO CONFIO, JÁ QUE NÃO É OPEN SOURCE",
				"added": 1489884577
			}
		],
		"39_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 8,
				"body": "https://youtu.be/ITFSdgVzXU8",
				"added": 1489884660
			},
			{
				"comment_id": 13,
				"body": "MORPHiS\n\nRede para upload de arquivos e e-mail descentralizada que permite substituir o armazenamento em nuvem.",
				"added": 1492293113
			},
			{
				"comment_id": 15,
				"body": "MORPHiS\n\nIntrodução\n\nMORPHiS é uma rede P2P distribuída, e como a maioria das redes com propriedades parecidas, é também open source, o que tornou fácil para ela vir a ser cross-platform, estando disponível oficialmente para Linux, Mac OS e Windows, bem como o código-fonte em tarball.\n\nPor estar em uma de suas primeiras versões, conta com ‘poucas’ funções, mas das principais destacam-se o acesso/publicação de sites na rede, bem como utilização do DMAIL (serviço de email próprio, distribuido, baseado numa DHT) criptografado, anti-spam, e incensurável.\n\nAssim como na ZeroNet, a publicação de sites ocorre de forma gratuita, sendo gerados links permanentes aleatórios e compridos, tendo como grande diferencial um sistema de upload de sites/arquivos privados, com base numa chave criptográfica, no qual o conteúdo pode ser atualizado com base nessa chave privada.\n\nFuncionalidades\n\nChaves estáticas – Sistema de publicação P2P similar ao BitTorrent;\nChaves atualizáveis – Conteúdo publicado pode ser atualizado para o dono (que possui a chave do arquivo);\nDmail – Sistema de emails anônimo, criptografado, anti-spam e anti-censura, totalmente descentralizado.\n\nPontos Positivos\n\nP2P;\nDescentralizada;\nCriptografada com algoritmos fortes;\nGratuito;\nOpen Source;\nCross Platform;\nSeguro;\nRelativamente novo.\n\nPontos Negativos\n\nDescentralizado – Necessita ao usuário baixar todos os dados em seu computador;\nNovo – Base de usuários pequena, baixo alcance de conteúdo;\nProduzida majoritariamente por um único indivíduo.",
				"added": 1492294047
			},
			{
				"comment_id": 16,
				"body": "Entrevista com o criador da rede MORPHiS\n\nhttps://blog.deepwebbrasil.com/entrevista-com-o-criador-da-rede-morphis/",
				"added": 1492294232
			},
			{
				"comment_id": 17,
				"body": "A verdade sobre a morte de Sam Maloney: o criador da rede MORPHiS\n\nhttps://blog.deepwebbrasil.com/a-verdade-sobre-a-morte-de-sam-maloney-o-criador-da-rede-morphis/",
				"added": 1492294262
			},
			{
				"comment_id": 24,
				"body": "> [sirenyc](#comment_224_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ): vlw pelo link!\n\nDe nada",
				"added": 1492993837
			}
		],
		"2_1PbCor9kCtnKaZAPnrxENbcraKtAEq8wA1": [
			{
				"comment_id": 9,
				"body": "http://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:1_1CEzchEWM961SEdamhHtAsV4cnwtHiWJkw/GhostOS",
				"added": 1489884714
			},
			{
				"comment_id": 10,
				"body": "ZeroFileShare - WebTorrent Filesharing - ZeroNet\n\nhttp://127.0.0.1:43110/1DZSMYvbbsX6gbcpHEez5cGWBG7DLgVjxT/files.html",
				"added": 1489884860
			}
		],
		"45_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 11,
				"body": "Gerador de senhas fortes\n\nhttp://127.0.0.1:43110/15biTT8VHz4wruUPLitCtqqda1rJa3Lta8",
				"added": 1492292829
			},
			{
				"comment_id": 23,
				"body": "Criptografia com JavaScript\n\nhttp://127.0.0.1:43110/19Lkaft54PDZpfzUH6pm759VZMdjWwoeXf",
				"added": 1492467531
			},
			{
				"comment_id": 25,
				"body": "Arquivo de vigilância Snowden e wikileaks torrents\n\nhttp://127.0.0.1:43110/zeroleakz.bit",
				"added": 1492994476
			},
			{
				"comment_id": 26,
				"body": "> [sirenyc](#comment_222_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ): NENHUM PAR ENCONTRADO... =/\n\nAs vezes tem esse problema...",
				"added": 1492994632
			}
		],
		"2_1PKLrtvEiL2a7ttYUx7Y42U8XysNKwjNP4": [
			{
				"comment_id": 14,
				"body": "Hacking\n\n\nPor definição, hacker é o indivíduo que se dedica, com intensidade incomum, a conhecer e modificar os aspectos mais internos de dispositivos, programas e redes de computadores. Por consequência, um hacker tem um grande poder em mãos, e é isso que desperta o fascínio e o desejo de muitos por se tornar um hacker.\n\n​Você provavelmente chegou nesta página por essa razão. Aqui, tentarei dar um rumo para aqueles que querem se iniciar nesse mundo, mas se veem perdidos e sem orientação de por onde começar, e orientar os que ainda têm uma visão distorcida do que um hacker realmente é. \n\nDe início, saiba que um hacker pode trabalhar em inúmeras áreas dentro da própria computação, tais como segurança de dados, forense, phreaking, vulnerabilidades web, auditoria, entre outras. A ação de um hacker vai muito além de invadir um Facebook, e se esse é todo seu objetivo, digo que estudar hacking será, para você, uma perda de tempo, ainda mais se você acha que conseguirá isso de forma fácil.\n\nFrequentemente vemos notícias de ações gloriosas de hackers, como boicotes a sites importantes e invasões em perfis de celebridades. O que muitos não sabem, é que tais ações são apenas o ápice de um processo que demandou horas de estudo, experiências próprias, fracassos e inúmeras pesquisas, muitas das quais acabaram por se mostrar improdutivas. Se você realmente quer entrar nesse mundo, é necessário primeiro ter ciência disso e estar preparado para correr atrás desse objetivo sozinho. A não ser que pague um instrutor, ninguém irá lhe entregar algo de bandeja, até por que pessoas habilitadas a isso tem ocupações mais importantes.\n\nSe você ainda continua lendo, é por que entendeu o desafio que há por vir e está disposto a enfrenta-lo. Antes de “colocar a mão na massa”, é necessário que você primeiro entenda como um hacker pensa.\n\nNão há uma maneira única e 100% funcional de se fazer algo, especialmente se estivermos nos referindo a burlar algum sistema. Por isso, o hacker precisa, antes de tudo, ser capaz de procurar e encontrar essas maneiras, ter espírito investigativo. Vale lembrar que isso não se aplica apenas na informática, mas em qualquer outra situação. Pensar em formas diferentes de se burlar algo, encontrando falhas de segurança em um sistema talvez seja um bom exercício.\n\nEm seguida, é o momento de começar a realmente se iniciar no mundo hacker. Felizmente, existem diversos livros que dão uma noção geral de todas as áreas do hacking (deixarei esses livros ao final do post). Tais leituras lhe ajudarão a compreender como ataques são feitos, como evita-los, e também lhe darão um bom vocabulário sobre o tema, que será útil mais adiante.\n\nDurante todo esse processo, nunca deixe de pesquisar outras fontes, testar recursos e realizar experiências. A maioria desses materiais também apresenta exemplos de ataques em ambientes controlados. Procure reproduzi-los, verifique em quais condições eles acontecem e não tenha receio de procurar essas mesmas condições em sites reais.\n\nNão se esqueça também da engenharia social, que é algo importantíssimo quando lidamos, além da computação, com o fator humano. Existem vários livros sobre o assunto, entre eles, A Arte de Enganar, do famoso hacker Kevin Mitnick.\n\nA partir desse ponto, você já estará apto a entender a maioria dos ataques, e quando alguém lhe sugerir uma situação, já conseguirá criar mentalmente as estratégias para realiza-la. Mas lhe faltará prática, afinal até então você apenas se utilizou das ferramentas que lhe foram fornecidas, a maioria das quais já estão ultrapassadas.\n\nEste é o momento de escolher uma área (ou várias) com a qual tenha maior afinidade e se aprofundar. Procure por materiais mais técnicos (e talvez em outro idioma). Deste ponto em diante, terá de trabalhar com exploits e ferramentas dedicados ao público experiente, e não mais para iniciantes. Provavelmente, será preciso talvez desenvolver as suas próprias ferramentas, ou modificar as de terceiros.\n\nÉ aí que entender programação se torna crucial. Então, tire um tempo de seu estudo para estudar lógica de programação e aprender o básico de alguma linguagem de alto nível, como Python. Isso não será difícil e lhe dará uma base para, quando necessário, se aprofundar em alguma outra linguagem mais específica, dependendo da área em que escolher. Por exemplo, se trabalha com web, provavelmente precisará de Perl ou alguma linguagem de servidor. Se seu foco é software, C e Assembly serão necessários.\n\nAo final desse processo, você finalmente estará apto para se considerar um hacker. Caso queira levar seu novo hobby a sério, poderá trabalhar formalmente na área, seja prestando consultoria para empresas, testando sistemas que deveriam ser seguros ou trabalhando com computação forense.\n\n\nLivros:\n\nhttps://mega.nz/#!B3BX3CDJ!dCrJGyd6Hc75rnGqPkctea8KeGn8jS3Idy6KaPmok4o\n\nSenha: 17$6W7d061wi",
				"added": 1492293574
			}
		],
		"1_1PKLrtvEiL2a7ttYUx7Y42U8XysNKwjNP4": [
			{
				"comment_id": 18,
				"body": "Redes da Deep Web - Alienet\n\n\nhttps://youtu.be/jeHo78QorOk",
				"added": 1492294329
			},
			{
				"comment_id": 19,
				"body": "Deep Web - Rede Alienet\n\nhttps://youtu.be/kidDsiAbmiU",
				"added": 1492294381
			},
			{
				"comment_id": 20,
				"body": "https://whyweprotest.net/threads/alienet-a-private-safe-anonymous-encrypted-hidden-network.131846/",
				"added": 1492294442
			},
			{
				"comment_id": 21,
				"body": "Email do desenvolvedor da Alienet\n\nit.darknet@gmail.com",
				"added": 1492294616
			},
			{
				"comment_id": 22,
				"body": "http://alienet.info/",
				"added": 1492295266
			}
		]
	},
	"comment_vote": {
		"1_1KGgJFsRwVVi3QNYWhA8pS4MyMiYc5JkmY": 1
	}
}