{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1562511342,
			"title": "ZeroTalk 'links collector' question and thoughts",
			"body": "I am new to ZeroNet and have been hanging around for some time, observing the life inside this net. After some time I've came to subjective question about data I'm browsing here. For now, I'm talking mainly about ZeroTalk and ZeroHello page that I rely on (most of the time) to watch what's new and what people are talking about, what topics are created and so on.\n\nThe question I've came into, can be formulated this way: can I reduce the amount of time spent, browsing and filtering through all this threads and info, delivered by ZeroTalk and ZeroHello results?\n\nThe thing is, I don't really want to check every topic and every comment/opinion on some topic - it's too overloading for my perception filters. So the quick thought was: can I rely on something more \"informationally saturated\"? Can it be the links, posted by users?\n\nOn the main page of ZeroHello there is a list of 4 tabs, currently represented as:\n- ALL\n- COMMENT\n- MENTION\n- TOPIC\n\nNext thought was: can the 'LINKS' tab be added as a tab too? If so, how can that be possibly achieved? Will Greasemonkey, in example, be suitable and will it work out?\n\nWithin that `links` section I'd want to see the list of links, posted by any user in any topic within ZeroTalk. It could be marked with language header and, in perspective, sorted by relations such as:\n- where does that link came from? Clearnet or ZeroNet?\n- if it's a outside link, what source has it came from? Political mass-media or some tech source like Github/Bitbucket?\n\nThe final thought in a form of question is: can it be done without much pain, counting on current ZeroNet architecture?\n\nThe aim of such links collector, subjectively for me, would be a much more faster recognition of an info quality/quantity, throwned into the net itself. Is it more political stuff pouring out? Is it some tech waves hitting? It would give much more analysis for an eye to find out what's the mood now out there.",
			"added": 1562511341
		},
		{
			"topic_id": 1600032770,
			"title": "Almost no ZN trackers available",
			"body": "I have two separate machines with Win and \\*nix aboard. After the latest ZN release there are only 3/15 trackers available under Win and \"Trackers list error\" under \\*nix system. What is going on? Here's the current list of ZN 0.6.5 client under Win. With newer ZN version there are no trackers under Win client too (on same Win machine, so the machine configuration is not changed).\n\n```\nzero://45.77.23.92Error (40% success)\nhttp://open.trackerlist.xyzError (0% success)\nzero://51.254.123.155Error (40% success)\nudp://tracker.port443.xyzError (0% success)\nhttps://1.tracker.eu.orgError (0% success)\nzero://zero.booth.moeError (0% success)\nudp://tracker.coppersurfer.tkAnnounced in 0.09 sec (83% success)\nzero://boot3rdez4rzn36x.onionError (0% success)\nudp://104.238.198.186Error (33% success)\nzero://185.117.73.181Error (40% success)\nhttp://tracker2.itzmx.comAnnounced in 0.43 sec (100% success)\nzero://51.38.34.170Error (40% success)\nzero://95.216.68.23Error (14% success)\nhttp://open.acgnxtracker.comAnnounced in 0.15 sec (98% success)\n```",
			"added": 1600032768
		},
		{
			"topic_id": 1600039815,
			"title": "ZN Domain Name Registry: no peers found",
			"body": "So, here [/1Name2NXVi1RDPDgf5617UoW7xA6YrhM9F/](/1Name2NXVi1RDPDgf5617UoW7xA6YrhM9F/) I see pretty big list of registered domains. I tried to visit lots of them from that list, but almost all of them are not loading, giving back the \"CONTENT.JSON Error Loading\" or \"Peers not found\" message. So the question is: what is the point of that domain names being registered and why almost all of that zites(?) are unreachable? \n\nAlso, is there any indexer (somewhat like Kaffie Search) that parsed through all of that list and stored atleast title and description of each zite from that list? If lots of zites are abandoned, or not working, or was never working but only .bit domain registered 'for future', what is the point of that list then?",
			"added": 1600039812
		},
		{
			"topic_id": 1601334479,
			"title": "Syncronite stopped working?",
			"body": "[This page](/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/cache/1/_h_.html) is missing all the trackers that were in the list. @styromaniac some issues?",
			"added": 1601334475
		},
		{
			"topic_id": 1602774304,
			"title": "LibGen goes IPFS",
			"body": "More info here: https://www.reddit.com/r/libgen/comments/jb1hts/p2p_free_library_help_build_humanitys_free/\n\nPlease check out \"Call for devs\" section.\n\nCurrent mirrors in clearnet:\nhttp://libgen.rs/\nhttps://libgen.fun/ (also accessible via the MD5 filename)|\n\nIf you are not sure what IPFS is, read here: https://freeread.org/ipfs/",
			"added": 1602774299
		},
		{
			"topic_id": 1604751153,
			"title": "Recently I often have Trackers: 0/63 and files sync can take up to few days...",
			"body": "In trackers tab the picture is somewhat like this:\n```\nhttp://5.182.211.232Error (98% success)\nhttp://51.15.55.204Error (81% success)\nhttp://179.99.0.64Error (98% success)\nzero://zero.booth.moeError (27% success)\nhttp://51.81.46.170Error (98% success)\nhttp://165.227.0.51Error (85% success)\nzero://2001:19f0:7002:b01:5400:1ff:fe3f:3673Error (0% success)\nhttp://51.158.154.106Error (97% success)\nzero://2409:8a50:6e2d:7a0:d522:4264:ca51:c286Error (0% success)\nzero://103.73.66.144Error (63% success)\nzero://2001:470:b5c9:1000:6cbf:2262:afba:4af2Error (0% success)\nhttp://54.37.106.164Error (80% success)\nzero://127.0.0.1Error (0% success)\nhttp://192.151.157.106Error (93% success)\nhttp://176.113.71.60Error (98% success)\nzero://51.254.123.155Error (0% success)\nhttp://95.107.48.115Error (98% success)\n```\nTOR mode is `enabled`, 10 onions running.\n\nThe problem: syncing content for the last 2 months or so was a pain. I literally can't get any new content for days, randomly waiting while trackers will be there, at least one or two/five of them. And I'm using trackers list from Syncronite. How do people go with 5 default trackers at all?..",
			"added": 1604751147
		}
	],
	"topic_vote": {
		"1571938147_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1571924300_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1576434866_1CJc7iRKb8yncAkdF29t1M85mhfYEKgAFj": 1,
		"1603127653_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1606080511_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": 1
	},
	"next_comment_id": 93,
	"comment": {
		"1557968684_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 1,
				"body": "> [sharer](#comment_54_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P): Done. [...]\n\n\"Zeronet needs to be profitable\" - for what? To become another Clearnet? It's an underground, and the mechanisms we should evolve here are not \"profit\", \"trade\" or such.",
				"added": 1558740609
			}
		],
		"1557931740_1CVLeFVQw2wWbBdpM5PtQhtzd7wjKzB24b": [
			{
				"comment_id": 2,
				"body": "So, how exactly will you help them? How will your 'help' look like?\nI see it as a 'helping hand' from your side as follows:\n- for a criminal, your help is to become a victim. Go for it ;)\n- for a murderer, your help is to become a victim. Go for it too :D\n- for a...\n\nWell, you've already got the point ;)",
				"added": 1558742219
			}
		],
		"1562443357_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 3,
				"body": "There is no easy answer - all these problems, like addiction, social approval and low self-esteem are a complex topics, discussed within psychological and behavioral aspects. In short, we are addicted to this little `black mirrors`  (and big ones, monitors) cause of two things: \n- the device can generate huge amount of positive reinforcements in a short term period\n- social aspect even without socium itself: while interacting with a screen and some UI, this interaction performs as a powerful hormonal regulator. And, because this interaction is mainly one-sided (from user's side to his device's screen), it is intepreted by person in a most comfortable way (imaginable approval, 'look at me' stuff and etc.). So, person stays 'in mood' everytime he/she shows 'himself/herself to the world' (even if this world is virtual and imaginable, or even if photo will never reach anyone, in case with selfies).\n\nSo, it's just an act of feeding ego. Alot of people in our today's world are non-educated about their own behavior: why they are doing that, what are the aspects of doing this or that and what can be the long-term perspective of their behavior.\n\nIn more detailed answer, you will need to search some vast amount of info on human behavior topic to really catch up with some sort of a suitable answer.\n\nTry to start with a series of Stanford lectures on human biology by Robert Sapolski: https://www.youtube.com/watch?v=NNnIGh9g6fA",
				"added": 1562508496
			}
		],
		"1561288542_14hmCEXpoVdYQqeve93LpieDx2k8aFyT66": [
			{
				"comment_id": 4,
				"body": "@guessmyname\nI think you can build some sort of an answer for yourself from this sources:\n- https://privacytools.io/ will give you an answer about privacy and anonymity\n- https://github.com/cryptoseb/cryptopaper/ will lead you even deeper into the rabbit hole ;)",
				"added": 1562509538
			}
		],
		"1563726596_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 6,
				"body": "You have too much free time on your hands, comrade major :)",
				"added": 1563755407
			},
			{
				"comment_id": 7,
				"body": "> This world does not work as people imagine it\n\nAnd ofcourse you are the One and Only who Knows The Truth xD\n\nWhat do you suggest? Besides theories of conspiracy and other \"I, I and I\" stuff.",
				"added": 1563911222
			},
			{
				"comment_id": 8,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_471_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): nope but thanks for asking. [...]\n\nYour thoughts are highly abstract, and it's hard to understand what's the point you want to deliver (and to who). If you want to talk about logic and deduction, please do so, write lectures or start some blog. But for now your random posts about 'everything' are kinda looking like an attempt to attract attention. Are you in some need?",
				"added": 1563926683
			},
			{
				"comment_id": 9,
				"body": "> It does not work, there are things that we can't be passed with WORDS.\n\nYet you continue to use them. A lot. Be honest with yourself and don't fool yourself, being online. You have some aim here, and it's not clear what's the aim. If you're writing about the consciousness of the population, making a point on 'rising it', how do you suggest to rise it, without using words?..",
				"added": 1563996024
			}
		],
		"1563985981_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 10,
				"body": "\"The book is better than the movie\" - it sounds like that for me. Well, that's an argueable statement. You can use both for even better interaction.",
				"added": 1563996473
			},
			{
				"comment_id": 12,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_485_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): if you want to cook an egg, it's better to turn on the gas.\n\nOr you can use the direct sunlight on a list of metal to cook it. Without a gas ;) That's why 'it always depends'.",
				"added": 1564084440
			}
		],
		"1563975046_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 11,
				"body": "Cons:\n- Cryptocurrency is still a currency. Crypto adds problems to existing concept of currency, but suggests nothing drastically new.\n- You need to spend A LOT of energy to make the whole system work as intended.\n- Can be used as a tool for money laundering, using mixers.\n- Still buys (and sells) for real $.\n\nAnd also I don't think that 'infinitely divisible' point can be considered as a 'pro'. Resources on a planet is a finite thing, our lifetime is a finite thing too. Having something with an 'infinite' possibilies is a way to wide speculation. For now it is expressed as a volatile bitcoin value, in example.",
				"added": 1563997012
			}
		],
		"1564213187_1BqxHcQnWqCfURAwopdJnRPdqvTL9EMdMg": [
			{
				"comment_id": 13,
				"body": "'free' is a word with a high level of abstraction. It can be interpreted in many ways. That's why it is unreliable to use it, when you're trying to be precise and concrete. We're using language - a tool, that has fistful of clutches. So, we can't 'speak freely', but only interpret to a certain level of understandability by majority of people. We can't 'think freely', cause we're limited to our own experience and tools of thinking. Watch Sapolsky lectures on human behavior and Den Dennet's lecture on 'Tools to transform our thinking'. \n\nAnd also take a look at General Semantics.",
				"added": 1564445662
			}
		],
		"1564755065_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 14,
				"body": "> [blurhy](#comment_275_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Any one, any idea !!!???\n\nLink leads to gist on github, and that gist is... What is this?\n\nI think your link should be pointing to https://gist.github.com/blurHY/4e7fad57d1eb613c520bf60bd87c70c0",
				"added": 1564795989
			}
		],
		"1571185468_15io4gegLAkgg9jNErcMyY6bpD64HULMCw": [
			{
				"comment_id": 15,
				"body": "Observe, explore, contribute.",
				"added": 1571309537
			}
		],
		"1571939842_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 16,
				"body": "School, a place, ment for an education, blocks an educational (in all-way meanings) content. What a shame for our educational system and overall info regulation policies...",
				"added": 1572010658
			}
		],
		"1572101168_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 17,
				"body": "Uploaded on ZeroUp. Can be found by searching term 'tor'.\nJust a notice: search form is kinda weak, talking about proper regex and string match, etc...\n\n[Tor Browser 9.0 PGP SIG + ASC links @ NullPaste](/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ_0)",
				"added": 1572107586
			},
			{
				"comment_id": 18,
				"body": "> [pexo](#comment_170_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): Here is the digital signature: [...]\n\nYup, thanks for notice. I've edited my previous message and added a paste with all PGP sigs and ASC links.",
				"added": 1572110003
			}
		],
		"1572281710_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 19,
				"body": "Probably you're looking for this?\n[Pornography sites blocklist](/13CgSQeywg2ius5pjXVCk7dKUCRkz5xvW3/)\n\nAlso, how do you even manage to step upon such sites? Are you intensionally looking for those? You can always remove the website after visiting it, if you dislike its contents.",
				"added": 1572282871
			}
		],
		"1572423224_1K6oaTYB17miXmrQJQFFKss1Qg4mBox1Lr": [
			{
				"comment_id": 20,
				"body": "Yup, we can see it.",
				"added": 1572456857
			}
		],
		"1572739729_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 21,
				"body": "I mostly miss the 'spirit of newborn era'. Encouraging discoveries were in priorities. Learning through disassembling things, no mindless data scrolling. Seeing opportunities in every bit of data rather than shitloads-of-data-overload. Internet traffic was a thing with a value. Now we barely care.\n\nIt was an era of free exploration and experiments, and it also was the unique time of balance between real-life and virtual space. Those two were mixed in a somewhat 'perfect equilibrium'.\n\nThen DMCA came in 98, and everything went downhill the road of SNAFU. Now we're approaching a full FUBAR. ^__^\nLots of people are simply escaping from reality into virtual, so there is no more balance between those two worlds: virtual place meant to be a better place, but it became yet another 'marketplace of problems', 'harbour of business' and 'dealer of noise'.\n\n20 years back I personally saw the Internet as an instrument, that can help solve problems. Now I think we've made it look like an instrument for generating exacerbation and confusion.",
				"added": 1572875979
			}
		],
		"1572974675_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 22,
				"body": "People are okay, but economy within capitalism is out of touch with the real state of things.\nWorking economy should be resource-based. Current model is based on percent, which has no return value to get from.\n\nSo, you're talking about business mainly. People are in touch more than ever, thanks to mobile networks, internet and bunch of other stuff. Be more optimistic and work towards better society instead Q.Q'ing over the very deep bottom of 'the touch net'.",
				"added": 1572976089
			}
		],
		"1573096928_1HnhomrjyYMwzcpGEtVRaVA6r5XMMYz3Wg": [
			{
				"comment_id": 23,
				"body": "You can't have WP over ZN, if you have dynamic website with a backend. But you can render your static HTML, if your WP website is just some news/articles stuff.",
				"added": 1573135205
			}
		],
		"1573303435_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": [
			{
				"comment_id": 24,
				"body": "\"I suspect suicidal-ity was never even an illness for me, but a genuine world outlook.\"\n\nThen why are you asking such questions inside this network? If it's your world outlook, you should be far more savvy in this field than anyone here.",
				"added": 1573318627
			},
			{
				"comment_id": 29,
				"body": "> [kaar4bears](#comment_72_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr): Smog is so bad where i live that weather guys recommend not going outside unless really needed (I guess they don't realize people MUST go to work every day?). Scientists think it will drastically reduce our lifespan and it damages children physical development. I don't wanna live in such world. [...]\n\nSo are you going to suicide or will continue Q.Q'ing and getting down to 'niggers, muslims' and so on? What is your aim? Self-complain and crying out will do nothing to improve your own situation. If you 'don't wanna live in such world', make an influence then. Or stay a passive observer and seek attention in undergrounds to justify your own inertia.",
				"added": 1574007285
			}
		],
		"1573543018_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": [
			{
				"comment_id": 25,
				"body": "For what? To make 0net live, just use it and raise your programming skills to make something usefull.\nWhat's the use to sit and do nothing, while spending electricity for 'mining'?",
				"added": 1573580206
			}
		],
		"1573819880_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 26,
				"body": "Gay Ray... Okay.",
				"added": 1573822054
			}
		],
		"1573781265_12GKd5hKKNsTyxWqE3arbSurnbq6Ek8spk": [
			{
				"comment_id": 27,
				"body": "Another bot wave with useless messages, spread over ZN...",
				"added": 1573822272
			}
		],
		"1574000003_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 28,
				"body": "You're tired cause you can't explain it to yourself. Try harder, energizer :D",
				"added": 1574006797
			},
			{
				"comment_id": 30,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1138_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): [swashbuckler] \"You're tired cause you can't explain it to yourself. Try harder, energizer :D\" [...]\n\nYes, yes, you're the master of this place, and everyone should listen to you and read through your endless topics. The truthspeaker.\n\nBut if you count those people 'morons', what do you expect back? We're all the victims of our culture, and you're no exception. CAPS is not helping also.",
				"added": 1574024615
			}
		],
		"1574357441_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 31,
				"body": "@h3bhkj5gqz4n3pjm It's you who has nothing to hear, probably.",
				"added": 1574367900
			}
		],
		"1574368062_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 32,
				"body": "When their data will be used against them, and they will lose something, then probably that would be a convincing point.",
				"added": 1574368824
			}
		],
		"1582401868_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": [
			{
				"comment_id": 33,
				"body": "I was trying to contact an author at reddit but there was no reply. Some time ago he was requesting a free space donation for data storage. I wanted to share some, but recieved no answer whatsoever. By this time I consider that the project is unmaintained and probably abandoned.",
				"added": 1582565445
			}
		],
		"1594689481_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 34,
				"body": "What do you mean by \"learning inside and out\"? For a zite creation I haven't done it yet, because it implies knowing API (the \"inside\" part). I'm still preparing myself for the \"Should I do something here at all?\" moment as time goes by, surfing in clearnet.\n\nLearning an \"out\" part is pretty easy, since you have some background of already created zites, a bunch of FAQ's and plenty of links to explore on ZeroSites. Can't say anything about details tho, probably will come with more if the \"do something\" moment will come :)",
				"added": 1595787348
			}
		],
		"1596305258_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 35,
				"body": "Instead making it an 'etiquette', this should be handled automatically by ZeroNet itself. That will eliminate the problem of direct links. People will put non-relative links simply because they are unaware, but they still have the possibility to do so.",
				"added": 1596317411
			}
		],
		"1596498919_12kkzRK2n9vRvQLcycbGZNsD3vqzWe1Jeh": [
			{
				"comment_id": 36,
				"body": "I don't honestly think that there is much of an entertainment here, in ZeroNet. All this stuff can be easily found in clearnet - there is a lot of entertainment for sure... Here it is more of a 'geeky' stuff... The information to think about, not to entertain.",
				"added": 1596584214
			}
		],
		"1596356568_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": [
			{
				"comment_id": 37,
				"body": "> [styromaniac](#comment_2513_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You're welcome. [...]\n\nWhat do you mean by 'improving'? And what is the purpose of IFS? Is it something similar to archive.org, but in ZN? If so, how it works under the hood? Any docs would be nice (or link to repo)",
				"added": 1596585398
			},
			{
				"comment_id": 38,
				"body": "I've downloaded .zip of IFS, and there is A LOT of dependencies, speaking about .js files.\nIn order to work with something, for me it is vital to know what parts this 'something' is constructed of.\nIn example, I can see the libraries like: javatarijs lib (which emulates Atari 2600 - for what?..), nes atari and dos emulators, bitcoinjs lib (for working with bitcoin wallets - where is it used?)...\n\nWithout any documentation about 'what is under the hood', there is very little chance someone will take it over and 'make it better' with little efforts... There is really a lot of react code in all.js file, and there must be some at least brief documentation on 'what is going on'. Otherwise it is very hard to drill into the structure for the 'fresh-eye' coder.",
				"added": 1596677272
			},
			{
				"comment_id": 39,
				"body": "> [styromaniac](#comment_2518_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Understood. I wish we had people committed to their sites. I'm actually still tinkering about Kave. My obsession comes and goes even when a specific browser (Firefox on Android) has its own issues.\n\nWhat is Kave?\n\nEdit: Aha, I think I found it through GitHub (but it is already deleted). [Kave](/1KN5zRytGbGqLNdemuoLC6gS44fwM9h38s)",
				"added": 1596832786
			}
		],
		"1597273154_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 40,
				"body": "Not a good idea for ZeroNet in his current state.\nDo not make ZN another gaming place - it is not designed for such stuff, imo.\nBetter make it geek/tech community and spread things that are hard to find in clearnet.",
				"added": 1597287568
			}
		],
		"1600031682_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": [
			{
				"comment_id": 41,
				"body": "What do you mean by 'most zites are closed'? Probably there are no trackers available?",
				"added": 1600033044
			},
			{
				"comment_id": 42,
				"body": "> [stivencannor](#comment_12_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S): No when i am open target zite. I see \"this zite closed\" message.\n\nCan you give example links?",
				"added": 1600033840
			}
		],
		"1600032770_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": [
			{
				"comment_id": 43,
				"body": "> [jeff](#comment_51_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): Install Syncronite. It automatically update trackers for you and keep them updated.http://127.0.0.1:43110/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/\n\nOkay, will do. Where does this list comes from? Who maintain it?",
				"added": 1600033981
			},
			{
				"comment_id": 44,
				"body": "> [styromaniac](#comment_2539_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Me.\n\nStyro, how do you know where to get new trackers?",
				"added": 1600034407
			},
			{
				"comment_id": 45,
				"body": "> [styromaniac](#comment_2540_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I use ngosang's trackers list. Ngosang is responsible for testing out trackers and weeding out dead ones. I once pointed him to a site full of trackers he didn't have and he added them.\n\nThis should be added to ZN client for those who don't know about these trackers lists and stuff :O Default list is somewhat dead... Is there any issue regarding this point created at GH repo by any chance? Also, this list should be added to ZN Wikis.",
				"added": 1600034785
			},
			{
				"comment_id": 46,
				"body": "> [styromaniac](#comment_2540_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I use ngosang's trackers list. Ngosang is responsible for testing out trackers and weeding out dead ones. I once pointed him to a site full of trackers he didn't have and then he added them.\n\nFor the information: I opened the config page and inserted the copied text as is:\n`{data_dir}/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/cache/1/_h_.html`\nBut in the trackers information all I got was: \"Trackers waiting...\" text. When I opened the list and hard-copied each entry in config trackers textfield, it worked out well. So, why it doesn't work when copied with `{data_dir}` variable?",
				"added": 1600035393
			},
			{
				"comment_id": 47,
				"body": "> [styromaniac](#comment_2542_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): What OS are you on?\n\nWin 8 atm. Will try this later under Ubuntu.",
				"added": 1600035894
			},
			{
				"comment_id": 48,
				"body": "> [jeff](#comment_53_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): {datadir}/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/cache/1/_h.html [...]\n\nOh dumb me Yes, it was the \"Trackers files\" box I needed. Instead I've added the line into the \"Trackers\" box as a new line. Now it works as intended... Need to be more attentive.",
				"added": 1600042563
			}
		],
		"1601334479_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": [
			{
				"comment_id": 49,
				"body": "> [thorburn](#comment_146_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Mine was struggling to find trackers for a while earlier this evening. I did a ZN restart and now it seems to be finding plenty of trackers. I went from 2 of 34 to 25 of 41.\n\nYes, the issue is gone now too.",
				"added": 1601340258
			}
		],
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 50,
				"body": "One-year-later bump. This topic has some points.",
				"added": 1601341341
			}
		],
		"1602120041_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": [
			{
				"comment_id": 51,
				"body": "Also, take a look at this zite: [citadell.bit](/1Citaftv9xvrvxG7EskEJNWXk1t9xyBL8n)\nIt has 3 files:\n```\nmain.js\nindex.html\ncontent.json\n```\n\nAnd a remote script insertion in `index.html`:\n```\n    <script type=\"text/javascript\" src=\"//code.jquery.com/jquery-1.10.2.min.js\"></script>\n    <script type=\"text/javascript\" src=\"http://s3.amazonaws.com/codecademy-content/courses/hour-of-code/js/alphabet.js\"></script>\n```\nSource still loads as usual, if you have active internet connection. Again: why loading external scripts is allowed? You can, in the same way, load anything from any remote host outside ZN network. \n\nIf it is intended behavior, then ok. But at least zite should warn the user, that some resources are loading from clearnet, no?",
				"added": 1602436382
			}
		],
		"1566679861_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 52,
				"body": "> [gitcenter](#comment_1379_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Time. It's only a question of free time... I'm at school, you know.\n\nI understand, that everyone has stuff to do. But projects can be built faster if collaborating. I.e. you could host your current project on your Git Center, and someone will probably aid with PR's.",
				"added": 1603012399
			}
		],
		"1603313852_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 53,
				"body": "Sounds hazy for me... I mean, I just read this whole text, but don't quite understand what is it you want to do... Probably it should be explained more clearly, as for a total newbie, and with some visual examples maybe.",
				"added": 1603316031
			}
		],
		"1603127653_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 54,
				"body": "Yup. I've discovered that there are 'plugins' only when it came to the point I've visited StreamZ site, and it was requiring a plugin to be installed. Plugins installation, I think, should be proposed by zites itself...\n\nAnd 'knowing about existense of a plugin system' should be in the zeronet docs website, described and documented. I doubt that ordinary zeronet user will look into plugins. But the developers of zites - that's the ones who need to know that info. And for that, there should be a good docs about whole plugins ecosystem, etc.",
				"added": 1603316663
			}
		],
		"1603608731_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 55,
				"body": "I will follow both the original and the fork threads :) It won't take too much of a space and my resources, so I think I can handle watching original and one active fork. Data stays the same, right? :D",
				"added": 1603631873
			}
		],
		"1603122234_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 56,
				"body": "Easiest way to do that would be to make a redirect to the topic of your project, if the project is long abandoned. Then the people will eventually figure out what to do.\n\nWhat I mean:\n1) You have a zite, and that zite is updated. You can fetch last updated time from `siteInfo`, looking for a `content_updated` key.\n2) You have a corresponding thread on ZeroTalk or Git Center, or any other zite, where all the discussions about your project is going on. Let's say, it will be an address /XXXXX.\n3) You then put a simple javascript conditional statement, something like: `if ((siteInfo['content_updated'] + 1year) > time())` then <meta> redirect to address /XXXXX instead loading the zite.\n\nOr... we can clone ZeroMail service and add a 'delayed email sending' feature. The delayed mails sending could be triggered by anyone, who is using the mail service itself - just to send a signal to any other possible not-yet-sent emails, where script will check the current time and time in each delayed email. Since email contents are encrypted, it could be a nice way for long-term saving.",
				"added": 1603718135
			}
		],
		"1530097903_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 57,
				"body": "Is @quantumkitty still around?",
				"added": 1603748568
			}
		],
		"1604659936_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 58,
				"body": "Probably no one is saying that because it can't hold the criticism? xD\nHow can we test it?\n\nWhy some people are so turned on conspiracy theories? You have nothing better to do? >.> This is sad...\n\nYou'd better google https://en.wikipedia.org/wiki/Behavioral_sink\nhttps://www.youtube.com/watch?v=7CXj0AGuh4c and see some experiments. It is a matter of infrastructure and available resources in environment. Viruses are just viruses, and they are always there, waiting for some \"good carrier\" to arrive.",
				"added": 1604666121
			}
		],
		"1604751153_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": [
			{
				"comment_id": 59,
				"body": "I got through several publication errors while posting this and not even sure if it was posted at all, because there wasn't any peers (because there wasn't any trackers).",
				"added": 1604751251
			},
			{
				"comment_id": 60,
				"body": "With Tor disabled there is 1/63 trackers available, and I've got a lot of comments loaded in ZeroTalk that I wasn't been able to see with `Tor mode: on`. This is frustrating >.> It seems I'm missing a lot of content...",
				"added": 1604751548
			}
		],
		"1625793981_1PoimK7hZWHqrhWBZAVe8bi9g7sv4cj87R": [
			{
				"comment_id": 61,
				"body": "Zeronet seems the most active, but it lacks developers who would actually use ZN as a platform for creation, not consumption. I'm also on Matrix/Element and it adds well to ZN.",
				"added": 1625878353
			}
		],
		"1628592563_1AmXimBQuPemuoTM9NFYg9Mn5YY6HomhAm": [
			{
				"comment_id": 62,
				"body": "> [jackzeng6666](#comment_15_1AmXimBQuPemuoTM9NFYg9Mn5YY6HomhAm): When you comment, there is a \"USED: XXXK/50K\",I used at last this limit.How to extend?\n\nYou can't =( Re-register another ZeroID account",
				"added": 1628605202
			}
		],
		"1629547543_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 63,
				"body": "Use internet, watch experts in their fields just like your friends :) Then, if possible, observe and approve the 'facts' by yourself.",
				"added": 1629676744
			}
		],
		"1629298299_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": [
			{
				"comment_id": 64,
				"body": "What do you mean by 'discarded'? ZeroNet still runs, anyone can fork it and support just like nofish did. Anyone can add custom plugins to interfere with core. It is way more possible that those threads are created by people who don't interact with the code, but rather want something to be delivered to them...",
				"added": 1629677376
			}
		],
		"1630592868_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 65,
				"body": "What is the current limit you're exceeding?",
				"added": 1630624465
			}
		],
		"1630703227_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 66,
				"body": "\"everything is falling apart\" - what do you mean by that? What is falling apart and why do you need to archive ZN? The whole idea of ZN is that the information is still there, if atleast 1 seed is present. It seems I quite don't understand something.",
				"added": 1630749826
			},
			{
				"comment_id": 67,
				"body": "Okay, I now see the problems:\n- Tor Project has deprecated v2 onions (http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/?Topic:1616711390_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS/Onion+v2+Deprecation+Sept+2021 - possible solution with a patch?)\n- ZeroNet Namecoin domains have expired\n- ZeroID is down\n- Vulnerabilities that are not fixed\n- Abandoned zites\n\nQuestion is: how we, as a ZeroNet community, can help with this issues? What should be done in order to help resolve those? I saw geekless' fork of ZN client on Gitlab - should we join and try to dig into these problems? Those should be manageable.",
				"added": 1630766994
			}
		],
		"1631096303_1FfhKMAy1xwaRvaofCgaaMuRMa7M7iWkFx": [
			{
				"comment_id": 68,
				"body": "[Recently I often have Trackers: 0/63 and files sync can take up to few days...](/Talk.ZeroNetwork.bit/?Topic:1604751153_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ)\n[Zeronet Tor Trackers](/Talk.ZeroNetwork.bit/?Topic:1611804314_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP)\n[How to fix 0 trackers? How and where to get more trackers?](/Talk.ZeroNetwork.bit/?Topic:1610655097_13M48m7JiB46SYQ2HHe6E4MHELZ5YUN7hr)\n[Almost no ZN trackers available](/Talk.ZeroNetwork.bit/?Topic:1600032770_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ)",
				"added": 1631100016
			},
			{
				"comment_id": 70,
				"body": "That's weird... So, I have 3 ISP's. While sitting on my main one, all day long I've had `0/XX` trackers active, but in debug console some files of some particular zites were loading nonetheless. I've switched to another ISP, and immediately everything started to work out smoothly, and trackers appeared to be `50/XX` active... I'm somewhat clueless about how this works...",
				"added": 1631110271
			}
		],
		"1631051842_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 69,
				"body": "If ZN will still be there, after 3 years, I'll let you know by posting some comments, that I'm still there and alive xD\nFor now, 2 shots saved me bigtime from so-called 'long covid' condition. Ofc I'm well aware about possible side effects from vaccine, but my state was much worse and could lead to even more serious condition in long-term perspective. So, for now it works for me.",
				"added": 1631109523
			}
		],
		"1631200414_1BFxHVXHTKcnWLWPVKbTknZTAaiHz6tgcV": [
			{
				"comment_id": 71,
				"body": "https://zero.acelewis.com/",
				"added": 1631200863
			}
		],
		"1631143771_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 72,
				"body": "Can you give an example of where it was used? Never heard of it",
				"added": 1631204301
			},
			{
				"comment_id": 77,
				"body": "For `nanasi` I was able to rediscover the site by public cert addr: [nanasi text board](/16KzwuSAjFnivNimSHuRdPrYd1pNPhuHqN/)\n\nI think the same can be done with `nobody` cert: [nobody](/1HfcDUpAgixShco52qfkVGyUjq7aybWHdG/) - but that will require someone to seed that zite, and it may be too old or too unpopular to pop up again.",
				"added": 1631283127
			},
			{
				"comment_id": 78,
				"body": "Content publish failed for those certs. I tried to use `nanasi` on [The All-Night Bookstore and Cafe](/13gLfTixjjktySEGHBMnmrQu4qMJpoRuXw), but toast message produces an error. Whole procedure hangs up on `Content published to 0/5 peers.` message...\n\nEdit: o_O Well now, I actually see those messages on the ZeroHello page, and even while throwing an error, those were still published, but after some time, with an error message shown.",
				"added": 1631283278
			}
		],
		"1631220839_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 73,
				"body": "I see no issues there. What providers exactly are you talking about? In my sidebar, all the providers I have (kaffie, zeroid, ifs.anon and zv.anon) are working - tested with comments, no problems spotted",
				"added": 1631224352
			},
			{
				"comment_id": 74,
				"body": "> [kaffie](#comment_1192_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I just checked and it seems polarid.bit and zeropolska.bit are having issues due to the domain names not actually being registered. The rest seem to be working fine. Perhaps someone can register those two domain names? PolarId should go here and ZeroPolska should go here.\n\nHow can one register them? What is the pre-requisites to do so?",
				"added": 1631277338
			},
			{
				"comment_id": 75,
				"body": "> [styromaniac@kxoid.bit](#comment_93_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): The sidebar isn't having problems. It's the pop-up menu.\n\nYes, I now see the `millchan` and `nobody` providers in the list (and also `nanasi` and `08chan` in some other arrays over .json files). It seems those providers are not linked to any zite - they just have the `cert_sign` public key...",
				"added": 1631282452
			}
		],
		"1632517987_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 80,
				"body": "Installed on Windows, it also won't start. I'm getting an error exception:\n\n```\n  File \"D:/ZeroNet/data/__plugins__/1BD92Qo8p2UnLfkdNeex9CgtYsn2LNAFnN\\ZeronameElectrumNMC\\SiteManagerPlugin.py\", line 27, in load\n    p = subprocess.Popen([os.path.join(electrum_dir, \"run_electrum_nmc\"),\"daemon\",\"-P\"])\n  File \"subprocess.py\", line 775, in __init__\n  File \"subprocess.py\", line 1178, in _execute_child\nOSError: [WinError 193] %1 is not a valid Win32 application\n```\n\nDidn't know you can add a `__plugins__` folder inside `data` folder. I thought it is only for zites.",
				"added": 1632549585
			}
		],
		"1627638695_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 81,
				"body": "How there can be so many opened files? What exactly counts as an `opened file`?",
				"added": 1633186530
			}
		],
		"1633231545_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 82,
				"body": "2 shots of astrazeneca, mild temperature and overwhelming weakness for 2 days. Half a year passed since the last shot, I'm totally ok. Was experiencing \"long covid\" stuff for about a month, so when vaccine was available in my town, I was more than ready to try it.\n\n32 yr old, M.\n\nP.S. @quantumkitty - you sure that your sore throat after almost a month and a vaccine shot are related? It could be anything, but we tend to blame \"the vaccine\", cause most others do so...",
				"added": 1633380141
			}
		],
		"1636622898_1L3gLHdxExJ1LT3z6PKLuzsynvf81oF5z4": [
			{
				"comment_id": 83,
				"body": "It is not working.",
				"added": 1636636581
			},
			{
				"comment_id": 84,
				"body": "Btw, there is [ZeroPolls.bit](/ZeroPolls.bit/) existing",
				"added": 1636648865
			}
		],
		"1636047405_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 85,
				"body": "@styromaniac \nSuggestion: another source you can rely on? https://github.com/XIU2/TrackersListCollection",
				"added": 1636653798
			},
			{
				"comment_id": 86,
				"body": "> [styromaniac@kxoid.bit](#comment_217_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Do they have 100% uptime? newTrackon's trackers do.\n\nI'm not quite sure. There is a `best.txt` file, maybe those are with the best uptime.\nHow do you measure an uptime of each tracker individually anyway?",
				"added": 1636661466
			}
		],
		"1636696143_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 87,
				"body": "> [xanadu](#comment_45_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH): Do they have Windows builds yet?\n\nNope, but you can download https://github.com/HelloZeroNet/ZeroNet-win/archive/dist-win64/ZeroNet-py3-win64.zip, unpack it. Then download https://github.com/zeronet-enhanced/ZeroNet/archive/refs/heads/massive-rework.zip and unpack it into the `core` dir of original folder, replacing files. Should work in theory :) I'm running it under Win10 without .exe file, but that require `python 3.9` installed on your machine, along with some Visual c++ compilator tools deps.\n\nOriginal old version works just fine, so I think for now it is not for general usage. Lots of tests are needed before the stable release could be compiled.\n\nI should also mention that if you move `/tools/tor` folder, it will not work - at least it is for me, showing 0 trackers (only one tracker managed to get to 25% success)",
				"added": 1636731096
			},
			{
				"comment_id": 88,
				"body": "> [xanadu](#comment_61_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH): Perfect that means it was Tor binarry making issues with ZeroNet not working :)\n\nYes, TOR in old bundle is not working. I will try to tinker with it.",
				"added": 1636849695
			},
			{
				"comment_id": 89,
				"body": "Okay, I think it works with the latest TOR bundle, meek bridge and all the stuff (this message was sent through TOR, and my Ip is changed during the launch, as console shows).\nThe only bottleneck is that you have to run\n`tor --service install -options ControlPort 9051` on win to run it as a service and open corresponding port.\nI think it somehow needs to be embedded into init script.",
				"added": 1636853600
			},
			{
				"comment_id": 90,
				"body": "> [styromaniac@kxoid.bit](#comment_230_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): You can set that in torrc.\n\nThat's not the issue. It works unstable, and I'm not quite sure where the problem is. Refer to https://github.com/zeronet-enhanced/ZeroNet/issues/5\n\nIt seems the issue with the `meek-client` - when it fails to start, TOR works.",
				"added": 1636862406
			}
		],
		"1637248722_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH": [
			{
				"comment_id": 91,
				"body": "There is always an instance admin, and if you don't like someone else's instance, you can always run up your own, so it will be uploaded there, I think? I.e. read here: https://docs.joinpeertube.org/admin-remote-storage\n\nSo your uploaded-to-an-instance video can be uploaded to Amazon S3 bucket, if instance admin set up his conf to work that way, or your video can be directly uploaded to his local HDD/SDD. If you really care about where your data is stored, you need to run an instance on your configured and controlled machine. ",
				"added": 1637281383
			}
		],
		"1637391430_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 92,
				"body": "What's the error? Why can't you sign?",
				"added": 1637402821
			}
		]
	},
	"comment_vote": {
		"1276_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"167_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"20_1E1ETHw8wzWhza7R49wyrM1U9ZRHvykejr": 1,
		"19_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE": 1,
		"6_1Hbt9rJ8U9kpEFaxHAfLWzxWtKRYiEDb2G": 1,
		"170_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"71_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"81_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"258_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"452_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"236_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"398_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"2494_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"10_1KCaZNP1gDSMcaCJ9o5yW8antSVefNuv7a": 1,
		"240_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"2539_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"160_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"53_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"1161_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"2612_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1_13Vz54JPp7uho5FaMyyi9hv7yi8zJHVhkv": 1,
		"41_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1": 1,
		"81_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"890_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"896_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"3197_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"46_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH": 1,
		"84_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH": 1,
		"1000_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1
	}
}