{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "CI SIAMO TRASFERITI SU ZEROTALK ITALIA ++",
			"body": "Raggiungeteci a questo link: http://127.0.0.1:43110/1F7TpbhQiKbERqvuYm92yg7uapy5Qb7qrD/\n\nIl proprietario di questo zerotalk (sifr) non è più attivo su ZeroNet e quindi non è più possibile aumentare lo spazio nel disco per gli utenti che hanno già raggiunto il limite. Inoltre Zerotalk++ è molto migliore della versione nativa. Avviserà nofish perchè metta il nuovo link sullo zerotalk inglese",
			"added": 1587545739
		},
		{
			"topic_id": 2,
			"title": "Nuovo URL per il mio proxy ZeroNet!",
			"body": "Ho comprato un dominio .com per il mio proxy! Il nuovo url per raggiungerlo è questo: https://0net-preview.com\n\n...facebook però continua a bannarlo!!! (ho scoperto che di default banna tutti i sottodomini duckdns.org, compreso il mio vecchio url, tuttavia dice ancora che il mio link è spam!)",
			"added": 1598564601
		}
	],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1_1MfKWCXoRDe1yAqBzTcqi6mqgpYqzg8Va9": [
			{
				"comment_id": 1,
				"body": "I siti illegali ci sono qui come sul clearweb (anzi forse nella rete \"in chiaro\" sono anche più diffusi, ti basta metter su un server su un paradiso fiscale o nell'est europa per fare praticamente quello che vuoi) dove è anche più semplice raggiungere eventuali acquirenti\n\nIl fatto che i contenuti siano P2P non li rende più difficilmente bloccabili che su sistemi server based per la semplice ragione che anche con i sistemi classici io posso copiarmi qualcosa di illegale in locale e poi ridiffonderlo in altri canali. Internet è nato per resistere alla censura! (una cosa sparisce dalla clearnet solo se non interessa a nessuno...come su zeronet!)\n\nE' poi anche vero che se nei sistemi server based il gestore del server risponde per prima dei contenuti illegali con l'obbligo di rimozione, qui è l'utente che li crea o li condivide a risponderne direttamente! (a mio parere cosa molto più giusta, non sempre un admin è online h24 ed omniscente...)\n\nZeronet non è anonimo di default (se lo usi senza TOR il tuo indirizzo IP è pubblico, quindi sei molto vulnerabile). Accedere alla clearnet via TOR rende altrettanto complicato risalire a chi crea o diffonde un contenuto.\n\nSu zeronet se tu non accedi a contenuti illegali non li scarichi sul tuo PC e non li diffondi, quindi la questione della responsabilità permane come sulla clearnet.\n\nD'altro canto i sistemi P2P presentano enormi vantaggi in termini di prestazioni e soprattutto di MODERAZIONE DEI CONTENUTI! (se io non voglio più comunicare con qualcuno lo banno e basta, non devo chiedere nulla a nessun admin) oltre a rendere impossibile creare bolle di filtraggio che limitano la libertà di informazione degli utenti! Questo è il vero vantaggio di zeronet! Di modi per commettere attività illecite più efficaci, fra clearnet ed hidden service, il mondo è già pieno...",
				"added": 1578077205
			},
			{
				"comment_id": 5,
				"body": "> [peppefail](#comment_11_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ): Se non sbaglio sulle reti p2p non puoi bannare direttamente un utente. Sono io che sbaglio?\n\nSbagliato! Il punto di forza è proprio che posso bannare chiunque senza chiedere nulla a nessuno e decidere  cosa condividere! Per bannare un utente su zeronet ad esempio ti basta inserire il suo nick su zeroid, ti comparirà un popup che ti chiederà di confermare l'azione di mute (se gli dai ok tutti i contenuti creati da questo utente verranno cancellati dal tuo pc). Puoi cancellare anche interi ziti se non ti piacciono da zerohello. In più sono disponibili diverse liste per filtrare automaticamente utenze o ziti con varie caratteristiche (ci sono blocchi per la roba illegale, spammer, troll, pornografia, ecc...) in questo modo non rischi di condividere nulla nemmeno per sbaglio cliccando su un link casuale",
				"added": 1581067609
			}
		],
		"2_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 2,
				"body": "il diritto all'anonimato, quando le idee contavano di più delle persone che le esprimevano e dell'apparenza che oggi domina il web; quando si collaborava invece di competere uno contro l'altro (come anche nella vita reale); quando nascevano progetti sempre nuovi e li si vedeva crescere (oggi invece crescono solo gli iscritti ed i like, rimpiango alcuni vecchi siti del passato che ora non esistono più, uccisi quasi tutti da facebook&co.)\n\nrimpiango la libertà di informazione che prima c'era senza le bolle di filtraggio, rimpiango lo spirito di collaborazione che animava le community P2P, gli artisti Creative Commons e gli sviluppatori del mondo Open Source (oggi invece conta solo il quattrino) \n\n...e spero che Zeronet possa riportarmi un giorno un po' di tutto questo! (lo sta già facendo)",
				"added": 1578077776
			},
			{
				"comment_id": 3,
				"body": "il diritto all'anonimato, quando le idee contavano di più delle persone che le esprimevano e dell'apparenza che oggi domina il web; quando si collaborava invece di competere uno contro l'altro (come anche nella vita reale); quando nascevano progetti sempre nuovi e li si vedeva crescere (oggi invece crescono solo gli iscritti ed i like, rimpiango alcuni vecchi siti del passato che ora non esistono più, uccisi quasi tutti da facebook&co.)\n\nrimpiango la libertà di informazione che prima c'era senza le bolle di filtraggio, rimpiango lo spirito di collaborazione che animava le community P2P, gli artisti Creative Commons e gli sviluppatori del mondo Open Source (oggi invece conta solo il quattrino) \n\n...e spero che Zeronet possa riportarmi un giorno un po' di tutto questo! (lo sta già facendo)",
				"added": 1578078176
			}
		],
		"3_1NDdp5wQYRqdq2CeRVASnskd1EHkqS6RCQ": [
			{
				"comment_id": 4,
				"body": "ti interessa un seed 24h 7 giorni su 7 online? se vuoi ti aggiungo alla mia seedbox",
				"added": 1580892817
			}
		],
		"3_1F6FQgdgai5JKv3DK3AGF3yLuNpeAjMbTQ": [
			{
				"comment_id": 6,
				"body": "0list è indicizzato da zerohello. lo uso per trovare nuovi ziti per il proxy http://127.0.0.1:43110/186THqMWuptrZxq1rxzpguAivK3Bs6z84o/",
				"added": 1599126371
			}
		],
		"2_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 7,
				"body": "adesso che ho disabilitato il vecchio dominio duckdns non lo banna più, però da zerotalk punta al sito e non ai singoli post",
				"added": 1599126813
			}
		]
	},
	"comment_vote": {
		"7_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": 1
	}
}