{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1599540468,
			"title": "Private sites for ZeroNet",
			"body": "https://www.reddit.com/r/zeronet/comments/ij3tcf/an_idea_for_private_pages_on_zeronet/\nhttps://github.com/jstrieb/link-lock\n\nNo experience with it, but the kid appears to have done good here. He put some time into it.\n\n\"Link Lock uses AES in GCM mode to securely encrypt passwords, and PBKDF2 and salted SHA-256 (100,000 iterations) for secure key derivation. Encryption, decryption, and key derivation are all performed by the SubtleCrypto API. The initialization vector is randomized by default, but the salt is not. Randomization of both the initialization vector and salt can be enabled or disabled by the user via \"advanced options.\" The salt and initialization vector are sent with the encrypted data if they are randomly generated. The API is versioned such that old encrypted links will always work, even if later versions of Link Lock are updated to be more secure. Please read the code (api.js in particular) for more information.\"\n\n\"\n\n    I am a college student, not a security professional – there may be best practices I am not aware of.\n    Once someone decrypts a link, they can share the original URL as much as they want. Only share encrypted links with trusted people.\n    I am not comfortable using JavaScript, and I don't have a firm grasp of the nuances of the language – there may be bugs that I don't even know to check for.\n    This is the first project I have ever done using encryption – there is likely a subtle mistake somewhere.\n    Most of the encryption/decryption code is based on MDN tutorials for the SubtleCrypto API.",
			"added": 1599540467
		}
	],
	"topic_vote": {},
	"next_comment_id": 24,
	"comment": {
		"1599528409_1CZfuDkX6sVNsQKh4SrF2gKU2Yij1kYeuo": [
			{
				"comment_id": 1,
				"body": "No problems posting .mp4s or webms.  Sometimes the Tor browser is cranky, but Firefox always works. Seriously find it easier to post on ZeroNet than the clear web...so something is amiss on your setup. Once you identify the problem hopefully a good laugh.\n\nI wish I could post mkvs.",
				"added": 1599530252
			},
			{
				"comment_id": 2,
				"body": "Did you obtain a ZeroID?",
				"added": 1599530276
			},
			{
				"comment_id": 23,
				"body": "> [papull](#comment_4_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G): In P2P your content has to be popular otherwise nobody will seed it.\n\nI'm trying to seed almost everything. You should too. All of us need to get past this idea that \"someone else will do it\". When a newbie comes down here - he expects ZeroNet to work. If it doesn't - he leaves. Nofish can't carry this alone.",
				"added": 1599703937
			}
		],
		"1599385493_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": [
			{
				"comment_id": 3,
				"body": "Tried building a node many years ago (10 years?), but it had a bad memory leak - so I gave it up. Probably will try again soon.\n\nI did like it's ability to index sections of the internet which received only superficial google indexing. It's a good tool to use if you are buying things.",
				"added": 1599530443
			},
			{
				"comment_id": 4,
				"body": "> [thorburn](#comment_126_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): I wouldn't say it's specifically aimed at laymen as it has some advanced functionality. Having said that it does seem to be aimed at a broad user base. I'm not familiar with SearX and YaCy is new to me so my opinion isn't worth a great deal to be honest.  [...]\n\nI need it to work entirely on an atom platform. Not interested in building power sucking monsters again.\n\nUnfortunately, haven't seen many Java platforms which behave well on low powered hardware. Tis a pity......",
				"added": 1599530640
			}
		],
		"1598683262_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 5,
				"body": "Yeah, that's pretty amazing. Censorship is so casual too. Both government and industry are indulging themselves today.",
				"added": 1599531081
			},
			{
				"comment_id": 6,
				"body": "> [driud](#comment_116_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Look towards Russia.Their systems work fine all the time.They have been replaced with others, and therefore work..Popatrzcie w kierunku Rosji.Ich systemy działają cały czas dobrze.Zostały wymienione na inne, i dlatego działają.\n\nPlease expand on this. I'm listening.\n\nIf you are a Russian citizen, how successful have you been in avoiding censorship?\n\nBTW, I'm currently looking for books/manuscripts detailing how everyday Russians managed to communicate while thwarting Soviet controls.",
				"added": 1599531277
			},
			{
				"comment_id": 22,
				"body": "> [bigbadbob](#comment_1139_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I wonder why the rioters do not burn down google?  They are on a roll burning stuff after all, or so I hear.\n\n+++++++++",
				"added": 1599703734
			}
		],
		"1599012296_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 7,
				"body": "She was born with this tendency. Why come out with another rule/requirement for everyone else? It's unlikely to be successful anyway. Nature is a cruel taskmaster....\n\nWork on things which aren't hopeless. Where there's really a chance for success.",
				"added": 1599532404
			}
		],
		"1591804075_12MBVCw8iNrKvgTrV5NMPtPf6Z5V2WRHYU": [
			{
				"comment_id": 8,
				"body": "> [frankwalter](#comment_9_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV): The main problem with zeronet, in my opinion, is that webmasters believe it is the web, as they left it in the centralized internet. But no, zeronet, as Wikipedia says, is a web-like, and requires completely different design choices from the normal web. Even as soon as a site far exceeds the default quota of 10 mb, it is very likely that the site was poorly designed. It is not uncommon to see mp4 stuck directly into the browser's <video> player which obviously gives problems, or pages that act as galleries full of images that all consume the quota of 10 mb by default. A website that takes full advantage of zeronet potential, which was designed FOR zeronet, can easily host millions of users.\n\nThanks for this clarification.",
				"added": 1599532648
			}
		],
		"1595165517_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 9,
				"body": "Naw....it's just that people have other interests. ZeroNet is just another tool to satisfy those interests. It's not the end objective. In reality, ZeroNet is probably unsustainable if countries would live up to their free speech promises.\n\nGiven current trends - you worry too much. There's a do-gooder somewhere right now ready to dedicate their lives to annoying you. Every time such creeps win - ZeroNet wins.\n\n\"Screw this - I'll get on ZeroNet\".",
				"added": 1599534283
			}
		],
		"1597726785_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ": [
			{
				"comment_id": 10,
				"body": "4chan is just another company which believes it can't be replaced.",
				"added": 1599534609
			}
		],
		"1597857981_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7": [
			{
				"comment_id": 11,
				"body": "Who cares anymore? Let's do it.",
				"added": 1599539063
			}
		],
		"1596775198_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg": [
			{
				"comment_id": 12,
				"body": "Humans do many things which don't make sense. So it is annoying when someone turns these things into religions. But it's not something these people can turn off. They're frightened and NEED to believe in their rabbits foot.\n\nEven cattle are given some comfort before entering the slaughter chute. So would would you deny this frightened neighbor their small relief? Maybe not the time to attack these people with fact?",
				"added": 1599539438
			}
		],
		"1596497359_12kkzRK2n9vRvQLcycbGZNsD3vqzWe1Jeh": [
			{
				"comment_id": 13,
				"body": "You'll never have Communism in a truly violent society or one comprised of potentially violent people. Communism is for those who obey. Pretty clear now...free thought is violence. Communists know it ends with their destruction.",
				"added": 1599539650
			}
		],
		"1590015602_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 14,
				"body": "Given all the grief he attracts from good deeds - it would be amazing if he speaks to anyone.",
				"added": 1599539773
			}
		],
		"1598893256_1KCaZNP1gDSMcaCJ9o5yW8antSVefNuv7a": [
			{
				"comment_id": 15,
				"body": "I'll watch if they host more antifa burnings like in Portland a few nights back.....Otherwise, boring.\n\nLast night was kind of a dud. Couldn't hear him screaming while running around trying to put himself out. Really takes something out of that video :(",
				"added": 1599540047
			},
			{
				"comment_id": 16,
				"body": "> [0mega](#comment_8_192xAupujZXB6jpoWqpwobPnEdQovAKiXc): there you are ya tiny trumptard shit fly. What are you going to do when your POS trump eats a bullet?\n\nWell, the right needs a martyr. You volunteering to give us one?",
				"added": 1599540140
			},
			{
				"comment_id": 20,
				"body": "> [0mega](#comment_8_192xAupujZXB6jpoWqpwobPnEdQovAKiXc): there you are ya tiny trumptard shit fly. What are you going to do when your POS trump eats a bullet?\n\nWhat will YOU do if he survives - then executes karma?",
				"added": 1599703140
			}
		],
		"1599173288_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 17,
				"body": "Agreed. But does this matter? Will you ever trust your government again?\n\nWe always knew these guys cheated...but imagined it was specific. None of us had any idea it was being done at production scale.\n\nIn a just world, EVERYONE connected with these projects would be brutally killed. If the US ever falls like East Germany - I plan to get my hands on all those records. Hopefully as a means to serve up true Karma.\n\nThe NSA sold us out.",
				"added": 1599540885
			},
			{
				"comment_id": 21,
				"body": "> [krombopulusmike](#comment_19_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e): I support these statements! :) [...]\n\nI'm tired of giving a surveillance pass to left or right. The ONLY thing exceptional in US government is our Bill of Rights. Otherwise, our rascals are the same as anyone's rascals. Why I'm concerned at our failure. Our failure to identify these pricks and kill them - whatever the cost.\n\nDid you notice than former general Alexander just joined the board of directors at Amazon? Why are he and Clapper still alive?",
				"added": 1599703508
			}
		],
		"1597367837_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": [
			{
				"comment_id": 18,
				"body": "Ever hear of Scuttlebutt? Haven't looked at in awhile, but it seemed to have potential. In an emergency, could serve as \"backhaul\" for more limited mesh networks. Scuttlebutt is modernized sneakernet with crypto. More complicated version of the Russian's Samizdats (illegal publications).\n\nOld Russians who remember the Soviet Union are the experts here. Wish they would commit what they know to text so \"rest of us\" could learn.",
				"added": 1599541528
			},
			{
				"comment_id": 19,
				"body": "> [otbtechh22f4wcuo](#comment_24_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb): Thanks! [...]\n\nPlease use that coding talent elsewhere. There are many unmet needs for P2P internet right now.\n\nEven something as simple as a library of restoreable disk images. Try to find a copy of this right now: https://freenetuser.wordpress.com/2008/05/11/freeneti2p-appliance-part-2/\n\nIt's the same with onion sites. No mortals really understand how to set them up properly. And opportunities abound in the spec: https://www.void.gr/kargig/blog/2015/04/10/onion-service-authorization-cookie/\n\nThe only version of onions available to little people is \"Onionshare\".",
				"added": 1599702590
			}
		]
	},
	"comment_vote": {
		"8_192xAupujZXB6jpoWqpwobPnEdQovAKiXc": 1
	}
}