{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1635374346,
			"title": "-SZPRYCA-",
			"body": "-SZPRYCA-\nPolecam poniższy film:\nhttps://odysee.com/@EfektSetnejMaply:4/Pressconferenz1_pl:1\nJest to pierwsza część konferencji patologów w Reutlingen z polskimi napisami.\nTu jest druga część, ale tylko po niemiecku:\nhttps://odysee.com/@de:d/Pathologie_Konferenz_Reutlingen_Teil_2:7\nA tu cała konferencja w jednym kawałku.\nhttps://video.aletheia-scimed.ch/video/94/pressekonferenz-tod-durch-impfung-undeklarierte-bestandteile-der-covid-19-impfstoffe-1 \nKrótko o rzeczonej konferencji prasowej. Na początku pierwszej części specjalista od analizy statystyk, prof. dr. Werner Bergholz powiedział tak – w oparciu o oficjalne dane statystyczne: w latach 2000 – 2020 rocznie wykonywano w Dojczlandii około 40 milionów różnych szczepionek i rocznie meldowano ok. 20 zgonów w zbieżności czasowej ze szczepionkami (w sumie więc w latach 2000 – 2020 zanotowano ok. 400 zgonów w bliskim powiązaniu czasowym ze szczepionkami). W roku 2021 do końca lipca odnotowano 1230 zgonów w bliskim związku czasowym ze szprycami rzekomo na covida.\nNastępnie przemawiał, i to długo, ok. godzinę, patolog prof. dr Arne Burkhardt, które wespół z innym patologiem, prof. dr. Walterem Lange przeanalizowali podesłane im wyniki badań patologicznych 10 przypadków zgonów w bliskim powiązaniu czasowym ze szprycami rzekomo na covida. Profesor Burghardt otrzymał także próbki tkanek zmarłych, które sam zbadał i sfotografował pod mikroskopem. 5 przypadków patolodzy zakwalifikowali jako bardzo prawdopodobne zgony od szpryc, dwa jako prawdopodobne, jeden jako niejasny ale możliwy i jeden jako raczej przypadkowy. Jeden nadal jest badany. Prof. Burghardt parokrotnie podkreślał, że we wszystkich przypadkach konieczne byłyby dalsze badania histologiczne, niemniej to co z prof Lange widzieli, wprawiło ich w osłupienie. Na części zdjęć wykonanych pod mikroskopem widać takie zmiany w tkankach i naczyniach krwionośnych, na które medycyna nie ma jeszcze określeń i patolog nie wiedział, jak je nazwać. Stwierdził, że z czymś takim nie spotkał się przez 40 lat pracy w patologii. Potwierdził to i drugi patolog. Chorobowe zmiany dotyczyły wszystkich organów (mózg, serce, płuca, wątroba, nerki, trzustka), a także włókien mięśniowych serca i naczyń krwionośnych. Mówił o zatorach, zawałach, o zaburzeniach systemu immunologicznego i to w dwóch kierunkach. Z jednej strony stwierdził coś co nazwał amokiem limfocytów (białych ciałek krwi odpowiedzialnych za obronę immunologiczną), które występowały o ogromnej ilości nawet tam, gdzie normalnie nie powinno ich być, co wskazuje na b. silną reakcję autoimmunologiczną – czyli zwalczanie przez limfocyty własnych tkanek organizmu. Z drugiej strony u innych limfocytów widać było jakby „wyłączenie” systemu immunologicznego przypominające objawy HIV, a więc zanik obrony immunologicznej przed ciałami obcymi w organizmie.\nProf. Burghardt poinformowałe też o tym ,że w szprycach produkowanych w Hiszpanii Japończycy stwierdzili obecność stali szlachetnej, której w jakichkolwiek szczepionkach być nie powinno. Zwrócili się z tym do producenta, ale on ich zastrzeżenia zignorował: stal szlachetna jest w medycynie powszechnie stosowana, choćby w rozrusznikach serca. Z tym zgoda – ale nie powinna nigdy w małych fragmentach pływać w żyłach – a tak jest po szprycach.\nPo nim krótko przemawiał drugi patolog, prof. dr Walter Lang. Sam przyznał, że ich badania nie są jeszcze zakończone, że potrzebne są jeszcze szczegółowe badania histologiczne, niemniej to co do tej pory stwierdzili w większości badanych przez nich przypadków jest tak zatrważające, że zdecydowali się podać ich dotyczczasowe wyniki badań do opinii publiczej. Nie ma czasu na zwłokę – powiedział, czas ucieka. Na myśli miał naturalnie to, że tymi szprycami nadal szprycuje się miliony ludzi nie informując ich absolutnie o ewentualnych skutkach ubocznych i ryzyku ciężkich powikłań i zgonów.\nW drugiej części za stołem konferencyjnym zasiadło dodatkowo trzech prawników, w tym jeden z pozaparlamentarnej komisji śledczej w sprawie covid, a ponadto „online” wypowiadało się czterech lekarzy. Była mowa o tym, jak szpryce prawdopodobnie wywołują „turbo”-nowotwory, tzn. aktywizują nowotwory, które od kilku lat praktycznie nie rosły, a po szprycach ich wzrost praktycznie eksploduje. Była mowa o szpitalach, których władze zakazują zapisywania przy przyjmowanych pacjentach faktu, że zostali zaszprycowani. Łatwo się domyślić, że nie zostaną oni ujęci w statystykach powikłań poszprycowych, a gdy umrą – w statystykach zgonów szprycowych. Pokazano wiele zdjęć pod mikroskopem, a także filmów pod mikroskopem, gdzie widać, ile i jakich zanieczyszczeń znajduje się w szprycach rzekomo na kowida. Grozę budzą zwłaszcza pływające w szprycach cieniuteńkie blaszki o ostrych krawędziach, ale i różnego rodzaju „nitki”. Były też zdjęcia i filmy pokazujące patologiczne zmiany wyglądu krwi pod mikroskopem u osób zaszprycowanych. Jeden z lekarzy stwierdził u swoich zaszprycowanych bez jego wiedzy pacjentów, że subiektywnie czują się dobrze i zdrowo, choć morfologia ich krwi jest totalnie zaburzona. Jak długo potrwa, nim i u nich pojawią się choroby, zakrzepy i zawały, na razie nie wiadomo.\nByło i o znalezionych w szprycach domieszkach chromu, niklu i stali nierdzewnej (nikiel jest wysoce alergiczny). Parokrotnie też powoływano się na patologa z Heidelbergu, Petera Schirmachera, o którym pisałem na blogu:\nhttps://opolczykpl.wordpress.com/2021/08/07/uboj-szprycowy-patolog-peter-schirmacher-domaga-sie-obdukcji-zwlok-osob-wczesniej-zaszprycowanych/\nDomagał się on obligatoryjnych obdukcji zmarłych, którzy do dwóch tygodni przed zgonem zostali zaszprycowani. Tylko – skoro lekarze mają zakaz odnotowywania w karcie chorego, że był zaszprycowany – to i obdukcji im nikt nie zrobi, gdy umrą. I tak ogromna większość ofiar szpryc nie ląduje w statystykach.\nByła mowa i o tym, że w Austrii już planuje się szprycowanie nawet kilkumiesięczne niemowlęta.\nW sumie konferencja ta były czymś w rodzaju horroru – aż włos się jeży na głowie, gdy się wie, co w tych szprycach jest i jak one działają.\nUczestników konferencji łże-media zaatakowały z furią. Także usłużni „eksperci” medyczni i reżimowi patolodzy.\nhttps://www.focus.de/gesundheit/news/ex-pathologen-schueren-aengste-tod-durch-corona-impfung-das-sagen-experten-zu-den-dubiosen-thesen-im-netz_id_24274735.html\nhttps://correctiv.org/faktencheck/2021/09/25/mitglieder-der-pathologiekonferenz-verbreiten-unbelegte-behauptungen-ueber-covid-19-impfungen-und-todesfaelle/\nZarzucono patologom przede wszystkim „brak naukowości”. A przecież w łże mediach na temat szpryc w ogóle nie prowadzi się nawet pseudonaukowych dyskusji – szpryce są zbawienne, nieszkodliwe i tyle. Ja sam tak wysoce naukowej prelekcji o szkodliwości szpryc niby przeciwko covidowi, jak ta prof. dra Arne Burkhardta, dotąd chyba nie słyszałem. Ale dlatego właśnie, że była profesjonalna, taką wściekłą nagonkę na patologów wywołała.\nSzkoda, naprawdę szkoda mi tych ogromnych rzesz ludzkich pchających się pod te szpryce…\n.\nopolczyk",
			"added": 1635374345
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1636101927_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 1,
				"body": "Dobre. To się nazywa biznes w stylu \"Pejsaty\".",
				"added": 1636103920
			},
			{
				"comment_id": 2,
				"body": "Była pod kontrolą od pierwszego dnia? To srajfony pomogły to ogarnąć, Ludzie nie mogą zrozumieć, że są kontrolowani i manipulowani...To był sprawdzian, ilu wyjdzie na ulicę? To nie może się wymknąć spod kontroli.\nSiemka.",
				"added": 1636217301
			}
		],
		"1637760903_1JQ7XEWHdu1zMKq7dBrdBereQqRJL6Zcpi": [
			{
				"comment_id": 3,
				"body": "Słowenia się ruszyła? Efekt setnej małpy zaczyna działać. Ciekawe kto następny?",
				"added": 1637795220
			}
		]
	},
	"comment_vote": {}
}