{
	"next_post_id": 34,
	"next_comment_id": 3,
	"next_follow_id": 1,
	"avatar": "jpg",
	"user_name": "Ussr2",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "Rus",
	"post": [
		{
			"post_id": 1577678561,
			"body": "Как же задолбал уже обычный интернет... Всякие там Яндекс-Дзены, ВКонтакте и прочие Фейсбуки. С какого хрена они так уверены, что знают что именно мне хочется читать? На фиг! Буду писать тут. \nИ читать тут! ",
			"date_added": 1577678559
		},
		{
			"post_id": 1577678920,
			"body": "Собственно имя, под которым я здесь зарегистрировался , как раз и показывает мой главный интерес - я хочу вернуть СССР. Но её тот который был - при всех его достоинствах в нем так и не была решена главная проблема человеческого сообщества и это в итоге его и разрушило. И проблема эта - власть!  ",
			"date_added": 1577678917
		},
		{
			"post_id": 1577679179,
			"body": "Я поясню предыдущий пост. Проблема власти, которую до сих пор не решили это отсутствие механизма, позволяющего выделить из народа (из большинства) лучших из лучших. И дать им власть. А кроме того, позволяющего убрать от власти тех, кто перестал быть лучшим. ",
			"date_added": 1577679175
		},
		{
			"post_id": 1577679476,
			"body": "Я понимаю, что эту проблему пытались решить столько же, сколько существует человечество. В принципе небольшие коллективы, где все друг друга знают, в таком механизме не нуждаются - и легко самоорганизуются. Проблемы возникают в больших сообществах, где всех знать просто невозможно и требуется доверие. ",
			"date_added": 1577679471
		},
		{
			"post_id": 1577679986,
			"body": "К сожалению, когда в человеческом обществе встаёт вопрос доверия к незнакомому тебе человеку, сразу возникают проблемы. Разные. Начиная с того, что можно быть обманутым тем, кому довериться сразу и заканчивая тем, что люди меняются и тот, кому смело можно было доверять раньше, легко предаёт своих сегодня. ",
			"date_added": 1577679980
		},
		{
			"post_id": 1577680212,
			"body": "Если смотреть на то, как была организована власть раньше и сейчас, можно легко заметить, что по сути она не изменилась за тысячелетия - власть оказывается у того, у кого есть возможность её взять! И обычно это не самые приятные персонажи. ",
			"date_added": 1577680205
		},
		{
			"post_id": 1577698816,
			"body": "Есть кое - что, что обычно оказывается за пределами нашего внимания - по сути власть всегда в руках людей, которые с ней согласны. В наших руках. Просто все мы не представляем, что может быть как-то иначе. Ведь даже Советская власть была властью избранных. И в итоге переродилась сами видите во что. Если бы те, кто имеет власть,  понимали, что в любой момент могут этой власти лишиться (перестань они соответствовать своей должности)то сейчас была бы совсем другая жизнь. И не только у нас. ",
			"date_added": 1577698808
		},
		{
			"post_id": 1577709581,
			"body": "Самое, на мой взгляд забавное, что ВСЕ (!) люди так или иначе находятся в поиске этого самого решения. Власть! Это именно то, чего практически все (а на мой взгляд - вообще все!) лишены в этой жизни. Власть над собственной жизнью, власть быть тем, кем хочется.",
			"date_added": 1577709572
		},
		{
			"post_id": 1577767981,
			"body": "Знаете, что на мой взгляд сейчас самое любопытное? Мы сейчас с вами находимся в прототипе системы, которая легко может перевести человечество на совершенно другой уровень развития. Да-да,  я говорю вот об этом самом сайте. ",
			"date_added": 1577767971
		},
		{
			"post_id": 1577768207,
			"body": "Конечно это именно прототип. Модель. Хотя и действующая. Но кое - что в ней уже имеется. Этот сайт нельзя (хотя возможно я всего не знаю) заблокировать, и по большому счету люди сами решают что им читать и что делать. ",
			"date_added": 1577768196
		},
		{
			"post_id": 1577769935,
			"body": "Важно понимать - чего конкретно не хватает этому сайту, чтобы стать именно инструментом самоорганизации людей. А не хватает возможности самоуправления. Здесь пока невозможно ввести те правила, какие пользователям хотелось бы иметь  и нельзя сообществу влиять на отдельных людей. ",
			"date_added": 1577769923
		},
		{
			"post_id": 1577770398,
			"body": "Возможно кто - то не согласится  : каким это образом возможность устанавливать правила, а сообществу влиять на отдельного человека, может помочь самоорганизации? Но подумайте - а что ещё нужно - то для этого? ",
			"date_added": 1577770385
		},
		{
			"post_id": 1577770889,
			"body": "Человеческое общество существует именно благодаря тому, что люди могут договориться между собой о совместной деятельности, либо об общих правилах совместного проживания. И имеет возможности следить за выполнением этих договорённостей. Конечно в случае государства эти принципы сплошь и рядом нарушаются, но это не отменяет самого факта существования этих договорённостей. Кроме того никто не будет отрицать существования целых организаций, созданных принуждать к исполнению договорённостей. ",
			"date_added": 1577770875
		},
		{
			"post_id": 1577771178,
			"body": "В случае государства, большинство оказывается в роли пассивных исполнителей договоров и правил. Но как раз оно (большинство) и должно их вырабатывать. Ведь никто, кроме конкретного человека не знает лучше него его собственную жизнь и необходимости. И всегда оказывается, что правила подходящие большинству - наилучшие. ",
			"date_added": 1577771163
		},
		{
			"post_id": 1577773755,
			"body": "Возможно я говорю спорные вещи - я вот совершенно уверен, что всякие деятели культуры со мной точно будут не согласны, ведь в их  глазах культура - дело избранных, но я абсолютно уверен, что любой человек стремится к развитию. И лишь существующие условия останавливают его стремление. ",
			"date_added": 1577773739
		},
		{
			"post_id": 1577798254,
			"body": "Ну что ж, дорогие обитатели Zeronet, с наступающим всех вас Новым 2020 годом! Пусть наконец сбудутся вещи самые сокровенные мечты и жизнь в кои-то веки станет простой и понятной. Чтобы не гнаться за тем, что нам на фиг не нужно и радоваться тому, что достойно радости! Счастья вам всем! ",
			"date_added": 1577798237
		},
		{
			"post_id": 1577798490,
			"body": "Happy new year to all the habitans of the Zeronet! Enjoy you!  ",
			"date_added": 1577798472
		},
		{
			"post_id": 1577955610,
			"body": "Новый год наступил!  И вот о чем подумалось - почему до сих пор столько людей верят в то, что решение основных жизненных проблем находятся внутри конкретного человека? Изменись сам и изменится всё! Слышали наверное? Вот только это развод!  Не может порядочный человек по желанию стать подонком. И видеть плохое хорошим тоже невозможно. Изменить к лучшему можно лишь изменив условия обитания для всех. Как - это другой, отдельный вопрос. Но если улучшать что - то для отдельных людей, то всем лучше точно не станет. ",
			"date_added": 1577955591
		},
		{
			"post_id": 1577979672,
			"body": "Знаете, я больше не верю в революции. Не в сами революции,   конечно - многое ведь сейчас кардинально изменилось благодаря науке и ее техническим достижениям. Но вот в революции путем народного восстания - не верю. А вот в новые технологии - верю ! И в то, что через них мы сможем изменить жизнь к лучшему - тоже верю. С помощью технологий, а не благодаря только им. Делать-то всё всё равно придётся рученьками. ",
			"date_added": 1577979652
		},
		{
			"post_id": 1578042772,
			"body": "Говоря о том, без чего на мой взгляд невозможно истинное народовластие, необходимо хоть как-то представить - что это такое вообще. Вернее, чем оно должно быть. Здесь вообще очень много путаницы. Ясно, что власть не может принадлежать всем в равной степени - нельзя к примеру 7-8 летнему ребёнку доверить управление пассажирским автобусом, даже, если этот ребенок будет знать правила дорожного движения и уметь управлять автобусом... ребёнок в этом возрасте просто ещё не осознает в должной степени личную ответственность. И за себя, и тем более за свои поступки, от которых может зависеть жизнь и здоровье других людей. (А почему вы думаете подростки порой так жестоки?) Вывод: необходимо доверять власть (управление) тем, кто до неё дорос. И сразу же возникает вопрос : а кто собственно должен определять готовность человека? И из каких соображений? Разумеется первым в голову приходят экзамены и экзаменаторы. Но тут мы попадаем в замкнутый круг, задавшись вопросом - а кто достоин быть экзаменатором и как определить его готовность. И чтобы выйти из этого круга нужно предложить нечто, чего еще не было. ",
			"date_added": 1578042751
		},
		{
			"post_id": 1578061620,
			"body": "Как ни крути, когда мы рассуждаем о власти, какой она ДОЛЖНА БЫТЬ, мы неизбежно упираемся в необходимость некоего идеального человека. Или разума. Неподкупного, не меняющего собственные решения. Идеального. Где такой взять? Конечно, сейчас уже разработано множество моделей искусственного интеллекта, но среди них нет ещё пока такого, который был бы способен решать человеческие проблемы.",
			"date_added": 1578061598
		},
		{
			"post_id": 1578061886,
			"body": "Конечно можно просто подождать, пока кто-нибудь такой ИИ создаст. Вот только надежда на такое очень похожа на веру во второе пришествие Христа. Среди тех, кто имеет возможности таких разработок, нет тех, кому нужен ИИ, решающий человеческие проблемы. В смысле - других людей. Для себя-то разработки ведутся очень активно.",
			"date_added": 1578061863
		},
		{
			"post_id": 1578062152,
			"body": "Однако есть другой вариант. Что лучше всего умеет компьютерная программа? Следить за соблюдением неких заданных условий. Тут особо изощренного интеллекта не нужно. То есть проблема стоит следующим образом: нужно подумать и решить - за соблюдением каких условий можно заставить следить программу, чтобы ее работа помогла людям решать свои проблемы? Причём любые.",
			"date_added": 1578062128
		},
		{
			"post_id": 1578063918,
			"body": "Сила человеческого сообщества в возможности сотрудничать. Делать сообща общее для всех дело. Причем даже придумывать не нужно - какое именно дело, когда речь идет о жизни. Вот в этом плане, то есть улучшении жизни для всех и располагается наша общая цель. Вовсе не коммунизм, если на то дело пошло. ",
			"date_added": 1578063893
		},
		{
			"post_id": 1578069712,
			"body": "Есть одна вещь, которую довольно трудно принять и которую всеми силами нам стараются затушевать. Сейчас просто из каждого утюга транслируется мысль - человек сам творец своего счастья! Всё зависит от тебя! Ты всё можешь! Очень трудно за этой шумихой осознать, что все, что создано человеком под этим небом, создано не им одним. Даже первые каменные орудия создавались коллективно. И сейчас куда ни ткнись - и обязательно упрешься в работу других людей. ",
			"date_added": 1578069686
		},
		{
			"post_id": 1578074826,
			"body": "А хотите знать почему у нас до сих пор настоящей НАРОДНОЙ партии? Ну или хотя бы заслуживающего доверия профсоюза? А все просто - мы все перестали верить в лидера! В человека, который защитник и заступник. Последним, в кого люди надеялись поверить, был Путин. И он же закрыл этот вопрос. И похоже навсегда. Хотя возможно кому-то это покажется несомненной победой нынешней власти, но на деле это поражение. Люди терпеть это не намерены. Так уж мы устроены... в смысле - люди. И потому сейчас думающие люди думают именно о том, как их этой ситуации выкарабкаться. И выход, который непременно найдётся, нынешней власти не понравится.",
			"date_added": 1578074799
		},
		{
			"post_id": 1578120539,
			"body": "Я как-то уже отмечал, что очень трудно осознать и принять то, что действия одного человека приносят очень небольшие результаты. Или вообще никаких. Конечно очень приятно о себе думать, что вот мол какой я крутой и независимый, делаю свои дела и это рано или поздно рванет во всемирном масштабе. В самообмане люди преуспели как никто. И опять же данную точку зрения кое-кто поддерживает очень даже сознательно. Поразмыслите над этим. ",
			"date_added": 1578120511
		},
		{
			"post_id": 1578156246,
			"body": "И, учитывая всё, что я говорил прежде, можно в общих чертах обрисовать то, что необходимо создать... чего пока не хватает вот этой самой сети ZeroMe, чтобы стать настоящим инструментом самоорганизации людей. Во-первых, необходим рейтинг. То есть к примеру здесь отмечается активность и всё. Однако активность никак не показывает отношение других пользователей к активности конкретного пользователя. Другими словами, лайки и дизлайки показывают уровень ДОВЕРИЯ к деятельности конкретного пользователя.",
			"date_added": 1578156217
		},
		{
			"post_id": 1578156518,
			"body": "И, как бы это не было спорно, лайк/дизлайк - это выражение симпатии или антипатии. И глядя на них вполне можно составить представление о человеке. Но не это главное, главное - если у человека есть поддержка, то это означает, что и мысли этого человека тоже кто-то поддерживает. Живое, непосредственное голосование. За конкретные дела.",
			"date_added": 1578156488
		},
		{
			"post_id": 1578156867,
			"body": "Если сложить некие баллы активности с баллами, которые дают лайки/дизлайки, то мы можем легко выделить тех, кто что-то делает и кому люди выражают доверие. Причём это может сделать программа - ведь достаточно просто проанализировать поступающие данные. Таким образом мы организуем механизм, позволяющий выделить тех, кто достоин принимать решения. Смогут ли они это делать - другой вопрос. И их решения можно точно так же проконтролировать лайками и дизлайками.",
			"date_added": 1578156836
		},
		{
			"post_id": 1578196459,
			"body": "После развала СССР очень многие утратили веру в лидеров. Любых. Самые правильные слова и призывы уже не вызывают отклика. А лишь справедливое опасение - а ну опять кинут? Однако это недоверие совершенно напрасно распространяется и на организацию. В смысле на саму возможность организации. \nЯ поясню. Государство это организация. Большая и сложная. И что-то изменить в нём может тоже лишь организация. У обычного человека шансов нет. Даже если отдельно взятых людей, которые что-то пытаются изменить, много.",
			"date_added": 1578196427
		},
		{
			"post_id": 1578196930,
			"body": "Можно сказать и так: чтобы изменить что-то в государстве нужны люди, знающие принципы организации. Не теоретически, а на практике. Организаторы и управленцы. Можно ждать до морковного заговенья, когда настанут наконец светлые времена и власть начнёт заботится о собственном народе. И только потому, что сам над не позаботился о собственных управленцах.",
			"date_added": 1578196897
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Topnet: Привет! ",
			"post_uri": "1M6qYFjYmB5NkAUHs96bBUCDc6U4CGTrww_1577709581",
			"date_added": 1577767575
		},
		{
			"comment_id": 2,
			"body": "@Димка: я кстати к этому и веду. Причем необходимый нам всем ИИ можно создать прямо сейчас. ",
			"post_uri": "1M6qYFjYmB5NkAUHs96bBUCDc6U4CGTrww_1578042772",
			"date_added": 1578061271
		}
	],
	"follow": []
}