{
	"posts": [
		{
			"id": "24e2f03b-6b8f-47be-8001-0bfad0f7393c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Jewish methods",
			"body": "The following is a text written by a high-ranking Jew.\n>We appear on the scene as alleged saviours of the worker from this oppression when we propose to him to\nenter the ranks of our fighting forces - Socialists, Anarchists, Communists - to whom we always give support in\naccordance with an alleged brotherly rule (of the solidarity of all humanity) of our SOCIAL MASONRY. The\naristocracy, which enjoyed by law the labor of the workers, was interested in seeing that the workers were well\nfed, healthy, and strong. We are interested in just the opposite - in the diminution, the KILLING OUT OF THE\nGOYIM. Our power is in the chronic shortness of food and physical weakness of the worker because by all that\nthis implies he is made the slave of our will, and he will not find in his own authorities either strength or energy\nto set against our will. Hunger creates the right of capital to rule the worker more surely than it was given to the\naristocracy by the legal authority of kings",
			"time": 1569256835369,
			"files": "[{\"name\":\"The-Protocols-of-the-Learned-Elders-of-Zion.pdf\",\"size\":2866804,\"type\":\"application/pdf\",\"original\":\"ad093df6e0572588bdd57182dabbb5a6865f2997.pdf\",\"directory\":\"12frA8R6mZ88Bfa4519FqnnwZBHdh9jD9Q\"}]"
		},
		{
			"id": "39e01143-6fe4-4076-a97b-1fb63a27699b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "24e2f03b-6b8f-47be-8001-0bfad0f7393c",
			"body": "By want and the envy and hatred which it engenders we shall move the mobs and with their hands we shall\nwipe out all those who hinder us on our way.\n WHEN THE HOUR STRIKES FOR OUR SOVEREIGN LORD OF ALL THE WORLD TO BE CROWNED\nIT IS THESE SAME HANDS WHICH WILL SWEEP AWAY EVERYTHING THAT MIGHT BE A\nHINDRANCE THERETO.",
			"time": 1569257157682,
			"files": "[]"
		},
		{
			"id": "ccffff0c-15d5-4d9b-8fc2-08887f1486e3",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "24e2f03b-6b8f-47be-8001-0bfad0f7393c",
			"body": "The GOYIM have lost the habit of thinking unless prompted by the suggestions of our specialists. Therefore\nthey do not see the urgent necessity of what we, when our kingdom comes, shall adopt at once, namely this, that\nIT IS ESSENTIAL TO TEACH IN NATIONAL SCHOOLS ONE SIMPLE, TRUE PIECE OF KNOWLEDGE,\nTHE BASIS OF ALL KNOWLEDGE - THE KNOWLEDGE OF THE STRUCTURE OF HUMAN LIFE, OF\nSOCIAL EXISTENCE, WHICH REQUIRES DIVISION OF LABOR, AND, CONSEQUENTLY, THE\nDIVISION OF MEN INTO CLASSES AND CONDITIONS. It is essential for all to know that OWING TO\nDIFFERENCE IN THE OBJECTS OF HUMAN ACTIVITY THERE CANNOT BE ANY EQUALITY, that he,\nwho by any act of his compromises a whole class, cannot be equally responsible before the law with him who\naffects no one but only his own honor.",
			"time": 1569257207782,
			"files": "[]"
		},
		{
			"id": "cdae57a2-251c-46cb-a2c3-f4c0e5befe77",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "24e2f03b-6b8f-47be-8001-0bfad0f7393c",
			"body": "The true knowledge of the structure of society, into the secrets of which\nwe do not admit the GOYIM, would demonstrate to all men that the positions and work must be kept within a\ncertain circle, that they may not become a source of human suffering, arising from an education which does not\ncorrespond with the work which individuals are called upon to do. After a thorough study of this knowledge, the\npeoples will voluntarily submit to authority and accept such position as is appointed them in the State. In the\npresent state of knowledge and the direction we have given to its development of the people, blindly believing\nthings in print - cherishes - thanks to promptings intended to mislead and to its own ignorance - a blind hatred\ntowards all conditions which it considers above itself, for it has no understanding of the meaning of class and\ncondition.",
			"time": 1569257298882,
			"files": "[]"
		},
		{
			"id": "561bb537-7282-4ace-80fe-b2292d9c1eb0",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "24e2f03b-6b8f-47be-8001-0bfad0f7393c",
			"body": "THIS HATRED WILL BE STILL FURTHER MAGNIFIED BY THE EFFECTS of an ECONOMIC\nCRISES, which will stop dealing on the exchanges and bring industry to a standstill. We shall create by all the\nsecret subterranean methods open to us and with the aid of gold, which is all in our hands, A UNIVERSAL\nECONOMIC CRISES WHEREBY WE SHALL THROW UPON THE STREETS WHOLE MOBS OF\nWORKERS SIMULTANEOUSLY IN ALL THE COUNTRIES OF EUROPE. These mobs will rush delightedly\nto shed the blood of those whom, in the simplicity of their ignorance, they have envied from their cradles, and\nwhose property they will then be able to loot.\n\"OURS\" THEY WILL NOT TOUCH, BECAUSE THE MOMENT OF ATTACK WILL BE KNOWN TO\nUS AND WE SHALL TAKE MEASURES TO PROTECT OUR OWN.",
			"time": 1569257366982,
			"files": "[]"
		},
		{
			"id": "0dcb9f8b-7eb5-4e48-b5a0-37eeee437766",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "24e2f03b-6b8f-47be-8001-0bfad0f7393c",
			"body": "When the populace has seen that all sorts of concessions and indulgences are yielded it in the name of\nfreedom it has imagined itself to be sovereign lord and has stormed its way to power, but, naturally like every\nother blind man, it has come upon a host of stumbling blocks. IT HAS RUSHED TO FIND A GUIDE, IT HAS\nNEVER HAD THE SENSE TO RETURN TO THE FORMER STATE and it has laid down its plenipotentiary\npowers at OUR feet. Remember the French Revolution, to which it was we [the Philadelphes (ie.e French branch\nof the Illuminati)]who gave the name of \"Great\": the secrets of its preparations are well known to us for it was\nwholly the work of our hands.\nEver since that time we have been leading the peoples from one disenchantment to another, so that in the end\nthey should turn also from us in favor of that KING-DESPOT OF THE BLOOD OF ZION, WHOM WE ARE\nPREPARING FOR THE WORLD.",
			"time": 1569257494182,
			"files": "[]"
		},
		{
			"id": "d11dec45-8699-4d84-b52a-409eb40261b5",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "24e2f03b-6b8f-47be-8001-0bfad0f7393c",
			"body": "But even freedom might be harmless and have its place in the State economy without injury to the well-being\nof the peoples if it rested upon the foundation of faith in God, upon the brotherhood of humanity, unconnected\nwith the conception of equality, which is negatived by the very laws of creation, for they have established\nsubordination. With such a faith as this a people might be governed by a wardship of parishes, and would walk\ncontentedly and humbly under the guiding hand of its spiritual pastor submitting to the dispositions of God upon\nearth. This is the reason why IT IS INDISPENSABLE FOR US TO UNDERMINE ALL FAITH, TO TEAR\nOUT OF THE MIND OF THE \"GOYIM\" THE VERY PRINCIPLE OF GOD-HEAD AND THE SPIRIT, AND\nTO PUT IN ITS PLACE ARITHMETICAL CALCULATIONS AND MATERIAL NEEDS.\nIn order to give the GOYIM no time to think and take note, their minds must be diverted towards industry and\ntrade. Thus, all the nations will be swallowed up in the pursuit of gain and in the race for it will not take note of\ntheir common foe. But again, in order that freedom may once for all disintegrate and ruin the communities of the\nGOYIM, we must put industry on a speculative basis: the result of this will be that what is withdrawn from the\nland by industry will slip through the hands and pass into speculation, that is, to our classes.",
			"time": 1569257606182,
			"files": "[]"
		},
		{
			"id": "6d51ed42-e2d3-4667-bc3f-1353bada58d3",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "24e2f03b-6b8f-47be-8001-0bfad0f7393c",
			"body": "Capital, if it is to co-operate untrammeled, must be free to establish a monopoly of industry and trade: this is\nalready being put in execution by an unseen hand in all quarters of the world. This freedom will give political\nforce to those engaged in industry, and that will help to oppress the people. Nowadays it is more important to\ndisarm the peoples than to lead them into war: more important to use for our advantage the passions which have\nburst into flames than to quench their fire: more important to eradicate them. THE PRINCIPLE OBJECT OF\nOUR DIRECTORATE CONSISTS IN THIS: TO DEBILITATE THE PUBLIC MIND BY CRITICISM; TO\nLEAD IT AWAY FROM SERIOUS REFLECTIONS CALCULATED TO AROUSE RESISTANCE; TO\nDISTRACT THE FORCES OF THE MIND TOWARDS A SHAM FIGHT OF EMPTY ELOQUENCE.",
			"time": 1569257829282,
			"files": "[]"
		},
		{
			"id": "8d9f668d-f47f-4714-aa2a-af732d2fd0ca",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "24e2f03b-6b8f-47be-8001-0bfad0f7393c",
			"body": "IT IS FROM US THAT THE ALL-ENGULFING TERROR PROCEEDS. WE HAVE IN OUR SERVICE\nPERSONS OF ALL OPINIONS, OF ALL DOCTRINES, RESTORATING MONARCHISTS, DEMAGOGUES,\nSOCIALISTS, COMMUNISTS, AND UTOPIAN DREAMERS OF EVERY KIND. We have harnessed them all\nto the task: EACH ONE OF THEM ON HIS OWN ACCOUNT IS BORING AWAY AT THE LAST\nREMNANTS OF AUTHORITY, IS STRIVING TO OVERTHROW ALL ESTABLISHED FORM OF ORDER.\nBy these acts all States are in torture; they exhort to tranquility, are ready to sacrifice everything for peace: BUT\nWE WILL NOT GIVE THEM PEACE UNTIL THEY OPENLY ACKNOWLEDGE OUR INTERNATIONAL\nSUPER-GOVERNMENT, AND WITH SUBMISSIVENESS.",
			"time": 1569257997082,
			"files": "[]"
		},
		{
			"id": "baea9a37-3531-41f4-9b25-9b0401c38e36",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "24e2f03b-6b8f-47be-8001-0bfad0f7393c",
			"body": "But you yourselves perfectly well know that TO PRODUCE THE POSSIBILITY OF THE EXPRESSION\nOF SUCH WISHES BY ALL THE NATIONS IT IS INDISPENSABLE TO TROUBLE IN ALL COUNTRIES\nTHE PEOPLE'S RELATIONS WITH THEIR GOVERNMENTS SO AS TO UTTERLY EXHAUST\nHUMANITY WITH DISSENSION, HATRED, STRUGGLE, ENVY AND EVEN BY THE USE OF\nTORTURE, BY STARVATION, BY THE INOCULATION OF DISEASES, BY WANT, SO THAT THE\n\"GOYIM\" SEE NO OTHER ISSUE THAN TO TAKE REFUGE IN OUR COMPLETE SOVEREIGNTY IN\nMONEY AND IN ALL ELSE.",
			"time": 1569258246182,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}