<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Robert Nelson">
   <meta name="GENERATOR" content="Mozilla/4.8 [en] (WinNT; U) [Netscape]">
   <meta name="Classification" content="Science">
   <meta name="Description" content="Berthelot, Philosophers Stone, Alchemy">
   <meta name="Keywords" content="Berthelot, Philosophers Stone, alchemy">
   <title>Marcelin Berthelot: Origines de l'Alchimie (Origins of Alchemy)</title>
</head>
<body>

<blockquote>
<center><b><font color="#CC0000">rexresearch.com</font></b>
<br>&nbsp;<b><a href="alchindx.htm">Alchemy Index</a></b>
<hr WIDTH="61%">
<p><b><font size=+2>Marcelin BERTHELOT</font></b>
<p><b><i><font size=+3>Origines de l'Alchimie</font></i></b></center>

<p>
<hr WIDTH="61%">
<p>&nbsp;&nbsp;&nbsp; La chimie est n&eacute;e d'hier: il y a cent ans
&agrave; peine qu'elle a pris la forme d'une science moderne. Cependant
les progr&egrave;s rapides qu'elle a faits depuis ont concouru, plus peut-&ecirc;tre
que ceux d'aucune autre science, &agrave; transformer l'industrie et la
civilisation mat&eacute;rielle, et &agrave; donner &agrave; la race humaine
sa puissance chaque jour croissante sur la nature. C'est assez dire quel
int&eacute;r&ecirc;t pr&eacute;sente l'histoire des commencements de la
chimie. Or ceux-ci ont un caract&egrave;re tout sp&eacute;cial: la chimie
n'est pas une science primitive, comme la g&eacute;om&eacute;trie ou l'astronomie;
elle s'est constitu&eacute;e sur les d&eacute;bris d'une formation scientifique
ant&eacute;rieure; formation demi-chim&eacute;rique et demi-positive, fond&eacute;e
elle-m&ecirc;me sur le tr&eacute;sor lentement amass&eacute; des d&eacute;couvertes
pratiques de la m&eacute;tallurgie, de la m&eacute;decine, de l'industrie
et de l'&eacute;conomie domestique. Il s'agit de l'alchimie, qui pr&eacute;tendait
&agrave; la fois enrichir ses adeptes en leur apprenant &agrave; fabriquer
l'or et l'argent, les mettre &agrave; l'abri des maladies par la pr&eacute;paration
de la panac&eacute;e, enfin leur procurer le bonheur parfait en les identifiant
avec l'&acirc;me du monde et l'esprit universel. L'histoire de l'alchimie
est fort obscure. C'est une science sans racine apparente, qui se manifeste
tout &agrave; coup au moment de la chute de l'empire romain et qui se d&eacute;veloppe
pendant tout le moyen &acirc;ge, au milieu des myst&egrave;res et des symboles,
sans sortir de l'&eacute;tat de doctrine occulte et pers&eacute;cut&eacute;e:
les savants et les philosophes s'y m&ecirc;lent et s'y confondent avec
les hallucin&eacute;s, les charlatans et parfois m&ecirc;me avec les sc&eacute;l&eacute;rats.
Cette histoire m&eacute;riterait d'&ecirc;tre abord&eacute;e dans toute
son &eacute;tendue par les m&eacute;thodes de la critique moderne. Sans
entreprendre une aussi vaste recherche qui exigerait toute une vie de savant,
je voudrais essayer de percer le myst&egrave;re des origines de l'alchimie
et montrer par quels liens elle se rattache &agrave; la fois aux proc&eacute;d&eacute;s
industriels des anciens &eacute;gyptiens, aux th&eacute;ories sp&eacute;culatives
des philosophes grecs et aux r&ecirc;veries mystiques des alexandrins et
des gnostiques. Les origines mystiques. Les saintes &eacute;critures rapportent
qu'il y a un certain genre de d&eacute;mons ayant commerce avec les femmes.
Herm&egrave;s en a parl&eacute; dans ses livres sur la nature. Les anciennes
et saintes &eacute;critures disent que certains anges, &eacute;pris d'amour
pour les femmes, descendirent sur la terre, leur enseign&egrave;rent les
œuvres de la nature; et &agrave; cause de cela ils furent chass&eacute;s
du ciel et condamn&eacute;s &agrave; un exil perp&eacute;tuel. De ce commerce
naquit la race des g&eacute;ants. Le livre dans lequel ils enseignaient
les arts est appel&eacute; ch&ecirc;ma: de l&agrave; le nom de ch&ecirc;ma
appliqu&eacute; &agrave; l'art par excellence. Ainsi parlait Zosime le
panopolitain, le plus vieux des chimistes authentiques, exposant les origines
de la chimie, dans son livre imouth (c'est &agrave; dire d&eacute;di&eacute;
&agrave; Imhotep, dieu &eacute;gyptien), livre adress&eacute; &agrave;
sa sœur Th&eacute;os&eacute;bie. Ce passage est cit&eacute; par Georges
Le Syncelle, polygraphe grec du VIIIe si&egrave;cle. D'autres nous disent
que ces œuvres de la nature, maudites et inutiles, enseign&eacute;es par
les anges tomb&eacute;s &agrave; leurs &eacute;pouses, &eacute;taient l'art
des poisons, des secrets des m&eacute;taux et des incantations magiques
(Tertullien). Le nom du livre ch&ecirc;ma se retrouve en Egypte sous la
forme chemi, titre d'un trait&eacute; cit&eacute; dans un papyrus de la
XIIe dynastie et recommand&eacute; par un scribe &agrave; son fils. Il
est probable que le sujet en &eacute;tait tout diff&eacute;rent. C'&eacute;tait
un vieux titre, repris plus tard pour s'en autoriser, comme il est arriv&eacute;
souvent dans l'antiquit&eacute;. Quoiqu'il en soit, le passage de Zosime
est des plus caract&eacute;ristiques. Sans en conclure, avec les adeptes
du XVIIe si&egrave;cle, que l'alchimie &eacute;tait d&eacute;j&agrave;
connue avant le d&eacute;luge, il est certain qu'il nous reporte aux imaginations
qui avaient cours en Orient dans les premiers si&egrave;cles de l'&egrave;re
chr&eacute;tienne. Isis, dans son discours &agrave; son fils Horus, autre
ouvrage alchimique des plus anciens, raconte &eacute;galement que la r&eacute;v&eacute;lation
lui fut faite par Amnael, le premier des anges et des proph&egrave;tes,
comme r&eacute;compense de son commerce avec lui. Quelques lignes &eacute;tranges
du chapitre V de la gen&egrave;se, probablement d' origine babylonienne,
ont servi de point d'attache &agrave; ces imaginations. "Les enfants de
Dieu, voyant que les filles des hommes &eacute;taient belles, choisirent
des femmes parmi elles". De l&agrave; naquit une race de g&eacute;ants,
dont l'impi&eacute;t&eacute; fut la cause du d&eacute;luge. Leur origine
est rattach&eacute;e &agrave; Enoch. Enoch lui-m&ecirc;me est fils de Ca&iuml;n
et fondateur de la ville qui porte son nom, d'apr&egrave;s l'une des g&eacute;n&eacute;alogies
relat&eacute;es dans la gen&egrave;se (chapitre IV); il descendait au contraire
de Seth et il disparut myst&eacute;rieusement du monde, d'apr&egrave;s
la seconde g&eacute;n&eacute;alogie (chapitre V) &agrave; ce personnage
&eacute;quivoque on attribua un ouvrage apocryphe compos&eacute; un peu
avant l'&egrave;re chr&eacute;tienne, le livre d'Enoch, qui joue un r&ocirc;le
important dans les premiers si&egrave;cles du christianisme. Georges Le
Syncelle nous a conserv&eacute; des fragments consid&eacute;rables de ce
livre, retrouv&eacute; depuis dans une version &eacute;thiopienne. Il en
existe une traduction fran&ccedil;aise imprim&eacute;e dans le dictionnaire
des apocryphes de Migne, Ti, P 395- 514. Dans ce livre, ce sont &eacute;galement
les anges p&eacute;cheurs qui r&eacute;v&egrave;lent aux mortelles les
arts et les sciences occultes. "Ils habit&egrave;rent avec elles et ils
leur enseign&egrave;rent la sorcellerie, les enchantements, les propri&eacute;t&eacute;s
des racines et des arbres..., les signes magiques..., l'art d'observer
les &eacute;toiles... il leur apprit aussi, dit encore le livre d'Enoch
en parlant de l'un de ces anges, l'usage des bracelets et ornements, l'usage
de la peinture, l'art de se peindre les sourcils, l'art d'employer les
pierres pr&eacute;cieuses et toutes sortes de teintures, de sorte que le
monde fut corrompu". Les auteurs du IIe et du IIIe si&egrave;cle de notre
&egrave;re reviennent souvent sur cette l&eacute;gende. Cl&eacute;ment
D'Alexandrie la cite (vers 200 de notre &egrave;re) dans ses stromates,
1 v Tertullien en parle longuement. "Ils trahirent le secret des plaisirs
mondains; ils livr&egrave;rent l'or, l'argent et leurs œuvres; ils enseign&egrave;rent
l'art de teindre les toisons". De m&ecirc;me: "Ils d&eacute;couvrirent
les charmes mondains, ceux de l'or, des pierres brillantes et de leurs
œuvres". Ailleurs Tertullien dit encore: "Ils mirent &agrave; nu les secrets
des m&eacute;taux; ils firent conna&icirc;tre la vertu des plantes et la
force des incantations magiques, et ils d&eacute;crivirent ces doctrines
singuli&egrave;res qui s'&eacute;tendent jusqu'&agrave; la science des
astres". On voit combien l'auteur est pr&eacute;occup&eacute; des myst&egrave;res
des m&eacute;taux, c'est &agrave; dire de l'alchimie, et comment il l'associe
avec l'art de la teinture et avec la fabrication des pierres pr&eacute;cieuses,
association qui forme la base m&ecirc;me des vieux trait&eacute;s alchimiques
contemporains, retrouv&eacute;s dans les papyrus et dans les manuscrits.
La magie et l'astrologie, ainsi que la connaissance des vertus des plantes,
rem&egrave;des et poisons, sont confondues par Tertullien avec l'art des
m&eacute;taux dans une m&ecirc;me mal&eacute;diction, et cette mal&eacute;diction
a dur&eacute; pendant tout le moyen &acirc;ge. Ailleurs Tertullien assimile
ces anges qui ont abandonn&eacute; Dieu par amour pour les femmes et r&eacute;v&eacute;l&eacute;
les arts interdits au monde inexp&eacute;riment&eacute;; il les assimile,
dis-je, &agrave; leurs disciples, les mages, les astrologues et les math&eacute;maticiens,
et il &eacute;tablit un parall&egrave;le entre l'expulsion de ceux-ci de
Rome, et celle des anges du ciel. Il m'a paru n&eacute;cessaire de d&eacute;velopper
ces citations, afin de pr&eacute;ciser l'&eacute;poque &agrave; laquelle
Zosime &eacute;crivait: c'est l'&eacute;poque &agrave; laquelle les imaginations
relatives aux anges p&eacute;cheurs et &agrave; la r&eacute;v&eacute;lation
des sciences occultes, astrologie, magie et alchimie, avaient cours dans
le monde. On voit qu'il s'agit du IIIe si&egrave;cle de notre &egrave;re.
Les papyrus de Leide pr&eacute;sentent &eacute;galement les recettes magiques
associ&eacute;es aux recettes alchimiques. La proscription de ceux qui
cultivaient ces sciences n'est pas seulement un vœu de Tertullien, elle
&eacute;tait effective et cela nous explique le soin avec lequel ils se
cachaient eux-m&ecirc;mes et dissimulaient leurs ouvrages sous le couvert
des noms les plus autoris&eacute;s. Elle nous reporte &agrave; des faits
et &agrave; des analogies historiques non douteuses. La condamnation des
math&eacute;maticiens, c'est &agrave; dire des astrologues, magiciens et
autres sectateurs des sciences occultes, &eacute;tait de droit commun &agrave;
Rome. Tacite nous apprend que sous le r&egrave;gne de Tib&egrave;re on
rendit un &eacute;dit pour chasser d'Italie les magiciens et les math&eacute;maticiens;
l'un d'eux, Pituanius, fut mis &agrave; mort et pr&eacute;cipit&eacute;
du haut d'un rocher. Sous Claude, sous Vitellius, nouveaux s&eacute;natus-consultes,
atroces et inutiles, ajoute Tacite. En effet, dit-il ailleurs, ce genre
d'hommes qui excite des esp&eacute;rances trompeuses est toujours proscrit
et toujours recherch&eacute;. L'exercice de la magie et m&ecirc;me la connaissance
de cet art &eacute;taient r&eacute;put&eacute;s criminels et prohib&eacute;s
&agrave; Rome, ainsi que nous l'apprend formellement Paul, jurisconsulte
du temps des antonins. Paul nous fait savoir qu'il &eacute;tait interdit
de poss&eacute;der des livres magiques. Lorsqu'on les d&eacute;couvrait,
on les br&ucirc;lait publiquement et on en d&eacute;portait le possesseur;
si ce dernier &eacute;tait de basse condition, on le mettait &agrave; mort.
Telle &eacute;tait la pratique constante du droit romain. Or l'association
de la magie, de l'astrologie et de l'alchimie, est &eacute;vidente dans
les passages de Tertullien cit&eacute;s plus haut. Cette association avait
lieu particuli&egrave;rement en Egypte. Les papyrus de Leide, trouv&eacute;s
&agrave; Th&egrave;bes, compl&egrave;tent et pr&eacute;cisent ces rapprochements
entre l'alchimie, l'astrologie et la magie; car ils nous montrent que les
alchimistes ajoutaient &agrave; leur art, suivant l'usage des peuples primitifs,
des formules magiques propres &agrave; se concilier et m&ecirc;me &agrave;
forcer la volont&eacute; des dieux (ou des d&eacute;mons), &ecirc;tres
sup&eacute;rieurs que l'on supposait intervenir perp&eacute;tuellement
dans le cours des choses. La loi naturelle agissant par elle-m&ecirc;me
&eacute;tait une notion trop simple et trop forte pour la plupart des hommes
d'alors: il fallait y suppl&eacute;er par des recettes myst&eacute;rieuses.
L'alchimie, l'astrologie et la magie sont ainsi associ&eacute;es et entrem&ecirc;l&eacute;es
dans les m&ecirc;mes papyrus. Nous observons le m&ecirc;me m&eacute;lange
dans certains manuscrits du moyen &acirc;ge, tels que le manuscrit grec
2419 de la biblioth&egrave;que nationale. Cependant les formules magiques
et astrologiques ne se retrouvent plus en g&eacute;n&eacute;ral dans la
plupart des trait&eacute;s alchimiques proprement dits. Il n'en est que
plus int&eacute;ressant de signaler les traces qui y subsistent encore.
Tels sont le dessin myst&eacute;rieux, d&eacute;sign&eacute; sous le nom
de Chrysop&eacute;e ou art de faire de l'or de Cl&eacute;op&acirc;tre et
les alphabets magiques du manuscrit 2249, analogues &agrave; ceux d' un
papyrus cit&eacute; par Reuvens et dont M Leemans a reproduit le fac simile.
La th&eacute;orie de l'œuf philosophique, le grand secret de l'œuvre, symbole
de l'univers et de l'alchimie, donnait surtout prise &agrave; ces imaginations.
Les signes bizarres du scorpion et les caract&egrave;res magiques transcrits
dans nos manuscrits; la sph&egrave;re ou instrument d'Herm&egrave;s pour
pr&eacute;dire l'issue des maladies, dont les analogues se retrouvent &agrave;
la fois dans le manuscrit 2419 et dans les papyrus de Leide; la table d'&eacute;meraude,
cit&eacute;e pendant tout le moyen &acirc;ge, et les formules mystiques:
"En haut les choses c&eacute;lestes, en bas les choses terrestres" qui
se lisent dans les trait&eacute;s grecs, &agrave; c&ocirc;t&eacute; des
figures des appareils, attestent la m&ecirc;me association. Si elle n'est
pas plus fr&eacute;quente dans les ouvrages parvenus jusqu'&agrave; nous,
c'est probablement parce que ces manuscrits ont &eacute;t&eacute; &eacute;pur&eacute;s
au moyen &acirc;ge par leurs copistes chr&eacute;tiens. C'est ce que l'on
voit clairement dans le manuscrit grec de la biblioth&egrave;que de saint
Marc, le plus ancien de tous, car il para&icirc;t remonter au XIe si&egrave;cle.
On y trouve non seulement la chrysop&eacute;e de Cl&eacute;op&acirc;tre
(Fol 188) et la formule du scorpion ( Fol 193), mais aussi le labyrinthe
de Salomon (Fol 102, V), dessin cabalistique, et, sous forme d'additions
initiales (Fol 4), une sph&egrave;re astrologique, l'art d'interpr&eacute;ter
les songes de Nic&eacute;phore, ainsi que des pronostics pour les quatre
saisons. Les alphabets magiques s'y lisent encore; mais on a essay&eacute;
de les effacer (Fol 193), et l'on a gratt&eacute; la plupart des mots rappelant
l'œuf philosophique. Il para&icirc;t s &ecirc;tre fait &agrave; cette &eacute;poque,
c'est &agrave; dire d&egrave;s le Xe ou XIe si&egrave;cle, un corps d'ouvrages,
une sorte d'encyclop&eacute;die purement chimique, s&eacute;par&eacute;e
avec soin de la magie, de l'astrologie et de la mati&egrave;re m&eacute;dicale.
Mais ces diverses sciences &eacute;taient r&eacute;unies &agrave; l'origine
et cultiv&eacute;es par les m&ecirc;mes adeptes. On s'explique d&egrave;s
lors pourquoi Diocl&eacute;tien fit br&ucirc;ler en Egypte les livres d'alchimie,
ainsi que les chroniqueurs nous l'apprennent. D&egrave;s la plus haute
antiquit&eacute; d'ailleurs, ceux qui s'occupent de l'extraction et du
travail des m&eacute;taux ont &eacute;t&eacute; r&eacute;put&eacute;s des
enchanteurs et des magiciens. Sans doute ces transformations de la mati&egrave;re,
qui atteignent au-del&agrave; de la forme et font dispara&icirc;tre jusqu'&agrave;
l'existence sp&eacute;cifique des corps, semblaient surpasser la mesure
de la puissance humaine: c' &eacute;tait un empi&egrave;tement sur la puissance
divine. Voil&agrave; pourquoi l'invention des sciences occultes et m&ecirc;me
l'invention de toute science naturelle ont &eacute;t&eacute; attribu&eacute;es
par Zosime et par Tertullien aux anges maudits. Cette opinion n'a rien
de surprenant dans leur bouche; elle concorde avec le vieux mythe biblique
de l'arbre du savoir, plac&eacute; dans le paradis terrestre et dont le
fruit a perdu l'humanit&eacute;. En effet la loi scientifique est fatale
et indiff&eacute;rente; la connaissance de la nature et la puissance qui
en r&eacute;sulte peuvent &ecirc;tre tourn&eacute;es au mal comme au bien:
la science des sucs des plantes est aussi bien celle des poisons qui tuent
et des philtres qui troublent l'esprit, que celle des rem&egrave;des qui
gu&eacute;rissent; la science des m&eacute;taux et de leurs alliages conduit
&agrave; les falsifier, aussi bien qu'&agrave; les imiter et &agrave; mettre
en œuvre pour une fin industrielle. Leur possession, m&ecirc;me l&eacute;gitime,
corrompt l'homme. Aussi les esprits mystiques ont-ils toujours eu une certaine
tendance &agrave; regarder la science, et surtout la science de la nature,
comme sacril&eacute;ge, parce qu'elle induit l'homme &agrave; rivaliser
avec les dieux. La conception de la science d&eacute;truit, en effet, celle
du dieu antique, agissant sur le monde par miracle et par volont&eacute;
personnelle: "C'est ainsi que la religion, par un juste retour, est foul&eacute;e
aux pieds; la victoire nous &eacute;gale aux dieux!" s'&eacute;crie Lucr&egrave;ce
avec une exaltation philosophique singuli&egrave;re. "Ne crois pas cependant,
ajoute-t-il, que je veuille t'initier aux principes de l'impi&eacute;t&eacute;
et t'introduire dans la route du crime". Par suite de je ne sais quelle
affinit&eacute;s secr&egrave;tes entre les &eacute;poques profond&eacute;ment
troubl&eacute;es, notre si&egrave;cle a vu repara&icirc;tre la vieille
l&eacute;gende, oubli&eacute;e depuis seize cents ans. Nos po&egrave;tes,
A De Vigny, Lamartine, Leconte De Lisle, l'ont reprise tour &agrave; tour.
Dans eloha, A De Vigny ne dit qu'un mot: les peuples... etc. Mais Lamartine,
dans la chute d'un ange, a serr&eacute; de plus pr&egrave;s le mythe. Il
nous d&eacute;crit la civilisation grandiose et cruelle des dieux g&eacute;ants,
leur corruption, leur science, leur art des m&eacute;taux: d&egrave;s mon
enfance... etc.
<p>&nbsp;&nbsp;&nbsp; Dans la douzi&egrave;me vision, au milieu des ministres
de leurs crimes, apparaissent, par une assimilation par suite de je ne
sais quelles affinit&eacute;s secr&egrave;tes entre les &eacute;poques
profond&eacute;ment troubl&eacute;es, notre si&egrave;cle a vu repara&icirc;tre
la vieille l&eacute;gende, oubli&eacute;e depuis seize cents ans. Nos po&egrave;tes,
A De Vigny, Lamartine, Leconte De Lisle, l'ont reprise tour &agrave; tour.
Dans eloha, A De Vigny ne dit qu'un mot: les peuples... etc. Mais Lamartine,
dans la chute d'un ange a serr&eacute; de plus pr&egrave;s le mythe. Il
nous d&eacute;crit la civilisation grandiose et cruelle des dieux g&eacute;ants,
leur corruption, leur science, leur art des m&eacute;taux: d&egrave;s mon
enfance... etc. Dans la douzi&egrave;me vision, au milieu des ministres
de leurs crimes, apparaissent, par une assimilation presque spontan&eacute;e,
les agents des sciences maudites et les "alchimistes". Leconte De Lisle
a repris le mythe des enfants d'&eacute;noch et de Ca&iuml;n, &agrave;
un point de vue plus profond et plus philosophique. Apr&egrave;s avoir
parl&eacute; d'H&eacute;nokia: la ville... etc. Le po&egrave;te oppose,
comme Lucr&egrave;ce, au dieu jaloux qui a pr&eacute;destin&eacute; l'homme
au crime, la revanche de la science, sup&eacute;rieure &agrave; l'arbitraire
divin et &agrave; la conception &eacute;troite de l'univers th&eacute;ologique:
j'effondrerai... etc. Il y avait d&eacute;j&agrave; quelque chose de cette
antinomie, dans la haine contre la science que laissent &eacute;clater
le livre d'&eacute;noch et Tertullien. La science est envisag&eacute;e
comme impie, aussi bien dans la formule magique qui force les dieux &agrave;
ob&eacute;ir &agrave; l'homme, que dans la loi scientifique qui r&eacute;alise,
&eacute;galement malgr&eacute; eux, la volont&eacute; de l'homme, en faisant
&eacute;vanouir jusqu'&agrave; la possibilit&eacute; de leur pouvoir divin.
Or, chose &eacute;trange, l'alchimie, d&egrave;s ses origines, reconna&icirc;t
et accepte cette filiation maudite. Elle est d'ailleurs, m&ecirc;me aujourd'hui,
class&eacute;e dans le recueil eccl&eacute;siastique de Migne parmi les
sciences occultes, &agrave; c&ocirc;t&eacute; de la magie et de la sorcellerie.
Les livres o&ugrave; ces sciences sont trait&eacute;es doivent &ecirc;tre
br&ucirc;l&eacute;s sous les yeux des &eacute;v&ecirc;ques, disait d&eacute;j&agrave;
le code th&eacute;odosien. Les auteurs &eacute;taient pareillement br&ucirc;l&eacute;s.
Pendant tout le moyen &acirc;ge, les accusations de magie et d'alchimie
sont associ&eacute;es et dirig&eacute;es &agrave; la fois contre les savants
que leurs ennemis veulent perdre. Au XVe si&egrave;cle m&ecirc;me, l'archev&ecirc;que
de Prague fut poursuivi pour n&eacute;cromancie et alchimie, dans ce concile
de constance qui condamna Jean Huss. Jusqu'au XVIe si&egrave;cle ces lois
subsist&egrave;rent. Hermolaus Barbarus, patriarche d'Aquil&eacute;e, nous
apprend, dans les notes de son commentaire sur dioscoride, qu'&agrave;
Venise, en 1530, un d&eacute;cret interdisait l'art des chimistes sous
la peine capitale; afin de leur &eacute;viter toute tentation criminelle,
ajoute-t-il. Telle est, je le r&eacute;p&egrave;te, la traduction constante
du moyen &acirc;ge. C'est ainsi que l'alchimie nous appara&icirc;t vers
le IIIe si&egrave;cle de notre &egrave;re, rattachant elle-m&ecirc;me sa
source aux mythes orientaux, engendr&eacute;s ou plut&ocirc;t d&eacute;voil&eacute;s
au milieu de l'effervescence provoqu&eacute;e par la dissolution des vieilles
religions. 4-sources gnostiques. L'&eacute;tude des papyrus et des manuscrits
conduit &agrave; pr&eacute;ciser davantage l'&eacute;poque et le point
de contact entre l'alchimie et les vieilles croyances de l'Egypte et de
la Chald&eacute;e. En effet, ce contact co&iuml;ncide avec le contact m&ecirc;me
de ces croyances et de celles des chr&eacute;tiens au IIe et au IIIe si&egrave;cle.
Les premiers alchimistes &eacute;taient gnostiques. D'apr&egrave;s Reuvens,
le papyrus N 75 de Leide renferme un m&eacute;lange de recettes magiques,
alchimiques, et d'id&eacute;es gnostiques; ces derni&egrave;res emprunt&eacute;es
aux doctrines de Marcus. Les auteurs de nos trait&eacute;s, Zosime, Syn&eacute;sius,
Olympiodore, sont aussi tout remplis de noms et d'id&eacute;es gnostiques.
"Livre de v&eacute;rit&eacute; de Soph&eacute; l'&eacute;gyptien: c'est
ici l'œuvre divine du seigneur des h&eacute;breux et des puissances Sabaoth".
Ce titre d&eacute;j&agrave; cit&eacute; repara&icirc;t deux fois: une fois
seul, une autre fois suivi des mots:&nbsp; Livre mystique de Zosime Le
Th&eacute;bain". On reconna&icirc;t l'analogue de l'&eacute;vangile de
la v&eacute;rit&eacute; et de la pistis Sophia de Valentin, ainsi que la
parent&eacute; de l'auteur avec les juifs et avec les gnostiques. En effet
les mots "seigneur des h&eacute;breux et Sabaoth" sont caract&eacute;ristiques.
Quant au nom de Soph&eacute; l'Egyptien, c'est une forme &eacute;quivalente
&agrave; celui de Souphis, c'est &agrave; dire du Ch&eacute;ops des grecs.
Le livre qui lui est ici attribu&eacute; rappelle un passage d'Africanus,
auteur du IIIe si&egrave;cle de notre &egrave;re, qui a fait un abr&eacute;g&eacute;
de l'historien Man&eacute;thon, abr&eacute;g&eacute; compil&eacute; plus
tard par Eus&egrave;be. "Le roi Souphis, dit Africanus, a &eacute;crit
un livre sacr&eacute;, que j'ai achet&eacute; en &eacute;gypte, comme une
chose tr&egrave;s pr&eacute;cieuse". On vendait donc alors sous le nom
du vieux roi des livres apocryphes, dont les auteurs r&eacute;els &eacute;taient
parfois nomm&eacute;s &agrave; la suite, comme dans le titre de notre ouvrage
de Zosime. Le serpent ou dragon qui se mord la queue ouroboros est plus
significatif encore: c'est le symbole de l'œuvre, qui n'a ni commencement
ni fin. Dans les papyrus de Leide, il est question d'un anneau magique,
sur lequel ce serpent est trac&eacute;. Il est aussi figur&eacute; deux
fois dans le manuscrit 2327, en t&ecirc;te d'articles sans nom d'auteur,
dessin&eacute; et colori&eacute; avec le plus grand soin, en deux et trois
cercles concentriques, de couleurs diff&eacute;rentes, et associ&eacute;
aux formules consacr&eacute;es: "La nature se pla&icirc;t dans la nature,
etc.". Il est pourvu de trois oreilles, qui figurent les trois vapeurs,
et de quatre pieds, qui repr&eacute;sentent les quatre corps ou m&eacute;taux
fondamentaux: plomb, cuivre, &eacute;tain, fer. Les derniers d&eacute;tails
rappellent singuli&egrave;rement la salamandre, animal myst&eacute;rieux
qui vit dans le feu, lequel appara&icirc;t d&eacute;j&agrave; &agrave;
Babylone et en Egypte, et dont Aristote, Pline, S&eacute;n&egrave;que et
les auteurs du si&egrave;cle suivant rappellent souvent les propri&eacute;t&eacute;s
myst&eacute;rieuses. Il en est aussi question dans les papyrus de Leide
et parmi les pierres grav&eacute;es gnostiques de la collection de la biblioth&egrave;que
nationale: elle jouait un certain r&ocirc;le dans les formules magiques
et m&eacute;dicales de ce temps, &agrave; la suite de la figure du serpent,
on lit dans le manuscrit 2327 un expos&eacute; all&eacute;gorique de l'œuvre:
"Le dragon est le gardien du temple. Sacrifie-le, &eacute;corche-le, s&eacute;pare
la chair des os et tu trouveras ce que tu cherches". Puis, viennent successivement
l'homme d'airain, qui change de couleur et se transforme dans l'homme d'argent;
ce dernier devient &agrave; son tour l'homme d'or. Zosime a reproduit tout
cet expos&eacute; avec plus de d&eacute;veloppement. Les m&ecirc;mes all&eacute;gories
se retrouvent ailleurs dans un texte anonyme, sous une forme qui semble
plus ancienne: l'homme d'airain est plong&eacute; dans la source sacr&eacute;e,
il change non seulement de couleur, mais de corps, c' est &agrave; dire
de nature m&eacute;tallique, et il devient l'homme d'asemon , puis l'homme
d'or. L'argent est ici remplac&eacute; par l'asemon, c' est &agrave; dire
par l'&eacute;lectrum, alliage d'or et d'argent, qui figurait au nombre
des vieux m&eacute;taux &eacute;gyptiens. Remarquons encore ces all&eacute;gories,
o&ugrave; les m&eacute;taux sont repr&eacute;sent&eacute;s comme des personnes,
des hommes: c'est l&agrave; probablement l'origine de l'homunculus du moyen
&acirc;ge; la notion de la puissance cr&eacute;atrice des m&eacute;taux
et de celle de la vie s'&eacute;tant confondues dans un m&ecirc;me symbole.
Un autre trait&eacute; de Zosime renferme une figure &eacute;nigmatique,
form&eacute;e de trois cercles concentriques, qui semblent les m&ecirc;mes
que ceux du serpent, et entre lesquels on lit ces paroles cabalistiques:
"Un est le tout, par lui le tout, et pour lui le tout, et dans lui le tout.
Le serpent est un; il a les deux symboles (le bien et le mal) et son poison
(ou bien sa fl&egrave;che), etc." Un peu plus loin vient la figure du scorpion
et une suite de signes magiques et astrologiques. Ces axiomes reparaissent,
mais sans la figure, &eacute;crits &agrave; l'encre rouge au folio 88 du
No. 2327: probablement la figure existait ici dans le texte primitif; mais
le copiste ne l'aura pas reproduite. Dans le manuscrit de saint Marc, Fol
188, V, et dans le manuscrit 2249, Fol 96, sous le nom de chrysop&eacute;e
de Cl&eacute;op&acirc;tre, le m&ecirc;me dessin se voit, plus compliqu&eacute;
et plus expressif. En effet, non seulement les trois cercles sont trac&eacute;s,
avec les m&ecirc;mes axiomes mystiques; mais le centre est rempli par les
trois signes de l'or, de l'argent et du mercure. Sur le c&ocirc;t&eacute;
droit s'&eacute;tend un prolongement en forme de queue, aboutissant &agrave;
une suite de signes magiques, qui se d&eacute;veloppent tout autour. Le
syst&egrave;me des trois cercles r&eacute;pond ici aux trois couleurs concentriques
du serpent cit&eacute;es plus haut. Au dessous, on voit l image m&ecirc;me
du serpent ouroboros, avec l'axiome central: "un le tout" . Le serpent,
aussi bien que le syst&egrave;me des cercles concentriques, est au fond
l'embl&ecirc;me des m&ecirc;mes id&eacute;es que de l'œuf philosophique,
symbole de l'univers et symbole de l'alchimie. Ce sont l&agrave; des signes
et des imaginations gnostiques, ainsi que le montre l'anneau magique d&eacute;crit
dans le papyrus de Leide et comme on peut le voir dans l'histoire des origines
du christianisme de M Renan. Le serpent qui se mord la queue se pr&eacute;sente
continuellement associ&eacute; &agrave; des images d'astres et &agrave;
des formules magiques sur les pierres grav&eacute;es de l'&eacute;poque
gnostique. On peut s'en assurer dans le catalogue imprim&eacute; des cam&eacute;es
et pierres grav&eacute;es de la biblioth&egrave;que nationale de Paris,
par Chabouillet. Les num&eacute;ros 2176, 2177, 2180, 2194, 2196, 2201,
2202, 2203, 2204, 2205, 2206, etc., portent la figure de l'ouroboros, avec
toutes sortes de signes cabalistiques. De m&ecirc;me la salamandre, N 2193.
Au N 2203 on voit Herm&egrave;s, S&eacute;rapis, les sept voyelles figurant
les sept plan&egrave;tes, le tout entour&eacute; par le serpent qui se
mord la queue. Au N 2240, le signe des plan&egrave;tes avec celui de Mercure,
qui est le m&ecirc;me qu'aujourd'hui. C'&eacute;taient l&agrave; des amulettes
et des talismans, que l'on suspendait au cou des malades, d apr&egrave;s
Sextus Empiricus m&eacute;decin du IVe si&egrave;cle, et que l'on faisait
servir &agrave; toutes sortes d'usages. Ces symboles sont &agrave; la fois
cong&eacute;n&egrave;res et contemporains de ceux des alchimistes. Le serpent
qui se mord la queue &eacute;tait ador&eacute; &agrave; Hi&eacute;rapolis
en Phrygie, par les naass&eacute;niens, secte gnostique &agrave; peine
chr&eacute;tienne. Les ophites, branche importante du gnosticisme, comprenaient
plusieurs sectes qui se rencontraient en un point, l'adoration du serpent,
envisag&eacute; comme le symbole d'une puissance sup&eacute;rieure; comme
le signe de la mati&egrave;re humide, sans laquelle rien ne peut exister;
comme l'&acirc;me du monde qui enveloppe tout et donne naissance &agrave;
tout ce qui est, le ciel &eacute;toil&eacute; qui entoure les astres; le
symbole de la beaut&eacute; et de l'harmonie de l'univers. Le serpent ouroboros
symbolisait donc les m&ecirc;mes choses que l'œuf philosophique des alchimistes.
Le serpent &eacute;tait &agrave; la fois bon et mauvais. Ce dernier r&eacute;pond
au serpent &eacute;gyptien apophis, symbole des t&eacute;n&egrave;bres
et de leur lutte contre le soleil. L'ophiouchos, qui est &agrave; la fois
un homme et une constellation, joue un r&ocirc;le essentiel dans la mythologie
des p&eacute;rates, autres ophites; il prend la d&eacute;fense de l'homme
contre le m&eacute;chant serpent. Nous le retrouvons dans olympiodore.
Ailleurs nous rencontrons la langue sp&eacute;ciale des gnostiques: "la
terre est vierge et sanglante, ign&eacute;e et charnelle" nous disent les
m&ecirc;mes auteurs. Les gnostiques, ainsi que les premiers alchimistes
et les n&eacute;oplatoniciens d'Alexandrie, unissaient la magie &agrave;
leurs pratiques religieuses. On s'explique par l&agrave; la pr&eacute;sence
de l'&eacute;toile &agrave; huit rayons, signe du soleil en Assyrie, parmi
les symboles qui entourent la chrysop&eacute;e de Cl&eacute;op&acirc;tre,
aussi bien que dans les &eacute;crits valentiniens. Elle semble rappeler
l'ogdoade mystique des gnostiques et les huit dieux &eacute;l&eacute;mentaires
&eacute;gyptiens, assembl&eacute;s par couples m&acirc;les et femelles,
dont parle S&eacute;n&egrave;que. J'ai montr&eacute; ailleurs (P 34) que
le nombre quatre joue un r&ocirc;le fondamental dans Zosime, aussi bien
que chez les &eacute;gyptiens et chez le gnostique Marcus. Le r&ocirc;le
de l'&eacute;l&eacute;ment m&acirc;le, assimil&eacute; au levant, et de
l'&eacute;l&eacute;ment femelle, compar&eacute; au couchant; l'œuvre accomplie
par leur union; l'importance de l'&eacute;l&eacute;ment hermaphrodite (la
d&eacute;esse Neith des &eacute;gyptiens) cit&eacute; par Zosime, et qui
repara&icirc;t jusque dans les &eacute;crits du moyen &acirc;ge; l'intervention
des femmes alchimistes, Th&eacute;os&eacute;bie, Marie la juive, Cl&eacute;op&acirc;tre
la savante, qui rappellent les proph&eacute;tesses gnostiques, sont aussi
des traits communs aux gnostiques et aux alchimistes. Les traditions juives
jouaient un r&ocirc;le important chez les gnostiques marcosiens. Ceci est
encore conforme &agrave; l'intervention des juifs dans les &eacute;crits
alchimiques et dans les papyrus de Leide. Zosime, et Olympiodore reproduisent
les sp&eacute;culations des gnostiques sur l'Adam, l'homme universel identifi&eacute;
avec le Toth &eacute;gyptien: les quatre lettres de son nom repr&eacute;sentent
les quatre &eacute;l&eacute;ments. Eve s'y trouve assimil&eacute;e &agrave;
Pandore. Prom&eacute;th&eacute;e et &ecirc;pim&eacute;th&eacute;e sont
cit&eacute;s et regard&eacute;s comme exprimant en langage all&eacute;gorique
l'&acirc;me et le corps. Nous trouvons pareillement dans les geoponica
une recette attribu&eacute;e &agrave; D&eacute;mocrite et o&ugrave; figure
le nom d'Adam, destin&eacute; &agrave; &eacute;carter les serpents d'un
pigeonnier. Sous une forme plus grossi&egrave;re, c'est toujours le m&ecirc;me
ordre de superstitions. Un tel m&eacute;lange des mythes grecs, juifs et
chr&eacute;tiens est caract&eacute;ristique. Les s&eacute;thiens, secte
gnostique, associaient de m&ecirc;me les myst&egrave;res orphiques et les
notions bibliques. Nos auteurs alchimiques ne manquent pas davantage de
s'appuyer de l'autorit&eacute; des livres h&eacute;bra&iuml;ques; et cela
&agrave; la fa&ccedil;on des premiers apologistes chr&eacute;tiens, c'est-&agrave;-dire
en les joignant &agrave; Herm&egrave;s, &agrave; Orph&eacute;e, &agrave;
H&eacute;siode, &agrave; Aratus, aux philosophes, aux ma&icirc;tres de
la sagesse antique. Ce langage, ces signes, ces symboles nous replacent
au milieu du syncr&eacute;tisme compr&eacute;hensif, bien connu dans l'histoire,
o&ugrave; les croyances et les cosmogonies de l'Orient se confondaient
&agrave; la fois entre elles et avec l'hell&eacute;nisme et le christianisme.
Les hymnes gnostiques de Syn&eacute;sius, qui est &agrave; la fois un philosophe
et un &eacute;v&ecirc;que, un savant et un alchimiste, montrent le m&ecirc;me
assemblage. Or, le gnosticisme a jou&eacute; un grand r&ocirc;le dans tout
l'Orient et sp&eacute;cialement &agrave; Alexandrie, au IIe si&egrave;cle
de notre &egrave;re; mais son influence g&eacute;n&eacute;rale n'a gu&egrave;re
dur&eacute; au-del&agrave; du IVe si&egrave;cle. C' est donc vers cet intervalle
de temps que nous sommes ramen&eacute;s d'une fa&ccedil;on de plus en plus
pressante par les textes alchimiques. Ceux-ci montrent qu'il existait d&egrave;s
l'origine une affinit&eacute; secr&egrave;te entre la gnose, qui enseigne
le sens v&eacute;ritable des th&eacute;ories philosophiques et religieuses,
dissimul&eacute;es sous le voile des symboles et des all&eacute;gories,
et la chimie, qui poursuit la connaissance des propri&eacute;t&eacute;s
cach&eacute;es de la nature, et qui les repr&eacute;sente, m&ecirc;me de
nos jours, par des signes &agrave; double et triple sens. Les t&eacute;moignages
historiques. Jusqu'ici nous avons expos&eacute; l'histoire des origines
de l'alchimie, telle qu'elle r&eacute;sulte de l'&eacute;tude des plus
vieux monuments de cette science, papyrus et manuscrits des biblioth&egrave;ques.
Nous avons montr&eacute; la concordance des renseignements tir&eacute;s
de ces deux sources, entre eux et avec les doctrines et les pr&eacute;jug&eacute;s
des premiers si&egrave;cles de l'&egrave;re chr&eacute;tienne. Cette concordance
atteste que les trait&eacute;s manuscrits ont &eacute;t&eacute; compos&eacute;s
&agrave; la m&ecirc;me &eacute;poque que les papyrus trouv&eacute;s dans
les tombeaux de Th&egrave;bes: v&eacute;rification d'autant plus utile
que les copies les plus anciennes que nous poss&eacute;dions de ces trait&eacute;s
manuscrits ne remontent pas au-del&agrave; du XIe si&egrave;cle. Non seulement
les papyrus et les manuscrits des biblioth&egrave;ques concordent; mais
les noms des dieux des hommes, des mois, des lieux, les allusions de tout
genre, les id&eacute;es et les th&eacute;ories expos&eacute;es dans les
manuscrits et dans les papyrus correspondent, avec une singuli&egrave;re
pr&eacute;cision dans les d&eacute;tails, &agrave; ce que nous savons de
l'Egypte gr&eacute;cis&eacute;e des premiers si&egrave;cles de l'&egrave;re
chr&eacute;tienne et du m&eacute;lange &eacute;trange de doctrines philosophiques,
religieuses, mystiques et magiques, qui caract&eacute;rise les n&eacute;oplatoniciens
et les gnostiques. Nous &eacute;tablirons dans une autre partie de cet
ouvrage une comparaison pareille entre les notions pratiques, consign&eacute;es
dans les papyrus et les manuscrits, et les faits connus aujourd'hui sur
les industries &eacute;gyptiennes relatives &agrave; la m&eacute;tallurgie,
&agrave; la fabrication des verres et &agrave; la teinture des &eacute;toffes.
Nos mus&eacute;es fournissent, &agrave; ces &eacute;gards les t&eacute;moignages
les plus divers et les plus authentiques. Tels sont les r&eacute;sultats
obtenus par l'&eacute;tude intrins&eacute;que des textes et des monuments
anciens. Il convient de contr&ocirc;ler les r&eacute;sultats de cette &eacute;tude,
en les rapprochant des faits et des indications positives que l'on trouve
dans les auteurs et les historiens ordinaires. Aucun de ceux-ci n'a parl&eacute;
de l'alchimie avant l'&egrave;re chr&eacute;tienne. La plus ancienne allusion
que l'on puisse signaler &agrave; cet &eacute;gard serait une phrase singuli&egrave;re
de Dioscoride, m&eacute;decin et botaniste grec: "quelques-uns rapportent
que le mercure est une partie constituante des m&eacute;taux ". Dioscoride
para&icirc;t contemporain de l'&egrave;re chr&eacute;tienne; les manuscrits
de cet auteur que nous poss&eacute;dons sont fort beaux, et dat&eacute;s
d'une fa&ccedil;on pr&eacute;cise: les deux principaux ont &eacute;t&eacute;
transcrits au milieu du Ve si&egrave;cle. On cite encore un passage de
Pline l'ancien, d'apr&egrave;s lequel il existe un proc&eacute;d&eacute;
pour fabriquer l'or au moyen de l'orpiment: Caligula, dit-il, fit calciner
une quantit&eacute; consid&eacute;rable d'orpiment pour en tirer de l'or
il r&eacute;ussit; mais le rendement fut si minime que la quantit&eacute;
d'or obtenue ne paya pas les frais de l'op&eacute;ration. "invitaverat
spes...". C'est &eacute;videmment la premi&egrave;re tentative de transmutation,
ou plut&ocirc;t de pr&eacute;paration artificielle de l' or, que l'histoire
nous ait transmise. Le fait en soi, tel que Pline le rapporte, n'a d'ailleurs
rien que de vraisemblable: car il semble qu'il se soit agi ici d'une op&eacute;ration
analogue &agrave; la coupellation, ayant pour but et pour r&eacute;sultat
d'extraire l'or contenu dans certains sulfures m&eacute;talliques, signal&eacute;s
par leur couleur comme pouvant en rec&eacute;ler. Extraction de l'or pr&eacute;existant,
ou fabrication de ce m&eacute;tal de toutes pi&egrave;ces, ce sont l&agrave;
deux id&eacute;es tout &agrave; fait distinctes pour nous; mais elles se
confondaient dans l'esprit des anciens op&eacute;rateurs. On rencontre,
vers la m&ecirc;me &eacute;poque, un &eacute;nonc&eacute; plus net dans
Manilius, auteur d'un po&egrave;me astrologique d'une langue excellente,
et que les critiques s'accordent &agrave; regarder comme contemporain de
Tib&egrave;re. Au livre IVe, il d&eacute;veloppe en beaux vers les effets
du feu: "la recherche des m&eacute;taux cach&eacute;s et des richesses
enfouies, la calcination des veines de minerais, l'art de doubler la mati&egrave;re
par un proc&eacute;d&eacute; certain, ainsi que les objets d'or et d'argent...".
Scaliger a cru ce passage interpol&eacute;, mais surtout &agrave; cause
de sa signification: ce qui est un cercle vicieux. Il est conforme aux
analogies historiques qu'un astrologue, tel que Manilius, ait eu une connaissance
plus particuli&egrave;re de l'alchimie. D'ailleurs, l'id&eacute;e de doubler
l'or et l'argent diplosis &eacute;tait courante d&egrave;s le IIe et le
IIIe si&egrave;cles de notre &egrave;re, comme le montrent les papyrus
de Leide, d'accord avec les manuscrits des biblioth&egrave;ques. Venons
aux personnes et aux industries chimiques. Les plus vieux auteurs cit&eacute;s
par les manuscrits alchimiques, D&eacute;mocrite, Ostan&egrave;s, figurent
aussi comme magiciens et astrologues dans columelle, dans Pline et dans
les &eacute;crivains de l'antiquit&eacute;. Le nom de l'alchimiste Pamm&eacute;n&egrave;s
se retrouve dans Tacite, comme celui d'un magicien. L'astrologue &eacute;gyptien
P&eacute;tosiris, dont les trait&eacute;s sont associ&eacute;s &agrave;
des ouvrages alchimiques dans le manuscrit 2419 de la biblioth&egrave;que
nationale, est cit&eacute; par Pline, par Juv&eacute;nal et d&eacute;j&agrave;
par Aristophane. S&eacute;n&egrave;que rappelle &eacute;galement les connaissances
pratiques de D&eacute;mocrite sur l'art de colorer les verres, art cong&eacute;n&egrave;re
de l'art de colorer les m&eacute;taux: "il avait trouv&eacute; le moyen
d'amollir l'ivoire, de changer le sable en &eacute;meraude par la cuisson
et son proc&eacute;d&eacute; est encore suivi de nos jours". "excidit porro
vobis ( ...). Sont ce l&agrave; des inventions authentiques du vieux philosophe
? Ou n'avons nous pas affaire &agrave; des pseudonymes &eacute;gyptiens,
peut- &ecirc;tre m&ecirc;me &agrave; ceux dont nous poss&eacute;dons les
trait&eacute;s ? Je reviendrai sur ce probl&egrave;me. Pline parle pareillement
des ouvrages o&ugrave; l'on enseignait l'art de teindre les &eacute;meraudes
artificielles et autres pierres brillantes. C'&eacute;taient l&agrave;
des arts &eacute;gyptiens par excellence et les recettes de nos manuscrits
concordent avec cette indication; &agrave; supposer, je le r&eacute;p&egrave;te,
qu'elles ne reproduisent pas exactement les proc&eacute;d&eacute;s auxquels
Pline faisait allusion. Nous avons donn&eacute; plus haut les passages
o&ugrave; Tertullien parle, au IIIe si&egrave;cle, des myst&egrave;res
des m&eacute;taux et des pierres pr&eacute;cieuses, r&eacute;v&eacute;l&eacute;s
par les anges rebelles, des secrets de l'or et de l'argent, rapproch&eacute;s
de ceux de la magie et de l'astrologie: il s'agit &eacute;videmment ici
de l'alchimie. On trouve aussi dans le n&eacute;oplatonicien Jamblique,
un passage o&ugrave; la magie semble associ&eacute;e &agrave; l'art de
composer les pierres pr&eacute;cieuses, et de m&eacute;langer les produits
des plantes. Les manuscrits alchimiques attribuent m&ecirc;me &agrave;
Jamblique deux proc&eacute;d&eacute;s de transmutation. Un texte plus explicite
est celui des chroniqueurs byzantins, d'apr&egrave;s lesquels Diocl&eacute;tien
d&eacute;truisit en &eacute;gypte les livres d'alchimie. Le fait est tout
&agrave; fait conforme &agrave; la pratique du droit romain; il est attest&eacute;
par Jean D' Antioche, auteur qui a &eacute;crit au temps d' H&eacute;raclius
(VIIe si&egrave;cle) et qui semble avoir copi&eacute; sur ce point le chronographe
&eacute;gyptien Panodorus, contemporain d'Arcadius. Ce texte a &eacute;t&eacute;
reproduit ensuite par Suidas et par plusieurs autres auteurs. Ces auteurs
disent express&eacute;ment que "Diocl&eacute;tien fit br&ucirc;ler vers
l'an 290, les anciens livres de chimie des &eacute;gyptiens relatifs &agrave;
l'or et &agrave; l'argent, afin qu'ils ne pussent s'enrichir par cet art
et en tirer la source de richesses qui leur permissent de se r&eacute;volter
contre les romains". M A Dumont, de l'acad&eacute;mie des inscriptions,
savant dont nous regrettons la perte r&eacute;cente, m'a signal&eacute;
un texte tout pareil quant au fond, quoique distinct par les mots, qu'il
a rencontr&eacute; dans les actes de saint Procope. La r&eacute;daction
actuelle de ces actes semble du Xe si&egrave;cle; mais ils sont d&eacute;j&agrave;
cit&eacute;s au deuxi&egrave;me concile de Nic&eacute;e (au commencement
du VIIIe si&egrave;cle) et leur premi&egrave;re r&eacute;daction remonterait,
d'apr&egrave;s Baronius, au temps de l'empereur Julien. En tout cas, le
passage pr&eacute;c&eacute;dent est &eacute;tranger &agrave; l'histoire
du saint lui-m&ecirc;me; il a &eacute;t&eacute; tir&eacute; de vieilles
chroniques, que les amplificateurs successifs des actes de saint Procope
n'avaient pas int&eacute;r&ecirc;t &agrave; modifier. Ces textes sont tout
&agrave; fait conformes au passage de Zosime d&eacute;j&agrave; cit&eacute;,
d'apr&egrave;s lequel le royaume d'&eacute;gypte &eacute;tait enrichi par
l'alchimie. Il semble r&eacute;pondre &agrave; la destruction de certains
trait&eacute;s, o&ugrave; la m&eacute;tallurgie positive, tr&egrave;s cultiv&eacute;e
dans la vieille &eacute;gypte, &eacute;tait associ&eacute;e &agrave; des
recettes chim&eacute;riques de transmutation: trait&eacute;s pareils &agrave;
ceux qui figurent dans les papyrus de Leide et dans nos manuscrits. La
concordance de tous ces faits, tir&eacute;s de sources diverses, est frappante.
L'alchimie &eacute;tait d&eacute;sign&eacute;e &agrave; l'origine sous
le nom de science sacr&eacute;e, art divin et sacr&eacute;, d&eacute;signations
qui lui &eacute;taient communes avec la magie. Le nom m&ecirc;me de l'alchimie
figure pour la premi&egrave;re fois dans un trait&eacute; astrologique
de Julius Firmicus, &eacute;crivain du IVe si&egrave;cle de notre &egrave;re,
dont la conformit&eacute; g&eacute;n&eacute;rale avec Manilius est bien
connue: "Si c' est la maison de Mercure, elle donne l'astronomie; celle
de V&eacute;nus annonce les chants et la joie; celle de Mars, les armes...
celle de Jupiter, le culte divin et la science des lois; celle de Saturne,
la science de l'alchimie". L'adjonction de la pr&eacute;fixe Al est suspecte
et d&ucirc;e sans doute &agrave; un copiste; mais l'existence du nom m&ecirc;me
de la chimie dans Firmicus n'a pas &eacute;t&eacute; r&eacute;voqu&eacute;e
en doute. Le patronage de Saturne rappelle &agrave; la fois le plomb, qui
lui est d&eacute;di&eacute;, et Osiris, synonyme du plomb, et dont le tombeau
&eacute;tait l'embl&ecirc;me de la chimie, d'apr&egrave;s Olympiodore.
Julius Firmicus reproduit ailleurs l'un des axiomes favoris du pseudo-d&eacute;mocrite
et de ses commentateurs: "La nature est vaincue par la nature". Julius
Firmicus nous reporte au temps de Zosime, ou plut&ocirc;t de ses premiers
successeurs. Un texte tr&egrave;s explicite se lit dans le th&eacute;ophraste
d' En&eacute;e De Gaza, dialogue relatif &agrave; la r&eacute;surrection
des morts, et qui constitue avec Pline et Manilius, en dehors des papyrus
et des manuscrits alchimiques bien entendu, le plus ancien document pr&eacute;cis,
de date certaine, o&ugrave; il soit question de la transmutation des m&eacute;taux.
En&eacute;e De Gaza &eacute;tait un philosophe n&eacute;oplatonicien du
Ve si&egrave;cle, &eacute;l&egrave;ve d'Hi&eacute;rocl&egrave;s, et qui
se convertit plus tard au christianisme. Apr&egrave;s avoir expos&eacute;
que le corps humain, form&eacute; par l'assemblage des quatre &eacute;l&eacute;ments
(terre, eau, air, feu), les reproduit par sa d&eacute;composition, il reprend
la th&egrave;se platonicienne des id&eacute;es, d'apr&egrave;s laquelle:
"La forme subsiste, tandis que la mati&egrave;re &eacute;prouve les changements,
parce que celle-ci est faite pour prendre toutes les qualit&eacute;s. Soit
une statue d'Achille en airain; supposons-la d&eacute;truite, et ses d&eacute;bris
r&eacute;duits en petits morceaux; si maintenant un artisan recueille cet
airain, le purifie, et, par une science singuli&egrave;re, le change en
or et lui donne la figure d'Achille, celui-ci sera en or au lieu d'&ecirc;tre
en airain; mais ce sera pourtant Achille. Ainsi se comporte la mati&egrave;re
du corps d&eacute;p&eacute;rissable et corruptible, qui par l'art du cr&eacute;ateur
devient pure et immortelle". Ce passage pourrait &ecirc;tre interpr&eacute;t&eacute;
comme une simple hypoth&egrave;se philosophique; mais &eacute;n&eacute;e
De Gaza le pr&eacute;cise, en disant un peu plus loin: "Le changement de
la mati&egrave;re en mieux n'a rien d'incroyable; c'est ainsi que les savants
en l'art de la mati&egrave;re prennent de l'argent et de l'&eacute;tain,
en font dispara&icirc;tre l'apparence, colorent et changent la mati&egrave;re
en or excellent. Avec le sable divis&eacute; et le natron dissoluble, on
fabrique le verre, c'est-&agrave;-dire une chose nouvelle et brillante".
C'est toujours la m&ecirc;me association entre les diverses pratiques de
la chimie du feu, relatives aux verres et aux m&eacute;taux. Le m&eacute;lange
mystique des id&eacute;es de transmutation et de r&eacute;surrection se
retrouve dans les trait&eacute;s des alchimistes grecs, aussi bien que
dans &eacute;n&eacute;e De Gaza. "Il faut d&eacute;pouiller la mati&egrave;re
de ses qualit&eacute;s pour arriver &agrave; la perfection, dit Stephanus;
car le but de la philosophie, c' est la dissolution des corps (mat&eacute;riels)
et la s&eacute;paration de l'&acirc;me du corps". A la m&ecirc;me &eacute;poque,
les chimistes apparaissent individuellement et sous leur d&eacute;nomination
v&eacute;ritable dans les chroniques. Le premier qui soit appel&eacute;
de ce nom est un charlatan, Johannes Isthmeos, qui escroquait les orf&egrave;vres
au temps de l'empereur Anastase et qui pr&eacute;senta &agrave; cet empereur
un mors de cheval en or massif: "Tu ne me tromperas pas comme les autres",
repartit Anastase, et il le rel&eacute;gua, en l'an 504, dans la forteresse
de Petra, o&ugrave; il mourut. Tous les chroniqueurs byzantins, Cedrenus,
Jean Malala, auteurs du Xe si&egrave;cle, Th&eacute;ophane et d'autres
encore, qui ont racont&eacute; l'histoire de cette &eacute;poque, parlent
du personnage &agrave; peu pr&egrave;s dans les m&ecirc;mes termes; sans
doute en reproduisant un m&ecirc;me texte original. Ce r&eacute;cit rappelle
les proscriptions des chald&eacute;ens sous les premiers empereurs. Johannes
Isthmeos &eacute;tait l'anc&ecirc;tre des alchimistes du moyen &acirc;ge
et de la renaissance, qui ont fait tant de dupes en op&eacute;rant devant
les cr&eacute;dules la transmutation des m&eacute;taux: entre les sectateurs
des sciences occultes, les charlatans et les escrocs, il a toujours exist&eacute;
une &eacute;troite parent&eacute;. L'alchimie, envisag&eacute;e comme formant
un corps de doctrines scientifiques, n'est pas cit&eacute;e dans les historiens
anciens parvenus jusqu'&agrave; nous, du moins avant Jean D'Antioche, qui
para&icirc;t avoir v&eacute;cu au VIIe si&egrave;cle. Nous avons reproduit
son passage relatif &agrave; la destruction des ouvrages chimiques en &eacute;gypte
par Diocl&eacute;tien. Mais ce passage est tir&eacute; certainement de
chroniqueurs plus anciens, probablement de Panodorus. On pourrait rappeler
aussi Ostan&egrave;s et D&eacute;mocrite, nomm&eacute;s dans Pline et dans
Columelle, &agrave; la v&eacute;rit&eacute; comme magiciens, plut&ocirc;t
que comme alchimistes explicitement d&eacute;sign&eacute;s: les traites
du dernier relatifs &agrave; la coloration du verre appartiennent bien
&agrave; notre science. Au Viiie si&egrave;cle, le polygraphe Georges Le
Syncelle conna&icirc;t nos principaux auteurs et il raconte la pr&eacute;tendue
initiation de D&eacute;mocrite par Ostan&egrave;s, Marie la juive et Pamm&eacute;n&egrave;s;
il cite ses quatre livres sur l'or, l'argent, les pierres et la pourpre,
&agrave; peu pr&egrave;s dans les m&ecirc;mes termes que Syn&eacute;sius.
Ce texte est extrait aussi de chroniqueurs ant&eacute;rieurs. D'apr&egrave;s
Scaliger, il aurait &eacute;t&eacute; &eacute;crit par le chronographe
&eacute;gyptien Panodorus, moine contemporain d' Arcadius et que Le Syncelle
cite avec les plus grands &eacute;loges; ceci nous ram&egrave;ne encore
au temps de Syn&eacute;sius. Georges Le Syncelle reproduit aussi des extraits
&eacute;tendus de Zosime et de Syn&eacute;sius: or certains de ces m&ecirc;mes
extraits se lisent textuellement dans les manuscrits de nos biblioth&egrave;ques.
Le Syncelle et les auteurs qu'il a copi&eacute;s avaient donc entre les
mains les ouvrages m&ecirc;mes qui sont arriv&eacute;s jusqu' &agrave;
nous. Photius, compilateur du IXe si&egrave;cle, cite &eacute;galement
Zosime, ainsi qu'Olympiodore, dont il nous raconte la biographie. Suidas,
au Xe si&egrave;cle, tient le m&ecirc;me langage. A la m&ecirc;me &eacute;poque
nous pouvons invoquer une autorit&eacute; d'un ordre tout diff&eacute;rent,
celle des arabes. Dans le Khitab-Al-Fihrist, encyclop&eacute;die &eacute;crite
vers l'an 235 de l'H&eacute;gire, c'est-&agrave;-dire vers l'an 850 de
notre &egrave;re, on trouve plusieurs pages consacr&eacute;es &agrave;
la liste des auteurs alchimiques (P 253 de l'&eacute;dition de 1871). M
Leclerc a cit&eacute; ce texte et M Derenbourg a eu l'obligeance de me
le traduire verbalement. On y lit les noms d'un grand nombre d'auteurs
: les uns perdus, les autres inscrits dans les manuscrits grecs que nous
poss&eacute;dons, tels que Herm&egrave;s, Agothod&eacute;mon, Ostan&egrave;s,
Chym&egrave;s, Cl&eacute;op&acirc;tre, Marie, Stephanus, Sergius, Dioscorus,
etc. &agrave; partir de ce temps, nous trouvons chez les byzantins, puis
chez les arabes et chez les occidentaux, une cha&icirc;ne non interrompue
de t&eacute;moignages historiques, relatifs &agrave; l'alchimie et aux
gens qui l'ont cultiv&eacute;e. Nous touchons d'ailleurs &agrave; la date
o&ugrave; ont &eacute;t&eacute; faites les copies des manuscrits que nous
poss&eacute;dons et dont les plus anciens, celui de saint-Marc &agrave;
Venise, par exemple, remontent au XIe si&egrave;cle; c'est-&agrave;-dire
qu'ils sont presque contemporains de Suidas. Il r&eacute;sulte de cet ensemble
de faits et de documents une filiation non interrompue de t&eacute;moignages
relatifs &agrave; l'alchimie et aux &eacute;crivains; alchimiques, au moins
depuis le IIIe si&egrave;cle de notre &egrave;re; filiation qui ne le c&egrave;de
en valeur et en certitude &agrave; aucune de celles sur lesquelles repose
l'autorit&eacute; des ouvrages les plus authentiques de l'antiquit&eacute;.
3-D&eacute;mocrite. D&eacute;mocrite et les traditions qui s'y rattachent
jouent un r&ocirc;le capital dans l'histoire des origines de l'alchimie.
En effet, par les livres venus jusqu'&agrave; nous et qui contiennent des
recettes et des formules pratiques, l'ouvrage le plus ancien de tous, celui
que les auteurs ayant quelque autorit&eacute; historique citent, et qui
n'en cite aucun, c'est celui de D&eacute;mocrite, intitul&eacute; Physica
et Mystica. Cet ouvrage est pseudonyme, je n'ai pas besoin de le r&eacute;p&eacute;ter;
mais il se rattache &agrave; l'œuvre authentique de D&eacute;mocrite par
des liens faciles &agrave; entrevoir. Assur&eacute;ment, les historiens
de la philosophie antique ont le droit et le devoir de n'admettre que des
livres incontestables, lorsqu'il s'agit d'&eacute;tablir ce que D&eacute;mocrite
a r&eacute;ellement &eacute;crit. Mais ce n'est pas l&agrave; une raison
suffisante pour &eacute;carter le reste du domaine de l'histoire et pour
refuser d'en &eacute;tablir l'&eacute;poque et la filiation. En effet les
ouvrages des imitateurs, m&ecirc;me pseudonymes, de D&eacute;mocrite ont
leur date et leur caract&egrave;re propre. Ces ouvrages sont anciens, eux
aussi, et ils r&eacute;pondent &agrave; un certain degr&eacute; de l'&eacute;volution
incessante des croyances humaines, des doctrines philosophiques et des
connaissances positives. Les livres magiques et naturalistes que l'on attribuait
&agrave; D&eacute;mocrite, au temps de Pline et de Columelle, feraient
tache dans la vie du grand philosophe rationaliste; mais ils avaient pourtant
la pr&eacute;tention de relever de son inspiration. Ils ont concouru &agrave;
l'&eacute;ducation mystique et pratique de plusieurs g&eacute;n&eacute;rations
d'hommes; ils se rattachent en outre de la fa&ccedil;on la plus directe
&agrave; l'histoire des origines de l'une des sciences fondamentales de
notre temps, la chimie. Avant de parler de cet ordre d'ouvrages et de t&acirc;cher
de retrouver les noms v&eacute;ritables de quelques-uns des auteurs de
ces trait&eacute;s pseudo d&eacute;mocritains, cherchons d'abord quel lien
ils peuvent offrir avec les &eacute;v&eacute;nements v&eacute;ritables
de la vie du philosophe et les œuvres qu'il a r&eacute;ellement compos&eacute;es.
D&eacute;mocrite, d' Abd&egrave;re, mort vers l'an 357 avant l'&egrave;re
chr&eacute;tienne, est un des philosophes grecs les plus c&eacute;l&egrave;bres
et, les moins connus, du moins par ses œuvres authentiques. C'&eacute;tait
un rationaliste et un esprit puissant. Il avait &eacute;crit avant Aristote,
qui le cite fr&eacute;quemment, sur toutes les branches des connaissances
humaines et il avait compos&eacute; divers ouvrages relatifs aux sciences
naturelles, comme Diog&egrave;ne Laerce, son biographe, nous l'apprend.
C'est le fondateur de l'&eacute;cole atomistique, reprise ensuite par &eacute;picure,
&eacute;cole qui a eu tant d'adeptes dans l'antiquit&eacute; et qui a fait
de nouveau fortune parmi les chimistes modernes. D&eacute;mocrite avait
voyag&eacute; en &eacute;gypte, en, Chald&eacute;e et dans diverses r&eacute;gions
de l'Orient et il avait &eacute;t&eacute; initi&eacute; aux connaissances
th&eacute;oriques et peut-&ecirc;tre aussi aux arts pratiques de ces contr&eacute;es.
Ces voyages &eacute;taient de tradition parmi les premiers philosophes
grecs, qui avaient coutume de compl&eacute;ter ainsi leur &eacute;ducation.
Les voyages d'H&eacute;rodote sont certains et racont&eacute;s par lui-m&ecirc;me.
La tradition nous a transmis le souvenir de ceux de Platon, de Pythagore
et de D&eacute;mocrite. Les derniers en particulier sont attest&eacute;s
par toute l'antiquit&eacute;. Diog&egrave;ne Laerce les signale, et cela,
para&icirc;t-il, d'apr&egrave;s Antisth&egrave;nes, auteur presque contemporain
de D&eacute;mocrite; lequel rapportait que D&eacute;mocrite apprit des
pr&ecirc;tres la g&eacute;om&eacute;trie et visita l'&eacute;gypte, la
Perse et la mer rouge. Cic&eacute;ron et Strabon, parlent de ces voyages.
D' apr&egrave;s Diodore, D&eacute;mocrite s&eacute;journa cinq ans en &eacute;gypte.
Cl&eacute;ment D'Alexandrie, dans un passage dont une partie, d'apr&egrave;s
Mullach, arait &eacute;t&eacute; emprunt&eacute;e &agrave; D&eacute;mocrite
lui m&ecirc;me, dit &eacute;galement qu'il alla en Babylone, en Perse,
en &eacute;gypte et qu'il &eacute;tudia sous les mages et les pr&ecirc;tres.
Aussi lui attribuait-on certains ouvrages sur les &eacute;critures sacr&eacute;es
des chald&eacute;ens et sur celles de M&eacute;ro&eacute;. Si j'insiste
sur les voyages et sur l'&eacute;ducation de D&eacute;mocrite, c'est que
ces r&eacute;cits, qui semblent authentiques, changent de physionomie dans
Pline l'ancien. Pline est le premier auteur qui ait transform&eacute; le
caract&egrave;re du philosophe rationaliste, et qui lui ait attribu&eacute;
cette qualit&eacute; de magicien, demeur&eacute;e d&egrave;s lors attach&eacute;e
&agrave; son nom pendant tout le moyen &acirc;ge. Ainsi Pline fait de D&eacute;mocrite,
le p&egrave;re de la magie, et il pr&eacute;lude aux histoires de Syn&eacute;sius
et de Georges Le Syncelle, d'apr&egrave;s lesquelles D&eacute;mocrite aurait
&eacute;t&eacute; initi&eacute; &agrave; l'alchimie par les pr&ecirc;tres
&eacute;gyptiens et par Ostan&egrave;s le mage. On rencontre le m&ecirc;me
m&eacute;lange de traditions, les unes authentiques, les autres apocryphes,
dans l'&eacute;tude des ouvrages de D&eacute;mocrite. Les œuvres de D&eacute;mocrite
et de son &eacute;cole formaient dans l'antiquit&eacute; une sorte d'encyclop&eacute;die
philosophique et scientifique, analogue &agrave; l'ensemble des trait&eacute;s
qui portent le nom d'Aristote. Elle fut r&eacute;unie et class&eacute;e
en t&eacute;tralogies par le grammairien Thrasylle, du temps de Tib&egrave;re.
Malheureusement ces livres sont aujourd'hui perdus, &agrave; l'exception
de divers fragments r&eacute;colt&eacute;s &ccedil;a et l&agrave; et r&eacute;unis
d'abord par M Franck, en 1836, puis par Mullach. Mullach, avec une critique
s&eacute;v&egrave;re, a fait la part des œuvres authentiques dans sa collection,
et il a soigneusement &eacute;cart&eacute; tout ce qui lui a paru pseudonyme
ou apocryphe. Toutefois une s&eacute;paration absolue entre les deux ordres
d'&eacute;crits mis sous le nom de D&eacute;mocrite est peut-&ecirc;tre
impossible, &agrave; cause des imitations et des interpolations successives
; surtout en ce qui touche les ouvrages d'histoire naturelle et d'agriculture,
si souvent cit&eacute;s par Pline et ses contemporains et dont les geoponica
nous ont conserv&eacute; des d&eacute;bris fort &eacute;tendus. Diog&egrave;ne
Laerce attribue &agrave; D&eacute;mocrite des trait&eacute;s sur le suc
des plantes (cit&eacute;s aussi par P&eacute;trone), sur les pierres, les
min&eacute;raux, les couleurs, les m&eacute;taux, la teinture du verre,
etc. S&eacute;n&egrave;que dit encore que D&eacute;mocrite avait d&eacute;couvert
les proc&eacute;d&eacute;s suivis de son temps pour amollir l'ivoire, pr&eacute;parer
l'&eacute;meraude artificielle, colorer les mati&egrave;res vitrifi&eacute;es
: ... etc. Ceci rappelle les quatre livres sur la teinture de l'or, de
l'argent, des pierres et de la pourpre, assign&eacute;s plus tard par Syn&eacute;sius
et par Georges Le Syncelle &agrave; D&eacute;mocrite. Olympiodore, auteur
alchimiste du IVe si&egrave;cle, parle encore des quatre livres de D&eacute;mocrite
sur les &eacute;l&eacute;ments: le feu et ce qui en vient; l'air, les animaux
et ce qui en vient; l'eau, les poissons et ce qui en vient; la terre, les
sels, les m&eacute;taux, les plantes et ce qui en vient, etc. Tout cela
semble se rapporter &agrave; des trait&eacute;s antiques. Le d&eacute;part
rigoureux entre les œuvres authentiques et les ouvrages des disciples et
des imitateurs de D&eacute;mocrite, qui se sont succ&eacute;d&eacute; pendant
cinq ou six si&egrave;cles, est aujourd'hui, je le r&eacute;p&egrave;te,
difficile; surtout en l'absence d'ouvrages complets et absolument certains.
Cependant, ces ouvrages, m&ecirc;me pseudonymes, semblent renfermer parfois
des fragments de livres plus anciens. Leur ensemble est d'ailleurs int&eacute;ressant,
comme portant le cachet du temps o&ugrave; ils ont &eacute;t&eacute; &eacute;crits,
au double point de vue des doctrines mystiques ou philosophiques et des
connaissances positives. J'ai retrouv&eacute; r&eacute;cemment dans les
manuscrits alchimiques et publi&eacute; un fragment sur la teinture en
pourpre par voie v&eacute;g&eacute;tale, fragment qui semble avoir appartenu
&agrave; la collection des oeuvres de D&eacute;mocrite; je veux dire aux
ouvrages cit&eacute;s par Diog&egrave;ne Laerce, P&eacute;trone et Sen&egrave;que.
Les sujets que ceux-ci traitaient, notamment l'&eacute;tude de la teinture
des verres et &eacute;maux, nous expliquent comment les premiers alchimistes,
empress&eacute;s &agrave; se cacher sous l'&eacute;gide d'un pr&eacute;curseur
autoris&eacute;, ont donn&eacute; le nom de D&eacute;mocrite &agrave; leur
trait&eacute; fondamental, physica et mystica. Celui-ci est un assemblage
incoh&eacute;rent de plusieurs morceaux d'origine diff&eacute;rente. Il
d&eacute;bute, sans pr&eacute;ambule, par un proc&eacute;d&eacute; technique
pour teindre en pourpre; c'est celui que j'ai traduit: ce fragment, dont
le caract&egrave;re est purement technique, n'a aucun lien avec le reste.
Les manuscrits renferment &agrave; la suite une &eacute;vocation des enfers
du ma&icirc;tre de D&eacute;mocrite (Ostan&egrave;s), puis des recettes
alchimiques. Donnons quelques d&eacute;tails sur ces diverses parties.
Le second fragment &eacute;vocation magique rapporte que le ma&icirc;tre
&eacute;tant mort, sans avoir eu le temps d'initier D&eacute;mocrite aux
myst&egrave;res de la science, ce dernier l'&eacute;voqua du sein des enfers
: "Voil&agrave; donc la r&eacute;compense de ce que j'ai fait pour toi",
s'&eacute;crie l'apparition. Aux questions de D&eacute;mocrite, elle r&eacute;pond:
"Les livres sont dans le temple". N&eacute;anmoins, on ne r&eacute;ussit
pas &agrave; les trouver. Quelque temps apr&egrave;s, pendant un festin,
on vit une des colonnes du temple s'entr' ouvrir; on y aper&ccedil;ut les
livres du ma&icirc;tre, lesquels renfermaient seulement les trois axiomes
mystiques: "La nature se pla&icirc;t dans la nature; la nature triomphe
de la nature; la nature domine la nature"; axiomes qui reparaissent ensuite
comme un refrain, &agrave; la fin de chacun des paragraphes de l'opuscule
alchimique proprement dit. Ce r&eacute;cit fantastique a &eacute;t&eacute;
reproduit plus d'une fois au moyen &acirc;ge, sous des noms diff&eacute;rents,
et attribu&eacute; &agrave; divers ma&icirc;tres c&eacute;l&egrave;bres.
L'&eacute;vocation elle-m&ecirc;me tranche par son caract&egrave;re avec
la premi&egrave;re et la derni&egrave;re parties, o&ugrave; rien d'analogue
ne se retrouve. Cependant, elle rappelle le titre d'un ouvrage sur les
enfers , attribu&eacute; &agrave; D&eacute;mocrite et dont le vrai caract&egrave;re
est incertain. Peut-&ecirc;tre aussi faut-il y chercher quelque ressouvenir
des id&eacute;es du vrai D&eacute;mocrite sur les fant&ocirc;mes et sur
les songes, auxquels il supposait une existence r&eacute;elle. Nous trouvons
des id&eacute;es toutes pareilles dans &eacute;picure et dans Lucr&egrave;ce,
qui attribuaient aux images sorties des corps une certaine r&eacute;alit&eacute;
substantielle, analogue &agrave; celle de la mue des serpents. On con&ccedil;oit
que de telles th&eacute;ories conduisaient ais&eacute;ment &agrave; des
imaginations pareilles &agrave; celles des spirites de nos jours. Quoi
qu'il en soit, le r&eacute; cit de l'&eacute;vocation que je viens de rappeler
nous ram&egrave;ne aux ouvrages magiques apocryphes, que l'on attribuait
d&eacute;j&agrave; &agrave; D&eacute;mocrite du temps de Pline; je ne serais
pas surpris qu'elle en f&ucirc;t m&ecirc;me tir&eacute;e. Nous aurions
alors ici rois ordres de morceaux de date diff&eacute;rente: la partie
alchimique, apocryphe et la plus r&eacute;cente, mais ant&eacute;rieure
au IVe si&egrave;cle de notre &egrave;re; la partie magique, &eacute;galement
apocryphe, mais pr&eacute;c&eacute;dant Pline; et la partie technique,
peut-&ecirc;tre la plus ancienne, se rattachant seule &agrave; D&eacute;mocrite,
ou plut&ocirc;t &agrave; son &eacute;cole . Cette association, par les
copistes, de fragments d'&eacute;poques diff&eacute;rentes n'est pas rare
dans les manuscrits. En tous cas, elle a lieu dans quatre manuscrits de
la biblioth&egrave;que nationale, lesquels semblent provenir d'une source
commune. Elle existe aussi dans le manuscrit de saint Marc, qui remonte
au XIe si&egrave;cle. Certes, il est &eacute;trange de voir ainsi un homme
tel que D&eacute;mocrite, dou&eacute; d'une incr&eacute;dulit&eacute; inflexible
vis-&agrave;-vis des miracles, d'apr&egrave;s Lucien, un philosophe naturaliste
et libre penseur par excellence, m&eacute;tamorphos&eacute; en magicien
et en alchimiste ! Pline raconte, en effet, que D&eacute;mocrite fut instruit
dans la magie par Ostan&egrave;s ; il revient &agrave; plusieurs reprises
sur ses relations avec les mages. Solin parle au contraire de ses discussions
contre eux. D'apr&egrave;s Pline, D&eacute;mocrite viola le tombeau de
Dardanus, pour retirer les livres magiques qui y &eacute;taient ensevelis,
et il composa lui-m&ecirc;me des ouvrages magiques. Cependant Pline ajoute
que plusieurs tiennent ces derniers pour apocryphes. L'usage d'enfermer
des manuscrits dans les tombeaux rappelle les papyrus que nous trouvons
aujourd'hui avec les momies et qui nous ont conserv&eacute; tant de pr&eacute;cieux
renseignements sur l'antiquit&eacute;. On a fait souvent des r&eacute;cits
analogues de tombeaux viol&eacute;s pour en tirer les livres des ma&icirc;tres,
dans les l&eacute;gendes du moyen &acirc;ge, et d&eacute;j&agrave; dans
celles de la vieille &eacute;gypte. Elles n'&eacute;taient pas sans quelque
fondement. C'est pr&eacute;cis&eacute;ment un tombeau de Th&egrave;bes,
sans doute celui d'un magicien, qui nous a restitu&eacute; les papyrus
de la collection Anastasi, aujourd'hui &agrave; Leide. Or ces derniers
papyrus montrent que la transformation de D&eacute;mocrite en magicien
n'est pas attest&eacute;e seulement par Pline et par les manuscrits alchimiques
de nos biblioth&egrave;ques. Le nom de D&eacute;mocrite se trouve &agrave;
deux reprises dans le rituel magique des papyrus de Leide, papyrus qui
renferment &agrave; la fois des recettes magiques et des recettes alchimiques.
On rencontre aussi dans ces papyrus, sous le titre de sph&egrave;re de
D&eacute;mocrite , une table en chiffres destin&eacute;e &agrave; pronostiquer
la vie ou la mort d'un malade; table toute pareille aux tables d'Herm&egrave;s
et de Petosiris qui existent dans les manuscrits des biblioth&egrave;ques.
Tout cela, je le r&eacute;p&egrave;te, montre que les traditions attach&eacute;es
au nom de D&eacute;mocrite en &eacute;gypte, &agrave; l' &eacute;poque
des premiers si&egrave;cles de l'&egrave;re chr&eacute;tienne, avaient
le m&ecirc;me caract&egrave;re que dans nos manuscrits. Ajoutons, comme
dernier trait commun, que dans le papyrus N 66 de Leide, les proc&eacute;d&eacute;s
de teinture en pourpre, les recettes m&eacute;tallurgiques, les recettes
de transmutation et les recettes magiques se trouvent pareillement associ&eacute;es.
Or ces divers ordres de proc&eacute;d&eacute;s se lisent ensemble dans
l'opuscule du pseudo D&eacute;mocrite, opuscule traduit ou plut&ocirc;t
paraphras&eacute; en latin, d'apr&egrave;s un manuscrit analogue aux n&ocirc;tres,
et publi&eacute; &agrave; Padoue, par Pizzimenti, en 1573, sous le titre
de D&eacute;mocriti Abderitae De Arte Magn&acirc; , avec les commentaires
de Syn&eacute;sius, de P&eacute;lage et de Stephanus D' Alexandrie. Je
l'ai analys&eacute; plus haut. Mullach regarde &agrave; tort cet opuscule
comme distinct des Physica et Mystica; je me suis assur&eacute; qu'il n'existe
entre eux d'autre diff&eacute;rence que l'absence des deux morceaux relatifs
&agrave; la teinture en pourpre et &agrave; l'&eacute;vocation magique.
Ceux-ci semblent avoir &eacute;t&eacute; ajout&eacute;s en t&ecirc;te par
quelque copiste, d'apr&egrave;s la seule analogie du nom de l'auteur, r&eacute;el
ou pr&eacute;tendu, et peut-&ecirc;tre aussi d'apr&egrave;s l'analogie
des sujets teinture en pourpre et teinture des m&eacute;taux. Le manuscrit
de saint Marc (Fol 2) distingue, en effet, les deux sujets, dans une table
des mati&egrave;res plus vieille que ce manuscrit. Il existe un autre trait&eacute;
du pseudo-D&eacute;mocrite, trait&eacute; d&eacute;di&eacute; &agrave;
Leucippe, philosophe qui fut en effet le ma&icirc;tre et l'ami de D&eacute;mocrite.
"Je me servirai d'&eacute;nigmes, mais elles ne t'arr&ecirc;teront pas,
toi m&eacute;decin qui sais tout". C'est le style des apocryphes. La lettre
de D&eacute;mocrite &agrave; Philar&egrave;te, autre ouvrage du m&ecirc;me
&eacute;crivain, commence par une liste de corps. "Voici le catalogue des
esp&egrave;ces: le mercure tir&eacute; de l'œuf, la magn&eacute;sie, l'antimoine,
la litharge de Calc&eacute;doine et d'Italie, le plomb, l'&eacute;tain,
le fer, le cuivre, la soudure d'or, etc." puis vient l'art myst&eacute;rieux
des teintures m&eacute;talliques. L'expos&eacute; ci-dessus concorde avec
les autres auteurs. En effet, d'apr&egrave;s Syn&eacute;sius, reproduit
par George Le Syncelle, D&eacute;mocrite avait &eacute;crit quatre livres
de teintures sur l'or, l'argent, les pierres et la pourpre: ce qui rappelle
&agrave; la fois la lettre pr&eacute;c&eacute;dente et le passage de S&eacute;n&egrave;que.
Syn&eacute;sius dit encore que D&eacute;mocrite avait dress&eacute; un
catalogue du blanc et du jaune. "Il y enregistra d'abord les solides, puis
les liquides. Il appela le catalogue de l'or, c'est-&agrave;-dire du jaune
: Chrysop&eacute;e, ou l'art de faire de l'or; et le catalogue de l'argent,
c'est-&agrave;-dire celui du blanc: Argyrop&eacute;e, ou l'art de faire
de l'argent". Tous ces commentaires montrent quel int&eacute;r&ecirc;t
on attachait aux recettes du pseudo-D&eacute;mocrite et permettent de les
faire remonter en de&ccedil;&agrave; de la fin du IVe si&egrave;cle de
notre &egrave;re, peut-&ecirc;tre m&ecirc;me beaucoup plus haut. Attachons-nous
d'abord &agrave; l'autorit&eacute; de Syn&eacute;sius: il adresse son commentaire
sur D&eacute;mocrite &agrave; Dioscorus, pr&ecirc;tre de S&eacute;rapis
&agrave; Alexandrie; d&eacute;dicace conforme &agrave; l'opinion qui identifie
l'alchimiste et l'&eacute;v&ecirc;que de Ptol&eacute;ma&iuml;s, lequel
a v&eacute;cu &agrave; la fin du IVe si&egrave;cle. Son ouvrage doit avoir
&eacute;t&eacute; &eacute;crit avant l'an 389, date de la destruction du
temple de S&eacute;rapis &agrave; Alexandrie. En outre, il cite Zosime
le panopolitain comme un auteur tr&egrave;s ancien; ce qui reporterait
celui-ci au moins au temps de Constantin ou de Diocl&eacute;tien; peut-&ecirc;tre
plus loin encore. Le langage gnostique de Zosime est en effet celui des
auteurs de la fin du IIe si&egrave;cle et du commencement du IIIe. Or,
le pseudo D&eacute;mocrite est d&eacute;j&agrave; une autorit&eacute; pour
Zosime. T&acirc;chons d'aller plus avant. Les auteurs anciens signalent
certains &eacute;crits ou m&eacute;moires sur la nature, fabriqu&eacute;s
par un &eacute;gyptien, Bolus De Mend&egrave;s, et attribu&eacute;s &agrave;
tort &agrave; D&eacute;mocrite. Ces m&eacute;moires &eacute;taient appel&eacute;s
Chirocmeta , c'est-&agrave;-dire manipulations, nom qui a &eacute;t&eacute;
aussi donn&eacute; aux &eacute;crits de Zosime Pline, qui croit les m&eacute;moires
de D&eacute;mocrite authentiques, d&eacute;clare qu'ils sont remplis du
r&eacute;cit de choses prodigieuses. Peut-&ecirc;tre D&eacute;mocrite avait-il
r&eacute;ellement compos&eacute; des trait&eacute;s de ce genre, auxquels
on a r&eacute;uni ensuite ceux de ses imitateurs. Un autre ouvrage sur
"les sympathies et les antipathies" est assign&eacute; tant&ocirc;t &agrave;
D&eacute;mocrite par Columelle, tant&ocirc;t &agrave; Bolus par Suidas.
Ce livre a &eacute;t&eacute; publi&eacute; par Fabricius dans sa biblioth&egrave;que
grecque: c'est un amas de contes et d'enfantillages; mais Pline est rempli
de recettes et de r&eacute;cits analogues. Aulu-Gelle dit formellement
que des auteurs sans instruction ont mis leurs ouvrages sous le nom de
D&eacute;mocrite, afin de s'autoriser de son illustration. Cependant il
n'est pas prouv&eacute; que Bolus ait commis sciemment cette fraude. Il
semble plut&ocirc;t s'&ecirc;tre d&eacute;clar&eacute; de l'&eacute;cole
de D&eacute;mocrite, suivant un usage tr&egrave;s r&eacute;pandu autrefois.
Peut-&ecirc;tre prenait-il le nom de D&eacute;mocrite dans les c&eacute;r&eacute;monies
secr&egrave;tes des initi&eacute;s. St&eacute;phanus De Byzance, &agrave;
l'article Apsinthios, parle en effet de Bolus le d&eacute;mocritain; de
m&ecirc;me les Scholia Nicandri Ad Theriaca. Dans Suidas et dans le violarium
de l'imp&eacute;ratrice Eudocie, autre recueil byzantin, il est question
de Bolus le pythagoricien, qui avait &eacute;crit sur les merveilles, sur
les puissances naturelles, sur les sympathies et les antipathies, sur les
pierres, etc. Bolus est tout au moins contemporain de l'&egrave;re chr&eacute;tienne,
sinon plus ancien. C' est &agrave; quelque ouvrage de l'ordre des siens
que semblent devoir &ecirc;tre rapport&eacute;es les recettes agricoles,
v&eacute;t&eacute;rinaires et autres, attribu&eacute;es &agrave; D&eacute;mocrite
le naturaliste dans les Geoponica , recueil byzantin de recettes et de
faits relatifs &agrave; l'agriculture. Quelques-uns de ces &eacute;nonc&eacute;s
se ressentent m&ecirc;me des influences juives ou gnostiques; par exemple
celui-ci: "d'apr&egrave;s D&eacute;mocrite, aucun serpent n'entrera dans
un pigeonnier, si l'on inscrit aux quatre angles le nom d'Adam". Bolus
n'&eacute;tait pas le seul auteur de l'&eacute;cole d&eacute;mocritaine,
ou pseudo-d&eacute;mocritaine. Nous trouvons aussi dans les manuscrits
alchimiques l'indication des m&eacute;moires d&eacute;mocritains de P&eacute;t&eacute;sis,
autre &eacute;gyptien. Le livre de Soph&eacute; l'&eacute;gyptien, c'est-&agrave;-dire
du vieux roi Ch&eacute;ops, est attribu&eacute; tant&ocirc;t &agrave; Zosime,
tant&ocirc;t &agrave; D&eacute;mocrite. Cela montre qu'il existait en &eacute;gypte,
vers le commencement de l'&egrave;re chr&eacute;tienne, toute une s&eacute;rie
de trait&eacute;s naturalistes, group&eacute;s autour du nom et de la tradition
de D&eacute;mocrite. Cette litt&eacute;rature pseudo D&eacute;mocritaine,
rattach&eacute;e &agrave; tort ou &agrave; raison &agrave; l'autorit&eacute;
du grand philosophe naturaliste, est fort importante: car c'est l'une des
voies par lesquelles les traditions, en partie r&eacute;elles, en partie
chim&eacute;riques, des sciences occultes et des pratiques industrielles
de la vieille &eacute;gypte et de Babylone ont &eacute;t&eacute; conserv&eacute;es.
Sur ces racines &eacute;quivoques de l'astrologie et de l'alchimie se sont
&eacute;lev&eacute;es plus tard les sciences positives dont nous sommes
si fiers: la connaissance de leurs origines r&eacute;elles n'en offre que
plus d'int&eacute;r&ecirc;t pour l'histoire du d&eacute;veloppement de
l'esprit humain. En fait, je le r&eacute;p&egrave;te, c'est &agrave; cette
tradition que se rattachent les alchimistes, aussi bien que les papyrus
de Leide. Il est possible que les œuvres magiques dont parle Pline continsent
d&eacute;j&agrave; des r&eacute;cits et des recettes alchimiques, pareilles
&agrave; celles des Physica et Mystica: &agrave; supposer que ce dernier
ouvrage n'en provienne pas directement. Le langage m&ecirc;me pr&ecirc;t&eacute;
&agrave; D&eacute;mocrite l'alchimiste, est parfois celui d'un charlatan,
parfois celui d'un philosophe: peut-&ecirc;tre en raison du m&eacute;lange
des ouvrages authentiques et apocryphes. Tant&ocirc;t, en effet, il d&eacute;clare:
"Il ne faut pas croire que ce soit par quelque sympathie naturelle que
l'aimant attire le fer... mais cela r&eacute;sulte des propri&eacute;t&eacute;s
physiques des corps". Tant&ocirc;t au contraire, D&eacute;mocrite s'adressant
au roi, dit: "Il faut, &ocirc; roi, savoir ceci: nous sommes les chefs,
les pr&ecirc;tres et les proph&egrave;tes; celui qui n'a pas connu les
substances et ne les a pas combin&eacute;es et n'a pas compris les esp&egrave;ces
et joint les genres aux genres, travaillera en vain et ses peines seront
inutiles; parce que les natures se plaisent entre elles, se r&eacute;jouissent
entre elles, se corrompent entre elles, se transforment entre elles et
se r&eacute;g&eacute;n&egrave;rent entre elles" . Il existe dans les manuscrits
une page c&eacute;l&egrave;bre qui expose les vertus du philosophe, c'est-&agrave;-dire
de l'initi&eacute;. Or, cette prescription est attribu&eacute;e par Cedrenus
&agrave; D&eacute;mocrite, et il ajoute que celui qui poss&egrave;de ces
vertus, comprendra l'&eacute;nigme de la Sibylle, allusion directe &agrave;
l'un des trait&eacute;s alchimiques. Ailleurs, D&eacute;mocrite l'alchimiste
fait appel, non dans quelque na&iuml;vet&eacute;, &agrave; ses vieux compagnons
de travail contre le scepticisme de la jeunesse. "Vous donc, &ocirc; mes
co-proph&egrave;tes, vous avez confiance et vous connaissez la puissance
de la mati&egrave;re; tandis que les jeunes gens ne se fient pas &agrave;
ce qui est &eacute;crit: ils croient que notre langage est fabuleux et
non symbolique". Il parle ensuite de la teinture superficielle des m&eacute;taux
et de leur teinture profonde, de celle que le feu dissipe et de celle qui
y r&eacute;siste, etc.: ce qui r&eacute;pond en effet &agrave; des notions
r&eacute;elles et scientifiques. Quant aux recettes alchimiques elles-m&ecirc;mes
du pseudo D&eacute;mocrite, on y entrevoit diverses exp&eacute;riences
v&eacute;ritables, associ&eacute;es avec des r&eacute;sultats chim&eacute;riques.
Tel est le texte suivant: "Prenez du mercure, fixez-le avec le corps de
la magn&eacute;sie, ou avec le corps du stibium d'Italie, ou avec le soufre
qui n'a pas pass&eacute; par le feu, ou avec l'aphroselinum, ou la chaux
vive, ou l'alun de M&eacute;los, ou l'<i>arsenic</i>, ou comme il vous
plaira, et jetez la poudre blanche sur le cuivre; alors vous aurez du cuivre
qui aura perdu sa couleur sombre. Versez la poudre rouge sur l'argent,
vous aurez de l'or; si c'est sur l'or que vous la jetez, vous aurez le
corail d'or corporifi&eacute;. La sandaraque produit cette poudre jaune,
de m&ecirc;me que l'<i>arsenic</i> bien pr&eacute;par&eacute;, ainsi que
le cinabre, apr&egrave;s qu'il a &eacute;t&eacute; tout &agrave; fait chang&eacute;.
Le mercure seul peut enlever au cuivre sa couleur sombre. La nature triomphe
de la nature". Il n'est gu&egrave;re possible d'interpr&eacute;ter aujourd'hui
ce texte avec pr&eacute;cision: d'abord parce que les mots mercure, <i>arsenic</i>,
soufre, magn&eacute;sie, ne pr&eacute;sentaient pour les alchimistes ni
le sens positif, ni le sens pr&eacute;cis qu'ils ont pour nous; chacun
d'eux d&eacute;signait en r&eacute;alit&eacute; des mati&egrave;res diverses,
ayant dans l'opinion des auteurs du temps une essence commune. Cette notion
est analogue aux id&eacute;es des &eacute;gyptiens sur la nature des m&eacute;taux.
L'int&eacute;r&ecirc;t d'une semblable &eacute;tude est d'ailleurs limit&eacute;.
En effet, les op&eacute;rations qu'effectuaient les alchimistes sont connues
par leurs descriptions; ces op&eacute;rations ne diff&egrave;rent pas des
n&ocirc;tres et portent sur les m&ecirc;mes substances. Or, tous les r&eacute;sultats
positifs des dissolutions, distillations, calcinations, coupellations,
etc., auxquelles ils se livraient sont aujourd'hui parfaitement &eacute;claircis
: nous savons que la transmutation tant r&ecirc;v&eacute;e ne s'y produit
jamais. Il est donc inutile d'en rechercher la formule exacte dans les
recettes du pseudo D&eacute;mocrite, de Sosime ou de leurs successeurs.
Il semble d'ailleurs que ces auteurs laissassent toujours quelque portion
obscure, destin&eacute;e &agrave; &ecirc;tre communiqu&eacute;e seulement
de vive voix. C'est ce qu'indique la fin du pseudo-D&eacute;mocrite. "Voil&agrave;
tout ce qu'il faut pour l'or et l'argent; rien n'est oubli&eacute;, rien
n'y manque, except&eacute; la vapeur et l'&eacute;vaporation de l'eau :
je les ai omises &agrave; dessein, les ayant expos&eacute;es pleinement
dans mes autres &eacute;crits". Je dirai cependant que l'on entrevoit dans
les descriptions du trait&eacute; Physica et Mystica, deux poudres de projection,
propres &agrave; fabriquer l'or et l'argent. On y cite aussi le corail
d'or, autrement dit teinture d'or, qui &eacute;tait r&eacute;put&eacute;
communiquer aux m&eacute;taux la nature de l' or: c'&eacute;tait pour les
alchimistes le chef d'œuvre de leur art.
<p><b>1 - Les Faits.</b>
<p>&nbsp;&nbsp;&nbsp; Les m&eacute;taux chez les &eacute;gyptiens. 1'introduction.
L'alchimie s'appuyait sur un certain ensemble de faits pratiques connus
dans l'antiquit&eacute;, et qui touchaient la pr&eacute;paration des m&eacute;taux,
de leurs alliages et celle des pierres pr&eacute;cieuses artificielles
: il y avait l&agrave; un c&ocirc;t&eacute; exp&eacute;rimental qui n'a
cess&eacute; de progresser pendant tout le moyen &acirc;ge, jusqu'&agrave;
ce que la chimie moderne et positive en soit sortie. Cette histoire n'est
autre que celle de l'industrie m&eacute;tallurgique. Certes je ne saurais
pr&eacute;tendre l'embrasser toute enti&egrave;re dans le cadre restreint
de la pr&eacute;sente &eacute;tude; mais il est n&eacute;cessaire de l'exposer
en partie, pour montrer l'origine positive des id&eacute;es et des illusions
des alchimistes. Cette origine doit &ecirc;tre cherch&eacute;e en &eacute;gypte,
l&agrave; o&ugrave; l'alchimie eut d'abord ses ma&icirc;tres, ses laboratoires
et ses traditions. C'est pourquoi, apr&egrave;s avoir &eacute;tabli dans
les livres pr&eacute;c&eacute;dents le caract&egrave;re historique de traditions,
je vais maintenant r&eacute;sumer les connaissances des anciens &eacute;gyptiens
sur les m&eacute;taux et sur les substances cong&eacute;n&egrave;res. Je
le ferai principalement d'apr&egrave;s le m&eacute;moire capital de M Lepsius
sur cette question, et je montrerai par quelle suite de raisonnements et
d'analogies ils ont &eacute;t&eacute; conduits &agrave; tenter la transmutation
et &agrave; poursuivre les exp&eacute;riences dont nous avons constat&eacute;
l'ex&eacute;cution &agrave; Memphis et &agrave; Alexandrie. Sur les monuments
de l'ancienne &eacute;gypte on voit figurer les m&eacute;taux, soit comme
butin de guerre, soit comme tribut des peuples vaincus; on en reconna&icirc;t
l'image dans les tombeaux, dans les chambres du tr&eacute;sor des temples,
dans les offrandes faites aux dieux. D'apr&egrave;s Lepsius, les &eacute;gyptiens
distinguent dans leurs inscriptions huit produits min&eacute;raux particuli&egrave;rement
pr&eacute;cieux, qu'ils rangent dans l'ordre suivant: l'or, ou Nub; l'asem,
ou electrum, alliage d'or et d'argent; l'argent, ou hat; le chesteb, ou
min&eacute;ral bleu, tel que le lapis-lazuli; le mafek , ou min&eacute;ral
vert, tel que l'&eacute;meraude; le chomt , airain, bronze, ou cuivre ;
le men , ou fer (d'apr&egrave;s Lepsius); enfin le taht , autrement dit
plomb. Cet ordre est constant; on le constate sur les monuments des dynasties
th&eacute;baines, et jusqu'au temps des ptol&eacute;m&eacute;es et des
romains. Dans les annales des compagnons de Thoutmosis III, &agrave; Carnak,
on rencontre souvent, parmi les tributs, des listes et des tableaux figur&eacute;s
de ces substances pr&eacute;cieuses, rang&eacute;es d'apr&egrave;s leur
poids et leur nombre. Les diverses mati&egrave;res que je viens d'&eacute;num&eacute;rer
comprennent &agrave; la fois des m&eacute;taux v&eacute;ritables et des
pierres pr&eacute;cieuses, naturelles ou artificielles. Passons les en
revue: nous reconna&icirc;trons dans leurs propri&eacute;t&eacute;s le
point de d&eacute;part de certaines id&eacute;es th&eacute;oriques des
alchimistes sur les m&eacute;taux. Il faut en effet se replacer dans le
milieu des faits et des notions connus des anciens, pour comprendre leurs
conceptions.
<p><b>2 - L'Or.</b>
<p>&nbsp;&nbsp;&nbsp; L'or, r&eacute;put&eacute; le plus pr&eacute;cieux
des m&eacute;taux, est repr&eacute;sent&eacute; en monceaux, en bourses
contenant de la poudre d'or et des p&eacute;pites naturelles, en objets
travaill&eacute;s, tels que plaques, barres, briques, anneaux. On distingue
d'abord le bon or, puis l'or de roche, c'est-&agrave;-dire brut, non affin&eacute;,
enfin certains alliages, l'&eacute;lectros ou &eacute;lectrum en particulier.
<p><b>3 - L'Argent.</b>
<p>&nbsp;&nbsp;&nbsp; L'argent est figur&eacute; sur les monuments &eacute;gyptiens
sous les m&ecirc;mes formes que l'or, mais avec une couleur diff&eacute;rente.
Son nom pr&eacute;c&egrave;de m&ecirc;me celui de l'or dans quelques inscriptions,
par exemple sur les st&egrave;les du Barkal &agrave; Boulaq: comme si le
rapport entre les deux m&eacute;taux e&ucirc;t &eacute;t&eacute; interverti
&agrave; certains moments, par suite de l'abondance de l'or. On sait que
leur valeur relative, sans changer &agrave; un tel point, a &eacute;t&eacute;
cependant fort diff&eacute;rente chez certains peuples; chez les japonais
de notre &eacute;poque, par exemple, elle s'est &eacute;cart&eacute;e beaucoup
des rapports admis en Europe. L'argent se pr&eacute;parait avec des degr&eacute;s
de puret&eacute; tr&egrave;s in&eacute;gaux. Il &eacute;tait alli&eacute;
non seulement &agrave; l'or, dans l'&eacute;lectrum, mais au plomb, dans
le produit du traitement de certains minerais argentif&egrave;res. Ces
degr&eacute;s in&eacute;gaux de puret&eacute; avaient &eacute;t&eacute;
remarqu&eacute;s de bonne heure et ils avaient donn&eacute; lieu chez les
anciens &agrave; la distinction entre l'argent sans marque, sans titre,
asemon, et l'argent pur, mon&eacute;taire, dont le titre &eacute;tait garanti
par la marque ou effigie imprim&eacute;e &agrave; sa surface. Le mot grec
asemon s'est confondu d'ailleurs avec l'asem , nom &eacute;gyptien de l'
&eacute;lectrum, l'asem &eacute;tant aussi une vari&eacute;t&eacute; d'argent
impur. Dans l'extraction de l'argent de ses minerais, c' &eacute;tait d'abord
l'argent sans titre que l'on obtenait. Son impuret&eacute; favorisait l'opinion
que l'on pouvait r&eacute;ussir &agrave; doubler le poids de l'argent,
par des m&eacute;langes et des tours de main convenables. C'&eacute;tait
en effet l'argent sans titre que les alchimistes pr&eacute;tendaient fabriquer
par leurs proc&eacute;d&eacute;s, sauf &agrave; le purifier ensuite. Dans
les papyrus de Leide, et dans nos manuscrits grecs, les mots: "fabrication
de l'asemon", sont synonymes de transmutation; celle-ci &eacute;tait op&eacute;r&eacute;e
&agrave; partir du plomb, du cuivre et surtout de l'&eacute;tain. C'&eacute;tait
aussi en colorant l'asemon que l'on pensait obtenir l'or: ce qui nous ram&egrave;ne
&agrave; la vari&eacute;t&eacute; d' argent brut qui contenait de l'or,
c'est-&agrave;-dire &agrave; l'&eacute;lectrum.
<p><b>4 - L'Electrum ou Asem.</b>
<p>&nbsp;&nbsp;&nbsp; L' electros, ou electrum, en &eacute;gyptien asem,
alliage d'or et d'argent, se voit &agrave; c&ocirc;t&eacute; de l'or sur
les monuments; il a &eacute;t&eacute; confondu &agrave; tort par quelques-uns
avec ce que nous appelons le vermeil, c' est-&agrave;-dire l'argent dor&eacute;,
lequel est seulement teint &agrave; la surface. Parfois le nom de l'&eacute;lectrum
figure seul sur les monuments, &agrave; la place de l'argent. De m&ecirc;me
chez les alchimistes, le nom mystique d'hommes d'argent est remplac&eacute;
en certains endroits par celui d'hommes d'&eacute;lectrum. Plus dur et
plus l&eacute;ger que l'or pur, cet alliage se pr&ecirc;tait mieux &agrave;
la fabrication des objets travaill&eacute;s. Il &eacute;tait regard&eacute;
autrefois comme un m&eacute;tal du m&ecirc;me ordre que l'or et l'argent.
La plan&egrave;te Jupiter lui &eacute;tait consacr&eacute;e &agrave; l'origine,
attribution qui est encore attest&eacute;e par les auteurs du Ve si&egrave;cle
de notre &egrave;re. Plus tard, l'&eacute;lectrum ayant disparu de la liste
des m&eacute;taux, cette plan&egrave;te fut assign&eacute;e &agrave; l'&eacute;tain.
L'alliage d'or et d'argent se produit ais&eacute;ment dans le traitement
des minerais qui renferment les deux m&eacute;taux simples. C'&eacute;tait
donc la substance originelle, celle dont on tirait les deux autres par
des op&eacute;rations convenables, et il n'est pas surprenant que les anciens
en aient fait un m&eacute;tal particulier; surtout aux &eacute;poques les
plus recul&eacute;es, o&ugrave; les proc&eacute;d&eacute;s de s&eacute;paration
&eacute;taient &agrave; peine &eacute;bauch&eacute;s. N&eacute;ron semble
le premier souverain qui ait exig&eacute; de l'or fin. "tout or", dit Pline,
"contient de l' argent en proportions diverses; lors que l'argent entre
pour un cinqui&egrave;me, le m&eacute;tal prend le nom d' &eacute;lectrum.
On fabrique aussi l' &eacute;lectrum en ajoutant de l'argent &agrave; l'or".
Les proportions signal&eacute;es par Pline n'avaient d'ailleurs rien de
constant. L'&eacute;lectrum, ayant une composition moins bien d&eacute;finie
que les m&eacute;taux purs, a paru former le passage entre les deux. On
savait, en effet, les en extraire tous deux; l or &eacute;tait, je le r&eacute;p&egrave;te,
le produit principal et l'argent en repr&eacute;sentait la scorie, comme
dit Pline. De l&agrave; l'identification du nom &eacute;gyptien de l'&eacute;lectrum,
asem, avec celui de l'argent impur, asemon, et l'id&eacute;e que l'or et
l'argent, corps cong&eacute;n&egrave;res, pouvaient &ecirc;tre fabriqu&eacute;s
par une m&ecirc;me m&eacute;thode de transmutation. Avec le progr&egrave;s
de la purification des m&eacute;taux, l'&eacute;lectrum tomba en d&eacute;su&eacute;tude.
Cependant son nom est encore inscrit dans la liste des signes alchimiques,
parmi les substances m&eacute;talliques. Le mot d'&eacute;lectrum avait
chez les grecs et les romains un double sens: celui de m&eacute;tal et
celui d'ambre jaune. Son &eacute;clat a &eacute;t&eacute; compar&eacute;
&agrave; celui de l'eau jaillissante par Callimaque, et plus tard par Virgile;
comparaison qui nous reporte &agrave; l'identification faite par le Tim&eacute;e
de Platon entre les eaux chimiques et les m&eacute;taux. On con&ccedil;oit
d&egrave;s lors comment, dans le scholiaste d'Aristophane, l'&eacute;lectrum
est assimil&eacute; au verre. Suidas le d&eacute;finit &agrave; son tour:
une forme de l'or m&ecirc;l&eacute; de verre et de pierres pr&eacute;cieuses.
Plus tard, le sens du mot changea et fut appliqu&eacute;, peut-&ecirc;tre
&agrave; cause de l'analogie de la couleur, &agrave; divers alliages jaunes
et brillants, tels que certains bronzes (similor) et le laiton lui-m&ecirc;me.
D'apr&egrave;s Du Cange, les auteurs du moyen &acirc;ge d&eacute;signent
sous le nom d'&eacute;lectrum un m&eacute;lange de cuivre et d'&eacute;tain.
Dans un passage de cette derni&egrave;re &eacute;poque, il est regard&eacute;
comme synonyme de laiton: "Il se donnait la discipline avec des cha&icirc;nes
d'&eacute;lectrum ou de laiton. Nous voyons ici quels changements progressifs
les noms des alliages m&eacute;talliques ont &eacute;prouv&eacute;s dans
le cours des temps. Les trois m&eacute;taux pr&eacute;c&eacute;dents pr&eacute;sentent
le fait caract&eacute;ristique d'un alliage compris par les &eacute;gyptiens
dans la liste des m&eacute;taux purs; association que l airain et le laiton
ont reproduite &eacute;galement chez les anciens. En outre cet alliage
peut &ecirc;tre obtenu du premier jet, au moyen des minerais naturels ;
et il peut &ecirc;tre reproduit par la fusion des deux m&eacute;taux composants,
pris en proportion convenable. C'est donc &agrave; la fois un m&eacute;tal
naturel et un m&eacute;tal factice: rapprochement indiquant les id&eacute;es
qui ont conduit les alchimistes &agrave; t&acirc;cher de fabriquer artificiellement
l'or et l'argent. En effet l'assimilation de l'&eacute;lectrum &agrave;
l'or et &agrave; l'argent explique comment ces derniers corps ont pu &ecirc;tre
envisag&eacute;s comme des alliages, susceptibles d'&ecirc;tre reproduits
par des associations de mati&egrave;res et par des tours de main; comment
surtout, en partant de l'or v&eacute;ritable, on pouvait esp&eacute;rer
en augmenter le poids diplosis par certains m&eacute;langes, et par certaines
additions d'ingr&eacute;dients, qui en laissaient subsister la nature fondamentale.
Le chesbet et le mafek vont nous r&eacute;v&eacute;ler des assimilations
plus &eacute;tendues.
<p><b>5 - Le Saphir ou Chesbet.</b>
<p>&nbsp;&nbsp;&nbsp; Le chesbet et le mafek sont deux substances pr&eacute;cieuses,
qui accompagnent l'or et l'argent dans les inscriptions et qui sont &eacute;troitement
li&eacute;es entre elles. Ainsi, les quatre proph&egrave;tes &agrave; Dender&acirc;
portent chacun un encensoir: le premier en or et en argent, le second en
chesbet (bleu), le troisi&egrave;me en mafek (vert), le quatri&egrave;me
en tehen (jaune). Or, le chesbet et le mafek ne d&eacute;signent pas des
m&eacute;taux au sens moderne, mais des min&eacute;raux color&eacute;s,
dont le nom a &eacute;t&eacute; souvent traduit par les mots de saphir
et d'&eacute;meraude. En r&eacute;alit&eacute;, le nom de chesbet ou chesteb
s'applique &agrave; tout min&eacute;ral bleu, naturel ou artificiel, tel
que le lapis-lazuli, les &eacute;maux bleus et leur poudre, &agrave; base
de cobalt ou de cuivre, les cendres bleues, le sulfate de cuivre, etc.
Le chesbet est figur&eacute; comme objet pr&eacute;cieux sur les monuments,
dans les corbeilles et dans les bourses qui y sont dessin&eacute;es: on
l'aper&ccedil;oit parfois en longs blocs quadrangulaires et en masses de
plusieurs livres. Il a servi &agrave; fabriquer des parures, des colliers,
des amulettes, des incrustations, qui existent dans nos mus&eacute;es.
Il personnifie la d&eacute;esse multicolore, repr&eacute;sent&eacute;e
tant&ocirc;t en bleu, tant&ocirc;t en vert, parfois en jaune, c'est-&agrave;-dire
la d&eacute;esse Hathor, et plus tard, par assimilation, Aphrodite, la
d&eacute;esse grecque, et aussi Cypris, la divinit&eacute; ph&eacute;nicienne
de Chypre, qui a donn&eacute; son nom au cuivre. Les annales de Thoutmosis
III distinguent le vrai chesbet (naturel) et le chesbet artificiel. L'analyse
des verres bleus qui constituent ce dernier, aussi bien que celle des peintures
enlev&eacute;es aux monuments, ont &eacute;tabli que la plupart &eacute;taient
color&eacute;s par un sel de cuivre. Quelques-uns le sont par du cobalt,
comme l'indique l'histoire de la chimie de Hoefer, et comme le montre l'analyse
des perles &eacute;gyptiennes faite par M Clemmer. Ce r&eacute;sultat est
conforme aux faits reconnus par Davy pour les verres grecs et romains.
Th&eacute;ophraste semble m&ecirc;me parler explicitement du bleu de cobalt,
sous le nom de bleu m&acirc;le, oppos&eacute; au bleu femelle. Th&eacute;ophraste
distingue &eacute;galement le cyanos autophy&egrave;s, ou bleu naturel,
venu de Scythie (lapis-lazuli) et le cyanos sceuastos, ou imitation, fabriqu&eacute;e
depuis l'&eacute;poque d'un ancien roi d'&eacute;gypte, et obtenue en colorant
une masse de verre avec un minerai de cuivre pris en petite quantit&eacute;.
Le bleu imit&eacute; devait pouvoir r&eacute;sister au feu; tandis que
le bleu non chauff&eacute; apyros, c'est-&agrave;-dire le sulfate de cuivre
naturel, ou plut&ocirc;t l'azurite, n'&eacute;tait pas durable. Vitruve
donne encore le proc&eacute;d&eacute; de fabrication du bleu d'Alexandrie,
au moyen du sable, du natron et de la limaille de cuivre, mis en p&acirc;te,
puis vitrifi&eacute;s au feu: recette qui se trouve dans les alchimistes
grecs, ainsi que le montrent nos citations d'Olympiodore. On rencontre
ici plusieurs notions capitales au point de vue qui nous occupe. D'abord
l'assimilation d'une mati&egrave;re color&eacute;e, pierre pr&eacute;cieuse,
&eacute;mail, couleur vitrifi&eacute;e, avec les m&eacute;taux; les uns
et les autres se trouvant compris sous une m&ecirc;me d&eacute;signation
g&eacute;n&eacute;rale. Cette assimilation, qui nous para&icirc;t &eacute;trange,
s'explique &agrave; la fois par l'&eacute;clat et la raret&eacute; qui
caract&eacute;rise les deux ordres de substances, et aussi par ce fait
que leur pr&eacute;paration &eacute;tait &eacute;galement effectu&eacute;e
au moyen du feu, &agrave; l'aide d'op&eacute;rations de voie s&egrave;che,
accomplies sans doute par les m&ecirc;mes ouvriers.
<p>&nbsp;&nbsp;&nbsp; Remarquons &eacute;galement l'imitation d'un min&eacute;ral
naturel par l'art, qui met en regard le produit naturel et le produit artificiel
: cette imitation offre des degr&eacute;s in&eacute;gaux dans les qualit&eacute;s
et la perfection du produit. Enfin nous y apercevons une nouvelle notion,
celle de la teinture; car l'imitation du saphir naturel repose sur la coloration
d'une grande masse, incolore par elle-m&ecirc;me, mais constituant le fond
vitrifiable, que l'on teint &agrave; l'aide d'une petite quantit&eacute;
de substance color&eacute;e. Avec les &eacute;maux et les verres color&eacute;s
ainsi pr&eacute;par&eacute;s, on reproduisait les pierres pr&eacute;cieuses
naturelles; on recouvrait des figures, des objets en terre ou en pierre
; on incrustait les objets m&eacute;talliques. Nous reviendrons sur toutes
ces circonstances, qui se retrouvent parall&egrave;lement dans l'histoire
du mafek.
<p><b>6 - L'Emeraude ou Mafek.</b>
<p>&nbsp;&nbsp;&nbsp; Le mafek, ou min&eacute;ral vert, d&eacute;signe
l'&eacute;meraude, le jaspe vert, l'&eacute;mail vert, les cendres vertes,
le verre de couleur verte, etc. Il est figur&eacute; dans les tombeaux
de Th&egrave;bes, en monceaux pr&eacute;cieux, mis en tas avec l'or, l'argent,
le chesbet; par exemple, dans le tr&eacute;sor de Rams&egrave;s III. Les
&eacute;gyptologues ont agit&eacute; la question de savoir si ce nom ne
d&eacute;signait pas le cuivre; comme Champollion l'avait pens&eacute;
d'abord, opinion que Lepsius rejette. Je la cite, non pour intervenir dans
la question, mais comme une nouvelle preuve de la parent&eacute; &eacute;troite
du mafek avec les m&eacute;taux. La confusion est d'autant plus ais&eacute;e,
que le cuivre est, nous le savons, le g&eacute;n&eacute;rateur d'un grand
nombre de mati&egrave;res bleues et vertes. De m&ecirc;me que pour le chesbet,
il y a un mafek vrai, qui est l'&eacute;meraude ou la malachite, et un
mafek artificiel, qui repr&eacute;sente les &eacute;maux et les verres
color&eacute;s. La couleur verte des tombeaux et des sarcophages est form&eacute;e
par la poussi&egrave;re d'une mati&egrave;re vitrifi&eacute;e &agrave;
base de cuivre. Le vert de cuivre, malachite ou fausse &eacute;meraude
naturelle, &eacute;tait appel&eacute; en grec chrysocolle, c'est-&agrave;-dire
soudure d'or; en raison de son application &agrave; cet usage (apr&egrave;s
r&eacute;duction et production d'un alliage renfermant un peu d'or et un
cinqui&egrave;me d'argent, d'apr&egrave;s Pline). C'&eacute;tait la base
des couleurs vertes chez les anciens. Elle se trouvait, toujours suivant
Pline, dans les mines d'or et d'argent; la meilleure esp&egrave;ce existait
dans les mines de cuivre. On la fabriquait artificiellement, en faisant
couler de l'eau dans les puits de mine jusqu'au mois de juin et en laissant
s&eacute;cher pendant les mois de juin et juillet. La th&eacute;orie chimique
actuelle explique ais&eacute;ment cette pr&eacute;paration, laquelle repose
sur l'oxydation lente des sulfures m&eacute;talliques. Le nom d'&eacute;meraude
&eacute;tait appliqu&eacute; par les grecs, dans un sens aussi compr&eacute;hensif
que celui de mafek, &agrave; toute substance verte. Il comprend non seulement
le vrai b&eacute;ryl, qui se trouve souvent dans la nature en grandes masses
sans &eacute;clat; mais aussi le granit vert, employ&eacute; en ob&eacute;lisques
et sarcophages sous la vingt- sixi&egrave;me dynastie; peut-&ecirc;tre
aussi le jaspe vert. Ces min&eacute;raux ont pu servir &agrave; tailler
les grandes &eacute;meraudes de quarante coud&eacute;es de long, qui se
trouvaient dans le temple d'Ammon. C'est au contraire &agrave; une substance
vitrifi&eacute;e que se rapportent les c&eacute;l&egrave;bres plats d'&eacute;meraudes,
regard&eacute;s comme d'un prix infini, dont il est question au moment
de la chute de l'empire romain et au moyen &acirc;ge. Ainsi, dans le tr&eacute;sor
des rois goths, en Espagne, les arabes trouv&egrave;rent une table d'&eacute;meraude,
entour&eacute;e de trois rangs de perles et soutenue par 360 pieds d'or
: ceci rappelle les descriptions des mille et une nuits . On a cit&eacute;
souvent le grand plat d'&eacute;meraude, le Sacro Catino, pill&eacute;
par les crois&eacute;s &agrave; la prise de C&eacute;sar&eacute;e, en Palestine,
en 1101, et que l'on montre encore aux touristes dans la sacristie de la
cath&eacute;drale de G&ecirc;nes. Il a toute une l&eacute;gende. On pr&eacute;tendait
qu'il avait &eacute;t&eacute; apport&eacute; &agrave; Salomon par la reine
de Saba. J&eacute;sus-Christ aurait mang&eacute; dans ce plat l'agneau
pascal avec ses disciples. On crut longtemps que c'&eacute;tait une v&eacute;ritable
&eacute;meraude; mais des doutes s'&eacute;lev&egrave;rent au XVIIIe si&egrave;cle.
La condamine avait d&eacute;j&agrave; essay&eacute; de s'en assurer par
artifice, au grand scandale des pr&ecirc;tres qui montraient ce monument
v&eacute;n&eacute;rable. Il fut transport&eacute;, en 1809, &agrave; Paris,
o&ugrave; l'on a constat&eacute; que c'&eacute;tait simplement un verre
color&eacute;, et il retourna, en 1815, &agrave; G&ecirc;nes, o&ugrave;
il est encore. La valeur attribu&eacute;e &agrave; de tels objets et leur
raret&eacute; s'expliquent, si l'on observe que la fabrication du verre
color&eacute; en vert, op&eacute;ration difficile et co&ucirc;teuse, para&icirc;t
avoir &eacute;t&eacute; abandonn&eacute;e sous les grecs et les romains.
Pline ne parle pas de ce genre de vitrification, qui &eacute;tait certainement
en usage dans l'ancienne &eacute;gypte, d'apr&egrave;s l'examen microscopique
des couleurs employ&eacute;es sur les monuments. Cependant nous trouvons
parmi les recettes des manuscrits alchimiques un petit trait&eacute; sur
la fabrication des verres, o&ugrave; il est question, &agrave; c&ocirc;t&eacute;
du verre bleu, du verre venetum , c'est-&agrave;-dire vert p&acirc;le.
La confusion entre une s&eacute;rie fort diverse de substances de couleur
verte explique aussi la particularit&eacute; signal&eacute;e par Th&eacute;ophraste,
d'apr&egrave;s lequel l'&eacute;meraude communiquerait sa couleur &agrave;
l'eau, tant&ocirc;t plus, tant&ocirc;t moins, et serait utile pour les
maladies des yeux. Il s'agit &eacute;videmment de sels basiques de cuivre,
en partie solubles et pouvant jouer le r&ocirc;le de collyre. Les d&eacute;tails
qui pr&eacute;c&egrave;dent montrent de nouveau une m&ecirc;me d&eacute;nomination
appliqu&eacute;e &agrave; un grand nombre de substances diff&eacute;rentes,
assimil&eacute;es d'ailleurs aux m&eacute;taux: les unes naturelles, ou
susceptibles parfois d'&ecirc;tre produites dans les mines, en y provoquant
certaines transformations lentes, telle est la malachite; d'autres sont
purement artificielles. On con&ccedil;oit d&egrave;s lors le vague et la
confusion des id&eacute;es des anciens, ainsi que l'esp&eacute;rance que
l'on pouvait avoir de proc&eacute;der &agrave; une imitation de plus en
plus parfaite des substances min&eacute;rales et des m&eacute;taux, par
l'art aid&eacute; du concours du temps et des actions naturelles.
<p><b>7 - l'Airain et le Cuivre.</b>
<p>&nbsp;&nbsp;&nbsp; Apr&egrave;s le chesbet et le mafek, la liste des
m&eacute;taux &eacute;gyptiens se poursuit par un vrai m&eacute;tal, le
chomt, nom traduit, d apr&egrave;s Lepsius, par cuivre, bronze, airain,
et qui se reconna&icirc;t &agrave; sa couleur rouge sur les monuments.
Champollion traduisait le m&ecirc;me mot par fer. Cette confusion entre
l'airain et le fer est ancienne. D&eacute;j&agrave; le mot latin Oes, airain,
r&eacute;pond au sanscrit Ayas, qui signifie le fer. Ici encore les &eacute;gyptiens
comprenaient sous une m&ecirc;me domination un m&eacute;tal pur, le cuivre,
et ses alliages, obtenus plus facilement que lui par les traitements m&eacute;tallurgiques
des minerais. Le cuivre pur, en effet, s'est rencontr&eacute; rarement
autrefois, bien qu'il existe &agrave; l'&eacute;tat natif: par exemple,
dans les d&eacute;p&ocirc;ts du lac sup&eacute;rieur en Am&eacute;rique
; et bien qu'il puisse &ecirc;tre r&eacute;duit de certains minerais &agrave;
l'&eacute;tat pur. Mais il se pr&ecirc;te mal &agrave; la fonte. Dans la
plupart des cas, la r&eacute;duction s'op&egrave;re plus ais&eacute;ment
sur des m&eacute;langes renfermant &agrave; la fois le cuivre et l'&eacute;tain
bronzes, parfois aussi le plomb ( molybdochalque des anciens), et le zinc
orichalque, laitons , en diverses proportions relatives. De l&agrave; r&eacute;sultent
des alliages plus fusibles et dou&eacute;s de propri&eacute;t&eacute;s
particuli&egrave;res, qui constituent sp&eacute;cialement l'airain des
anciens, le bronze des modernes. Le chomt est repr&eacute;sent&eacute;
sur les monuments &eacute;gyptiens en grosses plaques, en parall&eacute;lipip&egrave;des
fondus (briques) et en fragments bruts, non purifi&eacute;s par la fusion.
Les mus&eacute;es renferment des miroirs de bronze (alliage de cuivre et
d'&eacute;tain), des serrures, clefs, cuillers, clous, poignards, haches,
couteaux, coupes et objets de toute nature en bronze. Vauquelin en a publi&eacute;
des analyses, o&ugrave; il signale un septi&egrave;me d'&eacute;tain. J'ai
eu occasion d'ex&eacute;cuter moi-m&ecirc;me, pour Mariette, quelques analyses
de miroirs se rapprochant encore davantage de la composition du bronze
le plus parfait (un dixi&egrave;me d'&eacute;tain). Ici vient se ranger
l'orichalque , mot qui semble avoir repr&eacute;sent&eacute; chez les grecs
tous les alliages m&eacute;talliques jaunes rappelant l'or par leur brillant.
Il a d'abord &eacute;t&eacute; employ&eacute; par H&eacute;siode et par
Platon. Ce dernier parle dans son atlantide d'un m&eacute;tal pr&eacute;cieux,
devenu mythique plus tard pour Aristote, et que, d'apr&egrave;s Pline,
on ne rencontrait plus de son temps dans la nature. Cependant le mot se
retrouve, &agrave; l'&eacute;poque de l'empire romain et dans les trait&eacute;s
des alchimistes grecs, pour exprimer le laiton, l'alliage des cymbales
et divers autres. Il est venu jusqu'&agrave; nous dans la d&eacute;nomination
d&eacute;figur&eacute;e de fil d'archal. Telle est la variabilit&eacute;
ind&eacute;finie de propri&eacute;t&eacute;s des mati&egrave;res d&eacute;sign&eacute;es
autrefois sous un seul et m&ecirc;me nom. Ce sont, je le r&eacute;p&egrave;te,
des circonstances qu'il importe de ne pas oublier, si l'on veut comprendre
les id&eacute;es des anciens, en se pla&ccedil;ant dans le m&ecirc;me ensemble
d'habitudes et de faits pratiques. Les nombreux alliages que l'on sait
fabriquer avec le cuivre, la facilit&eacute; avec laquelle on en fait varier
&agrave; volont&eacute; la duret&eacute;, la tenacit&eacute;, la couleur,
&eacute;taient particuli&egrave;rement propres &agrave; faire na&icirc;tre
l'esp&eacute;rance de transformer le cuivre en or. De l&agrave;, ces recettes
pour obtenir un bronze couleur d'or, inscrites dans les papyrus de Leide
et dans nos manuscrits. On raconte aussi que l'on trouva dans le tr&eacute;sor
des rois de Perse un alliage semblable &agrave; l'or, qu'aucun proc&eacute;d&eacute;
d'analyse, sauf l'odeur, ne permettait d'en distinguer. L odeur propre
de ces alliages, pareille &agrave; celle des m&eacute;taux primitifs, avait
frapp&eacute; les op&eacute;rateurs. Nous trouvons aussi dans une vieille
recette de diplosis, o&ugrave; il est question d'un m&eacute;tal artificiel,
ces mots: "La teinture le rend brillant et inodore . Ainsi il semblait
aux m&eacute;tallurgistes du temps qu'il n'y e&ucirc;t qu'un pas &agrave;
faire, un tour de main &agrave; r&eacute;aliser, une ou deux propri&eacute;t&eacute;s
&agrave; modifier pour obtenir la transmutation compl&egrave;te et la fabrication
artificielle de l or et de l'argent".
<p><b>8 - Le Fer.</b>
<p>&nbsp;&nbsp;&nbsp; Apr&egrave;s le chomt, vient le men, plus tard tehset,
que M Lepsius traduit par fer. Il y a quelque incertitude sur cette interpr&eacute;tation,
le nom du fer ne paraissant pas sur les monuments vis-&agrave;-vis des
figures des objets qui semblent form&eacute;s par ce m&eacute;tal. Il semble
que ce soit l&agrave; une preuve d'un caract&egrave;re r&eacute;cent. Le
fer, en effet, est rare et relativement moderne dans les tombeaux &eacute;gyptiens.
Les peintures de l'ancien empire ne fournissent pas d'exemple d'armes peintes
en bleu (fer), mais toujours en rouge ou brun clair (airain). &agrave;
l'origine, on se bornait &agrave; recouvrir les casques et les cuirasses
de cuir avec des lames et des bagues de fer; ce qui montre la raret&eacute;
originelle du fer. Tout ceci n'a rien de surprenant. On sait que la pr&eacute;paration
du fer, sa fusion, son travail sont beaucoup plus difficiles que ceux des
autres m&eacute;taux. Aussi est-il venu le dernier dans le monde, o&ugrave;
il a &eacute;t&eacute; connu d'abord sous la forme de fer m&eacute;t&eacute;orique.
L'&acirc;ge de fer succ&egrave;de aux autres, dans les r&eacute;cits des
po&egrave;tes. L'usage du fer fut d&eacute;couvert apr&egrave;s celui des
autres m&eacute;taux, dit Isidore De S&eacute;ville. On connut l'airain
avant le fer, d'apr&egrave;s Lucr&egrave;ce. Les massag&egrave;tes ne connaissaient
pas le fer, suivant H&eacute;rodote; les mexicains et les p&eacute;ruviens
non plus, avant l'arriv&eacute;e des espagnols. Les opinions que je viens
d'exposer sur l'origine r&eacute;cente du fer en &eacute;gypte sont les
plus accr&eacute;dit&eacute;es. Cependant je dois dire que M Maspero ne
les partage pas. Il pense qu'il existe des indices peu douteux de l'emploi
des outils de fer dans la construction des pyramides et il a m&ecirc;me
trouv&eacute; du fer m&eacute;tallique dans la ma&ccedil;onnerie de ces
&eacute;difices.
<p><b>9 - Le Plomb.</b>
<p>&nbsp;&nbsp;&nbsp; Le taht ou plomb, le plus vulgaire de tous, termine
la liste des m&eacute;taux figur&eacute;s par les &eacute;gyptiens. On
doit entendre sous ce nom, non seulement le plomb pur, mais aussi certains
de ses alliages. D'apr&egrave;s les alchimistes grecs, tels que le pseudo-D&eacute;mocrite,
le plomb &eacute;tait le g&eacute;n&eacute;rateur des autres m&eacute;taux
; c'&eacute;tait lui qui servait &agrave; produire, par l'interm&eacute;diaire
de l'un de ses d&eacute;riv&eacute;s, appel&eacute; magn&eacute;sie par
les auteurs, les trois autres corps m&eacute;talliques cong&eacute;n&egrave;res,
&agrave; savoir le cuivre, l'&eacute;tain et le fer. Avec le plomb, on
fabriquait aussi l'argent. Cette id&eacute;e devait para&icirc;tre toute
naturelle aux m&eacute;tallurgistes d'autrefois, qui retiraient l'argent
du plomb argentif&egrave;re par coupellation.
<p><b>10 - L'Etain.</b>
<p>&nbsp;&nbsp;&nbsp; L'&eacute;tain, circonstance singuli&egrave;re, ne
figure pas dans la liste de Lepsius, bien qu'il entre dans la composition
du bronze des vieux &eacute;gyptiens. Peut-&ecirc;tre ne savaient-ils pas
le pr&eacute;parer &agrave; l'&eacute;tat isol&eacute;. Il n'a &eacute;t&eacute;
connu &agrave; l'&eacute;tat de puret&eacute; que plus tard, &agrave; l'&eacute;poque
des grecs et des romains. Mais il &eacute;tait d'usage courant au temps
des alchimistes, comme en t&eacute;moignent les recettes des papyrus de
Leide. C'&eacute;tait l'une des mati&egrave;res fondamentales employ&eacute;es
pour la pr&eacute;tendue fabrication ou transmulation de l'argent, dans
ces papyrus, comme dans nos manuscrits. C est pourquoi il convient de parler
ici du cassiteros antique, mot dont le sens a chang&eacute;, comme celui
de l'airain, avec le cours des temps. &agrave; l'origine, dans Hom&egrave;re
par exemple, il semble que le cassiteros fut un alliage d'argent et de
plomb, alliage qui se produit ais&eacute;ment pendant le traitement des
minerais de plomb. Plus tard, le m&ecirc;me nom fut appliqu&eacute; &agrave;
l'&eacute;tain, ainsi qu'&agrave; ses alliages plombif&egrave;res. De m&ecirc;me,
en h&eacute;breu, b&eacute;dil signifie tant&ocirc;t l'&eacute;tain, tant&ocirc;t
le plomb, ou plut&ocirc;t certains de ses alliages. L'&eacute;tain lui-m&ecirc;me
a &eacute;t&eacute; regard&eacute; d'abord comme une sorte de doublet du
plomb; c' &eacute;tait le plomb blanc ou argentin, oppos&eacute; au plomb
noir ou plomb proprement dit (Pline). Son &eacute;clat, sa r&eacute;sistance
&agrave; l'eau et &agrave; l'air, ses propri&eacute;t&eacute;s, interm&eacute;diaires
en quelque sorte entre celles du plomb et celles de l'argent, toutes ces
circonstances nous expliquent comment les alchimistes ont pris si souvent
l'&eacute;tain comme point de d&eacute;part de leurs proc&eacute;d&eacute;s
de transmutation. Une de ses propri&eacute;t&eacute;s les plus sp&eacute;ciales,
le cri ou bruissement qu'il fait entendre lorsqu'on le plie, semblait la
premi&egrave;re propri&eacute;t&eacute; sp&eacute;cifique qu'on d&ucirc;t
s'attacher &agrave; faire dispara&icirc;tre. Geber y insiste et les alchimistes
grecs en parlent d&eacute;j&agrave;. Les alliages d'&eacute;tain, tels
que le bronze, l'orichalque (alliages de cuivre), et le claudianon (alliage
de plomb), jouaient aussi un grand r&ocirc;le autrefois. On remarquera
que les alliages ont dans l'antiquit&eacute; des noms sp&eacute;cifiques,
comme les m&eacute;taux eux-m&ecirc;mes. Rappelons encore que l'astre associ&eacute;
&agrave; l'&eacute;tain &agrave; l'origine n'&eacute;tait pas la plan&egrave;te
Jupiter, comme il est arriv&eacute; plus tard, mais la plan&egrave;te Mercure.
Les lexiques alchimiques portent la trace de cette premi&egrave;re attribution.
Le signe de Jupiter &eacute;tait assign&eacute; originairement &agrave;
l'&eacute;lectrum. Cette plan&egrave;te d'ailleurs, ou plut&ocirc;t son
signe, para&icirc;t avoir poss&eacute;d&eacute; &agrave; un certain moment
une signification g&eacute;n&eacute;rique; car ce dernier est adjoint comme
signe auxiliaire &agrave; celui du mercure, dans un lexique alchimique
tr&egrave;s ancien.
<p><b>11 - Le Mercure.</b>
<p>&nbsp;&nbsp;&nbsp; Le mercure, qui joue un si grand r&ocirc;le chez
les alchimistes, est ignor&eacute; dans l'ancienne &eacute;gypte. Mais
il fut connu des grecs et des romains. On distinguait m&ecirc;me le mercure
natif et le mercure pr&eacute;par&eacute; par l'art, fabriqu&eacute; en
vertu d'une distillation v&eacute;ritable, que Dioscoride d&eacute;crit.
Sa liquidit&eacute;, que le froid ne modifie pas, sa mobilit&eacute; extr&ecirc;me,
qui le faisait regarder comme vivant, son action sur les m&eacute;taux,
ses propri&eacute;t&eacute;s corrosives et v&eacute;n&eacute;meuses sont
r&eacute;sum&eacute;es par Pline en deux mots: ... etc.; liqueur &eacute;ternelle,
poison de toutes choses. Son nom primitif est vif argent, eau argent, c'est-&agrave;-dire
argent liquide. Le m&eacute;tal n'a pris le nom et le signe de mercure,
c'est-&agrave;-dire ceux du corps herm&eacute;tique par excellence, que
pendant le moyen &acirc;ge. Dans les papyrus grecs de Leide, recueillis
&agrave; Th&egrave;bes en &eacute;gypte, le nom du mercure se trouve associ&eacute;
&agrave; diverses recettes alchimiques; pr&eacute;cis&eacute;ment comme
dans nos manuscrits.
<p><b>12 - Autres Substances Cong&eacute;n&egrave;res des M&eacute;taux.</b>
<p>&nbsp;&nbsp;&nbsp; Les min&eacute;raux bleus et verts sont les seuls
qui soient inscrits en &eacute;gypte dans la liste des m&eacute;taux. Cependant
il convient de faire aussi mention d'autres pierres pr&eacute;cieuses &eacute;gyptiennes,
telles que le chenem , rubis, pierre rouge, &eacute;mail ou verre rouge
; le nesem , substance blanc clair; le tehen, topaze, jaspe jaune, &eacute;mail
ou verre jaune; soufre en copte; le hert&egrave;s , couleur blanche, quartz
laiteux; peut-&ecirc;tre aussi stuc, &eacute;mail blanc et autres corps
&eacute;quivalents au titanos, mot qui veut dire chaux en grec. Ces substances,
que nous rangerions aujourd'hui &agrave; c&ocirc;t&eacute; du mafek et
du chesbet, n'y figuraient cependant pas en &eacute;gypte : ce qui manifeste
encore la diversit&eacute; des conceptions des anciens, compar&eacute;es
aux n&ocirc;tres.
<p><b>13 - Liste Alchimique des M&eacute;taux et de leurs D&eacute;riv&eacute;s.</b>
<p>&nbsp;&nbsp;&nbsp; Pour compl&eacute;ter ce sujet et montrer l'&eacute;tendue
des rapprochements faits par les premiers alchimistes, il convient de citer
une liste des corps associ&eacute;s &agrave; chaque m&eacute;tal Ek T&ocirc;n
Metallic&ocirc;n, la liste de ses d&eacute;riv&eacute;s, dirions-nous ;
tous corps compris sous le signe fondamental du m&eacute;tal, comme on
le ferait aujourd'hui dans un trait&eacute; de chimie. Cette liste para&icirc;t
fort ancienne, car elle pr&eacute;c&egrave;de imm&eacute;diatement celle
des mois &eacute;gyptiens dans le Ms 2327 (Fol 280); elle comprend les
sept signes des m&eacute;taux, assimil&eacute;s aux sept plan&egrave;tes
; elle constate des rapprochements &eacute;tranges. A la v&eacute;rit&eacute;,
le mot plomb est suivi par celui de la litharge et du claudianon (alliage
de plomb et d'&eacute;tain), qui s'y rattachent directement, et le mot
fer par ceux de l'aimant et des pyrites. Mais, d'autre part, le signe de
l'&eacute;tain cassiteros comprend en m&ecirc;me temps le corail, toute
pierre blanche, ce qui rappelle les &eacute;maux; puis la sandaraque, le
soufre et les analogues. Sous le signe de l' or figurent, avec ce m&eacute;tal,
l'escarboucle, l'hyacinthe, le diamant, le saphir et les corps analogues
; c'est-&agrave;-dire les pierres pr&eacute;cieuses les plus brillantes
et les plus ch&egrave;res. Apr&egrave;s le signe du cuivre chalkos, on
lit la perle, l'onyx, l'am&eacute;thyste, le naphte, la poix, le sucre,
l'asphalte, le miel, la gomme ammoniaque, l'encens. Le signe de l'&eacute;meraude
comprend le jaspe, la chrysolithe, le mercure, l'ambre, l'oliban, le mastic.
La place assign&eacute;e au mercure est significative. En effet, ce m&eacute;tal
n'appara&icirc;t pas comme chef de file dans la vieille liste des m&eacute;taux
; mais il est rattach&eacute; &agrave; une rubrique ant&eacute;rieure,
celle de l'&eacute;meraude (chesbet), dont il semble avoir pris plus tard
la place dans la notation symbolique. Enfin le signe de l'argent embrasse
le verre, la terre blanche et les choses pareilles. Cette liste &eacute;tablit,
je le r&eacute;p&egrave;te, des rapprochements curieux et dont la raison
avec nos id&eacute;es actuelles est difficile &agrave; expliquer. Il semble
qu'il y ait l&agrave; l'indice de quelque tableau g&eacute;n&eacute;ral
des substances, rang&eacute;es sous un certain nombre de rubriques tir&eacute;es
des noms des m&eacute;taux; quelque chose comme les catalogues du blanc
et du jaune attribu&eacute;s &agrave; D&eacute;mocrite. Les analogies qui
ont pr&eacute;sid&eacute; &agrave; la construction de semblables classifications
sont difficiles &agrave; retrouver aujourd'hui. Cependant, rappelons-nous
que l'emploi de signes et de mots compr&eacute;hensifs a toujours exist&eacute;
en chimie. Ceux qui liront, dans quelques si&egrave;cles, le mot g&eacute;n&eacute;rique
&eacute;ther, appliqu&eacute; &agrave; des corps aussi dissemblables que
l'&eacute;ther ordinaire, le blanc de baleine, les huiles, la nitroglyc&eacute;rine,
la poudre coton, le sucre de cannes, sans conna&icirc;tre les th&eacute;ories
destin&eacute;es &agrave; grouper tous ces corps, unis sous la d&eacute;finition
d'une fonction commune, n'&eacute;prouveront-ils pas aussi quelque embarras
? Quoi qu'il en soit, on remarquera que les pierres pr&eacute;cieuses sont
jointes aux m&eacute;taux dans la vieille liste alchimique, aussi bien
que dans la liste fondamentale des anciens &eacute;gyptiens. Les noms des
m&eacute;taux y comprennent en effet le plomb, l'&eacute;tain, le fer,
l'or, le cuivre, l'&eacute;meraude, l'argent: c'est la m&ecirc;me association
que celle des m&eacute;taux &eacute;gyptiens, d'apr&egrave;s Lepsius.
<p><b>14 - Les Laboratoires.</b>
<p>&nbsp;&nbsp;&nbsp; En quels lieux et par quels proc&eacute;d&eacute;s
pr&eacute;parait-on en &eacute;gypte les m&eacute;taux et les substances
brillantes, pierres pr&eacute;cieuses artificielles et vitrifications,
qui &eacute;taient assimil&eacute;es aux m&eacute;taux ? C'est ce que nous
ne savons pas d'une mani&egrave;re pr&eacute;cise. Agatharchide nous apprend,
&agrave; la v&eacute;rit&eacute;, quels &eacute;taient les centres d'exploitation
m&eacute;tallurgique. Mais il s'agit plut&ocirc;t, dans son r&eacute;cit,
de l'extraction des minerais m&eacute;talliques et de leur traitement sur
place, que des industries chimiques proprement dites. Celles-ci paraissent
avoir &eacute;t&eacute; exerc&eacute;es en g&eacute;n&eacute;ral au voisinage
des sanctuaires de Ptah et de Serapis. Les op&eacute;rateurs qui s'occupaient
de transmutation &eacute;taient les m&ecirc;mes que ceux qui pr&eacute;paraient
les m&eacute;dicaments. L'association de ces diverses connaissances a toujours
relev&eacute; d'un m&ecirc;me syst&egrave;me g&eacute;n&eacute;ral de th&eacute;ories.
Aujourd'hui encore, les m&ecirc;mes savants cultivaient &agrave; la fois
la chimie min&eacute;rale, science des m&eacute;taux et des verres, et
la chimie organique, science des rem&egrave;des et des teintures. En &eacute;gypte
d'ailleurs, les proc&eacute;d&eacute;s chimiques de tout genre &eacute;taient
ex&eacute;cut&eacute;s, aussi bien que les traitements m&eacute;dicaux,
avec accompagnement de formules religieuses, de pri&egrave;res et d'incantations,
r&eacute;put&eacute;es essentielles au succ&egrave;s des op&eacute;rations
comme &agrave; la gu&eacute;rison des maladies. Les pr&ecirc;tres seuls
pouvaient accomplir &agrave; la fois les deux ordres de c&eacute;r&eacute;monies,
pratiques et magiques. Cependant, jusqu'&agrave; pr&eacute;sent, on n'a
pas retrouv&eacute; la trace des vieux laboratoires qui devaient &ecirc;tre
consacr&eacute;s &agrave; la fabrication des m&eacute;taux, des verres
et des pierres pr&eacute;cieuses. Le seul indice que l'on en connaisse
est d&ucirc; &agrave; une observation de M Maspero, dont il a bien voulu
me confier le d&eacute;tail. La d&eacute;couverte a &eacute;t&eacute; faite
par des indig&egrave;nes, &agrave; Drongah, &agrave; une demi-heure de
marche au S-S-O de Siout, au pied de la montagne, dans un cimeti&egrave;re
musulman, &eacute;tabli au milieu de l'un des quartiers de l'ancienne n&eacute;cropole.
Dans une fouille faite pour chercher de l'or, et poursuivie jusqu'au sein
de la roche m&ecirc;me, on tomba sur une sorte de puits d'&eacute;boulement
; on rencontra au fond, &agrave; une profondeur de 12 &agrave; 13 m&egrave;tres,
une chambre fun&eacute;raire, appartenant &agrave; une s&eacute;pulture
profonde et d&eacute;j&agrave; viol&eacute;e. L&agrave; on p&eacute;n&eacute;tra
dans une chambre ayant servi de laboratoire, et dont les parois &eacute;taient
enfum&eacute;es. On y trouva les objets suivants: un fourneau en bronze
; une porte en bronze, de 0 m 35 de hauteur, provenant d'un four plus grand
; environ cinquante vases de bronze munis d'un bec en rigole non ferm&eacute;e,
chacun dans une sorte de c&ocirc;ne tronqu&eacute;, aussi en bronze, et
dont l'orifice sup&eacute;rieur &eacute;tait plus large. Ce c&ocirc;ne
rappelle nos bains de sable; mais l'usage des vases eux m&ecirc;mes est
inconnu. Il y avait aussi plusieurs cuvettes d'alb&acirc;tre; un vase arrondi,
provenant de l'ancien empire, en diorite ou jaspe vert; des cuillers en
alb&acirc;tre; des objets en or &agrave; bas titre, pesant 96 dirhems,
compos&eacute;s de morceaux ayant l'apparence de rubans en larges feuilles
enroul&eacute;es; ainsi qu'un masque de momie, fauss&eacute; et pli&eacute;.
Ces objets d'or offraient l'aspect d'objets pill&eacute;s et pr&eacute;par&eacute;s
pour la fonte. Le tout semble constituer un atelier du VIe au VIIe si&egrave;cle
de notre &egrave;re, ayant appartenu &agrave; un faux-monnayeur ou &agrave;
un alchimiste: c'&eacute;tait alors &agrave; peu pr&egrave;s la m&ecirc;me
chose. Dans un coin de la chambre, on aper&ccedil;ut une terre grasse et
noir&acirc;tre que les assistants s'empress&egrave;rent d'emporter, disant
qu'ils allaient s'en servir pour blanchir le cuivre: en d'autres termes,
ils la regardaient comme de la poudre de projection, susceptible de changer
le cuivre en argent. On voit par ce pr&eacute;jug&eacute; que la tradition
secr&egrave;te de l'alchimie n'est pas encore perdue dans l'&eacute;gypte
moderne. La teinture des m&eacute;taux. Ainsi les &eacute;gyptiens r&eacute;unissaient
dans une m&ecirc;me liste et dans un m&ecirc;me groupe les m&eacute;taux
vrais, leurs alliages et certains min&eacute;raux color&eacute;s ou brillants,
les uns naturels, les autres artificiels. Les m&ecirc;mes ouvriers traitaient
les uns et les autres par les proc&eacute;d&eacute;s de la cuisson, c'est-&agrave;-dire
de la voie s&egrave;che. Les industries du verre, des &eacute;maux, des
alliages &eacute;taient tr&egrave;s d&eacute;velopp&eacute;es en &eacute;gypte
et en Assyrie, comme le montrent les r&eacute;cits des anciens et l'examen
des d&eacute;bris de leurs monuments. Cette assimilation entre les m&eacute;taux
et les pierres pr&eacute;cieuses reposait &agrave; la fois sur les pratiques
industrielles et sur les propri&eacute;t&eacute;s m&ecirc;mes des corps.
Elle para&icirc;t tirer son origine de l'&eacute;clat de la couleur, de
l'inalt&eacute;rabilit&eacute;, communes &agrave; ces diverses substances.
Les noms m&ecirc;mes de certains m&eacute;taux en grec et en latin, tels
que l'&eacute;lectros, c'est-&agrave;-dire le brillant; l'argent appel&eacute;
argyrion, c'est-&agrave;-dire le blanc, en h&eacute;breu le p&acirc;le
; le nom de l'or, qui est aussi dit le brillant en h&eacute;breu, rappellent
l'aspect sous lequel les m&eacute;taux rares apparaissent d'abord aux hommes
et excitent leur avidit&eacute;. Dans la fusion accidentelle des minerais
: produite au moment de l'incendie des for&ecirc;ts: "Ils les voyaient
se solidifier &agrave; terre avec une couleur brillante et les emportaient,
s&eacute;duits par leur &eacute;clat". On les trouvait aussi dans le lit
des rivi&egrave;res, associ&eacute;s aux pierres pr&eacute;cieuses. Les
&eacute;gyptiens n'avaient, pas plus que les anciens en g&eacute;n&eacute;ral,
cette notion d'esp&egrave;ces d&eacute;finies, de corps dou&eacute;s de
propri&eacute;t&eacute;s invariables, qui caract&eacute;rise la science
actuelle; une telle notion ne remonte pas au del&agrave; du si&egrave;cle
pr&eacute;sent en chimie. De l&agrave; la signification multiple et variable
des noms de substances employ&eacute;s dans le monde antique. Ceci &eacute;tant
admis, ainsi que la possibilit&eacute; d'imiter plus ou moins parfaitement
certains corps, d'apr&egrave;s les exp&eacute;riences courantes sur les
mati&egrave;res vitreuses et les alliages, on &eacute;tendait cette possibilit&eacute;
&agrave; toutes, par une induction l&eacute;gitime en apparence. Les extractions
de la plupart des m&eacute;taux et les reproductions effectives des verres
et des alliages ayant lieu en g&eacute;n&eacute;ral par l'action du feu,
&agrave; la suite de pulv&eacute;risations, fusions, calcinations, coctions
plus ou moins prolong&eacute;es on con&ccedil;oit qu'on ait essay&eacute;
d'op&eacute;rer de m&ecirc;me pour reproduire tous les m&eacute;taux. Ce
n'est pas tout: l'imitation des pierres pr&eacute;cieuses par les &eacute;maux
et les verres pr&eacute;sente des degr&eacute;s fort divers. De m&ecirc;me,
les alliages varient dans leurs propri&eacute;t&eacute;s et sont plus ou
moins ressemblants aux vrais m&eacute;taux. Nous avons vu qu'il en &eacute;tait
ainsi pour l'airain, qui a fini par devenir notre cuivre, mais qui signifiait
aussi le bronze; pour le cassiteros, qui a fini par devenir notre &eacute;tain,
mais qui signifiait aussi le laiton et les alliages plombif&egrave;res.
On con&ccedil;oit d&egrave;s lors l'origine de cette notion des m&eacute;taux
imparfaits et artificiels, poss&eacute;dant la couleur, la duret&eacute;,
un certain nombre des propri&eacute;t&eacute;s des m&eacute;taux naturels
parfaits, sans y atteindre compl&egrave;tement. Ainsi la fabrication du
bronze couleur d'or figure dans les papyrus de Leide, aussi bien que dans
nos manuscrits. Il s'agissait de compl&eacute;ter ces imitations pour faire
du vrai or, du vrai argent, poss&eacute;dant toutes leurs propri&eacute;t&eacute;s
sp&eacute;cifiques, de l'or naturel, comme dit Proclus. La pr&eacute;tention
de doubler la proportion de l'or (ou celle de l'argent), en l'associant
&agrave; un autre m&eacute;tal diplosis, par des proc&eacute;d&eacute;s
dont il est question &agrave; la fois dans les papyrus de Leide, dans Manilius,
et dans nos manuscrits; cette pr&eacute;tention, dis-je, implique l'id&eacute;e
que l'or et l'argent &eacute;taient des alliages, alliages qu'il &eacute;tait
possible de reproduire et de multiplier, en d&eacute;veloppant dans les
m&eacute;langes une m&eacute;tamorphose analogue &agrave; la fermentation
et &agrave; la g&eacute;n&eacute;ration. On croyait pouvoir en m&ecirc;me
temps, par des tours de main convenables, modifier &agrave; volont&eacute;
les propri&eacute;t&eacute;s de ces alliages. De telles modifications sont
en effet susceptibles de se produire dans la pratique m&eacute;tallurgique,
&agrave; l'aide de la trempe et par l'addition de certains ingr&eacute;dients
en petites quantit&eacute;s, comme le montre la fabrication des bronzes
et des aciers. Cette recherche &eacute;tait encourag&eacute;e par des th&eacute;ories
philosophiques plus profondes. C'est ici le lieu de rappeler les paroles
de Bacon: "En observant toutes les qualit&eacute;s de l'or, on trouve qu'il
est de couleur jaune, fort pesant et d'une telle pesanteur sp&eacute;cifique,
mall&eacute;able et ductile &agrave; tel degr&eacute;, etc..., et celui
qui conna&icirc;tra les formules et les proc&eacute;d&eacute;s n&eacute;cessaires
pour produire &agrave; volont&eacute; la couleur jaune, la grande pesanteur
sp&eacute;cifique, la ductilit&eacute;, etc.; celui qui conna&icirc;tra
ensuite les moyens de produire ces qualit&eacute;s &agrave; diff&eacute;rents
degr&eacute;s, verra les moyens et pourra prendre les mesures n&eacute;cessaires
pour r&eacute;unir ces qualit&eacute;s dans tel ou tel corps: d'o&ugrave;
r&eacute;sultera sa transmutation en or". Les &eacute;gyptiens opposent
continuellement la substance naturelle et la substance produite par l'art
: pr&eacute;cis&eacute;ment comme il arrive dans les synth&egrave;ses de
la chimie organique de nos jours, o&ugrave; l'identit&eacute; des deux
ordres de mati&egrave;res exige constamment une d&eacute;monstration sp&eacute;ciale.
L'id&eacute;e principale des alchimistes grecs, dans les livres qu'ils
nous ont laiss&eacute;s, c'est de modifier les propri&eacute;t&eacute;s
des m&eacute;taux par des traitements convenables, pour les teindre en
or et en argent; et cela, non superficiellement &agrave; la fa&ccedil;on
des peintres, mais d'une fa&ccedil;on intime et compl&egrave;te. Ils &eacute;taient
guid&eacute;s dans cette recherche par les pratiques de leur temps. Les
pratiques pour teindre les &eacute;toffes et les verres en pourpre, pour
colorer le bronze en or et pour op&eacute;rer la transmutation, sont en
effet rapproch&eacute;es dans les papyrus de Leide, aussi bien que dans
le pseudo-D&eacute;mocrite. Suivant les alchimistes grecs, la science sacr&eacute;e
comprend deux op&eacute;rations fondamentales: la xanthosis, ou art de
teindre en jaune, et la leucosis ou art de teindre en blanc; les auteurs
de nos manuscrits reviennent sans cesse sur ce sujet. Quelques-uns y joignent
m&ecirc;me la m&eacute;lanosis, ou art de teindre en noir, et l'iosis ou
art de teindre en violet. "L'art tinctorial, dit p&eacute;lage, n'a-t-il
pas &eacute;t&eacute; invent&eacute; pour faire une teinture qui est le
but de tout l'art?" D'apr&egrave;s le m&ecirc;me p&eacute;lage, les deux
teintures ne diff&egrave;rent en rien, si ce n'est par la couleur; la pr&eacute;paration
en est la m&ecirc;me, c'est-&agrave;-dire qu'il n'existe qu'une pierre
philosophale. "C'est l'eau &agrave; deux couleurs, pour le blanc et pour
le jaune" . St&eacute;phanus dit pareillement: il y a plusieurs teintures,
l'une pour le cuivre, l'autre pour l'argent, l'autre pour l'or, selon la
diversit&eacute; des m&eacute;taux; mais elles ne forment qu'une esp&egrave;ce.
Nous poss&eacute;dons sous le nom de D&eacute;mocrite, le double catalogue
des esp&egrave;ces agissant sur l'or et l'argent et susceptibles d'&ecirc;tre
blanchies, c'est-&agrave;-dire teintes en argent; ou bien jaunies, c'est-&agrave;-dire
teintes en or; puis de jouer le r&ocirc;le de mati&egrave;res tinctoriales
vis &agrave; vis des m&eacute;taux. Dans la biblioth&egrave;que des philosophes
chimiques de Salmon, ouvrage publi&eacute; &agrave; la fin du XVIIe si&egrave;cle
et qui repr&eacute;sente la science des alchimistes apr&egrave;s quinze
si&egrave;cles de culture, la pierre philosophale est d&eacute;fini: "La
m&eacute;decine universelle pour tous les m&eacute;taux imparfaits, qui
fixe ce qu'ils ont de volatil, purifie ce qu'ils ont d'impur, et leur donne
une teinture et un &eacute;clat plus brillants que dans la nature ". Cette
id&eacute;e d'une teinture, d'un principe colorant, d'une poudre de projection
xerion dou&eacute;e d'un pouvoir tinctorial consid&eacute;rable, &eacute;tait
conforme en effet aux analogies tir&eacute;es de la teinture des &eacute;toffes,
de celle des &eacute;maux et mati&egrave;res vitreuses. "La pourpre royale
est extraite de l'orcanette (anchusa) et de l'orseille (phycos). On teint
en jaune, apr&egrave;s avoir teint en blanc, dans la teinture de l'or,
de la soie, des peaux. Avant de teindre en pourpre, il faut blanchir d'abord
". On voit comment les alchimistes &eacute;taient &agrave; la fois guid&eacute;s
et &eacute;gar&eacute;s par les comparaisons emprunt&eacute;es aux fabrications
industrielles. De m&ecirc;me une trace de cuivre, c'est-&agrave;-dire une
seule et m&ecirc;me mati&egrave;re colorante, peut teindre le verre en
bleu ou en vert, suivant la nature des compositions et d'apr&egrave;s des
recettes d&eacute;j&agrave; connues des anciens.
<p>&nbsp;&nbsp;&nbsp; Ils trouvaient une confirmation de ces id&eacute;es
dans certaines observations des alchimistes, relatives &agrave; la teinture
des m&eacute;taux; car il est, disent-ils, des agents qui blanchissent
V&eacute;nus (tel le mercure qui blanchit le cuivre); mais c'est l&agrave;
une teinture imparfaite et qui ne r&eacute;siste pas au feu. D'autres agents
(le soufre, l'arsenic et leurs compos&eacute;s) jaunissent la lune, c'est-&agrave;-dire
l'argent; mais c'est encore l&agrave; une imitation imparfaite. On distinguait
donc pour les m&eacute;taux, comme pour les &eacute;toffes et les verres,
les proc&eacute;d&eacute;s propres &agrave; les teindre &agrave; fond et
les proc&eacute;d&eacute;s propres &agrave; les teindre superficiellement.
Ainsi pour dorer le cuivre ou l'argent, c'est-&agrave;-dire pour teindre
ces m&eacute;taux &agrave; la surface, on employait la dorure par amalgamation,
d&eacute;j&agrave; connue de Vitruve; ou bien on op&eacute;rait au moyen
d'un alliage d'or et de plomb. Au contraire, les proc&eacute;d&eacute;s
pour teindre les m&eacute;taux &agrave; fond, dans leur masse et leur essence
intime en quelque sorte, proc&eacute;d&eacute;s cong&eacute;n&egrave;res
de la formation des alliages, tels que le bronze et le laiton, &eacute;taient
r&eacute;put&eacute;s plus myst&eacute;rieux. Le nom m&ecirc;me d'orpiment
Auri Pigmentum, qui d&eacute;signe aujourd'hui le sulfure d'arsenic, mais
qui avait une signification plus confuse pour les anciens, rappelle la
teinture de l'or. Ces analogies expliquent &eacute;galement pourquoi D&eacute;mocrite,
auteur d'ouvrages sur la teinture des verres et sur la teinture en pourpre,
a &eacute;t&eacute; regard&eacute; plus tard comme l'inventeur de la teinture
des m&eacute;taux. Parmi les ouvrages que nous poss&eacute;dons, les m&ecirc;mes
trait&eacute;s s'occupent &agrave; la fois de la teinture des m&eacute;taux,
de celle des verres et de celle des &eacute;toffes. On voit comment l'id&eacute;e
de la fabrication m&ecirc;me des m&eacute;taux et celle de la transmutation
ont d&eacute;coul&eacute; des industries et des id&eacute;es &eacute;gyptiennes,
relatives &agrave; la pr&eacute;paration des m&eacute;taux, des alliages,
des &eacute;maux, des verres et des &eacute;toffes color&eacute;es. C'est
m&ecirc;me l&agrave; ce qu'il y ait de plus clair dans les descriptions
techniques des manuscrits. Ce n'en est pas moins une chose &eacute;trange
et difficile &agrave; comprendre aujourd'hui qu'un tel m&eacute;lange de
recettes r&eacute;elles et positives, pour la pr&eacute;paration des alliages
et des vitrifications, et de proc&eacute;d&eacute;s chim&eacute;riques,
pour la transmutation des m&eacute;taux. Les uns et les autres sont expos&eacute;s
au m&ecirc;me titre et souvent avec la m&ecirc;me na&iuml;vet&eacute;,
d&eacute;pouill&eacute;e de tout attirail charlatanesque, dans les papyrus
de Leide et dans certaines parties de nos manuscrits. Si les fourbes et
les imposteurs ont souvent exploit&eacute; ces croyances, il n'en est pas
moins certain qu'elles &eacute;taient sinc&egrave;res chez la plupart des
adeptes. Ici s'&eacute;l&egrave;ve une question singuli&egrave;re. Comment
cette exp&eacute;rience qui pr&eacute;tendait &agrave; un r&eacute;sultat
positif et tangible et qui &eacute;chouait toujours, en d&eacute;finitive,
a-t-elle pu rencontrer une foi si persistante et si prolong&eacute;e ?
C' est ce que l'on s'expliquerait difficilement, si l'on ne savait avec
quelle promptitude l'esprit humain embrasse tout pr&eacute;jug&eacute;
qui flatte ses esp&eacute;rances de puissance ou de richesse, et avec quelle
ardeur cr&eacute;dule il y demeure obstin&eacute;ment attach&eacute;. Les
prestiges de la magie, les pr&eacute;dictions de l'astrologie, associ&eacute;es
de tout temps &agrave; l'alchimie, ne sont pas moins chim&eacute;riques.
Cependant ce n'est que de nos jours et en Occident seulement qu'elles ont
perdu leur autorit&eacute; aux yeux des esprits cultiv&eacute;s. Encore
les spirites et les magn&eacute;tiseurs sont-ils nombreux, m&ecirc;me en
Europe. Les succ&egrave;s de l'alchimie et sa persistance se rattachent
aussi &agrave; des causes plus philosophiques. En effet l'alchimie ne consistait
pas seulement dans un certain ensemble de recettes destin&eacute;es &agrave;
enrichir les hommes; mais les savants qui l'avaient cultiv&eacute;e, au
temps des alexandrins, avaient essay&eacute; d'en faire une science v&eacute;ritable
et de la rattacher au syst&egrave;me g&eacute;n&eacute;ral des connaissances
de leur temps. Il convient donc maintenant de s'&eacute;lever plus haut
et d'examiner les th&eacute;ories par lesquelles les alchimistes justifiaient
leurs proc&eacute;d&eacute;s et dirigeaient leurs exp&eacute;riences. Ces
th&eacute;ories sont d'ordre m&eacute;taphysique: elles sont li&eacute;es
de la fa&ccedil;on la plus intime avec les id&eacute;es des anciens sur
la nature et sur la mati&egrave;re.
<center>
<p><b><font size=+1>Les Th&eacute;ories: Th&eacute;ories Grecques.</font></b></center>

<p><b>1 - Introduction.</b>
<p>&nbsp;&nbsp;&nbsp; L' alchimie n'est pas sortie uniquement et sans m&eacute;lange
du monde &eacute;gyptien. C'est apr&egrave;s la fusion de la civilisation
grecque et de la civilisation &eacute;gyptienne, &agrave; Alexandrie, et
au moment de leur dissolution finale, que nous voyons appara&icirc;tre
les premiers &eacute;crits alchimiques. On y trouve un &eacute;trange amalgame
de notions d'origine diverse. &agrave; c&ocirc;t&eacute; de descriptions
et de pr&eacute;ceptes purement empiriques, emprunt&eacute;s &agrave; la
pratique des industries chimiques dans l'antiquit&eacute;, &agrave; c&ocirc;t&eacute;
des imaginations mystiques, d'origine orientale et gnostique, que nous
avons rapport&eacute;es, on y rencontre tout un corps de doctrines philosophiques,
issues des philosophes grecs, et qui constituent &agrave; proprement parler
la th&eacute;orie de la nouvelle science. Le double aspect &agrave; la
fois positif et mystique de la chimie, la signification profonde des transformations
dont elle &eacute;tudie les lois, se montrent ici tout d'abord. Ces rapprochements
philosophiques ne sont pas arbitraires; on y est conduit par le texte m&ecirc;me
des alchimistes grecs. Non seulement ils se rattachent &agrave; D&eacute;mocrite,
en vertu d'une tradition suspecte; mais Zosime est un gnostique, impr&eacute;gn&eacute;
des id&eacute;es de Platon dont il avait &eacute;crit la vie. Les premiers
auteurs dont les noms se retrouvent dans l'histoire de leur temps, tels
que Syn&eacute;sius, Olympiodore, St&eacute;phanus, sont des philosophes
proprement dits, appartenant &agrave; l'&eacute;cole n&eacute;oplatonicienne.
Olympiodore et St&eacute;phanus citent les pythagoriciens, l'&eacute;cole
ionienne et l'&eacute;cole &eacute;l&eacute;ate, &eacute;coles qu'ils connaissaient
fort bien. Leurs scoliastes, le philosophe Chr&eacute;tien et l'Anonyme,
commentent les m&ecirc;mes sources. Les id&eacute;es de ces premiers alchimistes
ont pass&eacute; depuis aux arabes, puis aux occidentaux ; or, je le r&eacute;p&egrave;te,
elles se rattachent par des liens incontestables &agrave; celles de l'&eacute;cole
ionienne et surtout aux id&eacute;es de Platon; je donnerai tout &agrave;
l'heure sur ces deux points des preuves d&eacute;monstratives. Citons d&egrave;s
&agrave; pr&eacute;sent la lettre &eacute;crite au XIe si&egrave;cle par
Michel Psellus au patriarche Xiphilin, laquelle sert en quelque sorte de
pr&eacute;face au recueil des alchimistes grecs: "Tu veux que je te fasse
conna&icirc;tre cet art qui r&eacute;side dans le feu et les fourneaux
et qui expose la destruction des mati&egrave;res et la transmutation des
natures. Quelques-uns croient que c'est l&agrave; une connaissance d'initi&eacute;,
tenue secr&egrave;te, qu'ils n'ont pas tent&eacute; de ramener &agrave;
une forme rationnelle; ce que je regarde comme une &eacute;normit&eacute;.
Pour moi, j'ai cherch&eacute; d'abord &agrave; conna&icirc;tre les causes
et &agrave; en tirer une explication rationnelle des faits. Je l' ai cherch&eacute;e
dans la nature des quatre &eacute;l&eacute;ments, dont tout vient par combinaison
et en qui tout retourne par dissolution... j'ai vu dans ma jeunesse la
racine d'un ch&ecirc;ne chang&eacute;e en pierre, en conservant ses fibres
et toute sa structure, participant ainsi des deux natures ", c'est-&agrave;-dire
du bois et de la pierre. Ce que Psellus attribue &agrave; l'effet de la
foudre. Puis il cite, d'apr&egrave;s Strabon, les propri&eacute;t&eacute;s
d'une fontaine incrustante qui reproduisait les formes des objets immerg&eacute;s.
"Ainsi les changements de nature peuvent se faire naturellement, non en
vertu d'une incantation ou d'un miracle, ou d'une formule secr&egrave;te.
Il y a un art de la transmutation. J'ai voulu t'en exposer tous les pr&eacute;ceptes
et toutes les op&eacute;rations. La condensation et la rar&eacute;faction
des mati&egrave;res, leur coloration et leur alt&eacute;ration: ce qui
liqu&eacute;fie le verre, comment l'on fabrique le rubis, l'&eacute;meraude
; quel proc&eacute;d&eacute; naturel amollit toutes les pierres: comment
la perle se dissout et s'en va en eau; comment elle se coagule et se forme
en sph&egrave;re; quel est le proc&eacute;d&eacute; pour la blanchir ;
j'ai voulu r&eacute;duire tout cela aux pr&eacute;ceptes de l'art. Mais
comme tu ne permets pas que nous nous arr&ecirc;tions &agrave; des choses
superflues, tu veux que je me borne &agrave; expliquer par quelles mati&egrave;res
et &agrave; l'aide de quelle science on peut faire de l'or. Tu en veux
conna&icirc;tre le secret, non pour avoir de grands tr&eacute;sors, mais
pour p&eacute;n&eacute;trer dans les secrets de la nature; pareil aux anciens
philosophes, dont le prince est Platon. Il a voyag&eacute; en &eacute;gypte,
en Sicile, dans les diverses parties de la Libye, pour voir le feu de l'Etna
et les bouches du Nil et la pyramide sans ombre et les cavernes souterraines,
dont la raison fut enseign&eacute;e aux initi&eacute;s... nous te r&eacute;v&egrave;lerons
toute la sagesse de D&eacute;mocrite D'Abd&egrave;re, nous ne laisserons
rien dans le sanctuaire". Ce que les th&eacute;ologiens, (c'est-&agrave;-dire
les philosophes purs), entendent des choses divines, les physiciens (c'est-&agrave;-dire
les philosophes naturalistes), l'entendent de la mati&egrave;re, dit l'un
de nos auteurs alchimiques. C'est l'&eacute;ternelle lutte des m&eacute;taphysiciens
contre les philosophes de la nature: ils parlent souvent le m&ecirc;me
langage en apparence et emploient les m&ecirc;mes symboles, mais avec une
signification bien diff&eacute;rente. Ainsi l'alchimie &eacute;tait pour
ses adeptes une science positive et une philosophie; elle s'appuyait sur
les doctrines des sages de la Gr&egrave;ce. Pr&eacute;cisons cette filiation.
<br>&nbsp;
<p><b>2 - Les Premiers Philosophes Naturalistes.</b>
<p>&nbsp;&nbsp;&nbsp; Thal&egrave;s De Milet (vers 600 avant J-C) et l'&eacute;cole
ionienne &agrave; sa suite d&eacute;gag&egrave;rent les premiers la conception
scientifique de la nature, du langage mythique, sous lequel elle &eacute;tait
envelopp&eacute;e par le symbolisme religieux de l'Orient. D'apr&egrave;s
Thal&egrave;s, qui semble avoir tir&eacute; ses opinions des mythes babyloniens,
l'eau est la mati&egrave;re premi&egrave;re dont tout est sorti. Anaxim&egrave;ne
(Vie si&egrave;cle avant l'&egrave;re chr&eacute;tienne), guid&eacute;
par une premi&egrave;re vue des ph&eacute;nom&egrave;nes g&eacute;n&eacute;raux
de la nature, soutient de son c&ocirc;t&eacute; que l'air est le principe
des choses: rar&eacute;fi&eacute;, il devient du feu; condens&eacute;,
il forme successivement les nuages, l'eau, la terre, les pierres. A ces
notions un peu vagues, tir&eacute;es d'une premi&egrave;re vue de la nature,
succ&egrave;dent des aper&ccedil;us plus profonds. Parm&eacute;nide et
les &eacute;l&eacute;ates, cit&eacute;s par Zosime et suivis par Chym&egrave;s,
admettent la permanence de la substance primordiale. Tout se r&eacute;duit
&agrave; une essence unique, &eacute;ternelle, immobile. Les alchimistes
disent de m&ecirc;me: le tout vient du tout, voil&agrave; toute la composition.
C'est ce qu'expriment plus fortement encore les axiomes mystiques inscrits
dans les cercles concentriques du serpent: "Un est le tout, par lui le
tout est; si le tout ne contient pas le tout, il n'est pas le tout ". H&eacute;raclite
(vers l'an 500) est frapp&eacute;, au contraire, par l'aspect du changement
n&eacute;cessaire des choses. Le feu se change en eau par condensation;
et l'eau en terre; la terre de son c&ocirc;t&eacute; redevient liquide,
et celle-ci &eacute;vapor&eacute;e reproduit le feu, etc. Ainsi jamais
rien ne subsiste en sa forme. Rien ne demeure, tout devient et se transforme,
tout est cr&eacute;&eacute; continuellement par les forces agissantes dans
l'&eacute;coulement des ph&eacute;nom&egrave;nes. L'apparence de la persistance
tient &agrave; ce que les parties qui s'&eacute;coulent d'un c&ocirc;t&eacute;
sont remplac&eacute;es de l'autre par l'afflux d'autres parties dans la
m&ecirc;me proportion. Ce qui vit et se meut dans la nature, c'est le feu,
l'&acirc;me ou souffle, principe mobile et perp&eacute;tuellement changeant,
substance premi&egrave;re des choses. Ces id&eacute;es ressemblent &eacute;trangement
&agrave; celles qui servent aujourd'hui de fondement &agrave; nos th&eacute;ories
physiques sur l'&eacute;change incessant des &eacute;l&eacute;ments dans
leurs compos&eacute;s, sur la transformation des forces et sur la th&eacute;orie
m&eacute;canique de la chaleur. Emp&eacute;docle (au milieu du Ve si&egrave;cle
avant J-C) pr&eacute;cise davantage et cherche &agrave; concilier la permanence
des substances avec le changement perp&eacute;tuel des apparences. Ce qui
nous appara&icirc;t comme le commencement ou la fin d'un &ecirc;tre n'est
qu'une illusion; en r&eacute;alit&eacute;, il n'y a rien que m&eacute;lange,
r&eacute;union, combinaison, oppos&eacute;s &agrave; la s&eacute;paration,
&agrave; la d&eacute;composition. Les &eacute;l&eacute;ments dont toutes
choses sont compos&eacute;es consistent dans quatre substances diff&eacute;rentes,
incr&eacute;&eacute;es et imp&eacute;rissables: la terre, l'eau, l'air
et le feu. Emp&eacute;docle est le fondateur de la doctrine des quatre
&eacute;l&eacute;ments, d&eacute;j&agrave; entrevue par ses pr&eacute;d&eacute;cesseurs,
mais &agrave; laquelle il a donn&eacute; sa formule d&eacute;finitive.
Cette doctrine a pr&eacute;sid&eacute; &agrave; toute la chimie jusqu'&agrave;
la fin du si&egrave;cle dernier. Les quatre &eacute;l&eacute;ments r&eacute;pondent
en effet aux apparences et aux &eacute;tats g&eacute;n&eacute;raux de la
mati&egrave;re. La terre est le symbole et le support de l'&eacute;tat
solide et de la s&eacute;cheresse. L'eau, obtenue soit par fusion ign&eacute;e,
soit par dissolution, est le symbole et le support de la liquidit&eacute;
et m&ecirc;me du froid. L'air est le symbole et le support de la volatilit&eacute;
et de l'&eacute;tat gazeux. Le feu, plus subtil encore, r&eacute;pond &agrave;
la fois &agrave; la notion substantielle du fluide &eacute;th&eacute;r&eacute;,
support symbolique de la lumi&egrave;re, de la chaleur, de l'&eacute;lectricit&eacute;,
et &agrave; la notion ph&eacute;nom&eacute;nale du mouvement des derni&egrave;res
particules des corps. C'&eacute;taient donc l&agrave;, pour Emp&eacute;docle
et ses successeurs, les &eacute;l&eacute;ments de toutes choses. Ainsi
Aristote nous dit: "La chair, le bois renferment de la terre et du feu
en puissance, que l'on peut en s&eacute;parer". Les alchimistes d&eacute;signaient
les quatre &eacute;l&eacute;ments par un seul mot: la tetrasomia, laquelle
repr&eacute;sentait la mati&egrave;re des corps. Ils rangeaient ces derniers
en plusieurs classes ou cat&eacute;gories, selon qu'ils participent plus
ou moins de l'un des &eacute;l&eacute;ments. Au feu se rattachent les m&eacute;taux
et ce qui r&eacute;sulte de l'art de la coction (voie ign&eacute;e); &agrave;
l'air, les animaux qui y vivent; &agrave; l'eau, les poissons; &agrave;
la terre, les plantes, etc. L'&eacute;tablissement des catalogues de ces
quatre classes &eacute;tait attribu&eacute; &agrave; D&eacute;mocrite,
affirmation qui n'a rien d'invraisemblable. Ces id&eacute;es rappellent
celles de Stahl et de ses contemporains sur le phlogistique et sur les
corps qui s'y rattachent, tels que les m&eacute;taux et les combustibles.
Pour pr&eacute;ciser davantage, il m'a paru utile de traduire in extenso
le passage dans lequel Olympiodore s'en r&eacute;f&egrave;re formellement
aux conceptions des premi&egrave;res &eacute;coles grecques et les met
en parall&egrave;le avec les th&eacute;ories des alchimistes. Le feu est
le premier agent, celui de l'art tout entier. C'est le premier des quatre
&eacute;l&eacute;ments. En effet le langage &eacute;nigmatique des anciens
sur les quatre &eacute;l&eacute;ments se rapporte &agrave; l'art. Que ta
vertu examine avec soin les quatre livres de D&eacute;mocrite sur les quatre
&eacute;l&eacute;ments; il s'agit de physique. Il parle tant&ocirc;t du
feu doux, tant&ocirc;t du feu violent et du charbon et de tout ce qui a
besoin de feu; puis de l'air, de tout ce qui d&eacute;rive de l'air, des
animaux qui vivent dans l'air; pareillement des eaux, de la bile des poissons,
de tout ce qui se pr&eacute;pare avec les poissons et l'eau; de m&ecirc;me
il parle de la terre et de ce qui s'y rattache, les sels, les m&eacute;taux,
les plantes. Il s&eacute;pare et classe chacun de ces objets, d'apr&egrave;s
la couleur, les caract&egrave;res sp&eacute;cifiques et sexuels, m&acirc;le
ou femelle. Sachant cela, tous les anciens voil&egrave;rent l'art sous
la multiplicit&eacute; des paroles. L'art en effet a compl&egrave;tement
besoin de ces donn&eacute;es; en dehors d'elles rien de s&ucirc;r. D&eacute;mocrite
le dit, on ne pourra rien constituer de solide sans elles. Sache donc que
selon ma force j'ai &eacute;crit, &eacute;tant faible non seulement par
le discours, mais aussi par l'esprit; et je demande que par vos pri&egrave;res
vous emp&ecirc;chiez que la justice divine ne s'irrite contre moi pour
avoir eu l'audace d'&eacute;crire cet ouvrage, et qu'elle me soit propice
de toute mani&egrave;re. Les &eacute;crits des &eacute;gyptiens, leurs
po&eacute;sies, leurs doctrines, les oracles des d&eacute;mons, les expositions
des proph&egrave;tes traitent du m&ecirc;me sujet... &eacute;prouve maintenant
ta sagacit&eacute;. On a employ&eacute; plusieurs noms pour l'eau divine.
Cette eau divine d&eacute;signe ce que l'on cherche et l'on a cach&eacute;
l'objet de la recherche sous le nom d'eau divine. Je vais te montrer un
petit raisonnement, &eacute;coute, (toi qui es) en possession de toute
vertu; car je connais le flambeau de ta pens&eacute;e et le bien tut&eacute;laire
; je veux placer devant tes yeux l'esprit des anciens. Philosophes, ils
en tiennent le langage et ils sont venus &agrave; l'art par la sagesse,
sans voiler en rien la philosophie; ils ont tous &eacute;crit clairement.
En quoi ils ont manqu&eacute; &agrave; leur serment, car leurs &eacute;crits
traitent de la doctrine et non des œuvres pratiques. Quelques-uns des philosophes
naturalistes rapportent aux principes le raisonnement sur les &eacute;l&eacute;ments,
attendu que les principes sont quelque chose de plus g&eacute;n&eacute;ral
que les &eacute;l&eacute;ments. En effet au principe premier se ram&egrave;ne
tout l'ensemble de l'art. Ainsi Agathod&eacute;mon, ayant plac&eacute;
le principe dans la fin et la fin, dans le principe, veut que ce soit le
serpent ouroboros... cela est &eacute;vident, &ocirc; initi&eacute;...
Agathod&eacute;mon, quel est-il ? Les uns croient que c'est un ancien,
un des plus vieux personnages qui se sont occup&eacute;s de philosophie
en &eacute;gypte; d'autres disent que c' est un ange myst&eacute;rieux,
bon g&eacute;nie de l'&eacute;gypte; d'autres l'ont appel&eacute; le ciel,
et peut-&ecirc;tre dit-on ceci parce que le serpent est l'image du monde.
En effet certains hi&eacute;rogrammates &eacute;gyptiens, voulant retracer
le monde sur les ob&eacute;lisques, ou l'exprimer en caract&egrave;res
sacr&eacute;s, dessinent le serpent ouroboros; son corps est constell&eacute;
d'astres. C'est, m'a-t-on dit, parce qu'il est le principe. Telle est l'opinion
expos&eacute;e dans le livre de la chimie, o&ugrave; l'on en retrace la
figure. Je cherche maintenant comment il se fait que le principe soit chose
plus universelle que les &eacute;l&eacute;ments. Disons ce qui est pour
nous un &eacute;l&eacute;ment et en m&ecirc;me temps ce qu'est le principe.
Les quatre &eacute;l&eacute;ments sont le principe des corps, mais tout
principe n'est pas pour cela un &eacute;l&eacute;ment. En effet le divin,
l'œuf, l'interm&eacute;diaire, les atomes sont pour certains (philosophes)
les principes des choses; mais ce ne sont pas des &eacute;l&eacute;ments.
Cherchons donc, d'apr&egrave;s certains signes, quel est le principe des
choses, s'il est un ou multiple. S'il est unique, est-il immobile, infini,
ou d&eacute;termin&eacute; ? S'il y a plusieurs principes, les m&ecirc;mes
questions se posent: sont-ils immobiles, d&eacute;termin&eacute;s, infinis
? Les anciens ont admis un principe de tous les &ecirc;tres unique, immobile
et infini. Thal&egrave;s De Milet parle de l'œuf _ il s'agit de l'eau divine
et de l'or; _ c'est un principe un, beau, immobile; il est exempt de tout
mouvement apparent; il est de plus infini, dou&eacute; de puissance infinie
et nul ne peut d&eacute;nombrer ses puissances. Parm&eacute;nide prend
aussi pour principe le divin, principe unique, immobile, &agrave; puissance
d&eacute;termin&eacute;e; il est, dit-il, un, immobile, et l'&eacute;nergie
qui en d&eacute;rive est d&eacute;termin&eacute;e. On remarque que Thal&egrave;s
De Milet, consid&eacute;rant l'existence du dieu, le dit infini et dou&eacute;
de puissance infinie. Dieu est dou&eacute; en effet d'une puissance infinie.
Parm&eacute;nide dit que pour ses productions le dieu n'a qu'une puissance
d&eacute;termin&eacute;e; partout en effet il est &eacute;vident que ce
que dieu produit r&eacute;pond &agrave; une puissance limit&eacute;e. Les
(choses) p&eacute;rissables r&eacute;pondent &agrave; une puissance limit&eacute;e,
&agrave; l'exception des choses intellectuelles. Ces deux hommes, je veux
dire Thal&egrave;s De Milet et Parm&eacute;nide, Aristote semble les rejeter
du chœur des physiciens. En effet ce sont des th&eacute;ologiens, s'occupant
de questions &eacute;trang&egrave;res &agrave; la physique et s'attachant
&agrave; l'immobile; tandis que toutes les choses physiques se meuvent.
La nature est le principe du mouvement et du repos. Thal&egrave;s a admis
l'eau comme principe unique, d&eacute;termin&eacute; des choses, parce
qu'elle est f&eacute;conde et plastique. Elle est f&eacute;conde, puisqu'elle
donne naissance aux poissons; et plastique, puisqu'on peut lui communiquer
la forme qu'on veut: dans quelque vase qu'on la mette, elle en prend la
forme, que le vase soit poli, en terre cuite, triangulaire ou quadrangulaire,
ou ce que tu voudras. Ce principe (unique) est mobile; l'eau se meut en
effet, elle est d&eacute;termin&eacute;e et non pas &eacute;ternelle. Diog&egrave;ne
soutint que le principe est l'air, parce qu'il est riche et f&eacute;cond
; car il engendre les oiseaux. L'air, lui aussi, se montre plastique ;
on lui donne la forme qu'on veut. Mais il est un, mobile et non &eacute;ternel.
H&eacute;raclite et Hippasus ont soutenu que le feu est le principe de
tous les &ecirc;tres, parce qu'il est l'&eacute;l&eacute;ment actif de
toutes choses. Un principe doit en effet &ecirc;tre la source de l'activit&eacute;
des choses issues de lui. Comme quelques-uns le disent, le feu est aussi
f&eacute;cond; car les animaux naissent dans l'&eacute;chauffement. Quant
&agrave; la terre, nul n'en a fait le principe, sinon X&eacute;nophane
De Colophon. Comme elle n'est pas f&eacute;conde, nul n'en a fait un &eacute;l&eacute;ment.
Et que celui qui est en possession de toute vertu remarque que la terre
n'est pas signal&eacute;e comme un &eacute;l&eacute;ment par les philosophes,
parce qu'elle n'est pas f&eacute;conde. Ceci se rapporte &agrave; notre
recherche. En effet, Herm&egrave;s associe l'id&eacute;e de la terre &agrave;
celle de la vierge non f&eacute;cond&eacute;e. Anaxim&egrave;ne professe
que le principe des choses, infini et mobile, est l'air. Il parle ainsi
: l'air est voisin de l'incorporel et nous jouissons de son effluve; il
faut qu'il soit infini pour produire, sans jamais rien perdre. Anaximandre
dit que le principe est l'interm&eacute;diaire; ce qui d&eacute;signe les
vapeurs humides et les fum&eacute;es. La vapeur humide est interm&eacute;diaire
entre le feu et la terre; c'est, en un mot, l'interm&eacute;diaire entre
le chaud et l'humide. La fum&eacute;e est interm&eacute;diaire entre le
chaud et le sec. Venons &agrave; l'opinion de chacun des anciens et voyons
comment chacun veut diriger &agrave; son point de vue son enseignement.
&ccedil;&agrave; et l&agrave; quelque omission a eu lieu, par suite de
la complication des discours. R&eacute;capitulons par parties et montrons
comment nos philosophes (alchimiques), empruntant &agrave; ceux-l&agrave;
le point de d&eacute;part, ont construit notre art de la nature. Zosime,
la couronne des philosophes, dont le langage a l'abondance de l'oc&eacute;an,
le nouveau devin, suivant en g&eacute;n&eacute;ral M&eacute;lissus sur
l'art, dit que l'art est un, comme Dieu. C'est ce qu'il expose &agrave;
Th&eacute;os&egrave;bie en d'innombrables endroits et son langage est v&eacute;ridique.
Voulant nous affranchir des faux raisonnements et de toute la mati&egrave;re,
il nous exhorte &agrave; chercher notre refuge dans le dieu un. Il parle
ainsi &agrave; cette femme philosophe: assieds-toi l&agrave;, reconnaissant
que Dieu est unique et l'art unique, et ne va pas errer en cherchant un
autre dieu; car Dieu viendra pr&egrave;s de toi, lui qui est partout, et
non confin&eacute; dans le lieu le plus bas, comme le d&eacute;mon. Repose
ton corps et calme tes passions; tu appelleras alors &agrave; toi le divin,
et l'essence divine partout r&eacute;pandue viendra &agrave; toi. Quand
tu te conna&icirc;tras toi-m&ecirc;me, tu conna&icirc;tras aussi l'essence
du dieu unique. Agissant ainsi, tu atteindras la v&eacute;rit&eacute; et
la nature, m&eacute;prisant la mati&egrave;re. De m&ecirc;me Chym&egrave;s
suit Parm&eacute;nide, et dit "un est le tout; par lequel le tout est;
car s'il ne contenait pas le tout, le tout ne serait rien". Les th&eacute;ologiens
parlent sur les questions divines, comme les physiciens sur la mati&egrave;re.
Agathod&eacute;mon, tourn&eacute; vers Anaxim&egrave;ne, voit l'absolu
dans l'air. Anaximandre a dit que cet absolu &eacute;tait l'interm&eacute;diaire,
c'est-&agrave;-dire la vapeur humide et la fum&eacute;e. Pour Agathod&eacute;mon
c'est tout &agrave; fait la vapeur sublim&eacute;e. Zosime et la plupart
des autres ont suivi cette opinion, lorsqu'ils ont fait la philosophie
de notre art. Herm&egrave;s aussi parle de la fum&eacute;e, &agrave; propos
de la magn&eacute;sie. S&eacute;pare-les, dit-il, en face du fourneau...
la fum&eacute;e des "kobathia" &eacute;tant blanche, blanchit les corps
(m&eacute;taux). La fum&eacute;e est interm&eacute;diaire entre le chaud
et le sec, et ici se place la vapeur sublim&eacute;e et tout ce qui en
r&eacute;sulte. La vapeur humide est interm&eacute;diaire entre le chaud
et l'humide; elle d&eacute;signe les vapeurs sublim&eacute;es humides,
celles que distillent les alambics et les analogues. Telles &eacute;taient
les id&eacute;es des alchimistes sur la constitution de la mati&egrave;re.
Mais leurs opinions variaient, aussi bien que celles des philosophes grecs,
sur le r&ocirc;le naturel et les transformations r&eacute;ciproques des
&eacute;l&eacute;ments.
<p>&nbsp;&nbsp;&nbsp; Emp&eacute;docle, nous l'avons dit, regardait les
&eacute;l&eacute;ments comme subsistant par eux-m&ecirc;mes. Leurs m&eacute;langes
et leurs s&eacute;parations donnent lieu &agrave; tous les corps naturels
; mais eux-m&ecirc;mes ne deviennent pas, c'est-&agrave;-dire qu'ils ne
sont pas susceptibles d'&ecirc;tre form&eacute;s. Au contraire, d'autres
philosophes imaginent, conform&eacute;ment aux id&eacute;es des ioniens,
que les &eacute;l&eacute;ments se changent les uns dans les autres: "joignant
l'air au feu, la terre &agrave; l'eau, ils admettent d'abord que le feu
se change en air, celui-ci en eau, l'eau en terre; et tous les &eacute;l&eacute;ments,
par une marche inverse, r&eacute;sultent &agrave; leur tour de la terre...".
Ces notions g&eacute;n&eacute;rales prennent dans les pythagoriciens une
forme en apparence plus pr&eacute;cise. En effet, &agrave; ces aper&ccedil;us
un peu vagues, ils opposent des conceptions math&eacute;matiques et g&eacute;om&eacute;triques.
Ils d&eacute;rivent tout de l'unit&eacute;, envisag&eacute;e comme g&eacute;n&eacute;ratrice
des nombres, c'est-&agrave;-dire des &ecirc;tres. Zosime et les alchimistes
expriment par les m&ecirc;mes formules la parfaite fabrication de la poudre
de projection. Les combinaisons num&eacute;riques &eacute;taient compl&eacute;t&eacute;es,
de m&ecirc;me que dans nos sciences modernes, par la g&eacute;om&eacute;trie.
En effet, d'apr&egrave;s Philola&uuml;s (vers 450 avant J-C), la terre
est constitu&eacute;e par le cube, le feu par le t&eacute;tra&egrave;dre,
l'air par l'octa&egrave;dre, l'eau par l'icosa&egrave;dre, et le cinqui&egrave;me
&eacute;l&eacute;ment, qui comprend les autres et qui en est le lien, par
la dod&eacute;ca&egrave;dre. Le cinqui&egrave;me &eacute;l&eacute;ment
semble repara&icirc;tre dans Aristote, quoique d'une fa&ccedil;on plus
contestable. St&eacute;phanus en parle aussi, et il est devenu au moyen
&acirc;ge l'origine de la quintessence des alchimistes. Platon reproduit
toutes ces id&eacute;es des pythagoriciens, et nous les trouvons expos&eacute;es
en d&eacute;tail dans St&eacute;phanus D'Alexandrie. Elles rappellent nos
conceptions actuelles sur la structure des corps: structure cristalline,
qui est un fait positif; structure atomique, qui est une fiction repr&eacute;sentative.
L'esprit humain a besoin de cr&eacute;er &agrave; ses conceptions une base
immuable et sensible, cette base fut elle purement fictive. Les &eacute;l&eacute;ments
mobiles et transformables d'H&eacute;raclite, &eacute;taient d&eacute;j&agrave;
devenus les &eacute;l&eacute;ments fixes d'Emp&eacute;docle, et ceux-ci
avaient pris une forme figur&eacute;e et visible, aux yeux des pythagoriciens.
Voici comment l'esprit grec fut conduit aux doctrines des atomistes, Leucippe
et D&eacute;mocrite (fin du Ve et commencement du IVe si&egrave;cle avant
notre &egrave;re). D'apr&egrave;s ceux-ci, l'&ecirc;tre consiste dans un
nombre infini de petits corpuscules ou atomes, indestructibles et ins&eacute;cables,
qui se meuvent dans le vide. Ils constituent la mati&egrave;re en soi,
la substance multiple qui remplit l'espace. Les atomes se distinguent entre
eux par leur forme, par leur grandeur, leur ordre, leur situation. Les
combinaisons des atomes et leur s&eacute;paration sont la cause de la production
et de la destruction. "Les m&ecirc;mes &eacute;l&eacute;ments constituent
le ciel, la mer, les terres, les fleuves, le soleil; les m&ecirc;mes atomes
constituent aussi les fruits de la terre, les arbres, les animaux; mais
ils se meuvent et se m&eacute;langent entre eux de diverses mani&egrave;res".
Leurs arrangements divers, leurs mouvements, leurs permutations constituent
toutes choses. Ce sont les atomes qui sont les principes des &eacute;l&eacute;ments
: le feu est form&eacute; d'atomes ronds et petits; tandis que les autres
&eacute;l&eacute;ments sont un m&eacute;lange d'atomes de diverses esp&egrave;ces
et de diff&eacute;rentes grandeurs. La th&eacute;orie atomique, adopt&eacute;e
plus tard par les &eacute;picuriens, est venue jusqu'&agrave; nous, et
elle est encore profess&eacute;e aujourd'hui par la plupart des chimistes.
Il semble donc que ce soit par une sorte d'affinit&eacute; naturelle que
les alchimistes aient rapport&eacute; leurs origines &agrave; D&eacute;mocrite.
Cependant, en fait, c'est l'exp&eacute;rimentateur et le magicien, plut&ocirc;t
que le philosophe th&eacute;oricien, qui est vis&eacute; par eux. En effet,
dans les &eacute;crits des alchimistes grecs, comme dans ceux du moyen
&acirc;ge, il n'est pas question de la th&eacute;orie atomique, contrairement
&agrave; ce que l'on aurait pu croire. Le nom m&ecirc;me d'atome n'est
pour ainsi dire jamais prononc&eacute; par eux, et en tout cas, jamais
comment&eacute;. On sait d'ailleurs que les doctrines &eacute;picuriennes
et sto&iuml;ciennes, qui ont jou&eacute; un si grand r&ocirc;le &agrave;
Rome, sont presque ignor&eacute;es &agrave; Alexandrie. C' est &agrave;
l'&eacute;cole ionienne, aux pythagoriciens et surtout &agrave; Platon,
que les alchimistes se rattachent, par une tradition constante et par des
th&eacute;ories expresses; th&eacute;ories qui sont venues jusqu'&agrave;
la fin du XVIIIe si&egrave;cle.
<p><b>3 - Les Platoniciens. --- Le Tim&eacute;e.</b>
<p>&nbsp;&nbsp;&nbsp; Les th&eacute;ories des alchimistes ont un caract&egrave;re
&eacute;trange; elles s'&eacute;cartent tellement de nos id&eacute;es actuelles,
qu' elles ne peuvent gu&egrave;re &ecirc;tre comprises, &agrave; moins
de remonter &agrave; leurs origines et aux conceptions de leurs contemporains.
Or, ceux-ci ne sont autres que les alexandrins et les n&eacute;oplatoniciens,
vers le temps de Diocl&eacute;tien et de Th&eacute;odose, c'est-&agrave;-dire
vers les IIIe et IVe si&egrave;cles, ainsi que je l'ai &eacute;tabli plus
haut. C'est donc aux id&eacute;es que les philosophes se faisaient de la
mati&egrave;re &agrave; cette &eacute;poque, id&eacute;es d&eacute;riv&eacute;es
de celles de Platon, qu'il convient de nous reporter. Les opinions des
alchimistes grecs ont une affinit&eacute; singuli&egrave;rement frappante
avec celles que Platon exprime dans le tim&eacute;e; il est facile de le
v&eacute;rifier, en comparant les th&eacute;ories de Platon avec celles
de Zosime, de Syn&eacute;sius, et surtout de St&eacute;phanus D'Alexandrie.
D'apr&egrave;s Platon, il convient de distinguer d' abord la mati&egrave;re
premi&egrave;re. "La chose qui re&ccedil;oit tous les corps ne sort jamais
de sa propre mati&egrave;re; elle est le fonds commun de toutes les mati&egrave;res
diff&eacute;rentes, &eacute;tant d&eacute;pourvue de toutes les formes
qu'elle doit recevoir d'ailleurs". Il l'a compar&eacute;e aux liquides
inodores, destin&eacute;s &agrave; servir de v&eacute;hicule aux parfums
divers. Elle n'est par elle-m&ecirc;me ni terre, ni air, ni feu, ni eau,
ni corps n&eacute; de ces &eacute;l&eacute;ments. Cette mati&egrave;re
premi&egrave;re re&ccedil;oit ainsi les formes des quatre &eacute;l&eacute;ments,
avec lesquels Dieu compose le monde. Il la compose avec le feu, sans lequel
rien de visible ne peut jamais exister; avec la terre, sans laquelle il
ne peut y avoir rien de solide et de tangible; entre deux et pour les lier,
il a plac&eacute; l'eau et l'air. Ces &eacute;l&eacute;ments ont eux-m&ecirc;mes
une forme g&eacute;om&eacute;trique, qui ne leur permet de s'assembler
entre eux que suivant certains rapports. Platon reproduit ici les &eacute;nonc&eacute;s
de Philola&uuml;s, d'apr&egrave;s lequel la terre est le cube, l'eau l'icosa&egrave;dre,
l'air l'octa&egrave;dre. Les corpuscules du feu sont les plus petits, les
plus aigus, les plus mobiles, les plus l&eacute;gers. Ceux de l'air le
sont moins; ceux de l'eau, moins encore. Nous verrons tout &agrave; l'heure
St&eacute;phanus, au VIIe si&egrave;cle de notre &egrave;re, revenir sur
ces id&eacute;es; on en retrouve encore le reflet dans les imaginations
des chimistes du XVIIe si&egrave;cle sur les causes de la combinaison des
acides avec les alcalis. Les th&eacute;ories de l'&eacute;cole atomiste,
m&ecirc;me de nos jours, invoquent des repr&eacute;sentations g&eacute;om&eacute;triques
analogues. Les &eacute;l&eacute;ments de Platon semblent pouvoir &ecirc;tre
chang&eacute;s les uns dans les autres. En effet, dit encore Platon, "Nous
croyons voir que l'eau se condensant devient pierre et terre; en se fondant
et se divisant, elle devient vent et air; l'air enflamm&eacute; devient
du feu; le feu condens&eacute; et &eacute;teint reprend la forme d'air;
l'air &eacute;paissi se change en brouillard, puis s'&eacute;coule en eau;
de l'eau se forment la terre et les pierres". Les quatre &eacute;l&eacute;ments
s'engendrent d'ailleurs p&eacute;riodiquement. Ceci vient sans doute de
ce qu'il faut voir l&agrave; seulement les manifestations diverses de la
mati&egrave;re premi&egrave;re. Platon ne le dit pas express&eacute;ment;
mais Proclus, dans son commentaire sur le tim&eacute;e, explique que "Les
choses ne pouvant jamais conserver une nature propre, qui oserait affirmer
que l'une d'elles est telle plut&ocirc;t que telle autre?" C'est en conformit&eacute;
avec ces id&eacute;es que Geber, le ma&icirc;tre des alchimistes arabes
au VIIIe si&egrave;cle, expose que l'on ne saurait op&eacute;rer la transmutation
des m&eacute;taux, &agrave; moins de les r&eacute;duire &agrave; leur mati&egrave;re
premi&egrave;re. Les &eacute;l&eacute;ments ou corps primitifs de Platon
sont r&eacute;pandus dans les corps naturels, sans qu'aucun de ceux-ci
r&eacute;ponde exactement &agrave; tel ou tel &eacute;l&eacute;ment. "Nous
donnerons le nom de feu &agrave; l'apparence du feu r&eacute;pandue dans
toutes sortes d'objets; de m&ecirc;me le nom l'eau, etc. Quand nous voyons
quelque chose qui passe sans cesse d'un &eacute;tat &agrave; l'autre, le
feu par exemple, nous ne devons pas dire que cela est du feu, mais qu'une
telle apparence est celle du feu; ni que cela est de l'eau, mais qu'une
telle apparence est celle de l'eau... si quelqu' un formait en or toutes
les figures imaginables, ne cessait de changer chacune d'elles dans toutes
les autres et, en montrant une de ces formes, demandait ce que c' est,
la r&eacute;ponse la plus s&ucirc;re serait que c' est de l'or. Il en est
de m&ecirc;me de la chose qui re&ccedil;oit tous les corps. Elle re&ccedil;oit
tous les objets, sans changer sa propre nature; elle est le fond commun
de toutes les mati&egrave;res diff&eacute;rentes, sans avoir d'autres formes
ou mouvements que ceux des objets qui sont en elle". Une conception pareille,
avec le m&ecirc;me vague et le m&ecirc;me caract&egrave;re compr&eacute;hensif,
pr&eacute;sidait &agrave; la d&eacute;finition du phlogistique de Stahl
au XVIIIe si&egrave;cle. Ce phlogistique repr&eacute;sente par excellence
la mati&egrave;re du feu, envisag&eacute;e en elle-m&ecirc;me et isol&eacute;ment,
et il repr&eacute;sente cette m&ecirc;me mati&egrave;re existant dans les
corps combustibles, tels que l'hydrog&egrave;ne, le charbon, le soufre,
les m&eacute;taux. Les id&eacute;es platoniciennes ont donc eu cours, sur
ce point, jusqu'au moment de la fondation de la chimie moderne. Au XIXe
si&egrave;cle m&ecirc;me, c'est-&agrave;-dire de nos jours, le mot feu
a pr&eacute;sent&eacute; quatre sens, savoir: le calorique, c'est-&agrave;-dire
l'&eacute;l&eacute;ment ign&eacute;, le pr&eacute;tendu fluide impond&eacute;rable,
r&eacute;put&eacute; constituer la mati&egrave;re du feu, distincte de
celle des corps; la mati&egrave;re du corps en combustion: "Ne touchez
pas au feu; le feu central"; l'&eacute;tat actuel, c'est-&agrave;-dire
statique, du corps en combustion: "La maison parut toute en feu"; enfin
l'acte m&ecirc;me de l'inflammation, de la combustion, envisag&eacute;e
en soi et dans son &eacute;volution dynamique: "propagation du feu, mise
de feu, etc., &eacute;teindre le feu" . Ces deux derniers sens se touchent.
<p>&nbsp;&nbsp;&nbsp; De m&ecirc;me, dans les &eacute;crits alchimiques,
le mot eau pr&eacute;sente quatre significations: l'&eacute;l&eacute;ment
suppos&eacute;, dont l'union avec les corps leur communiquerait l'&eacute;tat
liquide, c'est-&agrave;-dire l'&eacute;l&eacute;ment liquide, la mati&egrave;re
de la liquidit&eacute; en g&eacute;n&eacute;ral. La mati&egrave;re particuli&egrave;re
actuellement liquide ou liqu&eacute;fiable, telle que l'eau, les m&eacute;taux
fusibles; l'&eacute;tat actuel et statique de la substance en fusion ;
enfin l'acte dynamique de la liqu&eacute;faction en g&eacute;n&eacute;ral,
c'est-&agrave;-dire la fusion m&ecirc;me s'accomplissant, envisag&eacute;e
dans son &eacute;volution dynamique; id&eacute;e cong&eacute;n&egrave;re
de la pr&eacute;c&eacute;dente. Ces notions peuvent para&icirc;tre subtiles
; mais si l'on ne s'y reporte, on ne peut comprendre ni Platon, ni les
anciens alchimistes. P&eacute;n&eacute;trons plus avant dans les doctrines
du tim&eacute;e sur la composition des corps. Il s'agit ici, comme Platon
a soin de l'expliquer, de conceptions qui lui sont personnelles et qu'il
expose pour ainsi dire en se jouant. Cependant elles semblent avoir des
racines plus anciennes et plus g&eacute;n&eacute;rales. Le langage et les
id&eacute;es des alchimistes s'y rattachent d'ailleurs de la fa&ccedil;on
la plus directe. Il s'agit des diverses manifestations des quatre &eacute;l&eacute;ments.
Commen&ccedil;ons par le feu. D'apr&egrave;s le tim&eacute;e: "Il s'est
form&eacute; plusieurs esp&egrave;ces de feu, la flamme, ce qui en sort
et qui donne sans br&ucirc;ler de la lumi&egrave;re aux yeux, et ce qui
reste dans les corps enflamm&eacute;s apr&egrave;s que la flamme est &eacute;teinte.
"De m&ecirc;me dans l'air, il y a la partie la plus pure qu'on nomme &eacute;ther,
la plus trouble qu'on nomme brouillard et nuages, et d'autres esp&egrave;ces
sans nom. L'eau se divise d'abord en deux esp&egrave;ces, celle qui est
liquide et celle qui est fusible. L'esp&egrave;ce liquide, compos&eacute;e
de parties d'eau petites et in&eacute;gales, peut &ecirc;tre facilement
mue par elle-m&ecirc;me et par d'autres corps. L'esp&egrave;ce fusible,
compos&eacute;e de parties grandes et pareilles, est plus stable, pesante,
compacte; le feu la p&eacute;n&egrave;tre et la dissout et elle coule ;
mais s'il se retire, la masse se resserre, se r&eacute;tablit dans son
identit&eacute; avec elle-m&ecirc;me et elle se cong&egrave;le. De tous
ces corps que nous avons nomm&eacute;s eaux fusibles, celui qui se forme
des parties les plus petites et qui a le plus de densit&eacute;, ce genre
dont il n'y a point plusieurs esp&egrave;ces, dont la couleur est un jaune
&eacute;clatant, le plus pr&eacute;cieux des tr&eacute;sors, l'or, s'est
condens&eacute;, en se filtrant &agrave; travers la pierre. L'esp&egrave;ce
d'eau fusible qui s'est form&eacute;e par la r&eacute;union de parties
presque aussi petites que celles de l'or, mais qui a plusieurs esp&egrave;ces,
qui surpasse l'or en densit&eacute;, qui renferme une petite partie de
terre tr&egrave;s t&eacute;nue et qui est pour cette raison plus dure que
l'or, mais qui est plus l&eacute;g&egrave;re &agrave; cause des grands
intervalles qui se trouvent dans sa masse, c'est un genre d'eau brillante
et condens&eacute;e que l'on nomme airain. Mais lorsque, avec le temps,
la partie de terre qu'il contient se s&eacute;pare de lui, devenue fusible
par elle-m&ecirc;me, elle prend le nom de rouille ". On reconna&icirc;t
ici les eaux de Zosime le panopolitain et des premiers alchimistes, ainsi
que la signification cach&eacute;e sous ces &eacute;tranges paroles que
nous avons reproduites plus haut . Platon dit encore, dans un langage facile
&agrave; entendre: "L'eau m&ecirc;l&eacute;e de feu, celle qui, d&eacute;li&eacute;e
et fluide, re&ccedil;oit, &agrave; cause de ce mouvement, le nom de liquide...
cette eau, lorsqu'elle est s&eacute;par&eacute;e du feu et de l'air et
isol&eacute;e, devient plus uniforme, se trouve comprim&eacute;e par la
sortie de ces deux corps et se condense... elle constitue, suivant les
circonstances, la gr&ecirc;le, la glace, la neige ou le frimas. Les nombreuses
esp&egrave;ces d'eau, m&ecirc;l&eacute;es les unes aux autres et distill&eacute;es
&agrave; travers les plantes que la terre produit, re&ccedil;oivent en
g&eacute;n&eacute;ral le nom de sucs, etc. "Il distingue alors quatre esp&egrave;ces
d'eau principales et qui contiennent du feu: le suc qui r&eacute;chauffe
l'&acirc;me et le corps, c'est-&agrave;-dire le vin; l'esp&egrave;ce alimentaire
et agr&eacute;able, c'est-&agrave;-dire le miel (esp&egrave;ce sucr&eacute;e);
enfin le genre de suc qui dissout les chairs et qui, par la chaleur, devient
&eacute;cumeux. Cette derni&egrave;re esp&egrave;ce, traduite &agrave;
tort par Cousin et par Henri Martin par le mot opium, est obscure; mais
les trois autres ne le sont pas. Quant aux esp&egrave;ces de terre, Platon
les distingue de m&ecirc;me, suivant la proportion d'eau qu'elles renferment
et selon l'&eacute;galit&eacute; et l'uniformit&eacute; de leurs parties,
en pierre, basalte, tuile, sel enfin. Je reproduis seulement ce qui concerne
le dernier genre. "Lorsque cette terre est priv&eacute;e d'une grande partie
de l'eau qui s'y trouvait m&ecirc;l&eacute;e, mais qu'elle est compos&eacute;e
des parties t&eacute;nues et qu'elle est sal&eacute;e, il se forme aussi
un corps &agrave; demi-solide et susceptible de se dissoudre de nouveau
dans l'eau: ainsi se produit, d'une part, le natron, qui sert &agrave;
laver les taches d'huile et de terre; de l'autre, ce corps qu'il est si
utile de m&ecirc;ler avec les substances r&eacute;unies pour flatter le
palais, le sel, ce corps aim&eacute; des dieux...". Quand la terre n'est
pas condens&eacute;e avec force, il n'y a que l'eau qui puisse la dissoudre;
mais, quand elle est compacte, il n'y a que le feu, car il est le seul
corps qui puisse y p&eacute;n&eacute;trer. "Les corps qui contiennent moins
d'eau que la terre sont toutes les esp&egrave;ces de verre, et toutes les
esp&egrave;ces de pierre qu'on nomme fusibles; d'autres, au contraire,
contiennent plus d'eau dans leur composition: ce sont les corps semblables
&agrave; la cire et aromatiques". J'ai cru utile de donner in extenso ces
passages du tim&eacute;e de Platon, parce qu'ils me paraissent renfermer
les v&eacute;ritables origines des th&eacute;ories alchimiques.
<p><b>3 - Les Alchimistes Grecs.</b>
<p>&nbsp;&nbsp;&nbsp; Il est facile, en effet, d'apercevoir la parent&eacute;
des id&eacute;es du tim&eacute;e avec celles qui sont pr&eacute;sent&eacute;es
dans nos citations des premiers alchimistes, contemporains et &eacute;l&egrave;ves
des n&eacute;oplatoniciens. Cette filiation est accus&eacute;e d'une fa&ccedil;on
expresse par les &eacute;crits de Syn&eacute;sius et de St&eacute;phanus
D' Alexandrie. Nous lisons, par exemple, dans le commentaire de Syn&eacute;sius
sur D&eacute;mocrite. "Les corps sont compos&eacute;s de quatre choses,
ainsi que les choses qui y sont attach&eacute;es; et quelles sont ces choses?
Leurs mati&egrave;res premi&egrave;res sont leurs &acirc;mes. De m&ecirc;me
que l'artisan fa&ccedil;onne le bois pour en faire un si&egrave;ge, ou
un char ou autre chose, et ne fait que modifier la mati&egrave;re, sans
lui donner autre chose que la forme; de m&ecirc;me l'airain est fa&ccedil;onn&eacute;
en statue, en vase arrondi. Ainsi op&egrave;re notre art; de m&ecirc;me
le mercure, travaill&eacute; par nous, prend toute esp&egrave;ce de formes
; fix&eacute; sur un corps form&eacute; des quatre &eacute;l&eacute;ments,
il demeure ferme: il poss&egrave;de une affinit&eacute; puissante ". La
facult&eacute; d'amalgamation, d'action universelle du mercure pr&eacute;occupe
sans cesse notre auteur. Un peu avant il dit: "Le mercure prend toutes
les formes, de m&ecirc;me que la cire attire toute couleur; ainsi le mercure
blanchit tout, attire l'&acirc;me de toutes choses... il change toutes
les couleurs et subsiste lui-m&ecirc;me, tandis qu'elles ne subsistent
pas; et m&ecirc;me s'il ne subsiste pas en apparence, il demeure contenu
dans les corps". On voit ici repara&icirc;tre la notion de la qualit&eacute;
fondamentale, prise pour un &eacute;l&eacute;ment, une substance proprement
dite; et celle de la mati&egrave;re premi&egrave;re, constituant, &agrave;
proprement parler, l'&acirc;me des corps. La comparaison m&ecirc;me de
celle-ci, faite par Platon, avec l'or qui sert aux travaux de l'artisan,
se retrouve appliqu&eacute;e au bois. Seulement la notion m&eacute;taphysique
de la mati&egrave;re premi&egrave;re universelle de Platon est transform&eacute;e
et concr&eacute;t&eacute;e en quelque sorte, par un artifice de m&eacute;taphysique
mat&eacute;rialiste que nous retrouvons dans la philosophie chimique de
tous les temps: elle est identifi&eacute;e avec le mercure des philosophes.
C' est l&agrave; une notion toute nouvelle et tr&egrave;s originale, notion
plus ancienne d'ailleurs que Syn&eacute;sius, s'il est vrai que Dioscoride
ait d&eacute;clar&eacute; d&eacute;j&agrave;, vers le temps de l'&egrave;re
chr&eacute;tienne, que "certains regardent le mercure comme contenu dans
tous les m&eacute;taux". L'origine de cette opinion est facile &agrave;
apercevoir, en rappelant que Platon d&eacute;signe sous le nom d'eaux tous
les corps liquides et tous les corps fusibles, l'or et le cuivre notamment.
Les m&eacute;taux fondus offrent en effet un aspect et des propri&eacute;t&eacute;s
remarquables, semblables &agrave; celles du mercure ordinaire. Il n'est
pas surprenant que ces caract&egrave;res communs aient &eacute;t&eacute;
attribu&eacute;s &agrave; une substance sp&eacute;ciale, en qui r&eacute;sidait
par excellence, disait-on, la liquidit&eacute; m&eacute;tallique: c'&eacute;tait
l'un des attributs momentan&eacute;s du mercure des philosophes. Le mercure,
joint au soufre et &agrave; l'<i>arsenic</i> des philosophes, symboles
d'autres qualit&eacute;s fondamentales, constituent &agrave; proprement
parler les &eacute;l&eacute;ments chimiques, comme Geber le d&eacute;clare
formellement au VIIIe si&egrave;cle. St&eacute;phanus D' Alexandrie (vers
630) se rapproche encore davantage que Syn&eacute;sius des id&eacute;es
et du langage du tim&eacute;e et des pythagoriciens. C' est un auteur enthousiaste
et mystique, comme les alchimistes gnostiques Zosime et Syn&eacute;sius.
Il croit fermement au pouvoir illimit&eacute; de la science. "La science
peut tout, dit-il; elle voit clairement les choses que l'on ne peut apercevoir
et elle peut accomplir les choses impossibles". C est aussi un n&eacute;oplatonicien
chr&eacute;tien, qui d&eacute;bute par invoquer la sainte trinit&eacute;.
"La multitude des nombres, dit encore St&eacute;phanus d' apr&egrave;s
les pythagoriciens, est compos&eacute;e d'une seule unit&eacute;, indivisible
et naturelle, qui la produit &agrave; l'infini, la domine et l'embrasse,
parce que cette multitude d&eacute;coule de l'unit&eacute;. Elle est immuable,
immobile; les nombres r&eacute;sultent de son d&eacute;veloppement circulaire
et sph&eacute;rique". De m&ecirc;me Zosime &eacute;crivait d&eacute;j&agrave;:
"Tout vient de l'unit&eacute;; tout s'y classe; elle engendre tout". St&eacute;phanus
expose plus loin: "Que Dieu a fait l'univers avec quatre &eacute;l&eacute;ments...
ces quatre &eacute;l&eacute;ments (l'air, le feu, la terre et l'eau), &eacute;tant
contraires entre eux, ne peuvent se r&eacute;unir, si ce n'est par l'interposition
d'un corps qui poss&egrave;de les qualit&eacute;s des deux extr&ecirc;mes:
ainsi le feu vif-argent se joint &agrave; l'eau par l'interm&egrave;de
de la terre, c'est-&agrave;-dire de la scorie... l'eau est jointe avec
le feu du vif-argent par l'air du cuivre etc. Le feu, &eacute;tant chaud
et sec, engendre la chaleur de l'air et la s&eacute;cheresse de la terre.
L'eau humide et froide engendre l'humidit&eacute; de l'air et le froid
de la terre; la terre froide et s&egrave;che engendre le froid de l'eau
et la s&eacute;cheresse du feu, etc. R&eacute;ciproquement, l'air chaud
et humide engendre la chaleur du feu et l'humidit&eacute; de l'eau, etc."
Des th&eacute;ories m&eacute;dicales connexes, sur le froid et le chaud,
le sec et l'humide, le sang et la bile, sont ici entrem&ecirc;l&eacute;es
et manifestent la profession de St&eacute;phanus. Les paroles pr&eacute;c&eacute;dentes
rappellent encore celles de Platon: "C'est donc de feu et de terre que
Dieu dut former l'univers; mais il est impossible de bien unir deux corps
sans un troisi&egrave;me, car il faut qu'entre eux se trouve un lien qui
les rapproche tous deux . Nous retrouvons encore l'application, mat&eacute;rialis&eacute;e
suivant un sens chimique, d'une notion de la m&eacute;taphysique platonicienne;
notion qui a reparu au si&egrave;cle dernier sous le nom du m&eacute;diateur
plastique, interpos&eacute; entre l'&acirc;me et le corps. St&eacute;phanus
pr&eacute;cise davantage, toujours dans un langage pythagoricien; il montre
les relations num&eacute;riques qui &eacute;tablissent une parent&eacute;
mystique entre l'alchimie et l'astronomie, autre ordre de conceptions non
moins int&eacute;ressantes dans l'histoire de la science. Apr&egrave;s
avoir &eacute;tabli que chacun des quatre &eacute;l&eacute;ments, ayant
deux qualit&eacute;s, r&eacute;sulte de l'association de trois &eacute;l&eacute;ments,
dont deux associ&eacute;s &agrave; lui-m&ecirc;me et qu'il conserve; il
ajoute: "Cela fait douze combinaisons, r&eacute;sultant de quatre &eacute;l&eacute;ments
pris trois &agrave; trois: c'est pourquoi notre art est repr&eacute;sent&eacute;
par le dod&eacute;ca&egrave;dre, qui r&eacute;pond aux douze signes du
zodiaque". Les quatre saisons r&eacute;pondent aux quatre &eacute;l&eacute;ments,
aux quatre r&eacute;gions du corps humain, etc. De m&ecirc;me les sept
transformations, les sept couleurs, les sept plan&egrave;tes. Les relations
&eacute;tablies par le d&eacute;miurge, autre conception platonicienne,
entre les m&eacute;taux et les plan&egrave;tes sont d&eacute;velopp&eacute;es
plus loin. Mais achevons d'exposer ce qui est relatif &agrave; la transformation
de la mati&egrave;re, d'apr&egrave;s St&eacute;phanus. "Il faut d&eacute;pouiller
la mati&egrave;re (de ses qualit&eacute;s), en tirer l'&acirc;me, la s&eacute;parer
du corps, pour arriver &agrave; la perfection... le cuivre, est comme l'homme
: il a une &acirc;me et un corps... quelle est son &acirc;me et quel est
son corps? L'&acirc;me est la partie la plus subtile..., c'est-&agrave;-dire
l'esprit tinctorial. Le corps est la chose pesante, mat&eacute;rielle,
terrestre et dou&eacute;e d'une ombre... apr&egrave;s une suite de traitements
convenables, le cuivre devient sans ombre et meilleur que l'or... il faut
expulser l'ombre de la mati&egrave;re pour obtenir la nature pure et immacul&eacute;e...
il faut donc d&eacute;pouiller la mati&egrave;re, et comment la d&eacute;pouiller?
Si ce n'est par le rem&egrave;de ign&eacute; (mercure). Et qu'est-ce que
d&eacute;pouiller? Si ce n'est appauvrir, corrompre, dissoudre, mettre
&agrave; mort et enlever &agrave; celui-ci toute sa nature propre et sa
grande mobilit&eacute;; afin que l'esprit, subsistant et manifestant le
principe tinctorial, soit rendu susceptible de se combiner pour accomplir
l'op&eacute;ration cherch&eacute;e (c'est-&agrave;-dire la teinture des
m&eacute;taux ou transmutation)... la nature de la mati&egrave;re est &agrave;
la fois simple et compos&eacute;e... elle re&ccedil;oit mille noms, et
son essence est une, etc. Les &eacute;l&eacute;ments deviennent et se transmutent,
parce que les qualit&eacute;s sont contraires et non les substances" .
Ailleurs: "Il faut d'abord diviser la mati&egrave;re, la noircir, puis
la blanchir; alors la coloration jaune sera stable". Et encore: "Entends
par le feu le mercure et le rem&egrave;de ign&eacute;: ce mercure br&ucirc;le,
corrompt et &eacute;puise les corps, etc.". Nous retrouvons la phrase de
Marie la juive et le mot de Pline: "Le mercure, poison de toutes choses"
. Ces explications demi-m&eacute;taphysiques sont entrem&ecirc;l&eacute;es
dans l'auteur par le r&eacute;cit d'op&eacute;rations r&eacute;elles, dont
la signification s'aper&ccedil;oit parfois tr&egrave;s clairement. Ainsi,
St&eacute;phanus raconte en langage mystique le combat du cuivre et du
mercure... le cuivre est blanchi et corrompu par le mercure. Celui-ci est
fix&eacute; par son union avec le cuivre, etc... le cuivre ne teint pas,
mais il re&ccedil;oit la teinture, et apr&egrave;s qu'il l'a re&ccedil;ue,
il teint (les autres corps). Ce qui para&icirc;t se rapporter &agrave;
la fois et &agrave; la formation des alliages m&eacute;talliques de diverses
nuances et &agrave; la coloration des verres et &eacute;maux par les sels
de cuivre, r&eacute;sultant de la dissolution pr&eacute;alable du m&eacute;tal.
L'auteur s'en r&eacute;f&egrave;re aussi aux pr&eacute;parations des &eacute;gyptiens
et ajoute: "Un seul genre de pierre peut &ecirc;tre fabriqu&eacute; avec
beaucoup de pierres de diverses esp&egrave;ces; c'est ainsi qu'on fabrique
les statues, les animaux, les verres, les couleurs (&eacute;maux ou verres
color&eacute;s)". Nous touchons ici du doigt les faits positifs et les
pratiques industrielles qui ont servi de base aux th&eacute;ories des alchimistes.
Nous voyons comment ils en ont d&eacute;duit la notion de la mati&egrave;re
premi&egrave;re, une et polymorphe, telle que nous la trouvons dans Platon,
dans &eacute;n&eacute;e de Gaza, dans Zosime, dans P&eacute;lage, dans
St&eacute;phanus. Ils pr&eacute;cisent leur id&eacute;e, tant&ocirc;t par
des comparaisons tir&eacute;es de l'art des artisans, qui donnent une apparence
diverse &agrave; une mati&egrave;re unique; tant&ocirc;t, par des assimilations
plus profondes, emprunt&eacute;es aux industries chimiques de la teinture
et de la fabrication du verre et des &eacute;maux. Nous sommes donc ramen&eacute;s
par ces th&eacute;ories philosophiques sur le terrain m&ecirc;me o&ugrave;
nous avait conduit l'&eacute;tude pratique des m&eacute;taux &eacute;gyptiens,
de leurs alliages et des pierres brillantes, naturelles et artificielles,
rang&eacute;es &agrave; c&ocirc;t&eacute; des m&eacute;taux dans une m&ecirc;me
famille de substances.
<center>
<p><b><font size=+1>Th&eacute;ories des Alchimistes et Th&eacute;ories
Modernes.</font></b></center>

<p><b>1 - Le Mercure des Philosophes.</b>
<p>&nbsp;&nbsp;&nbsp; L'alchimie &eacute;tait une philosophie, c'est-&agrave;-dire
une explication rationaliste des m&eacute;tamorphoses de la mati&egrave;re.
Nulle part, dans les proc&eacute;d&eacute;s des premiers th&eacute;oriciens
grecs qui sont venus jusqu'&agrave; nous, le miracle n'appara&icirc;t ;
bien que les formules magiques semblent avoir &eacute;t&eacute; m&ecirc;l&eacute;es
aux pratiques, lors des d&eacute;buts de la science, au temps de Zosime
par exemple. Mais elles semblent avoir disparu, en m&ecirc;me temps que
la th&eacute;orie proprement dite s'est d&eacute;velopp&eacute;e. Michel
Psellus d&eacute;clare formellement que les destructions et transformations
de mati&egrave;re se font par des causes naturelles, et non en vertu d'une
incantation et d'une formule secr&egrave;te. &agrave; travers les explications
mystiques et les symboles dont s'enveloppent les alchimistes, nous pouvons
entrevoir les th&eacute;ories essentielles de leur philosophie; lesquelles
se r&eacute;duisent en somme &agrave; un petit nombre d'id&eacute;es claires,
plausibles, et dont certaines offrent une analogie &eacute;trange avec
les conceptions de notre temps. Tous les corps de la nature, d'apr&egrave;s
les adeptes grecs, sont form&eacute;s par une m&ecirc;me mati&egrave;re
fondamentale. Pour obtenir un corps d&eacute;termin&eacute;, l'or par exemple,
le plus parfait des m&eacute;taux, le plus pr&eacute;cieux des biens, il
faut prendre des corps analogues, qui en diff&egrave;rent seulement par
quelque qualit&eacute;, et &eacute;liminer ce qui les particularise; de
fa&ccedil;on &agrave; les r&eacute;duire &agrave; leur mati&egrave;re premi&egrave;re,
qui est le mercure des philosophes. Celui-ci peut &ecirc;tre tir&eacute;
du mercure ordinaire, en lui enlevant d'abord la liquidit&eacute;, c'est-&agrave;-dire
une eau, un &eacute;l&eacute;ment fluide et mobile, qui l'emp&ecirc;che
d'atteindre la perfection. Il faut aussi le fixer, lui &ocirc;ter sa volatilit&eacute;,
c'est-&agrave;-dire un air, un &eacute;l&eacute;ment a&eacute;rien qu'il
renferme; enfin d'aucuns professent, comme le fera plus tard Geber, qu'il
faut s&eacute;parer encore du mercure une terre, un &eacute;l&eacute;ment
terrestre, une scorie grossi&egrave;re, qui s'oppose &agrave; sa parfaite
att&eacute;nuation. On op&eacute;rait de m&ecirc;me avec le plomb, avec
l &eacute;tain; bref, on cherchait &agrave; d&eacute;pouiller chaque m&eacute;tal
de ses propri&eacute;t&eacute;s individuelles. Il fallait &ocirc;ter au
plomb sa fusibilit&eacute;, &agrave; l'&eacute;tain son cri particulier,
sur lequel Geber insiste beaucoup; le mercure enl&egrave;ve en effet &agrave;
l'&eacute;tain son cri, dit aussi St&eacute;phanus. La mati&egrave;re premi&egrave;re
de tous les m&eacute;taux &eacute;tant ainsi pr&eacute;par&eacute;e, je
veux dire le mercure des philosophes, il ne restait plus qu'&agrave; la
teindre par le soufre et l'arsenic; mots sous lesquels on confondait &agrave;
la fois les sulfures m&eacute;talliques, divers corps inflammables cong&eacute;n&egrave;res,
et les mati&egrave;res quintessenci&eacute;es que les philosophes pr&eacute;tendaient
en tirer. C'est dans ce sens que les m&eacute;taux ont &eacute;t&eacute;
regard&eacute;s au temps des arabes, comme compos&eacute;s de soufre et
de mercure. Les teintures d'or et d'argent &eacute;taient r&eacute;put&eacute;es
avoir au fond une m&ecirc;me composition. Elles constituaient la pierre
philosophale, ou poudre de projection (xerion). Telle est, je crois, la
th&eacute;orie que l'on peut entrevoir &agrave; travers ces symboles et
ces obscurit&eacute;s; th&eacute;orie en partie tir&eacute;e d'exp&eacute;riences
pratiques, en partie d&eacute;duite de notions philosophiques. En effet,
la mati&egrave;re et ses qualit&eacute;s sont con&ccedil;ues comme distinctes,
et celles-ci sont envisag&eacute;es comme des &ecirc;tres particuliers,
que l'on peut ajouter ou faire dispara&icirc;tre. Dans les expos&eacute;s
des adeptes, il r&egrave;gne une triple confusion entre la mati&egrave;re
substantielle, telle que nous la concevons aujourd'hui; ses &eacute;tats,
solidit&eacute;, liquidit&eacute;, volatilit&eacute;, envisag&eacute;es
comme des substances sp&eacute;ciales, surajout&eacute;es, et qui seraient
m&ecirc;me, d'apr&egrave;s les ioniens, les vrais &eacute;l&eacute;ments
des choses; enfin, les ph&eacute;nom&egrave;nes ou actes manifest&eacute;s
par la mati&egrave;re, sous leur double forme statique et dynamique, tels
que la liqu&eacute;faction, la volatilisation, la combustion, actes assimil&eacute;s
eux-m&ecirc;mes aux &eacute;l&eacute;ments. Il y a donc au fond de tout
ceci certaines id&eacute;es m&eacute;taphysiques, auxquelles la chimie
n'a jamais &eacute;t&eacute; &eacute;trang&egrave;re. Au si&egrave;cle
dernier, un pas capital a &eacute;t&eacute; fait dans notre conception
de la mati&egrave;re, par suite de la s&eacute;paration apport&eacute;e
entre la notion substantielle de l'existence des corps pond&eacute;rables
et la notion ph&eacute;nom&eacute;nale de leurs qualit&eacute;s, envisag&eacute;es
jusque-l&agrave; par les alchimistes comme des substances r&eacute;elles.
Mais pour comprendre le pass&eacute; il convient de nous reporter &agrave;
des opinions ant&eacute;rieures et qui paraissaient claires aux esprits
cultiv&eacute;s, il y a un si&egrave;cle &agrave; peine. Les doctrines
des alchimistes et des platoniciens &agrave; cet &eacute;gard diff&egrave;rent
tellement des n&ocirc;tres, qu'il faut un certain effort d'esprit pour
nous replacer dans le milieu intellectuel qu'elles &eacute;taient destin&eacute;es
&agrave; reproduire. Cependant, il est incontestable qu'elles constituent
un ensemble logique, et qui a longtemps pr&eacute;sid&eacute; aux th&eacute;ories
scientifiques. Ces doctrines, que nous apercevons d&eacute;j&agrave; dans
le pseudo-D&eacute;mocrite, dans Zosime, et plus nettement encore dans
leurs commentateurs, Syn&eacute;sius, Olympiodore et St&eacute;phanus,
se retrouvent expos&eacute;es dans les m&ecirc;mes termes par Geber, le
ma&icirc;tre des arabes, et apr&egrave;s lui, par tous les philosophes
herm&eacute;tiques. Non seulement les mat&eacute;riaux employ&eacute;s
par ceux-ci dans la transmutation: le soufre, l'argent, la tutie, la magn&eacute;sie,
la marcassite, etc., rappellent tout &agrave; fait ceux du pseudo-D&eacute;mocrite
et de ses successeurs grecs; mais Geber dit formellement que l'on ne saurait
r&eacute;ussir dans la transmutation, si l'on ne ram&egrave;ne les m&eacute;taux
&agrave; leur mati&egrave;re premi&egrave;re. L'esprit humain s'est attach&eacute;
avec obstination &agrave; ces th&eacute;ories, qui ont servi de support
&agrave; bien des exp&eacute;riences r&eacute;elles. Ce fut aussi la doctrine
de tout le moyen &acirc;ge. Dans les &eacute;crits attribu&eacute;s &agrave;
Basile Valentin, &eacute;crits qui remontent au XVe si&egrave;cle, l'auteur
affirme de m&ecirc;me que l'esprit de mercure est l'origine de tous les
m&eacute;taux, et nous retrouvons cette doctrine dans la biblioth&egrave;que
des philosophes chimiques de Salmon, &agrave; la fin du XVIIe si&egrave;cle.
De l&agrave; cet espoir d&eacute;cevant de la transmutation, espoir entretenu
par le vague des anciennes connaissances; il reposait sur l'apparence incontestable
d'un cycle ind&eacute;fini de transformations, se reproduisant sans commencement
ni terme, dans les op&eacute;rations chimiques. Ceci demande &agrave; &ecirc;tre
d&eacute;velopp&eacute;, si l'on veut comprendre l'origine et la port&eacute;e
des id&eacute;es des anciens chimistes.
<p><b>2 - Origine et Port&eacute;e des Id&eacute;es Alchimiques.</b>
<p>&nbsp;&nbsp;&nbsp; Je prends un minerai de fer, soit l'un de ses oxydes
si r&eacute;pandus dans la nature; je le chauffe avec du charbon et du
calcaire et j'obtiens le fer m&eacute;tallique. Mais celui-ci &agrave;
son tour, par l'action brusque du feu au contact de l'air, ou par l'action
lente des agents atmosph&eacute;riques, repasse &agrave; l'&eacute;tat
d'un oxyde, identique ou analogue avec le g&eacute;n&eacute;rateur primitif.
O&ugrave; est ici l'&eacute;l&eacute;ment primordial, &agrave; en juger
par les apparences ? Est-ce le fer, qui dispara&icirc;t si ais&eacute;ment
? Est-ce l'oxyde, qui existait au d&eacute;but et se retrouve &agrave;
la fin ? L'id&eacute;e du corps &eacute;l&eacute;mentaire semblerait a
priori convenir plut&ocirc;t au dernier produit, en tant que corr&eacute;lative
de la stabilit&eacute;, de la r&eacute;sistance aux agents de toute nature.
Voil&agrave; comment l'or a paru tout d'abord le terme accompli des m&eacute;tamorphoses,
le corps parfait par excellence: non seulement &agrave; cause de son &eacute;clat,
mais surtout parce qu'il r&eacute;siste mieux que tout autre m&eacute;tal
aux agents chimiques. Les corps simples, qui sont aujourd'hui l'origine
certaine et la base des op&eacute;rations chimiques, ne se distinguent
cependant pas &agrave; premi&egrave;re vue des corps compos&eacute;s. Entre
un m&eacute;tal et un alliage, entre un &eacute;l&eacute;ment combustible,
tel que le soufre ou l'ars&eacute;nic, et les r&eacute;sines et autres
corps inflammables combustibles compos&eacute;s, apparences ne sauraient
&eacute;tablir une distinction fondamentale. Les corps simples dans la
nature ne portent pas une &eacute;tiquette, s'il est permis de s'exprimer
ainsi, et les mutations chimiques ne cessent pas de s'accomplir, &agrave;
partir du moment o&ugrave; elles ont mis ces corps en &eacute;vidence.
Soumis &agrave; l'action du feu ou des r&eacute;actifs qui les ont fait
appara&icirc;tre, ils disparaissent &agrave; leur tour; en donnant naissance
&agrave; de nouvelles substances, pareilles &agrave; celles qui les ont
pr&eacute;c&eacute;d&eacute;es. Nous retrouvons ainsi dans les ph&eacute;nom&egrave;nes
chimiques cette rotation ind&eacute;finie dans les transformations, loi
fondamentale de la plupart des &eacute;volutions naturelles; tant dans
l'ordre de la nature min&eacute;rale que dans l'ordre de la nature vivante,
tant dans la physiologie que dans l'histoire. Nous comprenons pourquoi,
aux yeux des alchimistes, l'œuvre myst&eacute;rieuse n'avait ni commencement
ni fin, et pourquoi ils la symbolisaient par le serpent annulaire, qui
se mord la queue: embl&ecirc;me de la nature toujours une, sous le fond
mobile des apparences.
<p>&nbsp;&nbsp;&nbsp; Cependant cette image de la chimie a cess&eacute;
d'&ecirc;tre vraie pour nous. Par une rare exception dans les sciences
naturelles, notre analyse est parvenue en chimie &agrave; mettre &agrave;
nu l'origine pr&eacute;cise, indiscutable des m&eacute;tamorphoses: origine
&agrave; partir de laquelle la synth&egrave;se sait aujourd'hui reproduire
&agrave; volont&eacute; les ph&eacute;nom&egrave;nes et les &ecirc;tres,
dont elle a saisi la loi g&eacute;n&eacute;ratrice. Un progr&egrave;s immense
et inattendu a donc &eacute;t&eacute; accompli en chimie: car il est peu
de sciences qui puissent ainsi ressaisir leurs origines. Mais ce progr&egrave;s
n'a pas &eacute;t&eacute; r&eacute;alis&eacute; sans un long effort des
g&eacute;n&eacute;rations humaines. C'est par des raisonnements subtils,
fond&eacute;s sur la comparaison d'un nombre immense de ph&eacute;nom&egrave;nes,
que l'on est parvenu &agrave; &eacute;tablir une semblable ligne de d&eacute;marcation,
aujourd'hui si tranch&eacute;e pour nous, entre les corps simples et les
corps compos&eacute;s. Mais ni les alchimistes, ni m&ecirc;me Stahl ne
faisaient une telle diff&eacute;rence. Il n'y avait donc rien de chim&eacute;rique,
a priori du moins, dans leurs esp&eacute;rances. Le r&ecirc;ve des alchimistes
a dur&eacute; jusqu'&agrave; la fin du si&egrave;cle dernier, et je ne
sais s'il ne persiste pas encore dans certains esprits. Certes il n'a jamais
eu pour fondement aucune exp&eacute;rience positive. Les op&eacute;rations
r&eacute;elles que faisaient les alchimistes, nous les connaissons toutes
et nous les r&eacute;p&eacute;tons chaque jour dans nos laboratoires ;
car ils sont &agrave; cet &eacute;gard nos anc&ecirc;tres et nos pr&eacute;curseurs
pratiques. Nous op&eacute;rons les m&ecirc;mes fusions, les m&ecirc;mes
dissolutions, les m&ecirc;mes associations de minerais, et nous ex&eacute;cutons
en outre une multitude d'autres manipulations et de m&eacute;tamorphoses
qu'ils ignoraient. Mais aussi nous savons de toute certitude que la transmutation
des m&eacute;taux ne s'accomplit dans le cours d'aucune de ces op&eacute;rations.
Jamais un op&eacute;rateur moderne n'a vu l'&eacute;tain, le cuivre, le
plomb se changer sous ses yeux en argent ou en or par l'action du feu,
exerc&eacute;e par les m&eacute;langes les plus divers; comme Zosime et
Geber s'imaginaient le r&eacute;aliser. La transmutation n'a pas lieu,
m&ecirc;me sous l'influence des forces dont nous disposons aujourd'hui,
forces autrement puissantes et subtiles que les agents connus des anciens.
Les d&eacute;couvertes modernes relatives aux mati&egrave;res explosives
et &agrave; l'&eacute;lectricit&eacute; mettent &agrave; notre disposition
des agents &agrave; la fois plus &eacute;nergiques et plus profonds, qui
vont bien au del&agrave; de tout ce que les alchimistes avaient connu.
Ces agents atteignent des temp&eacute;ratures ignor&eacute;es avant nous
; ils communiquent &agrave; la mati&egrave;re en mouvement une activit&eacute;
et une force vive incomparablement plus grande que les op&eacute;rations
des anciens. Ils donnent &agrave; ces mouvements une direction, une polarisation,
qui permettent d'accro&icirc;tre &agrave; coup s&ucirc;r et dans un sens
d&eacute;termin&eacute; &agrave; l'avance l'intensit&eacute; des forces
pr&eacute;sidant aux m&eacute;tamorphoses. Par l&agrave; m&ecirc;me, nous
avons obtenu &agrave; la fois cette puissance sur la nature et cette richesse
industrielle que les alchimistes avaient si longtemps r&ecirc;v&eacute;es,
sans jamais pouvoir y atteindre. La chimie et la m&eacute;canique ont transform&eacute;
le monde moderne. Nous m&eacute;tamorphosons la mati&egrave;re tous les
jours et de toutes mani&egrave;res. Mais nous avons pr&eacute;cis&eacute;
en m&ecirc;me temps les limites auxquelles s'arr&ecirc;tent ces m&eacute;tamorphoses
: elles n'ont jamais d&eacute;pass&eacute; jusqu'&agrave; pr&eacute;sent
nos corps simples ou &eacute;l&eacute;ments chimiques. Cette limite n'est
pas impos&eacute;e par quelque th&eacute;orie philosophique; c'est une
barri&egrave;re de fait, que notre puissance exp&eacute;rimentale n'a pas
r&eacute;ussi &agrave; renverser.
<p><b>3 - Les Corps Simples Actuels.</b>
<p>&nbsp;&nbsp;&nbsp; Lavoisier a montr&eacute;, il y a cent ans, que l'origine
de tous les ph&eacute;nom&egrave;nes chimiques connus peut &ecirc;tre assign&eacute;e
avec nettet&eacute; et qu'elle ne d&eacute;passe pas ce qu'il appelait,
et ce que nous appelons avec lui, les corps simples et ind&eacute;composables,
les m&eacute;taux en particulier, dont la nature et le poids se maintiennent
invariables. C'est cette invariabilit&eacute; de poids des &eacute;l&eacute;ments
actuels qui est le nœud du probl&egrave;me. Le jour o&ugrave; elle a &eacute;t&eacute;
partout constat&eacute;e et d&eacute;montr&eacute;e avec pr&eacute;cision,
le r&ecirc;ve antique de la transmutation s'est &eacute;vanoui. Dans le
cycle des transformations, si la gen&egrave;se r&eacute;ciproque de nos
&eacute;l&eacute;ments n'est pas r&eacute;put&eacute;e impossible a priori,
du moins il est &eacute;tabli aujourd'hui que ce serait l&agrave; une op&eacute;ration
d'un tout autre ordre que celles que nous connaissons et que nous avons
le pouvoir actuel d'ex&eacute;cuter. Car, en fait, dans aucune de nos op&eacute;rations,
le poids des &eacute;l&eacute;ments et leur nature n'&eacute;prouvent de
variation. Nos exp&eacute;riences sur ce point datent d'un si&egrave;cle.
Elles ont &eacute;t&eacute; r&eacute;p&eacute;t&eacute;es et diversifi&eacute;es
de mille fa&ccedil;ons, par des milliers d'exp&eacute;rimentateurs, sans
avoir &eacute;t&eacute; jamais trouv&eacute;es en d&eacute;faut. L'existence
constat&eacute;e d'une diff&eacute;rence aussi radicale entre la transmutation
des m&eacute;taux, si longtemps esp&eacute;r&eacute;e en vain, et la fabrication
des corps compos&eacute;s, d&eacute;sormais r&eacute;alisable par des m&eacute;thodes
certaines, jeta un jour soudain. C'&eacute;tait &agrave; cause de l'ignorance
o&ugrave; l'on &eacute;tait rest&eacute; &agrave; cet &eacute;gard jusqu'&agrave;
la fin du XVIIIe si&egrave;cle que la chimie n'avait pas r&eacute;ussi
&agrave; se constituer comme science positive. La nouvelle notion d&eacute;montra
l'inanit&eacute; des r&ecirc;ves des anciens op&eacute;rateurs, inanit&eacute;
que leur impuissance &agrave; &eacute;tablir aucun fait r&eacute;el de
transmutation avait d&eacute;j&agrave; fait soup&ccedil;onner depuis longtemps.
Chez les alchimistes grecs, les plus anciens de tous, le doute n'appara&icirc;t
pas encore; mais le scepticisme existe d&eacute;j&agrave; du temps de Geber,
qui consacre plusieurs chapitres &agrave; le r&eacute;futer en forme. Depuis,
ce scepticisme avait toujours grandi, et les bons esprits en &eacute;taient
arriv&eacute;s, m&ecirc;me avant Lavoisier, &agrave; nier la transmutation
; non en vertu de principes abstraits, mais en tant que fait d' exp&eacute;rience
effective et r&eacute;alisable.
<p><b>4 --- L'Unit&eacute; de la Mati&egrave;re.</b>
<p><b>Les Multiples de l'Hydrog&egrave;ne et les El&eacute;ments Polym&egrave;res.</b>
<p>&nbsp;&nbsp;&nbsp; Assur&eacute;ment, cette notion de l'existence d&eacute;finitive
et immuable de soixante-six &eacute;l&eacute;ments distincts, tels que
nous les admettons aujourd' hui, ne serait jamais venue &agrave; l’id&eacute;e
d’un philosophe ancien; ou bien il l’e&ucirc;t rejet&eacute;e aussit&ocirc;t
comme ridicule: il a fallu qu’elle s’impos&acirc;t &agrave; nous, par la
force in&eacute;luctable de la m&eacute;thode exp&eacute;rimentale. Est-ce
&agrave; dire cependant que telle soit la limite d&eacute;finitive de nos
conceptions et de nos esp&eacute;rances ? Non, sans doute: en r&eacute;alit&eacute;,
cette limite n’a jamais &eacute;t&eacute; accept&eacute;e par les chimistes
que comme un fait actuel, qu’ils ont toujours conserv&eacute; l’espoir
de d&eacute;passer. De longs travaux ont &eacute;t&eacute; entrepris &agrave;
cet &eacute;gard, soit pour ramener tous les &eacute;quivalents des corps
simples &agrave; une m&ecirc;me s&eacute;rie de valeurs num&eacute;riques,
dont ils seraient les multiples; soit pour les grouper en familles naturelles
; soit pour les distribuer dans celles-ci, suivant des progressions arithm&eacute;tiques.
Aujourd’hui m&ecirc;me, les uns, s’attachant &agrave; la conception atomique,
regardent nos corps pr&eacute;tendus simples comme form&eacute;s par l’association
d’un certain nombre d’&eacute;l&eacute;ments analogues; peut- &ecirc;tre
comme engendr&eacute;s par la condensation d’un seul d’entre eux, l’hydrog&egrave;ne
par exemple, celui dont le poids atomique est le plus petit de tous. On
sait en effet que les corps simples sont caract&eacute;ris&eacute;s chacun
par un nombre fondamental, que l’on appelle son &eacute;quivalent ou son
poids atomique. Ce nombre repr&eacute;sente la masse chimique de l’&eacute;l&eacute;ment,
le poids invariable sous lequel il entre en combinaison et s’associe aux
autres &eacute;l&eacute;ments, parfois d’apr&egrave;s des proportions multiples.
C’est ce poids constant qui passe de compos&eacute; en compos&eacute;,
dans les substitutions, d&eacute;compositions et r&eacute;actions diverses,
sans &eacute;prouver jamais la plus petite variation. La combinaison ne
s’op&egrave;re donc pas suivant une progression continue, mais suivant
des rapports entiers, multiples les uns des autres, et qui varient par
sauts brusques. De l&agrave;, pour chaque &eacute;l&eacute;ment, l’id&eacute;e
d’une mol&eacute;cule d&eacute;termin&eacute;e, caract&eacute;ris&eacute;e
par son poids, et peut-&ecirc;tre aussi par sa forme g&eacute;om&eacute;trique.
Cette mol&eacute;cule demeurant indestructible, au moins dans toutes les
exp&eacute;riences accomplies jusqu’ici, elle a pu &ecirc;tre regard&eacute;e
comme identique avec l’atome de D&eacute;mocrite et d'&eacute;picure. Telle
est la base de la th&eacute;orie atomique de notre temps. Ainsi chaque
corps simple serait constitu&eacute; par un atome sp&eacute;cial, par une
certaine particule mat&eacute;rielle ins&eacute;cable. Les forces physiques,
aussi bien que les forces chimiques, ne sauraient faire &eacute;prouver
&agrave; cet atome que des mouvements d’ensemble, sans possibilit&eacute;
de vibrations internes; celles-ci ne pouvant exister que dans un syst&egrave;me
form&eacute; de plusieurs parties. Il en r&eacute;sulte encore qu’il ne
peut y avoir dans l’int&eacute;rieur d’un atome indivisible aucune r&eacute;serve
d’&eacute;nergie immanente. Telles sont les cons&eacute;quences rigoureuses
de la th&eacute;orie atomique. Je me borne &agrave; les exposer et je n’ai
pas &agrave; discuter ici si ces cons&eacute;quences ne d&eacute;passent
pas les pr&eacute;misses, les faits positifs qui leur servent de base ;
c’est-&agrave;-dire si les faits autorisent &agrave; conclure non seulement
&agrave; l’existence de certaines masses mol&eacute;culaires d&eacute;termin&eacute;es,
caract&eacute;ristiques des corps simples, et que tous les chimistes admettent
; mais aussi &agrave; attribuer &agrave; ces mol&eacute;cules le nom et
les propri&eacute;t&eacute;s des atomes absolus, comme le font un certain
nombre de savants. Ces r&eacute;serves sont d’autant plus opportunes que
les partisans modernes de la th&eacute;orie atomique l’ont presque aussit&ocirc;t
r&eacute;pudi&eacute;e dans les interpr&eacute;tations qu’ils ont donn&eacute;es
de la constitution des corps simples: interpr&eacute;tations aussi hypoth&eacute;tiques
d’ailleurs que l’existence m&ecirc;me des atomes absolus, mais qui attestent
l’effort continu de l’esprit humain pour aller au del&agrave; de toute
explication d&eacute;montr&eacute;e des ph&eacute;nom&egrave;nes, aussit&ocirc;t
qu’une semblable explication a &eacute;t&eacute; atteinte, et pour s’&eacute;lancer
plus loin vers des imaginations nouvelles. Retra&ccedil;ons cette histoire
: s’il ne s’agit plus d’une doctrine positive, cependant l’expos&eacute;
que nous allons faire offre l’int&eacute;r&ecirc;t qui s’attache aux conceptions
par lesquelles l’intelligence essaie de repr&eacute;senter le syst&egrave;me
g&eacute;n&eacute;ral de la nature. Nous retrouvons ici des vues analogues
&agrave; celles des pythagoriciens, alors qu’ils pr&eacute;tendaient encha&icirc;ner
dans un m&ecirc;me syst&egrave;me les propri&eacute;t&eacute;s r&eacute;elles
des &ecirc;tres et les propri&eacute;t&eacute;s myst&eacute;rieuses des
nombres. Le premier et principal effort qui ait &eacute;t&eacute; tent&eacute;
dans cette voie, consiste &agrave; ramener les &eacute;quivalents ou poids
atomiques de tous les &eacute;l&eacute;ments &agrave; une m&ecirc;me unit&eacute;
fondamentale. C’est l&agrave; une conception a priori, qui a donn&eacute;
lieu &agrave; une multitude d’exp&eacute;riences, destin&eacute;es &agrave;
la v&eacute;rifier. Si le fruit th&eacute;orique &agrave; ce point de vue
en a &eacute;t&eacute; minime, sinon m&ecirc;me n&eacute;gatif; en pratique,
du moins, ces travaux ont eu un r&eacute;sultat scientifique tr&egrave;s
utile: ils ont fix&eacute; avec une extr&ecirc;me pr&eacute;cision les
&eacute;quivalents r&eacute;els de nos &eacute;l&eacute;ments; c’est-&agrave;-dire,
je le r&eacute;p&egrave;te, les poids exacts suivant lesquels les &eacute;l&eacute;ments
entrent en combinaison et se substituent les uns aux autres. Prout, chimiste
anglais, avait propos&eacute; tout d’abord de prendre le poids m&ecirc;me
de l’un de nos &eacute;l&eacute;ments, celui de l’hydrog&egrave;ne, comme
unit&eacute;; dans la supposition que les poids atomiques de tous les autres
corps simples en &eacute;taient des multiples. Cette hypoth&egrave;se,
embrass&eacute;e et soutenue pendant quelque temps par M Dumas, r&eacute;duit
toute la th&eacute;orie &agrave; une extr&ecirc;me simplicit&eacute;. En
effet, tous les corps simples seraient d&egrave;s lors constitu&eacute;s
par les arrangements divers de l’atome du plus l&eacute;ger d’entre eux.
Malheureusement, elle n’a pas r&eacute;sist&eacute; au contr&ocirc;le exp&eacute;rimental,
c’est-&agrave;-dire &agrave; la d&eacute;termination exacte, par analyse
et par synth&egrave;se, des poids atomiques vrais de nos corps simples.
Cette d&eacute;termination a fourni, &agrave; c&ocirc;t&eacute; de quelques
poids atomiques &agrave; peu pr&egrave;s identiques avec les multiples
de l’hydrog&egrave;ne, une multitude d’autres nombres interm&eacute;diaires.
Mais dans les conceptions th&eacute;oriques, pas plus que dans la vie pratique,
l’homme ne renonce pas facilement &agrave; ses esp&eacute;rances. Pour
soutenir la supposition de Prout, ses partisans ont essay&eacute; d’abord
de r&eacute;duire &agrave; moiti&eacute;, puis au quart, l’unit&eacute;
fondamentale. Or, &agrave; ce terme, une objection se pr&eacute;sente :
c’est que les v&eacute;rifications concluantes deviennent impossibles.
En effet, nos exp&eacute;riences n’ont pas, quoi que nous fassions, une
pr&eacute;cision absolue; et il est clair que toute conjecture num&eacute;rique
serait acceptable, si l’on pla&ccedil;ait l’unit&eacute; commune des poids
atomiques au del&agrave; de la limite des erreurs que nous ne pouvons &eacute;viter.
Ce n’est pas tout d’ailleurs; le fond m&ecirc;me du syst&egrave;me est
atteint par cette supposition. La r&eacute;duction du nombre fondamental,
au-dessous d’une unit&eacute; &eacute;gale au poids atomique de l’hydrog&egrave;ne,
enl&egrave;ve &agrave; la th&eacute;orie ce caract&egrave;re pr&eacute;cis
et s&eacute;duisant, en vertu duquel tous les &eacute;l&eacute;ments &eacute;taient
regard&eacute;s comme form&eacute;s en d&eacute;finitive par de l’hydrog&egrave;ne
plus ou moins condens&eacute;. Il faudrait reculer dans l’inconnu jusqu’&agrave;
un &eacute;l&eacute;ment nouveau, quatre fois plus l&eacute;ger, &eacute;l&eacute;ment
inconnu qui formerait par sa condensation l’hydrog&egrave;ne lui-m&ecirc;me.
Encore cela ne suffit-il pas pour repr&eacute;senter rigoureusement les
exp&eacute;riences. En effet, M Stas, par des &eacute;tudes d’une exactitude
incomparable, a montr&eacute; que le syst&egrave;me r&eacute;duit &agrave;
ces termes, c’est-&agrave;-dire r&eacute;duit &agrave; prendre comme unit&eacute;
un sous-multiple peu &eacute;lev&eacute; du poids de l’hydrog&egrave;ne,
le syst&egrave;me, dis-je, ne peut &ecirc;tre d&eacute;fendu. Les observations
extr&ecirc;mement pr&eacute;cises qu’il a ex&eacute;cut&eacute;es ont prouv&eacute;
sans r&eacute;plique que les poids atomiques des &eacute;l&eacute;ments
ne sont pas exprim&eacute;s par des nombres simples, c’est-&agrave;-dire
li&eacute;s entre eux par des rapports entiers rigoureusement d&eacute;finis.
La th&eacute;orie des multiples de l’hydrog&egrave;ne n’est donc pas soutenable,
dans son sens strict et rigoureux. Gardons-nous cependant d’une n&eacute;gation
trop absolue. Si l’hypoth&egrave;se qui admet les &eacute;quivalents des
&eacute;l&eacute;ments multiples les uns des autres ne peut pas &ecirc;tre
affirm&eacute;e d’une fa&ccedil;on absolue, cependant cette hypoth&egrave;se
a pour elle des observations singuli&egrave;res et qui r&eacute;clament,
en tout &eacute;tat de cause, une interpr&eacute;tation. &agrave; cet &eacute;gard
les faits que je vais citer donnent &agrave; r&eacute;fl&eacute;chir.
<p><b>5 - Les El&eacute;ments Isom&egrave;res et Polym&egrave;res.</b>
<p>&nbsp;&nbsp;&nbsp; Il existe en r&eacute;alit&eacute; certains &eacute;l&eacute;ments,
comparables entre eux, et qui poss&egrave;dent en m&ecirc;me temps des
poids atomiques identiques. Tels sont le cobalt et le nickel, par exemple.
Ces deux m&eacute;taux sont semblables par la plupart de leurs propri&eacute;t&eacute;s
et ils produisent deux s&eacute;ries de compos&eacute;s parall&egrave;les,
en s’unissant avec les autres &eacute;l&eacute;ments. Or ici interviennent
de nouvelles et plus puissantes analogies. En effet un tel parall&eacute;lisme
dans les r&eacute;actions de deux corps et dans celles de leurs compos&eacute;s,
joint &agrave; l’identit&eacute; de leurs poids atomiques, n’est pas sans
exemple dans la science: en particulier, il n’est pas rare de le rencontrer
dans l’&eacute;tude des principes organiques, tels que les carbures d’hydrog&egrave;ne,
les essences de t&eacute;r&eacute;benthine et de citron, par exemple ;
ou bien encore les acides tartrique et paratartrique. Ces deux essences,
ces deux acides sont form&eacute;s des m&ecirc;mes &eacute;l&eacute;ments,
unis dans les m&ecirc;mes proportions et avec la m&ecirc;me condensation,
mais pourtant avec un arrangement diff&eacute;rent. En outre, les deux
carbures, les deux acides sont susceptibles d’engendrer des combinaisons
parall&egrave;les: c’est l&agrave; ce que nous appellons des corps isom&egrave;res.
Or le nickel et le cobalt se comportent pr&eacute;cis&eacute;ment de la
m&ecirc;me mani&egrave;re. Il est certainement &eacute;trange de trouver
un semblable rapprochement entre des principes compos&eacute;s, tels que
des carbures ou les acides, et ces deux m&eacute;taux, ces deux corps r&eacute;put&eacute;s
simples: comme si les deux pr&eacute;tendus corps simples &eacute;taient
form&eacute;s, eux aussi, par les arrangements diff&eacute;rents de certaines
mati&egrave;res &eacute;l&eacute;mentaires, plus simples qu’eux-m&ecirc;mes.
L’or, le platine et l’iridium, autres m&eacute;taux qui constituent un
m&ecirc;me groupe, offrent un rapprochement num&eacute;rique pareil, quoique
moins &eacute;troit dans leurs d&eacute;riv&eacute;s, que celui du cobalt
et du nickel. Dans les cas de ce genre, il semble, je le r&eacute;p&egrave;te,
que l’on ait affaire &agrave; de certaines mati&egrave;res fondamentales,
identiques quant &agrave; leur nature, mais diversifi&eacute;es quant au
d&eacute;tail de leurs arrangements int&eacute;rieurs et de leurs manifestations.
N&eacute;anmoins, pour &ecirc;tre fid&egrave;le aux r&egrave;gles de la
saine m&eacute;thode scientifique, il importe d’ajouter aussit&ocirc;t
que jusqu’ici les chimistes n’ont jamais pu changer, par aucun proc&eacute;d&eacute;,
ni le cobalt en nickel, ni l’or en platine ou en iridium. Poursuivons ces
rapprochements: ils s’&eacute;tendent plus loin. En effet, &agrave; c&ocirc;t&eacute;
des &eacute;l&eacute;ments isom&egrave;res viennent se ranger d’autres
&eacute;l&eacute;ments, dont les poids atomiques ne sont pas identiques,
mais li&eacute;s dans un m&ecirc;me groupe par des relations num&eacute;riques
simples, et multiples les uns des autres. L’oxyg&egrave;ne, par exemple,
peut &ecirc;tre compar&eacute; au soufre, dans les combinaisons de ces
deux &eacute;l&eacute;ments avec l’hydrog&egrave;ne et avec les m&eacute;taux.
L’eau et l’hydrog&egrave;ne sulfur&eacute;, les oxydes et les sulfures
constituent deux s&eacute;ries de compos&eacute;s parall&egrave;les. Le
soufre peut m&ecirc;me &ecirc;tre rapproch&eacute; plus strictement encore
du s&eacute;l&eacute;nium et du tellure: ce sont l&agrave; des &eacute;l&eacute;ments
comparables, formant, je le r&eacute;p&egrave;te, des combinaisons parall&egrave;les
avec l’hydrog&egrave;ne, avec les m&eacute;taux et m&ecirc;me avec l’oxyg&egrave;ne
et la plupart des autres &eacute;l&eacute;ments. Or, l’analogie chimique
de ces &eacute;l&eacute;ments se retrouve dans la comparaison num&eacute;rique
de leurs poids atomiques: le poids atomique du soufre est sensiblement
double de l’oxyg&egrave;ne; celui du s&eacute;l&eacute;nium en est presque
quintuple, et celui du tellure est huit fois aussi consid&eacute;rable
que celui de l’oxyg&egrave;ne, c’est-&agrave;-dire quadruple de celui du
soufre. Ici encore nous retrouvons des analogies remarquables dans l’&eacute;tude
des combinaisons des carbures d’hydrog&egrave;ne. Ces poids atomiques d’&eacute;l&eacute;ments
multiples les uns des autres rappellent les corps polym&egrave;res, c’est-&agrave;-dire
les compos&eacute;s condens&eacute;s de la chimie organique. On conna&icirc;t
en effet des carbures d’hydrog&egrave;ne, form&eacute;s des m&ecirc;mes
&eacute;l&eacute;ments unis dans la m&ecirc;me proportion relative, mais
tels que leurs poids mol&eacute;culaires et leurs densit&eacute;s gazeuses
soient multiples les uns des autres. La benzine et l’ac&eacute;tyl&egrave;ne,
par exemple, sont des carbures d’hydrog&egrave;ne de cet ordre: ils sont
form&eacute;s tous deux par l’association d’une partie en poids d’hydrog&egrave;ne
avec six parties de carbone. Mais la vapeur de la benzine, sous le m&ecirc;me
volume, est trois fois aussi lourde que celle de l’ac&eacute;tyl&egrave;ne.
Ce n’est pas tout: la benzine d&eacute;rive de l’ac&eacute;tyl&egrave;ne,
par une condensation directe: elle en est le polym&egrave;re. R&eacute;ciproquement,
nous savons transformer par exp&eacute;rience ces compos&eacute;s polym&egrave;res
dans un sens inverse, revenir du carbure condens&eacute; &agrave; son g&eacute;n&eacute;rateur
; nous savons transformer notamment la benzine en ac&eacute;tyl&egrave;ne,
par la chaleur et par l’&eacute;lectricit&eacute;. Cette ressemblance entre
les carbures polym&egrave;res et les corps simples &agrave; poids atomiques
multiples sugg&egrave;re aussit&ocirc;t l’esp&eacute;rance de transformations
du m&ecirc;me ordre. Si nous modifions les carbures d’hydrog&egrave;ne,
pourquoi ne pourrions-nous pas modifier aussi les corps simples qui offrent
des relations num&eacute;riques analogues ? Pourquoi ne pourrions-nous
pas former le soufre avec l’oxyg&egrave;ne, former le s&eacute;l&eacute;nium
et le tellure avec le soufre, par des proc&eacute;d&eacute;s de condensation
convenables ? Pourquoi le tellure, le s&eacute;l&eacute;nium ne pourraient-ils
pas &ecirc;tre chang&eacute;s inversement en soufre, et celui-ci &agrave;
son tour m&eacute;tamorphos&eacute; en oxyg&egrave;ne ? Rien, en effet,
ne s’y oppose a priori: toute fois, et la chose est essentielle, l’&eacute;preuve
exp&eacute;rimentale, souvent essay&eacute;e, a &eacute;chou&eacute; jusqu’&agrave;
pr&eacute;sent. Ce crit&eacute;rium est empirique, dira-t-on; il ne repose
sur aucune d&eacute;monstration n&eacute;cessaire et d&egrave;s lors son
caract&egrave;re est purement provisoire. Sans doute; mais il en est ainsi
de la plupart de nos lois, sinon m&ecirc;me de toutes. L’exp&eacute;rience
r&eacute;alis&eacute;e est le seul crit&eacute;rium certain de la science
moderne: c’est la seule barri&egrave;re qui nous garantisse contre le retour
des r&ecirc;veries mystiques d’autrefois. On peut cependant pousser plus
loin la d&eacute;monstration: car il existe une diff&eacute;rence positive
et fondamentale entre la constitution physique des carbures polym&egrave;res,
ou radicaux compos&eacute;s de la chimie organique, et celle des &eacute;l&eacute;ments
proprement dits, ou radicaux v&eacute;ritables de la chimie min&eacute;rale
: cette diff&eacute;rence est fond&eacute;e sur les observations des physiciens
relatives aux chaleurs sp&eacute;cifiques. D’apr&egrave;s leurs mesures,
la quantit&eacute; de chaleur n&eacute;cessaire pour produire un m&ecirc;me
effet, une m&ecirc;me variation de temp&eacute;rature, sur les carbures
d’hydrog&egrave;ne, cro&icirc;t proportionnellement &agrave; leur poids
mol&eacute;culaire. Pour la benzine gazeuse, par exemple, il faut trois
fois autant de chaleur que pour l’ac&eacute;tyl&egrave;ne, pris sous le
m&ecirc;me volume. Or, le contraire arrive pour les corps simples multiples
les uns des autres: lorsqu’on les prend sous le m&ecirc;me volume gazeux,
ou plus g&eacute;n&eacute;ralement sous leurs poids mol&eacute;culaires
respectifs, la quantit&eacute; de chaleur qui produit une m&ecirc;me variation
de temp&eacute;rature dans les corps simples v&eacute;ritables demeure
exactement la m&ecirc;me. Par exemple, un litre d’hydrog&egrave;ne et un
litre d’azote absorbent la m&ecirc;me quantit&eacute; de chaleur: identit&eacute;
d’autant plus frappante que le poids du second gaz est quatorze fois aussi
consid&eacute;rable que celui du premier. Le travail de la chaleur est
donc bien diff&eacute;rent dans les deux cas, suivant qu’il s’agit des
corps simples et des corps compos&eacute;s, et il &eacute;tablit une diversit&eacute;
essentielle entre les vrais &eacute;l&eacute;ments chimiques, tels que
nous les connaissons aujourd’hui, et les polym&egrave;res effectifs, c’est-&agrave;-dire
les corps obtenus par la condensation exp&eacute;rimentale d’un m&ecirc;me
radical compos&eacute;. Assur&eacute;ment il y a l&agrave; quelque chose
d’un ordre tout particulier; il existe une propri&eacute;t&eacute; fondamentale,
tenant &agrave; la constitution m&eacute;canique des derni&egrave;res particules
des corps, qui diff&eacute;rencie nos &eacute;l&eacute;ments pr&eacute;sents
des corps compos&eacute;s proprement dits: c’est l&agrave; une distinction
dont nous n’avons pas encore sond&eacute; toute la profondeur.
<p><b>6 - Les Familles Naturelles des El&eacute;ments.</b>
<p>&nbsp;&nbsp;&nbsp; Cependant il existe une autre notion, connexe avec
la pr&eacute;c&eacute;dente et non moins remarquable, qui concourt &agrave;
entretenir nos esp&eacute;rances sur la g&eacute;n&eacute;ration synth&eacute;tique
des &eacute;l&eacute;ments: c’est leur classification en familles naturelles,
classification tent&eacute;e d’abord par Amp&egrave;re, pr&eacute;cis&eacute;e
par Dumas, et qui a pris une importance croissante dans ces derni&egrave;res
ann&eacute;es. Citons d’abord un exemple tr&egrave;s caract&eacute;ristique,
je veux parler de la famille des chloro&iuml;des: elle comprend trois termes
indubitables: le chlore, le brome, l’iode. Ces trois &eacute;l&eacute;ments,
par leurs combinaisons avec les m&eacute;taux et les autres corps, forment
trois s&eacute;ries de compos&eacute;s parall&egrave;les, sym&eacute;triques
dans leurs formules et qui offrent souvent le m&ecirc;me volume mol&eacute;culaire
et la m&ecirc;me forme cristalline. Au point de vue chimique, rien n’est
plus semblable &agrave; l’acide chlorhydrique, que les acides bromhydrique
et iodhydrique: ce sont trois acides puissants, engendr&eacute;s pareillement
par l’union &agrave; volumes &eacute;gaux des gaz simples qui les composent.
Le chlorure, le bromure, l’iodure de potassium, sont aussi extr&ecirc;mement
analogues, cristallis&eacute;s dans le m&ecirc;me syst&egrave;me, etc.
Les propri&eacute;t&eacute;s physiques de ces trois &eacute;l&eacute;ments
sont tant&ocirc;t les m&ecirc;mes, et tant&ocirc;t elles varient d’une
fa&ccedil;on r&eacute;guli&egrave;re. Pour n’en citer qu’une seule et des
plus apparentes, je rappellerai que le chlore est jaune et gazeux, le brome
rouge et liquide, l’iode violet et solide.
<p>&nbsp;&nbsp;&nbsp; Or, les poids mol&eacute;culaires, c’est-&agrave;-dire
les condensations de mati&egrave;re sous la forme gazeuse, vont en croissant
de l’un &agrave; l’autre de ces trois &eacute;l&eacute;ments. En effet
leurs &eacute;quivalents ou poids atomiques respectifs, poids proportionnels
aux condensations gazeuses, sont &eacute;gaux &agrave; 35, 5 pour le chlore,
&agrave; 80 pour le brome, &agrave; 127 pour l iode. Non seulement les
poids croissent ainsi par degr&eacute;s; mais ces degr&eacute;s offrent
une certaine r&eacute;gularit&eacute;: l’&eacute;quivalent ou poids atomique
du brome &eacute;tant &agrave; peu pr&egrave;s la moyenne entre ceux du
chlore et de l’iode. Le groupe entier constitue ce que l’on a appel&eacute;
une triade. Des remarques analogues ont &eacute;t&eacute; faites pour d’autres
groupes d’&eacute;l&eacute;ments: par exemple, pour la famille des sulfuro&iuml;des,
constitu&eacute;e par l’oxyg&egrave;ne, le soufre, le s&eacute;l&eacute;nium
et le tellure, &eacute;l&eacute;ments dont les &eacute;quivalents ou poids
atomiques sont &agrave; peu pr&egrave;s multiples d’une m&ecirc;me unit&eacute;.
Ces &eacute;l&eacute;ments s’unissent avec l’hydrog&egrave;ne, en formant
des compos&eacute;s gazeux, compos&eacute;s acides pour les trois derniers,
et, dans tous les cas, renfermant leur propre volume d’hydrog&egrave;ne.
Ces &eacute;l&eacute;ments se combinent pareillement aux m&eacute;taux.
Le groupe form&eacute; par l’azote, le phosphore, l’<i>arsenic</i> et l’antimoine
constitue une troisi&egrave;me famille, non moins caract&eacute;ris&eacute;e,
celle des azoto&iuml;des, dont les compos&eacute;s hydrog&eacute;n&eacute;s
sont aussi des gaz, mais contiennent une fois et demie leur volume d’hydrog&egrave;ne.
Les poids atomiques croissent aussi suivant une progression r&eacute;guli&egrave;re.
C’est ainsi que l’on a &eacute;t&eacute; conduit &agrave; une v&eacute;ritable
classification, assemblant les corps simples suivant des principes de similitude
pareils &agrave; ceux que les naturalistes invoquent dans l’&eacute;tude
des trois r&egrave;gnes de la nature. Cette classification semble m&ecirc;me
plus &eacute;troite en chimie, parce que les analogies g&eacute;n&eacute;rales,
toujours un peu &eacute;lastiques en histoire naturelle, sont corrobor&eacute;es
ici par la comparaison des nombres absolus qui repr&eacute;sentent les
poids mol&eacute;culaires: comme si chaque famille d’&eacute;l&eacute;ments
&eacute;tait engendr&eacute;e en vertu d’une loi g&eacute;n&eacute;ratrice
commune. Avant d’aller plus loin, je dois dire que je d&eacute;veloppe
ces rapprochements num&eacute;riques et cette notion de la g&eacute;n&eacute;ration
des &eacute;l&eacute;ments, en prenant soin de leur conserver toute leur
force et sans les affaiblir en rien. Cependant, ce serait tromper le lecteur
que de ne pas l’avertir que le doute s’&eacute;l&egrave;ve, lorsqu’on pr&eacute;cise
tout &agrave; fait. En r&eacute;alit&eacute;, les rapprochements sur lesquels
reposent de telles esp&eacute;rances ne sont pas d’une rigueur absolue,
mais seulement approximatifs. Ce sont donc l&agrave; des &agrave; peu pr&egrave;s,
plut&ocirc;t que des d&eacute;monstrations; ce sont des lueurs singuli&egrave;res,
peut-&ecirc;tre r&eacute;elles et de nature &agrave; nous &eacute;clairer
sur la constitution v&eacute;ritable de nos corps simples; mais peut-&ecirc;tre
aussi sont-elles trompeuses, peut-&ecirc;tre r&eacute;sultent-elles uniquement
du jeu &eacute;quivoque des combinaisons num&eacute;riques. En somme, je
pense qu’il est permis d’y voir, sans sortir d’une sage r&eacute;serve,
l’indice de quelque loi de la nature, masqu&eacute;e par des perturbations
secondaires qui sont rest&eacute;es jusqu’ici inexpliqu&eacute;es: &agrave;
mon avis, ce genre de rapprochements ne doit pas &ecirc;tre &eacute;cart&eacute;.
Mais, je le r&eacute;p&egrave;te, il serait p&eacute;rilleux de s’y attacher
trop fortement et de les regarder comme d&eacute;finitivement acquis. L’histoire
des sciences prouve que l’esprit humain, une fois qu’il accepte l’&agrave;
peu pr&egrave;s comme une d&eacute;monstration, dans les th&eacute;ories
positives des ph&eacute;nom&egrave;nes naturels et surtout dans les combinaisons
num&eacute;riques, d&eacute;rive bien vite vers les fantaisies arbitraires
de l’imagination.
<p><b>7 - Les S&eacute;ries P&eacute;riodiques.</b>
<p>&nbsp;&nbsp;&nbsp; Un pas de plus a &eacute;t&eacute; franchi dans cette
voie; une tentative hardie, touchant peut-&ecirc;tre &agrave; la chim&egrave;re,
a &eacute;t&eacute; faite pour construire des s&eacute;ries num&eacute;riques,
qui comprennent tous les corps simples actuels dans leur r&eacute;seau
et qui pr&eacute;tendent m&ecirc;me embrasser tous les corps simples susceptibles
d’&ecirc;tre d&eacute;couverts dans l’avenir. Je veux parler des s&eacute;ries
p&eacute;riodiques parall&egrave;les, ou pour employer un langage plus
franc et plus pr&eacute;cis, des progressions arithm&eacute;tiques, suivant
lesquelles M Chancourtois d’abord, puis Mm Newlands, Lothar Meyer et Mendeleef
ont cherch&eacute; de nos jours &agrave; grouper tous les nombres qui expriment
les poids atomiques de nos &eacute;l&eacute;ments, ou des corps pr&eacute;tendus
tels. C’est encore par l’&eacute;tude des s&eacute;ries de la chimie organique
que l’on a &eacute;t&eacute; conduit &agrave; de telles progressions arithm&eacute;tiques.
La chimie organique, en effet, est coordonn&eacute;e autour d’un certain
nombre de grandes s&eacute;ries de corps, li&eacute;s les uns aux autres
dans chaque s&eacute;rie par des lois pr&eacute;cises; je dis li&eacute;s
non seulement par leur formule et leurs propri&eacute;t&eacute;s, mais
aussi par leur g&eacute;n&eacute;ration effective. Les corps compris dans
chacune de ces s&eacute;ries peuvent &ecirc;tre form&eacute;s au moyen
d’un seul carbure d’hydrog&egrave;ne fondamental; les autres termes en
d&eacute;rivent m&eacute;thodiquement, par des additions ou des substitutions
successives d’&eacute;l&eacute;ments. Le syst&egrave;me des d&eacute;riv&eacute;s
d’un carbure rappelle, et m&ecirc;me avec plus de richesse, le syst&egrave;me
des d&eacute;riv&eacute;s d’un m&eacute;tal simple en chimie min&eacute;rale.
Il y a plus: ici intervient une nouvelle donn&eacute;e. Les carbures fondamentaux
ne sont pas des &ecirc;tres isol&eacute;s et ind&eacute;pendants les uns
des autres. En fait, ils peuvent &ecirc;tre rang&eacute;s &agrave; leur
tour par groupes r&eacute;guliers, ou s&eacute;ries dites homologues, s&eacute;ries
dont les termes semblables diff&egrave;rent deux &agrave; deux par des
&eacute;l&eacute;ments constants en nature, en nombre, et par cons&eacute;quent
en poids: la diff&eacute;rence num&eacute;rique invariable de ces poids
&eacute;gale g&eacute;n&eacute;ralement 14. Ces relations g&eacute;n&eacute;rales
sont certaines en chimie organique. Elles coordonnent, non seulement les
formules, mais aussi les propri&eacute;t&eacute;s physiques et chimiques
des carbures d’hydrog&egrave;ne et de leurs d&eacute;riv&eacute;s. D&egrave;s
lors c’&eacute;tait une id&eacute;e toute naturelle, et qui a d&ucirc;
se pr&eacute;senter &agrave; plus d’un esprit, que celle de distribuer
l’ensemble des &eacute;l&eacute;ments min&eacute;raux suivant un principe
de classification analogue, et fond&eacute; de m&ecirc;me sur un syst&egrave;me
de diff&eacute;rences constantes. Telle est, en effet, la base des s&eacute;ries
dites p&eacute;riodiques. On dresse aujourd’hui en chimie min&eacute;rale
des tableaux semblables &agrave; ceux de la chimie organique; on y assemble
les &eacute;l&eacute;ments, m&eacute;taux et m&eacute;tallo&iuml;des, comme
les carbures d’hydrog&egrave;ne. Il y a pourtant cette diff&eacute;rence,
que les groupes des carbures d’hydrog&egrave;ne sont construits a posteriori
et d’apr&egrave;s les exp&eacute;riences synth&eacute;tiques et positives
de la chimie organique; tandis que les nouveaux groupes d’&eacute;l&eacute;ments
min&eacute;raux sont form&eacute;s a priori et par voie purement hypoth&eacute;tique.
Quoiqu’il en soit, une sorte de table &agrave; deux entr&eacute;es a &eacute;t&eacute;
construite: elle comprend tous nos &eacute;l&eacute;ments connus, class&eacute;s
selon certaines progressions arithm&eacute;tiques. Les familles naturelles
des &eacute;l&eacute;ments, telles qu’elles ont &eacute;t&eacute; d&eacute;finies
plus haut, font la base de cette classification. Rappelons d’abord la famille
des chloro&iuml;des: elle comprend le chlore, le brome, l’iode, auxquels
on a adjoint le fluor, premier terme un peu divergent. En fait, les diff&eacute;rences
num&eacute;riques entre les poids atomiques de ces quatre &eacute;l&eacute;ments
sont repr&eacute;sent&eacute;es par les chiffres suivants: 16, 5; 44, 5
et 47. Ces trois diff&eacute;rences constituent &agrave; peu pr&egrave;s
une progression, dont la raison serait le nombre 16, ou bien le nombre
15. De m&ecirc;me la famille des sulfuro&iuml;des, laquelle comprend l’oxyg&egrave;ne,
le soufre, le s&eacute;l&eacute;nium et le tellure, offre les trois diff&eacute;rences
que voici entre les poids atomiques de ses termes successifs: 16; 47, 6;
47, 8; nombres &agrave; tr&egrave;s peu pr&egrave;s multiples de 16 : c’est
la m&ecirc;me raison que tout &agrave; l’heure. Le lithium, repr&eacute;sent&eacute;
par 7, le sodium par 23, le potassium par 39, 1, forment un troisi&egrave;me
groupe d’&eacute;l&eacute;ments, tous &eacute;l&eacute;ments m&eacute;talliques
cette fois: on y retrouve la m&ecirc;me diff&eacute;rence ou raison approximative,
&eacute;gale et 16. Venons &agrave; la famille des azoto&iuml;des, tels
que l’azote repr&eacute;sent&eacute; par 14, le phosphore par 31, l’arsenic
par 75, l’antimoine par 120. La raison de la progression serait ici comprise
entre 15 et 17, c’est-&agrave;-dire &agrave; peu pr&egrave;s la m&ecirc;me,
quoique toujours avec des &eacute;carts notables dans sa valeur absolue.
Je dis &agrave; peu pr&egrave;s, et c’est cet &agrave; peu pr&egrave;s
perp&eacute;tuel qui jette une ombre sur tout le syst&egrave;me. Mais poursuivons-en
le r&eacute;sum&eacute;, en nous pla&ccedil;ant &agrave; un nouveau point
de vue. La premi&egrave;re famille, celle des chloro&iuml;des, comprend
des &eacute;l&eacute;ments caract&eacute;ris&eacute;s par une propri&eacute;t&eacute;
chimique commune, qui domine toutes leurs combinaisons: ce sont des corps
monovalents, capables de se combiner de pr&eacute;f&eacute;rence &agrave;
volumes gazeux &eacute;gaux, c’est-&agrave;-dire &agrave; poids atomiques
&eacute;gaux, avec l’hydrog&egrave;ne et avec les m&eacute;taux. Au contraire
la seconde famille, celle des sulfuro&iuml;des, oxyg&egrave;ne, soufre
et analogues, contient surtout des corps bivalents, se combinant dans l’&eacute;tat
gazeux avec un volume d’hydrog&egrave;ne double du leur, et, d’une mani&egrave;re
plus g&eacute;n&eacute;rale, suivant des rapports de poids atomiques doubles.
&agrave; son tour, la famille qui renferme l’azote, le phosphore et les
&eacute;l&eacute;ments analogues est trivalente; chacun de ces &eacute;l&eacute;ments,
pris sous son poids atomique respectif, se combine avec trois atomes d’hydrog&egrave;ne
ou des autres &eacute;l&eacute;ments. Enfin, l’on distingue une autre s&eacute;rie
quadrivalente, form&eacute;e par le carbone, le silicium, l’&eacute;tain,
etc.
<p>&nbsp;&nbsp;&nbsp; Ces quatre s&eacute;ries, caract&eacute;ris&eacute;es
par les rapports de leurs combinaisons, embrassent une multitude de compos&eacute;s
connus. Elles rappellent certains groupes g&eacute;n&eacute;raux de carbures
d’hydrog&egrave;ne. En effet, les uns de ceux-ci, tels que l’&eacute;thyl&egrave;ne,
pris sous la forme gazeuse, sont susceptibles de se combiner avec un volume
&eacute;gal d’hydrog&egrave;ne, de chlore et des autres &eacute;l&eacute;ments.
D’autres carbures, tels que l’ac&eacute;tyl&egrave;ne, sont aptes &agrave;
se combiner de pr&eacute;f&eacute;rence avec un volume gazeux d’hydrog&egrave;ne,
de chlore, etc., double du leur. D’autres carbures s’unissent avec un volume
triple, ou quadruple des gaz &eacute;l&eacute;mentaires et sp&eacute;cialement
d’hydrog&egrave;ne, etc. Or, si l’on compare entre eux les carbures d’hydrog&egrave;ne
monovalents, bivalents, trivalents, on reconna&icirc;t qu’on peut les grouper
d’une fa&ccedil;on tr&egrave;s simple, en les rangeant par classes telles,
que dans une classe de carbures renfermant le m&ecirc;me nombre d’atomes
de carbone, les carbures cons&eacute;cutifs diff&egrave;rent les uns des
autres par deux &eacute;quivalents d’hydrog&egrave;ne et, par cons&eacute;quent,
par des poids atomiques croissant de 2 en 2 unit&eacute;s. Cette diff&eacute;rence
constante entre les termes primordiaux des diverses s&eacute;ries se retrouve
n&eacute;cessairement entre les termes suivants, c’est-&agrave;-dire entre
les termes des s&eacute;ries homologues compar&eacute;s entre eux. Les
carbures les plus l&eacute;gers par leur poids atomique, dans chaque classe
renfermant un nombre donn&eacute; d’atomes de carbone, sont en m&ecirc;me
temps les moins satur&eacute;s, ceux dont la valence est la plus consid&eacute;rable
; car la valence cro&icirc;t proportionnellement au nombre d’atomes d’hydrog&egrave;ne
unis avec une m&ecirc;me quantit&eacute; de carbone. Ces rapprochements
num&eacute;riques, cette classification dominent toute la chimie organique
et ils reposent sur l’exp&eacute;rience. Or, chose &eacute;trange ! Si
l’on compare les termes primordiaux de chacune des familles min&eacute;rales,
caract&eacute;ris&eacute;es par des valences distinctes; si l’on compare
entre eux, par exemple, les quatre &eacute;l&eacute;ments suivants: le
carbone quadrivalent et repr&eacute;sent&eacute; par un poids atomique
&eacute;gal &agrave; 12; l’azote trivalent et repr&eacute;sent&eacute;
par le poids atomique 14; l’oxyg&egrave;ne bivalent et repr&eacute;sent&eacute;
par 16; enfin le fluor monovalent et repr&eacute;sent&eacute; par 19 ;
on remarque aussit&ocirc;t que ces nombres diff&egrave;rent entre eux par
des valeurs num&eacute;riques progressivement croissantes, telles que 2,
2 et 3: soit en moyenne 2, diff&eacute;rence qui est aussi celle des carbures
d’hydrog&egrave;ne de valence in&eacute;gale. Cette diff&eacute;rence constante
des termes primordiaux se retrouve donc entre les termes corr&eacute;latifs
des diverses familles d’&eacute;l&eacute;ments, en chimie min&eacute;rale,
aussi bien qu’entre les carbures correspondant des familles homologues,
en chimie organique. Ce n’est pas tout. La famille du lithium, qui part
du nombre 7, et quelques autres, un peu artificielles peut-&ecirc;tre,
telles que celle du glucinium, qui part du nombre 9, et celle du bore,
qui part du nombre 11, fournissent autant de chefs de file compl&eacute;mentaires,
dont les poids atomiques croissent par 2 unit&eacute;s, et ach&egrave;vent
de combler les vides subsistant entre les multiples successifs du nombre
16, raison commune de toutes les progressions dans l’int&eacute;rieur de
chaque famille d’&eacute;l&eacute;ments. Nous avons ainsi deux progressions
fondamentales: d’une part, la grande progression, dont les termes croissent
comme les multiples de 16, et qui est applicable aux corps particuliers
compris dans chacune des familles; et, d’autre part, la petite progression,
croissant suivant les multiples de 2, et qui est applicable aux familles
elles-m&ecirc;mes, compar&eacute;es entre elles dans leurs termes correspondants.
En combinant ces deux progressions, on construit un tableau th&eacute;orique,
qui renferme l’ensemble des poids atomiques des corps simples, r&eacute;partis
sur la s&eacute;rie des nombres entiers, jusqu’&agrave; la limite des poids
atomiques les plus &eacute;lev&eacute;s. Tel est le syst&egrave;me: je
l’ai pr&eacute;sent&eacute; dans son ensemble, avec les artifices ing&eacute;nieux
de ses arrangements. Cependant, en r&eacute;alit&eacute;, les poids atomiques
des &eacute;l&eacute;ments des quatre familles fondamentales, comprenant
environ quinze &eacute;l&eacute;ments, sont les seuls qui se trouvent coordonn&eacute;s
suivant des relations tout &agrave; fait vraisemblables. On peut disposer
encore de m&ecirc;me certaines s&eacute;ries de m&eacute;taux, telles que
le groupe form&eacute; par le lithium, le sodium, le potassium. Cela fait,
il restait plus de la moiti&eacute; des &eacute;l&eacute;ments connus,
qui demeuraient en dehors de tout rapprochement pr&eacute;cis. Les auteurs
du syst&egrave;me n’ont pas h&eacute;sit&eacute; &agrave; les grouper aussi,
de fa&ccedil;on &agrave; les ranger, chacun &agrave; sa place, dans leur
tableau. Mais il est facile pour tout esprit non pr&eacute;venu de reconna&icirc;tre
que ce dernier groupement repose sur des comparaisons purement num&eacute;riques,
et qui sont loin d’avoir la m&ecirc;me solidit&eacute; que les pr&eacute;c&eacute;dentes,
si m&ecirc;me elles ne sont tout &agrave; fait arbitraires. Quoi qu’il
en soit, les rapprochements que le syst&egrave;me des s&eacute;ries p&eacute;riodiques
op&egrave;re ne se bornent pas l&agrave;. On sait en effet qu’il existe
entre les poids atomiques des corps, leurs volumes atomiques et leurs diff&eacute;rentes
propri&eacute;t&eacute;s physiques et chimiques, certaines relations g&eacute;n&eacute;rales.
<p>&nbsp;&nbsp;&nbsp; Ces relations ont &eacute;t&eacute; &eacute;tablies
depuis longtemps en chimie et ant&eacute;rieurement &agrave; toute disposition
des &eacute;l&eacute;ments en s&eacute;ries parall&egrave;les: elles n’en
d&eacute;pendent en rien, car elles r&eacute;sultent de l valeur absolue
des poids atomiques, et non de leurs diff&eacute;rences p&eacute;riodiques.
Cependant, comme ces relations sont la cons&eacute;quence imm&eacute;diate
des poids atomiques, les rapprochements &eacute;tablis entre ceux-ci se
retrouvent, par un contre-coup n&eacute;cessaire, entre leurs volumes atomiques
et entre toutes les autres propri&eacute;t&eacute;s corr&eacute;latives
de la masse chimique des &eacute;l&eacute;ments. De telle sorte que le
tableau des s&eacute;ries parall&egrave;les, une fois &eacute;tabli, comprend
en m&ecirc;me temps les propri&eacute;t&eacute;s physiques fondamentales
des &eacute;l&eacute;ments: comme le ferait d’ailleurs tout groupement,
quel qu’il f&ucirc;t, des m&ecirc;mes &eacute;l&eacute;ments. Cette circonstance
augmente la commodit&eacute; du nouveau tableau; quoiqu’elle n’apporte
aucune d&eacute;monstration nouvelle &agrave; l’existence des s&eacute;ries
p&eacute;riodiques: il faut se garder &agrave; cet &eacute;gard de toute
illusion. Mais passons outre et examinons les pr&eacute;visions d&eacute;duites
de la nouvelle classification. C’est ici surtout que le syst&egrave;me
devient int&eacute;ressant. On remarquera que dans les progressions arithm&eacute;tiques
qui comprennent chaque famille d’&eacute;l&eacute;ments, il manque certains
termes. Entre le soufre, 32, et le s&eacute;l&eacute;nium, 79 (c’est-&agrave;-dire
&agrave; peu pr&egrave;s 80), il devrait exister deux termes interm&eacute;diaires,
tels que 48 et 64. De m&ecirc;me entre le s&eacute;l&eacute;nium, 79, et
le tellure, 128, il manque 2 termes: 96 et 112. Il est clair que ce doivent
&ecirc;tre l&agrave; des &eacute;l&eacute;ments inconnus et qu’il convient
de rechercher. Mais comme le nombre en e&ucirc;t &eacute;t&eacute; trop
grand, les auteurs du syst&egrave;me, empress&eacute;s &agrave; combler
les vides de chaque famille, y ont d’abord intercal&eacute; des &eacute;l&eacute;ments
d&eacute;j&agrave; connus, quoique manifestement &eacute;trangers &agrave;
la famille, tels que le molybd&egrave;ne, 96, ins&eacute;r&eacute; entre
le s&eacute;l&eacute;nium et le tellure; le tungst&egrave;ne et l’uranium,
ajout&eacute;s pareillement &agrave; la suite. &agrave; la s&eacute;rie
du lithium, 7, ils ont &eacute;galement ajout&eacute; en t&ecirc;te l’hydrog&egrave;ne,
1, et &agrave; la fin le cuivre, 63, puis l’argent, 108, et l’or, 197.
Tout ceci touche &agrave; la fantaisie. De m&ecirc;me, entre le chlore
et le brome, entre le brome et l’iode, il manque certains termes des progressions
arithm&eacute;tiques fondamentales: ce sont encore l&agrave; des &eacute;l&eacute;ments
hypoth&eacute;tiques et &agrave; d&eacute;couvrir. Observons ici que leurs
propri&eacute;t&eacute;s ne sont pas ind&eacute;termin&eacute;es. En effet,
les propri&eacute;t&eacute;s physiques ou chimiques d’un &eacute;l&eacute;ment
inconnu, ou du moins certaines d’entre elles peuvent &ecirc;tre pr&eacute;vues
et m&ecirc;me calcul&eacute;es a priori , d&egrave;s que l’on donne le
poids atomique, et mieux encore la famille, c’est-&agrave;-dire les analogies.
Mais cette pr&eacute;vision, comme il a &eacute;t&eacute; dit plus haut,
n’est pas une cons&eacute;quence de la th&eacute;orie des s&eacute;ries
p&eacute;riodiques; elle r&eacute;sulte purement et simplement des lois
et des analogies anciennement connues, lesquelles sont ind&eacute;pendantes
du nouveau syst&egrave;me. Quoi qu’il en soit, le tableau hypoth&eacute;tique
que je viens de d&eacute;crire, tableau qui comprend tous les corps simples
connus et tous les corps simples possibles, a quelque chose de s&eacute;duisant
et qui entra&icirc;ne beaucoup d’esprits. Nous l’avons expos&eacute; dans
toute sa nettet&eacute;: mais le moment est venu de pr&eacute;senter certaines
r&eacute;serves. En effet, il est impossible de ne pas signaler &agrave;
l’attention du critique et du philosophe l’artifice commode, &agrave; l’aide
duquel les auteurs du syst&egrave;me sont parvenus &agrave; y comprendre
non seulement tous les corps connus, mais m&ecirc;me tous les corps possibles.
Cet artifice consiste &agrave; former leur tableau avec des termes qui
ne diff&egrave;rent pas en d&eacute;finitive de plus de deux unit&eacute;s,
termes assez resserr&eacute;s pour que nul corps nouveau, quel qu’il soit,
ne puisse tomber en dehors des mailles du filet. La chose est d’autant
plus assur&eacute;e que les diff&eacute;rences p&eacute;riodiques, ou raisons
de la progression, comportent souvent dans leurs applications aux poids
atomiques connus des variations de 1 &agrave; 2 unit&eacute;s. On voit
qu’il ne s’agit m&ecirc;me plus ici de ces fractions d’unit&eacute;, qui
s&eacute;paraient les uns des autres les multiples de l’hydrog&egrave;ne,
et qui ont &eacute;t&eacute; object&eacute;es &agrave; l’hypoth&egrave;se
de Prout et de Dumas; mais nous rencontrons des &eacute;carts bien plus
grands, dont aucune explication th&eacute;orique n’a &eacute;t&eacute;
donn&eacute;e, &eacute;carts dont l’existence &ocirc;te aux nouveaux rapprochements
une grande partie de leur valeur philosophique. En tol&eacute;rant de tels
&eacute;carts, et en multipliant suffisamment les termes r&eacute;els ou
suppos&eacute;s des comparaisons, il sera toujours facile aux partisans
d’un syst&egrave;me, quel qu'il soit, de se d&eacute;clarer satisfaits.
Sans exclure absolument de pareilles conceptions, on doit &eacute;viter
d’attacher une valeur scientifique trop grande &agrave; des cadres si &eacute;lastiques
; on doit surtout se garder de leur attribuer les d&eacute;couvertes pass&eacute;es
ou futures, auxquelles ils ne conduisent point en r&eacute;alit&eacute;
d’une mani&egrave;re pr&eacute;cise et n&eacute;cessaire. En fait et pour
&ecirc;tre sinc&egrave;res, nous devons dire qu’en dehors des anciennes
familles naturelles d’&eacute;l&eacute;ments, reconnues depuis longtemps,
ce ne sont gu&egrave;re l&agrave; que des assemblages artificiels. Le syst&egrave;me
des s&eacute;ries p&eacute;riodiques, pas plus que le syst&egrave;me des
multiples de l’hydrog&egrave;ne, n’a fourni jusqu’ici aucune r&egrave;gle
certaine et d&eacute;finie pour d&eacute;couvrir soit les corps simples
trouv&eacute;s dans ces derni&egrave;res ann&eacute;es, soit ceux que nous
ne connaissons pas encore. Aucun de ces syst&egrave;mes n’a fourni davantage
une m&eacute;thode positive, qui permette d’entrevoir, m&ecirc;me de tr&egrave;s
loin, la formation synth&eacute;tique de nos &eacute;l&eacute;ments; ou
qui mette sur la voie des exp&eacute;riences par lesquelles on pourrait
essayer d’y atteindre. De grandes illusions se sont &eacute;lev&eacute;es
&agrave; cet &eacute;gard. Ce n’est pas que de tels syst&egrave;mes ne
soient utiles dans la science; ils servent &agrave; exciter et &agrave;
soutenir l’imagination des chercheurs. Ceux-ci se r&eacute;signent difficilement
&agrave; rester sur le pur terrain exp&eacute;rimental et ils sont pouss&eacute;s
dans la r&eacute;gion des constructions et des th&eacute;ories, par ce
besoin d’unit&eacute; et de causalit&eacute;, inh&eacute;rent &agrave;
l’esprit humain. Aussi serait-il trop dur, et inutile d’ailleurs, de vouloir
proscrire toute tentative de ce genre. Mais, quelle que soit la s&eacute;duction
exerc&eacute;e par ces r&ecirc;ves, il faudrait se garder d’y voir les
lois fondamentales de notre science et la base de sa certitude, sous peine
de retomber dans un enthousiasme mystique pareil &agrave; celui des alchimistes.
<p>&nbsp;&nbsp;&nbsp; De telles conceptions sont d’ailleurs trop &eacute;troites
et il convient de s’&eacute;lever plus haut. Au fond, ceux qui invoquent
les multiples de l’hydrog&egrave;ne et les s&eacute;ries p&eacute;riodiques
rattachent tout &agrave; la conception de certains atomes, plus petits
&agrave; la v&eacute;rit&eacute; que ceux des corps r&eacute;put&eacute;s
simples. Or, s’il venait &agrave; &ecirc;tre d&eacute;montr&eacute; que
les &eacute;quivalents des corps simples actuels sont rigoureusement multiples
les uns des autres, ou plus g&eacute;n&eacute;ralement, multiples de certains
nombres formant la raison de progressions arithm&eacute;tiques d&eacute;termin&eacute;es
; il en r&eacute;sulterait cette conclusion probable que les corps simples
actuels repr&eacute;sentent les &eacute;tats in&eacute;gaux de condensation
d’une m&ecirc;me mati&egrave;re fondamentale. Cette fa&ccedil;on de concevoir
les choses n’a rien qui puisse r&eacute;pugner &agrave; un chimiste, vers&eacute;
dans l’&eacute;tude de sa science. On pourrait m&ecirc;me invoquer &agrave;
cet &eacute;gard des faits connus de tous, et qui ne sont pas sans quelque
analogie. Tels sont les &eacute;tats multiples du carbone, &eacute;l&eacute;ment
qui se manifeste &agrave; l’&eacute;tat libre sous les formes les plus
diverses et qui engendre plusieurs s&eacute;ries de compos&eacute;s, correspondant
dans une certaine mesure &agrave; chacun de ses &eacute;tats fondamentaux
; au m&ecirc;me titre que les compos&eacute;s d’un &eacute;l&eacute;ment
ordinaire correspondent &agrave; cet &eacute;l&eacute;ment m&ecirc;me.
Le carbone repr&eacute;sente en quelque sorte le g&eacute;n&eacute;rateur
commun de toute une famille d’&eacute;l&eacute;ments, diff&eacute;rents
par leur condensation: c’est d’ailleurs &agrave; la m&ecirc;me conclusion
que nous avait d&eacute;j&agrave; conduit l’&eacute;tude des carbures d’hydrog&egrave;ne.
On pourrait objecter que les diversit&eacute;s de propri&eacute;t&eacute;s
du carbone ne vont pas aussi loin que les diversit&eacute;s des &eacute;l&eacute;ments
compris dans une m&ecirc;me famille, celle des chloro&iuml;des ou celle
des sulfuro&iuml;des, par exemple. En effet, le soufre, le s&eacute;l&eacute;nium
ne reproduisent jamais les m&ecirc;mes compos&eacute;s, en s’unissant avec
l’oxyg&egrave;ne, l’hydrog&egrave;ne ou l’azote; et ils ne peuvent &ecirc;tre
r&eacute;g&eacute;n&eacute;r&eacute;s par les condensations du plus simple
d’entre eux. Tandis que toutes les formes du carbone, quelle qu’en soit
la vari&eacute;t&eacute;, repr&eacute;sentent r&eacute;ellement les &eacute;tats
in&eacute;galement condens&eacute;s d’un m&ecirc;me &eacute;l&eacute;ment
: toutes ces formes d&eacute;rivent du carbone gazeux, &eacute;tat primordial,
le moins condens&eacute; de tous, et dont l’analyse spectrale r&eacute;v&egrave;le
l’existence momentan&eacute;e &agrave; une tr&egrave;s haute temp&eacute;rature.
Cependant, peut-&ecirc;tre est-ce l&agrave; une simple diff&eacute;rence
de degr&eacute; dans la facilit&eacute; des m&eacute;tamorphoses. En somme,
le carbone, envisag&eacute; sous ses &eacute;tats et ses degr&eacute;s
de condensation, &eacute;quivaut &agrave; lui seul &agrave; une classe
enti&egrave;re de corps simples. L’oxyg&egrave;ne, le soufre, le s&eacute;l&eacute;nium,
le tellure pourraient repr&eacute;senter au m&ecirc;me titre, les &eacute;tats
divers d’un &eacute;l&eacute;ment commun. Il y a plus: l’ozone, corps dou&eacute;
de propri&eacute;t&eacute;s sp&eacute;cifiques tr&egrave;s singuli&egrave;res
et comparables &agrave; celles d’un v&eacute;ritable &eacute;l&eacute;ment,
a &eacute;t&eacute; r&eacute;ellement form&eacute; au moyen de l’oxyg&egrave;ne:
son existence autorise jusqu’&agrave; un certain point les conjectures
pr&eacute;c&eacute;dentes. Peut &ecirc;tre en est-il aussi de m&ecirc;me
de certains groupes de m&eacute;taux: chacun d’eux r&eacute;pondant par
lui-m&ecirc;me et par la s&eacute;rie particuli&egrave;re de ses combinaisons
&agrave; quelqu’un de ces &eacute;tats du carbone, qui engendrent des s&eacute;ries
correspondantes de d&eacute;riv&eacute;s. Il y a cette diff&eacute;rence
toutefois, je le r&eacute;p&egrave;te, que les &eacute;tats divers du carbone
peuvent &ecirc;tre tous ramen&eacute;s &agrave; certains compos&eacute;s
identiques, tels que l’acide carbonique, l’ac&eacute;tyl&egrave;ne ou le
form&egrave;ne; tandis que le soufre, le s&eacute;l&eacute;nium, les m&eacute;taux,
sont demeur&eacute;s irr&eacute;ductibles dans leurs combinaisons.
<p><b>8 - La Mati&egrave;re Premi&egrave;re Une et Multiforme.</b>
<p>&nbsp;&nbsp;&nbsp; Jusqu'ici nous avons raisonn&eacute; comme si les
&eacute;l&eacute;ments actuels &eacute;taient n&eacute;cessairement form&eacute;s
par la condensation d’un &eacute;l&eacute;ment plus simple, tel que l’hydrog&egrave;ne
ou tout autre &eacute;l&eacute;ment r&eacute;ellement existant et isolable,
dont les propri&eacute;t&eacute;s individuelles seraient la source de celles
de ses combinaisons. Mais ce n’est pas l&agrave; la seule mani&egrave;re
de comprendre la constitution de nos corps simples: il importe d’&eacute;tendre
&agrave; cet &eacute;gard nos id&eacute;es, et d’exposer une conception
philosophique plus g&eacute;n&eacute;rale. L’identit&eacute; fondamentale
de la mati&egrave;re contenue dans nos &eacute;l&eacute;ments actuels et
la possibilit&eacute; de transmuter les uns dans les autres les corps r&eacute;put&eacute;s
simples, pourraient &ecirc;tre admises comme des hypoth&egrave;ses vraisemblables,
sans qu’il en r&eacute;sult&acirc;t la n&eacute;cessit&eacute; d’une mati&egrave;re
unique r&eacute;ellement isolable, c’est-&agrave;-dire existant d’une fa&ccedil;on
propre. L’une des hypoth&egrave;ses n’entra&icirc;ne pas l’autre comme
cons&eacute;quence forc&eacute;e, contrairement &agrave; ce que l on a
pens&eacute; jusqu’ici. Ceci m&eacute;rite une attention toute particuli&egrave;re.
En effet, en admettant l’unit&eacute; de la mati&egrave;re comme &eacute;tablie,
on con&ccedil;oit que cette mati&egrave;re une soit susceptible d’un certain
nombre d’&eacute;tats d’&eacute;quilibre stable, en dehors desquels elle
ne saurait se manifester. L’ensemble de ces &eacute;tats stables renfermerait
les corps simples aujourd’hui connus, les corps simples que l’on pourra
d&eacute;couvrir un jour, et m&ecirc;me former synth&eacute;tiquement ;
en supposant que l’on arrive jamais &agrave; en d&eacute;couvrir la loi
g&eacute;n&eacute;ratrice. Mais on a toujours raisonn&eacute; en assimilant
ces &eacute;tats multiples d’&eacute;quilibre de la mati&egrave;re &agrave;
nos corps compos&eacute;s actuels, form&eacute;s par l’addition d’&eacute;l&eacute;ments
plus simples. Or, on peut concevoir les choses tout autrement. Il est possible
que les &eacute;tats divers d’&eacute;quilibre, sous lesquels se manifeste
la mati&egrave;re fondamentale, ne soient ni des &eacute;difices compos&eacute;s
par l’addition d’&eacute;l&eacute;ments diff&eacute;rents, ni des &eacute;difices
compos&eacute;s par l’addition d’&eacute;l&eacute;ments identiques, mais
in&eacute;galement condens&eacute;s. Il ne para&icirc;t pas n&eacute;cessaire,
en un mot, que tous ces &eacute;difices mol&eacute;culaires repr&eacute;sentent
les multiples entiers d’un petit nombre d’unit&eacute;s pond&eacute;rales
&eacute;l&eacute;mentaires. On peut tout aussi bien imaginer que de tels
&eacute;difices offrent, les uns par rapport aux autres, des relations
g&eacute;n&eacute;ratrices d’un autre ordre: telles, par exemple, que les
relations existant entre les symboles g&eacute;om&eacute;triques des diverses
racines d’une &eacute;quation; ou plus g&eacute;n&eacute;ralement, entre
les valeurs multiples d’une m&ecirc;me fonction, d&eacute;finie par l’analyse
math&eacute;matique. La mati&egrave;re fondamentale repr&eacute;senterait
alors la fonction g&eacute;n&eacute;ratrice, et les corps simples en seraient
les valeurs d&eacute;termin&eacute;es. Dans cette hypoth&egrave;se, plus
compr&eacute;hensive que celles que l’on formule d’ordinaire sur la constitution
de la mati&egrave;re; dans cet ordre d’id&eacute;es, dis-je, un corps r&eacute;put&eacute;
simple pourrait &ecirc;tre d&eacute;truit, mais non d&eacute;compos&eacute;
suivant le sens ordinaire du mot. Au moment de sa destruction, le corps
simple se transformerait subitement en un ou plusieurs autres corps simples,
identiques ou analogues aux &eacute;l&eacute;ments actuels. Mais les poids,
atomiques des nouveaux &eacute;l&eacute;ments pourraient n’offrir aucune
relation commensurable avec le poids atomique du corps primitif, qui les
aurait produits par sa m&eacute;tamorphose. Il y a plus: en op&eacute;rant
dans des conditions diverses, on pourrait voir appara&icirc;tre tant&ocirc;t
un syst&egrave;me, tant&ocirc;t un autre syst&egrave;me de corps simples,
d&eacute;velopp&eacute;s par la transformation du m&ecirc;me &eacute;l&eacute;ment.
Seul, le poids absolu demeurerait invariable, dans la suite des transmutations.
D’apr&egrave;s cette mani&egrave;re de voir, les corps qui r&eacute;sulteraient
de la m&eacute;tamorphose de l’un quelconque de nos &eacute;l&eacute;ments
actuels ne devraient pas &ecirc;tre envisag&eacute;s comme des corps simples
par rapport &agrave; lui; je dis &agrave; un titre sup&eacute;rieur &agrave;
l’&eacute;l&eacute;ment qui les aurait engendr&eacute;s. Car ils pourraient,
eux aussi, &ecirc;tre d&eacute;truits et transform&eacute;s en un ou plusieurs
autres corps, toujours de l’ordre de nos &eacute;l&eacute;ments pr&eacute;sents.
Au nombre de ces &eacute;l&eacute;ments de nouvelle formation, on pourrait
m&ecirc;me voir repara&icirc;tre le corps primitif, qui aurait donn&eacute;
lieu &agrave; la premi&egrave;re m&eacute;tamorphose. Il ne s’agirait donc
plus ici de compositions et de d&eacute;compositions, comparables &agrave;
celles que nous r&eacute;alisons continuellement dans nos op&eacute;rations.
La notion d’une mati&egrave;re au fond identique, quoique multiforme dans
ses apparences, et telle qu’aucune de ses manifestations ne puisse &ecirc;tre
regard&eacute;e comme le point de d&eacute;part n&eacute;cessaire de toutes
les autres, rappelle &agrave; quelques &eacute;gards les id&eacute;es des
anciens alchimistes. Elle offrirait cet avantage d’&eacute;tablir une ligne
de d&eacute;marcation tranch&eacute;e entre la constitution de nos &eacute;l&eacute;ments
pr&eacute;sents et celle de leurs combinaisons connues. Elle rendrait compte
de la diff&eacute;rence qui existe entre la chaleur sp&eacute;cifique des
&eacute;l&eacute;ments actuels et celle des corps compos&eacute;s et carbures
polym&egrave;res. Elle se concilierait d’ailleurs parfaitement avec les
hypoth&egrave;ses dynamiques que l’on &eacute;nonce aujourd’hui sur la
constitution de la mati&egrave;re. Les divers corps simples, en effet,
pourraient &ecirc;tre constitu&eacute;s tous par une m&ecirc;me mati&egrave;re,
distingu&eacute;e seulement par la nature des mouvements qui les animent.
La transmutation d’un &eacute;l&eacute;ment ne serait alors autre chose
que la transformation des mouvements qui r&eacute;pondent &agrave; l’existence
de cet &eacute;l&eacute;ment et qui lui communiquent ses propri&eacute;t&eacute;s
particuli&egrave;res, dans les mouvements sp&eacute;cifiques correspondants
&agrave; l’existence d’un autre &eacute;l&eacute;ment. Or, si nous acceptons
cette mani&egrave;re de voir, nous n’apercevons plus aucune relation n&eacute;cessaire
de multiplicit&eacute; &eacute;quivalente entre les nombres qui caract&eacute;risent
le mouvement primitif et ceux qui caract&eacute;risent le mouvement transform&eacute;.
Cette conception, que j’ai d&eacute;velopp&eacute;e devant la soci&eacute;t&eacute;
chimique de Paris en 1863, ne recourt, en d&eacute;finitive, pour expliquer
l’existence des &eacute;l&eacute;ments chimiques, qu’&agrave; celle de
nos corps simples actuels et des corps du m&ecirc;me ordre, ramen&eacute;s
en quelque sorte &agrave; la notion de mati&egrave;re premi&egrave;re.
<p><b>9 - La Mati&egrave;re Pond&eacute;rable et le Fluide Eth&eacute;r&eacute;.</b>
<p>&nbsp;&nbsp;&nbsp; D’autres veulent pr&eacute;ciser davantage. Par une
imagination fort plausible, mais dont le caract&egrave;re contradictoire
avec la th&eacute;orie atomique v&eacute;ritable a &eacute;t&eacute; parfois
m&eacute;connu, ils envisagent les particules pr&eacute;tendues atomiques
de nos &eacute;l&eacute;ments comme les agr&eacute;gats complexes d’une
mati&egrave;re plus subtile, le fluide &eacute;th&eacute;r&eacute;; agr&eacute;gats
constitu&eacute;s par des tourbillons de ce fluide, sorte de toupies en
rotation, dou&eacute;es d’un mouvement permanent et indestructible. On
voit que l’atome des chimistes, la base en apparence la plus solide et
la plus d&eacute;montr&eacute;e de notre science, s’&eacute;vanouit compl&egrave;tement.
Si nous ajoutons que chacun de ces tourbillons se fait et se d&eacute;fait
sans cesse, c’est-&agrave;-dire que la mati&egrave;re m&ecirc;me contenue
dans chacun des tourbillons demeure fixe par sa quantit&eacute;, mais non
par sa substance, nous retournons tout &agrave; fait aux id&eacute;es d’H&eacute;raclite.
C’est ainsi que, dans la philosophie scientifique de nos jours, la permanence
apparente de la mati&egrave;re tend &agrave; &ecirc;tre remplac&eacute;e
par la permanence de la masse et de l’&eacute;nergie. Un seul &ecirc;tre
ferme subsisterait alors, comme support ultime des choses, c’est le fluide
&eacute;th&eacute;r&eacute;. Le fluide &eacute;th&eacute;r&eacute; joue
ici le r&ocirc;le du mercure des philosophes; mais il est difficile de
ne pas s’apercevoir que son existence r&eacute;elle n’est pas mieux &eacute;tablie
et qu’elle n’est gu&egrave;res moins &eacute;loign&eacute;e des faits visibles
et d&eacute;montrables, sur lesquels roulent nos observations. C’est l&agrave;
aussi un symbole, une fiction destin&eacute;e &agrave; satisfaire l'imagination.
Les fluides &eacute;lectrique, magn&eacute;tique, calorifique, lumineux,
que l’on admettait au commencement de ce si&egrave;cle comme supports de
l’&eacute;lectricit&eacute;, du magn&eacute;tisme, de la chaleur et de
la lumi&egrave;re, n’ont certes pas, aux yeux des physiciens de nos jours,
plus de r&eacute;alit&eacute; que les quatre &eacute;l&eacute;ments, eau
et terre, air et feu, invent&eacute;s autrefois, au temps des ioniens et
au temps de Platon, pour correspondre &agrave; la liquidit&eacute; et &agrave;
la solidit&eacute;, &agrave; la volatilit&eacute; et &agrave; la combustion.
Ces fluides suppos&eacute;s ont m&ecirc;me eu dans l’histoire de la science
une existence plus br&egrave;ve que les quatre &eacute;l&eacute;ments:
ils ont disparu en moins d’un si&egrave;cle et ils se sont r&eacute;duits
&agrave; un seul, l’&eacute;ther, auquel on attribue des propri&eacute;t&eacute;s
imaginaires et parfois contradictoires. Mais d&eacute;j&agrave; l’atome
des chimistes, l’&eacute;ther des physiciens semblent dispara&icirc;tre
&agrave; leur tour, par suite des conceptions nouvelles qui tentent de
tout expliquer par les seuls ph&eacute;nom&egrave;nes du mouvement. Toutes
ces th&eacute;ories d’atomes, d’&eacute;l&eacute;ments, de fluides naissent
d’une inclination invincible de l’esprit humain vers le dogmatisme. La
plupart des hommes ne supportent pas de demeurer suspendus dans le doute
et l’ignorance; ils ont besoin de se forger des croyances, des syst&egrave;mes
absolus, en science comme en morale. Dans les mati&egrave;res o&ugrave;
elle n’a pas r&eacute;ussi &agrave; &eacute;tablir des lois, c’est-&agrave;-dire
des relations certaines et invariables entre les ph&eacute;nom&egrave;nes,
l’intelligence proc&egrave;de par analogies, et elle tourne dans un cercle
d’imaginations abstraites qui ne varient gu&egrave;re. Assur&eacute;ment,
je le r&eacute;p&egrave;te, nul ne peut affirmer que la fabrication des
corps r&eacute;put&eacute;s simples soit impossible a priori . Mais c’est
l&agrave; une question de fait et d’exp&eacute;rience. Si jamais on parvient
&agrave; former des corps simples, au sens actuel, cette d&eacute;couverte
conduira &agrave; des lois nouvelles, relations n&eacute;cessaires que
l’on expliquera aussit&ocirc;t par de nouvelles hypoth&egrave;ses. Alors
nos th&eacute;ories pr&eacute;sentes sur les atomes et sur la mati&egrave;re
&eacute;th&eacute;r&eacute;e para&icirc;tront probablement aussi chim&eacute;riques
aux hommes de l’avenir, que l’est, aux yeux des savants d’aujourd’hui,
la th&eacute;orie du mercure des vieux philosophes.
<center>
<p><i>FIN</i>
<p>
<hr WIDTH="61%"><b><font color="#CC0000">rexresearch.com</font></b>
<br><b><a href="../index.htm">Home</a></b>
<br><b><a href="../alchindx.htm">Alchemy Index</a></b></center>
</blockquote>

</body>
</html>
