{
	"posts": [
		{
			"id": "7dbceff0-d072-4263-ad8f-fb0b62cfea3c",
			"directory": "users/13fGuGBrEo9kaWjA1sPTFsh7fYfV9pF5xk",
			"uri": "source",
			"subject": "GalactiChan source code",
			"username": "root",
			"body": "Forked from Millchan:\n\nhttps://gitgud.io/millchan/Millchan\n\nHow to compile:\n\n* Install npm, node and the gnu compiler collection for c++, which is gcc-c++ for fedora or g++ for debian.\n\n* Execute git init\n\n* Execute npm install\n\n* Execute npm run test to make sure things are working (a compiled version of ffmpeg.js is included in this archive)\n\n* Execute npm run dev for development build or npm run prod for production build.\n\nOpen your clone's all.js file from the js folder in a text editor, and Find \"this.domain\". Change the entry from \"GalactiChan\" to \"your site's name.\" All lowercase letters and numbers only.\nOpen your main content.json file and edit the following: In the top line, delete GalactiChan's address and put your address. For Address index, delete the number string there, but leave the comma. In \"cloned from\" delete the HelloZero address and put Millchan's address. Scroll down and delete everything inside the quotation marks in signers_sign. Then delete EVERYTHING between the {} brackets in the line \"signs\". Spaces too, the brackets should be touching {}. Save and close.\nNow open the data/users/content.json file, and change the following: At the top, change the Millchan address to your site address. Again delete everything between the \"signs\" brackets {}. In the cert_signers line, change \"galactichan\" to your site's domain that you put in all.js earlier. Under \"permissions_rules\" change \"@galactichan\" to be \"@yourdomainfromearlier\". Save and close.\nNow go to ZeroHello and click the 3 dots next to your site name. First do Check Files, and then do Update. When finished, open your clone site and go to the 0 menu. Scroll to the bottom and select content.json, and then Sign and Publish. Next select data/users/content.json and Sign and Publish that as well. Back out to the main menu and hit Check Files, and then Update again.",
			"time": 1611736467855,
			"files": "[{\"name\":\"GalactiChan-1.0b-source.zip\",\"size\":9956453,\"type\":\"application/zip\",\"original\":\"a22df9685d185b0c6bada2c39d961c6ad5b1009a.zip\",\"directory\":\"13fGuGBrEo9kaWjA1sPTFsh7fYfV9pF5xk\"}]"
		}
	],
	"boards": [
		{
			"uri": "source",
			"title": "GalactiCHan sources"
		}
	],
	"modlogs": []
}