{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1538046106,
			"title": "Bloodlines of Illuminati by: Fritz Springmeier, 1995",
			"body": "Introduction:\nI am pleased & honored to present this book to those in the world who love the truth. This is a book\nfor lovers of the Truth. This is a book for those who are already familiar with my past writings. An\nIlluminati Grand Master once said that the world is a stage and we are all actors. Of course this was\nnot an original thought, but it certainly is a way of describing the Illuminati view of how the world\nworks.\nThe people of the world are an audience to which the Illuminati entertain with propaganda. Just one of\nthe thousands of recent examples of this type of acting done for the public was President Bill Clinton’s\n1995 State of the Union address. The speech was designed to push all of the warm fuzzy buttons of his\nlistening audience that he could. All the green lights  for acceptance were systematically pushed by the\nPresident’s speech with the help of a controlled congressional audience. The truth on the other hand\ndoesn’t always tickle the ear and warm the ego of its listeners. The light of truth in this book will be\ntoo bright for some people who  will want to return to the safe comfort of their darkness.\nI am not a conspiracy theorist. I deal with real facts, not theory. Some of the people I write about, I\nhave met. Some of the people I expose are alive and very dangerous. The darkness has never liked the\nlight. Yet, many of the secrets of the Illuminati are locked up tightly simply because secrecy is a way\nof life. It is such a way of life, that they resent the Carroll Quigleys and the James H. Billingtons who\nwant to tell real historical facts rather than doctored up stories and myths. I have been an intense\nstudent of history since I could read, and I am deeply committed to the facts of history rather than the\ncover stories the public is fed to manipulate them.\nI do not fear the Illuminati taking over this country and doing away with the Constitution, because\nthey took over this country long ago, and  the Constitution has not technically been in effect due to\nPresidential emergency decrees since W.W. II. Being a follower of Christ does not mean we should\nfear. Perfect love for Almighty God casts out our fear for the  situation He has place us in. Don’t think\nfor a moment you are going to vote the Illuminati out of office. They control the major and minor\npolitical  parties. They control the process of government, they control the process  of information\nflow, they control the process of creating money and finally  they control Christendom. (However,\nGod controls the hearts of His people.)\nI have provided information on how to respond in some of my other writings. This book will not tell\nyou how to deal with the Illuminati families. This volume is simply the first of two volumes which is\npublished to give an overview of what the Illuminati is. In short the Illuminati are generational Satanic\nbloodlines which have gained the most power. A generational Satanist described the Illuminati as\n\"Satan’s elite.\"\nThis book is not written to cause fear. It is not written to provide names for a witch hunt. It is not\nwritten to provide another theory. This book is not about a theory. It is about the secret occult\noligarchies  which rule the world. When brought together, the facts of this book will begin to speak for\nthemselves without me. I don’t ask that you take my word. Investigate for yourself. God Himself has\ntold us that the whole world lies in the power of the wicked one. Some people after they have read my\nmaterial have gone out into their own geographic area and seen for themselves that a small group of\npeople control their nation and the world from behind the scenes. They have seen for themselves the\npower that secret societies exercise from behind the scenes.\n2\nThis book will not be error free. There will be typos, and misspelled names, and errors of various\nkinds. The author is not God Almighty. I do not have every hair on these people’s heads counted. This\nbook has not been put out with the luxury of ghost writers, editors, a paid staff of researchers and a\nlarge budget. I look at many trivial projects which the elite are able to pour millions of dollars into,\nand I look at the research I do when at times I’ve not had a dime to photocopy some document I want.\nThere is so much for me to communicate about the Illuminati, who  they are, what their rituals are like,\nand how they control the world that it has taken several years of writing to begin to give people a fully\ncohesive picture.\nFinally, after a number of requests that I assemble my writings exposing the top 13 Illuminati\nbloodlines, I have taken the time to put it all together in a book with a comprehensive index. History is\nimportant. In order to know where we are going, we need to know where we have been. To control the\npast is to control the present. The Illuminati’s control over the entire learning process from cradle to\ngrave gives them great ability to shape our frames of references. Jesus spoke about historical things.\nPaul reminded people of historical things. Josephus wrote a history of the nation of Israel.\nLong ago in the dark unwritten pages of human history, powerful kings discovered how they could\ncontrol other men by torture, magical practices, wars, politics, religion and interest taking. These elite\nfamilies designed strategies and tactics to perpetuate their occult practices. Layers upon layers of\nsecrecy have hidden these families from the profane masses, but many an author has touched upon\ntheir existence. I began my research when I began to get first hand reports from very informed people\nthat an elite group did rule the world. My research into Satan’s hierarchy went fast because of my\nskills as a researcher and because I knew from the beginning from my informants about the reality of\nwhat I was investigating. My investigation into the Illuminati, led me to read and pray about thousands\nof books. The quantity of books, newspapers, magazines and manuscripts and papers which were read\nto get me to where I am today numbers in the many thousands. I do not know how many nights I\nstayed up studying and finally collapsed into sleep with blurred red eyes.\nI do know that I was driven enough in my study that I often would not stop until my eyes and mind\ncould go no further. Men and women with sharp intellects like Edith Star Miller (author of Occult\nTheocracy) and Alexander Hislop (author of The Two Babylons) have tried to research the occult\nworld and the connections between the different groups. I first read Hislop’s book in 1981. His book\nshows that there is a continuity between the ancient occultism of the Mystery Religions and modern\nday religion. Edith Star Miller’s Occult Theocracy was very helpful for me to rapidly see some of the\nmany hidden historical and operational connections between occult groups today. Finally, the book\nHoly Blood. Holy Grail and its first sequel The Messianic Legacy gave me a deep insightful look into\nthe 13th bloodline. But my understanding has been lifted by countless other investigators, who are\nworthy of praise because they dared to challenge the power structure to get to the real facts. </p>\nIn mockery and imitation of God’s 12 tribes, Satan blessed 12 bloodlines. One of these bloodlines was\nthe Ishmaeli bloodline from which a special elite line developed alchemy, assassination techniques,\nand other occult practices. One bloodline was Egyptian/Celtic/Druidic from which Druidism was\ndeveloped. One bloodline was in the orient and developed oriental magic. One lineage was from\nCanaan and the Canaanites. It had the name Astarte, then Astorga, then Ashdor, and then Astor. The\ntribe of Dan was used as a Judas Iscariot type seed. The royalty of the tribe of Dan have descended\ndown through history as a powefful Satanic bloodline. The 13th or final blood line was copied after\nGod’s royal lineage of Jesus. This was the Satanic House of David with their blood which they believe\nis not only from the House of David but also from the lineage of Jesus, who they claim had a wife and\nchildren. The 13th Satanic bloodline was instilled with the direct seed of Satan so that they would not\nonly carry Christ’s blood--but also the blood of his \"brother\" Lucifer. </p>\nOne of the bloodlines goes back to Babylon and are descendent from Nimrod. Down through the years\nthe occult world has remained hidden from the history books. (Publishing and education have been\ncontrolled privileges.) They have ruled behind the scenes. The Mystery Religions each had their secret\nhttps://www.cia.gov/library/abbottabad-compound/FC/FC2F5371043C48FDD95AEDE7B8A49624_Springmeier.-.Bloodlines.of.the.Illuminati.R.pdf",
			"added": 1538046105
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}