{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Bible4u",
			"body": "#Bible4u\nEste projeto é dedicado a compartilhar a mensagem da Bíblia, tanto na clearnet quanto na darknet (através das redes Tor, I2P, Freenet e Zeronet).\n- http://127.0.0.1:43110/bible4u.bit/index.html | http://127.0.0.1:43110/1BiBLE4U2fLzhr5i2nt1Uxz57CzWktdTSv/",
			"added": 1549927635
		},
		{
			"topic_id": 2,
			"title": "Mito de criação",
			"body": "#Um mito de criação é uma narrativa simbólica pertencente a uma cultura, tradição ou povo, que descreve os seus mais remotos inícios, como o mundo, tal como conhecem, se iniciou e como eles primeiro surgiram nele.\n\n- Mito de criação japonês: https://web.archive.org/web/20110514092010/http://www.wsu.edu:8080/~wldciv/world_civ_reader/world_civ_reader_1/kojiki.html\n\n- Mito de criação maia: https://web.archive.org/web/20101201180406/http://www.wsu.edu/~delahoyd/creation.populvuh.html\n\n- Mito de criação egípcio: https://web.archive.org/web/20181120043024/http://www.aldokkan.com/religion/creation.htm\n\n- Mito de criação nórdico: https://web.archive.org/web/20180924141604/http://www.pitt.edu/~dash/creation.html",
			"added": 1549930976
		}
	],
	"topic_vote": {
		"2_15ugkXYAt4RKhwHV85jTK6FcpVS6nqScCV": 1,
		"1_15ugkXYAt4RKhwHV85jTK6FcpVS6nqScCV": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"1_183j7y1ArHbMyMvdxH2yaMndEvZzddKpD1": 1,
		"1_1AcbSbSWDV31TcqhyQD2o8hLnZPLixeg3Y": 1,
		"1_1DztF9mbN47qjwWK2MG2U95uEwyYDaXjQs": 1,
		"2_1AcbSbSWDV31TcqhyQD2o8hLnZPLixeg3Y": 1,
		"2_142x9Nc3cD5zBCsNd2i8vNLTUGHipwCNo4": 1,
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1
	},
	"next_comment_id": 11,
	"comment": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 1,
				"body": "#O que Jesus nos ensinou?\nJesus nos ensinou tudo o que precisamos saber para compreender o plano de salvação e viver uma nova vida, livre do pecado. Os seus ensinamentos eram práticos e em uma linguagem que o povo entendia.\n\n#Jesus ensinou:\n\n#Sobre Deus\n\nEnsinou que Deus é nosso Pai e o Criador do mundo (Mateus 11:25). Ele nos fez para seu louvor e nos ama. Ele é o Juiz e o protetor dos santos.\n\n#Sobre o diabo\n\nO diabo é o pai da mentira, é arrogante e veio para matar, roubar e destruir (João 10:10). Ele induziu (e induz) o homem ao pecado. O seu propósito é estragar a criação de Deus.\n\n#Sobre o pecado\n\nTodos pecamos e estamos longe de Deus (João 8:7). O pecado leva à morte.\n\n#Quem Ele é\n\nEle disse que é o Filho de Deus, ou seja, Ele é Deus. Ele veio para salvar o mundo, morrendo na cruz e ressuscitando (João 3:16).\n\n\n#Sobre a salvação\n\nPara sermos salvos precisamos nos arrepender dos nossos pecados e aceitar Jesus como nosso senhor e salvador (Mateus 4:17). Quem acreditar n'Ele será salvo e terá a vida eterna. A salvação é de graça e nos une de novo a Deus.\n\n#Sobre o Espírito Santo\n\nJesus disse que enviaria o Espírito Santo para nos ensinar e consolar. É o Espírito Santo que nos convence do pecado e nos capacita a viver livres do pecado (Atos dos Apóstolos 1:8).\n\n#Como viver\n\nJesus deu muitas instruções sobre nossa vivência diária, regras morais para seguir, maneiras de lidar com as pessoas... O importante a tirar desses ensinamentos é viver de maneira agradável a Deus (João 14:23-24).\n\n#Sobre o Céu e o Inferno\n\nQuem crê em Jesus, quando morrer irá morar no Céu com Deus para sempre. Lá não haverá mais tristeza. Mas os ímpios irão para o Inferno, longe da presença de Deus, onde só há sofrimento (Mateus 25:46).\n\n#Sobre o fim dos tempos\n\nO fim virá mas ninguém sabe quando. Nessa altura Jesus voltará, os mortos ressuscitarão e os santos irão com Ele para o Céu. A terra será destruída, haverá um grande julgamento e o diabo e os ímpios serão lançados no fogo eterno. Antes do fim haverá sinais para avisar que está próximo (Marcos 13:28-29).",
				"added": 1549924914
			},
			{
				"comment_id": 2,
				"body": "#O que é Hermenêutica? Como interpretar a Bíblia\n\nHermenêutica é a interpretação coerente de textos, como a Bíblia. O objetivo da Hermenêutica é fazer uma boa interpretação do texto, chegando ao seu verdadeiro significado e aplicando-o corretamente. Todo cristão deve procurar entender o que as palavras da Bíblia realmente significam, para não cair no erro.\n\nOs ensinamentos da Bíblia não são apenas uma questão de interpretação pessoal (2 Pedro 1:20-21). Isso significa que não devemos forçar nossas próprias ideias sobre o texto mas sim procurar descobrir o que a Bíblia realmente ensina. Deus fala conosco através da Bíblia e, quando lemos a Bíblia, nosso objetivo deve ser descobrir qual é a mensagem de Deus.\n\nTodos usamos um pouco de Hermenêutica quando lemos um texto e procuramos entender o que diz. Hermenêutica bíblica é uma forma organizada de compreender e interpretar o que lemos na Bíblia. Geralmente, a Hermenêutica envolve três passos:\n\n#1. Entender o texto\n\nO primeiro passo de ler um texto é entender as palavras que estão escritas. Isso significa entender o que a passagem da Bíblia está dizendo, sem interpretações nem aplicações.\n\nPor exemplo, se lermos a parábola da casa construída sobre a rocha, em Lucas 6:47-49, a primeira coisa que devemos fazer é tentar entender a história. Neste caso, conta sobre um homem que construiu uma casa com alicerces fundos, na rocha. Sua casa ficou bem construída, por isso conseguiu resistir a uma inundação. Outro homem fez uma casa sem alicerces. Essa construção era fraca, por isso foi destruída na inundação.\n\nNessa primeira fase, é importante procurar o significado de palavras que você não entende e tentar entender frases complicadas. Você também pode ver como os elementos do texto da história estão relacionados. Por exemplo, por que a casa na rocha resistiu à inundação? (Porque estava bem construída e tinha bons alicerces.) Quem é comparado ao homem que não constrói alicerces para sua casa? (Aquele que ouve as palavras de Jesus e não as põe em prática.)\n\n#2. Entender o contexto\n\nNenhuma passagem bíblica existe sem contexto. Muitas vezes, se não entendemos o contexto, vamos fazer uma interpretação errada (ou não vamos entender nada). Cada versículo e cada passagem bíblica faz parte de uma história maior. Ignorar o contexto é como abrir um livro em uma página qualquer e ler uma frase ao acaso. Não faz sentido!\n\nUsando novamente o exemplo da parábola da casa construída sobre a rocha, quando olhamos para o contexto, vemos que foi uma história contada por Jesus para as pessoas que o seguiam. Ele estava avisando que não bastava chamá-lo de “Senhor” (Lucas 6:46). Seus seguidores precisavam colocar seus ensinamentos em prática em suas vidas. Ele contou a parábola para mostrar por que era importante ser praticante da palavra.\n\n#Quando se olha o contexto, pode ser útil analisar algumas coisas:\n\n    - Os textos que vêm antes e depois da passagem\n    - O tipo de livro da Bíblia em que a passagem se insere\n    - Quem foi o autor da passagem, ou quem disse as palavras\n    - Quem era o público-alvo original\n    - Qual era a mensagem para o público-alvo original\n    - Qual era o contexto histórico e cultural da passagem\n\n#3. Entender a aplicação atual\n\nA interpretação pessoal deve ser a última parte de uma boa interpretação de uma passagem bíblica. Somente quando entendemos a mensagem original do texto é que podemos aplicá-la a nossas vidas atuais. Apesar de ter sido escrita há muito tempo atrás, originalmente para pessoas muito diferentes de nós, a Bíblia continua relevante hoje em dia.\n\nPor exemplo, a parábola da casa construída sobre a rocha tem uma aplicação clara para todo cristão. Não podemos ser apenas cristãos da boca para fora. Precisamos ser praticantes da palavra de Deus. Assim como a casa construída sobre a rocha ficou firme, uma vida alicerçada e guiada pelos ensinamentos de Jesus fica firme nas tempestades da vida. Por outro lado, quem não põe a palavra em prática é como o homem que construiu a casa sem alicerce. Mesmo se reconhecer Jesus como Senhor, sua vida não será firme.\n\nEssa parábola ajuda a entender a importância da Hermenêutica. Uma leitura pouco cuidadosa e fora do contexto poderá levar a uma interpretação errada. Ignorando o contexto poderíamos pensar que a parábola ensina sobre a importância de acreditar em Jesus. Mas uma análise mais profunda mostra que é sobre pôr a fé em prática.\n\n#Regras importantes para interpretar bem a Bíblia:\n\n- A Bíblia interpreta a si mesma - muitas partes da Bíblia explicam outras partes, como por exemplo o sinal de Jonas mencionado em Mateus 16:4 é explicado em Mateus 12:39-41\n- A Bíblia é consistente - se sua interpretação de uma passagem contradiz o que o resto da Bíblia diz sobre o tema, a interpretação provavelmente está errada; os ensinamentos da Bíblia não se contradizem\n- O Espírito Santo ajuda a entender - se você está com dificuldade em entender o que você lê na Bíblia, peça ajuda a Deus e o Espírito Santo lhe ajudará - 1 Coríntios 2:12",
				"added": 1549925048
			},
			{
				"comment_id": 3,
				"body": "#Os 10 Mandamentos\n\n#A lei de Deus contém 10 (dez) mandamentos, presentes na Bíblia no Livro do Êxodo 20\n\n   - Não terás outros deuses além de mim.\n   - Não farás para ti nenhum ídolo, nenhuma imagem de qualquer coisa no céu, na terra, ou nas águas debaixo da terra. - Não te prostrarás diante deles nem lhes prestarás culto, porque eu, o Senhor,o teu Deus, sou Deus zelo­so, que castigo os filhos pelos pecados de seus pais até a terceira e quarta geração daqueles que me desprezam, mas trato com bondade até mil gerações aos que me amam e obedecem aos meus man­damentos.\n   - Não tomarás em vão o nome do Senhor, o teu Deus, pois o Senhor não deixará impune quem tomar o seu nome em vão.\n   - Lembra-te do dia de sábado, para santificá-lo. Trabalharás seis dias e neles farás todos os teus trabalhos, mas o sétimo dia é o sábado dedicado ao Senhor,o teu Deus. Nesse dia não farás trabalho algum, nem tu, nem teus filhos ou filhas, nem teus servos ou servas, nem teus animais, nem os estrangeiros que morarem em tuas cidades. Pois em seis dias o Senhor fez os céus e a terra, o mar e tudo o que neles existe, mas no sétimo dia descansou. Portanto, o Senhor abençoou o sétimo dia e o santificou.\n   - Honra teu pai e tua mãe, a fim de que tenhas vida longa na terra que o Senhor,o teu Deus, te dá.\n   - Não matarás.\n   - Não adulterarás.\n   - Não furtarás.\n   - Não darás falso testemunho contra o teu próximo.\n   - Não cobiçarás a casa do teu próximo. Não cobiçarás a mulher do teu próximo, nem seus servos ou servas, nem seu boi ou jumento, nem coisa alguma que lhe pertença",
				"added": 1549925208
			},
			{
				"comment_id": 4,
				"body": "#Mateus 22\n\n34 Ao ouvirem dizer que Jesus havia deixado os saduceus sem resposta, os fariseus se reuniram.\n\n35 Um deles, perito na lei, o pôs à prova com esta pergunta:\n\n36 \"Mestre, qual é o maior mandamento da Lei?\"\n\n37 Respondeu Jesus: \" 'Ame o Senhor, o seu Deus de todo o seu coração, de toda a sua alma e de todo o seu entendimento'.\n\n38 Este é o primeiro e maior mandamento.\n\n39 E o segundo é semelhante a ele: 'Ame o seu próximo como a si mesmo'.\n\n40 Destes dois mandamentos dependem toda a Lei e os Profetas\".\n\n#Marcos 12\n\n28 Um dos mestres da lei aproximou-se e os ouviu discutindo. Notando que Jesus lhes dera uma boa resposta, perguntou-lhe: \"De todos os mandamentos, qual é o mais importante?\"\n\n29 Respondeu Jesus: \"O mais importante é este: 'Ouça, ó Israel, o Senhor, o nosso Deus, o Senhor é o único Senhor.\n\n30 Ame o Senhor, o seu Deus, de todo o seu coração, de toda a sua alma, de todo o seu entendimento e de todas as suas forças'.\n\n31 O segundo é este: 'Ame o seu próximo como a si mesmo'. Não existe mandamento maior do que estes\".\n\n32 \"Muito bem, mestre\", disse o homem. \"Estás certo ao dizeres que Deus é único e que não existe outro além dele.\n\n33 Amá-lo de todo o coração, de todo o entendimento e de todas as forças, e amar ao próximo como a si mesmo é mais importante do que todos os sacrifícios e ofertas\".\n\n34 Vendo que ele tinha respondido sabiamente, Jesus lhe disse: \"Você não está longe do Reino de Deus\". Daí por diante ninguém mais ousava lhe fazer perguntas.",
				"added": 1549925343
			},
			{
				"comment_id": 5,
				"body": "#Bible4u\nEste projeto é dedicado a compartilhar a mensagem da Bíblia, tanto na clearnet quanto na darknet (através das redes Tor, I2P, Freenet e Zeronet).\n- http://127.0.0.1:43110/bible4u.bit/index.html | http://127.0.0.1:43110/1BiBLE4U2fLzhr5i2nt1Uxz57CzWktdTSv/",
				"added": 1549927514
			},
			{
				"comment_id": 6,
				"body": "Toda a Escritura é inspirada por Deus e útil para o ensino, para a repreensão, para a correção e para a instrução na justiça,\npara que o homem de Deus seja apto e plenamente preparado para toda boa obra.\n\n- 2 Timóteo 3:16,17",
				"added": 1549927840
			},
			{
				"comment_id": 7,
				"body": "#Respondeu Jesus: \"Eu sou o caminho, a verdade e a vida. Ninguém vem ao Pai, a não ser por mim.\n\n- João 14:6",
				"added": 1549928383
			},
			{
				"comment_id": 8,
				"body": "#Sinais do Fim dos Tempos\nOs sinais do fim dos tempos descrevem acontecimentos que vão culminar na segunda vinda de Jesus para buscar a Sua igreja.\n\n#A Bíblia nos revela vários sinais que indicam que o fim dos tempos está próximo. Muitos desses sinais já se manifestam hoje, veja quais são.\n\n   - Guerras - Jesus afirma em Mateus 24:7 que nos últimos tempos, antes do fim, nações entrarão em desacordo. Atualmente vemos como existem vários conflitos armados entre nações.\n\n   - Falsos mestres e falsos \"cristos\" - Muitos se levantarão anunciando que são Jesus Cristo, e na realidade conseguirão enganar muitas pessoas (Mateus 24:5). Isso já acontece nos dias de hoje. Quando Jesus voltar, virá com grande glória e esplendor, e ninguém poderá negar que Ele é o Senhor.\n\n   - Abandono da fé - Em 1 Timóteo 4:1 a Palavra de Deus nos diz que algumas pessoas abandonarão a fé porque seguirão os ensinamentos de espíritos malignos e enganadores. Por isso devemos nos manter firmes no que a Bíblia ensina.\n\n   - Desastres naturais e fome - Outro sinal que o fim está próximo são catástrofes, como vemos em Mateus 24:7. Enchentes, secas, incêndios, tsunamis e terremotos são muito comuns nos dias de hoje, assim como a fome para muitas pessoas.\n\n   - Má conduta do ser humano - Vemos em Mateus 24:12 e 2 Timóteo 3:2-3 que nos últimos dias o comportamento mau do ser humano vai piorar. É possível ver hoje em dia que a maldade das pessoas parece estar se agravando.\n\n   - Esforço pela paz e segurança - 1 Tessalonicenses 5:3 afirma que haverá um falso sentimento de paz e segurança. Hoje em dia, muitas países se juntam tentando garantir a paz, o que indica que o fim está iminente.\n\n   - Morte de cristãos - No fim dos tempos, muitas pessoas perderão a sua vida por anunciarem a sua fé, como é possível ver em Mateus 24:9-10. Este é outro sinal que já se verifica atualmente.\n\n   - Pregação do Evangelho - A Bíblia nos diz que o fim virá quando o Evangelho for pregado em todo o mundo (Mateus 24:14). As boas novas do Evangelho têm sido anunciadas em todos os continentes, mas ainda há muitas pessoas que precisam ouvir sobre o amor de Deus e o sacrifício de Jesus.",
				"added": 1549928732
			},
			{
				"comment_id": 9,
				"body": "Celebrava-se a festa da Dedicação, em Jerusalém. Era inverno,\ne Jesus estava no templo, caminhando pelo Pórtico de Salomão.\nOs judeus reuniram-se ao redor dele e perguntaram: \"Até quando nos deixará em suspense? Se é você o Cristo, diga-nos abertamente\".\nJesus respondeu: \"Eu já lhes disse, mas vocês não crêem. As obras que eu realizo em nome de meu Pai falam por mim,\nmas vocês não crêem, porque não são minhas ovelhas.\nAs minhas ovelhas ouvem a minha voz; eu as conheço, e elas me seguem.\nEu lhes dou a vida eterna, e elas jamais perecerão; ninguém as poderá arrancar da minha mão.\nMeu Pai, que as deu para mim, é maior do que todos; ninguém as pode arrancar da mão de meu Pai.\nEu e o Pai somos um\".\nNovamente os judeus pegaram pedras para apedrejá-lo,\nmas Jesus lhes disse: \"Eu lhes mostrei muitas boas obras da parte do Pai. Por qual delas vocês querem me apedrejar? \"\nResponderam os judeus: \"Não vamos apedrejá-lo por nenhuma boa obra, mas pela blasfêmia, porque você é um simples homem e se apresenta como Deus\".\nJesus lhes respondeu: \"Não está escrito na Lei de vocês: ‘Eu disse: Vocês são deuses’?\nSe ele chamou ‘deuses’ àqueles a quem veio a palavra de Deus ( e a Escritura não pode ser anulada )\nque dizer a respeito daquele a quem o Pai santificou e enviou ao mundo? Então, por que vocês me acusam de blasfêmia porque eu disse: ‘Sou Filho de Deus’?\nSe eu não realizo as obras do meu Pai, não creiam em mim.\nMas se as realizo, mesmo que não creiam em mim, creiam nas obras, para que possam saber e entender que o Pai está em mim, e eu no Pai\".\nOutra vez tentaram prendê-lo, mas ele se livrou das mãos deles.\nEntão Jesus atravessou novamente o Jordão e foi para o lugar onde João batizava nos primeiros dias do seu ministério. Ali ficou,\ne muita gente foi até onde ele estava, dizendo: \"Embora João nunca tenha realizado um sinal miraculoso, tudo o que ele disse a respeito deste homem era verdade\".\nE ali muitos creram em Jesus.\n\n- João 10:22-42",
				"added": 1549929220
			},
			{
				"comment_id": 10,
				"body": "\"Quando o Filho do homem vier em sua glória, com todos os anjos, assentar-se-á em seu trono na glória celestial.\nTodas as nações serão reunidas diante dele, e ele separará umas das outras como o pastor separa as ovelhas dos bodes.\nE colocará as ovelhas à sua direita e os bodes à sua esquerda.\n\"Então o Rei dirá aos que estiverem à sua direita: ‘Venham, benditos de meu Pai! Recebam como herança o Reino que lhes foi preparado desde a criação do mundo.\nPois eu tive fome, e vocês me deram de comer; tive sede, e vocês me deram de beber; fui estrangeiro, e vocês me acolheram;\nnecessitei de roupas, e vocês me vestiram; estive enfermo, e vocês cuidaram de mim; estive preso, e vocês me visitaram’.\n\"Então os justos lhe responderão: ‘Senhor, quando te vimos com fome e te demos de comer, ou com sede e te demos de beber?\nQuando te vimos como estrangeiro e te acolhemos, ou necessitado de roupas e te vestimos?\nQuando te vimos enfermo ou preso e fomos te visitar? ’\n\"O Rei responderá: ‘Digo-lhes a verdade: o que vocês fizeram a algum dos meus menores irmãos, a mim o fizeram’.\n\"Então ele dirá aos que estiverem à sua esquerda: ‘Malditos, apartem-se de mim para o fogo eterno, preparado para o diabo e os seus anjos.\nPois eu tive fome, e vocês não me deram de comer; tive sede, e nada me deram para beber;\nfui estrangeiro, e vocês não me acolheram; necessitei de roupas, e vocês não me vestiram; estive enfermo e preso, e vocês não me visitaram’.\n\"Eles também responderão: ‘Senhor, quando te vimos com fome ou com sede ou estrangeiro ou necessitado de roupas ou enfermo ou preso, e não te ajudamos? ’\n\"Ele responderá: ‘Digo-lhes a verdade: o que vocês deixaram de fazer a alguns destes mais pequeninos, também a mim deixaram de fazê-lo’.\n\"E estes irão para o castigo eterno, mas os justos para a vida eterna\".\n\n- Mateus 25:31-46",
				"added": 1549930007
			}
		]
	},
	"comment_vote": {
		"5_1AcbSbSWDV31TcqhyQD2o8hLnZPLixeg3Y": 1
	}
}