{
    "article": [
        {
            "title": "Berkeley Software Distribution",
            "text": "{{Redirect|BSD|the Windows error message abbreviated \"BSOD\" or \"BSoD\"|Blue Screen of Death|other uses}}\n{{Use mdy dates|date=December 2014}}\n{{Infobox OS\n| name                   = BSD\n| logo                   = \n| screenshot             =\n| caption                =\n| developer              = [[Computer Systems Research Group]], [[University of California, Berkeley]]\n| source_model           = Historically [[Closed source software|closed source]], gradual transition to [[free software]] from 1991 on.\n| kernel_type            = [[Monolithic Kernel|Monolithic]]\n| userland               = BSD\n| supported_platforms    = [[PDP-11]], [[VAX]], [[Intel 80386]]\n| ui                     = [[Command-line interface]]\n| family                 = [[Unix]]\n| released               = {{Start date and age|1977}}\n| latest_release_version = 4.4-Lite2\n| latest_release_date    = {{Start date and age|1995}}\n| latest_test_version    =\n| latest_test_date       =\n| marketing_target       =\n| programmed_in          = [[C (programming language)|C]]\n| prog_language          =\n| language               = English\n| updatemodel            =\n| package_manager        =\n| working_state          = Superseded by derivatives (see below)\n| license                = [[BSD licenses]]\n| website                = {{URL|http://www.bsd.org/}}\n}}\n'''Berkeley Software Distribution''' ('''BSD''') was a [[Unix]] [[operating system]] derivative developed and distributed by the [[Computer Systems Research Group]] (CSRG) of the [[University of California, Berkeley]], from 1977 to 1995.  Today the term \"BSD\" is often used non-specifically to refer to any of the BSD descendants which together form a branch of the family of [[Unix-like]] operating systems.  Operating systems derived from the original BSD [[source code|code]] remain actively developed and widely used.\n\nHistorically, BSD has been considered a branch of Unix, '''Berkeley Unix''', because it shared the initial codebase and design with the original [[AT&T]] Unix operating system. In the 1980s, BSD was widely adopted by vendors of [[computer workstation|workstation]]-class systems in the form of proprietary Unix variants such as [[Digital Equipment Corporation|DEC]] [[ULTRIX]] and [[Sun Microsystems]] [[SunOS]]. This can be attributed to the ease with which it could be licensed, and the familiarity the founders of many technology companies of the time had with it.\n\nAlthough these proprietary BSD derivatives were largely superseded by the UNIX [[System V Release 4]] and [[OSF/1]] systems in the 1990s (both of which incorporated BSD code and are the basis of other modern Unix systems), later BSD releases provided a basis for several [[open source]] development projects that are ongoing, including [[FreeBSD]], [[OpenBSD]], [[NetBSD]], [[DragonFly BSD]], [[Darwin (operating system)|Darwin,]] and [[TrueOS]], among others. These, in turn, have been incorporated in whole or in part in modern proprietary operating systems, e.g., the [[Internet protocol suite|TCP/IP]] networking code in [[Windows NT 3.1]] and most of the foundation of [[Apple Inc.|Apple]]'s [[macOS]] and [[iOS]].\n\n==History==\n{{Main Article|History of the Berkeley Software Distribution}}\n[[File:Unix history-simple.svg|thumb|300px|alt=A simple flow chart showing the history and timeline of the development of Unix starting with one bubble at the top and 13 tributaries at the bottom of the flow |Simplified evolution of [[Unix]] systems. Not shown are [[Junos]], [[PlayStation 3 system software]] and other proprietary forks.]]\n\nThe [[Research Unix|earliest distributions]] of Unix from [[Bell Labs]] in the 1970s included the [[source code]] to the operating system, allowing researchers at universities to modify and extend Unix. The operating system arrived at Berkeley in 1974, at the request of computer science professor [[Bob Fabry]] who had been on the program committee for the [[Symposium on Operating Systems Principles]] where Unix was first presented. A [[PDP-11/45]] was bought to run the system, but for budgetary reasons, this machine was shared with the mathematics and statistics groups at Berkeley, who used [[RSTS/E|RSTS]], so that Unix only ran on the machine eight hours per day (sometimes during the day, sometimes during the night). A larger [[PDP-11/70]] was installed at Berkeley the following year, using money from the [[Ingres (database)|Ingres]] database project.<ref name=\"penguin7\">{{cite book |first=Peter H. |last=Salus |authorlink=Peter H. Salus |title=The Daemon, the Gnu and the Penguin |chapter=Chapter 7. BSD and the CSRG |url=http://www.groklaw.net/article.php?story=20050505095249230 |publisher=[[Groklaw]] |year=2005}}</ref>\n\nAlso in 1975, [[Ken Thompson]] took a [[sabbatical]] from Bell Labs and came to Berkeley as a visiting professor. He helped to install [[Version 6 Unix]] and started working on a [[Pascal (programming language)|Pascal]] implementation for the system. Graduate students Chuck Haley and [[Bill Joy]] improved Thompson's Pascal and implemented an improved text editor, [[ex (text editor)|ex]].{{r|penguin7}} Other universities became interested in the software at Berkeley, and so in 1977 Joy started compiling the first Berkeley Software Distribution (1BSD), which was released on March 9, 1978.<ref>Salus (1994), p. 142</ref> 1BSD was an add-on to Version 6 Unix rather than a complete operating system in its own right. Some thirty copies were sent out.{{r|penguin7}}\n\nThe Second Berkeley Software Distribution (2BSD), released in May 1979,<ref name=\"tuhs-2bsd\">{{cite web|last=Toomey |first=Warren |title=Details of the PUPS archives|url=http://minnie.tuhs.org/PUPS/archive_details.html|work=tuhs.org|publisher=The Unix Heritage Society|accessdate=October 6, 2010}}</ref> included updated versions of the 1BSD software as well as two new programs by Joy that persist on Unix systems to this day: the [[vi]] text editor (a [[visual editor|visual]] version of [[ex (text editor)|ex]]) and the [[C shell]]. Some 75 copies of 2BSD were sent out by Bill Joy.{{r|penguin7}}\n\n[[File:VAX 11-780 intero.jpg|thumb|The [[VAX|VAX-11/780]], a typical minicomputer used for early BSD timesharing systems]]\n\nA [[VAX]] computer was installed at Berkeley in 1978, but the [[porting|port]] of Unix to the VAX architecture, [[UNIX/32V]], did not take advantage of the VAX's [[virtual memory]] capabilities. The [[kernel (computer science)|kernel]] of 32V was largely rewritten by Berkeley students to include a virtual memory implementation, and a complete operating system including the new kernel, ports of the 2BSD utilities to the VAX, and the utilities from 32V was released as 3BSD at the end of 1979. 3BSD was also alternatively called Virtual VAX/UNIX or VMUNIX (for Virtual Memory Unix), and BSD kernel images were normally called <code>/vmunix</code> until 4.4BSD.\n\n[[File:4.3 BSD UWisc VAX Emulation Login.png|thumb|alt=Black and white 4.3 BSD UWisc VAX Emulation Login screenshot|\"4.3 BSD UNIX\" from the [[University of Wisconsin]] circa 1987. System startup and login.]]\n\nAfter 4.3BSD was released in June 1986, it was determined that BSD would move away from the aging VAX platform. The [[Computer Consoles Inc.#Power 5 and Power 6 computers|Power 6/32]] platform (codenamed \"Tahoe\") developed by [[Computer Consoles Inc.]] seemed promising at the time, but was abandoned by its developers shortly thereafter. Nonetheless, the '''4.3BSD-Tahoe''' port (June 1988) proved valuable, as it led to a separation of machine-dependent and machine-independent code in BSD which would improve the system's future portability.\n\nApart from portability, the CSRG worked on an implementation of the [[Open Systems Interconnect|OSI]] network protocol stack, improvements to the kernel virtual memory system and (with [[Van Jacobson]] of [[Lawrence Berkeley Laboratory|LBL]]) new TCP/IP algorithms to accommodate the growth of the Internet.<ref name=\"beyond43\">M.K. McKusick, M.J. Karels, Keith Sklower, Kevin Fall, Marc Teitelbaum and Keith Bostic (1989). Current Research by The Computer Systems Research Group of Berkeley. Proc. European Unix Users Group.</ref>\n\nUntil then, all versions of BSD incorporated proprietary AT&T Unix code and were, therefore, subject to an AT&T software license. Source code licenses had become very expensive and several outside parties had expressed interest in a separate release of the networking code, which had been developed entirely outside AT&T and would not be subject to the licensing requirement. This led to '''Networking Release 1''' ('''Net/1'''), which was made available to non-licensees of AT&T code and was [[free software|freely redistributable]] under the terms of the [[BSD license]]. It was released in June 1989.\n\nAfter Net/1, BSD developer [[Keith Bostic]] proposed that more non-AT&T sections of the BSD system be released under the same license as Net/1. To this end, he started a project to reimplement most of the standard Unix utilities without using the AT&T code. Within eighteen months, all of the AT&T utilities had been replaced, and it was determined that only a few AT&T files remained in the kernel. These files were removed, and the result was the June 1991 release of Networking Release 2 (Net/2), a nearly complete operating system that was freely distributable.\n\nNet/2 was the basis for two separate ports of BSD to the [[Intel 80386]] architecture: the free [[386BSD]] by [[William Jolitz]] and the [[proprietary software|proprietary]] [[BSD/OS|BSD/386]] (later renamed BSD/OS) by [[Berkeley Software Design]] (BSDi).  386BSD itself was short-lived, but became the initial code base of the [[NetBSD]] and [[FreeBSD]] projects that were started shortly thereafter.\n\nBSDi soon found itself in legal trouble with AT&T's [[Unix System Laboratories]] (USL) subsidiary, then the owners of the System V [[copyright]] and the Unix trademark.  The ''[[USL v. BSDi]]'' lawsuit was filed in 1992 and led to an [[injunction]] on the distribution of Net/2 until the validity of USL's copyright claims on the source could be determined.  The lawsuit slowed development of the free-software descendants of BSD for nearly two years while their legal status was in question, and as a result systems based on the [[Linux kernel]], which did not have such legal ambiguity, gained greater support. The lawsuit was settled in January 1994, largely in Berkeley's favor. Of the 18,000 files in the Berkeley distribution, only three had to be removed and 70 modified to show USL copyright notices. A further condition of the settlement was that USL would not file further lawsuits against users and distributors of the Berkeley-owned code in the upcoming 4.4BSD release.<ref>{{cite web|url=http://www.catb.org/esr/writings/taoup/html/ch02s01.html|title=The Art of Unix Programming: Origins and History of Unix, 1969–1995|author=Eric S. Raymond|accessdate=2014-07-18}}</ref>\n\nThe final release from Berkeley was 1995's '''4.4BSD-Lite Release 2''', after which the CSRG was dissolved and development of BSD at Berkeley ceased. Since then, several variants based directly or indirectly on 4.4BSD-Lite (such as [[FreeBSD]], [[NetBSD]], [[OpenBSD]] and [[DragonFly BSD]]) have been maintained.\n\nIn addition, the permissive nature of the BSD license has allowed many other operating systems, both free and proprietary, to incorporate BSD code. For example, [[Microsoft Windows]] has used BSD-derived code in its implementation of TCP/IP<ref>http://www.kuro5hin.org/?op=displaystory;sid=2001/6/19/05641/7357</ref> and bundles recompiled versions of BSD's [[Command-line interface|command-line]] networking tools since [[Windows 2000]].<ref name=\"windows\">{{cite web|url=http://www.everything2.com/index.pl?node=BSD%20Code%20in%20Windows|title=BSD Code in Windows|date=March 20, 2001|work=everything2.com|accessdate=2009-01-20}}</ref> Also [[Darwin (operating system)|Darwin]], the system on which Apple's [[macOS]] is built, is a derivative of 4.4BSD-Lite2 and FreeBSD. Various commercial Unix operating systems, such as [[Solaris (operating system)|Solaris]], also contain varying amounts of BSD code.\n\n===Relationship to Research Unix===\nStarting with the 8th Edition, versions of Research Unix at Bell Labs had a close relationship to BSD. This began when 4.1cBSD for the VAX was used as the basis for Research Unix 8th Edition. This continued in subsequent versions, such as the 9th Edition, which incorporated source code and improvements from 4.3BSD. The result was that these later versions of Research Unix were closer to BSD than they were to System V. In a [[Usenet]] posting from 2000, Dennis Ritchie described this relationship between BSD and Research Unix:<ref>{{cite web|url=http://yarchive.net/comp/bsd.html|title=alt.folklore.computers: BSD (Dennis Ritchie)|author=Dennis Ritchie|date=October 26, 2000|accessdate=July 3, 2014}}</ref>\n\n{{quote|Research Unix 8th Edition started from (I think) BSD 4.1c, but with enormous amounts scooped out and replaced by our own stuff. This continued with 9th and 10th. The ordinary user command-set was, I guess, a bit more BSD-flavored than SysVish, but it was pretty eclectic.}}\n\n===Relationship to System V===\n[[Eric S. Raymond]] summarizes the longstanding relationship between [[System V]] and BSD, stating, \"The divide was roughly between longhairs and shorthairs; [[programmer]]s and technical people tended to line up with Berkeley and BSD, more business-oriented types with AT&T and System V.\"<ref>Raymond, Eric S. ''The Art of Unix Programming.'' 2003. p. 38</ref>\n\nIn 1989, David A. Curry wrote about the differences between BSD and System V. He characterized System V as being often regarded as the \"standard Unix.\" However, he described BSD as more popular among university and government computer centers, due to its advanced features and performance:<ref>Curry, David. ''Using C on the UNIX System: A Guide to System Programming.'' 1989. pp. 2–3</ref>\n\n{{quote|Most university and government computer centers that use UNIX use Berkeley UNIX, rather than System V. There are several reasons for this, but perhaps the two most significant are that Berkeley UNIX provides networking capabilities that until recently (Release 3.0) were completely unavailable in System V, and that Berkeley UNIX is much more suited to a research environment, which requires a faster file system, better virtual memory handling, and a larger variety of [[programming language]]s.}}\n\n==Technology==\n\n===Berkeley sockets===\n[[File:4.3 BSD UWisc VAX Emulation Lisp Manual.png|thumb|alt=Black and white 4.3 BSD UWisc VAX Emulation Lisp Manual screenshot|4.3 BSD from the [[University of Wisconsin]]. Displaying the [[man page]] for [[Franz Lisp]]]]\n[[File:SunOS 4.1.1 P1270750.jpg|thumb|alt=SunOS 4.1.1 P1270750 1/4-inch tape|Tape for [[SunOS]] 4.1.1, a 4.3BSD derivative]]\n[[File:sony news.jpg|thumb|[[Sony NEWS]] [[workstation]] running the BSD-based [[NEWS-OS]] operating system]]\n\nBerkeley's Unix was the first Unix to include libraries supporting the [[Internet Protocol]] stacks: ''[[Berkeley sockets]]''. A Unix implementation of IP's predecessor, the ARPAnet's [[Network Control Program|NCP]], with [[File Transfer Protocol|FTP]] and [[Telnet]] clients, had been produced at [[University of Illinois|U. Illinois]] in 1975, and was available at Berkeley.<ref>G. L. Chesson (1976). [http://dl.acm.org/citation.cfm?id=806522 The network Unix system]. Proc. 5th ACM Symp. on Operating Systems Principles.</ref><ref>RFC 681.</ref> However, the memory scarcity on the PDP-11 forced a complicated design and performance problems.<ref name=\"quarterman42bsd\">{{cite journal |last=Quarterman |first=John S. | first2 = Abraham | last2 = Silberschatz | first3 = James L. | last3 = Peterson |title=4.2BSD and 4.3BSD as examples of the Unix system |journal=Computing Surveys |date=December 1985 |volume=17 |issue=4 |pages=379–418 |doi=10.1145/6041.6043 |citeseerx = 10.1.1.117.9743 }}</ref>\n\nBy integrating sockets with the Unix operating system's [[file descriptor]]s, it became almost as easy to read and write data across a [[computer network|network]] as it was to access a disk. The AT&T laboratory eventually released their own [[STREAMS]] library, which incorporated much of the same functionality in a software stack with a different architecture, but the wide distribution of the existing sockets library reduced the impact of the new [[Application programming interface|API]]. Early versions of BSD were used to form [[Sun Microsystems]]' [[SunOS]], founding the first wave of popular Unix workstations.\n\n===Binary compatibility===\nBSD operating systems can run much native software of several other operating systems on the same [[computer architecture|architecture]], using a binary [[compatibility layer]]. Much simpler and faster than [[emulator|emulation]], this allows, for instance, applications intended for [[Linux]] to be run at effectively full speed. This makes BSDs not only suitable for server environments, but also for workstation ones, given the increasing availability of commercial or closed-source software for Linux only. This also allows administrators to migrate legacy commercial applications, which may have only supported commercial Unix variants, to a more modern operating system, retaining the functionality of such applications until they can be replaced by a better alternative.\n\n===Standards adherence===\nCurrent BSD operating system variants support many of the common [[Institute of Electrical and Electronics Engineers|IEEE]], [[American National Standards Institute|ANSI]], [[International Organization for Standardization|ISO]], and [[POSIX]] standards, while retaining most of the traditional BSD behavior. Like [[AT&T Unix]], the BSD kernel is [[monolithic kernel|monolithic]], meaning that device drivers in the kernel run in [[privileged mode]], as part of the core of the operating system.\n\n==Significant BSD descendants==\n{{See also|Comparison of BSD operating systems}}\nSeveral operating systems are based on BSD, including [[FreeBSD]], [[OpenBSD]], [[NetBSD]], and [[DragonFly BSD]]. Both NetBSD and FreeBSD were created in 1993. They were initially derived from [[386BSD]] (also known as \"Jolix\"), and merged the 4.4BSD-Lite source code in 1994. OpenBSD was [[Fork (software development)|forked]] from NetBSD in 1995, and DragonFly BSD was forked from FreeBSD in 2003.\n\nBSD was also used as the basis for several proprietary versions of Unix, such as [[Sun Microsystems|Sun]]'s [[SunOS]], [[Sequent Computer Systems|Sequent]]'s [[Dynix]], [[NeXT]]'s [[NeXTSTEP]], [[Digital Equipment Corporation|DEC]]'s [[Ultrix]] and OSF/1 AXP (now [[Tru64 UNIX]]). NeXTSTEP later became the foundation for [[Apple Inc.]]'s [[macOS]].\n\n==See also==\n{{Portal|Free software}}\n* [[BSD Daemon]]\n* [[BSD licenses]]\n* [[Comparison of BSD operating systems]]\n* [[List of BSD operating systems]]\n\n==References==\n{{reflist|30em}}\n\n==Bibliography==\n* Marshall K. McKusick, Keith Bostic, Michael J. Karels, John S. Quartermain, ''The Design and Implementation of the 4.4BSD Operating System'' (Addison Wesley, 1996; {{ISBN|978-0-201-54979-9}})\n* Marshall K. McKusick, George V. Neville-Neil, ''The Design and Implementation of the FreeBSD Operating System'' (Addison Wesley, August 2, 2004; {{ISBN|978-0-201-70245-3}})\n* Samuel J. Leffler, Marshall K. McKusick, Michael J. Karels, [[John Quarterman|John S. Quarterman]], ''The Design and Implementation of the 4.3BSD UNIX Operating System'' (Addison Wesley, November 1989; {{ISBN|978-0-201-06196-3}})\n* {{cite encyclopedia |editor1-first=Chris |editor1-last=DiBona|editor2-first=Sam |editor2-last=Ockman  |editor3-first=Mark |editor3-last=Stone |encyclopedia=Open Sources: Voices from the Revolution |publisher=O'Reilly |year=1999 |isbn=978-1-56592-582-3 |first=Marshall Kirk |last=McKusick |authorlink=Marshall Kirk McKusick |url=http://www.oreilly.com/catalog/opensources/book/kirkmck.html |title=Twenty Years of Berkeley Unix – From AT&T-Owned to Freely Redistributable}}\n* [[Peter H. Salus]], ''The Daemon, the GNU & The Penguin'' (Reed Media Services, September 1, 2008; {{ISBN|978-0-9790342-3-7}})\n* [[Peter H. Salus]], ''A Quarter Century of UNIX'' (Addison Wesley, June 1, 1994; {{ISBN|978-0-201-54777-1}})\n* [[Peter H. Salus]], ''Casting the Net'' (Addison-Wesley, March 1995; {{ISBN|978-0-201-87674-1}})\n\n==External links==\n*{{DMOZ|Computers/Software/Operating_Systems/Unix/BSD/}}\n* [http://svnweb.freebsd.org/base/head/share/misc/bsd-family-tree?view=co A timeline of BSD and Research UNIX]\n* [http://www.levenez.com/unix/ UNIX History]&nbsp;– History of UNIX and BSD using diagrams\n* [http://www.freebsd.org/doc/en_US.ISO8859-1/books/design-44bsd/ The Design and Implementation of the 4.4BSD Operating System]\n* [http://minnie.tuhs.org/cgi-bin/utree.pl The Unix Tree:  Source code and manuals for old versions of Unix]\n* [http://EuroBSDCon.org/ EuroBSDCon], an annual event in Europe in September, October or November, [http://www.ukuug.org/events/eurobsdcon2009/history/ founded] in 2001 <!-- 2003 did not happen, so, this one has not been \"held annually\", as per http://www.ukuug.org/events/eurobsdcon2009/history/ -->\n* [http://BSDCan.org/ BSDCan], a conference in [[Ottawa|Ottawa, Ontario]], Canada, held annually in May since 2004, in June since 2015\n* [http://AsiaBSDCon.org/ AsiaBSDCon], a conference in Tokyo, held annually in March of each year, since 2007\n* [http://mdoc.su/ mdoc.su&nbsp;— short manual page URLs for FreeBSD, OpenBSD, NetBSD and DragonFly BSD], a web-service [http://nginx.conf.mdoc.su/mdoc.su.nginx.conf written] in [[nginx]]\n* [http://BXR.SU/ BXR.SU&nbsp;— Super User's BSD Cross Reference], a userland and kernel source code search engine based on [[OpenGrok]] and [[nginx]]\n\n{{Berkeley Software Distribution|state=expanded}}\n{{unix-like}}\n{{FLOSS}}\n{{Operating system}}\n{{Authority control}}\n\n[[Category:Berkeley Software Distribution| ]]\n[[Category:1977 software]]\n[[Category:Free software operating systems]]\n[[Category:Free software programmed in C]]\n[[Category:Operating system families]]\n[[Category:Science and technology in the San Francisco Bay Area]]\n[[Category:University of California, Berkeley]]",
            "slug": "berkeley-software-distribution",
            "date_updated": 1519577012682,
            "imported": "https://en.wikipedia.org/wiki/Berkeley_Software_Distribution"
        }
    ]
}