{
    "article": [
        {
            "title": "Exokernel",
            "text": "{{Refimprove|date=September 2016}}\n[[File:exokernel revised(english).png|frame|right|Graphic overview of Exokernel. Exokernels are much smaller than a normal kernel ([[monolithic kernel]]). They give more direct access to the hardware, thus removing most abstractions]]\n'''Exokernel''' is an [[operating system]] [[kernel (computer science)|kernel]] developed by the [[MIT]] Parallel and Distributed Operating Systems group,<ref>{{Cite web|url=https://pdos.csail.mit.edu/archive/exo/|title=MIT Exokernel Operating System|website=pdos.csail.mit.edu|access-date=2018-01-25}}</ref> and also a class of similar operating systems.\n\nOperating systems generally present hardware resources to applications through high-level [[abstraction (computer science)|abstractions]] such as (virtual) file systems. The idea behind exokernels is to force as few abstractions as possible on application developers, enabling them to make as many decisions as possible about hardware abstractions.<ref>{{Cite journal|last=Engler|first=D. R.|last2=Kaashoek|first2=M. F.|last3=O'Toole Jr.|first3=J.|last4=Engler|first4=D. R.|last5=Kaashoek|first5=M. F.|last6=O'Toole Jr.|first6=J.|date=1995-12-03|title=Exokernel: an operating system architecture for application-level resource management, Exokernel: an operating system architecture for application-level resource management|url=http://dl.acm.org/citation.cfm?id=224056.224076,%20http://dl.acm.org/citation.cfm?id=224057.224076|journal=ACM SIGOPS Operating Systems Review|volume=29|issue=5|pages=251, 251–266, 266|doi=10.1145/224056.224076|issn=0163-5980}}</ref> Exokernels are tiny, since functionality is limited to ensuring protection and [[multiplexing]] of resources, which is considerably simpler than conventional [[microkernel]]s' implementation of message passing and [[monolithic kernel]]s' implementation of high-level abstractions.\n\nImplemented applications are called library operating systems; they may request specific memory addresses, disk blocks, etc. The kernel only ensures that the requested resource is free, and the application is allowed to access it. This low-level hardware access allows the programmer to implement custom abstractions, and omit unnecessary ones, most commonly to improve a program's performance. It also allows programmers to choose what level of abstraction they want, high, or low.\n\nExokernels can be seen as an application of the [[end-to-end principle]] to operating systems, in that they do not force an application program to layer its abstractions on top of other abstractions that were designed with different requirements in mind. For example, in the MIT Exokernel project, the Cheetah [[web server]] stores preformatted [[Internet Protocol]] packets on the disk, the kernel provides safe access to the disk by preventing unauthorized reading and writing, but how the disk is abstracted is up to the application or the libraries the application uses.\n\n==Motivation==\nTraditionally kernel designers have sought to make individual hardware resources invisible to application programs by requiring the programs to interact with the hardware via some abstraction model. These models include file systems for disk storage, virtual address spaces for memory, [[scheduling (computing) | schedulers]] for task management, and [[Berkeley sockets|sockets]] for network communication. These abstractions of the hardware make it easier to write programs in general, but limit performance and stifle experimentation in new abstractions. A security-oriented application might need a file system that does not leave old data on the disk, while a reliability-oriented application might need a file system that keeps such data for failure recovery.\n\nOne option is to remove the kernel completely and program directly to the hardware, but then the entire machine would be dedicated to the application being written (and, conversely, the entire application codebase would be dedicated to that machine). The exokernel concept is a compromise: let the kernel allocate the basic physical resources of the machine (e.g. [[computer disk| disk]] blocks, [[memory page]]s, and processor time) to multiple application programs, and let each program decide what to do with these resources. The program can then link to a support library that implements the abstractions it needs (or it can implement its own).\n\n==MIT exokernels==\nMIT developed two exokernel-based operating systems, using two kernels: Aegis, a proof of concept with limited support for storage, and XOK, which applied the exokernel concept more thoroughly.\n\nAn essential idea of the MIT exokernel system is that the operating system should act as an executive for small programs provided by the application software, which are constrained only by the requirement that the exokernel must be able to guarantee that they use the hardware safely.\n\n===Design===\nThe MIT exokernel manages hardware resources as follows:\n\n; Processor\n: The kernel represents the processor resources as a timeline from which programs can allocate intervals of time. A program can yield the rest of its time slice to another designated program. The kernel notifies programs of processor events, such as [[interrupt]]s, [[exception handling | hardware exceptions]], and the beginning or end of a time slice. If a program takes a long time to handle an event, the kernel will penalize it on subsequent time slice allocations; in extreme cases the kernel can abort the program.\n\n; Memory\n: The kernel allocates physical memory pages to programs and controls the [[translation lookaside buffer]]. A program can share a page with another program by sending it a ''[[capability-based security|capability]]'' to access that page. The kernel ensures that programs access only pages for which they have a capability.\n\n; Disk storage\n: The kernel identifies disk blocks to the application program by their physical block address, allowing the application to optimize data placement. When the program initializes its use of the disk, it provides the kernel with a function that the kernel can use to determine which blocks the program controls. The kernel uses this callback to verify that when it allocates a new block, the program claims only the block that was allocated in addition to those it already controlled.\n\n; Networking\n: The kernel implements a programmable [[packet filter]], which executes programs in a [[byte code]] language designed for easy security-checking by the kernel.\n\n===Applications===\nThe available library operating systems for Exokernel include the custom ExOS system and an emulator for [[Berkeley Software Distribution|BSD]]. In addition to these, the exokernel team created the Cheetah [[web server]], which uses the kernel directly.\n\n==History==\n[[File:The MINIX 3 Microkernel Architecture.png|thumb|400px|The Architecture of MINIX 3]]\nThe exokernel concept has been around since at least 1994,{{Sfn | Engler | Kaashoek | O’Toole | 1995}} but {{As of |2010|lc=on}} exokernels are still a research effort and have not been used in any major commercial operating systems. \n\nA concept operating exokernel system is [[Nemesis (computing)|Nemesis]], written by [[University of Cambridge]], [[University of Glasgow]], [[Citrix Systems]], and the [[Swedish Institute of Computer Science]]. [[Massachusetts Institute of Technology|MIT]] has also built several exokernel-based systems, including ExOS.\n\n==See also==\n*[[Hybrid kernel]]\n*[[Hypervisor]]\n*[[Kernel (computer science)]]\n*[[Microkernel]]\n*[[Monolithic kernel]]\n*[[Nanokernel]]\n*[[Paravirtualization]]\n*[[Rump kernel]]\n*[[Single address space operating system]] (SASOS)\n*[[Unikernel]]\n*[[BareMetal]]\n\n==References==\n{{Reflist |64em}}\n\n==Bibliography==\n{{Refbegin}}\n* {{cite journal | last = Engler | first = Dawson R | title = The Exokernel Operating System Architecture | publisher = MIT | year = 1998 | url = http://pdos.csail.mit.edu/exo/theses/engler/thesis.ps | format = PostScript | accessdate = 2006-09-22 | ref = harv}}\n* {{cite journal | last1 = Engler | first1 = Dawson R | author-mask = 3 | last2 = Kaashoek | first2 = M. Frans | authorlink2 =  Frans Kaashoek | title = Exterminate All Operating System Abstractions | publisher = MIT | year = 1996 | url = http://pdos.csail.mit.edu/papers/hotos-jeremiad.ps | format = PostScript | accessdate = 2006-09-22 | ref = harv}}\n* {{cite journal | last1 = Engler | first1 = Dawson R | author-mask = 3 | last2 = Kaashoek | first2 = M. Frans |authorlink2 =  Frans Kaashoek |  last3 = O’Toole | first3 = James Jr | title=Exokernel: An Operating System Architecture for Application-Level Resource Management | journal = Proceedings of the fifteenth ACM symposium on Operating systems principles | pages=251–66 | format = PDF | year=1995 | accessdate = 2014-10-08 | url = http://dl.acm.org/citation.cfm?id=224076 | doi = 10.1145/224056.224076 | isbn = 0-89791-715-4 | ref = harv}}\n{{Refend}}\n\n==External links==\n* {{Citation | url = http://www.cs.cornell.edu/home/ulfar/ukernel/ukernel.html#current-exo | title = Microkernels | quote = The extent to which simple, efficient operations are a good choice in a kernel interface design | first1 = Úlfar | last1 = Erlingsson | first2 = Athanasios | last2 = Kyparlis | publisher = Cornell}}.\n* {{Citation | url = http://pdos.csail.mit.edu/exo/ | publisher = MIT | title = Exokernel Operating System}}. A research exokernel.\n* {{Citation | url = http://www.cl.cam.ac.uk/research/srg/netos/old-projects/nemesis/ | title = Nemesis | publisher = Cambridge | place = [[United Kingdom |UK]]}}.  A research exokernel.\n* {{Citation | url = http://www.returninfinity.com/baremetal.html | title = BareMetal OS | publisher = Return Infinity | deadurl = yes | archiveurl = https://web.archive.org/web/20140906120230/http://www.returninfinity.com/baremetal.html | archivedate = 2014-09-06 | df =  }}. A commercial exokernel.\n* {{Citation | url = http://xomb.net/ | title = XOmB}}. A research exokernel.\n* {{Citation | url = https://github.com/remysaissy/examour-exokernel | title = ExAmour | place = [[Paris, France |FR]]}}. The [[GNU]] exokernel.\n\n{{Operating system}}\n\n[[Category:Operating system kernels]]\n[[Category:Microkernels]]\n\n[[it:Kernel#Esokernel]]",
            "slug": "exokernel",
            "date_updated": 1537716364439,
            "imported": "https://en.wikipedia.org/wiki/Exokernel"
        }
    ]
}