{
    "article": [
        {
            "title": "Flow battery",
            "text": "{{Use dmy dates|date=April 2017}}\n[[File:Redox Flow Battery.jpg|alt=Redox Flow Battery|thumb|A typical flow battery consists of two tanks of liquids which are pumped past a membrane held between two electrodes.<ref>{{Cite journal|last=Qi|first=Zhaoxiang|last2=Koenig|first2=Gary M.|date=2017-05-12|title=Review Article: Flow battery systems with solid electroactive materials|url=http://avs.scitation.org/doi/abs/10.1116/1.4983210|journal=Journal of Vacuum Science & Technology B, Nanotechnology and Microelectronics: Materials, Processing, Measurement, and Phenomena|volume=35|issue=4|pages=040801|doi=10.1116/1.4983210|issn=2166-2746}}</ref>]]\n<!-- Deleted image removed: [[File:Redflow ZBM2 10kWh zinc-bromide battery.png|thumb|right|ZBM2 10kWh hybrid zinc-bromide flow battery from Redflow Limited]] -->\n\nA '''flow battery''', or '''redox flow battery''' (after ''[[reduction–oxidation]]''), is a type of [[electrochemical cell]] where chemical energy is provided by two chemical components [[Solution|dissolved]] in liquids contained within the system and separated by a membrane.<ref name=\"journal.frontiersin.org\">{{cite journal|last1=Badwal|first1=Sukhvinder P. S.|last2=Giddey|first2=Sarbjit S.|last3=Munnings|first3=Christopher|last4=Bhatt|first4=Anand I.|last5=Hollenkamp|first5=Anthony F.|title=Emerging electrochemical energy conversion and storage technologies|journal=Frontiers in Chemistry|date=24 September 2014|volume=2|doi=10.3389/fchem.2014.00079|url=http://journal.frontiersin.org/Journal/10.3389/fchem.2014.00079/abstract|pmid=25309898|pmc=4174133}}</ref><ref>{{Cite journal|last=Alotto|first=P.|last2=Guarnieri|first2=M.|last3=Moro|first3=F.|year=2014|title=Redox Flow Batteries for the storage of renewable energy: a review|journal=Renewable & Sustainable Energy Reviews|volume=29|pages=325–335|doi= 10.1016/j.rser.2013.08.001|ref=harv}}</ref> [[Ion exchange]] (accompanied by flow of electric current) occurs through the membrane while both liquids circulate in their own respective space. [[Electrode potential#Potential difference of a cell assembled of two electrodes|Cell voltage]] is chemically determined by the [[Nernst equation]] and ranges, in practical applications, from 1.0 to 2.2 [[volt]]s.\n\nA flow battery may be used like a [[fuel cell]] (where the spent fuel is extracted and new fuel is added to the system) or like a [[rechargeable battery]] (where an electric power source drives regeneration of the fuel).  While it has technical advantages over conventional rechargeables, such as potentially separable liquid tanks and near unlimited longevity,  current implementations are comparatively less powerful and require more sophisticated electronics.\n\nThe energy capacity is a function of the electrolyte volume (amount of liquid electrolyte) and the power a function of the surface area of the [[electrode]]s.\n\n== Construction principle ==\n\nA flow battery is a rechargeable [[fuel cell]] in which an [[electrolyte]] containing one or more dissolved electroactive elements flows through an [[electrochemical cell]] that reversibly converts [[chemical energy]] directly to [[electricity]] (electroactive elements are \"elements in solution that can take part in an electrode reaction or that can be [[Adsorption|adsorbed]] on the electrode\"<ref name=Science-Dictionary />). Additional electrolyte is stored externally, generally in tanks, and is usually pumped through the cell (or cells) of the reactor, although gravity feed systems are also known.<ref name=Fujii /> Flow batteries can be rapidly \"recharged\" by replacing the electrolyte liquid (in a similar way to refilling fuel tanks for [[internal combustion engine]]s) while simultaneously recovering the spent material for re-energization.\n\nIn other words, a flow battery is just like an [[electrochemical cell]], with the exception that the ionic solution ([[electrolyte]]) is not stored in the cell around the electrodes. Rather, the ionic solution is stored outside of the cell, and can be fed into the cell in order to generate electricity. The total amount of electricity that can be generated depends on the size of the storage tanks.\n\nFlow batteries are governed by the design principles established by [[electrochemical engineering]].<ref>{{cite journal|last1=Arenas|first1=L.F.|last2=Ponce de León|first2=C.|last3=Walsh|first3=F.C.|title=Engineering aspects of the design, construction and performance of modular redox flow batteries for energy storage|journal=Journal of Energy Storage|date=June 2017|volume=11|pages=119–153|doi=10.1016/j.est.2017.02.007}}</ref>\n\n== Types ==\nVarious types of flow cells (batteries) have been developed,<ref name=Noack>{{cite journal | last1 = Noack | first1 = J. | last2 = Roznyatovskaya | first2 = N. | last3 = Herr | first3 = T. | last4 = Fischer | first4 = P. | year = 2015 | title = The Chemistry of Redox-Flow Batteries. | url = | journal = Angew. Chem. Int. Ed. | volume = 54 | issue = | pages = 9776–9809 | doi = 10.1002/anie.201410823 }}</ref> including [[redox]], hybrid and membraneless. The fundamental difference between conventional batteries and flow cells is that energy is stored not as the [[electrode]] material in conventional batteries but as the [[electrolyte]] in flow cells.\n\n=== Redox ===\n\nThe [[redox]] (reduction–oxidation) cell is a reversible cell in which electrochemical components are dissolved in the electrolyte. Redox flow batteries are rechargeable ([[secondary battery|secondary cells]]).<ref name=LindenReddy /> Because they employ [[Electron transfer#Heterogeneous electron transfer|heterogeneous electron transfer]] rather than [[Chemical reaction#Solid-state reactions|solid-state diffusion]] or [[Lithium ion#Charge and discharge|intercalation]] they are more appropriately called [[fuel cell]]s rather than batteries. In industrial practice, fuel cells are usually, and unnecessarily, considered to be primary cells, such as the {{chem|H|2}}/{{chem|O|2}} system. The [[unitized regenerative fuel cell]] on [[NASA]]'s [[Helios Prototype]] is another reversible fuel cell. The [[European Patent Organisation]] classifies redox flow cells (H01M8/18C4) as a sub-class of regenerative fuel cells (H01M8/18). Examples of redox flow batteries are the [[Vanadium redox battery|Vanadium redox flow battery]], [[polysulfide bromide battery]] (Regenesys), and uranium redox flow battery.<ref name=Shiokawa /> Redox fuel cells are less common commercially although many systems have been proposed.<ref name=Borchers /><ref name=Nernst /><ref name=Keefer /><ref name=Kummer_and_Oei_1982 />\n\nA prototype [[zinc]]-[[polyiodide]] flow battery has been demonstrated with an energy density of 167 Wh/l ([[watt-hours]] per [[liter]]). Older zinc-bromide cells reach 70 Wh/l. For comparison, [[lithium iron phosphate battery|lithium iron phosphate batteries]] store 233 Wh/l. The zinc-polyiodide battery is claimed to be safer than other flow batteries given its absence of acidic electrolytes, nonflammability and operating range of {{convert|-4|to|122|F|C}} that does not require extensive cooling circuitry, which would add weight and occupy space. One unresolved issue is zinc build-up on the negative electrode that permeated the membrane, reducing efficiency. Because of the Zn dendrite formation, the Zn-halide batteries cannot operate at high current density (> 20 mA/cm<sup>2</sup>) and thus have limited power density. Adding alcohol to the electrolyte of the ZnI battery can slightly control the problem.<ref>{{cite news |title=High-performance flow battery could rival lithium-ions for EVs and grid storage |first=Dario |last=Borghino |date=27 February 2015 |publisher=Gizmag}}</ref>\n\nWhen the battery is fully discharged, both tanks hold the same electrolyte solution: a mixture of positively charged zinc ions ({{chem|Zn|2+}}) and negatively charged iodide ion, I-. When charged, one tank holds another negative ion, polyiodide, I3-. The battery produces power by pumping liquid from external tanks into the battery's stack area where the liquids are mixed. Inside the stack, zinc ions pass through a selective membrane and change into metallic zinc on the stack's negative side.<ref>{{cite news|title=New flow battery to keep big cities lit, green and safe |date=25 February 2015 |first=Frances |last=White |publisher=R&D |url=http://www.rdmag.com/videos/2015/02/new-flow-battery-keep-big-cities-lit-green-and-safe}}</ref> To further increase the energy density of the zinc-iodide flow battery, bromide ions (Br–) are used as the complexing agent to stabilize the free iodine, forming iodine-bromide ions (I2Br–) as a mean to free up iodide ions for charge storage.<ref>{{cite journal|last1=Weng|first1=Guo-Ming|title=Unlocking the capacity of iodide for high-energy-density zinc/polyiodide and lithium/polyiodide redox flow batteries|journal=Energy & Environmental Science|date=2017|volume=3|pages=735-741|doi=10.1039/C6EE03554J}}</ref> \n\nTraditional flow battery chemistries have both low specific energy (which makes them too heavy for fully electric vehicles) and low specific power (which makes them too expensive for stationary energy storage). However a high power of 1.4 W/cm2 was demonstrated for hydrogen-bromine flow batteries, and a specific energy (530 Wh/kg at the tank level) was shown for hydrogen-bromate flow batteries<ref>{{cite journal|url=http://onlinelibrary.wiley.com/doi/10.1002/cplu.201402043/suppinfo|title=Cyclic Performance Analysis of Hydrogen/Bromine Flow Batteries for Grid-Scale Energy Storage|publisher= | doi=10.1002/cplu.201402043/suppinfo}}</ref><ref>{{cite journal|url=https://link.springer.com/article/10.1134%2FS1023193513120069#/page-1|title=Hydrogen-halogen electrochemical cells: A review of applications and technologies|publisher= | doi=10.1134/S1023193513120069|volume=50|journal=Russian Journal of Electrochemistry|pages=301–316|year=2013 | last1 = Yu | first1 =  | last2 = Tolmachev | first2 = V.}}</ref><ref>{{cite journal|url=https://link.springer.com/article/10.1007/s10008-015-2805-z?no-access=true|title=Energy cycle based on a high specific energy aqueous flow battery and its potential use for fully electric vehicles and for direct solar-to-chemical energy conversion|publisher= | doi=10.1007/s10008-015-2805-z|volume=19|journal=Journal of Solid State Electrochemistry|pages=2711–2722|year=2015 | last1 = Tolmachev | first1 = Yuriy V.}}</ref>\n\nOne system uses organic polymers and a saline solution with a [[cellulose]] membrane. The prototype withstood 10000 charging cycles while retaining substantial capacity. The energy density was 10 Wh/l.<ref>{{Cite web|title = Chemists present an innovative redox-flow battery based on organic polymers and water|url = http://phys.org/news/2015-10-chemists-redox-flow-battery-based-polymers.html|website = phys.org|publisher = Phys.org|accessdate = 6 December 2015|date = 21 October 2015}}</ref>  Current density reached 100 milliamperes/cm2.<ref>{{Cite journal|title = An aqueous, polymer-based redox-flow battery using non-corrosive, safe, and low-cost materials|url = http://www.nature.com/doifinder/10.1038/nature15746|journal = Nature|pages = 78–81|volume = 527|issue = 7576|doi = 10.1038/nature15746|first = Tobias|last = Janoschka|first2 = Norbert|last2 = Martin|first3 = Udo|last3 = Martin|first4 = Christian|last4 = Friebe|first5 = Sabine|last5 = Morgenstern|first6 = Hannes|last6 = Hiller|first7 = Martin D.|last7 = Hager|first8 = Ulrich S.|last8 = Schubert|pmid=26503039|year=2015}}</ref>\n\n=== Hybrid ===\nThe hybrid flow battery uses one or more electroactive components deposited as a solid layer.<ref name=Bartolozzi /> In this case, the electrochemical cell contains one battery electrode and one fuel cell electrode. This type is limited in energy by the surface area of the electrode. Hybrid flow batteries include the [[zinc-bromine flow battery|zinc-bromine]], [[Zinc cerium redox flow battery|zinc–cerium]]<ref name=PKLeung />, [[lead–acid battery|lead–acid]], and iron-salt flow batteries. Weng et al. <ref>J. Electrochem. Soc. 2013 volume 160, issue 9, A1384-A1389</ref> reported a Vanadium-Metal hydride rechargeable hybrid flow battery with an experimental OCV of 1.93 V and operating voltage of 1.70 V, very high values among rechargeable flow batteries with aqueous electrolytes. This hybrid battery consists of a graphite felt positive electrode operating in a mixed solution of VOSO<sub>4</sub> and H<sub>2</sub>SO<sub>4</sub>, and a metal hydride negative electrode in KOH aqueous solution. The two electrolytes of different pH are separated by a bipolar membrane. The system demonstrated good reversibility and high efficiencies in coulomb (95%), energy (84%), and voltage (88%). They reported further improvements of this new redox couple with achievements of increased current density, operation of larger 100 cm<sup>2</sup> electrodes, and the operation of 10 large cells in series. Preliminary data using a fluctuating simulated power input tested the viability toward kWh scale storage.<ref>J. Electrochem. Soc. 2016 volume 163, issue 1, A5180-A5187</ref>\n\n=== Membraneless ===\nA membraneless battery<ref>{{Cite journal|last=Bamgbopa|first=Musbaudeen O.|last2=Almheiri|first2=Saif|last3=Sun|first3=Hong|date=2017-04|title=Prospects of recently developed membraneless cell designs for redox flow batteries|url=https://doi.org/10.1016/j.rser.2016.11.234|journal=Renewable and Sustainable Energy Reviews|volume=70|pages=506–518|doi=10.1016/j.rser.2016.11.234|issn=1364-0321}}</ref> relies on [[laminar flow]] in which two liquids are pumped through a channel. They undergo electrochemical reactions to store or release energy. The solutions stream through in parallel, with little mixing. The flow naturally separates the liquids, eliminating the need for a membrane.<ref name=Kurzweil />\n\nMembranes are often the most costly component and the least reliable components of batteries, as they can corrode with repeated exposure to certain reactants. The absence of a membrane enabled the use of a liquid bromine solution and hydrogen. This combination is problematic when membranes are used, because they form [[hydrobromic acid]] that can destroy the membrane. Both materials are available at low cost.<ref name=Braff />\n\nThe design uses a small channel between two electrodes. Liquid bromine flows through the channel over a graphite cathode and hydrobromic acid flows under a porous anode. At the same time, hydrogen gas flows across the anode. The chemical reaction can be reversed to recharge the battery—a first for any membraneless design.<ref name=Braff />\nOne such membraneless flow battery published in August 2013 produced a maximum power density of 7950&nbsp;W/m<sup>2</sup>, three times as much [[power density|power]] as other membraneless systems— and an order of magnitude higher than lithium-ion batteries.<ref name=Braff />\n\nRecently, a macroscale membraneless redox flow battery capable of recharging and recirculation of the same electrolyte streams for multiple cycles has been demonstrated. The battery is based on immiscible organic catholyte and aqueous anolyte liquids, which exhibits high capacity retention and columbic efficiency during cycling.<ref>{{Cite journal|last=Bamgbopa|first=Musbaudeen O.|last2=[[Yang Shao-Horn|Shao-Horn]]|first2=Yang|last3=Hashaikeh|first3=Raed|last4=Almheiri|first4=Saif|date=2018-03|title=Cyclable membraneless redox flow batteries based on immiscible liquid electrolytes: Demonstration with all-iron redox chemistry|url=https://doi.org/10.1016/j.electacta.2018.02.063|journal=Electrochimica Acta|volume=267|pages=41–50|doi=10.1016/j.electacta.2018.02.063|issn=0013-4686}}</ref> \n\n[[Primus Power]] has developed patented technology in its zinc bromine flow battery, a type of redox flow battery, to eliminate the membrane or separator, which reduces costs and failure rates. The Primus Power membraneless redox flow battery is working in installations in the United States and Asia with a second generation product announced 21 February 2017.\n\n=== Organic ===\nCompared to traditional aqueous inorganic redox flow batteries such as vanadium redox flow batteries and Zn-Br2 batteries, which have been developed for decades, organic redox flow batteries emerged in 2009 and hold great promise to overcome major drawbacks preventing economical and extensive deployment of traditional inorganic redox flow batteries. The primary merit of organic redox flow batteries lies in the tunable redox properties of the redox-active components.\n\nOrganic redox flow batteries could be further classified into two categories: Aqueous Organic Redox Flow Batteries (AORFBs) and Non-aqueous Organic Redox Flow Batteries (NAORFBs)<ref>{{Cite journal|last=Bamgbopa|first=Musbaudeen O.|last2=[[Yang Shao-Horn|Shao-Horn]]|first2=Yang|last3=Almheiri|first3=Saif|date=2017|title=The potential of non-aqueous redox flow batteries as fast-charging capable energy storage solutions: demonstration with an iron–chromium acetylacetonate chemistry|url=http://xlink.rsc.org/?DOI=C7TA02022H|journal=Journal of Materials Chemistry A|language=en|volume=5|issue=26|pages=13457–13468|doi=10.1039/c7ta02022h|issn=2050-7488}}</ref><ref>{{Cite journal|last=Bamgbopa|first=Musbaudeen O.|last2=Almheiri|first2=Saif|date=2017-02|title=Influence of solvents on species crossover and capacity decay in non-aqueous vanadium redox flow batteries: Characterization of acetonitrile and 1, 3 dioxolane solvent mixture|url=https://doi.org/10.1016/j.jpowsour.2016.12.050|journal=Journal of Power Sources|volume=342|pages=371–381|doi=10.1016/j.jpowsour.2016.12.050|issn=0378-7753}}</ref><ref>{{Cite journal|last=Bamgbopa|first=Musbaudeen O.|last2=Pour|first2=Nir|last3=Shao-Horn|first3=Yang|last4=Almheiri|first4=Saif|date=2017-01|title=Systematic selection of solvent mixtures for non-aqueous redox flow batteries – vanadium acetylacetonate as a model system|url=https://doi.org/10.1016/j.electacta.2016.12.014|journal=Electrochimica Acta|volume=223|pages=115–123|doi=10.1016/j.electacta.2016.12.014|issn=0013-4686}}</ref><ref>{{Cite journal|last=Mustafa|first=Ibrahim|last2=Bamgbopa|first2=Musbaudeen O.|last3=Alraeesi|first3=Eman|last4=Shao-Horn|first4=Yang|last5=Sun|first5=Hong|last6=Almheiri|first6=Saif|date=2017-01-01|title=Insights on the Electrochemical Activity of Porous Carbonaceous Electrodes in Non-Aqueous Vanadium Redox Flow Batteries|url=http://jes.ecsdl.org/content/164/14/A3673|journal=Journal of The Electrochemical Society|language=en|volume=164|issue=14|pages=A3673–A3683|doi=10.1149/2.0621714jes|issn=0013-4651}}</ref>. AORFBs use water as solvent for electrolyte materials while NAORFBs employ organic solvents to dissolve redox active materials. Depending on using one or two organic redox active electrolytes as anode and/or cathode, AORFBs and NAORFBs can be further divided into total organic systems and hybrid organic systems that use inorganic materials for anode or cathode. The proof of concept of AORFBs was demonstrated before NAORFBs. In larger-scale energy storage, AORFBs hold much greater potential than NAORFBs because of the former's lower cost, higher current and power performance, as well as safety advantages of aqueous over non-aqueous electrolytes.  NAORFBs may find their place in limited special applications for their higher energy density than AORFBs though more challenges are to be overcome in terms of safety, cost of organic solvents, radical induced side reactions, electrolyte crossover and limited life time. The content below mainly covers the representative studies on AORFBs.\n\n[[Quinone]]s are the basis of some AORFBs.<ref>Xu, Y.; Wen, Y.; Cheng, J.; Yanga, Y.; Xie, Z.; Cao, G. In ''World Non-Grid-Connected Wind Power and Energy Conference, 2009. WNWEC 2009'' IEEE: Nanjing, China, 2009, p 1.</ref> and 2010.<ref>{{cite journal |journal=Electrochimica Acta |issn = 0013-4686 |volume=55 |issue=3 |title=A study of tiron in aqueous solutions for redox flow battery application |first1 = Yan |last1 = Xu |first2 = Yue-Hua |last2 = Wen |first3 = Jie |last3 = Cheng |first4 = Gao-Ping |last4 = Cao |first5 = Yu-Sheng |last5 = Yang |url=http://www.sciencedirect.com/science/article/pii/S0013468609011906 |year=2010 |pages = 715–720 |doi=10.1016/j.electacta.2009.09.031}}</ref> In one study, 1,2-dihydrobenzoquinone-3,5-disulfonic acid (BQDS) and 1,4-dihydrobenzoquinone-2-sulfonic acid (BQS) were employed as cathodes, and conventional Pb/PbSO<sub>4</sub> was the anolyte in an acid AORFB. These first AORFBs are hybrid systems as they use organic redox active materials only for the cathode side. The quinones accepts two units of electrical charge, compared with one in conventional catholyte, implying that such a battery could store twice as much energy in a given volume.\n\n9,10-Anthraquinone-2,7-disulphonic acid (AQDS), also a [[quinone]], has been evaluated as well.<ref name=Wald /> AQDS undergoes rapid, reversible two-electron/two-proton reduction on a glassy carbon [[electrode]] in [[sulphuric acid]]. An aqueous flow battery with inexpensive carbon electrodes, combining the quinone/hydroquinone couple with the {{chem|Br|2}}/{{chem|Br|−}} [[redox]] couple, yields a peak galvanic [[power density]] exceeding 6,000&nbsp;W/m<sup>2</sup> at 13,000&nbsp;A/m<sup>2</sup>. Cycling showed >99 % storage capacity retention per cycle. Volumetric energy density was over 20&nbsp;Wh/l.<ref name=greencar /> Anthraquinone-2-sulfonic acid and anthraquinone-2,6-disulfonic acid on the negative side and 1,2-dihydrobenzoquinone- 3,5-disulfonic acid on the positive side avoids the use of hazardous Br<sub>2</sub>. The battery was claimed to last for 1,000 cycles without degradation although no official data were published.<ref>{{Cite web|url = http://www.gizmag.com/organic-redox-flow-battery/32739|title = New water-based organic battery is cheap, rechargeable and eco-friendly|date = 29 June 2014|accessdate = |website = |publisher = Gizmag|last = Szondy|first = David}}</ref> While this total organic system appears robust, it has a low cell voltage (ca. 0.55 V) and a low energy density (< 4 Wh/L).\n\nHydrobromic acid used as an electrolyte has been replaced with a far less toxic alkaline solution (1M [[Potassium Hydroxide|KOH]]) and [[ferrocyanide]].<ref>{{cite web|url=http://phys.org/news/2015-09-rechargeable-battery-power-home-rooftop.html|title=A rechargeable battery to power a home from rooftop solar panels|publisher=}}</ref> The higher [[pH]] is less corrosive, allowing the use of inexpensive polymer tanks. The increased electrical resistance in the membrane was compensated by increasing the voltage. The cell voltage was 1.2 V.<ref>{{cite web|url=http://www.scientificamerican.com/article/flow-battery-could-smooth-irregular-wind-and-solar-energy-supply/|title=Flow Battery Could Smooth Irregular Wind and Solar Energy Supply|author=Matthew Gunther,ChemistryWorld|work=Scientific American}}</ref><ref>Alkaline quinone flow battery Lin et al. Science 2015 349 (6255), p. 1529</ref> The cell's efficiency exceeded 99%, while round-trip efficiency measured 84%. The battery has an expected lifetime of at least 1,000 cycles. Its theoretic energy density was 19 Wh per liter.<ref>{{Cite web|title = Greener, safer flow battery could store renewable energy on the cheap|url = http://www.gizmag.com/alkaline-flow-battery/39606/|website = www.gizmag.com|accessdate = 8 December 2015|first = Dario|last = Borghino|date = 30 September 2015}}</ref>  [[Ferrocyanide]]'s chemically stability in high pH KOH solution without forming Fe(OH)2 or Fe(OH)3 needs to be verified before scale-up.\n\nAnother organic AORFB has been demonstrated [[Paraquat|methyl viologen]] as [[anolyte]] and 4-hydroxy-[[2,2,6,6-Tetramethylpiperidine|2,2,6,6-tetramethylpiperidin]]-1-oxyl as catholyte, plus sodium chloride and a low-cost anion exchange membrane to enable charging and discharging. This MV/TEMPO system has the highest cell voltage, 1.25 V, and, possibly, lowest capital cost ($180/kWh) reported for AORFBs. The water-based liquid electrolytes were designed as a drop-in replacement for current systems without replacing existing infrastructure. A 600-milliwatt test battery was stable for 100 cycles with nearly 100 percent efficiency at current densities ranging from 20 to 100 mA per square centimeter, with optimal performance rated at 40-50 mA, at which about 70 percent of the battery's original voltage was retained.<ref>{{Cite web|title = New flow battery projected to cost 60% less than existing standard|url = http://www.gizmag.com/pnnl-low-cost-sustainable-flow-battery/41028|website = www.gizmag.com|accessdate = 23 December 2015|date = 22 December 2015|last = Moss|first = Richard}}</ref><ref>{{Cite journal|title = A Total Organic Aqueous Redox Flow Battery Employing a Low Cost and Sustainable Methyl Viologen Anolyte and 4-HO-TEMPO Catholyte|url = http://onlinelibrary.wiley.com/doi/10.1002/aenm.201501449/abstract|journal = Advanced Energy Materials|date = 1 November 2015|issn = 1614-6840|pages = 1501449|doi = 10.1002/aenm.201501449|language = en|first = Tianbiao|last = Liu|first2 = Xiaoliang|last2 = Wei|first3 = Zimin|last3 = Nie|first4 = Vincent|last4 = Sprenkle|first5 = Wei|last5 = Wang|volume=6}}</ref> The significance of the research is that neutral AORFBs can be more environmentally friendly than acid or alkaline AORFBs while showing electrochemical performance comparable to corrosive acidic or alkaline RFBs. The MV/TEMPO AORFB has an energy density of 8.4 Wh/L with the limitation on the TEMPO side. The next step is to identify a high capacity catholyte to match MV (ca. 3.5 M solubility in water, 93.8 Ah/L).\n\nOne flow-battery concept is based on redox active, organic polymers employs viologen and TEMPO with dialysis membranes. The polymer-based redox-flow battery (pRFB) uses functionalized macromolecules (similar to acrylic glass or [[Styrofoam]]) being dissolved in water as active material for the anode as well as the cathode. Thereby, metals and strongly corrosive electrolytes – like vanadium salts in sulfuric acid – are avoided and simple dialysis membranes can be employed. The membrane, which separates the cathode and the anode of the flow cell, works like a strainer and is produced much more easily and at lower cost than conventional ion-selective membranes. It retains the big “spaghetti”-like polymer molecules, while allowing the small counterions to pass.<ref>Tobias Janoschka, Norbert Martin, Udo Martin, Christian Friebe, Sabine Morgenstern, Hannes Hiller, Martin D. Hager, Ulrich S. Schubert (2015). \"An aqueous, polymer-based redox-flow battery using non-corrosive, safe, and low-cost materials\". ''Nature''. {{doi|10.1038/nature15746}}</ref> The concept may solve the high cost of traditional Nafion membrane but the design and synthesis of redox active polymer with high solubility in water is not trivial.\n\n=== Metal hydride ===\n\nProton flow batteries (PFB) integrate a [[metal hydride]] storage electrode into a reversible [[proton exchange membrane]] (PEM) [[fuel cell]]. During charging, PFB combines hydrogen ions produced from splitting water with electrons and metal particles in one electrode of a fuel cell. The energy is stored in the form of a solid-state metal hydride. Discharge produces electricity and water when the process is reversed and the protons are combined with ambient oxygen. Metals less expensive than lithium can be used and provide greater energy density than lithium cells.<ref name=Quick /><ref name=Andrews />\n\n=== Nano-network ===\nLithium–sulfur system arranged in a network of nanoparticles eliminates the requirement that charge moves in and out of particles that are in direct contact with a conducting plate. Instead, the nanoparticle network allows electricity to flow throughout the liquid. This allows more energy to be extracted.<ref name=MITTech />\n\n=== Semi-solid ===\nIn a semi-solid flow cell, the positive and negative electrodes are composed of particles suspended in a carrier liquid. The positive and negative suspensions are stored in separate tanks and pumped through separate pipes into a stack of adjacent reaction chambers, where they are separated by a barrier such as a thin, porous membrane. The approach combines the basic structure of aqueous-flow batteries, which use electrode material suspended in a liquid electrolyte, with the chemistry of lithium-ion batteries in both carbon-free suspensions and slurries with conductive carbon network.<ref>{{Cite journal|last=Qi|first=Zhaoxiang|last2=Koenig|first2=Gary M.|date=2017-05-12|title=Review Article: Flow battery systems with solid electroactive materials|url=http://avs.scitation.org/doi/10.1116/1.4983210|journal=Journal of Vacuum Science & Technology B, Nanotechnology and Microelectronics: Materials, Processing, Measurement, and Phenomena|volume=35|issue=4|pages=040801|doi=10.1116/1.4983210|issn=2166-2746}}</ref><ref>{{Cite journal|last=Duduta|first=Mihai|date=May 2011|title=Semi-Solid Lithium Rechargeable Flow Battery|url=http://onlinelibrary.wiley.com/doi/10.1002/aenm.201100152/abstract|journal=Advanced Energy Materials|volume=1|pages=511–516|doi=10.1002/aenm.201100152}}</ref><ref>{{Cite journal|last=Qi|first=Zhaoxiang|last2=Koenig Jr.|first2=Gary M.|date=2016-08-15|title=A carbon-free lithium-ion solid dispersion redox couple with low viscosity for redox flow batteries|url=http://www.sciencedirect.com/science/article/pii/S0378775316305638|journal=Journal of Power Sources|volume=323|pages=97–106|doi=10.1016/j.jpowsour.2016.05.033}}</ref> The carbon free semi-solid redox flow battery is also sometimes referred to as [[Solid dispersion redox flow battery|Solid Dispersion Redox Flow Battery]].<ref>{{Cite journal|last=Qi|first=Zhaoxiang|last2=Liu|first2=Aaron L.|last3=Koenig Jr|first3=Gary M.|date=2017-02-20|title=Carbon-free Solid Dispersion LiCoO2 Redox Couple Characterization and Electrochemical Evaluation for All Solid Dispersion Redox Flow Batteries|url=http://www.sciencedirect.com/science/article/pii/S0013468617300579|journal=Electrochimica Acta|volume=228|pages=91–99|doi=10.1016/j.electacta.2017.01.061}}</ref> Dissolving a material changes its chemical behavior significantly. However, suspending bits of solid material preserves the solid's characteristics. The result is a viscous suspension that flows like [[molasses]].<ref>{{Cite news|url = http://www.technologyreview.com/article/425107/go-with-the-flow/|title = Go with the Flow - Cambridge Crude|last = Chandler|first = David L.|date = 23 August 2011|work = [[Technology Review]]|via = }}</ref>\n\n== Chemistries ==\n\nA wide range of chemistries have been tried for flow batteries.<ref name=\"journal.frontiersin.org\"/>\n\n{| class=\"wikitable sortable\"\n|-\n! Couple !! Max. cell voltage (V) !! Average electrode power density (W/m<sup>2</sup>) !! Average fluid energy density (W·h/kg) !! cycles\n|-\n| [[Hydrogen]]–[[lithium bromate]] || 1.1 || 15,000 || 750 || \n|-\n| [[Hydrogen]]–[[lithium chlorate]]|| 1.4 || 10,000 || 1400 ||\n|-\n| [[Bromine]]-[[hydrogen]] || 1.07  || 7,950 || ||\n|-\n| Iron–[[tin]] || 0.62 || <200 || || \n|-\n| Iron–[[titanium]] || 0.43 || <200 || ||\n|-\n| Iron–[[chromium|chrome]] || 1.07 || <200 || ||\n|-\n| Organic (2013) || 0.8 || 13000 ||21.4 Wh/L||10\n|-\n| Organic (2015) || 1.2 || ||7.1 Wh/L||100\n|-\n|MV-TEMPO\n|1.25 \n|\n|8.4 Wh/L\n|100\n|-\n| [[Vanadium redox battery|Vanadium–vanadium (sulphate)]] || 1.4 || ~800 ||25 Wh/L||\n|-\n| [[Vanadium redox battery|Vanadium–vanadium (bromide)]] ||  ||  ||50 Wh/L|| 2000<ref name=\"journal.frontiersin.org\"/>\n|-\n| [[Polysulfide bromide battery|Sodium–bromine polysulfide]] || 1.54 || ~800 || ||\n|-\n| [[Zinc–bromine battery|Zinc–bromine]] || 1.85 || ~1,000 || 75 ||\n|-\n| [[Lead–acid battery|Lead–acid (methanesulfonate)]] || 1.82 || ~1,000 ||\n|-\n| [[Zinc cerium redox flow battery|Zinc–cerium (methanesulfonate)]] || 2.43 || <1,200–2,500<!-- WTF is this supposed to mean? --> ||  ||\n|}\n\n== Advantages and disadvantages ==\n\nRedox flow batteries, and to a lesser extent hybrid flow batteries, have the advantages of flexible layout (due to separation of the power and energy components), long cycle life (because there are no solid-to-solid [[phase transition]]s), quick response times, no need for \"equalisation\" charging (the overcharging of a battery to ensure all cells have an equal charge) and no harmful emissions. Some types also offer easy state-of-charge determination (through voltage dependence on charge), low maintenance and tolerance to overcharge/overdischarge. Compared to solid-state rechargeable batteries such as Li ion, RFBs, and ARFBs in particular, can operate at much higher current and power densities. These technical merits make redox flow batteries a well-suited option for large-scale energy storage.\n\nOn the negative side, the [[Energy density|energy densities]] vary considerably but are, in general, lower compared to portable batteries, such as the [[Li-ion]].\n\nAlso, compared to nonreversible fuel cells or electrolyzers using similar electrolytic chemistries, flow batteries generally have somewhat lower efficiency.\n\nThe development and economy in going from laboratory to industry-scale is an ongoing process. Component cost is one of several aspects of this process. A sulfur-oxygen-salt chemistry has been demonstrated in laboratory.<ref>{{cite journal|url= http://www.cell.com/joule/fulltext/S2542-4351(17)30032-6 |title=Air-Breathing Aqueous Sulfur Flow Battery for Ultralow-Cost Long-Duration Electrical Storage |date=2017-10-11 |website= |publisher= |access-date= |quote= |doi= 10.1016/j.joule.2017.08.007 |volume=1 |journal=Joule |pages=306–327 | last1 = Li | first1 = Zheng | last2 = Sam Pan | first2 = Menghsuan | last3 = Su | first3 = Liang | last4 = Tsai | first4 = Ping-Chun | last5 = Badel | first5 = Andres F. | last6 = Valle | first6 = Joseph M. | last7 = Eiler | first7 = Stephanie L. | last8 = Xiang | first8 = Kai | last9 = Brushett | first9 = Fikile R. | last10 = Chiang | first10 = Yet-Ming}}</ref>\n\n== Applications ==\n\nFlow batteries are normally considered for relatively large (1&nbsp;kWh – 10&nbsp;MWh) stationary applications. These are for\n\n* [[Load balancing (electrical power)|Load balancing]] – where the battery is connected to an [[electrical grid]] to store excess electrical power during off-peak hours and release electrical power during peak demand periods.  The common problem limiting the use of most flow battery chemistries in this application is their low areal power (operating current density) which translates into a high cost of power. \n* Storing energy from renewable sources such as [[wind farm|wind]] or solar for discharge during periods of peak demand.<ref name=REDT />\n* Peak shaving, where spikes of demand are met by the battery.<ref name=redflow />\n* [[Uninterruptible power supply|UPS]], where the battery is used if the main power fails to provide an uninterrupted supply.\n* [[Electric power conversion|Power conversion]] – because all cells share the same electrolyte/s. Therefore, the electrolyte/s may be charged using a given number of cells and discharged with a different number. Because the [[voltage]] of the battery is proportional to the number of cells used the battery can therefore act as a very powerful [[DC–DC converter]]. In addition, if the number of cells is continuously changed (on the input and/or output side) [[Electric power conversion|power conversion]] can also be AC/DC, AC/AC, or DC–AC with the frequency limited by that of the switching gear.<ref name=Spaziente />\n* [[Electric vehicle]]s – Because flow batteries can be rapidly \"recharged\" by replacing the electrolyte, they can be used for applications where the vehicle needs to take on energy as fast as a combustion engined vehicle.<ref name=EVRS /><ref name=EVRSfox /> A common problem found with most RFB chemistries in the EV applications is their low energy density which translated into a short driving range. Flow batteries based on highly soluble halates are a notable exception.<ref name=sse />\n* [[Stand-alone power system]] – An example of this is in cellphone base stations where no grid power is available. The battery can be used alongside solar or wind power sources to compensate for their fluctuating power levels and alongside a generator to make the most efficient use of it to save fuel.<ref name=deeya /><ref name=sandia /> Currently, flow batteries are being used in solar micro grid applications throughout the Caribbean.{{citation needed|date=September 2015}}\n\n== See also ==\n{{Portal|Energy|Renewable energy|Sustainable development}}\n\n{{columns-list|colwidth=30em|\n* [[List of battery types]]\n*[[Electrochemical engineering]]\n* [[Glossary of fuel cell terms]]\n* [[Hydrogen technologies]]\n* [[Load balancing (electrical power)|Load balancing]]\n* [[Polysulfide bromide battery]]\n* [[Redox electrode]]\n* [[Vanadium redox battery|Vanadium redox flow battery]]\n* [[Zinc–cerium battery|Zinc–cerium hybrid flow battery]]\n* [[Zinc–bromine battery|Zinc–bromine hybrid flow battery]]\n* [[Hydrogen bromine battery]]\n\n}}\n\n== References ==\n{{reflist|30em|refs=<ref name=Science-Dictionary>Science-Dictionary.org. \"[http://chemistry.science-dictionary.org/Electrochemistry-Dictionary/electroactive_substance|publisher=Science-Dictionary.org Electroactive Substance]\" 14 May 2013.</ref><ref name=Fujii>T. Fujii, T. Hirose, and N. Kondou, in {{cite patent|JP|status=patent|55096569}} (1979), to Meidensha Electric Mfg. Co. Ltd.</ref><ref name=Bartolozzi>{{Cite journal | last1 = Bartolozzi | first1 = M. | title = Development of redox flow batteries. A historical bibliography | doi = 10.1016/0378-7753(89)80037-0 | journal = Journal of Power Sources | volume = 27 | issue = 3 | pages = 219–234 | year = 1989 | pmid =  | pmc = }}</ref><ref name=LindenReddy>Linden, D.; Reddy, T.B. (2002). Handbook of Batteries (Eds.). McGraw-Hill.</ref><ref name=Shiokawa>{{Cite journal | last1 = Shiokawa | first1 = Y. | last2 = Yamana | first2 = H. | last3 = Moriyama | first3 = H. | doi = 10.1080/18811248.2000.9714891 | title = An Application of Actinide Elements for a Redox Flow Battery | journal = Journal of Nuclear Science and Technology | volume = 37 | issue = 3 | pages = 253–256 | year = 2000 | pmid =  | pmc = }}</ref><ref name=PKLeung>{{Cite journal | last1 = Leung | first1 = P. K. | last2 = Ponce-De-León | first2 = C. | last3 = Low | first3 = C. T. J. | last4 = Shah | first4 = A. A. | last5 = Walsh | first5 = F. C. | title = Characterization of a zinc–cerium flow battery | doi = 10.1016/j.jpowsour.2011.01.095 | journal = Journal of Power Sources | volume = 196 | issue = 11 | pages = 5174–5185 | year = 2011 | pmid =  | pmc = }}</ref><ref name=Borchers>W. Borchers, in {{cite patent|US|status=patent|567959}} (1894)</ref><ref name=Nernst>W. Nernst, in {{cite patent|DE|status=patent|264026}} (1912)</ref><ref name=Keefer>R. M. Keefer, in {{cite patent|US|status=patent|3682704}} (1970), to Electrocell Ltd.</ref><ref name=Kummer_and_Oei_1982>{{Cite journal | last1 = Kummer | first1 = J. T. | last2 = Oei | first2 = D. -G. | doi = 10.1007/BF01059304 | title = A chemically regenerative redox fuel cell. II | journal = Journal of Applied Electrochemistry | volume = 15 | issue = 4 | pages = 619–629 | year = 1985 | pmid =  | pmc = }}</ref><ref name=redflow>[http://www.redflow.com.au/DNSP.htm] {{webarchive |url=https://web.archive.org/web/20100209050109/http://www.redflow.com.au/DNSP.htm |date=9 February 2010 }}</ref><ref name=Spaziente>P. M. Spaziante, K. Kampanatsanyakorn, and A. Zocchi, in {{cite patent|WO|status=patent|03043170}} (2001), to Squirrel Holdings Ltd.</ref><ref name=deeya>{{youtube|id=GbLRKN3srUs|title=Talk by John Davis of Deeya energy about their flow battery's use in the telecomms industry}}</ref><ref name=Kurzweil>{{cite web|url=http://www.kurzweilai.net/new-rechargeable-flow-battery-enables-cheaper-large-scale-energy-storage |title=New rechargeable flow battery enables cheaper, large-scale energy storage |doi=10.1038/ncomms3346 |publisher=KurzweilAI |date= |accessdate=20 August 2013}}</ref><ref name=greencar>{{cite web|url=http://www.greencarcongress.com/2014/01/20140111-qbfb.html|title=Harvard team demonstrates new metal-free organic–inorganic aqueous flow battery; potential breakthrough for low-cost grid-scale storage|date=11 January 2014}}</ref><ref name=Braff>{{Cite journal | last1 = Braff | first1 = W. A. | last2 = Bazant | first2 = M. Z. | last3 = Buie | first3 = C. R. | title = Membrane-less hydrogen bromine flow battery | doi = 10.1038/ncomms3346 | journal = Nature Communications | volume = 4 | year = 2013 | pmid =  23949161| pmc = | page=2346}}</ref><ref name=sandia>[http://www.sandia.gov/ess/publications/SAND2013-2818C.pdf Performance Testing of Zinc-Bromine Flow Batteries for Remote Telecom Sites]</ref><ref name=Wald>{{cite news |title=From Harvard, a Cheaper Storage Battery |url=https://www.nytimes.com/2014/01/09/business/energy-environment/from-harvard-a-cheaper-storage-battery.html|first1=MATTHEW L. |last1=WALD |date=8 January 2014 |accessdate=10 January 2014 |publisher=New York Times}}</ref><ref name=MITTech>{{cite web|author1=Kevin Bullis|title=Nanoparticle Networks Promise Cheaper Batteries for Storing Renewable Energy|url=http://www.technologyreview.com/news/526811/nanoparticle-networks-promise-cheaper-batteries-for-storing-renewable-energy|website=MIT Technology Review|accessdate=24 September 2014|date=24 April 2014}}</ref><ref name=EVRS>{{cite web|title=Electric Vehicle Refuelling System (EVRS) used in conjunction with Vanadium Redox Flow Technology|url=http://www.poweringnow.com/applications/electric-vehicles|work=REDT Energy Storage}}</ref><ref name=EVRSfox>{{cite web|url=http://www.foxnews.com/leisure/2014/07/18/nanoflowcell-powered-quant-e-limo-approved-for-german-road-trials/?intcmp=obnetwork|title=nanoFLOWCELL-powered Quant e-Limo approved for german road trials|author=Antony Ingram|work=Fox News}}</ref><ref name=REDT>{{cite web|last=REDT Energy|title=Storing Renewable Energy|url=http://www.redtenergy.com/applications/renewable-energy}}</ref>\n<ref name=Quick>{{cite web|url=http://www.gizmag.com/proton-flow-battery-hydrogen-electricity-rmit/30818 |title=Proton flow battery simplifies hydrogen power |publisher=Gizmag.com |date= |accessdate=13 February 2014}}</ref><ref name=Andrews>{{Cite journal | doi = 10.1016/j.ijhydene.2013.11.010| title = Towards a 'proton flow battery': Investigation of a reversible PEM fuel cell with integrated metal-hydride hydrogen storage| journal = International Journal of Hydrogen Energy| volume = 39| issue = 4| pages = 1740–1751| year = 2014| last1 = Andrews | first1 = J. | last2 = Seif Mohammadi | first2 = S. }}</ref>\n<ref name=sse>{{cite journal|last1=Tolmachev|first1=Yuriy V.|last2=Piatkivskyi|first2=Andrii|last3=Ryzhov|first3=Victor V.|last4=Konev|first4=Dmitry V.|last5=Vorotyntsev|first5=Mikhail A.|title=Energy cycle based on a high specific energy aqueous flow battery and its potential use for fully electric vehicles and for direct solar-to-chemical energy conversion|journal=Journal of Solid State Electrochemistry|date=2015|volume=19|issue= 9|pages=2711–2722|url=https://link.springer.com/article/10.1007/s10008-015-2805-z?no-access=true|doi=10.1007/s10008-015-2805-z}}</ref>}}\n\n== External links ==\n* [http://www.mpoweruk.com/flow.htm Electropaedia on Flow Batteries]\n* [http://www.imr-oarai.jp/en/research/research4-5.html Research on the uranium redox flow battery]\n* {{youtube|id=lAW-mMsCNlU|title=How flow batteries work}}\n\n{{Galvanic cells}}\n\n{{Fuel cells}}\n\n{{Clear}}\n\n[[Category:Fuel cells]]\n[[Category:Battery types]]",
            "slug": "flow-battery",
            "date_updated": 1531054839083,
            "imported": "https://en.wikipedia.org/wiki/Flow_battery"
        }
    ]
}