{
    "article": [
        {
            "title": "Sybil attack",
            "text": "{{multiple issues|\n{{cleanup-reorganize|date=January 2017}}\n{{essay-like|date=January 2017}}\n{{original research|date=January 2017}}\n{{refimprove|date=January 2017}}\n}}\nThe '''Sybil attack''' in [[computer security]] is an attack wherein a [[reputation system]] is subverted by forging identities in [[peer to peer|peer-to-peer]] [[computer network|networks]]. It is named after the subject of the book ''[[Sybil (book)|Sybil]]'', a case study of a woman diagnosed with [[dissociative identity disorder]].<ref>Lynn Neary (20 October 2011). [http://www.npr.org/2011/10/20/141514464/real-sybil-admits-multiple-personalities-were-fake Real 'Sybil' Admits Multiple Personalities Were Fake]. NPR. Retrieved 8 February 2017.</ref>  The name was suggested in or before 2002 by Brian Zill at [[Microsoft Research]].<ref>{{cite journal|last=Douceur|first=John R.|title=The Sybil Attack|journal=International workshop on Peer-To-Peer Systems|year=2002|url=http://research.microsoft.com/pubs/74220/IPTPS2002.pdf|accessdate=23 April 2016}}</ref> The term '''pseudospoofing''' had previously been coined by L. Detweiler on the [[cypherpunk#Origin of the term.2C and the Cypherpunks mailing list|Cypherpunks mailing list]] and used in the literature on peer-to-peer systems for the same class of attacks prior to 2002, but this term did not gain as much influence as \"Sybil attack\".<ref>{{cite book|last=Oram|first=Andrew|title=Peer-to-peer: harnessing the benefits of a disruptive technology}}</ref>\n\n==Description==\nIn a Sybil attack, the attacker subverts the reputation system of a peer-to-peer [[computer network|network]] by creating a large number of [[pseudonymity|pseudonymous]] identities, using them to gain a disproportionately large influence.  A reputation system's vulnerability to a Sybil attack depends on how cheaply identities can be generated, the degree to which the reputation system accepts inputs from entities that do not have a chain of trust linking them to a trusted entity, and whether the reputation system treats all entities identically. {{asof|2012}}, evidence showed that large-scale Sybil attacks could be carried out in a very cheap and efficient way in extant realistic systems such as BitTorrent Mainline DHT.<ref name=wang2012>\n{{cite journal|last=Wang|first=Liang|last2=Kangasharju|first2=Jussi |title=Real-world sybil attacks in BitTorrent mainline DHT |journal=IEEE GLOBECOM |year=2012 |url=http://ieeexplore.ieee.org/xpl/login.jsp?tp=&arnumber=6503215&url=http%3A%2F%2Fieeexplore.ieee.org%2Fxpls%2Fabs_all.jsp%3Farnumber%3D6503215 |accessdate=30 September 2013}}</ref><ref name=wang2013>\n{{cite journal |last=Wang|first=Liang |last2=Kangasharju|first2=Jussi |title=Measuring Large-Scale Distributed Systems: Case of BitTorrent Mainline DHT |journal=IEEE Peer-to-Peer |year=2013 |url=http://www.cs.helsinki.fi/u/lxwang/publications/P2P2013_13.pdf |accessdate=30 September 2013 }}</ref>\n\nAn ''entity'' on a peer-to-peer network is a piece of software which has access to local resources. An entity advertises itself on the peer-to-peer network by presenting an ''identity''. More than one identity can correspond to a single entity. In other words, the mapping of identities to entities is many to one. Entities in peer-to-peer networks use multiple identities for purposes of redundancy, resource sharing, reliability and integrity. In peer-to-peer networks, the identity is used as an abstraction so that a remote entity can be aware of identities without necessarily knowing the correspondence of identities to local entities. By default, each distinct identity is usually assumed to correspond to a distinct local entity. In reality, many identities may correspond to the same local entity.\n\nAn adversary may present multiple identities to a peer-to-peer network in order to appear and function as multiple distinct nodes. The adversary may thus be able to acquire a disproportionate level of control over the network, such as by affecting voting outcomes.\n\nIn the context of (human) [[online community|online communities]], such multiple identities are sometimes known as [[sockpuppet (Internet)|sockpuppet]]s.\n\n==Example==\nA notable Sybil attack (in conjunction with a [[traffic confirmation attack]]) was launched against the [[Tor (anonymity network)|Tor anonymity network]] for several months in 2014 by unknown perpetrators.<ref>(30 July 2014). [https://blog.torproject.org/blog/tor-security-advisory-relay-early-traffic-confirmation-attack Tor security advisory: \"relay early\" traffic confirmation attack].</ref><ref>Dan Goodin (31 July 2014). [https://arstechnica.com/security/2014/07/active-attack-on-tor-network-tried-to-decloak-users-for-five-months/ Active attack on Tor network tried to decloak users for five months].</ref>\n\n==Prevention==\nValidation techniques can be used to prevent Sybil attacks and dismiss masquerading hostile entities. A local entity may accept a remote identity based on a central authority which ensures a one-to-one correspondence between an identity and an entity and may even provide a reverse lookup. An identity may be validated either directly or indirectly. In direct validation the local entity queries the central authority to validate the remote identities. In indirect validation the local entity relies on already accepted identities which in turn vouch for the validity of the remote identity in question.\n\nIdentity-based validation techniques generally provide accountability at the expense of [[anonymity]], which can be an undesirable tradeoff especially in online forums that wish to permit [[censorship]]-free information exchange and  open discussion of sensitive topics.  A validation authority can attempt to preserve users' anonymity by refusing to perform reverse lookups, but this approach makes the validation authority a prime target for attack.  Alternatively, the authority can use some mechanism other than knowledge of a user's real identity - such as verification of an ''unidentified'' person's physical presence at a particular place and time - to enforce a one-to-one correspondence between online identities and real-world users.\n\nSybil prevention techniques based on the connectivity characteristics of social graphs can also limit the extent of damage that can be caused by a given Sybil attacker while preserving anonymity, though these techniques cannot prevent Sybil attacks entirely, and may be vulnerable to widespread small-scale Sybil attacks. Examples of such prevention techniques are SybilGuard and the [[Advogato#Trust_metric|Advogato Trust Metric]]<ref>{{cite web|last=O'Whielacronx|first=Zooko|title=Levien's attack-resistant trust metric|url=http://permalink.gmane.org/gmane.network.peer-to-peer.p2p-hackers/2092|work=<p2p-hackers at lists.zooko.com>|publisher=gmane.org|accessdate=10 February 2012|authorlink=Zooko Wilcox-O'Hearn}}</ref> and also the sparsity based metric to identify Sybil clusters in a distributed P2P based reputation system.<ref>{{cite journal|last=Kurve|first=Aditya C.|title=Sybil Detection via Distributed Sparse Cut Monitoring|journal=International Communication Conference ICC|year=2011|url=http://ieeexplore.ieee.org/xpls/abs_all.jsp?arnumber=5963402&tag=1|accessdate=31 March 2011}}</ref>\n\nAlternatively, [[Proof-of-work system|proof of work]] can be used to make Sybil attacks more expensive.<ref>{{Cite web|url=https://en.bitcoin.it/wiki/Bit_Gold_proposal|title=Bit Gold proposal - Bitcoin Wiki|website=en.bitcoin.it|language=en|access-date=2018-01-19}}</ref>\n\n==See also==\n{{Portal|Information technology}}\n*[[Ballot stuffing]]\n\n==References==\n{{Reflist|30em}}\n{{More footnotes|date=April 2011}}\n\n==External links==\n*[http://www.cs.helsinki.fi/u/lxwang/publications/P2P2013_13.pdf Measuring Large-Scale Distributed Systems: Case of BitTorrent Mainline DHT] by Liang Wang and Jussi Kangasharju. IEEE P2P 2013.\n*[http://ieeexplore.ieee.org/xpl/login.jsp?tp=&arnumber=6503215&url=http%3A%2F%2Fieeexplore.ieee.org%2Fxpls%2Fabs_all.jsp%3Farnumber%3D6503215 Real-world sybil attacks in BitTorrent mainline DHT] by Liang Wang and Jussi Kangasharju. IEEE GLOBECOM 2012.\n*[http://eprints.ucl.ac.uk/18812/1/18812.pdf Sybil Attacks Against Mobile Users: Friends and Foes to the Rescue] by Daniele Quercia and Stephen Hailes. IEEE INFOCOM 2010.\n*[http://thrackle.eas.asu.edu/users/goran/papers/dc06.pdf On the establishment of distinct identities in overlay networks] by Rida A. Bazzi and Goran Konjevod\n*[http://pdos.csail.mit.edu/papers/accountable-pseudonyms-socialnets08.pdf An Offline Foundation for Online Accountable Pseudonyms] by Bryan Ford and Jacob Strauss\n*[http://pdos.csail.mit.edu/papers/sybil-dht-socialnets08.pdf A Sybil-proof one-hop DHT] by Chris Lesniewski-Laas\n*[http://www.ece.cmu.edu/~adrian/projects/sybil.pdf The Sybil Attack in Sensor Networks: Analysis & Defenses]\n*[https://gnunet.org/sites/default/files/Tech%20Report%20-%20A%20Survey%20of%20Solutions%20to%20the%20Sybil%20Attack.pdf A Survey of Solutions to the Sybil Attack]\n*[http://www.csd.uoc.gr/~hy558/papers/sybilguard.pdf SybilGuard: Defending Against Sybil Attacks via Social Networks]\n*[http://dimacs.rutgers.edu/Workshops/InformationSecurity/slides/gamesandreputation.pdf On Network formation: Sybil attacks and Reputation systems]\n*[https://www.cs.tcd.ie/publications/tech-reports/reports.05/TCD-CS-2005-47.pdf Trust Transfer: Encouraging Self-Recommendations without Sybil Attack]\n*[http://www.globule.org/publi/SDST_acmcs2009.html A Survey of DHT Security Techniques] by Guido Urdaneta, Guillaume Pierre and Maarten van Steen. ACM Computing surveys, 2009.\n*[http://www.unibg.it/lazzari/doc/marco_lazzari_reputation_algorithms_professional_social_networks_naymz.htm An experiment on the weakness of reputation algorithms used in professional social networks: the case of Naymz] by Marco Lazzari. Proceedings of the IADIS International Conference e-Society 2010.\n{{Use dmy dates|date=April 2011}}\n\n[[Category:Computer network security]]\n[[Category:Reputation management]]",
            "slug": "sybil-attack",
            "date_updated": 1519553218880,
            "imported": "https://en.wikipedia.org/wiki/Sybil_attack"
        }
    ]
}