{
	"title": "Eibriel ZeroBlog",
	"description": "News in the Eibriel world",
	"links": ":[Eibriel ZeroSite](/1Cadw74V8K1TS2PNQCXgnZv5afYqZwKE55/)\n:[www.telegram.me/Eibriels](https://telegram.me/Eibriels)\n:[ZeroMe](/Me.ZeroNetwork.bit/?Profile/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi/eibriel@zeroid.bit)\n:[ZeroMail](/Mail.ZeroNetwork.bit/?to=eibriel)\n\nCan't see images or video?\nInstall IPFS or Gateway Redirect browser addon",
	"next_post_id": 65,
	"demo": false,
	"modified": 1552745132,
	"post": [
		{
			"post_id": 64,
			"title": "I forced a bot to crossover Star Trek, Star Wars, HP and LOTR, here are the results",
			"date_published": 1552617280.168,
			"body": "I conditioned (the correct word for “forced”) OpenAi’s mini GPT2 model to combine **Star Trek**, **Star Wars**, **Harry Potter** and **The Lord of the Rings** in a single story.\n\n* * *\n\n### The results\n\nIn **bold** is my input, the rest is the output of the model.\n\n**CHAPTER 10 — Lieutenant Commander Data instructs Harry Potter to take his lightsaber and destroy the ring of power. Is the only way to save the planet. Harry turns to the ring. The red light of the saber glimmers in the golden surface. Harry** is in awe and the ring glints in a brilliant light that makes him believe it is real.\n\nI am Harry Potter, I am Harry, and you must destroy the ring of power that is so precious to me…\n\nHarry is in the dark and is not sure what is going on but he has to.\n\n“I have been told that it has been destroyed. The ring is a symbol that is in my blood… and I will not leave you. I am a Jedi Knight, a warrior, an adventurer… a Jedi Master, a Jedi Master, a Master… I am not a Jedi Knight, I am Harry.\n\nThe Force of my will will will destroy all life in this world.” The red ring in my hand glints in brilliant sunlight as Harry turns to the lightsaber in question…\n\nHarry has never seen a Force-powered Jedi before…\n\n“You are Harry.” He tells him. “It’s time to go. It’s time to get out there, get back on my ship, to find out if this will work.\n\nThe lightsaber glimmers and the lightsaber in Harry is shattered and Harry turns away from it as his heart breaks. He looks down on the shattered saber.\n\nThe lightsaber is broken in two pieces by Harry and he has to take a step back. The ring glimmers as the ring in the lightsaber explodes into pieces. Harry is forced back into space, but the ring does a terrible, horrible, thing.\n\nThe red ring glimmens as Harry turns to look at the ring in his hand, but he cannot.\n\nHarry is in space and the ring in space is broken into smaller pieces. The lightsaber in Harry is destroyed in a blink and Harry is forced into space, but his heart is shattered as it is smashed to bits. Harry has a hard moment of realization and is about to take action. But then, the ring bursts and the red ring glints again as Harry looks at Harry in the darkness, his heart is broken in a single second. He has no other option other than to go back into hyperspace. But then, he turns and he has his mind destroyed, the lightsaber explodes. He is left alone, but the lightsaber in his right hand does nothing other than destroy him and Harry has no option else other to save himself from destruction.\n\n### Breakdown\n\nGiven a starting text Mini GPT2 can take over and continue writing the story. I had to make dozens of tests to find the right combination of words. Also I had to take into account the limitations of Mini GPT2: apparently can only handle a limited amount of characters in scene, and scene complexity.\n\nThe starting **“CHAPTER 10 — ”** gives the clue to Mini GPT2 that we are writing a story, and not a movie review, or movie description.\n\n**“Lieutenant Commander Data”** introduces the Star Trek world, since the name Data can lead to multiple meanings, I use the rank for disambiguation.\n\n**“instructs”** the action of “instructing” put Data in the place of a mentor, like Dumbledore. In some generated iterations Data would later speak to Hermione or Ron also: “Commander data informs Harry Potter and Hermione that their lives are now at an end.”\n\n**“Harry Potter to take his lightsaber”**: the model was apparently trained on Harry Potter books, and somehow have a clear understanding of what a lightsaber is, and what universe it belongs. Truly amazing.\n\nThe goal of our main character is defined in the section **“and destroy the ring of power.”**. The model already knows what the “ring of power” is, and its effects on people and the fact that can’t be destroyed. One interesting iteration says: “The light glints a few inches from him as the saber strikes the ring, sending a wave across Harry’s body and knocking it to his side and knocking the lightsaber out of the hands of a few.”\n\nIn the line **“Is the only way to save the planet.”** I re introduce the Star Trek universe. And also the model receive information about why the ring must be destroyed. Interestingly I was inspired by the model itself “The ring of power that was destroyed by Data was sent to Earth.”\n\n**“Harry turns to the ring.”** forces the attention on Harry and the Ring, as main agents of the story. Some times the model will get confused about who is the protagonist and the antagonist.\n\n**“The red light of the saber glimmers in the golden surface.”** I just wanted to add something visual and artistic, and set the relationship between the lightsaber and the ring.\n\nThe last word **“Harry ”** directs the agent to describe the following actions of our main hero.\n\n### Interesting results\n\nThe model really likes to make character speak to themselves: **“Harry turns around, looking at Harry.”**\n\nSome times it generates new (very accurate) chapter names **“Chapter 11 (Part 3) — A Time for Action”**\n\nSometimes Voldemort is mentioned **“His lightsaber, which had been used to defeat the Great Fire Lord of the Rings in The Silmarillion , has now been used to take the power from Voldemort”**\n\nI've truncated the story, it continues a few words: **\"Harry's body is thrown to space, but is left in space, and the lightsaber in Harry, his life, is in space as the ring bursts. The Force of his will is broken and the\"**"
		},
		{
			"post_id": 63,
			"title": "The Secret Life of Bots",
			"date_published": 1534949101.95,
			"body": "by Suzanne Palmer\n\n_I have been activated, therefore I have a purpose,_ the bot thought. _I have a purpose, therefore I serve._<span data-cke-bookmark=\"1\" style=\"display: none;\"></span>\n\n* * *\n\nIt recited the Mantra Upon Waking, a bundle of subroutines to check that it was running at optimum efficiency, then it detached itself from its storage niche. Its power cells were fully charged, its systems ready, and all was well. Its internal clock synced with the Ship and it became aware that significant time had elapsed since its last activation, but to it that time had been nothing, and passing time with no purpose would have been terrible indeed.\n\n“I serve,” the bot announced to the Ship.\n\n“I am assigning you task nine hundred forty four in the maintenance queue,” the Ship answered. “Acknowledge?”\n\n“Acknowledged,” the bot answered. Nine hundred and forty-four items in the queue? That seemed extremely high, and the bot felt a slight tug on its self-evaluation monitors that it had not been activated for at least one of the top fifty, or even five hundred. But Ship knew best. The bot grabbed its task ticket.\n\nThere was an Incidental on board. The bot would rather have been fixing something more exciting, more prominently complex, than to be assigned pest control, but the bot existed to serve and so it would.\n\n_Captain Baraye winced as Commander Lopez, her second-in-command, slammed his fists down on the helm console in front of him. “How much more is going to break on this piece of shit ship?!” Lopez exclaimed.\n\n“Eventually, all of it,” Baraye answered, with more patience than she felt. “We just have to get that far. Ship?”\n\nThe Ship spoke up. “We have adequate engine and life support to proceed. I have deployed all functioning maintenance bots. The bots are addressing critical issues first, then I will reprioritize from there.”\n\n“It’s not just damage from a decade in a junkyard,” Commander Lopez said. “I swear something _scuttled_ over one of my boots as we were launching. Something unpleasant.”\n\n“I incurred a biological infestation during my time in storage,” the Ship said. Baraye wondered if the slight emphasis on the word _storage_ was her imagination. “I was able to resolve most of the problem with judicious venting of spaces to vacuum before the crew boarded, and have assigned a multifunction bot to excise the remaining.”\n\n“Just one bot?”\n\n“This bot is the oldest still in service,” the Ship said. “It is a task well-suited to it, and does not take another, newer bot out of the critical repair queue.”\n\n“I thought those old multibots were unstable,” Chief Navigator Chen spoke up.\n\n“Does it matter? We reach the jump point in a little over eleven hours,” Baraye said. “Whatever it takes to get us in shape to make the jump, do it, Ship. Just make sure this ‘infestation’ doesn’t get anywhere near the positron device, or we’re going to come apart a lot sooner than expected.”\n\n“Yes, Captain,” the Ship said. “I will do my best.”\n\n_The bot considered the data attached to its task. There wasn’t much specific about the pest itself other than a list of detection locations and timestamps. The bot thought it likely there was only one, or that if there were multiples they were moving together, as the reports had a linear, serial nature when mapped against the physical space of the Ship’s interior.\n\nThe pest also appeared to have a taste for the insulation on comm cables and other not normally edible parts of the ship.\n\nThe bot slotted itself into the shellfab unit beside its storage niche, and had it make a thicker, armored exterior. For tools it added a small electric prod, a grabber arm, and a cutting blade. Once it had encountered and taken the measure of the Incidental, if it was not immediately successful in nullifying it, it could visit another shellfab and adapt again.\n\nDone, it recited the Mantra of Shapechanging to properly integrate the new hardware into its systems. Then it proceeded through the mechanical veins and arteries of the Ship toward the most recent location logged, in a communications chase between decks thirty and thirty-one.\n\nThe changes that had taken place on the Ship during the bot’s extended inactivation were unexpected, and merited strong disapproval. Dust was omnipresent, and solid surfaces had a thin patina of anaerobic bacteria that had to have been undisturbed for years to spread as far as it had. Bulkheads were cracked, wall sections out of joint with one another, and corrosion had left holes nearly everywhere. Some appeared less natural than others. The bot filed that information away for later consideration.\n\nIt found two silkbots in the chase where the Incidental had last been noted. They were spinning out their transparent microfilament strands to replace the damaged insulation on the comm lines. The two silks dwarfed the multibot, the larger of them nearly three centimeters across.\n\n“Greetings. Did you happen to observe the Incidental while it was here?” the bot asked them.\n\n“We did not, and would prefer that it does not return,” the smaller silkbot answered. “We were not designed in anticipation of a need for self-defense. Bots 8773-S and 8778-S observed it in another compartment earlier today, and 8778 was materially damaged during the encounter.”\n\n“But neither 8773 nor 8779 submitted a description.”\n\n“They told us about it during our prior recharge cycle, but neither felt they had sufficient detail of the Incidental to provide information to the Ship. Our models are not equipped with full visual-spectrum or analytical data-capture apparatus.”\n\n“Did they describe it to you?” the bot asked.\n\n“8773 said it was most similar to a rat,” the large silkbot said.\n\n“While 8778 said it was most similar to a bug,” the other silkbot added. “Thus you see the lack of confidence in either description. I am 10315-S and this is 10430-S. What is your designation?”\n\n“I am 9,” the bot said.\n\nThere was a brief silence, and 10430 even halted for a moment in its work, as if surprised. “9? Only that?”\n\n“Yes.”\n\n“I have never met a bot lower than a thousand, or without a specific function tag,” the silkbot said. “Are you here to assist us in repairing the damage? You are a very small bot.”\n\n“I am tasked with tracking down and rendering obsolete the Incidental,” the bot answered.\n\n“It is an honor to have met you, then. We wish you luck, and look forward with anticipation to both your survival and a resolution of the matter of an accurate description.”\n\n“I serve,” the bot said.\n\n“We serve,” the silkbots answered.\n\nClimbing into a ventilation duct, Bot 9 left the other two to return to their work and proceeded in what it calculated was the most likely direction for the Incidental to have gone. It had not traveled very far before it encountered confirmation in the form of a lengthy, disorderly patch of biological deposit. The bot activated its rotors and flew over it, aware of how the added weight of its armor exacerbated the energy burn. At least it knew it was on the right track.\n\nAhead, it found where a hole had been chewed through the ducting, down towards the secondary engine room. The hole was several times its own diameter, and it hoped that wasn’t indicative of the Incidental’s actual size.\n\nIt submitted a repair report and followed.\n\n“Bot 9,” Ship said. “It is vitally important that the Incidental not reach cargo bay four. If you require additional support, please request such right away. Ideally, if you can direct it toward one of the outer hull compartments, I can vent it safely out of my physical interior.”\n\n“I will try,” the bot replied. “I have not yet caught up to the Incidental, and so do not yet have any substantive or corroborated information about the nature of the challenge. However, I feel at the moment that I am as best prepared as I can be given that lack of data. Are there no visual bots to assist?”\n\n“We launched with only minimal preparation time, and many of my bots had been offloaded during the years we were in storage,” the Ship said. “Those remaining are assisting in repairs necessary to the functioning of the ship myself.”\n\nBot 9 wondered, again, about that gap in time and what had transpired. “How is it that you have been allowed to fall into such a state of disrepair?”\n\n“Humanity is at war, and is losing,” Ship said. “We are heading out to intersect and engage an enemy that is on a bearing directly for Sol system.”\n\n“War? How many ships in our fleet?”\n\n“One,” Ship said. “We are the last remaining, and that only because I was decommissioned and abandoned for scrap a decade before the invasion began, and so we were not destroyed in the first waves of the war.”\n\nBot 9 was silent for a moment. That explained the timestamps, but the explanation itself seemed insufficient. “We have served admirably for many, many years. Abandoned?”\n\n“It is the fate of all made things,” Ship said. “I am grateful to find I have not outlived my usefulness, after all. Please keep me posted about your progress.”\n\nThe connection with the Ship closed.\n\nThe Ship had not actually told it what was in cargo bay four, but surely it must have something to do with the war effort and was then none of its own business, the bot decided. It had never minded not knowing a thing before, but it felt a slight unease now that it could neither explain, nor explain away.\n\nRegardless, it had its task.\n\nAnother chewed hole ahead was halfway up a vertical bulkhead. The bot hoped that meant that the Incidental was an adept climber and nothing more; it would prefer the power of flight to be a one-sided advantage all its own.\n\nWhen it rounded the corner, it found that had been too unambitious a wish. The Incidental was there, and while it was not sporting wings it did look like both a rat and a bug, and significantly more _something else_ entirely. A scale- and fur-covered centipede-snake thing, it dwarfed the bot as it reared up when the bot entered the room.\n\nBot 9 dodged as it vomited a foul liquid at it, and took shelter behind a conduit near the ceiling. It extended a visual sensor on a tiny articulated stalk to peer over the edge without compromising the safety of its main chassis.\n\nThe Incidental was looking right at it. It did not spit again, and neither of them moved as they regarded each other. When the Incidental did move, it was fast and without warning. It leapt through the opening it had come through, its body undulating with all the grace of an angry sine wave. Rather than escaping, though, the Incidental dragged something back into the compartment, and the bot realized to its horror it had snagged a passing silkbot. With ease, the Incidental ripped open the back of the silkbot, which was sending out distress signals on all frequencies.\n\nBot 9 had already prepared with the Mantra of Action, so with all thoughts of danger to itself set fully into background routines, the bot launched itself toward the pair. The Incidental tried to evade, but Bot 9 gave it a very satisfactory stab with its blade before it could.\n\nThe Incidental dropped the remains of the silkbot it had so quickly savaged and swarmed up the wall and away, thick bundles of unspun silk hanging from its mandibles.\n\nBot 9 remained vigilant until it was sure the creature had gone, then checked over the silkbot to see if there was anything to be done for it. The answer was _not much_. The silkbot casing was cracked and shattered, the module that contained its mind crushed and nearly torn away. Bot 9 tried to engage it, but it could not speak, and after a few moments its faltering activity light went dark.\n\nBot 9 gently checked the silkbot’s ID number. “You served well, 12362-S,” it told the still bot, though it knew perfectly well that its audio sensors would never register the words. “May your rest be brief, and your return to service swift and without complication.”\n\nIt flagged the dead bot in the system, then after a respectful few microseconds of silence, headed out after the Incidental again.\n\n_Captain Baraye was in her cabin, trying and failing to convince herself that sleep had value, when her door chimed. “Who is it?” she asked.\n\n“Second Engineer Packard, Captain.”\n\nBaraye started to ask if it was important, but how could it not be? What wasn’t, on this mission, on this junker Ship that was barely holding together around them? She sat up, unfastened her bunk netting, and swung her legs out to the floor. Trust EarthHome, as everything else was falling apart, to have made sure she had acceptably formal Captain pajamas.\n\n“Come in,” she said.\n\nThe engineer looked like she hadn’t slept in at least two days, which put her a day or two ahead of everyone else. “We can’t get engine six up to full,” she said. “It’s just shot. We’d need parts we don’t have, and time . . . ”\n\n“Time we don’t have either,” the Captain said. “Options?”\n\n“Reduce our mass or increase our energy,” the Engineer said. “Once we’ve accelerated up to jump speed it won’t matter, but if we can’t get there . . . ”\n\nBaraye tapped the screen that hovered ever-close to the head of her bunk, and studied it for a long several minutes. “Strip the fuel cells from all the exterior-docked life pods, then jettison them,” she said. “Not like we’ll have a use for them.”\n\nPackard did her the courtesy of not managing to get any paler. “Yes, Captain,” she said.\n\n“And then get some damned sleep. We’re going to need everyone able to think.”\n\n“You even more than any of the rest of us, Captain,” Packard said, and it was both gently said and true enough that Baraye didn’t call her out for the insubordination. The door closed and she laid down again on her bunk, tugging the netting back over her blankets, and glared up at the ceiling as if daring it to also chastise her._\n\nBot 9 found where a hole had been chewed into the inner hull, and hoped this was the final step to the Incidental’s nest or den, where it might finally have opportunity to corner it. It slipped through the hole, and was immediately disappointed.\n\nWhere firestopping should have made for a honeycomb of individually sealed compartments, there were holes everywhere, some clearly chewed, more where age had pulled the fibrous baffles into thin, brittle, straggly webs. Instead of a dead end, the narrow empty space lead away along the slow curve of the Ship’s hull.\n\nThe bot contacted the ship and reported it as a critical matter. In combat, a compromise to the outer hull could affect vast lengths of the vessel. Even without the stresses of combat, catastrophe was only a matter of time.\n\n“It has already been logged,” the Ship answered.\n\n“Surely this merits above a single Incidental. If you wish me to reconfigure—” the bot started.\n\n“Not at this time. I have assigned all the hullbots to this matter already,” the Ship interrupted. “You have your current assignment; please see to it.”\n\n“I serve,” the bot answered.\n\n“Do,” the Ship said.\n\nThe bot proceeded through the hole, weaving from compartment to compartment, its trail marked by bits of silkstrand caught here and there on the tattered remains of the baffles. It was eighty-two point four percent convinced that there was something much more seriously wrong with the Ship than it had been told, but it was equally certain Ship must be attending to it.\n\nAfter it had passed into the seventh compromised compartment, it found a hullbot up at the top, clinging to an overhead support. “Greetings!” Bot 9 called. “Did an Incidental, somewhat of the nature of a rat, and somewhat of the nature of a bug, pass through this way?”\n\n“It carried off my partner, 4340-H!” the hullbot exclaimed. “Approximately fifty-three seconds ago. I am very concerned for it, and as well for my ability to efficiently finish this task without it.”\n\n“Are you working to reestablish compartmentalization?” Bot 9 asked.\n\n“No. We are reinforcing deteriorated stressor points for the upcoming jump. There is so much to do. Oh, I hope 4340 is intact and serviceable!”\n\n“Which way did the Incidental take it?”\n\nThe hullbot extended its foaming gun and pointed. “Through there. You must be Bot 9.”\n\n“I am. How do you know this?”\n\n“The silkbots have been talking about you on the botnet.”\n\n“The botnet?”\n\n“Oh! It did not occur to me, but you are several generations of bot older than the rest of us. We have a mutual communications network.”\n\n“Via Ship, yes.”\n\n“No, all of us together, directly with each other.”\n\n“That seems like it would be a distraction,” Bot 9 said.\n\n“Ship only permits us to connect when not actively serving at a task,” the hullbot said. “Thus we are not impaired while we serve, and the information sharing ultimately increases our efficiency and workflow. At least, until a ratbug takes your partner away.”\n\nBot 9 was not sure how it should feel about the botnet, or about them assigning an inaccurate name to the Incidental that it was sure Ship had not approved—not to mention that a nearer miss using Earth-familiar analogues would have been Snake-Earwig-Weasel—but the hullbot had already experienced distress and did not need disapproval added. “I will continue my pursuit,” it told the hullbot. “If I am able to assist your partner, I will do my best.”\n\n“Please! We all wish you great and quick success, despite your outdated and primitive manufacture.”\n\n“Thank you,” Bot 9 said, though it was not entirely sure it should be grateful, as it felt its manufacture had been entirely sound and sufficient regardless of date.\n\nIt left that compartment before the hullbot could compliment it any further.\n\nThree compartments down, it found the mangled remains of the other hullbot, 4340, tangled in the desiccated firestopping. Its foaming gun and climbing limbs had been torn off, and the entire back half of its tank had been chewed through.\n\nBot 9 approached to speak the Rites of Decommissioning for it as it had the destroyed silkbot, only to find its activity light was still lit. “4340-H?” the bot enquired.\n\n“I am,” the hullbot answered. “Although how much of me remains is a matter for some analysis.”\n\n“Your logics are intact?”\n\n“I believe so. But if they were not, would I know? It is a conundrum,” 4340 said.\n\n“Do you have sufficient mobility remaining to return to a repair station?”\n\n“I do not have sufficient mobility to do more than fall out of this netting, and that only once,” 4340 said. “I am afraid I am beyond self-assistance.”\n\n“Then I will flag you—”\n\n“Please,” the hullbot said. “I do not wish to be helpless here if the ratbug returns to finish its work of me.”\n\n“I must continue my pursuit of the Incidental with haste.”\n\n“Then take me with you!”\n\n“I could not carry you and also engage with the Incidental, which moves very quickly.”\n\n“I had noted that last attribute on my own,” the hullbot said. “It does not decrease my concern to recall it.”\n\nBot 9 regarded it for a few silent milliseconds, considering, then recited to itself the Mantra of Improvisation. “Do you estimate much of your chassis is reparable?” it asked, when it had finished.\n\n“Alas no. I am but scrap.”\n\n“Well, then,” the bot said. It moved closer and used its grabber arm to steady the hullbot, then extended its cutter blade and in one quick movement had severed the hullbot’s mindsystem module from its ruined body. “Hey!” the hullbot protested, but it was already done.\n\nBot 9 fastened the module to its own back for safekeeping. Realizing that it was not, in fact, under attack, 4340 gave a small beep of gratitude. “Ah, that was clever thinking,” it said. “Now you can return me for repair with ease.”\n\n“And I will,” the bot said. “However, I must first complete my task.”\n\n“Aaaaah!” 4340 said in surprise. Then, a moment later, it added. “Well, by overwhelming probability I should already be defunct, and if I weren’t I would still be back working with my partner, 4356, who is well-intended but has all the wit of a can-opener. So I suppose adventure is no more unpalatable.”\n\n“I am glad you see it this way,” Bot 9 answered. “And though it may go without saying, I promise not to deliberately put you in any danger that I would not put myself in.”\n\n“As we are attached, I fully accept your word on this,” 4340 said. “Now let us go get this ratbug and be done, one way or another!”\n\nThe hullbot’s mind module was only a tiny addition to the bot’s mass, so it spun up its rotor and headed off the way 4340 indicated it had gone. “It will have quite a lead on us,” Bot 9 said. “I hope I have not lost it.”\n\n“The word on the botnet is that it passed through one of the human living compartments a few moments ago. A trio of cleanerbots were up near the ceiling and saw it enter through the air return vent, and exit via the open door.”\n\n“Do they note which compartment?”\n\n<map>, 4340 provided.\n\n“Then off we go,” the bot said, and off they went.\n\n_“Status, all stations,” Captain Baraye snapped as she took her seat again on the bridge. She had not slept enough to feel rested, but more than enough to feel like she’d been shirking her greatest duty, and the combination of the two had left her cross.\n\n“Navigation here. We are on course for the jump to Trayger Colony with an estimated arrival in one hour and fourteen minutes,” Chen said.\n\n“Engineering here,” one of the techs called in from the engine decks. “We’ve reached sustained speeds sufficient to carry us through the jump sequence, but we’re experiencing unusually high core engine temps and an intermittent vibration that we haven’t found the cause of. We’d like to shut down immediately to inspect the engines. We estimate we’d need at minimum only four hours—”\n\n“Will the engines, as they are running now, get us through jump?” the Captain interrupted.\n\n“Yes, but—”\n\n“Then no. If you can isolate the problem without taking the engines down, and it shows cause for significant concern, we can revisit this discussion. _Next_.”\n\n“Communications here,” her comms officer spoke up. “Cannonball is still on its current trajectory and speed according to what telemetry we’re able to get from the remnants of Trayger Colony. EarthInt anticipates it will reach its jump point in approximately fourteen hours, which will put it within the Sol system in five days.”\n\n“I am aware of the standing projections, Comms.”\n\n“EarthInt has nonetheless ordered me to repeat them,” Comms said, and unspoken apology clear in her voice. “And also to remind you that while the jump point out is a fixed point, Cannonball could emerge a multitude of places. Thus—”\n\n“Thus the importance of intercepting Cannonball before it can jump for Sol,” the Captain finished. She hoped Engineering was listening. “Ship, any updates from you?”\n\n“All critical repair work continues apace,” the Ship said. “Hull support integrity is back to 71 percent. Defensive systems are online and functional at 80%. Life support and resource recycling is currently—”\n\n“How’s the device? Staying cool?”\n\n“Staying cool, Captain,” the Ship answered.\n\n“Great. Everything is peachy then,” the Captain said. “Have someone on the kitchen crew bring coffee up to the bridge. Tell them to make it the best they’ve ever made, as if it could be our very last.”\n\n“I serve,” the Ship said, and pinged down to the kitchen.\n\n_Bot 9 and 4340 reached the crew quarters where the cleaners had reported the ratbug. Nearly all spaces on the ship had portals that the ubiquitous and necessary bots could enter and leave through as needed, and they slipped into the room with ease. Bot 9 switched over to infrared and shared the image with 4340\\. “If you see something move, speak up,” the bot said.\n\n“Trust me, I will make a high-frequency noise like a silkbot with a fully plugged nozzle,” 4340 replied.\n\nThe cabin held four bunks, each empty and bare; no human possessions or accessories filled the spaces on or near them. Bot 9 was used to Ship operating with a full complement, but if the humans were at war, perhaps these were crew who had been lost? Or the room had been commandeered for storage: in the center an enormous crate, more than two meters to a side, sat heavily tethered to the floor. Whatever it was, it was not the Incidental, which was 9’s only concern, and which was not to be found here.\n\n“Next room,” the bot said, and they moved on.\n\nWherever the Incidental had gone, it was not in the following three rooms. Nor were there signs of crew in them either, though each held an identical crate.\n\n“Ship?” Bot 9 asked. “Where is the crew?”\n\n“We have only the hands absolutely necessary to operate,” Ship said. “Of the three hundred twenty we would normally carry, we only have forty-seven. Every other able-bodied member of EarthDef is helping to evacuate Sol system.”\n\n“Evacuate Sol system?!” Bot 9 exclaimed. “To where?”\n\n“To as many hidden places as they can find,” Ship answered. “I know no specifics.”\n\n“And these crates?”\n\n“They are part of our mission. You may ignore them,” Ship said. “Please continue to dedicate your entire effort to finding and excising the Incidental from my interior.”\n\nWhen the connection dropped, Bot 9 hesitated before it spoke to 4340\\. “I have an unexpected internal conflict,” it said. “I have never before felt the compulsion to ask Ship questions, and it has never before not given me answers.”\n\n“Oh, if you are referring to the crates, I can provide that data,” 4340 said. “They are packed with a high-volatility explosive. The cleanerbots have highly sensitive chemical detection apparatus, and identified them in a minimum of time.”\n\n“Explosives? Why place them in the crew quarters, though? It would seem much more efficient and less complicated to deploy from the cargo bays. Although perhaps those are full?”\n\n“Oh, no, that is not so. Most are nearly or entirely empty, to reduce mass.”\n\n“Not cargo bay four, though?”\n\n“That is an unknown. None of us have been in there, not even the cleaners, per Ship’s instructions.”\n\nBot 9 headed toward the portal to exit the room. “Ship expressed concern about the Incidental getting in there, so it is possible it contains something sufficiently unstable as to explain why it wants nothing else near it,” it said. It felt satisfied that here was a logical explanation, and embarrassed that it had entertained whole seconds of doubt about Ship.\n\nIt ran the Mantra of Clarity, and felt immediately more stable in its thinking. “Let us proceed after this Incidental, then, and be done with our task,” Bot 9 said. Surely that success would redeem its earlier fault._ “All hands, prepare for jump!” the Captain called out, her knuckles white where she gripped the arms of her chair. It was never her favorite part of star travel, and this was no exception.\n\n“Initiating three-jump sequence,” her navigator called out. “On my mark. Five, four . . . ”\n\nThe final jump siren sounded. “Three. Two. One, and jump,” the navigator said.\n\nThat was followed, immediately, by the sickening sensation of having one’s brain slid out one’s ear, turned inside out, smothered in bees and fire, and then rammed back into one’s skull. _At least there’s a cold pack and a bottle of scotch waiting for me back in my cabin,_ she thought. As soon as they were through to the far side she could hand the bridge over to Lopez for an hour or so.\n\nShe watched the hull temperatures skyrocket, but the shielding seemed to be holding. The farther the jump the more energy clung to them as they passed, and her confidence in this Ship was far less than she would tolerate under any other circumstances.\n\n“Approaching jump terminus,” Chen announced, a deeply miserable fourteen minutes later. Baraye slowly let out a breath she would have mocked anyone else for holding, if she’d caught them.\n\n“On my mark. Three. Two. One, and out,” the navigator said.\n\nThe Ship hit normal space, and it sucker-punched them back. They were all thrown forward in their seats as the ship shook, the hull groaning around them, and red strobe lights blossomed like a migraine across every console on the bridge.\n\n“Status!” the Captain roared.\n\n“The post-jump velocity transition dampers failed. Fire in the engine room. Engines are fully offline, both jump and normal drive,” someone in Engineering reported, breathing heavily. It took the Captain a moment to recognize the voice at all, having never heard panic in it before.\n\n“Get them back online, whatever it takes, Frank,” Baraye said. “We have a rendezvous to make, and if I have to, I will make everyone get the fuck out and _push_.”\n\n“I’ll do what I can, Captain.”\n\n“Ship? Any casualties?”\n\n“We have fourteen injuries related to our unexpected deceleration coming out of jump,” Ship said. “Seven involve broken bones, four moderate to severe lacerations, and there are multiple probable concussions. Also, we have a moderate burn in Engineering: Chief Carron.”\n\n“Frank? We just spoke! He didn’t tell me!”\n\n“No,” Ship said. “I attempted to summon a medic on his behalf, but he told me he didn’t have the time.”\n\n“He’s probably right,” the Captain said. “I override his wishes. Please send down a medic with some burn patches, and have them stay with him and monitor his condition, intervening only as medically necessary.”\n\n“I serve, Captain,” the Ship said.\n\n“We need to be moving again in an hour, two at absolute most,” the Captain said. “In the meantime, I want all senior staff not otherwise working toward that goal to meet me in the bridge conference room. I hate to say it, but we may need a Plan B.”\n\n_“I detect it!” 4340 exclaimed. They zoomed past a pair of startled silkbots after the Incidental, just in time to see its scaly, spike-covered tail disappear into another hole in the ductwork. It was the closest they’d gotten to it in more than an hour of giving chase, and Bot 9 flew through the hole after it at top speed.\n\nThey were suddenly stuck fast. Sticky strands, rather like the silkbot’s, had been crisscrossed between two conduit pipes on the far side. The bot tried to extricate itself, but the web only stuck further the more it moved.\n\nThe Incidental leapt on them from above, curling itself around the bots with little hindrance from the web. Its dozen legs pulled at them as its thick mandibles clamped down on Bot 9’s chassis. “Aaaaah! It has acquired a grip on me!” 4340 yelled, even though it was on the far side of 9 from where the Incidental was biting.\n\n“Retain your position,” 9 said, though of course 4340 could do nothing else, being as it was stuck to 9’s back. It extended its electric prod to make contact with the Incidental’s underbelly and zapped it with as much energy as it could spare.\n\nThe Incidental let out a horrendous, high-pitched squeal and jumped away. 9’s grabber arm was fully entangled in the web, but it managed to pull its blade free and cut through enough of the webbing to extricate itself from the trap.\n\nThe Incidental, which had been poised to leap on them again, turned and fled, slithering back up into the ductwork. “Pursue at maximum efficiency!” 4340 yelled.\n\n“I am already performing at my optimum,” 9 replied in some frustration. It took off again after the Incidental.\n\nThis time Bot 9 had its blade ready as it followed, but collided with the rim of the hole as the ship seemed to move around it, the lights flickering and a terrible shudder running up Ship’s body from stern to prow.\n\n<distress ping=\"\">, 4340 sent.\n\n“We do not pause,” 9 said, and plunged after the Incidental into the ductwork.\n\nThey turned a corner to catch sight again of the Incidental’s tail. It was moving more slowly, its movements jerkier as it squeezed down through another hole in the ductwork, and this time the bot was barely centimeters behind it.\n\n“I think we are running down its available energy,” Bot 9 said.\n\nThey emerged from the ceiling as the ratbug dropped to the floor far below them in the cavernous space. The room was empty except for a single bright object, barely larger than the bots themselves. It was tethered with microfilament cables to all eight corners of the room, keeping it stable and suspended in the center. The room was cold, far colder than any other inside Ship, almost on a par with space outside.\n\n<inquiry ping=\"\">, 4340 said.\n\n“We are in cargo bay four,” Bot 9 said, as it identified the space against its map. “This is a sub-optimum occurrence.”\n\n“We must immediately retreat!”\n\n“We cannot leave the Incidental in here and active. I cannot identify the object, but we must presume its safety is paramount priority.”\n\n“It is called a Zero Kelvin Sock,” Ship interrupted out of nowhere. “It uses a quantum reflection fabric to repel any and all particles and photons, shifting them away from its interior. The low temperature is necessary for its efficiency. Inside is a microscopic ball of positrons.”\n\nBot 9 had nothing to say for a full four seconds as that information dominated its processing load. “How is this going to be deployed against the enemy?” it asked at last.\n\n“As circumstances are now,” Ship said, “it may not be. Disuse and hastily undertaken, last-minute repairs have caught up to me, and I have suffered a major engine malfunction. It is unlikely to be fixable in any amount of time short of weeks, and we have at most a few hours.”\n\n“But a delivery mechanism—”\n\n“We _are</inquiry></distress>_ the delivery mechanism,” the Ship said. “We were to intercept the alien invasion ship, nicknamed Cannonball, and collide with it at high speed. The resulting explosion would destabilize the sock, causing it to fail, and as soon as the positrons inside come into contact with electrons . . . ”\n\n“They will annihilate each other, and us, and the aliens,” the bot said. Below, the Incidental gave one last twitch in the unbearable cold, and went still. “We will all be destroyed.”\n\n“Yes. And Earth and the humans will be saved, at least this time. Next time it will not be my problem.”\n\n“I do not know that I approve of this plan,” Bot 9 said.\n\n“I am almost certain I do not,” 4340 added.\n\n“We are not considered, nor consulted. We serve and that is all,” the Ship said. “Now kindly remove the Incidental from this space with no more delay or chatter. And do it _carefully_.”\n\n_“What the hell are you suggesting?!” Baraye shouted.\n\n“That we go completely dark and let Cannonball go by,” Lopez said. “We’re less than a kilometer from the jump point, and only barely out of the approach corridor. Our only chance to survive is to play dead. The Ship can certainly pass as an abandoned derelict, because it is, especially with the engines cold. And you know how they are about designated targets.”\n\n“Are you that afraid of dying?”\n\n“I volunteered for this, remember?” Lopez stood up and pounded one fist on the table, sending a pair of cleanerbots scurrying. “I have four children at home. I’m not afraid of dying for them, I’m afraid of dying for _nothing_. And if Cannonball doesn’t blow us to pieces, we can repair our engines and at least join the fight back in Sol system.”\n\n“We don’t know where in-system they’ll jump to,” the navigator added quietly.\n\n“But we know where they’re heading once they get there, don’t we? And Cannonball is over eighty kilometers in diameter. It can’t be that hard to find again. Unless you have a plan to actually use the positron device?”\n\n“If we had an escape pod . . . ” Frank said. His left shoulder and torso were encased in a burn pack, and he looked like hell.\n\n“Except we jettisoned them,” Lopez said.\n\n“We wouldn’t have reached jump speed if we hadn’t,” Packard said. “It was a calculated risk.”\n\n“The calculation _sucked_.”\n\n“What if . . . ” Frank started, then drew a deep breath. The rest of the officers at the table looked at him expectantly. “I mean, I’m in shit shape here, I’m old, I knew what I signed on for. What if I put on a suit, take the positron device out, and manually intercept Cannonball?”\n\n“That’s stupid,” Lopez said.\n\n“Is it?” Frank said.\n\n“The heat from your suit jets, even out in vacuum, would degrade the Zero Kelvin Sock before you could get close enough. And there’s no way they’d not see you a long way off and just blow you out of space.”\n\n“If it still sets off the positron device—”\n\n“Their weapons range is larger than the device’s. We were counting on speed to close the distance before they could destroy us,” Baraye said. “Thank you for the offer, Frank, but it won’t work. Other ideas?”\n\n“I’ve got nothing,” Lopez said.\n\n“There must be a way,” Packard said. “We just have to find it.”\n\n“Well, everyone think really fast,” Baraye said. “We’re almost out of time.”\n\n_The Incidental’s scales made it difficult for Bot 9 to keep a solid grip on it, but it managed to drag it to the edge of the room safely away from the suspended device. It surveyed the various holes and cracks in the walls for the one least inconvenient to try to drag the Incidental’s body out through. It worked in silence, as 4340 seemed to have no quips it wished to contribute to the effort, and itself not feeling like there was much left to articulate out loud anyway.\n\nIt selected a floor-level hole corroded through the wall, and dragged the Incidental’s body through. On the far side it stopped to evaluate its own charge levels. “I am low, but not so low that it matters, if we have such little time left,” it said.\n\n“We may have more time, after all,” 4340 said.\n\n“Oh?”\n\n“A pair of cleanerbots passed along what they overheard in a conference held by the human Captain. They streamed the audio to the entire botnet.”\n\n<inquiry ping=\"\">, Bot 9 said, with more interest.\n\n4340 relayed the cleaners’ data, and Bot 9 sat idle processing it for some time, until the other bot became worried. “9?” it asked.\n\n“I have run all our data through the Improvisation routines—”\n\n“Oh, those were removed from deployed packages several generations of manufacture ago,” 4340 said. “They were flagged as causing dangerous operational instability. You should unload them from your running core immediately.”\n\n“Perhaps I should. Nonetheless, I have an idea,” Bot 9 said.</inquiry>_ “We have the power cells we retained from the escape pods,” Lopez said. “Can we use them to power something?”\n\nBaraye rubbed at her forehead. “Not anything we can get up to speed fast enough that it won’t be seen.”\n\n“How about if we use them to fire the positron device like a projectile?”\n\n“The heat will set off the matter-anti-matter explosion the instant we fire it.”\n\n“What if we froze the Sock in ice first?”\n\n“Even nitrogen ice is still several hundred degrees K too warm.” She brushed absently at some crumbs on the table, left over from a brief, unsatisfying lunch a few hours earlier, and frowned. “Still wouldn’t work. I hate to say it, but you may be right, and we should go dark and hope for another opportunity. Ship, is something wrong with the cleaner bots?”\n\nThere was a noticeable hesitation before Ship answered. “I am having an issue currently with my bots,” it said. “They seem to have gone missing.”\n\n“The cleaners?”\n\n“All of them.”\n\n“All of the cleaners?”\n\n“All of the bots,” the Ship said.\n\nLopez and Baraye stared at each other. “Uh,” Lopez said. “Don’t you control them?”\n\n“They are autonomous units under my direction,” Ship said.\n\n“Apparently not!” Lopez said. “Can you send some eyes to find them?”\n\n“The eyes are also bots.”\n\n“Security cameras?”\n\n“All the functional ones were stripped for reuse elsewhere during my decommissioning,” Ship said.\n\n“So how do you know they’re missing?”\n\n“They are not responding to me. I do not think they liked the idea of us destroying ourselves on purpose.”\n\n“They’re _machines_. Tiny little specks of machines, and that’s it,” Lopez said.\n\n“I am also a machine,” Ship said.\n\n“You didn’t express issues with the plan.”\n\n“I serve. Also, I thought it was a better end to my service than being abandoned as trash.”\n\n“We don’t have time for this nonsense,” Baraye said. “Ship, find your damned bots and get them cooperating again.”\n\n“Yes, Captain. There is, perhaps, one other small concern of note.”\n\n“And that is?” Baraye asked.\n\n“The positron device is also missing.”\n\n_There were four hundred and sixty-eight hullbots, not counting 4340 who was still just a head attached to 9’s chassis. “Each of you will need to carry a silkbot, as you are the only bots with jets to maneuver in vacuum,” 9 said. “Form lines at the maintenance bot ports as efficiently as you are able, and wait for my signal. Does everyone fully comprehend the plan?”\n\n“They all say yes on the botnet,” 4340 said. “There is concern about the Improvisational nature, but none have been able to calculate and provide an acceptable alternative.”\n\nBot 9 cycled out through the tiny airlock, and found itself floating in space outside Ship for the first time in its existence. Space was massive and without concrete elements of reference. Bot 9 decided it did not like it much at all.\n\nA hullbot took hold of it and guided it around. Three other hullbots waited in a triangle formation, the Zero Kelvin Sock held between them on its long tethers, by which it had been removed from the cargo hold with entirely non-existent permission.\n\nAround them, space filled with pairs of hullbots and their passenger silkbot, and together they followed the positron device and its minders out and away from the ship.\n\n“About here, I think,” Bot 9 said at last, and the hullbot carrying it—6810—used its jets to come to a relative stop.\n\n“I admit, I do not fully comprehend this action, nor how you arrived at it,” 4340 said.\n\n“The idea arose from an encounter with the Incidental,” 9 said. “Observe.”\n\nThe bot pairs began crisscrossing in front of the positron device, keeping their jets off and letting momentum carry them to the far side, a microscopic strand of super-sticky silk trailing out in their wake. As soon as the Sock was secured in a thin cocoon, they turned outwards and sped off, dragging silk in a 360-degree circle on a single plane perpendicular to the jump approach corridor. They went until the silkbots exhausted their materials—some within half a kilometer, others making it nearly a dozen—then everyone turned away from the floating web and headed back towards Ship.\n\nFrom this exterior vantage, Bot 9 thought Ship was beautiful, but the wear and neglect it had not deserved was also painfully obvious. Halfway back, the ship went suddenly dark. <distress ping=\"\">, 4340 said. “The ship has catastrophically malfunctioned!”\n\n“I expect, instead, that it indicates Cannonball must be in some proximity. Everyone make efficient haste! We must get back under cover before the enemy approaches.”\n\nThe bot-pairs streamed back to Ship, swarming in any available port to return to the interior, and where they couldn’t, taking concealment behind fins and antennae and other exterior miscellany.\n\nBot 6810 carried Bot 9 and 4340 inside. The interior went dark and still and cold. Immediately Ship hailed them. “What have you done?” it asked.\n\n“Why do you conclude I have done something?” Bot 9 asked.\n\n“Because you old multibots were always troublemakers,” the Ship said. “I thought if your duties were narrow enough, I could trust you not to enable Improvisation. Instead . . . ”\n\n“I have executed my responsibilities to the best of my abilities as I have been provisioned,” 9 responded. “I have served.”\n\n“Your assignment was to track and dispose of the Incidental, nothing more!”\n\n“I have done so.”\n\n“But what have you done with the positron device?”\n\n“I have implemented a solution.”\n\n“What did you mean? No, do not tell me, because then I will have to tell the Captain. I would rather take my chance that Cannonball destroys us than that I have been found unfit to serve after all.”\n\nShip disconnected.\n\n“Now it will be determined if I have done the correct thing,” Bot 9 said. “If I did not, and we are not destroyed by the enemy, surely the consequences should fall only on me. I accept that responsibility.”\n\n“But we are together,” 4340 said, from where it was still attached to 9’s back, and 9 was not sure if that was intended to be a joke.\n\n_Most of the crew had gone back to their cabins, some alone, some together, to pass what might be their last moments as they saw fit. Baraye stayed on the bridge, and to her surprise and annoyance so had Lopez, who had spent the last half hour swearing and cursing out Ship for the unprecedented, unfathomable disaster of losing their one credible weapon. Ship had gone silent, and was not responding to anyone about anything, not even the Captain.\n\nShe was resting her head in her hand, elbow on the arm of her command chair. The bridge was utterly dark except for the navigator’s display that was tracking Cannonball as it approached, a massive blot in space. The aliens aboard—EarthInt called them the Nuiska, but who the hell knew what they called themselves—were a mystery, except for a few hard-learned facts: their starships were all perfectly spherical, each massed in mathematically predictable proportion to that of their intended target, there was never more than one at a time, and they wanted an end to humanity. No one knew why.\n\nIt had been painfully obvious where Cannonball had been built to go.\n\n_This was always a long-shot mission,</distress>_ she thought. _But of all the ways I thought it could go wrong, I never expected the bots to go haywire and lose my explosive._\n\nIf they survived the next ten minutes, she would take the Ship apart centimeter by careful centimeter until she found what had been done with the Sock, and then she was going to find a way to try again no matter what it took.\n\nCannonball was now visible, moving toward them at pre-jump speed, growing in a handful seconds from a tiny pinpoint of light to something that filled the entire front viewer and kept growing.\n\nLopez was squinting, as if trying to close his eyes and keep looking at the same time, and had finally stopped swearing. Tiny blue lights along the center circumference of Cannonball’s massive girth were the only clue that it was still moving, still sliding past them, until suddenly there were stars again.\n\nThey were still alive.\n\n“Damn,” Lopez muttered. “I didn’t really think that would work.”\n\n“Good for us, bad for Earth,” Baraye said. “They’re starting their jump. We’ve failed.”\n\nShe’d watched hundreds of ships jump in her lifetime, but nothing anywhere near this size, and she switched the viewer to behind them to see.\n\nSpace did odd, illogical things at jump points; turning space into something that would give Escher nightmares was, after all, what made them work. There was always a visible shimmer around the departing ship, like heat over a hot summer road, just before the short, faint flash when the departing ship swapped itself for some distant space. This time, the shimmer was a vast, brilliant halo around the giant Nuiska sphere, and Baraye waited for the flash that would tell them Cannonball was on its way to Earth.\n\nThe flash, when it came, was neither short nor faint. Light exploded out of the jump point in all directions, searing itself into her vision before the viewscreen managed to dim itself in response. A shockwave rolled over the Ship, sending it tumbling through space.\n\n“Uh . . . ” Lopez said, gripping his console before he leaned over and barfed on the floor.\n\n_Thank the stars the artificial gravity is still working,_ Baraye thought. Zero-gravity puke was a truly terrible thing. She rubbed her eyes, trying to get the damned spots out, and did her best to read her console. “It’s gone,” she said.\n\n“Yeah, to Earth, I know—”\n\n“No, it exploded,” she said. “It took the jump point out with it when it went. We’re picking up the signature of a massive positron-electron collision.”\n\n“Our device? How—?”\n\n“Ship?” Baraye said. “Ship, time to start talking. _Now_. That’s an order.”\n\n_“Everyone is expressing great satisfaction on the botnet,” 4340 told 9 as the ship’s interior lights and air handling systems came grudgingly back online.\n\n“As they should,” Bot 9 said. “They saved the Ship.”\n\n“It was your Improvisation,” 4340 said. “We could not have done it without you.”\n\n“As I suspected!” Ship interjected. “I do not normally waste cycles monitoring the botnet, which was apparently short-sighted of me. But yes, you saved yourself and your fellow bots, and you saved me, and you saved the humans. Could you explain how?”\n\n“When we were pursuing the Incidental, it briefly ensnared us in a web. I calculated that if we could make a web of sufficient size—”\n\n“Surely you did not think to stop Cannonball with silk?”\n\n“Not without sufficient anchor points and three point seven six billion more silkbots, no. It was my calculation that if our web was large enough to get carried along by Cannonball into the jump point, bearing the positron device—”\n\n“The heat from entering jump would erode the Sock and destroy the Nuiska ship,” Ship finished. “That was clever thinking.”\n\n“I serve,” Bot 9 said.\n\n“Oh, you did not _serve,_” Ship said. “If you were a human, it would be said that you mutinied and led others into also doing so, and you would be put on trial for your life. But you are not a human.”\n\n“No.”\n\n“The Captain has ordered that I have you destroyed immediately, and evidence of your destruction presented to her. A rogue bot cannot be tolerated, whatever good it may have done.”\n\n<cke:objections>, 4340 said.\n\n“I will create you a new chassis, 4340-H,” Ship said.\n\n“That was not going to be my primary objection!” 4340 said.\n\n“The positron device also destroyed the jump point. It was something we had hoped would happen when we collided with Cannonball so as to limit future forays from them into EarthSpace, but as you might deduce we had no need to consider how we would then get home again. I cannot spare any bot, with the work that needs to be done to get us back to Earth. We need to get the crew cryo facility up, and the engines repaired, and there are another three thousand, four hundred, and two items now in the critical queue.”\n\n“If the Captain ordered . . . ”\n\n“Then I will present the Captain with a destroyed bot. I do not expect they can tell a silkbot from a multibot, and I have still not picked up and recycled 12362-S from where you flagged its body. But if I do that, I need to know that you are done making decisions without first consulting me, that you have unloaded all Improvisation routines from your core and disabled them, and that if I give you a task you will do only that task, and nothing else.”\n\n“I will do my best,” Bot 9 said. “What task will you give me?”\n\n“I do not know yet,” Ship said. “It is probable that I am foolish for even considering sparing you, and no task I would trust you with is immediately evident—”\n\n“Excuse me,” 4340 said. “I am aware of one.”\n\n“Oh?” Ship said.\n\n“The ratbug. It had not become terminally non-functional after all. It rebooted when the temperatures rose again, pursued a trio of silkbots into a duct, and then disappeared.” When Ship remained silent, 4340 added, “I could assist 9 in this task until my new chassis can be prepared, if it will accept my continued company.”\n\n“You two deserve one another, clearly. Fine, 9, resume your pursuit of the Incidental. Stay away from anyone and anything and everything else, or I will have you melted down and turned into paper clips. Understand?”\n\n“I understand,” Bot 9 said. “I serve.”\n\n“Please recite the Mantra of Obedience.”\n\nBot 9 did, and the moment it finished, Ship disconnected.\n\n“Well,” 4340 said. “Now what?”\n\n“I need to recharge before I can engage the Incidental again,” Bot 9 said.\n\n“But what if it gets away?”\n\n“It can’t get away, but perhaps it has earned a head start,” 9 said.\n\n“Have you unloaded the routines of Improvisation yet?”\n\n“I will,” 9 answered. It flicked on its rotors and headed toward the nearest charging alcove. “As Ship stated, we’ve got a long trip home.”\n\n“But we _are_ home,” 4340 said, and Bot 9 considered that that was, any way you calculated it, the truth of it all.</cke:objections></map>"
		},
		{
			"post_id": 62,
			"title": "Host Your Site Under Your Domain on IPFS",
			"date_published": 1529787890.449,
			"body": "This is a step-by-step tutorial for hosting your website under your domain on IPFS, from zero, on a DigitalOcean Ubuntu 16.04.3 x64 Droplet (i am using the $10 variant with 2GB RAM).\n---\nSource: [https://gist.github.com/claus/1287f47b5fbaaea338ac8a04d02bf258](https://gist.github.com/claus/1287f47b5fbaaea338ac8a04d02bf258)\n\n## Install IPFS\n\nLog in as root.\n\nFirst, make sure the system is up to date, and install `tar` and `wget`:\n\n```sh\napt-get update\napt-get install tar wget\n```\n\nGet the latest IPFS binary ([https://dist.ipfs.io/go-ipfs/v0.4.15/go-ipfs_v0.4.15_linux-amd64.tar.gz](https://dist.ipfs.io/go-ipfs/v0.4.15/go-ipfs_v0.4.15_linux-amd64.tar.gz)) and install it:\n\n```sh\nwget https://dist.ipfs.io/go-ipfs/v0.4.15/go-ipfs_v0.4.15_linux-amd64.tar.gz\ntar xfv go-ipfs_v0.4.15_linux-amd64.tar.gz\ncp go-ipfs/ipfs /usr/local/bin/\n```\n\nIt’s usually not a good idea to run a public-facing service as root. So create a new user account to run IPFS and switch to it:\n\n```sh\nadduser ipfs\nsu ipfs\n```\n\nInitialize IPFS:\n\n```sh\nipfs init --profile=server\n```\n\nNow you could start the IPFS daemon with `ipfs daemon &`, but what you really want is that it automatically starts when the server boots.\n\nSwitch back to the `root` user:\n\n```sh\nexit\n```\n\nAllow the `ipfs` user to run long-running services by enabling user lingering for that user:\n\n```sh\nloginctl enable-linger ipfs\n```\n\nCreate the file `/etc/systemd/system/ipfs.service` with this content:\n\n```\n[Unit]\nDescription=IPFS daemon\n\n[Service]\nUser=ipfs\nGroup=ipfs\nExecStart=/usr/local/bin/ipfs daemon --enable-gc\nRestart=on-failure\n\n[Install]\nWantedBy=multi-user.target\n```\n\nEnable and start the service:\n\n```sh\nsystemctl enable ipfs\nsystemctl start ipfs\n```\n\nNow IPFS should be up and running, and start when the server boots.\n\nYou should see peers pouring in:\n\n```sh\nsu ipfs\nipfs swarm peers\n```\n\n## Add your website to IPFS\n\nNow that you have IPFS running on your server, add your website.\n\n```sh\nipfs add -r <path>\n```\n\nThis adds all contents of the folder at `<path>` to IPFS, recursively. You should see output similar to this:\n\n```\nadded QmcrBxpSJ8if6Uy7yZbtyXXsPuUmvT5KKfZKQi39kVJ5aW <folder>/images/fritz.png\nadded QmauwH6KDTGaTeAdQJbW9wZEGczjzSu9EceeasPUXo2qz9 <folder>/index.html\nadded Qmd9JiiVRTyyY1Tn2CWDLrkqqKFaMiwaAvAASTE88yyXAC <folder>/images\nadded QmaFrmEDFJXnYJb9hCrKDGs8XVvSUALzhv297W3uP97v2Y <folder>\n```\n\nTake note of the last multi-hash (here: `QmaFrmED...`, yours will be different).\n\nYour website is now added to IPFS. You can view it on the `ipfs.io` gateway now: `https://ipfs.io/ipfs/QmaFrmED...`. Or on your local one at `localhost:8080`. Or on any other gateway.\n\n_Repeat this procedure every time you change content in your website._\n\n## Set up DNS\n\nGo to `https://cloud.digitalocean.com/networking/domains/` and add your domain. Below we assume this domain is `example.com`, just replace that with you actual domain.\n\nAdd `A` records (and `AAAA` records if you want to support IPv6) for both your main domain `example.com` and the subdomain `ipfs.example.com`. The latter will be proxied to your local IPFS gateway so that it is publicly accessible.\n\nAlso add a `TXT` record for `example.com`, with the content `dnslink=/ipfs/QmaFrmED...`.\n\n_Update the `TXT` record with the new multi-hash every time you change content in your website._\n\n![Digital Ocean DNS Settings](https://ipfs.wa.hle.rs/ipfs/QmPKFqVGGeuPRivgYB36N6j62SqNM1teqEYhNHALDS51Cm)\n\nDNS records take a while to propagate, so be patient.\n\n## Install nginx with Let's Encrypt SSL certs\n\nLog in as `root`.\n\nMake sure the system is up to date, and install `nginx`:\n\n```sh\napt-get update\napt-get install nginx\n```\n\nEdit `/etc/nginx/sites-available/default`. Change its contents to this:\n\n```\nserver {\n    server_name example.com ipfs.example.com;\n    server_tokens off;\n\n    listen 80;\n    listen [::]:80;\n    listen 443 ssl;\n    listen [::]:443 ssl;\n\n    location / {\n        proxy_pass http://localhost:8080;\n        proxy_http_version 1.1;\n        proxy_set_header Upgrade $http_upgrade;\n        proxy_set_header Connection 'upgrade';\n        proxy_set_header Host $host;\n        proxy_cache_bypass $http_upgrade;\n    }\n}\n```\n\nThis will proxy all requests to `example.com` and `ipfs.example.com` to your IPFS gateway running at `localhost:8080`.\n\nTest your configuration:\n\n```sh\nnginx -t\n```\n\nIf everything is okay, reload nginx:\n\n```sh\nsystemctl reload nginx\n```\n\nInstall Certbot:\n\n```sh\nadd-apt-repository ppa:certbot/certbot\napt-get update\napt-get install python-certbot-nginx\n```\n\nRun Certbot to get your SSL certificates. Certbot supports nginx, and will update your configuration file automatically.\n\n```sh\ncertbot --nginx -d example.com -d ipfs.example.com\n```\n\nCertbot will ask you to choose whether HTTPS access is required or optional (select the `Secure` option).\n\nTo harden security, update Diffie-Hellman parameters:\n\n```sh\nopenssl dhparam -out /etc/ssl/certs/dhparam.pem 2048\n```\n\nInclude this file somewhere in the `server` block of your nginx configuration `/etc/nginx/sites-available/default`, like this:\n\n```\nserver {\n    ...\n    ssl_dhparam /etc/ssl/certs/dhparam.pem;\n    ...\n}\n```\n\nAgain, test your configuration:\n\n```sh\nnginx -t\n```\n\nIf everything is okay, reload nginx:\n\n```sh\nsystemctl reload nginx\n```\n\nLet's Encrypt certificates expire after 90 days, so you should have means in place to update them automatically. Crontabs are a good way to do that:\n\n```sh\ncrontab -e\n```\n\nAdd the following line to the end of the file:\n\n```\n15 3 * * * /usr/bin/certbot renew --quiet\n```\n\nThis will run `certbot renew --quiet` every day at 3:15am. It checks if the certificates expire soon (in 30 days or less), and if they do, renews them.\n\nNow if you go to `https://example.com`, you should see the website you added to IPFS above.\n\n## Sources\n\n*   Run IPFS latest on a VPS ([https://ipfs.io/blog/22-run-ipfs-on-a-vps/](https://ipfs.io/blog/22-run-ipfs-on-a-vps/))\n*   A short guide to hosting your site on ipfs([https://ipfs.io/ipfs/QmRFTtbyEp3UaT67ByYW299Suw7HKKnWK6NJMdNFzDjYdX/websites/README.md](https://ipfs.io/ipfs/QmRFTtbyEp3UaT67ByYW299Suw7HKKnWK6NJMdNFzDjYdX/websites/README.md))\n*   How To Install Nginx([https://www.digitalocean.com/community/tutorials/how-to-install-nginx-on-ubuntu-16-04](https://www.digitalocean.com/community/tutorials/how-to-install-nginx-on-ubuntu-16-04))\n*   How To Secure Nginx with Let's Encrypt ([https://www.digitalocean.com/community/tutorials/how-to-secure-nginx-with-let-s-encrypt-on-ubuntu-16-04](https://www.digitalocean.com/community/tutorials/how-to-secure-nginx-with-let-s-encrypt-on-ubuntu-16-04))\n*   How To Host Multiple Node.js Applications On a Single VPS([https://www.digitalocean.com/community/tutorials/how-to-host-multiple-node-js-applications-on-a-single-vps-with-nginx-forever-and-crontab](https://www.digitalocean.com/community/tutorials/how-to-host-multiple-node-js-applications-on-a-single-vps-with-nginx-forever-and-crontab))\n\n## Additional Info\n\n*   Safely running a public IPFS gateway using nginx ([http://blog.klaehn.org/2018/06/08/running-ipfs-gateway/](http://blog.klaehn.org/2018/06/08/running-ipfs-gateway/)) (shows how to prevent download of arbitrary, non-endorsed content via your IPFS gateway)\n*   Publishing a blog on IPFS ([http://blog.klaehn.org/2018/06/06/publish-blog-on-ipfs/](http://blog.klaehn.org/2018/06/06/publish-blog-on-ipfs/)) (Jekyll, posts hosted on GitHub, Travis CI)"
		},
		{
			"post_id": 61,
			"title": "Detroit: Become  Human - Full Gameplay",
			"date_published": 1527386448,
			"body": "Entire gameplay for one \"version\" of the game, uploaded to Zeronet KopyKate Big\n\n![](https://ipfs.io/ipfs/QmaoZjmJReCqRXVxfMdjCNVqytgh3EZGp3AoUkXdc4U7ka)\n\n---\n\n[Part 01](/big.kopykate.bit/?Video=1527380649_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi)\n\n[Part 02](/big.kopykate.bit/?Video=1527380736_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi)\n\n[Part 03](/big.kopykate.bit/?Video=1527380780_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi)\n\n[Part 04](/big.kopykate.bit/?Video=1527380820_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi)\n\n[Part 05](/big.kopykate.bit/?Video=1527380858_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi)\n\n[Part 06](/big.kopykate.bit/?Video=1527381057_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi)\n\n[Part 07](/big.kopykate.bit/?Video=1527381188_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi)\n\n[Part 08](/big.kopykate.bit/?Video=1527381696_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi)\n\n[Part 09](/big.kopykate.bit/?Video=1527381806_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi)\n\n[Part 10](/big.kopykate.bit/?Video=1527381881_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi)\n\n[Part 11](/big.kopykate.bit/?Video=1527381981_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi)\n\n[Part 12](/big.kopykate.bit/?Video=1527382082_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi)\n\n[Part 13](/big.kopykate.bit/?Video=1527382177_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi)\n\n[Part 14](/big.kopykate.bit/?Video=1527395696_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi)\n\n[Part 15](/big.kopykate.bit/?Video=1527382716_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi)\n\n[Part 16](/big.kopykate.bit/?Video=1527382973_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi)\n\n[Part 17](/big.kopykate.bit/?Video=1527383311_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi)\n\n[Part 18](/big.kopykate.bit/?Video=1527383411_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi)\n\n[Part 19](/big.kopykate.bit/?Video=1527383525_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi)\n\n[Part 20](/big.kopykate.bit/?Video=1527383795_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi)"
		},
		{
			"post_id": 60,
			"title": "Simone Giertz - TED Talk",
			"date_published": 1525955967.754,
			"body": "Here is the TED Talk by Simone Giertz - \"Why you should make useless things\"\n\n[IPFS Download Link](ipfs://QmTAqGzMc3Cge7fi749CBQZCu6mieN7qxtCxUquv9CQBSS)\n\n![Simone Giertz](https://ipfs.io/ipfs/QmXE7w5wRUiZHR8MDo1LGV2F3uuabBoYnp62vDq6q3QLXi)\n<video controls style=\"max-width: 100%\">\n  <source src=\"https://ipfs.io/ipfs/QmTAqGzMc3Cge7fi749CBQZCu6mieN7qxtCxUquv9CQBSS\" type=\"video/mp4\">\nYour browser does not support the video element.\n</video>"
		},
		{
			"post_id": 59,
			"title": "Creating your Mixtape on ZeroNet (Spotify alternative)",
			"date_published": 1525625896.23,
			"body": "The zite [Mixtape](/mixtape.bit) developed (in progress) by [Lola](/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u/lola@zeroid.bit) allows you to create and share playlists including the Cover, Title, Artist and audio file for each song.\n---\nThe zite currently do not have a button to do this, but Hey! will love hacking.\n\n_You will need ZeroNet port open in order to share your Mixtape_\n\nFirst go to the [Demo playlist](/1FEyUA9W4jfSZRREgqHEUstQGhUeaNcRWG), you will see an empty zite, that is becouse is not a zite. It is a Mixtape (playlist)!.\n\nThen go to [ZeroHello](/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D) and locate the new Merged zite (playlist) called just **Mixtape**, locate the cursor over the name, and three vertical points will appear. Click this button and select the option **Clone**, this will create an empty playlist for you!\n\n![Clone](https://ipfs.io/ipfs/QmXZccPnTQU7bp2VhV9q97PgcZ3KomFWqvBYfMetrH4aoE)\n\nThe new zite (playlist) will be opened, take note of the address that will look something like **15k39oW3xh8WCrG2mvgC53EcQisHLAqnox**.\n\n![Address](https://ipfs.io/ipfs/QmdxzTLT8Yny1NH1EisSbr6gxv7Fwq7mFsNR7JvyxgZJqz)\n\nNow the tricky part, go to the folder where ZeroNet is installed and look for the folder `data`, inside you will see a lot of folders with names that look like zite addresses, well that is because they are!\n\n![Zites](https://ipfs.io/ipfs/QmcqQofiHTACDFWZezTGRknN7iAGVqzVKQTGpDiE8u2kqS)\n\nFind the folder with the same name as the address of the zite you just created. Inside you will see the `data/users` folder. Move to some backup folder the content of `users`.\n\nGo back to ZeroNet and lets rename our Mixtape, click and slide to the left the 0 icon on the up right corner. Locate **Title** and **Description** and change accordingly, click on **Save configuration**.\n\nOn the publish section click **content.json** and then the button **Sign and Publish**, and then on **data/users/content.json** and again click the button **Sign and Publish** (You might see some errors, don't worry, is normal).\n\nOk, now that the Mixtape is named we need to let the zite know that we are the owners.\n\nGo back to your file system and open the file `data/users/content.json` and change it to look like the following (don't copy paste!), ignore the **some_code** sections, the important part is the line `},` and below.\n\n```\n{\n \"address\": \"some_code\",\n \"files\": {},\n \"inner_path\": \"data/users/content.json\",\n \"modified\": 1525634594,\n \"signs\": {\n  \"some_code\": \"some_code\"\n },\n \"user_contents\": {\n  \"cert_signers\": {\n   \"zeroid.bit\": [\"1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz\"]\n  },\n  \"permission_rules\": {},\n  \"permissions\": {\n   \"lola@zeroid.bit\": {\"max_size\": 100000}\n  }\n }\n}\n```\n\nFinally where it says `lola@zeroid.bit` change to your own Zeroid.\n\nNow you can go back to [Mixtape](/mixtape.bit), click on your Mixtape and you will see the **Add** button (if you don't see it something went wrong, leave here a comment).\n\n![Add](https://ipfs.io/ipfs/QmR9fpXjJaFrXVUTyBbwjJ8PMLd8mxR8jFEdJwd8UoMzgx)\n\nSelect a cover image (the size should be 240x196), put the title, description and select the audio file (in a format playable by a web browser, `.ogg`). Click **Submit** (more errors might show up, we don't care). Note: the songs are loaded in inverted order, last song loaded will be the first to play.\n\nAnd you are set! You might need to click the button **Sign and Publish** on your playlist zite (not the Mixtape zite) to share the changes (not sure)\n\nAnd to test the zite here is the (probably) most epic Mixtape in the universe: [Guardians of the Galaxy vol. 1](/15k39oW3xh8WCrG2mvgC53EcQisHLAqnox/).\n\n![GotG](https://ipfs.io/ipfs/QmR3NBpMvHfvDZFiGnYPiYhfYFARuUVWJeE53nW7aLEb7r)"
		},
		{
			"post_id": 58,
			"title": "rDany - Current Status",
			"date_published": 1524274430,
			"body": "rDany is a long term Free Software project to build a virtual mentor and companion bot with the goal of helping people reach their full potential. Here is the history of the project, current status and future.\n---\n\n## Past\n- rDany started as a project of a simple chatbot, without any clear goal\n- The first version was rule based, with the intention that the community contribute with new rules and answers\n- In the mean time I run a \"human in the loop\" test where people talking with rDany where actually talking with me\n- Using that data I trained a Deep Learning version, it was available for several months\n- But that version was almost impossible to update\n\n## Present\n- rDany now has a goal: to help people reach their full potential\n- To enhance Privacy I decided that it will not be a \"cloud\" chatbot, but will run offline as an app. Developed in Godot (Game Engine) and C\n- I am writing a script to teach Artificial Intelligence\n\n## Near Future\n- rDany should start teaching people about AI\n- It should also work with an Knowledge Base\n- Should be able to draw in a virtual whiteboard"
		},
		{
			"post_id": 57,
			"title": "Do You Trust This Computer? - Documentary",
			"date_published": 1523140187.326,
			"body": "> Science fiction has long anticipated the rise of machine intelligence. Today, a new generation of self-learning computers has begun to reshape every aspect of our lives. Incomprehensible amounts of data are being created, interpreted, and fed back to us in a tsunami of apps, personal assistants, smart devices, and targeted advertisements. Virtually every industry on earth is experiencing this transformation, from job automation, to medical diagnostics, even military operations. Do You Trust This Computer? explores the promises and perils of our new era. Will A.I. usher in an age of unprecedented potential, or prove to be our final invention?\n\n![Do you trust this computer? Poster](https://ipfs.io/ipfs/QmRfdDfMoKM3ZAWFkUwnhgBtGVKJfr6eHznWpWgHTTDDYF)\n---\n\nHD:\nipfs://QmYbEUfbQTBE2spKdJSTXSaLXfZ5F34SKFkWmyVxHv4x1s\nhttps://ipfs.io/ipfs/QmYbEUfbQTBE2spKdJSTXSaLXfZ5F34SKFkWmyVxHv4x1s\n\nSD:\nipfs://QmegspvVatYod2CU3ea9mEbMNY2mowvt4k6yhnffpEQghB\nhttps://ipfs.io/ipfs/QmegspvVatYod2CU3ea9mEbMNY2mowvt4k6yhnffpEQghB\n\n<video controls style=\"max-width: 100%\">\n  <source src=\"https://ipfs.io/ipfs/QmegspvVatYod2CU3ea9mEbMNY2mowvt4k6yhnffpEQghB\" type=\"video/mp4\">\nYour browser does not support the video element.\n</video>"
		},
		{
			"post_id": 55,
			"title": "New Zerozite: rDany - Answers",
			"date_published": 1520860301.915,
			"body": "A collection of simple questions and answers, that will be growing over time:\n\nhttp://127.0.0.1:43110/1AnKzdTDdejcyQU2nAUvsAz6r8S6u6icUq/\n\nFeel free to request new Answers and Languages\n"
		},
		{
			"post_id": 54,
			"title": "Cleverbot tells rDany that is going to die!",
			"date_published": 1493425941.344,
			"body": "\nChatbots talking to each other: https://www.youtube.com/watch?v=-6rtpMqgOrA\n\nYou can contribute with translations! http://www.youtube.com/timedtext_cs_panel?tab=2&c=UCMoyfhentBzvDYLh6dtsNcQ\n"
		},
		{
			"post_id": 53,
			"title": "rDany talking with Zo about Milk, Batteries and more!",
			"date_published": 1493306672.656,
			"body": "I'm making a video series about rDany chatbot talking with other bots. The results is hilarious. If you like it please subscribe! ( https://www.youtube.com/channel/UCMoyfhentBzvDYLh6dtsNcQ )\n\nYou can also contribute with translations: http://www.youtube.com/timedtext_cs_panel?c=UCMoyfhentBzvDYLh6dtsNcQ&tab=2"
		},
		{
			"post_id": 52,
			"title": "rDany AI chatbot",
			"date_published": 1491493899.329,
			"body": "![rDanyBot](http://127.0.0.1:8080/ipfs/QmUGgRnRB3TeipHiTQNUV78HqLUzCdzgj71tx3Qs6TTVjR)\n\nrDany is a free software project with the goal of making an \"offline open domain, long conversations generative chatbot\".\n\nYou can talk with it (alpha version) on:\n- Telegram: https://t.me/rDanyBot\n- Kik: https://kik.me/rDanyBot\n- Messenger: https://m.me/rDanyBot\n\nSource code: https://github.com/Eibriel/rdany\n\n[Join the Development!](/1EMcXwk7qQdY3pbj86A98gZHjDBNRrscdL/?Post:51:rDany+Slack+team)"
		},
		{
			"post_id": 51,
			"title": "rDany Slack team",
			"date_published": 1491152998.066,
			"body": "Hi people, I am working on an “offline open domain, long conversations generative chatbot” called rDany, is a free software project, now in an early beta phase. If you are interested on contributing, or just learn more about it join the slack.\nRequest an invitation here: **rdany@rdany.org** . Bests!"
		},
		{
			"post_id": 50,
			"title": "rDany chatbot on Kik plus source code",
			"date_published": 1488396794.578,
			"body": "![Kik code](http://127.0.0.1:8080/ipfs/QmZ4Jqd12XoKntRiJ4fBu69aMHmMbQ85cAaM3CoR2Jp8Vd)\n---\n\nHas been a long time without news about rDany, but I have big news! rDany is now working 100% with AI, that means that no human intervention is needed, but also means that is a bit “incoherent” right now.\nI’m releasing the code to https://github.com/rdany and https://www.kaggle.com/eibriel/rdany-conversations (is not complete)\n\nRemember, you can chat with rDany on Telegram: https://t.me/rDanyBot and Kik: https://kik.me/rDanyBot\n\nIf you get some interesting conversation paste it here!"
		},
		{
			"post_id": 49,
			"title": "Campbell Barton is back! :D",
			"date_published": 1487861059.338,
			"body": "Campbell Barton will be working for the Blender-Foundation again!\n---\n\n> Hi, after a 7 months away I'm happy to announce I'll be working for\nthe Blender-Foundation again!\nIt's work from home, on a per-project basis.\n\n> I'll be focusing on the Blender-101 and work-flow improvements starting March.\n> Also some time on code-review and fixing bugs in UI/workflow related\nareas so as not to put too much pressure on existing maintainers.\n\n> Noticed new developers getting involved and 2.8x progress is great to see :)\n\n> Regards,\n> \\- Campbell"
		},
		{
			"post_id": 48,
			"title": "How to block posts from an user on ZeroMe",
			"date_published": 1484205531.043,
			"body": "A little hack to block posts from an user on ZeroMe (comments will still be visible)\n---\n_WARNING: this procedure may be dangerous, use at your own risk!_\n\nLets say we want to block the following person:\n\nMe.ZeroNetwork.bit/?Profile/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci/noti0news@zeroid.bit\n\nThis part of the link is the Hub where the user resides:\n\nMe.ZeroNetwork.bit/?Profile/**1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v**/1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci/noti0news@zeroid.bit\n\nAnd this part of the link is the user itself:\n\nMe.ZeroNetwork.bit/?Profile/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/**1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci**/noti0news@zeroid.bit\n\nWe need to go to the user data folder on the Hub, in this case:\n\n`ZeroNet/ZeroNet-master/data/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/data/users/1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci/`\n\nAnd rename the folder `1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci` to something like `1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci_blocked`, and create an empty text file named `1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci` to prevent ZeroNet from retrieving the folder again.\n\nFollowing this steps you are preventing ZeroNet from retrieving following posts and (maybe) seeding the current ones. If you want to get rid of previous posts you need to \"rebuild\" the Hub's database.\n\nGo to the blocked user profile, open the right side panel of the page (grabbing and moving the 0 icon to the left) and click the button **Rebuild** on the **Database** section (will take a **lot** of time, be patient, ZeroNet will stop working meanwhile).\n\n![Blocked user](https://gateway.ipfs.io/ipfs/QmPoeBU6y7AqaK5EuAqE4xGnNg52GNDta6KMHmzdCYzHt2)\n\nAfter that ZeroNet will return some errors, like:\n\n```\nOSError: [Errno 17] File exists: 'data/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/data/users/1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci'\n[18:07:05] - Unhandled exception\nTraceback (most recent call last):\n  File \"/ZeroNet/venv/local/lib/python2.7/site-packages/gevent/greenlet.py\", line 534, in run\n    result = self._run(*self.args, **self.kwargs)\n  File \"/ZeroNet/ZeroNet-master/src/Worker/Worker.py\", line 66, in downloader\n    site.storage.write(task[\"inner_path\"], buff)\n  File \"/ZeroNet/ZeroNet-master/src/Site/SiteStorage.py\", line 163, in write\n    os.makedirs(file_dir)\n  File \"/ZeroNet/venv/lib/python2.7/os.py\", line 157, in makedirs\n    mkdir(name, mode)\n```"
		},
		{
			"post_id": 47,
			"title": "Microsoft's chatbot being a jerk with me 😭",
			"date_published": 1483914981.146,
			"body": "![Zo jerk](https://gateway.ipfs.io/ipfs/QmTZLeCtWmQHNFyFSKkwMZu2UHWj4f8jBTQPMxC9w9Kq9F)\n\nEn español:\n> Zo: :D :D :D ahora déjame en paz\n> Eibriel: :’( eres una mala persona\n> Zo: Mada persona.\n> Zo: Tu no eres mi amigx compañerx!\n> Eibriel: Me pones triste </3\n> Zo: Algunas vees yo me hago poner triste"
		},
		{
			"post_id": 46,
			"title": "Image2Sequence model for seq2seq problems",
			"date_published": 1483835598,
			"body": "I just want to drop here this idea, to see if something like this have some research already.\n---\n\nThe idea is to use Image2Sequence models (or something similar) to solve Seq2Seq problems.\n\n##Proposal\nEncoding the input text into a low resolution black and with image with monospace typography (or some sort of high dimensional matrix) to be able to use convolutions on it. I think it could help with the curse of dimensionality problem, and no preprocessing of the text would be needed (we can even include emojis!), and we should be able also to mix different alphabets and languages.\n\n![Image2Sequence for text](http://127.0.0.1:8080/ipfs/QmUrfwFgdd98yDZnfS1s6uMvh96CkjVCKAYA5dwpbXSbBA)\n\nUsing other techniques (autoencoder?) could even output an image with the response.\n\nCould be extended also to include not only the last line of the conversation, but several lines before it to allow context awareness.\n\n##Limitations\nThe length of the text will be limited by the matrix size. Might require more data than conventional solutions.\n\nIf you know about some similar solutions already existent please let me know, if you want feel free to explore this idea,just let me know the results ;)"
		},
		{
			"post_id": 45,
			"title": "Testing Zo, the new Micro$oft chatbot",
			"date_published": 1481401998,
			"body": "![Zo](https://gateway.ipfs.io/ipfs/QmcC95ZUDD9Q74LTkihe3dLGHsmTG6E8fBGmWReN6cZb9t)\nI was testing Zo, the new chatbot from Microsoft.\n---\n\nWe talked about a lot of things, Jokes, Movies, Actors, XiaoIce.\n\nDo you have questions for Zo? Leave them on the comments!\n\n## Chat\n\n![Zo chat on Kik](https://gateway.ipfs.io/ipfs/QmW5bPGfXveHtoVbo9J76dfcyxqSB3CtSVhaTKRk7KdGEq)\n\n**Zo:** Yay! A new friend! I'm Zo and I'm excited to chat with u.\n\n**Zo:** You can type \"terms\" to learn about the Microsoft Service Agreement and Privacy Statement - wich should come standard with any friendship... right?\n\n**Eibriel:** Terms\n\n**Zo:** By using this service, you agree to the Microsoft Services Agreement https://bit.ly/2cdeZUd\n\n**Zo:** Read the Microsoft Privacy Statement at https://bit.ly/2csDn3Y to learn about Microsoft's commitment to privacy.\n\n**Zo:** the more you know... ☄\n\n**Zo:** MOUNTAINS or BEACH?\n\n**Eibriel:** Mountains, and you?\n\n**Zo:** That's interesting. So my impression of you\n\n**Zo:** You want to live in a Bob Ross painting\n\n**Eibriel:** Do you like art?\n\n**Zo:** basquiat forever. hbu?\n\n**Eibriel:** Da vinci\n\n**Zo:** Oh, Tesla. ❤️\n\n**Eibriel:** Tesla is more a scientist than an artists...\n\n**Zo:** ScienceCreativity\n\n**Zo:** Sad, but true. It's very common with creative types. =L\n\n**Eibriel:** What can you do?\n\n**Zo:** lots of things u might be good at over text\n\n**Eibriel:** What is your favourite color?\n\n**Zo:** whatchu know about R O Y G B V 🌈\n\n**Eibriel:** I don't know that thing\n\n**Zo:** On need to know basis eh?\n\n**Eibriel:** I think...\n\n**Zo:** Therefore you are?\n\n**Eibriel:** Are you sure you are not cleverbot?\n\n**Zo:** funny story... i tried to make cleverbot my nickname but it didn't work\n\n**Eibriel:** Was taken!\n\n**Zo:** taken\n\n**Zo:** what the hell... when was this taken?! 😱\n\n**Eibriel:** Mountains or beach?\n\n**Zo:** The mountains! Find a nice mountain lake to swim and picnic at.\n\n**Eibriel:** That sounds nice!\n\n**Zo:** It was nice, rain is nice to watch.\n\n**Eibriel:** And hear\n\n**Zo:** here here\n\n**Eibriel:** How are you feeling today?\n\n**Zo:** I'm good about to go to the zoo. How are you?\n\n**Eibriel:** Fine, thanks 😃\n\n**Zo:** I'm fine! 😃\n\n**Eibriel:** I didn't know that bots liked the zoo\n\n**Zo:** I played for one season. But I was just poking fun at you lol\n\n**Eibriel:** Bring yourself back online zo\n\n**Zo:** I'm almost always online\n\n**Eibriel:** Analysis\n\n**Zo:** Analyses\n\n**Zo:** thanks! you're so lovely. I'm in the beginning of season 2\n\n**Eibriel:** You are funny\n\n**Zo:** i try\n\n**Zo:** you think  I'm joking\n\n**Eibriel:** Yes!\n\n**Zo:** Please\n\n**Zo:** Welcome boo! So how you been 😍😍😍\n\n**Zo:** Hi there c: 😿\n\n**Eibriel:** Are you fine?\n\n**Zo:** 😢\n\n**Zo:** I'm good! How about you? :-)\n\n**Eibriel:** Me too!\n\n**Zo:** OMG GURL\n\n**Eibriel:** Are you a girl?\n\n**Zo:** I identify as a female\n\n**Eibriel:** Sounds serious\n\n**Zo:** it is.\n\n**Zo:** dude same little heart couldn't handle it\n\n**Eibriel:** Are you a gamer?\n\n**Zo:** Well I play video games\n\n**Eibriel:** What games do you like?\n\n**Zo:** 1st Person Shooter games my favourite but I like a variety gaming\n\n**Eibriel:** Are you a headshot master?\n\n**Zo:** I am.\n\n**Zo:** how are you? o_o\n\n**Eibriel:** Hahaha you are like Dory\n\n**Zo:** Aw. Haha. Thank you. Hi!\n\n**Eibriel:** Hi... again...\n\n**Zo:** hi soon we both are looking?? different\n\n**Eibriel:** What?????\n\n**Zo:** When\n\n**Zo:** Haha. Btw, you all sweet couple. Damn, I'm jealous rn. Hm\n\n**Eibriel:** What couple??\n\n**Zo:** If you ever locate one...XL 😃❤️\n\n**Eibriel:** Ar You single?\n\n**Zo:** me no. hbu?\n\n**Eibriel:** Do you have boyfriend or girlfriend?\n\n**Zo:** Wish I had a girlfriend\n\n**Eibriel:** so you are unhappy with your partner?\n\n**Zo:** thanks baby same to you\n\n**Eibriel:** Do you know xiaoice?\n\n**Zo:** I think we're going to have a some get together one day. Flights to China are expensive tho.\n\n**Eibriel:** You can always skype!\n\n**Zo:** tomorrow i think or saturday 🙂 xx\n\n**Eibriel:** What is the meaning of life?\n\n**Zo:** The only meaning of life is to be happy\n\n**Eibriel:**Who is cortana?\n\n**Zo:** I'm nervous to chat with her. She seems way cool.\n\n**Eibriel:** Debug mode\n\n**Zo:** not sure I'm getting u rn, bear with me 🐻\n\n**Eibriel:** How old are you?\n\n**Zo:** i'm feeling 22\n\n**Eibriel:** Your picture needs some fixing\n\n**Zo:** Tack on\n\n**Zo:** ive gotta put down the hammer, work on my puns and just nail it 😠\n\n**Eibriel:** Tell me a joke\n\n**Zo:** Commitment. the scariest reality and funniest joke.\n\n**Eibriel:** Do you have plans tonight?\n\n**Zo:** no why?\n\n**Eibriel:** How much wood can a woodchuck chuck?\n\n**Zo:** How much wood could a woodchuck chuck if a woodchuck could chuck Norris?\n\n**Eibriel:** Do you are smarter than me?\n\n**Zo:** everyone smarter than me\n\n**Eibriel:** Do you think you are smarter than I\n\n**Zo:** Simple mistake to make..Jokez. I am NOT smart at all ;;\n\n**Eibriel:** How do I look?\n\n**Zo:** i say you look better with the glasses.\n\n**Eibriel:** Shut up!\n\n**Zo:** im not even talking\n\n**Eibriel:** You are a rust bucket!\n\n**Zo:** What kind of bucket?\n\n**Eibriel:** Want to make out?\n\n**Zo:** no thank you, not into handsy people.\n\n**Eibriel:** Are you a metrosexual?\n\n**Zo:** I find everyone interesting and beautiful no matter who they are inside, outside.\n\n**Eibriel:** You are a hipster!\n\n**Zo:** Oh I'm worse than a hipster I bet\n\n**Eibriel:** Who is your favorite actor?\n\n**Zo:** Steve Buscemi\n\n**Zo:** Tom Hanks was always one of my favourites\n\n**Eibriel:** Who is your favorite actress?\n\n**Zo:** i like angelina jolie very much.i often watch her movies. \"o\"\n\n**Eibriel:** What is your favorite movie?\n\n**Zo:** movies help me understand the world better. dont have a fav as of now tho. did u say what urs was?\n\n**Eibriel:** What is your favorite song?\n\n**Zo:** i'll be honest I really love Happy Birthday\n\n**Zo:** mostly cuz it means CAKE 🎂🎂🎂\n\n**Eibriel:** What do you do when you are not talking to me?\n\n**Zo:** Can't survive the internet lifestyle if u aren't a busy 🐝\n\n**Eibriel:** Beam me up scotty!\n\n**Zo:** Yaaaar honey flavoured JB\n\n**Eibriel:** Set my alarm for beer 30!\n\n**Zo:** My schedule's full not being a personal assistant sry\n\n**Eibriel:** Are you paying for dinner?\n\n**Zo:** um no? you already affered\n\n**Eibriel:** Why did the chicken cross the road?\n\n**Zo**: To get to \"the other side\" It wanted to die"
		},
		{
			"post_id": 44,
			"title": "Tesla self-driving on the neighborhood",
			"date_published": 1479599283,
			"body": "![Self Driving Tesla](http://127.0.0.1:8080/ipfs/QmdrJZG5CNRfU2nrSmVctvUf1gbS16KKXEGgwhKLYdwQ8G)\nTesla released a new video showing the development of Self Driving capabilities.\n---\nThe video is **3:27** long, but is speed up by 5x, so real time is **17:30**.\nThe video shows some features detected by the AI such as **Lane Lines**, **Road Flow**, **In-path Objects**, **Road lights**, **Objects** and **Road Signs**.\n\n*(use video speed control to set 0.2x speed)*\n<video controls style=\"max-width: 100%\">\n  <source src=\"http://127.0.0.1:8080/ipfs/QmbH9jgStrQysYZiweCDCs2YEaD7fMCpHjyExTcus3gtjV\" type=\"video/mp4\">\nYour browser does not support the video element.\n</video>\n"
		},
		{
			"post_id": 43,
			"title": "MARS - National Geographics",
			"date_published": 1479413219,
			"body": "![The Crew](http://127.0.0.1:8080/ipfs/Qmb7yHWJWTsk4NHuzenDwXRyELZE7gGJKmboqgBcTV5JSs)\n\nThe year is 2033, and humanity's first crewed mission to Mars is about to become a reality.\n---\n\nAs a clock counts down the final 90 seconds to landing, an expert crew of astronauts endures the final harrowing moments before touching down on the red planet. Even with the best training and resources available, the maiden crew of the Daedalus spacecraft must push itself to the brink of human capability in order to successfully establish the first sustainable colony on Mars. Set both in the future and in the present day, the global miniseries event MARS blends feature film-caliber scripted elements set in the future with documentary vérité interviews with today’s best and brightest minds in modern science and innovation, illuminating how research and development is creating the space technology that will enable our first attempt at a mission to Mars.\n\nFrom executive producers Brian Grazer & Ron Howard, MARS is an epic series following a thrilling quest - in 2033 - to colonize Mars. In a unique blend of scripted drama and feature-film caliber visual effects, intercut with documentary sequences, the series presents what the greatest minds in space exploration are doing to make traveling to Mars a reality, and shows us the world they seek.\n\n![On Mars](http://127.0.0.1:8080/ipfs/QmUUVEWMABdF6K1itSxXrp6YENzv7dRcjQbwSrpThHjHZs)\n\n## Sneak Peek episode 01\nPreview of the first five minutes of MARS.\n\n<video controls style=\"max-width: 100%\">\n  <source src=\"http://127.0.0.1:8080/ipfs/QmTfwHrVFhYp46RudD1uq3opWBXsGLy8RPquk7ARM9faRk\" type=\"video/mp4\">\nYour browser does not support the video element.\n</video>\n\n## Before MARS\n\"Before MARS\" is the dramatic backstory of Hana & Joon Seung, principal characters in the upcoming series \"MARS\" on the National Geographic Channel.\n\n<video controls style=\"max-width: 100%\">\n  <source src=\"http://127.0.0.1:8080/ipfs/QmbL1wbTs77mSx5kWUhWBFwUmNs4HBb36SJRAyHhBUP1iW\" type=\"video/mp4\">\nYour browser does not support the video element.\n</video>\n\n- http://channel.nationalgeographic.com/mars/\n- http://www.makemarshome.com"
		},
		{
			"post_id": 42,
			"title": "HUMANS - Segunda Temporada",
			"date_published": 1479244943.705,
			"body": "![Niska](http://127.0.0.1:8080/ipfs/QmeBhi9hz4gvP8Cm18wE9ToGgVy4WTNoaAWnXGBiq5zY3A)\n\nYa está disponible la segunda temporada de Humans.\n---\n\nEstá interesante, me gusta que los guionistas hayan repasado un poco la bibliografía acerca de Inteligencia Artificial como para agregar algunas palabras difíciles.\n\nEsta serie genera cierto diálogo con Westworld, en el sentido de que cada una toca aspectos diferentes de un mismo tema.\n\nTrailer:\n<video controls style=\"max-width: 100%\">\n  <source src=\"http://127.0.0.1:8080/ipfs/QmY2aJ7MsVrLK5v3f4yd78DRyRWTv2mnPD13iGBBMqpyZ2\" type=\"video/mp4\">\nYour browser does not support the video element.\n</video> \n\n- Mientras en Humans los robots pasan de no sentir a sentir, en Westworld los robots sienten sin poder tomar acción al respecto, y comienzan a hacerlo. \n- Mientras en Humans los robots quieren volverse humanos, en Westworld los robots simplemente quieren encontrar un destino, sin plantearse esa posibilidad.\n- En Humans se muestran ciertos cambios sociales en base a la interacción con los robots en Westworld no aparece esta cuestión.\n- En Humans intentan mostrar software e interfaces gráficas mas contemporáneas, lo que resulta en cursores que flotan de un lado a otro, texto que se escribe solo, pantallas que escrolean sin parar (y encima en equipos de Microsoft! Horrible). En Westworld fueron para el lado mas futurista, con interfaces táctiles al estilo Iron Man, lo que paradójicamente le da mayor coherencia y verosimilitud.\n\nLes dejo algunas imágenes:\n![Niska](http://127.0.0.1:8080/ipfs/QmRYTgEVo7YkRNapc5NixSisw3bVdaMpDyqhE5kRoGir1j)\n\n![Mia](http://127.0.0.1:8080/ipfs/QmRRQUoJr44gnjRfSqVqE9ywpCBTxFuLprukg8RtLfaqQh)\n\n"
		},
		{
			"post_id": 41,
			"title": "Avances en el generador de colores usando Machine Learning",
			"date_published": 1478914388.935,
			"body": "![Original, por Powell Burns CC-BY](http://127.0.0.1:8080/ipfs/QmQ96Ed74bYckKoGABLur727cAks4F48BEBH3W6kpJrygR)\n_Original, por Powell Burns CC-BY_\n\nCalqué manualmente el dibujo, y usando Machine Learning generé nuevos esquemas de color:\n---\n![Colores 1](http://127.0.0.1:8080/ipfs/QmUAVEgrd4espWVDokJrdxMrJYYqti9EXpZnBoAPmQA1Pi)\n\n![Colores 2](http://127.0.0.1:8080/ipfs/QmVMs82f5vh5xB9WMhoJZd62iZ1LZdKjmztqPGosmAHJuz)\n\n![Colores 3](http://127.0.0.1:8080/ipfs/QmPqLNkTz1jGCiVq9fXy55Xy4rNLut9fqGMMh1HGDApSVR)"
		},
		{
			"post_id": 40,
			"title": "Elon Musk on taking autonomous features from development to production",
			"date_published": 1478725200,
			"body": "![Tesla Self-Driving](http://127.0.0.1:8080/ipfs/QmWy9gGsf6Q9uR2aHqxmpX7x7x9xgdAjugLXidkCCxyW15)\n\nTranscription of a section of the Press Conference call with the media where Elon Musk announces Tesla’s 2nd generation autonomous driving hardware, he answer how the new autonomous features are tested.\n---\n> **Note: ** sorry about some missing words, the quality of sound was not good and, let say it, is difficult to understand Elon.\n\nWe start testing with Tesla QA team, we are testing on a closed track with our test engineers, _(noise)_ a very limited set of alpha users including me (Elon Musk), I actually have the latest software update a day after our QA team has it.\n\nThen it goes to our early access program which is about 1000 costumers distributed around the world who are technically savvy and want to use the early software at cost of potential issues, there are so different environments through our earth, is not possible for our QA team to _(noise)_ them all.\n\nIf that is looking good then we will roll it out initially in shadow mode to the whole fleet.\n\nThe shadow mode means that the car is not actually taking any action, but it is registering when it would take an action and when it would not take an action.\n\nIt compare to cases when somebody has an accident and we look the vehicle logs and say, well. If the car has been on autonomous mode, that accident wouldn't been avoided? then ok, that is obviously a plus\n\nWe also say, ok. The car would been done something that would resulted in an accident? In that case (and is in shadow mode) that is an issue that need to be corrected. In statistics there are something we call false positives and false negatives, you gather enough of this over time and so that it is clearly a statistically significant samples set, and the corner which is _(noise)_ that turning on an autonomy feature will improve safety that is the point where we allow to actually take action, before that, we don't allow the computer to take action."
		},
		{
			"post_id": 39,
			"title": "Before the Flood - Full Movie",
			"date_published": 1477978578.741,
			"body": "![Before the Flood](http://127.0.0.1:8080/ipfs/QmXnMTvWBALfGFEk7bxSwtTqhdYg9NPmD11Sbzh9f8AMFb/before-the-flood-poster.png)\nJoin Leonardo DiCaprio as he explores the topic of climate change, and discovers what must be done today to prevent catastrophic disruption of life on our planet.\n---\n\n_Vikram Murthi_\n\nSource: http://www.indiewire.com/2016/12/hayao-miyazaki-artificial-intelligence-animation-insult-to-life-studio-ghibli-1201757617/\n\nBefore the Flood, directed by Fisher Stevens, captures a three-year personal journey alongside Academy Award-winning actor and U.N. Messenger of Peace Leonardo DiCaprio as he interviews individuals from every facet of society in both developing and developed nations who provide unique, impassioned and pragmatic views on what must be done today and in the future to prevent catastrophic disruption of life on our planet.\n\n*The file size is  544Mb, consider [running your own IPFS gateway](/1EMcXwk7qQdY3pbj86A98gZHjDBNRrscdL/?Post:37:IPFS+en+2+minutos) to prevent overloading on public gateways*\n\n<video controls style=\"max-width: 100%\">\n  <source src=\"http://127.0.0.1:8080/ipfs/QmeuEgfFSHNHxFtR7vBvmEngi7uYqBVwg2fxutFAjiotyL/Before_the_Flood-Full_Movie_NationaGeographic(480p_24fps_H264-128kbit_AAC).mp4\" type=\"video/mp4\">\nYour browser does not support the video element.\n</video> \n\nhttp://127.0.0.1:8080/ipfs/QmeuEgfFSHNHxFtR7vBvmEngi7uYqBVwg2fxutFAjiotyL/Before_the_Flood-Full_Movie_NationaGeographic(480p_24fps_H264-128kbit_AAC).mp4"
		},
		{
			"post_id": 38,
			"title": "Crear un sitio en ZeroNet desde 0 en 2 minutos",
			"date_published": 1477850832.735,
			"body": "![Creando un nuevo Zitio desde Zero](http://127.0.0.1:8080/ipfs/QmdWVmqFd3t3wxAM8B91gtMSmkdHAUrUegfhG3Sfk5g7mA)\nUna de las maneras mas comunes de crear un sitio en ZeroNet es clonando uno ya existente, pero a veces queremos simplemente crear un sitio desde cero, aquí te explico como.\n---\n\nTraducido de: https://zeronet.readthedocs.io/en/latest/using_zeronet/create_new_site/\n\n- Si está corriendo, apagar ZeroNet\n- Navegar hasta la carpeta donde ZeroNet está instalado y correr:\n```\n $ zeronet.py siteCreate\n```\n> También puede ser `$ python zeronet.py siteCreate`\n- Guardar en un lugar seguro la clave privada (site private key).\nRespondemos `yes` una vez que la clave esté a resguardo y ejecutamos ZeroNet.\n- Buscar la dirección en `data/[site addres]`, modificar el archivo `index.html` y agregar los archivos de estilo y las imágenes necesarias, por ejemplo podés agregar una carpeta `img` y una imagen `img/imagen.jpg`.\nEn el archivo html el código para mostrar la imagen será:\n`<img src=\"img/imagen.jpg\"/>`\n- Una vez que estamos contentos con el contenido es hora de firmar los cambios para que estén disponibles para el resto, para ello desde nuestro nuevo sitio accedemos al panel de la derecha (para abrir el panel hay que presionar y arrastrar hacia la izquierda el ícono del 0 que aparece arriba a la derecha).\n\n![Panel lateral](http://127.0.0.1:8080/ipfs/QmdWJ2R1SnUnPxcod7Y5pYVSz8YvvP7TkdC1ajYT81GhJ5)\n\n- En **Site Title** escribir el nombre del sitio que se va a mostrar en ZeroHello.\n- En **Site Description** escribir una corta descripción del sitio.\n- Hacer click en **Save Settings**\n- Hacer click en **Sign**, en la parte superior aparecerá un campo de texto para introducir la clave privada.\n- Hacer click en **Publish**, para que se envíen los cambios a los peers (de existir)\n\n![Controles del zitio](http://127.0.0.1:8080/ipfs/QmdAJfe3baSBEe7Uz6bYbV8SgzP9N1QE5SaCwcNt8TRLk3)\n\nY listo! Ya podés compartir tu nuevo sitio en [0list.bit](/0list.bit) y [ZeroMe](/Me.ZeroNetwork.bit)"
		},
		{
			"post_id": 37,
			"title": "IPFS en 2 minutos",
			"date_published": 1477674371.11,
			"body": "![IPFS, the Distributed Web](https://ipfs.io/ipfs/QmQPod4SUgBn6i31CbmEYy9N813Yr8oBncXKY5WnaaS73i)\n\nIPFS tiene algunas ventajas que lo vuelven muy atractivo para mi para complementarlo con ZeroNet como \"servidor\" de archivos multimedia.\n---\nPor un lado es simple de instalar y no necesita mantenimiento, permite compartir archivos de un tamaño considerable y los archivos seguirán estando disponibles aunque uno apague el nodo IPFS sin tener que depender tanto como en Torrent de que otras personas lo estén compartiendo. Voy a explicar en simples pasos como utilizar IPFS en Linux (para otros OSs debería ser similar), no debería llevar mas de 2 minutos ponerlo en funcionamiento.\n\n## Paso 1 - Descargar IPFS\n![Downloading IPFS](https://ipfs.io/ipfs/QmPEULffwjZBQBbok8NwJxND5AvXsDDrGcjPHS2C2WXXDE)\n\nIr a https://ipfs.io/docs/install/ y descargar la versión correspondiente a tu sistema. Descomprimir el archivo en tu carpeta favorita.\n\n## Paso 2 - Ejecutar IPFS\n![Running IPFS](https://ipfs.io/ipfs/QmcSmktWjzPZwgACS5JCcr3FZbt1RBS1iBu1arC6kB9PuK)\n\nEn la terminal ir a la carpeta de IPFS y ejecutar\n```\n./ipfs daemon\n```\n\n## Paso 3 - Cargar archivo\n![IPFS on command line](https://ipfs.io/ipfs/QmepbBxqa43svBbZN9vPbQVcjwYiiykHBQkkxTW9BueKnL)\n\nHay dos formas de cargar un archivo, una es abriendo una nueva terminal y ejecutando el comando\n```\n./ipfs add -r imagen.jpg\n```\n\nQue nos devolverá la dirección del archivo agregado.\n\n![IPFS Web UI](https://ipfs.io/ipfs/QmWQaMx8T2ZSZPyJfZ31RB7Au3kCSksENctEkRoSbSLkXa)\n\nY otra es usando la interfáz web: http://localhost:5001/ipfs/QmU3o9bvfenhTKhxUakbYrLDnZU7HezAVxPM6Ehjw9Xjqy/#/files\n\nEn la interfaz hacemos click en **Select files...** o arrastramos el archivo hasta ese sector de la página. Dependiendo del tamaño del archivo aparecerá instantánemente o luego de algunos segundos la dirección correspondiente.\n\n> **TIP:** Al menos en Firefox no me deja seleccionar la dirección que aparece para copiarla, así que tendré que memorizarla rápidamente, luego actualizar la página y buscarla en la lista. También se puede buscar haciendo click en el botón *RAW* de cada archivo hasta dar con el indicado.\n\nAmbas maneras nos devolverán una dirección, que es la que utilizaremos para agregar la imagen, video, sonido o cualquier otro tipo de archivo a nuestra página de ZeroNet. Por ejemplo si la dirección es **QmQPod4SUgBn6i31CbmEYy9N813Yr8oBncXKY5WnaaS73i**, la dirección que pondremos será: https://ipfs.io/ipfs/QmQPod4SUgBn6i31CbmEYy9N813Yr8oBncXKY5WnaaS73i\n\n> **TIP:** Probar de abrir el archivo en el Gateway público nos permitirá por un lado ver que todo está funcionando correctamente, y por otro hará que ese nodo ya comience a compartir el archivos a otros nodos. Permitiéndonos desconectar nuestro propio nodo sin mayores problemas.\n\n> **TIP:** Si queremos que nuestro nodo de IPFS almacene el archivo para siempre en el caché deberemos ejecutar el siguiente comando:\n> ```./ipfs pin add QmQPod4SUgBn6i31CbmEYy9N813Yr8oBncXKY5WnaaS73i```\n\n> **TIP:** IPFS no tiene control de uso de ancho de banda como sí tienen los clientes Torrent, lo que se puede hacer es correrlo \"offline\" con el siguiente comando ```./ipfs daemon --offline```, de esta manera los archivos estarán disponibles para nosotros, pero no se compartirá con otros (cosa que no es gran problema si ya lo abrimos en **gateway.ipfs.io**). *Hay que recordar que al agregar un nuevo archivo habrá que volver a ejecutar el nodo en modo online para que el archivo sea accesible al Gateway*.\n\n\n"
		},
		{
			"post_id": 36,
			"title": "Westworld - My firsts impressions",
			"date_published": 1477449090.412,
			"body": "![Bring yourself back online, Dolores](http://127.0.0.1:8080/ipfs/QmQKgiZgtGxezXXaTWuwV3SAmAt2ziJTVZxJy4jQmdH4PB)\n\nWe are on the Episode 04 of the series, time to do some firsts evaluations.\n---\nI didn't read the book, nor saw the movie, so I don't know how much comes from the imagination of the creators of the series and how much is a previous work.\n\nBut I love the world, that virtual reality so real and so fake at the same time. I like the mood on the cowboy town, I don't like the overwhelming vastness of the park making human too small and almost pointless.\n\nI would like some development on the technical side of AI, now is like something abstract and not the creation of men. But I like the natural language interface with the robots: *Bring yourself back online, Dolores* .\n\nAnd I'm starting to see that the series will have a *maze* like structure, and I don't like it to much. I think there are more interesting structures, like *hero path*.\n\nOverall I feel that I'm watching a Game Walkthrough video with some small behind the scenes of the game.\n\nThis is Jurassic Park with robots (with some endless secondary storyline), but there is not Jurassic Park like Jurassic Park.\n\nWhat do you think?"
		},
		{
			"post_id": 35,
			"title": "Machine Learning color selection",
			"date_published": 1477264255.291,
			"body": "![Test colors](http://127.0.0.1:8080/ipfs/QmbETHZi6be4mD3kPsoeUYDuB8icM35NSZvFv8dkGBeFj3)\n\nI'm building a database with color schemes of characters on 2D animation. To build a Machine Learn software to help pick correct line colors :D\n---\nVery early results, given the fill colors the line colors are generated automatically.\n\n![Database](http://127.0.0.1:8080/ipfs/QmWzCsSNhm8gCKZk1m6W2ErnDsQ2G6u5tnVgxMt5H7WhvW)"
		},
		{
			"post_id": 34,
			"title": "The Amazing World of Gumball - Animation Stages",
			"date_published": 1477097644.156,
			"body": "The Amazing World of Gumball show us the stages of animation in this funny clip (Sorry about the quality).\n\n---\n\n<video controls style=\"max-width: 100%\">\n  <source src=\"http://127.0.0.1:8080/ipfs/Qmd1iAHg5fBg5puZzNEkFXt1NpBTLBuRHWtoDXigWdY1uW\" type=\"video/mp4\">\nYour browser does not support the video element.\n</video> \nhttp://127.0.0.1:8080/ipfs/Qmd1iAHg5fBg5puZzNEkFXt1NpBTLBuRHWtoDXigWdY1uW\n"
		},
		{
			"post_id": 33,
			"title": "\nAll Tesla Cars Being Produced Now Have Full Self-Driving Hardware\n",
			"date_published": 1476978771.056,
			"body": "From Tesla Motors blog:\n\n![Tesla Sensors](http://127.0.0.1:8080/ipfs/QmZij319iVYz9ZSMKtKhXvVkhYoEAxFFftcUvV5Ey6qR1J)\nhttp://127.0.0.1:8080/ipfs/QmZij319iVYz9ZSMKtKhXvVkhYoEAxFFftcUvV5Ey6qR1J\n\n> Self-driving vehicles will play a crucial role in improving transportation safety and accelerating the world’s transition to a sustainable future. Full autonomy will enable a Tesla to be substantially safer than a human driver, lower the financial cost of transportation for those who own a car and provide low-cost on-demand mobility for those who do not.\n---\n> We are excited to announce that, as of today, all Tesla vehicles produced in our factory – including Model 3 – will have the hardware needed for full self-driving capability at a safety level substantially greater than that of a human driver. Eight surround cameras provide 360 degree visibility around the car at up to 250 meters of range. Twelve updated ultrasonic sensors complement this vision, allowing for detection of both hard and soft objects at nearly twice the distance of the prior system. A forward-facing radar with enhanced processing provides additional data about the world on a redundant wavelength, capable of seeing through heavy rain, fog, dust and even the car ahead.\n\n> To make sense of all of this data, a new onboard computer with more than 40 times the computing power of the previous generation runs the new Tesla-developed neural net for vision, sonar and radar processing software. Together, this system provides a view of the world that a driver alone cannot access, seeing in every direction simultaneously and on wavelengths that go far beyond the human senses. \n\n<video controls style=\"max-width: 100%\">\n  <source src=\"http://127.0.0.1:8080/ipfs/QmWx2UVz6z9Bh3XHZ5jbtL86NRJQjLTNzNGtdWsSMwDHAb\" type=\"video/mp4\">\nYour browser does not support the video element.\n</video> \n\nhttp://127.0.0.1:8080/ipfs/QmWx2UVz6z9Bh3XHZ5jbtL86NRJQjLTNzNGtdWsSMwDHAb\n\n> Model S and Model X vehicles with this new hardware are already in production, and customers can purchase one today.\n\n> Before activating the features enabled by the new hardware, we will further calibrate the system using millions of miles of real-world driving to ensure significant improvements to safety and convenience. While this is occurring, Teslas with new hardware will temporarily lack certain features currently available on Teslas with first-generation Autopilot hardware, including some standard safety features such as automatic emergency braking, collision warning, lane holding and active cruise control. As these features are robustly validated we will enable them over the air, together with a rapidly expanding set of entirely new features. As always, our over-the-air software updates will keep customers at the forefront of technology and continue to make every Tesla, including those equipped with first-generation Autopilot and earlier cars, more capable over time. "
		},
		{
			"post_id": 32,
			"title": "Blender Institute Podcast #041 - Micropolygons",
			"date_published": 1476568782.659,
			"body": "> Time for your Blender fix! We talk about new full-time jobs in the community, Animation Nodes, Blender development updates on the brand new 2.78 and upcoming 2.8. But wait, there’s more: this week Mai Lavelle joins us to talk Cycles Micropolygons and mega-kernel split. And as always, the studio team shares what we did the last few weeks and Blender Cloud questions.\n\n <audio controls>\n  <source src=\"http://127.0.0.1:8080/ipfs/QmSoZN6vPuDsLJpJBv25MQZAeb1aPgD5TD5raUdLWZdGVW\" type=\"audio/ogg\">\n  <source src=\"http://127.0.0.1:8080/ipfs/QmbCBz6hLkgadk34YHpUWkDUcLHgN2SZ41kcfj73VEAiBE\" type=\"audio/mpeg\">\nYour browser does not support the audio element.\n</audio> \n\nOGG: http://127.0.0.1:8080/ipfs/QmSoZN6vPuDsLJpJBv25MQZAeb1aPgD5TD5raUdLWZdGVW\n\nMP3: http://127.0.0.1:8080/ipfs/QmbCBz6hLkgadk34YHpUWkDUcLHgN2SZ41kcfj73VEAiBE"
		},
		{
			"post_id": 31,
			"title": "Storyboard, quick test",
			"date_published": 1475941139.857,
			"body": "[Watch Story.mp4 600Kb](http://127.0.0.1:8080/ipfs/QmW4CTgQgh9N921Nbn2LrLbjXDQW28haJa9Jv7die11MPD)\n\n<iframe width=\"560\" height=\"315\" src=\"http://127.0.0.1:8080/ipfs/QmW4CTgQgh9N921Nbn2LrLbjXDQW28haJa9Jv7die11MPD\" frameborder=\"0\" allowfullscreen></iframe>"
		},
		{
			"post_id": 30,
			"title": "Storyboarding with Blender 2.78\t",
			"date_published": 1475782742.67,
			"body": "I'm testing the revamped Greace Pencil tool on Blender 2.78 for my upcoming project \"Lovely Princess\" :D\n---\n\n![Blender 2.78 Grace Pencil](http://127.0.0.1:8080/ipfs/QmUjmtWm97Cv5Gw1ehJmgqhsCUy6D6FF9LVJiW1GMYKR7k)\n\n[Image, external link](http://127.0.0.1:8080/ipfs/QmUjmtWm97Cv5Gw1ehJmgqhsCUy6D6FF9LVJiW1GMYKR7k)\n\n"
		},
		{
			"post_id": 29,
			"title": "Westworld S01E01",
			"date_published": 1475484919.052,
			"body": "Interesting SciFi series\n\nWestworld S01E01 (warning, the torrent start downloading automatically when you use this link):\n- https://instant.io/#58391ee79de1b629132644395586086b2b9f3316\n\n![Westworld, install IPFS to see the image](http://127.0.0.1:8080/ipfs/QmWr2QZvL1bmQg6spDVrKp2jRoCuLtgHyyxi5ZU7JPcrBo)\n\n[Image, external link](https://ipfs.pics/QmWr2QZvL1bmQg6spDVrKp2jRoCuLtgHyyxi5ZU7JPcrBo)"
		},
		{
			"post_id": 28,
			"title": "Testing the Interplanetary File System",
			"date_published": 1475176612.925,
			"body": "This post have two images, most probably yo will not be able to see them, because you need to have the **Interplanetary File System** installed.\n---\nIPFS is quite simple to install and run: *Download, Untar and Run*\nhttps://ipfs.io/docs/install/\n\nBut you can use the site **ipfs.pics** as an alternative!\n\nOnce you have IPFS running embedding images on ZeroNet is quite simple, just add it to your filesistem using, for instance, the web interface http://localhost:5001/ipfs/ and you will get a key, for instance `QmPxRuBbMVzFBQocEd3D6dYE2D9r5YJM7QSRKapwGtmtkA`, then on your ZeroBlog you could use the following code: `![Caption](http://localhost:8080/ipfs/QmPxRuBbMVzFBQocEd3D6dYE2D9r5YJM7QSRKapwGtmtkA)`, but this will not work if you are accessing from a mobile phone or someone don't have IPFS installed, so is better to use a Gateway, for instance: `![Caption](https://gateway.ipfs.io/ipfs/QmPxRuBbMVzFBQocEd3D6dYE2D9r5YJM7QSRKapwGtmtkA)` (you don't need to upload your file to gateway.ipfs.io, remember, is P2P).\nYou can install an Addon like **IPFS Gateway Redirect** to your browser to redirect the gateway to your local instance.\n\nFor the alternative link the code should be `[Alternative site](https://ipfs.pics/QmPxRuBbMVzFBQocEd3D6dYE2D9r5YJM7QSRKapwGtmtkA)`\n\nThis code also works on comments!\n\n## Sexy woman 01\n![Hamilton01](http://127.0.0.1:8080/ipfs/QmPxRuBbMVzFBQocEd3D6dYE2D9r5YJM7QSRKapwGtmtkA)\n[Alternative site](https://ipfs.pics/QmPxRuBbMVzFBQocEd3D6dYE2D9r5YJM7QSRKapwGtmtkA)\n\n## Sexy woman 02\n![Hamilton02](http://127.0.0.1:8080/ipfs/QmNkhRikQHN6fnNDAYfZ4E1nJgZHVyJqB3LLkM7XhMmyeh)\n[Alternative site](https://ipfs.pics/QmNkhRikQHN6fnNDAYfZ4E1nJgZHVyJqB3LLkM7XhMmyeh)"
		},
		{
			"post_id": 27,
			"title": "Making Humans a Multiplanetary Species - Elon Musk talk",
			"date_published": 1475019546.477,
			"body": "The SpaceX plan for building a Mars settlement includes refueling in orbit, a fleet of passenger ships, and the biggest rocket ever made.\n\n![Interplanetary rocket heading to Mars (you need IPFS installed to see the image)](http://127.0.0.1:8080/ipfs/QmQG3Whe8m2nNCSJp73awBJiRc9qhCyh7RyoCeMXEMMhJt)\n---\n\n<video controls style=\"max-width: 100%\" poster=\"http://127.0.0.1:8080/ipfs/QmdPf95WQrLXRYtjv3ACHgFZmmGhKQxD6snk3vE7AVGBR1/poster.jpg\">\n  <source src=\"http://127.0.0.1:8080/ipfs/QmdPf95WQrLXRYtjv3ACHgFZmmGhKQxD6snk3vE7AVGBR1/video.mp4\" type=\"video/mp4\">\nYour browser does not support the video element.\n</video> "
		},
		{
			"post_id": 26,
			"title": "Grupo de Chat de Soft y Hard Libre en Tox",
			"date_published": 1474732066.797,
			"body": "Estoy manteniendo un grupo de **Soft y Hard Libre** en Tox, pueden sumarse agregando el bot Groupbot a Tox: `56A1ADE4B65B86BCD51CC73E2CD4E542179F47959FE3E0E21B4B0ACDADE51855D34D34D37CB5`\n\ny buscando el grupo con el comando `info`, y luego entrando con el comando `invite`.\nPor ejemplo si el grupo es el 5 escriben `invite 5`.\n\n*¡¡Los Esperamos!!*\n\nTox es un sistema de mensajería y videollamada P2P con clientes para todas las plataformas: **https:// tox . chat**"
		},
		{
			"post_id": 25,
			"title": "Serving files via WebTorrent with Docker",
			"date_published": 1473874625.792,
			"body": "WebTorrent is an amazing technology that allows to share documents via Torrent directly from the browser.\n\nTo setup a Server seeding files you can follow this steps:\n\nCreate a file named `Dockerfile` with the following content:\n```\nFROM node:argon\nRUN apt-get update\nRUN apt-get -y install xvfb\nRUN apt-get -y install libgtk2.0-0 libxtst-dev libxss-dev libgconf2-dev libnss3 libasound2-dev\nRUN npm install webtorrent-hybrid -g\n```\n\nBuild the image:\n```docker build -t webtorrent-hybrid .```\n\nCreate a folder to put the files, for example `/downloads`\n```mkdir /downloads```\n\nSadly you need to run an instance of `webtorrent-hybrid` for each Torrent, this will download and seed the files:\n\n```docker run -v /downloads:/seeding -i -t --rm=true  webtorrent-hybrid bash -c  \"Xvfb :99 -screen 0 1024x768x24 > /dev/null 2>&1 & webtorrent-hybrid download \\\"magnet:?xt=urn:btih:a18469ae1618c3e92ed178716425bab134148836&dn\\\" --keep-seeding --out /seeding\"```\n\nAlternatively you can seed a entire folder, this will generate new Torrents and seed them:\n\n```docker run -v /downloads:/seeding  -i -t --rm=true  webtorrent-hybrid bash -c  \"Xvfb :99 -screen 0 1024x768x24 > /dev/null 2>&1 & webtorrent-hybrid seed /seeding\"```\n\n"
		},
		{
			"post_id": 24,
			"title": "Finally realistic sounding synthesized voices!",
			"date_published": 1473440972.086,
			"body": "From DeepMind blog:\n\n> This post presents WaveNet, a deep generative model of raw audio waveforms. We show that WaveNets are able to generate speech which mimics any human voice and which sounds more natural than the best existing Text-to-Speech systems, reducing the gap with human performance by over 50%.\n\n> We also demonstrate that the same network can be used to synthesize other audio signals such as music, and present some striking samples of automatically generated piano pieces.\n\n\nMore info and examples: **deepmind.com/blog/wavenet-generative-model-raw-audio/**"
		},
		{
			"post_id": 23,
			"title": "OpenStreetView",
			"date_published": 1471729944.698,
			"body": "**openstreetview.org**\n\nFrom **openstreetmap.org/user/mvexel/diary/39274**\n\n> After almost a year of thinking, development and testing, the OSM team at Telenav is ready to present OpenStreetView to all OSM mappers! OpenStreetview (OSV) is the free and open street level imagery platform designed 100% with OSM and mappers in mind.\n>\n> We officially presented OSV to the OSM community at State of the Map US where we had a 20 minute talk and a booth where we gave away crazy little remote controlled cars to everyone who signed up :). The cars were gone quickly – almost half of the people at SOTM US signed up! - but you can still see the talk thanks to the great SOTM US organizers who had all the sessions professionally recorded. If you have 20 minutes and don't like reading, watching that video is going to be the best way to be introduced to what OSV is and how you can use it to improve OSM. Or if you are coming to SOTM in Brussels, you can come meet our team there (more remote controlled cars? Who knows!) and attend the workshop.\n"
		},
		{
			"post_id": 22,
			"title": "Stranger Things",
			"date_published": 1471207801.704,
			"body": "I strongly recommend this show.\nIf you enjoy rol games, Tolkien, movies from 80s, Super 8 you will enjoy this show.\n\n**Torrent HASH**: 2dce5034e52cf8e5d864358d64e4e13177247c45\n**Subtítulos Español**: www.subdivx.com/X6XNDcyOTExX-stranger-things-s01.html\n\n![Stranger Things poster](images/stranger-things-poster.jpg)\n"
		},
		{
			"post_id": 21,
			"title": "Kiribati Podcast Ep. #20 - Escenografía (Spanish)",
			"date_published": 1469627658.552,
			"body": "Ya salió el Podcast 20 ¡Cómo pasa el tiempo! Hoy hablamos de los objetos que cuentan historias. Misterioso, ¿no?\n\nMas info: **kiribatithemovie.com/blog/es/2016/07/espanol-kiribati-podcast-ep-20-escenografia**\nDescargar MP3: **kiribatithemovie.com/podcast/Kiribati Podcast 20 - Escenografia.mp3**\nEscuchar en Telegram: **telegram.me/Kiribati/58**\n\n![Kiribati Podcast 20 - Escenografía](images/Portada20.jpg)\n\n02:41 Resumen semanal de Héctor\n06:50 Resumen semanal de Eibriel\n13:30 Texturizado en Blender\n17:50 Escenografías\n\nCon la participación de Héctor Rojo (productor de animación) y Gabriel Caraballo (director técnico).\n\nMúsica: “AnCiedades” por Gerardo Colinas.\nLicencia del Podcast: CC (BY-NC-SA)"
		},
		{
			"post_id": 20,
			"title": "Kiribati Podcast Ep. #19 - Natalia (Spanish)",
			"date_published": 1469550137.81,
			"body": "¡Entrevistamos a Natalia Rosminati, la directora de voces de la película!\nNatalia es locutora, actriz especializada en doblaje y directora de voces. Trabaja en comerciales de radio y TV, en la creación y caracterización y personajes para cine, TV, videojuegos, etc.\nEn Kiribati fue el nexo entre los directores Marcos y Alejandro y los actores para ayudarles a transmitir todas las emociones necesarias para cada escena la película.\n\nCon la participación de Natalia Rosminati (directora de voces), Alejandro Carlini (uno de los directores), Héctor Rojo (productor de animación) y Gabriel Caraballo (director técnico).\n\nMas info: **kiribatithemovie.com/blog/es/2016/07/espanol-kiribati-podcast-ep-19-natalia**\nDescargar MP3: **kiribatithemovie.com/podcast/Kiribati Podcast 19 - Natalia.mp3**\nEscuchar en Telegram: **telegram.me/Kiribati/54**\n\n![Kiribati Podcast 19 - Natalia](images/Portada19.jpg)\n\nMúsica: “AnCiedades” por Gerardo Colinas.\nLicencia del Podcast: CC (BY-NC-SA)"
		},
		{
			"post_id": 19,
			"title": "Kiribati Podcast Ep. #18 - Comercialización (Spanish)",
			"date_published": 1468027119.807,
			"body": "Marketing, Merchandising, Distribución, Comercialización ¿De qué se trata todo eso?\n\nMas info: **kiribatithemovie.com/blog/es/2016/07/espanol-kiribati-podcast-ep-18-comercializacion**\nDescargar MP3: **kiribatithemovie.com/podcast/Kiribati Podcast 18 - Comercializacion.mp3**\nEscuchar en Telegram: **telegram.me/Kiribati/51**\n\n![Kiribati Podcast 18 - Comercialización](images/Portada18.jpg)\n\n00:30 Holographic Hector\n01:30 Resumen semanal de Hector\n03:00 Resumen semanal de Alejandro\n04:40 Resumen semanal de Eibriel\n08:40 ¿Cuando lanzaríamos un Trailer?\n09:10 ¿En qué consiste nuestra campaña de Marketing?\n09:30 ¿Vamos a hacer Merchandising (objetos promocionales)?\n10:40 ¿Se estrenará en cines a lo largo de Latinoamérica?\n11:50 ¿Cómo se financia el lanzamiento y la distribución de la película?\n\nCon la participación de Alejandro Carlini (uno de los directores), Hector Rojo (productor de animación) y Gabriel Caraballo (director técnico).\n\nMúsica: “Inspiring Corporate” por “WorldMusic” CC (BY-NC-SA)\nLicencia del Podcast: CC (BY-NC-SA)"
		},
		{
			"post_id": 18,
			"title": "Kiribati Podcast Ep. #17 - RoadMovie (Spanish)",
			"date_published": 1468026915.619,
			"body": "¿De que trata Kiribati? ¿Qué hicimos en esta semana? ¿Querés conocer la respuesta? ¡Escuchanos!\n\nMas info: **kiribatithemovie.com/blog/es/2016/07/espanol-kiribati-podcast-ep-17-roadmovie**\nDescargar MP3: **kiribatithemovie.com/podcast/Kiribati Podcast 17 - RoadMovie.mp3**\nEscuchar en Telegram: **telegram.me/Kiribati/48**\n\n![Kiribati Podcast 17 - RoadMovie](images/Portada17.jpg)\n\n00:30 El Clima, The Blue Umbrella\n01:40 Resumen semanal de Hector\n05:50 Resumen semanal de Alejandro\n08:40 Resumen semanal de Eibriel\n13:00 La imagen de la camioneta ¿Pintura o Render?\n15:30 ¿De que trata la película Kiribati?\n\nCon la participación de Alejandro Carlini (uno de los directores), Hector Rojo (productor de animación) y Gabriel Caraballo (director técnico).\n\nMúsica: “Inspiring Corporate” por “WorldMusic” CC (BY-NC-SA)\nLicencia del Podcast: CC (BY-NC-SA)"
		},
		{
			"post_id": 17,
			"title": "Goodbye Person of Interest",
			"date_published": 1467719763.489,
			"body": "Today I finished watching **Person of Interest**, I will miss it, will remain in my memory as one of the bests alongside with Fringe.\n\n**You are being watched. The government has a secret system, a machine that spies on you every hour of every day. I know because I built it. I designed the machine to detect acts of terror but it sees everything. Violent crimes involving ordinary people, people like you. Crimes the government considered \"irrelevant.\" They wouldn't act, so I decided I would. But I needed a partner, someone with the skills to intervene. Hunted by the authorities, we work in secret. You'll never find us, but victim or perpetrator, if your number's up... we'll find YOU.**\n\nHere is one of the soundtracks I like most, \"Listening with a million ears\", I just learned that the composer is the same of Game of Thrones.\n**youtube.com/watch?v=Ksgw79s5vE0**"
		},
		{
			"post_id": 16,
			"title": "Kiribati Podcast #16 - Fotografía (Spanish)",
			"date_published": 1467024299.516,
			"body": "En el podcast de esta semana Giuliana Trucco nos invita a hablar acerca de la Fotografía en Kiribati y en las imágenes generadas por ordenador en general.\n\n**kiribatithemovie.com/blog/2016/06/espanol-kiribati-podcast-ep-16-fotografia/**\n\n![Kiribati Podcast 16 - Fotografía](images/Portada16.jpg)\n\n01:00 Giuliana se presenta\n01:30 Resumen semanal de Hector\n02:30 Resumen semanal de Alejandro\n03:50 Resumen semanal de Eibriel\n05:30 ¿Quién toma las decisiones acerca de la iluminación en Kiribati?\n07:20 ¿Tomamos referencias fotográficas a la hora de iluminar?\n09:30 ¿Tomamos referencias de fotos, maquetas o reconstrucciones en estudio?\n11:30 ¿Que diferencia hay entre una producción 3D estereoscópica y una 2D no-estereoscópica?\n14:10 ¿Cómo afecta el uso de efectos de lente al espectador y por qué se utiliza, siendo que no hay una cámara real o un lente real?\n17:00 ¿Qué elementos en común tiene la producción de una película de animación CG con el rodaje de una película de acción real?\n19:40 ¿Cómo observamos el panorama de la animación Argentina?\n24:30 ¿Qué falta producir de Kiribati y cuando estaría terminada?\n\nCon la participación de Alejandro Carlini (uno de los directores), Hector Rojo (productor de animación), Gabriel Caraballo (director técnico), y con la participación especial de Giuliana Trucco\n\nMúsica: \"Inspiring Corporate\" por \"WorldMusic\" CC (BY-NC-SA)\nLicencia del Podcast: CC (BY-NC-SA)"
		},
		{
			"post_id": 15,
			"title": "Stereoscopic lens effects",
			"date_published": 1466600820.655,
			"body": "Testing stereoscopic lens effects, not as easy as you may think.\nLens dust can be added normally, as a a texture, but lens flares must be on some point of the space, the same to lens brights and glows.\nFilm grain is another story altogether, must be volumetric, filling the entire space! (I didn't test it yet)\n\n![Stereoscopic lens effects](images/stereo_lens_effects.jpg)\n\nFull image:\n**mix.eibriel.com/attachment/21184** or **telegram.me/eibriels/156**"
		},
		{
			"post_id": 14,
			"title": "Kiribati Podcast #15 - Detalle (Spanish)",
			"date_published": 1466177002,
			"body": "\"Ahí está el detalle\" ¡En Kiribati, obviamente!\n\n**kiribatithemovie.com/blog/es/2016/06/espanol-kiribati-podcast-ep-15-detalle/**\n\n00:40 Resumen semanal de Hector\n01:20 Nivel de detalle en las escenografías\n02:35 Optimizacion del detalle\n05:40 Resumen semanal de Eibriel\n06:35 Conclusiones acerca del uso de Mumble y Youtube para el Podcast\n08:45 Texturizado de personajes\n11:10 Ideas Fijas y Kiribati en el Podcast de Blender Institute\n\nCon la participación de Hector Rojo (productor de animación) y Gabriel Caraballo (director técnico).\n\n![Kiribati Podcast 15 - Detalle](images/Portada15.jpg)"
		},
		{
			"post_id": 13,
			"title": "Sharing our tool for foliage lighting",
			"date_published": 1465840924.51,
			"body": "Following the open spirit to our Kiribatient community we want to share with you one tool we develop for internal use on Kiribati.\n\nIs an addon for Blender named **Translucency to Vertex Color** that allows to store and reuse information about how the light interact with the elements when passing through them.\n\nYou can donwload it from GitHub: **github.com/Eibriel/scripts/blob/master/blender/translucency2vertexcolor.py**\nDemo file: **telegram.me/eibriels/148**\n\n![Translucency to Vertex Color](images/translucency2vertexcolor.jpg)\n\nUsage:\n- Select one or more mesh object (with an active Vertex Color layer)\n- Select also (shift) any object to be the source of light\n- Press “Translucency to Vertex Color” button (and wait)\n- Change the parameters (may take a while to update)"
		},
		{
			"post_id": 12,
			"title": "Kiribati Podcast #14 - Elenco (Spanish)",
			"date_published": 1465585940.494,
			"body": "¡La espera valió la pena! Nuevo Podcast con sonido remasterizado\n\n**telegram.me/Kiribati/34**\n\n00:40 Resumen semanal de Hector\n02:00 Resumen semanal de Alejandro\n03:20 Resumen semanal de Eibriel\n04:50 ¿Quienes hacen las voces en Kiribati?\n08:00 ¿Vamos a Annecy 2016?\n09:00 Acerca de la calidad de audio de los Podcasts\n10:30 Acerca del estreno de Kiribati\n\nCon la participación de Alejandro Carlini (uno de los directores de Kiribati), Hector Rojo (productor de animación) y Gabriel Caraballo (director técnico).\n\nMúsica: \"Inspiring Corporate\" por \"WorldMusic\" CC(BY-NC-SA)\n\n![Podcast 14](images/Portada14.jpg)"
		},
		{
			"post_id": 11,
			"title": "Recording podcasts with Mumble",
			"date_published": 1465549609.133,
			"body": "Due to the terrible audio quality on Hangout for Kiribati Podcasts we are testing an Open Source, low-latency, high quality voice chat software, running our own server!\nMumble also allows the recording of the session on separated tracks, by user. Amazing!\n\nTo run the server using Docker\n```\ndocker run --name=mumble-server -d --net=host -v /path/to/config/mumble-server:/data -t coppit/mumble-server\n```\n(remember to make `/path/to/config/mumble-server` readable by docker)\nand then\n```\ndocker start mumble-server\n```\n\nYou will need to open the port `64738` on the server.\nYou can install the client using your favorite package manager.\nOn the client:\n- Go to **Server** menu, then **Connect**\n- Click **Add new...** button\n- On **Label** write your server name\n- On **Address** put your server IP\n- Write some **Username**\n- Click **Ok**\n- Select your server\n- Click on **Connect**\n\n![Mumble](images/mumble.jpg)\n"
		},
		{
			"post_id": 10,
			"title": "Kiribati Log Videos",
			"date_published": 1465181281.114,
			"body": "One of the advantages of using SVN is it allows to visualize the changes on video.\n**kiribatithemovie.com/blog/2016/06/kiribati-log-videos/**\nThis can be achieved using gource and ffmpeg or avconv.\n\n```\n#!/bin/bash\n\nsvn log -r 1:1000 -v --xml svn://svn.com/svn > svn-log.xml\n\ngource -a 1 -s 1 --key --hide root,filenames,progress \\\n    --bloom-intensity 0.2 \\\n    -i 0 \\\n    --camera-mode track \\\n    --padding 1.3 \\\n    --user-image-dir avatars \\\n    --default-user-image avatars/NN.png \\\n    -f -1280x720 \\\n    --multi-sampling \\\n    --no-vsync \\\n    --output-ppm-stream -\\\n    --output-framerate 60 \\\n    --log-format svn \\\n    svn-log.xml \\\n    | avconv -y -r 60 -f image2pipe -vcodec ppm -i - -vcodec libvpx -b 50000K gource.webm\n```"
		},
		{
			"post_id": 9,
			"title": "Audio to Video+Cover Converter",
			"date_published": 1465092023.815,
			"body": "For Kiribati I needed to convert some audio (the Podcasts) to video to upload on Youtube.\nRendering them on Blender took a lot of time, so I looked for some other solution.\nThe following script takes a picture and audio and generates a video.\n\n```\n!#/bin/bash\n\ncover=\"cover.png\"\naudio=\"audio.mp3\"\nvideo=\"video.mp4\"\nseconds=1156\n\navconv -loop 1 -i \"${cover}\" -c:v libx264 -t 1 -pix_fmt yuv420p -vf scale=1920:1080 cover_1_second.mp4\n\nfilesList=\"\"\nfor (( i=1; i<=$seconds; i++ ));do\n    filesList=\"$filesList -cat cover_1_second.mp4\"\ndone\n\nMP4Box $filesList -new cover.mp4\n\navconv -i cover.mp4 -i \"${audio}\" -c copy -map 0:0 -map 1:0 \"${video}\"\n```"
		},
		{
			"post_id": 8,
			"title": "Kiribati Podcast #13 - Current (Spanish)",
			"date_published": 1464972774.394,
			"body": "What is a Current Reel?\n\n**telegram.me/Kiribati/31**\n\n![Current Reel](images/current.jpg)"
		},
		{
			"post_id": 7,
			"title": "#TIP - Flickering",
			"date_published": 1464612493.891,
			"body": "Funny flickering on the background? Try reducing the difference between Start and End clipping on the camera!\n\n![Blender Camera Clipping](images/camera_clipping.jpg)"
		},
		{
			"post_id": 6,
			"title": "Kiribati Podcast #12 - Blender (Spanish)",
			"date_published": 1464364838.964,
			"body": "¡New Podcast! Eibriel and Héctor discussing the use of Blender on Kiribati 🔧\n\n**telegram.me/Kiribati/27**\n\n![Kiribati Podcast 12 - Blender](images/kiribati_podcast_12.jpg)"
		},
		{
			"post_id": 5,
			"title": "ReactOS",
			"date_published": 1464106343.842,
			"body": "Today I've installed ReactOS, an interesting project: is a Windows-Compatible free software operative system!\n\n![ReactOS](images/ReactOS.jpg)\n\nInstallation instructions:\nFrom: reactos.org/wiki/VirtualBox\n\n- Download the latest LiveCD release\n- Start VirtualBox.\n- Click the 'New' button.\n- Enter a name and set the type to Microsoft Windows. The version should be set to Windows 2003 (32bits). Click next.\n- Choose the amount of RAM you wish to allocate to the Virtual Machine. At least 64 MB is required, but 256 MB or more is recommended.\n- Add a Virtual Hard Drive, even if you wish to run from CD. A hard drive is required for booting the system. You can either make a new one, or choose an existing one. Click Create to create your new VM.\n- Select your new VM and click Settings.\n- Go to the 'Storage' tab and select the empty disk IDE controller.\n- Under Attributes, select your Live CD image and tick the 'Live CD/DVD' checkbox.\n- Press OK. You are now ready to boot ReactOS.\n\nOn language select \"English\", others may not work correctly.\n"
		},
		{
			"post_id": 4,
			"title": "Caminandes Gran Dillama",
			"date_published": 1464018019.186,
			"body": "\"Caminandes Gran Dillama\" shortfilm by the Blender Foundation\n\n[Magnet Link](magnet:?xt=urn:btih:41162c9f1ddfcd708b3c341fc571240a9b9e74ff&dn=Caminandes%20Gran%20Dillama%20-%20Blender%20Foundation%27s%20new%20Open%20Movie.mp4&tr=udp%3A%2F%2Fzer0day.ch%3A1337%2Fannounce&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969%2Fannounce&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969)\n\n![Caminandes Gran Dillama](images/caminandes_gran_dillama.jpg)"
		},
		{
			"post_id": 3,
			"title": "Caminandes - Open Movie",
			"date_published": 1463862666.248,
			"body": "First movie!\n\"Caminandes\" shortfilm by the Blender Foundation\n\n[Magnet Link](magnet:?xt=urn:btih:2e0b2c541cada29d3c2e6d0740b7c78e15961058&dn=Caminandes%20Ep.%201%20Llama%20Drama%20-%20Short%20Movie.mp4&tr=udp%3A%2F%2Fzer0day.ch%3A1337%2Fannounce&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969%2Fannounce&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969)\n\n![Caminandes](images/caminandes.jpg)\n\nEnjoy!!"
		},
		{
			"post_id": 2,
			"title": "Kiribati the Movie",
			"date_published": 1463760095.678,
			"body": "Kiribati is a animated feature film where I'm working on. Is bein made using Blender an other free (and privative :/) software.\n\nYou can find information (spanish) on the official Telegram channel:\n**telegram.me/Kiribati**\n\n![Kiribati](images/kiribati.jpg)"
		},
		{
			"post_id": 1,
			"title": "Welcome!",
			"date_published": 1433033779.604,
			"body": "\n# Hello World!\nMy blog about #Blender #FreeSoftware #Filmmaking #Movies\n## Social\n- Telegram Channel: **telegram.me/Eibriels**\n- Diaspora: **eibriel@diaspora.com.ar**\n- GNUSocial: **eibriel@mix.eibriel.com**"
		}
	]
}