{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"16_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 1,
				"body": "> [fant](#comment_71_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): А в Иране отключили внешний мир или вообще всю сеть внутри грохнули?Просто во втором случае уже ничего не поможет кроме мешей, если я что-то понимаю (возможно и не понимаю).\n\nв иране все сидят через спутник, и меши, хотя за это как бы должны наказывать...",
				"added": 1575043338
			},
			{
				"comment_id": 3,
				"body": "> [germes3344](#comment_1_1AqiyLeiKLbs2P32VKxcVB5o5QeaV6GKbc): Откуда инфа про спутники?\n\nя где то читал. Где уже не вспомню.",
				"added": 1575226806
			}
		],
		"1_1MR3MSi8wAjrMmZ795tYqbgaZ3dmbXGgh7": [
			{
				"comment_id": 2,
				"body": "> [refrodo](#comment_1_19WQZxnR4j2As8WHS1wbPhsWEt4whHZGdE): Вообще, если хочется чего-то необычного, то стоит посмотреть в сторону восточного кинематографа. Я сейчас назову довольно знаменитые представителей этого направления, но буду надеяться, что вам еще не довелось их глянуть. Начну с картин Акиры Куросавы, например, не слабо удивившая меня в свое время \"Тень воина\". Огромный масштаб и проработка декораций. Для меня это был первый самурайский боевик(если фильм можно отнести к этому жанру), что вкупе с выше сказанным дало очень необычный опыт.Но не стоит зацикливаться на японском кино, есть еще более непредсказуемая вещь - кинематограф южной Кореи. Вот тут точно кладезь гениев. Лично мне больше всего нравится Пак Чхан Ук. Я долго откладывал Олдбоя и зря. Отличная режиссура и необычный сюжет, это до сих пор заставляет меня иногда пересматривать этот фильм снова.Ну направление я задал, дальше все делается довольно легко, для начала можно пройтись по указанным режиссерам, а потом просто перейти на похожие фильмы. \n> А еще просто советую старые фильмы глянуть, довольно необычное ощущения. (например, Мост через реку Квай или 55 дней в Пекине)\n\nкорейцы вообще шедевры зачастую снимают. Просто их кинематограф как то недооценен.",
				"added": 1575043454
			}
		]
	},
	"comment_vote": {}
}