{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1545700918,
			"title": "I have failed to upload an mp4 to ZeroNet's YouTube :-(",
			"body": "I have clicked upload and chosen the file. I got no error message. I was able to edit the title and stuff but the video was not playable. It said that \"No video with the current MIME type found\". What could have gone wrong?",
			"added": 1545700917
		}
	],
	"topic_vote": {
		"1560138110_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": 1,
		"1591731867_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": 1,
		"1590898064_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": 1,
		"1627703143_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj": 1,
		"1628310919_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"1628149781_1AmXimBQuPemuoTM9NFYg9Mn5YY6HomhAm": 1,
		"1630096490_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1629750780_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1630381630_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj": 1,
		"1630441344_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"1630522157_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1630791791_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"1631033012_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"1603476273_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1631200414_1BFxHVXHTKcnWLWPVKbTknZTAaiHz6tgcV": 1,
		"1632037357_1BxrMQR2odvohNyH3mgZo1z9fkj4qbjHLq": 1,
		"1631986324_1BxrMQR2odvohNyH3mgZo1z9fkj4qbjHLq": 1,
		"1632251247_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"1634306647_1CN7STVMU29Rme1tgVRRPj3ZA3H7m99Rei": 1,
		"1637214620_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1
	},
	"next_comment_id": 59,
	"comment": {
		"1545519505_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq": [
			{
				"comment_id": 1,
				"body": "```\n    \"certs\": {\n      \"zeroid.bit\": {\n        \"auth_address\": \"12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq\", \n        \"auth_privatekey\": \"5JG8aTEv3N6akiF4JJ8A8cYzRPTv8ekyMj1e7v7U2Xv2QAWCVzi\", \n        \"auth_type\": \"web\", \n        \"auth_user_name\": \"anonymoose\", \n        \"cert_sign\": \"GxYxeMgJ3IXx6k527mBZUKuybmgaepbJZ6XPAkO57d6iKcoO7ZlTEyWNV8eL8kHfXZryuyB9WwSeKAJzc4MLnO4=\"\n      }\n    }, \n    \"master_seed\": \"b9306105cab09071d20a89e6cef5badf73472507d33d58359f43a327c314a4e3\",\n```",
				"added": 1545689651
			},
			{
				"comment_id": 2,
				"body": "Can't some \"blank\" users.json be created for these shared logins and write a simple script that randomly replaces the users.json from one of them every time the user starts ZeroNet?\n\n---\nYes --- that's the main problem with shared accounts.",
				"added": 1545698812
			},
			{
				"comment_id": 14,
				"body": "@1zgyqtcrf\n\n>Isn't it better and easier to create a new account for every visit?\n\nIt would be. Plus a standard username for it like `anon1545779883900` (\"anon\" + Date.now())\n\nBut, ZeroNet will create at least 2 files for each user --- so that solution is not workable at the moment. Also ZeroID has rate-limiting and blocks certain IPs.",
				"added": 1545780092
			},
			{
				"comment_id": 17,
				"body": "@squarezero Sadly no, only the first is shown as an option, I'll see how hard it is to fix it in the code to allow for that.",
				"added": 1547411393
			}
		],
		"1545700918_12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq": [
			{
				"comment_id": 3,
				"body": "I know almost nothing  about video encodings. I have simply downloaded it with `youtube-dl`. \nI include the mediainfo, but the main question is how to download or convert it having the right codec?\n```\n$ mediainfo How\\ to\\ install\\ ZeroNet\\ on\\ Linux-LCLFhCE91ec.mp4\nGeneral\nComplete name                            : How to install ZeroNet on Linux-LCLFhCE91ec.mp4\nFormat                                   : MPEG-4\nFormat profile                           : Base Media / Version 2\nCodec ID                                 : mp42 (isom/mp42)\nFile size                                : 8.70 MiB\nDuration                                 : 2 min 54 s\nOverall bit rate mode                    : Variable\nOverall bit rate                         : 418 kb/s\nEncoded date                             : UTC 2016-08-17 02:42:55\nTagged date                              : UTC 2016-08-17 02:42:55\ngsst                                     : 0\ngstd                                     : 174892\n\nVideo\nID                                       : 1\nFormat                                   : AVC\nFormat/Info                              : Advanced Video Codec\nFormat profile                           : Main@L3.1\nFormat settings                          : CABAC / 3 Ref Frames\nFormat settings, CABAC                   : Yes\nFormat settings, ReFrames                : 3 frames\nCodec ID                                 : avc1\nCodec ID/Info                            : Advanced Video Coding\nDuration                                 : 2 min 54 s\nBit rate                                 : 288 kb/s\nWidth                                    : 1 278 pixels\nHeight                                   : 720 pixels\nDisplay aspect ratio                     : 16:9\nFrame rate mode                          : Constant\nFrame rate                               : 30.000 FPS\nColor space                              : YUV\nChroma subsampling                       : 4:2:0\nBit depth                                : 8 bits\nScan type                                : Progressive\nBits/(Pixel*Frame)                       : 0.010\nStream size                              : 6.01 MiB (69%)\nTitle                                    : ISO Media file produced by Google Inc.\nEncoded date                             : UTC 2016-08-17 02:42:55\nTagged date                              : UTC 2016-08-17 02:42:55\n\nAudio\nID                                       : 2\nFormat                                   : AAC\nFormat/Info                              : Advanced Audio Codec\nFormat profile                           : LC\nCodec ID                                 : mp4a-40-2\nDuration                                 : 2 min 54 s\nBit rate mode                            : Variable\nBit rate                                 : 126 kb/s\nChannel(s)                               : 2 channels\nChannel positions                        : Front: L R\nSampling rate                            : 44.1 kHz\nFrame rate                               : 43.066 FPS (1024 SPF)\nCompression mode                         : Lossy\nStream size                              : 2.62 MiB (30%)\nTitle                                    : ISO Media file produced by Google Inc.\nEncoded date                             : UTC 2016-08-17 02:42:55\nTagged date                              : UTC 2016-08-17 02:42:55\n```",
				"added": 1545730064
			},
			{
				"comment_id": 4,
				"body": "> [leftside](#comment_467_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Your codec is OK for firefox tor-browser to play with.I uploaded it to here. Plz chk.(I downloaded the file with the exact same size and codecs with yours) [...]\n\nThanks for checking. You can erase the file now.\n \nThe problem was something different. It is still not working for me without manual interaction.\nI had to copy the .mp4 file to the appropriate folder by hand. \nNow it seems to work: http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1545742476_12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq",
				"added": 1545743298
			},
			{
				"comment_id": 5,
				"body": "> [kai0](#comment_797_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): i get your video on youtube, why you upload to 2 place?\n\nI thought if I upload it to more places it reach more people. \n\nI'm new here. I'm mainly experimenting to find out where it is easier to upload things. Both was pain in the ass. I had to intervene manually and copy the file to the appropriate place by hand. Can it be because I'm using Tor Browser?",
				"added": 1545747082
			},
			{
				"comment_id": 6,
				"body": "I definitely doing something wrong. Unfortunately, I have no idea what. I had similar issues at KopyKateBig. There it is even worse because even the manual copying doesn't made it available from other peers: https://0net.io/big.kopykate.bit/?Video=1545745607_12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq",
				"added": 1545747487
			},
			{
				"comment_id": 7,
				"body": "> [kai0](#comment_799_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): maybe no one seed it at kopykate\n\nBut I do seed it... \n\nAnyway,  something is definitely off I see my video box empty.",
				"added": 1545756733
			},
			{
				"comment_id": 8,
				"body": "Now it started working... It is still a mystery for me.",
				"added": 1545757060
			}
		],
		"1545615413_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 13,
				"body": "I have tried it using anonymouse [shared ID](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1545519505_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq). I had to be quite fast, but the [Post 1 on Device 1] was lost in both cases when I was fast enough to submit Post 2 comment before Post 1 already appeared on Device 2. \n\n[I have removed two \"failed\" attempts. Once I was too \"slow\" the Post 1 appeared before I was able to submit Post 2. The other time 0net.io proxy went offline during the experiment.]",
				"added": 1545758629
			}
		],
		"1545423165_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq": [
			{
				"comment_id": 15,
				"body": "@hexator\n\nYes, the more Sneakernet-support the better, an offline-only/ Sneakernet-only mode of ZeroNet would be nice. And ZeroNet exports are really useful to quickly sync with the ZeroNet network as well (though it should should be fixed at the protocol level!)\n\n>Cloud storage\n\nYou mean that you can simply give ZeroNet an URL and it'll use that to bootstrap to the ZeroNet network? If so, that's a good idea.\nThis could be an option in the `content.json` as well, so people can (optionally) use that to bootstrap the site, but I don't think it's a priority --- an intuitive (drag-and-drop)  import/export functionality will probably suffice.\n\n\n@polar2\n\nThanks, I'll add those to the \"ZeroNet improvements\" post later. \n\nIPv6 and DHT are on the TODO list of @nofish, I2P is equal in terms of security/anonimity properties as is Tor but still possibly beneficial for ZeroNet, and archiving would be a neat feature and can be done entirely on the client-side.",
				"added": 1546482442
			},
			{
				"comment_id": 16,
				"body": "These ideas can be abstracted in the source code as \"virtual peers\" so that the ZeroNet client handles the data on a \"cloud\" synchronized folder or static data on-disk (e.g, a ZIP file) the same way it handles data from peers.",
				"added": 1546483408
			}
		],
		"1547322502_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": [
			{
				"comment_id": 18,
				"body": "> [pexo](#comment_45_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): That is something that, for example, search engines will have to deal with\n\nTrue.",
				"added": 1547412644
			}
		],
		"1560138110_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": [
			{
				"comment_id": 19,
				"body": "> How long have you all been using zeronet?\n\nOn and off for years, I keep coming back intermittently because of a lack of a better alternative. I think ZeroNet has many problems which are still left unaddressed. It's the best we have but it can be much better.\n\n>Going to try and use it daily but there isn't much traffic\n\nOne of the major problems with ZeroNet as well. I think it's mostly due to lack of clearnet access to ZeroNet, proxies die too quickly for them to be used more often by people.\n\nI'll work a bit on the client, though the current codebase is a mess to be honest.",
				"added": 1560138331
			}
		],
		"1561879672_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": [
			{
				"comment_id": 20,
				"body": "> [whitewolf](#comment_24_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8): Racially, rapists are overwhelmingly non white.\n\nNot for long as they're hacking the statistics to include non-White people as White in the crime statistics, seriously.",
				"added": 1561901828
			}
		],
		"1591731867_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": [
			{
				"comment_id": 21,
				"body": "You could always opt to use this public ID in the meantime.",
				"added": 1591737071
			}
		],
		"1590898064_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": [
			{
				"comment_id": 22,
				"body": "It really is amazing to see so many people around the world unite and call for reform.",
				"added": 1591764619
			}
		],
		"1627703143_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj": [
			{
				"comment_id": 23,
				"body": "> [styromaniac](#comment_3169_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Would be nice if you provide the full package as patched. The install instructions will turn some people off.\n\nI know but I find it unsafe as a first approach to diffusion to prepare a precompiled package, especially in a delicate update which can be the tool (Tor) that provides anonymity to zeronet.\nhowever the small patch it is explained step by step, a precompiled package can be created by anybody.\n\n> [styromaniac](#comment_3170_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Does this patch disable Tor v2? I think it should.\n\nsupport for interaction with Onionv2 is maintained and has not been changed, the patched client will only generate OnionV3 addresses on its own",
				"added": 1627739783
			},
			{
				"comment_id": 24,
				"body": "> [styromaniac](#comment_3171_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I'll use it if it's pre-patched. Otherwise I might not.\n\nIt's ok if you don't have worries about potential backdoors from unknown people i will create a backdoored pre-patched for you and for whoever else wants it, the internet needs bots to be saved",
				"added": 1627743944
			},
			{
				"comment_id": 33,
				"body": "> [styromaniac](#comment_3179_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): @Anonymoose:, any plans to make a pull request?\n\nI would like to convert all Tor related code with the Stem library ( [clearnet_link](https://stem.torproject.org) / [onion_link](http://mf34jlghauz5pxjcmdymdqbe5pva4v24logeys446tdrgd5lpsrocmqd.onion) ) for a pull request.\nI would have liked to have an nofish opinion because I saw that he currently wanted to keep things separate with the StemPort plugin, and i wanted to understand why",
				"added": 1628893519
			},
			{
				"comment_id": 36,
				"body": "> [styromaniac](#comment_3225_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): @anonymoose:How do I install this patch on ZeroNet installed from source? Can you make a script for that?\n\nThe current script is usable for source code :\n```\ngit clone https://github.com/HelloZeroNet/ZeroNet.git\ncd ZeroNet\ngit clone https://git.disroot.org/anonymoose/ZeroNet_OnionV3.git\ncd ZeroNet_OnionV3\n./install.sh\n```\n---\nThe main difference is that via the git source you are already inside the /core folder compared to the ready package.",
				"added": 1629547435
			}
		],
		"1627760364_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 25,
				"body": "You can find the onion address of your tracker in http://127.0.0.1:43110/Stats\nunder Tor hidden services, the assigned address to \"global\".\nCopy that string and insert it inside this structure\n`zero://[global_onion_string].onion:[port]`\nport is generally 15441 but you can always check on http://127.0.0.1:43110/Stats (first row)\n\nyou get the address that can be added to the boostrap list.",
				"added": 1627763683
			},
			{
				"comment_id": 26,
				"body": "> [styromaniac](#comment_3174_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Does zero://my562dxpjropcd5hy3nd5pemsc4aavbiptci5amwxzbelmzgkkuxpvid.onion work for you? [...]\n\nthe creation of the hidden service is managed by zeronet there is no need to create them manually, the address of the tracker is what I have described, an example is \n`zero://tnjppdoc4famqa62mldlzc3fqw2wlsfxov7iz3pz5ex6umnqpaupflqd.onion:16227`\n\n( anyway no it doesn't work `zero://my562dxpjropcd5hy3nd5pemsc4aavbiptci5amwxzbelmzgkkuxpvid.onion:15441` )",
				"added": 1627774145
			},
			{
				"comment_id": 38,
				"body": "> [styromaniac](#comment_3187_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): The problem I keep having is that the onion address found in stats under Global changes on every ZeroNet restart with TOR enabled mode. That's why I was manually configuring the tracker with torrc, to keep the address static between ZeroNet restarts. @Anonymoose: Can you fix that?\n\nI'm just reading now, has there been any news? or have you not found a way?\n\nedit:\nI tried a quick setup and it seems to work ( request without successive errors ), I have to collect some logs to see if on the code side something is not managed since the address is managed outside ZeroNet.\nmy configuration on debian10 :\non `zeronet.conf` :\n```\n[global]\ntor = always\n```\n\non torrc `/etc/tor/torrc` :\n```\nSocksPort 9050\nControlPort 9051\nCookieAuthentication 1\n\nHiddenServiceDir /var/lib/tor/hidden_service/\nHiddenServicePort 15441 127.0.0.1:15441\n```\nafter restarting Tor get hidden service address on `/var/lib/tor/hidden_service/hostname` and build tracker address like `zero://[onion_string].onion:[port]` .\n\nThis hidden service will not be displayed inside `/Stats` under Tor hidden services.\n",
				"added": 1629553050
			}
		],
		"1628149781_1AmXimBQuPemuoTM9NFYg9Mn5YY6HomhAm": [
			{
				"comment_id": 27,
				"body": "Has Nofish spoken anywhere about his long absence?",
				"added": 1628766097
			},
			{
				"comment_id": 29,
				"body": "> [jackzeng6666](#comment_34_1AmXimBQuPemuoTM9NFYg9Mn5YY6HomhAm): No.\n\nWhat about other dev?\n\n> [styromaniac](#comment_3186_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): ZeroNet isn't, but for all we know, the creator could be. His lack of activity besides email is suspicious. \n\nNofish via email responds? His identity has been verified through pgp?",
				"added": 1628770332
			},
			{
				"comment_id": 30,
				"body": "> [gitcenter](#comment_1506_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I see a pattern here. People come, people see no activity, people leave. That's a long road to a critical mass.\n\nIs critical mass what determines what lives or dies?\n\n> [xanadu](#comment_20_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH): What I like is that ZeroNet distributes websites across nodes, but without new updates and futures it's just dies :(\n\nI don't totally agree, **there are many things that can be do and created** in this darknet and nofish has definitely given good insights.\nMore than talking about updates and functions I would talk about the dynamics that prevent it from becoming \"main stream\", but is it really a problem? \nIn a society where innovation is guided by extreme capitalism is it so strange that the concept of freedom in the internet and outside becomes ambiguous?\nIn my opinion no, for me it's ambiguous but i question myself and try to find answers even with realities like these.\nZeroNet is a tool for \"few\" at the moment, there are those who arrive and those who leave and those who return like me, I don't think it needs many numbers but rather conscious people who actively choose to contribute to something whose potential is perhaps still to be fully discovered.\nThere is an idea to spread but it isn't so easy to make it take root, better few but good, better a slow and variable growth than waves of fame that bring bored people who dont care to understand what it is.\nI think that as a darknet it can be defined dead when all peers cease to exist, and i also think that for how is resisting over the years we could die first than ZeroNet in these times.",
				"added": 1628860792
			}
		],
		"1628310919_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 28,
				"body": "it wouldn't be bad, considering that there are no active forks",
				"added": 1628767098
			}
		],
		"1628887588_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": [
			{
				"comment_id": 31,
				"body": "ZeroNet should be reachable from China using Tor + Bridge",
				"added": 1628888771
			},
			{
				"comment_id": 32,
				"body": "> [jackzeng6666](#comment_36_1AmXimBQuPemuoTM9NFYg9Mn5YY6HomhAm): No. I'am a china people, connect ZeroNet behind GFW, nothing wrong. The problem is china ISPs do not open external network port, and if you want to open, you need to pay a lot money (that is a very very very big number for most china users)\n\n> [jackzeng6666](#comment_37_1AmXimBQuPemuoTM9NFYg9Mn5YY6HomhAm): And another problem is, now almost all sites only have non-china peers, and almost all non-china ip is blocked.\n\nSo you never even use Tor to overcome this problems?\nHave Tor bridges all become obsolete and unusable?",
				"added": 1628889765
			},
			{
				"comment_id": 34,
				"body": "> [xcape2net](#comment_916_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): What port are you talking about?\n\nI think it refers to [opened port](http://127.0.0.1:43110/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/faq/#do-i-need-to-have-a-port-opened)",
				"added": 1628895856
			},
			{
				"comment_id": 35,
				"body": "> [xcape2net](#comment_918_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Maybe it is a problem with the routers supplied by Chinese ISP's?  I don't have an open port or port forwarding on my router for ZeroNet, but I have no problems with ZeroNet.\n\nI think it concerns the NAT managed by ISP/GFW, however as it's written in the FAQ it's optional.\nAnd if I'm not mistaken using Tor Hidden Services ( Tor : Always ) you have the same effect of the open port.",
				"added": 1628897324
			}
		],
		"1629431360_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 37,
				"body": "Couldn't it have been a Tor related problem? Have you tried several times?\n15441 is the default port but can be changed, so I think there should be no problem",
				"added": 1629550422
			}
		],
		"1630381630_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj": [
			{
				"comment_id": 39,
				"body": "I've update the trackers list in [ZeroNet_OnionV3 clearnet repo](https://git.disroot.org/anonymoose/ZeroNet_OnionV3) :\n`zero://jqxzybmqe2j2qbwhgbr4fkpf47mmu2tptvfi6o3zm3xuflktgzdrqbqd.onion:30591`\n`zero://k5w77dozo3hy5zualyhni6vrh73iwfkaofa64abbilwyhhd3wgenbjqd.onion:15441`\n`zero://2kcb2fqesyaevc4lntogupa4mkdssth2ypfwczd2ov5a3zo6ytwwbayd.onion:15441`\n`zero://my562dxpjropcd5hy3nd5pemsc4aavbiptci5amwxzbelmzgkkuxpvid.onion:15441`\n`zero://pn4q2zzt2pw4nk7yidxvsxmydko7dfibuzxdswi6gu6ninjpofvqs2id.onion:15441`\n`zero://6i54dd5th73oelv636ivix6sjnwfgk2qsltnyvswagwphub375t3xcad.onion:15441`\n`zero://wlxav3szbrdhest4j7dib2vgbrd7uj7u7rnuzg22cxbih7yxyg2hsmid.onion:15441`\n`zero://zy7wttvjtsijt5uwmlar4yguvjc2gppzbdj4v6bujng6xwjmkdg7uvqd.onion:15441`\n`zero://rlcjomszyitxpwv7kzopmqgzk3bdpsxeull4c3s6goszkk6h2sotfoad.onion:15441`\n`zero://tl74auz4tyqv4bieeclmyoe4uwtoc2dj7fdqv4nc4gl5j2bwg2r26bqd.onion:15441`",
				"added": 1630398891
			},
			{
				"comment_id": 40,
				"body": "> [styromaniac@kxoid.bit](#comment_50_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Also, your tracker still isn't working.\n\nYou can remove it is changed, now is permanent",
				"added": 1630480455
			}
		],
		"1630703227_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 41,
				"body": "> [transcoder](#comment_29_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH): but a lot of the python vulns and bugs really do need to be fixed\n\nIs it possible to make a vulns list based on priorities?",
				"added": 1630934620
			}
		],
		"1630944991_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 42,
				"body": "> [xcape2net](#comment_967_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): To me it seems that if we move to a fork, people will move to multiple forks, and essentially ZeroNet users will disperse into the ether of bitspace like a cloud of smoke.\n\nIsn't necessarily true, we can make multiple forks and work as a \"team\" to keep the core aligned, the substantial differences would be client-side not in the protocol.\nOf course this includes active collaboration, maybe the community can set guidelines to determine which forks can be considered valid or not for a \"core development team\".",
				"added": 1631087795
			}
		],
		"1631033012_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 43,
				"body": "Are you sure the step including \"File server external IP\" is necessary?\nI ask you this because it's the Tor daemon that manages the connections ( HiddenServices traffic comes from localhost to ZeroNet ) and without that setting the permanent trackers still seem to work properly.",
				"added": 1631090659
			},
			{
				"comment_id": 45,
				"body": "> [styromaniac@kxoid.bit](#comment_82_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Yes. I wouldn't know another way.\n\nI checked and what you said about \"File server external IP\" seems to serve to share the address as \"shared tracker\".",
				"added": 1631720997
			},
			{
				"comment_id": 46,
				"body": "> [ssdifnskdjfnsdjk](#comment_1109_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I have question regarding \"File server external IP\" and \"Trackers\" text area on /Config both should contain:zero://myv3onionhostname.onion:15441?\n\nNo, for Trackers text area :\n`zero://myv3onionhostname.onion:15441`\nfor File server external IP :\n`myv3onionhostname.onion`\n( without `zero://` and `:PORT` )\n\n> [ssdifnskdjfnsdjk](#comment_1109_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Question 2: how to verify that i did the setup well and how that it is not working?\n\nI'm looking for a pratical way, wait\n( the ideal would be to try the tracker with another client or to share it and have it tried by other users )",
				"added": 1631866589
			},
			{
				"comment_id": 58,
				"body": "> [styromaniac@kxoid.bit](#comment_275_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): zero://ow7in4ftwsix5klcbdfqvfqjvimqshbm2o75rhtpdnsderrcbx74wbad.onion:15441\n\nDone, thanks.",
				"added": 1637696892
			}
		],
		"1631606942_1CL3T1Xn3FtyyfhFhfjCiEiaVzhmQoYCmc": [
			{
				"comment_id": 44,
				"body": "> Is it correct that I can only make a blocklist for users or zites? So no individual files?\n\nYes, maybe it can be of interest to you\n- https://hybrid-analysis.com\n- https://github.com/PayloadSecurity/VxAPI\n- https://github.com/rshipp/awesome-malware-analysis#online-scanners-and-sandboxes\n- https://github.com/rshipp/awesome-malware-analysis#detection-and-classification ",
				"added": 1631627474
			}
		],
		"1631935740_1AmXimBQuPemuoTM9NFYg9Mn5YY6HomhAm": [
			{
				"comment_id": 47,
				"body": "I have some questions to try to understand the possibilities:\n- what operating system are you using?\n- what do you use to connect to Tor? ( daemon, Tor Browser or ? )\n- how did you active Tor Bridge and which one did you choose? ( obsf4, meek, snowflake or ? )\n- at startup ZeroNet tells you that it has successfully connected to the Tor Controller ?\n- what version of ZeroNet do you use? you can see it in [Stats](http://127.0.0.1:43110/Stats) first line first word (revXXXX)",
				"added": 1631962107
			}
		],
		"1631986324_1BxrMQR2odvohNyH3mgZo1z9fkj4qbjHLq": [
			{
				"comment_id": 48,
				"body": "> [styroonashitphon](#comment_3_1NceP4NFjHrUbHM7dLUxyLtXbTCrgmgRda): Are you using a script or are you adding these trackers manually?\n\nFor the moment manually, I will work on a script to automate\n\n> [styroonashitphon](#comment_5_1NceP4NFjHrUbHM7dLUxyLtXbTCrgmgRda): The first tracker on your list does not work. Please remove it.\n\nDone.",
				"added": 1632127160
			}
		],
		"1632251247_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 49,
				"body": "Nice",
				"added": 1632297393
			}
		],
		"1634240089_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 50,
				"body": "I could also do it (I was going to release it in my repo and eventually on Git Center the version of the final patch: remove inherent code v2, place correctly library and functions v3, create pack for any OS even if on windows and mac I recommend a GNU/Linux virtual machine) but I would like to clarify the situation nofish.\n\nIf he decided to leave the project indefinitely he should give way to leave it \"free\", from my point of view I think it's enough to explain on the site / github his inactivity and link forks that he considers valid.\nI know there are no active forks ones now, but would be willing to do this? \nWhat does it mean \"if pull request will be present at end of the month\" ?\nHe had said he would be back after late summer but I haven't seen anything, do you think it's not yet time to try to get ZeroNet to walk on his own without nofish?\n\nLast question, is the email exchange taking place using PGP? have you been able to verify the public key associated with him?",
				"added": 1634462752
			}
		],
		"1634431467_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 51,
				"body": "> [styromaniac@kxoid.bit](#comment_142_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Alright, so for some odd reason, v3_trackers only downloads to the proper diectory when I manually run Syncronite.sh, not when Syncronite.sh is run by crontab. Same goes for the cat command.\n\ncould it be a matter of permissions? try to set the same user you use when you run it manually on `sudo 20crontab 20-e.txt`:\n`*   *   *   *   * /home/styromaniac/ZeroNet/data/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/cache/1/Syncronite.sh`\nto\n`*   *   *   *   *  <replace_with_linux_user>  /home/styromaniac/ZeroNet/data/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/cache/1/Syncronite.sh`\nor maybe with sudo is better\n`*   *   *   *   * su <replace_with_linux_user> -c \"/home/styromaniac/ZeroNet/data/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/cache/1/Syncronite.sh\"`",
				"added": 1634464165
			}
		],
		"1634306647_1CN7STVMU29Rme1tgVRRPj3ZA3H7m99Rei": [
			{
				"comment_id": 52,
				"body": "> [halchair](#comment_3_1EBe7Vd6gbAUU4egHUGriHShgMtcx2oQKj): =.= [...]\n\nwhat needs to be done?",
				"added": 1634714310
			}
		],
		"1637305080_18DQw1RXP4gQcqPcYrxZEPzc55fXAv16eQ": [
			{
				"comment_id": 53,
				"body": "> [ibudder](#comment_2_18DQw1RXP4gQcqPcYrxZEPzc55fXAv16eQ): also what are those \"trackers\" in the upright corner, i have my tracker blocker on, those shouldnt exist, i have legit privacy concerns here\n\nhttps://wikiless.org/wiki/BitTorrent_tracker",
				"added": 1637310307
			}
		],
		"1637214620_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 54,
				"body": "I would like to contribute unfortunately with time I don't always have constancy, I know that this can bother.\nZeroNet is a project that ideally I like very much and I feel the need for the direction that the world is taking (has already taken for a long time) with the internet (control manias that as the only limit meet a volatile and manipulable moral).\nThat's why since I contributed the small patch I've been trying to carve out some time to study the code and increase my python skills.\n\nIn addition to a team fork that I'd like to be part of time permitting, I'd like to redefine with you (and question) the guidelines for shared and decentralized development, encourage individual users and teams to contribute by following guidelines established by the community.\nIn order to achieve this first I think we need a better documentation of the code with a dedicated wiki/docs (reason of my studies) , as well as define what to consider protocol and what to define client/server (maybe you have clearer ideas than me).\n\nAlso about the documentation that doesn't concern in a strict way the code it would be good to gather the information scattered among different Zites/sites and try to maintain a single(decentralized) and definitive Zite (I still have to understand if zerowiki or kiwipedia can be fully suitable (example it lacks search bar)).\n\nTell me what you think and if you have ideas that you have already shared or not.\n\nRegarding the above mentioned team I would have some requests about the organization.\nBring the main development on ZeroNet (repo, issues, pull requests etc on GitCenter), use the clearnet only as mirrors managed individually by the memebers of the team unlike on GitCenter where it should be created a shared user to multiple participants chosen.",
				"added": 1637317105
			},
			{
				"comment_id": 56,
				"body": "> [ssdifnskdjfnsdjk](#comment_1157_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): maybe you do not mean this, [...]\n\nI meant a wiki-style zite where anyone can contribute through a defined moderation (tending to self-management) through the zite itself",
				"added": 1637329507
			},
			{
				"comment_id": 57,
				"body": "> [6283822](#comment_135_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe): In decentnet project, I drafted a protocol that works in this way [...]\n\nDo you have something to link / show?",
				"added": 1637329663
			}
		],
		"1636910648_1N5YTyNeraRGksf76WNQiJ3ZB2ZMMa4pnf": [
			{
				"comment_id": 55,
				"body": "If you want private secure and remote access without exposing the client management on a public ip you can use Tor Darknet with Hidden Service V3 + Client Authorization (public open `-ui_ip '*'` not necessary).\n\nAssuming you have the tor daemon installed on your VPS, in your torrc (generally `/etc/tor/torrc`) you have to add an hidden service pointing to the standard ZeroNet port:\n\n```\n# path that handles HiddenService files\nHiddenServiceDir /var/lib/tor/ZNremote/\n# external port to internal localhost port\nHiddenServicePort 43110 127.0.0.1:43110\n```\n\nafter you can follow [this official guide](https://community.torproject.org/onion-services/advanced/client-auth)([.onion](http://xmrhfasfg5suueegrnc4gsgyi2tyclcy5oz7f5drnrodmdtob6t2ioyd.onion/onion-services/advanced/client-auth/index.html)) to create and configure authentication keys for V3.\n\nFinally it will be necessary Tor Browser to access it, after getting the V3 address inside `<HiddenServiceDir>/hostname` start ZeroNet with `-ui_host <address.onion>:43110` option and trying to navigate by entering in the TorBrowser `<address.onion>:43110` you will be asked for a key to access: the private key (`k1.prv.key`) of the posted guide.\n\nIt may cause some graphic warning but i have always been able to use it normally without problems.",
				"added": 1637321664
			}
		]
	},
	"comment_vote": {
		"21_12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq": 1,
		"79_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": 1,
		"69_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"557_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"2323_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"13_13gz7jEayVZjubcAGS16kR3Ze4RJSgVFVw": 1,
		"76_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": 1,
		"3_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj": 1,
		"3214_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2_1EnZKsRjKM4LueXwqweDn4fx4AYaBUk35L": 1,
		"95_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": 1
	}
}