{
	"title": "France actus..",
	"description": "La vie en France d'un travailleur  smicard...",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 9,
	"demo": false,
	"modified": 1486672337,
	"post": [
		{
			"post_id": 8,
			"title": "Zerosite de Trisquel",
			"date_published": 1486672275.682,
			"body": "Voici le site Zeronet de Trisquel, fameuse distribution Linux Française ;)\n\nhttp://127.0.0.1:43110/1Jtjb5CU9aod4jtz8hF5NPPqFKofRSsb4x/?Page:zerotuto-fr\n\n"
		},
		{
			"post_id": 7,
			"title": "Meilleurs voeux",
			"date_published": 1484088154.907,
			"body": "Bonne année et meilleurs voeux pour cette nouvelle année 2017. \n\nJ'espère que les fêtes se sont bien passées! \n\nJe vous dis à bientôt pour un nouvel article sur ZN.\n"
		},
		{
			"post_id": 6,
			"title": "Partage de culture numérique",
			"date_published": 1480588749.143,
			"body": "Puisque je vous parlais de libertés dans l'article précédent... Le très célèbre site \"zone-telechargement.com\" a été fermé lundi 28 novembre 2016... mais il a rouvert le lendemain. Le site de protection de liens affilié \"DL protect\" est, quant à lui, toujours indisponible.\n Le site Français était une référence pour télécharger les derniers contenus multimédias de toutes sortes. Je ne me cache pas, je télécharge pleins de choses parce que c'est gratuit. Quand je vois combien je paie de redevance TV pour les merdes qui passent, je n'ai pas de scrupules. Aussi, j'achète de temps en temps des contenus que j'ai regardé ou écoutés précédemment. \nEn se renseignant un peu, on voit que le piratage (car oui, au fond c'est du piratage en quelque sorte) n'a aucun impact sur les marchés de contenus. En France, les cinémas n'ont jamais autant fait d'entrées, les prix de CD audios n'ont pas baissé en 20 ans...\nLes trusts américains qui font des procès dans tous les pays ne respectent pas les lois des autres états. Le plus célèbre exemple c'est celui de Piratebay. Ils menacent ainsi d'embargo tous les pays et ces derniers la bouclent. \nDonc voilà où nous en sommes aujourd'hui, on essaie de museler des sites comme ZT mais les sites qui prônent la haine raciale et l'art de la guerre ne sont pas fermés. (un sujet comparable: le rap)\nOn voit quelles sont les priorités de gouvernement Français."
		},
		{
			"post_id": 5,
			"title": "Parlons liberté d'expression",
			"date_published": 1479683475.333,
			"body": "Bonjour, on va discuter de ça aujourd'hui.. On peut voir que dans plusieurs domaines, depuis environ 5ans, des gens sont réduits au silence par certains gouvernements parce qu'ils exposent leurs idées devant les merdias...Du coup, les dirigeants les font taire (ou essaient de les tuer). Pour des exemples Français, on peut citer Dieudonné! Le gouvernement a montré son impuissance pendant des jours et des jours lol, en ayant bien du mal à faire interdire les spectacles. Sinon, on a un chanteur bien connu, Grand Corps Malade, qui est passé à la trappe parce qu'il critiquait de manière très franche le gouvernement Français...\n\nDans un autre style, il ya bien évidemment les lanceurs d'alerte... On voit bien que les dirigeants ou autres personnes politiques essaient de les tuer (voir emails de Hillary Clinton sur le cas de Julian Assange). Mais il y'a aussi Bradley Manning et bien sûr Edward Snowden. La demande de pardon est sur le devant de la scène mais ne semble entendue par personne. De plus, je trouve que la France, qui est soi-disant la patrie de Droits de l'Homme, pourrait justement héberger des personnes commes celles-ci. Mais bon, les Etats-Unis ont le bras long.. (Le cas de Pirate Bay est un bon exemple de ce qu'ils sont capables de faire..)\n\nSans faire dans le social, les gens qui parlent trop risquent à un moment ou à un autre de se faire éliminer sans que cela ne puisse choquer quiconque. Donc, quand on voit des projets comme Wikileaks ou le Torproject ou encore Freedom Press, je trouve essentiel de donner un peu de son argent ou alors de son temps. \n\nSur ce, je vous laisse, j'ai des traces à effacer :D"
		},
		{
			"post_id": 4,
			"title": "Parlons Santé",
			"date_published": 1476225609.296,
			"body": "Octobre 2016: Ouverture de salles de \"shoot\". C'est lamentable dans un pays comme le nôtre. Les camés vont pouvoir débarquer avec leur marchandise, se faire les piquouzes tranquillement... Ca va aussi devenir un lieu d'échange et de règlement de comptes ^^ . La sécu va payer avec notre pognon pour des gens qui ne travaillent certainement pas mais qui s'en mettent plein les fouilles entre les aides sociales et le deal. \nEncore un truc incohérent de ce gouvernement de merde. On va droit dans le mur... "
		},
		{
			"post_id": 3,
			"title": "Parlons politique",
			"date_published": 1476176528.895,
			"body": "Dans un peu plus de 6 mois, il y'aura les élections présidentielles en France. Quels pitoyables débats entre la plupart des partis politiques, qui n'en ont rien à foutre du peuple. Ils se tutoient en privé, mangent ensemble mais devant les caméras de chaînes de TV, ils se vouvoient, se lancent presque des insultes et donc se critiquent. On ne parle pas du public, trié sur le volet, dont les questions sont connues à l'avance par les guignols politiques ici présents. \nL'audience baisse, les jeunes ne veulent plus voter et se sentent abandonné(e)s. Les anciens, quant à eux, se foutent de ce qui va arriver mais iront sans doute voter l'an prochain parce qu'ils ont vu que le Flamby les a véritablement plumés... Payer des impôts sur une retraite, c'est scandaleux. Quel enculé!!\n\nBref pendant 6 mois et quelque, on a pas fini d'entendre parler de ces connards qui, pour une des seules fois de leur vie, vont à la rencontre des riverains (mais bien entourés attention, et pas n'importe où).\n\nL'éléctorat changera d'avis au dernier moment, concernant son orientation politique, entendant un autre abruti parler de retraite à 60 ans..comme en 2012.\nOu un autre dire, les impôts vont très fortement baisser, le pouvoir d'achat remontera, on produira Français ...\n\n"
		},
		{
			"post_id": 2,
			"title": "Parlons argent",
			"date_published": 1469579974.961,
			"body": "Voilà, je suis donc au smic, je fais 39 heures par semaine en 4 jours et demis, je fais ma petite vie... J'habite dans une commune qui se fait payer par le gouvernement pour héberger des cas soc' (pas encore de migrants mais ça va sans doute venir!)... Ces connards qui ne branlent rien, pondent des mioches parce que ça rapporte, ne les élèvent pas... Et pourtant un couple avec 4 gosses, il touche 2500€ par mois! Avec ça, tout est gratos, il ne paie rien! Le loyer est payé par la CAF (caisse d'allocations familiales), les factures sont payées par la mairie. La cantine et les voyages organisés de l'école sont pris en charge par le système éducatif.. Les enfants partent en vacances, tout est payé par la CAF. Tous les 3 mois, la CAF versent d'autres aides...prime de rentrée scolaire (qui permet d'acheter la dernière télé que je ne peux pas me payer), prime de Noël (même pour les musulmans ça marche! le paradoxe!!) et encore pleins d'autres choses.. \nPire! La personne qui touche le Pôle Emploi ou le RSA et qui va en prison, elle continue de percevoir tout ça, alors qu'elle est nourrie, logée, blanchie..On se croirait au Monopoly! \nParlons des mômes: Les parents ne s'en occupent pas et on leur place les gosses en foyer: et bien les parents continuent de toucher la CAF! Elle est pas belle la vie!\n\nMaintenant, parlons de moi: Je travaille pour une banque bien connue en France, je gagne le smic depuis 10 ans, je n'évolue pas parce que je refuse de rentrer dans le moule de glandus...mais je réalise toujours mes objectifs, toujours à plus de 100 %. Les primes que je gagne partent dans mes impôts.. ou me servent à faire réparer ma voiture. J'ai acheté une maison, à crédit il y'a quelques années mais faute d'argent (une séparation), j'ai toujours un crédit sur le dos... Je loue un appart en ce moment donc j'ai un loyer, je fais 90 kms par jour pour aller travailler, j'ai un crédit pour la voiture. Les factures et les assurances tombien chanque mois..\nJe n'achète rien, je ne sors pas, je fais le minimum de courses... C'est le stress économique permanent quoi!\nJ'essaie de faire du black à côté mais vu que je suis solvable, si je me fais choper...aie! \nJ'ai donc acheté une voiture (d'occaz') à un proche et elle fait 11 chevaux fiscaux... Quand je déclare mes frais réels en fin d'année, et bien je pleure... déjà, la limite est de 40kms (aller, bien sûr) et la puissance fiscale de la voiture est limitée à 7 chevaux (depuis Hollande).\nDonc pour éviter les contrôles du FISC, je ne déclare que 39kms et jusqu'à présent ça marche :D (enfin une bonne nouvelle!mdr)\nMais des fois, je dois faire un crédit, genre Sofinco, pour payer mes impôts et ça va arriver de plus en plus puisqu'ils vont continuer d'augmenter (Merci Hollande ou Flamby ou granulé (gras, nul, laid))\n"
		},
		{
			"post_id": 1,
			"title": "LA FRANCE",
			"date_published": null,
			"body": "Bienvenue en France, ce pays où tout le monde peut entrer librement, manifester, se faire soigner gratuitement, tuer des gens (tout en étant apparemment suivi par des services anti-terroristes...)\n\nMoi le travailleur de base, qui suis né dans ce beau pays, je suis dégoûté de tout ça... Je paie des impôts, je paie des factures, j'ai une voiture qui me permet d'aller au travail et que je dois réparer, j'ai l'impression que l'Etat m'enterre...\n\nJe vois ma culture Française  entrain de disparaître et laisser pour morte par mon gouvernement... qui fait tout pour les autres religions et communautés.\n\nCe pays s'enfonce tous les jours un peu plus dans la pauvreté (du travail), le chômage, la dépression des travailleurs, la haine des autres religions...\n\nJamais un gouvernement comme celui qui est en place aujourd'hui en France n'a été aussi exécrable, anti-Français, anti-chrétien, anti-démocratique... Les ministres ne changent pas vraiment, ils sont justes mélangés / reclassés... D'ailleurs, parmi ces incompétent(e)s notoires, beaucoup sont dans le monde politiques depuis de nombreuses années et sont mêlés à des scandales sexuels ou financiers... Ils ont des phobies pécuniaires...\n\nJe vous explique dans un prochain article le quotidien d'un travailleur Français qui vit en France et qui défend la France.\n\n\n\n\n\n\n"
		}
	]
}