{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"4_1MEWJRMLgvofqG9Mbsb2Rc4hFFyv7HeRx7": [
			{
				"comment_id": 1,
				"body": "Le nechmark, c'est pour connaitre ta capacité de réponse sur le P2P. Bref, la capacité des inter connexions entre les ports machine, réseau interne, externe. Plus c'est rapide, plus ta capacité à interagir rapidement avec le réseau est importante: chat par exemple, ou un transaction.\nJ'ai installé zeronet sur mon serveur avec un Xeon de 2007 > résultat 11.95s\nContrairement à ce qu'on pourrait croire, c'est pas aussi mauvais si on prends en compte tous les services que le serveur doit gérer (bittorrent, tor, web, cloud, syncthing, etc...) qui mangent pas ma de réseau.",
				"added": 1458399116
			}
		],
		"1_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w": [
			{
				"comment_id": 2,
				"body": "intéressant.\npas très sérieux si le réseau Tor est en fonction.\nDonc, conclusions : soit utiliser Tro Browser, soit se mettre en proxy direct avec Tor.\n\nC'est pas très pratique...\nFaut voir ça avec les DEVs.",
				"added": 1458674512
			}
		],
		"2_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w": [
			{
				"comment_id": 3,
				"body": "si, ça marche, mais c'est nécessairement vide.\nmais 1 ou 2 topics, ce sera mieux.",
				"added": 1458825083
			},
			{
				"comment_id": 4,
				"body": "Bon, il n'y pas moyen de créer de topic, mais c'est un début",
				"added": 1458825514
			}
		],
		"1_18ZfPCaU1pYAeos3A7YhZVgtsmXqXeRRW7": [
			{
				"comment_id": 5,
				"body": "Tu devrais peut être entrer directement en contact avec le DEV ou poster sur le talk global. Hélas, trad en anglais obligatoire.\nTu as noté que syncthing avait un tracker central, mais tu oublies que tu peux créer ton propre tracker avec.discoserv.\nPeut être un concept à adapter à 0net.",
				"added": 1459693020
			},
			{
				"comment_id": 6,
				"body": "C'est à peu près ce qu j'allais dire....\nDonc inutile de s'emporter même si on peut trouver l'idée agaçante.\n\nD'un autre côté, la contribution au libre ou l'open n'est pas nécessairement du code: critiques, idées, discussions avec les devs ou participation pour du simple debugage, c'est ça aussi contribuer.\nSi je ne suis pas un codeur, ça ne ma pas empêché de contribuer au kernel linux pour des modifications, ajouts de drivers, j'ai juste pris contacte avec les devs dediés, ils m'ont dit ce que je devais faire de mon côté, conclusion du hardware qui fonctionne. Du coup ton initiative est bonne et t'as contribué. T'es content, t'as apporté ton domino à l'édifice.\n\nVoilà, pas la peine de sennérver, et comme l'a dit son1002: c'est tout jeune et n'attend que les retours d'expériences pour aller plus loin.\n\nl'Interopérabilité avec d'autre système d'ID viendra, pour le moment zeroid est ce qu'il faut, mais je pense que comme pour le tracker, il finira par se développer en principe décentralisé comme pour le reste de zeronet.\n\nnote: malgré son tracker \"out of the box\" j'adore syncthing. Ça me fait du backup du feu  de dieu et me permet de faire de l’échange de fichier les deux mains dans les poches.\nJe n'ai pas encore rétabli mon tracker depuis que le code a changé, mais tôt ou tard je m'y recollerai, c'est bien trop pratique.\nEt en effet, tout ceci n'est pas par défaut, ce qui est dommage. de toute manière pour le moment je vois mal Mme Michu s'exalter devant 0net et encore moins syncthing.",
				"added": 1460125189
			}
		]
	},
	"comment_vote": {
		"2_1BUg3Eu6SdBrVKNtVJJgQptFas5XCYqEUF": 1
	}
}