{
	"title": "点击这里。",
	"description": "让你点，你就点。",
	"links": "*   [Source code](https://github.com/HelloZeroNet)\n*   [leaflet的小屋](http://127.0.0.1:43110/leafok.bit/)\n*   [时间的朋友](http://127.0.0.1:43110/1497zHCGLWLb9SLGWd71ja2ZnysfzXeQrV/?Post:9:%E6%97%B6%E9%97%B4%E7%9A%84%E6%9C%8B%E5%8F%8B)",
	"next_post_id": 13,
	"demo": false,
	"modified": 1512228467,
	"post": [
		{
			"post_id": 12,
			"title": "时间记录方式调整——11月时间记录总结",
			"date_published": 1512228426.301,
			"body": "## 11月份时间记录汇总\n\n> 11月总时长为：484.25小时\n> 计时：387.83小时； 时间占比：80.1%；\n\n时间分布如下：\n\n> 工作：92.00小时； 时间占比：19.0%；\n> 阅读：61.17小时； 时间占比：12.6%；\n> 学习：2.50小时； 时间占比：0.5%；\n> 写作：6.50小时； 时间占比：1.3%；\n> 交际：30.17小时； 时间占比：6.2%；\n> 生活：41.83小时； 时间占比：8.6%；\n> 娱乐：137.00小时； 时间占比：28.3%；\n> 其他：16.00小时； 时间占比：3.3%；\n\n休息时间：\n\n> 休息：235.75小时； 时间占比：48.7%；\n> 每天的休息时长约为：7.60小时。\n\n### 11月时间记录分析\n\n工作：小生意暂停了，行情不太好，不到一个月货源价格上涨了70%。继续做下去倒不是没有盈利的可能，主要是毛利太低了，短期内盈利能力很弱，长期看，这也不是一门好生意。我和合作伙伴没有承担风险的能力。在这期间，我很清楚有许多地方做的不到位，但是现在缺乏改进的动力。最重要一个原因，我并不喜欢这个产品和他的销售方式，我也不喜欢做销售工作。这里给我的合作伙伴说声抱歉。11月底开始上班，还是老本行。其次，现在还在给朋友的公司做兼职。总体感觉还算良好吧。做自己擅长的事情，最好是擅长的而有喜欢的事情。\n\n阅读：《文心》，叶圣陶，夏丏尊，主要是讲写作和阅读技巧的，这本书的最初写作目的是给中学生和他们的老师阅读的，但是让写作课受教育不完整的我读来，仍然是受益匪浅。《红楼梦》，高中时候就开始读的书，一直没有动力读下去，现在重新开始读了起来。《稀缺——我们是如何陷入忙碌和贫穷的》，一本讲述心智带宽的书。年初制定的25本书，到目前为止总共才读完了11本。其中包括3本英文原版书的计划，英文原著一本都没有读完。\n\n学习：看了一点 javascript ，主要是工作需要。\n\n写作：11月写了两篇文章，但是都没有在公众号上发布，工作稳定下来以后，应该是有更多的时间写作和看书的吧。希望如此。\n\n生活：不开心。不告诉你为什么。\n\n娱乐：花了137个小时，看了三部电视剧：《射雕英雄传》胡歌版，《神雕侠侣》陈妍希版，金庸的武侠当然很好看，由于不断的翻拍，很多版本以前都没有看过。《猎场》胡歌主演，很好的电视剧，演员的演技和故事情节，都没有陷入俗套，耳目一新的感觉。我觉得这部电视剧和金庸的武侠剧特别的像，尤其是《神雕侠侣》，郑秋冬就像是杨过。此外么，还有动漫《一人之下》。\n\n## 时间记录方式调整\n\n时间记录的一些反思：\n\n每天记录时间开支所需要的时间大约10分钟左右。如果加上写总结，优化时间记录的细节，合计起来，每月花在时间记录上的时间10多个小时。某种意义上来说，我可能太过注意形式了吧。\n\n我觉得应该减少花费在工具上的时间，工具是为了完成目标。如果工具成了目标的累赘，那就没有必要使用工具了。基于这个想法，我打算做一些调整。想法还不是很成熟，但是12月测试一个月后，会逐渐完善起来。\n\n我想，如果工具本身就是一个需要完成的目标……那岂不是完美了？\n\n时间记录的调整主要包括以下几个方面：\n\n1\\. “增加时间规划”的部分。目前还没有具体的方案出来，时间规划会以周为时间单位，这个可能会结合 To Do 工具来做，完成就打对勾。\n2\\. 时间总结会“增加周”的部分，一周一个简单总结，以 Markdown 格式记录在有道云笔记里。\n3\\. 部分内容使用英语标记：使用的关键词、结构比较固定的语句类型。（12月开始，所有标签手工重写，目前已经做完了标签词的英汉对照表）\n4\\. 给完成的事情的重要性打分。目的是评估这些时间是否花的值。\n\n“时间规划”会侧于具体事件的完成度，和质量评估。\n\n据说，Smartisan Os 的新版闪念胶囊（ Idea pills ）将会更好的支持 To Do （待办事项），希望这能成为我高效而重要的工具之一。最近我已经开始尝试使用闪念胶囊记录自己的灵感了，特别是对自己想写的文章。\n\n接下来，除了记录时间开支以外，我还想记账，这也是一个重要的数据。当然了，财务数据的汇总我是不会公开的了。\n\n有些事情是必须长期坚持做才能获得它带来的好处的，时间记录就是这样。对你而言，最重要的是要始终相信，这好处，总有一天会到来。\n\n这个月的总结就这么多吧。"
		},
		{
			"post_id": 11,
			"title": "为什么生活要有规律？——10月时间记录总结",
			"date_published": 1509803119.798,
			"body": "### 10月份时间记录汇总\n\n> 10月总时长为：493.67小时\n> 计时：414.33小时； 时间占比：83.9%；\n\n时间分布如下：\n\n> 工作：91.33小时； 时间占比：18.5%；\n> 阅读：91.50小时； 时间占比：18.5%；\n> 学习：0.00小时； 时间占比：0.0%；\n> 写作：13.00小时； 时间占比：2.6%；\n> 交际：8.33小时； 时间占比：1.7%；\n> 生活：41.83小时； 时间占比：8.5%；\n> 娱乐：138.00小时； 时间占比：28.0%；\n> 其他：29.50小时； 时间占比：6.0%；\n\n休息时间：\n\n> 休息：250.33小时； 时间占比：50.7%；\n> 每天的休息时长约为：8.08小时。\n\n## 时间分析\n\n工作：在工作上花费的时间少之又少。比以前上班的时候下降了一大半。所以么，业绩差的要命。当然，国庆节放假也算是原因之一。其实还是因为懒。给自己找了一份兼职，11月开始，帮朋友的公司处理 IT 相关的工作。\n\n阅读：读完了《鹿鼎记》。终于把金庸的小说读完了。另一本是《好好说话》。接下来要读《稀缺》，《价格游戏》，《红楼梦》。每天都微信公众号文章花了很多的时间，以后会把这些时间用在读书上。\n\n学习：还是个 0 。学点什么呢？\n\n写作：写了两篇文章。当然还有一些文案，都是工作需要，没有计算在内。\n\n交际：一如平常。就是有几个朋友结婚了。\n\n生活：大姑父生病了，看望了几次，回了两次老家。\n\n娱乐：计算完时间，我都被吓到了。居然花了138个小时。占比 28% 的时间。来看看我都干了啥：电影《黑客帝国》3部。《指环王》3部。电视剧《神探狄仁杰》第三部，共48集。还有好几部周星驰的电影。此外还有高晓松的《晓说》，罗永浩的演讲视频和发布会。此外还玩儿了游戏“魂斗罗”，那段时间每天都会晚上一个多小时。不过，10月20号已经卸载了。讲真，游戏真无聊，还是玩不下去。11月必须减少这部分的时间开销。\n\n其他：应该算是学了一个小技能 ZeroNet 这是一个类似于比特币的去中心化的网络。还是蛮好玩儿的。以后我的文章，都会在那里发布一次。这个永不消逝的网站是不能直接访问的。需要下载一个工具。 可以在这里下载： [https://www.zeronet.io/](https://www.zeronet.io/) 。遗憾的是这个网站国内也不能直接打开，需要 VPN 。我把我的ZeroNet 网址贴在这里：[http://127.0.0.1:43110/1497zHCGLWLb9SLGWd71ja2ZnysfzXeQrV](http://127.0.0.1:43110/1497zHCGLWLb9SLGWd71ja2ZnysfzXeQrV) 希望有一天你可以自由的访问它。\n\n休息：每天的睡眠时间可以达到8小时，这是没敢想过的。说到睡眠时间，和我的一个朋友相比，我算是每天就打一个盹，他可以每天可以随随便便的睡上10个小时，还睡不醒……\n\n## 为什么生活要有规律？\n\n我的生活就很不规律。以前觉得自己可真不得了，每天7个小时的睡眠足以，直到发现自己的头发越来越少了……\n\n生活本应该有其规律的，因为我们所身处的世界，本身就有自己运转的规律。\n\n今年的诺贝尔生理学奖或医学奖，就是授予了在“控制昼夜节律的分子机制。”上的有重大发现的三位科学家。他们发现，生物体的很多基因都受“生物钟”现象的节制。很多的疾病都呈现出了与“生物钟”现象的相关性。\n\n10月份，大姑父发病住院，我去看望。然后顺便去皮肤科让医生给我看了看我的脱发怎么治。\n\n医生用棉签小心翼翼的我在头上蹭了两下，问道：平时工作忙不？是不是经常熬夜？头皮是不是容易发痒，出油？小伙子你这是脂溢性脱发。\n\n我说：是的，工作挺忙，还经常熬夜。我这遗传的，我爸也脱发，很严重。\n\n医生嘿嘿一声轻笑，解释道：你这很常见，现在你们这些年轻人呀，经常熬夜，不注意休息，生活不规律，年纪轻轻就脱发的很多，20出头的小孩儿，都脱发脱得不像样子。这也没什么好办法，我先给你开一个疗程的要吃着，在看情况。平时呢，要注意多休息，少熬夜，少吃些有甜食，油腻，辛辣，最好别喝酒。还有，洗头不要那么勤快，一周两次就可以了，平时难受的话，可以用清水冲一下，不要用洗发水。\n\n我天！我就是控制不住熬夜，喜欢吃甜食。平时每天洗头，有时候还洗两次。尼玛，说的全对……\n\n除了休息，还有一个规律就是饮食。很多人应该也和我一样，每天吃两顿饭。早上因为不想起早，早饭当然是能省则省了。这都不算啥，有一段时间，因为晚上熬夜，我通常是第二天下午才起床的，连中午饭都省了。后来就各种身体不舒服，整体昏昏沉沉无精打采，还总是胃不舒服。\n\n有时候想想，在一些事情上，总觉得自己很牛逼，这样不好。\n\n王小波在《黄金时代》里写道：\n\n> 那一天我二十一岁，在我一生的黄金时代。我有好多奢望。我想爱，想吃，还想在一瞬间变成天上半明半暗的云。后来我才知道，生活就是个缓慢受锤的过程，人一天天老下去，奢望也一天天消失，最后变得像挨了锤的牛一样。可是我过二十一岁生日时没有预见到这一点。我觉得自己会永远生猛下去，什么也锤不了我。\n\n现在体会到，有规律的生活节奏，是对生命的敬畏。\n\n十一月份，当然是坚持每天能够睡八个小时。每天至少吃两顿饭。按照医嘱，饮食休息。把头发养起来。\n\n其实这几天朋友们都说，你的头发貌似好了一点儿。\n\n这可能是感动上苍了吧！\n\n愿你敬畏生命！"
		},
		{
			"post_id": 10,
			"title": "碌碌无为是因为焦虑——8月时间记录总结",
			"date_published": 1509257917.974,
			"body": "### 8月份时间记录汇总\n\n> 8月总时长为：505.75小时\n> 计时：377.75小时； 时间占比：74.7%；\n\n时间分布如下：\n\n> 工作：141.83小时； 时间占比：28.0%；\n> 阅读：63.75小时； 时间占比：12.6%；\n> 学习：0.00小时 时间占比：0.0%；\n> 写作：19.67小时； 时间占比：3.9%；\n> 交际：40.67小时； 时间占比：8.0%；\n> 生活：9.92小时； 时间占比：2.0%；\n> 娱乐：77.83小时； 时间占比：15.4%；\n> 其他：26.58小时； 时间占比：5.3%；\n\n休息时间：\n\n> 休息：238.25小时； 时间占比：47.1%；\n> 每天的休息时长约为：7.94小时\n\n## 时间分析\n\n工作：自由职业。每天没有固定的上班时间，全凭自觉。然后，工作的时间就比以前少了很多。人的惰性真的很难克服。不过9月应该会花很多的时间在工作上。毕竟再不努力就要饿死了。\n\n阅读：相对来说，比以前都有所增加。这个月得到app李笑来的专栏《通往财富自由之路》更新结束，罗永浩的《干活日记》，朋友分享的薛兆丰《北大经济学课》，《熊太行·关系攻略》刚开始阅读。书籍方面，读完了《巨婴国》，这本书前前后后花了我25多个小时，让我对人的心理状态的理解，又多了一个维度，还是挺不错的。\n\n学习：没学什么新技能，如果有，那他一定是包含在工作当中的，不属于通用技能。\n\n写作：花的时间相对以往多了很多，七月时间总结《人生没有草稿纸》，《房东奶奶（一）》，8月时间总结《碌碌无为是因为焦虑》，《通往财富自由之路》读后感《真正的自由，是在你做到这些事情之后……》（还没写完）。应该继续增加写作量。\n\n交际：不上班了，也有更多的时间花费在交际上，和以前的老同学，老同事聚一聚，感觉还是不错的。\n\n生活：花费的时间不多，处理了一些家里的事情，整体花费的时间都不多。\n\n娱乐：电视剧《权力的游戏》第七季，还有看了赵雅芝版的《新白娘子传奇》，10集左右的《白银谷》（比较老的电视剧），还有几部电影。\n\n其他：处理了一件之前遗留的仲裁案。还没有执行，目前还在跟进。\n\n![](http://upload-images.jianshu.io/upload_images/292774-6c8f556d51526518.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240)\n\n## 碌碌无为是因为焦虑\n\n从2016年9月开始到现在，严格地记录时间开支刚好满一年。中间修改过几次记录方式，记录格式，也曾中断过几天，好在坚持到了现在。我还花固定的时间汇总这些时间开支，并附上一篇时间总结，都还算得上差强人意。\n\n当初刚开始给别人说起我记录时间开支的时候，他们的表现只有两种：觉得我是神经病，爱搞一些虚头八脑的东西。另一种则是“记这个有啥用？”\n\n向别人解释你现在正在做，但还没有完成的事情，是徒劳无功的。即便说的再真诚，其实也都是一个预期值而已。那些持怀疑态度的人并没有错，因此解释也就没有存在的必要了。后来我的说辞就变成了：“反正闲着也是闲着，总不能回家打孩子吧？况且也没孩子可打。”\n\n通常我就是这样把天聊死的。\n\n![](http://upload-images.jianshu.io/upload_images/292774-baed20b132201321.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240)\n\n直到前段时间，我才认为我找到了一个合理的解释，毕竟我已经记录了一年了。这个解释适合很多看似无用的奇怪行为：阅读得到app专栏，看直播，听知识讲座，办健身卡，读成功学，喝心灵鸡汤，刻意社交，拖延症，选择困难症，记录时间开支和大部分人的所说的时间管理，以及现在流行的“上进心”，都来自于一种叫“焦虑”的情绪。\n\n当我一眼看见这个词的时候，真如醍醐灌顶，那一瞬间，感觉轻松无比。\n\n到底是什么让我们焦虑呢？我想大概来自于“攀比”、“预期”、“选择”吧。也可以理解为对未来生活的恐慌。\n\n> 攀比会增加自以为必要的需求，但是通常得不到；\n> 过高的预期值则容易让人失望，结果往往达不到；\n> 在不同的选项之间犹豫不决，患得患失，却没有有效的行动。选择什么都不做，通常等于选择了最差的选项。\n\n努力学习，勤奋工作，主动社交，一旦让自己忙碌起来，似乎就可以抚慰你“焦虑”的情绪，治愈一切“不开心”。想到此处，我就开始去翻阅去年到现在的时间记录，看看过去的一年都干了什么。翻来覆去，也只是写着“碌碌无为”四个字。\n\n这一年里我都做了什么呢？考驾照；一份竞价的工作；看了几本书，还远远没有达到我的阅读目标；写作的数量也比去年少；也许记录时间开支也算的上正经事吧。还有其他自己以为很重要，但是最终都半途而废了的事情。\n\n当然，接下来我正在筹备的，尽管长期来看我并不看好，但也是一件正经事儿。这得益于这段时间的工作，阅读和思考。\n\n我并不觉得“焦虑”是什么坏事儿， 但它导致的碌碌无为确实不是好事儿，应当尽量避免。一部分强迫症患者的大量无意义的重复行为，就是为了减缓焦虑。\n\n我花了几天的时间来思考如何应对“焦虑”，准确的说法应该是应对“焦虑带来的碌碌无为”。我首先想到的是，有时候真的得信命：\n\n> 要始终相信，一切都是最好的安排。\n\n![](http://upload-images.jianshu.io/upload_images/292774-bc3f931e78a5744f.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240)\n\n下边的几个方法，希望能派的上用场：\n\n> 日常生活中以自己的感受为中心，不要刻意压制自己。主动给自己创造一个有秩序的生活空间（定期打扫卫生，规律饮食，按时睡觉起床）。（生活）\n> \n> 照顾他人的焦虑情绪，不任意评价任何人，尤其不要随意贴标签，包括对你自己。（交际）\n> \n> 努力做好自己想要做的事情，让自己的注意力集中在解决具体的问题上，保持专注。（工作和学习）\n\n另一个特别有用的，但是大多数人没有做好，却觉得没用的：\n\n> 多鼓励，少评论，对你越重要的人，越要多鼓励，特别要多鼓励你自己！\n\n每天鼓励一个人，鼓励一下自己！哪怕是刷朋友圈的时候看到有趣的事，顺手点个赞呢？也是对对方的小鼓励。想想你自己是如何期待被人点赞的，感同身受的体会下！\n\n![](http://upload-images.jianshu.io/upload_images/292774-68a2ffc6448f1b17.JPG?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240)\n\n总之，要主动改善和周围环境的互动关系。不要幻想坏运气会自动变好，好运气都是自己创造的。\n\n我还学了一个有趣的辅助方法：坐享。是从李笑来的得到专栏《通往财富自由之路》学来的。简单说了，就是打坐冥想。坐享了一段时间，感觉不是很明显，但是我觉得作用还是有的，至少可以让我在一段时间内平静下来，更容易集中注意力。也推荐你试一试。"
		},
		{
			"post_id": 9,
			"title": "时间的朋友",
			"date_published": 1509257737.125,
			"body": "2017年\n\n[凡是时间，总要花费掉——9月时间记录总结](http://127.0.0.1:43110/1497zHCGLWLb9SLGWd71ja2ZnysfzXeQrV/?Post:7:%E5%87%A1%E6%98%AF%E6%97%B6%E9%97%B4%EF%BC%8C%E6%80%BB%E8%A6%81%E8%8A%B1%E8%B4%B9%E6%8E%89%E2%80%94%E2%80%949%E6%9C%88%E6%97%B6%E9%97%B4%E8%AE%B0%E5%BD%95%E6%80%BB%E7%BB%93)\n\n[碌碌无为是因为焦虑——8月时间记录总结](http://127.0.0.1:43110/1497zHCGLWLb9SLGWd71ja2ZnysfzXeQrV/?Post:10:%E7%A2%8C%E7%A2%8C%E6%97%A0%E4%B8%BA%E6%98%AF%E5%9B%A0%E4%B8%BA%E7%84%A6%E8%99%91%E2%80%94%E2%80%948%E6%9C%88%E6%97%B6%E9%97%B4%E8%AE%B0%E5%BD%95%E6%80%BB%E7%BB%93)"
		},
		{
			"post_id": 7,
			"title": "凡是时间，总要花费掉——9月时间记录总结",
			"date_published": 1509257458.652,
			"body": "### 9月份时间记录汇总\n\n> 9月总时长为：505.75小时\n> 计时：377.75小时； 时间占比：74.7%；\n\n时间分布如下：\n\n> 工作：141.83小时； 时间占比：28.0%；\n> 阅读：63.75小时； 时间占比：12.6%；\n> 学习：0.00小时 时间占比：0.0%；\n> 写作：19.67小时； 时间占比：3.9%；\n> 交际：40.67小时； 时间占比：8.0%；\n> 生活：9.92小时； 时间占比：2.0%；\n> 娱乐：77.83小时； 时间占比：15.4%；\n> 其他：26.58小时； 时间占比：5.3%；\n\n休息时间：\n\n> 休息：238.25小时； 时间占比：47.1%；\n> 每天的休息时长约为：7.69小时\n\n## 时间分析\n\n工作：和朋友一起搞起了小生意，算是开始创业了吧！工作时间自由，每天的工作倒是很轻松，不轻松的是心态，需要操心的东西很多，对于商业需要恶补的知识太多了。从由需要领导管束的打工状态，变为需要自律为主的自由职业，对时间的把控完全是一个全新的感觉。路漫漫其修远兮，吾将上下而求索。\n\n阅读：这个月在读金庸的《鹿鼎记》，10月份读完。其他的书就是有商业、策略有关的了。低端到朋友圈卖货策略，高端到《无价》，《消费者心理学》。以及马东的奇葩说团队出品的《好好说话》，都等着10月份读完吧。\n\n学习：没有学习什么新的技能。主要是在工作中用到的学，用不到的就拉到了。\n\n交际：用了比较多的时间和各路朋友吃饭、聊天，当然一部分也是围绕工作展开的。\n\n生活：这个没什么好说的，就是主要是日常家务之类的。\n\n娱乐：时间占比很大，自从开始记录时间以来，占比最大的一个月。看了电视剧《大明王朝1566》，工作无聊之余，看了回顾了很多的老电影，一边工作一遍看电影的时候，就应该看比较熟悉的东西，不会因为错过部分片段而看不懂，也不会对工作造成多大的影响。听了很多的音频类节目比如吴军的《硅谷来信》，很不错。\n\n其他：一些杂事。\n\n## 凡是时间，总要花费掉\n\n想要管理时间，首先你要理解时间。\n\n> 假设：有这样一家银行，每天给你的账户存入1440块，无论你能否花完，或者不够花，每天凌晨12点清零，然后再存入1440块。\n> 问题：你将如何花费这1440块钱呢？\n\n是不是又开始觉得俗了？动不动就提钱……，先别急！\n\n还真的有这样一家银行，并且每个人都在用，不过存入的不是钱，而是**时间**。我们每个人，每天都有固定的1440分钟。并且，他无论你怎么使用，够不够用，都会毫不客气的准时清零。不一样的，也是相比花钱更残忍的，是时间并不会等到半夜12点才清零。\n\n之所以用钱来形容时间，是因为他们之间可以相互类比，让你更明白我想表达的意思。你还真别觉得这样比较有什么不好，你所使用的语言已经默认了这两者有非常类似的地方：“花钱”和“花时间”，“省钱”和“省时间”，“钱不够花”和“时间不够用”。其实我们生活中很多的东西都可以做这样的类比。\n\n![shijianhejianqian.jpg (1200x757)](data/img/post_7_shijianhejianqian.jpg)\n\n还用一个原因，我想让你明白：在具体的事情上，应该权衡花时间和花钱，哪个更划算！\n\n通过不断的记录和思考，我对时间的看法有了很大的改变：\n\n1\\. 每个人的时间总量都是有限的。\n2\\. 无论你采用什么方式，所有的时间最终都会被花费掉！\n3\\. 本质上时间并不属于我们。\n\n这么说，所谓的时间管理就变得清晰明了了，无非就是：研究怎么花费时间。\n\n我觉得，那些时间管理的书籍之所以看了没用，是因为作者们都忘了教读者算“时间账”。读者看不到时间管理能带来什么好处，事后也体验不到这种好处。没有好处，为什么要执行？\n\n这笔账该怎么算呢？\n\n我觉得主要是遵守两个原则。一个原则是经济学里对成本的定义：成本就是放弃了的最大代价！你想想，此刻你在看我的文章，可能花了5分钟；如果这5分钟你原本打算去玩儿《亡者农药》的，那么你的代价就是5分钟的游戏快感，或者你认为你要做的其他的事情所带来的收获。\n\n从长远来看，对时间的管理，还有另一个原则需要遵守，这和投资的核心逻辑一样：低买高卖。\n\n这些说起来容易，做起来还真是不好执行！\n\n估计大家都知道，我们可以把暂时不花的钱存起来，以后再花。存的越多，以后所能购买的东西就越多越好。可想而知，如果想在未来可以拥有你想要的好东西，那就开始存钱吧！（最好是那种存钱的利息可以抵消通货膨胀的存钱方式，如果利息居然比通货膨胀率高，那就更好了；进一步，居然还是复利，那简直没有最好的了！可惜，月光族，日光族，总是没钱可以存，更可怕的还有还不完的信用卡、分期付款。）\n\n如果时间可以如同金钱一样存储，那该有多美好！我靠，时间怎么存？\n\n不妨换个角度想想，如何购买时间？什么东西可以购买时间？这样东西能不能储存？这样东西储存到很久以后，能不能很方便的购买时间？这样东西随着储存时间的增加，有没有可能产生数目可观的利息？\n\n就如同我上边所说的，你每天的1440分钟总是要想办法花掉的。花费的方式在我看来也无非记录表中列举的那几项（当然你可以有你自己的分法）。你可以旅游、读书、打游戏、逛街、陪伴亲人、K歌、聚餐、工作、发呆、阅读今日头条、刷微博……无论如何，你就是会想尽一切办法，把那1440分钟花费掉。\n\n人类的很多行为都可以看作是对时间的买卖行为。这简直太好了！你可以方便的复盘自己以前的经历！\n\n比如，学生时期：就是花钱花时间买老师的经验知识和时间。而对于学生，就是把现在的时间转化为知识储存起来，以便在未来可以转化成时间。\n\n良好的时间管理的标志是：\n\n1\\. 你节省了多少时间？\n2\\. 你用你现有的资源，购买了多少别人的时间，是否划算？\n3\\. 你获得了多少，可以在以后兑换成时间的交换物？\n\n其中一和二，很多时候是重合的。\n\n比如：你愿意花费昂贵的价格话费5个小时的时间乘坐飞机，而不是步行3个月去遥远的地方，不就可以看成是花钱买时间么？也是节省时间。\n\n有关第三点中说到的交换物，其实很宽泛，可以是美貌、金钱、身体、知识、能力、交际……\n\n以上都是大道理。\n\n我想请你可以关注一下自己，每当你开始一件事情的时候，思考一下这么做，对自己的未来贡献有多大。"
		},
		{
			"post_id": 6,
			"title": "人在江湖，大家要讲道理",
			"date_published": 1509251832.215,
			"body": "<center>1</center>\n\n* * *\n\n我们每个人都置身在自己的江湖之中，人在江湖，都不讲理。\n\n乔峰当年为丐帮立下了汗马功劳，让其能够在北方武林中处于老大哥的位置，但是一旦大家都知道他契丹人的身份，立马就变成了几乎所有人眼中的坏人。即便是武林中的泰山北斗似的人物，也是转脸不认人，翻脸比翻书还快。\n\n我的一个朋友对我说：**他相信人性本善**。\n\n谁不是善的呢？江湖豪客们不也是为了保护大宋的不受外族欺负么！\n\n人类社会有一种特别奇怪的现象：如果你承认“真理往往掌握在少数人手中”，这意味着剩下的人，基本上都是没有掌握真理的人。那么我们就可以得出这样的结论：大多数人都是无法正确讲理的人。奇怪就奇怪在，大多数人都认为自己是掌握真理的少数人。就好像那个有趣的心理学现象：90%的人认为自己的驾车技术高于平均水平。\n\n请注意：如果遇到明明懂道理的人故意不讲理，他们就极有可能是实实在在的坏人。\n\n全冠清、白世镜、马夫人。他们难道不懂道理么？赶走乔峰，意味着丐帮将会成为一盘散沙，北方武林的顶梁柱轰然倒塌，大宋将失去一支强有力的抗辽队伍。马夫人给出的理由很简单，就是因为乔峰在丐帮大会上没有多看自己一眼，白世镜和全冠清却只是为了和马寡妇啪啪啪！\n\n但是他们搞掉乔峰时的理由居然是：**契丹狗贼！辽国奸细！人人得而诛之**。\n\n<center>2</center>\n\n我估计每个抵制日货的人都能理解这种理由的杀伤力。这是一个让所有人都愤怒的理由，就连乔峰本人在改名萧峰之前遇到这样的人，也是要“除奸”的！还好，当时的乔峰很幸运，因为他武功足够高，一大票人都想杀他，却没人愿意先送死。这和战国时期六国合纵攻秦：“秦人开关延敌，九国之师，逡巡而不敢进。”也是一样一样的。\n\n直到现在人们还在经常用这种手段对付“不合群的人”，最有趣的例子：“钓鱼岛是中国的，苍井空是世界的”，然后开日本车的都成了汉奸；用日本的产品都成了亡国奴。\n\n这根本就不是善良不善良的问题，而是，我们在观察一件事情的时候，你站在某个位置上，分析了它的利弊，最终却只得出了得出善或恶的结论！\n\n<center>3</center>\n\n最近我特别注意的一个词语是“观念”。首先是在D.Q.麦克伦尼《简单的逻辑学》看到的；后来又在李笑来的《把时间当作朋友》，以及他在得到App的专栏里看到；这两天又在格拉宁的《奇特的一生》中看到了这个词。\n\nD.Q.麦克伦尼在《简单的逻辑学》中说：\n\n> 观念是对客观事物的主观反映。正确观念忠实地反映其对象的客观秩序；与之相反，错误观念则是对客观世界的歪曲表达。\n\n遗憾的是，我们在对一件事物没有足够深刻地理解之前，几乎不可能存在正确的观念。但是现在以大多数人地努力求真程度而言，想要获得正确的观念，似乎还差得很远……\n\n我想，也正是基于这个原因才导致了，网上传播的热门新闻，几乎舆论总是一边倒的现象。更有趣的是，紧接着就有人提出与之相反的看法，再后来大家开始吵成一团，互相对骂。而事件原先的真相则已经被吃瓜群众忘在了脑后。\n\n无论他们的分析多么的有理有据，却一直没有注意到这样一种商业现象：**这世上有个很简单却又长期成功的商业模式：把海量的廉价甚至免费的注意力集中起来高价卖掉。**（李笑来《你拥有的最宝贵的财富是什么？》）\n\n<center>4</center>\n\n互联网行业有一个重要的产品质量评判指标叫做：**用户活跃度**。用来量化衡量该平台单位时间内的用户数量、使用次数、以及使用时长的。其实优化用户活跃度，就是在操作用户的注意力而获取利润。当然这是平台提供方和用户各取所需的公平交易。\n\n如果上边的说明你不是特别明白，我就举个例子吧。\n\n> 王宝强离婚事件是2016年8月14号早上，在王宝强的新浪微博公开发布的。之后，该事件持续一周的时间占据着热门微博的前十名。一直盖过里约奥运会的风头。\n\n王宝强离婚事件和新浪微博、和吃瓜群众有什么必然联系么？然而并没有必然联系。\n\n但是，就在他们不停吵吵的时候，新浪微博的股票悄然突破了100亿美金。这个主要以娱乐、明星、新闻、八卦、微商、励志鸡汤组成的庞杂信息世界，居然又创造了一个中国互联网奇迹。不得不说，类似的新闻、事件，正是推动新浪微博股价步步高升的动力之一。吃瓜群众们当然是功不可没的。\n\n这当然是好事情，毕竟促进了经济发展。\n\n但是，武侠里的就没那么幸运了。聚贤庄一战，游氏双雄惨死，本来那个只听过乔峰名字，想做吃瓜群众的“英雄豪杰”死伤无数，最终弄了个两败俱伤的下场。江湖郎中阎王敌薛神医，大撒英雄帖，势要除掉乔峰，最终却送了多少英雄的性命！\n\n我也相信人性本善，但是我想这句话应该还有下一句：\n\n> 人性本善，莫忘初心！\n\n* * *"
		},
		{
			"post_id": 5,
			"title": "有关这个世界的唯一事实就是：它最终和你想象的不一样",
			"date_published": 1509205664.128,
			"body": "《罗辑思维》第五季的节目有一期讲到“做计划”的话题，听完之后还真是有点小感触。\n\n时间记录的核心在于：通过对过去发生的事件进行时间统计和分析，然后对未来一段时间内重复发生的事情，一个合理的时间预期，从而做到更合理的分配时间，提高效率。也就是，对具体的事件完成“紧急”、“重要”程度的分类，让我们来回顾一下时间管理法则中，这几个重要的分类：\n\n> 1\\. 重要且紧急\n> 2\\. 重要不紧急\n> 3\\. 紧急不重要\n> 4\\. 不紧急不重要\n\n其实做计划，就是对具体的事情按照手中现有的信息，以及重要和紧急程度等的标准，合理的安排各个环节的出场顺序和出场时间长短，然后给这些时间段，配备以相应的资源。\n\n既然是计划，那么所有的事情实际上都还没有发生！也就是说，计划都仅仅是预判！\n\n所有的预判都有出错的可能，懂得一点“概率”的人，应该都能理解这一点。并且，通常所有的计划在最终的执行过程中，都必然会出错！越是复杂的计划越容易出错。\n\n世界的真相就是：最终事实和你想象的不一样！\n\n以前对做计划的认识，到这里就结束了。觉得说，不能严格执行，计划就没有必要做。因为做计划本身，需要收集各方信息，平行各方资源。一个好计划，是很花心思的！所要承受的心里压力也是很大的。越完美的计划，心理压力越大。毕竟，我们见过的、或者经历过的计划，多是以失败告终的么。\n\n这么说，计划随便做做，反正总会出错。执行完了还可以给自己一个：反正也没希望能得到一个好结果的借口。说起来还真是省力省心呢！\n\nToo young , too simple !\n\n尽管如此，计划仍然还是要好好做的。只是，我们要给做计划换一个思考，换一个说法，换一种执行方式。\n\n## 思考\n\n计划不是被用来严格执行的。回到为什么要做计划这个原因上，我们是想利用手头的资源达成某个目标，获得预期、最好是比预期更好的结果。\n\n任务完成之前，结果最重要！结果最重要！结果最重要！计划和执行过程，都只是达成目标的手段之一而已。\n\n如果做计划时发现了更好的方案，最好制定一个备选方案，甚至多个备选。不要忘记，我们是为了达成目标。\n\n## 说法\n\n真正可执行的计划，并不是写在纸上的文字。也不是电脑里的 PPT 和 Word 。\n\n我更喜欢用“做准备”这个说法来替代“做计划”。做准备，意味着你要盘点“仓库”，配置资源，采集信息。\n\n这个仓库里装满了各种各样的资源。时间、财力、人员、信息……，评估他们的数量，质量，可靠性。把你要如果使用这些资源达成目标的想法清晰简练、通俗易懂的写下来。就是一个完整可执行的计划。\n\n或者也可以这么说：计划就是为了应对未来的不确定性，而提前做的准备！\n\n尴尬的是，我们对“做计划”的理解更倾向于：就是给领导交一个 PPT 或者领导更方便打开的“作业”。\n\n你要知道：写下来的文字，沟通才是他的使命。\n\n## 执行\n\n如果不考虑其他因素，无法达成目标的计划，通常有三类原因：\n\n1\\. 现有资源无法达成结果。\n2\\. 资源使用不当。\n3\\. 执行过程中，由于各种原因，目标变了！\n\n一般而言，前两种情况很难区分清楚，即便是区分清楚了，我们也更喜欢说无法达成目标是因为“资源不够”。导致这样的结果，常常是因为忘了“做计划”是为了“达成目标”，而不是执行计划。\n\n执行过程中，遇到阻力是常态，要及时的调整预案，规避掉陷阱，更要合理的使用新资源。多人配合的任务，一定要及时通知相关人员。\n\n比较坑的是目标发生改变，就需要重新做计划。总的来说，那就是从计划到执行的又一个轮回了！\n\n关于执行力，还有一个关键点，总是被人有意或无意的忽略，那就是：主动性！\n\n这两个月读的两本书，在这些方面对我的启发特别的大：\n\n一本是《随机漫步的傻瓜》，作者是纳西姆·塔勒布。\n\n另一本是《信息简史》，作者詹姆斯·格雷克。\n\n当然他们并没有在书中讲解任何和做计划有关的论述，但是他们提到的“随机性”，以及有关“预测未来”的思考，确实让人大开眼界。\n\n罗振宇提到的“做计划”的说法，让我自然而然的就想到了这两本最近才读完的书。这半年来，做时间记录给我带来的感受，让我对“做计划”，也有了更深层次的认知。\n\n之前写过的有关计划的文章，现在回头看看，真的会吓出一身冷汗：\n\n> 糟糕的计划\n\n我的时间记录分析以及每月总结，都发在简书，和我的博客上：\n\n> 简书：[http://www.jianshu.com/u/29e2a06942e7](http://www.jianshu.com/u/29e2a06942e7)\n> 博客：[http://www.wangerblog.com](http://www.wangerblog.com)"
		},
		{
			"post_id": 4,
			"title": "消极一下也无妨",
			"date_published": 1509185572.202,
			"body": "*   我看过很多地方的云，走过很多地方的桥，喝过很多地方的酒，听过很多人讲的道理，仍然无法过好这一生。\n\n* * *\n\n*   笨鸟先飞，不一定先到呀。\n\n* * *\n\n*   早起的鸟儿有虫吃，吃的都是隔夜虫。\n\n* * *\n\n*   我就是弄不明白，早起有啥不好的，难道你们都不睡回笼觉么？\n\n* * *\n\n*   妹妹你坐船头，哥哥我划不动。\n\n* * *\n\n*   减肥成功有什么好高兴的，早晚会涨回来！\n\n* * *\n\n*   钱多你就了不起啦？当然喽，钱多很了不起啊。\n\n* * *\n\n*   我交朋友从来不在乎他有钱没钱，反正我没钱。\n\n* * *\n\n*   晚上天黑走路掉进了一个坑里，刚爬出来我就又跳了进去，因为旁边那个坑更深。\n\n* * *\n\n*   我从来不一个人去电影院看电影，所以我从来没去电影院看过电影。\n\n* * *\n\n*   从小老师就教育我们要勤俭节约，恨不得一分钱要掰成两半花。长大后，我好不容易能把一分钱掰成了两半，老板却说一个包子要五毛。\n\n* * *\n\n*   妹子感冒了，我说：“记得多喝水。”她却回复说“你滚！”\n\n* * *\n\n*   公司出的新制度，禁止在办公室吃早餐，后来大家就陆续辞职了。\n\n* * *\n\n*   马上就要下班了，好开心。老板说：小王，组织一下，下班了开个会。\n\n* * *\n\n*   我看过很多地方的云，走过很多地方的桥，喝过很多地方的酒，听过很多人讲的道理，却仍然无法过好这一生。\n\n* * *"
		},
		{
			"post_id": 3,
			"title": "人生没有草稿纸",
			"date_published": 1509179848,
			"body": "“人生没有草稿纸”这句话是高中时期，从语文老师那里学来的，我不知道它的出处是哪里。\n\n这和李宗盛那句人所熟知的歌词“人生没有白走的路，每一步都算数”，倒是非常的契合。\n\n当时的理解大多是在感慨时间的流逝，以及要认真的对待每一个人，每一件事，不要辜负美好时光。\n\n前几天，又开始读王小波的《黄金时代》，读到第三章陈清扬回忆往事的那段时，差一点流下泪来：\n\n> 陈清扬坐在椅子上听着风声，回想起以往发生的事情，对一切都起了怀疑。她很难相信自己会莫名其妙地来到这极荒凉的地方，又无端地被人称作破鞋，然后就真的搞起了破鞋。这件事真叫人难以置信。\n\n回想起以往发生的事情，你是不是也会常常“对一切都起了怀疑”？\n\n我突然意识到，过去那些任何一个看似微小的决定，塑造了现在的我。\n\n只有不经意的回头看，才能发现自己当初可笑的样子。\n\n我清楚的知道，在我的过往，做过很多蠢事，将来也一定还会做很多蠢事。想到此处，那些不经意的玩笑和无法辨别对错的堂堂正正的大道理，都让我感到害怕。\n\n我特别讨厌怀念过去，因为已经发生的事情，无论他曾经给你带来的是快乐还是忧伤，都是无法改变的。你只能默默承受。现在的状态是以前的经历造成的结果，那是自己的选择，抱怨没有用。有趣的是，即便是那时的快乐，也会在现在生出一种莫名的伤感。\n\n你不妨这么想，既然现在是过去的决策导致的结果，那未来呢？在未来的某个时间节点上，回顾现在，你会想到什么？恐怕你看到的也是不堪回首的往事吧？此时此刻的状态，在潜移默化的影响着你的未来。可怕的是，我们并无法确切的知道，现在是如何影响未来的。事实上，那些所谓的正确，也不过是蒙着头狂奔。\n\n我们终将在某一件重要的事情上犯下后果严重的愚蠢决定。\n\n这不像是做数学题，你可以在草稿纸上验证的你的各种想法，最终把正确的答案写在考卷上。\n\n我记得当时老师在对我们说这句话的时候，还着重提醒，一定要合理的使用草稿纸，要像考卷一样整整齐齐的验算。以便你检查错误。\n\n也许在他的眼里，这小小的草稿纸，也是不能随意忽视的人生。\n\n人生没有草稿纸。何不给自己一个足够严谨，而有足够宽容的人生。\n\n> 节选自我的《七月时间总结》，内容略有改动。\n> 原文地址：[http://www.jianshu.com/p/ff29e876b022](http://www.jianshu.com/p/ff29e876b022)"
		},
		{
			"post_id": 2,
			"title": "心经",
			"date_published": 1509179541.83,
			"body": "观自在菩萨，行深般若波罗蜜多时，照见五蕴皆空，度一切苦厄。\n\n舍利子，空不异色，色不异空，空即是色，色即是空，受想行识，亦复如是。舍利子，是诸法空相，不生不灭，不垢不净，不增不减。\n\n是故空中无色，无受想行识，无眼耳鼻舌身意，无色声香味触法，无眼界，乃至无意识界。无无明，亦无无明尽，乃至无老死，亦无老死尽。无苦集灭道，无智亦无得。以无所得故，菩提萨埵，依般若波罗蜜多故，心无挂碍，无挂碍故，无有恐怖，远离颠倒梦想，究竟涅盘。三世诸佛，依般若波罗蜜多故，得阿耨多罗三藐三菩提。故知般若波罗蜜多，是大神咒，是无上咒，是无等等咒，能除一切苦，真实不虚。故说般若波罗蜜多咒，即说咒曰：“揭谛揭谛，波罗揭谛，波罗僧揭谛，菩提萨婆诃。”"
		}
	]
}