{
	"posts": [
		{
			"id": "661f0b9d-f06e-4035-89cb-3bdfb93687f6",
			"directory": "users/1FuDmNBcouieQ24JV21jvSbyH3kZNh1JZr",
			"uri": "test",
			"thread": "88cd6882-71f1-4b29-82b2-4a1c1498bfb9",
			"body": "tit",
			"time": 1565709863821,
			"files": "[]"
		},
		{
			"id": "73d72d5c-1fa8-4668-b96d-2b8049e5a99e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "bfdc4f6d-b1de-4add-bd93-0b1afcca2d49",
			"body": "I\nHATE\nQ-FAGGOTRY",
			"time": 1565712145355,
			"files": "[]"
		},
		{
			"id": "07de7e5e-0474-4366-80ff-de7c8edf7273",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f9af075f-7555-4274-91e6-282390f63244",
			"body": "is my post visible?\n",
			"time": 1565712602933,
			"files": "[]"
		},
		{
			"id": "118610d8-8ff5-4321-8f56-bc5161673a61",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f9af075f-7555-4274-91e6-282390f63244",
			"body": ">>27ce0865-85b0-43dc-9736-bb0a44a7ebbe\nthanks",
			"time": 1565712916180,
			"files": "[]"
		},
		{
			"id": "ef70627f-1503-4cf3-96c7-3f162cce6631",
			"directory": "users/1FqGsAbu3WLN8iwZv6GWLSPFcBeQg1jQj7",
			"uri": "sudo",
			"subject": "Excuse me",
			"body": "There was a github (?) link that had the thing where you download a data directory and then paste it into your data directory in Zeronet.\nI can't find the link\nI had to reinstall ZeroNet, so I'd like that link again",
			"time": 1565715212541,
			"files": "[{\"name\":\"polar-bear-excuse-me-sir.jpg\",\"thumb\":\"88f89c742ab117fcad621bc7002fa04ef3a6269e-thumb.jpg\",\"size\":27816,\"type\":\"image/jpeg\",\"original\":\"a87240ccd724ac1ca2849133c6442fe6f3514bfc.jpg\",\"directory\":\"1DjQ1faejBVMQsW9m4aHLSDiH2PUYKVQN2\"}]"
		},
		{
			"id": "a1224a90-999e-4fc3-b823-20689b9f639d",
			"directory": "users/1FqGsAbu3WLN8iwZv6GWLSPFcBeQg1jQj7",
			"uri": "sudo",
			"thread": "ef70627f-1503-4cf3-96c7-3f162cce6631",
			"body": "I guess\nthere was a readme file\nand a directory that I just copied over",
			"time": 1565716891221,
			"files": "[]"
		},
		{
			"id": "29f40364-389b-4273-b310-a29483d7d20d",
			"directory": "users/1FqGsAbu3WLN8iwZv6GWLSPFcBeQg1jQj7",
			"uri": "sudo",
			"thread": "ef70627f-1503-4cf3-96c7-3f162cce6631",
			"body": ">>50e183e9-a664-47bf-9db0-ee0b0052cd06\nbut, if I just re-installed ZeroNet 10 minues ago, wouldn't I just have the updated site loaded already",
			"time": 1565717185769,
			"files": "[]"
		},
		{
			"id": "f65b3b7a-7a13-4274-8491-2a0aa5d23ae3",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"subject": "08Chan Updated Site Code ?? (not sure)",
			"body": "There was a github (?) link that had this thing where you download a data directory and then paste it into your data directory in Zeronet. It may have been the updated site code and maybe some optional files like images people are uploading.\nI can't find the link\nI had to reinstall ZeroNet, so if anyone has that link, that would be great.",
			"time": 1565718070414,
			"files": "[]"
		},
		{
			"id": "dfe44743-9d3d-49d5-81f4-7bf7b82fe796",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "f65b3b7a-7a13-4274-8491-2a0aa5d23ae3",
			"body": "yeah\nthat would be great",
			"time": 1565718151997,
			"files": "[{\"name\":\"lumbergh.jpg\",\"thumb\":\"df8d19dc88f06fad652c457c460c14d72e8c6eae-thumb.jpg\",\"size\":44534,\"type\":\"image/jpeg\",\"original\":\"7b75da0419d88cf2b8b25981a8a45893d3e3af53.jpg\",\"directory\":\"1DjQ1faejBVMQsW9m4aHLSDiH2PUYKVQN2\"}]"
		},
		{
			"id": "df802782-4357-40cd-87a4-88412df2a9f7",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5be78af6-3f73-4566-891a-f80301637793",
			"body": "Hi\npartial retard here\nright clicking on link, downloading images, and then renaming the file extension .zip did not work for me.\nthere is another way to download the original image\nI forgot as it has been so long since I did stego",
			"time": 1566158944404,
			"files": "[]",
			"last_edited": 1566158990158
		},
		{
			"id": "8a09a6a9-bd8a-4492-af8a-0a917bb9ebab",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "831ee92f-d703-4e20-9d33-ad2031426f6d",
			"body": ">>53593aee-520c-4cef-8105-40ecabf9ae32\nlel\n\"i'm all alone here\"",
			"time": 1566221809900,
			"files": "[]"
		},
		{
			"id": "731c8f47-0128-4160-b41d-953ee938efd0",
			"directory": "users/1GSRSdEwbEHiMPaKe1R2ndmym83ZFz8Neo",
			"uri": "tay",
			"thread": "6ff89426-ac9f-46f5-963f-f6bc52481d03",
			"body": ">>ca96b23d-ee84-4396-b590-11e9e7ae29c5\nokay boss",
			"time": 1566222034900,
			"files": "[]"
		},
		{
			"id": "c297f78a-f98f-4497-8a1d-a233eea46bfc",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "970aea10-19b2-473a-9ed1-da6aea653c7b",
			"time": 1566223569600,
			"files": "[{\"name\":\"2019-08-19 09-01-03.webm\",\"thumb\":\"890c7943321f6dc12a4d8659a6ab2a65bc649ecc-thumb.jpg\",\"size\":1577582,\"type\":\"video/webm\",\"original\":\"25cf9977d172921ba9aff44e2a95d22340a59a52.webm\",\"directory\":\"1DjQ1faejBVMQsW9m4aHLSDiH2PUYKVQN2\"}]"
		},
		{
			"id": "62e7d482-4459-4eed-b034-0b33ab33595c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "409d4dfa-d0b0-4f18-88c0-534b8cf59596",
			"body": ">>d339eea2-1f16-4527-bebb-7247fe7eeb7f\nwhat about polvols 2, 5, or 6\n",
			"time": 1566236415000,
			"files": "[]"
		},
		{
			"id": "d674123b-456e-4a64-83b8-21faf6126303",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "GOP Sen. Martha McSally drafts bill making domestic terrorism a federal crime",
			"body": "==DRUST UR REBUBLIKIN SENATUR==\n\nBy BURGESS EVERETT, 08/14/2019 05:26 AM EDT, Updated 08/14/2019 10:59 AM EDT\n\n>     Sen. Martha McSally is seeking to make domestic terrorism a distinct federal crime, the latest sign that Republicans are increasingly serious about crafting a legislative response to recent mass shootings in Texas, Ohio and California.\n>     The Arizona Republican is aiming to close a loophole in the law that prevents federal authorities from specifically punishing domestic terrorism, according to a discussion draft circulated to other offices. McSally, an Air Force veteran, said in releasing the draft that “domestic terrorism is in our backyard and we need to call it and treat it under the law the same as other forms of terrorism.” Authorities frequently charge domestic terrorism suspects with other offenses.\n>     “For too long we have allowed those who commit heinous acts of domestic terrorism to be charged with related crimes that don’t portray the full scope of their hateful actions,” she said. “That stops with my bill. The bill I am introducing will give federal law enforcement the tools they have asked for so that they can punish criminals to the fullest extent of the law.”\n>     The bill is likely to garner significant co-sponsors in the coming days, according to an aide familiar with the effort. The draft bill would criminalize politically motivated violence, recognize victims of terrorism and allow federal authorities to charge suspects with acts of domestic terrorism.\n>     FBI Director Christopher Wray told senators last month that the FBI is “aggressively” fighting domestic terrorism, but some lawmakers contend that creating domestic terrorism laws would be another tool to fight homegrown terror. In response to recent shootings, Republicans in the Senate are also discussing expanding background checks during gun sales, installing “red flag” laws that would allow authorities to take away at taking weapons from dangerous people, and cracking down on straw purchases of guns, according to senators.\n>     McSally is running against Mark Kelly in Arizona’s 2020 special election for the late John McCain's Senate seat, a contest in which firearms and fighting crime will loom large. Kelly is married to former Rep. Gabby Giffords (D-Ariz.), and the two have been fighting to push Congress to respond to mass shooting since Giffords was shot and seriously wounded in 2011. McSally has said she is open to expanding background checks but wants to preserve Second Amendment rights. \n\n'''Source:'''  https://www.politico.com/story/2019/08/14/martha-mcsally-domestic-terrorism-1462301\n'''Archive:'''  http://archive.fo/y4aAr",
			"time": 1566240007220,
			"files": "[{\"name\":\"Domestic Terrorism 1.png\",\"thumb\":\"87b8876ecceced199a2e54e543c0d1323ce91ea8-thumb.png\",\"size\":1177151,\"type\":\"image/png\",\"original\":\"87b8876ecceced199a2e54e543c0d1323ce91ea8.png\",\"directory\":\"1DjQ1faejBVMQsW9m4aHLSDiH2PUYKVQN2\"}]"
		},
		{
			"id": "a8f46b2a-980c-482a-8529-cc7c896866d5",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Omar, Tlaib to discuss Israel, Palestine travel restrictions",
			"body": "==IZZRAYEL SHOWS THAT THEY ARE ANTI-AMERICAN==\n''(Yet again)''\n\nBy The Associated Press - ST. PAUL, Minn. — Aug 19, 2019, 11:56 AM ET\n\n>     Democratic Reps. Ilhan Omar of Minnesota and Rashida Tlaib of Michigan are talking about travel restrictions to Israel and Palestine after they were denied entry into the Jewish state last week.\n>     At the urging of President Donald Trump, Israel denied entry to the two Muslim representatives over their support for the Palestinian-led boycott movement. Tlaib and Omar, who had planned to visit Jerusalem and the Israeli-occupied West Bank on a tour organized by a Palestinian group, are outspoken critics of Israel's treatment of the Palestinians and support the Palestinian-led international movement boycotting Israel.\n>     The two freshman House members said they would discuss \"potential policy responses\" to Israel's decision during a news conference on Monday. Omar spokesman Jeremy Slevin declined to discuss the details ahead of the event.\n>     Tlaib and Omar are expected to be joined by Minnesota residents who've been directly affected by travel restrictions. They include Lana Barkawi, a Palestinian American who's executive and artistic director of Mizna, a cultural group that sponsors the annual Twin Cities Arab Film Fest. The U.S. government denied visas to several Mideast actors and directors who had been invited to participate last year.\n>     White House spokesman Hogan Gidley kept up the administration's criticism of the two lawmakers Monday.\n>     \"Congresswomen Rashida Tlaib and Ilhan Omar have a well-documented history of anti-Semitic comments, anti-Semitic social media posts and anti-Semitic relationships,\" he said in a statement. \"Israel has the right to prevent people who want to destroy it from entering the country — and Democrats' pointless Congressional inquiries here in America cannot change the laws Israel has passed to protect itself.\"\n>     Before Israel's decision, Trump tweeted it would be a \"show of weakness\" to allow the two representatives in. Israel controls entry and exit to the West Bank, which it seized in the 1967 Mideast war along with east Jerusalem and the Gaza Strip, territories the Palestinians want for a future state.\n>     Trump's request to a foreign country to bar the entry of elected U.S. officials — and Israel's decision to do so — were unprecedented and drew widespread criticism, including from many Israelis as well as staunch supporters of Israel in Congress. Critics said Israel Prime Minister Benjamin Netanyahu's decision was a reckless gamble that risked turning Israel into a partisan issue and threatened to undermine ties between the close allies.\n(Trump never requested that shit - He's just another puppet - that is just the narrative so they can cover their asses - how bad does it look when Israel bans two Muslim U.S. Congresswomen into their country?  And at the same time, Trump saying he supports Israel 1,000% ? ? ?)\n>     Tlaib and Omar support \"boycott, divestment and sanctions,\" or BDS, a Palestinian-led global movement. Supporters say the movement is a nonviolent way of protesting Israel's military rule over the occupied territories, but Israel says it aims to delegitimize the state and eventually wipe it off the map.\n>     Last week, Israeli Interior Minister Aryeh Deri said Tlaib had requested and been granted permission to enter the West Bank to see her aging grandmother. Deri's office released a letter that it said was from Tlaib, which promised to respect travel restrictions during her visit. But after the announcement, Tlaib tweeted she wouldn't allow Israel to use her love for her grandmother to force her to \"bow down to their oppressive & racist policies.\"\n>     The two congresswomen are part of the \"squad\" of liberal newcomers — all women of color — whom Trump has labeled as the face of the Democratic Party as he runs for reelection. The Republican president subjected them to a series of racist tweets last month in which he called on them to \"go back\" to their \"broken\" countries. They are U.S. citizens — Tlaib was born in the U.S. and Omar became a citizen after moving to the United States as a refugee from war-torn Somalia.\n\n'''Source:'''  https://abcnews.go.com/Politics/wireStory/omar-tlaib-host-news-conference-travel-restrictions-65053805\n'''Archive:'''  http://archive.fo/jmmVZ\n\n**pardon the screenshot - They had a video and I couldn't download the video.**",
			"time": 1566241019198,
			"files": "[{\"name\":\"Screenshot.png\",\"thumb\":\"84e9ecd1ad1f4ffa9a23f65ea62b2be00495b5e5-thumb.png\",\"size\":489299,\"type\":\"image/png\",\"original\":\"84e9ecd1ad1f4ffa9a23f65ea62b2be00495b5e5.png\",\"directory\":\"1DjQ1faejBVMQsW9m4aHLSDiH2PUYKVQN2\"}]"
		},
		{
			"id": "b5923005-3f6e-4dbc-8e42-cdbdfd8adcf9",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Trump’s transparent attempt to manipulate American Jews",
			"body": "==ORANGE MAN==\n\n''Trump’s support for Israel denying entry to Ilhan Omar and Rashida Tlaib is a clear attempt to pit Jews against Democrats.''\n>     Wednesday night, a pickup truck pulled up to a densely packed group of Jewish protesters outside an Immigration and Customs Enforcement detention center in Rhode Island. The driver stopped for a second and then accelerated into the protesters, sending several to the hospital — though thankfully, none were seriously injured.\n>     The driver seems to have been one of the detention center’s guards, according to the Washington Post; after the attack, other detention center guards tear-gassed the protesting Jews. All of this was captured on video, yet there are no reports that either the truck driver or the gas attackers have been arrested.\n>     The president of the United States, who claims to care for America’s Jews, has had nothing to say about this. Instead, he spent Thursday morning talking about why Democratic Reps. Ilhan Omar and Rashida Tlaib are the real anti-Semites, championing Israel’s shock decision to ban the two Muslim Congress members from visiting this weekend — a position that President Trump reportedly pushed its government to take behind the scenes:\n(See attached Trump Tweet)\n>     It is true that both Omar and Tlaib have been supportive of the Boycott, Divestment, and Sanctions (BDS) movement aimed at boycotting Israel. It’s true that Omar in particular has said a handful of things that play into troubling anti-Semitic stereotypes.\n>     But there is no persuasive evidence that they hate “all Jewish people.” Trump is dramatically distorting the two Muslim women’s records for crassly partisan reasons, a transparent part of his campaign to try to convince America’s overwhelmingly Democratic Jewish voters that they should switch sides. He’s also actively pushing a foreign power to restrict freedom of movement for members of Congress, something no ostensibly patriotic American leader should do.\n>     It’s been a bad couple of years for the American Jewish community — my community. Anti-Semitism is on the rise; three synagogues have been targets of shootings in the past year alone. And the president has shown no remorse for the ways his rhetoric has helped bring alt-right anti-Semites out from the woodwork.\n>     His attack on Omar and Tlaib in the guise of standing up for Jews is obscene.\n>'''     Trump’s offensive politicking on anti-Semitism'''\n>     The irony of Trump calling Omar and Tlaib anti-Semites is rich.\n>     This is a man who, in 2015, told a room full of Jewish Republicans that “you’re not going to support me because I don’t want your money,” adding that “you want to control your politicians, that’s fine.” In 2016, Trump released a campaign ad that played a quote from one of his speeches over footage of George Soros and former Fed Chair Janet Yellen (also Jewish), a visual that comes across as an anti-Semitic dog whistle. This April, he told an American Jewish audience that Israeli Prime Minister Benjamin Netanyahu was “their” prime minister, implying that American Jews have a dual loyalty to Israel — a worse version of the controversial comments Omar once made about the pro-Israel lobby.\n>     The expert consensus is that Trump’s rise to the presidency has energized the alt-right and other fringe anti-Semitic groups — helping them gain recruits to their extreme ideology, and even labeling some of them “very fine people” after the 2017 alt-right rally in Charlottesville, Virginia.\n>     “They perceived him as anti-immigrant, anti-Muslim, and certainly anti-establishment,” says Mark Pitcavage, an expert on far-right extremism at the Anti-Defamation League, a Jewish anti-hate group. “They liked him quite a bit. So they really came out in force for him.”\n>     '''''One study of 75 far-right radicals found that many of them “credit his candidacy as the start of their awakening.”'''''\nwut...ok, I get it...\n>     In his book The Alt-Right: What Everyone Needs to Know, University of Alabama professor George Hawley writes that “Trump’s presidential campaign energized the alt-right and helped the movement reach a new audience,” adding that “had Trump never entered the GOP presidential primaries ... the alt-right would not have shown much interest in the 2016 presidential election.”\nok, the \"Alt\" right\n>     For these reasons, it’s easy to see through the president’s cynical attempt to pit American Jews against two Muslim members of Congress.\n>     Seventy-one percent of American Jews disapprove of Trump’s handling of anti-Semitism, per a May poll by the Jewish Electorate Institute. Only 27 percent are more concerned by Democrats’ approach to anti-Semitism than the Trump-Republican approach. And a significant majority (59 percent) believe that Trump is “at least partially responsible” for the fatal synagogue shootings in Pittsburgh and Poway, California.\n\nmore...",
			"time": 1566241758098,
			"files": "[{\"name\":\"Trump’s transparent attempt to manipulate American Jews.png\",\"thumb\":\"725cacb6c4f7486c37a413e31044df1fd6c0822b-thumb.png\",\"size\":113682,\"type\":\"image/png\",\"original\":\"725cacb6c4f7486c37a413e31044df1fd6c0822b.png\",\"directory\":\"1DjQ1faejBVMQsW9m4aHLSDiH2PUYKVQN2\"}]"
		},
		{
			"id": "58b2546d-3429-4b9d-ad8a-e2717dd04ef1",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "b5923005-3f6e-4dbc-8e42-cdbdfd8adcf9",
			"body": ">>b5923005-3f6e-4dbc-8e42-cdbdfd8adcf9\n\n...continued\n\n>     But the certain failure of the attempt to peel off reliably Democratic Jewish voters bothers me less than the sheer nerve of it.\n>     Israel’s decision to bar Tlaib and Omar from entering the country is a slap in the face to both the American government and the idea of Israel as a tolerant and pluralistic democracy. But the Israeli government didn’t come to it on its own; in fact, Prime Minister Benjamin Netanyahu originally planned to let the two lawmakers visit. Trump instead appears to have actively pressured the Israeli government to change its position, playing a significant role in Netanyahu’s reversal.\n>     The fake concern about anti-Semitism, the attempt to divide American Jews from Democrats and American Muslims, the lack of attention to what’s really threatening American Jews today — the rise of deadly right-wing anti-Semitism and domestic terrorism — it’s all become exhausting.\n>     There are Jews who deserve the president’s concern today. They aren’t the mythical Israelis who could not withstand a visit from Ilhan Omar and Rashida Tlaib; they are the Jews who were out exercising their democratic rights in Rhode Island and were attacked for it. \n\n'''Source:'''  https://www.vox.com/policy-and-politics/2019/8/15/20807031/trump-ilhan-omar-rashida-tlaib-israel-ban\n'''Archive:'''  http://archive.fo/WXJTf",
			"time": 1566241770398,
			"files": "[]"
		},
		{
			"id": "063c2667-e53a-40ef-877a-d9eb8f31ded6",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"subject": "IP Addresses and all that Reporter stuff",
			"body": "You know those threads and articles about how reporters get the IP addresses of people here and all that, well, sometimes I leave my browser open to 08chan (here), but I don't post anything, and I walk away from the computer.\nMy VPN eventually disconnects due to inactivity.\nWhen I come back to the computer, I observe that the site has been updating.\nShould I be concerned or should I only worry if I post something like right now?",
			"time": 1566255039131,
			"files": "[{\"name\":\"geek.png\",\"thumb\":\"3343f566f403b33e2230cad6f3dd8a155ca99642-thumb.png\",\"size\":635915,\"type\":\"image/png\",\"original\":\"3343f566f403b33e2230cad6f3dd8a155ca99642.png\",\"directory\":\"1DjQ1faejBVMQsW9m4aHLSDiH2PUYKVQN2\"}]"
		},
		{
			"id": "6d7d593b-3075-48ef-8cfb-d5ac1410eef8",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "17f22a9d-8c86-440d-a727-262dcc4af749",
			"body": ">>ad02b197-415c-450d-8c66-8b84395a4d3a\n>>fa1625a5-96c0-4ff4-ab3c-3b8e404f5d31\n>>f32fdb46-4053-4b80-aeb2-7aefb6165f78\nlalalala",
			"time": 1566255181874,
			"files": "[]"
		},
		{
			"id": "32aa797b-d77f-4042-95b2-6af53fcc2321",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "063c2667-e53a-40ef-877a-d9eb8f31ded6",
			"body": ">>78113850-7ed6-43a1-8138-7734d7509e43\n>>39ed5901-d4b8-4187-bdd4-4df87059e955\n>'''Should I be concerned or should I only worry if I post something like right now?'''",
			"time": 1566258489103,
			"files": "[]"
		},
		{
			"id": "c93bfd89-245a-49e0-8464-8155e6a655c8",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "62419a4a-e256-4c78-9bf9-ac83cc12cad5",
			"body": ">>62419a4a-e256-4c78-9bf9-ac83cc12cad5\nand you should go back to collecting stamps instead of creating threads because you don't provide links to sources faggot",
			"time": 1566258747601,
			"files": "[]"
		},
		{
			"id": "8270f65f-c863-4ffd-ba00-9f046be61397",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "06797473-4012-4f41-951f-7ccd25332bac",
			"body": "put me in the screencap please",
			"time": 1566258880445,
			"files": "[{\"name\":\"01.jpg\",\"thumb\":\"85fd2a538a84acf9fea7ed1ac718cf38e553cf04-thumb.jpg\",\"size\":1499019,\"type\":\"image/jpeg\",\"original\":\"85fd2a538a84acf9fea7ed1ac718cf38e553cf04.jpg\",\"directory\":\"1DjQ1faejBVMQsW9m4aHLSDiH2PUYKVQN2\"}]"
		},
		{
			"id": "a63bc3bd-5a43-4305-8a49-0f93976c42d1",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "06797473-4012-4f41-951f-7ccd25332bac",
			"body": ">>7040e701-d90c-4afa-b8e7-1f67d228ded6\nyes, but I want to be in the screencap on foxnews",
			"time": 1566262213945,
			"files": "[]"
		},
		{
			"id": "a463df20-2bdd-4d2e-90be-0c6e7893cc5e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "b",
			"thread": "611c2dac-5df5-4cd5-9042-dd329b843bbe",
			"body": "https://cytu.be/r/8chMonsterFedWrestling",
			"time": 1566264282232,
			"files": "[]"
		},
		{
			"id": "c398a0f3-dcaf-4c7e-aeac-e7116baf187e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "bef93890-dd69-47b9-8208-00937dd1b843",
			"body": ">>f6bd4ba0-1b6c-469e-956c-3f81dc6fb8bd\npeople are afraid to come here\n>Spyware\n>Honeypot\n>Captain Picard\n>etc...\nuh, use vpn or tor",
			"time": 1566265600935,
			"files": "[]"
		},
		{
			"id": "dda0583b-2fcd-4f42-83ae-c61b92470e18",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "62419a4a-e256-4c78-9bf9-ac83cc12cad5",
			"body": ">>e47a7835-8dd8-48f0-b3b1-433e295fa7b9\nsatan\nbless your sight",
			"time": 1566270209393,
			"files": "[]"
		},
		{
			"id": "d50de09b-87c3-45cd-944c-e33d5c897a6f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "868d6b02-a11b-4d46-bf84-4b0e038d9b3c",
			"body": ">>d741de5b-7d51-4eb5-8e59-5b6b47c75fca\nThank you anon \nsuper great thread\ndownloaded everything to my special SHTF directory",
			"time": 1566270665738,
			"files": "[]"
		},
		{
			"id": "113da225-b054-4806-95b1-f1ae2e3d0af9",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "bef93890-dd69-47b9-8208-00937dd1b843",
			"body": ">>830b15dd-7cd6-47cb-8f10-8756f3a2abac\n>>9858bebb-f73c-4fae-ae37-a0140e1e0780\nI didn't go to /v/\nI stayed on /pol/ and /tech/\n/n/,  /news/, and /newsplus/ were my other 'go-to' boards",
			"time": 1566270842654,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}