{
	"posts": [
		{
			"id": "0c1c2134-59a8-4568-bd3f-c14aa34e6517",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "bc754fc2-bc5d-4e87-aeb2-efb0221f95f0",
			"body": "Testing... \nEdit: Pushing to peers seems to be much slower than it was.  It was nearly instant in the past, taking about 5 seconds per push to peer.  Perhaps the ZID validation?",
			"time": 1565657193755,
			"files": "[]",
			"last_edited": 1565657286106
		},
		{
			"id": "26ce5bc7-bc10-4bb9-ba36-58e629dc7741",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "4fb1f67d-d094-496f-a5d0-36f221f63876",
			"body": "Glad to be back online, you glorious patriotfags.\nSalute to baker and those who got back up while weekendworkfags were doing our thing.\n\nHell of a news cycle we've had.  Epstein's case files unsealed showing claims against Prince Andrew - and we all know what the counter they pulled was for that.\n\nMy analysis:\n\"Conspiracy No More\"\n\"The Great Awakening (is dead)\"\n\nStandard Modus Operandi is to have people facing criminal prosecution killed who are linked to powerful families.  Reason being is that the criminal trial ends.  No matter how suspicious it is, it prevents a public airing of facts and limits discovery and entering evidence to the court record.\n\nWhy would we let this happen?  Other methods are available to prosecute the same people for the same or similar offenses.  However, provoking them into their standard MO creates exactly what we see.  Virtually no one believes this was a suicide - and the only place tweeting about \"trump body count\" was out of California (where Twitter is located).  Pretty much everyone is of the opinion this was some serious foul play (and I doubt there are many who seriously believe Trump was the one who ordered him to be offed) - and now you have the main stream media reverting to their standard MO of \"you're a delusional conspiracy theorist if you believe Epstein didn't kill himself.\"\n\nConsider we are just now getting ready to launch into FISAgate.  Staging (timing) is important.\n\nMain engine ignition sequence is initiated.  By my count, we're about to see booster ignition.\nOr... maybe this is just the clearing of unnecessary personnel prior to launch, in which case - this is going to be one intense show when it gets going.  (\"And this isn't even my final form!\")",
			"time": 1565658475306,
			"files": "[]"
		},
		{
			"id": "388c9caa-9397-42b4-a3eb-bde432c0b162",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "4fb1f67d-d094-496f-a5d0-36f221f63876",
			"body": "Do bear in mind that mute is not a downvote or a \"hide post\" button.  While I agree that they are being disruptive, muting does basically delete a user from ZeroNet (for you).  Anything they post with that ID will be deleted from your computer.\n\nThis is worth keeping in mind and explaining, because it's not a flyswatter filter - but a nuclear-eraser.\n\nAt least the way the board currently handles muting, it is directly coupled to the muting feature/function of ZeroNet, not restricted to the zite, board, thread, or post.",
			"time": 1565698836965,
			"files": "[]"
		},
		{
			"id": "eaf246f6-f883-4777-85a8-2e4c91537896",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "4fb1f67d-d094-496f-a5d0-36f221f63876",
			"body": ">>1d608084-cda7-4abc-bb62-c359112fed7b\nImage shows as white.  I think part of this is the site code.  I believe they resolved this over on millchan.",
			"time": 1565733070505,
			"files": "[]"
		},
		{
			"id": "34fd64c0-9efa-4932-a3b6-7a065d8fb001",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "4fb1f67d-d094-496f-a5d0-36f221f63876",
			"body": ">>49abfb62-fe63-4b39-a691-f3d33048db54\nI don't think it's the case that you need to set the available site size to 39GB to see the full zite.\n\nPart of this will need to be optimizations made to the zite and ZeroNet to optimize what is stored.  The system really wasn't designed with this amount of traffic in mind - at least, it didn't foresee needing it so soon.  So, the zite prioritizes downloading what you are viewing, but doesn't really favor automatically deleting what you don't need or overwriting.  IE - if you view a thread, it looks to download the entire thread from peers.  Even if that thread turns 2 years old with no posts to it, ZN will not delete it or release the hard drive space back to ZN browsing.\n\nSince most ZN zites are very small by modern standards (megabytes), this wasn't seen as a major problem, and even millchan and some others have not really encountered major problems as the archive was growing only by a gig or so per month, and people would occasionally delete the archives or just expand space to keep in line with their system.\n\nNow, with the zite swelling by gigabytes per week, or possibly even day (it was 16 gigs around a week ago), there's eventually going to be the need for such optimizations and, also, some manner of a consolidation index for file copies - IE - copies of the same image posted here should be stored once and indexed to who claims ownership over a copy (with how ZN works), to cut down on storage space requirements.\n\nThese things have been kicked around in regard to ZN development, but the community was fairly small prior to our little invasion, and it's frankly amazing that the whole network has absorbed the action relatively flawlessly.  If we didn't have the spam scare and fix to bork the site for a few days, it would have chugged along nearly flawlessly.  Spare for the white elephant in the room we're discussing, now - and it's not as though resolving it is impossible - just that no one really saw need to implement solutions for problems that were not projected to be needed for many years.\n\nNow, everyone is looking for a refuge from the insanity of clearnet censorship, and the interest in ZN is viral.  This board would be jumping were it not for fake maga and the hiccup in the zite function.  That really couldn't have come at a worse time than it did, to be honest.",
			"time": 1565743486966,
			"files": "[]"
		},
		{
			"id": "1f152db1-e76a-496d-a3de-c1aebcf039bc",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "4fb1f67d-d094-496f-a5d0-36f221f63876",
			"body": "Edit: - duplicate, other anon already covered.  I iz tarded.\nNow for something actually newish:\n\nhttps://www.msn.com/en-ca/news/world/epsteins-accusers-call-her-his-protector-and-procurer-is-ghislaine-maxwell-now-prosecutors-target/ar-AAFHqYO\n\n>According to many of the women who have spoken about what Epstein allegedly did to them, Maxwell was the financier’s chief co-conspirator.\n\n>Maxwell, 57, has not been charged and has denied any wrongdoing. According to people familiar with the investigation, authorities have had trouble locating Maxwell, who is believed to be living abroad. Her five-story Manhattan townhouse was sold in 2016 for $15 million by a company that used the address of Epstein’s New York office.\n\n>Her lawyers told a judge in 2017 that she was in London, but had no fixed address. Lawyers representing Epstein’s alleged victims said they wouldn’t expect Maxwell to return to the United States anytime soon for fear of being arrested. \n\n>Martina Vandenberg, founder and president of the nonprofit Human Trafficking Legal Center, said she was “thrilled” to hear the prosecutors’ announcement that the investigation would continue, saying it would encourage more alleged victims to come forward.",
			"time": 1565743914797,
			"files": "[]",
			"last_edited": 1565744219064
		},
		{
			"id": "aeee29da-8c88-48c9-bc62-d5a7af2dfbce",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "4fb1f67d-d094-496f-a5d0-36f221f63876",
			"body": "https://news.yahoo.com/hong-kong-airport-resumes-flights-000118944.html\n\n>HONG KONG (Reuters) - Hong Kong's airport resumed operations on Wednesday, rescheduling hundreds of flights that had been disrupted over the past two days as protesters clashed with riot police in a deepening crisis in the Chinese-controlled city.\n\n>Ten weeks of increasingly violent clashes between police and pro-democracy protesters, angered by a perceived erosion of freedoms, have plunged the Asian financial hub into its worst crisis since it reverted from British to Chinese rule in 1997.",
			"time": 1565744381909,
			"files": "[]"
		},
		{
			"id": "b8aa4a5b-2eed-4738-bdd7-ca911757f21e",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "4fb1f67d-d094-496f-a5d0-36f221f63876",
			"body": "This is one I think will end up developing into a new battlefront:\n\nhttps://twitter.com/miakhalifa/status/1160953680528494592\n\nhttps://nypost.com/2019/08/12/mia-khalifa-claims-she-made-only-12k-doing-porn/\n\n> Mia Khalifa claims she made only $12K doing porn\n\n> “The turning point, of course, was when I did the hijab scene,” she said. “That is when the ISIS death threats came in, all of the news broke out — globally. Not just in America. It was trending on Twitter, it was all over the news. I was banned from a handful of countries…Egypt…Afghanistan…Very Muslim countries were deeply offended by it — and I’m Catholic. So to me it wasn’t, ‘Oh yea, this is bad.’ What I actually said when they proposed the scene to me, and this is verbatim, was: ‘You motherf–kers are going to get me killed.'”\n\nBoobs\nMuslims\nExploitation of Sex\n\nI'd say that front is going to be coming to a head here, shortly.\n\nTrack with:\n\nhttps://twitchy.com/brettt-3136/2018/09/18/celebrity-attorney-michael-avenatti-tells-chris-cuomo-trump-should-pull-kavanaughs-nomination/\n\nhttps://www.westernjournal.com/cnns-cuomo-skips-avenatti-arrest-story-rest-network-ignores/\n\n>CNN’s Chris Cuomo did not cover the arrest of Stormy Daniels’ attorney Michael Avenatti on domestic violence charges on his program Wednesday night, and the rest of the network dedicated scant time to it the entire evening.\n\nThere's more to come from this, I would imagine.\n\n>>57a6e1e0-e673-4787-96bb-3ca05ce77767\nNegative on the picture, anon.",
			"time": 1565746217377,
			"files": "[{\"name\":\"2019-08-13 20.12.48 twitter.com 9a963e842588.png\",\"thumb\":\"0b626f025e50c5f72f2f18dd08b23870419f2b93-thumb.png\",\"size\":137393,\"type\":\"image/png\",\"original\":\"12f4d64812c1b59308910685bfb56adea49bb41b.png\",\"directory\":\"17GmcqqqJdfEM4DkRsqvvprifPVwYx575h\"},{\"name\":\"2019-08-13 20.25.27 twitchy.com 74f39ce06366.png\",\"thumb\":\"c008b223f667a86902b356e0579d57ecf1409f38-thumb.png\",\"size\":235274,\"type\":\"image/png\",\"original\":\"2d5aa5d0ad30a6c048faa560dedcc2513aceaf3b.png\",\"directory\":\"17GmcqqqJdfEM4DkRsqvvprifPVwYx575h\"}]"
		},
		{
			"id": "cedefca0-d394-4d8d-a011-b3464191ee4b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "868d6b02-a11b-4d46-bf84-4b0e038d9b3c",
			"body": "Preparation is key.\nThis does not just mean material preparation, but social and intelligence preparation, as well.  Having a good idea of who is around, what they are about, and how they stand with regard to SHTF goes a long way.\n\nDeveloping a plan of action with others in relation to disaster/emergency preparedness also goes a long way.  Even if it is a simple: \"meet here\" - people in the face of chaos tend to freeze.  10% panic into hysterics.  80% freeze in place to await prompt.  10% begin acting.  At least among people who are untrained/disciplined in the scenario.  Staging plans gives people a go-to list of actions to stave off the consequences of leaving them to getting swept up into the hysterics of the 10% who are going to go nuts.\n\nAs for physical preparations, this really depends on the scenario.  I live in the midwest - so our main concern in the immediate aftermath is going to be dealing with outflow from the cities.  Crops will have to be secured against hungry fools trying to eat sprouts in spring, stocks of grain will have to be secured against raiders to prevent regional warlords from developing and so on and so forth.\n\nThe next biggest concern will be delivery of fuel for transportation and rationing thereof.  Trucks, trains, boats, etc need fuel for transport.  There may or may not be local/state officials left alive - kind of depends, but there will be a hierarchy that is established in its place rather quickly.\n\nCrop planting cycles will need to be immediately re-evaluated and planned based off of maturation times and time of year.  Food distribution outside of the local sphere can't be relied upon, so there will need to be adjustment made.  Livestock will also need to be secured and priority placed on breeding for at least two seasons.\n\nPower will be a bit interesting in light of the power grid.  The midwest would actually seek to isolate itself, to some degree.  We have nuclear and hydro power in our district, with coal supplementing for cities.  I doubt power will be that big of a problem for us.\n\nHowever, if you are some poor bastard in a city - then your immediate concerns relate to not only the social atmosphere, but also resources.  Most people have less than three days of food on hand.  For three days, people will largely not panic, no matter what is going on.  You are going to generally have that amount of time, at least, to begin making some plans with your neighbors.  They aren't going to get desperate/violent until they are hungry, the overwhelming majority.  You'll have a few idiots running out to join the protests or whatever is causing the upset - but you're not going to do that, because you don't want to be a statistic.\n\nBy this point in time, it's generally too late to begin preparing physical resources.  If you don't have them, roll dice as to whether or not you're going to find it at the store.  People will be orderly at first, but evaluate, carefully, how best to spend your time standing in line to buy the last thing - or getting your shit together with the people around you.\n\nSmall networks are going to be key.  Research Dunbar Layers - over about 150 people, you'll begin to see internal fracturing and infighting develop without some governmental tools to structure everyone.  In the absence of government, about the largest group you're going to be able to keep coherent is 150.  Keep that in mind.  You'll be looking at, effectively, tribal councils and similar such constructs to network between groups of that size.\n\nChances are, you're not going to be killing anyone.  People are naturally risk-averse and fighting implies risk.  Understanding this is important - most people will back down at the threat of force, and will only escalate over something direly needed or if they see you as having committed a taboo worth beating/killing you over, so have a good idea of whose taboos you're about to run afoul of.\n\nLong term stays in the city will not be sustainable at current population densities.  Resources will deplete and cities will have few activities those out in fly-over territory care to carry food in to trade for.  Regions with sufficient sprawl may be able to adapt, but highly compacted metropolis settings will need to have a plan for dispersing into rural areas - and interfacing with the people there... calmly.",
			"time": 1565748469653,
			"files": "[]"
		},
		{
			"id": "1f4e5287-496a-4601-8d95-61cec9cfd737",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">>6f1e9601-15ff-41d0-8c08-da01cc6f9bbd\nSounds reasonable.\nLeft and Right are talking about Epstein being \"suicided\" - to the tune of the media sounding insane suggesting it isn't a conspiracy.\n\nLet's go out and start shooting people.  Sounds like a great way to distract the news from the main stream population openly saying: \"No, conspiracy makes more sense here, MSNPC - what the fuck is wrong with you?\"\n\nClearly, the most sane, rational thing to do at this point in time would be to start violently assailing politicians, antifa, or some random leftist.  There is no way that would at all disrupt the justice system that has finally begun to move on various \"elites\" or the news cycle that has people comparing Epstein's suicide to Jack Ruby's shooting of Lee Harvey Oswald.",
			"time": 1565750893380,
			"files": "[]"
		},
		{
			"id": "b2e31e82-5a0f-47a8-a1a5-0ba73ca70d21",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "4fb1f67d-d094-496f-a5d0-36f221f63876",
			"body": ">>fcc744ad-0d46-4e64-8147-252e6b18e96c\nI think it has less to do with race than it does culture - which is, at least currently, heavily connected to race.\n\nWe had a gifted education program here in town - two of my fellows in it were black (well, technically they were from an interracial marriage - but not withstanding).  Their culture was generally 'white/western.'  When we talked, it was as any other midwestern teens would to each other.  We had some conversations about things like how vulnerable they were to sunburn (or how they had to think about vitamin d in higher latitudes), how hair follicles were different, etc - but, we had more white kids trying to be ghetto like they saw on television than there were actually black people trying to be ghetto.\n\nThe culture of America is the Constitution.  It is the idea that a nation can be defined by law rather than tribe or territory, alone.  What makes us American is not that we were born here - but that we have taken to this idea of a government that is comprised of laws as emergent principles of society.  A government isn't free, under American culture, to decide whether or not people get to bear arms.  A government must submit to the fact that a population can and will replace it should it fail to serve their interests.  It's not a permission granted, it's an observation that the torches and pitchforks come out when abuses of power are felt.\n\nJust as an example.\n\nIn a sense, one can think of our culture as being a franchise model of government - the idea that a people can implement a very similar system and see a similar string of successes to our own.\n\nIt is, however, necessary for a nation to preserve its culture and the territory in which it resides.  A nation in which there is no border or culture will eventually evaporate and cease to exist.\n\nThose who seek to see our race destroyed may genuinely hate our race (I have a theory on that, but it's shooting from the hip), but just as critically, they despise our culture.  We come from the orations of Cicero - the critics of kings and ruling castes, and our humor is that of Gulliver's Travels - when sunlight from cucumbers and food from shit was the meme of the day to describe the insanity precipitating from the ivory towers (... I am sure Swift would about die of laughter at the material we've since given him, literally trying to produce food from shit).",
			"time": 1565752289523,
			"files": "[]"
		},
		{
			"id": "f98d1c84-dd00-462e-b520-5561802465f9",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "97156e18-7188-4c78-9061-fae6bd1cb916",
			"body": ">>97156e18-7188-4c78-9061-fae6bd1cb916\nThere are two DDoS options:\nCloudflare (google)\nAmazon (... totally not an anti-trust with google)\n\nSo, the answer to that is that it's dead in the water for the foreseeable future.\nThere is a third possibility, that some form of government or military hardware could be stood up to provide DDoS protection for 8chan as a free speech platform (versus a publisher, which Amazon and Google clearly are) - but I wouldn't hold your breath for that to happen.\n\nSo, the answer is \"indefinitely.\"\n\n>>fce0678f-1674-4e8b-bdaf-aa200785691f\n>Imma glownigger and 8chan is a honeypot!\n\nRight, because a board for free speech is a honeypot because glowniggers go to it to publish violent rhetoric and other such things for journalists to then say: \"see!  the only people who go there are crazies!\"\n\nGo sodomize your prostate with a cactus.\n\n>>57ebb4d9-8a96-4605-a9c1-68528a5947f4\n>collective consciousness\n.... Yes.  4chan is an excellent example of why I choose to be an individual, right now.\n\n>>1ee9af59-7751-4c04-95fe-20720fe74d01\n>redpill the feds\nI already did that.  Like five years ago.\n\nYou all called him a nigger and persist with a preference for an apocalyptic civil war.  So... how to you engineer a government psy-op to calm down a bunch of paranoid autists while you wei-wu-wei the government back into being a republic?\n\n>>dd2fe9f8-f80f-4222-a73c-e0f4312c0012\nHe may, but that is ultimately beyond his control at this point, unless he has a cache of hardware or some other company does that no one knows about.  I'm not denying the possibility, but there's really only one purpose for it at this point, and that is the tripcode salt on the servers.  Beyond that, the whole of the proverbial clearnet can be stepped away from.  Though I suppose that is a bit of my own bias showing through.  Obviously, a place for people to escape the censorship of facebook, twitter, reddit, etc without having to go fully over to the proverbial dark side would not be a bad thing, but it seems like a step backward, frankly.",
			"time": 1565806866285,
			"files": "[]"
		},
		{
			"id": "805dd312-a6cd-4ac9-a7d4-ea7eecd3438c",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "4fb1f67d-d094-496f-a5d0-36f221f63876",
			"body": ">>5327dc79-9585-4df9-bb69-9d74314556cc\nBanned from where, anon?  Halfchan?",
			"time": 1565806956503,
			"files": "[]"
		},
		{
			"id": "e2e17b17-f177-4c73-8c58-ed87b878fc2f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">>9d01a72d-926c-4f9e-8d3d-d712d4f019b6\nTo be fair, I would argue their strength is largely an illusion.  Perceptions can change fast and a clever person could successfully start and prevail with an armed revolution if they took the proper precautions and had some key backing.\n\nGeneral strategy I wargamed was basically a \"giveth and taketh\" approach.  The system currently controls people via the monetary system and workday/week by extension.  Unplugging a section of society from that economic network and connecting it to an alternate one that is staged and ready to provide, first, the bare necessities of food/water/shelter and second the expectations of communication, transportation, and power/utility - you could sweep people out of the federal reserve and media complex.\n\nStaging this during the proper time to reduce disruption and manage the environmental challenges (throwing a revolution in winter, for example, would need to be prepared to consider the impact of loss of power on the population and a means to provide it).\n\nYou would, preferably, avoid collapsing cities directly (or do so at the outset to destroy their influence) and instead leverage their dependence on imported food/supplies to flip them over to a different economic system - whatever that may be (even a simple fiat system could work as an interim - but long term stability would mandate transition to something like a metal or maybe a crypto, but those are experimental as to how they will prove out in the long run).\n\nThis revolutionary method favors seizing areas of general production (agriculture and mining/manufacturing) to somewhat limit the ability of a military to directly influence control - as attempts to occupy and force a region to support the government would be met with scorched earth, which can be initiated by a very small percentage of people and the general public evacuated/secured into other regions.  Obviously, it would be better to conform to the ideology of those who are the producers of raw materials in society, and one would need their ideology to at least be willing to harbor a revolutionary front.\n\nWe are somewhat seeing that currently.  The election of President Trump was more or less a final act of political confidence.  People here can say what they will about whether or not he is comped - but if one tracks the industrial re-investment that is sweeping the nation, right now, it becomes rather obvious to me that the revolution is already unfolding - it was simply not necessary to invoke violence.  It will take time to complete, and the benefits of it will only truly be realized when we are off of the federal reserve system... but the mines and refineries are returning.  Factories are tooling up with new machines (what people don't seem to fully realize is that the last major wave of investment in the U.S. manufacturing came in the 90s.  Many companies in the U.S. are clunking along with machines from the 60s, trying to compete with ultramodern automated equipment being installed in China and Taiwan; if China had an industrialized culture that understood the concepts of engineering, they would be coming out with stuff we literally can't make - already, they can produce as a manner of pushing buttons a degree of accuracy we have to struggle to replicate using antiquated methods - this is now changing... slowly, as the hook nosed spreadsheet warriors can't stand to part with millions of dollars today to make ten times the product tomorrow... but these are also the same idiots who have tried to run machines for 20 years without maintaining them, so they'll be forced to do something before too much longer).\n\nBut... I digress.  I see plenty of changes coming that are generally positive for the manufacturing and industrial landscape - and that means national independence from the global economy, which is how we have all been more or less coerced into using the federal reserve.  Every nation should have its own manufacturing industries capable of providing its own economic bases.",
			"time": 1565809144781,
			"files": "[]"
		},
		{
			"id": "2f7b32c3-6b16-491a-b903-1a2d4e31a2ba",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "4fb1f67d-d094-496f-a5d0-36f221f63876",
			"body": ">>1ee7d968-dda1-4740-b10b-294a249763a9\n> Institutions\nI will simply say what my father once told me: \"Remember, if you're ever alone in the room with two insane people, you are the insane one.\"\nThat pretty much sums up my concerns regarding institutions.  I track Q not just because I suspected some group like Q existed, but also because I do not trust the government any farther than I can throw it.  You may be thinking shopping carts, but I've been harassed and threatened with having medical holds placed on me for entertaining 'conspiracies' and other generally inquisitive behavior I associate with being a free and intelligent human being.\n\nI'm going to be logically consistent and say that as we joke about liberalism being a mental disorder, we are also now talking of bringing back mental institutions with the power to forcibly mark someone as requiring detainment.  If this were the prior administration saying these things, we would be up in arms - and while I agree there is a problem with regard to mental health and illness, there is an undeniable orwellian aspect to the sum product of rhetoric amounting to political re-education camps.\n\n\"mandatory fun camps\" - remember that whole routine?\n\nI'm not saying I know how to address the problem - but I will say that history is marred by examples of people abusing such authority to the extent I honestly question the need to establish such an authority.  Outreach to the homeless and disenfranchised seems a better way to address the problems you are citing, not granting the government the power to define, without due process, a person who can be detained and imprisoned on the suspicion they might commit a crime.\n\nCrimes are acts, not thoughts or even states of mind, as the law defines.  Creating a category of, effectively, thought or mentality crimes is a boundary where the claws come out.\n\nJust because I particularly like President Trump or may even trust him - that means zero in the grand scheme of things.  He will be in office for, at most four more years (or... five - you get my point) - any government policy which requires us to trust in the good nature of faith of our leadership is one not only destined to failure, but complete subversion to become a pathway to abuse.\n\nThe government must always be bound up tighter than a BDSM fanatic and beaten just as thoroughly into subservience.  They are not people.  They are furniture.\n\nThat was the first thing we were taught in the military - in effect - we are not people or individuals in that uniform.  We are part of a monolithic construct in the mind of the people and our actions are those of that fixture of society.\n\n>>95039214-e439-4e67-94b8-0c3281c2032a\nI had to unplug for a few days.  Many people either never made the jump, or were scared off by the disinfo campaign.  Then you have a few other people who already had their little bunkers picked out and don't really want to come out from them.\n",
			"time": 1566079189167,
			"files": "[]"
		},
		{
			"id": "afa6c7ad-7675-4a1f-9f3c-08afa8a74602",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "4fb1f67d-d094-496f-a5d0-36f221f63876",
			"body": "Hmm... from a platform stance, I am not sure it is a good thing that we are being associated with an ID.  The defacto \"anonymous\" title on 8 was there because it really didn't matter who we were for our posting.  It wasn't so much to 'hide' who we were, as much as it was to prevent the establishment of identities that were not relevant to the function of the board.\n\nNot that I wouldn't occasionally identify who I was for a post or string of IDs when it was relevant for the people I believed to be watching - but the establishment of permanent IDs and personalities can be a bit of a pain in the rear.  There again, everyone was quick to try and call each other out for being some controversial figure or another from the board's past, so ... eh.\n\nThe UI is overall better, however, it seems.  Kind of surprised the zite transitioned as well as it did, to be honest.\n\n>>2ec47473-0b23-4081-b61f-6c9763cb8835\n\nLooks like, assuming it is legitimate, a document/memo regarding the army's efforts to monitor cryptocurrencies and anonymous networks for criminal and/or foreign actors' behavior.  Nothing all that new, we knew they could identify Tor users if they really wanted to.\n\nIt could also be interpreted that they are looking to develop an anonymous cryptocurrency - which I would insist there is no doubt they would do as part of their efforts to study how they work and could be influenced at stages of adoption.  Though one would have to question the ethics if real money/investment gets involved.\n\nThey seem particularly concerned with \"CryptoNote\" - which means they are looking specifically at Monero, which uses Crypto-Night.  It uses a double-blind method of handling addresses and obscures transaction histories.  Which is specifically why I like it, as it's nearly impossible to say \"the coins in your possession were used to buy stolen goods and we need to beat or humiliate you until you return them to the victim.\"  - IE - the currency is fungible.  There are also some nifty ways for generating an audit report.  I can, for instance, submit a cryptography key that generates a report of my transactions for a given year so that tax or other accounting goals can be satisfied.\n\nThey are looking at a tough nut to crack, and while I do support the creation of a cryptocurrency that is impossible to crack even with all the king's horses and men - it is also important to note that the early adopters of such things are going to have an over-represented amount of criminals and hostile entities among them.\n\nIn that sense, I would say that I welcome their efforts insofar as I hope they eventually meet a challenge they can't address through automated monitoring and have to go back to gumshoe detective work.\n\nhttps://u.today/what-is-cryptonight-cryptonote-vs-cryptonight\n\nhttps://en.wikipedia.org/wiki/Monero_(cryptocurrency)\n\nThe dates line up - 2017 was a big year for LEO/MIL in relation to Monero.",
			"time": 1566418351794,
			"files": "[{\"name\":\"2019-08-21 15.02.52 u.today d50555caf821.png\",\"thumb\":\"0a1fa1209418f16c98c77c46dce059303a646ced-thumb.png\",\"size\":63453,\"type\":\"image/png\",\"original\":\"0a1fa1209418f16c98c77c46dce059303a646ced.png\",\"directory\":\"17GmcqqqJdfEM4DkRsqvvprifPVwYx575h\"},{\"name\":\"2019-08-21 15.03.54 u.today 1a99295119fb.png\",\"thumb\":\"c01b91a3b96dcfd01f74f8bcf70db471e61b38a1-thumb.png\",\"size\":43997,\"type\":\"image/png\",\"original\":\"c01b91a3b96dcfd01f74f8bcf70db471e61b38a1.png\",\"directory\":\"17GmcqqqJdfEM4DkRsqvvprifPVwYx575h\"},{\"name\":\"2019-08-21 15.06.00 en.wikipedia.org 0cd2310089d0.png\",\"thumb\":\"b3b8451b41755a4d9824d9b8f691a6d730f0609f-thumb.png\",\"size\":75092,\"type\":\"image/png\",\"original\":\"b3b8451b41755a4d9824d9b8f691a6d730f0609f.png\",\"directory\":\"17GmcqqqJdfEM4DkRsqvvprifPVwYx575h\"},{\"name\":\"2019-08-21 15.06.58 en.wikipedia.org 441cefbcd14f.png\",\"thumb\":\"12b3e9526d4d5899c3f22e5816a63a3415186ad7-thumb.png\",\"size\":40711,\"type\":\"image/png\",\"original\":\"12b3e9526d4d5899c3f22e5816a63a3415186ad7.png\",\"directory\":\"17GmcqqqJdfEM4DkRsqvvprifPVwYx575h\"},{\"name\":\"2019-08-21 15.09.58 en.wikipedia.org 3d77e59beab8.png\",\"thumb\":\"e56423f3394cbdad873a25e26baa2e94c8a92061-thumb.png\",\"size\":100031,\"type\":\"image/png\",\"original\":\"e56423f3394cbdad873a25e26baa2e94c8a92061.png\",\"directory\":\"17GmcqqqJdfEM4DkRsqvvprifPVwYx575h\"}]"
		},
		{
			"id": "4482007d-9c04-40b2-a268-3d152256ef22",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "4fb1f67d-d094-496f-a5d0-36f221f63876",
			"body": ">>1dbeb21d-4a3a-47eb-9c22-f9127bd9502a\nI say as I post using a screen name.\nI don't think it's a problem with zeronet so much as it is the defacto design of the zite.  It's less to do with the ability to find out who I am, and more to do with how I am displayed as being who I am.\nMillchan boards were designed more in the vein of BBoards, and thus our ZID is our user/screen name, more or less.  Rather than activating it via email, that's handled by ZID's system.\n\nTo truly go after the idea we are all anonymous as was done on 8, we should be shown as anonymous and maybe each thread should have a similar hashed ID for display.  Obviously, if one still wanted to, they could find out who was whom by virtue of how zero net works - but I think you get what I mean.\n\nAnyway... from the pol board:\nThat huge red spike on the left is us.  If you want to know just how powerful the Q movement is and how effective that disinfo campaign was - there it is in the statistics.  Those weren't bots.  It was nearly impossible for them to be bots if they went through the hoops of downloading programs to get here and posting.\nThe disinfo injection was effective.",
			"time": 1566422279594,
			"files": "[{\"name\":\"625c31063f3ba1f97ffd13376d19b08b514662e9.png\",\"thumb\":\"fdf29f05d15b55fdb92e884bffd441d2a78c80ac-thumb.png\",\"size\":114103,\"type\":\"image/png\",\"original\":\"fdf29f05d15b55fdb92e884bffd441d2a78c80ac.png\",\"directory\":\"17GmcqqqJdfEM4DkRsqvvprifPVwYx575h\"},{\"name\":\"b91e37c3aba60234d51013514abb55243f6d8adc.png\",\"thumb\":\"aaf3cf6c58675070ec1ce3edddf1136080a92e6f-thumb.png\",\"size\":6389,\"type\":\"image/png\",\"original\":\"aaf3cf6c58675070ec1ce3edddf1136080a92e6f.png\",\"directory\":\"17GmcqqqJdfEM4DkRsqvvprifPVwYx575h\"}]"
		},
		{
			"id": "39deaca1-e228-47a1-b189-c45910d75476",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "4fb1f67d-d094-496f-a5d0-36f221f63876",
			"body": ">>0a0347ea-21d6-4f7a-9694-5e432cab625d\nWhile I will point out the influence, I also think it's important to not fall into the trap of accusing people.  It was a stressful time and while there are some I have noted as being particularly subversive, they were already pegged as being in it more for the influence than anything else.\n\nI will just say this, the general Q movement I've seen on Twitter (which I wasn't a hugely active part of) has largely devolved into trying to have political arguments in 240 characters, or whatever it is Twitter truncates things to, with bot nets and planted agitators.  The lurkers who kind of mined the place for good ideas and memes have been cut off from that central hub and are kind of defaulting back to old patterns of behavior, granted more emboldened and a little less frantic than they were before.  There are some things that subversion can't change about a movement and its people - not overnight, at least.\n\nI will also say that of all the things I've posted about related to Q on faceberg - only one thing has been singled out for additional comment by someone - and that was a comment about being on 08.  There are two ways to interpret it - either the fear is so real that people are going out of their way to try and keep us from being preyed upon (not unlikely); or the effort to keep us contained on known platforms is so aggressive - that they are interacting on a basis that they have not, before.\nWell, I stand corrected, there have been a few other posts related to spoopy stuff that doesn't really need to be aired here.\n\nI'll give everyone the benefit of the doubt for the most part.  People with reputations to protect can be especially vulnerable to these types of tactics.  As anons, we can be an idiot one moment and a genius the next, and no one is any the wiser that the two things came from the same person.  If I am an account with a reputation, however, then everyone bewares the fool before embracing the genius.  Given a situation where one can easily be shown to be a fool, most will avoid the risk and it takes a massive amount of confidence and ego to recommend a change from the status quo.  Remaining on Twitter, faceberg, etc and awaiting orders from Q is the 'status quo.'  And, generally speaking, it is not as though they are being harmed by doing so.  They are simply disconnected at a time when, if we believe there is a plan and this is part of it, the patriots are in control.  So - it's frustrating, but otherwise rather harmless.\n\nOn the other hand, embracing something new is the potential risk.  \"Are we being set up?\"  \"Are the people there trying to subvert the movement?\"  etc.  etc.  There is the potential we will be seen as the ones trying to divide the movement, somehow - and so it takes quite a bit of nerve to jump aboard when you don't have the \"official\" title to back something.",
			"time": 1566456923564,
			"files": "[]"
		},
		{
			"id": "5de6b41f-c8dc-42b5-bacf-a18e55ab54ea",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "4fb1f67d-d094-496f-a5d0-36f221f63876",
			"body": ">>3029f430-ad9e-439e-a502-432a25e7aa72\nTools called \"web crawlers\" \"spiderbots\" or \"webscrappers/scrapperbots\" are out there.  I've been looking into them, recently.  The idea is that the bot goes through and crawls the domain, finding links, pages, files, etc and downloads them.\n\nIt works better with older sites, generally, and you need more advanced bots if you want to get stuff that is attached in flash plugins or the like (some sites have a flash player plugin handle download links).\n\n>>e419f6c4-34c0-4551-a6cd-85e7208ac648\n>cannibalism is kosher, now\nAnimals will cannibalize out of survival and, generally, we recognize animals as intelligent based on their ability to identify members of their own species.  Many animals we associate higher orders of intelligence to will not eat their own - some even if it is the last thing available to eat.\nEven if we were in some kind of dire survival strait and needed to consider repackaging humans into hotdogs after death (why wait?!), the fact that kuru tends to befall those who consume human meat is a bit of a concern related to the practicality of that solution - and even then, I would consider it survival of the species at the cost of their soul.  If we are killing and eating each other on a civilization scale, then wars of attrition for the sake of depopulation seem, somehow, less sinister an alternative.\n\n>>5000ba0f-635c-4ddc-a465-addf804ade8e\nI'm not disagreeing, really - obviously, I'm more a proponent of things, here.  But it is what it is.  \nActually, though, this system is relatively convenient for Q, after thinking about it.  All Q would need to do is post a ZeroID that he has secured, and the way ZID works is inherently cryptographic and makes it so that only Q - or those with the cryptography key - could disperse.  Of course, this comes in the form of a file and is, therefore, different than a trip code that can be typed in and is salted/hashed by the server.\nIt would be problematic in the event Q's trip was compromised, as well, as it would mean that any and all posts he's made could be changed.  Though I expect the difficulty of breaking it is next to zero - the odds of it being physically compromised by humint is higher.\n\nThings worth considering from a current state of things as well as issues that could be addressed with how things work on ZeroNet at a later date.",
			"time": 1566524821066,
			"files": "[]"
		},
		{
			"id": "186c7672-63b6-45da-8f96-7987ae81d747",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "4fb1f67d-d094-496f-a5d0-36f221f63876",
			"body": "https://www.thecut.com/2019/08/ghislaine-maxwell-family-twin-sisters.html\n\nhttp://archive.is/bM9Vp\n\nNow this is an interesting article.",
			"time": 1566594521485,
			"files": "[{\"name\":\"2019-08-23 16.06.02 www.thecut.com 295cd8fbdd0f.png\",\"thumb\":\"ae7879ea2d5e1968b07b1888ae966b5c1228f8fb-thumb.png\",\"size\":257403,\"type\":\"image/png\",\"original\":\"ae7879ea2d5e1968b07b1888ae966b5c1228f8fb.png\",\"directory\":\"17GmcqqqJdfEM4DkRsqvvprifPVwYx575h\"},{\"name\":\"2019-08-23 16.08.10 archive.is 7b783185b2c5.png\",\"thumb\":\"7f6342963ce5ea624215917aa2f3aa4161c289f5-thumb.png\",\"size\":102355,\"type\":\"image/png\",\"original\":\"7f6342963ce5ea624215917aa2f3aa4161c289f5.png\",\"directory\":\"17GmcqqqJdfEM4DkRsqvvprifPVwYx575h\"},{\"name\":\"2019-08-23 16.08.28 archive.is 2c7a67fd2066.png\",\"thumb\":\"081edea66016618b0c034ea4a0a6db49dec371c1-thumb.png\",\"size\":76634,\"type\":\"image/png\",\"original\":\"081edea66016618b0c034ea4a0a6db49dec371c1.png\",\"directory\":\"17GmcqqqJdfEM4DkRsqvvprifPVwYx575h\"}]"
		},
		{
			"id": "d1ba715d-b601-47ee-8360-02d1fe4c23a0",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "4fb1f67d-d094-496f-a5d0-36f221f63876",
			"body": "Been away for a few days, but some interesting stuff has been happening in other spheres I monitor.\nA summary of \"KickVic\" is a bit much to get into - but suffice to say that \"Me Too\" false accusations tried their hand against a voice actor for anime several months ago, and they've submitted dreams into court as claims.  .... I'm not joking.  They've been getting their legal asses handed to them, and there has been some question regarding the company \"Funimation.\"\n\nFor those who don't know, most anime is produced in Japan - that is where the writers, directors, animators, and intellectual property rights are held.  There are three main studios for dubbing and licensing distributions of anime here in the U.S. - Funimation, Viz, and Aniplex.  Funimation was bought by Sony a while back and effectively has a monopoly on most dub processes (which is why many English dubs all sound the same.... they use the same ten people to dub everything).\n\nPerhaps one of the first major Anime titles to become mainstream popular in the U.S. aside from Sailor Moon was Dragon Ball Z, which Funimation did the dub for (well... there was Ocean... but that's been a lifetime ago).  The \"Me Too\" claims came out of staff who voiced English Dragon Ball Z, and it's been a looming licensing fiasco for some time.\nThen - we got a leak from inside the studio - for... reasons that can only be described as \"these people are stupid\" - the studio decided it would record a bunch of gag scenes, complete with the licensed OST and sound effects, using the voices of the DBZ characters - which included a gay orgy and even an incestuous scene.  While the 'joke' is in poor taste and of highschool mentality... the company not only made these recordings, but decided it was a great idea to keep them around.  So - the people saying \"pound me too\" on Twitter, submitting dreams as evidence in court, are on tape having a blast recording homoerotic orgies and incest.  Which is far worse than what they were accusing Vic of (which was, effectively, being Joe Biden).\nThis was followed up almost immediately, the next day, by an affadavit filed by an acquaintance/friend/coworker of Vic, which alleged that Funimation had a massive culture problem and that one of the individuals there was running a casting couch.\nIE - he was requiring sexual favors for promotions and voice acting gigs.\n\nThis has already begun to spill over, as normies went on a Tumblr dig on a producer for \"Forever 12\" and found her to be a raging pedophile.  Granted, Netflix terminated her contract in the first year for inappropriate behavior - but it should be noted she was basically writing the \"pedophile stalker blog\" about trying to photograph teenage boys at carnivals - so....\n\nThe Power Normies are starting to get into the digging game, and the results are spectacular.\n\nRelated Videos:\n\nhttps://hooktube.com/watch?v=011fCsE0NBw\n- The audio leaks.\n\nhttps://hooktube.com/watch?v=8YKgykDUd7c\n- The claims of culture problems.\n\nhttps://hooktube.com/watch?v=rxoOwF4sK8Y\n- ShoeOnHead goes on a Tumblr Dig.\n\nThey may or may not be from 8chan or Qresearch at one time or another - but there are thinking human beings out there holding down the fort and pushing back.  It has yet to hit the political sphere, but we know how networked these people are and Shoe immediately brings up Epstein as an aside.",
			"time": 1567468580847,
			"files": "[]"
		},
		{
			"id": "7459d9e4-f86b-47b4-8a23-f32fe391af1a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": ">>3e302f9c-ee28-48f3-bdcb-96ada3ada30f\nIt seems to me like we should be looking at a distributed ID generation system that kind of nips all of this in the bud.\n\nI think we should really be looking at trying to integrate this whole thing with CryptoNight - IE - Monero, and its blockchain for handling who owns what and how.  There are two reasons for this - first being that the system should be distributed, but that at this point in ZeroNet, trying to start up a blockchain system specifically for it seems impractical or prone to centralization, anyway.  Monero's system is largely double-blind, allowing for things to be organized and precise without massive amounts of datalogging or tracking.  It also allows for audits to be performed of transactions using provided keys - IE - you can verify you are the owner of a transaction and what occurred in that transaction.\n\nThe second reason comes down to one I've said for some time - cryptos lack a 'real value' - so they will be looking for a way to hook themselves into being something more than an investment system.  Integrating Monero and its blockchain operation with ZeroNet gives a value to the currency and its existence beyond simple market capitalization/investment.\n\nThere again - I'll also admit to being a bit biased in my assessment of the crypto landscape and am looking very high level and not really at technical details of how the two would be integrated.  Just some food for thought, I suppose.",
			"time": 1567469759147,
			"files": "[]"
		},
		{
			"id": "81d0cbd5-ea40-4ceb-a86e-4e0b96d08b8d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": ">>bec2e31a-9135-4bcc-8efc-73e351ab170d\nThe idea is more as it pertains to ZeroNet's ID/ownership of file system than it does with 08 specifically.\n\nThe reason I propose an integration of the two systems is because Monero has a dedicated blockchain and group running it, already.  Starting up a new blockchain simply for ZeroNet to handle ID/ownership like ZeroID does, but distributed, would be so niche as to be effectively centralized.  Currently, all Monero is doing is supporting the integrity and functions of its currency - but there's no real value to mining beyond earning a share of market capitalization.\n\nWhile I use monero as a specific example - my reason is that mining in the world of cryptocurrency really only supports cryptocurrency - though I suppose you could make the argument that etherium does make the attempt at doing something useful with its mining network - they have hit some rather steep limitations in terms of what is and is not practical on that platform.\n\nFrom a logical sense, a decentralized currency run over and within a decentralized internet that rolls the functions of mining into the functions of network authenticating/identification, and potentially doesn't interfere with being a zero net file server.... \n\npotentially creates the platform for both a decentralized monetary system and a decentralized internet.  At least insofar as TCP/IP infrastructure supports.  Obviously, we can't get around that as easily, and there are obviously advantages to having \"white matter\" between the works.\n\nFor example, if the act of mining, say, monero, was also part of how requests to submit and change files on ZeroNet was processed or authenticated, you have effectively turned the operation of cryptocurrency mining from simply another form of a printing press into a real economic contribution outside of the cryptocurrency, itself.  There would be a reason to mine on the network aside from simply trying to get a piece of the market capitalization and an inroad to valuing that currency in terms of \"real world work\" - the \"proof of work\" in the currency system becomes \"proof of work that is valuable\" - because we all would value the functions of the internet.\n\nI'm not quite sure if I am making sense.  For example - silver gets its value not just because of rarity, but also because it is often a byproduct of the mining of other materials.  Those who have it have done work that is relevant to society (mining lead, for example), or can be reasonably expected to have performed an activity worth exchanging it for - which is relevant to society.  Cryptocurrencies currently lack this \"tie\" to a sort of real world value - their value comes from their rarity and the hope they can be used to exchange for goods/services, but it's difficult to really make the argument that cryptocurrency miners are really doing much other than heating up computer hardware over a speculative craze.\n\nAnyway - Monero is also interesting as a subject of point because of its ability to handle, effectively transfers of ownership, audits, and other such features that allow it to prove accuracy without compromising identities, necessarily.  Native support for self-executing contracts and other such things provide a potential means for handling transfers and management of zites.  I think... I haven't really gotten into the nitty gritty of now this could be translated to apply to ZeroNet - but if we think of zites and users as being address accounts on Monero's blockchain - then everything that Monero supports would be supported as part of ZeroNet in terms of how those accounts can relate to each other.  \n\nFor example - I'm looking at building an NAS (and... I actually mean a low end server) for hosting zeronet zites and possibly even a system that allows it to serve up files like a local server to a browser (so that I don't have to worry about duplicating files all across my computers and phone) - also running on this would be, at least in theory, this blockchain currency for handling ID integration and other such things.  If ZeroNet were to become the next big thing - then I would expect to see such things arise on the market and the common interest we all have would help keep both systems truly distributed.",
			"time": 1567499163840,
			"files": "[]"
		},
		{
			"id": "7b04d1d2-b786-4024-a21e-8e491041e7dd",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": ">>ce3c598c-b536-4a78-9aa8-f52d7613ae40\n> So basically you're proposing to prop up Monero's value by requiring people to pay in Monero to post?\n\nDear Jesus, no.\nWhile I'm not certain what all could be done with monero, as it is more advanced than simply logging transactions and has other features that are built into its framework.... but consider this example:\n\nLet's say I own a zite and I want to give staff access to a zite to keep things up to date.  However, I want to also manage accounts - for example, I want to be able to set up five accounts that can be used, hand a key to users to use that account - but then to also be able to transfer all authority of that account over to a new key, should I need to terminate an employee or they have moved on to other business and no longer need access to that account.  As I understand it, currently, the way ZeroNet handles IDs is that it just statically ties a file to an ID that is authorized to make changes.\n\nBecause Monero uses double-blind systems for how it transfers values, you could have a set of keys that people can use to post under IDs you own, and lock out those old IDs and assign new ones without needing to broadcast changes to ZeroNet, itself.\n\nWith this, you could also set up domain registrars who could manage zite ownership for very large or corporate zites.  You don't take away ZeroNet's ability to just have a Zite pop up without a registrar authorizing it, but you do have a method for people to mutually own/operate a zite without being tied to a single person.\n\n>>4f71af9f-1cf7-45dc-bec3-7a0b8166f6a8\n>While I trust Tamas that his vision in principle can deliver, I don't know if I can believe this can't all be poisoned just as efficiently.\n\nSee the above, sort of.  In the above, you could potentially have a \"council of independents' who manage a range of IDs used for owning and maintaining zites on ZeroNet.  The trick here would be in the crypto-currency to build off of.  For example, it is theoretically possible to use self-executing contracts on Monero to only transfer an amount following something of a vote (or you could use values like a voting process).  This could all be set up to allow completely virtual 'stock holders' or other similar boards of investors where adding or removing the number of keys assigned to the group (IE - the members on the council) can be voted on, changing or modifying ownership of keys/accounts, etc.  There are, theoretically, ways of doing this without even exposing your own zite key to the owners.  IE - I could create a Zite, approach a registrar to say \"I need some help managing this thing\" - and, by using a monero-like blockchain, the entire process of whether or not I get added to their registry, who is an authorized user, etc etc can all be handled without exposing the actual keys.  I am pretty darn sure, at least.\n\nOf course, a registrar could become compromised, individuals can become compromised, etc.  If you are looking for some way of guaranteeing that a specific zite or another doesn't get compromised in time - then I don't think there exists a reasonable way to do that as, logically, a zite must have people working on it and the fear is that people can be corrupted.\n\nThough I suppose some kind of automated forum using a blockchain processing system would be interesting - I'm not really sure we are anywhere near trying something like that.\n\nIf your concern is over zeronet, itself, then the system is relatively hardened against attacks just because of its simplicity.  I can, at least in theory, write a ZeroNet browser in any programming language so long as it can process/parse java into something meaningful, and the rest is all, more or less, torrent trackers.  I would argue that more advanced \"server builds\" of ZeroNet will be pioneered in the future where files are hashed and consolidated to owner indexes.  It won't save as much space on a message board, as it's unlikely we'll all be posting identical messages, but for file hosting where many accounts can be expected to have common content - it would trim out a lot of redundant drive use.  That is going to be part of my NAS project for it.  The idea is a RAM-Drive as a sort of server cache and then more conservative use of hard drive space.  The idea is to mainly scale with response and reaction - files in the Ramdrive would be kept for around 24 hours as a standard and then there would be different categories for determining what gets stored to hdd based on what the system is set to do - whether you want \"odd\" stuff with few seeds to be prioritized or just frequently accessed zites (but then why take them out of ramdrive?)\n\nThe idea being that viral interest could be hardened against using the ramdrive default seeding of accessed files for 24 hours, while the network could be hardened against file loss by seeking to keep a certain minimum number of seeds for each file - common or not - though I suppose it would be necessary for the tracker to know whether or not a file was seeded from ramdrive or hdd.",
			"time": 1567654034098,
			"files": "[]"
		},
		{
			"id": "75763d58-d22a-432d-bb03-6e3f5fa62919",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5a9987f0-180c-433f-806f-dbffcf3c54a5",
			"body": ">>5a9987f0-180c-433f-806f-dbffcf3c54a5\nI think this depends, largely, upon what your concept of a God is.\nAllow me to ask a more simple question: \"What is a God?\"\n\nI think many people get distracted by rather irrelevant concerns related to whether or not the god described in some set of scripture or another really exists.  I look at all of these things as various attempts by scholars, families, groups, etc to document various affairs and ideas important to them - whether or not these ideas were properly transcribed and understood.  I didn't start my question of \"does God exist\" by looking at religion.  I'd been party to far too many committees and church decision making processes to believe those people were spiritual.\n\nTo this, I arrived at the question: \"Why are you here?\"\nThis is what Nietzsche meant by \"God is Dead\" - the crux of Nihilism.  Materially, here is the reality - we are born, we eat/sleep/poop/reproduce and then we die.  All or most of the things we build will eventually crumble.  While it's incredibly arrogant to assume we have any idea what will happen in a trillion years to the universe, the running belief is that it eventually reaches maximum entropy and nothing further happens.\n\nSo, rationally, why do we exist at all?  This is the \"Kefka Question\" - if you get the reference.  I have a cat in my lap right now - trusts me completely.  I could snap this creature's neck in a flash and not only would there be no real legal consequence, it wouldn't make much of a difference in the end - no?  So, why do I get emotional when a pet dies in a fictional scene?  Is it irrational?\n\nMany would argue that morality can exist within materialism - but this assigns a baseline belief in material success and accomplishment to begin with.  How many ruins of ancient civilizations lay around us?  Were their civilizations worth it - whatever it was they were doing to achieve the things they did?  Did the efficient operation of the state, the moral binding of their people, etc etc make any kind of difference?\n\nDon't misunderstand - I'm not arguing for nihilism, per se - I'm simply presenting the question of what the purpose of all of this is.  Does there need to be a purpose?  Can a person live without purpose?\nCue the \"Agent Smith Manifesto\" regarding Purpose.\n\nThis purpose is a person's god - whether they are fully aware of it, or not.\n\nSo, for me, as I took a look around and I saw everything that was going on, I couldn't help but believe there was more to all of this than meets the eye.  I'm not going to proclaim to know absolutely everything - but I will say that I believe many of the people around me are real - or should be.  They are generally people rather similar to myself in terms of they are experiencing life as I am, and that there is a reason for us all to be here in this experience, together that goes beyond the immediate confines of this experience.  IE - there is \"an afterlife\" of some variety or another that this experience is a part of - that a part of us survives this experience and progresses to something else.  I believe that our connections to others will survive, as well.  Perhaps not in the same form - but that it is important for us to seek understanding in all things.  There is not just a reason why all the people around us exist - there is a reason why atoms behave the way they do, there is a reason the stars and galaxies exist as they do - some of it may not be a deterministic reason (IE - 'because God said so') but because there is a wisdom or genius to be grasped through understanding the world and the people around us.\n\nI believe there is something of a divine will - a universal constant - an absolute principle of existence - which underwrites all of these things and will continue to do so regardless of where we find ourselves.  This is \"God.\"\nRather similar to Taoist concepts of the true state of Yang - or the TaiYang - a set of principles that can be briefly glimpsed as they pertain to the present.\n\nIf we are talking about various tribal gods of desert dwelling civilizations and who holds control over judgment - then I generally affiliate with Protestant denominations of Christianity - but in doing so I find that many are trying to squeeze my concept of God into a tribal depiction of a local deity and their teachings... and their personal concept of God is actually far larger than what the religion has created.",
			"time": 1567656193098,
			"files": "[]"
		},
		{
			"id": "59c70a02-bc1c-4a78-85c5-0c41336017a1",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "4fb1f67d-d094-496f-a5d0-36f221f63876",
			"body": ">>33d3cfa3-2e2b-4123-b472-aac5b0ee4563\nThat's going to be pretty big.\n\n>>5176544c-af97-4c64-8a27-46f95d7e121d\nHmm... interesting group on endchan.  I'll just say that much.  Something about them seems a bit... off... kind of like The Lost Boys, or something.  Not quite sure how to describe it.\n\nI would like to digress onto something I've been looking into, a bit:\n\nhttps://www.youtube.com/watch?v=SQhbEh8AeSA\n\nThis is the \"Thousand Points of Light\" speech by President HW Bush, where he talks about 'all the community organizations....'\nhttps://www.youtube.com/watch?v=hrZoIsfy-TY\n\"Miracle Flights\" is one of the 'thousand points of light' charity/community organizations.  The charity, supposedly, flies children to get medical attention by specialists ('for extremely rare and little known conditions').\n\nWhat's interesting is this:\nhttps://www.charitynavigator.org/index.cfm?bay=search.summary&orgid=6405\n\nhttps://www.reviewjournal.com/news/news-columns/jane-ann-morrison/miracle-flights-founder-bails-with-massive-retirement-package/\n\nhttp://archive.is/MBtCW\n\nFor the captured table, I would like to point out FY 2013 and FY 2015 as anomalous years for fundraising and virtually no changes in overall expenses.\n\nWhile that might not be all that unusual for a charity, what is also important to remember is that they deal with assets.  These charities will buy property, stocks, etc and then trade those out as held assets.",
			"time": 1567664597998,
			"files": "[{\"name\":\"2019-09-05 01.19.24 www.charitynavigator.org b869b7ba42ec.png\",\"thumb\":\"0c7215d2499662d048fe4afe207ed80671287f39-thumb.png\",\"size\":57283,\"type\":\"image/png\",\"original\":\"0c7215d2499662d048fe4afe207ed80671287f39.png\",\"directory\":\"17GmcqqqJdfEM4DkRsqvvprifPVwYx575h\"}]"
		},
		{
			"id": "fd5223dc-b6f4-4588-a0e2-e554c30278c4",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "ab62a9ef-a077-4f5b-aae0-2f93b5b665ed",
			"body": ">>ab62a9ef-a077-4f5b-aae0-2f93b5b665ed\nWe all knew it would come to this.\n\nThere is a reason I chose this as the platform going forward.  People will continually attempt to accept bargain with these unreasonable parasites in Silicon Valley and DC.  And, truth be told, Jim has no bargaining power, unless he's sitting on a nuclear warhead he can just set off while he's up there.\n\nHis two options are to shut down the site, or to try and say \"we are sorry, we will cut our throats to make you feel better.\"  We all know that it eventually ends with complete capitulation and 8 will be the next half in about six months.\n\nWe have the bargaining power because we are much harder to shut down.  Not that we are invulnerable, completely - and a lot more work needs to be done before ZeroNet is truly ready for the mainstream - but we've been evading peer to peer snubbers for decades.\n\nAbout the craziest it would get is if we have to start burning disks with ZeroNet host revisions on them to hand out to friends and play this the anime smuggling or MST3K route: \"Keep passing the tapes.\"\n\nWell, looks like we finally have a clear path.  That's the good news.  We're it, ladies and gentlemen.  ZeroNet is the last bastion of free speech.  Let's make it into a ship and fleet to take the fight to the enemy.",
			"time": 1567666055698,
			"files": "[]"
		},
		{
			"id": "5233a4d1-47f5-4c1e-bc14-ceb88ccf9a0f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "ab62a9ef-a077-4f5b-aae0-2f93b5b665ed",
			"body": ">>8c4f8d25-6288-4dd7-92ab-5313ef5fd59f\nPython has its place and uses.  Consider that ZeroNet was very little known and was largely an isolated community up until a month or so ago.  There was no need to push to a different development platform or expand staff.\n\nInterestingly, it's out of NoFish's hands, at this point, what happens to ZeroNet in terms of additional development.  There's nothing stopping us from taking the existing source and zite structure and writing our own ZN programs.  We could write our own plugins for a browser that allowed it to access ZeroNet - or write our own browsers.\n\nI think there are certainly things that need to be altered a bit before there's a browser ready for any idiot to go \"I wanna see what this ZeroNet thing is about\" - but I also argue that if ZeroNet takes off to such a degree, we may actually see computers become rather redefined in how they work - both in terms of NIC and RAM.\n\nWhich is why I'm largely thinking that the best approach is to produce small file servers that host zites for a local area network and handle all of the seeding.  Basically, an NAS with more CPU horsepower and indulgent on RAM to use as a ramdrive.",
			"time": 1567721607999,
			"files": "[]"
		},
		{
			"id": "fdee0e32-3d96-4a06-be07-cf8dfeb4f504",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": ">>d19bc8db-1e97-438d-bce1-47c3e9ac6147\n>One person is inherently more corruptible than a group. I do like your analogy to a board of directors, as I think this might be an appropriate compromise solution.\n\nI'm not sure we're speaking the same language, here.  No one can stop me from publishing a new ZeroNet zite.  The only way to shut it down would be to target every seed of that zite and have it not only shut down, but also deleted.  If, at any time, an archive of that zite were to be placed back into a seeded state, it would propagate and you're back to whack-a-mole.\n\nSure - someone could try and corrupt NoFish and cease development of ZeroNet's application.  It's all open source, at present and copies of the source exist.  So - even if NoFish were to say: \"I'm not developing it anymore\" or \"I'm releasing the spyware update of this one because I have a nice family and don't want anything to happen to them\" - the existing versions will still work and someone(s) would almost immediately take up development of a branch.\n\nThere is, as you say, a problem with only one owner of a zite, at present (or a sort of all-or-nothing ownership where I have to give others a key that authenticates them as the owner of a zite - IE - the same as me).  This is where some kind of better integration with a blockchain might be able to work around this and create domain registrars for those who would wish to use them as a service.  But the core functionality of \"baseline zeronet\" would not really change.\n\n>Most casual anons don't into seeding. I have reservations about leaving my PC on-line while asleep. I distain some unprepared no knock warrant at 4AM with family involved. Everything here is contained on a removable device, because I think this is really the proper solution. I don't see what segregating certain material to nvram vs flash is going to accomplish, that proper encryption for removable storage won't already. I could be persuaded otherwise though. My primary concern is if decentralized networking is going to become a standard, that it can't be fucked over as easily as say Napster was.\n\nWe're looking at different problems, here.  This will be the 'internet of the future.'  Government isn't a relevant factor in how I look at it.  ZeroNet is built on top of torrent streams and reading what is stored locally on your machine.  The weakest segment of it in terms of data transfer is torrent files/trackers.  The best the authorities have been able to do in regard to torrent files is nail the internet sites that host torrent files.  Some ISPs will throttle peer to peer activity on their network, but shutting it down entirely is not really practical.\n\nWhat I am looking at is how the network will function as a standard.  IE - this is replacing the interent.\n\nThat is where the importance of a RAMdrive comes into play if we are looking at how zites and files will function in a world where the market becomes dominated by ZeroNet.  Most people looking at, say, Youtube videos are going to be browsing through trending videos, new videos posted by channels they follow, etc.  What I was most impressed about with ZeroNet is how it withstood the surge of activity following 8chan's close.  While the zites are all very simple, the fact the system didn't break is rather amazing from an infrastructure standpoint - and it has to do with the fact that you can't help but seed downloaded files.  This is a requirement for ZeroNet to function as robustly as it can.\n\nWhich is the importance of a RAMdrive.  You don't need to permanently save the video you loled at and moved on.  But you do need to have it available to seed for, say, 24 hours because other people want to kek at it.  The surge in viewer activity of most youtube videos is around 3 days, if memory serves.  When channels launch a new video or something goes viral, most of that activity occurs within three days.  This is my observation, as well, when I publish a new chapter of a fanfiction or something else - about three to five days of increased viewer activity, and then just the occasional traffic.\n\nThat is why seeding on the \"ZeroNet for normies\" browser will be extremely important, an why a ramdrive is key to this.  Flash will burn itself out - IE - solid state drives will be unusable within just a couple years because of read/write cycles causing bad sectors.  They are an option, but the ramdrive would take the rewrite cycles out of them and allow them to be mainly dedicated to popular zites that just have higher traffic on the average.",
			"time": 1567723205999,
			"files": "[]"
		},
		{
			"id": "948c3dfc-42ba-4b6d-8567-a783db0e4e85",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "516c8312-9c2d-4f0f-9755-7b62503dd0a1",
			"body": ">>36f37f16-bf22-4d8a-9c2c-e4262ab979f7\nHmm...\nIf you are just looking for a place to shitpost and say nigger without getting a spanking, then none of this really matters.\n\nThere are two reasons 8chan and halfchan were important - it is because most of the content that makes its way onto the internet has its origins in those two places - IE - memes.  They were places where memes could be shared and then distributed on other social media platforms.  That is why each of them have been targeted and subject to sabotage.\nThe hazards of 'weaponized autism' really didn't come about until the pizzagate digs.  Boards like ATS and some others served as some interesting challenges for counter-intel, but the accessibility and chaos of chan boards made it far more difficult to predict what subjects would be researched and complicated classic board strategies to suppress discussion without having control over the moderation (board slides, and the like, which could be implemented on high traffic boards while low traffic boards were ignored).  It was the high visibility of the chan boards and their trend of rapidly condensing information into a meme to distribute to the rest of the internet (which would become popular because of its wit, humor, pertinence, etc) - which combined to make the chans a unique threat.\n\nIn that sense, 8chan doesn't look like it will be completely compromised as a tool toward that end.  Not yet, at least, although now that some compromise has been given, it is unlikely that future compromises will be resisted - so I see this as a buying of time strategy.\n\nUltimately, if we are looking at this being a warfare platform - and I most certainly do - then the value it has is not that information is going to appear here for the average person to see or formulate some kind of revelation from.  The value is that we can conduct digs, create memes, and dispense those into the internet to be picked up by the same forces.  The threat we pose doesn't really change, and - if anything - the threat of truly decentralized social networks developing on these types of platforms and then rising like a hydra to strike into the heart of standard social media with memes and other such things... the power we hold will not be lost.\n\nIf you just want to shit post or ring in the end of the world with 'i told you so' and friends - then you might end up being a bit disappointed - though in a rather ironic way, I would hope.",
			"time": 1567758722140,
			"files": "[]"
		},
		{
			"id": "f8139ad2-b22b-4bf9-8d18-6e2724a24704",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "4fb1f67d-d094-496f-a5d0-36f221f63876",
			"body": ">>70f0075b-ac49-472a-8b26-c52a9dca4129\nI don't doubt that Q is in control of things.  However, what I will say is that while there may be a tactical reason for doing this in the present year - this is a strategy I have unilaterally struck down.\n8chan is being kept around for parts.  Once construction is complete and sea trials are finished - ZeroNet succeeds her.\n\nWe have already proven, time and time again, that these kinds of \"emergency powers\" are abused.  We can barely get the government to follow habeas corpus - and almost no one trusts them to publish the truth about a murder scene, any longer.  While I agree that makes for a hell of a show - that's only for people who do not yet understand there's a problem.\n\nI'm not entirely certain what it is they even think needs to be done to shut down a board during an emergency.  Why?  Is there some intel that suggests it's been used for coordination of attacks?  Is there some information that leads to the conclusion that the posting of a manifesto somehow justifies closing down of a board?\nWhy doesn't Twitch or Youtube implement a system to shut down a live stream of the very things that have been streamed over it as a form of tactical information broadcasting?\n\nWe saw people on Twitter using it to post to each other and coordinate at trump rallies - IE - infiltration teams of Antifa.  Why does twitter not shut itself down during events?\n\nI'll say that I trust Q insofar as I trust Q to have superior intelligence resources at his disposal to act on that information.  What is happening to 8chan, however, lacking any further evidence or argument - is not an acceptable long-term strategy.  While I can appreciate the work Q has done - my answer to that is \"you are going to have to figure out how to do your job on a new platform.\"  - Not necessarily Q posting as Q - but Q as an intelligence agency.  The internet as a spook's wet dream is not a paradise to keep the predators at bay.  It is a model where the well dressed and spoken predators farm the population as a manicured crop.\nThose who would trade liberty for security....",
			"time": 1567760358040,
			"files": "[]"
		},
		{
			"id": "49c24131-050a-4ae1-9a7f-d4980c84cac9",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "8fd34724-1136-4992-8b39-45434706b9bc",
			"body": ">>1099a9d1-e5b6-40e4-ac22-5164f8f6f4b8\nProbably not the other boards, but if someone is going on a mute spree across the userbase as some anons have championed doing, then it would be no surprise to see that they unintentionally culled half the posts.\nIt could also be because the post count is related to the number of files you have on your machine, it seems, so the post count will do weird things until your local files stabilize.\nWhen we had fast moving threads in another part of the forum, it was common to have replies go to the wrong person as a post was being replied to using its post number, but the propagation of added comments throught the peer network hadn't yet stabilized, so you would get posts that would shift around - what you posted a reply to and what the system indexed as that post would be two different posts.  This was back before the upgrade to the millchan version we have, now.",
			"time": 1567793741575,
			"files": "[]"
		},
		{
			"id": "e5cc5c68-bcfb-4992-9528-da81cd618ce6",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "8f37924f-e148-4a26-8bfc-3591fc5f5343",
			"body": "I don't think society is so far gone as to require such extremes.\nWhere education failed is in its attempt to treat young women the same as it would young men - as bachelors.  They are not, and were ill prepared to deal with the responsibilities of being an independent adult capable of choosing a partner.  To be fair - we wiped out cultural education (mother-daughter) in favor of public education, but I would argue that the industrial revolution and immigration patterns between nations in those times were largely doing this, anyway.\n\nI'm also not really certain that a reversion to this type of system would be possible unless you were to have a muslim majority over a region and/or we are talking about a MadMax style breakdown of civilization to the point official birth records would be \"old world\" concepts.  .... And those two probably accompany each other.\n\nFrom my own personal standpoint - there's something disturbing about the concept of \"training\" a wife.  I understand the instinct to want to provide for a woman/girl and the instinct to want to see her grow into a complete person - but the idea of training a person like a pet is just disturbing to me.  I have no doubts it is functional, and I imagine women are more 'vulnerable' to this type of process... perhaps even genetically predisposed to it.  However, it seems a rather utilitarian way of viewing things.\n\nFurther, I will say this - the target of your message is, understandably, Millennials.  Our generation was sabotaged six ways to Sunday from financial, education, moral, and other standards and have withstood the brunt of (((their))) depopulation agenda.  It's tempting to sit at the dawn of my 30s and wonder if that whole family thing I wanted when I was younger will ever be a reality to come out of this.\n\nI will, however, point out something... we are winning.  Not necessarily in an epic fashion, and I don't know exactly how cold our generation will stop the trend, but we are winning when you start to look under the hood.\nI grew up with a friend from another country, many years ago.  I won't get into her history - but suffice to say her father was the perfect example of about how fucked up a male could get.  I never got a specific story, so I could be seeing the worst case... but she did use, only once, the 'me too' hash without pointing it as a weapon at anyone.  So - it's no surprise she was ripe for the indoctrination into progressive feminism and \"male violence bad\" culture.\n\nI saw, a little while back, now, a post she made on Twitter.  It was referencing how, when she was younger, she was going to 'grow up and work hard' for feminism - IE - \"I don't need no man.\"  However, now, they are kind of like \"Eh... I kind of feel like settling down and starting a family.\"\nThose are words that, even in our teens, we would go round and round about - and that was before she was full on indoctrinated and we could hold a civil conversation.\n\nShe's a person who I know is real and who I know to be rather indicative of even some of the more intense views of real people.  Most of twitter is fake.  A large portion of facebook is fake.  The people whom I know are real are starting to realize something is off.  Pair this with \"me too\" getting eviscerated over at Funimation, right now, as well as the case of Epstein... it's very possible that we millennials who have been trying to overcome having parents wiped out by cancer, income wiped out by banks/obama, and the sabotage of the women of our generation to make us out to be the enemy ... there's a very good chance we'll see the complete reversal of that.\n\nWhether it will be in time to at least stabilize the population, time will tell.  But I should think if fate of our population relies on our ability to train 12 year olds to be housewives, then we are already to such a point where complete social collapse would be expected to take root long before any kind of policy change to allow/endorse it would make any headway.",
			"time": 1567795978575,
			"files": "[]"
		},
		{
			"id": "36794c53-4b04-4098-acd9-bf6ea9d35ca7",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "4fb1f67d-d094-496f-a5d0-36f221f63876",
			"body": ">>f43c7f5d-e190-4e2e-b381-1088a70c7964\nOdin is an interesting name choice.\nI'll refrain from speculating on it.\n\nAs for Q's trip - I'm thinking beyond Q.  While I suspect Q will probably make a few additional posts after it comes back online - I almost wonder if Q's whole build up was not for just that scheduled shutting down of 8chan.  I believe, two days before 8chan was taken down - Q deleted all content on Patriots Fight.\n\nDepending upon how we interpret everything that Q has said and that action, one could make the argument that it is the scheduled conclusion of Q's operation as far as the anonymous poster on 8chan.\n\nIf 'future proves past' - then our ability to connect Q statements to the events that are going to be unfolding, presently, will be key to verifying to people that Q was not only real, but that there has been some form of takedown in the upper echelons of government.  Q has said \"The choice to know will be yours\" - and this has always bothered me with regard to things.  \"The great awakening is dead.\"\nTo me - this implies that we are not going to see a large public awakening to the truth, necessarily, in terms of there's not going to be a massive newsbreak about arrests and the like.  Everything is going to be taken down and dismantled in the shadows - the news media and their conspirators doing whatever they can to conjure up cover stories.\n\nWe will have Q's statements to match up to news events and then maybe, once everything is complete, the records will be declassified as to what actually happened, but perhaps require FOI or other requests - IE - unless we go digging around for the truth about what really happened, it will be water under the bridge (and, perhaps by that point, will be water under the bridge).\n\nI'm not completely certain I agree with this approach... if that is, indeed, how it will unfold... but I suppose it is better than risking chaos in the streets (as if this isn't risking chaos in the streets, already).",
			"time": 1567807495868,
			"files": "[]"
		},
		{
			"id": "539e171c-6d4c-4c43-be61-69f846ef4a5c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "8f37924f-e148-4a26-8bfc-3591fc5f5343",
			"body": ">>ddde0e4e-5ea0-4005-a918-9731294158fc\n> It's only seen as an extreme in our (((modern age))) however back in our grandparent's times, or great grandparent's for the younger ones, arranged marriages were still a thing, being in a relationship with an adolescent and courting her into full adulthood was still a thing. This is why laws such as the following exist\n\nI can see I am going to have to take a bit stronger of a tone, here.\nYou are talking about training a human being as if they are a pet or a servant.  Logically speaking, why couldn't an older woman pursue a younger boy and train him?  The argument that the man holds some kind of unique insight into life that grants him the authority and position to train a woman on how to properly live is built upon the idea that a woman should be married at a young age and that it should be to a man for the purposes of becoming his constituent part.\n\nWhile I will not argue the effectiveness of that strategy, I will also remind you that it is the basis upon which feudal authority is built.\n\n> By making education compulsory we in essence not just lowered the standards, but also pluralized the fields of knowledge. This continual watering down, instead of specialization into a specific field, trade or just vocation and so forth is what eventually led to the centralization of the education system.\n\nYou're speaking nonsense, here.  The decline of education came primarily from the pushes to standardize education practices and the contracting of education to a select few companies.  It had relatively little to do with the presence or lack of women - although one could argue that women were less inclined to champion STEM programs in favor of subjects like literature and art - what's important to understand is that the entire concept of education was different in various regions and times.\n\nMany rural and suburban education programs were simply the women teaching the children while the men worked the fields.  Communities would hire or send a person off to a higher education program to bring that knowledge back to the community and teach it to them and/or their children.  \"Gradeschool\" was an informal system and \"highschool\" was closer to a boarding school environment where the purpose of instruction was less about qualifying an individual for a job and more about educating an individual to empower their community.  University - IE - College was less an education program as it was a cultural consolidation of knowledge and research.\n\nIt wasn't really until you saw the consolidation of the economy into the Government-Industrial Complex under FDR that the education system was reduced to being a drone factory.\n\nBlaming women for this decline seems more agenda driven on your part than rooted in any kind of real observation.\n\n> That's because you have not let go of the social programming this feminist society has ingrained into you. The fact is that women were bred and created for one sole thing, give us babies, maintain the home, and every once in a while offer input in concerns to house or social affairs. You need to let go of this retarded meme of intellectual and social equality, because biology and even social sciences show this is not the case.\n\nSo, your argument is \"women aren't people.\"  While it must be recognized that women do not perform equally to men, statistically, it must also be recognized that the average woman tends to perform in a superior manner to the lower two thirds of men, depending upon which metrics we are testing and how you want to slice and dice the statistics.\nIn short - while the average man may be \"smarter\" than the average woman, more women tend to be smarter than their male counterparts than not, at least in terms of most of our metric evaluations.\nSo, as someone who has a very good probability of being of much higher rated intelligence than yourself (far greater than the difference between average male intelligence and average female intelligence), I have to disregard your evaluation.\n\nWhile it's very true that you can't release women into the world as if they are bachelors and expect good to come from it - to suggest they exist purely to produce children and clean the house is to effectively claim they are servants for your purposes - IE - that they are not people and do not have a right to seek their own course in life as a human being.\nBy this same logic, any demographic which is of statistically inferior performance could be enslaved to another.  Where I am from, that is considered an especially savage way of thinking, if not a front for evil designs.\n\n> That's their biological clock speaking, and no it's not just a shitty MGTOW/MRA/Incel meme, it's a real reality your modern western roasty does not want to admit until it's too late and she's hitting her 30s or sometimes even late 30s.\n\nWhat is interesting is that, rather than educating women about this as a part of their upbringing, your proposed solution is \"train and indenture them.\"",
			"time": 1568085118843,
			"files": "[]"
		},
		{
			"id": "06ba2b2c-c8fc-42cb-ac29-298b644f2eed",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "4fb1f67d-d094-496f-a5d0-36f221f63876",
			"body": ">>5601f892-144f-4aec-9844-ca09bf678df1\nNot a whole lot good to say about Jack.  I could go on a ramble of irrelevant things - but suffice to say that they are really only good at making cheap imitations.\n\n>>2affd633-3fac-477c-a2aa-6522dad4af83\n> Comment sections where the interview is posted are interesting, no one is buying his shit.\n\nThey've seen some people do some impressive things through conjunctive and inductive reasoning and, failing themselves to realize that it's a skill, believe that they can simply use a vague persona, such as a former Naval Intelligence Officer (supposedly) with some \"I know stuff\" style comments to build support and enthusiasm.\n\nIt doesn't work because people are more intelligent than these spooks give them credit for.  To put it simply, people recognize when they are being presented with \"crazy\" versus when they are being presented with \"bullshit.\"\n\nA lot of effort goes into disinformation campaigns - so much so that I think half of the conspiracy debates are actually disinfo programs of various parties arguing with each other as most others realize that bullshit underwrites both sides.\n\n>>8a16249e-c958-4f1a-accb-1a16bb849a3b\nThe missing trillion has less to do with secret space programs (those are accounted for) and more to do with Yugoslavia, Chechnya, and the Axis of Evil.  I've gone back and forth on W - but there is no mistaking that his administration went to war against the CIA - whether that was real or for show is hard to say for certain - as it seems to have been a mixed bag.\n\nAnyway - the secret space program can (as I figure) be found in projects like the X-15 and the alleged \"Aurora\" spyplane of legend going back to the 1990s.  The primary obstacle to space flight is that first initial umpf up from the ground and out of the atmosphere.  This is the major reason for staging - different performance of engines at different altitudes, as well as a major cost of fuel as drag is a large factor while also accelerating directly against the influence of gravity.  So - you ferry a rocket to the edge of space at very high speed and launch it with a small booster the rest of the way.  Not only do you make much less of a spectacle, but you can launch on much more difficult trajectories (such as a polar orbit) with much less difficulty.  You gain some of the advantages of a spyplane (dynamic, less predictable, more difficult to monitor, etc) and the advantages of a satellite (extremely difficult to intercept, ability to make multiple, regular passes).  In theory, a large enough platform could ferry people or loads destined for lunar orbit/landing into space.\n\nThere's probably some more to that; sitting a large solenoid into the ground and having a coupled coil to propel through it straight into the sky would potentially replace solid fuel boosters and you could \"shoot\" objects into an extremely eccentric orbit that could later be adjusted to a circular orbit, transfer orbit, etc once in space.  IE \"space gun.\"  The mountain ranges would be a good place to conceal such a place.\n\n>>5f02fcc9-522c-403f-adb5-334ca13c3e8c\n>Q is part of US Space Command/ Space Force?\n\nQ is Q.  But let me run through one of my pet theories.\nYou've been told that the Arabs out of Judea are the Hebrews of the Bible who come from Adam's son, Cain.  Or was it Set(h)?  ... \n\nAnyway - let's flip this story around a bit.  What if the area \"East of Eden\" - IE - NOD - was centralized in what is, now, Sarajevo?  This would make the Slavic tribes the chosen people, no?\nOf course, chosen by whom?\nI've seen a rather interesting argument put forth by some black supremacist types who like to insist that \"white people can't even survive on this planet\" - IE - our lighter skin is not meant to be exposed to the sun's intensity, here - which is why we would gravitate toward the polar regions and dense forests of Eurasia.  So, let's just shoot from the hip and suggest that the Slavic - that is the largely Aryan tribes are descendants from some form of space-faring group.  Light skin that more easily accepts UV for conversion of various cholesterol would be better adapted to space habitats or more distant planets, afterall.\n\nKind of places \"muh Russia\" in a different context.... after all, the term \"slave\" in English derives from the Slavic people and how they were raided and sold by various empires around them.\n\nQ uses many British English phrases.  Melania comes from Slovenia.  Slov = Pure (used for Mary in Church Slavonic).  Who is helping POTUS?  No one said that we were the only humans in existence.",
			"time": 1568088611161,
			"files": "[]"
		},
		{
			"id": "ef180a65-da26-4546-a601-e7ecd6e41f48",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "8f37924f-e148-4a26-8bfc-3591fc5f5343",
			"body": ">>5b46eac2-2b65-4ce0-a000-14a1f21e6cbe\n>You do have noticed that you're on /pol/, right?\nI have noticed that you are in my domain, yes.\n\n>The law of nature is that the strong (read: capable) rule the weak (incapable).\nYou speak as if you are trying to tell me something I do not already know.  Ask yourself, again, why I adopted the tone I did.\n\n> The idea that slavery is somehow evil is in itself evil because it perverts nature and weakens everyone as it allows those that should never be near anything close to power, women, negroes, muslims, etc., to infiltrate proper civilization instead of being where they're supposed to be: Below the lowest of the low, with no self-determination, their every action guided by their betters. In short: Property.\n\nFor property, you have a rather big mouth.\n\nWhile you are not \"incorrect\" insofar as your synopsis that the capable rule over the incapable - the question is a little more complicated than that.\n\nSee, the problem is \"capable.\"  This is not a static or binary value.  Many different things define whether or not you are \"capable\" of enslaving someone.  You could be running a fun little slave camp and then I train a girl in your little servant harem to cut your dick off when you are in the middle of it.  Now you're not \"capable\" - as you'll most likely die before medical attention can be rendered.\n\nThe problem is that even if you are smarter or generally more capable of achieving your goals than others, they can be more than capable of putting an end to your existence - and people like me especially enjoy being a tyrant of the tyrants.\n\nAs to the nature of evil - there again, I would suggest you've missed something.  The reason I do not haul a woman into an alleyway and rape her isn't because I am afraid of the police or society coming to arrest me.\nThe reason why this type of action is considered evil is because I would rather not want to be that woman if she were raped or mistreated.  This capacity to empathize with another individual's state of mind and experience - and regard for it - is the primary component of moral reasoning.\n\nBy your logic, you are effectively arguing that Epstein, Soros, Clinton, etc all earned their place at the top of humanity and that we are 'incapable' next to them.  Unless your point is to say that it is a revolving door of tyrants and whoever claims the throne gets to behave however he or she chooses....\nBut, again, can a king order back the tide?\n\nBy your own reasoning, we should each afford ourselves nearly any pursuit over our neighbor so long as it has decent odds of fruiting a reward.  I should steal when able.  I should kill when able.  I should subjugate and dominate when able.  Why not?  If there is nothing in another person but a resource for me to consume, then why should (you) or anyone else be any different?\n\nEven if you do not believe there is anything special about a human being or individual thereof - going full People's Republic of China - the notions you put forth are absurd.  A society comprised of individuals continually looking to subvert and subjugate each other at every corner will get nothing done - and would be rapidly overwhelmed and destroyed by a society that did respect and regard the others within itself.\n\nIt's like you're missing a few codons up there, and failed to realize that the laws of nature created us - whatever those laws and processes may be - and all of our nature is inherently a product of those laws.  Arbitrarily deciding to say that it's one group's right to enslave another is being smart enough to have an idea yet too retarded to see that it won't work or give you any real advantage.\n\nYou're reminding me a lot of (((Board of Investors))) at the moment, frankly.  Bunch of people who think they are gods because they can work a spreadsheet and dodge taxes, but who've never actually done a single useful thing their entire life.\n\"It's the law of nature that the strong dominate the weak!\"\n\"We're capable!\"\n\nA lot of old stories show the Jade Emperor and similar beings of power taking on the roles of vagrants, servants, slaves, etc.  Stand in a position of power over people, and they will tell you what you want to hear while plotting to put a knife in your back.  Put them in a position of authority over you, and you'll see the true nature of their soul.",
			"time": 1568196305427,
			"files": "[]"
		},
		{
			"id": "e1276599-4aac-4d77-9725-6cf20e411956",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "4fb1f67d-d094-496f-a5d0-36f221f63876",
			"body": ">>32436be2-d188-4a3e-9d6f-a1259b3b51fa\nCould be a drop, but not likely from Q.\n\nTo point out something I mentioned, earlier, I think Q is done.  This is not to say that the plan Q was speaking of is done or defeated - but that Q's mission is complete and that character/persona/role retired - or perhaps shelved to only be withdrawn once necessary per some contingency plan or another.\n\nQ wasn't there to have an idle chat with us or to be some kind of rabble rally.  He was there to leave behind a map and information pertinent to understanding that map, which would be used to verify that the plan was going according to - well - plan.\n\nIf Q did his job correctly, then there's no further need for Q to come back and talk or leave any kind of drops as Q (or leave anything Q-like).\n\nWhat this post you've highlighted seems to imply is that there are \"selected anons\" and that there are keys to some sort of haven of the gods.  IE - that there are gatekeepers who hold special privileges.\nThis is a pretext to get people looking for said gatekeepers to follow.  IE - a setup for subversion.  The pattern would complete as follows: \"You found a special place, welcome to the team!\"  \"Things are looking kind of hard at the moment, we need you for a special mission.\"  \"Go do something violent or disruptive.\"\n\nThere's a reason I've told the people who are following me in the shadows that I'm in charge and that any propositions they have for me can be given in person and at an appropriate meeting place.  Maybe they are Q, maybe they aren't - if they are Q, they probably just want to say hi and it's been a while, if they aren't Q, they probably want to say hi and that it's been a while.  All of which can be done after the proverbial sunrise, and would be arguably better to do so.  Particularly for Hime, who wants to live life under blue skies.\n\n>>0bce203c-bdfb-41e3-86a8-21b17930e39b\n\nI think we are beginning to see the Saudi > Iran ordeal Q hinted at.  The House of Saud (Kingdom) was established by the British after the Ottomans defaulted on bank loans back in the day.  Iran is a product of Operaton Ajax, which was the CIA program to stabilize Iran before it was then handed over to a Muslim Brotherhood operator (Khomeni, or however you spell his name).  Iran has been a CIA front ever since.  The CIA comes from the OSS, which was largely trained and established by The Royal Intelligence Service of Britain.  Lot of media types recruited into the OSS back in the day, who would become directors of the CIA and founders of CNN.\n\nAssuming the House of Saud is trying to buck British rule, then the President is effectively signalling that the U.S. knows the story and there's a plan in place for dealing with the true cause of the problem.  This appears to many in the public as saber rattling or war posturing, but is an indicator that a collapse of the C_A's hold on Iran is ready to deploy.  The C_A being a reference to the \"thousand points of light\" (front organizations) and extra-legal operations set up by the CIA, but capable of operating independently of official agency input.  IE - the CIA built a bunch of private armies for people who didn't have to tell anyone else they existed and who don't necessarily work for the CIA any longer (but... can still use that private army).\n\nKeep in mind, though - the Sun may never set, but all roads lead to....\n\n>>77660bd7-c8ed-4f95-8334-9d6d0520e514\nI'll be putting some stuff together and publishing this week, if all goes accordingly.\n\nMy recommendation is not to focus on \"bunker\" or \"chan\"  - but to instead explain the virtues of ZeroNet as a concept and platform.  One of the key things to try and move people on is the idea of a youtube on here.  Although, to be frank, there will need to be some thought put into that one before ten million swinging dicks start trying to upload five hundred megabyte files by the million.  It won't \"break\" the network, but it may lead to an ocean of 'file can't be found.'  We also need a zero net that doesn't kersplode itself on Windows after a few hours of running.  Go to get something to eat and come back to a slideshow.",
			"time": 1568708739751,
			"files": "[]"
		},
		{
			"id": "6d6110df-88b7-4ce8-a0b7-462064101caf",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "b3692ad8-0a6f-4a58-a90b-9a459da02d58",
			"body": "Several problems come to mind.\nThe first is that Codemonkey's problem isn't DNS, it is DDOS.  He can stand up a DNS.  Nothing illegal about it.  The problem is that it will get DDoSed into oblivion in a heartbeat.  Amazon and CloudFlare (google) are the two options for DDoS.\n\nThe other problem is that a satellite would still need ground receivers.  Ground receivers would still need to be connected to the network and that is where the TCP/IP infrastructure is vulnerable to government or corporate censorship.\n\nThe third is that you need a constellation of satellites either in Geosynchronous orbit, or in some kind of overlapping orbit patterns.... with the ability to relay between each satellite as part of a mesh or crossbar network.  IE - the satellites aren't just communicating with ground stations, but each other and deciding how to route traffic.\n\nWhile the idea is, itself, not all that bad, the project would be quite the investment from a business standpoint and you would ideally need this system to be able to handle easily produced consumer/hobby ground stations that could make censorship very difficult.\n\nI've had similar thoughts, but was instead looking at a hybrid network structure where the high-bandwidth internet backbone we use is scheduled and negotiated by a low-bandwidth mesh/neural network of satellites or ground station radio transceivers.  This low bandwidth network would be how VPNs, dynamic routing around blocks/filters, and encryption keys would be transmitted, while the rest of the infrastructure handles the bulk data/stream.\n\nThe problem is that you can jam a satellite if you really want to, especially one in geosynch orbit.  Normally, the FCC would dispatch the military to nail you with an AGM-88 HARM if you did -but if it's the government doing the jamming....\nYou could go optical (and still run into the same problems), butt there are still anti-satellite platforms available (granted, if we are to the point where an anti-satellite missile is launched to take down a website, then someone is an unquestionable bad guy in the equation).",
			"time": 1568709838151,
			"files": "[]"
		},
		{
			"id": "b6ccfa2a-5a03-45c5-9498-b71180ce0f9c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5311feb9-80b8-482c-b2b1-37d87e1bc224",
			"body": ">>16720e76-6e16-469b-939f-ff1d6add0aca\nHmm... \nLet's wargame this out a minute.  You are a pedophile who has, for whatever reason, decided to take pictures to evidence your crime to share with your youth-inclined conglomerate.  You hear about this thing called \"ZeroNet\" where a website is almost impossible to shut down and moderation on discussion boards nearly impossible.  Sounds like a perfect place to publish all of the stuff that can identify the children you've abused and who their abusers likely were.\n\nHmm...\n\nLet's think of another scenario... you're part of a company that specializes in providing moderators for forums.  It's your job to make sure posts comply with the law and that the various plebs of society conduct themselves with a minimum level of civility.  One of the Thousand Points of Light out there in the world, no doubt, or may as well be.  Anyway - you notice that there's a forum that's rather popular among a niche group.  Having moderated boards for some time and being an enterprising individual, you've made sure to save examples of illegal files - or perhaps there's a rather loose lock on the company's kept examples of illegal files.\nAs a very enthusiastic and passionate part of this company and is importance, why wouldn't you create a smurf account and hastily educate the board on the dangers and hassles of operating without teams of moderators available to quickly remove any contraband posts?\n\nParticularly if your company is hosted in a location where there's no real extradition treaties and the law enforcement is easily bought off with a romp in the sack with a hooker or two?\n\nLet's say you have eaten your Tiberios for the day, and glow just that much harder.  Maybe you work for an official agency, maybe you don't - but there's a website that you consider to be a particular eyesore.  With the full index of contraband photos at your disposal, how do you go about generating the evidence you need to get a website shut down?\n\nHow do you moderate or shut down a ZeroNet zite?\n\nMake no mistake, child pornography is a weapon of digital warfare and the producers of it are protected by the very people who need it to justify their operations or strike at their targets.  I'll just leave that little bit here.",
			"time": 1568713040951,
			"files": "[]"
		},
		{
			"id": "5732bdb3-a81b-4183-b38a-5246e47ea3b5",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "4fb1f67d-d094-496f-a5d0-36f221f63876",
			"body": ">>ff74d653-86d5-4d66-84cb-ed30741524f9\n> I disagree. As events accelerate both expectedly and unexpectedly, coordination of 'the (virtual) troops' is important.\n\nI feel like my words kind of lack in comparison to the concepts my brain is linking together...\nWhat does it mean to have control?  In something like the game of chess, you can't do anything unexpected.  There's no hiding of the pieces, no hidden moves or unknown abilities of the pieces in play, etc.  Simply put, there is no situation which can be unexpected and lacking a contingent response.  We are at the point where the moves by the opfor are ultimately irrelevant.  They can play a flawless game and will still lose, invariably.\n\nI've been tracking a lot of the different groups and people who have been following Q for some time.  I think many underestimate the amount of deception in Q from the beginning.  Much of the activity surrounding Q was ... 'media black ops' for lack of a better term.  Someone, somewhere, be they directly affiliated with the media or are just integrated with the operator network of the C_A, has made it a point to place \"left wing agitators\" (they are agitators, they tend to lead left wing groups as the left is largely a construct for agitation, but it's important to make the distinction that they are not actually people with a sincere belief in the values or policies - those are weapons to be distributed to their soldiers) into the social framework of Q's movement.\nI'm not certain, but I imagine the \"mm\" Q used in reference to reach was in reference to the number of planted operators.\n\nQ  was a masterful play in the world of counterintelligence and counterinsurgency.  Not only was Q able to contact people like myself (and presumably yourself) to directly communicate and authenticate a plot to correct injustice and head off calls for militant activism plotted by 'the right' (again, these same operator networks are embedded in right wing groups and were engineering a civil war - if my own intelligence efforts are correct); but Q was also able to effectively lure these operators into a honeypot that consumed their resources and was then terminated on cue.\nRather than developing militant networks and seeding division between 'us' and the President, these groups were instead focused on the character \"Q\" - who is now no longer to be found and they also were spending a considerable amount of time playing with concentrated disinformation efforts by pretty much every intelligence agency and fraternal order in existence.  Those operators are now rather isolated in terms of their influence over \"right wing activists\" - and they have suffered immensely.\n\n>on twatter or are you some sort of e-celeb? Why would anyone follow (you) specifically, except friends/family? Anons don't generally have \"followers\"\n\nIt's ultimately a question for them.  However, I will say that I have a long history under this user name and nothing Q has talked about was really a surprise to me.  Even a few sentiments I've expressed with relation to speaking to a future event that will solidify the truth of a statement, etc - were concepts I was using for quite some time.\n\nBut I don't really think that's the reason I am being followed per se.  I may have been an interesting subject for research and analysis when constructing future operations - but the reason to reach out has less to do with intelligence agencies.\nHave you ever seen \"Aldnoah.Zero?\"  It's an anime.  I got an interesting response to a post I made on faceberg, citing President Trump's tweet from the G20 summit and I mentioned how Trump was hinting at the notion that prior summits had the leaders controlled to say things in line with the media projections - and that was now different, and a shout out to someone I call \"Hime\" with a reference to blue skies.\nThe account responding was some random account from Tibet or something - a user who hadn't been active for a very long time and likely was either a smurf account created or an account that was brute forced in the past to be part of a network.  It was simply a picture of a hamster, or something like that, waving.\nThat is how \"Genbu\" has always communicated with me.  Whoever they are.  They are, however, connected to the person I call \"Hime.\"  This is the point where I'm actually too candid in speaking about stuff like this.  However, if you read \"Eden's Zero\" - then the character 'Homura' is... interestingly accurate/astute.  You'll also find there's some shout-outs to stuff we research in there.  The truth is in the cube, black rock, etc etc.\nThere are no coincidences and Japan knows Q.  I'll put it that way.",
			"time": 1568781704731,
			"files": "[]"
		},
		{
			"id": "0fcb8939-c2c6-40c0-bd18-05876a7907d2",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "4fb1f67d-d094-496f-a5d0-36f221f63876",
			"body": ">>ff74d653-86d5-4d66-84cb-ed30741524f9\n> House of Saud are donmeh jews. Everyone in the Middle East knows this, but Americans (at least) are blissfully ignorant which is why the alliance between Israel & Saud seems baffling to many. It makes perfect sense actually.\n\nIt's a rather convoluted mess.  I'm not going to claim to know who is or is not jewish, as for all I know, my family line is some kind of crypto or another.\n\nHowever, many often overlook how \"the more things change, the more they stay the same.\"  It's interesting to note what blood lines were targeted for replacement or subversion as Rome expanded into Europe.  It's also interesting to note where major wars have started and who has been targeted for elimination consistently over the centuries.\n\"Salad is the type of person who would look at how the Senju exterminated her family line and not care.\"  If you can follow the conversations back that far, that is what is being discussed beneath the fandom.\n\nMake no mistake, big names are behind those accounts.  \"Aragne du Sior\" had the quote: \"Apres du Moi, Le Deluge.\"  The profile background was an image of a full moon over a wooded lake with an artistically styled \"Welcome\" and a rabbit jumping through the hole of the \"o.\"\nThey love masks.\nWhile they were posting, they initiated an IP ray service to mask user connected IPs.  The owner of the forum could afford himself a position in a yacht club if he so desired, and someone is taking drone recon of Epstein island.\nThe ... \"Empire of Vers\" is an interesting group, to be sure.  Ninja clans all over the place.  But I digress.\n\n> Also with captive Europeans, who were forced to work for the country that destroyed their homeland in a senseless brother-war, as well as untold Communists who ended up taking over and who never seem to be blamed for the shenanigans worldwide, unlike those captive/conscripted persons who are blamed for mostly all the C_A wrong-doings.\n\nI've often wondered... there's a country I mention quite frequently, because so many things seem to tie back to it in the modern century.  Many assume that Q meant that the country not named even a single time is Israel.  Which, is potentially true - few things derail a thread like a mention of Israel, because so many people have religious and spiritual beliefs connected to it.  To be fair, I suppose your own statement could be taken similarly - the people in Israel could be seen as being trapped in a scheme above their heads that is not really their own doing (although... I have to wonder why any sane Jewish person would ever move into the middle of the religion of 'kill the jews' ) ... but there's another country that I would argue has been even closer to the center of global affairs - Yugoslavia.  Familiar questions, such as \"how many died in the Srebrenica massacre\" seem equally relevant, and when you start peeling back the layers of media deception and propaganda, you find yourself at the disturbing conclusion that people like Madeline Albright were put in place specifically to carry out genocide.\nWhat's more, if you start doing the above... you find there's a particular maternal line going back to Montenegro...\n\nAfter reading a few history books about the region, having been rather intrigued by a certain ninja, I came to discover that its history read like Game of Thrones and had some amazing characters in it.  I wanted to actually go on a journey to document all of it - to track down the local legends, speak with their families, to trace the history in a very real sense.  As many of these families still live largely in the same general area (similar to Asia, in many ways), it's an experience that Americans are rather unaccustomed to.\n\nGiven that there is evidence that Al Qaeda and portions of U.S. agencies were coordinating to create islamic militants in Bosnia and Kosovo, as well as the accounting audit that followed the wars and subsequent attack on the U.S. by Al Qaeda (C_A)... I, personally, believe Q is saying that there is a specific reason why President Trump and Q, himself, wasn't pursuing comments or research into that issue.  Though it could equally apply to Israel, since all discussion tends to collapse with the mere mention of it in many circles.  I suppose it depends upon which angle you are reading Q's post(s) from.",
			"time": 1568785020231,
			"files": "[]"
		},
		{
			"id": "8433ee71-8e1e-4d7b-9b17-0fc659cdae07",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5311feb9-80b8-482c-b2b1-37d87e1bc224",
			"body": ">>8ab2d58a-8cbc-47d1-aa15-5f98b3333c50\n> Don't think you can.\nAn individual once asked me how you kill a god.  Granted, he was a self-professed satanist, but I'll avoid a deep conversation about the co-option of edgelords by subversive arms of intelligence agencies/fraternal orders.\nHis answer was relatively simple: \"You kill all of its believers.\"  When no one is left alive to believe in a god, pass down its teachings and culture, etc - then it dies.\n\nWhile I disagree as I have a different definition of what factors constitute a god - the concept is applicable, here.  Any scenario or combination thereof that can scare people into abandoning not just zeronet, but content or users/zites that are a part of zeronet... effectively allows it to be erased.\n\n> Maybe a moderation company could come up with a \"forced moderation\" version of the millchan engine that downloads block lists automatically from a central moderation team.\n\nSee the above and reflect on it from a few different angles.  You might come to see my entire post, prior, in a different light.\n\n>>5ad8028b-dc00-412b-a323-0b085fb7fb1e\n> Hey, smartass, please explain to me WHERE in the FUCKING U.S.A. can I be arrested for a FUCKING DRAWING!!!\n\nSee above.\n\nHowever, while I do not generally participate in censorship, I will ask what the point of your posting these is.  Don't misunderstand - I don't think you are doing anything illegal and I don't really think you're sexually aroused by images of prepubescent girls.  Nor do I think the \"loli\" phenomenon in Manga/Anime is really driven by a sexual focus.  It's largely a joke or an edge theme where it appears, treated as an exploration of moral/ethical boundaries.  IE - why a taboo is a taboo or where that taboo becomes muddled.  Kind of like the \"we just found out we aren't blood related\" brother/sister plotlines.\n\nThat aside, taking the above into account, when the average person comes into an environment and finds or hears \"OMG, all the pictures of naked children all over the place\" would certainly provide 'evidence' of a 'need' to comply with blacklisting services and other such moderation schemes.\n\nSee my first paragraph in this post.\n\nI was on 8 in a thread that got hit with a bunch of real child pornography posts.  It was two girls and one man, appeared to be from the late 80s to early 90s photography, though that is by American standards - it could have been more recently from a third world, but the overall state of groom of the man in the picture implies my initial assessment to be accurate.\nThis would mean that the individual in the photos would be late 20s to mid 30s.  The children didn't actually look distressed in this particular set of images, it appeared to be some kind of routine they did with a trusted individual - still damaging to their psyche in the long run and something they should not have been subjected to, but the responses and reactions in the thread were rather amusing in their state of irrationality.  People who came by the board, later, were left strictly with their imagination in terms of what was actually posted, and by the descriptions being left behind, you would expect it was some kind of situation where the kids were locked in cages.\n\nSo... what was the point of that content being posted?  I believe it was two prong.  First, that particular board was being targeted by groups who really did not like 8chan existing.  The same groups claiming that 8chan posts manifestos are the same groups who like to claim it is filled with pedophiles posting illegal porn.\nHowever, I actually think that someone who was known to be active on that particular board and relevant to certain events was in those pictures.  IE - a victim was being threatened; and the individual posting that content indicated as such \"this is not over, we will be back.\"\n\n>>0ef88f0c-b819-488d-9ed3-f6b9bdc4711c\n>Stay safe out there anons!\n\nhttps://hooktube.com/watch?v=kUsFWO08CO0\n\"Because I was inverted.\"",
			"time": 1568787413331,
			"files": "[]"
		},
		{
			"id": "6fb4e304-f78e-40c3-bb49-f4075871a34d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5311feb9-80b8-482c-b2b1-37d87e1bc224",
			"body": ">>70e5e0a9-77a3-4c57-aba1-652b5fc4cf2f\nHow you choose to interpret my words is your prerogative.  Just because I can post lolis doesn't mean I am going to without some kind of prompt or relevant need to do so.\n\nIf you want an example of how to badger censorship hall monitors until they kill themselves - might I recommend studying the Pony Wars from half.  I'm not saying that \"we should censor ourselves\" - but that posting lolis is always going to be a rather niche thing.  Posting Pony memes or just Anime in general tends to drive the censorship types insane for whatever reason.\nFind something that everyone against censorship enjoys posting, and keep posting it with them until you break the censorship types like something out of the mind-break hentai galleries.\n\nI mean - if you want to post hentai lolis because that's your thing - that's your thing.  I'm simply pointing out that doing so for the sake of edgelord behavior is something that can be used against you in the long run.  Choose your targets and weapons wisely.  \n\nIf you haven't noticed, I'm actually against this particular group of censors.  For the reasoning I posted at first.  Only a retard would go onto a public forum like this and post evidence of their crime or something that could expose their little pedophile club.  While it may be a niche group, this platform in general is a horrible place to post pictures of you porking a kid.\nI believe the paranoia is way overblown, because the only reason that stuff was posted to public forums in the past was intimidation tactics that don't really work against this platform in the first place.  The only way to make it work would be to target groups of people to try and convince them to subscribe to voluntary services like the one proposed.\n\nI'm not saying that all of the voluntary services like this would be bad - and we all forecast their development.  I'm just extremely wary of the push for it at the moment, as it is very early in development/adoption and being the first to put together a 'public flagship' for ZeroNet and install within the public the view of \"you need these to survive out here in the wild west\" ... you see what I am getting at?",
			"time": 1568899762159,
			"files": "[{\"name\":\"391374_646836878667166_2037148788_n.jpg\",\"thumb\":\"21954836c9c1e3ae531678c20afb0fa6b64720bc-thumb.jpg\",\"size\":52746,\"type\":\"image/jpeg\",\"original\":\"21954836c9c1e3ae531678c20afb0fa6b64720bc.jpg\",\"directory\":\"17GmcqqqJdfEM4DkRsqvvprifPVwYx575h\"}]"
		},
		{
			"id": "68f85b5c-2076-49e0-8a8b-dfc019f460b8",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5311feb9-80b8-482c-b2b1-37d87e1bc224",
			"body": ">>bdb4bc28-33ec-4105-a755-f23fbef760ad\n>Way to miss the point entirely. Let me spell it out for you\nThe thing about stupid people (or, the state of mind that is stupidity, no matter how temporary), I have noticed, is not necessarily a lack of intellectual capacity in their own right.  It is an inability to comprehend the existence of intelligence outside their own.  It is this inability to use another's statements to interrogate their own understanding which continually blindsides them when the wit of others comes to fruition.\n\n>Why the fuck is there a PUSH to censor content that ISN'T EVEN ILLEGAL?!\n\nIs there a push?\nYou underestimate, to some degree, the tenacity and reach of certain subversive elements.  We are fighting against armies of fake accounts on twitter used to try and create the impression of consensus.  Facebook has a similar problem.  The media carts in a few activists and tries to make it sound like billions of people dropped their day job to go out and protest, even though most of the people in their shots are either rubber-necking or just trying to get fed on their lunch break.\n\nConsider what they would do to regain influence or control over a platform such as ZeroNet.  It is small, now, but that means it is also vulnerable to early efforts to seize development and control.  While it does us no good to try and accuse everyone who has anything to do with development of ZeroNet of being a glownigger - it is important to keep in mind that if I were in charge of such things at the CIA, I would be sure to assign programming teams to infiltrate the open source development to make sure some of the frst mainstream-acceptable versions of ZeroNet also had sufficient amounts of glow.  I would assign people to the community to be ready to create a large stink about certain issues to influence adoptions of pre-positioned assets that, again, favor my agenda.\n\nAgain - it does us no good to try and assail each other as agents, as there's little way of knowing and it would only impair the efforts of honest people.  Just something to keep in mind on the whole.  If the goal of this group is motivated by such an agency agenda, then posting a shit ton of loli hentai at them isn't going to change their mind, but it may give them ammunition to use in their subversion.\n\nAs this is, currently, it's a very small community and it's not really a big deal.  However, I do believe that it was 'your kind' who posted a bunch of loli traps with the intention of driving \"boomers\" away.  By this own action, you have admitted that many people are not exactly fond of encountering loli hentai and use it as a deterrant.  Posting it as a means of trying to argue against censorship doesn't really earn you any ground.  I'm not saying you shouldn't ever be able to post them - I am simply saying that if you were trying to encourage people to sign up for the blacklisting service, then you're doing a good job of it by behaving as you are, and this is precisely why I am saying what I am.\n\nRight now, I caution people in regard to this trend because of the above.  However, I also recognize that if ZeroNet is to become more popular and ultimately replace the internet (which it should), then there are people who do not want loli traps to be downloaded by their computer, at all, nor do they particularly care to see them and would also like to have measures in place to not have their kids bombarded with it, as well.\n\nRight now, it's a caution.  However, what would become a red flag issue is if these groups begin to resolve individual identities and begin to try and ban the people behind the screen.  Right now - you can shitpost on one ID or throwaway IDs, and still have your \"no, seriously, I wanted to actually discuss something\" ID.  If there becomes a focused effort to identify the users behind those IDs and ban IDs they create - that would be something to make a huge fuss about (though, again, not sure posting lolis would really make much of a point).\n\nThe scope of this effort that they announce also concerns me.  If I go to 08chan, I don't really have an expectation of decency.  If I were to go to, say, 0tube (or whatever they call it) and get full on pornography and snuff porn... some compartmentalization between a porn zite and a social media zite should exist - and some means of enforcing that, at least on a user level should exist.  Unless a zite says it's an anything goes sort of place, which is what 08 has the culture of and I do believe it is a bit glowniggery to start trying to blacklist people for posting edgy stuff here.\n\n>>faa36e26-eb2a-4822-b7cb-ab734a73120d\nindeed.",
			"time": 1569263446145,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}