{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "一篇关于社会主义的千字文，比起任何一部专著都更有说服力：公有制与人性的矛盾就是社会主义的根本矛盾",
			"body": "社会主义的内在逻辑\n空想社会主义，发端于早期基督徒的生活方式。在《圣经·使徒行传》中记载早期基督徒把自己的田产卖了，把银价放在使徒的脚前，献给集体（早期教会），集体成员没有私人财产，在一起生活，可以按需取用。这种生活方式在莫尔的“乌托邦”中被描述为一种理想的生活方式，然后在圣西门的社会主义理想中得到肯定，认为是无阶级剥削和压迫的理想社会。后来，傅利叶和欧文根据圣西门的设想进行了社会实验，可惜都以失败告终。傅利叶和欧文都是同情工人阶级悲惨遭遇的“大善人”，奇怪的是他们二人在社会主义实验过程中，都变成了铁石心肠的恶魔。就算空想社会主义变成了科学社会主义之后，列宁的苏维埃后来也变成了恐怖集中营。这到底是为什么？\n或许我们可以从社会主义雏型即早期基督徒生活方式中找到答案。《圣经·使徒行传》第五章记载了一对夫妻把自己的田产卖了，在献出银价的时候，私藏了一份。结果二人在使徒面前双双“仆倒断气了”。——神的惩罚是严厉的。即使你献出了绝大部份银价，但你仍有私心，就该死！\n私心——死亡！这就是社会主义必须面临的现实。要实行公有制，就必须消灭私心。公有制与人性的矛盾就是社会主义的根本矛盾。然而，基于人性的弱点，要消灭私心也不是那么容易的。于是，严厉的惩罚就成为消灭私心的必然选择。这样一来，社会主义就必然与高压、恐怖、警察、监狱和屠杀相辅相成。于是社会主义从最初的人间天堂变成了人间地狱，从理想主义变成了恐怖主义。社会主义者变成了恐怖分子！\n时代不同了，社会主义也在进步。依靠斯大林似的红色恐怖政策不仅会激起人民的反抗和唾弃，也会造成国际社会的围堵 。最关键的是社会主义内部的高级干部也认识到对自己的同胞进行残酷的监管不管从哪方面说都是缺乏合法性的。象前东德克格勃头子普京说起斯大林的残忍，还忍不住流泪。这当然不是他良心发现，而是对自己的同胞下毒手这种做法激起了全人类的愤怒。\n但社会主义者不会放弃他们的理想——当然，在遇到复杂的社会问题之后，他们也会转移注意力：从如何实现理想转移到如何确保执政。道理很简单：你都不能执政了，还能实现理想么？\n既然不能采用红色恐怖的办法来消灭人民的私心，那就采用一种更加精致的办法来控制人民。公有制本来就提供了控制人民的最好办法：全面控制，让每个人都依赖政府、单位或组织。同时加强对人民教育。教育有两个重点：一个是去私，一个是感恩。去私是要人民去掉私心，忘记自己的权利和需求；感恩是要人民感谢他们“为民谋利”。如果没有他们为你谋利，你活都活不下去。另外，因为事实往往不太像他们所说的那样，蒙蔽和欺骗也成为他们教育人民的重要手段。\n你既然不得不依附他们，就必须做顺民，一切行动听指挥。不听指挥那你就惨了，在前苏联的“契卡”时代，消极怠工是与反革命一样的罪行。\n后来，因为控制一切就只能实行计划经济，但计划经济造成物资匮乏，全民赤贫。所以全面控制改为重点控制，许多与民生有关的领域开放了。人民在这些领域有了一定程度的自主权，他们可以创造财富了。这段历史时期，社会财富极大丰富，人民的生活有了天翻地覆的变化。这见证了人民一旦拥有自己的财产和自主权利，就会爆发出巨大的创造力。\n但这样一来，社会主义者感觉越来越不安全。如果越来越多的人不受他们控制，如果所有人都不依靠他们自立存活的话，那他们岂不是多余的？如果他们是多余的，如果不要他们执政了，那社会主义理想还要不要呢？他们又如何执政如何带领人民实现社会主义理想呢？所以，控制又必须加强，曾经放开过的领域必须重新关闭，于是，国进民退开始了，有关民企完成使命该退场的论调就出来了。\n这就是最近百年来社会主义发展的内在逻辑。你是不是有一种醍醐灌顶的感觉？",
			"added": 1550893246,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"35_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 1,
				"body": "它的确是垃圾。明知我们翻出来不容易，还经常封ip。注册一个封一个。我干脆不去看他了。",
				"added": 1517633581
			}
		],
		"91_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 2,
				"body": "美国在川普总统的领导下，只是想做美国而已。从前的美国，被“政治正确”所挟持，所捆缚，在国际社会投鼠忌器，其实并无多大实际作为，因为受到另一些具有否决权国家的牵制。所谓政治正确，是指必须坚持如下的一些观念：和平至上（即使面对邪恶，不惜妥协也要和平）；种族平等（不得有丁点儿歧视性言论）；利益至上（只要利益，不要意识形态）；全球责任（理所当然地认为自己有全球责任），等等。这些观念并没有经过严格的批判。现在川普不过是对这些观念进行反思罢了。",
				"added": 1519359311
			}
		],
		"2_1L4yxgH1aSH8S6qG4QsoV4xpSDDNssQSz1": [
			{
				"comment_id": 3,
				"body": "发个网站链接或下载链接吧。有些人听都没听说过。",
				"added": 1550888073
			}
		],
		"1_1J8HJmmp6DfTpe2N12r5Honmsvzsgacaz1": [
			{
				"comment_id": 4,
				"body": "没人看？",
				"added": 1551336367
			}
		]
	},
	"comment_vote": {}
}