{
	"title": "USDoJ.bit",
	"description": "",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 6,
	"demo": false,
	"modified": 1510383155,
	"post": [
		{
			"post_id": 5,
			"title": "If the FBI Website Was Actually Honest and Truthful",
			"date_published": 1510381632,
			"body": "By David Lee Rickman II\n\nHello! We are your ~~overlords~~ ~~masters~~ \"friends\" at the U.S. Federal Bureau of Investigation.\n\nOur agency's acronym is F.B.I. which is an anagram of \"FIB\" which means \"lie\". This is why it seems only dyslexics realize what we're all about. And boy do we lie like a dog! Remember back during the aftermath of the Boston Marathon bombing when the FBI stood in front of the media begging for the public's help identifying the suspects? Were you at all surprised when it turned out the FBI already knew who the suspects were because Russian intelligence had warned the FBI in 2011 about Tamerlan? You weren't if you mix the I and B in FBI around.\n\nOf course, the FBI always knows right away after a terrorist bombing who the guilty suspects are. Just ask Richard Jewell. Oh, wait...Never mind.\n\nThere are some trying to get more than the dyslexics to realize how dishonest we at the FBI are. For example, the TopTenz YouTube channel has a video titled \"[Top 10 Cartoonishly Evil Crimes Committed by the FBI](https://www.youtube.com/watch?v=G0O9ugyOSCw&t=49s)\".\n\n10\\. Trying to Force Martin Luther King Into Suicide\n9\\. Framing Innocent Men for Murder\n8\\. Spying on the Supreme Court\n7\\. Organizing Terror Plots\n6\\. Blackmailing People With the No-Fly List (Allegedly)\n5\\. Planning a Terror Attack on American Soil\n4\\. Spying on People it Knew Were Innocent\n3\\. Covering Up the Murder of Black Panthers\n2\\. Giving Allies Free Reign to Torture and Murder\n1\\. Allowing James ‘Whitey’ Bulger to Get Away with Murder\n\nWe at the FBI recommend you not watch the video for more details. Anyway, all of those things can be easily explained away. For example, every white government worker at the time wanted MLK Jr. dead. It wasn't really that big of a deal at the time. Just like framing innocent Muslims isn't a big deal nowadays.\n\nAnother YouTube video that would be doubleplus ungood thoughtcrime to watch is [Alltime Conspiracies' \"How The FBI Breaks The Law\"](https://www.youtube.com/watch?v=6LmY9bbttIM&t=183s). There are things that you really shouldn't know and that 2013 Huffington Post thing about the FBI 56 field offices authorizing informants to violate the law at least 5,939 times in 2012 alone. A little knowledge is a dangerous thing so don't know such facts. Especially if you are one of those useful idiot judges who stops asking questions and signs whatever the FBI puts in front of them when FBI agents use such words as \"confidential informant\", \"classified\" or our favorite; \"If you don't sign that warrant after we just perjur...errr...swore under penalty of perjury then another 9/11 is gonna happen.\"\n\nWhy should you want to be an FBI agent? We have a great medical plan and the resources to allow you to stalk your ex-girlfriends. Also, between 1920-1933 we contaminated alcohol and caused at least 50,000 deaths to enforce the prohibition laws. The next time we decide to poison the American public wouldn't you like to know the secret markings on the containers that will kill you? Until we decide who to kill next there are many opportunities to fail upwards in the ranks of the FBI."
		}
	]
}