{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "小心protonmail！",
			"body": "不知道我out了没有，前段时间才发现这家公司和华为合作准备用在国产手机上面，之前还声称不保存用户资料什么的，从名字上看这家公司的ceo是华人，无论他们声称的如何为用户保密，一旦跟中国挂钩下来屁毛秘密没有，大家小心啊",
			"added": 1567945648,
			"parent_topic_uri": "19_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {},
	"next_comment_id": 14,
	"comment": {
		"6_1NUPxZD5kGC1RiuppDV1iRtNukZS5oZqw5": [
			{
				"comment_id": 1,
				"body": "> [xyoax](#comment_19_18JqgXYQvzEHxKm3CyMN3k9JxsPfVpisJm): 反共不等于反华,中国人大部分不是共产党,共产党与人民的利益并不一致,他们中多数人追求的权利金钱,内部派系也不少,看看薄熙来周永康,至少现在的共产党腐败专制需要变革.\n\n共产党哪里来的？不也是中国人里面出来的？全世界就这里是共产党独一无二的温床你们不觉得奇怪？",
				"added": 1564535261
			}
		],
		"1_1JRYCe7ZmABZF7Bak4tA9QzdYoY8z1t1oY": [
			{
				"comment_id": 2,
				"body": "如果我是香港人我当然会上街好歹去拼一拼不至于一点机会都没有，毕竟谁也不想像维权人士那样莫名其妙的在内地消失在黑监狱里面，失败是肯定的但起码我拼过了",
				"added": 1564535506
			},
			{
				"comment_id": 6,
				"body": "> [larryli](#comment_4_15XgimLei7pAS9kqo3MqCtiqPmZWwgaNwb): 请问一国两制哪里变了？你是指23条一直没立法么？导致现阶段出现有危害一国的行为不能严惩。另外，自动送中的笑话可不是什么“深圳”人，某果日报还说的是要查DNA呢。\n\n那么多年来大批量开放大陆移民来掺沙子，收买港府议员，调警察到大陆学习，这次好像hsbc的港币发钞准备金都给挪用掉，都饥不择食了还说没变？现在广东部分地区和杭州街头警察收集行人唾液是干嘛的？癖好吗？",
				"added": 1565312839
			}
		],
		"2_1DvQJKRFe1BYN3gyctA3BkjuxUQN8bRCof": [
			{
				"comment_id": 3,
				"body": "以后政治形势严峻非官方vpn肯定完蛋的，共产党的底线就是不能倒台，一切威胁到这点的他们一定要搞死，现在整体国际形势偏向保守化大家又不是不知道，习近平又是个50年代sb洗脑教育出来的二货（初二就辍学）还玩独裁，vpn他们是没有能力彻底封死，有能力他们会怎样？",
				"added": 1564536066
			}
		],
		"18_1Q2yjutP8VevpmW5ZuKzNcDUQbUFn3gsVT": [
			{
				"comment_id": 4,
				"body": "关键还是这里的人如何，国人的德行放在全世界上看都是独一无二的，底层无知无良残忍愚蠢，高层无耻野蛮，还都很贪婪，城市农村对比下你会发现下面的搅屎棍烂泥侠比比皆是，看过箩筐里面的螃蟹没有，爬上去的全部被后面的扯下来，换个时髦的词叫做腾笼换鸟，然后循环，放到生活的各方面去看都会有发现的。\n而且这片土地的文化几乎扭曲了任何进来的事务，看看历史，君主立宪玩成皇家内阁，民主政治玩出终身大总统，共产主义玩出极权领袖。就算万一共产党垮台，西式民主过来被扭曲成什么样子先不说，假设生活没有变化待遇没有提高，就国人这猪的德性他们是不是觉得民主确实不行？          \n呃，对了，文艺复兴的前提之一就是低人口，就大陆这里人口的密度，不用说了吧。下面的搅屎棍欲求不满为了翻身可是敢于付出任何代价且无视造成多大破坏的哦，他们有多少人呢？\n算了，我还是继续看戏吧",
				"added": 1564620800
			}
		],
		"14_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 5,
				"body": "流血的选项，只有不流血和流尽最后一滴血两种选择，共产党这帮sb怎么蠢到这种地步",
				"added": 1564751476
			}
		],
		"115_1DcMmKhgdfkR1GDA6zhWhoFRreaej4wLmW": [
			{
				"comment_id": 7,
				"body": "当一家公司结构像间谍机构，看起来像间谍机构，行为上像间谍机构，运营上像间谍机构，那么它就是间谍机构",
				"added": 1565563787
			}
		],
		"16_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 8,
				"body": "版面好像被黑客锁住了，没有回邮件，投票数字也没有变化",
				"added": 1566773707
			},
			{
				"comment_id": 12,
				"body": "> [testuser3](#comment_69_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg): 郭文贵爆料：中南海内部消息，中共家族想出兵台湾甚至不惧挑起第三次世界大战，他们要行动了！定义为恐怖组织目标达成！这不是目的，但能让大家看到CCP如何搞信息战，篡改数据等等。由此借助国际力量一同反共，仅靠民众抗议力量微薄，历史经验表明非暴力革命成功率最高，争取各方力量才能成事，无论苏维埃支持的CCP还是美国加入的抗日，想要自由民主的生活，想要吃得起安全的红烧肉必须通过非暴力革命灭共！暴力革命成功率可参考编程随想的博客。对于极端邪恶的匪类要坚决的干掉，对于被洗脑的人要给与时间和资源（包括但不限于知识，历史，信息等）让其醒悟，维护土共的粉红和当年的红卫兵没什么区别，但对其要仁慈为主以德服人，不能像极端分子那样用极端手段对付被洗脑的人，否则只会社会大乱！仁慈和正义是光明而强大的力量！\n\n这个郭文贵已经被证明是中共间谍了，怎么还有人吹嘘他？\n前面8月4日军队入港来暴力镇压的消息就是他放出来的，1个多月前还被曝光雇佣sv去调查有cia背景的人。监视窃听各种政治，异议人士，在中美之间转移资金。之前官僚内斗把他丢出来爆政治对手的料时一帮水军5毛转了一圈就开始帮他说话我就奇怪了怎么会有替自己叛徒说话的，原来还是自己人哈？",
				"added": 1567637432
			}
		],
		"443_157kFKiaEbRUds2HCBUpv33t4Unezi6dR6": [
			{
				"comment_id": 9,
				"body": "开片前军事技术的投入比例肯定是增加的，其他方面难说",
				"added": 1566941369
			}
		],
		"4_18JqgXYQvzEHxKm3CyMN3k9JxsPfVpisJm": [
			{
				"comment_id": 10,
				"body": "毛泽东的瑞金根据地的全称叫中华苏维埃共和国，还叫出口号“保卫苏联”，他这算不算分裂中国？抗战时期勾搭日本人，算不算汉奸？一辈子就到苏联朝圣这一次，拜苏联为爸爸，为了那点二手军事工业把各个死角角落（传不出声音的地方）农民的口粮抠出来换外汇，绝不绝？\n更不要提80年代初中共跪舔老外的事情了，北京还出过“民主墙”之类的事情，后来还是怕失控才拆掉了，你以为他们不会做汉奸吗，熊瞎子岛那些地方最后确认主权的条约，你看看谁签的字。\n就是现在这个习近贫，你看看他全家除了他国籍在哪里？前段时间澳洲那个到赌场洗钱的，姓齐的，一次几百万美元挥挥手而已，他跟习什么关系？\n他们把家属送到国外潇洒，自己说爱国，你来看看，谁是汉奸？",
				"added": 1567117333
			},
			{
				"comment_id": 11,
				"body": "我突然还想到一点，至少能卖才能称得上汉奸吧，能卖主权出让利益卖纳税人的税款的能是普通人吗？卖国？你有国才能卖吧？你一根韭菜，镰刀怎么割你你还爱它，还要其他韭菜警惕那些让镰刀不要割得太狠的人，你是奇行种还是有自虐倾向？",
				"added": 1567205584
			}
		],
		"1_1AHFnAT7uYHzTxEyHSdguC45fKq5KWakHB": [
			{
				"comment_id": 13,
				"body": "原先在今日头条看到的这个消息，由新浪科技频道官方账号发布。\nhttps://twitter.com/ProtonMail/status/1170681406684651521\nhttps://www.reddit.com/r/ProtonMail/comments/d0r6c5/huawei_eyes_protonmail_as_gmail_alternative_amid/ezckcjs/\n哦......官方表示只是考虑允许华为使用，他们的ceo和founder名字叫严安迪，台湾人。\n另外proton有安卓客戶端，安卓能直接安裝proton的客戶端，华为就不能？允许华为设备使用，我可以理解成会在华为手机里预装proton客戶端没有？\n跟这么一個让公布拍月亮算法的实验者最后低头认错公开发道歉信的，在微博上嘲讽被拘留几天的，孟被拘，全国讨伐，外交部直接喊话，并抓前加拿大外交官为质的牛逼烂货公司达成协议，这是不是为了钱？\n目前只是为了点钱预装客戶端到华为，以后会不会为了钱让华为进入到proton的核心业务让其变成钓鱼邮箱？\n我只是怀疑，提个醒。这个是谁爱用就用，另外小众的匿名邮箱还有不少，不过安全性还有待证实和检验。\n另外说下，国内没有屏蔽proton，Gmail倒是被屏蔽了。",
				"added": 1567980963
			}
		]
	},
	"comment_vote": {
		"11_1NUPxZD5kGC1RiuppDV1iRtNukZS5oZqw5": 1
	}
}