{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1611909944_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 1,
				"body": "> [portableguy](#comment_8_1EdFvRMCSsjRQDSwKEaYDu3aU2o5PfzhrX): Even if you do not show symptoms you can be carrying the virus allowing it to jump to someone else who dies.\n\njab wont save anyone else neither. Bug can still jump even vaccinated person can transmit that further. So again, tell me pros of talking this vaccine?",
				"added": 1614810658
			}
		],
		"1611968483_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 2,
				"body": "> [deuxzaron](#comment_97_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): Do you think quarantines haven't happened before? Not in most of our lifetimes so their annoying. but like the ones of the past. they will end\n\nYeah, will end when enough people are pissed off to the boiling point.\nAll this plandemic is created to cover greatest transfer of wealth from bottom to top. They printing money like crazy and eventually they will say, ohh well. We cant go like this anymore. Lets reset all this shit , create cbdc and make sure nobody have ownership of anything. Simple example: Unrealised capital gain tax. \n\nJust imagine: You buy a house, you will live in this house till you die. Also your family. SO it looks like its not investment. Its necesity. But they will classified this as investment and every year you will be paying tax on this even though you not selling your house. That;s exactly how they will get properties for cheap. \n\nPeople will live in \"rental\" type of properties. \"rented cars\" and everything you can imagine. \n\nMoney will have \"best use before\" date let say 30 days and if you not going to use all your money within that period they will tax you let say 40%. That way they can make sure velocity of money is kept at certain pace. \n\nPeople wake the fuck up.",
				"added": 1614811482
			}
		]
	},
	"comment_vote": {
		"5_13UNccDwDNZx97EtsahFYrU3e5u4YGFbs7": 1
	}
}