{
	"next_topic_id": 11,
	"topic": [
		{
			"topic_id": 1629992488,
			"title": "where is the post about people not seeing medical tyrannie? I can't see it...",
			"body": "shadow banned? deleted? what is going on?",
			"added": 1629992487
		},
		{
			"topic_id": 1629992646,
			"title": "Loyld austin doesn't know that China relation with it's neighbors...",
			"body": "is older than christianism... it's incredible than a low iq, no education, sell out, incompetent fool can't be removed because of his skin color... anyway, I have never seen nor could be believe to see such an incompetent pretorian guard... at least in Rome there was unity and meritocratie at the top of the dark forces... usa? idiots on idiots... I guess it's the neural implant bugging... how is gen pedomattis going? on ivermectin or vaxxed like a good medicalmarxist? hahaha...",
			"added": 1629992644
		},
		{
			"topic_id": 1629992958,
			"title": "the argument that ample clothes have more chance to stuck in machinery isn't valid",
			"body": "ample clothes act as a buffer... if clothes is taken out already... or resaid if there wasn't clothes... you get where I am going or never saw a modern machinery in motion?",
			"added": 1629992955
		},
		{
			"topic_id": 1629993643,
			"title": "good trick : share users.json",
			"body": "more chaos, more ressources used... noise making.",
			"added": 1629993639
		},
		{
			"topic_id": 1629999661,
			"title": "gavin newsome, cali, made a hole in the envelope for his recall...",
			"body": "to see if it's yes, to trash it... ahahahah nancy style... so dumb, only working on fucking amerian unable to put a fucking straght bullet in the fucking head of this fucking witch...\n\nso simple... so pathetic...\n\nshitty...\n\n\nand cia\n\nthe fbi\n\nthe dod\n\nmoneywhore..\n\norganic droids\n\neach death of those droids, or loss of operations, is a step in the liberation of mankind...\n\ntruely.\n\nI know I am still brainwashed or having of bad neuropath due to years of formating, but yeah, the faster they exterminated from the world or universe, the better it is for everyone, including the aliens...\n\ndie americans die die die",
			"added": 1629999656
		},
		{
			"topic_id": 1630000073,
			"title": "and now russia is becoming gay... you want to stop silicon valley harveting?",
			"body": "kill on child of zuckerberg... or maybe not yet of cherril sandberg... you will... it will work\nit's the only way... fine them... russia... print mother if you want money, they do to pay your \"penality\"\n\nmonnngoooesss\n\nwhite men... shame on all of you.",
			"added": 1630000067
		},
		{
			"topic_id": 1630000350,
			"title": "defcon warning to china mss / pla... there is a gayism thing going on",
			"body": "I don't know how the sitaution is going in china, but I sure kung fu group... maybe is too contaminted... who knows...",
			"added": 1630000343
		},
		{
			"topic_id": 1630008208,
			"title": "it's time to frag the officer corp !",
			"body": "",
			"added": 1630008200
		},
		{
			"topic_id": 1630011135,
			"title": "I am happy for the bank for fired the competent intelligent gravcious etc female...",
			"body": "ahhhh... ambiance, party night ! one less ! restoration... I can't image the torture endured by those brave bankers to survive a female presence in their dominion...",
			"added": 1630011126
		},
		{
			"topic_id": 1630012914,
			"title": "what is cepi plan?",
			"body": "",
			"added": 1630012904
		}
	],
	"topic_vote": {},
	"next_comment_id": 173,
	"comment": {
		"1629910533_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 1,
				"body": "nice to see TMA... tokyo medical association entering the arena... I guess the full board is on board and assassins ready to murder american agents who will seek to prevent ivermectin in japan? slash slash",
				"added": 1629990650
			},
			{
				"comment_id": 2,
				"body": "should all the children of those who pushed those vaxx crap be katana-ed?",
				"added": 1629990691
			},
			{
				"comment_id": 11,
				"body": "no alex jones lead humanity to it's demise. he works with and for the globotrash. why? violence is was and will always be the answer.",
				"added": 1629994103
			},
			{
				"comment_id": 12,
				"body": "never forget this man is an american. enuff said.",
				"added": 1629994128
			},
			{
				"comment_id": 13,
				"body": "wasp, the worst kind.",
				"added": 1629994137
			},
			{
				"comment_id": 14,
				"body": "or awasp to be exact. as american for the 1st a.",
				"added": 1629994163
			},
			{
				"comment_id": 15,
				"body": "and sucks zio cocks all day long... when trumps one isn't his life obsession.\nit's because of him and men like him that we are in this situation\nmen unable to kill a cia director or fbi director entire families\nmen weak, who prefer to be organic droids than FIGHT FOR LIBERTY !\nmen so weak and stupid they even forgot the history of the founding of the American Republic...\nat least the brits didn't forget.",
				"added": 1629994271
			},
			{
				"comment_id": 16,
				"body": "even if some fucking invaders of the british isles seek to erase the past of england...",
				"added": 1629994288
			},
			{
				"comment_id": 17,
				"body": "with the complicity of way too many morons and low iq, little serfs and already organic droided...",
				"added": 1629994329
			},
			{
				"comment_id": 18,
				"body": "I fundamentally despise weakness or the appearance of \"force\"... or you know how to wear a katana or you don't. if you don't, don't wear one.",
				"added": 1629994384
			},
			{
				"comment_id": 19,
				"body": "the day when japan leaves usa and western orbit, to restaure peaceful relation with mighty giant west... ahh finally peace.  the end of the war...\nthen liberation of hawaii from the filths.",
				"added": 1629994473
			},
			{
				"comment_id": 20,
				"body": "and so for once the morons nsa boys will see a real front line moving toward them (morons as those who will wait for an evacuation order... ahahahah).",
				"added": 1629994526
			},
			{
				"comment_id": 21,
				"body": "organic droids, that's all you are to them, and it's true otherwise you would oppose to be it.",
				"added": 1629994571
			},
			{
				"comment_id": 22,
				"body": "and they laugh in their little readout... they did the same in kabul... see you soon...",
				"added": 1629994608
			},
			{
				"comment_id": 23,
				"body": "some worry at night, others party with tax payers dollars... a classic. maybe roman pretorian guard was as shitty... who knows... I wasn't there.",
				"added": 1629994662
			},
			{
				"comment_id": 25,
				"body": "lol... you sucks , your mindset sucks. you are a loser... an american.",
				"added": 1629994964
			},
			{
				"comment_id": 26,
				"body": "to be so dooff to believe there is a political solution... pathetic... \nkill the fuckers, end the game.\nnothing matter\nnot your republic\nnot your 1776\nnothing.\nwarfare.",
				"added": 1629995021
			},
			{
				"comment_id": 27,
				"body": "for me it's the maxi paradox... a sucker for money, a trump whoreshiper, an idiot and low iq, who read the white papers of the global order... woooo\nso smart\nit tells you the level of idiocy of the usa...\npathetic.\nshameful...\nmorons on morons on morons...\nand the red skin, they must be super morons... or the american founders weren't morons... hmmm maybe?",
				"added": 1629995114
			},
			{
				"comment_id": 28,
				"body": "and this guy believe as his first wife was jewish that his kid are israelis... pathetic... primitive... tribal... at least blm isn't bullshiting with \"saving africa\".",
				"added": 1629995180
			},
			{
				"comment_id": 29,
				"body": "seriously, he has the gretha head... maybe it's a virus... who knows....",
				"added": 1629995250
			},
			{
				"comment_id": 30,
				"body": "the core problems those western statists believe in the nwo... as their academics. why they don't want the well regulated free market? because they suck at it... so they prefer to rule to loot, rather than make and buy  (by selling before) duh for the little morons here...",
				"added": 1629995341
			},
			{
				"comment_id": 31,
				"body": "example lyold austin would be fired from any mcdonald, as milley... you don't want such morons in a corporation...\nI guess the selection for inversion will hard to save the corps to move to china, some will not be allowed and will die in the melting pot...\nhehehehe chinese mothers are hard business partners, but just.",
				"added": 1629995430
			},
			{
				"comment_id": 33,
				"body": "fundamentally alex jones is like all the western msn (otherwise he would be like assange), the only difference is that his crumb are better than most and contrary to some (russia) he doesn't seek to conquer the world  :D (russian news is often very biased when in operations... like the \"jab\")... so russian news is higher quality in action, naturally, but is lower in global framework analysis... I didn't mention china news? see it for yourself...",
				"added": 1629996088
			},
			{
				"comment_id": 34,
				"body": "dumb enough to think that \"mcconnel\" could help... this guy should be with his whole family be executed, like Mike Pence...",
				"added": 1629996788
			},
			{
				"comment_id": 36,
				"body": "mongoes... with their emergency fda shit there? pffff... same crap... gotfielf must pay... you don't get it... it's taken over , they don't care of your laws... they have moved on.... so it's just noise... noise... \nwar is the answer.\nthe new legal theory : as FDA authorized pfiser, others vaccine emergency authorisation become mute... in THEORY... they don't get it... ahhh the lawyer... the american scamer... from a nation for the people, to a nation for the lawyer, by the lawyer to feed themselves as piglish as the muppets in the intelligence commiunity and their organic droids on the battlefields (eating subway at the base... )....\ndie america die.",
				"added": 1629997992
			},
			{
				"comment_id": 37,
				"body": "usa 2.0",
				"added": 1629998004
			},
			{
				"comment_id": 92,
				"body": "sorry new girl but you are really not appropriate for today... I mean, a little white trashy, not well prepared, and worst, like happy to be there... it's war... motherfucker but you don't get it... you are on TV... wooo woooooo wooooo ! look at me...",
				"added": 1630006285
			},
			{
				"comment_id": 93,
				"body": "in short americans are happy to be executed as long as it's live... ahh their moment of glory ! they exist... look at me... look at me... me memememmeememememme",
				"added": 1630006325
			},
			{
				"comment_id": 94,
				"body": "ps dear future people what I write on americans, is what  i believed at hte moment... could change, could be faulty, could be wrongly expressed, due to the volume, there is 0 quality control... so you read yes, it could be no, and inversevely, ,and maybe even in a double negative, wanting to say no but said yes but thinking yes correct in no... you are lost... of course it's already the past...",
				"added": 1630006425
			},
			{
				"comment_id": 95,
				"body": "no she is well prepared today ! but the problem she smiles way too much ! it's WAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAARRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRR !",
				"added": 1630007427
			},
			{
				"comment_id": 96,
				"body": "and she says indians had small pox treatment... what a surprise...",
				"added": 1630007460
			},
			{
				"comment_id": 97,
				"body": "ahh plant extract syrnya papooya... \nof course rockfeller, the fda, big pharma, their silicon valley hate it...\n\nhate it...\n\nORGANIC DROID WE WANT.",
				"added": 1630007528
			},
			{
				"comment_id": 98,
				"body": "like in starcraft... the zuckerberg generation... they want us to be their little crystal harvesting bots...",
				"added": 1630007557
			},
			{
				"comment_id": 99,
				"body": "as some one said it's FRAG time... time to kill all the pedos generals of the usa, cia, fbi, doj, fda, epa and the list goes on...\ntrim us federal gov /on",
				"added": 1630007747
			},
			{
				"comment_id": 100,
				"body": "biden biden biden biden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenbiden biden bidenvvvvvv",
				"added": 1630007796
			},
			{
				"comment_id": 101,
				"body": "the wef will pay us... uno rule... wooo woooo...",
				"added": 1630007820
			},
			{
				"comment_id": 113,
				"body": "I promise you alex jones is a peaceful troll... if he seeks the true path of the christians, die on the cross... more power to him...",
				"added": 1630008497
			},
			{
				"comment_id": 114,
				"body": "lol the christans never put down the roman empire...\nlol\n\nit's hte roman themselves who become like you today\nthen the smarties and real warriors went with the barbarians\nand with a little management and knowledge, the barbarians had all the courage and stamina to smash the remenant of rome.\nsimply...",
				"added": 1630008612
			},
			{
				"comment_id": 115,
				"body": "why? because the barbarian culture was meritocratic... top \"dogs\" or lead barabarian warriors, woooff... big guys... and I don't mean in size...\n\nlike once upon a time the Khan...",
				"added": 1630008769
			},
			{
				"comment_id": 116,
				"body": "men of honor and dignity vs roman filths... lying , deceiving, honorless, wordless...",
				"added": 1630008873
			},
			{
				"comment_id": 117,
				"body": "barbarians told you yes, it's yes.",
				"added": 1630008890
			},
			{
				"comment_id": 118,
				"body": "no it's no.",
				"added": 1630008896
			},
			{
				"comment_id": 119,
				"body": "the restoration of clarity.",
				"added": 1630008916
			},
			{
				"comment_id": 120,
				"body": "so the girl is back... so what happen with the husband, or father? color yellow maybe a sign? he cheated? or was framed by the cia to cheat? who knows...",
				"added": 1630008970
			},
			{
				"comment_id": 121,
				"body": "biggest error of the foreigner to america is to believe that it's only a financial battlefield... nope it's worst, it's a social battle space... I bet biden first wife was killed by design to hurt him, like trump what happened with his first... I am almost sure... their is this conspiracy that none of the victims wants to talk about...",
				"added": 1630009069
			},
			{
				"comment_id": 122,
				"body": "we are in dune from herbert than anyhting else you read or see on tvv...",
				"added": 1630009088
			},
			{
				"comment_id": 123,
				"body": "but what I find funny with this girl, compared to the other is how deceiving she can be...\nlike when she said about the infowarstore.com : help US... like she was there since 2 days... lol\nor how she fakes it all with the callers, specially one with his \"appearance\" remark... ah yes yes you kept good appearance... we couldn't see it... blah blah \nand her, smiling, and all yeah yeah... pfffffff\nseriously serenity of war is so much better than treasonous weaklets who prey on the vunerabilities of Man.",
				"added": 1630009281
			},
			{
				"comment_id": 124,
				"body": "better to be on the other side of the talibans than with deceiving things like her.",
				"added": 1630009302
			},
			{
				"comment_id": 125,
				"body": "what troubles me is the capacity of females to not be able to keep an emotion... in short they are fleeting...",
				"added": 1630009342
			},
			{
				"comment_id": 126,
				"body": "I take back my rome fall, but as a barbarian you have to push to make the wall of rome fall... even if those at the time were gay homo trans educated bitches, the wall were made by men...",
				"added": 1630009401
			},
			{
				"comment_id": 127,
				"body": "oh, let me shine my helmet... the polishers of rome...",
				"added": 1630009429
			},
			{
				"comment_id": 128,
				"body": "does my pant uniform put my ass in value? is it good?",
				"added": 1630009454
			},
			{
				"comment_id": 129,
				"body": "I am not far from reality, I guess...",
				"added": 1630009468
			},
			{
				"comment_id": 130,
				"body": "and personally when I saw it was going to go bad is this morning RT picure with soldiers siting on a brick half wall with big lines... I was what the fuck are they doing there\nand then told myself that maybe they knew all those people, like a stupid morons...\nit's warfare zone and the guys pretend to intermingle with the natives...\nbuffooons... CRT training, wokist, gay dick sucker and blondies with pony tails...",
				"added": 1630009568
			},
			{
				"comment_id": 131,
				"body": "why I said nothing? am I geting paid like them? noooo nothing, worst, insulted, framed, psywafare,d, psychwarfared, censored, banned, excluded... terrorized... great.",
				"added": 1630009642
			},
			{
				"comment_id": 132,
				"body": "and for me, anyway, all combat operations ceazed when epstein was exposed. worldwide.\npriority 1.\nnothing was done.",
				"added": 1630009686
			},
			{
				"comment_id": 133,
				"body": "what I wanted, combat freeze WORLWIDE\nhunt for the pedos\nreturn to the evaluation of the state of the battlefield with the fact and data extraction from all pedos...\nennemies could have become allies and allies enemies.\nas such the combat freeze.\nbut noooo.",
				"added": 1630009749
			},
			{
				"comment_id": 134,
				"body": "as it was clear it was israel... assault on IDF...\nthat would have changed the worldwide battlespace...but nooo... nooooooooo nooooooooooooooooooooooooooooooooooooooooooooooooooo\nsaid ivanka and jared, then they showed trump tapes to trump, and fearing his daughter saw them, backed down.",
				"added": 1630009814
			},
			{
				"comment_id": 135,
				"body": "that's why you don't do black mail... 101.",
				"added": 1630009836
			},
			{
				"comment_id": 136,
				"body": "solve find kill. next problem... like how are the sewers of shenzen working today?",
				"added": 1630009866
			},
			{
				"comment_id": 137,
				"body": "dear talibies if you think it's hard to run an aiport... wait for the day shenzen sewer size will be necessary for Khandahr... you will understand what problems mean...",
				"added": 1630009921
			},
			{
				"comment_id": 138,
				"body": "and there you understand the internal war on corruption.. even when everything is working perfectly we are still not far from the apocaliypse... cacapolcalpyse...",
				"added": 1630010019
			},
			{
				"comment_id": 139,
				"body": "you had flood over... God have mercy :)",
				"added": 1630010036
			},
			{
				"comment_id": 140,
				"body": "just imagine... bargram lights up (when pedo gate was exposed), talibies start to wonder what is going on? iranian air space open up as soon as they realize it's for REAL.... \n\nand soon talibans hear : IDF was defeated.",
				"added": 1630010113
			},
			{
				"comment_id": 141,
				"body": "relation would have changed dramatically...",
				"added": 1630010130
			},
			{
				"comment_id": 142,
				"body": "and they see the whole israeli intelligence community , military, political being executed one by one on tv...",
				"added": 1630010180
			},
			{
				"comment_id": 143,
				"body": "and then the pruge of usa...",
				"added": 1630010192
			},
			{
				"comment_id": 144,
				"body": "but noooo nooooooo....",
				"added": 1630010202
			},
			{
				"comment_id": 145,
				"body": "then the battle of england, the storm, the capture of the queen and all the king line to get the prince... so nice...",
				"added": 1630010257
			},
			{
				"comment_id": 146,
				"body": "at the end it would have been an honor for the talibans to host such a proud military... but no...",
				"added": 1630010285
			},
			{
				"comment_id": 147,
				"body": "and if trump trained by his mentor \"cohn\" who ran sexslave, wasn't rtapped by epstein, it's 100% the fault of jared and ivanka...",
				"added": 1630010382
			},
			{
				"comment_id": 148,
				"body": "the problem is that a corrupt replic is unmanageable... so his the girl speaking about her life or trying to fill the air with useless narrative (real narrative : kill nancy... there we speak until then, expose expose expose more... at least what does \"shangri la looks like\" I mean gates home, and what did he do with epstein? huh... even myself my neuropath are contaiminated... it's like seeing the berghof of adolf, and not realizing that the shangria la of bill gates is maybe even worst... you see? neuropath... the berhoof, I see that as teh hitler bunker where he lost hte war, but I am sure germans at the time had the same neuropath as I do with the bill gates home.... fascination, modernity, high tech, beautiful (maybe)... see what I mean? conditionning... not about toilets...",
				"added": 1630010565
			},
			{
				"comment_id": 149,
				"body": "and imagine the phone call to damascus : we are moving west from damascus. hang up.\nbashar, what the fuck is going ? american invasion, but htey said they are going west of damascus?!!?\nit's a trap say his gang\nuntil they see the war begining against IDF...",
				"added": 1630010737
			},
			{
				"comment_id": 150,
				"body": "and say : OMG... this what real war looks like.... yeah yeah...",
				"added": 1630010754
			},
			{
				"comment_id": 151,
				"body": "and a few hours days later... we are back to our shore... have a nice day. bye...\nbashar shell shocked, maybe nothing would be left all west from damascus...\nthat's the enemy.",
				"added": 1630010820
			},
			{
				"comment_id": 152,
				"body": "or maybe not... the isralis were just framed...",
				"added": 1630010834
			},
			{
				"comment_id": 153,
				"body": "again we know nothing, have only lies and deceits all around us...",
				"added": 1630010849
			},
			{
				"comment_id": 154,
				"body": "idiots she still has her apple watch... and now a way too \"bal look\"... ahh a husband... so why does the fuck she said she was single mom? lying?",
				"added": 1630010910
			},
			{
				"comment_id": 155,
				"body": "from all I know epstein could be the nice guy in this story... how do you want to trust anything when everything is only lies?",
				"added": 1630010956
			},
			{
				"comment_id": 156,
				"body": "personally never met epstein, don't know anyone who has... so... maybe he wanted to expose covid plan...",
				"added": 1630010977
			},
			{
				"comment_id": 157,
				"body": "but God knows !",
				"added": 1630010984
			},
			{
				"comment_id": 158,
				"body": "and so shroyer is a martyr?",
				"added": 1630011049
			},
			{
				"comment_id": 159,
				"body": "what a fucking idiot...",
				"added": 1630011056
			},
			{
				"comment_id": 164,
				"body": "but her interviews are great ! excellent ! so it was all planned in january 2016... covid... and no china isn't involved. why? ace2... learn about biology... worst idea in the world... CCP loves chineses... they are chinese... we the people 101... okay it's sometimes appears hard to the foreigners, stability has a price.",
				"added": 1630012660
			},
			{
				"comment_id": 165,
				"body": "then it's not your country, so as long as chinese people are happy with ccp, all is rulez...",
				"added": 1630012687
			},
			{
				"comment_id": 166,
				"body": "from counting grain rice, to now... how not to be happy ! from foreign invasion, to total sovereignty.",
				"added": 1630012718
			},
			{
				"comment_id": 167,
				"body": "judge the performance.",
				"added": 1630012739
			},
			{
				"comment_id": 168,
				"body": "appreciate...",
				"added": 1630012747
			},
			{
				"comment_id": 169,
				"body": "you are not eve nworthy to be called \"prey\".. as alex jones said : DODO birds...",
				"added": 1630015108
			},
			{
				"comment_id": 170,
				"body": "you will learn the hard way to the collapse of the narratives against the wall of war.\nhowever yes RIP ashley... \nbut who cares... kill alexander sorros... this kind of things only can eventually derail the collapse... it's already in motion anyway.\nthe problem is to use words : like the war room with owen shroyer... should be the gay room, or peace talks... or someting more realist, than another deceiving show... look at cctv7 or 13 when in PLA reports... you would understand what I am trying to say...",
				"added": 1630015652
			}
		],
		"1628848642_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg": [
			{
				"comment_id": 3,
				"body": "all p2p opensource are threaten by the silicon valley (monopoly preservation) and their cia ogranic droids, forstering the interests of their master of their own making... ironic isn't it? but american organic droids, cia or wh, once they see money, enter in a trance and start to whoreship them, even if they themselves created it... due one to compartimentalization 2 their organic droidic propgramming. fubar",
				"added": 1629992432
			}
		],
		"1629992646_1DHdyMN6LWgXtjYbLb9PB5dqq2b75jdVs6": [
			{
				"comment_id": 4,
				"body": "you know mr austin, you the \"black\" coercition on an experimental poisonous injection is against nuremberg rules... cool, I don't care too, about the international aspect of it. It's simpler : MY BODY MY CHOICE\n\nand I guess the american military corp is rotten because of men like you. incompetent, greedy, dishonest, unjust... what did the corp do against pedo epstein? nothing.\n\nyou are worthless. all of you.",
				"added": 1629992762
			},
			{
				"comment_id": 5,
				"body": "and stupid... to a point... but like most americans you play the act... appearance over matter... remember PLA isn't about appearance... or resaid it's part of the posture.\nyour grand children will understand what I mean.\nsoveignty of china is like my body my choice... get it?\nif you don't you will die and the world be free from your kind (organic droid comes in all skin colors).",
				"added": 1629992859
			},
			{
				"comment_id": 9,
				"body": "how do you cope with \"diversity hire\" in america? if your corp org did it , switch job, you know HR has already been taken over... a classical btw, of life under occupation.",
				"added": 1629993778
			}
		],
		"1629992488_1DHdyMN6LWgXtjYbLb9PB5dqq2b75jdVs6": [
			{
				"comment_id": 6,
				"body": "?",
				"added": 1629993357
			},
			{
				"comment_id": 7,
				"body": "tor v3",
				"added": 1629993553
			},
			{
				"comment_id": 8,
				"body": "network has splitted again...",
				"added": 1629993579
			},
			{
				"comment_id": 172,
				"body": "and it's back...",
				"added": 1630037067
			}
		],
		"1627703143_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj": [
			{
				"comment_id": 10,
				"body": "wouldn't it be time to fork the repo and start fresh on a p2p github like? end this msft centralized shit. code source on p2p network... so base... so arrogant, to want to have a little github account when bigger and better tech exists...",
				"added": 1629994051
			},
			{
				"comment_id": 38,
				"body": "> [macosquestions](#comment_1_18fkVYZKgknM2YED1Te7sW1U2PNyjeJTt1): Can you make a script for MacOS? Your script doesn't work on Mac for some reason.\n\ntotal crap this software... by the cia/nsa betrayal... according to fb, twitter and co will... we don't want the people to express opinions or pixels... ahh nooo only approved one... the organic bio droids must be totally controlled... serfs, and happy !",
				"added": 1629998446
			},
			{
				"comment_id": 39,
				"body": "and you know the guy who did is from hungary... look at the size evolution of the country... it's nice to make something awesome, but then to end as a sucker unable to plan contingency or legacy... shameful, so arrogant, so eastern europe... we know better, like the polnish generals in 1939 (or 8) when germans and soviets were massing on their borders, those morons where in vacations... true story... they are so fucking arrogant... they do something great once and then believe to be ROME.",
				"added": 1629998602
			},
			{
				"comment_id": 40,
				"body": "white people leaders are MONGOES... organic droids formated in \"university\" to ruin their own countries... sooo stupid... and my belief china will end up like this as soon as the real ones are dead, and only the little morons to whom you don't have a paper you are shit, unless PLA / MSS stay true to the core.",
				"added": 1629998669
			},
			{
				"comment_id": 41,
				"body": "you can't fake your kung fu with papers, and even more your lack of maturity or resaid, hamoniousness behavior and emotional control.. aka little western educated organic droid (or chinese in this case) goes facing PLA/MSS kung fu crew and can't answer a question, and gets angry to get away, it doesn't work, doesn't impress but rather ashamed for it... loser... simple question, unable to answer, try to hide anger, to impress... lol... no emotional mgmt, no answer... bad... next.",
				"added": 1629998768
			},
			{
				"comment_id": 42,
				"body": "and fear from little angry pricks who failed his learning? none... kung fu time x 20 years... not impressed by little anger... no positionning nothing... weakness... only.",
				"added": 1629998848
			},
			{
				"comment_id": 43,
				"body": "good joke, if they try to become physically violent if their emotional play is ignored... bad idea... bad idea... happilly it always end before anyone is injured... the art...",
				"added": 1629998899
			},
			{
				"comment_id": 44,
				"body": "the dumbness level if off the chart... mongoes... shocking.",
				"added": 1629998968
			},
			{
				"comment_id": 45,
				"body": "i guess it's often organic specialized droid, forget that they know nothing but their specialization, and even so, they hadn't the tools to question it...",
				"added": 1629999033
			},
			{
				"comment_id": 46,
				"body": "and they live in an illusion of knowledge...",
				"added": 1629999060
			},
			{
				"comment_id": 47,
				"body": "and worst , wiseness...",
				"added": 1629999073
			}
		],
		"1629863121_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 24,
				"body": "my bet\n1. biden did it, to have optics for failed evac.\n2. israel did it, to destroy the ummah (a classical)\n3. isis did it... why? who knows...\n4. the talibans, why?\nanyone else? yes of course the ones who did it... duh. but they are dead. maybe they organic droids from the cia? who knows...",
				"added": 1629994862
			},
			{
				"comment_id": 32,
				"body": "my advices for the CDM (chinese domestic market).\nex : goat droppings take off in CDM\n1 problem happen, contamination, plot by foreigners etc, natural event : inform immediatly, never lie, never hide, just tell it as soon as you know. the rest isn't your problem if it's already beyond your border.\n2. find what went wrong\n3. kill responsible if bad... (if it's too dry no worry) but if it was contaminated by a foreign tactical group (CIA etc), if found in afg kill, if not in afg again tell... hehehehe. and don't forget WENgeance is like bird nest or great teas... there are no time limits, but the will to maintain it... some call it strategic patience, other realism, other the queuing system...",
				"added": 1629995816
			},
			{
				"comment_id": 59,
				"body": "if I had my spacecraft, that I try to order from the aliens with no avails, right now america would be burning... everything... it could be a small ship... no worry as long as it can like in independnece day wipe from the earth those? I would be firing like mad, and straffing to next target at speed over the speed of light... from fort brags to alaska to saud i arabia... burning in hell...",
				"added": 1630003963
			},
			{
				"comment_id": 60,
				"body": "i wouldn't give a shit so much... depending on my map reading... 200m death in a few hours... I am not in geography.... everything.",
				"added": 1630004001
			},
			{
				"comment_id": 61,
				"body": "and from the place there was once washington d.c. there would lava flowing... lava... from the earth core.",
				"added": 1630004021
			},
			{
				"comment_id": 62,
				"body": "first D.C. like in independence day the movie with the aliens... beam, gone... 200 km.\nnext I do the whole east coast\nanything with a port with an american ship (easy to see from my spacecraft gone)\nthen texas to california, from san diego to alaksa EVERYTHITNG... wipe wipe wipe \nkill them all\n\nstraf to nevada... this area, or to free to terminate suffering... wiped\n\ntexaas, the axis... arkansas I think they have bombers\nthen the world\n\ngermany freed finally !\npoland, eastern europe clearerd\nnot hawaii... gone\nthen japan... I don't know... I don't want to distrub the zen...\n\nrotation to south korea\nevac by the SKers\n\ngone americans gonennnnne\n\ndead\n\n\npacific quickie... \n\nthen where? KSA:... gooooonnnne\n\nquatar... gonnnnneee\n\nwhere else to kill those organic droids? hmm...\n\nitalia.... GONE their bases\n\na swoop accross the seas... med\n\nengland...\n\nsee antennas? gonnnnneeee\n\nvictory is close...\n\nwhere else to kill them?",
				"added": 1630004227
			},
			{
				"comment_id": 63,
				"body": "as said the delivery can happen any time.",
				"added": 1630004242
			},
			{
				"comment_id": 64,
				"body": "technically I think the aliens call that a planetary bombers... there is the one shot mod, but I wish to be deactivated... it's to take out stars... so.... I need something moderate... or low power... we don't want an accident but max shield... no nego. absorb everything. no return fire... just asborbed... like a bullet train absorb flies...",
				"added": 1630004330
			},
			{
				"comment_id": 65,
				"body": "but no vision problem,\nan maybe a live map with in red the concentration of american organic droids, like cia, fbi, dod, irs, fda, epa, all those...\n\nso that I can clear the map as we say...",
				"added": 1630004370
			},
			{
				"comment_id": 66,
				"body": "would you start with the usa or end with it?\nI love the torture from killing them abroad first, before killing in their \"nest\".",
				"added": 1630004420
			},
			{
				"comment_id": 67,
				"body": "so new plan...",
				"added": 1630004428
			},
			{
				"comment_id": 68,
				"body": "would be so much cooler... but they escape...",
				"added": 1630004441
			},
			{
				"comment_id": 69,
				"body": "keep it stupidly simple... ahh yeah, as a final I would get their rovers on mars... for the lulz ;D",
				"added": 1630004465
			},
			{
				"comment_id": 70,
				"body": "remember american soldiers, you treated us like  shit... you allowed for american kids to be raped on pedo islands, you allowed for us to be censored, you allowed this release of the bioweapon vector, you allowed the steal, you allowed 911 and now you want mercy?\n\ndie\n\nthings\n\nthings...",
				"added": 1630004594
			},
			{
				"comment_id": 71,
				"body": "and your alex jones psywarfare, you mike adams health ranger, you little dwarf for veritas... we see through them\ntaiwan is chinese territory.",
				"added": 1630004633
			},
			{
				"comment_id": 72,
				"body": "calm and serenity. as always, according to the will of Allah...\n\nfurthermore, when the china flex will happen... it will be an event... to be remembered. \n\nenemy 1 of the 5 is gone. have the others surrendered and now seeking peace? not from an equal position, but for the assurance, that none will ever dare to pass this line, the border ofchina, ever again, un invited, or worst un authorised.",
				"added": 1630004770
			},
			{
				"comment_id": 73,
				"body": "you can be lead by a shahada flag, a five army flag, a uno flag, seem thing... I hope that the next time they try they will like russians did be hunted down to where they came from...\nbtw if they transit through afg, we will have to transit back to get them.\ndon't worry it's fast modern warfare... and no, it won't be magics or \"djinns\" or waht ever, just high tech large scale mass weapons... big lee..",
				"added": 1630004866
			},
			{
				"comment_id": 74,
				"body": "but I hope they won't be able to  transit from afghanistan to attack china... so it won't be necessary...\nwhite populations : captives brainwashed, western rulers \"demon possessed idiots\". or my theory before on specifialized but unwise. on knowning to do one thing , but nothing else... organic droids.",
				"added": 1630005016
			},
			{
				"comment_id": 75,
				"body": "and frankly if you are still in the usa army you deserve to die...",
				"added": 1630005057
			},
			{
				"comment_id": 76,
				"body": "but the lulz? nancy fort guards saved by nancy you are :) life...",
				"added": 1630005129
			},
			{
				"comment_id": 77,
				"body": "ironic isn't it?",
				"added": 1630005145
			},
			{
				"comment_id": 78,
				"body": "nancy prolonged the shell life of 30k organic droids... or made a nice target for if when I get this fucking planetary bombers from my alien command, which they delay for reasons that I am not aware of... aliens deliveries aren't whath they wree..",
				"added": 1630005246
			},
			{
				"comment_id": 79,
				"body": "and the monstreous joke, is that in a thousand yeas some will belive I was serious with aliens planetary bombers delivery, because mabefor them it will be normal... who knows what the future holds, but God !",
				"added": 1630005302
			},
			{
				"comment_id": 80,
				"body": "and the worst, is that the guy who reads in chronological order will deny... no no I knew it was a joke /serious",
				"added": 1630005349
			},
			{
				"comment_id": 81,
				"body": "so can we see the corpses and limbs of those organic droids ? that's cool, if someone could shit on them that would be even funnier...",
				"added": 1630005426
			},
			{
				"comment_id": 82,
				"body": "die americans die.",
				"added": 1630005450
			},
			{
				"comment_id": 83,
				"body": "I can't wait for the day People Liberation Armies of China will finish this shit.",
				"added": 1630005498
			},
			{
				"comment_id": 84,
				"body": "and chairman takes phone and ask england and france if they want to be nexted...\n\nfrance surrender... not interested... have fun with the brits\nbrits try to play some joke, smart remarks and back down\nusa is gone\nfinally the world is liberated from it's hegemon.\nfor this day of celebration...",
				"added": 1630005584
			},
			{
				"comment_id": 85,
				"body": "they raped their kids (on little st james with 2 arrests)\nthey let boat sinks (uss liberty)\nConsulate and embassador burn (bengazhi)\ngmo toxic food (corn etc)\ntoxic vaccines (before the rna covid)\nthey kill innocents worldwide\nthey seek to control population growth\nthey destroy people with fluoride, aspartame, etc.\nthey hate life.\nsimply.",
				"added": 1630005688
			},
			{
				"comment_id": 86,
				"body": "so they die.",
				"added": 1630005695
			},
			{
				"comment_id": 87,
				"body": "and to all the state servant out there, you wanted a world peaceful? maybe you should have worked on making it just first...",
				"added": 1630005776
			},
			{
				"comment_id": 88,
				"body": "like in justice.",
				"added": 1630005783
			},
			{
				"comment_id": 89,
				"body": "and not just us.",
				"added": 1630005789
			},
			{
				"comment_id": 90,
				"body": "in my opinion it's worst generation of white men ever to have lived... the boomer and their children.\nI am sure the crusaders, in \"acre\" where maybe uneducated in the quoran but not coward and weaklets... \nI am pretty sure, making salahdim victory even more impressive.\nhowever constantinopolis or istanbul today was maybe even worst than west today... gay, weak, lying, deceiving, unable to fight, only appearances... stupid, arrogant...",
				"added": 1630005941
			},
			{
				"comment_id": 91,
				"body": "why is erik prince always trying to make more money? he doesn't seem to want to be the 1st american emperor ushering the 2nd american republic by killing point blank gen mark milley and all the snakes of the pentagon active or retired... so why? more boats? bored?",
				"added": 1630006063
			},
			{
				"comment_id": 110,
				"body": "dear talibies, stay safe, god willing !",
				"added": 1630008103
			}
		],
		"1629992958_1DHdyMN6LWgXtjYbLb9PB5dqq2b75jdVs6": [
			{
				"comment_id": 35,
				"body": "I understand the debate, however in the us army the goal was gayism/feminism, not getting stuck in brushes... (which don't happen with the talibans traditionnal clothings, and if it does, insh'allah :D).",
				"added": 1629996859
			}
		],
		"1629999661_1DHdyMN6LWgXtjYbLb9PB5dqq2b75jdVs6": [
			{
				"comment_id": 48,
				"body": "and it's not personal, you are a threat to life. you are acceptable necessary captive collateral damages... and you wish to die for your story and bible and so on, okay. let's see if you are true believers so you will accept to become and embrass, to be collateral damamges...  so sorry, but we can't stand that \"america 1.0\" no more.",
				"added": 1629999737
			},
			{
				"comment_id": 49,
				"body": "and we is the people of the world. we can't stand you anymore, you the little people of america unable to remove this fucking tyrannie... we will remove it... you will be in the path so you fear a civil war, you will see a real war, on american soil, for the FIRST TIME EVER....",
				"added": 1629999799
			},
			{
				"comment_id": 50,
				"body": "the little fuckers who fled to the new world, have forgotten what is going on in the old world... arrogant as they were they believe it was their right to rule it too like they did to the indians (of america) :).",
				"added": 1629999842
			}
		],
		"1630000073_1DHdyMN6LWgXtjYbLb9PB5dqq2b75jdVs6": [
			{
				"comment_id": 51,
				"body": "nano bomb at cheryl sandberg place, grenade launcher, land, BOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOMMMMMMMMMM\n\nand the mansion is gone\n\nzuckerberg call\napolize\ngame over.\nit's only way\n\nyou are facing people who believe they are above death...\n\nremind them\n\nez...",
				"added": 1630000132
			},
			{
				"comment_id": 52,
				"body": "the bitch of youtube shit? show here what a manpad does when her jet take offf.. BOOOOOMMMM and crashing flame... GONE !",
				"added": 1630000163
			},
			{
				"comment_id": 53,
				"body": "they understand nothing else, they want us as their organic droids... vald action what is this gayism?",
				"added": 1630000185
			},
			{
				"comment_id": 54,
				"body": "gayism or senlity on set...\nwhat a shame.",
				"added": 1630000217
			},
			{
				"comment_id": 55,
				"body": "when xi says, you better do, it's PRC speaking...",
				"added": 1630000229
			}
		],
		"1630000350_1DHdyMN6LWgXtjYbLb9PB5dqq2b75jdVs6": [
			{
				"comment_id": 56,
				"body": "pussification leading to domestication leading to organic droidism... written... almost, so clear...",
				"added": 1630000384
			},
			{
				"comment_id": 57,
				"body": "control group, kim troops? gayize too?",
				"added": 1630000409
			},
			{
				"comment_id": 58,
				"body": "it's the \"happy\" part of the plan... at least it makes nk laugh... FOOOOOODDD",
				"added": 1630000473
			}
		],
		"1629867528_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 102,
				"body": "voila...",
				"added": 1630007840
			},
			{
				"comment_id": 103,
				"body": "will need max galaxy... then mcconnel family.. barret, all the scotus, most congress... fbi directors cia, etc... their children I mean...",
				"added": 1630007911
			},
			{
				"comment_id": 104,
				"body": "they want ours to be slave, non existent, droids, theirs must die.",
				"added": 1630007928
			},
			{
				"comment_id": 105,
				"body": "then those of silicon valley... elite cleansing.",
				"added": 1630007956
			},
			{
				"comment_id": 106,
				"body": "and alexander sorros... all the band with IVANKA:.. dieeeeeee",
				"added": 1630007982
			},
			{
				"comment_id": 107,
				"body": "they wanted their new world order, they will die in it.",
				"added": 1630008015
			},
			{
				"comment_id": 108,
				"body": "and the fucking indian bitch and the other white from the fbi, they will eat their kids... the 2 on cnn before? ahahah...",
				"added": 1630008054
			},
			{
				"comment_id": 109,
				"body": "WENGance !",
				"added": 1630008061
			}
		],
		"1630008208_1DHdyMN6LWgXtjYbLb9PB5dqq2b75jdVs6": [
			{
				"comment_id": 111,
				"body": "you know the hardship is to not want to rule after wards...\nso\n\nstep 1 frag all officer corp : cia, fbi, dod, irs, fda, atf, dea, fda.\nstep 2 kill all the corrupt civilians using corruptions data base from fbi cia doj\nstep 3 kill all msn \nstep 4 real election with free medias ! \nstep 5 you have saved the republic, created the second american republic and will be remembers as the patriots you are... \nor become organic droids...",
				"added": 1630008318
			},
			{
				"comment_id": 112,
				"body": "it's a choice...",
				"added": 1630008327
			}
		],
		"1630011135_1DHdyMN6LWgXtjYbLb9PB5dqq2b75jdVs6": [
			{
				"comment_id": 160,
				"body": "at least it was tried. confirmed it wasn't possible. splitting ways. excellent back to sanity !",
				"added": 1630011177
			},
			{
				"comment_id": 161,
				"body": "and if females want to be bankers they can create their own bank.",
				"added": 1630011846
			},
			{
				"comment_id": 162,
				"body": "rather than sabotage existing structure.",
				"added": 1630011868
			},
			{
				"comment_id": 163,
				"body": "that's insta HR notice in captured bank? isn't it? free yourself !!!",
				"added": 1630011910
			}
		],
		"1629402955_19BXHBD1GfYpSpvdHsuHJsJ97mYpxWjUE": [
			{
				"comment_id": 171,
				"body": "> [theborg](#comment_36_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK): You sir must be retarded or blind AF\n\nno it's a state agent, he works for jen paski. so first we mute him here, then one day when we can move the 2nd american republic, we find him, or his children or grand children and kill them, for all the pain he caused us.",
				"added": 1630036997
			}
		]
	},
	"comment_vote": {}
}