{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Не могу клонировать зайт (Windows)",
			"body": "Только начал знакомиться с зеронетом, и столкнулся с тем, что не могу клонировать зайт.\n\nВ ответ на попытки всплывает сообщение: \"This function is disabled on this proxy\".\n\nПочитал ЧАВО, какие то блоги, погуглил, и всё равно толком не понял, с чем связана проблема. Как будто бы пишут, что возможность клонировать зайт зависит от вида узла, прокси или клиент. А что за такие прокси и клиенты, где об этом прочитать, леший его знает...\n\nИли всё таки кто то знает???",
			"added": 1476183584
		},
		{
			"topic_id": 2,
			"title": "ZeroNet, DHT, можно ли проиндексировать все зайты?",
			"body": "Смысл вопроса вот в чём: можно ли в ZeroNet вести приватные заметки на собственном зайте (например, в ZeroBlog), имея в виду, что их не прочтёт никто, кроме тех, кто знает адрес (получил от меня ссылку или угадал; а угадать, конечно, малореально)?\n\nЕсли используется DHT или что-то подобное (или ожидается в перспективе), то, конечно, это провальная идея. Так как узел будет раздавать адреса имеющихся зайтов другим узлам. И адрес моего \"приватного\" зайта в этом случае не представляет секрета.\n\nИ ещё, этот вопрос касается архитектуры. Я не имею в виду варианты взлома узлов ZeroNet. Я понимаю, что софт сырой, и взлом возможен. Поэтому никакую важную информацию, которую нельзя было бы обнародовать, хранить в ZeroNet нельзя, это ясно. Приватные заметки, о которых я говорю, это, ну например, черновики статей, которые я всё равно собираюсь опубликовать. Но глупо будет, если мои черновики с обрывающимися предложениями будут проиндексированы поисковиком вместе со всеми зайтами.\n",
			"added": 1490308920
		}
	],
	"topic_vote": {
		"1_1Nyv5sTPtqCPQmK81bgx3iHWYDQDwLMNZX": 1
	},
	"next_comment_id": 16,
	"comment": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 1,
				"body": "Hello world!",
				"added": 1476179109
			},
			{
				"comment_id": 6,
				"body": "Что за приложение, где такое есть?",
				"added": 1490222593
			},
			{
				"comment_id": 7,
				"body": "В маркете не вижу. На официальном сайте не вижу.",
				"added": 1490222681
			},
			{
				"comment_id": 8,
				"body": "Ух ты, как запрятали! Спасибо!",
				"added": 1490281937
			},
			{
				"comment_id": 9,
				"body": "Решил оформить свои впечатления о ZeroNet в виде нескольких статей. Готова статья [Возможности ZeroNet, которых нет в Вебе](/1B6hCnxwZMfUqD2Kv2Xbdis3ZzXq67L8pY).",
				"added": 1490282587
			},
			{
				"comment_id": 10,
				"body": "> [iphizic](#comment_7_14HmFoEtmv6iw4TiaASeaFaDLwmquUtg6j): Это не их прихоть так запрятать а конкретное свойство ведра.\n\nЯ так понял, что оно запрятано, так как версия для андроида обозначена как \"experimental\"",
				"added": 1490293293
			},
			{
				"comment_id": 11,
				"body": "Выдаёт иногда какую то ошибку. И работает жутко медленно. Но работает!",
				"added": 1490293366
			},
			{
				"comment_id": 13,
				"body": "Подскажет кто, как такую ссылку оформить?\n\nhttps://ru.wikisource.org/wiki/%D0%9D%D0%B0%D1%80%D0%BE%D0%B4%D0%BD%D1%8B%D0%B5_%D1%80%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B5_%D1%81%D0%BA%D0%B0%D0%B7%D0%BA%D0%B8_(%D0%90%D1%84%D0%B0%D0%BD%D0%B0%D1%81%D1%8C%D0%B5%D0%B2)/%D0%9A%D0%BE%D0%BB%D0%BE%D0%B1%D0%BE%D0%BA\n\nПринятая конструкция ссылки не работает - закрывающая скобка, имеющаяся в ссылке, всё ломает.",
				"added": 1490738205
			},
			{
				"comment_id": 14,
				"body": "Нашёл вариант: нужно закрывающую скобку кодировать %29",
				"added": 1490739513
			},
			{
				"comment_id": 15,
				"body": "> [balancer73](#comment_91_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): urlencode. Например, так: Моя ссылка\n\nКруто, конечно, работает :-) но совсем не наглядно. Ведь не виден markdown-код, который был использован для создания ссылки. urlencode? Ну да, ссылка в urlencode...",
				"added": 1492709155
			}
		],
		"1_1Kgy2CdXdjNQSjK6pkLasWjmza9KQ1uZE4": [
			{
				"comment_id": 2,
				"body": "Конечно, поскольку установленный на компьютере ZeroNet предоставляет API, с которым работают зайты, то есть потенциальная возможность следующего сценария: зайт может осуществить такой вызов функций API, благодаря которому движок ZeroNet выполнит вредоносные действия (что то изменит, сотрёт или украдёт). Я не знаю, как это сделать, и возможно ли. Но пока обратное не доказано, такую вероятность нельзя отрицать.\n\nБраузеры уже хорошо обкатаны, как уже написал balancer73, но опасность всегда сохраняется. А сам движок ZeroNet вешь сырая и динамичная, поэтому потенциально более опасная.",
				"added": 1476185459
			}
		],
		"1_1266Hr6Kd2eoa89F6FeAeKu21FZSwYjpPw": [
			{
				"comment_id": 3,
				"body": "Спасибо за помощь!\nДействительно, удалось клонировать зайт после того, как отключил плагин Multiuser.\nЯ его включил потому, что прочитал, что благодаря этому плагину можно работать в ZeroNet под разными учётными записями.\nИ всё же остались вопросы. Как включение Multiuser связано со включением режима прокси? Это же не просто произвольный выбор такой функциональности, есть какое то объяснение? И почему на прокси все административные функции выключены? Подразумевается, что есть \"обычный\" режим и \"прокси\"? Каковы различия между ними?\nДумаю, люди привыкли к возможности на разных сайтах создавать разные учётные записи, и такие вещи стоит вынести в ЧАВО. А то люди будут включать Multiuser и недоумевать, как и я.",
				"added": 1476192407
			}
		],
		"1_1QCcM4agXg7FRWFzojQbbdLwvXBYzDk8P7": [
			{
				"comment_id": 4,
				"body": "> если автор удалит страницу (не сам пропадет, а именно удалит илт вытрет контент)  - она у меня тоже пропадет? можно ли как-то \"замораживать\" то, что мне нужно?\n\nВот этот момент так никто и не прокомментировал.\n\nЯ так понимаю, распространится подписанный \"вытертый\" контент.\n\nА это важный момент. С одной стороны, очевидный. С другой стороны \"обычный пользователь\" и не подумает про это. И ошибётся, если будет думать, что у него локально в сохранности есть копии сайтов.\n\nКроме регулярного коммита в Git ничего в голову не приходит. Хотя это не очень удобно.",
				"added": 1489961887
			}
		],
		"1_14HmFoEtmv6iw4TiaASeaFaDLwmquUtg6j": [
			{
				"comment_id": 5,
				"body": "Официальное приложение - на компе? А в андроиде работал через какой нибудь шлюз? Или как?",
				"added": 1490222217
			}
		]
	},
	"comment_vote": {
		"6_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1
	}
}