{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Descoberto fármaco capaz de prevenir propagação de vírus da gripe e VIH",
			"body": "#Descoberto fármaco capaz de prevenir propagação de vírus da gripe e VIH\n- http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1iUaT64b3wALv84KikRXn3yuvU262BUBG/Identification%20of%20influenza%20A%20nucleoprotein%20as%20an%20antiviral%20target.pdf",
			"added": 1538250487
		},
		{
			"topic_id": 2,
			"title": "Guerra de Canudos",
			"body": "#Guerra de Canudos, ou Campanha de Canudos, foi o confronto entre o Exército Brasileiro e os integrantes de um movimento popular de fundo sócio-religioso liderado por Antônio Conselheiro, que durou de 1896 a 1897, então na comunidade de Canudos, no interior do estado da Bahia, no nordeste do Brasil.\n- https://web.archive.org/web/20150707033508/http://www.goiania.ifg.edu.br/cienciashumanas/images/downloads/p1/canudos.pdf",
			"added": 1538283699
		}
	],
	"topic_vote": {
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"1_1iUaT64b3wALv84KikRXn3yuvU262BUBG": 1,
		"1_1xm3wUZda9fxCaKUSgkNCvHrwBPnLS6ni": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1,
		"2_1iUaT64b3wALv84KikRXn3yuvU262BUBG": 1
	},
	"next_comment_id": 17,
	"comment": {
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 1,
				"body": "“3.141592653589793238462643383279502884197169399375105820974944592307816406286208998628034825342117067982148086513282306647093844609550582231725359408128481117450284102701938521105559644622948954930381964428810975665933446128475648233786783165271201909145648566923460348610454326648213393607260249141273724587006606315588174881520920962829254091715364367892590360”",
				"added": 1538249610
			},
			{
				"comment_id": 2,
				"body": "#A matemática realmente existe ou é fruto do cérebro humano?\n- https://web.archive.org/web/20170621212432/https://hypescience.com/a-matematica-realmente-existe-ou-foi-criada-pelo-cerebro-humano/",
				"added": 1538249839
			},
			{
				"comment_id": 3,
				"body": "#Tudo o que existe é feito de números?\n- https://web.archive.org/web/20170201033510/http://hypescience.com:80/tudo-o-que-existe-e-feito-de-numeros/",
				"added": 1538249958
			},
			{
				"comment_id": 5,
				"body": "#Qual é o melhor jeito de dar aula de matemática\nUma pesquisa feita recentemente pela organização sem fins lucrativos The Conversation em níveis primário e secundário levantou qual é a melhor maneira de abordar a matemática no ensino básico. A resposta é mais legal do que você imagina. Os famosos “macetes” não são os queridinhos das crianças. Elas gostam mais do conteúdo quando os professores traçam um raciocínio e deixam que elas descubram as respostas sozinhas.\n\nIsso significa que os alunos aprendem matemática melhor quando os professores dão explicações claras de conceitos e eles recebem a oportunidade de praticar o que foi mostrado.",
				"added": 1538250550
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 4,
				"body": "#Pela primeira vez, pesquisadores demonstram que um problema fundamental da física é insolúvel\nExistem muitas perguntas sem resposta quando se trata de física de partículas e física quântica, mas uma das mais fundamentais vai continuar desse jeito, já que cientistas de uma equipe internacional acabaram de provar que o problema é matematicamente insolúvel.\n\nO problema diz respeito à diferença espectral, termo usado para descrever a energia necessária para um elétron fazer a transição de um estado de baixa energia para um estado animado.\n\nDe acordo com o novo estudo publicado na revista Nature, não importa o quão perfeitamente e completamente podemos descrever matematicamente um material no nível microscópico, nunca seremos capazes de prever seu comportamento macroscópico.\n- https://www.sciencealert.com/researchers-have-proved-that-a-fundamental-quantum-physics-problem-really-is-unsolvable",
				"added": 1538250250
			},
			{
				"comment_id": 11,
				"body": "#Formulação matemática da mecânica quântica\n- https://web.archive.org/web/20180929224357/http://www.science.unitn.it/~moretti/MFQM.pdf",
				"added": 1538262509
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 6,
				"body": "#Os 12 Macacos Dublado Online\nNo ano de 2035, James Cole (Bruce Willis) aceita a missão de voltar ao passado para tentar decifrar um mistério envolvendo um vírus mortal que atacou grande parte da população mundial. Tomado como louco, no passado, ele tenta provar a sua sanidade para a médica Kathryn Railly (Madeleine Stowe), sua única esperança de mudar o futuro.\n- http://thevid.net/v/c6pgaueuymzt1pthx6hcse2/",
				"added": 1538250725
			},
			{
				"comment_id": 7,
				"body": "#Fahrenheit 451 (2018) Legendado\nEm um futuro opressivo dominado pela tecnologia, a posse de livros e a literatura são proibidas. Guy Montag (Michael B. Jordan) é um bombeiro, sua principal missão é queimar todos os livros que existem até que não sobre mais nenhum deles. No entanto, ele conhece Clarisse McClellan (Sofia Boutella), uma jovem misteriosa que faz com que ele comece a questionar suas atitudes e todo o sistema vigente.\n- http://thevid.net/v/z1mzmk3oxdvfxsrooyq/",
				"added": 1538251121
			},
			{
				"comment_id": 8,
				"body": "#Astro Boy Dublado\nMetro City é uma metrópole reluzente, cuja localização fica no céu. É lá que o Dr. Tenma (Nicolas Cage) cria Astro Boy (Freddie Highmore), na intenção de substituir o filho que perdeu. Astro Boy possui poderes extraordinários, sendo dotado com o que há de melhor nas características humanas. Após ser expulso, por não conseguir cumprir as expectativas geradas por Tenma, Astro Boy precisa aprender a conviver como um robô e aceitar o fato de não ser humano. Ele passa a ser perseguido pelas tropas do presidente Stone (Donald Sutherland), que deseja tomar a fonte de energia que Astro Boy carrega dentro de si. Para escapar, ele cai na terra. Confuso e sem entender a nova realidade, ele resolve se passar por humano junto com um grupo de crianças de rua.\n\n- http://thevid.net/v/c0gzte5tzzgs6kx/",
				"added": 1538257958
			},
			{
				"comment_id": 9,
				"body": "#MAX - FIDELIDADE ASSASSINA\nA ativista dos direitos dos animais e jornalista Lori Tanner (Ally Sheedy) usa todos os seus esforços para livrar um cão do laboratório do Dr. Jarret (Lance Henriksen), onde ele era submetido à maus tratos. O grande problema é que o cachorro se transformou num monstro assassino, pois foi modificado genéticamente pelo cientista. \n\n- https://youtu.be/_LG54-BkPFo",
				"added": 1538258002
			},
			{
				"comment_id": 10,
				"body": "#Bleach 2018 Dublado\nSinopse: Kurosaki Ichigo é um garoto de 15 anos que pode ver, tocar e falar com espíritos de pessoas mortas. Até que um dia ele encontra Kuchiki Rukia, uma Shinigami (deus da morte), e descobre posteriormente que também é um Shinigami. Agora, com seus poderes, ele terá que proteger sua cidade de forças do mal.\n\n- http://thevid.net/v/k113yvrrbd/",
				"added": 1538262460
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 12,
				"body": "#‘O amor é paciente e bondoso. Suporta todas as coisas, espera todas as coisas, persevera em todas as coisas. O amor nunca acaba.’ — 1 Coríntios 13:4-8.",
				"added": 1538269814
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 13,
				"body": "#Epopeia de Gilgamesh\nA Epopeia de Gilgamesh ou Épico de Gilgamesh é um antigo poema épico da Mesopotâmia, uma das primeiras obras conhecidas da literatura mundial. Acredita-se que sua origem sejam diversas lendas e poemas sumérios sobre o mitológico deus-herói Gilgamesh, que foram reunidos e compilados no século VII a.C.\n- https://web.archive.org/web/20180930022651/http://www.mkmouse.com.br/livros/AEpopeiadeGilgamesh-Anonimo-MartinsFontes.pdf",
				"added": 1538277851
			},
			{
				"comment_id": 16,
				"body": "#Manuscrito Voynich\nManuscrito Voynich é um misterioso livro ilustrado com um conteúdo incompreensível. Imagina-se que tenha sido escrito há aproximadamente 600 anos por um autor desconhecido que se utilizou de um sistema de escrita não-identificado e uma linguagem ininteligível. É conhecido como \"o livro que ninguém consegue ler\".\n\n- https://brbl-dl.library.yale.edu/vufind/Record/3519597",
				"added": 1538284832
			}
		],
		"2_1iUaT64b3wALv84KikRXn3yuvU262BUBG": [
			{
				"comment_id": 14,
				"body": "#Guerra de Canudos | Nerdologia\n- https://youtu.be/69MTadaKjWk",
				"added": 1538283811
			},
			{
				"comment_id": 15,
				"body": "#A Guerra de Canudos - Resumo\n\n#Situação do Nordeste no final do século XIX (contexto histórico)\n\n \n\n- Fome – desemprego e baixíssimo rendimento das famílias deixavam muitos sem ter o que comer;\n\n \n\n- Seca – a região do agreste ficava muitos meses e até anos sem receber chuvas. Este fator dificultava a agricultura e matava o gado;\n\n \n\n- Falta de apoio político – os governantes e políticos da região não davam a mínima atenção para as populações carentes;\n\n \n\n- Violência – era comum a existência de grupos armados que trabalhavam para latifundiários. Estes espalhavam a violência pela região;\n\n \n\n- Desemprego – grande parte da população pobre estava sem emprego em função da seca e da falta de oportunidades em outras áreas da economia;\n\n \n\n- Fanatismo religioso: era comum a existência de beatos que arrebanhavam seguidores prometendo uma vida melhor.\n\n \n\n#Principais dados da Guerra de Canudos:\n\n \n\n- Período: de novembro de 1896 a outubro de 1897.\n\n \n\n- Local: interior do sertão da Bahia.\n\n \n\n- Envolvidos: de um lado os habitantes do Arraial de Canudos (jagunços, sertanejos pobres e miseráveis, fanáticos religiosos) liderados pelo beato Antônio Conselheiro. Do outro lado, as tropas do governo da Bahia com apoio de militares enviados pelo governo federal.\n\n \n\n#Causas da Guerra:\n\n \n\nO governo da Bahia, com apoio dos latifundiários, não concordava com o fato dos habitantes de Canudos não pagarem impostos e viverem sem seguir as leis estabelecidas. Afirmavam também que Antônio Conselheiro defendia a volta da Monarquia.\n\n \n\nPor outro lado, Antônio Conselheiro defendia o fim da cobrança dos impostos e era contrário ao casamento civil. Ele afirma ser um enviado de Deus que deveria liderar o movimento contra as diferenças e injustiças sociais. Era também um crítico do sistema republicano, como ele funcionava no período.\n\n \n\n#Os conflitos militares\n\n \n\nNas três primeiras tentativas das tropas governistas em combater o arraial de Canudos nenhuma foi bem-sucedida. Os sertanejos e jagunços se armaram e resistiram com força contra os militares. Na quarta tentativa, o governo da Bahia solicitou apoio das tropas federais. Militares de várias regiões do Brasil, usando armas pesadas, foram enviados para o sertão baiano. Massacraram os habitantes do arraial de Canudos de forma brutal e até injusta. Crianças, mulheres e idosos foram mortos sem piedade. Antônio Conselheiro foi assassinado em 22 de setembro de 1897.\n\n \n\n#Significado do conflito\n\n \n\nA Guerra de canudos significou a luta e resistência das populações marginalizadas do sertão nordestino no final do século XIX. Embora derrotados, mostraram que não aceitavam a situação de injustiça social que reinava na região.\n\n \n\n#Indicação de filme sobre o tema:\n\n \n\n-  Guerra de Canudos\n\n   Ano: 1997\n\n   Direção: Sérgio Rezende\n\n   Gênero: Guerra, Drama, Histórico\n\n   Temas: conflitos sociais no início da República, Guerra de Canudos",
				"added": 1538284047
			}
		]
	},
	"comment_vote": {
		"1_1iUaT64b3wALv84KikRXn3yuvU262BUBG": 1,
		"2_1iUaT64b3wALv84KikRXn3yuvU262BUBG": 1,
		"5_1iUaT64b3wALv84KikRXn3yuvU262BUBG": 1,
		"3_1iUaT64b3wALv84KikRXn3yuvU262BUBG": 1,
		"6_1iUaT64b3wALv84KikRXn3yuvU262BUBG": 1,
		"7_1iUaT64b3wALv84KikRXn3yuvU262BUBG": 1,
		"8_1iUaT64b3wALv84KikRXn3yuvU262BUBG": 1,
		"9_1iUaT64b3wALv84KikRXn3yuvU262BUBG": 1,
		"11_1iUaT64b3wALv84KikRXn3yuvU262BUBG": 1,
		"15_1iUaT64b3wALv84KikRXn3yuvU262BUBG": 1,
		"16_1iUaT64b3wALv84KikRXn3yuvU262BUBG": 1
	}
}