{
	"pages": [
		{
			"id": "e63e5b50-0b10-11ea-ab7d-0b122d1963d2",
			"body": "VAWT - Vertical Access Wind Turbine History.\n\nAncient VAWTs - Persia 500 AD  and likely older..\n\nFirst Used in Persia, around 500 AD, VAWTs were used and still are used to grind grain via mill stones, These early VAWT designs rely on seasonal onshore wind and were equipped with wind funnel walls. Amazingly, similarly VAWT systems are still in operation today in modern day IRAN.  iranianpedia.com/travel-tips-to-iran/wonders-of-nashtifan-windmills/. The rotors of these VAWTs use resistance or positive \"drag\" blades, often referred to as \"Savonius\" style VAWTs as first 'patented' by J.J Savonius of Finland in 1925.\n\nIn the Roaring 20s VAWTs re-surface\n\nAround that same time in France, George Marie Darrieus filed his first patent for  multiple \"lift\" style VAWTs in 1925, later filing the same patent in the USA in 1929. Darrieus used aeronautical principles of lift and drag, equipping two blade symmetrical rotors with airfoils to create positive rotation, focusing on electrical generation. Darrieus and Savonius both were reacting to energy shortages at the time and sought funding in various countries to create scale versions of their patents. Unfortunately both failed to raise the capital they desired,  largely  because new oil discoveries made in the late 1920s and early 30s . As a result their patents were largely ignored for decades.\n\nEarly Denmark \"Three Blade\"  HAWTs circa 1880s become the mainstream design...\n\nAny real wind development from the late 1800s focused on electricity generation at any scale were implemented in the HAWT Horizontal Axis Wind Turbine style in the more \"Danish\" three  blade propeller form, which proved to work well first in Denmark, and later improved  significantly in the 1930s and 1940s in Germany. \n\nVAWT Re-birth in Canada: Hybrid VAWT , Battery and Diesel Powered Electricity Generation -Off Grid\n\nThe Darrieus \"EggBeater\"  hoop form of symmetrical rotor with two blades resurfaced in 1966 in Canada  (Raj Rangi & Peter South - Ministry of Natural Resources \"MNR\", working with the Canadian National Research Council \"NRC\") as part of a Federal Canadian government sponsored  research & commercialization development effort looking to combine  VAWT wind power and off-grid batteries couple  with backup diesel generation, as a way to reduce fuel costs in remote locations in the Canadian Arctic. It was later discovered by the inventors in the patent office the design already existed. which led to further development of the design to add vertical furling  braking attachments to prevent VAWT Eggbeater overspeed conditions, so as to reduce the cost of braking components used in early design to prevent damage to the electrical and mechanical components of the system and improve reliability.\n\n70s Oil Crisis Driven Big Wind R&D Starts: VAWTs show early promise..\n\nAs the world entered an OPEC led oil crisis in 1970, researchers and some investors in Canada, Europe (Denmark and Germany largely) and the USA again turned to funding wind power research and development in both  HAWT and VAWT forms looking to build a cost effective way to generate electricity without the use of non-renewable fossil fuels and the prices being dictated by OPEC. \n\nAt this time, around 1974, Sandia Labs in the USA started to co-operate and share information with the Canada MNR/ NRC project as it applied to VAWT, and worked directly with  Flowind of Washington (and later California) to adapt early water jet  driven metal (Steel and Aluminum) cutting technology  and  later, straight fiberglass pultrusion to create a Modern large-scale VAWT in parallel to efforts underway in Canada to build same. In Canada and the USA, initial rotor blade designs were extruded as Aluminum blades  and  arc welded to the drive shafts via large Aluminum companies operating in Canada and USA.  In Denmark the company Vestas experimented with multiple small VAWT designs and even a 'Bi-plane like \"  dual airfoil  blade ,  dual blade design. \n\nIn 1979, two early large  VAWT (250kW nameplate) deployments in Canada on the Magdalene Islands (Quebec) using belt drive systems to drive te generation which did work for awhile, until the braking systems failed allowing both installations to \"Self start\" (a condition that was thought not possible  at the time by the designers) to over-speed and destroy themselves. \n\n4.2M VAWT - Quebec (Canada) Style: the Hydro Quebec Grand \"Eole\"  1986-91\n\nThe Canadian effort to improve on these early designs was then led by  the Federal Government (Canadian Taxpayer)   financing  Hydro Quebec to create the enormous 4.2MW Cape Chat, Quebec \"Eole\" dual blade Darrieus EggBeater , fully activated by 1986, created by Shawinigan Engineering Quebec (alter absorbed partly by today's SNC Lavalin). The Eole operated initially just below the nameplate capacity at 3.5MW and immediately ran into braking problems, where brake material made of Asbestos was released into the generator set  stator and magnet  components, creating the chance of a fire. Repairs were made, and the output tuned down to 2.5MW, where the Eole ran successfully for 5 years before being decommissioned after the contract, as the Eole as never a cost effective project. \n\nCommercial VAWTS arrive in the 1980s- Sort of... Flowind Style\n\nIn parallel, Flowind focused on a 1984 deployment to two locations in CA, Altamont and Tehachapi Passes in South and North California for Southern CA Edison and PG&E respectively. Each had a deployment of 400+ smaller dual rotor Eggbeaters of 110 to 160kW NP. These two \"wind farms\" worked well for a time, however by year six, hairline cracks appeared in the welded joints of the connectors joining the aluminum (bent and loaded under torque) to the driveshaft. For safety reasons, the entire VAWT fleets of Flowind were eventually taken down, bankrupting the company. during this period Flowind evolved the second generation two blade design to three blades using the same platforms with genset upgrades to 440kW NP incorporating and extended height vs. diameter \"EHD\" ratio of the 3:1. For the first time pultruded blades of fibreglass composite were used. Flowind was able with the help of Sandia, airfoils.com and the NREL , US National Renewable Energy Labs and computational fluid dynamic modelling  software created by Ion Paraschiviou at the Polytechnical Unicersity of Montreal ( the same data used to create the Eole in Cape Chat) to help optimize the airfoil and rotor blade shape in \"Tropeskein\" \"skipping rope\" form, thought to be the optimal shape at the time by engineering experts.\n\nGolden Era of Big Wind Research- flattened by lower OPEC Oil Prices 1983\n\nDuring this \"golden\" period of r&d in Canada, USA and Europe for \"Wind Power\", OPEC had set prices at around US $18.00/barrel  which persisted until 1983, at which time prices were dropped to US $ 8.00/barrel to stimulate demand and lurch the world economy out a prolonged recession which has lasted 12+ years. This price drop in oil,  saw the  funding \"dry up\" for wind power  research and development in the USA almost immediately, and later in Canada. Europe continued on with HAWT \"r & d\" only. \n\nFlowind Stumbles and Dies- RIP 1982-1997- The end of  Commercial VAWT Viability\n\nFlowind in the USA , along with Indal and Addecon (Peter South) in Canada all  VAWT vendors,  went out of business by 1997,  prompted at the time, by the US Federal Subsidy for Wind power being dropped by the USA government of the day (B. Clinton 1993-2001). Additionally, in the HAWT segment Carter and AWI went out of business. Enercon, Bonus and Vestas retreated back the European markets and Clipper went into receivership (later acquired by GE).  With decimation of the US and Canada Wind industry complete, a state of affairs that persisted until the early 2000s, the general rumour spread about VAWTs throughout and by \"Big Wind\" experts was VAWTs did not work and only HAWTs could scale and come close to thermal efficiencies.\n\nSmall VAWT Vendors Pop up- Everywhere- the New Millenia of VAWTs- China Leads the way\n\nSmall VAWT interest was reborn in the mid 2000s, with SAWT(2008) of China and Hi-VAWT(2007) of Taiwan deploying in large numbers,  straight blade and Eggbeater VAWTs based on old three blade designs created in the 1960s(Gyromill)  and 70s (NASA/NREL) respectively.  Both of these  small early re-births, like all wind HAWT and VAWT were heavily subsidized by the tax payer in order to compete with equally heavily subsidized thermal generation of electricity. \n\nAt this time the HAWT market was reviving itself with massive deployments led by Europe and followed in US, canada, China and Asia in general.\n\nRopatec Does the Rope-a-dope and Survives - Five Blade Vawts + Upside Down Airfoils  show up in 2008 \n\nOnly Ropatec of Italy/Germany/UK, despite going into receivership three times, managed to emerge in the late 2000s with a credible small NP capacity (30/40kW) design.  Ropatec successfully deployed a farm of  five blade systems integrated with existing MW class III HAWT systems using vortex spoiling tips . SAWT quickly followed suit with their own active air braking five blade designs. Interestingly, both fly their airfoils upside down and perform better than previous models they had created.\n\nOffshore Wind  is calling for? VAWTS really big VAWTS: The Sandia Labs  Solution\n\nIn 2011, interest in offshore big wind was rising on the backs of early deployments fraught with cost over-runs, which saw the cost per MW installed rise to US $4,500/kw in comparison with land based deployments routinely installed for under US $2,000.  As a result Sandia National Labs, the early r&d home for VAWTs \"dusted off\" the old research and began looking at how to supersize VAWTs, which had lower mount heights and were easier to service at ground level, making them more attractive for offshore deployments. By 2012 Sandia research had confirmed the \"LCOE\" Levelized cost of energy for VAWTS 4MWs or larger were up to 35% cheaper to deploy with much better ROI than current VAWT designs scaled to produce the same AEP \"Annual energy Production\" due  in large to lower OPEX 'operating expense\", and partly due to lower cost foundation  and mooring systems. \n\nSmall Gorlov Water Turbines morph into Wind Turbines, For awhile: 2007 to 2012  RIP\n\nDuring this time , the Gorlov invented helical twist VAWT designs were re-purposed at Quiet Revolution and UGE,  where both proved in the field to suffer from poor startup and low wind performance problems leading to poor AEP Annual Energy Production, thus both companies exited the small wind  VAWT market, where the former went bankrupt despite heavy subsidies received by the company and their customers in the UK market and,  the latter shifted focus into solar energy.\n\n2015 - The Return to Wind Acceleration Augmented VAWTs- 1600 Years later...\n\nRecently patents have been filed (2010, 2012) and approved (2015) at the USPTO office by Dr. K.Cory (A senior VP who previously worked as the New Technologies evaluator at Calpine, CA one of the largest developers of wind farms and gas powered generation). The Cory patents are supporting the mount of a carousel of VAWTS on an a wind acceleration tower , where the VAWTs  make use of CVTs (continuously variable transmissions) to create a smart wind farm tower capable of competing with thermal powered electrical generation systems without a subsidy. V3wind.com a stealth company in Dallas, Texas is leading the commercialization, underway since 2018.\n\nCurrent VAWT offerings from SAWT and Hi-VAWT  from 1.5kW to 20kW NP in five and three blade forms, using improved designs having  low cost air-braking in different manners continue to be supplied into Asian and North American markets,  all  subsidized by the tax payer in various ways. \n\nBetz does not apply- VAWTs 3-6% more efficient- Thoenissen - Journal of Physics\n\nIn 2016 Thoenissen (Germany) published a new \"peer reviewed\"  paper in the Journal of Physics  proving the theoretical efficiency of VAWTs to be higher than those of HAWTS by about 3%-6% where the minimum  Cp (Coefficient of power)   is 0.626 versus HAWTs designed to the known Betz Cp limit of 0.59 based on 2D disk calculations. Local angle of Attack \"LAoA\" of the airfoil and  turbine \"solidity\" as well as blade shape are key co-dependent elements of optimal VAWT design described by Thoenissen \n\nSmall VAWTs find a market- Offgrid, Low Mount, Hybrid Clean Power Trailers\n\nIn 2017 a new H- Frame Darrieus design prototype, based on Thoenissen's new discovery, implementing the new Qblade tool from Technical University of Berlin Computational fluid Dynamics Center,  was delivered to Mobismart.ca of Canada for use with their clean power trailer for site testing. This \"Starwind5\" design created by Harvistor llc (USA) and built by staff  of the Centre for Innovation, Red Deer College Alberta Canada, together with the inventor, R. Reive,  utilizes a patented pending, five blade hi-solidity design for low mount locations configurable to support different wind site conditions with 1.5kW to 3kW NP, and is an auxiliary power generation element compliment solar and thermal charging of batteries delivering the prime power output.\n\nSmall VAWT market is alive, growing slowly, BIG MW VAWTS in the works\n\nBy 2019, the market for small VAWTs led by SAWT continues to grow slowly and sporadically driven by tax payer subsidies of various forms, while work on larger offshore MW VAWT systems progress at an even slower rate.\n \n\n\n\n\n",
			"date_added": 1574197779845,
			"slug": "home"
		},
		{
			"id": "be4a15d0-0b10-11ea-ab7d-0b122d1963d2",
			"body": "VAWT - Vertical Access Wind Turbine History.\n\nAncient VAWTs - Persia 500 AD  and likely older..\n\nFirst Used in Persia, around 500 AD, VAWTs were used and still are used to grind grain via mill stones, These early VAWT designs rely on seasonal onshore wind and were equipped with wind funnel walls. Amazingly, similarly VAWT systems are still in operation today in modern day IRAN.  iranianpedia.com/travel-tips-to-iran/wonders-of-nashtifan-windmills/. The rotors of these VAWTs use resistance or positive \"drag\" blades, often referred to as \"Savonius\" style VAWTs as first 'patented' by J.J Savonius of Finland in 1925.\n\nIn the Roaring 20s VAWTs re-surface\n\nAround that same time in France, George Marie Darrieus filed his first patent for  multiple \"lift\" style VAWTs in 1925, later filing the same patent in the USA in 1929. Darrieus used aeronautical principles of lift and drag, equipping two blade symmetrical rotors with airfoils to create positive rotation, focusing on electrical generation. Darrieus and Savonius both were reacting to energy shortages at the time and sought funding in various countries to create scale versions of their patents. Unfortunately both failed to raise the capital they desired,  largely  because new oil discoveries made in the late 1920s and early 30s . As a result their patents were largely ignored for decades.\n\nEarly Denmark \"Three Blade\"  HAWTs circa 1880s become the mainstream design...\n\nAny real wind development from the late 1800s focused on electricity generation at any scale were implemented in the HAWT Horizontal Axis Wind Turbine style in the more \"Danish\" three  blade propeller form, which proved to work well first in Denmark, and later improved  significantly in the 1930s and 1940s in Germany. \n\nVAWT Re-birth in Canada: Hybrid VAWT , Battery and Diesel Powered Electricity Generation -Off Grid\n\nThe Darrieus \"EggBeater\"  hoop form of symmetrical rotor with two blades resurfaced in 1966 in Canada  (Raj Rangi & Peter South - Ministry of Natural Resources \"MNR\", working with the Canadian National Research Council \"NRC\") as part of a Federal Canadian government sponsored  research & commercialization development effort looking to combine  VAWT wind power and off-grid batteries couple  with backup diesel generation, as a way to reduce fuel costs in remote locations in the Canadian Arctic. It was later discovered by the inventors in the patent office the design already existed. which led to further development of the design to add vertical furling  braking attachments to prevent VAWT Eggbeater overspeed conditions, so as to reduce the cost of braking components used in early design to prevent damage to the electrical and mechanical components of the system and improve reliability.\n\n70s Oil Crisis Driven Big Wind R&D Starts: VAWTs show early promise..\n\nAs the world entered an OPEC led oil crisis in 1970, researchers and some investors in Canada, Europe (Denmark and Germany largely) and the USA again turned to funding wind power research and development in both  HAWT and VAWT forms looking to build a cost effective way to generate electricity without the use of non-renewable fossil fuels and the prices being dictated by OPEC. \n\nAt this time, around 1974, Sandia Labs in the USA started to co-operate and share information with the Canada MNR/ NRC project as it applied to VAWT, and worked directly with  Flowind of Washington (and later California) to adapt early water jet  driven metal (Steel and Aluminum) cutting technology  and  later, straight fiberglass pultrusion to create a Modern large-scale VAWT in parallel to efforts underway in Canada to build same. In Canada and the USA, initial rotor blade designs were extruded as Aluminum blades  and  arc welded to the drive shafts via large Aluminum companies operating in Canada and USA.  In Denmark the company Vestas experimented with multiple small VAWT designs and even a 'Bi-plane like \"  dual airfoil  blade ,  dual blade design. \n\nIn 1979, two early large  VAWT (250kW nameplate) deployments in Canada on the Magdalene Islands (Quebec) using belt drive systems to drive te generation which did work for awhile, until the braking systems failed allowing both installations to \"Self start\" (a condition that was thought not possible  at the time by the designers) to over-speed and destroy themselves. \n\n4.2M VAWT - Quebec (Canada) Style: the Hydro Quebec Grand \"Eole\"  1986-91\n\nThe Canadian effort to improve on these early designs was then led by  the Federal Government (Canadian Taxpayer)   financing  Hydro Quebec to create the enormous 4.2MW Cape Chat, Quebec \"Eole\" dual blade Darrieus EggBeater , fully activated by 1986, created by Shawinigan Engineering Quebec (alter absorbed partly by today's SNC Lavalin). The Eole operated initially just below the nameplate capacity at 3.5MW and immediately ran into braking problems, where brake material made of Asbestos was released into the generator set  stator and magnet  components, creating the chance of a fire. Repairs were made, and the output tuned down to 2.5MW, where the Eole ran successfully for 5 years before being decommissioned after the contract, as the Eole as never a cost effective project. \n\nCommercial VAWTS arrive in the 1980s- Sort of... Flowind Style\n\nIn parallel, Flowind focused on a 1984 deployment to two locations in CA, Altamont and Tehachapi Passes in South and North California for Southern CA Edison and PG&E respectively. Each had a deployment of 400+ smaller dual rotor Eggbeaters of 110 to 160kW NP. These two \"wind farms\" worked well for a time, however by year six, hairline cracks appeared in the welded joints of the connectors joining the aluminum (bent and loaded under torque) to the driveshaft. For safety reasons, the entire VAWT fleets of Flowind were eventually taken down, bankrupting the company. during this period Flowind evolved the second generation two blade design to three blades using the same platforms with genset upgrades to 440kW NP incorporating and extended height vs. diameter \"EHD\" ratio of the 3:1. For the first time pultruded blades of fibreglass composite were used. Flowind was able with the help of Sandia, airfoils.com and the NREL , US National Renewable Energy Labs and computational fluid dynamic modelling  software created by Ion Paraschiviou at the Polytechnical Unicersity of Montreal ( the same data used to create the Eole in Cape Chat) to help optimize the airfoil and rotor blade shape in \"Tropeskein\" \"skipping rope\" form, thought to be the optimal shape at the time by engineering experts.\n\nGolden Era of Big Wind Research- flattened by lower OPEC Oil Prices 1983\n\nDuring this \"golden\" period of r&d in Canada, USA and Europe for \"Wind Power\", OPEC had set prices at around US $18.00/barrel  which persisted until 1983, at which time prices were dropped to US $ 8.00/barrel to stimulate demand and lurch the world economy out a prolonged recession which has lasted 12+ years. This price drop in oil,  saw the  funding \"dry up\" for wind power  research and development in the USA almost immediately, and later in Canada. Europe continued on with HAWT \"r & d\" only. \n\nFlowind Stumbles and Dies- RIP 1982-1997- The end of  Commercial VAWT Viability\n\nFlowind in the USA , along with Indal and Addecon (Peter South) in Canada all  VAWT vendors,  went out of business by 1997,  prompted at the time, by the US Federal Subsidy for Wind power being dropped by the USA government of the day (B. Clinton 1993-2001). Additionally, in the HAWT segment Carter and AWI went out of business. Enercon, Bonus and Vestas retreated back the European markets and Clipper went into receivership (later acquired by GE).  With decimation of the US and Canada Wind industry complete, a state of affairs that persisted until the early 2000s, the general rumour spread about VAWTs throughout and by \"Big Wind\" experts was VAWTs did not work and only HAWTs could scale and come close to thermal efficiencies.\n\nSmall VAWT Vendors Pop up- Everywhere- the New Millenia of VAWTs- China Leads the way\n\nSmall VAWT interest was reborn in the mid 2000s, with SAWT(2008) of China and Hi-VAWT(2007) of Taiwan deploying in large numbers,  straight blade and Eggbeater VAWTs based on old three blade designs created in the 1960s(Gyromill)  and 70s (NASA/NREL) respectively.  Both of these  small early re-births, like all wind HAWT and VAWT were heavily subsidized by the tax payer in order to compete with equally heavily subsidized thermal generation of electricity. \n\nAt this time the HAWT market was reviving itself with massive deployments led by Europe and followed in US, canada, China and Asia in general.\n\nRopatec Does the Rope-a-dope and Survives - Five Blade Vawts + Upside Down Airfoils  show up in 2008 \n\nOnly Ropatec of Italy/Germany/UK, despite going into receivership three times, managed to emerge in the late 2000s with a credible small NP capacity (30/40kW) design.  Ropatec successfully deployed a farm of  five blade systems integrated with existing MW class III HAWT systems using vortex spoiling tips . SAWT quickly followed suit with their own active air braking five blade designs. Interestingly, both fly their airfoils upside down and perform better than previous models they had created.\n\nOffshore Wind  is calling for? VAWTS really big VAWTS: The Sandia Labs  Solution\n\nIn 2011, interest in offshore big wind was rising on the backs of early deployments fraught with cost over-runs, which saw the cost per MW installed rise to US $4,500/kw in comparison with land based deployments routinely installed for under US $2,000.  As a result Sandia National Labs, the early r&d home for VAWTs \"dusted off\" the old research and began looking at how to supersize VAWTs, which had lower mount heights and were easier to service at ground level, making them more attractive for offshore deployments. By 2012 Sandia research had confirmed the \"LCOE\" Levelized cost of energy for VAWTS 4MWs or larger were up to 35% cheaper to deploy with much better ROI than current VAWT designs scaled to produce the same AEP \"Annual energy Production\" due  in large to lower OPEX 'operating expense\", and partly due to lower cost foundation  and mooring systems. \n\nSmall Gorlov Water Turbines morph into Wind Turbines, For awhile: 2007 to 2012  RIP\n\nDuring this time , the Gorlov invented helical twist VAWT designs were re-purposed at Quiet Revolution and UGE,  where both proved in the field to suffer from poor startup and low wind performance problems leading to poor AEP Annual Energy Production, thus both companies exited the small wind  VAWT market, where the former went bankrupt despite heavy subsidies received by the company and their customers in the UK market and,  the latter shifted focus into solar energy.\n\n2015 - The Return to Wind Acceleration Augmented VAWTs- 1600 Years later...\n\nRecently patents have been filed (2010, 2012) and approved (2015) at the USPTO office by Dr. K.Cory (A senior VP who previously worked as the New Technologies evaluator at Calpine, CA one of the largest developers of wind farms and gas powered generation). The Cory patents are supporting the mount of a carousel of VAWTS on an a wind acceleration tower , where the VAWTs  make use of CVTs (continuously variable transmissions) to create a smart wind farm tower capable of competing with thermal powered electrical generation systems without a subsidy. V3wind.com a stealth company in Dallas, Texas is leading the commercialization, underway since 2018.\n\nCurrent VAWT offerings from SAWT and Hi-VAWT  from 1.5kW to 20kW NP in five and three blade forms, using improved designs having  low cost air-braking in different manners continue to be supplied into Asian and North American markets,  all  subsidized by the tax payer in various ways. \n\nBetz does not apply- VAWTs 3-6% more efficient- Thoenissen - Journal of Physics\n\nIn 2016 Thoenissen (Germany) published a new \"peer reviewed\"  paper in the Journal of Physics  proving the theoretical efficiency of VAWTs to be higher than those of HAWTS by about 3%-6% where the minimum  Cp (Coefficient of power)   is 0.626 versus HAWTs designed to the known Betz Cp limit of 0.59 based on 2D disk calculations. Local angle of Attack \"LAoA\" of the airfoil and  turbine \"solidity\" as well as blade shape are key co-dependent elements of optimal VAWT design described by Thoenissen \n\nIn 2017 a new H- Frame Darrieus design prototype, based on Thoenissen's new discovery, implementing the new Qblade tool from Technical University of Berlin Computational fluid Dynamics Center,  was delivered to Mobismart.ca of Canada for use with their clean power trailer for site testing. This \"Starwind5\" design created by Harvistor llc (USA) and built by staff  of the Centre for Innovation, Red Deer College Alberta Canada, together with the inventor, R. Reive,  utilizes a patented pending, five blade hi-solidity design for low mount locations configurable to support different wind site conditions with 1.5kW to 3kW NP, and is an auxiliary power generation element compliment solar and thermal charging of batteries delivering the prime power output.\n\nSmall VAWT market is alive, growing slowly, BIG MW VAWTS in the works\n\nBy 2019, the market for small VAWTs led by SAWT continues to grow slowly and sporadically driven by tax payer subsidies of various forms, while work on larger offshore MW VAWT systems progress at an even slower rate.\n \n\n\n\n\n",
			"date_added": 1574197712813,
			"slug": "home"
		},
		{
			"id": "96b33290-0b10-11ea-ab7d-0b122d1963d2",
			"body": "VAWT - Vertical Access Wind Turbine History.\n\nAncient VAWTs - Persia 500 AD  and likely older..\n\nFirst Used in Persia, around 500 AD, VAWTs were used and still are used to grind grain via mill stones, These early VAWT designs rely on seasonal onshore wind and were equipped with wind funnel walls. Amazingly, similarly VAWT systems are still in operation today in modern day IRAN.  iranianpedia.com/travel-tips-to-iran/wonders-of-nashtifan-windmills/. The rotors of these VAWTs use resistance or positive \"drag\" blades, often referred to as \"Savonius\" style VAWTs as first 'patented' by J.J Savonius of Finland in 1925.\n\nIn the Roaring 20s VAWTs re-surface\n\nAround that same time in France, George Marie Darrieus filed his first patent for  multiple \"lift\" style VAWTs in 1925, later filing the same patent in the USA in 1929. Darrieus used aeronautical principles of lift and drag, equipping two blade symmetrical rotors with airfoils to create positive rotation, focusing on electrical generation. Darrieus and Savonius both were reacting to energy shortages at the time and sought funding in various countries to create scale versions of their patents. Unfortunately both failed to raise the capital they desired,  largely  because new oil discoveries made in the late 1920s and early 30s . As a result their patents were largely ignored for decades.\n\nEarly Denmark \"Three Blade\"  HAWTs circa 1880s become the mainstream design...\n\nAny real wind development from the late 1800s focused on electricity generation at any scale were implemented in the HAWT Horizontal Axis Wind Turbine style in the more \"Danish\" three  blade propeller form, which proved to work well first in Denmark, and later improved  significantly in the 1930s and 1940s in Germany. \n\nVAWT Re-birth in Canada\n\nThe Darrieus \"EggBeater\"  hoop form of symmetrical rotor with two blades resurfaced in 1966 in Canada  (Raj Rangi & Peter South - Ministry of Natural Resources \"MNR\", working with the Canadian National Research Council \"NRC\") as part of a Federal Canadian government sponsored  research & commercialization development effort looking to combine  VAWT wind power and off-grid batteries couple  with backup diesel generation, as a way to reduce fuel costs in remote locations in the Canadian Arctic. It was later discovered by the inventors in the patent office the design already existed. which led to further development of the design to add vertical furling  braking attachments to prevent VAWT Eggbeater overspeed conditions, so as to reduce the cost of braking components used in early design to prevent damage to the electrical and mechanical components of the system and improve reliability.\n\n70s Oil Crisis Driven Big Wind R&D Starts: VAWTs show early promise..\n\nAs the world entered an OPEC led oil crisis in 1970, researchers and some investors in Canada, Europe (Denmark and Germany largely) and the USA again turned to funding wind power research and development in both  HAWT and VAWT forms looking to build a cost effective way to generate electricity without the use of non-renewable fossil fuels and the prices being dictated by OPEC. \n\nAt this time, around 1974, Sandia Labs in the USA started to co-operate and share information with the Canada MNR/ NRC project as it applied to VAWT, and worked directly with  Flowind of Washington (and later California) to adapt early water jet  driven metal (Steel and Aluminum) cutting technology  and  later, straight fiberglass pultrusion to create a Modern large-scale VAWT in parallel to efforts underway in Canada to build same. In Canada and the USA, initial rotor blade designs were extruded as Aluminum blades  and  arc welded to the drive shafts via large Aluminum companies operating in Canada and USA.  In Denmark the company Vestas experimented with multiple small VAWT designs and even a 'Bi-plane like \"  dual airfoil  blade ,  dual blade design. \n\nIn 1979, two early large  VAWT (250kW nameplate) deployments in Canada on the Magdalene Islands (Quebec) using belt drive systems to drive te generation which did work for awhile, until the braking systems failed allowing both installations to \"Self start\" (a condition that was thought not possible  at the time by the designers) to over-speed and destroy themselves. \n\n4.2M VAWT - Quebec (Canada) Style: the Hydro Quebec Grand \"Eole\"  1986-91\n\nThe Canadian effort to improve on these early designs was then led by  the Federal Government (Canadian Taxpayer)   financing  Hydro Quebec to create the enormous 4.2MW Cape Chat, Quebec \"Eole\" dual blade Darrieus EggBeater , fully activated by 1986, created by Shawinigan Engineering Quebec (alter absorbed partly by today's SNC Lavalin). The Eole operated initially just below the nameplate capacity at 3.5MW and immediately ran into braking problems, where brake material made of Asbestos was released into the generator set  stator and magnet  components, creating the chance of a fire. Repairs were made, and the output tuned down to 2.5MW, where the Eole ran successfully for 5 years before being decommissioned after the contract, as the Eole as never a cost effective project. \n\nCommercial VAWTS arrive in the 1980s- Sort of... Flowind Style\n\nIn parallel, Flowind focused on a 1984 deployment to two locations in CA, Altamont and Tehachapi Passes in South and North California for Southern CA Edison and PG&E respectively. Each had a deployment of 400+ smaller dual rotor Eggbeaters of 110 to 160kW NP. These two \"wind farms\" worked well for a time, however by year six, hairline cracks appeared in the welded joints of the connectors joining the aluminum (bent and loaded under torque) to the driveshaft. For safety reasons, the entire VAWT fleets of Flowind were eventually taken down, bankrupting the company. during this period Flowind evolved the second generation two blade design to three blades using the same platforms with genset upgrades to 440kW NP incorporating and extended height vs. diameter \"EHD\" ratio of the 3:1. For the first time pultruded blades of fibreglass composite were used. Flowind was able with the help of Sandia, airfoils.com and the NREL , US National Renewable Energy Labs and computational fluid dynamic modelling  software created by Ion Paraschiviou at the Polytechnical Unicersity of Montreal ( the same data used to create the Eole in Cape Chat) to help optimize the airfoil and rotor blade shape in \"Tropeskein\" \"skipping rope\" form, thought to be the optimal shape at the time by engineering experts.\n\nGolden Era of Big Wind Research- flattened by lower OPEC Oil Prices 1983\n\nDuring this \"golden\" period of r&d in Canada, USA and Europe for \"Wind Power\", OPEC had set prices at around US $18.00/barrel  which persisted until 1983, at which time prices were dropped to US $ 8.00/barrel to stimulate demand and lurch the world economy out a prolonged recession which has lasted 12+ years. This price drop in oil,  saw the  funding \"dry up\" for wind power  research and development in the USA almost immediately, and later in Canada. Europe continued on with HAWT \"r & d\" only. \n\nFlowind Stumbles and Dies- RIP 1982-1997- The end of  Commercial VAWT Viability\n\nFlowind in the USA , along with Indal and Addecon (Peter South) in Canada all  VAWT vendors,  went out of business by 1997,  prompted at the time, by the US Federal Subsidy for Wind power being dropped by the USA government of the day (B. Clinton 1993-2001). Additionally, in the HAWT segment Carter and AWI went out of business. Enercon, Bonus and Vestas retreated back the European markets and Clipper went into receivership (later acquired by GE).  With decimation of the US and Canada Wind industry complete, a state of affairs that persisted until the early 2000s, the general rumour spread about VAWTs throughout and by \"Big Wind\" experts was VAWTs did not work and only HAWTs could scale and come close to thermal efficiencies.\n\nSmall VAWT Vendors Pop up- Everywhere- the New Millenia of VAWTs\n\nSmall VAWT interest was reborn in the mid 2000s, with SAWT(2008) of China and Hi-VAWT(2007) of Taiwan deploying in large numbers,  straight blade and Eggbeater VAWTs based on old three blade designs created in the 1960s(Gyromill)  and 70s (NASA/NREL) respectively.  Both of these  small early re-births, like all wind HAWT and VAWT were heavily subsidized by the tax payer in order to compete with equally heavily subsidized thermal generation of electricity. \n\nAt this time the HAWT market was reviving itself with massive deployments led by Europe and followed in US, canada, China and Asia in general.\n\nRopatec Does the Rope-a-dope and Survives - Five Blade Vawts + Upside Down Airfoils  show up in 2008 \n\nOnly Ropatec of Italy/Germany/UK, despite going into receivership three times, managed to emerge in the late 2000s with a credible small NP capacity (30/40kW) design.  Ropatec successfully deployed a farm of  five blade systems integrated with existing MW class III HAWT systems using vortex spoiling tips . SAWT quickly followed suit with their own active air braking five blade designs. Interestingly, both fly their airfoils upside down and perform better than previous models they had created.\n\nOffshore Wind  is calling for? VAWTS really big VAWTS: The Sandia Labs  Solution\n\nIn 2011, interest in offshore big wind was rising on the backs of early deployments fraught with cost over-runs, which saw the cost per MW installed rise to US $4,500/kw in comparison with land based deployments routinely installed for under US $2,000.  As a result Sandia National Labs, the early r&d home for VAWTs \"dusted off\" the old research and began looking at how to supersize VAWTs, which had lower mount heights and were easier to service at ground level, making them more attractive for offshore deployments. By 2012 Sandia research had confirmed the \"LCOE\" Levelized cost of energy for VAWTS 4MWs or larger were up to 35% cheaper to deploy with much better ROI than current VAWT designs scaled to produce the same AEP \"Annual energy Production\" due  in large to lower OPEX 'operating expense\", and partly due to lower cost foundation  and mooring systems. \n\nSmall Gorlov Water Turbines morph into Wind Turbines, For awhile: 2007 to 2012  RIP\n\nDuring this time , the Gorlov invented helical twist VAWT designs were re-purposed at Quiet Revolution and UGE,  where both proved in the field to suffer from poor startup and low wind performance problems leading to poor AEP Annual Energy Production, thus both companies exited the small wind  VAWT market, where the former went bankrupt despite heavy subsidies received by the company and their customers in the UK market and,  the latter shifted focus into solar energy.\n\n2015 - The Return to Wind Acceleration Augmented VAWTs- 1600 Years later...\n\nRecently patents have been filed (2010, 2012) and approved (2015) at the USPTO office by Dr. K.Cory (A senior VP who previously worked as the New Technologies evaluator at Calpine, CA one of the largest developers of wind farms and gas powered generation). The Cory patents are supporting the mount of a carousel of VAWTS on an a wind acceleration tower , where the VAWTs  make use of CVTs (continuously variable transmissions) to create a smart wind farm tower capable of competing with thermal powered electrical generation systems without a subsidy. V3wind.com a stealth company in Dallas, Texas is leading the commercialization, underway since 2018.\n\nCurrent VAWT offerings from SAWT and Hi-VAWT  from 1.5kW to 20kW NP in five and three blade forms, using improved designs having  low cost air-braking in different manners continue to be supplied into Asian and North American markets,  all  subsidized by the tax payer in various ways. \n\nBetz does not apply- VAWTs 3-6% more efficient- Thoenissen - Journal of Physics\n\nIn 2016 Thoenissen (Germany) published a new \"peer reviewed\"  paper in the Journal of Physics  proving the theoretical efficiency of VAWTs to be higher than those of HAWTS by about 3%-6% where the minimum  Cp (Coefficient of power)   is 0.626 versus HAWTs designed to the known Betz Cp limit of 0.59 based on 2D disk calculations. Local angle of Attack \"LAoA\" of the airfoil and  turbine \"solidity\" as well as blade shape are key co-dependent elements of optimal VAWT design described by Thoenissen \n\nIn 2017 a new H- Frame Darrieus design prototype, based on Thoenissen's new discovery, implementing the new Qblade tool from Technical University of Berlin Computational fluid Dynamics Center,  was delivered to Mobismart.ca of Canada for use with their clean power trailer for site testing. This \"Starwind5\" design created by Harvistor llc (USA) and built by staff  of the Centre for Innovation, Red Deer College Alberta Canada, together with the inventor, R. Reive,  utilizes a patented pending, five blade hi-solidity design for low mount locations configurable to support different wind site conditions with 1.5kW to 3kW NP, and is an auxiliary power generation element compliment solar and thermal charging of batteries delivering the prime power output.\n\nSmall VAWT market is alive, growing slowly, BIG MW VAWTS in the works\n\nBy 2019, the market for small VAWTs led by SAWT continues to grow slowly and sporadically driven by tax payer subsidies of various forms, while work on larger offshore MW VAWT systems progress at an even slower rate.\n \n\n\n\n\n",
			"date_added": 1574197646393,
			"slug": "home"
		},
		{
			"id": "7900a890-0b10-11ea-ab7d-0b122d1963d2",
			"body": "VAWT - Vertical Access Wind Turbine History.\n\nAncient VAWTs - Persia 500 AD  and likely older..\n\nFirst Used in Persia, around 500 AD, VAWTs were used and still are used to grind grain via mill stones, These early VAWT designs rely on seasonal onshore wind and were equipped with wind funnel walls. Amazingly, similarly VAWT systems are still in operation today in modern day IRAN.  iranianpedia.com/travel-tips-to-iran/wonders-of-nashtifan-windmills/. The rotors of these VAWTs use resistance or positive \"drag\" blades, often referred to as \"Savonius\" style VAWTs as first 'patented' by J.J Savonius of Finland in 1925.\n\nIn the Roaring 20s VAWTs re-surface\n\nAround that same time in France, George Marie Darrieus filed his first patent for  multiple \"lift\" style VAWTs in 1925, later filing the same patent in the USA in 1929. Darrieus used aeronautical principles of lift and drag, equipping two blade symmetrical rotors with airfoils to create positive rotation, focusing on electrical generation. Darrieus and Savonius both were reacting to energy shortages at the time and sought funding in various countries to create scale versions of their patents. Unfortunately both failed to raise the capital they desired,  largely  because new oil discoveries made in the late 1920s and early 30s . As a result their patents were largely ignored for decades.\n\nEarly Denmark \"Three Blade\"  HAWTs circa 1880s become the mainstream design...\n\nAny real wind development from the late 1800s focused on electricity generation at any scale were implemented in the HAWT Horizontal Axis Wind Turbine style in the more \"Danish\" three  blade propeller form, which proved to work well first in Denmark, and later improved  significantly in the 1930s and 1940s in Germany. \n\nVAWT Re-birth in Canada\n\nThe Darrieus \"EggBeater\"  hoop form of symmetrical rotor with two blades resurfaced in 1966 in Canada  (Raj Rangi & Peter South - Ministry of Natural Resources \"MNR\", working with the Canadian National Research Council \"NRC\") as part of a Federal Canadian government sponsored  research & commercialization development effort looking to combine  VAWT wind power and off-grid batteries couple  with backup diesel generation, as a way to reduce fuel costs in remote locations in the Canadian Arctic. It was later discovered by the inventors in the patent office the design already existed. which led to further development of the design to add vertical furling  braking attachments to prevent VAWT Eggbeater overspeed conditions, so as to reduce the cost of braking components used in early design to prevent damage to the electrical and mechanical components of the system and improve reliability.\n\n70s Oil Crisis Driven Big Wind R&D Starts\n\nAs the world entered an OPEC led oil crisis in 1970, researchers and some investors in Canada, Europe (Denmark and Germany largely) and the USA again turned to funding wind power research and development in both  HAWT and VAWT forms looking to build a cost effective way to generate electricity without the use of non-renewable fossil fuels and the prices being dictated by OPEC. \n\nAt this time, around 1974, Sandia Labs in the USA started to co-operate and share information with the Canada MNR/ NRC project as it applied to VAWT, and worked directly with  Flowind of Washington (and later California) to adapt early water jet  driven metal (Steel and Aluminum) cutting technology  and  later, straight fiberglass pultrusion to create a Modern large-scale VAWT in parallel to efforts underway in Canada to build same. In Canada and the USA, initial rotor blade designs were extruded as Aluminum blades  and  arc welded to the drive shafts via large Aluminum companies operating in Canada and USA.  In Denmark the company Vestas experimented with multiple small VAWT designs and even a 'Bi-plane like \"  dual airfoil  blade ,  dual blade design. \n\nIn 1979, two early large  VAWT (250kW nameplate) deployments in Canada on the Magdalene Islands (Quebec) using belt drive systems to drive te generation which did work for awhile, until the braking systems failed allowing both installations to \"Self start\" (a condition that was thought not possible  at the time by the designers) to over-speed and destroy themselves. \n\n4.2M VAWT - Quebec (Canada) Style: the Hydro Quebec Grand \"Eole\"  1986-91\n\nThe Canadian effort to improve on these early designs was then led by  the Federal Government (Canadian Taxpayer)   financing  Hydro Quebec to create the enormous 4.2MW Cape Chat, Quebec \"Eole\" dual blade Darrieus EggBeater , fully activated by 1986, created by Shawinigan Engineering Quebec (alter absorbed partly by today's SNC Lavalin). The Eole operated initially just below the nameplate capacity at 3.5MW and immediately ran into braking problems, where brake material made of Asbestos was released into the generator set  stator and magnet  components, creating the chance of a fire. Repairs were made, and the output tuned down to 2.5MW, where the Eole ran successfully for 5 years before being decommissioned after the contract, as the Eole as never a cost effective project. \n\nCommercial VAWTS arrive in the 1980s- Sort of... Flowind Style\n\nIn parallel, Flowind focused on a 1984 deployment to two locations in CA, Altamont and Tehachapi Passes in South and North California for Southern CA Edison and PG&E respectively. Each had a deployment of 400+ smaller dual rotor Eggbeaters of 110 to 160kW NP. These two \"wind farms\" worked well for a time, however by year six, hairline cracks appeared in the welded joints of the connectors joining the aluminum (bent and loaded under torque) to the driveshaft. For safety reasons, the entire VAWT fleets of Flowind were eventually taken down, bankrupting the company. during this period Flowind evolved the second generation two blade design to three blades using the same platforms with genset upgrades to 440kW NP incorporating and extended height vs. diameter \"EHD\" ratio of the 3:1. For the first time pultruded blades of fibreglass composite were used. Flowind was able with the help of Sandia, airfoils.com and the NREL , US National Renewable Energy Labs and computational fluid dynamic modelling  software created by Ion Paraschiviou at the Polytechnical Unicersity of Montreal ( the same data used to create the Eole in Cape Chat) to help optimize the airfoil and rotor blade shape in \"Tropeskein\" \"skipping rope\" form, thought to be the optimal shape at the time by engineering experts.\n\nGolden Era of Big Wind Research- flattened by lower OPEC Oil Prices 1983\n\nDuring this \"golden\" period of r&d in Canada, USA and Europe for \"Wind Power\", OPEC had set prices at around US $18.00/barrel  which persisted until 1983, at which time prices were dropped to US $ 8.00/barrel to stimulate demand and lurch the world economy out a prolonged recession which has lasted 12+ years. This price drop in oil,  saw the  funding \"dry up\" for wind power  research and development in the USA almost immediately, and later in Canada. Europe continued on with HAWT \"r & d\" only. \n\nFlowind Stumbles and Dies- RIP 1982-1997- The end of  Commercial VAWT Viability\n\nFlowind in the USA , along with Indal and Addecon (Peter South) in Canada all  VAWT vendors,  went out of business by 1997,  prompted at the time, by the US Federal Subsidy for Wind power being dropped by the USA government of the day (B. Clinton 1993-2001). Additionally, in the HAWT segment Carter and AWI went out of business. Enercon, Bonus and Vestas retreated back the European markets and Clipper went into receivership (later acquired by GE).  With decimation of the US and Canada Wind industry complete, a state of affairs that persisted until the early 2000s, the general rumour spread about VAWTs throughout and by \"Big Wind\" experts was VAWTs did not work and only HAWTs could scale and come close to thermal efficiencies.\n\nSmall VAWT Vendors Pop up- Everywhere- the New Millenia of VAWTs\n\nSmall VAWT interest was reborn in the mid 2000s, with SAWT(2008) of China and Hi-VAWT(2007) of Taiwan deploying in large numbers,  straight blade and Eggbeater VAWTs based on old three blade designs created in the 1960s(Gyromill)  and 70s (NASA/NREL) respectively.  Both of these  small early re-births, like all wind HAWT and VAWT were heavily subsidized by the tax payer in order to compete with equally heavily subsidized thermal generation of electricity. \n\nAt this time the HAWT market was reviving itself with massive deployments led by Europe and followed in US, canada, China and Asia in general.\n\nRopatec Does the Rope-a-dope and Survives - Five Blade Vawts + Upside Down Airfoils  show up in 2008 \n\nOnly Ropatec of Italy/Germany/UK, despite going into receivership three times, managed to emerge in the late 2000s with a credible small NP capacity (30/40kW) design.  Ropatec successfully deployed a farm of  five blade systems integrated with existing MW class III HAWT systems using vortex spoiling tips . SAWT quickly followed suit with their own active air braking five blade designs. Interestingly, both fly their airfoils upside down and perform better than previous models they had created.\n\nOffshore Wind  is calling for? VAWTS really big VAWTS: The Sandia Labs  Solution\n\nIn 2011, interest in offshore big wind was rising on the backs of early deployments fraught with cost over-runs, which saw the cost per MW installed rise to US $4,500/kw in comparison with land based deployments routinely installed for under US $2,000.  As a result Sandia National Labs, the early r&d home for VAWTs \"dusted off\" the old research and began looking at how to supersize VAWTs, which had lower mount heights and were easier to service at ground level, making them more attractive for offshore deployments. By 2012 Sandia research had confirmed the \"LCOE\" Levelized cost of energy for VAWTS 4MWs or larger were up to 35% cheaper to deploy with much better ROI than current VAWT designs scaled to produce the same AEP \"Annual energy Production\" due  in large to lower OPEX 'operating expense\", and partly due to lower cost foundation  and mooring systems. \n\nSmall Gorlov Water Turbines morph into Wind Turbines, For awhile: 2007 to 2012  RIP\n\nDuring this time , the Gorlov invented helical twist VAWT designs were re-purposed at Quiet Revolution and UGE,  where both proved in the field to suffer from poor startup and low wind performance problems leading to poor AEP Annual Energy Production, thus both companies exited the small wind  VAWT market, where the former went bankrupt despite heavy subsidies received by the company and their customers in the UK market and,  the latter shifted focus into solar energy.\n\n2015 - The Return to Wind Acceleration Augmented VAWTs- 1600 Years later...\n\nRecently patents have been filed (2010, 2012) and approved (2015) at the USPTO office by Dr. K.Cory (A senior VP who previously worked as the New Technologies evaluator at Calpine, CA one of the largest developers of wind farms and gas powered generation). The Cory patents are supporting the mount of a carousel of VAWTS on an a wind acceleration tower , where the VAWTs  make use of CVTs (continuously variable transmissions) to create a smart wind farm tower capable of competing with thermal powered electrical generation systems without a subsidy. V3wind.com a stealth company in Dallas, Texas is leading the commercialization, underway since 2018.\n\nCurrent VAWT offerings from SAWT and Hi-VAWT  from 1.5kW to 20kW NP in five and three blade forms, using improved designs having  low cost air-braking in different manners continue to be supplied into Asian and North American markets,  all  subsidized by the tax payer in various ways. \n\nBetz does not apply- VAWTs 3-6% more efficient- Thoenissen - Journal of Physics\n\nIn 2016 Thoenissen (Germany) published a new \"peer reviewed\"  paper in the Journal of Physics  proving the theoretical efficiency of VAWTs to be higher than those of HAWTS by about 3%-6% where the minimum  Cp (Coefficient of power)   is 0.626 versus HAWTs designed to the known Betz Cp limit of 0.59 based on 2D disk calculations. Local angle of Attack \"LAoA\" of the airfoil and  turbine \"solidity\" as well as blade shape are key co-dependent elements of optimal VAWT design described by Thoenissen \n\nIn 2017 a new H- Frame Darrieus design prototype, based on Thoenissen's new discovery, implementing the new Qblade tool from Technical University of Berlin Computational fluid Dynamics Center,  was delivered to Mobismart.ca of Canada for use with their clean power trailer for site testing. This \"Starwind5\" design created by Harvistor llc (USA) and built by staff  of the Centre for Innovation, Red Deer College Alberta Canada, together with the inventor, R. Reive,  utilizes a patented pending, five blade hi-solidity design for low mount locations configurable to support different wind site conditions with 1.5kW to 3kW NP, and is an auxiliary power generation element compliment solar and thermal charging of batteries delivering the prime power output.\n\nSmall VAWT market is alive, growing slowly, BIG MW VAWTS in the works\n\nBy 2019, the market for small VAWTs led by SAWT continues to grow slowly and sporadically driven by tax payer subsidies of various forms, while work on larger offshore MW VAWT systems progress at an even slower rate.\n \n\n\n\n\n",
			"date_added": 1574197596569,
			"slug": "home"
		},
		{
			"id": "ff8ff900-0b0c-11ea-ab7d-0b122d1963d2",
			"body": "VAWT - Vertical Access Wind Turbine History.\n\nAncient VAWTs \n\nFirst Used in Persia, around 500 AD, to grind grain via mill stones, these earlier VAWTs relied on seasonal onshore wind and were equipped with wind funnel walls. Amazingly, similarly VAWT systems are still in operation today in modern day IRAN.  iranianpedia.com/travel-tips-to-iran/wonders-of-nashtifan-windmills/. The rotors of these VAWTs use resistance or positive \"drag\" blades, often referred to as \"Savonius\" style VAWTs as first patented by J.J Savonius of Finland in 1925.\n\nIn the Roaring 20s VAWTs re-surface\n\nAround that same time in France, George Marie Darrieus filed his first patent for  multiple \"lift\" style VAWTs in 1925, later filing the same patent in the USA in 1929. Darrieus used aeronautical principles of lift and drag, equipping two blade symmetrical rotors with airfoils to create positive rotation, focusing on electrical generation. Darrieus and Savonius both were reacting to energy shortages at the time and sought funding in various countries to create scale versions of their patents. Unfortunately both failed to raise the capital they desired,  largely  because new oil discoveries made in the late 1920s and early 30s . As a result their patents were largely ignored for decades.\n\nEarly Denmark \"Three Blade\"  HAWTs circa 1880s become the mainstream design...\n\nAny real wind development from the late 1800s focused on electricity generation at any scale were implemented in the HAWT Horizontal Axis Wind Turbine style in the more \"Danish\" three  blade propeller form, which proved to work well first in Denmark, and later improved  significantly in the 1930s and 1940s in Germany. \n\nVAWT Re-birth in Canada\n\nThe Darrieus \"EggBeater\"  hoop form of symmetrical rotor with two blades resurfaced in 1966 in Canada  (Raj Rangi & Peter South - Ministry of Natural Resources \"MNR\", working with the Canadian National Research Council \"NRC\") as part of a Federal Canadian government sponsored  research & commercialization development effort looking to combine  VAWT wind power and off-grid batteries couple  with backup diesel generation, as a way to reduce fuel costs in remote locations in the Canadian Arctic. It was later discovered by the inventors in the patent office the design already existed. which led to further development of the design to add vertical furling  braking attachments to prevent VAWT Eggbeater overspeed conditions, so as to reduce the cost of braking components used in early design to prevent damage to the electrical and mechanical components of the system and improve reliability.\n\n70s Oil Crisis Driven Big Wind R&D Starts\n\nAs the world entered an OPEC led oil crisis in 1970, researchers and some investors in Canada, Europe (Denmark and Germany largely) and the USA again turned to funding wind power research and development in both  HAWT and VAWT forms looking to build a cost effective way to generate electricity without the use of non-renewable fossil fuels and the prices being dictated by OPEC. \n\nAt this time, around 1974, Sandia Labs in the USA started to co-operate and share information with the Canada MNR/ NRC project as it applied to VAWT, and worked directly with  Flowind of Washington (and later California) to adapt early water jet  driven metal (Steel and Aluminum) cutting technology  and  later, straight fiberglass pultrusion to create a Modern large-scale VAWT in parallel to efforts underway in Canada to build same. In Canada and the USA, initial rotor blade designs were extruded as Aluminum blades  and  arc welded to the drive shafts via large Aluminum companies operating in Canada and USA.  In Denmark the company Vestas experimented with multiple small VAWT designs and even a 'Bi-plane like \"  dual airfoil  blade ,  dual blade design. \n\nIn 1979, two early large  VAWT (250kW nameplate) deployments in Canada on the Magdalene Islands (Quebec) using belt drive systems to drive te generation which did work for awhile, until the braking systems failed allowing both installations to \"Self start\" (a condition that was thought not possible  at the time by the designers) to over-speed and destroy themselves. \n\n4.2M VAWT - Quebec (Canada) Style: the Hydro Quebec Grand \"Eole\"  1986-91\n\nThe Canadian effort to improve on these early designs was then led by  the Federal Government (Canadian Taxpayer)   financing  Hydro Quebec to create the enormous 4.2MW Cape Chat, Quebec \"Eole\" dual blade Darrieus EggBeater , fully activated by 1986, created by Shawinigan Engineering Quebec (alter absorbed partly by today's SNC Lavalin). The Eole operated initially just below the nameplate capacity at 3.5MW and immediately ran into braking problems, where brake material made of Asbestos was released into the generator set  stator and magnet  components, creating the chance of a fire. Repairs were made, and the output tuned down to 2.5MW, where the Eole ran successfully for 5 years before being decommissioned after the contract, as the Eole as never a cost effective project. \n\nCommercial VAWTS arrive in the 1980s- Sort of... Flowind Style\n\nIn parallel, Flowind focused on a 1984 deployment to two locations in CA, Altamont and Tehachapi Passes in South and North California for Southern CA Edison and PG&E respectively. Each had a deployment of 400+ smaller dual rotor Eggbeaters of 110 to 160kW NP. These two \"wind farms\" worked well for a time, however by year six, hairline cracks appeared in the welded joints of the connectors joining the aluminum (bent and loaded under torque) to the driveshaft. For safety reasons, the entire VAWT fleets of Flowind were eventually taken down, bankrupting the company. during this period Flowind evolved the second generation two blade design to three blades using the same platforms with genset upgrades to 440kW NP incorporating and extended height vs. diameter \"EHD\" ratio of the 3:1. For the first time pultruded blades of fibreglass composite were used. Flowind was able with the help of Sandia, airfoils.com and the NREL , US National Renewable Energy Labs and computational fluid dynamic modelling  software created by Ion Paraschiviou at the Polytechnical Unicersity of Montreal ( the same data used to create the Eole in Cape Chat) to help optimize the airfoil and rotor blade shape in \"Tropeskein\" \"skipping rope\" form, thought to be the optimal shape at the time by engineering experts.\n\nGolden Era of Big Wind Research- flattened by lower OPEC Oil Prices 1983\n\nDuring this \"golden\" period of r&d in Canada, USA and Europe for \"Wind Power\", OPEC had set prices at around US $18.00/barrel  which persisted until 1983, at which time prices were dropped to US $ 8.00/barrel to stimulate demand and lurch the world economy out a prolonged recession which has lasted 12+ years. This price drop in oil,  saw the  funding \"dry up\" for wind power  research and development in the USA almost immediately, and later in Canada. Europe continued on with HAWT \"r & d\" only. \n\nFlowind Stumbles and Dies- RIP 1982-1997- The end of  Commercial VAWT Viability\n\nFlowind in the USA , along with Indal and Addecon (Peter South) in Canada all  VAWT vendors,  went out of business by 1997,  prompted at the time, by the US Federal Subsidy for Wind power being dropped by the USA government of the day (B. Clinton 1993-2001). Additionally, in the HAWT segment Carter and AWI went out of business. Enercon, Bonus and Vestas retreated back the European markets and Clipper went into receivership (later acquired by GE).  With decimation of the US and Canada Wind industry complete, a state of affairs that persisted until the early 2000s, the general rumour spread about VAWTs throughout and by \"Big Wind\" experts was VAWTs did not work and only HAWTs could scale and come close to thermal efficiencies.\n\nSmall VAWT Vendors Pop up- Everywhere- the New Millenia of VAWTs\n\nSmall VAWT interest was reborn in the mid 2000s, with SAWT(2008) of China and Hi-VAWT(2007) of Taiwan deploying in large numbers,  straight blade and Eggbeater VAWTs based on old three blade designs created in the 1960s(Gyromill)  and 70s (NASA/NREL) respectively.  Both of these  small early re-births, like all wind HAWT and VAWT were heavily subsidized by the tax payer in order to compete with equally heavily subsidized thermal generation of electricity. \n\nAt this time the HAWT market was reviving itself with massive deployments led by Europe and followed in US, canada, China and Asia in general.\n\nRopatec Does the Rope-a-dope and Survives - Five Blade Vawts + Upside Down Airfoils  show up in 2008 \n\nOnly Ropatec of Italy/Germany/UK, despite going into receivership three times, managed to emerge in the late 2000s with a credible small NP capacity (30/40kW) design.  Ropatec successfully deployed a farm of  five blade systems integrated with existing MW class III HAWT systems using vortex spoiling tips . SAWT quickly followed suit with their own active air braking five blade designs. Interestingly, both fly their airfoils upside down and perform better than previous models they had created.\n\nOffshore Wind  is calling for? VAWTS really big VAWTS: The Sandia Labs  Solution\n\nIn 2011, interest in offshore big wind was rising on the backs of early deployments fraught with cost over-runs, which saw the cost per MW installed rise to US $4,500/kw in comparison with land based deployments routinely installed for under US $2,000.  As a result Sandia National Labs, the early r&d home for VAWTs \"dusted off\" the old research and began looking at how to supersize VAWTs, which had lower mount heights and were easier to service at ground level, making them more attractive for offshore deployments. By 2012 Sandia research had confirmed the \"LCOE\" Levelized cost of energy for VAWTS 4MWs or larger were up to 35% cheaper to deploy with much better ROI than current VAWT designs scaled to produce the same AEP \"Annual energy Production\" due  in large to lower OPEX 'operating expense\", and partly due to lower cost foundation  and mooring systems. \n\nSmall Gorlov Water Turbines morph into Wind Turbines, For awhile: 2007 to 2012  RIP\n\nDuring this time , the Gorlov invented helical twist VAWT designs were re-purposed at Quiet Revolution and UGE,  where both proved in the field to suffer from poor startup and low wind performance problems leading to poor AEP Annual Energy Production, thus both companies exited the small wind  VAWT market, where the former went bankrupt despite heavy subsidies received by the company and their customers in the UK market and,  the latter shifted focus into solar energy.\n\n2015 - The Return to Wind Acceleration Augmented VAWTs- 1600 Years later...\n\nRecently patents have been filed (2010, 2012) and approved (2015) at the USPTO office by Dr. K.Cory (A senior VP who previously worked as the New Technologies evaluator at Calpine, CA one of the largest developers of wind farms and gas powered generation). The Cory patents are supporting the mount of a carousel of VAWTS on an a wind acceleration tower , where the VAWTs  make use of CVTs (continuously variable transmissions) to create a smart wind farm tower capable of competing with thermal powered electrical generation systems without a subsidy. V3wind.com a stealth company in Dallas, Texas is leading the commercialization, underway since 2018.\n\nCurrent VAWT offerings from SAWT and Hi-VAWT  from 1.5kW to 20kW NP in five and three blade forms, using improved designs having  low cost air-braking in different manners continue to be supplied into Asian and North American markets,  all  subsidized by the tax payer in various ways. \n\nBetz does not apply- VAWTs 3-6% more efficient- Thoenissen - Journal of Physics\n\nIn 2016 Thoenissen (Germany) published a new \"peer reviewed\"  paper in the Journal of Physics  proving the theoretical efficiency of VAWTs to be higher than those of HAWTS by about 3%-6% where the minimum  Cp (Coefficient of power)   is 0.626 versus HAWTs designed to the known Betz Cp limit of 0.59 based on 2D disk calculations. Local angle of Attack \"LAoA\" of the airfoil and  turbine \"solidity\" as well as blade shape are key co-dependent elements of optimal VAWT design described by Thoenissen \n\nIn 2017 a new H- Frame Darrieus design prototype, based on Thoenissen's new discovery, implementing the new Qblade tool from Technical University of Berlin Computational fluid Dynamics Center,  was delivered to Mobismart.ca of Canada for use with their clean power trailer for site testing. This \"Starwind5\" design created by Harvistor llc (USA) and built by staff  of the Centre for Innovation, Red Deer College Alberta Canada, together with the inventor, R. Reive,  utilizes a patented pending, five blade hi-solidity design for low mount locations configurable to support different wind site conditions with 1.5kW to 3kW NP, and is an auxiliary power generation element compliment solar and thermal charging of batteries delivering the prime power output.\n\nSmall VAWT market is alive, growing slowly, BIG MW VAWTS in the works\n\nBy 2019, the market for small VAWTs led by SAWT continues to grow slowly and sporadically driven by tax payer subsidies of various forms, while work on larger offshore MW VAWT systems progress at an even slower rate.\n \n\n\n\n\n",
			"date_added": 1574196104336,
			"slug": "home"
		}
	]
}