{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1,
			"title": "Можно ли настроить отображаение страниц сайта \"как есть\"?",
			"body": "Движок ZeroNet помещает HTML станиц сайта внутрь блока iframe. Возможно ли задать режим отображения \"как есть\"?\nНе понимаю: ради чего разрабочики решили помещать на каждую, даже явно статическую страницу, меню в виде значка в правом верхнем углу. Что мешало сделать отдельную страницу админки?",
			"added": 1557385376
		},
		{
			"topic_id": 2,
			"title": "Трекеры ZeroNet в Tor",
			"body": "Имеются ли другие трекеры помимо zero://boot3rdez4rzn36x.onion:15441? К нему не всегда удается подключиться, а обращение к трекерам вне сети Tor запрещено при исползовании режима \"Tor: всегда\", в результате приходится сидеть половину времени без пиров и обновления сети.",
			"added": 1557912796
		},
		{
			"topic_id": 3,
			"title": "Создание трекера для ZeroNet в Tor",
			"body": "Может кто подкинет мануалу как поднять трекер в Tor? Пытался прикручивать opentracker, но пока с нулевым результатом...",
			"added": 1558182099
		},
		{
			"topic_id": 4,
			"title": "Безопасность использования ZeroNet",
			"body": "При обращении к зайту (например, к форуму) производится загрузка всех сообщений всех пользователей, оставивших свои комментарии. После чего они хранятся локально и сидируется другим учасникам сети, запрашивающим данный зайт.\n\nСреди загруженных сообщений может оказаться запрещенная информация, хранение которой и тем более - распространение, перследуется уголовно. Причем пользователь, не просмотрев все топики данного форума не сможет определить ее наличие.\n\nДанная особенность может оказаться опасной, учитывая низкий уровень анонимности ZN. В любой момент пользователю, загрузившему такой зайт, может быть предъявленно обвинение в распростанении запрещенной информации. При этом не исключен вариант намеренного создания подобных зайтов со стороны карательных органов, с целью преследования пользователей сети.",
			"added": 1560332455
		},
		{
			"topic_id": 5,
			"title": "Проблема с трекерами",
			"body": "В последние несколько дней стало _заметно хуже_ устанавливаться соединения с трекерами в режиме \"Tor: always\". Часто не удается подключиться ни к одному из трекеров.\n\nПредполагаю, что такое поведение связано с появления ресурса 08chan, повлекшим возрастание нагрузки на существующие трекеры.\n\nХотелость бы узнать: проявляется ли эта проблема у кого-нибудь еще, использующего Tor?",
			"added": 1565301289
		}
	],
	"topic_vote": {
		"1_1P7PoyMkQ7MXyfgReQfHqgcPJaZhKhwAKn": 1,
		"1_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1
	},
	"next_comment_id": 275,
	"comment": {
		"2_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": [
			{
				"comment_id": 1,
				"body": "wikipedia.org",
				"added": 1557361676
			}
		],
		"1_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": [
			{
				"comment_id": 2,
				"body": "> [anotherneko](#comment_155_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Со всем этим страничка может взаимодействовать посредством js.\n\nТолько зачем  это взаимодейтвие без разбору пихать во все страницы сайтов, включая те, где оно изначально не предпологается?\nЭто относится к вопросу удобства переноса существующих сайтов в ZeroNet. Выходит, что разработчики, при всем уважении к ним, навязывают пользователям определеные технические решения, на базе продвигаемого ими стека технологий. Говоря проще - прибивают к нему свою сеть гвоздями. А потом эти самые пользователи, для которых собственно пилится  ZeroNet, удивляются: \"почему так мало активного народу и годного контента?\"",
				"added": 1557389642
			},
			{
				"comment_id": 3,
				"body": "> [caryoscelus](#comment_51_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Если добавить префикс /raw, iframe'а не будет. Если все ссылки относительные, то вроде даже нормально работает со статикой (а вот js оно тоже режет)\n\nСпасибо! Бду пробовать.",
				"added": 1557393020
			},
			{
				"comment_id": 4,
				"body": "> [if0](#comment_3_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Спасибо! Бду пробовать.\n\nДействительно работает.\nНеобходимо добавить ко всем внутрисайтовым URL префикс: \"/raw/<адрес сайта>/\" после чего в браузере будут отображаться чистые страницы. Жаль, что этой инфы в FAQ по созданию сайтов нет.",
				"added": 1557398352
			},
			{
				"comment_id": 5,
				"body": "> [if0](#comment_4_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Действительно работает.Необходимо добавить ко всем внутрисайтовым URL префикс: \"/raw/<адрес сайта>/\" после чего в браузере будут отображаться чистые страницы. Жаль, что этой инфы в FAQ по созданию сайтов нет.\n\nСтранно оно работает... Если использовать ссылку с префиксом /raw забив ее в адресной строке браузера, то да - работает. Но если попробовать перейти по ссылке без префикса, например со страницы Hello ZeroNet_, то вылетает ошибка: \"Server error\" и приходится добавлять префикс /raw в адрес в ручную. Получается, что главная страница страница по любому должна некоторым образом адаптирована к ZeroNet...\nМожет быть где-нибудь есть мануал по статическим сйтам? Упомининие про префикс /raw имеется разве что в исходниках :(",
				"added": 1557420942
			},
			{
				"comment_id": 6,
				"body": "> [caryoscelus](#comment_52_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Что это за сайт такой, что приводит к ошибке, если его поместить в iframe?\n\nСамый обычный HTML, без намека на JS. Ошибка такая: Err: KeyError: 'title' in UiServer.py line 103 > UiRequest.py line 152 > UiConfigPlugin.py line 21 > ContentFilterPlugin.py line 193 > UiRequest.py line 349.\nХочется попытаться заставить отображатся сайт в том виде, как он выглядит, при запросе с обычного веб-сервера, без каких-либо вебсокетов, шахмат и поэтесс.",
				"added": 1557423056
			},
			{
				"comment_id": 7,
				"body": "> [if0](#comment_6_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Самый обычный HTML, без намека на JS. Ошибка такая: Err: KeyError: 'title' in UiServer.py line 103 > UiRequest.py line 152 > UiConfigPlugin.py line 21 > ContentFilterPlugin.py line 193 > UiRequest.py line 349.\n> Хочется попытаться заставить отображатся сайт в том виде, как он выглядит, при запросе с обычного веб-сервера, без каких-либо вебсокетов, шахмат и поэтесс.\n\nОшибка в строке: title = site.content_manager.contents[\"content.json\"][\"title\"]. Да, действительно отсутствовало поле \"title\" в файле content.json после его автоматической генерации. Добавил. Теперь ошибки нет, но почему то игнорируются префиксы /raw и все открыватеся в iframe, как это было изначально...",
				"added": 1557423941
			},
			{
				"comment_id": 8,
				"body": "> [caryoscelus](#comment_53_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Даже не знаю. Без возможности потестить, не очень понятно, что можно ещё сделать. У меня на почти статическом сайте всё (кроме js) работает, если по /raw заходить; в том числе внутренние ссылки правильные (тоже на /raw).\n\nЕсли сразу переходить на сайт по ссылке, содержащий /raw, то будет работать. Странность в том, что если открыть сайт по обычной ссыле, то все внутренние ссылки, которые содержат /raw начинают отображаться в iframe. Проблема в том, что при такм отображении перестают работать анкеры, при переходе по ссылкам их содержащих, что существенно нарушает работу сайта.",
				"added": 1557516206
			},
			{
				"comment_id": 10,
				"body": "> [caryoscelus](#comment_54_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): А зачем внутри сайта делать ссылки на /raw? Можно же просто относительные ссылки делать; кто приходит по raw ссылке — продолжит видеть raw-версию, кто по обычной —продолжит видеть обычную. Если в iframe что-то не так работает, можно всем давать ссылку на raw\n\nПроблема в том, что обычная версия - криво работает :) А /raw ведет себя странно. По идеи, любая страница по ссылке с /raw должна отображатся в исходном виде, без условияй, зависящий от того, как были отображены другие страницы.\nОтносительные ссылки - не действуют. Первая страница с префиксом /raw,  открывается как надо, но только стоит перейти по любой вниутрисайтовой ссылке - будут открываться страницы с iframe.",
				"added": 1557518981
			}
		],
		"1_1NEipL4NsY5HP3QumkWJewYJwFtvgwMxu8": [
			{
				"comment_id": 9,
				"body": "> [ozago](#comment_4_1NEipL4NsY5HP3QumkWJewYJwFtvgwMxu8): Всем привет ! Еще не нашел толковой инструкции по добавлению уже работающего сайта из рунета. Хотелось бы более тщательно узнать об ограничениях и требованиях для созданных в Zeronet сайтов. Как обстоят дела с динамическими сайтами такими например как доски объявлений с внутренним чатом. Буду благодарен за полезную информацию...\n\nРазработчики приветствуют и поощряют использование паттерна SPA, на котором здесь все завязано. Даже страницы полностью статических сайтов движок ZeroNet, динамически подгружает в iframe.",
				"added": 1557518248
			},
			{
				"comment_id": 17,
				"body": "Если кому будет интересен небольшой эксперимент со статическими страницами: http://127.0.0.1:43110/raw/1ALLZR7VQJiuXn8sgmUoP4cTFTFhWDro3L/",
				"added": 1558107581
			},
			{
				"comment_id": 18,
				"body": "> [vcrter](#comment_1_1KkWh8XZMKs3dYGuc7XXYncfCvsY2NUPg1): не работает\n\nTrackers: 0/17",
				"added": 1558110855
			}
		],
		"1_1P7PoyMkQ7MXyfgReQfHqgcPJaZhKhwAKn": [
			{
				"comment_id": 11,
				"body": "> В этом чувствуется современная эпоха, в которой разработчики во-первых, мыслят в первую очередь о том, как им связать имеющиеся у них разнородные модули, во-вторых, вам показывают один-два-три красивых переключателя (ВКЛ. ТОР/ВЫКЛ. ТОР), а все остальные вещи оказываются предельно неудобными.\n\nДух эпохи - хипстерство во все дыры. Наверное разрабам религия не позволила (или они не захотели прослыть ретроградами) вынести все настройки на отдельную страницу админки, так же сделать полноценную страницу с состояниями сайтов и сети, а не ущербный сайдбар,  которым невозможно пользватся, когда количество сайтов начинает периближаться к сотни. Менеджер закладок браузера хоть позволяет создать упорядоченную структуру для ссылок, присвоить теги, написать примечание. Здесь же - недостатистика совменщенная с недоменеджером ссылок. Зато - модно, стильно, молодежно.\n\nК тому же их модные SPA не всегда сохраняют позицию просмотра на странице, поэтому ссылки приходится открывать всегда в новом табе, потому что при возврате старница будет показана с начала (в случае перезапуска приложения). Особенно такое поведение достает на вкладке \"файлы\".\n\nАпофеозом бесполезности и ненужности является закладка \"stats\". Чего стоит карта мира с учетом использования tor и диаграмма сайтов с топ трафиком - настолько красочная настолько же бесполезная. Лучше бы децентрализованный обмен пирами запилили, чем тратили время на продвинутый дизайн интерфейса.",
				"added": 1557910001
			},
			{
				"comment_id": 12,
				"body": "> Если вы удаляете сайт ZeroNet, вы не удаляете его полностью. Информация о нем остается в sites.json и users.json. Поэтому, чтобы избавиться от сайта, нужно зайти в sites.json и users.json, и удалить оттуда информацию о сайте.\n\nМало того, информация о файлах не обновляется при изменениях, вносимых в структуру своего сайта, в результате на странице \"файлы\" отображаются имена уже несуществующих файлов наряду с новыми.\n\nМожно было запостить на багтрекр, но у разарабов, судя по количеству багов, и без этого работы лет на 10 вперед.",
				"added": 1557911372
			},
			{
				"comment_id": 13,
				"body": "> [realkasper](#comment_1_13HdA2pxqV8Qjwnnb6zHjJpRQWkEHjmWPU): Начал пользоваться. Идея прекрасная, за этим будущее. Все участники сети являются ее \"носителями\". Нет зависимости от хостинга и цензуры. Пока не понятно можно ли делать полноценные сайты, или только простые странички на движке который сам zeronet дает?\n\n> Нет зависимости от хостинга и цензуры.\nНо есть зависимость от доступности трекеров.\n\n> Пока не понятно можно ли делать полноценные сайты, или только простые странички на движке который сам zeronet дает?\nСудя по всему, пока еще более-менее будут работать только так называемые \"зайты\", прибитые гвоздями к API ZeroNet.",
				"added": 1557913519
			}
		],
		"1_1PR4t74Qa3uWZuAUyPs6yPZm2kzuQdN3q7": [
			{
				"comment_id": 14,
				"body": "Например Kaffiene: http://127.0.0.1:43110/1Mr5rX9TauvaGReB4RjCaE6D37FJQaY5Ba/",
				"added": 1557946019
			},
			{
				"comment_id": 21,
				"body": "> [savei](#comment_1_1FBTC6V1jDgdJc3SqgixJmGazdHZwqbAHU): https://ya.ru ?)\n\nЭтот куда более дерьмовый, чем любой из множества местных...",
				"added": 1558346394
			}
		],
		"2_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": [
			{
				"comment_id": 15,
				"body": "> [gluek](#comment_17_1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi): Разве к остальным не будет подключаться через Tor?\n\n[2019-05-15 23:09:52,189] DEBUG    ConnServer Conn# 2 91.121.50.14 [?] > Closing connection: 91.121.50.14 Connect error: SOCKS5Error: 0x02: Connection not allowed by ruleset in ConnectionServer.py line 197 > Connection.py line 151 > socks.py line 681 > socks.py line 383 > socks.py line 458, waiting_requests: 0, sites: 0, buff: 0...\n[2019-05-15 23:09:52,189] WARNING  Site:1TaLkF..jipT Tracker zero://91.121.50.14:51604 announce failed: Invalid response: None in mode startup\n\nИ так по всем трекерам вне тора - not allowed by ruleset.",
				"added": 1557952607
			},
			{
				"comment_id": 20,
				"body": "> [deliriumgoddess6](#comment_74_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): нет, если не ввести корректные настройки\n\nУ меня был установлен в torrc флаг \"OnionTrafficOnly\", запрещающий обращение ко всем адресам, кроме .onion, что было причиной сообщения: \"not allowed by ruleset\". Проблема была из-за не правильной настройки.\n\nХотя странно, что имеется всего лишь один единственный трекер и вместо того, что бы задействовать трекеры в Tor,  вся сеть используют трекеры находящиеся в клирнете, для чего приходится грузить выходные ноды Tor запросами к ним. Не понятное решение.",
				"added": 1558210753
			},
			{
				"comment_id": 23,
				"body": "> [anotherneko](#comment_157_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Ну как бы никто не запрещает поднять еще один .onion трекер у себя и раздавать его через протокол обмена трекерами. Для него даже внешний ip не нужен.\n\nЯ попытался по наитию поднять трекер используя opentracker, но он не желал подхватываться ZeroNet. Возможно, протокол другой или еще что. А мануалы, как правильно поднять трекер в Tor не обнаружилось.",
				"added": 1558462239
			},
			{
				"comment_id": 24,
				"body": "> [anotherneko](#comment_158_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Для onion поддерживался вроде только zero:// протокол. Трекер под него можно скачать тут: https://github.com/ZeroNetJS/zeronet-tracker дальше по идее нужно поднять под него hidden serice и забить в свой клиент.\n\nСпасибо за инфу.\n\nДля трекера требуется нода с npm... \"Какой неожиданный поворот!\"\n\nРобко поинтересуюсь: а без ноды никак нельзя?",
				"added": 1558465738
			},
			{
				"comment_id": 25,
				"body": "> [anotherneko](#comment_159_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Зато не на питоне (:\n\nПитон бы сильно тек по памяти, его пришлось бы рестартовать после каждых 10К запросов, поэтому они не решились.\n\nЭто как в анекдоте: если немного подождать, то подадут ноду...\n\n> Это единственная реализация трекера с zero-протоколом, которую я нашел. Можно еще поискать потщательней или же написать свою реализацию на своем любимом яп.\n\nУвы, это - понятно. Вопрос имел ярко выраженный риторический оттенок. Как же это по хипсторски: ломать совместимость по любому чиху и плевать на стандарты.",
				"added": 1558468285
			}
		],
		"1_1KkWh8XZMKs3dYGuc7XXYncfCvsY2NUPg1": [
			{
				"comment_id": 16,
				"body": "Зачем?",
				"added": 1558041964
			}
		],
		"3_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": [
			{
				"comment_id": 19,
				"body": "> [zigzero](#comment_1_13vQWBxBdQx4dp8JZp71TJsXo7iaDJ4qHq): https://youtu.be/3IBHKr_SGl8\n\nВ плагине нет настроек, которыми можно было бы задать фиксировнный .onion адрес. Основная идея трекеров, находящихся в Tor: все запросы при использовании ZeroNet останутся внутри Tor.",
				"added": 1558209263
			}
		],
		"1_1CjXSjhpi742HFZts17YvN1U1v9CfrWHsq": [
			{
				"comment_id": 22,
				"body": "> [zerg0](#comment_2_1LqR5zxKufzzvmkbbrTHdbn3cHRsefLTz3): Адназначна. Вы думаити проста так 0нет написан на питоне?!\n\nСам факт использования Питона в неком проекте способен сказать слишком многое о нем. Как минимум, что он никогда не будет доведен до своего финала и в нем постоянно будут вылазить \"совершенно неожиданные\" баги в изрядном количестве.\n\nПочему? Подсказка: проект так и останется работающим прототипом, созданным в спешке ради как можно более быстрого демонстрирования базовых возможностей. Тесты? Нет времени на написание тестов, у нас еще не все обещанные в роадмапе фитчи зарелижены и критческие баги не пофикшены...",
				"added": 1558458152
			}
		],
		"8_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 26,
				"body": "Робко предположу, что здесь нет пользователей сабжа...",
				"added": 1559393286
			},
			{
				"comment_id": 28,
				"body": "> [deliriumgoddess6](#comment_76_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): да хотя бы поразмышлять. А то его рекламировали на днях, хотя и давно разрабатывается.\n\nХорошая вешь в рекламе не нуждается. А сомнительной - без рекламы не обойтись. При сильном продвижении чего-то или попытках его хайпа всегда имеется скрытый подвох.",
				"added": 1559518334
			}
		],
		"2_1532gmVR6nUwMS85i4JTgiqQY1rn44pkd3": [
			{
				"comment_id": 27,
				"body": "А что еще было ожидать? Хозяин - барин, что хочет то и творит со своей сетью. Для всех недовольных имеется пользовательское соглашение, одобренное при регистрации.",
				"added": 1559517869
			}
		],
		"1_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N": [
			{
				"comment_id": 29,
				"body": "Странный вопрос. Для чего обновлять демонстрационый прототип, когда он и так успешно выполняет свое предназначение: демонстрирует возможности?",
				"added": 1559585382
			}
		],
		"1_12XPYvUFzmczXdTy4GJxB1WGrnwrdpTCqD": [
			{
				"comment_id": 30,
				"body": "Вливайся! Популяризация - в действии.",
				"added": 1559979799
			}
		],
		"12_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 31,
				"body": "А в чем прикол обсуждения сабжа именно на вашем форуме, а не здесь ;-)\nЕще больше заброшенных, никому не известных форумов из пяти топиков и одного пользователя заглядывающего раз в месяц, засирающих сайдбар Hello ZeroNet?",
				"added": 1560196609
			}
		],
		"1_1Fdubdz82XUxNMuaHGYC3uKD95XbnW7JTs": [
			{
				"comment_id": 32,
				"body": "Только что делать дальше с подарочными шиткоинами?",
				"added": 1560196800
			},
			{
				"comment_id": 33,
				"body": "> [lolipin](#comment_1_1GT9qSUkxoCxTiPS2AtS7fSqDGtGkQMRcb): Вообще то они бабки стоят хоть и немного\n\nБабок стоят известные крипты, а не хайпящиеся их лохотронные форки - шиткоины.\n\n> и ты запятую забыл поставить\n\nИзвини.",
				"added": 1560258465
			}
		],
		"4_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": [
			{
				"comment_id": 34,
				"body": "> [randombalance](#comment_1_1Dk2yqfYUheHV7BhNX53EPrXisN341NpXb): Ещё одна причина установить TOR, и в настройках ZeroNet указать всегда использовать только его. А так же не забываем про шифрование дисков.\n\nИспользование Tor и шифрование дисков, увы, не отменяеет отсутствие возможности контролировать хранение и сидирование того или иного контента. Что потенцеально может иметь печальные последствия.",
				"added": 1560335195
			},
			{
				"comment_id": 35,
				"body": "Если бы пользователи сети могли загружать, хранить и сидировавать только интересный и необходимый им самим контент, то вероятность раздать что-нибудь неожиданное была бы сведена к нулю. К тому же это был бы дополнительный фильтр, для потенциального спама, троллинга и флуда, который наверняка появится в случае роста популярности сети, который не придется хранить и раздавать вместе с полезными сообщениями.\n\nВ случае отсутствия такого контроля требуется повышать безопасность и анонимность (привет, JS!) или давать возможность (на уровне отдельных страниц зайта, форумных тредов, пользовтелей и сообщений)  управления хранением и сидированием любого контента, а не только файлов картинок, что бы исключить возможность подставы пользователей.",
				"added": 1560512358
			},
			{
				"comment_id": 44,
				"body": "> [ultraviolet](#comment_1_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Теоритически для уголовного преследования необходимо доказывать вину в распространении противозаконного контента. Но учитывая особенности работы полиции в России есть большая вероятность посидеть в СИЗО  и на зону отправится, да и вина бывает в форме неосторожности.  Опасность есть и она вполне реальная.                                                                                                                                                                                     Поэтому крайне рекомендую:                                                                                                                                                                           1. Используйте ZeroNet поверх Tor или размещайте ZeroNet на VPS за границей, лучше купленной на левуе имя. Соединйтесь с ней как минимум по ssh а лучше через tor или i2p скрытй сервис.                                                            2. Установите ZeroNet на зашифрованном томе, можно на зашифрованной флешке или сетевой шаре (особо хорошо в сочетании с VPS). Шифруйте с ключевым файлом, ключевой файл на отдельной флешке которую можете всегда сломать или выбросить (лучше в завале других внешне неотличимых файлов, например фотографий близких)                                                                                                                                                                                           3. Не посещайте явно противозаконные ресурсы:-)                                                                                                                         4. Заведите отдельный \"пустой\" экзеиляр ZeroNet                                                                                                                                        5. Ни в чём не сознавайтесь, ни что не подписывайте без адвоката                                                                                                              (а если занимаетесь чем-то сколь-либо опасным, то адвокат у вас уже должен быть и его ФИО, номер в реестре зазубрены, телефон в быстром наборе, и подписанный вами адвокатскоий ордер у него в кормане:-))\n\nПункт 0. Для начала, хотя бы просто инфоримровать всех новых пользоватедей, о возможных последствиях использования сети - опастностях, заложенных в ее дизайне, если это не делают сами разработчики. Которые позволяют, без какого-либо подтверждения со стороны пользователя, использовать ее в открытую, без прокси.",
				"added": 1561300321
			},
			{
				"comment_id": 45,
				"body": "> [ultraviolet](#comment_3_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): На этом форуме практически ничего преступного нет.\n\nНюанс заключается в слове \"практически\". Вы просмотрели каждый комментарий в каждом топике данного форума? А ведь вы их все сидируете в этот самый момент... И если не используете прокси, то тов. майор может скачать этот форум с вашего IP и заполучить прямое доказательство факта распространения некого контента.",
				"added": 1561319967
			},
			{
				"comment_id": 47,
				"body": "> [ultraviolet](#comment_17_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Я с Вами согласен, что возможность подобной ситуации крайне существенна.  Такова практика. Считается что любой репост уже распространение.  Репост правда требует от человека осознанных действий, ZeroNet же распространяет информацию без прямого волеизъявления пользователя.  Для уголовного права это должно быть существенное отличие.  Увы в России качество уголовного судопроизводства ниже плинтуса.\n\nВыходная нода Tor также \"передает и распространяет контент без прямого волеизъявления\" ее владельца. Только здесь аргумент: вы предприняли осознаные дейтвия по ее поднятию, осознавая, что она \"может распростанать\". Аналогия: находясь за рулем транспортного средства вы не имели намерения причинять увечия несовместимые с жизнью переходящему перед вами пешеходу. \n\n>А помимо уголовного права есть ГК и административный кодекс. По поводу ГК было решение тогда ещё Высшего Арбитражного Суда о том, что для наступления гражданской ответственности наличие вины необязательно. Решение было по поводу распространения пиртчины в торрентах.  К ZeroNet оно применимо полностью. Административный кодекс также допускает объективное вменение,  чем ЦПЭ пользуется.  Но по административному правонарушению по счастью нельзя выписать ордер на обыск или прослушку.\n\nВсе хуже: в форуме может присутствовать тред вербовщиков из запрещенной организации - тогда это будет гарантированная уголовная статья. Привлекут не их (они знали и использовали прокси), а кого легче и быстрее поймать - очердного \"мамкиного любителя свободы\", который прочитал про ZN и бросился сломя голову его запускать.",
				"added": 1561328955
			},
			{
				"comment_id": 49,
				"body": "> [ultraviolet](#comment_20_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Ваша аналогия НЕ верна. Автомобиль - источник повышенной опасности.  ZeroNet - нет.  Поэтому если подходить строго юридически пользователю ZeroNet скорее грозит гражданская внедоговорная и административная ответственность, но не уголовная.  Это в теории.  Реальное правосудие в России давно в разобранном состоянии. Верховный Суд два раза выскал постановления по делам об экстремизме и на оба постановления суды и прокуратуры не обращади внимания.  И несмотря на тотальное игнорирование его же постановлений Верховный Суд не отменил ни одного приговора по экстремистким статьям, даже когда они были вынесены с жесточайшими нарушениями его же постановлений.\n\nВидать у них была разнарядка, спущеная сверху - вынести определенное количество приговоров по оределенным статьям, с целью показательного запугивания. Вот если бы против самих судей могли возбуждать дела за нарушение судопроизводства, причем с полным пересмотром всех их дел.",
				"added": 1561330909
			},
			{
				"comment_id": 52,
				"body": "> [ultraviolet](#comment_23_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): В судах разнорядки нет.  Причина в другом       \n> \n> Судьи в России назначаются чаще всего из состава прокурорских работников или что совсем плохо - секретарей судов. Секретарь не может стать нормальным судьёй. Просто совсем разные качества личности.  Судей вышедших из адвакатуры почти нет.    \n> \n> Процесс отбора в судьи федеральных судов закрытый.  Формально их назначает Президент, но реально он опирается на мнение специальной комиссии где главенствует ФСБ.  ФСБ формально проверяет прошлое кандидата и докладывает Президенту, но вот сохраняет ли это ведомство для себя компромат на судью - вопрос интересный.\n> \n> Судьи очень зависят от председателей судов. Председатели это отдельная каста в судейском сообществе. Это и есть основной механизм влияния на судей.\n> \n> Судей наказывают за пересмотренные вышестоящей инстанцией дела.\n> \n> Судьи очень загруженны.\n> \n> Вопросы социального обеспечиния судей, например вопрос с служебным жильём это постоянная чехарда, то дают то не дают.  Это усиливает зависимость судьи от председателя.                                                                                             \n> \n> Назначение судей с испытательным сроком позволяет отсеивать тех кто не очень управляем председателем суда.                                                                                                                                                                                                 \n> \n> \n> Практически основные проблема из за пунктов 1, 3-7. Пункт 2 скорее относится к политическим делам.\n\nКратко резюмируя - полный беспросветный мрак, без намека на надежду выхода из порочного круга. Откуда возмется незваисимый суд, если он под колпаком гэбистов (которые все сильнее наглеют в последнее время) и ключевые решения выносятся \"по звонку\".",
				"added": 1561371096
			}
		],
		"1_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ": [
			{
				"comment_id": 36,
				"body": "> [qpchangoku](#comment_11_1532gmVR6nUwMS85i4JTgiqQY1rn44pkd3): Текстом можно?\n\nВы просите невозможного. Это поколение в текст не умеет...",
				"added": 1561023742
			},
			{
				"comment_id": 37,
				"body": "Протокол Matrix требует серверов, которые кто-то должен поднимать и поддерживать, заодно вести логи (и делиться ими с кем следует ),  поэтому это пример очередного ненужно.",
				"added": 1561024038
			},
			{
				"comment_id": 40,
				"body": "> [xcfr](#comment_1_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ): сервера в разных странах\n\n1. Тем проще ограничить к ним доступ в условиях Чебурнета. А внутри его вряд ли найдутся отчаянные смельчаки отважившиеся хранить на своем публичном сервере сообщения случайных людей, тем более в зашифорованном виде. Вы бы сами рискнули поднять подобный сервер у себя дома?\n2. Откуда вы узнаетете, что заграничный сервер не создан тов. майором?\n3. Это не отменяет факта сбора метаданных о вас: списка ваших контактов, времени отправки и приема каждого сообщения, их отправители и адресаты. Что может оказаться еще опаснее, чем раскрытие содержимого ваших зашифрованных сообщений.",
				"added": 1561058298
			},
			{
				"comment_id": 41,
				"body": "> [xcfr](#comment_2_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ): согласен но в условиях чебурнета можно ставить сервер в у себя дома и вся россия будет им пользоваться\n\nЭто шутка такая? Ставить и не беспокоится о приходе тов. майора который обнаружит на нем переписку членов зпрещенных организций, оскорбления власти и прочие призывы, которые вы лично публично распространяете...",
				"added": 1561106532
			},
			{
				"comment_id": 42,
				"body": "> [xcfr](#comment_3_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ): какой маер его через Tor браузер можно юзать https://riot.im/app/#/welcome\n\nTor браузер в Чебурнете! Это уже не смешно. После того, как в здесь судят владельцев выходных нод, в результате чего ноды Tor на рунетовских адресах будут с большой вероятностью - майорские. Поэтому, первым делом при настройке клиента запрещается их использование.\n\nЭто будет работать исключительно при переходе в .onion и полного отказа от клирнета. Указанный вами адресок, как-то не похож на .onion. Другой вопрос: много ли народа (кроме майоров, которым по службе положено) захотят поднимать у себя транзитные ноды Tor? Зарубежные - работать перестанут. Тогда, более логичным видится выбор i2p, а не Tor.\n\nИ повторюсь еще раз: даже скрытие вашего IP не отменяет сбор информации на сервере о контактах вашего аккаунта, кому и когда вы пишите и кто пишет вам. Если кто-то из списка ваших контактов окажется в разработке, то и к вам резонно возникнут вопросы от органов.",
				"added": 1561189300
			},
			{
				"comment_id": 43,
				"body": "> [ultraviolet](#comment_2_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Шифруйте диск.  Да все знают, но не все делают.\n> \n> Используйте (шифрованный!)  RAM диск.  В случае чего просто ребутаете машину (а может и сами ребутнут)\n> \n> Для шифрования используйте ключевой файл или даже набор файлов которые можете уничтожить например сломав флешку. Да и сам ключевой файл должен лежать в куче других файлов\n> \n> Если уж у вас организация - распределите ключевые файлы между доверенными участниками. Кворум ключей.\n> \n> Чистите историю. Нужно хранить только, то, что реально нужно.\n\nРечь, вообще то шла о рисках, сопровождающих поднятие \"у себя дома\" публичного сервера для Matrix, который должен работать постоянно и хранить данные, необходимые для его работы...  А не о безопасности переписки в нем или любом другом мессенджере.",
				"added": 1561299280
			},
			{
				"comment_id": 46,
				"body": "> [xcfr](#comment_5_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ): можно анонимно арендовать сервер\n\nАнонимно? В Чебурнете?!  %-)))",
				"added": 1561320215
			},
			{
				"comment_id": 79,
				"body": "> [ultraviolet](#comment_48_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Тогда вообще не парьте голову. Если не хотите становится героями и готовы просто отдать логи и пр - придут спросят отдадите.  Ну может на особо дубовых ментов попаёте обыск устроят, кавордак дома и несколько часов беседы в участке  и сервак отнимут. Если будите сотрудничать последствий не будет.\n\nТак проблема будет не просто в предоставлении логов, а в раздаче определенного контента в процессе работы данного сервера. Тот же случай, как с выходной нодой Tor. Кроме того обязательно попросят предоставить ключи от зашифорванных сообщений, и придется еще дополнительно доказывать, что у вас ключей нет и не может быть - так работает протокол, что бы не стать чьим-нибудь соучастником.",
				"added": 1561492180
			}
		],
		"1_1NLPDTeR1u6wktAeKpWY9rgyEgdnBjYbWy": [
			{
				"comment_id": 38,
				"body": "Трекеров с чем?",
				"added": 1561033611
			},
			{
				"comment_id": 39,
				"body": "> [l0stedmind](#comment_4_1NLPDTeR1u6wktAeKpWY9rgyEgdnBjYbWy): Трекеры для zeronet\n\nОни и так вроде нормально ищутся автоматически. К тому же, не все из трекеров могут быть доступны круглосуточно, потому что подняты через плагин: ZeroNet/plugins/Bootstrapper во время активности клиента.",
				"added": 1561041800
			}
		],
		"1_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 48,
				"body": "1. Не приходилось вынужденно делать через силу, то что осознаешь бесполезной для себя тратой времени, которе стоило бы потратить более рационально.\n\n2. Не хочется переживать о будущем и возможных проблемах с ним связанных, и мысли: \"будет толкько хуже\".\n\n3. Не заботиться о благостоянии и не задумываться о повседневных тратах: еда, одежда, комуналка, налоги, транспорт.",
				"added": 1561330084
			},
			{
				"comment_id": 53,
				"body": "> [geekless](#comment_124_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): В абсолютном смысле счастье недостижимо. Если устранить все факторы стресса, то неизбежна деградация личности.\n\nНа смену \"бытового\" стресса придет \"творческий\", который спасет от деградации.",
				"added": 1561371424
			},
			{
				"comment_id": 54,
				"body": "> [caryoscelus](#comment_63_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE):  у меня нет уверенности, что до конца понимаю, что под этим словом подразумевают другие люди. У меня-то особого стремления к \"счастью\" (почти?) никогда и не было.\n\nЛогично. Как можно стремиться к тому, что не понимаешь?\n\nКаждый понимает по разному. Думается, что это - душевное спокойствие, комфорт, умиротворенность, согласие с самим собой и окружающими. Противоположность - беспокойству, страху, давлению, непониманию, неопределенности.",
				"added": 1561377120
			},
			{
				"comment_id": 55,
				"body": "> [geekless](#comment_127_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Только если под наркотой?..\n> Думаю, всё равно человек существо социальное, и встроенный индикатор \"по меркам общества я деградирую\" будет сигналить.\n\nА вдруг, окажется, что это общество - дергадирует? При этом понадобится срочно \"проявлять свои социальные черты\" и деградировать вместе со всеми? Как будто, большинство никогда не может ошибаться (по особому праву большинства) или заблуждаться, и факт принадлежность к этому большинству является гарантом \"нормальности\".",
				"added": 1561377723
			},
			{
				"comment_id": 56,
				"body": "> [caryoscelus](#comment_64_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Чтобы не было социальных проблем, деградировать надо в обществе себе подобных, счастливых и деградирующих ^_^\n\nИменно. Простейший рецепт \"счастливого общественного согласия\": всегда поступать \"как сделают все\", не выделяться, иметь мнение, совпадающее с окружающими, критически продумывать и оценить каждый свой поступок с точки зрения мнения окружащих, со всеми соглашаться и под всех подстраиваться и безропотно принимать все происходящее вокруг - \"как должное\".",
				"added": 1561378904
			},
			{
				"comment_id": 57,
				"body": "> [caryoscelus](#comment_65_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): А вообще мне кажется большинство людей не замечают когда деградируют\n\nЯсное дело. На общественном фоне процесс совершенно не заметен для внутреннего наблюдателя.",
				"added": 1561379052
			},
			{
				"comment_id": 61,
				"body": "> [geekless](#comment_129_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Если кто-то в среднем продвинутее своего окружения, он будет более приспособлен к жизни и активен. А будучи таким, он в столкнётся с теми, кто ему равен по прогрессу, и между ними развернётся борьба на равных. Это, мать её, эволюция. :)\n\nПродвинутость и социальная значимость в современном обществе определяется уровнем неразумного потребления. Конкурировать с соседом: кто больше накупит всякого ненужного дерьма, что бы выглядить \"крутым и успешным\"? Нет. Спасибо. На кой она нужна - такая \"эволюция\"?",
				"added": 1561383581
			},
			{
				"comment_id": 62,
				"body": "> [geekless](#comment_130_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): А конкретно на этом форуме, после того как владелец выставил всем лимит в 20000k, мне ничего не мешает быть счастливым. :D Пока не вылезли другие проблемы масштабируемости и устойчивости к атакам у этой технологии.\n\nПри пяти активных пользователаях данного форума, врядли это грозит. Вот будь их количество и активность, хотя бы такой, как на опеннете...",
				"added": 1561383820
			},
			{
				"comment_id": 63,
				"body": "> [geekless](#comment_135_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Это вам внушили более успешные, чтобы вы либо потребляли (если внушитесь \"этак\") на благо корпораций, либо брезговали всем этим и сидели в темном углу (внушитесь \"вон так\"), но не пытались реально конкурировать.\n\nКонкурировать за что?",
				"added": 1561383902
			},
			{
				"comment_id": 64,
				"body": "> [geekless](#comment_137_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): За власть, в частности.\n\nЧто такого особенного дает власть кроме возможности еще более разнузданного потребления?",
				"added": 1561384051
			},
			{
				"comment_id": 65,
				"body": "> [geekless](#comment_138_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Если вы других опций не видите, то вам - ничего.\n\nПотому что их - нет. Это придуманная фикция. Потребительством начинается и им же заканчивается.\n\nЕсли только... Используя власть \"сделать мир лучше\"? :-)))",
				"added": 1561384250
			},
			{
				"comment_id": 71,
				"body": "> [caryoscelus](#comment_66_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Можно стремиться следовать общепринятым рецептам достижения счастья, не разобравшись до конца с тем, что же оно всё-таки значит.\n\nСлабоватая мотивация для достижения подобного счастья: иди туда - не знаю куда, сделй то - не знаю что, причем, с неизвесным результатом.\n\n> Если каждый по-разному, то и смысла в слове нет.\n\nПочему же? Это - собирательное понятие.\n\n> Что, если один пункт из этого списка противоречит другому? Счастья нет?\n\nОно будет неполным.",
				"added": 1561386108
			},
			{
				"comment_id": 72,
				"body": "> [caryoscelus](#comment_67_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Да ладно, сколько мелких чиновников выжимают удовольствие из помыкания людьми. Власть у них есть, хоть и ограниченная, а зарплаты так себе, особенно не напотребляешься. Или те же учителя. Или, если всё же интересны примеры власти покрупнее, можно найти много исторических примеров умеренных в потреблении властолюбцев\n\nВсе же это скорее исключения из правила, для большинства власть - инструмент личного обогащения, которое предоставляет возможность заниматься потреблением.",
				"added": 1561386376
			}
		],
		"6_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 50,
				"body": "> [ultraviolet](#comment_19_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e):  Найдёте способ установить демократию в России. Я не ёрничаю.\n\nДемократия - недостижимая утопия, как коммунизм или социализм. Она всего лишь ширма для удобства легитимации узурпированной у народа власти.",
				"added": 1561331583
			},
			{
				"comment_id": 51,
				"body": "> [ultraviolet](#comment_6_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Это не так. Демократия один из видов политического устройства общества.  Очень хороша тем, что при прочих равных устройствах позволяет учитывать интересы гораздо большего количества членов общества чем недемократические формы политического устройства того же общества.\n\nОна в первую очередь учитывает интересы властной элиты, которая спланированными манипуляциями, возможными благодаря мощному финансовому ресурсу, формируетет так называемое \"общественное мнение\", выгодное для себя. При этом создается видимость \"учета интересов большинства\", потому что, как раз такое виденье было целью направленной фабрикации.",
				"added": 1561332537
			},
			{
				"comment_id": 58,
				"body": "> [ultraviolet](#comment_21_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Это одна из мифилогем \"патриотической общественности\" в России. Если бы демократия, например в США была бы сугубо фейком то не было бы там ни аболиционисткого движения, ни постоянной борьбы за те или иные вопросы свободы и права, например Циммерман не стал бы распространять свои алгоритмы.\n> Вы путаете иллюзорную \"управляемую демократию\" в стиле современной России и демократию вообще.\n> Я понимаю психологические основы этой мифологии. Трудно себе признаться что есть люди живущие более свободно.ЗЫ Кстати США в плане социальных прав далеко не в переди планеты всей\n\nДемократия - не фейк, но ее реальное влияние сильно преувеличино, превращено в догму, которой любят размахивать, как флагом. В современной России нет даже \"управляемой демократии\" в ней в лучшем случае - \"олигархический феодализм\".\n\nЧто в вашем понимании: \"жить более или менее свободно\"? В чем заключается конкретное проявление этой свободы в условиях массы ограничений, включая, как законодательные, так и общественные?",
				"added": 1561380718
			},
			{
				"comment_id": 59,
				"body": "> [ultraviolet](#comment_22_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): съездите в США или хотя бы в Финляндию в период выборов в местный совет. Возмите небольшой городок и понаблюдайте как выбирают мера или городской совет. Потом сравните с выборами в аналогичном городе в России.\n> Знаю тяжело признаться себе, что точно такие же люди добились гораздо большего уважения к себе и учёта своих интересов.Но лучше горькая правда.\n\nКак можно сравнивать выборы с голосованием?\n\nДа, люди добились большего уважения к себе, но они по прежнему ни чего не решают, не имеют слова и веса, им разрешают вмешиваться только в какие-нибудь несущественныек локальные вопросы в своей деревне, на этом демократия заканчивается. Да можете идти маршем и выступать на площадях, только для людей реально решающих вопросы на государсвенном уровни, эти выспупления воспринимаются, как анекдот про гей-парад. Сколько уже Желтые Жилеты буянят, а что толку?",
				"added": 1561381377
			},
			{
				"comment_id": 60,
				"body": "> [geekless](#comment_125_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Меньшего, чем если бы РИ нормально эволюционировала в национально-буржуазное государство наподобие Франции, а не этот красный уголок.\n\n\"Красный уголок\" жив до сих пор, вернее сказать - его специально созданная мифологизировнанная копия, и продолжает во всю гадить, сбивая людей с толку. Так устроена человеческая память: хорошее, яркие моменты жизни лучше запоминаются, чем неприятные. Людям хочется чем-то гордиться. Когда нет возможности гордиться настоящим, начинают излишне усердно \"избирательно вспоминать\" прошлое. Тем более в то время проходила молодость - лучшее время в жизни. Уголок продолжит гадить в мозг, пока к власти не придет поколение которе не только само не родилось в ту эпоху, но и не было рождено  воспитанно теми, кто успел застать то время в разумном возрасте.",
				"added": 1561382916
			},
			{
				"comment_id": 66,
				"body": "> [ultraviolet](#comment_26_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): В России граждане не ни на что влиять даже на уровне мунициполитета.  Неплохо было бы с чего-либо начать\n> \n> Наличие демократии не обозначает автоматическго торжества добра или воли большинства.  Демократия даёт такой шанс, но не гарантию. Правящие классы, несмотря на свою малочисленность очень организованны и могущественны, поэтому даже в условиях демократии народу следует постоянно бороться за свои интересы. Как только это борьба народа ослабивает или народ от неё отказывается, тут же его интересы приносятся в жертву интересам буржуазии.  Демократия это всего-оишь способ вести эту борьбу легальным, мирным путём. Не восстанием или террором а  в области выборов, референдумов и судебных процессов.\n\nЭто - идеализм, не имеющий ничего с окружающей реальностью. Люди, как минимум, сами должны захотеть, что бы их уважали, но они предпочитают терпеть. Их все устраивает. Для борьбы надо четко осознать ее цель, но когда она излишне абстрактна, находится совсем мало желающих за нее бороться.",
				"added": 1561384673
			},
			{
				"comment_id": 67,
				"body": "> [geekless](#comment_140_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Соглашусь.\n> Смотрю вот видео, где блоггер пришел в магазин выявлять просрочку, а его хуесосят отнюдь не продавцы — покупатели.\n> Это общество заслуживает той власти, которая его имеет.\n\nИменно. Людям приходится доказывать, что они плохо живут, с ними поступают по скотски, но они еще упираются и доказывают вам обратное: у нас все - хорошо, там у них - намного хуже. Пусть будет так, как есть, а то вдруг станет хуже...  Вот он - \"красный уголок\" в действии.",
				"added": 1561385164
			},
			{
				"comment_id": 73,
				"body": "> [geekless](#comment_141_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Экономические основания следуют из характеристик человека как экономической единицы — как он принимает решения, чем руководствуется. Поэтому пока человек то, что он есть, что-то тут фантазировать смысла нет.\n\nНе один прогрессивный строй не построится без определенного уровня самосознания каждого члена общества. У человека - животная, хищническая природа, от которой не так просто уйти, она время от времени проявляется и сильно влияет на поступки. Каждый член общества должен осознать, что в случае, если его поступки не будут направлены на благо системы, то система перестанет работать должным задуманным образом и он сам от этого в перспективе проиграет. Причем это понимание должно прийти самостоятельно, а не из страха перед наказанием за нарушение правил. Ну и разумеется сама ситема не должна провоцировать людей на нарушение или поиск лазеек и обходных путей, поощряя неравенство, несправедливость и всего прочего, способного подорвать исреннее доверие к системе.",
				"added": 1561387794
			},
			{
				"comment_id": 74,
				"body": "> [ultraviolet](#comment_40_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Вот сейчас все осознают вред например корпоративной коррупции для себя в некой далёкой перспективе?\n> Тем не менее капитализм существует и от корпоративной коррупции погибать явно не спешит.\n> Точно такая же ситуация будет и с социализмом.  Да будет большое количество сторонников коммунистических  идей.  WWIII обеспечит очень чёткое понимание многими людьми своих витальных интересов.  Но также будет и большое количество людей для кого это будет странной и непонятное реальностью.\n> Да и новые социалистические страны будут разными.\n\nСуществующие системы не вызывают к себе ни доверия ни уважения, потому что допускают приоритеты и исключения. Поэтому шиком считается, как можно ловчее обойти их правила с целью получения конкурентного преимущества перед соперниками, которые вынуждены \"играть по правилам\".",
				"added": 1561390300
			},
			{
				"comment_id": 100,
				"body": "> [lama12](#comment_1_1FyLcbDTsBLYnEJ6rP2hD52kxH1CTgGBxz): Вместо врача собирается электорат и начинает прения по поводу того, что это и стоит ли тебя лечить, и как.\n\nА может, все таки, не будет самостоятельно лечить, а только утвердит большинством всем известного доктора, которому можно доверить лечение?",
				"added": 1562494021
			},
			{
				"comment_id": 111,
				"body": "> [lama12](#comment_2_1FyLcbDTsBLYnEJ6rP2hD52kxH1CTgGBxz): А кто будет утверждать? Те кто в медицине ничего не понимают? Может выжившие, по воле случая, а не в результате профессиональной деятельности?\n\nНаверное, исходя из статистики лечения.\n\n>Исторически демократия была - равенство граждан. Гражданином являлся человек имеющий свободу и власть. Под властью понимаю способность влиять на общество в котором он живет.\n\nСвобода и власть - очень не четкие и растяжимые понятия.\n\nСвобода в чем? У рабов тоже была полная свобода: хочешь служи хозяину, хочешь - беги, хочешь - восстань, а ничего не хочешь - покончи с собой. Жить по законам, устанавливаемыми меньшинством и терпимыми  большинством - свобода?\n\nВласть какого объема? Объявлять войну, заключать мир, утверждать налоги и бюджет или выносить приговоры - казнить, помиловать?\n\n>Любой политический строй всегда скатывается к власти сильных.\n\nА как же коммунизм?",
				"added": 1562530669
			},
			{
				"comment_id": 115,
				"body": "> [stainlessrat](#comment_13_14TFq8NmtKS3GG9briTFV874KdxJkVLhzB): Ну начинаете словесный понос.  Давате отрежим вам ноги и вы поймёте что такое свобода.  В армии служили?  Жаль что нет. Нет я не поклонник идеи что армия \"делает мужиком\", но власть там даже у сержанта или ротного старшины не абстракция а суровая реальность.\n\nЯ спросил: что такое свобода и власть, а вы начали про понос, аримю и ноги.\n\nСвобода - пустой звук, человек, как живое существо не может быть свободным, потому что, как минимум зависит от своего тела - вынужден его содержать: кормить, предоставлять отдых, одевать, лечить, обеспечивать условия проживания. К тому же человек живет не один в глухой тайге, в обществе, с которым приходится взаимодействовать, опять же не по своей свободной воле, а по жизненной необходимости, которая наклавдывает еще больше ограничений, чем физиология. В результате от свободы остается - пшик, пустое место. Тот, кто рассказывает про свободу - либо лицемерный демагог, либо инфантильный мечтатель, оторванный от реальности.\n\nВы предлагаете отрезать ноги, а сами попробуйте прожить без еды на улице хотя бы три дня и ощутете в полной мере, что такое \"свобода\".\n\nВласть не может быть у всех в равной мере, точно также, как не может быть одинаковым благостояние - это утопия. Обязательно произойдет ее перераспределение - от слабых, глупых, безвольных, ленивых к сильным, наглым, волевым и деятельным.",
				"added": 1562606216
			},
			{
				"comment_id": 117,
				"body": "> [stainlessrat](#comment_14_14TFq8NmtKS3GG9briTFV874KdxJkVLhzB): Если бы физики рассуждали также как вы то они сказали бы что нет законов термодинамики потому что нет идеального газа.  \n> Законов гидродинамики тоже они не нашли бы.  Идеальной жидкости в природе нет\n> И с механникой были бы проблемы, потому что нет идеально твёрого тела\n> По счастью нормальные люди живут в реальностиа не в вымышленных мирах, используя последнии только как удобные модели\n\nВы так и не объяснили - что конкретно понимать под определениями: \"свобода\" и \"власть\"...\n\nЯ лично под \"свободой\" понимаю: \"отсутствие принуждения в любом виде к совершению каких-либо действий, которые я не желаю делать по доброй воле\".\n\nПод \"властью\": \"наличие возможности принуждать других к совершению некоторых действий, которые они не желают совершать самостоятельно по доброй воле\".",
				"added": 1562678468
			},
			{
				"comment_id": 193,
				"body": "> [ultraviolet](#comment_93_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Причины отрицания демократии психологически понятны. Тяжело признаться себе что твоя страна обычный бантустан из3-го мира управляемый диктатором.Обидно.\n\nДиктаторы с неба не падают... Сама возможность прихода диктатора к власти означает, что большинство населения не возражает против диктаторских методов управления в стране и внешней политике. Каждый народ заслуживает своего правителя.",
				"added": 1565042657
			},
			{
				"comment_id": 194,
				"body": "> [ultraviolet](#comment_96_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Вот тут вы не правы.\n> Причины приводящие к той или иной политической организации общества кроются в экономики и практически никак не управляются народом.\n> Увы но законы управляющие общественными явлениями столь же строги как и законы физики.\n\nДа что же такое надо сделать с экономикой своей страны, что бы людям захотелось стать терпеливыми рабами, да еще искренне любящего своего диктатора, который измывается со своей кликой над ними?",
				"added": 1565045056
			},
			{
				"comment_id": 195,
				"body": "> [ultraviolet](#comment_97_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Вы употребляете очень много оценочных суждений. И весьма зря называете соотечественников (?) рабами - это и неправильное использование строго термина и просто глупая гордыня.\n\nА как еще называть людей имеющих рабское мировозрение, как не рабами? Стоит различать причины и следствия. Причина  - кроется в головах, а уже потом от туда переносится на быт, эконмику, политику и все остальное.",
				"added": 1565047093
			},
			{
				"comment_id": 196,
				"body": "> [ultraviolet](#comment_98_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): 1) Первична именно экономика.  Все остальные сферы человеческой жизни подчиненны именно ей.\n> 2) Вы безосновательно делате оценочное и нечёткое утверждение.  Раб - крайне точный юридический и научный термин.Вольное употребление точных терминов ведёт к неверным выводам.\n\nТогда как называть таких людей? Подскажите, пожалуйста, научно правильный термин.",
				"added": 1565047632
			},
			{
				"comment_id": 197,
				"body": "> [ultraviolet](#comment_99_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Просто люди.\n> Они ничем не хуже вас.  Помести вас в провинциальный моногород без возможности выбраться от туда (представьте у вас нет диплома, вы например моляр, что кстати неплохо + жена + пара детей + престарелые родители + ипотека)  и вы с удивлением обнаружите скоро, что вас намного сильнее интересует вопрос где взять деньги чтобы отправить сына в школы чем вопрос сколько же будет ещё править Россией старый ботоксный тиран:-)\n\nПричем \"маляром с ипотекой без диплома и с детьми\" я был с самого своего рождения и не допускал мысли, что можно строить свою жизнь как-то по другому.\n\n\"Просто люди\", когда их садят на черенок от лопаты - сопротивляются, а не пытаются прикинуть необходимое количество смазки для смягчения процесса, заведомо приняв неизбежность его вставления, терпя и приспосабливаясь к \"новым ощущениям\", убеждая себя, что \"так надо для моего блага\".",
				"added": 1565049816
			},
			{
				"comment_id": 198,
				"body": "> [ultraviolet](#comment_100_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Вполне возможно что у мечты о другой жизни были бы, но вот сил осуществить их - нет\n> \n> Не всегда и не везде.  Прямо сейчас идёт забастовка крановщиков в Казани.  Это не первая и не самая многочисленная забастовка в истории постсоветской России.  Были забастовки в тысячи человек.В либеральных СМИ о них пишут намного меньше чем про митинги в Москве.В официальных СМИ не напишут никогда.\n\nТысяча, которую \"реально приперло\" и которой \"нечего терять\", поэтому она отважилась пойти на перекор системе, не способна изметить мировозрение миллионов, на согласии и покорности которых держиться диктатура. У остальных то пока \"все хорошо\", согласно их мнению, причем хорошо настолько, что нет смысла самим против чего-то протестовать.\n\n> О множестве забастовок и даже беспорядков мы узнаём после того как всё завершилось. Например зимой была забастовка на рудниках на Камчатке.  Недавно была голодовка (плохой метод - не советую так делать) на хлебном заводе недалеко от Москвы.  Были бунты в тюрьмах, о них мы узнаём часто через месяцы.\n> Подавляются выступления \"простых людей\" намного жёстче чем московские митинги.\n\nНо почему-то на очердном \"голосовании\" большинство галочек ставится в пользу диктатуры. Протестуют тысячи и десятки тысяч, а галочки ставят миллионы.\n\n> В Казахстане была зверски изнасилована и убита дочь профсоюзного активиста.  Во время беспорядков в Жанаозене убито множество людей. Мы даже не знаем сколько точно.  Казахстанская ГБ просто охотилась  и жестоко расправлялась со всеми кто пытался рассказать о произошедшем журналистам.Профсоюзных активистов там просто пересажали в тюрьмы\n> В Омске на профсоюзных активистов натравили бандитов. Активистам угрожали убийством детей.\n> То что Вы не слышали про эти события ещё не значит что их не было.\n\nДаже если бы и слышали, то большинство лишь \"немного посочувствует\", да и благополучно забудет, вернувшись к своим делам, которые для них куда важнее (ипотека, дети, престарелые родители) чем какие-то активисты в тюрьмах, и на очердном \"голосовании\" покорно продолжит ставить галочки, как и раньше боясь \"как бы не ушла стабильность и не стало еще хуже\".",
				"added": 1565077132
			},
			{
				"comment_id": 199,
				"body": "> [ultraviolet](#comment_101_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): бастуют (притом успешно) совершенно не те кому \"нечего терять\".\n> Результаты голосования почти по всей стране подделываются в больших маштабах. По этому вопросу есть  хорошие статистические исследования, даже статьи на habr.com.\n\nПодделать можно 10-15%, но ни как не 50% или более.\n\n>Если бы выборы в Думу были подсчитаны честно, то ведущей фракцией там была бы КПРФ (возможно народ и в ней бы разочаровался, но это отдельный вопрос)\n> Кроме того на выборы допускают только безопасных для власти кандидатов.  Пример - того же Навального не допустили на выборы президента в 2018-ом году.  Хотя казалось бы его шансы были очень малы, но решили и их не давать\n\nИдти и потрить бюллетени, коль нет кандидата или пункта \"проив всех\", что бы узурпаторы не могли бахвалится на каждом углу о своей \"легитимности\" и \"народном выборе\". Не пришел - значит - поддержал режим.\n\n> Эти дела действительно намного важнее политики.  Люди не должны жить ради политики.Наоборот - политики (по крайней мере левые) должны работать для людей\n\nНе надо ради нее жить - надо хотя бы иметь порядок в голове - уметь отличать правду от лжи, видеть манипулирование и оценивать последствия от своего действия или бездействия - освободившись от всего, что составляет основу рабского мировоззрения. Только тогда политика не ударит в спину в \"самый неожиданный\" момент.\n\n> И поэтому нужна хорошая многочисленная оргнизация, которое ко всему прочему не забывает о своих членах оказавшихся в тюрьмах,  помогает им.\n\nДа кто же наверху допустит прямую угрозу своей власти?",
				"added": 1565092755
			},
			{
				"comment_id": 200,
				"body": "> [fant](#comment_18_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): Да ладно!? Посмотрите на кавказкие \"республики\".\n\nТам не подделывают, там \"весьма убедительно просят\" \"проявлять сознательность\", точно так же, как личный состав в армии и внутренних войсках.\n \n> Испорченные бюллетени \"размазывают\" по всем прошедшим в процентном соотношении. Бессмысленная тактика.\n\nКак \"размыть\", если будет половина, или хотя бы треть испорченных бюллетеней от общего количества проголосовавших?\n\n> Единственная нормальная сейчас тактика - протестное голосование.\n\nЗа дядю, который _гарантированно_ лоялен к власти, раз его не побоялись допустить к \"выборам\", внеся в список голосования?",
				"added": 1565094266
			},
			{
				"comment_id": 202,
				"body": "> [caryoscelus](#comment_116_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Кстати, интересно почему до сих пор никто не ответил ТСу? Ведь решение очевидно: запретить диктанты в школах\n\nИ тогда сразу настанет полная демократия...",
				"added": 1565189973
			},
			{
				"comment_id": 213,
				"body": "> [freemurzik](#comment_5_1Hf1J4EgxwcaRqhrbLgSNZxeH2jfxa741C): Ви хотя-бы можете определить диктатура какой идеологии у вас установлена?\n\nДиктатура школьных диктантов, как указано в топике.",
				"added": 1566496587
			}
		],
		"2_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 68,
				"body": "Что-то название не очень приличное...",
				"added": 1561385558
			},
			{
				"comment_id": 69,
				"body": "На английский манер не совсем благозвучно.",
				"added": 1561385684
			},
			{
				"comment_id": 70,
				"body": "> [ultraviolet](#comment_33_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): У меня проблема с загрузкой PDF файлов.  Есть какой-либо способ их удобной загрузки в ZeroNet?\n\nСоздать сайт из одной индексной страницы и разместить на ней ссылки на файлы, которые сделать опциональными. Или воспользоваться сервисом раздачи файлов.",
				"added": 1561385829
			}
		],
		"3_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 75,
				"body": "Может все намного проще... Немедленно удалить аккаунт если он имеется, и не создавть новый, если его нет, послав сеть, которая стучит на своих пользователей куда подальше.\n\n>Удаляйте ВСЕ посты из vk.com\n\nКак образом их удалить из бакапа, который наверняка ведятся, и скорее всего, будет хараниться на протяжении нескольких лет?",
				"added": 1561487445
			},
			{
				"comment_id": 135,
				"body": "> [xcfr](#comment_9_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ): постить нужно с левых симок левая симка серый телефон или модем запостил выбросил\n\nРади чего такие сложности?",
				"added": 1563388211
			},
			{
				"comment_id": 141,
				"body": "> [ultraviolet](#comment_74_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Благодарю.  Почитал Wire выглядит весьма неплохим решением.  \n\nПочитайте лицензию, которая обязывает не вмешиваться в механизмы взаимодействия с серверами разработчиков: \n\n>You agree not to change the way the Open Source App connects and interacts with our servers\n\nЗвучит подозрительно... Такое условие в \"свободном проекте\" может понадобиться разве что для слежки за пользователями со стороны разработчиков сети.",
				"added": 1564329739
			}
		],
		"7_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 76,
				"body": "Предлагаю рассмотреть возможный сценарий:\n\n1. Тов. майор создает зайт с экстремистким содержанием.\n2. Добавляет туда фейковые посты от имени пользователя против которого захочет сфабриковать дело.\n3. Предоставляет этот зайт в качестве доказательства проивоправных действий указанного пользователя.",
				"added": 1561488526
			},
			{
				"comment_id": 77,
				"body": "> [geekless](#comment_150_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Идея не идиотская на самом деле. В моих далеких планах реализация возможности подписывать отдельные ветки внутри JSON прямо средствами движка форума. Каждая сущность (\"комментарий\", \"топик\") будет иметь подпись, которая \"слетает\" при вмешательстве админа. Ядро не дает API для этого, нужно будет запилить плагин. Пока идёт миграция на 3-й питон, нет смысла браться за плагин, но после стабилизации кодовой базы можно попробовать.\n> Ну и подписывание сообщений в явном виде, как в обычном email, тоже никто не отменял. :)\n\nХорошая идея. Только при использовании подписи в случае хищения приватного ключа у нерадивого пользователя возникнет еще больше проблем, учитывая то, что отозвать подпись будет невозможно и уже ничего не докажешь, если злоумышленник захочет что-либо опубликовать используя вашу подпись.",
				"added": 1561489426
			},
			{
				"comment_id": 78,
				"body": "> [geekless](#comment_155_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Не настолько тривиально. Сначала нужно заманить пользователя на реальный зайт, чтобы он там что-нибудь писал, потом незаметно исправить часть его постов, дождаться, когда он, не заметив подвоха, напишет что-то еще, поставив тем самым корректную подпись - и вот тогда заводить дело.\n\nКогда отправляешь сообщение, его текст добавляется к `data/users/<user_id>/data.json`. после чего его изменившейся хеш подписывается в `data/users/<user_id>/content.json`. При этом нет возможности определить было ли добавленно одно сообщение или несколько. Или часть из них была изменена.\n\nТолько остается непонятным: каким образом фейковые сообщения смогут попасть на диск пользователя (для того, что бы быть подписанными вместе с новым сообщением), перед отправкой нового сообщения?",
				"added": 1561491252
			},
			{
				"comment_id": 80,
				"body": "А что если каждый пользователь будет хранить все свои сообщения на своем специальном техническом зайте? Другие пользователи, которые захотят видеть его сообщения должны просто загрузить его себе, как хаб.",
				"added": 1561569976
			},
			{
				"comment_id": 81,
				"body": "> [geekless](#comment_156_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Владелец сайта подписывает data/users/<user_id>/content.json своим корневым ключём, и апдейт расходится по узлам обычным образом, попадая на машину к владельцу <user_id>. Пользователь, не замечая подвоха, лайкает пост или пишет коммент, и voi-la, в следующем апдейте подложные данные уже оказываются подписаны пользователем.\n\nДействительно, так и произойдет. Такое поведение совсем не очевидно.",
				"added": 1561570162
			},
			{
				"comment_id": 82,
				"body": "> [geekless](#comment_168_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Хочу именно к такой архитектуре прийти, ковыряя потихоньку код ZeroTalk.\n\nИнтересно: почему разрабы сразу так не сделали? При таком подходе - огромный профит: никто не сумеет изменить сообщения или распространять фейки; сообщения флудера, спамера просто удаляются вместе с его зайтом; не будут действовать ограничения на объем сообщений, а в случее аномально большого объма такой зайт не будет грузиться, уперевшись в ограничений 10Мб, которое требуется в ручную увеличивать.\n\nСкорее всего, здесь причина в \"интерфейсном\" неудобстве добавления большого количества пользователей, когда их десятки или даже сотни на старых форумах. Хотя с точки зрения их хранения - разницы фактически нет никакой: теже самые данные вместо директории `<zite_id>/data/users/` будет находиться в корневой директории вместе с обычными зайтами.",
				"added": 1561571183
			},
			{
				"comment_id": 83,
				"body": "> [geekless](#comment_170_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): (Тем временем, я на ZT++ запилил таки фикс надоедливого бага с неправильным позиционированиепм stickied топиков. Уже нет сил даже себе в блог заметку кинуть на этот счёт, пойду лучше посплю. X-) )\n\nЗамечал этот баг, но не придавал внимания.",
				"added": 1561575886
			},
			{
				"comment_id": 92,
				"body": "> [trooper](#comment_18_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe): а вот если сделать заново все с нуля, как бы вы сделали?\n\nМогу высказать общие мысли.\n\nЯ бы представил все атомарные сетевые сущности - объекты, в виде древовидной структуры, которая отражала их взаимные зависимости, но при этом сами объекты были абстрагированы от формы их представления и хранения - могли запрашиваться и сохраняться разными способами, в зависимости от удобства: в отдельном файле, в общем файле, в базе данных. Корневым объектом для пользовательких данных выступал идентификатор - публичный ключ, при помощи которго проверяется валидность всех подчиненых ему объектов.\n\nПример: у пользователя есть картинка. Для того, что бы сделать ее доступной в сети через корневой идентификатор (а терминах ZN - идентификатора зайта), необходимо представить ее, в виде подчиненного объекта, привязанному к корневому, это возможно посредством атрибутов, которые имеет каждый сетевой объект: уникальный среди объектов дерева идентификатор, время последнего изменения, идентификатор вышестоящего в иерархии объекта (в данном примере - корневого) и подпись, по которой каждый участник сети, загрузивший объект, может проверить валидность данного объекта, используя публичный ключ. При создании объект изначально располагается на узле его создателя и становится доступным по его сетевому адресу: id_пользователя/id_объекта.\n\nВ качестве дополнительных атрибутов объекта можно задать возможность создавать подчиненные объеты и список пользователей с правами их создания.\n\nПри изменениии данных объекта его id не меняется, а только атрибуты - дата изменения, которая в сочитании с подписью служит номером версии объекта. \n\nЕсли другой пользователь захочет добавить комметарий к картинке, то он должен создать объект - текст комментария, указав в качестве идентификатора  вышестоящего объекта - сетевую ссылку на объект картинки: id пользователя расшарившего картинку и id объекта картинки.\n\nИнформация об объектах и список нод их содержащих с адресами транспортной сети и последнем временим доступности хранится на каждом узле и актуализируется путем синхронизации.\n\nИнформация о появлении новых объектов (или изменении существующих) распростаняются анонсами, при получении которых ноды производят синхронизацию интересующих их изменений на которые они \"подписаны\". Например, если я скачал тред форума, то \"подписываюсь\" на синхронизацию всех сообщений, которые будут в него добавлены, до тех пор пока я удалю корневой для треда объект - первое сообщение треда.\n\nКаждый пользователь может удалить из локального хранилища все объекты определенного узла (пользователя) и настроить запрет на дальнейшию их синхронизацию.",
				"added": 1561990946
			}
		],
		"8_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 84,
				"body": "Не понимаю позицию таких людей, как автор заметки на Хабре. Зачем плакаться и жаловаться по поводу \"работы на дядю\", если изначально знаешь - на что подписываешся. Сайт, на котором ты создаешь контент - не твой, и имеет свои правила, которые могут измениться в любой момент, по воле его хозяина, без какого-либо согласования с его пользователями. Как будто сам Хабр работает по другому, и автора не смогут забанить на нем.\n\nДействительно свободное выражение мыслей не должно зависить: не от воли другого человека или от группы людей, не от законов отдельно взятого государства не от определенной технологии и демократия здесь абсолютно не причем.\n\nДемократия - представление воли большинства, которое всегда найдет методы затыкать рты всем, имеющим мнение отличающегося от общего, в результате происходит навязывание этого общего мнение всем, желающим быть членом сообщества. Но хуже другое - член сообщества, дорожащий своим членством, начинает подсознательно подстраиваться под большинство, ограничивая и сдерживая свою индивидуальность,  не желая вызвать конфликт, озвучиванием собственного мнения. Свобода - противоречит демократии, а демократия дает лишь компромиссную имитацию свободы.\n\n>Вы можете создать сайт, который не ограничит регистратор домена, хостинг или кто-то еще.\n\nЧто в полной мере компенсируется тем, что его смогут увидить ровно пять человек. (Простите, не удержался от сарказма, слишком пафосно звучало :-)\n\n>Если у вас нет реальной власти, у вас нет никаких реальных прав.\n\nЕсли она будет у вас, то вы пойдете на все, что бы у других не было власти для того, чтобы лишить вас вашей собственной.",
				"added": 1561745641
			}
		],
		"1_18Pv6KgZ4tNPHBLMxtDZbH7j4Hi6rpwEvP": [
			{
				"comment_id": 85,
				"body": ">Если наши перестанут делать озвучку под аниме считайте аниме больше не будет выходить, а на японском слушать такое себе.\n\nНе знаю, как сейчас обстоит дело с рудабом, но на момент когда я только начал смотреть аниме (чуть более десяти лет назад) любительский даб, в большинстве случаев, был просто ужасающим, монотонным,  наполовину разборчивым чтением сабов, что вселяло уныние и полностью портило впечатление от просмотра, поэтому с той поры смотрю исключительно с сабами.\n\nСуть в другом: любой даб убивает оригинальную озвучку - художестенную игру сею, без которой аниме перестает быть аниме, к тому же даже для профессиональных актеров является сложной задачей не просто четко и выразительно читать текст, а \"передавать, играть образ персонажа\", что в бюджетной (или тем более - свободной любительской) озвучке никто и никогда  делать не будет. В третьих (относиться в том числе к русабу) - посредственное качество перевода, которое обычно производится с ансаба, то есть без выверки с японским оригиналом будет содержать неточности или даже грубые смысловые ошибки, если переводчик плохо владеет соответсвующей тематикой, что становится заметно на слух при достаточно долгом просмотре и овледении базовой лексикой. Кроме того, просмотр с сабом, позволит осавивать язык оригинала.\n\nМногих может не устраивать и напрягать неудобное чтение (чему иногда сильно спсобствуют сами саберы)  сабов: неудобное расположение, размер, шрифт и цвет. Для себя я всегда преобразую сабы к единому виду: шрифт, положение, цвет, что можно сделать средствами программы-плейера (или - в запущенном варианте - скриптом).\n\nЧерез небольшое время  практики чтение будет происходить совершенно незаметно, а в дальнейшем сабы вообще станут все чаще использоваться для референса при сложных разговорных оборотах и более точного пониманиия малознакомой тематики.\n\nP.S. Даже если не будет рудаба и даже русаба - останется ансаб, и конечно же оригинальная озвучка - будет всегда. Нравится аниме - учите язык.",
				"added": 1561813628
			},
			{
				"comment_id": 86,
				"body": "> [ultraviolet](#comment_63_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Увы рунет и русская культура в целом от блокировок и цензуры умирает.  Помните был такой сайт Луркмуар?   По сути он объединял русскоязыную культуру рунета. Теперь он заморожен.\n\nНе хочет народ идти в даркнеты. Влом ему лишнюю софтину поставить. Знать, настолько \"сильная\" тяга к объединению. Мало кто даже заметил саму проблему: есть - хорошо, нет - перебъемся.",
				"added": 1561817589
			},
			{
				"comment_id": 88,
				"body": ">Мосгорсуд одобрил блокировку крупных аниме-порталов\n>https://roskomsvoboda.org/47118/\n\nТак это же говнорекламные онлайн смотрелки. Торренты - наше все.",
				"added": 1561821446
			},
			{
				"comment_id": 91,
				"body": "> [anonymouslogin](#comment_24_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Подавляющее большинство пользователей, которые смотрят \"что дадут\" онгоинги с рудабом - являются основной аудиторией таких сайтов. И это ещё хорошие примеры, многие умудряются смотреть через майнер с торренто-качалкой внутри и рекламой гемблинга. Даже при понимании этого, они не готовы отказаться от такого ****.\n\nЗато - \"в один клик\". Решающее обстоятельство для их типичного представителя.\n\n>Но есть и оправдание - прогрессирующее посредственное отношение или наше любимое \"и так сойдёт\", где-то (хабр?) даже статья была по этому поводу, с пунктами \"за\" и \"против\". Из серии: \"Если раньше, чтоб пользоваться ПК вам требовалось знание СИ, то сейчас достаточно нажать кнопку включения\", там ещё были примеры с автопром.\n\nКак раз по этой причине я с изрядной долей скептицизма отношусь к возможности \"взлета\" сетей, подобных ZN. Если для большинства представителей \"поколения уютного ютубчика\" даже пользование торрентами представляет собой целый \"рокет саинс\", то что говорить про \"более сложные\" приложения, которые требуется не просто скачать, но еще \"правильно настроить и научиться пользоваться\".",
				"added": 1561831776
			},
			{
				"comment_id": 164,
				"body": "> [gothic](#comment_2_1K3ngPFJzpGVrvTy2XXiat1L21em5JNfiL): Лес горит, а тебя беспокоят японские порно  мультики\n\nЛюди гибнут тысячями в ДТП, а тебя беспокоит горящий лес.",
				"added": 1564838217
			},
			{
				"comment_id": 166,
				"body": "> [caryoscelus](#comment_102_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Люди гибнут тысячами от голода, а тебя беспокоят ДТП\n\nГрядет глобальное изменение климата, от которого погибнут миллионы, а тебя беспокоят тысячи, гибнущие от голода.",
				"added": 1564850827
			},
			{
				"comment_id": 175,
				"body": "> [caryoscelus](#comment_103_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Грядёт тепловая смерть вселенной, а вас тут всех в треде беспокоят какие-то люди\n\nЭто надо было сказать на следующей итерации. Сейчас должна идти реплика про \"Солнце, которое погаснет\"...",
				"added": 1564868174
			},
			{
				"comment_id": 177,
				"body": "> [caryoscelus](#comment_105_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Тогда уж не погаснет, а превратится в красного гиганта и испортит и так сомнительный климат окончательно (если конечно со времён моего изучения этих процессов научная т.з. не изменилась..)\n\nСначало оно начнет расширятся где-то до размеров орбиты земли, а потом сжиматься в карлик, если не ошибаюсь.\n\n> Проблема только в том, что на это можно было бы ответить, что ч-во к тому времени расселится по галактике или хотя бы просто свалит на большом \"ковчеге\". А если этого не сделает, то скорее всего самовыпилится до этого\n\n100% самовыпилятся, здесь и обсуждать особо нечего, настолько все очевидно.\n\n> А если жалко само солнце, то да, конечно. Но это по-моему более сомнительно, чем беспокоиться о китайских порномультиках или вселенной\n\nКитайские мультики - это одно из видов зрелищ, которое идет в дополнение к хлебу. Леса горят \"где-то там\" и \"Солнце гаснет\" не быстро, а мультиков хочется здесь и сейчас...",
				"added": 1564870081
			},
			{
				"comment_id": 188,
				"body": "> [anonymouslogin](#comment_29_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Подскажите название, не получается найти этот китайский мультик.\n\nЕсли вы про уровень бредовости и бессмысленности последних постов, то большая половина мультиков выполнена в том же духе, а то и хуже... Тыкните первый попавшийся, почти наверняка попадете.",
				"added": 1564924355
			},
			{
				"comment_id": 214,
				"body": "> [cucuntizk](#comment_1_17DqqFBEDJJL38FtkJuxEP6bBZfk4tBLCH): Тем лучше, фандаб всегда был и оставался говном, которое делали пидорасы без знаний и навыков.\n\nЕще он дополнительное место на диске занимает, когда аудио дорога (иногда - несколько) с дабом идет в контейнере.",
				"added": 1566497166
			},
			{
				"comment_id": 223,
				"body": "> [vafler](#comment_6_17QiJ3NPDqUtp9tK2gNJK5AkBEhR5xSoM6): НУЖНО РАЗВИВАТЬ ДЕЦЕНТРАЛИЗАЦИЮ тогда блокировки для государства станут охено дорогим удовольствием они опустят руки и все станет как прежде\n\nКакое наивное суждение... Государство примет закон, согласно которому будет запрещено использование p2p. И обяжут операторов для его исполнения ослеживать подозрительный трафик и стучать кому следует. Вместе с законом в СМИ будет запущена пропагандиская кампания под лозунгом: \"используешь p2p - помогаешь  хакерам, террористам, шпионам, педофилам...\"\n\nПосле нескольких громких показательных дел, желающих  \"РАЗВИВАТЬ ДЕЦЕНТРАЛИЗАЦИЮ\", ценой административки и уголовки, станет равным нулю.\n\nПравда и сейчас, без всяких законов и ограничений желающих особо не наблюдается... Поэтому есть шанс, что государство не захочет трогать жалкую кучку маргиналов, играющих в свободу, и будеть что-то специально блокировать или принимать законы, стреляя из пушки по воробъям...",
				"added": 1570326532
			},
			{
				"comment_id": 225,
				"body": "> [syntia](#comment_78_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM): Если этот изуверский скандал выйдет на международный уровень - не думаю, что они так легко  отбелятся.\n\nКому дело до того, что происходит в стране третьего мира? Даже если полность вырубят Интернет, или сделают его по паспорту, всем плевать будет: у чужих - свои проблемы, а свои, как всегда - будут послушно терпеть.",
				"added": 1570391848
			}
		],
		"4_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": [
			{
				"comment_id": 87,
				"body": "1. Сложность адаптации существующего контента к требованиям сети. Сеть только для новых проектов.\n2. Отсутствие смысла  затрачивать силы ради адаптации контента, его дальнейшго обновления и поддерживания, при условии отсутсвия пользователей в сети. Склоняюсь к мнению, что в будущем их будет не намного больше, если технология так и не \"выстрелила\" за 4 года своего существования.\n3. Отсутсвие желания ковыряться с JS и изучать API, что придется делать, как следствие п.1. и п.2.\n4. Невозможность полного контроля раздачи контента: раздаешь все содержимое зайта, помеченное как обязательное при подписи (например, сообщени всех пользователей форума с момента его создания) или вообще ничего - удаляешь зайт.\n5. Оверинженеринг с целью унификации: \"все есть зайт\", даже в случаях когда это не требуется.\n6. Отсутсвие уникального для ZN контента, которго нет в клирнете и даркнете, как следствие замнкнутого круга: нет пользователй, потому что нет контента, потому что нет пользователей его создающих.\n7. Совершенно бесполезная и неудобная морда: неюзабельный сайдбар, бесполезная статистистика, особенно - карта мира с учетом использования Tor-прокси и непонятная диаграмма, полностью неудобное отображение загруженных файлов и интерфейс удаления опциональных.\n\nИз плюсов:\n1. Этот демонстрационный макет как-то работает.",
				"added": 1561820572
			},
			{
				"comment_id": 89,
				"body": "> [geekless](#comment_178_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): o_O\n> Уникальное понимание слова оверинженеринг.\n\nДля случая, когда требуется только транспорт, например, для расшаривания файла - это явный оверинженеринг.",
				"added": 1561821931
			}
		],
		"6_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 90,
				"body": "> [gitcenter](#comment_8_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Скорее взбесило то, что юзеры постоянно чего-то требуют, мол -- раз open source, то давай работай, при этом не вникая, что никто никому ничего не обязан.\n\nКакая же это драма? Сильно сказано. Скорее, обычное положение вещей.",
				"added": 1561822256
			}
		],
		"1_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": [
			{
				"comment_id": 93,
				"body": "> [geekless](#comment_181_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Сидировать mp3 не буду, т.к. аудиокнигами не интересуюсь\n\nАналогично. Всегда нравился текст. Но наверняка, найдутся любители аудио. \n\n>Тут часто говорят \"Нужен контент\". Я принес. Вы тоже несите.\n\nНовый контент для ZN это - событие, тем более для русскоязычной его части.",
				"added": 1561996284
			}
		],
		"1_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 94,
				"body": "Какова позиция @nofish по данному вопрсу?",
				"added": 1562007099
			},
			{
				"comment_id": 97,
				"body": "> [pizdahd](#comment_1_14CEhTncVyUDVGxaFD9PEv2YqdF6xe6oCV):  Как можно дать права потребителям которые нехуя не делают а только пользуются.\n\nСофт предназначен исключительно для его разработчиков, пользователи - паразитируют на чужом труде, поэтому ненужны... Теперь понятно почему здесь \"три калеки по большим праздникам\" - видать идет постоянная целенаправленная борьба с паразитами.",
				"added": 1562328880
			},
			{
				"comment_id": 110,
				"body": "> [technol0g](#comment_2_1Mm1ztyaX85grxg2uu8KUWa8MiJi1dG2GK): да ничего не остановится, просто форк основного репа и погнали дальше\n\nСделать форк - дело не хитрое. А что потом? У кого хватит упорства его поддерживать, хотя бы для обеспечения совместимости, когда расхождения станут значительными? Я промолчу про новые фитчи, которые тоже могут оказаться в будущем несовместимыми.",
				"added": 1562529021
			},
			{
				"comment_id": 112,
				"body": "> [geekless](#comment_223_1GooUE19488nDwG3TdkM8seYAHct4gjkq4):  В нашем случае это тупиковый путь, разработчиков не хватает даже для разработки на нетипизированном питоне. Ну значит вот так нужна людям подобная сеть... Может и правда, бросить всё и пойти бухать?\n\nКлючевая мысль: ради чего? Если только для прокачки своих личных питоновских и JSсовских скилов... Из пользователей такая сеть нужна единицам. \n \n> Не понял, относятся эти слова к ZeroNet или к гипотетической другой сети. Если к ZeroNet, то дублирование контента не баг, а фича. В сети, состоящей из недоверенных узлов, невозможно выяснить, сколько копий хранится. Балансировщик приведет к тому, что можно запустить 10000 узлов, объявляющих о наличии контента, дождаться, пока остальные узлы перестанут его кэшировать, и одновременно выключить эти все узлы.\n\nПо идеи, все свое и самое интересное чужое надо хранить у себя. Только в таком случае возникает проблема больших файлов - как сделать их доступными не создавая многотерабайтное локальное хранилище? Самое логичное - резать на части и хранить с некоторой избыточностью по разным узлам, схема используемая во Freenet и Perfet Dark. По дугому - не получится. Только данный подход ни как не гарантирует доступность хранимого таким образом контента, а лишь возможность его однократного или периодического распространения. Если только сделать что-то гибридное - разделив контент на два типа: хранимый и одноразово распространяемый, предоставив пользователю выбирать - что должно \"вытестняться\" из хранилища, а что - нет.\n \n> Спасибо, но такого говна такой мотивации не надо. Что представляет собой сообщество крипты, уже видели. Смотрю, все \"успешные создатели стартапов\" и \"гуру пассивного заработка в интернете\" теперь ринулись заниматься криптой. Ну удачно им там сидеть дальше.\n\nЕсть уже такой проект - предоставление дискового пространства за коины - пока на вашей ноде доступен размещенный на ней контент, вам начисляется оплата.  Не помню, как называется.\n\nК сожалению из-за засилия мошенников любая идея проектов, завязанных на крипте, в современных реалиях служит своеобразным детекторм \"очередного лохоразводчески-кидального дерьмопроекта\".",
				"added": 1562576096
			},
			{
				"comment_id": 113,
				"body": "> [technol0g](#comment_3_1Mm1ztyaX85grxg2uu8KUWa8MiJi1dG2GK): Тут вы абсолютно правы! Вероятно упорства хватит лишь безумцам.Несколько месяцев разбираю код ZN, первая проблема, я не питонщик, благо нашлись альтернативные имплементации кода и это ускорило прогресс.\n\nДа еще возникает вопрос: кто будет использовать данный форк, если мейнлайном пользуются лишь пара десятков пользователей - постоянно, и максимум - сотня интересующихся?\n\n> Параллельно тестировал кандидат-технологии такие как IPFS, Webtorrent на внедрение.\n> IPFS - несмотря на крутые фичи с дедупликацией контента, разных разностей, потребляет гигабайты на серверах и весь канал\n\nIPFS - предназначена для шаринга малоизменяемых файлов - на ее базе не рационально строить систему в которой должен происходить массовый обмен короткими сообщениями.\n\n> К сожалению всё перечеркивает факт - это работает через коммерческих провайдеров-каналы, которые контролируются властями (да можно шифровать, маскировать траффик но всё уже украдено до нас..), как бы мы не старались создавать лучшие децентрализованные сети и софт, пока не будет самоорганизованной глобальной MESH-сети, всё это игры в песочнице. Но мы продолжим делать то, что делаем и надеюсь найдётся оптимальное работающее решение.\n\nСразу использовать i2p для транспорта.",
				"added": 1562577301
			},
			{
				"comment_id": 114,
				"body": "> [geekless](#comment_224_1GooUE19488nDwG3TdkM8seYAHct4gjkq4):\n> Это не решает проблему в корне, а просто перекладывает её на энтузиастов, которые хранят чужое за свой счёт.\n\nНе совсем. Таким способом можно повысить шансы доступности больших файлов. Общий объем хранилища будет равномерно делится между пирами, и что более важно - трафик также будет равномерно распределятся.\n\n> Freenet - это огромный распределённый зашифрованный кэш. В таком виде он очень нужен для повышения доступности и живучести контента. Есть у меня в планах для ZeroNet. Но как единственная форма хранения - сомнительно.\n\nТак речь идет про гибридный вариант - пир может выбирать что будет держаться в этом кеше на своей ноде постоянно, а что может вытесняться по мере обновления.",
				"added": 1562590349
			},
			{
				"comment_id": 138,
				"body": "> [mistalero](#comment_75_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Создать альтернативную версию клиента, а лучше несколько.\n\nИ кто, интересно, будет этим заниматься, учитывая столь низкую востребованность данной сети? К тому же, сетевой протокол в референсной версии может в любой момент измениться, что сделает все альтернативные клиенты неработоспособными.",
				"added": 1564090149
			},
			{
				"comment_id": 139,
				"body": "> [mistalero](#comment_76_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Кто умеет, тот и займётся.\n\nДело как раз в том, что - никому не нужно, если судить по количеству пользователей.\n\n>Это же не проприетарный софт , чтобы протокол от версии к версии менялся.С появлением альтернативных клиентов выработается некий стандарт.\n\nТопик как раз про то, что рулит стандартами один единственный человек. Форк делать никто не будет, потому что сложностей в его долговременном поддержании будет много, а пользователей, ради которого он будет сделан - мало. Отсутствует целесообразность. \n\n>Их же можно сделать ближе к народу.\n\nСеть, использующаяя принцип p2p никогда не будет \"близка к народу\", потому что: сложно, жруще, неудобно, глюкаво, имеет дурную репутацию, и главное - плохо монетизируется. p2p для тех, кто знает для чего она нужна и готов ради этого мириться с неудобствами.\n\n>Тогда и востребованность сети появится.\n\n\"Утром - деньги, вечером - стулья!\" Нет пользователей -> нет контента -> нет пользовтелей.",
				"added": 1564163392
			},
			{
				"comment_id": 142,
				"body": "> [mistalero](#comment_77_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Этому количеству нужно.\n\nТакому количеству (нескольким десяткам активных пользователей,  сотне - иногда заглядывающих и сотне - интересующихся) с избытком хватает официального клиента.\n\n> Torrent не p2p или он недостаточно близок?\n\nБлизок, но торрент протокол имеет принятый стандарт, согласно которому пишутся альтернативные клиенты, а ZN - нет, потому что им рулит не согласующий развитие комитет, а один человек, который в следующей версии может все изменить, наплевав на все альтернативы, которые превратятся в тыкву. Пока не будет стандарта, никто не будет тратить личное время на занятие ерундой.\n\n> Социальные сети в клирнете как то начинали?\n\nНе стоит сравнивать теплое с мягким. Социальные сети - коммерческие предприятия, торгующие рекламой и профильными данными своих пользователей. Создатели контента привлекаются в них возможностью монетизации их контента, а хомяки идут толпой за создателями.\n\nРасскажите, пожалуйста, каким образом (кроме доната) можно монетизировать контент в ZN или и в других подобных сетях (с анонимными аккаунтами),  позволяющие каждому пользователю создавать любое количество аккаунтов \"без регистрации и SMS\"?\n\nПока не будет предложено эффективных способов монетизации, сеть не взлетит, даже при условии, что все остальные технические аспекты не будут уступать клирнетовским социалкам с точки зрения простоты и удобства использования.",
				"added": 1564404124
			},
			{
				"comment_id": 143,
				"body": "> [mistalero](#comment_78_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Как телега монетизирует?\n\nТелега стала анонимной распределенной p2p сетью? Интересная новость. А мужики то и не знали...",
				"added": 1564444978
			},
			{
				"comment_id": 144,
				"body": "> [caryoscelus](#comment_89_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Тем не менее желающих создать альтернативный зеронет хватает (ну, большинство-то, наверное, никуда не продвинется, но тем не менее). Стандартов раньше и в вэбе не было, а браузерные войны ерундой не считались ;)\n\nБраузерные войны не велись силами энтузиастов, в свободное от основной работы время... :-) \n\nНадо учиться на чужих примерах и ошибках, а не повторять их в своем проекте.\n\n>Если альтернативным клиентом будут пользоваться, то и автору оригинала придётся считаться. И потом, и так приходится считаться с теми, кто обновляется раз в тринадцатое полнолуние\n\nЭто - в идеале, а реальность куда более жестока. Для начала некто должен изъявить желание и написать хотя бы один такой клиент, который неприменно должен чем-то превосходить референсный, что бы им хоть кто-то захотел воспользоваться...",
				"added": 1564446045
			},
			{
				"comment_id": 145,
				"body": "> [mistalero](#comment_79_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Кто это сказал?\n\nВы :-) Ответив вопросом на вопрос.\n\nМодели монетизации централизованных сетей неприменимы к распределенным, хотя бы из-за невозможности аутентификации пользователей и как следствие - сложности определения количества реальных просмотров того или иного контента из-за возможности создания любого количества аккаунтов для накрутки статистики. Поэтому я и задал вопрос: \"как монетизировать контент в распределенных сетях\"?",
				"added": 1564487285
			},
			{
				"comment_id": 146,
				"body": "> [caryoscelus](#comment_90_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Ну а если он не превзойдёт, то и смысла особо нет, так что не очень ясно, где же тут жестокость ;)\n\nЖестокость в том, что в развивающихся проектах, находящихся на стадии \"макетной обкатки концепции\", никто не будет заботится об обратной совместимости, и стабилизировать стандарты. Но при этом, подобные проекты, обычно держащиеся на энтузиазме разработчиков, могут находится на данном этапе долгими годами, так и не достигнув стабильной версии, пригодной для массового использования.",
				"added": 1564487942
			},
			{
				"comment_id": 147,
				"body": "> [caryoscelus](#comment_91_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Ну и когда в 0нет последний раз ломалась обратная совместимость?\n\nФакт того, что она не ломалась до этого, не является гарантией, что она также впредь никогда не будет ломаться.",
				"added": 1564490062
			},
			{
				"comment_id": 148,
				"body": "> [mistalero](#comment_80_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Ну хорошо, а в торрентах как хоть что то монетизируется?\n\nВ торрентах действует совершенно другая мотивационная модель. В отличии от социалок, при помощи торрентров, в подавляющем большинстве случаев, распространяется _чужой_ контент, не требующий от его распространителя затрат на его создание, даже близко сопоставимых с трудозатратами на создание своего собственного.",
				"added": 1564512354
			},
			{
				"comment_id": 149,
				"body": "> [mistalero](#comment_81_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Это верно, здесь не пиратский контент раздаётся. Но если уж так требуется найти способ монетизации, можно создать браузерную MMO. Это уже обсуждалось. Наверняка многие бы согласились в неё задонатить. Даже я... хотя вряд ли:-)\n\nВот и ответ, на вопрос: \"почему p2p сети (за исключением торрентов, которые занимают свою обособленную нишу) имеют низкую популяроность?\" Монетизация для p2p - технически сложна и нарушает анонимность, создатели контента останутся в сетях, позволяющих зарабатывать на нем или хотя бы частично отбивать затраты, хомяки будут сидеть там, где есть контент. Для p2p сетей остается ничтожная доля процента маргиналов, принципиально не желающих быть хомяками в коммерческих социалках, но создающие собственный контент сугубо по остаточному принципу (редко и мало),  на чистом энтузиазме, не имея возможности хоть как-то окупать свой труд.",
				"added": 1564521648
			},
			{
				"comment_id": 150,
				"body": "> [mistalero](#comment_82_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Где тут ответ?\n\nСложность монетизации. Нет?\n\n> Сложна, но возможна\n\nЯ уже третий раз спрашиваю: \"как монетизировать\", но вы пока что предложили один единственный вариант - через браузерную ММО игру.\n\n>а анонимность обеспечивается криптой.\n\nОб анонимности можно забыть, когда потребуется ниформация: кто чего просмитривает, сколько раз, и ограничение накруток этих просмотров. А на крипту, тем более полученную анонимным путем - колбасу в магазине не купишь.\n\n> Было бы желание, ну и способности конечно.\n\nЖелание у подавляющего способного большинства не появляется, потому что на p2p не заработать. Все держится на энузиазме.",
				"added": 1564754998
			},
			{
				"comment_id": 152,
				"body": "> [caryoscelus](#comment_94_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Ну обналичиваешь и покупаешь, если так нужна колбаса. Какие проблемы? Хотя, конечно, в некоторых странах могут и за колбасную крипту привлечь, наверное\n\nДля начала, что бы потратить крипту, ее надо от куда то взять -  купить или получить за некую услугу. Не думаю, что даже самое либеральное государство будет позволять официально обналичивать активы анонимного происхождения, не проявляя интереса к источнику их происхождения.",
				"added": 1564756424
			},
			{
				"comment_id": 153,
				"body": "> [caryoscelus](#comment_95_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Наличку кто-то по карманам шарит? Проявляет интерес к происхождению?\n\nЗависит от суммы, если покупать что-нибудь подороже колбасы. Поэтому во всех странах стараются сократить наличный оборот, что бы все траты граждан находились \"под колпаком\", оправдывая это \"удобством рассчетов\", а крипта этому пытается противодействовать, поэтому - никогда не будет в фаворе у любого государства. Пока оборот крипты по отношению к национальным валютам крайне мал, властям плевать, - никто не станет \"срелять из пушки по воробъям\", но их очень быстро \"зарегулируют\" (или тупо - запретят),  при росте оборота, что уже сделали в ряде стран.",
				"added": 1564764002
			},
			{
				"comment_id": 155,
				"body": "> [anotherneko](#comment_170_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Для многих государств демонстрация магазинчика в zn за крипту будет вполне себе легальным обоснованием ее происхождения.\n\nПо закону такое предприятие называется: \"организация схемы отмыва нелегальных доходов\". В ваш \"магизинчек\" аноны несут крипту неизвестного происхождения, а на выходе она вдруг приобретает законное происхождение... Хотел бы я себе такой волшебный \"магазинчик\"!\n\nИли вы лично будете ручаться, за каждую транзакцию перед налоговой инспекцией, что анонимные (!!!) \"покупатели\" в вашем магазинчике все до одного законопослушные граждане, тратящие честно зарабатанную крипту, а не торговцы веществами или писатели вирусов-шифровщиков?",
				"added": 1564772784
			},
			{
				"comment_id": 156,
				"body": "> [caryoscelus](#comment_96_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Любой кэшевый магазинчик так работает, в общем-то\n\nВ кешевом магазинчике каждая купюра имеет номер и при необходимости может быть прослежена.\n \n> Не знаю, что там с \"магазинчиками\" (в котором всем этим шифровщикам ещё хоть какой-то профит может быть закупаться), но что-то не доводилось слышать, чтобы всяким организациям (да и индивидулам) приходилось отвечать за то, что им донат с неправильного адреса кидали. Была бы такая практика — недоброжелатели подкинуть \"чёрных битков\", а потом настучать уже бы давно нашлись\n\nПринцип \"неуловмого Джо\" в сочетании с минимальным уровнем криптовалютной грамотности: для каждой цели - свой кошелек. Никто в здравом уме не будет донатить или что-либо покупать с кошелька, который используется для продажи наркоты или указывается шифровальщиком, если только не захочет облегчить задачу своего задержания.",
				"added": 1564776496
			},
			{
				"comment_id": 157,
				"body": "> [caryoscelus](#comment_97_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Как прослежена? Вот приходишь с нарко-кэшем в магаз, покупаешь колбасу, уходишь. Теперь у продавца нарко-кэш, но уже отмытый. И чем тут номера помогут - не ясно. Если про них было известно, что это преступные деньги и начнут искать, кто их принёс - тоже вряд ли найдут. Разве что продавец - маньяк, запоминающий номера\n\nВ магазине ведется видезапись всех покупателей, что может очень сильно сузить круг, даже при одной оплате. Чем больше купюр будет потрачено в разные дни в разных магазинах, тем точнее можно будет вычислить того, кто ими платит. \n\n> А если не считать специально анонимной крипты, обычный биток как раз в большинстве случаев можно легко проследить\n\nПроблема не проследить, а сопоставить человека с кошельком, доказав владение им.\n\n> Если с целью потратить деньги - не будет, если с целью создать проблемы - как раз хороший способ же был бы\n\nТолько проблем будет куда больше у платильщика, чем у получателя, который не может запретить переводы на свой кошелек. Точно также на вашу банковскую карту некто может перевести украденные им деньги, с целью напакостить вам, для этого никакие крипты не нужны.",
				"added": 1564782008
			},
			{
				"comment_id": 158,
				"body": "> [caryoscelus](#comment_98_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Кстати, никто не мешает донат брать не криптой, если так больше нравится\n\nКак взять донат налом? Ведь обсуждение шло о сохранении некого приемлемого уровня анонимности при монетизации контента в p2p сетях.",
				"added": 1564782266
			},
			{
				"comment_id": 159,
				"body": "> [losij](#comment_1_12wRyWBi1yGNrq2nFjviHJz6T8jFNSw49K): Два года как потерял интерес к зеронету именно из-за этой централизации вокруг @nofish. Проблемы основных три: \n> \n> Дефолтные сайты предоставляемые сразу и которые пилятся  им же. Притом, некоторая инициатива была от других разработчиков, как @Krixano, где @nofish перехватил инициативу сделав дефолтный ZeroSites.\n> Централизация вокруг ZeroID, которая больше недостаток дизайна и сложно обходится.\n> Централизация разработки собственно ядра zeronet одним человеком. Из-за чего дизайн очень кривой и подпирает костылями зайты автора.\n\nКуда более неприятной проблемой, с лихвой перекрывающей указанные, является архитектурно-техническая: система, изначально предназначенная для решения задачи эффекивного _распространения_ контента (торренты) пытается использоваться для решения задачи _длительного хранения с целью поддержания доступности_ контента, для чего она не подходит.",
				"added": 1564784531
			},
			{
				"comment_id": 160,
				"body": "> [caryoscelus](#comment_99_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Видеозапись может не вестись;\n\nЭто очень маловероятно и чем дальше, тем вероятность найти магазин, где не ведется запись будет стремиться к нулю. \n\n>можно купить одну дорогую вещь в одном магазине, а потом продать её - вот деньги и отмыты.\n\nМожно, но сложно: долго, убыточно и малоэффективно.\n \n> Так значит никаких проблем принимать крипту нет?\n\nЕсли \"регуляторно-уголовные законы\" принимаемые властями не считать проблемой, то - нет :-) \n\n> В закладках, лол.\n\nLOL 100 раз\n\n>Но я-то как раз про то, что p2p и анонимность — вещи ортогональные\n\nНаоборот, p2p - синоним распределенной децентрализации, способствующей анонимности, в отличие от централизации, которая всегда ее понижает.",
				"added": 1564785522
			},
			{
				"comment_id": 161,
				"body": "> [anotherneko](#comment_171_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): С чего бы?\n\nВ силу анонимности операций с криптой. Совершение сделки с активами неизвестного происхождения. \n\n> С точки зрения нормальной налоговой это проблема анонимных покупателей а не магазина.\n\nЕсли жулик переведет на вашу банковскую карту украденые деньги у вас не будет никаких проблем?",
				"added": 1564835744
			},
			{
				"comment_id": 162,
				"body": "> [caryoscelus](#comment_100_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Так всё-таки привлекают кого-то за получение крипту или нет?\n\nЗависит от действующих законов страны на территории которой совершалась сделка. \n \n> Ничто не мешает сделать p2p сеть, в которой авторизация возможно только после встречи с существующими участниками.\n\nКак вы это технически представляете? :-) Надо будет встретиться и получить одобрение от всех без исключения участников сети. Ни о какой массовости речь идти не может.\n\n>Ничто не мешает сделать централизованную сеть с заходом через тор (или прям в торе/i2p и сделать) и раздачей акков бесплатно без смс\n\nКак без смс (или паспорта) помешать нехорошим людям зарегистрировать множество аккаунтов с целью накруток просмотров своего контента с целью введения в заблуждение спонсоров или желающих заказать рекламу?\n\n> И опять же, если речь про переход обычных пользователей, многие даже возможной анонимностью пользоваться не будут. Если исходить из того, что всем пользователям p2p нужна анонимность, то оно маргинально уже исходя из этого, а не из монетизации\n\nВ результате пользователи желающие анонимности и безразличные к ней не будут использовать одну сеть. Их соотношение в точности определеяет популярность анонимных сетей.",
				"added": 1564837278
			},
			{
				"comment_id": 163,
				"body": "> [gothic](#comment_1_1K3ngPFJzpGVrvTy2XXiat1L21em5JNfiL): Тоже об этом думал. По этому ZeroNet не идиал сегодня, лучше уже использовать Freenet или GnuNet\n\nВ них больше народу и контента, чем в ZN?",
				"added": 1564837450
			},
			{
				"comment_id": 165,
				"body": "> [anotherneko](#comment_172_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Активы произошли от совершения сделки. Где их достал контрагент - его проблемы и его ответственность.\n\nТоже самое можно сказать про скупку краденного. Покупателю нужен товар надлежащего вида по хорошей цене, а не история его происхождения и документы ее подтверждающие.\n \n> В худшем случае разговор с  правоохранительными органами на предмет возможной идентификации этого жулика.\n\nСчет не будет заблокирован, правоохранительные органы не будут устанавливать вашу возможную связь с жуликом, в процессе которого вас не решат сделать подозреваемым по делу, как сообщника и не конфискуют вашу компьютерную технику (для установления или опровержения факта причастности) в процессе непроведенного у вас обыска...",
				"added": 1564840743
			},
			{
				"comment_id": 167,
				"body": "> [caryoscelus](#comment_101_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Ч.Т.Д. Люди спокойно пользуются по всему миру (за исключением \"особых\" юрисдикций)\n\nИ какой мировой процент оборота в крипте по сравнению с банковскими платежными системами? Как только со стороны крипты будет появляться хоть минимально заметная конкуренция, которая будет сказываться на доходах банков - лобби прикроет ее сразу, под любым предлогом, или \"возглавит\", согласно обкатанному принципу ЕЕЕ.\n\n> Во-первых, речь о массовости тут не шла. Во-вторых, вовсе не обязательно получать одобрение от каждого. В зависимости от целей сети, возможно сделать WoT, выбирать нескольких проверяющих случайным образом, или после личной встречи с одним-двумя участниками публиковать видео встречи в качестве пруфа для остальных\n\nКоторые будут являтся \"авторизационными центрами\", обладающими возможностями бана и отказа в регистрации, получающие контроль над рядовыми пользователями, в результате поучится таже самая централизация с цензурой и репрессиями.\n\n> Закапывайте сразу.\n\nУже закопали. ZN тому наглядный пример - пару десятков активных пользователей по всему миру(!!!) и сотня изредко заглядывающих. Это - ноль, zero в названии сети, которое с горькой иронией сложно интерпретировать, как-то по другому, кроме: \"сеть с нулем пользователей\".\n\nРеклама - плохо, но откуда привлекать финансирование на создание контента? Качественная вешь или услга не может быть бесплатной или создаваться \"по остаточному принципу\", \"между делом\". А донат или краудфандинг может сработать только в условиях большого количества пользоватлей, требует буквально - \"толпы\", которую надо еще от куда-то взять. \n\n> Своих мозгов не хватает, обязательно циферки смотреть? В чём цель спонсора? Тоже рекламу получить? Если при этом спонсор руководствуется популярностью, а не своими предпочтениями - закапывайте там же\n> Хотя при большом желании можно организовать антиспам фильтры, WoT и т.д.\n\nОткуда возьмется инфа о количестве просмотров - популярности и предподчтениях интересующейся вашим контентом аудитории в условиях анонимности?\n \n> С чего бы? В любой сети есть люди, стремящиеся к макс. анонимности (все эти \"купил симку на бомжа, зарегал акк вконтаче через тор/впн\", например) и не стремящиеся\n\nЭто же сколько лишних телодвижений надо сделать... К тому же не факт, что бомжевая симка будет долго работать и аккаунт зареганый на нее не заблокируют.\n\nДа и какой толк от анонимности, если в модерируемой сети не сможешь открыто высказать свое мнение или любым дргугим способом пойти против установленных правил под страхом бана? В любом случае придется  \"мычать по правилам\", как и прочие представители не анонимного стада.",
				"added": 1564854601
			},
			{
				"comment_id": 168,
				"body": "> [anotherneko](#comment_173_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): По такой логике если в ашане купить что-то по краденой кредитке то ашан закроют за отмывание денег.\n\nАшнан промышляет продажей краденного? Это тянет на сенсацию.",
				"added": 1564854917
			},
			{
				"comment_id": 183,
				"body": "> [caryoscelus](#comment_104_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Ну пусть прикрывают, тогда и поговорим. Везде не прикроют\n\nЕсть мем со списком \"тогда и поговорим\" про свободу в Интернете. Это как раз из той области. Обычно всем предлагающим мне: \"тогда поговорить\", я отвечаю: \"когда они пришли\", потому что говорить в \"момент свершения\" о чем-либо уже будет слишком поздно.\n \n> Кто? Случайно выбранные пользователи? Ну кинет тебя кто-то, зарегаешься через другого, запишешь минус в карму. Кому это надо, отказывать в регистрации?\n\nЕсли я, например, захочу зарегать сто аккаунтов, для друзей, которые меня попросили ;-) \n\n> Можно назвать сколько угодно факторов и объяснить ими малое количество пользователей. Без исследований - никаких гарантий, что пользователей мало из-за отсутствия монетизации вообще и рекламы в частности, нет.\n\nКакие здесь могут быть исследования? Люди не идут, потому что для них нет ничего способноего заинтересовать и привлечь. Да и откуда оно здесь возмется? В ZeroMe 15K аккаунтов и где все эти люди? Заходят, смотрят... и уходят. Вон Фейсбучек имеет хренлярд сколько пользователей без всяких исследований, просто \"по факту\", в отличии от ZN, для которого они необходимы.\n\n> Реклама - не только плохо само по себе, но ещё и технически практически нереализуемо в нормальной сети. Классическая реклама режется элементарно даже в клирнете, в p2p большинство раздавать её не захочет. Остаются всякие product placement, заказные статейки и т.д. Но даже если это нельзя резать автоматом, то в правильной сети создать возможность блочить такой \"контент\" на уровне пользовательских списков не составит труда (в нынешнем 0нет такой возможности нет, только блочить весь сайт целиком, да)\n\nДа. Получается - выхода нет? Забудь о монетизации всяк в p2p входящий? Магиналы не хотят рекламы, но без финансовых вливаний от рекламы не будет развития их любимой сети. Все хотят влезть на елку и при этом не поцарапать свою задницу...\n\n> Ну эту мантру мы уже слушали. Если имеется ввиду, что на неё были затрачены ресурсы, которые можно было бы конвертировать в деньги - да, это очевидно. Если имеется ввиду, что всё, что даётся человеку бесплатно - некачественное - это феерический бред\n\nНа создание любого контента тратится сила и время. Если бы удавалось на нем заработать, то можно было бы перераспределить силы и время в пользу создания контента, а не перебиваться урывками в свободное от основной, кормящей работы, время.\n\nБесплатного ничего не бывает, все имет ту или иную цену, даже если ее не выразить в денежном эквиваленте. Или цена неким образом проявляется в дальнейшем, через некоторое время. Логично предположить, что если на что-то было затрачено совсем мало ресурсов, то оно будет не так хорошо, чем другое, на которое не пожалели сил.\n\n> А оно надо? Если надо - просить людей ставить оценку, писать комменты и т.п.\n\nКак в интернет-магазинах, пишут и оценивают нанятые писатели-оценщики, благо в анонимной сети аккаунтов можно нарегать кучу и сидеть писать.\n\n> Некоторые такие товарищи может только в личке общаются.\n\nДля общения в личке социалка, тем более по бомжовой симке, не нужна.\n\n>Или им может не запреты важны, а просто стыдно какие-то вещи от своего лица писать (да вон на бордах сколько этих анонимусов, айпишники которых все записаны). Суть-то не в этом, а в том, что такие люди вполне себе есть. Они бы может с радостью пересели на по-настоящему анонимную сеть, но \"тамнетлюдей\"\n\nИменно. Лучше - хомяки, с односложными комментами, чем одно сообщение на форуме за неделю.",
				"added": 1564877686
			},
			{
				"comment_id": 184,
				"body": "> [caryoscelus](#comment_107_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): И да, для рекламы нужны примерно такие же толпы\n\nТолько без источника финансирования эта толпа гарантированно никогда не появится.",
				"added": 1564902872
			},
			{
				"comment_id": 185,
				"body": "> [caryoscelus](#comment_106_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): \"Когда они пришли\" имеет смысл говорить, когда идёт речь о том, надо ли действовать в защиту того, что лично не нужно; в данном случае ни о каких действиях речь не шла. Мы вроде как просто обсуждали, посодют за крипту или нет\n> \n> Почему же? Можно будет поговорить о том, где на десяточку посадят, а где только штраф выпишут ;) А если серьёзно, то ещё раз - я не верю в то, что вся крипта будет везде зарегулирована до той степени, что нельзя будет использовать анонимные платежи. Поэтому если где-то зарегулируют, можно будет поговорить о том, куда валить из таких мест\n\nВ мире общая тенденция - все регулировать и за всеми следить, тем более когда это позволяет \"технологический прогресс\", а хомяки не придают этому никакого значения.\n \n> Внезапно, в любой сети первоначально нет людей. Когда коммерческие компании создают сети с нуля, они проводят маркетинговые кампании по привлечению пользователей. После этого пользователей может привлекать присутствие других пользователей, но для этого нужна база\n\nВнезапно, прозвучит банально но, создатели сети предлагают пользователям некоторую концепцию, идею, или реализуют ее в своей сети лучше, по сравнению с конкурентами. Если концепция интересна пользователям, они идут в такую сеть, если нет - идут к конкурентам или остаются в сети, которой уже пользуются. Иначе, какой смысл в клонировании уже существующего и повсеместно используемого?\n \n> Зачем нужна сеть, в которой возможна реклама?\n\nКак это не парадоксально и дико прозвучит: ради существования и развития самой сети.\n\n> На что угодно можно навесить ценник. Более того, про любой продукт человеческой деятельности можно высчитать условное кол-во ресурсов. Это банальность, повторять которую большого смысла нет\n> \n> Ага. Вот только из этого не следует, что на бесплатное всегда затрачивается мало ресурсов. Как бы логично не было предположить, что в среднем оно так\n\nПроиворечивые параграфы: бесплатно предоставляется, не дорого стоит и требует много ресурсов для своего создания, что бы не быть плохим. Откуда берутся ресурсы на создание?\n \n> На кого они работать-то будут?\n\nНа заказавшего накрутку.\n\n> Социалка нужна интернет-хомячкам. Обычным людям интересны люди. Если среднего человека проще всего найти и достать вконтаче, средний человек с большой вероятностью там зарегистрируется, чтобы можно было общаться с себе подобными\n> \n> Кому лучше-то?\n\nСети. Повышается вероятность найти требуемого человека в такой сети.\n \n> Очень иронично звучит в треде, где развели ежедневный оффтоп по всем фронтам\n\nТолько такая аномалия на данном форуме случается не чаще раза в полгода. Остальное время - от силы пару сообщений в день, а то и вовсе ни одного.",
				"added": 1564904639
			},
			{
				"comment_id": 186,
				"body": "> [caryoscelus](#comment_108_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Ну всё, пора возвращаться в уютный фейсбук?\n\nКак раз так и поступают 99,9% из 15К зарегистрированных пользователей ZeroMe.",
				"added": 1564905033
			},
			{
				"comment_id": 187,
				"body": "> [caryoscelus](#comment_109_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Да причём тут они?\n\nИзначально тема возникла при обсуждении востребованности сети в свете возможности появления альтернативных клиентов для устранеия проблемы, указанной в топике. Данный показатель отражает реальный уровень востребованности и интереса к сети.\n\n>Я про ваши предложения.\n\nПо поводу предложений стоит обратиться к @mistalero\n\n>Просто возникает вопрос, зачем же сидеть в сети, в которой полтора анонимуса и которая никогда не взлетит, и доказывать, что это так и есть?\n\n Не открою истину, сказав, что решение - в какой сети и зачем сидеть, каждый пользователь для себя принимает самостоятельно. Доказывать ничего не надо, можно просто обратиться к статистике использования, и динамики ее изменения. Просто существуют люди которые питают иллюзии на счет возможной будущей популярности p2p решений, что предоставляет повод для дискутирования, в том числе офтопикового.\n \n> Где логика раскручивать часть котента одного человека против другой части его же контента?\n\nЗдесь какое-то недопонимание. Почему только одной части, а не всего, и против какой части?\n\n> Это звучит скорее не по адресу, чем дико. Вопрос про то, зачем такая сеть вообще нужна. Смысл существования сети нельзя объяснить через существование её же\n\nДля чего делается сеть? Что бы ей кто-то пользовался - в этом заключается смысл существования (если только ее создатель явно не преследовал другие цели, например, исследовательские или учебные). Успешность сети общего назначения определяется количеством ее пользователей, исходя из этого, смысл существования зависит от пользователей. Если их нет - то смысл существования такой сети с точки зрения ее непосредственного функционала - минимален или стремится к нулю.",
				"added": 1564923482
			},
			{
				"comment_id": 189,
				"body": "> [caryoscelus](#comment_110_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Смысл можно искать с точки зрения любого человека или группы людей, а не только с т.з. создателя.\n\nОн практически всегда сведется к однуму: своему основному предназначению. Точно так же можно искать смысл, к примеру, в существовании молотка, только его поиск с любой точки зрения, как отдельного человека, так и групп людей, сведется к удовлетворению необходимости иметь инструмент, позволяющий забивать гвозди. Если определенная модель молотока (как инструмент) плохо справляется со своим предназначением, то смысла в его существовании - нет. \n\n>С моей точки зрения смысла в сети, в которой возможна навязанная реклама - нет. Если кто-то хочет создать добровольную рекламу, то с таким можно сосуществовать в одной сети, да. Хотя тогда неплохо устроить инфокампанию против рекламы\n\nТогда следует придумать другой источник дохода, или мириться с последствиями остаточного принципа создания контента в сети - мало, долго, фрагментированно, недоделано, заброшено.",
				"added": 1564934898
			},
			{
				"comment_id": 190,
				"body": "> [caryoscelus](#comment_110_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Мне просто не очень понятно желание сидеть в бесперспективной сети и говорить, как она бесперспективна, поэтому и интересуюсь..\n\nНадо где-то сидеть, когда нет аккаунтов коммерческих сетей и желания их заводить... :-) Принцип выбора наименьшего из ряда зол.",
				"added": 1564935336
			},
			{
				"comment_id": 191,
				"body": "> [caryoscelus](#comment_113_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Какой смысл в ТВ? Очевидно в том, чтобы доносить до людей аудиовизуальную информацию. Какой смысл в ТВ для человека с интернетом и желанием самостоятельно выбирать источники информации? Никакого. Вот и с сетью тоже самое. Я смысла в такой сети не вижу, кто-то другой может и видит, но меня-то это не убедит\n\nРазница в том, что смысл существования сети оценивается с точки зрения использующих данную технологию людей, выбирающих между разными концепциями сетей и их реализациями. Если рассматривать в том же аспекте ТВ, то выбор будет лежать не в плоскости: \"нужно/не нужно\", а в выборе между разными моделями телевизоров.",
				"added": 1564936317
			},
			{
				"comment_id": 192,
				"body": "> [caryoscelus](#comment_111_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Там ещё больше js, чем здесь\n> У меня есть своё видение, потихоньку пишу куски на 0me, как наберётся - запощу на толк. Ну и если кому надо - могу перевести\n\nУ меня тоже полно соображений. В первую очередь считаю, что стоит уделить внимние проблеме хранения контента с целью поддержания его доступности, в частности - данных большого объма, применив схему гибридного распределенного хранилища. Во-вторую - отказаться от оперирования конечными фйлами на траспортном уровне, что не удобно при интенсивном обмене сообщениями, отдав предподчтение блокам из которых при необходимости можно было бы собрать файлы. В-третью - отказался от трекеров в пользу DHT. В-четвертую - отдели бы админку (с убогими iframe) от пользовательского контента, повесив ее на отдельный порт.",
				"added": 1564943415
			}
		],
		"9_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 95,
				"body": "> [geekless](#comment_207_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): \n> Обмен осуществляется только списками трекеров, поднятых средствами самой ZeroNet, и только теми, что осмелились работать на публичных IP. Чтобы было, куда ОМОНом вламываться? Какое совпадение!\n> Извините за паранойю, но другого объяснения у меня нет. Абсолютная глупость или диверсия. Nofish на глупого не похож. Как-то так.\n\nСоздается впечатление, что сам создатель не заинтересован в развитии своей собственной сети, и не желает терять над ней контроль, даже ценой того, что она рискует остаться \"вечным демонстрационным макетом\" с парой десятков энтузиастов.",
				"added": 1562322638
			},
			{
				"comment_id": 96,
				"body": "> [fant](#comment_5_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): Пилите свое.Пилите. Свое.Время все расставит по местам. Я гарантирую это )\n\nВерно. Только за пределами ZN, что бы не потратить зря свои силы, которые можно использовать куда более рациональным спсособом. Уже второй человек, принимающий участие в его развити, имеет сомнения по поводу действий (в частности, не полной их адекватности) его создателя, который проявляет однозначное желание самолично \"рулить всем\".",
				"added": 1562323547
			},
			{
				"comment_id": 99,
				"body": "> [anotherneko](#comment_165_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Но с другой стороны для zn сильная связность и не нужна особо.\n\nБудет прикольно, когда одна часть пользователей форума, не будет видеть  сообщения и топики другой части пользователей одного форума.",
				"added": 1562493519
			}
		],
		"1_1HVtb9ohKcH19u1Cp3WrwTJipYdm1P6ceE": [
			{
				"comment_id": 98,
				"body": ">чтобы быть популярным и востребованым?\n\nВ первую очередь - массово хайпиться: иметь широкую извесность и всегда находится в центре внимания.\n\nВо-вторых: быть легко используемой - просто \"открываемой в баузере\", или через простое мобильное приложение, без всяких \"программ/плагинов, комплексов и прочих систем\" - понятий чуждых для людей, которые хотять не \"настраивать и разбираться, как что-то там работает\", а \"поставить и пользоваться\".\n\nВ-третьих - предоставлять полный набор фитчей, ставших стандартными для современных форумов, соц сетей и чатов. \n\nВ-четвертых - не жрать ресурсы: трафик, место под данные - важно для мобильных пользователей.\n \nВсе остальное: \"отсутствие цензуры, безопасность, анонимность\" для массового пользователя вторично, или вовсе безразлично, по отношению к легкости использования.",
				"added": 1562493003
			},
			{
				"comment_id": 101,
				"body": "> [justman](#comment_2_1HVtb9ohKcH19u1Cp3WrwTJipYdm1P6ceE): ну тогда им и нету смысла p2p приложение юзать получается, фейсбук будет в любом случае лучшекакие то таргетинговые штучки будет довольно сложно делать\n\nИменно. p2p - нафиг не сдался тем, кто изначально не понимает смысл его использования и не готов \"испытывать неудобства\", ради этого, например, в виде дополнительного трафика, то есть 99% всех пользователей. p2p не станет популярным, пока сами пользователи не будут целенаправленно отказываться от  централизованных решений, по понятным им соображениям, или будут вынуждены их использовать под внешним давлением.",
				"added": 1562497590
			},
			{
				"comment_id": 102,
				"body": "> [justman](#comment_3_1HVtb9ohKcH19u1Cp3WrwTJipYdm1P6ceE): В-третьих - предоставлять полный набор фитчей, ставших стандартными для современных форумов, соц сетей и чатов.\n> Огласите полный список пожалуйста:)если форум:-создавать темы-комментировать-отвечать на комментарии (треды?)\n> если соц сеть:-фоловить пользователей-писать посты-лайкать-коментировать\n> ко всему:\n> \n> прикреплять файлы\n> \n> что забыл?\n\nПолучать уведомления, пользоваться поиском, создавать группы и каналы.\n\nТолько все это - вторично по сравнению с известностью и удобствои использования. Путь будут \"мегафитчи\" - они окажутся никому не нужными, если ради их использования приедтся ставить клиента Tor, или i2p роутер.",
				"added": 1562498155
			},
			{
				"comment_id": 103,
				"body": "> [geekless](#comment_216_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Лол. Кто-нибудь из отметившихся собирается писать код?\n\nК сожалению, архитектура ZN имеет один существенный недостаток: \"все есть - зайт\", который при более интенсивном использовании сети приведет к проблемам с ее масштабированием. Для распространения контента - эта модель вполне годна, но для обмена пользовательскими сообщениями подходит очень плохо.\n\nДля примера рассмотрим зайт форума. Он хранит сообщения всех позователей, и его владелец устанавливает лимит объема сообщений. Эта схема работает пока на форуме десяток \"умеренно активных пользователей\". Что будет если их количество возрастет до нескольких сотен или тысячи? Размер обязательных данных будет расти \"в бесконечность\", в результате такие форумы будут весить сотни мегабайт и админ замучается управлять лимитами.\n\nНо это самая малая из проблем. Основной проблемой станет синхронизация данного зайта форума между тысячью пользователей. Любое сообщение любого пользователя вызовет синхронизацию у тысячи - что приведет к большому количеству служебного трафика, количество которого напрямую зависит от количества постящих пользователей. Теперь представте, что будет твориться с клиентом, если таких синхронизаций будет происходить пару десятков в секунду? И это только по одному зайту.",
				"added": 1562525572
			},
			{
				"comment_id": 104,
				"body": "> [geekless](#comment_221_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Ну то есть код ты писать не будешь. :D\n\nПрежде чем написать хоть одну строчку кода надо, для начала, хорошенько продумать: для чего она будет написана.",
				"added": 1562525845
			},
			{
				"comment_id": 105,
				"body": "> [geekless](#comment_219_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Потому что данные надо как-то сериализовать, а json как раз достаточно простой и популярный формат. Если гонять по сети \"объекты\" вместо файлов, то возникает вопрос о хранилище объектов. Если мы храним объекты в СУБД, то встаёт вопрос бэкапов и читаемости средствами за пределами этой СУБД. (Да и её надежности тоже.) Простой текстовый формат эти вопросы снимает.\n\nЧто будет с производительностью при количестве активных пользователей хотя бы в 10К?",
				"added": 1562526493
			},
			{
				"comment_id": 106,
				"body": "> [justman](#comment_8_1HVtb9ohKcH19u1Cp3WrwTJipYdm1P6ceE): понимаю, но мне хочется это сделать на golang, у питона довольно много недостатковхотя и не скажу что у golang их нету)но для работы с сетью довольно часто выбирают golang\n\nА мне хочется на С99 :-)",
				"added": 1562526744
			},
			{
				"comment_id": 107,
				"body": "> [justman](#comment_11_1HVtb9ohKcH19u1Cp3WrwTJipYdm1P6ceE): думаю если будет так, тогда будут под каждую тему делать отдельный 0net сайттаким образом нагрузка значительно падает на каждый отдельный сайтно на систему в целом, нет\n\nБоюсь предствать какой ад будет твориться с клиентом, когда количестов зайтов на диске станет хотя бы несколько тысяч... Особенно сколько времени займет синхронизация после старта клиента. При полторы сотни она происходит около 10 мин...",
				"added": 1562527011
			},
			{
				"comment_id": 108,
				"body": "> [justman](#comment_12_1HVtb9ohKcH19u1Cp3WrwTJipYdm1P6ceE): делай :-)потом посмотрим у кого что получилось и как работаетк тому же на go есть довольно годные p2p библиотекиразработчики ipfs пилят\n\nВы уверены в качестве (производительности, безглючности и что авторы в следующей версии не поломают их API) этих либ, и что они подойдут для ваших целей?",
				"added": 1562527170
			},
			{
				"comment_id": 109,
				"body": "> [geekless](#comment_222_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Зачем писать, если можно бухать.\n\nПо этому поводу есть мудрая пословица: \"дурная голова не дает ногам покоя\".",
				"added": 1562527832
			},
			{
				"comment_id": 151,
				"body": "> [losij](#comment_2_12wRyWBi1yGNrq2nFjviHJz6T8jFNSw49K): Идеальная p2p соцсеть должна быть создана инженерами, а не кодерами. От кодеров можно ожидать только очередной зеронет.\n\nПлох, тот кодер, который не считает себя продвинутым проектировщиком-архитектором :-))) Проектировть (или хотя бы продумывать детали)  - это долго, сложно и уныло, надо сразу - в код. А потом удивляются: почему у них получаются пятиколесные велосипеды, способные ездить только по прямой...",
				"added": 1564755931
			},
			{
				"comment_id": 224,
				"body": "> [vafler](#comment_10_17QiJ3NPDqUtp9tK2gNJK5AkBEhR5xSoM6): Diaspora\n\nОна не чистая p2p, ей для работы требуются сервера, поддерживаемые энтузиастами, которые могут служить точками отказа.",
				"added": 1570327016
			},
			{
				"comment_id": 243,
				"body": "> [monika](#comment_7_15DRqhjnkXxAQAgH8k2EqftH6XcUtu2ZYV): чтото ты несешь пургу, если один обновил зайт, то кто в подсети - будут брать версию чела из своей сети , в итоге меньше паразитного трафика\n\nРечь о том, что стоит одному пользователю форума написать одно сообщение, его должны получить все 1000 или более его участников. То есть одно сообщение породит передачу внутри сети - волну трафика равного размеру сообщения умноженного на количество подписчиков. Поставте пару десятков флудящих узлов, которые будут генерировать новые соообщения на форумы и зайты, имеющие большое количество подписчиков, и сеть ляжет - задержка синхронизации возрастет на время нескольких часов.\n\nТакой же эффект можно наблюдать при запуске клиента после нескольких дней офлайна, когда запускается синхронизация. ~200 зайтов требутся время > 15 мин, при том, что изменений не так много. \n\nЕсли подписанных зайтов будет несколько тысяч - придется ждать пол дня.\n\n> когда много людей на форуме, то это бардак - все разбегуться по своим подзайтам\nЧто такое \"подзайт\"? Форум - один зайт.",
				"added": 1572037293
			}
		],
		"1_17vYx9xn438HWEazvWPp3XnpFneicx3V6n": [
			{
				"comment_id": 116,
				"body": "> [geekless](#comment_225_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Где-то тут обсуждали этот вопрос.\n> Вроде, один хрен идёт через сервера.\n\nБез сервера он не сможет установить соединение.",
				"added": 1562607065
			}
		],
		"1_1C13FHoaHvm2hxG5VrooYN1z4fKybvz9Yd": [
			{
				"comment_id": 118,
				"body": "Если в ZN заведется \"профессиональный флудер\" - это будет непоправимая катастрофа.",
				"added": 1562698909
			},
			{
				"comment_id": 120,
				"body": "> [caryoscelus](#comment_81_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): \n> Тоже не соглашусь. При совсем плохом сценарии можно закрыть регистрацию новых пользователей, а все существующие аккаунты флудера внести в чёрный список / поудалять их / их контент. Правда, вероятно придётся в срочном порядке переработать мехнизм блокировки (сейчас-то данные продолжают храниться)\n\nПроблема будет с вычещением контента. \"Профессиональный\" флудер будет флудить не с десятка, а с сотен аккаунтов и не на одном форуме, а на всех популярных ресурсах.",
				"added": 1562764958
			},
			{
				"comment_id": 121,
				"body": "> [caryoscelus](#comment_82_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Да не важно, на скольких ресурсах, блоклисты-то универсально работают. Кому (из владельцев) надо будет - почистят автоматом, на остальных пользователи сами будут использовать блоклисты (но да, надо сделать, чтобы они нормально работали).\n\nКуда бы проще обстояло дело, если отделить сообщения пользователя от зайта - каждый пользователь использовал \"персональный хаб\" - служебный зайт хранящий все сообщения определенного аккаунта. Хотите видеть чьи-нибудь сообщения - загрузите и синхронизируете его хаб. При удалении такого хаба - автоматом полностью удаляются все сообщения данного пользователя со всех ресурсов. Потербуется только список забаненных адресов, что бы не появлялись запросы на их повторную загрузку.\n\n> Да, если каждый админ будет банить. Но, например, в этом чатике это маловероятно.\n\nАдминобан - это элемент цензуры. Каждый пользователь должен сам решать, чьи сообщения он хочет читать, а чьи - нет.\n\n> Чем больше мешанины из js, тем больше вероятности, что что-то пойдёт не так.. Я вообще думаю, что надо js выкинуть и заменить на безопасный язык и API\n\nХотя бы был бы предоставлен выбор: использовать его или нет...",
				"added": 1562848646
			},
			{
				"comment_id": 122,
				"body": "> [caryoscelus](#comment_82_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Да не важно, на скольких ресурсах, блоклисты-то универсально работают. Кому (из владельцев) надо будет - почистят автоматом, на остальных пользователи сами будут использовать блоклисты (но да, надо сделать, чтобы они нормально работали).\n\nКуда бы проще обстояло дело, если отделить сообщения пользователя от зайта - каждый пользователь использовал \"персональный хаб\" - служебный зайт хранящий все сообщения определенного аккаунта. Хотите видеть чьи-нибудь сообщения - загрузите и синхронизируете его хаб. При удалении такого хаба - автоматом полностью удаляются все сообщения данного пользователя со всех ресурсов. Потербуется только список забаненных адресов, что бы не появлялись запросы на их повторную загрузку.\n\n> Да, если каждый админ будет банить. Но, например, в этом чатике это маловероятно.\n\nАдминобан - это элемент цензуры. Каждый пользователь должен сам решать, чьи сообщения он хочет читать, а чьи - нет.\n\n> Чем больше мешанины из js, тем больше вероятности, что что-то пойдёт не так.. Я вообще думаю, что надо js выкинуть и заменить на безопасный язык и API\n\nХотя бы был бы предоставлен выбор: использовать его или нет...",
				"added": 1562848808
			},
			{
				"comment_id": 123,
				"body": "> [caryoscelus](#comment_83_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): В принципе да. Правда, любая защита от флуда содержит элементы централизации (в случае схемы \"по хабу на пользователя\" где-то должен храниться список хабов; в случае с флуд-атакой большая часть пользователей скорее всего предпочтёт использовать списки в которых флудеров нет). Но да, такая централизация всё же более \"добровольная\"\n\nПри такой схеме вовсе не требуется никакая централизация. Если я загружаю новый зайт, то мне предлагается загрузить \"хабы\" ползователей имеющие сообщения на данном зайте, но еще не загруженные на мой диск и не вклеченные в мой персональный список блокировки, который храниться локально. Если новый новый пользователь (или несколько пользователей) оставляет комментарий, у меня  интерфейсе после синхронизации с зайтом, появляется сообщение: \"добавить новых пользователей?\". Добавить (загрузить) и удалить хабы пользователей можно будет в любой момент, и централизованно никакие списки хранить не требуется.\n\nНа зайте всесто директорий с самими сообщениями будет храниться список \"персональных хабов\" пользователей и id их сообщений.\n \n> Если автор использует js для функционала своего сайта, пользователю выбирать приходится \"использовать или не использовать\" весь сайт целиком\n\nУвы, это так... Представление доминирует над содержанием. Хотя использовать JS _реально оправдано и необходимо_ лишь в некоторых специфических cлучаях.",
				"added": 1562852022
			},
			{
				"comment_id": 124,
				"body": "> [geekless](#comment_240_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Кем предлагается-то?\n\nИнтерфейсом при сравнении списков.\n \n> И он подвержен цензуре.\n\nНо не тотальной, как сейчас - полного удаления сообщений, которе произойдет в том числе у самого удаляемого пользователя после синхронизации зайта, и без возможности изменять сообщения со стороны владельца зайта.",
				"added": 1562854358
			},
			{
				"comment_id": 126,
				"body": "> [geekless](#comment_241_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Тогда надо и \"списки \"персональных хабов пользователей и id их сообщений\" вынести на отдельный адрес, и таких адресов может быть использовано любое количество. Что тогда остаётся от \"форума\"? Ничего.\n\nТак этот адрес и является \"адресом форума\", как сейчас, только вместо директории `data/users/` с ее содержимым будет использоваться один файл с адресами персональных хабов и id сообщений и топиков к которым они прнадлежат.\n\n> Итого, у нас есть:\n> \n> \"Идентификатор форума\", который ничего не хранит в себе (никаких пользовательских данных), а просто декларирует наличие форума.\n> Хранилище с кодом для работы с форумом - \"приложение\". Приложение может быть любое совместимое по формату данных.\n> 1 или несколько коллективных хабов, которые служат просто для отслеживания \"в эту тему писали такие-то пользователи\". Пользователь может подключать или отключать их по своему желанию.\n> Персональные хранилища, в которых все данные и лежат.\n\nДа. При такой схеме будет профит от отсутсвия необходимости каждуй раз дублировать код, загружая каждый форум, а иметь одно \"хранилище кода\" для многих форумов, основанных на данном коде.",
				"added": 1562858179
			},
			{
				"comment_id": 127,
				"body": ">[if0](#comment_126_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): [...]\nДействительно, с точки зрения _распределенной сети_ такая форма выглядит предподчтительнее существующей на данный момент. Странно, что никто сразу так не сделал, а решил \"хранить и распростронять\" сообщения вместе с форумом, или придумал костыльные полумеры с \"коллективными хабами\", подконтрольными одному владельцу.",
				"added": 1562858727
			},
			{
				"comment_id": 128,
				"body": "> [geekless](#comment_243_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Да, сначала были \"просто сайты\", потом \"просто блоги\" (уже с движком, но без возможности оставлять комменты), потом система сертификатов для комментирования, и потом как закономерный результат - форумы. Потом плагин для мерджа данных - и ZeroMe как демонстрация его применения.\n\nОставили бы совместимость с \"обычными сайтами\" зачем было \"все через морду\" пускать да еще костылить iframe...",
				"added": 1562860295
			},
			{
				"comment_id": 130,
				"body": "> [geekless](#comment_244_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Насчёт \"всё есть сайт\" - это только морда ZeroHello думает, что \"всё есть сайт\". Для ядра \"всё есть  адресуемый по публичному ключу набор данных\". Морду можно поменять - и вот уже перед нами объектное хранилище, например.\n\nТогда поправлюсь: ZN не \"все есть - зайт\", а \"все через ... морду\".",
				"added": 1562860880
			},
			{
				"comment_id": 131,
				"body": "> [geekless](#comment_245_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Самые обычные сайты, прямо как на geosites в 199x-лохматом. Берите и делайте.\n\nРаботают они с мордой и iframe от криво до нефига. \n \n> У вас всё хорошо? Как вы изоляцию кода сделаете, расскажите. И интерефейс для управления открытым сайтом.\n\nЕсли порты разные использовать? Или локальный DNS?",
				"added": 1562862163
			},
			{
				"comment_id": 132,
				"body": "> [geekless](#comment_246_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): И как это поможет админскому интерфейсу? Вы же первый взвоете, что нифига неудобно, нет ни статуса загрузки сайта, ни управления подписыванием из боковой панели, какой дебил так сделал, верните iframe-ы обратно.\n\nЯ всеми руками и ногами за нормальную отдельную страницу интерфейса управления \"не во что не интегрированную\", а не за этот показной свистяще-пердящий цирк с конями, который насколько красивый, настолько же неудобный, а местами, вовсе - бесполезный.",
				"added": 1562864397
			},
			{
				"comment_id": 133,
				"body": "> [geekless](#comment_247_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Пишите.\n\nТак я - бородатый олдфаг, прочно засевший в конце девяностых, непереносящий на дух соременное вебопердение, поэтому мое мнение и виденье в вопросе \"современных интерфейсов\" - ничтожно. Таких, как я 0.000... от общей аудитории. Вы же сами сказали: \"все скажут, что нифига неудобно ...\"",
				"added": 1562864986
			},
			{
				"comment_id": 134,
				"body": "> [geekless](#comment_248_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Так-то я тоже бородатый олдфаг, в свободное время пилящий юниксовые тулзы на сишечке. Но потенциал, стоящий за ZeroNet, меня вдохновил отбросить идеологическое неприятие питона, кофескрипта и прочей такой порнографии.\n\nКопаться в чужой \"порнографии\" куда сложнее, чем делать что-нибудь свое. Имея подобный энтузиазм можно спроектировать что-то собственное, взяв общие идеи за основу, проанализировав опыт, чем проявлять чудеса героизма преодолевая чужие завалы с совершенно не гарантированным результатом.\n\nУвы, но p2p системы в текущих реалиях остануться влачить маргинальное состояние - их все бояться, создавая им репутацию нечто противозаконного, неподдающегося контролю - трекеры - пиратство, Даркнет - хакеры, наркотики и CP. Даже сам разработчик ZN чего-то опасается, судя по его не всегда объяснинмым действиям, которые здесь уже обсуждались. Всякие Дуровы, прочие \"доброжелатели\" и \"корпорации добра\" иже с ними, при их ресурсах давно бы сделали такую сеть, увидев в ней перспективу, хотя бы экспериментальную. Но в такой сети невозможен контроль, поэтому их бы попросту засудили, при первой возможности. Раз не можешь использовать идею сам, сделай так, что бы никто ее не смог использовать - сделай так, что бы твои пользователи были намертво привязаны всеми правдами и не правдавми к твоим сервисам и никто не смог уйти к потенцеальным свободным конкурентам. Горстка отщепенцев - не в счет. \n\n>Хрен бы с ним с питоном, у нас выпал редкий шанс своими руками очертить контуры будущего, за которые не будет стыдно перед потомками. \n\nЗвучит малость пафосно :-)\n\n> И ведь технологии-то все давно известны, nofish не изобрел ничего нового. Но просто он единственный, кто смог эти кубики собрать в рабочий прототип, глядя на который, понимаешь, как надо было делать сразу еще начиная с 90-х, если не с 80-х.\n\nНикому не надо, \"как лучше\", всем надо \"как легче\" - легче использовать, легче контролировать.\n\n> Сейчас, когда идея заработала в коде, она кажется очевидной, а лет 10 назад если бы мне кто-нибудь рассказал, что будет такая штука - я бы просто не понял, о чем речь. Вот что круто - посмотреть на вещи под новым углом. А какой там код - так это всё можно исправить.\n\nКод исправить - можно, кривую архитектуру - нет.",
				"added": 1562873432
			}
		],
		"10_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 119,
				"body": "Тоже замечал затыки.",
				"added": 1562700306
			}
		],
		"1_1Mm1ztyaX85grxg2uu8KUWa8MiJi1dG2GK": [
			{
				"comment_id": 125,
				"body": ">Все функции шифрования выполняются локально в вашем браузере и никуда не передаются.\n\n>и никуда не передаются.\n\nВесьма спорное и требуещее проверки утверждение.",
				"added": 1562854849
			}
		],
		"2_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ": [
			{
				"comment_id": 136,
				"body": "> [anotherneko](#comment_168_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): А как же крипта?\n\nЕсли она будет под GPLv3.",
				"added": 1563471950
			}
		],
		"13_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 137,
				"body": ">Облачная операционная система, не обязательно с хранилищем. Просто интерфейс, например, для работы с блогами. Нужно и осуществимо ли такое?\n\nЗачем целая операционная система ради \"интерфейса работы с блогами\"? Не проще ли написать приложение с требуемой функциональностью для существующих и используемых OS?",
				"added": 1563799565
			}
		],
		"4_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 140,
				"body": "> [ultraviolet](#comment_75_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Забастовка продолжается. Подробности возможно узнавать тут: https://vk.com/public184723446\n> Сайт профсоюза МПРА пока вот в таком виде - https://vk.com/mprasu\n\nПодмайорский вконтактик? Не банят?",
				"added": 1564328363
			},
			{
				"comment_id": 176,
				"body": "> [ultraviolet](#comment_80_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e):\n> Смотрим и в сторону тру даркнета.  Это одна из причин моего присутсвия в ZeroNet\n\nZN - это не тру даркнет, i2p куда трушнее. Да и заркало сайта в нем куда проще поднять, что врядли получится в ZN с его \"зайтами\".",
				"added": 1564869398
			}
		],
		"1_1LJo4LufkNKRJYCHFB2SftfPiBvyGN8nw2": [
			{
				"comment_id": 154,
				"body": "Больше сетей - всяких и разных! Эх, найти бы среди столь богатого разнообразия хоть одну допиленную до рабочего состояния, да еще такую, что бы ее использовал хоть кто-то... Желание из области фантастики.",
				"added": 1564766542
			},
			{
				"comment_id": 169,
				"body": "В чем смысл использования данной сети для ZN, если она не обеспечивает анонимность, в отличие от проксирования соединений через Tor?",
				"added": 1564862815
			},
			{
				"comment_id": 170,
				"body": "> [katelinlis](#comment_3_1LJo4LufkNKRJYCHFB2SftfPiBvyGN8nw2): Tor реализован на нодах, а эта сеть реализована на основе каждого пользователя по принципу Meshесть приложение на IOS которое реализует эту же сеть на основе самих смартфоновнемного подождать и будет реализация на самих андроидахПо сути это аналог I2P \n\nИз официального FAQ:\n>Is Yggdrasil anonymous?\n>\n>It is not a goal of the Yggdrasil project to provide anonymity. Your direct peers may be able to determine your location if, for example, you are peering over the Internet.\n\nЭто не аналог i2p",
				"added": 1564863301
			},
			{
				"comment_id": 171,
				"body": "> [katelinlis](#comment_4_1LJo4LufkNKRJYCHFB2SftfPiBvyGN8nw2): я имею ввиду под аналогом что это сетькоторая может работать как поверх интернета , так и без него создавая сеть между устройствами\n\nТак в чем смысл этой дополнительной надстройки в случае использования ZN, если с таким же успехом (с целью увеличения скорости загрузки данных) его клиента можно запускать без Tor? Проксировние через Tor для ZN применяется не из праздной блажи, а как необходимость скрыть свой IP. В случае использования Yggdrasil ваш IP будет известен для всех пиров, как в клирнете.",
				"added": 1564864192
			},
			{
				"comment_id": 172,
				"body": "> [katelinlis](#comment_5_1LJo4LufkNKRJYCHFB2SftfPiBvyGN8nw2): в случае чебурнета эта сеть выстоит и будет доступ в привычным нам интернет, так же будет более быстрый транспорт для передачи данных\n\nБудут доступны узлы, входящие сеть, а не привычный Интернет, что по сути будет являться одной из разновидностей чебурнета, учитывая отсутствие анонимности.\n\n> Без Тор у многих не будет открыт порт, а значит работа ZN будет медленнее\n\nTor необходим не для скорости, а сокрытия IP, а вместе с ним факта использования ZN.",
				"added": 1564865042
			},
			{
				"comment_id": 173,
				"body": "> [katelinlis](#comment_6_1LJo4LufkNKRJYCHFB2SftfPiBvyGN8nw2): Что тебе важнее, анонимность или стабильность ?По сути привычный нам в настоящее время IP протокол нифига не анонимныйвсе надстройки над ним уже являются анонимностьюи если подумать, выходную ноду могут скомпрометировать, и анонимности нет\n\nКонечно же - анонимность. Смысл в \"стабильности\" сети  (не видео стогиговое вы собираетесь лить через ZN?), когда вам в дверь позвонит тов. майор?",
				"added": 1564865932
			},
			{
				"comment_id": 174,
				"body": "ZN точно не будет быстрее работать поверх Yggdrasil, чем через клирнет, а порт для работы Yggdrasil точно так же придется пробрасывать через NAT, как для ZN.\n\nДля тех, кому \"скрывать нечего\" и \"хочется побыстрее\", проще и надежнее гонять ZN поверх клирнета, а не тянуть себе в систему \"еще одну приблуду\".",
				"added": 1564867806
			},
			{
				"comment_id": 178,
				"body": "> [katelinlis](#comment_8_1LJo4LufkNKRJYCHFB2SftfPiBvyGN8nw2): Действительно через клирнет быстрее.... (Нет)для Yggdrasil не нужно ставишь допустим через мой установщикберешь ipv6 выделенный и прописываешь его для ZN и порт открыт\n\nСам Yggdrasil для своей работы открытого порта не требует?\n\nИз FAQ:\n>I am running Yggdrasil from behind a NAT. Will this affect my connectivity?\n>To accept incoming peerings, you will probably need to configure port forwarding on your router/gateway. Yggdrasil listens on the port number specified in the Listen setting, so forward this port to the machine that runs Yggdrasil.",
				"added": 1564870372
			}
		],
		"2_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 179,
				"body": "> [ultraviolet](#comment_86_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Прочитайте пожалуйста до конца - longread как сейчас модно говорить:-)\n> Капитализм (о чудо!) бывает и государственным.\n> Для понимания - устройство капитализма в англо-саксонских странах с их публичными обществами и множеством миноритарных акционеров ( в США даже небогатые люди покупают акции, я не хочу пока обсуждать рациональность этого)  и капитализма в Европе с их госуподством банков как владельцев промышленных концернов  бывает очень разное.\n> Если вы желаете доказать что в России нет капитализма или что он некий \"неправильный\" или \"особенный\" - обратите вниамние на доклад Алекса Фека из Сбербанк CIB (исследовательское подразделение Сбера)\n> Алекс очень аккуратно и с цифрами показывает формальную убытоность многих проектов Газпрома.\n> Это можно рассматривать как существование в этих отраслях способы извлечения прибавленного продукта более хараткерного для феодализма чем для капитализма\n\n\"Олигархический феодализм\", эффективность бизнеса при котором определяется степенью приближения к самодержцу, в чьих руках единолично сосредоточены государственные ресурсы, которые административно (а не рыночно) перераспределяются между вассалами-олигархами ради сохранения стабильности.",
				"added": 1564871536
			},
			{
				"comment_id": 181,
				"body": "> [ultraviolet](#comment_88_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Проблема НЕ в нерыночных механизмах\n> Рынок начинает сдавать позиции под властью монополий в любом развитом капитализме.  Монополии возникли ещё в конце 19-го века.\n\nСейчас процесс образования монополий усугубляется. Монополия куда эффективней, они сливаются с государством, поэтому антимонопольное законодательство работат избранно и формально.\n\n> Тут самое главное в способах изъятии продукта в пользу представителей правящего класса.\n> При феодализме это строго рента.  При капитализме рента и квазирента (монополий) также бывает но никогда не становятся единственным механизмом. Всегда присутствует коммерческая прибыль и ссудный процент\n> В докладе Фека как раз показыватеся что рента стала для владельцев Газпрома доминирующим способом извлечения профита.\n> Настолько доминирующим, что строго в цифрах проекты Газпрома убыточны.  Они извлекают из корпорации средства быстрее чем она получает выручку (НЕ прибыль!)\n\nПрибыль при такой схеме не важна, потому что убытки регулярно компенсируются за счет госресурсов.\n\n> Эта ситуация естественно не может продолжаться вечно.\n\nНо она может длиться годами и даже десятилетиями - насколько хватит \"подтягивания поясов\" и общего терпения.",
				"added": 1564872881
			},
			{
				"comment_id": 182,
				"body": "> [ultraviolet](#comment_90_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Всё так, всё как Ленин описывал в своей статье про империализм ещё почти сто лет назад\n> \n> Только не государственных а общественных. Вспомните слова известной премьер-министра Великобритании - нет никаких государственных денег, есть деньги налогоплатильщиков....\n\nВ этой стране так не принято считать. Когда кого-то в подворотне пытается ограбить гопник, то он сопротивляется и отбивается по мере возможностей, а когда тоже самое, или того хуже, делает власть, все считают, что это нормально, никто не робщет и даже в мыслях не допускает, что надо \"дать сдачи\".\n\n> В любом случае этот срок конечен и судя по опыту \"первого русского капитализма\" 19-го, начала 20-го века врядли может быть более полувека, притом что как минимум половину этого срока мы уже прошли\n\nЕще бы дожить бы до окончания исторического периода...",
				"added": 1564873946
			},
			{
				"comment_id": 215,
				"body": "> [ultraviolet](#comment_136_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Ваше исходное утверждение было - \"...ЧВК и другие вооруженные отряды за пределами конституции - банды...\"  из него следует что любая военная организация не опирающаяся на нормы конституционного права есть банда.\n\nЗабавная ситуаци: в мирное время, военная организация - не банда, но как только объявляется ЧС или военное положение, во время действия которых резко урезаются до возможного минимума конституционные права, она внезапно превращается в банду, причем, в любом государстве.\n  \n> Моё возражение состоит в том что существуют государства БЕЗ письменной конституции но с армиями (которые не банды) и вообще говоря существуют не правовые государства.\n\nТо есть такая аримя безоговорочно и абсолютно выполнит любой (в том числе преступный с точки зрения мирового права) приказ своего военоначальника под страхом измены? Звучит, как классическое определение банды.",
				"added": 1566498443
			}
		],
		"1_1JAiKS3giLzSw1YQWZPVAct377nyiApDW2": [
			{
				"comment_id": 180,
				"body": "> [ultraviolet](#comment_84_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Безусловно когда-нибудь завершится.  Когда-нибудь не будит ни бесноватых нацистов на Украине ни олигархической тирании в России, ни правления Уолл-стритт в США. Безусловно человечество повзрослеет и построит общество основанное на свободе равенстве и братстве.\n\nСкорее оно истребит само себя, чем повзрослеет. Уже пытались строить: и равенство, и братство, только задуманное не вышло, а каждый раз получалось наоборот.",
				"added": 1564871874
			}
		],
		"1_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": [
			{
				"comment_id": 201,
				"body": "> [ultraviolet](#comment_105_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Красивую.  А то у нас часто портреты президента вешают. Пусть хотя бы будет приятно для глаз:-)\n\nА потом окажется, что это мужик, поменявший пол :-) Вот все обламаются...",
				"added": 1565116635
			}
		],
		"5_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 203,
				"body": "> [ultraviolet](#comment_115_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Начнём же!\n> Поздравляю всех мусульманских коллег на нашем форуме со славным праздником Курбан Байрам!\n\nА может, все же не стоит религиозные праздники сюда тащить?",
				"added": 1565560238
			},
			{
				"comment_id": 204,
				"body": "> [caryoscelus](#comment_118_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Ну-с, день флага, день независимости или день горы — кому что по нраву — немного поздновато, но кто успел — тот успел! А кто опоздал — празднуйте день слонов что ли..\n> // бот с википедии\n\nПоздравляю с наступлением понедельника!",
				"added": 1565561259
			},
			{
				"comment_id": 205,
				"body": "> [ultraviolet](#comment_116_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Почему не стоит?  Свобода совести тем и прекрасна что она действительно как для атеистов так и для верующих разного толка\n\nПотому что так называемая \"свобода совести\", которая преподносится, как некое достижение свободы, всегда толкуется в сторону верующих, а не атеистов. Чувства верующих оскорбить легко, и понести за это порицание или наказание, но при этом чувства атеистов оскорбить практически невозможно... \"Свобода совести\" - показательный пример двойных стандартов, культивируемых в современном обществе.",
				"added": 1565630820
			},
			{
				"comment_id": 206,
				"body": "> [ultraviolet](#comment_124_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Вы переносите ситуация из современной России с 148-ой статьёй УК на всю историю человечества.\n> Это совершенно неверная генерализация.  Исторически свобода совести действительно появилась впервые именно как свобода в выборе религии.  Это была очень прогрессивная идея особенно на фоне идей Вестфальского мира - \"...чья власть того и вера....\"\n\nЯ говорю не о прошлых достижениях прав и свобод, а о современных тенденциях, согласно которым одна  весьма распростаненная в мире религия находится на особом, привелигированном положении,  являсь неприкасаемой в буквальном смысле этого слова. Религиозные чувства последователй которой нельзя не только оскорбить, но даже публично упомянуть по невнимательности \"не в том контексте\"...\n\nОфициально - \"все равны\", но фактически имеются \"более равные среди равных\".\n\n> Но уже в американской революции в Биле о правах она определяется в том числе как свобода от выбора религии вообще \n> ....Статья I.\n> Конгресс не должен издавать никакого закона относительно установления какой-либо религии, или воспрещающего свободное исповедание всякой религии, или ограничивающего свободу слова и прессы, или право народа — мирно собираться, а также просить правительство о прекращении злоупотреблений....\n> Вот в таком виде эта свобода и понимается в большинстве стран мира.  \n\nСтрана в которой чернокожего черным назвать нельзя, \"не оскорбив ни чьих чувств\", хотя белого - белым, почему-то не запрещается.\n\n> Опять же в большинстве таких стран НЕТ аналога 148-ой статьи УК РФ.Есть законы против осквернения религиозных сооружений и предметов как в ФРГ но сами по себе \"чувства верующих\" никак не защищаются особо. Что правильно.\n\nНикак, кроме страха наступления непропорциональных тяжких последствий для своего здоровья или даже жизни, служащим лучшим средством, чем любые официальные законы по \"защите чувств\", затыкания ртов и негластного табуирвания  любых публичных обсуждений.",
				"added": 1565978502
			}
		],
		"6_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 207,
				"body": ">боевой\n>Мы будем защищать права и интересы не только в судах.\n\n Для таких целей эффективнее будет что-то на подобии \"красных бригад\", чем \"профсоюз\"... :))))))\n\nА если серьезно, то хотелость бы для начала узнать процент недовольных условиями труда и уровнем ЗП среди работников ИТ, а так же выяснить каким боком здесь цензура?\n \nПрофсоюзное движение эффективно только при массовости, сознательности, решительности и дисциплине (чем в реалиях обладают считанные единицы),  а главное - наличии смелых, инициативных и авторитетных лидеров, лишенных политических амбиций и желания личного обогащения (кого и вовсе - днем с огнем не сыщешь), которых сразу всех пересажают, купят или запугают, как только они попытаются заявить о себе... На этом ваши \"игры в профсоюз\" сразу же бесславно закончатся.",
				"added": 1565980795
			},
			{
				"comment_id": 208,
				"body": "> [ultraviolet](#comment_126_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): мы регулярно сталкиваемся с людьми которые так говорят.  Профсоюз по их словам путь неэффективный, но вот если они получат в руки оружие - уж тут то они всем покажут!\n> В реальности они продолжают ничего не делать и в профсоюз не вступают и (что хорошо) террористами не становятся. \n\nПросто возможные риски от примыкания к настоящему, реально борящимуся профсоюзу (а не формальному, не имеющего никаго влияния),  ни коим образом не компенсируется возможными приобретениями в процессе сложной и неравной борьбы, с неизвестным результатом. На такое способны не просто \"выходящие из зоны комфорта\", а спосбные реально пожертвовать своей жизнью и судьбой своих близких, имеющие идеалы и живущие ради них. Чем выше общий средний уровнь жизненого комфорта, которое способствует всеобщему обыдлению, тем меньше людей, имеющих идеи, способные сподвигнуть их отказаться от своего привычного образа жизни. Нельзя вступить на путь реальной борьбы \"формально\", нужно быть готовым в любой момент лишиться своей работы, получить физические травмы или даже увечия, подвергнуться травли и запугиванию или вовсе сеть в тюрьму из-за какой-нибудь спланированной провокации или подставы. \n\n> Зависит от ИТ специальности.  Исследование показывает, что чем более простая специальность - тем больше недовольных.  Среди разработчиков их почти нет.  Наоборот среди работников поддержки и монтёров до трети.\n\nИ когда это монтеры и поддержка стали ИТ специалистами? Ими являются, как минимум, люди с высшим инженерным техническим образованием.\n\n> А вот это уже неверно.\n> Профсоюз демократическая организация и каждый член союза проходит необходимое обучение, где получает представление о методах и тактиках работы союза.\n> Идеальное состояние  профсоюза - способность любого его участника руководить организацией. Понятно что это идеал, но к нему стремимся и от синдрома \"лидеров\" избавляемся.\n> Лидеры не нужны.\n\nАбсолютно не согласен. Вы описываете некую абстрактную идеалистически-утопическую ситуацию. Требуется не \"просто знать методы борьбы\", пройдя какое-то там обучение, а иметь смелость им следовать, не страшать последствий от своих действий, для чего нужны живые примеры, а не теория. Что бы к вам прислушались, вам должны, как минимум, - доверять, а как максимум, - вы своими действиями должны вселить решимость в свое окружение. Кто-то должен первым вылезти под пули из окопа, что бы началась общая атака. Подчеркнутый индивидуализм слаженно сработает только при сверхвысоком уровне сознательности каждого, которая должна быть превыше всего остального.\n \n> про лидеров уже было сказано выше.  \n> В реальности опасность посадки или убийства существует.  Для её уменьшения разумно применять три меры\n> а) Не наживать себе лишних врагов и не вступать в несколько конфликтов одновременно\n\nОдного врага в виде карательной государственной машины хватит с лихвой. \n\n> б) Знать стандартные методы посадок и террора и контрмеры. Иметь своих адвокатов и юристов,  использовать методы конспирации и ИБ, иметь оружие самообороны\n\n>Знать можно, что угодно, а вот воспользовться знаниями не всегда получится. Адвокаты не бесплатны, они тоже кушать хотят. Методы конспирации и самооборона бесполезна проив госмашины, когда к вам домой прийдет \"маски шоу\" с сфабрикованным проив вас обвинением. \n\n> в) Массовость профсоюза.  Массовость резко сокращает риски как для членов руководящих органов так и для всех остальных участников союза\n\nОткуда эта массовость возмется в условиях регулярно проводимого показательного-назидательного государственного террора? Массовость должна быть на деле, а не в \"группе  ВК\", которая дружно разбежиться, как только жаренным запахнет, при этом отдуваться за всех придется вам лично, как организатору. Все считают, что лучше \"немного потерпеть\", чем в однчасье поломать свою жизнь и жизнь свои близких, став \"борцом за...\"\n\n> Ну а против подкупа хорошо действует демократическая организация.  В ситуации когда решения принимаются всеми участниками или их выборными представителями, когда все понимают цели и методы действия союза устраняет опасность превращения лидеров (их просто нет) в козлов-провокаторов.\n\nЛюбые игры в демократию закончатсяь в тот миг, когда самые активные участники попадут под настойчивый прессинг \"предложений от которых нельзя отказаться\"...",
				"added": 1566147433
			},
			{
				"comment_id": 210,
				"body": "> [ultraviolet](#comment_129_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Вижу что по какой-то неизвестной мне причине вы в том числе не понимаете что такое профсоюз.Это реально просто беда.  Очень много людей с  кем беседовал пытаются рассуждать как вы.\n> Профсоюз это просто. Менеджер увольняет рабочего - профсоюз говорит \"только попробуй - врубим итальянку!\",   менеджер понимает, что \"итальянка\" это провал плана.  Рабочий остаётся на работе.\n> Директор не повышает зарплату рабочим в течении года. Профсоюз говорит - или повышаешь или бастуем.  Директор понимает что если сейчас будет забастовка, то сорвётся выполнения заказа от важного клиента (профсоюз естественно специально выбрал момент) - идёт на переговоры.  Результат - рабочим повысили зарплату.\n> На заводе забастовка.  Рабочие во время забастовки НЕ получают зарплату. У Ивана заболел сын, он идёт в профсоюз, рассказывает о болезни сына и получает из обшака помощь.  \n> В ИТ компании директор увольняет разработчиков и сокращает зарплату тестировщикам.  Профсоюз начинает забастовку .  Сисадмины прячут бэкапы и устраивают сбой на проде.Директор носится в панике грозится всех засудить к нему приходит человек из профсоюза и предлагает мир на разумных условиях.. Результат - нет сокращений, у всех прежняя зарплата, yandex.ru работает (это вымышленное совпадение)\n> В городе Затрищенске полиция прессует профсоюзного активиста - подбросила наркоту и грозит посадить его.  Профсоюз пока слаб для забастовки. Тогда профсоюз обращается к товарищам в Москве и просит о помощи. В город Задрищенски приезжает московский адвокат и правозащитник (ведь в его организацию поступило пожертвование от профсоюза), федеральная либеральная газета пишет статью о репрессиях в Задрищенске.Итог - активиста отпускают\n> В городе Пёсбурге закрылся ресторан.  Работников выгнали без выходного.  Они идут в профсоюз.  Профсоюз договаривается с ними что если им удастся вернуть не выплаченную зарплату и выходное - они сделают в кассу союза взнос как члены союза.Профсоюз находит истинного владельца ресторана. Им оказывается грузинский еврей уехавший в Израиль.  Дурзья профсоюза в Израиле рассказывают всей бизнес-тусовке что этот господин - гнида и денег давать ему опасно. У бывшего владельца ресторана нет больше кредитов на новый бизнес, все знакомые как то странного на него смотрят, в сети распространяется информация о том что он должен денег работникам.Вы понимаете с какой радостью он согласился вернуть зарплаты и выходное, когда получил из далёкой снежной России такое скромное предложение:-)\n\nЭто вы красиво рассказываете, как это должно быть, но в реальности этой страны такое не работает. Никто и никогда вам не сделет зарплату выше среднерыночной, хоть обпротестуйтесь. Скорее, после конфликта, самых активных протестующих будут просто выживать, под разными предлогами, связанными с должностными обязанностями, которых можно придумать сотню. И в конечном итоге проще будет нати другую работу, чем за повышенную таким образом ЗП (прибавка к которой будет незаметна, для самого протестующего, потому что уйдет в профсоюзный общак) терпеть придирки, нападки и прочие издевательства.",
				"added": 1566162744
			},
			{
				"comment_id": 212,
				"body": "> [ultraviolet](#comment_135_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e):\n> А вы не подумали что рынок труда конечен?\n> Можно конечно изучать новые фреймворки и языки программирования, только вот это соревнование со своими же коллегами - ИТ работниками\n\nЛучше ничего не изучать, указывая своим работодателям под угрозой забастовки, какой фреймворк и язык программирования хочет использовать профсоюз :-)))))\nДавно так не смеялся, тянет на шутку месяца.\n\n> Конкуренция между работниками снижает зарплаты. \n> Зачем нам усиливать эту конкуренцию?\n> Для повышения зарплат нам нужно монополизировать рынок труда и диктовать с помощью нашей монополии - профсоюза условия работодателям, а не устраивать \"забеги задротов-ботаников\"\n\nВ результате принудительной остановки технологического развития, разработка софта в конторах с профсоюзами просто окажется не конкурентой (как и сами работники, принуждающие через профсоюз использовать древний фреймворк, с которого не желают переучиваться) с конторами без профсоюзов, что приведет к их разорению.",
				"added": 1566496285
			},
			{
				"comment_id": 216,
				"body": "> [ultraviolet2](#comment_4_14WQ9yBL9dh7Yv15otLGmr41QRGDp1L4Sg):\n\nЗаставили исполнять трудовой кодекс РФ... Может стоило подать в суд или просто натравить надзорные органы? При чем здесь забастовка?\n\n> А на одном из предприятий крановщику повысили оплату труда на 10 рублей в час. Таким образом, его месячная зарплата вырастет на 1760 рублей.\n\nУбедительная победа над угнетателями.",
				"added": 1566844980
			},
			{
				"comment_id": 219,
				"body": "> [infrared](#comment_2_1HxbAZtm6fU5hxqwzvEx4aNSWTPSpfwGir): Если человек поддерживает фашизм значит он поддерживает и полицейское насилие.\n> Одно без другого никак не бывает\n\nОдно не следует из другого. Полицейское насилие - один из эффективных способов сохранения власти, любой власти.",
				"added": 1567534154
			},
			{
				"comment_id": 220,
				"body": "> [infrared](#comment_3_1HxbAZtm6fU5hxqwzvEx4aNSWTPSpfwGir): Я писал про ПОДДЕРЖКУ полицейского насилия а не про сам факт наличия такого явления.\n> Поясняю:\n> Тот факт что в США существует полицеское насилие ещё не доказывает что США фашисткое государство\n> Зато поддержка полицейского насилия в США гражданином США говорит о том что этот гражданин с большой вероятностью или фашист или в лучшем случае придерживается правых взглядов\n\nЯ к тому, что у понятия \"фашизм\" слишком широкая трактовка и им слишком легко разбрасываются.",
				"added": 1567617829
			},
			{
				"comment_id": 222,
				"body": "> [infrared](#comment_6_1HxbAZtm6fU5hxqwzvEx4aNSWTPSpfwGir): Субъект прямо поддерживает как минимум пункты 10 и 12\n> ЗЫВо избежание - я не поддерживаю ни текущий режим в России ни на Украине\n\nМногие из пунктов частично выполняются в считающихся демократическими странах. Флаги и национальную символику очень часто пихают куда не поподя, права человека постоянно нарушают - слежками за действиями и контролем за высказываниями в Интернете. Откровенно навязывается синтетическая терпимость и раздувается чувство вины перед \"обиженными меньшинствами\", проводится открытая обратная дискриминация, травля \"сексуальными скандалами\" и квотирование по половому признаку, слишком терпимо воспринимается лоббизм монополий.",
				"added": 1567702808
			}
		],
		"2_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg": [
			{
				"comment_id": 209,
				"body": "Как один из вариантов, можно использовать монтирование директории с видео файлами, для чего создать пустую директорию `video`в директории сайта, а затем выполнить (от рута):\n\n`mount --bind /mnt/node/video/ /полный путь к директории сайта/video/ `\n\nНе забыть прописать в `/etc/fstab`:\n\n`/mnt/node/video/    /полный путь к директории сайта/video/   none   bind   0   0`\n\nДля того, что бы директория автоматически монтировалась при перезагрузке.",
				"added": 1566150682
			}
		],
		"1_1JJoeimWbdW8iRd5dpgE7CJ5gAQVGphQFB": [
			{
				"comment_id": 211,
				"body": "> [swashbuckler](#comment_11_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): Продажа квадратиков...\n\nТем не менее, почему-то думает, что такое может взлететь...\n\n > [fant](#comment_25_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): Привет 2000-й год...\n\nПо нынешним временам, без ИИ и блокчейна проект никто серьезно не воспринимает. Идея каталогов не так уж плоха сама по себе, если только они честно и объективно составлены, в отличие от накручиваемого SEO поиска.",
				"added": 1566238987
			}
		],
		"6_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": [
			{
				"comment_id": 217,
				"body": ">Имеет ли это какое-то отношению к массовому наплыву аудитории в ЗН из ныне покойного 8чана.\n\nПо времени точно совпало. До того момента никаких проблем с трекерами не наблюдалось.\n\n> [fant](#comment_33_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): https://github.com/ngosang/trackerslist\n> Или сразу:\n> http://127.0.0.1:43110/ConfigTrackers filesLoad additional list of torrent trackers dynamically, from a filehttps://raw.githubusercontent.com/ngosang/trackerslist/master/trackers_best.txt\n> Всегда полный набор.\n\nПробовал такой метод. После старта клиента трекеров много, но через нескольколько часов онлайна их становится 0.\n\nУ меня подозрение не столько на сами трекеры, сколько на выходные ноды Tor, через которые происходит обмен запросами с трекрами (которые находятся в клирнете) и при слишком высокой активности этих запросов предположительно начинают блаклистить их адреса.\n\nКроме того, несколько раз сталкивался с ситуаций, когда выходные узлы Tor вообще отказывались проксировать клиента ZN не желая выдвавать клирнетовский адрес.",
				"added": 1566928599
			},
			{
				"comment_id": 218,
				"body": "> [fant](#comment_34_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): У меня всегда битком рабочих трекеров из /trackers_best.txt.Не понимаю проблемы.\n\nИнтенсивность запросов к трекерам может зависить от количества загруженных зайтов.",
				"added": 1566933880
			}
		],
		"1_16iGKuwiVs9no6N8gTnn8y12TGMzvxDxEL": [
			{
				"comment_id": 221,
				"body": "В IPFS отсутствует механизм анонса факта измененией, произошедших в директории или файле, что бы узлы, загрузившие некий контент могли автоматически его обновлять.",
				"added": 1567619317
			}
		],
		"1_1PS34S4Rnz9kyBEicX1nGsARnwmDQniHYH": [
			{
				"comment_id": 226,
				"body": "\"Безопасный ПК\" - это нечто \"сферическое в вакууме\" - пустой маркетинговый слоган для \"развода лохов\". ПК (железо и софт) - это всего лишь инструмент для решения неких задач, поэтому невозможно подобрать подходящий инструмент не зная круга задач, для решения которых он будет использован.",
				"added": 1571080464
			},
			{
				"comment_id": 228,
				"body": "> [yshurik1](#comment_1_13DXCszeajcWweVGrYbjuhpWo2hEhopCDL): Есть простой постулат.\"Безопасный ПК\" это не суперзащищеный ПК куда невозможно пробится, это все равно может случится по разным причинам и просто по глупости.\"Безопасный ПК\" это ПК на котором просто невозможно скрыть следы проникновения и нецеливую активность.\n\nСмахивает на религиозную догматику. Зачем кому-то без причины, \"просто так\" \"пробиваться\", затрачивая усилия, на ваш ПК? Действия по \"проникновению\"  и \"устраниванию нецелевой активности\" будут напрямую связаны с вашей деятельностью. Например, вы анонимно торгуете чем-то запрещенным и вас хотят отследить и собрать улики. Поэтому понятия \"безопасный\" будут сильно зависить от области применения данного ПК.",
				"added": 1571083104
			},
			{
				"comment_id": 229,
				"body": "1. Определитесь с целями - \"для чего\".\n2. Обозначте угрозы - \"векторы атак\", слабые места.\n3. Минимизируйте или исключите угрозы: используйте самое простое железо в предельно минимальной конфигурации, оптимизируйте ОС - исключите по максимуму все ненужное из ядра для обозначенного в п.1 функционала, удалите из дистра лишний, вспомогательный, служебный и второстепенный софт. Лучше сделайте свой собственный минималистичный дистр, который будете хорошо знать и полностью контролировать. Откажитесь от универсальности - один специализировннанный \"аппаратно-програмный комплекс\" должен выполнять одну единственную критическую для безопасности функцию.",
				"added": 1571085505
			},
			{
				"comment_id": 231,
				"body": "> [battosai](#comment_20_1EEHPWzHXCE19GRjRe2T3HgypFjtZLcX8u): Автор думай как ты это сможешь реализовать ,ибо товар специфичный.Будет ли спрос ?\n\nОтносительно безопасное железо будет стоить очень дорого и иметь низкую производительность. С безопасным софтом всегда будет неудобно работать. Спроса не будет, если только не впаривать обычное железо с обычным софтом под соусом \"безопасности\".\n\n>Как правило заинтересованые в этом люди ни кому не доверяют и могут сделать сами.\n\nИменно. В лучшем случае они купят железо, и то в виде компонентов для последующий самостоятельной сборки. А предустановленный софт никто гарантированно не будут брать у \"левых людей\".",
				"added": 1571158929
			}
		],
		"3_17QiJ3NPDqUtp9tK2gNJK5AkBEhR5xSoM6": [
			{
				"comment_id": 227,
				"body": "> [netuser0](#comment_2_15A62tSppi8Gt85JGm5B5WDxWDgZA8wXh2):  Ненужно, и мутно\n\nИз White Paper:\n\n>TOK will issue TOKcoin asa functional token(referred to as TOK), and deploy an effective token-enhancing system  around  TOK  to  encourage  nodes  in  the  TOK  network,  thus providingall  TOK  users  with  basic services.  It  also  calls  for TOK  community  members  to contribute to  the  TOK  ecosystem. Nodes  provide services  to  the  TOK  network through  the  method known  as “mining”, and receive TOK coin in return (previously  awarded  by  the  Foundation).  What’s  more,  common  users may participate in various contribution incentive programs to get TOK. In the TOK ecosystem, users enjoy a number of basic functions free of charge, while accessing to advanced and extended functions would require a certain number of TOKs to be paid or pledged. In addition, TOK will also play a central role in the TOK open financial system\n\nЭто - очередная разводническая крипто-пирамида. Весьма веселая функциональность для \"мессенджера\" - \"Nodes  provide services  to  the  TOK  network through  the  method known  as “mining” - эти жулики будут майнить на вашем смарте :-) и предложат множество других затейливых способов развода: \"common  users may participate in various contribution incentive programs to get TOK\".",
				"added": 1571082321
			},
			{
				"comment_id": 230,
				"body": "> [vcxt](#comment_7_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1): исходный код открытый каждый хвалит свое болото\n\nЕсли у финансовая пирамида маскируется под мессенджер и даже имеет открытый код, она от этого не перестанет быть пирамидой - и цель ее создния остается такой же как и у других пирамид.",
				"added": 1571157970
			},
			{
				"comment_id": 235,
				"body": "> [vcxt](#comment_13_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1): это хуйня двойной NAT пробивает программ которые такое могут в интернете единицы\n\nИспользуйте Tor-клиент и никакие \"двойные наты пробивать\" не потребуется, за одно свой IP не будете палить.",
				"added": 1571417215
			},
			{
				"comment_id": 236,
				"body": "> [vcxt](#comment_11_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1): а где в tok пирамида  или что то подобное ?\n\nTOKcoin - нет?",
				"added": 1571417326
			},
			{
				"comment_id": 238,
				"body": "> [vcxt](#comment_18_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1): есть никто силком не заставляет его покупать\n\nТак и в любой пирамиде ни кто  ни кого не заставляет участвовать.",
				"added": 1571528963
			}
		],
		"2_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": [
			{
				"comment_id": 232,
				"body": "Интересная подборка, только про i2p ничего нет.",
				"added": 1571159499
			},
			{
				"comment_id": 233,
				"body": "> [vcxt](#comment_8_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1): i2p недоразвитая там народу мало\n\nЕдинственная действительно анонимная сеть.",
				"added": 1571253782
			},
			{
				"comment_id": 237,
				"body": "> [vcxt](#comment_9_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1): и дерьмовая написанная на питоне жрет много ресурсов и нет нормальной DHT нет нормального поиска по сайтам\n\nКакой питон? Какой DHT? Вы чего-то с чем-то путаете.",
				"added": 1571417798
			}
		],
		"4_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": [
			{
				"comment_id": 234,
				"body": ">И на данный момент (6 марта 2016 г.)\n>Обн. на 22 января 2015 г.\n\nАрхивные мемуары.\n\n>найдя 10–20 доверенных участников, которые более или менее регулярно входят в сеть\n\n>следует в течение двух-трёх недель понаблюдать кто есть в чатах, о чём ведётся разговор, какие у кого интересы, наконец, разговориться с кем-либо в публичном чате или в частном порядке и только потом предложить тому или иному участнику обменяться сертификатами.\n\nИ будут у вас в \"друзьях\" одни тов. майоры.",
				"added": 1571416799
			}
		],
		"2_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": [
			{
				"comment_id": 239,
				"body": "Любители централизованных стриминговых сервисов должны страдать.",
				"added": 1571859013
			},
			{
				"comment_id": 241,
				"body": "> [swashbuckler](#comment_14_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): Каковы децентрализованные альтернативы? Ace Player?\n\nТоренты. Чем не альтернатива?",
				"added": 1571940538
			},
			{
				"comment_id": 244,
				"body": "> [fant](#comment_53_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): Сломался мотоцикл - садись на велосипед... Чем не альтернатива? Ничем.\n\nЧто бы аналогия была правильной, надо сказать: сломался мотоцикл с дилдой вместо седла на которую насаживались его пользователи во время каждой поездки. Дилдоцикл - сломался и теперь они негодуют, что приходится пользоваться велосипедом с обычным седлом, без дилды. \n\n> Чтобы как-то приблизить одно к другому надо как минимум:\n\nЗачем, что-то к чему-то приближать? Качай себе торенты, раздавай их и смотри на здоровье. В чем проблема?\n\n> Фигня вопрос.",
				"added": 1572038035
			},
			{
				"comment_id": 245,
				"body": "> [swashbuckler](#comment_15_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): Технически, может ли ZeroNet выступить в роли CDN для раздачи медиа-контента?\n\nМожет.\n\n>Каковы требования и ограничения?\n\nЗагружать, хранить у себя и раздвать медиа-контент. Сколько дискового пространства для хранения фалов вы выделите, сколько трафика готовы потратить на раздачу и сколько времени готовы раздвать. Все ровно так же, как при использовании торентов.\n\n>Оправдан ли вообще такой подход (использование ZeroNet в качестве сидера контента)?\n\nНаезники стремительных дилдоциклов... Не так. Пользователи стриминговых сервисов любят \"кататься\" - смотреть \"по одному клику\", но жуть как не любят \"саночки возить\" - предоставлять свои ресурсы: дисковое пространство, трафик, процессорное время для нужд распределенной сети.  \n\n> Вот есть у нас некое подобие YouTube'а. Каким образом там осуществляется раздача видео-контента, и где хранится начальный файл? Можно ли превратить это в совместный сервер раздачи медиа-контента с выбором самих медиа-файлов (кто и что хочет сидить)?\n\nВсе храниться на узлах участников сети и распространяется между ними. Нет ни каких \"совместных серверов раздачи медиа-контента\" - каждый узел ZeroNet - такой сервер.",
				"added": 1572039716
			},
			{
				"comment_id": 246,
				"body": "> [fant](#comment_54_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): Я в дилдах не спец, ничего не могу сказать.\n\nСтранно.\n\n> В том что вы предлагаете как \"альтернативу\" такой вариант, который в моем понимании альтернативой никак не является. Приемлемая альтернатива подразумевает нечто равноценное или близкое к равноценному. Торренты даже близко не равноценны стриминговому сервису.\n\nВам так не хватает рекламы и \"жрать, что дают\"? Тогда зачем \"жаловаться на жизнь\", и ныть - \"как все сложно и плохо\", официальные легальные лицензионные стриминговые сервисы ни кто не банил.\n\n> Любой (в т.ч. и пиратский) более-менее приличный стриминг-сервис - платный. Каждый платит за свои санки. Не надо ерунды писать.\n\nТолько в обмен за \"удобство\", когда сервис закрывается, вы остаететсь ни с чем: без контента (за который, кстати,  вы платили), которым не можите делиться с другими, без возможности организовать и поддержать раздачу нового контента.",
				"added": 1572090399
			}
		],
		"1_18Qiw35UQuh8sSnqksUbQQh1SGaC3HaAxm": [
			{
				"comment_id": 240,
				"body": "А оно не протухло с 2010 года?",
				"added": 1571859487
			}
		],
		"2_18Qiw35UQuh8sSnqksUbQQh1SGaC3HaAxm": [
			{
				"comment_id": 242,
				"body": "Что бы усилить раздробленность. Десятки  мессенжеров и форумов (один другого безопаснее и анонимнее), и на каждом - полтора анона. Разделей и властвуй в действии :)))",
				"added": 1571942051
			}
		],
		"1_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM": [
			{
				"comment_id": 247,
				"body": "> [spacepunk](#comment_1_1N7ozinXUWETvJKAfmTTdKzYp2pVtY3p7X): Прогресс не остановить.\n\nТолько \"неудержимый прогресс\" все больше, особенно в последнее время, сильно смахивает на движение в сторону \"цифрового рабства\", используя технологии для ограничений, контроля и навязывания образа мысли и поведения. Чему всячески способствуют государства.\n\n>именно стремление человека к равенству и свободе\nЕсли к чему стремиться современный человек, так это к удобсту, комфорту, \"безопасности\" и легкой жизни, на что постоянно меняет свою свободу.",
				"added": 1572872036
			},
			{
				"comment_id": 249,
				"body": "> [spacepunk](#comment_2_1N7ozinXUWETvJKAfmTTdKzYp2pVtY3p7X): Не видел, чтобы большой популярностью пользовались технологии основанные на привязке к лицу/паспорту.\n\nЕще какой. Во всю внедряются системы распознания лиц с уличных камер. В Китае тестируется идентификация по лицу для входа в Интернет. И банки занимаются тем же. Растет и всячески поощряются безналичный рассчет, в том числе с использованием смартфонов, - это ведь как удобно для быдла. Скоро всех в обязательно-принудительном порядке обяжут иметь при себе смартфоны, для платежей и идетификации по лицу. Электронные паспорта, и подписи резко упростят задачу всякому жулью. Госуслуги - без регистрации на которых скоро не сумешь даже пёрнуть.\n\nВсе это внедряется исключительно для \"вашего удобства\". Благодаря этим \"удобным\" системам и технологиям все кто захочет будет знать о вас всю поднаготную: с точности до секунды куда вы ходили, что делали, что покупали, о чем писали в мессенджере, с кем общались и о чем говорили, где работаете, какая у вас ЗП, какой собственностью владеете, какие долги и кредиты имеете, чем болеете, какие правонарушения совершили, каких политических взглядов придерживаетесь и прочее. Гори в аду такой \"прогресс\" вместе с \"инноваторами\" его внедряющими.",
				"added": 1572909146
			},
			{
				"comment_id": 250,
				"body": "> [web30](#comment_5_17pzasQeng5RwUSqQ7smYUidZTED3RTEKH): реалисты рассказывают знакомым о зеронете и других средствах обхода блокировок, помогают установить и настроить.\n\nКакие-то странные реалисты, которые полагают, что преодолевая последствия они борются с причиной, их пораждающей.",
				"added": 1573258393
			},
			{
				"comment_id": 251,
				"body": "> [syntia](#comment_84_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM): Начали с чебурнета - закончили работорговлей. :)))\n\nТак они напрямую связаны между сосбой. Централизация - прием управления при котором меньшинству технически проще навязвать свою волю большинству. Поэтому Чебурнет - шаг назад в сторону рабовладельческого строя.\n\n>Большинство были рабами и подчинялись силе и решениям меньшинства.\nЛюбые правители денно и ночно мечтают о возвращении тех славных времен. Благо технический \"прогресс\" уже позволяет надеть цифровой ошейник на не сильно сопротивляющийся народ. Рабство - образ мышления, а свобода слова не позволяет власти эффективно прививать массам его идеи, промывая мозги своей пропагандой. Начни мыслить, как раб, и очень быстро ты станешь рабом.",
				"added": 1573342444
			},
			{
				"comment_id": 252,
				"body": "> [web30](#comment_6_17pzasQeng5RwUSqQ7smYUidZTED3RTEKH): Так просвяти нас насчет причин и как с ними эффективно бороться. Критикуешь - предлагай.\n\nХотя бы, начать с малого. Удалить свои аккунты из централизованных коммерческих сетей, отказываться от услуг корпораций, уличенных в сборе данных: Гугл, Масдай, Аппл, Яндекс, Фейсбук, Мейлру (длинный список ...) Отказаться от использованя смартфона. Проводить рассчеты и платежи наличными. Отказаться от покупок всякого маретингового впаривамого \"умного\" дерьма.\n\n\"Прогрессивные\" сервисы попросту \"не взлетели\", если бы не было желающих \"упростить себе жизнь\" активно их используя, совершенно не задумываясь последствиях своих действий.",
				"added": 1573390127
			},
			{
				"comment_id": 253,
				"body": "> [spacepunk](#comment_8_1N7ozinXUWETvJKAfmTTdKzYp2pVtY3p7X): От смартфона отказываться глупо, его можно перепрошить на коленке каким-нибудь форком андроида.\n\nВо-первых, его могут запретить перепрошивать - отключать от сети на уровне оператора при обнаружении перепрошивки. Во-вторых, наличие смартфонов на руках у 90% населения страны может быть использовано властями для принудительного внедрения системы государственной персональной аутентификации, когда смартфон будет заменять документы и обеспечивать доступ к банковсому счету и госуслугам (быдло наверняка будет в восторге от такого упрощения жизни). Следующим этапом будет отмена (или максимальное затруднение) хождения наличных денег, с полным переходам к контролируемыми государством электронным платежам.\n\nА группу из 10% не имеющих смартфоны, добровольно-обязательно заставят их приобрести.",
				"added": 1573393518
			},
			{
				"comment_id": 254,
				"body": "> [spacepunk](#comment_9_1N7ozinXUWETvJKAfmTTdKzYp2pVtY3p7X): Как я уже писал ранее, государство просто паразитирует на свободных и открытых технологиях.\n\nКак-то без разницы, кто наденет (или уже успел надеть) цифровой ошейниек мне на шею, и на базе каких технологий (свободных или не свободных) он будет сделан. Техногии разрабатываются не \"во имя мира и добра\", а ради перспективы извлечения из них прибыли.",
				"added": 1573401549
			},
			{
				"comment_id": 255,
				"body": "> [spacepunk](#comment_10_1N7ozinXUWETvJKAfmTTdKzYp2pVtY3p7X): В ответ if0:\n> Здесь уже не от технологий нужно избавляться, а от людей. Оружие без человека не выстрелит.\n\nТак проблема, что большинство пользователей (быдло, которому \"нечего скрывать\") таких технологий в упор не видят проблемы и не понимают последствий для своего будущего, поэтому принимает ошейники за \"прогресс\". И корпорации с государствами всячески поощряют подобные заблуждения, культивируя вокруг них хайп и преподнося, как улучшения в жизни каждого. А когда быдло наконец-то почувствует на своей шкуре последствия, обратной дороги не будет - ошейник уже не снимится, если только вместе с головой.",
				"added": 1573405469
			},
			{
				"comment_id": 256,
				"body": "> [lukashenko](#comment_2_18dzTVu5gRYSr91j9bVbNAxBm7SV5xbR7m): if0, надо тогда писать явно: \"при отказе от Х я получу то-то\" или \"вместо Х используйте Y и тогда получите преимущество Z\". Иначе какой смысл отказываться, если ты только теряешь. Никто не будет тебя слушать в таком случае.\n\nТеряешь только одно - свою свободу: возможность говорить, делать, иметь и отстаивать свое мнение. Если кому-то требуется объяснять, доказывая, что не попасть в рабство и ходить без ошейника - это преимущество для вас, то... Бесползно даже обсуждать эту тему. Пусть будет рабство, его такие люди в полной мере заслуживают.",
				"added": 1573425798
			},
			{
				"comment_id": 258,
				"body": "> [anotherneko](#comment_177_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Чем больше людей будет с перепрошитыми смартфонами на руках, тем сложней это будет сделать.\n\nВсего-то делов, задействовать аппаратную проверку сертификата прошивки и - конец свободе.",
				"added": 1573552823
			},
			{
				"comment_id": 261,
				"body": "> [spacepunk](#comment_11_1N7ozinXUWETvJKAfmTTdKzYp2pVtY3p7X): https://ru.wikipedia.org/wiki/Collapse_OS - вот эту штуку скоро можно будет запустить на чем угодно.\n\n>Осуществлён запуск ОС на процессорах z80\n\nЕще совсем немного допилить и пойдет на чем угодно :)))",
				"added": 1573559185
			},
			{
				"comment_id": 262,
				"body": "> [lukashenko](#comment_3_18dzTVu5gRYSr91j9bVbNAxBm7SV5xbR7m): if0, ты хочешь чтобы все резко вдруг отказались. Так не пойдет. Наметь план из шагов (некоторые из которых опциональны) иначе тебя действительно никто не будет слушать.\n\nЯ хочу, что бы хоть кто-нибудь задумался над этим вопросом и сделал свои собственные выводы.\n\nНичего не бывает \"за просто так\", все имеет свою цену, тем более - свобода. За нее надо бороться, иначе корпорации вместе с государством бутут постепенно, незаметмо оттяпывать ее у вас, раз за разом, по маленькому кусочку. Не секрет, что любая борьба всегда сопровождается выходом из \"зоны комфорта\" и \"поступать легко\", при необходимости делать выбор, всегда проще, чем \"поступать правильно\".\n\nНапример, тот же самый ZeroNet использовать сложнее, чем просто зайти во вконтактик, это и является платой за свободу, которую далеко не каждый согласится заплатить.",
				"added": 1573655046
			},
			{
				"comment_id": 264,
				"body": "> [cadabra](#comment_6_1AeQvkDJXVoJ8t9aq1bYx9tJERRAcpWLef): Для кого-то тюрьма это наказание и лишение свободы, а для кого-то крыша над головой и питание. Ты предлагаешь вести борьбу, не не объясняешь за что. За абстрактную \"свободу\" и лозунги о ней большинство бороться не пожелает ибо не видит смысла и не видит что они этим выиграют.\n\nНужно разжавать, в рот положить, а потом еще попросить проглотить? Нет. Увольте. Борьба изначально бесперспективна, когда \"борцунам\" требуется объяснять \"за что им бороться\", потому что они сами настолько тупые, что этого своим умом понять не могут, да еще, к тому же, \"их все устаивает\".",
				"added": 1573687272
			},
			{
				"comment_id": 265,
				"body": "> [cadabra](#comment_7_1AeQvkDJXVoJ8t9aq1bYx9tJERRAcpWLef): Если ты хочешь повести за собой народ, то да, нужно.\n\nСоздать секту, иначе не пойдет :)",
				"added": 1573752860
			}
		],
		"1_15v3VVCkEDSGtaZC6gg8gc3xyUWvXDBJL6": [
			{
				"comment_id": 248,
				"body": "mail.ru?",
				"added": 1572877411
			}
		],
		"1_1LPWDoyPyLywNDWafMdS7EU7vKUUHzdJ61": [
			{
				"comment_id": 257,
				"body": "> [web30](#comment_7_17pzasQeng5RwUSqQ7smYUidZTED3RTEKH): Хороший кстати вопрос, как в зеронете бороться с такого рода спамом.\n\nНи как. Только мутить спамера, при этом его спам будет только скрываться, а не удаляться с вашего диска.",
				"added": 1573429251
			}
		],
		"1_1KiQRME6xANBwEpAnX3JYjxt4yrnV91gSU": [
			{
				"comment_id": 259,
				"body": ">То есть любой может понять что ОП ты.\nЛюбой может определить, какие сообщения принадлежат одному владельцу ключа. Если не использовать Tor, то тогда можно будет связать постера с его IP и, в свою очередь, узнать личность того, кто создавал сообщения.",
				"added": 1573557877
			},
			{
				"comment_id": 260,
				"body": "> [caryoscelus](#comment_140_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Нет здесь никакого блокчейна.\nВсех сбивает с толку хайповое \"Bitcoin\" в описании сети:\n>Open, free and uncensorable websites, using Bitcoin cryptography and BitTorrent network\nПри этом все начинают думать, что в основе ZN положен блокчейн, и он как-то связан с криптовалютами.",
				"added": 1573558643
			}
		],
		"1_1DMpDMVvaeUTgC6WjCqav9CRGedc3opwkF": [
			{
				"comment_id": 263,
				"body": "> [spacepunk](#comment_12_1N7ozinXUWETvJKAfmTTdKzYp2pVtY3p7X): Деньги снова решили все.\nЗдесь скорее: \"первая доза - бесплатно\", вместе со сказками про \"корпорацию добра, которая сремиться сделать вашу жизнь лучше\". Хороший повод задуматься всем, использующим \"бесплатные\" сервисы корпораций, особенно, тем, чей бизнес как-то завязан на них.",
				"added": 1573655462
			}
		],
		"1_17pzasQeng5RwUSqQ7smYUidZTED3RTEKH": [
			{
				"comment_id": 266,
				"body": "Востребовано - не будет, потому что смотреть - некому. Если только вы не раскрученный гламурный богерчик-миллионник с ютубчика, внезапно решивший сменить платформу. Стоит ли изголяться ради десятка местных анонов, решать вам.",
				"added": 1574895158
			},
			{
				"comment_id": 267,
				"body": "> [fant](#comment_69_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): Смотреть \"нЕкому\" потому что \"нЕчего\". Будет чего - будет и кому. Я гарантирую это.\n\nК сожалению, правило: \"нет пользователей, потому что нет контента, потому что нет пользователей\" обратного действия не имеет. Уже многие пытались \"нести сюда контет\", только все заканчивалась тем, что новых пользователей не прибавлялось, а местным пяти - он был не нужен, потому что они (как все другие) брали интересный для них контент из куда более популярных источников, потому что это \"быстрее, проще и удобнее\". В связи с чем энтузиазма \"приносителей\" хватало на несколько месяцев, в зависимости от настойчивости.\n\nХотя, это может сработать, если вам удасться (неким фантастическим способом) перенести сюда контент в объеме эквивалентном, например, rutracker.org. Причем, простого зеркалировнания будет мало, требуется, что бы новый контент появлялся в ZN раньше, чем на других ресурсах и доступ к нему был надежнее и быстрее, чем на других.\n\n> Кстати, наблюдаю падение кол-ва пиров в ZN. Или в моей \"видимости\" или вообще...\nСильно зависит от выходного узла Tor, который может органичивать запросы к трекерам при привышении некоторой их интенсивности. Вплоть до полной невозможности подключения к трекерам. Из своего опыта могу сказать: чем больше вы раздаете зайтов и файлов, тем большее количестов аноносов вы генерите, тем быстрее будут отваливаться трекеры.",
				"added": 1574958094
			},
			{
				"comment_id": 268,
				"body": "> [fant](#comment_70_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): Имеет. Просто надо выйти из \"гравитационного колодца\" бедности контента. Это сложно, а иногда и невозможно...\nВыхода нет.\nКонтент грубо можно разделить на две категории: свой и чужой. Чужой (спираченый) нести - бесполезно, пока имеются источники с куда бОльшим выбором, оперетивным обновлением (релизерами) и удобствм использования. Будет ущербное зеркало, с единицами процентов от доступного на других источниках.\nСвой контент (популярный, который может быть интересен еще кому-то, помимо своего создателя) никто не принесет, потому что он трудозатратен в создании требует хоть какой монетизации, и заинтересованную в нем ЦА, что подразумевает массовую аудиторию.",
				"added": 1575068228
			}
		],
		"16_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 269,
				"body": "> [22igor](#comment_1_1EzNhcaq8eqsamfqobDECK6cEV52k5hF54): Самая песпективная сейчас технология это yggdrasil, и там уже более 700 узлов\n\nИ кто же, позвольте узнать, этот загадочный \"определитель перспективности сетевых технологий\"? лол",
				"added": 1575070752
			},
			{
				"comment_id": 270,
				"body": "> [fant](#comment_72_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): С учетом истории появления и развития Ygg - это скорее всего и правда самая интересная и популярная сейчас мешка. И там есть жизнь.\nЧем же замечательна история его появления?\n\nГоворить о какой-то популярности или жизни в ней при ~700 пользователях в масштабах 3.5ККК+ пользовталей Интернета - это явное преувеличение, и желание выдать желаемое за действительное. Будь в ней хотя бы 100К,  или демонстрируй она хотя бы двукратный рост пользователей в квартал, тогда можно было бы говорить о некой популярности.\n\nГлавным недостатоком сети Ygg, является отсутствие анонимности, что позволит оказывать давление на ее пользователей (и привлекать к ответственности пиров, расположенных в юрисдикции законодательства стран) в случае роста ее популярности.\n\n Другими словами - отсутствует смысл ее развития, в качестве инструмента преодоления цензуры, обеспечивающего свободу слова и обмена информацией. А для всего остального можно использовать клирнет без всяких над ним надстроек.",
				"added": 1575129052
			},
			{
				"comment_id": 271,
				"body": "> [22igor](#comment_2_1EzNhcaq8eqsamfqobDECK6cEV52k5hF54):  Это самая популярная, наиболее развитая, лёгкая для установки, по сравнению с другими, mesh-сеть.\nЕе установить и использовать легче, чем тор-браузер и она более развита чем Tor? Не верю.\n\n>Я предлагаю mesh-сети именно из-за их способности пробиться через изоляцию к внешнему миру и сложного регулирования со стороны властей (в плане блокировки контента)\nРазве анонимные сети: i2p и Tor справляются хуже с данной задачей? Кроме того Tor успешно решает задачу анонимного доступа к ресурсам клирнета, как с этой задачей справляется Ygg?",
				"added": 1575329517
			}
		],
		"2_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": [
			{
				"comment_id": 272,
				"body": ">РЕШЕНИЕ ДЛЯ БЕЗОПАСНОГО ...\nВступает в острое противоречие с\n>Код закрытый",
				"added": 1576590025
			}
		],
		"1_1E3o28BmawAEP5vzkCyfk1FyAwQbQUxsHR": [
			{
				"comment_id": 273,
				"body": "А если бы на месте nginx был другой, не столь широко известный открытый проект? Всем было бы пофигу.\n\nЭтот случай - всего лишь следствие, а причина кроется в другом. Но все \"все понимают\",  мирятся и молчат, принимая это, как должное и неотвратимое.",
				"added": 1576590364
			}
		],
		"1_1JE6djoBJfroS1y5DnwpMWRRcMkruPpkyv": [
			{
				"comment_id": 274,
				"body": "> [jk7](#comment_23_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): Хорошо, но текстом было б лучше\n\nУвы, клипопоколение читать не умеет.\n\nИнтересно, как они будут учиться обходить блокировки, когда ютубик с клипчиками-инструкциями забанят ;-)",
				"added": 1580292350
			}
		]
	},
	"comment_vote": {}
}