{
	"title": "三家村",
	"description": "闲杂人·读闲书·闲读书",
	"links": "*   [ZeroMe](/Me.ZeroNetwork.bit/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/12gw5ThiFrP2yahvcawg5S8ZxMXS28rSmQ/plato@zeroid.bit)\n*   [归档](/184n4WAqGeBBP8dUnBa74hPLJsCNWcQy9N/?Post)\n*   [Follow @coze](https://twitter.com/Coze)\n*   [读书日志](https://rizi.me/)​​​​​​​",
	"next_post_id": 79,
	"demo": false,
	"modified": 1526966062,
	"post": [
		{
			"post_id": 78,
			"title": "【读书】政治有道德吗？",
			"date_published": 1526965524.085,
			"body": "马基雅维利因《君主论》而遗名（曾被视为世界上最具影响力与畅销的十大名著之一，与《圣经》、《资本论》等书并列），《君主论》因“马基雅维利主义”而昭彰，“马基雅维利主义”又使“政治”和“政客”成了贬义词而被广泛引用，马基雅维利也因暴政而死。\n\n“马基雅维利主义”是一种政治实用主义，也被称为政治现实主义（Realpolitik）。它的原则是**“在政治活动中摒弃道德的羁绊。……为了达到政治目的而施以任何形式的骗术与手段，.......表面仁厚实则残忍的虚伪政治。”。**非道德统治把政治手段和权术的道德性搁置起来，当作一个不予考量的因素，这是马基雅维利《君主论》的基本原则和理论。在《非道德的政治: 马基雅维利主义的持久真理》（Amoral Politics: The Persistent Truth of Machiavellism，下称《非道德政治》）一书里，以色列特拉维夫大学政治哲学教授本-艾米·沙尔夫斯坦（Ben-Ami Scharfstein）把马基雅维利主义定义为一种**“非道德政治”**。\n\n* * *\n\n​​​​​​​\n\n* * *\n\n中国古代的法家政治家商鞅、韩非、李斯其实就是“马基雅维利主义者，强调政治的统治性，而无道德一面。(见[子产政治道德和历史的退步](https://rizi.me/#%E5%AD%90%E4%BA%A7%E6%94%BF%E6%B2%BB%E9%81%93%E5%BE%B7%E5%92%8C%E5%8E%86%E5%8F%B2%E7%9A%84%E9%80%80%E6%AD%A5))\n\n所以马基雅维利的这本《君主论》小册子被世界广泛认为是专制君主政府（又称“暴政”）的指导手册，“暴政”的说明书，专制统治<button><sup>②</sup></button> 者的权术指南。<button><sup>①</sup></button>\n\n在本书中，马基雅维利提出一个君主如果希望巩固自己的权力，就不要受任何道德准则的束缚，应该不择手段去实现自己的目的。\n\n> “因为关于人类，一般地可以这样说：他们是忘恩负义的、容易变心的，是伪装者、仿冒品，是逃避危难、追逐利益的。”（第80页）\n> \n> 对于一个君主来说，不仅不必具备各种美德，而且还要保留那些不会使自己亡国的恶行。在慷慨与吝啬方面，“明智之士宁愿承受吝啬之名，因为它虽然带来丑名但是不引起憎慨，追求慷慨之誉，则必然招致贪婪之名，而贪婪之名则使丑名与憎慨俱来。”（第78页）\n> \n> “在我们的时代里，我们看见只有那些曾经被称为吝啬的人们才做出了伟大的事业，至于别的人全都失败了。”（第77页） 在残酷和仁慈方面，君主对于残酷这个恶名不必介意，所应重视的倒是不要滥用仁慈，因为仁慈会带来灭顶之灾， “被人畏惧比受人爱戴是安全得多的”。（第80页）\n> \n> 但君主要掌握好使用残暴手段的限度和范围，即损害行为要一下子都做完，对臣民的财产和他们的妻女不要染指。在守信和失信方面，君主应当效法狐狸与狮子。“由于狮子不能够防止自己落入陷阱，而狐狸则不能够抵御豺狼。因此，君主必须是一头狐狸以便认识陷阱，同时又必须是一头狮子，以便使豺狼惊骇。” （第83-84页）\n> \n> 当遵守信义对自己不利，或原来使自己作出诺言的理由不复存在时，一位英明的君主绝不能够、也不应当遵守信义。但君主又必须深知怎样掩饰这种兽性，并须做一个伟大的伪装者和伪善者，要显得具备一切优良品质。“因为群氓总是被外表和事物的结果所吸引，而这个世界中尽是群氓。”（第86页） 在书中，马基雅维利还提出君主必须学会避免那些可能使自己受到憎恨或轻视的事情。君主必须像提防暗礁一样提防被人认为变幻无常、轻率浅薄、软弱怯懦、优柔寡断，他应该努力在行动中表现伟大、英勇、严肃庄重、坚忍不拔，使人们对自己抱有“谁都不要指望欺骗他或者瞒过他”的见解，这样才能对抗一切阴谋，坐稳江山。（第87—88页）\n> \n> 同时，君主为避免自己因袒护人民而受到贵族非难、因袒护贵族面受到人民的非议，就应设立作为第三者的裁判机关（议会），而用不着国王担负责任。“对于国王和王国来说，世界上再没有比这个制度更好、更审慎，再没有比这个方法更安全的了。”（第91页）\n> \n> 君主务必把担带责任的事情委诸他人办理，而把布惠施恩的事情由自己掌管。一位君主必须依靠他的行动去赢得伟大人物与才智非凡的声誉。当一位君主公开表示自己毫无保留地赞助某一方或反对另一方，他也会受到尊重，采取这种态度明确的办法总是比保持中立更有用处。（第 107页）\n\n<button>《君主论》早期封面</button>\n\n而事实上，马基雅维利本身就是“暴政”的受害者。朱利亚诺·迪·洛伦佐·德·美第奇（Giuliano di Lorenzo de’Medici )掌权后，立即对旧政府势力进行了残酷清洗。1512年末马基雅维利被解除一切公职，并在1513年以密谋叛变为罪名被投入监狱，受到了严酷折磨的吊刑（Strappado），肩膀脱节，浑身剧痛，后被释放。也正是在这个时候他写作了《君主论》。马基雅维利心力憔悴、贫困潦倒，希望把这部政治权术著作献给那个差点没把他整死的朱利亚诺，好换取命运的改变。朱利亚诺死后，又献给他的侄子洛伦佐（Lorenzo）。但此书在马基雅维利死后才得以出版。\n\n<button>佛罗伦萨乌菲兹美术馆的马基雅维利塑像。乌菲兹美术馆曾经是美第奇家族的政务厅。</button>\n\n《君主论》不仅是对一个专制君主政府的建言，而且还在积极证明：所有那些发生在马基雅维利自己身上的统治手段，包括惩罚和酷刑，都是正当的。这就像500年后莫斯科大审判中那些政治犯一样，他们一面被判处了死刑，一面还在维护要夺走他们性命的制度。马基雅维利洞察人性的脆弱和阴暗，在他所鄙视的软弱而可怜人类中，就包括他自己。这就是发生在马基雅维利身上最大的讽刺，一个黑色幽默。\n\n而更为讽刺和悲哀的是，统治阶级需要看此书吗？因为统治阶级本来面貌就是非道德和不择手段的，不需要这本书。\n\n2018年05月12日周六下午02:25:47\n\n_图片看不到，请移步[到这里](https://rizi.me/#%E6%94%BF%E6%B2%BB%E6%9C%89%E9%81%93%E5%BE%B7%E5%90%97%EF%BC%9F:%5B%5BReading%20Logs%5D%5D%20%E6%94%BF%E6%B2%BB%E6%9C%89%E9%81%93%E5%BE%B7%E5%90%97%EF%BC%9F%20%E3%8B%A1)_"
		},
		{
			"post_id": 77,
			"title": "有则改之，无则加冕",
			"date_published": 1520751549.024,
			"body": "`有则改之，无则加冕` <sup>~~冕~~(勉)</sup>\n\n此句出自《论语·学而》：\n\n> 曾子曰：\"吾日三省吾身\":为人谋而不忠乎？与朋友交而不信乎？传不习乎？\n\n宋朝朱熹《论语集注·学而篇第一》批注：\n\n> “曾子以此三者日省其身，有则改之，无则加勉，其自治诚切如此, 可谓得为学之本矣。”\n\n毛泽东在第七次全国代表大会《论联合政府》政治报告中提到：\n\n> “对于我们，经常地检讨工作，在检讨中推广民主作风， 不惧怕批评和自我批评，实行“知无不言，言无不尽”，“言者无罪，闻者足戒”，“有则改之，无则加勉”这些中国人民的有益的格言，正是抵抗各种政治灰尘和政治微生物侵蚀我们同志的思想和我们党的肌体的唯一有效的方法。”\n\n从此，此句广为流传和被人们熟知。\n\n三家村批注：\n\n> 有则改之，无则加冕。不传习乎？\n\n而现实那？“知者不言，言者不尽”、“言者获罪，闻者足戒”、\"有则改之，无则加勉”。这就是魔幻现实主义。\n\n**面对现实中的无奈、虚弱和无助，如果没有精神需求，会遁入犬儒；如果有些精神需求，又很容易委身于灼热的宏大概念；而现今最悲哀的是沉默，或者皮里春秋的喃喃自语。**\n\n2018年03月10日周六下午10:05:44  来源：[三家村读书笔记](https://www.zove.me/#Reading%20Logs)"
		},
		{
			"post_id": 76,
			"title": "【读书】推十合一",
			"date_published": 1517634181.775,
			"body": "“士 ”这个字很有哲学意味。\n\n什么是“士 ”？《说文》：\n\n> 士，事也。數始於一，終於十。从一从十。孔子曰：“推十合一爲士。”凡士之屬皆从士。\n\n* * *\n\n也就是说“凡能事其事者偁士”，能办事的人就是 “士 ”。\n\n“士 ”怎么来的？《说文》：\n\n> 數始於一。終於十。\n\n善于做事，能把事情从一开始，做到十借书。孔子对之的解释是：\n\n> 推十合一爲士。\n\n也就是“學者由博返約。故云推十合一。”做学问，从广博到精深即“推十合一”。另外也可以理解为“博學、審問、愼思、明辨、篤行、惟以求其至是也。若一以貫之。則聖人之極致矣。”学问之径，唯求每一步都达到极致，方为圣学之道。\n\n再进一步说明：能做事，即“數始於一。終於十。”善做事，即“推十合一”。这和数学家华罗庚先生说的读书之道：“先把书读厚再读薄”有异曲同工之妙。\n\n来源[读书笔记](https://zove.me/#%E6%8E%A8%E5%8D%81%E5%90%88%E4%B8%80:%E6%8E%A8%E5%8D%81%E5%90%88%E4%B8%80)"
		},
		{
			"post_id": 75,
			"title": "【读书】也说区块链",
			"date_published": 1516802262.036,
			"body": "前乔治亚理工大学研究技术史教授Melvin Kranzberg（已故）曾经在30年前提出过6条技术定理，虽然这些定律基于并验证与冷战时期发生的一系列技术变革和革新，但同样适用于今日之日新月异的技术突飞猛进的技术时代。\n\n对此6条定律，我称之为科技哲学：\n\n* * *\n\n> 1\\. 技术不好也不坏；也不是中性的。\n> 2\\. 发明是需求之母。\n> 3\\. 技术都是成套出现，或大或小。\n> 4\\. 虽然技术可能是引发诸多公共问题的主因，但非技术因素在技术政策决定中占据主导。\n> 5\\. 历史相关性普遍存在，但技术的历史相关性最强。\n> 6\\. 技术是深受人为因素影响的一种活动。\n\n而对今日炙手可热的区块链概念或者技术，如果用科技哲学的视角观察，也许是最好不过的“冷眼旁观”。\n\n_Modified：2018年01月15日周一下午11:13:55_\n\n区块链脱胎于中本聪发明的比特币，这个神秘的中本聪\n\n发出的第一块区块被称为“创世纪区块”，有人用圣经里的这句话形容，“神说要有光，于是便有了光”。“光”，是相对于黑暗环境的。我不知道中本聪发明的本意是什么？但现实世界如果有人出来冒充说自己就是中本聪本人时 ，中本聪本人就会跳出来指证，“非也，人人都是中本聪！” 。中本聪所说的“人人都是中本聪”，就是区块链的核心特性之一：去中心化。这个星球中心化组织形式实在太长了，除了原始社会组织结构形态，漫长的历史无不处在中心化的组织框架统治之内。中心化，也就是集权化，被代表化；去中心化，我不知道这是不是民主的一种形式，按照现代文明的定义，区块化的这种形态应该不算是一种民主。 那么它应该是一种什么形态那？自组织？自组织结构形态目前只存在于小型化组织或实验化行为和柏拉图的《[理想国](https://www.zove.me/#%E7%90%86%E6%83%B3%E5%9B%BD)》之中，当代人类文明事实上是无法承载“白蚁型”共识主动性自组织结构形态的。 所以，区块链在中国民间的大火大热，而政府的冷处理态度，这其实不是一个技术问题，是一个政治问题，是一场民主博弈，“究竟是少数代表多数(目前的法币政策)还是多数即正义(全球分布式共识网络，也即区块链)”的博弈。这正如开头引用Melvin Kranzberg教授的科技定律之一，**“虽然技术可能是引发诸多公共问题的主因，但非技术因素在技术政策决定中占据主导。”**\n\n来自[读书笔记](https://www.zove.me/#%E5%8C%BA%E5%9D%97%E9%93%BE%E7%A7%91%E6%8A%80%E7%9A%84%E5%93%B2%E6%80%9D%E4%B9%8B%E4%B8%80:%E5%9B%BE%E8%AF%B4%E5%8C%BA%E5%9D%97%E9%93%BE%20%E5%8C%BA%E5%9D%97%E9%93%BE%E7%A7%91%E6%8A%80%E7%9A%84%E5%93%B2%E6%80%9D%E4%B9%8B%E4%B8%80%20%E7%BC%98%E8%B5%B7%E6%80%A7%E7%A9%BA%EF%BC%8C%E6%80%A7%E7%A9%BA%E7%BC%98%E8%B5%B7%20%E3%8B%A1)"
		},
		{
			"post_id": 73,
			"title": "【读书】说文解字：生殖器崇拜“也”且",
			"date_published": 1516253589.903,
			"body": "[说了“且”](https://www.zove.me/#%E8%AF%B4%E6%96%87%E8%A7%A3%E5%AD%97%EF%BC%9A%E7%94%9F%E6%AE%96%E5%99%A8%E5%B4%87%E6%8B%9C%E4%B9%9F%E2%80%9C%E4%B8%94%E2%80%9D)，再说说“也”。\n\n之说以说“也”，“也”也是生殖器，是女性生殖器。\n\n《说文》：“女阴也。象形。羊者切。”段玉裁著《说文解字注》：““女阴是本义，假借为语词，本无可疑者，而浅人妄疑之。许氏在当时必有所受之，不容人少见多怪之心测之也。”现代汉语词典中以及找不到了此意。\n\n* * *\n\n现代有学者进一步考证，“它”与“也”本为一个字，也是女阴，如浙江省温州籍学者何新即持此观点。而“也”与“它”为什么成为两个字，与“匜”字有关。“也”通“匜”，匜，读yí，古代女子用的带漏斗的盥洗器具，“匜”很可能就是古人受女性性器官的启发，造出来的字。如果大家仔细联想一下，便可体味出其中的秘密。\n\n更有意思的是，在方述鑫、林小安等编著的《甲骨金文字典》中说，“也”做语气词同“啊”，是因为考虑到“也”系女人之物，同“啊”用，包含了对美女或少妇的赞美、感叹成份。\n\n“也”除了和“它”、“匜”通假外，还和“蛇”有相同的意思，都代表女阴。\n\n此外还有“马”字，也具有女性生殖器之意。长沙马王堆汉墓出土的《马王堆房中书》一书有这样的记载：“治巾，取杨思一升、赤蚁一升、斑廿，以美□半斗并渍之，掩□□□□其汁，以渍细布一尺。已渍，旸之，干，复渍。汁尽，即取榖、椅桐汁□□□□□涂所渍布，干之，即善藏之。节(即)用之，操以揗玉策，马因惊矣。杨思者，□□□□□状如小□□而螫人。”这里的“马因惊矣”，意思就是女子用了被药浸过的纸巾擦拭私处后，私处就会像马惊了一样幸福起来。\n\n无独有偶。男子遗精，现在依然叫做“跑马”或者“走马”，可能后来“马”指代女阴的意义有了扩展，也可指代男性了。我想成语“心猿意马”的“马”也可能和这有关。\n\n如此。“空空如也”的词意也就更意味深长了：）\n\n_2018年01月01日 下午 03:41:52_\n\n[来自读书笔记](https://www.zove.me/)"
		},
		{
			"post_id": 72,
			"title": "【读书】说文解字：生殖器崇拜也“且”",
			"date_published": 1515842985.377,
			"body": "[上次](#2017%E5%B9%B412%E6%9C%8828%E6%97%A5%20%E4%B8%8A%E5%8D%88%2010%3A56%3A27)说到“自”。有是想到之前博客上提到过的“且”。\n\n“且”的意思无可厚非，而其字源之说破有争议，归结有三：\n\n1\\. “俎”器（切肉的案板）的象形；\n2\\. 神主（祖先牌位）的象形；\n3\\. 男性生殖器的象形。\n\n* * *\n\n​​​​​​​![](https://cl.ly/ofKI/Snipaste_2018-01-05_23-36-30.png)\n“且”，说文：“薦也。从几，足有二橫，‘一’其下地也。”这是大部分采取的解释。大部分人认为的也并非真理。其中生殖器说的代表者为郭沫若。\n\n郭认为，且、土、士均为牡器之象形。《说文》：”士，事也。”东方人以物插地中为事，此突出了阳物的插入功能。除此，还有“祖”和“宜”。《礼记》：“曾子曰，夫祖者，且也”，“且”与“祖”相通，祖是人对男根的祈祷和崇拜，与祖相关的“俎”（祭器）、“宜”（祭名）、“祝”、“宗”也与男根相关。\n\n![](https://cl.ly/ofJ7/Snipaste_2018-01-05_23-42-39.png)\n示，《说文》：天垂象。郭沫若认为是男根倒垂的符号。\n\n![](https://cl.ly/ofF5/Snipaste_2018-01-05_23-35-41.png)\n祝，为一人向男根跪拜欺负的样子。\n\n![](https://cl.ly/of4W/Snipaste_2018-01-05_23-37-17.png)\n宗，甲骨文表示立神主（祖宗）以祭祀的房子，后引申未供奉同一祖先的宗族。\n除此之外，具有生殖器崇拜意义的字还有：吉、王。\n\n![](https://cl.ly/ofFU/Snipaste_2018-01-05_23-38-18.png)\n吉 ： 上士下口 。 一种说法是 ：士为阳物 ， 口为睾丸的象形白描 。男人因阳物获得快 感 ， 所以后来《 说文 》把吉解释为善的意思 “另一种说法：口是容器，士是男根形状的 玉器 。表示容器里盛着男根形状的玉器举行祈福的祭典 。第三种解释是：口为女阴，士 为男根，吉是男女交媾的意思 。后引申为吉样、吉庆 。《蜃楼志全传》的主人公名叫苏吉士。吉士二字取自《诗经》的“有女怀春，吉士诱之 ” 。 吉与士都有男根的意思。《诗经》郑风里有“唯士与女，伊其相谑，”的说法 。郭沫若说，“士女对言，实同牡牝、祖妣”\n\n![](https://cl.ly/ofJ7/Snipaste_2018-01-05_23-42-39.png)\n王，郭沫若认为王与士形体相似，均代表男根。王字上面一横表示对男根的特殊指示。\n除了郭沫若的观点外，李敖也是“且”字阳具论的拥趸者。1984年，李敖在《且且且且且》一文中，从中国古人的性崇拜，考证到儒家文化中的“牌位，指出且代表男根的来龙去脉。李更是把《诗经·褰(qiān)裳》“子不我思，岂无他士？狂童之狂也且！”译为：你有什么了不起，你不想本姑娘，本姑娘不愁没别人想，你神气什么，你小子，鸡巴啦！“古代女子够彪悍的！\n\n学者对字源的考据提出不同观点都无可厚非，也不会轻易有标准答案，除了不断有新的考古发现进行佐证。而最让人厌恶的是一些“庸俗文字学”喜欢“泛性论”以哗众取宠。\n\nPs. 如果“且”为阳具，那么“姐”字何解？\n_2017年12月29日 下午 01:32:56_\n\n来源:[读书笔记](https://www.zove.me/)"
		},
		{
			"post_id": 71,
			"title": "【分享】CloudApp 图床",
			"date_published": 1515251516.632,
			"body": "之前使用Droplr做图床，方便，好用，可惜图片存储有时间限制，而且要外币卡支付，所以不得不弃之。最近使用[CloudApp](https://my.cl.ly/r/0e323D1m21152Y2l) 图床，虽然交互及其界面不如Drolr，但至少可以免费使用，推荐之。\n\nPS.谁有好的图床替代品，请推荐一下（不要国内的，都不长久）。"
		},
		{
			"post_id": 70,
			"title": "【读书】说文解字：鼻“自”何来？",
			"date_published": 1515251251.282,
			"body": "“自”部：\n\n“自：鼻也。象鼻形。”“自”的本义为鼻，而其基本义为自我、自己。造词智慧：人谓自我时往往以手自指其鼻。\n\n同理可知，“臭”从自，从犬，谓以鼻嗅，犬鼻嗅觉最为灵敏，故其字从犬。还有“息”，“息”字从自，从心。中医称一呼一吸为“息”，也和鼻子有关，“息息相关”的息就是其本义。\n\n有“自”就有了“白”。“白：此亦自字也。省自者，词言之气从鼻出，与口相助也。凡白之属皆从白。”\n\n既然“自”就是鼻子了，为什么还有一个“鼻”字那？\n\n“鼻：引气自畀也。从自、畀。“畀，读bì，给与。\n\n“自”和“鼻”都指鼻子，前者为象形字，为独体文；后者为亦声字，为合体字。“自”是原生词，其音义的结合是约定俗成。“鼻”则为同源派生词，“畀”与“鼻”为母子，即源词与派生词关系。\n\n来自：[读书笔记](https://zove.me)"
		},
		{
			"post_id": 69,
			"title": "【读书】痛哭流涕的蒋介石",
			"date_published": 1514990483.987,
			"body": "在下班路上总算把[蒋介石与现代中国的奋斗](#%E8%92%8B%E4%BB%8B%E7%9F%B3%E4%B8%8E%E7%8E%B0%E4%BB%A3%E4%B8%AD%E5%9B%BD%E7%9A%84%E5%A5%8B%E6%96%97)上册看完了。看本书的战线拉的太长，前后半年有余。这就是为什么之前我说的：[看书忌贪](#2017%E5%B9%B412%E6%9C%8830%E6%97%A5%20%E4%B8%8B%E5%8D%88%2001%3A41%3A16)。\n\n虽然看了一半，但完全革新了我对蒋公的看法（看，连称呼都改了），随着看书的深入推进，由刚开始翻书时候的仅为了解，到现在的带有崇敬之情。一方面是因为蒋之性格的坚韧，一方面是蒋在乱世之局所表现出的高尚的民族大义。就以本书上半册结束处为例，蒋为了换取抗日的最后胜利，扭转中华大地抗日战争之格局，忍辱负重，甘愿在美国的淫威之下，把国军的最高军事指挥权转交给常称蒋为“花生米”先生的史迪威。当蒋接罗斯福的函电时，不仅痛哭流涕：\n\n* * *\n\n> 史迪威拿出中文译本，交给蒋；蒋默默地读完。宋子文后来告诉艾索浦，中文本比起英文本更加侮辱人。隔了一阵子，蒋放下信，把空茶杯倒过来，然后说：“我明白了。”.......等到房里只剩下大舅子，蒋才“放声痛哭”........当天晚上委员长在日记写下，下午所发生的事是“毕生上最大之耻辱”。\"\n\n而之前也同样是为了保持中国大地上抗日战争能够继续进行，在美国调停下，蒋依然放弃成见和权力，欢迎共产党的合作，但必要的前提是：\n\n> （一）美国要确保未来苏联会尊重中国在东北的主权；（二）美国要支持让英国终止她在香港及中国其他地方的 “帝国权利 ”。\n\n这和毛及其领导的共产党完全两个做派。当蒋殚精竭虑正面与日军作战的时候，毛确在私下里巩固和发展共产党势力，以备“抗日战争后，国内必有一战”：\n\n> 根据共产国际 1944 年 12 月的一份报告，直到抗战已进行七年半，中共八路军仅有 103186 人阵亡；以游击战为主的中共新四军极可能只折损数千人；但是政府军（国民党）死者逾 100 万人。换句话说，从周恩来 1940 年 1 月给共产国际的报告，至 1944 年 12 月此一报告之间——这段期间是史迪威等人坚称抗战主要由中共承担而国军并无作为的时间——中共只有约 70000 名士兵牺牲性命 。\n\n来源：[读书笔记](https://zove.me/#2018%E5%B9%B401%E6%9C%8802%E6%97%A5%20%E4%B8%8B%E5%8D%88%2010%3A36%3A41:%5B%5B2018%E5%B9%B401%E6%9C%8802%E6%97%A5%20%E4%B8%8B%E5%8D%88%2010%3A36%3A41%5D%5D%20%E3%8B%A1)"
		},
		{
			"post_id": 66,
			"title": "【读书】中国社会的德治礼治人治和法治",
			"date_published": 1512029431.76,
			"body": "[上一则](http://www.zove.me/#2017%E5%B9%B411%E6%9C%8823%E6%97%A5%20%E4%B8%8B%E5%8D%88%2011%3A46%3A09)简单总结了一下雍正的一些改革措施，例如反贪改革、文化以及制度改革。其结果是失败的，那么为什么会失败？除了上一则提到的“其人存则其政举，其人亡则其政息”，根本原因是什么？\n\n人类社会是由单体个人组成群体性社会结构，这里面就有二维空间：个人和群体，如果加上政府即官方，则是三维：个人、群体和政府，三层关系。古代帝王中国对社会的基本治理则有三个方面组成：德治、礼治和律治。\n\n* * *\n\n先说德治和礼治，二者是形而上下关系。诚如黄仁宇先生所言，是“以道德代法制”。也就是说，用道德和礼仪来管理社会，治理国家。这样一种管理和治理方式，就叫“德治”和“礼治”，不是我们现在主张的“法治”，也不是通常以为的“人治”。以道德代法制，是中国文化的性质决定的。中国文化的思想内核是群体意识。 因为法制只能规定人们不准做什么，不能规定人们必须做什么。比如它只能规定不得伤害他人，却不能规定必须热爱他人；只能规定不得损害群体利益，却不能规定必须为群体谋求利益。所以德治和礼治在中国古代社会治理中起到了极大的作用，在大部分地方中央政府的权力机构很难遍及，只有吏，没有官。地方的基本治理就要靠德治和礼治了，因为中国儒教的那一套道德理论是一套标准的人与人之间关系的的规范和行为的准则。人与人之间的关系可以有两种：平等的和不平等的。平等的关系产生平等的道德，不平等的关系则有赖于不平等的“伦理”。中国古代社会所谓“伦理道德”的核心内容，就是确立人与人之间的不平等关系，即：别内外、定亲疏、序长幼、明贵贱。因此，不同的人有不同的道德规范，“君为臣纲，父为子纲，夫为妻纲”，君要臣遵守的（忠），君不必遵守；父要子做到的（孝），父不必履行。没有一种对每个人都同等有效或必须共同遵守的“公德”。“天有十日，人有十等”，“惟上智与下愚不移”，哪有起点的平等可言？所以在道德的框架下，群体有宗族祠堂，个体有一家之主，他们挥舞着道德治理的大棒，行使着基本的治理功能。\n\n而儒家说鼓吹的：“人皆可以为尧舜。”每一个人都可以像尧舜一样做一个德行修远的王。可是君臣主仆所修德目各不相同，君主修“王道”，越修越霸气，臣仆修“奴性”，越修越窝囊，怎么会一样地都是“尧舜”？这一切都是政治宣传所需要，蛊惑人心的一种糖衣炮弹而已，是古代的“中国梦”。\n\n其次是人治。中国历史上确实存在过人治的现象。但我们必须注意，那多半出现在特殊的历史时期。比方说，在动乱年代，或建国之初。这时，礼已坏而乐已崩，德治和礼治系统失灵，便只好寄希望于“人治”和“治人”。尤其是在天下大乱改朝换代的年代，某些英雄人物确乎可能凭借个人的魅力，叱咤风云，逐鹿中原，运天下于股掌之中。其实，与其说这是人治，不如说是官治，人无管，治的权力何来？\n\n再说法制。从现代社会治理结构来说，法制是一个社会运转不悖的基础。而中国古代社会，正如前面所说，是以德治和礼治为基础的，法制充其量是社会治理手段的一种补充，因为中国社会产生不了法制。法制有一个基本原则：法律面前人人平等。平等，才需要法；平等，也才能够产生法。什么是法？法就是“全民公约”，就是社会中全体个人的共同约法。\n\n而这恰巧是中国社会的致命硬伤：只强调群体的意义，不承认个体的价值。群体总是伟大的，叫“一大群”。个体总是渺小的，叫“一小撮”。否定个体的存在价值，也就必然不承认个体的独立人格。没有独立人格，就没有自由意志，也就没有民主和法制。这样，赖以维系群体的，便只能是人身依附关系。那么，这样一种人际关系要怎样才能维持呢？无非两个办法，一是暴力，二是哄骗。这两种手段中国都有，那就是“霸道”和“王道”，也就是高压和怀柔。不过，高压和暴力难以持久，还是尽量以怀柔和哄骗为好。三纲五常这些“伦理道德”，就是用来干这活的。\n\n所以这种人格不平等的社会无须乎法，因为他们之间没有什么可商量的，只有服从，无法约定。皇帝口衔天宪，乾纲独断，令行禁止，说一不二，约什么法？所以，中国古代只有“王法”，没有“约法”。虽然也有“约法三章”的说法，但那“约法”从来就是单方面的。比如刘邦入咸阳，与秦中父老的“约法”（杀人者死，伤人及盗抵罪），便不过是刘邦单方面宣布的新王法。中国古代社会是“君要臣死，臣不得不死；父要子亡，子不得不亡。”既然如此，还要法干什么？有律就行。比方说，谋逆，凌迟；大不敬，斩立决；不孝，绞；以及“十恶不赦”（即谋反等十种最严重的罪行不得赦免）等等。\n\n而那些所谓“王子犯法，与庶民同罪”，也是骗人的鬼话。“天有十日，人有十等”，“惟上智与下愚不移”，哪有起点的平等可言？王子能犯什么法？除非是谋反。其他的，便只能叫“过失”。即便有了过失，也要另找替罪羊，由他人代为受过。比如皇太子读书不用功，受罚的便只能是陪读者。春秋时，晋悼公的弟弟公子扬干犯军规，执法官魏绛也不过只是将其车夫斩首。魏绛的“执法如山”是有名的，也不过如此而已。这就是礼，就是“刑不上大夫，礼不下庶人”，没什么平等可言。况且，如果王子犯法，便要与庶民同罪，那么皇帝犯法又与谁同罪？法律面前人人平等，行不通吧？\n\n即便在新社会里，“一切人的自由发展”是以“每个人的自由发展”为条件和前提的。（见《共产党宣言》第一卷第273页）\n\n来自[读书笔记](http://www.zove.me/#2017%E5%B9%B411%E6%9C%8830%E6%97%A5%20%E4%B8%8B%E5%8D%88%2002%3A26%3A53)"
		},
		{
			"post_id": 65,
			"title": "【读书】乡下人的悲歌",
			"date_published": 1511801672.747,
			"body": "**“他们是乡下人（hillbilliy）、乡巴佬（redneck），或者是白色垃圾（white trash）。而于我来说，他们是邻居、朋友和家人。”**\n\n这是《乡下人的悲歌》作者——31岁的耶鲁法学院学生 J.D. 万斯——在序言中的自述。\n\n* * *\n\n在美国这个种族意识很强的社会中，所用的词汇往往局限于人们皮肤的颜色——黑人（black people）、亚洲人（Asians）和白种人特权（white privilege）。万斯是个白人，细分的来说，是来自苏格兰-爱尔兰人后裔（Scots-Irish descent）中那些没有大学文凭的数百万白人工人阶级当中的一员，而非美国东北部信奉新教的盎格鲁-撒克逊裔白人（WASP）。“对于这个人群而言，贫穷是家庭的传统——他们的祖先当年在南方当奴工，然后又曾当过佃农、煤矿工人，在较近的年代里又当上了机械工和工厂工人。在美国人的称呼中，他们是乡下人（hillbilliy）、乡巴佬（redneck），或者是白色垃圾（white trash）。而于我来说，他们是邻居、朋友和家人。”\n\n中国自古几乎表面上不存在什么种族意识，五十六个民族是一家，这是社会主流的价值观。但万斯所描述的自我出身——苏格兰-爱尔兰后裔族群，不正像我们当今社会的一些族群——被官方认为的低端人口——吗？他们因为某些共同的属性被标签化为一个低端人口“无产阶级”，他们大部分来自农村或小城市，或许没有大学文凭（或没有名牌大学文凭），他们是快递员、饭店服务人员、办公楼保洁人员，他们是早晨贩卖早点的小贩，夜市撸串的摊主，是发廊的学徒，或者是小区的保安人员。解放前他们是农村包围城市的牺牲者；建国后他们是以工人阶级领导一切的下的贡献者；改革开放后他们是一部分先富起来人眼中的贫穷落后者；现在他们是城市化进程中的低端人口——城市蝼蚁。\n\n在美国，苏格兰-爱尔兰裔是美国特色最为鲜明的群体之一。一位观察者曾记录道：“走遍美国各地，苏格兰-爱尔兰裔美国人一直令我感到震惊。他们是美国最为持久稳固、变化最少的亚文化群。当几乎到处都是对传统的全盘摒弃时，他们的家庭结构、宗教与政治，还有社会生活仍然保持不变。”在中国又何尝不是那，也许是这些“低端人口”仍在坚守着中国几千年乡村社会结构沿袭下来的一些传统文化，最浓的传统也只仅存在这些人生活之中了，也许一些人认为落后，认为俗，认为不现代，可中华文化能和这些割裂吗？我想被文革扫荡的也只剩下这些了。\n\n而这些农村低端人口对传统文化的信奉给国家和社会带来了许多好的特性——高度的忠诚感以及对家庭和国家的狂热。如果社会是一面硬币，所谓的高端人口是带字的一面，无字的一定是“低端人口”，因为这一面被称为反面，他们是梅花、菊花和兰花。我们的社会向来是要面子不要里子的，看来这次北京“放弃低端人口”运动，一定不会是个案。\n\n出身“寒门”的美国小伙子万斯在《乡下人的悲歌》自序里面说： 这就是我真实的人生，也是我写这本书的初衷。我想让人们知道那种对自己濒临放弃是一种什么样的感觉，以及为什么会有人放弃。我想让人们了解穷人的生活到底发生了什么，以及精神和物质上的贫穷会对穷人家的孩子造成什么样的心理影响。我想让人们理解我和我家庭的美国梦。我想让人们体会向上层流动的真实感受。此外，我还想让人们认识到我自己不久前才意识到的一个问题：对于我们这些实现了美国梦的幸运儿来说，那些我们经历过的恶魔一直就在身后不远处穷追不舍。\n\n在美国的万斯是幸运的，实现了自己的美国梦。 在中国，“寒门”能否在复兴中华进程中实现中国梦？打破传说中的“寒门再难出贵子”？ 我不知道，您知道吗？\n\n[北京驱逐低端人口有感](https://mp.weixin.qq.com/s/h9bq-YTECfzF8sutS-RL7w) <sup>微信公众号</sup>"
		},
		{
			"post_id": 64,
			"title": "【读书】炮局",
			"date_published": 1511625731.746,
			"body": "梅鼎祚《青泥莲花记》载，宋徽宗赵佶为了泡妞竟设“行幸局”，专职安排其寻娼宿妓，这不就是炮局吗？《青泥莲花记–李师师》：\n\n> “局中以帝出日谓之有“有排挡”，次日未还，则传旨称疮痍不能坐朝”\n\n无怪乎被金人掳去。。\n\n来自[读书笔记](http://www.zove.me/#%E9%9D%92%E6%B3%A5%E8%8E%B2%E8%8A%B1%E8%AE%B0:TagCloud%20%E9%9D%92%E6%B3%A5%E8%8E%B2%E8%8A%B1%E8%AE%B0%20About)"
		},
		{
			"post_id": 63,
			"title": "【读书】“锁骨菩萨”",
			"date_published": 1511418681.745,
			"body": "此名字好美 –“锁骨菩萨”，当下来形容骨干女孩还是蛮合适的。\n\n> 昔延州有妇人，白哳，颇有姿馥，年可二十四、五。孤行城市，年少之子悉与之游，狎妮荐枕，一无所却。数年而殁。州人莫不悲惜，共醵丧具，为之葬焉。以其无家，瘗于道左。 大历中，忽有胡僧自西域来，见墓遂肤坐，具敬礼焚香。围绕赞叹数日。人见谓臼：“此一淫纵女子，人尽夫也。以其无属性，故瘗于此，和尚何敬邪。\"僧日：“非檀越所知，斯乃大圣、慈悲喜舍，世俗之欲，无不徇焉。此即锁骨菩萨，顺缘已尽。圣者云耳，不信，即启以验之。” 众大即开墓，视遍身之骨，钩结皆如锁状·果如言。州 人异之．为设大斋．超塔焉。一《续玄堡录》\n\n* * *\n\n此类故佛教典籍载录颇多：\n\n> 昔有贤女马郎妇，于金沙滩上施一切淫人。凡与交者，永绝其淫。死葬后，一梵僧来，云：“求我侣”掘开，乃锁子骨。梵僧以杖挑起，升空而去。– 《传灯录》\n\n佛门故事中，姿色靓丽大义凛然人尽可夫的女子，很多都超然升天。真可谓我不入地狱谁入地狱。以身试法，言传身教，一念成佛！\n\n> 观音大士昔于陕州化为女，以救淫迷：既死，埋之，骨如金锁不断。 一《韵府续》\n\n来自[读书日志](http://www.zove.me/Rlogs.html#2017%E5%B9%B411%E6%9C%8820%E6%97%A5%20%E4%B8%8B%E5%8D%88%2010%3A30%3A29:Journal%20%5B%5B2017%E5%B9%B411%E6%9C%8820%E6%97%A5%20%E4%B8%8B%E5%8D%88%2010%3A30%3A29%5D%5D)"
		},
		{
			"post_id": 62,
			"title": "【读书】时不同，道同",
			"date_published": 1511194308.262,
			"body": "最近国事活动颇多，你方唱罢，我方登场。轰轰烈烈，热热闹闹，不亦乐乎。于是想起了前日读《国语》的一段，嗟乎！三千年来似无一长进。\n\n* * *\n\n> 桓公忧天下诸侯。鲁有夫人、庆父之乱，二君弑死，国绝无嗣。桓公闻之，使高子存之。\n> \n> 狄人攻邢，桓公筑夷仪以封之，男女不淫，牛马选具。狄人攻卫，卫人出庐于曹，桓公城楚丘以封之。其畜散而无育，桓公与之系马三百。天下诸侯称仁焉。于是天下诸侯知桓公之非为己动也，是故诸侯归之。\n> \n> 桓公知诸侯之归己也，故使轻其币而重其礼。故天下诸侯罢马以为币，缕綦以为奉，鹿皮四个；诸侯之处垂橐而入，捆载而归。故拘之以利，结之以信，示之以武，故天下小国诸侯既许桓公，莫之敢背，就其利而信其仁、畏其武。桓公知天下诸侯多与己也，故又大施忠焉。可为动者为之动，可为谋者为之谋，军谭、遂而不有也，诸侯称宽焉。通七国之鱼盐于东莱，使关市几而不征，以为诸侯利，诸侯称广焉。筑葵兹、晏、负夏、领釜丘，以御戎狄之地，所以禁暴于诸侯也；筑五鹿、中牟、盖与、牡丘，以卫诸夏之地，所以示权于中国也。教大成，定三革，隐五刃，朝服以济河而无怵惕焉，文事胜矣。是故大国惭愧，小国附协。唯能用管夷吾、宁喜、隰朋、宾胥无、鲍叔牙之属而伯功立。《国语·齐语》\n\n齐桓公心怀天下，关心诸侯邦国。\n\n鲁国内讧，齐桓公帮助其国不灭；外敌入侵邢国和卫国，齐桓公给予援助，修筑城堡、建造人道主义避难所并赠送物资。\n\n久而久之，天下诸侯皆称齐桓公为仁德之君，这些援助襄举不是为一国之私利而为。于是诸侯各邦皆归附齐桓公。\n\n齐桓公知道天下皆已归附，就让各邦诸侯带着微礼来朝见，并用重礼回赠他们。诸侯们也毫不客气，带着瘦小的劣马、粗布做的垫子、支离破碎的鹿皮等礼物前来拜谒。使者也空囊而来，满载而归。\n\n齐国“拘之以利，结之以信，示之以武”的外交政策，使那些小国诸侯一旦与桓公缔结盟约，就再没有谁敢背弃。齐桓公知道天下诸侯都服从自己，更大力施展他的忠信，披德怀远，帮助诸侯各邦进行各种行动，为他们出谋划策，减去他们的鱼盐关税，援助他们各种军事及民用基础建设设施，甚至抵御侵略的武器装备，以显齐之国威。\n\n齐桓公的文治外交之功，成就万国归附，天下太平。\n\n春秋战国距今三千多年，齐人外交的文治武功方略，与今没有两样。今|上|暗助朝鲜不亡，明助巴基斯坦、非洲等国。一带一路大型基础建设，以及互惠互利的自贸区。最典型的莫如满载而归的特朗普。\n\n不过，齐桓公这些明载史册的治国方略， 最核心的是上文最后一句话**“唯能用管夷吾、宁喜、隰朋、宾胥无、鲍叔牙之属而伯功立”**。任人唯贤，方成霸业。\n\n拭目，以待！\n\n来源公众号：[事了拂剑去](https://mp.weixin.qq.com/s?__biz=MjM5NjY1MDg4MA==&mid=2257483874&idx=1&sn=dbae9aa926f9ff03d48622f1224d5452&chksm=a59cd28d92eb5b9b507477a71220f6d0dcd4e8945ec9ff7b1ff3cf704f1bd7e67cb56dab1d76&mpshare=1&scene=1&srcid=1116Pggoas49cSlMgflNnLh7##)"
		},
		{
			"post_id": 61,
			"title": "【读书日志】易中天的格局",
			"date_published": 1510994082.455,
			"body": "文人相轻，看起来是一个亘古不变的魔咒。\n\n《品人录》雍正一节，说起雍正驾崩之谜，易中天说二月河的《雍正皇帝》可谓“狗屁不通”“信口开河二月河”：\n\n* * *\n\n> 雍正暴卒，官书又不载原因，似乎有意在隐瞒什么，自然会引起人们的猜疑。历史学家的猜测不带感情，比较可靠公允，如郑天挺认为死于中风，冯尔康认为死于中毒（服丹药所致）。小说家和民间的说法就难免想当然甚至瞎编造。最离谱的是河南作家二月河，在其所著《雍正皇帝》一书中说是半因殉情半因乱伦而自杀，简直就是胡编乱造信口开河。电视连续剧《雍正王朝》则含糊其辞，暗示其系劳累而死，虽有一定道理，但劳累不可能是致死的直接原因。\n\n一个史学家，怎么能以史学标准考量小说家那，还加枪弄棒的来个地域歧视，如此来说，金庸武侠小说可谓满纸荒唐言了？如若非要找一个史学家里写小说最好的，小说家里历史最夯实的，非高阳莫属了（[见此](http://www.zove.me/index.html#《清朝的皇帝》:《清朝的皇帝》)）。高阳小说可谓史实与文采兼具，考据公良而翔实，古韵十足而易懂（见[《清朝的皇帝》、《乾隆韵事》](http://www.zove.me/index.html#2017读书目录-下:2017读书目录-下)），易中天的作品与之比起来，易也只能算是一个说书人了。\n\n[原载](http://zove.me/Rlogs.html#2017%E5%B9%B411%E6%9C%8817%E6%97%A5%20%E4%B8%8B%E5%8D%88%2004%3A09%3A20:Journal%20%5B%5B2017%E5%B9%B411%E6%9C%8817%E6%97%A5%20%E4%B8%8B%E5%8D%88%2004%3A09%3A20%5D%5D)"
		},
		{
			"post_id": 60,
			"title": "【分享】不错的网盘：华硕云盘",
			"date_published": 1510045428.097,
			"body": "**地址：[ASUS云盘](https://service.asuswebstorage.com/referrals/73rjx+e8ZYaEjzIAwKb3Se0EJfJOL4LgACQbmKuqDM8MycQRqeIBwyrxQywH3Id3)**\n\n竟然给了我一个10年有效期的1T空间\n![IMG](http://i66.tinypic.com/29gkb4l.png)\n\n华硕网盘活动，做调查送1T空间，注册地址：[ASUS云盘](https://service.asuswebstorage.com/referrals/73rjx+e8ZYaEjzIAwKb3Se0EJfJOL4LgACQbmKuqDM8MycQRqeIBwyrxQywH3Id3)；[问卷地址](https://docs.google.com/forms/d/e/1FAIpQLSeiAxI34TJIISdwnd-ZHnpQngkeJycDN2CnAWRFHeRcZ82gKQ/viewform?usp=sf_link)\n问卷截止日：2017.11.30"
		},
		{
			"post_id": 59,
			"title": "【分享】Telegram读书频道",
			"date_published": 1508574411.188,
			"body": "*   [Telegram读书群](https://t.me/platoer)\n*   [Telegram读书频道](https://t.me/GoReading)"
		},
		{
			"post_id": 57,
			"title": "我希望中国的读书人",
			"date_published": 1507786233.06,
			"body": "齐邦媛说：“我希望中国的读书人，无论你读什么，能早日养成自己的兴趣，一生内心有些倚靠，日久产生沉稳的判断力。这么大的国家，这么多的人，这么复杂，环环相扣的历史，再也不要用激情决定国家及个人的命运；我还盼望年轻人能培养一个宽容、悲悯的胸怀\"。[From](http://b.zove.me/2017/10/blog-post_12.html)"
		},
		{
			"post_id": 56,
			"title": "【分享】三家村精品公开版权书籍",
			"date_published": 1506937110.171,
			"body": "独乐乐不如众乐乐！\n\n以下书籍纯粹出于阅读方便为之，不涉及版权和商业利益。也欢迎大家自行下载、阅读和传播。由于制作者时间和专业设计水平有限，排版难免粗鄙，敬请包涵！也欢迎朋友们加入!\n\n**三家村精品公开版权书籍声明：**\n\n> 书籍的分享内容限定为公共版权领域的书籍（参照标准伯尔尼公约），三家村工程<sup>**1**</sup>确保这些书籍以开放文件格式自由流通，有利于长期保存，并可在各种电子设备上自由阅读，而且不会在已发布书籍资源上声明新的版权而且不会在资源文件中添加水印和文件加密以及商业诉求。并鼓励大家在原基础上自由再加工、再创造、再发布。\n\n[三家村精品公开版权书籍](http://www.zove.me/#%E4%B8%89%E5%AE%B6%E6%9D%91%E7%B2%BE%E5%93%81%E5%85%AC%E5%BC%80%E7%89%88%E6%9D%83%E4%B9%A6%E7%B1%8D:%E4%B8%89%E5%AE%B6%E6%9D%91%E7%B2%BE%E5%93%81%E5%85%AC%E5%BC%80%E7%89%88%E6%9D%83%E4%B9%A6%E7%B1%8D)"
		},
		{
			"post_id": 55,
			"title": "【读书】冯小刚的情怀底裤",
			"date_published": 1506689606.339,
			"body": "**Weekly40：**9.25~10.1\n\n**本周读书：**\n\n1.  《枕草子》 日﹒清少纳言（周作人译）\n2.  《芳华》严歌苓\n\n严歌苓的《芳华》因冯小刚的同名电影推迟上演而炙热。《芳华》是一部年代小说，讲述了七十年代一帮文艺女兵的芳华岁月，青春、成长、爱情和命运构建了整个故事。严和冯是同龄人，皆为58年出生，严歌苓出身书香门第，12岁时加入成都军区文工团，退伍后入籍美国，开始写作，畅销书作家；冯军队大院长大，高中毕业后参加北京军区文工团，后开始进入中国电影界，炙手可热。严冯芳华如出一撤。如果说能把严歌苓的《芳华》看作其年代回忆录，那么冯把《芳华》拍摄成电影，应该是冯追忆那如歌的青春。\n\n* * *\n\n同有军旅背景的严冯二人，如今都功成名就。不过在那个动荡的年代，不是所有人都如其有个灿烂的历程，参军也如同高考一样难，更别说作一位女兵。所以在二人的作品里暗透着一股那个时代的精英之气，情怀多于苦难，多与成长的忧伤和时代的迷茫。若干年前有一部叫《血色浪漫》的电视剧，也讲的是七八十年的故事，军队大院孩子的茬架、拍婆子、参军和下海，据说剧中的人物都来自现实原型–王朔、马未都、冯小刚等，电视剧中的冯裤子暗指的就是冯小刚，连长相都酷似。每一个人的青春都值得追忆，或甘或酸或苦，那就是青春的气息。但不是所有人的青春值得留恋，我想这类年代作品–军旅和部队大院既得利益者二代青春追忆作品—更多的是迷恋和不甘吧！_2017.9.29_\n\nResilio Sync下载密匙：**BLQ364AV4VNWGCZTBI2CKTB3G7UNERMEH**\n\n或[直接前往下载](http://zove.me/)"
		},
		{
			"post_id": 54,
			"title": "【求助】zeronet评论时签名失败",
			"date_published": 1506611163.891,
			"body": "发布新帖好像么问题，但是发布评论都不成功，提示如下：\n\n```\n内容签名失败\nInclude too large 10934B > 10000B\n```\n\n超过限额，查看了一下，限额为 <small>(限额: 9.00kB / 9.00kB)。</small>\n\n<small>这个怎么破？</small>"
		},
		{
			"post_id": 53,
			"title": "【读书】《江湖丛谈》",
			"date_published": 1506233754.95,
			"body": "**读书：**《江湖丛谈》 连阔如\n\n什么是江湖？怎么混江湖？江湖有哪些套路？....敬听连阔如播讲!\n\n这位生于大清，长在民国，成名在新中国的满族镶黄旗人，在民国时期以“云游客”为笔名，在报纸上连载《江湖丛谈》，揭露旧社会江湖的那些事。如果当时有BBS，云游客当之无愧一定是一个知名网络ID。这位云游客就是后来响当当的评书艺术家连阔如先生，生于六七十年代的人，对这个名字应该耳熟能详。\n\n* * *\n\n《江湖丛谈》 是一本很有意思的江湖揭秘之书，记录的都是作者亲身所见所闻。内容涉及五花八门，有传统文艺和杂耍，如评书杂技，相声戏法等；有街头已经消失的旧行当，如镖局；还有灰色行当，如相面、偏方卖药、江湖骗子等。\n\n这本奇书不仅记录的都是一些奇人奇事，还是一本立身江湖之道的生存指南、暗语春点手册，也是研究曲艺史、评书史、相声史、杂技史、武术史、城市游乐设施、欺骗术等，客观上具一定的认识价值和资料价值必备参考文本。[_17.9.24_](http://zove.me/#Weekly39:Weekly39%20Weekly40%20Reading%20%5B%5BReading%20Log%5D%5D)\n\nResilio Sync下载密匙：**BLQ364AV4VNWGCZTBI2CKTB3G7UNERMEH**\n\n或直接下载：[azw3](http://www.2ove.me/cloud/index.php/s/QP5Cz3hJZjlvLuK) [mobi](http://www.2ove.me/cloud/index.php/s/lKy5ntPWM83mDXM)"
		},
		{
			"post_id": 52,
			"title": "【读书】《浮生三记》",
			"date_published": 1506101847.259,
			"body": "**书名：**《浮生三记》 沈君山\n\n如果您看过清代沈复的《浮生六记》（记录与妻卿卿我我恩爱有加的笔记小品），您一定会对《浮生三记》侧目的。_17.9.20_\n\n初以为《浮生三记》也出自沈复，启书方知实乃其本家沈君山，两人相隔上百年，虽邯郸学步其先祖沈复，但绝非狗续貂尾。沈君山如沈复也为民国一大才子，与连战、钱复、陈复安（陈诚之子）同被雅称为台湾四大公子。沈君山出身名门，外祖父是最早一辈留学法国的留学生，父母均为民国留美农学博士，可谓农学世家，以她母亲命名的“骊英1号”、“骊英2号”等小麦系列影响至今。内战后随父迁入台湾，后留学美国学习物理，中年后回台任清华大学校长，晚年中风退休开始关心两岸关系和公益事业。沈君山的朋友圈可谓名人大家云集，张学良、胡适、蒋经国、吴光中、梅贻琦、金庸、钱复、许倬云、聂卫平等不一而足，这也是其文字看点之一。\n\n* * *\n\n《浮生三记》和其《浮生再记》相比，我更喜欢三记，虽然两本书都是短篇回忆录和之前发表文章合集，但是三记更多收集的是人文方面内容，例如《花莲的白灯塔》记忆其青年恋爱的激情岁月；《一着而为天下法》则是写一代围棋大师吴清源老先生的。当然也有一些评论小品，例如对电视剧《人家四月天》的座谈会，谈徐志摩和他们那代人的爱情，可窥其爱情观，摘抄以飨：\n\n> 良人者仰仗终身者，红盖头掀起来，终身便从一而终的情形再不复见，但新的婚姻有新的困扰，一个人一生大多要经过几次痛苦的抉择，几次悲欢离合。完美的爱情和完美的婚姻完全不一定能画上等号，有情人当然最好成为眷属，但不必也不一定要成眷属，婚姻的形式在改，将来也许契约的形式都会改掉，但终久是共同相处的伴侣，有灵性的伴侣，有知性的伴侣，有事业的伴侣，更有生活的伴侣。所谓生活包括柴米油盐日常相处。聪慧才情的男女，在爱情中沉湎于前两者，而婚姻的基石却往往在后两者。林徽音选择梁思成，徐志摩得到陆小曼，在爱情层面上，也许后者更“美”，更罗曼蒂克，但在婚姻层面上，成败得失是十分显然。 >真正懂得爱情的人，不只在获得，更在如何转化，失败了，如何化爱情为友情，成功结果了，也要化激情为温情，使之可长可久。当然，分手总是痛苦的，情感的伤害难免，但时间会让它痊愈，最重要是不要伤害对方的自尊，也不必伤害自己的自尊。尤其是年轻的男女，往往分不开爱情和自信。失恋的时候，最伤心的往往不是缘分已尽，而是“我真的那么差吗？”事实上，爱情是盲目的，人生一生的成败和情场一时的得失，并没有关联，只是太上何能忘情，必须分手时，一定要互相帮助，重建自信的帮助。\n\n还有记述梁思成与金岳霖及林徽因三人的关系，也破有唏嘘：\n\n> 梁思成续娶的第二位夫人林洙，写了本林徽音的传记，对这事经过有生动描述，录之于后：\n> \n> 我曾经问起过梁公，金岳霖为林徽音终生不娶的事。梁公笑了笑说:“我们住在总布胡同的时候，老金就住在我们家后院，但另有旁门出入。可能是在一九三一年，我从宝坻调查回来，徽音见到我哭丧着脸说，她苦恼极了，因为她同时爱上两个人，不知怎么办才好。她和我谈话时一点不像妻子对丈夫谈话，却像个小妹妹在请哥哥拿主意。听到这事我半天说不出话，一种无法形容的痛苦紧紧地抓住了我，我感到血液也凝固了，连呼吸都困难。但我感谢徽音，她没有把我当一个傻丈夫，她对我是坦诚和信任的。我想了一夜该怎么办？我问自己，徽音到底和我幸福还是和老金一起幸福？我把自己、老金和徽音三个人反复放在天平上衡量。我觉得尽管自己在文学艺术各方面有一定的修养，但我缺少老金那哲学家的头脑，我认为自己不如老金。于是第二天，我把想了一夜的结论告诉徽音。我说她是自由的，如果她选择了老金，祝愿他们永远幸福。我们都哭了。当徽音把我的话告诉老金时，老金的回答是：‘看来思成是真正爱你的，我不能去伤害一个真正爱你的人。我应该退出。’从那次谈话以后，我再没有和徽音谈过这件事。因为我知道老金是个说到做到的人，微音也是个诚实的人。后来事实也证明了这一点，我们三个人始终是好朋友。我自己在工作遇到难题也常去请教老金，甚至连我和徽音吵架也常要老金来‘仲裁’，因为他总是那么理性，把我们因为情绪激动而搞糊涂的问题分析得一清二楚。”\n> \n> 在《林徽音文集》中，后期的诗文常常提到金岳霖，很多全家福或朋友出游的照片里，全有老金，斜着头仰起脸非常神气的样子。林去世后，他写了副有名的挽联：“一身诗意千寻瀑，万古人间四月天。”后来金和梁的友情一直维持到文革时期，都受尽折磨，也互相激励。我们可以说，在世俗眼光里，他是“退出”了，但在更高一个层次上，他是“进去”了。_17.9.22_\n\n读回忆录的文章，总给人以娓娓之感。如读沈之同辈**黄仁宇的回忆录《黄河青山》**，如同看一部口述历史的纪录片。黄出身寻常百姓之家，在蒋介石的麾下位至上尉参谋，后弃戎从笔留学美国，成为一代历史研究名家。黄的文章字里行间虽没有沈文章透露出的贵族精英之气，但多了一份人性和历史的沧桑之感。而读沈之回忆录，别有一种清风佛面之喻，一方面因沈之经历，历经三朝三国；另外就是出身名门，国学深厚，总能在其文字里找到现代社会欠缺的一些东西。[_17.9.23_](http://zove.me/#Weekly36.7:Weekly36.7%20Reading%20%5B%5BReading%20Log%5D%5D%202017%E8%AF%BB%E4%B9%A6%E7%9B%AE%E5%BD%95-%E4%B8%8B)\n\nResilio Sync下载密匙：**BLQ364AV4VNWGCZTBI2CKTB3G7UNERMEH**\n\n或直接下载：[epub](http://www.2ove.me/cloud/index.php/s/qBIxEoI5ZLni2Ca) [mobi](http://www.2ove.me/cloud/index.php/s/aqUFGzTDPkgfvBw)"
		},
		{
			"post_id": 51,
			"title": "【读书】《维摩诘的花雨满天》",
			"date_published": 1505495714.836,
			"body": "最近间歇性烦躁，难以专心。书读的也少了，也好久没有写下三言两语。今天才又重拾心情，强迫自己静下来，开始读书。\n\n像《维摩诘的花雨满天》这样的题材，不专心是很难读进去的，恰可以治愈散漫。\n\n第二本是《敦刻尔克》，由于同名电影的原因，想先看书，再看电影，可能效果更好。\n\nResilio Sync下载密匙：**BLQ364AV4VNWGCZTBI2CKTB3G7UNERMEH**\n\n或直接下载：[《敦刻尔克》](http://www.2ove.me/cloud/index.php/s/NCFgPJYUGmmQT8E)[《维摩诘的花雨满天》](http://www.2ove.me/cloud/index.php/s/uLHZZPhplo5E9kK)[​​​​​​​](http://www.2ove.me/cloud/index.php/s/jJQbYLy14PcdSaD)"
		},
		{
			"post_id": 50,
			"title": "【读书】《汪曾祺经典文学系列》",
			"date_published": 1503991874.405,
			"body": "入秋，多事，诸事不宜，旁骛忧烦，两周合一。\n\n本周推荐**《汪曾祺经典文学系列》**\n\n读汪曾祺的文字，如身处旷野、森林和草原，这是汪曾祺的文字魅力。汪的每个字好似一棵草、一朵花、一棵树、一条小溪，微风拂过，凝成一个清新世界。在现代作家里，鲜有人达如此境界。汪生在民国，出身书香门第，39年入西南联大，师从朱自清、闻一多等大家。所以汪的文字具有深厚的中国传统文化和儒家底蕴，兼具新文化的影响。\n\nResilio Sync下载密匙：**BLQ364AV4VNWGCZTBI2CKTB3G7UNERMEH**"
		},
		{
			"post_id": 49,
			"title": "【下载】“一书一电影”Resilio Sync下载密匙变更",
			"date_published": 1502510691.524,
			"body": "由于昨晚升级Resilio Sync到2.5..7原来分享的“一书一电影”密匙变了，之前下载的朋友更换一下Key吧。\n\n一书一电影Resilio Sync下载密匙：**BLQ364AV4VNWGCZTBI2CKTB3G7UNERMEH**\n\nPs:Resilio Sync 2.5..7 破解方法谁有？分享一个。"
		},
		{
			"post_id": 48,
			"title": "【读书】《艺术的故事》",
			"date_published": 1502439000.417,
			"body": "Weekly31：7.24~7.30\n\n本周读书：《艺术的故事》\n\n**艺术的故事**\n\n世界上本没有艺术这种东西，有的只有艺术家。\n\n* * *\n\n![丢勒·画家之母肖像](https://i.loli.net/2017/08/11/598d6c12a481e.png)\n\n艺术的故事，有两个层面的理解，一个是创作艺术背后的故事；一个是艺术作品内容涵盖的故事。而贡布里希 (Sir E.H.Gombrich)这本书--《艺术的故事》主要是前者，正如第十六次再版前言所述“本书用朴素的语言重新讲述美术发展史，应该让读者能够看出它是怎样前后连贯，帮助读者鉴赏艺术作品；不是求助于热情奔放的叙述去实现这个目标，而是给读者一些启示，说明艺术家可能怀有的创作意图。”至于后者，由于出于对西方艺术（尤其是绘画艺术）的喜欢，加上对绘画内容所载内容--尤其多的是希腊或罗马神话--不成系统的了解，所以企图从西方艺术作品入手，一方面熟识其作品，一方面梳理西方神话系列， 写过不少小文，赏析作品，揭示故事，也算是艺术的故事吧，不过我整理为“艺术与历史”系列 ([前往阅读](https://mp.weixin.qq.com/s?__biz=MjM5NjY1MDg4MA==&mid=110000120&idx=1&sn=bce3461e4c5ac8c2cc8fcdf7fd439023&chksm=259cdd1712eb5401f225a4d0ab1594de19a064c498b00af677e4cf458cb05d056a110eb0f776#rd))。\n\n贡布里希 (Sir E.H.Gombrich)在整理收纳入《艺术的故事》的艺术作品，遵循三个原则：一，凡是不能用插图复印出来的作品概不论述；二、本书中论述真正的艺术作品，排除一切只作为一种趣味或时尚的标本看待才可能有些意思的作品；三、作者力求自我克制，发誓要在选择作品时不被个人的独家观念所诱惑，以免人所共知的杰作被我个人偏爱的作品排挤下去。正是作者对艺术作品严格的筛选标准，《艺术的故事》已经再版多大十几次，成为奉献给那些需要对一个陌生而迷人的领域略知门径的读者欣赏指南。正如作者所言:\n\n> 本书可以向初学者展示事实状况，而不让繁枝细节干扰思路；可以帮助初学者充实学力，以便把目标更高的著作中一页页不计其数的姓名、时期和风格理出清楚的头绪，为参考更专门的书籍打下基础。编写本书时，我首先想到的对象是刚刚独自发现了这个艺术世界的少年读者。”\n\n书中鲜有涉及中国艺术，而作者给出的原因是，中国的艺术有更多的时间去追求雅致和微妙，因为公众并不那么急于要求看到出人意表的新奇之作。而西方艺术的故事就是无休无止的实验的故事，就是追求前所未见的新颖和独创效果的故事。事实也是如此，中国的一些艺术手法基本上是一脉相承，几年来很少在术的方面有所改变。\n\n**[下载地址](http://127.0.0.1:43110/184n4WAqGeBBP8dUnBa74hPLJsCNWcQy9N/?Post:9:Reading+Log+Books+Download)：**\n\n这里是每周[Reading Log](http://www.2ove.me/#Reading%20Log)提及到的书籍分享下载。使用的是[BTSync](https://kindlefere.com/post/347.html)分布式分发下载。\n\n**说明：**每周会删除上周分享，请及时下载。每次不超过5本书。\n\n下载密匙：BLQ364AV4VNWGCZTBI2CKTB3G7UNERMEH\n\n[下载地址](https://link.resilio.com/#f=Reading%20Log%20Books&sz=0&t=1&s=AKDRUN3Z5JSFO3UGASAOFHRMPWZE7JIZ&i=CUPUJKJGTSLOTOME52T3H6NEIMLQSZGRL&v=2.5)"
		},
		{
			"post_id": 47,
			"title": "【分享】Streisand，翻墙界的瑞士军刀",
			"date_published": 1502248241.366,
			"body": "**Streisand**，这个项目太厉害了,一次性搭建，支持: L2TP/IPsec, OpenConnect, OpenSSH, OpenVPN, Shadowsocks, sslh, Stunnel, a Tor bridge, and WireGuard.\n\n项目地址：[github.com/jlund/streisand](https://t.co/7WfD6d1QF8)"
		},
		{
			"post_id": 46,
			"title": "【读书】硅谷钢铁侠",
			"date_published": 1501207229.042,
			"body": "> 所有的颠覆式创新都不是敲锣打鼓来的，而是隐藏在一片噪声里。它是代表未来趋势的一个信号，但你却通常看不到、看不懂、看不清。所以，一定不能以一种藐视的态度看待新生事物。它可能满身缺点，你用自己的优点比它的缺点，基本上你会全胜。但是，颠覆你的这个东西，不需要做成十项全能，它只要在一个点上追求极致，做得远远超过你，这就足够了。\n\n---《特斯拉之父：埃隆·马斯克传 》(竹内一正)\n\n* * *\n\n> 我发现每个人都能举出一项马斯克用来让员工如期完成任务的管理技巧。以布罗根为例，通常由经理为员工设置完成期限，而马斯克则引导他的工程师们自己掌控交付日期。“他不会说，你必须在周五下午2点前完成这项任务。他会说，‘我需要这项艰巨的任务在周五下午2点前完成，你能做到吗？’”布罗根说道，“然后，如果你说了‘能做到’，那么你勤奋工作的原因就不再是因为他的要求，而是为了你自己。这是一个你可以感受到的区别。你为自己的工作写下了保证书。”\n> ......\n> 他不怎么在乎对方是否可以给出正确答案，他更关注他们描述问题的方式和解决问题的方法。\n> \n> SpaceX的做事原则是全情投入你的工作并把事情搞定。等待指导或详细指示的人将会举步维艰。习惯得到反馈意见的员工也是一样。而最严重的错误，就是告诉马斯克他的要求是无法实现的。\n> \n> 有时候，马斯克会拒绝购买一个2 000美元的配件，因为他期待你能够找到更便宜的配件或者自己发明出更省钱的方法。但他又可以不惜花费花9万美元租用一架飞机将东西送往夸贾林环礁，因为这样做可以节省一整天的工作时间。\n> \n> 埃隆对于没有达到他标准的员工也一样苛刻。“他总是说，‘如果你想解雇某人，就应该马上解雇，否则只会浪费彼此的时间。’”\n> \n> 有一个员工因为孩子出生而错过了一场活动。马斯克马上发来一封连珠炮似的邮件：“这不是借口。我感到非常失望。你需要弄清楚，什么对你来说更重要。我们正在改变世界、改变历史，如果你不打算全力以赴，那你就别干了。”\n> \n> 马斯克曾用“吞着玻璃同时凝视深渊”来描述自己的创业生活....\n> \n> 当扎克伯格希望帮助你分享宝宝照片的时候，马斯克则是希望将人类从自我毁灭和意外灾难中拯救出来。\n> \n> 硅谷精神的人——如快速行动、在组织内部废除官僚等级制度，并且持续改进那些梦幻般的机器，追逐我们错失的那些真正具有突破性的成就。\n> \n> “我们想要会飞的汽车，而不是140个字符。”\n> \n> “我们这代人中最聪明的大脑都在思考如何让人们点击广告，”Facebook早期工程师杰夫·汉默巴彻(Jeff Hammerbacher)对我说，“这太糟糕了。”硅谷越来越像好莱坞。与此同时，那些消费者已逐渐转向内心世界，醉心于自己的虚拟人生。\n\n---《硅谷钢铁侠》 （美）阿什利·万斯)"
		},
		{
			"post_id": 45,
			"title": "【分享】Resilio Sync翻墙方案 — 解决无法获得追踪器列表等问题",
			"date_published": 1500998069.254,
			"body": "本方案适用于Resilio Sync 2.4、2.5系列，其他版本未经测试，但应当可用。\n\n前往[这里查看](https://medium.com/@dawnray/resilio-sync%E7%BF%BB%E5%A2%99%E6%96%B9%E6%A1%88-d6f0551fec48)"
		},
		{
			"post_id": 44,
			"title": "【读书】《蒋介石与现代中国的奋斗》",
			"date_published": 1500869588.227,
			"body": "Weekly30：7.17~7.23\n\n本周读书：**《蒋介石与现代中国的奋斗》**\n\n**“那个丢掉中国的人”**\n\n我不是蒋介石的拥趸。这可能受两方面影响，一是受红色意识流污染；二是因为上一条原因，对近现代政治历史厌恶性排斥。而之于蒋，可能是“敌人“的敌人即朋友的心理，对之充满兴趣，所以时不时的总会读一些关于蒋介石的稗官野史。 《蒋介石与现代中国的奋斗》非野史，本书作者乃哈佛学者、前美国驻华外交官陶涵（Jay Taylor），他通过研究近年公开的蒋介石日记以及一些罕见档案，以第三方视角还原了那个风雷激荡的年代一个有血有肉凡人蒋介石。“ 透过蒋介石日记的慎选引用，陶涵成功表露蒋介石的个人特质…….日记引文搭配上重大政治、军事局势的生动细述，他让我们更贴近这些还在成形的思考。因此某种程度上，陶涵在蒋介石与他置身的世界之间建构了更具个人感性的连结。 ”(史景迁评)。我想他的著作公允程度应该比红色区出版物要高。本次介绍的版本非大陆版本。中信出版社将此书引进后，从名字就开始阉割–《蒋介石与现代中国》，内文也不知道删减了多少。像之前我在Zeroblog上摘录的章节，一定不会出现在大陆版本上的。如关于抗日战争的记述：\n\n* * *\n\n> 一九四零年一月，周恩来给斯大林的秘密报告提到，中国有百万以上的士兵伤亡或受伤，其中八路军伤亡仅有三万人，新四军则为一千人，换句话说，抗战打了两年多，中共在整个伤亡人数中只占百分之三。\n> 德国入侵苏联当天，共产国际发紧急指令给中国，告诉他们，其最迫切任务是坚持和国民党合作抗日，如果日本攻打苏联，要以军事行动摧毁日本人在华交通运输线，否则，针对中国境内的日本侵略者的武力行为，不宜由中共发动。这也暗示要尽一切可能去怂恿美国对付德日。\n> 根据共产国际一九四四年十二月的一份报告，直到当时抗战已进行七年半，中共八路军仅有十万三千一百八十六人阵亡，以游击战为主的中共新四军极可能只折损数千人；但是政府军死者逾一百万人。换句话说，从周恩来一九四〇年一月给共产国际的报告，至一九四四年十二月此一报告之间——这段期间是史迪威等人坚称中共承担抗战主要负担而国军并无作为的时间——中共只有约七万名士兵牺牲性命。\n> 中共在“极罕发布的伤亡数字”中透露，从一九四七年三月至五月，“损失”十一万六千人，其中大多在东北地区。\n\n关于孙中山的描述：\n\n> 孙中山“二次革命”失败后狼狈地逃赴日本，追随孙中山东渡的人士当中有一位生意人宋耀如，是孙中山的重要金主，其长女宋蔼龄担任孙的英文秘书，有一天孙中山向宋耀如透露心意，想向宋蔼龄求婚，宋耀如大吃一惊，当下就拒绝了这本亲事，几个月后，宋蔼龄嫁给了孔祥熙。接替宋蔼龄秘书工作，服务革命领袖的，是二十一岁的妹妹宋庆龄，她比姐姐更苗条、美丽，孙中山立刻又爱上了妹妹，而宋庆龄对于这位比她大二十六岁的长官的感情纯粹是政治、精神上的崇拜敬爱。此时，宋耀如可能感觉孙中山又喜欢上了他的二女儿，决定全家回上海。回国之后，宋庆龄悄悄寄了一封信给孙，孙回信说，他在东京迫切需要她的协助。一天夜里，在家里女佣人的帮助下，宋庆龄爬窗、沿扶梯逃出家，旋即搭船去日本，孙中山在东京迎接她，并向她求婚，这一年，宋才二十出头，孙已经四十八岁。因为这件婚事，宋耀如宣布与女儿断绝关系，发誓再也不跟孙中山往来。\n\n来源：[http://www.2ove.me/](http://www.2ove.me/)\n\n* * *\n\n**[下载地址](http://127.0.0.1:43110/184n4WAqGeBBP8dUnBa74hPLJsCNWcQy9N/?Post:9:Reading+Log+Books+Download)：**\n\n这里是每周[Reading Log](http://www.2ove.me/#Reading%20Log)提及到的书籍分享下载。使用的是[BTSync](https://kindlefere.com/post/347.html)分布式分发下载。\n\n**说明：**每周会删除上周分享，请及时下载。每次不超过5本书。\n\n下载密匙：BLQ364AV4VNWGCZTBI2CKTB3G7UNERMEH\n\n[下载地址](https://link.resilio.com/#f=Reading%20Log%20Books&sz=0&t=1&s=AKDRUN3Z5JSFO3UGASAOFHRMPWZE7JIZ&i=CUPUJKJGTSLOTOME52T3H6NEIMLQSZGRL&v=2.5)"
		},
		{
			"post_id": 43,
			"title": "【读书】“思想的二道贩子”的公共知识分子",
			"date_published": 1500782079.222,
			"body": "> 德雷兹纳的论点是，思想领袖的时代取代 了公共知识分子的时代。在最糟糕的情况下， 公共知识分子是“思想的二道贩子”。在最好的 情况下，他们毙掉坏思想并且“揭穿那些伪装 成共识的错误思想”。公共知识分子是江湖骗子 的天敌。相比之下，思想领袖就像是伯林口中 的刺猬。他们懂一样东西，反复兜售，至死方休。\n\n评丹尼尔·德雷兹纳所著《思想产业》"
		},
		{
			"post_id": 42,
			"title": "日军用河南话教材",
			"date_published": 1500598752.45,
			"body": "![DCff14bU0AAGhm9.jpg](https://i.loli.net/2017/07/21/59715284b639e.jpg)\n\n* * *\n\n![3434.jpg](https://i.loli.net/2017/07/21/5971522ee657a.jpg)\n![snipaste_20170721_085832.jpg](https://i.loli.net/2017/07/21/597152fbca68b.jpg)"
		},
		{
			"post_id": 41,
			"title": "Weekly 29：Reading Log",
			"date_published": 1500424126.776,
			"body": "Weekly29：7.10~7.16\n\n本周读书：《十一种孤独》 (理查德·耶茨作品系列)\n\n> 世界上的最孤独，就是被世界遗忘，死一样的遗忘。\n\n* * *\n\n理查德·耶茨就是“被遗忘的最优秀的美国作家“（《泰晤士报》）。这个深受海明威影响，而投入生活的洪流体验生活，企图成为一名伟大的作家的二战士兵，被文学史长期进行着不公正的对待。投笔从戎，而文坛不顺，长期投稿被拒，又被老婆孩子弃之而去。唯一陪伴理查德·耶茨的只有酒和香烟。“他坐在租来的房间里，不停地抽烟，不停地咳嗽，不停地写，一篇又一篇，但都不成功，《纽约客》拒绝了他的每一篇投稿 。”\n\n“生命的最后十年，他的健康状况极度恶化，由于肺结核，他呼吸困难，不停地咳嗽、气喘，但他仍抽烟抽得像在烧炉子，即使在最后一年里他得借助氧气面罩来呼吸时，抽烟也没中断过。喝酒是他又一个狂热的嗜好，美国文学史与酒的关系异乎寻常地密切（福克纳、菲茨杰拉德、哈特·克雷恩、海明威、伯里曼、契弗），但没有几个作家能像耶茨那样全身心投入酒精之中。他白天不喝酒，他要写作，一到晚上却总是烂醉如泥，不醒人事。”\n\n这个美国底层出身的伟大作家，一生就这么孤单的用生命在写作，直到最后把身体完全透支，蜡烛成灰。 正如这个早期在美国文学史微不足道的小人物–理查德·耶茨-一样，他的作品里到处充满了小人物的悲天悯人和小人物的孤独。今天推荐的这本书《十一种孤独》，全书十一个短篇，十一个小人物，十一种孤独。孤独各异，殊途同归。也如他本人所说的：“**如果说我的作品有一个主题，我怀疑这个主题并不复杂，那就是绝大多数人都生活在一种无法逃脱的孤独中，他们的悲剧也在于此。”**\n\n芸芸众生，各有孤独，理查德·耶茨用一生的笔墨书写着如他一样的小人物的悲剧人生。\n\n[**下载地址**](/184n4WAqGeBBP8dUnBa74hPLJsCNWcQy9N/?Post:9:Reading+Log+Books+Download)\n\n这里是每周[Reading Log](http://www.2ove.me/#Reading%20Log)提及到的书籍分享下载。使用的是[BTSync](https://kindlefere.com/post/347.html)分布式分发下载。\n\n**说明：**每周会删除上周分享，请及时下载。每次不超过5本书。\n\n**密匙：** `EVG6QH23FIIE6T4JCAKXVLQFI2VP6VZWAURBP3ALEYSPKVSR77DODJXN6UY`"
		},
		{
			"post_id": 40,
			"title": "【读书】以色列的悲情与荣耀-1",
			"date_published": 1500268900.657,
			"body": "当他们回到家里，母亲欢迎他们，就好像他们死后复活一样。几分钟后，有人敲门。两个士兵站在那儿，大声叫嚷道：“Yallah，Yallah。收拾你们的东西，赶紧离开！去阿卜杜拉国王（King Abdullah）那儿，去约旦！”其中一个士兵敏感而羞涩，显然，他并不喜欢现在正在做的事情。但另一个留着薄薄一层胡须的士兵，非常享受现下的每一分钟。\n\n* * *\n\n父亲从口袋里取出一封希伯来语书写的信件，在信中莱曼医生为他正派的阿拉伯朋友做担保，希望这位贝谢门的朋友不要受到伤害。但大胡子的士兵一点都不在意。他把信一丢，用他的枪口抵着父亲的胸口，说道：“如果你不马上滚蛋，我就开枪。快滚去阿卜杜拉那里。” 母亲哭起来，她以为父亲就要被开枪打死。而父亲一句话都说不出来，他陷入了震惊中。他低着头，叫母亲赶紧收拾所有能带走的东西。然后去召集祖母、三个姑姑，和他的两个儿子。在两名犹太士兵的枪口下，阿布·哈曼德家族匆忙地收拾行李：面粉、大米、白糖、珠宝、床褥。他们将行李装上马车，又帮助半瞎的祖母跨上驴子。 最令奥特曼感到耻辱的，就是在吕大市郊的检查站，那些士兵对女人进行搜身。一个士兵拿走了奥特曼身上的现金，另一个取走了他的手表。犹太士兵的黄麻袋里，迅速地装填着项链、耳环、银器和金器。而女人们——不论老少——所遭受的羞辱证实了他们所有人现在是多么屈辱。 奥特曼牵着马的缰绳，他的父亲在后面推着马车。道路非常狭窄，拥挤得令人不堪忍受。孩子们大声叫嚷，女人在尖叫，男人们在流泪。有人说一个母亲丢失了她的男婴，又有人说一个母亲遗弃了她的女婴。一辆犹太人的吉普车不知从哪儿冒了出来，车上的士兵吹响了号角，催促人们向前，向前。犹太士兵在他们头顶上鸣枪。不能停步，不能往回走，不能向后看。 在匆忙中，人们急于携带面粉和大米，而不是水。所以，现在没有水，而酷热令人难以忍受。镇外，一个人跌落到井里，当他被拉上来时，人们吸吮他的湿衣服。人们吸吮野地里找到的西瓜，茄子，任何含有水分的东西，只要能暂时缓解他们兽性的干渴。大部分女人都穿着传统的黑色长袍，头上顶着麻袋。一些男人穿着传统的阿拉伯长袍，一些穿着优质的欧式西服。时不时有家庭退出队伍，在路边停下来——埋葬因酷热而夭折的婴孩，向因疲劳而倒下的老祖母做最后告别。不一会儿，情况变得更加糟糕。一个母亲把她哭号的婴儿丢弃在树下。奥特曼的堂姐把她的孩子遗弃在另一棵树下——她再也受不了一周大的婴儿发出的饥饿的哭号。但奥特曼的父亲命令她回去树下把孩子带回来。尽管，父亲也是绝望的。他看起来都快失去理智。他一边推着沉重的马车，一边诅咒犹太人，诅咒阿拉伯人，诅咒上帝。 在距离贝谢门不远的地方，发生了一起意外。一群穿着制服的犹太人站在两辆指挥车旁，注视着这支队伍。其中一个人大声叫着父亲的名字。父亲抬起眼皮，走向那位指挥官。贝谢门的毕业生，以及贝谢门的蔬菜供应商，面对面地站在夏季的田野里，两人沉默无言。最后，那位指挥官说父亲可以留下。父亲说如果他留下，他将被视为叛徒，会被处死。指挥官返回指挥车，带下一罐子（jerry can）[14]的水，搬至父亲的马车上。指挥官看着父亲把水喂给他的母亲，他的妻子，他的弟媳，他的儿子；看着父亲拉着他的家族马车，重新加入队伍，一直向东。\n\n_摘自《我的应许之地：以色列的悲情与荣耀》_"
		},
		{
			"post_id": 39,
			"title": "信念、勇气、行动和牺牲",
			"date_published": 1499993602.869,
			"body": "> 心无挂碍，无挂碍故，无有恐怖，远离颠倒梦想，究竟涅槃。\n\n![悼念刘晓波](https://i.loli.net/2017/07/14/59681757b7b88.jpg \"刘晓波\")"
		},
		{
			"post_id": 38,
			"title": "【推荐】超好用截图取色软件 Snipaste",
			"date_published": 1499907985.411,
			"body": "> Snipaste 是一个简单但强大的截图工具，也可以让你将截图贴回到屏幕上！下载并打开 Snipaste，按下 `F1` 来开始截图，再按 `F3`，截图就在桌面置顶显示了。就这么简单！\n\n你还可以将剪贴板里的文字或者颜色信息转化为图片窗口，并且将它们进行缩放、旋转、翻转、设为半透明，甚至让鼠标能穿透它们！如果你是程序员、设计师，或者是大部分工作时间都在电脑前，贴图功能将改变你的工作方式、提升工作效率。\n\nSnipaste 是免费软件，它也很安全，没有广告、不会扫描你的硬盘、更不会上传用户数据，它只做它应该做的事。\n\n官方地址：[https://zh.snipaste.com/](https://zh.snipaste.com/)"
		},
		{
			"post_id": 37,
			"title": "【阅读】赫拉利：人类真正的优势是可以进行大规模、灵活的合作",
			"date_published": 1499850994.09,
			"body": "Q：在地球的历史中，智人所扮演的角色可能并没有我们想象的那么重要。在我们之前，其他物种曾经占领过地球。在我们之后，也可能会有其他物种取代我们。你认为智人与其他物种相比，最为独特的是什么？和你刚提到的虚构能力有关吗？\n\nA：是的。和之前的物种相比，人类当然有独特之处，但这种独特并非大多数人想象的那样。我们经常会观察自己和其他动物，比如黑猩猩的不同。\n\n**如果把一个人与一个黑猩猩，或者十个人与十个黑猩猩丢到竞技场里，最后能生存下来的肯定是黑猩猩。然而如果是一千个人与一千个黑猩猩 PK，最终的赢家必然是人类。人类真正的优势是可以进行大规模、灵活的合作。**\n\n* * *\n\n蚂蚁和蜜蜂可以大规模合作，但它们的合作模式非常固定。黑猩猩和狼也可以灵活地合作，但只限于小型的群体，彼此互相了解。把 10 万个黑猩猩扔到华尔街，天下大乱。但换做是 10 万个人，我们就有了交易网络。这就是为什么人类征服了地球，而黑猩猩被关在动物园和实验室里。\n\n既大规模又灵活的合作，只有人类可以做到。是什么让我们做到这一点？答案是我们的想象力。人类的天性中，并没有倾向于大规模合作的本能。我们之所以与陌生人合作，是因为只有这样，我们才能使那些存在于大脑中的虚构体，比如神、国家、金钱、人权等概念，扩散给上百万的人。**当这么多人都相信同一个故事时，他们就会遵循一样的法则。**\n\n黑猩猩做不到这一点。你不可能告诉它们：“给我一只香蕉，你死后就能上天堂，并可以享用无数的香蕉。” 只有人类可以创造、相信这样的故事。如此我们才可以统治世界。\n\n对于未来，我们还不知道在智人之后会是什么物种统治地球。一旦生化科技、 AI 可以改造身体与大脑，我们的欲望、偏好就可能会改变。我们可以预测像自己一般的人类将如何使用生化科技，却无法预测与我们不同的物种会如何对待科技工具。\n\n_摘自《人类简史》《未来简史》作者尤瓦尔·赫拉利采访录_"
		},
		{
			"post_id": 36,
			"title": "【读书】抗日战争中共到底死亡了多少人？",
			"date_published": 1499826338.664,
			"body": "　　一九四零年一月，周恩来给斯大林的秘密报告提到，中国有百万以上的士兵伤亡或受伤，其中八路军伤亡仅有三万人，新四军则为一千人，换句话说，抗战打了两年多，中共在整个伤亡人数中只占百分之三。\n\n　　德国入侵苏联当天，共产国际发紧急指令给中国，告诉他们，其最迫切任务是坚持和国民党合作抗日，如果日本攻打苏联，要以军事行动摧毁日本人在华交通运输线，否则，针对中国境内的日本侵略者的武力行为，不宜由中共发动。这也暗示要尽一切可能去怂恿美国对付德日。\n\n　　根据共产国际一九四四年十二月的一份报告，直到当时抗战已进行七年半，中共八路军仅有十万三千一百八十六人阵亡，以游击战为主的中共新四军极可能只折损数千人；但是政府军死者逾一百万人。换句话说，从周恩来一九四〇年一月给共产国际的报告，至一九四四年十二月此一报告之间——这段期间是史迪威等人坚称中共承担抗战主要负担而国军并无作为的时间——中共只有约七万名士兵牺牲性命。\n\n　　中共在“极罕发布的伤亡数字”中透露，从一九四七年三月至五月，“损失”十一万六千人，其中大多在东北地区。\n\n_摘自《蒋介石与现代中国》_"
		},
		{
			"post_id": 35,
			"title": "无名英雄纪念广场碑文",
			"date_published": 1499752794.859,
			"body": "北京无名英雄纪念广场， 纪念上世纪五十年代为国家统一、人民解放事业牺牲于台湾的大批隐蔽战线无名英雄而建。 主碑文这样写道：\n\n> 天下有大勇者，智不能测，刚不能制，猝然临之而不惊，无朕加之而不怒，此其志甚远，所怀甚大也。所怀者何？天下有饥者，如己之饥；天下有溺者，如己之溺耳。民族危急，别亲离子而赴水火，易面事敌而求大同。风萧水寒，旌霜履血，或成或败，或囚或殁，人不知之，乃至陨后无名。 铭曰：呜呼！大音希声，大象无形。来兮精魄，安兮英灵。长河为咽，青山为证；岂曰无声？河山即名！ 人有所忘，史有所轻。一统可期，民族将兴。肃之嘉石，沐手勒铭。噫我子孙，代代永旌。"
		},
		{
			"post_id": 34,
			"title": "【阅读】赫拉利：分辨什么是虚构和现实最好办法是痛苦 （suffering）",
			"date_published": 1499665388.612,
			"body": "Q:你在《人类简史》这本书中提到的最重要的一个概念就是 “虚构故事”（fiction），智人得以区别于其它人种的关键正是虚构故事的能力，而智人社会正是建立于共同信仰的虚构之上。你对虚构的定义也与大多数人理解的不太一样，不仅局限于宗教信仰，更涵盖了从金钱到政府的现代社会中诸多常见概念。这一理论是从何而来？ 如你所说，虚构在智人演化史上已成为不可或缺的一环，那么如果历史可以重来，或者存在另一个平行宇宙，你认为虚构还有如此的重要性么？\n\nA：我对于虚构的理解基于科学研究，同时也受到冥想的影响。冥想使我能够区分现实和人类大脑建构出的虚幻故事。不过我想强调的是，虚构对于所有人类社会来说都是至关重要的。\n\n* * *\n\n如果没有那些长期信念 —— 比如人类对于天堂的观点 —— 很难想象大规模的人类社会如何能运转起来。我们应该保留那些有用的虚构，同时学会区分虚幻与现实。在历史长河的大多数时间里，人们已经太过习惯于虚幻的故事，比如国家、比如神、比如金钱，以至于无法分辨出真正的现实。\n\n生活于公元前三千年的埃及人，在法老陵寝上刻下了太阳神——拉。\n\n**如何分辨什么是虚构，什么又是真实的现实？最好的测试是痛苦 （suffering）。如果你想知道一件事是否是真的，问问自己：“它会感到痛苦么？”**\n\n宙斯的神庙被烧毁的时候，宙斯没有遭受痛苦。银行破产的时候，银行没有遭受痛苦。国家在战争中受挫时，国家并没有遭受痛苦，真正遭受痛苦的是国民。投资者在股灾中失去所有财富的时候，他遭受了痛苦。母牛被迫与其新生的幼崽分离的时候，它遭受了痛苦。这才是现实。\n\n**痛苦也可能来源于我们对虚构的信仰。**比如，对于某一国家或宗教的信仰可能引发战争，而战争的结果是不计其数的家破人亡。战争的原因是虚构的，但痛苦是 100% 真实的。这也是为什么我们需要努力分辨哪些是虚构的故事，哪些是真实的现实。\n\n虚构故事很关键。如果没有诸如金钱、国家、公司等等人类虚构出的故事与规则的话，复杂的人类社会肯定无法运转。然而这些故事都只是工具而已。不要让这些工具成为我们的目标或尺度。如果我们忘记这是虚构故事的话，我们也会看不清现实。\n\n_摘自《人类简史》《未来简史》作者尤瓦尔·赫拉利采访录_"
		},
		{
			"post_id": 33,
			"title": "【读书】丁玲自述，我在秦城监狱的生活-2",
			"date_published": 1499568987.253,
			"body": "这是一所现代化的高级监狱，都是单人牢房，我那间牢房大约有个十平方米多一点吧，窗户很高，贴近天花板，窗上有铁栏杆，一个单人床铺，很低，离地只有一尺多高，直放在窗下一边靠墙的地方。另一边靠门的角落里设置洗脸池和抽水马桶。设计得很好，从门上的窥视孔，看守可以看到坐在马桶上的人的小腿和脚，知道人是坐在马桶上，但是却看不到人的身体。墙是隔音的，听不到隔壁的声音。\n\n一日三餐，伙食不错，以我的情况来说，与在农场时相比，简直是太好了。后来听看守说，伙食标准一月约四十块钱，中灶。如此看来，还有吃得更好的，吃小灶的。但这里绝非“修养所”，以“不老实交代”为由，随时都可以给你吃窝窝头，加点咸菜，以示惩罚。到秦城以后，我的身体慢慢地恢复了过来。\n\n* * *\n\n一个星期可以洗一次澡，单独押去，单独的洗，在洗澡间也见不到其他的人。我在农场没有洗澡的机会，洗了四五次，身上才洗干净。\n\n房间里的电灯两种颜色，白色和紫色，开关都在走廊上，睡觉时看守就在外边关掉白色的，打开紫色的。规定睡觉必须脸朝外，看守好看清你的状况。但是人睡觉，睡着了，侧着身睡，一边睡麻木了，就会自然地翻身朝另一边侧着睡，这样就面向墙了。房里有个电铃，按钮在外边，这时看守就在外边按电铃，叫你朝外睡。一晚上不知道要给这样地吵醒多少次。这就是折磨，你说他体罚，他没有动手，但是是有意的折磨，慢性地、长期的折磨你。我后来想了个应对的办法，就是要翻身时，就掉一个头睡，既翻了身，脸也朝了外，结果稍微好些。\n\n门上有一个小门，离地板就门槛那么高，送饭、菜时就打开，从那里递进来，我感到屈辱，喂狗才这样。\n\n囚服是黑颜色的，我现在很厌恶这个颜色，以后再也不穿黑颜色的衣服了（的确，母亲从秦城出来直到去世，都没有穿过黑颜色的衣服）。\n\n没有纸，写“交代”材料的纸，编了号，发下来几张，按数收走几张。\n\n有《人民日报》看，这个星期的报是当天的，下个星期的报是前一天的，再下个星期是前两天的，再往下又是当天的。我摸出了规律，得出：三个人一份报。《红旗》杂志也是放几天就拿走，从时间上算，也是三个人一份。（有文说，她把报纸边上的空白纸，偷偷裁下来写文章。那不是事实，纯属臆想。三人一份报，每天由看守转来转去，检查严格，怎么能偷偷裁下空白纸？我从未听母亲这样说过）。\n\n在监狱里面，与世隔绝。要了解外边的情况，就只有通过报纸，所以看得很仔细。（通过报纸，在1971年国庆节时，她说她她已经觉察到林彪出事了）。\n\n每天可以放风一小时，一个个小院子，四周是高墙，墙上有哨兵，单独一个人在院子里放风，安排得非常周密，去、回，都遇不见别的人。\n\n要我写交代材料。写南京那段历史的材料交了上去，当然其中写到姚蓬子，他是负有看守我的责任的。第二天，负责我的案子的人，指着材料上姚蓬子的名字，说：“不许写无产阶级司令部的人的亲属” 叫我重写。我想，这样写出来的“材料”，叫材料吗？真是“一人得道，鸡犬升天”呀！\n\n长久的单独囚禁是对人的最大折磨。除了审问之外，没有人同你说话，没有思想交流。久而久之，思想就迟钝了、语言就出现障碍，说不出话来。我为了防止这种状况出现，就天天朗读，朗读毛主席的语录，朗读马克思、恩格斯的著作，也背诵唐诗、宋词。（我问她，当时唐诗、宋词被认为是“封、资、修”，看守没有阻止你？她说，倒没有，或许她们没有听见，或许她们没文化，听不出我在背诵什么。）\n\n为了锻炼体力，我就把草纸揉成团，每天做运动，把纸团抛向墙壁，纸团落到地上，检起再抛，周而复始。\n\n那几年间，我住过两次医院，都是在复兴医院。病房在楼顶上，同别的病人分开，也是单间，门口有守卫。（1979年她搬进复外大街22号楼，南边的窗户就正对着复兴医院，她还指给我看她那时住过的病房哩！）\n\n刚进来的一年，审问，写材料还比较多，后来就很少了。这时可以借马、恩、列、斯的著作，我就安下心来，读他们的著作。\n\n_摘自《丁玲传》_"
		},
		{
			"post_id": 32,
			"title": "【读书】丁玲自述，我在秦城监狱的生活",
			"date_published": 1499499731.109,
			"body": "1970年3月的一个深夜，我被叫醒，被戴上手铐，带到农场场部大楼，呆了一小会儿，就被押上一辆吉普车，前后还有好几部，天蒙蒙亮的时候开到鹤岗车站。那里停了一个专列，两个车厢。周围好多解放军战士站着岗，车上车下总有十几二十个人吧！我被押上一个车厢，进了四五间包房中的一间。车厢里有一个大会客室，设置着沙发。但我只能往那边望望，我只准呆在自己的房间里，三个女战士看守着我。那节车厢就同1948年妇女代表团出国乘的专列的车厢差不多，只是现已陈旧。见这排场和气势，我顿时想，怎么这么大动干戈的，我好似成了一个了不起的大要犯了。\n\n在给我戴上手铐的那一刹那，我心里竟然萌发出：“这下可得救了”。我的身体实在忍受不住在二十一队的那种折磨，瘦到只剩九十几斤，我虽然有坚强的意志，但很担心自己的身体熬不过来。我想，进了监狱，监狱里总讲点法律，有点规章，总会好点，人身安全能有保障。\n\n* * *\n\n车窗蒙得严严实实的，但是从阳光的照射，我看出是往南走，我明白了是押往北京。\n\n到北京是夜晚，一部轿车在站台上就停在火车车厢门口，一下车厢，就进入轿车。开动时，前面一部，后面一部，我这部车在当中，我身旁一边坐着一个女战士。车开到天安门，我心想，几年不见了，看看天安门现在是个什么样子，刚刚抬头，身旁的女战士就喝道：“低头，不准东张西望。”总算是看了一眼。后来车外就暗了，我知道到了郊区，开了差不多两小时，到了秦城监狱。\n\n我不知道叔叔（陈明）也同我一起押到北京，一同关在秦城监狱，五年后到了嶂头，才知道原来是关在一处的，我原以为他一直都在农场呢。可是叔叔早就知道，当他也被押到鹤岗车站时，他见车上有两个女兵朝他这边望，他明白了，我就在这列车上。农场两年，秦城监狱五年，我同他分开了七年。\n\n_摘自《丁玲传》_\n\n（待续）"
		},
		{
			"post_id": 31,
			"title": "【读书】罗素：如何避免愚蠢的见识",
			"date_published": 1499420758.415,
			"body": "怀有各种各样愚蠢的见识乃是人类的通病。要想避免这种通病，并不需要超人的天才。下面提供的几项简单原则，虽然不能保证你不犯任何错误，却可以保证你避免一些可笑的错误。\n\n如果一个问题但凭观察就可以解决的话，就请您亲自观察一番。亚里士多德误以为妇女牙齿的数目比男人少。这种错误，他本来是可以避免的，而且办法很简单。他只消请他的夫人把嘴张开亲自数一数就行了。但他却没有这样做，原因是他自以为是。自以为知道而实际上自己并不知道；这是我们人人都容易犯的一种致命错误。我自己就以为刺猬好吃油虫，理由无非是我听人这么讲过；但是如果我真的要动手动脚写一部介绍刺猬习性的著作，我就不应该妄下断语，除非我亲自看见一只刺猬享用这种并不可口的美餐。然而亚里士多德却不够谨慎。古代和中古时代的著作家谈起麒麟和火蛇来头头是道；但是他们当中的谁也没有觉得，既然如此自己从未见过任何麒麟和火蛇，那就必须避免武断。\n\n* * *\n\n许多事情不那么容易用经验加以检验。如果你像大多数人一样在许多这类事情上有颇为激烈的主张，也有一些办法可以帮你认识自己的偏见。**如果你一听到一种与你相左的意见就发怒，这就表明，你已经下意识地感觉到你那种看法没有充分理由。**如果某个人硬要说2加2等于5，或者说冰岛位于赤道，你就只会感到怜悯而不是愤怒，除非你自己对数学和地理也是这样无知，因而他的看法竟然动摇了你的相反的见解。**最激烈的争论是关于双方都提不出充分证据的那些问题的争论。**迫害见于神学领域而不见于数学领域，因为数学问题是知识问题，而神学问题则仅是见解问题。所以，**不论什么时候，只要发现自己对不同的意见发起火来，你就要小心，因为一经检查，你大概就会发现，你的信念并没有充分证据。**\n\n**摆脱某些武断看法的一种好办法就是设法了解一下与你所在的社会圈子不同的人们所持有的种种看法。**我觉得这对削弱狭隘偏见的强烈程度很有好处。如果你无法外出旅行，也要设法和一些持不同见解的人们有些交往，或者阅读一种和你政见不同的报纸。如果这些人和这种报纸在你看来是疯狂的、乖张的、甚至是可恶的，那么你不应该忘记在人家看来你也是这样。双方的这种看法可能都是对的，但不可能都是错的。这样想一下，应该能够慎重一些。\n\n有些人富于心理想象力。对于这些人来说，一个好办法便是设想一下自己在与一位怀有不同偏见的人进行辩论。这同实地跟论敌进行辩论比起来有一个（也只有一个）有利条件，那就是这种方法不受时间和空间的限制。圣雄甘地就对铁路、轮船和机器深表遗憾，在他看来整个产业革命都要不得。也许你永远没有机会真的遇见一位抱有这种见解的人，因为在西方国家里大多数人都把现代技术的种种好处视为当然。但是如果你确实想同意这种流行的看法乃是正确的，那么一个好办法就是设想一下甘地为了反驳现代技术的种种好处而可能提出的论据，从而检验一下你自己想到的论据。我自己有时就因为进行这种想象性的对话而真的改变了原来的看法；即令没有改变原来的看法，也常常因为认识到假想的论敌有可能蛮有道理而变得不那么自以为是。\n\n对于那些容易助长你狂妄自大的意见尤宜提防，不论男女都坚信男性或女性特别优越。双方都有不可胜数的证据。如果你自己是男性，你可以指出大多数诗人和科学家都是男子；而如果你是女性，你可以用大多数罪犯也都是男子来反唇机讥。这个问题本来就根本无法解决，但是，自尊心却使大多数人都看不到这一点，不管我们属于世界上哪个国家，我们大家总是认为我们自己的民族比所有其他民族都优越。既然每个民族都有自己特有的长处和短处，我们就把自己的价值标准加以调整，以便证明自己民族的长处乃是真正重要的长处，而其缺点相对来说则微不足道。在这个问题上，一位明白事理的人也一定会承认，它没有明显正确的答案。由于我们无法和人类之外的智者辩论清楚，所以要处理这个人之作为人的自高自大的问题就更加困难了。就我所知，处理这个普遍存在的人类自高自大问题的唯一方法就是，要经常提醒自己，在茫茫宇宙中一个小小角落的一颗小小星球的生命史上，人类仅仅是一个短短的插曲，而且说不定宇宙中其他地方还有一些生物，他们优越于我们的程度不亚于我们优越于水母的程度。"
		},
		{
			"post_id": 29,
			"title": "【读书】喜新厌旧的孙中山",
			"date_published": 1499304961.531,
			"body": "> 孙中山“二次革命”失败后狼狈地逃赴日本，追随孙中山东渡的人士当中有一位生意人宋耀如，是孙中山的重要金主，其长女宋蔼龄担任孙的英文秘书，有一天孙中山向宋耀如透露心意，想向宋蔼龄求婚，宋耀如大吃一惊，当下就拒绝了这本亲事，几个月后，宋蔼龄嫁给了孔祥熙。接替宋蔼龄秘书工作，服务革命领袖的，是二十一岁的妹妹宋庆龄，她比姐姐更苗条、美丽，孙中山立刻又爱上了妹妹，而宋庆龄对于这位比她大二十六岁的长官的感情纯粹是政治、精神上的崇拜敬爱。此时，宋耀如可能感觉孙中山又喜欢上了他的二女儿，决定全家回上海。回国之后，宋庆龄悄悄寄了一封信给孙，孙回信说，他在东京迫切需要她的协助。一天夜里，在家里女佣人的帮助下，宋庆龄爬窗、沿扶梯逃出家，旋即搭船去日本，孙中山在东京迎接她，并向她求婚，这一年，宋才二十出头，孙已经四十八岁。因为这件婚事，宋耀如宣布与女儿断绝关系，发誓再也不跟孙中山往来。\n\n摘自《蒋介石与现代中国》"
		},
		{
			"post_id": 28,
			"title": "【读书】我的应许之地：流浪放逐的犹太人",
			"date_published": 1499226223.058,
			"body": "世界上有两个流浪民族，吉普赛人（又称波希米亚人）和犹太人。但又是两种截然不同的流浪，前者是具有浪漫情怀的逐食而居，驾着大篷车载歌载舞；后者是血和泪的苦难放逐，伴着的却是驱赶和屠杀。犹太人一遭放逐就是上千年！就像浮萍，随波而流，千年来不停的寻找着可以生根发芽的应许之地。\n《我的应许之地》，就是以色列作家阿里•沙维特通过记述家族的苦奈历史，展现了犹太人的苦难放逐和寻找应许之地的自我救赎历史。\n\n* * *\n\n> 这本书讲述一个以色列人的个人旅程，他因经历席卷家乡的、戏剧性的历史进程而陷入深深迷惘。跨越时间和空间，这是一个土生土长的以色列人对国家更广泛意义的探索。通过家族历史、个人历史，以及深度访谈，我试图描述以色列的大历史，解决更深层次的以色列问题。一个世纪以来，我的国家发生了什么，让我们处于现在的境地？是什么导致了这一切？我们做错了什么？我们将走向何方？我深深的焦虑是否有根据？我们的犹太国家是否真正处于险境？以色列人是否陷入了绝望的悲剧？我们是否能复兴和救赎自我，挽救我们深爱的土地？\n\n而对我这个东方大民族人来说，在我对犹太历史有限的了解情况下，我知道犹太人是一个优秀而又聪明的人类族群，出现了诸多影响人类的明星人物，诸如门德尔松、马克思、弗洛伊德、马勒、卡夫卡以及爱因斯坦。这些犹太人的思想，几百年来，对现代欧洲乃至世界产生了至关重要的作用。和作者阿里•沙维特不同，我想弄清楚为什么在这个星球上却没有他们的生存之地？是宗教原因？民族主义？国家主义？在犹太人寻找自我救赎过程中，这个族群表现出了什么优秀的人类品质？我的应许之地之于国家，对一个族群来说有多重要？国家主义和民族主义又如何平衡？人类何以不能杂居？......\n\n_待续_\n\n**相关下载：**\n\n[[Reading Log]](/platoer.bit/?Post:25:Weekly+27%EF%BC%9AReading+Log)"
		},
		{
			"post_id": 27,
			"title": " 【推荐】用ZeroTier One翻墙和构建虚拟网络",
			"date_published": 1499216860.153,
			"body": "ZeroTier 是一款全球的软件定义网络层。ZeroTier 可以用在内部网络虚拟化，作为移动端点对点 VPN，混合或者多个数据中心云部署，或者任何地方的安全软件定义网络。\n同理，可以把墙外的点加入到ZeroTier 网络中进行翻墙。\n\nZeroTier One 是操作系统级别的客户端服务，支持 Mac，Linux，Windows，FreeBSD 和其他 ZeroTier 虚拟网络关联的一些客户端类型。ZeroTier One 可以在原生系统运行，也可以在虚拟机或者容器上运行，比如 Docker，OpenVZ 等等。\n\n官方网站：[https://www.zerotier.com/](https://www.zerotier.com/)\n\n_PS. 如果想测试，可以留一下您的Network ID，我拉您你加入我构建的虚拟网络中。_"
		},
		{
			"post_id": 26,
			"title": "【读书】曾国藩的每日行事清单",
			"date_published": 1499052516.041,
			"body": "```\n一、主敬——整齐严肃，无时不惧。无事时心在腔子里，应事时专一不杂。 \n二、静坐——每日不拘何时，静坐一会，体验静极生阳来复之仁心。正位凝命，如鼎之镇。 \n三、早起——黎明即起，醒后勿沾恋。 \n四、读书不仁——一书未点完，断不看他书；东翻西阅，都是徇外为人。 \n五、读史——二十三史每日读十页，虽有事不间断。 \n六、写日记——须端楷。凡日间过恶，身过、心过、口过皆记出，终身不间断。 \n七、日知其所亡——每日记《茶余偶谈》一则，分德行门、学问门、经济门、艺术门。 \n八、月无忘所能——每月作诗文数首，以验积理之多寡、养气之盛否。 \n九、谨言——刻刻留心。 \n十、养气——无不可对人言之事。气藏丹田。 \n十一、保身——谨遵大人手谕，节欲、节劳、节饮食。 \n十二、作字——早饭后作字，凡笔墨应酬，当做自己功课。 \n十三、夜不出门——旷功疲神，切戒切戒。\n```\n\n节选自《曾国藩家书》"
		},
		{
			"post_id": 25,
			"title": "Weekly 27：Reading Log",
			"date_published": 1498972238.091,
			"body": "本期更新了两本书：\n\n1.  《我的应许之地》\n2.  《思考,快与慢》\n    BTsync下载密匙：`EVG6QH23FIIE6T4JCAKXVLQFI2VP6VZWAURBP3ALEYSPKVSR77DODJXN6UY`"
		},
		{
			"post_id": 24,
			"title": "【分享】自己常用的AutoHotkey命令设置",
			"date_published": 1498892967.277,
			"body": "[AutoHotkey](https://autohotkey.com/)一些按钮命令说明\n\n```\n#=win !=alt ^=ctrl +=shift {enter}  {tab} tab\n```\n\n常用命令：\n\n```\n#space::Run www.google.com\n^!n::Run C:\\soft\\QQNotepad\\QQNotepad_V2.12.exe ;打开QQnotepad\n#!n::Run Onenote.exe\n^!t::Run C:\\soft\\Telegram\\Telegram.exe\n```\n\n* * *\n\n快速打开常用网站：\n\n```\n;打开google搜索 \n:://g::    \nRun http://www.google.com     \nreturn\n\n:://zero::    \nRun http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D  \nreturn\n\n:://ifttt::   \nRun https://ifttt.com/\nreturn  \n\n:://blog::   \nRun http://cozecn.blogspot.com/   \nreturn \n\n:://2ove::   \nRun http://2ove.me  \nreturn\n\n:://markdown::   \nRun https://kennylee26.gitbooks.io/markdown/content/grammar/  \nreturn\n```\n\n快速打开常用工具：\n\n```\n:://pkm::   \nRun file:///D:/Dropbox (个人)/应用/updog/guo/index.html    \nreturn \n\n:://one::    \nRun onenote.exe    \nreturn\n\n:://keep::    \nRun \"C:\\Program Files (x86)\\Google\\Chrome\\Application\\chrome.exe\"  --profile-directory=Default --app-id=hmjkmjkepdijhoojdojkdfohbdgmmhki    \nreturn\n\n:://copy::    \nRun \"C:\\Program Files\\Ditto\\Ditto.exe\"    \nreturn \n\n:://hang::    \nRun ‪\"C:\\Program Files (x86)\\Google\\Chrome\\Application\\chrome.exe\"  --profile-directory=Default --app-id=knipolnnllmklapflnccelgolnpehhpl\nreturn \n\n:://cmd::    \nRun cmd    \nreturn     \n\n:://n::    \nRun notepad    \nreturn \n\n:://note::    \nRun D:\\OneDrive\\APP\\FlashPad\\FlashPad.exe    \nreturn \n\n:://sc::    \nRun C:\\Program Files (x86)\\Scapple\\scapple.exe  \nreturn      \n\n:://e::    \nRun explorer    \nreturn  \n\n:://sys::    \nRun control sysdm.cpl    \nreturn\n```\n\n常用字符串快速输入：\n\n```\n::omw::on my way\n::btw::by the way\n::email':: {enter}Best Regards,{enter}名字 {enter}Email:邮件地址\n```\n\n快速打开程序(快捷键)\n\n```\n;用google搜索    \n!g::    \nSend ^c    \nRun http://www.google.com/search?q=%clipboard%    \nreturn    \n\n;用百度搜索    \n!b::    \nSend ^w    \nRun  https://zh.wikipedia.org/w/index.php?search=%clipboard% \nreturn     \n\n!t::    \nSend ^c     \nRun http://s.taobao.com/search?q=%clipboard%    \nreturn\n```\n\n通用键的映射：\n\n```\n;对windows下的一些常用键进行映射,与苹果下的一些习惯一样(苹果下的快捷键有些非常合理:)    \n\n!f::Send ^f  ;查找    \n^q:: !F4    ;退出    \n!w::Send ^w ;关闭网页窗口    \n!r::Send #r    \n!s::Send ^s ;保存    \n!n::Send ^n ;新建    \n!z::Send ^z    \n\n;选择文字    \n!,::Send ^+{Left}    \n!.::Send ^+{Right}    \nreturn  \n\n;选择一行    \n!a::    \nSend {Home}    \nSend +{End}    \nreturn     \n\n;</短时间双击alt键切换capslock键>     \n;copy cut paste 的快捷键     \n!c::Send ^c    \n!x::Send ^x    \n!v::Send ^v     \n\n;上页翻页键映射    \n!h::Send {PgUp}    \n!;::Send {PgDn}    \n;HOME END键映射    \n!u:: Send {Home}  \n!o:: Send {End}\n```\n\n其它待补充："
		},
		{
			"post_id": 23,
			"title": "推荐：ProtonVPN服务",
			"date_published": 1498786029.104,
			"body": "号称全球最安全的邮箱提供商ProtonMail 正式宣布推出 VPN 服务 ProtonVPN，以 对抗屏蔽和政府监视。\n开发者表示：\n\n> 他们的使命是让隐私和安全人人都可触手可及，因此该服务是免费的。\n\n和 ProtonMail 一样，ProtonVPN 也有付费账号。\n**官方地址：** [https://protonvpn.com/download/](https://protonvpn.com/download/)"
		},
		{
			"post_id": 22,
			"title": "教程：关于ZeroNet一些设置",
			"date_published": 1498743528.979,
			"body": "*   [有关于 ZeroNet 加密, 站点更新, 多用户站点的幻灯片 »](https://docs.google.com/presentation/d/1qBxkroB_iiX2zHEn0dt-N-qRZgyEzui46XS2hEa3AA4/pub?start=false&loop=false&delayms=3000&slide=id.g9a1cce9ee_8_13)\n\n*   [关于端口 15441打开YouTube 上的教程]([https://www.youtube.com/watch?v=aQXJ7sLSz14](https://www.youtube.com/watch?v=aQXJ7sLSz14)"
		},
		{
			"post_id": 21,
			"title": "分享：制作精美电子书的“Standard Ebooks”工程",
			"date_published": 1498727437.014,
			"body": "专注制作适合各种电子书阅读器的电子书的“Standard Ebooks”工程，选取公有域电子书进行精制，利用最新技术，优美其排版，修订其讹误，规范其格式，力求呈现最佳电子阅读体验。\n\n地址：[standardebooks.org/ebooks/](https://t.co/wUpH7jbcLD)"
		},
		{
			"post_id": 20,
			"title": "分享：中文期刊查询站",
			"date_published": 1498714951.192,
			"body": "湛江数字图书馆 [www.sslibrary.com](http://www.sslibrary.com)\n\n`用户名：zjlib 密码：zjtsg`\n\n维普中文期刊 ​​​​​​​[http://lib.cqvip.com/](http://lib.cqvip.com/)\n\n`用户名：zjstsg 密码： zjstsg`"
		},
		{
			"post_id": 19,
			"title": "Weekly 26：Reading Log",
			"date_published": 1498623674.728,
			"body": "Weekly26 日期：6.19~6.25\n\n病来的突然，去的徘徊。Weekly26也就耽误了几天。\n\n本周书目《苏东坡传》，作者民国才子林语堂。此书原本以英语书写，后被大翻译家张振玉先生翻译为中文（林语堂的《京华烟云》中文版也是出自张之手），也有人说宋碧云译本比张译本要好。\n\n* * *\n\n捡拾此书有几个原由。其一就是对苏东坡才情感兴趣，唐宋八大家苏家占三家，苏家三大才子当以苏轼为首。大江东去，浪淘尽、千古风流人物。但愿人长久，千里共婵娟。春宵一刻值千金，花有清香月有阴......千古绝句如珠落盘。林语堂本书也神话了苏轼，前言序里甚至能读出“跪舔”之象。其二是因为出自林语堂之手。虽然不能盲信大师，但是大师必有过人之处。本书也颇有争议，有说写的烂的，当然也说是因为翻译的原因。不过试想一下，把宋朝语境下的事情在现代用英语书写出来，本身也足以望其项背，更别说主人公是一个诗词作家。更让我吃惊的事情，林语堂何以霸占那么多苏轼史料，写出诸多细节。其三就是对宋史之耽爱，之前写过一些宋史方面的小文，但都是粗枝大叶，贻笑大方，所以需要宋史猛料强补。\n\n本书线性的叙述了苏轼一生，但是对宏大历史背景和重大事件的展开叙述，如北宋新旧党争、乌台诗案等，以及北宋当时的外交关系，也是本书的一大特色。当然书中林语堂也不乏一些个人感悟和幽默：\n\n> “才华过人的诗人和一个平实精明的女人一起生活之时，往往是显得富有智慧的不是那个诗人丈夫，而是那个平实精明的妻子。”\n\n还有一些诗的引用也颇有趣：\n\n> “两个娘子小身材，捏着腰儿脚便开；若要尝中滋味好，除非伸出舌头来。”（南宋女词人朱淑贞的《咏箸》诗）\n\n[Reading Log Books Download](http://127.0.0.1:43110/184n4WAqGeBBP8dUnBa74hPLJsCNWcQy9N//?Post:9:Reading+Log+Books+Download)"
		},
		{
			"post_id": 18,
			"title": "待办事宜未完，如鲠在喉",
			"date_published": 1498569566.994,
			"body": "生病期间，一周没有碰书。\n\n在之前似乎很正常的一件事情，一年52周，一周又算了什么？可是一旦把一件事情排在了日程上，列在了待办事宜，就会想办法把这件事情完成，尽快完成，赶上进度，补齐时间。\n\n这就是应该在周末发出的Reading Log没有发出来的原因，而又郁郁而寡欢，非尽善而后快。"
		},
		{
			"post_id": 17,
			"title": "第三只眼睛",
			"date_published": 1498468673.467,
			"body": "病了。发烧了。\n一个人躺在床上昏天黑地，和这个真实世界大于小之间不断的穿梭。\n世界是那么大，连动动我的身体显得那么的费劲；世界又是那么小，脱离了自己，俯览世界，皆如草芥蝼蚁。可能这就是发烧发迷糊的感觉吧，既恐怖还有点上瘾。恐怖的是不断出现的未知世界，上瘾的是您可以用上帝的视角审视自己和这个世界，就是所谓的第三只眼睛。\n思维方法论有主观、客观、第三者角度看问题方法，那么上帝视角又属于一种什么样的视角那?当然这绝不是佛教所说的开悟，以一种超自然的方法感知和预测这个世界。怎么在日常生活中构建和锻炼自己的上帝视角方法并应用到实践中去。"
		},
		{
			"post_id": 16,
			"title": "倡议：反对男性乘坐公交时岔开腿侵占邻座空间的运动",
			"date_published": 1498098208.058,
			"body": "近期多国掀起了**反对男性乘坐公交时岔开腿侵占邻座空间的运动**。这场公益宣传的倡导者认为，落座后分开双腿是失礼的行为，妨碍到了周围的乘客。\n\n这种现象在中国更严重，有些男性在公共交通工具上看着像一位在自己家里的“大爷”，不仅不雅，而且影响其他人的腾挪移动，侵占别人空间。\n\n特此推波助澜一下此活动！"
		},
		{
			"post_id": 15,
			"title": "推荐：一款纯文本记事本 FlashPad",
			"date_published": 1498055188.583,
			"body": "FlashPad是一款轻便的笔记工具。虽然好久没有更新了，但是足够用即可。\n\n**软件特性：**随时按下快捷键(缺省为Alt+Z)可调出它，\n再次按下相同快捷键或ESC键则可令其隐藏、回到系统托盘中。您可在日常\n工作中使用该软件快速地记下瞬间灵感、工作备忘、或者电话号码。\n\n和Windows自带的记事本不同的是，FlashPad会自动保存您输入的全部内容，\n并支持多页(TAB)显示。\n\n此外，FlashPad 支持数学计算，输入“1+2”，按下 Ctrl+Enter，即可出\n现计算结果，方便您进行简单的日常计算。\n\n下载地址：[下载 FlashPad 1.6 (flashpad.zip)](http://www.haoxg.net/download/flashpad.zip) | [源程序 (flashpadsrc.zip)](http://www.haoxg.net/download/flashpadsrc.zip)"
		},
		{
			"post_id": 14,
			"title": "电影：《十年》",
			"date_published": 1497954693.037,
			"body": "《十年》，为2015年亚洲电影节推介电影，是一部由5个故事构成的小电影合集。当中包括郭臻导演的《浮瓜》、黄飞鹏导演的《冬蝉》、欧文杰导演的《方言》、周冠威导演的《自焚者》、伍嘉良导演的《本地蛋》，由廖启智、梁健平、周家怡、游学修、吴肇轩领衔主演。\n\n**磁力链接：**\n\n`magnet:?xt=urn:btih:F1528EF2DD7C6A5FB955759DD25AB6DCEC8C66C9`"
		},
		{
			"post_id": 13,
			"title": "不同设备更新问题",
			"date_published": 1497927901.66,
			"body": "前天在公司也搭设了ZeroNet，把Users文件同步了过来，并认领了自己的博客。可是在新设备上只能撰写并保存二无权发布，总是提示签名错误。昨晚把另外一台电脑上ZeroNet\\data\\下面除了浏览其它站点缓存之外的几个文件同步了过来，包括自己博客的文件夹也同步了过来。完美解决新终端的发布签名问题。"
		},
		{
			"post_id": 12,
			"title": "Tiddlywiki作为ZeroNet主博客页面\t",
			"date_published": 1497883046.208,
			"body": "一直用[Tiddlywiki](http://tiddlywiki.com/)作为主博客程序（参见[2ove.me](2ove.me)），用TiddlyWiki的好处是非线性：具有WIKI特性，不需要数据库（只有一个Html文件），插件丰富等。怎么用ZeroNet调用tiddlywiki？一直困扰着我，对我这种非技术人员来说可能还要无限的折腾下去.....\n\n更新：\n\n现在已经解决了直接读取问题。仍然存在的，就是发布问题，如果通过文件覆盖模式更新很麻烦，不过好的一点是Tiddlywiki提供了[桌面版浏览器](https://github.com/Jermolene/TiddlyDesktop)，可以通过它直接保存，不需要来回复制粘贴进行覆盖。下一步就是看怎么解决留言互动问题了，目前只能用[ZeroMe留言](/Me.ZeroNetwork.bit/?Profile/1White24UrrwQrD86o6Vrc1apgZ1x1o51/12gw5ThiFrP2yahvcawg5S8ZxMXS28rSmQ/plato@zeroid.bit)了。"
		},
		{
			"post_id": 11,
			"title": "Resilio Sync永久授权密匙",
			"date_published": 1497843830.249,
			"body": "[Resilio Sync](https://www.resilio.com/)前身BTsync,是一款去中心化分布式文件分发同步下载软件，虽然不是十分流行，但深受“暗网”用户青睐。\n\n**Resilio Sync**专业版和非专业版的区别：专业版可以选择同步文件，非专业版是一股脑下载。\n**获取专业版方法：**\n一、[官方购买](https://www.resilio.com/#)；\n二、修改计算机系统时间，使之永久处在试用期；\n三、破解密匙，方法如下：\n创建一个文件名后缀为`btskey`的文件，然后吧下面内容拷贝到文件里：\n\n```\nbtos1_eyJzIjogIm5xNjRmNGgrWDhxWHFiaWRodEtyTWdNcEVaMHdYaUJLbExwSWFwSDUxMzkyaHdqMFFpQWJOTTFGd2JGWGpJQ0FhV2w4V3ZidVpPenpITXZmNTRLWU1XVGVsVFZjS3JGQUpYMmVUMGttT2lCMm8zQ1BjVFd2VWlCLzRsTTlQN1FsalVSVzREMVFNUktWcEhwaG5IVzIvZmdqN05MaThmMnhNa1NDNERwRVVpQ0pXZHpPWXFIbW1OMFdOUEt6QWg4RkJoanNvUVNBa1hKN09WS0c5WElkVTczWnNlVWNxWW1WVUo0WDc0S05wYmlYZk0vemlsU2pIK0U5Y3ZMZ092YlplVjlCZXlveDNwT3pRYUJOeFNQT3FYWEpTRHE1bVRhRXMvWGppVGtJV21uVHJudVJnb01DZ0RBOHdBS3RIYjRvVkduWm1jeU8xNlhoQ3dvL2VkeHFxZz09IiwgImQiOiAiZXlKamF5STZJQ0ppZEc5ell6RmZaWGxLYW1ONVNUWkpRMHBJVlZoYVYxRldUakZsVldoWVZrWldNMUpXU2tWVVJURlZZVEZXZFZacVVsUmpNMUp5Wkcxd1FsUkVRVFZWUXpsMVZraGtUVk5wT0hsUFEzUjNUV3hrVjJOck1IaFVhelI1VXpOQ1QyUlhiR3RTYlVwb1ZtNUtURlJZVVRWVFJ6RXpWVVU1\n```\n\n这就是**Resilio Sync Pro key**，或者直接下载[我制作的现成的Key](https://my.syncplicity.com/share/ja07ihbsqlif4ka/sync%E5%BA%94%E7%94%A8%E8%AE%B8%E5%8F%AF%E5%AF%86%E5%8C%99).\n\n[Reading Log Books Download](/184n4WAqGeBBP8dUnBa74hPLJsCNWcQy9N//?Post:9:Reading+Log+Books+Download)"
		},
		{
			"post_id": 10,
			"title": "精品链接",
			"date_published": 1497779128.207,
			"body": "每个 ZeroNet 网站都需要 Peer ，访客越多 Peer 也越多，Peer 多了网站越快，访客体验才会越好。\n\n欢迎链接本站，欢迎互链（**仅限 ZeroNet 网站**）。\n\n**请先加好我的博客，谢谢。**\n\n> 博客名：三家村\n> 网址：[http://127.0.0.1:43110/platoer.bit/](http://127.0.0.1:43110/guixiang.bit)\n> 简介：读闲书·闲读书\n\n连接好后请留言。"
		},
		{
			"post_id": 9,
			"title": "Reading Log Books Download",
			"date_published": 1497756648.371,
			"body": "这里是每周[Reading Log](http://www.2ove.me/#Reading%20Log)提及到的书籍分享下载。使用的是[BTSync](https://kindlefere.com/post/347.html)分布式分发下载。\n\n**说明：**每周会删除上周分享，请及时下载。每次不超过5本书。\n\n下载密匙：BLQ364AV4VNWGCZTBI2CKTB3G7UNERMEH \n\n[下载地址](https://link.resilio.com/#f=Reading%20Log%20Books&sz=0&t=1&s=AKDRUN3Z5JSFO3UGASAOFHRMPWZE7JIZ&i=CUPUJKJGTSLOTOME52T3H6NEIMLQSZGRL&v=2.5)\n\n​​​​​​​"
		},
		{
			"post_id": 8,
			"title": "麦价",
			"date_published": 1497751393.828,
			"body": "【麦价】《绝秦书》作者张浩文转发的一条微博称，麦收结束，关中今年小麦亩产最高为700斤，按官价0.90元计，每亩可收入630元，减去各种支出，仅剩下120元。——旋地50元，种地30元，种子30元，肥料150元，除草剂60元，浇地70元，割麦100元，拉麦20元。120元的收入，尚未除去人工费用，实际上，应该是负收入。一个农民即使在大棚里忙活，一天也有七八十元的工钱。麦浪滚滚，只是“丰收”一词的视觉盛宴，与庄稼主人的收获无关。"
		},
		{
			"post_id": 7,
			"title": "Weekly 25：Reading Log2",
			"date_published": 1497699659.196,
			"body": "> 培根（Bacon）说：看书同吃东西一样，有的随便尝尝就够了。\n\n我的饮食习惯以素食为主，并时不时喜欢喝两口小酒。我的读书也是如此，古典的东西很对我胃口，五四之后的东西都是浅尝辄止。这应了在知乎上的[一个讨论](https://www.zhihu.com/question/24578409)“看书就看经典，三十年内的书不看”，但是我不并纯粹看经典，我更喜欢小品文。读经典就像吃大餐，吃的时候总有一种让人生厌的仪式感，我讨厌这种感觉，所以经典不能常读，那样我想我会变成共产党。反而一两碟小菜，一碗对口的油泼面，一瓶冰爽的啤酒，一头新蒜，口味直接，没有繁复奢华而又装腔作势般的味蕾层次追求，让人爽的直接。假如我在农村，我想，此时我还是个光着肩膀的抠脚大汉。\n\n* * *\n\n最近交叉阅读的有：《禅与摩托车维修艺术》、《理想国》、《随园食单》、《说文解字精读》、《古文观止》和《曾国藩家书》。交叉阅读，容易交叉感染，不过都是正面的。 《随园食单》是小品文，一般读的比较随意，不过我也记笔记，主要是有意思。《古文观止》属于经典，我一般早上读，主要是为了便于记住，不过有点不求甚解，因为环境限制。《曾国藩家书》是一大碗鸡汤，我不要曾国藩的思想，而纯粹为了书的古风语感兼对曾国藩私人生活和那个时代的偷窥。《说文解字精读》我当工具书读，认真而反复，像读教材一样，因为《说文》属于原典，经典的祖宗，如果掌握了每个字的字形演变、字意进化，等于说是夯实了古文这座殿堂的基础，再读文言文就会势如破竹。《理想国》我纯粹是打酱油读法，太认真了就掉坑里了，特别是在中国。\n\n**几个摘录：**\n\n> 1.  《食经》上讲：食无定味，适口者珍。此言不虚。（《随园食单》）\n> 2.  行内人称味为口，调味叫找口，尝味叫听口；口重是咸，口轻是淡；咸了回锅叫降口，清爽洁净叫利口。“五味调和百味鲜”。（《随园食单》）\n> 3.  古人吃的东西真牛X：《周礼·天官·膳夫》记载：“不食雏鳖。狼去肠，狗去肾，猫去正脊（山猫去脊骨），兔去尻（脊骨尾端），狐去首，豚去脑，鱼去乙，鳖去丑。”（《随园食单》）\n> 4.  神把城邦自由民划分为三个等级：第一等级是黄金等级，其本性为爱智者，其职业为统治者；第二等级是白银等级，其本性为爱荣誉者，其职业为军人；第三等级为铁铜等级，其本性为享乐者，其职业为生产者。《理想国》\n> 5.  一个人即使忍受贫困和年老，但做人要是遵循“中庸适度，心平气和，做到内心的满足与宁静就是幸福的”。《理想国》 6.“让我们永远走向上的路，追求正义和智慧。”正义和智慧不仅是国家的主题，也可以说是整个宇宙存在的本质，因为国家的起点“就是永无止境的时间以及时间带来的变化”。《理想国》\n\n下周，《禅与摩托车维修艺术》会读完。漫谈式的哲学意味，有点像《苏菲的世界》，但不如后者。后者漫而不散，前者过于在乎书的整体叙事结构而失去了真正许多闪光的东西。\n\n[延伸](http://www.2ove.me/#Weekly25:Weekly25%20Reading%20%5B%5BReading%20Log%5D%5D)[阅读](http://www.2ove.me/#Weekly25:Weekly25%20Reading%20%5B%5BReading%20Log%5D%5D)"
		},
		{
			"post_id": 6,
			"title": "ZeroNet Telegram Group",
			"date_published": 1497620145.105,
			"body": "[ZeroNet Telegram Group](https://t.me/onenoter)"
		},
		{
			"post_id": 5,
			"title": "Weekly 25：Reading Log",
			"date_published": 1497615340.036,
			"body": "Weekly25 日期：6.12~6.18\n\n**书名：**《禅与摩托车维修艺术》\n\n**科目：**哲学\n\n**作者：**罗伯特·M·波西格\n\n**作者简介：**\n\n* * *\n\n作者波西格（1928-，Robert M. Pirsig）大学时主修生物化学，后来对哲学产生兴趣，1950年前往印度学习东方哲学。回国后，在当地大学担任写作课教师。1961年，他被诊断为偏执型精神分裂症和临床忧郁症，被多次送进精神病院，接受过28次电击疗法。\n\n1968年出院后，他带着10岁的儿子克里斯，进行了一次长途摩托车旅行。他把旅行的感受和思考，写成了一本书《禅与摩托车维修艺术》（Zen and the Art of Motorcycle Maintenance）。\n\n由于连续被121家出版社拒绝，直到1974年，这本书才出版。但是出版后，销售量惊人，超过500万册，成为70年代美国十大畅销书之一，目前累计销售量已经超过1000万册。《吉尼斯世界纪录》称它是\"世界上被拒稿次数最多的畅销书\"。\n\n![](http://image.beekka.com/blog/201112/bg2011121802.jpg)\n\n**简要介绍：**\n\n\"禅\"和\"摩托车\"有什么关系，怎么会放在一起呢？\n\n这两个词都是象征。\"禅\"象征一个人内心的心灵探索，是主观哲学思考；\"摩托车\"象征科学技术，是客观的外部存在。作者把它们放在一起，就是暗示这本书讲的是，如何将主观和客观统一起来，正确地认识自我和外部世界，达到一种和谐存在的境界。也就是说，如果有一天，\"维修摩托车\"也能成为一种\"禅\"，那会怎样？\n\n作者通过夹叙夹议的叙事方法，一边描述和儿子骑摩托车旅游的过程，一边触物生情引入科技和和人的哲学观点。\n\n正如作者在序言中所说：\n\n> \"本书不应该在任何意义上，与东方佛教徒的禅学实践联系在一起。它与摩托车的关系也不是很大。\"\n\n**关联阅读：**\n\n这本书让我想起台湾作家詹宏志的**《旅行与读书》**，这本书早已在读书清单里了，还没有来得及看。倒是看过詹宏志在一席上的演讲:[旅行人：在路上与在书上](https://v.qq.com/x/cover/1jv433683n9m5h4/v03212aom96.html)\n\n**书摘：**\n\n> 自然的法则是人类发明的，就像鬼的存在一样。逻辑学、数学也都是如此，所有值得赞美的事，也都是人类的发明。这个世界也是人类所想象出来的，整体来说也就是一种灵界的存在。在古代，我们所居住的这个美妙的世界就被如此视之，它由鬼神所统领，我们之所以能看到这个世界，就是因为鬼神让我们看见，他们是摩西、耶稣基督、释迦牟尼、柏拉图、卢梭、杰弗逊、林肯等等，牛顿是非常好的一位，可算其中最好的一位，所以我们的常识就是由过去成百上千的鬼神所构成的，他们企图在人的生命当中找到他们的地位。”\n> \n> 你相信鬼吗？” 我说：“不相信。” “为什么？” “因为他们没有科学依据。” 我的答案不禁让约翰笑了起来，我接着说：“他们的存在不占用任何空间，也没有能量，因此根据科学定理，他们只存在于人的心中。” “当然，科学定理也不占用任何空间，也没有能量，因此也只存在于人的心中，所以完全科学的态度就是既不相信鬼，也不相信科学，这样你就安全了。然而这样一来，你就没有多少可以相信的了，但是唯有这样才是科学的态度。”\n> \n> \"在你经过大城市的工业区时，你就会看到整片所谓的科技区。门前围了高高的铁丝网，大门紧锁，告示牌上写着\"禁止跨越\"。在一片污浊的空气之后，你看到的是奇形怪状而又丑陋的金属物和砖块，也不知用途为何。它的主人你永远也见不着，它为什么在那儿也没有人知道，所以你感受到的只是一股莫名的疏离感，仿佛你并不属于那儿。它的主人和知其来由的人可不希望你在附近闲逛，这些工厂让你在自己的土地上竟有陌生的感觉。它特殊的形状、外观还有神秘感，一切都在叫你\"滚开\"。 你知道这一切总有解释，而且它们毫无疑问地对人类间接地有些益处，但是这些益处你没看见，你只看见\"禁止跨越\"和\"保持距离\"的牌子，你只看见人们像蝼蚁一样为这些庞然巨物做工。于是你想，即使我是它们的一分子，也不过是另一只做苦役的蝼蚁罢了。\"\n> \n> 有些东西你忽略是因为它们非常细微，但有些却是因为它们过于庞大。\n\n**下载链接：**[地址1](https://my.syncplicity.com/share/wet3m4pszbiyzlt/%e7%a6%85%e4%b8%8e%e6%91%a9%e6%89%98%e8%bd%a6%e7%bb%b4%e4%bf%ae%e8%89%ba%e6%9c%af)(mobi格式) (其它格式[索取](#Contact%20me) )\n\n* * *\n\n[更多阅读](http://www.2ove.me/#Reading%20Log:%5B%5BReading%20Log%5D%5D)"
		},
		{
			"post_id": 4,
			"title": "读书邮件列表",
			"date_published": 1497614199.46,
			"body": "邮件列表可能是最古老的沟通方式，现在除了一些技术人员很少人有人玩了，不过在现在IM横行的时代，回归邮件列表方式，不失为一股清流。没有碎片化语言，可以深入讨论，没有在线打扰。\n\n**邮件列表：**[读书·新知](https://groups.google.com/d/forum/platoer)\n\n旨在读书讨论、分享和推荐。\n\n**加入方法：**点击上面链接加入；或直接发邮件到这个地址，邮件主题注明“申请加入”即可。\n\n```\n邮件列表地址：platoer@googlegroups.com\n```"
		},
		{
			"post_id": 3,
			"title": "Hello World",
			"date_published": 1497614030.302,
			"body": "第一帖应该就是这样：hello world!"
		}
	]
}