{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1610164924_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": [
			{
				"comment_id": 1,
				"body": "got a few people to check out mewe, but most people \"dont want to leave all their friends on fb\"",
				"added": 1610166495
			},
			{
				"comment_id": 2,
				"body": "> [kekistancitizen](#comment_17_1QHTwjj9nMpqDE1yb9t9ri6HSCt9MWMSGp): This by itself is a huge win. You can delete instagram and facebook and still live a normal life, but if you are without the IM app everyone uses you might as well not exist. I dream of a day when I can get rid of WhatsApp, but while it means not being able to talk to literally anyone (in Brazil no one uses anything else) it is simply not possible. SMS was actually a pretty good standard, just add end to end encryption and you have yourself a very privacy respecting way of communicating, but it doesn't handle images and videos well which is how whatsapp and similar services hot all of the normies to sign up in droves.\n\nSignal is a viable option, ive got several friends to use that for texting, group chats work great as well. easily can replace SMS.",
				"added": 1610172137
			}
		],
		"1610169002_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 3,
				"body": "> [hadez](#comment_1_1GANYtYYvAszYKLRSLWBkYEjmdhQrbThNr): I don't want to use Parler because it requires my cellphone number to register. There are other ways to prevent bots, asking for phone numbers is not acceptable for me.\n\nuse a google # or something else thats not your \"real\" i have one for such instances, and stuff like craigslist dealings.",
				"added": 1610172216
			}
		],
		"1610154957_1HesgY39DUQrf3M1WCn6q66f69VRRJc57E": [
			{
				"comment_id": 4,
				"body": "> [hankmorgan](#comment_2_1P9qBYiq9XWSsggTyDCj9zryyKESx6cADT): Only phone app, ask for your number (morons),Removed from the google play, about to be removed from apple storeParler is dead in the water\n\nwebsite still works!",
				"added": 1610172450
			}
		],
		"1610219039_1KBdrQX71nWaR3P9DmNhJ6HSsBxS12d3AM": [
			{
				"comment_id": 5,
				"body": "I tested it last night, works pretty well, you can turn it on and off, and it will even create a separate ID for you which is nice.",
				"added": 1610220431
			}
		]
	},
	"comment_vote": {
		"12_1QHTwjj9nMpqDE1yb9t9ri6HSCt9MWMSGp": 1
	}
}