{
	"title": "RVRE Blog",
	"description": "All the latest RVRE news & changes.",
	"links": "- [RVRE](http://127.0.0.1:43110/1f7FYxZWSZ5YG7Nd8sGsHcWEQgvdnVvQF)\n\n##Interesting projects:\n- [NinjaBeats](http://127.0.0.1:43110/15F9LYs6c17NUXv3MxpJSGbpWxyHTEbzMk/stream/audio.html)\n- [Kaffiene](http://127.0.0.1:43110/kaffiene.bit)",
	"next_post_id": 5,
	"demo": false,
	"modified": 1507932285,
	"post": [
		{
			"post_id": 2,
			"title": "RVRE's Engine Re-written & more",
			"date_published": 1496086200,
			"body": "So I decided I'd re-write RVRE's internal search engine (the core JavaScript that makes it tick) and, along with it, Dexer (RVRE's indexer) and the format RVRE uses.  I'll make three sections, on for each of those elements.  Let's start off with the search engine itself.\n\n#Engine\nI decided that RVRE's internal engine wasn't fast enough and had too much 'debris' (unwanted gunk) in the way of the core search element, so I've decided to remove those. I've also completely removed tags for now, but I'll probably end up implementing those again within the next few days; results can still be found pretty easily through the description & title of the zites, but it's not quite as accurate.  Tags to supplement results are often very useful and provide a generalized way to find zites more accurately.\n\tI've also made several speed optimizations to RVRE.  Gone are the 10+ millisecond search times: say hello to 3-4 milliseconds maximum, making RVRE one of the fastest search engines on ZeroNet.  Uncapping the searches, and allowing for any number of results to be displayed, meant that the slowest searche took just over 1/20th of a second - a huge improvement from the last engine.  This is mainly due to the fact that the engine uses pure JSON instead of a pseudo-JSON strings.\n\tThe engine also properly caches things, but it's still experimental.  The JSON index is loaded once upon page load, and then the JSON is parsed very quickly.  The animation on page load makes everything seem seamless, and gives RVRE a properly polished feel with highly improved performance and load times.\n\tAnd, one last thing: the engine now has a content filter which will filter out blank / unedited zites (mainly ones with \"my new zite\" or \"MyZeroBlog\" in the title or no description) - if you find your zite gone, simply add a description before the next index is due.  Simple.\n\n#Dexer\nDexer is the name I gave to RVRE's indexer just after the re-brand, and I decided that I'd re-write Dexer without a GUI.  Index times have gone from 30 minutes to less than 5, but this is probably because I'm not checking for tags.  Hopefully I can still keep it under 10-15 minutes, but if I can't then I'll try auto-tagging instead.  Dexer also saves in the new JSON format described below, which is much cleaner and more human-readable.\n\n#New format\nThe new JSON format is much nicer to look at (when it's not minified to reduce the filesize) but does take up about 50% more space; this isn't too much of a worry since it's still just under 200KB, however it's quite worrying because ofthe rate ZeroNet is growing at.  Hopefully at some point in the future I'll come up with some way to compress it (at the cost of increased CPU usage / decreased performance upon caching).\n\nI've also indexed a healthy 1627 zites, which means that RVRE has one of the biggest indexes on ZeroNet too."
		}
	]
}