{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Українська спільнота Linux",
			"body": "Всім привіт! Чи є тут Linux-користувачі зацікавлені у будівництві нової платформи для спілкування?",
			"added": 1495141619
		},
		{
			"topic_id": 2,
			"title": "Debian 9",
			"body": "Хто вже оновився? :)",
			"added": 1497711841
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1_1MREdcZdDjmPyVL8YH53wPfzjc6FX9aJ8b": [
			{
				"comment_id": 1,
				"body": "Напевно, усім відома статистика з розподілом мови в Україні за наступним посиланням:\n\nhttps://uk.wikipedia.org/wiki/Мови_в_Україні\n\nУ цьому немає нічого поганого, навпаки - нас багато і всі ми різні. Тому я вважаю, що потрібен форум не лише з опцією вибору локалізації, а ще й з можливістю ставити питання на бажаній мові без будь-якого дискомфорту (навіть якщо відповіді будуть на іншій мові, головне щоб розуміти один одного).\n\nЩодо формату веб-форума, мені подобається як виглядає - https://lainchan.jp/ . Але я з радістю вислухаю ваші поради. (Тільки знайте, що ще шість років з phpbb3 я не витримаю :))",
				"added": 1495573625
			},
			{
				"comment_id": 2,
				"body": "Ні, тому що у ZeroNet не така велика кількість користовачів.. Натомість я бажаю форум для достатньо підкованих спеціалістів. Які не терплять аудіторію хейтерів з LOR, полюбляють інформацію без розжовування для початківців та знають що означають слова: DevOps, AWS, Kubernetes тощо.",
				"added": 1495655076
			},
			{
				"comment_id": 3,
				"body": "До речі, згідно до stackoverflow, ми маємо шанс на успіх:\nhttps://zgab33vy595fw5zq-zippykid.netdna-ssl.com/wp-content/uploads/2017/05/country_stuck_vim-1-2-1024x1024.png",
				"added": 1495655602
			},
			{
				"comment_id": 4,
				"body": "blinkel, так, але можуть виникнути проблеми з деякими драйверами. Тому краще мати доступ до інтернету, щоб швидко встановити нові.",
				"added": 1496933904
			}
		]
	},
	"comment_vote": {
		"19_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": 1
	}
}