{
	"next_topic_id": 9,
	"topic": [
		{
			"topic_id": 1,
			"title": "Обойти провайдера.",
			"body": "Кто то в курсе, как можно обойти сервера провайдера? Возможно ли это? Или все таки вся сеть проходит через сервер провайдера? (несмотря на огромную сеть проводов и роутеров)",
			"added": 1552048278
		},
		{
			"topic_id": 2,
			"title": "Tails и zeronet",
			"body": "Сегодня попробовал Tails, однако возникла проблема с Зеронет. На тор браузере но не работает никак:( при этом на торе в Манджаро зеронет работает на ура. Никто не в курсе?",
			"added": 1552060497
		},
		{
			"topic_id": 3,
			"title": "openWeb",
			"body": "на западном сайте Reddit наткнулся на тему, что появилась некая сеть OpenWEB. Это сайты с доменным именем ***.ow . Кто то уже в курсе что за сеть? Кто тестировал?",
			"added": 1552109744
		},
		{
			"topic_id": 4,
			"title": "Перенос ZeroID",
			"body": "как перенести Zero ID аккаунт на другое устройство без переноса всех файлов данных? Какой файл отвечает за храние данных аккаунта? (ключ)",
			"added": 1553407518
		},
		{
			"topic_id": 5,
			"title": "Realtime ядро Linux",
			"body": "есть ли какая то разница в RT ядре  по сравнению с обычным? Вышла новая версия ядра 5.1. Кто то уже тестировал?",
			"added": 1553958849
		},
		{
			"topic_id": 6,
			"title": "Настройка Yggdrasil",
			"body": "Скачал и запустил yggdrasil, однако проблема! не появляется файл настройки yggdrasil.conf.\nКак быть?",
			"added": 1554050033
		},
		{
			"topic_id": 7,
			"title": "Наноборда",
			"body": "Наноборда вообще еще актуальна? она работает? а то запустил сервак, а что дальше хз... инфы в клирнете новой нет. По возможноти, объясните, как оно работает.",
			"added": 1554745353
		},
		{
			"topic_id": 8,
			"title": "Эльбрус",
			"body": "Настолько ли безопасен процессор эльбрус, как о нем говорят? Или это тот же интел по-русски в плане уязвимостей?",
			"added": 1559319837
		}
	],
	"topic_vote": {
		"2_1CV23652pUmbK7yQtjyrBp7ZRhaV7U97aa": 1,
		"1_1CV23652pUmbK7yQtjyrBp7ZRhaV7U97aa": 1
	},
	"next_comment_id": 78,
	"comment": {
		"1_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 1,
				"body": "> [mitya12342](#comment_3_1JbLCTCGcoo9qMSn2AN9EwEPGqECQhBFLs): Смотря зачем обходить и что ты понимаешь под обходомСкорее всего тебе хватит VPN'aА если серьезно, написал бред. Ты подключен провайдером через его же оборудование\n\nТы меня не понял. Вот к примеру, у нас есть сеть, траффик которой проходит через провайдера. однако возможно ли каким либо способом обойти провайдела имея в наличии сеть оптоволоконных кабелей к примеру. Ладно, если вайфай, там реально создать сеть в обход провайдера, особенно если плотность велика.\nЯ понимаю, что оборудование програмно и удаленно контроллируется провайдером. Однако реально ли это обойти?\nЭто чисто теоретические размышления.",
				"added": 1552055652
			},
			{
				"comment_id": 2,
				"body": "> [mitya12342](#comment_4_1JbLCTCGcoo9qMSn2AN9EwEPGqECQhBFLs): Хм, ну вообще если подзаморочиться, теоретически можно создать собственный аналог интернета на тех - же технологиях. Опиши подробнее чего ты хочешь. Локалку?\n\nя хочу, чтобы было использовать тот же zeronet даже в том случае, если упала центральная сеть (провайдер). Говорят, i2p работает по такому принципу, но видимо и он зависим от провайдеров.",
				"added": 1552058237
			},
			{
				"comment_id": 4,
				"body": "> [murzazade4](#comment_25_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp): Через сервер ничего не проходит. Через маршрутизатор проходит. Сервер выполняет несколько иные функции.\n\nя не корректно выразился.",
				"added": 1552106987
			},
			{
				"comment_id": 8,
				"body": "> [zerolespero](#comment_1_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL): Чисто теоретически можно как-то незаконно  подключиьься к магистральной линии, но это почти нереально (можно отрубить кабель и поставить туда свой, но тогда это поймут абсолютно ВСЕ, т к скорость упадет у всех(был случай когда перерезали кабель к Японии и весь трафик шел через Европу)).Куда более реальна-нереальна распределенная mesh-сеть подключенных между собой проводами или беспроводами роутерами, такая гиперлокальная сеть(см. B.A.T.M.A.N). В теории внутри такой сети может жить отдельный zeronet, который может связываться с внешним zeronet'om через некий шлюз или же развиваться отдельной ветвью (интересно что будет после объединения ветвей)\n\nвот это интересная мысль",
				"added": 1552155776
			},
			{
				"comment_id": 11,
				"body": "> [zxfhu](#comment_18_1SsjXjnUsU16iPMcUWAZnJXhdFSuvUGgp): в китаи twister с поддержкой DHT ДО СИХ ПОР НЕ СМОГЛИ ЗАБЛОКИРОВАТЬ а вот зеронет с его трекерами блокируют с переменным успехом а точьнее блокируют трекеры уже пол интернета просят в недрить в зеронет поддержку DHT НО ЭТО ПРОСЬБА ИГНОРИРУЕТСЯ РАЗРАБОТЧИКАМИ\n\nразработчики вообще живы?:)",
				"added": 1552163529
			},
			{
				"comment_id": 12,
				"body": "> [zxfhu](#comment_18_1SsjXjnUsU16iPMcUWAZnJXhdFSuvUGgp): в китаи twister с поддержкой DHT ДО СИХ ПОР НЕ СМОГЛИ ЗАБЛОКИРОВАТЬ а вот зеронет с его трекерами блокируют с переменным успехом а точьнее блокируют трекеры уже пол интернета просят в недрить в зеронет поддержку DHT НО ЭТО ПРОСЬБА ИГНОРИРУЕТСЯ РАЗРАБОТЧИКАМИ\n\nу меня чет не полуается твистер установить на арк:(",
				"added": 1552205166
			}
		],
		"2_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 3,
				"body": "> [gsdth](#comment_7_1CcyypQrRYWvbXbeqv7PFEdLi1imtPw9QW): Вкурсе решение простое https://www.youtube.com/watch?v=Y9z8Ik1DLcg\n\nкак бы не работает:( я проверял.",
				"added": 1552064731
			},
			{
				"comment_id": 5,
				"body": "> [gsdth](#comment_9_1CcyypQrRYWvbXbeqv7PFEdLi1imtPw9QW): Tails запрещает все соединения которые идут в обход tor разрешите соединения\n> ну или скачайте debian\n\nя то зеро использую на манджаро, все гуд. А вот именно на тэилс не получается",
				"added": 1552107038
			}
		],
		"1_1mGVkvn1kU9drvETUm8orvoBRppv4mNeQ": [
			{
				"comment_id": 6,
				"body": "> [deepstrelok](#comment_8_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh): Если будешь регистрировать, то учти следующее. Телефон должен быть либо левый, либо с подмененным IMEI. Это идентификационный номер трубки. Если вынешь из своей симку и вставишь другую, то корреляция для провайдера проще пареной репы. Местоположение для регистрации и включения мобилы должно быть никак не связано с тобой. Далее отключи смс для подтверждения транзакция в кошельке. И тогда ты сможешь его использовать без необходимости уже включать телефон. Регистрируй желательно через tor->proxy или tor->vpn, чтобы быть достаточно анонимным и тебя не забанили потом в киви за тор.\n\nэтого не достаточно. В киви НЕЛЬЗЯ проводить операции с неподтвержденного аккаунта.",
				"added": 1552155597
			}
		],
		"3_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 7,
				"body": "> [zxfhu](#comment_5_1SsjXjnUsU16iPMcUWAZnJXhdFSuvUGgp): хуета на скриптах линукса это\n\nона по типу зеронета строится, но там все платно я так понял. Я хз...",
				"added": 1552155723
			}
		],
		"3_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": [
			{
				"comment_id": 9,
				"body": "> [zxfhu](#comment_2_1SsjXjnUsU16iPMcUWAZnJXhdFSuvUGgp): вот чего нехвотает\n> А именно:\n> — Работа через DHT— IPV6— Мобильные клиенты— Реализация ядра сети на компилируемом языке\n\nipv6 в россии очень плохо развита, по крайней мере в нашем регионе (ее вроде двже в проекте нет)",
				"added": 1552155967
			},
			{
				"comment_id": 10,
				"body": "> [zxfhu](#comment_8_1SsjXjnUsU16iPMcUWAZnJXhdFSuvUGgp): на не скажи http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/data/users/1NqCJ96acuveouhVqKJFZSJJ7TtBXphHjG/src/e6c32f8d471c2dcd7ad17ba1467878e28606f421.mp4\n\nну сеть наших провайдеров до сих пор даже не планирует поддержку ipv6",
				"added": 1552156433
			}
		],
		"1_16ub71RfMGUoih2scMmudMUdiuJubCWWFb": [
			{
				"comment_id": 13,
				"body": "не смогли, но смогли усложнить жизнь. читал блог одного китайца",
				"added": 1552580306
			}
		],
		"3_16ub71RfMGUoih2scMmudMUdiuJubCWWFb": [
			{
				"comment_id": 14,
				"body": "он и раньше работал, только с переменным успехом",
				"added": 1552618984
			}
		],
		"10_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 15,
				"body": "крутяк:)",
				"added": 1552888836
			},
			{
				"comment_id": 18,
				"body": "> [promusik](#comment_66_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): Зачем?\n\nчувак в будущее смотрит))) людяс в децентразованных сетях тоже поиграть охота))",
				"added": 1552927399
			}
		],
		"1_1KDowLVWPX3uVoksFQ1e9Pw1ZA6xcLTfSX": [
			{
				"comment_id": 16,
				"body": "i2p в этом плане интереснее. Там у пользователей нет ip адресов, а трафик шифруется и смешивается с инфомусором, что делает его одним из самых безопасных. Но там мало людей сидит",
				"added": 1552927321
			},
			{
				"comment_id": 17,
				"body": "ну реальное шифрование в зеронете используется в Zeromail.",
				"added": 1552927344
			},
			{
				"comment_id": 19,
				"body": "> [reunion](#comment_1_1KDowLVWPX3uVoksFQ1e9Pw1ZA6xcLTfSX): Это уже зависит от моей активности\n\nлучше пересылай сообщения в зеромэйл. Как то читал коментарии баллансера, он писал, что там используется шифрование.",
				"added": 1552927869
			},
			{
				"comment_id": 21,
				"body": "> [bck](#comment_7_1DxGigTCBo6WXFTBNdktErhmnbq3vfMvJB): https://www.reddit.com/r/zeronet/comments/akhxwq/zeronet_network_analysis/для особо упоротых попробуйте проанализировать пакеты wireshark\n\nwireshark пытается получить доступ к корневому каталогу. Стремная прога",
				"added": 1552934950
			},
			{
				"comment_id": 22,
				"body": "> [bck](#comment_8_1DxGigTCBo6WXFTBNdktErhmnbq3vfMvJB): lol - эта стремная прога априори стандарт для анализа трафика, используются во многих дистрибутивах по пентест\n\nя забыл, как тогда убрать child mode у проги:))",
				"added": 1552935371
			}
		],
		"2_1CcyypQrRYWvbXbeqv7PFEdLi1imtPw9QW": [
			{
				"comment_id": 20,
				"body": "> [jsitr](#comment_3_16ub71RfMGUoih2scMmudMUdiuJubCWWFb): Запускаем zeronet в качестве трекера то есть каждый клиент может являтся трекеромделать это нужно только в том случае если у вас статический внешний ip\n> и так перейдите в папку / plugins в папке zeronet,а затем переименуйте «disabled-bootstrapper» в «bootstrapper»\n> http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:135:Changelog:+August+28,+2018\n\nа как быть с серым ip?",
				"added": 1552931583
			}
		],
		"3_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": [
			{
				"comment_id": 23,
				"body": "это не пугач. Военные уже тестируют закрытую сеть.",
				"added": 1553334267
			},
			{
				"comment_id": 34,
				"body": "> [agnen](#comment_1_16cQoCywUq1Bkh93AjTnwwyR1fURt3d186): спутники жде оневеб и другие\n\nглушить будут же",
				"added": 1555215147
			},
			{
				"comment_id": 35,
				"body": "> [syntia](#comment_58_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM): Военные против Народа? А разве не есть ли они часть народа, часть тех, У них же тоже есть родители, дети, жёны. Силовики он же не РОБОТЫ - они ЖИВЫЕ\n\nпромывка мозгов сильная штукенция",
				"added": 1555215178
			},
			{
				"comment_id": 37,
				"body": "> [ciklopit](#comment_2_1CTXZrGJQiFjTappyJ3dJpuyb7Wecw7iSp): Для начала чиновники усложнят работу OneWeb в России. Например, постановлением от 21 февраля правительство внесло изменения в Правила использования на территории страны спутниковых сетей связи, находящихся под юрисдикцией иностранных государств: https://www.rbc.ru/technology_and_media/26/02/2019/5c73f8109a79470cf4ea49c2\n\nне забываем о будущем глобальном интернете от Илона Маска. Правительство, правда на словах, обещало их глушить.",
				"added": 1555255577
			},
			{
				"comment_id": 40,
				"body": "> [nononono](#comment_32_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N): Качайте, люди, себе в оффлайн Флибусту, Википедию и мешок магнетов пока не поздно.И можно окукливаться - выживем )Я лично так и сделал уже.\n\nкстати, у зеронета есть шансы жить внутри рунета:) нас не так уж и мало:)",
				"added": 1555699999
			},
			{
				"comment_id": 41,
				"body": "> [sasiska](#comment_3_19sZ5x78VtERtZ3M6znWdbJoLdJYg152Hu): Поясните пожалуйста, два вопроса\n> 1) трафик, допустим фейсбука, фильтруеться так как он иностранный, и грузит медленно. А что будет с вконтакте? Он же типа на территории РФ, зачем его пропускать через dpi файрвол?\n> 2) если рунет перейдёт в автономный режим, будет ли он двухсторонним? За пределами России вк будет недоступен?\n\nну судя по закону, оборудование для фильтрации ставить будут не только для транзитных, но и для местных операторов.",
				"added": 1555902810
			},
			{
				"comment_id": 42,
				"body": "> [nononono](#comment_34_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N): Закон писали малограмотные маразматические старики с помощью некомпетентного ворья, которое нагреет на этом карманы. Это не фигура речи, это научный факт.\n> На самом деле, ИТ-специалисты которые как-то пытаются комментировать закон отмечают что никто не понимает КАК ИМЕННО будет работать технология Чебурнета - ни сами ИТ-специалисты, ни тем более умалишенные малограмотные старики это все придумавшие.\n> Поэтому вопросы типа \"а двусторонняя ли связь?\" или \" какова степень ограничения на транзитных узлах?\" смысла на данный момент не имеют. Как сделают, так и сделают.\n> Но можно догадываться что сделают как обычно по \"worst case scenario\", все сломают, ничего не будет работать, даже то, что по их мнению должно. Посмотрим.\n> Могу сказать только что некоторые мои знакомые, весьма далекие от околополитических вопросов и давно проживающих во внутренней эмиграции уже высказались в том смысле, что пойдут громить \"местный райком партии\" (не буду уточнять какой партии) непосредственно сразу после отключения глобального интернета...\n\nну они могут просто сделать по технологии КНДР.",
				"added": 1555949750
			},
			{
				"comment_id": 44,
				"body": "> [necronomikon](#comment_2_1MFbv1U8jdE9qBmjUxpxPmETNQ53fn1XsB): Про ZeroNet я сам не знаю - но i2p работать продолжит, а ТОР нет\n\nзеронет 100% работать будет. Даже внутри рунета, так как тут тоже есть трекеры.",
				"added": 1556248299
			},
			{
				"comment_id": 45,
				"body": "> [nononono](#comment_36_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N): Они в идеале это и хотят. Но у них не получится. В Китае интернет вообще по другому устроен, от слова \"совсем\".А вот сломать наш нормальный интернет у них очень даже получится.\n\nкндр - северная корея, а не китай. Но суть понятна:)",
				"added": 1556248400
			},
			{
				"comment_id": 46,
				"body": "> [iormungard](#comment_1_18rfzg99UZ36sYDxjNZ6rn2Krvdiq2QKpk): Чтож,вставлю свои пять копеек)я прочитал закон об изоляции интернета,и меня в нем насторожили два пункта.Первое-провайдер будет обязан устанавливать на своих серверах некое техническое устройство которое будет отвечать за этот процесс.Два-в случае потери стабильности сети из-за функционирования данного устройства провайдер освобождается от ответственности.Ну то есть вы понимаете,да?)тип если мы сломаем вам все то мы не при делах будем))и да-это скажется нетолько на жителях россии,так как тем же вк например со всего снг люди пользуются.Вобщем,как говорится на всякий пожарный окукливаемся и выживаем)скачиваем фильмы и прочее на компы и сьемные носители,чтоб в случае отключения хотя бы время занять можно было)и да можно сайты в офлайл выкачивать на компьютер чтобы смотреть их как HTML документ без доступа к интернету.Я например пользуюсь для этого прогой httrack website.Есть много выходов,даже тот же наш ZeroNet,но зеронет,фринет,тор и так далее это оверлейные сети то есть работают поерх существующего интернета то есть небудет интернета ничего из этого работать небудет.Если все пойдет по худшему сценарию,то мы вернемся в начало нулевых когда каждый мегабайт имел значение\n\nЗеронет, Скаттлбатт работают и в локальной сети.",
				"added": 1556306880
			},
			{
				"comment_id": 47,
				"body": "> [nononono](#comment_42_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N): А, ок )\n> Но какая такая \"технология\" в Северной Корее? Там просто нет сколько-нибудь значимого количества публичных сетей связи и персональных компов у населения в принципе. Вот и вся технология.\n> У нас это все есть и это уже не убрать.\n\nкомпы у них есть, но только в универах/компьютерных залах/офисах.  А в основном все пользуются смартфонами (они дешевле). Интернет у них называется Кванмён. Только я бы назвал это внутренней или локальной сетью, так как они не имеют доступа в открытый мир",
				"added": 1556307005
			}
		],
		"4_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 24,
				"body": "> [bvn13](#comment_17_19eXfGkykvbJgB7fb4TPYTkxWmuNTxeRMJ): http://127.0.0.1:43110/1BePmxd3c3fUg7ZcpuuUnTqjNP5sm4G3FH/?Post:2:%D0%9F%D0%B5%D1%80%D0%B5%D0%BD%D0%BE%D1%81%D0%B8%D0%BC+ZeroNet+%D0%BD%D0%B0+%D0%B4%D1%80%D1%83%D0%B3%D0%BE%D0%B9+%D0%BA%D0%BE%D0%BC%D0%BF%D1%8C%D1%8E%D1%82%D0%B5%D1%80\n\nспасибо:) ценная инфа",
				"added": 1553958245
			}
		],
		"3_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": [
			{
				"comment_id": 25,
				"body": "скачал jami, но прога крашится при добавлении контакта",
				"added": 1554049929
			},
			{
				"comment_id": 30,
				"body": "> [cxdh](#comment_2_1BEfUa5Z8wxcHLTUPtfFYMb9P5hwyv9ghk): у меня на mediatek норм работает\n\nобнова все исправила:))",
				"added": 1554744717
			},
			{
				"comment_id": 32,
				"body": "> [mistalero](#comment_65_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Тоже самое, обновления не нашёл.\n\nа у меня уже получилось добавить почему то, скажи как тебя там найти",
				"added": 1554916158
			}
		],
		"6_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 26,
				"body": "> [dude](#comment_69_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): команду верно прописываешь?ос какая? права на доступ в порядке?\n\nпрописываю как надо, на zeroME я скрин выложил. Манджаро ОС, делаю под рутом. Просто нет этого файла. Создал файл через рут, он пустой, надо будет настроить.",
				"added": 1554133246
			},
			{
				"comment_id": 27,
				"body": "> [dude](#comment_69_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): команду верно прописываешь?ос какая? права на доступ в порядке?\n\nдело в том, что на арке нет нормального рабочего пакета. Скачал с офсайта пакет, запустил его через рут, сразу стартует сервер, но при этом не было файла yggdrasil.conf",
				"added": 1554133895
			},
			{
				"comment_id": 28,
				"body": "> [skrimix](#comment_1_1EvxfCoxLud3PxCZznczb2idoKKJeUB3TU): Можно создать конфиг вручную:sudo yggdrasil -genconf > /etc/yggdrasil.conf\n> (еще в AUR есть пакет)UPD: Судя по скриншоту ты генерировал конфиг, но не записал его в файл?\n\nага, с командой -autoconf, так как файла не было. В AUR пакет не билдится почему то",
				"added": 1554310188
			}
		],
		"5_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 29,
				"body": "> [promusik](#comment_69_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): Что такое RT-ядро? Юзаем обычное Linux. 5.1 вроде в Arch завозили. Не помню какое там на ноуте, ноут на работе, но 5 точно.\n\nRT - Real Time ядро. Да, на арче 5.1 экспериментальное завезли",
				"added": 1554310387
			}
		],
		"7_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 36,
				"body": "> [bck](#comment_9_1DxGigTCBo6WXFTBNdktErhmnbq3vfMvJB): Что ты блять несешь?\n\nтак если что не так пишу, поправь меня. Прочитал про это на 2ch.hk в архивных постах, так как все топики про это удалены.",
				"added": 1555215266
			},
			{
				"comment_id": 38,
				"body": "> [7heaven](#comment_21_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6): Надо нажать на кнопочку там по рефрешенгу картинок. И пойдут обновления.\n\nесли есть список мест, категорий и предпочтительные настройки - поделись:)",
				"added": 1555259418
			}
		],
		"1_1Hv6XQPZGmAkb47zJy7ednE7gBRCCJCQYp": [
			{
				"comment_id": 33,
				"body": "идея хорошая.",
				"added": 1554999150
			}
		],
		"2_1CV23652pUmbK7yQtjyrBp7ZRhaV7U97aa": [
			{
				"comment_id": 39,
				"body": "полезно, спасибо!",
				"added": 1555442774
			}
		],
		"2_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": [
			{
				"comment_id": 43,
				"body": "наткнулся на просторе онион сайтов, давно было, не помню.",
				"added": 1556247969
			}
		],
		"1_19gRLjtUrPaPWE4KP4SsSmN5tb2VAizRwA": [
			{
				"comment_id": 48,
				"body": "идея отличная. Но у нас не любят спам, сам знаешь.",
				"added": 1556307083
			},
			{
				"comment_id": 61,
				"body": "> [mistalero](#comment_67_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Звал на форуме изумрудного города, вот обсуждение:http://izumgorod.borda.ru/?1-6-0-00000258-000-0-0-1550720468\n\nупоротые люди там:)",
				"added": 1556907927
			}
		],
		"1_1HEgim6JmWnJtP5j4MwCZmnL6DuxPHZAna": [
			{
				"comment_id": 49,
				"body": "как поставить андроид one  на redmi note 4x?",
				"added": 1556307177
			}
		],
		"1_1CeHSx1CD4X96QGJcd66dBYGwHjXiUfnm9": [
			{
				"comment_id": 50,
				"body": "> [danilpleyoffical](#comment_1_1CeHSx1CD4X96QGJcd66dBYGwHjXiUfnm9): 7мб это много? темболее я пытался и с файлом на 1.4мб, тоже самое.\n\nта же ошибка. так что это не проблема самого файла, что то не так с зеро мьюзик.",
				"added": 1556554606
			},
			{
				"comment_id": 54,
				"body": "> [danilpleyoffical](#comment_2_1CeHSx1CD4X96QGJcd66dBYGwHjXiUfnm9): Спасибо всем кто \"помог\". Все само починилось.\n\nкак? что ты сделал? мне тоже интересно",
				"added": 1556556407
			}
		],
		"2_13yET77xHP1vpHmJf9a3fbdct3vB5PpzWT": [
			{
				"comment_id": 51,
				"body": "а не проще скачать уже вылеченный? Или просто бери програмку с уже готовыми ключками.\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde/1556555849-KMSAuto%20Net.exe",
				"added": 1556555877
			}
		],
		"1_13yET77xHP1vpHmJf9a3fbdct3vB5PpzWT": [
			{
				"comment_id": 52,
				"body": "обнова была какая то? видимо что то подчистило твою папочку.",
				"added": 1556556299
			}
		],
		"2_1Jtas1e392Kx9sfvZKnCQR8HMH7gcJ1FpW": [
			{
				"comment_id": 53,
				"body": "у нас для защиты путина есть росгвардия",
				"added": 1556556342
			}
		],
		"1_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": [
			{
				"comment_id": 55,
				"body": "> [midnight](#comment_1_1D6npYBZc43Bv1a62Fg689SDcFdthJSFt): Почему \"Вы\" постоянно ругаете Путина?Почему вы ничего не говорите про медведева? Губеров в своих регионах? и других чиновников?Когда Путин ездил по регионам и проводил встречи, почему не спрашивали про окуевших чиновником/глав?Почему вы не прочитали конституцию ведь там пзд полный, к примеру \"президент не имеет права не подписывать\"(107 ст. 3 часть). и комментарии типа \"нах он нужен тогда\" или \"груди-ниный или собачка смогли бы\" это просто слова девочки-далбае№а.\n\nпотому что президент в ответе за тех, кого приручил.",
				"added": 1556556539
			}
		],
		"1_1PNNLHx1b2tCBWA8B8TkW4r9rCEi7TeTKy": [
			{
				"comment_id": 56,
				"body": "> [kalidman](#comment_6_1PNNLHx1b2tCBWA8B8TkW4r9rCEi7TeTKy): Помогите найти , всё хотел борду русскую найти\n\nhttp://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/index.html?v=topic+id=1PiXrhT1UjMZmJc5WFhfUxourdfapeHJ8otopic27",
				"added": 1556593147
			}
		],
		"1_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL": [
			{
				"comment_id": 57,
				"body": "дайте знать потом, получилось или нет.",
				"added": 1556642169
			},
			{
				"comment_id": 67,
				"body": "> [zerolespero](#comment_19_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL): если нужны все сайты то всю папку data, если только пользователя перенести то только файл users.json (в папке data)\n\nэто не всегда работает... сайты то сохранятся, только в тот же хаб на зеро.ме ты уже не залогинишься (у меня такая трабла была, пришлось хаб менять)",
				"added": 1557246434
			}
		],
		"1_1DESK8jcspe5Vm7YzVunRWbirYNLBtVPWF": [
			{
				"comment_id": 58,
				"body": "> [arktur](#comment_6_15Ju8XcwDDYi74R9WZRks3RGyHVApvLxNv): о либерасты, на зарплате?\n\nна зарплате как раз таки не либерасты:)",
				"added": 1556906569
			},
			{
				"comment_id": 59,
				"body": "https://www.youtube.com/channel/UCdfi9ZwQHiF2Fj2vX27ujrQ/videos - о религии и не только\nhttps://www.youtube.com/channel/UCOoeCBijS9yPtFqYa1S-w2Q/videos - юмористическая и не только сатира (не камикадзе)\nhttps://www.youtube.com/channel/UCL4Ttqmg5Y0yz7A0ldl6Guw/videos - песенки на злободневные темы \nhttps://www.youtube.com/channel/UCCROBQj3rdGNc-E_aMpbV_A/videos - соцальный и психологический научпоп\nhttps://www.youtube.com/channel/UCMBHv1373q3BSjx8EzkJKfw/videos - аналог быть или... или скорее прототип быть или.",
				"added": 1556906972
			},
			{
				"comment_id": 60,
				"body": "https://www.youtube.com/channel/UC3MHsjzwi65Ee1BCY64QKvg/videos - утренние новости перед работой\nhttps://www.youtube.com/channel/UCt6nsWw2kQNszwpuuHoxBLA/videos - непереодические интересные обзоры\nhttps://www.youtube.com/user/ilyavarlamov/videos - обозреватель градостроения\nhttps://www.youtube.com/channel/UCr3pz_CXjF_tURtZsD6itig/videos - религия и не только\nhttps://www.youtube.com/channel/UCC7Y_QxXOpY2IlJgMRJ1DHg/videos - обзорщик",
				"added": 1556907238
			}
		],
		"15_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 62,
				"body": "да тут еще нормально, на клирнетовских ресурсах дерьма побольше",
				"added": 1556957686
			}
		],
		"1_1AefSRYaJKZg4XhSbQJs2GtNA4cur8h1Qp": [
			{
				"comment_id": 63,
				"body": "где ты нашел это, источник",
				"added": 1556960924
			}
		],
		"3_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": [
			{
				"comment_id": 64,
				"body": "это прошивки на все смартфоны? Ознакомился, крутая штука. Только на сяоми нужно разблокировать загрузчик\n",
				"added": 1556984702
			}
		],
		"1_1Q2oiwBnWeN5SpZR9UFAETu4cMqHs1uD6": [
			{
				"comment_id": 65,
				"body": "если каждый будет трекером, то это будет реально децентрализованная сеть.",
				"added": 1556986810
			}
		],
		"1_1B5kPsVmi5Uy9dDuZau6Fo2LwR9deN6LXa": [
			{
				"comment_id": 66,
				"body": "http://127.0.0.1:43110/1BpFtPez7mSiShtXfb4wPfMT1dZTuRybfZ/\nhttp://127.0.0.1:43110/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/\nhttp://127.0.0.1:43110/1Jb5ZdmvTzVnHpa2hayjQk3H2kZgNVbmBb/\nhttp://127.0.0.1:43110/15zr8fG5h9FZu6dt5CC9kQ1F7PMpiGu6Tm/\nhttp://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/\nhttp://127.0.0.1:43110/Me.ZeroNetwork.bit/\nhttp://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/\nhttp://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/\nhttp://127.0.0.1:43110/big.kopykate.bit/\nhttp://127.0.0.1:43110/ZeroPolls.bit/\nhttp://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/\nhttp://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/?/\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/\nhttp://127.0.0.1:43110/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/?!/\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/\nhttp://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/\nhttp://127.0.0.1:43110/186THqMWuptrZxq1rxzpguAivK3Bs6z84o/\nhttp://127.0.0.1:43110/Sites.ZeroNetwork.bit/\n\nЭто только база. Сайтов на самом деле еще больше, зависит от твоих \"особых\" вкусов.",
				"added": 1557246328
			}
		],
		"2_14JmpT6tbroLtkGYQMAkUJHQLRmqWk2pxz": [
			{
				"comment_id": 68,
				"body": "CQEGAcGgxsBNBFzJkuABCAC9GGv3+L8idR4pwvKjdBh4dgCqnEYnxUy0ktX3Pd3Y\nHXvm11icf/Kjhbk8JyOuY9eUo5gSdW1LHecIb+gddWdSVXLNzgeMUbaqo41jMTfI\nukbZ8AwfvymOC8fGMRhJ3qLzLZ/xkUnLtL47j5c03z2DXkGS1/kg/p/83U+3oYxS\nCIz/UjEmqyRHLKK5x3xMSDGjn4sveVU+tPaBVHIAt6iip4AKcReNkVYrhMTygixM\nagGaJlBu/DKTgM02/E+zV1wNxy8kMMPXI+l6RVJwz5zwQyCthSXG9grs4Ckg5gHq\nIDViUaAPQLra1Y4QGjFvWJ79PedjTPEXh6/KgE1TRPwrABEBAAHNLERlbGlyaXVt\nR29kZGVzcyAoR2VuZXJhdGVkIGJ5IFJldHJvU2hhcmUpIDw+wsBfBBMBAgATBQJc\nyZLgCRCQTsZU6thjvAIZAQAAN48H/33ZUbVqonBeoJHq6JYm+d3JXLQtUUjz3Ne1\n5Q3wWIyapv52cSOtfyOvrWxVW+R+aYMec0imEpvAUY1cu+4Osprg8pSTbLrUJ83O\niekWDTkL6ynjmTEAz1mlH9962XMtK0TFj9r2Y7R/OA2mnqEzClM1gj2aQdR0GPW5\nJiWu1Cw5NMB6g6Vh4upnVAVBfCIsapSmyiKY9z+CMmi0H9+sWcD9B5gONVh4nLhE\ngvyNKf5WLOgYXUByLYrWhxZ/1mE+0JGLtgdXzWjU8XIjWYr6sb557QwPTbL2G1pL\n+bPbI+f2E7I1Zx4nnlN7Kfp1NfYpzflwOHPwBoT5fdB4r48dEzMCBlvxgG0SugMG\nwKgAaRK6BAAGC015IGNvbXB1dGVyBRDtZ9/xSXkfzVN0Jkl8sRFyBwMR1Os=",
				"added": 1557246903
			}
		],
		"1_1PmTT7rXXV3k1cEr4ecFR3DPEbR2biHbuj": [
			{
				"comment_id": 69,
				"body": "картинки не отображаются толком. По клику отображаются картинки автора форума. Другие нет",
				"added": 1557656798
			},
			{
				"comment_id": 70,
				"body": "> [anonymouslogin](#comment_12_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Похоже это спам\n> \"cloned_from\": \"1Q9LrWv27gyToaqDXA2GF2ZSA6PhznX7z1\",\n> ...\n>   \"admin\": \"tangdou\",\n>   \"admin_href\": \"http://127.0.0.1:43110/Mail.ZeroNetwork.bit/?to=tangdou\",\n> ...\n> \"languages/zh.json\":\n\nскорее просто не совсем адаптированная копия сайта",
				"added": 1557657146
			},
			{
				"comment_id": 72,
				"body": "> [anonymouslogin](#comment_14_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): А новый топик с очередным спамом?\n\nспам - навязчивая рассылка реклама. Тут рекламы нет, даже скрытой. Нет и навязчивой рассылки. Люди пытаются делать контент",
				"added": 1557686182
			}
		],
		"1_1B1waSUNg8146uRLQncLdRNwCF2ttSrAtk": [
			{
				"comment_id": 71,
				"body": "тестирую.",
				"added": 1557685994
			}
		],
		"3_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": [
			{
				"comment_id": 73,
				"body": "change zeronet.conf and write --tor_controller localhost:9151 and it works! Tor always mode doesnt give error. and i`ve got trackers.",
				"added": 1558190857
			}
		],
		"2_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": [
			{
				"comment_id": 74,
				"body": "> [gluek](#comment_17_1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi): Разве к остальным не будет подключаться через Tor?\n\nнет, если не ввести корректные настройки",
				"added": 1558203536
			}
		],
		"1_1FHnuq52Et74p1YGGFtGd2xrKTUBjEqjbm": [
			{
				"comment_id": 75,
				"body": "тут есть переводчик???",
				"added": 1559319731
			}
		],
		"8_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 76,
				"body": "> [if0](#comment_26_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Робко предположу, что здесь нет пользователей сабжа...\n\nда хотя бы поразмышлять. А то его рекламировали на днях, хотя и давно разрабатывается.",
				"added": 1559412093
			}
		],
		"2_1532gmVR6nUwMS85i4JTgiqQY1rn44pkd3": [
			{
				"comment_id": 77,
				"body": "> [syntia](#comment_71_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM): Кто пробовал этот Jami? Насколько он удобен в управлении?\n\nу меня установлен, но общаться не с кем",
				"added": 1559980688
			}
		]
	},
	"comment_vote": {
		"55_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": 1,
		"57_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": 1,
		"35_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N": 1,
		"60_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": 1
	}
}