{
	"title": "Anton Kovalenko",
	"description": "Попробуем по-русски (c) r_l",
	"links": "*   я в [Facebook](https://facebook.com/anton.kovalenko.566), в [ЖЖ](https://akovalenko.livejournal.com), на [LOR](https://www.linux.org.ru/people/LeninGad/profile), на [Github](https://github.com/akovalenko)\n\n*   [Source code](https://github.com/HelloZeroNet)​​​​​​​​​​",
	"next_post_id": 9,
	"demo": false,
	"footer": "Powered by [ZeroNet](https://zeronet.io) [open, free, and uncensored]",
	"modified": 1584772728,
	"post": [
		{
			"post_id": 3,
			"title": "Почему здесь?",
			"date_published": 1537109931.816,
			"body": "Потому что записи будут жить как минимум до тех пор, пока они кому-нибудь интересны (включая меня). Прощайте, нормы сообщества Facebook, и Роскомнадзор тоже до свидания, и EU Articles 11 & 13, и что там ещё придумают умные не в ту сторону люди.\n\nПридётся, конечно, заботиться, чтобы приватные ключи остались доступны мне и не попали в плохие руки, но эта забота для меня привычная и всё равно неизбежная по другим причинам. Хорошо бы иметь удобные протоколы для отзыва и замены ключей, но эта задача в децентрализованных сетях ещё по-человечески не решена (может, именно в ZeroNet и стоило бы обкатывать перспективные варианты решения).\n\nЯ выбрал прозрачную псевдонимность вместо анонимности, потому что мне так интереснее. Так что от посадки в тюрьму за репост меня ZeroNet не защитит; но по крайней мере сам репост останется на месте, что уже достижение. Тех, кто заходит прокомментировать, мой выбор никак не связывает: от них не требуется ни аусвайса, ни реалнейма, ни соответствия нормам сообщества.\n\nПод капотом здесь SQLite3, JSON, эллиптическая криптография, Python, JS и всякое такое, всё в диапазоне от прекрасно известных любимых инструментов (SQLite) до кое-как понятных и всё-равно-придётся-осваивать-а-куда-денешься (JS). Многое крутится вокруг вещей, интересных мне самих по себе (content-addressable storage, Merkle trees). В общем, если мне захочется какую-нибудь хитрую агрегацию-архивацию-поиск по блогам, очень даже понятно, как сделать такую штуку, по крайней мере для личного пользования."
		}
	]
}