{
	"next_topic_id": 2,
	"topics": [
		{
			"topic_id": 1,
			"title": "Hidden content within site... http://127.0.0.1:43110/1FjxvRMjBw5CUKpY3TCn76tszxHegohFqV",
			"body": "I noticed the web page is just movie listings, but if you look inside the folder under data/dima kokes on your local hard disk, they include gay porn. WTF? More to the point, what content are we exactly hosting that is not exposed web page side but stored on our hard drives?",
			"added": 1436594905
		}
	],
	"next_message_id": 7,
	"comments": {
		"3@2": [
			{
				"comment_id": 1,
				"body": "Save last position on previous page. I notice that sometimes pages are back at the top when you go back on a page... I don't know if this is a ZeroNet quirk, or a ZeroTalk quirk.",
				"added": 1434825750
			},
			{
				"comment_id": 3,
				"body": "> [QuickSilver](#comment_3_230): SCALE, SCALE, SCALE... We need torrent-like, file splitting for big file support, I think this is critical for splitting databases and updating the part that changed and not the whole thing.. We seriously need this to be able to scale...\n\n@QuickSilver - I'm under the impression file transfers are directly via peer, file by file. Torrents work by file pieces which current do not respect the boundary of files (file piece is a fixed size except for last file piece in the torrent). I think the same issue has been a struggle for Project Maelstrom as well. Their streaming or downloads of large files are not being sent efficiently. Maybe updated content could utilize rsync so only the deltas are sent rather than entire new files. I'm not sure how ZeroNet works in this respect, so they may already be doing this... I know large files and large sites are not well supported in ZeroNet. I have impossible time trying to stream MP4 nor trying to download 3GB Mozilla Dev Network.",
				"added": 1435293178
			},
			{
				"comment_id": 4,
				"body": "> [brunoloff](#comment_4_213): One click install of zeronet as a chrome/firefox extension using Python compiled for NaCl (chrome native-client) or asm.js. That is my idea, though I'm not up for doing it myself atm.\n\nProject Maelstrom is using a Chrome extension, but the whole setup is limited to a specific browser. The proxy idea means any browser can be used... It'd be neat though to have the data stored in HTML5 WebSQL or IndexedDB as an alternative way to store data.",
				"added": 1435295253
			}
		],
		"1@223": [
			{
				"comment_id": 2,
				"body": "every time I try to connect to Zero Mozilla Developer Network, the client freezes. ZeroNet seems to be fine for small sites, but I'm not sure why it is choking on bigger sites... I tried another site with a MP4 and it also choked on that. ",
				"added": 1434898078
			}
		],
		"1@219": [
			{
				"comment_id": 5,
				"body": "issue a warning to whom? the site owner? who is liable for the content - the site publisher, or every peer that hosts it? ",
				"added": 1436669193
			},
			{
				"comment_id": 6,
				"body": "the gay porn seems to be gone now. maybe the author read this post.\n\nthe issue was more about \"hidden\" payloads. the webpage you visit is just HTML, javascript, css, and images... but there may be files not referenced by the webpages that are transferred as well. could be gay porn this time, but what if it something worse? ransomware, child porn, etc?",
				"added": 1437178559
			}
		]
	},
	"topic_votes": {
		"1287@69": 1
	},
	"comment_votes": {
		"3@230": 1
	}
}