{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1576436753,
			"title": "Could ZeroNet be adapted to run on the web browser?",
			"body": "It would obviously have to be built using WebRTC. One thing I'm not clear on is how WebRTC handles CORS. Can I set up my WebRTC javascript code so clients that are connecting from other domains can connect to the peers using my domain? This would be essential to basically not make it centralized with some p2p elements like Bitchute. Could peers connect even from copies of the code stored on 127.0.0.1? How about from file:// URLs?",
			"added": 1576436752
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1574566358_13ak56mPXaCQC7oXYz8YWKfnkU1rRhnXuB": [
			{
				"comment_id": 1,
				"body": "somebody (don't know who) also set up 08chan.bit",
				"added": 1574619340
			}
		],
		"1570109199_1N4DSSHorDvEkDGkQfUhnnryYiTdtUW8hU": [
			{
				"comment_id": 2,
				"body": "bump",
				"added": 1574817314
			},
			{
				"comment_id": 3,
				"body": "> [emmet](#comment_34_1N4DSSHorDvEkDGkQfUhnnryYiTdtUW8hU): Yeah the problem is peer discovery of nodes running the fork. Not sure if the protocol allows us to request the trackers only peers running a certain version of the software.\n\nWould it be possible to upload a secondary instance of each file on the tracker so that modified clients can find other clients with the same features more easily, maybe by appending some kind of suffix to the file name or something like that?\nAlso long term ideally some kind of DHT functionality would be incorporated into ZN itself.",
				"added": 1574817678
			}
		],
		"1575704355_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 4,
				"body": "I agree. You know what the solution is? Go into 8kun niche boards for whatever hobbies you are interested into. Or old school online forums, but then you gotta deal with the drama and self censor or you'll get banned.",
				"added": 1575825906
			}
		],
		"1576213352_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 5,
				"body": "I've been feeling more tired than normal and have difficulty sleeping... But it's probably that I need to ease up on the coffee and not microwave weaponry.",
				"added": 1577008022
			}
		],
		"1576494373_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 6,
				"body": "I'd rather be able to make something work without hours of research, sorry.",
				"added": 1577008619
			},
			{
				"comment_id": 7,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1376_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): the useless ones lol.Kiddo it took me three to four years to remove 'all the crap' and make it works 'a little bit more like it was before the Mob Came Into It'. [...]\n\nlol",
				"added": 1577031988
			},
			{
				"comment_id": 8,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1376_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): the useless ones lol.Kiddo it took me three to four years to remove 'all the crap' and make it works 'a little bit more like it was before the Mob Came Into It'. [...]\n\nLARP confirmed. please stop posting until you take your meds, schizo fren",
				"added": 1577032056
			},
			{
				"comment_id": 9,
				"body": "> [randomshits](#comment_341_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Nice platitude, with so many years of practice, it is comical that you couldn't even name one element of removal.We can call this troll practice, you currently scored a D -\n\nI removed kebab.exe\nam I l33t hax0r?",
				"added": 1577033084
			}
		]
	},
	"comment_vote": {}
}