{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1550498248,
			"title": "Hiding post from user but not muting/blacklisting users",
			"body": "Hello guys. Someone knows, how can I hide&delete a certain user posts (but not blacklisting user) if I am not a site owner?",
			"added": 1550498247
		},
		{
			"topic_id": 1550688425,
			"title": "ZeroNet over I2P",
			"body": "Hello guys, is it possible to make zeronet over I2P-network?",
			"added": 1550688423
		},
		{
			"topic_id": 1567146893,
			"title": "Catalog of tracker list in zeronet network",
			"body": "Hi guys. Are there any zites inside zeronet network with trackers list like [spammer blocklist](http://127.0.0.1:43110/1CufK1ZtvekbFXEpSyKT2gDjf9jnqW8KwG/)?",
			"added": 1567146890
		}
	],
	"topic_vote": {
		"1564701974_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1548974921_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7": [
			{
				"comment_id": 1,
				"body": "So, it's sounds great but what about moderation in hubs? Do it has a simple GUI like in original (a.k.a. vanilla) Millchan? Or you can change/delete posts and ban users only by editing in __/data/users/content.json__?",
				"added": 1550420901
			},
			{
				"comment_id": 2,
				"body": "> [pexo](#comment_62_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): As things are right now, you can only moderate by editing the content.json. GUI moderation is probably coming at some point in the future.\n\nOkay, got it. But how can I delete only one or several posts and don't touching an entire posts there?",
				"added": 1550497839
			}
		],
		"1550498248_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": [
			{
				"comment_id": 3,
				"body": "> [styromaniac](#comment_536_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): If the account is a ZeroID, then ZeroID.bit is the answer.\nHow?",
				"added": 1550499533
			},
			{
				"comment_id": 4,
				"body": "> [styromaniac](#comment_537_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): http://127.0.0.1:43110/zeroid.bit/\n\nyeah, I know this web-site. But how can I do that in that site.",
				"added": 1550503486
			},
			{
				"comment_id": 5,
				"body": "> [leftside](#comment_627_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): U try to put the username to hide&delete in the text box in that site. Then the block or hide button will appear.\n\nBut it will mute **all** user posts.",
				"added": 1550504488
			},
			{
				"comment_id": 6,
				"body": "> [styromaniac](#comment_542_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Note: Muted user file deletion isn't a thing yet. If you see a photo you don't like, then manually delete before you mute.\nSo as I understand correctly, even If I mute a user, I will still seed his all files?",
				"added": 1550504740
			}
		],
		"1550686723_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp": [
			{
				"comment_id": 7,
				"body": "psywiki.bit\n\nzite hash: http://127.0.0.1:43110/1HLQFz4raaGYKsGjHMWhtkdtkKhMg3e8t8",
				"added": 1550688287
			}
		],
		"1550688425_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": [
			{
				"comment_id": 8,
				"body": "> [nekololi](#comment_338_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): it might be possible currently with modification to zeronet's code, and the end result might be that you will only be able to peer with other i2p network nodes. [...]\nIt's strange because I2P is much better for P2P-hosting than Tor network.",
				"added": 1550692781
			},
			{
				"comment_id": 9,
				"body": "> [kaffie](#comment_791_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh):  Can you explain what benefits there are to adding i2p?\nAs far as I know, i2p has a **true decentralization** in opposite to Tor, which in fact is only partly has an decentralization.",
				"added": 1550815070
			},
			{
				"comment_id": 10,
				"body": "> [kaffie](#comment_794_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Yeah it just sounds like a variant of Tor albeit with improvements or something. Not exactly as a replacement for ZeroNet or cjdns/yggdrasil.\nBut I think it can be replacement for Tor.",
				"added": 1550918031
			}
		],
		"1566642594_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 11,
				"body": "> [gitcenter](#comment_943_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Ok, a new plugin version is released. Please update. The bugs should be fixed.\nAs I understand, you need the last version of Zeronet for this. Can you explain me step-by-step, how can I update to the last version. I tried to do this by clicking a three dots in home page. But it said that I am on the last version of Zeronet. So, how can update my ZN client manually?",
				"added": 1567522396
			},
			{
				"comment_id": 12,
				"body": "> [gitcenter](#comment_946_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): What is the current version that you are using?\n0.6.5 rev3870",
				"added": 1567523130
			}
		]
	},
	"comment_vote": {
		"680_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"7_1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi": 1,
		"808_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"5_14hmCEXpoVdYQqeve93LpieDx2k8aFyT66": 1,
		"947_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1
	}
}