{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"3_1DXxyNnRKTvzUcuvQhTu8uWSXSNYL4oVc6": 1
	},
	"next_comment_id": 14,
	"comment": {
		"1_1QCcM4agXg7FRWFzojQbbdLwvXBYzDk8P7": [
			{
				"comment_id": 1,
				"body": "> [vvvolf](#comment_4_1266Hr6Kd2eoa89F6FeAeKu21FZSwYjpPw): Вот этот момент так никто и не прокомментировал.\n> Я так понимаю, распространится подписанный \"вытертый\" контент.\n\nДа, пропадет. Пользователь может делать со своим контентом все что угодно, кроме как менять структуру БД. А владелец сайта и вовсе может  все. ",
				"added": 1490130276
			}
		],
		"2_1P4JgrDmoDjXmkryqijVkod4TEKebK5TDj": [
			{
				"comment_id": 2,
				"body": "Пиры — это известные пиры. Чем больше времени пользуешься с установки зеронета, тем больше пиров видишь.",
				"added": 1490130472
			}
		],
		"1_1P4JgrDmoDjXmkryqijVkod4TEKebK5TDj": [
			{
				"comment_id": 3,
				"body": "Какой торрент? Тут есть сайты использующие webtorrent, но для их использования он должен быть отдельно установлен и пиры должны быть. Ещё тут есть например каталоги магнит-ссылок с фильмами и сериалами, но там пиров нужно найти по DHT, а на это влияет история закачек торрент-клиентом.",
				"added": 1490175372
			}
		],
		"2_1266Hr6Kd2eoa89F6FeAeKu21FZSwYjpPw": [
			{
				"comment_id": 4,
				"body": "Первое, можно держать отдельную ноду офлайн. Например для подготовке материала и для разработки новых сайтов.\n\nВторое, в зеронет возможно использовать криптографию с открытым ключом, по тем самим пользовательским ключам или ключам сайтов. ZeroMail так работает, кто-то делал и сервис для приватных заметок. Но от отслеживания активности пользователя это не убережет.",
				"added": 1490330989
			}
		],
		"1_1PYgJnbJ11uVGSiaRztMnwFycujEvNcdn": [
			{
				"comment_id": 5,
				"body": "1. Можно склонировать существуютщее, например если нужен бложик или форум. http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:3:How+to+have+a+blog+like+this\n\n2. Пример того, как создавать с нуля: http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:99:ZeroChat+tutorial+new",
				"added": 1490529928
			}
		],
		"3_1DXxyNnRKTvzUcuvQhTu8uWSXSNYL4oVc6": [
			{
				"comment_id": 6,
				"body": "Да, был. Да, не показали. Да, цензура. Хочешь поговорить об этом? ИМХО, цензура вполне приемлема для людей, так чего возмущаться? ",
				"added": 1490986178
			},
			{
				"comment_id": 7,
				"body": "> [pin240](#comment_2_1DXxyNnRKTvzUcuvQhTu8uWSXSNYL4oVc6): Наши черти не хуже американских  миллиардеров. Зажрались и в наглую обдирают народ.\n\nДа. Ну и что. Менталитет такой у народа. Власть вполне соответствует.",
				"added": 1491246174
			},
			{
				"comment_id": 12,
				"body": "> [zalex](#comment_77_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): Простите за оффтопик, но не забывайте, други, о новой фиче блокирования таких, как downfal8. Идем в ZeroID, вбиваем его ник, нажимаем на \"Mute\" и вуа-ля!\n\nДа, конечно. Хотя я бы посрался. Эти мрази уже начали открыто выступать против России, Конституции, Флага и Дня России.",
				"added": 1492071547
			}
		],
		"1_1AdwBQjEYfBQhVGaAjF5X3y2UfvBxS4BCr": [
			{
				"comment_id": 8,
				"body": "> [oo7o6y](#comment_15_1AdwBQjEYfBQhVGaAjF5X3y2UfvBxS4BCr): безумны те, кто говорит но не может свои слова обосновать, тем более невежы даже не знающе что такое фашист\n\nУважаю за самокритику!",
				"added": 1491246338
			}
		],
		"4_1DXxyNnRKTvzUcuvQhTu8uWSXSNYL4oVc6": [
			{
				"comment_id": 9,
				"body": "То что сайты блокируются без законного основания, что в этом удивительного? Россия же. Да и в культуре явно прослеживается посыл — жить по понятиям, а не по закону.",
				"added": 1491326499
			}
		],
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 10,
				"body": "> [epyl](#comment_1_1MCHKALe4qNVV6YmuvbnUyC8SV2MUFZ6Ku): стоит ли портировать сюда свой блог и возможно ли это?\n\nЕсли ты сможешь ответить на вопрос \"зачем?\" то с этими двумя будет проще.",
				"added": 1491515708
			}
		],
		"1_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS": [
			{
				"comment_id": 11,
				"body": "То ли это просто результат невежества следствия, что вполне вероятно, то ли такой знак технически продвинутым гражданам, насчет тора, обхода блокировок и неповиновинию власти, что тоже вполне вероятно. Отвратно, этот арест будто пуля просвистевшая у виска. Нужно принимать больше мер предосторожности в сети и при обращении с информацией. А чел конкретно попал, теперь если не это, то что-либо найдут на его компе, за что можно наказать и это найдется. ",
				"added": 1491914771
			},
			{
				"comment_id": 13,
				"body": "И чем же это Tails безопаснее?",
				"added": 1492252031
			}
		]
	},
	"comment_vote": {
		"77_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS": 1
	}
}