{
	"next_post_id": 6,
	"next_comment_id": 1,
	"next_follow_id": 2,
	"avatar": "generate",
	"user_name": "Topnet",
	"hub": "15mV5T1R1wxg3E1FPsvZw19bw6QzvRREfn",
	"intro": "*   [p2p software](http://127.0.0.1:43110/1P5Sybb44xTi6T6o5e2buZ8SR1zdsbX3Ae/)\n\n    [My YouTube - ZeroNet Channel](http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?My)\n\n*   [p2p blog](http://127.0.0.1:43110/1N3KuCTPnU4gWmHpJKfv6kLJV4xuYiaeGP)\n\n*   [Полезные статьи](http://127.0.0.1:43110/1Mv6N3tZD8txahjwRCKXWe5U86wWYzfnLB/)\n\n\n\n",
	"post": [
		{
			"post_id": 1589954430,
			"body": "IEEE Standards Association Launches an Open Source Collaboration Platform\n\nBrief: IEEE Standards Association has announced a GitLab-based open source collaboration platform. Read how is it different and what advantages it has.\n\nIEEE is the world’s largest technical professional organization dedicated to advancing technology. The IEEE Standards Association (IEEE SA) is an organization within IEEE that develops global standards in a broad range of industries.\n\nThe IEEE Standards Association (SA) has come up with an open-source collaboration platform i.e IEEE SA Open.\n\nIt is technically a self-hosted GitLab instance combined with Mattermost (a slack alternative) and GitLab Pages. To describe it further, the official blog post mentioned:\n\nThe platform enables independent software developers, startups, industry, academic institutions, and others to create, test, manage, and deploy innovative projects in a collaborative, safe, and responsible environment.\n\nHow is it different or useful?\n\nThe main key attraction for this platform would be IEEE’s members’ network, technical expertise, and resources.\n\nIEEE President, Robert Fish, also mentions in brief (during an interview with Radio Kan) how it’s different and why IEEE wanted to go with it:\n\nToday, much of the world’s infrastructure is run by software, and that software needs to comply with standards in communications networking, electrical grids, agriculture, and the like.\n\nAs software becomes increasingly prevalent in the world today, ethical alignment, reliability, transparency, and democratic governance become must-haves. IEEE is uniquely positioned to endow open-source projects with these attributes.\n\nWhile this sounds good, what exactly the open-source platform by the IEEE offer? Let’s take a look at that:\nIEEE SA Open: Quick overview\n\nhttps://itsfoss.com/ieee-open-source-collaboration-platform/",
			"date_added": 1589954428
		},
		{
			"post_id": 1593636805,
			"body": "Privately Access Censorship Resistant Websites\n\nhttps://lokinet.org/\n\nhttps://github.com/loki-project/loki-network/releases\n\nhttps://github.com/moshest/p2p-index\n\n#lokinet #p2p #opensource #privacy #Decentralize #Decentralized #foss\n",
			"date_added": 1593636802
		},
		{
			"post_id": 1594229871,
			"body": "\n\nεxodus\nThe privacy audit platform for Android applications\n\nExodus Privacy is an Android application. Exodus Privacy application let you know what trackers are embedded in apps installed on your smartphone. It let you also know the permissions required by any apps on your smartphone. It helps you to take your privacy back!\n\nhttps://reports.exodus-privacy.eu.org/\n\nhttps://github.com/Exodus-Privacy/exodus-android-app\n\n#privacy #android\n",
			"date_added": 1594229867
		},
		{
			"post_id": 1636005657,
			"body": "\n\nKopete/Jabber/About Jabber XMPP\n\nXMPP or Jabber (these words actually mean the same) is the name of an open, decentral network protocol which is used for instant messaging. It is designed as a server-client-infrastructure with many servers all over the Internet, where everyone can get an account. The servers are normally connected to many clients on one side and to other XMPP-servers of the Internet on the other side. Let’s invent a small example to explain how it’s working:\n\nRomeo loves Juliet and wants to communicate with her through the Jabber network. He can write messages from his client (which is connected with montague.net) to his girlfriend, whose client is connected to a server called capulet.com.\n\nWhen he registered an account on a server, he chose a so-called JID (Jabber-Identifier). This JID works basically like an E-Mail-Address and is connected to the server’s name with an “@”. An example for Romeo’s valid JID is romeo@montague.net.\n\nIn order to talk to other people, Romeo has to add their JIDs to his contact list. They may be connected to the same server (e.g. bob@montague.net) as well as they can originate from another server (e.g. peter@wasinet.org or, of course, juliet@capulet.com).\n\nJabber/XMPP is of course capable of a lot more services (e.g. end-to-end encryption of the messages, voice- and videochat, groupchat), which the tutorial will partly introduce later.\n\nTwo very big instant messaging providers use Jabber/XMPP on their servers in the background: Google Talk and facebook chat. Accounts within these systems can be used just like normal Jabber accounts in Kopete. Details will be explained later or can be found at these provider’s websites.\n\n#xmpp #Jabber\n",
			"date_added": 1636005652,
			"meta": "{\"img\":\"900,664,fffddecdfdeeeeecddbcd9bdeefcccdddcdeaaa,012300451036768049A084B340BB10010000044004000000400A0C00C4140A00000014\"}"
		}
	],
	"post_like": {},
	"comment": [],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1N9sU8qh3S4ei9PHE1qQyYPbcckJomvwMd",
			"auth_address": "184rhnxM89SU1gDuPEaQPjynfytkRtSEVd",
			"user_name": "Topnet",
			"date_added": 1585579501
		}
	]
}