{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1565237461_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565493657_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1566056701_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1
	},
	"next_comment_id": 31,
	"comment": {
		"1565140161_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": [
			{
				"comment_id": 1,
				"body": "(((chinkalinka)))",
				"added": 1565177734
			}
		],
		"1565213051_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": [
			{
				"comment_id": 2,
				"body": "> [qf2ss4t5y3365](#comment_7_1Nvii56FXr3CYjLPscUya4UutDqnMKjK1B): Good. That's a healthy attitude. [...]\n\nAt least they're welcoming us in this time. It sucks that we have to reinvent the wheel everytime they do this shit, but I'm starting to dig the layout of this place. Once 0chan gets back up to speed then i'll be set lmao.",
				"added": 1565228313
			}
		],
		"1565211401_17Z4Nn5umMdKxmgypwHXfe34rqnPPAq6nP": [
			{
				"comment_id": 3,
				"body": "> [bigbadbob](#comment_34_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): good guess.  same shit different continent.  Our leader is cringe\n\nCanada? If so, my condolences lmao.",
				"added": 1565228604
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 4,
				"body": "> [223556](#comment_1_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): the holocaust never happened tbh\n\nThis lmao\n> [anonymous1933](#comment_2_19FNmdV4pPCyZ7sFRNZsVZyEXtXFcB7NT1): jew jew cum\n\nTrump just can't get enough of it...",
				"added": 1565229153
			}
		],
		"1565163816_1JwnMobAn82kxrY5FXnjwMBFbLyziYijwa": [
			{
				"comment_id": 5,
				"body": "> [223556](#comment_25_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): You make a lot of noise but you say nothing.You imply this is only speculation. You are wrong.All Western european and American capitals have or are becoming minority white. Non-white immigrants are now the majority in areas that a decade ago used to be white. These are undeniable realities.When the media calls for people to not have children, yet when asked why they push so hard for immigration it's because of the low birhrates. You can see the relation there.The dots are out there clear as day, you just need to connect them.And you cannot also the deny the jewish influence in this conspiracy. Here is a quote from Barbara Spectre, founding director of Paideia, the European Institute for Jewish Studies in Sweden: [...]\n\nWait till he here's  about what Tim Wise and Noel Ignatiev think about Whites. Or when he finds out about the Kalergi Plan. Really activates your almonds tbh.",
				"added": 1565230203
			},
			{
				"comment_id": 6,
				"body": "> [tamamshud](#comment_4_13wBVRbx9AW7LaCUpcwgtoqN7wS7wEGR9Z): Barbara Spectre is a 'literally who'. And most \"pro-immigration\" lobbying comes the private sector, the owners and execs of which are majority non-jewish.Also no one is getting \"genocided\" because a bunch of people aren't having more children. Which btw, is mostly because of the cost of child-rearing, and stagnant (real) wages since the late 70s. [...]\n\n>no one is getting genocided\nWhat was the Holodomor again?",
				"added": 1565230307
			},
			{
				"comment_id": 7,
				"body": "> [tamamshud](#comment_6_13wBVRbx9AW7LaCUpcwgtoqN7wS7wEGR9Z): Adding to that: Periodic famines have plagued Russia since before (and during) Tsarist times. And were only ended during Soviet times. (Who cares about all the ethnic Russians, Ukrainians, and others who died during Imperial times, right?) The total death toll - excluding demographic deficits - has been estimated as between ~2 and 4 million.Contrast that with the death-toll in Nazi occupied Europe, which - even when excluding jews - surpasses over 20 million. [...]\n\nA plague is one thing, but the insurrection and takeover of malicious (((Communists))) and deliberate disarmament / mass starvation of Kulaks (farmers) is another story.\n\n\"That's real White Genocide\"\nAgreed, the mass destruction and massacre of Germans was indeed a genocide according to the Geneva Conventions. Glad we're on the same page :^)",
				"added": 1565231428
			},
			{
				"comment_id": 9,
				"body": "> [tamamshud](#comment_8_13wBVRbx9AW7LaCUpcwgtoqN7wS7wEGR9Z): And here it is, more deflection.I didn't even mention the holocaust, and already stated all figures posted exclude jews.Here's a question: If the holocaust didn't happen, what justifies Hitler's rampage across Europe, and the wholesale slaughter of dozens of millions of White Europeans?\n\n>Hitler's rampage\nSelf defense is not a rampage, Stalin had already mobilized 40,000 tank ahead of time to attempt a mass blitzkrieg (ironic lmao) of Europe. The entirety of Europe would've become a Bolshevik hellhole the likes you couldn't even possible imagine. It is well documented that Hitler attempted to contact Churchill numerous times, both BEFORE and DURING the war, to negotiate for peace. He stated that the Brits and the French were both a noble people and to go to war with them would be a disaster. But what did Churchill say?? \"LOL no, fuck off faggot, I like being a slave to International Rootless Cosmopolitan Desert Tribesmen!!! Why don't you? Are you an anti-Semite or something? :^)\"",
				"added": 1565273871
			}
		],
		"1565237461_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 8,
				"body": "OY VEY SHUT THIS ANTI-SEMITISM DOWN!!!! THE NAHTZEES SHOVED 25 CENTIMETERS OF WOOD UP MY ASS!!!\n> [bober](#comment_24_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6): I think it happened. But it was mostly unintentional. Because Germans are fucking incompetent. So they probably really wanted to build recreational camps for Jews ... but somehow that state planned project turned into industrialized mass murder. [...]\n\nThere was no Holocaust. The Germans rounded up kikes because 90% of them at the time were fanatical supporters of Communism, and a significant amount of them would either physically or financially participate in partisan attacks against Germany. The camps they were brought to were only labor camps, not death camps. There were no \"gas chambers,\" only showers that were simultaneously used for de-lousing. The majority of the deaths at the camps were a result of starvation and disease as a result of allied bombing of German railroads and critical infrastructure. You could even say that the Allies were more directly responsible for the \"Holocaust\" than any German was. Which is technically true, if you count the Allied mass fire-bombing of Dresden and other German civilian cities and towns, not that YOU would ever admit to that...because you're an anti-White faggot :^)",
				"added": 1565270621
			}
		],
		"1565288290_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 10,
				"body": "\"“Why is everyone here so MEAN?” the title of one Zeronet discussion thread read on Wednesday. “I get it guys, we're all a little mad about the whole 8chan debacle, but SERIOUSLY, calm down! No need for all this racism/anti-semitism/homophobia.”\"\n\"The conversation almost immediately turned to users calling each other racist slurs and debating whether sexualized cartoons of children were pedophilic.\"\n\nHoly fucking shit my sides!!! Buckle up lads, things are gonna get spicy around here with this level of media kvetching going on.",
				"added": 1565292332
			}
		],
		"1565292753_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": [
			{
				"comment_id": 11,
				"body": "Now that i'm getting more familiar with the layout, this place is preddy /comfy/ tbh. It's a shame it takes 30 minutes for me to post on 08chan or Millchan.",
				"added": 1565301327
			}
		],
		"1565132888_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 12,
				"body": "> [blackwatch88](#comment_4_1HFmAHXvHgkwfXcGZH9hMqj9TbgXDZNwGc): Hambeast fatfucks are the filthiest eye-sores known to mankind. Fucking parasitic lardassed gigantic slobby blob of shits deserve to be purged like the worthless degenerate subhuman pigs they are and roasted on a spit to feed the starving people from whom they stole life-saving food and rendered to produce an alternate fuel much like whale oil. Oink oink you fucking abomination repulsive orges.\n/fit/ detected lmao",
				"added": 1565301871
			}
		],
		"1565386361_1CJWxKsqGiQ6So16CWtrGugaMS3PRwkrM2": [
			{
				"comment_id": 13,
				"body": ">tfw no Druid/pol/ .\nI'm sure the Loyal Lads will find their way here, but goddamn I miss the bantz that went down in those threads.",
				"added": 1565388214
			}
		],
		"1565444879_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf": [
			{
				"comment_id": 14,
				"body": "lmao straight to the ninth circle of hell pedokike",
				"added": 1565457288
			}
		],
		"1565538736_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": [
			{
				"comment_id": 15,
				"body": "The biggest incriminating evidence against the holohoax is the fact that western education deliberately ignores that the Gulag was a thing, and the millions who were fucked up by it [Insert quote of Solzhenitsyn shitting on global media here]. Have any of you even seen a movie that portrayed the Gulag properly? All I remember was that shitty Muppets movie where Kermit gets sent to the Gulag and they sing a happy-go-lucky doo-wop about how life sucks here but it ain't so bad because at least we have each other :^)\nhttps://invidio.us/watch?v=tPDfnzCEgaQ   \n\nABSOLUTELYDISGUSTING.png\n\n> [styromaniac](#comment_940_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): >color of the smoke\n\n>memearrows\nI can't figure out fore the life of me how to get them to work on this platform. What do?",
				"added": 1565549221
			}
		],
		"1565614209_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 16,
				"body": "> [bigbadbob](#comment_235_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): what is \"asphalt culture\"?\n\nAsphalt culture is Urbanized culture, basically what happens to an atomized group of people who have no close ties to their community. Instead of finding kinship with your fellow man through cultural and community ties, you bond over consumerism, status symbols, videogames, and Netflix.",
				"added": 1565648281
			},
			{
				"comment_id": 17,
				"body": "> [bigbadbob](#comment_239_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): ahhh.  cool.  When i tried looking it up all i got was an old band from 20 years ago and a brand line of clothing. Thx\n\nno prob fren.",
				"added": 1565729478
			}
		],
		"1565731313_1B7S39qDssqWy7EJiKzhRboCyLGg2Auj4F": [
			{
				"comment_id": 18,
				"body": "https://usefulcharts.com/blogs/charts/rothschild-family-tree\nhttps://en.metapedia.org/wiki/List_of_Jewish_financial_dynasties\n\nLooks like you have your work cut out for you :^)",
				"added": 1565734624
			}
		],
		"1565678144_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": [
			{
				"comment_id": 19,
				"body": "Because my name is Nate Higgers.",
				"added": 1565749443
			}
		],
		"1565689573_1JjyvqhjWDqSncWvSoGxAGKr4SNXr1Kwpi": [
			{
				"comment_id": 20,
				"body": "> [223556](#comment_112_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): My political views correlate with whatever society deems acceptable at the current time.\n\nHolocaust denial is acceptable in our current society?",
				"added": 1565804374
			}
		],
		"1565819093_1J6JfEeFfwmkogEHaMgs8MohbzpzMyQUqv": [
			{
				"comment_id": 21,
				"body": "Dvorak 9th symphony; 4th movement in particular. Breddy hype tbh.\nhttps://invidio.us/watch?v=vHqtJH2f1Yk",
				"added": 1565905218
			}
		],
		"1565874585_17zkACeRCDqPEswrUFFZxJf3NuwtskPrzR": [
			{
				"comment_id": 22,
				"body": "I love when they cause race riots in Israel. Wouldn't it be the most poetically ironic thing if (((They))) were destroyed by the very methods that they have been using to destroy the West? Jacob Rothschild's grand daughter married a POC afterall.",
				"added": 1565911952
			}
		],
		"1565908709_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 23,
				"body": ">OY VEY GOYIM!!! DONT USE THE ONLY SOFTWARE THAT MAKES IT ALMOST IMPOSSIBLE TO COMPLETELY SHUT YOU DOWN!!!11!11\nDon't let the door hit your ass on the way out (((JIDF)))",
				"added": 1565916936
			},
			{
				"comment_id": 25,
				"body": "> [xcape2net](#comment_320_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Valdez did that two hours ago.I'm not offended.  But, that doesn't mean that I have to remain silent when I'm told to leave.\n\n>WHEN I'M TOLD TO LEAVE\nNigger you were the one who was bitching about leaving and calling ZeroNet a cesspool of cancer in the first place lmao.",
				"added": 1566000985
			},
			{
				"comment_id": 28,
				"body": "> [xcape2net](#comment_324_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): You have me confused with someone else.\n\nOh shit fam my bad, I meant faggot OP.",
				"added": 1566093000
			}
		],
		"1565992280_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 24,
				"body": ">tfw debt free via the snowball method in less than a month\nThe /SIG/ threads have finally started to pay off. God bless you glorious faggots.",
				"added": 1566000459
			}
		],
		"1565933711_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 26,
				"body": "How's the weather in Tel Aviv, Chaim? :^)",
				"added": 1566001322
			}
		],
		"1565927048_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 27,
				"body": ">>Test",
				"added": 1566001363
			}
		],
		"1566056701_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 29,
				"body": "> [memesadler](#comment_94_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): I'm accumulating some stuff for the Holobunga. Any good suggestions? \nGood luck fam, this one's a doozy...",
				"added": 1566093457
			},
			{
				"comment_id": 30,
				"body": "> [memesadler]\n\nhttps://holocaustdeprogrammingcourse.com/",
				"added": 1566093496
			}
		]
	},
	"comment_vote": {
		"563_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"2_19FNmdV4pPCyZ7sFRNZsVZyEXtXFcB7NT1": 1,
		"22_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"6_16cMkqz45EzZSjYqk37UTVXaYqLLtrXf3r": 1,
		"18_1HFmAHXvHgkwfXcGZH9hMqj9TbgXDZNwGc": 1,
		"12_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"16_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"4_1HFmAHXvHgkwfXcGZH9hMqj9TbgXDZNwGc": 1,
		"14_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5": 1,
		"3_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"8_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf": 1,
		"972_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1_1JmzascVT1gUZZ5mLg8mg6pZKmTGdGNPXm": 1,
		"378_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"47_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": 1,
		"28_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"1030_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1_1PdL5a2fRqGoQZi4NNh1EzLpcZbMV7HX3y": 1,
		"125_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"52_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": 1,
		"72_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"2_16VcDM9UrXq4VY2MAKJhfuiN1DoG5ktAD3": 1,
		"8_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": 1,
		"144_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"10_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx": 1,
		"18_1C5WofUXvg54BgL9AiS2Mqdq3erQBGogXB": 1,
		"154_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"789_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	}
}