{
	"title": "神迹故事",
	"description": "像婴儿一样看世界",
	"links": "*   [源代码](https://github.com/HelloZeroNet)",
	"next_post_id": 27,
	"demo": false,
	"modified": 1492650693,
	"post": [
		{
			"post_id": 25,
			"title": "姜子牙四次转世的传说",
			"date_published": 1492474887.169,
			"body": "姜子牙四次转世的传说，提醒着人们不要为了世间名利造业害己。\n\n---\n\n**刘伯温姜子牙诸葛亮转世**\n\n诸葛亮，字孔明、号卧龙(也作伏龙)，三国时期蜀汉丞相、杰出的政治家、军事家、发明家、文学家。据记载诸葛亮文有姜尚治国之材，武有孙膑练兵之道，自比管仲，乐毅。有民谣云：〝先姜尚，后孙膑，五百年前诸葛亮，五百年后刘伯温。〞姜子牙、孙膑、诸葛亮、刘伯温代代相传，他们之间究竟有着怎样的联系呢?\n\n**姜子牙**\n\n姜子牙即姜尚，封神之后，姜尚本想回昆仑成仙道，元始天尊对他说，他根骨太差，让他转世重修，并亲口许了大罗神仙之位，因姜子牙封神对本教有大功，故特意让人传话到地府，姜尚转世须聪明绝顶有九窍玲珑心方能转世。九窍玲珑心五百年一出，姜子牙死后一直等到春秋战国时期，九窍玲珑心才出现。\n\n**孙膑**\n\n转世重修为孙膑，这孙膑生下来便聪明非凡，他师父鬼谷子知道他的来历，更是对其极为喜爱，不料木秀于林，风必摧之，孙膑遭他师兄庞涓的忌妒，被算计砍断了双腿，孙膑后来修道成仙，明了自己的来历，却发现自己双腿已失，如果像这样成仙的话一辈子只能在轮椅上坐着，郁闷之下，不得不冰解转世。\n\n**诸葛亮**\n\n地府按元始天尊以前所说的，又让他等了五百年，直到九窍玲珑心再次出现，才又送他到阳间转世，这一世便是诸葛亮，故诸葛亮文有姜尚治国之材，武有孙膑练兵之道，自比管仲，乐毅。因孙膑被算计砍断了双腿只能坐轮椅，所以转世后的诸葛亮爱坐轮椅(前世的习惯)。后又为刘备所累，火烧藤甲军，伤了阴德，不能成仙。\n\n**刘伯温**\n\n无奈再转一世刘伯温，助朱元璋搞定蒙元。功成身退，了道成仙，据说，刘伯温帮朱元璋得了天下，封了大官，一天无意经过一座庙，庙里有座石碑，碑上写着〝先姜尚，后孙膑，五百年前诸葛亮，五百年后刘伯温〞，始知自己是诸葛转世，遂辞官而去。\n\n又云：刘伯温，三国之后明朝的宰相，相传此人通天文知地理，战无不胜攻无不克，系孔明之后的又一大人物。刘伯温居住于少城的时候恰好住在孔明府，府上有一牌匾：〝天下第一人〞。他就问这是谁这么大的胆子敢说自己是天下第一人，随从告知是三国时的孔明先生。刘伯温听后很是生气，心想：孔明虽是奇才，但也不能自称是天下第一人啊，我伯温如果早出生几百年的话没准比孔明还厉害。\n\n〝来人，把牌匾给我拆了。〞随从拆牌匾的时候发现中间还有一个牌匾，一行四言诗露了出来：〝前朝军师诸葛亮，后朝军师刘伯温;五百年前吾知汝，五百年后汝知谁?〞刘伯温面对牌匾，长跪不起。\n\n──转自《应天书院》"
		},
		{
			"post_id": 24,
			"title": "武当奇遇：300多岁道长启悟如何度过人类劫难",
			"date_published": 1492133557.84,
			"body": "一个小姑娘去武当山想要寻访高人修炼，竟然真的遇到了世外高人，从此踏入修炼之门。\n\n* * *\n\n## **武当奇遇：300多岁道长启悟如何度过人类劫难**\n\n作者： 来源：虚掩的门 发布时间：2015年04月13日\n\n武当山，我想，这应该是很多修炼之人的理想之地吧。即使不是修炼人或许也会有想上武当山碰碰运气，看看会不会有高人收自己为徒。就是在去年，我终于去了这个久仰大名的名山，武当山！\n\n武当山，又名太和山、谢罗山、参上山、仙室山，古有〝太岳〞、〝玄岳〞、〝大岳〞之称。山上有很多有名的大殿如，净乐宫，太和宫，古铜殿，玄天玉虚宫，紫霄宫，金殿…你们一定以为我是在这些有名的地方发生的奇遇对不对？呵呵你们都猜错了。我发生奇遇的地方，都不是以上这些地方。\n\n当时我去的时候，不是旅游旺季。这也是我自己选择的，因为我不喜欢人多的时候去那些有名的地方游玩。我就是想去那个传说中的地方看看是不是真的有隐世高人在那修炼。如果人多的话，我知道他们可能就不会出现了。因为去那些有名的大殿的人，思想里都是想着求财啊，求名啊，求儿子之类的。这样愚昧的思想，隐世的修炼人看了肯定不会出现在他们眼前。所以我就挑个少人的日子去，想看看能不能碰上什么好运。\n\n我从山脚下买了票之后，自己爬上山去了爬到半山腰的时候，我突然迷路了，我看着入门拿到的导游图。看来看去，我这个地方都不像图里某个地方啊？怎么办，迷路了。好像又走不出去了。我该怎么办呢？走着走着，我竟然看到一座桥。我小心的走了过去，看到前方不远有个大殿。\n\n我很高兴的快步向前小跑过去，总算看到有人了，至少可以问问路。什么？！这座殿的名字叫〝幻真殿〞？！我拿着导游图看来看去，都看不到上面写了有〝幻真殿〞这个大殿啊？这是怎么回事啊？我小心的靠近大殿的门口，看到一个小道孩在门前打扫。小道孩穿着古代小孩穿的那种衣服，衣服已经很旧了，但是很整洁干净并不邋遢。我小心翼翼的说：你好。请问这里是哪里啊？\n\n小道孩好像早就知道我在看他似的，抬起头，眼中是纯净的眼神，是的，是那种在世人中看不到的纯净般的眼神。他天真烂漫的回答我：这里是武当山啊！我内心汗了一下，这个我也知道啊，问题是我没听过这个大殿的地方啊。他好像知道我在想什么似的，我才刚想完。他立刻说：这是幻真殿。因为比较隐蔽，所以很少有人走到这里来。\n\n我立刻就相信了他说的话，因为我这个人戒心也是比较低的。而且对方也是小孩子啊，后来我才知道原来自己是那么天真的，事情远远没有我想的那么简单啊！然后，我们都默不作声。因为我不知道该说什么了，由于刚刚迷路的原因我耽误了很多时间，当我看到幻真殿的时候已经是黄昏了。\n\n古人云，夕阳无限好，只是近黄昏。山上的黄昏更是比城市的黄昏要美上千百倍都不止了。葱郁而油绿的树林，幽静的环境伴随着鸟儿的嬉闹声。真是让人无比的舒服啊。可是我此刻的心中并不能更好的欣赏这里美丽的风景，我心急如焚啊，现在下山的话，有可能还会再迷路的。而且要是天黑了，我就什么都看不到了很难找出下山的路了。但是呢，我又不好意思跟小道孩开口说要留宿幻真殿。毕竟人家这也不是那种收钱让人家留宿的地方。\n\n就在我左右为难的时候，一位道长打扮的人从大殿出来。他好像早就知道我在这似的，直接跟我说：小姑娘，你迷路了？\n\n我：是啊，道长。我明明是想去紫宵殿的，不知道为何走着走着，走的树林中间的时候，我突然有种好像进入别的空间的感觉。然后就迷路了，然后走着走着就看到这大殿了。\n\n道长意味深长的说，世间没有偶然的事，你是注定会〝迷路〞并走到这的。\n\n我迷煳的看着道长，不懂他在说什么。这时，我内心突然有了想法。我笑着跟道长说：竟然你说我是注定迷路走到这儿的，那你们一定为我准备好留宿的房间的吧？道长一愣，随即爽朗的笑道：哈哈，不错。你连这个都能想到。小道孩听着我们的对话，忍不住笑了出声。\n\n然后我就随着他们一同进入殿内，幻真殿看起来跟山上其他的大殿似乎很相同，但是那种内涵仔细感觉就能感觉出不相同的地方。幻真殿悠悠间有种神圣而又庄严的气息。而不像普通的大殿，普通的大殿就是一建筑物的感觉。一点内涵都没有。\n\n参观完大殿大堂，我随着小道孩来到吃饭的地方。他们吃的都是很普通的斋饭，聊天得知，他们在幻真殿后面种了一点菜。吃饭的时候，大家都很安静。没有人说话，我觉得气氛有点尴尬。我就随口问了小道孩一句话，我当初是随口问问的只是想消除尴尬的气氛而已。没想到，小道孩回答完我之后，气氛更尴尬了。小道孩头都不抬，埋头吃饭好像没有听到我的问题一样，正当我以为他真的没有听到我的问题时，他突然悠悠的说了一句：我162岁了。\n\n我当时心里惊了一下，不会吧？这个小孩162岁？吓唬谁啊？小道孩终于抬起头了，定定的看着我。我心里想着，哈哈，他一定是在说谎，他等会儿就会忍不住笑出来的。我也定定的看着他，我们互相不说话。殿内是死一般的沉静，突然，他开口了：我说的是真的，你别不信。那位道长他也373岁了。我这时惊得连筷子都掉到地上去了。难道我真的遇到了高人？这次上山的目的达到了？\n\n筷子捡起来之后，我吃饭的时候手都是抖的，这也太玄了吧。没想到传说中的活了几百年的人竟然让我遇到了。\n\n吃晚饭后，小道孩带着我从大殿后门出去，刚一出门口我便被眼前的景象惊呆了，门口的外面有一条小桥，桥的对面是很多间古代建筑，类似像紫禁城里的宫殿吧。还有亭子，有花园，花园里的花是我从来没见过的。五彩缤纷，互相争艳。我看到有穿着古代衣服的女人，他们穿着薄纱长袖裙，很漂亮的款式。她们有的在奏乐，有的在跳舞，有的在唱歌。不知道的还以为这里是天国仙境呢！我小声的问着小道孩：她们也是几百岁吗？\n\n小道孩点点头：恩。她们也是修炼人。这里其实还有男弟子，他们最近下山云游去了。所以现在只有我跟道长在幻真殿里。\n\n我心里偷偷的笑了一下，嘿嘿，该不会因为你最小，所以要扫地吧？我刚想完，小道孩的脸红的跟苹果似的。我心想，天，我想什么他们都会知道？那我不是很没有隐私？\n\n小道孩佯装咳嗽了一下说：你就住在西边那间屋子吧。说完这句便朝着其中一间屋子走过去了。那个应该是他的屋子吧。\n\n我一边欣赏着美丽的花朵，一边沉醉于美女们美妙的歌声当中。不知不觉走到了亭子，正想坐下的时候，道长出现了。我马上恭敬的说：道长，您来了。请坐啊。\n\n道长温和的笑了笑，走到我身边的一张石凳子上坐了下来。我心里盘算着该如何跟眼前的这位隐世高人说出我内心的想法。道长突然开口说话：你这次上山的目的是希望找到高人当你师父，想修炼？\n\n对于他们能知道我内心的想法，经历过小道孩之后，我已经不吃惊了。我如实的点点头：是的，我厌恶了人世间那种为了得到利益不惜付出一切代价的争斗了，我厌恶了那些为了情迷失自己做出荒唐不正当男女关系的人世，我不喜欢人世间，在那里什么都看不透，很多人都不知道为了什么活着。我不想要轮回了，轮回中生生世世又会忘了自己的前世，下一世又重新陷入所谓的利益争斗中，浑浑噩噩的过着日子。\n\n道长看着我，沉默了一会儿说：你是不是经常鬼压床？\n\n这次我真的吃惊不小，连我以前的过去都能看到？我连连点头：是，我听说过修炼人会有神通，能知道过去将来，没想到是真的。道长，我一直以来都不明白，为什么我会被鬼压床。我听有人说是因为八字轻就会被压。\n\n道长摇了摇头：不是的，这只是表面而已。世间小道上是有承传周易啊，八字啊之类的预测方法。但这些方法都只能知其一而不能知其二。我问问你呐，你是不是从小就不爱跟别人争抢利益？\n\n我点点头，我确实不爱争斗。觉得没意思。\n\n道长：你是不是思想比较简单，不会老想着做些伤害人的事情？\n\n我依旧点点头。\n\n道长：这就对了。你知道你为什么会被鬼压床吗？\n\n我依旧一脸疑惑，摇摇头。\n\n道长：那是因为你身体干净。那些鬼怪他们喜欢干净的身体。\n\n我说不出该高兴还是该不高兴，高兴的是我身体干净，不高兴的是我的身体被鬼怪喜欢。\n\n道长：那些老想着害人啊，争斗的人，业力都很大。因为他们做不好的事情的时候会产生业力，业力是黑色的。而那些比较好的人呢，就会德大，德是白色的。有些人以为，鬼怪喜欢不好的人，他们以为被压的是不好的人。其实呢，不是这样的。就像一个苹果，脏兮兮的，黒黑的肮脏物质在上面跟一个干干净净的苹果，你会喜欢哪个？\n\n我毫不犹豫的回答：当然是干净的，谁喜欢脏东西啊！\n\n道长：是啊，那些不好的，业力大的人。连鬼怪都看不上他们。他们还以为自己活得很好呢。\n\n我：开了天目真的能看到另外空间？\n\n道长看我兴趣来了，继续说：你看看现在的人，悟性都那么低。中华传统文化博大精深，他们竟然打击成迷信的东西。以前的古代人呐，他们道德比较高，往往会看到很多神迹，很多你们现在看到的古人写的文章中都有所体现，东方有东方的神迹西方也有西方的神迹。现代人竟然都以为人家是编的，关于修炼人使用的神通，以前确实有些人见过。不过现在的世人，世风日下谁都不愿意管他们了。\n\n我表示赞同的点点头：道长，那你们挑徒弟都是要挑很好的吗？\n\n道长：当然是，我们不进入世间的修炼人是可以运用神通的，入世间修炼的修炼人，为了不破坏常人社会的状态，很多神通都是锁着的。开了天目的人，可以看到对方身上的德和业力有多少…\n\n道长还未说完，我便脱口而出：德多的根基好，业力多的悟性不好？\n\n道长惊叹的说：是啊，悟性不好的人，怎么都不相信修炼的事。他们迷得太深了，难以解脱啊。\n\n道长又说：天目有五通，以后你就会明白这些了。其实肉眼通一开始是人肉体的本能功能，能透视的。以前的华佗之类的名医，都是有功能的人。透视中能看出别人身上哪里有病，而且，他们是神医的传人。\n\n我大惊：神医？\n\n道长：是啊，关于古代治病的方法。是有神医一代代传的，主要是利用五行相生相克之理。例如身体哪部分火旺，就采用一些水属性的草药对症下药。\n\n我想了一想，接着说：是像人那样，有生，老，病，死？宇宙也是一个生命体？！\n\n道长闻之连忙点头：生命的定义根本不是人类所能够想像的，人的思想很狭隘，观念又深。一想问题的时候，就会陷入观念之中。除非去掉观念，否则永远都是用自己在人间所生成的观念想问题。\n\n我：是啊！其实不同的人在不同的环境下，就会形成不同的观念。然后他们会用自己形成的观念来衡量其他的事物。所以人的争吵就是从这个能体现出来的。\n\n道长：小姑娘不错，有慧根。其实还是明白事理的人好。明白事理的人，当别人为了某件争吵不止的时候，你不陷在他们争吵的观念之中的时候。你就会明白到底这件事是怎样的，明白孰是孰非啊！\n\n我：道长，竟然你认为我有慧根，那可否完成我的心愿？我一心追求修炼法门，希望超脱三界，永不受轮回之苦！\n\n道长沉思了一下：我不是不想收你，而是我能力有限。不能让你回到产生你元神的层次！\n\n我：为什么？我不懂！\n\n道长：如果你要跟着我修，那你身体的演化都是按照我这一门的走。炼的元婴，其他各种生命体都是我那个世界的物质。可是，你先天所在的世界物质跟我世界是不一样的！例如，我的世界是白玉般的物质构成的，而产生你元神的世界是水晶构成的。那你跟着我修，你就会变成白玉的物质构成你的身体，那就会去掉你原先所拥有的水晶般的物质身体了。你会失去你原有的一切！！！\n\n我喃喃自语：原来是这样！那难道没有一种任何法门能让我回到我原来世界并且不会让我先天拥有的一切散掉吗？\n\n道长突然表情庄重，严肃的神情让我的心也跟着紧张起来。大家沉默不语，树叶伴随着微风发出沙沙的欢闹声。水中月亮的倒影被水波衬托的彷佛动了起来，不知月亮也否也在聆听着我们的对话。我等了很久，道长都没有说出一句话。正当我着急的以为我永远都不能回到自己原来层次的时候，道长突然开口了。\n\n道长：有！\n\n一个有字彷佛清风般扫去我心中的阴霾，我继续追问到：是哪个法门，如此厉害？\n\n道长：那个法门，可以让修炼的人回到自己不同的世界，哪里来的回哪去。而且那个法门是可遇不可求的，只是因为末世，宇宙即将出现危机才传的。为的是解救全宇宙的劫难。我刚刚不是说过，现在的世人，多是天上下凡来了吗？\n\n我：是，竟然连上界生命都纷纷下世来。那一定是有大事发生！\n\n道长：没错，这是关于全宇宙的大事！上界生命为了拯救自己世界的生命才下凡来的。高层的生命可不像人，他们会为了自己世界的生命放弃生命的！曾经在天上是多么伟大的一个神，可是，为了让世界的生命得救。放弃了自己的一切下凡受苦。\n\n我继续追问下去：现在人间的每个人都是上面下来的吗？\n\n道长：不是每个人都下世得法的，有些是随着这次宇宙的危机下来做坏事，让那些上面下来的生命得不到法。也有些是下来败坏人类道德的。但是，每个人都是为了这次宇宙的大事而来的！\n\n我：他们为什么那么坏，要妨碍别人的法？\n\n道长：这个宇宙有相生相克的理存在，假如没有坏人的衬托你怎么知道什么才是好的？没有坏人来捣乱，这次宇宙的大危机这么容易就解除了，那还叫危机吗？但是呢，哪些是好的哪些是坏的，智者自会心明！正如老子所说，上士闻道，勤而行之。中士闻道，若存若亡。下士闻道，大笑之。不笑不足以为道。\n\n我：上士闻道，勤而行之。中士闻道，若存若亡。下士闻道，大笑之。不笑不足以为道。是什么意思？请道长指点迷津。\n\n道长：就是说，上士，就是根基好的人。根基好的人德大，一看到修炼的事情就相信，而且也要去修。\n\n我整晚彻夜未眠，我想只要是正常人遇到这样的事情都不会还能安安稳稳的睡觉吧？这也太玄了，我只不过是随便想想而已，还真的让我遇到隐世高人了。为什么那么多人上山来都遇不到，偏偏就让我遇到了？各位读者不必感到疑惑，我所遇到的一切皆是命中的定数。后来从道长口中得知，我与他皆是前世缘，今生了。不是姻缘的缘，继续看下来就知道。\n\n第二天，天一亮小道孩就来叫醒我。他说道长找我有事，让我去大殿门前等他。说完拿了一套古代女人的衣服给我穿，紫色长袖落地裙，整条裙子的紫色是递进的层次，越下面的紫色越深，裙尾的颜色深的接近于黑色了。很漂亮的款式，不知道怎么形容好了，是有点像丝绸的质地，很滑摸起来很舒服。我穿好之后问小道孩为什么拿这一件古代衣服给我穿，其实我心里高兴死了。我一直都很喜欢古代衣服，觉得很漂亮，但是在大街上穿会显得太引人注意了。现在可好，在这深山中，谁会理我穿古代衣服呢。\n\n小道孩依旧打扫地下的落叶：你很高兴吧？\n\n我听到这话，马上低头脸红。\n\n小道孩：是师父叫我拿给你穿的，没见过师父对别人这么好过。其实说真的，你们那些现代衣服很难看，师父说是要带你去个地方，所以要让你换一身衣服。\n\n我在大殿门前等了一会儿，就看到道长出来了。道长今天的道袍有所不同，是纯净的白色，干干净净。道长向我走来，说：有个朋友等你很久了，你该去见见他了。\n\n我大惊：谁？我这次是自己一个跑来武当山的，没有朋友跟着我啊？\n\n道长笑而不语，并不回答我的问题。往那条小桥走了过去，我见状也赶紧跟着道长。要是跟不上，我又迷路那就太糟了。道长走路的时候好像脚不沾地的感觉，轻飘飘的。但是走到也不快，起码我能跟上去。我知道这是道长为了照顾我才没有用他平时的速度的，过完小桥之后我一头雾水，不知道道长要去哪里。该不会是要下山吧？顺便赶我回去，不让我打扰他清修？想到这里我的脚步停了下来。\n\n道长还是继续走并大声的告诉我：不会赶你走的。因为我们的缘未了，此次是带你去见你的一位朋友，你们很久没见了。\n\n我不相信的问：到底是谁嘛？干嘛神神秘秘的，就不能直接说嘛？\n\n道长：你见到他，自然就会明白一些事情。快走吧。\n\n我不情愿的跟着道长继续走，说来也奇怪。道长领着我走的这些路，好像我从来都没有看过。而且树叶的颜色也有点不同，还有很多没见过的花。走了一会儿，感觉好像走了很多的路却没用多少时间一样。\n\n走着走着，突然看见前面有个小木房。道长转身而言：到了！\n\n我小心翼翼的跟着道长后面，不知道前面是什么样的人。道长走到门前敲了一下门，门里传来一声病态的声音：谁啊？\n\n道长：是我，我带她来了。\n\n那个人闻言马上从屋里走出来打开门，开门的时候我吓了一跳。这个动作也太迅速了吧，我还以为是病人呢。开门者是一位外貌大概25岁左右的年轻男子，身穿黄色古代长袍，样子看起来一点也不像有病的样子，可是他一开口说话的声音让我的想法马上转变了。他的声音是那种老人的声音，而且像病危老人的声音。\n\n道长指了指那个人说：他叫黄炎（化名），是你的旧朋友。\n\n我感到疑惑的说：我不认识他啊。\n\n黄炎请我们进屋坐，说要告诉我一些事情。\n\n我小心翼翼的看着黄炎，虽然他看起来很和善。可是他老说认识我，不知道是不是有什么阴谋。\n\n这时黄炎突然开口了：你变了，以前的你思想很纯净，不会有这么深的疑心。看来你入凡之后就变成一个普通人了，一点也显露不出你以前的那种纯真的本性。\n\n我：你是说我们以前某世认识？\n\n黄炎点点头：恩，其实，你以前曾经转生过天上的龙族。龙族是水中的尊者，也是护法神的一种。黄炎说着的时候，我的意识突然飘飘渺渺好像去了我曾经生存过的那个空间，看到了以前所发生的一切。\n\n龙族记忆篇\n\n我们的原形是龙，但是我们也可以变成人形。以前我们是一起在天上某个世界守护着一颗宝石，那个宝石叫七彩珍珠。是一颗透明的珍珠，会散发出七种很通透的颜色。赤橙黄绿青蓝紫不断变化。\n\n在龙族中，不同类型的龙都有不同的使命。而我们的使命则是守护那颗镇宫之珠，那颗龙珠一直放在龙宫中一个隐秘的地方由我们两个守护。相传那颗七彩珍珠拥有强大的法力，可以保护我们龙族的平安。所以各门各路的妖怪都想得到它让自己变得强大。因为黄炎从小就体现出与众不同的天赋所以就被赋予重大的使命，龙族尊者安排我们一起守护那颗七彩珍珠。黄炎从小就是龙族中最聪明的，也是天赋很高的一个孩子。所以他的性子总有点傲慢的感觉，而我只是一个平平凡凡的龙族少女，之所以让我跟黄炎一起守护镇宫之宝是因为我性子比较稳，不会出什么差错。跟黄炎的性子可以互补。\n\n有一天，黄炎玩心大起。说是从来没有好好出去外面的世界玩过，很想出去玩。我便阻止了他：不可以啊！我们的使命是守护镇宫之宝的，不可以离开这儿。\n\n黄炎傲慢的说：我只是出去一下，很快回来的。为什么我天赋好的就一定要安排我在这守护着七彩珍珠呢？其实我应该出去大显身手才对啊！我听说最近外面的精怪很猖狂，老是偷袭我们龙族。因为我在这所以他们不敢来，那我现在偷偷出去把他们清理了。那我们龙族不就可以威名大显吗？而且这样一来他们也不会打我们龙族的主意了。\n\n虽然黄炎说的好像很在理，但是我还是觉得有点不对劲的感觉。没等我回话，黄炎已经出去了。黄炎的速度相当快，即使有些年纪比他大的也未必能及得上他。就在黄炎刚刚出去的一瞬间，我听到一声怪笑声。\n\n我顿时提高警惕：谁？\n\n哈哈，哈哈哈。一只大鹏鸟突然显现出来，之所以说显现，是因为刚刚这个地方是什么都没有的。\n\n我厉声一喝：你什么时候进来的？难道你想打七彩珍珠的主意？\n\n大鹏鸟怪笑道：我已经在这里很久了，前些日子我偶然得到一法宝。是个能让身体通透的隐身法宝，但是这个法宝只能在不动的时候使用，一旦身体动了就会显出原形。我早就知道黄炎的性子傲慢，所以潜伏于此，盼着有朝一日能得到你们的镇宫之宝七彩珍珠。\n\n我准备好开战的准备：我不会让你得逞的！我就算是拚死也要守护龙族宝物。\n\n我的话音一落，马上就向着大鹏鸟攻击去。大鹏鸟的身体庞大，而且是龙的克星。战斗几回合之后，我的攻击明显弱了。大鹏鸟鸣叫几声之后，突然从暗处又来了一只大鹏鸟直往我身上攻击。我被他们啄的遍体鳞伤，就在我快要不行的时候。我使出全身的力气发出龙的鸣叫声，声音一落马上就有其他龙族生命出现。大鹏鸟看我们龙族气势强大知道打不过我们就偷偷的逃跑了，这件事情很快就被龙族尊者知道了。尊者派了另两位战龙去守护七彩珍珠，把我召到前殿。龙椅上的尊者表情严肃，神情庄严。\n\n尊者：黄炎去哪了？\n\n我：妖怪打过来的时候，他去追赶妖怪了。\n\n尊者：你以为我不知道黄炎是什么性子吗？他是不是出去玩了？\n\n我：……\n\n尊者：大家都在抢七彩珍珠，却没有一个人知道七彩珍珠是作什么的。其实七彩珍珠的作用就是可以让水保持纯净的状态，水是万物本源。所以水的纯净就非常重要，要是水不纯净了对我们世界来说都是很大的劫难。不纯净的水会使一切物质变得越来越不纯净（解释一下，就像你喝了不好的水，喝进去之后那个不好的物质就留在身体了，连水都不干净了就表示没有可以让你排除不好东西的办法了），到时就造成无法挽回的境地啊！关于七彩珍珠有一个最大的秘密，我们这个世界没有任何生命知道！那就是……连七彩珍珠都已经不纯了！\n\n我大惊：什么？！七彩珍珠不纯了，那水……？\n\n尊者：没错。我们这个世界早已不纯净了，在这样下去就要应了宇宙的劫难，成，住，坏，灭，空。宇宙的物质都不纯了自然要坏，坏了就走向灭亡啊！但是，关于宇宙还有一个传说，到了宇宙即将走向坏灭的时候会有宇宙的主下世正法，把一切不正的都正过来。只有宇宙的主能挽救宇宙里的众生了。也只有宇宙的主才能有这么大的威德！但是正法的过程必然会经历重重磨难，一个人修炼都得吃很大的苦难才能修成，成就果位。更何况这次是这么大的一件事，要经历的磨难就更大了。\n\n我：尊者，我愿意下世得宇宙主的法，挽救我们龙族不走向坏灭的境地。\n\n尊者：紫儿（化名）其实你生命的本源不是我们这个层次的，你是从更高更远的地方来的。你内心深处早已埋下要得法的种子，你为了挽救你那个层次世界里的生命，层层下走，一个层次一个层次的转生。每次转生的时候你都会忘掉你以前的事情，当你从龙族一出生的时候，我就知道你不是我们这个层次的生命。而是要下到三界内得法的神，经过我这个层次来结缘的。在三界以外，可以知道自己所在层次的理，可到了三界内就什么都不知道了。三界就是个迷的地方，不超脱三界的话只能生生世世在三界内轮回了。苦啊，可是不吃苦又怎么修炼呢。不吃苦就不能得到威德，三界外的地方都可以使用神通也没有苦吃。所以我们只能永远留在这个地方。\n\n我：尊者，我明白了。我决定要下世得法！\n\n尊者：下世苦啊，要是迷在人间那就永远回不来了！\n\n我：尊者，就像您一样，您是龙族的尊者。当您看到您世界的众生都即将遭到劫难的时候，我相信您也不会坐视不管。我当初决定下凡得法的心情也一样，我不能不管我世界的众生。竟然有可以使自己的世界免于一劫的方法，那我当然义无反顾的要去做。\n\n尊者：要是下去了，可能永远回不来了。\n\n我：要是我不下去，得不到法。我世界的众生可能就要解体了，我下世，或许得法或许不得法起码有得法的机会。我不下世，那就永远不能挽救我的众生了！\n\n尊者：你要记住，这部法是造物主也就是宇宙主用来创造宇宙的法。这次为了解救宇宙的劫难，宇宙的主下凡传法。你得法之后如果修炼有成就能更新自己的世界，就算不能得法只要不对法又不好的思想也能使自己的世界得救。但是这次这件事的难度非常大，因为这关乎到全宇宙的事情。所以魔和败坏的生命也会倾巢出动，阻碍下去得法的神。理由是成就这么大的事情，就应该遭受这么大的磨难。能走出来才了不起！\n\n我：是，尊者。我知道了，正念使我义无反顾。\n\n尊者叹了一声气：到了三界，脑袋一洗就什么都不知道了。你在这层次的缘也结了，你现在再往下层层下走吧。\n\n我对尊者鞠了一个躬，转身离去。我走到龙门的前面，我知道我进了这个门就是往下一层世界走了。会忘掉我以前的东西，周而复始知道三界为止……\n\n后记，黄炎因为犯了天条，在守护神物的时候擅离职守而被打下凡间受苦。\n\n当我的意识飘飘渺渺的回来之后，我才发现我的脸上早已挂满了泪水。原来我一直苦苦寻找的，想要解脱的思想还肩负着我世界里的众生的期望。怪不得我一直都有寻找修炼之道的想法，原来我元神的一面早已知道我为何存活于世间！\n\n道长和黄炎看到我明白了这些很高兴，黄炎咳嗽几声说：你现在穿的这件衣服是你以前最喜欢的，紫儿紫儿，你最喜欢紫色了。我知道我当初对不住你，让你被大鹏鸟攻击成重伤。所以他们贬我下凡的时候我偷偷拿了你最喜欢的衣服下来，我知道有朝一日你一定会来这的，因为我对你有信心，我知道你将来一定会得法的！所以我就住在山上一直等着你来，想把衣服给你同时也想跟你说对不起！\n\n眼前的这个黄炎已经不再是以前那个傲慢的黄炎了，在人间遭受的苦难使他变得成熟稳定了。\n\n我高兴的说：我早就不怪你拉，你看我都不知道这个事。是你自己打开我的记忆让我看的。那道长，您说我是注定来这的。那您跟我之间的缘分又是什么呢？\n\n道长：我们在天上某个层次也结过缘，在人间轮回中我们曾经当过亲戚。我修炼开了天目之后，记忆便打开了。用宿命通看出你今生是个一心求道之人所以也一直在等待着你的到来。其实那个幻真殿，别人是看不到的。那是我有意显现出来给你看，要跟你了缘。\n\n我：了缘？\n\n道长：恩，这一世很关键。要是这一世不能得法的话就永远不能回去了。\n\n我：为什么？\n\n道长：因为正宇宙的法已经开传了，要是错过这一世的机缘就永远都不会有机会了。\n\n我：这个是宇宙的法，那就代表它能让不同的人修到不同的自己的世界中去？\n\n道长：没错。除此之外别无他法。我看出你佛缘很重，一直都有神佛在默默的保护你。（听到这儿，我的泪又流下来了。我一直认为自己不是那么好的人，起码在尘世中早已养成很多不好的习性。没想到竟然还会有神佛保护我）\n\n我哽咽的说：为什么他们要保护我？\n\n道长：不止是你，很多为了拯救自己世界众生的神，下世之后都有他们自己世界的神佛看护。下世的很多都是天上世界的王，因为也只有王才能肩负这么大的重任。你以前曾经结缘的那位龙族尊者也下世得法来了，只可惜迷的太深，已经陷进物质欲望中去了。不相信修炼的事情了，那可是会后悔一生的啊！\n\n黄炎：唉！我夜夜都看到龙族尊者的世界众生在哭泣，他们当初是对尊者抱着多大的期待啊。希望尊者能在世间得法拯救龙族，没想到……\n\n我：不仅是尊者迷失的深，现在的世人又有几个能够心明？他们往往用在世间形成的观念来过人的日子，连内心深处都被物质观念埋没了。请问二位，你们口中所说的能够使宇宙不走向坏灭的法是哪个法门？\n\n道长：你应该听过。\n\n黄炎：现在世间突然出现哪个法门并且迅速强盛后来又遭到强大的磨难的？\n\n我：你说的是……？\n\n我：道长请说。\n\n道长：苏轼是个大才子，佛印是个高僧，两人经常一起参禅、打坐。佛印老实，老被苏轼欺负。苏轼有时候占了便宜很高兴，回家就喜欢跟他那个才女妹妹苏小妹说。一天，两人又在一起打坐。苏轼问：你看看我像什么啊？佛印说：我看你像尊佛。苏轼听后大笑，对佛印说：你知道我看你坐在那儿像什么？就活像一摊牛粪。这一次，佛印又吃了哑巴亏。苏轼回家就在苏小妹面前炫耀这件事。苏小妹冷笑一下对哥哥说，就你这个悟性还参禅呢，你知道参禅的人最讲究的是什么？是见心见性，你心中有眼中就有。佛印说看你像尊佛，那说明他心中有尊佛；你说佛印象牛粪，想想你心里有什么吧！\n\n我听后大笑不止：哈哈，妙。\n\n道长：好了，此次深山奇遇之旅要结束了。回去后你可以把这件事写出来，但是要等到适当的时机。希望你回去后好好修炼，未来人间将会发生很大的变动。\n\n我：变动？是劫难吗？\n\n道长：对于有些人来说是他们的劫难，对于有些人来说是一件走向美好未来的喜事，就看你如何选择了。以前古代预言很多都是不同层次的神留下的，为的就是希望在末劫的最后能够让一些能明白的人知道真相。其实对于一个能得法的生命来说，自然会明白这个法不是求着别人修的。而是假如得法的不是你，你在那个被谎言欺骗的环境中对宇宙的法犯下过错，导致自己错失一切那不可怜吗？\n\n我：恩！我明白了，修炼人都应该有为人着想的心。我会在适当的时候把这件事写出来启发那些能得救的人的善念！\n\n黄炎突然叫了一声：啊！差点把这事忘了，你看。这是你以前戴在身上的紫水晶。\n\n他从身上拿出一块圆形的通透紫色水晶，递到我手上。紫水晶的质地有种冰凉的感觉，仔细看里面会有一些紫晶粒在运动。告别了黄炎之后我和道长回到幻真殿。小道孩早已准备好了饭菜，桌上的三人沉默不语。小道孩也没问我们去了哪里，或许对于修炼人来讲。心态是顺其自然的，该知道的就会知道，不该知道的一辈子都不会知道。\n\n后记，下山之后。我去了山下那些住宿的店住了一晚，打算好好休息一下就回家的。但是当我去到旅店的时候愕然发现店家的日历是我上山的那一天，也就是说我在山上已经过了两天但是对于下面的时间来说，我才上山了几个小时而已。当我以为我是不是因为迷路而睡着做了一个梦的时候，那颗紫水晶却时刻提醒我那是真实存在的而不是做梦。\n\n回家以后，我就立刻去找了关于法轮大法的书籍来看，别问我从哪里看的。翻墙出去之后就免费书籍下载。看了之后获益良多，才明白了什么叫真正的修炼。自从修炼以来身上一直发生了不少神迹的体现。话已至此，多说无益。明白的人自然会明白。\n\n原谅我现在才把这件事说出来，因为这需要时机。现在是时候了，不过现在的时间也很短了。很快，事实的真相就会显现。当神佛大显的时候就是人类的恶业该了之时。趁还有机会，望各位珍惜自己。"
		},
		{
			"post_id": 23,
			"title": "川普是巴顿转世？",
			"date_published": 1492132436.713,
			"body": "最近因为朝鲜半岛局势骤然升级，我想起了网上的一篇关于川普可能是巴顿转世的文章，如果真是这样，朝鲜就等着瞧吧，战神不是好惹的。\n\n* * *\n\n这里是文章链接：[https://du-uu.com/article/58b9e23224f63300105c2455](https://du-uu.com/article/58b9e23224f63300105c2455)"
		},
		{
			"post_id": 22,
			"title": "大科学家哈雷与牛顿的轶事",
			"date_published": 1491810128.242,
			"body": "有一天，著名天文学家哈雷去拜访了大科学家牛顿，发生的事情让他相信了神的存在。\n\n* * *\n\n牛顿有一位朋友，著名天文学家哈雷，他因推算出一颗彗星的轨道，这颗彗星后来被命名为哈雷慧星，他却不肯相信宇宙中一切的天体是神创造的。\n\n有一次，牛顿造了一个太阳系模型，中央是一个镀金的太阳，四周各大行星各照各的位置排列整齐，一拉曲柄，各星立即照自己的轨道和谐转动，非常形象美妙。\n\n一天，哈雷来访，见到这模型，玩弄了很久，惊叹叫好，立刻问这是谁造的。牛顿回答说，这个模型没有人设计和制造的，只不过是偶然有各种材料凑巧碰在一起而形成的。哈雷说，无论如何必定有一人造它，并且是位天才的人。\n\n这时，牛顿拍着哈雷的肩头说：“这个模型虽然精巧，但比起真正太阳系，实在算不了什么，你尚且相信一定有人制造它，难道比这个模型精巧亿万倍的太阳系，岂不是应该有全能的神，用高度智慧创造出来的？”\n\n哈雷这才恍然大悟，也相信了有神存在。"
		},
		{
			"post_id": 21,
			"title": "历史的天空：天国家书",
			"date_published": 1490663860.373,
			"body": "这是翻墙时在正见网看到的神话连载，这神话故事看的我是惊心动魄，感觉比《西游记》精彩多了，强烈推荐。\n\n* * *\n\n# **历史的天空：**天国家书\n\n作者:善勇\n\n【正见网2017年03月18日】\n\n我身边有一位青年男同修，一直在不同时期与我配合各种不同的证实法项目，由于工作繁忙，加之他的孩子出生不到一岁，近一段时间学法修炼上出现懈怠被邪恶钻空子，表现在常人空间中是严重气喘症状病业，影响了正常学法修炼，甚至影响了正常人生活。因为我单身一人，在我居住的寓所连续几日我们共同学法、炼功，严肃向内找，虽然病业症状有所缓解，但没有根除。\n\n一天午夜，由于连续多日整点高强度发正念，同修酣然入睡沉静的如熟睡中的婴儿，一扫往日忧郁恼闷，面带微笑安然睡卧在客厅的沙发上，我还在不断持续发正念。这里要说明一点：经过二十二年的大法修炼，我已在较高等级渐悟状态中修炼了。我的思想与另外空间修炼的身体是合一的﹕即意到功到，心到身到。在定中，我瞬间穿越了同修亿万年的生命历程。我发现在遥远史前的一个时期，这位男同修曾经转生为西方神话中的海神，名字叫波塞冬。在西方神话中他掌管海的世界。海中美人鱼种族在海底神殿中供奉着海神雕象是男性美人鱼形象，手中拿着三叉戟，他们供奉海神的祭品是许多大颗洁白圆润的珍珠，珍珠装在一片片的海蚌壳中。我正注视着美人鱼种族的祭祀过程，忽然海水变得非常明亮，在光明中出现许多晶莹光亮的光粒子——通往另外空间世界的时空之门向我敞开。\n\n我瞬间進入另外空间，進入后我看见一望无际碧蓝的海洋，广阔蔚蓝的天空中飘着朵朵白云，微风拂面，温暖的空气中带着一丝凉爽，天空中有三个太阳，当空间中温度上升到一定温度时，三个太阳又合而为一，放射着和煦的光芒。向远处眺望，在海洋中有一些巨大的岛屿，岛屿上长有茂密的热带植物，山峰高大挺拨，壁立千仞。有些岛屿的上空与周边有一种巨大的带有翅膀的龙在飞翔，很象西方神话传说中的龙兽，龙的体表颜色有多种，龙身有细鳞及巨大的翅膀﹑长长的龙尾。发现我后飞翔的龙在空中发出雷鸣般轰轰的龙啸声，在海岛中赫然飞起了多只体形庞大的龙兽，龙兽身上各有一名戴着面具身披铠甲的龙骑士，铠甲的颜色与龙体色相同，组成三组箭形的编队，前三只龙是金色的，龙眼睛的颜色 为棕红色；左边三只龙是雪白色，眼睛的颜色为淡蓝色；右边三只龙的颜色是正蓝色，眼睛的颜色是蓝黑色的。在我的前方，它们贴進海面飞行，仿佛在引导我前行。在龙兽飞行时，有一团白色能量环绕在龙与骑士身体周围。时常有白色能量与空气摩擦产生的涡流飞向骑士编队后方。前行的过程中，我看见海中有各种兽神在游弋，如海豚，海象，巨鲸--------海中竟然有一群人在穿行，有男性形象生命也有女性形象生命，衣帶飘扬，象是在水中翱翔，渐渐的游向远方……\n\n在接近大陆时，海边各种飞鸟见有龙骑士飞来，纷纷鸣叫着向两侧避让飞去。海边沙滩是白色的，海边有类似古代西方巨大独帆海船，或升帆起航，或整齐的停靠在码头。人群在海边忙碌着，穿着打扮是古代西方人形象，头发的颜色是金红色或红棕色。我跟随着九只巨大的龙与龙骑士在天空中飞翔着，我看见那个世界中有高耸入云的山峰，川流不息的河流，广阔无尽的森林，绵延翠绿的草原及各种各样的神兽。\n\n在辽阔的草原上有一大群白色天马在大地上奔驰，在白马的后面有一些半人半马形象的生命在跟随着，那种生命形体结构是马的身体与人脐部以上人身构成，体表颜色是浅棕色。男性形象生命肌肉发达，头戴简易头盔身披胸甲身背箭袋长弓，手中拿着一根尖锐的标枪。女性形象半人马生命也身披胸甲体形娇小约有1.8米高，3米长，腰部左右各配有一把短剑。它们在牧放天马。在遇到河流时，天马纷纷展开白色翅膀飞过河流，而半人马形生命则一跃而过那宽广河面------\n\n我还看见许多繁华城市，繁荣的村镇。建筑风格、人们衣着打扮类似中欧波西米亚风格。建筑是由白色玉石搭建，红色屋顶。在许多高山上还有一些尖顶楼阁装饰的类似城堡一样建筑。在城市中的建筑也有许多屋顶有多座尖塔装饰的雄伟殿堂。每间厅室有巨大拱形玻璃窗，有些窗玻璃是蓝色的，上有绿色彩饰装饰物。每座城市中心都有一座装饰华丽款式各不相同的巨大喷泉。\n\n人们穿着是白色服饰，成年形象男性额头周围带有不同材质的橄榄枝叶，代表着生命等级与境界。女性头发是金红色的，扎发髻，穿着类似古代罗马女性服饰，项间带有红色玉质蔷薇花的饰品。未成年形象女性的头发是披散的发辫，发辫上配有一朵或几朵白色百合花。\n\n接着龙骑士带领我来到一组庞大的白色玉石建筑群前，在空中整体转向左飞向一片绿色平原上空，白色建筑群极其壮阔庄严典雅，但除了宫门前及重要建筑前的类似罗马禁卫军卫士外，没有其他生命随意走动，只有五颜六色的蔷薇花在明亮的光明中散发着清新的花香，绽放着缤纷美丽的花朵。我在各种建筑中看见神世界天宫正殿是由许多白色巨大圆柱基柱支撑的庞大厅堂，在白色棚顶及基柱、墙壁的上部与中部有黄金打造或镶嵌的精美装饰造型。進入大殿的大厅中间有一长方形水池通向由黄金打造的皇座，蓝色水池中撒布着巨大白色珍珠。皇位两边各有十二个较小金色座位，室内陈设异常丰富奢侈，屋内广大宽阔寂静无声。走出大殿，我看见在每座宫殿建筑前后左右都会有由草坪花卉树木组合成各种园林风景，与所在建筑特点搭配，展现出各种不同风格﹕有的精美华丽，有的简洁明快，有的严谨巧妙。我来到一座圆形白色建筑前，建筑四周有许多根方形基柱支撑，建筑用人类语言称为水晶之宫。\n\n進入宫中，地面与四周一切包括室内基柱完全由水晶打造。地面直通透明宫顶，水晶地面内镶嵌有一朵盛开着红色巨大的蔷薇花，座北朝南有一幅高大的人物肖像画。画的是男同修在天安门打开横幅证实法的那一瞬间的形象，同修目光坚定而无畏，带着坦然的微笑目视前方。我从不同角度看这幅画时，都是同修相同形象不同角度的立体形象。环顾四周墙壁画有同修在尘世间不同时期转生的代表性形象画像，其中有一副是海神形象的画卷，海神手中拿着三叉戟。走到大厅中央，一束光明从透明穹顶照射在我身上，瞬间大厅中我身体周围出现许多星体，星系及天体运行的立体图象，仿佛我已置身于浩瀚的宇宙中，并且时刻在随着那个世界中实际对应的星系天体运转运行着。在那些天体中心位置，有一个被金色光芒环绕的非常渺小的星系，那就是我们地球对应的小宇宙。\n\n走出水晶之宫，又在王宫建筑群中浏览了一些时候，如果建筑是凝固的音乐，那皇宫建筑群就是一首气势磅礴、气象万千、绚丽多彩的华彩乐章。我准备就此离去，走出皇宫建筑群。我的心忽然被一种肃穆与寂静所震撼。在先前龙骑士飞过的广阔草原上已集结了数量众多的各兵种的神族战士方阵，神族战士身穿类似古罗马士兵所穿着的披甲﹑头盔和战靴整齐列队。在方阵群前面是九位龙骑士，他们的身旁是九只巨大几十米长的龙兽，之后是执大型盾牌的神族战士，还有持有标枪﹑短剑等各种武器的神族战士方阵。\n\n方阵群左右两侧各有一支天马骑士，在他们前面各有一支由几百支雪白色战熊组成的熊骑士方阵，在方阵群最后面是由一支半人马神兽组成的弓箭方阵。在整个方阵的最前方有一位头戴金色橄榄枝的男性天神走到我的近前，举起右手，放在心的位置向我颌首致礼，同时神族战士行注目礼，各种神兽则垂下兽首。那位男性天神向我说道：尊敬的正法弟子，感谢您来到我们蔷薇之国，也感谢您帮助我们在人间转生的王—您的同修。我们垦请您转达我们对您的同修，我们伟大的王的思念与心声，请将这份家书转交给我们天国的王。最后请接受我们最衷心的感谢！我双手合十接过一个由红色蔷薇花封印的卷轴拿在手中，致礼后，他慢慢退入方阵群中。众神族战士又一次全体整齐致礼。\n\n方阵群前方为首的龙骑士放下金色面具同时，所有骑士跨上各自神兽，抽出各自短剑，所有神族战士都抬起头目视前方，目光炯炯。随着为首金色巨龙一声高亢短促的龙啸，神族战士们开始有节奏的用剑敲击自己的盾牌，发出整齐而惊魂动魄的轰鸣声：咚﹑咚﹑咚，那声音象是无数颗激荡的心在跳动，那声音象是无数的战士在战场上的呐喊！每位神族战士的眼中迸发出的是一种坚定而无畏的神情，就如同同修在天安门打开横幅证实法的那一瞬间眼神一样。各种神兽目光森森，纷纷张开兽口，露出獠牙喘着粗重气息，无声的咆啸着。伴随着敲击声神族战士开始低声吟唱：\n\n当颓废的世界即将倾覆，\n当乌云遮住了光明，\n您，我伟大的王，在创世主的感召下，\n踏着艰难崎岖的路，在风雪中，冲破黑暗的迷雾，挥动利剑，\n斩尽邪恶的妖魔！\n\n当可悲的生命即将逝去，\n当鲜花即将凋零，\n您，我伟大的王，在创世主的感召下，\n走过死亡毁灭之路，在寒风中，消灭无尽的阴霾，拨开乌云\n带来生命的希望！\n......\n\n渐渐的天国景象变得模糊，声音也变得不清晰，但我心中的感动久久不能平静。出定后，我将定中在同修天国世界的经历告诉同修，并将那份天国家书读与同修，打开封印，封印的蔷薇花化成一片片的花瓣带着奇异香气散落在地板上。信中写道：\n\n敬爱的王：\n\n您离开天国在凡尘世界中已走过亿万年岁月，在这漫长的岁月里我们无时无刻不在想念着您！虽然不能在您身边，但我们的爱就在您身边从没有一丝的减少，只是在不断增长着。\n我的王，在我们心中，您是最伟大的，因为您为宇宙真理舍生忘死；\n我的王，在我们心中，您是最伟大的，因为您为我们世界的幸福而历尽苦难。\n在这新旧宇宙更替的伟大历史时刻，您用无尽的付出挽救了我们的世界，拯救了我们的生命，您的恩德永远印刻在我们的生命里，我们将与您同生共死，直到永远！\n\n深爱您的天国家人\n\n读到一半，同修已是泪流满面，只是觉得自己不够精進，愧对天国众神的期盼。\n\n在之后的日子里,我们以法为师，共同精進，不久同修破除了旧势力迫害，恢复正常的正法修炼状态。与同修这段共同修炼经历后，我时常在想：师尊赐予我们生命，为了保证大法弟子正法修炼，为我们与众生承担无尽罪业；天国无量众神对我们寄予了全部生命的信任与期盼，面对历史赋予正法弟子的伟大责任，我们在正法修炼中为大法与众生已经付出了什么？我们又能为大法与众生付出什么呢？\n\n我想每一位同修都应该静下心认真的想一想了。"
		},
		{
			"post_id": 20,
			"title": "历史的天空：法缘（下部）",
			"date_published": 1490146248.5,
			"body": "这是翻墙时在正见网看到的神话连载，这神话故事看的我是惊心动魄，感觉比《西游记》精彩多了，强烈推荐。\n\n* * *\n\n# **历史的天空：法缘（下部）**\n\n作者:善勇\n\n【正见网2009年06月21日】\n\n日月穿梭，沧海桑田，千百年来，世上的人没有任何变化，在争名夺利中谈情说爱，在六道轮回中，苦苦造业，唯恐掉地狱不深。\n\n唐朝时期，我转生西藏，在藏密红教转生修炼第二世时，一次与大喇嘛们一同去藏南参加一个盛大的法会。途中遇到一个疯子在路边向我们咿咿呀呀地喊叫。见他面容似曾相识。于是我牵住马，开宿命通功能看向疯子。看过后，我与他一切曾经因缘尽知。我下马走到他身边，疯子迷茫的看着我，我用佛法神通将他闭锁的记忆打开一部分，问道：你，还记得我吗？疯子迷茫的眼神逐渐变的清亮，眼中涌出二行泪水，抓住我的手说道：救我！我郑重地点了一下头，吩咐身边小喇嘛将疯子带回红教寺院。\n\n原来这个疯子就是与我一同在天国与师尊签订证法誓约的法王子，曾经的太阳王。他转生为隋朝将军宇文成都，在隋朝末年因名利造大罪业，今生得此果报。因他在隋朝造业甚大不能授法修炼，只能先苦行消去罪业。一生修不成，应修八世才可彻悟本性如来境界。\n\n我吩咐喇嘛将寺院中最重，最脏的事情全部交给疯子去做。每日只可吃饱，睡在牲畜棚中，如此七年。一日，我问疯子说：疯子，你快乐吗？疯子说：请上师传法度我到法界彼岸。我说：你罪业深重，一世修不成。疯子说：依从上师一切教诲。我见他佛性显现，机缘成熟，于是灌顶，传法给他。正式教授他藏密红教修炼。讲授一些藏密修炼基本法理后，将其带入一山洞中闭关苦修诵经，忏悔罪业。十三年后，我又教授法王子红教密宗修定方法--拙火定。三十年后，一次我打坐修定，见法王子恶业缠身，将不久于人世了。随后几天，法王子出现严重病状，在下山乞食过程中，遇劫匪竟意外身亡。\n\n接着，法王子转生一西藏牧民家中，待等法王子七岁时，我将他接回红教寺院继续修炼。由我指定一名大喇嘛教他识字，学习藏密经典，但他过去生造业甚大，成年后仍在山洞中苦修，一生苦修至天寿终。第三世法王子转生继续修炼，一如既往，于山洞苦修中，天年坐化。我与大喇嘛们用佛法神通观测藏地未来救度众生事业，看到未来33年后将有邪教异族入侵藏区，危害众生。法王子转生到吐蕃王家中为长子，由一位大喇嘛负责教授他步下，马上功夫，学习排兵布阵之法。同时也学习一些藏密经典。三十三年后，藏历木鼠年法王子大败异族入侵之敌，此一战换来藏区四百八十年太平盛世。几年后法王子病重，离开人世，大喇嘛引导他的亡灵转世，继续他的修炼历程。\n\n我们居住的地球大陆板块的地下也有人类，只是形象大小与我们人类有差异。我们脚下的陆地地表下面有密如蛛网的地下通道，历代西藏大喇嘛们掌握着在喜马拉雅山脉通向地下世界的门。在古代地下人经常和喇嘛们定期在山脉中通往地下世界的通道口会面，有时地下人会向喇嘛索要食物，地下人尤其喜食牦牛肉，作为回报，地下人会赠送喇嘛们一袋天然金块，有时重达百斤以上，这是他们在地下发现的，金块对他们来说毫无意义。地下人大多数过着靠血缘关系维系的氏族生活。近代这种接触几乎很少了。\n\n地下有湖泊、河流，古老的温血兽类，地下植物等。在影视传媒中有些人类地区湖泊河流中出现怪兽。大多数是因为这些湖泊、河流与地下河流湖泊相通。会有地下兽类通过相通水道上到地表，有时上来时被人类发现。\n\n又过了许多年，我在藏密红教中七世苦修即将圆满。召集所有红教喇嘛、居士、信徒在一起，举办此生我最后一次法会。\n\n在众人到来之前，我将法王子召到我近前说道：未来弥勒佛主为宇宙众生利益故，将转生汉地，转大法轮，普度众生。到时人世将有魔王带领魔子、魔孙披人皮祸乱人世，危害众生。你我为佛法正觉觉者，应协助弥勒佛主于世间转大法轮，法正乾坤。即使牺牲生命，义无反顾。你还应苦修二世方可圆满。我已完成红教修炼历程，将不久后转生汉地为未来大事做些准备。法王子双手合十道：不负尊者期望。\n\n后来法王子又经二世苦修，总计八世耗时538年在红教中修练圆满。\n\n我与这位同修仅世间法缘时间跨越已达千万年。我们所有的正法弟子一同经历了无数艰苦岁月，生死与共，不离不弃。或许我们共同经历的无数生死考验，在迷中的同修已经淡忘，被历史尘封在深深的久远记忆中，但这记忆不会真正消失，我珍惜与同修无比珍贵法缘。我们应该帮助那些迷失在人中的同修。他们曾经与我们共同经历无数艰苦岁月，生死与共。我们不能在这样一个历史时刻丢弃他们。让我们共同携手回归那无比美好的天国家园。永远生活在神圣光辉的世界中。永远。"
		},
		{
			"post_id": 19,
			"title": "历史的天空：法缘（上部）",
			"date_published": 1490145344.604,
			"body": "这是翻墙时在正见网看到的神话连载，这神话故事看的我是惊心动魄，感觉比《西游记》精彩多了，强烈推荐。\n\n* * *\n\n# **历史的天空：法缘（上部）**\n\n作者:善勇\n\n【正见网2009年06月21日】\n\n在漫长的宇宙历史中，任何生命都逃不过旧宇宙法理成、住、坏、灭的束缚。高境界神看到低境界生命层次物质因素在漫长岁月中变异败坏而忧心忡忡。不止一位伟大觉者为了挽救他的众生，为了证悟出金刚不坏的佛法，冒着生命危险，投胎十恶毒世，以期锤炼出最正的佛法带回他的天国。不想人世险恶，自己也毁在人中回不去了。不同层次的如来、天主在不断观察，思考着根本解决宇宙众生所共同面临的最后劫难。\n\n这时伟大的师尊出现在宇宙高层。层层转生下走中，于宇宙大穹不同层次中开讲不可思议的大觉之法。绝大多数佛、道、神仍在观察着事态发展、变化。一些觉者决心协助师尊在人世中转动法轮，法正乾坤。师尊下走到我生命所存在的宇宙天体层次，针对我那一层次中所有大天主、大法王们讲了一次法，听师尊讲完法后，我更加明确了生命存在更深刻内涵，决心助师正法。于是我与我那个境界中四位大法王随同师尊下走人世。下走到一个叫大光明天国世界时，在青山溪水边见此境界法王如来之子苦苦思索众生劫难解救之法。我于是飞至法王子身边对他说：佛主即将下走临凡，转大法轮，普度众生。此为绝好契机，何不随佛主一同下走于人世中，锤炼、铸就金刚不坏之法？法王子毫不犹豫地说：待请上神引见，拜见佛主，以表心意。我说：随我来。我同法王子来至师尊的天宫--大明苑。\n\n师尊高坐在莲花台上，法相无比庄严神圣。叩首后，我说：佛主，我二人愿随同您下走人世，协助您弘扬佛法，救度众生。“你们可知人世险恶，路途艰辛？”我说：我二人仰仗佛主法力，不畏生死。为表决心，以誓约为证。师尊慈悲的看着我们，挥手间，面前出现两张桌案，上面有黄色丝绸一样的卷轴。我写到，誓约：一、用正念证实伟大佛法。二、如果有邪恶破坏大法，一定用生命去维护、捍卫伟大庄严的法典。三、一但违弃誓约，必遭形神全灭之恶报。正法弟子中一些同修曾与师尊在不同层次天国签订过正法誓约。内容基本差不多少，只是侧重点不同。\n\n辞别师尊，出了大明苑后，法王子对我说：人世艰险，岁月漫长，一旦迷失还望上神加护。我说：我定当维护，不使迷失。如若我迷失人中，也希望法王子救我于生死间。法王子说：我亦当以生命维护。\n\n法王子即将下走，大光明如来和天国众神眷属依依不舍，泪流满面，恐怕这一别与法王子再无相见之日。法王子面对众神坚定的说：我一定会回来的，这是一颗千叶菊的种子，当千叶菊第一千片黄色花瓣盛开的时候，就是我回来的时刻！说着把千叶菊的种子放入天国土地中，毅然转身下走。我二人与众神随同师尊继续下走人世。从天国到三界下走过程，用人的时间观念看也是一个无法形容的极其漫长的岁月。\n\n大约六千七百万年前，地球不是现在的运行轨迹，要离太阳近一些，地球一年中以高温居多。年平均地表温度在45摄氏度以上。那时人类大多居住在岩洞或地穴中。大陆板块也不是现在的样子。那时地球北半球有二大主要大陆板块，居住着巨人族，身高在3米左右。南半球多为中人，小人居住有四块大陆板块，在南北半球之间还有一些巨型岛屿、群岛。杂居着巨人、中人、小人。\n\n陆地上的动、植物与现在地球上存在着的动植物有巨大的差异。六千七百万年前地球陆地上、天空中、海洋里生活繁衍着各类型恐龙族群。陆地上植物多数以热带阔叶乔木、藻木为主。那时的地球曾是恐龙的乐园。海洋中也有几种人类。美人鱼种族那时已存在于地球海洋中。海中还有一种人鱼，性情凶残。有着肺和鳃两种呼吸系统，身体表面覆盖着细密的鳞片，颜色蓝灰色。头部两只大眼睛占面部三分之一，鼻子是两个孔，嘴如同鲤鱼一样，嘴中布满锋利牙齿，身长近二米。手指、脚趾间有蹼。这种人鱼经常成群爬上陆地掠食中人和陆地上各种恐龙。他们的武器是经过打磨的巨大动物遗骸的肋骨。在北半球主要巨人聚居的二块大陆板块，有十三个王国国家，那时我生活在最东部的巨人族王国中。因为最早见到太阳，所以这个国家被称为太阳之国，十三个国家有四种宗教信仰。常因信仰不同而发生宗教战争。\n\n按当时习俗，我从很幼小时（刚断人奶）被太阳国大祭司选中，進行宗教学习、修炼，并作为他的继承人。大祭司的作用是观天象，预测国家兴亡，自然灾害；辅佐国王，以德治国；秉承天意，教化民众，休养生息。经过三十五年艰苦宗教独修，進入高度渐悟状态，依照天意，开始弘扬佛法。我弘扬，证悟的佛法名称叫大日觉法。在太阳国全民上下，包括国王都是佛法信徒。部族战士们统一食宿，统一练习军事技能，也统一進行宗教修炼，如同古代少林武僧一样，拳禅合一。太阳国国王哈坎琉斯（众神之子）经常请我去王宫和众大臣一起听我宣讲佛法，而这位国王就是前面提到的大光明世界的法王子。一段时间内，我進宫多次见哈坎琉斯疏于朝政，整日饮酒作乐，于是我对太阳国国王说：大王，这些时日，意志为何懈怠了，我夜观天象，见斯米岛邪教国家联合我周边王国意图大举入侵我国，不知大王作何打算？哈坎琉斯答道：我国国富民强，军队战士骁勇，斯米岛人不敢前来攻打，我已厌倦攻伐杀戮，应安享繁荣盛世。\n\n我说：一个人的幸福对他本人来说很重要，但还有更多的人被邪教所迷惑。如迷途羔羊生死命悬一线，上天赋予大王伟大历史责任，大王应救天下苍生于水火。大王对个人幸福与天下苍生利益之间应作取舍，希望大王以天下苍生为重，修己治国，为天下苍生开创千古基业，永享太平盛世。太阳国王面带愧色说：我一定会记住你说的话语，为天下子民永久幸福，我将奉献出我的一切。从此太阳国国王哈坎琉斯严于律己，勤于治国，励精图治，经过艰苦努力打败邪教联盟军，统一巨人族二块大陆。\n\n一切战事结束后，巨人国之王哈坎琉斯站在一座山峰之顶，手指遥远天际的地平线对我说：我所走过的土地，我的一切国土，都是你弘扬佛法的地方。如果需要帮助，我会竭尽全力。我授权给你，教化我的子民吧！我说：大王，我一定不辱使命……七千年后，我弘传的佛法進入末法时期。\n\n一个平静的早晨，人们刚刚从沉睡中苏醒，天空中翼龙展开近十米的翅膀带着刺耳的鸣叫扑向他的猎物。热带阔叶林中一支剑龙带着它的幼子在水边安静地喝着水，不远处一只霸王龙贪婪地盯着剑龙母子。忽然远处天空传来一种巨大、特别的声音，林中所有恐龙都竖起了耳朵朝向声音传来的方向，人们惊愕地抬头望向天边：一个直径25公里（如同中等城市大小）的小行星以每秒30公里速度带着与空气摩擦发出的巨大的轰鸣声撞向地球。不久传来一声震天动地的巨响，整个地球都在颤抖。地球被撞离原来的运行轨迹，远离太阳而去。这颗小行星撞到地球后，随着小行星的撞击几块大陆板块立刻沉入海底。撞击后荡起的岩石碎粒、尘埃，加带被气化的海水形成一个巨大蘑菇云不断升高，不断升高将地球表面覆盖，遮蔽了阳光，地球陷入黑暗。同时巨大的高达五公里的海啸，席卷全球，接着就是连续几天的滂沱大雨。更可怕的是由于小行星的撞击引发地壳、大陆板块大变动。一些陆地岛屿沉入海洋。一些海底大陆凭借小行星撞击力量冲出海面直刺天空。曾经的海洋变成陆地，曾经的大陆连同上面的一切生命、文明沉入深深海底。由于地壳，大陆板块不稳定，不断迁移，撞击引发无数大小火山持续喷发，地球整日烟尘滚滚，伸手不见五指。升腾起浓重的火山灰覆盖在地球表面，这种情形持续了三十二年。由于地球上没有充足阳光，动植物几乎死光，恐龙也因此逐渐灭绝了，地球進入冰河时期。这一期人类就这样结束了。残存人类進入了下一期人类文明时期。\n\n在大陆板块大变动中有一座靠近海滩的海底山峰突出海面八千多米，那片海滩连同陆地突出海平面几千米。我们这一期人类把那座高峰叫做珠穆朗玛，那片海滩形成的高原叫青藏高原。"
		},
		{
			"post_id": 18,
			"title": "旱灾背后有原因",
			"date_published": 1490057822.597,
			"body": "气象学家用冷暖气流理论解释一切天气变化，用一种现象去解释另一种现象，等于没解释一样。\n\n这个真实的故事揭示了气象之外的本质，现在的气象学还是太肤浅了。\n\n---\n\n《清史稿》记载了这样一个故事：\n\n嘉庆帝即位后，下诏求言献策。洪亮吉任职上书房，写下千言的奏折，直言朝政之弊端，言辞激切，触怒嘉庆。下狱并定死罪，随后嘉庆后悔，又下旨改为流放伊犁。\n\n洪亮吉被流放伊犁后，这年四月，北方大旱，地方官们祈雨，不下；嘉庆祈雨，不下；设粥场赈济饥民，不下；下令赦免人犯，还是不下。\n\n嘉庆忧心忡忡，自己想到可能是冤枉洪亮吉，激怒了上天。他把平反的诏书亲自抄写，当他写完“钦此”最后一笔的时候，一道闪电划破长空，紧接着雷声大作，大雨从天而降！嘉庆感叹道：“天鉴捷于呼吸，实可感畏。”\n\n人之所为，神目如电。人的善恶行为能够被天所感应到，即“天之照人，与镜无异”。"
		},
		{
			"post_id": 17,
			"title": "李八庙的来历：苍天有眼",
			"date_published": 1490000437.09,
			"body": "人们有时候会说：“好人不长寿，坏人活千年”。这个真实的故事告诉你一切皆有缘由。\n\n* * *\n\n李八是明朝时期河南南阳城东白河东边的人，有几十顷良田，经常救济本村和方圆的贫穷之人，还做公益事业，如设舍饭场、舍茶棚，在白河上架设木桥等，周济个体的贫穷之家更是家常便饭寻常事，深受百姓爱戴。\n\n但不幸的是，在他四十几岁时一年夏天下暴雨打炸雷把他击死在村外的大路上。消息传开，本村和四邻八村的百姓都自发地前来看他，尸体周围围满了人。有的放声痛苦，有的小声啜泣，都为这位大善人的惨死早逝而哀伤惋惜。\n\n正当此时，京城一位前来南阳巡访的钦差大臣来到事发现场，钦差下轿，走近百姓询问死者是何人，百姓为何如此悲痛哀伤？百姓将李八生前善行善举及今日不幸遭此横祸一一细说一遍。钦差闻罢也不禁哀伤落泪，抱怨上天不公，遂在李八手心书写“苍天无眼”四字而去。\n\n旬日，钦差办完公事回到京城。入府当天皇上便登门相见，明里是接风洗尘，实际是有事相求。\n\n寒暄之后，皇上便迫不及待地说出了后宫发生的喜事、奇事：皇后降生太子，但却一直啼哭不止，所有皇亲近臣都请了来哄，一概无效。期望爱卿入宫解忧。该大臣不敢怠慢，立即陪驾入宫。皇后将太子托递于他，他一接过，太子便立即止了哭声，且似有笑意，大家无不喜悦，以为从此不会再哭。但当该大臣将太子还给皇后之后，却又哇哇大哭起来。皇后为了试出是否只有交给该大臣才不哭，就把太子交给皇上抱，皇上一抱照哭依旧。皇上又把儿子交给别的大臣抱，依然是哭。只有转到这位大臣怀里才不哭。\n\n这引起了该大臣的警觉和思索——难道与南阳李八有关不成？他就把太子的小手掰开看，一看，惊、喜、自责等情感交加，将孩子递给皇后，扑通一声跪在皇上面前，说：微臣有罪，罪该万死！大家都感到莫名其妙，一阵惊愕！皇上忙问何故。该大臣将自己在南阳路遇李八遭雷击毙命、民众痛哭、道说李八善举、自己在李八手里题字之经过详述一遍，并告诉大家，太子手心里有字，正是自己的字迹，大家都亲眼去看，一点不虚。\n\n从此太子不再哭泣。该大臣羞愧地说：微臣道行浅薄，不识天机，竟敢咒骂苍天神灵无眼，岂不是滔天大罪？望皇上惩罚微臣。皇上说：按人理说你有功，当赏；按天理说你有罪，当罚。那就罚你做建庙监理，重回南阳为李八建庙一座，一来表彰李八之功德，二来彰显善恶有报之天理。于是该大臣又来到南阳为李八建了一座神庙。该庙至今依然存在。\n\n李八所遭的恶报是其前世作恶导致的（关于李八的故事南阳还流传有别的版本，说他三十来岁还没有得儿女，他曾为此找高人算卦，高人告诉他前生做过恶，这一世要遭报应）。他这一世的报应就是无子、暴死。\n\n李八转生太子获得大富大贵，又充分彰显了善有善报的天理。神佛注重的是人的灵魂，是把灵魂作为主体，依据其在漫长的生命过程中的善恶行为给与报应的。"
		},
		{
			"post_id": 15,
			"title": "花儿知我心",
			"date_published": 1489365280.248,
			"body": "想知道你的女朋友是不是打算嫁给你吗？如果她养着一盆花，那就简单了。\n\n科学家发现植物可以充当测谎仪，而且还非常准确呢。\n\n---\n\n**植物能当测谎专家** \n\n巴克斯特是美国测谎仪专家。1966年他意外地通过测谎仪记录到了植物的类似人类的高级情感活动并随之开展了一系列研究，他的研究轰动了全世界。 \n\n测谎试验通常是把仪器接在嫌疑人身上，但巴克斯特这次却将测谎仪接在植物上，结果他发现植物能分辨人是否在说谎。他问一个人的出生年代，报了7个年代，其中有一个是正确的。但是这个人否定了所有的答案，结果那个正确年代被否定的时候，记录纸上出现一个高峰。 \n\n纽约若克兰德州立医院的医学研究部主任阿里斯泰德．依塞（Aristide Esser）博士重复过这个实验：「让一名男子对一些问题给出错误的回答，结果他从小苗养大的那棵植物一点没有包庇他，把错误回答都反映在记录纸上。」 \n\n一名网民在其博客上感叹道：「佛家认为：万物皆有灵。以前都认为是迷信，现在科学已经证实了：植物是有感知的。」 \n\n而古人常说：「若要人不知，除非己莫为。」或者说，三尺头上有神灵，意思是说人在做，神在看。不管人是否相信神灵的存在，但在一旁不声不响的植物却都「看」在眼里。"
		},
		{
			"post_id": 14,
			"title": "为什么预言家的预言不准了？",
			"date_published": 1489215533.936,
			"body": "巴西预言家朱瑟里诺曾经准确预言过美国的911灾难和印尼的海啸，但后来的预言很多都不准了，本文将揭秘其中的原因。\n\n* * *\n\n因为预言家是神的使者，他们存在的目的是通过他们的预言提醒人类神真的存在。\n\n信神的人类会自我约束，道德能维持；不信神的人类会为所欲为，道德会滑坡。\n\n如果人类的道德整体下滑到堕落的程度，神就会毁灭他们，就像圣经中记载的那样。\n\n神有权力这样做吗？当然有，因为人类是神造的，神觉得这茬人类不好了就不要了，从新造新的。\n\n在前面的博文《遭雷劈死而复活》中，有这样一段话：“异象显现在屏幕上时，光灵告诉我，一九九四到一九九六之间的几年，是决定这个战争是否会爆发的关键。”\n\n那几年发生的事情已经改变了历史，所以预言家的预言不准了，第三次世界大战也不会发生了。\n\n换句话说，人类当时的表现让神满意，正法传出，上亿人学，说明人类的善念仍在，所以神为人类改变了未来。"
		},
		{
			"post_id": 13,
			"title": "音乐的力量",
			"date_published": 1489195949.693,
			"body": "从来想不到音乐还有这么大的力量，看来我以后要多听优美的古典音乐，远离狂放的摇滚乐了。\n\n这是日本科学家做的一系列水结晶试验。试验很好地阐明了物质与精神之间的相互作用。\n\n---\n\n**贝多芬 《田园》**\n\n![](img/water-tianyuan.jpg)\n《田园》曲明快、爽心、快乐，是贝多芬的代表作之一。这张美丽结晶照片证明了良性音乐可以给水以活性，促進成长发育。\n\n**萧邦《离别》**\n![](img/water-libie.jpg)\n这首钢琴名曲，也许是因为“离别”之曲的缘故，基本结晶完整地被细细分化，成为地地道道的离别模样。尽避显微镜的倍数是一样的，结果却大不一样。"
		},
		{
			"post_id": 12,
			"title": "科学家证明“心想事成”是真的",
			"date_published": 1489108130.591,
			"body": "三个由不同科学团队所做出的研究，证实了一件非凡的事情：人类的情绪实实在在地形塑了我们所处的世界，不只是我们对于世界的觉知或观感，而是真切的现实。\n\n这样看来，神创造万物的说法是真的，神的思想就可以直接造物。\n\n对于我们凡人，应该多想些美好的事物，远离那些丑恶的东西，让自己的生活更美好。\n\n* * *\n\n![](img/20170310032150158.jpg)\n\n在第一项实验中，受试者的DNA被单独存放在一个密封的容器中。在另一个房间中，DNA的主人会接受情绪刺激，而神奇的是，那个被隔离的DNA竟然会受到影响。\n\n当受试者受到负面情绪冲击时，抽取出来的DNA便会紧缩起来；反之，当受试者产生正面情绪时，DNA的螺旋便会放松。\n\n凭藉这样的实验，科学家下了一个结论：“人类情绪所产生的影响，甚至可以推翻传统的物理定律。”\n\n![](img/20170310032151905.jpg)\n\n第二个实验有些雷同，但是两者并无直接相关。另一组科学家从受试者身上抽出白血球细胞，放在一个测量室中，他们就可以得知电讯号的变化。\n\n在这项实验中，受试者被安排在另一个房间，而且要观看一些短片，试图使他们产生不同的情绪，接受所谓的“情绪刺激”。\n\n而DNA（即那些白血球细胞里头的染色体的DNA）则放置在同一栋建筑的不同房间里。受试者与其DNA都被监测着，数据显示，不论受试者反应出情绪的高点或是低点（经由电讯号反应得知），DNA也会在相同时间呈现相同的反应。\n\n![](img/20170310032151471.jpg)\n\n两者之间的反应没有时间差，传输也不耗费任何时间。DNA所呈现的高低，与受试者的情绪峰谷完全一致，即时反应。\n\n科学家想要更进一步了解，要使受试者与其DNA相隔多远的距离，这种效应才会消失。于是，在他们把受试者与其DNA放到相距50英尺的两个地方后，他们就决定停止这项试验，因为就算距离这么遥远，他们还是得到了相同的结果。没有时间延迟，也不需要传输时间。\n\n受试者与其DNA在同时间有一模一样的反应。所以我们得到了一个结论，个体与其DNA可以相互交流，超越时空的限制。\n\n第三个实验，证实了更加惊人的事情。\n\n科学家观测了DNA可以在我们的物质世界中产生什么样的影响。\n\n光子是组成世界的基本粒子，科学家将一些光子置于真空管中观测，但其位置不能被准确测定。\n\n之后，人类的DNA被放到同样的真空管里。惊人的结果发生了，那些光子不再随机漂浮，它们精确地随着DNA的几何结构移动。\n\n![](img/20170310032151470.jpg)\n\n执行这项实验的科学家表示：“那些光子的行为在我们的意料之外，可以说与我们估算的大大相反。”又说：“现在，我们必须承认，可能有某个未知的能量场存在。”\n\n他们也做出了结论：人类的DNA实实在在地影响了光子的行为，而光子则是组成现实世界的基础！\n\n于是，当科学家将这三个科学实验的结果合并起来检视的时候，可以想见他们有多讶异。\n\n他们恍然大悟：如果我们的情绪影响着DNA，DNA影响着光子，光子形塑着我们的世界；那么，我们的喜怒哀乐，便有改变物质世界的能力。\n\n![](img/20170310032152892.jpg)\n\n还不只如此，我们与自身DNA的连结，已经超越了时空的维度。\n\n我们的选择的情绪会显化真实。\n\n科学证实的这个结果，简直是大开眼界，让我们知道所处的宇宙究竟是怎么一回事。我们所要做的，就是“将所有线索都连结起来”（connect the dots）。"
		},
		{
			"post_id": 11,
			"title": "大卫·科波菲尔为何不买彩票",
			"date_published": 1489020787.479,
			"body": "大卫·科波菲尔曾经提前八个月预测成功德国彩票中奖号码，但他本人从不买彩票，这是为什么呢？\n\n* * *\n\n大卫．科波菲尔（David Copperfield，又译戴维．科波菲尔德）是一位世界闻名数十年的美国魔术师。他的精彩表演使人叹为观止。他最著名的表演包括使自由女神像「消失」和只身穿越长城。大多数人都觉得大卫的魔术就是地地道道的魔术，其实他是一位特异功能者。\n\n2001年10月17日《底特律自由新闻报》登载的一篇消息，报导了大卫的一次表演：今年2月17日，大卫为将在10月摇奖的德国的彩票预测结果，秘密写下了7个数字，并把该谜底加公证加锁封存，由人日夜看守。10月13日，在彩票摇奖结果揭晓后一个小时，德国电视台打开封存7个多月的盒子，电视观众看到的七个数字与彩票结果完全一样。事后，大卫收到的信件，如雪片一般，大都是向他讨教如何中彩的技巧。\n\n大卫一向以魔术师自居，自称所表演的魔术仅是「花招」，但这次大卫坚持说不是花招，还说他本人从不买彩票。他过去曾为朋友预测过彩票，但都失败了。他说，后来才明白预测要准确就必须严守秘密，谜底不能透露给任何人，最重要的是不能用这种方式来赚钱，破坏人类社会的常态。也就是说，所拥有的特异功能不是用来发财的。\n\n那么，是谁控制着这个原则不许走样、人想走样也走不成呢？是天理。无论人堕落到何种地步，宇宙的理是亘古不变的。非要行恶的，就惨了，就注定要被收拾了、淘汰了。"
		},
		{
			"post_id": 10,
			"title": "赵云今安在？",
			"date_published": 1488958522.11,
			"body": "你身边的每个人都可能是英雄，他可能看起来毫不起眼，但在古代却曾经是大英雄。\n\n今天的故事是关于赵云的，这是一段传奇的经历。\n\n---\n\n### **狱中奇缘**\n\n故事的主人公是一位大学毕业生，有一天，由于信仰被投入劳教所，刚一进入牢房，一位年轻人一直目不转睛的盯着他看，他觉得很奇怪。\n\n到了晚上，那位年轻人找到他，对他说：“你一进来，我就看到赵云进来了，对我说，马超，我来救你来了。”\n\n那个年轻人天目是开的，能看到别人看不到的东西，是马超转世，这次是犯事进来的。\n\n于是，这位大学生与这位年轻人在这样一个特殊的场合共同度过了一段日子，无话不谈，亲如兄弟，了却了一段古代结下的缘分。\n\n当这位大学生第二次被投入劳教所时，打听那位年轻人的下落，却听到了不好的消息：那位年轻人出去后，不甘平庸的生活，竟然持枪抢劫运钞车并拒捕，被当场击毙，命运令人嗟吁。\n\n同一个人，生在乱世成了英雄，生在盛世却成了土匪，真是英雄和土匪一念间啊。\n\n马超，希望你的心灵已被救赎。\n\n子龙，你还好吗？"
		},
		{
			"post_id": 9,
			"title": "看了这个，你还浪费吗？",
			"date_published": 1488952918.768,
			"body": "现在人们生活好了，有人花钱大手大脚，吃饭时经常浪费食物，觉得剩下很多不吃是讲排场。\n\n可是你知道吗？这样做是在削减自己的福分啊，福分都用完了，也就什么都没有了。\n\n* * *\n\n### **查氏饼异**\n\n宋代洪迈《夷坚志》里的《查氏饼异》中说，宋孝宗干道二年（公元1166年）。当时，湖北荆州的南边，有个沙头村。村里有一户人家姓查，祖祖辈辈居住在这里。这家有个女孩，从小就喜欢吃烧饼。她吃烧饼的时候有个坏习惯，光吃烧饼里有糖和芝麻的饼心，剩下的饼边，像个圆圈，都扔掉了。\n\n十四岁那年，即干道二年，有一天，她在庭院里玩。忽然风雨交加，雷鸣电闪。有一个不明物体，把她抓到天上，随即一声炸雷，这个女孩便被击死，在风雨中落到地上。这时，天上又落下许多饼圈。过了一会儿，只见一群狗跑来，抢着吃这些饼圈。原来这些饼圈都是那个女孩曾经扔下的。\n\n### **玄宗训儿**\n\n唐朝，唐玄宗的太子唐肃宗，小时候经常跟玄宗在一起吃饭。有一次吃肉和饼，玄宗叫儿子用刀子，把肉切成小块。太子切完了肉，手上还沾有许多油，他就用一块饼擦手上的油。玄宗严厉的看着他，太子知道自己错了，吓的把擦手用的饼赶快吃了下去。玄宗高兴了，对太子说：「有福不可享尽！对于福气，就是应该如此珍惜。」\n\n### **辰同命异**\n\n主人和雇工的妻子同年同月同日同时生下一个儿子，结果主人的儿子活到十几岁死了，而雇工的儿子活了七十多岁。有人问：按照生辰八字算，这怎么解释呢？这两人应该活一样长啊。算命先生说，那个有钱人的儿子娇生惯养，挥霍无度，把他一生的福气都用光了，他也就死了。而那雇工的儿子生活贫寒，结果当然不一样。"
		},
		{
			"post_id": 7,
			"title": "月亮之谜",
			"date_published": 1488855891.297,
			"body": "当我们仰望星空，最引人注目的就是明亮的月亮了，它有时象弯钩，有时象圆盘，引无数诗人感时伤怀。\n\n一位台湾的笔名归真的朋友通过修炼回忆起自己的很多次前世转生过程，他其中的一世竟然是史前时期一位参与制造月亮的工程师，他会告诉你月亮当时是怎样造出来并升到天空的。\n\n---\n\n### **史前时代的回忆**\n\n我真的转世很多辈子了，我还记得曾经在一个科技相当发达的史前年代转世过，远远超过现代的发达程度，许多现代人认为不可能的科技在当时是家常便饭。当时的人们科技发达到想要制造一颗月亮上天，照亮黑暗的夜空（说句题外话，现代人假使真有这样的技术也会想这么做的，只是现代科技不够发达，做不到）。而我在当时是一个工程师，协助建造了月亮。我记得月亮中间不但是中空的，还放满了各种精密的控制仪器，以及精密的齿轮组，机械的精密度远远高过目前的最尖端科技，这些机械可以维持月球正常环绕地球运转。他们使用一种超高密度的能源维持月球的自转与公转，因此可以维持月球转到今天还没停下来。而当时月亮的正面是完全抛光的，晚上看来简直光芒四射，背面则放了一些控制设备，因为这样，所以将正面设计成永远面向地球，而背面在地球上则永远看不到。\n\n现代有许多画家、艺术家创作想象人类史前时代的作品，有些相当逼真，其实是他当时转世的残余记忆。史前的人类文明的确是非常发达的，过去有些时代的文明可以将一座城市弄上天去飞行，空中的飞行物也不仅止于飞机，而是像现在的巨型轮船在天上飞行。但是由于以往的文明往往使用非常纯净，非常高密度的能源，用完也不会造成环境污染，可驱动一些庞然巨物。现代人看到以石器为主的古文明遗迹，以为史前人类只会使用石器，没有使用“电”的任何证据，就断定史前人类是没有文明的，实在是站在现代科学角度的偏见。\n\n有些人认为现在的人类是唯一具有文明的，也是人类史上最发达的，其实与事实恰好相反，在人类的文明史上，本次人类文明算是少有的低度发展文明。史前人类比现代人重视精神的力量，他们知道精神与物质是一性的，常常利用自己的精神力去加强物质的发展，不像现代人只着重在技术的改进。\n\n比如，他们会净化自己的思想，让自己的心念很纯，就可以加强放大某种能源。像刚刚讲的月球，是在地球上组装好骨架后，一群人利用一些装置有类似水晶（但不是水晶，而是某种更纯净无杂质的矿石）的机械装置，在地上打坐用意念加强这些矿石的能量，使庞大的月球腾空升起进入轨道。接着在轨道上进行后续的组装工作，架起巨型鹰架，无数的金属制太空小飞艇来回穿梭。这些小艇都是单人座或双人座，人们穿着轻便的太空装，日夜不息的施工，看来好不热闹。"
		},
		{
			"post_id": 6,
			"title": "真实的阎王爷长什么样？",
			"date_published": 1488851978.29,
			"body": "过去，认识阎王爷是从《西游记》开始的，一想起他那句：“阎王叫你三更死，你就活不到天明。”，心里就毛骨悚然。\n\n那么，真实的阎王爷长什么样呢？下面两则真实的小故事告诉你阎王爷长什么样。\n\n原来，真实的阎王爷并不可怕，赏罚分明，还是个“包青天”呢。\n\n---\n\n### **退休老干部自述：梦游地狱**\n\n我是一名退休干部，今年（2006年）六十八岁。过去我深受无神论的影响，从来就不信神、不信鬼，更不信有天堂和地狱。然而一次梦游却彻底转变了我的观念。\n\n那是二零零五年四月十日，大约凌晨三点钟左右，我做了一个离奇而真实的梦。在似睡非睡之际，看见来了两个地府阴差。一个头戴高帽子，身穿白衣服，嘴里伸出很长的红舌头，一直耷拉到胸口，手拿着大铁链子。另一个头顶两边尖中间凹，穿着黑衣服，手里攥着腰牌，腰牌上写着字，写的是什么我没看清楚。看到阴差这幅模样，我心里挺害怕。后来才知道，这两个阴差就是民间所说的黑白无常。\n\n阴差让我跟他们走，我说：“我没犯什么错，跟你们走干啥？”黑无常说：“你就跟我们走吧，到了就知道了。”我只好起身跟他们走了。一开始还挺亮堂，可越走路越黑。我看到路两边放着长条桌，桌上放着一些大碗。不少人坐在简易木凳上喝水。他们个个衣衫褴褛，破烂不堪。女的全都披头散发。水碗里的水很脏，象泥汤子一样。我嫌脏，一口水也没喝。\n\n走了一段路后，天色一下子亮堂了，我们好象走进一个极其广大的屋子里。这时我看到地上支着一口大油锅，直径大约五米左右。锅底烧着木拌子，锅里沸油翻滚，热气灼人，两个尖头鬼卒光着身子赤着脚，腰间只围着一小块布，正在往油锅里扔罪囚。不一会就扔进了四五个罪囚，每扔进一个就听见“妈呀”的惨叫声，凄厉无比，吓得我不敢看下去，赶紧闭上了眼睛。\n\n阴差继续领着我向前走，又看到不少罪囚被绑在柱子上。鬼卒们手拿锋利的尖刀，或挖它们的眼睛，或割舌头，或破腹掏心。惨叫声不绝于耳，听的我头皮发炸。\n\n再往前走，看见两间好大的屋子，里面分别关着许多赤身裸体的男女罪囚，它们个个骨瘦如柴，直嚷“饿！饿！”看到我走过来纷纷从铁栏杆后伸出手来，哀求道：“给点吃的吧！给点吃的吧！”我摸摸身上，什么也没带。阴差说：“它们就这样，不用管。”\n\n再往前走，看见一片望不到边的火海，火舌窜滚，热浪袭人。火海里很多罪囚在挣扎着，惨叫着，空气中弥漫着令人窒息的焦糊气味，惨状令人触目惊心。\n\n又往前走，看见地上立着两架刀山。每架刀山梯次横放着三十多把铡刀，刀刃向上，锋利无比。鬼卒挥舞着狼牙棒，逼迫罪囚上刀山。有个罪囚脚刚踩上铡刀，脚底立刻被割的鲜血喷涌，上了两三把刀就掉下去了。\n\n我实在看不下去了，要回去，阴差不答应，催我继续向前走。\n\n再往前走，看见一个挺深的大池子，直径有四米长，里面有一些光着身子的男女罪囚，被毒蛇、蝎子咬的直打滚，发出“妈呀！妈呀！”的惨叫声。\n\n再往前走，看见很多罪囚被鬼卒逼着喝粪汤。\n\n我说什么也不看了，执意要回去。阴差就把我带到一个阴森森的大殿里。大殿中央摆着一个类似古代官衙审案用的桌子。后面坐着一个头戴乌纱、身穿古代官服的官员，脸色黑不黑、蓝不蓝的，一部黑胡须飘挂在胸前。我认定此人就是阎王爷。左面站着一个须发皆白的老人，右面站着一个手执拂尘的童子。大殿两旁各站着一排阴差，手持兵器，头戴高帽，一身短打装束，很象古代官府里的衙役。\n\n殿里有个阴差让我跪下，我不跪。阎王爷问：“你犯了什么罪？”我说：“我没犯错误，我得回去。”阎王爷翻开一本簿子，看了几页，说：“你回去吧，回去后把在这里看到的情况告诉活着的人。”\n\n这以后我就什么也不知道了。突然醒来，发觉惊出一身大汗，身下的褥子都溻湿了。\n\n这件事我和家人以及一些老朋友讲过，他们很多人都深感震惊，由此相信了生死轮回、善恶有报的天理。在此，我愿意把自己的亲身经历再一次告诉世人，请大家引以为鉴，不要轻信无神论，多行善事，以免身后遭受地狱之苦。\n\n### **清明节奇异梦境的警示**\n\n（有删节）\n\n1999年清明节的清晨，在朦胧之中，我感到自己跟很多朋友、同学一起从地面上突然出现的一个洞往下走，不知有谁说这是往地狱去的洞口。我感到往下走的路全是螺旋的，而且黑黑的令人恐怖。好不容易到了底了，看到一扇很大的铁棂子的黑门，里面传来阵阵哀号，有男有女，有老人也有孩子，加上点点闪烁的鬼火，我感觉头皮发炸，催促同伴赶紧离开这个地方。\n\n于是我们来到了一个大殿上，大概就是传说中的阎王殿吧。我们还见到了阎王。因为整个梦境都弥漫在一种恐怖的昏暗中，所以看不清阎王长什么样，只是觉得阎王很威严，很公道，无论是谁，到了他那儿就得接受他最公正的判决。于是我的同学、朋友一个接一个的听阎王宣判。每一个人从出生开始，做的每一件好事和坏事在阎王那一本厚厚的册子里都有记载，哪怕是自己做的不可能让别人知道的事情阎王都知道。阎王就这样一件不落的品评，直说得这些人频频点头、心服口服，那就连平时最擅长伪装的人此时也无话可说。其中有一位是我的大学时代的班长，他是一个很油滑的人，在上学期间以耍小聪明出名。这人很善于伪装自己，当面一套，背后又一套，自以为做得天衣无缝，可是当阎王给他一一列举他所犯的大大小小的罪行，并以此给他量刑时，他一句话也说不出来了，只是一个劲的点头，表示心悦诚服的接受判决。\n\n等到审判完了，也没轮到我，我有点着急，就问阎王为什么不给我品评一下过失？阎王抬头看了我一眼，淡淡的说：“你现在是修炼的人，我暂时还管不了你。等你不修炼了，我再管你。”此时，我从睡梦中惊醒，浑身大汗淋漓！\n\n那个在我梦中被阎王宣判的班长，通过拉关系、走后门，毕业以后留校任教。后来曾主动策划并实施了对他所辖班级的多个学生修炼者的迫害。他曾逼迫一名学生在上学和修炼之间做出选择，并逼迫不放弃修炼的学生自己写退学申请，他还将一位女学生从宿舍的二层床上拽下来送去迫害，他还强迫学生家长领走孩子而扣押了学生的学籍档案和户口，致使这些学生痛失学业，在中国这个连大学毕业生都难找工作的现实社会里，生存得更加艰难。但他曾经的风光很快就遭到博士妻子背弃的厄运而取代，几年过去了，依旧孑然一身，身心衰惫。"
		},
		{
			"post_id": 5,
			"title": "时空隧道之谜",
			"date_published": 1488760712.385,
			"body": "时空隧道依然是世界未解之谜，有时候人或者飞机轮船突然消失了，若干年后又突然再现，奇怪的是人却没有衰老，这到底是怎么回事？\n\n* * *\n\n在我看来很简单，同时同地存在着另外的空间，里面的时间与我们人类的时间不一样。你恰好要在另外空间偶尔开放的时间点和入口处出现，才能进去。至于为什么有时候只让某些人进去，不让船只和其他人进去，可能是这些人命不该绝，所以另外空间的生命暂时收留了他们。\n\n### **遇仙人观棋烂柯**\n\n烂柯是一个著名的围棋典故，出自南朝梁任昉《述异记》。相传在西晋时期，有个姓王的樵夫到山中砍柴，在挑着砍来的两大捆柴踏上回家之路时，他突然闻到一股奇香。王樵夫不由得放下柴担和斧子，循香寻去，翻过一座山，他找到一棵巨大的桃树，香气正是那满树的桃花散发出来的。桃花树下，有两个老人正在下围棋。\n\n王樵夫见时辰还早，就蹲在棋盘边看起棋来。刚看了一会，突然有花瓣纷纷落下，王樵夫抬头一看，桃花已谢，取而代之的是满树青青的桃子。王樵夫再看看两位老人，白发银须、红光满面，在棋盘上杀得正起劲呢！王樵夫于是又低下头去看了起来。过了一会，王樵夫觉得肚子饿了，就站起身想回家，没想到抬头一看，满树的桃子已经长得拳头大、红艳艳的了。王樵夫忍不住摘了一个，边走边吃。\n\n回到自己放柴捆的地方，王樵夫意外地发现柴捆变成了枯灰，斧柄也已经朽烂，只剩下生满了锈的斧头。王樵夫大惊之下赶紧跑回家，进到村里却尽碰上些陌生的脸。一个壮汉对他说：“王樵夫是我祖上的老人，几辈子前上山打柴就没回来。”王樵夫这才恍然大悟，自己是碰上神仙了。后来，人们把王樵夫烂掉斧把的这座山唤作“烂柯山”，“柯”指的就是斧头的木把。如今，烂柯多被用来形容岁月流逝、人事变迁，也被用来直接指代围棋。\n\n### **航班飞了35年**\n\n1990年9 月9 日，在南美洲委内瑞拉的卡拉加机场的控制塔上，人们突然发现一架早已淘汰了的“道格拉斯”型客机飞临机场，而机场的雷达根本找不到这架飞机。机场人员说：“这里是委内瑞拉，你们是从何处而来？”飞行员听罢惊叫道：“天啊！我们是泛美航空公司914号班机，由纽约飞往佛罗里达州的，怎么会飞道你们这里，误差2000多公里？”接着他马上拿出飞行日记给机场人员看：该机是1955年7 月2 日起飞的，时隔了35年。机场人员吃惊地说：“这不可能，你们在编故事吧！”后经电传查证；914 号班机确实在1955年7 月2 日从纽约起飞，飞往佛罗里达，突然途中失踪，一直找不到，机上的50多名乘客全部都赔偿了死亡保险金。这些人回到美国家里真令他们的家人大吃一惊。孩子们和亲人都老了，而他们仍和当年一样年轻。美国警方和科学家们专门检查了这些乘客的身份证和身体，认为这不是闹剧，而是事实。\n\n### **泰坦尼克号船长**\n\n1991年8 月9 日，欧洲一个科学海洋考查船在冰岛西南387 公里处，发现一座冰山上坐着一位60多岁的男子，他穿着本世纪初的船长制服，静静地吸着烟斗，双目眺望着大海。但谁会想到，他就是80年前沉没在大西洋中的“泰坦尼克”号船长史密斯！\n\n史密斯船长被救上这艘科学考查船，立即被送往奥斯陆。在医院里，经著名的精神病心理学家喻兰特博士认真检查后，认为他生理和心理一切正常。科学考察船的负责人、著名海洋学家艾德兰博士和病理学家哈兰特博士在1991年8 月18日举行新闻发布会，向欧洲新闻界宣布：经英国海事机构的指纹和照片验证和航海记录表明，救起的这位老人确确实实是史密斯船长，他现在有140 多岁了。据海洋学家艾德兰博士说，在营救史密斯船长时，他拒绝援救、并称应与“泰坦尼克”号共存亡。这是一位船长应该做的。确实，在“泰坦尼克”号沉没时，史密斯船长在指挥营救，拒绝登上救生船并和“泰坦尼克”号一起沉没在大洋之中。史密斯船长一直认为“泰坦尼克”沉没是发生在昨天。此事如何解释呢？欧美的有关海事机构认为，史密斯船长是属于“穿越时光再现”的失踪人。\n\n美国物理学家斯内法克教授认为，在空间存在着许多一般人用眼睛看不到的、然而却客观存在的“时空隧道”，历史上神秘失踪的人、船、飞机等，实际上是进入了这个神秘的“时空隧道”。有的学者认为，“时空隧道”可能与宇宙中的“黑洞”有关。“黑洞”是人眼睛看不到的吸引力世界，然而却是客观存在的一种“时空隧道”。人一旦被吸入“黑洞”中，就什么知觉也没有了。当他回到光明世界时只能回想起被吸入以前的事，而对进入“黑洞”遨游无论多长时间，他都一概不知。\n\n有些学者反对这种假设，认为这不能说明问题。“泰坦尼克”号游轮和乘客同时沉没、消失，乘客们进入“时空隧道”，为什么游轮没有进入？如果游轮也同时进入，它应该和船长史密斯同时再出现。\n\n最近，美国著名科学家约翰。布凯里教授经过研究分析，对“时空隧道”提出了以下几点理论假说：1 、“时空隧道”是客观存在，是物质性的，它看不见，摸不着，对于我们人类生活的物质世界，它既关闭，又不绝对关闭——偶尔开放。2 、“时空隧道”和人类世界不是一个时间体系，进入另一套时间体系里，有可能回到遥远的过去，或进入未来，因为在“时空隧道”里，时间具有方向性和可逆性，它可以正转，也可倒转，还可以相对静止。3 、对于地球上物质世界，进入“时空隧道”，意味着神秘失踪；而从“时空隧道”中出来，又意味着神秘再现。由于“时空隧道”里时光可以相对静止，故而失踪几十年就像一天或半天一样。这一系列问题，正有待科学家们探索，来解开这自然之谜。"
		},
		{
			"post_id": 4,
			"title": "关于特朗普的两则神谕",
			"date_published": 1488614435.894,
			"body": "美国房地产商特朗普，在被主流媒体一致不看好的情况下，一骑绝尘，最终问鼎总统宝座，成为2016年度最大的黑天鹅事件。\n\n这里收集了关于特朗普的两则神谕，难道他真的是被神选中的那个人？\n\n* * *\n\n今年（2016年）4月，一位叫马克‧泰勒（Mark Taylor）的退休消防员对《真新闻》（TRUNEWS）说，他早在2011年就接到上帝的启示。当时他坐在电视前，电视上在放川普就考虑竞选总统接受采访。他忽然受到一种冲击，意识到：“我的天，我在听总统发言。”\n\n于是他赶紧跑到办公室把自己所感应到的信息写在纸上：“上帝的精神说：‘我已经选择了这个人，唐纳德‧川普。我要用这个人给美国重新带来荣誉、尊敬和复兴。美国将被重新尊为地球上最强大繁荣的国家。美元将前所未有的强大，再一次变成其它货币的判断标准’，上帝的精神说：‘敌人会震动发抖，惧怕这个我选中的人。他们甚至在他宣布参选的时候就震动发抖。那将如同给世界带来震惊。’敌人会问：‘我们现在该怎么办？这个人知道我们的花招和诡计。我们已经掠夺美国几十年了。我们如何阻止这件事。’上帝的精神说：‘哈！没有人能阻止我启动的事。’”\n\n泰勒说，上帝精神继续告诉他：“这个人的话就是炸弹，全世界和美国人都知道，敌人会惧怕，因为这个人无所畏惧……敌人会花费数十亿美元来保住他们的总统，但是这将如同把钱扔进马桶。让他们浪费去吧，这些钱被邪恶利用，但是下一次选举对我选定的人来说将是一个干净的选举。他们会对这个人说各种话，但是不会影响他……我会保护他。”\n\n川普2011年初曾表达参选意愿，但因漏风而黯然退选。泰勒于是把自己写下的预言雪藏起来。直到2015年，在川普宣布参选的前十天才又想起它，并决定公诸于世。他问上帝自己错过了什么，上帝说，没有，2012年他的臣民还没有准备好，要再经过4年奥巴马执政才能准备好。\n\n牧师耶利米·约翰逊(Jeremiah Johnson)，他现在28岁（2016年），这是去年（2015年）7月时写的。\n\n当耶利米写下这段内容的时候，他还对特朗普所知甚少：“几个星期之前，在我祷告的时候，神开始对我讲述特朗普在美国的命运。圣灵对我说：‘特朗普将成为我向美国人发声的号角，他所拥有的品质，今天在我的民中都难以寻觅。特朗普并不惧怕人，他也不会对欺骗和谎言无动于衷。我打算使用他，以前所未有的方式把美国的黑暗和扭曲暴露出来，但你也必须明白，他就像一头在瓷器店的公牛。许多人想摆脱他，因为他打破了这些人的平安、宁静的感觉，不过，你必须发现那些嘲弄背后的内容，发现我通过他说出的真理。我会使用我所给予他的财富来暴露问题，来启动对真理的探寻。正如我兴起居鲁士来完成我的目标和计划一样，我在2016年总统大选之前兴起特朗普来完成我的目标和计划。你必须仔细聆听那号角，因为他会拉响警报，许多人会因他的热忱和仁慈而得祝福。尽管许多人看到了他外在的骄傲和无礼，我给他一个父亲般的仁慈之心，对贫穷者、有需求者、外国人和陌生人施以援手。’”"
		},
		{
			"post_id": 3,
			"title": "遭雷劈死而复活",
			"date_published": 1488596439.87,
			"body": "1975年，美国的一个25岁的年轻人正在打电话时被雷劈死了，他的灵魂出窍，在天堂游历了一番，回到烧焦的身体中，奇迹般的死而复活。\n\n游历天堂的经历让他的心灵受到极大的震撼，从此洗心革面，并意外的拥有了读心术超能力。\n\n这个真实的故事被作家保罗•派瑞写成《死亡•奇迹•预言》，一举成为纽约时报排行榜畅销书。\n\n* * *\n\n[死亡奇迹预言.pdf](pdf/tale001.pdf)"
		},
		{
			"post_id": 2,
			"title": "关于这个博客",
			"date_published": 1488593621.399,
			"body": "本博客专注收集神迹故事，敬请关注。"
		}
	]
}