{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1565661379,
			"title": "Tor Image Posting",
			"body": "Is this fixed yet? It seems like the BO said it was fixed but I still cannot upload images on Tor, as they appear white in the thumbnail and will not load and open when I expand them and seeding them also does nothing with the percentage remaining at 0. I haven't tried zeronet in another browser but it seems that no one else is still having the problem. Is there a way around it without enabling fingerprints?",
			"added": 1565661378
		}
	],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1565661379_13Gu27WksygoMQzLpktTGzZTHumTN5pce1": [
			{
				"comment_id": 1,
				"body": "> [undisclosed](#comment_33_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK): Acidman worked all weekend on getting ZeroID properly implemented to return the boards basic functionality, and add a layer of insulation from spam attacks.  He has a day job, so important fixes such as TOR image posting might not get addressed until his next two days off.  The problem is still there, it's just that some anons are willing to run through another browser.  TOR + VPN with ZeroNet on a removable drive using say FireFox as the interface is about the best anyone has right now.  I haven't seen any workaround that wouldn't involve migration to Millchan Engine, or exposing html canvas in TOR.\n\nAh, I seem to recall someone stating it was fixed, my bad, thanks for the update then.",
				"added": 1565665949
			}
		],
		"1567301440_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU": [
			{
				"comment_id": 2,
				"body": "Shiet nigga, too toxic here mang. I finna be here not fo muh feelings to get hurt and shieeet mang.",
				"added": 1567356631
			}
		]
	},
	"comment_vote": {
		"27_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": 1,
		"33_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK": 1,
		"7_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH": 1,
		"393_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"482_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"1020_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"7_1LJKApYYKVaWk5d7EFbcvRnFyqe13SkFCw": 1
	}
}