{
	"title": "嘉谷种子",
	"description": "苟有恒，何必三更眠五更起",
	"links": "- [友情链接：要展示的请留言]",
	"next_post_id": 39,
	"demo": false,
	"modified": 1521723673,
	"post": [
		{
			"post_id": 38,
			"title": "从吃酒说起",
			"date_published": 1521722185.677,
			"body": "古典小说为何把饮酒说成吃酒而非喝酒？\n\n古代的酒由酒曲反复酿造，类似现在的女儿红或米酒。今天我们喝的白酒，他们称为”臭酒“，一般人不喝的。白酒流行，在清末明初军阀兴起的时候。\n\n李太白酒不离身，与友相逢要喝酒，与友离别要喝酒，人生得意要喝酒，人生失意也要喝酒。杜甫有诗云：”李白斗酒诗百篇。“\n\n斗酒多大量？以唐代度量衡换算，最少四斤。\n\n李白爱酒人尽皆知，又因为名字中带一个白字，容易让人误以为，他喝的是白酒。实则不然。李白所喝类似于今天的米酒。\n\n米酒的酒精度低，可以喝得多而慢醉。\n\n故而李白斗酒诗百篇，在醉倒前，乘着酒兴，诗意洋洋洒洒。\n\n米酒里边，酒和米参半，故说成吃酒，就不奇怪了。\n\n古代文人为何爱吃酒？\n\n文人追求雅兴，不太考虑吃饭问题。也因此文人容易穷困潦倒。\n\n经历过穷困的人，一定清楚一件事。\n\n穷困令人忧郁至极，而酒可以麻醉忧郁。\n\n借酒消愁，实则没有消掉忧愁，而是把忧愁暂时压下，酒醒过后，忧愁还在。\n\n不久前读到本书，叫《稀缺》。\n\n书里讲，贫穷俘获大脑，让穷人专注在摆脱贫穷这件事上。\n\n这个时代，人人在寻求专注，禅修冥想大行其道。\n\n苏珊·桑塔格有句名言：摄影是将景物装入框内，框入一些东西同时意味着排除其他。\n\n专注也是如此。\n\n当你专注贫穷一事，就容易对致富视而不见。\n\n人的心智存在带宽。\n\n当你忧心忡忡时，工作效率会降低。为什么？你忧心的事占去了部分带宽。\n\n作者最后给出结论：贫穷带来心智负担。这意味着，穷人更蠢。贫穷状态会削弱流体智力和执行力。\n\n酒能忘忧，让人从心智负担中解放出来，创造力或者说才情得以伸张。\n\n诗与酒是李白一生的主题。杜甫称之”酒中仙“，他也自称”酒剑仙“。人生结局也是“以饮酒过度，醉死于宣城”（《旧唐书》）。\n\n诗仙李白恣意汪洋的想象力，酒之功不可没。"
		},
		{
			"post_id": 37,
			"title": "关于生活中的人与物",
			"date_published": 1482293713.026,
			"body": "生活里的人与物，深究本质，也只是条件（因、棋子），组合变化，化为想要的结果。这结果也只是新的条件。故说人生无常。\n\n早在春秋时期老子就认为，贵贱、强弱、福祸、刚柔等等对立物都不是一成不变的，它们在一 定的条件下，就会向着相反的方向转化，在《道德经》提出 了“祸兮福之所倚，福兮祸所伏”的辩证思想。\n\n如果说人类真正进入文明阶段是以发明和使用文字为标志的话。文字的发明和使用之时,也就是成熟的概念思维产生和运行之时。\n\n就是说，与语言文字并生的概念思维，自人类进入文明阶段以来，就是人类所离不开的。例如“从概念出发”，不是从“事情本身”出发,虽然不断被批判。但 是，人们总是顽固地这样思维。所以，能作出新发现的人，在任何时代总是凤毛麟角。\n\n也许，从禅宗史上看“开悟”如何之难，可以帮助理解这个问题。从思维方式上看，禅宗所要破的执著， 就是概念思维在“念、相、住”上所表现的僵 化。即所谓要做到“无念、无相、无住”。这里的“三无”，与禅宗的宗旨：“教外别传,不立文 字,直指人心,见性成佛”，是完全一致的。所谓“教外别传，不立文字”，就是不诉之于语言文字，中止概念思维。\n\n【从事情本身出发，实事求是。就是摆脱概念思维，见相非相，即见如来。万事万物都只是条件，不断地流转，仅此而已。】"
		},
		{
			"post_id": 36,
			"title": "葡萄干和大便",
			"date_published": 1481378994.601,
			"body": "如果你把葡萄干和大便搅在一起，你得到的仍然是大便。这是芒格在互联网与科技带给社会好处与这些行业投机的恶果进行对比时说的话。"
		},
		{
			"post_id": 34,
			"title": "读Harari《未来简史》后的笔记",
			"date_published": 1481300696.062,
			"body": "朋友推荐了万维钢的七篇文章，关于《未来简史》的。读完后找来原书看，这本书对未来有很深入的思考，虽然不见得正确。学历史不是为了预测。未来有多种可能性，神人还是万物之网主导世界？我们不知道哪个是必然。了解历史，恰恰是让我们能多考虑一种可能性。\n\n把这些笔记贴在这里，有需要的朋友可以看看。13000字左右\n\n第一部分讲了历史的偶然。第二部分讲联合想象的影响。第三部分讲联合想象下的宗教。第四部分讲宗教下的人文主义。第五部分自由主义的危机。第六部分讲世界的三个趋势，第七部分讲技术人文主义和数据教\n问题：\n意识和自由意志的关系？【为什么说，人没有自由意志，但有意识】\n\n去人欲、存天理，阳明的良知学属不属于宗教？\n\n技术进步对人的认知和组织的影响？\n\n智能和意识，到底哪个更有价值？\n\n\nA Brief History of Tomorrow\n\n超越人类智慧的人工智能（西部世界）、主动基因改造技术，更高级的经济增长，会把人类变成什么样子？\n\n生物学的思想、现代科学对意识的了解、经济学、心理学、历史学等等，这本书知识密度极高，一盘东北大乱炖，让我们品尝现代世界的味道。\n\nHarari的观点：\n\n\t1. 推动社会变革的不是我们对真实现实的认识，而是我们头脑中虚构的现实，也就是宗教的力量。\n\t2. 人文主义就是现代的宗教。\n\t3. 科学和人文主义有个交易，使我们对人文主义的信念越来越强，而且要根据这个信念去改造世界和自己。\n\t4. 但是人文主义有个本质缺陷，会让这个故事在未来讲不下去，必须换个新故事。\n\n\n所以要理解这么几个概念，什么是人文主义，什么是宗教（人类群体基于虚构的故事连接）\n\n历史学家的作用绝不仅仅是让你有个更大的视角，而是让你更自由。（了解的一些习俗的起源，就不会陷入教条，事物都在发展之中，不要被已经发生的事情所束缚。）\n\n历史是一系列偶然事件的结构，所以千万不要历史教条主义。既然不是必然的，那就是可以改变的。\n\n智人所面对的饥荒、瘟疫、战争，因为科技、经济、政治进步现在已经解决了。（但作者好像忽略了贫富差距、阶级固化越来越严重，这中间本身含着暴乱因子。）\n\n未来简史的正标题叫Homo Deus，即神人。\n\n我们现在要从智人向神人演化，为此要做三件事。\n\n1、追求永生。死亡是个技术问题。\n\n2、追求幸福\n\n3、成神。首先是对人的基因改造，其次是让人和机器结合，最后也许就是纯机器——人工智能。\n\n有些事很难判断好坏。（无常性）\n【技术是在扩大阶层之间的差距，因为新技术的使用，有着极高的门槛】\n富人永生了，永远霸占财富和权力，穷人能干吗？\n\n幸福是什么？Harari认为，幸福是一系列生理反应，那最好的办法就是吃药。【现在有些人就是靠吃药提高注意力，或者毒品本身是幸福的来源，但这种幸福不持久，简单获得的东西都不持久，如果希望不付出些什么，就满足自己的欲望，和吸毒没什么两样。（原来我一直在吸毒，屈服于自己的欲望，满足于暂时的欢愉，长久的幸福必是在辛勤付出之后。谨记，一分耕耘，一分收获。有时候物质过于满足就等于0，书太多就一本也不会看，选择太多等于没有选择，少即是多。）知道，不等于做到。要多到，就要靠主体意识突破自我欲望。】\n\n如果真出现神人，他们会怎么对待智人。神人一定是从智人中分化出来的。【假使出现两拨人，一波是人工进化的神人，一波是自然进化的新人类，然后对决。】\n\nHarari说，有关人类行为的预测都有个悖论：你预测的越好，结果可能跟你说的越不一样。因为当事人相信你的预测就不这么干了。比如马克思预测无产阶级会起来反抗资产阶级，最终在发达国家建成社会主义——可资本家也读他的书，结果发达国家搞了八小时工作制和各种福利政策，革命危险解除了。\n\n学历史最好的理由，不是为了去预测未来，而是把你自己从过去解放出来，去想象不同的命运！\n\n【看到一个评论，不仅仅是学历史的作用，人类所做的一切几乎都是为了尽可能拥有选择的权利，挣扎着从不得不，走向我可以。自由是一种终极选择权（我却以为选择的权利在我们自身，自由就是自我主体意识的觉醒。不再被环境控制、不再被所谓的趋势所驱赶，自己做出选择。）】\n\n\n古希腊哲学家西塞罗名言：“只了解自己这一代的人永远是个孩子。”\n\n有些事情，有些观念，在一代乃至几代人看来天经地义。但是如果你有点历史眼光，能够从更大尺度去看，就会发现它以前并不是这样——那么将来也未必还是这样。\n\n人文主义的基础：人是第一可宝贵的。\n\n但在以前，基督教而言，神是第一可宝贵的，人是第二，万物之灵长。\n\n但随着进化论出现，灵魂说和进化论不兼容。随着人掌握的力量越来越大，根本不需要神的庇护。于是需要一个新的理论，说明自己比其他动物高级。\n\n以前课本里说，人之所以凌驾其他动物之上，是工具说和智力说。但Harari认为，有一个理由值得一提“只有人有意识”【意识和自由意志是不同的东西。】\n\n没人理解意识\n\n眼耳鼻舌身意，意识统摄五感，计算机就不会疼痛。\n\n我们作为人，每时每刻都在体验各种感觉、感情和欲望，各种情绪在大脑中稍纵即逝但是情绪的流动永不停止，这就是人的“心灵”，或者说“意识”。科学家不承认人有灵魂，但所有人都承认人有意识。意识是一种主观体验——愤怒、嫉妒、渴望、恐惧、焦虑。周围环境中的图像、声音、味道、触觉都会影响意识流动，从而改变行动。\n\n【什么掌控意识？潜意识吗，还是阿赖耶识，或者第八识如来藏。】\n\n人为什么要有意识？\n\n之前生物学家解释，是因为自我保护。但现在随着生物学家对人脑的信号传递和决策系统了解越多，不论过往记忆还是外部刺激，对大脑而言，都只是一些电信号和化学反应。整个过程和计算机没区别，为什么非得感受恐惧，这么一个主观体验？\n\n其实人体99%的活动都是根本没有主观体验，自动运行的。那我们为什么就不能像计算机一样生活，对任何局面任何行动都能以平常心对待，为什么非得增加一个“意识”？\n\n【人造人，没有意识，就没有情感。】\n\n也有人说，意识是一系列信号放在一起而“涌现”出来的东西，是“复杂系统的自组织”——Harari对此不屑一顾：金融市场崩溃才是复杂系统的自组织，可是华尔街的交易市场自己并没有一个“哎呀我遭遇金融危机了”的意识，是交易员们有这种意识。\n\n截止2016年，生物学家解释不了意识。我们完全可以把人就当成一台计算机——意识，只不过是这台计算机的一个额外副产品，也可以说是“精神污染”。\n\n这答案当然不能让人满意。我们整个道德和政治系统就是建立在人有意识这个基础之上——如果主观地痛苦感受只是精神污染，一切不过是电信号和化学反应，那酷刑和强奸能有什么大不了的？\n\n不论如何，我们得承认人有意识，而且意识很重要。\n\n事实上“人有意识”，被相当多的人当成“认识最可宝贵的”的理论依据。他们认为动物没有意识。但现在科学家有足够多的证据，表面所有的哺乳动物和鸟类，包括一部分爬行动物和鱼类，都是有感情的。你非要说动物没感情，一切行为都是机械化或者它们“装”出来的，那我也可以说你没感情，你也只不过是个通过了图灵测试的电脑人。\n\n所以讨论意识不能证明人的高贵，那么到底比动物强在哪里？\n\n虚构的力量\n\n如果说单个的人和哺乳动物比有什么特异之处，就是七万年前的一次基因突变，使得智人能想象一些根本不存在的东西。\n\n一只狗无法想象神的存在，它的脑子里只有客观现实，而人脑可以有主观现实。自己虚构故事来产生意义感。所谓的国家、法律、伦理，现代社会的基石，都是奠基于这种意义感之上。\n\n但是单个人的这个功能还不算厉害，真正厉害的，能让人群实现大规模的灵活合作的，不是个人想象出来的主观现实，而是所谓“互联主观（intersubjectivity）”——人幻想出来的虚构的东西，而且还能让人人都相信。【参看《人性中的善良天使》】\n\n上帝、国家、金钱、公司、价值观，这些都是我们想象出来的互联主观。比如说，去教堂结婚有什么意义？如果你的配偶、父母、牧师以及围观群众都相信教堂有意义，婚姻有意义，那你这么做就很有意义。这个意义是一种联合想象。\n\n联合想象会不停地发生改变。过去很多人相信上帝，后来就都不信了；今天我们相信自由和民主，可能再过一段时间，这两者都变成了可笑的东西。\n\n我们看南北朝鲜人种一样，环境相似，韩国人和朝鲜人的巨大差异就是因为他们生活在完全不同的想象之中。这些联合想象，至少在此时此刻还不能完全用生物学方法研究，这恰恰是历史学家的任务。（这个例子很好。文科生擅长对比论证，用反例。）\n\nHarari说，历史学家最关心的，就是在每一个时期，人们共同想象、虚构出来的故事是什么。而在此时此刻，我们不但有更强的联合想象，而且还要用这个虚构的意义去改造世界甚至改造自己，历史学就更重要了。\n\n\n活在虚构之中\n\n国家就是一个想象的共同体。\n\n国家里的每个人才是真实的东西。所谓荣辱与共，也只不过是说我们被这个虚构的概念影响而已。【一个国家强大，国民素质高，你出国才会有自信，不然别人会先入为主的以你国家背景评判你这个个体，当然这种评判的人也比较low。】\n\n是虚构的就不重要吗？\n\nHarari说，现在的情况是虚构的比真实的重要的多。\n\n虚构胜于真实\n\n所谓的企业文化和凝聚力，不都是虚构出来的意义感么。\n\n真正有权势的人类组织根本不在乎真相如何，他们在乎的是把虚构出来的信仰强加给每个人，并且利用这个信仰去改变真实的世界。\n\n比如金钱，一张纸钞本身的价值如何不重要，重要的每个人都承认这张纸的价值。【今天看到有人把域名打包成金融产品出售，很快销售17个亿，里边不是每个人都是傻子，因为有人相信，有人会相信这些东西的价值。买入卖出赚个差价。接盘侠多得是，就看如何忽悠。】\n\n学位证书也是虚构的，但你没有的话，就真得不好办。\n\n宗教也是。很多人考证，《圣经》中的内容很多是后人虚构的，基督教等于是在所有时间欺骗了所有人——但这又怎么样呢？【四书五经也很多是后人加上去的，但这又怎么样呢？照样是科举考试的教材，想做官就要读。】\n\n你有一个更真实的世界观就更强大吗？古希腊文明后来就被基督教文明所灭，希腊人最后也要去学习基督教。虚构的强大力量，不在于它距离真实有多近，而在于它能把更多的人有效地组织在一起，促进这些人的合作。以此来说，很多东西都可以成为宗教。\n\n人们一般认为只有相信超自然现象或者神，才算是宗教。Harari在书中给了一个更好的宗教定义。满足下面三个特点的，就是宗教：\n\n\t1. 它有一套号称不是人发明的，而且不能被人改变的道德法规（moral laws），要求人们毕勋遵守；\n\t2. 它给人们一个许诺：只要你遵从这套法规，就会有什么什么好处；\n\t3. 它的目的是为了巩固自己设想的社会秩序。\n\n中国古代儒家伦理下的社会，就是一个宗教。\n\n西方自由主义讲的人权，其实也是宗教。\n\n按这个定义，修行者反而不是宗教徒。宗教是个交易，要求教徒别问那么多为什么，接受社会秩序——你只要按我说的规则办，我给你许诺一个好处。可是修行者是天生的革命者，拒绝交易，非得问个为什么不可!\n\nHarari甚至引用一句禅宗的话，对真正的修行者来说，应该佛当杀佛，如果你是一个真正的修行者，遇到有人把佛学也变成一个宗教，并且规定了一系列严格纪律给你这么一个交易，那么你应该把佛也打破掉。\n\n佛陀是个修行者，从古代印度教脱离出来，自己悟出一番道理。\n\n修行本质上是孤独的。马丁路德和佛陀自己修行没问题，可是等到他们有了追随者，需要联合更多的人一起做事的话，就必须写下一点什么东西，比如说戒律和规章制度，以及自己对这个事业的理解——因为人总是喜欢确定性的答案。可是这样一来，他们写下的东西就是新的宗教规律，他们实际上就是创立了新的宗教。\n\n宗教其实很无奈。\n\n有人提出一个观点，干脆不要谈宗教，直接谈论道德。道德无非是一个原则——离苦得乐，就是人们总是希望最大化幸福，最小化苦难，如果从这个道德原则出发，剩下的事情就可以交给科学了。\n\nHarari说，这个根本行不通。什么叫幸福？根本没有科学定义。当你选择什么叫幸福的时候，你就是在选择一套道德体系，你就是在选择宗教。所以你想要维持大尺度的社会秩序，离开宗教、光靠科学是不可能的。【这里我觉得有问题，新儒家的去人欲存天理，就是一个只谈道德，不论宗教的过程。或者说阳明心学的良知说，符合这个观点。修心学，让良知自然流行，其他的交给科学。无善无恶心之体，心体本来显露，并不是在选择一套道德体系。】\n\nHarari说，当前最大的宗教就是人文主义。我们这个世界，恰恰是科学和人文主义交易的结果。科学一直在帮助人文主义扩大力量，但是从此刻开始，科学要敲打人文主义了。\n\n以地球人的视角而论，所谓现代，就是欧美发达国家的现代。即自由主义文化，人文主义精神。自由主义是人文主义的一个最大分支。理解了自由主义的来龙去脉，才能真正理解西方国家。【《源泉》讲的就是自由主义】\n\nHarari说，所谓现代性，其实是一个交易——人类放弃“神”赋予我们生活的意义，去交换科学的力量。信仰上帝，必须听从宗教的指引，没多大自由，但生活的意义感很强。信奉科学，不用遵从上帝的意志，代价是上帝不会给我们的生活以意义了。但我们可以自己找生活的意义。\n\n一个是追求经济增长，放到个人就是追求财富。但人生无常，这条追寻之路，充满痛苦。\n\nHarari说，人类在“上帝已死”这个时代真正的应对策略，是人文主义。\n\n听从你的内心\n\n人文主义，倡导我们崇拜人性，用人性取代过去宗教里神的位置，用人的体验，给外部世纪制造意义。【我可能潜移默化受到西方人文主义影响，追求体验，认为体验能带给我的生命意义，幸福感。这是我的观点。】\n\n人文主义说白了就是听从自己内心的声音。什么是好，什么是坏，以前有上帝说了算，现在是内心说了算。你感觉好就是好的，你感觉坏，就是坏的。【这不就是心学中的良知说，一切由良知决定。但良知是人的感情，与天理无关。】\n\n根据这个原则，同性恋当然没问题。\n\n人文主义时代做个有道德的人，千万别伤害别人的感情。\n\n对人文主义者而言：知识=体验*敏感度  \n\n这里的体验，即意识，就是我们的主观体验，你经历的各种感觉、感情、想法。\n\n敏感度有两层意思。1、不能光有经历而不重视体察你的体验。2、你必须允许这些体验来影响你甚至改造你。\n\n一个文明人，要善于体察各种细微的感觉，否则你就是个粗人。【所以说，活着就是修行，不断反观自己的意识体验，获获得新的感受】\n\nHarari说，“我们的一生之中，有时候我们伤害别人，或者被伤害；有时候我们同情别人，或者被同情。如果你去注意体会这些伤害、同情的感觉，你就会越来越敏感，那么这种体验对你来说就是一种很好的道德意知识。逐渐你就会分辨对错，成为更有智慧的人，这就是人生的旅程。”【这不就是致良知吗】\n\n人文主义的套路，通过体验获得智慧。小说、电影都是如此。\n\n所有人文主义者都认为“人的内心体验”是第一位的，一切道德应从这里出发。但内心的不同，其矛盾造成了几派不同的人文主义。\n\n\n\t1. 正统的人文主义，就是自由主义，认为应该赋予所有人自由表达的权利。【比如德国的难民潮，如何平衡难民和公民的权益呢？很难】\n\t2. 社会主义的人文主义认为，自由主义太过强调个人感情。\n\t3. 进化人文主义者认为，有些人就是比另一些人强\n\n最后胜出的是自由主义，Harari认为其胜出的关键因素是，技术进步。马克思不知道后世还会出现生物技术和信息技术，如果他活在今天，第一个要重点研究的东西，必是互联网。\n\n要明白技术进步对人类认知方式和组织方式改变的重要性。要想活在未来，就必须关注最前沿的技术。基因工程、脑神经科学、计算机算法、和人工智能。\n\n自由主义重视每个人的体验，基于三个假设：\n\n\t1. 我有一个不可分割的“自我”——所以英文才叫in-pidual。只要用心审视，就能发现自己内心深处真实的自我，我要倾听这个自我的声音。\n\t2. 这个真实的自我，是完全自由的——也就是说我有自由意志。\n\t3. 没有人比我自己更了解我自己，只有我才知道我想要什么。\n\n自由主义的危机就是，科学已经有了足够的证据，三个假设都是错的。（科学和自由主义的关系，就好像滴滴和出租车司机。前期滴滴帮着出租车司机赚钱，后面滴滴各种蚕食出租车司机的利益。因为滴滴的终极本身也是一种出行方式。就像科学本身是一种宗教，与自由主义的合作是暂时的。）\n\n自由意志是一个幻觉\n\n什么是自由意志？\n\n想要什么就去追求什么？这是纯机械化的过程，比如饿了吃饭。科学家说的自由意志，是人能不能“选择”自己的欲望。\n\n答案是不能。很多事要证明，人的欲望并不受意识控制，意识受到欲望控制。比如一项实验中，科学家给受试者一个开关，受试者可以随意选择开还是关。与此同时，科学家用功能性核磁共振，实时地观察受试者的大脑。结果发现，在受试者按下开关的几百毫秒甚至几秒前，他还没有意识到自己要怎么选择前。科学家看着大脑成像图，就已经知道他会怎么选。\n【个人思考下来的观点：欲望是一系列电化学反应。这个反应主导我们的行为，行为带来感受即意识。从这个角度说，人确实没有自由意志，只是被欲望控制着。但是大家每天上班，欲望并不想上班，人会有长远的目标，并且能克服困难实现它，这之间的驱动力是什么呢？更大的欲望吗？也就是把欲望分层。阳明强调首先要立志做圣人，就是先确立一个最大的欲望么，但这个欲望太过缥缈，并不能产生电化学反应，控制行动啊。\n\n还有一个，微信阅读读书积累时间换金币和排名机制显然是符合人的欲望的，但这样会让我把时间花费在一些不重要的书上，某些重要的书因为微信阅读上没有，我就不看。这影响了我的信息接收。现在我的主体意识认识到了这一点，于是会改变我的决策。这难道不是自由意志吗？当然也可以解释成，对信息的欲望胜过了对金币和排名的欲望。但这不正是自由意志在两种欲望之间做出选择吗？\n\n所以Harari的观点，并不是很赞同。或者需要分时间周期。】\n\n作者还有一个例子，科学家甚至能控制你想干什么。\n\n科学家在老鼠大脑中插入三个电极，然后可以遥控指挥。让它直行、爬梯子、绕着垃圾堆转圈，怎么都行，跟遥控玩具机器人一样。\n\n这里控制的其实是老鼠的意愿，老鼠自己并不会觉得自己受到控制【就像西部世界中的老鸨，她突破那个世界，觉得是自己的意志，并不承认是代码被改写。】\n\n人跟老鼠没有本质区别。以色列科学家在抑郁症患者大脑中植入一个芯片，就可以让患者快乐起来。有一次患者说怎么我这几天反而更抑郁了？科学家打开他的大脑一看，原来是芯片没电了。【这个例子我又不得不承认，自己在晚上或者中午一些时刻，莫名其妙浑身轻松，很快乐。但情况一点也没有改变。我不清楚哪里不同了。估计是一些信息刺激了电极反应，减轻了心灵压力。】\n\n人的意识就是各种想法、感觉和欲望的集合，每时每刻都有各种欲望在我们大脑升起又消灭。你的决策可能是各种不同欲望谈判的结果，但是到底有哪些欲望会出席这个谈判，根本控制不了。【这里从根源解释了佛家的诸法无我，我们的内心是各种欲望的因缘和合，缘起缘灭，根本不存在一个固定的自我。】\n\n但是科学家可以控制。美军研发了一种叫transcranial simulators的头盔，戴上这个头盔，可以让人集中注意力——就是说它能把你不想要的各种想法都去除，让你专注于一件事儿。实验表明，这个头盔确实有利于士兵战斗，而且还能促进学习。【好像要这样的头盔，这不就是对自己的升级吗。想起那部聪明药的电影（《永无止境》）。】\n\n你说的是哪个自我？\n\n自由主义假设我们的大脑中有一个“真正的自我”，发出一个，代表自我的真正声音。可是现在科学家非常确定，我们大脑中并不只有一个声音，我们的每种情绪都是一个声音，这些声音在大脑中不断争论。（这就是佛家说的诸法无我。）几年前有个动画片Inside out，说的就是这个意思。\n\n体验和叙事\n人脑的左右脑是各自为政的，中间有一个很厚的神经管连接，可以直接连接。一旦切断，就会发生可怕的事情。左半球有语言功能，侧重于逻辑；右半球侧重于形象思维。这发现把自我给切割了。\n\nHarari还提到另一种分割自我的方法：“体验自我（experiencing self）”和“叙事自我（narrating self）”。这其实是丹尼尔·卡尼曼在《思考快与慢》中讲过的。只不过把叙事自我称为“记忆自我（remembering self）”\n\n具体实验可以在《思考快与慢》中看到。\n\n叙事自我在自我评估一段经历的时候，对这段经历的长短没有感觉，而只在乎这段经历中感受最强烈的部分，和结尾的部分。这叫做“峰值-结尾规则”（peak-end rule）\n\nHarari说，我们平时的自我认同，大约就是这个“叙事自我”。叙事自我一直在讲故事。同样是挨饿，如果叙事自我说，这是为了下午的体检，我们就觉得没什么；如果叙事自我说这是为了斋月，我们就觉得比较艰苦；如果叙事自我说这是因为没钱买饭，我们就会觉得很悲惨。有时候叙事自我不得不讲一个不真实的故事，来让我们感觉自己生活得很有意义……或者至少觉得生活是逻辑自洽的。\n\n我们活在这个故事里，可是“体验自我”会有不同的感受。新年第一天，叙事自我觉得立个志，说此后每周去两次健身房！体验自我到时会很不乐意。（就像我现在，叙事自我讲了一个故事，我要做自由职业，从兴趣出发，做有价值的创造性工作。意义感Max。然后体验自我就不乐意了。因为你本身并不具备自由职业的素质，践行的时候，体验糟透了。再比如我现在矛盾于驾照。体验自我对那个事情非常不满，不停地拒绝，但叙事自我有给这件事营造了意义感，必须去做。就有了所谓的自我矛盾。）\n\n另一个例子是我们熟知的“沉没成本”。一个项目失败，叙事自我不愿意承认错误直接退出，逼着我继续加大投入逼着我继续加大投入，结果损失只会越来越大，最后受罪的是体验自我。（我的叙事自我给自己营造了自由的意义感。不断去追求，求而不得苦恼。遭罪的是体验自我。抑郁产生在体验自我上，之所以没表现出来，是因为叙事自我一直在努力的营造意义感。）\n\n(从科学的角度分析确实不存在自由意志。但是这正是修炼的意义，追求自我主体意识的觉悟。所谓明心见性。不在被这纷乱的欲望操纵，修炼出自由意志去把握自己的生命。这倒是反证了佛法的意义，修得一个真我。)\n\n过去，科学因为证明了上帝不靠谱，给了以人为本的自由主义发展机会。现在，科学又给了自由主义“会心一击”。【参考材料：除了几部电影，永无止境，头脑特工队，Martix（黑客帝国），还可以看看丹尼特《意识的解释》，斯坦福教授Robert Sapolsky的课、王东岳的递弱代偿理论、自私的基因】\n\n金刚经中说，“无我相、无人相、无众生相。”佛乃非人。自由意志非人，人无自由意志。人有八识，眼耳鼻舌身意阿赖耶识、末那识。\n\n\n\n\n\n自由主义者认为，没有谁比我更了解自己。\n\n但Harari说，从现在开始——实际上已经开始了——自由主义者说这一条也错了。计算机算法就比你更了解自己，为了“你自己的利益”，你应该让算法替你做决定。\n\n从现在来看，世界有三个趋势，对应着人的三种不同命运。\n\n\n\t1. 人工智能如此强大，人作为一个工作者的经济价值和军事价值没有了，那么政治经济系统就会认为人没有价值。\n\t2. 也许人类整体还是有价值的，但是每个人作为个体，是没有价值的。\n\t3. 也许有些个体还是有价值的，但他们经过了生物学升级改造的“超人”。\n\n\n无用的人\n自由主义兴起，是因为社会发展需要每一个人。如今人工智能取代人类在经济政治上的价值，人变得无用。\n\n工业革命带来了无产阶级，现在人工智能革命带来了——一个对经济和军事来说都没有用的阶层。(我好像就是希望自己对经济和军事没有，或者为何要对经济和军事有用呢？研究一些有趣的事，好玩的事，写写故事不是更好吗？）\n\n没有自主的人\n将决策权交给人工智能。以后我们最好的选择不是听叙事自我，而是听助手的。\n\n也许有一种人不受算法控制，就是控制算法的人（又见西部世界）\n\n神人\n\n也许世界上总有些精英是一直有用的。算法不能理解这些精英，也不知道他们有什么需求，这些人才是世界的主人，是站在算法系统背后，做最重要决策的人。\n\n普通人听算法，算法听他们的。\n\n但他们可能不是智人，而是神人——利用生物技术主动升级的人（有钱人的孩子，出生前通过基因检测，这就是主动升级。）\n\n二十一世纪正在酝酿新的宗教。\n\n目前能看到的，一个叫技术人文主义，一个叫数据教。\n\n【未来最重要的能力是创造力，创造力作为一种天赋，基因分布是随机的，谁家都可能出一个；可是创造力的表达，变成实际有用的技能，这种可能性并非均匀分布在所有人群中。神人们可能占大头。】\n\n升级成神人有什么副作用？\n\n我们对体验和心灵的见识非常有限。\n\n技术人文主义，虽然也认为体验宝贵，但他们关注的是神人的体验，也许是智人所无法体会的一种体验。技术人文主义就是前面所说进化人文主义的一个新版本。\n\nHarari又说，人的体验能升级，但是也能降级。他拿原始人作对比。原始人的嗅觉非常敏锐，甚至能觉察到恐惧的味道。古人，在一定程度上能控制自己的梦境，做一个清醒的梦，现在这个能力我们也没有。\n\n我们的智力是升级了，但是另外的感知能力实际上降级了。【这里也存在等价交换原则。】\n\n偶然看了两集《钢之炼金术师》，注意到等价交换这个原则，简直无处不在，一旦违背，总会有不好的事情发生。这大概就是自然的平衡吧。\n\n神人搞认知升级，主要着眼在对经济和政治有用的各种能力上，市场和经济系统要求他们做出这些升级的同时，也会要求他们把另外一些认知能力降级。\n\n我们已经知道人没有自由意志，不能选择欲望，各种欲望此起彼伏，我们的每一个决定都是不同欲望交战妥协的结果。比如我对公司老板不满，有强烈的反抗欲望，但同时又要养家糊口，也有忍辱负重待下去的欲望。面对这种情况，自由主义要求我深入挖掘自己的内心，问问自己到底想要什么。\n\n而神人的一个升级就是把不必要的欲望借助技术手段去掉。这样真的好吗。没人复杂的欲望，自然可以专注于一个目标，比如赚钱，获取权利。\n\nHarari说，技术人文主义在者这条路走到最后将会无所适从，他们会再次面临意义危机。\n\n他比较看好，数据教。\n\n假设真有了一个万物之网，初期他帮我们活得更健康，做出更好的决定。（跑步群里每个人都带着智能手表采集数据），但随着他的数据完善，它将成为世上第一可宝贵的东西，比人更宝贵。这不就是新的宗教吗?\n\n宗教得有价值观，数据主义的价值观就是信息要流动。不能禁锢信息。\n\n宗教得有戒律。其戒律是一 、最大化自己的信息流。二、把更多的东西跟万物之网相连。\n\n数据主义对体验的看法，就是必须分享到网上才有价值。\n\n宗教得有许诺，数据主义的许诺就是，如果你允许信息自由流动，让万物之网越来越完善，他将造福每一个人。\n\n全书结束。要记住一个道理，学历史不是为了预测。未来有多种可能性，神人还是万物之网主导世界？我们不知道哪个是必然。了解历史，恰恰是让我们能多考虑一种可能性。【我认为大数据更贴合现实，但那个时候，人还有自由可言吗？无论哪一种都不是我想要的未来。】\n\n全书结尾，赫拉利邀请我们继续关注三个大问题。这三个问题涉及到全书基本假设，也许将来科学进步，会有不同答案：\n\n\t1. 生物真的只是一堆算法吗？生命真的只是数据处理吗？\n\t2. 智能和意识，到底哪个更有价值？\n\t3. 如果那些没有意识但是有高度智能的算法比我们自己更了解我们，社会、政治和日常生活将是什么样的？\n\n\n万维钢在最后建议。假使智人真得只是一台计算机。那么结论就是人生根本没有真实的意义。一切都是幻想出来的。但幻想正是智人的优势所在。他建议我们继续生活在虚构之中。\n我会继续维护各种我认为有价值的想象共同体。\n我会继续增加我的体验，提高敏感度。\n我会继续追问我的内心到底想要什么。\n\n但是，因为我知道这些都是虚构的，所以，\n如果某个想象共同体要求我牺牲自己或者别人的生命去维护它，我不干。\n在我经历事情，增加体验的时候，我知道我对这件事的解读，只是一个主观看法，只是我的叙事自我讲了一个方便的故事。我不应该执着于这个看法。\n当面临重大选择的时候，我会告诫自己，现在内心深处最强大的那个声音，可能它选的是错的。\n\n【谈谈看完这七篇文章的感想吧，书还没看，英文版需要慢慢啃。诸行无常、诸法无我、诸漏皆苦、寂静涅槃。原先我以为最可贵的是自己的内心，但现在发现内心也不过是各种欲望情绪的碰撞，根本没有一个自我的东西存在，法无自性。虽然如此，却有一种豁然开朗的自由感。这才是最大的自由。心学与佛学我会花更大的力气专研，生活的意义感在这里寻找。应对未来，最可把握的，是自己的创造力。作设计或者写作。是最好的方向。另外，也更好的理解了见路不走的含义，最容易看到的实现目标的方法都是错的，路在更远处。比如想赚钱，然后冲着最热门的行业，最赚钱的门道去了，这只会南辕北辙。想要赚钱，就先提高帮助别人的能力，无论是帮助别人活得更好，帮助别人赚钱，帮助别人实现他们虚构的意义感。或者帮助别人虚构意义感，并实现它。】\n\n\n\n\n\n绝大部分CEO相信技术将淘汰人类\n\n人工智能、机器人技术和其它新兴技术将重塑我们所知的世界。根据管理咨询公司 Korn Ferry 的一项研究，绝大部分 CEO 在思考未来业务的时候认为技术的价值高于人类。Korn Ferry调查了800名商界领袖，44%的CEO相信机器人、自动化和AI技术将重塑未来的许多工作场所，人类在很大程度上将变得多余。Korn Ferry全球董事总经理Jean-Marc Laouchez认为有形性偏差（tangibility bias）可以解释为什么如此多的CEO采用这一受争议的想法，面临不确定性时CEO们在思考、规划和执行时将可以看到、触摸和测量的有形性如技术工具作为优先考虑的事。\n\n\n\n人工智能（AI）是人类历史上一场非常重要的革命，在生物学上也是一场非常重要的革命，会影响我们的生命和地球。\n\n\n人工智能，将让很多人面临被淘汰的危局？\n\n当然，有些人也会觉得有一些可怕，因为可能成百上万的医生就这样没有工作了。但是同样的原理，在各个行业可能都会有这样的影响，它可能会去取代人类的工作。一个很有名的研究，是预计在二三十年内的人类经济当中，15%的就业机会都会被人工智能取代，当然也会有新的就业工作和就业岗位产生。\n\n两百年前，我们一直都在担心说机器会不会让很多人失业，但是这并没有实现得那么快，因为它虽然带走了一部分工作，但是同时这个过程当中又会有新的工作产生来填补这个空白。\n\n因此，这跟我们过去的几次革命是不一样的。人类有两种技能：有体力，也有所谓的脑力，就是感知上的技能。在过去两百年当中，机器人可能在体力上的工作会做得比人类好，可能也取代了大部分这个领域的工作，所以人类将会开始去做更多需要脑力的工作了。\n\n今天全美只有2%的人从事农业，大部分人其实在服务业，这些是需要有认知能力的人类参与的，接下来 AI 会怎么样？也许这是人类历史上首次机器比人类更好。我不知道我们是否发明出这两者以外的第三种智能，即便有，我相信很多新的工作，我们人类还是会比人工智能做的更好，但问题就是我们怎么样让我们自己变得更好，去适应这个不断变化的环境？\n\n历史上，大多数的时间，我们的生活主要分成两个部分：\n\n- 第一个部分就是学习各种技能和能力；\n\n- 第二部分是在履行、在工作，当然也同时是在学习，最主要在工作，并运用之前所学到的知识。\n\n但是有些知识技能可能在 21 世纪不一定适用了，现在小朋友学到的东西，到了他们四五十岁的时候可能就没有用了，所以他们得去学习新的东西提升自己，对于这些青少年来说，他们一直在学习，到了 60 岁的时候好象这一点就比较难了。因为他们已经有了一个先前的自我认知，是他们花了很多的时间和经历去学习的。特别当你五六十岁的时候，如果人工智能替代了你的工作，要重新去找工作是非常难的。\n\n意识比智能更重要，不管是人类，还是人工智能【自我主体意识，没有这个意识，人就是一台被计算机操纵的算法。】\n\n我们现在就要去面对这个问题了。这关系到我们现在该让我们的小朋友学什么，以免他们现在学了之后，可能到了 40 岁之后就没有用了。我觉得可能最好的办法就是在情商方面的一些培养，要让他们知道，得一直进步和学习，但是这个东西怎么去教就很难了，怎么样教出那种适应变化能力、不断充实自己的人，这个很难，但非常重要，我们要教孩子这一点。在21世纪，这一点对于我们来说非常重要的。\n\n所以，接下来21世纪有一个重大的问题，也是人工智能带来很多所谓无用的人群，这些人该怎么办？有些人提出了很多解决方案，但我们要强调的技术不是重点，同一个技术可能会导致截然不同的社会形态，比如说工业革命，它就创造了很多城市的工人阶层。\n\n这一个时代的技术，比如生物科技、人工智能，它们并不决定了未来，我们的未来是有很多可能性的。但是如果我们认真考虑，其实不光是从技术层面，还得去思考它社会和政治方面的影响。在这个新技术的背景下，我们想要变成一个什么样的社会？\n\n我想要回到一个大的环境，就是人工智能到底能做什么？\n\n它不仅对我们人类社会有影响，同时可能会对整个生命的进化也会有影响。我们今天可能要把智能和感知（感觉的能力，痛感、幸福感、爱或者仇恨）分开。\n\n在科幻小说，电影、书籍里，很多人把智能和感知混在一起了。当人工智能发展到一定阶段的时候，人们还是有这种感知能力的，因为这两个东西一定得共存的。当我们讲到人类或者哺乳动物时，这两个东西是共同发展的，但是对于哺乳动物来说，他们一直是通过感知的能力发展的，他们解决问题的方式主要还是通过他们的感觉和感知的本能。\n\n但这不是唯一的可能性方式。比如说树，树很聪明，但没有感知能力。电脑从这个角度来说，它可能比起树更像哺乳动物。计算机没有感知能力，但是可能很快就会培养起这方面的能力。在 60 年代，可以看到计算机的智能有很大的变化，但是在感知方面并没有。它们没有感知的能力，没有感觉的能力，也没有情绪，即便是最好的计算机、最好的 AI 技术，也是无法让它们拥有感知能力的。\n\n所以，我们所说的感知能力是和智能是分开的概念，计算机正在往哺乳动物这个方向发展，往着超智能的方向发展。计算机和哺乳动物在不同的轨道，计算机所在的这个轨道，是没有感知能力的。在未来的 50 年内，我们会发现有一些超智能的实体，可能比人类更加智能，可能也完全没有意识，这会让我们想到一个非常吓人的情景，世界将会变成全智能，但却没有意识。\n\n总结来说：我们看一下 AI 未来几十年的发展，我们要知道人工智能崛起能带来的政治、经济意义，还有带来的不同社会政治体系。我们不仅仅要意识到智能，也要意识到意识，要花尽可能多的精力去发展AI的意识。如果把这两个作对比，意识其实比智能更重要。\n"
		},
		{
			"post_id": 33,
			"title": "如何写好一份读书报告",
			"date_published": 1480743640.299,
			"body": "\n\t1. 最关键地，搞明白这部著作整体或者某个章节围绕的核心问题或观点是什么，以及作者产生这一思考的背景来源。\n\t2. “问题意识”，是指这个观点是在怎样的一群针对同一个问题但又相互对立或矛盾的不同观点中提出来的。我们在找核心观点的同时要去找它所回应的根本问题，和针对这个根本问题所能提出的不同观点。（问题意识可能来自学术传统，也可能来自生活。）\n\t3. 针对这些问题以及回应，作者动用了哪些论据去论证的。这是最考验水平的地方。因为论据有可能是事实、名家观点、逻辑推论、甚至是自己的某种价值观点。论据之间还有相对大小，尤其当举出的论据是某个观点时，它下面还会悬挂很多更小的论据来证明其合理性。\n\t4. 【按照写作的逻辑结构概括 】总的来说，最完美的概括就是将所有论据抽取到原子级别，并且通过金字塔结构把书的内容一层一层重新还原出来。金字塔的顶端就是全书的终极问题或观点，第二层就是问题意识，之后各层就是各级论据的抽取，直到最后一层原子式论据。这对初学者来说肯定是困难的，因为正常阅读是一个从序言到末尾的线性过程，很多人会交上来读书笔记式的读书报告，就是因为他们的概括方式是按照阅读的先后顺序而非写作的逻辑结构。分析每一级结构都要带有目的，时刻牢记每一部分的下一级必然为其上一级的观点而服务，只有这样反复训练才可以梳理清楚。\n\n"
		},
		{
			"post_id": 32,
			"title": "见路不走",
			"date_published": 1480743429.86,
			"body": "在真实生活中，虽然有些问题的严重性可能维持在某一个程度，但是许多问题如果未经处理或处理不当，非但维持不了多久，而且容易趋于恶化——尤其当错误的解决方案一再被使用时。\n\n这个时候，从结构上看，情况并无多大变化，或仍维持原状，但是问题的困难度和其所导致的痛苦却日益增加。（我毕业之后对于从业的迷茫就是这样。第一次辞职之后打算好好来，但是到了6月在家赋闲半年，迫于压力，重新来到上海工作，但这并非是正确的解决之道，从而使现在的情况变得更糟。所以学习程序提高工资也绝不是解决之道，这只是在同一个系统中寻求改变，虽然层次比现在好些，但只是在持续加强同一行动，完了问题还是存在，而且更加糟糕。）\n\n叶子农说他花了两年时间学会两个字：出离，一年一个字。就是这个道理。\n\n见路不走。因为路是在自己的系统之内。通往解决之道，在彼岸，需筑桥。见路就走，便是无法跳出当下维度。\n\n在公众号《宇宙西边》看到这么一句话，有些不符合逻辑的事物，其价值正在于它的不稳定性可以引出金子。当你发现它时，千万别杀了这只下金蛋的鸡。\n"
		},
		{
			"post_id": 31,
			"title": "如何写出简洁有力的文章？",
			"date_published": 1474990156.005,
			"body": "先写，再删。\n\n（这篇文原本有一千字。）"
		},
		{
			"post_id": 30,
			"title": "关于拖延症",
			"date_published": 1474990079.86,
			"body": "拖延的坏处？\n\n\t1. 浪费时间\n\t2. 消耗精神能量\n\n如何应对拖延？\n先让自己忙起来。要是没有忙的事情，先做两件事：\n\n\t1. 第一是想到什么马上做，一刻也别拖延。比如应对拖延写作，告诉自己先写两分钟，只要写起来，就会写下去。先降低开始写的心理焦虑。\n\t2. 第二是把你的大计划 先分解成许多可以马上去做的小任务。\n\n归根结底，先迈出第一步。\n\n这世上只有一种成功，今天你干了吗？\n"
		},
		{
			"post_id": 29,
			"title": "时间管理",
			"date_published": 1474990005.644,
			"body": "什么是时间管理\n让时间跟着你的脚步走！\n\n时间的特性\n只会消失，永远不够，\n目前只能用管理达到相对增加的效果\n\n时间管理技巧之一——掌握事件空间\n1. 事件空间：\n   轻重缓急的相对坐标关系\n2. 以小换大的掌握方式：\n   每天利用10分钟换取10小时的空间\n\n时间管理技巧之二——协调人际磁场\n社会的时间\n\n时间管理技巧之三——超越自我感受\n1. 时间只是一种避免抽象所产生的符号；真正的障碍是你自己的感觉。\n2. 集中目标，超越感受，也就是心无旁物。\n\n习   惯\n管理的终结是习惯！\n"
		},
		{
			"post_id": 28,
			"title": "耶鲁如何培养学生",
			"date_published": 1474989860.555,
			"body": "大学之道在于树人。\n\n学生应该成为什么样的人？\n\n\n\t1. 警惕任何简单化的陈述，特别是那些做法：夸大、扭曲、忽略关键事实，以煽起你的恐惧、愤怒和厌恶情绪\n\t2. 如果这类陈述与你的既有看法特别吻合，就要更加警惕。\n\t3. 静虑深密，保持怀疑精神，培养批判思维。\n\n\n这其实就是见路不走的道理。《天幕红尘》中，方迪答辩时说过一番话：\n我们在教室里学习了很多方法和技巧，正如老师反复所讲的，是引导、启发我们的思维，培养我们的独立思考能力，而不是让我们去照本宣科、生搬硬套，其本质，就是培养我们见路不走的能力。\n\n方迪说：“过去我是以两极判断事物的，非好即坏、非对即错、非此即彼，这样的思维很狭隘，事实上很多事物并不是以简单的对错就可以判断的，是属于条件的可能与否。任何事物，从成因到结果都是有规律的，什么条件产生什么结果，什么结果需要什么条件，这是科学。如果符合一个好听的概念比符合实际重要，对于企业就很危险，就会脱离实际。有一个很中国化的提法，叫解放思想，跟老师讲的‘创新’基本是一个意思，都是主张挣脱模式思维的束缚，用实事求是的、辨别的、证明的科学思维去认识事物。所谓‘决策’，是指具有方向性意义的重要决定，正确的决策是企业得以生存和发展的根本，而‘见路不走’就是企业决策的法则，不唯经验、教条，不唯标签、模式，只以企业的根本利益为目的，遵循因果律，走条件的可能。只有这样，企业才可能具有顽强的生命力。\n\n\n这段陈述和保罗·罗莫批判宏观经济学的现状一样。（参见经济学）\n\n过于依赖抽象的数理模型。数学用来建模，节省口水，但模型输出的结果取决于输入。就是条件。\n\n布尔丁的名言：“数学是好仆人，却是坏主人。”经济学家当然不应滥用数学方法。但当我们对于真实过程缺乏体验时，我们倾向于以更抽象的模型弥补体验之不足。极而言之，世界的本质是数。在另一极端，世界就是表象，它没有本质可言。\n\n叶子农把红豆、绿豆、黄豆平铺在桌上，让他把同颜色连出字母。\n\n布兰迪说：“所有的，而且如果密度够大，可以连出任何文字和图形，不管是单色的还是混色的，都可以。叶子农说：“而且不管你连出什么，都是真实的、有根据的。”\n布兰迪说：“是的，但是这能说明什么呢？叶子农用手指沿那堆豆子画了一个圈，说：“这是个‘场’的世界，有多少立场就有多少观点、主义。众生是立场的、利益的、好恶的，众生只相信自己愿意相信的东酉，出离立场的观点在立场的圈里是没地方立足的，因为没有‘场’可以让你立。\n\n布兰迪点点头，看着那堆豆于说：“是的，不管连出什么都是真买的、有根据的。出离立场的观点，无非是指公正、客观，但是哪个立场不认为自己是公正、客观的呢？那就不会有结论了，最多就是立场之间的交换看法。\n\n叶子农到卫生间摘下挂在墙上的镜子，回来将镜子竖在豆子旁边，说：“它就是，它照到什么是什么，它没立场，没好恶。其实‘客观’也是一‘场’，也未必是真相，客观只表示没有利害关系，不表示没有好恶，也不表示有如实观照的能力。布兰迪质问道：“凭什么你就是镜子，别人就是立场？叶子农把镜子放到一边，说：“只要是人就不可能是镜子，因果律是镜子，辨别、证明的逻辑和实践是镜子。其实真理也不‘是’，‘是’的就不叫真理了，叫定律。出离立场不一定是真理，但一定是不被立场接受的，没受众就没钱赚，这就是硬道理。这种秃头上的虱子明摆的事，瞄一眼心里有个数就行了。\n\n备注：世界没有本质可言。唯一不变的是变化本身。所以佛家说，法无自性，万事万物都是因缘和合的结果。\n\n佛学的若干概念\n\n萨洛维对毕业生也讲了三点。\n\n\t1. 无论何时何地，要充分表达你的看法，无论它是什么。充分表达看法，意味着不为从众而从众，也不要为了寻找认同和安全感而与看法相似的人抱团取暖。如果你的看法确实与众不同，一定把它说出来，说清楚，这是你的权力，也是社会责任。\n\t2. 与此相互为镜像，你得仔细倾听别人的声音，特别是那些与你不同的声音。萨洛维提出一个很有意思的看法，如果你要批评别人的看法，那么你得批评这个看法的最合理版本，而这一点，你不仔细倾听是做不到的。 著名认知科学家丹尼尔-丹尼特也有类似看法：无论你要批评谁的观点，你要批评观点中最棒的10%。此外，批评之前，你要把他的观点表达的比他本人更完整周到。萨洛维还说，除倾听对方说什么之外，要付出更多努力，去了解他为什么这样说，理解其背后的个人经历和利益所在，而不能仅限于其观点的智识内涵。\n\t3. 要找寻共识。如果你既全力表达自己，也仔细倾听他人，那么寻找共识就不是放弃原则，因为没有哪个社会经得起长时间撕裂，要在多难之间，为每个人都有份的社会创造性地寻找中庸之道。寻找共识的路上永远会有不同看法在对峙，但不要卡在对峙上。\n\n\n这三点很真诚。第一点，见路不走，不为一样而一样，也不为不一样而不一样。不然就是事于道。第二点，众生是立场的、利益的、好恶的，众生只相信自己愿意相信的东酉。这是人性的缺陷。第三点，寻找共识，就要跳的一个更高的维度，如实观照。\n\n寻找简单之道，但能理解复杂性。\n\n这里留下另一篇文章中的三个问题。\n\n\t1. 全球化确实是在逆转中吗？\n\t2. 如果是，是因为全球化这件事本身就难以持续？\n\t3. 还是说全球化可行，但被谁在什么地方搞砸了。\n\n\n思路：全球化其实就是技术革命带来的经济全球化。美国的金融危机会席卷全球。某种意义上说，这就是共产主义。社会经济圈不断扩大。可以参看马克思共产主义的条件。\n"
		},
		{
			"post_id": 27,
			"title": "妄语",
			"date_published": 1472278229.576,
			"body": "这世上原来就没有什么神话，所谓的神话，不过是常人的思维所不易理解的平常事。\n"
		},
		{
			"post_id": 26,
			"title": "丁元英的呐喊与沉思 ——浅说《天道》的思想意义及其他\n",
			"date_published": 1472277355.474,
			"body": "本文作者：郭政男\n电视剧《天道》取名意境高远，剧中基督、佛、道之警句如缕串珠可谓精深难测，该剧的思想意义仁者见仁、智者见智，更可谓莫衷一是。看完二十四集回头梳理：从芮小丹投向丁元英心灵与肉体的爱恋到丁元英为红颜知己创造神话，从芮小丹悲壮之死到丁元英在林雨峰的枪口面前镇定自如，每一位观众都会感到心灵的震撼；从格律诗公司没有花篮和庆典的开业到与乐圣公司对簿公堂，从冯世杰、叶晓明、刘冰退股到刘冰跳楼自杀，自然引起我们对杀富济贫、公平正义、道德价值等观念的思索；从芮小丹审讯王明阳时对天堂、地狱、圣经、窄门的心灵对峙到丁元英与智玄大师对真经、法门、悟道、修行的对流，特别是“神即到，道法自然，如来”一句贯穿全剧，我们会陷入对宇宙、自然、社会、人生的沉思。丁元英面对智玄大师说：“晚辈无意评说道法，只在已经缘起的事情顺水推舟，借英雄好汉的嗓子喊上两声，至少不违天道朝纲”，丁元英喊的是什么？该剧的思想意义何在？这不是一个容易说明白的题目，本文不揣浅陋，略说一二。\n　　　　　　　　　一\n　　丁元英呐喊的基音是天道，因此，首先要了解对天道的一般性阐释。丁用两句话阐释天道：“天是道，是事物规律和自然法则”，“神即道，道法自然，如来”，这两句话包括唯物主义和唯心主义两个方面，是丁元英的思想、理智的概括。\n　　何为“道”？《圣经．约翰福音》说：“太初有道，道与神同在，道就是神”；《老子》：“有物混成，先天地生．．．．．．可以为天下母。吾不知其名，字之曰道”，这是我国古代唯心主义所谓的“道即宇宙的精神的本源”；我国古代唯物主义用“道”指事物的普遍规律。何谓“神”？神是宗教及神话中所指的物质世界的、超自然的、具有人格和意识的存在，基督教指上帝（天主）包括圣父、圣子、圣灵三位一体的三个位格。何谓“道法自然”？语出：《老子》“人法地、地法天、天法道、道法自然”，是我国道家哲学思想的精华，意指道是效法自然而非人为。何谓“如来”？如来是释迦牟尼的十种称号之一，“如来”即从如实之道而来、开示真理的人，通常是佛的自称。\n　　何谓“天道”？“天道”是中国哲学术语，原指日月星辰等天体运行现象和过程，唯心主义者认为天体运行是神的意志的体现，如《书：汤浩》：“天道福善祸淫，降灾与夏”；唯物主义者则认为天体运行是一种不体现任何意志的自然现象，如王充《论衡．遣告》：“夫天道，自然也，无为”。　　\n　　由上列解释，“神即道，道法自然，如来”把基督、道、佛三教融合到一起，它阐释的“天道”包涵两方面内容：一方面“天道”是指事物的发展变化是不以人的意志为转移的客观规律，这是唯物主义的；另一方面“天道”是指事物的发展变化是神的意志，这是唯心主义的。唯物与唯心的结合就是二元论。我认为不必深究唯物、唯心、二元论的是非，用天道的两方面意义来理解丁元英的呐喊所折射的对中国文化的思考及丁元英人物形象的典型性是顺理成章的。\n　　　　　　　　　二\n　　强势文化才能拯救贫穷落后，这就是天道。丁元英对强势文化的呼喊，就像当年鲁迅先生给自己的小说取名《呐喊》一样，旨在唤醒国人的觉悟。\n　　丁说：“透视社会依次为三个层面：技术、制度和文化，小到一个人，大到一个国家，一个民族，任何一种命运归根到底都是那种文化属性的产物，强势文化造就强者，弱势文化造就弱者，这是规律，也可以理解为天道，不以人的意志为转移”；“强势文化就是遵循事物规律的文化，弱势文化就是依赖强者的道德期望破格获取的文化”；“中国为什么穷，穷就穷在幼稚的思维，穷在期望救主、期望救恩的文化上，这是一个渗透到民族骨子里的价值判断体系，太可怕了”。\n　　王庙村就是一个典型，这个贫困县里的贫困村，街道狭窄、房屋陈旧、百姓落后，冯世杰说：“媳妇都是从人贩子手中买来的，连四元钱的水费交不起”。世代生活在如此贫困落后环境中的农民，他们都很虔诚的到基督教堂听布道，却不靠自己的双手改变生存状态；他们靠父母、靠朋友、靠上帝、靠皇恩，就是不靠自己来改变命运，这就是中国传统文化影响的结果，这就是几千年中国弱势文化的写照。丁的“杀富济贫”向这些人们呼喊：上帝只拯救那些自己救自己的人！无论“杀富济贫”这种开采市场资源策略的利弊如何，但最终王庙村的农民靠自己的双手、吃大苦耐大劳与贫穷告别。丁又说：“如果一个民族的文化从骨子里就是弱势文化属性，怎么可能去承载强势文化的政治、经济？衡量一种文化属性不是看他积淀的时间长短，而是看他与客观规律的距离。五千年的文化是光辉的，是灿烂的，这个没有问题。但是传统和习俗得过过客观规律的筛子”。中国是文明古国，几千年的文化为世界文明做出了贡献，但在近代工业革命的浪潮中落后了，特别是二战后，西方的经济、科技突飞猛进，我们跟在后面举步维艰；改革开放迎来曙光，技术进步了，制度改良了，但几千年弱势文化的根扎得太深，靠恩典吃饭、凑付过日子的思想绵延太长。因此，诸多现象还是弱势文化的反映：嘴上要民主，给你民主也不会用，看着人家议会打仗直摇头；上面政策不对、做法不好，别人能接受咱也不作声；下岗心里难受，领上一袋面一瓶油愁云就没了；碰上不公或骗子，忍了最好，讨个说法摆不平还得忍。老祖宗留下的宝贝大部分是孔孟文化，中国老百姓脑里装着“君臣父子”、“仁义道德”，面朝黄土背朝天几千年。但仁人志士自古有之，鲁迅是现代撞击弱势文化的旗手，孙中山赶跑了皇帝，从此，中国文化属性有变化了，这是东西文化交流的缘故。现在，到西方留学、参观、旅游者，回来后都说外国好，岂不知除了文化差异我们绝不差，这个差异是在哲学、政治、经济领域强弱文化的反映不同。《天道》借丁元英之口，再次向国人呼喊“强势文化”，用王庙村的神话为国人诊脉，开方吃药是国人自己的事，英雄、圣人救不了你们。\n　　　　　　　　　　　三\n　　“又扒拉铜板，又扒拉灵魂”也是天道。丁元英遁栖古城创造神话是用行动向国人呼喊：要吃饭，还得补脑，这是人类文明的标志。\n　　丁这位留学柏林的经济硕士书没白念。他曾就职于柏林国际金融投资公司、北京通达证券公司，曾任《世界经济周刊》经济发展战略研究员，丁肯定对扒拉铜钱从理论到实践都有一套。九四年在北京创办个人私募基金，用外国人的钱不到一年在中国股市赚了两个亿，他自己不是缺钱的人，然后从北京到古城隐居起来。丁说： “我不过是一个略懂投机之道的混混，充其量挣几个打发凡夫俗子的铜板”。其实，丁不是混混，他到古城是为了“灵魂归宿感，这是人性本能的需要”。他到古城后“上网、学习，什么都看看，对文化属性感兴趣”。丁会挣钱却不恋钱，有口饭吃就满足了，把到古城的生活费给韩楚风的妻子应急付出十五万，剩余给了父母，自己变卖心爱的唱片维持生计，冰箱里是空的，每天三顿饭不是去地摊就是方便面，唯一值钱的是一套音响，他喜欢天籁之音。丁元英是个会赚钱，有思想的人，韩楚风说丁“是个明白人”，丁自己说是“把自己酿到淡而又淡的名贵”，芮小丹说他“又扒拉铜板，又扒拉灵魂”。小丹就是被丁的智慧和孤高所折服才涌起热恋。吃穿住用是人的基本生理需要，是人类社会发展的基本动因，人吃饱穿暖还要读书、思想、听音乐，使精神丰富起来、灵魂健康起来，这是人和动物的根本区别，道理很简单，做起来不容易，用“扒拉”两字就形象地说明挣钱和补脑都不是容易的事。毛泽东提倡先抓思想再抓经济，邓小平提倡先抓经济再抓思想，后来说“两手都要硬，两手都要一起抓”，连这些大人物都如此关注物质利益和精神追求的关系，可见这不是一件小事。刘冰钻到钱眼里没出来就跳楼自杀了，他只想扒拉铜板，忘了扒拉灵魂或者说没有扒拉灵魂的素质，结果没挣着钱连命搭上；林雨峰很会扒拉铜板，可是扒拉灵魂的路子偏了，没到正门就出“车祸”了；冯世杰不会扒拉铜板，但灵魂天生厚道些，所以格律诗胜诉后又回去扒拉铜板去了；叶晓明小聪明，扒拉铜板会一点，扒拉灵魂初中没毕业，所以退股后再也没出现；芮小丹、欧阳雪、肖亚文可谓是扒拉灵魂的高手，小丹为国除暴、亚文有胆有识、特别是欧阳雪在退股、应诉、档案袋三个场面表现的重义轻利、不畏邪恶的气节，这三位弱女子灵魂之高洁，令我们每一位有良知的观众都心疼她们、更佩服她们！为她们的风采拍案叫绝！这些说明：既会扒拉铜板又会扒拉灵魂对一个人、一个集体、一个民族、一个国家来说何等重要！用丁元英的话说：“一颗阴暗的心永远托不起一张灿烂的脸，这是人性”。现在我们的生活水平提高了，很多人学些扒拉铜板的招数，这是好事；但是，贪婪腐败、假冒伪劣、坑蒙拐骗屡禁不止，根本原因就是只想扒拉铜板没有扒拉灵魂，挣大钱的人能有丁元英的智慧和气度的寥寥无几，能有欧阳雪气节的位数不多；穷者乍富，一见纸醉金迷、灯红酒绿就忘乎所以了。总之，国人特别需要提高扒拉灵魂的素质，《天道》的确是“扒拉灵魂的艺术”，仔细体味一下丁元英扒拉铜板、扒拉灵魂的高妙，能仿效的就做一点，我们的文明程度就大大改观了。\n　　　　　　　　　　　　　四\n　　丁元英不是英雄也不是圣人，他说自己“本是后山人，偶坐前堂客”，他既有大智慧又有平常心，是即入世又出世的智者。\n　　英雄是使天下人臣服于自己，完成赫赫事功的人，圣人是征服自己、替天下人解除烦恼痛苦的人。丁玩股挣钱、杀富济贫是小事功，谈不上振臂一呼、应者云集的英雄；丁深居简出、关注文化属性、研究基督、佛法，也谈不上是离尘拔俗、自觉觉人的圣人。但是丁元英的思想、学识是过人的，丁面对小丹的生离死别，足见他对人生的感悟、对社会的沉思非一般人所能及：丁这个“骨子里害怕女人”的男人，没挡住小丹疯狂的爱恋，两人爱得很真、很深，他说：“此生得你红颜知己足矣”，一曲“天国女儿”作为故事情节的开始，为天国之恋埋下了伏笔；当小丹死讯来临时，丁一句“当生则生，当死则死，来去自由，丫头，不简单呢”，他对生死是达观的；丁不哭不泪、伤心呕血，他对小丹的至爱无以言表；丁没有回答小丹的电话，致使不能参加追悼会、不能告别，他没有解释、也不抗争，认为“他对芮小丹的感情还需要别人的理解吗？需要理解即是对这种感情的亵渎”；当林雨峰的枪口正对时，丁的从容镇定是对小丹最深沉的爱的自然表露：小丹已经先我一步，我随后而去无缺无憾！丁交给刘冰的档案袋全是白纸，他要从格律诗公司清除刘冰这个势力小人，把送给小丹的礼物——王庙村神话写得完美、再完美！\n　　丁元英说：“我与佛的缘站到门槛就算缘尽了，不进不出，与基督而言我进不得窄门，与佛而言我不可得道”，“正果是不想了，尘埃落定”，“我还没有装腔作势到可以无视可能发生的事情，但是你看到的东西不一定是个东西”。丁相信上帝却不进窄门，明白佛法却不取真经，但他努力“心如明镜台，勿使惹尘埃”，即使悟到“明镜亦非台，何处惹尘埃”的境界，丁不去修当然也修不到，正如智玄大师所说：“进则净土，退则凡尘，这一步之遥难如登天”。实际上丁的思想境界犹如一脚净土一脚凡尘，这更具有现实性和典型性。这样的人既可为民出力、振衰起疲，又可栖林遁世、醉心思维，绝不会见利忘义、损国害民。由此可见，丁元英从闹人的北京退到清静的古城，再把用智慧创造的神话献给远在天国的小丹只身去德国，这一切，都根源于丁元英对天道的深思苦索，也自在情理之中。\n　　王志文老师饰演丁元英确是导演独具慧眼。丁“他和正常人的思维颠倒了，说鬼话，办鬼事，倒行逆施，但还有道理，像魔，柏林有个居士说他是个极品混混”，丁集智慧、特立、孤独、怪癖与一身，其言语举止跟常人差异很大，塑造这样的人物形象，不仅需要高超的演技更要有宗教、哲学、政治、经济、文化等方面的学识，这不是一般水平能做到的，王志文老师做到了。丁元英接听小丹最后的电话时，王老师放电话的手掌、手指细緻入微的变化，非常形象的表现出丁对小丹不详的预感、内心的焦灼和无奈；丁看到小丹以其心灵和肉体表示“履行程序”时，在突如其来的爱情风暴面前，王老师的眼神惊异又镇定、面部表情严肃又亲切，不失男人对一个真切女人的感激和尊重；丁听到小丹死讯时，没有言语没有哭泣，王老师面部表情丰富而细腻的变化，活脱脱的刻画出丁的大悲、大爱。可以说，王志文老师用内在的睿智和学识及高超的表演技巧，把丁元英这个艺术典型活灵活现的树起来了，如同丁元英送给小丹的神话，这是王老师送给热爱他的广大观众的宝贵礼物。"
		},
		{
			"post_id": 25,
			"title": "元认知",
			"date_published": 1470147646.592,
			"body": "一个概念的三个基本要素：\n①是什么（what）\n②为什么（why）\n③怎么做（how）\n\n我只能说说自己理解「知行合一」是什么？\n\n有意识地思考，把思考和行动结合起来，这时候自我是自主的，独立型自尊出现。简单说，知行合一就是学会表达我们独立的核心自我。\n\n正念之下，是一个觉醒的人。\n\n补充：有意识的思考，就是认识到自己思考，其实就是一种元认知能力，即认知的认知。\n\n当你在思考的时候，你能意识到自己在思考，进一步还能意识到自己在思考什么，又进一步还能判断自己的思考方式、思考结果是否正确，更进一步还能纠正自己错误的思考方式或者结果，这就是元认知能力。"
		},
		{
			"post_id": 24,
			"title": "人生所为",
			"date_published": 1469960358.365,
			"body": "人生是一段过程。人生在世所为者，理该就是在自己的可能范围内创造出一段最有意义的过程。\n\n很多人觉得人生虚无。吃饱了又会饿，然后复又饱，日复如是，所为者何？终不是一死？\n\n佛陀宣说四法印：\n①一切和合事物皆无常（诸行无常）\n②一切情绪皆苦（诸漏皆苦）\n③一切事物皆无自性（诸法无我）\n④究竟涅槃\n相信认可四法印，就可以自称佛教徒。\n\n这或许是解决人生虚无问题的方子之一。\n\n在人生哲理方面，虽然在思想上明白了某个道理，但能否做到还需要长时间的修养。四法印就像一个种子，你在内心接受了它，它就会在你心间生根发芽。\n\n"
		},
		{
			"post_id": 23,
			"title": "智与仁",
			"date_published": 1469950405.072,
			"body": "孔子言：“好仁不好学，其蔽也愚；好智不好学，其蔽也荡。”\n\n唐君毅在一封信中写到：“聪明与仁厚二者亦可相克而相碍。仁厚出于生命之本质，如烛；聪明为生命之光华。人如只持守此烛不用，则无光华，但只用以显光华，则烛尽而光华亦灭。人任此种自然之势以趋，则天赋之聪明必至壮而衰老而竭，否则必如世之天才而早夭。于此需一种学问使生命之光华不止放射于外以趋于衰竭，而使此光华放出者旋放旋收，以返于生命之烛之本身。则此聪明之发不荡而恒聚，亦得长保存而不衰，此即为仁智交相养之学。”\n\n自古以来，天才几乎都短命，为何？太刚强了。天才们大都持才傲物，不懂得谦虚进退的柔弱之道。这个世界上，常常是柔弱可以长久，刚强容易夭折，盖因用力过猛，消耗过多了。"
		},
		{
			"post_id": 22,
			"title": "摘录李天命诗一首",
			"date_published": 1469950236.482,
			"body": "星空\n\n死亡的秘密\n葬于黑夜\n黑夜的秘密\n藏于星空\n\n一切有生之类\n莫不仰望\n一切无生之属\n莫不仰望\n\n宇宙森然\n众星穆穆"
		},
		{
			"post_id": 21,
			"title": "碎语",
			"date_published": 1465923663.34,
			"body": "想干什么和能干什么不是同一回事，根据条件决定。明确想要的结果，然后仔细揣摩得到结果的过程，花一年两年甚至十年，正常不过，不用担心规划时间太长而无获，相反，时间越长，风险越小，收益越稳定。做事情只要方向对就不怕慢，想想世上的事情，有许多就是因为太快才做坏的。\n\n互联网时代，世界发展不再被几个大趋势垄断，而是列变成无数微小的趋势，碎片化。后现代强调主观性，非理性，多元价值，非确定性。农业社会关键性资源是土地，工业社会是能源，而网络社会是信息。物质游戏乃零和游戏，但信息是非零和资源，只讲使用权，复制零成本。信息变现时代，已然临近。"
		},
		{
			"post_id": 20,
			"title": "观物",
			"date_published": 1465048956.966,
			"body": "一痕春水一痕烟，化化生生各自然；七尺形躯非我有，两间寒暑任推迁。"
		},
		{
			"post_id": 19,
			"title": "天道（遥远的救世主）",
			"date_published": 1464618246.877,
			"body": "很多年前在电视上看过这部剧，那时还小，觉得像在吃一碗白米饭，没滋没味。今天忽然在网上看到这部剧，点开第一集，一口气看了八集，因为明天还有事，只能忍着不再看。\n\n丁元英。智慧、孤独。\n\n里边丁元英有句台词：透视社会有三个层面：技术、制度、文化（人性）。小到一个人，大到一个国家一个民族，任何一种命运，都是那种文化属性的产物。强势文化造就强者，弱势文化造就弱者。前者即是武侠小说中的秘笈。后者因为易学、易懂、易用，成为流行文化。\n\n强者之所以是强者，都是付出极大努力，努力是成为强者的必要条件。这世上，无论做什么，都需要坚持，耐得住寂寞。种田如此，股市亦然。三百六十行，行行不同，唯坚持一也。"
		},
		{
			"post_id": 18,
			"title": "孝道",
			"date_published": 1463412081.753,
			"body": "小时候很爱黏着父亲，父亲也很喜欢和我游戏。\n\n象棋、陆战棋、扑克、乒乓球、羽毛球、跑步、骑车、钓鱼……好喜欢和父亲在一起。\n\n渐渐长大。\n\n在家的日子越来越少。和父亲聊天的话题，从游戏变成了学业和职业规划。两人之间，如兄如父的关系再也找不回来了。\n\n争吵开始多了起来。变得不愿意回家，不想见到父亲。\n\n从小在别人眼中，我是乖巧孝顺的孩子。我听父母的话，是因为觉得他们有道理。但随着年龄增长，见识宽广起来，父亲一些言论二十多岁的我听来，滑稽好笑。\n\n小时候，父不父，所以我尊敬他。\n\n而现在，父不父，然而我讨厌他。\n\n不知孝悌为何物。\n\n传习录有一段：\n>乡人有父子讼狱，请诉于先生，侍者欲阻之。先生听之，言不终辞，其父子相抱恸哭而去。柴鸣治入问曰：“先生何言，致伊感悔之速？”先生曰：“我言舜是世间大不孝的子，瞽瞍是世间大慈的父”。鸣治愕然请问。先生曰：“舜常自以为大不孝，所以能孝；瞽瞍常自以为大慈，所以不能慈”。\n\n小的时候，我们的世界很小。父亲是那处世界的巨人，是英雄。我们思想单纯。随着我的长大，心中的自我也在不断成长，有我之私阻隔了与父亲之间的交流。\n\n我一开始论孝道，谈孝悌，实想给自己一个不尊父亲的理由。但现在明白，这是因为我还不够孝顺。孝悌不是一个价值观念，不能拿来对价交换，因为父不父，我便不尊父。不可以这样。\n\n不父之父与慈父，都是父亲。孝悌由心而发。所谓孝道不是一出虚伪的戏剧，孝出乎于心。我孝敬父母，不是因为自己应该孝敬父母。而是因为，他们是我父母。\n\n\n\n"
		},
		{
			"post_id": 17,
			"title": "一精妙比喻",
			"date_published": 1463145741.135,
			"body": "聪明人都善用类推。圣人王阳明亦是如此。《传习录》中，有各种精妙的类比。读之令人醍醐灌顶，豁然开朗。\n立志用功，如树使然。方其根芽，犹未有干；及其有干，尚未有枝。枝而后叶，叶而后花、实。初种根时，只管栽培灌溉，勿作枝想，勿作叶想，勿作花想，勿作实想，悬想何益？但不忘栽培之功，怕没有枝叶花实？"
		},
		{
			"post_id": 16,
			"title": "读传习录所思",
			"date_published": 1462866358.585,
			"body": "读《传习录》。\n\n问：“知至然后可以言诚意。今天理人欲知之未尽，如何用得克己功夫？”先生曰：“人若真实切己用功不已，则于此心天理之精微日见一日。若不用克己功夫，终日只是说话而已，天理终不自见，私欲终不自见。如人走路一般，走得一段，方认得一段；走到歧路处，有疑便问，问了又走，方渐能到得欲到之处。今人于已知之天理不肯存，已知之人欲不肯去，且只管愁不能尽知。只管闲讲，何益之有？且待克得自己无私可克，方愁不能尽知，亦未迟在。”\n\n1.人容易有这样的习惯，在解决一个问题时，希望把所有的信息都收集到手，然后再开始解答问题。所以他们在处理一个问题的前期，一直在不停的收集资料，而这些资料中的很大一部分，最后常常是无用的。\n2.反省自己。我一直提醒自己要提高英语。提升英语水平的想法也一直在脑海中徘徊，但也仅仅只是在脑海中徘徊。每次看到好的英语学习资料，我就会存下来，心中有种满足感。但事实上，我的英语提升之路，还只是在空想阶段。只管闲想，何益之有？要在事情的实质处动刀，方可有所精进。\n3.要真真实实地去做，不要找借口。这些借口就是私欲，要克掉。我现在是重要的事情不做，把时间耗费在不紧要的事情上。整天还对未来忧心忡忡。这就是对已知之天理不肯存，已知之人欲不肯去，且只管愁不能尽知。且待把重要的事情都处理好了，再开始担忧未来，也不迟。\n\n“与其为数倾无源之塘水，不若为数尺有源之井水，生意不穷。”时先生在塘边坐，旁有井，故以之喻学云。\n1.欲望太多，以至生活没有方向，一事无成，就像是无源之塘；不如有清晰的志向，专注在所立之志上。每天都有所精进。\n2.生意不穷，联想到做生意。与其花很多钱在推广上换来华丽无意义的数据，不如花力气抓住一批真正有用的客户，生意不穷。\n3.你想要怎样的生活？有源的生活。"
		},
		{
			"post_id": 15,
			"title": "想要让自己记住的十句话",
			"date_published": 1462685655.631,
			"body": "1.减轻自我中心，从别人的观点看。\n2.独立思考——批判思考——是心智成熟的首要条件。\n3.无财作力，少有斗智，既饶争时。\n4.苟有恒，何必三更起五更眠。\n5.先甜后苦苦，先苦后甜甜。\n6.提升“我”实践的能力。\n7.事不过三。\n8.复利无处不在。\n9.流行套语时髦滥调每多像婴儿呕吐。\n10.预先取之，必先与之。"
		},
		{
			"post_id": 14,
			"title": "概念论——概念的意义和用法（摘自艾思奇的《大众哲学》）",
			"date_published": 1462632479.204,
			"body": "反思思维的学问，叫做逻辑学。可以说，本体论、方法论、认识论都是一个东西，可以在辩证唯物主义中，用辩证的逻辑囊括。\n\n辩证唯物主义三大定律：矛盾统一律、量变质变律、否定之否定律。\n\n肯定、否定、否定之否定，就是所谓的正反合\n\n思维能把世界上的事物分门别类地概括起来，这概括的名字，就叫做概念。一切概念中包括最广的，也称为范畴。\n\n我们的思想用概念和范畴来反映世界。，世界上的东西，从表面上看来，虽然千种万样，但实际上有着密切联系。我们的思想反映世界，绝不能够单单看表面，要把他们中间的种种关系也反映出来，概念的功用便在这里。\n\n在使用概念和范畴时，有两点要注意：\n一、思想是世界的反映，概念和范畴也反映这世界上的事物，所以当我们用概念和范畴时，不可忘记它所反映的东西。别不以为然，很多时候，我们都是无意识地忽略。比如在说“否定”这个概念时，直接认为否定就是没有，消灭。但在客观世界，否定一定伴随着新生。如果不理解着点，就无法理解否定之否定。一定要把概念和它代表的事实各方面研究到，使它包含充分的现实内容。这样的概念就不是空洞抽象的，而是具体的概念。\n\n二、不但要使概念包括各方面的事实内容，并且要研究这些内容中间的矛盾，研究一个概念怎样由于这些矛盾而变成另一概念。\n\n辩证唯物主义三大定律也可以用在概念上。\n\n逻辑学三大定律：同一律、矛盾律（不矛盾律）、排中律\n\n同一律的基本内容是：在同一思维过程中，每一思想的自身必须是同一的。同一律的公式是：\"A是A\"。公式中的A可以表示任何思想，即可以表示任何一个概念或任何一个命题。就是说，在同一思维过程中，所使用的每一概念或判断都有其确定的内容，而不能任意变换。 \n\n矛盾律实际上是禁止矛盾律，或不矛盾律。矛盾律的基本内容是：在同一思维过程中，两个互相矛盾或反对的思想不能同时是真的。或者说，一个思想及其否定不能同时是真的。矛盾律的公式是：并非(A而且非A)。 \n\n排中律的基本内容是：在同一思维过程中，两个互相矛盾的思想不能同假，必有一真。排中律的公式是：\"A或者非A\"。排中律的主要作用在于保证思想的明确性。而思维的明确性也是正确思维的一个必要条件。 \n\n逻辑学适合思考形而上学，抽象的概念。\n\n对于反映现实世界的概念，应用辩证法。\n\n形而上学：把世界上一切事物，或社会上一切现象，或思想中一切概念等都看作是固定的，各自独立毫不相干的东西。而辩证法是要把这些东西看作永远会运动变化，没一刻静止，互相关联渗透的东西。"
		},
		{
			"post_id": 13,
			"title": "“实践是检验真理的唯一标准”这话怎么理解？",
			"date_published": 1462538700.835,
			"body": "实践是检验真理的唯一标准。此话耳熟能详。但我在想“真理”这概念该作何解释呢？所谓真理不是不言自明的道理吗，用得着检验？真理不用检验，假设才需要人去验证。\n\n现在流行实用主义。它主张一切知识都需经过实验，才可以端定它是不是真理。听上去好像和“实践是检验真理的唯一标准”相当符合。但事实呢？你拿一碗馊饭给一个饥民，问他，好不好吃，是不是美味？他极有可能点头赞美，人间至味，只应天上有。好了，经实践检验，“这是碗美味的馊饭”是真理。但你把这碗馊饭带给一个富人，他会承认这一真理吗？\n\n实用主义只问眼前的实验结果是怎样，就算怎样。只要眼前实用的下去，就是真理。所以前几年在街上随便找人问，改革开放好不好，众人都会说好，实践证明，改革开放让我们发家致富。但最近几年，越来越多的人开始反思改革开放的弊端。\n\n由此看来，我们还得把“实践”规范一下。暂且这么描述，经过*有效实践*检验的真理才是真确的真理。但现实中，怎么样的实践才是有效实践呢？很难评估是不是？所以通过有效的实践，认识真理是十分困难的。生活中，由于每个人地位、素养不同，他们对于这个世界的实践也是不一样的，从而得到的真理也不一样。\n\n真理还能不一样？回到我们最开始的问题。真理是不言自明的，用不着检验。“实践是检验真理的唯一标准。”此处的真理，应该理解成相对的真理，或者说主观真理，因人而异。我想把真理换成道理或者假设，可能会更恰当。真理是客观存在，不以人的意志为转移的。但是我们可以讲道理，每个人都可以有自己的假设，讲自己的道理。故实践是检验道理的唯一标准。\n\n对于一件事情，不同人有不同的见解，但只有真确的见解才是真理。其他的全部只是一种假设。判断假设的正确性，需要有效的实践。“有效的实践”这个说法是我忽然想到的，但现在发觉它很有趣。对于一个假设，今天我用了一种有效的实践证明它是对的。改天我有了更有效的实践后，完全可以再来证明他是错误的，从而完善出更正确的假设。但由于主观上人有其局限性，无法真正认识客观上的真理，所以啊，我们只能讲道理。道理就是主观真理。\n\n通过实践和再实践，道理会越来越明，无限接近客观真理，但主观真理永远无法发展为客观真理。理越实践越明，所以我们的认识论是在不断进步的。\n\n写完自己看了一遍，好像把真理用假设或者道理代替不是很恰当。但我不想怎么修改了。只是想把思考的过程记录下来。发表在这里大概也没有什么人看。有空自己再翻出来看看此刻思考的过程，也是很有趣的一件事情。\n\n再补充一点，一个人的持有的本体论，即他的世界观，会影响他对这个世界的认识，即认识论。而一个人的认识论又会决定他的方法论。然后呢。实践是检验方法论的唯一标准。这样一想仿佛更清晰明了。我们大可不谈真理嘛，就让真理一个人孤独的在世界最高处玩耍吧。\n"
		},
		{
			"post_id": 12,
			"title": "人生战场？读后感",
			"date_published": 1462451818.741,
			"body": "机器态度无所谓气量，\n无所谓包容，无所谓忍；\n机器态度超越。\n   ——《哲道行者》\n1\n“在哪里跌倒就在哪里站起来！”\n有豪气，且只有豪气。\n\n2\n在哪里跌倒就在哪里站起来，\n在哪里跌倒就爬到别处站起来，\n在哪里跌倒就躺在哪里休息下，\n……\n智者全看实况而定。\n\n3\n哲道装备具足，\n以心如虚空为本，\n顺机器态度起用，\n庶几可以无敌。\n\n4\n无敌？正所谓：\n滚滚长江东逝水，\n浪花淘尽英雄……\n古今多少事，\n都付笑谈中。\n\n评：内容摘自李天命书《杀闷思维》，一首诗道尽人生沧桑。年轻时豪气，从哪里跌倒就在哪里站起来。转而四十不惑，顺势而为。再后来智与慧渐渐增加，几近无敌。临终前，望着滔滔江水，古今多少事，近付笑谈中。人生一场虚空大梦。\n\n所谓人生，无外乎这般渐变的过程。人世间没有什么事情是必然正确的，只有说一件事，在彼时彼刻正确与否。所谓智慧，就是把事情摆在恰当的位置的能力。"
		},
		{
			"post_id": 11,
			"title": "诗两首（摘录）",
			"date_published": 1462344761.4,
			"body": "##1\n清明时节雨纷纷，\n路上行人欲断魂。\n借问酒家何处有？\n牧童遥指杏花村。\n                                           ——杜牧\n##杏花鬼\n清明已过又重来\n明日黄花今日开\n时间回旋直到永远\n节令回旋不尽悲哀\n\n雨隐藏泪\n纷纷洒在荒冢上\n纷纷洒在新坟上\n路在坟冢之间穿梭\n上香客没有一个\n\n行走阴间必须纸钱\n人世冷漠鬼亦心酸\n欲饮一杯奠酒好上路\n断绝所有世间恩怨情\n魂归离恨天\n\n借钱无钱可借\n问鬼无鬼可问\n酒杯破落去年的墓边\n家人踪影不见\n\n何处是归程？\n处处是归程\n有声音似自虚空回应：\n\n牧牛牧羊不如牧心\n童颜鹤发不若童心\n遥指天国不及近指平常心\n指日指月不如直指无所住心\n\n杏来自花\n花来自杏\n村鬼悟见山外山\n                                                         ——李天命\n\n##2\n床前明月光，\n疑似地上霜。\n举头望明月，\n低头思故乡。\n\n##宿命——李天命\n床，前人称之为榻，明天又会有个什么新的名称呢？\n月色下我总禁不住想到明天的问题，光阴就是如此的逝去了。\n疑虑、是非、地中海贫血、上海姑娘、霜雪风沙……举之不尽的难题挥之不去，头为之胀。\n望远要登高，明理要思考，月色下我这样提醒自己：低回蹉叹不是办法。\n头昂扬起来不到一分钟，思考多时的问题忽然现出了结论：\n故人之情是无法忘怀的，乡土回归本来就是我的宿命！\n                                                         \n\n"
		},
		{
			"post_id": 10,
			"title": "两个道理",
			"date_published": 1461732767,
			"body": "#法尔道理\n法尔，佛典名词，即自然。自然者，无所待而然。固无可名称，而强名之曰自然。法尔道理，即是天地自然之理。\n#继成道理\n良知具有无限的知之可能。《传习录》有一段：\n>我辈致知只是各随分限所及，今日良知现在此，只随今日所知扩充到底，明日良知又有开悟，便从明日所知，扩充到底。如此方是精一功夫。说的是良知涵养，但知识修养亦如是。\n\n从天圆地方到地心说再到日心说至于现在的宇宙观，基于长时间，无数代人的知识传承，不断扩充。牛顿定律到相对论也是如此，不久将来，相对论也一定会被颠覆，因为它是继成的道理，而非法尔道理。\n\n"
		},
		{
			"post_id": 9,
			"title": "自言",
			"date_published": 1461688772.702,
			"body": "吾之性，柔有余而刚不足，盖幼时崇信老庄学说之故耳"
		},
		{
			"post_id": 8,
			"title": "“知其无可奈何而安之若命”与“知其不可而为之”",
			"date_published": 1461688317.427,
			"body": "圣人之学，体人道而立人极，成人能而赞天化。明于天之险阻。健动以建鼎革之功。虽陷险中而不失其刚，履虎尾而无畏于咥，极知未济而不舍倾否之宏远与强力。"
		},
		{
			"post_id": 7,
			"title": "谈谈欲望和空虚、孤独等负面情绪",
			"date_published": 1461511455.989,
			"body": "动物只要不患病，吃得饱，便是幸福快乐的。人呢，本来也该如此，但在现代社会中却并不是这样。说到底，人之所以区别于动物，在于他会思考。正如帕斯卡尔所言：\n\n “人是会思想的芦苇。”\n会思考当然是件好事情。凭借思考，人类惊讶发现自己原来是目前自然界里最牛逼的生物。这一发现可不得了，能力越大，责任亦大；责任越大，烦恼亦多。欲望以及空虚、孤独等各种情绪由此而生。\n\n此处谈及的欲望是有意识的欲望，而非当年兽类祖先那种出于身体本能的原始欲望。个人认为原始欲望的本质是无从认识的，它起因于本体发出的冲动，就像神经冲动的传导。而有意识的欲望往往伴随着矛盾心理的产生，扰乱心灵平静，故有必要对其做一番了解。\n\n在这之前，先说一件自己干过的傻事。\n\n曾经为了摆脱有意识的欲望，我把自己关在两平米大小的房间里一天一夜，想借隔世的环境忘去自我，因为只有当我们独处时，才能从自我感中解脱出来。在那24小时里，我的确忘记了自我存在。但当走出封闭世界，晒着温暖阳光，呼吸新鲜空气，那种自我存在的感觉竟是前所未有的明晰，也从而清楚了自己做的事情有多傻。不过把自己关在一个狭小密闭的空间24小时这件事情本身还是挺有意思的，感兴趣的朋友可以尝试一下。\n\n其实生活中大多的事情都是在强化我们的自我感，无论社会、经济还是宗教等层面莫不如此。而自我一旦出现，冲突、不幸和挣扎立刻会产生，是以我们都不断地渴求忘我的经验，都渴望拥有平和的心境，过上宠辱不惊，看庭前花开花落，去留无意，望天边云卷云舒这般洒脱自在的人生。\n\n人类从学会思考始，便被欲望及各种负面情绪的包裹，为了淡化甚至摆脱这些情绪，人们想了很多办法。譬如坐忘、冥想、祷告又或是写日记、找人倾诉还有旅行等等。人们总是不断尝试着宣泄心中不快的情绪，然而结果一次又一次令人失望。\n\n仔细想想，只要是一个正常人就定然会有七情六欲，欲望是形而上的，它是一个思维抽象而成的概念，概念既存在于思维之中，而思维又以我们自身作为载体，如果要摆脱空虚，必须首先停止思维，而停止思维的唯一途径便是消弭自我的存在。但除非我死了，否则我不可能消失，最多只是忘我罢了，然而我们又做不到永恒地忘却自我。\n\n所有的概念都源自于记忆的一种反应，即生活的经验。可以说，是经验创造了概念，但在建立概念的同时，经验也使我们拥有了对某一欲望的记忆反应，而它又阻碍了我们直接经验概念本身。\n\n很多人为了不被空虚所扰，他们逃避它、否定它、净化它，这一切都是无用的，空虚永远存在，只要你还在思维。\n\n很多成功学的书在提到欲望时，建议我们应该没有欲望（这不是在劝我们去死嘛），应该培养不执著的人生态度，从欲望中解脱出来。这是非常荒唐的说法，因为欲望只能被了解而无法被摧毁。如果你非要凭借着人定胜天般坚定不移的信念将欲望摧毁，那么结果只有精神分裂，破坏了思维也就意味着丧失了理性，即把生命本身摧毁掉了。\n\n对于欲望，如果不去谴责它，不论其好坏，只是单纯地觉知它，请问会发生什么事？所谓觉知，便是你知道一个东西的存在，但不去衡量、评判它。不去为欲望定名，也不去用念头掩盖它，如此还会有内心的骚乱吗？\n\n觉知了欲望的存在，我们还需觉察欲望的本质。我们为什么都喜欢旅行一路欣赏山川美景？为什么男人喜欢看美女，而女人喜欢瞅帅哥？因为它们都能引起我们强烈的愉悦感。这似乎没什么问题，然而不幸便是从这里开始的。一旦山川美景，帅哥美女变成了一种愉悦的记忆时，这份记忆便试图让自己延续下去，我们会想要重复地享受这类的经验。这是我们很熟悉的事，一旦吃过某种美食，我们便会念念不忘，以至在想起时会口水直流，肚子咕咕叫唤，我们想重复地体验它。不论是性爱、艺术或智力上的快感经验，我们都想重复再三。\n\n这便是欲望的由来，一味地追求快感只会带来不幸与困惑，并且会制造错误的幻觉和价值，如此一来心智的清明度就不见了。其实欲望通常是一种健康而正常的反应，若没有欲望，人就无法存活了。但在欲望的过程中，一定伴随有矛盾、痛苦与冲突，这才是我们的问题。在关于矛盾、冲突的经验中，思维抽象出了关于空虚、孤独的概念。\n\n我们有欲望，是因为我们想要获得某种快感，而延续这种快感的是什么东西呢？很显然，是思维，心里在不断地想着这件事。\n\n心里如果不断地在想着某件事，我们就不再和真实的经验产生直接关系，而只有一堆意象、画面和思维按记忆的反应（从前的经验）想当然地对某事进行预判：这我认为是空虚、孤独产生的根源。\n\n其实我们可以一边拥有欲望，同时在旁边看着它，在没有任何念头干预的情况下，它很快就会止息下来，从而获得平静喜悦。但请明白仅仅是止息，欲望是不会消失的，除非你疯了或者死了。我把这一处理欲望和空虚、孤独等情绪的方法起名太上忘情。太上忘情，并非无情，忘情是寂焉不动情，若遗忘之者。\n\n人心实际上并不是一个跟记忆有关的惯性作用。如果它能舍弃已知事物，就可以成为另一个崭新的东西。所谓顿悟，大抵若此。当然，做到这一点并不简单。"
		},
		{
			"post_id": 6,
			"title": "一生俯首拜阳明",
			"date_published": 1461365504.513,
			"body": "很惭愧，对王阳明先生的了解，一直停留在中学历史课本上的一张人物画像。于先生的学问思想却一概不知。前段时间在天涯读到一篇谈论《传习录》的帖子，才得知先生的学问。一见如故。\n\n知行合一的概念对我启发最大。\n\n知而不行只是不知\n阳明先生认为真正知道一件事情，是一定能够行的。他说，真知即是行。知与行是统一的整体。知即是行，行即是知。这番见解，对于拖延症根深蒂固的我而言，吸引力可想而知。\n\n后来读了先生的事迹后，更被其人格魅力折服。当年明月在《明朝那些事儿》里，把先生看作明朝一哥，中国历史上罕见的立德、立言、立功三不朽的圣贤。东乡平八郎一生俯首拜阳明。心学的影响不可谓不深远。\n\n我花时间，废寝忘食，沉醉于心学。但我跟它之间仍旧隔有一片迷雾，而且书读得越多，这雾也越浓。心底渐渐生出吾生有涯而知无涯的无力感。当初接触心学，是想用于实践，改掉拖延症，切切实实改变生活。如今理论了解很多，却不知如何应用，无从下手。\n\n有一段时间，整个人陷入一种焦躁的情绪之中，就像是走火入魔。这是一件坏事，但同时也是一个契机，给我一次实践心学的机会。\n\n心学从来都不是纸上谈兵的功夫。不知如何运用，只是还未入门。整个心学所要达到的最终目的，或者说心学所要解决的核心问题，是变化人的气质。用当代西方成功学的话来讲，叫做培养正确的心态，养成良好的习惯。\n\n心学的第一步，阳明先生说，立志。此立志与现在人们常说的立志有很大不同，现在人们常挂在嘴边的立志，最好说成理想或者梦想更为贴切。天涯帖子的作者对于现代人的立志用了一个较为生猛的词汇来描述——“意淫”。\n\n世上不如人意的事情常常十有八九。凡是太固执于我见的人，难从生命中寻到幸福和平静。先生说，立志不是这样的。立志就是“念念不忘存天理”。\n\n立志，立的是心中的一个准则，树立一个方向，循着这个方向，跨出千里之行的第一步，并且永远在路上。我相信，人总是在向着他希望的样子变好。\n\n如此，虽吾生有涯，可能穷尽此生也无法窥得心学之一二。但是我在享受这个过程，正因为这样，此刻我才能安安静静坐于电脑前，敲打这篇文章，很快乐。\n\n知行合一是心学的重要原理之一。知行是一个完整的过程，知是行的起点，行是知的最终形态，是知在生活实践中的反映。目标和过程不能分割，想快乐幸福，要学会享受过程，安于此时此刻的当下。\n\n同理推之，我们在做其他事情时，譬如学习一门语言、读书写作、运动健身或者经营生意，切莫太重结果。这些事情都需要一个积累的过程，无法立竿见影。过分专注结果，会使你浅尝辄止，到头来一事无成。依照心学的方法，先树立一个正确的方向，享受过程，对目标持有长久热情，而不是因为一时间不见效便弃之一边。如此这般，结果会令你满意。\n\n生命的意义在于生活本身。抛去我执，认真安排好每天的生活。感受当下的心境，享受此刻的阳光。心学是门精深的学问。我辈或许穷尽一生也无法领悟透彻，但又如何？何必强求，也强求不得。享受学习的过程，不去在意结果，自当获益无穷。"
		},
		{
			"post_id": 5,
			"title": "天井",
			"date_published": 1461340583.554,
			"body": "天井，就是屋子边上的一处院子。\n\n家里的天井在我出生前就造好了。听奶奶说，是爸妈在结婚时修建的。一直没有多大变化，直到后来搬家，才渐渐荒芜了。\n\n天井见证了我的出生、童年和少年时光、还有我和奶奶两个人的回忆。\n\n天井的中间种有两棵果树：一颗石榴树，一颗梨子树。一在中间花坛，一在东角菜地边上，都是奶奶手植的。印象里没见梨树结过梨子，但每年中秋前后，熟裂的大石榴，其鲜美味道，现在想起依然忍不住流口水……\n\n除了两棵果树，奶奶还在院子里种许多蔬菜：小油菜、韭菜、番茄、茄子、丝瓜、刀豆，还有别些叫不出名字的蔬菜。夏天在天井摆张圆桌。全家围坐在一起吃晚饭。饭菜都是当季时蔬，院子里采摘的。太阳将落未落时摆碗吃饭，收桌时已是星光漫天。有萤火虫，一闪一闪的，似与星辰争辉。\n\n花坛边上，还种有些薄荷跟仙人掌。仙人掌开出的花有黄有白。凋谢后留下一颗果实，流鼻血的人吃了可以止血。我小时候好静，在花坛边看蚂蚁搬东西，能蹲一整天。起身时，脚一软，脑袋经常会和仙人掌来个亲密接触。奶奶边骂边细心地帮我把头发里的毛刺挑出。\n\n天井北面连着一片竹林，边上有一条河。以前，大清早奶奶会在河边刷牙洗脸、淘米洗菜、清洗马桶（那时候都是木制的马桶，每天都要清洁，很麻烦。技术改变生活。），到了中午又在同处地方淘米洗菜。河水流动不息，很干净。等我再大些，水质遭到污染，我们劝奶奶用自来水淘米洗菜，她同意了，但早晨在河边刷牙洗脸的习惯，又过了两年才改掉。\n\n98年大洪水时，河水暴涨。天井里的水没到脚肚。中午做菜时，找个脸盆到院子里捞条肥鱼，下锅红烧。现在想来，觉得好生奇妙。后来小河越来越脏，再也见不到鱼了。有一年，邻居大叔在河里捞起一只大甲鱼，大伙都赞叹是个奇迹。\n\n每年中秋节，有个传统叫“贡月华”。在天井摆张方桌，选八样水果放在上面，通常是苹果、橘子、梨子、石榴、菱角、莲藕、西瓜和哈密瓜。人们会对着月亮祈愿。祈愿完了，奶奶端出自己炒的南瓜子、杜瓜子还有花生米，都装在一个白瓷碗里。瓷碗是奶奶一次在庙会上买来的，很便宜，人家都说她买得划算，奶奶很开心。\n\n冬日的晴天，看到奶奶拿出一只布缝的袋子，我的脸上就会乐开花。我清楚这袋子是拿来做豆沙的。奶奶会自制豆沙，以备过年前做糕点用。甜甜的豆沙，我非常爱吃，她会特地给我留出一大碗。那样的日子，天井里的空气一整天都是甜甜的。\n\n如今奶奶过世快十年了，天井也变得越来越荒芜，但这甜甜的气息未被时光冲淡，反而越来越浓，留在我的味蕾里，记忆中。"
		},
		{
			"post_id": 4,
			"title": "进步让我们离成功越来越远",
			"date_published": 1461294780.187,
			"body": "我们都有过这样的目标：用42天成功瘦身5斤；2016年我要提高自己的英语；我要每天坚持跑步；这周我要把这本书看完；我每天要在简书上写1000字……\n\n诸如此类，不一而足。\n\n但真正设定目标最后又实现目标的人少之又少（至少我身边的朋友都只是说说而已）。\n\n为什么会这样呢？\n\n事实是很多时候我们都在强迫自己做这些事情，所以我们总是在寻找停下来的理由，一旦在目标上有所进步，我们就会获得巨大的满足感，然后就把目标抛在一边，不闻不问了。\n\n在实现目标的过程中，每一次微小的进步都容易让我们放松或迷失，继而离成功越来越远。\n\n你有没有这样的经历：比如要学英语口语，你下定决心这次要好好学，然后花很多时间在网络上找资料，看有什么合适的教材，终于让你给找到了一本《英语发音13秘诀》，你在亚马逊上下单，第二天书就送到了，你激动地撕开包裹，把书捧在手心，心潮澎湃，摸着书的封面，心说，我的口语提升之路已经跨出最关键的一步，真佩服自己的执行力。然后呢？然后你就带着马上要变得口语流利的满足感，快快乐乐打游戏或者看剧去了。但实际上，通过口语教材提升自己的口语能力才是你的真正目标啊，这条路你连一步都还没走呢！\n\n我们通常相信自己的本能，在我们每一次做一件本能认为“好”的事情时，内心会产生满足感，你会获得一枚“免死金牌”，而它会诱使我们背离本来的目标。\n\n你持续一周坚持下班后到健身房锻炼肌肉，忍受着酸痛，一周后你发现胸肌略微成型了，腹部也有轮廓了，手臂更粗壮了，于是心情愉悦。恭喜你获得“免死金牌”一枚！然后你会约上三五好友聚餐，餐桌上还不忘秀一秀上周的健身成果，而把健身这个原本的目标抛诸千里之外，大鱼大肉来者不拒，而且不带负罪感，认为这是自己应得的。\n\n人们总觉得进步是好的，不积硅步，无以至千里；不积小流，无以成江海。每一次小的进步，都使我们离目标更近一步，是令人高兴的。但心理学家知道，我们总是把进步当成放松的借口。\n\n在一项研究中，心理学家告诉成功的节食者他们已经减了多少体重，然后，他们向节食成功者提供庆祝的礼物，一个苹果或一块巧克力。85%得到鼓励的节食者选择了巧克力，而不是苹果。而那些没有被研究人员提醒已经获得了进步的节食者，只有58%的人选择巧克力。另一个研究发现，如果学生觉得自己已经为复习考试花了很多时间，自我感觉相当良好，他们就更可能花整晚时间和朋友比赛。\n\n《思考，快与慢》的作者丹尼尔·卡尼曼把大脑做出判断与决策的系统分作系统1和系统2,实现目标的过程，就是两个系统的冲突。系统2是自己的长远利益，比如减肥。系统1则想及时行乐，比如吃巧克力。我们取得的进步会把原来放在长远目标上的注意力移动到取得的进步上面，暂时让我们产生满足感，此时系统2会把任务移交给系统1.而系统1会将原本较难的问题简单化处理，于是我们对事情的进展盲目乐观，造成失控。\n\n在实际生活中，这就意味着进步一小步则倒退一大步。你想存一笔钱作为旅行基金，但这同时会释放你的购物欲。想起小时候吃瓜子，我喜欢用手把瓜子壳剥去，将瓜子仁搁在一旁，等到一大堆瓜子仁时再慢慢品尝，可事实是，往往刚剥完没多少，我就全把它们扔进嘴里了。\n\n没有那件事情是水到渠成的，你会发现始终如一的保持某种状态需要付出持之以恒的努力，至少要一直耗费精力。系统2负责人们的自我控制，同时监督着系统1，有意识的专注在目标上，记住我们为什么要拒绝诱惑，可以是系统2常常处于运行状态，从而避免系统1胡作非为。如此，进步会让我们离成功越来越近。"
		},
		{
			"post_id": 3,
			"title": "借 ZeroNet 分布式网络聊聊新事物",
			"date_published": 1461294443.368,
			"body": "在月光博客读到一篇介绍 ZeroNet 分布式网络的博文，试着在上面搭建了一个博客，觉得蛮有意思。\n\nZeroNet 主要特点是去中心化，每个访客都是一个节点，承担存储内容和传输带宽，如同我们使用电驴和BT下载一样，其好处是因为参与的人都在贡献自己的计算机资源，所以访问速度很快，将来随着链接的节点增加，访问速度会更快，而且你用自己电脑建的博客，只要有人浏览过，即使之后关掉电脑，别人仍可以继续访问该博客。还有一个好处是可以规避第三方审查删除内容。\n\n看了上面的介绍，有人或许会联想到比特币。\n\n比特币是一种由数学计算保护的，基于 P2P 协议的数字货币，数字签名用来授权每笔交易，所有权通过交易链传递，并且这些交易的顺序在区块链中被保护。其具有不受政府干扰、匿名性等特点。\n\n这里我想借着 ZeroNet 的出现，谈谈人们对于新生事物的态度。\n\n大众对于自己不了解看不透的东西，习惯持怀疑态度，使力找它的坏处，说服自己离得远远的，之所以如此，经验使然。但经验往往不能带你走进未来，经验更多时候只会误导你变得狭隘，等新事物成为显而易见的趋势，流行开来时，追悔莫及。\n\n关于思想和新技术的关系，可以读一读下面这篇文章：\n\n[人类这五百年的进步史，是思想拼命追赶技术的过程](http://36kr.com/p/5041631.html)\n  \n两百年前，工业时代，欧洲的工人们曾因为机器让他们失业而砸毁机器，但工业革命的大潮不可阻挡，聪明人应该抢在大多数人前头去学习如何操纵一台机器。\n\n比特币的发明原本是为了方便交易，但却被投机之徒利用，曾经由 10 美元涨到 1000 美元，这是典型的泡沫。但谁又能否认比特币的出现是一种创新呢？直到现在，我们还在使用数千年前发明的硬币，比特币可能是存在泡沫，但我们也确实需要更好的交易系统。\n\n网络社会的崛起，让各个领域相继发生了自下而上的变革，互联网像一股水流，其影响力并不局限在某几个垂直领域，而是渗透社会的各个层面，悄然无声地改变着世界。\n\n有数字时代麦克卢汉之称的保罗·莱文森认为：媒体发展就是朝着人性化方向进行的。\n\n新的事物之所以能够出现，并淘汰旧的事物，核心在于满足人的需求。但每种技术都有缺陷，根本不存在完美的技术，因此不该为此去批评技术，正如智能手机革了传统手机的命，因为智能手机更符合人性的需求，可是智能手机耗电很快，在紧要关头停机能把人折磨疯。这时候我们有了充电宝作为补充，如今市面上甚至还有一款充电五分钟，通话两小时的手机，故问题都是可以解决的，而解决问题的过程即使满足人性需求的过程。\n\n所以我们不能要求一种新事物刚出现时就十全十美。印刷机诞生一个世纪后，才出现报纸，然后印刷机的价值才真正体现出来。\n\n如今比特币和暗网的结合方便了洗钱、赌博、毒品军火交易、甚至人们还可以在暗网上雇佣杀手等等，这些是不好的事情。但从另一方面而言，比特币作为金融工具，具有极大的潜力，可以带来金融方面的创新。金融和互联网一样，都具有水流的性质，两股水流交汇到底能创造怎样的奇迹呢？\n\n还有暗网以及前面介绍的 ZeroNet 网络，它们能规避第三方的审查的特点，使其对于生活在某些国情特殊地区的人民具有特别的意义， ZeroNet 这样一个 P2P 分布式网络能够让人们在虚拟世界自由的发声，言论的自由在某种程度上，对政府也是一种约束，而这种约束反过来，又可以使个人获得更多的权利和自由以及尊严。纵观媒介的发展，其从来都不是一个简单被动反映社会变革的通道，事实上，媒介在主动推动社会变革上，始终发挥着积极作用。\n\n技术是中性的，可造福于人，也可带来不幸，但技术无疑给我们带来了更多的选择，如果没有互联网，我们连选择的余地都没有，多一种选择总是好的。"
		},
		{
			"post_id": 2,
			"title": "关于冒险",
			"date_published": 1461217265.568,
			"body": "关于冒险\n\n今早在朋友圈看到一则消息，说的是乐视好几个项目的融资，都是贾跃亭担保，评论说他嗜血融资，冒死大跃进。\n\n根据我的经验，这源于人类天性的一个重要方面。在生活中，除非我们采取行动，否则我们就会灭亡。不过行动要冒无法预见的后果，人们在多大程度上愿意冒险，取决于他们认为可能得到的收益，有效的财产和个人权利通常会降低不确定性，并扩大冒险和行动范围，后者能带来财富。\n\n乐视极有可能成为下一个BAT。"
		}
	]
}