{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"category": "applications",
			"title": "Total Commander 8.52 Final [Multilanguage] [Wincmd.key] [AT-TEAM]",
			"torrent_imdb": "",
			"body": "Total Commander is a file manager replacement for Windows, Windows Mobile and Android. It offers multiple language support, search, file comparison, directory synchronization, quick view panel with bitmap display, ZIP, ARJ, LZH, RAR, UC2, TAR, GZ, CAB, ACE archive handling plus plugins, built-in FTP client with FXP, HTTP proxy support, and more. Total Commander also includes a tabbed interface and a versatile multi-rename tool with regular expression support. The program is extensible by programmers via an open plugin-API and it has the ability to bind external programs for viewing or editing files. Many plugins are freely available for e.g. different packer formats or file viewer for special file formats. As well, a large variety of internal functions (commands) are available and ready to assign to icons, although some study might be needed to discover them.\n\nAdditionally, Total Commander can be made portable via a special installer for USB and U3 disks.\n\nFeatures of Total Commander:\n- Two file windows side by side\n- Multiple language support\n- Enhanced search function\n- Compare files / synchronize directories\n- Quick View panel with bitmap display\n- ZIP, ARJ, LZH, RAR, UC2, TAR, GZ, CAB, ACE archive handling + plugins\n- Built-in FTP client with FXP (server to server) and HTTP proxy support\n- Parallel port link, multi-rename tool\n- Tabbed interface, regular expressions, history+favorites buttons\n- Thumbnails view, custom columns, enhanced search\n- Compare editor, cursor in lister, separate trees, logging, enhanced overwrite dialog etc.\n- Unicode names almost everywhere, long names (>259 characters), password manager for ftp and plugins, synchronize empty dirs, 64 bit context menu, quick file filter (Ctrl+S)\n- And many more!\n\nTotal Commander comes in the following languages: English, German, French, Italian, Danish, Swedish, Norwegian, Dutch, Spanish, Czech, Russian, Polish, Hungarian, and now also Hebrew, Greek, Afrikaans, Catalan, Turkish and Ukrainian! The help is available in English, German and French (separately).",
			"magnet": "magnet:?xt=urn:btih:eu2rlnp2xgcvuqo74ek6cszuomvefz6y&tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80%2Fannounce",
			"torrent_file": "data/users/1GKcuPnG7BvCPpLs7BCX9xUArhPVpj67M1/",
			"added": 1470762503
		}
	],
	"topic_vote": {
		"23_1DSRkwr6NuKqMsCBAk38fDf9THshBX4Y1W": 1
	},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}