{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1636765653_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "I've been doing some light reading on Russian history lately. I see some clear parallels between what corporate entities and the wealthiest 1% of the population are doing and what the Romanov clan did to create a country populated by serf peasants. In the Russian case, generations of big families and very little land to pass down created the necessary unrest for revolution. Perhaps Trotsky is correct, we must constantly participate in permanent revolt and revolution. I fear that for many in the first world that opportunity has passed, and our living conditions will get much worse before we are motivated to organize against our oppressors. Who are the 'we'? Those who are attempting to see their way out of the dogma by being here, participating in cryptocurrency to unseat the banks, build trust with the people in your communities, refuse to support big corporate interests who abuse the individuals you know by not giving them your money in exchange for anything. I want to meet like minded people on this platform. Let's talk about what we can do. Mail me, no personal info, but let's start a dialogue.",
				"added": 1637119962
			},
			{
				"comment_id": 2,
				"body": "> [nyzdoctn7g4obdcz](#comment_8_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha): I've reluctantly given up previous ideas of normalcy, and now admit many of these \"conspiracy nuts\" were right all along. While it's not yet clear as to the best way to proceed, I feel at minimum we need to take our schools and neighborhoods back. [...]\n\nI think you have some really solid ideas here, and I agree that there must be some mechanism of threshold to separate people of quality from people who will not contribute to the greater good of the community. Though there are some compelling arguments for our inherent sensitivity to racial differences, (read Robert Sapolsky's Behave, I will gladly share a digital copy with you) I think race is not the correct metric. I don't know what is, essentially churches have used belief in various fairy tales to decide who can have membership. I suggest that community dissent is the most powerful tool. You meet as a community at least weekly, you eat together, share your lives, assist each other with challenges and if the community as a whole observes behavior that is not worthy of the standards generally agreed upon you and your kin are voted out. Leadership is one term only, perhaps one person per 10,000 and paid at a strict and audited rate. I think the bigger problem is government right now. Governments all over the world are as Chomsky calls them, long shadows of our corporate overlords, and the police are the government's gestapo. They watch you, they pick on randomly selected disadvantaged members of our society to keep us all compliant. The government calls tightly knit self sustaining communities compounds, and we all know how that usually ends for the people involved. I'm not advocating for strange cults to be tolerated, there must be thresholds for everything, but right now the governments of the world, if they aren't all one in the same, are seriously out of control.",
				"added": 1637161601
			},
			{
				"comment_id": 3,
				"body": "> [nyzdoctn7g4obdcz](#comment_10_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha): I'd like to learn more about the Amish. They seem to have a successful model excepting their inability to defend themselves. Refining that model would give you the tools for building resilient communities ANYWHERE. Perhaps even the moon or mars. [...]\n\nThere is force in numbers, and in manufacturing centers. How long do you think any state's military will last without fuel or supplies if that fuel and those supplies are not granted by the people who work to manufacture them? Ask the Germans about that, it didn't go well when they tried to invade Russia, strategy galore, resources few.",
				"added": 1637164832
			}
		],
		"1637126540_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha": [
			{
				"comment_id": 4,
				"body": "Oh man oh man! You are talking about culture and defining it as skin color. Do some people with deeper pigment in their skin participate in a culture that rewards and incentivizes crime? Sure. Is that crime motivated by lack of opportunity and oppression? In some cases, yes. Skin color, friends is merely an adaptation in homo sapiens (our species, ALL of us) to deal with intense equatorial UV radiation. It literally protects folic acid in a pregnant woman's blood, making a proper birth more likely. Look it up. Stop being ignorant cave people. Find a better way of labeling trash pieces of shit and disposing of them regardless of their skin color.",
				"added": 1637296896
			}
		],
		"1637305080_18DQw1RXP4gQcqPcYrxZEPzc55fXAv16eQ": [
			{
				"comment_id": 5,
				"body": "Welcome! This in my humble opinion, is the internet as it once was in the beginning, and as it should be from here forth! Move your data and log folders to an encrypted volume, use an upstream tor router and tor always mode, and enjoy!",
				"added": 1637336698
			}
		],
		"1637356810_19WSeHt4WNqbUNWahvcMwfwdjE1wDxmnjt": [
			{
				"comment_id": 6,
				"body": "Anyone who eats meat \"likes\" to kill animals, or at least allows the slaughter of animals by purchasing the products...what does that mean?",
				"added": 1637367949
			}
		],
		"1637349877_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha": [
			{
				"comment_id": 7,
				"body": "So a 17 year old boy with AR15 kills two unarmed people \"responding\" to a protest, the association with the white supremacist organization Proud Boys scares the judge away from convicting him of manslaughter and you call that justice?! I hope I am never on the receiving end of this justice. There are people imprisoned for killing intruders in their own home because clear and present danger was not clearly enough established in the case, how can this acquittal stand when so many laws were blatantly broken ending with death and injury in a public place?",
				"added": 1637614913
			}
		],
		"1636071087_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 8,
				"body": "I really concerned about Antibody Dependent Enhancement (ADE) This syndrome has been seen with other viral infections like Dengue Fever. Essentially over time the antibody response from the vaccine in the body becomes weaker. When an infection occurs the remaining antibodies reduce competition by eliminating weaker viral bodies and the remaining stronger viral bodies produce more profound disease. Once vaccinated, the continuous booster will be the only way to avoid this, and if they stop producing them? Not only is this a threat to the vaccinated who will be the first to have severe acute disease, but the mutations from these infected people will threaten the entire population. The media claims the non-vaccinated are a threat to the vaccinated, however the truth is exactly the opposite. The vaccinated are a menace to themselves and everyone else. The medical community KNOWS this. The agenda doesn't add up unless there is a more ominous outcome we as a society are marching towards. The US is taking public money and awarding it to individuals and businesses to incentivize vaccination, when was the last time the US government ever gave a shit about anyone but the wealthy elite, unless it is to preserve a class of subservient serfs?",
				"added": 1637616569
			}
		]
	},
	"comment_vote": {
		"11_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha": 1,
		"30_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha": 1,
		"6_1Q3bW6Z7c5Fe8Nnr9T93pEBgSrR5erPgyk": 1,
		"74_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": 1,
		"4_1Q3bW6Z7c5Fe8Nnr9T93pEBgSrR5erPgyk": 1,
		"6_1PB1YKkXjDp7fy4WC1bB9iw6V9Hp2thxWN": 1,
		"14_14a6MrpmfdWZ9543vTNP8Co6Fa4S7M9Mq9": 1
	}
}