{
	"next_comment_id": 9,
	"comment": [
		{
			"comment_id": 1,
			"body": "Плагин для фокса для подмены шлюза, можно использовать для перенаправления на любой другой шлюз. Не так страшно, если один откажет. Лучше конечно, если было бы можно использовать универсальные ipfs-ссылки, но для этого нужна популяризация.",
			"post_id": 35,
			"date_added": 1487720296
		},
		{
			"comment_id": 2,
			"body": "> [dmi](#comment_8_1QCcM4agXg7FRWFzojQbbdLwvXBYzDk8P7): А почему не довести до ума опциональные файлы?\n\nВ перспективе IPFS лучше для хранения файлов.",
			"post_id": 35,
			"date_added": 1487813077
		},
		{
			"comment_id": 3,
			"body": "Чем опциональные файлы. Отсутствием лишнего дублирования, универсальностью, модульностью и большей популярностью.",
			"post_id": 35,
			"date_added": 1487852141
		},
		{
			"comment_id": 4,
			"body": ">и если автор ушел в долгий офф, сервис ipfs издох, картинки накрылись медным тазом... Дублирование однако не всегда зло\n\nНе то. Там то вполне держится несколько копий, но они все по общему пути. А опциональные файлах могут быть одинаковые в двух разный сайтах, и будут храниться две копии. И в случае утери одного, ZN не будет ничего знать о том, что вон он, есть такой файл.",
			"post_id": 35,
			"date_added": 1487854747
		},
		{
			"comment_id": 5,
			"body": "Это смотря что понимать под \"нет красного\". В палитре цвета красный есть, например.\n\n>Оптическая иллюзия\n\nВосприятие сплошь из таких иллюзий и состоит.",
			"post_id": 41,
			"date_added": 1488466556
		},
		{
			"comment_id": 6,
			"body": "Так в сером есть красный.",
			"post_id": 41,
			"date_added": 1488477605
		},
		{
			"comment_id": 7,
			"body": "> [balancer73](#comment_28_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): \n> RGB-модель не имеет ничего общего с природными цветами\n\nНо дисплеи работают именно с ней. Или пример серого без красной составляющей?\n\n> и довольно мало общего с физиологией зрения.\nНо цветное зрение тоже вполне работает на смешивании цветов. Так что красная составляющая серого тут может быть вполне причем.",
			"post_id": 41,
			"date_added": 1488514631
		},
		{
			"comment_id": 8,
			"body": "> [balancer73](#comment_29_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): При чём тут дисплеи? Такой же эффект будет и если распечатать картинку в CMY. И уж там красной составляющей не будет :)\n\nА бумага?",
			"post_id": 41,
			"date_added": 1488544929
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"39": 1
	}
}