{
	"title": "blog de VULONKAAZ",
	"description": "ZeroBlog d'un francophone qui en avait marre de devoir chercher des hebergeurs pour heberger ses sites web.\n[site principal](/vulonkaaz.bit)",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 13,
	"demo": false,
	"modified": 1450025986,
	"post": [
		{
			"post_id": 11,
			"title": "ZeroMail",
			"date_published": 1449911228.504,
			"body": "J'ai set up mon compte ZeroMail, vous pouvez maintenant m'envoyer un message sur mon ZeroID vulonkaaz@zeroid.bit"
		},
		{
			"post_id": 9,
			"title": "test i-doser : Clouds (2e écoute)",
			"date_published": 1448800084.152,
			"body": "Hier soir j'ai retesté Clouds\n\nconditions: bien au chaud dans mon lit, j'avais comme lumière la big LED de mon PC et les volets sont pas fermés\n\npendant la dose: sensation de confort, je croit que je me suis endormi un peu avant la fin\n\naprès la dose: J'ai dormi 12h, j'avais lancé la dose à 0:12 je me suis réveillé il était 12:20 j'ai dormi 12h.\nEt pendant 2h après le réveil j'avais un peu mal a la tête"
		},
		{
			"post_id": 8,
			"title": "test i-doser : Clouds (unofficial)",
			"date_published": 1448706466.633,
			"body": "Jeudi j'ai testé ce fichier i-doser: http://i-doser-x.vraiforum.com/t5461-Clouds.htm\n\nconditions: Le soir avant de dormir, tous les volets fermés, mes camarades de chambres sont soit en train de trainer sur twitter, soit en train de jouer à la 3DS, je prends un de mes smartphone, branche des écouteurs dessus et lance la dose\n\npendant la dose: C'était il y a deux jours donc je ne me souvient pas de tous les détails. J'ai une deuxième personnalité qui concentre toutes mes émotions positives(un peu l'inverse de ma personnalité principale) et pendant toute la dose c'est cette personnalité qui a pris le dessus sur l'autre et impossible de revenir a mon autre personnalité. Je me souvient aussi que vers le milieu de la dose j'ai entendu des sons qui me semblaient different de ce que j'entendais d'habitude avec i-doser et une soudaine envie de rire qui vient avec\n\nredescente: Le lendemain matin j'était encore plus de mauvaise humeur que d'habitude et à un moment [j'ai carrément ragequit l'IRL](https://loadaverage.org/conversation/7345323)"
		},
		{
			"post_id": 7,
			"title": "Nouveau pixel-art",
			"date_published": 1448211548.233,
			"body": "![pixel-art](https://loadaverage.org/file/02cd9b8a1aa1752ccabfcdaebc5365b7c9094a79413a87fd3a11ba634bee881d.png)\n\nPour mes autres pixel-arts: https://vulonkaaz.deviantart.com/"
		},
		{
			"post_id": 4,
			"title": "La vie du VULONKAAZ #1",
			"date_published": 1442072546.316,
			"body": "Ça fait longtemps que j'ai rien posté sur ce blog et entre temps il s'est passé beaucoup de chose dans ma life\n\nJe suis passé en première STI2D option SIN, ce qui veut dire que je fait enfin quelque chose d’intéressant pour moi à l'école.. Enfin pas pour le moment, mon niveau en informatique est très très loin devant celui des profs et des autres élèves de la classe et pour l'instant j’apprends vraiment rien en SIN (mais au moins je dort bien en classe et on s'amuse bien à bidouiller les PC à l'insu du prof). Aussi je suis interne ce qui me permet de ne pas avoir à supporter mes parents tout les soirs, l'internat de mon lycée est assez cool et je n'aurait pas pu tombé dans une meilleure chambre, juste à côté des douches, la plus grande de tous l'internat et les gens avec moi sont cool\n\nBref, ma vie commence enfin à devenir intéressante et j'ai recommencé à avoir une vie sociale. J'ai aussi recommencé à avoir une vie sociale sur le net, je suis généralement sur le MUC jabber bite@salons.cappuccino.uk.to, mon adresse perso c'est vulonkaaz@movim.eu et j'ai aussi un compte [twitter](https://twitter.com/firedpenguin) et un [GNU/Social](https://loadaverage.org/firedpenguin),  j'y suis 24h/24"
		},
		{
			"post_id": 3,
			"title": "Ancien site hors ligne",
			"date_published": 1438103916.93,
			"body": "Mon ancien site web est enfin hors ligne, sHost a mis quasiment un mois pour se rendre compte que je les avais complètement abandonné\n\nC'est aujourd'hui que commence réellement cette nouvelle ère dans ma vie d'internaute, les éléments de mon ancienne vie sont effacé et tout est en place pour que je puisse repartir de (presque) zéro"
		},
		{
			"post_id": 2,
			"title": "Nouveau Blog",
			"date_published": 1437243498.565,
			"body": "Après wordpress.com, shost.ca j'ai décidé de mettre mon blog sur un autre reseau que HTTP qui est trop centrallisé et trop galère à trouver un hébergeur\n\nMe voilà donc sur ZeroNet, un reseau sans CGU où je ne risque pas de me faire bannir et où les spambots sont encore très peu nombreux\n\nJe suis aussi sur twitter @firedpenguin et il y a aussi mon ancien site web firedpenguin.shost.ca mais pour le moment il est suspendu psk j'ai pas repondu à un mail d'avertissement(ils me parlait d'un problème de spambots, problème que j'avais réglé mais \"oublié\" de repondre au mail)"
		}
	]
}