{
	"title": "USSR-Russia. 1988-2018",
	"description": "Timeline",
	"links": "*   [СССР-Россия. 1988-2018](/19mXW2Uu8GpqqifpQ11dwf6JEGNiZEkj5S/) — русская версия этого блога\n*   [Broken English blog](/144W6itCd6jUqHDx5SDjbFaRdTnh4gRBBA/)\n*   [Politics blog](/17ogL1aD6546DYwtb6UnMhF4hETaHBj6yD/)\n*   [Military blog](/14UqHSCXV6mF5UKcqg1cR7eg4uUPCSGZtP/)",
	"next_post_id": 10,
	"demo": false,
	"modified": 1531897927,
	"post": [
		{
			"post_id": 9,
			"title": "Nikolskaya street",
			"date_published": 1531897888.892,
			"body": "Nikolskaya street (Moscow) in the 1990's and how it looks in these years.\n\n![photo_2018-06-22_15-31-51.jpg (960x638)](data/img/post_9_photo_2018-06-22_15-31-51.jpg)![5346790.jpg (1200x800)](data/img/post_9_5346790.jpg)​​​​​​​"
		},
		{
			"post_id": 8,
			"title": "Campground near the Kremlin walls",
			"date_published": 1531896410.626,
			"body": "Campground near the Kremlin walls, 1990\n\n![photo_2018-05-23_13-16-22.jpg (800x572)](data/img/post_8_photo_2018-05-23_13-16-22.jpg)"
		},
		{
			"post_id": 7,
			"title": "School",
			"date_published": 1517783768.619,
			"body": "Another place where the changes were very bright. School. Soviet schools were quite utilitarian in comparison with modern schools. But there were a lot of them. Even many small or inaccessible villages had their own schools. When I went to rural school in 1980, there were 7 students with me in my class. In the classroom, which was three years older than mine, there were only two girls. The whole class is two people :) It was practically individual training :D In cities, of course, there were also large classes, in some cases up to 30-40 students. Schools were considered a very safe place. Children already in the first class went to school from home independently, sometimes for several kilometers. And parents did not worry that something bad could happen to their child. Fences around schools were purely symbolic. And often absent at all.\n\nAfter the beginning of perestroika, and by the time of the collapse of the USSR, the situation has changed a lot. In schools, began to appear drug addiction, crime, alcoholism. I already did not find this period, because I graduated from school in 1990\\. But, of course, I've heard a lot about this period from relatives and friends who studied at school at this time or whose children were studying there. And my mother is a teacher.\n\nThen, education in Russia underwent a major alteration. Schools became much smaller in number, but they became larger. Around the schools appeared fences. At the entrance to the school sits guard. Especially after Beslan, when the Chechens attacked the school, which resulted in the death of more than 300 children. In recent years, schools have undergone serious repairs, re-equipment with the latest equipment. But the main trouble is the very low prestige of teachers. Low salaries of teachers, low social status. This is a very big problem for modern Russia.\n\nSoviet schools looked like this in 1988:\n\n![1.09.1988-1024.jpg (1024x803)](data/img/post_7_1.09.1988-1024.jpg)\n\n![image053.jpg (1200x850)](data/img/post_7_image053.jpg)\n\nAnd this is what my rural school looks like today:\n\n![DUF0zBtX0AAyG8c.jpg (1200x675)](data/img/post_7_DUF0zBtX0AAyG8c.jpg)\n\nSchools look much better today than in the USSR. But here the level of education has become noticeably weaker :-/"
		},
		{
			"post_id": 6,
			"title": "1992-2017. Moscow",
			"date_published": 1516467312.523,
			"body": "Perhaps, while I take a pause, so that all this my work does not disappear, I will save this material as a separate blog in Darknet (ZeroNet). I'll continue later. I hope this is interesting :) Lastly, two photos. Moscow in 1992 and Moscow in 2017 (again, my personal photo).\n\n![38fd4959652096cef922f4f7df6d0f75.jpg (720x479)](data/img/post_6_38fd4959652096cef922f4f7df6d0f75.jpg)\n\n![20170812_160416.jpg (1200x675)](data/img/post_6_20170812_160416.jpg)"
		},
		{
			"post_id": 5,
			"title": "1991. Putsch.",
			"date_published": 1516467232.343,
			"body": "And this is just a photograph without a deep background :) 1991 year. The failure of the putsch of the State Emergency Committee, which tried to preserve the USSR. On the plate the slogan: \"Down with the CPSU!\"\n\n![06-4371520-13.jpg (800x582)](data/img/post_5_06-4371520-13.jpg)"
		},
		{
			"post_id": 4,
			"title": "1994-2018. Grozny. Chechnya.",
			"date_published": 1516467082.642,
			"body": "It will take a long story to break through a thick layer of mythology.\n\n![huge.jpeg (814x643)](data/img/post_4_huge.jpeg)\n\n---\n\nRussia after the collapse of the Soviet Union was very weak. The USSR was, in fact, a confederation of independent states. Therefore, when the power weakened, it easily fell apart. Russia is also a composite state, a federation of several republics. When the republics of which the USSR was made became independent, the tendencies towards separatism also began in the republics of Russia. Especially, after Yeltsin said - \"Take as much sovereignty as you can swallow.\" The Chechen Republic was extremely nationalistic, they did not like Russians, and it almost immediately gained not legal but actual independence. Alas, but one independence is not enough to feed and rally people. Chechnya actively cultivated a Russian image of the enemy. Ethnic cleansing began. Russians were killed, expelled from the republic, taken into slavery, publicly executed. Exact numbers will no longer be ever, but it is believed that in Chechnya at that time of genocide, about 30,000 Russians were killed. And another 200,000 Russians fled to Russia, leaving homes and property. But Russia was so weak that it did not do anything even after such events.\n\nBut this was not enough. And Chechnya began to attack neighboring regions and commit acts of terrorism in Russia itself. In 1994, Russia tried to bring order in Chechnya by force. Unfortunately, almost all Soviet weapons in the territory of Chechnya went to the militants. All of them under the USSR passed military training. Their commander, Dzhokhar Dudayev, was an experienced Soviet general. And so the war was very close on equal terms. Here is a photograph of what Grozny turned into after the Chechen troops were defeated.\n\n![maxresdefault__1_.jpg (1280x720)](data/img/post_4_maxresdefault__1_.jpg)\n\nTwo Chechen wars continued from 1994 to 2000\\. In 2000, Chechen troops and gangs, in general, were defeated. And the pro-Russian government was brought to power. The process of restoration of the region began. This then for many years caused much resentment among Russian nationalists. Their favorite slogan for many years: \"Enough to feed Chechnya!\" But the result is on the face. The terrorist attacks in Russia have practically ceased, and Grozny today looks like this:\n\n![119ssii.jpg (1200x699)](data/img/post_4_119ssii.jpg)\n\n![city.jpg (1200x801)](data/img/post_4_city.jpg)"
		},
		{
			"post_id": 3,
			"title": "1990. The refugee camp near Red Square.",
			"date_published": 1516466922.076,
			"body": "But, just two years later. 1990 year. The refugee camp near Red Square.\n\n![20121221103319316.jpg (700x465)](data/img/post_3_20121221103319316.jpg)\n\n* * *\n\n![20130703111221440.jpg (903x605)](data/img/post_3_20130703111221440.jpg)\n\nAnd here is the red square in our time. I specially publish here not some official photo, which you have seen so much, but just a photo of my daughter with a walk :)\n\n![20140409-1902-img_8407.jpg (1200x801)](data/img/post_3_20140409-1902-img_8407.jpg)​​​​​​​"
		},
		{
			"post_id": 2,
			"title": "1988. Contest \"Moscow beauty\"",
			"date_published": 1516466841.024,
			"body": "I'll start with pictures to draw attention ![:)](http://www.usmessageboard.com/styles/default/xenforo/clear.png):)\n\n1988 was the year when the USSR still seemed inviolable, but the processes of its reorganization were already in full swing. The iron curtain collapsed and Western values poured into the USSR. Cinema, literature, TV shows, beauty contests ... It was in 1988 in the USSR that mass beauty contests began at all levels, from local clubs to the official state level :)\n\n![Lenin_na_pervom_konkurse_krasoty_v_SSSR_1988_god_4.jpg (674x910)](data/img/post_2_Lenin_na_pervom_konkurse_krasoty_v_SSSR_1988_god_4.jpg)\n\n* * *\n\n1988\\. Contest \"Moscow beauty\"\n\n![Moskovskaya-krasavitsa-88-1.jpg (938x864)](data/img/post_2_Moskovskaya-krasavitsa-88-1.jpg)"
		},
		{
			"post_id": 1,
			"title": "About this project",
			"date_published": 4672140240,
			"body": "Over the past 30 years, Russia has gone through a very difficult path. There are few people in the world who imagine this process. And not only in the West, but many people forget this already in Russia itself. Also, very many who knew Russia only in the 1990s, are judged on it for that period. In American forums, I tried to illustrate this path with individual photographs that most emphatically emphasize the changes that are taking place. Without any specific logic and not in time sequence. In the calculation for a long process :) To work is not wasted, decided to multiply it in some other forums and fix it \"forever\" in ZeroNet :) The ease of cloning blogs and clearly expressed themes directly dictate the institution for this task of a separate blog :)\n\nI hope someone will be interested. Do not hesitate to comment."
		}
	]
}