{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Sarkozy à Assad : « On va mettre votre pays à feu et à sang ! »",
			"body": "Pour un pipeline:\n\nhttp://www.agoravox.tv/tribune-libre/article/sarkozy-a-assad-on-va-mettre-votre-70914",
			"added": 1476451142
		},
		{
			"topic_id": 2,
			"title": "Les tenants et aboutissants de la guerre en Syrie",
			"body": "Loin, très loin de ce que nous racontent les médias mainstream.\n\nArticle complet et récapitulatif:\n\nhttp://www.dailysabah.com/columns/merve-sebnem-oruc/2016/10/15/turkish-stream-dynamics-in-the-region-changing-once-again",
			"added": 1476644804
		}
	],
	"topic_vote": {
		"1_17ZQRvuYwxUj8rUVb74fz5NWuW4g7WwJzp": 1
	},
	"next_comment_id": 12,
	"comment": {
		"1_1JDqkJrKnMkfQm3t4sygbSq2yc6arFfxCw": [
			{
				"comment_id": 1,
				"body": "Oui, un VPN est obligatoire. Y en a pour 4 euros par mois voire moins. Il faut prendre un VPN qui comprend l'ouverture de ports pour le P2P.\n\nTu as sur zeronet des sites de torrent en magnet link. Pas moyen de mettre le serveur down comme pour kickass ou torrentz. Il y a déjà pas mal de contenu. Tout les blockbusters récents doivent y être. \n\nFreenet est viable en terme de vitesse (environ 300 Ko/s) et d'accessibilité (ce n'est pas très compliqué). Par contre en terme de contenu c'est moyen. Il y a certain films récents qui n'y sont pas. Mais au cas où s'il n'y avait plus le choix cela pourrait se développer sur freenet qui a 15 ans d'experience. Freenet est très stable pour le contenu fréquemment consulté (comme les films).\n\nI2P a un client torrent intégré: Snark. Il y a 2 sites eesites intégrés aussi: difftracker et postman. Tout les films et série à succès récents y sont. Ca marche plutôt bien mais c'est peut être moins résistant que freenet puisque cela passe par des tunnels donc moins de noeuds potentiels à bloquer par la MPIAA.\n\nSinon il y a le bon vieux réseau edonkey. Toujours pas mort et fonctionnel. Il y a tout les films récents. ",
				"added": 1476300103
			},
			{
				"comment_id": 2,
				"body": "> [greatesick](#comment_2_1MaFKfB2HzmRfYNREf4oQN6cWr8hr8jkce): mais planespherev2 si un VPN est Obligatoire pour toi ca peut gaspiller des addresses IP C'est Plus TOR pour Moi.\n\nLe problème de Tor est que parfois il est  bloqué sur certains sites du clear.\n\nDe plus Tor est assez difficilement compatible avec freenet par example.\n\nEnfin le gouvernement (Cazeneuve) a déjà parlé de bloquer Tor. Mais comme il existe 20000 VPN de part le monde cela va être beaucoup plus difficile pour eux de bloquer tous ces VPN.\n\nMais je ne fait pas de Tor bashing. J'utilise Tor en plus d'un VPN.\n\nC'est quoi cette histoire d'IP? Avec ipv6 il y aura toujours assez d'IP que je sache. ",
				"added": 1476359011
			}
		],
		"2_18XDV3MuaGGQFAdeBNgcDUkviz2p28RsKB": [
			{
				"comment_id": 3,
				"body": "Euhh...?\n\nJe veux pas paraître vieux jeux ou à coté de la plaque (je télécharge pas beaucoup de musiques), mais.....\n.......\n eDonkey?\n\nC'est marrant ce réseau P2P est tellement vieux que beaucoup ont oubliés, voire sont trop jeunes pour le connaître. Mais ils n'ont jamais réussit à abattre la partie décentralisée (KAD), ni même la partie serveurs.\n\nC'est d'ailleurs un filet de secours (entre autres) au cas où ils démonteraient définitivement les sites torrent.",
				"added": 1476385644
			}
		],
		"1_1EMVG4bZxeXJFHf1oUQosLvGyV6dTQeJgs": [
			{
				"comment_id": 4,
				"body": "Soral c'est bien mais il ne faut pas s'arrêter là. \n\nLa suite logique c'est Francis Cousin.\n\nEt là on apprend que les juifs ne sont pas une entité conspiratrice mais  l'élite du Capital. \n\nS'il n'y avait pas les juifs à la tête du système capitaliste, il y aurait une ou des autres communautés à leur place qui ne seraient pas forcément mieux.",
				"added": 1476553149
			},
			{
				"comment_id": 5,
				"body": "> [joe1](#comment_1_1Mek75J11YRr1NabQfvuu9MiTT46K55yyz): Si Dieu avait exaucé toutes les prières de son peuple, il ne serait restés que des Juifs sur la terre ; car ils détestaient toutes les nations, ils en étaient détestés ; et, en demandant sans cesse que Dieu exterminât tous ceux qu'ils haïssaient, ils semblaient demander la ruine de la terre entière. (Voltaire, Essai sur les moeurs, Tome 1, page 197)\n\nInterroge toi aussi sur la nature de Jehovah.\n\nIl est possible qu'il ne soit pas celui que tu crois. ",
				"added": 1476885915
			}
		],
		"7_1G4nMD7txaYAvdpDeroZ9f67K3gtHsGn8H": [
			{
				"comment_id": 6,
				"body": "Le gouvernement a la cassette (nos impôts). \n\nLa police protège (surtout) le système, et au delà, le mode de production: le capitalisme.\n\nSi la police n'est pas contente, il suffit au gouvernement de prendre un peu dans la cassette et de le donner à la police. Pour combler le manque, il faudra créer de nouvelles taxes ou augmenter celles déjà existantes. \n\nLa police en règle générale me fait penser à la garde prétorienne de l'empire romain. Sauf que de nos jours ils ne protègent plus l'empereur moyennant rétribution, mais le système dans son ensemble.",
				"added": 1476918293
			}
		],
		"5_1HN5pCyG5g1483VcFueZNvGv4MkA7yxjw1": [
			{
				"comment_id": 7,
				"body": "Nan ils sont pas venus pour le système social mais pour l'iphone, la voiture et les fringues de marque. \n\nDans leur bled pourrit en Afrique, ils voient des publicités pour les bagnoles dans l'unique télé du village situé dans le local commun et s'imaginent que l'europe c'est ça: que des gens riches, heureux, nantis et que tout est facile. \n\nSauf que ces idiots n'ont même pas internet et ne savent pas que la plupart des gens souffrent en france et se plaignent de la précarité et du racket fiscal. \n\nCe qui est tristement comique en ce moment c'est les migrants de la jungle de Calais relogés dans les villages de france. Maintenant ces idiots vont voir ce que c'est la vraie france. Des agriculteurs qui gagnent 350 euros par mois, des personnes agées qui ne peuvent pas payer leur médicaments, des régions sinistrés par le chomage. \n\nMais bon tu comprends ils vont rester parce que ils ont trop de fierté pour retourner en afrique. Ce serait un aveux d'échec pour leur famille et leur amis restés là bas. \n\nDe toute façon avec la disparition du liquide dans les années qui vont venir, pour le meilleur et pour le pire,  ils n'auront plus de raisons de venir: il n'y aura plus rien à voler. Pareil pour les Roms. Les smartphones sont déjà presque tous kill-switchables. Pourquoi venir? Pourquoi? ",
				"added": 1477524599
			}
		],
		"6_1HN5pCyG5g1483VcFueZNvGv4MkA7yxjw1": [
			{
				"comment_id": 8,
				"body": "Rien à voire avec le gouvernement socialo.\n\nC'est la république tout entière, qui est l'anti-France.\n\nIl faut tuer le sang pourri des français (cf. Carla Bruni). Créer l'homme nouveau, sans racines, sans histoire, hors sol. \n\nEt plus profondemment, c'est le capitalisme (dont la république n'est que l'émanation), qui vise à créer des hommes intercheangealble, modelés sur le plus petit dénominateur commun, des pièces d'usine parfaitement remplaçables l'une  avec l'autre, formattés sur le même moule, le même modèle. \n\nLe capital préfère que l'homme, la femme, l'immigré, le de-souche, soient tous intercheangeable. Cela permet de faire une pression maximale sur les salaires et de tuer dans l'oeuf toute grève générale en amont. \n\nSi les blancs font la grève, pas grave, des africains feront le boulot. \n\nC'est la logique du capital, et c'est la raison pour laquelle il faut en finir avec ce mode de production. ",
				"added": 1478439366
			},
			{
				"comment_id": 9,
				"body": "> [border0464fred](#comment_10_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): C'est ce que je me dit face a la vague de francais chiant qui imigrent au Quebec.\n\nJe savais pas que les français qui émigrent au Quebec étaient logés.\n\nAu fait si tu es Québecois en principe tu as des origines françaises non? \n\nEn revanche l'Erythréen, le Soudanais, le Somalien ou l'Afghan qui débarque en france n'a pas forcément de racine ethnique, ni même culturelle ou religieuse, en commun avec le peuple français. ",
				"added": 1482783237
			},
			{
				"comment_id": 10,
				"body": "> [border0464fred](#comment_11_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): Peutetre, je m'en fou, ca change rien. \n> \n> Les francais louent des apartement trop cher sur le plateau et creent de la gentrification. pendant qui les pauvres meurent geler sur les trotoirs.\n> Moi je m'en fou des problemes de la France. Mais vous devriez arreter de vous sauver. Les francais devraient rester en france et regler leurs probleme au lieu de venir ici et reproduire leurs attitudes de merde. On a pas de surplus pour aider les imigrants ici meme si ils pretendent etre nos cousins. J'en ai rien a foutre.\n\nMême si t'as raison sur le fond, c'est sacrément gonflé de comparer l'immigration française au Québec avec l'immigration sub-saharienne en France et en Europe.\n\nT'as entendu parler de ce qui s'est passé à Cologne pendant le nouvel an l'année dernière? Tu crois vraiment que des français feraient ça au Québec? Ils sont peut être chiant, mais le peuple français n'est pas réputé dangereux ou ripoux.\n\nD'ailleurs non seulement tu descend des français, mais là où t'es doublement gonflé, c'est que tu descend toi même d'immigrés français. Super paradoxal.\n\nMais t'inquiète pas, beaucoup de français ont compris que le Québec n'était pas très amis avec eux. Comme les Suisses ne le sont pas d'ailleurs.\n\nCe qui est d'ailleurs non justifié, car il y a des peuples qui sont plus ripoux que les français en Europe (suivez mon regard), d'autres qui sont moins productifs (je ne nomme pas mais c'est assez évident).\n\nMais bon les français on se lâche sur eux, c'est sur c'est parfois justifié mais c'est aussi plus facile que de critiquer d'autres peuples n'est ce pas...\n\nSinon t'inquiète pas, beaucoup de français ont compris qu'ils n'étaient pas les bienvenus au Québec et iront ailleurs en cas de nécessité.\n\nBeaucoup vont dans les pays de l'est ou en Russie et y sont mieux accepté que chez leurs \"cousins\" Québécois. ",
				"added": 1483037995
			},
			{
				"comment_id": 11,
				"body": "> [zerofreedom](#comment_4_1K4VbAenZNLx3J6QFZrzWFw2xoZjBYYPKv): Exactement.Les Français devraient régler leurs problèmes chez eux, plutôt que de les emporter dans un autre pays. Comme chaque immigré qui vient en France en fait.\n\nJe t'invite à passer 1 mois de vacances au coeur du département Seine saint denis en île de France ou dans les quartiers nords à Marseilles et ta critique changera peut être en compassion. \n\nQuant à règler les problèmes, si on regarde les choses en face, c'est trop tard:\n\nhttp://www.fdesouche.com/wp-content/uploads/2016/09/Graphique-drepanocytose_hd_chiffres_2015-1.jpg\n\nMais c'est très bien de donner votre avis: comme ça les français savent à l'avance où ils ne sont pas les bienvenus et quels sont les pays qui seraient éventuellement prêt à les accueillir. A condition qu'ils se tiennent à carreau bien entendu mais c'est déjà ça.\n\nDe plus j'aimerai dire à ceux qui sont francophones et qui ne peuvent pas sacquer les français : principalement Suisses et Québécois: belle image de fraternité entre peuples ayant une communauté d'identité linguistique,  culturelle, religieuse et ethnique (enfin quoique il y aura toujours des Suisses pour dire de mauvaise foi qu'ils n'ont rien à voir sur ces points avec les français, alors même qu'il descendent ethniquement d'un peuple franc et celte de la Gaule, les Helvètes, sont de culture greco-latine, comme les français, et sont aussi de religion chrétienne).\n\nEn effet, les Anglo-Saxons se serrent bien plus les coudes. Les américains n'ont aucun problèmes à ce que les Canadiens émigrent aux USA et vice versa. De plus, anglais et Australiens peuvent aussi émigrer dans n'importe quel pays anglo saxon et ils sont généralement très bien acceuilli.\n\nD'ailleurs en parlant des Anglo-Saxons, la partie francophone du Canada est en train de devenir de plus en plus petite, et même Montréal est en train de devenir de plus en plus anglophone. C'est très bien comme ça dans 50 ans le Canada sera à 100% anglophone et tu sera enfin libéré des derniers restes de culture française.\n\nMais encore une fois, personnellement je m'en fous que vous n'aimiez pas les français, je vais rester en france, et de plus c'est bien que vous dites ce que vous avez sur le coeur, comme ça ont sait à quoi s'en tenir, et sur qui on peut compter ou pas. Quoi que vous en pensiez, il y aura toujours des pays pour tendre la main aux français (Pologne, République Tchèque, Russie, Brésil, Inde) tant pis si c'est pas vous.",
				"added": 1483038524
			}
		]
	},
	"comment_vote": {
		"7_12CVtpPeZw9ch65n1msemh2dktGPHodc2M": 1
	}
}