{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1523130188,
			"title": "Site fails to download",
			"body": "For some time I have not been able to download ZeroLSTN.bit to a new computer. Therefore I can only use it on a computer where it has already been downloaded previously.\n\nWhen opening ZeroLSTN, it will first download `content.json` successfully, and most of the other files will also download. However the following 4 files fail to download, apparently because they fail checksum verification: `js/bundle.js`, `js/bundle.js.map`, `dbschema.json`, `css/main.css`. Because of this the site will stop loading and display a blank (dark grey) page.\n\nAre other people experiencing the same, or is it just me?\n\nHere a snippet from `/var/log/zeronet/debug.log`:\n```\nWorkerManager:1MQveQ..kvJ3 5.80.19.213:15441: Verify failed: css/main.css, error: Download failed, failed peers: 1, workers: 0\nWorkerManager:1MQveQ..kvJ3 82.130.48.20:16571: Verify failed: css/main.css, error: Download failed, failed peers: 2, workers: 0\nWorkerManager:1MQveQ..kvJ3 79.214.190.208:15441: Verify failed: js/bundle.js, error: Download failed, failed peers: 0, workers: 0\nWorkerManager:1MQveQ..kvJ3 212.225.203.234:15441: Verify failed: css/main.css, error: Download failed, failed peers: 3, workers: 0\n```",
			"added": 1523130187
		}
	],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1528064546_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": [
			{
				"comment_id": 1,
				"body": "It looks absolutely fantastic, great work! Also really cool how quickly the site was filled up with so much music.\n\nDo you think there's a risk that many of the songs will eventually run out of seeders, making them unplayable? And is there in this case a plan to add support for removing abandoned songs that have not been seeded for a long time?",
				"added": 1528572755
			}
		],
		"1529340445_1KF6VwFZn83rJDhgQMNigUao9EtLfzThG4": [
			{
				"comment_id": 2,
				"body": "1. Yes, everything that is uploaded to Zeronet is stored in the uploader's content.json file, which is then synced with the whole network. Although not visible in the ZeroLSTN interface, your account name will still be tied to the songs you upload. You can find this out for yourself by navigating to the Zeronet data folder on your computer, on Linux the 2010's hub is located in /var/lib/zeronet/1HLqL1eSZTRMpKLXjprjy7hFftuoAZEz1u/data/users. Here you will find all content of the hub sorted in folders by the user's Bitcoin address. You can easily do the mapping from Bitcoin address to a user name, for example by hovering the mouse over my name right above this post, and it will show you my Bitcoin address. Then just find a folder with the same address in the location above, and you'll see the content.json file listing all songs I have uploaded to 2010's hub. If you also have listened to these particular songs, you'll find the mp3 files in this folder also, if not then you'll just find the content.json file.\nIf you are concerned about privacy, create a separate ZeroID for uploading songs.\n\n2. For downloading files off Zeronet, it works the same as with regular torrents. Normally downloads will not be logged, but it is theoretically possible that the seeder of a file could be running a customized Zeronet client that logs the IP address of every person trying to download a file off them. Just like there also are copyright trolls that monitors regular torrents you can download from Piratebay. But if we assume that Zeronet is still too small to have gained the interest of any copyright trolls, you can assume your downloads will not be logged.\n\nAnd no need to apologize for asking the question. I'm sure other people reading this will also gain a deeper understanding of how Zeronet works.",
				"added": 1529349400
			}
		]
	},
	"comment_vote": {}
}