{
	"title": "El blog de XarpSanty",
	"description": "Un defensor eterno del Software Libre, la descentralización y el anonimato del Internet\n\nCanal de Telegram: t.me/zeronet_xarpsanty",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 14,
	"demo": false,
	"modified": 1535199232,
	"post": [
		{
			"post_id": 13,
			"title": "Canal de Telegram: XarpSanty",
			"date_published": 1535196438.2,
			"body": "Como quiero manteneros un poquito más cercanos no solo con ZeroNet, he abierto un canal de telegram para manteneros enterados de mis actualizaciones en el blog y otros proyecto que dentro de poco lanzaré en la red.\n\nQue sepan que no es la única red social que uso pero si la más activa. Enseguida les cuento más detalles sobre mis redes sociales, hasta luego ZeroPersonas. ;)\n\nCanal de Telegram: t.me/zeronet_xarpsanty"
		},
		{
			"post_id": 12,
			"title": "Trisquel GNU/Linux: El verdadero Ubuntu",
			"date_published": 1535115215.9,
			"body": "Muchos reconocemos a Ubuntu como el sistema operativo para el usuario común por excelencia, actualmente cubriendo gran parte del ecosistema de Linux con miles de usuarios alrededor del mundo. Desde que Ubuntu se convirtió en una empresa llamada Canonical, una pequeña parte de los usuarios sintieron que Ubuntu ya no es lo que era, una comunidad de software libre. Ahora es una empresa.\n\nSin embargo, esa comunidad sentía que debían hacer algo para salvar la filosofía de los usuarios junto a la privacidad del mismo. Sucedió el fork de Ubuntu y así llegó Trisquel, el Ubuntu libre.\n\nTrisquel a diferencia de Ubuntu, siguen al 100% las filosofías del software libre de Richard Stallman junto a la simplicidad de uso y la privacidad; siendo uno de los pocos sistemas operativos que son realmente GNU/Linux.\n\nUsando los paquetes de GNU y el núcleo Linux-libre (Una versión alternativa de Linux sin blops privativos) fue suficiente como para ganarse un puesto entre los sistemas operativos GNU/Linux recomendados de la FSF (Free Software Foundation), lo cual es beneficioso para el proyecto ya que recibirá el apoyo monetario y de desarrollo de una comunidad con un propósito en específico: Hacer de Trisquel, un sistema operativo software libre para aquellos recién llegados del mundo GNU/Linux.\n\nYo personalmente tengo Ubuntu 18.04 en mi ordenador debido a que en aquel momento, no comprendí del todo lo que significa GNU/Linux. Ahora que lo entiendo, no puedo evitar querer utilizar Trisquel debido a mi lealtad a Richard Stallman y a la FSF. Aunque me falta poco para poder descargarlo y empezar a transferir todos mis archivos y programas en Trisquel."
		},
		{
			"post_id": 11,
			"title": "Escuela con Software Libre = Escuela Sin Límites",
			"date_published": 1532018540.887,
			"body": "Bueno, ZeroPersonas.\n\nQuisiera darles a todos otra de mis visiones que tuve con el Software Libre y la educación. Sobretodo lo que fue la programación en las escuelas.\n\nSoy un desarrollador aficionado desde pequeño por simple curiosidad, tuve suerte de contar con mi padre que es informático, me traía revistas de computación que cuando lo leía con él sentía que era un gran mundo por explorar. Decidí aprender programación.\n\nCuando aprendí a programar en C#, me salió bastante leer tutoriales y páginas webs que te enseñaban programación de una manera fácil y sencilla.\nDe repente sentí como si la mente hubiera sido más ágil, los deberes de la escuela se me hacían sencillos de resolver. Eso fue gracias a la programación que fue capaz de enseñarme a resolver problemas con bastante lógica, lo cual me sentía muy orgulloso y agradecidos de ellos.\n\nMe tocó irme a la secundaria, nueva vida, nuevos amigos. En fin, nuevos problemas y examen intentarían quitarme el camino. Todo con lógica, encontraba el sentido a la respuesta.\n\nPero mis compañeros siempre encontraban problemas y por más que le ayudaban, no me entendían ni con sentido.\nLos mismo para la propia escuela, no entendían mi visión de \"libertad y descentralización en la tecnología\".\n¿Por qué? Porque se acostumbraron al mundo gracias a la manipulación de las masas y tienen miedo a esas ideas democrático e igualitario. Es fácil ser engañado si no sabes informarte, yo les dije que se informen y no me escucharon.\n\nLas escuelas se quedaron grises. Ya no sabía si continuar con mi lucha o darme por vencido...\nPero hasta ahora, continuo con la lucha."
		},
		{
			"post_id": 10,
			"title": "Retraso y mis ideas de Bitcoin",
			"date_published": 1531871388.366,
			"body": "Perdón a todos por el retraso, el caso es que tenía una fiestas con familiares y me atrasaron un poco. Así que vengo de vuelta para contaros una pequeñas ideas que se me ocurrieron sobre esta pequeña moneda virtual llamada \"Bitcoin.\n\nSupongo que no hace falta mencionar que es el Bitcoin, así que me adelantaré un poco. El caso es que últimamente se me ocurrieron unas ideas sobre esa moneda que tal vez pueda ser de ayuda.\n\nNo será una idea de software ni nada parecido, si no más bien un \"plan de integración\". Formar una pequeña red de comunidad de usuarios en nuestros queridas ciudades pequeñas. No digo a TODOS los habitantes pero si a los que se quieren apuntar al cambio.\n\n**Lo primero de todo es simple, necesitamos Bitcoins.**\nEs fácil conseguirlo mediante casas de cambios y LocalBitcoin pero con una advertencia: No comprar más de 0.05 BTC. En mi humilde opinión, la economía de mi país es más o menos inestable, por lo tanto no les recomiendo comprar más de esa cantidad si quieres empezar. No quiero diferenciar las divisas locales y la burbuja que tanto terror provoca a muchos por su desorbitante precio.\nSolo pensaremos que Bitcoin es una moneda como las demás y que siempre seguirá siendo mantenida por nuestra querida comunidad. Hay que admitirlo, las criptomonedas principales (Bitcoin, Litecoin, Ethereum o incluso Monero) vivieron para quedarse.\n\n**Lo segundo es elegir nuestros primeros miembros de la comunidad** y si a ellos no les parece posible comprar, lo repartimos; quizás sea unos amigos o familiares que conozcamos. **Hay que asegurarse que esa persona debe ser la que TÚ tengas confianza y tenga por lo menos conocimientos básicos de las criptomonedas y su verdadera funcionalidad.** De nada sirve un compañero que se interesa en el Bitcoin por \"dinero fácil\" o \"divisa de reserva\", a menos que tengas las destrezas suficientes para enseñarle la verdad y que tome la decisión de unirse o retirarse. Duele, es cierto pero te arrepentirás menos.\n\n**Lo tercero es la relación entre usuarios (Los que saben de Bitcoin) y personas que no saben de Bitcoin.**\nEs algo que depende de la situación y la clase de persona que puede ser. El objetivo es concientizar y animar a los demás mediante reuniones, charlas y eventos sobre las criptomonedas, todo con el fin de que ellos se unan al sistema financiero descentralizado.\nVentajas y desventajas del mismo dependerán la decisión entre la unión y el rechazo de la invitación. Probablemente la mayoría querrá unirse por interés económico y eso es algo que a pesar de no estar con nuestros verdaderos propósitos, puede ser medianamente aceptable si lo hace por la descentralización de su sustento económico y ver si puede mejorar su calidad de vida en una divisa más globalizada. Eso requiere mucho esfuerzo en convencer a gente, comerciantes, servicios públicos y demás entidades para que crean que unirse a esa economía del futuro significa estar más globalizados y con posibilidades de crecimiento gracias a la confianza de los habitantes en el sistema Bitcoin que puede ser capaz de rivalizar con los bancos centralizados.\n\n**Lo cuarto es tener fe de mantener la comunidad unida por un propósito y no tener miedo o ira a las autoridades en contra de las criptomonedas.**\nTodos los miembros debe seguir la filosofía de nuestro creador Satoshi Nakamoto, el Bitcoin es la alternativa al dinero físico y descentralizado por las autoridades. Nuestro objetivo es creer que esa moneda puede cambiar nuestras vidas y dar paso a la libertad financiera. Todas aquellas personas que tengan la visión equivocada y enfocada en \"dinero fácil\", sólo hará nuestra convivencia una pesadilla y arruinará la paz de nuestra comunidad.\nDebemos ignorar el hecho de la burbuja financiera y los precios volátil del mismo, porque a pesar de ellos no estaremos en peligro realmente mientras que la gente confíe en el sistema y sigan usando los Bitcoins.\nTambién debemos ignorar aquellos economistas, inversores y políticos que están en contra de Bitcoin por cualquier razón, mientras no destruyan nuestra convivencia y paz, seguiremos ignorándolos.\n\n**Lo último que queda es más simple que el primero, divertirse y disfrutar con la comunidad.**\nNo somos una empresa, no somos una organización, solo un grupo de gente que disfruta de estar luchando por los derechos de la libertad y la dencentralización de la economía. Nos pueden considerar locos y rebeldes pero eso es lo que nos hace sentir grandes, el hecho de ser **únicos**.\n\n_Todo sea por un mundo más libre y globalizado, a la vez que solidarios._"
		},
		{
			"post_id": 7,
			"title": "Posts diarios por vacaciones de invierno!",
			"date_published": 1531269430.967,
			"body": "Como resulta que el viernes tendré vacaciones de invierno, he decidido hacer posts diarios para contaros anécdotas o cualquier otra cosa que pueda mostraros.\n\nTambién eres libre de comentar cualquier tema que os ocurra para hablar en el post siguiente.\n\nHasta mañana ZeroPersonas!"
		},
		{
			"post_id": 6,
			"title": "ZeroNet, mi nuevo hogar para inmigrar de red",
			"date_published": 1531254899.6,
			"body": "Últimamente me estoy llevando bastante bien con las novedades de esta red, me parece un proyecto que valdrá la pena quedarse.\n\nEs cierto que falta contenido pero también significa que hay oportunidad de aportar si tenemos una idea o algún pasatiempo para mostrar a los demás.\n\nYo quisiera publicar mis proyectos aquí, que no son muchos. Soy un aficionado al desarrollo web y videojuegos, así que tengo bastante cosas que publicar aquí. Obviamiente en una web aparte, donde estará el contenido general de la web.\n\nIntentaré publicar de vez en cuando en este blog, algunas páginas que puedan servir como alternativas a la ClearNet que conocemos como un clon Zites de Youtube o algo así.\n\nMañana continuaré posteando algunas recomendaciones y opiniones sobre las tres redes: ClearNet, Deep Web y ZeroNet"
		},
		{
			"post_id": 4,
			"title": "Bienvenido a mi blog!",
			"date_published": 1530468168,
			"body": "Hola a todos!\n\nSoy Xarp y vengo de la Clear Net para librarme de los reglamentos del internet usando este interesante proyecto.\n\nSiempre he pensado que el internet no llegaría a ser como nosotros lo conocimos y eso parece ser verdad.\n\nServicios \"gratuitos\", vigilancia por doquier (cof cof China), censura, idiotas por todos lados, etc...\n\nMe parece increible que después de todos estos años, el internet se volvió una herramienta de vigiliancia mundial y una manera para que \"sin cerebros\" consigan likes a montones por hacer idioteces o mostrar una teta en Facebook.\n\nPara librarme un poco de eso (Porque sé que ningún internet está libre de idiotas y acosadores de gobiernos), decidí buscar una red alternativa a ella y ZeroNet (junto a Tor) parece ser una de ellas.\n\nEspero que ese proyecto siga adelante, apoyaré donando BTC, programando un poco o incluso pidiendo a mis amigos a que aporten contenido a la red para que dure lo necesario y convertirse en un nuevo mundo lejos del centralismo.\n\nMuchas gracias por leer y nos vemos ZeroPersonas!"
		}
	]
}