{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1574289293_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1557261503_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": 1,
		"1574529308_1MFJwynRwEkS2vHr8BH21DjDBEXcbiVZko": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1574296404_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 1,
				"body": "No reason is good enough to kill yourself. THE END",
				"added": 1574361020
			}
		],
		"1574424024_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": [
			{
				"comment_id": 2,
				"body": "It's my body, and I can do whatever I want with it. Suicide should be an option legally. The end.",
				"added": 1574434011
			}
		],
		"1577103091_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 3,
				"body": "Racism is illegal? So I take it your don't support free speech and you support hate speech laws? If people wanna be racist it's their right. It makes them assholes, but that's still their right.\n\nI do want to deal with sites like yours, we have enough \"we don't censor\" sites around already.",
				"added": 1577106275
			},
			{
				"comment_id": 6,
				"body": "> [zeroseed](#comment_1_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g): I'm not a racist, but i disagree with the idea that censoring them is the right way to combat them (if something is illegal sometimes it takes charm...). anyway in my country publish racist content is a crime and i don't want to go in prison for this, sorry.\n\nI get it, I agree with you, if you make things taboo or illegal the wound will fester and soon there will be more bad people around. I'm not a racist, but punishing publishing of racist material, your country is a fascist country. May I ask where you're from?",
				"added": 1577137442
			},
			{
				"comment_id": 7,
				"body": "> [draugrdeathlord](#comment_11_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): it is likely just been on zeronet with zerotalk added there is so called \"Racist\" free speech already on your disk.\n\ntrue, as a zeronet user you can't know exactly what you host.",
				"added": 1577137489
			}
		],
		"1577019778_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 4,
				"body": "It's not ok when China does it, but when Islamist do it to tens of thousands of Christians every day it's ok, because Islam is the religion of peace.",
				"added": 1577106447
			},
			{
				"comment_id": 5,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1389_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you sound like a religious\n\nWrong, I'm an atheist, how many other things are you wrong about?",
				"added": 1577137164
			}
		]
	},
	"comment_vote": {}
}