{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1566746537_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"1566858736_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1
	},
	"next_comment_id": 11,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "hi, 0net!",
				"added": 1566368910
			}
		],
		"1566241934_13ifSHXbs2RtyHF4qkn4GrJ3krWEAAGmka": [
			{
				"comment_id": 2,
				"body": "https://www.whonix.org/wiki/ZeroNet\n\nif nothing in the VM can discover your IP address, then Javascript can't either.  you still have whatever risks come with Tor, but should be safe with Javascript, peers and trackers.  \n",
				"added": 1566369713
			}
		],
		"1566357785_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV": [
			{
				"comment_id": 3,
				"body": "good",
				"added": 1566371424
			}
		],
		"1566395604_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 4,
				"body": "When you can be arrested and convicted for sarcasm or humor -- without intent to harm -- in the country with the strongest free speech protections, you know the planet-wide extinction of free speech is near.",
				"added": 1566406007
			},
			{
				"comment_id": 5,
				"body": "> [ratsmack](#comment_24_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): Looks like a credible threat to me... this statement is against US law and the police are justified in pursuing the person making said statement.\n\n___\n> \"“Jokes or not, these types of comments are felonies under law,” the sheriff’s office wrote on Facebook.\"\n\nJokes are constitutionally protected free speech in the US.  Satire and parody are protected.  \n\nI agree they had reason to investigate.  But arrest and charge, knowing he was joking?  That's unconstitutional.  \n\nI will admit, he got as close to the border as he could.  Unfortunately, we can't read the context where he said it.  There is nothing I trust less than a quote out of context.  \n\nIf anyone can find the chat where he said it, then we can judge how clear it was that he was joking.  Until then, we have to take the sheriff's office word on Facebook as potentially valid when they implied it was a joke.",
				"added": 1566411192
			},
			{
				"comment_id": 6,
				"body": "> [ratsmack](#comment_27_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): I agree that context is ultimately important, and responsibility to your well being is important also... which means \"don't say stupid shit on public forums that can come back to haunt you\". So many people say things that they would never say in person, probably because they feel safe and secure communicating through an inanimate object like a computer.\n\nWell, I agree.  What he did was very stupid.  The only thing I'd say in his defense is, well, he is 15.  Other than that, pretty dumb.  \n\nWhat I'm concerned about, though, is the disregard for free speech, which protects sarcasm, parody... joking.  If he was serious, then no, not protected.  \n\nBut, being stupid isn't against the law.  Making jokes aren't against the law.  And, in regular real-life communication, it is very normal to say threats as jokes, like \"I'm going to kill you\", often with a smile.  Online, that smile doesn't often come across.  \n\nSometimes people are sarcastic, and by definition, we say things we don't really mean, that would be absurd if we meant them.  That's sarcasm.  Since 65% of our interpersonal communication is non-verbal, we usually know when someone is being sarcastic.  \n\nBut, online, there that 65% is not there.  Even worse, I've seen way to many times where quotes of a person online were taking out of context and used in court.  Where the prosecutor would conveniently exclude the \"j/k\" part.  \n\nAnd, if you read supreme court cases around free speech, the measure of when it is being infringed is often when it creates a chill effect.  Yeah, you and I may never say anything as dumb as him.  But, if we know they are trampling on free speech rights because they know his mom can't afford to take it to the supreme court, and because even if he does and wins, he will of paid a huge price anyway, then we may be afraid of saying things, not as dumb, but in any ballpark that could be misconstrued out of context.  Now, suddenly, we have a chill on free speech, where we're afraid to joke around online the way we do when we talk face to face.  \n\nIt's not his particular case that concerns me so much as the chill it can cause in a much broader sense, where we become afraid of expressing sarcasm, or any type of joke where we would normally say something that the person we're talking to knows we're joking, but someone not a part of the conversation may take it out of context, perhaps not understanding a cultural reference or how the people directly in the conversation normally joke.",
				"added": 1566437832
			}
		],
		"1566342722_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 7,
				"body": "How come \"shit\" is on the list, but \"crap\" and \"poop\" aren't?  They are all 4 letter words.  I never understood how they are different.  There are a few contexts where you can't easily substitute, like, you typically say\n\n- I got a lot of shit done today\n\nwhere \"crap\" works, too.  But you never say\n\n- I got a lot of poop done today\n\nAnd even crap doesn't work with:\n\n- Get your shit together",
				"added": 1566447134
			}
		],
		"1566876896_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 9,
				"body": "put /data on a 10G mount, and you're set.",
				"added": 1566884587
			}
		],
		"1612720158_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": [
			{
				"comment_id": 10,
				"body": "Definite evidence to use in any lawsuit.",
				"added": 1612733377
			}
		]
	},
	"comment_vote": {
		"1_1KAAapzmQubR3wAZ1brewkZZz3ycBhuTsA": 1,
		"65_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": 1
	}
}