{
	"next_topic_id": 15,
	"topic": [
		{
			"topic_id": 1,
			"title": "Feu à l'usine Lubrizol (Rouen, 76)",
			"body": "Le feu a pris dans cette usine de pétrochimie la semaine dernière et tout a été cachés aux habitants de la ville et au delà, par les médias complices de ce gouvernement de lâches. Aucun n'a eu les couilles de faire quelque chose avant que les gens dénoncent les conditions sanitaires et environnementales désastreuses suite à l'incendie..\nEt on a vite appris pourquoi l'affaire n'intéressait pas la presse ni le monde politique: Warren Buffett est en effet le patron de Lubrizol. Or, avec son pognon, c'est lui qui commande les hommes politiques (de n'importe quel pays), ainsi que les merdias.\nL'argent quoi...",
			"added": 1569874725
		},
		{
			"topic_id": 2,
			"title": "Faire de faux documents sur ordinateur",
			"body": "Je vous propose une petite astuce pour faire de fausses factures sans que cela se voit. \nVous aurez besoin d'une adresse mail pour recevoir les factures, évidemment.\nEt vous aurez besoin du logiciel Inkscape: logiciel de dessin avec reconnaissance des caractères. Ce logiciel est gratuit et opensource, il est donc installable sur tous les systèmes d'exploitation ;)\nVoici mon guide pour bien faire:\n\n1) Téléchargez et enregistrez votre facture (de téléphone portable, par exemple) sur votre ordinateur. Les factures sont généralement en format PDF. \n2) Ouvrez la facture avec Inkscape et choisissez la zone de texte à modifier.\n3) Appuyez sur l'icône avec un T , c'est pour modifier le texte. \n4) Effacez et réecrivez! C'est magique c'est la même écriture ;)\n\nL'astuce se trouve en fait dans l'édition du document initial. La facture a été faite automatiquement par ordinateur donc avec une police d'écriture commune à tous les systèmes d'exploitation. Donc le logiciel est capable de reproduire la même écriture instinctivement !\n\nA vous les fausses factures et autres ! Personne n'y verra rien ;)",
			"added": 1570121202
		},
		{
			"topic_id": 3,
			"title": "L'histoire du voile avec l'élu du RN et la musulmane",
			"body": "Que pensez-vous de cette histoire qui fait polémique?  Avancez des arguments valables ;)",
			"added": 1571318041
		},
		{
			"topic_id": 4,
			"title": "Mr.Robot (série TV)",
			"body": "Bonjour à toutes et à tous! La série et ses 6 premiers épisodes de la saison 4 sont déjà dispo sur des sites de téléchargement (en sous-titré (VOSTFR) pour le moment). \n=> extreme-down.xyz   ;   zone-telechargement.net   ; cpasbien9.net",
			"added": 1573578763
		},
		{
			"topic_id": 5,
			"title": "Quelques bons zites!",
			"body": "Millchan : http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/\n8chan: http://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/\nBig kopy kate: http://127.0.0.1:43110/big.kopykate.bit/\nRed liberty: http://127.0.0.1:43110/1CoVgJCDb588bVtxU9VAwGLGuybzdr3mfg/\nZeroUp unlimited: http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/\nZeroUp: http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/\nInnocent childroom (pas de contenu porno ni pedo): http://127.0.0.1:43110/1J1epG5eMc4bsmh69UctBg4PHEe5B3kYHY/\nLinux.net: http://127.0.0.1:43110/16Go5kc2U9Ff4jeaY8kYiDEgpMYdgyboPY/\nPix: http://127.0.0.1:43110/0pix.bit/\nZeroLSTN : http://127.0.0.1:43110/ZeroLSTN.bit/\n\nBonne balade",
			"added": 1575394558
		},
		{
			"topic_id": 6,
			"title": "Pompiers frappés le 28 janvier 2020",
			"body": "Les pompiers frappés par les CRS alors qu'ils manifestent pacifiquement pour leur avenir, le 28 janvier 2020.\nOn ne remercie pas Macron, responsable de tout ce merdier en France depuis 15 mois... Des CRS qui frappent comme des connards les pauvres manifestants, venus se battre pour leur retraite.\nC'est lamentable !! France, pays des droits de l'homme????\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY/pompiers%20matraques%20par%20la%20police.mp4",
			"added": 1580320833
		},
		{
			"topic_id": 7,
			"title": "yggtorrent change de nom de domaine 5/2/20",
			"body": "Le nouveau domaine est: yggtorrent.se\nToutes les infos se trouvent sur leur site ou leur compte Twitter ! \nBon téléchargement!",
			"added": 1580931584
		},
		{
			"topic_id": 8,
			"title": "Des codes pour des sites divers",
			"body": "Salut, voici des codes venant d'une chaîne Telegram (Free Premium Accounts). Il  y'a de tout: des codes pour Netflix , pour divers VPN, des codes McDo avec de l'argent sur  le compte..mdr!\n\nx278 Disney Plus Premium Accounts\n\nhttps://tpaste.net/gDYm9e0OXh",
			"added": 1581274844
		},
		{
			"topic_id": 9,
			"title": "Générateur de carte de crédit!",
			"body": "https://premiumhost.me/tools/ccgen/\nIl y'a des vidéos qui montrent que ça marche sur certains sites  mais j'ai essayé de mon côté sur Aliexpress et ça ne marche pas...",
			"added": 1581275078
		},
		{
			"topic_id": 10,
			"title": "Emission Enquête Exclusive sur m6 le 23 février 2020",
			"body": "Le journalisme penche bien du coté gauche, niveau politique.  Dans le cas du Danemark, où les journaleux ne parlent que de l'extrême-droite, bla bla. Ca critique et ça rappelle constamment qu'en France, on ne peut faire telle ou telle chose. \nPourtant, en France, tout le monde pense que l'immigration incontrollée est absurde. Sortez de la gare de l'Est... D'un côté, les maghrébins, de l'autre, les noirs-africains. Tout type de traffic est fait sous les yeux de tout le monde.\nLes musulmanes avec leur foulard font de la pure provocation religieuse. Quand on va dans un pays, qu'on y est \"invité\", on est forcé de s'adapter. Si on veut garder sa tenue vestimentaire en public, garder ses coutumes etc...alors on va dans un pays qui a les mêmes racines. Mais évidemment, en France, ce n'est pas comme ça. Les Français sont en permanence traités de racistes et pourtant ce sont les premiers visés dans des attentats terroristes musulmans. Oui, ce ne sontque des musulmans qui commettent des attentats (peu importe le pays d'ailleurs...)\n\nEt donc, les Français en ont marre de ça, d'être stigmatisés. Tout comme les Danois, les Suédois (cités dans l'émission de ce soir). On veut juste sauver nos racines, nos modes de vie où la violence n'est pas aussi forte qu'avec l'immigration non controllée. Le regroupement communautaire, la provocation vestimentaire et religieuse, la violence qui est en lien avec l'immigration, la préférence étrangère etc.. sont bien à prendre en compte dans les sentiments des Français. Allez à Bobigny, en banlieue parisienne: vous n'êtes pas le bienvenu, vous êtes blanc, Français... Vous ne serez jamais accepté.\n\nSi l'extrême-droite progresse dans tous les pays où les frontières sont grandes ouvertes et où aucun contrôle n'est effectué (tous les pays d'Europe, en gros), ce n'est pas par hasard.\n\nRegardez la Hongrien aussi citée dans l'émission. Les journalistes sont outrés de la politique de Viktor Orban mais que ces derniers accepteraient-ils d'accueillir des migrants dans leurs appartements dans les beaux quartiers??? Ils n'ont que des bonnes paroles mais ne veulent pas non plus s'occuper des etrangers.\nLes journalistes roulent pour les partis politiques qui leur graisse la patte et leur fait de grosses réductions fiscales (ça, ils n'en parlent pas ^^)\nCa me dégoute ces médias de merde. ",
			"added": 1582501647
		},
		{
			"topic_id": 11,
			"title": "Tout ce qui faut pour Windows",
			"body": "http://jerryching.changeip.org/Software/Microsoft/\nPour remonter dans le serveur, cliquez sur \"Parent directory\"",
			"added": 1583437904
		},
		{
			"topic_id": 12,
			"title": "Clone de ZeroUp pour les Français",
			"body": "Salut, j'ai dans l'idée de créer un clone de ZeroUp qui serait destiné à nous les Français et francophones.\nJ'ai demandé de l'aide sur le ZeroTalk EN pour construire le site ;)\nBonne journée",
			"added": 1584272071
		},
		{
			"topic_id": 13,
			"title": "Infos coronavirus de Telegram, qui se révèlent vraies",
			"body": "Quelqu'un a mis le lien  du canal Telegram de \"Coronavirus info live\".Je le remercie! Tout ce qui est dit ici est vrai, et les infos citées apparaissent quelques heures /jours plus  tard dans les merdias.\nJe mettrai les infos du canal ici pour ceux qui n'ont pas Telegram. Vous comprendrez qu'il ne faut pas prendre ça à la légère, et qu'il va y avoir des centaines de milliers de morts rien qu'en Europe...",
			"added": 1584570551
		},
		{
			"topic_id": 14,
			"title": "Prix des carburants au Luxembourg",
			"body": "https://www.aral.de/fr_lu/luxembourg/home/carburants-et-prix/prix-actuels-des-carburants.html?fbclid=IwAR32_be1hrz7iR4Q0bqKzDck-305fCF8nUvHA0G1XKAANsuKl610D50xlX8\nLe gasoil est à 79cts HT, soit 0,92cts TTC\nEn France,c'est au moins 1,30 TTC je suppose...",
			"added": 1585673341
		}
	],
	"topic_vote": {},
	"next_comment_id": 21,
	"comment": {
		"2_1FCUfGpjdJr6wcorndFhdKhYJ5EPaXSk7u": [
			{
				"comment_id": 1,
				"body": "Thinkerview, c'est encore un média de gauche... regardez les invités. Mais, on apprend quand même quelque chose dans différents domaines.",
				"added": 1569679066
			}
		],
		"12_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX": [
			{
				"comment_id": 2,
				"body": "C'est quand même bien Linux. C'est super facile de cloner un repo Git par exemple ;)",
				"added": 1571339948
			}
		],
		"1_1L1eZF78D44Lv2HtmxcKMXrYPAHA1KUkfW": [
			{
				"comment_id": 3,
				"body": "Un site qui regroupe énormément de vidéos => embedy.cc   Tu peux télécharger les vidéos si tu veux :D",
				"added": 1573578987
			}
		],
		"11_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX": [
			{
				"comment_id": 4,
				"body": "Salut, j'ai un compte et c'est vraiment excellent! Surtout pour les liens magnets ;)",
				"added": 1580504012
			}
		],
		"8_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY": [
			{
				"comment_id": 5,
				"body": "x20 VyprVPN Premium Accounts\n\nhttps://tpaste.net/4FdKtpytuu",
				"added": 1581275255
			}
		],
		"10_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY": [
			{
				"comment_id": 6,
				"body": "> [nazmi](#comment_2_182MiECzFBoPjv3gU6tq2k9BXSboKzDVKF): personne te forces à regarder leurs émissions surtout que ta réaction est exactement ce qu'ils veulent, ils veulent te donner l'impression que tu ne peux rien faire et que l'injustice est là.\n> Après le but c'est soit que tu serve de peril brun de l'extrème droite ohlàlà soit d'avoir ton aval pour un gars de ce genre:\n> \n> https://www.youtube.com/watch?v=CzKpLCfrMEA\n> Dans les deux cas la solution c'est de te concenter sur ta vie en restant en effet conscient des manipulations, et en renforçant ta communauté locale, qui elle seule sera garante de la \"France\" quitte d'ailleurs à voir des affinités avec tout le monde qui n'est pas un branleur inutile et malfaisant.\n\nJe suis d'accord avec toi mais c'est tellement dur de se sentir rabaisser par des abrutis pareils.. \nOn ne voit pas les médias ces derniers jours pour parler de l'invasion de la Grèce..",
				"added": 1583269557
			}
		],
		"1_1Lm7quPgcqy7kHXqXqA4wx3ddWecEjn7MD": [
			{
				"comment_id": 7,
				"body": "On est peut-être une dizaine lol",
				"added": 1583437813
			},
			{
				"comment_id": 12,
				"body": "salut ! Nous sommes tous un peu dans l'ombre en fait :D",
				"added": 1585427218
			},
			{
				"comment_id": 19,
				"body": "Oui on est là... Après, contrairement à ce que disent certaines personnes, il n'ya que des gauchos, rêveurs, qui veulent du \"vivre-ensemble\".. Et bah non, pour ma part, je ne suis pas comme ça, sans parler politique.\nJe suis un Français, qui pense qu'on tue la liberté d'expression (surtout en ce moment, avec le confinement..), qui se fait matraquer par les impôts parce que je travaille en gagnant à peine plus que le SMIC etc...\nJe suis content qu'une communauté (même si elle est encore petite), il y'a des gens sympas, qui créent du contenu loin des GAFAM de merde, et tout ça, sans censure :D",
				"added": 1587317125
			}
		],
		"6_1FSfeha2tbwLR8Y7md6z2XfkCeYJPgdLnJ": [
			{
				"comment_id": 8,
				"body": "Tor n'est pas infaillible, malheureusement ... ",
				"added": 1583614977
			}
		],
		"1_15dASaY3N8FZ287nyzKzXY2zz9y5tcZ4rH": [
			{
				"comment_id": 9,
				"body": "A Paris, dans les hôpitaux, c'est déjà le stade 3 depuis une semaine puisqu'aucun test ne peut être réalisé. Tout Paris est infecté mais les merdias ne vous le diront pas.. \nLe personnel hospitalier manque de masques, de gants, de vêtements de rechange, sont à bout de nerfs devant les milliers de personnes qui affluent dans les hôpitaux... \nLe gouvernement FR qui gazait les grèvistes médicaux il y'a peu de temps et leur retirait des centaines de milliers d'euros ainsi que des lits et autres, s'en remettent à ces derniers puisque les politiciens sont touchés également.. \nVous voyez l'ampleur du phénomène??? Les ministres qui vivent entre eux, qui ne côtoient pas le peuple dans la rue, sont donc eux aussi contaminés, vous imaginez?? Que dire de la population qui va bosser tous les matins??? \nOn est dans la merde...",
				"added": 1584271965
			}
		],
		"13_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY": [
			{
				"comment_id": 10,
				"body": "18 mars, matin: - De plus en plus de pays vont passer à un confinement de masse renforcé militairement.\n- 89 nouveaux décès en France annoncé, selon mes chiffres on est à plus de 120, dont quelques dizaines en cours de vérification, on annonce également 9134 cas sur le territoire, alors que les 10 000 cas sont largement dépassés et plusieurs dizaines de milliers de personnes sont malades et infectieuses à coup sûr.\n\nRappelez-vous qu'il y a trois semaines on nous disait que le virus ne circulait pas sur le territoire national, alors que le gouvernement savait très bien qu'on en arriverait-là, et était averti par de nombreux experts. \n\nLa situation est la même en Suisse, le gouvernement était au courant depuis la fin février que la situation actuelle était inévitable, mais n'a \"rien dit\" par peur de créer un effet \"onde de choc\" et être mal compris.\n\nFrance et Suisse, même combat, mêmes incompétences.\n\n- En Suisse, des discussions internes sont en cours pour renforcer les mesures, j'en ai parlé plus tôt dans la journée. Il faut s'attendre à un confinement forcé à domicile avec interdiction de sortir, et une prolongation des mesures jusqu'en juin est en train d'être discutée. (confidentiel)\n\n- Le même genre de prolongations est déjà discuté en France, les gouvernements n'annoncent pas trop pour le moment pour ne pas impacter trop fortement le moral des citoyens.\n\n-Les informations internes que j'avais sur la Grande-Bretagne semblent se confirmer d'heure en heure, d'après des rumeurs dans les médias britanniques qui ont des sources concordant avec les miennes. Une quarantaine totale pourrait être annoncée d'ici demain et pourrait rentrer en vigueur vendredi.",
				"added": 1584571653
			},
			{
				"comment_id": 11,
				"body": "18 mars, après-midi: \n\n- J'en profite pour dire et redire que la Chine n'en a PAS terminé avec cette histoire contrairement à la propagande du Parti Communiste Chinois. \n\nDe nombreuses provinces sont encore en quarantaine, de nombreux décès sont encore cachés à la population, de nombreux hôpitaux sont encore débordés, de nombreuses personnes sont encore enfermées chez elles, de nombreuses usines (la majorité) n'ont pas encore redémarré...\n\n- Pendant ce temps-là, en France, on ordonne aux policiers de retirer leurs masques de protection.\n\n\n- Résumons. \n\n1. La France sait que le pire est devant elle et qu'elle manque d'équipements de protection et de lits d'hôpitaux.\n\n2. Elle envoie ses quelques réserves de masques à la Chine.\n\n3. Elle ment en boucle en disant que le virus ne circule pas sur le territoire.\n\n4. Elle réagit bien trop tard et prend des mesures incomplètes tout en répétant que le port du masque est inutile.\n\n5. Elle maintient le premier tour des municipales ce qui va coûter des milliers de morts en plus au minimum.\n\n6. Elle se plaint de manquer de masques et met la faute sur le personnel soignant qui \"volerait\".\n\n7. Elle ordonne aux fonctionnaires de ne pas porter de masques.\n\n8. ???\n\nÀ un moment, il faudra me dire où est la limite entre incompétence et malveillance.\n\n- Je vous ai prévenus cette nuit. Et déjà dès dimanche. Les consultations avec l'armée en France se sont multipliées.",
				"added": 1584571820
			},
			{
				"comment_id": 16,
				"body": "31 mars: + de3000 morts, et on m'annonce près de 200 000 personnes contaminées pour le 10 avril. \nEn attendant le gouvernement compte sur vous, hein :D",
				"added": 1585672032
			}
		],
		"7_14gQY4WNgiKmTkrmPF6mGS5RcwNikfzayK": [
			{
				"comment_id": 13,
				"body": "Complètement d'accord avec toi ;) De toutes façons,les \"puissants\" sont déconnectés de la réalité...peu importe le domaine: politique, financier etc...",
				"added": 1585566088
			},
			{
				"comment_id": 14,
				"body": "Nous sommes de la merde pour eux, il suffit de voir comment nous sommes traités: au niveau fiscal, au niveau social (manifs gilets jaunes), au niveau juridique (si t'as pas de sous, on t'enfonce)....",
				"added": 1585668051
			}
		],
		"1_19m6uJTaNtvf8AKht82FE8ctxMYaBXcu4": [
			{
				"comment_id": 15,
				"body": "Le Renard blanc... :D",
				"added": 1585668372
			},
			{
				"comment_id": 17,
				"body": "On sait très bien que c'est le pognon / pouvoir qui gouverne le monde ... De toutes façons, il suffit de voir en France: le gouvernement fait tout pour tacler le fameux professeur de Marseille parce que (hormis les différends avec le mari de la Buz), il propose un traitement à 12 euros, contre 200 euros pour le traitement des laboratoires... \nEt puis notre gouvernement c'est que des lopettes, ils ne savent pas prendre de décisions, même pour le confinement.. \nEnfin, on n'est pas sorti de la merde lol",
				"added": 1585672992
			}
		],
		"1_14ixt7XngjiiqDEqjMdvTLWoJE2s9cV1ZB": [
			{
				"comment_id": 18,
				"body": "Lol, je pensais poser cette même question sur le forum! Pour ma part, je suis souvent sur des Raspberry Pi pour bidouiller. J'essaie aussi de hacker les smart TV.. ",
				"added": 1586638406
			}
		],
		"2_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav": [
			{
				"comment_id": 20,
				"body": "Très bon sujet et commentaires ;) Merci pour les infos. \nPour ma part, je suis sensible aux ondes et ça me provoque des maux de tête. \nQuand on est au pied d'une antenne, on sent bien la \"puissance\" de ce merdier. Moi aussi je garde si possible le réseau 3G sur le téléphone, il y'en a largement assez pour aller sur le net. ;)",
				"added": 1588535494
			}
		]
	},
	"comment_vote": {}
}