{
	"next_post_id": 5,
	"next_comment_id": 1,
	"next_follow_id": 1,
	"avatar": "generate",
	"user_name": "Krixanotemp",
	"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1,
			"date_added": 1532463609,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1532464382,
			"body": "Made pretty big improvements to the sidebar of the website I'm working on at work. Tries to follow Material Design specs as closely as possible (but the CSS is pretty terrible, so this'll be better with the framework I'm working on).\n\nSidenote: This is my new profile for when I'm away.\n\n[image 1 - original](merged-ZeroMe/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/data/users/1LyDv1UtDTi7uD9SGUHYDUrtJP2NhS6DUU/1532464382.orig.jpg?v=8c197974 \"media:0,image/original\")",
			"date_added": 1532464375,
			"meta": "{\"ext_media\":{\"type\":\"image\",\"original\":\"1532464382.orig.jpg\"},\"img\":\"900,457,666888aaa9a9444777eeffffede,01232322224566666666417777777741777777774177777778\"}"
		},
		{
			"post_id": 1532528534,
			"body": "Just installed Haiku OS (based off of BeOs) on one of my old computers (1.3 GHz, 512MB RAM). I am loving it so far, I just wished Wifi worked. It's the fastest OS I've used ever so far (and that's on this old computer). Of course, there isn't as much software, but they just finished porting over LibreOffice, Qt4 and Qt5, and Rust (programming language). They have ports of other things too. One that I use especially is Vim. They have a decent web browser as well and some people are working on Text Editors and there's conversation on porting an IDE.\nThe only thing, I think, iirc, is that python doesn't work so well on it, which means no ZeroNet yet.\nOtherwise, I think I may start developing stuff on it because I think it would be fun.",
			"date_added": 1532528531
		},
		{
			"post_id": 1533322316,
			"body": "[https://hacks.mozilla.org/2018/07/introducing-the-d-web](https://hacks.mozilla.org/2018/07/introducing-the-d-web)",
			"date_added": 1533322312
		}
	],
	"post_like": {},
	"comment": [],
	"follow": []
}