{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "#Relatividade geral\n- https://web.archive.org/web/20181004211209/http://www.pitt.edu/~jdnorton/teaching/GR&Grav_2007/pdf/Einstein_Entwurf_1913.pdf",
				"added": 1538688057
			},
			{
				"comment_id": 3,
				"body": "#Principia: Princípios Matemáticos de Filosofia Natural [Livro I, 2ª ed.]\nPrimeira obra de física teórica, no sentido moderno, possui, além de sua importância histórica, um reconhecido valor pedagógico. Publicada pela primeira vez em 1687, nela Newton expõe seu método que deriva as causas de todas as coisas a partir dos princípios mais simples possíveis, comprovados pelo estudo dos fenômenos. Dessa forma, lança as bases da mecânica de maneira categórica, utilizando uma forma e um critério de comunicação científica que se tornaram modelo na área. A edição tem como base a versão para o inglês realizada por André Motte, em 1729, e traz o apêndice histórico e explicativo de Florian Cajori, feito para a edição de Crawford de 1934. Reproduz também o prefácio de Roger Cotes para a segunda edição que situa as polêmicas científicas vividas por Newton em sua época.\n- http://libgen.io/book/index.php?md5=6A7C86F570A2139E4462C1478F67E1A7\n\n\n#Principia: Princípios Matemáticos de Filosofia Natural [Livros II e III, 1ª ed.]\nEsta é a tradução da parte final da obra máxima de Isaac Newton, Livros II e III, que complementa o Livro I do Principia, também publicado pela Edusp. É uma das obras científicas mais importantes de todos os tempos, tendo sido publicada originalmente em 1687. No Livro II Newton estuda o movimento de corpos em meios com resistência, sendo que no Livro III apresenta sua teoria da gravitação universal, o coroamento de sua obra. A edição tem como base a versão para o inglês realizada por Andrew Motte, em 1729, e traz o apêndice histórico e explicativo de Florian Cajori, feito para a edição de Crawford de 1934. O texto inclui também a tradução da obra de Newton na qual discute de forma não matemática sua concepção cosmológica, O Sistema do Mundo.\n- http://libgen.io/book/index.php?md5=F97BA3DE99E4CB5708DD18AC55748494",
				"added": 1538688254
			},
			{
				"comment_id": 4,
				"body": "#Os Pensadores - Newton, Leibniz\t\nNewton, Leibniz - Seleção de textos e consultoria das introduções por Hugh M. Lacey (Newton) e Marilena de Souza Chauí (Leibniz).\n\n1. Princípios matemáticos [Newton, 1687] ::: \nNos textos selecionados aparecem algumas das teses centrais de Newton, que marcaram decisivamente a evolução da física e da filosofia, como as leis do movimento e a noção de espaço absoluto.\n\n2. O peso e o equilíbrio dos fluidos [idem, publ. 1962] ::: \nTradução do original latino, somente editado em 1962, como parte integrante dos Unpublished Scientific Papers of Isaac Newton. Discute noções fundamentais da física newtoniana, como força, movimento, inércia, gravidade, velocidade etc.\n\n3. Óptica [idem, 1704] ::: \nA análise de questões básicas referentes à luz constitui, para Newton, um caminho capaz de alargar o âmbito da filosofia moral e de conduzir o espírito humano à adoração de Deus. \n\n4. A monadologia [Leibniz, 1714] ::: \nApresentação da noção de mônada, fundamento da filosofia leibniziana, e entendida como unidade dinâmica consstitutiva de todas as coisas.\n\n5. Discurso de metafísica [idem, 1686] ::: \nNa visão otimista de Leibniz – depois criticada por Voltaire – o mundo, criado por Deus, aparece como o melhor mundo possível.\n\n6. Da origem primeira das coisas [idem, 1697] ::: \nLeibniz procura explicar “como das verdades eternas, essenciais ou metafísicas nascem as verdades temporais, contingentes”.\n\n7. O que é a ideia [idem, 1710] ::: \nO opúsculo apresenta várias acepções de “ideia” e propõe a concepção leibniziana, ligada à tese da existência de Deus.\n\n8. Correspondência com Clarke [idem, 1715/16] ::: \nAs cartas discutem a teoria newtoniana sobre espaço, tempo e matéria, revelando as ideias de Leibniz sobre esses temas.\n\n\n - http://libgen.io/book/index.php?md5=19E07DAFE3759C5B85B62B45422B3A8D",
				"added": 1538688377
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 2,
				"body": "#A Geometria dos Espaços Curvos ou Geometria Não-Euclidiana\n- https://web.archive.org/web/20181004211326/http://www.miniweb.com.br/ciencias/artigos/a_geometria_dos_espacos_curvos.pdf",
				"added": 1538688105
			}
		]
	},
	"comment_vote": {
		"1_1GnUB5DsGg5LkeHr8hP5Qg2hcVTRVYEH6f": 1
	}
}