{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1518945446_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	},
	"next_comment_id": 11,
	"comment": {
		"1518945446_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "As far as i am concerned, VP9 is enough for me, until someone complains about performance or using outdated system that can't play it for a good reason. Certain company does not wish to add support for it for its obedient users (which explains some portion of those ~21%), but i'd rather spend time explaining why that is evil than support such a policy.",
				"added": 1519481065
			}
		],
		"1547562197_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 2,
				"body": "You can install [lineageos](https://lineageos.org/) (ex cyanogenmod) if you want more recent android (7 seems to be available), or [replicant](https://replicant.us) if you want more free & secure one",
				"added": 1547568557
			}
		],
		"1553211506_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 3,
				"body": "If you want to verify it is the same as original, you need some way to establish what original is. Usually this is done by hashes (though you obviously still need to trust that hashes are correct), sometimes automated (probably on most p2p tech), sometimes you can manually get hash of your local file and compare to known hash of original. If you're not provided with original hash, there's not much you can do.\n\nIf, however, you only want to check that video file is not corrupted, using ffmpeg seems reasonable, but i've never done something like that so i can't be sure.",
				"added": 1553286013
			}
		],
		"1555519029_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 4,
				"body": "> How did you solve the issue with too many open tabs in Your web browser?\n\nI didn't ;) I'm basically using tabs on the left as bookmarks (they don't get loaded on browser restart anyway) and most likely never return to them. That said, i don't have many problems with scrolling: i can use address bar to switch to tab by its header if i remember it or keep active tabs in a separate window. Also, i don't use tab pinning, i have a window for pinned-like tabs instead",
				"added": 1555519231
			}
		],
		"1560773409_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 5,
				"body": "If there's cutting involved, i'd use Kdenlive since that's what i generally use for video production (but it's fairly user friendly for such tasks anyway: mostly you need to \"separate audio from video\" and then unlink them). For simple track replacing, i'd probably use ffmpeg",
				"added": 1560779205
			}
		],
		"1561023024_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 6,
				"body": "- run in emulator on a computer\n\n- create separate profile (?) (personally, i couldn't make this work: new user couldn't install apps, possibly due to lack of google play or me not finding the right config)\n\n- use dual boot\n\nObviously, the latter two options will still allow app to spy using whatever permissions you give it (and even the first will allow spying on your activity during usage..)\n\nPS: i'm not an expert and i don't run proprietary apps, so i'm *mostly* safe without special measures",
				"added": 1561025027
			}
		],
		"1566288245_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 7,
				"body": "HDD tech might be around its limits, so perhaps next big leap will be when other tech (wasn't there some 3d storage developments?..) comes",
				"added": 1566288924
			}
		],
		"1568049511_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 8,
				"body": "Leaving aside question why would you want to use google play and proprietary apps, the answer to your question is fairly simple: new versions bring new api, which is likely better, supporting old versions takes effort, userbase is very small and decreasing, so it's probably not worth it. *Especially* for those who are working for profit",
				"added": 1568066815
			}
		],
		"1571749687_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 9,
				"body": "> **phone number** without a face scan?\n..\n> baseline requirement for a **new smartphone**\n\nSo which it is actually?\n  \n..Apparently it is about actual devices, not numbers",
				"added": 1571759819
			}
		],
		"1616675540_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 10,
				"body": "gstatic is supposed to be static , so you might be able to cache it (via vpn or tor or whatever) in bulk or even mirror as much of it as seems required and reroute browser to fetch resources from your server",
				"added": 1616878527
			}
		]
	},
	"comment_vote": {
		"1_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1
	}
}