{
	"next_post_id": 6,
	"next_comment_id": 23,
	"next_follow_id": 7,
	"avatar": "jpg",
	"user_name": "Gaypidoras",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "I`m gay, I`m pidoras, fuck me in ass!!! OH!!! OH!",
	"post": [
		{
			"post_id": 1,
			"date_added": 1561723690,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1561723734,
			"body": "PUTIN FAGGOT!",
			"date_added": 1561723732
		},
		{
			"post_id": 1561849569,
			"body": "if you think that putin is cool guy and good president watch this clip, it contains everything that is impossible to convey in words https://www.youtube.com/watch?v=MBG3Gdt5OGs",
			"date_added": 1561849566
		},
		{
			"post_id": 1561853961,
			"body": "General zerome feed looks like garbage",
			"date_added": 1561853957
		},
		{
			"post_id": 1562854252,
			"body": "В какой то момент я подумал, что больше не вернусь сюда...",
			"date_added": 1562854247
		}
	],
	"post_like": {
		"1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642": 1561754315,
		"1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1558777019": 1561759612,
		"1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1557587712": 1561764137
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "Российская власть не имеет права критиковать никого, даже китай, поскольку ТАКУЮ коррупцию надо еще поискать, чиновники просто смеются в лицо простым людям, страны хуже чем россия нет! Путин вор! Путин хуй!",
			"post_uri": "1EKuhc7Z1NrcT5LexBRAJsKVyt9oiPSAkc_1561711892",
			"date_added": 1561723911
		},
		{
			"comment_id": 2,
			"body": "С одной стороны, да. Но если бы не эти недостатки, то каждый бы хранил только то, что он выбирал бы сам. И таким образом какая то конкретная часть сайта хранилась только у нескольких конкретных людей(компьютеров), и сеть не была бы такой неубиваемой и децентрализованной. \nВ конце хочу добавить что я абсолютный дебил, малопонимающий о чем он говорит, поэтому сказанное выше не претендует на абсолютную верность и точность. И почему вам невозможно написать на почту?",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1561754320
		},
		{
			"comment_id": 3,
			"body": "@Realjohndoe: what an amoral dumbhead?",
			"post_uri": "1L9HzpRhgaq6Nxpt4BP5DSxqeY8H3q9Gcj_1561723734",
			"date_added": 1561759440
		},
		{
			"comment_id": 4,
			"body": "@Whitewolf: >Putin is right, these mental institution trans faggot liberals are done in the west. \n\nright or wrong, he specifically in this matter does not negate the fact that during his time corruption and banditry flourish in the country, officials just laugh at people in the face, real income just falls, and they build churches for the glory of themselves and buy yachts with gold toilets",
			"post_uri": "1L9HzpRhgaq6Nxpt4BP5DSxqeY8H3q9Gcj_1561723734",
			"date_added": 1561816707
		},
		{
			"comment_id": 5,
			"body": "@Realjohndoe:>It's not about liberal or conservative. It's about rational vs irrational. Both sides better get their tongues out of Israel and the (((Jews!))) buttholes. Or we will find some politicians that can..🇺🇸🗽😐\n\n I did not understand a little what you meant, do you have something against the Jews?",
			"post_uri": "1L9HzpRhgaq6Nxpt4BP5DSxqeY8H3q9Gcj_1561723734",
			"date_added": 1561816797
		},
		{
			"comment_id": 6,
			"body": "@Whitewolf: These months of pride annoy me very much, nobody despises and does not humiliate gays, all people treat them well, regardless of their orientation. And people who, let's say, attract attention to them, give them even more rights than others (the same goes for feminists, blacks, etc.), and draw attention to themselves from real problems.",
			"post_uri": "1L9HzpRhgaq6Nxpt4BP5DSxqeY8H3q9Gcj_1561723734",
			"date_added": 1561817015
		},
		{
			"comment_id": 7,
			"body": "@Realjohndoe: Putin is not good, but he is smart, yes. Rather, even cunning. He never did anything for the people, only Kim Jong Yin and Xing Jin Piny can be worse than him. Dictator! Tyrant! Despot!",
			"post_uri": "1L9HzpRhgaq6Nxpt4BP5DSxqeY8H3q9Gcj_1561723734",
			"date_added": 1561817272
		},
		{
			"comment_id": 8,
			"body": "@Realjohndoe: whyyyy?",
			"post_uri": "1L9HzpRhgaq6Nxpt4BP5DSxqeY8H3q9Gcj_1561723734",
			"date_added": 1561840914
		},
		{
			"comment_id": 9,
			"body": "@Realjohndoe: I still do not understand what exactly you have against the Jews",
			"post_uri": "1L9HzpRhgaq6Nxpt4BP5DSxqeY8H3q9Gcj_1561723734",
			"date_added": 1561846563
		},
		{
			"comment_id": 10,
			"body": "@If0: Именно поэтому мы и можем удалить сайт целиком, но не какой то определенный контент из него. Вот отрубишь ты одну голову гидре, а у нее не то что две,одна новая не вырастет! Зато если палец отрубишь - вырастет. Ну и кому оно надо? Имея возможность выбора мы так или иначе приходим к зависимости от конкретных пользователей, стоит их убрать и контент пропадет. И вся децентрализованность пропадает.",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1561847013
		},
		{
			"comment_id": 11,
			"body": "@If0: и кстати, как цитировать?",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1561847702
		},
		{
			"comment_id": 12,
			"body": "Explain for all :\n1.The main characters are the government\n2.《I fill my eyes with kerosene, let everything burn》- the government does not want to look at what is happening in Russia (they do not care) \n3.《I served my time on the Internet》- term for reposts/likes/comments \n4.《Go out to stroke the cat, but it moved takka ment》 - lawlessness in law enforcement\n5.《Go out on the street in black hoodies, there's usually some cold and evil people》 - about the population of Russia (bydlo/Gopnik)\n6.《There is nothing ahead of me》 - young people do not know what awaits them in the future \n7.《In gold chains I'm drowning in a swamp》- our country is rich in natural resources, but we still live in poverty\n8.《Together with others you will twist in the square》- everything is clear \n9.♪And I'll curl up in my new living space♪ in my coffin\n10.《There is no more death》 - the dead do not die.\n\nNow the visual part\n 1. A man throwing a match shows the government trying to silence the people.\n2. Eating raw meat shows that the government \"eats\" the people (Increase in VAT, retirement age)\n3. The main characters sitting on the neck of the riot Police - law enforcement agencies are trying to please their superiors.\n4. Cigarette - censorship in Russia.\n5. Drowning - the government is pulling the country to the bottom.",
			"post_uri": "1L9HzpRhgaq6Nxpt4BP5DSxqeY8H3q9Gcj_1561849569",
			"date_added": 1561849863
		},
		{
			"comment_id": 13,
			"body": "@Moor: \"will have peace while liberalism is dominant\", just as no country will have peace as long as authoritarianism and dictatorship prevail. And what's your problem with liberalism?",
			"post_uri": "1L9HzpRhgaq6Nxpt4BP5DSxqeY8H3q9Gcj_1561849569",
			"date_added": 1561851104
		},
		{
			"comment_id": 14,
			"body": "@Moor: anyway, if you take any liberal country and compare it with an authoritarian one, the latter will always lose. Especially such as Russia",
			"post_uri": "1L9HzpRhgaq6Nxpt4BP5DSxqeY8H3q9Gcj_1561849569",
			"date_added": 1561851904
		},
		{
			"comment_id": 17,
			"body": "@If0:\n> Правая угловая скобка в начале цитаты: > используется правила оформления markdown\nСпасибо большое я научился!!",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1561852157
		},
		{
			"comment_id": 18,
			"body": "@If0: да, но именно этим ведь и обеспечивается децентрализованность всей системы. Везде есть плюсы и минусы, мы всегда будем идти на компромисс. Просто кого то он устроит, а кого то нет. И тут уже выбор каждого.",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1561852242
		},
		{
			"comment_id": 19,
			"body": "@Moor: \n> i surely have no clues what is the future for Russia but at least there is a glimpse of hope that with no \"threats\" of sanctions and what not they can develop more freely and thus be less oppressive.\nRussia has no future, especially with such people. More or less thinking people are trying by all means to leave here and remains here only hopeless(often Patriotic) cattle, which suits the current state of Affairs. Can be very long to chew over this question, but if smart people leave and remain some idiots to expect something good to treat last))",
			"post_uri": "1L9HzpRhgaq6Nxpt4BP5DSxqeY8H3q9Gcj_1561849569",
			"date_added": 1561852672
		},
		{
			"comment_id": 20,
			"body": "@Moor: socialism is good in theory, in practice socialism is even worse in some things than classic regimes",
			"post_uri": "1L9HzpRhgaq6Nxpt4BP5DSxqeY8H3q9Gcj_1561849569",
			"date_added": 1561852917
		},
		{
			"comment_id": 21,
			"body": "@If0: Ну мы же рассматриваем настоящую ситуацию, так ведь? Естественно может одно а может другое, а может все иначе, но это все гадание на кофейной гуще. Что-то поменяется, решатся одни проблемы - придут другие. Все равно что говорить беременной жене активно дышать, когда она только на 4-месяце и все что она хочет - это просто поесть.",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1561853168
		},
		{
			"comment_id": 22,
			"body": "@Moor: how exactly is this used to destabilize the regime?",
			"post_uri": "1L9HzpRhgaq6Nxpt4BP5DSxqeY8H3q9Gcj_1561849569",
			"date_added": 1561853395
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x",
			"user_name": "If0",
			"date_added": 1561753340
		},
		{
			"follow_id": 3,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY",
			"user_name": "Xan",
			"date_added": 1561765177
		},
		{
			"follow_id": 4,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi",
			"user_name": "Gluek",
			"date_added": 1561767938
		},
		{
			"follow_id": 5,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC",
			"user_name": "Promusik",
			"date_added": 1561799281
		},
		{
			"follow_id": 6,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1Jo5SSrRsLzwrCk5BrjHKiFuMNagf1Jmj5",
			"user_name": "Super0210",
			"date_added": 1561886818
		}
	]
}