{
	"next_topic_id": 15,
	"topic": [
		{
			"topic_id": 1610991839,
			"title": "Cloning Millchan to make it \"legal\" and transforming it in a file hosting zite",
			"body": "In my opinion Millchan is one of the best zites on zeronet because some reasons:\n\n- actively developed\n- good graphical interface\n- the ability to auto-seed/block specific chans or users (this should increase the number of complete seeds and is also very useful managing a seedbox)\n\nbut have also some very important defects:\n\n- it creats spoiler thumbnails of all content of the zite (also illegal files) this don't allow to create legal seedboxes easily (this option can be disabled, but to do this you should first download the zite...)\n- it cant host some very common file types like .iso and .rar\n- max file size is too low\n\n...but the strong points are a big advantage when this zite is compared to IFS, zeroup or kopikate:\n\n- IFS is very buggy, not developed and don't have an option to auto-seed content or block specific users. Also vids and audio files must be completely streamed to gain a seed (because of this most big files go dead share).\n\n- all Kopikates can host only videos and have auto-thumbnails\n\n- Zeroup have a small size limit and cannot stream audio and video files. Zeroup unlimited is similar (with a small increase of maxsize)\n\nI decided to make a clone of Millchan removing the automatic spoiler thumbnails and correcting the points described above, creating \"Galactichan\" (A new improved version of the Intergalactic File Server).\n\nYou can view this zite following this link:\n\nhttp://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/\n\ncould you help me testing the zite?",
			"added": 1610991838
		},
		{
			"topic_id": 1611909944,
			"title": "I do the Pfizer covid 19 vaccine",
			"body": "I take the second dose Yesterday. I have no side effects (only some mild Pain on injection site) i saw some collegues and Friends that had also severe covid 19. Please do the vaccine",
			"added": 1611909942
		},
		{
			"topic_id": 1611947064,
			"title": "I Will seed your files on my zite. Look at these videos!",
			"body": "If you have any legal file you can upload It on my zite and told me to seed It. For example look at these videos! (I converted It in webm format with the ffmpeg default low quality bitrate around 500 k)\n\nhttp://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/?:users/142sp6cJCifc24VYfNpSuY5PWF9X8KpydM:CC_movies:0",
			"added": 1611947061
		},
		{
			"topic_id": 1612350176,
			"title": "New URL for my proxy blocklist",
			"body": "Due to an hardware problem i redo my blocklist. Here the new URL:\n\nhttp://127.0.0.1:43110/16soWyYc1kTobaevbN25FJjWL2qf9PWvFG/",
			"added": 1612350172
		},
		{
			"topic_id": 1612680586,
			"title": "Galactichan streaming test without seedbox",
			"body": "Could you try to Watch lo \"svarione degli anelli - il ritorno del padrino\"? If the file had no Peers try to activate the \"seed all files on this post\"  option and wait. This should prevent the file to go dead share also without an H24 Always online node \n\nhttp://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/?:users/142sp6cJCifc24VYfNpSuY5PWF9X8KpydM:CC_movies:f28a4aaa-2559-40e4-a074-947f38b5b1dd:50#post-cef3c701-4ae8-468f-b267-82cbbf40b38e",
			"added": 1612680581
		},
		{
			"topic_id": 1612717482,
			"title": "SARS CoV 2 recombinant COVID-19 vaccine has shown to increase penis length by 3 inches in some individuals",
			"body": "SARS CoV 2 recombinant COVID-19 vaccine has shown to increase penis length by 3 inches in some individuals\n\nhttp://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/?:users/1EKvXyucrQhLkDpyN6WYa27Q5L1txduMBd:Covid:0",
			"added": 1612717476
		},
		{
			"topic_id": 1613397635,
			"title": "Hosting videos or any file on zeronet",
			"body": "Why dont use galactichan? 游때\n\nhttp://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q\n\nIf you Need a 24/24h seed or any help please Ask belle in a comment. I Will seed any file with only 2 exceptions\n\n- pedo/illegal porn\n\n-piracy\n\nI Will seed any political content or any other thing banner by clearnet as \"hate speech\" (pro Trump alt right novax etc) because i believe that the best weapon against \"hate speech \" Is healthy speech and not censor! I can seed Aso any other youtuber or normal vids with permissione and not illegal pornography Is allowed",
			"added": 1613397628
		},
		{
			"topic_id": 1613598698,
			"title": "What videos/music/files do you want to see on zeronet?",
			"body": "Ask What you want and i try to do my best!",
			"added": 1613598690
		},
		{
			"topic_id": 1614925727,
			"title": "Sync problems on zeronet",
			"body": "Today and Yesterday i cant find Peers on galactichan (with my seedbox online) and i have also problems in syncing other sites. Others here have similar problems?",
			"added": 1614925718
		},
		{
			"topic_id": 1614977977,
			"title": "Static HTML Wikipedia on zeronet",
			"body": "Maybe i can create this zite by exporting zim archives...anyone interested? I know that ipfs Wikipedia already exist but zeronet Wikipedia Will have the big advantage to be fully torified (useful for example in china)",
			"added": 1614977967
		},
		{
			"topic_id": 1615555101,
			"title": "Ovh datacenter destroyed by a Fire. Also my proxy Is offline",
			"body": "https://blog.malwarebytes.com/malwarebytes-news/2021/03/ovh-cloud-datacenter-destroyed-by-fire/\n\nAlso my proxy Is offline. Https://0net-preview.com\n\nIm awaiting news to understand if all data are Lost. My vps was hosted on sdb1 room  in Strasburg that was hit by the Fire but not entirely destroyed. For now all Strasburg machines are offline and Will be activated in the next days...awaiting news from ovh\n\nThis incident shows how decentralization Is necessary...all zites on my proxy are now online from single clients and other proxies! 游땕",
			"added": 1615555090
		},
		{
			"topic_id": 1616156082,
			"title": "COVID-19 pneumonia diagnosis by using CT texture mapping",
			"body": "http://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/?:users/1GvUcWCnBa2xpZE99rN4YywZtiH3sVTS2e:science:0\n\nI publisched my little research work on zeronet because none on academics want to listen me... this way is better than forgetting it in my hard drive. By using this method maybe we can diagnose COVID-19 pneumonia by using CT or RX instead nasopharyngeal swab. the same method maybe can be used also to evaluate the prognosis of the patients and also the same math can be used in other field than medicine. What do you think? i made also other works like this with other image types (from astronomy to material science) that i will happy to share here if anyone is interested",
			"added": 1616156070
		},
		{
			"topic_id": 1616701281,
			"title": "Galactichan lag, bad Sync, etc...",
			"body": "In the last days the site for me apoears Very slow...probably Is a Signa that user base are growing. 游땕 If you have these problems Just use auto seed option to download all files and play them later",
			"added": 1616701268
		},
		{
			"topic_id": 1617373305,
			"title": "Donald Trump censored interview",
			"body": "I hate the Donald for his ideas and for the Capitol Hill assault...anyway im also against any censorship! Here the complete interview censored by facebook\n\nhttp://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/?:users/1PZ675tP17kQ2i7kUq341tzzaL3c7YGbhT:pol:81e584ac-4cd8-41bc-abdb-6f54b2758de9:50",
			"added": 1617373291
		}
	],
	"topic_vote": {
		"1610991839_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": 1
	},
	"next_comment_id": 115,
	"comment": {
		"1610991839_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 1,
				"body": "> [smashbuckler](#comment_66_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): Seeing the messages: [...]\n\nI dont understand why ygeczite dont create these files...",
				"added": 1610996355
			},
			{
				"comment_id": 2,
				"body": "I see the board Vambracechan butbi cannot replay because my phone dont find Peers...",
				"added": 1610996532
			},
			{
				"comment_id": 3,
				"body": "> [smashbuckler](#comment_66_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): Seeing the messages: [...]\n\nV 0.7.2 improved Sync in my node. Try to upgrade",
				"added": 1610996599
			},
			{
				"comment_id": 4,
				"body": "Also my other PCs are seeing the vambrace board. How this Is possible?",
				"added": 1610996873
			},
			{
				"comment_id": 5,
				"body": "> [minion3665](#comment_8_1CDMo8F3AQjnZcsXLyf7p4xnNhGDQSUT5E): Seems to work: I'm now seeing stuff from other users\n\nYou re seeing all other users or only vambrace?",
				"added": 1610997046
			},
			{
				"comment_id": 6,
				"body": "Your nodes are finding Peers when publishing new contents on galactichan? My peer finding Is difficult and my post are failing often",
				"added": 1610997542
			},
			{
				"comment_id": 7,
				"body": "> [vambrace](#comment_10_1FjKyr9sfUy852mdxxEC7EtbfEWkUQUDTY): Connected 5 Onion 7 Possible connections 17\n\nYou re using tor Always?",
				"added": 1610997957
			},
			{
				"comment_id": 8,
				"body": "Maybe of we wait more nodes Will sync",
				"added": 1610998234
			},
			{
				"comment_id": 9,
				"body": "Could you Copy here some direct links to your post. I tried this before with another user and worked",
				"added": 1610998606
			},
			{
				"comment_id": 10,
				"body": "i already see your post. try this\n\nhttp://127.0.0.1:43110/1LCoF7Jk18aowWJS8u9Y39kHvZeNEUWeA6/?:users/1319FBhksJMRQzix5y3g8BCcdAR8VFvauH:test2:0",
				"added": 1610999318
			},
			{
				"comment_id": 11,
				"body": "try this. tell me if you see the pic and if you must confirm to download the thumbnail\n\nhttp://127.0.0.1:43110/1LCoF7Jk18aowWJS8u9Y39kHvZeNEUWeA6/?:users/1319FBhksJMRQzix5y3g8BCcdAR8VFvauH:test2:7bf9f15c-f4c6-4d08-9e52-77997b3d1d18",
				"added": 1610999766
			},
			{
				"comment_id": 12,
				"body": "i must go to sleep now... maybe only my hardware is isolated (i always see the boards created by hostfat and vanbrace, but i cannot see my post created on different hardware, the same post is often missed in other users hardware). while i'm sleping try to create some content and share it",
				"added": 1611001455
			},
			{
				"comment_id": 13,
				"body": "Not good...the pics dont be downloader automatically. I must fix this immediately!",
				"added": 1611002893
			},
			{
				"comment_id": 14,
				"body": "Ok i fixed the spoiler problem. Now all files shoukd be hidden withva new user.json",
				"added": 1611005999
			},
			{
				"comment_id": 15,
				"body": "> [styromaniac](#comment_2905_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Did you fix the Millchan Engine bug that occurs from deleting a hub?\n\nI only recompiled millchan from sources modifyng the thumb option and some other Little things. I dont how to work on the code. Actually the site have serius Sync problema...anyone can help me to fix this?",
				"added": 1611131762
			},
			{
				"comment_id": 16,
				"body": "I fixed the site error about domain and Sync. Now all should work! I also fixed the logo! Please create new users to share your files...the oldest ones dont work anymore\n\nI dont know if asking the millchan Dev to make all thumbnail hidden Is a good idea...my idea Is to use millchan engine to create a file sharing platform not an imageboard (in future i can also modify the gui) maybe hiding thumbs Is not a good idea for an imageboard, as  Someone told before",
				"added": 1611225163
			},
			{
				"comment_id": 17,
				"body": "Maybe a Better idea can be for the millchan team to create another instance of the site for file sharing purposes...surely they ca manage the site Better that in doing.\n\nActually postino pics and audio Is ok but the site dont work with vid files and dont allow uso and zip files. Anyone know how to fix these things?",
				"added": 1611233618
			},
			{
				"comment_id": 18,
				"body": "> [savuth](#comment_13_1BkXMCkwtTN6xTcZEEfMRPhvHJHaeUPH7E): Just in case, here's the Millchan source code\n\nIm trying to compile this using the latest version of ffmpeg.js compiled directly from sources... The version that toke from npm install dont work for me",
				"added": 1611342630
			},
			{
				"comment_id": 19,
				"body": "> [ikzhbq5jrcq](#comment_8_1DL7bu4fwvsvBA9KRoJTU481KkvbE6mSD): Not sure what you mean. npm install doesn't compile the ffmpeg.js dependency.You need to fetch the submodule and then run the Makefile inside its folder.The build should work fine after that.\n\nI compiled ffmpeg.js with its repo cloned and added It go my millchan clone...anyway i continue to have problems...maybe millchan devs could help me...",
				"added": 1611354760
			},
			{
				"comment_id": 20,
				"body": "I make a Total reset of the site by redoing It on a new URL. Now vid uploading works! Please update your link for further test!\n\nhttp://127.0.0.1:43110/1FruQqMYzXQZ2PHuYrvaoZT2H9fbkAYqBR\n\nThe next step Will be include more mine types...almost dove!",
				"added": 1611408244
			},
			{
				"comment_id": 21,
				"body": "Now you can upload also RAR files and ISO images! The site Is fully operative from now!",
				"added": 1611411693
			},
			{
				"comment_id": 22,
				"body": "> [styromaniac](#comment_2925_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Star Whores doesn't play. Are you sure you're using browser-supported codecs? MP4 is not always browser-compatible. Try encoding to WebM instead. I would ban any container that might not play in the browser, because this will get annoying quick.\n\nI used the same codecs that i used for ifs",
				"added": 1611423840
			},
			{
				"comment_id": 23,
				"body": "> [styromaniac](#comment_2926_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I see. Chromium is the issue.\n\nMp3s are working on chromium?",
				"added": 1611474369
			},
			{
				"comment_id": 24,
				"body": "> [ikzhbq5jrcq](#comment_9_1DL7bu4fwvsvBA9KRoJTU481KkvbE6mSD): You could update Millchan to help with the black thumbnails you've been getting. See 6ea3ea81.\n\nI updated the code but the problem seems not to be solved",
				"added": 1611495543
			},
			{
				"comment_id": 25,
				"body": "> [ikzhbq5jrcq](#comment_10_1DL7bu4fwvsvBA9KRoJTU481KkvbE6mSD): Bottom of the page still says you're using an outdated version (dfe30ba).Also, it doesn't completely prevent it. It just decreases the likelihood of it happening.It will use the frame at min(floor(config.video_thumbnail_position * video duration), 10s) instead of the very first frame.That might be yet again another black frame if you're unlucky but it should happen significantly less often than before.\n\nOk maybe i do some errors. Anyway now my First priority Is check of all the main functions of the site works before delete the private Key to block any try to destroy or manipolate the site. When this Key Will be Lost i can fix other minor bugs cresting a new fork",
				"added": 1611500973
			},
			{
				"comment_id": 26,
				"body": "> [styromaniac](#comment_2927_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Yes.\n\nI encoder the movie sperman in webm using a bitrate of 450 k and the standard ffmpeg options. This should work for you and any other. Also webm produce smaller files than mp4 without losing quality",
				"added": 1611501131
			},
			{
				"comment_id": 27,
				"body": "I destroyed the private Key of this zite. Because of this i cannot manage It anymore. The responsability of posting and sharing anything Is only yours! You are encouraged also to clone this site. The board /source/ contain the modified source code from millchan and all the instructions, feel free to clone It and fix any bug of you want. The uploading of iso files Is buggy from now...but you can successfully pur these files in zip archives and upload them. You can download a complete zip file by right clicking the file name and selecting \"save as\"",
				"added": 1611514079
			},
			{
				"comment_id": 28,
				"body": "Many report me that the site Is broken due to bad Sync of 2 files in dist dir. Can you confirm this? (Only fresh downloaded sites have this bug). Maybe i do One error before deleting the private Key. In that case i Will do another hard reset",
				"added": 1611637637
			},
			{
				"comment_id": 29,
				"body": "Probably i make an errore during the Signing of my last update... I reso my site at this new URL. I Will wait more before delete the private Key. Could you test this?\n\nhttp://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/",
				"added": 1611737002
			},
			{
				"comment_id": 31,
				"body": "> [sword00000](#comment_3_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S): So wait. If you delete your private key, then who is to say this will be a \"legal\" zite?\n\nIt Will be legal because you can efficently block illegale content of you want.  You respond only for What you share without thumbnails",
				"added": 1611862709
			},
			{
				"comment_id": 32,
				"body": "> [rushia](#comment_2_1BHG9R3dmE96xqoL9EjPxA1R4uSHzCRF26): Literally no different than just disabling thumbnails on regular Millchan then.\n\nExactly. But here this Is default option and you font have any risk",
				"added": 1611901213
			},
			{
				"comment_id": 33,
				"body": "> [sword00000](#comment_5_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S): But what if we want illegal content?\n\nThis Is a your problem not mine. You and only you Will be prosecuted  about this because i Will not download your content",
				"added": 1611901277
			}
		],
		"1611813026_1JprRAdVNFB2etoYRTiT4pnx9qLme3yhB4": [
			{
				"comment_id": 30,
				"body": "My new  filehosting zeronet zite \n\nhttp://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/",
				"added": 1611836960
			}
		],
		"1611909944_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 34,
				"body": "I m a doctor. In Italy other people Will obtain It in the next days or months",
				"added": 1611910442
			},
			{
				"comment_id": 35,
				"body": "> [reichama](#comment_72_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe): Not until it's circulated for at least two years. Not taking my chances with an untested vaccine, that hasn't been in use for at least two years.\n\nThis Is a good point. None can guarantee the absebce of long lasting side effects. Anyway i saw many patients with covid Risk their lifes...and i made a choose",
				"added": 1611914489
			},
			{
				"comment_id": 36,
				"body": "> [grouch0](#comment_27_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt): It's not a vaccine by any medical science definition, it's a science experiment to weed out the weak minded and feeble elements of society. Hopefully they have enough to go around for all those who want to be lab rats. Any sane healthy individual would take their chances given the 98.5% survival rate! [...]\n\nThe only way to integrate RNA in the human genome Is to use and enzyme called reverse transcriptase that convert It in dna.  You can find these enzyme only in retrovirus Like HIV . There Is no possibility that mRNA can integrate in the genome without this Enzyme that Lacks in humans. Nornally mRNA Is degraded After proteine syntesys when the and poly a final chain Is dedtroyed",
				"added": 1611914818
			},
			{
				"comment_id": 37,
				"body": "https://en.m.wikipedia.org/wiki/Polyadenylation more info here",
				"added": 1611914964
			},
			{
				"comment_id": 38,
				"body": "> [eze](#comment_9_1EgS5evb1aJWQuYS9kwn4jXyUgxfiWWoZ8): you make me fucking laugh!!! been around on zn for a while, don't you?\n\nTroll Just want to have fun! 游때",
				"added": 1611918495
			},
			{
				"comment_id": 39,
				"body": "> [scotcyguy2](#comment_68_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX): No...my body my choice\n\nYour liberty finish where the liberty of others begins...if you are infected other could be infected by you and die because of this",
				"added": 1611920456
			},
			{
				"comment_id": 40,
				"body": "> [reichama](#comment_73_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe): How can I infect other people that chose to get the vaccine? Isn't the vaccine designed to prevent exactly that?Besides, using that logic you'd have to ban cigarettes in public, since second hand smoke is exponentially more dangerous.\n\nNot all can take the vaccine because some people dont respond to It (for exampke immunodepressed) doctors also with vaccine protect the (at the Moment) unvaccinated patients",
				"added": 1611927089
			},
			{
				"comment_id": 42,
				"body": "> [getoutofthis](#comment_2_13UNccDwDNZx97EtsahFYrU3e5u4YGFbs7): @zeroseed4 ok vaccinator\n\n游뱎",
				"added": 1611935871
			},
			{
				"comment_id": 45,
				"body": "> [mfs](#comment_101_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W): I know three people who got the vaccine. All about 60 years old. One had just a sore arm, one got sick for a day, the other got very sick and said it was, for her, far worse than Covid. We need to get some real information about the side effects before making the decision to get it. Specifically how do people who have already had the virus react versus those who have not had it yet. I've had Covid and it wasn't bad for me. Not sure why I'd want to get the vaccine. If you think I'd do it to protect someone else from getting sick you are mistaken.\n\nWait. They vaccinated a person that had covid? In Italy we Will vaccinate these people later because Very often they have antibodies and se dont have a Great amount of doses. Anyway the most covid infections dont give any syntom. Covid is Dangerous in the Little % of people that have pneumonia or severe organ failure. The problem is that this virus spread Very fast and infect a Great Number of people and because of this Also a Little % of severe infections cannot be managed by hospitals because of the great numbers.",
				"added": 1611946636
			},
			{
				"comment_id": 46,
				"body": "> [mfs](#comment_102_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W): Correct. In the USA they will vaccinate you even if you've had Covid.  [...]\n\nIf in Italy we Will not reach the herd immunity probably they will do the same. In the past We must vaccinate for other diseases Like Measles  After some cases of ill people between the hospital personnel.",
				"added": 1611948584
			},
			{
				"comment_id": 47,
				"body": "> [aim64c](#comment_85_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): You claim to be a doctor.  Your liberties end where mine begin.  Healthcare is a right, yes?  Drop whatever you are doing and get to doing your job that is my right.\n\nSometimes we can rest my friend! 游뱎 ...but tomorrow you Will not see me. Happy? 游뱎",
				"added": 1611948668
			},
			{
				"comment_id": 48,
				"body": "> [aim64c](#comment_86_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): You missed my point.  I am saying that the logic you use completely removes your value as a human being.  If the 'rights' of others can be used to construe a requirement for you to do, or have done to you, something over the top of your will, then you are not a person.  You are a tool to be managed and maintained by whomever holds the capacity to rule you. [...]\n\nEthics and laws are applied to manage this. The only important thing, for any political choose, Is to take our responsabilities. We want the liberty to dont vaccinate? This can be ok if we know that many people could die because of full hospitals that Will not have the capacity to cure all ( In Italy anyone have the right to be cured. In usa this Is Very different...but maybe all should fight to have this right?)",
				"added": 1611949366
			},
			{
				"comment_id": 50,
				"body": "> [reichama](#comment_74_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe): This thing is going on for nearly an entire year now. The full hospital excuse begins to sound rather strange. You can build a new hospital within a year. But then all of this is rather strange, what with the masks that have holes for some instrumentalists and the grocery stores still being open instead of being forced to do delivery. [...]\n\nMaybe china can build an hospital within weeks...but in Italy we re working in 1900s buildings!游뱎 Aldo you Need much more doctors and nurses yo cure ill people....se dont have that people....",
				"added": 1612081765
			},
			{
				"comment_id": 51,
				"body": "> [aim64c](#comment_87_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): If the laws were meant to benefit or secure the general population, then there would not be a continual effort to create an infinitely expanding list of new ones.The idea that vaccines prevent or reduce the rate of hospitalizations has not really been supported in the instance of common illnesses - with a few notable exceptions.  There seem to be a certain percentage of the population which, for whatever reason and regardless of vaccine status, have an acute reaction to an infectious agent.  While there are risk groups which have been identified, the research has yet to isolate specific causal indicators as far as I am aware.The real moral challenge is how to handle the initial stages of a pandemic where immunity is expected to be low and hospitalizations at their highest.  To which, my response is that the greatest common factor among recovery indicators is baseline nutrition/health, the presence of family for care, and access/training in first/aid and basic healthcare techniques.  In the same way that I was taught how to triage and to treat wounds in the military, it should be part of common civic education to teach elementary care.  I had a friend with a festering puncture wound on her stomach who could not afford to go to the doctor - and I found out it had been that way for potentially months without healing.  Did she really need a doctor?  Perhaps for stitches to prevent scarring - but the real issue was the infection.  Peroxide wash/flush once a day and cover with sterile bandage.  Healed up in a week.  Take the bedding out and set it in the sun for several hours if you can't wash it - let the UV kill a bunch of the nasties on it.  Try to get out and take a walk or just sit in the sun for a total of around half an hour a day - help recycle the cholesterol back to vitamin D.Having family around to help when someone is sick and can't easily take care of their own needs helps a lot.  Having community action plans for how to handle health emergencies (or emergencies in general) should be part of the plan/strategy.  For example, in a mass casualty situation, the galley/mess hall (eating facility) becomes a defacto hospital for overflow.  To transfer this to the civilian world - does the local government have parks to host tents and supplies to prop them up - what about public sports arenas and stadiums?  Soccer fields could quickly be made to support helicopters.  These are the reasons we are supposed to have government.  Not to try and set up lockdowns and restrictions on our activity - but to give us focused plans of action to work through issues and crisis. [...]\n\nYou can critic the efficacy of covid vaccines due to short follow up but not the vaccine at all! Vaccines are the best wespons we have against infections diseases and they can eradicate some lethal ones Like tetanus snallpox or poliomelitis without inducing patogen resistence! (Within 10 years antibioticics Will be useless due to resistances...maybevwe Will have vaccines only...)",
				"added": 1612082132
			},
			{
				"comment_id": 52,
				"body": "> [getoutofthis](#comment_5_13UNccDwDNZx97EtsahFYrU3e5u4YGFbs7): there is no china virus. there is just stupid lies. It's just good propaganda that make you idiots believe it.\n\nWe dont know where sars cov 2 Born... Soneones revealed the virus in Europe at the begins of 2019....probably slowly adapted yo infect humans without give any synpthom",
				"added": 1612082267
			},
			{
				"comment_id": 53,
				"body": "> [getoutofthis](#comment_12_13UNccDwDNZx97EtsahFYrU3e5u4YGFbs7): @grouch0 Who made these \"scientific medical definitions\" ? Did you check these definitions with your own mind?  [...]\n\nSearch for the third face of the medal (cit). mRNA vaccines could be adapted Very fast in case of mutations. This Is out unique Hope..",
				"added": 1612082511
			},
			{
				"comment_id": 54,
				"body": "> [twc](#comment_9_139jrk6GJ36wCNbLqLLv3C71HHajSy4a4C): Well, that escalated quickly.\n\nI believe that the world Will be Better without censorship. We must talk with people Like novax and leave them to Express their fears in public. This Will help compliance to cures, more trust in the healthcare system.. and maybe should improve out relations with patients",
				"added": 1612082923
			},
			{
				"comment_id": 55,
				"body": "http://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/?:users/1EKvXyucrQhLkDpyN6WYa27Q5L1txduMBd:Covid:0\n\nIm not optimist...",
				"added": 1612117832
			},
			{
				"comment_id": 58,
				"body": "> [sword00000](#comment_34_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S): If the USA wasn't so cucked right now, we'd probably drop some bombs on you Mario/Luigi motherfuckers. Ragu and Provalon cheese eating guido fuckers\n\nYou forget the mafia! 游뱎游뱎游뱎",
				"added": 1612794605
			}
		],
		"1611929920_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 41,
				"body": "If the want to track youvthey could use your phones and in future also your fridge...dont Need the vaccine because of the Occam razor",
				"added": 1611930207
			},
			{
				"comment_id": 43,
				"body": "> [sword00000](#comment_6_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S): Apparently a few of you guys haven't been keeping up. Bill Gates has spelled it out already, and \"the vaccination plan\". Search for yourself. The specific Intention IS so that they can track you. And they will have an app for your phone as well. [...]\n\nWhy use vaccine QR code when they have hundreds of QR codes on any stuff they sell to track you?",
				"added": 1611935986
			},
			{
				"comment_id": 44,
				"body": "I Will see the video in the next days . Now i dont have enough time. If you want you can upload the vid in my zite. I Will seed It with my seedbox http://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q\n\nI know the norway facts. In my opinion more frailty people should not to be vaccinated...but because of this we Need to reach the herd immunity vaccinating as we can. Anyway This article report less than 30 deaths over 3000 vaccinated elderly. This Is less than 0.1% mortality instead the approx 10-20 % given if the virus infected all! Because of this Also in Italy we prioritize elderly with doctors and nurses",
				"added": 1611946219
			}
		],
		"1612067157_1PTLdvcq9U4wKG1J3Gr4z1wB8LWMypuHAA": [
			{
				"comment_id": 49,
				"body": "On millchan you auto download by default all thumbnails of clicked post. You can disabile this but you must know that if you dont this you are in danger if you without know click on and illegal content. To avoid this and to allow uploading of more type and bigger files i forked millchan with thumbs disabled. You can host this zite safely also without tor if you dont click voluntary on anything illegal. I believe that we  must exit from our darknet perspective and open to the world...the great censor Is coming... http://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q",
				"added": 1612081434
			}
		],
		"1612350176_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 56,
				"body": "> [styromaniac](#comment_2940_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Nekololi doesn't deserve to be on that list. I hadn't seen any illegal content coming from him. I won't endorse your blocklist.\n\ni inserted him here to protect the proxy. i don't want any pedo discussion on it (not only illegal content) to don't attract any officer or journalist or any other guy that will try to close it (i know he don't do anything illegal, but i'm forced to do this to avoid any problem). Remember that my proxy is a \"preview\" of zeronet for generalist people. if these people will see these discussions they can run away. Locally i'm using only MOAB",
				"added": 1612365657
			}
		],
		"1612680586_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 57,
				"body": "> [styromaniac](#comment_2953_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It streams without buffering.\n\nGood!",
				"added": 1612703916
			}
		],
		"1612779139_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 59,
				"body": "We must continue to fight! Dont lose the Hope!",
				"added": 1612794776
			}
		],
		"1612717482_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 60,
				"body": "游뱎",
				"added": 1612846776
			},
			{
				"comment_id": 61,
				"body": "> [arione](#comment_22_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY): Pfitzer is extremely desparate HAHAHAAnything just to get the jabs out.\n\nLook at the journal name following the link...游뱎游뱎游뱎",
				"added": 1612866775
			}
		],
		"1613331326_15TKSujroWTFtZsNqFnpejDA6JsnvXXrCK": [
			{
				"comment_id": 62,
				"body": "I created the successore of ifs. A new file hosting zite on zeronet. Galactichan http://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q",
				"added": 1613397251
			},
			{
				"comment_id": 69,
				"body": "> [krokodila](#comment_1_15TKSujroWTFtZsNqFnpejDA6JsnvXXrCK): !Internal error: TypeError: actionBigfileUploadInit() takes 4 positional arguments but 5 were givenUiWebsocket.py line 79 > UiWebsocket.py line 232 > MergerSite/MergerSitePlugin.py line 177 > MergerSite/MergerSitePlugin.py line 147 [...]\n\nTry to redownload the site. Can you link me the MP3 that give you this error? I never see this",
				"added": 1613509816
			},
			{
				"comment_id": 71,
				"body": "> [krokodila](#comment_2_15TKSujroWTFtZsNqFnpejDA6JsnvXXrCK): Is it possible to upload files from within the directory structure, not using the browser?\n\nNo as i know. Is the same of millchan",
				"added": 1613539437
			}
		],
		"1613397635_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 63,
				"body": "> [xealits](#comment_1_1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6): but why not post it on kopykate?\n\nKopikate has auto-previews . Using thst site can pose legal issues Like millchan. Also i prefer i site thst allow ti host any file type and can be used Also for discussions",
				"added": 1613415021
			},
			{
				"comment_id": 65,
				"body": "> [styromaniac](#comment_2966_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): KopyKate is moderated. You could have given a better answer like MP3 and archive support.\n\nModerated? Who Is the mod?",
				"added": 1613496042
			},
			{
				"comment_id": 66,
				"body": "> [styromaniac](#comment_2967_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): quantumkitty\n\nI prefer a Total anarchy moderation where single users are responsible of What they share. What Will happen if quantumkitty Will leave zeronet One day? What happen if some material il legal in Italy and for example illegal elsewere? For example parodies in Italy are legal but in usa are copyright violazions. Another exeption Is the Fair use, that Is legal in usa and illegal in italy",
				"added": 1613496873
			},
			{
				"comment_id": 67,
				"body": "> [styromaniac](#comment_2968_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Who gives a shit about copyright? Neither her nor I.\n\nI can give other examples. Lolicon Is legal in Italy but illegal in other countries. Simulated  Violent pornography Is legal in Italybut not in UK. Pornography Is legal in Italy and illegal in Iceland. How you can create a legal site everywere? Anarchic moderation Is a good way! Any user in that way can host and share only legal things in his country without censor any other",
				"added": 1613507638
			},
			{
				"comment_id": 68,
				"body": "Another example Is telegram . This app have a Great userbase because Is simple and also because its used mostly for legal purposes. If zeronet Will host only alt right terrorist pedo and novax Will remain sn unused darknet! We must take care of legal aspect!",
				"added": 1613507808
			},
			{
				"comment_id": 70,
				"body": "> [krokodila](#comment_4_15TKSujroWTFtZsNqFnpejDA6JsnvXXrCK): no piracy???\n\nI dont want to go in jail my seedbox ip Is public. Anyway you can upload in the zite all material you want. Only i Will not seed it",
				"added": 1613539321
			},
			{
				"comment_id": 77,
				"body": "> [krokodila](#comment_5_15TKSujroWTFtZsNqFnpejDA6JsnvXXrCK): why don't you use tor?\n\nThe seedbox Is a public PC registered with my real name. Using tor Is safe only if you own the machine and None can access it",
				"added": 1613726299
			}
		],
		"1613425717_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 64,
				"body": "Debian stabile with nonfree repos and firmwares",
				"added": 1613486969
			}
		],
		"1613615872_1ipaCWPxEBGaBE8f6JuA8YCztfh6LL6rR": [
			{
				"comment_id": 72,
				"body": "No",
				"added": 1613626225
			},
			{
				"comment_id": 73,
				"body": "> [pornoking](#comment_8_1ipaCWPxEBGaBE8f6JuA8YCztfh6LL6rR): after a certain number of galleries that i have posted now i get this message when i try to post Content, signing failedInclude too large 5042966B > 5000000B\n\nMaybe only One file Is too big in your last upload. On galactichan i should have increased single file size. Nornally the max fikesize for single files Is 500 MB",
				"added": 1613639229
			}
		],
		"1613642362_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 74,
				"body": "Im not agree with this vid but in against censoring them. Can i upload all this on galactichan? I Will seed it",
				"added": 1613651460
			},
			{
				"comment_id": 79,
				"body": "Here the video on galactichan with my comment\n\nhttp://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/?:users/1EKvXyucrQhLkDpyN6WYa27Q5L1txduMBd:Covid:9de12c1b-866c-48e2-85a1-28a19892e491",
				"added": 1613727363
			}
		],
		"1613652791_1LqdvKDPZkkuq472J2ZdANDSd1JNK7CrHW": [
			{
				"comment_id": 75,
				"body": "You are the author of this vids? I can Copy all your Channel on my zite and seed It if you want",
				"added": 1613653432
			},
			{
				"comment_id": 76,
				"body": "> [dweb](#comment_1_1LqdvKDPZkkuq472J2ZdANDSd1JNK7CrHW): no i'm not the creator [...]\n\nGreat!  I know that all vids on sites decentralized Like dtube are hosted on different nodes Like zeronet zites. All these site content because of this are copyleft?",
				"added": 1613654181
			},
			{
				"comment_id": 78,
				"body": "This movie on zeronet\n\nhttp://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/?:users/142sp6cJCifc24VYfNpSuY5PWF9X8KpydM:CC_movies:49046ef0-7305-48df-91ed-373013b3f630",
				"added": 1613726420
			}
		],
		"1613977895_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 80,
				"body": "Moab in my opinion Is good to block illegal content. If you want to block also pedo discussions you can and also my blocklist (0net-preview blocklist)",
				"added": 1613986253
			},
			{
				"comment_id": 81,
				"body": "This Is my blocklist\n\nhttp://127.0.0.1:43110/16soWyYc1kTobaevbN25FJjWL2qf9PWvFG/\n\nMoab was already linked by storymaniac below",
				"added": 1614058482
			},
			{
				"comment_id": 82,
				"body": "> [styromaniac](#comment_2972_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It's styromaniac, not storymaniac.\n\nEheheh ...Sorry! 游때",
				"added": 1614087582
			},
			{
				"comment_id": 83,
				"body": "> [aim64c](#comment_101_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): Ah, spacechan.... Freiza Planet 419 of the chans.... of course there would be one here.The whole point of the millchan engine zite is for it to be a model for cloning.  Millchan, itself, you have blocked for some reason.I'm not completely disagreeing with the idea that these zites could contain CP - the way ZN, itself, works is that the userbase of a zite could all pretty much choose to mute a board on the zite and the users of that particular board could continue to use it like normal and none of the other users would really know it exists until someone new shows up and says: \"So, what's with the pegging fanatics board?\" [...]\n\nGalactichan blocks all media downloads by default to solve this problem. You dont Need to block an user for illegal content. You can talk with these people without sharing illegal content of you want. \n\nAlso the millchan engine Is Very flexible. You can seed/ban single users or entire boards",
				"added": 1614233028
			}
		],
		"1614076622_1JZUqZCoYgeS1STseW5nQPN2Pfh19F7Vuf": [
			{
				"comment_id": 84,
				"body": "@melodysheepfan you should stay online as possibile as you can. Another good option Is to tell when you are online in order to seed your files to your costumers. I cannot seed your copyright content on my seedbox",
				"added": 1614251671
			}
		],
		"1614206367_1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6": [
			{
				"comment_id": 85,
				"body": "If you publish It on galactichan i Will seed this",
				"added": 1614251906
			}
		],
		"1614409620_172Vi8HghL8PzkqoAVbGbfvE456rnfkWES": [
			{
				"comment_id": 86,
				"body": "Zeronet Is open source software. Probably your antivirus block It because a false positive due to ita P2P nature",
				"added": 1614427471
			}
		],
		"1614910002_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": [
			{
				"comment_id": 87,
				"body": "Welcome! From now your thread Will be trending topic as mine! 游땕 (I do Pfizer vaccine) 游뱎",
				"added": 1614925600
			},
			{
				"comment_id": 88,
				"body": "> [anonysan](#comment_19_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna): pajeet? Is that you?\n\nNo 游뱎 i dont know Who pajeet Is!游뱎 (My real name Isn t hidden)",
				"added": 1614977731
			},
			{
				"comment_id": 93,
				"body": "After vaccine inoculation some have Fever and feels weak...its normal. This should disappear within some days",
				"added": 1615196624
			}
		],
		"1614952464_15PBP7E1m1G82N5r5AoXUFMinSuqD3KnBT": [
			{
				"comment_id": 89,
				"body": "> [heilzero](#comment_1_15PBP7E1m1G82N5r5AoXUFMinSuqD3KnBT): This zite said its version is 0.7.2 in content.json. Forking exists?GalactiChanhttp://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/\n\nYou can update to 0.72 by using zeronet updated. This fix most Sync bugs",
				"added": 1614977828
			}
		],
		"1614977977_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 90,
				"body": "In theory i can create a site with One HTML Page for every object of the encyclopedia....but i dont know ti set all file except index.html as optional. Seoneone know how? Seeding for me Is not a problem because i have a 1 TB SSD Always online  游때",
				"added": 1615153099
			},
			{
				"comment_id": 92,
				"body": "> [styromaniac](#comment_3015_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Click here.\n\nGood!",
				"added": 1615196485
			}
		],
		"1615161713_16CnipWrmQT4vDor6t2G7QRwartbUcDmMg": [
			{
				"comment_id": 91,
				"body": "Galactichan http://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/",
				"added": 1615196405
			}
		],
		"1615555101_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 94,
				"body": "> [binary1173](#comment_71_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G): Backups?\n\nI have another vps with similar zites seeded that can put online by using some Little fixed of necessary...but i prefer to wait, i dont have time to dedicate to this now",
				"added": 1615568604
			},
			{
				"comment_id": 96,
				"body": "Ovh contacted me today. The proxy Is Lost and they Will give me a new free vps within days...awaiting the new vps ti recreate the proxy",
				"added": 1615806058
			},
			{
				"comment_id": 97,
				"body": "I Will post some of my studies on zerotalk tech...anyway my proxy Is back online! 游땕 (Restored from a manual backup). This should work as before but i can miss some zites, please tell me of you want your zite in the proxy",
				"added": 1615816237
			},
			{
				"comment_id": 106,
				"body": "> [geekless](#comment_285_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): @zeroseed4, [...]\n\nI Will add these site in the next update of the proxy",
				"added": 1616688772
			}
		],
		"1578088043_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 95,
				"body": "Maybe i can put here some of my researches. Thanks for remembering 游땕",
				"added": 1615628576
			}
		],
		"1615850687_139pHaxesZa11czwptXVY62ZrNWUh4NxRQ": [
			{
				"comment_id": 98,
				"body": "Yes. Use Galactichan http://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/\n\nCompress the vid in webm low definition quality to allow smooth P2P streaming  with low bandwidth connections. Use from command line this command: ffmpeg -i filename.mp4 filename.webm or use a gui Like mistiq. If you Need a H24 seed Ask me 游땕",
				"added": 1615870108
			}
		],
		"1615948566_19RaaMJeGXcJzLxeKXWH9pynfjgmm33VZS": [
			{
				"comment_id": 99,
				"body": "Im running 5 zeronet servers! 游때 (1 proxy 3 trackers and 1 seedbox)",
				"added": 1615961124
			},
			{
				"comment_id": 100,
				"body": "> [papull](#comment_38_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G): how does one run a zeronet server?\n\nSimply using zeronet on a vps or a dedicated server",
				"added": 1616002630
			}
		],
		"1616156082_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 101,
				"body": "> [anonymouslogin](#comment_267_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Thank you for posting this here, I would not have found it without the link. I've just started to review the findings, but amazing work so far!\n\nThanks! 游땕",
				"added": 1616193027
			}
		],
		"1616231596_1CQzPmMXnfH3eJvpKGNfsVnUXxiHZM3jp2": [
			{
				"comment_id": 102,
				"body": "Too many lurkers here. Galactichan bandwidth usage growing everyday http://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/",
				"added": 1616244295
			},
			{
				"comment_id": 103,
				"body": "> [ssdifnskdjfnsdjk](#comment_1012_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): When i have tried to publish my comment, it said:Content signing failedFile not allowed: blacklist.json(i selected my Zeroid cert)\n\nTry to generate a galactichan user. Sometimes also rebooting zeronet fix this",
				"added": 1616449300
			},
			{
				"comment_id": 112,
				"body": "> [geekless](#comment_295_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): ZeroNet trackers are limited to accepting v2 addresses only in the current implementation.We have 5 months to fix the code and upgrade the trackers (or run new ones).\n\nFix the code and i Will convert my trackers",
				"added": 1617388688
			}
		],
		"1616503348_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 104,
				"body": "Im with you! 游땕 Im not a programmer but i can do some tedious stuff or translating text in italian, promoting the project or give a dedicated seedbox. Please dont broke compatibility with actual zites",
				"added": 1616615890
			}
		],
		"1616648188_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 105,
				"body": "Probably do this to delete old discussions and keep the site light. But i disagree with this",
				"added": 1616658791
			},
			{
				"comment_id": 107,
				"body": "> [vanishingghost](#comment_3_14bffrVoz5qMyCGxNsJRbCPoCMYPysmZci): The feature is good and necessary for zite owners who want to block bots and spammers. Censorship/control limited in a certain zite should be allowed as far as banned users can make own zites for them. Btw, I want archived_before_relative: delete contents specified seconds before.\n\nIn my opinion moderation should be done by users not by site owner.  Or the owner must take the choose to create monarchist or anarchist community Like the actual zeronet",
				"added": 1616741829
			}
		],
		"1616765649_165aBifCkjbWxo7rEf9ZaiCv39NpinQAtp": [
			{
				"comment_id": 108,
				"body": "Use Galactichan. With my site you can auto seed file smaller than 10mb with a click or seed also specific files or users\n\nhttp://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/",
				"added": 1616776338
			}
		],
		"1617039004_1EDgrafDZQ8H6WLq6jHin6NKfQ8qZKzA1C": [
			{
				"comment_id": 109,
				"body": "Zeronet Is One \"Plan b\"... decentralized Networks are plan b...we Just spread them 游땕",
				"added": 1617041991
			}
		],
		"1617244448_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 110,
				"body": "> [geekless](#comment_294_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): By the way... Should I implement the dislike button for ZeroTalk++?\n\nIn my opinion i want features Like new, top order and controversial. In the First order type you Will see newer posts, in top order you Will see most liked posta in controversial you Will see post with an aversge points near ti zero but with a Great amount of votes",
				"added": 1617309890
			}
		],
		"1617049867_14yMvcYduUdrbFWW5taEgW1HgaFJgoSxZT": [
			{
				"comment_id": 111,
				"body": "Galactichan. No miners here! 游때\n\nhttp://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/",
				"added": 1617373377
			}
		],
		"1617523821_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": [
			{
				"comment_id": 113,
				"body": "Galactichan \nhttp://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/",
				"added": 1617561367
			},
			{
				"comment_id": 114,
				"body": "> [darkoo](#comment_27_1HmG8hXdvaaMtgoxpkvNXBVfCoB44Yv3aG): I would love that the videos aren't shared in pools, but that each can only seed the videos he wants...\n\nYou can seed also single videos by clicking the seed Botton above each file",
				"added": 1617738902
			}
		]
	},
	"comment_vote": {
		"8_19RaaMJeGXcJzLxeKXWH9pynfjgmm33VZS": 1,
		"1_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD": 1
	}
}