{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1571457668,
			"title": "Joker Torrent",
			"body": "All the torrent sites that I am familiar with deleted all Joker (2019) torrents a couple days ago. Does anyone have a magnet to a decent quality file?",
			"added": 1571457667
		},
		{
			"topic_id": 1571488787,
			"title": "Malicious login attempts.",
			"body": "I've had over 10 thousand attempts to log into my ZN server with ssh in the last 24 hours. \n\nAny other ZN'rs have similar experiences?",
			"added": 1571488785
		},
		{
			"topic_id": 1571715752,
			"title": "Board with no posting limit 1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh",
			"body": "Just a reminder that there is a board just like this one, but without a posting limit. \n\nlocalhost :43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh",
			"added": 1571715749
		},
		{
			"topic_id": 1572403703,
			"title": "Some notes from a dead guy",
			"body": "On June 8th 2019, David Goldberg passed away in his Brooklyn apartment. No cause of death was given. A cover-up began. David's friends saved his Youtube & were able to access his safe to recover audio files, classified docs & other personal items. \n\nSignificant Dates: \n11-03-2019\n12-16--19 \n4-4-20  Revocation of passports begins for certain identified individuals and groups. \n10-19-20 \n\nLand and bank seizures, executions begin. Unknown date. \n\n37.827059, -109.806067 block 985IGY\n595,000ft^2, 5000 prisoners ages 2-12\n\nExpect 3 day power outages in cities of over 1M. \nExpect a 37 day outage. City is yet undetermined. \nOutages will be blamed on China, Russia, and Iran.",
			"added": 1572403699
		}
	],
	"topic_vote": {},
	"next_comment_id": 15,
	"comment": {
		"1571440312_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 1,
				"body": "$1000 is absolutely nothing. I'd rather have the cheeto troll, because hurts the fee fees of people who hate me.",
				"added": 1571457292
			}
		],
		"1571185468_15io4gegLAkgg9jNErcMyY6bpD64HULMCw": [
			{
				"comment_id": 2,
				"body": "Do whatever. Just don't talk to much or you'll run out of quota and have to get a new id.",
				"added": 1571457360
			}
		],
		"1571715752_1EDsNLHRwPW8Ajp4dScjJaBxXK1bLqHx3Z": [
			{
				"comment_id": 3,
				"body": "Thanks randomshits for showing us this last month.",
				"added": 1571715811
			},
			{
				"comment_id": 4,
				"body": "> [xcape2net](#comment_472_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): For some reason this link takes me to my home page on the clearnet.\n\nsubstitute 'localhost' whatever IP address you use for your ui IP.",
				"added": 1571794997
			}
		],
		"1572028122_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 5,
				"body": "I don't mind it at all. The only thing that sucks is occasionally having to change id's when I run out of room on ZeroTalk. Occasionally new people come in, and that's fine. But it's nice seeing the old time hangers-on still active here and there. I'd talk a poorly trafficked room full of familiar, smart people over the clearnet dumpster fire any day of the week.",
				"added": 1572232061
			}
		],
		"1572234510_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m": [
			{
				"comment_id": 6,
				"body": "I saw this. I think they realized that they had to mention it in order to avoid being called out, but didn't want to approach the subject strong for some reason.",
				"added": 1572318039
			},
			{
				"comment_id": 7,
				"body": "> [almostsoul](#comment_38_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): If the media is worried about being called out, then it means American society has already bent the knee to ISIS supporters within its own borders. But I am inclined to believe the opposite: that they (the media) create the norms, rather than respond to them.\n\nI think it's beyond doubt that our social norms are created by the media and the loud minority.",
				"added": 1572403167
			}
		],
		"1572403703_1EDsNLHRwPW8Ajp4dScjJaBxXK1bLqHx3Z": [
			{
				"comment_id": 8,
				"body": "> [randomshits](#comment_227_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): nobody cares\n\nNo need to reply to things you don't care about.",
				"added": 1572466442
			}
		],
		"1572478148_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 9,
				"body": "It's mostly because of zeroshits. That guy is such an unnecessarily rude cunt.",
				"added": 1572481457
			},
			{
				"comment_id": 11,
				"body": "There is also the possibility that many of the new comers have to change ID's over time for various reasons. While I was trying to figure out how to get my server set up and stable I went through a couple of ID's. Later on I had to change it again after I wiped my system and started over with some security improvements. We very well may not be recognizing them. I was AlternedLeanings, TrustedLeanings, and some other that I forget.",
				"added": 1572572846
			}
		],
		"1572464062_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 10,
				"body": "They don't care. As long as they're able to remove anyone who disagrees, they won't mind the small hit to their user base.",
				"added": 1572481532
			}
		],
		"1547493721_1MRW66FjfH9yeJSa5ZmxWM1o4WZVBDpGBJ": [
			{
				"comment_id": 12,
				"body": "Every single muslim must die if there will ever be peace.",
				"added": 1572572916
			}
		],
		"1571457668_1EDsNLHRwPW8Ajp4dScjJaBxXK1bLqHx3Z": [
			{
				"comment_id": 13,
				"body": "I so finally got a hold of a copy and watched it. It was a complete waste of time. I'm unsure how to enjoy this movie, because it was disorganized, low quality garbage. It lacked character development, a proper plot, and didn't have a proper ending. Utter dog shit.",
				"added": 1572573034
			},
			{
				"comment_id": 14,
				"body": "> [quantumkitty](#comment_238_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): I don't think there's a better way one could make a joker movie to be honest. It's meant to be bleak and unsatisfying.. social commentary basically.\n\nI thought about that, but it doesn't even present as believable. They tried so hard to be gritty and dark that they totally  ruined it. It honestly could have been pretty decent if the actor they chose was at least slightly competent.",
				"added": 1572573383
			}
		]
	},
	"comment_vote": {
		"1155_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2_1JZKKzmvBupAZGgJuWQzmNLo1MBs5N9rn": 1,
		"7_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"277_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1
	}
}