{
	"questions": [
		{
			"question_id": 1514496913600,
			"title": "How do i delete my site/zite entirely?",
			"body": "Hello, if i clone site like ZeroTalk for testing purpose and then decide i want to completely remove it and i will not want other people to seed it and even seeders be able to access it, how can i entirely remove it possibly including freeing its zeronet address? Thank You",
			"tags": "delete zite,delete site,remove site",
			"date_added": 1514496913600
		},
		{
			"question_id": 1516529047700,
			"title": "Meaning of the ZeroHello function \"Check files\" and File update failed?",
			"body": "Hello, please what is the meaning of the ZeroHello function \"Check files\" which results in error: \"2 File update failed\"?",
			"tags": "check files",
			"date_added": 1516529047700
		},
		{
			"question_id": 1517042795300,
			"title": "How can i seed my zeronet data folder simultaneously on other Linux headless machine?",
			"body": "Hello dear zeronet users, i wanted to ask for a help/a guide on how do i seed my existing zeronet data directory on other, headless linux (centos/ubuntu) machine. I want to be able to continue using my zeroid on my current PC, i just want to add one seed to everything. Hope it is possible and will make no collision. I am connected to more than 500 sites and need to reduce my current Windows 10 PC connections because it is causing issues. I just do not know quick and proper way to initiate seeding when i copy over data folder and if that is actualy possible and will not cause collision when i use that data dir also on my PC.",
			"tags": "zeronet",
			"date_added": 1517042795300
		},
		{
			"question_id": 1517178354800,
			"title": "How to restore deleted content.json",
			"body": "Hello, what are methods to recover accidentaly deleted content.json file of the own zeronet site / zite?\nHere user managed to do so: http://127.0.0.1:43110/peeper.bit/?Post/1White24UrrwQrD86o6Vrc1apgZ1x1o51/13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE/1517176792\nI think what he did was to click Sign & Publish and then cancelled the operation when it prompted for the private key. I may be wrong.",
			"tags": "zeronet",
			"date_added": 1517178354800
		},
		{
			"question_id": 1518515710926,
			"title": "How do i backup my ZeroMe profile please?",
			"body": "Can anyone please suggest how do i backup my ZeroMe profile before i use \"ZeroMe Unfuck\" (search at ZeroHello)?\nI already found the ZeroMe address to be 1MeFqFfFFGQfa1J3gJyYYUvb5Lksczq7nH and found same named folder in ZeroNet's data directory. But i do not know what file to backup.",
			"tags": "zerome",
			"date_added": 1518515710926,
			"solution_id": 1519292129004,
			"solution_auth_address": "19pJyuDtmDMaXxWCWB4bHdpna37x1TiNMa"
		},
		{
			"question_id": 1555530680166,
			"title": "What is the difference between cloneable and not cloneable site?",
			"body": "i was thinking i can still copy not-cloneable site directory contents into my site directory. But will be there anything missing when comparing to the site that is cloneable? What that will be?\n\nbtw: i think cloneable status is changed in main content.json file of the site",
			"tags": "cloning,clone",
			"date_added": 1555530680166
		}
	],
	"comments": [
		{
			"comment_id": 1517043021900,
			"reference_type": "q",
			"reference_id": 1517042795300,
			"reference_auth_address": "1CiFGk8MdmQAYacFejYdjUkQcN5jYmoDYh",
			"body": "the linux seedbox will have different IP, GEO location, is a VPS in pro datacenter",
			"date_added": 1517043021900
		},
		{
			"comment_id": 1517483042476,
			"reference_type": "q",
			"reference_id": 1517042795300,
			"reference_auth_address": "1CiFGk8MdmQAYacFejYdjUkQcN5jYmoDYh",
			"body": "Thank you, by the way, here is mentioned on how to setup seed server/seedbox : http://127.0.0.1:43110/16Go5kc2U9Ff4jeaY8kYiDEgpMYdgyboPY/?Topic:2_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/How+to+Install+and+run+Zeronet+on+a+Raspberry+Pi",
			"date_added": 1517483042476
		},
		{
			"comment_id": 1519724399102,
			"reference_type": "a",
			"reference_id": 1519292129004,
			"reference_auth_address": "19pJyuDtmDMaXxWCWB4bHdpna37x1TiNMa",
			"body": "So i do not have to backup anything inside ZeroMe zite data folder? Note that i am talking about ZeroMe profile, not ZeroNet profile (which is backed up using users.json).",
			"date_added": 1519724399102,
			"updated_date": 1519724450830
		}
	]
}