{"users_books":[{"userid":"1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo","b_id":"f0f7be4d90eac05794aa2b0066a173bb","t":"Kim Thuy - Ru (v5.0) (epub)","a":"Kim Thuy","i10":"286746532X","i13":"9782867465321","asin":"","p_m":null,"p_y":null,"d":"Une femme voyage à travers le désordre des souvenirs : l'enfance dans sa cage d'or à Saigon, l'arrivée du communisme dans le Sud-Vietnam apeuré, la fuite dans le ventre d'un bateau au large du golfe de Siam, l'internement dans un camp de réfugiés en Malaisie, les premiers frissons dans le froid du Québec. Récit entre la guerre et la paix, ru dit le vide et le trop-plein, l'égarement et la beauté. De ce tumulte, des incidents tragi-comiques, des objets ordinaires émergent comme autant de repères d'un parcours. En évoquant un bracelet en acrylique rempli de diamants, des bols bleus cerclés d'argent ou la puissance d'une odeur d'assouplissant, Kim Thúy restitue le Vietnam d'hier et d'aujourd'hui avec la maîtrise d'un grand écrivain.\n\nA runaway bestseller in Quebec, with foreign rights sold to 15 countries around the world, Kim Thúy's Governor General's Literary Award-winning Ru is a lullaby for Vietnam and a love letter to a new homeland.\n\nRu. In Vietnamese it means lullaby; in French it is a small stream, but also signifies a flow - of tears, blood, money. Kim Thúy's Ru is literature at its most crystalline: the flow of a life on the tides of unrest and on to more peaceful waters. In vignettes of exquisite clarity, sharp observation and sly wit, we are carried along on an unforgettable journey from a palatial residence in Saigon to a crowded and muddy Malaysian refugee camp, and onward to a new life in Quebec. There, the young girl feels the embrace of a new community, and revels in the chance to be part of the American Dream. As an adult, the waters become rough again: now a mother of two sons, she must learn to shape her love around the younger boy's autism. Moving seamlessly from past to present, from history to memory and back again, Ru is a book that celebrates life in all its wonder: its moments of beauty and sensuality, brutality and sorrow, comfort and comedy.","p":"","l":"en","f_n":"book_files/Kim Thuy - Ru (v5.0) (epub).epub","f_s":2286622,"f_t":"epub","f_u":"/ZeroNet-Internal/BigfileUpload?upload_nonce=ca188bd74b35a76b457b31db93dad1b510889cce19cbb01bf7ca374a5d10d48f","g_id":"7574245"}],"shelves":[{"name":"Want to Read","books":[],"index":0},{"name":"Read","books":[],"index":1},{"name":"Pending","books":[],"index":2},{"name":"Uploads","books":[],"index":3}]}