{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1603893360_1Avzdjh9nPaxNw5XoJwQz3veJEYSxu1wfd": [
			{
				"comment_id": 1,
				"body": "> [styromaniac](#comment_2618_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): They want music, movies and technology subjects, not documentaries of disturbing subjects, is what I gathered.\n\ni'm giving these things on IFS by using a large seedbox and this zite is groving faster with well seeded files of all types! (my latest uploads are very old blues mp3s, almost impossible to find on clearnet, requested from another user. These files have much more seeds on IFS than in bittorrent network!)\n\nIn my opinion the seedboxes is the best way to make zeronet grow, and i prefer to seed IFS instead KopyKate for some reasons:\n\n-compatible with all file types (not only videos)\n-no previews that can be a legal weakness if illegal content is uploaded\n\nTry it!  (i prefer your IFS mobile to the original IFS, it is less bugged) http://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6\n\nWe need more different files here to grow! :)",
				"added": 1603914327
			}
		],
		"1601641777_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": [
			{
				"comment_id": 2,
				"body": "Hosted on IFS:\n\nhttp://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/index.html?view:item+id:15f1_17MmT5Gr5cN1t3FzJdE2fsr68pXvHsQzBU_item_2+type:video",
				"added": 1604603942
			},
			{
				"comment_id": 3,
				"body": "> [styromaniac](#comment_2670_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Poor audio quality.\n\nAudio and video poor quality! :D IFS can't support high audio and video bitrates due to its p2p nature, but is still playable also under TOR. If you want a better quality you can use bittorrent",
				"added": 1604817135
			}
		],
		"1607816193_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 4,
				"body": "This is not your fault. Today an asshole uploaded too many hentai movies together on the zite and by doing this he saturated my dedicated server. I cannot listen my music for the entire day! Please don't upload too many big files together!",
				"added": 1607818251
			},
			{
				"comment_id": 5,
				"body": "> [sword000000](#comment_39_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie): Someone needs to fix the zite code. Auto limit uploads if needed.\n\nIn my opinion an upload limit isn't the way. If i want to upload an entire music album i can do this.  Also for me now trackers isn't a problem because if you look the file peers only seeds are \"offline\" (the seedboxes). I uploaded some new music some hours ago and the problem returned.  I have 2 ideas to solve this:\n\n- Hide new files uploaded on IFS+ because with only one PC seed they are impossible to download and also users that try to download them create too many requestes that brings only incomplete peers and high pointless usage of the network. By hiding these files in first hours only seedboxes (with auto download of optional files enabled)  begin to download them and, after some hours, (i suggest 4 hours) these servers will begin to distribute them with more bandwidth to create new seeds. An alternative is to display an alert when an user try to download a new file. only if the user click \"yes\" the download/stream will begin\n\n- Create more seedboxes because the network is groving fast and the ones already online cannot manage big peaks.  (i ask for others collaboration)",
				"added": 1607866797
			}
		]
	},
	"comment_vote": {}
}