{
	"title": "卡拉卡拉的博客",
	"description": "卡拉卡拉的博客群：\nhttps://t.me/joinchat/JwVNhhCb_w8HzfD70tGO2w\n",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 13,
	"demo": false,
	"modified": 1562683766,
	"post": [
		{
			"post_id": 12,
			"title": "中國恐怖組織對湘族人民的殖民統治和種族滅絕——摘自《諸夏紀事本末》第四卷",
			"date_published": 1562683621.81,
			"body": "1949年3月，中国恐怖组织成立侵湘（Fuhsiangria）殖民政府。\n\n满洲沦陷区匪军干部和山东老干部构成这个殖民政府的核心，晋国沦陷区和中国各省干部培训班的学员为核心打杂。湘族人民除极少数统战花瓶外，沦为赤裸裸的降虏，蒙受了自湘军崛起，更不用说辛亥独立以来闻所未闻的奇耻大辱。殖民政权对湖湘民族的尚武传统极为忌惮，甚至在执行了多次比卡廷大屠杀更惨烈的镇压以后，仍然担心湘族精英的孤儿寡妇卷土重来。文革时期的道县大屠杀，正是为解除这些殖民者内心的恐惧而发动的。中国恐怖分子之所以比满洲殖民者残暴得多，正是因为中国无产阶级的地位比满洲贵族卑贱得多，后者在湘军和士大夫面前没有自卑感，前者却预感到自己的子孙不足以匹敌少尉、小地主和小店主的孤儿寡妇。\n\n1949年“3月中共七届二中全会闭幕后，中共中央正式任命了中共湖南省委和湖南省政府的主要负责人，由黄克诚任省委书记，王首道（拟任省政府主席）、金明、高文华分别省委一、二、三副书记。此时湖南还没有解放，上述人员还各自在不同地区分别担负重要的领导职务。其中省委书记黄克诚在天津市，任天津市市委书记兼天津市军管会主任；王首道在辽宁省沈阳市，任东北行政委员会工业部部长；金明在河南省的豫西地区，任豫西区党委委员兼许昌地委第一书记；高文华在河北省平山县西柏坡的中共中央机关，任中共中央统战部副部长……四五月间，除黄克诚仍在天津外，奉命南进的南下湖南省委、省政府主要负责人王首道、金明、高文华等人，已离开各自原来工作的地区和单位，先后抵达华中局所在地河南省开封市，经华中局指示并由开封市统一安排，入住开封旅馆，此后即以住地开封旅馆作为南下省委和省政府的临时办公地点，正式展开各项工作。”\n\n1949年“3月间，从山东进入中原豫西地区工作并担任豫西区党委委员兼许昌地委第一书记的金明，被中共中央任命为湖南省委副书记。3月下旬，根据豫西区党委《决定》中抽调「新区干部」的部署，抽调在豫西区第五专区（即许昌专区）的临汝、宝丰和郏县3个重点县和禹县、鲁山两个附点县工作的，1948年从山东省进入豫西的240多名干部，连同在上述5个县（主要是临汝、宝丰和郏县3个重点县）内选调的170余名新干部及勤杂人员，共计400多人，按照地委和各县委的指令集中待命。6月，明确这些干部随金明进入湖南，随后确定他们去邵阳专区工作。这批山东干部是1948年秋天进入豫西区的，在那里工作才半年左右时间。”\n\n1949年“6月下旬，经省委统一研究并报华中局批准，以晋中南下工作团四大队（南下四地委即从察哈尔省抽调干部组建）为基础，组建了南下衡阳市委、市政府的党政领导班子……南下衡阳市委正式组建党政领导机构之后，以原晋中南下四地委建制的干部为基础，迅速抽调干部配备各直属机构的负责人和必要工作人员，接着就地在巩县组织集训和学习了约一个月……成建制组建南下长沙地委、衡阳地委和南下衡阳市委，是在华中局领导下，由南下湖南省委具体组织，以晋中南下工作团的南下人员为主，经过统一调配和重新整编后，在河南巩县待命期间进行的。新组建的南下长沙地委（含专署机构）建制，主要由原晋中南下区党委和行署机关，以及所辖的南下一地委、二地委和五地委（由冀中区抽调干部组建）干部和勤杂人员组成，共计1500多人。”“豫西地区抽调南下的干部和勤杂人员……进入的新区是湖南省的邵阳地区……冀东南下干部总队一大队四中队（从迁西、青平两县抽调的）以及原南下五大队一中队和六大队五、六中队的一部分南下干部和勤杂人员一共430多人，调入南下邵阳地委建制……由冀南南下六地委委员、社会部部长白连成率领的，由邯郸、肥乡、成磁和临漳等县抽调的两个南下县建制的干部160多人奉命调入南下邵阳地委建制。”“南下永州地委和专署及其所辖南下县委，是1949年6月中下旬在河南省新郑县待命学习期间，根据华中局指示和湖南省委的要求组建起来的。其所辖南下人员，主要来自原冀东南下干部总队三大队和四大队，少部分来自原五大队和六大队，一共1930人。”“原冀南支队中确定进入湖南省的3400多名各级各类干部和勤杂人员，在组织和建制上又进行了大调整，其中绝大部分进入湖南省的常德、益阳两个专区，并重新组建为常德、益阳两个南下地委建制。”"
		},
		{
			"post_id": 11,
			"title": "刘仲敬：文明與蠻族",
			"date_published": 1556310344.861,
			"body": "烏克蘭的雅利安人發明了原始戰車，公元前兩千年左右南下侵入新月沃地。後期兩河文明或巴比倫文明，結合了第一批南下雅利安人，包括赫提人的鐵和馬，與早期兩河文明或蘇美爾文明的戰車（驢子拉車），形成了巴比倫、亞述、埃及新王國的帝國主義。\n\n傳播中心就是黑海，東傳的一線產生了鄂爾多斯的石卯要塞和晉國朱開溝文化，再向東產生滿洲夏家店石頭城。晉文化南下產生堯舜的陶寺文化。晉文化演化成好戰的李家崖文化，聯姻滿洲文化分化產生的燕國大坨子文化，也就是殷商先王和有嫆氏的聯盟，越過太行山拒馬河南下，撲殺烹飪原始中國人，建立二里頭的早商文化，隨著吃人肉工業的建制化，產生殷商文明。\n\n蜀是早期蘇美爾文明的產物，沒有馬拉戰車。\n\n一千五百年後，胡服騎射的雅利安人連車子都不要了。他們攻陷了新巴比倫和埃及，結束了美索不達米亞文明。馬車型美索不達米亞晚期文明，其實就是類似滿蒙儒家的雅利安化美索不達米亞，在古典美索不達米亞文明徹底滅亡以前，依靠洋務運動過渡一下。\n\n商周都是晚期美索不達米亞文明，秦趙開始伊朗化。月氏是真正的雅利安，匈奴是北晉-外晉半雅利安。\n\n現有的考古學資料已經足以釐清時間空間線索，得出合理的結論：文明起源於肥沃新月，蠻族起源於烏克蘭。遠東無論在哪一條路線，都是歐亞大陸的傳播窪地或最後一站。"
		},
		{
			"post_id": 10,
			"title": "刘仲敬：日本-維吾爾同胞民族論",
			"date_published": 1555875471.191,
			"body": "1939年4月1日，东突厥伊斯兰共和国军方代表麻木提赴日本乞师。\n\n诸亚同盟的穆斯林各邦以其地缘形势，适合阻截共产国际的莫斯科-延安-重庆输液管。日本泛亚主义者关注内亚走廊，为时已久。“1939年时，有人（汤本升）提议建设一条「防共铁道」 — — 穿越新疆的中亚横断铁路：「这条铁路的建设，在避免与俄国势力的激烈冲突并且可以在甘肃省内巧妙地遮断红色通道、援蒋通道，给予在新疆南部地区一直反抗着蒋（介石）政权和苏联的压迫，与共产主义进行血腥战斗的孤立无援的可怜的回教徒以光明，将他们变为日本的同伴上，都是一条有益的线路。」”东突厥伊斯兰共和国的残余势力在苏联及其代理人的威胁之下，自然也将兴灭继绝的希望寄托在日本身上。\n\n“1935年，（喀什的第六师师长）麻木提（Mehmut Muhiti）令其兄长借麦加朝圣之名，与日本驻土耳其大使接触，「祈求得到日本的支援」，并且得到了一旦流亡，就能得到日本保护的保证。1937年5月，麻木提由于接到苏联要他去乌鲁木齐的命令，毅然流亡印度孟买潜伏，并再次与日本驻土耳其大使联系……（1939年4月1日到达神户）之后，麻木提又率领其他八位维吾尔族人，以东突厥斯坦代表的名义出席了大日本回教协会和东京伊斯兰教团在1939年11月、12月于东京和大阪举办的回教圈展览会和第一届东亚回教徒大会。根据日本驻上海总领事馆向日本外务省的报告，来自上海的东突厥斯坦代表哈米提·哈吉「从来一直不断地向本馆提供新疆情报。」\n\n1939年4月，麻木提抵达东京之后，第一次东突厥斯坦独立运动后「流亡中的维吾尔族人以麻木提为中心密切联系和团结一致，除东京的麻木提及其随从外，在上海、厚和、印度、近东地方等各地分别策划和做再起的准备，头脑中的民族独立思想越燃越烈……最终的目的就是急于得到作为东洋盟主的日本的实际援助，在新疆建立独立义军，拼死对抗反击苏联，以便实现维吾尔民族的完全独立。」\n\n蒙古军事顾问部调查部的《回疆独立运动之概说》同时指出了新疆对于日本的意义：「从军事上将来统治支那，从而与苏联抗衡的国防角度来看，能够突击进入亚细亚中心地带，与之相连的满洲、内蒙古、新疆地带，是日本必须确保的地带。如果使此地的回教民族与日本结成更为密切的血缘关系，成为永久不变的一身同体关系，维吾尔自治国的出现，必然大大刺激其西方邻接的、由相同民族者大多数的苏属土耳其斯坦及苏属中亚地带的八百万回教徒，北上可使苏联的远东地方陷入独立，同时不难想象邻接地区民族的独立可以强烈刺激南方印度地区，使日本有积极援助印度民族的理由……值此，日本则可不战而名实俱得东洋盟主之地位。由此可以断言，新疆问题的解决实为绝对必要的紧急任务。」\n\n也就是说，从军事的角度来看，东突厥斯坦正居于国际政治上的要冲之地，如果通过由「回教民族」建立「维吾尔自治国」的方式将其收入日本的势力范围，不仅北上威胁苏联、南下遏制英国及欧美势力的发展，日本就能够轻易取得「东洋盟主」之地位。但是，对于遥远的日本来说，究竟可以用甚么样的口实，以支持维吾尔族的独立运动呢？通过上述「回教圈展览会」和「回教徒大会」等象征性的活动，制造一个「回教」共同体的空间，为其一；另外，蒙古军事顾问部调查部提出了一个更大胆的想法：以维吾尔族为日本的「同胞民族」。维吾尔「民族使用纯粹的突厥语为纯粹的突厥民族，作为与我大和民族为同系统的阿尔泰民族的原种族，相貌与日本人极为相似」，因此，维吾尔族「全面的看来与吾国人相似之处极多，事实上就是值得我们去爱护的同胞民族。」既然是「与日本通过血缘关系紧密连接」的「同胞民族」，那么「救援具有共同祖先、今天又处于存亡关头的同胞民族，是吾等日本民族对于祖先必须要尽到的重大责任。」麻木提流亡日本的事件足以证明，日本侵略势力与新疆当地的维吾尔族居民之间，也许的确没有发生过直接的接触，但并不能一词断定日本侵略势力没有利用民族独立运动，将新疆收入自己势力范围的企图。\n\n1941年的《回教世界》第三卷，从第1号到第6号连载了胁坂利德德《新疆独立战之回顾》长文，记载从1820年代的张格尔叛乱到二十世纪三十年代东突厥独立运动的历史过程。按照作者的说明，该文是他「以麻木提师长及其多位忠实部下口述的生动体验为经，以笔者本人的研究和收集到的资料为纬而成。」该文作者对维吾尔民族的命运表示同情，但是却在连载第一期的开头部分即强调：「今天，日本在所占领的大陆地区已经承认长出新芽的新国民政府。为了排除中国共产党的抵抗，我鹰鹫远端空袭赤都兰州。而居住于亚洲干燥地带的五千万图兰民族，与世界四亿的穆斯林（回教徒）之间具有精神的连带，因此有人说能够掌握新疆者即能够掌握亚洲，所以对于我们日本人来说，考虑掌握东突厥斯坦的问题已是迫在眉睫。」\n\n通过保存在日本防卫研究所中的旧日本军方档案，还可以看到当年日本军方曾积极开展对新疆的情报搜集工作。例如1940年9月，多田部队本部曾经提交过《新疆各族之研究》（两部）；1941年6月，蒙古军军事顾问部又提交了《青海、新疆省方面情况调查书》，他们使用一位名叫「阿布都拉阿奇」的人，调查苏联在新疆开采石油的情况、新疆的道路和航空路线、电力情况、无线电通信情况、电话通信情况、家畜出口情况、各种政情及军队驻地和具体兵力部署等，又使用一位名叫「祖农·阿希尔」的人，在甘州调查从1941年3月开始的85天时间内所通过苏联卡车的数量，我们知道这些苏联卡车都是向中国内地运送援助物资的。而从名字上来看，这两位日本军方的情报人员应该都是维吾尔族人。”"
		},
		{
			"post_id": 9,
			"title": "刘仲敬：帝國主義的圓明園課業",
			"date_published": 1555875128.35,
			"body": "1860年10月14日，英法联军解救幸存战俘。\n\n“九月十八日被捕的二十六名英国人中，有十三名 — — 巴夏礼、洛奇、一名英国龙骑兵和十名印度锡克骑兵 — — 得以生还，「他们身上都带着遭受侮辱和虐待的证据」；而有十三名则被「野蛮地杀害了，至于在何种情况下被杀害的，报告人却不便详述，唯恐他的愤慨发泄在字里行间，这样一种报告的性质是不适当的。」在被杀害的人当中，诺尔曼、包尔卑、安德逊中校、一个名叫费浦斯（Phipps）的英国龙骑兵和八个印度锡克骑兵的尸体被归还了；布拉巴宗海军大佐的生死不明，但相信他和戴陆克神甫都在八里桥战役后被斩首。在被捕的十三个法国人中，有五名 — — 戴斯克雷斯和四名士兵 — — 得以生还；并归还六具尸体，那就是格兰德香浦上校（Colonel Grandchamps）、艾德尔（Ader）、杜必特（Dubut）和三名士兵的尸体；此外戴陆克神甫和一名士兵的尸体则仍留在那里。”\n\n死者和幸存者遭受的“侮辱和虐待”，激起了联军对亚细亚式残暴的普遍愤怒。莫吉牧师报告说：“我从未见过比这更让人怜悯的情景了……他们几乎不能走路，拖着双腿向前挪动。他们的手以一种痛苦的姿势放在胸前，这还能叫手吗，都已经被扭曲得变了形状，有的手腕上的伤口已经溃烂，有的手上被绳索捆绑造成的肿胀还没有消下去，有的手就像鸟爪子一样蜷曲着，看上去好像已经坏死萎缩了。”“人们还了解到，他们身体的畸残状况是由于手脚被浸湿的绳子紧紧捆在一起而造成的。这些俘虏就这样被捆绑着，任凭风吹日晒雨淋，而且长时间内得不到食物和水。由于四肢的血液循环被截断，肌肉肿胀溃烂，伤口化脓，生满了蛆。这些幸存者的证言全部或部分地发表在英国议会文件或战争纪载里，它们表明所有的死者都是由于这种虐待的结果。”格罗男爵向法国外交大臣图弗纳尔报告说：“您完全可以想象出联军军营中那种极度的愤怒和激动，我们需要尽可能地保持慎重何冷静，以阻止可怕的报复行为损害我们的事业。有人想烧掉北京，让每一名清国官员都受皮肉之苦。”\n\n巴夏礼曾在外交谈判中遭到绑架，亲身体验了东方人尊重法律和正义的方式，在写给妻子的信中说：“我们那些战俘受到的待遇实在太残忍了，必须严惩不贷，以儆效尤。”他为了让残暴和虚伪的懦夫懂得绅士的勇敢和正直，拷贝了戈登将军对待李鸿章的方式，当面用满大人语叱责刑部尚书：“一个人如果利用敌人的不幸对他进行人身侮辱的话，就丧失了每一个文明国家的尊重，应当被逐出正直人的社会。”后者发现无知蛮夷不懂得满大人相互维持面子的义务，只得像李鸿章一样落荒而逃。此后几十年，同样的故事情节还要在北京和满洲帝国（Amba daicing gurun）各邦上演无数次。中华民族发明家编辑的帝国主义欺凌史，都是以诸如此类的材料为蓝本的。\n\n罗素勋爵和额尔金勋爵感到英国人负有重大的道德责任，如果不能严惩虐待战俘的罪行，就会进一步降低清国“本来已经很低的道德水准”，但额尔金不愿意“惩罚无辜的清国人民”。圆明园是清国皇帝喜爱的地方，他有理由相信：“这一行动对清国和清国皇帝产生的影响，要比远离此地的人所能想象得到的更为巨大。”“同时，这里也是一些俘虏遭到羁押和虐待的地方，毁掉它或许会使他们所遭受的痛苦得到一定的补偿。此外，圆明园已经遭到了彻底洗劫，因此，毁掉它不会造成许多有价值物品的破坏。”十九世纪的帝国主义者和严厉的家庭女教师都相信《圣经》和莎士比亚的伦理学，管教主要是为了被管教者的利益，应该以公正为基础，稍加仁慈的调剂：“军队去到那里不是为了抢劫，而是要通过一个神圣的报复行动，记下我们对一项重大罪行所感到的憎恶与愤慨。”\n\n额尔金一度考虑强迫清国官吏为死者立碑纪念，但还是明智地放弃了这项计划。这样的纪念碑即使当真树立起来，下场也不会比克林德碑好到哪里去。“无辜的清国人民”及其继承者并不觉得杀害战俘和外交官有什么不对，如果他们属于失败一方的话，但如果有谁愚蠢到分不清胜利者和失败者，那么无论遭到怎样的惩罚都是活该。“到10月19日晚上，圆明园就已经不复存在了。在它四周，自然的面貌改变了，只剩下一些熏黑的断壁残垣和一堆堆燃烧过的木头，说明这里曾经是皇家宫殿。在许多地方，建筑物旁边易燃的松树也和这些建筑物一道被焚毁，留下那些烧焦的树干标记这些建筑物的遗址。”东亚奥斯曼主义者机智地捡起了英帝国主义留下的道德教育讲义，从反面将自己发明成清国的继承人，也就根据民族发明的甄别和塑造原理，判决自己和自己的继承人必须活出维多利亚人编辑的反面典型。没有律法的下等人坚定地相信，落后就要挨打，失败者总是错的，胜利者不受任何责难，现在只有一件事需要做，就从过去的失败者一方投入未来的胜利者一方，然后惊讶地发现，自己每一次都选择了失败的一方。"
		},
		{
			"post_id": 8,
			"title": "刘仲敬：費拉左派和費拉右派",
			"date_published": 1549922245.236,
			"body": "我老人家非常了解費拉，所以深知費拉左派和費拉右派都是費拉，如果由左派變成右派，並不證明自身德性有所上升，只是說明他們寄生的文明季候有所變化而已。具體來說，就是這樣的。\n\n費拉看到文明早期的部落酋長和封建貴族憑推薦上大學，就要變成左派。左派的意思是應該分數面前人人平等，讓騎馬射獵的英國紳士和蒙古武士給頭懸梁 錐刺股的屌絲讓路。\n\n費拉看到晚期文明讓高盧人日耳曼人潘諾尼亞人進元老院，就會變成右派。右派的意思就是應該金錢面前人人平等，讓身經百戰的新移民戴克里先給腰纏萬貫的埃及老費拉菲爾普斯讓路。\n\n所以費拉無論從理論上講是左派還是右派，實際上總是維護秩序消費者。他們的理論翻譯成人話，總是要求司機和乘客平等。他們抱怨得最厲害的地方，總是保護者或秩序輸出者對他們最好的地方。他們的要求如果實現，必然會導致自己首先毀滅。英國貴族如果不能憑出身上牛橋，就會像約翰王一樣拔費拉的牙勒索。潘諾尼亞蠻族如果不能通過羅馬軍團當上皇帝，徵收埃及費拉企業家的保護費，日耳曼和阿拉伯蠻族就會征服羅馬帝國，搶劫埃及費拉企業家。\n\n非洲人、墨西哥人、阿拉伯人和土耳其人在西方的地位如果有什麼疑問，那就是不好判斷誰是保衛羅馬的蠻族，誰是反對羅馬的蠻族。清華高材生和血汗工廠老闆的費拉身份，那是一點疑問都沒有的。苗族酋長和突厥教法學家生產秩序的能力，都比他們要強。所以這事的唯一問題是，科舉輸家當中的社會活動家夠不夠資格跟同樣科舉輸家的黑人西點軍校學生享受同樣待遇？頭懸梁 錐刺股的階級，應該明白元老院永遠不是為你們這種人準備的。\n\n毛澤東搞白卷英雄，問題也是僅限於選錯了階級。紅衛兵聖戰士和頭懸梁 錐刺股，本來就是同一個階級。如果他選擇蘇聯顧問和特工、日本軍官和僑民、西方傳教士和冒險家，讓他們做鮮卑帝國所謂豪強、蒙古帝國所謂巴圖魯，這些人照樣會繳白卷，但是完全有能力維持統治。東亞帝國借屍還魂，都是靠殖民替代。\n\n他的失敗遭到錯誤解讀，讓頭懸梁 錐刺股和血汗工廠的階級以為秩序真是靠自己維持的。1989年和2017年的災難，都是由這種認知錯誤造成的。僭主發昏，就會讓石重貴承擔查理曼的任務。費拉發昏，就會讓譚嗣同承擔奧蘭治親王的任務，讓菲爾普斯承擔君士坦丁大帝的任務⋯⋯\n\n貴匪在1989年說的話並沒有錯，老子打下來的江山，憑什麼分給動嘴皮子的人，但問題在於江山是斯大林同志和俄羅斯戰士打下來的，跟你這個勤務兵有什麼關係⋯⋯勤務兵的階級地位，本來還不如頭懸梁 錐刺股的士大夫，顛倒階級地位，全靠抱大腿。\n\n蘇聯已死，鬥爭雙方只有爭搶美國的大腿了。江澤民老奸巨猾，在抱新大腿的鬥爭中稍微佔了一點上風，但距離前殖民地代理人那種可靠的買辦資格，仍然有天淵之別，偏偏費拉永遠是不知好歹的，又要以為希特勒是阿明打死的，覺得可以再次開始爭奪世界革命領導權了⋯⋯"
		},
		{
			"post_id": 7,
			"title": "折腾半天差点把id丢了",
			"date_published": 1549444507.222,
			"body": "Blog post body"
		},
		{
			"post_id": 6,
			"title": "刘仲敬：隋唐帝國與內亞體系",
			"date_published": 1549419647.901,
			"body": "唐代藩鎮的歷史大體上是內亞黃金時代的餘波，動力中心在呼羅珊與河中地區，新舊唐書和資治通鑒的解釋都是湯因比所謂的非洲中心論，認為英國人打敗德國人的原因在於德國人不敬坦桑尼亞山神。\n\n李林甫至多是李鴻章式的精明政客，看准了鐵甲艦革命不可避免，順勢用北洋水師加強自己的重要性。李林甫即使不存在，也不會影響唐太宗和玄宗親自推行的番將政策。宮廷本身的內亞性質，使他們比東亞儒生更容易理解技術的重要性。如果鮮卑皇帝也像杜甫歐陽修司馬光一樣愚蠢，陳陶斜的慘敗就要提前到高宗一朝了。唐肅宗和靈武的鐵勒人僕骨人阿至羅人部落決定讓杜甫去大蜀要飯，至少在軍事上一點沒錯。\n\n安祿山史思明模式在河中地區出現的時間，比東亞早兩百年。所謂藩鎮割據，其實就是禮失求諸野。用演化論的語言描繪，就是競爭壓力大的中心地區（內亞）容易產生新模式，傳播到競爭壓力小的邊緣地區（東亞），需要相當長的時間。邊緣地區慢慢接受新模式的時候，中心地區早已演化出更新的模式。\n\n安祿山史思明模式或粟特突厥共生系統產生的時間，大概在五世紀或六世紀。拜佔庭人和薩珊人非常瞭解他們的力量，他們同樣習慣捲入兩大帝國的外交陰謀。他們接觸長安和鄴城的鮮卑朝廷，最初似乎是為了推銷當時的F35，包括一種殺傷力特別強的精制箭頭，東亞人直到唐朝中葉都無法仿制。漢文紀錄的作者覺得散文詩的質量很重要，信息量很不重要。所以我無法判斷，這種箭頭的奧妙在哪裡。以下幾種假設是可能性最大的：\n\n珍貴的特種鐵礦石，地點可能在阿爾泰山附近，其他地方的鐵礦沒有同樣的質量，無論如何都造不出來。\n\n鐵勒人發現或從烏克蘭草原引進了新型冶煉技術，然後組成了客戶開發團隊。他們的客戶團隊形成了類似克魯伯鋼鐵或瑞士手錶的工匠傳統，能夠及時根據客戶需要調整鐵製品的式樣，保證主要客戶進口品牌鐵器比胡亂仿製品有利。\n\n鐵勒人也可能依靠粟特合伙人，從敘利亞亞美尼亞小亞細亞進口了多種工業原料，箭頭的力量在於少而關鍵的添加劑。添加劑的來源太廣，沒有貿易網就無法操作。這些添加劑在當時國際貿易體系當中的地位，大致相當於蔣介石的命根子鎢砂、豬毛和桐油在二十世紀國際貿易當中的地位。\n\n無論如何，粟特突厥共生系統大規模開發東亞市場的時候，他們的祖先早已非常熟悉君士坦丁堡和內薩布爾市場了。兩個鮮卑宮廷玩不過他們，原因不僅是技術的落後。河中城邦-東地中海-北印度-烏克蘭草原貿易和外交系統的複雜性，無疑超過內亞-東亞系統。論奸詐程度，長安建康都不是拜佔庭的對手。\n\n安祿山這種通六番語的武士商人，顯然比杜甫這種填空題和議論文都寫不好的科舉輸家智力高。輸家寫出的歷史，一定要把安史集團說成只有武力的蠻子。這種史料的參考價值，跟環球時報的三菱重工報導差不多，意思是你不要以為會造發動機就了不起，學習過宋之問在神都文藝工作者座談會上提倡的新詩歌麼？不過這話也有問題，近體詩畢竟是從波斯引進的，所以應該改成，你做過高考明經填空模擬題庫嗎？\n\n軍事技術先進，同時文化落後社會簡單，這種自相矛盾的現象是不是真正存在過，非常值得懷疑。即使是澳大利亞的舊石器部落，圍繞高質量石器的礦山和製作技術，都有複雜的產權和交易系統。這些部落民把食物住所當成公共品，卻堅持上述礦山和技術的私有財產性質不容侵犯。\n\n無論如何，粟特突厥共生系統在當時世界上的形象，不是什麼四肢發達頭腦簡單的野蠻人，更像十字軍時代的威尼斯人和聖殿騎士團。即使漢文記載當中，也只有正史對他們不友好。\n\n民間小說如果提到姓安或姓康的洋人，通常都說他們要麼腰纏萬貫，拿點零花錢救了準備尋死的私奔情侶，或是給寺廟捐了一大筆錢，或是某些難得的珍貴香料油料顏料，或是擁有某些神秘的醫學技術，給人動白內障手術，或是路見不平拔刀相助，派貼身黑人保鏢從奸臣的刺客手中，救出了亡命的忠臣。他們用夜光杯喝葡萄酒，用木鹿的花毯裝飾阿拉伯駿馬，隨時可能拔出削鐵如泥的大馬士革寶刀，或是玩出相當於007電影的神奇技術。在我記憶範圍內，最接近這些胡人的文學形象，莫過於1980年代地攤文學當中的香港富翁和美國間諜。一個土鱉幹部去新加坡出差，看高樓大廈傻了眼，用高腳酒杯喝了傳說的香檳酒，坐飛機回到老家以後，如果碰巧具備一定的文學創作能力，偷偷寫出來的作品，大概就像我剛才描繪的唐人傳奇白話版。\n\n河朔東北藩鎮系統和靈武西北藩鎮系統的差異，在東亞體系內部是解釋不清的，在內亞體系當中卻是一目瞭然。\n\n安祿山不是革新者，他沿用了過去兩百年行之有效的武裝商團結構。當他發現新環境的競爭壓力如此之小，技術水平如此之差以後，就像叛艦喋血記裡面的英國水手一樣野心大增，即使在英國升不了上尉，在南太平洋憑著火槍的壟斷，至少也要娶土著國王的草裙公主才行。然而在河中地區，軍事兄弟會模式已經取代了傳統的商人武士。杜甫對這些情況一無所知，唐玄宗父子倒是有所瞭解的。\n\n朔方軍在康待賓叛亂的時代，跟安史集團區別不大。回鶻人和僕骨人的時代，舊的外伊朗模式仍然通行無阻。李懷光和李克用的時代，軍事兄弟會的模式已經佔了上風。從時間上看，朔方系統的演化比河中系統的演化慢一百二十年左右。\n\n盧龍節度使接受同樣的變化，已經是其滅亡的前夜。魏博的牙兵制度，似乎可以視為內亞軍事兄弟會模式在得不到持續人力和技術輸入的情況下，發生的替代性本土化反應。\n\n兩相比較，河朔系統的演化不僅慢於靈武系統，而且產生了發展匱乏環境耐受力，而非軍事經濟效益最大化的品種。因此，東北系統在殘唐五代取代西北系統的學說不能成立。第一，東北系統比西北系統距離內亞核心更遠，模式代謝也更慢。第二，五代和宋朝的本根源於河東，而河東是朔方的殖民地。沙陀人從內亞到朔方，從朔方到晉陽，從晉陽到汴梁的遷徙，是一個典型的組織殖民模型。李克用帳下義兒的正版原型，就是巴里黑和哥疾寧的混編突厥禁衛軍。可憐的噴子歐陽修不明白，他崇拜的郭威和趙匡胤之所以不是義兒，是因為資格不夠，後周和大宋的存在，其實是蜀中無大將，廖化作先鋒的結果……\n\n河朔系統在這場演化當中的地位相當於北京猿人，作為內亞系統的旁支，保存了許多片斷基因，卻沒有留下直系後裔。朔方系統作為內亞輸出的主幹道，在宋代的地位相當於非洲夏娃。東北取代西北的真實來源在更晚的遼金，他們也不是河朔的直系後裔，毋寧說宋人的孤立主義退化，把契丹變成了內亞下游的真中國。\n\n附1：\n\n唐三藏對粟特人的評價是生性勇烈視死如歸，他們帶來了柘枝舞、金叵羅和五色鳥番錦。中唐廣陵織造開始仿制，到元代提舉司才成功。毛棉大多從河中輸入，東亞也是到元代才仿制出類似產品。敦煌壁畫裡面，吐蕃贊普和唐朝大臣的錦袍和長靴，都是薩珊花紋。\n\n突厥入寇，臨河先拜拂雲祠【《舊唐書•後晉•卷四十三》「朔方軍北與突厥以河為界，河北岸有拂雲神祠。突厥將入寇，必先詣祠祭酹求福，因牧馬料兵而後渡河。」】，屬於拜火教系統。佛教在突厥跟拜火教競爭，完全失敗。儒家跟佛教相比，更是形同侏儒，即使在科舉地區，仍然不及佛教十分之一，一旦進入非科舉地區，就毫無競爭能力。所謂大唐盛世，整個內亞-東亞系統完全籠罩在伊朗文化之下。無論軍事技術、工藝產品還是日常用品，輸出方向都是自西向東。宋人完全退出了內亞交通線，俄羅斯和內亞西亞普遍以契丹為中國。\n\n泉州交州海路代興，仍然掌握在波斯人和阿拉伯人手中。南朝和唐朝把薩珊琉璃當成國庫都買不起的寶石，明朝又把耶穌會士的稜鏡當成寶石。琉璃只是玻璃製造技術不達標的產物，暹羅都用來造牆，明顯不甚珍惜，然而南朝至明清，一直愛不釋手 — — 東亞確實是自古以來土鱉，即使在內亞和南洋面前，也像法蘭西面對倫巴第和弗蘭德。\n\n附2：\n\n問：根據您的梳理，西周封建是內亞體系第一次植入東亞，北朝隋唐是內亞體系第二次植入東亞，蒙元是內亞體系第三次植入東亞，這樣一來就根本沒有獨立的東亞文明一說了，那麼以此類推的話，被伊斯蘭教殖民以前的恆河流域的文明，是否也是附屬於內亞體系的餘波呢？\n\n劉仲敬：大伊朗、大印度、大東亞是肥沃新月輸出文明的內圈、中圈、外圈接受者，三者都是附庸，但附庸程度不相等，越外圍越落後。內亞是三者的十字路口，比內圈落後，相當於中圈，比外圈先進。歷史上秩序和文明的流動，都是按照上述歧視鏈展開的。\n\n問：有人認為漢字這種以形旁取類的造字法比純拼音文字更具有科學性，或者套用您的話，有一種從世界中「提取出結構」的企圖。漢字是源自兩河流域文字體系還是源自尼羅河流域文字體系，您怎麼看？\n\n劉仲敬：兩河的可能性大，內亞可能是直接起源。古人所謂夏的考古地點，最初接近土庫曼，後來接近鄂爾多斯，孔子時代才移動到山西高地。語言是演化系統，接近生態系統和市場經濟，能科學的東西就是最差的，像國家計委。\n\n問：從上古到安史之亂以前，桂枝所仰賴的秩序輸入，基本來自於西北草原方向；而安史之亂以後一千年，這種秩序輸入，卻旋轉到東北亞方向，甚至安史之亂本身就是起自東北亞；此後，京師和軍政重心也與勢俱東，直至近代滿洲國獨立建政而到達一個頂峰。這背後氣運的興替旋轉，根源何在？與整個歐亞大陸文明格局的變動有關嗎？\n\n劉仲敬：這是很外圍的說法。河朔的民族遷徙，本質上講是索格狄亞那【Sogdiana，中亞河中地區，位於今烏茲別克斯坦】民族遷徙的餘波。昭武九姓和河中地各民族進入河朔，實際上是由於他們自己的老根據地發生民族替代的結果。這個就要聯繫起阿拉伯人進入中亞以後，突厥語系和波斯語系各民族的消長了。唐代中葉的河朔之亂和沙陀人佔據朔方腹地引起的五代北宋的嬗遞，都是一脈相傳的。這些部分都是內亞民族遷徙的餘波，談不上是東北亞因素。當時能夠談得上東北亞因素的只有高麗、渤海一系，並不佔據核心地位。東北亞因素顯得比較突出，那只是十五世紀以後的事情，準確的說是帖木兒帝國衰亡、河中地喪失過去的文明中心地位以後的事情了\n\n問：隋煬帝的折騰和覆滅，顯然是導致了關隴集團的分裂和削弱，也虛耗了東亞的人口和資源，但如果隋朝的繼承人是審慎保守之君，那麼關隴的鮮卑集團、漠北的突厥集團、關東的士族集團三者之間的博弈爭衡大勢，在後續幾百年會不會演化出不同歷史格局？\n\n劉仲敬：爭奪內亞走廊的鬥爭無論如何都會開展，即使是針對高句麗的戰爭也不大可能是完全避免的。假定隋煬帝是一個跟唐太宗性格差不多的人，他也會發動一場高句麗戰爭，只不過會打得比較節制。像唐太宗在他的晚年，儘管當時的人口和資源遠不如隋煬帝時代，還有魏徵這樣的名臣提出強烈抗議，他還是發動了高句麗戰爭，然後臨死的時候都感到後悔。從這一點就可以看出，高句麗佔據遼東半島，而且以上國自居，在滿洲地區搞了一個小天朝結構，對長安朝廷的威脅有多麼大。如果是一個謹慎的唐太宗式的人物佔在隋煬帝的地位，他可能也會啃一啃高句麗這個硬骨頭，但是也多半會像唐太宗那樣適可而止，發現不可能在短期內結束戰爭，就收回來。\n\n同時在北方，內亞走廊的鬥爭無法避免，高句麗戰爭肯定會把突厥人和中亞各部族卷進來。一個謹慎的領導人在面臨著漠北大亂的可能性時，會採取綏靖東方的政策，然後全力維護內亞通道。內亞通道是任何一個長安政權維持最基本的武力所必需的條件，所以不能夠容許它掌握在突厥人的手裡面。如果高句麗打不下來，跟突厥的糾紛又得不到結果 — — 這是多半的事情，因為長安朝廷只能夠收買幾個小可汗挑戰大可汗的權威，整體上扭轉突厥人的優勢，即使能夠成功，也需要漫長的時間 — — 那麼戰場會從滿洲、蒙古高原逐步地向西移動，最後還是會像是漢武帝和唐太宗時代一樣，把主要的戰場移到西域和內亞一帶。隋室本身的佛教性格只有武則天政權能夠相比，比唐代的大多數帝王的佛教傾向都要強得多，這個因素又進一步增加了隋朝如果不滅亡的情況下、進一步向中亞-西北-印度方向發展的可能性。因此一個沒有消耗關東資源的隋室，可能會比唐玄宗以前的皇帝更加徹底地引用西域和內亞的資源。\n\n因此這樣一個隋帝國內部，它和關隴門第、關東士族之間的矛盾，可能不會像武則天時代那樣通過科舉以和平的方式解決，而是會在經過三代或者四代皇帝的戰爭以後，才會出現類似漢武帝輪台悔過那樣的海內經濟凋敝現象。內亞蠻族控制的東北邊境，實際上是高句麗破滅、渤海遠遁以後，東北亞出現真空的產物，在高句麗存在的情況下，這樣是沒有必要的。因此在這樣一種假定之下，東西部之間的矛盾可能就不會以科舉的方式和平解決，而會以像程知節、李勣這樣的豪族領導之下，以第二個竇建德、劉黑闥政權的方式出現。這些人本來也是六朝時期蠻族征服者的後裔，在沒有安祿山和昭武九姓這些新蠻族闌入的情況下，多半還是能夠維持關東地區的穩定。而關東地區的士大夫在沒有得到科舉支持、沒有得到太多機會進入長安的情況下，更容易跟他們結合起來，形成第二個北齊政權。\n\n問：「唐宋之變」是百年來東亞史學界的一大熱點，但我在讀了您的文章之後覺得，除了有少數日本史家從貴族結構衰變的角度觸及了部分要害，國內史界大都沒有進入到這段歷史的本質層面，不太有興趣探討基礎共同體的演化態勢，他們似乎只關注經濟革命、政體嬗變這些浮在面上的運動，以至於認為「唐宋之變」是一次近代化大轉型，甚至連陳寅恪都說出「華夏文明造極於趙宋之世」的話，去年國內也出版了吳鈎的《宋：現代的拂曉時刻》 — — 那麼您認為應當如何評價所謂「唐宋之變」在後秦政時代的歷史意義呢？\n\n劉仲敬：科舉取代門閥，是門閥取代貴族以後社會散沙化的進一步進程。科舉產生出來的士大夫主要依靠教育，比起原先只是部分依靠教育的門閥來說鄉土性更差，更加強調個人才幹和個人努力，很明顯，原子化的程度比起過去的貴族和門閥又進一步衰退了。現在的人覺得士大夫好像還有可取之處，那是因為共產主義來了以後，原子化進入它最極端的階段，以至於過去宋明那種地主士紳好像多多少少也能發揮一點保護鄉土的作用，其實他們保護鄉土的作用頂多像是一層草皮。而門閥呢，可以說是介於貴族和士大夫之間的一種狀態。如果是你把視野放大一點，放在全世界範圍內的話，那麼項羽所代表的封建貴族衰亡以後，東亞社會後來產生出來的這些精英其實都是沒有貴族資格的，包括門閥在內，比門閥還不如的士大夫階級那就只能是更加差勁兒。但是就是因為東亞社會脆弱程度比起伊斯蘭社會、歐洲社會都要大得多，所以你只有矮子裡面拔將軍，做約翰遜博士不屑一顧的事情，在跳蚤和臭蟲當中選出大的來，勉勉強強把門閥和士紳這兩個品種選出來，作為秦政以後東亞社會的兩個核心。儘管這兩個核心仍然表現出一蟹不如一蟹的趨勢，但是如果把它們都給忽略掉，你簡直就沒有什麼值得一寫的東西了。"
		},
		{
			"post_id": 5,
			"title": "刘仲敬：匪諜的指紋",
			"date_published": 1549222027,
			"body": "請教阿姨，最近柯文哲發表反美親中言論，抱怨台灣買美國武器怎麼需要付錢，還指稱民進黨台灣政府是搶匪而中國是警察。 依照姨學理論，柯文哲屬於費拉嗎？（如果屬於費拉，費拉右派與費拉左派都沒原則不可靠⋯⋯有些右膠先前堅持柯文哲是右派所以值得支持，我為他們提問）\n\n匪諜設計的，指紋非常明顯。反獨容易促統難，因為破壞者沒有必須實現的目的，選擇自由度大得多，適合發揮無產階級本能。蔡英文政府最強的地方是外交，獨派群眾的幾個敏感點引向相互矛盾的方向，例如將親日或反國民黨引向反美，草根性或民粹性引向去工業化或非軍事化，導致內在連貫的政策籃子無法形成。柯文哲沒有經過歷史風波淘汰篩選過的班底，臨時結合的班底安插匪諜是最容易的。匪諜的最高綱領應該是誘使美國放棄台灣，最低綱領應該是損害合作的對接光滑度。\n\n既然阿姨的都評論了，來講點情報。 柯團隊的核心匪諜是黃建興，朱高正以前的那一掛的「黨外統派」，典型幕後做事不上新聞的左右手。其他統派協力者負責洗腦中或最贏世界觀，關鍵時刻再讓黃去吹風。幕僚團隊所有反統的都被洗出去，剩下投機份子和阿諛奉承者。這些幕僚的資源(經費、網路行銷公司人脈)主要依靠紅色間接操控的人脈和勢力，所以幕僚也算被間接控制。中共主要是要希望扶植柯當樣板，依靠台人投機的心態，讓政壇的搖擺分子靠勢過去。這些人對待柯文哲有如提線木偶，只有柯幻想自己雍正大帝，軍機處無所不知。\n\n那麼，他就是萬縣事件時期的朱德、陳毅。窩老人家說匪諜的指紋，因為匪諜的工作方式1905年以後就沒有變過。總部是國際恐怖份子，掌握資源的分配權。白區黨的招募對象，通常是失敗的政治掮客。這種人習慣像馬克斯韋伯所謂的依靠政治謀生，而不是為政治而生，很難適應沒有金主的新生活，例如去教書之類，由於自己是策士出身，熟悉目標社會的政治遊戲，特別適合充當帶路黨，由於失敗和失業，要價不高而且控制容易。李大釗在前恩主段祺瑞、章士釗垮台後，就處在這樣的狀態。朱德在顧品珍垮台後、賀龍在袁祖銘垮台後，也是處在這樣的狀態，所以順理成章地接受匪諜招募，構成白區黨的中心，然而在紅區黨掌握的總部手中，仍然非常容易除掉。他們的常規動作，是在新主人身邊謀取一個方便碰瓷的位置，然後將新主人拖進反對帝國主義的衝突。柯文哲相對於楊森，反美相對於反英。英國海軍在，巴蜀利亞就是安全有保障的沿海國家，英國海軍走，巴蜀利亞就是任人宰割的內陸棄地。美國和台灣的關係，也是這樣。\n\n英蜀衝突，英國幾乎沒有損失，英國人一走，共產國際就可以拿巴蜀當點心吃。柯文哲-楊森被匪諜拖進反英衝突，作為老派人又不能說自己不為自己選擇的顧問負責。如果死要面子，川軍就變成共產國際反對英帝國主義的人肉盾牌；如果不要面子認錯，匪諜就從內部把領導達成帝國主義走狗，分裂他的隊伍，使得他本來很有希望的督軍-總統夢坐失良機。無論怎麼選擇，吃虧都是楊森，朱德和陳毅是穩賺不賠的。柯文哲現在不敢承認，又不敢否認他的意思是說美國等於強盜，這種尷尬的狀態就跟朱德用楊森的部下碰瓷英國軍艦，英國人找上門來的時候一模一樣。\n\n接下來的故事情節一般是這樣，按照commie的歷史敘事術語，資產階級開明派政治家柯文哲楊森在帝國主義和工農運動短兵相接的關鍵時刻，暴露了自己反動階級的本色，背叛了進步勢力。革命者匪諜發動群眾，也就是把他趕出自己家。然後就是麥卡錫主義的反攻倒算，匪諜楊闇公也就是楊尚昆的哥哥被做掉。英國人撤軍，巴蜀淪為共產國際和失去保護人的土豪交戰的戰場。\n\n凱末爾、閻錫山、蘇加諾之類，扮演的角色跟柯文哲楊森一模一樣。羅伊、雅尼、劉伯承、薄一波之類，扮演的角色跟陳毅朱德一模一樣。所以下一步劇本要麼是柯文哲做蘇加諾，也就是匪諜保護傘，氣走美國保護人，削弱台灣軍事力量，為下一步九三零事件準備條件，要麼是柯文哲做凱末爾，自己領導麥卡錫主義。"
		},
		{
			"post_id": 4,
			"title": "刘仲敬：滅口學",
			"date_published": 1544472726.574,
			"body": "commie本來就是全員恐怖組織，首先是偽造假護照，將軍火運到德國和保加利亞之類，然後是做假商務辦事處，目的就是為了偷運管制物品。孟家三代都是職業恐怖分子，華為的匪諜身份一開始就羅倫斯的遠東進出口公司一樣清楚。吃瓜群眾如果不明白此人的來頭，只需要知道理查德佐爾格就是他的前任就足夠了。他老人家的部下打進了蔣介石的武漢行營和參謀部，把黨軍追擊紅軍的部署通通發給了毛澤東，所以才會有四渡赤水出奇兵，毛主席用兵真如神的故事。此人在毛澤東進城以後，做了北京國際關係學院的院長，所以貴匪的外交人員和新聞人員一樣，都是職業匪諜或職業匪諜的白手套。\n\n任正非不一定是孟的親生父親，很可能是帶著男主人的任務，以結婚名義監視孟母的內保人員，儘管在正常情況下，多半是由組織派女主人做內保，任務包括在關鍵時刻將監視對象殺人滅口。任正非很怕公司當中作為掩蔽的那一部分吃瓜群眾不明真相，傻不唧唧地真想做起研究來，就發明了狼性文化來排除太聰明的人，保證公司內部的吃瓜群眾都是無產階級傻逼，偶爾幾個漏網的死大學生真開發起來了，任正非甚至緊張到要送他們進瘋人院滅口，真正的企業哪有這種管理學。所有這些都是為了掩飾華為真正的功能和保護骨幹特務。\n\n孟留在美國坐牢是最好的，出賣機密以後可以換取終身保護，如果回國就是項英，無論有沒有洩密，都得殺人滅口。任正非或他的司機保鏢之類，按規矩應該就是執行人。製造一起隧道車禍，意外高墜死亡，或者就在臥室裡用枕頭沙袋，宣稱心臟病突發。武漢行營那個上校匪諜，名叫劉燧元，不知道施展是不是他們的系統，當然後者更有可能是打秋風的門客。\n\n“这个职位（苏美贸易股份公司经理）是很重要的，因为当时苏美之间还没有建立正常的外交关系。苏联在美国既没有全权代表机构，也没有商务处。苏美贸易股份公司是一个仅有的机构。它是一个贸易团体，负责经办贸易事务。实际上，它不仅行使全权代表机构的职能，又起着商务代表处的作用，同时又是共产国际和格伯乌在美国进行一切地下活动的基地。就它在贸易方面的职能而言，也是相当重要的。当内战刚刚结束的时候，被破坏而瘫痪的铁路交通运输之所以得以恢复，完全是由于及时从美国进口了大批蒸汽机车。这一使命当时是通过一个以罗曼诺索夫教授为首的专门贸易使团进行的……斯克良斯基（托洛茨基在紅軍的左膀右臂）被任命為蘇美貿易公司經理後，就在乘坐摩托艇遊湖時不幸淹死。我和麥赫里斯堅信不移，肯定是斯大林下令滅口的。”（波利斯·巴让诺夫：《斯大林秘书回忆录》，知识出版社，1982，第92-93页）"
		},
		{
			"post_id": 3,
			"title": "终于有节点了",
			"date_published": 1542326159.106,
			"body": "测试。"
		}
	]
}