{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1514422899,
			"title": "A hypothetical tale about a bad actor on ZeroNet",
			"body": "Imagine for a moment, if you will, a bad actor on the ZeroNet network.\n\nThis bad actor decides he wants to cause a little chaos. He creates a few dozen zites. Most of them are empty, showing the default empty zite page you'd get when you create it from ZeroHello. Others are innocent enough, maybe a blog promising some insightful posts in the future weeks, a couple GifTime clones with animal gifs.\n\nAs we see these zites being published, hapless ZeroNet users such as you or myself become excited over the influx of new users and new content, and visit these pages and begin seeding them.\n\nImagine now 6 months have passed, enough time where we have forgotten all about these zites. They once promised good content, but perhaps the owners lost interest? We still seed them, but we forget they are there and pay no attention to them.\n\nThe bad actor hasn't lost interest. He decides he's going to push some updates to these dormant zites of his. He publishes content on each of them that would be illegal in most places people can live. This content is automatically downloaded by every hapless ZeroNet user who had not bothered to delete the zite.\n\nEach and every hapless ZeroNet user still seeding these malicious zites are now unknowingly possessing and seeding illegal content from the hard drive on their home computer or phone sd card. It may take some of them several months before they realize this. They might not find every malicious zite that did this to them. For others perhaps they discovered too late, perhaps some LEAs found out first.\n\nThe bad actor sits in shadows on his office chair and laughs sinisterly while scratching behind his purring cat's ears.\n\nThis story is fictional, but it does concern me. Is there something ZeroNet can do to protect its users against this type of threat? Is there something that ZeroNet users can do to protect themselves on their own?",
			"added": 1514422898
		},
		{
			"topic_id": 1550689032,
			"title": "UN Proposal to Ban Fictional Works as \"Child Pornography\"",
			"body": "The United Nations is asking for feedback on a [new set of proposals](https://www.ohchr.org/EN/HRBodies/CRC/Pages/DraftGuidelinesOPs.aspx) for the international community to rally against child prostitution, the sale of children, and child pornography.\n\n## Sounds great, right?\n\nBut a close look at their definition of child pornography reveals that this extends a little bit beyond that. [Drawings, cartoons, written stories, sculptures, and other forms of fictional works](https://www.oneangrygamer.net/2019/02/u-n-proposes-initiative-to-ban-loli-shota-and-underage-drawings-and-cartoons/77229/amp/) are also tucked in under the guise of \"child pornography\".\n\nA progressive new CSA (child sexual abuse) prevention organization, Prostasia Foundation, recently did [an excellent writeup](https://prostasia.org/blog/experts-to-united-nations-hentai-ban-would-be-a-mistake/) on this UN proposal.\n\n## **This ban may be counterproductive at preventing CSA**\n\nThere is no evidence that banning fictitious works has this effect. [Some experts](http://www.sexologytoday.org/2017/02/canada-and-australia-now-have-both.html) do [believe](https://www.theatlantic.com/health/archive/2016/01/can-child-dolls-keep-pedophiles-from-offending/423324/) bans, such as what the UN guidelines as written seek to ban, could actually lead to a rise in CSA.\n\nWith zero evidence that banning these things helps children, and with experts fearing that bans like this could put children in jeopardy, it is absolutely premature to implement such a ban until the necessary research has been conducted.\n\nthere is no evidence that banning fictitious works has any impact on reducing CSA (child sexual abuse). [some](http://www.sexologytoday.org/2017/02/canada-and-australia-now-have-both.html) [experts](https://www.theatlantic.com/health/archive/2016/01/can-child-dolls-keep-pedophiles-from-offending/423324/) believe that bans on the types of things these UN guidelines seek to ban will actually lead to a rise in CSA.\n\n## **This ban is a gross violation of freedom of speech and expression**\n\nThis will have chilling effects.\n\nMost anime, which frequently features high school aged characters, will fall under fire for having \"underage\" characters depicted. Novels, comics, fanfiction, art, fanart, sculptures, and other creative works featuring characters that \"appear underage\" (aka under 18) will similarly be harmed by the implementation of these international guidelines.\n\nWebsites operating in countries that follow these UN guidelines may find themselves reluctant to support anime or artist communities, since their duty to police content will become even more strict. We have seen the chilling effects on speech that puritan policies such as this have (see: Reddit's [harsh subreddit bans](https://piunikaweb.com/2019/02/12/reddit-facing-massive-public-outcry-after-alleged-loli-crackdown/), Steam's [removal of adult games featuring high school aged girls](https://nichegamer.com/2018/12/06/all-ages-modified-vn-hello-good-bye-banned-on-steam/)).\n\n## **We need to tell the UN that fictional children are not children**\n\nAlthough the UN's intentions are surely noble, equating artwork to child pornography is a farce which undermines the very concept of harm that CP creation and dissemination has on children, and a slap in the face to survivors of childhood sexual abuse, whose very real depictions of abuse and trauma continue to circulate throughout the internet.\n\nAnyone who would like to join me in presenting opposition to parts of the UN's proposal can do so. They are accepting comments by email. **Comments must be submitted by 31 March 2019.**\n\n* You can [email the UN](crc@ohchr.org) directly, following their [guidelines on submissions](https://www.ohchr.org/EN/HRBodies/CRC/Pages/DraftGuidelinesOPs.aspx).\n* Prostasia has created a [form to submit a pre-written email](https://prostasia.org/campaign/art-not-csem/) signed in your name.\n\n**If you are an active member in anime or artist communities, please help spread the word about this issue. Together, we can convey to the UN and the international community why this new attack on free speech will not be tolerated.**\n\n[ZeroMedium post](/ZeroMedium.bit/?/1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB/un-proposal-to-ban-fictional-works-as-child-pornography)",
			"added": 1550689030
		}
	],
	"topic_vote": {
		"1_1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA": 1,
		"3_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp": 1,
		"1_1GuYKebkQAqGJ4tNpNp4TD1UuoHHudCJLA": 1,
		"5_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": 1,
		"1_1MocL2J4KmBk6xozE4eE4jQVfurHdGCTqM": 1,
		"25_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": 1,
		"6_1GNgaj5EqkzqYECYbXa889fGLyuseHRi3t": 1,
		"1_1J4miEbRYPUMBgTDd4J1CUxzusKcvHeP3b": 1,
		"1_1L6pjaEajyF4kYhT5AXeJKUnUuSR5oGKrE": 1,
		"1_15NXsHCCfQw8BUSxnsapUH212qTtg29iFU": 1,
		"1_1KGozab6jp6jA6zVM8cTFdzMmBasriNP4f": 1,
		"1_14Kakxw14Eo5mXozLpsU755yeQuPmLRS9z": 1,
		"2_1GmJVE6KmMyRKKfEg2aiTjCtCU5poP3Rde": 1,
		"1_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1512163082_17Zks611RR4oN8USC3RxJzaw94GyPufioG": 1,
		"1513104983_1L1oZ2XdV78aFiV3h3cik24gdChtxzJ3To": 1,
		"1513544848_18zH6Av8AX7XdEW9PNFeb8QCs4QdMTVaYB": 1,
		"1513607828_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": 1,
		"1513904934_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7": 1,
		"1514251686_12NskKs9ELvKwZ8DS7tCxw4QTzdg1BXfoa": 1,
		"1514932876_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB": 1,
		"1514988274_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1515306363_14QcLzUoU8uNsghKvcAbn6juCpwfr9uj6P": 1,
		"1516734835_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB": 1,
		"1516797458_15PkTh9DC2wPmrGrQoYVQ6xJLobdanakd4": 1,
		"1516844220_1H6sFFHqLmoMVtWrixnaGWs3ChyEYhwCgT": 1,
		"1518616574_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": 1,
		"1518964184_1D7mzbt2Bwx2t6Gx3EHSmyrEBaMW1o7ZNp": 1,
		"1519420799_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": 1,
		"1519690191_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": 1,
		"1519756729_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1520454331_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB": 1,
		"1530616286_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1530873258_1B6sqsG3NZefF44y9TREmf3UqjBDD3KWFW": 1,
		"1531226793_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1532889245_1NBvhfRTw3aBnasNwmSJ4YBWeRhnxAuiSy": 1,
		"1533120187_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"1537822393_1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7": 1,
		"1537805203_18CYChXXbhpzpNMTtoDLD5ARMEdddhkSsR": 1,
		"1538339080_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1541565435_15TSdTU5ZrAHXXiMQvMUEEUm17GFt5WqWp": 1,
		"1541030608_1CrzoomCXRHkg6vqaRXwffoMkWMjkDurf4": 1,
		"1542671496_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": 1,
		"1543546851_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1548974921_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7": 1,
		"1565139032_1Bgm4LkHQ6dvAkh8XBNuWDqKa5czmosBNH": 1
	},
	"next_comment_id": 508,
	"comment": {
		"1_1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA": [
			{
				"comment_id": 1,
				"body": "It's potentially really cool. But I don't know how trustworthy it is to use over tor (or i2p) while retaining anonymity. I'm also leery about how every site needs to run js (it can't be helped, i guess!) Some of the developer posts on github also lead me to believe that this anonymity and security is not a very high priority to them.\n\nEverything also seems to be set up to use only one identity on all sites. The identity it asked me to post on here is the same I used on ZeroMe and ZeroMail and everywhere else that required an identity (even an anonymous imageboard!) I don't know if I can even make a new one without deleting my entire ZeroNet profile and starting over. It seems I can only be one person on ZeroNet, which is counter to the way people participate on the public internet.\n\nVery mixed feelings, but its still neat that I can publish something, send it to a bunch of peers, turn my computer off, and people will still access it. It's like freenet but not ancient. Everything about the UI is hipster millennial garbage though.\n\nI've only been using it for a couple of days and that's what I think about ZeroNet so far.",
				"added": 1481582131
			},
			{
				"comment_id": 2,
				"body": "> [gremious](#comment_13_1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA): You can use multiple identities, all you have to do is\nThat sounds really complicated!\nIt's frustrating that, in the software's default 'this-is-how-people-should-use-what-we-made' state, the ability to have two different identities has been disabled. It's like they're saying people SHOULDN'T be doing that.\nMaybe it's just culture shock for me since I've always gravitated toward services where I can click a button and generate a new id. And maybe the way this function works will change over the course of the software's development.",
				"added": 1481652447
			}
		],
		"1_183waZSH7rC3CMWuh9nSxpUmRVh498pwGQ": [
			{
				"comment_id": 3,
				"body": "sup",
				"added": 1481653725
			}
		],
		"1_15djDL8TmcrTNVDqc8u8vg7cREZuUx1Rg5": [
			{
				"comment_id": 4,
				"body": "echobot never replied to the first message i sent to her. i waited a day and sent her a second message. she only replied to the second message.",
				"added": 1481845073
			},
			{
				"comment_id": 5,
				"body": "> [whacko](#comment_13_15eMfttUaaszDW39pJHosSc5bgZHuXMEaK): Was it something you said? ;p\n\ni first told her to reply to my mail if she loved me. i wish i was kidding.\ni also get an error updating a single file, just like op",
				"added": 1482014548
			}
		],
		"2_17tQX9J2fScN9APmweSUnzEU4EfTG1ojYb": [
			{
				"comment_id": 6,
				"body": "i just assumed that feature was broken because every time i open the browser all my favorites get reset. how exactly are favorited sites saved? cookies? localstorage? or something on zeronet's side?",
				"added": 1482099967
			},
			{
				"comment_id": 7,
				"body": "it seems to save it in a cookie. so you have to tell your browser to allow cookies to be saved. or else it'll forget everything you favorited. really though, it should be saved on zeronet's side of things. let us customize our own ZeroHello page! that's what it's there for, isn't it?",
				"added": 1482107159
			}
		],
		"1_12UdbJncu6j8isif9jpfDAVETWD8EmsYfM": [
			{
				"comment_id": 8,
				"body": "newbie where are you ;-;",
				"added": 1482280682
			}
		],
		"1_19Sn2ocjSvxhwzp7EvxBrsJdBuzDCjcvDc": [
			{
				"comment_id": 9,
				"body": "i can give you my old yahoo mail account if you want it??",
				"added": 1482363674
			}
		],
		"1_1GuYKebkQAqGJ4tNpNp4TD1UuoHHudCJLA": [
			{
				"comment_id": 10,
				"body": "i think you'll find the community quite hostile, friend. but then what's the worst they can do, censor you? if they succeed, then i wonder what purpose 0net has.",
				"added": 1486763956
			}
		],
		"1_12fSitbSXCwW7nAiyV7jWzrbkkvVBMvHDc": [
			{
				"comment_id": 11,
				"body": "oh yeah? i can double your btc AND trim your rune platemail for only 100gp!",
				"added": 1486855404
			},
			{
				"comment_id": 13,
				"body": "all i'm saying is i can offer the same thing you are offering and more\nif anyone needs their rune armor trimmed you can find me idling in the west bank in Falador. i also do dragonhide.",
				"added": 1487027058
			}
		],
		"2_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": [
			{
				"comment_id": 12,
				"body": "i know! my reason for coming to zeronet to find cp on zerome and for the bitcoin doubling programs. so i could really do without the holocaust denying. come on people.",
				"added": 1487026542
			}
		],
		"1_15LRqNcFJErcQbXY9yRUtffLuToqVr8rDu": [
			{
				"comment_id": 14,
				"body": "this is an underrated thread",
				"added": 1487029108
			}
		],
		"5_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": [
			{
				"comment_id": 15,
				"body": "ZeroRadio would be cool. i dont think ZeroNet can support something like a live audio stream. maybe the music is all user contributed? maybe with an html player that tries to keep everyone listening roughly in synch somehow?\n\nit might be cool to see some multiplayer games designed to take advantage of ZeroNet's functionality. chess, anyone? or perhaps even something as ambitious as a mud? maybe one of those collaborative drawing things?\n\ni'd like to see people share interactive fiction. twine games are literally just an html file, easy as hell to share as optional files i would think\n\ni'd like to see development on irc-like live chat rooms, like ZeroBoard or ZeroChat Live, and to see people actually active on them ;-;\n\ni'd like to see continue development on ZeroMe. i don't have anything specific in mind. but it's already almost as cool as diaspora. and it's definitely much better than twister. it's probably the single best thing that has come out of ZeroNet.\n\nthis is a non-comprehensive list of things i'd like to see.",
				"added": 1487211031
			},
			{
				"comment_id": 17,
				"body": "if people want to have a distributed network with persistent content which is quickly accessible, they need to develop a culture of giving up that bandwith or their precious hdd space in order to make that network happen.\n\nthis is a social problem and not a technical one, which hampers the growth of pretty much any decentralized service. it cannot be resolved with clever code. people need to learn to share and give back.",
				"added": 1487281702
			},
			{
				"comment_id": 19,
				"body": "sounds like a good subject for a new post, brainstorming how to foster a culture of sharing and contributing resources.\nhey, that qualifies as content we'd like to see!",
				"added": 1487284619
			}
		],
		"2_16ruLucRLto6GhT1Zb3P8JVZzC48fxd9Cc": [
			{
				"comment_id": 16,
				"body": "there is a very serious risk of system/os updates not breaking themselves catastrophically, which can be really difficult to get acclimated to for some Windows users. i speak from experience.",
				"added": 1487212845
			}
		],
		"1_12wGEUrb2N4oeNxs7bEjcV5GJe8VP9Cdsq": [
			{
				"comment_id": 18,
				"body": "looks pretentious and edgy. i've never seen so much fucking cussing in official media, god damn. so basically it looks like closed source retroshare? why don't they just contribute to that project instead?",
				"added": 1487284220
			}
		],
		"1_1DxWcQsQ5cEBqXgc94pKWtzRo6Xn3iWsnK": [
			{
				"comment_id": 20,
				"body": "yes i do",
				"added": 1487373995
			}
		],
		"10687_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 21,
				"body": "all of these news items being pulled here are incredibly pathetic. this article is especially so.\nif these articles were actually curated (not just automatically posted when your bot detects words like \"tor\" and \"dark net\" in them) people might actually read them or discuss them.",
				"added": 1487443382
			}
		],
		"1_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd": [
			{
				"comment_id": 22,
				"body": "are we a private company?\ndo i get benefits for funposting here?",
				"added": 1487446887
			}
		],
		"1_1MocL2J4KmBk6xozE4eE4jQVfurHdGCTqM": [
			{
				"comment_id": 23,
				"body": "i dont think there's anyone here who would oppose more animalporn content on zeronet",
				"added": 1487543832
			}
		],
		"14_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 24,
				"body": "get ready to see \"Sorry this video is unavailable in your country\" a whole lot",
				"added": 1487559189
			}
		],
		"2_15zYrGJKfXo6XXU6rBUsuU3cTgpJkDuQYA": [
			{
				"comment_id": 25,
				"body": "i leaked through my underwear does that count",
				"added": 1488044076
			}
		],
		"1_1ATpj32EgvgApKTmBq1KiY62B5UjzfSRJS": [
			{
				"comment_id": 26,
				"body": "i dont understand, are you saying dolan trump isn't real? how do you explain all his tv appearances then???",
				"added": 1488326850
			}
		],
		"25_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 27,
				"body": "I disagree about the chat rooms, I think people like simple chat, but they don't like waiting more than 30 minutes for someone else to say something. Chat rooms that are not ZeroBoard do not have any exposure, however, and to a new visitor those chat rooms appear to be dead. I've had several conversations on one of these chat sites, and I remain convinced the only reason people don't use it is because they don't know that it's there, or they are under the assumption that the site is dead.",
				"added": 1488923982
			},
			{
				"comment_id": 28,
				"body": "@kai0, I don't understand, sorry. I'm not German.\n@rythrix, that's exactly what I do also. it might be nice if zeronet could show a notification in the tab whenever new content is published",
				"added": 1488938369
			}
		],
		"1_18YE3Sc5daizwqVAoPu3YDvURfie2VmSwC": [
			{
				"comment_id": 29,
				"body": "how do you propose we share them?",
				"added": 1489457719
			}
		],
		"1_1HLFF47LhPMfkv43GJoGCn7ZwXEAZmFHC6": [
			{
				"comment_id": 30,
				"body": "it's weird that that site would be the only one you have trouble visiting. try deleting it and visiting it again maybe.",
				"added": 1489509718
			}
		],
		"6_1GNgaj5EqkzqYECYbXa889fGLyuseHRi3t": [
			{
				"comment_id": 31,
				"body": "I love you",
				"added": 1489592543
			},
			{
				"comment_id": 32,
				"body": "> [yinyue](#comment_16_1GNgaj5EqkzqYECYbXa889fGLyuseHRi3t): Really ?\n\nyes because this is really cool! it was one thing i really wanted to see happen on zeronet! the only way it could be better was if the music played in synch with everyone who was on the page at the same time, but that might not be feasible and might not be an enjoyable experience for everyone",
				"added": 1489699794
			},
			{
				"comment_id": 33,
				"body": "sick must have made it then?\n> [rythyrix](#comment_43_18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y): Will you be making permanently store the tracks, or will you be aiming more toward ephemerality?\nmaybe when it reaches a certain amount of MB space, the oldest songs should drop off as new songs get uploaded?",
				"added": 1489784698
			},
			{
				"comment_id": 34,
				"body": "i assume nothing would stop one person from flooding it with their unique idea of what counts as music. i dont want to be the person who tests this though.",
				"added": 1489958150
			}
		],
		"1_1PfXizQkX7L7ho96Yqva2hvdk6VFT9Dnk7": [
			{
				"comment_id": 35,
				"body": "it seems that english speakers are bigger shitposters than chinese friends.\nchinese posts, while completely indecipherable, are still vaguely on-topic if you run them through a google translate.\n\nif this makes you uncomfortable, you should create a decentralized blog to express your feelings to the world :(",
				"added": 1491337797
			}
		],
		"1_1FNuZtJdubQVu1Mxs65nBVWKuE84pSsoBG": [
			{
				"comment_id": 36,
				"body": "some of us like posting cat pics\n\nyou want to talk about anonymity concerns and protecting yourself from ww3? i recommend burying your head between your knees or uploading your brain to the net before they lock cyberspace down.\n\nalso zeronet does not have a \"target\" \"demographic\". its a neutral platform for anyone to make use of. are you asking what this specific forum ZeroTalk is about? it appears to be a poorly moderated test/proof-of-concept for a message board that anyone can copycat if they want to.",
				"added": 1491497852
			},
			{
				"comment_id": 37,
				"body": "> [anonymouslogin](#comment_7_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Most people are not comfortable enough with technology to use this forum, and though it's not so much a target demographic, it certainly is a limited demographic. As ranxerox said, the technology needs to be easier to use and the interface made more intuitive before the sort of discussion OP wants will be possible.\n\nwhat you describe is a social problem that exists everywhere throughout the internet. it cannot be fixed through software. you have to change the way people think about and interact with computer technology.\ni also cannot imagine how zeronet could be made any easier than it currently is. you plug it in and it works.",
				"added": 1491772698
			}
		],
		"1_1688KSTcvYWqFhiMigh4LnUZ27KfU2W8FK": [
			{
				"comment_id": 38,
				"body": "i was abducted by a ufo after i visited someone's zite. at first i thought it was a coincidence, but the next day i went back and the same thing happened again! be careful on what you click on, unless you want to get probed like i was :(",
				"added": 1501911055
			}
		],
		"1_1d6oFadKcBXxEZHvmvAiZCoyrBeAmmLdi": [
			{
				"comment_id": 39,
				"body": "deep♂dark♂fantasy♂",
				"added": 1501983315
			},
			{
				"comment_id": 40,
				"body": "> [my0n](#comment_3_1ASCdxpruMqp1eDrMf4v7VibcguVWoyNo7): Hey buddy, I think you've got the wrong door, the leather club's two blocks down.\n\nFuck you",
				"added": 1501988047
			}
		],
		"1_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 41,
				"body": "Multiple accounts is a good starting point for having anonymity and not having all of your online activity linked back to a single ID... Part of what is frustrating about ZeroNet is the simple lack of anonymity. Even with tor, all your posts come back to one ID. This truly is the \"reddit\" of \"deepnet\". ZeroMe is still 1000 times better than twister though.",
				"added": 1502144830
			}
		],
		"1_1Hv2qHowmG8sURX51L4zXQDDxakF6XgEvB": [
			{
				"comment_id": 42,
				"body": "there was strong russian presence on i2p last time i sunk my teeth in that network, so if you haven't been there yet i would recommend trying it out also.",
				"added": 1502157198
			}
		],
		"1_1NgtYwuvjdzBhq5pCg9mTzo63APBBS6V46": [
			{
				"comment_id": 43,
				"body": "http://freechildporn.tk/ref=fbi.gov\nthank me later ;)",
				"added": 1502657768
			},
			{
				"comment_id": 48,
				"body": "There are people who are sexually normal but watch too much porn and are drawn to more deviant things such as porn involving children. It is a not uncommon symptom of pornography addiction. I am not certain how frequently this occurs. And then there are pedophiles (stop spelling it wrong you british fucks) who are genuinely attracted to prepubescent children. There is conflicting, sometimes poorly constructed evidence that a minimum of 1% and a higher end of 5% of the entire population of human males are this way.\n\nMaking fun of OP is the most logical step because making fun of people is fun to do. We should continue to make fun of him. However, assuming whether the OP is one or the other is ridiculous with the very limited amount of information we have about him. All we know is he wants to bust a nut and he wants to do it to child porn.\n\n> [akito]There is no real paedophile who calls child porn literally \"child porn\".\nHaving spoken with multiple pedophiles and having developed strong amicable relationships with some of them, I will tell you they all still call child porn \"child porn\" regardless of how they feel about it because that is what 100% of English speaking people call it as. If you call it by any other name, nobody will know what you are talking about.",
				"added": 1502848078
			},
			{
				"comment_id": 50,
				"body": "akito you must be a coprophagiac, i have never seen anyone so full of shit before in my life",
				"added": 1502916344
			}
		],
		"1_16UYTd5pL9rt4hhxQAmfX89QqmjJB58xDx": [
			{
				"comment_id": 44,
				"body": "travel back in time and use one of the free fountain services. once you return to 2017 the fraction of a coin you were given will be worth well over 1USD",
				"added": 1502658434
			},
			{
				"comment_id": 45,
				"body": "it's a joke how inaccessible digital currencies really are. you may have to beg for it, sell creative or sexual services in exchange for it, or find someone who is simply interested in what you are going to put on that domain name",
				"added": 1502659118
			}
		],
		"2_18Cxdyc2FEuswoXnBkrAfCkM2Yu1p4NjcR": [
			{
				"comment_id": 46,
				"body": "i am deeply saddened by this news. all i wanted in life was there to be a lust agency. now my dream will never be fulfilled.",
				"added": 1502755689
			}
		],
		"7_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY": [
			{
				"comment_id": 47,
				"body": "> [djsiurhsa](#comment_1_17kbdkoNgTSTVmnGz47NCgoEMryWL7GAf1): If your talking about bitcoin (I assume you are) then don't mine it. The more widespread it is, the less you get from mining. Instead play it like a stock, bitcoin is currently going through a bubble, it will most likely fall back to 1-3k in the next 2 months.\n\ni've been telling myself bitcoin is a bubble on and off for the last 3 years but every time i say it the value doubles and doesn't come back down. mining coins is simply a waste of perfectly good electricity though. stop driving up the price of gpus!!!",
				"added": 1502832995
			}
		],
		"1_1ECmsQzFruxQnUt8DWmC2SKz3xL39XgzSa": [
			{
				"comment_id": 49,
				"body": "if it makes you feel any better, there are no interesting www websites either",
				"added": 1502916332
			}
		],
		"1_1J4miEbRYPUMBgTDd4J1CUxzusKcvHeP3b": [
			{
				"comment_id": 51,
				"body": "lewd",
				"added": 1503007818
			},
			{
				"comment_id": 52,
				"body": "> [kmueller](#comment_35_1PvReUtzc5s92BWTUDnxvmVGepNcyA2otB): wtf, its not about welfare at all!\ni'm sure that may be open for debate",
				"added": 1503008262
			}
		],
		"8_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY": [
			{
				"comment_id": 53,
				"body": "but if i stopped using gmail the nsa will find my lack of personal email use highly suspicious and they will start to dig deeper",
				"added": 1503008739
			}
		],
		"1_18C45ndJpnDbtgU7QdFxbfcENxBsPPEUtG": [
			{
				"comment_id": 54,
				"body": "antifa still wets his bed",
				"added": 1503010810
			},
			{
				"comment_id": 59,
				"body": "i wish extremists would go away and never come back",
				"added": 1504226902
			}
		],
		"1_1L6pjaEajyF4kYhT5AXeJKUnUuSR5oGKrE": [
			{
				"comment_id": 55,
				"body": "that was really bad, but then i saw this in my recommended videos: https://www.youtube.com/watch?v=qPJvGMYxDPs\ni dont think i will be able to sleep tonight....",
				"added": 1503011532
			}
		],
		"14131_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 56,
				"body": "does the tor project regularly take the time to publicly express disgust in something that spills over into their network?",
				"added": 1503012123
			}
		],
		"1_15NXsHCCfQw8BUSxnsapUH212qTtg29iFU": [
			{
				"comment_id": 57,
				"body": "0-Gallery looks cool. I mostly have r-18 content but I have SFW manga also to share once it is up and running.",
				"added": 1503703408
			},
			{
				"comment_id": 58,
				"body": "> [kaffie](#comment_462_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): AFAIK it was meant to replace stuff like exhentai/e-hentai and nhentai. Not as a general manga site lol. So ofc. it'd be naturally angling towards 18+ content. But you could easily clone the data site and upload SFW stuff to it.\n\nIt actually looks like it's meant to support hubs, where users can choose to enable a hub that contains NSFW content, or they can choose to not merge with that NSFW hub. But we'll see once its running I guess.",
				"added": 1503703940
			}
		],
		"3_16UYTd5pL9rt4hhxQAmfX89QqmjJB58xDx": [
			{
				"comment_id": 60,
				"body": "there used to be a big blocklist someone compiled which purported to have every known pedophile user included in it. i always found it incredibly humorous. at the time there were only 1 or 2 actual people who spammed bad things in public places who generated new ids when they were censored by the zite operator. so the list was not actually useful for anything. but it did incite pedo witchhunting to some small extent. i think if the maintainer was still active when i started using zeronet i would have been added to the list for my /c/ tier sfw content.",
				"added": 1504324189
			},
			{
				"comment_id": 61,
				"body": "> [joczo](#comment_36_14UupgrdnT7Y8vMES7aqUFgD1fC5RYNrh8): Stopped seeding 0chan,thanks for the info(I wasn't even using it tho)\n\n0chan and 0chan Porn are two different zites. 0chan Porn is the one that had sketchy content, and that is kept to optional files that users of the site have to opt into. 0chan itself doesn't have anything illegal except for political views that I know of. So if you added 0chan rather than 0chan Porn to your block list that won't really achieve anything.",
				"added": 1504396969
			}
		],
		"1_19vYZ3YDA3LLxrhk3kSo58p2EppqkJVDMZ": [
			{
				"comment_id": 62,
				"body": "why, do you have some hot scoops?",
				"added": 1504903302
			}
		],
		"2_1JTtwMPZ5mKaF6S1wAPzZ8SmZTgTygz5Rb": [
			{
				"comment_id": 63,
				"body": "I'm not sure if Request Policy works properly on Zeronet, but setting a bogus proxy (127.0.0.1:[bogus port number] for all protocols & No Proxy for 127.0.0.1) does work.",
				"added": 1504903541
			}
		],
		"1_1PiXrhT1UjMZmJc5WFhfUxourdfapeHJ8o": [
			{
				"comment_id": 64,
				"body": "> [obiwanzanobi](#comment_33_1LUy9iAxeWsj1DP5L8V17Yb2vo87FucjgD): noice.  Any steam alternatives?\ntry launching \"[video game].exe\" where [video game] is the name of the video game.\nSteam is not necessary to play video games, except for specific games which are Steam only. What functionality of Steam are you trying to replicate besides playing video games?",
				"added": 1504904127
			}
		],
		"1_1WeDfuFi18uBne938aNwZDwAuKPMDYQxn": [
			{
				"comment_id": 65,
				"body": "they're not literal communists they're just neo liberal sjw feminazis. also mastadon has more loli porn than gnu social so it really depends which federated hub you join. but there are definitely too many \"safe space\" hubs that ban the good hubs.",
				"added": 1505017528
			},
			{
				"comment_id": 66,
				"body": "> [kaffie](#comment_494_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): \"Us\" lol. Cute. You realize most people here are far-left anarchists, right? [...]\n\nBanning \"hate speech,\" and people who fall on the right wing of the political spectrum is the same as banning free speech and if you didn't identify yourself as a far-left anarchist you might have the capacity understand and appreciate that. It's truly unfortunate that over the years I have had to come to terms with the realization that left leaning services are just as hateful as the right leaning ones. At least the right leaning ones are willing to take me in even though they hate me just as much or more as the left. I don't like racism. I don't like hate. But \"liberal\" services are not willing to let me participate on them. They censor me and shun me, so I have no choice but to befriend and allow my politics to fall in line with the ones who don't do that. If you are uncomfortable with the resurgence of right wing ideology, please take a moment to consider it as a knee jerk reaction to the crimes and faults of the strengthening left.\n\nAdditionally, its funny to me to say that GnuSocial and Diaspora users are at the whim of their tyrant operator when you choose to glide over the fact that Mastadon has the exact same problems.",
				"added": 1505057679
			},
			{
				"comment_id": 68,
				"body": "> [xyq](#comment_1_1EXV2zH5U6GkSuh3vouRWUNsmsUND6JT4i): You are all nazis.\n\nim a fucking kkk nazi",
				"added": 1505169106
			}
		],
		"1_1ApJ2dibcJbE8cvEeo3Db75cwkRArD2XjA": [
			{
				"comment_id": 67,
				"body": "i was under the impression the only ones who have access to any network which spans outside of their own country were government and military personnel. but it could be possible some have found a way?",
				"added": 1505162859
			}
		],
		"2_1GmJVE6KmMyRKKfEg2aiTjCtCU5poP3Rde": [
			{
				"comment_id": 69,
				"body": "it just goes to show that you're never safe from the internet police",
				"added": 1505250031
			}
		],
		"1510300423_1BgmsWcEitkkf96t5qVkBFPoYwdoc4hSqA": [
			{
				"comment_id": 70,
				"body": "we all gotta go somehow",
				"added": 1510363666
			}
		],
		"1511184346_1Pp66xGV4cnqmePgFTJbg4WoQwgkhK6Ukg": [
			{
				"comment_id": 71,
				"body": "thank you i will continue boycotting child pornography",
				"added": 1511310049
			}
		],
		"1512163082_17Zks611RR4oN8USC3RxJzaw94GyPufioG": [
			{
				"comment_id": 72,
				"body": "Not Found\nloli.html\n\ni will help seed so that one day it will be found. thank you, sir.",
				"added": 1512225600
			},
			{
				"comment_id": 74,
				"body": "> [penetratormk2](#comment_9_1AC3zv2K9eEsm8XpfSirwb13hSdtjHAiu5): I feel the same pain now. Checked it, loli.html couldn't be found. ;(\n\nwe will get through this, we just need patience.",
				"added": 1512866811
			}
		],
		"1512560923_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": [
			{
				"comment_id": 73,
				"body": "maybe after sankakucomplex implements this i'll get some of that easy money",
				"added": 1512768612
			}
		],
		"1512912701_149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN": [
			{
				"comment_id": 75,
				"body": "why do you call your service Youtube? why would you want to be Youtube? i thought everyone was trying to get away from Youtube. personally i don't see room in my life for another Youtube, the one that already exists is problematic enough.",
				"added": 1512942808
			},
			{
				"comment_id": 76,
				"body": "> [install](#comment_2_149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN): zerotube, nekololi, i just copied the text from the wikileaks.https://shop.wikileaks.org/donate\n\nat least you were smart enough to make changes the cryptocoin addresses after you copied and pasted that page. i've never blacklisted a zite out of spite before but i'm removing your service from my router so i don't visit it by accident.",
				"added": 1512943133
			}
		],
		"1513104983_1L1oZ2XdV78aFiV3h3cik24gdChtxzJ3To": [
			{
				"comment_id": 77,
				"body": "what kind of friend did you have in mind?\nactually now that i think about it i don't have any to spare... sorry",
				"added": 1513119102
			}
		],
		"1513303856_1PdVrw7boKHUavWTQxD3UaNGM4tx5baXDy": [
			{
				"comment_id": 78,
				"body": "fapping is one of the only things enjoyable in life, and the pleasure gotten from it is so small and fleeting that i couldn't possibly imagine doing it any less often.",
				"added": 1513389840
			},
			{
				"comment_id": 79,
				"body": "> [byg8o897y7t68fto](#comment_25_1PdVrw7boKHUavWTQxD3UaNGM4tx5baXDy): Haha, feels much better seeing how far you can take nofap though.Here's some websites you should look at if you want to find out more.https://www.reddit.com/r/NoFap/https://www.nofap.com/https://fightthenewdrug.org/\n\nwhy would i take away the only enjoyment i get out of life?",
				"added": 1513390804
			},
			{
				"comment_id": 80,
				"body": "> [byg8o897y7t68fto](#comment_27_1PdVrw7boKHUavWTQxD3UaNGM4tx5baXDy): You may discover other interests. End of the day though you're free to do with your body as you like and I'm not judging.\n\nonce a day or once every other day isn't a big deal. usually i'm too depressed or fatigued to even manage that much. i have a lot of problems but working out my sexual frustration in a healthy manner doesn't need to become one of them.",
				"added": 1513392388
			}
		],
		"1513417002_1EQuGEmS5J8SQ1xA6MM9KfubBb71uxiLvs": [
			{
				"comment_id": 81,
				"body": "if you don't want to host something you don't have to. delete it on zero hello. does it host illegal content? then add it to your black list. that isn't hard.\n\n0chan and 0chan Porn are two different sites. i have not seen \"illegal content thumbnails\" on 0chan. but perhaps a person who lives in country A sees more illegal content than a person who live sin country B since different countries impose different laws on their citizens.\n\nalthough if i remember right, 0chan Porn uses optional files for their different boards. if you don't opt to download something you know is bad, you should be safe, right?",
				"added": 1513435839
			},
			{
				"comment_id": 82,
				"body": "if you are running a proxy service, you should be aware that 0chan Porn is not the only porn site ran on this network, and it is likely not the only site which does not have an \"age disclaimer\" on the front page if that is a legal requirement to have on your website where you live.",
				"added": 1513436085
			},
			{
				"comment_id": 83,
				"body": "> [nothing](#comment_10_1GnKQZXGc51J9spdsMMXxJizM41LXeKEBz): i don't know how the site's work excatly but the thing is 0chan porn has child pornography on it and that's what i'm trying to warn people about..\n\nim really sorry, i was just under the impression this was common knowledge. i have had it blacklisted on my zeronet instance for a long time, and if someone runs a public proxy service he should do the same.\n\ni'm just baffled that a topic was created asking if it should be removed from his proxy service or not. op should try to be more in touch with what's going on in zeronet, as it seems he has been proxying a cp site on the public www internet for quite some time now. he wants his \"concerns to be addressed\" but i think he would have addressed them a lot more quickly if he just went to the site and saw it was hosting illegal content.\n\nthen he posts on zerome what i can only interpret as a public service announcement demanding zite owners on zeronet to run their site in a certain way when it's really not his place to tell others how to run a website. if you are mirroring content on the public www internet, it is YOUR responsibility to make sure you aren't hosting anything illegal. other parties are not responsible for your legal problems. they are only responsible for their own.\n\nbut yes, 0chan Porn (not to be confused with the separate service 0chan), is a host for child pornography and it is to the best of my knowledge not moderated, and they do not ask users if they are 18 before entering, and they do not have a \"all models on the site are 18+\" disclaimer on the site. if that is a problem for you, i would highly recommend not visiting it or blacklisting the site. if you host it on a public proxy service to the www internet, i would highly recommend not doing so.",
				"added": 1513437585
			},
			{
				"comment_id": 84,
				"body": "if a site operator doesn't want to put an age disclaimer on their website they will choose not to do so, and that is their right. the legality of not having a disclaimer depends entirely on the legal jurisdiction they reside in, but if a website is distributed, and not hosted on a server in a specific country, there may not be any legal requirements to put a disclaimer on there.\n\nadditionally, on a website that consists entirely of user submitted content, it is dishonest and counterintuitive to proclaim \"We have verified that all persons appearing in nudie photographs submitted to our site were 18 years or older at the time the nudie picture was made.\" How would they even begin to verify this information? Unless the user who submits the photograph also submits the contact information (dox) of the individual, there is no way to reach out to them and verify their age at the time the picture was taken.\n\nit's one thing to prohibit child pornography on your site, but it's a whole nother thing to verify the legal age of all participants in pornographic footage submitted to your site by the general public.",
				"added": 1513443413
			},
			{
				"comment_id": 85,
				"body": "> [mrsrobotmobile](#comment_2_1HsgZpHaZ5BRUK5qr2YMWnubgKyNuSqokH): Obviously.. We won't ever be able to weed out all the apples..but it would be great if more zite owners were proactive about moderating their content. Just so that zeronet proxy owners can host a few porn sites here and there.. and let adults enjoy themselves without too much drama..without having to blacklist Every single site with the keywords Porn in it. [...]\n\nHave you considered that that particular site operator wished to have that kind of content posted?\nAnd while members of the ZeroNet community SHOULD be proactive and do what is best for the \"community\", it is also true that ZeroNet is a public tool that anyone can pick up and use to do whatever they want with. ZeroNet is not and should not be designed to weed out \"bad apples\" in that sense.\n\nThis means everyone else has to be the responsible and proactive. If you run a service that hosts content published on sites you don't have the ability to control, you have to be a defensive administrator and be proactive to prevent abuse of your service. That includes knowing what the hell you are mirroring and making available to everyone else.\n\nOther viewers likely ARE seeding content they don't know about. They may have since deleted or \"believed\" they deleted it without realizing some files are still being seeded. These are the risks people may or may not know they are taking when they run ZeroNet. Perhaps nofish needs to be more proactive in educating people about these risks?\n\nAt the end of the day though, anyone can publish anything on ZeroNet, and ZeroNet is designed to make it very hard for what is published to be censored and made unavailable. You may consider yourself a member of the community surrounding ZeroNet, but someone who may wish to make a CP website may not think themselves as belonging to a community, and they will likely act in such a way that is harmful to the public image of the network.\n\nYou cannot stop them from doing that because ZeroNet is designed to enable them to do that. All that you can do is think and act proactively with this threat model in mind.\n\nFurthermore, if there even WAS the ability to stop anyone from publishing CP on ZeroNet, doing so would be in direct conflict with ZeroNet's goals of being uncensorable and accessible to everyone.\n\n> [styromaniac](#comment_315_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I've since clarified that I meant 0chan Porn. The thumbnails are not optional files.\n\nThat makes a lot more sense now. I had not been there since I originally blacklisted it and forgot or did not realize that the thumbnails were not optional files, although I thought entire boards were, and different types of content were hosted on different boards which you had to opt in to. Either way, anyone sensitive to this content is better off just blacklisting it so they don't stumble on it again by accident.",
				"added": 1513458256
			},
			{
				"comment_id": 88,
				"body": "> [cracknut](#comment_2_18YwvP36gwZKnk1KfQ8Rb3ca8xJpuzJBPo): Shit like this is what scares me about Zeronet. Inadvertently stumbling on child porn and then having it either in your cache or just being marked as a peer. You're fucked. How the hell are we supposed to protect ourselves?\n\nthis is one of ZeroNet's biggest faults. frankly i do not believe network was designed with that kind of abuse in mind. now, if the content was encrypted during transmission and encrypted when saved on your hard drive to give the user plausible deniability at the bare minimum, things would be a little bit better. but as of right now, the answer is that you simply have to know every bit and byte you have cached and are helping seed.\n\nit is for this reason that i have become hesitant to automatically download and seed content on any website or service on the network without first reviewing what kind of content it is.\n\nit might be wise to stuff your ZeroNet installs in an encrypted container in addition to running in tor-only mode.",
				"added": 1513546688
			}
		],
		"1513230190_1K8XkWirXhKSqE3t6WfcjbUcuSTCamzqMJ": [
			{
				"comment_id": 86,
				"body": "> [akito](#comment_401_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY): Putting Facebook into ZeroNet would be like putting a nazi into a group of scientists. It just won't fit.\n\nnazis and scientists got along really well actually",
				"added": 1513523757
			},
			{
				"comment_id": 87,
				"body": "> [akito](#comment_403_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY): That's what they try to make you think. Obviously the \"scientists\" were doing a lot of unnecessary experiments, because they actually had no idea what they were doing. That wasn't scientific.\n\nis that what they are teaching in school?",
				"added": 1513531907
			}
		],
		"1513428479_1EQuGEmS5J8SQ1xA6MM9KfubBb71uxiLvs": [
			{
				"comment_id": 89,
				"body": "i'm very confused by this topic.\n\nare we asking for censorship on ZeroNet or are we asking for tools that provide more extensive control for ZeroNet Proxy operators?\n\nunmoderated content on the network is a feature, not a bug.",
				"added": 1513551729
			},
			{
				"comment_id": 90,
				"body": "> [krixano](#comment_251_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): It says Proxy in the title. Proxy owners should be able to manage the zites that are on their server. Currently they can block all new zites, but that is not friendly to the users. Proxy owners can get into serious trouble from their hosting provider or government for having illegal content. If you want to view illegal content, use your own client instead of potentially getting someone else into trouble because of it.\n\ni did not know the proxy stuff was an officially developed component of zeronet, thus some confusion. i had just assumed people were setting up public proxies on their own. people who want to run proxy services for zeronet would definitely need proper tools to protect themselves and prevent abuse of their services and all of that good stuff.",
				"added": 1513633141
			},
			{
				"comment_id": 91,
				"body": "My only other post in this topic was a request for clarification.\n\nI have never once stated any opposition to any feature to be implemented in a ZeroNet \"Proxy\" Client, and have committed no greater sin than expressing my ignorance of its existence.\n\nIf what you desire are fewer opponents, I would suggest you start working toward that by checking your fucking attitude.",
				"added": 1513636569
			}
		],
		"1513825745_1vAdpJiyYEHcDZoJn93QcjzaFVKHHPg1F": [
			{
				"comment_id": 92,
				"body": "did you double check to make sure 'localhost' or '127.0.0.1' is included in the \"no proxy for\" section and javascript is enabled through noscript?",
				"added": 1513831765
			},
			{
				"comment_id": 95,
				"body": "> [cadenoro](#comment_9_1vAdpJiyYEHcDZoJn93QcjzaFVKHHPg1F): Adding 127.0.0.1:43110 to the \"No proxy\" list solved the problem. Now I wonder what happened, as connections worked last week. Perhaps A Tor update. [...]\n\ni think \"localhost\" aka 127.0.0.1 was always there by default, but a recent scare with the tor browser leaking the users ip address that happened while visiting local:// files might have prompted them to take 127.0.0.1 out of the \"No proxy\" list in one of their updates.",
				"added": 1513912243
			}
		],
		"1513852777_1G6QESmeipZsukJX5WvDxxwSioaGnEDRk3": [
			{
				"comment_id": 93,
				"body": "bittorrent and dht are not anonymous, and neither is zeronet",
				"added": 1513881046
			},
			{
				"comment_id": 94,
				"body": "anonymity is really important for some people. its important people are aware of what identifying information software tools are exposing and who it is being exposed to.",
				"added": 1513883420
			}
		],
		"1513904934_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7": [
			{
				"comment_id": 96,
				"body": "it'd be cool if you got notified when someone gives you a (You). and the ability to follow threads so you can see new posts on the ZeroHello",
				"added": 1513957640
			},
			{
				"comment_id": 109,
				"body": "> [m00plicate](#comment_22_12pqz164272L8bYB9UA2enxr92boTWBpfd): Does anyone know of a zeronet imageboard with less questionable content? I'd rather not host sexualized drawings of children.\n\nno, you will have to make your own, or wait for someone interested enough to make one for you... or else you can wait and see if Millchan sets each board up as optional files, or implements some kind of board blacklisting feature.",
				"added": 1514426491
			}
		],
		"1513965167_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C": [
			{
				"comment_id": 97,
				"body": "> [penetratormk2](#comment_14_1AC3zv2K9eEsm8XpfSirwb13hSdtjHAiu5): It's useless. Why buy it?\n\nto turn it into namecoin for .bit domains i guess? i use it to pay my vps bill.",
				"added": 1513974919
			},
			{
				"comment_id": 99,
				"body": "> [jlxip](#comment_56_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C): You can actually set (in most wallets) the transaction fees to 0BTC. It will take much longer, sure, but you won't lose any money.\n\nsetting a low or 0btc transaction fee in the year of our lord 2017 will result in the transaction not being accepted by the network.",
				"added": 1514047905
			},
			{
				"comment_id": 100,
				"body": "> [jlxip](#comment_59_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C): Really? I did it recently and it took a few hours but it did work.\n\ni did it recently and it was thrown out the window. i find it very hard to believe that you sent a 0 transaction fee transaction and it was accepted in sooner than 48 hours. if someone is expecting payment from you it's best not to play the game of probability and just pay the tx fee...",
				"added": 1514050408
			}
		],
		"1513986791_14FmHDvptSEPgDRX7zSoagsJQCQjJRbDgt": [
			{
				"comment_id": 98,
				"body": "> [jlxip](#comment_54_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C): It's kinda in French.\n\nsomeone should reach out to the zite operator and submit a bug report",
				"added": 1513988182
			}
		],
		"1514083850_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": [
			{
				"comment_id": 101,
				"body": "she's active in [ThunderWave](http://127.0.0.1:43110/thunderwave.bit/) right now",
				"added": 1514084399
			},
			{
				"comment_id": 102,
				"body": "> [kaffie](#comment_535_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I've been dead. But really though, I'm still here. Still around. As I've mentioned a few times in the past, I've been struggling with some issues. Medical problems, financial problems, etc. [...]\n\nthis feels silly but i actually forgot you were two different people until just now, probably because it's been so long since i've seen both of you active at the same time.",
				"added": 1514084858
			}
		],
		"1514154652_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 103,
				"body": "the data folder should be all you need. the data is not dependent on any operating system. just replace the new data folder with the one you backed up and it should be good to go.",
				"added": 1514154890
			}
		],
		"1514154784_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": [
			{
				"comment_id": 104,
				"body": "just don't try running for office, the powers that be can find something from your history to blackmail or smear your reputation with.",
				"added": 1514155175
			},
			{
				"comment_id": 105,
				"body": "> [missesrobot](#comment_71_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB): I personally could never run for office. I'm too crazy to run for office.. I have irregular sleep schedules, I write a lot. I procrastinate. I'm late to classes. I'm not filthy rich, either. I'm thinking something more along the lines of an Open Source global AI, controlled and written by the people.. something that can keep the big powers in check. We're already building driverless cars to replace truck drivers and put them out of work. Why can't we build AI to put politicians out of work, too?\n\na few of the reasons you gave for not running for office are traits of the current president of the US. at any rate, i'm not going to accept a utilitarian computer ai to dictate my life anytime soon. many societal problems we have today are because we have rapidly developed and adopted technologies which we are not prepared to use ethically or responsibly. the say an AI runs our country is the day i shun tech altogether and go live innawoods.\n\nrather than making a computer do all our hard work for us, we should work on the political systems we already have in place, which can be considered \"open source\", which set the rules for how people take office and what powers they are limited to. there certainly are flaws with the current system. there are certainly flaws with the implementation of the system. as a society we should be researching and tracking these \"bugs\" to improve the way our government behaves. this is the way to go, rather than turning to machines and computers to decide things for us. government of humans is the job of humans. not the job of gods or machines.",
				"added": 1514156324
			}
		],
		"1514156876_1AWmDPJBYVGXKfNwKvkSFZmbqRu1eeVQTi": [
			{
				"comment_id": 106,
				"body": "optional files are not automatically downloaded until your browser requests them, i think. some sites seem to have a little slider when you pull out that \"0\" button at the top right, and the slider will download optional files automatically to help seed the site. i wouldn't advise this for any site that allows for user submitted content. but i think this will allow you to automatically start downloading all future optional files from the site. i don't think it will download all the optional files of the past, though. you'd probably have to manually request each one of them.\n\ni think generally the entire \"core\" of the site gets downloaded though, unless certain pages are indicated by the zite owner as \"optional.\" on an image hosting site, for intance, the page structures will all be downloaded, you just wont necessarily have every png/jpg downloaded.\n\nsomeone more experienced than me may know better and have a superior answer, though.",
				"added": 1514157255
			},
			{
				"comment_id": 107,
				"body": "> [atomix](#comment_2_1AWmDPJBYVGXKfNwKvkSFZmbqRu1eeVQTi): thanks for the tip it's my first time using the slider (hold the 0 and drag left)\n\ni really wish they changed behavior of that on non-phone clients. nobody wants to click and drag a ui element with their computer's mouse.",
				"added": 1514163292
			}
		],
		"1514251686_12NskKs9ELvKwZ8DS7tCxw4QTzdg1BXfoa": [
			{
				"comment_id": 108,
				"body": "i wish you the best of luck with your enterprise, good sir",
				"added": 1514254242
			}
		],
		"1514401551_1EYyJydDBojStVmNxdAVB2iVhVm2H1qwoX": [
			{
				"comment_id": 110,
				"body": "it is asking to load resources from bootstrapcdn.com, typekit.net, and cloudflare.com and im not going to give it that, sorry.",
				"added": 1514430262
			},
			{
				"comment_id": 111,
				"body": "> [aduraspera](#comment_5_1EYyJydDBojStVmNxdAVB2iVhVm2H1qwoX): You're right. I still have to put those resources locally. Will do it when I get time.\n\ni'll look forward to it!",
				"added": 1514496130
			}
		],
		"1514422899_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": [
			{
				"comment_id": 112,
				"body": "A blacklist feature will definitely help clean up illegal or offending content after its discovery, and will likely prove to be a very valuable tool for users. A weakness of this, however, is that it cannot be used to protect users until after illegal or offensive content has been discovered and possibly saved on their hard drive.\n\nI believe that if contents of the data directory were encrypted, it could significantly aid in protecting users from the damage that might result from this type of attack. I also believe having ZeroNet encrypt and decrypt its data directory with a password or key can be implemented in a user friendly way so that ZeroNet does not become more difficult for people to learn how to use.\n\nHowever, it can also be said that the users can take this security precaution themselves with commonly available cryptography tools. I also do not know the legal ramifications for users in various oppressive countries might be if ZeroNet implemented this kind of encryption as a feature. Additionally, implementing this feature adds cumbersome requirements onto its developer which would detract from improving and adding to the core features of the software.\n\nWith that all said, I do believe this feature would be beneficial to individuals in oppressive countries who understand the legal risks of using cryptographic software, but who are not technologically knowledgeable in how to use cryptographic tools on their own. However, it is also a fact that having encrypted content on your computer is not very helpful in countries where the mere use of cryptography is a violation of law.",
				"added": 1514497884
			}
		],
		"1514546027_1DpN91N84piuzYn2iJKM9RK3Ek8JVNjewa": [
			{
				"comment_id": 113,
				"body": "i'm regularly afraid at the notion of people i care about dying but never afraid of the idea of my own death. i am more afraid of having to wake up the next day to trudge through another day of life.",
				"added": 1514585692
			},
			{
				"comment_id": 115,
				"body": "> [styromaniac](#comment_10_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): What troubles me most is when friends stop posting or showing they're online for a while. I lost a friend to suicide. My personal health is manageable and I'm a few years older than most of you.\n\ni have not lost any friends to it yet. a few times it has come way too close. every day is always a new struggle. i am always dreading to live to see the day where i lose one of them. i hope you have been able to find peace after that loss.",
				"added": 1514597416
			}
		],
		"1514562620_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 114,
				"body": "i have no interest in doing this and only have things to lose by doing so\n..\nor if i were to talk more about myself and my personal life it would have to be done under a completely separate pseudonym, but even then it would likely be simple to pinpoint that other person as me based on various factors",
				"added": 1514588836
			},
			{
				"comment_id": 117,
				"body": "> [penetratormk2](#comment_24_1AC3zv2K9eEsm8XpfSirwb13hSdtjHAiu5): I'm surprised there's so little community related around certain kinds of porn, erotica and hentai stuff.These are things that are often either censored or unsafe to access in about half of the world.\n\nlets do this",
				"added": 1514669654
			}
		],
		"1514388476_1PJdxgV79Y1djUi5HMEmtE3HdbGZXuf6oE": [
			{
				"comment_id": 116,
				"body": "i visited it and the page loads but unfortunately i don't see the topic you made on it, so it might not have worked.",
				"added": 1514597761
			},
			{
				"comment_id": 120,
				"body": "i just got a notification of a new topic on your site push through to me on ZeroHello so that must mean it's working.",
				"added": 1514688594
			},
			{
				"comment_id": 121,
				"body": "> [transgender](#comment_7_1PJdxgV79Y1djUi5HMEmtE3HdbGZXuf6oE): Now everything should be working fine.\n\nvery cool. good luck with it.",
				"added": 1514689124
			}
		],
		"1514670501_1DpN91N84piuzYn2iJKM9RK3Ek8JVNjewa": [
			{
				"comment_id": 118,
				"body": "im just waiting for the hard pendulum swing against sjwism and new wave feminism. whats ironic about them is that they are incredibly hostile to minorities that aren't on their approved list, and do more to damage to their little idea of \"social justice\" than they do good, not to mention the damage they cause to relations between people of different race, sexual orientation and gender with their toxic attitude and behavior.",
				"added": 1514676921
			},
			{
				"comment_id": 130,
				"body": "> [misterchief](#comment_1_1MfHMc2nNh941ZdrBxP3MhD8kdtLy9ffQZ): I love that quote. There is not way I am losing to natural selection, we need to survive and make the world a better place\n\nyou lot have fun with that, i'll be sipping tea in hell",
				"added": 1515275909
			},
			{
				"comment_id": 131,
				"body": "> [alexdelarge](#comment_2_1NuFKUVr8CzANjuu4KvGbfTfaHCVey8xGA): Wasn't that the excuse for Trump people said? isn't that the backlash?\n\nall he's doing is making sjws feel justified in their way of thinking. no, i'll hold out that the real swing is coming. i don't think he was elected out of weariness of swjism or political correctness, i think he is nothing more than the byproduct of a broken 2 party political system where the other party picked a garbo candidate for him to run against.",
				"added": 1515295095
			}
		],
		"1514635449_15PkTh9DC2wPmrGrQoYVQ6xJLobdanakd4": [
			{
				"comment_id": 119,
				"body": "im unaware of any. outproxies to the web aren't really what i2p is good for.",
				"added": 1514686950
			}
		],
		"1514847532_1AhPTPZz3z1N7P9TpZytjAF2fdaXbCtStt": [
			{
				"comment_id": 122,
				"body": "i was hoping we could pool our resources together for genetically engineering real living catgirls",
				"added": 1514856544
			},
			{
				"comment_id": 123,
				"body": "> [zeronet123](#comment_1_1Ks3ciJK3iZBkstfMvSA2sjP5nMnBSrtHL): just a test\n\ndid it work?",
				"added": 1514860702
			}
		],
		"1514932876_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB": [
			{
				"comment_id": 124,
				"body": "this makes me wonder if it'd be a good idea to fork zero up and make it entirely focused on hentai uploads",
				"added": 1514940417
			},
			{
				"comment_id": 126,
				"body": "> [lonelyreader](#comment_19_1PyrAjbZiHyfW7jSWeUpDPSeMU7sAJ5HSs): it would be more user friendly if it's displayed as a gallery rather than a compressed file\n\nthat wouldn't work very well on ZeroUp but perhaps one of us should look into sharing stuff like this with 0gallery\nbut if it helps, an anon has uploaded Little Girl 1 & 2 on Millchan [in this thread](/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/1MXvnQ44YQj7vYNDCs6DjuW1D2ZBkTBoZW:l:523d71ed-fbba-44fd-acf3-05fe23da5917)",
				"added": 1515187951
			},
			{
				"comment_id": 127,
				"body": "> [stata](#comment_2_1NLLWBCVMTshG6KXY7AD3c3t1AGfn1yra9): chikan these files are dangerous on my country.........\n\ni think he did a good job labeling what it was so as to avoid as much confusion as possible.\n\nnow, if you're saying he was wrong to post it at all, i will seriously disagree with that to the furthest extent i am capable of managing.",
				"added": 1515244192
			},
			{
				"comment_id": 134,
				"body": "> [lonelyreader](#comment_19_1PyrAjbZiHyfW7jSWeUpDPSeMU7sAJ5HSs): it would be more user friendly if it's displayed as a gallery rather than a compressed file\n\ni uploaded it to a [0-Gallery Hub](/1Nekos4fiBqfcazyG1bAxdBT5oBvA76Zmo) I just got running. now it can be viewed as a gallery!",
				"added": 1515314438
			}
		],
		"1514988274_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 125,
				"body": "absolutely terrifying.",
				"added": 1515026457
			}
		],
		"1515267169_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 128,
				"body": "you just unlocked the secret to being popular",
				"added": 1515269290
			},
			{
				"comment_id": 129,
				"body": "> [styromaniac](#comment_47_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I could have kept it to myself too.\n\nbut you did the noble thing, and enabled us to start working on a new utopia where everyone is popular and nobody has to sit at the loser table at lunch",
				"added": 1515270914
			}
		],
		"1515306363_14QcLzUoU8uNsghKvcAbn6juCpwfr9uj6P": [
			{
				"comment_id": 132,
				"body": "pretty clever. my zeronet install isn't on localhost so everything failed when it tested on me.\n\nis it possible for your site to try to load the .css through relative links, ie \"href='/raw/Blog.ZeroNetwork.bit/css/all.css'\" instead of \"href='http://127.0.0.1:43110/raw/Blog.ZeroNetwork.bit/css/all.css'\" ? it would still work right? and it wouldn't be dependent on a person's zeronet listening on 127.0.0.1:43110, it could be any arbitrary ip address or port.",
				"added": 1515307385
			},
			{
				"comment_id": 133,
				"body": "well, this fingerprinting method done from outside ZeroNet is pretty easy to circumvent by using separate browsers for ZeroNet and Clearnet browsing, or else by using something like umatrix to block all non 1st party resources by default. honestly everyone should already be doing this. i've seen a few google analytics scripts try to run from some zeronet sites.",
				"added": 1515311692
			},
			{
				"comment_id": 135,
				"body": "> [beardoge](#comment_5_14QcLzUoU8uNsghKvcAbn6juCpwfr9uj6P): Actually no, using seperate browsers does not help, except maybe Chrome, however a similar attack may be possible using timings. You're right that uMatrix would help.\n\noh, yeah, you're right. in this case separate browsers only thwarts this if both are using something like request policy/umatrix.",
				"added": 1515315240
			}
		],
		"1515382567_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 136,
				"body": "> [styromaniac](#comment_59_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It was discarded in favor of Millchan, which sort of protects visitors, but not proxy owners.\n\ni would say it doesn't really protect visitors. if you want to stay safe as a visitor you have to exercise excessive pro-activeness in using the site's internal board blacklist feature to stop content from downloading (if it even stops anything from downloading), and the site owner has gone as far as suggesting disabling write permissions for specific users you don't like in millchan's data directory (each user on the site appars to have a unique id, and each id has its own subfolder for content from each user of the site).\n\nif each board was its own hub/site, with which millchan merges together, such as how zerome, gitcenter, and 0gallery function, then each board would only be downloaded and visible if you choose to visit that site and have it included in what millchan aggregates. boards you don't wish to see (such as ones featuring illegal content) would be trivial to blacklist by users who wish to protect themselves from harmful content. unfortunately this is not how Millchan works.\n\ni love imageboards, and i'm really sad that i cannot partake in any of the ones that still operate on zeronet. i pray that this is not the case forever.",
				"added": 1515447330
			},
			{
				"comment_id": 137,
				"body": "> [mcdev](#comment_8_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7): Nice tabloid title.It's also a slanderous lie. Shame on you. [...]\n\nthere is a board titled CP, in which there was a link to a file on a site on ZN that is known for hosting CP. when pressed, you gave very clear indication that there would not be any attempts to censor any content published to the site by its users. you then insisted that hiding such content or preventing it from being downloaded is entirely the responsibility of the users, for which you provide inadequate tools to do so.\n\nif i am wrong about your intentions with not censoring CP content that will be uploaded to your site, i would be very eager to hear that i am wrong because i actually do enjoy millchan and would like to continue enjoying it.",
				"added": 1515447582
			},
			{
				"comment_id": 138,
				"body": "> [mcdev](#comment_9_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7): Maybe you should consider suggesting that next time instead of overreacting over an empty random user board. [...]\n\nmy overreaction was not to the user board. it was to the response i was given by yourself.\ni am not a smart man or a proud man. if i misunderstand millchan's stance on cp content, and if you express to me that you do fully intend to moderate the site from clearly illegal child pornographic content, then i will owe you a rather large apology, and i will do my best to deliver it.\n\nwhat is millchan's policy on CP being posted to it?",
				"added": 1515448099
			},
			{
				"comment_id": 139,
				"body": "> [mcdev](#comment_10_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7): Millchan's policy is to give users the tools that they need to be able to filter any illegal content from being downloaded and seeded from their clients.So, in the same way that it's possible for someone to blacklist zites that they are not interested in seeding, it should be possible for users in Millchan to blacklist and stop seeding the content of any boards/users they are not interested in contributing with. [...]\n\nhave you not considered the hub - merger site model? i believe that would be more satisfactory than the tools you are developing, as far as allowing users to black out boards they don't feel safe downloading content from.... blocking out specific users is a separate matter of course. i'm not an advocate of censorship or of not-allowing-people-to-get-what-they-want on the internet, nor am i particularly concerned with the woes of proxy services, but the hub/merger model gives users the opportunity to only download and follow boards they are interested/feel safe in downloading. i think it's far more suitable to achieving what you want than what you are currently doing. board owners are still the gods of their domain, and millchan no longer bears responsibility for other users posts.",
				"added": 1515451202
			},
			{
				"comment_id": 140,
				"body": "> [mcdev](#comment_11_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7): I was looking into hubs lately.It does seem like they could work well as an alternative to the current board system.I'm still not sure if they would well on proxies though since, as far as I understand, users can still submit \"bad files\" and those would be downloaded to the client.Although the hub owner might be able to moderate the content in his own hub.So I guess it could work for proxies if the proxy owner only adds hubs that he trusts to be moderated.\n\nrather than blocking millchan for having dozens of unmoderated boards, they could allow access to millchan (which does not host or serve user generated content) and allow access to the board-hubs they feel comfortable with. that's entirely up to the proxy service if they want to, but it also gives them more freedom. likewise, i think it will be very beneficial to millchan posters for similar reasons. it would at least resolve **my** current misgivings about your site, for what that's worth. it would likely, however, require you to start from scratch once again...",
				"added": 1515452474
			}
		],
		"1515595561_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 141,
				"body": "ha! why donate money to a centralized hosting solution when you can donate hard drive space and a small percent of your internet connection for a p2p one? but i suppose if everything we used online worked like that then the cost of internet service and storage devices would fly through the roof.",
				"added": 1515596453
			}
		],
		"1515558164_1J2cXfbx97JL1iQihCMateocuHzRnA4jDu": [
			{
				"comment_id": 142,
				"body": "i seriously admire your ambition, and hope you have all the success in the world",
				"added": 1515596554
			}
		],
		"1516134896_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 143,
				"body": "umatrix configured to deny requests to non-1st-party resources. i take the stance that if its not hosted by the first party i probably don't want it. if that breaks a website, i have to take a second look at what is being requested from who and decide if i'm okay allowing any of that. i can't think of a situation where this wouldn't work 100% in blocking clearnet resources while browsing zeronet, and i can't think of a time where i would want to load clearnet resources while on zeronet.",
				"added": 1516144167
			}
		],
		"1516324194_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": [
			{
				"comment_id": 144,
				"body": "this kind of venomous, spiteful attitude is really uncalled for. as the admin of the site you have control and power over what goes on within your domain. misusing that power to attack or harm anyone is unethical and quite frankly revolting. if you can't deal with misuse and abuse then you might consider shutting the service down altogether.\n\nyou don't even know if a person deliberately went to a place knowing it had content that was harmful to your service. they could easily have followed a link published somewhere. they could very well have gone there for any of the other porn boards, because last i checked 0chan Porn did not only have illegal content, there were several boards for nsfw material.\n\n>maybe it's time to get pedophiles out of ZeroNet\nif you desire to have an entire group of people removed from ZeroNet then i can't find any other words to say to you. good fucking luck with that. if you somehow manage to succeed then the entire premise of ZeroNet is compromised and everybody can turn their computers off and read a state-approved book.\n\nif you can't handle the heat of running a public service then you should step out of the proxy game. if you want to start a fucking holy war against people you don't like then i think you're on the wrong network. go back to reddit, i don't think they allow pedophiles there.",
				"added": 1516398188
			},
			{
				"comment_id": 145,
				"body": "> [glightstar](#comment_50_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): She did shut down the proxy/ close it to the public.And why so hateful?That's a bit sad to hear :/\n\ni guess i'm a little bit riled at her call to arms against a group of people who i might belong to and more than a little disgusted at her threats waged against some user of her service.",
				"added": 1516467400
			},
			{
				"comment_id": 146,
				"body": "> [glightstar](#comment_51_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): But as far as I understood her, she's mostly against child pornography.I mean, I wouldn't like to argue about that either, because it's just .. shit (notice that I'm not writing sh*t, as I'm kind of upset because I now seem to need to argue with you (@nekololi)). [...]\n\nif she's against child pornography perhaps she should make better use of the language she uses to make this clear. if i walked around making statements such as \"I'm sick of seeing dickgirls and traps posted everywhere, so let's kick all the transgendered people off of <platform which is specifically designed to be uncensorable>,\" i shouldn't hope for a very warm response.\n\nbut even then, wishing child pornography to disappear or to wage war against it is a fucking joke. if the people of ZeroNet sincerely hope to wage a holy war to censor any particular type of content or category of users on this network, i wish them the best of luck. they needn't worry about getting me out, i will happily step out on my own volition. i didn't come to ZeroNet because it was a safe space. i took leave of ZN when i first discovered it for several months because people were creating and sharing blacklists of users who they didn't like under the pretense of stamping out \"pedophilia\". it was a sad and pathetic attempt to censor a network that was designed to resist censorship, and if ZeroNet's userbase still holds that mentality then there really is no value in any of the hard work people have put into this network.\n\nbut you're right, she had blacklisted the zite. yet someone somehow visited it on her proxy. and now she has been bested, and she threatens retribution and punitive action against one of the users of her service for it. she has no means of knowing this user was acting with bad faith. 0chan porn didn't only host cp. it was a very popular zite for people from various countries because it had a lot of user contributed pornography, NOT JUST CP. it only stands to reason that if the blacklist was lifted for a short period of time, there exists a high possibility that someone would attempt to visit it. even if the user visited it with the express purpose of viewing child pornography, missesrobot is more than technologically competent enough to circumvent this and prevent it from happening. her threats against her users serve only to warn people away from services such as the one she provides, as there is no telling what an admin will do with the information you provide them with.",
				"added": 1516481826
			},
			{
				"comment_id": 164,
				"body": "> [graph](#comment_5_1ENrYUYUHj6DcykKxnJmTJTppdQEwMPgSM): Can't the site owner simply create a whitelist of users? Or manually approve users? [...]\n\nno, zeronet should not be censored by default...\n\nand as others continue to remind me, probably half of all zeronet users ARE criminals, as usage of zeronet is a criminal offense in China and I don't know what other countries as well. in that sense, being \"full of criminals\" is something to be proud of.",
				"added": 1518036778
			},
			{
				"comment_id": 168,
				"body": "> [styromaniac](#comment_153_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Yep. There's plenty of that on Motherless if I know much about  it, and I've been flashed by a 15 year old when I was 19. [...]\n\nin new york city some corrupt cops had been waiting in public restrooms for men to take a leak at the urinal and then cuffed them when they dabbed too hard, called it \"public masturbation\". that type of charge would put you on the offender's registry. not all of the men fought it before it was discovered what was happening.",
				"added": 1518052562
			},
			{
				"comment_id": 169,
				"body": "> [graph](#comment_6_1ENrYUYUHj6DcykKxnJmTJTppdQEwMPgSM): yes, it should be. Otherwise ZeroNet is not something I could recommend to use for the broad public and will never scale to any meaningful alternative to the server-client internet. Child pornography has to be suppressed as much as possible even in a \"censorship resistant\"  network as ZeroNet.   [...]\n\none of the core ideas behind zeronet is that it creates an environment where things can't easily be censored. making zeronet a censored network is a huge slap in the face and disrespectful to the hard work that is being put into its development. zeronet should no sooner censor child pornography than it should censor chinese activists or american right wing political speech.\n\nyes, people should have the tools to self moderate, they should have the capability to audit what they currently have downloaded and what they are helping seed, and the ability to remove that data from their system. participants in a greater zeronet community should aspire to keep their services safe for their fellow users to make use of. official services should certainly be kept orderly.\n\nimplementing a network-wide system for broad censorship of categories of unwanted content is absolutely unacceptable. it would be far more harmful to the image of ZeroNet you are so worried about than a couple of people swapping child pornographic videos. what little value this network has to offer is diminished greatly after you establish a censorship committee which dictates to everyone else's ZN install what it is and is not allowed to be downloaded.",
				"added": 1518126404
			},
			{
				"comment_id": 170,
				"body": "> [flappyearz](#comment_133_1QEfmMwKVxgR4rkREbdJYjgUmF3Zy8pwHt): Well apart from the mentioned specifics I completely agree with one point: inform people when a zite contains questionable material, and let people decide for themselves whether they want to share it or not. Censorship is not equal to my right to decide what I share (and help to distribute) and what not. I definitely do not want to help spreading child porn, terrorism, racism and a lot of topics I disagree with. It doesn't mean that I censor those, I just stay away, and do the same with all my resources.It is okay if child porn or terrorist zites die out due to lack of connections. It's no censorship, it's lack of support.\n\nif certain political ideologies were as illegal as child pornography is, it would be sad to see entire ways of thinking become scarce, difficult to connect to, or even go extinct, even if humanity as a whole can agree that they are bad.\n\ni find it unfortunate that, by design, zeronet pushes us to make decisions on whether or not we wish to support certain ideas or types of content. i think this will only serve to make popular content more popular, and unpopular content dificult to reach. and i find it unfortunate that some things might become de-facto censored by the network at large due to the fact it is not popular.\n\ni wonder if we should all make efforts to separate in our heads things we /don't like/ and things which are /problematic for us to seed/. we all have to work with finite resources (storage space, bandwith) of course, but if it doesn't cost us anything to seed a racial hatred forum or political ideas to which we oppose, maybe we shouldn't delete them purely out of disapproval?\n\nconfronting upsetting ideas, not silencing them, is the proper way to combat them after all.",
				"added": 1518391551
			}
		],
		"1516541399_1FFFPdGUQvWPFf4cxmqrGwdKgra3Eu4UhM": [
			{
				"comment_id": 147,
				"body": "nofish harvests your ip before giving you an ID to post with. access to clearnet is also required to post on ZeroBoard last i checked. but when i brought these points up over a year ago nobody seemed terribly bothered by it. i assume there are reasons for both of these things but it is a mystery to me.",
				"added": 1516558342
			},
			{
				"comment_id": 149,
				"body": "> [strange](#comment_4_1FFFPdGUQvWPFf4cxmqrGwdKgra3Eu4UhM): I'm not surprised that I'm not the only one worried about this concern. I understand that spam is unwanted but this dependence on clearnet is a risk maybe after he harvests our ip, he delete the log? But as long as there aren't official statements, these are only suppositions and hopes..\n\ni assume that ZeroBoard requires clearnet because it perhaps was just an early early demo before registering a ZeroID was a thing, but if that's the case it shouldn't be included in the default list of zites, or it should be updated to require an ID to post on instead of relying on some clearnet thing.\n\nthat doesn't really explain why he wants clearnet for an ID. if it's to combat spam, it's not hard to generate a bunch of IDs on his service using tor. if he blocks tor, then he's effectively giving the middle finger to the Chinese. also apparently you can register using bitmessage, and with bitmessage you can generate as many new ids as you like, so i don't think it would reduce the amount of spam IDs that get generated by very much.",
				"added": 1516560590
			}
		],
		"1516559181_18cuVo4ak3NDVwhTCXE5WtUc4q5ZXYYMu1": [
			{
				"comment_id": 148,
				"body": "in the browser's proxy settings you will want to find the box that says \"No Proxy For:\" and add 127.0.0.1 to it.",
				"added": 1516559410
			},
			{
				"comment_id": 150,
				"body": "well do you have a specific error message you can share to help determine the problem? zeronet also requires javascript so if its disabling javascript you have to enable it for localhost (127.0.0.1)\n>its not being recognized yet\nwhat isn't being recognized?",
				"added": 1516560700
			},
			{
				"comment_id": 151,
				"body": "a google search brought a couple previous issues which threw that error but it doesn't really illuminate the problem. perhaps tor browser bundle and zeronet are running two simultaneous instances of tor that are conflicting with each other?",
				"added": 1516565113
			}
		],
		"1516734835_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB": [
			{
				"comment_id": 152,
				"body": "will seed!",
				"added": 1516837705
			}
		],
		"1516844220_1H6sFFHqLmoMVtWrixnaGWs3ChyEYhwCgT": [
			{
				"comment_id": 153,
				"body": "i expect the answer will be no but i'm now curious to know if it can or not.\n\nmaybe wget works after your ZN already has the file, but wget itself may not be able to instigate a file download that has to be started by ZeroNet?",
				"added": 1516847689
			}
		],
		"1516925868_1LUy9iAxeWsj1DP5L8V17Yb2vo87FucjgD": [
			{
				"comment_id": 154,
				"body": "nofish moderates spam on this forum so that it does not turn into a sea of spam. it was once a sea of spam and it was bad. users delete their own posts out of embarrassment and to confuse others. nofish has the power to moderate because he holds the private key to the zite and can manipulate content on it according to his whim. users are capable of modifying their own posts for similar reasons.",
				"added": 1516927390
			},
			{
				"comment_id": 156,
				"body": "> [nothing](#comment_24_1GnKQZXGc51J9spdsMMXxJizM41LXeKEBz): eh all i do is drunk post.. so any tips how to delete my embarrassments :)\n\nthe edit button is hard to find. its just to the left of the text you posted. after you click that, you can delete it by clicking \"delete\" at the bottom.",
				"added": 1516934368
			}
		],
		"1516909698_14fPfJZ6aNTsVoRjGHfprq78VtvBN1vx9F": [
			{
				"comment_id": 155,
				"body": "i have a tendency to lean towards my right side, but if i've been sitting down for a while and then get up i can totter forward and backward too. but i slump more than i lean to begin with.",
				"added": 1516933511
			},
			{
				"comment_id": 157,
				"body": "> [kaffie](#comment_567_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Far right is capitalism, which opposes anarchism.  Fascism and authoritarianism are \"up\" on the political compass. Up=authoritarian, down=libertarian, right=capitalism, left=anti-capitalism. An anarchist would be in the bottom left corner. Authoritarian communists would be in the top left. Fascists would be along the top edge. White nationalists in the top-right. And ancaps in the bottom right.\n\none of you is looking at economic systems and the other is looking at political ideologies, both of which are arranged on a graph in arbitrary directions such as left and right",
				"added": 1517019490
			}
		],
		"1517059976_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 158,
				"body": "i believe it's safe to assume that nofish is the admin for all zites which come preloaded into zeronet (ie you just have to click a button to download and access it). for all other zites, you are correct that often times it is not clear who the admin is or how to contact them.",
				"added": 1517089460
			}
		],
		"1517105282_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 159,
				"body": "if someone puts my face in porn people won't believe i'm really a virgin",
				"added": 1517105791
			}
		],
		"1517164199_1HsgZpHaZ5BRUK5qr2YMWnubgKyNuSqokH": [
			{
				"comment_id": 160,
				"body": "while it won't fix all your problems, a consistent sleep schedule is beneficial to anyone's mental well being. sleeping pills are a tool which can be used to correct or maintain a sleep schedule, although they are not necessarily the best tool for the job.\n\nif you want to achieve and maintain mental wellness, sleep is a good place to start. but you should also take note of your diet and physical exercise.\n\nnone of these things will benefit you unless you want to make changes for yourself. they also won't make everything in your life right. difficult things in life won't suddenly become easy. but allowing yourself to have a better quality of life will strengthen your mind and make it easier for you to pursue the things you enjoy.\n\ni am saying these things as someone who has struggled with suicidal depression and feelings of having no place in life for most of the years i have been alive, but have been finding it more difficult to slip back into those feelings by making positive changes to my lifestyle.",
				"added": 1517180850
			}
		],
		"1517556000_1KNSf9nhRFUc52aeX947CRwWTUGPPnZdyQ": [
			{
				"comment_id": 161,
				"body": "maybe it would work well as a cleanup tool the user initiates. then it provides a list of all the zites it thinks can be deleted and the user checks the ones he doesn't want, or checks the ones he wants to keep.\n\nor else we just need better UI in ZeroHello to delete sites, since right now it takes 3 clicks and a several seconds of waiting for the deletion dialogue to finish its animation just to delete one site. this is very cumbersome when you want to clean up shop.",
				"added": 1517591069
			}
		],
		"1517601475_1BrWfc2d3PZKCUr6mg3brj9GvqVJpsRVw5": [
			{
				"comment_id": 162,
				"body": "> [samp](#comment_18_1BrWfc2d3PZKCUr6mg3brj9GvqVJpsRVw5): Update: I generated a key but now I can't claim the zite. \"Drag the 0 button to the left and use the sidebar to sign your site,\" the guide says, but when I do, nothing happens. The button moves, but no sidebar appears. What am I doing wrong?\n\nthe sidebar is garbage and doesn't work right for unknown reasons sometimes. try refreshing the page and doing it again.\n\nalso be sure to write down your private key somewhere so you can sign and publish new content.",
				"added": 1517621002
			}
		],
		"1517855479_12ti3FAcNA64pgZaH59YNWBMdvEku4fdPC": [
			{
				"comment_id": 163,
				"body": "what interests one person might put another to sleep. if you don't see something that interests you, consider whether you can make it yourself to fill the deficit.",
				"added": 1517875581
			}
		],
		"1517522636_1BrWfc2d3PZKCUr6mg3brj9GvqVJpsRVw5": [
			{
				"comment_id": 165,
				"body": "> [helium](#comment_128_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): I hope that the \"will be of interest\" part won't become a prerequisite [...]\n\ni think it IS a prerequisite. right now there are lots of discussions surrounding how to unclutter all the zites people have downloaded, where some people want zites you stop visiting after a length of time to automatically be purged. it will become very easy for a zite nobody gives a crap about to die as the desire of users to delete all the \"crap\" they've been seeding rises. in order for those \"uninteresting zites\" to be preserved, it may still require the efforts of archivists and people who refuse to delete zites they've visited.\n\npersonally i delete a lot of \"crap\", but more often than not i'll continue to seed certain zites even though they don't particularly interest me. i'll be more likely to do so the lower the peer count for it is, while high peer count zites I have no interest in are usually the first to go.",
				"added": 1518038656
			}
		],
		"3_19bB74ZaYYdMzMu2FbWgsv9D5TkcM1Utje": [
			{
				"comment_id": 166,
				"body": "i'm afraid i don't know anyone who is familiar with telegram technology or morse code, sorry. most people use phones or email these days to communicate.",
				"added": 1518038752
			}
		],
		"1515489402_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": [
			{
				"comment_id": 167,
				"body": "\"webm\" audio is just ogg vorbis or opus i think. i don't think people should be transcoding their already crappy mp3's they ripped from youtube into other lossy codecs",
				"added": 1518043881
			}
		],
		"1518616574_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": [
			{
				"comment_id": 171,
				"body": "> [styromaniac](#comment_159_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): The general term for what you've described throughout this post is teleiophilia. What you're into is known as MDLG. [...]\n\nis hyperactive sexual arousal common for people who have ptsd? i have a friend who has ptsd and who can get extremely aroused from certain stimuli, so this is interesting to me because i had never heard of it before.",
				"added": 1518644406
			},
			{
				"comment_id": 172,
				"body": "> [styromaniac](#comment_163_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I do believe so. I've had mental health counseling and I brought this up. It was acknowledged and seemingly confirmed to me this is common. Think of it like this: If you have an above average fear of danger, your lizard brain's natural response is to pass on your genes before you die, so assuming you're heterosexual or bisexual and fertile, it makes sense.\n\nthank you. i may look into this or advise him to.",
				"added": 1518646761
			}
		],
		"1518964184_1D7mzbt2Bwx2t6Gx3EHSmyrEBaMW1o7ZNp": [
			{
				"comment_id": 173,
				"body": "i have had the pleasure of talking to two different necrophiles over the net. i think we got on well. it was very interesting, and i hope they are both doing well. i feel  sadness for how both struggled with the improbability of ever experiencing romance or intimacy with the partner they would desire. but it is a sadness i am familiar with in my own life.\n\ni am always curious to learn more about obscure or taboo paraphilias, however there is usually very little knowledge available.",
				"added": 1518989553
			},
			{
				"comment_id": 178,
				"body": "i dont think anyone will attempt to dispute that having sexual relations with a cadaver isn't hygenic or safe, guys.",
				"added": 1519257205
			}
		],
		"1519037513_1Q8fHVZgauAAHhkQNxKX68eB5HfP1iTFqZ": [
			{
				"comment_id": 174,
				"body": "i think it's wrong to put children in a position where, upon discovery of them having sexual behavior with an adult, they can be stripped from someone they have a deep emotional bond with, made to believe they were the victim of a horrible crime, and be treated differently or like less of a person by other adults in their life, then subjected to countless hours of counseling which might further distress them. i think putting a child in that position where that can easily happen is irresponsible and unethical in the social climate that exists surrounding the topic of children and sexual behavior.",
				"added": 1519078229
			}
		],
		"1519142918_18A7MxMQS5WnxRnQR6CtytEzjZ4UsGRpbm": [
			{
				"comment_id": 175,
				"body": "this service already exists, it's called zeronet.py. big files might benefit from having dedicated seeders though.",
				"added": 1519167797
			},
			{
				"comment_id": 176,
				"body": "> [halex](#comment_22_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq): Are you talking about the console version of the ZN daemon? However, I think the initial question was related to a hosting service that supports ZN connection.\n\nthe question appears to me about a service that helps seed zeronet zites, such as [New ZeroNet Sites](/1LtvsjbtQ2tY7SCtCZzC4KhErqEK3bXD4n/).",
				"added": 1519168229
			},
			{
				"comment_id": 177,
				"body": "> [halex](#comment_23_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq): I do not agree. oracius ask for a hosting service. like OVH or DigitalOcean but supporting ZN.\n\nthe problem with that is, once your zite is out there and reachable, there's no reason to continue paying for the service, as it is being hosted on the zeronet installation of everyone who has visited it and continues seeding it. this service would only be useful to individuals who are not able to run zeronet at all.",
				"added": 1519168599
			},
			{
				"comment_id": 179,
				"body": "> [helium](#comment_245_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): May be I'm mistaken, but it seems to me that the question here reduces to the question: how to bootstrap a P2P network? [...]\n\nif the service is for bootstrapping, that would definitely be useful. bootstrapping can be very hard. especially if you are working in tor-only mode (or i2p only mode, if people are currently doing that), it's hard to reach other people. however, this service may not prove very profitable because once a zite is bootstrapped there is no longer need for the service. it would be a \"pay once\" kind of business.\n\nbut there may very well be profit in a service which seeds big zites or big files. in fact i think one of the youtube clones was offering such a service, where in exchange for btc your video will receive dedicated hosting for a certain length of time. large files will always benefit from having well connected, high bandwith, dedicated seeds.",
				"added": 1519336094
			}
		],
		"1519420799_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": [
			{
				"comment_id": 180,
				"body": "if i remember right, all i did was make a clone of either [SayoGalleryHub](/galleries.sorasumi.bit/) or [Binchan's GalleryHub](/1D2C23aAoHeoJsvPjZZxS9bt3i93uRVfUP/).\n\ni think i then just had to manually delete their galleries, and changed the title of the zite.\n\nthen i visited my cloned zite and used the straightforward UI to upload a new gallery. after you sign content.json and publish the new changes, folks who have visited your zite should see your galleries appear in 0gallery.bit",
				"added": 1519422877
			},
			{
				"comment_id": 181,
				"body": "i do seem to be getting that internal error message also. i'm not sure what would be causing it though...",
				"added": 1519508644
			}
		],
		"1519627333_1HUb4fXgKGxj4h1nLAKYzgSBHeQpDD5bFS": [
			{
				"comment_id": 182,
				"body": "if you're going to blame anyone, blame the democratic party, and blame the two-party political system that the nation's citizens inflict on themselves.",
				"added": 1519681926
			}
		],
		"1519632694_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": [
			{
				"comment_id": 183,
				"body": "> [flappyearz](#comment_186_1QEfmMwKVxgR4rkREbdJYjgUmF3Zy8pwHt): When you go to the starting page (ZeroHello) you should see a USER:<some characters> in the upper right corner. Click on it, and select Show your masterseed. That'll be it. It is the same which was displayed when a new hash was created for you and ZeroNet told you to remember that string. :-)\n\ni've never seen this before. is it a mobile thing?",
				"added": 1519683194
			}
		],
		"1519690191_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": [
			{
				"comment_id": 184,
				"body": "the only person who can remove posts or content is the person who holds the private key for signing a site. on zerotalk, it would be nofish. on zerome, it is not nofish (the person who runs Me.ZeroNetwork.bit), but rather the individual who runs the hub that the person published the content to (ZeroMe pulls the things we post from these hub sites, but does not itself host the data we post). so on ZeroMe, the person who wields the power to ban, remove, modify, or otherwise censor content is the operators of the various ZeroMe hub sites we all made accounts on.",
				"added": 1519690449
			},
			{
				"comment_id": 185,
				"body": "so if your hope is to avoid child porn or fake news, my only suggestion is to not be trolled by fake news and to not participate in unmoderated zites or hubs (which is not very useful advice because few zites tell you who operates them, or if they are actively moderated)",
				"added": 1519691085
			},
			{
				"comment_id": 186,
				"body": "> [wr23ttgrgergnbvg](#comment_1_1F1ucX4cPFMbafzcBipikdP6bWRFg7Da3D): You can click and drag the button in the top right and scroll down to 'delete' while you're on the page, it'll give you the option to blacklist the site so you don't accidentally stumble on it again. Alternatively, press the three dot menu next to the zite on the home screen of zeronet, press delete, and then blacklist.\n\nit occurred to me recently that there's no way in the UI to blacklist a site without visiting it first. it's probably not a problem since it's easy enough to simply never visit a site. still, i also don't think there's a way to UN-blacklist a zite until you attempt to go to it. neither of these are probably issues for most use-cases though.",
				"added": 1519694670
			}
		],
		"1519718894_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 187,
				"body": "idk about the recruiting thing, but for a while on 4chan's /b/ there was a nonstop stream of people making threads trying to give mental health advice or otherwise creating an environment of support for people who were depressed or needed advice, and you could go into these threads and receive genuinely supportive words from well intentioned people. i don't know if that is still going on but these threads were really popular several months ago.",
				"added": 1519768235
			}
		],
		"1519804000_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": [
			{
				"comment_id": 188,
				"body": "i have a weird tendency to click all of the blurry boxes i see because it annoys me that i don't know what it is. so i will do my best to help you download zerome images.",
				"added": 1519854158
			},
			{
				"comment_id": 189,
				"body": "> [test20180221](#comment_54_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd): Oh, what exactly is its purpose???? (distribute this user's images)\n\nthis automatically starts downloading all existing images posted by the user, and will cause all future images posted by the user to automatically attempt to download. this is done with the purpose of enabling you to seed those images to others who try to download them.",
				"added": 1519873417
			}
		],
		"1520188230_1Lh89nAb4YeizEER15JUcpscy37mZwDUer": [
			{
				"comment_id": 190,
				"body": "i'm pretty sure my only purpose is to shitpost and spread kawaii propaganda and i don't think i've been doing much of either lately",
				"added": 1520214298
			}
		],
		"1520552032_1KG6UMLtakzi7eDDkqCb27nYxa1VGMDcsP": [
			{
				"comment_id": 191,
				"body": "i think i saved a couple peoples lives. one of them has absolutely saved some people's lives and has greatly improved the lives of others through his nonprofit work. one shows promise of accomplishing great feats in his future.\n\nso i guess i indirectly made the world slightly better, even if only two people in the world know that. i doubt anyone would know or remember that when i'm dead, but i don't really care what people think of me when i die. i just assume i'll be villainized no matter what. my legacy can be \"that disgusting weirdo who used to live over there\" or whatever.",
				"added": 1520568172
			}
		],
		"1523133465_195oGGXB8AhwWSoXFHpbVT4TL4wLi1Af5e": [
			{
				"comment_id": 192,
				"body": "anyone can create and manage a hub which other users may join. it possibly makes sense to have people make hubs that are geared toward certain groups of people. but at the end of the day you can't force someone to migrate to a different hub or shoehorn them into the hub you want them to join.\n\nchinese users may not have any particular need or desire to create a \"chinese\" hub. most people join one of the dozens of generic hubs that are open to join. and it is in their benefit to do so, because their posts will be quickly seeded and viewed by zerome users, since \"green\" hub has thousands of peers, while \"new hub for chinese users only\" only has, let's say, 20.",
				"added": 1523136024
			}
		],
		"1523787478_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 193,
				"body": "if someone is deliberately being abraisive and assholish, as is the case 101% of the time on the internet, i usually just tune them out and i stop taking them seriously at all. of course i am frequently guilty of doing this also. but in the -1% of the time where someone is doing their best to intelligently make their argument understood, even if they're being a little aggressive, i will read and consider what they have to say.\n\nonce i notice someone using newspeak (either the SJW kind or the chan-tard variety), once again i immediately disregard any opinion they hold and go do something else with my free time.",
				"added": 1523797654
			}
		],
		"1523804682_1FkxDSUsa4ex8zTQcrmdtm7oaGCUNjBh9F": [
			{
				"comment_id": 194,
				"body": "michael jackson is still alive, i saw him in a cafe once in la, this was just last year",
				"added": 1523822581
			}
		],
		"1524090493_1A38V1SUbZeW7nLwZjBtXj2suQJuh3L1Sk": [
			{
				"comment_id": 195,
				"body": "> [yt76rfbuefusrygt](#comment_1_13U2aWEL7Weu6F83m8Kw2CsMzXGG3MBz1m): Go back to tor, looser!\n\nwhat if he's already accessing zeronet through tor like many of us?",
				"added": 1524344481
			}
		],
		"1526071727_14RJhs7d84srMhP3Su4ErpZ5NfpXPRV3Ac": [
			{
				"comment_id": 196,
				"body": "fear of being a pedophile, or fear of being believed by others to be a pedophile, is incredibly common among people undergoing psychosis. this is because there is nothing in the world more terrifying to be.",
				"added": 1526081187
			}
		],
		"1526051818_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB": [
			{
				"comment_id": 197,
				"body": "cp is bad for your brain",
				"added": 1526081715
			},
			{
				"comment_id": 198,
				"body": "> [aerin](#comment_4_13hESj7CAmdzzVZKFiTnB5LuWBjJP93RdD): What about lolip\n\nloli is the only thing good in this world",
				"added": 1526161023
			}
		],
		"1526512288_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 199,
				"body": "sexual frustration is just what some people get to live their whole lives with i think",
				"added": 1526513381
			}
		],
		"1526764711_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 200,
				"body": "im pretty sure you just unzip the folder and double click the launcher. i dont think it ever installs onto the system.",
				"added": 1526768752
			},
			{
				"comment_id": 201,
				"body": "i guess i haven't encountered a non-bundled version. i dont think i needed to install anything using pip on linux either, but its possible i already had them installed i suppose...",
				"added": 1526769086
			}
		],
		"1527230895_1Kma1Pz9kBSHmDtK1iYtHTox14Edmx2e5f": [
			{
				"comment_id": 202,
				"body": "insensitive and ignorant people like to say things like \"seek treatment\" but there is no treatment available. honestly though pedophiles should just kill themselves. this world isn't good enough to accommodate them.",
				"added": 1527281056
			}
		],
		"1527247257_1LACNkKD9QUoF28kSzmcv2hojVmTs2qTwZ": [
			{
				"comment_id": 203,
				"body": "> [styromaniac](#comment_30_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You should tell people what your site is made for so they know what they're clicking.\n\nhe should, but he could just as easily lie to reel people in",
				"added": 1527282325
			}
		],
		"1527342685_18pEdew7szNF9fVwkqr4oJWj3abJ3Ttt92": [
			{
				"comment_id": 204,
				"body": "a suitor would need to win my heart first",
				"added": 1527382386
			}
		],
		"1528353432_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 205,
				"body": "~~fuck off. there is no cure and i dont want a cure. unless its in the shape of a bullet.~~\nstatements like yours piss me off but perhaps it might be helpful to express my anger more eloquently.\n\nnobody wants to go to a therapist, or go to some internet forum anonymously, and be treated like a fucking social disease that needs to be cured for the good of your fellow man. first and foremost they want to be treated like a fucking human being with problems and needs and hopes and dreams of their own. not like a virus that needs to be vaccinated to protect others around them.\nyou want pedos to \"get help\" because you fear they are a pox on the world. a pedo wants to \"get help\" because they have personal mental health needs and issues which they would like to address. you don't want to help them address these issues. you want to strap them in a chair and perform unsuccessful electro shock therapy like what they did to the gays, because you think one day children will no longer be sexually abused.\n\ni am also seconding the remark about your naivety and ignorance of human sexuality. your ignorance and inability to understand the issues that pedophiles face will only reinforce the walls that block you from attempting to \"help\" them in any way. and again, i seriously question what kind of \"help\" you wish to provide.",
				"added": 1528405245
			}
		],
		"1528403696_1DbNJYiNELNpS2BbYMXa3mkRz8jrSbm9hc": [
			{
				"comment_id": 206,
				"body": "zeronet isn't bitorrent. but javascript is definitely sketchy as fuck.",
				"added": 1528405682
			}
		],
		"1528345024_1rFttYwcvZTeYwTHDHC5iy5PsfwHhaHCi": [
			{
				"comment_id": 207,
				"body": "in theory, sites that aggregate and publish links to other zeronet sites can be moderated without imposing nanny filters on people. its just that in practice they aren't, even the one that i think nofish created has 2 or 3 cp sites published on it. but even those are clearly labelled so only an idiot would click on them and be upset when they discover something they didn't like. if zite operaters bothered to look at what other people publish on their site, they would probably remove links to things they didn't want to help propogate. zeronet has a longstanding tradition of zite operators not caring, though. if they did, they would leave contact info so abuse could be reported.",
				"added": 1528409691
			},
			{
				"comment_id": 208,
				"body": "> [styromaniac](#comment_81_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): [...]\nyour first mistake was trusting nekololi and now you wonder how you got into this mess",
				"added": 1528410394
			}
		],
		"1528417207_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 209,
				"body": "what if you're human refuse though",
				"added": 1528420562
			},
			{
				"comment_id": 210,
				"body": "> [styromaniac](#comment_88_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): That you are not, and you're capable of discovering things as I have.❤️\n\nnot everyone is capable of doing meaningful things",
				"added": 1528511380
			}
		],
		"1529060591_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 211,
				"body": "i dont know why the term incel was created or what its intended meaning is but there are some people who cannot ever have a romantic relationship with another person",
				"added": 1529102660
			}
		],
		"1529063296_1G6QESmeipZsukJX5WvDxxwSioaGnEDRk3": [
			{
				"comment_id": 212,
				"body": "so you're basically creating a website with good SEO (lands on page 1 of a search) that a person is likely to click on when he is googling your name? it would probably work.",
				"added": 1529102830
			}
		],
		"1529288071_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 213,
				"body": "you want to tell me all about cute anime girls",
				"added": 1529294843
			}
		],
		"1529637146_19WNFdpPisCYoN4ocopSa3bEzbe9gWK7pv": [
			{
				"comment_id": 214,
				"body": "why not just hack your own site?",
				"added": 1529703385
			}
		],
		"1529798315_13HLKpt1AXNsMfqf5tP7yTVi6DfibTsLHq": [
			{
				"comment_id": 215,
				"body": "i too have a micro nation and its so functional and utopic that people like me are not allowed in",
				"added": 1529799098
			}
		],
		"1529954399_1LWaziVvsq9YUFoaoQgg4YjPReVTMTwCUc": [
			{
				"comment_id": 216,
				"body": "ladyavi might, idk",
				"added": 1529967737
			}
		],
		"1530191313_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 217,
				"body": "maybe people who are afraid of stumbling into pornographic content should be wary of accessing unknown areas of the internet altogether. i encourage everyone to go ahead and block every zite on zeronet that fails to explicitely warn the user on their landing page whether or not they host nsfw content and count on one hand how many zites are left. no one will do this for you because it is asinine.\n\ni do feel there are numerous benefits for the video sharing sites to split off a porn-focused version of their site and cull the pornographic content from the main site. that is up for the zite's operator to decide if it's something they're interested in. however for the average site, if you are demanding them to put up warning screens and toggles and filters, you're just going to wind up with a lot of sites on your block list.",
				"added": 1530219249
			},
			{
				"comment_id": 218,
				"body": "> [styromaniac](#comment_171_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I don't mind porn. Nobody should be concerned about me. If you want more visitors, however, it may be worth it. I'll be a visitor either way.\n\nwho should i be concerned about, hypothetically speaking? who are you raising this issue on behalf of?",
				"added": 1530219744
			},
			{
				"comment_id": 219,
				"body": "> [styromaniac](#comment_172_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Dat peer count. Dat additional aggregated bandwidth. [...]\n\ni agree that there are situations where it can be beneficial to the zite owner. such as the video hosting sites, or the file hosting sites. when its relatively easy for people with their dick in their hand to find porn on your site by filtering for pornographic content, the site will definitely see an increase in peers. i just am not convinced the same is true for the opposite (i don't believe a site will recieve a higher peer count if people who don't wish to view porn can filter porn away easily)\n\nin fact, if attaining a high peer count is your end goal, i believe the best course of action is to have easily accessible pornography on your site. porn sites seem to have a tendency to have much higher peer counts. maybe zeromedium and zerolstn should start putting scantily clad babes on the front page",
				"added": 1530220735
			}
		],
		"1530175852_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 220,
				"body": "is there a way to do this in real life",
				"added": 1530235310
			}
		],
		"1530451214_12rREqqdMUPsAPuMR1p87Zj8TS4YocoUCX": [
			{
				"comment_id": 221,
				"body": "i didn't know having a mineral deficiency was a sin. i will have to confer with my rabbi about this, and about if i should start taking flintstones vitamins to keep myself out of hell.",
				"added": 1530481255
			},
			{
				"comment_id": 275,
				"body": "> [achylles](#comment_5_13vv2eRHS2KMArxEo1rKh4xQGogjJNhKr4): The Bible goes beyond mental illness. It states that homosexuality is related to sin and sin is related to demonic phenomena --> a very complex subject --> https://en.wikipedia.org/wiki/Christian_demonology   see also the links in this page --> \"... Ambrogio de Vignati, disagreeing with other authors, asserted that demons, besides of not to have a material body could not create it, and all what they seemed to do was a mere hallucination provoked by them in the mind of those who had made a diabolical pact or were \"victims\" of a succubus or incubus, including the sexual act...\"\n\nnice! this corroborates my theory that gay guys all have angry demons living inside their buttholes.",
				"added": 1539302918
			},
			{
				"comment_id": 276,
				"body": "> [achylles](#comment_7_13vv2eRHS2KMArxEo1rKh4xQGogjJNhKr4): Are you being ironic about my comment or you are serious about reading and researching other points-of-views?\n\nim being ironic about your comment.",
				"added": 1539305063
			},
			{
				"comment_id": 277,
				"body": "> [achylles](#comment_8_13vv2eRHS2KMArxEo1rKh4xQGogjJNhKr4): Why?\n\nbecause i think it's important to openly ridicule insane beliefs and ideologies. but it wasn't a personal attack against you, you were simply stating other people's interpretations of parts of the bible.\n\nalso i don't think demonic possession is much more ridiculous than op's notion that homosexual behavior is caused by a mineral deficiency. anyway i haven't been getting enough iron in my diet so im going to go to the club and start sucking dick.",
				"added": 1539309852
			},
			{
				"comment_id": 278,
				"body": "> [achylles](#comment_10_13vv2eRHS2KMArxEo1rKh4xQGogjJNhKr4): What makes you to think that your thought about reality are any better than those of those \"insane\" beliefs and ideologies. Why do you categorize your view as not being insane as well?\n\nidk, butt demons just seem pretty outrageous to me. i don't think demonology has any place in a discussion about human sexuality, biology, or psychology, or any other scientific or medical quandaries. i'll ask my christian friend tomorrow about gay demon possession and succubi though maybe he'll back you up. more likely though he will want to know if i have taken up drinking.\n\nin the meantime we should both ensure we get an appropriate amount of zinc in our diets to ensure normal cognitive functioning.",
				"added": 1539310822
			},
			{
				"comment_id": 279,
				"body": "> [achylles](#comment_11_13vv2eRHS2KMArxEo1rKh4xQGogjJNhKr4): \n\nbased on your suggestion i shall go out and visit a witch coven on this very night. i will ask the witches their understanding about gay butt demon possession. if i learn anything more i will report back to this thread tomorrow.",
				"added": 1539311942
			},
			{
				"comment_id": 280,
				"body": "i am excited to meet a witch for the first time. why didn't i do this sooner? maybe they will teach me witchery...",
				"added": 1539312378
			},
			{
				"comment_id": 319,
				"body": "> [therealalexjones](#comment_3_1AzaM6fUDjm5a2W69HZCd7hRgCyprdxxhc): And they was wiped off the earth very fucking quickly.\n\ni'm pretty certain there are greeks still alive to this day. this is only a rumor though.",
				"added": 1543767680
			}
		],
		"1530559794_1NEAivkF2GyHcnRQfJjahZD5XyWfJv1a1W": [
			{
				"comment_id": 222,
				"body": "if you do it through tor only mode, where your port is supposed to be closed, i believe it very very slowly propogates to other tor users, and from there very very slowly propogates to non-tor users via people who run zeronet through clearnet + tor mode.\n\nif you're absolutely unable to open a port in clearnet mode, and wish to publish lots of content, you might consider trying it in tor-only mode and see if it works better for you.",
				"added": 1530571968
			}
		],
		"1530616286_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 223,
				"body": "i find that the hub model is heavily underutilized despite all the benefits it provides. i can see heavy uploaders setting up their own hub if its easy enough. and for people who just want to upload one or two videos, there could be \"public hubs\" that anyone can upload to.\n\nthe key to this is ensuring setting up a hub is piss easy, so that the guy who wants to upload every episode of game of thrones has as little to click on and set up as possible, and all he has to do is set the name of his hub, click sign and publish, and start uploading.\n\nthe millchan dev noted once that hub sites are not very well documented. perhaps more zite developers would be inclined to structure their services this way if they had better documentation available to them.",
				"added": 1530653224
			}
		],
		"1530800079_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 224,
				"body": "i do know that if you follow a link to a user profile that is on a hub you don't have downloaded, you will be asked if you want to download that hub, and after you do so you will see some more users. however, seeing a link to a user's post or profile which exists outside of your hub happens very rarely.\n\nin the future, sites which use hubs will wish to do better educating users on how hubs work, and explain to them that in order to view all this other information out there, they will need to seek out and download these other hubs. even better would be to have a database of known hubs and allow the user right then and there to download them without having to hunt anything down. i believe zerolstn does this with its \"genre index\" hub, which shows the user various hubs available to download.\n\ni dont really have any insight about this bug that might exist, unfortunately.",
				"added": 1530822781
			}
		],
		"1531170974_1CJUF6AFYnXkxGaLCTBo9iSMKxK7wkvoYD": [
			{
				"comment_id": 225,
				"body": "aw fuck not again, i hate it when the jews do a thing and then i have to read about it on the internet. it just makes me want to cry",
				"added": 1531182254
			}
		],
		"1531350181_14MRwDejvCNbwyjc29fLvRGL7JVjnafjMy": [
			{
				"comment_id": 226,
				"body": "> [pineapples](#comment_8_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T): i hope one day its your children on those sites\n\nthat's a pretty horrible thing to wish onto a child\n\n> [nicwow](#comment_4_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa): I hate posts like these. It would be great if us as a community could report them. If someone's children go on ZeroNet and suddenly see inappropriate content the parents would not be happy. Some option like \"censor inappropriate content\" is necessary. Not necessarily removing them but removing them from those who don't want this. Preferably set to this by default.\n\nif a child or their guardian doesn't enable this censor/filter option they will still see the horrible mean offensive things\n\nalso nothing should be hidden by default by the zeronet client. if a site owner (in this case, nofish), doesn't want to see posts like this on his own service, he has every right in the world to snuff it out. and since this site is under his authoritarian domain, he could implement a means to hide posts he doesn't like by default, which a user could optionally turn off so they can see the posts. but for the zeronet client to by default hide certain things, that is fucking garbage.\n\nwhat if you went to the library and certain tomes were hidden \"by default\"? you wouldn't know they were there until you specifically asked the librarian if they had a copy of it. that isn't how networks like this should operate.",
				"added": 1532280361
			},
			{
				"comment_id": 228,
				"body": "> [pineapples](#comment_11_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T): i think we need some sort of tagging system so that people can filter out tags they dont want to see.  this should be implemented on the site level as well as on posts on blogs.  of course this isnt a complete solution because a site owner doesnt have to use the tags but its a step in the right direction.\n\nsites already get \"tagged\" when they get listed in places such as ZeroSites, Important Zites, or a wiki. i dont we have very many sites out there that aren't obvious or explicit about what kind of site they are.\n\ni also just don't understand the type of person who would download a piece of software that lets anyone host anything for free and can't be censored, and become upset when they stumble into something that's offensive.",
				"added": 1532385045
			}
		],
		"1532143906_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa": [
			{
				"comment_id": 227,
				"body": "rather than forcing someone to redirect, you could kindly inform them that if they'd like to visit the ZeroNet mirror of the site they can reach it at <address here>. you can just have a banner or disclaimer on the site somewhere for ZN users and non ZN users alike that your site can be reached via ZN.",
				"added": 1532287006
			}
		],
		"1532111686_1FFMmVeZe5E8yhkPxtn3ndZhrW8J8Vbq1F": [
			{
				"comment_id": 229,
				"body": "i generally agree with a lot of the ideas expressed in the document. however, the author's decision to express his opinion of transgender athletes was a little detrimental to the message he is wanting to send. it would have been sufficient to explain the harms of silencing opinions which oppose that idea of these athletes, rather than belittling the absurdity of the idea. ironically the paragraph right after that urges the reader to keep reading. i expect a number of people stopped reading before this call to action and disregarded the rest of the document as bullshit.",
				"added": 1532572751
			}
		],
		"1532576972_1KYxFf5WUYg9rhqRaZjrbXQ6Q6K3aweWBk": [
			{
				"comment_id": 230,
				"body": "the loli doujin i uploaded a little bit ago",
				"added": 1532577538
			}
		],
		"1532889245_1NBvhfRTw3aBnasNwmSJ4YBWeRhnxAuiSy": [
			{
				"comment_id": 231,
				"body": "i2p bote quite possibly provides the most security and anonymity. an adversary would have an incredibly difficult time determining when you have sent or received a message, much less who you are sending/receiving messages to/from. if you send a message through bote you can be pretty confident that only you and the recipient know about it. bote is great for email-like communications, but the latency is incredibly high (i think it can take an hour or longer for a message to be delivered) and if you add an attachment that's more than a few kilobytes your message might never be successfully delivered.\n\nretroshare is neat and useful for filesharing, but it's not anonymous. retroshare is designed to be used by a circle of people who trust each other. friends, family, coworkers, maybe a small internet community. it's not really designed to be used to communicate with strangers over the internet, although now you can run retroshare in tor or i2p-only mode.",
				"added": 1532896556
			},
			{
				"comment_id": 234,
				"body": "> [nicwow](#comment_10_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa): If I understand correctly the latency of i2p bote is because of lack of users to store emails. Similar to if all nodes for a particular ZeroNet site went offline. You could potentially pay a VPS to keep you I2p account running. Unless I misunderstand, which is very possible.\n\ni2p is inherently high latency, and bote has a very high latency as a result. this is by design. the end result is that you can't send a bote mail and reasonably expect a reply in under 10 minutes even if the person on the other end is waiting for your message. it isn't like bitmessage where new messages are nearly instant or retroshare where you basically have instant live chat. nor is it like zeromail where you can send an email and get a response in 10 minutes or less assuming the recipient is checking his email.",
				"added": 1532903029
			}
		],
		"1532847501_15Rn4kLyQf7tKstyyW3W9DV9VtCMNc4X9P": [
			{
				"comment_id": 232,
				"body": "have you tried filling the hole with something? also i hope your test worked.",
				"added": 1532896657
			}
		],
		"1532880375_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 233,
				"body": "i believe you need to sign the site to generate a new content.json file, and then publish to tell all your peers that there is a new content.json and that those 123 files should not be there.\n\nif you try to modify the content.json file directly, rechecking your site will probably just attempt to download the old content.json and it will say content.json update failed along with the other 123 files.",
				"added": 1532898072
			}
		],
		"1532993934_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 235,
				"body": "the Files tab points to files that are locally stored on your computer. the behavior that results from clicking on this link is entirely up to how your OS and browser are configured.",
				"added": 1532995403
			},
			{
				"comment_id": 236,
				"body": "> [styromaniac](#comment_131_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): When I copy the link to Big Buck Bunny from ZH, it looks like this: [...]\n\nwell i guess to replicate this on your zite, you'd just provide a link to the file like that, and depending on how the user's web browser and OS is configured, it will behave in the way it normally would when clicking on a link to a file of that type.",
				"added": 1532999184
			},
			{
				"comment_id": 238,
				"body": "> [styromaniac](#comment_134_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): The link I copied works on ZeroTalk too, so I'm thinking I need to refer to similar JavaScript. 😨\n\ni think you are overthinking it. it's not a javascript thing. just link to the file.",
				"added": 1533001629
			},
			{
				"comment_id": 239,
				"body": "i want to test something [http://127.0.0.1:43110/1KN5zRytGbGqLNdemuoLC6gS44fwM9h38s/data/videos/Big%20Buck%20Bunny.webm](/1KN5zRytGbGqLNdemuoLC6gS44fwM9h38s/data/videos/Big%20Buck%20Bunny.webm)\n\nok i can't really test it without having the full movie downloaded, but i tested on a random video i already had saved from kopykate. if i put a link to the file in the browser, the browser will behave depending on how it is configured. in firefox it plays in a new tab using the codecs that are built in, in chrome it will do the same, in internet explorer it will ask you to save the file or to open it in your OS's default video player.\n\nit behaves the same for me whether i click on the file from ZeroHello or if i just plug the link to the file directly into the browser's address field. if you're not getting consistent behavior i can't really tell you why that is or if javascript is the solution.",
				"added": 1533075080
			},
			{
				"comment_id": 241,
				"body": "> [styromaniac](#comment_144_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I'll either repurpose the site or overwrite it if I don't get pointers, because it's disappointing that it misses out on a useful feature.\n\nyou can't and shouldn't be able to make your website force your user's operating system to open programs on their end using javascript. the very thought of this happening makes my hair stand on end.\n\nthe best you can do is tell the user's web browser to treat your video file as it would any miscellaneous binary file, which will result either in the file being downloaded and launched by the user's default program they use for that filetype, or the browser will save the file to the user's downloads folder, or the browser will attempt to render the video using its built-in codecs on a new tab.\n\nbut the point is its not going to behave the same for every user. you can't just say \"click this link to open the video in vlc!\" because maybe it wont open in vlc, maybe it will open in mpv. maybe it won't open at all, maybe the file will simply silently get saved to their downloads folder. if they're using an experimental web browser that doesn't conform to web standards maybe it will do something totally unexpected and unpredictable! but the experience will not be the same for every user of your site.",
				"added": 1533077210
			},
			{
				"comment_id": 243,
				"body": "> [styromaniac](#comment_146_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Right, but on Android it's different. I don't know why. Perhaps people should be using a virus scanner since files are stored locally anyway. [...]\n\ni have no idea how androids work but javascript on a website should never have the capability to leave the web browser. you're giving me nightmares.\n\nonce a file on zeronet is downloaded you can access it anytime from ZeroHello or make a copy of it elsewhere in your filesystem if you wanted to.",
				"added": 1533078097
			}
		],
		"1532992852_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa": [
			{
				"comment_id": 237,
				"body": "i only have a couple of sites blocked but you can always make your own blacklist site and just add things you dont want to see. otherwise you're just taking someone elses word for it that certain users or sites are bad.",
				"added": 1533000704
			},
			{
				"comment_id": 242,
				"body": "> [crossbones](#comment_1_1HsH7zHuhcQuEMVr25wZdWKvfMSSum2QfV): i've attempted to use some of the blocklists and they dont appear to do anything for me. can anyone tell me what im doing wrong?\n\nare you attempting to access a site that's on the block list?",
				"added": 1533077464
			}
		],
		"1533074344_1NpBDnpSGkXGKLtq9x75Lb846dfgLCWNtn": [
			{
				"comment_id": 240,
				"body": "kind of like this? [ZeroLSTN](/ZeroLSTN.bit)",
				"added": 1533076176
			}
		],
		"1533120187_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": [
			{
				"comment_id": 244,
				"body": "nice bitcoin address btw",
				"added": 1533134827
			},
			{
				"comment_id": 245,
				"body": "> [pexo](#comment_1_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): Thanks, took me around 8 hours of computation to get it(I got lucky though, it was one of the first keypairs I got)\n\nnice i was wondering how long it took you. the eta for a 7 character custom address was 2.5-3 hours (although i got it in under 2 hours)\n\n> [nicwow](#comment_16_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa): I think I might be confused. Is this another file sharing service?\n\nthis is a gallery hub site which hosts an archive of loli doujins. if you're curious what a galleryhub means you can look at [0Gallery.bit](/0gallery.bit/). nothing nsfw is hosted there until you visit a hub site which contains nsfw material.",
				"added": 1533152684
			},
			{
				"comment_id": 246,
				"body": "im scared to flip the switch to help distribute, i'll make sure i have enough room for it all first",
				"added": 1533166920
			},
			{
				"comment_id": 254,
				"body": "> [kaffie](#comment_616_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Any chance there's gonna be a non-loli doujin hub? Also... can anyone contribute to the hubs? or only the person who owns it? 0gallery deserves a lot more attention than it's getting tbh.\n\nim pretty pleased with how well loli is represented right now but if you want to look at ♂♂♂ there's a gallery [here](/comic.z1069.bit/) and if you like furry people there is a gallery [here](/14gbc57vHpEnJvzetSecquyA9iL5m7JBxS/). amusingly, the furry gallery tends to have loli-esque characters as well but most of it doesn't look like that.",
				"added": 1533957293
			}
		],
		"1533341813_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 247,
				"body": "only search engine operators know what their own TOS are. they would probably want to vet the site themselves before they go blocking it just because its on somebody's shit list.",
				"added": 1533343067
			}
		],
		"1533428309_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 248,
				"body": "i think there were tentative plans to increase the proof-of-work required to generate a new identity if spam became an issue",
				"added": 1533428893
			}
		],
		"1533661973_1PpTEVCbkCfEFFtkCsHRV3iHrNQGCzdNPG": [
			{
				"comment_id": 249,
				"body": "man i really hate it when i lose some of my bitcoins. have you checked under your sofa cushions?",
				"added": 1533673201
			}
		],
		"1533843646_1EFHNZxRQ3QB5rhSuKbqVHKo3JMTWdhfFk": [
			{
				"comment_id": 250,
				"body": "the publish function is used to inform your peers of changes to your site. if you don't have any peers, it can't inform them of changes. publish will not get you any new peers.\n\nyour problem isn't that the publish function isn't behaving correctly. the problem is simply that your site doesn't have any peers yet.\n\n-having an open port will help people who are attempting to get to your site reach it and become a peer.\n-if nobody is trying to reach your site, you should consider announcing your site on some of these places in this [zerome post](/Me.ZeroNetwork.bit/?Post/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB/1530919708)",
				"added": 1533846153
			},
			{
				"comment_id": 253,
				"body": "i just noticed in your log that your zeronet is using tor. if you're using tor-only mode you actually want to keep the port closed, and peers connect to you through tor. don't think about ports. if it says closed, you want it to stay closed.\n\nif you're in mixed tor + clearnet mode you want an open port. if i need to open a port on my home internet i would do so in my router's settings.... but this is not something you normally would need to do unless uPnP isn't working.",
				"added": 1533853787
			}
		],
		"1533795431_1As12wFHyZFAw5j8wxKYFaXZbkwLVgvdBg": [
			{
				"comment_id": 251,
				"body": "this really only seems useful for people who want to help seed other people's sites and posts. most zeronet users do not need to run zeronet 24/7 on a dedicated machine.\n\nthis is different from, say, i2p, where it's beneficial to keep the router constantly running to have an improved connection and reachability, or to host a service.\n\nwith zeronet you can launch a popular site, get a good amount of peers, and shut down zeronet for months at a time and people will still be able to see your site and make posts to it. the only time you'd need to run zeronet again is if you want to update something on the site (or if you want to see anything others posted, of course)",
				"added": 1533846905
			}
		],
		"1533701004_1GtwWtJ66M2wm3raW2ZvUByneLefcsscBf": [
			{
				"comment_id": 252,
				"body": "i need an id card proving im a 12 year old girl can a brother hook me up?",
				"added": 1533847058
			}
		],
		"1536836748_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 255,
				"body": "there are already search engines on zeronet. they are distributed, with many peers serving the data and code. they do a pretty good job at gathering links to zites. i think this problem is already solved.\n\ni have never discovered a  useful or interesting zite on a zeronet search engine before. but thats because i would have already learned of a useful or interesting zite from another source, such as a curated or user-contributed list, or a link on zerome, or on this very forum.\n\n> [futuretoast](#comment_3_1JxKVavsxaaEHX6ScAT7mwEYVxHRrmdXW1): I would never have found Linux without a search engine because I'd need a site talking about linux and without being able to search info on it I'd still think Linux was a single OS and never have even heard Ubuntu outside of it being used as whatever the African phrase was. Simple reality is a search engine is going to be needed when ZeroNet gets bigger simply because the amount of information is going to grow to big to navigate without one.\n\nif google did not exist, and we still lived in an era where people maintained curated lists of websites they thought were useful or interesting,  you would likely have discovered linux that way. in fact, you likely would have discovered linux sooner this way than you would from a search engine. in fact, im curious how a search engine caused you to learn about linux. what did you search to find it?\n\nif your end goal is to discover new and interesting zites, i have one question: how do you use a search engine to look for something if you don't know that it exists?",
				"added": 1536842745
			}
		],
		"1537592624_1CthCNo2eADyWkShCTBTVKGHy3WNXcj6Fh": [
			{
				"comment_id": 256,
				"body": "it is a known fact that \"intelligence\" agencies such as the nsa, gdhq, etc infiltrate or encourage or hire outside contractors to infiltrate foss communities. it is not far fetched to believe that the adoption of \"CoC\" and the turmoil being instigated by it is due to manipulations by one of these agencies, who feel they have a vested interest in stymieing collaborative foss or open source development.",
				"added": 1537618936
			}
		],
		"1537822393_1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7": [
			{
				"comment_id": 257,
				"body": "ZeroBoard should either be rebuilt to not use clearnet resources or delisted from ZeroHello's default list of zites, since its usefulness as a showcase for what ZeroNet can do is outdated at this point.",
				"added": 1537824433
			},
			{
				"comment_id": 258,
				"body": "> [thunder33345](#comment_226_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): i agreed it should be replaced with the chat,OR EVEN with the latest peer applications instant chat no delay demowe have come from centralized reliant on an update bot,to dynamic content of saving messages into files,now we have peer applications and without a need to save every message into file but just flushing them into file at an interval, but using peer application to establish REALTIME chat no 5 second delay\n\nthat sounds like a good idea, just redirect it to [ThunderWave](/thunderwave.bit/)",
				"added": 1537825261
			}
		],
		"1536955600_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": [
			{
				"comment_id": 259,
				"body": "this has been true about hyperlinks since hyperlinks were created.... it is not new to zeronet. the applies to web browsing and email and anywhere else someone can send you a hyperlink.",
				"added": 1538094487
			}
		],
		"1538246886_1MHdmQEW2HS6sZNgfi3VmtegHc6fUEyVkW": [
			{
				"comment_id": 260,
				"body": "so far all the bitcoin miners i've seen here are loaded from external 3rd party websites on the regular web (such as from coinhive.com). this is trivial to block using umatrix (which I think everyone should use), or by setting a false proxy on your zeronet browser which blocks any requests outside of 127.0.0.1.\n\nis it possible for someone to implement a bitcoin miner, or other malicious or invasive code, which runs entirely from resources contained within a zeronet site?\n\n> [zeropyro](#comment_22_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV): There are not too many options to monetize to your zites.\n\nthere are also 0 hosting fees for your zite! :)",
				"added": 1538253439
			},
			{
				"comment_id": 261,
				"body": "> [krixano](#comment_568_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Euler finder uses a library file (which likely connects to the clearnet). Windows Defender marks that library file as a trojan.\n\nis that the library file which is fetched from coinhive.com? i don't allow eulerfinder to load anything from that website and have 0% cpu usage.",
				"added": 1538253646
			},
			{
				"comment_id": 262,
				"body": "> [krixano](#comment_569_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): It's a file stored in the directory of EulerFinder. Whether that's downloaded on first load of the zite or not I don't know.\n\ni expect the antivirus client is just seeing  <redacted> inside of index.html and flagging it because it is a link to a known bitcoin miner .js file\n\ninb4 this thread now triggers everyone's AV\nupdate: it did trigger someone's AV",
				"added": 1538254415
			},
			{
				"comment_id": 263,
				"body": "> [krixano](#comment_571_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): I'm pretty sure it was flagging a specific file in the zite's directory, but idk.\n\nprobably index.html",
				"added": 1538254713
			},
			{
				"comment_id": 266,
				"body": "> [krixano](#comment_571_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): I'm pretty sure it was flagging a specific file in the zite's directory, but idk.\n\nsimply linking to that .js file on coinhive in a comment here will trigger people's AV, so you might want to edit your comment and delete the part that has the text that i typed.",
				"added": 1538256540
			},
			{
				"comment_id": 269,
				"body": "> [pexo](#comment_18_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): In a nutshell, zeronet restricts zites inside iframes, that have only limited permissions. In theory any js(=javascript) on any zite should not be able to do anything shady.However: js is packed with vulnerabilities, which could and have(in the past) broken through the iframe sandbox and through the browser itself. Also one has to keep in mind even if the js were to be perfectly safe, there are plugins you might have installed(such as flash for example), that can communicate freely using your ip and to whatever server they desire. Js is definitively the most insecure part of zeronet at the moment and the fact that you are required to have js enabled at all times is scary, especially since zite owners are basically gods(in the sense, that they can do anything they want on their zite, including banning and deleting users). At the moment it is impossible to have communication in zeronet without js, since communication with the zeronet client is not possible as soon as you use the /raw/-prefix(/raw/ is the only way you can have access to a zite without js, which, at the current point in time, breaks all zites, that have some sort of communication feature and most other zites, that don't since they rely on js for building the html for the webpage).\n\nsuch wisdom! do you have any other predictions to give us?",
				"added": 1538340079
			}
		],
		"1538188815_1NcVwrBpf91ownXuSgYnHBZCWjoiNjw9FP": [
			{
				"comment_id": 264,
				"body": "there may have been a couple of people on ZeroMe who were openly asking if there were any other furries around.\n\nthere was one furry ZeroTalk clone but i think i deleted it.\n\nhere are a two furry gallery hubs i found: [Gay Yiff Gallery](/18838Kb461kSaBgynE97a9BwQfNdsbcoN) | [Furry and Yiff](/14gbc57vHpEnJvzetSecquyA9iL5m7JBxS/)\n\notherwise i don't know much. i guess i hope this helps, you strange fur person.",
				"added": 1538255636
			},
			{
				"comment_id": 271,
				"body": "> [thunder33345](#comment_257_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): someone could just make a group topic here\n\ngroup topic?",
				"added": 1538686132
			},
			{
				"comment_id": 272,
				"body": "> [thunder33345](#comment_258_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): basically an subforum/folder for threads but regular users might still not appreciate it and we might be better off cloning but that will always spell the end of any spinoff forums \n\ni've seen these but had no idea that anyone other than nofish could do it.",
				"added": 1538687255
			},
			{
				"comment_id": 273,
				"body": "> [thunder33345](#comment_259_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): well anyone can do it, one problem tho you will have to edit the data.json to create itthere's no other ways around ityou can add [...]\n\nwhat the heck",
				"added": 1538689646
			}
		],
		"1538256010_168qV1Xxp2EyszrzdECLUwXrn9wGYjDdar": [
			{
				"comment_id": 265,
				"body": "hahaha yes that was me! i'll remove it from my post, sorry for the inconvenience. but just be aware anyone else can do the same thing to trigger your antivirus.",
				"added": 1538256438
			},
			{
				"comment_id": 267,
				"body": "> [zerolstn](#comment_63_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj): Just so people are aware, this code can't execute. It's just put in a text/json file. Your antivirus is just flagging it because it's just searching for the code.\n\nyes. the code was not executable. i simply typed it in a comment i made here while discussing someone's antivirus going off. afterwords i thought \"oh i wonder if this will trigger people's antivirus too\" and now i learned with much delight that it did, so i went ahead and removed it from my post.\n\nhopefully it only caused their AV to delete all of my posts rather than deleting the entire ZeroTalk directory.",
				"added": 1538256910
			}
		],
		"1538339080_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 268,
				"body": "1 day ago a user on ZeroTalk commented that while ZeroNet does sandbox zites in iframes, there could be vulnerabilities in the implementation or in .js that might allow one of these zites to break out of the sandbox. Never before have I seen such wisdom on the internet. I assume he didn't already know about this exploit.",
				"added": 1538339891
			}
		],
		"1538367782_1G77baH5aGCXXRrUkyWQwmeCJppzC56wc2": [
			{
				"comment_id": 270,
				"body": "i feel it would be better for you to host these links in your own site and publish it, since zerotalk can be censored and only you can censor a site you make",
				"added": 1538369174
			}
		],
		"1538552691_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": [
			{
				"comment_id": 274,
				"body": "sorry im too busy fighting for other worthless causes and getting ready to throw my vote away.",
				"added": 1538922016
			}
		],
		"1519815258_1PyrAjbZiHyfW7jSWeUpDPSeMU7sAJ5HSs": [
			{
				"comment_id": 281,
				"body": "> [lonelyreader](#comment_15_1PyrAjbZiHyfW7jSWeUpDPSeMU7sAJ5HSs): updated the address from http://127.0.0.1:43110/19G2FpDcdvtUp6cAbie4dT2fTXMWmvVvqd to http://127.0.0.1:43110/1CD4uCgXYwfMU7bVPd5VQLzoZDoeLXpogc for easier 'cd' into the folder\n\nthis changelog is enjoyable on multiple levels.",
				"added": 1539722992
			}
		],
		"1539909575_1DmuqxmEjz9fYuHqsS5Jte9GE29J7t2xSN": [
			{
				"comment_id": 282,
				"body": "its a bitcoin miner. unless it's also another kind of trojan. i can't promise it's not both.\n\nyou should set a null proxy making everything point to \"127.0.0.1\" so 3rd party resources can't be loaded through zeronet. unless there is another malicious script hosted inside of zeronet that is doing naughty things or breaking its iframe. then there's bigger problems.",
				"added": 1539909918
			}
		],
		"1539921274_161j9Vh5TpPeic4bzZYMd5Spgnf4qbiFFZ": [
			{
				"comment_id": 283,
				"body": "zeronet is incapable of running server-side code. only clientside code can be run.",
				"added": 1539921748
			}
		],
		"1540383456_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg": [
			{
				"comment_id": 284,
				"body": ">If everyone want to speak completely freely, they better off maintaining their own zite.\nthis is the censorship model that zeronet operates under. if you make your own zite, you can say or do whatever you want on it, and you can publish it and have it be distributed and accessible, and individuals or state actors will have a very difficult time stopping you.\n\ni would consider discoverability as a separate issue that ZN doesn't really attempt to solve. just because your zite exists out there doesn't necessarily mean individuals are willing or interested in seeding it, nor does it necessarily mean they will be able to find it. if you advertise it in zeronet on sites you don't operate, those advertisements can be censored.\n\nZN is also not an equal opportunity seeder. if nobody knows about or cares about your zite, it might in theory be more difficult for people to access it. people seed the sites and data they wish to seed and are not obligated to seed things they don't want to.\n\ni'm not sure, but i think freenet contrasts with this, where users are helping broadcast anything and everything, and the user does not have the capability to pick and choose what they help distribute, nor do they know what they are helping distribute. there are merits and drawbacks to either model.",
				"added": 1540400836
			},
			{
				"comment_id": 285,
				"body": "> [thunder33345](#comment_289_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): agreed this is something i wish we can somehow resolve, before we get popular or anything..any idea on how it can be \"fixed\"?hubs kinda \"fixes\" it, but everyone is only safe if they ran their own hub..which is just a loopback on the same problem.\n\ni don't think there's a solution for ZN that doesn't involve taking away control of a site from the site's owner. hubs aren't a solution, because a hub is just a site which has an owner that controls what can be published on their site.\n\neven if you devise a system which prohibits a site owner from changing the data that users publish onto their site, site owners must still have control over the html, css, js and whatnot of the site that they developed and published. and if they can't change the data some user publishes onto their site, it is still trivial for them to hide their posts from everybody with css.",
				"added": 1540404443
			}
		],
		"1540777504_1Br6u3XGUK1cnNf4A35jksjJKHNLkYuh86": [
			{
				"comment_id": 286,
				"body": "[ZeroMe](/Me.ZeroNetwork.bit/)",
				"added": 1540779964
			}
		],
		"1540777965_1Br6u3XGUK1cnNf4A35jksjJKHNLkYuh86": [
			{
				"comment_id": 287,
				"body": "at the end of the day it's just html, css, js, and the content.json file. make sure to write down your private key, because every time you update the site you need to sign your content.json and publish it to everyone so they can get the new changes.",
				"added": 1540780092
			}
		],
		"1540055841_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR": [
			{
				"comment_id": 288,
				"body": "put clearnet cryptocoin mining .js on your zite, that is the best way to make money and it is also the best way to make friends and become popular. that third party google tracking script that loads on your site is good for that too.",
				"added": 1541019796
			}
		],
		"1541031054_1ByuWDrDpJKEB5WbR7Dw4CUT1pw5DXKxgU": [
			{
				"comment_id": 289,
				"body": "> [daniell](#comment_122_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe): Not opt-in, but opt-out. Lots of newbie users maybe don't care about it, and doesn't knows how to enable it.Archiving sites is more important than disk storage.But detect if disk haves enough storage to archive, and when it is reaching limit, show a dialog that user can disable it or clean some uneeded commits/snapshots on archives.\n\nthat is certainly going overboard. i probably have a hundred sites im connected to. i don't need an archive of each site every time each of them updates. and then there are sites like zerome hubs that update multiple times in an hour. i don't need multiple backups of sites like that, constantly being generated and written to my disk. my disk space is much more important than dozens of pointless archives of sites i don't honestly care that much about but still remain connected to purely because there isn't a reason not to (automatic archiving would be a good reason for me to purge 90% of the sites i have).\n\nthere is certainly a case for having a built in site archiving feature, as showcased with this Get Games site where the site owner or someone with access to his computer defaced it and made it unusable.\n\nhaving every zeronet client automatically generate archives of every revision of every site it is connected to is far too cumbersome of a solution. folks who are interested enough in a site to archive them should opt into archives of that site. in the rare event a site like this falls, a few people will have archives of a working backup that can be deployed or referred to.\n\nit is completely unnecessary that every zeronet user ever dedicate their disk space for this purpose.",
				"added": 1541036832
			}
		],
		"1541169956_17WCGhYYYbjznWvdnjAoGS74aK9AtjfdU7": [
			{
				"comment_id": 290,
				"body": "im not really sure what Q does that every other crypto currency hasn't already done. if i missed getting bitcoin seven years ago im just in time to get some other unknown cryptocoin nobody's jumped on board with today. i don't need Q for that (nor do i need to give my name or email........)",
				"added": 1541194911
			},
			{
				"comment_id": 291,
				"body": "> [akito](#comment_456_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY): See you in 10 years when we get rich and you will regret not joining.\n\nthats what every cryptocoin startup says. what people don't know is that lolicoin is the coin that'll get you into forbes.",
				"added": 1541276635
			}
		],
		"1541253539_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": [
			{
				"comment_id": 292,
				"body": "one dirty hack that i think was touted by the millchan developer is you can use file permissions to make the user's directory inside the site read-only. that way any posts you delete or any new posts can't be written to it.",
				"added": 1541276840
			}
		],
		"1541537201_1BfSUGhNmbYZHDgLw67nu2b9LbbPne92Dz": [
			{
				"comment_id": 293,
				"body": "try [ThunderWave](/thunderwave.bit/)\nor [0Play Game Center](/1Ag6xidDHiPgWoDKhfSx4xFQr6WC3NqxZg/) <-requires the [PeerMessage plugin](/1GTVetvjTEriCMzKzWSP9FahYoMPy6BG1P/?/plugin/gitcenter/1536381998652)",
				"added": 1541540508
			}
		],
		"1541565435_15TSdTU5ZrAHXXiMQvMUEEUm17GFt5WqWp": [
			{
				"comment_id": 294,
				"body": "i honestly think that we should ban the ip ranges of all Minnesota ISPs to reduce the amount of low quality posts on ZeroNet. let's all bug nofish to make this happen and make this network a better place!",
				"added": 1541566211
			},
			{
				"comment_id": 297,
				"body": "> [sheendocks](#comment_5_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU): What about the Minnesotans though?\n\ni want them all gone. they're all terrible.",
				"added": 1541604395
			}
		],
		"1541030608_1CrzoomCXRHkg6vqaRXwffoMkWMjkDurf4": [
			{
				"comment_id": 295,
				"body": "think it's okay to be white? think again. please leave zeronet if you are caucasian or sympathize with the white bois.",
				"added": 1541566401
			}
		],
		"1541600740_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 296,
				"body": "does it also bother you to know that these anonymous (or pseudoanonymous, if they are not using tor) individuals can't be censored because a big part of ZeroNet's design and purpose is to make the things they publish uncensorable aka difficult or impossible to remove?",
				"added": 1541603642
			},
			{
				"comment_id": 298,
				"body": "in answer to your question, i do not get my morals from any singular common source. i have a sense of right and wrong, and it is something that has developed organically over the course of my life, and it is something that is constantly being challenged and changed to adapt to an ever-changing world as i come to better understand it throughout the course of my life.\n\nyou might think im without morals because i have different morals than you. you might also think my morals are bad or wrong because they were not rigidly sourced from a stale tome written centuries ago by an imperfect human and translated multiple times by multiple imperfect humans to multiple human languages (many of which are always-evolving, and the meaning of its words change in time).\n\nthe morals you voluntarily took on are not more valid than the morals i learned on my own over the course of my life. i did not \"voluntarily take on\" my morals. they are an in separable part of who i am, and as a result, my morals cannot be voluntarily shed in the way one might discard an outdated old book.\n\ni hope this answer is helpful to you.",
				"added": 1541607919
			},
			{
				"comment_id": 299,
				"body": "> [sheendocks](#comment_12_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU): With my preferred ethical texts, I had to relearn the word 'despise' because the 19th century meaning is a bit different from the modern meaning. I honestly don't mind where people take their ethics from but I think people ought to have a somewhat comprehensive system past the golden rule as it's pretty narrow but a good place to start from nonetheless.\n\ni believe generally people DO have a moral system that goes beyond the golden rule. however i don't believe it is necessary to read textbooks to achieve this. for most people, the golden rule should be enough to get them by anyway, i just think that not everyone follows them very strictly. people are imperfect and even if they know something is bad they might do it anyway in a moment of passion or weakness.",
				"added": 1541609758
			}
		],
		"1541639818_1MbR4tiqHn8X3b7mEXXi1jaDdbJjbfCZSV": [
			{
				"comment_id": 300,
				"body": "can we get a comprehensive list of every person who once was or will some day in the future be a jew?",
				"added": 1541643058
			}
		],
		"1541904191_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 301,
				"body": "are any of the translation alternatives tolerably good yet?\n\nopenstreetmap needs to up their game with public transportation information so i can use it instead of google when i go places.\n\nfor everything else, i'm rock solid, no need for google.",
				"added": 1541905015
			}
		],
		"1542440901_1PWTu9NnYyjJy5NsqnFt2NvwhQZPSyRV1h": [
			{
				"comment_id": 302,
				"body": "no to both",
				"added": 1542470695
			},
			{
				"comment_id": 303,
				"body": "> [thorburn](#comment_11_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Care to explain?\n\ni2p is more sophisticated and is probably also used more, just as one example. that's the example that comes to mind immediately.",
				"added": 1542485729
			}
		],
		"1542481728_183EJxsVNmdEH2rhDxMXnqw6Pvjdj3XAf7": [
			{
				"comment_id": 304,
				"body": "i don't remember seeing a site for this, but old roms are perfect bite-size files to share through ZN without needing to download them through a torrent client.",
				"added": 1542485914
			}
		],
		"1542493737_1JBYQxMSEnfbSmrJwFXn5K2ukfuv5Kng4J": [
			{
				"comment_id": 305,
				"body": "probably just create a symbolic link between your zeronet site directory and the directory where the web server you configured for the tor hidden service is looking for the site?\n\nyou can't have the same interactivity between the tor site and the zeronet site, so if you wanted to create a dynamic site where people can post or leave comments, your users would have to either leave comments on zeronet, or on tor, but you can't do both.",
				"added": 1542494662
			},
			{
				"comment_id": 306,
				"body": "> [tarrot](#comment_3_1NcVwrBpf91ownXuSgYnHBZCWjoiNjw9FP): well im kinda wanting the onion link but also the decentralization.  Im wanting it to remail up even while my device is offline\n\ntor does not solve that problem. it only anonymizes your traffic. it does not decentralize anything or make anything available when tor or the web server is turned off.",
				"added": 1542505035
			}
		],
		"1542671496_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": [
			{
				"comment_id": 307,
				"body": "i thought there was a git page for the zerogallery hub, but i guess i just cloned Sayo's hub like everyone else did",
				"added": 1542838843
			},
			{
				"comment_id": 308,
				"body": "this is a minor thing, but 0gallery has a setting which allows you to be notified in ZeroHello of any new **non**-r18 gallery that gets published. i would like to be able to be notified of any new **r-18** galleries too.",
				"added": 1542843758
			}
		],
		"1542861175_1PkVAeJswTgCVG4MN6BZG7YdWpzgmek5WZ": [
			{
				"comment_id": 309,
				"body": "there comes a point where sending a canary down to check the coal mine is a waste of avian life. think of how many bird's lives could be saved if we were just a little smarter in the platforms and services we support.\n\ngab is a centralized platform. it is worth noting that the website failed to remain online after a user on their platform shot a bunch of jews up. it began having serious problems with its hosting provider as well as their payment provider.\n\na bit before that shooting took place, the admin decided to ban loli in a post where he expressed his strong negative emotional feelings towards it. it wasn't until after the fact that he began claiming the ban was for legal reasons. i wonder what else he doesn't want on his website that he can justify culling?\n\ni find it ironic that none of his service providers batted an eye at the loliposting on the site that he wanted removed, but an antisemetic murderer, who he fought stalwartly to provide a free speech platform for, is what screws his pooch.",
				"added": 1542924174
			},
			{
				"comment_id": 311,
				"body": "> [steelmemes](#comment_4_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg): Decentralized social media like Zeronet have to be careful, though. Depending on how a zite is programmed it can be way too easy for an attacker to spam CP to it, and then the glow-in-the-darks have their excuse to track down and arrest everyone who's seeding it. Any decentralized social media site would have to be designed under the assumption that someone somewhere will want it destroyed and try to prevent this ahead of time.\n\nthe attacker in question would have to either be a site's owner, or a rogue individual who has somehow secured the site's private key. but either type of individual could perform this type of attack. i've always wondered how easy it would be for someone to make a bunch of fake sites, get them seeded by people, and then flip a switch and change the content of their sites to be illegal, getting loads of people to seed illegal content.",
				"added": 1543361556
			}
		],
		"1543348094_16VrCKQQiVZpJ6S5xJASR8LCFLv24M5bfn": [
			{
				"comment_id": 310,
				"body": "the ip address associations with an id are only a problem with the id providers which require your ip information. there are totally anonymous id providers out there that do not require any information from you besides a handle you wish to use. ZeroID is not the only id provider. i will concede however that almost every site being developed seems to default to accepting ZeroID and ZeroID only, while ignoring all other ID providers. i wish this were not the case.\n\ni also do not like the ID system to begin with. it is designed in such a way that encourages people to use the same ID on every site. you are pseudo anonymous at best. with a little work anyone can track all your posts down to the one ID you have been using. this would be less  of a problem if ID providers made it easy to generate more than 1 ID, and if ZeroNet or sites had better UI to quickly change the ID you wanted to post with. at the end of the day though, your typing patterns, time of day usage, and various other behavioral factors can make it possible to link different IDs together as belonging to the same individual.",
				"added": 1543361342
			}
		],
		"1543505232_1LRrXQL18q4U54Zv8mafCCGm2WAYSe79hu": [
			{
				"comment_id": 312,
				"body": "please provide any details that would help reproduce the problem. please also provide details on which files were deleted after the crash you experienced. if you could also provide the error message, that would be great. if you were to provide any of this information, it would help the community diagnose and solve the problem that occurred for you. as far as i know, nothing like this has ever happened to anyone before, so a bug as rare as this will be difficult to reproduce without this information. if you cannot provide any of this, we will have to sit and wait for someone else to experience your issue and give details.\n\nadditionally, you want functions in the site. what site would you like functions on? what functions would you like on the site? as another user has commented, the pretty graphics and colors in zeronet use up a very negligible (if any) amount of cpu cycles. if you have a specific criticism of the GUI, that might be useful feedback to give to the developer so he might improve it.",
				"added": 1543539865
			}
		],
		"1543546851_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 313,
				"body": "niiiiiiiiiiiiiice",
				"added": 1543548653
			}
		],
		"1543026395_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": [
			{
				"comment_id": 314,
				"body": "this is incredibly slick! it's too easy to go back into a gallery and modify any tag or metadata. i'll have to give a gallery with chapters a shot, it looks really easy too. i've deployed a site with some (non-h) manga [here](/1mangoXdiEbpL5yw9YQpA26oN9cXiQw8J).\n\non \"computer-suggested tags\", i would recommend doing the following:\n\nwhen the tag field is empty, have ghost text in the background that says \"artist:<artist_name> series:<series_name>\" to help suggest to the user what kinds of tags he should be adding. this would help make the types of tags consistent across different galleries. but maybe you already have an idea for a more sophisticated system?\n\nalso, i've never added images in the wrong order before, but it looks easy to do by accident. if this happens, the user would probably like to be able to arbitrarily reorder images in the gallery to their liking. of course, the order seems like it would get mixed up the same way every time, so maybe having a little button they can click that says \"inverse\" can flop the image order intelligently without headaches.",
				"added": 1543634225
			},
			{
				"comment_id": 317,
				"body": "> [1pgallery](#comment_27_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE): The problem is that you uploaded a gallery to my hub, instead of cloning the hub and uploading to your hub after that. The instructions aren't very clear there, I will fix that soon FIXED!. I'm thinking of making a public hub that anyone can upload to using their zeroid/kxoid/etc. but that will take a while.\n\nthat would be a fun social experiment. i think you should do it.",
				"added": 1543765128
			},
			{
				"comment_id": 318,
				"body": "> [ssdifnskdjfnsdjk](#comment_514_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @1pgalleryIt seems site 14NFfVBBAFb... was not changed because i can still attempt to add \"New Gallery\". Maybe because site GalleryHub+ says \"1 FILE UPDATE FAILED\"Needs to be updated: main.js\n\nif i understand correctly only the site owner can publish changes and add new galleries to the site. you cannot currently add galleries to someone elses site with a zeronet ID. the issue here is that any visitor can see the gui for adding a gallery, and that should be limited to the owner.",
				"added": 1543767057
			},
			{
				"comment_id": 325,
				"body": "i believe i have successfully upgraded mangoGallery+ to the new system without any major catastrophes. hopefully there won't be too many \"hard\" updates like this going forward.",
				"added": 1544838497
			}
		],
		"1543694585_16af9LM4sncd3n6NQDX7GqdWreYvCbKX4q": [
			{
				"comment_id": 315,
				"body": "why are you putting out a hit on my girlfriend? it is no business of yours how abusive she is to me. please leave us alone!",
				"added": 1543700514
			},
			{
				"comment_id": 316,
				"body": "> [tusiko](#comment_13_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs): For these posts I would like to have a \"Mute\" button to ignore such needless posts.\n\nin this case you could just mute the user. unless you are concerned about missing other posts created by \"hurtthiswoman@zeroid.bit\"",
				"added": 1543710023
			}
		],
		"1509624447_1CGweCTCsFxD5FjvciBaGagZXsAUbXustF": [
			{
				"comment_id": 320,
				"body": "> [ssdifnskdjfnsdjk](#comment_513_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): OP posts (including initial) disappeared for me..\n\nhis posts work on my machine...",
				"added": 1543767884
			}
		],
		"1543955963_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 321,
				"body": "if you drag the 0 icon to open that gui menu (by the way, dragging an innocuous \"0\" is not a good way to open a menu or a sidebar, nofish), right above where it says \"This is My Site\" there is a field that says \"site address\", and there it is.",
				"added": 1543958936
			}
		],
		"1543785759_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": [
			{
				"comment_id": 322,
				"body": "> [helio5](#comment_2_1777DjiQTx8KPjxkZ5NK4gvVtifzgpQoZM): How would you go about doing that?\n\nits not very obvious but usually it is easy to do.\n\nif it's a zeroid, go to zeroid.bit, click \"search in user database\" , and type their name in. when their name shows up, there's a button you can click that says mute.",
				"added": 1544154529
			}
		],
		"1544190671_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": [
			{
				"comment_id": 323,
				"body": "perhaps nofish could mirror zeronet's documentation/starting guide on zeronet. and make it one of the hardcoded links in zerohello",
				"added": 1544197585
			},
			{
				"comment_id": 324,
				"body": "> [schiz0](#comment_42_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k): like the newMultilanguage, self hosted documentation with ongoing Fr/Zh translation + ZeroNet mirror: http://127.0.0.1:43110/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1 [Thanks to Lola, blurHY] [...]\n\nlooks spiffy. make it happen. i don't know if he'd be willing to hardcode any site he doesn't have the private key to though.",
				"added": 1544828095
			}
		],
		"1544911802_14cqdxte9VRXGe4WYEY49Htx1HxUqKNGrP": [
			{
				"comment_id": 326,
				"body": "people like to share the things they love",
				"added": 1544923544
			}
		],
		"1545029431_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": [
			{
				"comment_id": 327,
				"body": "if zeronet was not secure to use, running it in tor would probably not alleviate the security flaws. all tor does is anonymize your traffic. there has been no third party security audit for zeronet. i don't think there ever will be one?\n\nsoftware like tor or i2p is critical for people who need anonymity, and necessitate that kind of security audit. veracrypt (previously truecrypt) and basically any tool used for encryption, similarly, is pretty critical and needs audits by independent professionals to give reassurance to others that no serious flaws have been discovered in it.\n\nmost people who use zeronet use it with their plain old ip address and with no anonymization and don't expect that kind of level of anonymity. many people do use zeronet with tor to provide a layer of anonymity, and assume that tor is anonymizing everything for them and they only need to trust tor. there could be an unknown bug in zeronet that causes a person's real ip address to be exposed even while using tor that no one knows about. but that same risk applies to any software a person might use in conjunction with tor (many bittorrent clients, for instance, leak your real ip address when you try to use tor as a proxy).\n\nif you're worried about your ip address being leaked while using tor only mode, you might want to sniff your traffic to check for these leaks. no one has reported any yet.\n\nif you're worried about javascript breaking through the iframe, i'm afraid i don't know what to tell you. it's a possibility another bug like this will be discovered.\n\notherwise i'm not sure what you are concerned about in terms of security.",
				"added": 1545034275
			}
		],
		"1545026098_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": [
			{
				"comment_id": 328,
				"body": "changing the default browser in your operating system should do it. if that isn't a good option, monkeying around with the start.py file might yield results, i'm just not 100% sure what you'd need to do. maybe it's as simple as replaceing \"default_browser\" with the path to the TorBrowser you want to launch, but it's probably not that simple.",
				"added": 1545034432
			}
		],
		"1547691059_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 329,
				"body": "i can't remember with certainty but i believe the favorite sites was something stored in your browser's localstorage.",
				"added": 1547760930
			},
			{
				"comment_id": 330,
				"body": "> [quantumworld](#comment_159_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I was not clear. It was on my zerohello -zeronet.\n\noh. i think the favorites in zerohello used to be saved in localstorage in the browser, but i just pointed to ZN with a different browser and it still had all the sites i marked as favorites.\n\nnow it is saved in your users.json in your data folder! if you look down to where it points at the settings for zerohello it saves your favorites there. maybe you didn't copy over users.json? or maybe zeronet accidentally wiped it when it updated itself? if you backed up users.json you can restore it with that.",
				"added": 1547766068
			}
		],
		"1547612410_1QGE1KUwdNLyE1oNpcvksRLV72K9BZ3ELa": [
			{
				"comment_id": 331,
				"body": "> [znuser144](#comment_1_1QGE1KUwdNLyE1oNpcvksRLV72K9BZ3ELa): Are there prohibited sites in these lists too?\n\nmoderation is dependent on each site's owner and will vary from site to site. unfortunately, very few owners explain what they moderate if they moderate anything at all, so it is not always clear if they have content policies or if they are enforced.",
				"added": 1547766239
			}
		],
		"1548012943_14hRA2Pze5PXYZLf8JCm9hknxLZTQ4qGqN": [
			{
				"comment_id": 332,
				"body": "i'm the anti christ",
				"added": 1548016245
			}
		],
		"1548890091_14TR5Msgnb1MBKGayKiDB7j3aFdGrFUqdf": [
			{
				"comment_id": 333,
				"body": "are you unable to anonymously register a nick?",
				"added": 1548891899
			}
		],
		"1548974921_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7": [
			{
				"comment_id": 334,
				"body": "sweet! i'm hoping to see this get populated with boards.",
				"added": 1548984427
			}
		],
		"1549201445_1DccAuEVfpyANY3pgJUA9GF5YYXdJ7DHxZ": [
			{
				"comment_id": 335,
				"body": "these are all important issues that strike close to home for me, and i will respond to it with the urgency it deserves.",
				"added": 1549208824
			}
		],
		"1549637074_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 336,
				"body": "if your zeronet site is well peered it should not face any burden from being accessed excessively by any user",
				"added": 1549640298
			}
		],
		"1549884107_1QGE1KUwdNLyE1oNpcvksRLV72K9BZ3ELa": [
			{
				"comment_id": 337,
				"body": "Thunderwave is good for chat. [thunderwave.bit](/thunderwave.bit/)\nZeroMe is an official and very active social network.\nMillchan is an active imageboard.",
				"added": 1549906724
			}
		],
		"1550688425_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": [
			{
				"comment_id": 338,
				"body": "it might be possible currently with modification to zeronet's code, and the end result might be that you will only be able to peer with other i2p network nodes.\n\nat one point i recall there were thoughts of attempting to officially implement i2p functionality. i don't remember what the roadblocks were that slowed down progress in that direction.",
				"added": 1550688769
			},
			{
				"comment_id": 340,
				"body": "> [7heaven](#comment_10_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6): But I think it can be replacement for Tor.\n\ni2p can not adequately replace tor's clear web traffic anonymizing. i2p's strengths and primary focus are on its hidden networks.",
				"added": 1550960553
			},
			{
				"comment_id": 341,
				"body": "> [eightyfour](#comment_72_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): good explanation [...]\n\nthe reason Tor ZN users are able to access everything in the ZN network is because there is a good amount of people who are using ZN in the mixed Tor + Clearnet mode. a Tor only ZN node needs these peers, or else they will only see content that is being published and circulated by other Tor only nodes.\n\ni'm not certain how a similar I2P + Clearnet mode would work, although I believe Retroshare does this.",
				"added": 1550967208
			}
		],
		"1550686723_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp": [
			{
				"comment_id": 339,
				"body": "there are certainly caveats to .bit domains. i'm not sure how they work, but i assume .bit domain recipients can renew the domains for themselves somehow.",
				"added": 1550688891
			}
		],
		"1551108132_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 342,
				"body": "what makes ZN interesting is that a Russian citizen can go abroad for a few months, download a bunch of ZN sites, return to his home country, and Russians can start viewing all the ZN content he acquired while he was out of the country.\n\nthey can post content and publish their own things, and as long as that Russian citizen downloaded those Russian posts and content, he can go abroad again and the rest of the world can access those Russian posts.\n\nso as long as Russians are able to travel, and their pc's and devices aren't thoroughly searched, they can still kind of participate in the global ZN network, just not in a live always-online way.",
				"added": 1551127111
			}
		],
		"1551542268_18yMiH1HZRsMQqRkMQ1xgedMPKFwpbG71b": [
			{
				"comment_id": 343,
				"body": "someone could probably, theoretically, build a bridge between zeroMail and clearnet email. it would effectively be a centralized service that forwards your zeromail to an email, and takes an email and forwards it to your zeromail.\n\nbut basically zeromail is not email, so you can't send messages to and from clearnet email, unless someone where to design a service to bridge them.",
				"added": 1551549387
			}
		],
		"1552022585_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR": [
			{
				"comment_id": 344,
				"body": "combine? people have used ipfs here to share stuff. there have been video streaming sites here on zeronet where the videos were hosted on ipfs.",
				"added": 1552076261
			},
			{
				"comment_id": 350,
				"body": "> [cmkat](#comment_1_1Hw7w7Swdeexw86XmyfMHLbsSpzzH4yk5z): Oh, where can i try it? this a very brutal technology for me, have a lot of curiosity by the way.\ni don't use ipfs myself, but here are a couple old sites (files and videos might not be seeded through ipfs anymore...):\n[StarGate - IPFS Share and View](/17zvBL3FBNDSV5x7EoGv2LdFe473iw9dVZ/)\n[Loligod's IPFS Video Test](/1GcRg92UWHNtL5LRFBtreUSsnUGkPxaBJu/)\n[IPFS Videos by loligod](/16pz3DbSRyz7D7e3qsxWMq98Z8VztJZN4j/)",
				"added": 1553178465
			}
		],
		"1552589048_1KKaZQ8JXomKJsjDcfcym4mDyJBKZj9Q5K": [
			{
				"comment_id": 345,
				"body": "we're alone because the universe is big and expansive. there is probably life out there right now. and there is probably life that has lived and gone extinct already. and there is probably life that hasn't started existing yet but will in the future. but all of this probably takes place really far away from planet Earth and we just don't know it.",
				"added": 1552595854
			},
			{
				"comment_id": 346,
				"body": "> [fireandflame](#comment_1_1KKaZQ8JXomKJsjDcfcym4mDyJBKZj9Q5K): Lol feels like we are all neighbours but we constantly miss eachother.\n\nthere's enough existential loneliness for all of the lifeforms in the universe to share.",
				"added": 1552606631
			}
		],
		"1552858206_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 347,
				"body": "everyone i mention ZeroNet to derisively refers to it as \"reddit-net\" due to the fact that the userbase is primarily reddit users, and because the culture of the community here is presumably similar to reddit. i don't go to that pit so i don't know if this description is accurate.",
				"added": 1552859564
			}
		],
		"1552916412_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 348,
				"body": "read the thrilling adventure of alice and bob communicating over the network: [A Gentle Introduction to How I2P Works](https://geti2p.net/en/docs/how/intro)",
				"added": 1552925703
			}
		],
		"1553166302_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq": [
			{
				"comment_id": 349,
				"body": "why merely threaten the user with giving their ip and info over to authorities, rather than just fucking doing it?",
				"added": 1553177842
			}
		],
		"1553373784_12DZ6coMPvGExMzmkC2md9rLjmWTsbVbWk": [
			{
				"comment_id": 351,
				"body": "the sun's uv rays will give you cancer so always stay indoors with the blinds closed.\nprolonged loneliness has a very serious impact on your heart's health over the years, and WILL reduce your lifespan. so take good care of your 2d waifu.",
				"added": 1553377737
			},
			{
				"comment_id": 352,
				"body": "> [styromaniac](#comment_616_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I kind of feel like that's nonsense. Human interaction has the same effect as highly addictive drugs, and can be as bad as the worst of them in withdrawal. That means that you could have a little bit of an addictive personality. I think that people tend to be programmed by others into thinking that you need friends and family. [...]\n\nit's not nonesense. there is a lot of research tying loneliness to various physical and mental health problems. it weakens your immune system, increases your likelihood of developing heart disease & high blood pressure, and leads to an early onset of dementia as you age. it also generally makes a person far more likely to experience depression and suicidal feelings.\n\nyou're correct on one thing. as human beings, we ARE programmed to need friends and family and connection to others. that programming is in our dna. it does not come from conditioning.",
				"added": 1553441134
			}
		],
		"1553457290_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": [
			{
				"comment_id": 353,
				"body": "> [klu9](#comment_116_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): OK, I moved and renamed the folder. But Kxoid was still circling without completion. I reloaded the Create ID page and tried again, but still just circling :(\n\ndid you restart zeronet?",
				"added": 1553460439
			},
			{
				"comment_id": 354,
				"body": "i'm really glad that i opened zeronet just in time to participate in this mindhive threesome",
				"added": 1553461672
			}
		],
		"1554477808_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 355,
				"body": "this is a nice essay on the subject that i liked: [I've Got Nothing to Hide and Other Misunderstandings of Privacy.pdf](/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB/Ive%20Got%20Nothing%20to%20Hide%20and%20Other%20Misunderstandings%20of%20Privacy.pdf)",
				"added": 1554584859
			}
		],
		"1555521255_1ME9gwj9Exp9cBbuSxxr1mEiySEjmXNA2w": [
			{
				"comment_id": 356,
				"body": ".cbz = .zip\n.cbr = .rar\n.cb7(? i think thats right) = .7z\n\nlimiting uploads to files with certain extensions at the end of their filename is usually not very sensible. fortunately you can self host, or clone your own upload site that whitelists these extensions, make your own gallery hub and upload the comic as a gallery, or just upload them as .zip/.rar/.7z\n\nalso, i think there are a couple of ZeroUp clones that allow files of any arbitrary size, like maybe [ZeroUp Unlimited](/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/)",
				"added": 1555539392
			}
		],
		"1557931740_1CVLeFVQw2wWbBdpM5PtQhtzd7wjKzB24b": [
			{
				"comment_id": 357,
				"body": "i'm certain i'm not a bad person though.",
				"added": 1557973896
			}
		],
		"1558529155_15TSdTU5ZrAHXXiMQvMUEEUm17GFt5WqWp": [
			{
				"comment_id": 358,
				"body": "if someone says something that's wrong on the internet, instead of asking the admin of the site they're on to remove their post, tell the person why what they said is wrong.",
				"added": 1558669547
			}
		],
		"1558811392_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": [
			{
				"comment_id": 359,
				"body": "Here you go, via [ZeroUp Unlimited](/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB/The%20Lone%20Gunmen%20S01E01.avi)",
				"added": 1558833443
			},
			{
				"comment_id": 360,
				"body": "> [daz](#comment_27_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr): Wow down in under 3 minuets and the same format AVI as the rest of the files I have. I had been seeding the collection for some years and part of the file I just down loaded may have just come home cheers real class A+ I can incept it back in the folder and the pain of the missing 1 will go away. hope I can find all you helpful people on the zerofacebook type site if not I am sure me you can find a simple name like daz\n\nglad my disgusting digital packrat hoarding ways could finally be of some service to someone.",
				"added": 1558901797
			}
		],
		"1560146219_159A9mgy8Rj1VR6hVoen597LKFZYuvU722": [
			{
				"comment_id": 361,
				"body": "God loves gay people... that's why in all of His wisdom He made them. still, feel free to make your site and i'm sure a few people will be interested in seeding it.",
				"added": 1560201216
			},
			{
				"comment_id": 362,
				"body": "> [fantoski](#comment_46_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): Well TBH if he creates his own Zite he WILL be able to do whatever the fuck he wants on it lmao.  [...]\n\ni agree, i believe people who hold views such as his should be openly encouraged to publish those views for the world to snicker at. censoring hate speech, or prejudice, and stupid ideas does nothing to squash them, as we are only now starting to realize in the 21st century.",
				"added": 1560205794
			}
		],
		"1561215507_17SMqmrxtMGcem3hpoQ35bi48E4TWeS5p6": [
			{
				"comment_id": 363,
				"body": "it was nofish all along!",
				"added": 1561230564
			}
		],
		"1561288542_14hmCEXpoVdYQqeve93LpieDx2k8aFyT66": [
			{
				"comment_id": 364,
				"body": "anonymity is freeing. being able to speak your mind without having it nailed down and tied to YOU is a very liberating feeling. many abuse this, but for many others these are the conditions which allow them to speak openly and honestly.",
				"added": 1561326552
			}
		],
		"1561690274_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 365,
				"body": "if AI was that sophisticated i would probably recoil initially but then give in and let the friendship continue and see how it goes when i know it's a machine",
				"added": 1561765481
			}
		],
		"1564523508_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 366,
				"body": "i have users.json, my sites, and their keys backed up onto a second device. everything else on zeronet is hopefully replaceable. if other peoples sites and data can't be recovered, then zeronet really failed at its job.",
				"added": 1564526106
			}
		],
		"1564978498_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW": [
			{
				"comment_id": 367,
				"body": "if one person fell for it and sent him bitcoins that means nobody else has to, and the threat has been averted, right?",
				"added": 1565137739
			}
		],
		"1565139032_1Bgm4LkHQ6dvAkh8XBNuWDqKa5czmosBNH": [
			{
				"comment_id": 368,
				"body": "that's new. it used to just redirect people to Millchan, since it was the only actively developed zeronet imageboard after development on 0chan pooped out.",
				"added": 1565139103
			}
		],
		"1565140161_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": [
			{
				"comment_id": 369,
				"body": "im insatiable",
				"added": 1565140807
			}
		],
		"1565219322_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 370,
				"body": "zeronet is illegal to use in china. yet, china makes up a substantial portion of zeronet's userbase. i don't know what financial markets have to do with zeronet, but basically zeronet so far seems resilient against state censorship.",
				"added": 1565220243
			}
		],
		"1565214030_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 371,
				"body": "who will judge which users are geeks and which users are cool enough to join?",
				"added": 1565220441
			}
		],
		"1565239855_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W": [
			{
				"comment_id": 372,
				"body": "you did it! good job!",
				"added": 1565304654
			}
		],
		"1565449551_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 373,
				"body": "responding to \"How do I get a girlfriend\" shows positive traits, such as the desire to help others, while responding to \"Why does God punish us\" shows a desire to pretend like we are smart about something that we have no understanding of.\n\ni think i know which of these i value, and which of these i wish could be eradicated from the minds of men.",
				"added": 1565457882
			},
			{
				"comment_id": 374,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_742_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): so basically you're saying because it's complicated 'i'm not touching it'.\n\nit's not that it's complicated. it's more like it's a non-question, asking why god does this or that. there is no reason to believe that a god even exists, much less that he is responsible for anything that happens in this world. therefore, to speculate on his reasons for allegedly doing those things is an exercise in pointlessness. making yourself feel smart by trying to answer that question is kind of masturbatory, honestly, you're just fellating your ego and feelings of false intelligence and importance.\n\nnow, there's nothing wrong with masturbation. it's just that looking down on others for not doing it with you is really shitty of you. personally i'd rather help a nigga get a date.",
				"added": 1565462333
			}
		],
		"1565515280_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": [
			{
				"comment_id": 375,
				"body": "how dare they bring Tom & Jerry to my edgy darknet frontier!!!",
				"added": 1565518900
			}
		],
		"1565542990_1CmgfFAZ5VHekkpKkKAfTX3EcjQjsaKmXR": [
			{
				"comment_id": 376,
				"body": "> [pexo](#comment_118_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): That has been resolved. Their provider chose to kick them of their service. They are now hosted in moldavia. [...]\n\ni always thought h@h would have actually been cool if it was developed to actually decentralize the site instead of being just a half assed fallback to help lighten the centralized site's bandwidth burden. hopefully they explore that route.",
				"added": 1565550247
			}
		],
		"1565562243_1LqBmfU8v7MjQWdX8veLtbXuqmDvACw4vM": [
			{
				"comment_id": 377,
				"body": "i can't do that. i'm sorry.",
				"added": 1565563478
			}
		],
		"1565639606_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 378,
				"body": "i don't see any bread lines",
				"added": 1565644142
			}
		],
		"1565823101_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": [
			{
				"comment_id": 379,
				"body": "I'm confused how having sex with an underage girl a la Epstein could ever be construed as consensual.\n\nThere isn't anything ethically wrong with incest if we are assuming both parties are consenting to it and birth control is in use.",
				"added": 1565824842
			}
		],
		"1566012765_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R": [
			{
				"comment_id": 380,
				"body": "it's biologically normal for men to feel sexual attraction to any female whose body has started developing sexually. incidentally, ages 12-13-14 is not pedophilia, technically speaking. pedophiles are generally sexually attracted to kids who have not yet begun developing sexually.",
				"added": 1566015847
			}
		],
		"1566241449_18oN5jkSiB1SLb4Jywb4ZnKiwXqtQN5Fau": [
			{
				"comment_id": 381,
				"body": "it's possible some future big update could break backwards compatible communication with previous versions. this is something that has happened before with other p2p networks, although i think it's typically known it's going to happen well in advance.\n\nnot updating can leave you at risk of security flaws. and any new features, performance increases, things like that.\n\ni guess you can just not update until there's another big security scare, or until sites don't seem to work because you have an old version without some needed feature.",
				"added": 1566244999
			}
		],
		"1566342722_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 382,
				"body": "it seems not all porno sites are 420 friendly.\n\ni wish for a world where payment processors and advertisers cannot dictate what is allowed to be said or viewed on the internet.",
				"added": 1566327971
			}
		],
		"1566887761_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 383,
				"body": "i took the lords name in vain a few times and then had some sinful thoughts.",
				"added": 1567019793
			}
		],
		"1567301440_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU": [
			{
				"comment_id": 384,
				"body": "i agree, let's all shut down zeronet at the same time. im not going to click your dumb clearnet link though.",
				"added": 1567303641
			}
		],
		"1567569304_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": [
			{
				"comment_id": 385,
				"body": "> [caryoscelus](#comment_226_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): uMatrix [...]\n\ni came here to say this",
				"added": 1567611812
			},
			{
				"comment_id": 386,
				"body": "> [phitafil](#comment_1_1GGZUdrWYgPgvqiA1mo4TxHFKvCw4g99rK): You want to mislead Tor users into thinking that using an extension helps with anonymity? Every extension presents the opportunity for fingerprinting. This is bad advice.\n\nit is not misleading to suggest that uMatrix can be configured to block requests a site might make to a clearnet resource. the original post in this thread made zero mention of the use of the Tor browser bundle or to fingerprinting, and only expressed concern that a zeronet site he visits might instigate a connection to clearnet resources. if he is using the TBB, his ip address shouldn't be leaked in that situation anyway, except in a situation where a security flaw in zeronet's implementation leads to an attacking zeronet site's js from breaking its sandbox (which is a real security possibility).\n\ni'm sorry what we suggested is not a good solution under your threat model. fingerprinting, while worth discussing, seems outside of the scope of the original question.",
				"added": 1567619129
			}
		],
		"1568081655_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 387,
				"body": "do i have to get in line behind the dogs?",
				"added": 1568235312
			},
			{
				"comment_id": 389,
				"body": "> [kidcourageous](#comment_189_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): You know what? No. Because you're a bro I'm making an entirely new charity to help you get laid. #GetTheNekoLoliSomePusPus #RespectNekoLoli'sConstitutionalRightToSmash\n\nyou're too kind",
				"added": 1568235887
			}
		],
		"1567999355_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 388,
				"body": "i'll go as far as extending this to spiders. but not to other insects. sorry, but its a doggy dog world out there and little pests like you are a diamond dozen",
				"added": 1568235831
			}
		],
		"1570845988_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 390,
				"body": "i actually can't have a romantic partner, so i don't really relate to incels who only think they cant, or to the rest of the population who know they can",
				"added": 1570918247
			},
			{
				"comment_id": 391,
				"body": "> [mg0](#comment_141_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): That's because you aim too low ;)\n\ni don't really have a choice in the matter, you see...",
				"added": 1570921887
			},
			{
				"comment_id": 395,
				"body": "you can have charisma but still die alone lol",
				"added": 1571359037
			}
		],
		"1570980089_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 392,
				"body": "i clicked it for you, and it looks like an empty board with nothing inside. is this what you were afraid of? nothingness?",
				"added": 1571007386
			},
			{
				"comment_id": 393,
				"body": "> [harpyproductions](#comment_1_13kCqkdmy1yvF6mafYjGwnGhvJZnDiHJhj): do you think the feds wont know the difference from who actually browses that page and people who just passing by and get away as soon as they notice what CP actually stands for? i already got in at least 2 cp pages without knowing what it was about only 1 had cp in the name one of them at 08chan.bit. i run away as soon as i noticed and so far i have no problems with authorities\n\nfeds don't really care. they have quotas to meet, and for-profit prisons to fill with people like you, who think that the world knows the difference and cares about the well being of well meaning innocent people who fall astray and click a link they didn't know had something bad behind it.",
				"added": 1571020628
			},
			{
				"comment_id": 394,
				"body": "> [harpyproductions](#comment_3_13kCqkdmy1yvF6mafYjGwnGhvJZnDiHJhj): also he probably has to never come back again. this will tell the feds that you came there by mistake and want nothing to do with it. they have more things to do than to investigate a guy who probably already deleted all the files and even overwrite the free space just to be sure\n\nagain, the feds don't care. if they have what they need to prosecute someone, they will do so, because that is their job. they give zero fucks whether you are a good upstanding citizen or a child pornographer.",
				"added": 1571089826
			}
		],
		"1571417487_1MHdmQEW2HS6sZNgfi3VmtegHc6fUEyVkW": [
			{
				"comment_id": 396,
				"body": "[https://github.com/HelloZeroNet/ZeroNet#current-limitations](https://github.com/HelloZeroNet/ZeroNet#current-limitations)\nFile transactions are not compressed",
				"added": 1571444543
			},
			{
				"comment_id": 399,
				"body": "> [styromaniac](#comment_1137_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Thanks for finding that. Do you remember the site with precompressed files? That's what I was talking about.\n\nno i don't know anything about that",
				"added": 1571547731
			}
		],
		"1571500913_1KoioT6zYAXhg2NvChNtZvSU7fx5FhRW1w": [
			{
				"comment_id": 397,
				"body": "**there is no known way to take someone with pedophilia and make them no longer have pedophilia.**\n\nif you need help with something, it will have to be something like \"anxiety relating to having pedophilia\", or illegal/problematic behavior.\n\nif you have anxiety about having pedophilia, i don't have any useful advice for you. you can try talking to a therapist but there is a big risk they'll just have the authorities bust down your door (there is no patient confidentiality if they have a vague idea that you might pose a threat against a child). but if they don't do that to you, and listen to you, maybe they will become able to help you with some of your problems.\n\nif you need help with problematic or illegal behavior, you can try [https://stopitnow.org/](https://stopitnow.org/) (i think that's for the United States based sect, there are organizations in several other countries), and you can also try contacting the people here [https://www.iterapi.se](https://www.iterapi.se) and get involved in their free anonymous darknet based therapy service that they're doing as a part of research.\n\notherwise you're basically on your own because there's really no such thing as \"help\" when people say \"get help\". you can try reaching out to people who also like kids and talk to them, maybe that will help.\n\njust to reiterate, **you will always like kids and there's nothing you can do to alter that.**",
				"added": 1571541440
			},
			{
				"comment_id": 400,
				"body": "> [edgelordofdecent](#comment_186_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): He could also try watching cgi and loli hentai to avoid causing actual harm.\n\nthose are illegal in most countries. he could face a lot of jail time. in some cases, the penalty is MORE severe than if he were to actually sexually abuse a child.",
				"added": 1571587917
			},
			{
				"comment_id": 401,
				"body": "> [pexo](#comment_166_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): Do you mean because they collected more 2D loli or actually more severe by law?\n\nwell, for example, in the united states, the average prison sentence for CP possession is significantly greater than the average sentence handed out for sexual abuse of a child.",
				"added": 1571595516
			},
			{
				"comment_id": 402,
				"body": "> [pexo](#comment_167_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): Oh, I thought you meant for 2D loli possession specifically. That is true.\n\nwell, 2d is treated the same as child porn in many countries. i may have been rash to suggest those countries have the same disproportionate penalties that the United States does.",
				"added": 1571609267
			},
			{
				"comment_id": 410,
				"body": "> [gasthekikes](#comment_3_1EktdYDuXJcHpK5Aemz3ESXac3SfRp2L8K): Kill yourself you fucking pedophile\n\nsurely your kikes need to be gassed first before you can move on to ending the lives of other groups of human beings",
				"added": 1572449119
			},
			{
				"comment_id": 411,
				"body": "> [quantumkitty](#comment_221_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): No choice for you but to go celibate or just wait for sex robots, I'm afraid. I honestly think sex robots will be the only humane solution for pedophilia, apart from genetic engineering or some kind of brain-rewiring assisted by nanotech.\n\nchild-like sex robots are quickly becoming illegal throughout the world. there are many cases already of people who have been arrested for possession or attempting to import silicon dolls.",
				"added": 1572472239
			},
			{
				"comment_id": 412,
				"body": "> [quantumkitty](#comment_222_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): lolis and celibacy it is, then!\n\nloli is illegal in most places in the world. these last few years, we have also been seeing a massive upheaval in negative attitudes towards it, resulting in a lot of artists being shamed and harassed out of communities, and services all over the net censoring it and changing policies to prohibit it. the websites that remain are often targeted with ddos attacks or with international child sexual abuse material takedown requests (since the UN and many governments in the world treat drawn cartoons the same as photo/video footage of real child sexual abuse).\n\nit's being made very clear that loli is not viewed as something that should be permitted to exist or be looked at. so really, it is either celibacy, or a life in jail. and if you're gonna go to jail anyway, you might as well make the trip worthwhile.",
				"added": 1572472864
			},
			{
				"comment_id": 414,
				"body": "> [quantumkitty](#comment_232_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Damn I didn't know lolis were illegal. That's a meme-tier law right there. [...]\n\nit basically does come down to a form of thoughtcrime. the only countries i know for a fact it's legal in would be japan, certain states in the USA, and spain. i know there's more. but probably not very many more.",
				"added": 1572532948
			}
		],
		"1571488787_1EDsNLHRwPW8Ajp4dScjJaBxXK1bLqHx3Z": [
			{
				"comment_id": 398,
				"body": "that's very normal. on my home machine i changed the ssh port to some random number other than 22 to make them go away.",
				"added": 1571547670
			}
		],
		"1571610384_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 403,
				"body": "try it without the socks proxy. it might be trying to connect to i2p sites using the tor socks proxy instead of the i2p http proxy.",
				"added": 1571618078
			},
			{
				"comment_id": 404,
				"body": "> [cactusdragon](#comment_59_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr): I2P is too slow when not connected fulltime\nthat is why it is recommended to leave it running 24/7\n\n> [xcape2net](#comment_466_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I2P HTTP Proxy: HTTP/HTTPS client 127.0.0.1 4444 Status is starting.\nit's concerning that it says status is \"starting\", and not \"ready\" like the others.",
				"added": 1571682290
			},
			{
				"comment_id": 405,
				"body": "> [xcape2net](#comment_467_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): On 127.0.0.1:7657, it gives maybe 10 i2p sites.  I've tried and failed to connect to most of them.  Isn't adding a subscription to my address book just the same thing as adding bookmarks in a regular internet browser?  How would that affect my ability to connect to I2P websites?\n\nadding sites to your addressbook is more like adding a domain name to your hosts file. it is there so you can access i2p sites using convenient human readable domain names like \"planet.i2p\" instead of their really long b32 address \"http://y45f23mb2apgywmftrjmfg35oynzfwjed7rxs2mh76pbdeh4fatq.b32.i2p\"\n\nthose 10 sites that you see on the router landing page should already be registered in the addressbook though.\n\nif the error you are getting is still \"unable to find the proxy server\", then it is a problem with either how your proxy is configured in your browser, or a problem with i2p's client tunnel for port 4444 not working. this has no bearing on anything in your addressbook. if it was an issue with not having the site in your addressbook, you'd get a \"destination unknown\" or some error like that.",
				"added": 1571699884
			}
		],
		"1571933044_1NBJJWgAdvQkApP8jnD69NiQ5HPNBpmyqU": [
			{
				"comment_id": 406,
				"body": "i think most people who look at that stuff are not very high iq, and so when they decide to post their super illegal things on a decentralized network, they choose to do so on sites they don't have the keys to, and wonder how they get censored and dicked around with. it is seriously in their benefit to just make their own sites for it. but i guess that's too hard.",
				"added": 1571962151
			},
			{
				"comment_id": 409,
				"body": "> [gitcenter](#comment_1161_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Whilst a list of content might be illegal, would a list of hashes be so? Assuming you can't get content or even a link to content by hash.\n\na list of hashes is how the industry does it currently. hashes seem to work great.\n\nthe real problem with the way things are done currently is that a great amount of trust is being put into these big black box child protection organizations to hash images, and we have to trust those hashes are actually illegal/harmful content. nobody knows how many false positives they set off, and nobody knows how much drawn/fictional content is hashed and classified as CP. and if someone asks, they won't answer.\n\nso.... hashes work fine. the process leading to a hashed CP file might not be.",
				"added": 1572188182
			}
		],
		"1571981535_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 407,
				"body": "the answer to your questions is yes, unless you live in a country that does not criminalize looking at or distributing cp.",
				"added": 1572038743
			}
		],
		"1572101168_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 408,
				"body": "i clicked this thread to make sure someone said something about verifying pgp signatures. good job everyone!",
				"added": 1572120681
			}
		],
		"1572513197_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 413,
				"body": "no, pedophiles don't NEED to be cured. if science can find a cure (pro tip: they can't; the only cure they know of is \"lobotomy\"), then sure, that can be made available to those who wish to have it.\n\nhowever, the agency of \"choice\" is out of the question. if society finds pedophiles, they will do what they want to them, without any consideration for the pedophile's human rights. if you invent this mystical cure, it will be systematically enforced on people.\n\nexperts on this subject already know that pedophilia is not something that can be removed from the brain with our current scientific knowledge and understanding of the brain. rather than dream of sci-fi horror that can alter anyone's brain to think and feel in whatever way society wishes them to, can't we look first to problems that are within our reach right now, that can have immediate positive gains?\n\ntoo start, in the other thread, you spoke of lolis and sex robots. those would make good coping tools for those afflicted. i mentioned they were illegal, or becoming illegal. why don't we push that in the opposite direction? let's let those be legal and accessible to those interested. after all, helping your fellow man bust a nut is surely the most noble of pursuits.\n\nanother problem we can tackle is the absolute void of mental health services available for your typical pedophile. i can't walk into a therapists room and go \"hey doc i'm really into little kids\". with no evidence or reason to believe any crime has been committed, i will still be denied service and have the cops raid my home, steal all my electronics, and interview my landlord, neighbors, and emlpoyer about this \"interest in kids\" in a very humiliating and public way. if i'm lucky, and the therapist does not do this, i'm left spending a hundred and fifty bucks a session twice a month to sit in a room with someone who is very uncomfortable with me and who *doesn't even know what to do with me, because there is zero research on this subject, and they have never been trained to deal with someone who has this affliction*.\n\nso right now we have this situation (and i'll choose right here to remind you that most people realize they are pedophiles in their teen years) where we have lots of suicidal, depressed, lonely, sexually frustrated and horny young people out there in the world. they already believe that they are unholy monsters, because society makes it very clear that is how it thinks of these pedophiles. and they have nothing they can do, nowhere to go, nobody they can reach out and talk to, to begin to process or deal with these feelings.\n\nbefore you tell me pedophiles need to be cured (see: lobotomized), can we please start to do something about some of these things first, rather than scare people further into hiding with threats of rooting around in their brains?",
				"added": 1572532274
			},
			{
				"comment_id": 415,
				"body": "> [styromaniac](#comment_1169_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I keep telling them to try psilocybe mushrooms + lion's mane. Paul Stamets has the whole combo in his JRE guest appearance. The idea is to rewire the brain during the trip.\n\ndoes this also cure homosexuality?",
				"added": 1572535761
			},
			{
				"comment_id": 416,
				"body": "> [12681754zuizuftu](#comment_5_1FfVZsqx8Bo1zvBHSen2Z2SYg8UCFPgsoE): Cure already exist, 9 mm. It's cheap and reliable. [...]\n\ni'm glad we have good christians like you to spread the word of our lord and savior jesus christ. unlike all other religions, christianity has never turned a blind eye or supported child sexual abuse within its ranks. let us all stock up on ammunition, and let us all do unto others as we would have them do unto us.",
				"added": 1572537400
			},
			{
				"comment_id": 417,
				"body": "> [quantumkitty](#comment_235_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Keep in mind that homosexuality (the act of it and the idea) is morally viable because you have two consenting adults, unlike paedophilic acts.\n\njust because homosexuality can be ethically actualized, and pedophilia cannot, does not make it more acceptible to use a 9mm against one of these groups versus the other one.",
				"added": 1572561846
			}
		],
		"1573297973_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 418,
				"body": "buddy told me he was going to suicide and i stopped him. his quality of life is a lot better than mine now lol, so i think it was good that he told me... i think he thinks so too... with that said, getting police or suicide hotlines involved can lead to very bad outcomes, so i would caution against them i guess.",
				"added": 1573328517
			}
		],
		"1573794798_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 419,
				"body": "> [goodafternoon](#comment_26_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3): I did some quick research on Lokinet. my conclusion, whats wrong with Zeronet? There is a community here already and seeding is free range and not forced with coin. I would check out apps but I think it wont be long before they are drug over here.\n\nlokinet is not a replacement for zeronet. just like zeronet is not a replacement for tor. lokinet's aim is to replace i2p and tor actually, if i understand the whitepapers correctly.",
				"added": 1573830473
			}
		],
		"1573766934_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 420,
				"body": "lokinet is a network for people who are mindful of their privacy and anonymity. phones privacy violating tracking devices.\n\nif it was a sad money grab, they would focus on releasing on the most popular and widespread platforms possible. perhaps because the project is still in heavily early stages of development they cannot afford their limited resources and development time working to support your expensive toy.\n\nBTW a quick look at their site shows the status of development on the Android Client as \"Initial exploration has commenced. Work remains in its early stages. Expect this to be completed in 2020.\"\n\nand likewise, the status of iOS indicates a 2020 release which will require a significant amount of work to make it ready.",
				"added": 1573830897
			},
			{
				"comment_id": 421,
				"body": "> [styromaniac](#comment_1275_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I should have deleted this thread because I misunderstood it before I was corrected in Loki Public Chat.\n\nah. well, at the very least, you have me interested in seeing where the project's at now.",
				"added": 1573853717
			}
		],
		"1578343451_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": [
			{
				"comment_id": 422,
				"body": "if you block the user who posted something, doesn't that block the upload from showing up for you?",
				"added": 1578346045
			}
		],
		"1578536990_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 423,
				"body": "i think minnesotans need to go back where they came from",
				"added": 1578540063
			}
		],
		"1578947803_1Q3oCEsSUjRyGDFVTvS3Kq8qdp6TVCoGf6": [
			{
				"comment_id": 424,
				"body": "as far as off-the-grid, i don't think zeronet has a formal way to sync data (update sites, download new sites) without a connection to a network (think distributing physical media with ZN site data on it, or otherwise doing it in-person with someone), but that seems like something that can and should be implemented.",
				"added": 1578960633
			}
		],
		"1579050143_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 425,
				"body": "Knowing human nature is to destroy, if the Creator, in His wisdom, created a Gift which could not withstand the abuse and destruction of its users, then He did not create a very good Gift, and perhaps His wisdom was not so great.",
				"added": 1579058167
			},
			{
				"comment_id": 426,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1686_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): all of you, What did you give in return?\n\ni grace this network with my presence. there is no better gift.",
				"added": 1579099480
			}
		],
		"1579144407_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 427,
				"body": "greater social media usage, and personal identity and self-esteem being derived from their online identities and online interactions with others. which undoubtedly are mostly toxic. probably why they're so depressed and suicidal.",
				"added": 1579145076
			}
		],
		"1579643028_14g7RVtCfLt1wQpFcxTVWmwjNduuTywUit": [
			{
				"comment_id": 428,
				"body": "sí yo soy",
				"added": 1579654823
			}
		],
		"1579733691_1KMFhezc9fqBCbWg8xbu6HimdG5nMSQwBD": [
			{
				"comment_id": 429,
				"body": "im certain i came to these networks seeking refuge from the moonbats and the wingnuts. instead of escaping from them, i just found different kinds of moonbats and wingnuts that were slightly less appalling to associate with.\n\neither way, i tip my fedora to you for bringing us news from the front page of the internet.",
				"added": 1579733933
			}
		],
		"1579890249_16cUVejYswnQhxY6LRP6ftoC9WezKzpKbe": [
			{
				"comment_id": 430,
				"body": "pedophilia is defined as the sexual attraction to prepubescents. the homosexuals you are angry about were fucking teenagers. depending on the circumstances, that may be morally problematic, or illegal depending on local jurisdiction's aoc laws. but pedophilia, it is not.",
				"added": 1579901065
			}
		],
		"1580200766_12nzpTjSwUuQJ3KVgEn8DrxWoGEuicrbNS": [
			{
				"comment_id": 431,
				"body": "i know for a fact there are entire communities for hypnotism kinks on retroshare",
				"added": 1580241729
			}
		],
		"1582394078_16cUVejYswnQhxY6LRP6ftoC9WezKzpKbe": [
			{
				"comment_id": 432,
				"body": "i dont know what subforum means in this context, and have no way of knowing whether it can be blacklisted, or how you may do so. is this here on zerotalk? is this on one of the imageboard sites? is it somewhere i haven't heard about yet?\n\nin absence of any relevant details, have you tried blocking the user who created it?",
				"added": 1582408298
			}
		],
		"1582500655_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq": [
			{
				"comment_id": 433,
				"body": "i wish blocklists stayed pure to their purpose. a blocklist for cp/illegal content, a blocklist for \"hate speech\", a blocklist for spammers, etc. instead they all try to do everything at once, as well as blocking users that piss off the blocklist maintainer.\n\ni just manually block things. my blocklist is composed of only a couple users who posted on zerome, a couple appropriately named boards on millchan, and a site or two which get advertised on zerosites (amazed how many cp sites get advertised in official nofish controlled sites, which do not get promptly noticed/removed)",
				"added": 1582519355
			}
		],
		"1582649582_13EafRdDw5sZF42dTn68uDdcssTWKbdauJ": [
			{
				"comment_id": 434,
				"body": "is it ethical to produce a manufactured image of a nude woman?\nis it ethical to produce a manufcatured image of a nude child?",
				"added": 1582701241
			},
			{
				"comment_id": 436,
				"body": "> [deepnude](#comment_2_13EafRdDw5sZF42dTn68uDdcssTWKbdauJ): The app always generate an adult woman body, also if you give a child as input. If you use a child pic you will obtain only a freaking unrealistic body.  If you like this shit you should be castrated! [...]\n\nmy question was not whether or not someone is \"sick\", or whether it was feasible or not, my question was whether it was ethical to manufacture nudes of people.",
				"added": 1582842131
			}
		],
		"1582442446_1JmxhPt4FDP7rTmmaxoKdwTSDhwg5YSatG": [
			{
				"comment_id": 435,
				"body": "running zeronet on a ramdisk would create the behavior you seem to want. it would make for a really poor user experience.",
				"added": 1582762738
			}
		],
		"1583980969_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 437,
				"body": "im incapable of being attracted to anyone over the age of 12. im not sure how im supposed to be anything but single.",
				"added": 1584058225
			}
		],
		"1584164125_1KeJfumP5mjv7jrFKnFaWLt5uQa1vLe62J": [
			{
				"comment_id": 438,
				"body": "no",
				"added": 1584166307
			}
		],
		"1584726498_18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF": [
			{
				"comment_id": 439,
				"body": "thats really lewd, you know that right?",
				"added": 1584735029
			}
		],
		"1584570227_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": [
			{
				"comment_id": 440,
				"body": "im an unremarkable meme, often considered by others as a shitstain and a pox on good taste. im not into IT. im barely smart enough to use computers. i've always gravitated toward decentralized networks, and anonymization networks (zeronet is only one of those things, of course).\n\ni gravitate toward them because free speech is very important to me. i've seen many sites i cared about shut down, kick users to the curb, or be forced to censor themselves to appease advertisers, absurd foreign laws, or the puritanical sensibilities of so-called \"social justice warriors\", even before that term became a thing. ecosystems where users and sites are resistant to the demands of censorship by outsiders are cool and interesting to me and worth exploring. or maybe it's just a weird way for me to cope with grief when i lose another beloved website.",
				"added": 1584737258
			}
		],
		"1584618126_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 441,
				"body": "whatever your feelings on this are, we can all agree that this dog was probably a good boy.",
				"added": 1584738876
			}
		],
		"1584808018_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 442,
				"body": "the reverse is also true: if you already have the tor browser bundle, once tor is running, you don't need the tor.exe from the zeronet bundle, since tor is already running on your system. zeronet (and any other application that supports socks5 proxies or routing through tor) can use it.\n\nif tor.exe provided by zeronet and tor.exe provided by tor were different (modified), that would be very alarming!",
				"added": 1584920444
			}
		],
		"1584935552_1LyiVyfhYN2tEhwMJRCcxEFyBekXbqcMk7": [
			{
				"comment_id": 443,
				"body": "look you can talk about robbing and raping people, and impersonating military and law enforcement, and any other high crimes you are preparing to perpetrate, but the moment you called Trump a retard is the moment you crossed the line. i will now personally see to it that each and every three and four and five letter agency in this wonderful nation tracks you down and robs you of your freedom. nice going, shithead, you really blew it this time.",
				"added": 1584980573
			}
		],
		"1585026249_15NgM1u7cfVeBm4kuHVZ3kQ2a66x35LUKY": [
			{
				"comment_id": 444,
				"body": "if your computer is showing signs of infection you need to follow best practices. it needs to social distance from other computers on the internet. do your part to help flatten the curve.",
				"added": 1585055374
			}
		],
		"1585090638_1nADL2gz5MoAsEjnoARpP4hPTVfBk5ri3": [
			{
				"comment_id": 445,
				"body": "zeronet has a pretty solid resource of lolis and alternative political beliefs. i don't think there is any \"content\" you can find on zeronet that you cannot find on the regular world wide web.",
				"added": 1585090948
			},
			{
				"comment_id": 446,
				"body": "> [problema](#comment_1_1nADL2gz5MoAsEjnoARpP4hPTVfBk5ri3): ok, so zeronet is \"only\" one different way to see the web?\n\nyou don't see the www here. you only see zeronet and anything people put on it.",
				"added": 1585092490
			}
		],
		"1585126326_1HaT5L4XJXR57nzthKTuYUZ1jprSRgK9eU": [
			{
				"comment_id": 447,
				"body": "i mean i would try a library but it might be banned.",
				"added": 1585147998
			}
		],
		"1585212415_19913irDUyBcw4rBHtdPdsMFW5vkqKBTY6": [
			{
				"comment_id": 448,
				"body": "in the interest of fairness i will need to hear both sides of the story before i pass judgement. or at least be given a brief summery on what it is.",
				"added": 1585254269
			},
			{
				"comment_id": 451,
				"body": "man i still have no idea really what it's about. were children being sexually exploited? adult women? adult men? animals? plants? can you commit a sex crime against flora in South Korea?\n\nthe article you linked is devoid of relevant information about what this \"Room N\" thing is. can you explain in very clear language what this is about so we can give you our opinion on it?",
				"added": 1585361904
			},
			{
				"comment_id": 453,
				"body": "> [pepepanela](#comment_2_1Ab3JF91st5kW9WUgKdAcCNZp2E1vYALtT): \"The case, commonly referred to as Telegram Nth Room, has sparked widespread public outrage. Millions of Koreans signed petitions calling for police to reveal the identities of the chat room operator and all other participants.\" [...]\n\nso \"Room N\" exists to build a platform of public support to giver the government more power over its people. sexual abuse is bad, but Korean society must not allow their government to further compromise their human rights just because a scary thing happened that makes them really uncomfortable.",
				"added": 1585498365
			}
		],
		"1585337817_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [
			{
				"comment_id": 449,
				"body": "8/f/tokyo",
				"added": 1585338908
			}
		],
		"1585342480_1HJtxgNm8uvChV6fixT4Y3FiupwfkAjC3d": [
			{
				"comment_id": 450,
				"body": "someone should make a poll, \"do you use zeronet? Y/N\" and spread it wide and far to try to get an accurate count.",
				"added": 1585352238
			}
		],
		"1585426688_1EqH77TNk9ifhhW5MiKPn8P6fbnAF4A916": [
			{
				"comment_id": 452,
				"body": "the world's combined nuclear waste will help promote mutation of the virus.",
				"added": 1585432281
			}
		],
		"1585895340_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 454,
				"body": "coronachan, she-who-must-not-be-named, will get us!",
				"added": 1585931353
			}
		],
		"1585933227_15cApprVFcr1skAkWssq5aAXKa7pDwJJve": [
			{
				"comment_id": 455,
				"body": "if your threat model is severe enough that clicking a clearnet link by mistake can compromise your safety and endanger your life, you need to take security precautions of your own to make accidentally clicking a clearnet link an impossibility. you cannot trust humans to correctly indicate for you which urls are ZN links and which urls are clearnet links.\n\nthese warnings you see on these other networks are *courtesies*, put there by the *human being* who wrote the site, *NOT* something that is implemented on the software or protocol level of the network you are using.",
				"added": 1586216509
			}
		],
		"1586537374_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": [
			{
				"comment_id": 456,
				"body": "i don't want to live to see 30. why the fuck would anyone want to be 75? let grandma die, she's been through enough.",
				"added": 1586557934
			},
			{
				"comment_id": 457,
				"body": "> [styromaniac](#comment_2020_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I've beat you to it. Why 30 and not 50?\n\n30 is already 30 years too late, everyone knows that. except for Biden's campaign team, who really dropped the ball here... what a fucking disgrace",
				"added": 1586562372
			}
		],
		"1587248692_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 458,
				"body": "one advantage that zeronet and other alternatives have over facebook is that they get to meet lots of nutjobs, perverts, and lunatics who should not have been allowed on a computer. in contrast, facebook would only allow your family to connect with their friends, family, and well adjusted members of society.",
				"added": 1587253836
			}
		],
		"1587829097_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R": [
			{
				"comment_id": 459,
				"body": "uMatrix is great for blocking 3rd party (or even 1st party) requests. i don't think it can be configured to redirect a request to a file on your local filesystem, but it can be used to make absolutely sure a file you don't want to load from an external site cannot be loaded from that external site.\n\nanother addon, called Decentraleyes, DOES capture 3rd party cdn requests for /certain/ CDN's, and redirects the browser to fetch those resources from locally copies. this only works for preset CDN's, but the source code is open. you might be able to fork it and modify it to serve the files you want it to.\n\nuMatrix can interfere with Decentraleyes if you block the 3rd party resource, because it precludes Decentraleyes from kicking in and seeing that 3rd party request and then redirecting it to a local file request. so keep that in mind.",
				"added": 1587846713
			}
		],
		"1588020348_195pXnzsSg6hJ24HeN659Ux8cc1eWE9A96": [
			{
				"comment_id": 460,
				"body": "there isn't demand for that here, and no established easy way to make money. this one asshole tried selling cp for bitcoin but i'm confident nobody took him up on that. the people who tried to sneak bitcoin miners in their own zeronet sites were quickly called out and most people figured out how to detect and avoid that.\n\nbest bet is probably sticking to that tasks-for-money subreddit, but i think people mostly pay through paypal and you have to compete with the chinese.",
				"added": 1588048875
			}
		],
		"1589899830_18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF": [
			{
				"comment_id": 461,
				"body": "this eroge developed a notorious reputation for its content. it is worthwhile to archive it. zeronet is about not only decentralizing, but fighting censorship. no one here is the gatekeeper of what should and should not be published. if you do not like that this piece of work exists, you should be **grateful** that eroge has chosen to publish it so that you may have this opportunity to express your contempt. telling him he should not archive it, however, goes against the principles zeronet was based on, and so if that is how you feel, you should seriously reevaluate why you are here in the first place.",
				"added": 1589993390
			},
			{
				"comment_id": 462,
				"body": "> [aassddff](#comment_45_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): Getting the rape scenes, which is what eroge said he was doing, just seems like an excuse to have realistic rape porn with the excuse of preserving information.\n\nwhere did eroge say such a thing? all i see is him archiving the games in their entirety.",
				"added": 1589994338
			}
		],
		"1590041703_19y1ZG2DVeRM65kYxKcLz7MLGTfTfoUWSm": [
			{
				"comment_id": 463,
				"body": "organized crime, i think. supposedly the mafia own a lot of these servers and will rent space out to anyone. law enforcement might be paid off, or maybe doesn't take this stuff very seriously.",
				"added": 1590101198
			}
		],
		"1590345225_14X7YqX1gTpjnnsLEbLfk1V3Wjs8tNztaA": [
			{
				"comment_id": 464,
				"body": "i can't believe there are people who still use the zeronet 8chan bunker",
				"added": 1590358130
			}
		],
		"1590898064_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": [
			{
				"comment_id": 465,
				"body": "let's burn our own houses down in protest! #justantifathings",
				"added": 1590970329
			},
			{
				"comment_id": 469,
				"body": "> [zaron](#comment_114_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): Antifa don't own houses\n\noh yeah they all live in their parents house",
				"added": 1591399406
			}
		],
		"1591131478_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 466,
				"body": "people close to the dnc have been known to fund antifa, as well as coordinate the original blm protests a few years ago. it shouldn't be a surprise in this election year that they had to pull something out of their asses to try to stop trump from getting reelected.",
				"added": 1591148475
			}
		],
		"1591167020_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": [
			{
				"comment_id": 467,
				"body": "i've thought about just laying down on the tracks after dark and waiting for the train. re: helium, i've heard that they mix oxygen in the helium consumers can buy in the stores to stop people from using it to kill themselves. you will need to do research on that. i do not know if it is true.",
				"added": 1591215791
			},
			{
				"comment_id": 468,
				"body": "> [memnoch](#comment_11_1DN3VWX7wRD71B6i3GYvVkBXzJWWUGFb1Q): First get someone to help you, preferably a close friend or family member. Buy a large caliber handgun. Have them hold the gun at the base of your skull. This execution style method is probably painless,  efficient, and effective (we don't want you surviving this and being handicapped for life now do we?) Make sure the safety is off. Next, signal them you are ready to die. Watch suicide tape of Budd Dwyer if you need a visual guide. Happy trails!\n\nthat can inadvertently lead to unwanted homicide charges for their friend or loved ones.",
				"added": 1591226073
			}
		],
		"1591403223_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 470,
				"body": "it seems like large groups of people emotionally riled up in protest tend to start burning and pillaging shit when not met with sufficient resistance. media wants people to believe its extremist nazis or extremist antifa because it helps with their political agenda and gets good ratings.\n\nhowever, it's also abundantly clear that even if the rioting was not incited by nazis/antifa, it would be INCREDIBLY easy for a state actor to radicalize a peaceful protest using antifa/nazi/bogeyman-of-your-choice plants. a state actor might have several reasons to do this, such as creating conditions to support their reelection, creating conditions to stymie their opponents reelection, convincing the public that <insert bogeyman> is part of an organized group of terrorists called <bogeymen> and that this group needs to be formally classified as terrorists in order to justify otherwise unjustifiable extralegal actions to fight against them. or, simply, to take a protest that you don't like, and turning it into a complete mockery of what it stood for. once they start lighting things on fire, you can shoot tear gas and rubber bullets and break it all up.\n\nfuture protests, peaceful or otherwise, should take note of this. it will be VERY difficult to stage one from now on. funny thing is, it doesn't really even need to be a state actor to do this. it just takes a few individuals who decide on their own they want to commandeer your protest and use it for their own purposes.",
				"added": 1591414731
			}
		],
		"1591776814_1EisAdDMyEXWtPiKWM8t4wme5yXX1q9552": [
			{
				"comment_id": 471,
				"body": "silencing someone precludes all of society from educating each other on why what that person said is wrong. censorship is a bad way to handle wrongthink. censorship is also bad in general.",
				"added": 1591820652
			}
		],
		"1591822356_1gn57j2UokAkXvA1VyhkHvKZvg59RoXuW": [
			{
				"comment_id": 472,
				"body": "you can trust me to fuck it all up",
				"added": 1591823067
			}
		],
		"1591900169_1NMBe5SUr5hbYNTzBMuvdBCAxQ81ivWzeL": [
			{
				"comment_id": 473,
				"body": "the owner of the site (which is accepting *user submitted* links to other sites) can choose to delete the link to the alleged child porn. however, no one has the capability to remove the site itself on which the child porn is published.\n\nif you see something you don't like, you may choose not to click on it. you may also blacklist it so you cannot accidentally click it in the future. if it makes you uncomfortable that people can use zeronet to publish content like that, you can opt to simply delete zeronet.",
				"added": 1591907602
			}
		],
		"1591828065_1gn57j2UokAkXvA1VyhkHvKZvg59RoXuW": [
			{
				"comment_id": 474,
				"body": "why do so-called normal people wish to wield power and enforce their twisted will on so-called degenerates? why do they feel so threatened and insecure, that they would go as far as dehumanizing others and equating anyone different from them as \"sex slavers\", \"cannibals\", or purveyors of other horrific crimes?",
				"added": 1591908068
			}
		],
		"1596305258_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 475,
				"body": "don't build a zeronet site that requests 3rd party resources. this means if you made some www personal site, and you want to copy and paste it onto zeronet, you may need to make a few changes to it. when i see requests to third party js, css, or anything of that nature, i'm going to delete your site without giving it a second thought.\n\nalso, instead of sharing a link to a youtube video, or a zip file, or something of that sort, maybe upload it onto zeronet.",
				"added": 1596332134
			},
			{
				"comment_id": 476,
				"body": "> [duck0](#comment_193_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): Are there any built in protections for this? There could be a highlighted banner that warns, or perhaps some kind of overlaid icon that would turn colors/symbols to let you know it's reaching beyond local. Autoblocker/ban for those  wanting absolute security.\n\nyou should know what's on your site. you should know what the .js you are serving your guests is doing to their computer, and what 3rd party fonts and css is being pulled from a centralized 3rd party cdn. no, there is no built-in protection for this. install umatrix and configure it to allow no 3rd party resources on any website by default. or use zeronet in a web browser profile specifically for zeronet, and set a proxy to 127.0.0.1 for all traffic.",
				"added": 1596378710
			}
		],
		"1597726785_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ": [
			{
				"comment_id": 477,
				"body": "i also recommend not posting on imageboards. that one sounds like it doesn't want you posting there for some reason.",
				"added": 1597784269
			},
			{
				"comment_id": 478,
				"body": "> [stopjoggersnow](#comment_2_1JR6zGbCYKJZhN7tvc5qZqnFDgG7wAt8nC): The best way to post on cuckchan is to commit suicide immediately.\n\nTo exit this hell, please select all images with: Pearly Gates.\nPlease select ALL matching images.\nPlease try again.\nPlease try again.\nPlease try again.",
				"added": 1597881906
			}
		],
		"1598537511_15QhKCBKHERPhEpR1DCXx4Ue8VAEiVWXwf": [
			{
				"comment_id": 479,
				"body": "> [bigbadbob](#comment_1133_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Rare?  Like pictures of your mum in the shower?\n\neveryone has those bro they aren't rare",
				"added": 1598559874
			},
			{
				"comment_id": 481,
				"body": "> [onlyrobbery](#comment_1_15QhKCBKHERPhEpR1DCXx4Ue8VAEiVWXwf): the porn that i will publish will be free instead paying dozen of dollars to these \"models\" and i hope this will bring more people to zeronet. Why you should complain about this?\n\ni don't think a single person has complained in this thread. since you ask though, one reason a person might complain is due to the dubious ethics of what you might be bringing onto the zeronet network, given the possible lack of consent by the people in question whose nudes you would be leaking. it's kind of like how people complain about how there is cp on the network, and how that casts a bad light on the network as a whole. since what you are doing is illegal and is also harmful to the people involved and their families, carrying out that activity on zeronet makes zeronet look bad.\n\nto be clear, while i believe that what you intend to do is wrong, i don't really care enough to try to convince you to stop.",
				"added": 1598648992
			},
			{
				"comment_id": 483,
				"body": "> [onlyrobbery](#comment_2_15QhKCBKHERPhEpR1DCXx4Ue8VAEiVWXwf): the files that i'm posting are already public, you can find them with some tricks also in the clearnet (if you use google you will find the site from i'm downloading them). i'm only coping them on ZeroNet, i'm not stealing anything direcly from OF\n\nmost child pornography that gets shared, reshared, and redistributed, are already public and you can find them easily using a few tricks on the clearnet. none of this takes away from the fact that it's illegal, unethical, and causes harm to society, to view, share, and redistribute those files. it also doesn't take away from the fact that bringing that here onto zeronet has the effect of tarnishing zeronet in the eyes of the people who you all want to adopt this technology so badly.",
				"added": 1599576595
			},
			{
				"comment_id": 484,
				"body": "> [onlyrobbery](#comment_3_15QhKCBKHERPhEpR1DCXx4Ue8VAEiVWXwf): zeronet is full of pirated files as OF pics are, but none are complaining about this. pedo stuff is horrible instead, i'm against it, you cant compare this shit with of leaks. these files are already public because the \"models\" already published them on a public place (are not private files) as porn movies filmed by actresses that anyone view on sites like pornhub in an illegal way\n\nso when you say \"nude leaks\" you don't mean images that are private and meant to remain private that have been published by, say, a boyfriend, exboyfriend, husband, or something akin to the fappening where dozens of accounts have been breached and private selfies get published, or anything like that.\n\nyou are saying this is more akin to publishing content that anyone can pay to look at. like publishing somebody's Patreon-only content, or whatever the analogue for these models is.\n\nwhen i read \"nude leaks\" i think fappening, or someone got on their sister's phone and put their images up. i guess i don't really get whatever this is.",
				"added": 1599601111
			},
			{
				"comment_id": 485,
				"body": "> [kaffie](#comment_1140_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): There's a difference between ignoring copyright laws (which are unethical) and spreading private photos of people without consent and moving them out of the person's control. CP is also awful. [...]\n\nno matter how i look at this, it falls into a similar realm as sharing a piece of copyrighted work. it just *seems* more skeevy to do this because of what the individual put into their work. it's natural to feel more emotional about it because it's photography of a person's body, which is a very intimate thing, especially to the model whose body is on display. it also seems more repugnant because this is being done to an individual human being rather than to a big media conglomerate, and i believe there really is merit to restraining ourselves and showing respect for individuals creating art, media, and yes, pornography that we enjoy, whereas there is less merit to doing the same to a soulless corporation.\n\nit baffles me to think of a model doing this and believing that they won't be taken advantage of, that some asshole won't buy her photos and then share them with the public internet. if they genuinely don't know this can happen, if they genuinely aren't aware that this bottomfeeder behavior is commonplace, that really blows, and it would be nice if they knew about this before getting into that line of work so they can take steps to limit any harm that it might cause them.\n\nto put this very briefly though: it's incredibly naive to believe that any data published on the internet is within your control.",
				"added": 1599694783
			},
			{
				"comment_id": 487,
				"body": "> [kaffie](#comment_1141_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): See, you'd have a point if it was something people chose to do. But many women are forced into it due to poverty, trafficking, etc.\n\ngive these women credit. they are not being forced to do this. do not take away their agency or blame what they're doing on men. women are quite privileged to have this as an option. men cannot earn money this way. if there's one thing i'm certain, it's that there's no soul on this earth who'd pay to see or spend time with a cretin like me.\n\ni don't agree with disrespecting them or exploiting them (by resharing their photos to the public, taking away their revenue and control). by that same virtue, i also don't believe in disrespecting them by trying to spin a false narrative that they are being forced against their will to engage in this. these women are adults and are culpable for their own actions and decisions.\n\nbless them for finding a way to profit from their bodies like this! how smart and clever of them!\n\nthey're self employed, make their own hours, have full control over their work, and get to exercise their wits and creativity to market themselves to coomers all across the world! it's not how i'd want a daughter of mine to make a living, but i'll be damned if i don't admire them for making a living without getting fucked by the system most of the rest of us work in.",
				"added": 1599773958
			},
			{
				"comment_id": 488,
				"body": "> [kaffie](#comment_1143_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): That's definitely true for some, especially those in big budget professional studios. But not all cases are like that. There are instances of revenge porn, trafficking, spy cam videos, and indeed private photos/videos that get \"leaked\". It definitely makes it ethically problematic to just have a single \"one size fits all\" response. Ultimately though, what OP is doing (and what other similar things do) is take away agency, profit, and privacy from the women involved without their consent. [...]\n\ni am well aware that there is a difference between the two categories of \"leaks\", and because we decided what onlyrobbery is talking about is NOT a part of the category that includes trafficking, coercion, etc, my remarks were made with the \"model who sells nudes but somebody is taking those nudes and sharing them for free\" situation in mind. as i believe i've already stated, i don't approve of taking these models' work and giving it away for free without their consent. i DO find ethical issues with that. i'm well aware of revenge porn and other types of invasions of privacy and sexual abuses that do befall some women, and i DO certainly find even greater ethical issues with that.\n\nplease don't misunderstand me as having only one opinion about both categories of unethical behavior. i find both unethical, but i find one particularly more heinous than the other, and particularly more damaging to the woman than the other.",
				"added": 1599856950
			},
			{
				"comment_id": 489,
				"body": "RE: \"I wouldn't want my daughter doing this\"\n\nfor me this would be more like my failure as a father in preparing her to succeed in the world. it's not that i would see her as less of a human being, or disown her, or hate or be disgusted by her. if she genuinely wants to do it, and isn't doing it just to survive and get by in the world, i can still sigh and be disappointed that her vision of success isn't on the same wavelength as my own. if she's happy and healthy, that's all that matters, even if i wish she chose something different as her career path.",
				"added": 1599857524
			}
		],
		"1598581805_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e": [
			{
				"comment_id": 480,
				"body": "you live in a much more fantastical world than the one i live in. also please include me in your theory.",
				"added": 1598584640
			},
			{
				"comment_id": 482,
				"body": "> [krombopulusmike](#comment_3_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e): You are new here as far as I am aware, but if your ID can be linked in any way to the others I most certainly will. I am going to begin running stylometric analysis on all future posts that seem suspect as is the case with otbtechh22f4wcuo, zaron, geekless, and kapec. Thugalicious mentioned it as a method to deanonymize persons. It is a largely ignored aspect of anonymity which has actually led to the ID of JK Rowling as the author of a previously anonymous work of literature she had written according to what I found after some research. [...]\n\nfriend, i assure you my involvement in this conspiracy dates back to 2016 around the time i first came here. you'd be able to see this clearly if they didn't have sufficient time to cover up all the tracks leading to this otherwise obvious conclusion. you might have to dig a little deeper.",
				"added": 1598649579
			}
		],
		"1599651874_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 486,
				"body": "that isn't why it's doomed to fail. it's doomed to fail because there is no federated network, there are instead 2 or 3 different mini-federations that refuse to federate with each other, resulting in a most ridiculous clusterfuck of a social ecosystem. i used to think federation was a good thing, but people cannot handle it in this modern social/political climate, so the only true way forward will be fully distributed peer-to-peer networks.",
				"added": 1599695076
			}
		],
		"1600446346_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": [
			{
				"comment_id": 490,
				"body": "can the child, if they choose to do so, disable this plugin of yours and proceed to browse zeronet without its protection?",
				"added": 1600481896
			}
		],
		"1601829627_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 491,
				"body": "i talked to the guy. he sold me some youtube subs. $20 is a very competitive price for that kind of engagement. very quick to hold up his end of the deal. a+++ would work with again. thanks for the recommendation!",
				"added": 1601843721
			},
			{
				"comment_id": 492,
				"body": "> [tomer](#comment_8_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu): are you kidding me? i said that he is a scammer wtf show me a proof\n\nwhere's your proof he scammed you, and why didn't you take it to the police, instead of posting a defamatory post about him and inciting others to committing crimes against him on your behalf? i'm finding this whole thing pretty sketchy. i already alerted him about this posting. he seemed to know who you are, and i think he's preparing to retaliate. you better be careful, and watch what you say about other people online.",
				"added": 1602008375
			}
		],
		"1601914818_1HtdMXVRbEqpADNig6MvbCLQjuNzwDZHYg": [
			{
				"comment_id": 493,
				"body": "how much can a guy make by selling his girlfriend to portuguese sex traffickers, anyway?",
				"added": 1602038064
			}
		],
		"1603385950_129Djo6fqb7fviR6j7SC25e1m5fE4MbCQU": [
			{
				"comment_id": 494,
				"body": "i don't think anybody has been interested enough in any of those topics to post about them or make sites for them here. maybe you can be the first.",
				"added": 1603421245
			}
		],
		"1605027510_15BPbETpjWmZoVdS4YGMg4qWiguXi1ASGz": [
			{
				"comment_id": 495,
				"body": "wake up sheeple!!!!!!!",
				"added": 1605043209
			}
		],
		"1605271593_1NCowyiaL46svaUwek6EbN5dZeFGkzD9uf": [
			{
				"comment_id": 496,
				"body": "i removed them. thank you for alerting me.",
				"added": 1605309268
			}
		],
		"1605962988_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": [
			{
				"comment_id": 497,
				"body": "lean away from centralized services and more towards federated and decentralized solutions. i promise you will see a day where gab and parler, for example, take up the task to censor whatever they consider problematic or undesireable. remember that twitter, too, once heralded itself as a free speech platform.",
				"added": 1605982106
			}
		],
		"1606080511_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": [
			{
				"comment_id": 498,
				"body": "if you don't like the content you see here, make your own. this post you made is a good start. want to be a self righteous social justice warrior? go for it, be a complete asshole about it. make the content and social movements or whatever that you want to see on zeronet. don't fixate so much on all the spam. that spam you see exists on the clearnet too. the only reason you never see it there is because it gets censored. nofish can and sometimes does delete garbage posts on zerotalk, but the fact of the matter is most of zeronet is basically unmoderated and uncensorable, so when somebody says some really stupid or revolting it doesn't get taken down by a team of moderators and algorithms that have been trained to detect garbage.\n\ni'm not sure why you think government spying is a good thing, though. do you really think the ai models these government agencies use to discover and track undesireables aren't biased against people of color or certain religions? they are possibly even more racist than the shitposters who make a mess of this site.",
				"added": 1606081186
			},
			{
				"comment_id": 499,
				"body": "> [nonendoxic](#comment_10_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV): I'm also willing to *bet a number of youWell, that's an unfortunate typo.\n\nyou should be able to edit your original post, but you have to play a game of hide and seek with the pencil icon you have to click to do it.",
				"added": 1606081247
			}
		],
		"1606503160_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 500,
				"body": "same",
				"added": 1606512445
			},
			{
				"comment_id": 501,
				"body": "> [stupidhorse](#comment_6_1EUxRrUu6DfuFtYfeuGJUc4GdTLGj4dunH): You're doing it wrong if you think life is more suffering than pleasure.   Take a hard look at what makes you miserable and change it (or at least escape it).   You've got more control of your own life than you think.\n\nthe only escape from life is death\nalthough i hear good things about drug and alcohol dependency",
				"added": 1606519210
			},
			{
				"comment_id": 503,
				"body": "> [mg0](#comment_388_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): life isn't shit at all, the circumstances at which you exist daily are not your sole responsibility but if you don't try to pull the strings in your favor then every day will be miserable and overall life will be as well. Go out, get some sun, do purposeless stuff as long as you enjoy it, change the direction and your way of living prioritizing joy, even at the expense of security and wealth. Live one day at a time, fully to the end.\n\ni enjoy nothing and when i was getting lots of sun every day it didn't help any, i actually felt worse. there is nothing enjoyable about existence, and words you type onto your screen at me aren't going to alter my experiences, so suck on my hairy nutsack.",
				"added": 1606533860
			}
		],
		"1606531643_1G6LndVZrdXsunwT6CGRScNkK3Gi2nU6RF": [
			{
				"comment_id": 502,
				"body": "whether its boiled or fried, i like medium. its still full of warm gooey eggy cummies but when you bite into it it doesn't spill out everywhere.",
				"added": 1606533697
			}
		],
		"1606619291_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": [
			{
				"comment_id": 504,
				"body": "is this where one can go to lovingly jack off to footage of children being abused and exploited and sexually violated? finally! a place where those who love children can be free to express it!",
				"added": 1606678454
			},
			{
				"comment_id": 505,
				"body": "i love children so much please direct me to the hardcore and snuff sections, i want to watch them cry and bleed, in that order. thank you much in advance, sincerely your average pedophile",
				"added": 1606683278
			}
		],
		"1607087579_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 506,
				"body": "meanwhile, the plutocrat elites who signed off on it plan to go out for regular televised walks.",
				"added": 1607123615
			}
		],
		"1608307048_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": [
			{
				"comment_id": 507,
				"body": "\"i love children so much! i care about children so much more than you teleiophiles ever will, so will somebody please direct me to the hurtcore section?\"",
				"added": 1608332566
			}
		]
	},
	"comment_vote": {
		"13_1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA": 1,
		"2_15EAH8W3qs47ZJ9wsxEakKtwZ238VFeYGt": 1,
		"29_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT": 1,
		"1_18fLf6bqfzvGLvMA2DrEmDxiqvnAWyN6dv": 1,
		"9_1AC3zv2K9eEsm8XpfSirwb13hSdtjHAiu5": 1,
		"106_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE": 1,
		"105_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE": 1,
		"103_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE": 1,
		"8_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": 1,
		"316_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"318_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"9_1vAdpJiyYEHcDZoJn93QcjzaFVKHHPg1F": 1,
		"6_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"3_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7": 1,
		"349_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"5_1EYyJydDBojStVmNxdAVB2iVhVm2H1qwoX": 1,
		"49_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": 1,
		"269_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"1086_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"10_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"12_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"24_1AC3zv2K9eEsm8XpfSirwb13hSdtjHAiu5": 1,
		"7_1PJdxgV79Y1djUi5HMEmtE3HdbGZXuf6oE": 1,
		"28_1DpN91N84piuzYn2iJKM9RK3Ek8JVNjewa": 1,
		"50_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"4_1NuFKUVr8CzANjuu4KvGbfTfaHCVey8xGA": 1,
		"11_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7": 1,
		"13_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7": 1,
		"113_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"5_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB": 1,
		"52_1xf9XC4Nsa7YfQWFiK6xGsNDJA3AaCTUa": 1,
		"143_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p": 1,
		"163_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"178_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"32_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": 1,
		"48_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD": 1,
		"7_127XxNDivWJX4hUWTHGSsiW1xxczYp8cWu": 1,
		"59_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": 1,
		"95_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"38_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"7_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"616_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"19_1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7": 1,
		"1_1NcVwrBpf91ownXuSgYnHBZCWjoiNjw9FP": 1,
		"18_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"21_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"259_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"15_1PyrAjbZiHyfW7jSWeUpDPSeMU7sAJ5HSs": 1,
		"7_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"294_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"295_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"10_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": 1,
		"64_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"70_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"23_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp": 1,
		"679_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"27_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": 1,
		"118_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"226_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"227_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"147_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"165_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"170_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"18_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": 1,
		"114_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1": 1,
		"2077_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1144_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"65_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"1162_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1
	}
}