{
	"posts": [
		{
			"id": "4750ac1a-300f-42a5-93e6-0f8c03118d92",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "ebcadf0e-a333-4098-837b-be95adbd5c46",
			"body": "Looks alright, but whether or not it has gacha/grinding elements WILL make or break it.",
			"time": 1565995975537,
			"files": "[{\"name\":\"Navy.jpg\",\"thumb\":\"18217aac39baa499fbcd5f069a9dcfbda4426418-thumb.jpg\",\"size\":207994,\"type\":\"image/jpeg\",\"original\":\"18217aac39baa499fbcd5f069a9dcfbda4426418.jpg\",\"directory\":\"1DLsWngvEE9sCxqBXLJir7af5SB2TaMZW6\"}]"
		},
		{
			"id": "415bba69-c796-4514-9b2b-2a9eccb38b68",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "b24efb34-fa0a-4ca3-a05a-1ab8f16f3b2a",
			"body": ">>c6b15678-ea3d-4db5-882b-85eabbcfd0a7\nI think it's safe to assume the people who fled to the cake kike's bunker either haven't realized there's a better one, or are of the newfag/crossposter crowd that /v/ desperately needed to be rid of. Anyone know the state of that bunker, by chance? Is it crumbling? Cancerous?",
			"time": 1565996319137,
			"files": "[]"
		},
		{
			"id": "d029f3a4-8870-4155-bb35-81b46171f885",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "5160ecf2-b5ae-4ff1-80bc-b384b7ed27c6",
			"body": ">>8046255a-f7b1-40d4-a690-cba19007209b\nI've been against the Cake Kike since day 1, he only ever got the legacy board because he became friends with Kikewheels. Birds of a feather.\n\nAlmost every decision he has made since making the board has been a terrible one that divided the userbase more, and that's not even counting what the Infinity Next shit did to 8chan. \nMeta threads were such a joke and it was so fucking pathetic see every OP made by Mark boil down to basically \"there are some problems but im moslty pleased and I think everybody else agrees with me so its all good lol im the best\"\nfollowed by hundreds of posts calling Mark out for his shit and telling him what he's doing wrong and he either falls to peer pressure and says \"yeah guys sorry I'll try better\" (of course, he never does, he just says he will) or ignores it completely. \n\nI have no problem with the idea that everybody who praised Mark or did one of those \"le funny ironic\" jabs at him is actually a crossposter or newfag ruining the board as a whole.",
			"time": 1565996726737,
			"files": "[{\"name\":\"mark.png\",\"thumb\":\"8e4ce658bd37ab2fa7a290ecb63894246fa6e4d6-thumb.png\",\"size\":45997,\"type\":\"image/png\",\"original\":\"8e4ce658bd37ab2fa7a290ecb63894246fa6e4d6.png\",\"directory\":\"1DLsWngvEE9sCxqBXLJir7af5SB2TaMZW6\"}]"
		},
		{
			"id": "69d1258f-c8a8-4ac6-9482-ba6f7c0ab859",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "6bb21155-47b8-4db4-96b9-57ccd20d201c",
			"body": ">>f2c66990-bb08-4e83-b81d-389fe07627c5\n>tfw no friends who regularly play Vermintide 2, let alone even own the game",
			"time": 1566083760600,
			"files": "[{\"name\":\"8bc59e7b738f88661b5f50010cbb701546960d502e0d0cfb129ec4863331dfbc.png\",\"thumb\":\"1748df4e3532f64d355840184858eaf4088c2259-thumb.png\",\"size\":142318,\"type\":\"image/png\",\"original\":\"1748df4e3532f64d355840184858eaf4088c2259.png\",\"directory\":\"1DLsWngvEE9sCxqBXLJir7af5SB2TaMZW6\"}]"
		},
		{
			"id": "b302f872-7dc3-496c-9d94-adad4c42c1b9",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "ebcadf0e-a333-4098-837b-be95adbd5c46",
			"body": ">>60e96433-daf5-435a-9a5f-d7104c6dc31a\nYour images aren't loading, anon.",
			"time": 1566084413279,
			"files": "[]"
		},
		{
			"id": "30c974ef-dd0e-4d37-b6c9-c80d370fd3cd",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "1beea61a-1677-4ad1-b6ee-98de14f0977c",
			"body": "Does anyone else have pic related but in a better resolution? Something like 1920x1080 should work but any higher would be amazing.",
			"time": 1566169340500,
			"files": "[{\"name\":\"ec74dd49383e17726a1f0090b5242cf5.jpg\",\"thumb\":\"9352376d2c2989dfb4f9b5d6d8f5a659996a6317-thumb.jpg\",\"size\":154384,\"type\":\"image/jpeg\",\"original\":\"9352376d2c2989dfb4f9b5d6d8f5a659996a6317.jpg\",\"directory\":\"1DLsWngvEE9sCxqBXLJir7af5SB2TaMZW6\"}]"
		},
		{
			"id": "dd8ac629-cbbe-43aa-ba23-a505df5406d0",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "1beea61a-1677-4ad1-b6ee-98de14f0977c",
			"body": ">>e9a5426e-b6e3-44ce-a78a-1b118924b79c\nI swear that I did. I used both bing and google but I suppose I just didn't use the right keywords. Regardless, thanks much.",
			"time": 1566179054174,
			"files": "[]"
		},
		{
			"id": "55f4c4bf-6cd6-4ea6-9040-895b058cc513",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "2e1bf21f-0cae-46f8-b73a-894247c52e4d",
			"body": ">>b8f805f4-5e49-49b9-a58c-8094053c058d\n\"After confessing to these things they had been pardoned, reinstated in the party, and given posts which were in fact sinecures but which sounded important [...] No one who had once fallen into the hands of the Thought Police ever escaped in the end.\"\n\nYou're assuming that these small 'fractures' in speech or otherwise which go against the status quo of acceptability in society will end up actually reaching the ear of the corporations which are controlled by Jews full-stop. Even if it does, don't always assume that they'll quit providing for you if you rely on them for supplies and such. \n\nYou know how a company - a game company for instance - really WILL lose their money? If nobody buys their fucking product. The consumer, in the end, holds all the cards. It doesn't matter if you're on the good side of your suppliers or even the ResetEra kikes crowd (who don't even make up 1% of the video game consuming public, I'd reckon) when the vast majority of your fanbase refuse to consume.",
			"time": 1566344542844,
			"files": "[{\"name\":\"b343a0310c9d3c9d2b0401b2d2448f6f3b2dc47a437211ba1de85fa8a653571f.jpg\",\"thumb\":\"dffb1c8dee08e411b0a088047bb2edc541be5080-thumb.jpg\",\"size\":49609,\"type\":\"image/jpeg\",\"original\":\"dffb1c8dee08e411b0a088047bb2edc541be5080.jpg\",\"directory\":\"1DLsWngvEE9sCxqBXLJir7af5SB2TaMZW6\"}]"
		},
		{
			"id": "ef0ec73b-a0fd-4e00-8558-78469bb3982a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "8d56ec27-d0c9-4484-ac77-3be7ab13724a",
			"subject": "sage",
			"body": ">>427115af-bbe4-4779-a5c8-518479cf2915\nI was once in a bout of depression when I was in my early teens. I was a frequent browser of 4chan's /b/ and /new/ back then. \nIn one of the threads on there - can't remember which board and what the thread it pertained to - people started getting on to very depressing topics. Didn't help that I was already very depressed, mostly brought on by the decrepit state of the world at the time. I felt like shit, and was really asking what the point of it all was. I had taken the black pill in full force. Then some kind anon in the thread convinced me and got me out of my bout of depression, and to this day, I remain faithful, optimistic, and most importantly, resolute in my purpose. You know what he said?\n\n>If you kill yourself, the Jews win.",
			"time": 1566344911344,
			"files": "[]"
		},
		{
			"id": "663de928-10b4-497f-8c67-3b7fe79cac37",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "b24efb34-fa0a-4ca3-a05a-1ab8f16f3b2a",
			"body": ">>f64e61dd-9431-4f05-96d6-5cbe020b3a6c\nDo you mean prevent Zeronet from starting in anything but TOR? How is that done? Cause TOR isn't recognized as a browser and every time I open Zeronet, my default browser opens instead.",
			"time": 1566618596582,
			"files": "[{\"name\":\"5f03ebd0ad3df93dd8cede60b6e0a88427e4befe58b2f6702cc7ad4259188d2f.gif\",\"thumb\":\"9800d5d74db15dc3c51c28978fa87c6c81fb7b78-thumb.jpg\",\"size\":2636910,\"type\":\"image/gif\",\"original\":\"9800d5d74db15dc3c51c28978fa87c6c81fb7b78.gif\",\"directory\":\"1DLsWngvEE9sCxqBXLJir7af5SB2TaMZW6\"}]"
		},
		{
			"id": "aae5640a-9deb-40a8-a5bc-c1779b92c835",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"subject": "Return of Gamenight: No Semitics Edition",
			"body": "I think this board could use some more unity. There's no better a way of doing that than getting a gamenight started. Since the board is so slow, I think it would be beneficial to schedule this out a week or two (or three) in advance. \n\nLet's get a list going for things we'll need to iron out before the actual game night.\n\n1. What game will we be playing?\n2. When?\n3. Who will host? \n\nI'll put a few names out for possible games, but go ahead and suggest your own ideas. Just keep in mind that the smaller and easier to access, the better. Nobody really wants to download 10's of gigs and go through hoops to play a multiplayer game for one night. \n\nI know that hosts are in short supply, but a backup host for every primary host is worth  the effort. Or, depending on the game, an existing dedicated server - preferably free of normalfags - will suffice. \n\nPossible games: \n>Team Fortress Classic\n>Star Wars Battlefront (not EA shit)\n>Dawn of War\n>Killing Floor (1)\n>Day of Defeat (Goldsrc)\n>CS 1.6\n>Serious Sam\n>Left 4 Dead Versus",
			"time": 1566661779436,
			"files": "[{\"name\":\"eaa2bacbe7e8c02dd2864d0effeb94fdf1da6279afe094c72c7708794b91d781.jpg\",\"thumb\":\"5d72095f4d307c2a4e132e3517cb9cf1ae6d4a88-thumb.jpg\",\"size\":234634,\"type\":\"image/jpeg\",\"original\":\"5d72095f4d307c2a4e132e3517cb9cf1ae6d4a88.jpg\",\"directory\":\"1DLsWngvEE9sCxqBXLJir7af5SB2TaMZW6\"}]"
		},
		{
			"id": "bd70ad2e-41ef-4454-b2d0-1c85f0734998",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "6c2239f9-50bc-4273-a79d-abe4bbffb537",
			"body": ">>e02bdd41-21c1-4620-883f-b379c331ace5\nWhat the fuck do you mean that 6 and 7 and 8 are mediocre? The GBA fire emblem games are golden. Babby's first Fire Emblem is the DS and 3DS shit (with the exception of Echoes). \n>fun ones\nI hope you're not referring to 4 or 5, those two definitely aren't fun at all, and I wish I could get back the time I spent playing all of that. I also don't think the gamecube games are very fun, either. Radiant Dawn even has a section where you NEED to have the foresight to bring a hammer or some anti-armor weapon and give it to Ike or else you ''will not'' win and are forced to go back three levels (provided you have a saved spot in the first place).",
			"time": 1566738962024,
			"files": "[]"
		},
		{
			"id": "05385c2f-4a90-4d2d-847c-ed5eb1f26330",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "6c2239f9-50bc-4273-a79d-abe4bbffb537",
			"body": ">>c8acfdca-b96a-4ec8-8071-80caccbcf817\n>they aren't made for people who don't use their tools to the fullest\nWhat does this even mean? Are you referring to inheritances? Because that's also bullshit. Unless you're familiar with the game beforehand or have read a strategy book or watched some youtube videos explaining it, you could go through the entire game and be unaware of how the inheritances really work, and even then, it's almost complete guesswork as to how the legendary weapons are obtained. Not to mention how the recruitment for some characters are absolutely pants-on-head retarded, so you would be quite literally clueless with certain characters. \n\nI'll use an example. Did any of you realize how to recruit Arya? You had to completely pass by her with Sigurd, go to the castle, then go all the way back to talk to her with Sigurd. All while Arya is attacking one of your own units, and unless you had the luck of the gods, you wouldn't have recruited her without losing a unit, let alone figure out the process at all. \n\nOh, and dare we forget the forced unit death level? Not talking about when Sigurd and co. dies. The one that comes afterwards. \n\n>>0a568e25-5e88-4983-b4ff-2d5b6fc4245a\nEchoes was fine, and that was on 3DS, though some levels, notably the earthquake ones, were ridden with bullshit all over, not to mention that level with the antagonist wizard who is unkillable and you don't even know it. \nThe NES games are an abomination and I haven't met a single person to beat them who didn't do so just for bragging rights and to seem 'hipster'.",
			"time": 1566764936064,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}