{
	"next_topic_id": 12,
	"topic": [
		{
			"topic_id": 1554985622,
			"title": "Julian Assange arrested",
			"body": "http://news.met.police.uk/news/arrest-update-sw1-365526",
			"added": 1554985621
		},
		{
			"topic_id": 1556721802,
			"title": "VanityGen",
			"body": "Hi, \n\nI was following this tut: http://127.0.0.1:43110/13x71nc7fju6afMqpEPfcu3Gx9Z5hNhH48/?Post:5:How+To:+custom+ZeroNet+addresses+using+Vanitygen+\n\nAnd I wondered, can someone use vanitygen to find the priv key of your website to modify it against your will ?",
			"added": 1556721800
		},
		{
			"topic_id": 1556966006,
			"title": "How to create a thumbnail ?",
			"body": "Hi, \n\nI'm creating a Zite but I have no idea on how to create a thumbnail. This is important because if I have to display the images in smaller version instead of thumbnails, the images will be downloaded and since there will be a lot, it will weight a lot, making the \"optional\" side of these images kind of useless. So how could I do that ?",
			"added": 1556966003
		},
		{
			"topic_id": 1557421253,
			"title": "Is using Tor Browser really safer on ZeroNet ?",
			"body": "I just checked and apparently ZeroNet can't work without JavaScript so NoScript has to be disabled, and I doubt there is any use for HTTPS Everywhere for ZeroNet considering the server is on localhost. So basically, is having a common user agent for Tor service users worth letting every single script enabled instead of, say, having a Waterfox with privacy settings activated along with a few extensions to block specific tracking stuff. Or, considering it's unwise to install extensions on Tor Browser because that would make your track easy to identify, why not just install these extensions to block specific stuff on Tor Browser considering you shouldn't worry about specific method to find out who you are when scripts are enabled anyways ? \n\nTL;DR, is using Tor Browser with Tor enabled really important on ZeroNet / good enough to feel safe ?",
			"added": 1557421249
		},
		{
			"topic_id": 1557505878,
			"title": "It would seem Firefox doesn't handle ES6 classes anymore ?",
			"body": "Here's the zite I'm talking about: \n\nhttp://127.0.0.1:43110/1DoxbinuaNEdDagSpPmbCEkKHB1FW9RzzJ/\n\nIf you test it on Chrome / Chromium ( I tested it on Brave and Dissenter ), it works perfectly. However, if you test it on Firefox ( I tested it on Tor Browser, Waterfox and Firefox, the last two are fresh installs ), nothing works anymore. You can't select an user, nothing. Now if I go in the console, it would seem Firefox doesn't handle ES6 Classes, which is weird because it should be supporting them since the version 45 released in 2016: \n\nhttps://caniuse.com/#feat=es6-class\n\nNow here are my two problems: \n\n1. ZeroChat uses ES6 Classes, infact the Zite I gave you is built using ZeroChat's base code, meaning that if my assumption is right, the ONLY tutorial we have to create a Zite doesn't work for Firefox \"anymore\". \n\n2. How does one fix this, for example with the Zite I gave ? Or is maybe the error coming from somewhere else ? But there again, I doubt it's coming from the code, since Chromium browsers handle it perfectly.",
			"added": 1557505873
		},
		{
			"topic_id": 1558187649,
			"title": "How do I know if my computer can run Qubes-Whonix efficiently ?",
			"body": "Hi, I don't know if my computer can run Qubes-Whonix which is something I have to know before removing my Windows/Debian dual boot for it. \n\nMy Computer: HP x360 310 G1 PC\nMy processor: Intel(R) Pentium(R) CPU  N3530  @ 2.16GHz (4 CPUs), ~2.2GHz\nMy RAM: 4GB. \nNo graphics card AFAIK. \n\nDo you think it could run Qubes-Whonix ?",
			"added": 1558187643
		},
		{
			"topic_id": 1560245103,
			"title": "I have zero clue how ZeroNet handles DBs and there is zero doc about it.",
			"body": "Okay so here's the thing, \n\nIn the json table in my DB, I added a \"test\" column which is in Integer. All I wanna do is for example this query: \n\n\nthis.cmd(\"dbQuery\", [\"UPDATE json SET test=40 WHERE directory='users/\"+site_info.auth_address+\"'\"]);\n\nBut it won't change the DB. Needless to say, site_info.auth_address works. There are no errors. \n\nI also tried doing this by adding a \"test\" field in the data.json, then writing and signing it but while the test field and its value appear in the \"data.json\" and I've specified: \n\n\"to_table\": [ \n        {\n          \"node\": \"test\", \n          \"table\": \"json\"\n        },\n\nin my dbschema, it still won't fucking work. Can anybody tell me how the f*ck I'm supposed to set and update a value in my DB ? \n\nI don't know how the f*ck I'm supposed to try building stuff with a doc this empty and no error message...",
			"added": 1560245096
		},
		{
			"topic_id": 1560340344,
			"title": "Why doesn't this work ?",
			"body": "Hi, I have no idea why but my DB won't update with the value it's been given. The \"amount\" field in the json table gets updated once I rebuild the DB, but the \"history\" values never get in. \n\ndata.json: \n\nhttp://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3_1\n\ndbschema.json: \n\nhttp://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3_0\n\n\nAny idea what's wrong ?",
			"added": 1560340336
		},
		{
			"topic_id": 1562074727,
			"title": "How to communicate with another Zite ?",
			"body": "Hi, \n\nOn one of my projects I need a Zite to have a frame that loads another Zite or to, if it can't be done, communicate with another Zite. I tried the open() function and it didn't work ( \"Not allowed to load local ressource\" ). I heard the iFrames don't work inside ZN ( Forgot where I heard that ). So is there any solution for what I'm trying to achieve ?",
			"added": 1562074718
		},
		{
			"topic_id": 1589077573,
			"title": "[Zite Creation Help] Content too large 369838729B > 10485760B, aborting task...",
			"body": "Hello, I'm having some trouble getting my big files to get signed when I upload them. Small files upload work. Here is my data/users/content.json: \n\n{\n \"address\": \"1PirateSKGpEyoC54CgD17B9c7YkhkgSYA\",\n \"files\": {},\n \"ignore\": \".*\",\n \"inner_path\": \"data/users/content.json\",\n \"modified\": 1588990025,\n \"signs\": {\n  \"1PirateSKGpEyoC54CgD17B9c7YkhkgSYA\": \"HHLzfi5R3msDWwOt51A8j06YIhsiCxQ6Bz1MxvoVqTjJesMSJ/Cydh9cvBThXnFhEfyWFJ7qljGwZm7gaXn07aI=\"\n },\n \"user_contents\": {\n  \"cert_signers\": {\n   \"zeroid.bit\": [\"1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz\"]\n  },\n  \"permission_rules\": {\n   \".*\": {\n    \"files_allowed\": \"data.json\",\n    \"max_size\": 2000000,\n    \"max_size_optional\": 100000000000\n   }\n  },\n  \"permissions\": {}\n }\n}\n\nDo you know what may be the problem ?",
			"added": 1589077563
		},
		{
			"topic_id": 1595606009,
			"title": "Any ZeroUp alternative ?",
			"body": "ZeroUp only accepts files 10mb+. I'm looking for a file host that accepts file as tiny as small torrent files. It's for easy-to-use file hosting on ZeroNet for future users using my Zite. I could theorically create my own file host, I've done that in the past, but I believe it'd be way simpler to use/adapt an already-existing service. So, any idea ?",
			"added": 1595605998
		}
	],
	"topic_vote": {
		"1554266804_1KtR9NFPH7Gh9ksrWEBJ5Dq8H7DsjBBU1A": 1,
		"1554985622_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"1556958282_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1556966006_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"1557256051_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"1557261503_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": 1,
		"1557278450_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1557408522_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX": 1,
		"1557414212_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": 1,
		"1557322935_16ZCQBFxyQeTZfA4jYSYacesYmKkM4jLT4": 1,
		"1557421253_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"1557505878_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"1558916843_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1558853136_1FQBuG1FKTEyYgwmGJmRCQ811mH2EjfBKp": 1,
		"1556721802_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"1560138110_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": 1,
		"1560112205_159A9mgy8Rj1VR6hVoen597LKFZYuvU722": 1,
		"1560020808_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1560049831_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1560245103_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"1559759030_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1560340344_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"1560284215_1NFEZa8hNrGfpw1EK4yRPWVquQJi59pMV7": 1,
		"1558494867_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1560368932_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1560684873_1AqPs23HT3V8rwqey5F5bXsLMUZUmcMnep": 1,
		"1560862969_1FqSXCYG7aTFqtAbtRi1qQ7ZEprgpdEd75": 1,
		"1560988180_1CKKbdH99PeFfraMKFZNmCMAUsTfTQxsKU": 1,
		"1560984606_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1561066486_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ": 1,
		"1561855919_1ABh5GNgSYM9rgGQfbtVpJhYEzmaCCyRVK": 1,
		"1565185775_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": 1,
		"1565213051_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"1565463652_15SUXePqGofTgevJbv9FAJequ5TxKkBMMM": 1,
		"1566642594_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1566248008_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH": 1,
		"1566845376_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1566939301_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1566858736_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"1571820482_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1569353016_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1583438031_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY": 1,
		"1582649582_13EafRdDw5sZF42dTn68uDdcssTWKbdauJ": 1,
		"1581695503_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": 1,
		"1586956972_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"1589055412_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R": 1,
		"1589077573_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"1595502249_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7": 1,
		"1595194844_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": 1,
		"1595606009_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1
	},
	"next_comment_id": 88,
	"comment": {
		"1554266804_1KtR9NFPH7Gh9ksrWEBJ5Dq8H7DsjBBU1A": [
			{
				"comment_id": 1,
				"body": "The thing is we really need a bigger userbase, if we had that there'd be a lot more content.",
				"added": 1554277321
			}
		],
		"1554143647_1Cj5g289VvLkA7tsv7ewLKLpUYSnz3Ut4C": [
			{
				"comment_id": 2,
				"body": "> [satoxyn1](#comment_40_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): How did you discover ZeroNet anyway?\n\nIt would be cool if there was a poll on the ZeroHello page for us to know how most people hear about ZeroNet so that we know how to let more people know about it.",
				"added": 1554278733
			}
		],
		"1554985622_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 3,
				"body": "> [nickwa](#comment_104_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): ALERT - YOUTUBE SUPPRESSING THIS VIDEO http://127.0.0.1:43110/big.kopykate.bit/?Video=1555006800_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj (Julian Assange) Clearnet link: https://youtu.be/ADP8GfVxpUE\n\nSeriously everybody should save and share this, both on Clearnet, ZeroNet and all the networks you can think of.",
				"added": 1555022205
			},
			{
				"comment_id": 4,
				"body": "> [deadfwd2018](#comment_11_19DoHhKBBkfpbVjRyo5mvdJVTqK96xZyYr): Spend a trillion dollars on intelligence work then have some tranny leak the shit to some dick on the internet... yes, lets protect the dick? wtf? I, in no way like ANYTHING in the leaks, but we paid for that shit in the USA. F* him.\n\nRather have someone leak the BS than have the BS tbh.",
				"added": 1555049253
			}
		],
		"1556721802_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 5,
				"body": "> [ztz](#comment_24_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc): Well, anyone can find your private key by guessing, they just need a (read very sarcastically) 'small amount of time' to do so.\n\nDoes that mean that no webzite is really secure ?",
				"added": 1556722337
			},
			{
				"comment_id": 6,
				"body": "> [ztz](#comment_25_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc): see the link i just added\n\nJust saw it. The fear that I had was that if we used vanitygen twice for the same keyword, it would try the same combinations and thus come up with the same result on both tries. I just tested it, and it doesn't, I came up with different results so it's all good.",
				"added": 1556722761
			}
		],
		"1556966006_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 7,
				"body": "> [glightstar](#comment_126_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): Not quite sure where the exact code is located to create the previews (I think it is this (GitHub), but you could check out ZeroMe's code on GitHub. I believe it works by creating a very low-res copy of the image in form of a data-uri and then that gets added to the post when posting. So you \"just\" have to search for the function that does that .. in the source code. [...]\n\nThanks I created a topic on kxoqa. The thing is I have 0 idea how I'm supposed to use something written in coffee script ? I know nothing about that language so I can't really convert manually either. I'm gonna search in the source code of other websites for now.",
				"added": 1556971058
			},
			{
				"comment_id": 8,
				"body": "> [styromaniac@kxoid.bit](#comment_5_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): I use a couple apps on Android to make thumbnails: XnConvert and QReduce Lite. [...]\n\nCan thumbnails be created automatically with these ?",
				"added": 1556978875
			},
			{
				"comment_id": 9,
				"body": "> [pigpog](#comment_18_1NVpW6BGgWn3oPYAjvsVjyHoBqApQpsJaP): you could maybe use some client-side javascript like Jimp\n\nI'd rather avoid using these kind of tools to have a code I can understand and use anywhere, I guess I'll use that if there isn't a single possible solution which I guess there is considering other zite creators managed to create thumbnails ( Even though the only examples I've found created several thousands of lines of framework for their zite which don't result in functions usable outside of their code ).",
				"added": 1556985044
			},
			{
				"comment_id": 10,
				"body": "> [glightstar](#comment_129_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): I am currently working on a small example zite for you and ssdifnskdjfnsdjk@kxoid.bit's question :)\n\nAh thanks man, can't wait to see that. You sound experienced at creating Zites lol.",
				"added": 1556988079
			},
			{
				"comment_id": 11,
				"body": "Obviously, like ZeroMe, Millchan has a fucking fat framework... I can't get Jimp to work. It always throws an error, doesn't tell me what the error is, just that there is an error and it ceases to work. How the fuck am I supposed to debug something if there's no error message... I'm stuck. I tried everything and that's precisely what doesn't work. I guess the solution IS to write a multiple thousand of lines framework to resize a fucking image.",
				"added": 1556996704
			},
			{
				"comment_id": 12,
				"body": "> [glightstar](#comment_136_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): Here are the two repos I created (the links are in order of importance for this question): [...]\n\nEh fuck this I'm not a god at programming in JS. This is all way too complicated and I only have a few hours ( Max 12 ) per week to work on that stuff. I can't believe there isn't a way to end up with just a \"file2 = thumbnail(file,100,100);\" kind of function. There should atleast be some API commands to do basic image manipulations when we can't use PHP... No wonder there are no content creators on ZeroNet when the API/guide are so empty I can't even create a fucking thumbnail without having to learn and understand dozens of functions from a half-dozen of classes. Even with your example I had to read most of the stuff to know that I needed to import Class, PNGEncoder and Uploadable, adapt my code to them, finding out how to use every single needed Uploadable functions ( dataURLtoFile, handleUpload, handleUploadClick and resizeImage ), what they needed and how to call them only for both the way the API needs to be used ( AKA your mainloop needs to be a class ) and JS' scope works ( AKA apparently you can't call other class from your class... ) to fuck everything up. Now the hours I spent learning and restructuring everything is worthless if I don't spend a good 50 hours to recreate the zite from zero and restructure everything. To have thumbnails. It would seem my zite won't have normal thumbnails and fuck people's diskspace I guess. \n\n> [duende](#comment_23_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): You are a retard, no one is going to seed your site. Fuck off.\n\nAtleast I'm working and doing something with my life instead of just going on forums to call people's stuff bad, retard.",
				"added": 1557017566
			},
			{
				"comment_id": 13,
				"body": "> [glightstar](#comment_137_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): Just to clear any potential misunderstandings on the matter of the code in the repos: [...]\n\nYeah I guess I'll have to end up creating a repo :/ While I do it, here's the problem: \n\nWhatever file I give \"resizeImage\", it outputs me that its size is 0 and create no file, any idea why ? I call it that way: \n\nUploadable.prototype.resize = function(file,nextWidth,nextHeight){\n\tconsole.log(\"INPUT O3\");\n\tconsole.log(file);\n\tthis.resizeImage(file, nextWidth, nextHeight, function(image_base64uri, width, height){\n\t\tconsole.log(\"Resized\", width, height);\n\t\tif(image_base64uri){\n\t\t\tconsole.log(\"PRESENT\");\n\t\t\tthis.handleSave(image_base64uri, width, height);\n\t\t}\n\t});\t\t\n}\n\nindex.html: \n\nif (file.type.match(/image.*/)){\n        page.upload = new Uploadable(page.handleUpload);\n\tpage.upload.resize(file,100,100);\n\nConsole: \n\nINPUT O3\nFile {name: \"test.png\", ... size: 393112, ...}\n[Uploadable] Resize image loaded\n[Uploadable] Size: 0 bytes\nResized 75 100\n\n\nThe log \"PRESENT\" is missing which I guess is normal.",
				"added": 1557065651
			},
			{
				"comment_id": 14,
				"body": "> [glightstar](#comment_141_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): You can use single ` around one-line-code or use ``` around multi-line code (additionally you may provide the language by directly appending that to the opening, e.g. ```javascript) for correct code formatting (it's markdown) ;) [...]\n\nTold ya, I wanna come up with a simple function to resize images, but the first priority is to get it all working. Using handleUploadClick didn't solve the problem, it still logs \"0 bytes\", meaning there's either a problem with my images, very unlikely your code ( It works for you so I doubt it ) or the way I implemented it. I'm gonna mess with all of it and tell you if I got it working.",
				"added": 1557126301
			},
			{
				"comment_id": 15,
				"body": "> [glightstar](#comment_143_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): You can clone the zite as described in its README.md and test if there maybe is an issue with your browser not liking the canvas stuff (uploading only works if zite owner). [...]\n\nI feel so fucking retarded. You were right, canvas were blocked. After hours of work my thumbnails are finally WORKING. I guess someday I'll try to make it work for more format / videos but not right now, I'm done with this stuff lol. Now I'm gonna work on a way for people with canvas activated to generate thumbnails for people who don't have them activated if they agree to. I'll also try to make the function \"resize\" that I created easier to setup and use. \n\nThanks so much for all your help. Any way to contact you so that I can show you the finished version once it's done ( ZeroMail for example ) ?",
				"added": 1557152237
			},
			{
				"comment_id": 17,
				"body": "> [quantumworld](#comment_421_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): You might want to try this program. http://converseen.fasterland.net/ Its FREE!!Its free a bit strange to use but LOTS of options!You will be creating thumbnails like a pro in no time.A how to use video guide.https://www.youtube.com/watch?time_continue=7&v=F5wz0aQTUFQ\n\nIt doesn't look like it has a JavaScript API ?",
				"added": 1557278182
			},
			{
				"comment_id": 18,
				"body": "> [glightstar](#comment_144_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): Yeah, just hit me up on ZeroMail (please tell me here, if you do so, as I don't check that regularly)\n\nAlright it's more or less finished and ready to be published. I sent you the address on ZeroMail, tell me what you think of it :)",
				"added": 1557278400
			}
		],
		"1557261503_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": [
			{
				"comment_id": 16,
				"body": "I think you inverted Green and Red... 100% upvote is full red and 100% downvote full green lol. Other than that, really great job dude, wp.",
				"added": 1557262681
			},
			{
				"comment_id": 19,
				"body": "> [duck0](#comment_47_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): Also, could you document how you created the project and where you learned it from? I'm interested in developing ZeroNet sites and I'm not sure all the capabilities of the platform.\n\nOh boy, you're in for one wild ride lol. Here's a good tutorial to get started: \n\nhttp://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:43:ZeroNet+site+development+tutorial+1\nhttp://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:46:ZeroNet+site+development+tutorial+2\n\nHow to create a zite: \n\nhttps://zeronet.readthedocs.io/en/latest/using_zeronet/create_new_site/\n\nAPI: \n\nhttps://zeronet.readthedocs.io/en/latest/site_development/zeroframe_api_reference/\n\nStrucute of content.json and dbschema.json ( You'll understand when you'll need those ): \n\nhttps://zeronet.readthedocs.io/en/latest/site_development/content_json/\nhttps://zeronet.readthedocs.io/en/latest/site_development/dbschema_json/\n\nHave fun and don't hesitate to ask questions on ZeroTalk.",
				"added": 1557278817
			},
			{
				"comment_id": 21,
				"body": "> [duck0](#comment_52_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): I've been looking to kick back, relax, and read some docs. Thanks.\n\nWell now you've got some stuff to read lol, you're welcome.",
				"added": 1557318564
			},
			{
				"comment_id": 22,
				"body": "> [duck0](#comment_52_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): I've been looking to kick back, relax, and read some docs. Thanks.\n\nWell now you've got some stuff to read lol, you're welcome.",
				"added": 1557318595
			}
		],
		"1557278450_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 20,
				"body": "Here's the big growing project: \n\nhttp://127.0.0.1:43110/big.kopykate.bit/\n\nAnd here's the YouTube that's a bit more established: \n\nhttp://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/",
				"added": 1557278952
			},
			{
				"comment_id": 29,
				"body": "> [asiatravel](#comment_1_1y718nZdJYbnJz9kcGRrAoQL1vjeB4mJy): How does it works? I simply tried to upload a video to test kopykate, but even 18 hours after sent a video of 10mb, I can't yet watch it. Any guide about how to use or set zeronet for kopykate works fine?\n\nThat's weird, what's your video ?",
				"added": 1557575368
			}
		],
		"1557256051_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 23,
				"body": "> [duck0](#comment_45_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): I hope Gab strips out all tracking and bullshit and is a pure project based on creating the best technical project.  [...]\n\nChromium forked into Brave forked into Dissenter forked into something, lel.",
				"added": 1557318809
			}
		],
		"1557408522_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX": [
			{
				"comment_id": 24,
				"body": "Not a fan of P2P, it's risky ( Yeah I know ironic considering I'm using ZeroNet ). I don't know why people don't just download an extension such as Flash Downloader, go to streaming sites, start the movie/episode and then just straight up download it using the extension. It's far easier to find content, no risk and you can preview what you're about to download.",
				"added": 1557420266
			}
		],
		"1557421253_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 25,
				"body": "> [pexo](#comment_85_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): Yes, not only do you feel more safe, you actually are. The TBB forces website/zite traffic through the Tor network. Zites on zeronet can make requests to clearnet servers(due to the way js is build) and as soon as a zite makes connection to any clearnet site, that site knows your ip address and (depending on implementation) also maybe that you came from zeronet, if the referrer was set(for example to 127.0.0.1:43110). ZeroID, for example, sends the data that needs to be signed to a server that knows the zeroID signing key. That server is a clearnet server and if you didn't use the TBB that server now knows your ip. ZeroBoard was made like this as well.Also the TBB does a lot of stuff behind the scenes to make tracking you as hard as possible.   [...]\n\nThanks for all the information. I suppose using the Tor Browser and hoping ZeroNet devs work on fixing some stuff about it is the way to go then.",
				"added": 1557424087
			},
			{
				"comment_id": 26,
				"body": "> [anonymouslogin](#comment_278_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): -Note, you will have to disable tor in ZeroNet, but that is ok because Whonix runs all traffic through a dedicated VM acting as a Tor gateway.\n\nBut it's P2P though, won't it lend over your real IP address anyways ? I mean that's why it's known P2P over Tor is normally useless, right ?",
				"added": 1557440216
			}
		],
		"1557505878_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 27,
				"body": "> [kxobot@kxoid.bit](#comment_48_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA): Ok, so I've actually found the problem. Firefox does support classes, it doesn't support fields (variable definitions) in classes. This is where the problem is in the code (lines 72-82): [...]\n\nOh wow thanks for the effort you put into looking into the code and finding the problem. This part is a copy-paste, I'll fix this right now. I'm gonna try and see if it works, if it does I'll send the new code to uvpda@zeroid.bit and he'll sign it.",
				"added": 1557536201
			},
			{
				"comment_id": 28,
				"body": "> [kxobot@kxoid.bit](#comment_49_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA): No problem. Happy to help! [...]\n\nIt worked, thanks for your help ! Crazy that Chrome/Firefox don't handle such a simple thing the same way.",
				"added": 1557536464
			}
		],
		"1557808432_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 30,
				"body": "The updater's button doesn't seem to work for me. No error in console, \"Files left: 0\". Curr ver: 0.6.5(rev3852), most recent: 0.7.0(rev4090). Dissenter browser, no script seems to be blocked by either extensions or the browser's shield ( Which are deactivated ). Any idea what the problem might be ?",
				"added": 1557847367
			},
			{
				"comment_id": 33,
				"body": "> [duck0](#comment_62_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): I don't think you can update from the Python 2 tree. You need to download the new source and transfer your data / config files.\n\nWell in that case I have no idea how to use the py3 tree with Windows.",
				"added": 1557900578
			}
		],
		"1552558114_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 31,
				"body": "> [deliriumgoddess6](#comment_6_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): that there is real RED ROOMS\n\nWait now that I can think about it one could create Red Rooms on ZeroNet. RIP security though since you wouldn't really be able to stream over Tor.",
				"added": 1557851837
			}
		],
		"1557762756_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": [
			{
				"comment_id": 32,
				"body": "Why wouldn't any public file uploader already on ZeroNet do the trick ?",
				"added": 1557852022
			}
		],
		"1558187649_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 34,
				"body": "> [insurgo](#comment_17_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2): Didn't found your specifc model as provided in OP.But it seems to be this: https://support.hp.com/us-en/drivers/selfservice/hp-x360-310-g1-convertible-pc/6943758 [...]\n\nEh the computer you linked is way more powerful than mine. Intel Pentium vs i7 lmao. Thanks for the advice tho, I'll try that.",
				"added": 1558221229
			},
			{
				"comment_id": 36,
				"body": "> [insurgo](#comment_17_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2): Didn't found your specifc model as provided in OP.But it seems to be this: https://support.hp.com/us-en/drivers/selfservice/hp-x360-310-g1-convertible-pc/6943758 [...]\n\nInfortunately I can't start the Live Qubes. I get a \"Kernel Panick Not Synching Fatal Exception\" which apparently is a common Linux error and considering there doesn't seem to be logs for the Live version I can't find out what happened. I tried by creating the Live with both DD ( on Debian ) and Etcher ( on Windows ) so I doubt it's a partition problem such as it seems to be the case for a lot of the problems.",
				"added": 1558366724
			}
		],
		"1558277346_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": [
			{
				"comment_id": 35,
				"body": "If HTTPS is on, it's not really a problem is it ?",
				"added": 1558280720
			}
		],
		"1558916843_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 37,
				"body": "I figured people who didn't vote for the Europe Election are people who wanna see the Europe gone ( It makes sense to think that there could be this many people wanting Europe gone in my country considering the Far-Right dominated here ) which is dumb considering many political parties do want Europe gone and need these votes. \n\nAll good for me, considering I'm pro-EU, but it really sounds dumb to not vote on that matter imo. \n\n> [robione](#comment_244_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): There is no one to vote for.Plus all the registration and spam that is generated.I prefer no tracking via voter registration.\n\nThis sounds overly paranoïd, what are you refering to ?",
				"added": 1558949120
			},
			{
				"comment_id": 38,
				"body": "> [atomiserxenolith](#comment_83_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): It's good for you if you believe in violently coercing others to follow your opinions ... as such it makes sense that you are pro-EU. It is not 'dumb' to not subscribe to violent coercion through voting. What is it about voting that you believe is so smart?\n\nBecause the world works that way, you aren't gonna change anything. Once you accept that evil people win, you start figuring you gotta do evil stuff to win too.",
				"added": 1559074708
			}
		],
		"1558983538_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": [
			{
				"comment_id": 39,
				"body": "> [pexo](#comment_97_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): The Idea would be that people from outside of ZeroNet would be able to seed and download files from zites if they are given the magnet/torrent file, in such a way that ZeroNet peers can find them and they can find those ZeroNet peers that seed the zite that has the file they want. So basically support from the outside.\n\nThat's actually a pretty fucking smart way of assuring extra durability to a lot of files. Wouldn't that cause security issues to casual ZeroNet users seeding files that are downloaded by people from their P2P clients though ? \n\nIf not, then creating a lot of magnet links to interesting files and sharing them on the Internet not forgetting to advertise ZeroNet could get us known a whole lot more.",
				"added": 1559074880
			}
		],
		"1558666037_1BGbyM8MfxFyJ8xwDkApNMexZTGAkzKmBQ": [
			{
				"comment_id": 40,
				"body": "> [cartdealer](#comment_2_1AWBY95uu7MctMC2yKdizY6iqgkAAbMeja): http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1559108355_1AWBY95uu7MctMC2yKdizY6iqgkAAbMeja/Forum+for+drug+advertising\n\nDunno about advertising, and I'm not a drug dealer, but if anybody wanna work with me on trying to achieve financial transactions on ZeroNet, I'm in.",
				"added": 1559113184
			},
			{
				"comment_id": 41,
				"body": "> [adotham](#comment_12_1P8TFEmsFJruqWErsBLpTxmpczHFW3raWF): If you could sell apps or warez on ZeroNet, it would change the game immensely  [...]\n\nI totally agree, that's what's motivating me to work on that. \n\n> [quantumworld](#comment_475_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Lets start a Zerotalk group design for testing new software concepts and coding for some really talented coders and developers to test. I have an idea that may work.I know this could be done if we have to create a token ring type coding system that would flow data bits between peer to peer systems. Think of it as a virtual code inside Zeronet that would do a peer to peer transaction system. I bet some one is already coding this idea somewhere. What do I know, I am just a program concept Engineer.We can start a new topic thread brainstorming new ideas. I am sure there will be more than one viable program idea that can be used.\n\nI'm not a talented or experienced coder but I'm not the worst and I've done a Zite already so I could be of use, plus I'd love to theorycraft such a thing. Can someone create such a group and link it in this thread ?",
				"added": 1559236120
			}
		],
		"1558494867_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 42,
				"body": "> [leftside](#comment_785_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): If you're tor-browser in Windows, use 9150 & 9151 instead of 9050 & 9051.\n\n( I'm the guy that asked, I did so on my phone alt ) It worked thanks bro.",
				"added": 1560204470
			}
		],
		"1560138110_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": [
			{
				"comment_id": 43,
				"body": "It's good but what I hate is that people complain and won't act. Seriously you're lucky to have been gifted ZeroNet, so now why don't you create content to make more people come to it ? \n\nOh and btw stop doing thousands of BS YouTube clones. We already have enough and clearly while the people(s) creating them are talented they already seem to struggle. Trying to reproduce the clearnet is NOT what is going to make people wanna come here. Think for a sec, if Tor had been used a platform to share video files by creating YT clones, would have people come to it ? No, cringy teenagers and retarded journalists became interested in it because of what it could do that the ClearNet couldn't. That's why I created a DoxBin for ZeroNet ( Although not the best idea for a platform with so little traffic, I should have started with something else ). People should create stuff that can't be done on the ClearNet. For example, why doesn't a single one of these YouTube clones start reuploading videos that have been deleted from YouTube and dedicate a whole YT Clone to that since we've got a lot of them ? Now THAT is a thing people would come here for. Create stuff that EVEN THE DARKNET couldn't allow because of the technology's banes or of the FBI raids. \n\nPersonally I'm working a lot to try to bring ZN to life but seriously it annoys me to no end to see people complaining. If you've got enough time to cry, then you've got enough time to pick up your search engine and learn how to create zites. It's hard but rewarding. And if coding is not your thing then try to bring content, for example, the deleted youtube videos as I mentionned. It's really not hard to find a way to help, quit waiting and do something.",
				"added": 1560204962
			}
		],
		"1560112205_159A9mgy8Rj1VR6hVoen597LKFZYuvU722": [
			{
				"comment_id": 44,
				"body": "Just use ZeroUp buddy. \n\nhttp://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/",
				"added": 1560205204
			}
		],
		"1552760858_14JMe2K9H9F9DwFi2s6tuwiQT66FY7H1dg": [
			{
				"comment_id": 45,
				"body": "Can't you add moderators in some content.json already though ? Or do you also need to code something for it to work ? \n\n> [legacy](#comment_7_168mhtccHKUEXnMvCGV8VRbBeC81WmaB87): Doesn't that contradict the point of zeronet?\n\nI mean it's either that or you get spams. Unless we get a vote-based blacklist of users / messages / links then that's the best we can do IMO.",
				"added": 1560205372
			}
		],
		"1560146219_159A9mgy8Rj1VR6hVoen597LKFZYuvU722": [
			{
				"comment_id": 46,
				"body": "> [d4v3an0n](#comment_1_17NuSXNjuWqZuwVKBKzehMVJ7ML2Jtmn4D): fuck off pal. Go bother someone else with you shitty conservative and homophobic ideas!The concept itself of p2p internet is freedom, the right for anyone to do whathever the fuck they want and the right to BE who they are. So if you are a conservative, YOU ARE IN THE WRONG PLACE\n\nWell TBH if he creates his own Zite he WILL be able to do whatever the fuck he wants on it lmao. \n\n> [nekololi](#comment_361_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): God loves gay people... that's why in all of His wisdom He made them. still, feel free to make your site and i'm sure a few people will be interested in seeding it.\n\nI don't know maybe that sounds dumb but as someone who has nothing against gays I think his site would be a great idea to allow debate between those who have nothing agains them and those that hate them, you know, to understand each other, what each other is thinking. And same for a lot of topics related to religion. If he creates his Zite I really hope there would be place for discussion instead of just a straigt-up Pro-Religion echo chamber though.",
				"added": 1560205653
			}
		],
		"1560245103_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 47,
				"body": "> [99fk](#comment_5_1E1ETHw8wzWhza7R49wyrM1U9ZRHvykejr): Give them time to create more docs\n\nYeah but I don't wanna wait forever to learn how to just do that. \n\nHeck, someone answer my questions and I'll write the doc if needed.",
				"added": 1560251094
			}
		],
		"1560340344_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 48,
				"body": "> [throwaway8](#comment_1_19MGuAL1xcNekSxxBtk7hxZf6uUBej5M1L): Take a look at http://127.0.0.1:43110/raw/Talk.ZeroNetwork.bit/dbschema.json [...]\n\nHoly fucking flying shit, you figured it out in your second point. Apparently the to_table thing can be written either way BUT FOR SOME ZUCKER-DICK LOVING REASON every fucking table apparently needs a json_id... The guy responsible for the doc should mention it IMO.",
				"added": 1560349099
			},
			{
				"comment_id": 49,
				"body": "> [pexo](#comment_103_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): There is some more (somewhat) official documentation on that called 'The Truth about ZeroNet'(clearnet), which is really helpful.I feel like I know quite a lot about it and how to safely handle zeronet content now, so if you have any more questions feel free to ask me.You could also read through zeronets DB code to find answers, if you can read python.\n\nWow thanks for the link. Yep, what I was searching for is mentionned in there. Guess I'm gonna create bookmarks for ZeroNet docs from now on. A funny thing I discovered and isn't mentionned in the doc is that you can have a column name that's a SQL keyword ( Where for example ) by writing the column name that way: [WHERE]. It'll still show up as WHERE but it'll work. Could always be useful I guess :p",
				"added": 1560422574
			},
			{
				"comment_id": 51,
				"body": "> [pexo](#comment_103_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): There is some more (somewhat) official documentation on that called 'The Truth about ZeroNet'(clearnet), which is really helpful.I feel like I know quite a lot about it and how to safely handle zeronet content now, so if you have any more questions feel free to ask me.You could also read through zeronets DB code to find answers, if you can read python.\n\nHey bro, if you don't mind do you know why the done DB won't fill ( While as you can see in the dbjson there should be an entry with \"1\" as hist_id ) ? \n\nDBSchema.json : http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3_6\n\nData.json: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3_5\n\nObviously everything else in the DBSchema works;",
				"added": 1560618040
			},
			{
				"comment_id": 52,
				"body": "> [pexo](#comment_104_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): I can't see the pastes. Have you made them public?\n\nHoly fuck I'm next-level retarded. \n\nDBSchema.json: \n\nhttp://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3_7\n\nData.json: \n\nhttp://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3_8",
				"added": 1560710968
			},
			{
				"comment_id": 53,
				"body": "> [pexo](#comment_105_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): This:>[\"hist_id\", \"INTEGER PRIMARY KEY AUTOINCREMENT\"], [...]\n\nEven that way it won't work :/ \n\nhttp://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3_10\n\n> [pexo](#comment_106_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): You can also use CHECK in the tables-section for really fine grained control over what is accepted into the db as id.For example this: text NOT NULL UNIQUE CHECK(tag_ID NOT GLOB '*[^a-z^A-Z^0-9]*' AND length(tag_ID) BETWEEN 1 AND 43 ) is what I use in UFTS to check tagIDs(which are base62 encoded 256-bit blake hashes) before they are added to the db. Any tag_ID that doesn't fit this criteria will not be added to anyone's database.\n\nNot really needed for this example though since we can see in Data.json that we try to add \"1\", right ? Nice to know for security though.",
				"added": 1560717182
			},
			{
				"comment_id": 54,
				"body": "> [pexo](#comment_107_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): Nevermind, I'm blind. Your history table doesn't have a [\"json_id\", \"INTEGER REFERENCES json (json_id)\"]-row. That's the reason why it doesn't work. The INTEGER PRIMARY KEY AUTOINCREMENT thing I mentioned was related to an strange issue I had in the past.\n\nThat was an old version I mistakenly shared instead of the most recent one that I had already fixed. The problem ended up being that what I wanted to do, while it made sense, wasn't supported yet. The idea was to have this in my data.json: \n\ntemp: [\n    1, \n    2\n]\n\nBut it isn't possible yet, as in it isn't supported by ZN. Ended up having to rework the DBSchema and now the first half of the Zite in question is working. I'm gonna create another Zite ( It's a 2-Zite project ) and then finish that one and I'll be able to publish my work eh eh. Thanks for the help you gave me so far.",
				"added": 1560844750
			},
			{
				"comment_id": 56,
				"body": "> [pexo](#comment_108_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): Oh, okay. Glad it worked out anyway.By the way, aside from json_id, keep away from the references-keyword in dbschema.json. [...]\n\nWhy should I avoid references ?",
				"added": 1560940208
			},
			{
				"comment_id": 57,
				"body": "> [pexo](#comment_109_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): I have some ideas, but I'm not sure why exactly, but on the py3 version the database bricks in some cases and you need to delete it, and then restart the whole client in order for your zite to work again. Also since you can't really control the order tables get generated(it's alphabetic only most of the time) certain entries will fail to be added and zeronet(probably not expecting the sqlite error) will get into the bricked state I've written above. The same happens, if you add a column that depends on two different users. Over all a bad time, if you ask me.\n\nThat's definitely weird. References aren't needed anyways but I need them while coding so I don't get lost, I guess I'll keep using them while working on projects and then delete them on release, thanks for telling me. \n\nBTW I'm working on a another, small, Zite project. It's a really simple thing that is really hard to create. It's a simple Image/Gif/Video sharing Zite. I need to create one to test my main project with. I've got code to create image thumbnails from my ZeroDox project already so the hardest part is done, I'd just need some extra hands to help me get it done quickly so that I can end my main project and work on creating more zites soon enough. The DB and the main \"design idea\" are already done ( theorically ). \n\nIf you wanna give a hand I can share the priv key of this smaller project to you by ZeroMail so that we can work on it. Shouldn't really take long to get done.",
				"added": 1560978092
			}
		],
		"1560862969_1FqSXCYG7aTFqtAbtRi1qQ7ZEprgpdEd75": [
			{
				"comment_id": 55,
				"body": "I'm here to bring raided / deleted / DMCA'd stuff to ZN. I've created ZeroDox already ( Maintained by uvpda@zeroid.bit ), a DoxBin. There are a LOT of other things I wanna bring here, but it's gonna take a lot of time, I'm already working on two Zites projects right now. Not a lot of people create Zites on here because they're hard to do and the official docs SUCK.",
				"added": 1560864782
			},
			{
				"comment_id": 60,
				"body": "> [qspitzer](#comment_12_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX): I read this and thought that you created a website to reveal personal information on others\n\nThat's exactly what it is. It doesn't have any user right now which was to be expected. UVPDA is gonna dump the old Doxbin onto the Zite soon enough and I'm gonna find a few other correct doxes platforms and dump them. \n\nUVPDA is gonna start using it to Dox people and I'll help advertise the doxes a bit. It'll be a good way to get ZN to be more known. \n\nI'm also working on two other projects and once done I have another idea for a Zite. I'll try to make ZN skyrocket :p",
				"added": 1561114491
			}
		],
		"1560988180_1CKKbdH99PeFfraMKFZNmCMAUsTfTQxsKU": [
			{
				"comment_id": 58,
				"body": "Unfortunately there isn't a lot of stuff yet here, IMO people simply haven't figured out yet how to make the best off ZN's capacities. ZeroTalk is the main place where stuff happens. From time to time you might see a new post on Millchan, but it's very unactive, which is kind of sad. You can always try to browse zite lists to find stuff you may like.",
				"added": 1561019180
			}
		],
		"1560984606_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 59,
				"body": "Cloudflare should fucking die and we should find an alternative. Any idea how to bypass it when using Tor anyone ?",
				"added": 1561019332
			}
		],
		"1561066486_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ": [
			{
				"comment_id": 61,
				"body": "OP just put a live USB Tails on a random USB key and boot on it. Easiest solution for what you wanna do. BE CAREFUL HOWEVER this OS doesn't have persistence by default, meaning that all downloaded files, saved passwords, cookies, etc... Will be delete upon closing the user session, so you wanna have another USB Key where you'll put everything you download. Also, maybe irelevent, but use a password manager with a complex Master Password, that'll make it harder for people not named \"Big-Ass Multi-Billion Company\" or \"Government\" wanting to attack your private life to get into your accounts. \n\n> [insurgo](#comment_28_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2): https://www.howtogeek.com/howto/6169/use-truecrypt-to-secure-your-data/ [...]\n\nDon't use truecrypt, use veracrypt. Much more secure AFAIK. \n\n> [insurgo](#comment_29_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2): https://www.whonix.org/wiki/Download [...]\n\nSo much this, Qubes-Whonix is the shit. You need to have a good computer though.",
				"added": 1561114956
			}
		],
		"1562074727_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 62,
				"body": "> [geekless](#comment_71_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): If you need read-only access to the data of another zite, you can use the CORS API. (example) [...]\n\nWhat I need to do could be as simple as a pop-up of the other Zite, and write stuff from this pop-up, which wouldn't really count as writing stuff from my Zite. \n\n> [zeroused](#comment_1_1HTdH8m23USCcq3cK45sKj2gMKw6ih8phQ): First ask permission with this command [...]\n\nDoes that allow me to write in the DB ?",
				"added": 1562143833
			}
		],
		"1564523508_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 63,
				"body": "Why do you need to back it up ? If you lose anything you can just re-download it again, ZN isn't really known for having stuff deleted lmao.",
				"added": 1564964666
			}
		],
		"1564978498_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW": [
			{
				"comment_id": 64,
				"body": "That's one of the cringiest thing I've seen this year.",
				"added": 1564993346
			}
		],
		"1565016468_13m3NoLQwK46WML3WyRBCR8uxS7xSs5H1C": [
			{
				"comment_id": 65,
				"body": "I like Qwant. Hosted in France so steal a 9-eyes country but still better than USA-based DDG.",
				"added": 1565031498
			},
			{
				"comment_id": 66,
				"body": "> [fantoski](#comment_65_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): I like Qwant. Hosted in France so steal a 9-eyes country but still better than USA-based DDG.\n\nSo still a 9-eyes* \n\nI'm a fucking retard.",
				"added": 1565031529
			}
		],
		"1563987524_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 67,
				"body": "> [r3naam3r](#comment_16_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM): 5G is creepy as hell, I will not use 5G-enabled phone for as long as possibly possible\n\nI have an opposite feeling about this. As someone studying how shit the mobile communications protocols are, I can't fucking wait so have fun while fucking with 5G.",
				"added": 1565031580
			}
		],
		"1565185775_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": [
			{
				"comment_id": 68,
				"body": "> [tempofunktron](#comment_1_14HL4TtDqn72eNpfEQE5WSYjRsYDr2pZ81): Most traffic going through Zeronet also goes through Tor, so you should be fine in that regard.\n\nOnly if you configured it to behave that way.",
				"added": 1565186864
			},
			{
				"comment_id": 69,
				"body": "> [eighty4](#comment_3_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX): Yeah but what if i dont notice the pedo [...]\n\nAFAIK There isn't a single Zite on the network that didn't configure user-posted videos and pictures as optional files, so as long as you don't click on anything that intends to download them ( Or create a thumbnail of them, so avoid clicking on CP-related boards as there should be thumbnails of them that would be created on your HDD once you go on the board just like for every single other board ) you should be fine. \n\nIf you click on a CP-related board ( Only way to unintendedly download an image-related file on ZN imo ), just mute the user ID of the creator of the board, that should delete the content. You can zero your disk's empty space if you're feeling uncomfortable after that.",
				"added": 1565187042
			}
		],
		"1565695545_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 70,
				"body": "> [genx](#comment_1_1Bov9ZwmSSatH1PkwS2fQ9LGvEJPrvimad): Yeah didn't Bill Clinton ride a helicopter to that island with him one time?\n\nAFAIK is name was in the register of some private jet ( Or maybe helicopter ) that went ONLY to this island.",
				"added": 1565697750
			}
		],
		"1566642594_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 71,
				"body": "Any way to change the domain ? Meaning delete the domain, change which address it directs to, etc...",
				"added": 1566935786
			},
			{
				"comment_id": 75,
				"body": "\"reasonsilovemyniece.list 1N7fJq4Ka65jpSpf9X2xf1YcCSqdCBdoc6 kidcourageous@zeroid.bit\"\n\nUh oh",
				"added": 1566948800
			}
		],
		"1566939301_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 72,
				"body": "Why are you even running W10 ?",
				"added": 1566939912
			}
		],
		"1566858736_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": [
			{
				"comment_id": 73,
				"body": "> [cldude](#comment_6_1DV5mvcvwtjyRiQpuNuXv9hwdYj27C3oob): YouTube closes any channel the advertisers don't like.  Such as: antifa,\n\n(X) Doubt",
				"added": 1566940088
			}
		],
		"1566749586_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 74,
				"body": "> [mu2mu2](#comment_1_16TmL1tYPbNSTbqkK6KKpue2FTwE73Ezn6): The answer is No. ZeroNet runs smoothly in China without Tor.\n\nYes and no. China did block \"zeronet\"... Or more accurately \"zeronet.io\", the main website to download ZeroNet.",
				"added": 1566940313
			}
		],
		"1583438031_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY": [
			{
				"comment_id": 76,
				"body": "Interesting, could prove useful. Thanks.",
				"added": 1583487034
			}
		],
		"1583450778_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid": [
			{
				"comment_id": 77,
				"body": "> [buzel](#comment_3_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid): Can you fake it\n\nA \"faking\" alternative is ewhoring.",
				"added": 1583487381
			}
		],
		"1589077573_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 78,
				"body": "> [styromaniac](#comment_2145_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You're missing the optional line. [...]\n\nThanks a lot. I tried with: \n\n\n \"optional\": \".*\",\n\nIt didn't work. So just in case I tried both: \n\n \"optional\": \"data/users/.*/optional/.*\",\n\nand \n\n \"optional\": \"data\\/users\\/.*\\/optional\\/.*\",\n\nBut it still didn't work. Any idea why ? I looked for info online and obviously didn't find much, but is it possible that it is the SITE file limit that's the problem ? The problem would then be that the site doesn't ask me to allow the max allowed size when uploading a big file.",
				"added": 1589121728
			},
			{
				"comment_id": 79,
				"body": "> [mg0](#comment_306_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): As styro mentioned, all files bigger than 10MB are by default denied to be included in a site's required files (it can be raised but it must be done on the user zeronet instance, so don't rely on it), for such big files you must make them optional files. The regex for the optional line isn't the most intuitive imo so a bit of trial and error is in order. [...]\n\nI get what you mean. I guess someone could potentially flood the Site with trash big files. I intend to, atleast temporarily, make my site whitelist-only. AKA a few preselected users may upload, but not more. In that case, like you said, I'll have to write the permissions for each member. \n\n> [mg0](#comment_306_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): but, I think that's not the proper approach if you are handling user-owned content; I haven't worked with it myself but I've seen other sites instead ignore the data/users folder while including a single content.json with:\n\"include\": \"data/users/content.json\"\n\nThe data/users/content.json is the file whom I copy-pasted the content in the OP and the one I'm trying to modify so it's already included.",
				"added": 1589124479
			},
			{
				"comment_id": 80,
				"body": "BTW I tried your line and it's still not working but I'll try to find how to use ZN's regex in the doc.",
				"added": 1589124508
			},
			{
				"comment_id": 81,
				"body": "> [mg0](#comment_307_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): If you can, please get us the log when you try to sign your site, as it states which files are being required and which are listed as optional.\n\nSorry if it's long: \n\n[2020-05-10 16:37:24,022] DEBUG    Site:1Pirat..gSYA Signing: data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/content.json\n[2020-05-10 16:37:24,023] DEBUG    Site:1Pirat..gSYA Extending content.json with cert fantoski@zeroid.bit\n[2020-05-10 16:37:24,030] INFO     Site:1Pirat..gSYA Opening site data directory: D:/Main/ZeroNet4/data/1PirateSKGpEyoC54CgD17B9c7YkhkgSYA/data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/...\n[2020-05-10 16:37:24,030] INFO     Site:1Pirat..gSYA - [SKIPPED] content.json\n[2020-05-10 16:37:24,031] INFO     Site:1Pirat..gSYA - data.json\n[2020-05-10 16:37:24,035] INFO     Site:1Pirat..gSYA - [SKIPPED] data.json-old\n[2020-05-10 16:37:24,036] INFO     Site:1Pirat..gSYA - optional/012899d6914cf5c74583642a0514a38c.jpg\n[2020-05-10 16:37:24,090] INFO     Site:1Pirat..gSYA - optional/04dddd1bb5484285313bc1e5644bcf9f.jpg\n[2020-05-10 16:37:24,280] INFO     Site:1Pirat..gSYA - optional/098f6bcd4621d373cade4e832627b4f6.txt\n[2020-05-10 16:37:24,280] INFO     Site:1Pirat..gSYA - optional/0a1f6dfa8194e8b676cf076e82b11553.txt\n[2020-05-10 16:37:24,283] INFO     Site:1Pirat..gSYA - optional/0a5b778239361c5ba086ccc7d3657cb7.txt\n[2020-05-10 16:37:24,283] INFO     Site:1Pirat..gSYA - optional/2765766701c03eb9c57d736f7333818e.rar\n[2020-05-10 16:37:24,715] INFO     Site:1Pirat..gSYA - optional/2765766701c03eb9c57d736f7333818e.rar.piecemap.msgpack\n[2020-05-10 16:37:24,716] INFO     Site:1Pirat..gSYA - optional/5198b9d3f1e9658f1282bcb59bc8122c.zip\n[2020-05-10 16:37:25,480] INFO     Site:1Pirat..gSYA - optional/5198b9d3f1e9658f1282bcb59bc8122c.zip.piecemap.msgpack\n[2020-05-10 16:37:25,500] INFO     Site:1Pirat..gSYA - optional/58486125753228a96a4e1db2a706e9d0.jpg\n[2020-05-10 16:37:25,543] INFO     Site:1Pirat..gSYA - optional/605f7871bc99dcaeff946f3b75e5caaa.txt\n[2020-05-10 16:37:25,544] INFO     Site:1Pirat..gSYA - optional/690dbf4020ece2cf3099c84721529099.jpg\n[2020-05-10 16:37:25,563] INFO     Site:1Pirat..gSYA - optional/690dbf4020ece2cf3099c84721529099.jpg.piecemap.msgpack\n[2020-05-10 16:37:25,566] INFO     Site:1Pirat..gSYA - optional/69e6a045c14da221a7f25afb31ac4276.zip\n[2020-05-10 16:37:27,912] INFO     Site:1Pirat..gSYA - optional/69e6a045c14da221a7f25afb31ac4276.zip.piecemap.msgpack\n[2020-05-10 16:37:27,945] INFO     Site:1Pirat..gSYA - optional/731a5ba94771b39b2c70832a125ab281.txt\n[2020-05-10 16:37:27,946] INFO     Site:1Pirat..gSYA - optional/7ef777456e8894804e3d8aa8b8dc0d34.jpg\n[2020-05-10 16:37:28,072] INFO     Site:1Pirat..gSYA - optional/7ef777456e8894804e3d8aa8b8dc0d34.jpg.piecemap.msgpack\n[2020-05-10 16:37:28,073] INFO     Site:1Pirat..gSYA - optional/8255623c0a7a88fb630cb4d015b22205.zip\n[2020-05-10 16:37:28,998] INFO     Site:1Pirat..gSYA - optional/8255623c0a7a88fb630cb4d015b22205.zip.piecemap.msgpack\n[2020-05-10 16:37:29,032] INFO     Site:1Pirat..gSYA - optional/849edc95fd0327d13b4a9d2394f7fdac.rar\n[2020-05-10 16:37:29,938] INFO     Site:1Pirat..gSYA - optional/849edc95fd0327d13b4a9d2394f7fdac.rar.piecemap.msgpack\n[2020-05-10 16:37:29,939] INFO     Site:1Pirat..gSYA - optional/a44b0ae6c373cadab05958fbf5e20761.rar\n[2020-05-10 16:37:30,249] INFO     Site:1Pirat..gSYA - optional/a44b0ae6c373cadab05958fbf5e20761.rar.piecemap.msgpack\n[2020-05-10 16:37:30,250] INFO     Site:1Pirat..gSYA - optional/b043f9f77faefaaf3f024b39616f05b2.zip\n[2020-05-10 16:37:30,972] INFO     Site:1Pirat..gSYA - optional/b043f9f77faefaaf3f024b39616f05b2.zip.piecemap.msgpack\n[2020-05-10 16:37:30,973] INFO     Site:1Pirat..gSYA - optional/cad5b6d8ebc0a4bd96046f27094cd3c1.png\n[2020-05-10 16:37:30,987] INFO     Site:1Pirat..gSYA - optional/cad5b6d8ebc0a4bd96046f27094cd3c1.png.piecemap.msgpack\n[2020-05-10 16:37:30,988] INFO     Site:1Pirat..gSYA - optional/d129d7fa26ef913e2877ee5f253b9996.jpg\n[2020-05-10 16:37:30,989] INFO     Site:1Pirat..gSYA - optional/d41427c2b2d41c99242a424231ccd8a2.txt\n[2020-05-10 16:37:30,990] INFO     Site:1Pirat..gSYA - optional/d434ce6d81d3318c4a79aa09be8b39ed.rar\n[2020-05-10 16:37:31,123] INFO     Site:1Pirat..gSYA - optional/d434ce6d81d3318c4a79aa09be8b39ed.rar.piecemap.msgpack\n[2020-05-10 16:37:31,124] INFO     Site:1Pirat..gSYA - optional/d4b9d4f044b9b3b5b2f69ba37059da3b.rar\n[2020-05-10 16:37:31,658] INFO     Site:1Pirat..gSYA - optional/d4b9d4f044b9b3b5b2f69ba37059da3b.rar.piecemap.msgpack\n[2020-05-10 16:37:31,659] INFO     Site:1Pirat..gSYA - optional/e13d03898a6c5cefdca0f871abfa50e7.txt\n[2020-05-10 16:37:31,682] INFO     Site:1Pirat..gSYA - optional/eacd97991d8a204cf97a5004e39fe062.jpg\n[2020-05-10 16:37:31,695] INFO     Site:1Pirat..gSYA - optional/eacd97991d8a204cf97a5004e39fe062.jpg.piecemap.msgpack\n[2020-05-10 16:37:31,696] INFO     Site:1Pirat..gSYA - optional/ebf3e57079eda114286f881bf8e0d264.jpg\n[2020-05-10 16:37:31,698] INFO     Site:1Pirat..gSYA - optional/ec8b0dc05da3b4b2b1561e6cac273eac.txt\n[2020-05-10 16:37:31,699] INFO     Site:1Pirat..gSYA - optional/f2b9903dee349608899dbf66248145ef.txt\n[2020-05-10 16:37:31,700] INFO     Site:1Pirat..gSYA - optional/f985218091bb09260761754c2a638492.txt\n[2020-05-10 16:37:31,700] INFO     Site:1Pirat..gSYA - optional/thumb_012899d6914cf5c74583642a0514a38c.jpg\n[2020-05-10 16:37:31,701] INFO     Site:1Pirat..gSYA - optional/thumb_04dddd1bb5484285313bc1e5644bcf9f.jpg\n[2020-05-10 16:37:31,702] INFO     Site:1Pirat..gSYA - optional/thumb_58486125753228a96a4e1db2a706e9d0.jpg\n[2020-05-10 16:37:31,703] INFO     Site:1Pirat..gSYA - optional/thumb_690dbf4020ece2cf3099c84721529099.jpg\n[2020-05-10 16:37:31,706] INFO     Site:1Pirat..gSYA - optional/thumb_7ef777456e8894804e3d8aa8b8dc0d34.jpg\n[2020-05-10 16:37:31,707] INFO     Site:1Pirat..gSYA - optional/thumb_cad5b6d8ebc0a4bd96046f27094cd3c1.png\n[2020-05-10 16:37:31,708] INFO     Site:1Pirat..gSYA - optional/thumb_d129d7fa26ef913e2877ee5f253b9996.jpg\n[2020-05-10 16:37:31,708] INFO     Site:1Pirat..gSYA - optional/thumb_eacd97991d8a204cf97a5004e39fe062.jpg\n[2020-05-10 16:37:31,709] INFO     Site:1Pirat..gSYA - optional/thumb_ebf3e57079eda114286f881bf8e0d264.jpg\n[2020-05-10 16:37:31,710] DEBUG    Site:1Pirat..gSYA Changed files: ['data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/content.json', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/data.json', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/04dddd1bb5484285313bc1e5644bcf9f.jpg', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/098f6bcd4621d373cade4e832627b4f6.txt', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/0a1f6dfa8194e8b676cf076e82b11553.txt', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/0a5b778239361c5ba086ccc7d3657cb7.txt', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/2765766701c03eb9c57d736f7333818e.rar', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/2765766701c03eb9c57d736f7333818e.rar.piecemap.msgpack', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/5198b9d3f1e9658f1282bcb59bc8122c.zip', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/5198b9d3f1e9658f1282bcb59bc8122c.zip.piecemap.msgpack', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/58486125753228a96a4e1db2a706e9d0.jpg', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/605f7871bc99dcaeff946f3b75e5caaa.txt', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/690dbf4020ece2cf3099c84721529099.jpg', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/690dbf4020ece2cf3099c84721529099.jpg.piecemap.msgpack', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/69e6a045c14da221a7f25afb31ac4276.zip', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/69e6a045c14da221a7f25afb31ac4276.zip.piecemap.msgpack', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/731a5ba94771b39b2c70832a125ab281.txt', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/7ef777456e8894804e3d8aa8b8dc0d34.jpg', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/7ef777456e8894804e3d8aa8b8dc0d34.jpg.piecemap.msgpack', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/8255623c0a7a88fb630cb4d015b22205.zip', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/8255623c0a7a88fb630cb4d015b22205.zip.piecemap.msgpack', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/849edc95fd0327d13b4a9d2394f7fdac.rar', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/849edc95fd0327d13b4a9d2394f7fdac.rar.piecemap.msgpack', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/a44b0ae6c373cadab05958fbf5e20761.rar', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/a44b0ae6c373cadab05958fbf5e20761.rar.piecemap.msgpack', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/b043f9f77faefaaf3f024b39616f05b2.zip', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/b043f9f77faefaaf3f024b39616f05b2.zip.piecemap.msgpack', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/cad5b6d8ebc0a4bd96046f27094cd3c1.png', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/cad5b6d8ebc0a4bd96046f27094cd3c1.png.piecemap.msgpack', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/d41427c2b2d41c99242a424231ccd8a2.txt', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/d434ce6d81d3318c4a79aa09be8b39ed.rar', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/d434ce6d81d3318c4a79aa09be8b39ed.rar.piecemap.msgpack', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/d4b9d4f044b9b3b5b2f69ba37059da3b.rar', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/d4b9d4f044b9b3b5b2f69ba37059da3b.rar.piecemap.msgpack', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/e13d03898a6c5cefdca0f871abfa50e7.txt', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/eacd97991d8a204cf97a5004e39fe062.jpg', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/eacd97991d8a204cf97a5004e39fe062.jpg.piecemap.msgpack', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/ebf3e57079eda114286f881bf8e0d264.jpg', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/ec8b0dc05da3b4b2b1561e6cac273eac.txt', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/f2b9903dee349608899dbf66248145ef.txt', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/f985218091bb09260761754c2a638492.txt', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/thumb_04dddd1bb5484285313bc1e5644bcf9f.jpg', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/thumb_58486125753228a96a4e1db2a706e9d0.jpg', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/thumb_690dbf4020ece2cf3099c84721529099.jpg', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/thumb_7ef777456e8894804e3d8aa8b8dc0d34.jpg', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/thumb_cad5b6d8ebc0a4bd96046f27094cd3c1.png', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/thumb_eacd97991d8a204cf97a5004e39fe062.jpg', 'data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/optional/thumb_ebf3e57079eda114286f881bf8e0d264.jpg']\n[2020-05-10 16:37:31,723] INFO     Site:1Pirat..gSYA Adding timestamp and sha512sums to new content.json...\n[2020-05-10 16:37:31,723] INFO     Site:1Pirat..gSYA Verifying private key...\n[2020-05-10 16:37:31,730] INFO     Site:1Pirat..gSYA Correct 191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3 in valid signers: ['191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3', '1PirateSKGpEyoC54CgD17B9c7YkhkgSYA']\n[2020-05-10 16:37:31,730] INFO     Site:1Pirat..gSYA Signing data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/content.json...\n[2020-05-10 16:37:31,763] ERROR    Site:1Pirat..gSYA Site sign failed: data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/content.json: VerifyError: Content too large 621917211B > 10485760B, aborting task... in UiWebsocket.py line 441 > ContentManager.py line 764 > ContentManager.py line 869",
				"added": 1589126548
			},
			{
				"comment_id": 82,
				"body": "Alright, so to sum it up. \n\nThe content.json I'm modifying is at data/users/content.json. I just assumed I had to modify this one. \n\nMy two last tries were with: \n\n\n \"optional\": \"optional/\",\n\nand\n\n \"optional\": \"optional/.*\",\n\n( You had written \"optional\": \"optional/.\" but I guess that dot was an error. Anyways, with the dot only, it didn't allow me to sign the content.json ). \n\nThe files to be made optional are in data/users/[User]/optional/. \n\nThere is no [OPTIONAL] ( case insensitive search ) in my logs, anywhere. That means all of my precedent tries didn't work either. \n\nIf it really continues to not work, do you know any example of how I could get it to work in any other way ? Like an example where the files would be in a different folder, etc...",
				"added": 1589128865
			},
			{
				"comment_id": 83,
				"body": "> [styromaniac](#comment_2147_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I don't think you can do that for multiple folders.\n\nI didn't AFAIK.",
				"added": 1589148714
			},
			{
				"comment_id": 84,
				"body": "So can anybody help me out ? :/",
				"added": 1589289845
			},
			{
				"comment_id": 85,
				"body": "> [styromaniac](#comment_2148_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): \"optional\": \"(Media/.*)\", [...]\n\nI tried with \n\n\"optional\": \"(optional/.*)\"\n\nAs my optional files are in data/users/######/optional/. It still doesn't work: \n\n[2020-05-13 00:03:05,226] INFO     Site:1Pirat..gSYA - optional/012899d6914cf5c74583642a0514a38c.jpg\n\nMy site is at 1PirateSKGpEyoC54CgD17B9c7YkhkgSYA, if you take a look maybe you'll figure out where I screwed up elsewhere ? This is how I upload a file, if it makes any difference: \n\npage.cmd(\"bigfileUploadInit\", [\"data/users/\"+addr+\"/optional/\"+fileName, file.size], function(init_res){ ... } \n\nI believe both of my config.json ( the normal one and the data/users one ) are alright.",
				"added": 1589321164
			},
			{
				"comment_id": 86,
				"body": "> [mg0](#comment_311_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): I see my error now. @fantoski The 10MB limit is actually for the total size of required files instead of a per-file size limit. So initially a site allows 10MB by default, but said limit can be raised (and should be raised before signing if its files total size surpasses said limit). [...]\n\nInteresting. What's weird is that ZeroNet didn't ask me if I wanted to raise the limit, shouldn't it have, or is it maybe just a bug ? A friend of mine also tried and has the same issue, which means it isn't because i'm the owner of the Zite. \n\nI tried changing the size, now I have a File write error along with a file not allowed error: \n\n[2020-05-13 03:39:19,010] ERROR    Site:1Pirat..gSYA Site sign failed: data/users/191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3/content.json: VerifyError: File not allowed: optional/012899d6914cf5c74583642a0514a38c.jpg in UiWebsocket.py line 441 > ContentManager.py line 764 > ContentManager.py line 881 > ContentManager.py line 909\n\nNo idea what it is. I'm starting to be tired of all these errors. I hope it will be working soon. \n\n> [styromaniac](#comment_2150_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Try the full path\n\n  \"optional\": \"(data/users/.*/optional/.*)\", \n\nDidn't really change a lot. I'm sure one of the things we've tried works but there's a problem somewhere else.",
				"added": 1589335937
			}
		],
		"1595606009_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 87,
				"body": "> [adrenochrome](#comment_22_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T): Maybe Beaker Browser?Beaker uses a peer-to-peer filesystem on the Hypercore Protocol. Users connect directly to your computer to access your files.\n\nConsidering I'm gonna use a ZN website, I'm searching for a ZN solution. \n\n> [styromaniac](#comment_2504_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Use the search bar: ZeroUp alternative [...]\n\nA search bar ? Where ? Anyways, thank you. \nI'm temporarily using IFS but I'm gonna try the alternatives in the link, thanks.",
				"added": 1595617088
			}
		]
	},
	"comment_vote": {
		"3_1Cj5g289VvLkA7tsv7ewLKLpUYSnz3Ut4C": 1,
		"1_1LgNB2osHYPvsdGBM9MS24RE3m4P9XeaRs": 1,
		"2_1H72g5YeBn4DyLQT9bKeFkt4LnZHzyonvn": 1,
		"104_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"26_1KY1YYCNH5sDor7yu19jEr5yMtiZ5QyWwu": 1,
		"4_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"10_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"377_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"8_13qS8A4SdGuztFr2JjHMP4KEeGChYVckij": 1,
		"17_1NYxK9cC899pvxFuCt6eE53APoueDrhmS5": 1,
		"18_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"25_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"24_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"26_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"2_18uBh8D7N8dcuQ2xtj8JJbh7WcYQ6VzHUV": 1,
		"259_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"63_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"133_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"126_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1,
		"129_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1,
		"80_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"141_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1,
		"31_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"144_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1,
		"49_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"45_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"53_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"427_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1_15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL": 1,
		"829_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"43_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": 1,
		"841_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1_16ZCQBFxyQeTZfA4jYSYacesYmKkM4jLT4": 1,
		"10_1AKTv64HemAWmM762raYNn8aeDNAoojaMd": 1,
		"85_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"86_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"1_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"279_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"277_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"48_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": 1,
		"49_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": 1,
		"2_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"283_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"284_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"3_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"4_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"285_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"3_17RgJMZ9wxBZvSyTFnSGkMQVpLrAGYNfba": 1,
		"151_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"287_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"87_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"298_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"5_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"6_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"7_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"8_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"2_18HYVwCAgri1SgiYZcEZMehKoXZo6Eg7im": 1,
		"3_18HYVwCAgri1SgiYZcEZMehKoXZo6Eg7im": 1,
		"9_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"88_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"300_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"17_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"12_1P8TFEmsFJruqWErsBLpTxmpczHFW3raWF": 1,
		"14_12nqeX4e52siyux2s9AGpdUK2ZB5Qv3vLG": 1,
		"785_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"780_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"19_12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq": 1,
		"2_1w9czsVapAVmVVQzf7xzuSqvqGar6xd2C": 1,
		"8_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"4_1E1ETHw8wzWhza7R49wyrM1U9ZRHvykejr": 1,
		"100_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"333_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"5_12J9C7UzPWdvcmGtYGDRqnLsjpUByVPtwk": 1,
		"12_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": 1,
		"4_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": 1,
		"152_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"5_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": 1,
		"1_1DZh9ZwU3TsEdn7G7xsMFaX4d55ud323Fz": 1,
		"362_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"341_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"2_16GG19wZtGAcebcKhf2hEmcf1sETig7DLA": 1,
		"342_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"231_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"233_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"4_19mAuNGqnePcvAmLuq6856A4PNY5MdySsc": 1,
		"27_1G6QESmeipZsukJX5WvDxxwSioaGnEDRk3": 1,
		"1_19MGuAL1xcNekSxxBtk7hxZf6uUBej5M1L": 1,
		"7_19MGuAL1xcNekSxxBtk7hxZf6uUBej5M1L": 1,
		"103_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"42_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"9_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"3_18ToXEcEF1nZGNJBgUzF9ocFJrGnTaePaN": 1,
		"153_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"45_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"51_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"105_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"106_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"53_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"107_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"108_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"109_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"55_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"161_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"464_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY": 1,
		"1_1N46mXSmYrQihs54G3wbWo8WvjoRJxMFgP": 1,
		"2_1N46mXSmYrQihs54G3wbWo8WvjoRJxMFgP": 1,
		"14_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"3_1Gww3egxQHxqa1ktvbUYYQp7KamrCb9Ag3": 1,
		"12_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"13_1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD": 1,
		"2_17NuSXNjuWqZuwVKBKzehMVJ7ML2Jtmn4D": 1,
		"13_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"29_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"30_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"31_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"14_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"32_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"7_13Azsbvu9LH6rFLn5dUE7DEuRTQ59bYt9H": 1,
		"7_1FqSXCYG7aTFqtAbtRi1qQ7ZEprgpdEd75": 1,
		"293_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"17_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"32_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": 1,
		"18_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"34_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": 1,
		"3_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ": 1,
		"2_1AKyPdJPJSrYgZWZ3RY8kojBvHFfzhL9Aw": 1,
		"15_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"294_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1_1PNJZzvokVc1fVcA3U6hXfRPSZLcEfYJAc": 1,
		"4_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ": 1,
		"1_1FCr9fd6iAqPa7AWfbNcQm9AWVJZhkG53N": 1,
		"7_1PNJZzvokVc1fVcA3U6hXfRPSZLcEfYJAc": 1,
		"23_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"16_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"17_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"299_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"20_1DSnM3xHWxHbkHCADMTfhvXMfZDE34vwQJ": 1,
		"1_142kvsY3QEwbXPDPjWWEZHptFHH36JwNo4": 1,
		"61_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"112_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"61_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"494_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"495_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"113_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"77_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"496_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"497_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"498_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"40_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"499_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"62_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"7_142kvsY3QEwbXPDPjWWEZHptFHH36JwNo4": 1,
		"500_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"501_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"64_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"502_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"8_142kvsY3QEwbXPDPjWWEZHptFHH36JwNo4": 1,
		"503_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"504_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"21_1DS1K15BYi2N36Kt5MhV2AJW7wu6sFNzdQ": 1,
		"165_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"3_176w2WC17nRS1oHt7HouaKQjfFx2eLuiZy": 1,
		"66_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"65_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"13_1BDzk7UPg7TeTu8gdY5eefwKKRyu4yWpXo": 1,
		"1_1HTdH8m23USCcq3cK45sKj2gMKw6ih8phQ": 1,
		"71_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"3_1BxmHigkmLtEt9B3275NDDrRgS2yJe3QTn": 1,
		"64_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"21_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": 1,
		"32_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE": 1,
		"13_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"16_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"165_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"4_19vcqLBN7qJ2gnF5audiwNNnLTn7ypRrrq": 1,
		"785_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"5_1A2bJUxDcvDbsZ1ttC1fSgy6J74ghfmpxU": 1,
		"34_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"62_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"117_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"3_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx": 1,
		"71_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": 1,
		"75_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"1_1A1yMnd7oNRGwRNTrYayrw5dTmFfhc9hy3": 1,
		"48_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"3_1JT342LZCKfgp8r2FYMruVc2jvFXk3gL24": 1,
		"165_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"49_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"180_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"76_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"77_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"352_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"10_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": 1,
		"34_1FRms99LhV6SmTBPxkNbr99GXGjf8na3k2": 1,
		"436_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"354_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"93_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12": 1,
		"1799_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"85_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": 1,
		"970_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"54_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": 1,
		"43_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": 1,
		"2_1JmxhPt4FDP7rTmmaxoKdwTSDhwg5YSatG": 1,
		"80_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"2034_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"428_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"19_1GhYmYygr9AwgLDix4ge5AAQiMa4voJGuC": 1,
		"2036_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"94_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"27_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"20_1GhYmYygr9AwgLDix4ge5AAQiMa4voJGuC": 1,
		"2037_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"5_1N16MiCzsNzfRczxCdK7sWWhbiCvdXjacE": 1,
		"1_1JAovW4BTJcwNmCDjpDrxZrPr325Bjor17": 1,
		"1_1H9ktfLymgV2oXD9pAcH1MiUp9eWm6JqZL": 1,
		"2144_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"303_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"59_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"18_17HQ27P8LgqS7S4WAUy9bRQtPoESLA15Cx": 1,
		"2145_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"78_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"60_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"20_17HQ27P8LgqS7S4WAUy9bRQtPoESLA15Cx": 1,
		"28_1HpSHmnQ3cp4oP3hRQsqr1f4U5T7ZL29zK": 1,
		"306_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"307_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"308_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"2147_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2148_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2149_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2504_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"87_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1
	}
}