{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 22,
	"comment": {
		"1_1NnLEbZgqNo9QfGuopF2Co7Dy152rp3Pim": [
			{
				"comment_id": 1,
				"body": "lol\nAmericans who think they're nationalists,\nwhile their country has been one of the most infiltrated by Freemasonry historically.\neven their version of nationalism (patriotism) makes absolutely no sense, but they don't know that, little ignorant puppets that they are.\n\nMoreover, Hitler was a bad strategist, a very bad one, who spent his time attacking everyone from the front.\n\nToday if Europe is not Nationalist it is thanks to Hitler, and his strategic bullshit.",
				"added": 1556738961
			},
			{
				"comment_id": 2,
				"body": "> [quantumworld](#comment_23_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): \n\na password on zeronet ?",
				"added": 1556743163
			},
			{
				"comment_id": 3,
				"body": "> [quantumworld](#comment_24_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): \n\n\tApparently your respect is almost as non-existent, of the group you defend, if that group wants to have you. which I doubt.\n\tTime to waste again?",
				"added": 1556746500
			},
			{
				"comment_id": 4,
				"body": "> [anonymouslogin](#comment_6_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Hitler and his generals bad strategists? WHAT? They ran out of fuel. Simple. I have ethical objections to that leader's philosophies, but of all the things Hitler was, a bad strategist is not one of them.\n\nthe strategy is reserved for intelligent people.",
				"added": 1557021010
			}
		],
		"1541263546_1QCMg6ZqmUAFd1MGyc2g2j6NDep2GANfAC": [
			{
				"comment_id": 5,
				"body": "> [snifflz](#comment_5_1BDapygZHNG8GxEuSsEpK9Xipm9mFfW1F2): god doesn't exist guys\n\nlol. if God doesn't exist, then it just proves that you're not smart enough.",
				"added": 1557068748
			},
			{
				"comment_id": 6,
				"body": "> [anonymouslogin](#comment_7_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): What reason do you have for believing in a deity? Do you have any evidence?\n\n> [anonymouslogin](#comment_7_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): What reason do you have for believing in a deity? Do you have any evidence?\n\nof course, get on all four legs, observe the insects and plants, and you will see that this whole little world is intelligent:(that it acts according to what it knows and 'have experimented'). Moreover, instinctively, let us take a colony of ants, the queen knows WHAT SHE NEEDS TO PRODUCE 'IN ADVANCE' OTHERWISE THE COLONY IS DEAD.\nINSTINCTIVELY IS THE KEYWORD, BELIEVERS CAN'T UNDERSTAND.\n\n- I have no need to believe (to be a believer) or not to believe (to be an atheist), I know because I have observed and Understood that of Nature by Observing it.\nThat's why I have so much fun hitting Believers or Atheists Who Speak by Belief, and not lived Experiences (and knowledge) lol.",
				"added": 1557071204
			},
			{
				"comment_id": 7,
				"body": "> [anonymouslogin](#comment_9_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I don't HAVE four legs lol. I see much evidence for evolution when I observe nature though.\n\nevolution;a funny one theory:\nan evolution that would evolve according to needs, but would not take into account; mistakes.\n\nin this theory, we would evolve towards an adaptation. But if adaptation is a mistake, then we should go back to the original state.\n\nthere is no evolution, species evolve (are created) by Copulation.\nAll breeders wishing to create a species create a new species, no need for God or the Theory of Evolution.\n\nYou've been bamboozled by theories that are only that.",
				"added": 1557072942
			},
			{
				"comment_id": 8,
				"body": "Per se God does not exist.> [quantumworld](#comment_31_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): The Creator or God is the worlds greatest comedian. Just look around you. And one day you will understand his mastery of comedy. And then you shall know the truth.\n\nPer se God does not exist.\nBut Nature acts in an intelligent and in a non mechanistic way, as all intellectuals say.\nI always give the example of the body, which knows in advance and therefore acts in a position to do so.\nThe body knows beforehand, the needs.",
				"added": 1557074260
			},
			{
				"comment_id": 9,
				"body": "> [quantumworld](#comment_32_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): h3bhkj5gqz4n3pjm Ok, technically we are in a living universe. And the creator wanted a good joke to tell the universe and he created earth, and humans. That's really all you need to know.. The rest of the stuff is just pointless bad jokes.\n\nuniverse, creator god, never seen them.:intellectual creations, there is the joke.\n\nI talk about what I see and observe:it's also why I said per se god does not exist.",
				"added": 1557078719
			},
			{
				"comment_id": 10,
				"body": "> [anonymouslogin](#comment_11_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Evolution is based on the increased or decreased fitness of mutation in genetic code. Otherwise known as mistakes. It's not a forgiving world for mutant organisms with a fitness decreasing mutation. They either don't survive, or they don't procreate and pass their alleles on to future generations.\n\nNature don't do mistakes. Breeders (of plants, of animals) cross species to give a new species: NO EVOLUTION NEEDED.",
				"added": 1557232164
			},
			{
				"comment_id": 11,
				"body": "> [anonymouslogin](#comment_12_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Really? Unregulated cell growth commonly known as cancer isn't a mistake? Always caused by the lack of apoptosis or programmed cell death.....you're out of your league here. Go sing a hymn in a church somewhere.\n\nnope, death is biologically normal, you really 'were raised' 'in the cult of individuality'. everything dies and everything must die.",
				"added": 1557263206
			},
			{
				"comment_id": 12,
				"body": "> [anonymouslogin](#comment_13_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Interspecies crosses don't work. Give me one example where breeding is possible and the outcome isn't sterile or unfit for survival. Hybridization of phenotypes within a species works, and I believe that is what you are referring to. The result however is not a new species.\n\nyou're really stupid, according to you, how many dog species there are; thousands, how many cat species; thousands, how many rose species; thousands. \nthe pollenization rose grower creates a new rose:\nfor your culture, which doesn't seem 'to be very big':\nhttps://invidio.us/watch?v=gAwiF7il00k\n\nthe dog breeder mates male and the female of two different species.\nsame for humans; there are species of humans: what they called 'races'.\n\nit's crazy:\nNature is Self-Sufficient, it is Intelligent and Creative, no need for God or Evolution it's magical.",
				"added": 1557264173
			},
			{
				"comment_id": 13,
				"body": "> [anonymouslogin](#comment_14_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Specific examples of two different species of dog? \n\n\"Seriously\"\nDon't you know what a biological species is?\nhttps://en.oxforddictionaries.com/definition/us/species\nIncredible.\nThe guy just found out that a Doberman is not a Labrador.",
				"added": 1557266605
			},
			{
				"comment_id": 14,
				"body": "> [anonymouslogin](#comment_15_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): To assess different skin color as different species of humans is ridiculous. Prove to me that you're capable of comprehension and I'll be happy to explain it in great detail to you.\n\nI'm not talking about the colour of the skin, but the shape of the skull, for example. Of the specific average height of a population. Of the length of a knee or forearm that is different from one group to another.\n\nPeople do not realize it, but there is not a single species of human, but many human biological species; hundred in fact.",
				"added": 1557353711
			},
			{
				"comment_id": 15,
				"body": "> [anonymouslogin](#comment_18_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): reproductive isolation\n\n\"reproductive isolation\", precisely, is what makes endogeneity.\n\nI've always been a suspect of 'evolutionists', I remember years ago seeing a video of the other tartuffe Richard Dawkins,\ntaking his little girl in his arms and trying to explain that the feelings he had for her were based on the absence of God.\n\n???\n\nTo instinctively understand mental control when it is exercised, I thought to myself, that if the pope or rather preacher number 1 of Evolutionism was trying to manipulate in a video he produced,\nso it was better to have an investigation into this theory more deeply.\n\nNow I know that biologically this one doesn't make any sense. And Know too that nature Acts in an Intelligent Way and Therefore Not in a Mechanical Way.\nIt destroys Many Many Things, not just Evolutionism.",
				"added": 1557361191
			},
			{
				"comment_id": 16,
				"body": "> [anonymouslogin](#comment_19_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I'm not positive I understand where you are going with this, are you equating evolutionists with pedophiles?\n\nThoughts do not define membership in a group as fake as evolutionists, or religious, or any other group.\n\nTo have a thought is just that, to have a thought, and that is why thoughts change according to life, according to what we have understood about it.\nSaid to be atheists or evolutionists, or even religious NEVER MEAN ANYTHING.\n\nAND SHOWS THE PERSON'S CONFUSION ABOUT THEIR TRUE IDENTITY. IDENTITY that is just, an animal that has been able to develop and understand things like any other animal.\nIt is this knowledge, this self-knowledge, that makes man or any other animal, not the other way around.\n\n\"I'm not positive I understand where you are going with this, are you equating evolutionists with pedophiles?\" what's the \"missing link between the two\"? lol.\n\nendo- and -geneous.\nFrom the ancient Greek ἔνδον, éndon (\" in \").\n\n=In a group, or the same group\n\nThe group gene if I can call it like that, is just the biological technical characteristics that define membership in a biological group:\nthe technical characteristics being the morphological characteristics of the individuals.\n\nThis defines the group membership,\n\nand why it is so dangerous biologically to mix populations, because intrinsically (biologically) they are not made to LIVE TOGETHER and even less to 'REPRODUCE TOGETHER'.\n- NATURE STRIVES TO MAKE DIFFERENCES, DIFFERENT GROUPS,\nIT WOULD BE GOOD \nTO RESPECT THIS DIFFERENCE.\n\nANY ATTEMPT TO MIX THE POPULATIONS IS BIOLOGICALLY DANGEROUS, \nAND WILL ONLY LEAD TO CONFLICTS THAT WE \nHAVE POLITLY 'CALLED BY THE HISTORY OF ETHNIC CONFLICTS' \nBUT WHICH ARE IN FACT BIOLOGICAL CONFLICTS.\n\nAny politician or agitator who tells you something different is seriously confused and represents, a danger to the group, any group.",
				"added": 1557403261
			},
			{
				"comment_id": 17,
				"body": "> [anonymouslogin](#comment_20_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): No. Nature does not strive to make differences between groups. The group as a whole strives to increase fitness through evolution....a process defined as increased fitness. You're just trying to draw hate lines based on observable differences. Pathetic.\n\nEvolution is a concept.\nThere is no improvement, I know that this is what underlies this theory of evolution.\n\nHow can we say that a pygmi is better improved than a Sámi\nit doesn't make sense.\n\nNature makes differences, that's all.\n\nhttps://en.wikipedia.org/wiki/Pygmy_peoples\nhttps://en.wikipedia.org/wiki/S%C3%A1mi_people\n\nThere is no hatred,\nI do not come from a world of new-age and of bisournours\nin which it is argued that we are all one.\nIt has no biological meaning, there are hundreds of species of bees, hundreds of species of humans, hundreds of species of dogs and so on.\n\nTHERE IS NO NOTION OF VALUE IN NATURE.\nNATURE DOES NOT COMPARE, it does not make judgments.\nIt makes no sense to say that one species is more or less THAN ANOTHER.\n\nOn the other hand, having studied spiritual and political circles for years, I know that there IS A SICKENING DESIRE to want to make A UNIQUE SPECIES,\nTHE UNIVERSALISM THAT IS SO OFTEN FOUND IN FREEMASONIC TRENDS.\nThe famous globalism, with one people, no borders, one currency, a unique language, etc. etc.\n\nIT'S NEW-AGE DELIRIUM, \nIT'S NOT BIOLOGICAL, \n\nand it WILL NEVER BE REALIZED\nNEVER.",
				"added": 1557438779
			},
			{
				"comment_id": 18,
				"body": "> [holyghost](#comment_8_1F2QfFQvM5hn22fnDWpDieTesVmffaivtx): Jesus can suck on my motherfucking nuts and god can watch\n\nme me me\n\nAnyway, there's no way you can understand what that means.\nIf you don't like that remark then you shouldn't have started.",
				"added": 1557619492
			}
		],
		"1544035235_1GtwWtJ66M2wm3raW2ZvUByneLefcsscBf": [
			{
				"comment_id": 19,
				"body": "Generations with the only desire: TO ESCAPE LIFE.\n\nYou're so lost, gosh. Sometimes I pity you.",
				"added": 1559776909
			}
		],
		"1565620872_1KiEH3VgfMMuHYJVxCuZxpq2eHFzMGwM9z": [
			{
				"comment_id": 20,
				"body": "agencies go fuck yourself where you already know. soon or later we will destroy your beautiful pagan world.",
				"added": 1566104635
			}
		],
		"1566347337_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": [
			{
				"comment_id": 21,
				"body": "great at least these poor child have something to talk.",
				"added": 1566407860
			}
		]
	},
	"comment_vote": {}
}