{
	"title": "燃烧的心",
	"description": "My ZeroBlog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 9,
	"demo": false,
	"modified": 1521903667,
	"post": [
		{
			"post_id": 8,
			"title": "家谱",
			"date_published": 1520861624.949,
			"body": "家谱\n\n曾祖：高大勋，高成勋，高建勋\n\n高大勋：长子高云龙，老三高玉龙\n\n高成勋：高景堂（二），高锦堂（四）\n\n高建勋：高钦堂（五），有一女\n\n高建勋，据爷爷（高钦堂）回忆，曾祖年轻时喜欢抽鸦片，自家有十几亩地种植罂粟，买鸦片的地方在当时村南十里铺桥头往东，有一间房子。曾祖抽鸦片散了土地，避免了文革和解放战争时期斗地主的厄运，也算是塞翁失马。知此，每年过年祭祖，定为曾祖点上三支好烟。\n\n高钦堂，1948年参军，1949年建国前入党，第15军43师127团1营，复原之前是云南思茅江城步兵连连长，文革时期被打成右派，观音寺镇一个姓张的书记所为。入党介绍人，据爷爷回忆是河南林县（林州）赵村的刘明全和卢福锁。其师长为张忠献（经查询，15军43师师长是张显扬，都有一个xian的读音，可能是老人记忆有偏差）。生活习惯好，睡前喜欢按摩头皮，搓手指，按摩脚，年轻时常起床晨跑，我上小学时爷爷已经70多，但还常常晨跑。曾记得，爷爷讲过云南剿匪时期在云南一个叫龙山的地方，土匪叫龙文，连续白天打晚上休息，之后白天打晚上偷袭，打下土匪窝之后，残忍灭其家族，全部尸体摆放在师长指挥室门前。爷爷打仗时候的军功章有一抽屉，父亲年幼时候还经常玩，现在都遗失了，只剩下复员证和一把步枪军刺。复原时候带回来很多值钱的金银首饰，文革的时候上交过，也被偷过，偷那几双银筷子（银筷子是为了防止路上被人下毒）的据说是前边邻居的姐姐，丈夫早死，家庭破碎。具体年份不详，据母亲回忆，爷爷年轻时会经常眩晕，不能站立，后在村北苹果树林每年清明前后采食大量羊肚菌，后眩晕自愈。某年，为村上高要福家救人献血，据说有一瓶，后被打成反革命时，反遭高要福之父落井下石，其父结局很惨，据说死腐其室而人不知。某年一女知青怀孕，被马文误诊致死，后马文因此入狱，我小时候曾亲眼见到马文为爷爷针灸。某年，在南关桥头，被车撞至桥下，自己又爬上来，没有讹钱，回家之后才感觉腿部不适。当年的知青还有爷爷的老战友，曾至家探访，老来能见到当年舍命拼杀的战友，心里百感交集。"
		},
		{
			"post_id": 7,
			"title": "2017年中国的环保“劫”",
			"date_published": 1507193805.457,
			"body": "2017年所谓的供给侧改革，却是以环保禁令的方式开展的。\n\n2017年环保政策干预下危及的行业如下：\n1  养殖业：养殖业和畜牧业环保禁令，要求在2017年年底之前，主要河流沿线和国家划出的禁止畜牧业发展区域内的所有养殖户必须全部退出。强制退出导致一夜之间市场上到处充斥着强制卖出的家禽，普通肉鸡价格最低跌至1.7元/斤，鸡蛋价格暴跌至八年前的低价位，养殖户损失惨重。\n\n2  钢铁煤炭水泥有色等与污染直接相关的行业里，强制民营企业退出，国有企业试图垄断这些领域，在煤炭钢铁产量被打压，价格出现回升的情况下，市场上赚钱的企业几乎全是国企。所谓的供给侧改革是以国进民退的方式推进的。真不要脸。\n\n3  化工造纸农药等。这些领域国有企业难以全部垄断经营，但是环保禁令却也同样有效，江浙一带的基础化学原料生产商被强制缩减产能，造成市场供需出现失衡，价格猛涨。甚至废纸的收购价也出现前所未有的高价位，一直以来处于亏损状态的造纸厂一时间变成了现金奶牛。\n\n基础原物料几乎都在涨，这是要人为制造通货膨胀的节奏吗？第一次切身体会到一项国家政策对实体经济的冲击力度。"
		},
		{
			"post_id": 6,
			"title": "黄金适不适合避险？",
			"date_published": 1507085488.177,
			"body": "未来一年是不是一定会出现危机？先来看看潜在的风险点吧。\n\n1  时间节点上，十年一次的经济危机周期在时间上已经吻合。\n\n2  美国2017年10月开始缩表，美国收缩战略势必带来新兴市场国家波动\n\n3  美国股市高高在天上飞，向下空间远大于向上空间。\n\n4  印度废钞运动已经对经济造成了重创，中国的政治危机，盗国贼海外大量资产面临被查封的命运，是被没收还是鱼死网破？\n\n5  美国特朗普本身就是一个黑天鹅。\n\n6  郭文贵爆料中提到的，美国可能史无前例的清算朝鲜问题。\n\n7  中国房地产限售限售期普遍是两年，就好像政府早已经知道这两年会发生什么问题似的。\n\n历史上每次发生危机，黄金表现如何呢？\n\n太过久远的就不提了，美元跟黄金挂钩时期的经济危机没有参考性。1987年美国股市崩盘后，黄金是有短暂冲高的，短暂冲高499美元，然后才开始的漫长的下跌，1997年亚洲经济危机期间，黄金也呈现短暂冲高的下跌盘整势，2008年，在次贷危机爆发初期，央行开始降息和注资股市，黄金从650蹿升到1011，在贝尔斯登破产引发金融危机之后，黄金震荡下跌，雷曼破产美国开始QE，黄金又从700美元开始冲击主升浪。其中，欧债危机，墨西哥债务危机，都会让黄金短期躁动。\n\n黄金跟货币供应量，长期通胀水平，全球经济走势，小范围的军事冲突或者经济动荡，有很高相关性。下一场危机美国受到冲击的可能性会较小，反倒是新兴市场国家才是危机的主战场，与危机带来的财富蒸发速度想比，黄金确实有保值功能，但也只是保值，而不会带来比资本市场收益率高的太多的收益。\n\n全球量化宽松越来越像一场大骗局，随意印发货币就可以将危机转嫁到每一个人，让大家消化。贫富差异过大的欧美日，即便是数额庞大的QE仍然不能让通胀恢复到预期水平，因为中下层哪里有充裕的资金？各种各样的贷款就是当代的封建地租，也是当今社会的稳定器。纸币早晚一文不值。"
		},
		{
			"post_id": 5,
			"title": "下一场危机何时开始？",
			"date_published": 1502190062.641,
			"body": "十年一次的经济危机，眼看时间点就在眼前。\n\n下一次经济危机会以什么样的形式展开在众人面前呢？谁都想知道。看着高高在上而且估值不高的美国股市，真希望美国股市崩盘是下一次危机的导火索。环布在中国周围的地区风险，东北朝鲜问题，西南印度边界冲突，远在美国的郭文贵发起的政治攻击，世界范围内的反洗钱诱惑，中国国内的债务风险及一系列的潜在灰犀牛，只是，上一次经济危机央行们超发的QE还没收回，紧接着再来一场危机的话，那纸币得贬值成什么样子？我已经迫不及待的想把所有纸币都换做黄金来应对这场风暴了。政府发行纸币，越来越变得像是强制的公开诈骗。"
		},
		{
			"post_id": 4,
			"title": "中国的瘸子路线",
			"date_published": 1500714128.966,
			"body": "是你们的马克思主义政治经济学强调的，经济基础决定上层建筑。\n\n而实际操作上，国家领导人一面强调这中国会加速推进对外开放，另一面，却在控制言论自由，切断VPN，减少外文教材使用，限制外汇兑换额度，甚至不惜动用国家力量暴力处理社会矛盾事件。不断上涨的维稳经费，是否能让吉安大神仙们踏实呢？整个社会充斥这对政府的不信任，政府从来不敢正视问题矛盾的存在，他们没有自信，也没有公信。任何社会事件，禁止在微博评论，禁止关键词出现，删帖，删微信，抓人，白色恐怖也好，文字狱也好，怎样形容都不过分。\n\n当下的上层建筑，明显已经不能够适应经济的发展，担心既得利益被破坏的盗国者还在拼命修补这破船上的漏洞。领导人一茬一茬的换，每一茬都要构建起他们的子孙后代的财富基石。新旧势力的更迭，自然就演变成财富的争夺战。打击贪官，无疑是中国最赚钱的买卖。贪官们辛勤贪污一辈子的金山银山，被共产主义的正义之名强行征收，落入新领导的口袋。蒋介石曾对儿子说反腐亡党不反腐亡国，而今是党就是国，国就是党，如果还不切割，那反腐就是亡党亡国。\n\n都说趋势一旦形成，便很难改变。民智已经开启，但中共却很显然在跟整个民智唱反调。逆历史潮流者，我倒要看看你们是怎么被历史的车轮轧的粉身碎骨的。"
		},
		{
			"post_id": 2,
			"title": "中国银行业的不良贷款是怎么降下来的",
			"date_published": 1499313832.845,
			"body": "银行贷给企业的贷款在经济持续下行，传统制造业不景气的大背景下，\n\n是非常容易产生违约风险的。国家是怎么做的呢？本届政府上任伊始，金融放松监管被当做新一轮国企改革的头门炮。打破银行垄断，设立民营银行，民间借贷合法化，允许设立各类P2P和担保公司。2015年下半年，银行开始收贷款，对民营企业许诺，只要把贷款还上，下一笔贷款会很快批下来。民营企业就在银行的欺骗下，纷纷去借短期的高利贷还银行，结果银行收紧贷款，短期的高利贷滚来滚去就成了越来越还不上的吃人恶魔。而P2P也是在这样的环境下断了资金链，纷纷破产跑路。债务风险，就这样被政府操纵下的银行轻而易举的消化了，留下的是几百亿跑路的e租宝债权人，留下的是余欢案那样的民营企业和催债团队。国家高度垄断的银行业，根本不把民营企业的利益放在眼里。每一个银行都像是吸血鬼，而且是政府保护，绝不会死的吸血鬼。"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}