{
	"title": "Blue Ants",
	"description": "This is a fictional story!\nScientist Simon Eberl begins his most ambitious experiment: implementing sophisticated and reduced brains in ant heads to create an intelligent generation. But he will have to face his colleagues, competitors, society and the creatures themselves.\n## Chapters\n[1- Genesis of a Nation](http://127.0.0.1:43110/blueants.bit/?Post:1:Genesis+of+a+Nation/)\n\n## Profile\n* [ZeroMe](http://127.0.0.1:43110/Me.Mkg20001.bit/?Profile/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/1PuJkXaZCzPnSKGRa9a9yk1sjmyW9Lfc9Z/blueants@zeroid.bit)",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 2,
	"demo": false,
	"modified": 1491891988,
	"post": [
		{
			"post_id": 1,
			"title": "Genesis of a Nation",
			"date_published": 1491720660,
			"body": "It all seemed very quiet at the Institute of Molecular Biotechnology of the Austrian Academy of Sciences. The slow-moving scenario changes when a team of researchers develops from the stem cells the first miniature of the human brain in the laboratory, which they call \"brain organoids,\" meaning human micro-brains with only a few Millimeters in diameter. Despite their small size, these structures had the same areas that the brain of an embryo would present with nine weeks of development.\n\nTaking advantage of this, the controversial scientist Simon Eberl, decides to test the Micro-Intelligence of a Micro-Brain on ants, and begins to perfect this brain and to diminish its size more and more. He did not want it to be a small brain of a fetus, but a small, fully developed brain. He has altered the genes of this brain, and wants to see this power applied to ants. To do this, uses Biological Programming to apply the genetic sequence of this brain in the DNA of ants. He also adds to the genetic code an instruction for them to have a blue head. He also programs that worker ants be fertile males and females, that the queens are the same size, and that this ant species lasts for as many years as humans. In addition to these, Simon made several other adjustments to make these blue ants special. To put it all into practice, Simon uses a queen ant as a surrogate, forms the embryos and starts to care for it. The fruit of this experiment are blue-headed ants with human intelligence. Although their brains are so small, they have reasoning, intelligence, memory, and other skills as accurate as those of humans.\n\nAmong all the litter, for the ant that attracted the most attention, Simon gave the name of Dedicated. Dedicated always worked hard to work, was always affectionate with his mother and never gave problems. Simon provided him with libraries, a microcomputer with internet access, and the ant is educated with the best teachers. The other ant of the litter, Dedicado's brother, is called Malvo. Malvo showed that he did not like his brother, as well as being cruel. Even though Simon is very attached to Dedicated, he declares that it is time for all the ants to leave and spread throughout the world. With the help of secret volunteers, blue-headed ants are spread throughout the world, communicating with the team of scientists, receiving instruction and learning various technologies, including firearms. With robotic ants, controlled by several people chosen by scientists, the blue ants were fed, living secretly underground.\n\nMost of them were gone - including Malvo - leaving only Dedicado and his wife Natty, since Simon wanted to prepare himself more for the departure of his best friend, and to make him a good home. Simon enters Google Maps and finds a pretty house - and away from there, and with a microplane built by Dedicated, Simon sends his friend and his friend's wife Natty there. With the instructions in hand, Dedicated drives the plane manned by him and Natty. Because it is such a small plane, the speed is very high, using propellers and various rocket technologies. The plane used natural resources as fuel, and for that Dedicated and Natty could rest easy. The quiet ends when his wife Natty begins to go into labor. Dedicated lands the plane on top of a tree, and helps Natty in childbirth. The baby is born (larva), and Dedicated embraces him and his wife. The plane falls from the tree, and while Natty holds the baby, Dedicated desperately tries to take control of the plane. When he is about to break, Dedicated manages to take control, and within a few millimeters of the ground, the plane begins to pick up altitude. After the scare, they return to being quiet and celebrating the birth of a new life, that together they did. As the plane approached the destination, Dedicated slows down so it does not get a big impact. The plane lands smoothly on the sidewalk and everyone descends happily. Dedicated's wife can not hide her contentment with her larva (baby) on her lap. They climb on the stairs, raise the larva and call it Dedicated II, in honor of the Dedicated and Simon Eberl.\n\nWise with his studies, Dedicated does not accept the situation of living cloistered in subterranean tunnels. He decided that he wanted to build a metropolis in the backyard of that house. The robots, controlled by people chosen by scientists to protect and feed the ants, promptly lift Dedicated and lead him underground. Brave and intelligent as ever, Dedicated has a great idea, based on his studies. He recalls that as he flew over the house, he saw a terrarium with a beach inside. Dedicated manages to stop all these robots taking them to the freshwater \"sea\" of this beach, where they are electrocuted. Dedicated begins to build Formigópolis - The City of Ants. More blue-headed ants appear, and all unite to raise the city. Coincidentally, in that house lived a nice little boy, whose name is Andrew Eberl, who wanted to make a city there. Empty juice box, cardboard boxes, plastic like bus stops and shelters against rain, etc. The little boy, who could not talk to Dedicated, even without knowing it, was united with him in the construction of Formigópolis.\n\nAndrew picked up an empty ice-cream pot, put a cup in it written \"King's House,\" another small cup with plenty of food (roasted locusts, selected grains, rock-breaking seeds, among others). Then he closed the pot, made a hole in the center of the lid, attached some straws to each other and put in that hole, to serve as a tunnel and bridge. At that moment, his father worked with cement to build a potty for cats to urinate. Andrew then picked up some cement, and went through the hole in the lid to secure the straw and plug the hole. He also passed a thin cement wall on each side of the straw, making it look like a bridge. Near the ladder in the yard above Formigopolis, Andrew dug a 3-sided hole and buried the ice-cream pot. He called the bridge to the terrarium on the third and last step of the stairs. That's where Dedicated electrocuted the robots.\n\nThis terrarium had land on the right side, and sand with water on the left side, simulating a large beach for the ants. With the reload of a pen, Andrew made a hole in the earth for the blue ants to make their habitat there. Andrew was removing all the insects that invaded the aquarium, including intruding ants that did not belong to the species created by Simon Eberl (blue ants). Andrew shielded the hole from the bridge, burying it in the earth of the terrarium. Andrew placed several foods on the ground, among them: Sesame, Granola, Brown Sugar, Ground Nuts, Oats, among others. Dedicated liked it and entered with his family and friends in that terrarium. He stared at the newly constructed bridge, and decided to explore it - alone.\n\nThe family wanted to go along with him, but he pointed out that it could be very dangerous. Dedicated then, as a heavy rain began to approach. The storm was on, and the valiant Dedicated did not stop. It almost fell off the bridge several times, until it reached the end of it, where there were a few grams. Embraced the woods inside, and nothing interesting saw, only paths trod in the forest of Formigópolis. Sad, Dedicated returned to the terrarium, where he saw no one else in his family. Desperate, Dedicated searches for them in all the subterranean tunnels of the terrarium - without success, until he finds a hole. It is the entrance of the straw. Dedicated comes in with all his momentum, and he follows. When it reaches the end, it enters the pot of ice cream buried 3 feet from the ground, and sees a noodle cup written \"House of the King\". He enters the plastic curtain and finds his family in the comfort of the new home, Dedicated embraces them, and gives many laughs in knowing that the bridge (straw) is just a path to the forest, and inside it, there is a path to the pot of ice cream.\n\nMonths later, Dedicated and his family take some food from the other glass, leave several times the ice cream pot and gradually build the house. Dedicated is called by several ants to the top of the ladder, and is proclaimed The First King of Formigopolis. At the time, a forest ant comes desperate says some red-headed ants are very sick in a neighboring village. Dedicated enters his plane, which was all dusty - with a strange dust, and headed towards its destination. At that moment, Dedicated hears the sound of several mammals surrounding the plane. The plane crashes into a mamangava, falling on the ground.\n\nIs this the end of Dedicated's journey? Will Dedicated be known in the future as Detonated? Who will be the new king if Dedicated II is just a larva? All this and more in the second chapter of Blue Ants!"
		}
	]
}