{
	"posts": [
		{
			"id": "df2d16d7-46e7-4fad-bdb5-4cefacd17620",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "17f22a9d-8c86-440d-a727-262dcc4af749",
			"body": "Does anyone know what this does? It's from ZeroID after just loading the page.\nAnd how about \"wrapper_nonce\"?\nAll zites seem to use them, but googling the strings I can't even find what source code is supposed to contain those, let alone any documentation of them. And this zite seems to still request an all.js for some reason even though it's not supposed to use one.",
			"time": 1566678249173,
			"files": "[{\"name\":\"zeroid.png\",\"thumb\":\"3f5e6ed8008ffe113618385692857a6970313c1b-thumb.png\",\"size\":95457,\"type\":\"image/png\",\"original\":\"3f5e6ed8008ffe113618385692857a6970313c1b.png\",\"directory\":\"1Mpo4AjjN7L2WUsghVr48VT5woouH7Dmkg\"}]",
			"last_edited": 1566679723645,
			"subject": null,
			"capcode": null
		},
		{
			"id": "1275a5c5-c9c7-4745-95fd-cc31865d7972",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "843af125-8c1f-4517-8384-e6d14c97942f",
			"body": ">>97b5dadb-b2f7-4a51-a356-b605e6e9fbca\nHow is that easier than installing tubeup? In any case, installing ZeroNet system wide is inconvenient. Better keep it on a local install to be able to easily spin up a new instance.",
			"time": 1566678905300,
			"files": "[]"
		},
		{
			"id": "184dc6b5-ceea-4f36-90b5-48fea5160a5f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "843af125-8c1f-4517-8384-e6d14c97942f",
			"body": ">>87367e20-be3c-4c69-afed-628aecc9e77e\nRight. And then what do you do to make a second install? And does that configure it to use the Tor daemon's auth_cookie?",
			"time": 1566679404645,
			"files": "[]",
			"last_edited": 1566679472845,
			"subject": null,
			"capcode": null
		},
		{
			"id": "224121bb-9996-4fe3-86c4-01fc6e4f1fc8",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "17f22a9d-8c86-440d-a727-262dcc4af749",
			"time": 1566679915334,
			"files": "[{\"name\":\"all.js.png\",\"thumb\":\"35f987d172356bf567a09f12cc1ee01b22a8088f-thumb.png\",\"size\":215240,\"type\":\"image/png\",\"original\":\"35f987d172356bf567a09f12cc1ee01b22a8088f.png\",\"directory\":\"1Mpo4AjjN7L2WUsghVr48VT5woouH7Dmkg\"}]",
			"body": "Edit: seems to be src/Ui/media/all.js\nMaybe ZeroFrame requests it.",
			"last_edited": 1566723492593,
			"subject": null,
			"capcode": null
		},
		{
			"id": "51a7ee6d-2031-43e8-877f-2c49df8d2a59",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "7b8427a7-c4d6-46d3-bfec-d16be8c74bea",
			"body": ">>18ae2126-e5b5-4908-b566-285207c3065f\nOr maybe it's just controlled opposition and both the Israeli and American jews are just playing along with their controlled opposition... But it's not like American Jews automatically get Israeli citizenship for being jews, right?\nAnd at least Trump is [deporting those illegal immigrants](https://www.politico.com/story/2017/08/08/trump-deportations-behind-obama-levels-241420), right?",
			"time": 1566722902570,
			"files": "[]"
		},
		{
			"id": "43fd9f67-85b4-4e6e-8a0a-0b4a068dd915",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "b45720e1-3884-4328-a831-0cdc2ce039dd",
			"body": ">>6b96c28a-4aee-4d4a-9155-8d2e3fc7463c\nIn an Ancap society non-mulsim people (who are the majority) would pay mercenaries to kill extremist muslims, and if you don't pay you'd be excluded from homeowners associations, schools, worker's unions, etc. Non violent muslims would be kept out of white areas by  the same mechanisms.  You don't need everybody to be some kind of freedom fighter. You just need a few leaders with initiative and the rest to follow the path of least resistance.\nLibertarianism has other problems (mainly the accumulation of power leading to proto-governments, which makes it kind of impossible in practice) but muslims isn't one of them.",
			"time": 1566724870177,
			"files": "[]"
		},
		{
			"id": "0fcae3a6-a764-418f-9e38-05a436137498",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "b45720e1-3884-4328-a831-0cdc2ce039dd",
			"body": ">>419a20e4-dac5-4d36-b266-1a3887de5b3b\n>That's an overestimation of people's ability, in general, to plan ahead. It's utopian.\nWhat do you need to plan ahead?\n>Also, again, there's more than just Muslims who desire control over others.\nSure, everyone desires to have control over everybody else. The question is whether they can get it.\n>There's fundamentally nothing stopping that same mercenary group you'd pay to deal with your problems from turning around and enslaving you and your neighbors.\nIf this is true, then what stops the current day military from enslaving us? There are two answers to this.\n1. Nobody would want to rock the boat and paint a target on their back to be exterminated by other factions. There wouldn't be just one paramilitary group, there would be many groups. And some of them would cooperate with civilians to get access to their skills and resources (some of which can't be stolen, like social connections, bank accounts in other countries, popular support, etc).\n2. They kind of already do. The government enslaves us by pointing guns at us and threatening to shoot if we don't pay taxes. Which is why I said that the reason libertarianism is kind of impossible is because proto-governments would form through accumulation of power (not just military power though). But there are multiple degrees to which people can be enslaved, and maybe it's possible to push society towards less enslavement (less taxes).\n>You seem to expect everyone to be on the same page when it comes to this, and that's just not realistic.\nNot really. But there is indeed a certain degree of \"being in the same page\" for homogenous populations.\n>It really doesn't matter who's the majority when you extrapolate over time and take migration into account.\nYes. Immigration woudl have to be stopped or heavily regulated.\n>All it takes is large enough pockets to overwhelm local groups.\nI admit a certain level of large-scale cohesion is necessary, yes.\n>Anarchy is always transient because of this. It's a temporary state. Over a long enough timescale it will always end up with people being controlled by other people.\nI agree. But fascism isn't necessarily any better. There's no guarantee that the powers that be will be benevolent dictators. Maybe they're in fact likely to be despots, because they enslaved people to accumulate the kind of power they have. \"Democracy\" should be slightly better in theory, because people have a way to reduce the level of enslavement if they want to (just vote the parties promising less taxes) and you can only brainwash people so much. And maybe it is, since the most closely controlled people live in non democratic countries like NK, China, Cuba, etc. I can't think of a single country that has or had a beneficial dictator. Maybe Franco would qualify actually, now that I think about it.\n>Muslims are just one of these groups that would seek to control.\nMuslims (or chinks for that matter) are too dumb to control white people. It's jews and bad whites I'm more worried about.",
			"time": 1566728334900,
			"files": "[]",
			"last_edited": 1566728624600,
			"subject": null,
			"capcode": null
		},
		{
			"id": "6435d4af-d375-4a8e-87a6-371c25a9b34f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f3419434-0eb7-4416-9d86-54997830109a",
			"body": "Because jews might make the middle east suck less, but they make the rest of the world suck more. Muslims are an easier threat to deal with, because they are dumb and brown, so they can be detected and dealt with very effectively. The reason they aren't is precisely because the jews have brainwashed white people not to. And the jews have infilitrated white society in the first place because they're naturally good at camouflaging as white people.",
			"time": 1566728521100,
			"files": "[]",
			"last_edited": 1566728539800,
			"subject": null,
			"capcode": null
		},
		{
			"id": "45236d43-2704-4845-96a5-2e13c0d4f5dc",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "843af125-8c1f-4517-8384-e6d14c97942f",
			"body": ">>192b800b-2264-4f56-bd6c-533b58e2d559\n>You edit some scripts\nSounds hard-ish.\n>but there's not really a reason to make a second zeronet install anyway.\nSure there is. For instance, to test if an issue is local to your install or is global to the system. Or if you mess up your install but want to keep the data files just in case.\n>You add the zeronet user to the tor group and make the auth_cookie group-readable.\nSure. Which as I said, is harder than installing tubeup. **And much harder than just clicking on an .exe**",
			"time": 1566728907700,
			"files": "[]"
		},
		{
			"id": "28e477b0-8ab0-46a3-8633-ec249378c416",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "d05790bd-2d6c-4c92-a5ca-c29b0d56eae4",
			"body": ">>d05790bd-2d6c-4c92-a5ca-c29b0d56eae4\nThey went to cuckchan most likely. Let's be honest m8, a lot of them were boomers and schizos who fell for the\n>muh tor is a honeypot that makes it easier for the NSA to track you\nso they sure as hell won't be posting here.",
			"time": 1566730319794,
			"files": "[]"
		},
		{
			"id": "96eddea0-7c5f-4eac-88d1-4715ea305399",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "83eb0eda-72a5-4cb8-bc47-90c0b4a5788f",
			"body": ">>da6d150e-14c1-4c1a-a24d-1df67c5cdf52\nTo be fair to him, video encoding takes an incredible amount of CPU power, and the result will not have the same hash that other people's encodes if you don't use the exact same algorithm, which would have to be written in javascript making it even slower (unusably slow).",
			"time": 1566732780480,
			"files": "[]",
			"last_edited": 1566732889080,
			"subject": null,
			"capcode": null
		}
	],
	"boards": [],
	"modlogs": []
}