{
	"next_topic_id": 9,
	"topic": [
		{
			"topic_id": 1,
			"title": "Создание новой криптографической подписи",
			"body": "Ребят, глупый вопрос, если я хочу создать новый криптографическую подпись в зеронет, что я должен сделать?",
			"added": 1523535179
		},
		{
			"topic_id": 2,
			"title": "Реализация криптографической подписи и автономность сети ZeroNet",
			"body": "Господа, я читал информацию в одной из местных зеронет-вики, что для создания пары ключа-никнейма в ZeroID, данный сайт обращается на клиарнетовское зеркало, где это все происходит. И мол, тот автор статьи утверждал, что если то зеркало упадет, то эта функция перестанет работать. Так вот, меня интересует вопрос, насколько зеронет в целом автономный и независимый. Будет ли он дальше самостоятельно функционировать, даже если разработчик забросит его развитие полностью?",
			"added": 1523780573
		},
		{
			"topic_id": 3,
			"title": "ZeroNet уже без 5 минут децентрализированный",
			"body": "http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:135 - если я правильно понял последнюю новость, то разработчики добавили возможность, чтобы каждый кто имеет статичный IP-адресс, мог становится трекером для зеронет. А значит трекеры уже тоже децентрализированные. Я правильно понял ведь?",
			"added": 1535491316
		},
		{
			"topic_id": 4,
			"title": "Альтернативные сайты для подписи в ZeroNet",
			"body": "Привет ребята. Меня интересует то, есть ли зеронете альтернативные способы для идентификации здесь помимо ZeroID. Я находил только один здесь: CryptoID.bit Есть ли еще какие-то другие? И да, меня интересуют децентрализированные варианты, которые могли бы регать новых юзеров без привязки к центральному серверу.",
			"added": 1536011241
		},
		{
			"topic_id": 5,
			"title": "Клонирование НЕклонируемых зайтов в сети ZeroNet",
			"body": "У меня такой вопрос к вам ребят: допустим кто-то решил опубликовать зайт в Зеронете без возможности его клонирования. И исходников на движок для сайта он тоже нигде не выкладывал. Так вот, мой вопрос заключается в том: могу ли я тогда просто зайти в папку и взять те файлы, чтобы потом использовать их и создать свой клон зайта со всеми вытекающими отсюда.",
			"added": 1539499251
		},
		{
			"topic_id": 6,
			"title": "Два важных вопроса по зайтам",
			"body": "Очень интересуют меня два важных вопроса: \n1) Я правильно понимаю, что если создатель зайта удалит его, то сайт автоматически исчезнет и у других пиров?\n2) Есть ли на зайтах возможности модерации: тобиш удаление постов/вклада других пиров админом либо даже его модераторами, которые назначили а также возможность ограничивание им доступа для определенных пользователей. Или тут только мутить можно блокируя доступ пользовтелей только к локальной версии зайта, который хранится на винте?",
			"added": 1539549508
		},
		{
			"topic_id": 7,
			"title": "Реализация анонимного постинга в сети ZeroNet",
			"body": "Привет. Давно интересна тема полностью децентрализованных веб-форумов с полностью анонимным постингом (вроде 4chan или 8chan). Насколько мне известно, на данный момент существует только один более-менее успешный проект, это [Millchan](http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/). Разработчик активно его разрабатывает и он имеет уже определенный функционал на данный момент. Однако если подходить к этому технически, то постинг там все-же псевдоанонимный, а не анонимный. Дело в том, что ввиду полной децентрализации, любой желающий может зайти в папку с зайтом и посмотреть ID автора сообщения. Собственно у меня такой вопрос: можно ли сделать так, чтобы посты которые привязаны к ID, шифровались в корневой папки зайта с сертификатом, однако при загрузки страниц в браузере с досками и тредами, их текст расшифровывался только в браузере? Близкая схема, насколько мне известно, используется в сервисе ZeroMail.",
			"added": 1540838056
		},
		{
			"topic_id": 8,
			"title": "ZeroMe и Hubs",
			"body": "Привет ребят. Меня интересует вопрос насчет Хабов для ZeroMe, а именно:  как создать свой собственный хаб?",
			"added": 1540938555
		}
	],
	"topic_vote": {
		"1_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": 1
	},
	"next_comment_id": 10,
	"comment": {
		"2_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": [
			{
				"comment_id": 1,
				"body": "> Отсутствие развитие и отключение инфраструктуры это независимые события.\nРазве? Обычно же, если на проект забивают болт и если для его поддержки нужно выделять хоть какие-то средства (те же сайты в клиарнете) то инфраструктура сразу же отключается. Правда спустя определенное время. Это как ТЭЦ, например, можно сравнить. Если туда постоянно не вбубухивать ресурсы, то она остановится.\n> обещают DHT в будущем\nСтоп, а сейчас еще нет до сих пор? Хочешь сказать, что поиск пиров осуществляется через центральные трекеры, которые наверняка еще и в клиарнете находятся.",
				"added": 1523789020
			},
			{
				"comment_id": 2,
				"body": "> [amosca](#comment_3_1NeWTdnBvzZfX98RFr9CFardLk5C6V8fL5): zeroid.bit - не обязательная часть, хоть много где регистрация только через него.\nПочти на всех веб 2.0 зайтах есть ZeroID идентификация.",
				"added": 1523910738
			},
			{
				"comment_id": 3,
				"body": "> [anotherneko](#comment_48_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Бывает так, что инфраструктуру содержат другие люди или она вообще может себя окупать за счет пожертвований.\nДа, согласен. Но мне кажется, что у зеронета слишком низкая популярность, чтобы он теоретически неограничено долго так существовал. \n> Именно. Но в дефолтном списке есть один .onion трекер.\nА что за трекер, а то я не видел?",
				"added": 1523910876
			}
		],
		"6_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": [
			{
				"comment_id": 4,
				"body": "> [balancer73](#comment_446_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Зависит от понимания удаления. Если просто сотрёт у себя каталог, то у других ничего не исчезнет. Если целенаправленно сотрёт содержимое зайта, оставив один content.json и в таком виде опубликует — то исчезнет.\nТ.е. по-сути если я создал какой-то сайт, а потом понял что у меня нет на него времени и захотел его у всех удалить, чтобы он не весел \"мертвым грузом\", то я могу запросто это сделать. Правильно?\n> Владелец зайта может подписывать изменения в data/users: http://127.0.0.1:43110/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/?Topic:1538993787_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/\nХмм... Звучит интересно. До делать это можно только вручную, предварительно зайдя в ту папку? Или это поддерживается прямо в некоторых движках зайтов создавая такую себе мини мод-панель. И как насчет ограничивание доступа в правах \"записи\" или даже \"чтения\" для некоторых ID со стороных создателя зайта?",
				"added": 1539575456
			},
			{
				"comment_id": 5,
				"body": "> Даже если это не поддерживается со стороны api то можно модифицировать свой клиент сооветствующим образом. Совместимость с остальными при этом останется.\nА такие модификации уже существуют для движков сайта?\n> Можно установить нулевой лимит доступного пространства, что сделает невозможным для пользователя опубликовать что-либо. Ограничений на чтение нету, можно разве что зашифровать сообщение.\nЭто можно настраивать для каждого отдельного пользователя получается? \nПолучается если с этим поиграться, то костыльным методом можно запилить возможность как обычных банов, так и no-read банов.",
				"added": 1539593977
			}
		],
		"7_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": [
			{
				"comment_id": 6,
				"body": "> [anotherneko](#comment_109_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Зачем? Для полной анонимности достаточно просто генерить новый ID на каждый пост.\nНо ведь в таком случае как проводить модерацию контента? Я имею ввиду мьютить пользователей.",
				"added": 1540884109
			},
			{
				"comment_id": 7,
				"body": "Ну хочется ведь тогда самое лучшее взять из вариантов :)\nАлсо, а зачем тогда каждый раз генерировать новый сертификат? Не лучше ли тогда полностью от них отказаться?",
				"added": 1540924952
			}
		],
		"1_1BfSUGhNmbYZHDgLw67nu2b9LbbPne92Dz": [
			{
				"comment_id": 8,
				"body": "Ты имеешь ввиду мобильный клиент?",
				"added": 1541539015
			}
		],
		"1_1PT9pN8Cuw62Vvs95xKmHJNYgo86vFwVE3": [
			{
				"comment_id": 9,
				"body": "Ты про тематику? Или движок для блога?",
				"added": 1542465662
			}
		]
	},
	"comment_vote": {
		"403_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"1_1LqR5zxKufzzvmkbbrTHdbn3cHRsefLTz3": 1,
		"12_1FfJqTpKxtW6jzKnHLpUswhWHwwtYTz5YK": 1,
		"453_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1
	}
}