{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1634939571,
			"title": "Tor 250 error",
			"body": "Hello. When I install Zeronet on my Mac and run it, it connects to the tor network, but it says 250 next to it. What is this error caused by?",
			"added": 1634939570
		},
		{
			"topic_id": 1635380995,
			"title": "Speak fluent english",
			"body": "I understand English, but I have a hard time talking to someone face to face. Do you have any suggestions on this?",
			"added": 1635380993
		}
	],
	"topic_vote": {
		"1634939571_1NZLf9ua6XqTiK2SLyJMhN9pZhUVJVPi6g": 1,
		"1635185231_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1635185231_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 1,
				"body": "I practiced the breathing exercise for a long time. The stress in my body was significantly reduced. I'll start again sometime.",
				"added": 1635194310
			}
		],
		"1635380995_1NZLf9ua6XqTiK2SLyJMhN9pZhUVJVPi6g": [
			{
				"comment_id": 2,
				"body": "> [musickiller](#comment_2_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ):  R\n\nVery few people can speak English in my country. I usually try to read something and listen to something to learn English. It is a little difficult to meet with English speaking groups due to Covid.",
				"added": 1635430447
			},
			{
				"comment_id": 3,
				"body": "> [jahad](#comment_1_1D84W2XsKnfgA97RAwnP7iHowbsYMoi7wy): To be fair, 'pirate language' is also a thing: Our ancient predecessor (ancient silk road) talking in order to buy and sell goods in limited way but it works. Maybe, what you actually wanted is to be better than that a.k.a LOOKS COOL: my advice is to read more idioms and talk with it. All in all it's about to communicate that being said if it's still too hard ignore the words and talk with your body language! that works too [...]\n\nYes, my mother tongue is not English. I usually falter and skip words the way you say :D\n\nThanks for your suggestions",
				"added": 1635869648
			},
			{
				"comment_id": 4,
				"body": "> [musickiller](#comment_2_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): yup. Talk more =D With practice it will come. Find someone who is patient enough, or just many different people. [...]\n\nAlmost everyone I asked this question gave the same answer. The problem is that there are not many English speaking people in my country, so I can't speak English to people. I also falter when I have to speak English",
				"added": 1635869796
			}
		]
	},
	"comment_vote": {
		"686_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"309_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"2_1Cpr9kX9gxHKgmfaGVoxoAdMdYZLVUt2QC": 1,
		"1_1D84W2XsKnfgA97RAwnP7iHowbsYMoi7wy": 1,
		"2_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ": 1,
		"9_1N5YTyNeraRGksf76WNQiJ3ZB2ZMMa4pnf": 1,
		"687_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"5_16zLpbqTz9hpy6E2oH3y7tHNiTyVsB4RiQ": 1
	}
}