{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1560679668,
			"title": "ZeroMedia vs ZeroChatIRC",
			"body": "Hi all,\nI have two questions:\n1-What is the difference between ZeroMedia (http://127.0.0.1:43110/zeromedia.bit/) and ZeroChatIRC (http://127.0.0.1:43110/1CjR14fofbRJ54oj8A7rAfWpzpLawdP5uc/)?\n2-Is it possible to embed such a chatroom into a Zite or does it have to be running as a stand alone Zite?\nThanks.",
			"added": 1560679667
		},
		{
			"topic_id": 1560684873,
			"title": "Beaker Bowser. Any feedback?",
			"body": "Hi all,\nIt seems Beaker Browser is designed with the same philosophy as ZeroNet (https://beakerbrowser.com/). Did anyone used Beaker Browser? If so, how does it compare to Zeronet for building websites and sharing files?\nThanks.",
			"added": 1560684871
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1560684873_1AqPs23HT3V8rwqey5F5bXsLMUZUmcMnep": [
			{
				"comment_id": 1,
				"body": "> [caryoscelus](#comment_159_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): We don't talk about beaker browser here since it's direct competition of our cozy network\n\nI don't think so. Zeronet can do much more than just a website, like chatrooms, file hosting etc. From what I've seen Baker Browser can only do a website. You can give clearnet access to both of them, for example this is a way to proxy a site made with Baker Browser: https://hashbase.io/about And this is a Zite proxied to clearnet https://0net.xyz/1PoRTALoun8Y69nSZ5aye9Q87GGrg7EvRc I don't know which one makes it the easiest to build a website.",
				"added": 1560704724
			},
			{
				"comment_id": 2,
				"body": "If you want to make a website, with legitimate content so no worries about privacy, with clearnet access (proxy with SSL) and ability to share editing rights with other members, would you use Zeronet or Beaker Browser?",
				"added": 1560859990
			},
			{
				"comment_id": 3,
				"body": "> [lonelyreader](#comment_40_1PyrAjbZiHyfW7jSWeUpDPSeMU7sAJ5HSs): Yes, of course. I suppose most of the people here are not coming here only for illegal purpose.\n\nThe question was: \"would you use Zeronet or Beaker Browser?\".",
				"added": 1560886910
			},
			{
				"comment_id": 4,
				"body": "Okay, from the comments so far, it seems Beaker Browser has little to offer compared to Zeronet. So I'm going to ask the question differently: what are the pros of Beaker Browser, compared to Zeronet? For example in terms of features or usability. Only the pros, just to see more clearly how it compares, since we all know Zeronet.",
				"added": 1560919290
			}
		],
		"1561032588_1CubdeDePywZpDx99J81tZSjJDNDGCzfzS": [
			{
				"comment_id": 5,
				"body": "I guess you know where to find the leaks of their hacking tools, some are available on Wikileaks.",
				"added": 1561058971
			}
		]
	},
	"comment_vote": {
		"2_1E2oisFHW5NDmTpTmAdBgeyTVbDK4dYk83": 1,
		"162_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"1_1CKKbdH99PeFfraMKFZNmCMAUsTfTQxsKU": 1
	}
}