{
	"next_topic_id": 29,
	"topic": [
		{
			"topic_id": 1584095578,
			"title": "2019年10个最有潜力的新Linux发行版",
			"body": "在本文我们将分享一份我们认为2019年最有潜力的10个新Linux发行版的清单，并对每个发行版进行简要回顾。\n\n由于Linux生态系统是现实生活，所以您可以预期这篇文章会不时更新，或者明年可能完全不同。\n\n现在让我们来看看!\n\n1 MX Linux\n\nMX Linux是一款中重量的发行版，旨在通过简单的配置提供优雅的桌面体验，同时有效地为用户提供高稳定性和可靠的内存性能。\n\n该项目的诞生归功于antiX和前MEPIS社区，他们使用了最好的Linux工具和才干。 它的默认桌面环境是Xfce。\n\n\n2 antiX\n\nantiX是基于Debian Stable的轻量级无系统live CD发行版，适用于Intel-AMD x86兼容系统。\n\n由MX Linux的主要贡献者之一开发，antiX为用户提供antiX Magic在任何类型的环境中，无论新环境还是旧环境，并且能够在只有256MB RAM和2.7GB存储的计算机上很好地工作。\n\n3 ArcoLinux\n\nArcoLinux（以前称为ArchMerge）是一个功能齐全的基于Arch的Linux发行版，它为用户提供了构建自定义发行版的方法，同时还有助于改进随自己的桌面一起提供的多个社区版本。\n\nArcoLinux将Xfce作为其默认DE，虽然它本质上是极简主义，但它包含脚本，高级用户可以通过这些脚本安装他们想要的任何桌面和/或应用程序。\n\n4 SparkyLinux\n\n如果您喜欢使用快速，轻便的发行版，那么这款发行版会让您的眼睛充满光芒。\n\nSparkyLinux是一款基于Debian的超快速轻量级发行版，专为新电脑而设计，但考虑到旧电脑。它具有各种定制的LXDE和Enlightenment桌面，为家庭用户提供了一系列应用程序。\n\n5 Peppermint OS\n\nPeppermint OS是一个基于Ubuntu的发行版，旨在为用户提供创纪录的速度，性能和内存使用效率。\n\n它的桌面环境采用混合LXDE/Xfce，具有时尚的UI，自动更新，以及通过其自己的云和Web应用程序管理工具Ice与基于Web和云应用程序的无缝集成。\n\n\n6 SmartOS\n\nSmartOS是Triton构建的一个聚合容器和虚拟机管理程序，可提供强大的安全性，存储和网络功能。\n\n它是开源的，具有内置网络和存储，轻量级容器主机，虚拟机管理程序，支持实例类型和裸机性能。\n\n7 NuTyX\n\nNuTyX是Linux From Scratch文档LFS和Behind Linux From Scratch文档BLFS启发的发行版，专为中高级Linux用户构建，以及那些有兴趣致力于提高Linux系统技能的人。\n\n由于其自定义包管理器cards，它开发得非常灵活，它使用户能够从端口编译源包，安装单个二进制包，以及安装相关二进制包组，例如像Xfce或KDE这样的DE。\n\n8 Robolinux\n\nRobolinux是一个发行版，旨在为用户提供免费的安全Linux发行版，从而提高工作效率并节省时间。\n\n它具有一键式Windows功能，允许您在某种程度上本机运行Windows应用程序（由于其VM功能）。 Robolinux也热衷于安全性，并确保单独运行Robolinux或与Windows XP，7和10一起运行的用户不必担心病毒或性能问题。\n\n\n9 Archman\n\nArchman是一个基于Arch的Linux发行版，在土耳其创建，易于使用和可定制。它也是为那些可能不愿意尝试Arch Linux本身的用户带来了令人敬畏的Arch Linux。\n\n它使用Clamares系统安装程序和Octopi包管理器。\n\n10 Void\n\nVoid是一种基于单片Linux内核构建的多用途操作系统，用于存放混合二进制/源包管理系统以及各种进程的独特实现。\n\n这使用户能够管理软件以及直接从源代码构建软件。vIt支持Raspberry Pi单板计算机并且是滚动版本，它始终是最新的。",
			"added": 1584095777,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1584097313,
			"title": "无网络使用linux的情景有哪些？",
			"body": "学校机房\n没有校园客户端，不能上网\n公司内网\n没钱交网费了",
			"added": 1584097311,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1584098892,
			"title": "使用 archlinux的人都是哪些行业的？",
			"body": "",
			"added": 1584098887,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1584098907,
			"title": "使用 gentoo的人都是哪些行业的？",
			"body": "",
			"added": 1584098901,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1584098952,
			"title": "有哪些小众好用的linux发行版？",
			"body": "",
			"added": 1584098945,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1584104719,
			"title": "不同 linux发行版适合什么样的人?",
			"body": "格式：\n自己使用的发行版\n自己用它做什么",
			"added": 1584104711,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1584621672,
			"title": "把 i3wm 打造成完整的桌面",
			"body": "窗口切换器：rofi\n通知功能\n提权窗口\n调节亮度\n锁屏\n电源管理",
			"added": 1584622298,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1584690372,
			"title": "linux 发行版体验报告",
			"body": "",
			"added": 1584690360,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1584698587,
			"title": "释迦牟尼传——成佛之路 作者:王惕 　著",
			"body": "出版社:华文出版社   出版时间:2013年01月\n\n编辑推荐\n\n　　完全依据佛教经典尽量贴近历史真实以艺术、流畅的现代语言再现释迦牟尼的成佛之路与永恒智慧\n \n内容简介\n\n　　本书在介绍佛教知识的基础上，用通俗简洁的文字，细腻入微地刻画了释迦牟尼的修行经历，讲述了他在成佛之路及创建佛教的艰辛历程上的真实事迹，并从佛教的角度阐述了做人、为人的道理。作者依据两条主线进行撰写，一是释迦牟尼自身成佛之路：因地菩萨——降生——出家——成道——弘法——涅槃；其二是释迦牟尼创建佛教、普度众生的成佛之路：凡夫（六道众生）——修行——声闻思果——菩萨十地——成佛。这本书是真人的传记，所以作者很少杜撰发挥，而是根据诸多经典原文进行翻译，使其尽量贴近历史，具有可信性，有据可查。\n作者简介\n\n　　王惕，普陀山佛教文化所特约研究员、中国美术家协会会员、中国民间文艺家协会会员。著有《中华美术民俗》《佛教造像法》等。壁画作品有《玄奘传》《弥勒经变》《塔尔寺全景》等。作者是一位已经出家的传奇佛教女艺术家。后半生在精进苦修的同时，不仅为寺院留下了许多上乘佛教艺术雕塑和壁画，也留下了《佛教造像法》《佛教艺术概论》等足为典范的佛教艺术著作，本书亦是作者的呕心之作。陈兵教授倾力推荐。\n目　　录\n\n一、本生篇\n二、太子篇\n三、成道篇\n四、导师篇\n五、正信篇\n六、正法篇\n七、般若篇\n八、法轮常转\n九、附录一  二十八相成道考述\n十、附录二  负有盛名的释迦牟尼出家弟子名单\n免费在线读\n\n　　白象入梦\n　　一个修行人经过某某佛的认定，预言他将来何时、何地会成佛，被称为“授记”。授，是给予之意；记，是记别，记号，预记之意。这种预言不仅仅是说说而已，而是一种赠予。佛教认为，凡“蒙佛授记”者，将来必定成佛。那么，具备什么样的条件才能蒙佛授记呢?要有三个条件：(一)因地菩萨修了无数善事，作了无数功德后，证得法性(又称“见道”)，故授记。也就是说，他一方面已具备了善业充足的“量”，又具备了精神升华的“质”，所以可以做候补佛了。(二)修行了很长时间，但学位(果位)还不算很高，为了坚固修行者的道心，鼓励他向更高的学位攀登，所以给他授记。(三)对那些渴求佛果，很投入地进行修行的人，为了加强他的信心，而为他授记。\n　　善慧(儒童)菩萨蒙燃灯佛授记后，又经过多劫，上升至兜率天。这层天是欲界天中的第四天，有一个专修佛果的研究院，叫做“兜率内院”，所有即将成佛的因地菩萨，都聚集在这里研读高层次的课程。善慧菩萨的实践功德已经圆满，在这里继续提高，达到“十地”菩萨的果位，这是菩萨修行的最高果位。这时，他感到时机成熟了，便从诸多方面进行考查，看看下方人间哪一个家庭最有仁德，最为美满，人的素质要高(当时称作“种姓优越”)，又要受到大众的拥护和爱戴。即将成佛的人神识清醒，不能糊里糊涂投胎在那些罪犯或从事不正当职业的人的家里。这样选来选去，选中了净饭王家。净饭王的先祖曾经随一位叫做“瞿昙”的仙人学法，故最早的姓氏亦称瞿昙，又称甘蔗苗裔。\n　　再说净饭王自从和摩耶结婚，夫妻恩爱，生活甜美，只是结婚多年，摩耶夫人还没有生育，不免使净饭王有隐隐的哀伤。有一天，摩耶夫人做了一个梦，梦见有一位相貌堂堂、周身放光的人乘坐在一头六牙白象上，腾空而来，进入她的身体。她旋即醒来，感到十分轻安，好像服了甘露一样；不多天，她感到身子重了，便把喜讯告诉丈夫。从此，她不再喜欢喧闹，除了在清雅的净室中静坐，便到空旷幽静的园林，在小溪旁徜徉，或在湖水边散步。她的心情很好，充满了喜悦、怡情，常常将自己喜爱的东西送给穷苦无助的人。大家都说，原本贤淑的国母，现在更慈爱可亲了，她一定会生育一个了不起的孩子。\n　　\n　　太子降生\n　　摩耶夫人以安祥、自在的心态进行胎教，虔诚地勤行六度。她不再欢喜人间的宴筵饮乐，断绝酒肉，而喜欢吃自然界的绿色食品。就在菩萨处胎接近十个月时，摩耶夫人禀告净饭王，按照古印度的礼俗，她应回到娘家——天臂城去生产。她对净饭王说：“我这几天情绪平和，心情很欢愉，大王能否允许我在回天臂城的途中，到我父王的花园‘兰毗尼园’去散散步呢?”净饭王说：“好啊!兰毗尼园优雅，安静，正适合夫人的性情。”他立即下令派人去那里洒扫，清理道路，栽种奇花；并用种种珍贵的宝物、彩绸、幡、幢装饰街道和栏杆；又将大批吉祥鸟雀兽类：鸳鸯、鸾凤、孔雀、大象、鹿和种种鸣禽放入园中，任它们自由生息。\n　　夫人动身那天，正好是春末夏初的第一个月圆日，净饭王备置了十万七千宝车，每车都装饰得很华丽；又派四军：象兵、马兵、车兵、步兵沿途加以保护；又选了后宫不老不少、容颜端正、性情柔和、善解人意的宫女服侍、伺奉夫人；又有八万四千童女身上饰满花环和宝珠璎珞，手捧鲜花在兰毗尼园轻歌曼舞迎接夫人。这时，各个天宫也都震动了，诸天天王都知道了善慧菩萨即将降临人间，便纷纷下凡，发誓将来跟随菩萨修行，护持佛法；又有很多天龙八部神将从空而降，到兰毗尼园助兴、随喜。\n　　摩耶夫人来到园门，健步走下车辇。她容光焕发，喜气洋洋，被宫娥们簇拥服侍，进入了百花盛开、红繁绿茂的大花园。这时那些吉祥的鸟雀翻飞跳跃，孔雀开屏，鸾凤和鸣，百灵鸟和鹦鹉婉转啾唧；宫娥们跳起祝福的舞蹈，脚铃响出有节奏的悦耳音声；懂事的白鹤与梅花鹿依恋着摩耶夫人，寸步不离。夫人轻盈移步，来到一株翠盖如伞的无忧树下，她看到低垂的枝头开满了芬芳、硕大的无忧花，便抬起右手去采摘花朵，就在这时，太子从她的右胁顺利诞生，摩耶夫人没有感到任何痛苦与不适。\n　　同时，有许多奇异的现象发生了：新生儿诞生后就会行走，双足离地四寸，下面托着莲花，他向四方各走七步，说道：“天上天下，惟有通向大觉至善的潜能——佛性，最清净，最尊贵。一切众生皆有佛性。我为开发佛性而降生。”这时，天空中直泻下银链似的净水，一边是温暖的，一边是清凉的，为太子沐浴，宫女们纷纷说看到天上有九条龙在那里吐水。这就是后来沿袭下来“浴佛”习俗的起源。\n　　摩耶夫人四十岁才得此贵子，欣慰异常，宫娥们欢呼雀跃，奏起了动听的乐曲。园中先前齐鸣乱叫的鸟兽此时一下都安静下来，花儿散出优雅的芬芳，连园外路过的病人、乞丐此时也精神抖擞，扔掉了破碗和手杖。这时，空中飘下轻纱天衣覆盖在太子身上；园中忽然涌出四泉，泉水清澈香洁，摩耶夫人和随行眷属畅快地沐浴、欢笑。之后，大家把夫人和太子请上琉璃床，由四大天王捧着四只床脚，平稳地抬上凤辇宝车，浩浩荡荡地驰回迦毗罗卫城。\n　　这个大喜事，早有人报知了净饭王。大王高兴得不知如何是好，看那混浊的污水都变得清澈透明了。他走出宫殿，也忘记了乘车，全城的老百姓都跟在他的后面，向兰毗尼园迎来。\n　　这一天——春末夏初的月圆日后来成为佛教的重大节日——佛欢喜日。依公历，定在每年5月的月圆时节；依中国的农历定在四月初八(浴佛节)和十五日(佛欢喜日)。\n　　\n　　仙人预言\n　　迦毗罗卫国欣逢大喜之事，无论是大臣、宫娥还是普通老百姓都奔走相告，祝愿欢呼，于是，很多奇异的传说呈报到宫中来：\n　　(一)十方世界皆无限光明；\n　　(二)三千大千世界震动，丘陵变成平地；\n　　(三)枯树逢春，生出繁茂的枝叶，美丽无比；\n　　(四)园林中繁花似锦，一株树开两色花，结出奇异的果子；\n　　(五)地涌金莲，无水自行开放；\n　　(六)发现新的宝藏；\n　　(七)浊水变成清流；\n　　(八)满城飘满香气；\n　　(九)细雨润泽农田；\n　　(十)空中飘来仙乐之声……\n　　净饭王降旨群臣，让他们寻觅查访聪明博学、智慧善知能作预言的婆罗门来为太子占相，并在御花园中修建大殿，窗门栏杆都装饰得珠光耀目，香气袭人。不久，五百位婆罗门高僧被请到宫中，当他们看到被鲜花和锦被围绕的太子时，口中不住地称奇，赞叹不已，各抒己见，说出了太子不同于常人的三十二相和八十种随形好。\n　　为首的婆罗门代表大家发言说：“尊贵的大王啊!我们看了太子的尊相，好庄严，好庄严，人间真是太稀有了。现在向大王禀告：尊太子的皮肤是真金色，细滑、润泽，周身放光；他的眼睛细长而大，形状像莲花瓣一样；眼睫毛浓密而长，向上翻卷，像水牛王一样；他的黑眸子像黑宝石，深邃而闪闪发光；天庭饱满，面如满月，双耳垂肩，直直的高鼻梁显出他的尊贵；口唇轮廓分明，色如朱砂；双眉像弯弓，又像天边初月。两眉之间有一奇特的白毫毛，非常之长，却向右弯曲盘卷，形成一个突起的圆丘；他的头发又黑又亮，自然向右弯曲，形成了螺丝发；头顶的发旋被一个突出的肉髻所覆盖。他的身体无比健壮匀称，合乎比例(佛的身体比例：全身高度与自腰际到足跟底部的比例是1∶0?618，正好附和黄金分割率)；他的脖颈不粗不细，圆润而饱满；他的胸膛丰厚、双肩平满、腰部较细，却挺拔有力；他的双手手指纤长、圆润，双足平满，没有凹陷的脚弓；手心和足心都是莲花红色，上面有法轮纹样；他行走时，双足离地四寸，有莲花托足，而土地上却能印上他的法轮足迹；……”\n　　摩耶夫人听到这里频频点头，婆罗门高僧说：“夫人，我说的可对么?”\n　　夫人说：“一点不错，他刚刚出生时，向四方各走七步，地上都印有他的足迹。”\n　　婆罗门高僧说：“大王，尊太子的相好真是难以用语言形容，所以我们的眼睛一分一秒也不愿意移开。看到太子的相好，我们心中安祥而适意。”\n　　这时，五百婆罗门纷纷说：“是啊!是啊!我们看着太子这样奇伟，庄严，都忘记说话了。”“他生的实在是贵人相，圣人相；人间的转轮圣王都不会有他这么祥瑞的相貌。”“他虽然是出生不久的太子，可我们却都很崇拜他，见到他周身发光，像见到太阳一样。”于是，大家散花，烧香，共为太子取名为萨婆悉达多，简称悉达多，悉达。净饭王听了，高兴地说：“善哉，这个名字有多层意义：一切义成，一切事成，财吉、成事，好，好!非常吉祥。”\n　　婆罗门高僧说：“大王，尊太子有这样的相好，若继承王位，定是一位盖世无双的转轮圣王；如若出家，则是一位大觉圣人，与日、月同辉。”\n　　净饭王说：“我当然会让他当转轮圣王，出家是不可能的。”\n　　众婆罗门互相看了看，说：“大王，我们的预言也可能不会应验。还有一位经常出入三十三天、具足天眼通、天耳通、神足通、他心通和宿命通的120岁的老仙人，他叫阿私陀，或者他能做出更准确的预言。”\n　　净饭王很恭敬地送走了五百婆罗门，归来对摩耶夫人说：“我也听说过有一位阿私陀仙，可他住在南方香山的茂林险壁中，根本没有人能找得到他，我们怎样才能把他请来呀!”\n　　再说住于南印度香山增长林的阿私陀仙早已用天眼观到了悉达多太子的诞生，他对自己的侍者那罗陀说：“我活了120岁，现在要去办一件最有意义的大事，跟我辛苦一趟吧!”他们随即用神足通在天上飞行，很快来到了迦毗罗卫国的宫门。净饭王听说阿私陀仙人已来到皇宫，慌忙亲自出迎，拜见已毕，说：“老仙长有大神通，怎么停在宫门外面?是不是守门人对您老人家不恭敬呀?”\n　　阿私陀仙回答说：“哪里?我既来到贵国，就得遵守贵国的法度。”净饭王听了，深深佩服老修行的平易近人，谦和旷达，连忙请入后宫，请坐上座，顶礼再拜，说：“老仙长一向身体可好?”阿私陀仙人回答说：“托大王的洪福，我还硬朗，没有什么病。”\n　　净饭王说：“您老人家能光临我国，是我国强大的吉兆，不知老仙长是有事经过这里呢?还是专为赐我吉祥而来?”\n　　阿私陀仙人说：“我在南方香山增长林中见贵国大放光明，又得到大王心念的信息，知道太子降生，并有许多奇瑞现前，所以老朽特地与侍者从虚空来。听上空诸天王说，太子从母右胁而生，足踏七宝莲花之上，生而能行走，作大狮子吼。所以知道太子当为天、人中最尊贵者。”\n　　净饭王听了，忧苦疑虑全消，说：“快请夫人，把太子抱出来，活神仙到了，请他们母子出来行礼。”\n　　众宫娥连忙禀告后宫，以七宝凤辇接来夫人太子。摩耶夫人欲给阿私陀仙行礼，仙人急忙摆手，说：“使不得，使不得。太子是天人三界之尊，将来是一切众生的导师，是我应该拜见他。”他双手当胸合十，之后行跪拜礼，礼太子足。净饭王和摩耶夫人便请仙人给太子看相。\n　　阿私陀仙诚惶诚恐地端详太子，不一会儿，竟哭泣起来，老泪横流，异常悲伤。这可把净饭大王吓坏了，他连忙问：“老仙长，我的太子刚出生时，有许许多多的瑞相，难道今后有什么灾难和不吉利吗?”\n　　阿私陀仙仍逴欷着说：“太子相好具足，没有任何不祥。太子有长寿相(当时的印度人能活30—40岁就算长寿)，若在家为王，必是转轮圣王，英明的君主；不过，也可能隐居山林，出家学道，救度无量无边的众生。大王啊，您看，太子具有三十二相八十种随形好。这三十二相是世间转轮圣王也能具备的德相，福相；可这八十种随形好，只有出家得道的大觉圣人才能获得。”说着，阿私陀仙又淌下泪来：“我年寿已届120岁，不久命终，怕是不能亲听王子讲经说法了，所以，我的心里特别难过。”\n　　净饭王忙问：“老仙长，您老人家所占的两种可能：一作转轮圣王，二作大觉的佛陀。现在他还没有长大，您怎么就知道他将来会讲经说法呢?”\n　　阿私陀仙说：“若有众生具备三十二相，但特征不明显，便作转轮圣人；太子三十二相处处鲜明，又有八十种细微的美好特征，所以老朽知道他定成一切种智，成为大觉圣人。”说完，仙人自带着侍者飘然而去。\n　　净饭王听了仙人的预言，愁思难解。他想：“我活了这么大年纪，才有这一位吉祥的太子出生，我一定要让他作转轮圣王。”于是选择了五百名年轻健壮的女子，务必要贤惠多智者，充当悉达多太子的保姆。有的负责喂乳，有的负责沐浴，有的负责洗衣扫地，有的则负责抱太子戏耍。同时，为了给太子修福而大赦天下，并把宫中的财宝施给穷苦的老百姓和僧侣，召天下的婆罗门诵吉祥经，共开了七天布施大法会。\n",
			"added": 1584702766,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1584703061,
			"title": "《走近佛教》 佛恩 编著",
			"body": "第一章　认识生命\n\n　　一、生死与无常\n\n　　二、死后的世界\n\n　　三、面对死亡\n\n　　人类一开始便陷入智慧与愚昧矛盾冲突的困扰中。无限的未知领域，如同宇宙空间那隐藏着无穷奥秘的黑暗，紧紧包围着人类。无论文明如何进步，人类总有解不完的宇宙之谜。\n\n　　在所有的宇宙之谜中，最难解，最恼人，对个人和社会最急迫的，是关于人类自身之谜：\n\n　　我是谁?人生的目的是什么?安身立命之处何在?\n\n　　人一死，是永灭，还是有来生后世?\n\n　　如果人死后不再继续某种“生活”，那么，生前的善恶还有多少意义?\n\n　　如果有生之前、死之后的世界，那么，生从何来，死向何去?\n\n　　……\n\n　　一、生死与无常\n\n　　对生死问题的解答，关系到每个人最切身、最根本的利益。因为我们从一生下来就注定要死亡，在死亡面前，世间的一切幸福和欢乐都成为虚饰。\n\n　　当我们静下心来关注这一事实的时候，我们的人生似乎陷入无底的黑暗之中。\n\n　　我们在此世间一切的恐惧，都源自对死亡的恐惧。所有的人，无论他承认与否，都必然对此怀有直觉。从面对危险时的不安全感，到怕墓地、怕尸体的心理，每个人都不难体察自己意识深处盘踞的对死亡的畏惧。\n\n　　古今中外不少哲人都曾指出：\n\n　　死亡恐惧是人类普遍存在的、永恒的焦虑。\n\n　　为什么我们会生活在对死亡的恐惧中呢?因为我们的本能欲望是要活着，而死亡终将结束我们所熟悉的一切!死亡到来时，我们将被投入一无所知的深渊里。\n\n　　也许还有更可怕的事情：\n\n　　我们会不知道自己到底是谁!\n\n　　平时，我们执著自己特殊的、独立的身份：我的姓名、我的地位、我的生平、我的家人、我的朋友、我的工作、我的财产、我的知识、我的技能……把安全建立在这些脆弱而短暂的支持之上。然而，死亡顷刻间就将所有的一切一扫而光!我们所面对的，将只是赤裸裸的自己，一个自己也不认识的人，一个令自己焦躁的陌生人—— 平时我们总以琐碎的杂务填满每一时刻，以保证自己不会单独面对这位陌生人。\n\n　　原来，我们生活在一个虚拟的身份之下，一个浪漫的童话世界里。被激情所陶醉，我们过于着迷建造房子的快感，竟把生活的房子建在沙上!\n\n　　我们悉心包装自己，尽量把每一件事情都维持得安全可靠。为此，我们花费了一生的心血。直到有一天，重病或灾难将我们惊醒，即将来临的死亡粉碎了我们的幻想，并把我们逐出隐藏的地方。\n\n　　一般人的心态是享受人生，尽量忘记死。\n\n　　然而，死却不会忘记我们，且会突然袭击我们。\n\n　　或许有人说：“人人都会死，死不是什么大不了的事，死最自然不过了，我不会有什么问题。”\n\n　　从远处眺望死而说死不可怕，正如在动物园眺望笼中的老虎，因为它不会加害我们。可是，如果我们在山中突然碰到老虎，那会是什么样的情景?\n\n　　即将真正面临自己的死，犹如在山中突然碰到老虎一样，只一见，便双腿瘫软了。\n\n　　当今世界，自然灾害、战争、盗贼、车祸以及各种顽症比比皆是，我们每天都能听到死亡的消息。\n\n　　释迦牟尼佛告诉我们：\n\n　　人命在呼吸间。\n\n　　意思是说：人的生命是短暂的、脆弱的，一气不来，便属隔世。\n\n　　这就是佛在经中一再提到的“无常”。\n\n　　佛曾问弟子：“人命有多长?”\n\n　　一个弟子回答：“人命在数日间。”\n\n　　佛摇头说：“你没有悟道。”\n\n　　第二个弟子回答：“人命在饭食间。”\n\n　　佛还是摇头说：“你也没悟道。”\n\n　　第三个弟子回答：“人命在呼吸间。”\n\n　　佛说：“善哉善哉!你悟道了。”\n\n　　二、死后的世界\n\n　　我们生下来便踏上了向死亡行进的路途，陷入与自然、社会的种种矛盾冲突中，急匆匆追名逐利，最后筋疲力尽而不见有何成就，眼前危机重重，未来也不知何去何从，心跟着形体的变化而迁流不息，这样日复一日，糊里糊涂地度过每一天。\n\n　　很多人意识到自己的迷惘，开始探索来生的可能性，试图了解生命的整体意义。\n\n　　的确，如果我们真的就像自己所说的那么务实，为什么不严肃地反问自己：\n\n　　我真实的未来到底在哪里?\n\n　　关于死后有无续存的问题，尽管大多数人回避它、不承认思考过它，它也必然在我们的潜意识中萦绕。对这个问题的解答，要比生活状况的改善、科学技术的发展等现实问题更为现实、更为重要，因为它是我们决定人生态度、人生目标，建立人生观、价值观的基石。\n\n　　自古以来，对生死之谜的解答主要由各种宗教来提供。作为人类伟大的精神传统，所有的宗教都清楚地告诉我们：死亡并非终点!并以此唤醒人们对未来世的憧憬，赋予生活神圣、终极的意义。\n\n　　然而，随着自然科学的突飞猛进，宇宙之谜一个个被揭开，科学知识的普及，使不少人相信生死之谜已被揭破。于是，宗教贬值，信仰转移于科学与金钱，确认死后永灭的人越来越多。\n\n　　其实，只要冷静考察自然科学对人类自身认识的程度，便无理由妄称生死之谜已被揭破，无理由对死后续存与否的问题做出决断。“人死永灭”只是一句尚不究竟的哲学推论，确认其为真理，同样具有信仰主义的性质，无充足理由奉为科学结论。近代、现代的科学巨匠几乎无不承认科学对人类自身认识的肤浅，他们对死后有无续存的问题一直持审慎态度。\n\n　　最具挑战性的，是古籍记载、民间流传的一些与生死、“灵魂”有关的趣闻，诸如记忆前世、濒(bīn，临近)死体验、神识脱体(神识：灵妙不可思议的心识)等现象。这些现象遍布世界，超越时域，并不因科学进步和人们不相信它而绝迹，总还时有发生，似乎在向我们透露生死之谜的某种信息。\n\n　　平生否定有死后世界的德国哲学家叔本华，在受临终之苦折磨的时候，叫着：“啊!上帝呀，我的上帝!”\n\n　　看护他的医生问道：“先生，在你的哲学中也有上帝吗?”\n\n　　“亲受痛苦的境遇，即使哲学上没有上帝，也束手无策。如果病能痊愈，我将从事完全不同的研究。”他这样说着而死去。\n\n　　法国著名无神论者华帝尔，临终时痛苦地挣扎着，最后凝视一处说：“瞧!那边有恶魔，要来带我。啊!看到地狱了，好恐怖啊!谁啊!救救我吧!”这样绝望地叫着死去。\n\n　　作恶众生认为“死是痛苦的结束”“没有死后的世界”。但临终时，心中的黑暗扩大，必能看到黑暗的彼处有地狱之火，先前那种逞强的心顿时被一吹而散，口中还会发出凄厉的惨叫。\n\n　　三、面对死亡\n\n　　死亡是个大迷雾，因为我们不知道什么时候死，不知道死后会怎样。但有一点可以确定：在地球的任何地方，死神都能找到我们。\n\n　　对于死亡，我们在犯同一个错误：我们会觉得死亡离我们很遥远。然而，我们不是经常听到别人突然去世的消息吗?他们像我们一样，视生命的延续为理所当然之事。\n\n　　实际上，我们的身体有可能突然垮下去而不能运转，我们甚至不必生病也会死。\n\n　　我们以不知何时会死为借口，来延迟对死亡的正视。然而，我们越是不愿正视，就越对它无知，恐惧的阴影就越萦绕于脑际。\n\n　　如果想挣脱死亡的宰制，绝不能采取回避的方式。拒绝正视死亡的结果，将毁掉我们这一生和未来的生生世世。\n\n　　大多数人只是在临终那一刻才开始珍惜生命，这是多么令人悲伤的事情啊!那些相信自己有充足时间的人，最后时刻才准备死亡，然后他们懊恼不已——这不是已经太晚了吗?\n\n　　就在此时，我们需要清醒一下，严肃地问自己：\n\n　　如果我今晚就死去，那该怎么办?\n\n　　面对无常，有一种策略是及时行乐——享尽荣华才不枉此生。这种自私和短视的做法只会加速消耗我们有限的福报，使结局变得更加悲惨。\n\n　　多数人采取较为理智的抗争方式，诸如：“肉体虽死，灵魂不灭”的观念，永生于天国的神教信仰，长生不老的追求，家族的传宗接代，以及立功、立德、立言而流芳百世，期待精神的永垂不朽，乃至“生则乐生，死则安死”的自然主义达观态度。这些方法虽然不能彻底摆脱死亡的威胁，却使人多少变得从容了。\n\n　　现代科学使人类充满了以自己的理性揭破所有宇宙之谜的信心，生前死后的问题已不被多数人所关注，似乎成为无关紧要、滞碍社会进步的玄虚问题。但从一些人类学家的眼光来看，通过科技途径征服自然，还是一种出于潜意识深处的抗拒死亡命运的“移情”手段。科学从物质方面对人类自身的研究由细胞深入到基因，蛋白质合成、试管婴儿、器官移植、克隆技术等现代成果，无不是对生死之谜的探索。\n\n　　西方一些人类学家、心理学家认为：人类的一切文化活动，实质上都是为了逃避死亡的宿命，都是对死亡威胁的抗争。\n\n　　在世界各地，很多国家设立专门机构，从事生命轮回、濒死经验等现象的研究，并把它们列入心灵学、超心理学等研究课题。研究者注意到：接近死亡，可以带来真正的觉醒和生命观的改变。经历濒死体验的人，对死亡的恐惧会降低，能比较谦卑地接受死亡;追求物质的兴趣会减低，更加相信生命的精神层面;相信死亡是生命过程的延伸，也容易接受来世的信仰。\n\n　　在日常生活中，我们可能会碰到亲友或邻人亡故，这极易触发我们对钟爱自己的长辈终将死去的忧虑，由此联想到自己亦将必死，进而引向对人生意义的思考。\n\n　　事实上，能够从内心深处体会生命无常的真义，是觉悟人生、寻求解脱的第一步。\n\n　　依据佛陀的智慧，我们可以利用生命来为死亡未雨绸缪，不必等到受绝症的冲击时才去观察我们的人生，也不必等到死亡来临时还茫然面对未知。此时此地我们就开始寻找生命的意义，心平气和地把每一秒钟当成改变命运和准备死亡的契机，从正面跟死亡接手，揭开它的神秘面纱，熟悉它，随时想到它。正如一位法师所说的那样：\n\n　　既然不知死亡在哪里等着我们，那就让我们处处等待死亡。\n\n　　乔达弥是生活在佛陀时代的富家少妇。她的儿子一岁左右就病逝了，她伤心欲绝，抱着小尸体在街上奔走，碰到人就问是否有人可以让她儿子复活。有些人不理会她，有些人认为她发疯了。最后，一位智者告诉她：世界上只有佛陀一人能够为她施行奇迹。\n\n　　她就去找佛陀，把儿子的尸体放在佛陀面前，说出整个过程。\n\n　　佛陀慈悲地听着，然后轻声说：“若要医治这个孩子，需要芥子，你到城中要四五粒回来。不过，这种芥子一定得向没有死过亲人的人家去要。”\n\n　　乔达弥立刻动身往城里去。她对第一户人家说：“佛陀要我向一户没有死过亲人的人家要几粒芥子。”\n\n　　“我们家已经有好多人过世了。”那家人回答。\n\n　　她又走向第二家，得到的是同样的回答。她又走向第三家、第四家，向全城的人家去要芥子。\n\n　　最后她终于发现：佛陀的要求是无法办到的。\n\n　　她犹如从梦中惊醒，把孩子的尸体抱到墓地，做最后的道别，然后回到佛陀身边。\n\n　　“你带回芥子了吗?”佛陀问道。\n\n　　“没有。”她说，“我开始了解您的教法。悲伤让我盲目，我以为只有我一个人受到死亡的折磨。请您开示死亡和死后的真相，我身上是否有什么东西是不死的?”\n\n　　佛陀慈悲地开示说：“如果你想了解生死的真义，就必须经常如此反省：宇宙间只有一个永不改变的法则，那就是一切都在改变，一切都是无常。你儿子的死，帮助你了解我们所处的轮回世界是无法忍受的苦海。脱离生死轮回的方法只有一个，那就是解脱之道。”\n\n　　乔达弥顶礼佛足，终其一生追随佛陀。\n\n　　百年三万六千五百日，\n\n　　其实不过弹指一挥间。\n\n　　第二章 人生实相\n\n　　一、孤独的心灵\n\n　　二、脆弱的生命\n\n　　三、后生一大事\n\n　　佛经中有一段譬喻，为我们揭示人生是什么：\n\n　　在一个寂寞的秋日黄昏，无尽广阔的荒野中，有一位旅人步履蹒跚地赶着路。突然，旅人发现薄暗的野道中散落着一块块白白的东西，定睛一看，原来是人的白骨。\n\n　　旅人正在疑惑之际，忽然从前方传来惊人的咆哮声，一只老虎紧逼而来。\n\n　　看到老虎，旅人顿时明白了白骨的原因，立刻向来时的道路拔腿逃跑。\n\n　　但显然是迷失了方向，旅人竟跑到断崖绝壁之上，他看来是毫无办法了。\n\n　　幸好崖上有一棵松树，并且从树枝上垂下一条藤蔓，伸向崖底。于是，旅人便毫不犹豫，抓着藤蔓垂下去，可谓九死一生。\n\n　　老虎见好不容易即将入口的食物居然逃离，懊恼万分，在崖上狂吼着。\n\n　　“好感谢啊!幸亏这藤蔓的庇护，终于救了宝贵的一命!”旅人暂时安心了。\n\n　　但是，当他朝脚下一看时，不禁“啊”了一声。\n\n　　原来，脚下竟然是波涛汹涌、底不可测的深海!海面上怒浪澎湃，在那波浪间还有三条毒龙，它们正张开大嘴等待着他的堕落。旅人不知不觉全身战栗起来。\n\n　　但更恐怖的是，在赖以生存的藤蔓的根接处，出现了一白、一黑两只老鼠，它们正在交互地啃着藤蔓!\n\n　　旅人拼命地摇动藤蔓，想赶走老鼠，可是老鼠一点儿也没有逃开的意思。\n\n　　在旅人摇动藤蔓时，树枝上的蜂巢滴下蜂蜜。\n\n　　旅人将蜂蜜舔到嘴里：“多么令人陶醉啊!”\n\n　　他竟然忘记了自己正身处恐怖境地。\n\n　　一、孤独的心灵\n\n　　这段譬喻意味着什么呢?\n\n　　释迦牟尼佛开示这愚痴的旅人之相，便是指我们的人生实相。\n\n　　旅人：这旅人即是指我们自己。\n\n　　荒野：无尽而寂寞的荒野譬喻我们无尽寂寞的人生。\n\n　　我们从生下来时，就成为这旅人而作人生之旅了。\n\n　　既是旅人，应知目的地。如今，我们是以何目的而出生到这人间来的呢?\n\n　　如若不知，则不能不说就和这愚痴的旅人一样了。\n\n　　秋日黄昏：秋天的黄昏是譬喻人生的孤寂感。\n\n　　何故我们的人生就像秋天的孤寂?因为我们是孤独一人来世间旅行，虽说有亲属、朋友、同事，但并不能互相倾吐心中的一切，我们找不到真正彼此理解的心灵之友，即使是夫妇，也未必能互相理解心中之事。\n\n　　人生的孤寂，原因就在这心灵的孤独。难道你未曾有过孤独的感伤吗?\n\n　　白骨：路边的白骨是指在我们人生的旅途中，所见亲属、朋友等的死亡。\n\n　　我们活到现在，应该看到过很多白骨。我们有何想法?有何感触?难道我们一点也没有注意到紧逼而来的“无常之虎”吗?\n\n　　老虎：饥饿的老虎所譬喻的即是我们自己的死亡。\n\n　　此世间的一切事物都是无常的，因此，我们非死不可。死，对我们来说是最恐怖的事，所以，释迦牟尼佛以恐怖的老虎作譬喻。\n\n　　现在，这无常之虎猛然向我们逼来。但由于我们感觉它太恐怖、太不吉利，平时根本不想去思考这个问题。\n\n　　作为旅人的我们，本能地与死亡抗争，一有病就到医院，以药物跟死亡搏斗。但是，死亡似乎是不可逾越的，我们终将败在死亡手中。\n\n　　我们看到佛教经常提到死亡的事，心里可能会感到阴森森的，甚至产生厌恶之感。其实，这是我们对佛教完全误解了。\n\n　　我们平生虽然忘记死、逃避死，但是，死必然会到来。所以，这种心态并不能解决问题。\n\n　　唯有与死正面对决，并最终找到问题的答案，才能得到绝对的幸福。\n\n　　因为这个原因，佛教才提到死的事。 ",
			"added": 1584755080,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1584773707,
			"title": "小狗的包裹管理系统",
			"body": "Puppy Linux及其衍生版本与其他发行版使用不同的程序包管理系统。尽管Puppy Linux不像其他GNU / Linux分支那样受欢迎，但是所有核心Linux用户都应该知道如何使用Puppy的软件包管理器。它是最容易使用的打包系统之一（如果不是最简单的话）。\n\n注意：Puppy Linux还支持SFS软件包/文件，但这是另一个主题。\n\nPuppy Linux及其分支使用Puppy软件包管理器（PPM），后者主要使用PET软件包。PET软件包是扩展名为* .pet的安装文件。PET代表“ Puppy's Extra Treats”或有人说“ Puppy's Enhanced Tarballs”。PET文件只是重命名为* .pet的压缩文件（.tar.gz），并且在文件末尾（EOF）附加了md5sum。\n\n注意：以防万一我不清楚“安装文件”的含义，此示例可能会有所帮助。在MS-Windows系统中，使用扩展名为“ exe”或“ msi”的文件安装软件。这些文件是安装文件/软件包。Ubuntu使用扩展名为“ deb”的文件。这些DEB文件是安装文件。这样的文件将更多应用程序，驱动程序，墙纸等添加到系统中。\n\n注意，我说过PPM主要使用PET包装。Puppy软件包管理器还支持以下软件包-.deb（Debian）、. tgz（Slackware）、. pkg.tar.gz（Arch）和DotPet。Puppy Package Manager也可以访问Ubuntu存储库。\n\n注：存储库（仓库）是通常托管在服务器上的软件包的集合。\n\n在PET文件中，有两个脚本，一个“ .desktop”文件，可能是一些XPM或PNG文件，一个包含软件的文件夹，以及旧PET中的specs文件（pet.spec）。在这两个脚本中，一个名为“ pinstall.sh；它在安装后执行（安装后脚本）。第二个脚本puninstall.sh，在软件包卸载后执行。”。desktop”文件用于创建软件的菜单项，例如，在Puppy系统上，如果用户在应用程序菜单中看到Firefox，则他们知道Firefox的PET文件包含“ .desktop”文件。PuppyLinux将这些桌面文件存储在/ usr / share中/ applications /。应用程序菜单中使用的图标是PET文件中显示的XPM或PNG文件。文件夹包含该软件，其内容已复制到指定位置。\n\nPET_Contents.png\n\n注意：顺便说一句，您是否曾经在菜单中看到使用通用或奇特图标的应用程序？好吧，他们拥有该图标，因为他们的PET文件缺少XPM或PNG图标，或者该图标文件已损坏。XPM和PNG文件位于/ usr / local / lib / X11 / mini-icons /中，名称为（* 48.xpm）的数字位于/ usr / local / lib / X11 / pixmaps /中。另一种可能性是* .desktop文件未指定图标。\n\n该规范文件的题目是“pet.spec”文件和老年PET文件能够被看见。它是纯文本文件，其中包含有关软件的常规信息。以下是内容示例。如您所见，该文件包含诸如软件名称，大小，软件类型（多媒体）和其他信息之类的信息。\n\n码：\nBanshee-2.1.0-lucid525|Banshee|2.1.0-lucid525||Multimedia|161096K|pet-packages-lucid|Banshee-2.1.0-lucid525.pet||Listen to music|ubuntu|lucid||\n要安装一个本地 PET文件，单击它，PPM将打开，以允许用户安装软件包。要将软件包安装在存储库中，请打开Puppy软件包管理器并搜索所需的软件包。安装是不言自明的。只需选择所需的软件，然后单击“安装”即可。允许安装依赖项，除非出于某些原因不允许安装额外的软件包。在安装本地PET软件包时，请确保该软件包不适用于较早版本的Puppy Linux。混合版本可能会导致问题。\n\n为了卸载软件，打开PPM。根据所使用的版本，双击软件包并选择“卸载”，或单击“卸载”按钮以打开一个窗口。在该窗口中，选择要卸载的软件。要快速卸载软件包，请使用Unpet。使用Unpet比使用Puppy Package Manager卸载软件要快。\n\nPuppy Linux还支持可以使用dotpuprox.sh这样安装的DotPet文件-“ dotpuprox.sh DOTPUP-FILE”\n\n要制作自己的DotPet文件，可以使用PetMaker。PetMaker是具有简单布局的GUI应用程序。要制作PET文件，请为您的PET文件键入所需的名称。然后，在接下来的两个框中，浏览并选择需要放在PET文件中的文件/目录。完成后，单击“创建PET”。\n\n存在一些替代Puppy Package Manger（PPM）的方法。QuickPet是PPM的精简版本。这意味着QuickPet更小，更易于使用（开发人员说）并且更简单。此外，QuickPet支持PET和SFS文件。SlickPet比QuickPet更轻巧，并且支持PET，tgz（Slackware）和txz（Salix）。PPM和两个较小的软件包管理器之间的区别是可用软件的数量。PPM提供最多的软件包。PPM不支持Salix软件包。因此，用户可以在同一系统上安装PPM和SlickPet，以访问更多软件包。在同一系统上使用SlickPet和PPM不会引起冲突/问题。\n\nPuppy Linux提供了一些转换实用程序，可以在不同的程序包类型之间进行转换，如下所示。\n\ndir2pet-将文件目录转换为PET文件。\n\nnew2pet-将new2pet命令放在所需的命令之前，以编译源代码（例如“ new2pet make install”）。这样做将获取新创建的文件（最终的二进制文件，而不是* .o文件），并将它们放入PET文件中。换句话说，这就像是PET转换器的来源。用户可以为“ new2pet”设置外壳程序别名，并将其命名为“ src2pet”只是为了好玩（和准确性）。\n\nnew2dir-类似于new2pet，但是文件放置在新目录中。\n\npet2tgz-将PET转换为Slackware软件包。\n\ntgz2pet-将Slackware软件包转换为PET文件。\n\npup2pet-此命令将DotPup软件包转换为* .pet。实际上，这是将DotPup嵌入到PET文件中。\n\n若要将DotPup真正转换为PET，请尝试此操作。使用“ dotpuprox.sh”而非PPM安装DotPup文件，并且new2dir和dir2pet（一起）将输出的文件转换为PET。对？然后，我们可以使用此命令-“ new2dir dotpuprox.sh /PATH/PACKAGE.pup; dir2pet DIR”。现在，您中有些人可能会想“为什么不使用dir2pet而不是使用两次转换？”。好吧，一些Puppy Linux用户声称上面的命令更好。如果愿意，可以尝试使用dir2pet。我只提到new2dir和dir2pet，因为这是大多数用户推荐的方式，但是可以满足您的需求。\n\n其他转换实用程序包括deb2pet，Alien2puppy和其他一些。\n\n辩论：您认为转换工具（例如pet2tgz）有助于使PET系统更受欢迎吗？这样的工具有效吗？您是否会在服务器上使用经过转换的程序包？",
			"added": 1584773692,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1584779165,
			"title": "快速而强大的包裹管理 : packdude",
			"body": "我不喜欢PPM，因为：\n-速度真慢。它使用Shell脚本进行大量文本处理，这是一个很大的禁忌。\n-它被大量的旧代码和丑陋的hacks所污染。它诞生于很久以前，自那时以来一直在增长。\n-它的本机包装格式PET设计不良。这是我所知道的唯一软件包格式，它有一个以该软件包命名的子目录。\n-它的存储库格式容易出错，并且不适用于大型存储库（避免在Woof中丢失包错误）。\n-创建PET包装的过程中的所有阶段都是手动的。有些甚至是图形的（dir2pet）。\n\n但是，我认为在Puppy中使用另一个发行版的软件包管理器不是一个好主意。如果我们这样走，我认为吃豆子就是路。它快速，易于使用，并且可以完成工作。但是：\n-我认为它可能更简单，更轻便。\n-我看不出任何原因，包裹经理应该提出问题。\n-我认为有一个可以自动执行维护任务而不提示用户的软件包管理器是很好的。\n\n我认为我们应该采用PPM，并用一个简单而可靠的软件包管理器代替它。可以以转换后的软件包的形式提供对Debian，Slackware或Ubuntu软件包的支持（即，将整个Slackware存储库转换为“本地”存储库的工具）。\n\n这就是为什么我写了packdude，这是一个受pacman启发的小型包装管理器，它仅支持一种简单的包装格式。我在这里将其发布为“技术预览” -我想听听有关此想法的更多意见并获得一些反馈。\n\n它还很年轻，因此功能非常有限：\n软件包下载和安装\n\n快速高效的软件包查找，这要归功于SQLite\n使用miniz进行轻量级解压缩（与当今大多数主要发行版使用的LZMA2相反）\n快速包装完整性验证，使用miniz CRC32例程（而不是ZLIB一个）\n通过libcurl支持多种下载协议\n快速，递归的依赖项解析\n\n拆包\n\n自动，递归清除不需要的依赖项\n\n储存库\n\n支持一个硬编码的存储库\nrepodude，一个受createrepo启发的存储库数据库生成器\n\n包创建\n\ndudepack，将tar归档文件转换为包的工具\ndudeunpack，软件包提取工具\n\n发行大厦\n\n支持以普通用户身份使用前缀-即将软件包安装到/ tmp而不是/\n\n\npackdude旨在使我们能够构建类似于debootstrap的神奇工具，该工具接受体系结构（例如x86_64）和用例（例如“请给Xfce笔记本电脑使用Puppy”），并在目录内安装干净的Puppy系统。\n\n然后，在该工具之上，我们可以构建另一个工具，该工具将干净安装的Puppy转换为可启动的ISO-一种非常轻巧且美观的工具，可以代替woof-CE。重新制作工具也可以使用此工具。\n\npackdude仍被认为是实验性的，可能会破坏您的系统。需要您自担风险使用它。\n\n[原文地址](http://www.murga-linux.com/puppy/viewtopic.php?t=93620&sid=b5831e8fa29c75cc85ad0fffcef0b433)",
			"added": 1584779149,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1584953009,
			"title": "提供 linux的易用性",
			"body": "软件卸载界面隐藏命令行软件和库",
			"added": 1584952991,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1585109710,
			"title": "常用 linux英语翻译",
			"body": "回购 -> 仓库",
			"added": 1585109735,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1585298037,
			"title": "使用 IPFS分发 linux软件",
			"body": "",
			"added": 1585298017,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1585303326,
			"title": "怎么能使发行版兼容更多的软件？",
			"body": "提高自己的份额",
			"added": 1585303305,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1585305472,
			"title": "我究竟想要一个什么样的 linux",
			"body": "1 软件多\n2 资料多\n3 学习成本低\n4 简洁\n5 功能强大\n6 保留尽可能多的元数据",
			"added": 1585311342,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1585358862,
			"title": "纯净版 LINUX 爱好者",
			"body": "https://tieba.baidu.com/p/250378993?pn=1#\n\nhttps://bbs.deepin.org/forum.php?mod=viewthread&tid=189712&highlight=%E7%BA%AF%E5%87%80\n\n自己精简就可以了\n\n其实用户最终需要的是发行版的软件库，而不只是这样的桌面",
			"added": 1585359259,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1585359166,
			"title": "文件管理器和桌面是什么关系？",
			"body": "好像显示桌面图标需要文件管理器支持，文件管理器是一种图形 shell",
			"added": 1585359142,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1585360595,
			"title": "linux发行版组装过程",
			"body": "如何自己制作Linux发行版？\nhttps://www.zhihu.com/question/21373233",
			"added": 1585360781,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1585363449,
			"title": "linux 的服务和 init 有什么关系？",
			"body": "",
			"added": 1585363423,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1585548824,
			"title": "【系统管理】操作系统的正确使用姿势",
			"body": "不要轻易修改系统，安装、卸载、升级软件，做好备份和快照\n一个稳定的系统不需要经常更新",
			"added": 1585548796,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		}
	],
	"topic_vote": {},
	"next_comment_id": 40,
	"comment": {
		"1584095578_19GFSxtiKrGHtL9nt3JhQNhgodgt5PwRDE": [
			{
				"comment_id": 1,
				"body": "linux 发行版成熟度，使用人数越多系统就会越完善",
				"added": 1584097019
			}
		],
		"1584097313_19GFSxtiKrGHtL9nt3JhQNhgodgt5PwRDE": [
			{
				"comment_id": 2,
				"body": "大部分人的周围没有人使用linux，用起来会比较孤独",
				"added": 1584098273
			}
		],
		"1584104719_19GFSxtiKrGHtL9nt3JhQNhgodgt5PwRDE": [
			{
				"comment_id": 3,
				"body": "https://www.zhihu.com/question/19852664?rf=19922750\nhttps://wiki.archlinux.org/index.php/Arch_compared_to_other_distributions_(%E7%AE%80%E4%BD%93%E4%B8%AD%E6%96%87)",
				"added": 1584107187
			}
		],
		"1577836120_1MityxAx6QVFTYWjzSJFc6nCX6eyT5W5yQ": [
			{
				"comment_id": 4,
				"body": "https://www.deepin.org/\nhttps://www.deepin.org/developer-community/planning/\nhttps://www.deepin.com/archives/category/magazines\nhttps://github.com/orgs/linuxdeepin/projects/1",
				"added": 1584165428
			},
			{
				"comment_id": 6,
				"body": "别人为什么不能理解自己的需求?因为所处的环境不同",
				"added": 1584235796
			},
			{
				"comment_id": 7,
				"body": "ubuntu 易用性确实挺好的",
				"added": 1584285421
			},
			{
				"comment_id": 8,
				"body": "APT 2.0 发布，用于Debian软件包管理\nRed Hat推动DNF 5的开发阶段以改善软件包管理器\nSystemd 245 发布，包括Systemd-Homed",
				"added": 1584358300
			},
			{
				"comment_id": 21,
				"body": "贴吧太难用了，去别的地方玩了",
				"added": 1585035649
			}
		],
		"1584176027_19GFSxtiKrGHtL9nt3JhQNhgodgt5PwRDE": [
			{
				"comment_id": 5,
				"body": "发现异能，被抓去解剖",
				"added": 1584176207
			}
		],
		"1576938527_1BWwq5edPNmp1XBtRQEw9S5YHCek2hs1P8": [
			{
				"comment_id": 9,
				"body": "你们知道这个车牌来自于哪个网站吗？",
				"added": 1584586143
			}
		],
		"1584621672_19GFSxtiKrGHtL9nt3JhQNhgodgt5PwRDE": [
			{
				"comment_id": 10,
				"body": "linux 真的比 windows好玩\n[撸Linux](https://www.lulinux.com/archives/category/linux_newbie)",
				"added": 1584627145
			},
			{
				"comment_id": 11,
				"body": "slackbuild、pkgbuild、ebuild",
				"added": 1584628425
			},
			{
				"comment_id": 12,
				"body": "实际上， 管理软件的主人应该是用户， 而不应该是包管理系统。\n想装什么软件，编译好了就能用了。 没什么难度的。\n\n\"只做好一件事\" 是Unix 文化的最重要的一个部分。",
				"added": 1584629144
			},
			{
				"comment_id": 13,
				"body": "[linux 发行版体验群](http://127.0.0.1:43110/1HvUQHUqGRqPngRyhk66sUHvet8ewCrd3E/)\n[linux 发行版体验报告](http://127.0.0.1:43110/153Bqdxo4iNAfaqMMZJ9BJHHKSmvqxJ1NY/?Topic:1584690372_19GFSxtiKrGHtL9nt3JhQNhgodgt5PwRDE/linux)",
				"added": 1584690462
			}
		],
		"1584690372_19GFSxtiKrGHtL9nt3JhQNhgodgt5PwRDE": [
			{
				"comment_id": 14,
				"body": "独占发行版：不能被 grub检测到的 linux\nslax、nixos",
				"added": 1584690591
			},
			{
				"comment_id": 15,
				"body": "再有一个比较有趣的例子是puppy，这个distro的包管理机制有点类似于flatpak和snap。",
				"added": 1584694255
			},
			{
				"comment_id": 20,
				"body": "puppy真的好垃圾，还不如自己用aufs基于其他发行版定制",
				"added": 1584704835
			}
		],
		"1584698587_19GFSxtiKrGHtL9nt3JhQNhgodgt5PwRDE": [
			{
				"comment_id": 17,
				"body": "10分\n很专业，尤其是前言中对一些佛教专有名词的释意。书中不间断的插入一些境界 修炼层次的周详权威表格。末后还选入了从印度带回来的关于佛的壁画。佛以他的灵识突破三界，告诉我们他所看到的宇宙真相，实在是十法界最伟大的教育者。\n2013-12-19 08:39:24 已购",
				"added": 1584702921
			},
			{
				"comment_id": 18,
				"body": "10分\n南无阿弥陀佛！释迦牟尼传我看过4部，我认为这一部最好，大师作品，通俗易懂，可读性强！\n2019-05-10 12:26:42 已购",
				"added": 1584702957
			},
			{
				"comment_id": 19,
				"body": "10分\n非常喜欢，很多名词都有解释，是一本大众化的佛教读物，谢谢作者呕心沥血的付出。\n2015-03-22 08:48:13 已购",
				"added": 1584702977
			}
		],
		"1584953009_19GFSxtiKrGHtL9nt3JhQNhgodgt5PwRDE": [
			{
				"comment_id": 22,
				"body": "一个软件包应该有的元数据\n是否有GUI   [ AryaLinux、NuTyX ]\n软件分类 ",
				"added": 1585053158
			},
			{
				"comment_id": 23,
				"body": "`pacman -Qi vim`\n\n名字           : vim\n版本           : 8.2.0343-1\n描述           : Vi Improved, a highly configurable, improved version of the vi text editor\n架构           : x86_64\nURL            : https://www.vim.org\n软件许可       : custom:vim\n组             : 无\n提供           : xxd  vim-minimal  vim-python3\n依赖于         : vim-runtime=8.2.0343-1  gpm  acl  glibc  libgcrypt  pcre  zlib  libffi\n可选依赖       : python2: Python 2 language support [已安装]\n                 python: Python 3 language support [已安装]\n                 ruby: Ruby language support\n                 lua: Lua language support [已安装]\n                 perl: Perl language support [已安装]\n                 tcl: Tcl language support [已安装]\n依赖它         : 无\n被可选依赖     : 无\n与它冲突       : gvim  vim-minimal  vim-python3\n取代           : vim-python3  vim-minimal\n安装后大小     : 3.47 MiB\n打包者         : Levente Polyak <anthraxx@archlinux.org>\n编译日期       : 2020年03月02日 星期一 01时21分03秒\n安装日期       : 2020年03月03日 星期二 05时26分37秒\n安装原因       : 单独指定安装\n安装脚本       : 否\n验证者         : 数字签名",
				"added": 1585042429
			},
			{
				"comment_id": 24,
				"body": "既然制造纯净版系统有难度，那么可以改造不纯净的系统",
				"added": 1585045190
			},
			{
				"comment_id": 25,
				"body": "每个软件的出生到弃用应该都能查询到",
				"added": 1585303040
			},
			{
				"comment_id": 26,
				"body": "使用 remaster功能，可以定制自己的iso镜像",
				"added": 1585304018
			},
			{
				"comment_id": 38,
				"body": "截图快捷键集成\n备份和快照功能集成\nwindows 快捷键集成",
				"added": 1585364728
			},
			{
				"comment_id": 39,
				"body": "NixOS是一种尚处于实验阶段的GNU/Linux发行版，其目的是让系统配置 管理成为一种享受。在现有的各种发行版中，诸如升级系统等操作都可能导 致着当机等不确定性，升级软件也可能引起其他软件包的被破坏。这些情况让人觉得完全重装系统反而比升级现有系统更可靠，因为你无法确定升级或者配置的后果 是什么，你也无法轻易取消所做的更改，总之问题太多了。而我们NixOS正是为了改变这种现状！它有很多创新之处。\n&nbsp;  \n同类技术：APT 快照",
				"added": 1585365255
			}
		],
		"1585305472_19GFSxtiKrGHtL9nt3JhQNhgodgt5PwRDE": [
			{
				"comment_id": 27,
				"body": "已安装软件列表和卸载列表保存在哪？\n去哪找补丁？",
				"added": 1585305876
			},
			{
				"comment_id": 28,
				"body": "能干净的卸载掉一个桌面（可以使用 btrfs快照）",
				"added": 1585306250
			},
			{
				"comment_id": 29,
				"body": "保存系统状态（快照 + 冷备份）(简单的方法备份系统）\n系统状态=桌面环境  +  安装的软件  +  init  +   c库  +  引导管理器  +  内核   +  窗口管理器  +  显示管理器\n系统必备的服务有哪些？",
				"added": 1585363095
			},
			{
				"comment_id": 30,
				"body": "安装系统后做一个初始备份，以后可以恢复出厂设置",
				"added": 1585307858
			},
			{
				"comment_id": 31,
				"body": "now-status.sh\n```\n#!/bin/bash\nuname -r\nldd  --version | awk 'NR==1'\npacman -Q | grep systemd | awk 'NR==2'\npacman -Q | grep grub | awk 'NR==2'\nscreenfetch | grep Packages\nuptime\n```",
				"added": 1585311225
			},
			{
				"comment_id": 33,
				"body": "linux 现在已经很好用了",
				"added": 1585312607
			},
			{
				"comment_id": 37,
				"body": "linux 解决方案归档",
				"added": 1585364199
			}
		],
		"1585360595_19GFSxtiKrGHtL9nt3JhQNhgodgt5PwRDE": [
			{
				"comment_id": 34,
				"body": "base system 在包管理器的管理范围之内吗？",
				"added": 1585360846
			},
			{
				"comment_id": 35,
				"body": "我想大家给的都不是题主想要的。题主意图弄清楚：发行版需要哪些东西，如何制作这些东西。而LFS仅仅是手工/半手工攒一个系统出来。发行版：制作iso安装光盘镜像，提供更新服务。\n期待大牛来回答，或者热心人邀请大牛来回答。",
				"added": 1585361025
			}
		],
		"1585358862_19GFSxtiKrGHtL9nt3JhQNhgodgt5PwRDE": [
			{
				"comment_id": 36,
				"body": "最小可用桌面环境",
				"added": 1585361433
			}
		]
	},
	"comment_vote": {
		"29_1FfatX3G2z43rV6nc1F3koYtn8tmD5EVb6": 1
	}
}