{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1517380880_1LTNeHLX2niwZ1Qsucq8YEe9Zwkvb7b4pw": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1516741810_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE": [
			{
				"comment_id": 1,
				"body": "I do not want to upvote anything, because I think that I should try to build things myself in stead of yelling that somebody else please do X, because I like X, but I find that ZeroNet is an excellent medium for archives of relatively small artifacts like photos, small videos, texts. sound files.",
				"added": 1517941464
			},
			{
				"comment_id": 2,
				"body": "> [styromaniac](#comment_14_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): We're all looking forward to an expanded app ecosystem.\n\nIn that case: (server side)API FOR OTHER PROGRAMMING LANGUAGES. \n\nMy favorite is Ruby.\n\n> [styromaniac](#comment_14_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): All I can offer is ideas since I don't know how to build a dynamic site, as is the case with many of us.\n\nI try to learn it from:\nhttp://127.0.0.1:43110/1Docsfk5uLvuXkL4U13eYDxCm2gzi1fNQq/site_development/getting_started/index.html\n\nThe way I currently(2018_02_10) understand, the browser side of a zite is like an ordinary AJAX HTML web site, except that in stead of some standard \nhttps://www.w3schools.com/xml/xml_http.asp\nwrapper\nhttps://yuilibrary.com/yui/docs/api/classes/IO.html\none uses ZeroNet specific JavaScript library, which handles the communication betweent he browser and the server and requires a few things from the HTML side. At the server side it's a lot like classical Java servlets: there is a special directory structure and file name and format conventions and some ZeroNet server side API.  \n\nAs an appetizer, I may suggest that a web agency that offers not just the classical clearnet/censorednet home page creation service, but also offers zite development services, will be ahead of a lot of its competition :-D\nI'm currently aware of any \"web agency\" that offers zite development, FreeNet site development, I2P home pages, Tor \"hidden\" service home page development, GNUnet home page development, IPFS consultancy services, etc. As of 2018_02_10 I am currently NOT capable of offering all of those services, I'm just learning, but just like the plain HTML/JavaScrpt/PHP had to be learned to wrap one's algorithm development services to some form that is accessible to my clients, I have to learn other \"wrapper technologies\", including zites. \n\nThe only thing that I definitely REFUSE TO INVEST MY TIME IN is cellphone software development, because everything is so temporary there and I want to reuse my software. I have never regretted that I have been INTENTIONALLY IGNORING all cell phone software development even when people around me tell, how great and popular it is and how many users that software has. In my view, if even the Android versions differ to such an extent that getting a simple text dialog with a few buttons to run RELIABLY, WITHOUT FLAWS on all Android phones without having to tweak the software for a particular Android version and device combination, then the technology is TOO FRAGILE FOR ME even if it were supported for at least 40 years. In my view, the idea that cell phone software has to be tested in special laboratories, which can be in a form of an online service, that contain at least 100 cell phones, IS MADNESS. Business wise the compromise solution for me is that I try to create a server side API for my creations and if someone wants cell phone software, then some \"mobile web agency\" that specializes on those temporary marketing hypes can charge my client a fortune for creating the cell phone software that uses the server side API of my creation.",
				"added": 1518264820
			},
			{
				"comment_id": 4,
				"body": "My ZeroNet-for-airlines idea from \n\nhttp://localhost:43110/Talk.ZeroNetwork.bit/?Topic:1518637483_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u/Preparing+a+presentation+of+Zeronet+What+should+I+show\n\nThe core of the idea is that ZeroNet server has optional configuration for dividing IP-addresses to clusters and the optional settings describe the rules about the traffic between the IP-address clusters. That way all passengers on a flying airliner can have regular, free, access to the ZeroNet server, but all IP-addresses that are not onboard the flying airliner, are treated so that only zite updates are exchanged between the IP-addresses on board the flying plane and IP-addesses off the flying plane. The same with cruise ships and private yachts. \n\nThe beauty of the ZeroNet Bittorrent nature is that huge planes like the Airbus 380\nhttps://archive.is/gg2Az\nneed only one of its ZeroNet servers to be configured to have access to off-plane internet. The rest of the scaling can be done by just adding ZeroNet servers as if the extra servers were running on passenger computers. The purpose of the extra servers is only to boost the local zite seeding and to act as a cache for the updates that will be loaded off-plane in the background.\n\nThe same functionality will be needed on the flight to Mars, except that the delays between a spacecraft and \"Earth station\" will be minutes, not fractions of a second. So, it would be wise to design routing algorithms so that they can handle that kind of delays.",
				"added": 1518639264
			},
			{
				"comment_id": 5,
				"body": "> [styromaniac](#comment_15_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): ...all that gets in the way of a native-like experience on ZeroNet is the browser UI...\n\nThank You for the answer. \nI guess that it is possible to write code that wraps the ZeroNet Python scripts/code by calling them from command line. So, the API in other programming languages is a kind of project that does not necessarily require the work of the ZeroNet core developers. It is a matter of prioritization and right now it seems to me that it is a smart choice to not bother the core developers with such trivia.",
				"added": 1518646611
			},
			{
				"comment_id": 6,
				"body": "\"Download size and Recursion Debth Limited Cluster Download Option\":\nhttps://github.com/HelloZeroNet/ZeroNet/issues/1290",
				"added": 1518767522
			},
			{
				"comment_id": 7,
				"body": "I described a vague idea about a distributed search engine that uses an architecture that differs from Google's architecture at one of my comments at \nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1519142918_18A7MxMQS5WnxRnQR6CtytEzjZ4UsGRpbm/Dedicated+zite+Hosting+Service\n\nThe core of the idea, if the phrase \"Silktorrent packet\" is replaced with a phrase \"text at a remote server\":\nhttps://www.softf1.com/cgi-bin/tree1/technology/flaws/silktorrent.bash/wiki?name=Application+Example:+Distributed+Search+Engine\n(archival copy: https://archive.is/t6loj )\n\nA test seed list of censored-net URLs can be found from \nhttps://github.com/martinvahi/mmmv_notes/blob/master/mmmv_notes/search_engine_seeds/seeds/mmmv_search_engine_scifi_seeds_t1.txt\n(2018_02_22 archival copy:  https://archive.is/saU5N )\nand the conclusions of my censored-net based initial experiments with old-style personal search engines can be read from my blog at\nhttps://martin.softf1.com/g/yellow_soap_opera_blog/some-thoughts-about-personalized-web-search-episode-0\n(archival copy: https://archive.is/5RBOj )\n",
				"added": 1519295728
			}
		],
		"1517380880_1LTNeHLX2niwZ1Qsucq8YEe9Zwkvb7b4pw": [
			{
				"comment_id": 3,
				"body": "> PS: English isn't my first language, so bear with me as I improve the readability over time.\n\nMy native language is Estonian. I have found the following dictionaries very useful:\n\nThe highest quality dictionary that has the best English grammar book that I've ever seen in my whole life is:\nhttp://www.thefreedictionary.com/\nThe grammar book link is hard to notice, but this English grammar book has REALLY HIGH QUALITY:\nhttp://www.thefreedictionary.com/The-Farlex-Grammar-Book.htm\nThe grammar book is a bit dense, requiring some examples for exercises from elsewhere, but it's nicely thorough and precise.\n\nUnfortunately the sound clip playing of TheFreeDictionary does not work on Linux. If I remember it correctly, I could be mistaken, it uses Adobe Flash. For that reason I use the following dictionary for pronunciation sound clips:\nhttp://dictionary.cambridge.org/pronunciation/english/\n\nI find the following dictionary very useful for finding out the exact spelling of Russian words that I have herd from videos: \nhttps://en.bab.la/dictionary/russian-english/\nUnfortunately it does not always give the English translation of the word, so I sometimes manually copy-paste the word from that dictionary to some other dictionary.\n\nObviously the various built-in spellcheckers are a blessing :-D",
				"added": 1518274259
			}
		]
	},
	"comment_vote": {}
}