{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1555406623_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": [
			{
				"comment_id": 1,
				"body": "> [arioch](#comment_3_1PJfQpxEFVYhaJhA1wMQBhBaqwb5vBQit9):\n\nThanks, but this is for Linux only.",
				"added": 1555507166
			}
		],
		"1554110095_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": [
			{
				"comment_id": 2,
				"body": "> [tomasz21](#comment_67_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw): \n\nYes. So much knowledge and books have been lost due to Copyright censorship. The world would be a much better place without Copyright.\n\nAsk yourself this: Who benefits from having copyrights for works from an author that has died more than 70 years ago?",
				"added": 1555507326
			}
		],
		"1555383590_1A5tKMypMZW14oHJLbe3rh9Va44MsBnwz1": [
			{
				"comment_id": 3,
				"body": "> [gametangia](#comment_8_193rzuH9AAHfvHKwSFS5oq6jRpXwDJ2rEW): Obvious arson attack\n\nThere's every reason to suspect this. \n\n- It happened on the first day of the Holy Week\n\n- Many French Churches have been attacked recently before the Notre Dame Cathedral fire\n\n- No electricity during renovations to avoid accidents\n\n- No workers in the Cathedrale at the time of the fire\n\nEtc ...\n\n>A tweet from Christopher J Hale, a Time columnist, has propelled the “arson” theory. “A Jesuit friend in Paris who works in #NotreDame told me cathedral staff said the fire was intentionally set”, he wrote, adding in a second tweet: “I should note that he has zero evidence beyond what the staff said. So qualify this as an unsubstantiated rumor.”\n\n---\n\n>Two hours after the spire collapsed, French-Greek journalist Sotiri Dimpinoudis reported that there were no construction workers onsite at the time of the fire:\n\n>  Breaking: Just in – French Media confirms there were no construction workers at the time of the fire at the cathédrale Notre-Dame de #Paris. #NotreDame #France. Also the church was also closed at the time of the fire. So nothing was going on the church.\n\nhttps://twitter.com/sotiridi/status/1117883209222508544\n\nhttp://us24news.com/notre-dame-fire-called-construction-accident-but-heres-what-the-media-is-not-telling-you/",
				"added": 1555507874
			}
		]
	},
	"comment_vote": {
		"8_193rzuH9AAHfvHKwSFS5oq6jRpXwDJ2rEW": 1
	}
}