{
	"next_comment_id": 14,
	"user_name": "Jetten",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"post_like": {
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1518233777": 1518313209,
		"16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1524810488": 1526840716,
		"16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1528500799": 1528502299,
		"1Md6YJNZX5yrdSaL9mmrKZNMAfULoXzMX2_1529171199": 1529172130,
		"1Md6YJNZX5yrdSaL9mmrKZNMAfULoXzMX2_1529171177": 1529172140,
		"1Md6YJNZX5yrdSaL9mmrKZNMAfULoXzMX2_1529171074": 1529172143
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "Well, the only DNS6-something I use is DNS64, which won't help you anyway because Android lacks IPv6-only support :(\nAnyhow, isn't Zeronet mostly based on getting IP-addresses straight from the tracker? Therefore what DNS-server you are using should only matter during the bootstrap process, not during any data transfers.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1515948101",
			"date_added": 1515959080
		},
		{
			"comment_id": 2,
			"body": "Would be interesting to see some battery statistics with this Busybox approach vs the Android App. Because, doesn't the Android app have some built in energy saving features, while the Linux version will try to use every resource available to constantly keep seeding your zites?",
			"post_uri": "1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1518012012",
			"date_added": 1518039885
		},
		{
			"comment_id": 3,
			"body": "Resizing the image to fit inside a 900x700 px box before uploading to ZeroMe improves the quality in my opinion.",
			"post_uri": "1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1524441626",
			"date_added": 1524591141
		},
		{
			"comment_id": 4,
			"body": "@Binchan: My idea was to resize the image to _exactly_ 900 px before uploading, this way ZeroMe won't perform any scaling whatsoever and you can have full control over the scaling yourself. If you do the scaling in Gimp, you can choose between several different algorithms and in my opinion most are better than the one ZeroMe uses.\n\nBut of course when it comes to visual appearance, everything is subjective and a matter of personal preference.",
			"post_uri": "1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1524441626",
			"date_added": 1524600652
		},
		{
			"comment_id": 5,
			"body": "Did you notice @Balancer73 uploaded a clone of ZeroLSTN that can be used meanwhile we wait for the real site to start working again? [1MusicKyJsw3CoEA6g1puwAPQGaeLAV3TM](/1MusicKyJsw3CoEA6g1puwAPQGaeLAV3TM/)",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1524810488",
			"date_added": 1526840725
		},
		{
			"comment_id": 6,
			"body": "Also, exercising only now and then is worse than not exercising at all, because your heart is not used to the stress caused by exercising.\n(Source unconfirmed, so don't take this too seriously)",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1527361027",
			"date_added": 1527620917
		},
		{
			"comment_id": 7,
			"body": "I suppose the biggest dealbreaker is that everyone needs to add the site first if you want to embed images from it. If you just embed the image, there's no mechanism to ask the user to add the site in order to display the image.\n\nCould [IFS](/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/) possibly work for this purpose? It supports public upload of images, direct linking, and quite many active users already have the IFS CDN site added. If you are creating your own site, you could probably even add a dependency on the IFS CDN merger site, so that it is automatically added when someone visits the site. For sites you do not own, but allows embedding of images (for example [Unlimit Talk](/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/), are there others?), I don't know how to ensure the site is added though...",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1528639847",
			"date_added": 1528669161
		},
		{
			"comment_id": 8,
			"body": "Greetings from Finland 👋 Never would I have expected that Finnish music would be uploaded to ZeroNet.",
			"post_uri": "1Md6YJNZX5yrdSaL9mmrKZNMAfULoXzMX2_1529171199",
			"date_added": 1529172041
		},
		{
			"comment_id": 9,
			"body": "Hi styromaniac, just out of interest, do you own a computer or do you always use a smartphone for your web browsing?",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1531707855",
			"date_added": 1532033112
		},
		{
			"comment_id": 10,
			"body": "There is only a limited amount of people that upload porn, and by introducing a site rule that all porn must be uploaded in the NSFW category, the admin can ban any users not complying with that rule. Then nobody should have a reason to complain about censorship either.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535042918",
			"date_added": 1535299184
		},
		{
			"comment_id": 11,
			"body": "Alternatively you can build this: https://youtu.be/PWTPFm6eZzs (Colin Furze - Gas Heated Umbrella)",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1540754173",
			"date_added": 1540765065
		},
		{
			"comment_id": 12,
			"body": "Simply skipping the re-encoding process altogether when the image size is below say 100 KB would be a very useful and easy-to-implement solution.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1546467219",
			"date_added": 1546616487
		},
		{
			"comment_id": 13,
			"body": "The JPEG format that images are being re-encoded into is very inefficient when used with logos or simple graphics. Keeping the logo in the original format is usually the most efficient solution then. Re-encoding is only useful for photographs really.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1546467219",
			"date_added": 1546616811
		}
	]
}