{
	"message": [
		{
			"body": "原来是你的聊天室",
			"date_added": 1531047731574
		},
		{
			"body": "1年了，一直打不开，今天检查了一下才发现问题。",
			"date_added": 1531048334114
		},
		{
			"body": "有问题不会到其它地方问别人吗？真够蠢的。",
			"date_added": 1531048606144
		},
		{
			"body": "习近平发出耸人听闻的嘶吼：美国向世界开火了。欧盟、日本提醒习近平：川普是向你丫开火。",
			"date_added": 1531365844365
		},
		{
			"body": "习近平号召老百姓挨饿去打贸易战",
			"date_added": 1531368504206
		},
		{
			"body": "咦？說好的貿易戰中国會堅決反擊呢？說好的老美搬起石頭砸自己的腳呢？說好的貿易戰動搖不了中国經濟呢？怎的現在變成了全民共赴國難？",
			"date_added": 1531370479827
		},
		{
			"body": "反制中共？美媒：美軍仍在考慮派航母戰斗群通過台灣海峽",
			"date_added": 1531371185331
		},
		{
			"body": "川普这500亿关税就是针对习猪妹夫的新能源汽车，电动汽车。习猪现在是有苦说不出。本来策划的很好，复制王歧山的海航模式，习家也能成万亿富豪了。现在都被川普搅黄了。",
			"date_added": 1531410854313
		},
		{
			"body": "陕西社科网撤掉首页“梁家河大学问”课题研究……这一切与网传7月9日晚北京长安街不同寻常事件是否有关尚不得而知",
			"date_added": 1531449997288
		},
		{
			"body": "美国务院推特称中国709律师为英雄",
			"date_added": 1531532848642
		},
		{
			"body": "新华社消息，我宣布，中方提供200亿美元贷款。中国将再向叙利亚、也门、约旦、黎巴嫩人民提供6亿元人民币。中国还将同地区国家探讨实施总额为10亿元人民币的项目。为阿拉伯国家提供1万个各类培训名额，再向阿拉伯国家派遣500名医疗队员。",
			"date_added": 1531584305141
		},
		{
			"body": "梁家河 水浅 王八多",
			"date_added": 1531590655711
		},
		{
			"body": " 靠，海地总理由于油价引发抗议而辞职",
			"date_added": 1531635877443
		},
		{
			"body": "北京新尝试：想跟美国达成贸易战的“临时停火协议”",
			"date_added": 1531636545595
		},
		{
			"body": "中美口水战变扳手腕 美舰满载F35部署西太平洋 ",
			"date_added": 1531658592495
		},
		{
			"body": "俄國軍事專家卡申（Vasily Kashin）首次披露，原來中國山寨了一台幾乎無法飛行的蘇愷33，才會導致艦載機殲15事故連連。",
			"date_added": 1531676561813
		},
		{
			"body": "自贸易战开打后，大国崛起论不见了，吓尿论不见了，世界第一论不见了，强国论不见了，牺牲西安以东论不见了，世界第二论不见了，三天拿下日本不见了，周带鱼早不见了，说什么美军到达台湾之时就是解放台湾之日也销声匿迹了。爱国脑残、粉红们一改砸日货的狗血豪迈无声了，原来都是贱骨头。",
			"date_added": 1531680457669
		},
		{
			"body": "中共内部开始出现质疑习近平的暗流？ ",
			"date_added": 1531721927391
		},
		{
			"body": "貿易戰撬動中南海 傳習被逼宮。重大信号：习贼东要做华国锋第二了！",
			"date_added": 1531732831419
		},
		{
			"body": "中共強迫航空公司改名 德駐台代表：幼稚且沒意義",
			"date_added": 1531757768609
		},
		{
			"body": "李锐评习：没想到文化程度这么低 ",
			"date_added": 1531833368925
		},
		{
			"body": "不错节点开始多了",
			"date_added": 1531839205262
		},
		{
			"body": "遼寧號部分船身生銹 內媒︰需要深層次保養",
			"date_added": 1531894277773
		},
		{
			"body": "真落漆！中媒：遼寧艦部分船體鏽蝕老化",
			"date_added": 1531898788103
		},
		{
			"body": "悶聲發大財 四川大爆炸19人死內幕曝光",
			"date_added": 1531908540287
		},
		{
			"body": "习近平突然大谈接班人和老实人 分析：曝中共危机",
			"date_added": 1531941070491
		},
		{
			"body": "香港民主派到警总示威  抗议政府拟取缔民族党",
			"date_added": 1531945252722
		},
		{
			"body": "昨天发生在甘南地区。当天下午出动了武警和中科院的人员封锁了方圆5公里的地面。就是因为汽车走到这里突然飘起来或被不明物体撞击。太可怕了！不可思议。",
			"date_added": 1531980616647
		},
		{
			"body": "【济南天主教堂被强拆，不知跟中共勾兑的教宗咋想】刘贻牧师：2018年7月17日中午11点，天主教山东济南教区梁王教堂被强拆，参与强拆的人数多达70人，他们抢走看守教堂的三位姊妹的手机，强行将她们带离教堂，使用大型拆迁设备，不顾堂内的祭台、跪凳及其他物品，在15分钟内，将教堂完全推倒。——天主教教堂被强拆，不知道教宗方济各对中共的这种行为有啥看法？",
			"date_added": 1531984612703
		},
		{
			"body": "倡一中一台 約霍：這是確保台灣能持續存在的唯一方式",
			"date_added": 1532019809114
		},
		{
			"body": "大陆到处都如此！如今换美元需要有效签证！还要跟银行提前预约！超过5000美元都不行！这还是大城市大银行呢！大陆中产阶级惨了！",
			"date_added": 1532061671368
		},
		{
			"body": "山东律师发公开信 吁停止巨额补贴外国留学生",
			"date_added": 1532103780324
		},
		{
			"body": "【香港多个政团联署谴责禁民族党 提倡取缔共产党】香港政府星期二突然宣布考虑引用社团条例禁止主张〝港独〞的民族党运作，引发民间的强烈反应和国际社会的关注。星期三，多个民间团体到警察总部抗议，批评政府借港独之名，打压港人的言论、结社自由。口号：言论自由不容剥夺、结束一党专政。",
			"date_added": 1532145824574
		},
		{
			"body": "极权政体纠错机制就是政变 中美贸易战捣毁习核心？",
			"date_added": 1532192823728
		},
		{
			"body": "【“誰也料不到川普會怎麼做” 中國製造商計劃“南進”】廣東及香港的製造業者擔心美、中貿易戰全面開打，目前正計劃“南進”，將生產基地移往越南及其他東南亞低生產成本國家。 廣東童裝業者、香港中小型企業總商會主席巢國明表示，“我們不認為貿易戰只是短期危機。我們必須... ",
			"date_added": 1532234879907
		},
		{
			"body": "【無知與無恥的墮落】起初美國放風會在關稅上懲罰中國，大陸牆內媒體一遍強硬，吹噓中國如何可輕易在貿易上戰勝美國，不過在牆外共產黨媒體卻打求和牌，就是知道根本無能力打貿易戰。最終，中美貿易戰還是展開了。 和一些人聊起中美貿易戰，發覺很多人連基本知識都沒有，關在牆內被蒙蔽的還可以體恤，但在香港資訊唾手可得又有渠道自我增值的人，竟然可以大發謬論，實在既可笑又可悲。 「美國眼紅中國強大，希望阻礙中國發展。」",
			"date_added": 1532274569202
		},
		{
			"body": "【有医德确没好下场】自由亚洲电台：贵州省务川县一家号称该省最大的民营医院，为了赚钱，强逼医生违法违规操作，结果大批医生离职。双方告上当地法院，法院最终接受医院的讲法，要离职的医生向医院赔偿双倍的”安家费”。 贵州务川昇辉医院辞职医生称，昇辉医院投资人刘令以人才引进的形式招聘他们到该医院工作，但医院未兑现承诺，更严重的是要求员工违规违法操作。医务人员拒绝违规行医，一年多来已有近100人辞职。其后，医院以涉嫌经济合同诈骗起诉辞职医师。务川县法院不理会医生证词，采信了医院证据，判决辞职的医师赔偿医院双倍安家费，引发医生集体抗议。央广网报道称，昇辉医院是2013年引入民间资本创办的，号称是贵州省最大的民营医院。为了吸引优秀医疗人才到务川，昇辉医院和当地政府从一开始便开出了给安家费、给事业编制、送100平米住宅等优厚条件，吸引了多名医务人才。但不久就出现了医务人员辞职潮。",
			"date_added": 1532327321499
		},
		{
			"body": "【全球多国紧急召回 中国制降压药原料含致癌物】给孩子的疫苗问题还没有解决，又来了害老人的事情了。据自由亚洲电台：从中国进口的制药原料被检测出含有致癌物质，造成115种降压药在韩国被禁止销售。这一消息让患有高血压的韩国人在整个周末惶惶不安，吃了怕得癌症，不吃血压可能会升高。最先检测到中国华海的缬沙坦含有致癌物质的是欧洲医药管理局（EMA）。韩国食药厅在获知这一信息后，认为事态严重，于第一时间的星期六公布了219个含有缬沙坦成分的药品，附带致癌的说明并下令停止销售。在这期间，韩国食药厅发布更详细的内容说，起降压作用的缬沙坦并没有问题，致癌物是一种叫亚硝基二甲胺（NDMA）的物质，是被国际癌症研究所（IARC）列为2A级的致癌物。从中国浙江华海药业进口的缬沙坦里被检测出了微量的亚硝基二甲胺。食药厅还表示，并不是所有降压药都含有缬沙坦，唯有用中国华海缬沙坦的药里被检测出致癌物。经过调查后发现，只有115种药品采用华海的原料。患者可以要求医院重新开不含华海缬沙坦的药方，可以到药店换取不含有缬沙坦的药品，门诊费和换药费用都由政府埋单。对此负责专利的律师金泰敏说：“要先证明因果关系才能据此提出索赔。但是，我们几乎不太可能证明药物致癌的因果关系。”所以，服用降压药的韩国患者不可能据此向中国浙江华海提出索赔。但是，中国企业因此丢失的不只是钱财，而是中国制造的信誉。",
			"date_added": 1532327683308
		},
		{
			"body": "【官派律师会见甄江华 称月底或下月初开庭】我们得悉早前有江门的官派律师会见了甄江华，然而甄江华并不愿意请这个官派律师，希望委托人权律师。然而当局一直拒绝让甄江华委托的人权律师会见，指其委托已经失效，甄江华因而处于没有律师代表的状态。该官派律师并透露案件可能于月底或下月初开庭；并指甄江华让人将珠海的房子收拾一下，退租。",
			"date_added": 1532396673660
		},
		{
			"body": "習李批示無用？後台都是常委級 曝疫苗行業黑幕被刪稿(組圖): 長生生物疫苗造假案引爆民憤，習近平和李克強都批示嚴查該案。但有前醫葯系統高官稱，這類企業後台很硬都是國家級的高官，總理李克強恐也無能為力。陸媒22日報道揭示，大陸疫苗上市的簽批制度，由中共國家食品葯品檢定研究院... ",
			"date_added": 1532417889067
		},
		{
			"body": "【“政府采购”才是假疫苗的保护伞】",
			"date_added": 1532418162863
		},
		{
			"body": "【香港突发“限苗令”】兲朝的疫苗不行了，很多人不是选择抗议政府，而是选择到香港去给孩子打疫苗，致使香港疫苗供应压力陡增。如今香港政府下达“限苗令”，从下月开始全港母婴健康院每月只提供120个非香港儿童预约接种疫苗。如果香港本地儿童接种疫苗压力大的话，这些母婴健康院可以随时停止非香港儿童接种疫苗的预约。——兲朝的百姓真的是太爱钻空子而不是抗争，上次毒奶粉事件发生后大家一窝蜂去香港买奶粉，这次假疫苗事件出来了大家又是一窝蜂去香港接种疫苗。大家从来不为孩子们的未来着想去监督政府提高本国产品质量，真的是打不醒的民族啊。",
			"date_added": 1532501812480
		},
		{
			"body": "貿戰剛開打 中國最大大豆進口商破產倒下",
			"date_added": 1532502181643
		},
		{
			"body": "刘强东在澳大利亚举行私宴，刘的一位徐姓朋友涉嫌强奸陪酒的女模特，澳大利亚法庭受理了这起强奸案。澳大利亚法庭拒绝了刘强东要求法庭不对外提及其姓名的要求。今天有些人认为是因为刘强东骂假疫苗而遭报复。为什么不看做刘强东穿红军装跳忠字舞之后又去极端奢靡的报应呢？",
			"date_added": 1532502406701
		},
		{
			"body": "疫苗女王高俊芳：击败出高价竞争对手低价获得优质国资 10年身家飙升67亿。2003年，国企长春高新决定卖掉旗下的长生生物，向时任长春高新副董事长，长生生物董事长高俊芳转让长春高新所持有的长生生物59.68%的股权，每股转让价格为2.4元。由于长生生物优秀的盈利能力，市场对于长生生物2.4元的转让价格产生质疑。2003年12月9日，还有一家生物制药有限公司给长春高新董事长发函，表示愿意以每股3元的价格受让长生生物的全部股权。该公司还向吉林省政府发报告提出质疑，称3元的报价明显高于“其他方”，但从未得到公平竞争的机会。在一片质疑声中，次年4月，长春高新将长生生物的转让价提升到2.7元/股，该次转让最终顺利完成，受让方依然是高俊芳。2005年到2015年，高俊芳将长生生物逐渐“升级”为名副其实的“家族企业”，掌控67亿的身家财富。",
			"date_added": 1532536520234
		},
		{
			"body": "国际声援西藏运动指出，中国意图以政治宣传来取代寺院教育。ICT：中国应立即停止剥夺西藏学生宗教自由。",
			"date_added": 1532536993622
		},
		{
			"body": "【大连回应星海湾跨海大桥出现裂缝：正常伸缩缝，将定期检测】 半岛晨报：7月24日一早，多个网友拍摄星海湾跨海大桥桥墩照片，并表示，其疑似出现裂缝。当天中午，星海湾开发建设管理中心对此做出了回应。星海湾开发建设管理中心表示，经过现场勘查，发现该处裂缝产生于星海湾跨海大桥东侧引桥，是由于该桥墩两榀上横梁之间伸缩缝中间苯板脱落造成的缝隙，并非桥体工程结构存在安全隐患问题。7月24日一早，星海湾开发建设管理中心已组织专业队伍对该裂缝进行处理，同时也将会同大桥设计、监理等单位对所有桥墩及相应的设施进行检查，保证桥体美观效果。星海湾开发建设管理中心表示，今后将对大桥加大日常巡视检查与排查力度，增派巡查人员，增加巡视次数，定期邀请专家进行检测，给市民游客提供安全、顺畅的出行环境。",
			"date_added": 1532576234480
		},
		{
			"body": "据大纪元消息：中共当局的报备文件显示，Facebook已在杭州注册了一家子公司，该文件称该公司已于上周三获得批准。脸书表示将利用该公司在那里建立一个创新中心。周二晚，该公司在中共政府网站上的注册信息突然被删除了。不仅如此，一些提到这家新子公司的言论似乎在中国社群媒体上也遭到了审查。报导引述一名拒绝透露姓名的知情者说，现在脸书子公司的注册已经被取消了。他还透露，撤销注册发生在浙江官员和国家网管机构发生争执之后，国家网管机构对于地方没有就此事项进行密切沟通而感到愤怒。多年来，脸书创始人马克•扎克伯格曾尝试过多种方式来进入大陆市场。他曾要求国家主席习近平在国事访问期间为他的孩子起中文名，同中国大陆的大学生进行中文的沟通，甚至展示其在阴霾弥漫的天安门广场慢跑照片。脸书还悄悄地开发了一个审查工具，并在中国发布了一个名为彩色气球的照片分享应用程序，但没有给该服务冠上自己的名字。但该产品最终也被取消，似乎也没有得到中共网机构的批准。",
			"date_added": 1532576642009
		},
		{
			"body": "從網友提供的圖中可以看到，這位家長於2018年5月給孩子注射疫苗時，本子上清楚寫明疫苗的生產廠家和生產日期，但在2018年7月24日的注射記錄上，疫苗的生產廠家卻消失了，只有留下生產日期，而且本子疫苗注射記錄，從以前的機器列印變為手寫，且在大陸某些地方，打疫苗真的開始不寫廠家。",
			"date_added": 1532610197420
		},
		{
			"body": "【女主播泣诉女儿被疫苗所害 事后被迫道歉】近日一名浙江女主播在微博表示，她女儿打疫苗后出现异状，令她心疼。但相关微博随即被删除，且出现道歉声明。",
			"date_added": 1532632923146
		},
		{
			"body": "据美国之音：美国众议院外交事务委员会亚太小组委员会主席约霍(Ted Yoho)7月26日星期四在华府智库战略与国际研究中心举行的有关南中国海的研讨会上表示，美中关系现在进入了从竞争到对立的新阶段。这位众议员认为，南中国海是一个绝好的案例。他说，如果美国要推进它在南中国海的利益，保护其它的主权争端方、美国的区域伙伴以及基于规则的国际秩序，那么美国必须开始对中国巩固其在南中国海地位的行动做出强有力的反对。他建议，美国应当加大在南中国海的军事存在，包括加强自由航行行动的力度与频率；组建由盟友组成的海军行动组，加强对中国的威慑；并加大对中国强化在南中国海地位的外交和经济成本。他还认为，美国应该放弃长期以来在主权争端上采取的中立立场，挑战中国的主权宣称。",
			"date_added": 1532676712726
		},
		{
			"body": "美国驻北京大使馆外发生爆炸事件后，有位女生把她手机里的现场视频传给外媒记者。混在人群中的便衣匪警迅速把她塞到不挂牌的警车(车牌京N56E54)上带走，着装匪警配合穿绿色T恤的便衣匪首抓人，借口是她爸爸在家等她。北京匪警脏事干多了，随口就能编出理由。",
			"date_added": 1532677043950
		},
		{
			"body": "【加征美國大豆關稅後 中國動物飼料被迫改配方】中國對美國大豆加征關稅，但由於豆粕價格不斷攀高，連帶影響動物飼料的製造。 美中貿易大戰核心商品“大豆”話題不斷，中共雖然下狠心對美國大豆加征關稅，但由於豆粕價格不斷攀高，連帶影響動物飼料的製造。",
			"date_added": 1532699127655
		},
		{
			"body": "【假疫苗的事情居然成为国家机密了】不合格疫苗事件在网络沸腾已超过一周，官方开始为事件降温。中国各省宣传部门已下令“停止炒作疫苗”。有来自河南的记者在微信留言称：“现在不让报道疫苗这个了”，另一位记者感叹“真的发自内心地讨厌痛恨这种现实，我们当记者只能唱赞歌，感觉不到职业的意义，如果连自己家人受害都不能发声，我们还当什么记者？”。一位要求匿名的记者对本台称，不是河南的疫苗问题严重，官方才不准记者报道，而是各地都宣传部门都不准自己所管辖的媒体报道问题疫苗。自由亚洲电台记者在网上搜索发现，截至本周三（7月25日），几乎所有的大陆媒体，均撤下与疫苗相关的报道。",
			"date_added": 1532751856766
		},
		{
			"body": "【中国驻美大使：外界对中国有误判，中美仍在一条船上】2018年7月25日，崔天凯大使应邀出席卡内基国际和平基金会举办的第八届中美民间对话第二次会议相关活动，并就中美关系发表讲话中表示，美中两国实际上同处一艘被狂风和巨浪袭击的大船上。@DaniratLee ：曾经是在一条船上，美国在划船，中共在凿船。如今船漏进水，美国下船而去，中共还在欲沉的船上意淫。",
			"date_added": 1532752360556
		},
		{
			"body": "【越南防“误砸”允许台商悬挂中华民国国旗】据台湾中央社报道，越南2014年发生的“5/13排华暴乱”，令在越华人忧虑安全，但该事件也对一些在越南的台商产生“意外效应”，越南政府由此同意台商在厂区悬挂“青天白日满地红”的中华民国国旗。报道表示，台商凯胜家具的总裁罗子文讲述，为让越南人辨别台商与陆商，他们得到越南当局的允许，可以悬挂台湾的国旗。",
			"date_added": 1532801810672
		},
		{
			"body": "近期，廣東省下發了將投資4,800億人民幣搞基礎建設的文件，其它省市也有類似的舉動。外界分析，在美中貿易戰給大陸經濟帶來很大不確定的情形下，中共為了保經濟增長，要再搞一個“新4萬億”投資。",
			"date_added": 1532849247568
		},
		{
			"body": "山东河北两省主管部门近日表示，将为曾接种长春长生假疫苗的儿童安排免费补种。然而，补种疫苗竟来自同样被国家管理部门披露曾大量制造不合格疫苗的武汉生物公司，只是批号不同，引发民众愤怒。",
			"date_added": 1532915973954
		},
		{
			"body": "魏松华：我女儿魏越草于2014年6月19号在河北大厂人民医院出生。2018年3月10号生病住院，3月25号在北京儿童医院ICU因心跳停止而死亡。",
			"date_added": 1532916471478
		},
		{
			"body": "【《求救信》多伦多影院公映　震撼中西方观众】明慧网消息：加拿大多伦多的Hot Docs Ted Rogers剧院在二零一八年七月二十一日至二十六日公映了揭露中共劳教所里对法轮功学员惨无人道迫害的纪录片——《求救信》（Letter From Masanjia）。这是反映法轮功学员遭受迫害的纪录片第一次在剧院里进行大规模的院线发行，多伦多是全球第一站。纪录片《求救信》讲述的故事是，主人公孙毅因修炼法轮大法而被中共非法劳教。他在沈阳马三家劳教所被迫做苦役期间，将一封求救信偷偷放入了一包万圣节装饰物当中。这封信后来被一名美国俄勒冈州的朱丽•凯斯（Julie Keith）女士发现，她将信上传到社交媒体后，引起了包括CNN、FOX News、《纽约时报》、《环球邮报》等多家国际媒体的关注，从而引起了一场国际性的反应。中共的劳教制度于二零一三年被废除。这部纪录片在中国秘密拍摄，求救信作者孙毅在严密监控下用镜头记录下他真实的生活，并走访曾经的马三家劳教人员，取得第一手资料。影片还根据孙毅本人手绘的场景，用动画的方式反映了他在马三家劳教所期间的遭遇。",
			"date_added": 1532916662239
		},
		{
			"body": "<毛澤東曾經在大飢荒的時候對下面的幹部說：「四川的山溝裏餓死了人，再大也是四川省的問題，北京城裏哪怕餓死一個人，也會成為國際問題，孰輕孰重，你們自己掂量。」從毛的話中，我們不難發現，中共從始至終就是一個草芥人命的政權。中共建政以來發動的歷次政治運動，造成六千多萬人的非正常死亡 。沒有一句道歉不說，到了華國鋒時期，依然高舉著「兩個凡是」方針，現在開創了「新時代」的習近平，面對歷史，大言不慚地提出「兩個不能否定」。中國人在中共眼裏成了試錯的小白鼠，死不足惜。",
			"date_added": 1532965644991
		},
		{
			"body": "【呼吁关注中国709人权律师命运】为众人抱薪者，不可使其冻毙于风雪；为自由开路者，不可使其困顿于荆棘！部分被失业律师：丁家喜、郑恩宠、浦志强、刘巍、李昱函、陈武权、夏霖、王全璋、武全、高智晟、刘尧、唐吉田、隋牧青、祝圣武、舒向新、王龙德、王理亁、周世锋、文东海、杨金柱、王宇包龙军、余文生。江天勇、刘士辉、陈金华、刘书庆、温海波、张凯、童朝平、王成、唐荆陵、郭艳、程为善、程海、朱宇飙、陈永苗、李天天、庄道鹤、吴镇琦、陈家鸿、玉品健、黄思敏、蒋援民、王全平、覃永沛、李和平、谢燕益、谢远东、刘晓原、周立新、马连顺、石玉、黄立群、李姝云、温海波、杨慧文、张立辉、陈树庆。",
			"date_added": 1533023304807
		},
		{
			"body": "擔憂貿易戰升級？ 中國外長喊話「協商大門隨時敞開」",
			"date_added": 1533056621127
		},
		{
			"body": "假裝辟谣，习近平搬出禁卫军，威胁众元老，恶搞李克强",
			"date_added": 1533096398196
		},
		{
			"body": "川普经济亮丽 美工人薪酬升至十年来新高",
			"date_added": 1533121414376
		},
		{
			"body": "【全班只有儿子没出过国！杭州妈妈花三个月工资送六年级孩子去游学】杭州网：这几天，杭州的孙女士有点忐忑：在民办小学读六年级的儿子参加了学校组织的游学，要在英国待两周，这是儿子第一回离开身边，也是第一次出国。类似的暑假游学团，学校年年组织，但孙女士没让儿子参加，“我们家经济条件一般，一次游学起码3万元，抵得上我三个月工资了。”此前寒暑假，她会陪儿子在国内旅游，但没带出过国，可今年暑假她改了主意：“我是被逼急了，现在才知道，小学6年，全班只有儿子一个没出过国。”",
			"date_added": 1533182142785
		},
		{
			"body": "中國教授上節目批習「大灑幣」 公安直接破門抓人",
			"date_added": 1533182300518
		},
		{
			"body": "日媒：中美貿易戰 中共危機感強烈 經濟政策現重大轉變: 中國7月31日召開政治局會議，確定了2018年下半年通過積極財政政策支撐經濟的方針。日媒稱，中共為應對貿易戰轉向優先經濟增長。 ",
			"date_added": 1533220937690
		},
		{
			"body": "当前中国政经局势可以用八个字来形容，那就是“没有最坏只有更坏”！",
			"date_added": 1533221166057
		},
		{
			"body": "【川普關稅升到25％ 美最大工會力挺：應對中采強硬措施】美國貿易代表萊席爾（Robert Lighthizer）今（2）宣布，原本美國對中國2千億進口商品課徵10％關稅的決定將提高到25％。而通常支持民主黨的美國最大工會「美國勞工聯合會-產業工會聯合會」力挺川普。",
			"date_added": 1533265298453
		},
		{
			"body": "抵制环境污染 广西村民与千余警激烈冲突",
			"date_added": 1533312390629
		},
		{
			"body": "美国国务卿彭佩奥8月3日从马来西亚飞抵新加坡。他回答媒体称，目前距离朝鲜去核，还有一些路要走。此话显示华盛顿认为平壤在去核方面做得不够，未履行承诺。",
			"date_added": 1533359491374
		},
		{
			"body": "鲍彤：中国有三特：‬浙江向十字架宣战，‬北京对着低端人口扫荡，‬江西瞄准棺材冲锋。‬都应该载入史册。‬",
			"date_added": 1533394264697
		},
		{
			"body": "中国人，中华民族，就是一个会产生共产党暴政的卑劣族群。",
			"date_added": 1533446581942
		},
		{
			"body": "奥巴马：二战后，美国从未入侵过任何一个民主国家。但美国通过军事手段直接或间接地推翻了萨达姆、卡扎菲、共产分子、米洛舍维奇等独裁政权，使全球专制国家的数量从120多个减至现在的不足20个。美国军事力量的威慑和歼灭对象，从来都是那些如同中国共畜坑骗、奴役、欺凌本国人民的腐朽政体。",
			"date_added": 1533485102939
		},
		{
			"body": "北京中介人收费2万安排到香港打防疫针竟其门如市",
			"date_added": 1533485323043
		},
		{
			"body": "昨天周六， 叙利亚化武专家阿齐兹在大马士革附近被以色列特工暗杀。 阿齐兹负责叙利亚和伊朗两国政府的化武研究和制造。",
			"date_added": 1533524319996
		},
		{
			"body": "【孙文广从燕子山庄被转移到不明地点】美国之音记者周日上午到孙文广夫妇被软禁的济南军区经营的高档酒店和接待中心燕子山庄2号楼负一层探访时，发现孙教授夫妇先前被软禁的007房间已经换了房客。正在打扫房间的服务员说，公安局订的005和007两个房间昨天退房。服务员说，原来的房客前天就走了，昨天有人回来收拾东西。服务员的说法显示，孙文广夫妇是紧急情况下被匆匆带走的。济南市国保支队长宋自力周日接到记者电话后，轻轻说“美国之音”之后就挂断电话，不再接听。济南市国保支队政委吕红光接到美国之音电话后对记者提问一言不发。美国之音随后给孙文广在济南市的一些朋友打电话，但无法接通。中国官方对孙文广被失踪事件至今没有回应或发表评论，也没有公布任何有关这名教授被拘押的原因。美国之音联系中国外交部新闻司询问并要求其就此事件发表评论，该部门表示收到了美国之音的传真提问，但至今未作答复。美国之音也先后联系了济南公安局山大路派出所、山东大学公安处及该校宣传部，济南市公安局宣传处和济南市外侨办等，但上述官方机构都不予评论。孙文广被拘留，正值中国领导人习近平的统治受到严重挑战的敏感时刻。观察人士说，这导致安全机构迅速采取行动打压中国国内不断增加的反政府情绪，他们认为这是对共产党政权的威胁。",
			"date_added": 1533527519420
		},
		{
			"body": "“撒币大国”外长王毅讥美国援助印太地区金额寒酸",
			"date_added": 1533570728338
		},
		{
			"body": "【上海訪民中南海門前剖腹】上海楊浦區訪民李慧生，因房屋糾紛長期上訪十幾年無果，2018年8月1日，他到北京中南海西門剖腹抗議，現在所幸沒有生命危險，他8月6日對外透露，這次剖腹抗議讓他親身經歷了中共警察的狠心與無情，當時制服他的警察讓他的腹部流血數小時後才將他送往醫院救治。",
			"date_added": 1533615253791
		},
		{
			"body": "【中共王储王洪文 受酷刑早死】审讯人员为逼他交代，对他施用各种刑具：强行注射兴奋剂不让他入睡；用「电响器」几十分钟鸣叫一次，刺激他的神经；用愈挣扎愈紧固的重刑具，拷得他难以站立……。有天放风，王洪文没走几步就像门板直直地摔在地上，口吐白沫…..",
			"date_added": 1533615637824
		},
		{
			"body": "【匪都北京皇奴拒当“穷屄”——万人冲击右安门警狗派出所！】8月2日，一个外地乡巴佬暴发户曹远航﹐开车进入北京﹐行经丰台区右安门外大街时，将汽车开进了翠林路东口至右外斜街的非机动车道，冲撞一名骑电动车的北京国奴后﹐张口就骂“穷屄”。居然很快演变成了匪都国奴群起攻击外地暴发户的街头巷战！",
			"date_added": 1533661289547
		},
		{
			"body": "專家：中美貿易戰 中共遲早死 卻拖百姓墊背",
			"date_added": 1533698522574
		},
		{
			"body": "中共愚奴谎​​言喉舌“成都商报”透露出来的一则藏头去尾消息承认﹕ 8月5日，仁寿县一男子﹐砍杀当地暴发户地头蛇后转进﹐维护匪权利益的警狗当即四处进行围捕﹐该男子一不做二不休﹐干脆杀进已经空虚了的匪狗派出所拼命﹐又宰杀了包括匪狗所长在内的两条警狗。",
			"date_added": 1533698786964
		},
		{
			"body": "'For World Peace': Trump says anyone trading with Iran will not trade with US as sanctions come into force",
			"date_added": 1533716138508
		},
		{
			"body": "美国政府关切中国教授在家参加VOA直播节目被警察带走",
			"date_added": 1533743081786
		},
		{
			"body": "【疫苗丑闻大爆发 乙肝、麻腮风、卡介苗也是过期疫苗】继长春长生、武汉生物的假疫苗风波后，又传出陕西商洛出现大量过期疫苗，多名儿童已经接种，且受害儿童数量仍在持续增加。疫苗问题频现，加重中国父母的不安和恐慌。——西域雄鹰：啥东西都是假和毒，连儿童健康都不能保障，这国已经不能适合人类居住了！",
			"date_added": 1533784911972
		},
		{
			"body": "黑龙江依兰县爆发疫情，封道",
			"date_added": 1533785306838
		},
		{
			"body": "大连市某医院门口护士维权",
			"date_added": 1533785531786
		},
		{
			"body": "【中国威胁打民族牌：罢买苹果产品杯葛美国旅游】中国大陆对美国在贸易战中连番出招，似乎已经找到谈判筹码，反击手法似乎跟上一次报复南韩同意美国部署萨德防卫飞弹系统的手段如同一辙，打民族主义牌，罢买一家依赖大陆市场的企业作为报复，并同时以杯葛的手段，打击对手的旅游业。根据中共党媒报道，成为大陆“人质”的企业，这次不是南韩的乐天而是美国的苹果电脑，而同样地，美国也会被中国旅客的杯葛。报道引述大陆“途牛旅游网”的副总经理说：“（美国）的旅游业肯定会受到打击，问题是打击持续多久。”",
			"date_added": 1533824721469
		},
		{
			"body": "投资3000亿的北京奥运场馆 十年后已面目全非",
			"date_added": 1533825005896
		},
		{
			"body": "川普说某国留学生是间谍，并不过分。中共公开要求留学生互相监督，在美国各大学成立中共使领馆控制的中国学生会，甚至在有些美国大学内成立中共党组织。中共把中国留美学生当作“组织”成员，这是中共给留美学生造成“间谍”印象的根源。远离中共、尊重普世价值观的中国留学生是受欢迎的。",
			"date_added": 1533874435668
		},
		{
			"body": "抗议垃圾焚烧发电 哈尔滨数百人堵路遭镇压",
			"date_added": 1533874695314
		},
		{
			"body": "全国各地疫苗受害家长在国家卫健委抗议！高呼：“疫苗致残，还我健康。疫苗致死，还我孩子！疫苗立法，势在必行！妥善处理，负责到底！”",
			"date_added": 1533897190959
		},
		{
			"body": "香港特区政府前民政事务局局长何志平，涉嫌为中国一家石油公司在美国行贿非洲官员去年11月被美国司法部人员逮捕，何志平申请保释外出候审，这个星期四再度遭到美国法院驳回。这已经是何志平的第三次申请保释要求。",
			"date_added": 1533922433777
		},
		{
			"body": "52年前的今天，伟大“领袖”大手一挥，把一个8亿人的国家变成疯人院，数百万人被斗死整死，把经济搞到崩溃，生活用品凭票证供应，在西方经济迅猛发展的时代，我们却回到了石器时代。直到 1976年9月9日，这位“领袖”终于做了一件他生命中最正确的事——死了。8亿人的噩梦从此终结😱😱😱",
			"date_added": 1533958970584
		},
		{
			"body": "还记得这个帅小伙吗？他就是第一个被佳士开除的建会工人余浚聪，他在燕子岭派出所门口怒斥镇压工人的警察队伍的视频传遍了全世界！他的妻子黄兰凤写了一篇文章，回顾了自己丈夫成长为工人领袖的历程，令人感慨动容：这是一个充满人道感情、追求公平正义的优秀工人。他现在还被刑拘在看守所里！放人！",
			"date_added": 1533959307272
		},
		{
			"body": "【中共的毒辣手段都用到不愿当猪民的群众身上了】最早质疑习近平选择性反腐、贼喊捉贼的中国政治漫画家姜野飞最近被中共秘密判刑6年6个月。姜野飞逃到泰国，取得了联合国认定难民资格，仍然被从泰国抓回。姜野飞被抓回中国后眼睛被打残疾，其妻申诉无门。不仅如此，中共还让姜野飞电视上认罪。这是又一起习近平为泄私愤而用公权力残酷迫害民众的案例。",
			"date_added": 1533997179005
		},
		{
			"body": "美国参议员卢比奥提议制裁中共新疆书记陈全国，谴责其在新疆对少数民族实行惨无人道的专政。如果制裁案能达成会具有指标意义：1）这是美国首次对中共在职政治局委员制裁。2）首次在国际上因种族迫害追究中共。3）仅凭此提议，陈全国不大可能踏入西方任何国家。陈全国在新疆犯下了反人类罪，美国公开对其制裁，对其他中共羽下的酷吏是个警告。",
			"date_added": 1533997479043
		},
		{
			"body": "【中共再次挑战川普底线】川普 曾说：将封杀所有与伊朗做贸易的公司。为此法国的公司退出伊朗天然气项目，而中共央企CNPC却买断了伊朗天然气项目。 中共王外长说： ”中国在履行国际义务，没有损害任何其他国家的利益。应该得到尊重和保护。”",
			"date_added": 1534145372501
		},
		{
			"body": "生理盐水惊现假货，全国已售八千万支。",
			"date_added": 1534145634869
		},
		{
			"body": "【拥毛“人民党”在中国宣布成立】RFA：一个声称拥戴中共已故领袖毛泽东的政党“人民党”在中国自行宣告成立，其前身为去年被取缔的“中国保卫毛泽东人民党”（简称“卫毛党”）。星期六宣布成立人民党的是原“卫毛党”山西支部书记张晓蓝，她在微信朋友圈发布数张与该党党员在北京天安门广场庆祝建党的合影。她本人身穿红衣红裤，衫上印有毛泽东头像及“为人民服务”字样，并称人民党是“保卫祖国、保卫毛主席、保卫人民利益”的组织。张晓蓝表示，“人民党”与“卫毛党”是一回事。“卫毛党”创始人王士吉2016年8月8日向全国人大递交组党资料，9月即被当局带走。此外，曾拥护薄熙来为终身党主席的“至宪党”负责人、北京经济管理干部学院前副教授王铮在2017年初被捕，今年7月3日被安徽省合肥市包河区法院一审宣判“寻衅滋事”罪名成立，判刑5年。——既然这么热爱毛魔，请早点去见毛魔吧。",
			"date_added": 1534145739673
		},
		{
			"body": "【陈浩天: 为了自由与尊严 坚持发表演讲】香港外国记者会邀请香港民族党召集人陈浩天本周二（8月14日）演讲，引发激烈反应，先有北京外交部驻港特派公署派人阻拦，继而前特首及现任特首亦连番批评。陈浩天接受德国之声专访时表示，为了自由与尊严，他仍会坚持接受邀请前往演讲。",
			"date_added": 1534297886640
		},
		{
			"body": "南宁八百余名大学生响应党的忽悠奔赴农村“广阔天地”……封存丑恶历史，亦在某种程度上美化文革浩劫，一代又一代，毁人不倦。",
			"date_added": 1534346429792
		},
		{
			"body": "美国之音记者济南采访遭扣押 美国务院发音强烈谴责",
			"date_added": 1534347411389
		},
		{
			"body": "那个被遣返的郑姓同乡会会长，靠在美国给垬做马前卒，获取在中国做生意的便利。我在朋友宴请上见过他，据说中国生意不小。自持有绿卡，却还是被美国遣返了，失去利用价值，中国生意被权贵剥夺也就分分钟了。",
			"date_added": 1534397747434
		},
		{
			"body": "朴槿惠总统屁大点事，判刑24年；曾荫权特首屁大点事儿，判刑20个月，监狱执行。 中国假疫苗天大的事，一路下来，药奸局长检讨，前药奸局长免职，吉林几个地方官员免职了事。没有人为此坐牢。渎职罪呢？滥用职权罪呢？贪贿罪呢？危害公共全罪呢？这样的政权你能指望他什么？",
			"date_added": 1534471543729
		},
		{
			"body": "中國出手！福建稽查85°C門市食安 網路平台被下架 ",
			"date_added": 1534472264447
		},
		{
			"body": "美國暗示可能因進口伊朗石油制裁中國",
			"date_added": 1534509990737
		},
		{
			"body": "这是令人怒发冲冠的一幕：中共的爪牙当着孩子的面，打死了她母亲，然后恶毒的告诉她：跪在这里哭，知道吗，你妈妈死了！",
			"date_added": 1534510350082
		},
		{
			"body": "【五毛的报应很快就要来了】经济大崩溃，这些五毛是最先受到打击的一个群体。而且他们的承受力都是很差的，活该，这就是报应。这次大崩溃，50年都恢复不过来，这些五毛别再做中国梦了。",
			"date_added": 1534565015322
		},
		{
			"body": "喀什的一个集中营，在短短一年内扩大了三四倍。下面是华尔街日报的报告，通过很多访问确认了集中营里维吾尔遭各种酷刑甚至死亡，但还没确认死亡规模。国际新闻媒体对新疆人权灾难的调查及报告越来越多。",
			"date_added": 1534733071948
		},
		{
			"body": "一年半以来，川普 一直把朝鲜作为美国最大的敌人。如今，中共取代了朝鲜，成为川普眼中最大的敌人！恭喜习猪头！",
			"date_added": 1534733277895
		},
		{
			"body": "德媒：「中共放寬市場准入是表面文章」中共政府年初宣布，今後將逐步放寬外企必須以合資方式進入中國的規定。但一些專家認為，這種讓步姿態只是表面文章。 默克爾總理2016年參觀中國沈陽的寶馬合資企業 沒有哪一家跨國企業能繞得開中國市場，但要進中... ",
			"date_added": 1534766411356
		},
		{
			"body": "广东再爆P2P维权抗议行动，并暴发了警民冲突",
			"date_added": 1534839597020
		},
		{
			"body": "馬哈蒂爾今日在於結束訪華前召開記者會，宣布中國已同意取消其投資，總值300億元的東海岸鐵路計劃和天然氣管道計劃。馬哈蒂爾表示，由於馬來西亞面對債務問題，無力承擔該項目，中國體諒他們的問題，同意解除合約，相信中國政府不希望大馬成為「破產國家」。",
			"date_added": 1534900385165
		},
		{
			"body": "【花了14年 95岁前纳粹看守终被驱逐出美国】星期二（21日）凌晨，移民和海关执法人员执行了一项迟到了14年的驱逐令。最后一名生活在美国的前纳粹集中营看守，95岁的帕利吉（Jakiw Palij）被从纽约的家中带走，并驱逐回德国。",
			"date_added": 1534937820692
		},
		{
			"body": "8月22日，有肖建华的知情者微博披露，肖建华“已走”，并祝他一路走好。消息还有待进一步证实。2017年初的年三十，肖被中共警方以特别手段从香港绑架“回国”，随后被囚禁在一个秘密地点。曾有人披露，肖被卷入了中共最高层的政治斗争。2014年，肖对《纽约时报》表示自己曾帮助习近平家族处置了有关资产。",
			"date_added": 1534999937334
		},
		{
			"body": "【广东吴川城管局首次被市民占领】8月20日广东吴川事件，城管局首次被市民占领，官媒无一字报道。事件起因城管殴打小贩夫妻，不料小贩是参战老兵。其他老兵迅速聚集，和市民一起攻占了城管办公楼—吴川市公用事业局。",
			"date_added": 1535024806277
		},
		{
			"body": "【摧毀性影響 中國爆發非洲豬瘟四省4.3億隻豬染病】《科學》雜志報導說，迄今，非洲豬瘟據報告出現在東北四個省份，涉及面積數千平方公里。有4.3億只豬染病，其中許多是在小型農場養殖，這些地方缺乏生物安全措施。 “非洲豬瘟進入中國真的是非常嚴重的問題。”",
			"date_added": 1535077799924
		},
		{
			"body": "至华裔科学家李飞飞女士公开信：先辈的经验是用惨重的代价换来的！1949年大陆易帜，平民教育家晏阳初带女儿赴美，三个儿子坚持留在大陆。兄弟与姐妹约定：一周年时寄照片到纽约，如果三人都坐着，表明他们生活得不错。如果有人站着，表明处境危险。一年后照片寄到纽约，兄弟三人都站着。最终，一个文革被斗死一个自杀一个饿死，晏阳初在美国活到100岁。",
			"date_added": 1535089813371
		},
		{
			"body": "美中貿易談判於昨天（23日）結束，席間沒有取得任何重大進展，為世界兩大經濟體之間的貿易戰進一步升級創造了條件。 據《彭博》報導，要求匿名的知情人士表示，美中雙方對本周談判的期望很低，之後沒有安排進一步的會談。",
			"date_added": 1535130168243
		},
		{
			"body": "第四轮中美贸易谈判无果而终。8月22-23中美贸易谈判双方官方评论出来了。白宫：为了让我们从谈判中获得积极成果，中国解决我们提出的基本问题至关重要。我们还没有看到。中共：双方会谈具有建设性，并会保持沟通。",
			"date_added": 1535172362889
		},
		{
			"body": "【川普取消蓬佩奧北韓之行 推文抨擊中共】美國總統川普24日指出，他已取消國務卿蓬佩奧周末赴北韓計劃。 美國總統川普今天指出，他已取消國務卿蓬佩奧（Mike Pompeo）周末赴北韓計劃，並抨擊中共未幫助北韓非核化。 川普在推特推文抨擊中共。",
			"date_added": 1535219501970
		},
		{
			"body": "本周山东枣庄、四川成都、绵阳、河北石家庄、河南洛阳、广州等地，老兵聚集维权，追堵中央督查组。绵阳警察甚至打横幅对劝老兵。",
			"date_added": 1535263699263
		},
		{
			"body": "【非洲猪瘟横行 北京等12省市列高危地区 猪肉概念股蒸发456亿】大陆「非洲猪瘟」越爆越劲，由东北一直杀入南方，河南、江苏、浙江已经沦陷，杀猪最少2.5万只，官方文件现将北京及湖南等12个省市列为「高危地区」。香港农业联合会主席陈建业向《苹果》表示，河南及湖南都有猪只供港，尤以湖南较多，他认为疫情很大机会蔓延至广东。",
			"date_added": 1535369602553
		},
		{
			"body": "川普：强烈反对世界各地的宗教迫害。两天内 辽宁47名法轮功学员及家属被绑架",
			"date_added": 1535514569033
		},
		{
			"body": "【江澤民外甥猝死 近期反常莫名慟哭】8月28日，總部設在北京的海外黨媒多維稱，有不願具名的中共人士向多維網透露，夏德仁於26日晚間突發心肌梗塞死亡。據披露，夏德仁近一段時間出現異樣，在會議中莫名〝慟哭〞。夏是江澤民外甥，也是薄熙來的死黨。",
			"date_added": 1535561987364
		},
		{
			"body": "【黑社會劉海龍，竟然获得过见义勇为证书】2001年7月因犯盗窃罪被判四年六个月；2006年9月7日因打架被行拘五日；2007年3月因犯敲诈勒索罪被判九个月；2009年5月11日因犯故意毁坏财物罪被判三年；2013年7月19日因犯寻衅滋事罪和故意伤害罪被判两年两个月。這就是黑社會見義勇為的業績。",
			"date_added": 1535562279530
		},
		{
			"body": "【《產經》不親共遭中共拒訪 日媒集體取消采訪抗議】日本外務事務次官秋葉剛男29日與 中共外交部長王毅在北京舉行會談，由於新聞媒體眾多，決定以抽簽方式挑出采訪代表，《產經新聞》雖然中簽，但疑似被 中共外交部認為「不夠親中」、「不符合黨意」，拒絕其媒體采訪。",
			"date_added": 1535602579366
		},
		{
			"body": "美媒：特朗普下周启动对华两千亿美元关税",
			"date_added": 1535691158483
		},
		{
			"body": "中共豢养了三大非在编官办组织： 一、官办寺庙～爱国和尚！ 二、官办民运～协助维稳！ 三、官办黑帮～专干脏活！ 他们各司其职，在不同境况下，发挥不同作用。不得不承认，中共的统战工作，牛！他们不但统战了各民主党派，连寺庙，黑帮，甚至某些“民运反对派”都统战了！",
			"date_added": 1535691446356
		},
		{
			"body": "【非洲豬瘟俄11年滅不掉 北京大批進 外媒曝中國成新前線】中國爆發的非洲豬瘟，越來越在全國蔓延開來，越多證據顯示，這場疫情的源頭，可能來自俄羅斯豬肉製品，不過中共官方一直沒有承認。陸媒報道指，非洲豬瘟已在俄羅斯持續蔓延了11年之久。",
			"date_added": 1535789987249
		},
		{
			"body": "网友们着急慌忙的为于海明被无罪开释高兴的时候，有没有深刻的思考过事件发生扭转的本身，而集体忽略了第一个将龙哥“施暴被自卫击杀“的整个监控视频传上互联网的。据多条信息源透露，上传该事件真相监控的值班民警已遭遇停职，或被开除或被处罚。",
			"date_added": 1535948104489
		},
		{
			"body": "西方担忧中共每三年六百亿美元给非洲援助会让非洲落入债务陷阱。其实这种担忧有点多余，非洲借中国的钱就没有还钱的习惯；中共隔几年会宣布一次集体赦免债务。真正需要担心的是中国民众：被中共盘剥的财富被习近平打水飘玩了。今年7月，斯里兰卡总统一高兴，曝露了中共“对外援助”的秘密：习近平给斯里兰卡总统20亿，并称可以用于任何他想用的项目上。全世界哪里有这样的外援？项目不确定、投资没可行性研究、不需要第三方监督，只有一种行为符合中共这种外援模式：行贿。习近平几千亿“对外援助”中，有多少是这种行贿呢？",
			"date_added": 1536120503468
		},
		{
			"body": "【峨眉山金顶有人因重病跳崖，已被证实死亡】昨日峨眉山金顶，一男子不顾围栏内众游客言劝，纵身跳崖自杀……该35岁男子留有遗言称对不起父母，自己患肺癌中期，花了很多钱，实在没办法了。",
			"date_added": 1536207413131
		},
		{
			"body": "【習近平治下失蹤現象加劇】周四有一則消息，深陷“陰陽合同”、消失已近百日的演員範冰冰持有的股票股價腰斬，可是範冰冰人在哪裡，誰也不清楚。網上有人譏諷，“今日範冰冰，明日錢冰冰，張三李四王麻子，說失蹤就失蹤。”",
			"date_added": 1536292531628
		},
		{
			"body": "中共即将垮台之际，中共财政几乎破产，贸易战快要断了中共赚取外汇的财路，中共穷疯了，表面上降低个税，实际上提高社保缴纳金额，增加企业赋税，企业和个人以前可以减免的税费都要求补缴。",
			"date_added": 1536310320749
		},
		{
			"body": "杭州P②P金融诈骗受害者，一位年轻的妈妈自杀了。遗书里血泪控诉当今社会，她爱国爱党，结果维权时候被国家机器殴打。结果价值观全部崩溃，造成对社会失望，丢下了父母和孩子自杀！！！",
			"date_added": 1536384759103
		},
		{
			"body": "緊急關注  黃琦因拒絕接受強迫認“罪”  在看守所內遭毆打",
			"date_added": 1536427157588
		},
		{
			"body": "俄罗斯反对派领导人纳瓦尼的支持者周日在全国举行示威，反对退休改革。法新社消息，数百人被逮捕，而俄罗斯周日举行地方选举，包括莫斯科市长选举。抗议活动对当局构成挑战。",
			"date_added": 1536546508030
		},
		{
			"body": "海风快报2018年9月10日(89期)海风 习近平执政的“驭民五术” 习近平上任之初，在中央政策研究室的一次座谈会上问大家：你们看不看《商君书》？当时大多数人都说看过。习又问大家：《商君书》中最经典的治国之策是什么？我认为《商君书》中最为经典的还是“驭民五术”。",
			"date_added": 1536683637336
		},
		{
			"body": "【日本拒绝普京年底缔结和平条约的提议】俄罗斯总统普京12日在远东海参崴举行的东方经济论坛上向日本首相安倍晋三提议，在不设任何前提条件的情况下于今年底前缔结和平条约。",
			"date_added": 1536893251679
		},
		{
			"body": "中国现在成了世界第一笑话大国，反骨乐队不能说，只好改成正骨乐队。以后不能表达反感，必须是正感，单反相机不能说，必须说单正相机。你害怕菜刀还可以理解，尼玛，你还害怕一个反字，真是逗死了，这帮天下第一蠢的蠢儿子！",
			"date_added": 1536999923444
		},
		{
			"body": "路透社援引《华尔街日报》周六报道，美国总统特朗普可能自下周一（17日）开始，宣布对额外的价值约2,000亿美元的中国商品征收进口关税。",
			"date_added": 1537068938467
		},
		{
			"body": "全世界在積極的\"排華\"，各國政黨只要高調承諾反華，就能贏得超高選票。",
			"date_added": 1537080941698
		},
		{
			"body": "2018年9月13日。男子骑电动车送孩子上学，被流氓交警拦劫拔了钥匙 ，并且不知怎么还把人家的孩子给弄丢了！孩子家长急了…… ",
			"date_added": 1537112248061
		},
		{
			"body": "又该吃午饭了。可是，重庆市彭水县朗溪乡中心小学的孩子们不知为什么却没有饭吃，他们只能靠玩来忘掉饥饿。",
			"date_added": 1537158136148
		},
		{
			"body": "美博士万里寻亲 现身悉尼人体展要求鉴定DNA",
			"date_added": 1537176267065
		},
		{
			"body": "#噩耗#2018年9月17日，晚获悉中国罗马天主教会河北易县天主教区：师恩祥主教已于2013年死于中共当局强制非法拘禁中日期不详，其亲属至今无法见到师恩祥主教尸骨。消息发布者：罗马天主教会中国教区民间维权追责组织圣磐石会罪犯调查官伯铎禄夏天。主！不要宽恕魔鬼的罪恶，求主俯听我的祈祷。",
			"date_added": 1537204012917
		},
		{
			"body": "突发：今天，广东省怀集县强拆，被屋主砍死三个，其中一个副镇长。",
			"date_added": 1537362610865
		},
		{
			"body": "美国议员称中国领导人所作贸易承诺是空话",
			"date_added": 1537416822846
		},
		{
			"body": "【藏维蒙台港大陆人士联合国前联合抗议习近平】今天是新一届联合国大会的开幕日。一个由13个人权组织主办的联合抗议活动在纽约联合国前举行，他们把抗议的目标共同对准了中国国家主席习近平。包括了西藏、维吾尔、南蒙古、香港、台湾和大陆人的13个人权组织，星期二下午在纽约联合国总部对面的哈马绍广场，举行名为“抵抗非自由世界独裁者习近平的”联合抗议活动。",
			"date_added": 1537417635360
		},
		{
			"body": "【特朗普：在朝鲜问题上正取得重大进展】特朗普说，在他就任总统前，很多人认为美国与朝鲜卷入战争是不可避免的，而 “现在我们的关系至少从个人关系来说非常好。”",
			"date_added": 1537506837798
		},
		{
			"body": "軍售制裁：北京被特朗普打得暈頭轉向 俄國樂見其成",
			"date_added": 1537580302144
		},
		{
			"body": "看来贸易战正向政治领域延展。美国有个好处，舆论监督充分。川普上台后，中共有三条接近川普的暗道：1）邓文迪。2）澳门永利赌场老板、共和党最大捐款人之一永利。3）黑石CEO苏世民。目前，1）邓文迪被FBI“屏蔽”了。2）永利被“metoo ”运动废掉了。3）苏世民仍在起作用，但媒体十分警惕地盯着。",
			"date_added": 1537608596595
		},
		{
			"body": "海风转发：500亿制裁没召见大使？2000亿制裁也没召见大使？ 制裁一个人召见了。😂 以前受伤的是韭菜，无所谓。 这次受伤的可是时艰了，打到了七寸。事情严重了。 如果再这样下去，官员们的财路和去路都断了，谁还会听习的？",
			"date_added": 1537706101116
		},
		{
			"body": "美国开启对中共高官制裁的先例，美国政府美国人民万岁，李尚福被禁止取消美国签证，不能使用美国金融系统，等于把他完全挂空，不能去美国享受与家庭子女父母，情人团聚，也是人生悲剧。辛辛苦苦从国内捞的好处油水，千万亿资产也是付之东流。真的大快人心，伟大的美国，下一个会针对哪一个高官呢！😁😁😀😁].会是包子吗？此刻真的很多高官，甚至中共领导人已经内心在颤抖。拭目以待。",
			"date_added": 1537756023710
		},
		{
			"body": "【川普打到了中共的七寸】就美国制裁中共中央军委发展部及其负责人李尚福中将的事件，今日中共中央军委副主席向美国展开交涉，并表示严重抗议。黄学平要求美国立即纠正错误，撤销所谓的制裁，不然的话，中国军方将采取进一步的反制措施。另外，中共外交部连夜召见了美国驻华大使。",
			"date_added": 1537756336532
		},
		{
			"body": "班農：川普戰略令北京痛得難承受 高官急轉財產 貿易戰「規模史無前例的大」",
			"date_added": 1537844230359
		},
		{
			"body": "轰走接谈官员 千名老兵中央军委彻夜维权",
			"date_added": 1537939383115
		},
		{
			"body": "所有国家都必须向社会主义和共产主义宣战，它给人类社会带来了腐败、混乱和深重灾难。委内瑞拉过去是一个富有国家，因为搞社会主义破产了，成为社会主义灾难的标本，其幕后推手就是中共。美国对所有侵犯人权令人发指的行径予以强烈谴责，我们最终要彻底消除共产组织对全人类的威胁。——川普在联大发言",
			"date_added": 1537940337775
		},
		{
			"body": "习近平昨天在齐齐哈尔说：要练好内功，大不了自力更生。年初还是以全球自由贸易新领袖自居的习近平，怎么到了三季度就成了自力更生的土皇帝了？这角色变得太快了，有点戏剧性。目前讨厌中共的远远不止美国。今天欧美日三方再次商议WTO改革，发表了第四份联合声明。",
			"date_added": 1538109114718
		},
		{
			"body": "【疫苗受害者的孩子们连去天安门广场游玩的权利也被剥夺了】据大纪元消息：在北京的部分疫苗受害者家长想带孩子到天安门广场游玩，却在安检处被拦住，说有上访记录。随后他们被带到派出所，直到晚上，饿着肚子的孩子和家长才被释放 想带孩子去天安门广场游玩的家长黄秀宏表示，安检了两三次，怎么都不让进去，给孩子幼小的心里造成多大的伤害，他们太欺负人了，想想是多冤屈啊？",
			"date_added": 1538109286524
		},
		{
			"body": "以民变推动兵变，以兵变支持民变！",
			"date_added": 1538189732469
		},
		{
			"body": "【独家：中共领事馆参与干涉美国选举 触及美国政治底线】《中国日报》在美国爱荷华州报纸购买广告攻击川普，这几天成为美国各大媒体的重大话题。希望之声的独家消息是，中共的领事馆也参与策划组织了一系列干涉美国选举的事情。",
			"date_added": 1538202883694
		},
		{
			"body": "习近平上台后中国宗教自由的总体趋势不断恶化。包括托马斯·法尔在内的证人指出，他的行为与毛泽东类似，与文革类似，而且不断趋于恶化",
			"date_added": 1538214786960
		},
		{
			"body": "傻逼的“中国解决方案”原来就是“自力更生”闭关锁国",
			"date_added": 1538276417534
		},
		{
			"body": "【楊建利 公民力量】请推友们提供证据和线索直接向美国司法部或者通过 #公民力量 向美国司法部检举：1.中共出资或部分出资、未按照《外国代理人登记法》的要求在美国司法部登记的在美媒体；2.注册显示非中共出资或部分出资但事实上是被其控制或为其服务的在美媒体。公民力量信箱为dcoffice@initiativesforchina.org",
			"date_added": 1538385752754
		},
		{
			"body": "外企：中國三萬億美元外匯儲備的最大支撐 正奪路而逃",
			"date_added": 1538394121330
		},
		{
			"body": "英举行香港座谈会 央视女记者掌掴义工：我有权！",
			"date_added": 1538415506907
		},
		{
			"body": "自力更生是一个很邪乎的词，一般和艰苦生活，忍饥挨饿，闭关锁国配套使用。这也是毛腊肉祖传下来七十年的“精神原子弹”，每次咋呼死千千万万中国草民！",
			"date_added": 1538458139928
		},
		{
			"body": "【俄蒙联合军演不邀邻居中国  剑指何方？】本年度的俄罗斯与蒙古“色楞格”联合军演10月1日拉开序幕。来自两国军队的1千多名军人，200辆坦克和战车等武器装备参加今年军演。两国军队已在9月底前进驻演习场搭建帐篷营地部署完毕。这次军演将持续到10月12日结束。",
			"date_added": 1538502079738
		},
		{
			"body": "我这里一个移友是甘肃兰州的刚刚和我说，他们兰州银行已经换不到外汇了，要换5万美元就要捐20%的钱给银行的准备基金，现在看起来小地方的外汇已经非常紧了！",
			"date_added": 1538542817172
		},
		{
			"body": "美国参议院将推出新法，制定亚太地区国际秩序规则，阻止中共称霸亚太地区！该法案已经得到 #彭培奥 和 #马蒂斯 的支持。国会将拨款经费15亿美元或双倍，落实以下几项具体措施。1 阻止中共扩张。2 鼓励美国高层访台，外交支持。3 确保南海航行自由。4 维护和捍卫民主、文明社会，人权以及亚太地区法律。",
			"date_added": 1538572102219
		},
		{
			"body": "【副總統彭斯周四將發表特朗普政府的中國政策】美國副總統彭斯（Mike Pence）預計10月4號星期四上午11點多在華盛頓的智庫哈德遜研究所發表白宮的中國政策。特朗普政府資深官員此前舉辦了背景簡報會，資深官員說，中共正在以前所未有的政治、經濟、軍事以... ",
			"date_added": 1538620848945
		},
		{
			"body": "今天的CNN重點新聞就傳出「美軍擬在南海、台灣海峽實彈軍演」，美國海軍已經要求太平洋艦隊主導一系列的軍演活動，彰顯維護「自由航行」的決心。",
			"date_added": 1538671724211
		},
		{
			"body": "每天在中国人身上发生的事情，都超出了人类的常情和常理。我想到瑞典事件后的一位网民说：“中国人究竟怎么啦？中国人为什么似乎跟人类的距离越来越远？中国人给世界的印象还有什么？换句话说，中国人离丧尽天良还有多远？”",
			"date_added": 1538671958533
		},
		{
			"body": "彭斯發布美國迄今最嚴厲中國政策 中共大使突表態北京願讓步 習近平改主意了？: 美國與西方主要國家達成貿易聯盟，對中共形成包圍之勢。按照提前多日預告的那樣，4日周四，美國副總統彭斯公布美國的中國政策，公開中共針對川普總統的顛覆活動。此前一天，中共突然改口，稱願意在貿易紛爭中讓步。",
			"date_added": 1538760944483
		},
		{
			"body": "天朝刑警向國際刑警亮劍，吏害了你的國﻿！",
			"date_added": 1538821432033
		},
		{
			"body": "平度老兵抗议行动，坚持2天1夜，宣告失败。 被带离的老兵，部分在平度医院，有些老兵受伤，需要检查、治疗。 体制内要粮的，不可能和体制死战，至多聚集示威，施压。当局不买账时，老兵就是刀下羔羊。",
			"date_added": 1538890375240
		},
		{
			"body": "海风呼吁：中共气数将尽，如今的中共是内忧外患。对于有志推翻中共专制建立民主法制新中国的人来说，这正是一个天赐良机。大家都可拿起笔，对习对中共暴政口诛笔伐，不会写的就积极转发与口头传播不要观望或参与一些个人是非。说得多不如做得好，，维护正义不是请客喝酒，只要人人动手，何愁中共不灭！",
			"date_added": 1538890646231
		},
		{
			"body": "平度，警方盾牌部队迫近，试图分割老兵，遭遇棍棒对抗。",
			"date_added": 1538915847311
		},
		{
			"body": "有平度百姓给送吃的喝的。中共离心离德可见一斑。",
			"date_added": 1538916245500
		},
		{
			"body": "【五国目前正在南海军演，中共称有权驱离！澳军警告：你驱离试试！】对于中共的嚣张，澳大利亚国防部长警告：若中共舰艇近距离靠近正在自由航行区域内演习的舰艇，根据国际惯例，中共舰艇将被视为“破坏稳定和具有潜在危险的对象”，演习军舰有权向中共舰艇开火。",
			"date_added": 1538929603322
		},
		{
			"body": "10月7日晚，各地老兵再度被平度当局调集的庞大警队冲散。目前分散各街区，部分在医院。明日或重新聚集。",
			"date_added": 1538932424792
		},
		{
			"body": "7日，平度，老兵遭到殴打，喷辣椒水。",
			"date_added": 1538933305419
		},
		{
			"body": "山东平度，10月8日上午，莲花池公园。外地声援老兵仍在此地。代表和市长李虎成现场接谈。李不让拍他视频，遭一老兵怒怼。",
			"date_added": 1538978309768
		},
		{
			"body": "几位声援平度的外地老兵，被交警拦截后，弃车，步行进平度城！",
			"date_added": 1539003439019
		},
		{
			"body": "实话实说，孟妻申明追求真相没问题，说追求正义有点玄乎了，追求历史责任更无厘头。如果她真是这样一位深明大义的女性，她就不会有这样的丈夫。身为公安部高管家属，公安部的腐败与黑暗，她还见得还少么？",
			"date_added": 1539058492827
		},
		{
			"body": "3 hours ago  9日，内蒙古老兵，自治区政府前聚集维权。",
			"date_added": 1539089690853
		},
		{
			"body": "9日，福建老兵北上，去北京上访。",
			"date_added": 1539092006661
		},
		{
			"body": "平度，各处拦截老兵，像搜查车匪路霸。",
			"date_added": 1539092153267
		},
		{
			"body": "在美国的经济制裁下，中共国的出口造假暴增，主要是通过改变商品的HTS编码，来躲避新增关税惩罚。据悉，中共国厂商通过社交网站互助造假，还试图收买美国报关公司。",
			"date_added": 1539141261879
		},
		{
			"body": "最后通牒：美方要求中国在11月底G20峰会前提交让步清单",
			"date_added": 1539163737368
		},
		{
			"body": "2018年10月9日，内蒙古数千退伍老兵聚集到自治区政府大楼前维权示威抗议，要求官府兑现承诺，并提出了十项要求，包括要求提高养老金标准，解决无业、失业的“两援”参战人员的社保和医保待遇，禁止把老兵列为稳控对象，对非法维稳人员进行全面调查，依法惩处等",
			"date_added": 1539171719392
		},
		{
			"body": "剛得到的消息：繼大陸教育群體私人護照被收繳後，大陸多地、多行業都被通知：所有人員因私因公出境必須要向上級部門（監察部門等）進行申請報備，上級部門批示准許後，方可出境！",
			"date_added": 1539233255497
		},
		{
			"body": "黄文勋计划双十节跑步庆祝民国生日，昨晚深夜被抓，请关注！",
			"date_added": 1539236351188
		},
		{
			"body": "彭博社作家Eli Lake发文要求以孟宏伟被失踪为由中止中共的国际刑警组织成员国资格，其理由是该组织80％预算来自西方国家，但为流氓国家掌控和侵蚀，滥发红通打击政敌或异见人士；党国要么派了个贪官做世界警察头，要么孟无辜，但北京不尊重刑警组织必须面对后果，否则流氓成了警察，该组织将一文不值。",
			"date_added": 1539255007336
		},
		{
			"body": "川普總統再度對中國發重話：川普星期四在一次競選會上說，他對中國的經濟貿易政策已經嚴重損傷了中國經濟，但他還有很多牌可以對中共打出來。",
			"date_added": 1539274433165
		},
		{
			"body": "美国国会议员卢比奥和斯密斯写给FBI局长的信，要求FBI彻查中共威胁骚扰在美国的华人、维人及藏人的种种事件及个案。",
			"date_added": 1539311065844
		},
		{
			"body": "湖南衡阳市蒸湘区的百姓在市政府前维权",
			"date_added": 1539325688134
		},
		{
			"body": "中共光天化日再次打脸！ 前几日，中共多次抨击联合国和美国诽谤中共在新疆建立集中营，违背事实，凭空捏造。 昨日，中共对外宣布新疆拘禁营合法化，允许地方政府建立政治再教育中心，监禁受极端主义影响的人。",
			"date_added": 1539328202135
		},
		{
			"body": "平度老兵维权特大喜讯：《特别快报》大快人心，山东平度市委书记被就地免职，接受调查，其它主要领导及造事者正在接受调查等待处理。",
			"date_added": 1539359916115
		},
		{
			"body": "【大豆不够 让猪节食】中国饲料工业协会征求业界意见，计划降低猪饲料粗蛋白质的含量。猪越重，粗蛋白的下限越低，可补充适量工业蛋白，此举可让中国少进口一千万吨大豆。网友：工业蛋白？就是三聚氰胺之类的吧 ... 刚被历史的车轮碾过去，又要倒车？",
			"date_added": 1539399833581
		},
		{
			"body": "原定的八國聯軍的南海軍演，現擴大到二十六國聯軍，這條震驚世界的特大新聞事件，中共國媒體竟然隻字不提！ 地球上有七十億人口，有五十六億人類都",
			"date_added": 1539406824435
		},
		{
			"body": "中共已经取代三胖成了头号人权恶棍",
			"date_added": 1539409581527
		},
		{
			"body": "中共当局在穆斯林集中的新疆对清真产品发动一场决战，防止清真产品的扩散。当局宣称此举是为了不让伊斯兰教进入世俗生活，防止极端主义。新疆的穆斯林干部还被要求宣誓放弃自己的宗教，只信仰马列主义。",
			"date_added": 1539417703731
		},
		{
			"body": "美國安顧問波頓：中共從未見過這么強硬的美國總統(圖): 美國國家安全顧問波頓（John Bolton）昨日接受專訪，透露美國政府會進一步向中共採取更嚴厲的手段，公開呼籲中共政府「在貿易、國際、軍事和政治方面的行徑必須調整」，更指出中國是「本世紀的重大議題」，",
			"date_added": 1539417991854
		},
		{
			"body": "据疫苗家长说，他们那里新疆模式推广到广州……为了方便排查是本地人还是新疆人，必须进群分类词库便于监控……",
			"date_added": 1539418678984
		},
		{
			"body": "儒家挖了个大坑，国人躺坑里几千年都爬不上来，读圣贤书，做人上人，读书不是为了学习知识和研究事物，是为了做人上人，要搞权谋术。国人至今都学不会平等的与人相处，要么我踩你，要么你踩我，平等的话，坐在一起都不自在，而这个是跟现代文明精神南辕北辙。",
			"date_added": 1539439327484
		},
		{
			"body": "声援平度被打的广东肇庆老兵，回到家乡住进医院。",
			"date_added": 1539441361319
		},
		{
			"body": "明天崔天凯在福克斯有个采访。他能说什么？无非三句话：1）中共无意挑战美国。2）中共愿意谈判解决贸易冲突。3）冲突两败俱伤。川普称目前不愿与中共谈判，就是指中共反复重复这句三空洞的话，没有诚意。",
			"date_added": 1539481833087
		},
		{
			"body": "美国参议员马可卢比奥：我们今天看到的中国是一个崛起的但越来越霸道的中国。中国不仅觊觎在国际舞台上取代美国，同时还想改写开发、贸易、互联网甚至人权领域的国际惯例。与此同时，在中共的领导下中国的独裁政治系统一点儿也没变。事实上，这个政治机器正在变得更加凶狠。",
			"date_added": 1539496182246
		},
		{
			"body": "这位上访维权的美女老兵，彭晓燕，复旦大学上海医学院护理系毕业，军龄17年，2017年4月转业江苏宝应，就失业了。于是加入一帮老男兵行列，上访。 2018年9月25日，她作为代表之一与军委信访局接谈，关键时刻喊住老兵不散，坚持得到了初步结果—志愿兵被集体承认预备役军官身份。",
			"date_added": 1539530095130
		},
		{
			"body": "廣州退房潮來了：幾個片區多個樓盤同時爆發維權活動(圖): 廣州首個退房潮爆發了！截至發稿前，廣州幾個片區多個樓盤今天同時爆發維權活動。 廣州的這些業主們 為何要求退房？ 今天下午，每個出現維權潮的樓盤大多聚集了數十到上百名業主，他們的訴求各有不同。",
			"date_added": 1539535511776
		},
		{
			"body": "我國的學生赴大陸留學有一種是在孔子學院進修一年（免費，包食宿、生活補助150美元/月），然後索教育部推荐信，到大陸駐索大使館辦簽證，去留學攻讀本科，大陸補助800美元/人/月、碩士1200美元/人/月，博士1800美元/人/月。如是伊斯蘭教徒月補膳食300美元/人/月。",
			"date_added": 1539574167611
		},
		{
			"body": "我们根本没有国，没有真正属于自己土地、房屋甚至墓地，没有出入境以及言论自由，没有出版、集会结社的自由，没有隐私，没有保护自己不受不公平待遇的能力，我们不是公民而是居民，是群暂住在这片土地上的租客。在这一切没有得到改变之前，请不要跟我谈什么爱国，我们根本没有国！",
			"date_added": 1539576820049
		},
		{
			"body": "下星期东南亚10国国防部长会议将在新加坡举行，讨论如何共同对抗中共在南海的霸权扩张。 中共立即威胁澳大利亚，不要站在美国一边，否则，将面临巨大的经济惩罚！",
			"date_added": 1539584942220
		},
		{
			"body": "美国五角大楼换马预示对华政策更趋强硬。川普星期天在接受电视采访的时候说，国防部长马蒂斯“是个好人。我们很合得来。他可能会离开，我的意思是，每个人在某个时候都会离开。人们会离开，这就是华盛顿。“ 有分析称，马蒂斯有时与川普本人以及内阁中更加鹰派的官员意见不合，包括国家安全顾问博尔顿。",
			"date_added": 1539614705185
		},
		{
			"body": "鹰派陆军总参谋长最新表述，美军存在的唯一目的就是保卫国家利益。他警告美国的敌人，无论他们在什么地方，必须知道，美军将担负一切重任，克服一切困难，以确保美国尊崇的自由价值观在地球上不朽",
			"date_added": 1539628038189
		},
		{
			"body": "辽宁闹猪瘟，政府不让养猪，不管有病没病全部电击毙，这是在辽宁盘锦的实拍。决策者决定给老百姓每头猪1200元补助，到了下边执行者只给农户一头猪200元，说是其余的1000元走费用了。买头猪仔就得三百到五百元来元。结果是农户损失惨重，执行者发了笔洋财。找谁说理去",
			"date_added": 1539663811809
		},
		{
			"body": "学员梦话也要记录！ 疏疏勒县集中营看守:\"夜间每2个学员值班1小时，监督别人。学员的梦话也要记录。装睡偷偷做礼拜的学员一经发现交国保处理\"",
			"date_added": 1539676028238
		},
		{
			"body": "东北的医院贴出告示：东北的社保、医保都用完了，见底了。呵呵，一个公有制最高的省份，搞成这样。",
			"date_added": 1539694748723
		},
		{
			"body": "另据中共官方数据显示：上半年已有5百万家公司宣布破产！哇哦！这么说，下半年破产的应该只多不少！ 天快亮了！",
			"date_added": 1539696213479
		},
		{
			"body": "川普 宣布：正式与欧盟，英国和日本开始自由贸易谈判。如果自由贸易协议达成，中国将彻底被孤立。",
			"date_added": 1539747096088
		},
		{
			"body": "【黑龙江一前任村书记 将3名上访人腿打断 还私藏枪支】",
			"date_added": 1539747249767
		},
		{
			"body": "孟宏伟妻被秘密转移至巴黎筹备发布会 中共高层急欲引渡 习近平方寸大乱",
			"date_added": 1539769017753
		},
		{
			"body": "毛极力赞赏酷刑：“倘有土豪劣绅最强硬的，便割脚筋和耳朵，戴高帽子游行”，当然他更喜欢将土豪劣绅“活活地打死”。这成了中共杀人酷刑的模板，“枪杆子里面出政权”，杀人才能拥有皇帝的至尊。在为人民服务、人民民主专政、实现共产主义等幌子下，毛泽东的杀人言论一直是中共杀人机器的润滑油。",
			"date_added": 1539775063449
		},
		{
			"body": "憂心新疆再教育營慘況 印度穆斯林上街抗議：反中國！",
			"date_added": 1539799206497
		},
		{
			"body": "北京人民游行呐喊保护崔永元，支持正义！",
			"date_added": 1539799988757
		},
		{
			"body": "若干曾被拘押的人士告诉《华尔街日报》，他们当时每天都要接受数小时的政治灌输，还被迫批判伊斯兰教。其中一人称，他曾被绑在椅子上长达好几个小时，双手被拷在背后，接受关于他与海外宗教团体之间关联的审问，而他否认与之存在关联。",
			"date_added": 1539834286758
		},
		{
			"body": "終有一天中國🇹🇼也得通過決議承認三年大饑荒是中共針對中華大陸地區人民的民族滅絕行為。（主要證據就是民兵封鎖路口不讓村民討飯、中共官方糧倉不開倉賑災、毛魔在饑荒時期仍堅持將大陸地區產出的糧食送往外國做外援）",
			"date_added": 1539835690989
		},
		{
			"body": "93名将军，6名上将，排队进班房，而不反抗土包子。这样的军人确实无用，活该坐牢。",
			"date_added": 1539868107087
		},
		{
			"body": "杭州樓市熱度退潮 連房租也開始跌了: 樓市熱潮漸退，二手房成交量大減，價格也略有下滑，如今還波及到了租房市場，杭州不少板塊，9月的租金水平明顯下降。 無論是房東還是中介，最近都說“感覺租客一下子少了好多”",
			"date_added": 1539881690041
		},
		{
			"body": "现在各县级镇级领导每天主要任务就是维稳和抓所谓的黑社会势力",
			"date_added": 1539918806163
		},
		{
			"body": "最近读了一本伊拉克小伙子写的纪实小说，里边写着巴格达那夜的真相，前一天黄昏，部队准备好了迎战联军，第二天早上战士们发现连长不见了，去找营长，也没了，团部呢？一个人都没有了。于是，大家就各自回老家了，仗糊里糊涂的结束了，没人替萨达姆打仗，大家互相忽悠一尊，见了真美军都躲了。",
			"date_added": 1539919240913
		},
		{
			"body": "Erkin Tursun,50岁，毕业于\"新疆\"大学历史系，伊犁州电视台导演，热心公益，被人们称为\"伊宁四宝\"之一。他因在一档受欢迎的节目中反应了维吾尔儿童的贫困问题而受监控。今年3月被伊宁市国保抓走，很快就被判刑，有说被判7年，也有的说11年。",
			"date_added": 1539945235940
		},
		{
			"body": "今天上午（10月19号）湖南耒阳市城管将一个卖水果的小贩活活打死！",
			"date_added": 1539947633803
		},
		{
			"body": "爆裂！金正恩提出“一国两制”和平统一构想，组建高丽民主联邦共和国！这个联邦共和国应该互相承认和容纳对方的思想和社会制度；成立双方以同等资格参加的民族统一政府，双方实行地区自治；对外采取中立政策，不加入任何政治、军事联盟或集团！",
			"date_added": 1539949757633
		},
		{
			"body": "大妈超市买菜刀，因不知有“菜刀也需要实名登记”的规定，拒绝登记，跟超市店员发生语言冲突，随后升级到轮起菜刀就砍。",
			"date_added": 1540004003878
		},
		{
			"body": "法国🇫🇷工会支持声援中国劳动工人独立抗争组织、年度会议",
			"date_added": 1540006507373
		},
		{
			"body": "用生命、热血争抢的山头，打完仗又划给越南了。 事实就是这样，你不要悲哀，共和国的旗帜上根本就没有你徐良血染的风采！ 你血染的风采换来的只是轮椅和上访户的登记表！",
			"date_added": 1540107156487
		},
		{
			"body": "美擬再派軍艦通過台海 傳至少2艘且任務多天",
			"date_added": 1540115205951
		},
		{
			"body": "长期不看新闻联播患抑郁症，中共驻澳门最高级别官员，中联办郑晓松，于20日跳楼自尽。",
			"date_added": 1540190107753
		},
		{
			"body": "黑帮内部杀来杀去很平常的，中共这个黑帮内部杀死几个人有什么奇怪。中央政府驻澳门联络办公室(澳门中联办)主任郑晓松堕楼死亡后率先公布他因抑郁堕楼致死，有什么好奇怪的。中共这个黑帮一直这样。",
			"date_added": 1540204409779
		},
		{
			"body": "看到这个“新闻”，只是感觉：1、碑林区65万人口，也就是说平均约600人里，就有一名衙门的眼线，你身边无处不在，一个恐怖社会。 2、假设每人年薪5万，碑林区年开支5000多万，依此比例，全国千亿以上，可怕。 3、按说这是警局的私密，故意公布，无非是想震慑、威吓市民——你小心点，老子随时看着你。",
			"date_added": 1540261204797
		},
		{
			"body": "自由亚洲电台：0月21日消息，伤残军人陈凤强遭珠海公安跨区域绑架失踪已超过24小时，家人仍然没有收到绑架方的任何通知。二哥陈凤明为确认陈凤强的下落，到金海岸派出所金湾区公安分局询问，得到的答复居然都是不知道。10月20日早晨，租住在广州市花都区赤坭镇乌石村的伤残军人陈凤强听到有人敲门就去开门，结果门一打开就闯进来十多人，对其实施暴力绑架，同时将陈凤强的妻子郭凤珍反锁在屋里，郭凤珍从房屋内拍到了这些人驾驶的两部警车，证实是珠海市金湾区公安的车。",
			"date_added": 1540261461338
		},
		{
			"body": "【胡锡进愿意把自己老婆、女儿送进铁丝网“快乐”吗？】 坏球时报总编胡锡进发布了一个视频，内容是新疆喀什教育培训中心（强制洗脑班）的文体活动时间。被教育的新疆人统一着装坐着塑料小板凳在围观别人打乒乓球并鼓掌，坐着的女囚们连头发都被剃成一样的齐耳短发。还有的在大铁丝网内跳舞。还用这么多高铁栅栏把人群隔离成一块一块的。胡锡进总是想让国人们认为这些被教育者在铁丝网内过得很快乐。这大概是党国交给他的任务吧？俺在视频里唯一可以获取的信息是：中共在新疆真的抓了很多人，光从这一处关押点就能看出，国际媒体说中共搞集中营真的一点都没错。胡锡进的视频和微博是中共反人类犯罪的铁证。",
			"date_added": 1540439066405
		},
		{
			"body": "最近，中共突然承认新疆集中营的存在，中共强调集中营主要是职业培训。但是全世界都不相信中共的解释：哪里有被强制性拘禁在铁丝网里、长期与家人和社会隔离的职业培训的？中共这个反人类的暴行必将遭到历史清算。",
			"date_added": 1540439125023
		},
		{
			"body": "【日政府终止对华开发援助，才知道40年来日本帮中国这么多】 自由亚洲电台：在《日中和平友好条约》生效40周年之际，日本政府宣布终止对华政府开发援助 。1976年文革结束，中国大陆百废待兴，基础建设要起步，必需要借助外国资金。1979年之后，北京地铁一号线、首都机场、中日友好医院，相继落成，这些项目主要都是靠日本人提供的低息贷款和技术援助。但日本人长期援助中国，在中国大陆，不是很多人都知道，大部分国内民众，只记着二战时日本侵华那段历史。是因为官方宣传机器刻意低调处理的结果。",
			"date_added": 1540439256612
		},
		{
			"body": "卢比奥： 中国试图说服世界新疆拘留营是职业培训中心。但是什么样的职业培训中心购买 2, 768 个警察警棍,，550 只探头， 1, 367 对手铐和 2, 792 罐胡椒喷雾？",
			"date_added": 1540439349750
		},
		{
			"body": "在新疆其它民族说自己语言都是罪，朋友的孩子在学校被告知如果说自己语言会被送集中营。",
			"date_added": 1540439391072
		},
		{
			"body": "日本《产经新闻》10日报道，中共公安部副部长、国际刑警组织主席孟宏伟被北京当局以贪污受贿罪逮捕，不过北京的人权律师表达了对孟宏伟案的看法，“孟宏伟卷入中国共产党内部权力斗争的可能性极大”。孟宏伟的实权比起中国国内部分高官要小很多，即使存在收受贿赂的犯罪事实，所涉金额也不会过于巨大。报道认为，孟宏伟被中共当局逮捕主要是因其涉及重要机密：一是孟宏伟可能与中国海航集团董事长王健7月在法国坠亡事件有关；二是孟宏伟可能曾计划逃往美国，打算向美方提供中共领导人亲属在海外的资产清单。报道称，孟宏伟案对于北京而言，或是一件不容忽视的大案。",
			"date_added": 1540439530466
		},
		{
			"body": "纽约时报中文网‏：张伦：今年，我的一名台湾朋友在上海一所大学做客座讲座。演讲前，他在教室里试用设备，一个响亮的声音凭空冒出来，责备他在测试之后还让机器开着。 他扫视房间。没有人。然后，他在墙上看到了监控摄像头和扬声器，这是个令人不寒而栗的提醒——他将在学校当局监视的目光下教学。",
			"date_added": 1540439635869
		},
		{
			"body": "萬人抗議 廣東杏壇政府屈服 民居旁高危化學廢品處理叫停",
			"date_added": 1540525935323
		},
		{
			"body": "《華爾街日報》引述匿名美國和中國官員報道，美國拒絕重啟與中國的貿易談判，除非北京方面提出具體方案以解決美國對強制技術轉讓和其他經濟問題的不滿。  報道指，中國曾邀請美國副財長David Malpass重啟談判，但後者在白宮貿易團隊支持下回絕了請求，除非中國提出正式建議。",
			"date_added": 1540533654432
		},
		{
			"body": "日本首相安倍应邀访华，同时宣布终止长达39年的对华ODA援助，并在访华之前参拜了靖国神社并做了供奉，这些都不见中国官方媒体给予报道，中国民间的反日人士情绪十分稳定，好像装死一样。这就是传说中的贱人！中日关系趋于正常甚至友好化的时候，基本就是中国政府和中国人装逼艰难或者装不下去了时候。",
			"date_added": 1540533793744
		},
		{
			"body": "被判處無期徒刑的伊力哈木先生今天度過了他的49歲生日。伊力哈木否認分裂國家的指控，並稱自己沒有支持新疆獨立，在2014年的法庭上多次稱「我的自治觀點很明確。」、「我是自治派。」、「我希望新疆以聯邦的形式留在中國。」連這樣妥協的學者都被重判無期徒刑，維吾爾人的未來祇有一條道路可以選擇了。",
			"date_added": 1540533833495
		},
		{
			"body": "普京下令抵制習近平“一帶一路”！安倍叫停多華40年援助！",
			"date_added": 1540543358372
		},
		{
			"body": "中共时代是人类历史上最残暴的恐怖主义时代：北京第27中学，一名初中学生被指控把《毛主席语录》本坐在身子底下。遭同班的红卫兵毒打。她被打得昏死过去以后，红卫兵拿碎玻璃往她眼睛里揉。她苏醒过来，继续被打。傍晚时分她被打死。她的尸体被用草席子卷起来运走烧掉了。问到当时的目击者，却没有人记得这个女学生的姓名。",
			"date_added": 1540552312551
		},
		{
			"body": "伊朗反抗组织成员挨家挨户在派发传单",
			"date_added": 1540554805673
		},
		{
			"body": "伊朗抵抗运动成员，白天找好目标，神棍政权的宣传标语，广告牌，晚上把它烧了。值得中国人学习。",
			"date_added": 1540554926203
		},
		{
			"body": "驻美记者林慕莲：六四上午成都市民获知北京屠城事件，纷纷走向广场抗议，军警抓捕了示威者百余人，共畜下令就地处死。屠夫把勇士们的头按在地上，抡起铁棍砸碎脑袋，脑浆崩裂。场面极度血腥，令目击者们呕吐不止。此后共畜不仅严控忍民，而且强制忍民失忆。在共畜眼中，你的记忆就是威胁。",
			"date_added": 1540556867697
		},
		{
			"body": "中共福利院贩卖儿童已经几十年了。不过其更严重的罪恶，却是为了侵吞拨款，害死病童，主要是把孩子关在禁闭室饿毙。 我知道曾经有个福利院工人，偷拍病童被饿毙录像，然后跟福利院长讨价还价。 他没想到的是，除了要躲避福利院派出的杀手，还有公安部通缉令，最后他只有投案自首。",
			"date_added": 1540557044076
		},
		{
			"body": "星期六，朝鲜和韩国之间的分界线、1953年签署停战协议的板门店数十年来将第一次没有任何武器。  朝鲜半岛南北两方上个月同意从共同警备区、也就是通常所说的板门店村撤走所有武器。",
			"date_added": 1540557155780
		},
		{
			"body": "2018-11-4，美國對伊朗的全面制裁即將生效，中國兩大能源公司已停止下單購買伊朗石油。因任何違反美國制裁的個人與團體將面臨“嚴重後果”。",
			"date_added": 1540570320051
		},
		{
			"body": "【又一网安队长猝死 网警们怕不怕？】10月24日上午，四川省内江市公安局网安支队支队长罗刚在参加全局工作会议时，突然猝死，时年46岁。报导称，家人至今仍不敢将消息告诉罗刚年逾八旬的母亲。",
			"date_added": 1540703553948
		},
		{
			"body": "没有WTO，中共应该已经早死了。2000年左右，中国地方财政已经快要破产，市长工资都发不下来，中央只给基本工资，地方津贴才是工资的大头，那个时候市长要靠警察扫黄打非抓嫖客创收来发地方津贴的工资！WTO真是共产党的救命稻草啊！现在他们妄想另一根救命稻草再次出现！",
			"date_added": 1540704848090
		},
		{
			"body": "Canada prepared to stall trade deal with China until its behaviour is 'more reasonable'",
			"date_added": 1540710241484
		},
		{
			"body": "加拿大政府宣布：停止与中国的所有贸易协议，直至中国合乎世界规定为止。",
			"date_added": 1540710352600
		},
		{
			"body": "10月26日，乌克兰ProZorro网站消息，切尔尼戈夫州谢苗诺夫斯基市议会出售一个旧金属——拆除的2.5 吨重的列宁青铜像的拍卖会，有14人参与竞拍。起拍价是4.5万乌克兰格里夫纳，最后竞拍赢家以22万乌克兰格里夫纳拍得。从2015年5月起乌克兰实施了一项禁止宣传苏维埃标志的“谴责共产主义和纳粹制度”的法律。",
			"date_added": 1540717774651
		},
		{
			"body": "日本防衛省廿八日公布，航空自衛隊十六架戰機與美軍B52轟炸機，廿七日在東海釣魚台海域的上空進行聯合演習。",
			"date_added": 1540717843601
		},
		{
			"body": "波兰国会于2017年6月22号，压倒性通过〝去共产主义〞修正案。法案施行后的12个月内，市政府必须在限定时间内，拆除境内所有颂扬共产主义或其他极权主义的塑像和纪念碑。",
			"date_added": 1540717977670
		},
		{
			"body": "川普21日宣布退出中導條約後，美國國安顧問博爾頓旋即訪問俄國。博爾頓周五透露，川普已邀請普京訪問華府。針對中共的挑釁行為，美國想要與俄羅斯進行戰略對話，也警告俄羅斯，中共導彈已對莫斯科構成威脅。",
			"date_added": 1540718341307
		},
		{
			"body": "美国政府除了为总统提供白宫作为居住和办公场所，1974年和2008年由国会立法，为副总统提供官邸和为国防部长提供住房补贴外，所有内阁官员，包括国会两院的领袖，一律自己掏钱租房子住。以致从各州来华府入阁的官员，首先要办的事情就是租间房子住下来。",
			"date_added": 1540724554922
		},
		{
			"body": "低薪  过劳  高物价才是中国普罗大众生活常态  最近在中国微博上流传着一张报纸照片，上面刊登了整版密密麻麻的企业清算公告，引发了人们对中国经济前景的担忧。这次企业的注销潮发生在中国民营经济较为发达的深圳，据业内人士分析，这次企业集体注销是因为受到了中国“社保入税”新政的影响。",
			"date_added": 1540739584337
		},
		{
			"body": "川普電賀“熱帶川普”當選 右派軸心國成形: 美國總統川普打電話恭賀極右派的波索納洛當選巴西總統。英國衛報指出，以川普為中心的右派軸心國正在美洲成形。美國有線電視新聞網（CNN）評論，隨着自由世界領導者默克爾褪去光環，川普主義正發揚光大。",
			"date_added": 1540884319535
		},
		{
			"body": "彭斯副总统曾在电视访谈节目中指出，是委政府出资组织了这次中美洲国家难民大规模冲击美国边境事件，而委国背后就是大清。古巴导弹危机似乎没有结朿，只是换了导演和方式。",
			"date_added": 1540884452680
		},
		{
			"body": "李咏葬礼昨天在美国举行，年仅50岁。央视的人短命的很多，主要原因不是因为生活不规律，而是因为造口业太重。天天闭着眼睛撒谎害人，害人害己。",
			"date_added": 1540884545433
		},
		{
			"body": "10月30日凌晨，俄罗斯摩尔曼斯克州萨福诺沃第82修船厂（SRZ-82），号称全世界最大的第PD-50号浮船坞中，正在大修的“库兹涅佐夫”号航母发生紧急事故，PD-50号浮船坞沉没。其中有两台塔式起重机倒塌，一台坠入海湾，第二台则砸落在航空母舰船体上，造成船体和人员受伤，目前已致三人受伤，一人失踪。",
			"date_added": 1540894525197
		},
		{
			"body": "28日巴西举行总统大选投票。有〝巴西版川普〞之称的右翼候选人波索纳洛（Jair Bolsonaro）胜出当选新一任总统，这也意味着巴西这个世界第四大民主国家将向右翼政策方向转变。他公开表示自己是美国总统川普的崇拜者，他在堕胎、种族、移民、同性恋和枪支法等方面的观点与言论为他赢得了巴西版川普的称号",
			"date_added": 1540894544699
		},
		{
			"body": "【山东矿难致21人遇难 曾有人称9死被指造谣遭拘留】21日，男子王某在网上发布消息，称该起事故造成21人被掩埋、已确认9人死亡，警方以虚构事实扰乱公共秩序为由对其处以行政拘留十日并处罚款五百元的处罚。",
			"date_added": 1540895004246
		},
		{
			"body": "中南海禍不單行 50%中資要跑路 川普要送新年「大禮」 進博會遭西方國家抵制",
			"date_added": 1540895061600
		},
		{
			"body": "非美国公民父母出生不再是公民，川普声称将签行政命令",
			"date_added": 1540897970277
		},
		{
			"body": "随着外游与移民增多，中国人种种低劣品德与丑态也就闻名世界。许多网文慨叹中国人质素低。但如果看中国官方对游瑞典的三宝和在伦敦闹场的孔某的支持，就知道这种质素是官民一致的。",
			"date_added": 1540904386335
		},
		{
			"body": "美国总统川普在中期选举投票前夕，再度拿中共开刀，禁止进口中共芯片制造商福建晋华集成电路的产品，并指晋华侵占美国半导体制造商美光科技的知识产权。",
			"date_added": 1541125593578
		},
		{
			"body": "10月31日下午，河南省实验中学的老师走上街头。该校为河南知名重点高中，不给老师们缴纳养老金，耕耘多年的老师忍无可忍。 ",
			"date_added": 1541125679031
		},
		{
			"body": "【双汇火腿“染上”非洲猪瘟3个月市值已蒸发百亿】 3个月前，几辆满载双汇集团旗下生猪的卡车从黑龙江开往河南，对猪类致死率100%的非洲猪瘟传至中原地区",
			"date_added": 1541125758734
		},
		{
			"body": "【中共官员又自杀一个！】 内蒙古自治区公安厅副厅长、呼和浩特市副市长、呼和浩特市公安局局长李志斌11月1日自杀身亡。这次是不是抑郁症官方还没有公布。",
			"date_added": 1541125809524
		},
		{
			"body": "在美国总统川普（特朗普）及副总统彭斯近期公开抨击中共后，美国驻华大使馆开始利用中国社交媒体上传批评中共的帖文，提供完整信息给十多亿中国网民。",
			"date_added": 1541125941419
		},
		{
			"body": "四川资阳市安岳县城西乡云台村患有间歇性精神病的村民吴玉华从未申领过低保金，但账上却出现21500元低保金交易记录，后发现是被村支书吴松林取走。吴书记辩称，我经常给他花钱。",
			"date_added": 1541126034423
		},
		{
			"body": "毛泽东曾在1940年底通过季米特洛夫给斯大林两封电报，提出‘十五万精兵计划’：中共用15万精兵偷袭重庆，把蒋介石政府干掉。造成日本与汪精卫占领南中国，苏联与中共占领北中国的南北朝局面。（见何方《党史笔记》）",
			"date_added": 1541126056898
		},
		{
			"body": "据供应链透露，10 月 30 日是美国实施出口管制的第一天，美国三大半导体设备商 Applied Materials 、 Lam Research 、 Axcelis 当天就将驻厂人员全数撤出福建晋华的 12 寸厂，所有的机台设备装机、协助生产的动作全面停止，而已下单但未出货的机台设备则全数暂停出货。",
			"date_added": 1541126147322
		},
		{
			"body": "首屆中國大陸國際進口博覽會將於11月5日至10日在上海舉行，上海維權人士、訪民被警告不得去到會場和周邊地區。今日（11月1日），仍有十餘名訪民不畏強權，前往會場附近“快閃”，結果引來警察追捕。",
			"date_added": 1541127720287
		},
		{
			"body": "美国驻中国大使馆本月 2 日在微博帐号发布消息，大使布兰斯塔德（Terry Branstad）将透过微博与中国网友互动，欢迎他们提问并进行回答，引发中国网友热议，提问「在 US 有我们中国多少贪污人士在那」。",
			"date_added": 1541211099442
		},
		{
			"body": "中国经济继续溃败，高层几个老头子坐不住了，开会商议对策，均表示看不懂，一切听老大的安排。老大翻遍梁家河秘笈也没找到答案，无奈致电川大爷求解。",
			"date_added": 1541211162928
		},
		{
			"body": "【川普：美国将拒绝一切不经边境口岸的庇护申请】周四（11月1日）下午，美国总统川普宣布，为应对目前南部边境的“边境危机”，和近来出现的大量虚假庇护申请，美国政府将要求庇护申请者在海关口岸合法呈现自己。",
			"date_added": 1541212218200
		},
		{
			"body": "又一起 北京女乘客拎整箱牛奶砸公交司機",
			"date_added": 1541212247451
		},
		{
			"body": "中国国家主席习近平大力推介，要把进博会宣传好，以图在商贸战困境下向外界展示中国开放市场业绩，而且开幕时习近平将亲临现场发表演讲，然而，离开幕还有两日，国际关注少，美国表明不捧场。世界主要经济体领导人也都缺席。",
			"date_added": 1541213513686
		},
		{
			"body": "20181102 朱承志已被羈押於蘇州市第一看守所。董奇轉貼被判刑一年半。四川巴中市十名法輪功學員面臨非法庭審。史竟、毛黎惠、謝英科、宋武秀等被拘留。",
			"date_added": 1541214265811
		},
		{
			"body": "晉華遭美製裁 生產運作全停 官網消失",
			"date_added": 1541219414162
		},
		{
			"body": "刘少奇1949年4月10日到5月7日之间在天津调研时，曾对天津各界私营企业主发表热情洋溢的讲话，重点提到了以下几点：一是“剥削用功”，二是私营企业与公有企业将长期并存，三是民族资本家是“自己人”。可是很快公私合营风卷残云，私企被全面接管，向私营企业做出承诺的刘少奇最终也惨死于开封。",
			"date_added": 1541223078993
		},
		{
			"body": "【新喀里多尼亚公投拒绝独立续留法国怀抱】新喀里多尼亚公民表决，尽管至此全部选票计票尚没有完成，但已有百分之70以上的选票统计，超过百分之59的选民选择拒绝独立，继续留在法国身份所属。法国总统马克龙巴黎时间午后1点发表全国讲话，回应新喀里多尼亚公投的多数决定。",
			"date_added": 1541349605223
		},
		{
			"body": "【上海开进博会，你饭量大也不行】 一位上海居民为自己点了一顿丰盛的外卖餐。随后, 警察来检查他的家, 怀疑他把人藏在家里 (他早些时候曾告诉警察, 他一个人生活)。说出来你们可能不信，我今天因为吃太多，被警察找上门了。故事是这样的，上海在开**会，出于安全对周边人口严密排查。今天上午已经有被两波警察来查问居住状况（都是2个女警一组，此为伏笔）。在我的午餐外卖到了2分钟之后，外面又有人敲门。打开门，六七个全副武装的男警察。”是不是你点的外卖？开门我们要进来搜查！“一个人控制住我，剩下几个把我的屋子翻了个遍。”你真是一个人住吗？“”是啊我真是一个人住。“”行了没事了！“警察叔叔欲言又止的带上门，最终还是没把“少吃点吧”几个字说出口。",
			"date_added": 1541385901216
		},
		{
			"body": "【开个进博会连酒店都给封了】 上海开进博会连住酒店都有警察陪住，习近平到底在恐惧什么？//草祭：一个上海进博会，竟然搞成五星级酒店面江的房间每屋一警，这个饭店住得也够难受的，难道习主席怕被狙击手暗杀？//@lifetimeuscn：习近平上台之初提出不扰民、不封路等，现在连酒店房间都封。为什么习近平会觉得很多人想杀他呢？//@martyr8899：习近平修宪称帝后生活在恐惧中。世界独裁领导人中，回头是岸的命运都还不错，戈尔巴乔夫、卡斯特罗用服软换得和平晚年；萨达姆、齐奥塞斯库玩抗到底，被惨死；卡扎菲想怂但太晚了；金三的时机则恰到好处，结局看涨；只有咱习胖，二百斤不换肩走到黑。拜登对习家安全的许诺，在川普这里基本过期报销。",
			"date_added": 1541385997623
		},
		{
			"body": "【女子跳楼死亡 室内另有三名孩子身亡】 兲朝犹如人间炼狱！杨改兰事件或将重演！11月3日，四川邻水县一名女子跳楼死亡，其所住屋内，另有三名年幼儿童死亡。警方调查确认室内死亡的三名幼童秦某（8岁），秦某豪（2岁），秦某芯（2岁）均为跳楼女子亲生子女。",
			"date_added": 1541386248322
		},
		{
			"body": "‪重庆，一女子裸奔，高喊：“打倒共产党，还我公道！”‬",
			"date_added": 1541386758653
		},
		{
			"body": "上海進博會受冷落 世界厭倦中共空洞承諾: 在川普當選美國總統並提出“美國第一”的承諾之後，中共迅速扮演全球化的“支持者”角色。但是中共並沒有成功說服世界，它是真的要開放經濟。 ",
			"date_added": 1541387084147
		},
		{
			"body": "中国自由派民间智库北京天则经济研究所所长盛洪教授被禁出境参加天则所和美国哈佛大学费正清中心合办的中国改革开放40年研讨会。",
			"date_added": 1541387180334
		},
		{
			"body": "今天虹橋火車站出站都要安檢",
			"date_added": 1541399078856
		},
		{
			"body": "作家马国川：愚以为，真正的定心丸是：1）公开明确反“左”；2）巩固职务任期制；3）平反一批民企冤假错案；4）公开明确否定“文革”。如果没有这些，所谓的“定心丸”就有可能是“大力丸”。",
			"date_added": 1541399232059
		},
		{
			"body": "同学聚会，谈起时事政治，全是，“川普贸易战不得人心，必将被世界孤立”，“安倍乖乖来中国，说明日本离不开中国”，“中国是有不足，但做到这地步已不容易了”，忍不住辩论了几句，才发现自己是如此的孤独。世界上最难的交流不是彼此相距遥远，而是完全不在一个频率上。启蒙的前提是，你自己已开始觉醒。",
			"date_added": 1541399264202
		},
		{
			"body": "遭中国当局封杀的民间智库天则经济研究所，其所长盛洪被当局以「危害国家安全」为由，禁止离境赴美参加一个有关中国改革开放40周年的研讨会，他指责当局的行为属违法，并感慨地说，十年前参加类同会议时以为改革大功告成，现在感觉「恍如隔世」。",
			"date_added": 1541499405433
		},
		{
			"body": "共軍從史上最挑釁大變臉 中美南海險撞艦 最新音視頻曝光雙方對話細節 視頻: 中共軍艦今年九月末在南海撞向美國軍艦。英國國防部內部文件曝光當時兩艘軍艦的對話及視頻。軍事專家分析，這是中共有史以來最挑釁舉動。美智庫分析是中共軍委下令。白宮隨後警告北京，海軍再遇挑釁將按交戰規則處置。",
			"date_added": 1541499487506
		},
		{
			"body": "川普总统在11/5俄亥俄州演讲中说，他和习主席有机会达成对双方有利的交易。但如果没有，他对目前美国的处境也非常高兴。他说，我们还可以再增加2xxx亿美元关税，但是今天不能说，说出来又是爆炸性新闻。他要在适当时候说。看来，川普的关税大棒一直就在念讲稿的习主席头上啊，他还很高兴这么做 ",
			"date_added": 1541509871138
		},
		{
			"body": "11月6日:以“寻衅滋事罪”起诉开庭、审判网友天爱！ 大连看守所检察所电话：0411-88053488、大连市甘井子法院院长及参与审判的共匪、都会暴露在新闻媒体、光天化日中心！执行共产任务、就是参与谋杀、自由世界将会联合起来追诉审判施加迫害的共匪！",
			"date_added": 1541510080056
		},
		{
			"body": "每个出了国中国人千万别忘记自己是“中国文化病毒”的携带者，在文明的世界里慢慢的治愈自己吧，别传给下一代了……",
			"date_added": 1541510131341
		},
		{
			"body": "我们这一代人，天生就是送葬者。我们见证了:前苏联土崩瓦解，东欧列国树倒猢狲散。我们也见证了独裁者卡扎菲，萨德姆们的凄惨末日。历史的洪流不可阻挡，丧钟为谁而鸣？",
			"date_added": 1541512594981
		},
		{
			"body": "中国人非常冷漠麻木，他们不敢争取自己的权益，目前中国财政用于民生支出是世界倒数冠军。你到微博去看看，那些遭受严重不公，被打死打残的帖子，根本无人过问。而那些女明星发一条帖子：爱你们！我有了！居然被网友疯狂的转发上几百万条，简直是变态，这个民族有什么希望？ ​​​ ——美国学者萨尔克",
			"date_added": 1541512650077
		},
		{
			"body": "维藏大集会，联合国日内瓦总部外抗议中共。",
			"date_added": 1541522706181
		},
		{
			"body": "日内瓦，维吾尔人和藏人、蒙古、越南朋友大游行。从联合国人权高专办外游行约一公里，至联合国日内瓦驻地外。联合国理事会正在里面举行对中国人权的第三轮普遍定期审查。",
			"date_added": 1541522747742
		},
		{
			"body": "美国封杀令又搞残了一个中共2025偷盗项目-福建晋华！  福建晋华的生产线已经全部瘫痪。合作商全部与其断绝关系。200亿美元的罚金还未征收，就已濒临倒闭。  注：罚金是中兴的20倍！",
			"date_added": 1541670049014
		},
		{
			"body": "网名梁一鸣11月5日上午9点说国保约谈，继而10点半，微信群里说13点到派出所接受传讯后至今失联！",
			"date_added": 1541670088610
		},
		{
			"body": "中紀委點名：副省級官喝死陪酒人 26軍軍長喝死下屬",
			"date_added": 1541670295090
		},
		{
			"body": "大陸豬瘟疫情失控 滿地吐血病死豬視頻瘋傳",
			"date_added": 1541670338754
		},
		{
			"body": "人日大筆桿子詭異橫死 此女級別高的驚人！消息被封殺！誰步後塵？: 胡欣的孩子在美國耶魯大學讀博士，但目前外界基本無法與其家人取得聯系。連胡欣自殺的現場圖片，也被內部嚴格管制。另據曾在《人民日報》體系內的媒體人周先生說，胡欣這樣的官媒高層記者，其行政級別相當於新華網的負責人，大...",
			"date_added": 1541687999546
		},
		{
			"body": "流亡作家马建赴港谈新书  场地突遭取消   短短一星期内，艺文界两位流亡人士在香港举办的活动面临取消。无独有偶，他们的作品同样无惧针砭时弊，恐惧的到底是谁？  流亡作家、独立中文作家笔会会长马建原订本周六（11月10日）在香港“大馆”出席新书《中国梦》讲座，但活动前夕场地被临时取消。",
			"date_added": 1541688293846
		},
		{
			"body": "泉港石油泄露事闹大了！重灾区包括泉港，半个惠安，湄洲湾北岸的莆仙区域。泉港山腰盐场是福建省最大的食盐生产和出口基地，海产品供应链销往全国，本次事故泄漏的是「剧毒物」。 假如泉港一日没有处理好污染，那么在周边的你们买到的食盐、海产品都有可能是带有剧毒致癌物。 拒绝冷漠，欢迎转发",
			"date_added": 1541690600507
		},
		{
			"body": "【强烈谴责 #习近平 抓捕推特网友！】‬  ‪重庆网友的刘继春，网名@五哥放羊于9月28日被刑事拘留后，11月1日被正在批捕，他仅是在推特上转评转发帖子就被涉寻衅滋事被犯罪了？‬",
			"date_added": 1541698877482
		},
		{
			"body": "塵肺病工人深圳索賠爆衝突 官方被指食言 毆打催淚彈驅散 - 20181108",
			"date_added": 1541699240808
		},
		{
			"body": "明明是失业，还是大规模失业，却偏偏要说成返乡创业，能把坏事说的这么动听的，非赵国莫属。农民工再傻，也知道自己几斤几两吧？他们的老板都干不下去倒闭了，他还返乡创业？乡亲们，捂紧血汗钱，别让狼叼了！",
			"date_added": 1541836244625
		},
		{
			"body": "【中国鬼城：5千万房屋在中国是没有人住的！】 据南华早报消息：中国有数以千万计的公寓和房屋空置，占中国房屋的22%。全世界无任何一个国家有如此的空置率。",
			"date_added": 1541836341543
		},
		{
			"body": "当空置的屋主急于抛售。地产泡沫将像洪水一般一落千丈。那就是中共的中国噩梦吧。",
			"date_added": 1541836373176
		},
		{
			"body": "目前中国1/5住宅空置，超过5000万套。说明什么问题？库存房变成了空置房。习近平的“去库存”运动的结果只是让房地产商解套，将危机转嫁给房奴和银行了，那些过剩的房地产“仍然在那儿”。",
			"date_added": 1541836432676
		},
		{
			"body": "【平时政府和人民对苹果这种外企的仇恨宣传，现在结出大失业的恶果】 9日伯恩光学惠州厂区突然宣布大量裁员，引发大规模劳资纠纷：苹果系订单减少，伯恩光学突然宣布裁员5000人，工人不满赔偿条件，聚集厂区维权，防暴特警已经出动。——抵制日货，撵走乐天，拒买苹果等，被忽悠着以爱国的名义撵走外资，却不知道这都是自己在嘞自己的脖子。中共经常搬石头砸自己的脚，对外就说美帝搬石头砸自己的脚。其实现在工厂只是效益不好，当然不会养着闲人吃饭，不然工厂也得倒闭。一切才是个开始罢了……",
			"date_added": 1541836468096
		},
		{
			"body": "【中国猪瘟疫情失控，台湾全面禁止肉品入境】 中国大陆的非洲猪瘟疫情，不断蔓延，中共官方通报，有15个省市沦陷。但台湾农委会日前评估，中国境内的疫情早已全面失控。台湾行政院为了防堵病毒进入台湾，全面禁止肉品入境，违规者罚金上限最高30万。",
			"date_added": 1541836537397
		},
		{
			"body": "中国正在被一群精神病统治着",
			"date_added": 1541848591859
		},
		{
			"body": "中国古代是以地名为国号的。吴地称为吴国，越地称为越国，巴蜀分别称为巴国，蜀国，等等。并没有一个地方称为中，所以没有中国这个国号。后来以朝代名称为国号。汉朝称为汉国，宋朝称为宋国，清朝称为清国。也没有一个朝代称为中，所以没有中国这个国号。",
			"date_added": 1541954535707
		},
		{
			"body": "今天他将在看守所度过51岁生日。请让我们一起，祝余文生律师生日快乐！也感谢关注与帮助余文生律师的所有人。",
			"date_added": 1542015296400
		},
		{
			"body": "只“活”了6岁的“世界500强”破产：负债1920亿 渤海钢铁集团组建于2010年，是一家大型国有钢铁企业，由天津钢铁集团有限公司、天津冶金集团有限公司、天津天铁冶金集团有限公司等整合组建。公司的组建方式是由天津市国资委出资，上述四家国有钢铁企业分别作为渤海钢铁集团的子公司，资产全部划入渤海钢铁集团，进行注册成立。以国内钢铁产能推算，新组建集团总产能2000多万吨，排名进入行业内十名以内。",
			"date_added": 1542018834860
		},
		{
			"body": "【国库告急，委内瑞拉想拿回14吨黄金，英国竟然拒绝了！】据报道，委内瑞拉正向英国央行要求提取存放在该行的至少14吨金条，以避免被冻结。然而，英国央行拒绝了委方这一要求，理由是“英方认为委当局对这批价值5.5亿美元金条的意图越来越不确定。”委内瑞拉独裁政权不能代表其人民！",
			"date_added": 1542019564360
		},
		{
			"body": "習近平會見他的下屬，香港特首時，竟然不知羞恥，在下屬面前讀稿足足幾分鐘，而且看一眼讀一句，令人非常驚訝！",
			"date_added": 1542020582980
		},
		{
			"body": "【习近平为何缺席一战百周年纪念】 世界政要周日齐聚巴黎纪念一战终结一个世纪。美国总统特朗普、加拿大总理特鲁多、俄罗斯总统普京，德国总理默克尔，联合国秘书长古特雷斯等七十多国的领袖在场，中国国家主席习近平缺席。有些读者询问原因，一战跟中国无关？也许只有中国外交部才能回答这个问题。",
			"date_added": 1542020890932
		},
		{
			"body": "北京两网友表达政见  视频要求结束独裁",
			"date_added": 1542020937933
		},
		{
			"body": "要了命了！中國地產商有3850億內債明年將到期: 有外媒指出，比起中國地產商的外債來說，明年即將到期、約人民幣3850億（約新台幣1.7兆）的國內債務，才是最需要關注的，並指出，中國地產商面對如此龐大債務，如臨大敵，恐會發生資金斷裂的情形。",
			"date_added": 1542021886837
		},
		{
			"body": "維族女子全家遭中共迫害 兒死女兒失明",
			"date_added": 1542103101997
		},
		{
			"body": "在中國，絕望的癌症病人靠走私或自製藥物求生 - 紐約時報中文網",
			"date_added": 1542103126399
		},
		{
			"body": "【德国外长批评中国新疆维族政策】据德新社和德国电视一台报道，德国外长马斯访华首日，不顾中国不得干涉中国内政的警告，批评了中国的新疆维族政策。马斯和中国负责贸易的副总理刘鹤会谈后表示：“我们不能接受教育营。”他要求中国政府就教育营的状况表现出更多的透明度。",
			"date_added": 1542103163458
		},
		{
			"body": "湖北又爆非洲豬瘟 疫情蔓延陸17省區 ",
			"date_added": 1542107600213
		},
		{
			"body": "【美副總統彭斯訪日 抗中態度明顯】到亞洲進行一連串訪問的美國副總統彭斯，昨天晚間抵達日本之後，今天上午在東京，與日本首相安倍晉三會談。彭斯向安倍強調，美日共同的理念，就是「不容許威權主義與侵略」。日本媒體認為，彭斯這番話，暗指中國是「霸權主義」的態度，相當明顯。 ",
			"date_added": 1542108720004
		},
		{
			"body": "【伊拉克经济起飛 台湾外貿協會前進爭取商機】台湾外貿協會今天(13日)指出，外貿協會董事長黃志芳日前前進伊拉克北部庫德族自治區首府艾比爾(Erbil)，並與艾比爾商工會會長Dr. Dara Jalil Khalil Al- Khaya簽署合作備忘錄，雙方對未來加強經貿交流與合作有共識外，也同意在互相認可推薦函的基礎上簡化彼此的簽證申請程序，便利兩國工商界人士的往來。",
			"date_added": 1542108879793
		},
		{
			"body": "史坦尼斯打擊群赴西太平洋",
			"date_added": 1542109088287
		},
		{
			"body": "中国持续加强管控网络。中国国家网信办周一晚透过官网说，自10月20日针对自媒体展开专案整治行动以来，至今已全网查封9800多个自媒体帐号，并对微信、微博等自媒体平台提出严重警告。",
			"date_added": 1542112249782
		},
		{
			"body": "悲惨！ “我有这个病，他要定我的罪，我也没办法，“肾病病患洪如平说。他从印度运来的廉价仿制西药最近被警方查获。 “坐牢对我们来说，跟我们现在生病有什么区别？没有自由。”",
			"date_added": 1542112332262
		},
		{
			"body": "近年种种行政手段显示，香港已经是大陆普通城市，取消美国香港关系法",
			"date_added": 1542246265848
		},
		{
			"body": "美国国会委任的美中经济与安全审查委员会今日提交2018年度报告提出，基于北京严重侵蚀香港特区的自治以及言论自由，国会应要求美国商务部，重新评估美国科技出口政策，和是否应该继续将香港与中国大陆，视为两个独立关税区来处理。",
			"date_added": 1542246462432
		},
		{
			"body": "中国医疗专家因涉嫌参与非法活摘　被拒参加国际会议",
			"date_added": 1542246794831
		},
		{
			"body": "白宫顾问证实美中重启对话:不仅限于贸易",
			"date_added": 1542247016575
		},
		{
			"body": "13日美国副总统副斯出发到新加坡出席东盟会议前，接受美国华顿盛邮报访问时表示，只有在北京应美国要求，在经济、军事与政治上做出重大改变后，川普总统才愿意在川习会上，保留敲定协议的空间，这是北京躲开中美冷战命运的最佳机会，也是最后一次机会。倘若中共不想与美及盟友爆发全面冷战，须从根本上做出改变和让步，美方决不会退缩。",
			"date_added": 1542247067787
		},
		{
			"body": "贺江兵：“10月份，全国一般公共预算收入15727亿元，同比下降3.1%。”贷款暴降，央行逼着银行放贷，银行找民企老板，老板说不玩了。情况就这么个情况。",
			"date_added": 1542247536325
		},
		{
			"body": "现在有了解中国政治和经济状况的小老板，不仅不想贷款投资而且连原有的房贷也提前一并全部还完。只要看中共国的体制你就可以知道，随着GDP和税收不断下降以及政府巨大债务不降反升，拿什么维持庞大的政府开支？",
			"date_added": 1542247605519
		},
		{
			"body": "华盛顿的立法者们正试图迫使特朗普政府对中国官员采取强硬措施，反对其大规模镇压中国维吾尔族和其他穆斯林的做法。",
			"date_added": 1542363128225
		},
		{
			"body": "11月15日在北京国家信访局，人山人海",
			"date_added": 1542363314318
		},
		{
			"body": "由於中共啟動對美反制關稅，大豆的世界貿易版圖發生了變化。觀察統計數據可以發現，美國產大豆對最大供給目的地中國的出口銳減，另一方面，對東南亞、中南美和歐洲的出口正在增加。",
			"date_added": 1542363394540
		},
		{
			"body": "吴官正在权力斗争中受挫，为了保家族平安，吴急调自己的小儿子，时任江西证监局党委书记、局长的吴汉华入京，任中国证监会党委宣传部部长，此后销声匿迹。而突然出现在河北的江波，正是改名后的吴汉华。2008年7月挂职到河北即担任省长助理，主管的是他熟悉的金融工作，2009年又正式出任省长助理",
			"date_added": 1542363563398
		},
		{
			"body": "几年前，卡扎菲政权岌岌可危之际，他号召人民保卫利比亚、不做亡国奴。 卡扎菲死了，利比亚好好的，至今没有亡国！利比亚人民谁也没做亡国奴！",
			"date_added": 1542364847989
		},
		{
			"body": "新时代高校教师职业行为十准则：拥习拥党列首位",
			"date_added": 1542364879749
		},
		{
			"body": "根據天津亞洲器官移植中心公布的器官移植海外牌價「美金計算」，這家醫院的背後控制者，就是北京武警醫院，一個腎臟移植牌價65,000美元、眼角膜30,000美元、心臟150,000美元、肺160,000美元、胰臟170,000美元、肝臟100,000美元、大腸50,000美元，一個活人供體，全身可以賣到80萬美金左右，剛好可以解釋為何2000年到2006年，中國器官移植呈現高峰。",
			"date_added": 1542371928376
		},
		{
			"body": "中國大陸民企虧損嚴重；欠薪大面積發生。失業返鄉人員高達740萬人。",
			"date_added": 1542372114910
		},
		{
			"body": "G20峰會前夕，中共給美國的書面回復老調重彈，美國一位高級官員說，因此不太可能為兩國領導人本月底會晤解決貿易爭端帶來突破。",
			"date_added": 1542372137758
		},
		{
			"body": "APEC美中針鋒相對 彭斯籲勿接受中國貸款而傷主權 ",
			"date_added": 1542435242821
		},
		{
			"body": "袁斌：中国财富的蛋糕 被共产党瓜分殆尽 遭报开始",
			"date_added": 1542435743612
		},
		{
			"body": "古玉文：中共已“左右”为难 横竖是死",
			"date_added": 1542435846535
		},
		{
			"body": "中國最大生豬大省 四川終被非洲豬瘟攻陷: 農業農村部周五（16日）宣布，經中國動物疫病預防控制中心確認，在四川南部的宜賓市高縣出現非洲豬瘟病毒，有關養豬戶存欄生豬40頭，其中16頭發病，10頭死亡。",
			"date_added": 1542455750620
		},
		{
			"body": "突發！美國最大黨媒董事長遭槍殺 老婆郭晶晶是鳳凰衛視女主播: 11月16日(周五)約早上9點半，位於加州阿罕布拉市的華文媒體《僑報》大樓內發生槍擊命案。據海外中文媒體報道，死者是僑報董事長，嫌犯是僑報業務員。時事評論人士橫河曾表示，《僑報》實際是國務院僑辦的。",
			"date_added": 1542457176258
		},
		{
			"body": "美中領導人APEC峰會上角力 彭斯強硬發言 點名批評中共: 緊接着習近平發言的美國副總統彭斯曾直截了當地批評中共在推行一帶一路時設立了債務陷阱。他在星期六的發言中闡述了美國基於平等、透明、共創繁榮為原則、並以創造當地就業機會為特徵的發展援助項目，並再次警惕發展中國家不要... ",
			"date_added": 1542457374557
		},
		{
			"body": "新得到的消息：中共宣传系统开高层会议欲解决网评员队伍（五毛）消极怠工，不满情绪扩大化的问题。 网评员表现在工作上，就是“复制粘贴”毫不掩饰自己就是“五毛\"的身份，不再有任何”技巧性引导“和”深入群众因势利导“的主动作为和积极性。甚至还有工作时候搞宣传，下了班换个身份就骂中共的。",
			"date_added": 1542457901187
		},
		{
			"body": "中共已经向美国提供了中国智慧，中国解决方案，美国没接受。",
			"date_added": 1542458280110
		},
		{
			"body": "11月18日结束的亚太经济合作组织（APEC）将不会有联合声明，只会发布主席声明。这是APEC创立30年以来首次这样的情况。此前15日的部长会议上美中两国已经围绕声明的措辞而僵持不下。 ​",
			"date_added": 1542551128365
		},
		{
			"body": "2008年，石家庄富豪、金宝公司老板王破盘去世，身后留下上亿资产。团市委副书记王亚丽冒充王破盘的干女儿诈夺财产，亲生女多次上访、诉讼，“拜过”法律、政府、律师、黑道，都不管用。最后，法院裁定：王破盘不是金宝公司股东，财产归属两个不知从哪里冒出来的“股东”（后经证实，此二人为王亚丽的“代理人”）。",
			"date_added": 1542551233594
		},
		{
			"body": "不知道新华社如何评价这次习近平率团浩浩荡荡地参加APEC会议？这次会议几乎是习近平买单，从会场、到迎宾大道、到与会领导人专车都是中共援助的。但是这次会议因川普、普京缺席，引发很多舆论质疑APEC这种会议有无必要再继续举行？会议尾声，中共大闹会场，搅合的会议最后声明发不成。完全是一场闹剧。",
			"date_added": 1542648883081
		},
		{
			"body": "中美貿易戰升級 美擬管制AI、機器人等高科技出口",
			"date_added": 1542648938769
		},
		{
			"body": "3850億債務撐不住了！中國開發商正急售短期債券融資",
			"date_added": 1542648980691
		},
		{
			"body": "去之前白日做梦，那些太平洋小国会再把他捧为天朝皇帝，去了后才发现自己真是孤家寡人。一顿猛吹胡聊，没人响应，被美国当面揭穿鬼把戏，光着腚推磨……转圈丢人。",
			"date_added": 1542649039189
		},
		{
			"body": "很多人还不知道，这属于官方要求。马拉松“奔跑中国”分为“红色之旅”和“改革开放”两个系列，都要求比赛组织者在中国领队到达终点前采取规范的旗帜操作（《奔跑中国》终点仪式流程图显示，在马拉松项目冲刺前约200米，准备4号国旗两面，设立专人等候男子和女子的中国籍领跑选手，将国旗递给该选手，请选手身披国旗或双手高举国旗冲过终点线。）",
			"date_added": 1542701637509
		},
		{
			"body": "馮小剛回應被罰20億：太少了 怎麼也得罰100億",
			"date_added": 1542701663424
		},
		{
			"body": "疑似大连，矛盾冲突，释放煤气发生巨大爆炸💥❗️‬",
			"date_added": 1542709770625
		},
		{
			"body": "对应南海双航母，美军大黄蜂号在东海演练。",
			"date_added": 1542716863545
		},
		{
			"body": "太好了！美国商务部发布敏感产品出口限制框架，包括14个领域的产品，其中包括芯片！现在开始征求公众意见。一旦开始实施，中共制造2025的绝大部分关键技术将不得不选择“自力更生”获得。华为，中兴，海康威视以及其它所有监控技术的核心零件，都不再供应。",
			"date_added": 1542719462073
		},
		{
			"body": "美媒報道，因中共外長王毅不滿宣言草案中的兩段話，令宣言流產，而其它所有20個APEC國家都同意這兩段話。",
			"date_added": 1542719632257
		},
		{
			"body": "15国驻华大使要求见新疆党委书记陈全国 中国认为要求无礼 ",
			"date_added": 1542719781030
		},
		{
			"body": "【这次浩浩荡荡的撒钱行动失败了】 2018年的亚太经合组织APEC峰会彭斯当场打脸一带一路。 这位正直，有信仰，忠诚的副总统说的很直接：一带一路就是一条「缩颈带」和一条「不归路」。",
			"date_added": 1542814518776
		},
		{
			"body": "习，灰头土脸，非常尴尬，又非常气愤的离开了Apec. 本来打算撒币40亿美元，由于彭斯当面痛斥习，打碎了他的猪头梦。会议被迫终止。这也是自Apec成立25年以来，历史上的第一次。",
			"date_added": 1542814553403
		},
		{
			"body": "中国依赖的间接税增值税17%是全民承担的，还有各种名目繁多的这费那费。美国依赖的直接税所得税、财产税、遗产税多是富人和有产者承担；美国用富人的钱，而中国用穷人的钱，这是最大的不同，除了腐败，这也是导致中国贫富差距巨大的主要原因。",
			"date_added": 1542815106458
		},
		{
			"body": "基辛格對中共的告誡就是：中美關系不可能回到從前。中國必須脫離舊制度。保爾森對中共的告誡是：必須遵守世界貿易組織的規則，也就是必須履行入世承諾。中共是否能做到這些？我們還拭目以待，但是多數（人）看來，中共做不到",
			"date_added": 1542943487209
		},
		{
			"body": "川普再曝驚人之語：我一生都在為此做準備",
			"date_added": 1542943748170
		},
		{
			"body": "【針對中國？】駐巴基斯坦總領館附近傳槍響爆炸 目擊者：有人試圖闖入",
			"date_added": 1542951765065
		},
		{
			"body": "習中央頻頻出擊 新冷戰格局形成 中共正安排後事: 川習會前，劉鶴與習近平動作頻繁，被外界認為是努力拉攏“盟友”對抗美國。美國高層則以“新冷戰”形容美中關系，暗示中共正處於類似前蘇聯崩潰時的狀態。冷戰造成前蘇聯經濟政治崩潰，中國經濟在貿易戰沖擊下也顯露出... ",
			"date_added": 1542951783789
		},
		{
			"body": "中國爆發非洲豬瘟，疫情越來越惡化，一向管控嚴格的首都北京市，也爆出疫情，已死86頭染病豬隻。",
			"date_added": 1542951817997
		},
		{
			"body": "路透社：中國駐巴基斯坦領事館遇襲 兩警殉職 保安受傷",
			"date_added": 1542957783321
		},
		{
			"body": "【你说我寻衅滋事，我用刀给你审判】2018年11月22日中午，重庆市南川区法院刑事审判员53岁的田晓被曾川在法院门口将其两腿部各刺伤1刀，其中一条大腿被贯穿。南川监狱警察刘彦等3人在追赶时，被捅伤腹部胸部。曾川后被捕，其先前曾两次入狱，其中因寻衅滋事罪，被田晓审判长判刑，11月11日刚刑满释放。",
			"date_added": 1542958340672
		},
		{
			"body": "非洲豬瘟攻陷北京 中國20省市淪陷: 中國大陸非洲豬瘟疫情持續擴大。中國農業農村部上午發布，北京市首度發現非洲豬瘟疫情。北京今天宣告失守後，大陸已有20個省市自治區淪陷。",
			"date_added": 1542958628211
		},
		{
			"body": "40多年来中国经济龙头老大广东江苏经济暴跌！一些科技类代工厂都在这两个省，只要厂家搬去国外很多人会失业。党都决定让老百姓吃草了，吃草那只是时间的问题。 ",
			"date_added": 1543202572435
		},
		{
			"body": "【百姓们终于知道反抗了】 2018年11月23日，因反抗强拆，武汉市黄陂区泡桐街上万人民群众和防暴警察发生冲突，围观者塞满街道。最终公安夹着尾巴逃跑了。",
			"date_added": 1543202687474
		},
		{
			"body": "【抵抗中共侵略性扩张弥漫到全球】 欧盟28国集团紧跟川普的步伐，对中共开始全面围剿： 1.为中共量身制造更严重格局的经济系统；2.严格审查中共收购/合并西方的高科技公司；3.打击中共偷盗知识产权行为。欧盟宣布：天真的时代已经结束了！美联邦局长说：谈到偷盗和间谍活动，中共无人匹敌！",
			"date_added": 1543202719018
		},
		{
			"body": "北京推友全世欣@Sarah_chinaBJ 于2018年11月24日上午10时许，因准备抗议北京市将在海淀宝山建垃圾处理厂被警方带走。目前已经失联31多个小时。 据全世欣于24日上午告诉我，拟建宝山的垃圾处理厂周边居民定于当天到环境保护部散步，部分人员被控制。全世欣被辖区派出所警察截到某地，那里有20多辆警车。",
			"date_added": 1543204665440
		},
		{
			"body": "烏克蘭海軍先在臉書發表聲明，指控俄羅斯開火擊中其中一艘砲艇。俄羅斯並未立即回應指控，但隨後證實已扣押烏克蘭海軍2艘砲艇和1艘拖船。  俄羅斯表示，這是因為船隻非法進入俄國水域。",
			"date_added": 1543217041005
		},
		{
			"body": "發改委啟動的鑫圓共享 今被以傳銷起訴 傳千億資金去向不明(組圖): 近日，由中共發改委投資研究所編制的“國家共享經濟交易示範中心”方案，其建設單位鑫圓共享集團被以“傳銷罪”起訴，令廣大投資人十分憤怒，他們甚至想通過極端手段報復政府相關部門。",
			"date_added": 1543217165118
		},
		{
			"body": "涉一帶一路項目賄賂 三中國人遭肯尼亞起訴(圖): 肯尼亞最大報紙之一“每日國家報”星期天報道，肯尼亞當局逮捕了中國路橋集團的7名員工，其中3名是中國公民，罪名是向調查標准軌鐵路腐敗案的人員行賄。 ",
			"date_added": 1543227260794
		},
		{
			"body": "美國開審一帶一路賄賂大案 海外專家學者曝5大風險 中國經濟引鴆止渴最倒霉: 圖說：紐約法庭將在周一26日開審香港前民政事務局局長何志平的跨國賄賂案。 紐約法庭將在周一26日開審香港前民政事務局局長何志平的跨國賄賂案。",
			"date_added": 1543227305106
		},
		{
			"body": "新疆再教育營可能遭美制裁 崔天凱嗆：中國一定報復",
			"date_added": 1543463271211
		},
		{
			"body": "白宫还未宣布是否因新疆人权问题制裁中共高官。 匪共崔大使先来威胁川普扬言如果实施制裁，中共将会不惜代价进行报复。",
			"date_added": 1543463450915
		},
		{
			"body": "今天中共驻美大使崔公公发出威胁：如果G20中美无法达成协议，后果很严重。崔公公警告美国强硬派不要阻扰，并称如果达不成协议中共将全面应战。美国舆论并不看好这次川习会，普遍认为最多形成一种战术性贸易战暂停。",
			"date_added": 1543463482999
		},
		{
			"body": "基因编辑婴儿实验同意书曝光 父母28万人民币就把孩子卖了",
			"date_added": 1543463509068
		},
		{
			"body": "不管是习近平、薄熙来，还是刘源这些红二代，本质是一样的，那就是特别羡慕毛泽东一言九鼎，言出法随的权威，特别欣赏毛谈古论今，随心所欲的气势，特别信奉毛帝王心术的权谋。在这个意义上，没有价值底线，没有是非黑白。可以说，红二代都是野心家，都向往定于一尊。",
			"date_added": 1543463698925
		},
		{
			"body": "【英专家：中国政府正强奸维吾尔民族】 自由亚洲电台消息：随着新疆“再教育营”的细节和幸存者的证言浮出水面，国际媒体对中国政府打压当地穆斯林的报道出现井喷，而研究新疆问题的学界也正在集结起来为维吾尔人发声。英国一位专门研究维吾尔文化的专家说，中国政府正在对维吾尔人进行象征性强奸。",
			"date_added": 1543463746230
		},
		{
			"body": "中国国家主席习近平星期二开始对西班牙进行国事访问，这是中国国家元首过去13年来第一次访问这个欧洲国家。在习近平抵达西班牙首都马德里之前， 西班牙首相办公室不愿透露姓名的高官表示，“我们不会签署该倡议”，“欧洲同亚洲有一个‘欧亚连通倡议’，我们认为欧洲应该在这个框架中合作”。",
			"date_added": 1543463847291
		},
		{
			"body": "广西凭祥市友谊关警民发生激烈对打",
			"date_added": 1543735402438
		},
		{
			"body": "【中国每年“圈养”亚非记者10个月要他们报喜不报忧】根据印度传媒The Print报道，为了配合中国主席习近平的一带一路宣传，北京正炮制一个试验，以南亚、东南亚和非洲的传媒为对象，以一个奖学金课程的名义，免费招待他们的记者到中国，包括住在北京建国门外外交人员的豪华住所、获取中国大学所颁发的毕业证书，以及游览其他省份，但他们必须要报道北京当局指定的正面信息。报道指，一些经济条件较差的上述地区传媒，往往都乐意配合中国这个试验。",
			"date_added": 1543736320500
		},
		{
			"body": "晚宴持续两个多小时，白宫顾问库德洛称“还不错”，这是否意味着双方达成了某种协议？中国做出了多大让步？中方官媒称一月份起暂不加税，美方稍后证实推迟三个月加税。  ",
			"date_added": 1543736385577
		},
		{
			"body": "卡尔梅克总统奥尔洛夫访问达兰萨拉拜见达赖喇嘛 ",
			"date_added": 1543736511595
		},
		{
			"body": "中共報道川習會啥意思？新華社與白宮聲明差之千里: 美國總統川普和中共總書記習近平會面結束後，中共中央級喉舌報道僅草草幾句了事，沒有披露中共對美國做出的五大承諾。美國媒體人，阿波羅評論員王篤然表示，這說明中共根本無誠意，甚至不打算兌現承諾。",
			"date_added": 1543737717288
		},
		{
			"body": "国际生物遗传领域开始拒收中国留学生",
			"date_added": 1543738425877
		},
		{
			"body": "撑不下去了！中国猪瘟扩散 大量买进美国猪肉",
			"date_added": 1543738454845
		},
		{
			"body": "美政府3大行動警告中共 驚爆中國製造停滯還萎縮",
			"date_added": 1543738622319
		},
		{
			"body": "白宫的声明还说，美中双方同意立即就结构性改变问题展开为期90天的谈判，这些问题包括强制技术转让、知识产权保护、非关税壁垒、网络入侵和网络盗窃。",
			"date_added": 1543738654057
		},
		{
			"body": "为军方走私碳纤维 华男被美递解回中国",
			"date_added": 1543739891400
		},
		{
			"body": "习近平豪掷两百万欧元 包酒店 拓宽大门",
			"date_added": 1544070367280
		},
		{
			"body": "【突发消息】任正非长女在加被捕 美国要引渡 华为在劫难逃",
			"date_added": 1544070477248
		},
		{
			"body": "【全球轰动】任正非之女孟晚舟被抓遭美国引渡更多细节曝光 川普手段惊人 习近平脸都绿了 任正非将成为下一个王健？",
			"date_added": 1544078264927
		},
		{
			"body": "【震惊全球】华为任正非之女孟晚舟加国被捕 白宫引渡细节曝光 华为家族神秘身世惊人 习近平肝胆欲碎 被捕时机微妙与川习会同时上演",
			"date_added": 1544078339000
		},
		{
			"body": "任正非玩弄女下屬被掃地出門 孟晚舟被曝出有21處房產 中興晉華到華為 川普打點穴戰: 調研機構歐亞集團報告說：「美國政府的逮捕和引渡要求代表了一系列新的作法和重大的升級，要讓違反美國法律行為的中國公司為此負責，有些甚至可追溯到好幾年前。」",
			"date_added": 1544104600233
		},
		{
			"body": "傻逼好像好久没有提敢于亮剑",
			"date_added": 1544105037950
		},
		{
			"body": "2018年12月5日，上海75岁维权人士吴士豪因房屋拆迁不公，到京维权上访，后被：“寻衅滋事”一案，在上海虹口法院9：30分开庭。有的维权人士都率先遵守法律，想学习好法律，更好维权。有的早晨8点不到就在寒风凛冽的虹口法院门口等侯排队；不料虹口法院刑庭法官却利用职权侵占了旁听席位，不让任何一位吴士豪的战友与朋友们参加旁听，不让公民们学法。 让大家感动暖心的是：从早晨8点开始至中午12点多几个小时里有着几十位维权人士在严寒呼啸的湿冷大风中，在坚守等侯关注着75岁维权老人吴士豪在虹口法院里审理的结果，关注着他的命运！",
			"date_added": 1544238536504
		},
		{
			"body": "央視名嘴6人患癌死 羅京最慘疑染艾滋",
			"date_added": 1544238567907
		},
		{
			"body": "张首晟完全可以像杨振宁那样回国，却一边拿着美国的每年几十万美元的终身教授工资，又把大量时间用于国内，而且涉嫌盗窃美国知识产权。",
			"date_added": 1544239210556
		},
		{
			"body": "舆论过分夸大中共对孟晚舟被逮捕的重视程度。美国官方决定川习会当日抓捕孟晚舟，一定研究过对贸易谈判有何影响。习近平十分卖力地“45分钟读清单”是为了保党保自己统治地位，不要说任正非的女儿被捕，即使任正非被捕，习近平也知道谁重谁轻。中美贸易谈判有可能谈崩，但绝不会因孟晚舟、华为。",
			"date_added": 1544239360530
		},
		{
			"body": "厉害国皇上亲自谈协议，居然没一个大臣愿意当他的背锅侠",
			"date_added": 1544239404957
		},
		{
			"body": "白宫贸易与经济顾问彼得•纳瓦罗谈及在阿根廷举行的川习会上表示，“晚宴上一个不同寻常的事件，我认为这在历史上从未发生过，就是中国国家主席他自己花了45分钟向美国总统提出协议。” ",
			"date_added": 1544239464576
		},
		{
			"body": "【孟晚舟不是中国人，兲朝粉红们不要跟着中共瞎激动】 孟晚舟拥有加拿大枫叶卡和美国护照，等于说是美加双国籍，不是中国国际，她自然要遵守相关国家法律责任。",
			"date_added": 1544239691196
		},
		{
			"body": "有消息传出，在G20“川习会”晚宴最后关头，中共已知道了孟晚舟被抓走的事，但却因为习急欲与美方达成休兵，因此宴上才决定隐忍不提，以防触怒川普节外生枝。而消息传出后24小时内，中国各级政府纷纷出声谴责美加“违反国际法，侵犯孟女士人权”，这其实是做给国内看的。看来这回孟晚舟不得不为党牺牲了！",
			"date_added": 1544239725940
		},
		{
			"body": "抓孟晚舟，美国打中中共死穴。中共的死穴是500家。 当今中共已备自力更生，死掉几亿中国人。对此中共不会皱一下眉头。 但是，如果死掉500家，没收500家在西方的资产，中共必然下跪。",
			"date_added": 1544326048901
		},
		{
			"body": "【中国召见加拿大驻华大使：立即放人否则必造成严重后果】自北京方面消息，中国外交部副部长乐玉成12月8日紧急召见加拿大驻华大使麦家廉（John McCallum），并就加方逮捕和扣押华为公司副董事长兼首席财务官孟晚舟事件，向加方“提出严正交涉和强烈抗议”。",
			"date_added": 1544326198389
		},
		{
			"body": "孟晚舟事件突然爆发，一时间转移了对北京出现的另外一个重大迹象的关注：中共党内对习近平的不满因中美商贸战激化而越来越表面化。北戴河那场风波只是在暗处运作，中共党内的反对声音也是背后的暗波。但最近发生了一个明显的变化，以“忠告”“劝勉”的形式对习近平公开发出警告。这种声音或通过体制内人士，或通过知识分子，甚至亲北京的大外宣体现出来。",
			"date_added": 1544326385480
		},
		{
			"body": "美中经贸关系前景不明，美国会议员对#贸易战停火协议持谨慎态度。鲁比奥参议员表示没有看到任何进展，中国在拖延时间，“我们应该以对等的方式对待彼此”参议院外委会亚太小组委员会主席加德纳说：“在贸易问题上，中国在纠正其行为方面还有很长的路要走。”",
			"date_added": 1544327973272
		},
		{
			"body": "孟晚舟自己辩护求保释，称是为了祖国与伊朗交易违禁品。",
			"date_added": 1544336137068
		},
		{
			"body": "德国总统在中国公开说 马克思主义带来浩劫",
			"date_added": 1544356550767
		},
		{
			"body": "世界首个“中共活摘器官”听证会伦敦开庭",
			"date_added": 1544356633752
		},
		{
			"body": "1）孟晚舟公开信息就有三类护照：香港护照、中国普通公民护照、中国公务护照。你有几类？2）目前已证实孟晚舟有两本香港护照都在有效期。你有几本同时有效？一人拥有多本同时有效护照在中国只有赵家人，这是赵家人特权。",
			"date_added": 1544364915273
		},
		{
			"body": "【中共承认违法活动】纳瓦罗在采访中被问到孟晚舟被捕与美中贸易谈判关系时称美面临最严重问题是中共利用合法和非法手段获得美尖端科技，华为和中兴等公司均有参与，在硅谷等地由党国主导投资也是危险。他透露川普在晚餐上对习讲了45分钟，习同意了所有要求，暗示承认了中共从事非法窃取美技术的活动。",
			"date_added": 1544364935956
		},
		{
			"body": "乐玉成指责加政府扣留孟晚舟是“于法不顾，于理不合，于情不容，性质极其恶劣”。他还说“中方强烈敦促加方立即释放被拘押人员，否则必将造成严重后果，加方要为此承担全部责任”。",
			"date_added": 1544365039082
		},
		{
			"body": "美官员罕见访港要求加强执行对北韩及伊朗制裁",
			"date_added": 1544534444899
		},
		{
			"body": "訪民寒冬夜宿信訪局前 民怒：中共能撐多久(圖/視頻): 近日，一段“訪民露宿中紀委信訪局”的視頻在網路上熱傳。2018年12月6日，在北京入冬來最寒冷的一天（最低氣溫零下10℃），不少訪民深夜露宿在信訪局門口。 ",
			"date_added": 1544534617175
		},
		{
			"body": "加拿大不列颠哥伦比亚省最高法院将于周一晚些时候决定，是否同意由被押中国华为公司副董事长兼首席财务官孟晚舟提出的保释申请。在孟晚舟被加拿大当局在美国要求下逮捕后，中国外交部曾警告要加方立即放人。最新消息显示，不列颠哥伦比亚省政府在近日决定，取消一个原定将前往中国访问的贸易代表团。",
			"date_added": 1544534784358
		},
		{
			"body": " 「國際危機組織」（The International Crisis Group）周二向路透社表示，他們的東北亞高級顧問、前加拿大外交官康明凱（Michael Kovrig），近日被中國當局拘留。  聲明指，目前該組織正在尋求更多康明凱狀況的相關資訊，同時亦希望他能盡快並安全獲釋。報道未透露康明凱被拘留的地點及原因。  公開資料顯示，康明凱曾在香港、中國擔任加拿大外交官，亦在紐約聯合國總部擔任戰略通訊專家。他能講普通話，多數從事中國外交、國防等方面的研究。",
			"date_added": 1544543745796
		},
		{
			"body": "查了一下张首晟的资料，发现舆论太低估了他的“红色”度数。他从2013年就开始在英国、美国研究中推销习近平的中国梦。他在介绍丹华公司的宗旨时称“就是为了响应党中央提出的‘双创’”。这些专业党棍术语绝大多数海外华人根本说不上来。",
			"date_added": 1544543803523
		},
		{
			"body": "美国知名运动摄影机厂商GoPro表示，为避免关税冲击，计划将大部分销往美国的产品生产线移出中国。此举恐促使价格上涨。总部位于加州硅谷的GoPro表示，一些在中国制造但销往其他国家的产品，则继续留在中国生产。",
			"date_added": 1544550608283
		},
		{
			"body": "美官员罕见访港要求加强执行对北韩及伊朗制裁",
			"date_added": 1544551674597
		},
		{
			"body": "三星手机将从天津迁往印度",
			"date_added": 1544668680692
		},
		{
			"body": "很多美国企业家纷纷离开中国，这个梦起梦落的地方。日益严峻的成本、税负、技术转移和监管环境令他们不得不拱手认输。他们中的很多人掌握了普通话，在中国雇佣和培训了大量员工，买房置业，还遇到了他们的人生伴侣，生养了会讲双语的孩子。但是现在他们不再抱有幻想。",
			"date_added": 1544681880544
		},
		{
			"body": "孟晚舟应该感谢的是加拿大独立的司法制度。如果换作在她引以为傲的祖国，遭到逮捕，估计和很多这些年被抓，被失踪的企业家一样，连律师可能都见不着，更不要说保释了。",
			"date_added": 1544681907692
		},
		{
			"body": "不能太高看华人科学家的操守和判断力(20181213) 抑郁了两天想明白一个道理，真是不能太高看华人科学家的操守和判断力，ccp刚刚建国时的海外华人科学家，各领域的专家纷纷放弃优渥的条件回国参加社会主义建设，得到的是什么？灭顶之灾！发配夹边沟、住牛棚、自杀、折磨死！就是忠于党的吴晗、邓拓、潘汉年之流落到什么样的下场？千人计划的前车之鉴！",
			"date_added": 1544681973560
		},
		{
			"body": "多家美国媒体引述不具名美政府官员的话称，美国政府多个部门计划本周采取多项行动，“旨在谴责中国窃取美国高科技公司的知识产权机密”。其中最重要的举措是美国司法部将起诉“为中国情报部门工作并参加针对美国网络长期间谍行动”的“中国黑客”，并对中国有关个人实施制裁。 ​",
			"date_added": 1544682004794
		},
		{
			"body": "近日，繼前外交官康明凱（Michael Kovrig）拘留後，又傳出一名從事北韓旅遊業的加拿大公民發出求救訊息後就失聯。 ",
			"date_added": 1544682452771
		},
		{
			"body": "美国国会议员提出法案，制裁所有中共违约者。所有违背美国制裁法的中共公司将被禁止购买美国产品。‬",
			"date_added": 1544682537077
		},
		{
			"body": "習近平讓步晚了！研究報告中國經濟難修復 川普透露北京新動態 蘋果也要撤？: 日前，花旗經濟學家發表研究報告認為，中國經濟已經在貿易戰中嚴重受損，即使中美達成協議，也很難在短期內恢復；而一旦不能達成協議，美國對中國關稅將提高到25%，這將使蘋果供應商將生產線遷出中國。",
			"date_added": 1544682576589
		},
		{
			"body": "加拿大永久關閉中國人最喜歡的移民項目(圖): 華為公主孟晚舟在加拿大被捕之際，華人互聯網流傳一個加拿大當局最近關閉中國人最喜歡的移民項目的消息：加拿大愛德華王子島省（P.E.I）政府宣布關閉PEI PNP企業家移民計劃，據稱與中國人大量造假欺詐有關",
			"date_added": 1544682693987
		},
		{
			"body": "习近平老友布兰斯塔德猛批中共人权 北京泛滥“亮剑”遭轰 美国会两议员提案向华为中兴下禁售令",
			"date_added": 1544761803826
		},
		{
			"body": "这是真反！改开四十年 茅于轼公开声明退党 猛批习近平是个大糊涂 到现在都没有自己的治国理念只能照搬毛泽东",
			"date_added": 1544761851475
		},
		{
			"body": "华为不仅盗窃而且严重收买和渗透美国智库影响美国决策 白宫将重拳打击",
			"date_added": 1544761943140
		},
		{
			"body": "中共的“中国特色社会主义”，从国际上看就是：“低人权”、“高污染”、“社会财富迅速向权贵集中”和“继续专制体制”。",
			"date_added": 1544772939956
		},
		{
			"body": "劉仲敬： 你們並不需要有槍，到鋼管廠買一批鋼管，打出自己喜歡的大義名分，用不著接受窩老人家發明的，或任何其他人發明的，就用自己覺得順的最好，對準正在做案的中國恐怖份子腦袋砸下去。巴蜀利亞一億人口，如果按照東突厥斯坦標準辦集中營，貴匪是支持不了三年的。這樣肯定要死幾千萬人，但這已經是歷史積分。",
			"date_added": 1544773134211
		},
		{
			"body": "张首晟的死发生在美国贸易代表办公室于11月30日发表报告之后第二天",
			"date_added": 1544774278394
		},
		{
			"body": "茅於軾：退黨！不留黨內！",
			"date_added": 1544774663937
		},
		{
			"body": "成都秋雨教会遭大清洗 王怡牧师被控“煽颠罪”",
			"date_added": 1544774744409
		},
		{
			"body": "兩年前在日本版Newsweek上向日本讀者介紹中國特有的“醫鬧”現象，年年都有醫生護士被打傷甚至被殺死，有些醫院一度誇張到醫生戴著頭盔和防刺背心上班，沒想到兩年後的今天，日本的醫生也被中國來的病患刺傷了。",
			"date_added": 1544774965266
		},
		{
			"body": "中共政治局強調“穩”字為重 透露什麼信號？(圖): 日前，中共政治局會議把“六穩”作為明年經濟目標的重點。中共“穩”字優先的背後是經濟的各種問題。花旗經濟學家認為，貿易戰重創了中國經濟，外貿出口或損失一半，超過四百萬的就業人口受到威脅，產業鏈也正在移出中國。",
			"date_added": 1544775024394
		},
		{
			"body": "中國外交部長「王毅」的老婆，在加拿大🇨🇦有兩處豪宅，今年被加拿大拒絕簽發簽證。  往後不曉得有多少中國紅二三代被拒絕到五眼聯盟裡。沒收其資產 拒發簽證，資金凍結。",
			"date_added": 1544888077057
		},
		{
			"body": "深圳很多片区的工厂大门禁闭锈迹斑斑，，一片萧条！成片成片的无人区！以往熙熙攘攘的热闹一去不复返！",
			"date_added": 1544888246576
		},
		{
			"body": "因病痛无钱医治，昨晚怀化市洪江市托口镇一老太婆投河自尽。",
			"date_added": 1544889500089
		},
		{
			"body": "美國對中共自衛反擊戰來了！華為被曝全面滲透 美要中共放人！: 多家的美媒報道，川普政府最快在本周內，啟動對中共更猛烈的重擊，主要涉及到中國黑客行為、持續竊取美國商業秘密和高級技術、入侵政府部門或公司電腦等方面。",
			"date_added": 1544889581889
		},
		{
			"body": "国际人权日当天，西藏东北部阿坝县格尔登寺年轻僧人桑吉嘉措独自走上街头，抗议中共统治，而后遭到拘捕，消息于数天后才传出境外。",
			"date_added": 1545062832211
		},
		{
			"body": "【西藏之声2018年12月14日报道】近期，中共在“西藏自治区”内大力开展所谓马克思主义“五观”“两论”的教育，并连续发文诋毁达赖喇嘛尊者。藏人行政中央驻澳洲办事处华人事务联络官格桑坚参指出：北京方面对待达赖喇嘛尊者及藏人行政中央的强硬做法，对解决西藏问题起不到任何作用，恐让藏人对中国新领导寄予的希望破灭。",
			"date_added": 1545062860882
		},
		{
			"body": "美国国会参议院于日前正式通过了旨在对抗中共封锁西藏政策的“入藏互惠法案”，至此，该法案已经获得参众两院的一致通过。流亡藏人官方与民间纷纷对此法案表达欢迎，而中共当局则回应称这是“对中国内政的粗暴干涉”，并指“中国政府和人民绝不能接受”。",
			"date_added": 1545062902037
		},
		{
			"body": "習近平警告，中國未來可能遇到“難以想像的驚濤駭浪”",
			"date_added": 1545197715950
		},
		{
			"body": "美方要北京结构性改革 中方称不能改的坚决不改",
			"date_added": 1545197917367
		},
		{
			"body": "美专家：华人必须向美国社会传播中共真相 如犹太人曝光纳粹",
			"date_added": 1545205545637
		},
		{
			"body": "世界银行的报告称，中国大陆0.4％ 的人口掌握了70％的财富，而在发达国家，大多为5%的家庭占有50%至60%的财富。这表明，中国富人掌握的财富比发达国家富人掌握的财富多出了15倍，中国已经成为全球财富集中度最高的国家。由于在中国大陆财产的透明程度非常之低，将灰色收入计算在内，这个数字要乘以7。",
			"date_added": 1545208096603
		},
		{
			"body": "加拿大官方证实，第3位公民在中国被拘留",
			"date_added": 1545210253576
		},
		{
			"body": "曾高调现身巴黎名媛舞会，姚安娜今传低调探视姐姐孟晚舟",
			"date_added": 1545210349730
		},
		{
			"body": "美中贸易1月谈判有谱；加拿大提人权杠中国，墨西哥拿北京跟川普谈判；捷克也加入围剿华为",
			"date_added": 1545210442532
		},
		{
			"body": "习近平坚决不改，中国改革开放到此终结；习近平讲话透露，国内压力比美中关系更棘手；多国禁用华为5G，董事长罕见主动受访澄清",
			"date_added": 1545210505086
		},
		{
			"body": "“陕西反杀案”二审开庭，被告人反问法官：我怎么做才是对的？",
			"date_added": 1545370988706
		},
		{
			"body": "汇丰、渣打相继切断与华为的业务关系",
			"date_added": 1545371015011
		},
		{
			"body": "其实中国最大的产业是畜牧业(20181221) 有人说中国最大的产业是房地产业，还有人说最大的产业是饮食业，其实中国最大的产业是畜牧业，八千多万只狼放牧十三亿只羊，狼群对羊群肆意宰割，许多羊居然还相信“离开了狼群牠们什么都不是”这样的弥天大谎。",
			"date_added": 1545371084185
		},
		{
			"body": "美国司法部指控两名中国黑客“受国安部指示盗取商业机密”",
			"date_added": 1545371208934
		},
		{
			"body": "內地拆裝飾禁慶祝聖誕 抗拒西方文化入侵",
			"date_added": 1545371413337
		},
		{
			"body": "真涼了！深圳樓市傳來大消息 六折土地罕見流拍！(圖): 寸土寸金的深圳，土地打六折，居然流拍了！ 12月19日，連續5次刷新深圳樓面價的寶安尖崗山商住用地流拍了！前海桂灣商業用地也流拍了！",
			"date_added": 1545371854662
		},
		{
			"body": "【港上市國企】中遠海能董事總經理賈利賓 台五星酒店墮樓亡",
			"date_added": 1545371889604
		},
		{
			"body": "‪FBI全球通缉两名中国黑客！‬ ‪此二人在过去的12年中，为中共偷盗高科技情报！‬  ‪此2人，现在不在美国。如哪位网友能挖到此二人的信息。可直接联系FBI，告诉我也行。‬ ‪我们把他们送到他们该去的地方。‬  ‪注：FBI全球通缉都是有💲奖励的。‬",
			"date_added": 1545383731920
		},
		{
			"body": "美国防长马蒂斯辞职了，半年前北京的一群美女投资，小白脸蔡国庆的殷勤献唱，都浪费了。天朝又一次投资失误。",
			"date_added": 1545384016721
		},
		{
			"body": "60華專家印度手機廠做指導 突遭要求即離境",
			"date_added": 1545384294970
		},
		{
			"body": "美国已做好对共匪政权开战的准备！ 1、福克斯公开建议美国政府对中共开战！ 2、川普宣布从叙利亚撤军，以集中兵力对付中共！ 3、对中共邪恶缺乏足够认识，访问中共国时表现糟糕且不专业的国防部长马蒂斯辞职！ 4、司法部起诉中共黑客和间谍！ 5、证监会审查在美上市中共国企业！ 共匪还面临国内革命！",
			"date_added": 1545477515115
		},
		{
			"body": "不尋常？中企老總來台墜樓 習近平任內逾260高層橫死",
			"date_added": 1545477540610
		},
		{
			"body": "德國給新疆維族難民「遣返禁止令」，以防「送出去就救不回來」",
			"date_added": 1545477601676
		},
		{
			"body": "香港今天有人还以为已经回到文化大革命的“造反有理”暴力年代。发动雨伞运动的学生领袖之一的罗冠聪，去年自台湾出席政党时代力量座谈会返回香港时，在机场遭到多名爱党爱国人士围殴，其中4名高龄“愤老”早前被判普通袭击及非法集结罪成，判牢3个月，但4人不服提出上诉，法官21日驳回上诉，4人并需即时服刑。法庭多个支持被告的旁听人士闻判后喧哗抗议，其中72岁的被告唐发祥更激动抓着犯人栏大叫“中国共产党万岁！香港政府是港独帮凶！”唐某的爱党爱国的烫热头脑，无不令人“动容”。",
			"date_added": 1545477990434
		},
		{
			"body": "罕见行动多国联合谴责 #中共商业骇客 活动  美国司法部周四起诉了2名中共政府雇佣的骇客，同时联合欧美亚多个盟国，共同谴责中共网络窃密行为。",
			"date_added": 1545484857286
		},
		{
			"body": "中美貿易戰停火突變 白宮高層放話！中共毀約？(組圖): 中美貿易戰停火已過20多天，白宮貿易顧問納瓦羅表示，除非北京准備全面改革其經貿產業政策，否則雙方“難以在明年3月1日前達成協議”。他還說，“中共基本上是在追逐我們的技術，盜竊日本、美國和歐洲的未來”。",
			"date_added": 1545484928183
		},
		{
			"body": "捷克總理巴比什於當地時間周二（18日）下令，其政府辦公室禁止使用中國華為手機。",
			"date_added": 1545486194842
		},
		{
			"body": "美国司法部今日宣布，又逮捕了一名偷盗美国高科技技术的中共商业间谍。 下周三将开庭审判！  这让红匪胆颤心惊的消息一个接着一个。",
			"date_added": 1545486373183
		},
		{
			"body": "【猪瘟疫情失控】 农业农村部官网公告，广东省广州市黄埔区一养殖场排查出非洲猪瘟疫情。该养殖场存栏生猪 6027 头、发病 30 头、死亡 9 头。",
			"date_added": 1545651179911
		},
		{
			"body": "非洲猪瘟蔓延至广东 珠海之后广州沦陷 ",
			"date_added": 1545661972287
		},
		{
			"body": "中国公民多次入境美国十年签证被取消，美国针对中国人的拒签率飙升。特朗普政府收紧对中国人的签证发放，特别针对中国留学生和科研人员的赴美签证。",
			"date_added": 1545662028289
		},
		{
			"body": "#广州十三行事件 一千多潮汕人围派出所",
			"date_added": 1545662168914
		},
		{
			"body": "死亡集中营—新丰练溪托养中心，2017年3月送去一月多的16岁自闭少年雷文锋死亡，解开了黑幕。  据殡仪馆记录，此前49天内已死亡20人。而过去6年，广东同一家救助站送去的200多人，至事发只接回100余人，另100多人已死亡。  这么严重的虐待群死事件，无一人被判死刑。生命在中共国中，严重不对等。",
			"date_added": 1545662275476
		},
		{
			"body": "孩子一個學期結束了，沒有收一毛學費，管早餐中餐校車接送，今天放假學校還送了一堆小禮物。沒有對比就沒有傷害，同樣是幼兒園，國內的時候是一個學期要四千多，每天要自己接送，還要提心吊膽擔心在學校吃的和... ",
			"date_added": 1545662807049
		},
		{
			"body": "中共嚴控高校又一市委書記空降高校任職(圖): 日前，中共山東聊城市委書記出任濟南大學黨委書記。今年以來，已有數十名中共政工官員“空降”高校，接任高校黨委書記。美媒說，中共已把政治之爪伸向高校，嚴控高校言論自由，令老師和學生都噤若寒蟬。",
			"date_added": 1545795068806
		},
		{
			"body": "【中共司法早已无耻到不需要遮羞布的地步了】 丈夫案件开庭审理，妻子被控制不让旁听。王全璋即将在26日被庭审，但是国宝们控制王全璋的妻子不让她旁听。谢燕益律师出门到天津支持王全璋，被国宝拦截在车站。其他的王全璋的亲友们也都被中共国宝们拦截了。709家属原珊珊坚持带孩子去探访李文足也遭到国宝警察拦阻威胁！",
			"date_added": 1545795277217
		},
		{
			"body": "【中共为何抵制圣诞 因为恐惧信仰】 圣诞节前夕，大陆多个地区出现“抵制圣诞”活动。从学校到社会，中共都在传播着宣传抵制过圣诞节的洗脑宣传片。另外在首都北京也要求所有酒店单位不得搭建圣诞树，已搭建的尽快拆除。",
			"date_added": 1545795316346
		},
		{
			"body": "陈丹青：我们看什么电影你要管，看什么电视你要管，看什么书你要管，上什么网你要管，说什么话你要管，现在庆个圣诞你也要管，但是我们吃什么住哪里你不管，生不起病上不起学养不起老你不管。总之该管的你不管，不该管的你全管！",
			"date_added": 1545795335620
		},
		{
			"body": "【镇压穆斯林模式蔓延至新疆以外地区】 甘肃省据《南华早报》报道，该省平凉市教育局责令平凉阿拉伯语学校于12月17日前关闭。该校自1984年起开始办学，现在当局却称其无办学证而勒令其关闭…… 这所阿拉伯语学校是一所面向贫困学生的慈善机构，已成立34年，却一朝被要求强行关闭。",
			"date_added": 1545795415066
		},
		{
			"body": "2019 中共本身日子更難過 再加川普時代真正到來 白宮內閣中綏靖派被趕走",
			"date_added": 1545799805144
		},
		{
			"body": "木蹊：正在被抵制的聖誕節 養活了無數中國人(圖): 這些工人自豪地說：‌‌“中國擁有全球最大的聖誕禮品加工廠，全世界每10棵聖誕樹中，就有9棵源自中國‌‌”。",
			"date_added": 1545799833381
		},
		{
			"body": "消息来自国内微信朋友圈转谭老头：2018年12月26日上午8点30分在天津市第二中级人民法院对面，来自杭州的张哲诚举起“无罪释放王全璋，王全璋是好人，中国最好的好人。”被天津国保控制、带走。 #关注天津庭审现场# 转铁肩：许艳被警察带走了，在车上。王素娥也被带走，在另一个车上。",
			"date_added": 1545800290762
		},
		{
			"body": "请陈全国同志辟谣： 维吾尔儿童，因父母被关集中营而冻死。图中被冻死儿童，据说来自和田地区墨玉县巴西吉勒尕村。",
			"date_added": 1545964568036
		},
		{
			"body": "自由亚洲电台： 美国麻省理工学院在官方网志公布最新一届提前收生取录结果。今年大陆和香港学生罕生地名落孙山，校方只取录了 5 名中国籍女学生，但都是来自美国高中。 至于史丹福大学亦公布了最新获得面试机会的地区名单中，都没有中国，但有台湾及香港。",
			"date_added": 1545965016267
		},
		{
			"body": "外匯被管制 大陸越來越多台商反映匯不出錢",
			"date_added": 1545966895763
		},
		{
			"body": "【中共最高层三日开会非同寻常  分析指习近平疑心很重】中共政治局25日至27日连续三天开会，在法新社以及一些分析人士看来，尤以25日26日习近平主持党内生活会透露出的信号为多。什么信号？中美贸易战暴露出中共最高层内部的分歧和紧张，害怕党内有人造反的习近平让成员们自我批评。",
			"date_added": 1545975824584
		},
		{
			"body": "美国指控华为金融首脑孟晚舟涉嫌金融诈骗，要求加拿大拘捕。加拿大依法抓了孟晚舟，北京接二连三抓几个加拿大人出气，导致关注孟晚舟的热度在中国持久不散。不少中国人就顺便提出这样一个问题，以孟晚舟这么富有，在中国如此享有特权，为什么偏偏要在冰天雪地的加拿大置豪宅安家？",
			"date_added": 1545975894185
		},
		{
			"body": "當事人：中共急於對付王全璋 當局計劃泡湯(圖): 我們知道當局將庭審定在12月26日這個日子，可見是希望能低調處理這個案件，但由於媒體的關注以及各國外交官的出現，意味着這個計劃完全泡湯了。王全璋在法庭上解聘了他的律師，很可能給他們（法院）帶來麻煩，",
			"date_added": 1545975968371
		},
		{
			"body": "知情人指證：福建公交車恐襲嫌犯 原在公交公司工作 被官方逼上絕路(圖): 簡冠聯說︰“我是廣州天河區，他是福建，都是被拆遷戶，之前也有過來往。他原來在公交車公司，後來因為逼遷，把他辭退。後來找不了工作了，他妹買了一台摩托車給他搭客，後來被當地政府把摩托車也收掉了。任何的生活收入都沒有...",
			"date_added": 1545976936469
		},
		{
			"body": "德国联邦政府人权专员柯夫勒就王全璋案审判发表声明",
			"date_added": 1545980563459
		},
		{
			"body": "崔永元揭最高法院案卷丟失內幕 牽出兩高官(圖): “陝北千億礦權案”由中共最高法院宣判一年後，近日再起風波。29日，央視前主持人崔永元發文揭露，該案案卷丟失涉及中共最高法院承辦該案的法官王林清和最高法院院長周強。",
			"date_added": 1546161522783
		},
		{
			"body": "崔永元炮轟奏效？最高法批造謠後迅改口啟動調查 大法官“防不測”視頻曝光: 前央視主持人崔永元近日在微博爆料中共最高法院長周強帶頭執法犯法後，這場前體制內人士與中共最高權力機關的唇槍舌戰成為關注焦點。中共最高法先就崔永元的爆料聲明指是“謠言”，隨即又迅速改口宣布啟動調查。",
			"date_added": 1546172333292
		},
		{
			"body": "天愁地惨，穷年末事~26岁少妇，宫颈癌中期，20万元，老公签字放弃治疗‬ ‪她哭着说：姐姐，嫂子，我不想出院，我想活下去‬ ‪姐姐说：是你老公对你放弃治疗‬",
			"date_added": 1546311355606
		},
		{
			"body": "中國人吃草也能活？專家打臉王岐山：草原生態早破壞沒草可吃了",
			"date_added": 1546311500333
		},
		{
			"body": "王友群：習近平3月2日前能與美國簽協定嗎？別忘了天意 (圖): 中共“改革開放”40年，形成了一批權貴家族，他們在國內外大發橫財，靠的就是權力在資源配置中起決定作用。進行結構性改革，讓權力退出能賺大錢的市場，等於要他們的命。這股勢力是中美達成歷史性妥協的最大障礙。",
			"date_added": 1546312284118
		},
		{
			"body": "熊萬里：智慧常常是較量出來的！: 近代獨裁做到極致的，從希特勒、墨索里尼到卡扎菲、齊奧塞斯庫，好多死無葬身之地的例子，究其原因，無非是他們要挑戰人類為何要發展成社會的基本智慧。別把人類社會當成自己的玩具，那樣只會玩死自己。",
			"date_added": 1546317676378
		},
		{
			"body": "天津三星工廠被曝31日關閉 數千名員工等待安置(組圖): 12月31日，天津三星通信工廠停工關閉。該工廠成立於2001年，擁有2000多名員工。截止關閉當日，該廠的員工安置問題仍在進行中。不少員工在宿舍區准備搬離。 ",
			"date_added": 1546321122338
		},
		{
			"body": "北青報報道，2019年1月1日上午，首旅集團總裁、王府井集團董事長劉毅突發大面積心梗離世，終年58歲。",
			"date_added": 1546327151793
		},
		{
			"body": "千億礦權案核心：周強批示失蹤 卷宗被人拿走後“換卷” 羅昌平要求周強下台: 據大陸媒體披露，“千億礦權案”卷宗之所以“被丟失”，因卷宗里有中共首席大法官、最高法院院長周強，以及時任副院長奚曉明的批示。奚曉明已落馬，周強仍在位。港媒稱，顯然，有人意圖要消去卷宗中不光彩的批示，才會出現如此... ",
			"date_added": 1546338032543
		},
		{
			"body": "《纽约时报》日前报道，贺建奎目前已被隔离在南科大招待所的一套公寓里，并被多名身份不明的人员看守，公寓的两个阳台也被金属网围了起来。",
			"date_added": 1546563933732
		},
		{
			"body": "北上广深四个城市房产总值108万亿，预计2018年全国GDP大概是88万亿，目前四大城市房产总值是全国GDP的122%。截止目前，A股总市值大概45万亿，上海房产总值39万亿，是A股的87%。也就是说，一个上海房产总值，几乎可以买下整个A股。 ​",
			"date_added": 1546564670958
		},
		{
			"body": "新年攻防战 踏入2019年第一个工作天，两岸最高领导人即针锋相对。 蔡英文一改以往被动作风，上午习近平才公开宣示对台政策，下午蔡英文就出来回应，直接回击习近平的统一主张。",
			"date_added": 1546577471220
		},
		{
			"body": "最高法院被揭發懷疑自盜卷宗（檔案）後，央視前節目主持人崔永元，再爆出最高法院院長周強等人干預司法的罪證，但最高法院則繼續以緘默應對，最高檢察長張軍亦避談不介入調查的原因。",
			"date_added": 1546577596066
		},
		{
			"body": "美国国务院星期四发布针对中国的旅行警告，敦促前往中国旅行和已经在中国的美国公民提高警觉，因为中国“任意执行地方法律”，“对持有美中双重国籍的国民实施特殊的限制”。",
			"date_added": 1546600005711
		},
		{
			"body": "楊憲宏表示，習近平其實一直在等美國總統川普祝賀中美建交40年，結果等到「亞洲再保證倡議法」，習氣瘋了因此憤而對台行凶。",
			"date_added": 1546600086273
		},
		{
			"body": "佩洛西再任美眾議院議長 主張強烈反共",
			"date_added": 1546600703699
		},
		{
			"body": "达赖喇嘛尊者致函祝贺南希·佩洛西连任美国众议院议长",
			"date_added": 1546607264915
		},
		{
			"body": "6歲女兒患白血病，妻子借錢治病遭丈夫暴打：不救了，不願過欠錢的日子！ 為給孩子治病花光了家裡多年來贊下的所有積蓄，而且還借了40多萬的外債！ 孩子在旁邊靜靜地看著這一切......",
			"date_added": 1546845084636
		},
		{
			"body": "中美貿易談判 美艦南海航行：向過分的海洋主張發起挑戰: 一艘美國導彈驅逐艦在中共宣稱擁有主權的南中國海爭議的帕拉塞爾群島(西沙群島)附近海域航行，此時中美官員正在北京就貿易問題進行磋商。 ",
			"date_added": 1546849090535
		},
		{
			"body": "在短短半个月内，就出现了三条这样的奇葩新闻。第一条是12月19日的新闻：90后小妹养猪，年收入过百万；第二条是12月28日的新闻：大学系主任回村卖猪肉，年销售额过亿；第三条是1月4日的新闻：浙江小伙子卖空气，年收入400万。在这个神奇的国家，都把新闻做成了天方夜谭。",
			"date_added": 1546849231494
		},
		{
			"body": "2019 中共國家破產之日？諾貝爾經濟獎得主：中共經濟沒大到不能倒 但大到無法救",
			"date_added": 1546859472156
		},
		{
			"body": "北大教授梁云祥：连自己人都想移民国外，还谈什么让台湾和平回来？",
			"date_added": 1546864637915
		},
		{
			"body": "美中正在贸易谈判，美军驱逐舰同时在南海主张航行自由",
			"date_added": 1546865485922
		},
		{
			"body": "《今日（7）美國艦隊再次開進南海中共島礁12海裡以內》 美國太平洋艦隊發言人說：《我們來了！中國千萬別對我們客氣！》",
			"date_added": 1546865594240
		},
		{
			"body": "中美北京貿易談判9日結束。美媒稱，白宮鷹派認為北京的保證過於模糊，對談判結果悲觀。香港學者丁學良表示，中共在自身核心利益上不會讓步。",
			"date_added": 1547093108215
		},
		{
			"body": "刚刚结束的中美副部长级贸易谈判双方也约定各自用两个不同的版本对外公布会谈结果",
			"date_added": 1547093228861
		},
		{
			"body": "美国贸易谈判代表处已发表了美中副部长级贸易谈判结果的声明。美方确认此轮谈判主要落实中国增加美国商品采购，缩小美国贸易逆差。",
			"date_added": 1547093264401
		},
		{
			"body": "数十名东台市城管人员，近日处理市内一宗拆迁个案时，与居民发生打斗，现在目击者称，城管向被殴打的男子说 : “我们来就是打你们的，打死你们有人买单。”",
			"date_added": 1547093357383
		},
		{
			"body": "上海青浦吾悦广场一男子跳楼身亡",
			"date_added": 1547093403336
		},
		{
			"body": "北洋大學一直以教學質量嚴格要求著稱，美國以及歐洲各國的大學研究院都有明文規定，免試接受北洋學生入學”。“當時美國把中國的大學分為A、B、C、D四個等級，其中A級有四個，北洋大學是A級第一位”。",
			"date_added": 1547094190420
		},
		{
			"body": "美國加利福尼亞大學戴維斯分校近日向部分學生發布了一份中國旅行警告，建議他們在中國不要使用WhatsApp或微信等即時通訊軟體，也不要在社交媒體上隨便發表言論，以免被中共當局“任意拘捕”。",
			"date_added": 1547094247911
		},
		{
			"body": "20190109 王全璋妻會見六國人權官員促關注。胡石根、陳西獄中健康不佳。秋雨教案20人遭刑拘。",
			"date_added": 1547094988941
		},
		{
			"body": "德国工业联盟要欧盟对中共采取更强硬政策",
			"date_added": 1547216559972
		},
		{
			"body": "百余名中国幼儿接种过期脊灰疫苗，多人现不良反应",
			"date_added": 1547216641924
		},
		{
			"body": "网络审查再升级：中国推特用户遭政府盘查或拘留",
			"date_added": 1547216745037
		},
		{
			"body": "#脸书 渣男把美国用户信息卖给了华为。允许华为进入美国用户系统。 美国司法部正在起诉脸书。",
			"date_added": 1547216781560
		},
		{
			"body": "武警已经集结去事发地点支援，可谁跑去支援受害家长呢..",
			"date_added": 1547216832930
		},
		{
			"body": "美国公司为避新疆“再教育营”制造 中断合作",
			"date_added": 1547389289876
		},
		{
			"body": "中美北京貿易談判9日結束，有俄羅斯專家評論說，中美貿易戰不可能結束，原因是雙方矛盾的深層原因並未出現變化。",
			"date_added": 1547389339235
		},
		{
			"body": "違法捕300噸鯊魚，20中國漁民遭厄瓜多爾重判",
			"date_added": 1547393245093
		},
		{
			"body": "北京大学教授郑也夫新年之际发出：共产党领袖所能做的唯一可载入历史史册的大事情，就是引领这个党体面地淡出历史舞台。他的话象平地的一声惊雷，响彻在新年的中国大地上。让中共退位下台，可以说自中共执政七十年以来，体制内的知识分子第一次发出这样的呼声。这一呼声顺应时代潮流。中共七十年犯下的罪恶，及目前的倒行逆施，表明中共已是一个无可救药的党。除出体面下台别无出路。",
			"date_added": 1547397242875
		},
		{
			"body": "“隐蔽战线”  有年轻朋友最近去美国，她持BNO护照，美国的十年签证就在她过期的特区护照上。她说入境时所见和所遭遇的，与一年前大不同。一年前排队过入境处时，周围大都是讲普通话的中国人，这次她几乎没有见到这样的人。一年前她入境被问两句就让她过了，这次被问了大半小时。这使她感到中美关系步入严冬，而港美关系受牵连也开始了。大陆人取得美国签证会很难，香港人也可能会不容易。",
			"date_added": 1547397377589
		},
		{
			"body": "【港人欧遊不再免签证】——2021年起須申请电子旅行许可！香港人终于享受到和大陆一样的待遇了 ​​​​！",
			"date_added": 1547400461406
		},
		{
			"body": "美国信用卡公司Visa(维萨)和Mastercard(万事达)2017年根据中国颁布的程序向中国人民银行递交在中国从事人民币结算业务申请后，人民银行至今仍拒绝承认申请！ 这个是典型的金融壁垒！！ 违背WTO承诺！！",
			"date_added": 1547524930856
		},
		{
			"body": "8岁女孩下体流血不止称遭老师殴打，校长：是2名男同学用笤帚戳伤",
			"date_added": 1547524992948
		},
		{
			"body": "1月13日，甘肃宁县，一小学老师称口红不见，让班上一女孩拿出来，女孩奶奶称没有证据不予赔偿。事后女生下体流血不止，家长怀疑是老师所为，校方称，跟老师没关系，警方调查是同班两男生用笤帚戳伤其下体，相关部门正处理中。",
			"date_added": 1547525034917
		},
		{
			"body": "东莞街上随机杀人刚过，福州10几个电动车路人被捅，满街亡命徒的时代来临了，以后上街都要多张几双眼睛才不会被随机死。",
			"date_added": 1547651944304
		},
		{
			"body": "福建大暴動",
			"date_added": 1547652890971
		},
		{
			"body": "太糟糕@wwwqusi_911 吃饭时，老婆说有朋友孩子在美国硕博连读，圣诞节回国后签证被拒了，回不去了，那边开学快2周了，父母急疯了。 看来又是“代价”很多。",
			"date_added": 1547694926630
		},
		{
			"body": "质疑玉兔二号技术故障，此微博号发完此贴连博带号消失",
			"date_added": 1547695161235
		},
		{
			"body": "加拿大环球邮报评论认为，最近发生的一系列中加司法和外交事件，对加拿大是一件好事，让加拿大认清了中国的真正颜色，从一个与权控经济的自由贸易睡梦中醒来。这有利于加拿大今后采取正确的立场。",
			"date_added": 1547695879215
		},
		{
			"body": "美貿易代表：若美中談判破裂加征25%關稅 美企可申請豁免",
			"date_added": 1547696238080
		},
		{
			"body": "河内批准新版TPP   “越南制造”直追“中国制造”  越南本星期正式批准了有11个国家参加的贸易协定《全面与进步跨太平洋伙伴关系协定》（CPTPP），如果与欧盟的贸易协定随后也得到批准，依赖出口的越南可以无关税进入占全球GDP45%的多边市场。这是越南加入世界贸易组织（WTO）以来得到的最大经济助力。",
			"date_added": 1547696603038
		},
		{
			"body": "德国发展部长格尔德穆勒警告新兴经济体不要依赖中国的贷款。这些贷款往往在实际债务数额和贷款条件方面不透明。",
			"date_added": 1547697629768
		},
		{
			"body": "期盼中国再当世界经济引擎只是幻想",
			"date_added": 1547697676783
		},
		{
			"body": "美促以色列嚴查中共滲透",
			"date_added": 1547697805179
		},
		{
			"body": "律師後俱樂部遭拆招牌取締(圖): 由一批被吊照維權律師組成的法律服務組織「中國律師後俱樂部」，成立僅3個多月便遭當局取締。大批警察及政府人員闖進辦公室拆招牌，並出示通知書要求俱樂部停止運作。俱樂部發起人強調不會理會政府通知，仍然繼續運作",
			"date_added": 1547697839759
		},
		{
			"body": "周永康薄熙来近况：薄熙来住16平米单间，不用穿囚服，可穿西装。他积极参加集体活动，喜欢练书法，给当局写申诉信，要求重审他的案子。周永康住独立小院，一小块地是他的专属蔬果园。一名关系密切的人说，周种菜有一手，亲朋好友来看他时，会带回去周种的南瓜。他还有两棵很大的核桃树和一棵柿子树。",
			"date_added": 1547699032108
		},
		{
			"body": "馬士基東莞工廠倒閉　2000員工春節前被解僱  在中美貿易戰影響下，航運業亦受到衝擊。全球最大集裝箱運輸企業馬士基（Maersk）在東莞的集裝箱工廠近日倒閉，約2000名員工被解僱。  馬士基方面表示，東莞工廠自去年12月便一直處於閒置狀態，絕大多數員工在大約12月10日開始便在帶薪休假。公司通過電話及微信的方式通知員工解僱的消息。",
			"date_added": 1547868573398
		},
		{
			"body": "原河南省平舆县法院院长刘德山：我用中国法律审案近30年，从看守所释放后才真正认识中国的法律和理解中国的法律，30年间我至少审理过近千例刑事案件，每一次审理刑事案件，被告人在法庭都称遭遇刑讯逼供，可我没有一次采纳过。现在回想起来，我是一个罪人，我关押15个月被惨无人道的刑讯逼供，报应！",
			"date_added": 1547868978351
		},
		{
			"body": "加拿大与中国两国外长继续隔空交火。中方威胁加拿大不要禁止华为、不要拉拢盟国，否则将承担后果！加拿大外交部长也不甘示弱地回应，加拿大不会改变态度，将坚守法治，也会继续寻求盟友的支持。",
			"date_added": 1547869206502
		},
		{
			"body": "加拿大表示不會向中共妥協 中加裂痕日益加深 (圖): 加拿大公共安全部部長長周五表示該國不會向中共妥協。中共周四曾威脅稱，如果華為被禁止為加拿大5G網絡提供設備，中共將對加拿大採取報復措施。",
			"date_added": 1547869536092
		},
		{
			"body": "“三駕馬車”全熄火 中國經濟或“墮崖”: 中共近來公布的一系列經濟數據顯示，大陸經濟陷入困境，今年第一季度經濟有墜崖式下落的風險。 外貿、投資、消費是中共拉動經濟增長的三駕馬車，從近來公布的經濟數據來看，這三駕馬車已經全部熄火。",
			"date_added": 1547869672771
		},
		{
			"body": "孟宏偉妻子再現法媒要求巴黎保護(圖): 2018年9月25日在北京遭到逮捕的國際刑警組織前主席孟宏偉的妻子Grace孟近日接受法國媒體采訪，聲稱一百多天來沒有他丈夫的任何消息。她目前已返回自己家居住，但卻擔心自己及孩子遭到綁架，要求法國政府對... ",
			"date_added": 1547869732632
		},
		{
			"body": "美企高管：中國製造已是過眼雲煙(圖): 美國企業高管本周來到佛羅里達州奧蘭多參加投資者大會（ICR Conference），在會場上傳達或者聽到的信息是：“中國製造已是過眼雲煙了”。",
			"date_added": 1547869849579
		},
		{
			"body": "【山西女生惊魂一刻 遭强掳塞入车后箱】 17日清晨7点左右山西忻州市五台县一名女学生独自外出时，遭到一名陌生男子袭击，并强行把她塞进私家车后尾箱 女生在车尾箱剧烈挣扎，双手死死地抵住车尾箱不让关上并大声呼救。男子怕引起其他人注意，便将女生从车尾箱拖了出来，狠狠摔在地上，然后开车扬长而去。",
			"date_added": 1547890378251
		},
		{
			"body": "日經新聞今天引述消息人士指出，富士康在河南省鄭州市的工廠，自去年10月起，已經中止了約5萬名約聘員工的契約。 ",
			"date_added": 1547890421801
		},
		{
			"body": "加拿大大使返回加拿大，19日对外宣布：加中自由贸易到此结束，现在不会谈，以后也不会再谈！我们现在的主要任务是，拯救被中共绑架的两名加拿大人和争取第三名加拿大人免予死刑。",
			"date_added": 1548122569552
		},
		{
			"body": "1月17日彭博社报道，自2018年年底，有4位中国富豪将超过170亿美元（约1,333亿港元）财富转移到家族信托中。4位富豪包括：融创中国董事长孙宏斌、龙湖集团董事长吴亚军、达利食品董事长许世辉、周黑鸭实控人唐建芳。——本来说几万就要报批的，看来报批是用来管老百姓的，上层红二、红三和权贵的钱不用报批就出境了！",
			"date_added": 1548122612263
		},
		{
			"body": "向松祚2019最新演講：很快要全面崩塌 沒有一個人逃得出去",
			"date_added": 1548123844434
		},
		{
			"body": "据报法学教授柯华庆举报法学教授张千帆、林来梵编著的宪法学教材吹捧西方，举报法学教授焦洪昌虽没有吹捧西方，但也没有赞美中方。",
			"date_added": 1548124593890
		},
		{
			"body": "委内瑞拉 #Venezuela 民主抗争全面爆发，部分互联网已经切断，军人与抗争民众站在一起‬",
			"date_added": 1548124636003
		},
		{
			"body": "上周知情人士透露，中共做出重大讓步，承諾在2024年前“徹底消除”與美國的貿易順差。專家認為這或許是中共轉移焦點的把戲。 ",
			"date_added": 1548124714481
		},
		{
			"body": "中国与CNN就维族人在新疆遭受迫害报道陷入纠纷",
			"date_added": 1548181732511
		},
		{
			"body": "委内瑞拉人民和国际社会焦急地等待Juan Guaido正式宣誓作为委内瑞拉的宪法总统，尽管是临时的，担任总司令的角色。现在是Guaido先生。现在是时候了",
			"date_added": 1548181787462
		},
		{
			"body": "CNN报道说，有关米娜在国会作证的经历完全符合越来越多的有关中国当局在新疆有系统地迫害当地少数民族的证据链。报道表示，美国国务院一位官员在国会表示，有至少80万，可能多达200万新疆少数民族被关押在大规模的“再教育营”里。",
			"date_added": 1548181901327
		},
		{
			"body": "美国总统特朗普在当地时间周一下午通过推特表示，“中国最新公布的经济增长数据显示，中国经济增速创下自1990年来新低，这与和美国的贸易纠纷及华盛顿的新政策有关”。他并呼吁，“中国应理性的与美国解决贸易纠纷，别再闹了(stop playing around)”。",
			"date_added": 1548182018932
		},
		{
			"body": "昨夜今晨，中国网络的热度空前，欢呼委内瑞拉变天的，咒骂美国霸道的，嘲讽“党中央拿出的几百亿美元打了水漂漂”的，应有尽有。",
			"date_added": 1548420684399
		},
		{
			"body": "“孩子，你看，我在給你直播。這就是此刻的 委內瑞拉 ！是你的故土，你出生的地方！以上帝的名義，以耶穌的名義，我宣誓：委內瑞拉將獲得自由！ ” ",
			"date_added": 1548420842354
		},
		{
			"body": "谁能想到，就在几个月前，马杜罗还在第二大经济墙国与某人交流《治国理政》的经验，当时马杜罗还记了笔记！我相信他是认真的！回委内瑞拉以后，一定贯彻落实了他所学到的一切。真是不学不知道，一学下一跳，才短短几个月的功夫，今天就开花结果了。",
			"date_added": 1548421214074
		},
		{
			"body": "今天下午萬達廣場發生20多起爆炸",
			"date_added": 1548424773290
		},
		{
			"body": "最近，流传着一份关于“电视台”的内部消息：辽宁卫视已经发不出工资了， 北京台收入减少了十个亿，央视首次不招毕业生了， 上海东方卫视关停两电视频道， 河北卫视靠贷款维持 多地电视台爆发“讨薪潮” ",
			"date_added": 1548472418139
		},
		{
			"body": "菲律宾也加入抵制华为的行列",
			"date_added": 1548475480655
		},
		{
			"body": "著名金融家兼慈善家索罗斯周四在达沃斯说“习近平是自由世界最危险的敌人”。中国外交部翌日反驳“颠倒黑白”。不过，官媒报道时避重就轻，避开索罗斯炮打习近平这句最关键的话。",
			"date_added": 1548475534434
		},
		{
			"body": "萬達廣場突發連環爆炸 至少一死一傷",
			"date_added": 1548476044051
		},
		{
			"body": "从再教育营释放出来的新疆人可以跟家人重聚，原本是值得高兴。可是他们的亲人发现，部分被释放出来的人，精神状况大不如前，还患上失忆症，怀疑他们被注射药物。在阿拉木图，一名被释放出来的男子，回到哈萨克后，被不明人士再注射药物，令失忆症更为严重。",
			"date_added": 1548476374901
		},
		{
			"body": "【乘客带了点红署、白菜、花生等年货被罚200元】 随岳高速湖北荆岳大桥交警，一辆客车上乘客南下过年寻亲，带的两个萝卜一袋白菜一把蒜苗一袋红薯和花生，被交警以非法装载货物为名罚款两百",
			"date_added": 1548476427229
		},
		{
			"body": "美国UC系统九所大学与华为、中兴断绝关系！不再接受他们的资助。 原因是川普签发的新法令NDAA。接受中共的钱，就休想拿到美国政府的资助",
			"date_added": 1548476459652
		},
		{
			"body": "河北警察連續三天大抓捕 至少綁架走5人",
			"date_added": 1548689247933
		},
		{
			"body": "习近平是威胁全球的“老大哥”  金融大鳄索罗斯在瑞士达沃斯对中国及习近平的批评既到肉又非常不客气，指习近平是开放社会最大敌人实在道出很多人的心底话。奇怪的是，中国官方对于这样猛烈的攻击反应甚为克制。",
			"date_added": 1548689333090
		},
		{
			"body": "中国一个朋友都没有  呜呼哀哉，美国与加拿大所谓“合谋炮制”的华为太子女孟晚舟被“绑架”事件充份证明，无论中共驻加大使卢沙野如何警告加国外长方慧兰不要采取“麦克风外交”，不要试图寻求盟友支持，但残酷的现实是：除了美、加新旧盟友如英、法、德、澳洲、新西兰、日本与印度外，欧盟包括西班牙与波兰这些受惠于中国投资的国家亦一致支持加拿大司法独立等普世价值。波兰甚至提议欧盟与北约采取同一阵线对付华为等中共赋予特殊任务的垄断性企业。可怜世界第二大经济体、武器趋俄赶美的“厉害之国”在国际社会竟然连一个替自己说话的朋友也没有。",
			"date_added": 1548689386560
		},
		{
			"body": "任正非曾遭FBI問話 美國差點成功拘捕他？: 日前曝光的美國紐約東區聯邦地方法院發出的起訴書披露，華為創辦人任正非，早年曾被美聯邦調查局（FBI）問話，任被指控曾作出3項虛假陳述。此外，香港傳出美國還曾要求某歐洲國家拘捕任正非。",
			"date_added": 1548838617860
		},
		{
			"body": "俄罗斯杜马计划对互联网进行打击 由于 12,000名卡车司机罢工",
			"date_added": 1548838822594
		},
		{
			"body": "卢比奥参议员： 提醒人们，美国一直遵循这样的原则来向前迈进：即上帝创造所有人、并赋予我们相同的权利，跟任何政府或领导人无关。",
			"date_added": 1549090098202
		},
		{
			"body": "刘鹤带着习的一封亲笔信，到白宫椭圆形办公室。川普总统要求翻译当着所有人的面，大声朗读。这封信关键的就一句：希望双方能各退一步 \"meeting each other halfway\"。 ——问题是，如果川普总统不愿意退一步，你又能怎么样呢？ ",
			"date_added": 1549090724071
		},
		{
			"body": "任正非自曝：華為4萬多海外員工多數不願回國",
			"date_added": 1549104941755
		},
		{
			"body": "一位澳洲華裔護士說：在澳洲注射青黴素不做皮試這是因為中國青黴素不合格，純度不夠才會過敏，所以需要做皮試。其實干擾素也不合格，中國汽油也不合格，疫苗也不合格，奶粉也不合格，化肥也不合格，農藥也不合格，食品不合格，汽車也不合格，電器也不合格，以下省略八千字",
			"date_added": 1549105414883
		},
		{
			"body": "世界最大規模 #自由貿易經濟區 開始啟動。 #日本 和 #歐盟 （EU）的 #經濟合作協定 （ #EPA ）於2月1日0時生效。日本約94％的産品品類，歐盟約99％的産品品類取消 #關稅 。除此之外，日本和歐洲還將在電商貿易等方面完善規則，日歐企業將在這兩個區域更容易展開商業交流。",
			"date_added": 1549105520506
		},
		{
			"body": "北京新希望基金会近日通过邮件宣布，受境外 NGO 法案影响，民政部已明确告知他们，这家救治中国重病/残章弃婴的境外 NGO 将无法继续在北京顺义运营。该机构由澳洲的 Joyce Hill 医生及其丈夫 Robin Hill 共同建立，并从2000年起，在北京市儿童福利院的允许下开始护理重病/残障弃婴。2011年7月，新希望基金会在中国民政部获得登记注册。近十几年来，该机构还在河南郑州、焦作、洛阳等地设立了护理中心。目前尚不清楚新希望在河南的地点是否会受影响。",
			"date_added": 1549105726428
		},
		{
			"body": "【立此存照】救治中国弃婴的境外NGO将在北京被迫关闭",
			"date_added": 1549105749688
		},
		{
			"body": "一項最新民調顯示，越來越多的俄羅斯人認為，普京領導俄羅斯正在一條錯誤的道路上前進。與此同時，俄羅斯的其他政治機制也日益喪失民心。俄羅斯總理、政府內閣和議會的民意支持率都創新低。 ",
			"date_added": 1549105787913
		},
		{
			"body": "母亲贪污了3.5亿，女儿拿着这笔钱在加拿大大肆挥霍，还“成为了音乐人” 如今母亲东窗事发身陷囹圄，按理只要退回赃款就能减刑或免刑，没想到狼妈养出来的狼女不但分文不提，反而天天在微博上催促开庭，一心要让母亲送死，好自己独吞那笔赃款 共产党养出来的人性之阴暗，真是不堪入目：母亲贪污造成上万工人下岗，让他们或自杀或卖身；女儿更进一步，一心逼死母亲，好独吞赃款。用人血印出来的钱，包装自己的“音乐人身份”，这样的音乐，调子再柔和也是血淋淋的",
			"date_added": 1549106109782
		},
		{
			"body": "【赵淇欣是个真正的记者】 过去几个礼拜，@joannachiu的报导，不光让加拿大自由党华裔参选人王小宝退选，更让加拿大驻中国大使麦家廉丢乌纱帽。面对各界的质疑和压力，她强调，记者的工作就是问问题。",
			"date_added": 1549250129634
		},
		{
			"body": "候选人王小宝中文发微信求华人支持，理由是她是华人。赵准确翻译此微信成英文发出，令王马上退选，为何？根本原因是华人很多价值观与当代人类文明冲突，见不得光。只要直译，马上露馅！",
			"date_added": 1549250178921
		},
		{
			"body": "LIFETIME 视界：加拿大最知名的华裔资深议员Richard Lee被爆与中共《中国日报》关系密切，并且帮助《中国日报》在加拿大渗透发行。孟晚舟事件让加拿大社会开始反思，不能把中共当成一个正常交流对象，不能把支持中共的人简单看作促进中加交流。的确存在渗透和出卖加拿大利益的问题。欧美国家的华裔应该成为抵御中共渗透的最积极力量。西方社会看不透中共，西方政客更是经不起中共诱惑、腐蚀，而中共的那些伎俩会被来自中国移民一眼看穿。除了亲共移民之外，其他华人应该勇于揭露人类社会的共产毒瘤。加拿大华裔记者赵淇欣一直勇敢地揭露中共，美国还没有一个华裔记者能做到这样。",
			"date_added": 1549250257376
		},
		{
			"body": "石家庄官方回应儿童被打错疫苗：不是错种是故意调包",
			"date_added": 1549250539081
		},
		{
			"body": "【加国罕见民调指过半人支持逮捕孟晚舟】 中国与加拿大及美国因华为副总裁兼财务总管孟晚舟在加拿大被捕，并被美国要求引渡事件而紧张对峙。加拿大民意调查机构安格斯里德研究所发布新民调，显示过半民众支持逮捕孟晚舟，有高达90%受访者认为目前中加关系相当严重。",
			"date_added": 1549250649922
		},
		{
			"body": "我是黄婉，美国公民，周滨的妻子，周永康的长儿媳。我目前人在北京，接受社区矫正，滞留在中国已经五年。我的处境并不安全，但我愿以无惧做最真诚的忏悔，忏悔当我享受特权的时候对维护司法的健全毫无作为。希望我的遭遇能让当权者有所警醒，维护法律的尊严与公正是为自己也是为家人。",
			"date_added": 1549250773060
		},
		{
			"body": "2月2日的委内瑞拉加拉加斯，让中共如何不惊心？",
			"date_added": 1549250896433
		},
		{
			"body": "驚爆中共竊取複製加國核技術 華為有2大特殊國家功能 中國電信偷加國資訊半年",
			"date_added": 1549251516457
		},
		{
			"body": "709律师案妻子们在天津第一看守所外面陪着全璋过年",
			"date_added": 1549337982369
		},
		{
			"body": "没拿到工资不能回家过年，还有民工春节不回家睡桥下，没挣到钱不好意思回家。这都是那些拿不到工资的农民工的心声。过年了，谁不想回家省亲，但无良老板拖欠工资，他们是何等的无奈。李克强总理随便去北京城乡交界微服私访一下，就知道农民工处境如何，就知道那些民办工厂如何，就知道到底有没有拖欠工资，何必跑到火车上问不是民工的“民工”有没有拿到工资呢。",
			"date_added": 1549338213602
		},
		{
			"body": "2名华为员工违法 丹麦遭驱逐",
			"date_added": 1549338325878
		},
		{
			"body": "杨茂森‏ ：知道为什么留学生要去欢迎匪首了吧。他们留学回国之前一定要留学地的领馆的中共文化特务开具的证明，以表明他们在国外没有参加反共组织和活动。另外纽约地区的中共文化特务叫杨军，负责监控纽约领区的留学生。",
			"date_added": 1549338365529
		},
		{
			"body": "冤情未获昭雪 大批访民留在北京过年",
			"date_added": 1549338563819
		},
		{
			"body": "一千多万“北漂”返乡后的北京 滴滴司机李阔见过很多人离开北京过年。一位60多的老太太，每年带孙子飞加拿大，买的公务舱，来回机票得好几万；买了10几个大柚子的民工，和别人拼车去北京西站，觉得北京水果不一样，“毕竟是北京买的，回去分分。",
			"date_added": 1549339206597
		},
		{
			"body": "人权组织齐聚日内瓦 吁联合国对新疆展开调查  来自数个人权组织的代表昨日齐聚日内瓦，公开要求欧洲及其他穆斯林国家带头在联合国内部成立一个调查小组，并对中国在新疆大规模关押少数民族穆斯林的行为进行调查。",
			"date_added": 1549351218953
		},
		{
			"body": "来自人权观察（Human Rights Watch）及国际特赦组织（Amnesty International）的代表要求联合国人权理事会派遣一个国际调查小组到新疆采证。人权观察的执行董事罗斯（Kenneth Roth）在日内瓦记者协会的记者会上表示：“中国政府在新疆进行的打压已经严重到了国际社会必须发声援助的地步。”",
			"date_added": 1549351247246
		},
		{
			"body": "王峭嶺‏：煮好餃子、湯圓，又來到看守所門口。陪全璋過年。存完錢物，文足和全秀都不想離開。全秀開始沖着看守所大門喊：全璋！我剛說了句“里邊聽不見”，心裡卻懊悔了起來。是她們的親人，被關在裡面，快四年了。",
			"date_added": 1549351310000
		},
		{
			"body": "第一槍！親共富豪回中國過年 澳洲取消居留權、拒絕入境",
			"date_added": 1549513653717
		},
		{
			"body": "美智库：中国宗教迫害堪比纳粹德国",
			"date_added": 1549513741894
		},
		{
			"body": "新疆各地强迫穆斯林过春节吃猪肉 ",
			"date_added": 1549513789713
		},
		{
			"body": "川普內閣出手 習近平提議遭拒 美推貿易戰大殺器 中共更衰: 今日，美財長對媒體表示，目前尚無川習會晤這類計劃。昨日，川普發表國情咨文演說，美國需要通過《美國對等貿易法案》。阿波羅網評論員分析，從川金會時間看，美國否決了習近平提議的川金會後在海南川習會，顯示美國對死期限的..",
			"date_added": 1549514843410
		},
		{
			"body": "美報告：九成五澳洲中文報章 都已被中共政府收購",
			"date_added": 1549514883609
		},
		{
			"body": "中肯鐵路合同秘密副本曝光 再揭一帶一路債務陷阱",
			"date_added": 1549516565791
		},
		{
			"body": "朱万利: 看川普演讲---中共必须进行结构性改革  美国坚决不接受社会主义 此演讲令人感动和震撼，让人们看到了社会主义理论和实践将在全球受到限制和清除直至终结的希望。新的贸易协议中共必须包括真正的结构性改革，让人们看到了川普追求自由公平贸易、让美国再次伟大的决心。",
			"date_added": 1549538918056
		},
		{
			"body": "科顿还说，与此同时，美国必须阻止本土公司帮助中国打造这个“邪恶帝国”，比如正在中国从事尖端人工智能研究的谷歌公司，以及生产DNA测序仪的Thermo Fisher Scientific公司。后者的产品帮助中国建立少数民族基因数据库。",
			"date_added": 1549538983595
		},
		{
			"body": "@圣诞雪人_：我真的很害怕我们这一代人以后在历史书上被写为“阵痛”、“弯路”。",
			"date_added": 1549545265031
		},
		{
			"body": "贾巴大王：是的，就是这样的。历史书上轻飘飘的句子，后面都是上百万人的血汗和生命，你试着读读看：“在建设社会主义过程中我们走了一些弯路”，“三年自然灾害时期”，“计划经济的转型带来一些阵痛”，“供给侧改革”。傻白甜们不懂这些，他们认为世界上就三种人：我，我爱豆，一个卖大饼的。",
			"date_added": 1549545301573
		},
		{
			"body": "要崩了？中国资金大举出逃 德学者：对国家失去信心",
			"date_added": 1549796823689
		},
		{
			"body": "「天主教徒必须加入爱国会」：梵蒂冈反对中共对临时协议的解读",
			"date_added": 1549797177576
		},
		{
			"body": "立陶宛首次视中国为安全威胁 中国否认构成任何威胁",
			"date_added": 1549797286820
		},
		{
			"body": "美国南方司令部：在委内瑞拉的使命是救苦救难和保护美国人",
			"date_added": 1549797347511
		},
		{
			"body": "2019年2月8日上午无家可归的访民在北京拉条幅",
			"date_added": 1549798293514
		},
		{
			"body": "宁死不进新疆再教育营 哈萨克男机场割喉求救",
			"date_added": 1550044065633
		},
		{
			"body": "重磅！朋友圈私下换汇判刑 中国正式确认入刑门槛",
			"date_added": 1550044127123
		},
		{
			"body": "中共两会前 余文生妻上书人大要求放人",
			"date_added": 1550044197278
		},
		{
			"body": "共产主义垮台三十周年 蓬佩奥访欧遏制中俄影响",
			"date_added": 1550044229384
		},
		{
			"body": "两会还没到 全国截访人已进京 车站增警力",
			"date_added": 1550044295798
		},
		{
			"body": "北韓高層金昌善赴越南 籌備川金會 ",
			"date_added": 1550288961310
		},
		{
			"body": "兩韓將組聯隊 參加「東京奧運會」 ",
			"date_added": 1550288984920
		},
		{
			"body": "互联网严重不对等，美国为何没有提上谈判桌？",
			"date_added": 1550289032970
		},
		{
			"body": "就是要蓋美墨圍牆！川普宣布美國將進入緊急狀態 ",
			"date_added": 1550289116828
		},
		{
			"body": "加拿大近期接连发生中国留学生闹事的事件。他们在校园里语言攻击具有与中国官方价值观不同的藏人和维吾尔人。有分析人士告诉本台，中国意识形态通过留学生在西方国家传播，“战狼”现象迅速蔓延海外。",
			"date_added": 1550289301404
		},
		{
			"body": "薩爾瓦多，剛剛在2月3日總統大選中勝出的總統布格磊（Nayib Bukele）表示，前朝總統為利益與台灣斷交，轉投中共的行為不可接受。並去電美國安全顧問波頓，啇討關於强化美薩友誼、合作恢復委内瑞拉民主，以及聯手共同對抗中共掠奪。 2018年8月台薩斷交，盛傳中共以1,5億美元和3千噸稻米為條件，引誘薩爾瓦多與台灣當局斷交。",
			"date_added": 1550334856911
		},
		{
			"body": "批中共掠夺扩张 萨尔瓦多新总统望与美合作",
			"date_added": 1550805975486
		},
		{
			"body": "#彭培奥 谈中共侵略  归纳为以下几点 1 世界范围内扩张，对多个国家及其人民造成安全和隐私威胁 2 中共通过骗钱，债务陷阱等经济侵略方式威胁世界各国人民。例如：委内瑞拉，马来西亚，马尔代夫 3 贸易方面：中共不讲信用，既便有协议也不执行，中美目前在商讨强制执行措施",
			"date_added": 1550806068075
		},
		{
			"body": "赫鲁晓夫：我在收音机里曾听到有个外科医生如何在做手术之前要念一些毛的语录。看到人类尊严被践踏到如此地步，我简直要呕吐 -",
			"date_added": 1552788896738
		},
		{
			"body": "人权观察中国部主任在该组织英文网站撰文指出，中共在“敏感月”期间大张旗鼓以军事演练庆祝“解放西藏纪念日”，并指出中共在两会期间和《西藏日报》连续发文诋毁达赖喇嘛的这些举止，已表明其实他们害怕达赖喇嘛尊者的影响力，并表示这六十年以来，中共从未停止编造西藏的历史。",
			"date_added": 1553310299012
		},
		{
			"body": "国际声援西藏运动：中共干预达赖喇嘛转世明显违反宗教自由",
			"date_added": 1553310353179
		},
		{
			"body": "总部设在纽约的人权观察于昨天发布一项“抵制中共破坏国外学术自由”的十二点建议，让西方的学院、大学，以及教育机构参考，以应对中共当局对学术自由所造成的威胁。",
			"date_added": 1553310378760
		},
		{
			"body": " 流亡藏人在日内瓦抗议，呼吁联合国敦促中共同西藏重启和谈   流亡藏人在日内瓦抗议，呼吁联合国敦促中共同西藏重启和谈  【西藏之声2019年3月23日报道】联合国人权理事会第四十届会议于昨天结束，近百名藏人和援藏人士在日内瓦万国宫前举行抗议中共的活动。抗议者们呼吁联合国敦促中共同西藏重启和谈与关注西藏人权问题。",
			"date_added": 1553398088292
		},
		{
			"body": "中共女官淫贪不逊男 与40男有染狱中放倒所长",
			"date_added": 1553489409543
		},
		{
			"body": "大巴起火酿54死伤 参拜毛故居成死亡之旅",
			"date_added": 1553489452605
		},
		{
			"body": "来自美国教授的担忧：大数据下的微信让中国人无处可逃",
			"date_added": 1553489478088
		},
		{
			"body": "意大利让北京空欢喜？“签一路拒华为”内幕曝光",
			"date_added": 1553489522166
		},
		{
			"body": "美批中共谈判耍花招 川普暗示500亿关税永久保留",
			"date_added": 1553489556709
		},
		{
			"body": "捷克参议院通过131号决议案要求中共停止迫害",
			"date_added": 1553489663870
		},
		{
			"body": "山东药厂发生恶性事故 工作人员全部死亡",
			"date_added": 1555476308217
		},
		{
			"body": "微信重要通知：发较敏感信息者判刑",
			"date_added": 1555545232738
		},
		{
			"body": "张玉婧赴美前已知庄园活动取消 法官:证据很有力",
			"date_added": 1555545306235
		},
		{
			"body": "暗战不断 俄拟用军火合同撬走中共“巴铁”",
			"date_added": 1555545367594
		},
		{
			"body": "四国联合舰队穿越南海，中共政府隐瞒",
			"date_added": 1557725817470
		},
		{
			"body": "将以川普命名 以色列戈兰高地新社区动工",
			"date_added": 1557725915220
		},
		{
			"body": "穿越了？ 李文足信没寄出 狱中丈夫收到且回了信",
			"date_added": 1557725947146
		},
		{
			"body": "大陆个人所得税收锐减 “失业问题”浮现",
			"date_added": 1557725969901
		},
		{
			"body": "冲着中国人来 巴国酒店爆枪案危及70万华人",
			"date_added": 1557726080941
		},
		{
			"body": "美多名议员提法案 拟限制中国学生学者签证",
			"date_added": 1557914013061
		},
		{
			"body": " 川普拟签署行政令 部署全面封杀华为",
			"date_added": 1557915059192
		},
		{
			"body": "律师艰难会见吉林四平维权公民郭宏英",
			"date_added": 1557921119335
		},
		{
			"body": "山东微山县女访民上半年已两次“享受”中国特色人权",
			"date_added": 1557921181972
		},
		{
			"body": "徐琳词曲寻衅滋事案二审今开庭 维持一审3年有期徒刑",
			"date_added": 1557921203737
		},
		{
			"body": "苏州戈觉平案开庭结束 择日宣判 围观开庭无锡人权捍卫者沈爱斌遭暴力殴打",
			"date_added": 1557921223108
		},
		{
			"body": "为维护劳动权利受警告，张亮不服一审判决向南通中院上诉",
			"date_added": 1557921257073
		},
		{
			"body": "李文足:临沂监狱不让王全璋姐姐会见",
			"date_added": 1557921287510
		},
		{
			"body": "江林新城小区购房户向西安市政府讨要《房产证》",
			"date_added": 1557921321781
		},
		{
			"body": "戈觉平案即将开庭 街道办书记徐建良打伤戈的刑事案件9年无进展",
			"date_added": 1557921377996
		},
		{
			"body": "姚敏华：“一带一路”峰会维稳导致我丈夫王扣玛罹患严重肺炎",
			"date_added": 1557921400237
		},
		{
			"body": "失联两年的广东“举牌哥”刘辉被判2年 昨天刑满获释被送回陕西老家",
			"date_added": 1557921418404
		},
		{
			"body": "辽宁省朝阳市60多位老民办教师到市教育局上访",
			"date_added": 1557921455015
		},
		{
			"body": "福建人权捍卫者纪斯尊出狱后一直在重症监护室抢救 骨瘦如柴生命危殆",
			"date_added": 1557921487496
		},
		{
			"body": "自由作家马萧（原名谢强）被证实遭刑事拘留",
			"date_added": 1557921561342
		},
		{
			"body": "外媒：习要高官学毛泽东著作 对付贸易战",
			"date_added": 1557978321316
		},
		{
			"body": "华为大难临头？旗下70多家公司被列入美国黑名单",
			"date_added": 1557978339427
		},
		{
			"body": "美全新签证计划 大减亲属移民 废绿卡抽签",
			"date_added": 1557978367922
		},
		{
			"body": "美将华为列入出口黑名单 重击其运营",
			"date_added": 1557978401445
		},
		{
			"body": "川普签署行政令 华为中兴将被禁进入美国",
			"date_added": 1557978427504
		},
		{
			"body": "超级维稳下 北京“文明大会”响应寥寥显尴尬",
			"date_added": 1558050075844
		},
		{
			"body": "北京密令彻查藏传佛教 外媒：要下重手了",
			"date_added": 1558050096006
		},
		{
			"body": "三成重要零部件靠美国进口 制裁让华为陷极大困境",
			"date_added": 1558050138973
		},
		{
			"body": "谭笑飞：等死？找死？中共在贸易战中的两难选择",
			"date_added": 1558050185987
		},
		{
			"body": "川普宣布国家紧急状态 全面封锁华为",
			"date_added": 1558050232205
		},
		{
			"body": "禁令连锁反应 日本松下停止向华为出售组件",
			"date_added": 1558611923781
		},
		{
			"body": "美方愿意开放新一轮贸易谈判 但有一条件",
			"date_added": 1558611983476
		},
		{
			"body": "专家：中方若接受美谈判要求 将迎一片蓝天",
			"date_added": 1558611996426
		},
		{
			"body": "专家：中共经济“核选项”对美不构成威胁",
			"date_added": 1558612075700
		},
		{
			"body": "反习势力杀气腾腾要煮鹤 习近平被迫应战高调行动 川普重启谈判有唯一条件",
			"date_added": 1558612106612
		},
		{
			"body": "江系反扑拿下习近平重臣 中共180度大转弯求川普接着谈",
			"date_added": 1558612129501
		},
		{
			"body": "周晓辉：北京再高调“抗美” 危机加速",
			"date_added": 1558612176286
		},
		{
			"body": "在经济与煽动舆论中走钢丝 中共骑虎难下",
			"date_added": 1558612194526
		},
		{
			"body": "中共要民众不要物价一涨就骂娘 遭网友臭骂",
			"date_added": 1559043119652
		},
		{
			"body": "“早该有心理准备被美反”网帖大陆热传",
			"date_added": 1559043143931
		},
		{
			"body": "热评：苏联崩溃晚清灭亡各类前兆 中共全应验",
			"date_added": 1559043185762
		},
		{
			"body": "中共“沉船计划”曝光 近9成高层拟弃官逃跑",
			"date_added": 1559043207740
		},
		{
			"body": "华为库存已告急？向韩国求援内幕曝光",
			"date_added": 1559043250603
		},
		{
			"body": "中共沉船计划曝光 /副国级被快速处死",
			"date_added": 1559043330282
		},
		{
			"body": "美国国务卿迈克·蓬佩奥（Mike Pompeo）周五（5月31日）访问德国时警告说，美国公开提醒了华为的风险性，各国自行决定是否与华为合作。对于那些选择与华为合作的国家，美国不得不限制与他们分享信息。此外，蓬佩奥在新闻会上首次明确指出，美国在华为问题上的两大政策。",
			"date_added": 1559402072150
		},
		{
			"body": "针对总统蔡英文强烈回击中共“一国两制台湾方案”被指挑衅对岸，台北市长柯文哲认为，蔡“什么都不要讲就好”。对此，蔡英文31日表示，身为总统，凡触及台湾人民利益的底线，都必须站出来讲清楚，以免让国际社会误判。",
			"date_added": 1559402149179
		},
		{
			"body": "民进党总统参选人赖清德31日到台南“快乐电台”接受专访，他自许为台湾自主的工作者，主张台湾是个主权独立国家，才是解决台湾未来前途正确的一条道路，台湾自主人民才会幸福，未来进一步协助中国民主化，才能确保台湾永久和平。",
			"date_added": 1559402196624
		},
		{
			"body": "前中共央行行长戴相龙31日表示，即使川普总统和习近平在下月举行的G20峰会期间会晤，双方也难以在结束中美贸易战问题上取得重大进展。",
			"date_added": 1559402247467
		},
		{
			"body": "六四前夕中共恐慌 全国多地做断网测试 今年是“六四”三十周年，世界各地的纪念活动层出不穷，目前中美贸易战也全面升级，中共政权极度恐惧，开始在全国多地测试断网以应对未来的紧急状况。网民担心与外界隔绝的时代快来了。",
			"date_added": 1559567861871
		},
		{
			"body": "美国与中共两方的国防部长，在亚洲出席年度安全会议“香格里拉对话”。美国国防部代理部长夏纳翰公开向中共喊话，停止侵蚀他国主权，并说，会持续支持台湾，使台湾人民能够决定自己的未来。",
			"date_added": 1559569268472
		},
		{
			"body": "中共扫黑扫到幼儿园？5月28号，江苏无锡市的新光幼儿园，竟将校内的400名幼童列为“扫黑除恶专项”的调查对象，工作表还在网上传开，引发网友质疑，很多人认为幼儿成为排查对象很荒谬。",
			"date_added": 1559569328947
		},
		{
			"body": "继贸易战之后 专家：美或另起三战场 美中贸易战持续升级，外界关心美国的下一个战场会在哪里。台湾智库咨询委员董立文分析，当前的国际局势显示，美国总统川普正在组建一支反共的科技战国际联盟，而攸关美中货币价值的金融战也已续势待发，如果中共在对美国农产品进行报复，美国也不排除会发动粮食战。",
			"date_added": 1559569676617
		},
		{
			"body": "中共大外宣CGTN女主播刘欣的国籍连日来成为中国网络的关注点，就在刘欣6月1日回应称“自己没有任何其他国家的国籍”之后，立刻有人搜出刘欣老板徐兆群的讲话，“刘欣是瑞士籍的土耳其人”。",
			"date_added": 1559570188301
		},
		{
			"body": "此外，也有网民搜索发现了刘欣微博上贴出的一张在瑞士的驾照。",
			"date_added": 1559570341209
		},
		{
			"body": "刘欣还在微博上留言称，“爱不爱国和国籍根本无关”。刘欣甚至在采访中说：“要想黑我，来点新的行吗？”  大陆网友果然迅速回应了。微博上贴出了老板CGTN主编徐兆群的说法，证实刘欣是瑞士籍后，网友热议：“有空回应一下浙大那篇文章！”还有网友给出一个新名词“离岸爱国主义者”。",
			"date_added": 1559570572654
		},
		{
			"body": "欧美18国举行联合军演 8600名士兵参与 由欧美多国参与的年度联合军事演习“波罗的海行动”（Baltic Operations），于星期天（6月9日）在德国港口城市基尔（Kiel）展开，将持续到21日为止。今年有18个国家参与该演习，动员几十艘船舰与士兵8,600人，可谓规模庞大、阵容坚强。",
			"date_added": 1560075371231
		},
		{
			"body": "《财经》与新华社不同调 中共内部博弈白热化 对于中美贸易战，《财经》杂志近日发表社评，称“要警惕极端民族主义”“自我封闭，另起炉灶”，否则“会正中某些势力的下怀”。随后中共新华社似乎针锋相对地发表署名文章，矛头直指“投降派”，该文被认为是“暗有所指”。",
			"date_added": 1560075937109
		},
		{
			"body": "在美中贸易战、国内产量下降的情况下，中国的玉米价格飘升致4年来高点。另外，据中共官方发布的《2019年5月中国农产品供需形势分析》显示，新年度玉米供需缺口达2,570万吨。",
			"date_added": 1560075983935
		},
		{
			"body": "美国会通过393号决议案 吁中共尊重人权 6月4日，美国国会就393号决议案表决，获得全票通过。393号议案支持1989年天安门学生运动，关切受难者及其家庭，要求中共政府承担责任，停止审查六四相关信息，并保证流亡学生回国的安全。",
			"date_added": 1560076069472
		},
		{
			"body": "大撒币失策 北京喊停哈萨克一带一路项目",
			"date_added": 1560076520675
		},
		{
			"body": "传中共党内吵翻天 四中全会更难产",
			"date_added": 1560081196390
		},
		{
			"body": "当着习近平的面 普京表示要坐山观虎斗",
			"date_added": 1560081223539
		},
		{
			"body": "习近平访俄险些跌落台下",
			"date_added": 1560081317662
		},
		{
			"body": "习近平突发状况！普京表情耐人寻味",
			"date_added": 1560081366803
		},
		{
			"body": "周一（6月10日）中午，美国总统川普（特朗普）表示，如果月底在G20峰会期间没有与中国国家主席达成贸易协议，他已准备好要对更多中国商品征收惩罚性关税。",
			"date_added": 1560217322706
		},
		{
			"body": "拒发签证 美国采取实质行动制裁邪恶 美国这一实质性举动将对他们产生极大震慑——在中共与个人及亲属的自由之间，他们必须做出选择！他们不可能在中国犯罪而梦想着到海外逃之夭夭。",
			"date_added": 1560217455440
		},
		{
			"body": "川普：美中必达协议 因北京必须“这么做” 美国总统川普（特朗普）周一表示，他相信北京将与美国达成协议，因为“他们不得不这么做”。",
			"date_added": 1560217567995
		},
		{
			"body": "美国联邦调查局FBI、美军印太司令部、中华民国法务部调查局，合办FBI国家学院校友复训研习，是台湾的第一次。今天开幕典礼，中华民国总统出席致词。参加的美国FBI助理局长，是FBI历来访台的最高层级。",
			"date_added": 1560217700242
		},
		{
			"body": "美国政府近日表示将严审人权恶棍入境，并告知宗教信仰团体提交迫害者名单，外界认为可能是美国将对中共发动人权战的讯号。对此，淡江大学整合战略科技中心执行长苏紫云表示，人权、民主与自由市场三者密不可分，美国发动贸易战、科技战与军事升温都只是手段，“人权”才是美国真正的目标。",
			"date_added": 1560217770220
		},
		{
			"body": "香港酿更大风暴 民阵发起周日大游行吁三罢",
			"date_added": 1560494755130
		},
		{
			"body": "反送中全港罢课 港人蜂拥提美金5万都困难",
			"date_added": 1560494805915
		},
		{
			"body": "港府血腥镇压 震惊国际社会",
			"date_added": 1560494920307
		},
		{
			"body": "南京市政协原主席自杀身亡 曾是罗志军大秘",
			"date_added": 1560495006751
		},
		{
			"body": "美媒：中共武警已便装抵港 装甲车集结港珠澳大桥",
			"date_added": 1560495029244
		},
		{
			"body": "美推《香港人权与民主法案》 可冻结侵犯港民人权者财产",
			"date_added": 1560495100838
		},
		{
			"body": "6.16大游行 近2百万港人怒吼“撤回恶法 林郑下台”",
			"date_added": 1560734083865
		},
		{
			"body": "香港大规模抗议之际 另一网络战在大陆展开",
			"date_added": 1560827381270
		},
		{
			"body": "香港200万民众上街 北京地铁站严查手机",
			"date_added": 1560827412502
		},
		{
			"body": "独立人民法庭伦敦终审判决 裁定中共犯下反人类罪行",
			"date_added": 1560827439216
		},
		{
			"body": "香港风波未平 习近平上台首访朝鲜 这张牌也会臭吗",
			"date_added": 1560827473456
		},
		{
			"body": "习近平宣布访朝话音刚落 中朝边境爆炸引发地震",
			"date_added": 1560827519611
		},
		{
			"body": "习近平G20前 川普备好下马威？王岐山和彭斯通话斡旋遭拒",
			"date_added": 1560827667087
		},
		{
			"body": "中南海慌了？法媒：香港翻天覆地 中国一片死寂",
			"date_added": 1560827701496
		},
		{
			"body": "香港罢工罢课“反送中” 促林郑下台",
			"date_added": 1560827739164
		},
		{
			"body": "党媒造假港人反美大游行 网民怒轰太无耻",
			"date_added": 1560827826928
		},
		{
			"body": "美官员:若中共军警入港镇压 美即实施制裁",
			"date_added": 1560827859712
		},
		{
			"body": "中共邀塔利班恐怖组织访华 意欲何为？",
			"date_added": 1561204984210
		},
		{
			"body": "专家：香港的示威活动已绑住中共的双臂",
			"date_added": 1561205012352
		},
		{
			"body": "G20前期会遭19国反对 北京陷孤立",
			"date_added": 1561205036760
		},
		{
			"body": "美国发布2018年度宗教自由报告 中共一邪恶宣传破产",
			"date_added": 1561205070929
		},
		{
			"body": "习近平承诺大力援朝 川普立即对朝采取行动",
			"date_added": 1561205117744
		},
		{
			"body": "怕香港示威“传染” 网传广东进入戒备状态",
			"date_added": 1561205163256
		},
		{
			"body": "全世界都在看他笑话?有人劝习：再不回头万事休",
			"date_added": 1561205260289
		},
		{
			"body": "蓬佩奥批中共以神自居",
			"date_added": 1561205298538
		},
		{
			"body": "又一禁令 美对多家中国科技公司祭出口管制",
			"date_added": 1561205333661
		},
		{
			"body": "香港大亨暗助“反送中” 鼓励员工：工资照发",
			"date_added": 1561205352911
		},
		{
			"body": "港人为何反送中？王全璋遭遇让你看懂原因",
			"date_added": 1561205377714
		},
		{
			"body": "穿越？湖北厅官夫人被误当上访者 6警围殴16分钟",
			"date_added": 1561205410820
		},
		{
			"body": "中共内斗加剧 李源潮被自杀",
			"date_added": 1561641332797
		},
		{
			"body": "前所未有 官场弥漫末日气氛 习近平亲自安抚",
			"date_added": 1561641358567
		},
		{
			"body": "川普:若对伊开战 无需地面部队战争很快结束",
			"date_added": 1561641464808
		},
		{
			"body": "川普：与习近平谈不成 即刻加税并考虑两国贸易-零贸易可能",
			"date_added": 1561641521707
		},
		{
			"body": "究竟是谁下令封了李克强的大学同学群",
			"date_added": 1561641545484
		},
		{
			"body": "美网攻伊朗致其导弹系统瘫痪 警示中共？",
			"date_added": 1561641576903
		},
		{
			"body": "G20川习会 川普只给习近平1个半小时",
			"date_added": 1561641668462
		},
		{
			"body": "习近平对美撤回悔棋",
			"date_added": 1561985283903
		},
		{
			"body": "金正恩想“了结历史旧账”？川金三会细节曝光",
			"date_added": 1561985308680
		},
		{
			"body": "惊人逆转 北京跟不上节奏 一步错步步错“自降筹码”",
			"date_added": 1561985328688
		},
		{
			"body": "香港七一游行 特战队全出动罕见无编号 持盾戒备",
			"date_added": 1561985357921
		},
		{
			"body": "中国代表团让习近平难堪 G20峰会上多次集体迟到",
			"date_added": 1561985390040
		},
		{
			"body": "部分抗议者击立法会 撞破玻璃门",
			"date_added": 1561985429997
		},
		{
			"body": "空拍七一大游行 人潮塞爆车道",
			"date_added": 1561985458679
		},
		{
			"body": "香港七一游行浩浩荡荡 游行队伍和平理性",
			"date_added": 1561985475248
		},
		{
			"body": "港民再上街抗恶法 中共严防事态辐射大陆",
			"date_added": 1561985492685
		},
		{
			"body": "李源潮自杀传闻不寻常 知情者指他心“早就死了”",
			"date_added": 1561985715896
		},
		{
			"body": "新疆下“血本”吸引外地人落户 知情者冒死发视频忠告",
			"date_added": 1561987025997
		},
		{
			"body": "激烈冲突下 港民七一冲进立法会",
			"date_added": 1562000371962
		},
		{
			"body": "大陆官媒全力抹黑香港示威 民间：和平示威典范",
			"date_added": 1562331305560
		},
		{
			"body": "香港亲北京政商界人士罕见提出重启政改",
			"date_added": 1562331334423
		},
		{
			"body": "英国强硬挺香港 批北京不守承诺",
			"date_added": 1562331358767
		},
		{
			"body": "上海富豪猥亵9岁女 更多恐怖黑幕被揭",
			"date_added": 1562331379547
		},
		{
			"body": "美中贸易战的4个获益国家 台湾上榜",
			"date_added": 1562331395678
		},
		{
			"body": "香港可能有迹象成为习近平的滑铁卢",
			"date_added": 1562331433438
		},
		{
			"body": "英国不排除制裁中共的可能性",
			"date_added": 1562331482941
		},
		{
			"body": "英外长:不排除驱逐中共外交官",
			"date_added": 1562331516920
		},
		{
			"body": "美国独立日展示全新武器 川普：我们是神的子民",
			"date_added": 1562331589958
		},
		{
			"body": "“川习会”后向美示好？中国首次进口美国大米",
			"date_added": 1562331613667
		},
		{
			"body": "党的大红人蹂躏幼女 贵州孤儿院有关？红黄蓝呢？",
			"date_added": 1562331642695
		},
		{
			"body": "湖北万人抗议遭镇压 民众：共产党两三年就完蛋",
			"date_added": 1562331671205
		},
		{
			"body": "美国耗时7年破获中共科技间谍大案",
			"date_added": 1562331693474
		},
		{
			"body": "官媒歪曲报导反送中 中共被指故意误导国人",
			"date_added": 1562331716410
		},
		{
			"body": "多少大陆民众信官方香港报导？学者:中共自己都不信",
			"date_added": 1562579128134
		},
		{
			"body": "前美驻港总领事警告中共：若军队镇压香港会很丑陋",
			"date_added": 1562579140620
		},
		{
			"body": "重磅！川普首次将台湾列为民主伙伴 破历届总统几十年政策",
			"date_added": 1562579167697
		},
		{
			"body": "港媒:川普香港牌引而不发 林郑成港金融最大灰犀牛",
			"date_added": 1562579198591
		},
		{
			"body": "港府秋后算账激化民意？专家：反送中是价值观之争",
			"date_added": 1562579243058
		},
		{
			"body": "香港恐失政经独立性 国际评级穆迪示警",
			"date_added": 1562579271914
		},
		{
			"body": "三峡大坝变形曝光后 景区停接游客",
			"date_added": 1562579295644
		},
		{
			"body": "亨特再表支持香港 不排除制裁中国",
			"date_added": 1562579417884
		},
		{
			"body": "遭英外相强硬反击 中共大使转口风：无意打外交战",
			"date_added": 1562579449643
		},
		{
			"body": "传杨恒均大五毛妻子染香被带走 出境时被拒",
			"date_added": 1562579482610
		},
		{
			"body": "长三角店铺现歇业潮 深圳老牌电子厂突倒闭",
			"date_added": 1562579504396
		},
		{
			"body": "三峡大坝出事故国务院封锁消息 层次转包偷工减料贪腐不断 修补全民掏钱",
			"date_added": 1562823349498
		},
		{
			"body": "全球供应链将洗牌 利丰CEO：中国工厂陷危机",
			"date_added": 1562823372167
		},
		{
			"body": "北汽集团高层桃色丑闻曝光",
			"date_added": 1562823468687
		},
		{
			"body": "白宫透露5月贸易谈判破局内情 中共拒修法",
			"date_added": 1562823486309
		},
		{
			"body": "消息：中共害怕九龙大游行引爆危机",
			"date_added": 1562823515677
		},
		{
			"body": "神的呼唤！川普带领美国回归伟大",
			"date_added": 1562823538264
		},
		{
			"body": "习受压对川普大选态度两极 内部曝高层分裂旁徨消极 美促兑现承诺",
			"date_added": 1562823630734
		},
		{
			"body": "中国工厂临存亡\"紧张和绝望\" 白宫透露5月谈判破局内幕",
			"date_added": 1562823654805
		},
		{
			"body": "路透称林郑下台或成定局 观察家:辞职将在9月前",
			"date_added": 1562823744972
		},
		{
			"body": "三峡大坝变形？专家：坝底到处是洞穴",
			"date_added": 1562823760424
		},
		{
			"body": "传北京命林郑紧急开会 驻港部队放风另有目的",
			"date_added": 1562823783174
		},
		{
			"body": "美高层见港媒老板释信号 北京色厉内荏",
			"date_added": 1562823811369
		},
		{
			"body": "港台成反共前线 美大动作敲北京",
			"date_added": 1562823843812
		},
		{
			"body": "香港抗争焦点转移 “连侬墙”遍地开花",
			"date_added": 1562823859948
		},
		{
			"body": "习近平要官员提高政治站位 泄何秘密",
			"date_added": 1562823876679
		},
		{
			"body": "贸易战激励中国商界翻墙",
			"date_added": 1563018358629
		},
		{
			"body": "李锐死后被抄家 全部书稿被抢走",
			"date_added": 1563018374674
		},
		{
			"body": "中共发布紧急级别海上安全警告引发疑虑",
			"date_added": 1563018435058
		},
		{
			"body": "川普批中共2手段对抗 债务危机加深 国企强迫买债券",
			"date_added": 1563018458926
		},
		{
			"body": "于溟：“709”律师的伟大人性光辉是最黑暗时期的灯塔",
			"date_added": 1563018494437
		},
		{
			"body": "法媒：中共外交部变成“中外关系破坏部”",
			"date_added": 1563018568596
		},
		{
			"body": "蔡英文纽约举行晚宴 美政商界人士挤满现场",
			"date_added": 1563018594808
		},
		{
			"body": "港人持续反送中 发起光复上水游行",
			"date_added": 1563018626949
		},
		{
			"body": "三峡大坝真会出大事！竟然没验收！这个核弹什么时候炸？",
			"date_added": 1563018750759
		},
		{
			"body": "北戴河会期到 习两难 中共旧难新祸难招架 5大议题各个摆不平",
			"date_added": 1563018772282
		},
		{
			"body": "等待川普下台？专家：对中国来说风险很大",
			"date_added": 1563019108087
		},
		{
			"body": "反送中 香港7.14沙田游行",
			"date_added": 1563019128116
		},
		{
			"body": "专家谈三峡大坝变形：将有特大灾难发生",
			"date_added": 1563019155870
		},
		{
			"body": "北戴河保卫习近平？台媒：北京已无暇顾及蔡英文",
			"date_added": 1563019178924
		},
		{
			"body": "中国对外贸易锐减 经济前景晦暗",
			"date_added": 1563019216124
		},
		{
			"body": "贸易战延烧 中国进出口双降 内需萎缩严重",
			"date_added": 1563019241150
		},
		{
			"body": "蔡英文在美国哥伦比亚大学发表演讲",
			"date_added": 1563019273945
		},
		{
			"body": "北京朝阳多个小区爆发诺如病毒 原因不明",
			"date_added": 1563256190504
		},
		{
			"body": "香港爆流血冲突 港人质问林郑龟缩 警棍治港",
			"date_added": 1563256217735
		},
		{
			"body": "香港示威遍地开花 北京骑虎难下",
			"date_added": 1563256242743
		},
		{
			"body": "中国经济增速创新低 专家：情况远未触底",
			"date_added": 1563256274000
		},
		{
			"body": "秦光荣私生活混乱 怀孕情妇找到市委大院",
			"date_added": 1563256306665
		},
		{
			"body": "中共军方密集演练 筹备大规模“政治任务”",
			"date_added": 1563256334812
		},
		{
			"body": "反送中升级反中共 香港11所大学发表联合声明",
			"date_added": 1563256350156
		},
		{
			"body": "北戴河会前四重危机 习再告诫高层防政治风险",
			"date_added": 1563256410571
		},
		{
			"body": "任志强又开炮 批中共花钱“买非洲留学生”",
			"date_added": 1563256435801
		},
		{
			"body": "中国高校为外国留学生配异性学伴内情流出 ",
			"date_added": 1563256463758
		},
		{
			"body": "中共宣传战 败给川普 渐失国际话语权",
			"date_added": 1563256498553
		},
		{
			"body": "川普：用史上最严厉行动 对抗中共不公贸易",
			"date_added": 1563256518406
		},
		{
			"body": "港警自白：政府无能 高层推我们去送死！",
			"date_added": 1563360304615
		},
		{
			"body": "400条河超警戒线湘江决堤 中国多地被淹官媒沉默",
			"date_added": 1563360350275
		},
		{
			"body": "中共官场内幕：都佩服川普，很多人想跑",
			"date_added": 1563360434490
		},
		{
			"body": "川普谈贸易战：仍可对3250亿中国商品加税",
			"date_added": 1563360462860
		},
		{
			"body": "中国经济放缓 除贸战还有更大原因",
			"date_added": 1563360476446
		},
		{
			"body": "效仿王立军叛逃？吉林省公安副厅长落马",
			"date_added": 1563539771334
		},
		{
			"body": "习近平“梦碎”十九大 与江派两场交易被曝光",
			"date_added": 1563539796452
		},
		{
			"body": "美欧日和大陆公司加快从中国出走 中共急了",
			"date_added": 1563539814830
		},
		{
			"body": "白宫警告土共走上苏联崩溃之路 请中国人民为自由保重",
			"date_added": 1563540468715
		},
		{
			"body": "美国总统川普说，美军18日在霍尔木兹海峡，也就是台湾所称的荷莫兹海峡，击落一架距离美国海军军舰，不超过1000码的伊朗无人机。",
			"date_added": 1563579198034
		},
		{
			"body": "江系香港媒体《南华早报》引述未具名的人士透露，目前的6轮海试状况显示，“002型”航母尚未达到“初始作战能力”，因而没有被列在中共十一庆典的武器清单上。",
			"date_added": 1563579441565
		},
		{
			"body": "欧洲议会制定决议吁港府撤回修例，中共恼羞成怒扯内政   ",
			"date_added": 1563717754262
		},
		{
			"body": "华为暗中助朝鲜建无线网？川普：必须查明",
			"date_added": 1563853725159
		},
		{
			"body": "川普警告起作用？中方考虑增购美国大豆",
			"date_added": 1563853739597
		},
		{
			"body": "黑帮恐袭元朗45伤 民主派谴责“警黑勾结”",
			"date_added": 1563853770369
		},
		{
			"body": "北戴河内斗开启？传海陆空全面警戒 安检史上最严",
			"date_added": 1563853806756
		},
		{
			"body": "香港警黑勾结犯众怒 港民吁建民卫队 众网友响应",
			"date_added": 1563853835069
		},
		{
			"body": "贸易战北京放软？询价美农产品",
			"date_added": 1563853858472
		},
		{
			"body": "香港暴力事件震惊国际 美国国务院发表声明",
			"date_added": 1563853888599
		},
		{
			"body": "美媒：无视美制裁 大量伊朗石油仍运往中国",
			"date_added": 1563853980294
		},
		{
			"body": "逾500名港公务员连署批特首 史无前例",
			"date_added": 1564190962662
		},
		{
			"body": "长江流域告急 洪水超警戒线 三峡大坝再惹议",
			"date_added": 1564191009910
		},
		{
			"body": "中联办元朗动员视频曝光 何君尧向同僚发死亡威胁",
			"date_added": 1564191031175
		},
		{
			"body": "港警中联办清场开84枪 包括24发可致命海绵弹",
			"date_added": 1564191048551
		},
		{
			"body": "7.27游行被禁 上诉失败 钟健平：一个人也去游行",
			"date_added": 1564191168105
		},
		{
			"body": "中共稀土威胁 促美澳日组成稀土产业联盟",
			"date_added": 1564390549587
		},
		{
			"body": "中共各大银行大举发行永续债 背后藏风险",
			"date_added": 1564390593358
		},
		{
			"body": "决裂中共 港人按条约主权归中华民国",
			"date_added": 1564390608799
		},
		{
			"body": "【直击728】港警狂射逾百催泪弹 硝烟弥漫",
			"date_added": 1564390649445
		},
		{
			"body": "中国经济三大支柱已全断",
			"date_added": 1564390700170
		},
		{
			"body": "中联办被罩水晶棺？网友嘲讽：不是好兆头",
			"date_added": 1564390742295
		},
		{
			"body": "香港怒潮漫延政界 公务员申请集会：与民同行",
			"date_added": 1564390764617
		},
		{
			"body": "港人发起8月5日全港三大罢、七区集会",
			"date_added": 1564390790360
		},
		{
			"body": "玻璃棺材？中联办国徽戴“罩”网友讥讽",
			"date_added": 1564390807224
		},
		{
			"body": "港人再次包围中联办 抗议者正将怒火转向中共",
			"date_added": 1564390845366
		},
		{
			"body": "美中上海会谈结束 双方同意九月再次会面",
			"date_added": 1564647751688
		},
		{
			"body": "中国忠旺亿万富翁被美国起诉 涉逃税18亿",
			"date_added": 1564647768160
		},
		{
			"body": "王全璋身体极度堪忧 李文足申请保外就医",
			"date_added": 1564647799295
		},
		{
			"body": "中共突叫停台湾自由行 被指又一蠢招",
			"date_added": 1564647834721
		},
		{
			"body": "中国猪肉价创6年新高 涨幅或超70%",
			"date_added": 1564647858683
		},
		{
			"body": "中美贸易谈判提前结束 美中声明2大不同1个交集",
			"date_added": 1564647883035
		},
		{
			"body": "猪年画猪也有罪？安徽22岁才女被抓引热议",
			"date_added": 1564647919542
		},
		{
			"body": "香港中资员工也要罢工：不怕打烂饭碗，无惧秋后算账",
			"date_added": 1564647943984
		},
		{
			"body": "新疆再教育营内幕再曝光 汉族人也遭羁押",
			"date_added": 1564647985095
		},
		{
			"body": "北京两大危机难解 无奈靠王沪宁煽情",
			"date_added": 1564902957415
		},
		{
			"body": "新关税打乱北京部署 媒体:川普时间快过北戴河",
			"date_added": 1564902975674
		},
		{
			"body": "市值蒸发80亿 中国内衣大王3年关店千家",
			"date_added": 1564902997827
		},
		{
			"body": "港议员黄碧云 吁市民罢工施压政府",
			"date_added": 1564903024802
		},
		{
			"body": "旺角再游行 演变黄大仙冲突",
			"date_added": 1564903062043
		},
		{
			"body": "香港83旺角大游行 警察反被市民包围",
			"date_added": 1564903095845
		},
		{
			"body": "港人为生命而战 中共施暴未得逞 反陷尴尬",
			"date_added": 1564903119787
		},
		{
			"body": "香港示威者拆下中共五星旗 丢进海里",
			"date_added": 1564903149208
		},
		{
			"body": "香港多家航空电台支持8·5罢工 银行施行弹性上班",
			"date_added": 1564903172466
		},
		{
			"body": "反送中抗争现奇景 黄大仙居民群起驱赶港警出市区",
			"date_added": 1564903288364
		},
		{
			"body": "新关税打疼中共 新闻联播罕见跳脚5连发",
			"date_added": 1564903309760
		},
		{
			"body": "生产线大量移出中国 Levi's股价上扬",
			"date_added": 1564903347530
		},
		{
			"body": "港各界响应大三罢 八区集会“不合作”遍地开花",
			"date_added": 1564971648124
		},
		{
			"body": "中美专家谈贸战:川普枪指中共头 协议可能性为零",
			"date_added": 1564971660613
		},
		{
			"body": "十数万港民“似水”多点示威 警伤将军澳街坊惹众怒",
			"date_added": 1564971682256
		},
		{
			"body": "专家：人民币破7 加速中国金融风暴",
			"date_added": 1565257432087
		},
		{
			"body": "周晓辉：中美脱钩趋势已显 北戴河高层难应对",
			"date_added": 1565257445657
		},
		{
			"body": "贸易战升级 神秘买家购买大批美国大豆",
			"date_added": 1565257475455
		},
		{
			"body": "北戴河会议期间 中共内外交困",
			"date_added": 1565257513294
		},
		{
			"body": "美国酝酿制裁9名中共高官 含政治局委员陈全国",
			"date_added": 1565257535073
		},
		{
			"body": "川普：必须对中共强硬",
			"date_added": 1565257556885
		},
		{
			"body": "传福建黑帮 8日组团赴港打人 一天1200元",
			"date_added": 1565257576161
		},
		{
			"body": "贸易战冲击对美出口 中共的自贸谈判多碰壁",
			"date_added": 1565257602686
		},
		{
			"body": "法媒：习近平误判连连 中国卷入更凶恶厮杀",
			"date_added": 1565257630723
		},
		{
			"body": "港澳办恐吓港人 专家：中共不敢出兵",
			"date_added": 1565257656677
		},
		{
			"body": "外媒：若军队入港 恐现三个灾难性后果",
			"date_added": 1565257666992
		},
		{
			"body": "利奇马台风重创浙江 致22死 417万人受灾",
			"date_added": 1565473546893
		},
		{
			"body": "拒绝中共无理要求 德联邦代表团取消访华",
			"date_added": 1565473569005
		},
		{
			"body": "港人8‧10反送中 入夜打游击",
			"date_added": 1565473599978
		},
		{
			"body": "华为生机渺茫？川普叫停其出口许可审批",
			"date_added": 1565473623470
		},
		{
			"body": "人民币下一关？日美投行预测 中国经济靠四张卡快刷光 北京接着贬 川普白宫有强招",
			"date_added": 1565473666560
		},
		{
			"body": "8.10现场 尖沙嘴 观塘警民对峙",
			"date_added": 1565473702662
		},
		{
			"body": "港警公开信:警队情绪近崩溃 吁独立调查",
			"date_added": 1565473726482
		},
		{
			"body": "美国务院再批中共：长期不兑现承诺",
			"date_added": 1565473752625
		},
		{
			"body": "8.10尖沙嘴警署被围 警放催泪弹",
			"date_added": 1565473770659
		},
		{
			"body": "港警如“过街老鼠” 购物中心接连贴告示禁入内",
			"date_added": 1565612466450
		},
		{
			"body": "香港拉警报 防武警黑帮侵袭",
			"date_added": 1565612496515
		},
		{
			"body": "防暴警喷雾遭市民愤怒击退 场面激烈",
			"date_added": 1565612511781
		},
		{
			"body": "陈破空：北戴河风声：元老反对动武香港 两派都不满习近平 又有多国与墙国翻脸",
			"date_added": 1565612546393
		},
		{
			"body": "警方暴力执法 香港各界怒吼 国际组织谴责",
			"date_added": 1565612564118
		},
		{
			"body": "新唐人记者直播反送中 疑遭亲共分子袭击",
			"date_added": 1565612576462
		},
		{
			"body": "不向暴力低头 香港11所大学无限期罢课",
			"date_added": 1565612592079
		},
		{
			"body": "中共经济正在崩盘 无余地回光返照",
			"date_added": 1565612616294
		},
		{
			"body": "郭文贵大爆北戴河会议内幕：中共忧心撑不到明年",
			"date_added": 1565612638748
		},
		{
			"body": "港警暴力升级如中共武警 无差别攻击惹质疑",
			"date_added": 1565612669543
		},
		{
			"body": "香港“百万人塞爆机场” 声援被打爆眼球少女",
			"date_added": 1565612682952
		},
		{
			"body": "8.11游行遭武力清场 港岛九龙警黑暴力升级",
			"date_added": 1565612733246
		},
		{
			"body": "8.12机场集会 至少230航班取消",
			"date_added": 1565612747600
		},
		{
			"body": "北戴河会议期间，中共现任高层与政治元老弩张剑拔，在香港问题上出现拉据战，在不能达成共识的情况下，温家宝撂下一句话。",
			"date_added": 1565867921242
		},
		{
			"body": "\t 【精彩推荐】川普约习解危局 /温家宝撂下重话 【精彩推荐】川普约习解危局 /温家宝撂下重话 北京时间：2019-08-15 05:19  【新唐人北京时间2019年08月15日讯】新唐人为读者推荐每日精彩文章和视频节目：  川普欲晤习近平：想达协议 先人道解决香港问题",
			"date_added": 1565867938717
		},
		{
			"body": "香港国际机场日前发生抗议民众怒打2名中共卧底事件，据悉，被打的一名中共卧底随身携带一件“我❤香港警察”的蓝色T恤，与日前在荃湾持刀砍伤示威者的“蓝衣黑帮”同款，瞬间点燃现场民众怒火，高吼“黑社会！黑社会！”。据医护人员透露，此前在荃湾被黑社会袭击的示威者，手筋、脚筋都被挑断，招致香港示威者异常愤怒，才引发了机场怒打中共卧底的一幕。",
			"date_added": 1565867997386
		},
		{
			"body": "14日凌晨，党媒《环球时报》记者付国豪在香港机场被殴打，成为中共重点炒作对象。不过外界质疑这是中共导演的苦肉计。港人发现他疑似拥有双重身份，没有记者证却在香港超期停留，违法工作，怀疑他有中共国安背景。",
			"date_added": 1565868018606
		},
		{
			"body": "周二的香港国际机场集会上，两名疑似来自大陆的中共公安在现场鬼鬼祟祟，并且给示威者近距离拍照，引发示威者将他们围堵。",
			"date_added": 1565868048483
		},
		{
			"body": "继“百万人塞爆机场”抗议之后，香港民众又在网上发起816“银行大挤兑”活动，呼吁参与反送中抗议的200万民众8月16日到香港银行提取出美元。",
			"date_added": 1565868073300
		},
		{
			"body": "港府派191亿收买人心 港人旋即捐给示威者",
			"date_added": 1566135831680
		},
		{
			"body": "中共屯兵深圳 欧盟加拿大联合声明警告",
			"date_added": 1566135853435
		},
		{
			"body": "8.18港人启动流水式集会",
			"date_added": 1566135900796
		},
		{
			"body": "8.18大集会 政界、教育界和医疗界齐发声",
			"date_added": 1566135940952
		},
		{
			"body": "818香港大游行 抗议警黑乱港",
			"date_added": 1566135959808
		},
		{
			"body": "无惧风雨挤爆维园 港人齐心反送中",
			"date_added": 1566135991230
		},
		{
			"body": "8.18维园流水式大集会 人山人海",
			"date_added": 1566136023045
		},
		{
			"body": "陈破空：贸易战大升级 习近平冒险一搏 川普快速反击 美舰挺进台海 蔡英文巡视金门",
			"date_added": 1566698395366
		},
		{
			"body": "香港700电影人登报反对警暴 重申五大诉求",
			"date_added": 1566698415508
		},
		{
			"body": "美军舰泊台湾挂青天白日北京沉默",
			"date_added": 1566698484126
		},
		{
			"body": "央妈大放水也救不了！喊了30年的狼终于要来了！",
			"date_added": 1566699750283
		},
		{
			"body": "川普可绕国会令美企撤资 14家车企停产珠三角百业萧条",
			"date_added": 1566699778410
		},
		{
			"body": "重庆富商转发微信被指“颠覆国家”亿万资产被夺走",
			"date_added": 1566699801685
		},
		{
			"body": "中国汽配大厂贸战中倒下 14家车企被迫停产",
			"date_added": 1566699918399
		},
		{
			"body": "8.25反送中 荃葵青集会游行",
			"date_added": 1566699943253
		},
		{
			"body": "香港“反送中”活动——8.24观塘大游行",
			"date_added": 1566699982656
		},
		{
			"body": "川普下令美企退出中国 台商也加速回流台湾",
			"date_added": 1566700007157
		},
		{
			"body": "8月猪肉价再飚涨三成 大陆现抢猪潮频曝大打出手",
			"date_added": 1566865782947
		},
		{
			"body": "美财长证实：川习在贸易上已是敌人",
			"date_added": 1566865805188
		},
		{
			"body": "北京因何强硬3天即放软？分析:未料到3大后果",
			"date_added": 1566865830238
		},
		{
			"body": "中共否认致电求谈判 川普回呛：刘鹤来电",
			"date_added": 1566865868070
		},
		{
			"body": "川普：中共连夜联系美国 希望重回谈判桌",
			"date_added": 1566865886552
		},
		{
			"body": "美紧发战略点名中共 川普力阻中共收购乌尖端军工",
			"date_added": 1567175461177
		},
		{
			"body": "反送中要角接连被捕 林郑：抓到没人示威为止",
			"date_added": 1567175480261
		},
		{
			"body": "8.31民阵游行集会被警察拒绝 香港巨变在即 召集人遭遇袭击",
			"date_added": 1567175501676
		},
		{
			"body": "港警狂抓人 沙田区议员许锐宇等人被捕",
			"date_added": 1567175526782
		},
		{
			"body": "黄之锋周庭获保释 港府被指散播白色恐怖",
			"date_added": 1567175567266
		},
		{
			"body": "林郑曾提撤修例北京拒绝",
			"date_added": 1567175593580
		},
		{
			"body": "大律师公会执委:宣布紧急法即违宪 共军海陆空恐吓只进不出",
			"date_added": 1567175610435
		},
		{
			"body": "中国债务创下最高纪录 巨额债务最终民众买单",
			"date_added": 1567175629820
		},
		{
			"body": "路透：林郑提议撤送中法案 遭中共否决",
			"date_added": 1567175662420
		},
		{
			"body": "【快讯】香港黄之锋、周庭、陈浩天被捕",
			"date_added": 1567175691430
		},
		{
			"body": "香港众志：近9000名学生表明参与罢课",
			"date_added": 1567175710816
		},
		{
			"body": "山雨欲来！过去36小时 香港发生甚么事？激发8‧31更多港人抗暴？",
			"date_added": 1567175731642
		},
		{
			"body": "香港大搜捕1天抓6人 包括学生会长、立法议员",
			"date_added": 1567175774273
		},
		{
			"body": "黄之锋被捕前谈“港独”表态：愿与习近平见面",
			"date_added": 1567175875005
		},
		{
			"body": "香港大抓捕 民阵“831”游行被取消",
			"date_added": 1567175895768
		},
		{
			"body": "8.31敏感日 白色恐怖笼罩香港",
			"date_added": 1567175984834
		},
		{
			"body": "见证历史时刻 吁列中共为恐怖组织签名超十万",
			"date_added": 1567176004085
		},
		{
			"body": "9.2中文大学百万大道罢课集会",
			"date_added": 1567433190030
		},
		{
			"body": "34国法轮功学员大游行 吁停止迫害",
			"date_added": 1567433227858
		},
		{
			"body": "《华日》谴责林郑月娥：以维护法治之名毁掉法治",
			"date_added": 1567433268915
		},
		{
			"body": "9.2罢课集会 学生冒雨参加 父陪女儿出席",
			"date_added": 1567433281822
		},
		{
			"body": "反送中民意浩浩汤汤 中共陷“汪洋大海”",
			"date_added": 1567433305209
		},
		{
			"body": "网传港警打死人 /香港三罢局势升级",
			"date_added": 1567433384294
		},
		{
			"body": "柯文哲告诫再下去中国经济倒退20年",
			"date_added": 1567433421121
		},
		{
			"body": "震撼！5千私车接示威者 港重演敦克尔克大撤退",
			"date_added": 1567433698463
		},
		{
			"body": "香港开学日大罢课 百校21行业齐声援",
			"date_added": 1567433710251
		},
		{
			"body": "网传港警太子站打死多人 尸体密送停尸间",
			"date_added": 1567433738697
		},
		{
			"body": "9月2日 香港民众金钟三罢集会",
			"date_added": 1567433753312
		},
		{
			"body": "逾7万人参加双罢集会",
			"date_added": 1567433780281
		},
		{
			"body": "香港反送中 9.2罢课集会",
			"date_added": 1567433803442
		},
		{
			"body": "林郑录音泄密甩锅 北京勃然大怒",
			"date_added": 1567599497200
		},
		{
			"body": "添马公园三罢集会 港人持标语表心声",
			"date_added": 1567599511973
		},
		{
			"body": "警察掩盖太子站命案？！香港“8·31”后多起蹊跷死亡",
			"date_added": 1567599537056
		},
		{
			"body": "“安邦帝国”彻底覆灭 吴小晖4套别墅网上拍卖",
			"date_added": 1567599568188
		},
		{
			"body": "林郑进最高档私人会所 “辞职录音”更多内幕曝光",
			"date_added": 1567599588055
		},
		{
			"body": "棋高 川普提清朝债务有深意 不还钱就还港！",
			"date_added": 1567599603416
		},
		{
			"body": "“十一”来临 北京娱乐场停业一个月",
			"date_added": 1567599616681
		},
		{
			"body": "林郑讲话宣布撤回修例 港人不答应 为何5大诉求 缺一不可？",
			"date_added": 1567599643871
		},
		{
			"body": "胡春华接军令状 猪肉成“重大政治任务”",
			"date_added": 1567599662248
		},
		{
			"body": "川普预言中国4大重创 习近平承认风险将“集中显露”",
			"date_added": 1567599676533
		},
		{
			"body": "中共“十一”摆谱泄密 花钱雇20万人参加庆典",
			"date_added": 1567599704529
		},
		{
			"body": "内外不宁 习近平提“五个凡是”指向谁？",
			"date_added": 1567599720733
		},
		{
			"body": "张明健：香港危险了 习近平更危险",
			"date_added": 1567599746581
		},
		{
			"body": "港媒：林郑急召秘密会议 料做“重大让步”",
			"date_added": 1567599764907
		},
		{
			"body": "林郑月娥重大让步！宣布撤回“逃犯条例”",
			"date_added": 1567599781510
		},
		{
			"body": "快讯：林郑宣布正式撤回修例 民众：五大诉求缺一不可",
			"date_added": 1567599805054
		},
		{
			"body": "“面临重大斗争” 习近平首提港澳台事务",
			"date_added": 1567599832054
		},
		{
			"body": "黄之锋发动全球串联 斥林郑“政治作秀”",
			"date_added": 1567767180584
		},
		{
			"body": "猪地位再升 当局急转弯：不得以环保限制养猪",
			"date_added": 1567767191824
		},
		{
			"body": "林郑筹备紧急法？一句话泄底 中共运输船深夜秘密进港",
			"date_added": 1567767227491
		},
		{
			"body": "实锤！莱特希泽不想见刘鹤 川普顾问：美方有大筹码",
			"date_added": 1567767257717
		},
		{
			"body": "经济处于危机状态 李克强与刘鹤连发新命令",
			"date_added": 1567767281269
		},
		{
			"body": "捂右眼自拍声援反送中 湖南20多人遭约谈",
			"date_added": 1567767294405
		},
		{
			"body": "大陆房地产严冬 唐山一天六房企破产",
			"date_added": 1567767312631
		},
		{
			"body": "神秘高官曝中共黑幕：苦日子来了，能逃快逃吧",
			"date_added": 1567767326781
		},
		{
			"body": "习近平说悄悄话 杜特尔特：他因香港而烦躁",
			"date_added": 1567767343057
		},
		{
			"body": "习近平激战7昼夜 香港局势险像环生",
			"date_added": 1567767359103
		},
		{
			"body": "北京6天3次重磅会议 刘鹤：守底线防民变",
			"date_added": 1567767372879
		},
		{
			"body": "林郑撤送中条例 陈浩天：替镇压铺路",
			"date_added": 1567767410305
		},
		{
			"body": "专访萧若元:中共死磕贸易战或令港币变废纸",
			"date_added": 1567767449677
		},
		{
			"body": "中国A股惊曝监狱风云 12大佬被抓 800亿市值蒸发",
			"date_added": 1567997369864
		},
		{
			"body": "山东环保“大跃进” 企业关门数万人下岗",
			"date_added": 1567997382977
		},
		{
			"body": "中共建安哥拉机场15年未完工 恐成烂尾工程",
			"date_added": 1567997407148
		},
		{
			"body": "中共拟派“秃鹰”夺联合国要职 白宫网站网民联署力阻",
			"date_added": 1567997441149
		},
		{
			"body": "蔡奇讲话“结巴” 中共建政70周年如临大敌",
			"date_added": 1567997452582
		},
		{
			"body": "9.8港人游行 警方清场拘捕多人",
			"date_added": 1567997469421
		},
		{
			"body": "中国经济或遭毁灭性重击 美专家：只要川普切断...",
			"date_added": 1568246486374
		},
		{
			"body": "港人齐唱《愿荣光归香港》 9月10日夜 响彻全城！",
			"date_added": 1568246504919
		},
		{
			"body": "德国外长会晤黄之锋 呛声中共外交部",
			"date_added": 1568246530741
		},
		{
			"body": "港议员曝内部文件 8.31事件疑点重重",
			"date_added": 1568246560914
		},
		{
			"body": "太子站失踪者曝光",
			"date_added": 1568246574933
		},
		{
			"body": "美商会新调查：外企加速撤离中国大陆",
			"date_added": 1568246588406
		},
		{
			"body": "“831太子站”无打死人？受袭失踪者容貌曝光",
			"date_added": 1568246618540
		},
		{
			"body": "港警内部分化拒当炮灰 警嫂上街反送中",
			"date_added": 1568246630370
		},
		{
			"body": "【香港反送中】林郑月娥已到生死关头",
			"date_added": 1568246690860
		},
		{
			"body": "美国证监会阻止给中共输血进行时",
			"date_added": 1568246717158
		},
		{
			"body": "央视董倩当中共帮凶陷入麻烦",
			"date_added": 1568246732743
		},
		{
			"body": "美宣布对中国瓷砖最高征2倍税",
			"date_added": 1568246765729
		},
		{
			"body": "刚刚 中共搞出国际大笑话 2个月竟有841家大股东套现820亿 A股曝12大佬被抓800亿蒸发",
			"date_added": 1568246795276
		},
		{
			"body": "房地产成毒药 很多家庭和企业资金链将断",
			"date_added": 1568246816788
		},
		{
			"body": "港警突然取消记者会 毛孟静公布太子站内情",
			"date_added": 1568246945317
		},
		{
			"body": "美国会新推《保护香港法案》 禁售香港防暴装备",
			"date_added": 1568246962572
		},
		{
			"body": "中共豁免16种美国产品关税 川普:北京挺不住了",
			"date_added": 1568246984136
		},
		{
			"body": "回击中共官媒造假 港人为悼念9.11暂停抗议一天",
			"date_added": 1568247011172
		},
		{
			"body": "中共官媒9.11造谣 被指无人性",
			"date_added": 1568247131623
		},
		{
			"body": "黄之锋访德成焦点 洪堡大学演讲支持声鼎沸",
			"date_added": 1568247144338
		},
		{
			"body": "戴头盔口罩奏乐 最强版《愿荣光归香港》爆红",
			"date_added": 1568247156378
		},
		{
			"body": "中方取消部分对美产品关税 川普：不惊讶",
			"date_added": 1568247167871
		},
		{
			"body": "留学生开豪车大闹反送中集会 被加国吊销牌照 近日，加拿大支持“反送中”人士透露，加拿大的中国留学生受中共挑唆，到香港留学生“反送中”集会闹场，结果“豪华车队”的部分留学生被加拿大警察吊销车牌，甚至签证或被取消。",
			"date_added": 1569142231090
		},
		{
			"body": "裴敏欣：中共一党专政大限将至 中共今年建政70年，实际上它现在面临的挑战是其过去70年中从来没有碰到过的。美国学者指出，尽管技术上没有对专政的时间限制，但中国共产党正在接近一党专政的最长“寿命”。",
			"date_added": 1569142288358
		},
		{
			"body": "专家：中国经济面临三重风险 贸易战只是其一 中共的经济数据正降至几十年来的最低水平。第二季度的经济增长率为6.2% ，为官方开始公布季度数据以来的最低水平。第三季度的数据初步估计是6% 到6.5%，也是有史以来的最低预测。很多人将之归因于贸易战，但据专家分析，中共的经济面临着“三重威胁” ，而贸易战只是其中的一部分。",
			"date_added": 1569142320998
		},
		{
			"body": "“六四天网”公民记者王晶出狱 脑癌恶化 “六四天网”公民记者王晶，于9月15日刑满出狱，长春当局维稳人员强迫其签署训诫书。王晶被关押期间遭受多次殴打和酷刑，致使其腰椎严重受损，脑癌病情也恶化。",
			"date_added": 1569142403737
		},
		{
			"body": "电动车“拜腾”创始人：因中共干预而离职 电动汽车创业公司“拜腾”（Byton）的创始人和前首席执行官毕福康（Carsten Breitfeld）对外透露说，他之所以在今年早些时候离开公司，是因为中国第一汽车厂对之进行投资之后，中共政府对“拜腾”进行了非常严重的干预。",
			"date_added": 1569142558162
		},
		{
			"body": "恐怖录像曝光 新疆囚犯被黑布蒙眼背铐押送 一段惊悚的无人机拍摄视频曝光，显示中共将数百名中国人押送的场景，这些人双手被戴手铐绑在背后，他们的眼睛用黑布蒙住，还被剃光了头。",
			"date_added": 1569142591876
		},
		{
			"body": "杭州派官员进阿里巴巴等百家私企 公私合营？ 近日，中共浙江省杭州市政府将抽调100名官员，进驻阿里巴巴等第一批100家大型私企，作为“政府事务代表”。有网民表示，中共开始吞并私企了。",
			"date_added": 1569142636107
		},
		{
			"body": "义乌机场改造拆迁安置 70村民状告当局毁约 浙江省义乌市政府为发展航空小镇，征收北苑街道前洪村村民土地拆迁房屋，并承诺给予高层公寓和集聚配套产业用房安置。然而，在即将交付之际，义乌当局却毁约，村民们愤而告上法院。近日，维权代表披露当局毁约内幕。",
			"date_added": 1569156482342
		},
		{
			"body": "北京旧村改造乱象百出 村民维权多年无果 北京海淀区苏家坨镇七王坟村自2014年开始旧村改造，出现许多不公、腐败现象，村民维权多年无果，目前仍然有26户村民住在旧房里。",
			"date_added": 1569156678445
		},
		{
			"body": "介入王美余死亡案 谢阳律师被特警控制 湖南衡阳维权人士王美余，突然在衡阳看守所关押期间死亡，事件引发外界强烈关注。709律师谢阳和公民陈燕慧（网名迷迭香）于9月25日晚11时20分许，入住当地神龙大酒店后，被突然闯入的6名持枪实弹特警控制，截到发稿时间，仍处于失联状态。",
			"date_added": 1569504901577
		},
		{
			"body": "美智库：美中关系充满不信任和不确定性 美国华府智库战略与国际研究中心（CSIS）9月25日发布报告表示，贸易冲突中，美中关系充满不信任和不确定性。",
			"date_added": 1569504960471
		},
		{
			"body": "新疆模式扩大 公安部全国采集男性DNA 迹象显示，中共公安部近期部署了在全国范围内采集男性DNA数据。中共正在将对付新疆维吾尔人的生物信息监控追踪方式，快速扩展到全国各地。",
			"date_added": 1569505930869
		},
		{
			"body": "偷运伊朗石油 5中国人和6实体被美制裁 美国国务卿麦克·蓬佩奥（Mike Pompeo）于周三（9月25日）表示，美国正在对一些从伊朗购买石油的中国公司进行制裁，以进一步加大向伊朗政权施压。",
			"date_added": 1569506463773
		}
	]
}