{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1632635528,
			"title": "Super Virus of Eunuch",
			"body": "[The Eunuch Virus ... ](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1632635036_1Gjx11bmWfCZT6ck2nxNVDt9mjeTqf6LJX/The+Eunuch+Virus)",
			"added": 1632635527
		}
	],
	"topic_vote": {},
	"next_comment_id": 14,
	"comment": {
		"1615371304_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2": [
			{
				"comment_id": 1,
				"body": "In oriental culture, there's a famous story called \"围魏救赵\" (Rescue the Zhao Kingdom by besieging the Wei Kingdom ). \n\nHong Kong was once a semi-democratic area, capable to accommodate diversification of cultures, like America's society. \n\nThe democracy course in both Hong Kong and Myanmar are destroyed by the evil forces maneuvered by the Atheism Gang of Fake CCP in China.  \n\nSo to attack the Tatmadaw hooligan leader is to relieve the terrorism atmosphere in Hong Kong, and to save Hong Kong is in fact to save America's culture itself!",
				"added": 1615371730
			},
			{
				"comment_id": 2,
				"body": "Nofish is no longer available to raise the 50 K limit, right? \nIt takes lengthy time to apply for new ZeroId, usually needs to wait for hours.",
				"added": 1615371777
			},
			{
				"comment_id": 10,
				"body": "You're from East Asia, right? Please help check if the photo message displayed on the sites can be accessed smoothly. \nhttp://127.0.0.1:43110/1H1DB7PXNUNo8LNLYZZZKd5qaRadLg8Uzk/?Topic:1609677208_1GmnzXHeSi3UXLhbdL92ps2CExH6u46Uyf/Vaccine+Revolution \nIt's focused on Vaccine Revolution — a movement demanding transparency of information on Covid19 Vaccine operation in China. \n> [k175](#comment_1_1Ao77vhtVzHna35Fg6DvaQLqpJHLchHriC): from within country.. thanks @peace001 for making a topic",
				"added": 1615727119
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 3,
				"body": "[Who's the Most Respectable Warrior in Russia?  ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:1_1Gjx11bmWfCZT6ck2nxNVDt9mjeTqf6LJX/Who+s+the+Most+Respectable+Warrior+in+Russia)\n\nIf you truly love Vladimir Putin, with a genuine love from your heart, **NOT of the fake type of love — like the modern eunuch** — the famous Chinese exile Miles Kwok (Guo Wen Gui), who said that he loved Emperor Xi Jin Ping very much, and even praised Emperor Xi as a Great Emperor in A Thousand of Years, while Mr Guo's many other family members are **suffering most brutal tortures by those barbarous henchmen dispatched by Dictator Xi**, then,\nyou should protect Vladimir Putin, and all of Putin's family members with a good system of Gun Rights protecting Human Rights.\nWhy?\n... \n(Serious topics to be discussed on serious site, in order to avoid the troubles of 50 K limit by Nofish. )",
				"added": 1615606634
			}
		],
		"1611430566_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": [
			{
				"comment_id": 4,
				"body": "[Who's the Most Respectable Warrior in Russia?  ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:1_1Gjx11bmWfCZT6ck2nxNVDt9mjeTqf6LJX/Who+s+the+Most+Respectable+Warrior+in+Russia)\nIt's a question that deserves deep thinking. Think of this question for a second or third time before a powerful conclusion is made finally. \n... \n(Serious topics to be discussed on serious site, in order to avoid the troubles of 50 K limit by Nofish. )\nBy the way, is Nofish still alive or not?  If he's not disappeared by the Cvid19, hope something can be updated on Zeronet, to prove that he's still alive.\n[User-level moderation ](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1597847864_15HwpjShZKp2dpMuZqFaariQtJvMawYLVq/Should+user+level+moderation+be+implemented+in+ZeroTalk+engine)",
				"added": 1615607002
			}
		],
		"1597847864_15HwpjShZKp2dpMuZqFaariQtJvMawYLVq": [
			{
				"comment_id": 5,
				"body": "[About User-level moderation ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:5_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2/About+User+level+moderation)\n(Serious topics to be discussed on serious site, in order to avoid the troubles of 50 K limit by Nofish. )\nBy the way, is Nofish still alive or not? If he's not disappeared by the Cvid19, hope something can be updated on Zeronet, to prove that he's still alive.",
				"added": 1615607088
			},
			{
				"comment_id": 7,
				"body": "The above user-level moderation mentioned \"erase the comment\", which may be taken as censorship in the traditional web. Such style moderation may be against the pursuit of total freedom of speech.  However, another style of operation can be \n[Pin comments to the top ](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1597641256_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2/New+Functions+on+ZeroNet) \nwhich will help people better fight against some rubbish comments, while at the same time, not go to the extremity of censorship as by Twitter, Facebook, etc.",
				"added": 1615622516
			},
			{
				"comment_id": 8,
				"body": "Free information without censorship is a special emphasis on ZeroNet. However, the 50 K data limit can become **a dangerous censorship for some users who don't know how to or just don't like to create independent forums on Zeronet**, on serious topics.  Then it means that the 50 K limit will be quickly run out, and become **another variation of censorship in a new style**.  \n[About User-level moderation ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:5_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2/About+User+level+moderation)\n\nSection B), which may be against the pursuit of total freedom of speech, it needn't be considered.\nThe ideas in **Section A)** may be adopted. \n\n#By using a certain mechanism of upgrading the 50K limit to higher level for some users, it will remove the obstacle of 50K Limit Censorship.",
				"added": 1615624420
			},
			{
				"comment_id": 9,
				"body": "By the way, is Nofish still alive or not? Is he disappeared by Covid19?\n It's indeed a matter of concern for active users who care about ZeroNet's progress.",
				"added": 1615624611
			}
		],
		"1597641256_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2": [
			{
				"comment_id": 6,
				"body": "[About Information Bubbles ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1Gjx11bmWfCZT6ck2nxNVDt9mjeTqf6LJX/About+Information+Bubbles)\n....\n**People's attitudes on varieties of information may differ, even the same person's mind on a topic will become different at different times of history. **\n\nWhen the varieties of information increase to a large level, the necessity to manage the information either by categorization or other means will be more and more imperative. \n\nIn spite of all the troubles, there's always a certain percent of content that is focused on eternal glory of sustainable civilization, including **long term prosperity of Zeronet**, and other newly-emerged decentralized innovations like LBRY.com etc. \n\n(Serious topics to be discussed on serious site, in order to avoid the troubles of 50 K limit by Nofish. )\nBy the way, is Nofish still alive or not? \n[User-level moderation ](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1597847864_15HwpjShZKp2dpMuZqFaariQtJvMawYLVq/Should+user+level+moderation+be+implemented+in+ZeroTalk+engine)",
				"added": 1615610387
			}
		],
		"1623356651_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 11,
				"body": "To keep the vitality of Zeronet better, people need to know \n[What is the Eunuch Virus ](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1632635036_1Gjx11bmWfCZT6ck2nxNVDt9mjeTqf6LJX/The+Eunuch+Virus)",
				"added": 1632635598
			}
		],
		"1632580545_1C16U7WJ34kMraYJsf5EwjrCQqhWiofm85": [
			{
				"comment_id": 12,
				"body": "The details of these ideas are much appreciated! \nHowever, it’s suggested that a revolution be taken by American people as well. As the Freedom Beacon, American's human rights are well protected by Gun Rights, which is guaranteed by the constitution \n[Emancipation of mind — 1st step of American Revolution! ](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1610042649_139mS7MVsytiqfvLcqkb4S1VKqDMhCXs8n)",
				"added": 1632637563
			}
		],
		"1610042649_139mS7MVsytiqfvLcqkb4S1VKqDMhCXs8n": [
			{
				"comment_id": 13,
				"body": "All people who don’t accept dictatorship by [Eunuch Virus ](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1632635036_1Gjx11bmWfCZT6ck2nxNVDt9mjeTqf6LJX/The+Eunuch+Virus)\n will become warriors.  Some of them may be awakened up more quickly, while some of them may be awakened up a little later. But more and more people will have to take action! \nOtherwise, \n[Your Tomorrow can be Today's Hong Kong! ](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1632190431_1MieUGUUVUxVmvuLNGcTXt9wVBSqpeztDT/Your+Tomorrow+can+be+Today+s+Hong+Kong)\n\nAustralia's situation is a prelude of being further downgraded to the Hell Jungle situation as Hong Kong, since there's no Gun Rights system, \n**the Ballot-Democracy without Gun Rights can be trampled upon like a Scrap of Paper once Stalin-style politicians emerge!**",
				"added": 1632637625
			}
		]
	},
	"comment_vote": {}
}