{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1632043057,
			"title": "Фильтрация контента ZeroNet",
			"body": "Короче, что я придумал, что нужно сделать, чтобы пользоваться ZeroNet, и не сойти с ума.\nНужно сделать нейросеть, которая проводит сентимент-анализ, и проверяет, насколько нейтрально написано сообщение. В условиях даркнета невозможно цензурировать сеть, но можно помочь конечному пользователю не читать те сообщения, которые он не хотел бы видеть. Годится?\nЧто я хотел бы от вас узнать:\nГотовые фреймворки или обученные нейронные сети, в которых определяется насколько сообщение нейтрально, и ещё возможно насколько сообщение содержательно.\nЖелательно, чтобы всё было написано на Python.",
			"added": 1632043056
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1631796958_1FtcR86nq8oDtoaExoCyHcjmigrLTfqH9L": [
			{
				"comment_id": 1,
				"body": "Мог бы поднять собственный сайт, как сделала это команда Навального.\nХотя, мне кажется, что будет как всегда, власти разработают новую тактику победы на выборах.\nВедь понятно же, что играя по правилам властей, их победить не получится.",
				"added": 1631962954
			}
		],
		"1629934608_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": [
			{
				"comment_id": 2,
				"body": "RetroShare - очень неплохой проект, там немало народа, активность есть, преимущественно среди сторонников лево и праворадикальных движений, хотя присутствие либералов там ощутимо.",
				"added": 1631963501
			}
		],
		"1626871884_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": [
			{
				"comment_id": 3,
				"body": "1. Не уход в наличные и крипту, а отмену частной собственности как таковой.\n2. Не блокировка, а единовременная атака с применением флуда мейстрим медиа.\n3. Согласен, но в условиях общества, атомизированного капитализмом, это будет трудно осуществить, разве что среди более продвинутой среды общества. Чаты есть от самых заурядных (Discord, Telegram), до \"наших\" вариантов, т.е. Tox или RetroShare, или собственных разработок.\nВообще, советую, переходите с андройдов на более чистые линуксы, типа PostmarketOS.\n4. Расшаривание точек доступа - неплохая идея. Неплохо было бы сделать ещё чаты на UPNP, чтобы все, кто подключены к одному роутеру, смогли бы обмениваться инфой.",
				"added": 1632025635
			}
		],
		"1630943493_1Lzki6TM1dDKspyDRwNVMn4ogZr17eehbb": [
			{
				"comment_id": 4,
				"body": "Не только маргиналы. Тут есть достаточно и технарей, и представителей немаленьких и вполне серьёзных радикальных движений в т.ч. и неонацисты, анархисты, коммунисты и ультраконсерваторы.\nНо раз ты здесь, это означает, что есть ещё одно мнение. Если тебе не нравится чьё-то мнение, просто кликни по никнейму, и нажми \"mute this user\". Больше тебя он не побеспокоит.\nКстати, с развитием ZeroNet можно добавить более интересные способы модерации.",
				"added": 1632039357
			}
		],
		"1632043057_12T9CGYv5qxzqQFTrK91jRqHrBcKDpSuME": [
			{
				"comment_id": 5,
				"body": "Нашёл неплохой вариант\nhttps://github.com/barissayil/SentimentAnalysis - осторожно, ссылка ведёт на клир!",
				"added": 1632045807
			}
		]
	},
	"comment_vote": {
		"18_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": 1
	}
}