{
	"next_comment_id": 7,
	"user_name": "Caropc5",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "very welcome\n",
			"post_uri": "15CpwjhYCsGTxsPjJTkyqRvdmDBTFZegbg_1564203054",
			"date_added": 1564203136
		},
		{
			"comment_id": 2,
			"body": "@Mgyvenezuela: And yes, you can make money here, because here is just like any platform like facebook, twitter, twitch, except here nobody can DELETE the material you keep on your site",
			"post_uri": "15CpwjhYCsGTxsPjJTkyqRvdmDBTFZegbg_1564203054",
			"date_added": 1564203679
		},
		{
			"comment_id": 3,
			"body": "can make money like everywhere by providing a service that someone wanted :)",
			"post_uri": "15CpwjhYCsGTxsPjJTkyqRvdmDBTFZegbg_1564203659",
			"date_added": 1564203734
		},
		{
			"comment_id": 4,
			"body": "@Mgyvenezuela: an example of what I said, for example the movies and serials I am posting, which in this case I am posting on the site http://127.0.0.1:43110/big.kopykate.bit, I do risk the SITE OWNER , remove them, but otherwise, only I can remove myself, but nothing prevents me from CLONING the site and hence would be IMPOSSIBLE for a third party to remove the content, without access to my account data, in case the private key I used to sign this data and even then the copies that would be with other users are NOT DELETED.",
			"post_uri": "15CpwjhYCsGTxsPjJTkyqRvdmDBTFZegbg_1564203659",
			"date_added": 1564204185
		},
		{
			"comment_id": 5,
			"body": "@Styromaniac: ExactlyExactly, you have to be careful, ALWAYS, because you never know if on the other side you are not a marginal, trying to impersonate a good citizen, beware mgyvenezuela",
			"post_uri": "15CpwjhYCsGTxsPjJTkyqRvdmDBTFZegbg_1564203054",
			"date_added": 1564289008
		},
		{
			"comment_id": 6,
			"body": "@Styromaniac: Yeah, I've already blocked some here, but in general they were just spammers.\nI don't care about porn of any kind.\n\nThis is clear in my case, because here in Brazil is good about this type of thing, and hardly the state here will go after you, but places like USA, that the laws are more severe, even with those who simply accessed something, it's good to always be careful or use an encrypted hd or whatever",
			"post_uri": "15CpwjhYCsGTxsPjJTkyqRvdmDBTFZegbg_1564203054",
			"date_added": 1564290040
		}
	]
}