{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1614282237,
			"title": "Some ZeroNet Guides I found Helpful for Learning to Build a Zite",
			"body": "https://github.com/imachug/The-Truth-about-ZeroNet",
			"added": 1614282236
		}
	],
	"topic_vote": {
		"1615061408_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": 1,
		"1616239441_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1614726531_14JFttTvjwR9PitBWPMU8FEqRCwACAeekM": [
			{
				"comment_id": 1,
				"body": "learn to program. You can literally do anything with the proper planning and implementation. Check the zeronet source code on github. Integrate it into your own application like many others have done.",
				"added": 1614812744
			}
		],
		"1615161713_16CnipWrmQT4vDor6t2G7QRwartbUcDmMg": [
			{
				"comment_id": 2,
				"body": "You just put the files into the same folder as your Zite and do the usual publish.\nMake sure to use the \"optional\" parameter in user-specific content.json file.\nSome context here: https://www.reddit.com/r/zeronet/comments/3s9uq5/zeronet_new_optional_files_feature_test/",
				"added": 1615206107
			}
		],
		"1615231848_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": [
			{
				"comment_id": 3,
				"body": "its a clearnet site, obviously they will have whatever IP and info you submit and signup with",
				"added": 1615233119
			}
		],
		"1615373710_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": [
			{
				"comment_id": 4,
				"body": "I am not a zeronet expert by any means but what I understand...\n\n1. The sync is done by the zeronet client. You can create your own sync using whatever programing language you want. It is just comparing the torrent file info. If there is a difference then download updated torrent files.  You just need to learn the zeronet protocol.\n\n2. For a private Zite, just don't share your Zite key or encrypt all the files. You can encrypt your  Zite files any way you want using any programing language or encryption. You could make your own client that reads the encrypted files in your Zite. Anything is possible because technically you don't have to serve any specific file format.  You just need to learn the zeronet protocol.\n\nThe only limitation with Zeronet at the moment is that you cannot build a truly dynamic website because the zeronet zites are all static \"torrent files\"  served from remote file system hosts.  You can create a mix of zeronet/clearnet but this break privacy/security and is generally frowned upon because of the potential for user data leaking.",
				"added": 1615392343
			}
		],
		"1615689898_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 5,
				"body": "memory patch the browsers method for delivering device information or (much simpler) use a web scraper to grab and serve content (using python/node/php/etc). I scrape to a local machine on the network and strip all the garbage I don't need, then from there serve it to the rest of network (Ad free youtube, etc).",
				"added": 1615719098
			}
		],
		"1616231596_1CQzPmMXnfH3eJvpKGNfsVnUXxiHZM3jp2": [
			{
				"comment_id": 6,
				"body": "it's a test. if you can't get past the lobby then you probably don't belong.",
				"added": 1616256016
			}
		]
	},
	"comment_vote": {
		"8_15TKSujroWTFtZsNqFnpejDA6JsnvXXrCK": 1,
		"14_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": 1,
		"3017_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}