{
	"next_post_id": 12,
	"next_comment_id": 9,
	"next_follow_id": 5,
	"avatar": "jpg",
	"user_name": "Jaka",
	"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
	"intro": "Spouting nonsense.",
	"post": [
		{
			"post_id": 1,
			"date_added": 1560406985,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1560719415,
			"body": "Why can't be both? :(\n> Just a Note, whenever using zeronet can't use qbittorent to seed/download any torrent.",
			"date_added": 1560719413
		},
		{
			"post_id": 1560720747,
			"body": "Soros, Kochs Joined by Zuckerberg, Patreon, and Mozilla in Attacking Free Speech\nhttps://www.bitchute.com/video/IeVF7WTjT5A/\n> The globalist showing off their tail",
			"date_added": 1560720744
		},
		{
			"post_id": 1560720967,
			"body": "I Knew It! - Marc Dice\nhttps://www.bitchute.com/video/2kSEaCxMq54/\n+you can change the face\n+now you can change the voice & mouth\n> This video is explaining how far will 'fake news' can go on. This informations should be spread far and wide! Let your parents and relatives know..",
			"date_added": 1560720963
		},
		{
			"post_id": 1560722933,
			"body": "This world need *cleansing*\nhttps://www.bitchute.com/video/_9Mbh0PsVw4/\n\n1. I never approve LGBT, as christian it's sinful and not right. It's never an act of mercy to let people go to hell. And by that by no means to advocate violence\n2.  LGBT phenomenon are born because people miss-understanding about same-sex-attractions you can watch the full explanations here: https://youtu.be/ZcmKHqH56_4\n3. And there's never an information about repenting homosexual surfaced in media right? not even once, this is really weird facts\n4. I know there's a trend to let that 'rainbow' be the act of pride, I've always rebrand it (in my mind) what they said as 'only sodomite pride\n5. You can do as you wish to yourself, but to attack and dismantle well established principle that's time to make 'the true light shine again' | if you're dark, light might burn you\n6. If any people start normalizing pedophilia, that's will be the time to witch hunt. There'll be no mercy given\n7. There's a time when we can talk | But also there's a conditions when talk is not useful.\n",
			"date_added": 1560722928
		},
		{
			"post_id": 1560851042,
			"body": "Sharing new video @kattie\nhttp://127.0.0.1:43110/big.kopykate.bit/?Video=1560850391_1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD",
			"date_added": 1560851036
		},
		{
			"post_id": 1561104905,
			"body": "Things to be bookmarked and shared\nhttps://www.privacytools.io/",
			"date_added": 1561104898
		},
		{
			"post_id": 1561186001,
			"body": "People are now watching the Iran closely, Donald Trump is actually the better president (as of today) compared to obomber, bushes, and other merciless-war-slave.\n\nIF, War does happen; \nThen, All part of the world will be hurt especially those who can't produce their own oil. Some suspect this \"Iran's theater\" is just a way to obstruct China to be the global industry substituting old-and-rotten uncle Sam. China need many oils and war is always chaotic.\n\nBUT, There's a hypothesis by the economics\n+ That Debt ceiling is too high for anyone to imagine how do the entire continent have to work to pay for that. Claim for the future (debt) are never unlimited, the way of those Mr.Bigs dumping US$ are just logical and reasonable. Look how gold and crypto will soar in near future.\n+ Looking how Merkle is trembling, maybe she know the worst fact, about the possibility of falling of deutche bank (domino effect) maybe? \n+ Big economical shift - hint: the death of USD - will demands war from the losing side, they'll use the last available stored energy to change their written (historical determinism) fate. \n+ Internet will be getting more censored but they'll not risk people's losing bread and circus, or else elite will be mobbed\n+ People will fawn to Russia and China, because they're on winning side supposedly. Winning about world's trust, at least they don't betray anyone at this critical moment. You can argue but that's what I think\n+ Anything SJW about environment, antifa, lgbtq, feminazi, etc will be mercilessly crushed, decimated and destroyed if they still on the status quo like today. They'll like a good puppy at 'that' time, I know they aren't so stupid.\n+ Anyone will be afraid to be the trigger of the next war. Btw, James Corbett said that we might be actually are now in the moment of war (weapon of financial terror) but waiting for worst. \n+ Smart and rich are now leaving US for sure, avoiding zombie apocalypse scenario (look how 'Just In Time' management of the ware house, there'll be many casualties). Even homeless and dark ages plagues are now in everywhere.\n",
			"date_added": 1561185993
		},
		{
			"post_id": 1561227267,
			"body": "Youtube is now doing it! They're capable to take down people's live video while they're (((LIVE)))\n+ no replay type premiere video",
			"date_added": 1561227258
		},
		{
			"post_id": 1561281436,
			"body": "I like tinkering, for years browsing snapfiles to try a software than playing games.\n\nBut now always tune in to https://alternativeto.net to search every possible alternative from the most monopolized online service available. \n\nApocalypse is near, my spider sense tells.",
			"date_added": 1561281426
		},
		{
			"post_id": 1561325902,
			"body": "Why my description reverted back to random zeronet user? lol\nThere's something wrong here.",
			"date_added": 1561325891
		}
	],
	"post_like": {
		"1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1560502277": 1560502756,
		"17husSAraRRvc7qRWxwA7KF7PTwjhTmxhD_1561181916": 1561186093
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "I hope telegram won't fall to the ruling elites",
			"post_uri": "131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs_1560432678",
			"date_added": 1560442215
		},
		{
			"comment_id": 2,
			"body": "it's heavy to read, thanks for sharing.",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1560502277",
			"date_added": 1560502904
		},
		{
			"comment_id": 3,
			"body": "@SSDifnskdjfnsdjk: really? I'm on windows 7",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560719415",
			"date_added": 1560719590
		},
		{
			"comment_id": 4,
			"body": "@Moor: Okay will try it again, maybe just some bugs.",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560719415",
			"date_added": 1560720682
		},
		{
			"comment_id": 5,
			"body": "translated: The CCP has already banned \"Queen's Avenue East\" in the name of Hong Kong independence. Can the CCP not just compromise with this group of people? Doesn't the compromise with Hong Kong alone indicate that the CCP recognizes that Hong Kong people are more or less Chinese? This is the sagacity of the CCP. In this way, it is clear to everyone that the Chinese people will still get out of the streets. Hong Kong does not leave because it is already a foreigner.\n\nyeah it sucks to be a Chinese... China is rising up by the cost of free-speech and freedom of informations. Keep inform us brother.",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1561046583",
			"date_added": 1561105100
		},
		{
			"comment_id": 6,
			"body": "@klu9@zeroid.bit: Wow, that's great! dude can you teach me how to mirror sites? ",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1561104905",
			"date_added": 1561182362
		},
		{
			"comment_id": 7,
			"body": "@leftside: \nYou got it wrong, Russia is *yet* to i̶n̶s̶t̶a̶l̶l̶ sell weapon to turkey and iran - request from saudi maybe -, but he done it to syria (from the emergency request of orthodox church - proven by Russian base established in majority christian area - and also to fix pipeline problem)\n> Muslim brotherhood [MB] is sponsored (highly likely) by Iran. Who're in coalition? Hamas, Iran, Iraq, Turkey, Tunisia,  ̶E̶g̶y̶p̶t̶ (not anymore). MB isn't pro with Saudi factions, and Saudi will gladly fund everything to destroy MB & especially Iran. Because MB had tried to overthrow saudi's royal once.\n\nYou got it right though, I always thought USGov is like a hydra, not all decisions of foreign policy are 'man-handled' (solo-ed) by trump. Pompeo and Bolton always creating problems, those 2 are exactly non-trump deepstate faction. Still remember how Nikki Haley act independently outside of what US wants? This is by no means that trump factions is good people.\n\nNo, the early strategy of US is to divide China and Russia, still remember the case 'amazing and beautiful chocolate cake'?\n> Trump and Xi was in a meeting (dinner), while tomahawk attacking Syria in which Russian troops stationed .\nChina has agreement with Russia about the oil exclusive contract and if you notice the bromance between the two of them (they met many times), I'll assure you that China never regret anything. Maybe about kidnapped huawei CFO by US though.\n\n",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1561186001",
			"date_added": 1561219346
		},
		{
			"comment_id": 8,
			"body": "@leftside: \nBromance is exist dude, friendship is triangle (oneness of interest). But it's not permanent at least until the multipolar world order are well established (hint: make US as peers not 'the leader' de jure). This talk is about geopolitics.\n> Search about how many putin meets xi, you must understand the multipolar world is just a reactions from the overbearing earth-governance by USGov. Weapon of Financial Destructions creating hate, those (hate) seeds had sown and the plant has grown, it can't be stopped. There'll be a moment when American Continent is at the mercy of Eurasia one.\n\nActually there's a divide of economist here: \nA. Even USD is still trusted than crypto or even gold\nUS is still the most trusted gov by companies because they still embrace law and order more than anything (copyright n intellectual property is safe and sound). No mention their strong military foundations around the world which still has a storage of energy and ready anytime to make a trouble.\n\nB. Can't let debt-ceiling soar to the moon\nUS sadly under Bush & Obama, really unrestrained when it comes to fund his losing-war (unfinished). This led to a bad credibility, BUT IF US start to roll a plan and pay their behemoth-sized-debt then maybe point A can still be preserved. But if it's not, then it's insane to let other country literally stole your wealth (from quantitative easing)\n\nActually to comment Ke Qiang it's deadlock on both sides, US military parts also imported from China. Globalizations means everything is interconnected. You can't say China's lose = US wins, that's the produce of faulty & mythical paradigm of 'zero sums game'.\n\nExpect some bleed, no one will safe and sounds. Because it's only escalating.\n",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1561186001",
			"date_added": 1561280949
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp",
			"user_name": "「FraYoshi 吉国」",
			"date_added": 1561186131
		},
		{
			"follow_id": 2,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo",
			"user_name": "~Publicality~",
			"date_added": 1561186154
		},
		{
			"follow_id": 3,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD",
			"user_name": "Jaka",
			"date_added": 1561327245
		},
		{
			"follow_id": 4,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD",
			"user_name": "Jaka Tanker",
			"date_added": 1561327268
		}
	]
}