{
	"pages": [
		{
			"id": "a96148b0-3a4d-11eb-aa66-17baae99345e",
			"body": "https://youtu.be/891RtkxOVc8\n\n# Transcript \n\n\nEvery idea and every policy regardless of its intention, agree ability, relevance, usefulness or any other subjective trait follows. And narrative Kev, just like anything else in Polish ology, the details may vary, but the overall trend is always the same. That's not a good thing or a bad thing. It just is what it is. and not knowing this is a source for many frustrations and sorrow amongst those who look at politics, not knowing how the narrative curve works. He's also a reason why this information also works. So what is the narrative curve? And how does it work? And why does it work? Let's explore. Hello, everyone, and welcome to the freedom alternative to the kind of video I haven't done lately. But as election seasons, where I'm directly involved are approaching to their conclusions, I will once again have enough time to do this. So as I was working in the current narrative warfare projects that I'm involved in, I realized that while I explained three years ago that nothing is inevitable in politics, I did not explain why that is the case or better said, I did not explain fully or satisfactorily. So for the newer subscribers, please watch the video I published in November 2017, called the myth of inevitability. To get the broader idea. This time, I'll explain the more technical aspects of this. So for the purposes of this talk, the presentation is divided as follows. One, what is the narrative curve? Two, how does it work? And here I shall provide some examples. Three, what are the inflection points and how to flatten the narrative curve? For Why does it work? And finally, number five, some conclusions. So chapter one, what is the narrative curve? Now, first of all, don't confuse the narrative curve with the narrative arc. The narrative arc is a procedure from literature, and storytelling, and it has very little in common with a narrative curve. The narrative arc is just a fancy way of saying that the story has a relatively common beginning a middle where we tend to where tension arises to character conflict, and narrative momentum builds to a peak, and an end where the conflict is resolved. And it looks like this. The narrative curve, on the other hand, is polit, a logical construct aimed at predicting the evolution of a political position or a narrative in a particular group, be it a workplace, a school village, a city, entire countries, or even entire civilizations, and the narrative curve looks like this. Now, here, I should say that while all polit ologists and political operatives worth their salt that I ever met, regardless of their political affiliation, or lack thereof, will not disagree with most of what I'm about to say. I do have to point out that framing this knowledge as a graph with curves is, in a way original research of mine, the University scholars, you know, those paid for by your tax dollars to pretend they're so bloody smart. They prefer to complicate things quite a lot, thus obfuscating important aspects sometimes intentionally, and sometimes just because they're busy smelling their own farts. I will leave in the description an article called narrative, political violence and social change, written by fancy scholars at the University of Birmingham, they basically talk about the narrative curve without calling it that way. But since their formation is in the humanities, as opposed to stem like yours truly, they split hairs so much that by the end of their article, the reader is more confused than before proceeding to reading it. So what I'm saying is that the concept of narrative curve is meant to simplify things to make it easier for those only now starting to work in politics and activism to understand how things work. Technically speaking, not even the term narrative curve might belong to me though I haven't seen it used this way before anyway. So while the drawing that I'm presenting to you is Far from cute, it does drive the point home of the abscissa, there is the amount of time that it passes since an idea comes around. And on the ordinate, there is the number of people who either adhere to that idea, or at the very least hear about that idea or policy or narrative enough to form an opinion about it. This graph is valid regardless of the idea we're talking about. Remember that, but this graph in general, it doesn't have to look like that with all ideas. It has multiple inflection points, and I'll get to that later on. In the video. What's important to remember is that this is the ideal or the best case scenario if you want. Now, you will notice that there aren't specific data on the graph. And that's because the amount of time needed varies from topic to topic. The more outside of the Overton window, the narrative is that more time is needed to progress on the narrative curve. The number of people needed also depends on the demographics. If it's a narrative curve, or the politics of adore our the Principality of Liechtenstein, obviously, the total number of people needed for the fourth curve or hump is smaller than if the curve is on something more complex applicable on a larger group. And of course, as many of you know, the total number of people needed varies depending on the topic itself. You may need a 10% radicalized population for certain topics, while for others, three to 5% radicals and the 12 to 20% agreement is more than enough for a successful narrative curve. And for that, please review my April 2018, I think video called the 10% rule the most hardline wins. With that said, most narratives follow the curve in this graph. I say most because every other decades, there are a few exceptions. And of course, not all narratives are strong enough to follow all of the four curves or humps. And that's due to decisions or mistakes made by those who work on it at various inflection points. Again, I'll get to that soon the portion about the inflection point. So that is basically the narrative curve. Chapter Two, how does it work? So the origin point is when an idea is formed, it doesn't matter if it's a new idea or not. The same idea can follow this curve multiple times for whatever reason. For instance, the abolition of slavery is an idea that followed this curve at least five times until it succeeded, at least in Europe and North America. In other places, it's still following this curve, because labor is not universally abolished to this day. But you only hear about the episode when it finally worked. But it wasn't that easy. Anyway, so upon the moment, an idea emerges, the people who come up with it instinctively try to turn it into a narrative. And here's the first clue on why it works. It's just how human nature works. We tell stories, or narratives. If you can't turn an idea into a narrative, your idea is useless. And that's where the narrative starts climbing on the first curve is usually debated in an entirely secluded manner. That is to say, only the initial proponents discussed the idea on how to frame the narrative without outside in but this process can take anything from a few weeks to several decades. For instance, when it came to opposing feminism, it took a bit over three decades, when it came to communism it It took almost three decades, what actually to discuss how much it took Karl Marx to write Das Kapital. Mormonism, for instance, needed only five years for the first hump of the narrative curve. As a rule, very few narratives fail on the first hump. And it's easy to guess why, since the first hump is entirely shaped by the initiators of the idea, it's very hard for it to flatten usually, and this for the first part of the process goes pretty smoothly. Then comes the, it's getting progressively harder actually, then, and the second part, when the initiators are satisfied with the product, they start taking their narrative out into the public, first with a small public and that's how you see the first relatively small flattening of the graph. That happens because usually one of the founders leaves or distances himself or herself for various reasons. Also, for the first time, there is backlash, which tends to scare the weaker initial adherence. That's where leadership starts to matter. A good enough leader manager To adjust the narrative in such a way that it's more palatable, and, dare I say, marketable. Once that occurs, the second curve start, usually more people from the susceptible group start joining. In the case of communism, that's the intellectuals in the case of, let's say, environmentalism, its naive youth, and so on and so forth. Usually, by this time in the narrative curve, the elite of the narrative should already have an idea on what is their target demographic, as well as what is the susceptible group. There is some overlap between the two, of course, but they're not the same thing. For instance, communism's target demographic is the working class or the proletariat. But the susceptible group is the middle IQ bureaucrats masquerading as intellectuals. And it's here in the second curve, when these things are hashed out, and you get the first people who are disappointed the first calls for reform and if permitted, this first serious challenges and debates, that tends to erode growth quite a bit, as shown in the graph. This process can last between several months and up to several decades. For instance, in the case of environmentalism, it took two decades after the founders left and formed splinter groups. Eventually, in the case of successful narrative, someone or a group of simple ones, a group of people come and pick up the pieces reform and refine the narrative and turn it into a de facto movement, whether they call themselves a movement or, or not, or they were, well, maybe they call this as a project, that is a material, because here between the second and the third curve is where the adherence of the ideas start agitating for it in the society at large. So for instance, this is where feminism was in mid 1950s. This point is usually where the society at large learns about the idea and it's movement. Again, this works on every idea, this pointer, for instance, is early 2009. For for the tea party. As I said, the curve works on both big and small narrative projects. It's not a partisan thing. So once the narrative is cogent and coherent, and agitation begins, more people hear about it and more organic type of growth starts happening. Initially seen as an oddity, the media has been starts talking about it, usually negatively at first, if you see a movement, talked about it positively in the media, right from the get go at just as they start their third curve, you should know that that is not an organic effort that represents a clearly defined demand from real people. Anyway. So this third curve is where the results also start appearing, whether it be congressman elected or funding for the demands, whatever results may mean, in the eyes of the narrative proponents sometime during the third curve, and the adherents will start seeing them. This usually leads to some of the older adherence to step aside either due to old age remember that, for some narratives leading up to this point may mean as much as 40 years, or due to believing that they've achieved what they wanted, which is sometimes true. For instance, as a rule, I personally leave the narratives I helped build somewhere in the second half of the third narrative curve. And that's because I work to grow new narratives, which is something that I know how to do much better than I know how to be a policy wonk. Now, not that I don't know anything about being a police policy wonk, but my time is better spent taking on another first or usually second narrative curve. In any event, while it is rare for narratives to be completely flattened, if they reach this stage, sometimes that does happen as well. What is a lot more common though is that at this point, the project or the movement goes through some reshuffling. Usually, by this point, a very few of those in the previous curve are still alive or willing to be part of the project. So for both biological reasons, and for fatigue reasons, the elite is usually replaced in a physical way. And this is where things can start going really wrong. But before moving to the inflection points, I will say this, if things go wrong, obviously the narrative curve is flattened. However, that doesn't mean the end of it, it just means that one has to start the process again, usually from the second curve onwards, and when one starts the process again. Usually the timeframe is shorter. So while the first attempt can eat up as much as 50 years for a deeply unpopular or very new idea, the second time can be a half of that, or even less than that, if those trying draw the necessary wisdom from the faders of their forefathers. And with that, chapter three, what are the inflection points and how to flatten the narrative curve? Now, the inflection point is just like in calculus is the point at which the curve changes side. Specifically, in this case, you can call it a crossroad, because that's really what it is. It's the moment when things can go into two or more directions, depending on several decisions and other factors that are independent of those decisions. So let's start from the end. So I can continue the story on this graph. So as I was saying, that once the initial elite gets replaced, it's when things can go wrong. And here are the two inflection points. One is during the transition process, a very revolutionary new elite has the potential to ruin the project and effectively flatten the narrative curve. Also infiltration amongst the new elite can have the same effect. So the green scenario is when the new elite ruins the project, the red scenario is the best case, which almost never happens, unless there is some unforeseen help or catalyst, I don't know. And the black scenario is the most likely one precisely because the rocky process of changing the lead is bound to bring some temporary problems that have the effect of eclipsing the project temporarily. Now, if all goes well with this one, then the narrative curve starts growing once again on the fourth and final curve for hump. And just as the final curve starts. There's another inflection point, as you can see what my very scientific drawing best case scenario, the black scenario, and the fourth hump is basically the Long March through institutions. The blue scenario is the more technocratic route in which the narrative never becomes popular or widely accepted, but becomes relevant enough that it can achieve at least some of its goals. leftism in Chile nowadays is basically the blue scenario, although they don't know it yet. And the yellow scenario is when something goes wrong, and just as the narrative was ready for it take off, and it's thus flattened. Other than these two, there are two other inflection points, which should be pretty self evident. Again, with my totally scientific graph, there's the inflection point at both the first and the second hump. And here there are only two broad options, you either get the feedback right or you don't. That's why it's so important to hash out as many issues as possible when the narrative curve is still in its infancy. Because if you get the fundamentals right, then it's a lot harder to fail later on down the road. So these are the inflection points. Now onto the second question of this sub chapter, how to flatten the narrative curve. Now, while on how to keep it functional, there is a larger a lot of literature available. And most of the videos I made about practical politics are in many ways about getting as much as possible from the narrative curve. There is surprisingly little research available on how to intentionally flatten. And that's because of the rule I mentioned early in the presentation, namely that if a narrative is flattened, that doesn't mean it's forever buried. It just means it has to start all over again, with certain advantages if appropriate, wisdom is being drawn. Still, based on my experience, as well as the research are already available on things like cointelpro, for instance, which I explained quite a lot in the videos about black propaganda, agitprop and subversion links in the low bar for those who haven't seen those yet. So based on all that, there are a few things that can be said about how to flatten the narrative curve. So number one, be patient. Now that was difficult, seriously, be patient and wait for the curve to be visible. Now this should be self evident. I mean, 10 people could be plotting right now on how to initiate a narrative curve on getting the plebs to accept political Islam in Europe await that actually did happen. The reason I bring this one as an example, though, is because it's one of those spectacular failures in that people notice it when the curve was just at the end of it. Second hump, and it could have been flattened then, by 2015. It was climbing on its third hump, and it was still stoppable then. But that didn't happen either. because too many plagues aided and abetted by a cynical political class and the corrupt Cathedral media still believed that either the whole curve doesn't exist, or that it does exist, but its growth was a conspiracy theory or an exaggeration, by the far right. Well, it wasn't. And it isn't. Now, the current political Islam is climbing on the fourth hump. And only now at this final inflection point, there is some serious approach to it. Will it be enough? I will, maybe, but even under the yellow scenario, it will still be problematic, much more so than it would have been had it been addressed 10 years ago. So this is a case of too much patience. The opposite is the whole mo hate speech train of thought. That one assumes that if one makes a nasty joke, then it's a foregone conclusion that that individual or group of individuals will get the pitchforks and start a huge igloo. Of course, that also leaves room for all sorts of weirdos to take advantage of that lack of patience in order to attempt to drive other stories, the totalitarian types of stories your love that, but what I'm saying is that if one's goal is to flatten a certain narrative curve, one has to do the proper assessment. And Realistically speaking, is that cannot be done during the first hump, but rather towards the end of the second one at the inflection point. So, so in other words, be patient and wait for the cave to be visible. Number two, infiltration should start early. One of the mistakes made by those who seek to flatten a certain curve is to wait too much. If you identify the curve growing that you want it flattened infiltration starts then not later on. Conversely, if you are growing a curve, once you're visible, you need the risk mitigation strategies to prevent or minimize infiltration early on, not later if or when you grow. Again, this is not new knowledge. I explained multiple times during the practical politics series of which This video is part of how I keep track on all of the new groups and look for opportunities to infiltrate them early on, even before I made up my mind or asked anyone in the supreme patriarchal Council of the sofa on what to do with that group. I'm joking, there is no Supreme Council there is a Troika, though. Anyway, the point is that in order to have a decent shot at flattening the narrative curve, infiltration should start early. Okay. Okay. Number three, always look up for ways to advance in the leadership, the best way to flatten the narrative curve is to lead it yourself. Again, nothing special or new here. If you aim to flatten a certain trend, get ahead of it. If you're not the head of it, then you're not flattening, you're influencing sure that can be useful as well, depending on the project or depending on the resources. You know, sometimes you come around a bit too late, like with the project to flatten feminist narrative, unless you're 130 years old, there's no way anyone had the chance to use the first two options. So there's that. But if it's a smaller project, like flattening the narrative of let's say, rent control, like I did in my own hometown, then surely you need to do your best to drive it into the ground as early as possible and be ready to do it again. Every time it resurfaces, because it will. And again, this is not dependent on the issue, whether it's rent control, abortion control, police reform, you name it, all of them follow the narrative curve, whether the drivers of it are aware of it or not. So yeah, that's really all there is to be said about the inflection points and how to flatten the curve. Anything further, would just mean prolonging the video too much and ending up repeating some of the things I said in the older videos. So chapter four. Why does this work? And this is an important question not just intellectually, but also from a practical perspective. If one can figure out enough about how this works, this provides a decent framework to maintaining one's mental sanity, in times of tension, and also the ability to make more accurate judgment calls while they're here. As we were able to make much more accurate calls on policy during the Wu Han cough panic is precisely because we looked at the issue with the narrative kept in mind. Admittedly, the Wu Han virus is one of those exceedingly rare situations where the narrative curve is very short in terms of time. The same was true during the Spanish flu, which was also a very short curve anyway. The first reason this works is because it's not prescriptive, but descriptive. In other words, the narrative curve is not the rule that one should follow in order to find success. But it's a rule that predates rules and predates Polly otology itself. And it's rooted in human nature. And I was saying earlier in the video, the moment an idea emerges, the people who come up with it instinctively try to turn it into a story or a narrative, because that's how do we tell stories and if something cannot be turned into a story, then it eventually gets lost. That's why most people I work with storytellers. The second reason this works is because reality constrains most narratives to eventually follow this path, regardless of the desires of the initial adherence. So even if those who come up with a new idea not only don't know about the narrative curve, but they also commit all of the mistakes possible in the book from their failure, someone else will learn and will try again, that someone else may also fail. But after several attempts, the one who will succeed will be the one who follows this curve. And this is true both for small and big narratives. I gave earlier the example of the abolitionist cause, but it applies to many others too, again, large and small, right? Christianity, for instance, the first Christians didn't really know how to make their story big, they knew how to turn it into a story, but he didn't know how to make it big. So they lingered as a dubious sect of Judaism for many decades, actually, many centuries. Eventually, the elite was replaced multiple times until they made the correct choices and got the curve going. Now, sure, it's complicated, but basically proved that maths or tiridates, the grade of Armenia was the second inflection point. And of course, Constantine was the third inflection point who basically helped spawn the great story, which again, was quite different from the original view, but different in such a way that it can be successful, whilst keeping enough of the original as to maintain continuity. Also, read reasonably during the International Conference on men's issues, I explained point more deeply a practical application of this concept of a narrative curve, I suggest you watch that one, two. Third and final reason of why this works, because it relies on patience, in addition to hard work, at no point in the process. Is there anything about shortcuts or excessive force? Sure, during some stages, force may be a part of the process. But that doesn't change the curve. That much patience and winning over new adherence, even if not always be a peaceful means is still the only way a curve can be successful. And you can see this on pretty much all issues and all projects. For instance, the Islamic State was having troubles in climbing on the third hump, even before any foreign intervation, or other countermeasure had been taken against them. And this was precisely because they didn't have enough patience. Now, admittedly, everyone else wasn't really patient with them, either. And directed derivation started quite fast, or if you want direct action to flatten their curve was taken in a timely fashion, but still, their project might have lasted if they have taken a more gradual approach. So be happy that Islam is counting to poly otology. So yeah, that's the narrative care for you. And finally, chapter five, some conclusions. Ultimately, this particular concept should not be taken very rigidly. It's just an aspect to keep in mind when things become a bit too complex too fast. That's when the observer has to zoom out a little bit and try to gouge where on the narrative curve is the situation currently being. Get that one right. And it will be easier to make decisions about how to proceed and also to make predictions. If you guesstimate correctly where on the narrative care of a certain issue is at some point, then it becomes a bit easier to predict the results of an election, there is also a certain Parliament debate, or the direction of a certain economic trend, a more mainstream or normie terms, you might have heard this last aspect framed under the cliche of what's called an idea whose time has come. Now unfortunately, the truncated Victor Hugo quote is oftentimes used as a means of propaganda or F projecting power, which is a nicer way of saying propaganda. But when it's true, an idea whose time has come is basically a narrative reaching maturity and climbing successfully on the fourth hump of the narrative curve. What's important to remember from all of this is the four stages or hubs in the graph original idea first hashed out in the limited group for a serious public exposure and the replacement of the originally lead, and for comp, success or failure, depending on how the inflection point is managed. If you have these in mind, everything else comes to you naturally, when you look at things, you don't need to remember long treatises of Polish ology or some complicated theory. And of course, one does get better at it with experience in a way the narrative curve itself has its own narrative curve. So yeah, that's all I have to say. It's not a particularly jolly topic, but it's been nagging me for a while and had to cover it. And with all that being said, Thank you all for watching. Thank you for your consistent and generous support, visit our website, subscribe to our social media and I will see you all soon on the freedom alternative. \n\n",
			"date_added": 1607539079355,
			"slug": "20201126"
		},
		{
			"id": "6e668f40-3a4d-11eb-8877-1577d497ce4d",
			"body": "# Video list\n\n| date                  | title                                 | link                                                    |\n|:--------------------------|:--------------------------------------:|-----------------------------------------------------------:|\n|   [[2020/11/26 ]]  |   The narrative curve   |   https://youtu.be/891RtkxOVc8   |",
			"date_added": 1607538980404,
			"slug": "home"
		},
		{
			"id": "5f648c90-3a4d-11eb-8877-1577d497ce4d",
			"body": "# Video list\n\n| date                  | title                                 | link                                                    |\n|:--------------------------|:--------------------------------------:|-----------------------------------------------------------:|\n|   2020/11/26   |   The narrative curve   |   https://youtu.be/891RtkxOVc8   |",
			"date_added": 1607538955226,
			"slug": "home"
		},
		{
			"id": "2d448490-3a4d-11eb-8877-1577d497ce4d",
			"body": "# Video list\n\n| date| title| link|\n|:-------------------|:-------------------:|-------------------:|\n|   2020/11/26   |   The narrative curve   |   https://youtu.be/891RtkxOVc8   |",
			"date_added": 1607538871129,
			"slug": "home"
		},
		{
			"id": "17fb4c90-3a4d-11eb-a5be-11cb4cabd1bb",
			"body": "# Video list\n\n| date| title| link|\n:-|:-:|-:\n|   2020/11/26   |   The narrative curve   |   https://youtu.be/891RtkxOVc8   |",
			"date_added": 1607538835417,
			"slug": "home"
		},
		{
			"id": "e0e2af50-3a4c-11eb-a5be-11cb4cabd1bb",
			"body": "# Video list\n\n| date| title| link|\n|:-|:-:|-:|\n|   2020/11/26   |   The narrative curve   |   https://youtu.be/891RtkxOVc8   |",
			"date_added": 1607538742982,
			"slug": "home"
		}
	]
}