{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1524682774,
			"title": "Виртуальное государство",
			"body": "Создатель форума куда-то заныкался, так что я подброшу угольку :)\n\nЯ когда-то поднимал сабжевый вопрос в рамках обсуждения новых мини-государств, типа Силенда и Либерленда: [Sealand-ия - мечта моя: Создано свободное государство Либерленд:](http://www.balancer.ru/g/p3811168)\n\nСамоцитата из обсуждения:\n\n> ИМХО, сегодня если строить свой мир, то надо нифига не на географическое разделение упирать, а на виртуальное. Отделяться не физически, а социально. Собирать сообщество единомышленников по всему миру, придумывать, чем можно помочь друг другу, в начале, при малой численность — виртуально/идейно/морально, потом, при росте численности — уже финансово/карьерно/протективно. Бабки, скажем, зарабатывать на коллективных распределённых стартапах, позже — на совместных проектах в реале. Степень доверия и авторитетности определять по рейтинговыми системам, типа Web of Trust, с привязкой к виртуальной личности. Пропагандировать идею повсеместно, привлекая новых членов, при чём — без ограничений. Решения принимать совместно, прямым голосованием, с учётом WoT-репутации. Спорные вопросы решать, скажем, а ля судьями в Меганезии — несколько судей по рейтингу, несколько — по жребию. Давно мечтаю попытаться реализовать подобную социальную систему, но в рамках Авиабазы кворума интересующихся для неё мало, а за рамками — нет навыка активной пропаганды :)\n\nИдея реализации на форумах у меня не прокатила, нет желающих экспериментировать с подобным. Но тут, в общем, хотя бы обсудить можно попробовать :)",
			"added": 1524682773
		},
		{
			"topic_id": 1525070997,
			"title": "Климатология",
			"body": "Китай анонсировал крупнейшее вмешательство в климат Земли\n=========================================================\n\n![](https://icdn.lenta.ru/images/2018/04/28/15/20180428150223841/pic_2bbcdca277dee2690ff12d92f2a3e4af.jpg)\n\nФото: Rafael Marchante / Reuters\n\nКитайские ученые планируют увеличить количество осадков в Тибетском нагорье до 10 миллиардов кубометров в год. В рамках проекта «Тяньхэ» (англ. Sky River) в горах будут установлены десятки тысяч камер, которые будут выпускать в атмосферу частицы иодида серебра --- соединения, являющегося дождеобразующим реагентом. Это станет крупнейшим в мире экспериментом по созданию искусственного дождя, сообщает издание Science Alert.\n\nИсследователи надеются, что им удастся вызвать дожди над территорией площадью 1,6 миллиона квадратных километров. При этом годовой объем воды, которая будет выпадать в виде осадков, должен быть эквивалентен семи процентам объема питьевой воды, потребляемой в Китае в год. Предварительные испытания дождеобразующей системы были проведены в Тибете, Синьцзяне и других горных районах, где были установлены около 500 камер.\n\nСистема предназначена для засева облаков, когда в атмосферу выпускаются специальные реагенты для изменения фазового состояния облаков. При этом в воздушных массах с высокой концентрацией водяного пара образуются центры кристаллизации, что провоцирует выпадение осадков. Поскольку иодид серебра по своей кристаллической структуре напоминает лед, даже относительно небольшое количество этого вещества вызывает сильную конденсацию капель воды.",
			"added": 1525070995
		},
		{
			"topic_id": 1527656475,
			"title": "Частные аэрокосмические технологии",
			"body": "# Virgin Galactic провела успешное испытание туристического космического корабля\n\n_29 мая, 21:13 UTC+3_\n\n## Корабль был поднят в воздух на самолете-носителе\n\nНЬЮ-ЙОРК, 29 мая. /ТАСС/. Американская компания Virgin Galactic успешно провела во вторник очередное испытание своего туристического суборбитального космического корабля SpaceShipTwo модели Unity. Об этом компания сообщила в своем Twitter.\n\nПолет состоялся в небе над пустыней Мохаве в штате Калифорния. В ходе испытаний корабль был поднят в воздух на специальном самолете-носителе. После отделения SpaceShipTwo пилоты на некоторое время включили ракетные двигатели. После этого аппарат спланировал на Землю, совершил мягкую посадку.\n\n[![](https://gateway.ipfs.io/ipfs/QmcSocbSu6nLa1yjNCMY7oNUkVzr1Gw4LU5tA4RnjiDGMd/fileOG57Fz-800x.jpg)](https://gateway.ipfs.io/ipfs/Qmd2FPQqQ5Mqz8SWaHJdTkLMVSDoRGzwnqHawKnZVV45RU/fileOG57Fz.jpg)\n\nВ компании уточнили, что это уже 13-й испытательный полет Unity. Судя по фотографиям, размещенным компанией в Twitter, за полетом со стартовой площадки наблюдал основатель и председатель совета директоров Virgin Galactic Ричард Брэнсон.\n\nМодель Unity была представлена в феврале прошлого года, ее первый пробный полет состоялся 8 сентября. Корабль пришел на смену разбившейся в октябре 2014 года в пустыне Мохаве предыдущей модели под названием Enterprise. Согласно выводам специалистов, которые изучали обстоятельства ЧП, одной из причин катастрофы Enterprise при выполнении испытательного полета стала ошибка пилота. В результате происшествия один из испытателей погиб, другой получил травмы.\n\nИсточник: [http://tass.ru/kosmos/5246656](http://tass.ru/kosmos/5246656)",
			"added": 1527656472
		},
		{
			"topic_id": 1527773900,
			"title": "Рои дронов",
			"body": "# Китай испытал флотилию, состоящую из полусотни роботов\n\n![](https://naked-science.ru/sites/default/files/styles/full_size/public/field/image/5533330_original.jpg)\n\n*В Южно-Китайском море протестировали крупную флотилию беспилотных надводных аппаратов.*\n\nОб испытании флота надводных роботов [сообщило](https://m.huanqiu.com/r/MV8wXzEyMTIxODI2XzE0NTNfMTUyNzY2MjQ2MA==) издание Huanqiu. Роботы продемонстрировали свои способности в Южно-Китайском море, неподалеку от архипелага Ваньшань.\n\nТесты провела компания Yunzhou Intelligence Technology, они стали одними из наиболее крупных и сложных испытаний морских беспилотных систем в истории. При проверке роботы шли в нескольких кильватерных колоннах. На видео показано, как они обходят судно, в котором находится оператор, а затем восстанавливают строй.\n\nСообщается, что во время тестов китайские специалисты имитировали обход препятствий, включая проход между опорами моста. Также можно видеть художественные элементы программы, в частности создание силуэта авианосца.\n\nhttps://www.youtube.com/watch?v=JicM5Goj8dQ\n\n*Флотилия, состоящая из полусотни роботов / ©China Daily*\n\n> Острова в Южно-Китайском море — предмет территориального спора между КНР, Тайванем, Филиппинами и рядом других стран. Сейчас через акваторию моря проходит примерно 40% трафика мировой торговли, также по нему перевозят до 80% объемов китайского импорта нефти и газа.\n\nСтоит отметить существенный прогресс последних лет, достигнутый сразу в нескольких направлениях, связанных с беспилотными аппаратами. Эти испытания в Южно-Китайском море были бы невозможны без новых методов группового взаимодействия. Напомним, недавно 1300 танцующих роботов [установили](https://naked-science.ru/article/hi-tech/1300-tancuyushchih-robotov) новый мировой «танцевальный» рекорд. Эффектное шоу провели в Италии. На мероприятии присутствовал судья Книги рекордов Гиннесса Лоренцо Вельтри (Lorenzo Veltri), фиксировавший происходящее.\n\nРекорд был установлен при помощи роботов Ubtech Alpha 1S: такие устройства можно встретить в свободной продаже, их стоимость относительно невысока. Данную модель отличает крайне высокая гибкость, которая позволяет выполнять самые разные действия. Робот имеет 16 запатентованных сервоприводов, благодаря которым его движения очень похожи на человеческие. Для управления устройством можно использовать смартфон или планшет.\n\nКроме того, значительный прогресс наблюдается и конкретно в сфере морских беспилотных систем. Также можно вспомнить проект российской беспилотной подводной лодки «Статус-6». Однако еще более показательным следует считать [создаваемый](https://naked-science.ru/article/tech/v-ssha-nachalis-ispytaniya-samogo) в США беспилотный корабль «Морской охотник», главная задача которого — поиск неприятельских субмарин. Предположительно, беспилотный корабль сможет действовать автономно в течение 60–90 дней. Его длина — 40 метров.\n\n[Илья Ведмеденко](https://naked-science.ru/2275)",
			"added": 1527773896
		},
		{
			"topic_id": 1537668770,
			"title": "Фифтипедия",
			"body": "Мысли по техническим вопросам. Вослед обсуждению на http://www.balancer.ru/g/p6697317",
			"added": 1537668765
		},
		{
			"topic_id": 1538696038,
			"title": "Познакомьтесь с анархистами, самостоятельно делающими лекарства",
			"body": "**«Уксусный коллектив четырёх воров» – сеть анархистов, опирающихся на технологии, и бросающих вызов гигантам фарминдустрии при помощи самостоятельно изготовленных лекарств**\n\n![](https://habrastorage.org/webt/5-/qt/bc/5-qtbc2yanhq9g8xzqhpej7iqeu.jpeg)\n\nВпервые я познакомился с Майклом Лофером, когда он швырялся в аудиторию хакерской конференции HOPE (Hackers on Planet Earth), проходящей раз в два года в Нью-Йорке, лекарствами на тысячи долларов.\n\n«Кто-нибудь из присутствующих переживал [анафилактический шок](https://ru.wikipedia.org/wiki/%D0%90%D0%BD%D0%B0%D1%84%D0%B8%D0%BB%D0%B0%D0%BA%D1%82%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B9_%D1%88%D0%BE%D0%BA), не имея доступа к [эпинефрину](https://ru.wikipedia.org/wiki/%D0%90%D0%B4%D1%80%D0%B5%D0%BD%D0%B0%D0%BB%D0%B8%D0%BD)?» – спросил Лофер у аудитории. Поднялось несколько рук, и Лофер швырнул одному из поднявших руку людей изготовленную в домашних условиях [EpiPen](https://en.wikipedia.org/wiki/Epinephrine_autoinjector) [_похожее на шариковую ручку устройство для самостоятельных инъекций адреналина / прим. перев._]. «Это одно из первых сделанных нами устройств, — сказал он. – Используйте его с умом».\n\nНемного позлорадствовав насчёт того, как [Мартин Шкрели](https://ru.wikipedia.org/wiki/%D0%A8%D0%BA%D1%80%D0%B5%D0%BB%D0%B8,_%D0%9C%D0%B0%D1%80%D1%82%D0%B8%D0%BD) из племени фармацевтических гигантов [поднял](https://www.vice.com/en_us/article/xw79pk/where-is-martin-shkreli-now-prison-fort-dix-new-jersey) цены на препарат [дараприм](https://en.wikipedia.org/wiki/Pyrimethamine), необходимый для людей, страдающих от ВИЧ, с $13 до $750, Лофер посерьёзнел. «Прошло два года, но несмотря на всё произошедшее, стоимость препарата дараприм не поменялась», — сказал он. Он залез в карман и достал пригоршню белых таблеток. «Думаю, надо раздать ещё немного», — сказал Лофер, и швырнул дараприм в аудиторию.\n\n---\n\nС бритой головой, тёмной бородой и вечной камуфляжной курткой, Лофер не похож на человека, у которого вам захотелось бы испрашивать медицинского совета – но в этом-то и смысл. Основав «Уксусный коллектив четырёх воров» [[Four Thieves Vinegar](https://fourthievesvinegar.org/)], добровольную сеть анархистов и хакеров, разрабатывающих технологии для самостоятельного изготовления лекарств, последние десять лет Лофер провёл за освобождением жизненно важных лекарств от огромных корпораций, владеющих ими. Лофер не имеет медицинского образования, и сам первый готов заявить, что не является врачом. С точки зрения законодателей он больше подошёл бы для математических расчётов по ядерному оружию, чем для лечения пациентов. Но Лофер никогда не позволял правилам и инструкциям преграждать ему путь.\n\nЯ познакомился с Лофером в баре, через улицу от зала, где проходила HOPE, после его выступления на тему изготовления лекарств своими руками. Он встречался со своими товарищами по «четырём ворам», слетевшимися со всей страны на эту конференцию, чтобы раскрыть новые медицинские технологии, разрабатываемые ими. Лофер начал празднование с тоста:\n\n«Выпьем за мёртвых, за детей с раком и СПИДом, — сказал Лофер, поднимая стакан бурбона, и [цитируя](https://www.youtube.com/watch?v=USL3toR8grw) хип-хоп исполнителя Фелипе Андреса Корнела, более известного под псевдонимом [Immortal Technique](https://ru.wikipedia.org/wiki/Immortal_Technique). „Лекарство есть, и вас, вероятно, можно было спасти“.\n\nВ последние десять лет они перебегали дорожку Управлению по санитарному надзору за качеством пищевых продуктов и медикаментов США (FDA), миллиардерам – директорам фармацевтических компаний, докторам и химикам из престижнейших университетов США. Лофер с товарищами не прекращают выводить из себя влиятельных людей, поскольку „четыре вора“ служат живым доказательством того, что эффективные лекарства можно разрабатывать, укладываясь в небольшой бюджет.\n\nВ аптеке [США] парочка шприцов с адреналином Mylan может обойтись вам в $600, дженерик – в $300, но продолжающийся дефицит практически гарантирует, что вы их не найдёте, даже если и можете себе позволить. В ответ на это „четыре вора“ опубликовали на своём сайте инструкции по самостоятельному изготовлению шприца с лекарством, который [обойдётся вам в $30](https://fourthievesvinegar.org/blog/2016/09/introducing-the-epipencil), причём его можно сделать из свободно продающихся компонентов, а перезаряжать потом всего за $3\\. Шкрели довёл стоимость жизненно важного лекарства для ВИЧ-инфицированных, дараприма, до $750 за штуку. Тогда „четыре вора“ разработали свободно распространяемую химическую лабораторию, позволяющую любому производить свой собственный дараприм всего по 25 центов за штуку.\n\nОбъём фармацевтической индустрии в США [оценивается в $446 млрд](https://www.statista.com/topics/1719/pharmaceutical-industry/), и её границы ретиво охраняются агентствами вроде FDA и Управлением по борьбе с наркотиками (DEA). Свободно распространяя схемы медицинских устройств и инструкции по изготовлению лекарств, группка анархистов и хакеров угрожает пошатнуть основы одной из самых зарегулированных и прибыльных индустрий в мире. И это они ещё только начали действовать.\n\n## Свободные лекарства\n\n«Четыре вора заявляют об успешном изготовлении пяти различных видов лекарств, и все они сделаны при помощи MicroLab. Это устройство должно имитировать дорогой аппарат, который можно встретить в химических лабораториях, при этом обходясь в небольшой процент от их стоимости, и используя доступные материалы, продающиеся в магазинах. В случае с MicroLab реакционная камера состоит из стеклянной банки, поместившейся внутри большей по размеру банки, с напечатанной на 3D-принтере крышкой, чертежи которой доступны в интернете. Несколько пластиковых шлангов и термистор, измеряющий температуру, соединяются с крышкой – в трубках сквозь это устройство циркулирует жидкость, способствуя химическим реакциям, необходимым для производства различных лекарств. Весь процесс автоматизирован при помощи небольшого компьютера, стоящего не более $30.\n\nНа сегодняшний день „четыре вора“ [использовали это устройство](https://fourthievesvinegar.org/download) для получения таких лекарств, как: [налоксон](https://ru.wikipedia.org/wiki/%D0%9D%D0%B0%D0%BB%D0%BE%D0%BA%D1%81%D0%BE%D0%BD), антидот при передозировках опиоидов, в первую очередь героина (известен, как Narcan); дараприм, лекарство, борющееся с инфекциями у людей с ВИЧ; Cabotegravir, превентивное лекарство для борьбы с ВИЧ, которое нужно принимать [четыре раза в год](http://www.natap.org/2013/CROI/croi_38.htm); [мифепристон](https://ru.wikipedia.org/wiki/%D0%9C%D0%B8%D1%84%D0%B5%D0%BF%D1%80%D0%B8%D1%81%D1%82%D0%BE%D0%BD) и мизопростол – два соединения, необходимые для фармацевтических абортов.\n\n![](https://habrastorage.org/getpro/habr/post_images/a39/9dc/3e0/a399dc3e00c4140de84b712d8f508db5.png)\n_Майкл Лофер демонстрирует MicroLab на 11-й конференции HOPE в 2016 году_\n\nУчитывая новых кандидатов в Верховный суд США от текущей администрации, коллектив анархистов ощущает необходимость торопиться с доведением до совершенства своих лекарств для проведения абортов. Они опасаются, что федеральное правительство скоро позволит отдельным штатам разрешать или запрещать легальные аборты, и у жителей некоторых из них не останется возможностей сделать аборт. Именно это послужило мотивацией для Тима Хейлерса (Луисвиль), бывшего специалиста по гидролокации из военного флота США, присоединиться к „четырём ворам“ в прошлом феврале.\n\n«Кентукки – очень консервативный штат, и я думаю, что существует реальная возможность того, что мы станем первым штатом, где полностью запрещены аборты, — сказал мне Хейлерс. – Так что я думаю очень важно дать людям возможность производить свой собственный мифепристон по необходимости».\n\nХотя «четырём ворам» удалось получить пять лекарств, для скачивания с сайта пока что доступна только инструкция к дараприму. Это, в частности, происходит из-за очень разной сложности получения различных молекул. Особенно большие трудности представляет налоксон, поскольку этот антидот при передозировках опиоидов использует те же прекурсоры, что и сами опиоиды. Их продажа контролируется правительством, и приобретать их могут только получившие одобрение лаборатории, и то в малых дозах. Чтобы обойти эту проблему, Лофер с коллегами приняли, на первый взгляд, контринтуитивный подход: они изготавливают лекарство из яда.\n\nХотя легально приобрести прекурсоры к налоксону они не могут, Лофер догадался, что сами опиаты купить довольно легко. Купив на улице [оксикодон](https://ru.wikipedia.org/wiki/%D0%9E%D0%BA%D1%81%D0%B8%D0%BA%D0%BE%D0%B4%D0%BE%D0%BD) (он же оксиконтин), члены сообщества смогли провести несколько химических реакций, извлечь из него нужные прекурсоры, и использовать их для производства налоксона.\n\n«Какие-то хитроумные торговцы наркотой в 90-е обнаружили, что можно провести одноэтапную реакцию с оксиконтином и получить [оксиморфон](https://ru.wikipedia.org/wiki/%D0%9E%D0%BA%D1%81%D0%B8%D0%BC%D0%BE%D1%80%D1%84%D0%BE%D0%BD), вещество, раз в шесть более сильное, — сказал Лофер. – А потом из оксиморфона можно сделать налоксон за один шаг. Это довольно просто – и вот вы уже делаете лекарство из яда».\n\nПодобные неортодоксальные подходы к здоровью весьма нередки в процессе взлома фармацевтических гигантов, и целью их служит помощь людям любой ценой.\n\nНапример, есть лекарство [каботегравир](https://en.wikipedia.org/wiki/Cabotegravir), профилактический препарат, доказано [предотвращающий](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5263045/)распространение ВИЧ при совместном использовании игл у макак. В отличие от других профилактических препаратов, которые надо принимать ежедневно, каботегравир можно принимать [четыре раза в год](http://www.natap.org/2013/CROI/croi_38.htm), и он будет защищать вас от ВИЧ. И хотя первые клинические испытания препарата были чрезвычайно многообещающими, «четырём ворам» надоело ждать, пока это лекарство одобрят для широкого применения. В настоящее время лекарство [проходит третью фазу испытаний FDA](https://aidsinfo.nih.gov/drugs/513/cabotegravir/0/patient), то есть, его клинически испытывают на большом количестве людей. Кроме того, если принимать во внимание стоимость других профилактических лекарств, то каботегравир, скорее всего, будут продавать по запредельной цене. Например, месячный запас сходного лекарства [Truvada](https://ru.wikipedia.org/wiki/%D0%A2%D0%B5%D0%BD%D0%BE%D1%84%D0%BE%D0%B2%D0%B8%D1%80/%D1%8D%D0%BC%D1%82%D1%80%D0%B8%D1%86%D0%B8%D1%82%D0%B0%D0%B1%D0%B8%D0%BD), которое необходимо принимать ежедневно, [обойдётся вам в $2000](https://www.npr.org/sections/health-shots/2018/06/30/624045995/rising-cost-of-prep-a-pill-that-prevents-hiv-pushes-it-out-of-reach-for-many). Поэтому группа хакеров придумала, как изготавливать его самостоятельно.\n\nКаботегравир ещё проходит доклинические испытания, но это не остановило «четырёх воров» от попыток передать профилактический препарат тем, кто может в нём нуждаться. Группа продолжает эксперименты с синтезом собственной версии лекарства, а некоторые её члены уже начали приобретать имеющийся в продаже профилактический препарат [тенофовир](https://en.wikipedia.org/wiki/Tenofovir_disoproxil), смешивать его с буфером, и поставлять его продавцам героина, которые могут предлагать его совместно со своим продуктом в качестве «дополнительной услуги» для клиентов. У клиентов, которые решат воспользоваться этой услугой, «героин будет с побочным эффектом, — сказал Лофер. – С ним вы не подхватите ВИЧ». \n\n![](https://habrastorage.org/getpro/habr/post_images/fb7/a66/d79/fb7a66d79a1a8040862c13c911e6ff34.png)\n_Первый прототип MicroLab – подвернувшиеся под руку трубки, ниппель от велосипеда и стеклянная банка._\n\n«Уксусный коллектив четырёх воров», очевидно, ходит по грани, когда дело касается законности их действий. И хотя Лофер превратил низвержение медицинской индустрии в некое подобие искусства, его миссия по освобождению медицины остаётся под постоянной угрозой преследования со стороны правоохранителей. Когда фармацевтическая компания изготавливает новое лекарство, они обладают и патентом на молекулу, делающую его эффективной. Тем не менее, Лофер с коллегами способны воспроизвести эти молекулы, поскольку они подробно описаны в патентах, а часто и в научных журналах. Нужна только правильная технология.\n\nПоскольку «четыре вора» не продают и не распространяют изготовленные ими лекарства, технически их действия не являются нелегальными с точки зрения FDA, хотя агенство и выпустило открытое предупреждение по поводу их самодеятельности. Вскоре после обнародования шприца с адреналином за $30 FDA выпустило [предупреждение](https://www.in-pharmatechnologist.com/Article/2016/09/22/US-FDA-warns-against-30-alternative-to-Mylan-s-EpiPen) для прессы, где говорилось, что «использование не одобренных лекарств, отпускаемых по рецепту, в личных целей, несёт в себе потенциальную опасность», однако не упоминала «четырёх воров» по имени. По иронии, за несколько месяцев до этого FDA [выпустило предупреждение компании Pfizer](https://www.nytimes.com/2017/09/07/health/epipen-fda-malfunction.html), которая не стала расследовать «сотни» жалоб по поводу отказов их шприцов с адреналином, некоторые из которых закончились летально. В мае FDA выпустила другое [предупреждение](http://fortune.com/2018/05/09/epipen-shortage-fda/), где декларировался хронический дефицит этих шприцов.\n\nЧто до DEA, ни одно из производимых коллективом лекарств не попадает под определение \"[находящихся под контролем веществ](https://en.wikipedia.org/wiki/Controlled_substance)\", поэтому обладание ими может максимум караться согласно закону о лекарствах, отпускаемых по рецепту. А человек страдает от заболевания и у него есть рецепт на лекарство от него, у него не должно быть проблем, если он самостоятельно произведёт это лекарство. «Четыре вора», по сути, просто освобождают информацию о производстве определённых лекарств в домашних условиях, и разрабатывают свободные инструменты для этого. Если кто-то решит изготавливать по их рецептам лекарства для себя, это будет его личным делом, но «четыре вора» не притворяются, что выпускают информацию «только в образовательных целях».\n\n«Люди, поддерживающие законы об интеллектуальной собственности, продолжают называть это воровством, — сказал мне Лофер. – Если принимать это, как аксиому, то по той же логике, удержание при себе информации о лекарствах, способных спасти жизнь, нужно называть убийством. С моральной точки зрения необходимо воровать для предотвращения убийств».\n\n«Так что, да, мы поощряем людей нарушать закон, — добавил Лофер. – Если вы смертельно больны, и вам отказывают в лекарстве, которое может вас спасти – вы выберете нарушить закон и выжить, или остаться добропорядочным трупом?»\n\n## Доктора без рецептов\n\nКатализатором создания общества послужила поездка Лофера в [Сальвадор](https://ru.wikipedia.org/wiki/%D0%A1%D0%B0%D0%BB%D1%8C%D0%B2%D0%B0%D0%B4%D0%BE%D1%80) в 2008 году, когда он ещё был студентом. Посетив в качестве одного из делегатов миссии, документировавшей нарушения прав человека в стране, сельскую клинику, он узнал, что в ней уже три месяца назад закончились контрацептивы. Когда клиника связалась с центральным госпиталем в Сан-Сальвадоре, её проинформировали, что эта проблема есть и у других клиник. Лофер сказал, что был поражён, что госпитали не могут обеспечить людям доступ к контрацептивам – относительно простому в производстве лекарству, существующему уже более полувека. Он подумал, что если торговцы наркотиками могут использовать подпольные лаборатории для производства наркоты, то схожий подход можно использовать и для производства жизненно необходимых лекарств.\n\nЛофер организовал сообщество вскоре по возвращении из Центральной Америки, но объявил о его существовании публично лишь в 2016 году на конференции HOPE. Во время первого выступления Лофер продемонстрировал самодельный шприц с адреналином за $30, распространил сделанный своими руками дараприм среди слушателей, показал ранний прототип MicroLab, и позвонил со сцены Мартину Шкрели (тот не ответил). В начале деятельности «четырёх воров» Лофер работал в основном сам по себе. Сейчас, выйдя из подполья, группа сильно выросла, хотя Лофер говорит, что узнать точное количество членов невозможно – люди приходят и уходят, и делятся таким объёмом знаний, каким могут.\n\n![](https://habrastorage.org/getpro/habr/post_images/d9e/92e/dec/d9e92edec4796f6e962adb8899ac86bb.jpg)\n_Майкл Лофер и самодельный шприц с адреналином за $40_\n\nУ всех людей сообщества техническое образование, но ни у кого нет медицинского. Лофер, к примеру, занимался ядерной физикой, и руководит математической программой в колледже Менло в Кремниевой долине. Результаты разнообразного технического опыта членов общества говорят сами за себя. Сейчас в нём есть уже независимые команды по биологии, химии, изучению данных, программированию и оборудованию, степень вовлечённости в которых зависит от конкретного проекта.\n\n«Четыре вора» ничего не продают, но у группы есть два ключевых «продукта». Первый – открытые схемы оборудования, такого, как шприц или синтезатор MicroLab, которые можно изготовить из имеющихся в продаже или распечатанных на 3D-принтере компонентов. Второй – инструкции об использовании этого оборудования для производства лекарств, куда входит всё, от использования MicroLab для простейших реакций до способов заполучить химические прекурсоры.\n\n«Я считаю, что просто необходимо обеспечить лёгкий доступ к информации о том, как самостоятельно делать лекарства, для всех, у кого к этому есть хотя бы небольшой интерес, — сказал мне Лофер. – Цель группы – сделать так, чтобы люди могли делать всё это самостоятельно. Идея в том, чтобы кто угодно мог скачать инструкции, прочитать список материалов, заказать их, прочитать инструкции по сборке и программированию, закачать код, заказать прекурсоры, и произвести лекарство».\n\nВсе инструменты группы были разработаны без какого бы то ни было финансирования – все необходимые средства поступают из карманов членов группы. Пока что произведённые ими лекарства ещё никого не убили. Однако некоторые эксперты предостерегают от принятия лекарств, произведённых самостоятельно, если они не прошли процедуру одобрения.\n\n## Уменьшение вреда\n\nЭрик вон Хиппель, экономист из MIT, исследующий «открытые инновации», с энтузиазмом относится к перспективе самодельных лекарств, но при определённых условиях. Он рассказал о пилотной программе в Нидерландах, изучающей независимое производство лекарств, [изготавливаемых на заказ для конкретных людей](https://www.nature.com/articles/nbt.3888), как хороший пример безопасного самодельного производства. Эти лекарства производятся в больницах экспертами в медицине. Вон Хиппель считает, что пациентам опасно принимать лекарства, изготовленные ими самостоятельно.\n\n«Если не проводить химические реакции при точно выдержанных параметрах, то вместе с желаемым лекарством можно легко получить опасные побочные продукты, — сказал мне вон Хиппель по e-mail. – Тщательный контроль условий реакции вряд ли возможно проводить в таких самодельных реакторах, как MicroLab, предлагаемом свободно коллективом хакеров».\n\nЕго коллега, Гарольд Демонако, работающий в MIT, соглашается с ним. Демонако предположил, что более рациональным подходом к озвученным проблемам был бы вариант, в котором пациенты работали бы с аптеками, самостоятельно изготавливающими смеси. Они готовят лекарства специально для конкретных клиентов, и Демонако говорит, что они способны синтезировать те же лекарства, что произвели «четыре вора» за небольшие деньги, но с «подобающими мерами безопасности».\n\n«Если у системы нет защиты от дурака и она не способна оценивать конечный продукт, то пользователь подвергается опасности со стороны большого списка неприятных вещей, — сказал мне Демонако по e-mail. – Повсеместное использование устройств от „четырёх воров“ откроет новую категорию для „[Премии Дарвина](https://ru.wikipedia.org/wiki/%D0%9F%D1%80%D0%B5%D0%BC%D0%B8%D1%8F_%D0%94%D0%B0%D1%80%D0%B2%D0%B8%D0%BD%D0%B0)“.\n\nВон Хиппель и Демонако согласились с тем, что для безопасного использования лекарств пациентами совершенно необходимо очищать самодельные лекарства и проводить испытания их качества. Вон Хиппель предположил, что для решения этих проблем с самодельными лекарствами потребуются учёные, имеющие опыт в медицинской химии.\n\n»Действия Майкла Лофера кажутся мне ценным вариантом социального активизма, указывающего путь к многообещающему будущему, — сказал вон Хиппель. – Но мне кажется, что до того, как самодельная медицинская продукция станет безопасной, необходимо гораздо лучше проработать вопросы с медицинской наукой и оборудованием\".\n\n«Четыре вора» в каком-то смысле воспроизводят на малых масштабах то, чем и так уже занимаются многие госпитали. Перед лицом роста цен на лекарства и их дефицита, многие госпитали начали самостоятельно [производить собственные лекарства на месте](https://www.nytimes.com/2018/01/18/health/drug-prices-hospitals.html), в целях экономии. Разница, однако, состоит в том, что эти госпитали часто имеют доступ к сложным лабораториям и опытному персоналу, что значительно уменьшает риск того, что что-то пойдёт не так.\n\n«Четыре вора» без наивности относятся к рискам, связанным с распространением инструкций, позволяющих другим людям самостоятельно делать лекарства. Всегда есть вероятность, что кто-то неправильно последует инструкциям, и случайно произведёт токсичное вещество. Однако существуют способы уменьшения вероятности такого события, и один из важнейших вкладов «воров» в самодельную медицину – это приоритет уменьшения вреда в процессе исследований и разработок.\n\nЕсть несколько способов произвести конкретную молекулу, и некоторые пути синтеза оказываются проще, или дают больше пространства для отклонений, чем другие. Поэтому «четыре вора» стремятся обнаружить пути синтеза, уменьшающие риск токсичных реакций до минимального уровня. В самом начале работы сообщества им помогал в этом стартап Chematica, собравший данные по 250 годам исследований по синтезу в органической химии в базу данных, и разработавший ПО, использующее эти данные для предсказания и создания новых путей синтеза необходимых молекул. С такой базой данных и ПО «четыре вора» смогли создавать простые и безопасные методы синтеза, результатом которых являются лекарства, спасающие жизни.\n\nЭта схема прекрасно работала, пока в прошлом году [Chematica не купила компания Merck](https://www.chemistryworld.com/news/merck-kgaa-to-buy-chematica/3007276.article), международный фармацевтический гигант. После продажи «четыре вора» потеряли доступ к ПО, и, что важнее, к базе данных. Лофер сказал мне, что их команда по изучению данных создала версию ПО от Chematica с открытым кодом, и даже собрала небольшую базу данных по органическим соединениям для проверки. По сравнению с ПО от Chematica, их программа выглядит грубовато, но Лофер сказал, что она работает достаточно неплохо. Однако для её улучшения необходимо собрать больше данных, которые теперь принадлежат Merck.\n\nНо, как известно каждому хакеру, данные иногда «падают с грузовика» – это вежливый способ сказать о том, что базу данных от Chematica выложили на защищённом паролем сайте в «тёмном интернете». Во время доклада на конференции HOPE Лофер просил аудиторию помочь со взломом пароля и выпуском этих данных в мир. Получение доступа к данным от Chematica по путям синтеза распахнуло бы двери к новым вариантам самодельных лекарств, но до тех пор эта ситуация будет развиваться очень медленно.\n\n## Будущее самодельной медицины\n\nСамое дорогое лекарство на рынке называется \"[Глибера](https://en.wikipedia.org/wiki/Alipogene_tiparvovec)\" и используется для лечения дефицита лизосомной кислой липазы, или [болезни Вольмана](https://ru.wikipedia.org/wiki/%D0%91%D0%BE%D0%BB%D0%B5%D0%B7%D0%BD%D1%8C_%D0%92%D0%BE%D0%BB%D1%8C%D0%BC%D0%B0%D0%BD%D0%B0) – редкого наследственного заболевания, от которого во всём мире страдает [всего 7000 человек](https://ghr.nlm.nih.gov/condition/familial-lipoprotein-lipase-deficiency). Заболевание предотвращает нормальный распад жиров, что приводит к болям в животе, острому панкреатиту, увеличению печени и почек, и накоплению жировых отложений под кожей. Лекарство «Глибера» помогает с этими симптомами и критически важно для поддержания качества жизни больных. Единственная проблема в том, что это лекарство обойдётся каждому пациенту в $1,2 млн в год – если они его вообще найдут. В 2017 году компания UniQure, производящая лекарство, [перестала продавать его в Европе](http://uniqure.com/GL_PR_Glybera%20withdrawal_FINAL_PDF.pdf) из-за чрезвычайно малого спроса. Это значит, что примерно [1200 европейцам](https://www.thebalance.com/the-8-most-expensive-prescription-drugs-in-the-world-2663232), страдающих от болезни, очень не повезёт с лечением.\n\nПримерно та же ситуация складывается и с другими [редкими заболеваниями](https://ru.wikipedia.org/wiki/%D0%A0%D0%B5%D0%B4%D0%BA%D0%B8%D0%B5_%D0%B7%D0%B0%D0%B1%D0%BE%D0%BB%D0%B5%D0%B2%D0%B0%D0%BD%D0%B8%D1%8F), которые, по определению, касаются [менее чем 200 000 человек](https://www.fda.gov/drugs/resourcesforyou/consumers/ucm143563.htm) в США. Если лекарство для такого заболевания существует, его стоимость обычно [слишком высока](https://www.thebalance.com/the-8-most-expensive-prescription-drugs-in-the-world-2663232). Если компания не видит достаточно большого спроса на продукцию, она уберёт его с рынка. Поэтому для многих редких заболеваний лекарство или смягчающее средство может существовать, но оно всё равно будет слишком дорогим для пациентов, или недостаточно прибыльным, чтобы его продавать.\n\nВ будущем Лофер хочет, чтобы «четыре вора» сконцентрировались на производстве лекарств для редких заболеваний, чтобы страдающие от них люди не остались без лекарств. Однако у таких лекарств есть свои, уникальные проблемы.\n\nК примеру, Лофер сказал, что многие лекарства для редких болезней производятся из биологического материала, например, из грибков. Лофер сказал, что «четыре вора» работают над созданием сайта BioTorrent, который будет распространять органические материалы для производства редких лекарств. BioTorrent будет работать как обычный ресурс для обмена файлами, вроде The Pirate Bay, но вместо скачивания музыки и фильмов люди смогут скачивать инструкции по синтезу самодельных лекарств и делиться друг с другом органическими материалами. Поскольку биологические клетки способны самовоспроизводиться, одному пользователю просто нужно будет вырастить достаточно клеток для себя, а потом отправить немного клеток другому, который повторит эту схему – примерно так, как люди раздают друг другу файлы на торрентах.\n\nВопрос тогда будет заключаться в том, как дёшево и безопасно пересылать друг другу биоматериал. Для этого «четыре вора» исследуют варианты с книгами и обложками CD в качестве среды для биологических прекурсоров. [Мицелий](https://ru.wikipedia.org/wiki/%D0%9C%D0%B8%D1%86%D0%B5%D0%BB%D0%B8%D0%B9) – это что-то вроде «корней» многих грибков, питающийся целлюлозой, которую легко получить из страниц книги. Поэтому Лофер с коллегами начали делать инъекции мицелия в книги; он питается страницами и вырастает. Компакт-диски напоминают чашки Петри, и если их правильно расцарапать, их можно будет использовать как среду для роста бактерий и других биологических прекурсоров. Преимущество такого подхода в том, что при помощи сайта BioTorrent можно будет рассылать эти клетки, используя более дешёвый тариф для бандеролей, содержащих книги и CD, и при этом избегать внимания со стороны правоохранителей.\n\nНу а пока «четыре вора» в основном занимаются улучшением своей MicroLab и синтезом новых лекарств. Недавно группа начала производить собственные печатные платы для MicroLab, благодаря чему собрать устройство дома станет ещё проще. Лофер сказал, что он планирует раздавать эти платы уже в следующем месяце. В то же время группа работает над доведением до совершенства синтеза \"[Сольвади](https://ru.wikipedia.org/wiki/%D0%A1%D0%BE%D1%84%D0%BE%D1%81%D0%B1%D1%83%D0%B2%D0%B8%D1%80)\" – разового лекарства, способного излечивать гепатит С. Это лекарство присутствует на рынке уже почти пять лет, но его стоимость в $84 000 [делает его недоступным](http://www.latimes.com/opinion/op-ed/la-oe-stone-solvadi-drug-pricing-20160705-snap-story.html) для многих нуждающихся. Если «четырём ворам» это удастся, гепатит С вскоре останется в прошлом для всех, вне зависимости от их доходов.\n\nВ то время, когда многим американцам недостаёт медицинского обеспечения, идеи Лофера кажутся сколь интуитивными, столь и радикальными. Его работа основана на идее о том, что слишком много критически важных решений, касающихся здравоохранение, было отдано частным лицам, которых больше заботит их прибыль, чем здоровье клиентов. Для Лофера дело «четырёх воров» касается не только лекарств, но и права на свободное распространение информации и личную независимость. С его точки зрения, одного без другого быть не может.\n\n«Заниматься наукой – это право человека, — сказал Лофер. – Именно из этого права проистекают все остальные права. – У вас должно быть право делать всё, что угодно, со своим телом, и думать так, как вы хотите».\n\n- Источник: https://habr.com/post/424923/\n- via http://www.balancer.ru/g/p6735569",
			"added": 1538696032
		}
	],
	"topic_vote": {},
	"next_comment_id": 17,
	"comment": {
		"1524682774_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 1,
				"body": "А сегодня близко по теме подняли вопрос на LOR'е: [Пилим ядро правительства так же, как пилим ядро линукс](https://www.linux.org.ru/forum/talks/14171904). Там автора сразу загнобили «_ТС предлагает буквально самим на себя писать компромат. Экстремизм 100%_», так что этот вопрос тут и поднял. Тут можно делать это более-менее анонимно :)",
				"added": 1524682887
			},
			{
				"comment_id": 2,
				"body": "> [rtbishop](#comment_2_1DrzWPNZv2nk14pDzEt9jaAM4RdiFQdE56): А насчет ЛОРа, я и не думал, что так серьезно все в РФ\n\nРеально за такое сейчас никак не привлекают. Чтобы огрести неприятности, нужно реально активно продвигать какой-нибудь терроризм/экстремизм и/или вести соответствующую активность в реале. И то часто сперва пытаются действовать через профилактические беседы и т.п. Как правило громкие дела, типа «оштрафовали за репост свастики» имеют под собой куда более серьёзный комплект действий, чем, собственно, репост. Хотя бывают и исключения…\n\nНо есть такая фигня, как «длящееся правонарушение». С учётом тренда неизвестно, во что всё это выльется через N лет. И относительно безобидное сегодня высказывание может со временем стать опасным. Но, в отличие, от, например, сказанного в реале и забытого, в Интернете оно останется, будет доступно и станет нарушать закон. Это тот случай, когда не работает правило «закон не имеет обратной силы». Потому что после его принятия он относится не к прошлому, а настоящему. И в том настоящем высказанное продолжает нарушать… Такие, вот, особенности информационного мира.\n\nПоэтому всегда полезно, чтобы любое потенциально выходящее за окно Овертона, было неперсонифицировано. И это касается не только России. Вон, пример Каталонии в том же тренде :) Кто знает, что будет ещё через десяток-другой лет. Гайки закручивают всюду.",
				"added": 1524699943
			},
			{
				"comment_id": 4,
				"body": "> [rtbishop](#comment_3_1DrzWPNZv2nk14pDzEt9jaAM4RdiFQdE56): Учитывая количество людей, которое тут с нами обсуждает эту тему, человечество еще не скоро захочет мыслить такими категориями.\n\nТут получается малое множество малого множества, при чём так, что результат — очень небольшая часть потенциально заинтересованных :)\n\nZeroNet вообще имеет ничтожную популярность. Русскоязычное сообщество в ZN маленькое. И ещё меньше среди них тех, кого может заинтересовать эта тема :D\n\nТакое нужно обсуждать в более популярных местах. Но там вылезает проблема небезопасности таких обсуждений. Особенно в перспективе.",
				"added": 1524797743
			},
			{
				"comment_id": 5,
				"body": "> система должна быть прописана очень четко и продумана досконально на существование без новых модификаций\n\nНу да, Великая Хартия, которую нельзя изменять или дополнять :D Проблема в том, что у нас нет политологов, описываемого в Меганезии уровня, чтобы сразу составить исчерпывающий и всё охватывающий документ. Это фантастичный вариант утопии. Так что придётся всё сочинять и чинить на ходу. И тут будет самая первая проблема, как сохранить баланс между стабильностью основной Конституции и хаосом охлократии.\n\n>  Тогда подобное возможно. По крайней мере в сети.\n\nДа. Чисто сетевая реализация имеет ряд качественных отличий от реала. Например, в реальном мире личность монолитна и уязвима. На этом базируются все инструменты принуждения, на которых строится любое государство. В Сети у нас личность в общем случае способна произвольно копироваться и/или стартовать с нуля и уязвима только конкретная копия. Поэтому всевозможные санкции/ВМГС являются средствами, способными подавлять только один виртуальный твинк, но не физического создателя этих твинков. Это является защитой от диктатуры, прямого аналога которого в реальном мире нет. Разве что косвенный, в виде бегства в другое государство.\n\nТаким образом в виртуальном государстве уже получается естественная защита от диктатуры — пользователь всегда может покинуть это виртуальное государство и выбрать (или создать) новое.\n\nОчевидно, что нужно и обратное явление, виртуальное государство должно быть защищено от произвола охлократии. Простое большинство не должно решать важные вопросы, поскольку, в общем случае, это большинство относительно несложно сформировать. Думаю, тут может быть полезен механизм меритократии. Когда граждане не равны и вес голоса гражданина зависит от его рейтинга/репутации. Это же автоматически защищает от лёгкости бросания одних виртуальных личностей и создания новых. Уважаемый член общества будет дорожит личностями с высоким рейтингом. А новички в государстве будут или иметь минимальный вес голоса, или на первых порах не иметь его вообще, пока не станут гражданами из не-граждан.\n\nВот на счёт математики процесса поднятия уровня у меня пока однозначного решения нет. Хотя какие-то наработки есть давно в рамках обычных форумов.",
				"added": 1524972962
			},
			{
				"comment_id": 6,
				"body": "> [rtbishop](#comment_5_1DrzWPNZv2nk14pDzEt9jaAM4RdiFQdE56):\n> Как предотвратить создание фейковых аккаунтов\n\nЕсли человек в состоянии поддерживать несколько активных и положительно оцениваемых сообществом аккаунтов, ведущих какую-то позитивную деятельность — то почему бы и нет? :) А если это будет просто множество пустышек, то у них и вес голоса будет не большой.\n\nВпрочем, высокую информационную активность тоже нужно поощрять.\n\nЧеловек может заниматься разной общественно-полезной деятельностью. Как сугубо внутри системы на уровне «болтологии», так и практической деятельностью, как в реальности, так и в виртуальности. Практическая деятельность должна оцениваться выше. И накрутить её созданием мультиаккаунтов не получится.\n\n> кроме как привязки акка к реальным данным гражданина ко мне в голову не приходит\n\nБоюсь, что так поступать нельзя. Это и сейчас может быть небезопасно и уж точно будет небезопасно, если сообщество наберёт хотя бы минимальную политическую силу в реальном мире.",
				"added": 1525022818
			},
			{
				"comment_id": 7,
				"body": "> [calmaquesse](#comment_2_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): balancer73, а вы читали на Хабре про поселок программистов?\n\nНе помню. Но про подобные затеи слышал не раз. ИМХО, прока не очень много. Программисты с точки зрения социализации мало отличаются от других людей, так что «посёлок программистов» мало отличается, скажем, от «посёлка программистов, учёных и инженеров» :) А с точки зрения совместной разработки программных проектов в реале — интересы всё равно разные и меняются, найти единомышленников в виртуале всё равно намного проще, чем в реале даже в таком посёлке :)",
				"added": 1525496244
			},
			{
				"comment_id": 8,
				"body": "> [rtbishop](#comment_11_1DrzWPNZv2nk14pDzEt9jaAM4RdiFQdE56): Только рейтинг тоже должен быть динамический в реал-тайм.\n\nСовсем реалтайм — не обязательно. Для большого сообщества это будет сложно делать и ещё сложнее обеспечивать взломозащищённость. Можно событийно инициируемый, например. А текущее состояние, если оно меняется, хранить в каком-нибудь блокчейне.\n\n> — Асинхронный, симметрично анонимизированный, модерируемый открытый репутационный аукцион. Даже не пробуй разобрать. Сокращение до-Реконструкционных времён. Настоящей асаморы не проводили три тысячи шестьсот лет. У нас есть другие процедуры для той же цели, и мы называем их старым словом. Обычно проходит несколько дней, прежде чем в репутоновой колбе... не важно... произойдёт доказуемо необратимый фазовый переход, и ещё день нужен, дабы убедиться, что тебя не ввела в заблуждение эфемерная стохастическая нуклеация.\n\n- [«Анафем» — Нил Стивенсон](/1oJQLFq6DYkTw6c4MbZDaFEEocSBvR8FW/?Topic:1525497285_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/)",
				"added": 1525499142
			}
		],
		"1524754909_13Nambun2kMQsdG9vCTvtZSnsivADA2Qro": [
			{
				"comment_id": 3,
				"body": "Я как владелец жирного форума сейчас в недоумении, что делать дальше. Если в Европе всё так жёстко будет, то придётся бросать нафиг вообще обычный Web и закрывать форумы :-/",
				"added": 1524762813
			}
		],
		"1525692962_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": [
			{
				"comment_id": 9,
				"body": "> При этом физическое местоположение как таковое роли не играет, это может быть любая страна, по факту. \n\nВот как раз об этом в основном и думаю :) При чём начинать нужно с чего-то совсем простого. Иначе, в попытках продумать всё до мелочей, оно никогда не взлетит.\n\nОсновная идея — информационная (на первых порах, пока нет перехода в реал) взаимопомощь. Какие-то консультации, советы, обсуждения… В общем, что-то такое, что итак часто бывает во всяких спонтанных форумах и сообществах, но уже на [само]регулируемом уровне. Мыслей тут куча, но надо обдумать всё, а я пишу сейчас на бегу :)",
				"added": 1525695635
			}
		],
		"1537668770_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 10,
				"body": "Фифтипедия должна быть очень простой по созданию/редактированию. Что-то типа Твиттера. Не нужно навороченных редакторов. Создание записи должно быть очень простым и быстрым.\n\nВероятно, к тексту можно/нужно прикладывать картинку-иллюстрацию.\n\nРазметка простая и популярная — очевидно, минимальный Markdown.\n\nСсылки на другие термины могут быть автоматические. Малый размер текста упрощает процедуру автоматического связывания. Плюс привычные #хештеги.\n\nСамое сложное — нужно продумывать систему модерирования. Централизованная порождает диктатуру. Полностью демократическая — охлократию. Нужна какая-то форма меритократии. Вероятно, в духе [рейтингов авосети Стивенсона](/1GmoFQHVjYj4xDZZ5oMNnkGhvnfY1w3pPM/?Post:31:Меритократия+в+модерировании+и+фильтрации+контента).\n\nХочется сделать фифтипедию на базе ZeroNet, они, прямо, созданы друг для друга :) Но, наверное, сперва придётся делать централизованный вариант.",
				"added": 1537669193
			},
			{
				"comment_id": 11,
				"body": "Кстати, Розов пытался интереса ради поднять аналог на базе MediaWiki: https://alex-rozoff.livejournal.com/43963.html\n\nНо сейчас оно не живое.",
				"added": 1537669352
			}
		],
		"1540326324_15FFG1whKeyhA5dzqYVpntEMEomvUMc4Hw": [
			{
				"comment_id": 12,
				"body": "Всё же, по продолжительности жизни там хуже, чем у прямых соседей:\n\n![](https://gateway.ipfs.io/ipfs/QmZC4G6Rn1oRxsfi8BdUSvyVHUaza3JbrqQjFWSwTcyc5J/2018-10-24_10-16-30-somalia-life-expectancy.png)",
				"added": 1540365660
			}
		],
		"1541101117_15FFG1whKeyhA5dzqYVpntEMEomvUMc4Hw": [
			{
				"comment_id": 13,
				"body": "> [anotherneko](#comment_2_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Разве? Первый запуск же на декабрь вроде перенесли.\n\nСамое весёлое тут, что Россия как раз участвует в выведении :)\n\n> Контракт предусматривает выведение 672 аппаратов базовой спутниковой группировки на целевую околополярную орбиту высотой 1200 километров, в составе комплексной головной части ракеты-носителя, массой до 5,5 тонн на один запуск. Всего планируется за 21 запуск вывести на орбиту 672 аппарата. То есть на каждой ракете-носителе «Союз 2.1б» будут выводиться по 32 аппарата, весом не менее 150 кг каждый[14]. Первый пуск для OneWeb намечен на 19 августа 2018 года с космодрома Куру во Французской Гвиане. Всего на 2018 год пока намечено два пуска, на 2019 год — 12 пусков, на 2020 год — два пуска[15][16].\n\n\n> В мае 2018 года исполнительный директор по развитию бизнеса и коммерциализации госкорпорации Роскосмос Антон Жиганов сообщил, что создано совместное предприятие ООО «УанВэб» с участием британской компании OneWeb и российского АО \"Спутниковая система «Гонец»[17].\n\nА первый запуск уже на начало 2019 перенесён:\n\n> \"Первый квалификационный пуск по программе OneWeb должен быть выполнен с космодрома Куру – в полёт на ракете-носителе \"Союз-СТ\" с разгонным блоком \"Фрегат-МТ\" должно отправиться 10 спутников. Ориентировочной датой старта является 7 февраля 2019 года\"",
				"added": 1541187087
			},
			{
				"comment_id": 14,
				"body": "> [l8](#comment_1_15bXfYrgn11ULbJ71nHqDrERcxNotpYsqP): Да вроде бы нет уже. :-)\n\nПока — да: https://www.fontanka.ru/2018/12/07/137/",
				"added": 1544254543
			}
		],
		"1538696038_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 15,
				"body": "> [cocaineninja](#comment_1_14MeN6afdY8nQxnW2CzM61mVjtrSind1uY): У нас не взлетит - доступ к прекурсорам порезан и лекарства которые используются как исходники тоже хрен купишь.\n\nИх тоже можно синтезировать при желании :)",
				"added": 1545192536
			},
			{
				"comment_id": 16,
				"body": "> [l8](#comment_4_15bXfYrgn11ULbJ71nHqDrERcxNotpYsqP): Да, всё верно; и поехать сразу лет на восемь-двенадцать. :-)\n\nЗа синтез прекурсоров, слава Богу, у нас пока не сажают :)",
				"added": 1545388313
			}
		]
	},
	"comment_vote": {}
}