{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Mais um episódio da censura deliberada",
			"body": "PERFIL ESQUERDISTA INTIMIDA EMPRESAS ANUNCIANTES PARA CALAR A DIREITA\nhttps://criticanacional.com.br/2020/05/20/denuncia-perfil-esquerdista-intimida-empresas-anunciantes-para-calar-a-direita/\n\nEmpresas que estão apoiando ‘censura’ ao Jornal da Cidade Online perdem clientes de maneira avassaladora\nhttps://www.jornaldacidadeonline.com.br/noticias/20631/empresas-que-estao-apoiando-censura-ao-jornal-da-cidade-online-perdem-clientes-de-maneira-avassaladora",
			"added": 1590098544
		},
		{
			"topic_id": 2,
			"title": "Idosa morre com dengue e família denuncia certidão de óbito com suspeita de covid-19",
			"body": "https://www.tercalivre.com.br/idosa-morre-com-dengue-e-familia-denuncia-certidao-de-obito-com-suspeita-de-covid-19/\n\nEm Cruzeiro (SP), a idosa Maria de Fátima Macedo Euzébio, de 64 anos, faleceu na última quinta-feira (14) diagnosticada com dengue, mas foi colocada entre os casos de mortes suspeitas de covid-19.\n\nO resultado do exame saiu dias depois da morte, dando negativo para a doença. Nas redes sociais, o filho da idosa falou sobre sua revolta com o caso.\n\n\"Gostaria de compartilhar com todos o grande sofrimento que toda família passou, no falecimento da minha mãezinha, no cumprimento de um um protocolo mal conduzido\", publicou.\n\nDe acordo com ele, a perda foi um grande trauma. \"Minha mãe vinha sofrendo com dengue, ficou debilitada, e acabou acometida de uma pneumonia, sendo necessária sua internação\", explicou o filho.\n\n\"Eis que quando recorremos à Santa Casa de Misericórdia de Cruzeiro, munidos dos exames e declarando a condição clínica da minha mãe, não nos deram nenhum direito à contestação, não nos deram a mínima atenção e por protocolo a internaram na área de isolamento com suspeita de COVID-19\", acrescentou ele.\n\nAinda conforme a publicação, em menos de 24 horas depois o falecimento foi confirmado e a declaração de óbito da Santa Casa saiu com registro de suspeita de COVID-19.\n\nA idosa seguiu para sepultamento direto com caixão lacrado, sem que a família tivesse direito a um velório digno.\n\n\"Minha mãe não pode ser acompanhada por ninguém da família durante sua internação, direito que lhe assistia devido à sua idade. Minha mãe nos deixou com 64 anos. Tenho plena convicção que ainda estaria conosco se estivesse sido direcionada para ala comum e pudesse ser acompanhada por um familiar. Morreu sozinha, abandonada, da forma que mais temia, partiu sem direito a despedida, devido a um protocolo aplicado de forma incompetente. Lamentável, desumano, só agravou nosso sofrimento\", desabafou ainda o rapaz.",
			"added": 1590098817
		},
		{
			"topic_id": 3,
			"title": "Carta de Donald Trump para Tedros Adhanom",
			"body": "Prezado Sr Tedros,\n\nNo dia 14 de Abril de 2020, eu suspendi as contribuições que os Estados Unidos da América repassavam para a OMS, com base em uma investigação, em que minha administração concluiu a falha em responder à pandemia do Covid-19. Esta revisão confirmou muitas das preocupações que eu evidenciei no mês passado e identificou muita outras que a OMS deveria ter se ocupado, especialmente os avisos de pouca independência do povo da Republica Popular Chinesa, baseado neste relatório nós agora sabemos.\n\n- A OMS constantemente ignorou relatórios confiáveis de que o vírus estava se espalhando por Wuhan já no começo de dezembro de 2019, isso se já não antes, incluindo relatórios da Lancet Medical Journal. A OMS falhou em não dar credito a relatórios confiáveis que vinham de fontes de dentro do governo chinês, sendo que esses relatórios vinham direto de Wuhan.\n- Não mais tarde que 30 de Dezembro de 2019, o escritório da OMS em Pequim sabia que havia uma preocupação de interesse público em Wuhan. Entre 26 de Dezembro e 30 de Dezembro a mídia chinesa já noticiava a evidência de um novo vírus vindo de Wuhan, baseada em dados coletados em pacientes e enviados a companhias de genomas chineses. Ainda mais, durante este período, Dr Zhang Jixian um médico da província de Hubei reportou a autoridades sanitárias chinesas que um novo vírus já havia infectado aproximadamente 180 pessoas.\n- No dia seguinte, autoridades de Taiwan informaram a OMS de que o vírus transmitia-se de humanos para humanos e mais uma vez a OMS ignorou estas informações, provavelmente por questões políticas.\n- As regras internacionais de saúde exigem que os países informem riscos a saúde em 24 horas, mas a China não informou a OMS que em Wuhan, já existiam muitos casos do vírus em 31 de Dezembro de 2019, e que provavelmente muitos casos já eram de semanas anteriores.\n- Segundo Dr Zhang Yongzhen da clinica de saúde publica de Shanghai ele informou as autoridades chinesas em 5 de Janeiro de 2020 que havia encontrado a sequencia do genoma do vírus, contudo não houve nenhuma publicação sobre isto antes de 6 dias, em 11 de janeiro de 2020 quando o Dr Zhang publicou por conta própria. No dia seguinte o governo chinês fechou seu laboratório para \"reparos\". Como a OMS sabe, a publicação do Dr Zhang foi um ato de transparência, mas a OMS foi complacente e silenciosa tanto ao fechamento do laboratório e ao fato do relatório ser publicado com 6 dias de atraso.\n- A OMS por várias vezes em seus relatórios deixa clara a falta de precisão e liderança.\n\n    Em 14 de janeiro de 2020 a OMS reiterou que, segundo a China, em estudos preliminares conduzido por autoridades chinesas de que não havia evidências da tranmissão do vírus entre humanos. Este estudo entra em conflito com os relatórios vindos de Wuhan.\n    Em 21 de Janeiro de 2020 o presidente chinês Xi Jinping pressionou vocês a não declarar a emergência da pandemia. Vocês cederam a sua pressão no dia seguinte dizendo que a doença não representava um perigo internacional, porém na semana seguinte, em 30 de Janeiro de 2020 com as fortes evidencias que surgiam vocês reverteram a decisão.\n    Em 28 de Janeiro de 2020 depois de uma reunião com o presidente Xi Jinping, vocês o elogiaram pela transparência em relação ao controle do corona vírus e anunciaram que a China tinha um novo protocolo de controle e que salvaram o mundo. O que você não mencionou foi que a China silenciou e puniu muitos médicos que falaram ou publicaram informações dobre o vírus.\n\n- Mesmo depois de declarar a pandemia em 30 de Janeiro de 2020, vocês falharam em pressionar a China para fazer com que médicos especialistas da própria OMS começassem os trabalhos. Como consequência, essa equipe de especialistas chegaram à China somente 2 semanas depois, em 16 de Fevereiro de 2020 e ainda assim a equipe não pode ir até Wuhan, somente nos dias finais eles puderam ir até a cidade. Vocês silenciaram-se diante do fato que dois médicos americanos nunca tiveram a permissão para ir até Wuhan.\n- Vocês ainda elogiaram a China quando eles restringiram viagens internas, mas inexplicavelmente foram contra a minha orientação de fechar as fronteiras americanas para a China com o argumento que eu deveria respeitar o povo chinês. Mesmo assim eu impus as restrições independentes do que vocês podiam pensar. Seu jogo politico foi mortal, pois outros governos atrasaram suas decisões. Incrivelmente em 3 de Fevereiro vocês reforçaram suas posições, dizendo que a China fazia um grande trabalho protegendo o mundo do vírus e que as restrições de viajem fariam mais mal do que bem. Agora o mundo sabe que antes das restrições em Wuhan, as autoridades chinesas permitiram a saída de 5 milhões da cidade e que muitas destas pessoas viajaram pelo mundo.\n- Em 3 de Fevereiro de 2020 a China pressionava os países a relaxarem as restrições. Esta pressão foi turbinada por suas notas oficias que estavam erradas, onde diziam que a pandemia era de risco mínimo, que o vírus era lento e que a chance de sair da China era muito pequena.\n- Em 3 de março, a OMS, citando as autoridades chinesas minimizou a possibilidade do sério risco de contágio assintomático dizendo ao mundo que a Covid-19 tinha a transmissão mais lenta que uma gripe normal. E que ao contrario de uma gripe normal, esta doença não tinha a características assintomáticas e que apenas 1 % das pessoas infectadas eram assintomáticas, contudo vocês ignoraram relatórios de outros países como a coreia do Sul e Japão que evidenciavam o contrario. Agora nós sabemos que as informações espalhadas ao mundo pela China através da OMS estavam erradas.\n- Finalmente em 11 de Março de 2020 vocês declaram emergência global, após 4.000 mortes e 100.000 infectados mundo a fora.\n- Em 11 de Abril de 2020 vários embaixadores do continente africano escreveram para as autoridades chinesas relatos de discriminação a cidadãos africanos (continente) na cidade de Guangzhou e outras cidades chinesas. Você sabe que o governo chinês impôs quarentenas desnecessárias e negou tratamento a pessoas vindas do continente africano. Mais uma vez você se calou diante dos atos racistas em relação a estas pessoas, mas deu sua benção quando a China acusava Taiwan de ser racista.\n- Durante esta crise a OMS curiosamente sempre elogiou a transparência da China, sempre aderiu aos seus relatórios e fez de conta não entender que a China pode ser tudo menos transparente. No começo de Janeiro por exemplo a China destruiu amostras do vírus negando ao mundo informações importantes. Mesmo agora a China continua desrespeitando leis internacionais se recusando em compartilhar dados, amostras e escondendo informações sobre a origem do vírus. Ainda hoje a China nega acesso a cientistas de fora e censura seus próprios cientistas.\n- A OMS falhou em não exigir publicamente da China uma investigação independente da origem do vírus, mesmo com o pedido oficial de vários países no chamado comitê de emergência. Prontamente os países membros da OMS assinaram a resolução do ano onde exigem uma investigação independente sobre as origens do vírus e também uma investigação de como a OMS administrou a crise, além de buscar uma solução para como conter os efeitos da doença pelo mundo.\n\nTalvez além de todas estas falhas fica a sensação de que a OMS poderia ter feito melhor. A poucos anos atrás sob uma diferente administração a OMS mostrou ao mundo o que é capaz de fazer, em 2003 durante a crise da SARS na China, a diretora geral Harlem Brundtland declarou a primeira emergência global em 55 anos, recomendando o banimento de viagens ao país epicentro, a China, e não poupou palavras para criticar a maneira que a China tentava esconder do mundo a doença e a censura da imprensa, muitas vidas teriam sido salvas se os exemplos de Brundtland fossem seguidos.\n\nEstá claro que os seus passos em falso e da organização cuja qual você responde, custaram muito ao mundo Existe apenas uma única maneira de ir adiante e de demonstrar independência da China, minha administração já iniciou conversas com a sua para reformar a OMS, porém, ações rápidas são necessárias, não temos tempo a perder. Então meu dever como presidente dos Estados Unidos da américa é informar que, se em 30 dias ações não forem tomadas o atual congelamento de verbas vai se tornar permanente, também vamos revisar nossa permanência dentro da organização, não posso permitir que milhões de dólares dos pagadores de impostos americanos sejam desperdiçados com uma instituição que já não os representa.\n\nAtenciosamente,\n\nDonald J Trump.\n\nTradução: Ivan Kléber",
			"added": 1590100102
		}
	],
	"topic_vote": {
		"1_1FZeKLwV1NTmi5V5baKDy4pgCVYCrfz1W": 1,
		"1_1JhdguyALfj6NzqqX6WtzNVY1EQvPjY9wF": 1,
		"1_1Anr114gznurn8nhMnQAwkfSTri4fZ7W9X": 1,
		"1_1Migqh7ByHiWFh2qktJX7hHva3rCrmdnEE": 1,
		"1_12ULyZCFEFZpoT7vNoiwD7tuHexf5dfcfr": 1,
		"1_1BFBjuCdneaiFSpRfnfcC918mWJPQQ1ETa": 1,
		"1_1BmJFwSfmH9P2of7cCzh4qg5CPV5swsmr4": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1_1JhdguyALfj6NzqqX6WtzNVY1EQvPjY9wF": [
			{
				"comment_id": 1,
				"body": "Uma coisa eu sei... o controle pelo medo está tendo o resultado esperado pelos novos ditadores. Eu saio na rua sem máscara, as pessoas me olham como um irresponsável. O medo funciona! E a grande mídia sabe perfeitamente como usar.",
				"added": 1589977253
			}
		],
		"1_12ULyZCFEFZpoT7vNoiwD7tuHexf5dfcfr": [
			{
				"comment_id": 2,
				"body": "> [1to0](#comment_2_1FZeKLwV1NTmi5V5baKDy4pgCVYCrfz1W): Creio que precisamos criar serviços de qualidade aqui, seria interessante reunir um time de programadores para trazer serviços populares da surface web pra cá, e desenvolver tecnologias (penso em aplicativos de celular) para tornar o acesso aqui mais fácil, pessoas comuns não tem interesse em chaves privadas, endereços de site incompreensíveis, etc\n\nEu vi que tem um aplicativo no Google Play chamado \"ZeroNet Mobile\", mas não testei ainda. O que eu acho mais complicado é a forma que os dados são armazenados. Se é de forma descentralizada, uma pessoa que troca de celular, como vai recuperar facilmente seus dados? Esse problema é fácil  de resolver em rede centralizada, mas nessa rede, temos a vantagem da independência de um controle mas perdemos essa comodidade.",
				"added": 1595985693
			}
		]
	},
	"comment_vote": {
		"1_12ShAsoQVkbEgqfjS2JmXt7cXBSbf8ifuS": 1,
		"3_1MmWLh75HG1yfzP1TtTdAwPkeBJEBxQ8me": 1,
		"6_1MmWLh75HG1yfzP1TtTdAwPkeBJEBxQ8me": 1,
		"2_1HdC3ETJQNxS3vzaaMUG5Bbz7XwgaFj6D2": 1,
		"2_1FZeKLwV1NTmi5V5baKDy4pgCVYCrfz1W": 1,
		"1_1K9Lb385kfM4jV3HcqA953MjeYfLbdWCX": 1,
		"1_1H11yU7752knxfrUmVV74GXKo7X1op5L5e": 1,
		"1_15Pmd1M5xiBpCP8vcs1JYqYtgJNje2kvKb": 1
	}
}