{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1621843317,
			"title": "To Save Brazil, Jair Bolsonaro should do...",
			"body": "So the situation is dire ! a fucking globalist agent may win the next election. How to prevent such a tragedy? \n\nIn my modest and humble opinion, I think that Jair should do the following :\n\n1. ensure election integrity, we know the globalist agents don't give a shit about election integrity. As such to make legislation mandating death penalty for all the organizers of election fraud caught, and long jail sentences for the operatives (the suit case in the usa, the boarded windows, the ballot harvesting, the ballot injection, the machine hacking, etc).\n\n2. make brazil smile again, and nothing beat a little bribe to relaunch the hospitality industry ! So small checks to each registered house hold, only spendable with an ID proof (that will incite ID registration for the voting rights) on bars, restaurants, hotels and little stands. The checks should be dispatched for example 1 for each week, during 8 weeks. So yes it's a small amount, like a mid range priced dinner for 4 in a restaurant... but at least it will relaunch the sector and make all brazilian smile, and frankly it's quite cheap.\n\n3. legalize the private growing of ALL the plants of the creation, but at least weed. nothing will stand in your path, and your family will be seen as heroes of liberty for all brazilians who carry. For example allow the private growth of 100 cannabis plants for each brazilian household, but still keep the trade illegal, so that the black market has time to reorganize and still means to live... I know, the more you wait in idiocy in dogma, the more you lose. A war on plants of the creation of God is only what Demons whould attempt, to lose and be destroyed with all they tricked to believe in them...\n\n4. finally and it's more general, find a way to create MASSIVE wealth without becoming a natural ressources harvester ! I know it's so easy to go to the rain forest, plow it, sell the wood, burn the rest and put some cows. I believe that Brazilians can like all people achieve better, but it requires to resist temptation to be a simple unsustainable locust.\n\nShow us, or perish like pedotrump and all his goons and morons and zealots.\n\nAnd you what would you advice Jair to do?\n\nps and change the fucking side of the hair cut ! it's RIDICULOUS ! something more fun ! Go even to a tv show, you know the relooking ones, everything preplanned of course ! but what is this side? it's so lame... I won't launch in a comparison with some kind of retronazi fashion style... Go have some fun and come back with an idea for this new hair cut for the relooking show ! Go...",
			"added": 1621843316
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 1,
				"body": "Priviet Komards !\n\nWhat a great news to see the little shit bag taken down ! I hope he will rote and die in the gulag system. I have a profound hate for all those \"western\" (pedo child rapist feodalist white genocidists cleptocrat artistocrats) collaborators seeking the downfall of any nations they don't control. Furthermore I am in favor of a death squad training toward the girl... time to end this farce and send the agents of the cia in coffins... I know for some unaware it may sound quite brutal, but once the western forces are understood, it's clear that only massacring them is the answer.\n\nNow a few question :\n\nWhat's wrong with https and \"unbreakable\" encrypted digital communications? Why no crypto massive centralized exchange in the Russian Federation (too hard to code maybe?)? And why didn't armenia joined the russian federation as an autonomous republic, as it would solve all their neighborhood problems and what is the security agreement with it? Where are we on marijuana legalization?",
				"added": 1621842058
			},
			{
				"comment_id": 3,
				"body": "I was quite surprise to see almost no reports of the meeting between the \"ballerina\" aka the puppet of victoria, \"mr\" anthony and Sergey... What a contrast. I guess the little fucker imposter part of the regime change didn't fooled the \"old\" wolf... but honestly, blinken is so gay. How is vicky going? As always seeking to kill and rape goyim?\n\nI am equally surprise to see any interests from this removal of another cia agent from the plane. Everything went super smoothly, no one was hurt, and just a moderate acceptable delay to remove it. I am not suprised that at the same time the treasonous enemies of mankind western propaganda is pumping this narrative while Miss Meng, Assange and all the PEACEFUL PARTICIPANTS TO THE JANUARY 6th STORM of the Corrupts Hill are still held hostages, while justice for all the victims of the pedos (western rulers) is still MIA.\n\nFinally, there were some plans for a bidet / putin meeting... After a lot of reflection, I think Berlin Brandenburg airport is perfect for such a meeting. Specially in the context of NS2. By the way, does this airport finally operates? It took less time to build and operate the whole new Beijing Airport Complex... What do you think they will put bidet on? Captagon? He looks paler...",
				"added": 1621922395
			},
			{
				"comment_id": 5,
				"body": "And no positive comment or experience from the apparently excellent welcoming by the Icelandic authorities? I mean of course the western representatives are fuckers, but didn't the Icelandic authorities and people did their best to welcome those meetings? I mean, anything positive back from Iceland? Impossible not to! what do they drink? And factually, there was no security problems... for now (biologic, psywarfare etc... to be evaluated). Or this meeting was so bad? Maybe a more courteous visit to Iceland... I still  believe that cultural exchange between the federation and iceland won't hurt russia... I have a difficulty to imagine the icelandic people seeking to invade russia, however their \"rulers\", who knows, who they have to really serve...",
				"added": 1621924565
			},
			{
				"comment_id": 6,
				"body": "Q: \n\nReally I don't understand the point of this meeting... Unless it's to create a COMMON FRONT AGAINST THE PEOPLE REPUBLIC OF CHINA...\n\nWHY?\n\nIs the switzerland a neutral country, which impose sanctions (ACTS OF WAR) against RUSSIA ?\n\nhttps://www.rt.com/business/183296-switzerland-sanctions-russian-lenders/\nhttps://www.bbc.com/news/business-28833360\nhttps://en.wikipedia.org/wiki/International_sanctions_during_the_Ukrainian_crisis\n\nI don't get.\n\ntwo old white men, seeking to jail people for the plants of the creation meeting, and seeking to legitimize their THRONES and REGIME PRIVILEGES?\n\nIs it really a cause of concern? At least contrary to june 25 1950, now, everything is HOME MADE.\n\nBut what I really hate the most in this meeting, is that \n\n1. it's a yuge security risk for putin, a Archduke Franz Ferdinand of Austria or more Empress Elisabeth of Austria plan...\n\n2. meeting in the hearth of the ONE WORLD ORDER? To enslave even more MANKIND to plow and destroy the will of all nations on EARTH, including ISLAM?\n\n3. the legitimization of the regime change of the Former REPUBLIC OF THE UNITED STATES OF AMERICA... and I think that's the thing I HATE THE MOST IN THIS. This will to not being able to resist the will to humiliate the country that single handed without a single shot defeated and exploded SOVIET UNION with SUPERIOR VALUES ! VALUES OF LIBERTY, on which death bed, and assassinated by those who pushed Bidet, you seek to meet.\n\nAnd remember, little round eyes, who said that liberty was something of or for white men? we are buzy raising a \"rowy\" dragon... \n\nat the civilization time, see you soon... we know, we saw china towns, first in America...\n\nAnd finally I am very humiliated (kidding) because my berlin airport project was way cooler for everyone, faster etc... because what is the outcome of this? big guys collecting their fees in various forms, including slaves?\n\nwhat? ahhh I forgot, serfdom has returned to russia, or did it ever left? just a owner shift...\n\nit's now time for dennic to disappear in the void and irrelevance of the cyberspace... as the older they get, the more incompetent, but rigid too... sclerosised.\n\nlast q : what happen if putin is assassinated? at least stop to jail serfs for plants...",
				"added": 1622000058
			}
		],
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 2,
				"body": "Beyond the handlers of Esptein, Weinstein, Adelson, I wish too the death of all the israelis and jews worldwide who have supported the end of the apartheid in South Africa (white genocide), and find that again Karma stroke... What you wanted is to kill all whites in south africa, use the money of the federal reserve to then buy all the assets on the cheap and laugh about our killing? You did, little fuckers... I know it. I find just very interesting that now it's your turn, to be qualified as an apartheid state... The only difference with us deep shits, is that you fight ISLAM, they have TRILLIONS and Billion ready to be bred, fight and die for the cause. So enjoy to have destroyed us in South Africa, and laugh... I don't know how long you will. Yes I have turned ULTRA NEGATIVE, until you EXECUTE those aforementioned. Your call...\n\nps forget your noahid law pathetic take over attempt, you have no fucking standing chance against PLA and even less against ISLAM, even divided.",
				"added": 1621842322
			},
			{
				"comment_id": 4,
				"body": "> [freepalestine](#comment_1_1H7zNGEgo9AgbdKHhwoWzfeNqrav5RJZk): Israel is an Apartheid state - has been for many years. Not 'news' by any stretch, glad that the rest of world is now catching up....\n\nThe problem is quite inextricable, in my humble opinion. The Jews know that the 1st, 2nd, and 3rd temples stood on the hill of Jerusalem, which they called the temple mount. And the last edition was destroyed in 77 AD by famous roman legions under the wise and prudent and successful leadership of a certain Titus (he has a little victory arch before the Coliseum, by the way) and some say that to really annoy the jews, the Romans stole some stones of their principal temple to build the said Coliseum :).\n\nOn the other side, certain interpretations of the Quran emphasize the concept of the Dunya, the so called reality of the so called living, between birth and death in this universe. If I may try to re-conceptualize it, it's from dust to dust, all by the will of God. In short, the first mosque build by PBHU himself in today KSA was razed :). Don't take idols, from statues to buildings, rather than the things, the deeds. For me this philosophy has a serious root in anti romanism, in the sense that the romans went completely idolaters with their statues everywhere, bigger than life even vs \"the aseptic of Islam\". \n\nSo in short the jews wants their temple back, vs the muslisms who want the mosque. The question is who wins, who loses?\n\nIt's mathematically impossible to make both wish true, at least at the same time. Illustrating again why this post uprising from the non jewish population of israel, CO-EXISTENCE now broadcasting worldwide is another total fallacy and disillusion of those \"leaders\", well hidden behind the high walls of their castles, and always over guarded by their praetorian guards...  \n\nYou know what the acronym DPP stand for? I guess it sound cooler in Latin... (I let you train your little brain)\n\nPersonally I don't believe in \"co-existence\", I believe in Dominance, well explained by the old saying : in ROME (real, not the italians) do as the romans... DO... wear your rags savages, we don't care, have your ways (food etc) but don't fucking believe for ONE instant to be the LAW or you will pay dearly for this affront.\n\nMeaning that in KSA, do as the king ask or don't come or leave, fast.\n\nFor me co-existence is a dream of the tax harvesters, they want the slaves, of all origins, customs, and traditions, to be exploited harmoniously, aka without distrubances for the slave owners.\n\n> [freepalestine](#comment_2_1H7zNGEgo9AgbdKHhwoWzfeNqrav5RJZk): 100%\n\neven the unborns :).",
				"added": 1621923971
			}
		]
	},
	"comment_vote": {}
}