{
	"title": "keed\n",
	"description": "web zer0\n.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 26,
	"demo": false,
	"modified": 1478564433,
	"post": [
		{
			"post_id": 25,
			"title": "Days of The New",
			"date_published": 1478564234,
			"body": "New times and the old might be the new.  Love how I can run Zeronet on a new machine with my old config. This is pretty neat.\nRunning it on Archlinux. Good times"
		},
		{
			"post_id": 24,
			"title": "Hacker Extraordinaire",
			"date_published": 1474207493,
			"body": "A sick read.  Dude is leet.  And the net is a security nightmare.\nhttp://www.vanityfair.com/news/2016/09/welcome-to-the-dark-net"
		},
		{
			"post_id": 23,
			"title": "Population ",
			"date_published": 1473709375.156,
			"body": "victims trickling in\nto get treated for life\nlife is a monster\neats us for a living\nthe dead is a luxury\nburial is golden\nbut they prefer to trickle in\nto the house of the flies\n\n#poetry"
		},
		{
			"post_id": 21,
			"title": "Labor Day",
			"date_published": 1472962066.175,
			"body": "Summer ending with a bang or a storm. Tropical storm Hermine might bring the rain to mar the Labor day weekend in the city. Kinda apropos for the Summer to splash out rather than slink away guilty. I have no plans but to take it all in wherever I land. "
		},
		{
			"post_id": 20,
			"title": "Fuschsia from Google",
			"date_published": 1471381773.417,
			"body": "Here comes Google's new OS not based on Linux. http://hackerboards.com/is-fuschsia-googles-answer-to-samsungs-tizen/"
		},
		{
			"post_id": 19,
			"title": "Floating Home",
			"date_published": 1471199915.302,
			"body": "I am mind blown. This is freaking amazing. Could I live like this totally of the grid? Maybe not.\nhttp://www.digitaltrends.com/home/floating-home-weekend/?utm_source=feedly&utm_medium=webfeeds\n\n"
		},
		{
			"post_id": 18,
			"title": "Mute",
			"date_published": 1470939376.477,
			"body": "Summer mute days. Olympic days.  Spending my time screaming at the computer.  Am streaming all the competitions using kodi.  Sometimes everything works and other times links are broken. Basically I take what I can get because I don't have cable tv.  I slashed that cord years ago.  Everything I watch comes from the web. Has worked out pretty good but streaming sports can be irksome.  No netflix offerings for real time sports streams. Maybe in the future there will be more sources than NBC and the soccer streaming available. "
		},
		{
			"post_id": 16,
			"title": "Yours",
			"date_published": 1470070873.273,
			"body": "New network that rewards its content creators in bitcoin.\nhttp://bravenewcoin.com/news/bitcoin-based-content-platform-yours-attracts-overwhelming-interest-from-investors/"
		},
		{
			"post_id": 15,
			"title": "New Poetry Book Published",
			"date_published": 1469103598.698,
			"body": "I have just published Hands in Flux my newest book of poems on the amazon kindle platform.  20 poems of restlessness. :)\nhttps://www.amazon.com/dp/B01ISIRMEW/ref=cm_sw_r_tw_dp_y-kKxb71A7E7Z#navbar"
		},
		{
			"post_id": 14,
			"title": "Mr Robot",
			"date_published": 1468772928.869,
			"body": "Welcome to the hacker space. Mr Robot is streaming again in all it's dystopian hacker glory. Elliot is weirder than ever. The invisible man Slater is crazier than ever. My favorite show on tv. They get the tech right even more so than season one. The Linux commands are 99.9% correct. A real geek fest with psychological and sociological underpinnings. http://www.usanetwork.com/mrrobot"
		},
		{
			"post_id": 13,
			"title": "Mr Robot",
			"date_published": null,
			"body": "Welcome to the hacker space. Mr Robot is streaming again in all it's dystopian hacker glory. Elliot is weirder than ever. The invisible man Slater is crazier than ever. My favorite show on tv. They get the tech right even more so than season one. The Linux commands are 99.9% correct. A real geek fest with psychological and sociological underpinnings. http://www.usanetwork.com/mrrobot"
		},
		{
			"post_id": 12,
			"title": "Steemit",
			"date_published": 1468481397.394,
			"body": "[Steemit](https://steemit.com/) is the latest cryptocurrency platform with a unique twist. It pays you to blog. Pays you in steem the currency of the platform. You can exchange for bitcoin.  A rather interesting radical concept that might shake up the cryptocurrency ecosystem once again. Time will tell."
		},
		{
			"post_id": 11,
			"title": "Summer",
			"date_published": 1468060357.117,
			"body": "In the heat of summer. Days and nights are pretty much the same.  I am a lot more active than in the cold months. Spending my days mostly outside in coffee shops drinking ice tea and writing like a man possessed.  Soon am publishing my new kindle poetry book. I try to be productive everyday. Can't waste the summer. It goes too fast.  The money hustle is still on. I worked on two machines yesterday. Windows machines are pieces of work man. Seriously."
		},
		{
			"post_id": 9,
			"title": "Ubuntu Touch on Nexus 4",
			"date_published": 1460769667.834,
			"body": "I installed Ubuntu Touch on my Nexus 4 after it fell and the screen cracked and I bought the Nexus 5x.  The install was a cinch.  I was up and running in no time. The phone runs just as smooth on Ubuntu Touch. Wifi works well. No hiccups with bluetooth.  I love the scopes idea. Feels natural swiping them to find the program I need. Ubuntu went against the grain and created a winner in my book. The biggest issue is lack of apps and those available are not updated regularly.  It won't take over the mobile world but am definitely using it as my second handset. "
		},
		{
			"post_id": 7,
			"title": "A Guide To The Octopi Graphical Package Manager Within Manjaro",
			"date_published": 1460137974.512,
			"body": "http://linux.about.com/od/soft/fl/A-Guide-To-The-Octopi-Graphical-Package-Manager-Within-Manjaro.htm?"
		},
		{
			"post_id": 6,
			"title": "Linux woes and Flexibility",
			"date_published": 1459600484.94,
			"body": "So I jumped on Ethereum. Started mining but just cpu. And I really wanna gpu mine. but nvidia card sucks in Linux. Driver issues. I messed with it and it broke X. Killed my day. Luckily I got other machines. I wiped debian installed centOS. now I can't mine ethereum. Another error. No way am breaking centos. I installed docker in centos. then installed ubuntu in docker. and voila I can mine again. Will see whether my gpu kicks in."
		},
		{
			"post_id": 5,
			"title": "Dropouts need not apply\n",
			"date_published": 1459385885.74,
			"body": "Dropouts Need Not Apply: Silicon Valley Asks Mostly for Developers With Degrees http://blogs.wsj.com/economics/2016/03/30/dropouts-need-not-apply-silicon-valley-asks-mostly-for-developers-with-degrees/"
		},
		{
			"post_id": 4,
			"title": "desktops",
			"date_published": 1459107830.137,
			"body": "figuring out how to post images here hehe"
		},
		{
			"post_id": 3,
			"title": "explorer\n",
			"date_published": 1459012239.046,
			"body": "yea am exploring digging to the bone. "
		},
		{
			"post_id": 2,
			"title": "radical",
			"date_published": 1459007992.275,
			"body": "this is radical. kinda visionary. let's see where it takes us!!"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}