{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 2,
			"title": "INTERNETTEL A TÖRVÉNYHOZÁST A NÉP KEZÉBE A POLITIKOSOKTOL!",
			"body": "A decentralizált nyílt forráskódú technológiákkal. Ahol a weboldalak a felhasználók számítógépéin tárolódnak, és így mindenkinek átlátható az oldal forráskódja. Nem egy manipulálható központi szerveren tárolódik az oldal. Fel kéne építeni egy rendszert ahol politikusok kezéből kivéve mi magunk hoznánk és szavaznánk meg a törvényeket. A rendszer fenntartása olcsó lenne.Minden adott hogy mi magunk hozzunk létre törvényjavaslatokat. Módosítsunk és szavazzunk meg törvényeket. jelöljünk ki tudásuk és benyújtott ötletek alapján embereket feladatokra. Mindezt egy maréknyi parazita a népen élősködő zsarnok nélkül!\n+\n+\n#Miért is lenne erre nagy szükség?\n+\n+\n+\n+\nMert egy látszat demokráciában élünk. A médiát teljes egészében egy elit réteg irányítja. A kormány és az ellenzék is teljes egészében az irányításuk alatt van! Amit művelnek az teljes egészében a nép és az emberiség ellen van.Ők döntik el kiket válaszhatunk meg. Az egész választás egy színjáték. A választások után a politikai elit a kedvére hozza a törvényeket. Akik akarnának valóban tenni a közösségért nem tudnak tőlük érvényesülni! Ez az állapot tarthatatlan, a technológia adott és ideje minél előbb lépni.\n\n#Mit tegyünk?\n+\n+\n+\n#Terjesszétek az ötletet!\n+\n+\n\nNépszavazás kiírása a témában. Technológiai fejlesztések ez irányban programozók által. Az ötlet széles körben való terjesztése az interneten Facebook,YouTube és nagy közösségi médiában! Egészen addig amíg el nem jut az ötlet a TV ig. A program támogatása állami költségvetésből.",
			"added": 1549560207
		},
		{
			"topic_id": 3,
			"title": "Amatőr Vegyészet és Pirotechnika Tűzijáték készítés",
			"body": "Sziasztok mindenkinek akit érdekel az amatőr pirotechnika és házi tűzijáték gyártás. Evvel foglalkozó profi oldalak indultak Videó és Fájlmegosztás, Fórum, Privát beszélgetés. Weboldalkereső és sok más szakmába vágó weboldal. Akik házilagos tűzijáték készítéssel foglalkoznak, azok a munkájukhoz most mindent egy helyen megtalálnak profi útmutatókkal. Az oldalak külső felek befolyásolhatóságától és cenzúrájától mentesek. A témában nyíltan szabadon lehet beszélni, publikálni tartalmakat nem csak Magyar és Angol hanem több mint 20 másik nyelven is. \n\nKlikk ide:\n\n[Amatőr Vegyészet és Pirotechnika Magyar Fórum](http://127.0.0.1:43110/13WfLQv2nWXYBNUEL3PkWwGUe3H7qkTF5Y/?Topics:1538011472_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV/Chemistry+Pyrotechnics+Magyar)\n\nKlikk ide:\n\n[Amatőr pirotechnikával és vegyészettel foglalkozó további oldalak](http://127.0.0.1:43110/1JArw6Qb7cG6NuZBqvBSprURr2aaZdCFq9)\n\nMagyar oldalak:\n\n[PyroMaster Minden ami érdekes](http://127.0.0.1:43110/1CpAXQVfedrNVKSLJMKEtrWNvU8KMXJzAt/)\n\n[Receptek Sufnipirotechnikusoknak](http://127.0.0.1:43110/16AzWR6xfhVvrmvQCm4mt7rN17CWZTCJYS/)",
			"added": 1579190864
		}
	],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": [
			{
				"comment_id": 1,
				"body": "Üdv szeretnék klónozni egy oldalt.Legalábbis szeretnék létrehozni egy ugyan olyat egy saját címen.Nincs klónozási funkció.Mit hogy kéne átmásolni illetve módosítani az eredeti oldal fájljaiból hogy ez működjön?Vagy hogy lehetne ezt megoldani?",
				"added": 1504433329
			},
			{
				"comment_id": 5,
				"body": "Azt tudom hogy át kell másolni a mappa tartalmát illetve a .json fájlokat is alá kell írnom.De az eredeti oldal fáljaiban miket kell konkrétan módosítanom hogy működjön a dolog?",
				"added": 1505292828
			}
		],
		"1_17Vhhuwp8hQnqT54AyH3dHEwwH8mxrKM1f": [],
		"2_14UupgrdnT7Y8vMES7aqUFgD1fC5RYNrh8": [
			{
				"comment_id": 7,
				"body": "-PyroMaster minden ami érdekes.Minden ami pirotechnika:\nhttp://127.0.0.1:43110/1CpAXQVfedrNVKSLJMKEtrWNvU8KMXJzAt/",
				"added": 1525086547
			}
		],
		"1_1PXXUwyKemsXQ4P8o5ErFwsm8GbgNzcmXB": [
			{
				"comment_id": 8,
				"body": "A kommunista idők óta figyeljétek meg egy valamin tevékenykedett minden párt. Minden ami az önfenntartással kapcsolatos, elsősorban az élelmezés. Háztáji gazdálkodás, hogy az emberek egymás között kereskedjenek élelemmel. Ezt minden lehetséges eszközzel szétverték! Helyébe egy központosított ellátás lépett amivel teljes kontroll alatt lehet tartani az embereket. A háztáji gazdásokat és az önellátást szinte teljesen kivégezték. Ha evvel a központosított rendszerrel történik valami az emberek éhen halnak. Egymást ölik meg! Függővé váltak tőle. Semmihez szó szerint sincs jogotok. A árak mindig szándékosan úgy emelkednek hogy az előzőleg megkeresett fizetésetek mindig egyre kevesebbet érjen. A törvényeket teljesen átláthatatlan módon hozzák, amibe a népnek szinte semmi beleszólása sincsen. Gyermekeinket már óvodás kortól szándékosan leterhelik felesleges információkkal, tudatosan lefárasztják és kiidegelik, terrorizálják őket. Az önfenntartás irányából a fiatalok teljesen el vannak kondicionálva. A szavazások folyamán semmilyen rendszerváltozásra nem szavaztok. Teljesen mindegy kire szavaztok a rendszeren nem változat. És semmilyen pártnak vagy képviselőnek ez a változás nem is érdeke! Akik jelöltetik magukat oda pénz kell. A média a kezükben van. Egyik sem szakértő semmiben. Szó sincs arról hogy különböző területeket kijelölt profi szakértők vezetnének ellenőrzött körülmények között. Éhenkórász semmirevaló csótány mindegyik. A különböző alattuk lévő hivatalokban jól befészkelt haverok vannak. Az internet jelenleg a leg szabadabb. De minden közösségi oldal tele van különböző érdeképviseletek által irányított kommentelőkel. Akiknek megvannak a bevált módszereik hogy vegyék át az oldalak irányítását oly módon hogy milyen irányban folyjék a téma. Ebben egy valami hozott változást az internet. Az emberek jobban elérik egymást és össze tudnak fogni. A másik a megfigyelési eszközök. Ebből ha így megy tovább, az emberek nem válnak önálóvá pokoli világ lesz. A nép ereje az az egyén erejében van és ezt veri szét az összes politikus. A választásokkor nem szavazunk valójában semmire! Egy a célja hogy az emberek ne verjék szét ezt a tetves rendszert. Előre szinte mindenki tudja mi lesz minden választás eredménye. A változást én abban látom hivatalok, bíroságok, hatoságok, a polgárok számára a szabad kamera és hangfelvételek készítése hogy lássa minden állampolgár hogy pontosan mi hogy megy. A vezetőink felöl nyilvános, teljes vagyon információk. Ki hol és miből milyen bevételt szerez a vezetőink részéről. A vezetők rendszeres megfigyelése titkosszolgálatok által (telefon, internet). A nép részéről a parlamentnél és a politikusok házánál, bírósági épületek stb szabad tüntetési jog és nyomásgyakorlás. A poziciókra bármikor meneszthető szakértőket kijelölni. Nyilvános parlamenti szavazások, igen is vállalják a képviselőink ki mire szavaz! Lássa a nép kik tesznek ellenük a legjobban! A maréknyi szarházi nyakát kell csak elkapni tömegesen és mindjárt lesz itt jog és rend! Ne higgyétek hogy a népért és a közjóért dolgoznak. Az egész arról szól hogy a többség egy szűk réteget tartson el és ebből ne legyen kibuvó! A kommunisták, és utánuk eddig az összes megszavazott párt ezen dolgozott kivétel nélkül.",
				"added": 1589874786
			}
		]
	},
	"comment_vote": {}
}