{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1578677853,
			"title": "We’re going to take out seven countries in five years, starting with Iraq, and then Syria, Lebanon, Libya, Somalia, Sudan and, finishing off, Iran.",
			"body": "Retired General (((Wesley Clark))) revealed to Democracy Now’s Amy Goodman in 2007 the ambitious imperial plans of the Bush-Cheney inner circle.\n\n(((Clark))) is a former four-star general. He served as Supreme Allied Commander of NATO during the conflict in the former Yugoslavia.",
			"added": 1578677852
		},
		{
			"topic_id": 1579429443,
			"title": "“The disarmament of the proletariat should be frustrated, by force if necessary.” - Karl Marx, jude pig before 1900, the main inspiration for the Soviet Union",
			"body": "Lev Davidovich Bronstein - jude pig, renamed to Trotsky, speech from 1917:\n\n \"We must turn Russia into a desert populated by white Negroes upon whom we shall impose a tyranny such as the most terrible Eastern despots never dreamt of. The only difference is that this will be a left-wing tyranny, not a right-wing tyranny. It will be a red tyranny and not a white one. \n\nWe  mean  the  word  ‘red’  literally,  because  we  shall  shed  such  floods  of  blood  as  will  make  all  the  human  losses  suffered  in  the  capitalist  wars  quake  and  pale  by  comparison.  The  biggest  bankers  across  the  ocean  will  work  in  the  closest  possible  contact  with  us.  If  we  win  the  revolution,  we  shall  establish  the  power  of  Zionism  upon  the  wreckage  of  the  revolution’s  funeral,  and  we  shall  became  a  power  before  which  the  whole  world  will  sink to its knees.\n\n We shall show what real power is. By means of terror and bloodbaths, we shall reduce the Russian intelligentsia to a state of complete stupefaction  and  idiocy  and  to  an  animal  existence...  At  the  moment,  our  young  men  in  their  leather  jackets,  who  are  the  sons  of  watchmakers  from  Odessa, Orsha, Gomel and Vinnitsa, know how to hate everything Russian! What  pleasure  they  take  in  physically  destroying  the  Russian  intelligentsia.\n\n\n\nWe mean juden pigs in this case . \n\nWhen juden pigs seized power in Russia (juden pigs seized power with GUNS, because there is no nation in human history which vote for juden communistic pigs to be in power, only stupid AMERICANS are exception) first junta in USSR had more than 300 juden pigs. Whole government  had roughly 360 members, juden pigs immedeately created antijuden laws in 1917 - punished by death.\n\nJuden pigs confiscated guns in 1920, by juden laws.\n\nJuden pigs then created cheka in 1922. NKVD and KGB was next stage of juden control power structure.\n\nJuden pigs murdered approximately 30 000 000 people just in USSR in the name of juden comunistic revolution before 1939.\n\n\nThank god germans and other nations in europe had wepons in that time, so they can destroyed juden pigs revolutions in 1920 and saved sizeable part of europe intelligenstia which created whole space program.",
			"added": 1579429441
		},
		{
			"topic_id": 1579430150,
			"title": "History of British Gun Control - creation of juden slaves",
			"body": "In 1900 the British government trusted the people with firearms and to be their own guardians. Prime Minister Robert Gascoyne-Cecil, the Marquess of Salisbury said he would \"laud the day when there was a rifle in every cottage in England\". However in 1903 Britain passed its first ever \"gun control\" law, a minor one requiring a permit to carry a handgun and restricting the age of purchasers. It was the first toe over a slippery slope towards complete firearms prohibition.\n\nIn 1919 the British government, in fear of communist insurgents and domestic and foreign anarchists, passed its first sweeping anti-gun laws (under the smokescreen of crime control) even though gun related crime was almost non existent in the England of the day. British subjects could now only buy a firearm if they could show \"a good reason\" for having one and the firearm certificate system that we have today (implemented and abused by police) was introduced. The 1920 gun control act was the beginning of the end for private firearms ownership in England. So much for Robert Gascoyne-Cecil's remarks of \"a rifle in every cottage in England\" being a laudable goal.\n\nIn 1936 short barrelled shotguns (such as shot pistols used for ratting) and fully automatic firearms were outlawed. Why? Not because such firearms were ever misused but because the government dictated that civilians had \"no legitimate reason\" for owning them. Where have we heard that before! Another slide down the slippery slope. The reasoning has now changed from the government NEEDING TO SHOW REASONS FOR THE RESTRICTIONS to the people NEEDING TO SHOW REASONS TO EXERCISE THEIR RIGHTS, to a government TELLING them that there was NO ACCEPTABLE REASON.\n\nThe English Bill of Rights states \"That the subjects which are Protestants may have arms for their defence, suitable to their condition and as allowed by law\" Sir William Blackstone, commenting on this in his Commentaries on the laws of England said, \"The fifth and last auxiliary RIGHT of the subject, that I shall at present mention, is that of having arms for their defence, suitable to their condition, and as allowed by law, which is also declared by the same statute IW & M ft.2c.2 and is indeed a public allowance, under due restrictions, of the natural right of resistance and self preservation, when the sanctions of society and laws are found insufficient to restrain the violence of oppression\". I wonder what happened to \"the natural RIGHT of resistance and self preservation\" (from domestic criminals and out of control governments). Have not the \"sanctions of society and laws\" been shown \"insufficient to restrain the violence of oppression\"?\n\nIn 1936 the government added a \"safe storage\" requirement on the owners of handguns and rifles to \"prevent the guns falling into the wrong hands\" Where have we heard that one before, and how often do the British police use that particular requirement to harass what is left of the British gun owning community?\n\nAs a direct consequence of the 1920 gun control act, not only did Britain not have \"a rifle in every cottage\" but they had to ask American citizens to send them every type of rifle and handgun at the outbreak of WWII, so British people would have some means of defending their homes and islands against the Nazi hordes massing across the English Channel. Americans responded by sending every type of firearm to the unarmed and helpless people of Britain. No surprise, but at the end of the war the British people did not get to keep the guns, the government seized many of them back and dumped them in the sea. Such was the British government's gratitude to the American public and distrust of their own people.\n\nIn 1946 \"self defence\" was no longer considered a good reason for requiring a police issued firearms certificate. The slippery slope got even steeper.\n\nIn 1953 carrying any type of weapon for self defence was made illegal, making the streets even safer for the criminal element and giving great \"crime control\" soundbites to the police and press.\n\nIn 1967 a chap by the name of Harry Roberts blasted three policemen to death in a London street using a 9mm Luger pistol and the British government restricted shotguns for the very first time. Try to figure out the logic... handgun used... shotguns licensed for the first time in British history. Opportunistic, or am I just being a cynical bastard?\n\nIn 1982 black powder muzzle loader shooters and handloaders were required to allow police inspection of their security arrangements to ensure \"safe storage\" of the powder they possessed, meaning that agents of the state could demand entry into an Englishman's home at any time of day or night without a warrant.\n\nIn 1988 all semi-automatic rifles were banned, including pump action rifles. The personal property of law abiding people was once again outlawed and seized. All the guns were registered and easy to find, that is to say, all the legally held ones.\n\nIn 1996 all handguns were banned and they too were all registered with the agents of the state. Well, need I say more? You get the picture. Also in 1996 carrying any knife with a blade longer than 3 inches was made illegal. Presumably one cannot stab someone to death with a three inch knife. You now had to show \"good reason\" for carrying a knife, the presumption of innocence, until proven guilty of a crime, was gone.\n\nIn England today you cannot carry any type of weapon for self defence and you cannot use a firearm to defend your home, family, or property. The gun and weapon laws have made crime safe for criminals and the other violent thugs and miscreants who infest our country today.\n\nIn 2006 the government passed the Violent Crime Reduction Act. The VCRA restricted all \"realistic\" toy/replica guns. Now Britons were not to be trusted with even imitation non-firing replicas. \"Violent crime reduction\" was once again used as the smokescreen to enact oppressive laws and deprive the law abiding of their property. As part of the VCRA an airgun can no longer be purchased by mail order and the name and address of the purchaser must be registered with the seller. Is the bigger picture now getting clearer?\n\nIn 2009 talks with the British government were started to devolve airgun laws to the Scottish parliament. If and when the Scottish parliament is given the power over airgun legislation the Parliament has vowed to ban the sale of all airguns in Scotland. In the coming years, England will follow the Scottish example and airgun registration and an eventual licensing system will follow. The slippery slope is now in a vertical freefall.",
			"added": 1579430147
		}
	],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1578677853_14giYM2ws7rPBNTE8o9j8QSpkNTPXPUPiE": [
			{
				"comment_id": 1,
				"body": "It is for remembrance because goyim here are too much obsessed with (((h3bhkj5gqz4n3pjm))) mystical fairy story.",
				"added": 1578678493
			},
			{
				"comment_id": 3,
				"body": "> [ranshit](#comment_20_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): The US spent decades being a bully to smaller nations while letting the larger ones establish their foothold as global leaders. How are they going to sanction their way out of this one?\n\nThe (((USA))) plans works very well. It's  about big zion greater (((state))). This will ------------ with Ukrainian help (((their revoluton in 2014))) ---------- cut off China from Europe and \n\nRussian is ((( under control since 1917))) . \n\n72 years off (((communistic))) terror without any courts and yet now they have antisemitic \"laws\". \n\n(((Europe))) is full (((bolshevik))) formation.\n\nPutin finishes in two year. \n\nWHERE ARE GLOBAL LEADERS? Which part of globe?",
				"added": 1578681634
			}
		],
		"1578677811_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 2,
				"body": "Shot down by (((USA))) or (((chosen nation))).\n\nAsymmetrically reply. For deaths on base. \n\nMost important information is -------------------------------------------------------------- majority on plane were Irani passangers and the plane was from (((Ukaine))).",
				"added": 1578678994
			}
		],
		"1581109221_1MLqjfXio3ZiogLZaoDaqsFxLBbhinzvPN": [
			{
				"comment_id": 4,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1832_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): man is the only moron 'who thinks THAT HAVING BORDERS is a good thing for Business': which is antynomic.\nagain.\n\nStupid fag nonborders world with the central (((commies))) -jews- government is goal.\n\nOpen borders for israel. Open borders for israel. Open borders for israel. Open borders for israel. Open borders for israel. Open borders for israel. Open borders for israel. Open borders for israel. Open borders for israel. Open borders for israel. Open borders for israel. Open borders for israel. Open borders for israel.\n\n(((jonathn))) supports open borders for israel too.\n\nEverybody supports open borders for israel.\n\n(((h3bhkj5gqz4n3pjm))) hasbara vermin\n\nWho created (((communism))) in china:\n(((Sidney Rittenberg)))\n(((Israel Epstein))) - this is not that pedo jew who didn't kill himself\n(((Frank Coe)))\n(((Solomon Adler)))\n(((Elsie Fairfax-Cholmely)))",
				"added": 1581147137
			}
		],
		"1581413099_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": [
			{
				"comment_id": 5,
				"body": "Who in their right mind would want it?\n\n\nJUDEN JUDEN JUDEN  JUDEN JUDEN JUDEN  JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN . JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN.\n\nJUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN.\n\nJUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN.\n\nJUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN.\n\nJUDEN JUDEN JUDEN.\n\nJUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN JUDEN.\n\nJUDEN JUDEN JUDEN.",
				"added": 1581548574
			},
			{
				"comment_id": 6,
				"body": "suprnova: What a cocksucker. \n\nOnly good thing in (((communism))) was that little stupid (((subhuman))) (((bitch))) rosa luxemburg shot dead like a stinking pig. \n\nQUOTE:\n\n\"No (((communist))) would ever say that humans are equal, as this is obviously not the case.\"\n\nSure. (((COMRADES))) - JUDEN - gas chosen people are special. So they need guns and colour money printer because they were persecuted. Poor juden.\nLeftover off society are animals who can have good proletarian socialistic worker freedom democracy because everybody are equal. \n\nThat's essence of (((communism))). \n\nEQUALITY. EQUALITY. EQUALITY. juden magic word. juden are certainly more equal because they are gas chosen people.\n\nQUOTE:\n\n\"This argument comes typically from cold war anti-communist propaganda and its inheritors.\"\n\nSo you are standard little (((commie))) fag trash. \n\nJUDEN - (((communism))) - killed all brainpower in all states across the world and now (((they))) \"RULE\" - every state with \"antisemitic laws\" which means (((anticommunistic laws))) are totalitarian societies and juden pigs do this since french slaughter so called (((revolution))).\n\nFag use WIKIPEDIA as information resource.\nStupid useless FAG.\n\nWaste time with commie.",
				"added": 1581590857
			},
			{
				"comment_id": 7,
				"body": "h3bhkj5gqz4n3pjm fuck off hasbara pig",
				"added": 1581590901
			}
		],
		"1581923364_1CQXqzcFLdzbuFCAeBSprGqn8nvZpHyySR": [
			{
				"comment_id": 8,
				"body": "kec\n\nGun control? Juden. \n\nJUDE PIG Chuck Schumer with his Brady Bill legislation, which called for background checks for gun purchases, was adopted in 1993. Assault ban was in 1994. \n\nFirst Amendment is annihilated by juden pigs. It started with ooohhh  poooooooooooor niggers.\n\nClassic juden behaviour, stinking jude pig spreading lies.\n\nI am sick and tiered of my Constitutional liberties and freedoms being systematically eroded and stripped away by a clutch of JUDEN PIGS, goose-stepping, ignorant, psychopathic, morons who believe that it is through draconian punishments and authoritarian suppression of Constitutional guarantees of liberties that the average citizen - who hasn't done a goddamn thing wrong - can be beaten into submission and used for nothing more than chattle slavery.\n\nThis statement is true, previous is lie.",
				"added": 1581955955
			}
		]
	},
	"comment_vote": {}
}