{
	"message": [
		{
			"body": "ampliando horizontes pues",
			"date_added": 1457305102878
		},
		{
			"body": "¿y cuantos estamos en linea en este precismo momento?",
			"date_added": 1457312942692
		},
		{
			"body": "bien bien, pero no entiendo porque rengo se queda arriba, no me fije mas abajo van añadiendo lineas",
			"date_added": 1457314671502
		},
		{
			"body": "bueno en parte es todo normal, por el sistema que es ni se me ocurre tocar nada por ahora, ",
			"date_added": 1457317085802
		},
		{
			"body": "de hecho, lo que mas me intriga saber hacer es como copiar o guardar un enlace directo de este chat al zerohello, si es que hay algo mas que marcarlo como favorito",
			"date_added": 1457317144888
		},
		{
			"body": "http://127.0.0.1:43110/0list.bit/?Topic:2_193GRQHrQgpudYtUXtPkUp7z6DdYWkLfJX/+Personas+de+habla+hispana",
			"date_added": 1457317577242
		},
		{
			"body": "ahora si se ve mejor, ya rengo baja bien en el historial",
			"date_added": 1457320034090
		},
		{
			"body": "si, apenas acabo de ver, todo diversificado como suele ser",
			"date_added": 1457320082553
		},
		{
			"body": "ah vale, ya entendi, ok voy a ver",
			"date_added": 1457320224675
		},
		{
			"body": "¿en donde lo ves?",
			"date_added": 1457320522827
		},
		{
			"body": "genial, ahora si veo nuevo formato, pero incluso algunas palabras están en frances, somos \"15 visitantes\"",
			"date_added": 1457325989033
		},
		{
			"body": "Nouveautés: Prévention des messages vides, les messages que vous écrivez sont en gras, les mentions sont mises en valeur, les url sont cliquables  Taper: /me pour des actions dans le style IRC Taper: @username pour envoyer un message mis en valeur à une autre personne",
			"date_added": 1457326219747
		},
		{
			"body": "me retiro, ya es tarde. saludos!",
			"date_added": 1457326270166
		},
		{
			"body": "buenos días, pero es curioso que mi volumen de datos siempre sea 88mb en zeronet, ",
			"date_added": 1457447669894
		},
		{
			"body": "muahahahahahaha @mama21mama queda bastante evidente, sutil y crucial informacion!! muahahaa",
			"date_added": 1457458300198
		},
		{
			"body": "bueno torrents hay en todas partes, no se si esto es solo para torrents",
			"date_added": 1457478774229
		},
		{
			"body": "creo que @mama21mama ha entrado muy interesado al tema zeronet, no paras de publicar temas en zerotalk",
			"date_added": 1457478935552
		},
		{
			"body": "jajajajajaa parece el mismisimo tpb !",
			"date_added": 1457478999013
		},
		{
			"body": "o peor, sera falso, sera para ver que \"buscamos\"",
			"date_added": 1457479087274
		},
		{
			"body": "se me hace mas util y practico compartir las cuentas correos de zeromail que los torrents, pues eso es lo que realmente nos enlaza solidamente",
			"date_added": 1457479319321
		},
		{
			"body": "¿cuantos somos ya?",
			"date_added": 1457645248448
		},
		{
			"body": "contenido español http://localhost:43110/165eqHdoQfyf7CVGqtVCGNDvMBZhwVSJBL/",
			"date_added": 1457875552807
		},
		{
			"body": "la cuenta es regresiva, ya somos pocos,",
			"date_added": 1459946029070
		},
		{
			"body": "publicando que es gerundio, http://localhost:43110/1AxvGDHuuRnT4gvH9s78EMmihv5PTeDV4E/",
			"date_added": 1462024961049
		},
		{
			"body": "opino que hasta no se disponga un modo de zeronet que instalar en un servidor y luego administras remotamente no va a poder arrancar por mucho tiempo, a fin de cuentas todos ya separammos muy bien lo que es contenido con visita o consulta ocasional, ",
			"date_added": 1472166103289
		}
	]
}