{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "\"Hadopi mon amour\" sur Freenet",
			"body": "bonjour à tous! la page d'accueil de flog est excellente, voici le texte:\n\nPour votre sécurité, votre logiciel de Contrôle Gouvernemental a bloqué l'accès à ce site Internet.\n \n\t\nCauses les plus probables :\nCe site Web ne présente pas un label de Contrôle Gouvernemental valide.\nCe site Web ne correspond pas aux Critères de Qualité Gouvernementaux définis pour un site Internet.\nVotre logiciel de Contrôle Gouvernemental (ou la puce intégrée à votre carte mère) n'est pas activé.\nIl se peut que l’adresse contienne une erreur de frappe. Vérifiez que vous n'avez pas tapé par erreur http://www.Hadopi_m-a_tuer à la place de http://www.sarkozy.fr.\nCe site n'appartient pas à une société commerciale, un média ou un parti politique homologué par le Gouvernement pour la Communication en Ligne.\nCe site ne présente pas les critères de professionalisme et de sérieux requis pour la crédibilité des informations qu'il véhicule.\nLes textes publiés sur ce site n'ont pas été approuvés par un journaliste certifié par la Haute Autorité pour la Diffusion des Oeuvres et la Protection des droits sur Internet.\nCe site ne contient pas les mot clés \"Heil Sarkozy\".\nCe site véhicule des propos, idées ou opinions inexacts, susceptibles d'induire en erreur, néfastes, nuisibles à l'économie, aux mineurs, aux majeurs, aux bonnes moeurs ou au moral de la Nation.\nCe site est consultable gratuitement, sans abonnement ni dépôt de numéro de carte bancaire ou enregistrement d'informations personnelles, et ne propose aucune publicité, ce qui est contraire à la Confiance dans l'Économie Numérique.\nCe site n'est pas un site d'opposition valide car il n'est pas édité par le parti socialiste.\nCe site est soupçonné d'être en relation avec la mouvance nationaliste-patriotique-anarcho-naturiste-végétarienne-autonome ultra-gauche d'extrème droite.\nCe site n'est pas optimisé pour Microsoft Internet Explorer™ et peut scandaleusement être consulté depuis n'importe quel type d'ordinateur équipé de logiciels libres non commerciaux.\n\t\nEssayez l'une des solutions suivantes :\n \t\n\tConsultez l'annuaire des sites Internet approuvés par l'Autorité Gouvernementale.\n \t\nSi vous êtes certain que ce site présente tous les critères de moralité et de conformité autorisant sa consultation, vous pouvez outrepasser cet avertissement de sécurité et poursuivre votre consultation du site en cliquant sur le portrait du Roi.\nVous engagez dans ce cas votre responsabilité pénale, et votre consultation de ce site sera automatiquement notifiée aux juges de la Haute Autorité pour la Diffusion des Oeuvres et la Protection des droits sur Internet.\nIl est rappelé pour votre protection que la consultation volontaire d'un site Internet non autorisé est passible de sévères sanctions automatisées.",
			"added": 1609082276
		},
		{
			"topic_id": 2,
			"title": "INFORMATIQUE: docker et containers",
			"body": "Salut tout le monde! Je viens de découvrir le programme DOCKER, et c'est plutôt bien fait ;) \nOn installe d'abord docker évidemment! Ensuite, on peut lancer pleins de logiciels dans un conteneur, paramétrables à l'infini. Bien sûr, on peut en lancer plusieurs en même temps.\nPour cela , jetez un oeil du côté du dockerhub! On a firefox, zeronet, yacy etc... \nDites moi ce que vous en pensez!",
			"added": 1614509118
		},
		{
			"topic_id": 3,
			"title": "Sur une instance Mastodon",
			"body": "Voici ce qu'une amie a reçu par mail suite à une publication qu'elle a écrite sans parler de racisme ou autre:\n\nPublication: #generationidentitaire a la même méthode que les autres organisations que l on connaît déjà.. Greenpeace par exemple. Ils agissent sans attendre. Ce qui ne plaît pas c'est que ce sont des Français qui défendent leur pays..\n\nMail reçu de La Quadrature du net:\n\n \tBonjour,\nsoutenir generation identitaire, mouvement raciste et xénophobe, est contraire à la charte de mamot.\nVous avez 48h pour supprimer ce message et tout autre message soutenant ce mouvement, ou votre compte sera supprimé.\nNous n'hébergerons pas ce genre de contenu soutenant des mouvements incitant à la haine contre des individus en raison de leur religion origine ou couleur de peau.\nSi vous souhaitez le faire, ce sera ailleurs que sur mamot.fr\n\nVisiblement, il ne fait bon de dire la vérité, même sur une plateforme décentralisée et prônant la liberté d'expression... \n",
			"added": 1617871158
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"3_13QWCQKzDizk53GeB82izmVxzG2yocu1VS": [
			{
				"comment_id": 1,
				"body": "Salut, pour Strasbourg: en Alsace-Moselle, ce sont les 2 seuls endroits en France métropolitaine où les religieux de tous bords sont encore payés par le gouvernement... La loi de 1905 ne s'applique pas dans ces territoires. Donc, légalement, l'Etat doit payer aussi bien pour une église que pour une synagogue, un temple ou une mosquée. Même si cette dernière est proche des Frères musulmans..et donc soutien le terrorisme.",
				"added": 1617871457
			}
		],
		"3_1KJWwT67jevaZZMQmcspiJToGt63sxkwrj": [
			{
				"comment_id": 2,
				"body": "Bravo de me traiter de con. Je n'insulte personne, moi. \nMais apprend à écrire avant de me critiquer.",
				"added": 1617980514
			}
		],
		"1_1HmG8hXdvaaMtgoxpkvNXBVfCoB44Yv3aG": [
			{
				"comment_id": 3,
				"body": "Je ne crois plus à l'état français non plus. Tous les hommes politiques sont pourris, c'est une caste comme celles qui existent depuis la monarchie.\nAujourd'hui, ils sont pris entre 2 feux, les politiciens français: \n- d'une part, les citoyens s'informent différemment, découvrent qu'on leur ment par tous les moyens possibles (TV, presse etc..). On comprend toute la mafia que le monde politique est arrivé à mettre en place.\n\n-d'autre part: notre gouvernement obéit à une poignée de connards qui dirigent le monde: Bill Gates, Soros, et autres milliardaires influents (pléonasme..).\nCe sont eux qui donnent les ordres aux gouvernements du monde entier et qui tirent les ficelles dans tous les domaines.\nOn le voit bien avec ce virus mortel (LOL). Les labos décident de tout, et font des ministres et des présidents de véritables girouettes ! (le masque n'est pas obligatoire, il ne sert à rien (février 2020) mais est obligatoire et doit être porté en extérieur (en décembre 2020) )\n\nLe gouvernement est tellement avide de pouvoir qu'il est prêt à tout, finalement ^^",
				"added": 1617981748
			}
		]
	},
	"comment_vote": {}
}