{
	"next_comment_id": 6,
	"comment": [
		{
			"comment_id": 1,
			"body": "Witam; Pobieżnie przejrzałem, Jest super opisane. Za szczegóły się wezmę w wolnej chwili.Nigdy nie jest wiadomo co człowiekowi może się jeszcze w życiu przydać.A ten szczegół nie jest moją mocną stroną. Pozdr.",
			"post_id": 2,
			"date_added": 1550376526
		},
		{
			"comment_id": 2,
			"body": "Witam; Interesująco i dobrze to zostało opisane. Ja wcześniej próbowałem zainstalować, ale nie dałem rady. Gdzieś popełniłem błąd. Mam cichą nadzieję, że tym razem się uda. Instrukcja jest napisana zrozumiale. A ja spełniam wymagania. Linux i Debian-8. Jakby co, to można będzie dopytać się dalszych kroków. Bo na ZeroNecie, coś mnie się nie wiedzie. Ciągle mam jakieś problemy. Teraz zablokowało mnie, Zero Polska. I nie mogę dalej ruszyć. Otworzyłem nowe konto na \"Zero Voat\". Zobaczę czy też tam będą problemy. Jeszcze raz dzięki , za dobre wytłumaczenie.Pozdr.",
			"post_id": 5,
			"date_added": 1550830396
		},
		{
			"comment_id": 3,
			"body": "Witam; Przeszukałem pół internetu, w sprawie - fizyczna obsługa IPFS.\nChodzi o to jak to się obsługuje, ( jak powinno się to robić ). Wszystko jest, tylko nie ten temat. Jakieś może naprowadzenie w tym kierunku. Gdzie szukać? Gdzie pytać? - Jest budowa, jest instalacja, działanie. Ale jak to obsługiwać, to niema. Pewnie takich ludzi, jest więcej jak ja. Chcieli by , a nie wiedzą, jak do tego się zabrać. Pozdr.",
			"post_id": 5,
			"date_added": 1551030177
		},
		{
			"comment_id": 4,
			"body": "Witam; Wielkie dzięki, ten link jest kapitalny. Co to znaczy dobry link? Tyle tego jest materiału, że głowa boli. Już obejrzałem dwa filmy, niestety z tłumaczem. Ale idzie zrozumieć , o co chodzi. Następne w kolejce jeszcze czekają. Przy okazji można się dowiedzieć wiele ciekawych rzeczy. Trochę to potrwa, ale sukces murowany. Dzięki i pozdr.",
			"post_id": 5,
			"date_added": 1551108165
		},
		{
			"comment_id": 5,
			"body": "Witam;Dzięki za informacje.",
			"post_id": 5,
			"date_added": 1556612268
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}