{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 29,
	"comment": {
		"1624337849_1DeV9LYRftf4UtLRPYWWRcSuesmfkuhcRK": [
			{
				"comment_id": 1,
				"body": "Здравствуйте; очень разумные слова. Значит, есть еще люди, которые видят? и они думают сами. Ты хорошо это описал, знаешь, что печально? Что братья-славяне тоже выступают против России. Им промыли мозги и заблокировали самостоятельное мышление. История их ничему не научила. Они были дураками, они были дураками, и они останутся дураками. Надеюсь, на этот раз я больше не буду делать старый трюк? Натравливать одних на других. Приветствую и скрещиваю пальцы.",
				"added": 1624372184
			},
			{
				"comment_id": 2,
				"body": "@ auc -faustpatron, driud2-как вы сюда попали ? Яндекс-переводчик помогает в разговоре",
				"added": 1624476529,
				"modified": 1624479040
			},
			{
				"comment_id": 3,
				"body": "Интересная статья, и реальная исторически; это уже ничто, в наше время. Я знаю эту историю? Поэтому я ответил. Друга ищи среди своих, а не за большой водой. Однажды они разделили нас и поссорились. Мы Славяне. У нас голубые глаза, светлые волосы и та же группа крови. Это должно задаться вопросом, почему это так? На нуле я уже давно, и многое видел. Я изучаю русский язык, и я многому уже научился. Как тако, я овладел искусством чтения. Я там, где есть правда. Врага всегда можно узнать по лжи. Кто-то, кто говорит правду? Он не может быть врагом. С уважением .",
				"added": 1624479957
			}
		],
		"1624730188_13BPoV1vrcCrka2HVvGEFwfmVdMwe6Jk1N": [
			{
				"comment_id": 4,
				"body": "Windows, 10 - 11, это опыт, эту программу очень легко взломать. Он всегда был таким, Так что, если тебя волнует какое-то безопасное средство для общения? Тогда пришло время сделать это. Вопрос? На что вы можете переключиться, вы можете что-то всегда выбрать из списка-Linux. Я Рекомендую Debian. / старая версия /. Потому что новый, он уже спятил. Это мое частное мнение. Что я не рекомендую? \"UBUNTU\". Потому что это больше не Linux. Этот дистрибутив был продан компании Canonical. И на данный момент, это уже не \"Linux\". С уважением.",
				"added": 1624733157
			},
			{
				"comment_id": 5,
				"body": "Can't use Windows properly? From the very beginning it is Bubel. The services have taken control of him, and he can never be right again.\n.......................................\nWindowsa nie da się używać poprawnie? Od samego początku jest to bubel. Służby przejeły nad nim kontrolę, i on nie może być nigdy już w porządku.",
				"added": 1625317420
			}
		],
		"1626343495_1DeV9LYRftf4UtLRPYWWRcSuesmfkuhcRK": [
			{
				"comment_id": 6,
				"body": "Здравствуйте; интересный текст, и реальный; это моя оценка. Люди, как овцы, бараны, - это синоним глупости. Овен не дурак? Просто глупый человек так считает.\nСамый большой вредитель-это человек. / к сожалению /. Описанная акция ведется уже много лет, и никто с ней особо не скрывается. Почему это так? Потому что человек уже давно ошарашен, и это очень эффективно. Только пока Россия придерживается норм честности.\n. У меня есть несколько замечаний относительно текста; не следует путать Творца с Богом, разница между ними колоссальна. Второе дело; инъекции, которые они вводят, нейтральны и вредны. Российские уколы нейтральны, по крайней мере, они производят такое впечатление.\nЗападные инъекции очень вредны. Поэтому и совершается такой крик по отношению к первым. Прививки в России-это камуфляж, это просто имитация прививок. Это такая передача, мы играем в одни ворота. А гола два, и это совсем другое. Это противоположные полюса. + / - , плюс и минус?\n. Вопрос в том, что будут делать овцы? Как они будут вести себя? Бо, для этого момента? Это вышло из-под контроля. Выживут не привитые; а остальные пойдут в песок.\nВ этом случае пророчество говорит правду.\nя полностью согласен с этим пророчеством.\nВопрос в том, можно ли это исправить? Ответ; Скорее „нет\". Почему? Потому что пророчество не сбудется. И она / пророчество / должна исполниться полностью. Да, на 100%, нет другого варианта. Те, кто об этом знает, могут только наблюдать, как идет процесс-депопуляция- .\nМы не можем изменить этот процесс, мы можем только, возможно, переместить пару людей в сторону, чтобы спасти.\nС уважением.\n....................................................................\nWitam; Ciekawy tekst, i prawdziwy; Taka jest moja ocena. Ludzie jak owce, barany, - jest to synonim głupoty. Baran nie jest głupi? To tylko durny człowiek tak uważa. \nNajwiększym szkodnikiem, jest człowiek. / niestety /. Opisana akcja jest prowadzona od wielu lat, i nikt z tym specjalnie się nie kryje. Dlaczego tak jest? Bo człowiek jest ogłupiany od dawna, i to bardzo skutecznie. Tylko jeszcze Rosja, trzyma normy uczciwości. \n. Mam parę uwag, co do tekstu; Nie należy mylić Stwórcy z bogiem, różnica po miedzy nimi jest kolosalna. Druga sprawa; Zastrzyki które podają, są neutralne i szkodliwe. Rosyjskie zastrzyki są neutralne, przynajmniej sprawiają takie wrażenie.\nZachodnie zastrzyki są bardzo szkodliwe. Dlatego jest czyniony taki wrzask, w stosunku do tych pierwszych. Szczepienia w Rosji, to kamuflaż, To tylko imitacja szczepień. To taki przekaz, gramy do tej samej bramki. A bramki są dwie, i to całkiem różne. To są przeciwstawne bieguny.  + / - , plus i minus? \n. Pytanie, co zrobią owieczki? Jak się zachowają? Bo, jak na ten moment? To się wymknęło spod kontroli. Przeżyją nie zaszczepieni; a reszta pójdzie do piachu. \nW tym przypadku, przepowiednia mówi prawdę.\n / całkowicie zgadzam się z tą przepowiednią /. \nPytanie, czy można temu zaradzić? Odpowiedź; Raczej „NIE”. Dlaczego? Bo by przepowiednia się nie spełniła. A ona / przepowiednia /  musi się spełnić całkowicie. Tak na,  100%,  Niema innej opcji. Ci co o tym wiedzą, mogą się tylko przyglądać, jak przebiega proces -DEPOPULACJI- .\nNie możemy tego procesu zmienić, możemy tylko ewentualnie parę ludzi przestawić na boczny tor, do ocalenia. \nPozdrawiam.",
				"added": 1626365834
			},
			{
				"comment_id": 7,
				"body": "Привет; что серьезно, а что нет? Ясно одно: от глупости еще не изобрели лекарство. Это будет жестокий отбор людей, многие погибнут, многие будут убиты. Выживут только те, кто обладает знаниями.с уважением.\n.............................................\nWitam; co jest poważne, a co nie jest? Jedno jest pewne, na głupotę nie wynaleziono jeszcze lekarstwa. To będzie ostra selekcja ludzi, wielu zginie, wielu zostanie zabitych. Przeżyją tylko ci co posiadają wiedzę.pozdrawiam.",
				"added": 1626437520
			},
			{
				"comment_id": 8,
				"body": "Это еще впереди, когда? Это уже ближе, чем дальше. Можно сказать, что часы отделяют нас от этого события. Это не пугает, это просто предупреждение о том, что произойдет. Те, кто обладает знаниями, знают, о чем я говорю? А остальные могут надеть алюминиевые колпаки, и в этом случае им ничего не поможет. Есть старая поговорка: \"тот смеется, кто смеется последним\".\nУ вас еще есть время получить настоящие знания. Именно она позволит вам пережить следующий катаклизм. Это все сделает, вызовет, человек.\nС уважением.\n.............................................\nTo dopiero nadejdzie, kiedy? Już to jest bliżej niż dalej. Można powiedzieć, że godziny nas dzielą od tego wydarzenia. To nie jest STRASZENIE,  to tylko Ostrzeżenie, przed tym co nastąpi. Ci co posiadają wiedzę, to wiedzą o czym mówię? A pozostali mogą sobie założyć aluminiowe czapeczki, i tak im to nic nie pomoże, w tym przypadku. Jest takie stare powiedzenie: „Ten się śmieje, kto ostatni się śmieje”. \nJeszcze macie czas zdobyć prawdziwą Wiedzę. To ona pozwoli wam przeżyć ten kataklizm, który nastąpi. To wszystko zrobi , wywoła, człowiek.\nPozdrawiam.",
				"added": 1626449220
			},
			{
				"comment_id": 9,
				"body": "Здравствуйте; очень трезвые слова. Жаль только, что их никто не слушает? Это будет один из величайших холокостов в истории современного мира. Я подозреваю, что люди были разделены на две группы. Есть инъекция \" А \"и инъекция \"в\". Возможно, я ошибаюсь в таком решении этой проблемы. Но такое решение весьма вероятно.\nРоссия огромна, и там еще можно быть независимым; вопреки тому, что говорят и пишут на эту тему.\nЭто не относится к городу, весь город можно успокоить. У маленьких деревень большие шансы на выживание. Это относится только к людям, которые владеют своим производством продуктов питания. И обладают соответствующими знаниями.\nТех, кто может прокормить себя и свою семью.\nПотому, что это делается, внедряется, во всем мире? Вопрос в том, кто стоит за всем этим??? Те, кто это приносит, не на самом верху этой пирамиды. Над ними должен быть кто-то еще?\n„КТО это?” . И почему это вводится?\nПочему все согласились на этот переворот, на человечество? Кто? Или, Что? Их убедило, вынудило?. Много вопросов, на которые нет четкого ответа.\nИз этого следует, что выживет только небольшая группа людей. Тех, кто знает об этом, и они примут соответствующие меры безопасности своей семьи. Интересно, почему это не доходит до людей??? Их все равно трудно убедить.\nС уважением.\n...........................................................\nWitam; Bardzo trzeźwe słowa. Szkoda tylko, że ich nikt nie słucha? Będzie to jeden z największych holokaustów w dziejach dzisiejszego świata. Podejrzewam, że ludzie zostali podzieleni na dwie grupy. Jest zastrzyk „A” i zastrzyk „B”. Być może się mylę, co do takiego rozwiązania, tego problemu. Ale takie rozwiązanie jest bardzo prawdopodobne. \nRosja jest ogromna, i tam jeszcze można być niezależnym; Wbrew temu co mówią i piszą na ten temat.\n Nie dotyczy to miasta, całe miasto można spacyfikować. Male wioski mają ogromne szanse na przeżycie. Dotyczy to tylko ludzi, którzy posiadają swoją produkcję żywności. I posiadają odpowiednią wiedzę. \nTych co potrafią się wyżywić samodzielnie i swoją rodzinę. \nPonieważ to jest robione, wprowadzane, na całym świecie? To powstaje pytanie, kto za tym wszystkim, stoi??? Ci co to wprowadzają, nie są na samym szczycie tej piramidy. Nad nimi musi znajdować się ktoś jeszcze? \n„KTO to jest?” . I dlaczego to wprowadza?\nDlaczego wszyscy się zgodzili na ten zamach, na ludzkość? Kto? Albo, Co? Ich przekonało, zmusiło?. Wiele pytań, na które nie ma jasnej odpowiedzi. \nZ tego wynika, że przeżyje tylko niewielka grupa ludzi. Tych co o tym wiedzą, i  zastosują odpowiednie środki bezpieczeństwa swojej rodziny. Zastanawiam się, dlaczego to nie dociera do ludzi??? I tak trudno ich jest przekonać. \nPozdrawiam.",
				"added": 1626816581
			}
		],
		"1626871884_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": [
			{
				"comment_id": 10,
				"body": "Привет; тема интересная, но трудно понять. Лучшим примером является Zeronet. Покончить с глобалистами; я согласен. Один человек ничего не сделает, и больше желающих нет. Наличными согласен, электронных денег уже \"нет\". Блокада, как самое \"да\". Вопрос? С кем это делать?\n* удаление шпионских приложений со смартфона*\n. Я не использую смартфон. Так зачем его блокировать? Зачем удалять шпионские приложения? Wi-Fi я тоже не использую. Сеть \" ТОР \" это тоже только впечатление для бедных в развитии. Это особенно контролируется.\n*(можно подключить с Yggdrasil)*\n. Я не знаю этого? Но это тоже посредник. И если посредник шпионит за ним.\nТолько Почта, P2P, высокая степень шифрования. Это препятствие.\n* бесплатный анонимный доступ в интернет*\n. Это ключ к успеху. Поддерживаю.\nНужно большое количество желающих, а таких нет, как лекарство. Им промыли мозги.\nС уважением.\n.................................................................\nWitam; temat ciekawy, ale trudny do zrealizowania. Najlepszym przykładem jest Zeronet. Załatwić globalistów; zgadzam się. Pojedyncza osoba nic nie zrobi, a więcej chętnych nie ma. Gotówka zgadzam się, elektroniczny pieniądz już „NIE”. Blokada, jak najbardziej „TAK”. Pytanie? Z kim to robić? \n*usuwanie aplikacji szpiegowanych ze smartfona*\n. Nie używam smartfona. Więc po co go blokować? Po co usuwać szpiegowskie aplikacje?  Wi-Fi, też nie używam. Sieć „TOR” to też jest tylko wrażenie dla ubogich w rozwoju. Jest to szczególnie kontrolowane. \n*(można połączyć z Yggdrasil)*\n. Nie znam, tego? Ale to też jest pośrednik. A jak pośrednik to szpieguje. \nTylko Poczta, P2P, wysoki stopień szyfrowania. Jest utrudnieniem. \n*bezpłatny anonimowy dostęp do Internetu*\n. To jest klucz do sukcesu. Popieram. \nPotrzebna jest duża liczba chętnych, a tych nie ma jak na lekarstwo. Wyprano im mózgi. \nPozdrawiam.",
				"added": 1626876153
			},
			{
				"comment_id": 12,
				"body": "Привет; Вы хорошо и подробно все описали, есть пара несоответствий. Но это небольшой пик против всей статьи. Проблема в этом. Что мы живем в двух разных странах? У вас еще есть, в основном управляющие, которые говорят на вашем языке. У меня управляющие имеют два гражданства и разговаривают на иностранном языке. Все руководящие должности заняли люди с двумя гражданствами. Они могут делать все, что захотят, с нами с одним гражданством. Вторая проблема заключается в том, что людей усыпили химически. Это уже не люди, а био-роботы. Я общаюсь с такими каждый день, нормального уже не встретишь, или это сделать очень сложно.\nС био-роботом ни о чем конкретном не поговоришь. Они уже отключены от нормального, самостоятельного, мышления. Это драма для нас как нации. Мы пережили санацию, оккупацию, захваты и разделы; теперь наш народ был уничтожен, честь бежала, уехала за границу, за хлебом. Те, что остались? Их заменяют другие народы, чужие. Это основная наша проблема.\n. Ваши советы в основном хороши, но скажите, как их передать широкой публике? Эти люди просто смотрят телевизор, и до них ничего не доходит.\nС уважением.\nPS. приятно разговаривать с тем, кто понимает проблемы.",
				"added": 1627067619
			},
			{
				"comment_id": 13,
				"body": "Привет; да, сама идея не плохая? Проблема в другом месте, это \"Туба\" решает, пойдет ли фильм, и куда? Я, как отправитель, не имею на это никакого влияния. Разнесение этого фильма между людьми, и одновременное освобождение, может сработать только в первый раз. Во второй раз этот номер уже не пройдет. Итак, как вы хотите общаться с этой группой людей? Возможно, с помощью срайфона, за которым тоже следят. Ты собираешься сесть на велосипед и объехать всех подряд? Следующая проблема, которую трудно перепрыгнуть, - это именно та группа людей по всей стране. Разумные ушли за хлебом, а остальные даже не годятся для подметания улицы.\nСледующее дело-подключиться к телевизионному передатчику; как ты себе это представляешь, чтобы сделать с теми людьми, что остались вокруг? Они могут пить только пиво под магазином. Следующий вопрос касается организационных вопросов, чтобы что-то сделать? Это нужно сначала, переделать первые очки. И вот замкнулся порочный круг.\nЭто можно сделать в техникуме, где все знают друг друга, и они могут поговорить вместе в одном зале без телефона. И обладают высокой степенью технической культуры.\nС уважением.",
				"added": 1627216516
			},
			{
				"comment_id": 14,
				"body": "@xandanyesm \n(как это сделать?- бесплатный анонимный доступ в интернет ) это очень важный момент для личной свободы. Просто вопрос, который ты задаешь? Это должно быть преступление? У нас есть люди, которых мы вырастили. Это наши дети и внуки. В том, что они преступники, виноваты и государство, и народ. Каждый пейсат с рождения-преступник. Так учит их религия.",
				"added": 1627319568
			},
			{
				"comment_id": 16,
				"body": "Привет; я начинаю с конца.\nЧто делать кому-то? Кто не использует, Wi-Fi, = я использую все на кабеле. Радио, маршрутизатор, карта, провод, компьютер.\n. Wi-Fi я не использую, потому что это не здорово.\n. Второе дело; Тор, это литературная фантастика, это просто теория о, невидимости, в сети. С сегодняшней техникой, это не проблема в отслеживании. Мой адрес, который я использую; это проблема. Как от этого избавиться???\nУ моей платы тоже есть адрес, более новый комп, у него уже есть UEFI, установлен. У роутера тоже есть адрес? У сетевой карты есть адрес. Практически у всех есть адрес.\nВ большом городе с помощью WI-FI можно на время заблудиться и быть невидимым. Но это вопрос времени, когда они отследят тебя. Разве это не значит, что я-невидимка? Часть страниц, вам нужно Войти, чтобы открыть их? Что ты предлагаешь сделать? Я серьезно???\nКак устранить эти воспалительные и чувствительные точки.\nС уважением.",
				"added": 1627365153
			},
			{
				"comment_id": 17,
				"body": "@query  / 2.-odp.\nТрек и Андроид.\nТвой Андроид говорит, Кто ты? Вот и все. О какой невидимости вы говорите / пишете? По дороге можно даже на голову встать. Это известно, кто является отправителем этого текста? Даже если бы я отпустил сотню посредников, это моя отличительная черта, она все время следует этому тексту. Я не анонимный. Нет такой опции.\nЕсли есть известный отправитель? И есть известный получатель? Так о какой анонимности мы говорим???\n. Вы можете зашифровать, высокая степень шифрования, ключи вы отвезете к клиенту и согласуете с ним, что и как. . Шифрование и дешифрование вы будете делать на независимой компиляции, без доступа в интернет. Это у вас есть; 95% уверены, что это может быть конфиденциальным. Но это не то же самое, что невидимое. Это просто временно не читается. Но известно, кто переписывается и где транслируются сообщения.\nС уважением.",
				"added": 1627366004
			},
			{
				"comment_id": 18,
				"body": "Привет; я начинаю с конца.\n*И, по крайней мере, личная переписка будет обеспечена. Мы должны противостоять всем доступным методам*.\n. Я не хочу тебя беспокоить? Все под контролем, абсолютно все...\nЯ занимаюсь этим давно, очень давно. Вот почему я отказался от этого. Только ваше индивидуальное поведение в общественном пространстве создает проблемы для системы. Это простое поведение, такое как два независимых компьютера, высокая степень шифрования, собственная система шифрования. Это создает проблему для системы. Конечно, я имею в виду конкретное шифрование. И не шифровать письма любовнице, а скрывать их от собственной жены. А про-после жены, „она \" все равно будет знать, что у тебя есть любовница. Он может распознать это безошибочно. Возвращаясь к существу дела, вопрос?Кто делает все телефоны, срайфоны, андроиды? Это делают корпорации. На кого работают корпорации? Они работают по заказу служб, имя которых всегда на трех буквах.\nКакой элемент является самым важным в вашем Android? Главный Процессор.\nКто производит эти процессоры? Их производит Израиль. Что такое основной процессор?\nЭто место, где происходят все процессы, связанные с работой компьютера.\nМожно ли взломать каждый процессор? „Да\" - при одном условии, что у вас есть ключ доступа к этому процессору. У кого такие ключи?\nОни всегда есть у производителя процессоров. Что еще ты не понимаешь???\nКаждый процессор имеет отдельный ключ доступа;у кого есть ключ? Этот управляет вашей машиной. Некоторые процессоры производятся по лицензии, тогда эти ключи есть у кого-то другого, но он все равно должен передать их службам. Это корпорация.\n. Программы, препятствующие шпионажу.\nВсе это подчиняется корпорациям, а те, в свою очередь, подчиняются службам. Колесо снова замкнулось. Вся эта система управляется искусственным интеллектом типа \"очки”или \"трубка\". Только то, что это другой субъект, и по-другому построен.\n. Адрес расположение вашего оборудования.\nКаждое оборудование имеет отдельный адрес, который является независимым. У вашего андроида тоже есть такой адрес, как и у компании, у которой там установлен свой дистрибутив. Дополнительная компания, которая препятствует шпионажу? Он также работает со службами и предоставляет все данные, а также системы действий. Все это контролируется искусственным интеллектом. Слова, которые вы используете для разговора, записываются, /абсолютно все/. Ваше местоположение тоже известно и записано. Ваши собеседники тоже записаны. Центральные серверные комнаты, которые хранят все это? Они находятся у конокрадов. У тебя есть номер, номер социального страхования. После чего вы локализованы и узнаваемы. Это всего лишь небольшой кусочек того, что происходит.\n. Хотите быть анонимным???\nОставь дома телефон, телефон, андроид. Встречайтесь с друзьями без этого оборудования. Это касается и других людей. Не разговаривай ни у телевизора, ни у телефона. Не используйте никаких посредников. Прекратите использовать Windows, как и все подобные программы от этой компании. Это затруднит ваше отслеживание. Примечание: вы усложняете, но не исключаете.\nЭтого больше, но все равно „ты \" этим не воспользуешься. Но хорошо знать тему.\n* В этом случае главное начать с чего-то: прекратить автоматический сбор данных корпорациями*.\n. Это очень разумное предложение. Хранение каких-либо данных на сервере, подключенном к сети, является наказуемым. ты используешь флешку. с помощью которого вы подключаетесь к серверу. Тогда ваши данные хранятся в безопасности.\n. В общем и целом.\nПротивник достиг очень высокого уровня слежки.\nЯ ознакомился с той ссылкой, которую вы загрузили, да, это правда, вы можете отключить все это, но только в своем уме. На самом деле, это все еще работает. Немого выхода из этой системы, с помощью” своей \" системы.\nЕсли вы хотите успеха? Тогда придумай что-нибудь новое, не работающее в их информационной системе.\n. Россия-это сделала и вырвалась из западной системы. Теперь у нас есть две системы, Восточная и Западная. ” Вы \" создайте третью независимую систему.\nПока вы будете использовать эти первые две системы?\nТЫ ВСЕГДА БУДЕШЬ ЗАВИСИМЫМ.\n.\nс уважением.",
				"added": 1627419371
			},
			{
				"comment_id": 19,
				"body": "Ответ, № 2.\nПривет; сбор данных, это одна проблема. И вторая проблема заключается в использовании этих данных. мы не говорим о преступлениях.\nПреступники всегда справятся с этой проблемой. Здесь речь идет о простом Ковальски.\n. То, что вы описываете, у нас уже давно. Если вы хотите пропустить это? Тогда нужно узнать, как работает противник, а потом искать дыру в заборе. И воспользоваться ею.\n. Произошло какое-то недоразумение, вроде анонимного входа в сеть.\nЯ имел в виду нечто подобное. Сеть - это два провода, к которым я могу незаметно подсоединиться. Затем я могу говорить с кем хочу, и когда хочу. Все дело в том, чтобы обойти входные ворота. Сетевой адаптер и маршрутизатор. Это первая идентификация вашей личности. Установленная здесь блокировка не позволяет вам свободно общаться. Например, политика, какое-то изобретение, нелестное мнение.\n. Трек, он на 100% контролируется, поэтому он так медленно работает. И это тоже иллюзия. Я хочу, чтобы ты так думал: я в безопасности.\n.\nС уважением.",
				"added": 1627420516
			}
		],
		"1625018612_1DeV9LYRftf4UtLRPYWWRcSuesmfkuhcRK": [
			{
				"comment_id": 11,
				"body": "Да, хорошо сказано, хорошо написано. Это очень хорошая статья. Каждый должен прочитать его. Я перевел и порекомендовал его на польском сайте.\nПоляки и русские, это один народ; который был разделен давно. Это был первый этап Холокоста. Затем последовали следующие этапы. Сегодня уже, неизвестно, кто это, в свою очередь ? То, что вы описываете, это все правда. И он движется в этом направлении, чтобы убить нас как можно больше. Как и были убиты индейцы в древней Америке. Мы имеем дело с преступниками чистой воды. Они не колеблясь сделают это? В лучшем случае, они могут оттянуть срок нашей гибели. Здесь в этом нет никаких сомнений. Это только вопрос времени, когда это произойдет. Открытый вопрос? Что можно сделать, чтобы противостоять этому явлению. Ответ; осознать как можно больше людей в мире. Большое количество осознанных и проснувшихся людей может противостоять этому. Захваченные и контролируемые интернет-СМИ не допускают нормального обсуждения. Вся нынешняя цензура-подавляет общение между людьми. Доступ в интернет также блокируется и контролируется. И к тому же человеческое сознание находится на очень низком уровне. Это самый трудный момент для прыжка.\nКак заставить людей обсуждать???\nС уважением.\n..............................................\nTak, Dobrze powiedziane, dobrze napisane. To jest bardzo dobry artykuł. Każdy powinien go przeczytać. Przetłumaczyłem i polecę go na Polskiej stronie. \nPolacy i Rosjanie, to jest jeden naród; Który został podzielony dawno temu. To był pierwszy etap tego Holokaustu. Potem przyszły następne etapy. Dzisiaj już, to nie wiadomo który to jest, z kolei ? To co opisujesz, to wszystko jest prawda. I zmierza w tym kierunku, aby wymordować nas, jak najwięcej. Tak jak wymordowano, Indian w dawnej Ameryce. Mamy do czynienia z przestępcami czystej wody. Oni nie zawahają się tego zrobić? Co najwyżej, mogą opóźnić termin naszej zagłady. Tutaj, co do tego,  nie ma żadnej wątpliwości. To jest tylko kwestia czasu, kiedy to się stanie. Pytanie otwarte? Co można zrobić, aby się przeciw stawić temu zjawisku. Odpowiedź; uświadomić jak największą liczbę ludzi na świecie. Duża ilość uświadomionych i obudzonych ludzi, może się temu przeciwstawić. Przejęte i kontrolowane media internetowe nie pozwalają na normalną dyskusję. Wszech obecna CENZURA- tłumi komunikację między ludzką. Dostęp do internetu jest też blokowany i inwigilowany. A do tego świadomość ludzka jest na bardzo niskim poziomie. To jest właśnie, najtrudniejszy punkt do przeskoczenia. \nJak namówić ludzi do dyskusji???\nPozdrawiam.",
				"added": 1626904220
			},
			{
				"comment_id": 15,
				"body": "У каждого есть некоторые знания, обычно приобретенные в школе и у родителей. Основа Истинного Знания? Это получить его самостоятельно. Здесь начинается проблема, в этом месте уже не всем хочется это делать. Этот пробел захватывает телевизор, который начинает загромождать нашу голову различными пустяками, полуправдами, ложью, подмененной историей. У меня есть вопрос к читателям? Кто из вас знает, что триста лет назад был потоп? Дело не в библейском потопе. Половина России была затоплена и не только. Вас учат этому в школе? Наверное, этому не учат, если хочешь проверить, бери лопату и начинай делать раскопки самостоятельно. И поэтому мы можем умножить примеры из нашей жизни. На каждом шагу мы сталкиваемся с ложью, которая переворачивает нашу культуру с ног на голову. Принудительные инъекции в Европе, как вы думаете, для чего они нужны? Вопросов и ответов много. И „мы \" затерялись в этом хаосе.\nС уважением.",
				"added": 1627320531
			}
		],
		"1629021411_1DeV9LYRftf4UtLRPYWWRcSuesmfkuhcRK": [
			{
				"comment_id": 20,
				"body": "Интересный текст; я отвечу позже. Важная тема.",
				"added": 1629027798
			},
			{
				"comment_id": 21,
				"body": "Здравствуйте; я очень внимательно прочитал эту статью. Эта статья-инструкция на случай войны, в частности речь идет о нападении на Россию другой страной, читайте / коллективное нападение Североатлантического пакта/. Это подготовка на случай, если Запад принесет демократию. Надеюсь, у них ничего не получится. Что касается детей? Скорее, речь идет о спасении их от опасности. Родители могут не знать об опасности, поэтому все это будет сделано из офиса. Вывоз в безопасное место и их обеспечение. Я отношусь к этому серьезно. Они знают гораздо больше, чем вам говорят. Но они ни в коем случае не хотят вашей гибели. А что касается уколов? Это их два вида, они полезны, и они вредны. Какие из них какие? Это вопрос за 100 очков? В целом, я вижу это положительно.\nС уважением.",
				"added": 1629136821
			}
		],
		"1630235169_1Fp48QigPihLJbj9AHj4jAZnyXrZeVs14F": [
			{
				"comment_id": 22,
				"body": "Бесплатное хранилище файлов, то есть я арендую комнату у третьей стороны; как вы думаете, может ли этот человек заглянуть в эти мои файлы??? Конечно, она может; потому что этот склад принадлежит ей. Хорошо ли это или плохо? Это зависит только от того, насколько я большой идиот... То же самое с банком? Я заработал деньги, а на хранение отдал чужому человеку. Где тут логика, смысл? Мне заработанные деньги не у меня. Так же, как я отдаю свои файлы кому-то на хранение. Начните думать самостоятельно.\n С уважением.",
				"added": 1630250581
			},
			{
				"comment_id": 23,
				"body": "Отключение чужого сервера приведет к потере всего материала навсегда. с уважением.",
				"added": 1630493534
			}
		],
		"1630943493_1Lzki6TM1dDKspyDRwNVMn4ogZr17eehbb": [
			{
				"comment_id": 24,
				"body": "Достаточно того, что ты все уразумел? Если вы ищете нормальных людей, то переходите на пейсбук и в телевизор; там живут такие умники, как \"вы\". Здесь господствуют теории заговора, и обитают одни дураки. С уважением.",
				"added": 1630952400
			}
		],
		"1631796958_1FtcR86nq8oDtoaExoCyHcjmigrLTfqH9L": [
			{
				"comment_id": 25,
				"body": "Внимание; создание новой страницы ничего не дает, если у вас нет поддержки? О чем идет речь? Вы должны ваши друзья, друзья просят поддержки этого сайта;что это такое? Вы открываете новую страницу, с этого момента вы должны иметь комп включен, в течение 24 часов. В это время ваши друзья должны загрузить ваш сайт, и дать ему поддержку... Только тогда, вы можете отключить ваш компьютер. Вот что говорит теория. И на самом деле; это вы должны иметь компьютер, предпочтительно PC-et. Почему? Потому что новые ноутбуки отключаются через некоторое время. Отсутствие посредников препятствует дальнейшему распространению вашего сайта. Я дам вам поддержку на несколько дней; как вы снова войдете в сеть? положите какой-то дополнительный. Я его посею. Тогда он должен быть виден другим. Внимание; в одиночку вы никто, и вы невидимы. Организуйте друзей. Приветствую и желаю успехов.",
				"added": 1631816326
			},
			{
				"comment_id": 26,
				"body": "Obydwa linki cały czas się aktualizują u mnie.\nОбе ссылки постоянно обновляются у меня.",
				"added": 1631816477
			},
			{
				"comment_id": 27,
				"body": "Трекеры announcing: 0, error: 7, done: 7\nНайдено одноранговых пользователей: 2\ncontent.не удалось загрузить JSON\nНайдено одноранговых пользователей: 2",
				"added": 1631878166
			},
			{
				"comment_id": 28,
				"body": "Объединение...\nТрекеры announcing: 0, error: 5, done: 7\nНе найдено одноранговых пользователей\nНайдено одноранговых пользователей: 1\ncontent.не удалось загрузить JSON. \n. Увы; дальше немая связь? Для этой первой ссылки, есть две аудитории; но это еще мало. На данный момент я ничем не могу помочь, У меня есть рабочий стол, и я все время сажаю.\n. С уважением.",
				"added": 1631878668
			}
		]
	},
	"comment_vote": {}
}