{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 14,
	"comment": {
		"1599297078_1HMvhRJegHrC92gxZhrPBeATg69tZRjtCj": [
			{
				"comment_id": 1,
				"body": "In my opinion everything is inferior to qBitTorrent. Freenet is better than both zeronet and ipfs because it has better anonymity and unlike zeronet supports videos properly. The ONLY benefit to zeronet from a technical perspective is that it was the first DHT to support dynamic content. So in conclusion I believe the best solution to censorship is ZeroNet+ qBitTorrent",
				"added": 1599358956
			},
			{
				"comment_id": 6,
				"body": "> [marcusfinch](#comment_37_1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ): There are different goals with all of those systems, which is part of the problem.  Right now, ZeroNet seems great for distributed sites.   Where ZeroNet is weak is anonymity, large data sets, real-time communictions (e.g., streaming). [...]\n\nHow is IPFS any better for storage than qBitTorrent?",
				"added": 1600103966
			},
			{
				"comment_id": 8,
				"body": "> [robione](#comment_586_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): with the PeerMessage plugin ZeroNet does RTC (streaming) well. See @GitCenter 's zites\n\n1 post link 2 is that compatible with instant messaging and calling a friend? 3 do you mean webRTC?",
				"added": 1600104231
			},
			{
				"comment_id": 9,
				"body": "> [alphapepe](#comment_1_122koQywXGbAHLYg4HsBHFYAS99WvR81dV): I can't even figure out how to use IPFS. ZeroNet is easy.\n\nTry Freenet. I'm curious how yill find it.\n\nPersonally I find Freenet the easiest of the bunch, apart from onion. Often times Zeronet gets too bloated and slow that literally nothing works anymore and I have to reinstall over and over. Videos don't work, especially for posting. Freenet is harder to get into, but at least works stability long term and with videos.",
				"added": 1600104857
			},
			{
				"comment_id": 10,
				"body": "> [beenotung](#comment_46_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg): (please correct me if I get it wrong)\n\n\"(please correct me if I get it wrong)\", \"Combining zeronet and ipfs seems to be a good idea.\"   maybe.. but combining zeronet and qbittorrent or even plain utorrent, if you may, would be even better. BitTorrent with web seeders are more permanent than ipfs, such web seeders can be hosted by nextcloud, or even zeronet or freenet (if it's running). Before a post is high profile enough to attract attention for censorship to web seeders, it likely will be popular enough for several peer seeders to back em liberty up",
				"added": 1600105535
			},
			{
				"comment_id": 13,
				"body": "> [caropc1v22](#comment_10_1Mk11Va4hvFzWgfAhvyRJR4m6buvWENcBZ): kopy kate big and big kopy kate 2, use torrent technology in video [...]\n\nZeronet may be the most fun darknet, and great for small files, but let's face it, it doesn't handle large files like videos well. If the video is not popular it never gets seeded. Here is a fun challenge. See if someone could post Red Dead Redemption, or the Lord of the Rings trilogy [in one video] on Zeronet and have it work. I dare you!\n\nI am quite tech experienced and have come to the conclusion after years of darknet research that the best solution for platform based internet freedom is to make a Zite as kind of a central hub for all your content (due to the dynamic support Zeronet has), and put all your posts on qBitTorrent + web seeders.\n\nThe zite should be as light weight as possible and just contain links to your posts elsewhere. The web seeders of choice can be any website direct download link a normal browser can access at a given time. I recommend NextCloud, or Mega.nz, or Freenet, or Zeronet. For popular posts the web seeders are bypassed altogether.",
				"added": 1600224258
			}
		],
		"1599528409_1CZfuDkX6sVNsQKh4SrF2gKU2Yij1kYeuo": [
			{
				"comment_id": 3,
				"body": "> [953gwpudtmsxjq4a](#comment_1_1F7Ks3WsZieUtEYgNjZXrhxxLkvgJ1EQtp): No problems posting .mp4s or webms.  Sometimes the Tor browser is cranky, but Firefox always works. Seriously find it easier to post on ZeroNet than the clear web...so something is amiss on your setup. Once you identify the problem hopefully a good laugh. [...]\n\nUsually the videos you post on Zeronet are fake and only play for yourself and not for anyone else. Try moving the zeronet folder to rubbish bin and reInstalling zeronet and refresh the page, and behold, it never plays, for it did not pass further than your own computer, that is no seeders. It's literally no better than saving the video on your hard drive and opening in VLC and pretending its accessible over the web.   :-b",
				"added": 1599535978
			},
			{
				"comment_id": 4,
				"body": "> [papull](#comment_4_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G): In P2P your content has to be popular otherwise nobody will seed it.\n\nExactly, that's why peer to peer DHTs can't be used for archiving. In your opinion which DHT is most forgiving to unpopular content. IPFS? Freenet + keepAlive plugin? BitTorrent + webSeeders?",
				"added": 1599556594
			},
			{
				"comment_id": 5,
				"body": "> [beenotung](#comment_47_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg): From my observation, DAT seems to be the most \"forgiving p2p system\". It seems the foundation behind the project will actively seed the content published with the beaker browser.\n\nhow is DAT the most? I would have thought Bittorrent+ webseeders",
				"added": 1600103395
			}
		],
		"1599735028_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 7,
				"body": "stop misusing the word 'everything'",
				"added": 1600104043
			},
			{
				"comment_id": 12,
				"body": "> [anshorei](#comment_163_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): Maybe, but it won't stay that way. ZeroNet is censorship-resistance software, once it gets on the radar they will likely scan everything on here since it's public anyway. They won't be able to remove it, but they could try and doxx you. [...]\n\nMaybe, but Retroshare is more like an instant messenger, and Zeronet is more like dynamic BitTorrent hosted websites.",
				"added": 1600132540
			}
		],
		"1599847995_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": [
			{
				"comment_id": 11,
				"body": "You can get around websites detecting your suspicious IP by popping a web proxy into tor browser, although then recaptcha wont work. Btw if anyone knows a webproxy that works with recaptcha plz send me the link. Every website has the right to choose whether they allow anonymous users or try to stop it. But I disagree with torproject making it so easy to block the exits (btw, there is not a single country that can completely block entry bridges as of September 2020)",
				"added": 1600106476
			}
		]
	},
	"comment_vote": {}
}