{
	"next_comment_id": 7,
	"comment": [
		{
			"comment_id": 1,
			"body": "Вчера электричество отключили на несколько минут, а я даже не заметил, потому что серфил ZeroNet с ноутбука. :)",
			"post_id": 4,
			"date_added": 1539138900
		},
		{
			"comment_id": 2,
			"body": "> Идея для доработки — в отсутствии заголовка писать дату записи. Или сразу в качестве темплейта заголовка её подставлять.\n\nИдея, которой мне не хватало. Пойду запилю.",
			"post_id": 6,
			"date_added": 1539139201
		},
		{
			"comment_id": 3,
			"body": "> [balancer73](#comment_2_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Я, кстати, твою реализацию блога не смотрел — ты патчишь основную ветку ZeroBlog в coffee-исходниках или вручную всё перепиливаешь не глядя на официальные изменения?\n> А то, когда я чью-то старую реализацию с тегами начал щупать, увидел, что там нет массы полезных новых плюшек из ZeroBlog, замучился со сведением исходников и забил до лучших времён :) Хотя тегов не хватает…\n\nПишу на coffee.\n\nЯ взял сорцы binchan2, где код с тегами был смерджен в свежую на тот момент версию апстрима + было несколько новых фич и багфиксов.\n\nСейчас я особо не слежу за апстримом, но когда я последний раз обновлял свой блог (на апстримовом движке) до свежей версии, никаких различий не заметил. Может, просто плохо смотрел.\n\nБлог будет полностью независимый от оригинала. Я хочу запилить модульность (в идеале, подключать компоненты и мышкой их таскать в админке по макету), но это сильно нескоро. Глобальная задача — получить функциональность типа Wordpress или хотя бы Blogspot. Сейчас доделываю профили пользователей, потом сделаю переключение тем оформления и выпущу стабильный релиз.\n\nМои все блоги пока на оригинальном движке ZeroBlog, т.е. код еще сырой даже для меня. :)\n\nПотом наработки можно будет использовать, чтобы сделать вместо ZeroTalk нормальный движок форума. Кодовая база будет наполовину общая.",
			"post_id": 6,
			"date_added": 1539140057
		},
		{
			"comment_id": 4,
			"body": "У меня вообще мобильный клиент не работает почему-то.\n\nГлянь вёрстку на моём http://127.0.0.1:43110/19fZJhX7FGENeRRLB8ftgrziBJ5vsLtFog/\nТам адаптивная вёрстка от Binchan. Я с мобильного не пользовался, но в превью ФФ выглядит юзабельно.",
			"post_id": 8,
			"date_added": 1539243010
		},
		{
			"comment_id": 5,
			"body": "После постинга коммента внизу появляется панель Sign and Publish, будто я владелец сайта. Странно.\n\nUPD: Да, точно. Выскакивает чётко после успешного publish, а не сразу после sign.",
			"post_id": 8,
			"date_added": 1539243697
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}