{
	"title": "Shouko's Blog",
	"description": "ZeroMe: [shouko@kaffie.bit](/Me.ZeroNetwork.bit/?Profile/1PRy1MSSFGrPFNAHubwnpYGGT37zPrUxLo/18GkKhDTQniChKDxcoDgmgrUd7KehaihpW/shouko@kaffie.bit)\nYou may have to visit KaffieID and my hub first or you may be unable to follow my ZeroMe account:\n(你可能需要在访问我的 ZeroMe 账户之前先访问一次 KaffieID 和我的 Hub 才行:)\n[id.kaffie.bit](/id.kaffie.bit/)\n[hub.shouko.bit](/hub.shouko.bit/)\nZeroMe 2: [shouko@zeroid.bit](/Me.ZeroNetwork.bit/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1FKrCcxyhZGUxUyj4Lkmrdrwv3uTo2C8NY/shouko@zeroid.bit)\n\nThis is my personal blog. I am an undergraduate Chinese student and is currently learning Japanese. Anime and programming are my favorite.\n\n这里是我的个人博客。我是中国的一名本科学生，目前正在学习日语。动漫和软件开发什么的最喜欢了 ^_^\n\nこんにちは、ここは私のブログです。アニメとプログラムが結構好き。\n___",
	"links": "*   [Source code](https://github.com/HelloZeroNet)\n\n* * *\n\nLinks\n\n[Shouko's Hub](/hub.shouko.bit/)\n[Kaffie's Blog](/blog.kaffie.bit/)\n[工科菜鸡的瞎bb](/TechNoob.bit/)\n[空澄砂夜](/sorasumi.bit/)\n[0gallery](/0gallery.bit/)\n[Get All Hub](/0hub.bit/)\n[0chan](/0chan.bit/)",
	"next_post_id": 6,
	"demo": false,
	"modified": 1509356889,
	"post": [
		{
			"post_id": 5,
			"title": "Announcing Shouko's Hub - and what's wrong with ZeroMe",
			"date_published": 1509342489.875,
			"body": "Firstly, I would like to announce a ZeroMe Hub created by me: [hub.shouko.bit](/hub.shouko.bit/). You can seed it and (optionally) join it if you like. This hub provides high quota for content once approved by me (you can contact me by ZeroMail or ZeroVerse's mail to shouko@zeroid.bit).\n\n### What's wrong with ZeroMe?\n\nAs a (fairly) new user on ZeroNet, I happily started off by joining [ZeroMe](/Me.ZeroNetwork.bit/). It was fun and exciting to experiment with decentralized things which is exactly what Internet is supposed to be. After a while I realized that this site is a merger site (which was not implemented the last time I tried ZeroNet) which includes a lot of sub-sites called `hub`s and I have to follow one's `hub` to receive the updates from the person. Therefore I found [Get All Hub](/0hub.bit/) to add all the `hub`s provided by maintainer of this site.\n\nHowever, when the messages from these hubs are comming in, I noticed something that I didn't expect ZeroMe to be.\n\n* * *\n\n### Incomplete federation\n\nWhat I mean by `incomplete federation` is that the `hub`s of ZeroMe are not quite federated. It is true that posts will be merged on your home timeline if you follow more than one hubs, and you can, sometimes, interact with users on other `hub`s. However, you can never:\n\n1.  Appear on the `new users` list with IDs other than `zeroid.bit` and `zeroverse.bit`\n2.  Comment on a user's post who belong to a `hub` that do not accept your ID provider\n3.  Accept a user's comment who use an ID provdier that is not accepted by your `hub`\n\nThese are severe enough to drive users away from, at least, ZeroMe. The first point is almost fatal: why I must use the selected ID providers in order to appear on everyone's list? (Note: this limitation is set by ZeroMe's user registry) Where is the decentralization promised by ZeroNet the thing itself? (Please, appreciate that the registry also accepts `ZeroVerse`, otherwise there will be no way to appear on the list of users without leaking your IP address)\n\nBeing unable to comment on others make it not as social as one could expect. The thing `social` itself is almost just about interpersonal interaction. We are not going to be lonely islands that talk without receiving things. It is undeniable that we have the freedom to choose the `hub`s that we ourselves prefer, but this may make you unreachable by others, which removes a lot of the goodness to have a decentralized set of `hub`s.\n\n### Limits\n\nLimits are the limits set by the `hub`s. At the time of writing, `SunHub` has a quota of only 48k for users, and this is true for many other `hub`s that are cloned from `SunHub`. This may seem a lot for blog comments or something similar to it, but **definitely not enough** for social platforms. For me myself, I used up 30k out of the 48k limit set by `SunHub` and this is the only hub shown on first registration. This became an important part of the reason why I set up [Shouko's Hub](/hub.shouko.bit/).\n\nSince it is for now impossible to switch or join additional `hub`s after first registration, the limit imposes a huge shortcoming on this platform. As is described before, it will be not very practical to set up a new and better `hub` in order to increase the possible quota set on one account -- that is to say, you have to depend on the maintainers of popular hubs to assign you more quota out of their `hub`s. Moreover, comments of a post is stored on the hub of the owner of the post, rather than on your own hub. This is also the reason why you could not comment on one's posts if his hub does not accept your ID. This implies that you could run out of limit on **any of the existing hubs** if you are actively interacting with users on ZeroMe. You will have to contact a bunch of hub maintainers in order to increase your limit on **every possible hub** if you are running out of limit. This, to me, seems like kind of design flaw and I do not really appreciate such strange limitation.\n\nThe \"unlimited hubs\" are not a good solution either. Besides the limitation described above, since anyone can join these hubs, malicious users can just replicate themselves a lot and start bombing these unlimited hubs to quickly grow the size to make it completely impossible to synchronize and download these sites. Banning users after being bombed is too late -- your hub is already failing.\n\n### Centralization\n\nAs a result, most of the users tend to join the largest `hub`s in order to reach as many people as possible. Most of the users will be under the control of the maintainers of the most popular `hub`s.\n\nI recalled the last time when I decided to give up on ZeroNet. At that time, there was an issue on ZeroNet's repository discussing how `merger sites` (what ZeroMe is based on) could be implemented. I do really appreciate that the contributors did take decentralization into consideration most of the time, but not for this final ZeroMe \"product\". I thought that a `hub` is going to be a collection of similar or familiar people that can be set up easily, interact with others easily and this is what I thought a decentralized social platform should be. From this point of view, even Mastodon is better since it at least guarantees that users different instances can interact just as if they are in a same, huge Fediverse. (but it's not decentralized from the user's perspective.)\n\nThat is, basically, what I believe is wrong with ZeroMe.\n\n### Shouko's Hub\n\nAs a conclusion, it is almost meaningless to have one's own hub. However I'm still going to give it a try. `Shouko's Hub` will be a hub maintained by me and I will assign higher quota to people that I can confirm real and not spammers. This will be the hub in my imagination -- a technical guy in a group sets up a hub to serve the others, and everyone with such ability can do it on his / her own without any restriction on how the content can be spreaded. I totally believe that the limitations described above are just design flaws and could be corrected some time in the future, thus they would no more be barriers preventing user from freely choosing their beloved `hub`s. Therefore, more `hub`s are always beneficial to a decentralized community -- if you are capable to do so, please also set up your own hub and ask us to seed it for you."
		},
		{
			"post_id": 4,
			"title": "How to add trackers to ZeroNet",
			"date_published": 1509273721.513,
			"body": "Yesterday I wrote a [blog post](/blog.shouko.bit/?Post:3:Extra+ZeroNet+trackers+needed) on why we should add more trackers to ZeroNet, and here is the guide on how to add trackers to ZeroNet.\n\n(昨天我写了一篇关于为什么我们应该给 ZeroNet 添加更多 Tracker 的[文章](/blog.shouko.bit/?Post:3:Extra+ZeroNet+trackers+needed)，这里是添加 Tracker 的教程)\n\n* * *\n\n### For all OSs / 针对所有操作系统\n\nThe first step is the same for all the OSes: save the list of trackers to an txt file. Make sure to include also the default trackers, otherwise ZeroNet would not work as intented.\n\n(第一步对于所有操作系统是一样的：把完整的 Tracker 列表保存到一个 txt 文件里面。记住要包含 ZeroNet 默认的几个 tracker，不然 ZeroNet 将无法工作)\n\nI have posted a list of trackers that I use in my previous [blog post](/blog.shouko.bit/?Post:3:Extra+ZeroNet+trackers+needed), you can find it in the first `EDIT` section, it's just a long long list of URLs. Save it, for example, as `/path/to/trackers.txt` (The path here is just a placeholder and please replace them with the actual path to your file, the only requirement is that ZeroNet must be able to read this file.)\n\n(我在昨天的[文章](/blog.shouko.bit/?Post:3:Extra+ZeroNet+trackers+needed)里发了一个我自己使用的 Tracker 列表，你可以在第一个 `EDIT` 下面找到它，就是一个非常长的 URL 列表。把它保存到一个文件里，例如 `/path/to/trackers.txt` 具体路径请自行决定，唯一的要求是 ZeroNet 必须能读到这个文件)\n\nThe next step is to ask ZeroNet to load this file on start. This varies with platforms, but basically it is using `--trackers_file` option.\n\n(下一步就是让 ZeroNet 加载这个文件。这个在不同平台上是有区别的)\n\n### ArchLinux (AUR)\n\nIf you install from `aur/zeronet` on ArchLinux, please read this section.\n\n(如果你是从 ArchLinux AUR 上安装的 ZeroNet，请阅读本节)\n\nEdit `/etc/zeronet.conf` to include the following:\n\n(在 `/etc/zeronet.conf` 中加入:)\n\n```\ntrackers_file = /path/to/trackers.txt\n```\n\n**Please note: for ZeroNet installed from AUR, please always make sure that your trackers.txt can be read by the zeronet user. I personally suggest to put it to /var/lib/zeronet/trackers.txt**\n\n**(请注意，对于 ArchLinux AUR 上安装的 ZeroNet，请务必确保你的 trackers.txt 能被 zeronet 用户读取，我个人建议把它放置到 /var/lib/zeronet/trackers.txt)**\n\n### Linux (ZeroBundle)\n\nIf you run ZeroNet with `ZeroBundle` under Linux, please run `ZeroNet.sh` with the following command:\n\n(如果你在 Linux 上使用 `ZeroBundle`，那么请使用以下命令来启动 `ZeroNet.sh`)\n\n```sh\n./ZeroNet.sh --trackers_file /path/to/trackers.txt\n```\n\n**Please note: please make sure your trackers.txt can be read by the user you use to run ZeroNet**\n\n**(请注意，请确保你的 trackers.txt 能被你执行 ZeroNet 的用户读取)**\n\n### Windows (ZeroBundle)\n\nIf you run ZeroNet with `ZeroBundle` under Windows, you can create a `zeronet.conf` within the same directory as `zeronet.exe` with the following content:\n\n(如果你在 Windows 上使用 `ZeroBundle` 运行 ZeroNet，请在 `zeronet.exe` 同一个目录下创建一个 `zeronet.conf`)\n\n```ini\n[global]\ntrackers_file = /path/to/trackers.txt\n```\n\n**The /path/to/trackers.txt is still just a placeholder here, please replace it with the absolute or relative path to the trackers.txt. For example, if trackers.txt is also under the same directory, you could just write trackers.txt in the conf without any path**\n\n**(/path/to/trackers.txt 在这里仍然只是一个例子，请把它替换成到你的 trackers.txt 的相对或者绝对路径。比如说，如果 trackers.txt 也在同一个目录下，那么你直接写 trackers.txt 就好了)**\n\n### macOS (ZeroBundle)\n\nNo idea for now. Haven't used macOS and no idea how it will work. I assume that it will work just like on Windows, but I'm not sure.\n\n(不知道。自己不用，也没人来测试，不知道要怎么做。可能和 Windows 上方法差不多，但是我也不清楚)\n\n### Linux / Windows / macOS (Manual Python / 手动 Python)\n\nIf you run ZeroNet by manually running `python(2) zeronet.py` or similar stuff, please just add `--trackers_file /path/to/trackers.txt` after this command.\n\n(如果你使用 `python(2) zeronet.py` 这样的命令来手动启动 ZeroNet，你只要附上 `--trackers_file /path/to/trackers.txt` 即可)\n\n### Finally / 最后\n\nPlease restart your ZeroNet instance.\n\n(请重启你的 ZeroNet)"
		},
		{
			"post_id": 3,
			"title": "Extra ZeroNet trackers needed",
			"date_published": 1509168788.632,
			"body": "The official ZeroNet implementation contains hardcoded trackers as following:\n\n```python\ntrackers = [\n  \"zero://boot3rdez4rzn36x.onion:15441\",\n  \"zero://zero.booth.moe#f36ca555bee6ba216b14d10f38c16f7769ff064e0e37d887603548cc2e64191d:15441\",\n  \"udp://tracker.coppersurfer.tk:6969\",\n  \"udp://tracker.leechers-paradise.org:6969\",\n  \"udp://9.rarbg.com:2710\",\n  \"http://tracker.opentrackr.org:1337/announce\",\n  \"http://explodie.org:6969/announce\",\n  \"http://tracker1.wasabii.com.tw:6969/announce\"\n]\n```\n\nwhich is not good practice since any tracker may be blocked or be abandoned at any time. Since an arbitary version of the ZeroNet client may depend on an arbitary list of trackers, the network might not be as robust as expected.\n\n* * *\n\nFortunately, there is an option in the current ZeroNet client that enables support for extra tackers, `--trackers_file`, which can be used to load a list of trackers. The `trackers_file` is simply a `.txt` file with one tracker address in one line, and existing BT trackers could be also used as an ZeroNet tracker.\n\nHowever, since most of the ZeroNet users use only the hardcoded trackers, even if one adds more trackers to the list, he will not be able to reach anything because trackers other than the hardcoded ones are just like an isolated island. Furthermore, the ZeroNet protocol is very different from the standard BitTorrent protocol (mainly `.onion` support). This makes it even harder to extend the list of trackers as a single user. Even with `peer exchange`, a user still could not load any new `Zite` that has not been visited by ~~him/her~~ any known peers before. (peer exchange is still a great feature that ensures known zites will at least not break down quickly after losing any of the trackers)\n\nEspecially, none of the available trackers are located in China. Since Internet connection tends to be poor in this country, this will be a problem and is currently being a big problem. As long as the tracker list is fixed, the whole network could be blocked easily by just blocking the trackers - and no new sites will ever reach any user any more.\n\nWith the `--trackers_file` option, we still need a lot more trackers to make this network actually work as expected -- uncencorable, permanent and robust. Would you, if possible, set up one tracker like this?\n\nThinking abou the risk of DDoS attack targeting public BT trackers, I sincerely doubt on the amount of available ZeroNet trackers. Anyway, from any perspective, we do really need a lot more trackers. For now, we may just try with standard BT trackers.\n\nEDIT\n\nA working extra tracker list from [https://github.com/ngosang/trackerslist](https://github.com/ngosang/trackerslist)\n\n```\nzero://boot3rdez4rzn36x.onion:15441\nzero://zero.booth.moe#f36ca555bee6ba216b14d10f38c16f7769ff064e0e37d887603548cc2e64191d:15441\nudp://tracker.coppersurfer.tk:6969\nudp://tracker.leechers-paradise.org:6969\nudp://9.rarbg.com:2710\nhttp://tracker.opentrackr.org:1337/announce\nhttp://explodie.org:6969/announce\nhttp://tracker1.wasabii.com.tw:6969/announce\nudp://tracker.skyts.net:6969\nudp://tracker.safe.moe:6969\nudp://tracker.piratepublic.com:1337\nudp://tracker.pirateparty.gr:6969\nudp://tracker.coppersurfer.tk:6969\nudp://tracker.leechers-paradise.org:6969\nudp://allesanddro.de:1337\nudp://9.rarbg.com:2710\nhttp://p4p.arenabg.com:1337/announce\nudp://p4p.arenabg.com:1337\nudp://tracker.opentrackr.org:1337\nhttp://tracker.opentrackr.org:1337/announce\nudp://public.popcorn-tracker.org:6969\nudp://tracker2.christianbro.pw:6969\nudp://tracker1.xku.tv:6969\nudp://tracker1.wasabii.com.tw:6969\nudp://tracker.zer0day.to:1337\nudp://tracker.mg64.net:6969\nudp://peerfect.org:6969\nudp://open.facedatabg.net:6969\nudp://mgtracker.org:6969\nhttp://mgtracker.org:6969/announce\nudp://explodie.org:6969\nhttp://tracker.mg64.net:6881/announce\nhttp://ipv4.tracker.harry.lu:80/announce\nudp://ipv4.tracker.harry.lu:80\nhttp://tracker1.wasabii.com.tw:6969/announce\nhttp://tracker.torrentyorg.pl:80/announce\nudp://zephir.monocul.us:6969\nudp://z.crazyhd.com:2710\nudp://tracker.vanitycore.co:6969\nudp://tracker.uw0.xyz:6969\nudp://tracker.tvunderground.org.ru:3218\nudp://tracker.torrent.eu.org:451\nudp://tracker.tiny-vps.com:6969\nudp://tracker.swateam.org.uk:2710\nudp://tracker.kamigami.org:2710\nudp://tracker.internetwarriors.net:1337\nudp://tracker.halfchub.club:6969\nudp://tracker.grepler.com:6969\nudp://tracker.files.fm:6969\nudp://tracker.dutchtracking.com:6969\nudp://tracker.doko.moe:6969\nudp://tracker.dler.org:6969\nudp://tracker.desu.sh:6969\nudp://tracker.cypherpunks.ru:6969\nudp://tracker.christianbro.pw:6969\nudp://tracker.bluefrog.pw:2710\nudp://tracker.acg.gg:2710\nudp://thetracker.org:80\nudp://santost12.xyz:6969\nudp://sandrotracker.biz:1337\nudp://retracker.nts.su:2710\nudp://retracker.lanta-net.ru:2710\nudp://oscar.reyesleon.xyz:6969\nudp://open.stealth.si:80\nudp://inferno.demonoid.pw:3418\nudp://bt.xxx-tracker.com:2710\nudp://bt.aoeex.com:8000\nhttp://tracker.vanitycore.co:6969/announce\nhttp://tracker.electro-torrent.pl:80/announce\nhttp://tracker.devil-torrents.pl:80/announce\nhttp://tracker.city9x.com:2710/announce\nhttp://t.nyaatracker.com:80/announce\nhttp://retracker.telecom.by:80/announce\nhttp://retracker.mgts.by:80/announce\nhttp://pt.lax.mx:80/announce\nhttp://open.acgtracker.com:1096/announce\nhttp://fxtt.ru:80/announce\nhttp://agusiq-torrents.pl:6969/announce\nudp://wambo.club:1337\nudp://trackerxyz.tk:1337\nudp://tracker4.itzmx.com:2710\nudp://tracker.xku.tv:6969\nudp://tracker.justseed.it:1337\nudp://tracker.cyberia.is:6969\nudp://tc.animereactor.ru:8082\nudp://packages.crunchbangplusplus.org:6969\nudp://86.19.29.160:6969\nudp://208.67.16.113:8000\nhttp://tracker2.itzmx.com:6961/announce\nhttp://tracker.videodrugproject.com:80/announce\nhttp://tracker.tfile.me:80/announce\nhttp://torrentsmd.me:8080/announce\nhttp://share.camoe.cn:8080/announce\nhttp://retracker.omsk.ru:2710/announce\nhttp://omg.wtftrackr.pw:1337/announce\n```\n\nI added the hardcoded trackers also on the top of this list. For ArchLinux users, put this into somewhere like `/var/lib/zeronet/zeronet_trackers.txt` (**make sure ZeroNet can read it or it would not work**) and then add\n\n```ini\ntrackers_file = /var/lib/zeronet/zeronet_trackers.txt\n```\n\nwill make ZeroNet use these extra trackers.\n\nEDIT 2\n\nFor the `udp://` trackers, the `/announce` path __should not__ be included or ZeroNet will fail to load these trackers. I have updated the list to remove such stuff."
		},
		{
			"post_id": 2,
			"title": "Hello, world.",
			"date_published": 1508930191.453,
			"body": "Finally, I am back on ZeroNet. From now on I will also blog on ZeroNet, without any specific focus. And, I will remember to backup my credentials this time :)\n\nZeroNet has changed a lot since I left last time. Most suprisingly, the user base is still growing these days. It is really pleasing to see so many people supporting the decentralization of Internet.\n\nThis is also a backup plan for me as we might experience Internet \"cut off\" in some areas in China. Anyway, it is possibly yet another Plan B. The best plan will always be to study abroad and work abroad, seeking for migration if possible.\n\nThat's all of my Hello World."
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "My zeronet blog has been successfully created!"
		}
	]
}