{
	"title": "Russ Blog",
	"description": "Отхватил прикольный домен.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 6,
	"demo": false,
	"modified": 1482826757,
	"post": [
		{
			"post_id": 5,
			"title": "Resilio: облако, которое не забанят",
			"date_published": 1482826711.04,
			"body": "https://blog.wtigga.com/btsync-resilio/\n\nКогда говорят о синхронизации файлов между устройствами или облачным хранилищем, часто вспоминают Dropbox. Многие русские пользователи знают про Яндекс.Диск. Отдельные категории граждан — облачное хранилище от Mail.ru. Всё это хорошо, когда вокруг тебя нормальный интернет, но в некоторых странах всё иначе. Большинство подобных сервисов в условиях китайского файервола работают [очень плохо](https://blog.wtigga.com/chinese-firewall/), или совсем никак. Локальные аналоги ([Baidu Drive](http://pan.baidu.com/)) быстрые, но никакого доверия к ним нет, а китайские интерфейсы просто отталкивают. Короче, два года назад я впервые попробовал [Sync](https://blog.wtigga.com/bittorrent-sync/) от BitTorrent, ныне известный как [Resilio](https://www.resilio.com/). С тех пор сервис существенно менялся сначала в плохую, а потом обратно в хорошую сторону. В двух словах, это прямой обмен и синхронизация между устройствами по протоколу BitTorrent, минуя чужие сервера _(с небольшой оговоркой)_. Как я использую [**Resilio**](https://www.resilio.com/)?\n\n*   Перенос фото с телефона на ПК _и обратно_\n*   Бэкап фотографий с ноутбука на домашний сервер\n*   Синхронизация рабочих файлов между домом и офисом\n*   Обмен аниме с друзьями\n\n### Базовые знания\n\nПерво-наперво, установите **Resilio** на [компьютер](https://download-cdn.getsync.com/stable/windows/BitTorrent-Sync.exe) и смартфон ([Google Play/](https://play.google.com/store/apps/details?id=com.bittorrent.sync&referrer=utm_source%3Dbittorrent%26utm_medium%3Ddownloads%26utm_campaign%3Dhome)[APK](https://yadi.sk/d/SJ0iD9RTsj534) и iOS). В настройках приложения на ПК обязательно зайдите в настройки и включите показ ключей, это даёт больше возможностей для настройки. А в настройках мобильно приложения отключите синхронизацию по мобильной сети, чтобы программа не съела платный трафик. ![sync_key](https://blog.wtigga.com/wp-content/uploads/2016/06/sync_key.jpg) Работает всё очень просто. На одном устройстве вы создаёте или выбираете любую директорию (папку) для синхронизации. Resilio сгенерирует для неё особый ключ вида _ALQA2L7FKKB7NIVS6A6XOGZY2HHNLLC12_ из 35 букв и цифр. Ключ нужно ввести в Sync на любом другом устройстве, и они начнут обмениваться данными. Ключ бывает двух типов — \"чтение\" и \"чтение и запись\". В первом случае тот, у кого есть ключ, сможет только получать файлы или изменения в них, то есть тот, кому вы дали ключ на чтение, ничего в папке изменить, добавить или удалить не сможет. Ключ на чтение и запись позволяет делать изменения, которые коснутся всех, кто синхронизирует эту папку. Ключ можно передать неограниченному числу людей. Более того, чем больше устройств синхронизирует эту папку, тем выше будет общая скорость синхронизации, ведь данные передаются напрямую между устройствами без единого сервера. Совсем как с торрентами. Перейдём к примерам использования.\n\n### Перенос фотографий без проводов\n\nЭто, пожалуй, самая полезная функция. Для максимальной скорости лучше подключить смартфон и компьютер к одной сети — обычная ситуация, когда вы дома или на работе. В мобильном приложении уже есть настройка для резервного копирования фотографий, но мне хотелось ещё и управлять фотографиями на смартфоне — удалять лишние, перемещать их в архив на компьютере, переименовывать файлы и так далее. Для этого делаем следующее.\n\n1.  Создайте пустую папку для фотографий на компьютере\n2.  В Sync нажмите  \"Добавить папку\" в левом верхнем углу и выберите созданную папку\n3.  Во вкладке \"Ключ\" найдите ключ \"Чтение и запись\"\n4.  На смартфоне откройте приложение Resilio, нажмите на кнопку **+** и выберите \"Enter key\" (Ввести ключ)\n5.  Введите ключ (можно переслать через какой-то мессенджер с компьютера, или просто ввести на клавиатуре)\n6.  В пункте _Location _нужно найти папку _DCIM_ на вашем Android-смартфоне (там хранятся все фотографии и скриншоты)\n7.  Нажать \"Ок\".\n\n![sync_mobile_dcim](https://blog.wtigga.com/wp-content/uploads/2016/06/sync_mobile_dcim.jpg) Всё. Теперь, когда смартфон подключён к Wi-Fi, а компьютер подключён к интернету, фотографии будут перекидываться на компьютер в выбранную папку. Если телефон и компьютер в одной Wi-Fi сети (например, подключены к одному роутеру), то скорость будет выше, чем любой облачный сервис - фактически, будет максимально возможная скорость, которую позволяет ваш роутер, смартфон и компьютер. Кроме того, вы можете переименовывать или удалять фотографии в синхронизируемой папке на компьютере, и те же изменения будут случаться в телефоне. Если дома есть второй компьютер, можно настроить синхронизацию и на него — тогда фотографии будут храниться сразу в двух местах, что повышает их сохранность и общую скорость синхронизации.\n\n### Синхронизация между компьютерами\n\nПо аналогии. Создайте/выберите папку для синхронизации, скопируйте ключ для чтения/записи, сделайте то же самое на другом устройстве.\n\n### Как улучшить быстродействие?\n\nSync/Resilio работает на протоколе BitTorrent, т.е. как с пиратскими фильмами: чем больше людей раздают, тем быстрее качается. Следовательно, чем больше устройств будут синхронизировать ваши файлы, тем быстрее и надёжнее всё это будет работать. Наверняка у многих продвинутых пользователей есть домашние компьютеры, которые крутятся в сети 24/7, а у кого-то есть и свои VPS. Но ведь не хочется хранить копию на некоторых устройствах, к которым может получить доступ посторонний человек. Например, фотографии на домашнем компьютере при обычной синхронизации будут легко доступны для просмотра тем, кто за компьютером сидит. Тут разработчики сделали фичу, о которой общество просило достаточно давно: зашифрованный контейнер. ![resilio_encrypted](https://blog.wtigga.com/wp-content/uploads/2016/12/resilio_encrypted.jpg) При создании синхронизированной папки можно выбрать опцию _Encrypted folder_, что даст ещё один тип ключа: помимо чтения и чтения/записи будет _Encrypted key. _Используя такой ключ на небезопасном устройстве, оно будет полностью участвовать в получении и раздаче контента, но не получит доступ к файлам: вместо них в папке будет каша из небольших файлов со случайными именами. ![resilio_enc_2](https://blog.wtigga.com/wp-content/uploads/2016/12/resilio_enc_2.jpg) Таким образом можно организовать распределённое хранение информации на удалённых машинах, главное - хранить ключ RW у себя в надёжном месте. Даже если ваш ноутбук сгорит в пожаре, достаточно будет установить клиент Resilio на новую машину и ввести ключ на чтение или запись: пиры автоматически найдутся, и всё скачается на место.\n\n### Раздача файлов друзьям\n\nЧтобы кто-то ещё мог скачать файлы, просто отправьте им ключ на чтение. А чтобы другие могли изменять контент - ключ на чтение и запись. Его можно даже на бумажке записать, ввести руками не так сложно. В Китае, например, Resilio пользуется популярностью в p2p-сети [Zeronet](https://blog.wtigga.com/2016-end/), где люди обмениваются простыми наборами букв и цифр, открывая доступ к разнообразному контенту. Простор для фантазии не знает границ.\n\n### Советы\n\n*   **Используйте именно ключи, а не ссылки** Тогда возможность раздачи не будет зависеть от промежуточных звеньев, типа обработчика ссылок Resilio. _Preferences -> Advanced -> Miscellaneous -> Show \"Copy key\" (for standard users)_\n*   **Включите шифрование внутри сети** Шифрование лишним не бывает. _Preferences -> Advanced -> Open power user preferences -> Lan_encrypt_date = True_\n*   **Увеличьте интервал сканирования папок** Я изменил его с 600 до 6000, чтобы снизить нагрузку на систему. Так часто проверять изменение мне ни к чему. _Preferences -> Advanced -> Open power user preferences -> Folder_rescan_interval = 6000_\n*   **Ограничьте скорость передачи данных, если стабильность работы сети важнее скорости** У меня стоит 1 мегабайт в секунду. _Preferences -> Advanced -> Global Limit_\n\nПожалуй, вот и всё. Пишите свои советы и критику. Даёшь p2p! // blog.wtigga.com - Заметки белого тигра - Vladimir Zh //"
		},
		{
			"post_id": 4,
			"title": "Интернет в России после \"пакета Яровой\"",
			"date_published": 1482815878.769,
			"body": "Спекуляций на тему конечной стоимости хранения трафика много, но все эти спекуляции сходятся на том, что при сохранении текущих тарифов можно не строить ЦОДы а просто сворачивать бизнес и уходить с рынка.\nПутей решения вопроса три:\nувеличение стоимости тарифов по самым скромным подсчётам — в 2-3 раза, по самым кошмарным — в 10 раз\nупразднение безлимитных тарифов и урезание каналов — об этом уже начинают говорить представители крупных провайдеров; о чём-то выше 10 мбит/с, вероятно, можно будет забыть\nкомбинация первых двух путей — то есть наиболее вероятный\n\nКуда деваться пользователям? Никуда, рынок другого не сможет предложить.\n\nЭто не полноценная статья, а скорее заметка-прогноз.\nСам прогноз под катом.\n\n\nТаким образом создаётся прекрасная ситуация для монополизации правительством очередной отрасли.\nВполне вероятно появление на обломках былого раздолья государственного провайдера, который будет освобождён от выполнения предписаний по хранению трафика, и, следовательно, сможет предоставлять те же условия, что сейчас мы имеем у каждого первого частного провайдера. На фоне частных провайдеров при рассматриваемом развитии событий это будут крайне выгодные условия.\n\nНынешние провайдеры не сильно стремятся соблюдать законы о блокировках. Как правило, их методы блокировки легко обходятся, а комбинируют различные методы провайдеры редко. Некоторые провайдеры даже позволяют себе целиком и полностью игнорировать чёрные списки, хотя таких всё меньше (а возможно уже и не осталось, а мои данные устарели).\nВ случае с государственным провайдером эта ситуация может кардинально и резко поменяться. Применяться будут все виды блокировок одновременно. Обход будет крайне затруднителен, если вообще возможен.\nНеобходимость в чёрных списках останется чисто формальная. По факту этот провайдер сможет без всякой законодательной базы блокировать всё, что ему будет нужно, без каких либо комментариев.\nБолее того, государственный провайдер сможет откровенно легко блокировать все виды vpn и все mesh-сети, что технически вполне возможно. При этом для юрлиц он может делать исключения… за отдельную плату и после предоставления ключей шифрования. Или предоставляя свой собственный сервис.\nПри чём, подчеркну, всё это без всякой необходимости в законодательной базе. Хотите — пользуйтесь, не хотите — не пользуйтесь. Монополист может позволить себе такое поведение без каких-либо имиджевых последствий. Тем более, что закон напрямую не запрещает такое поведение.\n\nПочему подобный провайдер рискует стать монополистом?\n\nСреднестатистический пользователь не будет разбираться в нюансах, а будет пользоваться услугами той конторы, которая предоставит наиболее выгодные условия.\nТеми, кто всё таки будет лезть в дебри — можно пренебречь, они в пределах статистической погрешности.\nТаким образом, фактически, этот провайдер очень быстро станет монополистом с огромной долей интернет-пользователей в России, а у частников дела пойдут ещё хуже.\n\nОткуда этот провайдер возьмёт инфраструктуру?\n\nНынешние провайдеры с радостью продадут ему эту инфраструктуру или её элементы, так как в при рассматриваемом развитии событий их текущая инфраструктура им будет просто напросто не нужна. Или большая её часть. Ну и не стоит исключать, что на роль такого государственного провайдера вполне может сгодиться, скажем, ростелеком, у которого уже есть обширная инфраструктура.\n\nЗачем так сложно? Почему просто не запретить vpn и mesh-сети законодательно, и дело с концом?\n\nЗатем, что опять мягко и незаметно варят лягушку. Прямая блокировка vpn на законодательном уровне может обернуться лишними имиджевыми неприятностями для правительства, тогда как в схеме с государственным провайдером-монополистом выгода по крайней мере двойная (очередная карманная компания-монополист с огромными прибылями в кармане у особы, приближённой к императору, безнаказанные огульные блокировки всего подряд — о подоплёке блокировок умолчу, она и так большинству понятна) и без каких-либо рисков.\n\nЗачем тогда весь нынешний цирк с конямиблокировками?\n\nВероятно, банальная апробация методов блокировок и методов обхода. Основной профит — самим ничего делать не нужно, всё сделали провайдеры в части разработки методов блокировок и пользователи в части методов обхода.\nКроме того, если принять, что подобный план действий, как описан в заметке, действительно существует — он мог родится не сразу. Всё таки история раскручивается уже не один год, а долгосрочное планирование — не про наше правительство.\n\nПочему вдруг понадобилась искать смысл «левый» смысл в поправках пакета Яровой?\n\nПотому что в нынешнем виде никакого прямого смысла эти поправки не несут. Результатами сбора трафика будет пользоваться, мягко говоря, проблематично. Закон не предусматривает его обработку.\n\nUPD: Комментарий пользователя Furriest даёт основание полагать, что при подобном раскладе частники могут стань не нужны вообще никому и отмереть из отрасли естественным путём.\n\nЭто просто очередной прогноз вероятного развития событий, не более того. Я никого ни к чему не призываю, в том числе верить этой заметке. Единственное — прошу по возможности прокомментировать Ваш взгляд на вероятность такого развития событий.\n\nvia https://geektimes.ru/users/Ziptar/\n\nЧто думаете?"
		},
		{
			"post_id": 3,
			"title": "Итоги моего 2016-го",
			"date_published": 1482803037.332,
			"body": "Прошедший год был очень интересным и непохожим на другие года. В блоге было всего 35 постов. Итак, За этот год Очистил страницы [Вконтакте](https://vk.com/wtigga) и в [Facebook](https://www.facebook.com/wtigga?ref=bookmarks) практически от всего контента по идеологическим причинам. [![vk_2016_empty](https://blog.wtigga.com/wp-content/uploads/2016/12/vk_2016_empty.jpg)](https://vk.com/wtigga) Впрочем, переводы [ZenPencils](https://vk.com/ru_zen) продолжают публиковаться. Даже [такие](https://vk.com/wall-93019884_576). [![zenpencils_going_tolerant](https://blog.wtigga.com/wp-content/uploads/2016/12/zenpencils_going_tolerant.jpg)](https://vk.com/wall-93019884_576) Начал погружаться в дебри p2p-технологий в повседневной жизни. Для синхронизации и бэкапа использую [Resilio](https://blog.wtigga.com/bittorrent-sync/) (btsync), который заменил Google Drive и Dropbox. ![resilio_2016](https://blog.wtigga.com/wp-content/uploads/2016/12/resilio_2016.jpg) Для общения начинаю использовать безсерверный p2p-мессенджер [Tox](https://tox.chat/) — добавляйтесь, пообщаемся: _EC999A875F35A637EB868DA6B716DF9E09B81DF99DFFB70C932396C8D64D336E5599599F53C8![qtox_2016_2](https://blog.wtigga.com/wp-content/uploads/2016/12/qtox_2016_2.jpg) _ И даже завёл безумный [сайт](http://127.0.0.1:43110/russ.bit) ([два](http://127.0.0.1:43110/vladz.bit)) в [ZeroNet](http://zeronet.io/). Да, такая ссылка для ZeroNet [правильная](https://habrahabr.ru/post/316322/). Первый раз целый год не выезжал из Китая, и почти всё время пробыл в Ханчжоу. [![hangzhou_suns](https://blog.wtigga.com/wp-content/uploads/2016/12/hangzhou_suns.jpg)](https://www.shutterstock.com/ru/pic-483426127/stock-photo-evening-at-qiantang-river.html?src=J8qbNqE1QOI0Yqw-BKFzug-1-47) Правда, весной с другом поехали в безумное авто-путешествие из Пекина во Внутреннюю Монголию ([раз](https://blog.wtigga.com/innermongolia-4/), [два](https://blog.wtigga.com/innermongolia-3/), [три](https://blog.wtigga.com/innermongolia-2/), [четыре](https://blog.wtigga.com/innermongolia-1/)). А теперь друг уехал из Китая. [![Pentax in the Inner Mongolia](https://c3.staticflickr.com/1/346/31022991194_94869544bf_h.jpg)](https://www.flickr.com/photos/vladimir_zh/31022991194/in/photostream \"Pentax in the Inner Mongolia\") А летом были в Даляне, Гуанчжоу и Пекине. [![20160716_1449_9536_](https://c7.staticflickr.com/1/664/31015310254_dba4e1532c_h.jpg)](https://www.flickr.com/photos/vladimir_zh/31015310254/in/datetaken/ \"20160716_1449_9536_\") Занялся продажей фотографий на [Shutterstock](http://shutterstock.com/g/wtigga), редкими постами в [500px](https://500px.com/wtigga), совсем редко в [Flickr](https://www.flickr.com/photos/vladimir_zh/). Начал записывать видео с моей стрёмной игрой на гармошке ([отдельный пост](https://blog.wtigga.com/harp-mongolia/)), и сделал целый [плейлист](https://www.youtube.com/playlist?list=PLLrkspIdyZCtYRLikS4Pz5zxfg_Lj9adE) на YouTube: <iframe src=\"https://www.youtube.com/embed/videoseries?list=PLLrkspIdyZCtYRLikS4Pz5zxfg_Lj9adE\" width=\"1000\" height=\"563\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe> Зачем-то начал ходить в китайскую автошколу, потом расскажу в подробностях. ![chinese_driving_school_2016](https://blog.wtigga.com/wp-content/uploads/2016/12/chinese_driving_school_2016.jpg) Вместе с женой помогли одному уличному котёнку найти новых хозяев. ![lucky_turkey_sandwich_2016](https://blog.wtigga.com/wp-content/uploads/2016/12/lucky_turkey_sandwich_2016.jpg) А его сестру переселили от входа подземки в приличный зелёный микрорайон. ![not_so_lucky_2016](https://blog.wtigga.com/wp-content/uploads/2016/12/not_so_lucky_2016.jpg) И в этом дворе кормим её и других котов два раза в день. ![cats_2016](https://blog.wtigga.com/wp-content/uploads/2016/12/cats_2016.jpg) В котовьей семье тоже пополнение, теперь у нас двое рыжих. ![our_cats_2016](https://blog.wtigga.com/wp-content/uploads/2016/12/our_cats_2016.jpg)   C надеждой смотрю на грядущий 2017-й. С наступающим! // blog.wtigga.com - Заметки белого тигра - Vladimir Zh //"
		},
		{
			"post_id": 2,
			"title": "Новый год, друзья. Как празднуем?",
			"date_published": 1482410027.589,
			"body": "Мы будем смотреть в записи поздравления Брежнева, Иронию Судьбы с английскими субтитрами и есть оливье. А вы как?"
		},
		{
			"post_id": 1,
			"title": "Русичи, объединяйтесь в ЗероНет",
			"date_published": 1433033779.604,
			"body": "Накидайте в комментах, почему блог говно и что тут, по-вашему, должно быть."
		}
	]
}