{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "中国烈士旅炸毀安徽六安兵工厂",
			"body": "中国烈士旅在11月8日晚发动袭击，炸毁了中共安徽六安市舒城县棠树工业园秦家桥兵工厂，爆炸共造成近百兵工厂匪徒死亡，这些匪徒为中共卖命，死有余辜。这次袭击事件是10月24日陕西榆林大爆炸后不久中国烈士旅又一次对中共的一记铁拳！中共长期盘踞安徽，在安徽地区设立大量兵工厂和军事设施，非法生产储存大量爆炸物、军品弹药，并大量贩卖武器弹药到中东一些国家地区牟取暴利，挑逗那些国家互相交战，对中国乃至国际社会危害极大。六安的這家兵工廠，主要生產航空炸弹和火箭弹、反跑道炸弹，用于攻击台湾机场，中国烈士旅坚决打击中共这种邪恶流氓组织！\n\n这次攻击是中国烈士旅下属安徽分旅的一名死士发动的，他是我们打入共匪兵工厂的内线，在攻击行动中已牺牲，我们向他致以崇高敬意与沉痛的哀悼！烈士旅战士不畏死亡，与共匪同归于尽，这种牺牲大义鼓舞着我们同共匪决战到底！\n\n这次攻击后，中国烈士旅已将与中共的和解费从380万元提升至4000万元。\n\n中国政府：如你们不想有下一次袭击，必须付给我组织人民币4000万元，如果你们同意，就在官方报纸上公开声明同意我组织的要求，我們自会提供你收款方式。和解费不议价不谈判，什么时候中共同意付款，中国烈士旅停止对中共的打击行动，款项一日不结清，中国一日不得安宁。下一次行动，时间不固定，地点不固定，方式不固定，你们不可能阻止！",
			"added": 1478998550,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 2,
			"title": "首例与使用零网有关的国内网民被逮捕事件",
			"body": "最新消息：\n近日，家住湖北省襄阳市樊城区大庆东路的男子李某因在互联网下载并上传暴力恐怖视频，被樊城区人民法院判处有期徒刑八个月，并处罚金2000元。据悉，该案系襄阳市首例非法持有宣扬恐怖主义物品罪案件。\n2016年，李某先后在网上下载宣扬暴力恐怖信息的视频37部，内容多为斩首、剖腹等血腥恐怖画面。同年8月，李某将上述视频上传到互联网云网盘，被网警发现。9月22日，公安局民警在李某家里电脑上将相关视频全部查获。经襄阳市公安局反恐支队甄别，该37部视频均为暴力恐怖视频，累计时长达150分钟左右。\n庭审中，李某辩称因为好奇才从网络上下载相关视频，但因为视频太占内存，才决定将其上传至云网盘，不知道已经触犯刑法，对自己的行为表示十分后悔，希望能够免于刑事处罚。\n法院经审理认为，被告人李某明知是宣扬恐怖主义的音视频资料而非法持有，并上传至网络，情节严重，其行为已经构成非法持有宣扬恐怖主义物品罪。鉴于李某认罪态度较好，可以酌情从轻处罚，遂作出如上判决。\n\n经过分析分析，我们认为，小李下载的暴恐视频来源，就是零网。他先是看到这个链接：\n127.0.0.1:43110/NewGFWTalk.bit/?Topic:1_16V375PksR7cEwnMDf2m5TYckuud9xUjVq/ISIS\n然后是这个视频站点：\n127.0.0.1:43110/1PvY5QCo5WdJAaVAeXGSJEenS45W8qBLqY\n这个视频站的发布日期是2016年7月，共发布了40多部暴恐视频，同新闻说的时间和数目正好对得上。考虑搜索ISIS发布的视频具有相当难度，和国内上网翻墙不容易，小李应该就是从零网下载的视频。但小李不太可能是这些零网视频的发布者，零网的安全还是有一定基础的。我们推测，小李从零网下了这些视频后，转存到了百度网盘之类的网盘上，才被国内网警抓获。如果他不上传到国内云盘，那么他不会出事。而襄阳这么一个小城市的网警竟然也能监控百度这样的大型网站，说明国内网警鹰犬的触角已经伸得到处都是，应该引起大家的警惕。\n\n零网的文件共享功能，目前看未发现有太大的威胁，但零网的文件共享安全还需要时间来检验，为了绝对安全，革命组织要求大家：最好不要在零网上共享暴恐文件和尺寸较大的文件（容量超过50M），包括专门用于共享文件的IPFS也是如此，同时严格遵守《零网ZeroNet安全使用规范》标准。当然，在国内云盘上传敏感文件更是绝对禁止！\n如果要安全共享暴恐文件，建议使用\n1，暗网洋葱站点（前提是必须会翻墙）\n2，一些境外明网文件共享站，如archive.org，ultrashare.net，upload.mobi等，将要共享的文件压缩并设置密码后再上传（同样要求在翻墙情况下使用）",
			"added": 1490102949,
			"parent_topic_uri": "10_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 3,
			"title": "公告:新站点NewGFWTalk.bit乱删帖,有严重风险,请大家不要再去！",
			"body": "就在刚才，我在零网新站127.0.01:43110/NewGFWTalk.bit发过的言论全部遭到删除，推测是站点管理员p2p所为。我在他的站没有发多少帖，只是发的内容多数涉及政治和反共，并且最新的帖子还包括《零网安全使用规范》一文，帮助零网用户提高安全使用零网、防范中共当局追捕，竟然也遭到删除，这就非常可疑了。\n在今年初，GFWTalk.bit遭到人恶意刷屏，p2p建立了NewGFWTalk.bit新论坛，要求大家不要再在这里留言，都转到新论坛去。p2p对新论坛是有绝对控制权的，他当然可以删除自己管理论坛下的任何内容，但这种管理事实上形成高压专制管理，使自由的P2P网络空间再一次沦为网络监管审查区域。如果p2p本人是开明的，那么他的管理倒也无所谓，问题是我过来发表政治内容，并无任何捣乱违规问题，他为什么要删光我的贴子？而且是暗中捅刀子，并无任何明白的警告和通知！\n大家都知道，老论坛GFWTalk.bit是黑客xiaolan创办的，xiaolan隐退了，但论坛仍然正常运行，确实会有个别捣乱分子刷屏，但捣乱分子可能只是一时胡闹，并不可能长期捣乱下去，p2p借机搞了个新论坛，而且新论坛是完全照抄剽窃的方式，复制了xiaolan论坛的内容，而且整个目录结构都一样，他的动机何在呢？这也是比较可疑的。\n我们可以假设，也许p2p是共青团内部人士，在GFWTalk.bit上刷屏就是他一手所为，目的就是要把人都拉到他自己的新论坛去，而新论坛是他个人完全控制的，可以删除他不喜欢的内容，甚至对发言用户进行跟踪和监视也不一定，这种手段与共匪控制海外媒体的手法非常相似，所以我有必要提出来让大家提高警惕！\n也许p2p与共匪无关，但他乱删政治帖子的行为本身表明零网已不再是自由的小区，相信任何一个零网用户都不会喜欢这样的审查管制！\n鉴于此，我呼吁大家不要再去p2p的论坛发言了，仍然回到旧论坛127.0.01:43110/GFWTalk.bit来，至少这里没有审查，至于有人捣乱的问题，捣乱的情况只是偶发现象，如果有人乱刷屏，就删除他的公匙，不要cache他的内容就可以了。或者，大家可以去开明的人管理的站点发言。毕竟，GFWTalk.bit是正宗，而NewGFWTalk.bit是山寨盗版",
			"added": 1490107296,
			"parent_topic_uri": "1_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 4,
			"title": "公告:新站点NewGFWTalk.bit乱删帖,有严重风险,请大家不要再去！",
			"body": "就在刚才，我在零网新站127.0.01:43110/NewGFWTalk.bit发过的言论全部遭到删除，推测是站点管理员所为。我在他的站没有发多少帖，只是发的内容多数涉及政治和反共，并且最新的帖子还包括《零网安全使用规范》一文，帮助零网用户提高安全使用零网、防范中共当局追捕，竟然也遭到删除，这就非常可疑了。\n*****\n在今年初，GFWTalk.bit遭到人恶意刷屏，p2p建立了NewGFWTalk.bit新论坛，要求大家不要再在这里留言，都转到新论坛去。p2p对新论坛是有绝对控制权的，他当然可以删除自己管理论坛下的任何内容，但这种管理事实上形成高压专制管理，使自由的P2P网络空间再一次沦为网络监管审查区域。\n******\n更新：p2p回復說他沒有刪帖，可能是存在技術原因導致帖子丟失。對這種説法不能完全采信，理由是，我使用零網一向非常謹慎，沒有輸入過多的代碼、執行過多的操作，爲何突然出現故障？此外，如果是技術原因導致帖子丟失，爲何其它論壇我發過的帖沒有任何問題？另外p2p說新論壇還有四個超級版主有權限管理帖子，這就太恐怖了，4、5個人管一個小小的零網論壇，審查太嚴了！就算p2p沒有問題，如何能保證另外的幾個超級版主沒有問題？所以，p2p的回復我衹能對之持保留態度，但暫時先刪除對p2p的指控。",
			"added": 1490107496
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1_1J1uAB9jUCqBXwGH4GqBvWWusJcBryfFkN": [
			{
				"comment_id": 1,
				"body": "不会GPG加密或不愿意留GPG公匙的朋友，也可以留下你的匿名电子邮箱（虽然不建议），下载链接会直接发到你的邮箱，链接一次性有效，请勿随意转给他人。\n中国烈士旅需确认炸药制作数据掌握在真正需要的人手中，拥有该数据即可让你拥有随心所欲使用大威力武器（最重要的是安全操作）的能力，你可利用它做任何你认为应该的事！\n任何对中共体制、人员、设施、社会各组成部分实施攻击的人，中国烈士旅都承认他是烈士旅战士！他的行动后果与责任由中国烈士旅来承担！中国烈士旅号召中国人民对中共实施独狼式攻击，你可自行决定攻击的方法、时间、地点、攻击对象，自行决定一切行动！而不必听从本组织的指挥。",
				"added": 1479032729
			},
			{
				"comment_id": 2,
				"body": "",
				"added": 1479032913
			},
			{
				"comment_id": 3,
				"body": "> [64](#comment_10_17F7Tv4U5FubX94o8SqGmM18bX6cpKbrXW): 發我Zeromail吧。\n\n显示发送失败，  zeromail邮箱无法发送，你提供一个其他邮箱地址",
				"added": 1479049128
			},
			{
				"comment_id": 4,
				"body": "辩证唯物史观认为人类的发展是螺旋式前进，波浪式上升，新政权不一定比旧政权好，有这种可能，但总体来看，人类建立的政权是不断进步的，如果新政权更糟糕，自然会有其他革命力量继续推翻取代现政权。何况中国烈士旅否定共产主义和社会主义，支持民主人权的最高目标，你从哪方面认为中国烈士旅差呢？革命过程中死一些奴才草民是不可避免的，从另一个角度看，他们的牺牲也是为了将来的大同社会，是有意义的。解决问题要抓住重点，捡起西瓜丢弃芝麻就是好的策略。中国社会目前的症状是太稳定太太平，这种情况会造成人民甘心被统治而不思进取，而这正是中共所希望的。",
				"added": 1479124134
			},
			{
				"comment_id": 5,
				"body": "> [nekocross](#comment_89_1FHN4oukAG7zFUpiC9L2iz7QpQVTuT3xkz): 那么来说一下你们的执政立场吧，也就是“共党倒台”之后你们打算怎么办\n可以照搬美国的政治制度，14亿人民一人一票选出总统，中国适合搞多党制。",
				"added": 1479145194
			}
		],
		"6_1GRaNTG9oq9Hj7QGE56ipfGs5u8oKGgfYJ": [
			{
				"comment_id": 6,
				"body": "各位注意 新論壇New GFW Talk (http：//127.0.0.1:43110/NewGFWTalk.bit/) 搞言論審查，管理員p2p會刪除激進政治帖子，很可能是一個陷阱，爲安全起見，請大家不要再去！還是回到這個老論壇來發言。",
				"added": 1490110367
			}
		],
		"4_1J1uAB9jUCqBXwGH4GqBvWWusJcBryfFkN": [
			{
				"comment_id": 7,
				"body": "p2p管理員，假設如你所言，你們沒有刪我的帖子，但帖子莫名其妙突然失蹤的情況是客觀存在的，而你的data.json里竟然還留有我發言記錄，至少能説明一件事：是有人惡意搞了破壞。或者當局有能力入侵，刪除某用戶的發言，這種情況也屬於零網的漏洞，至少也説明這網絡是有些問題的，你們應該繼續觀察和測試。",
				"added": 1490112203
			},
			{
				"comment_id": 8,
				"body": "我上這個網是專機，連瀏覽器都不會換，不可能換設備。以前上零網碰到唯一的問題是速度有點慢，但這對于P2P網絡來説是正常的，按零網的更新機制，需要數字簽名，也比較可靠，就算更新不成功，之前的帖子不應該丟失。你說論壇有四五個管理員，我估計至少有一個是有問題的，已經被共產黨滲透了，共產黨搞地下鬥爭最厲害，衹是不知道是誰，他不知道動了什麽手脚，阻止了貼子的顯示。而在其他論壇，比如這裏，因爲他沒有權限，我的帖就丟不了",
				"added": 1490134823
			}
		],
		"1_13ngZkJMuFmdigWRdprbmosY8pbqcXnmNw": [
			{
				"comment_id": 9,
				"body": "一剑飘尘是幫共產黨説話的，頭腦迂腐得很，或者説他是個在美國的五毛，經常發一些不陰不陽的文章混淆視聽",
				"added": 1490135282
			}
		]
	},
	"comment_vote": {}
}