{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1613990001,
			"title": "poszukuje programu / skryptu / wtyczki",
			"body": "coś podobnego do youtube-dl z tym że chcę pobierać z google drive.  zna ktoś coś takiego? \nmyślałem że youtube-dl w najnowszej wersji sobie poradzi bo obsługuje wiele nowych serwisów ale...\n``` ERROR: Unsupported URL: https://drive.google.com/drive/(...)```\ndodam że nie próbowałem pojedynczych plików tylko cały folder pobrać a chodzi mi o to żeby w przeglądarce nie wchodzić na dany link tak samo jak w youtube-dl.\n\nbtw. JDownloader odpada bo w większości przypadków wywala ``` Wtyczka przestarzała``` i trzeba co chwilę resetować ",
			"added": 1613990000
		},
		{
			"topic_id": 1614911443,
			"title": "rozwiązanie problemu, gdy nie pobierają się filmy np. w youtube PL",
			"body": "Witajcie, jest noc.. po godzinie 3.... ale obudziłem się i nagle mnie olśniło\nna czym polega problem?\nchodzi o to że w różnych stronach ZeroNet a najbardziej w [YouTube PL](http://127.0.0.1:43110/15Lr9YZ4DC9ZF2BSwZc7S1wDr9hTDx9w5h/) wkurzało mnie to, że został dodany jakiś film i nie mogę go obejrzeć, mimo dużej ilości trackerów i wiedzy u źródła, że film jest dobrze rozesłany (czyli kilkakrotnie w całości seedowany).\n\nokazuje się że problem **nie występuję w Linux** i to naprowadziło mnie w sumie na rozwiązanie\n\nchodzi o to że w windows jest ograniczona liczba znaków `260` jesli chodzi o nazwę plików (łąznie ze spacjami). Windows nazwę pliku widzi nie jako sam film np. `2021.03.04.01.[PL]-ODZYWIANIE-Optymalne odzywianie-C.Chacinska-[28min]-.mp4` tylko *widzi to łącznie ze ścieżką dostępu na dysku* czyli np. w moim przypadku:\n`C:\\Users\\[username]\\Desktop\\Wszystkie Foldery\\portable\\sieci p2p\\ZeroBundle-po aktualizacji do 0.7.x\\data\\15Lr9YZ4DC9ZF2BSwZc7S1wDr9hTDx9w5h\\data\\users\\1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ\\2021.03.04.01.[PL]-ODZYWIANIE-Optymalne odzywianie-C.Chacinska-[28min]-.mp4`\n\nsam plik mp4 w nazwie ma poniżej dopuszczalnych 260 znaków ale gdy weźmiemy pod uwagę ścieżkę pliku przekracza tą ilość i jest z tego powodu blokowanie.\n\nwystarczyło że zmieniłem ścieżkę do ZeroNet czyli zmieniłem nazwę folderu na `zero` i przeniosłem całość bezpośrednio na dysk C:\\ i uruchomiłem klienta i nagle eureka... \nfilmy zaczynają się ściągać i można oglądać.\n`C:\\Zero\\data\\15Lr9YZ4DC9ZF2BSwZc7S1wDr9hTDx9w5h\\data\\users\\1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ\\2021.03.04.01.[PL]-ODZYWIANIE-Optymalne odzywianie-C.Chacinska-[28min]-.mp4`\nnazwa skrócona o prawie 100 znaków.\n\nbyć może tylko ja o tym nie wiedziałem i ameryki nie odkryłem w tym momencie, ale uznałem że warto o tym napisać bo może ktoś będzie miał lub ma podobny problem nie tylko z  [YouTube PL](http://127.0.0.1:43110/15Lr9YZ4DC9ZF2BSwZc7S1wDr9hTDx9w5h/) w windows.\n\njeśli uważasz że materiał jest wartościowy kliknij `upvote` żeby nie zaginął gdzieś na dole strony.\npozdrawiam i teraz chyba się już wyśpię....",
			"added": 1614911441
		}
	],
	"topic_vote": {
		"1613835910_1GcPQswRskdfDPjH9jihgBWpJFGgLHLaC8": 1,
		"1613990001_16rNb85qZo2wJiF8MjPKqLTm1DTkYiRLgz": 1,
		"1614911443_16rNb85qZo2wJiF8MjPKqLTm1DTkYiRLgz": 1
	},
	"next_comment_id": 35,
	"comment": {
		"1611090757_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 1,
				"body": "> [adam2](#comment_4_1QBGxPiLVbhA9dt8Yqex2EsZxoWtAhMVix): Zainstalowałem Linuxa. I zainstalowałem zero net. Jestem początkującym użytkownikiem tego systemu.Nie mogę otworzyć , żadnego linku? Czy ktoś wie dlaczego? Co mam zrobić? Chcą żebym się zalogował do google.A ja nie chcę tego zrobić, czy ktoś wie, Co można zrobić, żeby ominąć tą blokadę? Czy jest jakiś sposób na na ominięcie tego logowania. Zaczynam nowe życie, chciałbym pozostać anonimowy. Nie chcę być więcej niewolnikiem.Proszę o jakąś poradę. Z góry dziękuję za pomoc.\n\nmożna próbować pobrać powyższe materiały za pomocą wtyczki youtube-dl, skoro radzisz sobie z instalacją linux i zeronet to i z tą wtyczką sobie poradzisz. poszukaj informacji o niej tu na zero necie \npozdrawiam.",
				"added": 1611124105
			},
			{
				"comment_id": 2,
				"body": "> [adam2](#comment_5_1QBGxPiLVbhA9dt8Yqex2EsZxoWtAhMVix): Radzenie sobie, to wielkie słowa. Ktoś życzliwy pomógł to zrobić. Poszukam tego \"dl\". Na razie wszystko czytam, co tutaj jest napisane. Dzięki za naprowadzenie. Zabieram się do roboty.\n\npodpowiem tyle że yutube-dl pozwala na to że nie wchodzimy wgl. na strony google więc nie trzeba się nigdzie logować :)",
				"added": 1611126604
			},
			{
				"comment_id": 3,
				"body": "> [arione](#comment_60_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY): Jaka wersja youtube-dl? Dzięki.\n\nw zależności od tego jaką wersje debiana używasz bo niestety nie ma kompatybilności wstecznej z tego co zauważyłem. najlepiej i najszybciej potestuj co Ci zadziała.",
				"added": 1611174174
			}
		],
		"1611995160_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 4,
				"body": "Szanowny kolego ja bym na Twoim miejscu raz jeszcze temat przemyślał i zrobił to inaczej \notóż pendrive jest pamięcią ulotną i możesz stracić instalacje szybciej niż myślisz \ndrugą sprawą jest sam proces instalacji - niezbyt prosty dlatego polecam Ci inne rozwiązanie - trwałe\n\nmały dysk SSD i do kieszeni jako zewnętrzny - koszt raptem 100 - max 120zł  \nzalety? trwała pamięć, mniejsza awaryjność, lepsze osiągi transferu (pendrive nawet 3.0 nie dorówna jemu)\n\nco do pytania o ilość obrazów iso cd/dvd \njeśli chcesz mieć całe repozytoria to musisz pobrać wszystkie cd (8szt)\nosobiście polecam \namd64 KDE  i ten obraz > \tdebian-live-8.6.0-amd64-kde-desktop.iso  w 1 pliku a potrzebne repozytoria pobierane są z internetu w momencie gdy są potrzebne. \npobierasz > klik > http://cdimage.debian.org/cdimage/archive/8.6.0-live/amd64/iso-hybrid/debian-live-8.6.0-amd64-kde-desktop.iso\nzawiera on środowisko graficzne KDE jest łudząco podobny do windowsa i ma wszystkie aplikacje potrzebne do działania bez dodatkowej instalacji jednocześnie bez zbędnych śmieci.\n\nnie masz czytnika CD więc robisz bootowalny pendrive / live cd i podpinasz w 1 usb a do drugiego dysk zew. i w ten sposób instalujesz.\n\nmam nadzieję że skumasz o co mi chodzi, pozdro.",
				"added": 1612015455
			},
			{
				"comment_id": 5,
				"body": "> [fornakter](#comment_81_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY): @tueerin spoko, jednak Linuxa w domu uzyalbym tylko ja, a przeniesienie go w kieszeni do innego laptopa bardzo by mi odpowiadało, dlatego nie mam jakiś dużych wymagań odnośnie ilości pamięci tip.\n\ndysk ZEWNĘTRZNY USB Ci to umożliwi....\n\n(siadasz do kompa, podpinasz usb dysk, botujesz jak pendrive i po sprawie, odchodzisz, zabierasz ze sobą dysk a domownicy mają komputer do swojej dyspozycji, prościej się nie da chyba tego zrobić żeby miało ręce i nogi )",
				"added": 1612021292
			},
			{
				"comment_id": 6,
				"body": "użyj ultraiso, instrukcje np. na youtube\n\neditt:// możesz też wybrać inny obraz np. wersje 8.10 spróbować ale 8.6 jest jedną z tych bardziej stabilnych. Pamiętaj jednak by było to KDE i wersja NIE net install ",
				"added": 1612171416
			},
			{
				"comment_id": 7,
				"body": "a nie masz możliwości wypalić płyty u kogoś i nagrać sobie na ten dysk zewnętrzny a potem używać u siebie gotowego systemu?",
				"added": 1612174090
			}
		],
		"1612351541_1QEiA6MFKgrXHPFDNC3dDbqY7DhRHQMoCF": [
			{
				"comment_id": 8,
				"body": "na głównej stronie na pewno się da",
				"added": 1612351846
			}
		],
		"1612864142_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": [
			{
				"comment_id": 10,
				"body": "ja widzę wpis że jest film, lecz musi mi się pobrać zanim go zobaczę, więc czekam,...\n\nna starej wersji zeronetu nie pokazują się filmy wrzucone z nowej wersji...",
				"added": 1612887063
			}
		],
		"1613124829_1AimmuFnBKDmQaYHzZerAJEHwsyBUddhMY": [
			{
				"comment_id": 12,
				"body": "wygodniejszym i korzystniejszym dla ogółu bo więcej ludzi tworzy sieć...",
				"added": 1613125347
			}
		],
		"1613426915_1JZ8pyPNPtaH5pdLNzcifFLoBppBZj3SaC": [
			{
				"comment_id": 13,
				"body": "zweryfikowani? przez kogo? Wiki wtedy już przestanie być Wiki....",
				"added": 1613486372
			},
			{
				"comment_id": 14,
				"body": "może krzotr@zeroid.bit: chce dorobić....",
				"added": 1613513337
			},
			{
				"comment_id": 15,
				"body": "ja na Twoim miejscu, zrobił bym stronę główną swojego projektu na ZeroNet i w niej podstrony w zależności od tego co i ile bym potrzebował,  ZeroNet był by tak jak by Twoim serwerem a katalog Twojej strony adresem który rozpowszechnisz do ludzi... masz wszystko pod kontrolą, jesteś właścicielem, nie wchodzisz nikomu w buciorach do domu / życiorysu i wszyscy są zadowoleni.\nnie przywłaszczaj sobie za pieniądze czyjejś pracy i stron.",
				"added": 1613563889
			},
			{
				"comment_id": 17,
				"body": "jest nas tu garstka a obrzucanie błotem tylko z jednej strony... to dobry wynik jak na... no właśnie.",
				"added": 1613655484
			}
		],
		"1613519322_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 16,
				"body": "widywałem młodsze dzieci które potrafiły lepszy numer wywinąć... ciekawe w jakim kierunku to wszystko idzie.",
				"added": 1613571443
			}
		],
		"1613679119_15BkAmNAe2cLXERV6bNtyDx9mXnGzY9Lh1": [
			{
				"comment_id": 18,
				"body": "tu jest spis, wystarczy uzupełniać, po co robić dziesiątki stron o tym samym?\n\n[Lista Polskich stron w ZeroNet](http://127.0.0.1:43110/1MeChXgGR3oZ26EPZS9dwbUyu1TacM2Y6T/?Page:listapolskichstronzeronet)",
				"added": 1613719790
			}
		],
		"1613835910_1GcPQswRskdfDPjH9jihgBWpJFGgLHLaC8": [
			{
				"comment_id": 19,
				"body": "poczytaj to [klik](http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:3:How+to+have+a+blog+like+this) ten temat już Ci trochę rozjaśni, a skoro chcesz się brać za stronę to zapewne język tuta nie będzie problemem.",
				"added": 1613836689
			}
		],
		"1613990001_16rNb85qZo2wJiF8MjPKqLTm1DTkYiRLgz": [
			{
				"comment_id": 20,
				"body": "potestuje *dzięki* jak ktoś coś jeszcze ma to śmiało wrzucać.",
				"added": 1613997672
			},
			{
				"comment_id": 29,
				"body": "> [xanadu](#comment_2_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH): jdownloader\n\npisałem że odpada... czytaj do końca...",
				"added": 1615387537
			}
		],
		"1613863319_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 21,
				"body": "najśmieszniejsze jest to że w rankingach bezpieczeństwa wśród przeglądarek internetowych według \"specjalistów\" wygrywa.....  *google chrome* od wielu lat.\n\nnic dodać nic ująć.",
				"added": 1614062048
			}
		],
		"1614277389_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 22,
				"body": "lista informacji jakie zbiera o nas messenger jest przerażająca, tyle o ile z racji wykonywanej pracy muszę mieć FB staram się go nie mieć w telefonie, a jeśli już to w kontenerze.... (facebook container - firefox) messengera w życiu bym nie zainstalował w telefonie....\ncieszy mnie też nowina że teraz w firefoxie każda strona będzie miała osobny \"pojemnik\" więc taki fejs teoretycznie nie dowie się co przykładowo kupuje na allegro itp.\nliczę na szybkie skopiowanie tego do przeglądarki vivaldi która z kolei, swoją funkcjonalnością, bije resztę na głowę.\n\nsorka za off-top ale troszkę w temacie też jest.\nzgadzam się z przedmówcami - serwują kolejny śmieć do apki i sprawdzają jak jej brak wpływa na kontakty ludzi ze sobą.",
				"added": 1614438937
			},
			{
				"comment_id": 26,
				"body": "> [fornakter](#comment_86_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY): Widzę, że ta Vivaldi wygląda jak Opera\n\nwyglądała... z tego co wiem tworzą ją programiści, którzy niegdyś tworzyli operę, którą przejęli chinole swego czasu. programiści opery byli zmuszani iść drogą którą nie chcieli, więc odeszli i stworzyli coś swojego - vivaldii\n\nrównolegle akurat ktoś o tym na zerotalku pisze....  [klik](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1614539923_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc) zapytanie o przeglądarki i okazuje się że też używa vivaldi",
				"added": 1614548947
			}
		],
		"1614911443_16rNb85qZo2wJiF8MjPKqLTm1DTkYiRLgz": [
			{
				"comment_id": 27,
				"body": "> [driud](#comment_246_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Witam; Można jeszcze bardziej uprościć sprawę.  Wystarczy tylko wkleić link, ten podstawowy, na Zero;Taki link wygląda następująco:2021.03.04.01.[PL]-ODZYWIANIE-Optymalne(...)\n\nWidać że szanowny kolega nie zrozumiał o co chodzi, \n\nproblem nie do końca jest w tytułach na youtube PL chociaż osobiście uważam że szczególnie te dwa myślniki na końcu tytułu, są tam niepotrzebne i mogą zaoszczędzić ilość znaków.\n\nale jak pisałem wyżej problem jest w WINDOWS, więc nie rozumiem do czego @Driud się odnosi swoim postem.",
				"added": 1614925214
			}
		],
		"1615135071_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 28,
				"body": "hmmmm....",
				"added": 1615225998
			}
		],
		"1615311798_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 30,
				"body": "po pierwsze ten program jest od dawna\npo drugie już kilkakrotnie sprawdzałem i nie działał  ( chyba że teraz jakąś aktualizacje zrobiono )\na po trzecie jak nie będzie serwera w zero net itp to nie wydarzy się to co tu... [klik](https://www.msn.com/pl-pl/wiadomosci/nauka-i-technika/sp%C5%82on%C4%99%C5%82a-olbrzymia-serwerownia-ovh-utracono-dane-pad%C5%82y-strony-internetowe-i-skrzynki-e-mail/ar-BB1erxGl?li=BBr5Fav)",
				"added": 1615387684
			},
			{
				"comment_id": 32,
				"body": "> [krzysztof113](#comment_2_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5): Dziala, korzystam. Przynajmniej poprzednia wersja. Nawet baterii za bardzo nie zuzywa. I ogolnie to dobrze ze jest bo kiedys sie bawilem z dostawaniem do ZN na innym komputerze.\n\nkoniec z końcem to działa jako klient? chodzi mi o to czy jak na komputerze udostępnia strony z których korzysta.\njeśli tak to cienko widzę pamięć telefonu po np. 2-3 miesiącach użytkowania + ilość danych komórkowych...",
				"added": 1615458521
			}
		],
		"1615329718_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 31,
				"body": "chciałem napisać że tytuł sam sobie przeczy, ale to rzeczywiście smutne :/ ja osobiście jestem na etapie \"konia\" i czuje że \"krowy\" nie dożyje :/ patrząc z perspektywy \"psa\" to chyba nawet dobrze",
				"added": 1615388615
			}
		],
		"1606360383_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 33,
				"body": "> [nomads95](#comment_12_17kVRGE5otWDwpkV4Pn1M7NrFKVLwgLUj8): Jest marzec 2021 i nikt nie każe mi się szczepić więc proszę nie nakręcajcie paranoji strachu i zamordyzmu.\n\nciekawe... nikt Ci nie każe ale....   \n1. tu nie pójdziesz bo nie jesteś zaszczepiony \n2. tam Cię nie przyjmą do pracy bo nie masz szczepienia \n3. nie podbiją książeczki zdrowia bo nie ma szczepienia \n4. i wiele więcej można wymieniać.... \n\noczywiście to jeszcze nie weszło ale zaczynają o tym być słuchy (certyfikaty szczepienia czy choćby nowa usługa w aplikacji mObywatel, w której masz cyfrowe potwierdzenie szczepienia itp), a w taki sposób się przyzwyczaja ludzi do \"nowej\" rzeczywistości, \"tu coś wspomnimy, tam coś bąkniemy\" i jak zwykle przejdzie \"bo przecież było wiadomo od dawna i nikt nie protestował\" \n\nto jest dobrowolne przymuszenie do czegoś.",
				"added": 1615629329
			},
			{
				"comment_id": 34,
				"body": "> [nomads95](#comment_14_17kVRGE5otWDwpkV4Pn1M7NrFKVLwgLUj8): Pracuję w firmie w której nikt nie każe mi się szczepić a w lutym chodziłem  do lekarza na wizytę osobistą\n\ncieszę się, za jakiś czas wrócimy pewnie do tematu - oby to co napisałem niżej się nie sprawdziło",
				"added": 1615647205
			}
		]
	},
	"comment_vote": {
		"11_1Jgcm8RpHNjFQjthZWfLHi6QdeqU5b7N4F": 1,
		"60_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": 1,
		"34_1QBGxPiLVbhA9dt8Yqex2EsZxoWtAhMVix": 1,
		"59_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": 1
	}
}