{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "TODO ESTUDANTE PRECISA VER ISSO!\n",
			"body": "#ANTES DE IR PARA A ESCOLA, ASSISTA ISSO || PARA QUE SERVE A ESCOLA?\n- https://www.youtube.com/watch?v=_PsLRgEYf9E\n\n#Eu Processei o Sistema Escolar \n- https://youtu.be/dqTTojTija8",
			"added": 1542228734
		}
	],
	"topic_vote": {
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"1_1CVs2JWP6SDK4ghEcXG1HA5hwMajUsBRWv": 1,
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": 1
	},
	"next_comment_id": 9,
	"comment": {
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "#Lua Negra 1996 Dublado Online\nLua Negra, baseado no romance Thor, de Wayne Smith, é um terror recheado de suspense com roteiro adaptado para as telas pelo diretor Eric Red. Red foi roteirista de A Morte Pede Carona e Quando Chega a Escuridão, tendo dirigido e escrito Anatomia de Um Assassino e Uma Criança Por Testemunha. O enredo trata de um lobisomem que aterroriza os moradores das florestas do noroeste americano.A advogada Janet (Mariel Hemingway), é uma mãe solteira que fica feliz quando seu irmão, o fotojornalista Ted (Michael Paré), vem para viver com ela e seu filhinho de dez anos Brett (Mason Gamble). Ela ignora que Ted retornou de uma desastrosa expedição ao Nepal. Ele esconde da família ter sido mordido por uma criatura meio humana, que matou sua namorada, e sustenta que ela está na cidade de Seattle enquanto ele foi sozinho para a floresta visitar Janet. Na verdade, agora Ted está sozinho ou pior ainda, acompanhado de sua indesejável sombra. Apenas o pastor alemão da família, Thor, e os espectadores sabem que Ted é, na verdade, o lobisomem responsável pelas violentas mortes que começam a acontecer na floresta do noroeste americano e chamam a atenção da polícia. Isso mesmo depois dele dar uma pista para o sobrinho, sobre o mito da lua cheia nos filmes: “Por experiência própria, isso acontece em qualquer lua”. Cheia, crescente ou minguante, todas as luas são negras.\n\n- http://thevid.net/v/ahtfndw05b6/",
				"added": 1542200704
			},
			{
				"comment_id": 6,
				"body": "#Filme Completo - JESUS Segundo o Evangelho de Lucas\n- https://youtu.be/pH-udHiriUo",
				"added": 1542221524
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 2,
				"body": "> [moor](#comment_2_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): coleção de livros no Intergalactic File Server:http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:channel+id:1Mz1_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH\n> irei atualizar essa coleção.\n\n#Excelente. O problema é manter o arquivo na rede, devido a \"escassez\" de peers.",
				"added": 1542201076
			},
			{
				"comment_id": 5,
				"body": "#Dicionário Bíblico\n- http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:1Mz1_1BP93heBUUt9pJy1hAxKaNCXywNJBkeTmq_item_1+type:book",
				"added": 1542221443
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 3,
				"body": "#Dicionário Bíblico\n- http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:1Mz1_1BP93heBUUt9pJy1hAxKaNCXywNJBkeTmq_item_1+type:book",
				"added": 1542221338
			},
			{
				"comment_id": 4,
				"body": "Sabendo primeiramente isto: que nenhuma profecia da Escritura é de particular interpretação.\nPorque a profecia nunca foi produzida por vontade de homem algum, mas os homens santos de Deus falaram inspirados pelo Espírito Santo.\n\n- 2 Pedro 1:20,21",
				"added": 1542221412
			}
		],
		"1_1CVs2JWP6SDK4ghEcXG1HA5hwMajUsBRWv": [],
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": [
			{
				"comment_id": 8,
				"body": "#The Magicians – Escola de Magia\nQuentin Coldwater é um adolescente do Brooklyn com uma inteligência acima da média, mas o mesmo não pode se dizer sobre suas habilidades sociais. Quando ele é aceito na Academia Brakebills, uma renomada e secreta escola de magia, ele descobre que sua fantasia não irá resolveu todos os seus problemas. Assim, deverá lidar com sua falta de sociabilidade ao longo do caminho, e vai descobrir que aprender magia não é tão animador quanto ele imaginava.\n- http://www.seriesonlinex.com/the-magicians-online/",
				"added": 1542250704
			}
		]
	},
	"comment_vote": {
		"6_1JWzeTyK26d4RAYsyHethugMvfKfQJQSCt": 1,
		"3_1CVs2JWP6SDK4ghEcXG1HA5hwMajUsBRWv": 1,
		"4_1CVs2JWP6SDK4ghEcXG1HA5hwMajUsBRWv": 1,
		"5_1CVs2JWP6SDK4ghEcXG1HA5hwMajUsBRWv": 1,
		"6_1CVs2JWP6SDK4ghEcXG1HA5hwMajUsBRWv": 1,
		"8_1CVs2JWP6SDK4ghEcXG1HA5hwMajUsBRWv": 1
	}
}