{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1526455814_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"1530712796_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1537805203_18CYChXXbhpzpNMTtoDLD5ARMEdddhkSsR": 1
	},
	"next_comment_id": 63,
	"comment": {
		"1_1LxCPvqsa78HDaX15U1PVrZ52MpCvZmLYk": [
			{
				"comment_id": 1,
				"body": "WWW+Usenet is a web based internet forum. Zeronet is something like Fido but without hierarchy and with web technology.",
				"added": 1497932223
			}
		],
		"1_1ACc4pa2pJam33SkSE1zF1seF3LQKWR24v": [
			{
				"comment_id": 2,
				"body": "Just subscribe to same sites on your another computer and they will be synced automatically inside your network.",
				"added": 1505976015
			}
		],
		"7_1GgNo3CmxPd7n2pMSF3uyqf1XHvgtTUqCe": [
			{
				"comment_id": 3,
				"body": "Its a shame. They have standartized binary malware in WWW. The most interesting fact is the W3C is dead because 58.4% support is very rough fake promoted by content sellers. W3C became illegal organization.",
				"added": 1505976945
			}
		],
		"1_1WeDfuFi18uBne938aNwZDwAuKPMDYQxn": [
			{
				"comment_id": 4,
				"body": "I see a lot of left-right-racial bullshit in comments. First of all: these terms like \"left\" and \"right\" are tools developed for manipulation.  Both \"left\" and \"right\" movements exist for one purpose: to don't let people move with own way. Left? Right? Just fuck off! There is only self-defense for any human with brain who understand current situation - not left or right sides. The \"racist\" term is just another tool. As it mentioned in topic message \"anti-racist\" means anti-white. This is just the fact which can be seen by anyone in racial subjects, in so called \"white guilt\" phenomena especially. \n\nThe second fact about racism is the racism does not mean hate against some race. Racism is just acceptance of existence of different races and their difference in capabilities. Races are exist and they are very different - its biological fact. This is not good or bad. Its just the result of a natural adaptation for life in native region: every race has own home place. Any attempts to eliminate racism lead to destruction, war and harm for all races in the world. Anti-racism in initial meaning is against every single race equally. Only racism can keep peace both inside peoples of same race both between different races due to understanding of natural differences. So anyone who says \"i fuckin hate niggers\" or \"white people are plague\" or even \"fuckin stupid asians are insects\" is really anti-racist: such person tries to equalize different humans with violent way.\n\nEvery unnatural construction like \"leftist\" or \"right party\" is just political bullshit. Every destructive things are promoted with political ways today. All political ways are under control. Solution of modern global problems can't be political. The only way is to act outside of politics: organize and participate independent community, make non-government communication networks, maintain connections with people with same ideas, avoid way of thinking forced by political system, create trusted environment (it may be small but reliable), etc. And the most important principle: don't forget own roots - the thing which can unite people honestly. Its for every race - not for whites exclusively.\n\nIn total: fuck rightists, fuck leftist, fuck SWJs, fuck nazis, fuck commies, fuck capitallists, fuck anarchists, fuck every fuckin thing destroying people, support real valuables and be ready to live with honor.",
				"added": 1506592622
			},
			{
				"comment_id": 5,
				"body": "> [realkittykate](#comment_2_17H8EGEoNF1z2AXFtXmBQJLHTmh7gMGzzS): Except, whatever biological differences there may exist between races .. should not be used to justify discriminatory policies.\n\nBiological difference is discrimination by nature. You can't go against nature. Deal with it.\n\n> [realkittykate](#comment_3_17H8EGEoNF1z2AXFtXmBQJLHTmh7gMGzzS): However, racism is still a problem around the world\n\nIts not a problem because racism is not allowed in modern policy. The problem is anti-racism - its harm for all races.",
				"added": 1506594135
			},
			{
				"comment_id": 6,
				"body": "> [planespherev3](#comment_267_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): But your comment will seem alt right for some viewers on Zerotalk. So in defense you will have to qualify them as cultural leftists. Even if that doesn't make sense. \n\nAnyway they also don't understand that designations like \"left\", \"right\", \"alt-right\", etc are just political labels. Its like following rules made by enemy where enemy can't lose. The only correct way is common sense and consideration of reasons and consequences.\n\n> [planespherev3](#comment_268_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): This simple observation of reality will make a certain category of people (to not name them) think you are intolerant.\n\nIn their terms i am intolerant at all. I think it's great because tolerance in modern meaning is just filthy cancer. The problem is the forced behavior pattern of \"tolerance\". There must be common sense instead of \"tolerance\". This \"tolerance\" is the driver of blinding hatred suppressing mind. Usage of natural categories showed by biological information is the common sense: mind and sobriety comes instead of criminal tolerance.",
				"added": 1506598741
			}
		],
		"11_1H5UJ7LneToGqYqJ9fbLnu1Ko2pxTpchof": [
			{
				"comment_id": 7,
				"body": "Because of marketing. Those who promoted such crap as facebook, whatsapp, telegram etc. are just want more money and power and they have some money and power for that. Projects like ZeroNet are not about money and power - their aims are totally opposite.",
				"added": 1506834846
			},
			{
				"comment_id": 8,
				"body": "I mentioned telegram among crap not without reason. Telegram is absolutely same spyware as facebook, discord, whatsapp etc. Telegram has fake encryption and every private conference in telegram is under control - admins can even read logs of private conferences in telegram. There is no privacy and security in telegram.",
				"added": 1506835045
			},
			{
				"comment_id": 9,
				"body": "> [polar](#comment_30_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6): ZeroNet is not good for IM, try these: Tox, Matrix\n\nMatrix is based on WebRTC which is not safe technology by design. Its good for communication with random people due to web based Riot IM. Tox is just half-dead project without competent developers. RetroShare and GNU Ring are way better. RetroShare is ready and complete whereas GNU Ring is very promising and progressive project.",
				"added": 1506835374
			}
		],
		"4_1Ga7vs5ZV73jbTSMR77FuZi8KWt2MnBSvb": [
			{
				"comment_id": 10,
				"body": "The problem are not in muslims. Moreover: african/middle eastern christians have no difference with muslims from the same region at all The problem in those who made this invasion possible. Do you want to stop invasion? Reject non-native things like islam and christianity, and follow real european principles and valuables (pre-christian ones). If there will be enough european people following native culture (again: christianity is just a branch of judaism, as well as islam) then nobody will dare to attack Europe.",
				"added": 1507181585
			}
		],
		"1509495588_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 11,
				"body": "Its impossible. Windows 10 IoT is the way to turn your full featured computer into an arduino-like piece of shit.",
				"added": 1510202646
			}
		],
		"1512447633_1KieR53aUzHPPH7b54QyDN5a8iYdZm4r9o": [
			{
				"comment_id": 12,
				"body": "ZeroNet is much more strong in this way because users usually distribute non-random data.\n\n>Also, I've had a question for a while that someone here may be able to provide some insight on. Why isn't i2p full of criminal activity?\n\nBecause I2P wasn't designed for criminal things. Criminals can use technology but not community (the same thing with ZeroNet). The key part is community. This is why criminals can't live in community-controlable network for a long time. Tor is not such good technology because of random data exchange between nodes.",
				"added": 1512471406
			}
		],
		"1512591309_15FBwNYD2411XkJJ1wDSK2HMFNNNFJhnt3": [
			{
				"comment_id": 13,
				"body": "The only way to keep \"internet\" fair is to drop internet at all. Internet as physical data channel is under control of corporations so we need a new physical network based on open and free as freedom standards strong against network destruction and artificial limitation. There is no need a high bandwidth at first step because modern high bandwidth internet is generally for broadcasting entertainment. Another requirement is cheap and easy-to-deploy network segment and relatively cheap and easy way to interconnect different network segments. At the past FIDONET successfully solved this problem but today principles must be different and mush more simple for usage. Thus, its important to make technology allowinf for network segments and nodes interconnection without any trouble with laws (the question is also technical because nobody can prove illegal networking is nobody can detect it, and in fact it will be legal).",
				"added": 1512631429
			},
			{
				"comment_id": 14,
				"body": "> [styromaniac](#comment_278_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I'm a firm believer that smartphones are the solution. They've already demonstrated the ability to mesh network without an internet connection. Wi-Fi Aware will take this to the next level. [...]\n\n\nSo called \"smartphones\" are tools designed to spy on people. You need a totally libre handheld hardware and OS to make really independent mesh network. You also need suitable power source to maintain such network with high uptime.",
				"added": 1512633579
			}
		],
		"1513048648_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE": [
			{
				"comment_id": 15,
				"body": "Obviously it depends on your place and internet provider. These peers are only ones you see from your current location.",
				"added": 1513058175
			}
		],
		"1514187465_14uGoHUjHsog6Zq2VrbQjqXrzvHLNrM7tu": [
			{
				"comment_id": 16,
				"body": ">AI/neural network\n\n>run in a browser/JS\n\n>WebAssembly\n\nUltraHipsterCombo!\n\nThese totally useless things consume too much hardware performance and they does not correspond to ZeroNet tasks at all.",
				"added": 1514188639
			}
		],
		"1519107162_19pJyuDtmDMaXxWCWB4bHdpna37x1TiNMa": [
			{
				"comment_id": 17,
				"body": "WiFi is too near field comminucation in global scale. You need either fido-like system or something like LoRaWAN but fast enough. It is essential to make communication at least in scale about 10-100km.",
				"added": 1519118535
			}
		],
		"1525166833_1KCJ86Jg3LNBpHxcaRojsHTg9Qme9vuV1j": [
			{
				"comment_id": 18,
				"body": "You can try out emulator like Basilisk to emulate an old mac.",
				"added": 1525198906
			}
		],
		"1526331321_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 19,
				"body": "How much time you was in mental institution?",
				"added": 1526383060
			}
		],
		"1526541150_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 20,
				"body": "According to your posts New Zealand became a Soviet Union of modern days.",
				"added": 1526547444
			}
		],
		"1526764711_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 21,
				"body": "If someone dont understand how to install ZeroNet without a video tutorial then it is not recommended to use ZeroNet for him. Such technologies are harmful without discipline, responsibility and serious approach.",
				"added": 1526794617
			}
		],
		"1526808992_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 22,
				"body": "It reminds me ALICE chatbot. But i guess it was built around different technology.",
				"added": 1526961946
			}
		],
		"1526895582_12uaobyUhg6H9rh88Ryu1x8xrJWBn6PuyK": [
			{
				"comment_id": 23,
				"body": "I don't think ZeroNet can be considered as a deepweb because its a darknet. ZeroNet can't be accessed with usual web browser without additions or proxy.",
				"added": 1526962185
			}
		],
		"1527003512_13mmQytg34syftQYB5eFFMA9ATsGGmjk46": [
			{
				"comment_id": 24,
				"body": "If you want to access an older version of a zite you have to make a lot of backups. When someone dont do some work for you it is not censorship. If you want to do backups automatically on any node side then ZeroNet is not for you. There is no point to store tons of trash just because you want it. If you want backups just for your needs without  distribution - configure incremental backup system using CRON.",
				"added": 1527047763
			},
			{
				"comment_id": 25,
				"body": "> [vychlop](#comment_1_13mmQytg34syftQYB5eFFMA9ATsGGmjk46): I get that the owner has control over what appears under a certain identifier. [...]\n\nWhat zite owner doing with his zite is not your concern. The greatest idea keeping ZeroNet alive is transferring censorship rights from corporations and governments to every user. You've got rights to copy everything published for everyone but you have rights to control only your zites naturally.",
				"added": 1527048428
			},
			{
				"comment_id": 26,
				"body": "> [thunder33345](#comment_91_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): There's a difference, here we keep a LOG CHANGES, for example data deleted, data added, data edited, site html edited etc,\nsince now we have a log of changes, we can easily REVERT to when the log of changes is made,\nusing cronjob kinda works but like you said it create tons of unnecessary data, we dont need to know if a file was there untouched for years, we only care when it's touched\nand i agree, user shouldnt be FORCED to make backup/log of history, for whatever or no reason, say lack of disk space, just like how uploading/seeding is done by merit not by force or economical incentive\n\nThere are a lot of backup and version control systems already. The only thng ZeroNet need is a backup zites function with timestamp and checksum.\n\n> [thunder33345](#comment_91_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): then what's bad about the collective users also have a say in reverting owners change, isnt that more power to user?\nYes you will never get control of the owner's zite, but you have control to fork off owner site into a zite you have control, and pulling people who are against whatever owner's action together,\nsay a minority group getting harassed/banned by OWNERS of twitter wrongly, wouldnt the ability to fork everything including user data to another site of your own with 0 technical and coding skills, while rallying people who are banned to join that site?\n\nThere is no problem to use own zites and public resources in ZeroNet. This is not technical problem. As far as i know current backup features of ZeroNet provide technical solution to help to overcome the problem of harassemnt minority groups.\n\n> [vychlop](#comment_4_13mmQytg34syftQYB5eFFMA9ATsGGmjk46): If you want censorship-resistance, I believe it is our concern what other people's zites do.\n\nIt smells fascism.\n\nIf someone really wants totally censorship-free area he will make own zite.> [vychlop](#comment_4_13mmQytg34syftQYB5eFFMA9ATsGGmjk46): Resisting censorship is certainly mostly about keeping information from elsewhere intact. If someone destroys or maliciously alters the statements by or censors half the users on this forum, it won't really do to say \"oh well, it was just their zite\". \n\nThis is not a censorship resistance. If someone published information then decided to delete in own zite its ok.If someone decided to censor own forum and you dont like that then make other forum or go to forum without censorship. This is how healthly society works.",
				"added": 1527152321
			}
		],
		"1527501494_12DQUy71SGVzno27xgX5w3jBP9iyyv5XTc": [
			{
				"comment_id": 27,
				"body": "If you'l broadcast yourself over webcam many people will able to see you.",
				"added": 1527571512
			}
		],
		"1527416420_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 28,
				"body": "Personally i would prefer to censor MLP content ;-P\n\nAnyway there is no reason to censor any anime. Of course if you don't mean hentai or something like that.",
				"added": 1527571901
			}
		],
		"1527351127_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL": [
			{
				"comment_id": 29,
				"body": "The only efficient way to ban child porn is to punish the makers IRL. Its essential to destroy the root of the problem. In ZeroNet you can block zites and users personally for you. It will cut down at least a part of possibilities of distribution.",
				"added": 1527572283
			},
			{
				"comment_id": 30,
				"body": "> [vanadium](#comment_2_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL): However this assumes that the makers are the root of the problem. I've been following CoinCloudGuys path these past few days and I'm quite unsure whether or not the makers of child porn are the root, now. Because while child abuse(like in hurting them) cannot be tolerated and must be destroyed, I (in theory!) can certainly imagine ways of making child porn that would not do any harm to the child. Neither physical or psychological.\n\nThe problem of child porn is the harm to children. So physical part is well explained. But psychological part is very complicated. The nearest example are persons who like animals. Where you can draw a border between it and zoophilia only using psychological criteria? Another example is anime: some politicians and mass media promote anime as a sort of child porn. Even if an anime charatcter looks like a child in your opinion can you state that everyone consider such character as a child (even very similar to RL one)? Psychological features are very personal.\n\n> [vanadium](#comment_2_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL): But wouldn't that solve nothing, since (kind of by design of zeronet) the people seeding a zite will be those, who use it. Therefore and since the distribution between pedophiles is the main focus anyways, not the distribution between pedophiles and normal people(after having spend some time researching pedophilia and pedophiles this kind of sounds really insulting, now), that wouldn't really accomplish anything, I think.\n\nZeroNet is technology providing a natural way to organize community based network. So the question of censorship must not be solved by centralized way and will. Every user can contribute own effort to make ZeroNet better. Thus healthly self-moderated community is the key to the solution of the problem. The only thing will remain is to catch pedophiles IRL. According to principles of ZeroNet technology nobody have rights to ban any content in whole ZeroNet by own decision, even if it is somethig illegal. \n\nIf you want to violate ZeroNet principles (and totally destroy it) then you want to nuke whole Earth because there live a lot of evil (besides, good and evil is absolutely personal question).",
				"added": 1527655149
			},
			{
				"comment_id": 31,
				"body": "> [vanadium](#comment_4_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL): I'm confused. Do you mean the psychological effect on the child or the psychology in perceiving what constitutes as a child? \n\nI mean psychological determination of pedophile and reasons of such deviant behavior. This is the most important subject for today because radical pedophilophobia is dangerous phenomenon for people just like another witch hunt. Psychological effect on the child is complicated question too but generally it comes from physical effect (and probably from observation of a physical effect). Moreover: there are a lot of adults with infantilism and some childs with adult world view.\n\n> [vanadium](#comment_4_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL): Do you mean catch those who attack children or in general?\n\nI mean arresting criminals and preventing crimes.\n\n> [vanadium](#comment_4_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL): What problem does it solve exactly? Wouldn't that just force the pedophile community and the normal community further apart? Since like pineapples said, there is no way to remove/censor childporn from zeronet:\n\nZeroNet is just technology - not a network. Social problems should be solved not with technology in general. If pedophile community will stay away from the normal one then it will be much more easy to identify and catch them. Also distribution of a child porn will not use resources of normal community.\n\n> [vanadium](#comment_4_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL): As far as I know pedophilia is kind of like a gentic(?) thing that you're born with, I've seen estimates that the percentage of pedophiles inside any given population range from 0.04% all the way up to around 25%. Assuming that applies to the worldpopulation, that would, on the low estimate, mean catching 2.8 million people and somehow deal with them(or god forbid, dispose of them). On top of that you would need to deal with 0.004 times whatever the global birth rate is of people, since pedophilia seems to something you're born with.\n\nGenetics is a speculation-rich field. There must be more reliable ways. Anyway strong and healthly community is the solution.",
				"added": 1527760707
			},
			{
				"comment_id": 32,
				"body": "> [thunder33345](#comment_105_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): How will it be made is the question, most people worries about centralization of trust in said blocklist provider\n\nA trusted blocklist without mandatory usage signed by authors is a good thing. But its a good thing for an active and small community where everyone trust each other.\n\n> [xinyi](#comment_3_15kHQPHwsB18wZyPVftd49ZBdncgdTmA4f): We should host blocklists on ZeroNet websites.\n\nIts easy to abuse. I guess an updateable text file for manual download and installation is enough.",
				"added": 1527827746
			}
		],
		"1528100956_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 33,
				"body": "MOBA is the future of AI (Artificial Idiocy) research. There are much better applications for AI (Artificial Intelligence) investigations. I recommend to read about maps testing for The Talos Principle.",
				"added": 1528108328
			},
			{
				"comment_id": 35,
				"body": "MOBA is very specific thing for AI research. The only result can be obtained from that is a bot for MOBA. I doubt in possibility to get from MOBA something fundamental and useful for AI in general. Data quantity is not a data quality.",
				"added": 1528177072
			}
		],
		"1528154309_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 34,
				"body": "In order to pass Turing test you have to implement some basic things: https://steamcommunity.com/sharedfiles/filedetails/?id=135138641",
				"added": 1528171933
			}
		],
		"1528080237_1PMuHrGm4GFBBNbvRgr8zvyyRTc3rHpGYz": [
			{
				"comment_id": 36,
				"body": "The best tactics is: one task - one small and reliable tool. Fake modular solution is cancer. ZeroNet is a great next-gen web technology without unnecessary features and capabilities. What doesn't let you to use IPFS and ZeroNet without special support from the last one?",
				"added": 1528179003
			}
		],
		"1528175266_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 37,
				"body": "In total: these psychiatrists are incompetent at all. They can't even determine correct diagnosis.\n\n>lack empathy toward employers, teachers, etc.\n>lack respect for authority.\n\nIs it bad to be a free human being?\n\n>obsessive behaviors.\n>display obsessive interests.\n\nIt does not sound as something abnormal.\n\n>almost no social skills ( probably why I never had a relationship )......\n\nTypical unwilingness a useless communication with random and mostly useless people. If by social skills they mean \"OBEY! DO NOT QUESTION AUTHORITY! KEEP CALM! CONFORM! CONSUME! WATCH TV!\" then i've got a bad news for them.\n\n>My hospitalization and hallucinations were the result of sleep deprivation, agitation.\n\nHigh fatigue due to non-natural environment and life rhythm.\n\nI think your psychiatrists are just mentally ill. Haloperidol therapy with clyster may help them.",
				"added": 1528179017
			}
		],
		"1528205347_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 38,
				"body": "Gitcenter is great but git hosting on clearnet is also essential today. Gitlab and Gogs/Gitea are good solutions for that. Sometimes even self-hosted solutions are not enough, so usage a service which is not github and sourceforge woud be good too.",
				"added": 1528257954
			},
			{
				"comment_id": 41,
				"body": "> [thunder33345](#comment_126_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): but it seems as if most people moved \"because microsoft\"\n\nBecause microsoft has well deserved reputation of a great ruiner and scammer since 90s.",
				"added": 1528455733
			}
		],
		"1528171357_1rFttYwcvZTeYwTHDHC5iy5PsfwHhaHCi": [
			{
				"comment_id": 39,
				"body": "The more transports supported the more universal ZeroNet will become.",
				"added": 1528263383
			}
		],
		"1528352699_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 40,
				"body": ">insomnia.. along with my stress, depression and anxiety..\n\nDo you really think you can overcome there things with chemical treatment? You dont know so much about human organism...  I think you will only do harm to yourself with this \"something\". You have to recover your organism - not to place it on crutches.\n\n>a few, final months of freedom\n\n80 lvl naivety\n\n>God\n>sacrificing\n>cursed\n>language of the Universe\n>Wrath of God\n>Jesus\n\nIt seems i've found where is your problem ;-)",
				"added": 1528361549
			}
		],
		"1528729710_1KhyYzD37jfRrvr5p5biqc3ccjfQeiafEP": [
			{
				"comment_id": 42,
				"body": "It seems you have to remove Mac OS and install a normal OS.",
				"added": 1528877162
			}
		],
		"1529282108_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 43,
				"body": "If you want to get rid of insomnia you must know what the sleep is. A little hint: your insomnia may cause a lucid dream.",
				"added": 1529294486
			}
		],
		"1529245481_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 44,
				"body": "There is no need in electron microscopy to diagnose such parasites. An ordinary optical microscope is enough. You need an electron microscope to see viruses - not a living creature. Articles you referred here are just about incompetence of MDs. Moreover: a lot of parasites attack human body every single moment. Immunity defend humans from them.",
				"added": 1529313120
			}
		],
		"1529063467_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 45,
				"body": "Are you fear to don't be a consumer of easy virtue (aka consumwhore)? What an ill modern society... Besides, services like Tinder were made not for normal dating and being not alone - it's another place for satisfaction the lowest natural needs.\n\nMany human beings just follow an order wrongly called traditions. They think they will get happiness. For this fake goal they are going into credit slavery, finding a random mate asap, wasting money for useless crap and following an order they can't understand. At the end of life they dont achieve their goal and die alone even without understanding that whole life was wasted for nothing. Do you want such life? If you don't you don't need to worry about fashion and majority.",
				"added": 1529314808
			}
		],
		"1530089348_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 46,
				"body": "Everyone initially has natural right to maintain own privacy initially. Children is not an exception. A children is an adult in future. An adult is a children in past.",
				"added": 1530160005
			},
			{
				"comment_id": 47,
				"body": "> [quantumkitty](#comment_157_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): spending too much time online pretty much ruined my adult social skills...\n\nLOL!!!!!\nMost of people spend most of their life online. Facebook, MMO games, discord, twitter, dating services, etc. Do you consider them as a people with social skill? ;)",
				"added": 1530160294
			}
		],
		"1534897557_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 48,
				"body": "Just call it \"404\".",
				"added": 1535017666
			}
		],
		"1534470841_1Kh3qLdTH2QKewUb6cWZa2dMveMT5EcVer": [
			{
				"comment_id": 49,
				"body": ">Why Zeronet will succeed ...\n\nBecause it works.",
				"added": 1535022334
			},
			{
				"comment_id": 50,
				"body": "> [bitcoingeek](#comment_7_12H7WVVjVfiug4YJ3zcMnTzbbKSWf8Uk7g): can we have nitemode gui for zero talk? That would make it better\n\nAMD PSP and Intel ME. A moron and pseudo-scientist Andrew Tanenbaum helped to develop modern version of Intel ME. AMD PSP is just an implementation of ARM TrustZone. With proprietary firmware it looks more like backdoor.",
				"added": 1536563970
			}
		],
		"1537592624_1CthCNo2eADyWkShCTBTVKGHy3WNXcj6Fh": [
			{
				"comment_id": 51,
				"body": "There are two ways to save Linux:\n\n1. Beat up SJWs IRL.\n2. Fork Linux.",
				"added": 1537629831
			},
			{
				"comment_id": 52,
				"body": "> [styromaniac](#comment_110_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I'm all for the first. [...]\n\nHowever, fork is the best way in long run.\nAnyway one thing does not exclude the other. ;)",
				"added": 1537632931
			},
			{
				"comment_id": 53,
				"body": "> [jlxip](#comment_120_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C): Why is this shit even happening?\n\nBecause someone want to make Linux and core FLOSS projects less independent. SJW is just a tool. I am sure - those so called feminists and transgenders who force CoCs and witch hunt are not feminists and transgenders at all. They are not interested in minorities support and protection.\n\n> [jlxip](#comment_120_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C): I fucking hate the world. I fucking hate that people get offended and that they start crying out loud.\n\nThe most important fact is these loud SJWs were not offended.",
				"added": 1537648867
			},
			{
				"comment_id": 54,
				"body": "> [skwerlman](#comment_82_1JupR9ExhM4aiVd1Jyy2iuS12eukDnQ54X): i don't get how \"please be nice on the mailing list\" is being translated to \"the downfall of linux at the hands of the SJWs\" for yall. if anything, making the mailing list less toxic will improve the state of linux since there'll be more people who're willing to contribute.\n\nBecause it's not \"be nice\". The new CoC is also about \"You must behave as we said even outside the project. Even in totally private space.\". So pretty much fuck those who support that CoC.\n\n> [skwerlman](#comment_82_1JupR9ExhM4aiVd1Jyy2iuS12eukDnQ54X): the previous standard for code reviews (personal attacks and swearing with some technical insight mixed in) was simply not productive, and the previous code of conflict was literally never enforced. i really have trouble understanding how this is anything but a positive change\n\nIt's a lie. Linus Torvalds didn't attack anyone. He used strong language only as a last resort. In LKML he was very nice in general. As for now Sarah Fart tried to attack Theodore T'so using the CoC. She did not anything good for Linux and community at all. Moreover: there is no wonder why her USB 3.0 implementation was so terrible and harmful both for Linux project and community - she is just another stupid arduino codemonkey.",
				"added": 1537857107
			},
			{
				"comment_id": 55,
				"body": "> [kaffie](#comment_690_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Honestly I'd love to see Linux devs pull a kill switch and have Linux and things that use Linux come crashing down and crumbling. [...]\n\nIt's not a problem of GPL. If someone opened a source code under terms of GNU GPL, this code can't be closed again.",
				"added": 1537857644
			},
			{
				"comment_id": 57,
				"body": "> [stretchs243a](#comment_14_1BTTUVH4J6ehmGUeK7XgkJ7mShAEx4hVL): Why can't they fork it if they don't like the CoC though????\n\nWhy should they fork their own project due to SJW-nazis? Is it justice?",
				"added": 1537858050
			},
			{
				"comment_id": 58,
				"body": "> [stretchs243a](#comment_15_1BTTUVH4J6ehmGUeK7XgkJ7mShAEx4hVL): It seems that it would be more productive then bringing all of linux down.\n\nIt is more useful to try to remove CoC from initial project before fork. If nothing will work there will surely be a fork.",
				"added": 1537859592
			},
			{
				"comment_id": 59,
				"body": "First technical consequences of Linux CoC: https://lkml.org/lkml/2018/9/26/155\n\nSomeone is trying to integrate a backdoor into random nubmer generator. Besides, Theodore T'so is the one who made /dev/random and patched bugs and vulnerabilities, and Sarah Fart attacked him recently.",
				"added": 1538031840
			}
		],
		"1537805203_18CYChXXbhpzpNMTtoDLD5ARMEdddhkSsR": [
			{
				"comment_id": 56,
				"body": "The best CoC is the Sgt Hartman's speech from Full Metal Jacket.",
				"added": 1537857855
			}
		],
		"1541600740_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 60,
				"body": "If non-anonymity is the only reason to stick the moral then the person has no moral at all.",
				"added": 1542344844
			}
		],
		"1547295582_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": [
			{
				"comment_id": 61,
				"body": "> [deliriumgoddesss](#comment_12_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ): its safe p2p messanger in realtime\n\nTelegram is spyware itself - it has no encryption at all. So called end-to-end encryption in telegram is fake because all keys are coming to telegram servers right at the stage of generation. And, of course, telegram is centralized messenger.",
				"added": 1547637705
			},
			{
				"comment_id": 62,
				"body": "> [deliriumgoddesss](#comment_15_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ): i thought messages not going through servers, but going stright to users....\n\nIf messages have no proper encryption it does not matter how they going. Moreover: telegram have full access to private groupchats.",
				"added": 1549356052
			}
		]
	},
	"comment_vote": {
		"43_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"3_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": 1,
		"4_1DpN91N84piuzYn2iJKM9RK3Ek8JVNjewa": 1,
		"91_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"92_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"6_1DF8dFxXTxMjyZ9o96iPENud3ihbS95Jwb": 1,
		"234_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"3_1KBAjH3997VWYR8T215JrzfPit9MRcbWf1": 1,
		"25_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"111_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"123_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"205_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1
	}
}