{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Как тут zайт запилить?",
			"body": "Что то не могу разобраться. подскажите.",
			"added": 1520680952
		}
	],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 1,
				"body": "+1",
				"added": 1520678030
			}
		],
		"1_1Lr8RdHxBpY8EWZ6rwD8CvVAaMkg2yGtXf": [
			{
				"comment_id": 2,
				"body": "Debian, Mint, Ubuntu",
				"added": 1520681016
			}
		],
		"1_1KFqej3sgCjw62yRAqgdaGUzmTAuSDmbW2": [
			{
				"comment_id": 3,
				"body": "Всем спасибо, разобрался)!",
				"added": 1520695504
			},
			{
				"comment_id": 4,
				"body": "отдельное спасибо этому блогу: http://127.0.0.1:43110/1EA78W4sAgrJxVVcNR9UFF2CBiiWFfPcQQ/ все коротко и понятно.",
				"added": 1520752027
			},
			{
				"comment_id": 6,
				"body": "ну с размещением Зайта и самими зайтами вроде разобрался. а вот с регистрацией домена .bit все както сильно муторно.  может есть какой мануал на понятном языке а еще лучше на понятном русском.",
				"added": 1520925831
			}
		],
		"5_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 5,
				"body": "на MESH сети переходить надо, вот реальная альтернатива. не запретить, не контролировать, не отключить!",
				"added": 1520872961
			},
			{
				"comment_id": 7,
				"body": "> [caryoscelus](#comment_20_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Вообще-то публичные mesh-сети во многих странах запрещены (их можно подвести под соответствующие законы). Контролировать сложнее, но зачастую достаточно показательных посадок, если вдруг это дело пойдёт в народ.\n\n не могу не согласится, ну пока других рабочих решений не вижу( mesh конечно не панацея...",
				"added": 1520925997
			},
			{
				"comment_id": 8,
				"body": "> [sgushennayavoda](#comment_8_1LUMCFAnp4YvKKufrot9Weq15gDvRrQUCu): Кроме того, мешы подразумевают открытые вай-фай споты, причем чтобы они \"выходили\" за пределы квартиры. Это напрямую нарушает закон. Почти любой вай-фай роутер нарушает этот закон прямо сейчас. Просто сейчас все понимают что так это работает и всем наплевать, но если будут именно меши - начнут сажать. Никакие законы даже менять не надо.\n\nчто это за закон, наказывающий за wifi? покрайней мере в РФ и снг вайфайная частота является открытой и гражданской, мосты на вафле и тд допускаются без всяких доп разрешений. хотспоты тоже \"пока\" можно создавать без лецензии и гемороя. Есть некие ограничения на мощность сигнала, но это точно не про бытовые роутеры и имеющееся на рынке антенны.",
				"added": 1520964624
			}
		]
	},
	"comment_vote": {}
}