{
	"next_post_id": 54,
	"next_comment_id": 23,
	"next_follow_id": 9,
	"avatar": "png",
	"user_name": "Kiànkok Kàutiâu",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"intro": "10011",
	"post": [
		{
			"post_id": 1,
			"date_added": 1520347038,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1520347730,
			"body": "Chhengliân_To̍kphài_228_Hêngtōng_Sengbêng\n\n青年獨派228行動聲明\n\nKūnî nîbóe, chipchèngtóng thongkòe \" Chhiokchìn Chóanhêng-Chènggī Tiâulē\", tôngsî bînkan mā tı̍ttı̍t tánthāi tongkio̍k khah kín chìnhêng \" Chhengtû uikôan siōngteng, póchûn putgī ûichí\" ê chèngtī kangthêng.\n去年年底，執政黨通過「促進轉型正義條例」，民間無不期盼當局能儘速展開「清除威權象徵、保存不義遺址」的政治工程。\n\nTong ta̍kê lóng teh koansim tóngsán, oátòa-cho͘chit kah tóngàn-kongkhai téngténg gītê ê sî, Thôhn̂g lióngChióng thênglêng ê só͘chāi soah bô lâng khì chùì--tio̍h. Chipchèng tongkio̍k kèsio̍k hō͘ kah bînchú siāhōe ôanchôan bēha̍h ê \" Tèông-lêngchhím\" tī hia, uikoân ê bônghûn mā tio̍h kèsio̍k tī Tâiôan m̄bat lîkhui.\n當各界都把焦點放在黨產、附隨組織與檔案公開等等議題時，桃園的兩蔣停靈處卻沒有得到應有的關注，執政當局消極放任與自由民主社會格格不入的「帝王陵寢」，讓獨裁者的幽靈，繼續在自由民主的台灣遊蕩。\n\nTī Thôhn̂g-chhī koankong ê ia̍hbīn téngkoân, ū chı̍t toāⁿ iúkoan Chûô͘ ê biâusu̍t: \" Sèkài Koktē Biánhôai Chı̍ttāi Úijîn ê Sèngtē\". Thôhn̂g chhītiúⁿ Tēⁿ, Bûn-Chhàn mā bat tī hôeèng LióngChióng Ôankhu ê gītê sî kóng kòe: \" Chóanhêng-chènggī m̄sī kanna beh tû Chióng niâ\", gún beh thêchhéⁿ Tēⁿ chhītiúⁿ, tûChióng tongjiân kanna sī choánhêng-chènggī ê chı̍t pō͘hūn, m̄koh nā chham che lóng bô beh chò, tı̍ttı̍t leh thoaiân \" Uikoân Tēkéng Chhenglí\", ánne kengka bô khóléng ta̍tkàu chóanhêng-chènggī.\n在桃園市的觀光導覽頁面上，對於「慈湖陵寢」，有這麼一段怵目驚心的描述：「世界各地謁陵緬懷一代偉人的聖地」。而桃園市長鄭文燦曾經在回應兩蔣園區議題時說「轉型正義不該窄化為去蔣」，我們要提醒鄭市長，去蔣化固然只是轉型正義的一個環節，但是，不去蔣並繼續拖延「威權地景清理」（landscape cleansing），轉型正義就不可能達陣。\n\n＊\n\nTī kokkài kìliām Tâiôan jînbîn siūlān ê kia̋jı̍t, chı̍t tīn koansim konggī, chútiuⁿ sı̍thiān choánhêng-chènggī ê chhengliân, chiong tāipiáu siūlānchiá chheⁿhoeh ê ângchhat, phoah tī to̍kchhâichiá thênglêng ê lêngkiū.\n在各界紀念台灣人民苦難的今天，一群關切公義，主張落實轉型正義的青年，將象徵受難者鮮血的紅漆，潑灑在獨裁者停靈的棺柩。\nLán_ê_sò͘kiû\n\n我們的訴求：\n\nIt, thiatté chhengtû uikoân ûichí, mài koh iōng kokka chugoân lâi chhāi to̍kchhâichiá.\n一、徹底清除威權遺緒，停止以台灣資源供奉獨裁者。\n\nLán ho͘io̍k chipchèng-tongkio̍k, nā beh kèsio̍k í Tâioân-chugoân lâi chhāi lióngChióng, tùi to̍kchhâichiá ê phakpài nā bô thêng, bô khólêng sı̍thiān choánhêng-chènggī. Chitmá chipchèngchiá chı̍thongbīn thêchhéⁿ jînbîn uikoân le̍ksú ê po̍kle̍k kah khióngpò͘, chı̍thongbīn soah pàng chútō tô͘sat ê goânhiong i thênglêng ê só͘chāi í kah tèông pêⁿkâng ê kuibô͘ lâi chûnchāi, che sī tùi choánhêng-chènggī siōngtōa ê gō͘kái kah bújio̍k.\n我們要呼籲執政當局，只要繼續以台灣資源供奉兩蔣停靈，只要對獨裁者的膜拜沒有消失，轉型正義就不可能真正到來。執政者一邊提醒人民，威權獨裁的暴力歷史不能重演，一邊坐視屠殺元兇的停靈處，以帝王的陵寢規格存在，是對轉型正義最大的嘲諷。\n\nJī, hùitû LióngChióng Bûnhòa Oânkhu, uikoân ûichí m̄sī koankong chugoân.\n二、廢除兩蔣文化園區，威權遺緒不是觀光資源。\n\n\"Chhiokchoán Tiâulē\" thongkòe íāu, Thôhn̂g-chhī sengbêng í \" le̍ksú bûnhòa kah koankong kèta̍t\" ê líiû beh lâi póliû LióngChión Bûnhóa Oânkhu. Lán beh tī chia sīmtiōng hiòng Thôhn̂g-Chhīchènghú piáubêng, uikoân ûichí bētàng sī koankong \"kèta̍t\", chôngpài to̍kchhâichiá kengka bēēng--ê sī chı̍t ê chūiû bînchú kokka èngkai póchûn ê \" le̍ksú bûnhòa\".\n「促轉條例」通過後，桃園市府聲明，將「基於歷史文化、觀光價值」保留兩蔣文化園區，我們要嚴正向桃園市政府表明，威權遺緒不能是觀光「價值」，崇拜獨裁者，更不是自由民主國家應該保存的「歷史文化」。\n\n＊\n\nLán sò͘kiû chipchèng-tongkio̍k, iōng kohkhah chekke̍k ê hongsek chhúlí lióngChióng thênglêng ê uikoân tēkéng chhenglí. LióngChióng ê koankiū bô èngkai í kah tèông pêⁿkâng ê kuibô͘ tī Tâiôan chûnchāi, Thôhn̂g Chûô͘ kengka bô èngkai choantô͘ lâi chhāi lióngChióng. To̍kchhâichiá ê khiāsiōng èngtong ài hőng siauhúi, m̄sī khǹg tī lióngChióng \"Bûnhòa Oânkhu\".\n我們訴求執政當局，以更積極的方式處理兩蔣停靈的威權地景清理，兩蔣棺柩不應該以帝王陵寢規格存在於台灣，桃園「慈湖」更不應該專奉兩蔣，而獨裁者的銅像只能被銷毀，不應該安棲在兩蔣「文化園區」。\n\nChúnnā chóngthónghú, kokhôngpō͘ kah Thôhn̂g-chhīchènghú koh kèsio̍k hō͘siong thuisiá chekjīm, kèsio̍k siámphiah lióngChióng thênglêng ê choánhêng-chènggī ê būntê, ánne kia̋jı̍t ê hêngtōng kanna sī khaisí niâ, kakchhéⁿ ê jînbîn ittēng ē kèsio̍k iōng sı̍tchè ê hêngtōng piáuta̍t tùi uikoân ûichí ê putboán, \" phòhōai sèngchhiāng\" ê hêngtōng ē ittı̍t kèsio̍k loh--khì.\n如果總統府、國防部與桃園市政府繼續互相推託逃避責任，繼續漠視兩蔣停靈的轉型正義問題，今天的行動只是開端，覺醒的人民，以實際的行動表達對一切威權遺緒的憤怒，「破壞聖像」的行動，不會停止。\n\nChóanhêng-chènggī sò͘kiû ê hôkái, m̄sī hiòng hoántōng pósiú ê sèle̍k thòhia̍p, mā m̄sī ūitio̍h \" bô beh chōsêng tùilı̍p\" lâi chhìnchhái \" ûichhî hiānchōng\". Chinchiàⁿ ê hôkái, sī hiòng bīlâi āuchı̍ttāi úntùn chı̍t ê bē koh ū ūikoân hōthâu, mā bô suiàu phakpài iahsī bíanhôai to chı̍t ê to̍kchhâichiá kah úijîn, chı̍t ê chinchiàⁿ chūiû, bînchú, sin jî to̍klı̍p ê kokka.\n轉型正義所訴求的和解，並不是向反動保守的勢力妥協，並不是為了「不造成對立」而便宜地「維持現狀」。真正的和解，是向未來的下一代人承諾一個再也不會有威權符碼，再也不會有獨裁者崇拜，不需要「緬懷一代偉人」，自由民主獨立的新國度。\n\nFETN - 蠻番島嶼社\n公投護台灣聯盟-《自由台灣黨》\n獨臺新社 Taiwan Independence Reformation Association\n自由台灣黨 Free Taiwan Party",
			"date_added": 1520347728
		},
		{
			"post_id": 1520362622,
			"body": "[FB]國民黨砸公投盟影片（幫高調\n\n這群海飄垃圾竊佔台灣還可以那麼囂張 \n\n幹他爸的坦白說我的覺得對臭頭仔 沒鞭屍都很溫和啦 \n\n我就等著看這次的保釋金是多少 \n\n幹你支那 支那民國滾出台灣 影片臉書連結（好不想放） https://www.facebook.com/ROC.Blue.Power/videos/1642435832519861/ \n\n這是他們自己拍的影片備份 https://youtu.be/xKgA3qhH3po",
			"date_added": 1520362619
		},
		{
			"post_id": 1520365330,
			"body": "一般人認知的轉型正義是民主國家對過去獨裁政府實施的違法和不正義行為的彌補 還原歷史真相 為受害者平反名譽 破除對威權的崇拜 這些人認知的轉型正義 是把政治理念不合的人都殺光\n\nhttps://twitter.com/fuckfuckcat/status/971010983811403776\n\n世界上也有這種平均年齡大於45歲的「年輕人」，國民黨的確是滿幽默的一個團體。 感謝國民黨提醒台灣人二二八事件時是怎麼被對待，只是現在沒辦法隨便開槍屠殺台灣人，應該讓這群滯台中國人很失落吧。\n\nhttps://twitter.com/astmarcochu/status/971090429532778496\n\n",
			"date_added": 1520365326,
			"meta": "{\"img\":\"900,658,caadbbeccecddddeeefffd36d47d25d57cccd14,01123444567887956666988794444597A794B445CCCCC4456656665444456666655555\"}"
		},
		{
			"post_id": 1520706214,
			"body": "肯定有人會覺得我們這些「獨派」，整天在講政治、講文化、講歷史、講中華民國如何殖民台灣，這類的問題，很無聊、很煩人，甚至「很吵」。至於，為什麼會有這種兩極化的差異呢？那是因為我們這些獨派，對於台灣文化台灣這塊土地的歷史遭遇與破碎的現狀，有痛感、有共感，所以，我們每天大聲疾呼，要台灣人一起挺身而出來反抗中華民國，建立台灣這個國家。而你們這些把自己當局外者的人，絲毫無感，還自以爲站在高處嘲笑我們，這就是中華民國統治下台灣社會的愚蠢現況。\n\n試想，你的房子你的車子你的家人，受到侵佔、剝奪、破壞、殺害，你會怎麼樣？你會怎麼做？這時候你還會覺得找出真相、究責、制裁，很無聊嗎？肯定會跳出來捍衛自身權益，這種由然而生的感受，就是痛感、共感，差別只在於層次上的不同。\n\n仍然感受不到台灣人台灣文化台灣土地，所受的荼毒嗎？那你就是選擇當一個自私自利的人，台灣將永遠跟著你們這些人沉淪。\n\n#支持台獨支持改變\n#不改變不思考就是拖垮台灣\n\n[https://www.facebook.com/iloveiena/posts/10213926590032434](https://www.facebook.com/iloveiena/posts/10213926590032434)",
			"date_added": 1520706208
		},
		{
			"post_id": 1520712722,
			"body": "Chit-chām-ah, ZeroNet koh chìn-pō͘ ah, chin chèng sī kiaⁿ--lâng, m̄-nā sī chhut-thâu ū chōe, ūn-chok mā sī lú lâi lú ún-tēng.\n\nKî-si̍t tī Darknet ê sè-kài, ZeroNet sī kán-tan hó o̍h, beh siá bûn-chiuⁿ liû chu-liāu ia̍h-sī iōng ka-kī ê bāng-chām, chit-má lóng chin hó-sè.\n\nLiû chu-liāu che pō͘-hūn, góa jīn-ûi siōng tiōng-iàu. Che kúi kang Facebook tāi-liōng sím-cha bāng-iú ê chu-liāu, i khoàⁿ bē sóng ê mi̍h-kiāⁿ, hōa thâi to̍h thâi, kin-pún bô kóng lí, kah thó͘-húi chèng-hú bô chha-pia̍t, jî-chhiáⁿ chu-liāu lóng tī i ê chú-ki, i lóng ē-sái o͘-pe̍h chhòng.\n\nZeroNet siōng tōa ê hó-chhù tō sī bô chú-ki ê kài-liām, ka-kī ê chu-liāu ka-kī hoa̍t-lo̍h, ka-su pa̍t-lâng ū liân-soàⁿ lâi lí ê tiān-náu, chu-liāu to̍h ē hō͘-siong copy, án-ni to̍h beh hō͘ lâng o͘-pe̍h-lâi, kán-tan kóng sī án-ni, kî-thaⁿ ū êng kah koh lâi siá.",
			"date_added": 1520712715
		},
		{
			"post_id": 1520762091,
			"body": "Chit-má lóng tiâu-chéng hó-sè ah, ē-sái tī Facebook gōa-kháu lâi hoa̍t bûn. Bûn-chiuⁿ mā ē khǹg tī Darknet, khoàⁿ lí Facebook gōa-gâu thâi.\n\nKî-si̍t pí Facebook hó ê mi̍h-kiāⁿ chin chōe, chò-lâng m̄-bián chia kan-khó͘, lán lóng ū soán-te̍k, bô su-iàu khoàⁿ pa̍t-lâng ê ba̍k-sek, Tâi-oân-lâng ài ū ka-kī ê kut-khì, án-ni kî-thaⁿ lâng ia̍h-sī pa̍t-ê kok-ka to̍h ē piáu-sī chun-kèng, nā-sī lóng beh kut-thâu nńg, khì tó-ūi kāng-khoán mā sī ē hō͘ lâng khi-hū.\n\nChhiūⁿ chi̍t leh Tâi-oân-lâng khiā-khí-lâi, hō͘ thó͘-húi chèng-hú chhiúⁿ khì ê mi̍h-kiāⁿ, choân-pō͘ lóng ài the̍h tńg--lâi!",
			"date_added": 1520762083
		},
		{
			"post_id": 1520767711,
			"body": "February 28, 2018, on the day when Taiwanese people were memorizing the victims of the 228 Massacre committed by the Chinese Nationalist occupant 71 years ago, several student advocates head to Chiang Kai-shek’s tomb secured by the military where his body is preserved for viewing as Lenin's at Red Square. Red paint was splashed by the activists on to the tomb, intending to send their announcement to the government and the public. The student activists urge the authoritarian legacies to be eliminated thoroughly, that resources of this democratic shouldn’t be used to feed and worship the dictator; furthermore, the resort run for Chiang Kai-shek’s tomb as a tourists site should also be closed.\n\nHowever, these assertions were not able to post, to be shared, or to be discussed on Facebook, that 80% of Taiwanese populations are its users. Most of the public or private wordings mentioning this event or relevant key words were removed immediately under Facebook’s intense censer policy within the following days. A large number of user accounts, pages, even pages of representative of university students in support of the action were logged out, suspended, or even deleted permanently by Facebook without clear evidence of violating its community standards.\n\nA few days later, Facebook officially announced that mistake had was made regarding the suspension of the NTU student congress and the FJU student association’s pages, guaranteed that part of the user accounts will be restored. Nonetheless, Facebook’s censorship on free speech in these events has effectively blocked out the spreading of information from the public and the media. Threats brought by the “China factor” to national security have been aware by scholars, observers, and governments noticeably in the West, in this regard, whether community networks like Facebook may engage in such censorship to limit or to exclude the spreading of particular information, further lead to the control or influence on target countries’ policy-making, or to undermine the democratic development of target societies, as a swap for entering China’s market, the ongoing case of Taiwan might worthy of more attention by international community.\n\n請把這篇報導轉出去，特別是你能接觸到外國友人或媒體\n\n目前來看，關於臉書大動作限制獨派言論的行為不只很少見於主流媒體、很少被大眾討論，更不要說被各國的媒體留意到。\n\n對於言論自由的高密度審查是不能被容忍的事，特別是在民主發展還是至為珍貴的台灣。這篇報導目前已經在外文社群網路裡有一定的曝光度，請轉貼出去，讓潑漆事件、臉書對於獨派言論的封鎖，還有中國因素對於各國造成安全的威脅能更廣為人知。\n\n下面是就整個事件和這份報導的簡單摘要，如果需要文字請直接使用無妨。對於文字的使用有任何建議修改也請直接告訴我。\n\n228，在台灣人紀念71年前遭國民黨佔領政權屠殺的受難者之時，數位大學生前往獨裁者蔣介石的墓並在其遺體的棺木上潑紅漆，意在向政府和大眾提出訴求。\n\n學生的兩個訴求，包括要求政府徹底清除威權遺緒，停止以台灣資源供奉獨裁者，並且廢除兩蔣文化園區，停止將威權遺緒做為觀光資源。然而，行動的聲明稿幾乎完全無法在80%台灣人口都是使用者的臉書上傳播。聲明稿、轉貼，乃至於只提到潑漆關鍵字的貼文都被臉書高密度的審查下迅速刪除。許多提及行動關鍵字的用戶，台灣大學和一些聲援行動的大學學生代表專頁被直接登出、暫停使用，甚至帳號被刪除。\n\n臉書在數天後表示社群守則的執行有「失誤」，並且會恢復部分使用者的資料，然而整個事件已經基於臉書大動作的言論審查，不見聞於主流媒體，特別是各國媒體。中國因素對於世界各國和西方各國的滲透是近來安全議題的焦點，臉書為了進入中國市場是否因而透過政策限縮並排除特定資訊，進而控制或影響特定政府和社會的民主運作，發生在台灣的言論審查事件，值得世界各國借鏡。\n\n[這篇是原作者針對整個潑漆事件還有台灣背景、獨派立場的補充報導，也可以提供給你的外國友人參考。](https://medium.com/@christinesfkao/censorship-concerns-rose-in-taiwan-as-transitional-justice-advocators-being-banned-from-facebook-65229e690c46)\n\n[中國因素、統戰與銳實力：「黑暗騎士」對民主國家的影響：以紐西蘭、澳洲與台灣為例](https://medium.com/@pugy30/%E4%B8%AD%E5%9C%8B%E5%9B%A0%E7%B4%A0-%E7%B5%B1%E6%88%B0%E8%88%87%E9%8A%B3%E5%AF%A6%E5%8A%9B-b4b44cefb19a)\n\n這篇則是關於中國因素的深入介紹，有興趣的朋友也務必花點時間看看\n\n#請協助轉傳並提供事證 #關於臉書言論審查\n\n我因為寫了這篇 Medium 報導所以被 Quartz（一個美國新媒體）的駐中港台獨立記者聯絡上，非常感謝大家幫忙散佈。\n\n這裡需要大家幫忙一件事情，我在近期相關文章中有讀到，有人遭遇到即使發佈「只限本人」權限的貼文，不應有檢舉的情形發生，卻仍被封鎖帳號的情形。\n\n想詢問是否有相關的截圖，或是其他被臉書封鎖的狀況（截圖輔以情境說明為佳），請留言或貼上截圖在下面讓我知道，讓我可以回報給國際媒體。\n\n#更新：不見得要只限本人權限的封鎖，如果你有遇到貼文被下架或是被登出，都可以回報到這邊，感謝！\n\n#再更新：目前 Quartz 還沒有確定一定會針對這個事件發一篇文，但就目前聊起來，他們比較關心臉書在言論審查上有沒有什麼具體事證，才去輔以中台關係（甚至學生，包含臺大學生或中生的一些互動）作為背景。如果有相關整理，也歡迎分享給我。台灣作為一個小國，真的很希望可以讓國際媒體看到這個事件。\n\n[https://www.facebook.com/stand4taiwan/posts/2020411791566577](https://www.facebook.com/stand4taiwan/posts/2020411791566577)",
			"date_added": 1520767702
		},
		{
			"post_id": 1520781698,
			"body": "【慈湖潑漆案拘提程序瑕疵，向監察院遞陳訴狀】採訪通知\n\n時間：3/12（一）10:30\n\n地點：監察院大門口\n\n出席人員：獨派青年\n\n針對慈湖潑漆，訴求去除支那威權，創建台灣共和之行動，桃園市檢警在3/5大動作，不惜違反司法實務慣例、比例原則失衡、尤其針對性政治性執行大規模拘提，過程中目無法紀，多有違反法律規定之嚴重瑕疵，若非中華黨國威權遺緒之未清，即為檢警違法偵查至今仍為司法實務中之慣行，針對拘提過程中之不法及不當，獨派青年將遞交陳訴書至監察院，要求其針對桃園市警察局大溪分局、刑事警察大隊、地方法院檢察署檢察官葉益發及趙燕利之執法瑕疵調查並懲處。\n\n敬邀媒體先進蒞臨採訪。\n\n媒體聯絡人：郭潤庭 Koeh, JūnTêng 0911841425；李嘉宇 Lí, KaÚ 0972001500\n\n[http://mobile.constitutiontw.org/archives/10168](http://mobile.constitutiontw.org/archives/10168)",
			"date_added": 1520781688
		},
		{
			"post_id": 1520871826,
			"body": "[中華民國以前ㄉ造神文宣  「蔣總統連任是光復大陸的保證」](https://twitter.com/kocstar_wang/status/973115018970415104)\n\n這是藉口，請先翻翻當時的台美協防條約，民國蔣軍若要出動還得經美國同意的條約內容，還有，有人知道簽此台美共同協防條約是在哪一年嗎？原來竟是播遷來台沒幾年就簽了。由此可見，說是要反攻中國，那是個騙局，讓N>2有了藉口。",
			"date_added": 1520871814,
			"meta": "{\"img\":\"900,506,875dcabbadb7999abb764885ca5653a84ba8854b94973532,0123333245637088847498AAA76B0C9DEAD99AFF9700D77AFF92BBBB8B00\"}"
		},
		{
			"post_id": 1520875338,
			"body": "今晚政經看民視上看到 前台南縣長蘇換智，在節目上說：台灣和支那，是兄弟關係。不能否定有相同的血緣文化⋯。\n\n説，作為『華人』社會，唯一自由民主人權的國家⋯⋯堡壘\n\n[我幹你娘啦！](https://twitter.com/sean9613211020/status/973244786189656064)\n\n光聽到你這一段話，就知道你他媽的也是華頭華腦。\n出來選台北市長。也是另外的柯文哲而已！\n這種垃圾台北已經有柯文哲了。\n你他媽還是回家洗洗睡吧！",
			"date_added": 1520875325
		},
		{
			"post_id": 1520882627,
			"body": "[[新聞] 搶不到潮店限量品　中國人竟暴打日本人](http://disp.cc/b/163-av4X)\n\n[支那蒸蚌](https://www.facebook.com/TaiwanIsNotACountryYet/posts/1862346350729540)\n\n10幾名在日本的中國人，因為長期進行代購的關係，早就被許多店列入黑名單，今日這幾人前往「Supreme」位於涉谷的一間分店，想購買限量新品，結果被工作人員認出並表示拒絕販賣。\n\n這些中國人被拒絕後，雖然與工作人員進行理論，但依然被拒絕，結果幾人當場惱羞成怒暴打工作人員，甚至還有人拿起排隊時坐的椅子猛砸，讓圍觀群眾看傻眼，影片傳上網後引起瘋傳，讓日本人對中國人更反感。\n\n[ら あや：不能直接報警抓人遣返嘛，入境不是都有填一張單子，有犯罪行為就直接拒絕再入境了啊！](https://www.facebook.com/TaiwanIsNotACountryYet/posts/1862346350729540?comment_id=1862453797385462&comment_tracking=%7B%22tn%22%3A%22R1%22%7D)\n\n[影片連結：https://goo.gl/BZWTYy](https://goo.gl/BZWTYy)",
			"date_added": 1520882612
		},
		{
			"post_id": 1520922232,
			"body": "#[孫中山出賣外蒙古主權得俄國援助，南方軍閥親俄漢奸學校「黃埔軍校」正式成立後事實上對蔣介石的「黃埔軍校」也不報啥希望，所以北上與北洋政府談判。](https://taioan.tk/1MUr8PCEZ5BiW23LWbdoDXgv4WkAYcYR2r/?Post:3)",
			"date_added": 1520922216
		},
		{
			"post_id": 1520933072,
			"body": "##[Lī-iōng ZeroNet ê kong-lêng, chit-má m̄-bián khoàⁿ Facebook ê bīn-sek, i koh ū chin chōe te̍k-sek ē-sái gián-kiù, mā in-ūi sī OpenSource só͘-ū ê code lóng ē-tàng kiám-giām, che leh ke-si sī chhiong phòa bāng-lō͘ sím-cha tiōng-iàu ê ki-su̍t, i pí Facebook koh khah hó sńg.](http://127.0.0.1:43110/1MUr8PCEZ5BiW23LWbdoDXgv4WkAYcYR2r/?Post:4:ZeroNet+proxy+server+%C5%ABn-chok+chin+ch%C3%A8ng-si%C3%B4ng)",
			"date_added": 1520933055
		},
		{
			"post_id": 1520953644,
			"body": "##[Kin-á-ji̍t sī Ki-chìn-tóng Tâi-pak-chhī kap Sin-pak-chhī chham-soán-jîn ê kong-pò͘ kì-chiá-hōe. Góa hām 蕭筱臻 Siau Siáu-chin、 張舒婷 Tiunn su-tîng chò-hóe khiā tī Tâi-pak-chhī gī-hōe mn̂g-kháu, kóng-chhut gún tùi chit-pái chham-soán ê siūⁿ-hoat.](http://127.0.0.1:43110/1GprzxL3m8ASMbFer4dBgHQwjTGx5C7mjS/?Topic:1520950143_1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr)",
			"date_added": 1520953626
		},
		{
			"post_id": 1521029583,
			"body": "##[那個什麼熱血教師 其實就是一般普羅大眾的心態咩 嘴巴上說民主自由很好 其實只是不希望自己的自由被干涉罷了 所以看到社會上的吵吵鬧鬧 就覺得自己想要安靜生活的自由被干擾了 於是就又嚮往 蔣經國、習近平或者是李光耀這種集權制下的”安靜” 那種所謂萬眾一心的虛幻想像](http://127.0.0.1:43110/1GprzxL3m8ASMbFer4dBgHQwjTGx5C7mjS/?Topic:1521028756_1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr)",
			"date_added": 1521029564
		},
		{
			"post_id": 1521031434,
			"body": "###[婦聯會資產爭議未決，如今又傳出標明「婦聯會捐款明細」密件流出，內容顯示，婦聯會資助多位藍營立委、議員競選經費，也曾捐款給前總統馬英九創辦的基金會。](http://127.0.0.1:43110/1GprzxL3m8ASMbFer4dBgHQwjTGx5C7mjS/?Topic:1521031355_1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr/)",
			"date_added": 1521031414
		},
		{
			"post_id": 1521046594,
			"body": "聽說現在很流行這種圖\n[不禮貌鄉民團做了一張](https://www.facebook.com/impolite.tw/photos/a.587170101339406.1073741837.513973141992436/1733730890016649/?type=3&theater)\n#中華民國支持者",
			"date_added": 1521046573,
			"meta": "{\"img\":\"651,700,000554aaabbb998444855668644665655111220333,0012340000056780000019A100000BCCC0000000000000000000000D5511DB00BBBBB0000D555DD000B0BCBC00\"}"
		},
		{
			"post_id": 1521087321,
			"body": "###[柯文哲：有任期制的選舉，對台灣政治是很大的傷害。這是台灣政治要去思考改變的地方。2015/10/9語錄](http://127.0.0.1:43110/1GprzxL3m8ASMbFer4dBgHQwjTGx5C7mjS/?Topic:1521086698_1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr)",
			"date_added": 1521087299
		},
		{
			"post_id": 1521129693,
			"body": "###[婦聯會近10年捐助藍營6億 捐公益、賑災僅9千萬](http://127.0.0.1:43110/1MUr8PCEZ5BiW23LWbdoDXgv4WkAYcYR2r/?Post:12)",
			"date_added": 1521129669
		},
		{
			"post_id": 1521129730,
			"body": "###[[新聞] 【獨家】台灣《壹週刊》紙本4/4收攤　將 - Gossiping板](http://127.0.0.1:43110/1MUr8PCEZ5BiW23LWbdoDXgv4WkAYcYR2r/?Post:13)",
			"date_added": 1521129705
		},
		{
			"post_id": 1521142561,
			"body": "###[Góa bē-kì-tit ZeroNet ū ê kong-lêng sī hān-chè khiām chu-liāu ê khong-kan, chit-má khoàⁿ khí-lâi ū ê kong-lêng sī bô su-iàu, chin chèng ài iōng ê to̍h kan-na sī ZeroBlog kap ZeroMe](http://127.0.0.1:43110/1MUr8PCEZ5BiW23LWbdoDXgv4WkAYcYR2r/?Post:14)",
			"date_added": 1521142535
		},
		{
			"post_id": 1521189426,
			"body": "###[陳師孟查馬英九妨礙司法案 將約談王清峰](http://127.0.0.1:43110/1MUr8PCEZ5BiW23LWbdoDXgv4WkAYcYR2r/?Post:15)",
			"date_added": 1521189399
		},
		{
			"post_id": 1521190629,
			"body": "###[獨家》管中閔遭起底 2005年起在中國多所大學違法兼職 | 新頭殼newtalk | 陳香蘭 台北市報導](http://127.0.0.1:43110/1MUr8PCEZ5BiW23LWbdoDXgv4WkAYcYR2r/?Post:16)",
			"date_added": 1521190601
		},
		{
			"post_id": 1521194441,
			"body": "###[台大校長當選人管中閔遭台大教師檢舉在中國大陸大學兼職，中研院今天（16日）發新聞稿表示，針對管中閔閔院士，中研院目前查無其任職本院期間申報赴大陸兼職之資料。](http://127.0.0.1:43110/1MUr8PCEZ5BiW23LWbdoDXgv4WkAYcYR2r/?Post:17:New+blog+post)",
			"date_added": 1521194412
		},
		{
			"post_id": 1521219425,
			"body": "[Darknet bô sī siaⁿmi̍h thâi lâng pàng hóe ê só͘chāi, mûithé lóng leh o͘pe̍h kóng](https://topick.hket.com/article/2029070/%E3%80%8C%E6%9A%97%E7%B6%B2%E3%80%8D%E5%8B%BF%E4%BA%82%E4%B8%8A%C2%A0%C2%A0%20%C2%A0%E5%B0%88%E5%AE%B6%E6%8C%87%E6%98%93%E9%81%AD%E9%BB%91%E5%AE%A2%E8%BF%BD%E8%B9%A4?r=cpsdlc), thâi lâng pàng hóe ê tāichì chū ū lâng ê siāhōe khaisí to̍h lóng itti̍t leh hoatseng, che kap Darknet si̍tchāi bô te̍kpia̍t koanhē, lóng sī lâng kakī bú chhutlâi ê kiatkó.\n\n[Thâutúá tī Twitter thâuténg, khòaⁿ to̍h Turkey chènghú kah ProtonMail hongsó](https://protonmail.com/blog/turkey-online-censorship-bypass/), chi̍t keng kongsi ê ho̍kbū chin te̍kpia̍t, i kiongèng àmhō Email ho̍kbū hō͘ lâng súiōng, ánni ēsái phiahkhui chènghú ê bānglō͘ símcha, chitmá Turkey chènghú tùi i bē sóng, tòngjiân ài kah i chhúlí-tiāu.",
			"date_added": 1521219395
		},
		{
			"post_id": 1521288628,
			"body": "##[Chit phian bûnchiuⁿ góa kámkak chin chán, kású lí tùi ZeroNet ū hèngchhù ēsái tha̍k khòaⁿ māi](https://perso.telecom-paristech.fr/parault/zeronet-quest/)",
			"date_added": 1521288597
		},
		{
			"post_id": 1521299974,
			"body": "###[當然柯文哲可以輕描淡寫說他都不知情，是底下人做的，就如同他回答王瑞德的指控一般。寫出這段過程，是想告訴柯文哲，現在檯面上批評你的絕大多數評論員和有沒有被收買無關。反倒是我想反問一個問題，那些幫你辯護的人，有沒有被你收買呢? ](http://127.0.0.1:43110/1MUr8PCEZ5BiW23LWbdoDXgv4WkAYcYR2r/?Post:20)",
			"date_added": 1521299942
		},
		{
			"post_id": 1521368650,
			"body": "###[獨家》新證據！廈門大學2005年公告：博士生指導教師管中閔 | 新頭殼newtalk | 陳香蘭 綜合報導](http://127.0.0.1:43110/1MUr8PCEZ5BiW23LWbdoDXgv4WkAYcYR2r/?Post:21)\n\n台大教授管中閔遭檢舉長期在中國廈門大學兼職，管迄今仍未出面說明；但是台大國發所教授劉靜怡今天(17日)在她臉書大爆料。\n\n她在臉書po出的資料顯示，廈門大學在2005年12月31日在信息公開網上公布：廈門大學第六屆學位評定委員會第11次全體委員會審議通過了七位廈大博士生指導教師名單，其中包括了台大教授管中閔，廈大並特別註明管的專業是數量經濟學、兼職。",
			"date_added": 1521368617
		},
		{
			"post_id": 1521379434,
			"body": "拿「500億成本印新鈔票」這件事來酸，感覺還挺蠢的，有可能是館長看太多，腦袋回溯到草履蟲的結構了？\n\n這件事我記得當年已經有人拿出來罵，但有更多人舉證打臉過一遍了，大家是換了新IPHONE之後，連自己腦子記憶體都格式化了是嘛？\n\n就是正常狀況下，「鈔票」本來就會一直印、一直銷毀啊？這跟某些計算公式有關，由於國家需要對市面上的貨幣流通數量控制、壓抑偽鈔數量等等的原因，貨幣必須要有一定時程的更新。\n\n比如貨幣流通不良、提領不便及偽鈔數量太多，也許就用了類似支付寶這東西來紓解實體貨幣壓力。\n\n不是因為要把鈔票上的圖換掉才印新鈔票的，不然你過年前跑去台銀、郵局排隊拿到的新錢是哪裡來的？\n\n你怎麼不對過年換新錢的人講：「換什麼新鈔？舊鈔票是不能用喔？浪費....」\n\n然後，不管花了什麼公帑，無論你覺得這花費是否為不必要的浪費，簡單來說，蓋蚊子館的錢即使省下來，也不會立刻變成小學營養午餐費；你繳的交通罰款，也不會立刻轉換成裝紅綠燈鋪馬路的經費，這一切都必須經過重重關卡，編列整合審核....\n\n地震捐款給花蓮都未必會落到花蓮災民手上了，你腦袋是在簡化什麼？\n\n記者寫的數字未必準確，你真的全盤相信用溫度計量雪深度的記者嗎？\n\n對了，北農總經理的年薪是140萬不是媒體寫的250萬。\n\n**你還信旺中新聞我也無言了**\n\n[文字來源：https://www.facebook.com/xijuny/posts/1998163623530696](https://www.facebook.com/xijuny/posts/1998163623530696)\n\n[圖片來源：https://www.facebook.com/TaiwanIsNotACountryYet/posts/1864715633825945](https://www.facebook.com/TaiwanIsNotACountryYet/posts/1864715633825945)",
			"date_added": 1521379400,
			"meta": "{\"img\":\"900,453,eeecccdddfff,01112220000200220003012112212002000000030112000003\"}"
		},
		{
			"post_id": 1521380671,
			"body": "在跟李敖裝熟和跟風R.I.P前，建議你還是看一下他以前說過什麼\n　　　　　　　\n1.支持中國共產黨鎮壓掠奪圖博人的政權\n\n2.在沒有解密檔案下曲解二二八，認為所謂的新事證是栽贓\n\n3.認為六四事件是合理性的鎮壓\n\n4.稱陳文茜是「黨外最聰明的女人」\n\n5.在郭冠英以筆名范蘭欽發表「辱臺言論」後，認為郭冠英很有才華，並贈與郭冠英1000美元。\n\n6.侵吞好友蕭孟能家產，並被侵占罪判刑確定\n\n7.曾說「台灣太小了，只是根小雞巴，並且是屁眼被搞時多餘出來的小雞巴」\n\n8.諷太陽花學運的學生是「媽寶」、「剛長尾巴的小蝌蚪」「學生壞蛋不可怕，學生混蛋最堪憂」\n\n9.曾說過「所有的女人都會偷人，只要有機會！女人三十歲以前偷情，三十歲以後捉姦」\n\n10.曾說「難怪台灣人赴日買春，會被妓女瞧不起拒接，可見日本人深知台灣人是賤種」！\n　　　　　　　　\n仇女、仇台、仇同、支持極權政權屠戮人民、背信棄義，我說完了，誰支持誰反對？\n　　　　　　\n**鯰魚墨水 天安門 李敖 還是早點死死的好**\n　　　\n至於他為什麼敢在白色恐怖時期罵蔣罵國民黨，只要查看看蕭孟能和李敖的家世背景就知道了，比高級天龍人還高級呢。\n\n[文字來源：https://www.facebook.com/TaiwaneseInkNo.1/photos/a.257848674560782.1073741828.254495541562762/636614410017538/?type=3&theater](https://www.facebook.com/TaiwaneseInkNo.1/photos/a.257848674560782.1073741828.254495541562762/636614410017538/?type=3&theater)",
			"date_added": 1521380636
		},
		{
			"post_id": 1521384169,
			"body": "李敖生前大概是我見過「撕裂族群」撕得最驕傲的人，例如談到鄭南榕殉道時他曾這樣說：\n\n「鄭南榕的例子只證明了一個事實：真正有種的，是外省人，而不是台灣人；台灣人被日本和國民黨統治百年都嚇怕了，台灣人的種，趕不上外省人的種，台灣人的膽量，趕不上外省人的膽量。」\n\n從李敖的話可以看得出來，他心中的「外省人」並不是台灣人，而其中重要的差別在於「種」，也就是血統。\n\n某一方面他是對的，台灣人，即使是從福建、廣東移民而來的台灣人，也從來都不是血統上的「中國人」，這些沿海居民自古一直被中原漢人視為蠻番，血統文化自然都不一樣，更不用說原住民或新住民，跟中國人根本一點關係都沒有。\n\n但另一方面，他也錯得離譜，他不知道現代的民族主義，早已擺脫了「種族」、「血統」等等特徵，而是轉而尋求集體的「認同」，是一群人、在同一個地方、為了追求美好且共同的未來而集結在一起努力，「民族」來自於後天的認知，而不是先天的種族血統。\n\n舉例來說，去年台東有四名從瑞士來的神父正式取得中華民國國籍，他們平均來台超過50年，傳教之餘還致力於環保、教學，台語、布農語、阿美語、卑南語等都難不倒他們，即使沒有入籍前，又有誰能說他們不是「台灣人」？最近更有名的例子是男籃隊的Davis，當他貼出穿著「Taiwan」字樣球衣的照片時，誰會說他不是台灣人？更不用說鄭南榕，現今提到他都是台灣先烈，誰會說他外省人？\n\n而李敖、郭冠英等高級外省人就是反面例子，他們從來不認為自己是台灣人，他們的認同在對岸，那他們就是中國人，甚至包含土生土長的黃安、劉樂妍等，即使在地緣關係上是台灣人，但是在民族主義的概念裡頭，他們都是道道地地的中國人。\n\n喜歡當中國人就飛去中國，把台灣留給台灣人，這麼簡單的道理，就是有人不懂。奇妙的是，終其一生，似乎沒人會把李敖、郭冠英或黃安這些人跟「撕裂族群」扯上關係，會被媒體冠上這個帽子的，永遠都是在說台灣人「撕裂」中國或中華民國人之類的華人族群。\n\n因為只有華人會被撕裂，只有華人覺得大家都應該是華人，只有華人不懂得尊重其他族群不同的文化及歷史，而只想著漢化對方。\n\n但你才華人，你全家都華人，你才Chinese，我們從來都不是Chinese，我們是Taiwanese、懂得尊重彼此不同族群文化的Taiwanese，未來我們也會建立起真正族群平等的新國家，至於你們從對岸帶來的、那獨尊中華文化的偉大中國，就隨著上一代滯台中國人一起魂歸故土吧，台灣人能給予你們最大的善意，就是願你們的靈魂，都能回到你們認同的故鄉。\n\n而你我都知道，那將不會是台灣。\n\n[文字來源 - https://www.facebook.com/sunnyhengchun/posts/1598025513580543](https://www.facebook.com/sunnyhengchun/posts/1598025513580543)",
			"date_added": 1521384133
		},
		{
			"post_id": 1521386182,
			"body": "在台灣獨立建國之前，在中華民國尚未結束對台殖民統治之前，你跟我提什麼「雖然他是統派，他是中國人，但崇尚民主自由，反國民黨反蔣，所以，值得欽佩懷念」之類的話，很抱歉，我一律不接受。\n\n因為，這種人本質上仍舊是殖民心態，仍舊認為台灣最終應回歸「祖國」，無視中華民國加諸於台灣人身上的中華意識，以及對這塊土地的荼毒。所以，他們的言行無論再如何強調「民主自由」，都還是不離「大一統」的論調，此舉對於台灣主體性的提升，不僅毫無幫助，更是雪上加霜，何來欽佩懷念需要？不要三八假賢慧了，你要當的是台灣人，不是要當聖人。\n\n**中華民國在台灣辦教育也讓你參與投票啊\n身為獨派的你也要感謝它嗎？**\n\n[https://www.facebook.com/iloveiena/posts/10214003713080462](https://www.facebook.com/iloveiena/posts/10214003713080462)",
			"date_added": 1521386145
		},
		{
			"post_id": 1521395169,
			"body": "[Kah ZeroNet Proxy siat tī Tor Hidden Services sī ē-sái ūn-chok](http://127.0.0.1:43110/1MUr8PCEZ5BiW23LWbdoDXgv4WkAYcYR2r/?Post:22), án-ni ê hó-chhù sī ē-tàng kah Proxy chú-ki IP ê ūi-tì chhàng khí-lâi, tān-sī siūⁿ beh liân-soàⁿ khì ZeroNet ê lâng, i to̍h ài chng Tor Browser kah ē-sái kap chú-ki thong-sìn, góa khó-lū liáu, seng chiām-sî mài sú-iōng che leh kong-lêng.\n\nTùi it-poaⁿ lâng lâi kóng, lóng sī iōng Chrome ia̍h-sī Firefox lâi liân-soàⁿ bāng-lō͘, kiò ta̍k-ke chng Tor Browser, it-tēng ē sabô che leh mi̍h-kiāⁿ beh chhòng siáⁿ-siâu.\n\nPut-koán án-choáⁿ-iūⁿ, Onion Services tō sī sin chún-pī khí-lâi, ká-sú ū hoat-seng TŌA TĀI-CHÌ, án-ni to̍h sûi-sî lóng ē-sái ūn-chok lâi phò-kái bôlí ê bāng-lō͘ sím-cha.",
			"date_added": 1521395131
		},
		{
			"post_id": 1521399656,
			"body": "###[維吾爾武裝集結新疆西部邊界 合圍習特勒看家老本 共匪“精銳”丘八正在作最後的困獸鬥 新疆光復在即](http://127.0.0.1:43110/1MUr8PCEZ5BiW23LWbdoDXgv4WkAYcYR2r/?Post:23)",
			"date_added": 1521399617
		},
		{
			"post_id": 1521910752,
			"body": "老實說，蔡英文是個很聰明的總統，表面上看來好像在拖台灣獨立後腿，骨子裡卻默默的把台灣往中國的魔掌中往外推，雖然她沒有加速台灣獨立，但她卻很技巧地在幫助想要獨立的台灣人民然後又不要讓中國有藉口發作雞歪。 \n\n重點在台灣人民自己想不想獨立，想不想拋棄中華民國，然後有多少台灣人想這麼做\n\n至於柯文哲，就是那種會愚蠢到把台灣送進中國虎口的呆人，智商跟我們身邊那些看似教育程度高但是卻不會深入思考思辨的傢伙一樣沒有參考價值，比起川普都差得遠了。 \n\n這種人做市長也就算了，當總統就是那種會賣了國家還幫人家數鈔票的蠢貨。因為無知與毫無賣國與無知的自覺就是賣國的首要條件。\n\n[https://twitter.com/intzu_tw/status/977344181084368896](https://twitter.com/intzu_tw/status/977344181084368896)",
			"date_added": 1521910712
		},
		{
			"post_id": 1521922613,
			"body": "###[管中閔再遭台大學生爆料 名列廈大2012年博士班招生指導老師](http://127.0.0.1:43110/1MUr8PCEZ5BiW23LWbdoDXgv4WkAYcYR2r/?Post:24)",
			"date_added": 1521922572
		},
		{
			"post_id": 1521970164,
			"body": "管中閔不愧是爺們兒\n跑到中國兼課的消息一曝光 \n廈門大學立刻就把課表撤掉啦 \n然後跟台灣說他絕對沒有去兼課 \n不管大家信不信 \n至少我們知道廈門大學很賣面子給管爺 \n[https://twitter.com/impolite_tw/status/977789682632212480](https://twitter.com/impolite_tw/status/977789682632212480)",
			"date_added": 1521970122,
			"meta": "{\"img\":\"791,700,eeeaaea9ebbedddcddcbbddcaaabcdaaca9addbfee,0112232230445678444404967856554456586667000405440000000000009ABA9C00D0555407D0D09999900000\"}"
		},
		{
			"post_id": 1521988108,
			"body": "[管中閔：我去廈門大學只有演講，沒有教學](https://www.facebook.com/permalink.php?story_fbid=386079965193646&id=382472085554434)\n\n來，看這個網頁\n\n原來演講的內容是經濟學，統計學\n\n原來演講可以被選課\n\n原來聽演講可以有學分\n\n你媽的當台灣人都是白癡嗎？\n\n趕快聽個習包子人大三小時演講壓壓驚",
			"date_added": 1521988065,
			"meta": "{\"img\":\"700,700,b56a34933a22622401ddddcc643eeebba766212cccaaa999,012111133145555555546766897669679A899999999BC99999999969999699D969999969D969669699D66999966EEFD9AF7D\"}"
		},
		{
			"post_id": 1521990126,
			"body": "nagee【柯文哲的秩序】\n\n柯文哲在選2014的時候曾說：\n「人活在世界上，每天都在做交換，什麼東西是你不願意拿出去交換的，那就叫做【核心價值】」\n\n當時感動了很多人。現在大家不禁在想，柯文哲的核心價值是什麼？\n\n[http://127.0.0.1:43110/1MUr8PCEZ5BiW23LWbdoDXgv4WkAYcYR2r/?Post:25](http://127.0.0.1:43110/1MUr8PCEZ5BiW23LWbdoDXgv4WkAYcYR2r/?Post:25)",
			"date_added": 1521990073
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "@FreedomKnight: tio̍h, lí sī Tâioânlâng ? ",
			"post_uri": "1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr_1520347730",
			"date_added": 1520350321
		},
		{
			"comment_id": 2,
			"body": "@Version: che sī Tâioân Pe̍hōejī (台灣白話字) ",
			"post_uri": "1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr_1520347730",
			"date_added": 1520350472
		},
		{
			"comment_id": 3,
			"body": "@FreedomKnight: tio̍h, Tâioân Lômájī ",
			"post_uri": "1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr_1520347730",
			"date_added": 1520350503
		},
		{
			"comment_id": 4,
			"body": "@Version: lín Tiongkoklâng tòngjiân khòaⁿ bô https://en.wikipedia.org/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB",
			"post_uri": "1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr_1520347730",
			"date_added": 1520350700
		},
		{
			"comment_id": 5,
			"body": "@FreedomKnight: lí ê le̍ksú bô hó , lí ài khì tho̍k chuliāu",
			"post_uri": "1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr_1520347730",
			"date_added": 1520350845
		},
		{
			"comment_id": 6,
			"body": "@FreedomKnight: lí ēsái khì tho̍k Hànjī ê le̍ksú, Hànjī ū chiok chōe lí bô siūⁿ to̍h ê būntê ",
			"post_uri": "1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr_1520347730",
			"date_added": 1520351576
		},
		{
			"comment_id": 7,
			"body": "@Halo9527: che bô lí ê tāichì",
			"post_uri": "1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr_1520365330",
			"date_added": 1520400225
		},
		{
			"comment_id": 8,
			"body": "@S0n: tio̍h ",
			"post_uri": "1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr_1520362622",
			"date_added": 1520405764
		},
		{
			"comment_id": 9,
			"body": "@Halo9527: kàn lín niâ ",
			"post_uri": "1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr_1520706214",
			"date_added": 1520763605
		},
		{
			"comment_id": 10,
			"body": "@S0n: che sī Tâioânlâng ê tāichì, kap lín gōakoklâng bô koanhē ",
			"post_uri": "1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr_1520706214",
			"date_added": 1520763751
		},
		{
			"comment_id": 11,
			"body": "@BiliiBilii: gōakoklâng mài lâi chhá ",
			"post_uri": "1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr_1520875338",
			"date_added": 1520920628
		},
		{
			"comment_id": 12,
			"body": "@BiliiBilii: kàn lín niâ ",
			"post_uri": "1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr_1520875338",
			"date_added": 1520920871
		},
		{
			"comment_id": 13,
			"body": "@Holyins: góa beh siá siáⁿmih jī, sī góa ê tāichì ",
			"post_uri": "1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr_1520933072",
			"date_added": 1520936660
		},
		{
			"comment_id": 14,
			"body": "@Unicom: lí kóng liáu tio̍h ",
			"post_uri": "1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr_1520933072",
			"date_added": 1520936684
		},
		{
			"comment_id": 15,
			"body": "@Polar: khì ha̍ksi̍p kap tha̍k chheh pa ",
			"post_uri": "1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr_1520933072",
			"date_added": 1520958863
		},
		{
			"comment_id": 16,
			"body": "@Polar: góa bô bē phah Hànjī, lí khì cha jītián to̍h ēsái ah ",
			"post_uri": "1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr_1520933072",
			"date_added": 1520962721
		},
		{
			"comment_id": 17,
			"body": "@Unicom: lí kah sī pùnsò Tiongkoklâng ",
			"post_uri": "1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr_1521029583",
			"date_added": 1521034741
		},
		{
			"comment_id": 18,
			"body": "@Polar: kiò lí khì tha̍k chheh, lí sī thiaⁿ bô?",
			"post_uri": "1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr_1521029583",
			"date_added": 1521037655
		},
		{
			"comment_id": 19,
			"body": "@Birdvd: góa ah bô sī beh siá hō͘ lí khòaⁿ eh",
			"post_uri": "1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr_1521219425",
			"date_added": 1521276620
		},
		{
			"comment_id": 20,
			"body": "@Lgnchem: khì cha chuliáu pa ",
			"post_uri": "1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr_1521219425",
			"date_added": 1521276701
		},
		{
			"comment_id": 21,
			"body": "@Gaoha: lí sī gōa kok lâng, m̄biān lí lâi kóng ",
			"post_uri": "1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr_1521380671",
			"date_added": 1521385255
		},
		{
			"comment_id": 22,
			"body": "@Lianmeng8900: pùnsò Tiongkoklâng mài lâi nāu ",
			"post_uri": "1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr_1521399656",
			"date_added": 1521428108
		}
	],
	"follow": [
		{
			"follow_id": 2,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1PJm5juxa6AxizD2KeBGRxwNHfLd5vBSzD",
			"user_name": "Nofish",
			"date_added": 1520351236
		},
		{
			"follow_id": 3,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj",
			"user_name": "Nofish",
			"date_added": 1520351297
		},
		{
			"follow_id": 4,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu",
			"user_name": "Krixano",
			"date_added": 1520361062
		},
		{
			"follow_id": 5,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr",
			"user_name": "Kiànkok Kàutiâu",
			"date_added": 1520953657
		},
		{
			"follow_id": 6,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1FMNMvte99kWiCMmvkhX2PH2bs61m55ktY",
			"user_name": "Soankilang",
			"date_added": 1521023732
		},
		{
			"follow_id": 7,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1M1eW86EocwXsyUHS6oJKg8MyCYno7vhij",
			"user_name": "o͘pe̍hbú",
			"date_added": 1521023737
		},
		{
			"follow_id": 8,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h",
			"user_name": "Binchan",
			"date_added": 1521192642
		}
	]
}