{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"3_1JaAYJncF8JgK4obfPrc3Xppnc7FERVm2N": [
			{
				"comment_id": 1,
				"body": "> [kostanew](#comment_147_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Про зеркала это нормально, и так было понятно что введут, в США так же. Главное чтоб не как в Германии, наказывать конечного потребителя контента.\n> Про запрет пропаганды это немного плохо. 100500 видеоуроков по ИБ попадает под это, так же как и профессиональные конференции. Однако, обнадеживает что эта инфа опровергнута Роскомнадзором.\n\nА в Федеральном законе РФ то так прямо и прописано давным давно, что владелец за размещенную на его сайте информации не несет ни какой ответственности если ресурс явно не соответствует запрещенной тематика. Лишь пользователь разместивший негативный контент подпадает по статью.",
				"added": 1464325745
			},
			{
				"comment_id": 2,
				"body": "> [cypher](#comment_16_1DvD5pHwaCarvCYZhC67qV3QsfqgifZBA1): Хорошо, что zeronet сюда не подпадает, т.к. не является средством обхода блокировок. Тут всё своё.\n\nПод средством обхода блокировок можно рассматривать средства и косвенные. По факту беспредел. К примеру, разместили пост на форуме который не понравился государству, сразу в бан. Банально зажимают конституционные права граждан)))",
				"added": 1464325981
			}
		],
		"1_1DXxyNnRKTvzUcuvQhTu8uWSXSNYL4oVc6": [
			{
				"comment_id": 3,
				"body": "> [extowgen](#comment_1_1L12uGKUpj1MojJK451BW7u2kEG7UhVVh8): они просто хотят знать, чем мы дышим,а перекрыть это они не могут\n\nИ не смогут. Все куплено и распродано. На постах сидят тупые люди,  чье место было куплено или досталось по всевозможным связям. Они головой то логично некоторые думать не умеют, что уж говорить о перекрыть.",
				"added": 1464326485
			},
			{
				"comment_id": 4,
				"body": "В подтверждение моим словам. Братишка собирался в депутаты из народа. 2 красных диплома. Был опыт в гос. службе. Знаете что ему сказали? Если у тебя нет хотя бы 3 мил. даже не лукайся.)))) Вот Вам и государство. Кому мы нужны, скоты да бродяги?",
				"added": 1464326667
			}
		]
	},
	"comment_vote": {}
}