{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1565237461_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565430707_16joHUdKRd7Qfjp6fjTfHkaqwkrUhj7svk": 1,
		"1565420698_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": 1,
		"1565538736_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": 1,
		"1565642608_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": 1,
		"1565739655_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1
	},
	"next_comment_id": 25,
	"comment": {
		"1565391114_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 1,
				"body": ">Taking it down makes recruiting and planning a helluva lot harder. \nWe spread memes, /pol/ is a board of peace. Not sure what kind of planning he's talking about.",
				"added": 1565392129
			},
			{
				"comment_id": 3,
				"body": "> [styromaniac](#comment_922_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): And since 8channers arrived, it's been a game of comebacks or going along with an absurd joke. \n\nWhat absurd joke would that be?",
				"added": 1565392794
			}
		],
		"1565237461_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 2,
				"body": "> [kidcourageous](#comment_70_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): No, again, my great grandpa literally was an SS officer who saw Auschwitz. \n\nPress X to doubt.\n\n\n> [blackwatch88](#comment_15_1HFmAHXvHgkwfXcGZH9hMqj9TbgXDZNwGc): No, it was muh real..my grandpa was gassed 6 gorillion times by Hitler himself before being made into soap and lampshades.\n\nHow's his fibromyalgia?",
				"added": 1565392682
			}
		],
		"1565420698_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 4,
				"body": "> [wkuvqb5egq](#comment_10_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf): chans used to be nothing but animal harm, cp, and ron paul spam lol\n\nThat's a bit of an exaggeration, don't you think? Yeah there were goreposters who would show up and try to gross out/scare off the normalfags, and /b/ and /soc/ and a few other boards had pedoposters who would go to other boards and troll everybody with not-quite-porn pictures, but that was just a peppering across the boards by a small group that was eventually chased off of both fullchan and halfchan. It was never really that substantial in the first place, which is why the media bringing it up every time they mention 8ch is so retarded. Especially since Jim and Ron cleaned the place up after cripple's departure. You're right about the Ron Paul stuff though... I still have my Doom Paul folder.",
				"added": 1565437745
			}
		],
		"1565427459_1w9czsVapAVmVVQzf7xzuSqvqGar6xd2C": [
			{
				"comment_id": 5,
				"body": "Events like this are why Bitcoin and a lot of other crypto aren't reasonably accessible for Joe Schmoe. Satoshi intended distribution to take place primarily at the local level. Without local, real world distribution, people are forced to use these shitty, regulated, centralized exchanges if they want to enter the crypto market. It's infuriating. This is why I never bothered getting into it. By the time I realized Bitcoin was more than just vaporware, GPU mining was no longer feasible.\n\n\nNow exchanges like this want me to install adobe fucking flash, access to a webcam that I don't have because I'm not a retard, my passport, my social security number, my bank account information, and a signed fingerprint of my nutsack in order for me to buy $20 of Bitcoin. What the hell is wrong with people? Does the KYC law really require you to collect photographs of your customers? I hope the hacker brings the whole thing crashing down so that people HAVE to find better ways to trade crypto... Centralized places like these are the source of Bitcoin's price manipulation anyway. Disrupt the exchanges and you disrupt the boom-and-bust cycle.",
				"added": 1565441360
			}
		],
		"1565430707_16joHUdKRd7Qfjp6fjTfHkaqwkrUhj7svk": [
			{
				"comment_id": 6,
				"body": "It's possible that some /tech/ anons set up a ton of relays, knowing that a flood of anons would be using Tor for ZeroNet, but I've not seen any chatter to that affect. Best guess, feds are padding their controlled nodes to make timing attacks easier because they actually believe the media's drivel about all \"mass shooters\" coming from 8ch and are unwilling to accept that these guys are lone wolves? That's my best guess. I'd love to be wrong about that.",
				"added": 1565442400
			},
			{
				"comment_id": 7,
				"body": "> [manifesto](#comment_2_136fTH3F2Y41FnDXJPpThYqi9uFwRzDyeT): Dissenter.comGab.com [...]\n\n What does that have to do with anything...? Gab is full on Zionist and is happy to host literal ADL drones that hunt down, harass, attempt to dox, and attempt to deplatform so-called antisemites. \"The Catcher\" comes to mind. They also deplatformed Patrick Little after shadow-banning proved futile.",
				"added": 1565444610
			},
			{
				"comment_id": 8,
				"body": "> [ratsmack](#comment_4_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): Patrick Little was banned for doxing which is against Gab rules.\n\nFFS, post proof of the dox. Let's see it. Because I was glued to his goddamned feed and never saw it.",
				"added": 1565453484
			},
			{
				"comment_id": 9,
				"body": "> [ratsmack](#comment_4_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): \n\nIt's been over five hours.  Cough up the proof of dox if he's really guilty. Every time this stupid subject gets brought up, no one can ever produce the proof of the accusation...\n\nBECAUSE GAB STAFF NEVER PROVIDED ANY.\n\nI bugged the hell out of them to show a redacted screenshot or something, ANYTHING to demonstrate their accusation when the banning went down. They were silent. I maintain that they made the whole thing up as an excuse to kick him off the platform. I DARE you to prove me wrong, anon. Show me an archive or something. I'm going to keep checking this thread for at least a few days. If you can prove me wrong, I promise that I'll never mention Patrick again here or anywhere else. If you can't, then what does that most likely mean?",
				"added": 1565473498
			},
			{
				"comment_id": 10,
				"body": "> [ratsmack](#comment_6_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): There have been several high profile banns on Gab. \n\nAre you a Gab employee?\n\n> [ratsmack](#comment_6_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): Then there was Patrick Little who pushed the envelope with posts against Jews, where some were very close to the call to action line. \n\nHe was and still is running for public office. He went out of his way constantly to say that under no circumstances should his supporters engage in violence. He stood in the middle of downtown Portland and had a fresh cup of hot Starbucks poured on his head by some antifa looking faggot and didn't flinch, much less retaliate. His only call to action has been for people to get off their asses and help him.\n\n> [ratsmack](#comment_6_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): The post on doxing was removed before anyone saw it\n\nOh, well isn't that convenient? Does \"anyone\" include you or did you see it? If not, then why do you believe it existed? If so, then WHO DID HE DOX?\n\n> [ratsmack](#comment_6_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): while many requested to see it, it was never released... because that would be doxxing.\n\nSo everyone is supposed to blindly trust Gab, despite the controversy?",
				"added": 1565491700
			},
			{
				"comment_id": 12,
				"body": "> [ratsmack](#comment_6_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5):  [...]\n\nI'm still here and I still want answers.",
				"added": 1565552460
			},
			{
				"comment_id": 24,
				"body": "> [ratsmack](#comment_6_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5):  [...]\n\nThis is the last time I'm bumping this. Are you going to answer me or not?",
				"added": 1565704109
			}
		],
		"1565538736_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": [
			{
				"comment_id": 11,
				"body": ">How did the masturbation machines work?\nVery well, from what I heard from a satisfied customer that stayed at one of Uncle Adolf's resorts. In fact, I believe he said they were \"to die for\", or something like that.\n\n>Not a single official order or document could be found, the whole theory is based on what they made someone on the nurnberg trials sign under heavy torture.\nAnd the super high quality testimonies of countless inmates--er, I mean \"survivors.\"> [ayylmaolol](#comment_32_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14): its a totally made up and fabricated number, the 6 million number was reported in the NYT before the USA even joined the war\n\nhttps://archive.org/details/256ReferencesTo6000000JewsPriorToTheNurembergTrialAnnouncement\nI like how they memed the 6 gorillion thing as applying to Russia before they applied it to Germany.",
				"added": 1565551906
			}
		],
		"1565565971_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 13,
				"body": "Congratulations. Your test was successful.",
				"added": 1565566116
			},
			{
				"comment_id": 14,
				"body": "Not sure what you mean by clunky. You're asking why we have usernames at all?",
				"added": 1565566212
			},
			{
				"comment_id": 15,
				"body": "The animations are just polish. ZeroID is just one of many ID providers, the default one. The biggest one, for now. Zites can basically opt-in to ID providers. ZeroTalk uses ZeroID and ZeroID has lots of spiffy animations because \"an average user\" wants polish.",
				"added": 1565566803
			}
		],
		"1565560390_15eZANwRXZ5hbXJN4fAngLXrSwF7s1CJ4n": [
			{
				"comment_id": 16,
				"body": ">(base64)\n>encryption\nPick one. Base64 is an encoding. Knowing the difference between encoding and encryption is non-trivial.\n\nStoring images as data strings is extremely inefficient. That's only practical for small images, although I suppose in theory it would allow you to store images directly into a Zite's database. The decoding process is pretty slow in the browser, so larger files don't perform well... Though you may find it interesting to know that you can do this with audio too. Try encoding a 10s audio clip. In HTML5, a lot of people don't realize the audio tag supports base64 data sources too. I appreciate your spirit of experimenting. Have fun!\n\n>src=\"data:audio/ogg;base64,[datagoeshere]\"",
				"added": 1565612986
			}
		],
		"1565601077_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 17,
				"body": "> [port220irq5dma1](#comment_42_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz): \n\nReminder that Capitalism and Communism are not the only available socioeconomic positions. Have you considered the Third Position?\n\nThe last time we tried it, it cured wheelbarrow-tier hyperinflation, purged private banking, built a beloved and world famous highway system that's still used today, provided work and business investment opportunities for the common man, subsidized higher learning without requiring insane tax hikes, especially for children and young men that showed high intellectual potential, encouraged and supported local farmers, purged mega-stores that destroy small businesses, banned usury, made guns more accessible to the common man, virtually eliminated crime, generated a number of high technologies that we're still using today, and many other wonders that are too numerous to list. It may sound like a utopia, but it was real for just several precious years. They managed to do all of that and more in under a decade.\n\nSo where did it go, you might ask?\nhttps://i.imgur.com/1VhNL2q.jpg\nIt was drowned in a sea of blood and fire by people who feared their power and success.\n\nNext time there will be more nations that participate... Because now the entire western world is suffering under similar conditions to those which brought about the first triumph. The second one is going to happen on multiple continents. It's going to be a bit harder to suppress this time.",
				"added": 1565616180
			},
			{
				"comment_id": 18,
				"body": "> [libertario](#comment_2_1NR75UCuhd6qS5ibDyo5WYXE8zaRZGncrs): But this was no miracle. It was the application of the principles of the free market economy, of the methods of capitalism, even though they were not applied completely in all respects.\n\nYou're equating business and Capitalism, my dude. I am familiar with the ancap/libertarian perspectives when it comes to this stuff, so I'm going to skip a lot of fluff and just say that your presuppositions are fundamentally false. I'll state them plainly, in no particular order:\n\n* An economy left to its own devices will self-regulate.\n* Government intervention in the market can only be harmful to a market's health and thus society's well being.\n* Bad actors in a market will be punished by good actors that will out-compete them, and this is a sufficient counterbalance.\n* Private citizens always use money better than a government does.\n\nThose are the presuppositions that you already know you're operating under. Now I will list some that you may or may not be consciously aware of:\n\n* Some degree of racial egalitarianism.\n* The idea that culture can always be transmitted.\n* The idea that everyone is at least somewhat morally neutral.\n* Individuality is always a virtue.\n* Collectivism is always a vice.\n\nI'm sure there are more, but I'll just deal with these. The WEIMAR REPUBLIC government was more friendly to capitalism than the Third Reich was. No, I'm not trying to saddle them with blame for the hyperinflation. Rather, the cities of Weimar were hellholes of debauchery, not unlike what we're starting to finally uncover in Hollywood. The Free Market has absolutely zero mechanisms available to clean up such a mess.\n\nYou would probably tell me that \"If people hate it, they'll just boycott the companies that are pushing the garbage and they would no longer be able to operate!\" Yeah, how's that working out in America? Netflix and Marvel Studios sure seem like they're on their death bed, don't they? People are in no way morally neutral. You either cultivate virtue or you degrade, like everything else in the universe that isn't being actively built up.\n\nIf you look only at the market, or view the market as central to the health of a nation, then you're going to miss the big picture. Those areas where, as you say, \"the methods of capitalism\" were not completely applied are exactly what allowed these people to rise from the ashes. Public community banks. Labor backed currency. Strong protections for workers, especially against foreign workers. Strong protections for the businesses of citizens against foreign competitors. The physical removal foreign, internationalist groups, including banks and businesses that were sucking the country dry. At one point they even nationalized a certain Rothschild's assets and basically held him hostage for 30 million Reichsmarks. I could expand that list, but I think that's sufficient to make my point.\n\nDo you honestly believe that if the government had been completely hands-off, that Germany would have soared even higher in what they accomplished?\n\n> [libertario](#comment_2_1NR75UCuhd6qS5ibDyo5WYXE8zaRZGncrs): Every country can experience the same \"miracle\" of economic recovery, although I must insist that economic recovery does not come from a miracle; it comes from the adoption of — and is the result of — sound economic policies.\n\nSo if you take those \"Free Market principles\" and consistently apply them to African countries, you mean to tell me that you think they're going to build Wakanda? I'm not trying to make fun of you. I just want you to think about this more deeply. There is more that goes into building up a nation, or even an economy, than just allowing free trade, abolishing regulations, and lowering taxes. Society has many overlapping spheres which must be addressed. Economy is only one. Focus too much on economy and you'll find yourself ruled by foreigners, like America is today.",
				"added": 1565623774
			},
			{
				"comment_id": 19,
				"body": "> [anglosaxon](#comment_10_15eZANwRXZ5hbXJN4fAngLXrSwF7s1CJ4n): You can complain about capitalism all you want but it's the natural state of man to want to own his own property and protect it. Brainwashed socialists will eventually fail their system with corruption, in which case it dissipates into barter, aka capitalism's starting point.\n\nEquating business and capitalism...\n\n\nCapitalism doesn't mean the mom and pop shop down the street. Capitalism means the Federal Reserve. Capitalism means Wall Street. Capitalism means Walmart and Target putting Mom & Pop out of business. Capitalism means insurance. Capitalism means predatory loans at interest. Capitalism means credit cards. Capitalism means endless corporate lobbying.\n\n\nBusiness is Jimmy selling candy to his friends. Business is making bicycles and selling them. Business is mowing lawns and doing landscaping. Business is selling portraits on the street corner. Business is delivering cookies and flower arrangements to people. Business is owning and operating your own restaurant. Business is owning a fishing boat and selling your catch at the farmer's market.\n\n\nDo you see the difference? This is a very intentionally erected language barrier in our society.",
				"added": 1565624926
			},
			{
				"comment_id": 20,
				"body": "> [almostsoul](#comment_13_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): People selling stocks which they own at exchanges is no different from people selling fish which they catch at a market, in a moral sense. \n\nHave you ever heard of fish prices being manipulated by fish brokers? Ever heard of nice old guys and ladies losing their entire retirement fund because of a fish market crash or fish devaluation? There's a difference. I get that --in principle-- there shouldn't be... But it nonetheless exists.\n\n> [almostsoul](#comment_13_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): People go to Walmart because they have families and want lower prices are things like children's clothes, diapers, cleaning products etc., are you saying we just can't sell things at a certain price? \n\nI know why people go to Walmart. I don't blame the customers. The issue is that Walmart is notorious for quite consciously putting smaller businesses out of work by operating at a loss at new locations and then raising the price of the products after their competitors in the area have been eliminated. They can only do this because they're a large corporation. That kind of behavior isn't helping the economy. It's just putting hard working people out of a job and concentrating power into the hands of a small number of ruthless assholes.\n\n> [almostsoul](#comment_13_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): Insurance is just the communication of information\n\nIdeally it would be. In practice, it's predatory. Insurance companies are incentivized to pay as little as possible when something happens, while charging whatever they can get away with and finding any excuse to raise your rates once you're settled in. They don't exist to cover the cost of damages when something bad happens, they exist to enrich the people that own the company. The majority of people wouldn't even bother with it, except that the government forces them... Even doctors.\n\nI know you'll take that as an admission that in a \"Free Market\" people would just opt out, but we don't live in an ideal scenario. The concentration of power into the hands of the wrong people leads to the worst kind of big government. Capitalism facilitates this through concentration of financial resources into the hands of the most ruthless. Again I'm talking about capitalism, not honest business. Financial sector bullshit and government corruption feed off of each other like some kind of materialist Ouroboros.\n\n> [almostsoul](#comment_13_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): Same with loans, if it's bad then don't do it\n\nIf you're a libertarian, then you know how important loans are. Loans aren't the problem. Loaning at interest, USURY, is the problem. There's no real world, Free Market solution to usury. History shows that only proper use of force solves that. I doubt you'll agree about interest, but I think most people probably do.\n\n> [almostsoul](#comment_13_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): Most of the things you describe are regulated or plainly controlled by the state, but then things like insurance and credit cards aren't, so I don't see what your point or guiding principle is. \n\nWe have a fundamentally different worldview, although I'm pretty sure that we both agree that OP is a literal faggot.\n\nI don't accept the non-aggression principle. It's poetic, but when you've got a mob of Bantus breathing down your neck, they don't give a shit about your principles. Antifa could care less about not transgressing your negative rights and the government is going to protect them from your right to defend yourself. Big nose bankers, brokers, and their lawyer buddies couldn't care less about you either, goy.\n\nSo you have two options: fix the government somehow or eventually die and be replaced by people groups that have no interest in even remembering you or your people's legacy, much less carrying it on. What does it matter if you dogmatically hold to non-aggression if your people are eventually eradicated as a result? It's a dead end. Racial collectives are organic and they ARE the guiding principle which transcends all others. Not in theory, but in practice. The world around you reflects this, no matter how hard the Marxists try to distort reality with multicultural and interracial degeneracy.\n\n> [memesadler](#comment_34_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): Also, thank goodness the cattle ignore race, or they would see I'm an outsider pushing this into their society.\n\nIn a nutshell.\n\n> [almostsoul](#comment_14_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): People cannot tell the difference between the two because they themselves are exploiters and not guided by any principle which forbids it.\n\nCare for your people. Do not exploit your people. Seek the betterment of your people. Serve your people. Love your people. There's the principle, put to different words.",
				"added": 1565630990
			},
			{
				"comment_id": 22,
				"body": "> [almostsoul](#comment_15_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): I wrote a long response and then accidentally pressed some key shortcut to go back a page, so rip. \n\nAh, I hate when that happens... That and power outages are why I sometimes type up my post in another program that saves as I go.\n\n> [almostsoul](#comment_15_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): meaning these large trading companies benefit the most from pumping up the value of stocks as much as possible, without the moderate voices of smaller traders interfering\n\nI would probably believe that explanation if not for the fact that Bitcoin is basically a stock. The price of Bitcoin has been heavily manipulated since the beginning and there's no government barrier preventing the little guy from getting in on that. Rather, there's been a non-stop pattern of pumping and dumping, as well as organized social engineering, to manipulate inexperienced investors into making stupid moves which the high capital guys can take advantage of. The result being that a lot of normal people gambled away their savings. At least I hope nobody took out a loan to invest in Bitcoin...\n\n> [almostsoul](#comment_15_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): The government has made treasury bonds virtually worthless because it makes it easier to pay off debts to foreign countries who have bought US treasury bonds\n\nI don't have blind faith in Statism. I know things can go bad, and they're definitely going bad right now. But that's because the government itself has gone bad and needs restoration. What form that takes is another matter, but something radical definitely needs to happen. I think Jefferson had the right idea when he was talking about the tree of Liberty needing to be refreshed every once in awhile. Even if you chop the tree down, a lot of trees have a tendency to sprout again from the stump. There will be a tree. The tree needs shaping.\n\n> [almostsoul](#comment_15_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): Online shopping and physical superstores save people money which then gets spent in other sectors of the economy, while making it more viable to buy houses and start families. \n\nThat's a major oversimplification of the dynamics at play here. Online stores can be a good thing. Amazon however cannot. It's a big box store, even if it's online. Tell me, do you like having all that power concentrated into the hands of that foreigner, Jeff Bezos? (His citizenship is irrelevant. He's not ethnically American.) Does he build up his host nation and perpetuate its values? Is he truly a benefactor of the people that support him, whether workers or customers?\nhttps://www.geekwire.com/2019/jeff-bezos-portfolio-heres-amazon-chief-invested-billions/\nhttps://finance.yahoo.com/news/jeff-bezos-quietly-betting-15-100700301.html\nhttps://www.investopedia.com/articles/markets/101615/what-jeff-bezoss-portfolio-looks.asp\nLooks to me like he's a destructive force upon the fabric of American society that's attempting to reshape it to his own ends.\n\nAs for superstores saving people money, how do you figure that? I like to get my meat from a small, locally owned market on some back road where hunters take their stuff to get it butchered. The meat I get there is fresh, full of nutrition, so delicious. No crazy preservatives or chemicals, just good meat. The price is pretty great too. If I go to any of the superstores in my area, the quality of the meat is terrible... It's always higher priced too. It tastes like ass compared to the local stuff and the nutritional value is inferior. If a Walmart or something opened up closer to that location, they would undoubtedly put this little market out of business by the methods I described in my previous post and I'd be up a creek without a paddle. Then they would jack up the prices like the other superstores have done around here.\n\nNow correct me if I'm wrong, but that's an arrangement that would be detrimental to me as the consumer, no? I'd be forced to eat awful meat that was probably imported from out of state and pumped full of God-knows-what. The same thing is true of the vegetables. When I go to any superstore in my area, pretty much all the vegetables are from Mexico, Arizona, or Commiefornia. Meanwhile my entire state is prime farming territory. There's literally no reason to be importing this garbage when we've got local farmers, other than that it makes the shareholders more sheckles. This is another great contrast between business and capitalism.\n\nThere's also the tiny problem, which ties into all of this, that the Free Market also has no mechanisms to protect the nation's workers from cheap foreign labor. That's the only reason it's cheaper for these superstores to buy from mega-farm operations in the south west... If that's the price of cheaper vegetables, then the price is far too high.",
				"added": 1565644100
			},
			{
				"comment_id": 23,
				"body": "> [cryptonrefuse](#comment_4_13Qv7muvCuG3BqEDzwYAdGtBzoD47Ls7K8): In other words, the free market doesn't even exist. \n\nOf course it doesn't exist. Because it can't exist. Not on a large scale or for any meaningful length of time. So I'm referring to the application of the conceptual principles of such a market.\n\n> [cryptonrefuse](#comment_4_13Qv7muvCuG3BqEDzwYAdGtBzoD47Ls7K8): Every corporation that holds a monopoly or is unable to be toppled organically is the result of state interference. \n\nA government will always form, if not by consent then by the use of force. Might always makes right in the end, like it or not. As such the government will either exercise its monopoly on the use of force to create conditions that are beneficial to the people that instituted it or it will create conditions that are beneficial to parasites. But there will be a government and it will create conditions. We have to work with what's in front of us, not with what we wish was there.\n\n> [almostsoul](#comment_16_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): But you're also saying that the state can be improved, and fixed? \n\nI'm saying that it MUST be, because there are no other options. Existing without a governing body for more than a brief period of time is impossible, especially for white people. If one does not exist, it will be formed. As you said, the state is compulsory by its nature.\n\n> [almostsoul](#comment_16_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): The state is compulsory by nature, and by design it can never be voluntary. \n\nYou're speaking in terms of the non-aggression principle, but I am not because I am not thinking in those terms. I understand your definition of voluntary. It's true that governments will never have 100% support of 100% of the people under its dominion for 100% of its actions at any given time, but there have been governments throughout history that have had some pretty damn high satisfaction levels. THAT is what I'm talking about.\n\nMight makes right and governments will always arise and will always place you under their dominion... That's what they do, exercise their monopoly on the use of force. You can either submit willingly or you will be subjegated, but either way there WILL be a government. Where your power lay is in, which government will have dominion over you? My suggestion is that there is a type of government which has demonstrated on several occasions superior outcomes for its subjects.\n\nThat's why I say that there is a Third Position. The \"forbidden\" position on these matters. Forbidden because the rich and powerful monsters, men that can barely be considered human anymore, that gamed the capitalistic system to gather unprecedented power to themselves and shut any potential competition out of the markets, FEARS that position. They fear it because it would mean the end of their reign of nightmare and it would return their stolen power back to the people.\n\nObviously when commiefags use such rhetoric, it's empty and we all know it's empty because we've seen on dozens of occasions what happens when the ideas of Marxism are actually implemented. It always ends in death, starvation, and more rape than anyone cares to think about... But although the stated goal is extremely similar, what I'm talking about has also been tried... The difference is that\n------it actually worked------\nand it did so on the first try. It really, honest to God, worked. It performed exactly as advertised. Hell, it literally put us on the moon for the first time. Look up where that technology came from, if you don't believe me.\n\n> [almostsoul](#comment_16_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): If people within the state wish to be free of it, then they are destroyed by it.\n\nIf those people are individuals, yes. But COLLECTIVES can potentially overrule the state and have done so all throughout history. That's what a revolution is. The reality is that government isn't supposed to be a parasite, it's supposed to be a symbiote. That's why you run into people constantly who have the naive expectation that their government is their ally and that it should be helping them. It's because a healthy government doesn't need to fear its people and does in fact care for them as a shepherd does his flock. Our peoples haven't fully understood the extent of the sickness that has infected western governments.\n\nMeanwhile you see the ubiquitous, widespread sickness of our age, understand that there is something deeply wrong, and have been lead to believe, through the introduction of a rigid legal paradigm, that that wrongness is intrinsic to the very concept of a government. I tell you that it is a lie by the very people who are the cause of this sickness to begin with. The lie normalizes the sickness and obscures the perpetrators.\n\nWhen a government gets too greedy, the host has a right and a duty to put the parasite in its place by whatever means necessary. This is one of those places where libertarians diverge from classical liberals. The American founders understood quite well that governments trend toward decay and need to be kept in line or otherwise reformed from time to time.\n\nThey also understood that governments were necessary for large bodies of people because there's always going to be somebody that has a monopoly on the use of force. You can either let that somebody arise spontaneously or you can work together with your people to create a somebody that's less parasitic and more symbiotic. As Dr. Walter Block puts it, if a slave has the opportunity to choose their master, there's nothing wrong with them doing so. Well we're all slaves... I offer you a master that's demonstrated his beneficence and competency.\n\n> [almostsoul](#comment_16_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): Why would a state improve if it has this kind of power of people? \n\nBecause people can be dangerous. Governments are not immovable monoliths and they are not gods.\n\n> [almostsoul](#comment_16_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): You're saying people like Jeff Bezos must adhere to a universal principle, that his economic activities ought to be for the benefit of the United States, yet the government itself is exempt from universal morals and ethics.\n\nNo, it is NOT exempt. A government is not a god. If you think only in individual terms, then there's nothing that you, ant as you admit you are, can do to hold it to account. But collectively it can be done and must be done, as our forefathers well understood. \n\nAnt, together we can defy gravity.\nhttps://www.youtube.com/watch?v=bUNKQqCRFuQ\nIf you want to achieve greatness, individuality cannot come at the expense of the good of the whole. The whole is your people, your blood, whether near or distant.\n\n> [almostsoul](#comment_16_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): The definition of \"the people\" whom the government is meant to serve is itself decided by the government. \n\nIt goes both ways. When a government crosses the line and turns against the host, the people can, should, and have in times past decided the definition of the government.\n\n>We the People of the United States, in Order to form a more perfect Union, establish Justice, insure domestic Tranquility, provide for the common defence, promote the general Welfare, and secure the Blessings of Liberty to ourselves and our Posterity, do ordain and establish this Constitution for the United States of America.\n\nEveryone always skips over the part where it says \"to ourselves and our Posterity.\"\n\"Our Posterity\" means blood. \"A people\" can only ever be racial and only \"a people\" can establish or reform a government. That is the way of things, the natural order.\n\n> [almostsoul](#comment_16_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): But that just turns state power into a weapon for groups to use against one another instead of negotiating.\n\nAre groups not already doing that, even in our multicultural paradises? The fact that these other groups are allowed within our territories in large numbers actually escalates the frequency and severity of group conflicts. That's the point.\n\nWhile whites are playing the individualism game and trying to reason with other peoples on the basis of ideas and values that these groups don't even care about, these rival peoples are forming organized collectives and destroying our civilizations from the inside. They frequently organize explicitly for the purpose of taking our stuff. They're parasites that are worse than the government itself. They're rewriting our laws, raising our taxes, voting in politicians that cater to them instead of us, crowding out our cultures, overloading both government and private social programs, siphoning resources from our communities and sending them back to their home countries, and I could easily keep going, but you get the point.\n\nI know you'll say, \"but they can only do that because of the government in the first place\", but that's irrelevant. Our governments weren't nearly this oppressive before Diversity, and we've got to deal with the situation as it exists before us. There is a government. There are hostile peoples within our midst. How are we going to improve this situation?\n\nWell that turned out longer than I expected...",
				"added": 1565703516
			}
		],
		"1565627986_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 21,
				"body": "> [bvcfbfbcbcvd](#comment_14_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7): I just hope that I will somehow find a way to get my sites \"out there\" for people to actually visit...\n\nIt's not a perfect solution, but there are ZeroNet proxies that let people view zites over the clear net... But they tend to disappear from time to time, so you have to keep up with which ones are currently available.",
				"added": 1565635367
			}
		]
	},
	"comment_vote": {
		"945_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"9_1DNJ1b7d7bqeZHigy35ZKBwwe8PBv8o7Gk": 1,
		"9_1A5NgDyiTqhcBgrm8SuSEhaygTXuc7ogt2": 1,
		"28_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": 1,
		"34_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"6_13Qv7muvCuG3BqEDzwYAdGtBzoD47Ls7K8": 1,
		"109_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1
	}
}