{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1553845855_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "> [filedropper](#comment_2_1Ar9D7DWtCHBepnH4fpDsxpW95evSGdgHE): use qBittorrent for private tracker then BiglyBT for public and i2p torrents similar to Vuze but actively developed.with the i2p plugin you can either connect via the client itself or your i2p client you already have running.works well with i2pd too https://i2pd.website/ [...]\n\ni2p for torrent is great by you are limited to slowest peer in your tunnel.",
				"added": 1615118280
			}
		],
		"1636133479_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 2,
				"body": "Tor 3 is curently working very bad. Shall we replace Tor exe to make it work?",
				"added": 1636813397
			},
			{
				"comment_id": 4,
				"body": "> [ssdifnskdjfnsdjk](#comment_165_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): did you try also Tor: enabled mode (not Tor Always) on the top of ZeroHello button? For more trackers use Syncronite.\n\nFixed it by updating Tor binarry",
				"added": 1636899066
			},
			{
				"comment_id": 5,
				"body": "> [smashbuckler](#comment_2_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): Yeah, that one issue is created by me :P Still messing with it on win. On my ubuntu machine I left original ZN bundle to compare how each one is working in different modes. For now it seems the most unstable (almost no trackers most of the time) is the TOR always mode on new fork, where I rarely see max 4 out of 50+ trackers active.\n\nYup I also get like 2 trackers. Also I noticed that running update all websites makes trackers go to 0.",
				"added": 1637059852
			}
		],
		"1548283717_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 6,
				"body": "> [ssdifnskdjfnsdjk](#comment_167_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): 5GB disk space used while having under 2 million torrents.So all torrents would be 50GB+ and i was having issue with this app, so i am removing it. Hard or unlikely to reach the point that you can use it as near-complete torrent database. I will rely on clearnet engines like TPB etc. Qbittorrent bittorrent client is having search function that uses multiple such engines to return the results.\n\nI mostly use private trackers :D",
				"added": 1637591452
			}
		]
	},
	"comment_vote": {}
}