{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1612510082,
			"title": "Сайт Инсайдера",
			"body": "Не знаю нужно ли это кому-нибудь сейчас\nНо все же, хочу поделится с вами двумя ссылками\n\n\nЭто одно из интервью которые давал Инсайдер.\nСергей Финько берет лично интервью у Инсайдера в Городе Нью Йорк. Сентябрь 2018 г.\nВидео не несет никакой агитационной подоплеки и является только лишь материалом для личного   исследования в поиске истины в этом  мире.\n\nСкачивать  видео запрещено, без разрешения  автора данного канала!\n\n\nhttps://www.youtube.com/watch?v=j8-7FbVcwMs&feature=emb_logo\n\nСайт Хранителей Ордина, в том числе в который должен входить и Инсайдер - https://www.evolution-simple.com/insiderorder#2",
			"added": 1612510081
		},
		{
			"topic_id": 1612616752,
			"title": "Граф Сен Жермен (1)",
			"body": "Сен-Жермен — загадочная фигура XVIII в. и других времён\n\nВ салонах Парижа граф появился внезапно. По некоторым сведениям, в 1743 году маршалом Франции Шарлем Фуке де Бель-Иль он был впервые представлен в высшем свете. Сен-Жермен быстро завоевал расположение столичного бомонда.\n\nграф Сен-ЖерменГраф Сен-Жермен\n\nНа вид это был человек среднего роста и телосложения, 40-50 лет, с пронзительными тёмными глазами. Одевался, как отзывался о нём барон де Глейхен, «с изысканной простотой». Отличительной чертой его туалета всегда было наличие драгоценных камней, украшающих пряжки туфель, ремня, табакерку и перстни на пальцах.\n\nОн был невероятно образован: разговаривал на всех европейских языках, а также арабском, русском, турецком и других, включая санскрит. К тому же, на всех языках разговаривал чисто, без акцента, как на родном.\n\nграф Сен-Жермен\n\nУвлекался историей, физикой. Одинаково превосходно разбирался, как в «Илиаде» Гомера, так и в химических процессах. Был прекрасным рассказчиком, виртуозным музыкантом (причём играл на разных инструментах: скрипке, клавесине, арфе, рояле), прекрасным художником.\nСтоличные барышни от него были в восторге, а знаменитый Казанова завистливо признавал, что «Сен-Жермен мог легко добиться расположения любой женщины». Однако сам граф оставался неподкупен женским прелестям.\n\n    Важно! Все его знания говорили о блестящем образовании, при этом отмечали, что добиться такого совершенства за одну человеческую жизнь просто невозможно.\n\nРазные упоминания о Сен-Жермене\n\nПроисхождение Сен-Жермена остаётся тайной, как и его истинный возраст. Вспоминая некоторые подробности своей жизни, он упоминал факты, согласно которым ему должно было быть несколько сотен лет.\n\nграф Сен-Жермен легенды\n\nОднажды пожилой графине фон Жержи показалось, что она встречала его, ещё будучи юной девушкой. С нескрываемым любопытством, она поинтересовалась у Сен-Жермена, не бывал ли его отец в Венеции 50 лет назад. Но граф ответил, что отец его к тому моменту давно скончался, а это был он сам. Графиня возразила, что если бы это было правдой, то ему было бы уже более 100 лет, и он ответил: «Увы, мадам, я правда очень стар».\n\nОднако знатность его происхождения сомнений не вызывала. Предполагали, что это внебрачный сын короля Португалии. Сам Сен-Жермен сообщал о своей принадлежности к роду князя Ракоци из Трансильвании и что был отдан в младенчестве на попечение герцога де Медичи.\n\nА. С. Пушкин пишет в своей «Пиковой даме», что старухе-графине подсказал злосчастные три карты именно Сен-Жермен, который был таинственной фигурой, невероятно богатым и всезнающим мистиком.\n\nПушкин Пиковая дама\n\n    Справка! Вся его жизнь была окутана тайной. Его часто видели в разных странах, в разное время. При этом, кроме места жительства, он менял и титул, и имя. Англия, Германия, Персия, Голландия, Индия, Россия — лишь небольшой перечень посещённых им стран. Граф Белламар, маркиз ди Монферра, принц Ракоши, граф Цароги, лорд Уэлдон, граф Салтыков — некоторые из имён, под которыми он был известен.\n\nПравда, в то время появилось много подражателей Сен-Жермена, но свидетельства лично его знавших людей, не оставляют сомнений.\n\nЕго подозревали в шпионаже, в многочисленных заговорах. В 1745 году на территории Англии, графа арестовали, но после допросов отпустили.\n\nВ 1757 г. король Франции предоставил Сен-Жермену замок де Шамбор, в котором была оборудована лаборатория для исследований.\n\nзамок Шарбор\n\nВ 1760 г. по какой-то причине граф покидает Францию. По одним сведениям, у него произошёл конфликт с королём, из-за каких-то якобы фальшивых алмазов. По другим — выполнял политическую миссию.\nСен-Жермен в России\n\nВ 1762 г. граф посетил Санкт-Петербург. Истинные причины этой поездки не известны. По одним данными, его пригласил граф Орлов, и Сен-Жермен участвовал в перевороте. По другим — он навещал своего друга, знаменитого художника Пьетро Ротари.\n\nПьетро Ротари художник и друг Сен-ЖерменаПьетро Ротари — художник и друг Сен-Жермена\n\nВ Петербурге Сен-Жермена познакомили с Юсуповыми, Голицыными, Разумовскими. Общался с известным торговцем драгоценных камней — Маньяком. Сен-Жермен помогал ему восстановить «природный блеск» повреждённых минералов.\n\nЖил граф возле Аничкова моста. Сколько там проживал, неизвестно. Его имя связывают с переворотом 1762 г., когда был свергнут Пётр III и на престол взошла Екатерина II. Так, исследователи Ф. Тастевен и И. Купер-Оукли в своих книгах утверждают непосредственное участие Сен-Жермена в свержении царя.\n\nЕкатерина II в молодостиЕкатерина II в молодости\n\nВпрочем, документальных подтверждений нахождения графа в этот промежуток времени в России нет, есть только косвенные доказательства из воспоминаний свидетелей тех лет. Так, маркграф Брандербург-Ансбахский вспоминал о душевной встрече Орлова — Чесменского и Сен-Жермена в Нюрнберге в 1774 г. По мемуарам одного служащего в русской армии немца, Григорий Орлов вспоминал о роли графа: «Если бы не он, то и ничего бы не произошло».\n\nСен-Жермена связывают с именем Одара, который был адвокатом при городской торговой палате, сыгравшим свою роль в перевороте. Однако известно, что адвокат не владел русским языком, в то время, как граф свободно на нём общался.\nТаинственные легенды\n\nПро необычные возможности графа ходили легенды. Например, что он настолько осведомлен в алхимии, что может делать золото и «лечить» треснутые драгоценные камни. Например, он восстановил алмаз с дефектом Людовику XV.\n\nЛюдовик XVЛюдовик XV\n\nСен-Жермен был несметно богат, но при этом вёл простой образ жизни, без излишеств, был умерен в еде. Судачили, что он продал душу дьяволу, но при этом он соблюдал многие церковные обряды и активно занимался благотворительностью. Отлично рисовал, самое мистическое — его картины необъяснимо  светились во тьме.\n\n    Интересно! Ходили слухи, что Сен-Жермен владеет секретом вечной жизни и умеет приготовить снадобье, сохраняющее молодость и излечивающее от всех болезней.\n\nИногда Сен-Жермен мог оговориться, что знаком с некоторыми древними правителями, философами. Так, например, его известная оговорка: «Я всегда говорил Христу, что он плохо кончит».\n\nГоворили, что граф владеет магическим зеркалом, способным показывать будущее. Вроде бы Людовик XV увидел своего обезглавленного внука-дофина и был страшно напуган.\n\nГоспоже де Помпадур Сен-Жермен якобы подарил конфетницу с агатом на крышке, который под воздействием тепла превращался в изображение красивой пастушки с овечками.\nУмер или исчез Сен-Жермен?\n\nСмерть Графа также окутана тайной, как и его появление на свет. Официально он умер 27 февраля 1784 г. в Эккенфёрдве, герцогство Шлезвиг. Похоронили его 2 марта, но место захоронения неизвестно.\n\nШлезвиг-Гольштейн\n\n    Важно! Спустя время его неоднократно видели живым. Например, в 1785 г. на встрече масонов его имя фигурировало в списке участников. Ходили слухи о его встрече с Екатериной II в 1786 г.\n\nВ 1814 г. мадам де Жанлис, помнившая Сен-Жермена в молодости, увидела его в Вене, удивилась, что граф ни капли не изменился. Правда, быстро ретировался от объятий дамы. Возможно, просто напоминающий графа человек не захотел расстраивать старушку.\n\nФелисия де ЖанлисФелисия де Жанлис\n\nДаже спустя века остаются люди, верующие в бессмертие графа Сен-Жермена. Так, в США существует секта баллардистов — почитателей графа. А некоторые люди верят, что он до сих пор живёт где-то среди нас.\n\nhttps://spokenword.ru",
			"added": 1612616750
		},
		{
			"topic_id": 1614088999,
			"title": "Суть действий представителей россиянской власти или Новое откровение Инсайдера",
			"body": "Видя истерию нынешней власти, то, что следует ниже имеет свою логику, для тех кто\nхочет понять и разобраться что происходит не только с Россией но и с миром.\n\n— План, конечно, есть. Но лицедеи в него не посвещены, ибо они — безвольные пешки на мировой шахматной доске, видящие лишь на клетку впереди. В действительности, эти «избранники» полностью под контролем закулисы и действуют в строго очерченных рамках, не имея ни возможности, ни способностей самостоятельно принимать ключевые решения. Сейчас до них доходит, что их хозяева, готовясь к уходу из России, стравливают их между собой и, тем самым, цинично их сливают как «козлов отпущения» для заметания следов. Весь «хитрый план» — лишь оттягивание неизбежного конца преступного режима и чем больше оттягивание — тем более он преступный. Хотя, в то же время, плавное ослабление всё же выгодней резкого краха. Надо признать — это были когда-то лучшие офицеры, но сама система взаимоотношений, основанная на предательстве вследствие стратегического проигрыша вынуждает их играть по правилам бесов и за это придётся ответить по полной программе. Это расплата за цепочку предательств народу в целом, условия, что заставляют нас осознать причины духовного падения. Меняться же они не хотят и не могут, ибо тогда нужно будет опереться на прогрессивных людей вне системы с новыми идеями устройства общества и технологиями, но бесы такого позволить не могут, ибо тогда Русь станет мировым лидером — отсюда закручивание гаек и постоянное враньё. И грядущий неизбежный взрыв, где на первый план неизбежно выйдут люди с готовыми решениями, но для этого народу в целом по старой традиции требуется совокупность жареного петуха, рака на горе и мужика, что крестится.            \n\nhttps://yarrus.com/grimnir",
			"added": 1614088996
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1608389430_1FDTZFfBPvZULBwYbKdrB1Qi8bWhhMXSNj": [
			{
				"comment_id": 1,
				"body": "Потому что наткнулся на ту группу людей которых искал (одного из них - Инсайдера)\nМало что понимаю в Свободном интернете, но это здорово, что есть такой сайт как этот. Который только использует пиры и шифрование данных. Спасибо создателю этого сайта. Может быть тут найдется что нибудь интересное.",
				"added": 1610797765
			}
		],
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 2,
				"body": "+1",
				"added": 1610797961
			}
		],
		"2_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": [
			{
				"comment_id": 3,
				"body": "Узнал через Инсайдера когда он давал ссылку на счёт (который зачисляется через Биткоины)",
				"added": 1610801474
			}
		],
		"1612616752_1Gbwkkeq9Uq7vKhigxExP8Wnjs7fBEWWKR": [
			{
				"comment_id": 4,
				"body": "Граф Сен Жермен - Эль Мория (2)\n \n\nБыл ли граф Сен Жермен воплощением Эль Мория Эль Мория — это вознесенный владыка мира, один из учителей человечества. Такое определение ему дают эзотерики разных периодов истории. Если говорить о разделах эзотерики и философии, то Эль Мория наиболее часто встречается в литературе о Агни-Йоге или Живой Этике, а также теософских трудах различных авторов. Эль Мория — один из Махатм, незримых учителей, которые являются избранным ими людям и передают знания, в которых нуждается мир на данный момент. Самые первые упоминания о таких учителях человечества встречаются у Елены Блаватской. В своих книгах Елена Петровна Блаватская писала, что именно ее учитель Эль Мория помог ей основать Теософское общество и добиться других целей. Она утверждала, что несколько раз ей удавалось увидеть его в реальной жизни. эль мория Эль Мория Еще один автор, которая упоминала общение с Эль Мория — Елена Ивановна Рерих. Последняя утверждала, что способна общаться с учителем на расстоянии, с помощью телепатического письма. Большинство ее трудов основаны на знаниях, полученных в результате этого общения. В целом, Эль Мория — это внеземной разум, который заботится о том, чтобы человечество всегда получало нужные ему знания. Биография Сен Жермена покрыта тайной. Неизвестна ни дата его рождения, ни настоящее имя. У графа было множество псевдонимов, его считали мошенником, но, даже несмотря на такую репутацию, алхимик пользовался доверием коронованных особ. Его можно назвать одним из самых загадочных персонажей легенд Европы. Если верить письмам и дневникам Казановы, графу был известен секрет вечной красоты и молодости. Никто не знал точного его возраста, но женщины, которые пользовались его рецептами, по словам Джакомо Казановы, выглядели намного моложе. Сохранились свидетельства о том, что графа многократно встречали его знакомые после его смерти. Он был жив и здоров, некоторым удалось с ним пообщаться. Речь идет о людях с отличной репутацией, например, Мария Антуанетта была предупреждена о начале революции именно этим магом. Одному из баронов удалось узнать о дальнейших планах легендарного алхимика. После встречи с ним Жермен собирался изобрести пароход и отправиться на столетний отдых в Гималаи. Гималаи — пристанище учителей человечества во время их нахождения на нашей планете. Елена Блаватская описывала, что Эль Мория был родом именно оттуда. Сложно сделать точный вывод, который ответит на вопрос — является ли граф Сен Жермен Эль Мория? Существует множество фактов из его биографии, которые указывают именно на это. Считается, что он пришел в наш мир для того, чтобы дать людям знания, пользоваться которыми просто необходимо. Возможно, наследие Сен Жермена окажется полезным именно для вас. Всемирная служба Сен Жермена — что это такое всемирная служба сен жермена Граф Сен Жермен Всемирная служба Сен Жермена — это трансляции, которые доступны на русском и английском языках. Послушать их можно, следуя расписанию на официальном сайте службы, которая проводит трансляции. Службы Сен Жермена можно послушать раз в две недели, по субботам. Кроме служб, которые касаются Сен Жермена, можно послушать множество других лекций и конференций, которые посвящены похожим вопросам. Итак, на что же направлены всемирные службы Сен Жермена? По большей части, это призывы и молитвы, которые обращаются к Эль Мория, воплощением которого считается легендарный граф, Иисусу Христу и его ангелам. Встречаются также упоминания божеств из других культур, преимущественно восточной. Судя по текстам, которые произносятся во время трансляции службы, речь идет о просьбе помощи в борьбе с сахаром, шоколадом, курением и алкоголем. Сахар, шоколад, табак и спирт в любом виде проповедниками службы великого графа считаются злейшими врагами. Они представляют собой сущности, спасти от которых может только экзорцизм. Часть призывов направлена на спасение мира от рок-музыки, которая призывает в наш мир демонов и другие темные силы. Граф Сен Жермен — фиолетовое пламя сен жермен фиолетовое пламяЕсли верить людям, которые телепатически общались с легендарным графом, который жив по сей день и никогда не умирал на самом деле, Сен Жермен о фиолетовом пламени говорил довольно много. Он называл его новым знанием, которое необходимо человечеству. Считается, что учитель планеты заложил свое физическое тело для того, чтобы открыть людям доступ к нему. Если верить результатам телепатической связи различных операторов, которые в разное время пытались выйти на связь с легендарной личностью, в данный момент, в 21 веке происходит глобальная чистка всей планеты от кармических завалов. Каждый человек способен избавиться от своих личных «хвостов» с помощью знаний о том, как использовать для этого фиолетовое пламя — уникальные лучи энергии, которые всегда откликаются на призыв о помощи. По словам алхимика, фиолетовое пламя способно избавить человечество от множества катастроф различного характера, если достаточное количество людей будет использовать методику для очищения своей кармы. Каждый человек при этом работает не только для очистки своей личной кармы, но и старается для очищения всей планеты. Кроме этого, с помощью простых медитаций и призыва фиолетового пламени можно избавиться от множества психологических проблем родом из детства. Считается, что такие проблемы каждый человек приносит из прошлых жизней, с каждым новым перевоплощением добавляя к ним новые. Фиолетовое пламя способно трансмутировать все негативное в позитивное. Это касается не только негативной энергии, но и вполне материальных трудностей, например, конкретного заболевания. Это мощная очищающая сила, воздействие которой сразу же замечается. Особенно сильным оно будет в субботу — день, соответствующий этой энергетике. Однако заниматься призывом фиолетового луча можно хоть каждый день, никаких ограничений нет. Процесс занимает от 15 минут до часа-двух. Все, что нужно для того, чтобы воспользоваться мудростью одного из Махатм — это расслабиться, очистить сознание от посторонних мыслей и читать специальную мантру: Я есмь существо фиолетового пламени! Я есмь чистота, Богом желаемая! Эти слова вызывают поток фиолетовой энергии. Не всем удается почувствовать ее с первого раза. Обычно наблюдается ощущение покалывания, прилив энергии, жар. Вы можете даже почувствовать прикосновения светлых сущностей, которые пожелают вас навестить, а также увидеть некие видения. Некоторые во время таких практик открывают в себе экстрасенсорные способности, дремавшие до этого момента. Молитва Сен Жермена молитва сен жерменаМолитва Сен Жермена направлена на трансмутацию негативной энергии в позитивную. Ее можно использовать во время работы с фиолетовым пламенем с помощью медитации, которая описана выше. Текст молитвы такой: Вся энергетика вокруг меня — моя. А всё, что не моё, пусть уйдет и присоединится к той, где место есть ей. Всё моё — моё, чужого мне не надо. А от меня идет любовь и помощь всем, кто подумал обо мне, пусть хорошо иль плохо. Силою луча магического я переплавляю все минусы на плюсы. Пусть люди очистятся от темноты. Сожгут ее в себе, не засоряя темнотою ни пространство, ни других. Пусть будет так! Аминь. Под словами «магический луч» имеется в виду луч фиолетовой энергии, которая убирает весь негатив. Такие медитации могут стать хорошим вариантом чистки. Их можно применять для снятия порчи или сглаза, приворота и просто для улучшения настроения и самочувствия. Книга Поля Шакорнака «Граф Сен Жермен — хранитель всех тайн» граф сен жермен хранитель всех тайнКнига «Граф Сен Жермена — хранитель всех тайн» посвящена самому загадочному эзотерику и алхимику всех времен. В первую очередь, автор делает упор на биографические факты из жизни графа, а также сопоставляет их с историческими событиями, которые совпадают по времени с этими фактами. Автором книги стал соотечественник гениального алхимика и мага Поль Шакорняк. Он не делал главной целью разгадывание загадок в биографии Сен Жермена и не стремился заполнить фактами все ее белые пятна. Книга содержит самый подробный среди аналогичных книг об этом легендарном человеке анализ сохранившихся сведений о его биографии. Так, например, рассматривается одна из версий происхождения Сен Жермена: Мы находим первое упоминание о Ракоци как о предках графа в корреспонденции между д’Альвенслебенем — послом Пруссии в Дрездене и Фридрихом II. Последний поручил послу провести расследование о графе Сен-Жермене. Читаем в письме: «Его (графа) зовут князем Ракоци. Еще он мне сказал, что у него было два брата, мысли которых столь ничтожны, что они смирились со своей низменной судьбой. Зато он когда-то принял имя Сен-Жермен, что означает «святой брат». Первое издание было выпущено в 1947 году, а в 1948 году автор был премирован за лучшую работу о таинственном графе. Книга, несомненно, будет интересна тем, кого впечатляют легенды и факты об этом человеке. Сен Жермен — беседы о «Я есмь» сен жермен беседы о я есмьЕсли верить беседам Сен Жермена о «Я есмь», можно сделать вывод о том, что вознесенными учителями были даны специальные фразы, которые были созданы ими для гармоничного управления миром каждым из людей. Если использовать их достаточно активно, можно научиться управлять миром. Фраза «Я есмь» означает «Бог действует через человека». Если использовать это знание осознанно, можно добиться заметных результатов. Перевод фразы соответствует значению мантры ОМ, но воздействие ее может быть направлено на то, что нужно человеку на данный момент. Так, например, для того, чтобы получить материальный достаток, можно время от времени говорить так: Я есмь благополучие, изобилие, субстанция, ставшие совершенными в моём мире, для каждой конструктивной идеи, которую я могу замыслить и пожелать. Для того, чтобы устранить разлад и ссоры в доме: Я есмь Присутствие, повелевающее наполнить мой дом и всю его окружающую среду Миром, Любовью и Гармонией. Мантра изобилия от Сен Жермена Мантра изобилия от Сен Жермена действует очень быстро. Результаты обычно более, чем оправдывают ожидания. Читать мантру следует ежедневно, по три, девять или двенадцать раз: Я есмь без страха и сомненья Прогоню нужду, лишенья, Свыше сходит, ныне знаю, — Дар изобилия — помощь благая. Я есмь рука фортуны Божьей, Что богатства света льёт, Изобилие благое От нужды прочь уведёт. Текст мантры содержит магические слова «Я есмь», которые напоминают о том, что полученная помощь будет исходить от Бога, действующего руками каждого человека. Для того, чтобы мантра лучше работала, можно читать ее группами. Читать нужно вслух. В целом, наследие Сен Жермена может пригодиться каждому человеку. Люди, которым удавалось пообщаться с воплощением Эль Мория, отмечают, что он говорил о важности выполнения рекомендаций всеми людьми, которые живут на планете. Работа с фиолетовым пламенем будет помогать не только оператору, который практикует методику, но и всему человечеству. Источник: © https://grimuar.ru/mediums/legends/sen-zhermen-kak-voploshhenie-el-moriya.html#h2_4",
				"added": 1612617074
			}
		]
	},
	"comment_vote": {}
}