{
	"next_comment_id": 17,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [calmaquesse](#comment_1_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): \"Лабиринт отражений\"? :3\n\nКонечно. Шикарная книга.",
			"post_id": 1,
			"date_added": 1525025429
		},
		{
			"comment_id": 2,
			"body": "> [geekless](#comment_1_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Если у государства есть возможность взять хостера за жопу, VPN ничего не добавляет к безопасности.\n\nБезусловно нужно использовать впн вне определенных юрисдикций. Смотря для каких целей. Одно государство может не взаимодействовать в этом плане с другим.",
			"post_id": 4,
			"date_added": 1525158023
		},
		{
			"comment_id": 3,
			"body": "> [calmaquesse](#comment_3_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Большое спасибо, Стрелок. Восхитительная статья. И радует, что всё расписано именно под Линукс.\n\nПод Windows я бы не рекомендовал пробовать избавиться от слежки и утечек. Дело гиблое.",
			"post_id": 5,
			"date_added": 1525210575
		},
		{
			"comment_id": 4,
			"body": "> [calmaquesse](#comment_4_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Небольшой вопрос по Telegram - разве сквозное шифрование в MTProto не применяется в любых чатах?\n\nТолько в secret чатах",
			"post_id": 6,
			"date_added": 1525630835
		},
		{
			"comment_id": 5,
			"body": "> [calmaquesse](#comment_5_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): А обычные что, просто плейнтекстом передаются? \n> Кстати, а насколько вообще анонимна регистрация через СМС-сервис? Остаются ли какие-либо следы?\n\nЧерез обычный ssl до сервера.\n\nНепонятно какие следы имеются ввиду. След регистрации с вышки провайдера, т.е местоположение сим-банка сервиса, который использован. Следовательно если дело кому-то очень интересно могут прижать владельца сервиса.  А так в telegram перепривязка следующим смс и вот ты уже не владелец этого аккаунта. Не очень мягко говоря. И все обычные чаты, переписка в каналах доступна новому владельцу. Часто одноразовые смс симки дохнут и потом старый номер может получить новый человек.",
			"post_id": 6,
			"date_added": 1525631382
		},
		{
			"comment_id": 6,
			"body": "> [calmaquesse](#comment_6_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Для предупреждения похищения аккаунта через номер в Телеграме есть двухфакторная аутентификация.Но вообще, меня всегда удивляло, что в десктоп-версии по какой-то причине так и не завезли анонимные чаты.\n\nЭто топ да.",
			"post_id": 6,
			"date_added": 1525632298
		},
		{
			"comment_id": 7,
			"body": "> [calmaquesse](#comment_7_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Кстати, небольшой request, Леонид: можно в ближайшее время гайд по безопасным DNS и их настройке?\n\nУчту. Может будет.",
			"post_id": 6,
			"date_added": 1525784546
		},
		{
			"comment_id": 8,
			"body": "> [pumba](#comment_1_1A46oGiyZMuMGGnUcNTBUD1M5JugBzxCWQ): А в чем разница между Signal и Silence?И почему prism-break рекоммендует именно его?Так-же слышал что создатели Tor сделали свою прошивку андроида и в ней используют именно Silence.\n\nSilence - это опенсорс приложение, основанное на старых исходный кодах signal и использующее в качестве способа передачи информации обычные смс. На самом деле хорошая вещь, наверное единственное для шифровки обычных смс end-to-end без интернета. ",
			"post_id": 6,
			"date_added": 1525811945
		},
		{
			"comment_id": 9,
			"body": "Да распределение доверия согласно уровням - это безусловно правильно. Я просто к тому, что бывает достаточно часто, что люди неверно определяют кому и что можно доверить.  ",
			"post_id": 7,
			"date_added": 1525814325
		},
		{
			"comment_id": 10,
			"body": "> [geobor](#comment_1_14kxkh1pLNYuCwCZ161HCQkSjvWW29ybNz): последних лет с их социальным индексом\n\nНасчет соц. индекса неплохо было показано в некоторых сериях Черного Зеркала. \n",
			"post_id": 7,
			"date_added": 1525984026
		},
		{
			"comment_id": 11,
			"body": "> [anotherneko](#comment_2_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): У monero есть огромный недостаток - только один адрес, что делает возможным идентификацию пользователя по нему.\n\nЕсть такое. В принципе ничто не мешает создать новые кошельки для вывода средств. А принимать на один. Главное не пересекать его ни с чем. ",
			"post_id": 8,
			"date_added": 1527693287
		},
		{
			"comment_id": 12,
			"body": "> [capdoki](#comment_1_1Pc2q4qAeEpfsfCi3GSwApiMcfYtudVEPL): Никому не доверять, жить там, где все тебе - враги, а человек человеку - волк...\n\nЕсть исключения, но они обычно подтверждают правило. А про конкретный круг мой лично я ничего не говорил. Да в статье есть некоторое преувеличение, однако по опыту и не только моему стоит придерживаться  дистанции в  разглашении опасной для тебя информации в чужие руки. Иначе это чревато. Поверь я знаю, о чем говорю.\n\n",
			"post_id": 7,
			"date_added": 1527849611
		},
		{
			"comment_id": 13,
			"body": "> [anotherneko](#comment_3_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Вот в приеме и проблема. \n\nЯ понял. Желательно не пересекать в разных местах. Для совсем параноиков придется создавать и для приема новые кошельки. Благо с полной нодой это не напрягает. Один кошелек для приема нужен, если он светится глобально, вроде указания на сайтах для пожертвований. Тогда годится. Если нужно получать левые средства путем обмена с разных источников, тогда да желательно новые. ",
			"post_id": 8,
			"date_added": 1527849967
		},
		{
			"comment_id": 14,
			"body": "> [qiwi](#comment_1_1GP11T6BYKsTz63srBNo43iTjZaX461o3i): А www.searx.me нельзя пользоваться?\n\nВ простом варианте можно использовать инстансы сообщества, но это не путь полной паранойи. Неизвестно кем и как они используются.",
			"post_id": 5,
			"date_added": 1527856134
		},
		{
			"comment_id": 15,
			"body": "> [qiwi](#comment_2_1GP11T6BYKsTz63srBNo43iTjZaX461o3i): deepstrelok, ого, как быстро ты ответил. :) \n\nСейчас некоторое затишье после месяца подъема в ру-сегменте. Вероятно из-за начала лета. Я однако буду на связи.",
			"post_id": 5,
			"date_added": 1527884808
		},
		{
			"comment_id": 16,
			"body": "> [reflevmas](#comment_1_1FqhDHg7XD7jCemGBNYVSPEWLERCjgmAJo):а наоборот нужно максимально расспросранять.\n\nЕсть идеи как?",
			"post_id": 4,
			"date_added": 1620568863
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}