{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1529980053,
			"title": "Open call for a Mincecraft Server",
			"body": "Hello everybody,\nI'm making an open call for everybody to join a Minecraft server. First off, let me address some concerns and questions.\n\n1. Minecraft? Are you 11?\n- I am aware of this issue, and no I am not 11!\n2. Where am I playing this?\n- On PC, version 1.12.2\n3. Where do I sign up?\n- Just zeromail me your username to be added to the whitelist, I will reply with the IP\n4. Why are you making the call on here?\n- I want to see what everybody on here is capable of building! It could be fun!\n\nGive it some consideration, I hope to see some of you online!",
			"added": 1529980052
		}
	],
	"topic_vote": {
		"1529980053_1PEwoQaCpUi6D6p23xswE4H4mZXBnafr5F": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1529456113_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "Very sad stuff. What confuses me is that if the republicans are thinking that these immigrants will cost us jobs and therefore money, then why are we giving them and their kids separate living conditions for weeks or months?! Would it not make more sense just to make them exit immediately instead of separating and housing them like they are?",
				"added": 1529757235
			},
			{
				"comment_id": 3,
				"body": "> [styromaniac](#comment_135_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): There's no money in booting them out. [...]\n\nI like a good conspiracy! You are right though, there is a corporate benefit to keeping them in. A labor force that will work for cheap in terrible conditions. They are desperate and that desperation is exploited for a quick dime.",
				"added": 1529798915
			}
		],
		"1529663595_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 2,
				"body": "I could not agree more! Nowadays people don't want to consider their own mortality or reality. People don't want to be negative or deep they just want to act like they are. The problem is they just don't realize that even though being existential might seem negative, it has many positive benefits as well! Maybe if comedy could convey this message it would have a much better effect on people.",
				"added": 1529757552
			}
		],
		"1529980053_1PEwoQaCpUi6D6p23xswE4H4mZXBnafr5F": [
			{
				"comment_id": 4,
				"body": "It seems like the question formatting was automatically changed when I made the post. It still all makes sense but keep that in mind.",
				"added": 1529980523
			}
		]
	},
	"comment_vote": {
		"146_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1
	}
}