{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1,
			"title": "O Apocalipse de João",
			"body": "#O Apocalipse de João \n\n\n\n \n\n#Prólogo \n\n\n- 1 \n\n\n1 Revelação de Jesus Cristo, que Deus lhe confiou para que mostrasse aos seus servos as coisas que devem acontecer em breve. Jesus a comunicou, através do seu anjo, ao seu servo João. 2 Este dá testemunho de que tudo quanto viu é palavra de Deus e testemunho de Jesus Cristo. 3 Feliz aquele que lê e aqueles que escutam as palavras da profecia e põem em prática o que nela está escrito. Pois o tempo está próximo.  \n\n\n#Introdução às visões \n\n\n4 João, às sete igrejas que estão na Ásia: A vós, graça e paz, da parte daquele ‘que é, que era e que vem’; da parte dos sete espíritos que estão diante do trono de Deus; 5 e da parte de Jesus Cristo, a testemunha fiel, o primogênito dentre os mortos, o soberano dos reis da terra. Àquele que nos ama, que por seu sangue nos libertou dos nossos pecados 6 e que fez  de nós um reino de sacerdotes para seu Deus e Pai, a ele a glória e o poder, pelos séculos dos séculos. Amém. \n\n7 Vede! Ele vem com as nuvens, e todo olho o verá – como também aqueles que o traspassaram. Todas as tribos da terra baterão no peito por causa dele. Sim. Amém! 8 “Eu sou o Alfa e o Ômega”, diz o Senhor Deus, “aquele que é, que era e que vem, o Todo-poderoso”. \n\n \n\n#Visão inaugural das sete cartas \n\n\n9 Eu, João, vosso irmão e companheiro na tribulação, e também no Reino e na constância em Jesus, encontrava-me na ilha de Patmos, por causa da Palavra de Deus e do testemunho de Jesus. 10 No dia do Senhor, entrei \\em êxtase, no Espírito, e ouvi atrás de mim uma voz forte, como de trombeta, 11 a qual dizia: “O que vês, escreve-o num livro e envia-o às sete igrejas, a Éfeso, Esmirna, Pérgamo, Tiatira, Sardes, Filadélfia e Laodicéia”. 12 Então voltei-me para 1\n\nver a voz que me falava e, ao voltar-me, vi sete candelabros de ouro. 13 No meio dos candelabros havia alguém semelhante a um filho de homem, vestido com uma túnica comprida e com uma faixa de ouro em volta do peito. 14 Sua cabeça e seus cabelos eram brancos como lã alvejada, igual à neve, e seus olhos eram como chama de fogo. 15 Seus pés pareciam de bronze incandescente no crisol, e sua voz era como o fragor de águas torrenciais. \n\n16 Na mão direita, tinha sete estrelas, de sua boca saía uma espada afiada, de dois gumes, e seu rosto era como o sol no seu brilho mais forte. 17 Ao vê-lo, caí como morto a seus pés, mas ele pôs sobre mim sua mão direita e disse: “Não tenhas medo. Eu sou o Primeiro e o Último, 18 aquele que vive. Estive morto, mas agora estou vivo para todo o sempre. Eu tenho a chave da Morte e da Morada dos mortos. 19 Escreve pois o que viste, aquilo que está acontecendo e o que vai acontecer depois. 20 Este é o significado secreto das sete estrelas que viste na minha mão direita, e dos sete candelabros de ouro: as sete estrelas são os anjos das sete igrejas, e os sete candelabros são as sete igrejas.  \n\n \n\n#Éfeso \n\n \n\n- 2 \n\n\n1 “Ao anjo da igreja que está em Éfeso, escreve: ‘Assim fala aquele que segura na mão direita as sete estrelas, aquele que está andando no meio dos sete candelabros de ouro: 2 \n\nConheço a tua conduta, o teu esforço e a tua constância. Sei que não suportas os maus. \n\nPuseste à prova os que se dizem apóstolos e não o são, e descobriste que são mentirosos. 3 És perseverante. Sofreste por causa do meu nome e não desanimaste. 4 Mas tenho contra ti que abandonaste o teu primeiro amor. 5 Lembra-te de onde caíste! Converte-te e volta à tua prática inicial. Se, pelo contrário, não te converteres, virei e removerei o teu candelabro do seu lugar. 6 Mas em teu favor tens isto: detestas a prática dos nicolaítas, a qual também eu detesto. 7 Quem tem ouvidos, ouça o que o Espírito diz às igrejas. Ao vencedor darei como prêmio comer da árvore da vida, que está no paraíso de Deus’. \n\n\n#Esmirna \n\n\n8 “Ao anjo da igreja que está em Esmirna, escreve: ‘Assim fala o Primeiro e o Último, aquele 2\n\nque esteve morto, mas voltou à vida: 9 – Conheço tua tribulação e tua pobreza. Contudo, és rico. Conheço também a blasfêmia da parte dos que se dizem judeus, mas na realidade não são judeus, e sim, uma sinagoga de Satanás. 10 Não tenhas medo dos sofrimentos que vais passar. O diabo lançará alguns dentre vós na prisão. Assim sereis colocados à prova. Tereis uma tribulação de dez dias. Sê fiel até à morte, e eu te darei a coroa da vida. 11 Quem tem ouvidos, ouça o que o Espírito diz às igrejas. O vencedor não será atingido pela segunda morte’. \n\n \n\n#Pérgamo \n\n\n12 “Ao anjo da igreja que está em Pérgamo, escreve: ‘Assim fala o que tem a espada afiada,de dois gumes: 13 – Conheço o lugar onde moras: é onde está o trono de Satanás. Mas tu conservas o meu nome e não renegaste a fidelidade para comigo, nem mesmo nos dias em que Antipas, minha testemunha fiel, foi morto entre vós, aí onde mora Satanás. 14 Contudo,tenho algumas coisas contra ti: tens no teu meio adeptos da doutrina de Balaão. Este ensinou Balac a fazer Israel tropeçar, isto é, prostituir-se e comer carne sacrificada aos ídolos. 15 Do mesmo modo, tu admites também adeptos da doutrina dos nicolaítas. 16 Converte-te, portanto. Senão, virei a ti depressa e lhes farei guerra com a espada que sai de minha boca. 17 Quem tem ouvidos, ouça o que o Espírito diz às igrejas. Ao vencedor darei o maná escondido e lhe darei uma pedrinha branca, na qual estará escrito um nome novo, que ninguém conhece, a não ser quem a recebe’.  \n\n \n\n#Tiatira \n\n\n18 “Ao anjo da igreja que está em Tiatira, escreve: ‘Assim fala o Filho de Deus, aquele que tem os olhos como chama de fogo e os pés como bronze: 19 – Eu conheço a tua conduta, teu amor e tua fidelidade, teu serviço e tua perseverança, e as tuas obras recentes, mais numerosas ainda que as do início. 20 Mas tenho contra ti que toleras essa mulher, Jezabel, que se diz profetisa, mas ensina e seduz os meus servos a se prostituírem e a comerem carne sacrificada aos ídolos. 21 Eu lhe dei prazo para se converter, mas ela não quer converter-se de sua prostituição. 22 Vou prostrá-la de cama, e lançar numa grande tribulação os que se prostituem com ela, se não se converterem de sua conduta. 23 Farei morrer os seus filhos, e então, todas as igrejas vão saber que eu sou aquele que sonda os sentimentos e os corações, e que vou retribuir a cada um de vós conforme sua conduta. 24 A vós, porém, os outros em Tiatira, que 3\n\nnão seguis essa doutrina e não quisestes conhecer as ‘profundezas’ de Satanás – como dizem \n\n–, não vos imponho outra obrigação. 25 Mas segurai bem o que tendes, até que eu venha. 26 E \n\nao vencedor, ao que guardar até o fim as minhas obras, eu lhe darei poder sobre as nações; 27 \n\ne ele as governará com cetro de ferro, e elas se quebrarão como vasos de argila. 28 Pois assim como recebi do meu Pai este poder, darei ao vencedor a estrela da manhã! 29 Quem tem ouvidos, ouça o que o Espírito diz às igrejas.’  \n\n\n#Sardes \n\n\n- 3 \n\n\n1 “Ao anjo da igreja que está em Sardes, escreve: ‘Assim fala aquele que tem os sete espíritos de Deus e as sete estrelas: – Conheço a tua conduta. Tens fama de estar vivo, mas estás morto. \n\n2 Vigia! Reaviva o que te resta, e que estava para morrer! Pois não acho perfeitas aos olhos do meu Deus as tuas obras. 3 Lembra-te daquilo que tens aprendido e ouvido. Observa-o! \n\nConverte-te! Se não estiveres vigilante, virei como um ladrão, sem que tu saibas em que hora vou te surpreender! 4 Todavia, aí em Sardes existem algumas pessoas que não mancharam suas vestes. Estas vão andar comigo, 5 O vencedor vestirá vestes brancas, e não apagarei o seu nome do livro da vida, mas o apresentarei diante de meu Pai e de seus anjos.6 Quem tem ouvidos, ouça o que o Espírito diz às igrejas’. \n\n\n#Filadélfia \n\n\n7 “Ao anjo da igreja que está em Filadélfia, escreve: ‘Assim fala o Santo, o Verdadeiro, que tem a chave de Davi, aquele que abre e ninguém fecha, e que fecha e ninguém abre: 8 – \n\nConheço a tua conduta. Vê, eu abri à tua frente uma porta e ninguém a poderá fechar. Pois tua força é pequena, mas guardaste a minha palavra e não renegaste o meu nome. 9 Olha! Eu te entrego uma parte da sinagoga de Satanás, daqueles que se dizem judeus e na realidade não o são, mas são mentirosos. Vou fazer com que venham prostrar-se diante de teus pés, e reconhecerão, então, que eu te amo. 10 Já que guardaste a minha ordem de perseverar, também eu te guardarei da hora da provação que está para vir sobre todo o universo, para pôr à prova os habitantes da terra. 11 Eu venho logo! Guarda bem o que recebeste, para que ninguém roube a tua coroa. 12 Do vencedor farei uma coluna no Santuário do meu Deus, e daí não sairá. Nela gravarei o nome do meu Deus, e o nome da cidade do meu Deus, a nova 4\n\nJerusalém, que desce do céu, de junto do meu Deus. E gravarei nela também o meu novo nome. 13 Quem tem ouvidos, ouça o que o Espírito diz às igrejas’.  \n\n\n#Laodicéia \n\n\n14 “Ao anjo da igreja que está em Laodicéia, escreve: ‘Assim fala o Amém, a testemunha fiel e verdadeira, o princípio da criação de Deus: 15 Conheço a tua conduta. Não és frio, nem quente. Oxalá fosses frio ou quente! 16 Mas, porque és morno, nem frio nem quente, estou para vomitar-te de minha boca. 17 Tu dizes: ‘Sou rico e abastado e não careço de nada’, em vez de reconhecer que és infeliz, miserável, pobre, cego e nu! 18 Dou-te um conselho: compra de mim ouro purificado no fogo, para ficares rico, e vestes brancas, para vestires e não aparecer a tua nudez vergonhosa; e compra também um colírio para curar os teus olhos, para que enxergues. 19 Eu repreendo e educo os que eu amo. Esforça-te, pois, e converte-te. 20 Eis que estou à porta e bato; se alguém ouvir minha voz e abrir a porta, eu entrarei na sua casa e tomaremos a refeição, eu com ele e ele comigo. 21 Ao vencedor farei sentar-se comigo no meu trono, como também eu venci e estou sentado com meu Pai no seu trono. 22 Quem tem ouvidos, ouça o que o Espírito diz às igrejas’.”  \n\n\n#A liturgia celeste \n\n\n- 4 \n\n\n1 Depois disso, vi uma porta aberta no céu, e a voz que antes eu tinha ouvido falar-me como trombeta, disse: “Sobe até aqui, para que eu te mostre as coisas que devem acontecer depois destas”. 2 Imediatamente, fui movido pelo Espírito. Havia no céu um trono e, no trono, alguém sentado. 3 Aquele que estava sentado tinha o aspecto de uma pedra de jaspe e cornalina; um arco-íris envolvia o trono com reflexos de esmeralda. 4 Ao redor do trono havia outros vinte e quatro tronos; neles estavam sentados vinte e quatro anciãos, todos eles vestidos de branco e com coroas de ouro na cabeça. 5 Do trono saíam relâmpagos, vozes e trovões. \n\nDiante do trono estavam acesas sete lâmpadas de fogo, que são os sete espíritos de Deus. 6 Na frente do trono havia como que um mar de vidro cristalino. No centro, em redor do trono, havia quatro Seres vivos, cheios de olhos pela frente e por detrás. 7 O primeiro Ser vivo era semelhante a um leão; o segundo era semelhante a um touro; o terceiro tinha rosto de homem; o quarto era semelhante a uma águia em pleno vôo. 8 Cada um dos quatro Seres vivos tinha 5\n\nseis asas, cobertas de olhos ao redor e por dentro. Dia e noite, sem parar, proclamavam: \n\n“Santo! Santo! Santo! Senhor Deus Todo-poderoso, aquele ‘que é, que era e que vem’!” 9 Os seres vivos davam glória, honra e ação de graças ao que estava sentado no trono e que vive para sempre. 10 E cada vez que os Seres vivos faziam isto, os vinte e quatro anciãos se prostravam diante daquele que estava sentado no trono, para adorar o que vive para todo o sempre. Depunham suas coroas diante do trono de Deus e diziam: 11 “Tu és digno, Senhor, nosso Deus, de receber a glória, a honra e o poder, porque criaste todas as coisas. Por tua vontade é que elas existem e foram criadas”. \n\n\n#O Cordeiro e o livro selado \n\n\n- 5 \n\n\n1 Vi, depois, na mão direita daquele que estava sentado no trono, um livro, um rolo escrito por dentro e por fora, lacrado com  sete selos. 2 Vi então um anjo forte, que proclamava em alta voz: “Quem é digno de romper os selos e abrir o livro?” 3 Ninguém no céu, nem na terra, nem debaixo da terra era digno de abrir ou de olhar o livro. 4 Eu chorava muito, porque ninguém fora considerado digno de abrir ou de olhar o livro. 5 Um dos anciãos me disse: \n\n“Não chores! Vê, o leão da tribo de Judá, o rebento de Davi, saiu vencedor. Ele pode romper os selos e abrir o livro”. 6 Então, vi um Cordeiro. Estava no centro do trono e dos quatro Seres vivos, no meio dos Anciãos. Estava de pé, como que imolado. O Cordeiro tinha sete chifres e sete olhos, que são os sete Espíritos de Deus, enviados por toda a terra. 7 Então o Cordeiro veio receber o livro, da mão direita daquele que está sentado no trono. 8 Quando ele recebeu o livro, os quatro Seres vivos e os vinte e quatro Anciãos prostraram-se diante do Cordeiro. Todos tinham harpas e taças de ouro cheias de incenso, que são as orações dos santos. 9 E entoaram um cântico novo: “Tu és digno de receber o livro e de abrir-lhe os selos, porque foste imolado, e com teu sangue adquiriste para Deus gente de toda tribo, língua, povo e nação. 10 Deles fizeste para o nosso Deus um reino de sacerdotes. E eles reinarão sobre a terra”. 11 Eu vi – eu ouvi a voz de numerosos anjos, que rodeavam o trono, os Seres vivos e os Anciãos. Eram milhares de milhares, milhões de milhões, 12 e proclamavam em alta voz:“O Cordeiro imolado é digno de receber o poder, a riqueza, a sabedoria e a força, a honra, a glória e o louvor”. 13 E todas as criaturas que estão no céu, na terra, debaixo da terra e no mar, e tudo o que aí se encontra, eu as ouvi dizer: “Ao que está sentado no trono e ao 6\n\nCordeiro, o louvor e a honra, a glória e o poder para sempre”. 14 Os quatro Seres vivos respondiam: “Amém”. E os Anciãos se prostraram e adoraram.  \n\n\n#Os quatro primeiros selos \n\n\n- 6 \n\n\n1 Eu vi quando o Cordeiro abriu o primeiro dos sete selos, e ouvi o primeiro dos quatro Seres vivos dizer com voz de trovão: “Vem!” 2 Vi então um cavalo branco. Seu cavaleiro tinha um arco, e deram-lhe uma coroa. Saiu, vitorioso e para vencer ainda mais. 3 Quando abriu o segundo selo, ouvi o segundo Ser vivo dizer: “Vem!” 4 E apareceu um outro cavalo, vermelho, e ao seu cavaleiro foi dado o poder de tirar a paz da terra, de modo que os homens se matassem uns aos outros. E foi-lhe dada uma grande espada. 5 Quando abriu o terceiro selo, ouvi o terceiro Ser vivo dizer: “Vem!” Vi então um cavalo preto, e o seu cavaleiro tinha na mão uma balança. 6 E ouvi uma voz no meio dos quatro Seres vivos: “Um quilo de trigo por um dia de trabalho! Três quilos de cevada por um dia de trabalho! Não prejudiques o azeite e o vinho”. 7 Quando abriu o quarto selo, ouvi o quarto Ser vivo dizer: “Vem!” 8 Vi então um cavalo esverdeado, e o seu cavaleiro era chamado “a Morte”, e a Morada dos mortos o acompanhava. Foi-lhe dado poder sobre  a quarta parte da terra, para que matasse pela espada, pela fome, pela peste e pelas feras da terra.  \n\n\n#O quinto selo \n\n\n9 Quando abriu o quinto selo, vi debaixo do altar aqueles que tinham sido imolados por causa da Palavra de Deus e do testemunho que tinham dado. 10 Gritaram com voz forte: “Senhor santo e verdadeiro, até quando tardarás em fazer justiça, vingando o nosso sangue contra os habitantes da terra?” 11 Então, cada um deles recebeu uma veste branca e foi-lhes dito que esperassem mais um pouco de tempo, até se completar o número dos seus companheiros e irmãos, que iriam ser mortos como eles.  \n\n\n#O sexto selo \n\n\n12 E quando o Cordeiro abriu o sexto selo, vi acontecer um grande terremoto, e o sol ficou preto como roupa de luto e a lua tornou-se toda cor de sangue. 13 As estrelas do céu caíram 7\n\nsobre a terra, como a figueira deixa cair seus frutos verdes, quando bate um vento forte, 14 e o céu foi-se recolhendo como um pergaminho que se enrola. Todas as montanhas e ilhas foram arrancadas de seus lugares. 15 Os reis da terra, os magnatas e os chefes militares, os ricos, os poderosos e todos, escravos e livres, esconderam-se nas cavernas e nas rochas das montanhas, 16 dizendo aos montes e aos rochedos: “Caí sobre nós e escondei-nos da face daquele que está sentado no trono e da ira do Cordeiro, 17 pois chegou o grande dia de sua ira. Quem poderá manter-se de pé?”  \n\n\n#Os eleitos \n\n\n- 7 \n\n\n1 Depois, vi quatro anjos postados nos quatro cantos da terra. Eles seguravam os quatro ventos da terra, para que o vento não pudesse soprar na terra, nem no mar, nem nas árvores. 2 \n\nVi ainda outro anjo, que subia do lado onde nasce o sol. Ele trazia consigo o selo do Deus vivo e gritou, em alta voz, aos quatro anjos que tinham recebido o poder de danificar a terra e o mar. Ele exclamou: 3 “Não façais mal à terra, nem ao mar, nem às arvores, até que tenhamos marcado a fronte dos servos do nosso Deus”. 4 Ouvi então o número dos que tinham sido marcados: eram cento e quarenta e quatro mil, de todas as tribos dos filhos de Israel: 5 da tribo de Judá, doze mil; da tribo de Rubem, doze mil; da tribo de Gad, doze mil; 6 \n\nda tribo de Aser, doze mil; da tribo de Neftali, doze mil; da tribo de Manassés, doze mil; 7 da tribo de Simeão, doze mil; da tribo de Levi, doze mil; da tribo de Issacar, doze mil; 8 da tribo de Zabulon, doze mil; da tribo de José, doze mil; da tribo de Benjamim, doze mil. 9 Depois disso, vi uma multidão imensa, que ninguém podia contar, gente de todas as nações, tribos, povos e línguas. Estavam de pé diante do trono e do Cordeiro; vestiam túnicas brancas e traziam palmas na mão. 10 Todos proclamavam com voz forte: “A salvação pertence ao nosso Deus, que está sentado no trono, e ao Cordeiro”. 11 E todos os anjos que estavam de pé, em volta do trono e dos Anciãos e dos quatro Seres vivos, prostravam-se, com o rosto por terra,diante do trono. E adoravam a Deus, 12 dizendo: “Amém. O louvor, a glória e a sabedoria, a ação de graças, a honra, o poder e a força pertencem ao nosso Deus para sempre. \n\nAmém”.  \n\n \n\n#Os mártires \n\n\n\n8\n\n13 Então, um dos Anciãos falou comigo, perguntando: “Estes, que estão vestidos com túnicas brancas, quem são e de onde vieram?” 14 Eu respondi: “Tu é que sabes, meu senhor”. Ele então me disse: “Estes são os que vieram da grande tribulação. Lavaram e branquearam as suas vestes no sangue do Cordeiro. 15 Por isso, estão diante do trono de Deus e lhe prestam culto, dia e noite, no seu santuário. E aquele que está sentado no trono os abrigará na sua tenda. 16 Nunca mais terão fome, nem sede. Nem os molestará o sol, nem algum calor ardente. 17 Porque o Cordeiro, que está no meio do trono, será o seu pastor e os conduzirá às fontes da água vivificante. E Deus enxugará toda lágrima de seus olhos.” \n\n\n#O sétimo selo... \n\n \n\n- 8 \n\n\n1 Quando o Cordeiro abriu o sétimo selo, fez-se no céu um silêncio de meia hora... 2 Vi então os sete Anjos que estão diante de Deus. Eles receberam sete trombetas. 3 E veio um outro anjo que se colocou perto do altar, com um turíbulo de ouro. Ele recebeu uma grande quantidade de incenso, para oferecê-lo com as orações de todos os santos, no altar de ouro que está diante do trono. 4 E da mão do anjo subia até Deus a fumaça do incenso com as orações dos santos. 5 Então, o anjo pegou no turíbulo e encheu-o com o fogo do altar e atirou o turíbulo sobre a terra. Houve trovões, clamores, relâmpagos e terremoto.  \n\n\n#As quatro primeiras trombetas \n\n\n6 Os sete anjos com as sete trombetas prepararam-se para tocar. 7 O primeiro anjo tocou, e caíram sobre a terra granizo e fogo misturados com sangue. A terça parte da terra foi queimada, a terça parte das árvores foi queimada, e toda a erva verde foi queimada. 8 O \n\nsegundo anjo tocou, e algo como uma grande montanha ardendo em chamas foi lançado no mar. A terça parte do mar transformou-se em sangue. 9 A terça parte das criaturas, que viviam no mar, morreu. A terça parte dos navios naufragou. 10 O terceiro anjo tocou, e caiu do céu uma grande estrela, ardendo como uma tocha; caiu sobre a terça parte dos rios e sobre as fontes das águas. 11 O nome da estrela é ‘Amargor’. A terça parte das águas tornou-se amargor e muitas pessoas morreram devido às águas, porque se tinham tornado amargas. 12 O \n\nquarto anjo tocou, e foi atingida a terça parte do sol e a terça parte da lua, e a terça parte das 9\n\nestrelas, de modo que escureceu a terça parte deles, e o dia perdeu um terço de sua claridade, e a noite igualmente. 13 Eu vi – ouvi uma águia, que voava no ápice do céu, proclamando em alta voz: “Ai! Ai! Ai dos habitantes da terra, por causa dos próximos toques de trombeta, dos três anjos que devem ainda tocar”.  \n\n\n#A quinta trombeta: o primeiro “ai” \n\n\n- 9 \n\n\n1 E o quinto anjo tocou. Vi então uma estrela que tinha caído do céu sobre a terra, e foi-lhe dada a chave do poço do Abismo. 2 Ela abriu o poço do Abismo, e do poço do Abismo saiu fumaça, como a fumaça de uma grande fornalha, e o sol e o ar se escureceram, por causa da fumaça que saía do poço. 3 Da fumaça espalharam-se gafanhotos sobre a terra e receberam poder igual ao dos escorpiões da terra. 4 Foi-lhes dito que não danificassem a vegetação da terra, nem as ervas nem as árvores, mas somente as pessoas que não levassem na fronte a marca do selo de Deus. 5 Não lhes foi permitido matá-las, mas sim atormentá-las durante cinco meses. E a dor que causavam era semelhante à dor da picada do escorpião quando morde alguém. 6 Naqueles dias, as pessoas vão procurar a morte e não a encontrarão. Vão desejar morrer, mas a morte fugirá delas! 7 Os gafanhotos tinham a aparência de cavalos preparados para a guerra. Levavam na cabeça coroas que pareciam de ouro e as caras deles pareciam rostos humanos. 8 Tinham cabelo semelhante ao cabelo das mulheres e os seus dentes eram como os dos leões. 9 Tinham couraças como couraças de ferro, e o barulho de suas asas parecia o barulho de uma multidão de carros e cavalos correndo para o combate. 10 \n\nTinham caudas como os escorpiões, com ferrões. E na sua cauda estava o poder de atormentar as pessoas durante cinco meses. 11 Tinham por rei o Anjo do Abismo, que em hebraico se chama “Abadon” e em grego “Apolíon”. 12 Passou o primeiro “ai”. Mas depois vêm ainda outros dois “ais”.  \n\n\n#A sexta trombeta: o segundo “ai” \n\n\n13 O sexto anjo tocou, e eu ouvi uma única voz, vinda dos quatro cantos do altar de ouro que está diante de Deus. 14 A voz dizia ao sexto anjo, aquele que segurava a trombeta: “Solta os quatro anjos que se encontram algemados no grande rio, o Eufrates”. 15 E foram soltos os quatro anjos, que estavam com a hora, o dia, o mês e o ano marcados para matar a terça parte 10\n\nda humanidade. 16 O número das tropas de cavalaria era de vinte mil vezes dez mil. Eu ouvi bem o seu número. 17 E na minha visão, vi os cavalos e os cavaleiros do seguinte modo: tinham couraças de fogo, jacinto e enxofre. As cabeças dos cavalos pareciam cabeças de leões, e de suas bocas saía fogo, fumaça e enxofre. 18 A terça parte da humanidade morreu por causa destas três pragas: o fogo, a fumaça e o enxofre que saíam das bocas dos cavalos. \n\n19 Pois o poder desses cavalos estava na boca e na cauda. Suas caudas pareciam serpentes com cabeças, e com estas causavam dano. 20 As demais pessoas, as que não morreram devido a estas pragas, mesmo assim não se converteram das obras de suas mãos. Não deixaram de adorar os demônios, os ídolos de ouro e de prata, de bronze, de pedra e de madeira, que não podem ver, nem ouvir, nem caminhar. 21 Também não se converteram de seus homicídios, nem de suas magias, nem de sua prostituição, nem de seus roubos.  \n\n\n#O anjo e o livrinho \n\n\n- 10 \n\n\n1 Eu vi ainda outro anjo poderoso descer do céu, vestido com uma nuvem. Sobre sua cabeça estava o arco-íris. Seu rosto era como o sol. Suas pernas pareciam colunas de fogo. 2 Tinha na mão um livrinho aberto. Colocou o pé direito sobre o mar e o esquerdo sobre a terra, 3 e gritou com voz forte, como um leão que ruge. Quando gritou, os sete trovões fizeram ouvir suas vozes. 4 E quando os sete trovões acabaram de falar, preparei-me para escrever. Mas ouvi uma voz do céu que me dizia: “Guarda sob sigilo o que os sete trovões falaram; não o ponhas por escrito.” 5 E o anjo que eu vi, de pé sobre o mar e a terra, levantou a mão direita ao céu 6 e jurou, por aquele que vive para todo o sempre e criou o céu e tudo o que nele existe, a terra e tudo o que nela existe, o mar e tudo o que nele existe: “Não haverá mais tempo! 7 Nos dias da voz do sétimo anjo, quando ele tocar a trombeta, vai-se realizar o plano secreto de Deus, que ele anunciou aos seus servos, os profetas.” 8 Aquela mesma voz do céu, que eu já tinha ouvido, tornou a falar comigo: “Vai. Pega o livrinho aberto da mão do anjo que está de pé sobre o mar e a terra.” 9 Eu fui até o anjo e pedi que me entregasse o livrinho. \n\nEle me falou: “Pega e devora. Será amargo no estômago, mas na tua boca será doce como mel”. 10 Peguei da mão do anjo o livrinho e o devorei. Na boca era doce como mel, mas quando o engoli, meu estômago tornou-se amargo. 11 Então me foi dito: “Deves profetizar ainda contra muitos povos e nações, línguas e reis”.  \n\n\n\n11\n\n#A medição do templo e os dois profetas \n\n\n- 11 \n\n\n1 Foi-me dado um caniço, semelhante a uma vara de agrimensor, e disseram-me: “Levanta-te e tira as medidas do Santuário de Deus, do altar e dos que nele estão em adoração. 2 Deixa fora o pátio externo do Santuário; não tires as suas medidas, pois foi entregue às nações pagãs, e estas vão calcar aos pés a Cidade Santa durante quarenta e dois meses. 3 Mas eu darei às minhas duas testemunhas mil duzentos e sessenta dias para profetizarem, trajando vestes de penitência. 4 Essas duas  testemunhas são as duas oliveiras e os dois candelabros que estão diante do Senhor da terra. 5Se alguém quiser prejudicá-las, de sua boca sair á um fogo que devorará seus inimigos. Sim, se alguém quiser fazer-lhes mal, é assim que vai morrer. 6 Elas têm o poder de fechar o céu, de modo que não caia chuva alguma enquanto durar a sua missão profética. Elas têm também o poder de transformar as águas em sangue. E \n\nsempre que quiserem, podem ferir a terra com todo tipo de praga. 7 Quando elas terminarem o seu testemunho, a fera que sobe do Abismo vai combater contra elas, as vencerá e as matará. \n\n8 E os cadáveres das duas testemunhas vão ficar expostos na praça da grande cidade, que se chama, simbolicamente, Sodoma e Egito, e na qual foi crucificado também o Senhor delas. 9 \n\nGente de todos os povos, raças, línguas e nações, verá seus cadáveres durante três dias e meio, e não se permitirá que os corpos sejam sepultados. 10 Os habitantes da terra festejarão sua morte, darão parabéns uns aos outros e trocarão presentes, pois esses dois profetas estavam atormentando os habitantes da terra”. 11 Depois dos três dias e meio, um sopro de vida veio de Deus, penetrou nos dois e eles ficaram de pé. Um grande medo caiu sobre todos os que olhavam para eles. 12 Ouviram então uma voz forte vinda do céu e chamando os dois: “Subi para cá!” Eles subiram ao céu, na nuvem, à vista dos seus inimigos. 13 Na mesma hora aconteceu um grande terremoto, e a décima parte da cidade desmoronou. Sete mil pessoas morreram, e os que sobraram ficaram cheios de medo e deram glória ao Deus do céu. \n\n14Assim passou o segundo “ai”. Eis que o terceiro “ai” chega depressa.  \n\n \n\n#Anúncio da sétima trombeta (o terceiro “ai”) \n\n\n15 O sétimo anjo tocou a trombeta. Vozes bem fortes começaram a exclamar no céu: “O \n\nreinado sobre o mundo pertence agora ao nosso Senhor e ao seu Cristo, e ele reinará para todo o sempre”. 16 E os vinte e quatro Anciãos, que estão sentados em seus tronos diante de Deus, 12\n\nprostraram-se com o rosto em terra e adoraram a Deus, 17 dizendo: “Nós te damos graças, Senhor Deus, Todo-poderoso, aquele ‘que é e que era’, porque assumiste o teu grande poder e começaste a reinar. 18 As nações tinham-se enfurecido, mas chegou a tua ira, e o tempo de julgar os mortos e de dar a recompensa aos teus servos, os profetas, os santos, e os que temem o teu nome, pequenos e grandes; chegou o tempo de destruir os que destroem a terra”. 19 \n\nAbriu-se o Santuário de Deus que está no céu e apareceu no Santuário a arca da sua Aliança. \n\nHouve relâmpagos, vozes, trovões, terremotos e uma grande tempestade de granizo.  \n\n\n#A mulher e o dragão \n\n\n- 12 \n\n\n1 Então apareceu no céu um grande sinal: uma mulher vestida com o sol, tendo a lua debaixo dos pés e, sobre a cabeça, uma coroa de doze estrelas. 2 Estava grávida e gritava em dores de parto, atormentada para dar à luz. 3 Então apareceu outro sinal no céu: um grande Dragão, avermelhado como fogo. Tinha sete cabeças e dez chifres e, sobre as cabeças, sete diademas. \n\n4 Com a cauda, varreu a terça parte das estrelas do céu, atirando-as sobre a terra. O Dragão parou diante da Mulher que estava para dar à luz, pronto para devorar o seu Filho, logo que ela o desse à luz. 5 E ela deu à luz um filho homem, que veio para governar todas as nações com cetro de ferro. Mas o filho foi levado para junto de Deus e do seu trono. 6 A mulher fugiu para o deserto, onde Deus lhe tinha preparado um lugar, para que aí fosse alimentada durante mil duzentos e sessenta dias. \n\n \n\n#A queda do dragão \n\n\n7 Houve então uma batalha no céu: Miguel e seus anjos guerrearam contra o Dragão. O \n\nDragão lutou, juntamente com os seus anjos, 8 mas foi derrotado; e eles perderam seu lugar no céu. 9 Assim foi expulso o grande Dragão, a antiga Serpente, que é chamado Diabo e Satanás, o sedutor do mundo inteiro. Ele foi expulso para a terra, e os seus anjos foram expulsos com ele. 10 Ouvi então uma voz forte no céu, proclamando: “Agora realizou-se a salvação, a força e a realeza do nosso Deus, e o poder do seu Cristo. Porque foi expulso o acusador dos nossos irmãos, aquele que os acusava dia e noite perante nosso Deus. 11 Eles venceram o Dragão pelo sangue do Cordeiro e pela palavra do seu próprio testemunho, pois não se apegaram à vida: até deixaram-se matar. 12 Por isso, alegra-te, ó céu, e todos os que 13\n\nnele habitais. Mas ai da terra e do mar, porque o Diabo desceu para o meio de vós e está cheio de grande furor; pois sabe que lhe resta pouco tempo”. A luta do dragão contra a mulher 13 \n\nQuando viu que tinha sido expulso para a terra, o Dragão começou a perseguir a Mulher que tinha dado à luz o menino. 14 Mas a Mulher recebeu as duas asas da grande águia e voou para o deserto, para o lugar onde é alimentada, por um tempo, dois tempos e meio tempo, bem longe da Serpente. 15 A Serpente, então, vomitou como um rio de água atrás da Mulher, a fim de a submergir. 16 A terra, porém, veio em socorro da Mulher: abriu a boca e engoliu o rio que o Dragão tinha vomitado. 17 Cheio de raiva por causa da Mulher, o Dragão começou a combater o resto dos filhos dela, os que observam os mandamentos de Deus e guardam o testemunho de Jesus. 18 E parou à beira do mar.  \n\n\n#A (primeira) Fera \n\n\n- 13 \n\n\n1 Vi então uma fera que subia do mar. Tinha dez chifres e sete cabeças. Em cima dos chifres havia dez diademas e sobre as cabeças, um nome blasfemo. 2 A fera que eu vi parecia uma pantera. Seus pés eram como os de um urso, sua boca como a boca de um leão. Então o Dragão entregou à Fera sua força e seu trono, juntamente com grande poder. 3 Uma das suas cabeças parecia mortalmente ferida, mas essa ferida mortal foi curada. E toda a terra, maravilhada, seguiu a Fera. 4 Adoraram o Dragão, porque tinha entregue o poder à Fera. E \n\nadoraram a Fera, dizendo: “Quem é igual à Fera? Quem pode lutar contra ela?” 5 A Fera recebeu uma boca para proferir arrogância e blasfêmias. Recebeu também poder para agir durante quarenta e dois meses. 6 Então abriu a boca em blasfêmias contra Deus, blasfemando contra o seu nome e a sua Morada e contra os que moram no céu. 7 Foi-lhe permitido combater contra os santos e vencê-los, e recebeu poder sobre toda tribo, povo, língua e nação. \n\n8 Então adoraram a Fera todos os habitantes da terra cujo nome não está escrito, desde a fundação do mundo, no livro da vida do Cordeiro imolado. 9 Se alguém tem ouvidos, ouça: 10 Se alguém está destinado à prisão, à prisão irá. Se alguém deve morrer pela espada, pela espada tem de morrer. Aqui está a constância e a fidelidade dos santos. \n\n\n#A (segunda) Fera \n\n\n11 Eu vi ainda outra fera sair da terra. Tinha dois chifres como um cordeiro, mas falava como 14\n\num dragão. 12 Ela exerce todo o poder da primeira fera, a serviço desta. Ela faz com que a terra e seus habitantes adorem a primeira Fera, cuja ferida mortal tinha sido curada. 13 Ela realiza grandes milagres, até mesmo o de fazer descer fogo do céu sobre a terra à vista de todos. 14 Por causa do poder de fazer esses milagres, sempre a serviço da primeira Fera, ela consegue seduzir os habitantes da terra, dizendo-lhes que devem fazer uma estátua da Fera, que tinha sido ferida à espada, mas ficou com vida. 15 Foi-lhe permitido animar a estátua da Fera, de modo que a estátua falasse, e fosse morto quem não a adorasse. 16 Ela faz com que todos, pequenos e grandes, ricos e pobres, livres e escravos, recebam uma marca na mão direita ou na fronte. 17 E ninguém pode comprar ou vender, se não tiver a marca que é o nome da Fera, aliás, o número do seu nome. 18 Aqui está a inteligência: quem for inteligente decifre o número da Fera, pois o número representa uma pessoa. Seu número é seiscentos e sessenta e seis. \n\n\n#O Cordeiro e seu séqüito \n\n\n- 14 \n\n\n1 Depois disso, eu vi: o Cordeiro estava de pé sobre o monte Sião, e com ele, os cento e quarenta e quatro mil que tinham o nome dele e o nome do seu Pai inscrito em suas frontes. 2 \n\nOuvi uma voz que vinha do céu; parecia o fragor de águas torrenciais e o estrondo de um forte trovão. A voz que ouvi era como o som de músicos tocando harpa. 3 Estavam diante do trono, diante dos quatro Seres vivos e dos Anciãos, e cantavam um cântico novo. Era um cântico que ninguém podia aprender; só os cento e quarenta e quatro mil que foram resgatados da terra. 4 \n\nEstes são os que não se contaminaram com a prostituição, pois são virgens. Eles seguem o Cordeiro aonde quer que vá. Foram resgatados do meio da humanidade, como primeira oferta a Deus e ao Cordeiro. 5 Na sua boca nunca foi encontrada mentira. São íntegros!  \n\n\n#Anúncio do juízo \n\n\n6 Vi então outro anjo, que voava no ápice do céu, com uma mensagem a anunciar aos habitantes da terra, a toda nação, tribo, língua e povo – um evangelho eterno. 7 O anjo clamava em alta voz: “Temei a Deus e dai-lhe glória, porque chegou a hora do seu julgamento. Adorai aquele que fez o céu e a terra, o mar e as fontes das águas”. 8 Um segundo anjo o seguia, dizendo: “Caiu, caiu Babilônia, a grande, aquela que embriagou todas 15\n\nas nações com o vinho do furor da sua prostituição”. 9 E um terceiro anjo os acompanhava, clamando em alta voz: “Se alguém adora a Fera e sua estátua e recebe sua marca na fronte ou na mão, 10esse vai beber também o vinho do furor de Deus, servido sem mistura na taça da sua ira. Será atormentado com fogo e enxofre diante dos santos anjos e do Cordeiro. 11 A fumaça do seu tormento subirá para sempre, e, dia e noite, não terão descanso aqueles que adoram a Fera e sua estátua, e quem quer que leve a marca com o seu nome”. 12 Aqui está a constância dos santos, daqueles que observam os mandamentos de Deus e a fidelidade a Jesus. 13 Ouvi, então, uma voz vinda do céu, que dizia: “Escreve: Ditosos os mortos, os que desde agora morrem no Senhor. Sim, diz o Espírito, que eles descansem de suas fadigas, pois suas obras os acompanham.”  \n\n\n#A colheita \n\n\n14 E eu vi: era uma nuvem branca, e sentado sobre a nuvem alguém que parecia um “filho de homem”. Tinha sobre a cabeça uma coroa de ouro e, nas mãos, uma foice afiada. 15 \n\nEntretanto saiu do Santuário um outro anjo, gritando em alta voz para aquele que estava sentado na nuvem: “Mete tua foice e ceifa. Chegou a hora da colheita. A seara da terra está madura!” 16 E aquele que estava sentado sobre a nuvem deu com a foice na terra, e a terra foi ceifada. 17 Então saiu do Santuário que está no céu mais um anjo. Também ele tinha uma foice afiada. 18 E saiu, de junto do altar, outro anjo ainda, aquele que tem poder sobre o fogo. \n\nEle gritou em alta voz para aquele que segurava a foice afiada: “Mete a tua foice afiada e colhe os cachos da vinha da terra, porque as uvas já estão maduras.” 19 E o anjo deu com a foice afiada na terra, e colheu os frutos da vinha da terra, despejando-os no grande lagar do furor de Deus. 20 E o lagar foi pisado, fora da cidade, e dele saiu sangue, que subiu até à altura do freio dos cavalos, numa extensão de trezentos quilômetros.  \n\n\n#Anúncio das pragas do Fim \n\n \n\n- 15 \n\n\n1 Depois, vi no céu outro sinal, grande e admirável: sete anjos, com as sete últimas pragas, com as quais o furor de Deus ia-se consumar. 2 Vi também como que um mar de vidro misturado com fogo. Todos aqueles que saíram vitoriosos do confronto com a Fera, com a sua 16\n\nestátua e com o número do seu nome, estavam de pé sobre o mar de vidro, tendo nas mãos harpas de Deus. 3 Entoavam o cântico de Moisés, o servo de Deus, e o cântico do Cordeiro, e cantavam: “Grandes e admiráveis são as tuas obras, Senhor Deus, Todo-poderoso! Justos e verdadeiros são os teus caminhos, ó Rei das nações! 4 Quem não temeria, Senhor, e não glorificaria o teu nome? Só tu és santo! Todas as nações virão prostrar-se diante de Ti, porque tuas justas decisões se tornaram manifestas”. 5 Depois disto, vi abrir-se o Santuário, a Tenda do Testemunho, que está no céu. 6 Saíram do Santuário os sete anjos com  as sete pragas. \n\nEstavam vestidos de linho puro e brilhante, cingidos à altura do peito com faixas de ouro. 7 \n\nUm dos quatro Seres vivos entregou aos sete anjos sete taças de ouro, cheias do furor de Deus, que vive para todo o sempre. 8 E o Santuário encheu-se de fumaça, por causa da glória e do poder de Deus, e ninguém podia entrar no Santuário, enquanto não estivessem consumadas as sete pragas dos sete anjos. \n\n\n#O despejo das sete taças \n\n \n\n- 16 \n\n\n1 Depois, ouvi uma voz forte que saía do Santuário, dizendo aos sete anjos: “Ide, despejai sobre a terra as sete taças do furor de Deus”. 2 Saiu o primeiro anjo e despejou a sua taça na terra, e causou úlceras malignas e repugnantes nas pessoas que traziam a marca da fera e adoravam a sua estátua. 3 O segundo anjo despejou a sua taça no mar, e o mar transformou-se em sangue, como o de um morto, e todos os seres vivos do mar morreram. 4 O terceiro anjo despejou a sua taça nos rios e nas fontes das águas, e a água transformou-se em sangue. 5 \n\nEntão, ouvi o anjo das águas dizer: “Justo és tu, Senhor, aquele ‘que é e que era’, o Santo, por teres julgado deste modo. 6 Pois essa gente derramou o sangue de santos e profetas, e tu lhes deste sangue a beber! É o que eles merecem!” 7 Ouvi então o altar falar: “Sim, Senhor, Deus Todo-poderoso, teus julgamentos são verdadeiros e justos”. 8 O quarto anjo despejou a sua taça no sol, e ao sol foi concedido queimar os seres humanos com seu fogo. 9 Eles ficaram gravemente queimados e blasfemaram contra o nome de Deus, que tem o poder sobre essas pragas. Mas não se converteram para dar-lhe glória. 10 O quinto anjo despejou a sua taça sobre o trono da Fera, e o reino dela cobriu-se de trevas. As pessoas mordiam a língua de dor 11 e blasfemaram contra o Deus do céu, por causa de suas dores e úlceras, mas não se converteram de sua conduta. 12 O sexto anjo despejou a sua taça sobre o grande rio Eufrates. \n\nA água do rio secou, de modo que ficou livre o caminho para a invasão dos reis do Oriente. 13 \n\n\n17\n\nEntão vi da boca do Dragão, da boca da Fera e da boca do falso profeta, saírem três espíritos impuros, semelhantes a  sapos. 14 São espíritos demoníacos, que realizam sinais. Eles se dirigem aos reis de toda a terra, para os reunir para a guerra do grande dia do Deus todo-poderoso. 15 (“Eis que venho como um ladrão. Feliz aquele que vigia e conserva suas vestes, para não andar nu e para que não se enxergue a sua vergonha.”) 16 Então os reis foram reunidos no lugar que, em hebraico, se chama Harmagedon. 17 O sétimo anjo despejou a sua taça no ar e uma voz forte saiu do templo, de junto do trono, e dizia: “Está feito!” 18 Houve então relâmpagos, vozes, trovões e um forte terremoto. Desde que o ser humano surgiu na terra nunca aconteceu terremoto assim tão violento.19 A Grande Cidade partiu-se em três e as cidades das nações desmoronaram-se. E Babilônia, a grande, foi lembrada diante de Deus, para que lhe fosse dada a taça com o vinho do furor da sua ira. 20 Todas as ilhas fugiram e as montanhas desapareceram. 21 Do céu caiu granizo terrível, como pedras de trinta quilos, e as pessoas blasfemaram contra Deus por causa do granizo, pois o flagelo foi extremamente devastador.  \n\n \n\n#A prostituta Babilônia \n\n \n\n- 17 \n\n\n1 Então, um dos sete anjos das sete taças convidou-me: “Vem! Vou mostrar-te a condenação da grande prostituta, que está sentada à beira de águas abundantes. 2 Os reis da terra prostituíram-se com ela e os habitantes da terra embriagaram-se com o vinho da sua prostituição”. 3 E o anjo me levou em espírito ao deserto, e eu vi uma mulher montada numa fera de cor escarlate, cheia de nomes blasfemos. A fera tinha sete cabeças e dez chifres. 4 A mulher estava vestida de púrpura e escarlate, e toda enfeitada de ouro, pedras preciosas e pérolas. Tinha na mão um cálice de ouro cheio de abominações, as imundícies da sua prostituição. 5 Na fronte da mulher estava escrito um nome enigmático: “Babilônia, a grande, a mãe das prostitutas e das abominações da terra”. 6 E reparei que a mulher estava embriagada com o sangue dos santos e com o sangue das testemunhas de Jesus. A visão desta mulher deixou-me profundamente admirado. 7 Disse-me então o anjo: “Por que estás admirado? Eu vou te explicar o segredo da mulher e da fera com sete cabeças e dez chifres, que a carrega. 8 A fera que viste existia, mas não existe mais. Ela está para subir do abismo, mas caminha para a perdição. E aqueles habitantes da terra cujos nomes não foram, desde a 18\n\ncriação do mundo, inscritos no livro da vida, eles vão se surpreender ao verem que a fera existia, não existe mais e tornará a existir. 9 Aqui está a inteligência perspicaz: as sete cabeças são sete montanhas sobre as quais a mulher está sentada. Mas são também sete reis. 10 Cinco deles já caíram, o sexto está aí, o sétimo ainda não veio. E quando vier, deve durar pouco tempo. 11A fera que existia e não existe mais é o próprio oitavo rei, mas é também um dos sete e está indo para a perdição. 12 E os dez chifres, que viste, são dez reis que ainda não receberam reinado, mas receberão por uma hora o poder de reinar juntamente com a fera. 13 \n\nEstes reis estão de comum acordo para dar sua força e poder à fera. 14 Eles vão combater contra o Cordeiro, mas o Cordeiro, Senhor dos Senhores e Rei dos reis, os vencerá, e também serão vencedores os que com ele são chamados, eleitos, fiéis. 15 O anjo disse-me ainda: “As águas que viste, onde está sentada a prostituta, são povos e multidões, nações e línguas. 16 E \n\nos dez chifres, que viste, como também a fera, vão odiar a prostituta e a deixarão desolada e nua, comerão as suas carnes e a queimarão com fogo. 17 Pois Deus os incitou a executarem o plano dele, entregando de comum acordo à fera o poder real que eles têm, até que se cumpram as palavras de Deus. 18 E a mulher que viste é a grande cidade, que exerce a realeza sobre os reis da terra”. \n\n\n#Anúncio da queda de Babilônia \n\n \n\n- 18 \n\n\n1 Depois de tudo isso, vi outro anjo descendo do céu. Tinha grande poder, e a terra ficou toda iluminada com a sua glória. 2 Ele gritou com voz poderosa: “Caiu! Caiu Babilônia, a grande! \n\nTornou-se morada de demônios, abrigo de todos os espíritos maus, abrigo de aves impuras e nojentas. 3 Pois ela embriagou todas as nações com o vinho do furor da sua prostituição. Com ela se prostituíram os reis da terra, e os comerciantes da terra se enriqueceram com seu luxo desenfreado”. 4 Ouvi outra voz do céu, que dizia: “Saí dela, ó meu povo! Não sejais cúmplices dos seus pecados, nem atingidos por suas pragas. 5 Seus pecados se amontoaram até o céu e Deus se lembrou das suas iniqüidades. 6 Pagai-lhe com a mesma moeda, restituí-\n\nlhe em dobro o que ela fez. Na taça que ela serviu, servi o dobro para ela. 7 O quanto ela se enchia de glória e de luxo, devolvei-lhe agora em dor e luto. Pois dizia para si mesma: ‘Estou num trono como rainha, não sou viúva, nunca conhecerei luto’. 8 Por isso, num só dia, as pragas a surpreenderão: morte, luto e fome. Ela será devorada pelo fogo, pois o Senhor Deus, que a julgou, é forte. 9 Os reis da terra, que se prostituíram com ela, aqueles que participavam 19\n\ndo seu luxo, ao enxergarem a fumaça do incêndio vão chorar e bater no peito. 10 Vão ficar longe dela, com medo dos seus tormentos, e dirão: ‘Ai! Ai, ó Grande Cidade! Babilônia, cidade poderosa, uma hora bastou para o teu julgamento!’ 11 Os comerciantes de toda a terra também hão de chorar e por causa dela ficarão de luto, porque ninguém mais vai comprar as suas mercadorias: 12 carregamentos de ouro e prata, pedras  preciosas e pérolas, linho e púrpura, seda e escarlate, madeiras perfumadas de todo tipo, objetos de marfim e de madeira preciosa, de bronze, de ferro e de mármore, 13 canela, temperos,  perfumes, mirra e incenso, vinho e azeite, flor de farinha e trigo, bois e ovelhas, cavalos e carros, escravos, vidas humanas. 14 Os frutos que almejavas afastaram-se de ti. A opulência e o esplendor terminaram para ti, e nunca mais alguém há de encontrá-los. 15 Os comerciantes desses produtos, que se enriqueceram às custas dela, vão ficar longe, com medo dos seus tormentos e, chorando e vestindo luto, 16 dirão: ‘Ai! Ai, ó Grande Cidade, vestida com linho fino, púrpura e escarlate, enfeitada com ouro e pedras preciosas e pérolas, 17 uma hora bastou para destruir toda essa riqueza’. E todos os pilotos e navegantes, marinheiros e quantos trabalham no mar, ficaram longe 18 e, ao ver a fumaça do incêndio, gritaram: ‘Que cidade é igual à Grande Cidade?’ 19 E deitaram cinza na cabeça, choraram, ficaram de luto e gritavam: ‘Ai! \n\nAi, ó Grande Cidade! Com tua grandeza se enriqueceram todos os armadores. Bastou uma hora para ficares arruinada. 20 E tu, ó Céu, alegra-te por causa dela, e também vós, santos, apóstolos e profetas, pois Deus julgou a vossa causa contra ela’”. 21 Nisto, um anjo forte levantou uma pedra do tamanho de uma grande mó e atirou-a ao mar, dizendo: “Com a mesma força será atirada Babilônia, a Grande Cidade, e nunca mais será encontrada. 22 E o som de harpistas e músicos, de flautistas e tocadores de trombeta, em  ti nunca mais se ouvirá; e nenhum artista de arte alguma em ti jamais se encontrará; e a cantilena do moinho em ti nunca mais se ouvirá; 23 e a luz da lâmpada em ti nunca mais brilhará; e a voz do noivo e da noiva em ti nunca mais se ouvirá, porque os teus comerciantes eram os grandes da terra, e com tua magia enfeitiçaste todas as nações. 24 E nela foi encontrado o sangue dos profetas e dos santos e de todos os que foram imolados sobre a terra”. \n\n\n#O júbilo no céu \n\n\n- 19 \n\n\n1 Depois disso, ouvi como que o forte vozerio de uma grande multidão que aclamava, no céu: 20\n\n“Aleluia! A salvação, a glória e o poder pertencem ao nosso Deus, 2 porque seus julgamentos são verdadeiros e justos. Sim, Deus julgou a grande prostituta que corrompeu a terra com sua prostituição, e vingou nela o sangue dos seus servos”. 3 E continuaram: “Aleluia! A fumaça dela ficará subindo por toda a eternidade!” 4 E os vinte e quatro Anciãos e os quatro Seres vivos se prostraram diante de Deus, que está sentado no trono, e disseram: “Amém. Aleluia!” \n\n5 Então, uma voz saiu do trono, convidando: “Louvai o nosso Deus, todos os seus servos e todos os que o temeis, pequenos e grandes”. 6 Eu ouvi ainda como que a voz de uma grande multidão, como que o fragor de águas torrenciais e o estrondo de fortes trovões. A multidão aclamava: “Aleluia! O Senhor, nosso Deus, o Todo-poderoso passou a reinar. 7 Fiquemos alegres e contentes, e demos glória a Deus, porque chegou o tempo das núpcias do Cordeiro. \n\nSua esposa já se preparou. 8 Foi lhe dado vestir-se com linho brilhante e puro”. (O linho significa as obras justas dos santos.) 9 E o anjo me disse: “Escreve: Felizes os convidados para o banquete das núpcias do Cordeiro”. Disse ainda: “Estas são as verdadeiras palavras de Deus”. 10 Eu prostrei-me diante dele para adorá-lo, mas ele me disse: “Não faças isso! Eu sou um servo como tu e como os teus irmãos que guardam o testemunho de Jesus. A Deus é que deves adorar”. (O testemunho de Jesus é o espírito da profecia.) 11 Vi então o céu aberto, e apareceu um cavalo branco. Aquele que o montava chama-se ‘fiel’ e ‘verdadeiro’: ele julga e combate com justiça. 12 Seus olhos são como chama de fogo. Sobre sua cabeça há muitos diademas. Ele traz um nome que ninguém conhece, a não ser ele mesmo. 13 Está vestido com um manto embebido de sangue. Ele é chamado pelo nome de “Palavra de Deus”. 14 Os exércitos do céu o acompanham, montados em cavalos brancos, com roupas de linho branco e puro. 15 Da sua boca sai uma espada afiada, para com ela ferir as nações. Ele as governará com cetro de ferro. Ele é quem pisa o lagar do vinho que é a furiosa cólera de Deus Todo-poderoso. 16 No manto e na sua coxa, traz escrito um nome: “Rei dos Reis e Senhor dos Senhores”. 17 Vi então um anjo, em pé, no sol. Gritou em alta voz a todos os pássaros que voam pela  abóbada celeste: “Vinde! Reuni-vos para o grande banquete de Deus, 18 para comer carnes de reis e de capitães, carnes de poderosos, carnes de cavalos e cavaleiros, carnes de todos, livres e escravos, pequenos e grandes”. 19 Vi então a Fera reunida com os reis da terra e seus exércitos, para combater contra o Cavaleiro e seu exército. 20 A Fera, porém, foi aprisionada, junto com o falso profeta, que realizava milagres a seu serviço, seduzindo todos os que haviam recebido a marca da fera e adorado a sua estátua. Ambos foram lançados vivos no lago de fogo com enxofre ardente. 21 E os demais foram mortos pela espada que saía da boca do Cavaleiro, e todas as aves se fartaram com as suas carnes.  \n\n\n\n21\n\n#O reinado de mil anos \n\n\n- 20 \n\n\n1 Depois disso, vi um anjo descer do céu. Tinha nas mãos a chave do Abismo e uma grande corrente. 2 Ele agarrou o Dragão, a antiga Serpente, que é o Diabo, Satanás.Acorrentou-o por mil anos 3 e lançou-o dentro do Abismo. Depois, trancou e lacrou o Abismo, para que o Dragão não seduzisse mais as nações, até que terminassem os mil anos. Depois dos mil anos, o Dragão deve ser solto, mas por pouco tempo. 4 Vi então tronos, e os seus ocupantes sentaram-se e receberam o poder de julgar. Vi também aqueles que foram decapitados por causa do Testemunho de Jesus e da Palavra de Deus e os que não tinham adorado a fera, nem a sua estátua, nem tinham recebido na fronte ou na mão a marca da fera. Eles voltaram a viver, para reinarem com Cristo durante mil anos. 5 (Os outros mortos não voltaram a viver enquanto não terminaram os mil anos.) Tal é a primeira ressurreição. 6 Ditoso e santo quem participa da primeira ressurreição! A segunda morte não tem poder sobre eles. Eles serão sacerdotes de Deus e de Cristo e reinarão com ele durante mil anos. 7 E quando se completarem os mil anos, Satanás será solto da sua prisão. 8 Ele sairá para seduzir as nações dos quatro cantos da terra, de Gog e Magog, a fim de reuni-las para o combate. O número delas é como a areia do mar. 9 Espalharam-se por toda a terra, cercaram o acampamento dos santos  e a cidade amada. Mas do céu desceu fogo e devorou-as. 10 O Diabo, que tinha seduzido a todas elas, foi atirado no lago de fogo e enxofre, onde já se achavam a Fera e o falso profeta. Lá eles serão atormentados noite e dia, por toda a eternidade. 11 Vi ainda um grande trono branco e quem nele estava sentado. O céu e a terra fugiram da sua presença e não se achou mais o lugar deles.12 Vi também os mortos, grandes e pequenos, em pé diante do trono. Foram abertos livros, e mais um outro livro ainda: o livro da vida. Então foram julgados os mortos, de acordo com sua conduta, conforme está escrito nos livros. 13 O mar devolveu os mortos que nele se encontravam. A Morte e a Morada dos mortos entregaram de volta os seus mortos. E cada um foi julgado conforme sua conduta. 14 A Morte e a Morada dos mortos foram então atirados ao lago de fogo. Esta é a segunda morte: o lago de fogo. 15 \n\nQuem não tinha o seu nome escrito no livro da vida, foi também atirado no lago de fogo.  \n\n\n#A morada de Deus junto dos homens \n\n\n\n22\n\n - 21 \n\n\n1 Vi então um novo céu e uma nova  terra. Pois o primeiro céu e a primeira terra passaram, e o mar já não existe. 2 Vi também a cidade santa, a nova Jerusalém, descendo do céu, de junto de Deus, vestida como noiva enfeitada para o seu esposo. 3 Então, ouvi uma voz forte que saía do trono e dizia: “Esta é a morada de Deus-com-os-homens. Ele vai morar junto deles. \n\nEles serão o seu povo, e o próprio Deus-com-eles será seu Deus. 4 Ele enxugará toda lágrima dos seus olhos. A morte não existirá mais, e não haverá mais luto, nem grito, nem dor, porque as coisas anteriores passaram”. 5 Aquele que está sentado no trono disse: “Eis que faço novas todas as coisas”. Depois, ele me disse: “Escreve, pois estas palavras são dignas de fé e verdadeiras”. 6 E disse-me ainda: “Está feito! Eu sou o Alfa e o Ômega, o Princípio e o Fim. \n\nA quem tiver sede, eu darei, de graça, da fonte da água vivificante. 7 Estas coisas serão a herança do vencedor, e eu serei seu Deus, e ele será meu filho”. 8 Quanto aos covardes, infiéis, corruptos, assassinos, devassos, feiticeiros, idólatras e todos os mentirosos, o lugar deles é o lago ardente de fogo e enxofre, ou seja, a segunda morte”. \n\n\n#A nova Jerusalém \n\n\n9 Depois veio até mim um dos sete anjos das sete taças cheias com as últimas pragas. Ele falou comigo e disse: “Vem! Vou mostrar-te a noiva, a esposa do Cordeiro”. 10 Então me levou em espírito a uma montanha grande e alta. Mostrou-me a cidade santa, Jerusalém, descendo do céu, de junto de Deus, 11 brilhando com a glória de Deus. Seu brilho era como o de uma pedra preciosíssima, como o brilho de jaspe cristalino. 12 Estava cercada por uma muralha grande e alta, com doze portas. Sobre as portas estavam doze anjos, e nas portas estavam escritos os nomes das doze tribos de Israel. 13 Havia três portas do lado do oriente, três portas do lado norte, três portas do lado sul e três portas do lado do ocidente. 14 A muralha da cidade tinha doze alicerces, e sobre eles estavam escritos os nomes dos doze apóstolos do Cordeiro. 15 Aquele que estava falando comigo usava uma vara de ouro para medir a cidade, as portas e a muralha. 16 A cidade é quadrangular, com o comprimento igual à largura. O anjo mediu a cidade com a vara: doze mil estádios. O comprimento, a largura e a altura são iguais. 17 O anjo mediu a muralha: cento e quarenta e quatro côvados de altura, em medidas humanas, usadas pelo anjo. 18 A muralha é feita de jaspe. A cidade é de ouro purificado, parecendo cristal puro. 19 Os alicerces da muralha da cidade são ornamentados com todo o tipo de pedras preciosas. O primeiro alicerce é de jaspe, o segundo de safira, o 23\n\nterceiro de calcedônia, o quarto de esmeralda, 20 o quinto de sardônica, o sexto de cornalina, o sétimo de crisólito, o oitavo de berilo, o nono de topázio, o décimo de crisópraso, o décimo primeiro de jacinto e o décimo segundo de ametista. 21 As doze portas são doze pérolas; cada porta é feita de uma única pérola. A praça da cidade é de ouro purificado, como vidro transparente. 22 Não vi nenhum santuário na cidade, pois o seu Santuário é o próprio Senhor, o Deus Todo-poderoso, e o Cordeiro. 23 A cidade não precisa de sol nem de lua que a iluminem, pois a glória de Deus é a sua luz e a sua lâmpada é o Cordeiro. 24 As nações caminharão à sua luz e os reis da terra levarão a ela a sua glória. 25 Suas portas não precisam de ser fechadas cada dia, pois já não haverá noite; 26 e a ela serão levadas a glória e a riqueza das nações. 27 Nunca mais entrará nela o que é impuro, nem alguém que pratique a abominação e a mentira. Entrarão nela somente os que estão inscritos no livro da vida do Cordeiro.  \n\n\n- 22 \n\n\n1 Ele mostrou-me um rio de água vivificante, o qual brilhava como cristal. O rio brotava do trono de Deus e do Cordeiro. 2 No meio da praça e em ambas as margens do rio cresce a árvore da vida, frutificando doze vezes por ano, produzindo cada mês o seu fruto, e suas folhas servem para curar as nações. 3 Já não haverá maldição alguma. Na cidade estará o trono de Deus e do Cordeiro e seus servos poderão prestar-lhe culto. 4 Verão a sua face e o seu nome estará sobre suas frontes. 5 Não haverá mais noite: não se precisará mais da luz da lâmpada, nem da luz do sol, porque o Senhor Deus vai brilhar sobre eles e eles reinarão por toda a eternidade.  \n\n \n\n#A vinda de Cristo \n\n\n6 Então ele me disse: “Estas palavras são dignas de fé e verdadeiras, pois o Senhor, o Deus que inspira os profetas, enviou o seu Anjo, para mostrar aos seus servos o que deve acontecer em breve. 7 Eis que eu venho em breve. Feliz aquele que observa as palavras da profecia deste livro”.  \n\n\n#Epílogo \n\n\n\n24\n\n8 Eu, João, sou quem viu e ouviu estas coisas.E tendo-as ouvido e visto, prostrei-me para adorar o anjo que a mim as tinha mostrado. 9 Mas ele me falou: “Não faças isso! Eu sou servo como tu e como teus irmãos, os profetas e aqueles que guardam as palavras deste livro.É a Deus que deves adorar”. 10 E Jesus disse-me: “Não deixes sob sigilo as palavras da profecia deste livro, pois o tempo marcado está próximo. 11 O malfeitor continue fazendo o mal, o sujo continue a sujar-se; e que o justo continue praticando a justiça e o santo santifique-se ainda mais. 12 Eis que venho em breve, trazendo comigo a minha recompensa, para retribuir a cada um segundo as suas obras. 13 Eu sou o Alfa e o Ômega, o Primeiro e o Último, o Começo e o Fim. 14 Felizes os que lavam suas vestes, pois assim poderão dispor da árvore da vida e entrar na cidade pelas portas. 15 Mas ficarão de fora os cães, os feiticeiros, os libertinos, os assassinos e os idólatras,e todos os que amam a mentira e a praticam. 16 Eu, Jesus, enviei o meu anjo, para vos dar este testemunho sobre as igrejas. Eu sou o rebento e a raiz de Davi. Eu sou a brilhante estrela da manhã”. 17 O Espírito e a Esposa dizem: “Vem”! \n\nAquele que ouve também diga: “Vem”! Quem tem sede, venha, e quem quiser, receba de raça a água vivificante. 18 Para todo o que ouve as palavras da profecia deste livro vai aqui o meu testemunho: se alguém lhe acrescentar qualquer coisa, Deus lhe acrescentará as pragas que estão aqui descritas. 19 E se alguém retirar algo das palavras do livro desta profecia, Deus lhe retirará a sua parte da árvore da vida e da Cidade Santa, que se encontram descritas neste livro. 20 Aquele que dá testemunho destas coisas diz: “Sim, eu venho em breve”. Amém! \n\nVem, Senhor Jesus!  \n\n\n#Saudação final  \n\n \n\n21 A graça do Senhor Jesus esteja com todos.Amém. \n\n\n\n25",
			"added": 1551040388
		},
		{
			"topic_id": 2,
			"title": "Bilionário russo quer transferir seu cérebro para computador e 'imortalizá-lo'",
			"body": "#\"Nos próximos 30 anos, farei com que todos nós possamos viver para sempre\".\n\nA ambiciosa frase é do bilionário russo Dmitry Itskov, que promete dedicar seu tempo e fortuna para o projeto de transferir mentes humanas para um computador.\n\n\"Estou 100% confiante de que isso vai acontecer, ou não teria iniciado tudo isso\", explica Itskov, de 35 anos, que diz ter deixado o mundo dos negócios para se dedicar ao que ainda soa como um filme de ficção científica.\n\nA morte é inevitável, pelo menos até agora, porque as células que formam nosso corpo perdem a capacidade de regeneração à medida que envelhecemos, o que nos deixa mais vulneráveis a doenças cardiovasculares e outras condições relacionadas ao processo de envelhecimento.\n\n#Computador\n\nItskov está investindo parte de sua fortuna em um plano que concebeu para tentar \"driblar\" a passagem do tempo. Ele quer usar a ciência para desvendar os segredos do cérebro humano e fazer o upload para um computador, o que livraria a mente de indivíduos das restrições biológicas do corpo.\n\n\"O objetivo final é transferir a personalidade da pessoa para um corpo completamente novo\", explica o russo, fã de ficção de científica.\n\nMas como ele planeja tornar o plano realidade?\n\nO neurocientista Randal Koene, que já trabalhou no Centro de Estudos da Memória e do Cérebro da Universidade de Boston (EUA), é o diretor científico do projeto de Itskov e ridiculariza sugestões de que o russo teria perdido a noção de realidade.\n\n\"Toda a evidência que temos até agora parece dizer que (a transferência) é possível. É extremamente difícil, mas é possível. Sendo assim, você pode até dizer que alguém como Itskov é um visionário, mas não louco. Porque isso implicaria pensar que se trata de algo impossível\", diz Koene.\n\nA possibilidade teórica a que Koene se refere está baseada em como nossos cérebros funcionam - algo que a ciência ainda não respondeu.\n\nNossos cérebros são feitos de 86 bilhões de neurônios, células que enviam informações umas às outras por meio de descargas elétricas. Mas como o cérebro gera a mente ainda é um dos maiores mistérios da ciência, de acordo com o neurobiólogo Rafael Yuste, da Universidade Colúmbia (EUA). \"O desafio é exatamente como sairmos de uma conjunção de células conectadas no interior do cérebro para o mundo mental - pensamentos, memórias e sentimentos\", explica.\n\nPara tentar desvendar esse mecanismo, muitos cientistas tratam o cérebro como um computador. Nessa analogia, o computador recebe dados (informações sensoriais) e os transforma em resultados (comportamentos) por meio de cálculos. Este é o argumento que norteia a possibilidade teórica de transferência da mente. Se o processo cerebral pudesse ser mapeado, poderia ser possível copiar o cérebro em um computador, juntamente com a mente criada por ele.\n\nIsso é o que pensa Ken Hayworth, neurocientista que durante o dia mapeia cérebros de ratos no Centro de Pesquisas Janelia, nos EUA, e à noite lida com o problema de como fazer o upload de suas mentes. Hayworth acredita que o mapeamento do conectoma - a complexa rede de conexões entre neurônios - é a chave para a solução do problema, pois é da opinião de que elas contêm as informações que fazem de nós o que somos.\n\n\"Da mesma maneira que meu computador é apenas uns e zeros e um disco rígido (a linguagem binária), e eu não me importo com que acontecer desde que esses uns e zeros passem para o próximo computador, deveria ser a mesma coisa comigo\", diz Hayworth.\n\n\"Não me importo se meu conectoma está implantado em meu corpo ou em um computador controlando um robô\".\n\n#O pesquisador, porém, é realista. \"Infelizmente, estamos muito distantes de um mapeamento do conectoma humano. Para se ter uma ideia, para mapearmos o cérebro de uma mosca, podem ser necessários até dois anos. Com a tecnologia de que dispomos hoje, mapear inteiramente um cérebro humano é impossível\".\n\nE há ainda outro desafio teórico. Mesmo que pudéssemos criar um diagrama da \"fiação\" do cérebro humano, a transferência da mente para um computador iria requerer a leitura constante da atividade dos neurônios.\n\nNessa área, Itskov pode obter uma ajuda inesperada, segundo Rafael Yuste, que ajudou a desenvolver o maior projeto do mundo em neurociência - o Brain Initiative, um programa de US$ 6 bilhões criado para estudar doenças cerebrais como o Alzheimer. Como parte do projeto, Yuste quer monitorar a interação contínua de neurônios. \"Queremos medir todas as emissões de neurônios de uma vez e ao mesmo tempo\".\n\nEste ângulo não se baseia no mapeamento do conectoma. Em um estudo que ainda não foi publicado, Yuste diz que pela primeira vez conseguiu visualizar as \"faíscas elétricas\" em um dos mais simples sistemas nervosos que conhecemos - o de um pequeno invertebrado chamado hidra. \"Foi bem empolgante. Mas ainda não podemos dizer o que esses padrões significam. É como escutar uma conversa em uma língua estrangeira que não entendemos\".\n\nNos próximos 15 anos, Yuste espera conseguir fazer o mesmo, além de interpretar a atividade dos neurônios em um cérebro de rato. Mas o objetivo máximo é ler a atividade do cérebro humano.\n\n\"Se o cérebro fosse um computador, você precisaria primeiro decifrar a mente ou fazer uma espécie de download antes de pensar em transferi-la. Então, penso que a Brain Initiative é um passo necessário para que isso aconteça\".\n\nAinda assim, Itskov tem um longo caminho pela frente - e é visto por muitos com ceticismo. Na Universidade Duke, o neurocientista brasileiro Miguel Nicolelis argumenta que a complexidade do cérebro humano não pode ser replicada. \"Você não tem como codificar intuição, beleza, amor ou ódio. Não há como algum dia vermos um cérebro humano reduzido a um meio digital\", afirma Nicolelis.\n\nYuste concorda que não há certeza sobre o funcionamento do cérebro e sua transferência para uma máquina. Ao mesmo tempo, porém, ele aponta para o fato de que a neurociência ainda não conseguiu explicar exatamente como o cérebro deu origem ao que somos para recomendar que a sociedade debata as consequências de um sucesso da empreitada de Itskov.\n\n\"O caminho que leva à maior compreensão do cérebro é o mesmo que pode, teoricamente, resultar na possibilidade do upload da mente. Os cientistas envolvidos nesses processos têm a responsabilidade de pensar nisso\".\n\nA justificativa é que, se possível, a transferência seria uma forma de clonagem de mentes. Mas Itskov diz não estar preocupado com questões éticas.\n\n\"Darei a mesma opinião que me foi dada por ninguém menos que o (líder budista) Dalai Lama quando o visitei, em 2013. Ele me disse que você pode fazer qualquer coisa se sua motivação for ajudar as pessoas\", diz o bilionário russo.\n\nYuste, que faz parte do conselho ético do Brain Initiative, está convencido de que a transferência de mentes é um tópico que deve ser discutido cuidadosamente. Mas Itskov já está fazendo planos para sua vida eterna. \"Imagino-me tendo vários corpos, um deles vivendo no espaço, e outro funcionando como um holograma, com minha consciência simplesmente se movendo de um lugar para o outro\".\n\nEstima-se que 107 bilhões de pessoas morreram antes de nós. À medida que nosso entendimento sobre o cérebro avançar nas próximas décadas, ficará mais claro se Itskov é um visionário ou mero sonhador.\n\n- Fonte: https://www.bbc.com/portuguese/noticias/2016/03/160314_bilionario_russo_imortal_fd",
			"added": 1551047204
		},
		{
			"topic_id": 3,
			"title": "Conectoma: cérebro humano começa a ser mapeado manualmente",
			"body": "#Conectoma humano\n\nAssim como o mapeamento dos genes permitiu a descrição do genoma humano, os cientistas estão tentando mapear o cérebro para construir o \"conectoma humano\".\n\nO conectoma conterá uma descrição da rede cerebral, constituída por alguma coisa ao redor de 70 bilhões de neurônios, que se calcula existirem no cérebro humano.\n\nPela primeira vez, cientistas do Instituto Max Planck, na Alemanha, conseguiram desenvolver programas de computador que estão permitindo começar essa tarefa - ainda que manualmente.\n\n#Teia cerebral\n\nO cérebro humano é o mais complexo de todos os órgãos, contendo bilhões de neurônios, cada um com suas projeções correspondentes, todos entrelaçados em uma teia tridimensional altamente complexa.\n\nAté o momento, o mapeamento desta vasta rede representa um desafio praticamente intransponível para os cientistas.\n\nPara se ter uma ideia, os pesquisadores alemães e seus novos programas de computador chamaram a atenção da comunidade científica mundial ao conseguir mapear uma rede neural de 100 neurônios - dos 70 bilhões que se estima existirem no cérebro!\n\nMas é um começo, porque os bilhões de neurônios e as centenas de milhares de quilômetros de circuitos neurais assustam tanto que parecia impossível reconstruir a rede cerebral em detalhe.\n\nAgora parece que pode dar trabalho e levar tempo, mas é possível fazê-lo.\n\n#Mapa 3D do cérebro\n\nCada neurônio está ligado a cerca de mil outros por meio de projeções finamente ramificadas, chamadas dendritos e axônios, e se comunica com esses outros mil através de sinais elétricos.\n\nAs conexões entre as células são fundamentais para o funcionamento do cérebro, por isso os neurocientistas estão interessados em entender a estrutura destes circuitos e reconstruí-lo em um mapa tridimensional.\n\nÉ esse mapa que seria o conectoma.\n\nComo nenhum computador atual é poderoso o suficiente para a tarefa, os pesquisadores ainda dependem do olho humano para destrinchar o emaranhado.\n\nNo entanto, o grande número de conexões celulares contidas mesmo em um fragmento ínfimo de tecido cerebral faz com que o desafio pareça mesmo impossível de ser vencido.\n\nA menos que ele seja partilhado entre um grande número de pessoas.\n\n#Jeito humano de fazer ciência\n\nMoritz Helmstaedter, Kevin Briggman e Winfried Denk agora testaram com sucesso esse \"jeito humano\" de fazer ciência.\n\nEles desenvolveram um software especial, chamado Rescop, que resume os resultados de vários anotadores humanos, produzindo uma imagem global.\n\nO Rescop é alimentado pelos resultados de um outro programa, o Knossos, que os estudantes usam para traçar as conexões entre os neurônios.\n\nNão é por acaso que o programa recebeu o nome do lendário palácio de Creta, famoso por seu labirinto: \"Traçar as conexões no cérebro é pelo menos tão difícil como encontrar o caminho para sair de um labirinto mitológico,\" explica Helmstaedter.\n\nDesta forma, e com a ajuda de mais de 70 estudantes da Universidade de Heidelberg, eles reconstruíram uma rede de 100 neurônios da retina de um camundongo com grande nível de detalhamento.\n\n#Circuito neural\n\nPara reconstruir o esquema de um circuito neural, os pesquisadores começam colorindo os neurônios de uma seção de tecido com metais pesados, para torná-los visíveis.\n\nUsando imagens tridimensionais feitas por um microscópio eletrônico, eles começam no corpo celular do neurônio e seguem os dendritos e axônios, marcando cada ponto de interconexão na tela - cada ponto é um nó da rede neural.\n\nEm seguida, eles usam o computador para gerar uma imagem tridimensional da seção. Desta forma, eles abrem o caminho através do emaranhado de neurônios passo a passo.\n\nA pesquisa pode ser promissora, mas é também entediante: uma pessoa trabalhando sozinha com os dois programas levaria pelo menos 30 anos para reconstruir uma rota neural de 30 centímetros de comprimento.\n\nAlém disso, a verificação e a anotação manuais estão sujeitas a erros, uma vez que os pontos de conexão entre as ramificações neuronais nem sempre são facilmente reconhecidos nas imagens, e a atenção do estudante diminui com o tempo.\n\n#Benefícios a curto prazo\n\nO programa Knossos deu ajudinha: ele diminuiu o tempo gasto na tarefa em 50 vezes e reduziu a margem de erro.\n\nDesta forma, em vez de termos que esperar milhares de séculos pelo conectoma completo, agora serão necessários apenas algumas centenas de séculos.\n\nOu, quem sabe, os cientistas ponham seus cérebros para funcionar e inventem uma maneira melhor de fazer o trabalho.\n\nA boa notícia é que não será necessário esperar que todo o conectoma esteja pronto para que os cientistas comecem a se beneficiar de um mapeamento das redes neurais humanas: mesmo parcelas pequenas da rede completa poderão ajudar a tratar condições específicas, assim como usar os insights da pesquisa para criar redes neurais artificiais, que imitem o cérebro humano.\n\n- Fonte: https://www.diariodasaude.com.br/news.php?article=conectoma-mapeamento-cerebro-humano",
			"added": 1551047937
		},
		{
			"topic_id": 4,
			"title": "ZeroStockfishChess",
			"body": "Jogo de Xadrez na ZeroNet, você pode ajustar a dificuldade da IA e jogar a vontade, desfrutem!\n\nLink: http://127.0.0.1:43110/12QcqRDS7cRJ7JCgTCMo8ZTu7bP5aQ4RYR/",
			"added": 1551050465
		},
		{
			"topic_id": 5,
			"title": "ZeroPub",
			"body": "ZeroPub é uma biblioteca de livros da ZeroNet em que são publicados livros em formato EPUB. O site disponibiliza livros nas linguagens Inglês e Espanhol.\n\nLink: http://127.0.0.1:43110/zeropub.bit",
			"added": 1551051115
		}
	],
	"topic_vote": {
		"1_15ZCzHPEspA94YwXMHBrrDspmVc1RiaQJr": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1,
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": 1,
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1,
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"2_15ZCzHPEspA94YwXMHBrrDspmVc1RiaQJr": 1,
		"3_15ZCzHPEspA94YwXMHBrrDspmVc1RiaQJr": 1,
		"4_15ZCzHPEspA94YwXMHBrrDspmVc1RiaQJr": 1,
		"5_15ZCzHPEspA94YwXMHBrrDspmVc1RiaQJr": 1,
		"4_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1
	},
	"next_comment_id": 26,
	"comment": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 1,
				"body": "Ainda que eu fale as línguas dos homens e dos anjos, se não tiver amor, serei como o sino que ressoa ou como o prato que retine.\nAinda que eu tenha o dom de profecia e saiba todos os mistérios e todo o conhecimento, e tenha uma fé capaz de mover montanhas, mas não tiver amor, nada serei.\nAinda que eu dê aos pobres tudo o que possuo e entregue o meu corpo para ser queimado, mas não tiver amor, nada disso me valerá.\nO amor é paciente, o amor é bondoso. Não inveja, não se vangloria, não se orgulha.\nNão maltrata, não procura seus interesses, não se ira facilmente, não guarda rancor.\nO amor não se alegra com a injustiça, mas se alegra com a verdade.\nTudo sofre, tudo crê, tudo espera, tudo suporta.\nO amor nunca perece; mas as profecias desaparecerão, as línguas cessarão, o conhecimento passará.\nPois em parte conhecemos e em parte profetizamos;\nquando, porém, vier o que é perfeito, o que é imperfeito desaparecerá.\nQuando eu era menino, falava como menino, pensava como menino e raciocinava como menino. Quando me tornei homem, deixei para trás as coisas de menino.\nAgora, pois, vemos apenas um reflexo obscuro, como em espelho; mas, então, veremos face a face. Agora conheço em parte; então, conhecerei plenamente, da mesma forma como sou plenamente conhecido.\n#Assim, permanecem agora estes três: a fé, a esperança e o amor. O maior deles, porém, é o amor.\n\n- 1 Coríntios 13:1-13",
				"added": 1551026485
			},
			{
				"comment_id": 4,
				"body": "Simão Pedro, servo e apóstolo de Jesus Cristo, àqueles que, mediante a justiça de nosso Deus e Salvador Jesus Cristo, receberam conosco uma fé igualmente valiosa:\nGraça e paz lhes sejam multiplicadas, pelo pleno conhecimento de Deus e de Jesus, o nosso Senhor.\nSeu divino poder nos deu todas as coisas de que necessitamos para a vida e para a piedade, por meio do pleno conhecimento daquele que nos chamou para a sua própria glória e virtude.\nPor intermédio destas ele nos deu as suas grandiosas e preciosas promessas, para que por elas vocês se tornassem participantes da natureza divina e fugissem da corrupção que há no mundo, causada pela cobiça.\nPor isso mesmo, empenhem-se para acrescentar à sua fé a virtude; à virtude o conhecimento;\nao conhecimento o domínio próprio; ao domínio próprio a perseverança; à perseverança a piedade;\nà piedade a fraternidade; e à fraternidade o amor.\nPorque, se essas qualidades existirem e estiverem crescendo em suas vidas, elas impedirão que vocês, no pleno conhecimento de nosso Senhor Jesus Cristo, sejam inoperantes e improdutivos.\nTodavia, se alguém não as tem, está cego, só vê o que está perto, esquecendo-se da purificação dos seus antigos pecados.\nPortanto, irmãos, empenhem-se ainda mais para consolidar o chamado e a eleição de vocês, pois se agirem dessa forma, jamais tropeçarão,\ne assim vocês estarão ricamente providos quando entrarem no Reino eterno de nosso Senhor e Salvador Jesus Cristo.\nPor isso, sempre terei o cuidado de lembrar-lhes estas coisas, se bem que vocês já as sabem e estão solidamente firmados na verdade que receberam.\nConsidero importante, enquanto estiver no tabernáculo deste corpo, despertar a memória de vocês,\nporque sei que em breve deixarei este tabernáculo, como o nosso Senhor Jesus Cristo já me revelou.\nEu me empenharei para que, também depois da minha partida, vocês sejam sempre capazes de lembrar-se destas coisas.\nDe fato, não seguimos fábulas engenhosamente inventadas, quando lhes falamos a respeito do poder e da vinda de nosso Senhor Jesus Cristo; pelo contrário, nós fomos testemunhas oculares da sua majestade.\nEle recebeu honra e glória da parte de Deus Pai, quando da suprema glória lhe foi dirigida a voz que disse: \"Este é o meu filho amado, em quem me agrado\".\nNós mesmos ouvimos essa voz vinda do céu, quando estávamos com ele no monte santo.\nAssim, temos ainda mais firme a palavra dos profetas, e vocês farão bem se a ela prestarem atenção, como a uma candeia que brilha em lugar escuro, até que o dia clareie e a estrela da alva nasça em seus corações.\n#Antes de mais nada, saibam que nenhuma profecia da Escritura provém de interpretação pessoal,\n#pois jamais a profecia teve origem na vontade humana, mas homens falaram da parte de Deus, impelidos pelo Espírito Santo.\n\n- 2 Pedro 1:1-21\n\n*************************************************************************************************************************\n\nNo passado surgiram falsos profetas no meio do povo, como também surgirão entre vocês falsos mestres. Estes introduzirão secretamente heresias destruidoras, chegando a negar o Soberano que os resgatou, trazendo sobre si mesmos repentina destruição.\nMuitos seguirão os caminhos vergonhosos desses homens e, por causa deles, será difamado o caminho da verdade.\nEm sua cobiça, tais mestres os explorarão com histórias que inventaram. Há muito tempo a sua condenação paira sobre eles, e a sua destruição não tarda.\nPois Deus não poupou os anjos que pecaram, mas os lançou no inferno, prendendo-os em abismos tenebrosos a fim de serem reservados para o juízo.\nEle não poupou o mundo antigo quando trouxe o dilúvio sobre aquele povo ímpio, mas preservou Noé, pregador da justiça, e mais sete pessoas.\nTambém condenou as cidades de Sodoma e Gomorra, reduzindo-as a cinzas, tornando-as exemplo do que acontecerá aos ímpios;\nmas livrou Ló, homem justo, que se afligia com o procedimento libertino dos que não tinham princípios morais\n( pois, vivendo entre eles, todos os dias aquele justo se atormentava em sua alma justa por causa das maldades que via e ouvia ).\nVemos, portanto, que o Senhor sabe livrar os piedosos da provação e manter em castigo os ímpios para o dia do juízo,\nespecialmente os que seguem os desejos impuros da carne e desprezam a autoridade. Insolentes e arrogantes, tais homens não têm medo de difamar os seres celestiais;\ncontudo, nem os anjos, embora sendo maiores em força e poder, fazem acusações injuriosas contra aqueles seres na presença do Senhor.\nMas eles difamam o que desconhecem e são como criaturas irracionais, guiadas pelo instinto, nascidas para serem capturadas e destruídas; serão corrompidos pela sua própria corrupção!\nEles receberão retribuição pela injustiça que causaram. Consideram prazer entregar-se à devassidão em plena luz do dia. São nódoas e manchas, regalando-se em seus prazeres, quando participam das festas de vocês.\nTendo os olhos cheios de adultério, nunca param de pecar, iludem os instáveis e têm o coração exercitado na ganância. Malditos!\nEles abandonaram o caminho reto e se desviaram, seguindo o caminho de Balaão, filho de Beor, que amou o salário da injustiça,\nmas em sua transgressão foi repreendido por uma jumenta, um animal mudo, que falou com voz humana e refreou a insensatez do profeta.\nEsses homens são fontes sem água e névoas impelidas pela tempestade. A escuridão das trevas lhes está reservada,\npois eles, com palavras de vaidosa arrogância e provocando os desejos libertinos da carne, seduzem os que estão quase conseguindo fugir daqueles que vivem no erro.\nPrometendo-lhes liberdade, eles mesmos são escravos da corrupção, pois o homem é escravo daquilo que o domina.\nSe, tendo escapado das contaminações do mundo por meio do conhecimento de nosso Senhor e Salvador Jesus Cristo, encontram-se novamente nelas enredados e por elas dominados, estão em pior estado do que no princípio.\nTeria sido melhor que não tivessem conhecido o caminho da justiça, do que, depois de o terem conhecido, voltarem as costas para o santo mandamento que lhes foi transmitido.\nConfirma-se neles que é verdadeiro o provérbio: \"O cão voltou ao seu vômito\" e ainda: \"A porca lavada voltou a revolver-se na lama\".\n\n- 2 Pedro 2:1-22\n\n*************************************************************************************************************************\n\nAmados, esta é agora a segunda carta que lhes escrevo. Em ambas quero despertar com estas lembranças a sua mente sincera para que vocês se lembrem\ndas palavras proferidas no passado pelos santos profetas, e do mandamento de nosso Senhor e Salvador que os apóstolos de vocês lhes ensinaram.\nAntes de tudo saibam que, nos últimos dias, surgirão escarnecedores zombando e seguindo suas próprias paixões.\nEles dirão: \"O que houve com a promessa da sua vinda? Desde que os antepassados morreram, tudo continua como desde o princípio da criação\".\nMas eles deliberadamente se esquecem de que há muito tempo, pela palavra de Deus, existiam céus e terra, esta formada da água e pela água.\nE pela água o mundo daquele tempo foi submerso e destruído.\nPela mesma palavra os céus e a terra que agora existem estão reservados para o fogo, guardados para o dia do juízo e para a destruição dos ímpios.\nNão se esqueçam disto, amados: para o Senhor um dia é como mil anos, e mil anos como um dia.\nO Senhor não demora em cumprir a sua promessa, como julgam alguns. Pelo contrário, ele é paciente com vocês, não querendo que ninguém pereça, mas que todos cheguem ao arrependimento.\nO dia do Senhor, porém, virá como ladrão. Os céus desaparecerão com um grande estrondo, os elementos serão desfeitos pelo calor, e a terra, e tudo o que nela há, será desnudada.\nVisto que tudo será assim desfeito, que tipo de pessoas é necessário que vocês sejam? Vivam de maneira santa e piedosa,\nesperando o dia de Deus e apressando a sua vinda. Naquele dia os céus serão desfeitos pelo fogo, e os elementos se derreterão pelo calor.\nTodavia, de acordo com a sua promessa, esperamos novos céus e nova terra, onde habita a justiça.\nPortanto, amados, enquanto esperam estas coisas, empenhem-se para serem encontrados por ele em paz, imaculados e inculpáveis.\nTenham em mente que a paciência de nosso Senhor significa salvação, como também o nosso amado irmão Paulo lhes escreveu, com a sabedoria que Deus lhe deu.\nEle escreve da mesma forma em todas as suas cartas, falando nelas destes assuntos. Suas cartas contêm algumas coisas difíceis de entender, as quais os ignorantes e instáveis torcem, como também o fazem com as demais Escrituras, para a própria destruição deles.\nPortanto, amados, sabendo disso, guardem-se para que não sejam levados pelo erro dos que não têm princípios morais, nem percam a sua firmeza e caiam.\nCresçam, porém, na graça e no conhecimento de nosso Senhor e Salvador Jesus Cristo. A ele seja a glória, agora e para sempre! Amém.\n\n- 2 Pedro 3:1-18",
				"added": 1551029505
			},
			{
				"comment_id": 8,
				"body": "#Onde Jesus nasceu?\n\nA Bíblia diz que Jesus nasceu numa pequena cidade chamada Belém, na Judéia. Seus pais foram para Belém por causa de um recenseamento. Belém fica cerca de 8 quilômetros a sul de Jerusalém.\n\n#Belém no tempo de Jesus\n\nNo tempo de Jesus, Belém era só uma cidade pequena, ou uma aldeia, também conhecida como Belém Efrata. Belém era famosa por ser a cidade onde o rei Davi tinha nascido. Tinha sido profetizado que o Salvador iria nascer em Belém (Miquéias 5:2).\n\nQuando Jesus nasceu, Israel estava debaixo do domínio romano. Os romanos tinham dividido Israel em territórios romanos, os principais sendo a Judéia e a Galileia. Belém ficava na Judéia (Lucas 2:4).\n\nQuando o imperador romano ordenou um recenseamento do povo, José e Maria tiveram que ir para Belém, terra natal de José, para se alistar. Maria estava grávida e enquanto estavam lá ela teve o filho, que chamaram Jesus. Como não havia espaço na hospedaria, colocaram o menino numa manjedoura (Lucas 2:6-7).\n\nQuando os magos vieram visitar Jesus, foram primeiro visitar Herodes, perguntando pelo novo rei. Os sacerdotes explicaram ao rei Herodes que o Cristo deveria nascer em Belém. Com medo de perder o trono para o novo rival, Herodes mandou matar todos os meninos de Belém com menos de dois anos. Mas Jesus e seus pais escaparam e fugiram para o Egito (Mateus 2:14-16).\n\nProvavelmente não temos outros relatos históricos sobre o massacre em Belém porque era um lugar muito pequeno. Barbaridades eram frequentes e algumas dezenas de crianças mortas não teriam sido notícia.\n\n#Por que Jesus era conhecido como o “nazareno”?\n\nJesus era conhecido como o “nazareno” porque cresceu na cidade de Nazaré. Depois da morte de Herodes, Jesus e seus pais voltaram do Egito e passaram a morar em Nazaré, onde seus pais tinham morado antes (Mateus 2:21-23).\n\nO nascimento de Jesus em Belém não era um fato muito conhecido. Algumas pessoas até tentaram provar que ele não era o Messias porque pensavam que tinha nascido em Nazaré (João 7:41-42). Em Jesus foram cumpridas duas profecias que pareciam conflitantes: ele nasceu em Belém mas ficou conhecido como nazareno.\n\n- Fonte: https://www.respostas.com.br/onde-jesus-nasceu/",
				"added": 1551035086
			},
			{
				"comment_id": 9,
				"body": "#Quando Jesus nasceu?\n\nNinguém sabe a data exata quando Jesus nasceu. Ele provavelmente nasceu entre 6 e 4 a.C, antes do inverno. Jesus provavelmente não nasceu no dia 25 de Dezembro mas não é errado celebrar o Natal nesse dia.\n\n#Em que dia Jesus nasceu?\n\nA Bíblia não diz em que dia ou mês Jesus nasceu. Mas pela informação na Bíblia podemos concluir que provavelmente não foi no inverno. Os pastores que visitaram Jesus estavam tomando conta das ovelhas à noite no campo (Lucas 2:8-9). Durante o inverno as ovelhas eram guardadas dentro de estábulos à noite, por causa do frio.\n\n#Algumas pessoas sugerem que Jesus nasceu no outono, baseado no nascimento de João Batista:\n\n   - O pai de João Batista, Zacarias, estava trabalhando como sacerdote quando ouviu que iria ter um filho – Lucas 1:8-9\n   - Os sacerdotes trabalhavam em 24 turnos, cada turno trabalhando por uma semana\n   - De acordo com o calendário judeu, o turno de Zacarias trabalharia uma semana em Maio ou Junho\n   - Se Isabel concebeu em Junho, João Batista teria nascido em Março – Lucas 1:23-24\n   - Jesus foi concebido cerca de seis meses depois de João Batista, por isso tinham meio ano de diferença – Lucas 1:26-27\n   - Se João Batista nasceu em Março, Jesus teria nascido em Setembro\n\nEssa é apenas uma teoria, não podemos ter a certeza que Jesus nasceu em Setembro. Existem muitas variáveis e cálculos diferentes apontam para datas diferentes.\n\n#Por que celebramos a 25 de Dezembro?\n\nCelebramos o nascimento de Jesus no dia 25 de dezembro porque se tornou uma data popular. Essa data se tornou uma festa cristã alguns séculos depois de Cristo.\n\nAlgumas pessoas sugerem que o Natal foi criado para substituir uma festa pagã ligada ao solstício de inverno (o dia mais curto do ano). Em vez de celebrar deuses pagãos, os cristãos eram convidados a lembrar de Jesus, que é a luz do mundo (João 8:12).\n\nTambém é bom lembrar que os pagãos não eram os únicos que tinham uma festa nessa altura do ano. Os judeus tinham uma festa chamada Hanukkah, ou “festa das luzes”. O solstício de inverno acontece alguns dias antes do Natal. Os cristãos podem ter escolhido o dia 25 de propósito para mostrar que não era uma festa pagã.\n\nNão há nada errado em celebrar o nascimento de Jesus no dia 25 de dezembro. Não estamos afirmando que ele nasceu nesse dia exato, mas lembramos que ele realmente nasceu para nos salvar. Esse é um bom motivo para celebrar!\n\n#Em que ano Jesus nasceu?\n\nJesus provavelmente nasceu entre 6 e 4 a.C. O rei Herodes, que tentou matar Jesus, morreu por volta de 4 a.C. A fuga de Jesus com seus pais provavelmente aconteceu pouco antes da morte de Herodes. O rei mandou matar todos os meninos com menos de 2 anos porque pensava que Jesus poderia ter até 2 anos de idade (Mateus 2:16).\n\nDe acordo com nosso calendário, Jesus devia ter nascido no ano 1. Mas nosso calendário só foi criado alguns séculos depois do tempo de Jesus e houve um pequeno erro nos cálculos. Isso criou a situação engraçada de Jesus ter nascido alguns anos antes de Cristo!\n\n- Fonte: https://www.respostas.com.br/quando-jesus-nasceu/",
				"added": 1551035259
			},
			{
				"comment_id": 10,
				"body": "#Quem foram os 12 apóstolos?\nOs 12 apóstolos foram: Simão (também chamado Pedro), André, Tiago (filho de Zebedeu), João, Filipe, Bartolomeu, Tomé, Mateus, Tiago (filho de Alfeu), Tadeu (também chamado Judas), Simão (o zelote) e Judas Iscariotes (Mateus 10:2-4; Lucas 6:13-16). Eles acompanharam Jesus durante o Seu ministério e foram chamados para proclamar o evangelho ao mundo. Segundo tradição, só João morreu de causas naturais.\n\n#O que significa apóstolo?\n\n“Apóstolo” significa “enviado”. Os apóstolos foram 12 pessoas que acompanharam Jesus e tinham intimidade com Ele. Jesus deu treino especial aos apóstolos, para anunciar o evangelho e fundar a Sua Igreja.\n\nDepois do Pentecostes, eles se tornaram os líderes da igreja primitiva, ensinando o que tinham aprendido com Jesus e criando uma base sólida para o crescimento da igreja. Eles viajaram para outras terras e fundaram igrejas em muitos lugares, através dos seus testemunhos sobre Jesus e de milagres. Muita da informação dos Evangelhos provavelmente foi fornecida pelos apóstolos.\n\n#Houve outros apóstolos?\n\nSim, houve mais apóstolos. Depois que Judas Iscariotes traiu Jesus e cometeu suicídio, os outros apóstolos lançaram sortes para escolher uma pessoa para tomar seu lugar. A pessoa escolhida foi Matias, que também tinha acompanhado Jesus durante todo o Seu ministério (Atos dos Apóstolos 1:26).\n\nPaulo também foi considerado um apóstolo. Ele não acompanhou o ministério de Jesus mas O viu glorificado em uma visão depois que ressuscitou. Ele se converteu e pregou o evangelho a muitos gentios. Seu trabalho foi reconhecido como o trabalho de um apóstolo (Atos dos Apóstolos 14:14).\n\nA Bíblia também lista Barnabé, Andrônico e Júnias como apóstolos (Romanos 16:7). Provavelmente foram pessoas que aprenderam de Jesus ou dos primeiros apóstolos e que espalhavam o evangelho com a mesma autoridade.\n\n#Ainda há apóstolos?\n\nO título de apóstolo deixou de ser usado, por estar ligado geralmente a pessoas que viram Jesus quando estava aqui na terra. Mas todo o cristão é enviado por Jesus para anunciar o evangelho às pessoas à sua volta. Quem obedece a esse mandamento segue nos passos dos apóstolos, que deram tudo para que muitas pessoas conhecessem Jesus.\n\n- Fonte: https://www.respostas.com.br/quem-foram-os-12-apostolos/",
				"added": 1551035928
			},
			{
				"comment_id": 11,
				"body": "\"Eu sou a videira verdadeira, e meu Pai é o agricultor.\nTodo ramo que, estando em mim, não dá fruto, ele corta; e todo que dá fruto ele poda, para que dê mais fruto ainda.\nVocês já estão limpos, pela palavra que lhes tenho falado.\nPermaneçam em mim, e eu permanecerei em vocês. Nenhum ramo pode dar fruto por si mesmo, se não permanecer na videira. Vocês também não podem dar fruto, se não permanecerem em mim.\n\"Eu sou a videira; vocês são os ramos. Se alguém permanecer em mim e eu nele, esse dá muito fruto; pois sem mim vocês não podem fazer coisa alguma.\nSe alguém não permanecer em mim, será como o ramo que é jogado fora e seca. Tais ramos são apanhados, lançados ao fogo e queimados.\nSe vocês permanecerem em mim, e as minhas palavras permanecerem em vocês, pedirão o que quiserem, e lhes será concedido.\nMeu Pai é glorificado pelo fato de vocês darem muito fruto; e assim serão meus discípulos.\n\"Como o Pai me amou, assim eu os amei; permaneçam no meu amor.\nSe vocês obedecerem aos meus mandamentos, permanecerão no meu amor, assim como tenho obedecido aos mandamentos de meu Pai e em seu amor permaneço.\nTenho lhes dito estas palavras para que a minha alegria esteja em vocês e a alegria de vocês seja completa.\nO meu mandamento é este: amem-se uns aos outros como eu os amei.\nNinguém tem maior amor do que aquele que dá a sua vida pelos seus amigos.\nVocês serão meus amigos, se fizerem o que eu lhes ordeno.\nJá não os chamo servos, porque o servo não sabe o que o seu senhor faz. Em vez disso, eu os tenho chamado amigos, porque tudo o que ouvi de meu Pai eu lhes tornei conhecido.\nVocês não me escolheram, mas eu os escolhi para irem e darem fruto, fruto que permaneça, a fim de que o Pai lhes conceda o que pedirem em meu nome.\nEste é o meu mandamento: amem-se uns aos outros\".\n\"Se o mundo os odeia, tenham em mente que antes odiou a mim.\nSe vocês pertencessem ao mundo, ele os amaria como se fossem dele. Todavia, vocês não são do mundo, mas eu os escolhi, tirando-os do mundo; por isso o mundo os odeia.\nLembrem-se das palavras que eu lhes disse: nenhum escravo é maior do que o seu senhor. Se me perseguiram, também perseguirão vocês. Se obedeceram à minha palavra, também obedecerão à de vocês.\nTratarão assim vocês por causa do meu nome, pois não conhecem aquele que me enviou.\nSe eu não tivesse vindo e lhes falado, não seriam culpados de pecado. Agora, contudo, eles não têm desculpa para o seu pecado.\nAquele que me odeia, também odeia o meu Pai.\nSe eu não tivesse realizado no meio deles obras que ninguém mais fez, eles não seriam culpados de pecado. Mas agora eles as viram e odiaram a mim e a meu Pai.\nMas isto aconteceu para se cumprir o que está escrito na Lei deles: ‘Odiaram-me sem razão’.\n\"Quando vier o Conselheiro, que eu enviarei a vocês da parte do Pai, o Espírito da verdade que provém do Pai, ele testemunhará a meu respeito.\nE vocês também testemunharão, pois estão comigo desde o princípio\".\n\n- João 15:1-27",
				"added": 1551036437
			},
			{
				"comment_id": 12,
				"body": "Saiba disto: nos últimos dias sobrevirão tempos terríveis.\nOs homens serão egoístas, avarentos, presunçosos, arrogantes, blasfemos, desobedientes aos pais, ingratos, ímpios,\nsem amor pela família, irreconciliáveis, caluniadores, sem domínio próprio, cruéis, inimigos do bem,\ntraidores, precipitados, soberbos, mais amantes dos prazeres do que amigos de Deus,\ntendo aparência de piedade, mas negando o seu poder. Afaste-se também destes.\nSão estes os que se introduzem pelas casas e conquistam mulherzinhas sobrecarregadas de pecados, as quais se deixam levar por toda espécie de desejos.\nElas estão sempre aprendendo, mas não conseguem nunca de chegar ao conhecimento da verdade.\nComo Janes e Jambres se opuseram a Moisés, esses também resistem à verdade. A mente deles é depravada; são reprovados na fé.\nNão irão longe, porém; como no caso daqueles, a sua insensatez se tornará evidente a todos.\nMas você tem seguido de perto o meu ensino, a minha conduta, o meu propósito, a minha fé, a minha paciência, o meu amor, a minha perseverança,\nas perseguições e os sofrimentos que enfrentei, coisas que me aconteceram em Antioquia, Icônio e Listra. Quanta perseguição suportei! Mas, de todas essas coisas o Senhor me livrou!\nDe fato, todos os que desejam viver piedosamente em Cristo Jesus serão perseguidos.\nContudo, os perversos e impostores irão de mal a pior, enganando e sendo enganados.\nQuanto a você, porém, permaneça nas coisas que aprendeu e das quais tem convicção, pois você sabe de quem o aprendeu.\nPorque desde criança você conhece as sagradas letras, que são capazes de torná-lo sábio para a salvação mediante a fé em Cristo Jesus.\nToda a Escritura é inspirada por Deus e útil para o ensino, para a repreensão, para a correção e para a instrução na justiça,\npara que o homem de Deus seja apto e plenamente preparado para toda boa obra.\n\n- 2 Timóteo 3:1-17",
				"added": 1551036605
			},
			{
				"comment_id": 13,
				"body": "#Entregue sua vida a Jesus\n\nPara quem não tem Jesus, ter medo da morte é uma atitude sensata. A morte é assustadora. Mas Jesus veio para nos libertar da morte. Quando ressuscitou, Jesus derrotou a morte. Agora a morte não tem mais poder.\n\nPara quem tem Jesus no seu coração, a morte já não é motivo de medo (1 Coríntios 15:55-57). Quando morrermos vamos estar para sempre junto de Deus, sem mais tristeza nem sofrimento. Vamos ressuscitar e viver para sempre num lugar muito melhor. Se você ainda não entregou sua vida a Jesus, convide-o a morar dentro do seu coração hoje (Romanos 10:9-10). Jesus lhe ama e quer estar com você para sempre.",
				"added": 1551036922
			},
			{
				"comment_id": 14,
				"body": "#GUIA DE ESTUDO DO LIVRO DE APOCALIPSE \n\n- https://web.archive.org/web/20140724062345/https://perrybrown.files.wordpress.com/2010/09/guia-de-estudo-do-livro-de-apocalipse.pdf",
				"added": 1551038431
			},
			{
				"comment_id": 16,
				"body": "#Apocalipse\n\nApocalipse significa revelação. O livro de Apocalipse é uma revelação que Jesus deu a João sobre os acontecimentos do fim dos tempos. Por isso, a palavra apocalipse ficou associada ao fim do mundo.\n\nApocalipse é uma palavra grega que significa revelar, no sentido de mostrar uma coisa que antes estava oculta ou escondida. O livro de Apocalipse ganhou esse nome porque é a primeira palavra do livro. Apocalipse 1:1 explica que o livro conta sobre coisas que vão acontecer no futuro. Apocalipse é um livro de profecia.\n\n- http://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:1_15ZCzHPEspA94YwXMHBrrDspmVc1RiaQJr/O+Apocalipse+de+Jo+o",
				"added": 1551041036
			},
			{
				"comment_id": 18,
				"body": "#Não se aborreça por causa dos homens maus e não tenha inveja dos perversos;\npois como o capim logo secarão, como a relva verde logo murcharão.\nConfie no Senhor e faça o bem; assim você habitará na terra e desfrutará segurança.\nDeleite-se no Senhor, e ele atenderá aos desejos do seu coração.\n#Entregue o seu caminho ao Senhor; confie nele, e ele agirá:\nEle deixará claro como a alvorada que você é justo, e como o sol do meio-dia que você é inocente.\n#Descanse no Senhor e aguarde por ele com paciência; não se aborreça com o sucesso dos outros, nem com aqueles que maquinam o mal.\n#Evite a ira e rejeite a fúria; não se irrite: isso só leva ao mal.\n#Pois os maus serão eliminados, mas os que esperam no Senhor receberão a terra por herança.\nUm pouco de tempo, e os ímpios não mais existirão; por mais que os procure, não serão encontrados.\nMas os humildes receberão a terra por herança e desfrutarão pleno bem-estar.\nOs ímpios tramam contra os justos e rosnam contra eles;\no Senhor, porém, ri dos ímpios, pois sabe que o dia deles está chegando.\nOs ímpios desembainham a espada e preparam o arco para abaterem o necessitado e o pobre, para matarem os que andam na retidão.\nMas as suas espadas lhes atravessará o coração, e os seus arcos serão quebrados.\n#Melhor é o pouco do justo do que a riqueza de muitos ímpios;\npois o braço forte dos ímpios será quebrado, mas o Senhor sustém os justos.\nO Senhor cuida da vida dos íntegros, e a herança deles permanecerá para sempre.\nEm tempos de adversidade não ficarão decepcionados; em dias de fome desfrutarão fartura.\nMas os ímpios perecerão; Os inimigos do Senhor murcharão como a beleza dos campos; desvanecerão como fumaça.\nOs ímpios tomam emprestado e não devolvem, mas os justos dão com generosidade;\naqueles que o Senhor abençoa receberão a terra por herança, mas os que ele amaldiçoa serão eliminados.\nO Senhor firma os passos de um homem, quando a conduta deste o agrada;\nainda que tropece, não cairá, pois o Senhor o toma pela mão.\nJá fui jovem e agora sou velho, mas nunca vi o justo desamparado, nem seus filhos mendigando o pão.\nEle é sempre generoso e empresta com boa vontade; seus filhos serão abençoados.\nDesvie-se do mal e faça o bem; e você terá sempre onde morar.\nPois o Senhor ama quem pratica a justiça, e não abandonará os seus fiéis. Para sempre serão protegidos, mas a descendência dos ímpios será eliminada;\nos justos herdarão a terra e nela habitarão para sempre.\nA boca do justo profere sabedoria, e a sua língua fala conforme a justiça.\nEle traz no coração a lei do seu Deus; nunca pisará em falso.\nO ímpio fica à espreita do justo, querendo matá-lo;\nmas o Senhor não o deixará cair em suas mãos, nem permitirá que o condenem quando julgado.\nEspere no Senhor e siga a sua vontade. Ele o exaltará, dando-lhe a terra por herança; quando os ímpios forem eliminados, você o verá.\nVi um homem ímpio e cruel florescendo como frondosa árvore nativa,\nmas logo desapareceu e não mais existia; embora eu o procurasse, não pôde ser encontrado.\nConsidere o íntegro, observe o justo; há futuro para o homem de paz.\nMas todos os rebeldes serão destruídos; futuro para os ímpios, nunca haverá.\n#Do Senhor vem a salvação dos justos; ele é a sua fortaleza na hora da adversidade.\n#O Senhor os ajuda e os livra; ele os livra dos ímpios e os salva, porque nele se refugiam.\n\n- Salmos 37:1-40",
				"added": 1551042866
			}
		],
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": [
			{
				"comment_id": 2,
				"body": "#A filosofia da ciência de Karl Popper : o racionalismo crítico\n\n A filosofia de Karl Popper - o racionalismo crítico - é apresentada. Para ele todo o conhecimento é falível e corregível, virtualmente provisório. O conhecimento científico é criado, construído e não descoberto em conjuntos de dados empíricos. A refutabilidade demarca a ciência da não-ciência e a atitude de colocar sob crítica toda e qualquer teoria permite o aprimoramento do conhecimento científico. A teoria do conhecimento, dos Três Mundos e o problema cérebro-mente são discutidos. \n\n- https://web.archive.org/web/20150906015644/https://www.if.ufrgs.br/~lang/Textos/POPPER.pdf",
				"added": 1551028336
			},
			{
				"comment_id": 6,
				"body": "#\"Se exigirmos que o conhecimento, que a ciência seja comprovável, isso nos leva [...] a um regresso infinito. Pois cada demonstração consiste de premissas e conclusões, de proposições iniciais e finais; e se as proposições iniciais não forem provadas, as proposições finais também não o são\"\n\n- Karl Popper",
				"added": 1551032777
			}
		],
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 3,
				"body": "#Guerra cibernética poderia causar um evento na biblioteca de Alexandria?\n\n- Depende do que você entende por \"guerra cibernética\".\n\nAlexandria, uma nova startup baseada em blockchain, está construindo um repositório de conhecimento descentralizado - e, segundo seus fundadores esperam, não censurável. O objetivo? Para evitar um evento da Biblioteca de Alexandria, em que uma massa crítica de conhecimento humano é destruída de uma só vez.\n\n\"Nós escolhemos o nome ... como uma homenagem à antiga biblioteca de Alexandria, porque ele é conhecido pela maioria das pessoas por dois motivos\", explicou o fundador da Alexandria, Devon Read. \"Primeiro, foi um grande exemplo histórico de um esforço monumental para coletar o máximo de conhecimento registrado e história possível para o benefício de seus povos e gerações futuras, e a segunda parte de seus conteúdos foi infelizmente destruída, um fracasso tornado possível pelo fato de que foi centralizado \".\n\nMas isso é realmente uma preocupação? Nós não armazenamos mais informações em pergaminhos de papiro ou pergaminho de pergaminho. Poderia um evento da Biblioteca de Alexandria acontecer em nosso tempo?\n\nUm bibliotecário está preocupado. Alison Macrina, do Library Freedom Project, escreveu em um e-mail: \"Esta é absolutamente uma possibilidade, dado que os livros impressos estão em declínio e os ebooks, bloqueados com DRM, começaram a substituí-los. Isso apresenta uma série de problemas: a destruição de arquivamento digital, bem como censura, vigilância e ameaças à própria existência de bibliotecas. \"\n\nAo contrário do mundo antigo, explicou ela, as bibliotecas modernas existem apenas por causa da doutrina da primeira venda, que permite às bibliotecas comprar uma cópia de um livro e emprestá-lo quantas vezes quiserem, para quem quiserem, em perpetuidade.\n\nMas \"isso é completamente erradicado com os ebooks, porque não apenas destrói os direitos de propriedade (você só compra uma licença, você não possui o título), as algemas DRM impedem que as bibliotecas emprestem o título como desejarem\". ela escreveu.\n\nAs taxas de empréstimo de livros eletrônicos nas bibliotecas continuam a crescer, e os bibliotecários estão gastando cada vez mais seus orçamentos de cobrança em cópias digitais, e não em impressões. Mas como a maioria dos usuários de bibliotecas acessa esses ebooks por meio de um proxy - no caso de bibliotecas, os servidores centralizados do OverDrive, que detêm quase o monopólio do mercado de e-books de bibliotecas - qualquer perda de dados ou censura governamental afetaria todos os ebooks em questão.\n\n\"Talvez esse tipo de censura em massa pareça implausível\", escreveu Macrina, \"mas o importante é que isso é possível de uma forma que nunca aconteceu\".\n\nMais mundanos, mas mais prováveis, os resultados a preocupam também. \"O que é mais provável ... é que o fornecedor feche\", disse ela. \"Ou a biblioteca poderia um dia não pagar as taxas anuais associadas à OverDrive e aos títulos. Como esses títulos são todos centralizados com OverDrive, é isso; nenhum legado. A Biblioteca de Alexandria, destruída novamente\".\n\nO projeto de Alexandria, diz Read, será resistente a tais pressões, porque é construído usando um blockchain descentralizado do tipo Bitcoin. Ao eliminar um ponto central de falha ou controle, o risco de uma falha catastrófica será muito menor.\n\nMas isso é um problema que precisa ser resolvido? Outros não estão convencidos de que o apocalipse está próximo. \"Informações [na antiguidade] eram escassas e difíceis de copiar, o oposto de hoje\", apontou o especialista em segurança Bruce Schneier em um telefonema. \"É um tipo diferente de animal.\"\n\n\"Como ideias, o conhecimento é difícil de matar\", escreveu Jeremy Gillula, tecnólogo da equipe da EFF, em um e-mail. “Isso é especialmente verdade na internet, o que parece que nunca esquece * nada. * Uma guerra cibernética poderia tornar o conhecimento difícil de encontrar e distribuir, mas eu não acho que isso resultaria em um evento da Library of Alexandria onde uma grande quantidade de conhecimento culturalmente ou cientificamente importante é perdido por toda a eternidade \".\n\nA ameaça real, ele argumentou, poderia estar sobrecarregando a relação sinal-ruído até o ponto em que o conhecimento real se torna invisível. As informações que não aparecem nas primeiras páginas dos resultados de pesquisa do Google podem não existir. \"Com recursos suficientes, uma nação poderia ... ampliar a propaganda e a desinformação para abafar a verdade (ou pelo menos tornar confuso descobrir o que é verdadeiro e o que não é)\", disse Gillula.\n\nOs documentos de Snowden revelaram as muitas maneiras pelas quais os países da Five Eyes - em particular, o GCHQ do Reino Unido - manipulam a opinião pública online. O exército de trolls da Rússia também é notório pela prática.\n\nO projeto Alexandria espera se defender contra esse tipo de ataque - além de desencorajar o spam - usando um modelo de publicação de custos em camadas. \"Não há processo de 'aprovação' para o conteúdo ser publicado na biblioteca\", escreveu Read em um e-mail, \"mas há um custo real, que esperamos que reduza bastante o conteúdo de spam. Esse é um custo bastante baixo. (menos de US $ 1, talvez tão baixo quanto US $ 0,01), então não esperamos que isso atrapalhe quando alguém deseja legitimamente compartilhar um conteúdo. \"\n\nParece improvável que isso impediria um atacante de estado-nação com um orçamento de Estado-nação concentrado na esmagadora Alexandria.\n\nO pesquisador de segurança da UC Berkeley, Nicholas Weaver, identificou outra ameaça ao conhecimento humano: impedir um evento da Biblioteca de Alexandria não adianta se ficar impossível consumir esse conhecimento sem conseqüências políticas.\n\n\"Onde eu acho que o perigo está na aplicação da censura e no monitoramento contra dissidentes internos\", ele escreveu em um email. \"As ferramentas de monitoramento de estilo da NSA são na verdade muito fáceis de comprar ou construir ... É muito fácil escolher os dissidentes ou (mais importante) os dissidentes em breve por causa de seu tráfego na Web, conhecer sua identidade e então organizar um visita \"amigável\" da força policial local por causa de seu pensamento. \"\n\nMacrina fez o mesmo ponto. Os vendedores de e-books, ela escreveu, \"têm acesso total aos seus históricos de check-out de e-books da biblioteca, além de onde você parou de ler em um livro, quanto tempo permaneceu em uma página, o que quer que você tenha destacado ou marcado\". informações de identificação pessoal. \"\n\nNo passado, nós simplesmente lemos livros, mas agora, aparentemente, nossos livros nos lêem por sua vez.\n\n\"Os e-books DRM\", ela advertiu, \"tornaram-se parte da assembléia de vigilantes - a constelação de agências, ferramentas e serviços que espionam todas as nossas atividades digitais. Ameaça nossas liberdades civis, a existência de nossas bibliotecas e nossa intelectualidade. herança.\"\n\nGillula concordou. \"Para que o DRM funcione (em e-books, videogames ou qualquer coisa), você tem que abrir mão do controle do seu computador para outra entidade, e eles podem abusar dessa confiança não apenas para negar acesso a certos conteúdos, mas para espionar em você também \".\n\n\"O pior é que alguns provedores tentam coletar dados em e-books que não têm DRM. Em outubro passado, o software DRM da Adobe (Digital Editions) foi pego enviando dados sobre e-books que as pessoas tinham em seus ereaders de volta para a Adobe. —Incluindo dados sobre e-books que não tinham DRM e que nunca haviam sido abertos no Digital Editions. \"\n\nA Read está ciente desse problema e disse que ajudar os usuários a burlar as ferramentas de monitoramento para ler ebooks - e aproveitar outras mídias digitais - é uma parte importante do projeto Alexandria, mas a funcionalidade específica ainda está em sua lista de tarefas. \"Várias moedas já existem que integram o Tor\", escreveu ele, \"e há outras rotas sendo exploradas para o anonimato, então há algumas opções disponíveis para prosseguir quando chegarmos lá.\"\n\nMas o design de Alexandria pode possuir falhas fundamentais de segurança. O blockchain do projeto armazena apenas uma tabela de hash distribuída (DHT) que aponta para o local em outro lugar do conteúdo publicado. \"O blockchain é essencialmente o índice da biblioteca\", explicou Read.\n\nO problema é, Weaver: \"Se os dados originais forem adulterados, você poderá detectá-los porque eles não correspondem mais ao hash registrado no blockchain, mas você não poderá recuperar os dados originais usando o blockchain.\"\n\nO que significa que você sabe que sua biblioteca acabou de ser queimada, mas não seria capaz de salvar os restos carbonizados.\n\nQue mecanismo (s) a Alexandria colocará em prática para impedir que um atacante determinado censure o conteúdo dessa maneira ou corrompa o blockchain?\n\n\"Estamos trabalhando em um processo que pensamos nos permitirá essencialmente cooptar a atividade da base de usuários de Alexandria para fazer uma variedade de coisas projetadas para levar a um blockchain mais robusto, resiliente e muito caro para atacar, mas está muito cedo de uma fase agora para falar sobre ainda :), \"Read escreveu.\n\nEnquanto os objetivos de Alexandria são nobres, parece mais provável que o projeto seja mais um espinho no lado de Hollywood. \"Queremos que Alexandria seja o YouTube / iTunes / Spotify descentralizado\", escreveu Read. \"Faremos o que pudermos para impedir que os usuários compartilhem material pirateado sobre Alexandria, mas a resistência subjacente à censura é muito mais importante para nós\".\n\n- Fonte: https://motherboard.vice.com/en_us/article/ae3p4p/could-cyberwar-cause-a-library-of-alexandria-event",
				"added": 1551028846
			},
			{
				"comment_id": 20,
				"body": "#Como evitar que hackers 'invadam' seu cérebro no futuro\n\n#Imagine ser capaz de navegar por suas memórias como se fosse em uma linha do tempo do Facebook, revivendo em nítidos detalhes seus momentos favoritos da vida e guardando os mais queridos.\n\nAgora imagine uma versão distópica do mesmo futuro, no qual hackers roubam essas memórias e ameaçam apagá-las se você não pagar um resgate.\n\nPode soar longe da realidade, mas o cenário não é tão impossível quanto parece. \n\n#Abrindo a cabeça\n\nAvanços no campo da neurotecnologia nos deixaram mais próximos da possibilidade de melhorar e turbinar nossas memórias, e em algumas décadas poderemos também ser capazes de manipulá-las e reescrevê-las. \n\nA tecnologia que provavelmente nos permitirá esses feitos é a dos implantes cerebrais, que estão rapidamente se tornando ferramentas comuns para os neurocirurgiões.\n\nOs implantes produzem a chamada estimulação profunda no cérebro, a DBS (da sigla em inglês, deep brain stimulation), para tratar gama ampla de condições, dos tremores da doença de Parkinson ao TOC (Transtorno Obsessivo Compulsivo).\n\nCerca de 150 mil pessoas no mundo já passaram por tratamentos experimentais com os implantes. \n\nA tecnologia está sendo cada vez mais pesquisada nos tratamentos para depressão, demência, síndrome de Tourette e outras doenças psicológicas.\n\nPesquisadores estão agora começando a explorar os implantes no tratamento de distúrbios que afetam a memória, como os causados por eventos traumáticos.\n\nA Agência de Projetos de Pesquisa em Defesa Avançada dos EUA (Darpa, em inglês) tem um programa para desenvolver e testar uma \"interface neural sem fio totalmente implantável\" para ajudar a restaurar a perda de memória em soldados afetados por danos traumáticos ao cérebro. \n\n#Superpoderes mentais\n\n\"Eu não me surpreenderia se um implante de memória estivesse disponível no mercado dentro dos próximos dez anos – essa é a escala de tempo de que estamos falando\", diz Laurie Pycroft, uma pesquisadora do departamento de ciências cirúrgicas na Universidade de Oxford, no Reino Unido.\n\nEm 20 anos, a tecnologia pode ter evoluído o suficiente para nos permitir \"capturar\" os sinais que constroem nossas memórias, turbiná-los, e redirecioná-los de volta ao cérebro.\n\nNo meio do século, é possível que tenhamos ainda mais controle, com a habilidade de manipular memórias. \n\n#'Sequestro de memória'\n\nMas o controle também pode ter consequências ruins. Se essa habilidade cair nas mãos erradas, as consequências podem ser \"gravíssimas\", diz Pycroft.\n\nSe um hacker invadir um neuroestimulador de um paciente com doença de Parkinson, por exemplo, e alterar as configurações, ele poderia influenciar os pensamentos e comportamento do paciente, ou mesmo causar paralisia temporária.\n\nUm hacker também poderia ameaçar apagar ou reescrever memórias.\n\nSe os cientistas conseguirem decodificar os sinais neurais das nossas memórias, então os cenários podem ser infinitos: pense na quantidade de informação valiosa que hackers mal intencionados poderiam coletar invadindo os servidores do hospital de veteranos em Washington, por exemplo.\n\nEm um experimento em 2012, pesquisadores da Universidade de Oxford e da Universidade de Berkeley, na Califórnia, conseguiram desvendar informações pessoais como senhas de cartão de crédito apenas observando as ondas cerebrais de pessoas usando um headset (conjunto com microfone, óculos de visão 3D e fone de ouvido) para jogos virtuais.\n\n#Controle do passado\n\n\"A possibilidade de 'sequestro de cérebros' e de alterações maliciosas de memória gera uma variedade enorme de desafios para a segurança – algumas bem novas e únicas\", diz Dmitry Galov, pesquisador de segurança virtual da empresa Kaspersky Lab.\n\nA Kaspersky e a Universidade de Oxford colaboraram em um projeto para mapear potenciais ameaças e formas de ataque envolvendo essas novas tecnologias.\n\n\"Até no estágio atual de desenvolvimento – que é mais avançado do que as pessoas se dão conta – há uma evidente tensão entre a saúde e a segurança do paciente\", diz o relatório O Mercado da Memória: Preparando-se para um Futuro onde as Ameaças Virtuais Miram seu Passado, publicado pelo grupo.\n\nNão é impossível imaginar governos autoritários do futuro tentando reescrever a história interferindo com a memória das pessoas, e até criando novas memórias, diz o artigo.\n\n\"Dá até para imaginar essa tecnologia sendo usada para mudar o comportamento das pessoas. Você pode fazer uma pessoa mudar imediatamente o comportamento estimulando a parte do cérebro que gera emoções indesejáveis\", diz Galov à BBC.\n\nE vice-versa: também é possível seria possível encorajar determinado comportamento estimulando a parte do cérebro que gera prazer e alegria. \n\n#Acesso não autorizado\n\nHackear dispositivos médicos conectados a pessoas é, na verdade, uma ameaça que já existe. Em 2017, autoridades americanas fizeram um recall de 465 mil marca-passos depois de avaliar que eles estavam vulneráveis à ataques cibernéticos.\n\nA FDA, agência americana de controle de remédios e alimentos, disse que pessoas mal intencionadas podem interferir com os mecanismos, mudando o ritmo cardíaco de alguém ou acabando com a bateria, o que poderia provocar morte.\n\nCom o recall, ninguém foi ferido, mas a agência afirmou que com aparelhos médicos cada vez mais conectados, redes de hospitais, cirurgias remotas, etc, há um aumento do risco de pessoas mal intencionadas explorarem as vulnerabilidades de segurança virtual. \"Algumas (dessas vulnerabilidades) podem afetar como os aparelhos médicos operam.\"\n\nÉ um problema para muitas áreas médicas, e a Kaspersky acredita que, no futuro, mais aparelhos serão conectados e monitorados remotamente. Médicos só serão chamados para assumir situações de emergência. \n\n#Defesas virtuais\n\nFelizmente, reforçar a segurança virtual no início do planejamento e desenvolvimento de aparelhos pode mitigar a maior parte dos riscos.\n\nMas a medida mais importante, segundo Galov, é educar médicos e pacientes sobre precauções a serem tomadas, como criar senhas fortes.\n\nO fator humano, diz ele, é uma das maiores vulnerabilidades, porque não podemos esperar que os médicos se tornem especialistas em segurança virtual e \"qualquer sistema é tão seguro quanto sua parte mais fraca\".\n\nPycroft diz que, no futuro, implantes cerebrais serão mais complexos e mais amplamente usados para tratar um amplo conjunto de doenças. \"A confluência desses fatores provavelmente deve tornar mais fácil e atraente realizar um ataque usando implantes de pacientes\", diz ele.\n\n\"Se não criarmos soluções para a primeira geração de implantes, a segunda e terceira gerações serão bastante inseguras.\"\n\n- Fonte: https://www.bbc.com/portuguese/geral-47240830",
				"added": 1551047729
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 5,
				"body": "#Manifesto do Partido Comunista\n\nManifesto do Partido Comunista: um dos mais significativos documentos programáticos do comunismo fundado em bases científicas, que contém uma exposição coerente das bases da grande doutrina de Marx e Engels. \"Esta obra expõe, com uma clareza e um vigor geniais, a nova concepção do mundo, o materialismo consequente aplicado também ao domínio da vida social, a dialéctica como a doutrina mais vasta e mais profunda do desenvolvimento, a teoria da luta de classes e do papel revolucionário histórico universal do proletariado, criador de uma sociedade nova, a sociedade comunista.\"\n\n- https://mega.nz/#!uqxXACAD!dS71UHpb8mEmFDvDwZHX9hwJ9OK2o3Q4ZBJrR5qucZM\n- SHA-256: 0ed13af95a47ca78fa2c318935cd0b64907dca7d8046270237c7226e92ac132f",
				"added": 1551032271
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 7,
				"body": "Neste ambiente estão disponíveis livros em PDF que servem de apoio às aulas durante o Curso de Graduação em Matemática.\n\n- http://mtm.grad.ufsc.br/livrosdigitais/",
				"added": 1551033143
			}
		],
		"1_15ZCzHPEspA94YwXMHBrrDspmVc1RiaQJr": [
			{
				"comment_id": 17,
				"body": "#GUIA DE ESTUDO DO LIVRO DE APOCALIPSE \n\n- https://web.archive.org/web/20140724062345/https://perrybrown.files.wordpress.com/2010/09/guia-de-estudo-do-livro-de-apocalipse.pdf",
				"added": 1551041877
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 19,
				"body": "#Garoto Prodígio\n\n\nSean testemunhou o assassinato brutal de sua mãe e cresceu obcecado por vingança. Dessa forma, torna-se um rapaz quieto e estudioso durante os dias, e um herói à noite. Mas o que é um verdadeiro herói? Quem decide o que é certo e o que é errado? Ao passo que os limites se atenuam, a vida dupla de Sean traz à tona muitas dúvidas, e suas duas vidas ficam prestes a se colidir.\n\n- https://youtu.be/AkPBVRRAagc",
				"added": 1551046855
			}
		],
		"4_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 21,
				"body": "#Inteligência Artificial: Flappy Bird\n- https://youtu.be/8qFKAcuYMK4\n\n#Download do código fonte para Python e Pygame 3.3: https://privatebin.net/?caf831ecc898bea0#NnCqd+b9U77DeDgtIZUzvGbpeLFwCtlurKFQPCvhRy0=",
				"added": 1551051828
			},
			{
				"comment_id": 22,
				"body": "#Inteligência Artificial: Piano Tiles\n- https://youtu.be/iJ1yJWzYvCs\n\n#O programa roda em Python 3.3, utilizando PIL (Python Imaging Library, ou Pillow) para analisar as capturas de tela e win32api pra interagir com o computador. Download do código-fonte: https://privatebin.net/?4b829d434beee33f#FefLsvXoVwWlOgSp1jqvbicf3wyThKlI15nrPLk4Qhw=",
				"added": 1551052952
			},
			{
				"comment_id": 23,
				"body": "#Inteligência Artificial no Dinossauro do Google\n- https://youtu.be/P7XHzqZjXQs\n\n#GitHub: https://github.com/ivanseidel/IAMDinosaur.git",
				"added": 1551054081
			},
			{
				"comment_id": 24,
				"body": "#Inteligência Artificial jogando Flappy Bird!!\n- https://youtu.be/vavXvu_SMeM\n\n#Link para baixar o executável (windows) e assistir a IA aprendendo diante dos seus olhos!!\n- https://mega.nz/#!yJhGxYJb!P9x1jGaAx4HnXoL7dglE7Owaqjahce4LPBFgeELv-4w (setinhas do teclado aumentam e diminuem a velocidade do jogo)\n- SHA-256: f44c1437fea6aaa465e68801924f5d2ec7f3480b702a1fefe521f07fa1a54e0c",
				"added": 1551056286
			},
			{
				"comment_id": 25,
				"body": "#Pesquisadores desvendam estratégia do 'Estado Islâmico' com ajuda de inteligência artificial\n\n#Pesquisadores nos Estados Unidos usaram inteligência artificial para entender melhor a estratégia militar dos combatentes do grupo extremista autodenominado 'Estado Islâmico'.\n\nAnalistas estabeleceram uma ligação de causalidade entre ataques aéreos contra os extremistas e ataques a bombas em estradas realizados pelo 'EI'. Além disso, encontraram uma conexão com o uso de táticas militares por jihadistas.\n\nO sistema algorítmico analisou 2,2 mil incidentes relacionados ao 'Estado Islâmico' a partir do segundo semestre de 2014. Uma característica notada foram picos no uso de dispositivos explosivos improvisados (IEDs, na sigla em inglês).\n\nPaulo Shakarian, da Universidade Estadual do Arizona, um dos coautores do estudo e ex-oficial do Exército americano que serviu no Iraque em 2006, disse à BBC: \"Quando eles são alvo de diversos ataques aéreos, eles mudam de operações com grande infantaria para o uso de IEDs.\"\n\nPesquisadores também descobriram que o uso de bombas por veículos aumentaram antes de grandes operações de infantaria por militantes. Um exemplo disso foi no Iraque.\n\n\"Acreditamos que esta relação deve-se ao desejo de prevenir reforços do Exército iraquiano a partir de Bagdá\", disse Shakarian.\n\nAnalistas também notaram uma forte alta em sequestros realizadas pelo 'Estado Islâmico' após ataques aéreos sírios. Segundo Shakarian, os analistas acreditam que estas ações poderiam ser retaliação para capturar agentes de inteligência sírios que poderiam ter contribuído com informações.\n\nShakarian disse que as táticas do Estado Islâmico são bem diferente daquelas que ele e as forças estrangeiras enfrentaram no Iraque, há nove anos.\n\nO grupo extremista, disse, é mais complexo e dinâmico, razões pelas quais a natureza das suas estratégias nem sempre era evidente sem análise computacional.\n\n#'Resultados úteis'\n\nElizabeth Quintana, diretora de Ciências Militares no Royal United Services Institute, disse que as forças que enfrentam o 'Estado Islâmico' deverão considerar estes resultados úteis.\n\n\"Os militares têm acesso a uma grande quantidade de informações\", disse. \"Eles precisam de uma maneira de fazer com que sejam mais fáceis de digerir. O estudo analítico é definitivamente a maneira de se fazer isso.\"\n\nNoel Sharkey, cientista da Computação da Universidade de Sheffield, acrescentou que esta abordagem pode ajudar a prever prováveis tipos de ataques.\n\n\"Isso sugere que (o Estado Islâmico) tem uma estratégia operacional previsível ao invés de uma arbitrária, ou uma nova para cada ataque\", disse.\n\n\"Claro, o problema é que isso pode mudar de repente e particularmente se eles notarem que outras forças militares estavam agindo a partir dessas previsões.\"\n\nShakarian apresentará um relatório com as conclusões numa conferência sobre análise de dados em Sydney, na próxima semana.\n\n- Fonte: https://www.bbc.com/portuguese/noticias/2015/08/150810_tecnologia_estadoislamico_hb",
				"added": 1551056438
			}
		]
	},
	"comment_vote": {
		"13_15ZCzHPEspA94YwXMHBrrDspmVc1RiaQJr": 1
	}
}