{
	"title": "Info@Balancer",
	"description": "Копилка разных знаний",
	"links": "*   [Карта зайта](/18i1Ra9wePfmwhMCyhmLXXShxcSha5YAns/?Post:1:%D0%9A%D0%B0%D1%80%D1%82%D0%B0+%D0%B7%D0%B0%D0%B9%D1%82%D0%B0)\n\n* * *\n\n*   [Balancer's Blog](/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/)\n*   [ZeroNet@Balancer](/1PxNZqJ3R3aUt171foqtzbhgZZ6JaggaAi/)\n*   [Balancer's Wiki](/1NbzP9dgYhuY71bde9G1LuVGaCE69venzR/)",
	"next_post_id": 12,
	"demo": false,
	"modified": 1539173659,
	"post": [
		{
			"post_id": 11,
			"title": "Как прилепить иконку на аватар",
			"date_published": 1539173036.033,
			"body": "Бывает нужно прилепить на аватарку иконку. И ломает возиться каждый раз с полноценным редактором, ресайзами и т.п. ImageMagick приходит на помощь.\n\n*   Кладём в каталог полноразмерную фотку, например, под именем `origin.jpg` размером 400x400px.\n\n*   Кладём туда же иконку сервиса в виде `servicename.png`.\n\n*   Запускаем такой скрипт, передав в качестве парамера `servicename`:\n\n```bash\n#!/bin/bash\n\nNAME=$1\n\nconvert origin.jpg \\( \\\n    $NAME.png -resize 100x100 \\\n\\) -gravity southeast -composite avatar-$NAME.jpg\n```\n\nГотово:\n\n![balancer-xmpp.jpg (0x0)](data/img/post_11_balancer-xmpp.jpg)\n\nИногда нет иконки сервиса c прозрачным бэкграундом. Тогда можно в том же ImageMagick указать считать белый прозрачным. Скрипт становится вида:\n\n---\n\n```bash\n\n#!/bin/bash\n\nNAME=$1\n\nconvert origin.jpg \\( \\\n    $NAME.png -fuzz 20% -transparent white -resize 100x100 \\\n\\) -gravity southeast -composite avatar-$NAME.jpg\n```\n\n![8c08a0d8f3f45141.jpg (0x0)](data/img/post_11_8c08a0d8f3f45141.jpg)"
		},
		{
			"post_id": 10,
			"title": "How to Post to Mastodon From Anything Using IFTTT",
			"date_published": 1528577967.67,
			"body": "*Saved from <https://www.hyperborea.org/journal/2017/12/mastodon-ifttt/>*\n\nI finally managed to hook up [IFTTT](https://ifttt.com/) to [Mastodon](https://joinmastodon.org/) to auto-post from another site! I use IFTTT as glue for linking several services together including sharing interesting links from [Pocket](https://getpocket.com/) when I’m offline: I can add a tag in the app on my tablet, and then when it syncs that tag up to the cloud, IFTTT will pick it up and create the share post on whichever service I’ve tagged it for.*\n\nMy main source was this [post by @raucao@kosmos.social](https://kosmos.social/@raucao/3377). It’s a bit out of date, but it pointed me in the right direction.\n\n**1\\. Set up IFTTT’s Maker WebHooks**\n\nOn IFTTT, go to [maker_webhooks settings](https://ifttt.com/services/maker_webhooks/settings). Make sure it’s active.\n\n**2\\. Set up Mastodon to allow IFTTT as an application**\n\nGo to Preferences/Development/Your Applications on your Mastodon instance (ex: on mastodon.social it’s [here](https://mastodon.social/settings/applications)). Click on New Application. Enter the following:\n\n**Name:** IFTTT\n**Website:** [https://maker.ifttt.com/](https://maker.ifttt.com/) (at first I thought you needed the full URL from the IFTTT config, but it seems OK without it.\n**Scopes:** read and write should be enough. Actually just write might be fine.\n\nSubmit the app.\n\n---\n\nNow open the new app you’ve created and look up the **access token**.\n\n**3\\. Create an IFTTT app!**\n\nGo back to IFTTT and create a new app. For example, I created an app triggered by Pocket, whenever an item is tagged share-mastodon. You could also set it up to autopost every time you blog with a specific tag, or every new item in an RSS feed, or all kinds of things. Even cross-post from Facebook or “the birdsite” (Twitter).\n\nFor the “then that” section, choose a Webhooks action.\n\n**URL:** [https://mastodon.social/api/v1/statuses?access_token=1234567890](https://mastodon.social/api/v1/statuses?access_token=1234567890) (paste your access token here.)\n**Method:** POST\n**Content Type:** application/x-www-form-urlencoded\n**Body:** status=whatever-you-want-to-post\n\nFor example, to share a link from Pocket you might want the body to be\n\n```\nstatus=<<<{{Title}}>>> <<<{{Url}}>>>\n```\n\nOr for posting from WordPress, you might want it to be\n\n```\nstatus=New blog post: <<<{{PostTitle}}>>>\n<<<{{PostUrl}}>>>\n```\n\nClick on Create Action.\n\nAdd a title and click on Finish.\n\n**4\\. Test it out!**\n\nGo and post something that should trigger the rule, then come back and click “Check Now” on the IFTTT applet. Make sure it comes through the way you want it to. Adjust it as needed.\n\n**Update (Feb 2018):** This method can’t upload images, because the [Mastodon API](https://github.com/tootsuite/documentation/blob/master/Using-the-API/API.md) needs the image to be uploaded _before_ you post the status, and IFTTT apps can only take one action. If you want to cross-post between Twitter and Mastodon, you can use [crossposter.masto.donte.com.br](https://crossposter.masto.donte.com.br/), which can handle image uploads. [@outside_rs confirmed](https://twitter.com/outside_rs/status/959256670516883456) that you can use Twitter+Crossposter as intermediaries to get images from another service onto Mastadon, as in Instagram→ IFTTT→ Twitter→ Crossposter→ Mastodon. It’s roundabout, but it works! (Not sure when I’ll have time, but I’m thinking about writing a gateway script that you can hit directly from IFTTT that will upload an image and then post to Mastodon with it, removing the dependency on Twitter.)\n\n**Update (March 2018):** You need to watch out for ampersands and single quotes when doing this, because the API handler treats them as separators. Wrapping the ingredient like this `<<<{{Title}}>>>` should fix it.\n\n**You can follow me on Mastodon at [@kelsonv@mastodon.social](https://mastodon.social/@kelsonv)**. If you’re not on Mastodon, but would like to check it out, start at **[JoinMastodon.org](https://joinmastodon.org/)**. It’s a quick overview of what Mastodon is, how it’s different from Twitter, how different instances work (think of them as different servers on an MMO game, or different email services), and how to pick an instance that suits you.\n\n<small>*The day after testing the Pocket-to-Mastodon connection with a few links, I discovered something interesting about IFTTT when it re-posted one of those links to Buffer. Apparently IFTTT doesn’t know which tags are new, only which bookmarks have been updated and what the current tags are. My new Pocket-to-Mastodon applet picked up the share-mastodon tag I’d just added, and my Pocket-to-Buffer applet picked up the old share-buffer tag that had been on there since I first shared it last month.</small>"
		},
		{
			"post_id": 9,
			"title": "Завершилась выставка Comtek-95",
			"date_published": 799545600,
			"body": "_04.05.1995, источник: [«КоммерсантЪ», номер 081 от 04-05-95](https://www.kommersant.ru/doc/108068)_\n\n## Монополистический, но не загнивающий и не умирающий\n\n**На прошлой неделе в Москве состоялась шестая международная выставка компьютерных технологий Comtek (организаторы --- компании Crocus, Comtek и Экспоцентр). Оставив далеко позади остальные московские выставки по престижности и посещаемости, она в последние годы считается главным компьютерным шоу бывшего СССР. В Comtek'95 участвовало около 600 фирм, а количество посетителей достигло 100 тыс. Безусловно, Comtek на подъеме. Впрочем, по мнению руководителей многих фирм-участников, сегодня мы получили в российском выставочном бизнесе монополиста, и в его работе все явственнее проступают присущие монополизму недостатки.**\n\n* * *\n\n## Как становятся монополистом\n\nКак показывает практика, для того, чтобы по-настоящему \"раскрутить\" выставку, требуется не менее трех-четырех лет. А это означает, что монопольное царствование Comtek на российском рынке high-tech выставок еще несколько лет никем не будет оспорено. Ведь руководители и специалисты из регионов России уже в дни Comtek'95 предусмотрели в своих деловых календарях визит на Comtek'96, а менеджеры по рекламе уже вынашивают головокружительные идеи стендов будущего года и с болью в сердце калькулируют грядущие расходы.\n\nНесколько лет назад, когда новорожденные компьютерные выставки позднего СССР делили рыночные ниши, Comtek досталась лучшая. Став для россиян \"окном в Европу\" (а также, разумеется, в США и Юго-Восточную Азию), выставка уже одним этим обеспечила себе высокую посещаемость и возможность \"кусающихся\" цен.\n\nДругим достались ниши похуже. Конечно идея SofTool --- поддержать отечественных производителей --- донельзя благородна, но IBM и Apple все же собирают гораздо больше посетителей. А ориентированная на госструктуры \"Информатика\" сегодня находится в том же положении, что и госструктуры, деля с ними все трудности экономики переходного периода.\n\nВозможно, через два-три года Comtek начнет испытывать серьезную конкуренцию со стороны более молодых выставок --- Windows Expo, Unix Expo. Основанные на той же беспроигрышной идее \"окна в Европу\", они отличаются большей специализацией, что гарантирует и больший интерес со стороны специалистов. Но юным конкурентам еще расти и расти, и старый испытанный вожак стаи компьютерных выставок пока что может почивать на лаврах.\n\nВпрочем, в этом году организаторы Comtek предприняли некоторые превентивные меры для борьбы с подрастающими соперниками. В рамках Comtek'95 проводились две специализированные выставки --- OpeNet (сетевые технологии) и Apple Expo (оборудование и программы для компьютерной платформы Apple Macintosh). В принципе, подобное дробление на специализированные выставки может активизировать интерес профессионалов к Comtek, а также уменьшить число школьников --- любителей красивых пакетов и смешных клоунов. Но пока что стихия шоу явно побеждает стремление организаторов сделать выставку серьезнее.\n\n## Поп-звезды, клоуны и вертолеты\n\nПри посещениях Comtek'95 не покидало ощущение, что выставка явно перерастает рамки комплекса на Красной Пресне. Были заняты все павильоны Экспоцентра, причем весьма плотно --- стенды вплотную граничили друг с другом, так что для прохода многочисленных посетителей оставались узенькие \"улочки\". Их узость подчеркивалась еще и двухэтажностью многих стендов --- благо устроители выставки за метры второго этажа денег пока не берут. В этот раз экспоненты довольно творчески подошли к использованию бесплатной площади --- пространства под открытым небом между павильонами. Помимо стационарной рекламы --- большого надувного компьютера от IBS, настоящего истребителя в рекламной раскраске, нескольких традиционных дирижаблей и многочисленных рекламных конструкций --- наблюдались попытки использовать в рекламных целях и воздушное пространство над Экспоцентром. Над головой время от времени кружил вертолет, к которому был привязан тросом смелый мужчина с большим транспарантом в руках (сказались авиационные истоки компании Stins Coman).\n\nПо свидетельству организаторов выставки, многим компаниям даже пришлось отказать в месте. Уж слишком велик был спрос на право выставиться на Comtek: поистине неучастие на крупнейшей в Восточной Европе компьютерной выставке стало считаться дурным тоном. И вот что удивительно: все экспоненты, с которыми удалось встретиться и поговорить корреспондентам Ъ, дружно ругали организаторов. Судите сами. Стоимость квадратного метра выставочной площади на Comtek почти вдвое выше, чем на ганноверской CeBIT ($350 против DM280). Хочешь телефонную линию на стенд --- плати $1000, за две линии нужно было выложить ровно $2000 (и ни центом меньше). Пропуск для машины на территорию комплекса --- $500, пропуска для сотрудников фирмы --- по $50, при том, что на стендах солидных фирм работал не один десяток менеджеров. За внесение в выставочную информационную систему фирмам тоже нужно было платить (в конце концов она оказалась неполной, и ориентироваться на выставке было весьма непросто). Отметим также солидную для России цену входных билетов (20 тыс. рублей). Входной билет на CeBIT'95 стоил восемь марок, разделите эту сумму на среднюю зарплату в ФРГ и сравните с Россией. При этом пригласительные, которые фирмы-участники разослали своим бизнес-партнерам, неожиданно для всех --- и уже после начала выставки --- были объявлены одноразовыми. Поэтому, скажем, многие гости фирмы \"АйТи\", осмотревшие выставку во вторник, не смогли посетить семинар компании в один из последующих дней.\n\nПри всех запланированных тратах и внезапных потерях экспоненты не заметили достойного уровня сервиса. Как и раньше, обо всех деталях и мелочах им приходилось заботиться самим. Иногда складывалось впечатление, что организаторы решили создавать своим клиентам лишь трудности. Сроки, отведенные для монтажа стендов (два дня), по отзывам участников, были необычно коротки по сравнению с аналогичными выставками на Западе. К тому же эти суббота и воскресенье совпали с православной Пасхой --- что, естественно, резко повысило неловкость движений строителей. В первый же выставочный день организаторы решительно (\"мы отключим вам электричество\") пресекли выступление группы \"Браво\" на стенде Lamport --- мешает соседям. А традиционный прием в Кремлевском дворце съездов, на котором экспоненты обычно братались с потенциальными высокопоставленными клиентами и которым Crocus и Comtek ранее оправдывали высокую стоимость выставочной площади, в этом году тихо и без объяснений \"зажали\".\n\nДа, за шесть лет выставка Comtek здорово \"раскрутилась\". Да, у нее нет конкурентов. Но европейская выставка CeBIT и американская Comdex также вне конкуренции, однако очевидцы прежде всего отмечают высокий уровень сервиса на них. С нами еще считаются, --- говорят представители крупных российских фирм, --- а вот мелкие фирмы организаторы подвергают настоящей сегрегации. При формальном равенстве цены на любой метр выставочной площади \"мелких\", как правило, задвигают в дальние и непрестижные углы.\n\nНе удивительно, что на минувшей неделе в головах некоторых участников Comtek (из крупных российских фирм) зародилась некая альтернативная идея. Comtek, в силу своего гигантизма, считают они, не реализует всех чаяний участников: тесно пообщаться с коллегами и дилерами мешает усталость, до показа достижений руки не доходят. Все равно стенды строят все сами или друг другу, почему бы не воспользоваться одним из \"окон\" в расписании Экспоцентра (скажем, в начале марта, перед CeBIT)? Но не в пику Comtek --- с таким мотивом идея обречена на мертворожденность --- а из чувства симметрии (если уж в стране появилось такое важное событие как Comtek, почему бы не удвоить число этих компьютерных праздников). Возможно, что-нибудь альтернативное Windows Expo и Unix Expo, которые все-таки имеют прозападную ориентацию. Возможно, это будет выставка только для российских фирм, которые, являясь главными действующими лицами на российском компьютерном рынке, чувствуют себя гостями на Comtek. Идея зреет, практическая реализация ее вполне реальна, и в любом случае даже призрак конкуренции будет полезен в борьбе с худшими проявлениями монополизма.\n\nТем не менее все нынешние участники Comtek остаются ее заложниками --- при всех недостатках против огромной популярности выставки возразить нечего. Поэтому Comtek и Crocus смело строят новые планы на будущее. Возможно, Comtek'96 разместится уже на трех площадках --- в Экспоцентре, ВВЦ и Манеже. А между ними будут пущены автобусы-челноки.\n\n## \"Ночная\" жизнь Comtek\n\nОна начиналась после 18 часов, когда приступавшая к исполнению охрана направляла посетителей на выход. Особой склонностью к релаксации отличались российские фирмы, стенды инофирм к этому времени обычно пустели. На стенде Steepler у некоторого подобия фонтана (можно ожидать, что на следующем Comtek фонтанами обзаведутся все друзья-конкуренты Steepler) каждый день развлекал публику джаз-бэнд. Но пожалуй, всех обошла фирма Lamport, каждый день привлекавшая толпы посетителей выступлениями группы \"Браво\".\n\nНастоящее шоу разыгралось в последний, четверговый, вечер Comtek. Стенд Lamport: наливают пиво, фанаты \"Браво\" танцуют и одолевают Валерия Сюткина просьбами дать автограф. Когда \"Браво\" заканчивает свое выступление, вся \"тусовка\" дрейфует к основному стенду IBS (их у нее четыре). Там льется шампанское (в том числе и на технику, размещенную на соседнем стенде Hewlett-Packard, по какому поводу заметно нервничают охранники). На стенде популярные западные шлягеры играет рок-группа --- танцуют все. Среди танцующих пробирается глава IBS Анатолий Карачинский. Его нещадно толкают. Спустя некоторое время в музыкальный спор вступает джаз-бэнд с расположенного по соседству стенда Steepler. Там не танцуют, но шампанского тоже хватает.\n\nВ это время на стенде Acer собрал поклонников Пресняков-старший. Продолжается субботнее шоу Acer, устроенное по поводу приезда на Comtek президента фирмы, но (в отличие от субботы) уже не в ковбойском стиле.\n\nВпрочем, ни одна из устраивавших шоу фирм не совершила решительного шага, который, по отзывам главы \"АйТи\" Тагира Яппарова, на одной из прошлых выставок CeBIT предприняла корпорация Novell. Эта компания вообще не имела стенда на выставке, а просто сняла один из крупнейших дворцов Ганновера, где проводила ежевечерние party с джазовой музыкой и напитками. Таким образом Novell проигнорировала CeBIT, но ни у кого не создалось впечатления, что это было вызвано финансовыми причинами.\n\n_АЛЕКСАНДР Ъ-КОНДРАТЬЕВ, ИГОРЬ Ъ-ПИЧУГИН_"
		},
		{
			"post_id": 8,
			"title": "Почему Telegram, а не кто-то из конкурентов?",
			"date_published": 1525326999.192,
			"body": "Постоянно приходится отвечать на вопрос «Почему Telegram, а не IM-XXX?». Как-то писал для одного из флеймов, потом зафиксировал [у себя постом на форуме](http://www.balancer.ru/g/p5489817), сейчас решил оформить отдельной статьёй-ссылкой и [для теста — во Friendica](https://spica.wrk.ru/display/7bcf5298975aeaa31f56855598140405), а до кучи сохраню и в ZN :)\n\nЕсть несколько киллерфич, которые радикально выделяют Телеграм среди конкурентов.\n\nКритичные для меня. Если такого в другом мессенджере нет, то он для меня не существует (в скобках — в каких популярных мессенджерах этого нет):\n\n*   Нормальный десктопный клиент (-WhatsApp, -FB)\n*   Нормальная серверная история (-Viber )\n*   Отсутствие необходимости постоянно иметь доступ к телефону (номер нужен только для первичной регистрации) (-Viber, -WhatsApp)\n*   Пересылка произвольных файлов (а не только картинок/видео) (-WhatsApp, -FB)\n\nТакже менее критичные фичи, но которые дают большой плюс мессенджеру:\n\n* * *\n\n*   Редактирование уже отправленных сообщений (-WhatsApp, -Viber, -FB)\n*   Хранение файлов в истории (-все)\n*   Отличный web-клиент (-Viber)\n*   Малое потребление ресурсов под Android\n*   Мощная система ботов\n*   Масса хороших групп (-почти все)\n*   Твои контакты не засвечиваются в группах (-WhatsApp)\n*   Можно слать сообщения самому себе — «избранное» (-все)\n*   Текст сообщения в извещении под Андроид. Актуально при озвучивании входящих, отображении на умных часах и т.п. (-WhatsApp)\n*   Синхронизация черновика. Начал писать сообщение на одном устройстве, отошёл, продолжил писать на другом.\n\n(позже наверняка буду ещё обновлять, благо, Friendica (а, тем более, ZN) позволяет редактировать посты :))"
		},
		{
			"post_id": 7,
			"title": "Как скачать весь YouTube? :)",
			"date_published": 1524684250.921,
			"body": "> [rasart](/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:1_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3#comment_2_1CAuG7huwvtXEp1tdicwHfpcEb3NcPC2PG): Как лучше слить с ютуба свои плейлисты?\n\n[youtube-dl](https://rg3.github.io/youtube-dl/) умеет целиком качать страницу юзера со всеми плейлистами. Т.е. у меня это было просто:\n\n```\nyoutube-dl --ignore-errors \\\n    --write-info-json \\\n    --write-annotations \\\n    --write-thumbnail \\\n    -f 'bestvideo[ext=mp4]+bestaudio[ext=m4a]/bestvideo+bestaudio' --merge-output-format mp4 \\\n    https://www.youtube.com/user/Balancer73/playlists\n```\n\nВ опциях стоит качать все метаданные в XML и JSON + картинки, чтобы можно было автоматизировать потом выкладывание, а хранить всё в mp4 (в максимальном доступном качестве), чтобы в Web потом без переконвертации класть.\n\nСобственно, `youtube-dl` и сделали задачу простой. Когда-то я для этого кривые скрипты сам писал :)"
		},
		{
			"post_id": 6,
			"title": "Как скопировать статью из Clearnet в ZeroNet (черновик)",
			"date_published": 1518924964.527,
			"body": "(Для упрощения процедуры)\n\n## [Paste to Markdown](https://euangoddard.github.io/clipboard2markdown/)\n\nhttps://euangoddard.github.io/clipboard2markdown/\n\nОнлайн-утилита для преобразования содержимого буфера обмена в Markdown. Не то, чтобы совсем аналог старого Scrapbook с Firefox, но чем-то близко. Выделяем нужный контент, копируем в буфер обмена, открываем эту ссылку, жмём  `Ctrl-V`. И готов Markdown с нужным кодом.\n\nЧто потребуется дальше:\n\n- Типографика. Желательно поменять тройные минусы ` --- ` на тире ` — `.\n- Нужно пересохранить картинки. Они останутся ссылками на оригинальные ресурсы.\n\nВ принципе, это можно автоматизировать скриптом. Надо подумать на этот счёт."
		},
		{
			"post_id": 5,
			"title": "Зарождение новой науки",
			"date_published": 1517237111.733,
			"body": "**Источник статьи**: [http://ahitech.livejournal.com/171492.html](http://ahitech.livejournal.com/171492.html)\n\n> Обсуждали с коллегами, что такое плохо комментированный код, ну там были истории про комментарии на румынском и т.д. Самая прикольная история была про большую компанию, которая купила другую компанию со всеми их наработками. Когда стали разбираться в коде новой компании, то выяснилось, что большая часть написана китайцами, а добил их комментарий перед злобной реализацией некого алгоритма на несколько страниц: «описание алгоритма смотри в тетрадке у Чуня». Где тот Чунь уже было неясно :)\n> _[Цитата](http://bash.org.ru/quote/401544 \"См. сайт.\") с сайта bash.org.ru._\n\nБлагодаря моему френду [**Тёмному Мозгу**](https://darth-mozg.livejournal.com/), я наткнулся на [совершенно очаровательную статью](http://wrttn.in/04af1a \"Оригинальный текст статьи (на английском).\") о зарождении новой науки --- индустриальной археологии. Оригинал статьи утерян, остались только кэшированные копии на сайте web.archive.org ([вот одна из них](http://web.archive.org/web/20120112020354/http://wrttn.in/04af1a \"См. статью (англ.)\")). Упоминания о ней есть в [ЖЖ юзера avva](http://avva.livejournal.com/2391622.html \"См. ЖЖ\"). Эту статью я переведу и оставлю тут, ибо она неимоверно доставляет.\n\n## Корпоративная память и обратная контрабанда.\n\nКорпоративная память бывает двух видов: люди и документация. Люди помнят, как вещи работают, и знают, почему. Иногда они записывают эту информацию куда-нибудь и хранят свои записи где-нибудь. Это называется «документация». Корпоративная амнезия действует точно так же: люди уходят, и документация исчезает, гниёт или просто забывается.\n\nЯ провёл несколько десятилетий, работая в большой нефтехимической компании. В начале 1980-х мы спроектировали и построили завод, который переделывает одни углеводороды в другие углеводороды. За следующие 30 лет корпоративная память об этом заводе ослабла. Да, завод всё ещё работает и приносит фирме деньги; техобслуживание производится, и высокомудрые специалисты знают, что им надо подёргать и куда пнуть, чтобы завод продолжил работать.\n\nНо компания абсолютно забыла, _как_ этот завод работает.\n\n---\n\nЭто произошло по вине нескольких факторов:\n\n*   Спад в нефтехимической промышленности в 1980-х и 1990-х заставил нас прекратить принимать на работу новых людей. В конце 1990-х, в нашей группе работали ребята в возрасте младше 35 или старше 55 --- с очень редкими исключениями.\n*   Мы потихоньку перешли на проектирование с помощью компьютерных систем.\n*   Из-за корпоративных реорганизаций нам пришлось физически переезжать всем офисом с места на место.\n*   Корпоративное слияние несколькими годами позже полностью растворило нашу фирму в более крупной, вызвав глобальную перестройку отделов и перетасовку кадров.\n\n### Индустриальная археология\n\nВ начале 2000-х я и несколько моих коллег вышли на пенсию.\n\nВ конце 2000-х компания вспомнила о заводе и подумала, что было бы неплохо сделать с ним что-нибудь. Скажем, увеличить производство. К примеру, можно найти узкое место в производственном процессе и улучшить его, --- технология-то эти 30 лет не стояла на месте, --- и, может быть, пристроить ещё один цех.\n\nИ тут компания со всего маху впечатывается в кирпичную стену. Как этот завод был построен? Почему он был построен именно так, а не иначе? _Как именно_ он работает? Для чего нужен чан А, зачем цеха Б и В соединены трубопроводом, почему трубопровод имеет диаметр именно Г, а не Д?\n\nКорпоративная амнезия в действии. Гигантские машины, построенные инопланетянами с помощью их инопланетной технологии, чавкают, как заведённые, выдавая на-гора груды полимеров. Компания примерно представляет себе, как обслуживать эти машины, но понятия не имеет, что за удивительное волшебство творится внутри, и ни у кого нет ни малейшего представления о том, как они создавались. В общем, народ даже не уверен, что именно надо искать, и не знает, с какой стороны следует распутывать этот клубок.\n\nОтыскиваются ребята, которые во время строительства этого завода уже работали в фирме. Теперь они занимают высокие должности и сидят в отдельных, кондиционированных кабинетах. Им дают задание найти документацию по означенному заводу. Это уже не корпоративная память, это больше похоже на индустриальную археологию. Никто не знает, какая документация по этому заводу существует, существует ли она вообще, и если да, то в каком виде она хранится, в каких форматах, что она в себя включает и где она лежит физически. Завод проектировался проектной группой, которой больше нет, в компании, которая с тех пор была поглощена, в офисе, который был закрыт, используя методы до-компьютерной эпохи, которые больше не применяются.\n\nРебята вспоминают детство с обязательным копошением в грязи, закатывают рукава дорогих пиджаков и принимаются за работу.\n\nПервый шаг поисков очевиден: нужно узнать, как называется завод, о котором идёт речь. Оказывается, что рабочие называют место своей работы названием, производным от названия города, в котором он расположен, --- и это единственный логичный момент во всей истории. Официально завод называется совсем иначе. Более того, когда его проектировали, у него было другое официальное название, а фирма, взявшая подряд на его строительство, обозвала его по-своему, но тоже вполне официально. В документах свободно и вперемешку используются все четыре названия.\n\nВ 1998 году, в рамках программы по улучшению документооборота, заводу был присвоен уникальный идентификационный номер. Этим номером должны были помечаться все документы, касающиеся завода. В 2001 году, в рамках перехода на электронный документооборот, заводу был присвоен _ещё один_ уникальный идентификационный номер, но уже другой. Неизвестно, какая именно система документооборота применялась в момент создания каждого отдельного документа; вдобавок, в документах то тут, то там упоминаются ссылки на ещё какие-то системы документооборота, о которых вообще нет никаких сведений. Более того, исходя из документов, невозможно сказать, является ли идентификатор, упомянутый в документе, идентификатором _этого завода_ согласно инструкциям 1998 года, или идентификатором _какого-то другого завода_ согласно инструкциям 2001 года --- и наоборот.\n\nВ документах, использующих идентификатор 1998 года, постоянно мелькает указание на какой-то архив. Бумажный. Проблема в том, что, судя по адресу, он был расположен в здании, снесённом задолго до 1998 года. Это в какой-то степени объясняет, почему единственные документы, хранящиеся в цифровом виде, касаются техподдержки завода, а не его проектирования и разработки.\n\nМетодом повального телефонного обзванивания удалось найти древний сохранённый бэкап сервера электронной почты. Оттуда удалось выгрести какое-то количество электронных писем от людей из отдела разработки. В подписях этих электронных писем сохранился физический адрес. Там удалось найти информацию о библиотеке отдела разработки --- бумажной, бумажной библиотеке! --- которая, хвала богам, не пострадала во время всех перетасовок, а просто потерялась. Эту библиотеку нашли. В ней обнаружилось сколько-то документации о производстве полимеров, и даже копии некоторых инженерных чертежей завода, сделанных ради удобства отдела разработки. Огромные листы синей кальки и гигантские, пыльные, траченные плесенью скоросшиватели с выцветшими записями. На записях и кальках стоят печати, удостоверяющие, что с этих документов была снята цифровая копия; никто не знает, где эта цифровая копия сейчас.\n\n### Расшифровка документации\n\nРебята из отдельных кабинетов притаскивают груду расползающихся скоросшивателей, указывают на них инженерам и говорят: «Фас!» Инженеры пытаются найти «бутылочное горлышко». Получается плохо. Во-первых, документация далеко не полная, и документы сохранились не целиком, а во-вторых, она словно написана китайскими иероглифами. То есть несколько непонятна. Менеджер шутит о необходимости ввести в программу обучения курс «Инженерная археология», где студентов будут учить понимать технологический процесс, исходя из хреново сохранившихся документов тридцатилетней давности.\n\nИнженеры не отчаиваются. Они находят древние учебники и, фактически, учатся заново, становясь инженерами образца 1980 года. Примерно так же действуют извращенцы, развлекающиеся электроникой с радиолампами: поскольку никто не возьмётся чинить такое убожество, им приходится учиться самостоятельно.\n\nНекоторые из методик и форм записи привычны, некоторые давно устарели. Даже там, где официально ничего не изменилось, всё равно изменилось многое, потому что изменился сам критерий того, что необходимо задокументировать, а что можно не записывать, потому что каждый образованный человек будет это знать.\n\n> Лирическое отступление:\n> ![70px-ESO-Betelgeuse.jpg (70x70)](data/img/post_5_70px-ESO-Betelgeuse.jpg \"Звезда по имени Бетельгейзе.\")​​​​​​​\n> В Древней Греции любой мальчишка знал названия и умел найти на небе примерно 300 самых ярких звёзд. В путевых заметках тех времён направление указывалось по звёздам, но никто не оставлял записей о том, как можно найти ту или иную звезду: предполагалось, что раз уж человек умеет читать, то сотни четыре-пять звёзд он гарантированно знает. Названия звёзд с тех пор изменились...\n\nБыло бы неплохо, чтобы эти инженеры в конце концов написали большую красивую книгу под названием «Что этот проклятый завод делает и как он работает». Такие книги нередко пишутся в наши дни, но не инженерами, а археологами.\n\n### Обратный промышленный шпионаж\n\nВ какой-то момент один из менеджеров этой компании вышел на моего бывшего коллегу, который поддерживал со мной приятельские отношения. Это позволило компании обратиться к нам с предложением: не будем ли мы так любезны потратить немного нашего времени, чтобы проконсультировать компанию об этом чёртовом заводе? За адекватную плату, разумеется. «Адекватная плата» была в несколько раз выше моей прошлой зарплаты, а работа казалась интересной, поэтому я согласился.\n\nТаким образом, я оказался нанятым компанией, чтобы объяснить ей, как её завод работает.\n\nЯ напрягся и припомнил некоторые детали тридцатилетней давности. Часть инженерных практик, применённых при проектировании этого завода, будь он неладен, я же сам и разработал. Более того, я имел представление о том, что является важным, а что нет, и как детали стыкуются друг с другом.\n\nПримерно настолько же важным оказалось то, что у меня было немного документации. Нелегально.\n\nКогда я ещё работал на фирму, нам приходилось часто переезжать из офиса в офис, и документы терялись. Иногда не было другого выбора, кроме как сидеть и ждать целыми днями, пока кто-нибудь с доступом пришлёт нужную бумажку, а для этого надо было ещё отследить нужную библиотеку и нужного человека. Параноики, заведующие службой безопасности компании, разработали драконовские правила доступа к секретной информации, то есть вообще ко всему, касающемуся полимеров, и это зверски осложнило жизнь при посещении офисов подрядчиков.\n\nПоэтому мы разработали собственную практику под названием «не спрашивай, и нам не придётся врать». Мы делали частные копии документов и таскали их с собой. Инженеры вообще ненавидят сидеть и маяться бездельем, а наличие документации позволяло нам быстро приступить к работе. Это также позволяло нам сдавать проекты во-время, вместо того, чтобы объяснять, что мы не могли работать, потому что ждали факса с нужной информацией.\n\nМоей задачей теперь было тайно вернуть документы фирме. Я был бы рад просто прийти в офис и отдать их клерку, но поступить так было нельзя. Эти документы де-юре были у компании, и даже в электронном виде, а у меня их де-юре не было и быть не могло. На самом деле, разумеется, всё было наоборот. Но компания просто не могла принять свои документы, которые у неё есть, от человека, у которого их нет.\n\nВместо этого, мы контрабандно пронесли их на территорию и тайно подбросили документы в корпоративный архив. В бумажном виде. Во время следующей инвентаризации контролёр, может быть, обнаружит документы без идентификационных номеров, внесёт их в базу документов и озаботится снятием электронной копии. Я очень надеюсь, что это в самом деле будет именно так, потому что вряд ли проживу ещё 30 лет, чтобы контрабандой пронести их в компанию снова.\n\nА, ещё одна деталь. Я же нанятый внешний консультант-контрактник, помните? Мне по статусу не положено знать корпоративные секреты. Служба безопасности должна знать о движении секретной информации и предотвращать её попадание ко всяким пришлым. Проблема в том, что у них нет ни малейшего представления о секретах, а у меня есть. Более того, я их изобрёл, и патенты были выданы на моё имя. Тем не менее, мне нужно очень тайно и секретно пронести эти данные в фирму, чтобы служба безопасности о них узнала и смогла доблестно предотвратить мой доступ к этим тайнам.\n\nМы часто слышим о промышленном шпионаже. Я был бы рад почитать исследования явления обратного промышленного шпионажа, --- когда компании забывают собственные секреты, и работники должны тайно, нелегально вернуть их. Я уверен, что это происходит значительно чаще, чем вы думаете.\n\n### Проблема имеет решение?\n\nЯ не знаю, в чём заключается мораль истории.\n\nМожет быть, лучшая организация документооборота решила бы часть этих проблем. С другой стороны, именно попытки улучшить организацию документооборота и послужили причиной части этих проблем, так что надо быть внимательным. Было бы здорово, если бы сохранились библиотеки отделов. Мы решили задачу только потому, что сумели найти одну из них.\n\nС сохранением знаний о технике и о делении на важное и неважное ещё хуже. Видимо, лучшим способом будет держать в фирме людей разных возрастов, без особых возрастных разрывов, чтобы отделы не оказались обезглавленными, когда старшее поколение уйдёт на пенсию.\n\nНо, возможно, инженерная археология всегда будет существовать. Вон, в Нью-Йорке собираются перестраивать пригороды. А это уходящие за горизонт ряды заводов, построенных кроманьонцами, оставившими после себя только обрывки карт и диаграмм."
		},
		{
			"post_id": 4,
			"title": "Виды социальных сетей с точки зрения распределённости",
			"date_published": 1503100468.785,
			"body": "Продолжаю набивку справочника :) Пусть вас не смущает, это не блог-запись, это фактически страница [распределённого сайта](/1PxNZqJ3R3aUt171foqtzbhgZZ6JaggaAi/?Post:15:%D0%9D%D0%B0+%D1%87%D1%91%D0%BC+%D0%B4%D0%B5%D0%BB%D0%B0%D1%82%D1%8C+%D0%B7%D0%B0%D0%B9%D1%82%D1%8B).\n\n* * *\n\n1.  Централизованная социальная сеть. Это всем привычные Facebook/Google+/Вконтакте/Twitter и другие. Есть один сетевой ресурс, с которым работают пользователи. Этот ресурс может что угодно сделать с пользователем и его данными (забанить, удалить). С этим ресурсом тоже могут быть проблемы в виде падений, закрытия, блокировок и т.п.\n\n2.  Распределённая федеративная сеть. Не смотря на непривычную формулировку, с этим типом знакомы практически все. Так работает E-mail. Есть много независимых серверов. У них есть пользователи. Пользователи общаются со своими серверами, а сервера уже взаимодействуют между собой скрыто от пользователя. При отказе/закрытии какого-то сервера его пользователи теряют свои аккаунты и данные, но сеть в целом продолжает работать. На этом механизме работает много распределённых социальных решений. StatusNet (GNU Social, Mastodon), Disapora, Moveim. Система быстрых сообщений XMPP (Jabber) тоже работает по такому же принципу. У некоторых социальных сетей предусмотрен переход пользователя со всеми контактами на другой сервер, что может отчасти защитить пользователей при отказе серверов.\n\n3.  Децентрализованная сеть. Это случай полного отсутствия любых особо выделенных серверов. Все пользователи равноценны, все являются источниками данных для всех. Пропажа из сети одного пользователя никак не сказывается на работоспособности остальных. Такую сеть очень сложно заблокировать, нарушить её работу."
		},
		{
			"post_id": 3,
			"title": "ZeroNet",
			"date_published": 1503100387.23,
			"body": "_Вводное описание сети ZeroNet для ознакомления новичков. Черновик в рамках [системы распределённых сайтов](/1PxNZqJ3R3aUt171foqtzbhgZZ6JaggaAi/?Post:15:%D0%9D%D0%B0+%D1%87%D1%91%D0%BC+%D0%B4%D0%B5%D0%BB%D0%B0%D1%82%D1%8C+%D0%B7%D0%B0%D0%B9%D1%82%D1%8B)_\n\n* * *\n\nХотите, чтобы ваши данные гарантированно хранились вечно, пока есть хоть один человек, заинтересованный в этом? Тогда ZeroNet — отличный выбор!\n\nЭто не просто социальная сеть, это платформа для распределённых приложений. В ней имеются блоги, форумы, микроблоги, wiki и другие динамические приложения. Когда Вы посещаете чей-то блог, он сперва выкачивается целиком к Вам на компьютер и Вы начинаете читать его локально и тут же раздавать всем желающим. Потом, если не понравится, можете стереть его. Но до тех пор, пока это не сделаете, читаемый Вами блог будет доступен всем участникам сети. Так работают все приложения ZeroNet.\n\nЭто почти чистая распределённая сеть. Никакой федеративности, никаких узких блокируемых точек. Единственное несколько узкое место — это система подписей пользователей. Выдаются они на одном централизованном узле. При его отказе сеть будет работать. Только не смогут появляться новые пользователи, пока приложения не будут переведены на другие аналоги или вообще на анонимное использование. Так что проблема больше гипотетическая и не принципиальная.\n\nПриложения ZeroNet являются динамическими. То есть автор блога может сделать новую запись. Другой читатель — оставить комментарий. Всё это придёт к Вам на компьютер и Вы сможете немедленно увидеть изменения. Распространение обычно происходит реально очень быстро, от считанных секунд. Хотя при проблемах с прямым соединением данные, конечно, могут расходиться и дольше.\n\nЭтим ZeroNet выгодно отличается от аналогов, типа FreeNet. Собственно, скорость работы в ней вообще не зависит от скорости Интернет-канала, потому что работа идёт с локальным сервером, который уже незаметно в фоне занимается синхронизацией данных.\n\nЕсли продолжить сравнение с другими p2p-соцсетями, например, в отличие от i2p или Tor это именно сеть, а не протокол анонимного доступа. i2p и tor просто обеспечивают (порой, очень медленный!) доступ к обычным сайтам. Более того, ZeroNet сама может работать через Tor. Так вот, при падении обычного сайта, к которому обеспечивается доступ через Tor/i2p, он перестаёт быть доступен кому-бы то ни было. В ZeroNet отсутствует какой-то один центральный сервер. И поэтому работоспособность ресурсов не зависит от доступности их авторов.\n\nВ отличие от RetroShare, ZeroNet не требует отдельного клиента и легко доступна из обычного Интернет через прокси (пусть и с ограниченным функционалом).\n\nПоследним ZeroNet также выгодно отличается от многих аналогов. Чтобы посмотреть её работу не нужно ничего устанавливать, достаточно найти прокси (гейт). Например, это может быть [https://www.zerogate.tk](https://www.zerogate.tk).\n\n## Ссылки по ZeroNet\n\n*   [Краткая информация в обычном Интернете для начинающих](http://zeronet.a0z.ru/)\n*   [Форум ZeroTalk по распределённым социальным системам](/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/)\n*   [Блог ZeroNet@Balancer](/1PxNZqJ3R3aUt171foqtzbhgZZ6JaggaAi/)"
		},
		{
			"post_id": 2,
			"title": "RetroShare",
			"date_published": 1503100281.636,
			"body": "(черновик)\n\nRS — это такой комбайн «всё в одном». Устанавливается программа (Windows, Linux), происходит вхождение в сеть (не самая тривиальная процедура) — и готово. Вы можете с другими участниками сети:\n\n*   Общаться на форумах\n*   ​Вести переписку как через почту, так и в чатах\n*   Делиться с другими участниками файлами\n*   Публиковать файлы в специальных каналах\n\n[![](https://gw-ipfs.tk/ipfs/QmY7ZTMKDRr4kkwkV1JV4WgBWFuWvWSzes2t77imtECSJY/RetroShare-forum-800x.png)](https://gw-ipfs.tk/ipfs/QmQpzjDpBWLU6imNNVkBhn7uAAndKsXdkjo9C9wef6Y3GC/RetroShare-forum.png)\n\n* * *\n\nВсё это — с высокой заявленной степенью анонимности. RetroShare — это friend-to-friend сеть, где взаимодействие осуществляется только между доверенными пользователями. Хотя, по «правилу пяти рукопожатий» связь получается в итоге почти всех со всеми, RS позволяет строить закрытые сети «только для своих». Достаточно не добавлять в друзья никого неизвестного. Это обеспечивает высокую защищённость и анонимность сети, но это же сильно снижает скорость сети и её популярность.\n\n## Ссылки на обсуждение RetroShare\n\n*   [В Infonesy.Talk](/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/?Topic:14_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/RetroShare)\n*   [На форумах Авиабазы](http://forums.balancer.ru/tech/forum/2016/03/t92691--retroshare-vsyo-chto-nuzhno-dlya-detsentralizovannogo-obmena.html)"
		},
		{
			"post_id": 1,
			"title": "Карта зайта",
			"date_published": 3275878500,
			"body": "*   [ZeroNet](/18i1Ra9wePfmwhMCyhmLXXShxcSha5YAns/?Post:3:ZeroNet)\n*   [RetroShare](/18i1Ra9wePfmwhMCyhmLXXShxcSha5YAns/?Post:2:RetroShare)\n* [Особенности контингента разных распределённых соцсетей](/1GQkPB8mFgxH7GQQbkNPJtvRaZZpVi65u1/?Post:26:Особенности+контингента+разных+распределённых+соцсетей)"
		}
	]
}