{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "去中心化信贷稳定法币与密码币汇率的思想",
			"body": "去中心化验证用户身份帮助找回忘记密码的数字资产\n要解决的问题：\n比如比特币密码忘记了怎么办？硬盘等存储介质格式化了怎么办？火灾烧毁密码怎么办？\n解决方案：\n开发一种新功能，用户可以通过客户端存储自己的身份信息到区块链，比如手机号，当用户密码丢失，可以申请用手机号找回密码。步骤是这样的：\n失主重新安装客户端生产新的账户或私钥\n失主在客户端申请找回密码\n填上手机号，广播到区块链\n系统自动分配编码\n矿工收到失主的请求\n矿工将该编码通过短信发送给失主\n该编码就是失主的手机验证码\n失主输入验证码\n通过验证码与私钥匹配上即可找回之前账户资金。\n每个环节都会产生手续费成为矿工收入，矿工扮演的角色如下：\n维护整个区块链的安全pow\n真正去中心化，CPU挖矿yescryptr16或者更特殊的算法\n帮助失主找回资金密码pov\n后期为节省电力逐渐增加pos的权重。\n\n为体现“密码找回”这一创新功能的价值，我计划发行专属代币\n名字可以是：保护币、验证币、身份币等，大家可以提出自己的建议\n这个代币可以开放api接口，让其他币种也能实现身份验证与密码找回\n后期还可开发去中心邮件系统:name@coin.bit\n让旷工电脑自己发送邮件验证码，不需要人工发送短信，全自动化身份识别\n还可以开发身份识别器，指纹虹膜人脸识别等\n将解决“我是谁”，如何证明“我是我”等终极问题\n这又是另外一个大的课题了，以后探讨。\n开发团队与ICO团队正在招募中，对本课题感兴趣的朋友欢迎加入我们\nEmail：ideavista@163.com\n\n先探讨当下问题：\n身份信息是否会被泄露？\n在传统手机验证过程中，服务商知道你的手机号，而在本币中，负责认证你身份的矿工是唯一知道你手机号的，但他不知道你有多少资金。除此之外没有任何人知道你任何身份信息，因为一切皆都是在雾端强加密保存。\n手机短信验证码泄露怎么办？\n没关系，私钥还在你手上，资金依然安全\n矿工给我发送错误的验证码怎么办？\n没关系，继续申请新的验证码，单笔矿工费用自动退款\n被恶意ddos系统是否崩溃？\n不会，每一个步骤都需要消耗代币，比如提交身份信息按bit收费、申请密码找回、每条验证码、去中心化交易等其他类似于gas\n还有其他什么问题，欢迎探讨，打造一个完美的系统，我们都是其中的螺丝钉\n\n\n有一种极端情况，非常多的矿工为了利益和某一个坏人合作坑用户\n如何避免矿工是坏人？\n假如某一个骗子和所有矿工说：把所有验证码都发给骗子而不要发给用户\n\n补充两点\n指纹信息也是其中验证条件\n6位数字验证码是可选条件\n还有老外常用的Google验证器也可以加进去\n验证条件可以按照用户喜好升级修改\n大部分验证条件可以通过api接口自动完成，无需人工操作\n本系统中矿工扮演很重要的角色也享受比其他币种挖矿更高的收益\n为鼓励矿工长期诚恳稳定的工作，额外给予矿工收益每月持币利息1%\n注意是矿工工资才有利息，买来的币是没有利息的\n\n\n\n\n去中心化信贷稳定法币与密码币汇率的思想\n\n作为一般等价物的货币最主要的特性是价格稳定才能被广泛使用\n而市面上的比特币等密码币更多的表现为投机性数字资产\n法币能维持价格稳定的方法是央行不失时机的提供流动性与收缩流动性\n有没有一种方法，去中心化增加或收缩流动性？\n这里需要设计一个全新的币种，暂时名曰“信贷币”\n当市场投机氛围很浓的时候，信贷币可以自动增加流动性\n当市场冷却后，信贷币可以自动收缩流动性\n比如说，我有1000个信贷币\n上月我以1元/个借给了一个朋友1000个买手机，还款期一个月，利息1%\n今天价格涨到2元/个了，我朋友觉得很亏，因为他要用2000元买回来1000个币还账\n所以我朋友就宁愿选择违约不还账\n此时注意了，到了还款日朋友还没还账，信贷币系统会自动为我打币1000个\n此时此刻，整个信贷币生态增加了1000个流动性来平抑市场投机泡沫\n而我朋友在生态里面留下了信用污点，这个账本是公开的，任何人可查询\n等到了下个月，币价跌回1元/个，我朋友可以买回来还账，信用污点自动抹除\n也就是说这一千个币的流动性又收缩回去了。\n是不是只有在熟人之间才能提供这种信任呢？\n不，我下面试图用陌生人来提供信用\n这时需要引入一个已经存在的账户体系，比如比特币\n假设程序规定2013年以前所持有过0.1个比特币以上的账户\n现在可以在信贷币体系里面借1000个信贷币（信贷币可自动检测任何开放账本）\n由于早期的比特币玩家账户是稀缺资源，相信他们一般不会不还账\n为了激励他们还账，还可以制定一条规则，循环借贷\n上一笔账户还清后可借更多的信贷币，比如每月增加1%\n如果遇到特大的投机泡沫，需要引入更多流动性\n甚至地球上的每一个成年人都有资格加入\n方法如下：\n首先要有一个去中心化的身份认证系统，可以参考：\nhttps://bitcointalk.org/index.php?topic=3044240\n需要生物识别来注册专属账户\n比如说人脸识别，去中心化人脸自动识别去重\n仅仅是自动去重还不够，还需要人工辨别真身\n强调一下这一切都是建立在隐私高度保护上的。\n\n这里面存在一个问题\n信贷诈骗\n比如我和朋友勾结，故意让他借钱不还，免费得到的一千块钱我们下馆子\n如果这样的人占大多数，本系统有崩溃可能\n解决办法如下\n逾期一个月以上者在公开账本上列入黑名单\n借出人也会收到连带处罚，暂停账户三个月\n因此我会审核借币者的资质\n比如说视频连线问答：\n您是怎样知道这种借款方式的？\n您知道区块链的原理吗？\n你相信比特币以后会走进千家万户吗？\n谈谈密码学好吗？\n……\n\n当然，不能保证100%的人都最终还账\n但是，并不影响币价的更长期基本稳定\n当密码币热潮期间借币者会更多，违约也会更多\n相当于人们用信用增发货币平抑币价\nProof of credit\n这种信用增发最后也是有极限的\n短期属于市场行为自动宏观调控而已。\n\n比特股和usdt和digixDAO\n这三种密码币都锚定美金或者黄金\n但都是以抵押担保的形式\n最终都存在抵押品贬值或被盗和担保人违约或自黑而崩盘的风险",
			"added": 1520347316,
			"parent_topic_uri": "19_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 2,
			"title": "去中心化身份管理系统的生态建设与应用",
			"body": "警告：非资深Fintech人士可能看不懂\n\n\n\n本系统至少可以解决以下问题\n\n隐私泄漏问题\n\t斯诺登爆料政府对所有公民通讯窃听，包括短信、email等，京东数据库几个G的会员资料泄密、QQ被冒名登录对亲人行骗、天涯论坛几十万会员密码被盗、如家酒店开房信息大面积泄露、招生办考生信息全被变卖等等，这几年这些案例层出不穷，如果我们用了本文区块链加密技术，这些问题都可以避免。\n密钥丢失问题\n比如比特币密码忘记了怎么办？硬盘等存储介质格式化了怎么办？笔记本被盗怎么办？火灾烧毁密钥怎么办？密码丢了资金也就再也找不回来了吗？本系统身份识别+雾端存储可以让你资金找回来。\n被庄家恶意操控割韭菜\n密码币市场筹码稀缺、流通市值小、匿名性、缺乏监管等特点导致庄家肆意操控割韭菜易如反掌。而本系统密码代币（以下简称本币）能实现自动调控，币价百年不变，从密码学与经济学的手段杜绝庄家割韭菜，而每个散户都可轻松获利。\t\n去中心化P2P借贷\n目前市面上的p2p坏账太多、利息太高，沦为高利贷的翻版，甚至很多黑平台集资诈骗卷款跑路，而本方案将打造的区块链上的信贷系统：利息非常低、零坏账、千年不倒！\n\n\n解决方案与步骤\n\n去中心化登记身份信息\n比特币私钥丢了就意味着资金永远丢失，为什么？因为私钥是你唯一的身份象征，而银行的密码忘记了可以找客服为什么？因为银行登记了你身份证、手机号等信息，密码不是唯一的身份象征，通过核对身份证手机号就可以确定你是账户的所有人，所以我们也可以在密码币上面登记自己的身份信息来证明账户合法性，哪怕秘钥丢了，也可以通过其他身份象征找回，身份象征包含哪些呢？身份证、手机号、QQ号、email等，其实更好的身份标识是生物识别，比如人脸、指纹、声纹、虹膜、甚至DNA。所以我们设计了下面的系统来保证秘钥丢了资金依然安全：\n保密箱（safekip）的引入\n会员所有身份信息存贮在保密箱，所有资料是强加密后去中心化保管在区块链里面的，世界上最强的超级计算机也需要一万年才能解密，没有中心机构或个人有权利解开，除了会员自己。safekip工作原理如下图：\n \nSafekip是本系统的核心部件，后文介绍的多项重大应用都需要使用到safekip，比如说其中最简单的一项应用失主找回密码功能，用户可以通过客户端存储自己的身份信息到safekip区块链保存，比如手机号，当用户密码丢失，可以申请用手机号找回密码。步骤是这样的：\n失主重新安装客户端生成新的账户或私钥\n失主在客户端申请找回密码\n填上手机号，广播到safekip区块链\n系统自动分配编码\n矿工收到失主的请求\n矿工将该编码通过短信发送给失主\n该编码就是失主的手机验证码\n失主输入验证码\n通过验证码与私钥匹配上即可找回之前账户资金。\n更好的密码：心灵密语\n比特币私钥是一串没有任何意义的随机字符，常人不可能用脑袋瓜子记住；后来有了脑钱包，是一串有特定意义的随机单词，常人花点时间是可以记住的，但是时间久了很容易忘记；本人发明一种心灵密语，密码强度不低于比特币秘钥，且很容易记住绝不会忘记：\n你可以告诉本系统safekip，你内心最深处的秘密，永远都不愿和别人分享的秘密，本系统更绝不会泄密\n比如我小时候有一只宠物的名字+她后来怎么死的\n童年时期暗恋过谁？被谁揍过？+为什么从来没向外人分享？\n以上就是我的私钥，请问谁能破解？\n人的内心世界是最复杂的密码，也是只有自己知道的密码；\n我们还可以对safekip“保密箱”倾诉当成秘钥：\n请上帝饶恕我的罪过，我有个秘密永远都不能向任何人说“…我就是中本聪………”\n假如某天我被人灌了迷魂药我把以上秘密全部说出去了，但你不知道以上字符串如何组合的，比如那只宠物“被车撞死的”“被摩托车撞死的”“被卡车压死的”“被火车辗轧而死”等等太多组合，而每一次验证都要燃烧gas，系统并自动发短信或邮件通知账户持有人：有人正在频繁尝试登录账户。\n用户提取密文的过程\n比如说我的比特币秘钥忘记了，我现在需要请求safekip找回秘钥，可以输入上文存储过的email地址，系统就会自动将验证码发给你邮箱，然后你就可以通过保密箱验证查看比特币秘钥；这种方式类似于传统的找密方式，安全性其实并不高，因为邮箱也有被盗可能，所以safekip系统验证方式是多种组合，确保足够安全：\n \n\n分别说明一下每种验证方式与安全性\nEmail验证：将使用去中心邮件系统:name@coin.bit，他的优点是没有服务器，所有通讯都通过区块链加密保存；手机号验证：矿工人工发送手机号验证码后者系统自动发送验证码，为避免矿工作弊，系统随机分配两名矿工发送不同的验证码，用户正确填上两条验证码才算数；心灵密语：本质上也是一种高强度密码，但词语组合方式可能要多试几遍才能通过验证，每验证一次都要按字节收费；视频验证：与矿工视频连线，就像面对面交流一样，人工核对是否本人正在操作当事人账户，前提是用户存储身份信息的时候开通了人脸识别服务，用户的正脸相片在区块链上加密保存。人工视频验证步骤：视频连线听我口令“正脸看我、深呼吸、眨眼三下、摇头、抬头、请拿上纸笔写下如下验证码***”这样做的目的是防止人工智能虚拟现实影像行骗。更多细节问题欢迎在bitcointalk讨论。\n\n\n去中心化P2P信贷\n\n\t有了上文safekip身份识别系统基础上，登记了真实身份的区块链用户之间就有了信任度，可以轻松实现个人小额纯信用贷款，视频连线，现场审批现场放款无需等待，最初构思大概如下文：\n\t作为一般等价物的货币最主要的特性是价格稳定才能被广泛使用，而市面上的比特币等密码币更多的表现为投机性数字资产，法币能维持价格稳定的方法是央行不失时机的提供流动性与收缩流动性。有没有一种方法，去中心化增加或收缩流动性？这里设计一个全新的概念，暂时名曰“信贷币”：\n当市场投机氛围很浓的时候，信贷币可以自动增加流动性\n当市场冷却后，信贷币可以自动收缩流动性\n比如说，我有1000个信贷币\n上月我以1元/个的价格借给了一个朋友1000个\n他拿去买了手机或其他，还款期一个月，利息1%\n今天到了还款日，但价格涨到2元/个了，\n我朋友觉得很亏，因为他要用2000元买回来1000个币还账\n所以我朋友就宁愿选择违约不还账\n此时注意了，到了还款日朋友还没还账，信贷币系统会自动为我打币1000个\n此时此刻，整个信贷币生态增加了1000个流动性来平抑市场投机泡沫\n而我朋友在生态里面留下了信用污点，这个账本是公开的，任何人可查询\n等到了下个月，币价跌回1元/个，我朋友可以买回来还账，信用污点自动抹除\n他这一千个币不是还给我了，而是还给区块链系统后自动燃烧了\n也就是说这一千个币的流动性又收缩回去了。\n是不是只有在熟人之间才能提供这种信任呢？不，我下面试图用陌生人来提供信用，\n首先要有一个去中心化的身份认证系统，也就是上文提到的safekip。借款人生物识别来注册专属账户，比如说人脸识别，用户提交相片到safekip，为了防止一个人注册多个账户，safekip自动识别去重，然后矿工人工辨别真身，强调一下这一切都是建立在safekip隐私高度保护上的。这里面还需要规避一个问题：信贷诈骗，比如我和朋友勾结，故意让他借钱不还，免费得到的一千块钱我们下馆子，解决办法如下：逾期一个月以上者在公开账本上列入黑名单，借出人也会收到连带处罚，暂停账户放贷三个月。后期累积的数据足够多，该公开账本就就构成了不可篡改的公民征信系统，了解区块链特性就懂得区块链数据的不可篡改性与权威性，任何人都可以从这个公开账本查到借款人的征信记录，说是互联网公民共识也好说是道德绑架也罢，总之它就在那里像上帝一样记录着每个人的功过是非。\n信贷币特性：\n信贷奖励\n违约有处罚，信用良好有奖励，比如说循环授信，上一笔贷款按时还清，下一笔贷款就可以多借10%，可以无限累计信用额度；审批人（矿工）每放一笔贷款加一分，贷款成功收回再加一分，贷款逾期三个月扣一分，这个分数累积起来就是矿工的算力，算力与收益成正比。\n利息封顶\n借款人无论违约多久，利息最高10%封顶，比如你借币一千，十年后才还账，利息也只有一百，这点是传统金融机构永远无法做到的，只有区块链P2P信贷能做到。因为借款人不还账，借出人也能收到本金保障，人与人之间不产生任何坏账，欠的只是区块链的，区块链记载着借款人全部信用，祂不怕你不还账。除非你敢说“我就借这一笔钱，以后再也不上网，你能把我怎么着？”\n按需增发\n现代经济学认为法币应该与政府欠债挂钩增发，而本密码币是按照普通百姓的债务需求增发。这将是本人在经济学界的一项重大创新，让凯恩斯们大跌眼镜！\n增发规则\n市面上的密码币都是固定增发模式，每年的通胀率都是可计算出来的，而投机者的疯狂劲是无可限量的，人心不足蛇吞象，当密码币市场热潮期间，本币的借币者会更多，违约也会更多，相当于人们用信用增发货币平抑币价，增发的数量完全取决于投资者的疯狂程度，自动匹配市场信贷需求，基于会员的信用评级共识机制Proof of credit，密码币多了一种全新证明方式。但热潮过后，所有币种一地鸡毛，本币可能也会受到非理性抛售情绪牵连，此时将触发收缩流动性机制：\n燃烧机制\n当本币现价低于借款时价格，借款人会觉得现在还币很划算，比如说借款时一元一个，现价0.5元一个，之前借了一千元本金，现在只需要还五百元本金了，这种机制能自动激励大家还账，还账后这一千个币自动被区块链燃烧掉了，也就是说在熊市的时候本币通货紧缩来自动维稳币价；另外还会触发投票机制：\n\t  投票机制\n当币价下跌还会触发信贷收紧，由最近三个月的活跃账户进行投票，是否暂停新增信贷三个月（老会员依然可以贷款），投票生效条件是超过半数的的会员参与。同样的在大牛市中为了抑制本币非理性上涨，可以投票是否增加授信额度，比如说以前授信额度1000，现在变成2000。币价涨跌掌握在散户手中，庄家永远都别想在本币中割韭菜。更多细节问题欢迎来bitcointalk讨论。\n\t  本币定价参考\n最近一百年资本市场动荡不安，基本上每一种资产都经历过好多次暴涨暴跌，哪怕黄金与粮食价格也不例外，实在找不到一种合适的参照物，不如暂时就用美金吧，比如定价$1美元1个，如果币价被庄家炒到1.5元，一人一票投票让它跌下来，如果币价被庄家打压到了0.7美元一个，投票让它涨上去，如果美国发生国难导致汇市崩溃，我们再投票选择其他价格参考物。\n\t  重点说明\n信贷币在市场需求旺盛的时候自动增发信贷，对于信用良好的循环借贷人无需矿工审核，实现一键放款，这个时候借款人直接从区块链系统借币，而不是从矿工手中借币，在市场需求萎缩的时候借款人是直接向区块链系统还币（还之前的循环借币），还币成功连本带利自动被系统燃烧掉了，类似于美联储的收缩流动性烧币机制。\n\n\n矿工角色与共识算法\n\n矿工在本系统中扮演了非常重要的角色，也将得到更高的回报，职责与回报分别如下：\n维护底层基础区块链安全\n这个类似于比特币的pow，但本币将采用的算法是scrypr16，一种适合cpu的挖矿算法，从技术上客观避免了显卡与矿机对算力份额的掠夺，更加公平更加去中心化，任何人用电脑办公期间顺便挖矿就行。（系统层次如下图）\n \n\n维护雾化链密文安全\n用户的身份信息是存储在雾化链的，所有身份信息是无数次剪碎存储在全球51%的矿工电脑硬盘强加密锁定的，用户保管与验证身份信息的过程本质上是存储与读取byte数据，此时矿工的收益类似于sia（SC）。\n\t在应用链为用户服务\n\t这种服务类似于银行的客服代表，在这个层面上将有各种应用生态，比如在P2P网贷应用上充当的就是信贷审核员角色，视频连线新会员核实身份发放贷款赚取利息；在协助失主找回密码的过程中赚取验证费等。\n\t值得说明一点的是在本系统中，矿工的主要收益来源于应用链，多劳多得，电脑配置高低对收益几乎没有影响，任何普通电脑都可以胜任；手机端只建议参与应用链挖矿。矿工可以是会员，会员也可以做矿工，取决于用户本身何时有时间从事这项兼职工作，也可以当全职工作，信用积分高的矿工被系统随机分配任务的几率更高，proof of credit，和硬件配置无关，矿工收益绝对比银行职员工资高，因为本系统能自动构建一个高效DAO组织。\n目前市面上的众多共识算法机制，各有各的优势与缺点，无非是从安全性、公平性、节能、交易速度4项指标各取所需，最终找到自己的平衡点，本币将采用scrypr16算法确保其公平性与节能性，用DAG算法或者其他侧链技术提高其交易速度，侧链技术在安全性方面不是很高，可能遭受恶意节点的攻击或者异地双花，究其原因是因为节点没有真实身份才敢为所欲为，而本系统safekip技术将实现比银行系统更有效的身份识别能力，用户可以根据自己需求只选择信用记录良好的节点作为自己的支付通道，因此综合节点可信度可达99%以上，完全能胜任DAG技术应用或者闪电网络通道的持续畅通。\n\n\n应用生态\n\n保密登录\n比如你想在论坛发言，必须有一个账户，你可以注册一个或者使用微信扫码登录，现在大家普遍使用的登录方式是QQ、微博、微信、Facebook、Twitter等社交工具实现一账号登录，然后论坛会读取你的身份信息，这种登录方式非常容易造成隐私泄露或者账户密码被盗，这种中心化的身份管理系统，网站管理员是可以看得见你全部身份信息与密码的，中国网民基本上都有QQ号被盗用过的经历。如果使用本系统safekip，用户的身份信息是绝对安全的，没有任何管理员有权限查看到你的资料与密码，你用safekip登录某一个论坛，论坛管理员就能确定你是一个有身份有信用评级的人，他也不需要审核你任何资料就可以让你验证通过，管理员也能确定此刻登录的不是机器人注册的垃圾账号来滥发广告贴的，于是管理员就可以直接授予你发帖的权限。网上购物也是一样，你不需要注册账号就可以用safekip一键登录购物，你只需要授权给它快递地址就行了，至于姓名电话身份证号银行卡号绝对不会泄露给电商平台也更不会被隐私贩子变卖。\n信贷\n实现了真正意义上的P2P贷款，具体机制上文已经说过，这里不再重复。现在市面上的P2P网贷其实是网站平台与用户产生的借贷关系，比如说借出人的钱是放在网站平台方的，贷款人的钱也是平台方账户打过来的，平台方在从中收取了手续费并沉淀了所有投资者的资金，而区块链网贷是直接个人对个人的，没人收取手续费，实现了真正意义的P2P贷款。\n密码找回功能\n密码找回机制开篇就说过，这里不重复了。现在要说的是本系统可以开放API接口，让更多的币种接入进来，让任何密码币都可以实现密码找回功能，过程大致如下：\n其他密码币连接safekip接口\n用户使用safekip一键登录\nAPI调用*.json文件\n发送到用户safekip安全保管\n<当用户秘钥忘记>\n用户使用safekip一键登录\n申请密钥找回\n矿工验证失主身份\n验证通过后safekip自动恢复*.json文件\n秘钥找回成功！\n\n\n线路图（略）\n\n基础链开发\nYescrypr16挖矿\n基础链上线\nSafekip测试\n人脸识别上线\nProof of credit挖矿\n身份系统测试\n信贷功能上线\n登录系统上线\nAPI\n……\n\n\n\n\n基金会\n\n基金会的职责在于开发维护本币稳定发展，新事物的诞生难免会有bug，这个需要在长期实践中反复修改；另外基金会将不定期参与会员组织的公益活动，但没权利参与运营，而本币投放市场后，所有人都可以参与挖矿，本基金会没有任何特权挖到更多的币，safekip开发为一个系统性工程，不是单纯的一条区块链，而是一个多功能应用系统，开发周期会更长，研发成本也更高，其中生物识别还涉及到其他公司的专利技术，可能还需要花钱购买，所以本基金会将预挖一千万个币分批次释放给开发团队，并接受其他机构或者个人公开捐款，谢谢支持！基金会在项目成长期伴有重要作用，有助于项目快速推进，到了成熟期基金会就完全可以不必存在，本系统将成为一个真正意义上的去中心化自治组织（DAO）。目前市面上比特币属于去中心化货币；以太坊属于去中心化自治组织，但基金会持有stake过多；去中心化交易平台bitshares创始人bytemaster虽然离开，但另一个寡头openledger依然垄断，说白了就是谁的钱多谁就能控制更多的选票谁就是老大。而本系统不一样，无论钱多钱少大家都平等，因为在这里实现了真正的民主与无法作弊的一人一票制。\n\n\n社会价值\n\n一人一票\n在匿名密码币世界，一个人可以开无数个账户，根本无法实现一人一票制，与其说投票，不如说是投钱，比如比特币的隔离见证分叉投票，99%的普通电脑根本挖不到矿（也就无法投票），只有那些专业asic矿机与矿场才能掌握投票权，这种结果准确来说是“一币一票”。在真实社会中的投票方案是公民填好纸质的选票后投向投票箱，然后由计票员统计票数，这种方式在大部分情况下是基本可靠的，但是无法避免管理层腐败操纵计票结果，这种事情在很多国家多次曝光过，还有更多没有曝光的黑箱操作世人就不得而知了，而本系统能完美解决以上问题，用实名身份加区块链无法作弊的特性让任何人都可以100%信任，轻松实现真正意义上的公开透明一人一票制并且比人工计票高效一百倍。\n信息安全\n建立隐私高度保密型社会，除了区块链知道公民的身份信息，其他任何网站等商业机构都无法知道，它们可以对接safekip区块链的API调用公民的身份参数，仅仅只是在用户授权的时候调用所需参数而不是全部身份信息更不是密码。\n信用评级\n本系统最终将形成一个庞大的互联网公民征信报告，每个人的信用评级都可以通过公开账本查询到。而且是全球通用的，不像央行征信只对所属国有效。\n经济学实验\n经典经济学派和凯恩斯马克思派激烈博弈，或许从本币上市后的影响力与价格稳定能力就能检验哪一派别更胜一筹，货币政策宏观调控凭什么只能是央行决定而不是公民决定？美联储之类的这种经济结构金字塔尖是否可以削除？揭晓后的答案或许让人叹为观止！\n公平社会\n华盛顿的理想人人生而平等，但现实社会每个人出生所拥有的财富是天差地别的，富贵人家的孩子和穷人家的孩子生活条件迥异，同时穷人更难贷到款利息也更高，而本密码币无差别的授信每个人初始信贷额度与利率。比特币虽然赋予百姓铸币权，但挖矿门槛太高，只有大型矿场可以获得超额利润，而本币是多劳多得的机制，每个人都可以轻松学会如何赚钱，早期投资者和后来者机会均等。\n就业机会\n矿工们都可以在家办公（SOHO），宝妈与残疾人等人群也能轻松从网上赚钱，时间自由安排，一单一结。本系统应用链层面将会有很多的基于身份信息的重量级应用上线，比如信贷币，实现了真正意义上的P2P贷款，可以取代现有网络小贷平台与所有银行个人小贷业务，全球大概有百万的就业人口。未来物联网领域也需要身份识别，市场暂时无法估量。\n\n\n商业价值\n\n个人信贷市场\n拒不完全统计，全球每年个人无抵押信贷新增壹万亿美金左右，信贷币模式（放款快、利息低、无坏账）具有无可比拟的优势将很快抢占这块蛋糕。本币打通了个人跨国贷款，不同的国家资金成本与银行存款利息不一样，比如日本利率只有0.5%，日本民众很不愿意存款，而在当地又没有高利率投资产品，此时他们可以通过本系统贷款给中国、印度、越南等高利息国家的民众。\n取代USDT市值\n目前密码币市面上用的最多的一般等价物是USDT，这是香港的一家公司所发行的密码币，公司承诺和美金一比一兑换，这种中心化的价值承诺随时都有违约风险，比如说公司监守自盗，这种事情在币圈是经常发生的，公司的储备金账户听说还经常被美国政府冻结审查什么的，始终游走在法律的灰色地带，FBI想灭了他分分钟的事情，就像俄罗斯的btc-e。虽然USDT存在这么多问题，投资者也心知肚明，但市场多么的缺乏一种稳定形态的一般等价物，现在多了一种更好的选择，本密码币取代USDT市值在短期内就可以实现。\n中期价值为整个数字资产市场总值\n货币的价值在于衡量全社会的产品与服务，本币有去中心化与价格稳定两大特性，全球任意流通，是所有数字资产最佳的一般等价物，我们预计本币中期价值将等于整个密码币与其他数字资产的市场总值。\n\n\n\n\n潜在风险与应对\n\n庄家价格操控\n庄家有巨额资金可以操控价格，现阶段密码币市场市值还很小，所有币加起来都不如一个goog与aapl的市值，小盘市场自然成了坐庄的理想标的。操控价格的目的是为了获利，而本币在增发与减发机制上让庄家无法获利，自然而然庄家就没有操控本币价格的动机，但不排除一种低概率事件，交易员犯傻导致的乌龙事件，以及竞争对手的恶意报复，它宁可烧钱不计回报就是要恶意打击本币，本币属于新兴事物，开始阶段市值也很小，为避免被扼杀在摇篮之中，基金会在一年内预留一千万个币以及一千万美金作为平准基金，以防止黑天鹅事件，等本币成长起来市值足够大的时候就没有任何庄家能够撼动了，平准基金也就没必要存在了。\n超人工智能\n现阶段的人工智能只相当于3岁小孩子的综合智商水平，对本系统造成不了任何伤害，比如利用无数虚拟机器人来欺骗safekip创造无数个假身份骗贷是不可能的，加上更高层级的涉及到大额资金安全的验证方式是视频连线矿工进行类似面对面的人工审核，矿工的智商绝对是高于三岁小孩智商的。假如未来机器人进化出了超人工智能，也就是比矿工更高的智商来欺骗safekip怎么办？对于这种问题我只想答复你“一百年后有可能”\n量子计算机\n在本系统底层链目前算法机制是scrypr16，这种算法公平性与节能性有优势，但在算力方面没有优势，未来高速量子运算有可能造成分叉，但我们会密切关注量子技术的发展，到时候会针对性的升级更先进的运算方式，这只是一件很简单的事情，就算到时我们团队解算了，广大会员中有略懂编程技术的人就可以代劳。\n在本系统雾化链所加密的身份信息也需要更新，这个由用户自行登录修改信息就行，将引入抗量子加密技术，这个技术其实现在就有，但没必要使用，因为量子加密技术在半导体计算机上面跑起来很卡，以后量子技术突破了再更新不迟。\n在本系统应用链层面是proof of credit，是根据会员的信用度来给予算力的，这里量子计算速度无论多快也不会造成任何负面影响。\n\n\n结论与展望\n\n\t本密码币有众多优于比特币的特性，但无意颠覆比特币，我们预计市场最终格局可能是这样的：比特币作为资产储备，成为全球大额交易的清算系统，和黄金的地位同等，而本币理论上不存在增值空间，劣币驱逐良币就像纸币驱逐黄金成为流通手段一样，本币价格永远等于1美元方便百姓购物计价却成为普罗大众的支付工具，以及职业放贷人的银行系统与小资理财方式。本币最终将成为具有普世价值与最广泛用途的互联网公民流通货币，但我不认为短期内会取代法币，因为法币系统在最近两百年发展非常成熟，有庞大的金融系统应用与多方位的监管，百姓已经习惯成自然，法币在本国基本上没有手续费并且实时到账，这是密码币目前还不能比拟的，当然密码币是个新事物还有很大发展空间，未来通过技术创新与金融衍生工具创新最终也会发展成秒到与零手续费，技术创新比如iota的DAG共识算法、lightning.network通道等，金融创新比如类似于Paypal、支付宝的第三方钱包公司，消费者通过转嫁手续费让商家买单等。\n\t再强调一下去中心化的重要性，历史上任何中心系统最终都会爆发系统性风险，比如皇权更迭、公司破产、网站被黑等等，说到底就是权力掌握在少数人手中，而人迟早会犯错误的，绝对的权力导致绝对的腐败，缺乏容错能力，一个人的错误就能导致所有成员崩溃，所以抗系统性风险唯一的出路就是去中心化才能保证长治久安。市场上目前对去中心化有一些不同的定义，有人认为比特币在走向中心化，因为几大矿场垄断了超过50%的算力，但我认为暂时的算力垄断并不妨碍比特币依然是去中心化的，比如在投票期间，广大网民可以同时把电脑打开和矿场PK，矿场份额立马锐减！以太坊也面对同样的问题，如果以太坊以后转为POS，那么持币量一股独大的创始团队与矿场勾结就可能处于垄断优势，所以我认为以太坊属于半中心化的；ripple属于全中心化的这个没有疑问，EOS治理是代理人制，或者说是人民代表制，这种制度容易导致权力高层变动、勾结、或者政变，很容易引发结构性危机，最终只有少数人获利，属于‘多中心化’。很多交易平台不用法币作为一般等价物，而使用USDT、bitUSD、digixDao等，它们虽然币值稳定了，但属于中心化的产物，都需要发行方用抵押物担保币值，发行方违约或者抵押物贬值被盗之类，都会导致崩盘。去中心化交易是未来的方向，最大的发展障碍是密码无法找回，而本币能完美解决此问题，并且自身就提供价格稳定的去中心化一般等价物。\n\t目前市场90%以上的密码币都是圈钱目的，一个比一个敢吹牛，欺骗那些不懂技术的散户接盘，噱头夸上天，最终落不了地，而本币无论从经济学方面还是从技术方面都是可以实现的。本文是本人100%原创，没有复制粘贴任何他人内容，希望合作伙伴认真对待，以长线的心态step by step来做一件伟大的事情。\n\t最后谢谢大家能花心思看完这篇烧脑巨作，这是一门跨学科创新项目，经济学、社会科学、博弈论、计算机、密码学数学等，基于系统的复杂性原理本人难免有疏忽之处，还望各行各业专家教授批评指正！\n\n\n鸣谢与致敬\n\nMurray Bookchin\n1960s提出社会去中心化自治组织模型\n保罗·巴伦\n1964年提出去中心化分布式计算机网络\nRSA\n1977年，Rivest、Shamir和Adleman发明非对称加密算法\n戴伟\n1998年提出去中心化密码币Bmoney\n中本聪\n2008年发明区块链\n亚当·斯密\n1776年美国独立前夕发表国富论解密自由市场看不见的手的威力\n\n\n\n\n\n\n\n\n\n区块链比任何人都可信\nIn blockchain we trust\n陈智强2018年",
			"added": 1521022970,
			"parent_topic_uri": "19_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 3,
			"title": "尝试预测邪恶帝国政治经济大格局走势",
			"body": "现在中美贸易战好戏连连，sb五毛竟然预测中必赢，我表示呵呵~\n明天博鳌论坛土包子洗净屏将发言，我预计不会说出什么有逻辑的论调，可能会说一些和稀泥的假大空安慰语，类似于：\n中国坚持扩大开放（稳定外商，老乡别跑）；\n中国保护知识产权（山寨大国盗取美国专利有理由，暗示会增加给美国交专利费，知错改成不认错）；\n中国人民勤劳致富（安抚民心鼓捣国粹主义）；\n中国制造2025势不可挡（鸭子死了嘴巴硬）等等",
			"added": 1523249618,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 4,
			"title": "这两天是不是zf有在B搞B搞的，翻墙软件都失效了！！",
			"body": "fuck China",
			"added": 1534818294,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {
		"6_1Kgw38fVSxUaW1CiMQmf2TyR7C57B8z491": 1
	},
	"next_comment_id": 34,
	"comment": {
		"15_164S7NQPD3KDoiVyU8oKx1VmsZM7z161tB": [
			{
				"comment_id": 1,
				"body": "区块链技术还有很长的路要走，现在只是炒作未来十年的预期，而匿名性刚好为操控市场提供了后路",
				"added": 1520349882
			}
		],
		"1_13LgyiqmkzXKzC9BJYxKfNxExbPah44dF1": [
			{
				"comment_id": 2,
				"body": "> [20001](#comment_11_1HtaQobG5GSEwnUcKUGDTZ9bVF8sKKfH5F): 短信算是有据可循的吧，并不可靠。是否存在一种绝对安全的方式，唯一又不会丢失。我是谁，谁有是我，我是不是唯一的\n\n基因绝对唯一，哈哈",
				"added": 1520349963
			},
			{
				"comment_id": 3,
				"body": "> [20001](#comment_13_1HtaQobG5GSEwnUcKUGDTZ9bVF8sKKfH5F): 假设我掌握了你的手机，假设我就是运营商，你这个方式还会有用吗\n手机只是我举例而已，本系统还有更多验证方式，生物识别类的为主，而且验证能力可以根据技术而进化",
				"added": 1520388975
			}
		],
		"1_1CV1zQjkdRKBd9NNXBpVELvzXDp7puzUmX": [
			{
				"comment_id": 4,
				"body": "> [booma](#comment_15_1Lamw1Fk5CrdjwLNPfkDBJH8C2znRuCcBL): 这些在西方国家已经有成功市场化经验了。每一项实验成功，就发动革命将该职能从政府职能中剥离，最终就能实现无政府资本主义\n\n说到点子上了，需要一个过程，step by step",
				"added": 1520391322
			}
		],
		"1_14BL9jNfFXAV821beMvgQWJqRumoX9C15t": [
			{
				"comment_id": 5,
				"body": "这样下去文革2.0必然的",
				"added": 1520931204
			}
		],
		"1_1Ktpupt6fQP4sWYv5ZzYuwTW8drzqUL8Nm": [
			{
				"comment_id": 6,
				"body": "如果这样，天朝会把Firefox也墙掉！",
				"added": 1520954361
			}
		],
		"115_1DcMmKhgdfkR1GDA6zhWhoFRreaej4wLmW": [
			{
				"comment_id": 7,
				"body": "> [zerocatty](#comment_333_1DcMmKhgdfkR1GDA6zhWhoFRreaej4wLmW): 没有军方背景吧：） 好像就老总部队当过兵？\n\n美国政府都调查过了，华为军方背景不容置疑",
				"added": 1520954677
			}
		],
		"10_133isGmcrRR5LNGVmCPrEWjWC287AWDQb2": [
			{
				"comment_id": 8,
				"body": "丢人现眼的党国，中国的耻辱，希望特朗普明察狠狠的扫清全美媒体孽障！！",
				"added": 1521118447
			}
		],
		"170_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 9,
				"body": "我相信这事绝对是共匪所为，我也有类似经历，说明你已经被特务盯上了，注意啊",
				"added": 1521867488
			}
		],
		"1_1DonHALGF9orFFoZ4cZiBHAx4Rgogojryx": [
			{
				"comment_id": 10,
				"body": "联想正版电脑已经装了，不全盘格式化后重装系统不能连外网",
				"added": 1521872217
			}
		],
		"307_157kFKiaEbRUds2HCBUpv33t4Unezi6dR6": [
			{
				"comment_id": 11,
				"body": "扯淡，比特币开源的，没有后门，如果有，那是你硬件中毒",
				"added": 1521961369
			}
		],
		"187_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 12,
				"body": "我也一直认为东西方差异在于逻辑思维能力，但是为什么就没人敢从学术方面去求证？",
				"added": 1523013881
			}
		],
		"3_13LgyiqmkzXKzC9BJYxKfNxExbPah44dF1": [
			{
				"comment_id": 13,
				"body": "川普是一个说到做到的总统，他的人生经历办事都是雷厉风行，这次贸易战我认为是玩真的，洗净屏这个民粹垃圾不惜牺牲经济利益鼓动sb五毛仇视美国，好戏才刚刚开始，压轴好戏还在后面，拭目以待……",
				"added": 1523250086
			},
			{
				"comment_id": 14,
				"body": "结局会像印度边境修路冲突那样，表面强硬背后服软，路不修了",
				"added": 1523255931
			},
			{
				"comment_id": 15,
				"body": "中朝俄将结盟为邪恶轴心报团取暖对抗美国，川普会和北约国一致制裁那三个邪恶帝国，走到这一步就是中国经济衰落至少二十年，俄朝尚能自给自足，而中国就不行，粮食缺口与劳动力过剩危机一触即发！",
				"added": 1523263033
			},
			{
				"comment_id": 16,
				"body": "川普刚刚武力打击了叙利亚，俄罗斯连夜逃跑，预计叙利亚将成为下一个伊拉克，但美国会汲取教训不会在打巷战，避免伤亡太多",
				"added": 1523683597
			},
			{
				"comment_id": 18,
				"body": "叙利亚完全不敢抵抗，中国贸易战节节败退，普京已经颓废，这个世界唯独川普，如果金胖子和美国谈妥，中国将彻底崩溃，历史重新洗牌，好期待！！",
				"added": 1524131741
			},
			{
				"comment_id": 21,
				"body": "海内外很多评论说贸易战不会持续，只有我坚持原有意见不变，同时预测中朝俄结盟抗美，现在普及也准备回见金正恩了，事态依然在按照我两个月前的预测走。\n现在全球经济增长边际递减，道指也涨不动了，预计还有半年的震荡期，大宗商品会来一波牛市。",
				"added": 1527824053
			},
			{
				"comment_id": 22,
				"body": "美国人要的是切实的经济利益，共匪要的只是面子而已，又一个甲午条约！",
				"added": 1527924188
			},
			{
				"comment_id": 23,
				"body": "香港问题大陆不是处理问题，而是激化矛盾，做空hsi，至少还要跌30%",
				"added": 1566188275
			},
			{
				"comment_id": 24,
				"body": "共匪不惜牺牲全体中国人经济利益打贸易战，就像当年朝鲜战争不怕死人一样，而美国人讲人权不能牺牲损伤公民利益做代价打贸易战，这是共匪敢于不怕美国极限施压继续加税的原因，那么美国下一步会采取什么策略呢？军事联盟台湾与越南菲律宾印度等有领土纷争的国家，同时人权问题给予香港市民充分支持，中国的废铁武器根本不敢打仗，美国太空司令部半个小时就轰炸完所有中国所有大型军事基地！",
				"added": 1567233473
			},
			{
				"comment_id": 25,
				"body": "不出所料哈哈\nbreak news：\n南海:美国东盟启动前所未有的联合军演 挑战中国",
				"added": 1567434548
			},
			{
				"comment_id": 26,
				"body": "美国能打的牌还很多，香港人权，新疆人权，台湾军售，把中共列为超越塔利班的恐怖组织，新世贸协议排除中国\n中国能打的牌很少: 朝鲜核武、伊朗搅局、干预美国大选、大撒币外交（外储即将耗尽）、打击美国农民（物价飞涨，民怨沸腾，天下苦秦久矣）",
				"added": 1569551872
			},
			{
				"comment_id": 27,
				"body": "贸易战一年多，美国股市上涨30%，中国股市下跌30%，美国失业率十年最低，显而易见美国已经赢了，川普应该见好就收，不然中国会闹大饥荒的。\n香港是革命火种，星星之火可以燎原，紧急法会让香港更加火上添油，世界纪录的游行示威人数200w会增加到300w。\n港股还要跌，继续做空。",
				"added": 1570276930
			},
			{
				"comment_id": 29,
				"body": "covid19让中国经济雪上加霜，强推复工会导致更大规模感染，根本不存在特效药与疫苗，至少需要一年后，这种病毒感染人数80%通过气溶胶，写字楼上班绝对会中招，口罩防止不了气溶胶，深圳即将成为第二个武汉，但深圳死人不会像武汉那么多，因为打工仔主要群体是年轻人，自愈能力强。",
				"added": 1582344499
			},
			{
				"comment_id": 30,
				"body": "股市国家通过印钞就可以拉起来，现在更简单，不需要印刷机，直接在后台增加几万亿游戏币就行了，这将导致人民币汇率跌去30%，物价上涨500%！",
				"added": 1582344748
			},
			{
				"comment_id": 31,
				"body": "全球60%的人将感染，直接死亡预计一千万，间接2千万。势必导致八国联军讨伐，庚子赔款到底会不会赔偿？\nwolves say：NO!\n那么将导致冷战升级，预计明年印度会在边界搞事情充当马前卒。",
				"added": 1585578020
			}
		],
		"178_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 17,
				"body": "联想电脑正版系统就有spy功能，华为手机你懂的",
				"added": 1523683834
			}
		],
		"256_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 19,
				"body": "用现代金融科技来反共，思路不错，但毕竟国人多傻逼，不会使用这种高级工具，还是拼刺刀更有群众基础",
				"added": 1525598885
			}
		],
		"221_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 20,
				"body": "[mrc](#comment_139_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC): 有网友提议，目前最实用的一个应用场景就是购买翻墙工具的费用结算，用虚拟货币结算非常便利，不需要信用卡、Paypal，免除了与银行绑定的实名信息泄露的风险，会有大量的人入手该虚拟货币的。\n\n市面上已经有区块链技术的vpn，ip.sx",
				"added": 1525599471
			}
		],
		"21_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 28,
				"body": "包子是终结者，狗党江山将毁在他手上哈哈",
				"added": 1570277318
			}
		],
		"1_1HpSHmnQ3cp4oP3hRQsqr1f4U5T7ZL29zK": [
			{
				"comment_id": 32,
				"body": "打死，哈哈，接地气！",
				"added": 1602130777
			},
			{
				"comment_id": 33,
				"body": "> [nowyouseeme0](#comment_16_16GNhidEK4SmyQsj5J12NwLo2yi8Q7JX1r): 亲自那条真是极限生草，看来亲自是熊的专利（滑稽\n\n亲爱的毛爷爷邓爷爷习禁评",
				"added": 1602138124
			}
		]
	},
	"comment_vote": {
		"11_1MjPwf8rny4nfDKNGbgNvmGrcfsAQsKJe2": 1,
		"8_1CoMVWZDiGBYRBfViuCs3d5ECGhP9zaSuw": 1,
		"184_12Ugp53jiMdvj1Kxa1w7c2LcXUBdGPs1oK": 1,
		"3_15qhvwmmwmXwUCqkjQNKnH8HU8deBQGhGZ": 1,
		"6_13LgyiqmkzXKzC9BJYxKfNxExbPah44dF1": 1,
		"132_157d61UG24B66Yw2qwEQWY7yFAWp1HoAST": 1,
		"225_1M6V4wECbz5e1aUmuij2BB72ensHCYNFmd": 1,
		"23_13LgyiqmkzXKzC9BJYxKfNxExbPah44dF1": 1,
		"22_13LgyiqmkzXKzC9BJYxKfNxExbPah44dF1": 1,
		"10_1JRYCe7ZmABZF7Bak4tA9QzdYoY8z1t1oY": 1,
		"24_13LgyiqmkzXKzC9BJYxKfNxExbPah44dF1": 1,
		"19_1JRYCe7ZmABZF7Bak4tA9QzdYoY8z1t1oY": 1,
		"1_1B79Fbfe17UuVMv6BYPWzhuzkaPkdDuFKh": 1,
		"73_12e4EcUWaMHVa31rkuzWWxstByasqAp7RV": 1,
		"75_12e4EcUWaMHVa31rkuzWWxstByasqAp7RV": 1,
		"2_1C9ms9vQzhcDVAkpHZ6YzX5Se7tb6UCqYF": 1,
		"1_17fk1kQjzSyojQWkvE4eTB4AAEkfVXmbHk": 1,
		"43_1JRYCe7ZmABZF7Bak4tA9QzdYoY8z1t1oY": 1,
		"16_16GNhidEK4SmyQsj5J12NwLo2yi8Q7JX1r": 1
	}
}