{
	"title": "红星\n暗网前哨",
	"description": "中国无产阶级革命中央委员会Zeronet前哨站",
	"links": "- [Source code](https://github.com/HelloZeroNet)\n\n与中革中央取得联系\n\nQQ群\n124370947\n564592716\n\nIS语音频道\n1176435\n\n论坛\nhttp://www.zgzy001.top/\n（随时会被封）\n\n网页语音频道\n（仅限IE浏览器）\nhttp://www.zgzy001.top/liao/",
	"next_post_id": 21,
	"demo": false,
	"modified": 1485359982,
	"post": [
		{
			"post_id": 19,
			"title": "中革中央八号追杀令：",
			"date_published": 1485359258.426,
			"body": "中革中央八号追杀令：\n\n \n\n中国人民一起向跳出来破坏捣乱大革命而制造“1.10反革命事件”的江苏省常熟市服装城派出所警察：薛鹤鸣（职务：警长，警号247606）以及其背后参与人员的家族实施血债血偿清算加惩罚！\n\n　　我们中国无产阶级革命中央委员会从二零一零年七月一日成立起，就向全世界公开宣布了中革中央的总纲（目标）：打倒扶持资产阶级专政体制的资产阶级政府，消灭骑在中国人民头上剥削压迫、作威作福的十大家族，颠覆资本主义国家资产阶级政权，推翻资本主义私有制建立社会主义公有制！并且一而再、再而三警告：谁跳出来破坏捣乱中国人民翻身解放的大革命，谁就是在帮助十大家族压迫剥削中国人民，而这个谁及其配偶的家族就得承担偿还中国人民被资产阶级残酷剥削压迫的血债！也即是：中国人民后代将对这个跳出来的谁及其配偶家族进行血债血偿清算加惩罚！\n---\n而且我们中革中央也一再申明：这场大革命是中国人民打倒假共资产阶级十大家族政府、推翻人吃人的资本主义私有制，军警方面已经宣布并且确实是也做到了整体上保持中立，不参与我们无产阶级革命阵营同资产阶级政府的政治斗争，所以我们中革中央始终没有把军警当作是中国人民的敌人。但是，近来突然跳出了常熟畜生警察薛鹤鸣及其背后的参与人员，明知反对这场大革命将是自己整个家族及其配偶整个家族都被揪出来偿还中国人民被压迫剥削的血债，却还是要挑拨我们中革中央和军警的关系，制造出“1.10反革命事件”：\n\n2017年1月10日上午薛鹤鸣带领四个警察去北风家里拿着“传唤证”把北风同志带走，楼下有三四辆警车，车上很多都是防暴警。此前北风同志也因为在网上宣传革命被派出所警察找过，已跟警察打过几次交道了，前几次的交流沟通警察的态度表现就不怎么好。\n\n薛鹤鸣直接带北风同志进审讯室做一份笔录，笔录内容是：关于2016年11月21日发了内容是“中革中央告全国人民书” 、“血债血偿理论” 、“中国人民血债血偿清算小组招募启事”的三张革命宣传图片。做完笔录签字后，薛鹤鸣拿给他们领导看，一会拿过来一个行政处罚决定书让北风同志签名，北风同志拒绝签名，因为上面故意避开政治问题而污蔑革命者宣传革命理论是：在互联网通过QQ群以散布谣言，煽动群众等方式寻衅滋事，并且要行政拘留7天。北风同志当时对薛鹤鸣说：“你们将要为今天做下的反革命罪行付出代价，你们都是明知故犯。”薛鹤鸣说：“这是派出所的指导员和领导决定要行政处罚，你不签字没关系我们也照样执行。”就这样，北风同志于2017年1月10日-2017年1月17日被强制拘留在常熟市拘留所。\n\n整个事件过程，常熟市服装城派出所薛鹤鸣等一伙人，在明知北风同志是中革中央成员在做革命宣传工作，却故意绕开政治以社会治安管理条例法规为由进行强制拘留，故意制造白色恐怖，影响非常恶劣，对革命造成极大的破坏作用，已经构成严重的反革命事件。\n\n薛鹤鸣自称是共产党员，不但不追求共产主义，还要对真正追求共产主义的革命者北风同志进行拘留打压。他曾给北风同志多次做过笔录，多次听过北风同志对他讲解革命理论，已经明确知道今天中国是资本主义私有制，知道台上执政的是挂羊头卖狗肉的假共产党，知道广大劳动人民正在遭受残酷的剥削压迫，却还要充当假共十大家族资产阶级政府走狗奴才黑打手，继续维护今天这个资本主义私有制。\n\n薛鹤鸣以及参与这事件当中的主要负责领导，属于明知故犯，经过多次接触沟通与讲事实摆道理的辩论，北风同志已阐明革命道理和善意劝告，而他们还要强制拘留北风同志来达到他们以白色恐怖吓唬人民群众不要革命的目的，充分暴露出他们坚定反革命立场，也充分表明他们愚蠢至极敢于拿家族人性命来下这一场大赌注，不相信血债血偿以后历史会兑现，其中薛鹤鸣还说：他的家人和朋友在今天这个资本主义私有制社会里生活得很幸福，中革中央所说的这场革命我这辈子是看不到了。\n\n当然薛鹤鸣仅是一个马前卒，躲在这事件背后的那个最大幕后策划者更为邪恶反动，但凡是牵涉1.10反革命事件当中的如策划、指使、挑唆、决策、下令、传令、看风、执行的等所有参与人员，都脱不了关系，以后必定彻查个水落石出。将来革命胜利后，中国人民将对他们进行血债血偿清算加惩罚，对罪大恶极的反革命分子是家族式的铲平。\n\n反革命分子唯一的出路：要想不被家族式的血债血偿，除非对革命做出巨大贡献，能将功赎罪，将功补过。\n\n　　我们中革中央多年前开始直至今天一再警告：国民党资产阶级四大家族政府时期的警察，凡是对共产主义者做了什么不好的事情，解放后全都被追究了，但由于那时候中国人民还仅是吃一遍苦、受一茬罪，所以那时候的血债血偿仅是针对个人枪毙或把个人拖到街上被人民群众活活打死，而今天假共资产阶级十大家族政府时期的情况就完全不同了，现在的中国人民是吃了二遍苦、受了二茬罪，所以这次的血债血偿将是所有在改革开放资本主义私有制时期被剥削压迫死的中国人民，全都将由其亲戚朋友到跳出来破坏捣乱大革命的人及其配偶家族里找出相同关系的人索命！\n\n　　并且从几年前开始发布追杀家族令起，也一再证实了我们中革中央的提示：任何跳出来破坏捣乱大革命被列入血债血偿名单的人，将被定性为反人民分子的反革命罪犯，全都得不到任何丝毫好处和利益，而仅能坐等自己整个家族及其配偶整个家族被中国人民彻底血债血偿掉。其根源在于：任何和已被列入血债血偿名单的罪犯有联系或靠得近的人全都将可能到时受牵连而被视作同伙！所以没有任何人肯以被灭自己整个家族及其配偶整个家族的代价来帮助、奖励已被列入血债血偿名单的罪犯！\n\n　　薛鹤鸣及其背后的参与畜生明知故犯跳出来破坏中国人民翻身解放大革命的现行犯罪，无非是在公然向全体中国人民明确表达一个意思：中国人民中凡是冤死了父母的人全都该去索其父母的命；中国人民中凡是冤死了儿女的人全都该去索薛鹤鸣及其背后的参与畜生的儿女的命；中国人民中凡是冤死了兄弟姐妹的人全都该去索薛鹤鸣及其背后参与的畜生的兄弟姐妹的命；中国人民中凡是冤死了亲朋好友的人全都该去索薛鹤鸣及其背后参与的畜生亲朋好友的命。\n\n　　所以，中革中央顺应畜生薛鹤鸣及其背后的参与畜生的要实现自己整个家族及其配偶整个家族都被灭的要求和愿望，发布第八个追杀号令：如果中国人民不想再被人骑到头上剥削压迫、作威作福；如果中国人民不想再吃三遍苦、受三茬罪；如果中国人民还有出息、有血性的话，那么就从今天开始对常熟市服装城派出所警察 薛鹤鸣及其背后参与的畜生的父母、儿女、兄弟姐妹和亲朋好友实施血债血偿清算加惩罚的行动吧！并且这是一场绝不能有漏网之鱼的全球性不达目的决不停止的无限时、无止境追杀！\n\n　　此外，基于中革中央是最仁慈、最善良的无产阶级革命者和革命家所组成，因此特此加发劝告：凡曾经是薛鹤鸣及其背后的参与畜生的朋友或者薛鹤鸣及其背后的参与畜生的周围的人，请赶快第一时间远离薛鹤鸣及其背后参与的畜生，与薛鹤鸣及其背后的参与畜生彻底划清界线！否则被视作薛鹤鸣及其背后的参与畜生的亲朋好友而遭到中国人民的血债血偿清算加惩罚，一概是源于你自己不赶快远离薛鹤鸣及其背后的参与畜生所导致的后果，绝对不是我们中革中央没有事前对你发出郑重警告！更绝对不能怪中国人民的仇恨能量如同火山爆发的巨大威力！\n\n中国无产阶级革命中央委员会：中革中央\n二零一七年一月二十五日\n\n备注：北风原名 李玉峰 身份证410482198608061717  手机号13901571816"
		},
		{
			"post_id": 18,
			"title": "《傻瓜般的港独》",
			"date_published": 1476185254.865,
			"body": "一些香港人老是争取香港独立 其实我问问那些要港独的人\n港独后 香港物价会下调吗？\n港独后 你们就找到女朋友吗？\n港独后 你们就能买房了吗？\n港独后 你们就能完全把三合会赶出香港吗？\n港独后 香港和黑恶势力、资产霸权就全部死光了吗？\n港独后 就可以消灭毒品、娼妓、高犯罪率、贫民窟了吗？\n港独后 你们就能做人上人了吗？\n港独后 香港就没有剥削压迫了吗？\n\n有些人可能会说我狭隘 但是 这些狭隘的问题和我们的生活息息相关\n如果港独后 体制还是资本主义 这些问题就依然无法解决\n\n是啊 港独后你们之中的一小撮人是做了人上人 但是还是存在剥削压迫啊\n"
		},
		{
			"post_id": 17,
			"title": "善恶有报是最大的愚民邪说!",
			"date_published": 1472285272.421,
			"body": "善恶有报的理是很可笑的，人间尚且讲“民不举，官不究”，天也是这样，“人不举，天不究”。\n\n比如说，你杀了他爹，他说，冤冤相报何时了，他没有仇恨你的心，你就占便宜吧。你偷了他的钱，他说，这是天意该你得的，他不想着要回去，你就占便宜吧。\n---\n人家都是自愿送给你的，怎么能把恶报强加在你身上呢？\n\n对人做恶事，如果对方自愿接受，就没有恶报。如果对方不反抗，就没有恶报。这才是宇宙真正的理。决不是什么善恶有报。\n\n“善有善报，恶有恶报，不是不报，时候未到。”\n\n　　什么狗屁言论，事实是，在这几千年的私有制社会历史里，基本是“善有恶报，恶有善报”，恶事做尽的成吉思汗康熙乾隆现在都被捧为英雄圣君啊。普通劳动人民，绝大多数也没做过什么大奸大恶之事，得到的报偿不过是绝大多数做一辈子牛马。没人给你记录你的行为是善还是恶。没人记得或忘记了你做的事是善还是恶，愚蠢胆怯之人害怕或自我安慰冤冤相报何时了，不懂感恩之人不会感激你的善助，更不要说报偿你的善助，当然不会有什么恶报善报。\n\n伊斯兰教的古兰经公开号召信徒：你们要讨伐敌人，主将通过你们的手惩罚他们，战胜敌人，羞辱他们，以抚慰你们心灵的创伤。所以，穆斯林的强悍来源于其宗教的精神力量。所以，假共喜欢用佛教，基督教忽悠欺骗愚弄人民，却从不会用伊斯兰教来忽悠，也就毫不奇怪了。伊斯兰教是鼓励穆斯林直接动手惩罚敌人的，而不是像佛教等忽悠人民恶人会有恶报的，恶人会下地狱受惩罚的。事实上，人民要不起来动手惩罚各种禽兽，各种禽兽是安然无恙，而且会更加猖狂无比的。善恶有报是最大的愚民谎言邪说！至于恶棍下地狱受到惩罚了，更是天大的笑话。如果今后有脑残或畜生这么说，就应该让它们先下地狱去看看自古以来的畜生是否在地狱里受惩罚呢!还有糊涂虫和畜生说，恶人自有恶人磨，真是更可笑的忽悠和自我欺骗。恶棍之间的狗咬狗和普通人民有什么关系，它们谁胜利了也不会善待民众的，假共之间的狗咬狗就是这样，无论哪派狗赢了，普通人也是被剥削压迫的。穆斯林是直接动手送敌人下地狱的。普京说过，受到攻击第一时间就应该反击，二十分钟可以毁灭日本，所以，我们看到日本人在俄国面前很乖。所以，假共不敢到国外去欺压残害外国人，是因为它们马上就会受到外国人的疯狂报复，报应马上立刻就到，这就是原因！所以，企图指望恶棍下地狱受惩罚是荒唐可笑的，是自欺欺人的自我心理安慰罢了，对付人渣畜生禽兽应该马上立刻直接送它们下地狱才是最有效果的！\n\n欺骗教育别人不要相信世界有阴谋的，他就是阴谋的设计者或得利者。而阴谋的设计者，为了不被人识破，就诋毁别人为“阴谋论者”，“心理阴暗”。其实，恰恰心理最阴暗的是这样说的人啊！他们之所以这样说，是为了他们的阴谋不被识破曝光。\n\n老子教导说人心险恶，天地不仁，不注意识破阴谋，就等着掉陷阱被捕杀吧。认为世界上没有阴谋的人，精神不正常，认为世界上全是阴谋的人，精神也不正常，我们要同时看到世界光明和阴暗的两面，这是一个辩证统一的问题。欺骗教育别人不要相信世界有阴谋的，他就是阴谋的设计者或得利者。\n\n老子的教导：天地不仁，人间险恶，人心唯危！不是人性本善！儒教里讲什么“人之初，性本善”，其实，这完全是欺世谎言，是为奴化教育而宣扬的邪说。是凡相信这个的，基本都是人尽可欺的小绵羊，只能被杀了吃肉。\n\n以上是转载的文章，略作改动和添加了一些内容，要真做到恶有恶报，得被残害欺压的人自己起来讨还血债，否则恶有恶报就是一句屁话。在私有制社会，各种脑残或畜生会忽悠人民，法律是公正的，会为你做主的，要相信法律，呵呵。他们不懂或故意愚弄普通人民，相信或忽悠禽兽制定的法律能保护人民，能严酷惩罚罪犯，那不过是幻想。老子的智慧远超孔子，或者说孔子的骗术高超，而老子确实是警醒世人的大善人!\n\n有人说祖辈里犯的罪与其子孙无关，祖辈里赚的钱，后辈可以继承，怎么祖辈里犯的罪，就与后辈无关了呢？子孙无辜说，只是现代人现代社会一个变异的观念而已，但是，它们却要把这个观念强加给所有的人，非常的蛮横霸道。——这是网上看到的一段话，一般的刑事案件可能跟子孙后代无关。但贪官污吏贪的钱不都是自己花，自己的子女都花，所以，说子女是无辜的简直太愚蠢可笑可恨可恶了 。不说贪官，就说反革命，也不仅是为了自己的私欲反革命，还不是为了自己家族后代享受永远的做人上人的禽兽罪恶欲望！"
		},
		{
			"post_id": 16,
			"title": "试谈政能量",
			"date_published": 1466754734.392,
			"body": "　　目前，假共讲“正能量”呢，我们才是正能量！尤其真共党员同志，理论水平高，思想觉悟高，革命能力强。真共党员都是火眼金睛，只要假共这条狐狸翘翘尾巴，一下就能把它揪出来；他们的御用文人---假左，无论怎样包装，真共党员、都能透过他们身上精美的画皮看到他们的原形。有了这样的正能量，我们革命才有了足够的信心。有了这样的正能量，再看看今天的假共是否还有正能量？\n---\n　　抢人民的土地，卖给开发商，用高得离谱的房价，把人民变成房奴 ；抢人民本来免费的大中院校，用高学费把人民子弟变成学奴；抢人民本来免费的公共卫生事业，用高医疗费把人民逼得看不起病；抢夺工人赖以生存的工厂，让工人失业；抢农民的住宅土地，把农民逼进城做农民工......黑社会、贫民窟、黄、赌、毒......坑蒙拐骗加抢偷......多少腐败分子，多少金融漏洞，多少烂尾楼，多少鬼城，多少自杀，多少他杀，多少人生活在水深火热之中？这些都是假共制造的“正能量”吧？其实假共的“正能量”多得很，谁能举得完，谁能数得清？\n　　假共的“正能量”不仅多，而且大，抓捕革命者，真共党员也算他们的“正能量”吧？面对假共这又大又多的“正能量”，我们的革命者怎么办呢？只好做“愚公”吧？愚公是开山辟路的先锋，是真正的正能量！不要担心会累死，只要我们坚持挖山不止，就一定会感动上帝的。这个上帝就是全中国受剥削、受压迫的劳动人民。总有一天全国人民会觉醒，会和我们一起挖掉假共这座罪恶累累的大山的。因为我们代表人民的利益，遵循历史发展的客观规律，我们才是真正的正能量！有了我们真共党---马列主义，毛泽东思想，周群理论武装起来的中国真共党----这个正能量，一定能战胜假共的一切所谓的“正能量”！同志们，加油！"
		},
		{
			"post_id": 15,
			"title": "中革中央：人民军警不能和人民群众自相残杀，让十大家族看笑话",
			"date_published": 1465815735.337,
			"body": "作者：雷鸣听雨\n\n我们中革中央存在的意义在于，运用革命理论引导有深仇大恨的人民群众把血债血偿的能量，\n发泄到应该发泄的官僚买办资产阶级十大家族身上，而不是让普通人民军警背黑锅，受牵连，\n导致人民军警和人民群众互相对立、自相残杀。而这恰恰是假共当局的一个罪恶目的。\n\n---\n\n人民军警应该站在人民立场上为人民服务，而不是站在资产阶级立场上，维护官僚买办资产阶级十大家族的反动统治。\n谁能真正代表人民群众的利益，人民军警就应当听命于谁。中革中央始终站在人民群众立场上，以有益于人民的是好，有害于人民的是坏这个标准，制定出\n\n明确的革命目标和革命步骤，是当前中国唯一能真正实现和保障人民群众利益的革命组织。\n我们中革中央是人民军警的真正上级，我们在引导人民军警和人民群众团结起来，推翻假共十大家族的罪恶统治。\n\n中革中央中国真共产党，向全国各地的人民军警发出号召，高举马列毛主义的革命大旗，以周群思想为指导，坚决听命于中革中央的正确\n\n领导，自觉维护人民群众利益，为无产阶级革命事业再添新功。\n中革中央、中国真共产党对全国各地人民军警的两点要求是，真正站在人民立场上维护好人民群众的利益，为革命保重自己的身体。"
		},
		{
			"post_id": 14,
			"title": "[通报事件与评论]湖北维权上访计生干部：我们成了弃子和路人",
			"date_published": 1464787912.266,
			"body": "　　不满于政府“卸磨杀驴”，5月23日早晨8点半，他和三十多名同行坐在县卫计局大楼的门前，拉开横幅，要求维权。2天后，他们得到了一个“正在处理”的回答。 \n---\n　　“我们成了弃子和路人。”李平（化名）说。他是一名湖北省荆州公安县乡镇计划生育服务中心主任，也是5月23日公安县计生工作者维权事件的当事人之一。 \n\n　   5月23日，两条湖北公安县计划生育工作人员维权的微博在网上引起争议。在微博账号@王小贱1108发布的照片中，约30名计生工作人员坐在公安县计划生育局办公楼的台阶上，拉出两条红色横幅：“落实中央政策，保我应有待遇。”“稳定计生队伍，还我应有身份。”在照片之上，@王小贱1108写道：“为这份工作付出了汗水、泪水，甚至鲜血，最美好的青春奉献给了这份工作，得到的却是冰冷的1950。求转发，谢谢！” \n\n　　微博帐号@大卫小乔_188也发表了维权微博：“18岁进入这条战线，当时动员我们做这项天下第一难工作时，说对计生工作干部要高看一眼，厚爱一层，现在公安县党委政府就是这样‘高看、厚爱’！计划生育依然是基本国策，计生队伍却生计艰难，改革的初衷是提高工作效率，调动工作热情，更好的服务人民，现在这只队伍已寒心绝望，如何能为人民服务？” \n\n　　 两条维权微博并没有如愿得到同情和支持，而是嘲讽和斥责。很多网友认为，这些计生人员得此下场是“活该”、“罪有应得”、“恶有恶报”。网友@爱晓汐说：“被你们亲手杀死的婴儿都没找你们理论呢。”而网友@盛夏月未眠表示：“这支队伍何时为人民服务过？寄生虫一样吸血。”随后，两条微博被删除。 \n\n　   让这些计生干部走上维权之路的原因是编制和待遇--自2006年公安县乡镇机构改革后，他们的事业编制被取消，工资待遇十年内从1200元只涨到1950元，而从2015年开始，社会抚养费不再按比例返还乡镇。 \n\n　　据微信公众号“呦呦与子衿”报道，公安县计生局一位局长提到，此前“为了调动乡镇计生干部工作的积极性”，社会抚养费会按照一定比例给予“返还”乡镇，但从2015年起，返还机制取消，“他们现在一分钱也拿不到”，一定程度上影响了计生干部的收入，让他们“心理有些不平衡”。 \n\n　　“二孩政策”的出台，让全国百万计生工作人员尴尬于自身处境，这个与计划生育政策共生的群体面临未卜的命运。人口学家易富贤在接受媒体采访时称，如果低调一些，这些计生人员的安置并不是一个问题：“今后那么多老无所养者（包括部分失独家庭），是需要社会服务的。但是国家卫计委现在还在高调宣传计划生育的正确性，说为中国发展作出了贡献。那么计生人员就是功臣了，功臣就不肯放下身段来从事那些服务工作。” \n\n　　 李平今年54岁，在计生岗位上干了29年。在44岁那年，按照他的说法，是从“干部身份沦为‘社会人’”，拿着不到两千的工资，要养活一家人。不满于政府“卸磨杀驴”，5月23日早晨8点半，他和三十多名同行坐在县卫计局大楼的门前，拉开横幅，要求维权。2天后，他们得到了一个“正在处理”的回答。 \n\n　   在言语中，你仍能感觉到他对计生工作的自豪感。他会经常提到“为党和国家奉献一生”，以数据说明计生为国家控制了多少人口，然后诘问“为什么我们只能落得如此下场？”而当凤凰网问他关于网上的骂名和强制引产时，他依旧表现出一种集体主义的崇高感：“我们当时是为了工作。” \n\n　　李平觉得后悔，有苦说不出，并让在一家技术学院当老师的女儿远离自己的这条老路。“我跟子女说，如果你当老师不行，选择经商都可以，每年招考公务员，一概不参加，不搞这些事了。这个变化，这个风险，太难以预料了。” \n\n相关链接：http://mt.sohu.com/20160527/n451864553.shtml?qq-pf-to=pcqq.group\nhttps://www.tuo8.space/thread-68683-1-1.html\nhttp://tieba.baidu.com/p/4577621176\nhttp://weibo.com/5708932403/DxqK ... t#_rnd1464676314499\nhttp://lt.cjdby.net/thread-2233369-1-1.html\n\n\n`中革中央人士评论：畜生就是不知道羞耻和自己的罪孽深重，把扼杀婴儿叫做为人民服务！这些畜生家族都被根绝也偿还不了自己的无边罪孽！！！中国的绝大多数畜生就是这样，对人民群众是疯狗野兽，面对更强大的暴力团伙，就剩下狗性了。假共把这些垃圾当弃子，这些畜生把当初对付人民群众那股威风劲使出来对付假共啊，还上什么访啊，呵呵！网上有评论讲得很好，当狗就要有当狗的觉悟！兔死狗烹的结局自己不了解吗，呵呵！畜生不给自己留后路，甭指望人民给你们后路! 就因为待遇降低点，就不满了，假共就是让你们滚，你们这些狗能掀起多大风浪啊，呵呵！奉劝全国各地的军警，还有假共各类公务员：残害、镇压人民群众绝不是为人民服务，甭管打着什么崇高的幌子也欺骗不了人的。人口老龄化，已经说明计划生育是完全错误的，甭以功臣自居，太可笑了！看看欺压残害人民群众的畜生的下场吧，好自为之！`"
		},
		{
			"post_id": 13,
			"title": "论假共产党“一国两制”口号的欺骗性",
			"date_published": 1463392378.412,
			"body": "所谓“一国两制”，只不过是假共产党资产阶级十大家族政府用来欺骗内地和港丶澳丶台老百姓的口号，实际上是从来没有存在“一国两制”。\n---\n　　马列毛主义鲜明地指出：国家是阶级不可调和的产物，它是一个阶级用来镇压另一个阶级的暴力工具。国家和制度是彼此不能分开，如果说这个国家是由资产阶级控制的话，这个国家的社会形态必须是实行资本主义私有制，资产阶级才能有根据地实现自身霸占生产资料（资源丶工厂丶生产机器是可用於生产和再生产的东西才能称得上属於生产资料）剥削无产阶级来作威作福，否则资产阶级所控制国家没有实行所属社会形态，资产阶级控制国家便没有存在的意义，也不可能霸占生产资料剥削无产阶级来作威作福。\n\n　　还有，社会主义公有制是由无产阶级共同拥有生产资料的社会形态，社会主义公有制和资本主义私有制在根本上是不同的制度，而且两者是对立的，霸占生产资料剥削无产阶级来作威作福的资产阶级，会容许自己控制的国家存在了与其利益和立场对立的社会主义公有制吗？然而，假共产党自称以马列毛主义作为指导思想，但其却把国家的阶级性丶路线性去掉，以公民的概念取代，并提出所谓 “一国两制”口号欺骗老百姓，这完全证明了假共产党是打着马列毛主义反马列毛主义的反革命丶反人民的政党。\n\n　　内地在1976年被走资派利用华国峰发动政变倒退覆辟了资本主义私有制，走资派也进一步脱变为假共产党资产阶级，这样说内地在1976年後和香港一样都是资本主义私有制社会，只不过假共产党资产阶级政府打着社会主义公有制旗号来欺骗老百姓。无论，假共产党资产阶级政府是如何打着社会主义公有制旗号来欺骗老百姓，都始终掩盖不了内地是资本主义私有制社会的事实。因此，假共产党资产阶级政府说内地和香港是实行不同制度，完全是骗人的鬼话。\n\n　　但是，资产阶级不断透过教育和传媒方面来对老百姓思想进行欺骗和愚弄，把什麽东西是好还是坏都搞乱和歪曲，造成很多老百姓对政治理论（特别是马列毛主义理论）不理解丶甚至错误理解。由於，老百姓很多是不懂政治理论，不知道社会主义公有制和资本主义私有制的根本区别，分不清真假社会主义（特别是1976年的前後的分别），很多老百姓也因而受假共产党资产阶级政府欺骗，错误以为内地和香港是实行不同制度。\n\n　　“一国两制”，除了是一个欺骗老百姓口号外，它也是假共产党资产阶级政府用来转移矛盾的工具。只要经济出现问题，假共产党资产阶级政府一方面动用五毛利用“一国两制”做一些维护国家主权的舆论，另一方面动用小右利用“一国两制”做一些维护民主自由的舆论，一唱一和地愚弄老百姓并转而老百姓视线，目的是挑拨老百姓斗老百姓。只要留意2003年发生的“23条基本法”争议事件丶2010年发生的“政制改革”争议事件，还有现在发生另一场的“政制改革”争议事件，小右和五毛都是一唱一和地透过制造这些事件搬出“一国两制”存亡问题来做一做舆论，这些事件也是在经济危机期间出现，难道是巧合吗？\n\n　　如果，老百姓不醒觉起来掌握马列毛主义周群思想革命理论，把争取什麽普选作为斗争目标，被压迫状况不单没有得到真正的解决，更会轻易地遭受假共产党资产阶级政府的打压，吃了沉重的血腥苦头和教训，六四是一个很鲜明例子。老百姓唯有醒觉起来掌握马列毛主义周群思想革命理论，把推翻资本主义私有制丶建立社会主义公有制作为斗争目标，老百姓才会有光明出路。"
		},
		{
			"post_id": 12,
			"title": "试论吃穿住------学习周群理论，思考一点问",
			"date_published": 1463392222.879,
			"body": "　　我在宣传马列主义、毛泽东思想、周群革命理论的时候，常常遇到激烈的发对。说什么：“现在吃得好、穿得好、住得好。不愿意回到过去的穿补丁衣、吃面条馒头、住大杂院 的生活中去。”一句话，不愿意回归毛泽东时代的社会主义。\n---\n　　我向他们解释：“不能这样比，要是按照毛主席的路线都到今天，中国人民的生活不知道要比现在好多少倍！”无奈现在还有很多人昏睡不醒，或者装睡不醒。他们就不想想毛泽东时代的社会主义是在一片战争的废墟上建立起来的，基础薄弱，生活水平需要不断提高，需要时间发展。而那时已经提高的很快、发展的很快了。\n　　那时夫妻两人上班，就能养活一群孩子，一般四、五个吧，甚至还有更多的，也有不少家庭只有男人一人上班，就能养活一群孩子的，而且上得起学，看得起病。时间又过去了三十多年，一对夫妻加班加点的上班，却连一个孩子也养不起了，交不起学费，上不起学。辍学的，贷款的，难道不是事实吗？\n　　再说吃得好吧，毒奶粉---大头婴儿---大有死亡者；苏丹红、瘦肉精、转基因、各种各样的添加剂，各种各样的毒药，各种各样的疾病，莫名其妙的死亡......难道这是吃得好吗？古人说“民以食为天，食以安为先”吃出病，吃死亡的食物，怎能说吃得好呢？毛泽东时代的社会主义有这样的悲剧吗？毛泽东时代谁敢制造这样的悲剧？但是今天，有多少谋钱谋利的人明目张胆地一而再、再而三地制造毒食品，制造致残致死的悲剧呢？当你为今日美食大快朵颐的时候，你是否恐惧过，谁知盘中餐，粒粒皆有毒？是否思考过这样的问题：到底哪个时代吃得好？\n　　再说穿的吧，毛泽东时代，我们穿的大多是纯棉布，虽然打了补丁，但不会起静电、不会过敏。现在是不穿补丁衣服了，但穿起静电、甚至过敏的衣服。我并不反对穿化纤衣服，但总要排除对人体有害的化纤吧？当你说今天穿的好时，是否思考过，要是按照毛泽东思想发展到现在，会穿得更安全，更放心、更漂亮呢？\n　　再说住得好吧，由大杂院乔迁到单元房了，富人还住别墅了，但是你真得住得舒服吗？这时你是否遇到或者思考过：多少住房缺少阳光，缺少新鲜空气，甚至常常被雾霾环绕，昏暗、尘埃就差让人窒息了。我多想逃离这样的居住环境，逃到青山绿水的小村庄去，无奈还没条件逃！谁觉得住在雾霾环绕，尘埃昏暗，离不开防盗门的楼房好，就让谁去住吧，能逃我一定逃.......\n　　说了吃、穿、住，其实和人们生活密切相关的还有一个“行”呢！现在的出行快捷，马路多车多，四通八达，看起来是好事，但是，当你不得不开车，或者乘车上班时，可曾想过，要是住在工厂附近，不用乘车该多好！上班不乘车，上学不乘车，在毛泽东时代大多都是这样合理安排的。但今天很多很多人可望不可求了!不仅不得不跑很远的路去上班，上学，而且还有种种的不安全，失联、失踪时有发生......\n\n　　总之现在的社会，衣食住行到底好不好，认真思考吧，正确认识了。不能再昏睡不醒了，更不能装睡不醒了。受苦受难的中国人醒来吧，战斗吧，改天换地吧，改善我们的生活吧！"
		},
		{
			"post_id": 11,
			"title": "不掌握理论的后果+最惨人物评选 #01",
			"date_published": 1463389215.912,
			"body": "没掌握革命理论的香港参与占中男子受不住压力而跳楼自杀\n---\n　　李国亮点评：香港的占领中环（或後来称的“雨伞运动”）不是革命，而是一场由假共资产阶级十大家族政府动用走狗奴才小右民运所做的自编自导的戏，这一场戏早已在2013年初策划，目的是要把主要矛盾（无产阶级与资产阶级的斗争丶社会主义公有制与资本主义私有制的斗争）转移到次要矛盾（普选权争议等等问题），维护假共资产阶级十大家族政府对老百姓作威作福的统治。\n\n　　然而，老百姓受到资产阶级的剥削压迫，当中有老百姓不懂革命理论，不明白其自身被剥削压迫是源於资本主义私有制，不明白推翻资本主义私有制丶建立社会主义公有制才是解决剥削压迫的唯一出路，反而走去向资产阶级政府争取改良来改善剥削压迫的生活，这无疑是死路一条。\n\n　　小右民运以“争取公民提名”欺骗了不懂革命理论的老百姓，使老百姓误以为“争取公民提名”便能改善剥削压迫的生活并能拥有真正民主权利，被小右民运骗到参与所谓占领中环（或後来称的“雨伞运动”）行动，有部分参与其中的老百姓被警察拘捕并安排到法庭审判，不明白资本主义私有制法律是维护资产阶级政府的专政工具之馀，更反而试图透过所谓法律向资产阶级政府进行讨价还价，资产阶级政府则把这些讨价还价的老百姓当作蚂蚁般那样玩弄，这名参与占中男子受不住压力而跳楼自杀就是资产阶级政府对不懂革命理论的老百姓进行玩弄的一个鲜明例子。\n\n\n新闻内容：\n\n涉占旺失业汉 审前跳楼亡\n[2015.05.07] 发表\n\n\n【明报专讯】失业青年被指於去年10月在占旺区的警方防线前「揈手揈脚【书面语译：摇手摇脚】」，他早前否认一项阻差办公罪，原定昨晨开审，但辩方指青年於本周一跳楼身亡。裁判官将案件押後至本月底进一步处理，并批评警方准备起诉书不当，冀他们日後能进步，不要浪费法庭时间。\n\n被控防线前揈手脚\n\n报称装修工人的失业青年李俊权(31岁)，於今年3月31日否认控罪一项阻差办公罪。控罪指李於去年10月17日，在旺角弥敦道近亚皆老街，故意阻挠在正当执行职务的警长曾铭贤。李涉於案发当日在警方防线前「揈手揈脚【书面语译：摇手摇脚】」。\n\n案件原排期於昨日在观塘裁判法院开审。辩方在庭上向裁判官陈炳宙表示，李於本周一跳楼身亡，当日他曾与李就本案审讯召开会议。陈官闻言便问辩方，李是否在会议结束後跳楼，辩方回应指不清楚李的确实死亡时间，但李父前日亲身到法院，告知当值律师服务的职员有关李已身亡的消息。辩方形容李父年纪老迈，当日撑着拐杖到庭。\n\n控方指出，一名男子於本周一即5月4日的下午约5时30分，疑与家人争执後从住所厨房的窗户跳下，男子的尸体在初步调查下与李吻合，但其身分需再进一步确认，尸体或需解剖，律政司同时需时考虑撤控一事。陈官将案件押後至本月27日再讯。\n\n官斥警方控罪书不知所谓\n\n陈官随即翻阅案中文件，批评警方为本案准备的控罪书「不知所谓」，控罪书的中英文版本格式不符，法庭或会浪费很多时间处理修订，令控辩两方需押後处理案件，故希望警方未来能够进步，不要浪费法庭时间。据悉，中文版本的控罪书上，案发地点为「旺角弥敦道近亚皆老街」，陈官对控罪书未有在「旺角」前加上「在香港」一字感到不满；英文版本的控罪书上的案发地点亦没有提及「在香港」。\n\n据了解，李於本周一下午由住所堕下至牛头角上邨常满楼平台，由其兄报案。李昏迷送往联合医院後证实死亡，警方未有在现场检获遗书，初步调查显示事件没有可疑。\n\n父否认与子吵架 不知寻死原因\n\n记者昨到访李俊权报称住址，其父李伯应门，但称他们一家为人低调，不愿多回应。问及李俊权寻死与案件是否有关，李伯称，「边个有官非都唔开心【书面语译：谁人有官非都不开心】」，但无法估计儿子寻死是否与压力有关，「点知啫，我又唔系当事人，(儿子)三十几岁人，(我)无问过【书面语译：怎知道，我不是当事人，（儿子）三十几岁人，（我）没问过】」。行动不便丶出入需用拐杖的李伯称，「佢(儿子)都咁大个，几十岁人，我点管到佢呀？【书面语译：他（儿子）都那麽大了，几十岁人，我怎管到他啊？】」问到他以往与儿子的关系如何，李伯仅称：「之前系之前，过咗去算啦【书面语译：之前是之前，过了去算了】」，至於儿子是否一句不发就走了，李伯突指「呢个世界系咁，无钱就无人理㗎啦【书面语译：这个世界是这样，没钱就没人理会了】」，但未有说明所指是什麽，他否认儿子死前有跟他吵架，只叫记者不要再提起伤心事。\n\n【案件编号：KTCC1462/15】"
		},
		{
			"post_id": 10,
			"title": "孔庆东并不是左派所以将失败的绝不是左派",
			"date_published": 1463388416.66,
			"body": "　　随着现代版宋江消灭方腊的计划破产，资产阶级政府耗资巨大的假左消灭左派的闹剧无奈地收场了。然而，资产阶级政府不甘心眼睁睁看着无产阶级革命阵营的影响力逐渐扩大，因此又设计了“力捧孔庆东成为假左领袖然后让右派文痞斗败假左领袖”的阴谋，以便让傻瓜蠢蛋产生运用马列毛思想的中国当代左派不堪一击已经被右派战败了的错觉。\n---\n　　经过了前一阶段的斗争，不仅让明眼人了解到了马列毛思想理论的厉害，也让资产阶级政府清楚了我们中革中央早已掌握了战无不胜的马列毛思想理论，所以资产阶级政府只得扔掉了正面打击无产阶级革命阵营的幻想，而随后的扶持张宏良成为假左领袖来进攻左派的计划失败，更是让资产阶级政府明白了我们中革中央非但早已掌握了战无不胜的马列毛思想理论，还早就把战无不胜的马列毛思想理论再往前发展到了当前时段所需要的高度了。\n　　于是，资产阶级政府知趣的绕开了我们中革中央，设计了刻下正进行得如火如荼的“力捧孔庆东成为假左领袖然后让右派文痞斗败假左领袖”骗局，寄幻想于不碰触左派就让傻瓜蠢蛋产生运用马列毛思想的中国当代左派不堪一击已经被右派战败了的错觉。眼下这个阴谋正实施到资产阶级政府命令的假左疯狂力捧孔庆东的阶段，待到傻瓜蠢蛋都相信孔庆东是运用马列毛思想的中国当代左派领袖的时候，资产阶级政府将命令右派文痞使出杀手锏批倒满脑子孔老二奴性意识的孔庆东，然后就造成马列毛思想理论已经被资产阶级理论战胜了的假象。\n　　资产阶级政府的之所以挑选孔庆东当猴耍，是经过周密调查和考量的。孔庆东是膜拜孔老二却又自称左派、毛派的怪胎，而且是当代中国的绝无仅有的怪胎，因为凡是中国人全都知道毛派、左派是造反有理的，而孔老二是封建奴性文化的源头，所以正常人是绝不可能同时认同更绝不可能同时赞美这两个极端对立的观点主张的。这就让资产阶级政府觅到了并锁定了这个逻辑上不可能存在的怪胎之宝了。\n　　本文揭破资产阶级政府的阴谋后，或许傻瓜蠢蛋还是会继续攻击我周群，说我周群对孔庆东不好，但实际上及时拆穿这个阴谋也是在为孔庆东着想，根源在于：一旦资产阶级政府实施成功这个阴谋，孔庆东将被右派文痞批得臭不可闻，而最终所有的人全都将明白孔庆东仅是被资产阶级政府利用来假打马列毛思想、消除无产阶级革命阵营——真左的影响力。\n　　阴谋被拆穿就不成骗局了，至于孔庆东如何从这个正展开的阴谋中抽身而退，其实也是极简单、极容易的，属于最基础的低级谋略范畴了，所以在此就不再啰嗦了。此间要再次强调的是：社会主义公有制与资本主义私有制的两条路线较量斗争是猛烈的、残酷的，不明白革命是以言行合乎革命目标而定的，不明白毛泽东思想是推翻资本主义私有制建立社会主义公有制的经验教训结晶，就想投机这场政治大潮是没有好下场的！\n\n　　附录：孔庆东文章《大哉孔子》——序《孔子诞辰2560周年纪念书画集》\n　　孔子是谁？\n　　孔子不是那个“威而不猛”的半温文半草莽的“平民教授”，也不是那个被呆呆地供奉在文庙里、保佑学子考场如意的泥塑爷爷。孔子，他是我们每个华人精神血脉的一缕一丛，也必将发展成每个世界公民精神血脉的一枝一干。孔子创立的儒家思想，已积淀为华夏文明的深层结构，对中华民族的思维方式、价值取向、理想人格、心理习性、行为操守等，产生着潜移默化的影响和作用。其伟大之处更在于，能够超越所处时空，上承远古、下启百代，普惠东亚，辐射欧美，成为全人类最重要的文化板块。\n　　传统文化，乃现代文化的出发点和今人赖以生存发展的精神底蕴，它应存活于国人心底，存活于国人的日常言行，存活于国人的信念与价值关怀中。孔子曾慨叹历史“逝者如斯夫”，其实文化亦如浩浩汤汤之大河，惟前后相续，传承不歇，方有活力，方能恒久延绵。在全球化浪潮的冲击中，我们无疑面临着自身宝贵传统应如何发扬光大的严峻课题。惟此，传统文化的一播一扬，皆意义非凡，任重道远。不仅需要像孔子那样勇毅坚进，更需要各领域仁人志士、需要各群体中的大量普通工作者，持之以恒，以“反抗绝望”的姿态去垦拓耕耘。除孔子学院、文化讲坛等直接的教育方式外，还需通过更加多元的途径，将孔子为代表的中华思想精髓及时有效地传递出去，将深刻的精神理念转化为厚实的社会资源。以此观照，这本孔子纪念书画册的问世，便赋予我们一个饶有意味的启迪。\n　　中国书法画艺，展现民族神韵之奇葩，承载传统文化之方舟，可谓千秋呈异彩，百域驰美名。新世纪以迄，士农工商，各界贤达，愈知孔子思想之珍贵，仁义礼智信之普世，纷致青睐，潜心攻研。从兹起步，瞻望未来，古今对话，中西交汇，神州万古之文脉，可沛然而通矣。\n　　文化传播，非空言虚辞可立效。孔子曰：言而无文，行之不远。又诫君子以文质彬彬。大处着眼、细处落实，此正先哲之圣明。彼巍巍乎大哉之孔子，不在廊庙，不在逝波，而在薪继火传，代代不息中也。\n"
		},
		{
			"post_id": 9,
			"title": "人形禽兽是如何驯化人类的",
			"date_published": 1463387808.973,
			"body": "　　历史上的剥削阶级禽兽和各种其它人形禽兽是如何驯化出老百姓深重的奴性的呢？许多人认为是儒释道或其它宗教的思想驯化的结果，当然有这方面的原因，但不是主要的，是次要的。\n---\n我甚至认为说次要都是很勉强的。因为孔子生存的时期是春秋时期，春秋是东周的一个时期，另一个时期是战国。而在孔子出现以前，已经有夏商奴隶制国家存在过了，周朝也是奴隶制，不过在孔子所在的春秋晚期，奴隶制逐渐瓦解，封建制还没有确立。因此，奴隶制国家在孔子出生以前，已经存在千年以上了。夏商周时期，奴隶是有很深的奴性的，这奴性如果说是孔子的儒教造成的，那简直是不可理喻的吧？！并且佛教和道教也没有出现吧？！西方的基督教更没有出现,就是犹太教出现的最早，也是距今近4000年了，出现也没有传到东方吧？！无论如何，夏商周的奴隶的奴性也和这种种后世的害人学说没什么关系吧?!   有人会说夏商周时期有天命观等剥削阶级宣扬的思想，但不系统。这或许不错，但这些思想，包括后世的儒释道等思想，如果没有暴力做为后盾，能欺骗忽悠的了劳苦大众吗？！ 劳苦大众能心甘情愿地接受吗？！ 奴隶们是在反抗总失败的情况下，才会接受这些反动思想作为心理安慰的！  奴性产生的本质原因是暴力威慑下的恐惧造成的，儒释道等思想不过是给在暴力威慑下恐惧的人民的安慰麻醉剂。这麻醉剂可有可无的，夏商周没有这麻醉剂，总共也存在了一千多年！ 所以一味地批判孔子和儒释道等思想，人形禽兽不在乎的，那正好帮助它们转移了造成人民奴性的本质原因，让人民就以为奴性完全是孔子和儒释道等思想造成的，让人民只批判儒释道等微不足道的麻醉剂，而不懂得去严惩消灭各种人形禽兽！ 所以，我们不应该本末倒置！ 其实剥削阶级禽兽驯化劳苦大众最主要最根本的方法就是酷刑，屠杀，吃人等种种恐怖主义手段！\n\n　　酷刑，夏朝就有膑刑（去膝盖骨），宫刑（割生殖器），商朝有醢脯(hǎi fǔ )（剁成肉酱，晒成肉干），战国就有车裂、剖腹、枭首、腰斩、肢解、镬烹（huò pēng ）（用鼎镬煮杀人）、抽胁（抽掉肋骨），秦朝有凿颠（将犯人的头颅从顶部凿穿），隋朝有流刑（分1000里，1500里，2000里三等）。五代十国时候，凌迟成为正式的刑法（将犯人零刀割死），宋朝时候，凌迟刑进一步发展（皆肢解脔割，截断手足，坐钉立钉、悬背、烙筋等，受刑者身具白骨而口舌之具尤动，四肢分落而呻痛之声未息），明朝时候，新增设了充军刑（近似流刑但比流刑重，充军的地方最远4000里，最近1000里，在戍地当军士，如犯罪者本人死亡，子孙亲属仍须继续充军，直到补足刑期），带枷发遣（枷重150斤，犯者经常几天就被折磨而死），清朝时候，有充军刑（分附近发2000里、近边发2500里、边远发3000里，极边发4000里，烟瘴发4000里等五种，故称五军），凌迟（其法与宋朝略有不同，割肉需寸而磔之，必需割到体无残脔，然后男犯人割去生殖器，女犯人则幽闭，挖出其脏腑，犯人死后仍要将其尸体肢解，将其骨剁碎）。虽然清朝1905年废除了凌迟等酷刑，但在一些地方仍当私刑使用。民国时期剐刑在军阀中复活了。毛主席在其文录中对这些有部分文字记录：（在湖南……将湘潭总工会委员长斩决，而以脚踢其头，更用洋油注其腹内而焚之……在湖北各县挖眼拔舌，刳肠斩首，刀割沙磨，洋油焚烧，红铁火烙，均为豪绅对待革命农民的残酷刑罚。对待妇女，则以绳穿贯其乳，而趋其裸体游行，或零碎割死……），贺龙的妹妹贺满姑，被敌人俘获后，正是受此刑而惨痛而死。事实上有关凌迟记录最详细的正是外国人，包括那些满清时的多组照片和文字记录，因而我们今天可以知道其一些详细真实内容。在清朝时执行凌迟这种刑法多要上报清廷（镇压起义不论）。但到了民国各地军阀和地方民团可以随心所欲地用此刑残杀人民。http://lishi.xilu.com/20131104/1000010000137848.html\n\n　　这些是我搜集的不同朝代有特点的一些酷刑，其实几乎每个奴隶封建王朝都有各种花样翻新的酷刑。这些大都是帝王用来镇压老百姓反抗的残酷的刑罚，对于皇帝来说，为了对付敢于造反的人，刑罚无论怎样残酷都不过分，因此君臣上下，想象力与创造力，在发明酷刑这方面都得到了极大的发挥。\n\n　　屠杀，禽兽帝王等人形禽兽找借口，编造理由或纯粹随心所欲的杀人。秦始皇在位期间，杀人无数。有时是找个借口，有时是随心所欲的杀。一次他出游，看到李斯的出游队伍车骑众多，声势浩大，大为不悦，口中连称“不善，不善。”一个随行的太监悄悄把他的话转告李斯，李斯吃惊不小，再次出行就减少了车骑护卫。秦始皇知道后，怒曰“从中人（太监）泄吾语”。然后，下令把那天随他出行的太监全部逮捕拷问。审来审去，却没有人承认。秦始皇干脆下令，将那天在场的太监全部杀掉。隋文帝杨坚，晚年杀戮不休。武库院内长了些野草，它便将武库令等数十人杀掉。隋炀帝，就是隋文帝的儿子，乘船出巡，船队经过一段河道，屡次搁浅，它就派人探测，发现有120多处河道淤塞变浅，不禁大怒，遂命人查究开挖这些淤浅河道的民夫，将他们全部逮捕，头朝下倒埋于堤下，被活埋者达5万余人。\n\n　　随心所欲杀几十几百人，杀几千几万人都是这些人形禽兽惩罚臣民或开心取乐的小手段和小游戏。更剧烈的大屠杀是禽兽们争夺江山和百姓作为自己私有财产，或是对于敢于造反起义的民众。那大屠杀动不动就是几十万几百万，几千万上亿的也有的。秦国在吞并六国的战争中，究竟屠杀了六国多少百姓，史无可考，而被斩首的战败国的将士，史籍中却有一些记载。根据司马迁的记述，秦国仅由白起率领的军队，就斩首近90万众。皇甫谧《帝王世纪》说：“计秦及山东六国，戎卒尚有五百余万，推民口数，当尚千余万。及秦兼诸侯，置三十六郡，其所杀伤三分居二。”也就是说，秦国吞并六国的战争，使军民死伤三分之二。由于古今史学家大多热衷于颂扬秦始皇嬴政统一中国的丰功伟业，而被秦国吞并的六国有多少人死于战争很少提及，故今天人们只能从史籍中看到嬴政的巍峨丰碑，而看不到那些被征服者斩下的堆集成山的头颅。《后汉书·耿弇》记载：耿弇（yǎn）为将，平定四十六个郡，屠灭了三百座城池，从未遭到挫败。东汉王朝是在新朝皇帝王莽死后，经历了21年的大混战而建立的。东汉建国初期，全国共设十二州，每州设六到八郡，每郡有县城七至八座，全国共有大小城市大约七百多座。仅耿弇所率领的部队就屠灭了三百多城，占全国城市的百分之四十。平均每座城的百姓人口以一万计，加起来也有三百万之多。人民的脑袋，此时被想做皇帝的人当成了通向龙椅的障碍而挥刀扫平之。明朝的项忠率领军队镇压郧（yún）阳的农民暴动，反抗贪官污吏的山民李原领导的暴动被镇压后，项忠对郧阳一带展开大屠杀，90余万农民全部死于官军的屠刀之下，大多数没有参加暴动的百姓也惨遭屠杀，当地男女老幼的尸体填满山谷。中国历史上改朝换代的战乱，少则数年，多则数十年，其中清朝取代明朝的战乱，自1627年陕西农民发起暴动，到1682年吴三桂等三藩被平息，长达55年，死于战乱的百姓超过一亿。清朝乾隆把百万左右准噶尔蒙古人种族灭绝了，从此准噶尔成为一个地理名词。清朝嘉庆时，白莲教起义，有1300万人死于战乱。在清朝和太平天国的长达14年的镇压与屠杀中，人口减少了一亿多。当然，有人认为没有这么多，但估计至少有6000万左右人死于战乱，大部分是清军屠杀的。曾国藩在1864年攻克南京后，血洗金陵，纵火焚城，大火数日不灭，繁华的六朝古都几乎被烧成废墟。清人记载：“金陵之役，伏尸百万，秦淮尽赤；号哭之声，震动四野。”所谓伏尸百万，除了战死者，就是曾国藩在城内外屠杀的平民。“皖南及江宁各属，市人肉以相食，或数十里野无耕种，村无炊烟。”显然这次屠杀最保守估计也应该在50万人以上，清人所说的伏尸百万也是有可能的。而屠城和对城市的毁坏程度也是历史之冠。 \n\n　　隋炀帝的老弟杨谅起兵与他对抗，他派杨素率军镇压，杨谅兵败后，被幽禁而死，杨谅所部吏民坐罪死徙者20余万家。以每家5口计算，就有100多万人被杀害或流放。族刑连坐，起源于夏商时期，当时有孥戮之刑，就是一人有罪，杀其全家。秦朝时候，就有灭宗、灭族、灭三族、夷七族、夷九族、夷十族等。更重的是灭里，就是与罪犯同居一里的人都要诛灭，灭里已经大大超出了灭族的范围。隋炀帝的弟弟造反，当然不能用灭九族的刑罚了，呵呵。所以，隋炀帝就疯狂镇压它弟弟的部属官吏平民。\n\n　　朱元璋的儿子朱棣，对谋反者进行瓜蔓抄，就是逮捕行动像瓜藤须蔓一样,向四面八方伸展。他下令将刺杀他的景清剥皮萱草，挂在长安门示众之后，夜里睡觉梦见景清仗剑绕着龙椅追杀他，以为景清化为厉鬼，欲为故主朱允炆（朱棣的侄子，朱棣起兵篡夺了侄儿的帝位）报仇，以后还会前来索命，不知是为了镇邪，还是为了泄恨，它竟然下令“赤其族，籍其乡”，结果景清家乡的小民被杀个精光。\n\n　　搞特务监视臣民，中国历史上最早使用特务监视臣民的皇帝，是周王朝的第十个君王姬胡，就是周厉王，它找到一个巫人，让他四下打探，发现谁背后说他的坏话，就立即向他报告。曹操以猜忌好杀著称于史，他公开委任以官职，利用校事监控臣僚，也为中国历史第一人，他可谓搞特务政治的第一人。到了明代，锦衣卫，东厂，西厂等特务机构监控臣民更是达到了封建社会登峰造极的地步。某大臣无事时在家中与妻妾打麻将，丢了一张二万，怎么找也找不到。次日上朝，朱元璋问该大臣昨晚在家干啥，大臣以为皇帝要过问他下班后的活动，便如实秉告，并请皇帝恕罪。哪知朱元璋听了不但不怒，而且表扬他曰：“卿不欺我，朕不怪也。”说完竟从袖中摸出一张二万扔给他，该大臣一看，正是他昨晚丢失的那张牌。明朝末期，有5个人在一个旅店饮酒，其中一人咒骂魏忠贤作恶多端，终有恶报。其他人有的沉默不语，有的感到恐惧，有一人劝他说话小心，隔墙有耳，万一被人听见，会招来灾祸，这人却高声说：“魏忠贤权势虽大，他总不能剥我的皮，我怕什么！”不料，这话被东厂特务听见，当天深夜，东厂特务破门而入，把骂魏忠贤的那个人找到，并把其余4个人也一起带到一处衙门。骂魏忠贤的人被脱光身子躺在一块门板上，手脚被钉住。一个身穿官服的家伙高坐堂上，对那四个人说：“这位说我不能剥他的皮，今日不妨一试。”说罢便令手下动手。原来此人正是魏忠贤。魏忠贤也用剥皮对付东林党人，忘了是谁对他说：“反正我就一张皮。”结果魏忠贤把他剥下皮后用盐淹了一遍，结了一层壳，好再剥第二张皮。这个故事还有别的版本，主角换成了明成祖或严嵩，究竟是谁或许并不重要了。\n\n　　禁止人民拥有武器，是封建帝王的一贯做法。秦始皇收缴了全国百姓的兵器，熔化铸成了12个巨大的铜人。隋文帝下令：“收天下兵器，敢有私造者，坐之。”隋炀帝比他爹更严厉：“民间铁叉、搭钩、槊刃之类，皆禁绝之。”朱元璋更高明，懂得从源头控制，有官吏请求开采铁矿，它说兵器不缺乏，下令禁止再开采铁矿。禁止老百姓拥有武器，就是怕老百姓反抗造反，也为了更好更方便地驯化奴役镇压劳苦大众。\n\n　　朱元璋虽然经过刻苦学习，但毕竟是自学成才，对文理，典故运用是似懂非懂，而农民军曾被称为“盗”、“贼”，它又当过和尚，剃过光头，故对于“盗”、“贼”、“僧”、“光”、“亮”以及与其读音相似的字，都十分敏感。北平府学训导赵伯宁作《万寿贺表》中，有“垂子孙而作则”之语，则与贼读音相近，而凤阳方言两字读音相同，朱元璋认为是骂它是贼，于是下令将其杀死。陈州州学训导周冕作《万寿贺表》，其中有“寿域千秋”一语，寿与兽读音相同，而域又被朱元璋读成或字，这就是骂皇帝“兽祸千秋”，结果周冕被杀。清朝道士贾士芳入宫为雍正驱邪治病，因咒语中有“天地听我主持，鬼神归我驱使”一语，被砍了头。朱方旦（？—1682），根据自己多年的行医经验，提出了脑是人的思考器官。这是朱方旦在多年的行医实践中悟出来的一个朴素的科学结论。“脑”才是思维中枢，而不是传统医学认定的“心”！此说一出，闻者无不惊讶，社会为之震动。儒生、官吏们，议论纷纷，大张挞伐；医学界也是人云亦云，莫衷一是。康熙二十年（1681年），翰林院编修王鸿绪看到朱方旦的著述后，立刻跳出来说他这是“诡立邪说，妄言休咎，煽惑愚民，诬罔悖逆”，并认定朱方旦犯有“诬罔君上，悖逆圣道，摇惑民心”三大罪行。王鸿绪奏请康熙皇帝按大清法律严处朱方旦。还有几个满汉大学士如明珠、李蔚之流，也认为朱方旦“悖逆招摇，妖言惑众”。更有甚者，那个明珠还强烈要求：“凡是收藏朱方旦书籍的人，也要严惩不贷。”于是，康熙二十一年（1682年），康熙帝下诏将朱方旦处死，其著作尽行焚毁。朱方旦的肉体和思想，就这样被来了个彻底消灭。封建禽兽帝王搞文字狱，目的是钳制言论，禁止人民拥有思想。因为人民有思想，就会独立思考，会动摇禽兽帝王的罪恶统治。\n\n　　剥削阶级禽兽及其它各种人形禽兽吃人的历史记录是非常多的。《史记.黥布列传》记载，公元前196年夏，刘邦以梁王彭越阴谋造反为由，将其杀死，切碎作成肉酱，并把这肉酱分发给全国各地的诸侯食用，以示恐吓。不但皇帝吃人肉，还要给诸侯尝人肉滋味。刘邦一面讲礼教、尊孔子，一面吃人肉。\n\n　　汉末臧洪为袁绍所围，城中食尽，亦“杀其爱妾，以食兵将”。在食人习以为常的动乱中，孔融为人吃人制造理论根据：他说吃不认识的人，就好比吃猩猩吃鹦鹉。吴虞在《吃人与礼教》一文中说，“把人当成狗屠，把他人的生命拿来供自己的牺牲”，然而，就是“这样蹂躏人道蔑视人格的东西，史家反称准他为‘壮烈’，国人反亲慕他为‘忠义’，真是是非颠倒，黑白混淆了…孔二先生的礼教，讲到极点，就非杀人吃人不成，真是惨酷极了！”他得出结论说，礼教就是“吃人”，“吃人”就是礼教。\n\n　　隋代杨玄感谋反，炀帝把他正法，罪及九族，并命令官员，都去割食他的肉。杨广以不忠的罪名逮捕了斛斯政，并把他制成食物。杨广要斛斯政的同僚们吃他的肉，有的吃得比自己所得的一份还多，有的则不肯吃。吃得多的人因此而受到褒扬，并受赐大量的贵重赏物。人形禽兽还要把正常人也变成禽兽，目的为了自己的罪恶统治稳固，大家都是人形禽兽，封建私有制就稳固了，帝王的江山就稳固了。正如网上有人评论的：吃人习俗一直是由皇帝王公们最积极推行，他们惯于强逼臣子奴才们吃被杀者的人肉，既令吃人者同自己一样变得邪恶，也通过这种方式进一步摧垮臣子的人性底线和反抗意识，使他们堕落成为不折不扣的人形的兽类，使他们失去基本的人性意识，失去重新做人的可能，死心塌地的作自己的奴才。 \n\n　　唐末杨行密围攻广陵时，城中粮草罄尽，守城军士就抓百姓到集市上贩卖，专门派人杀戮他们，像屠宰猪羊似的，这些人被杀时，竟然一声也不喊叫。人已经被驯化的被杀都一声不吭了，网上有人说猪被杀的时候都疯狂挣扎嚎叫，而羊被杀时候是一声不吭的，只是默默流泪。\n\n　　隋末的朱粲，更是一位著名的吃人魔王。当时襄阳、邓州一带大灾荒，白米万钱一斛还买不到，百姓相食成风。朱粲乘乱起兵，常捕捉民间幼儿蒸熟吃肉。他对军士说：“世上最美的食物，还能有超过人肉了，只要国中有人，我就不用担心没有军粮。”于是下令，让部下分道捕获妇女和儿童，蒸熟分配给士兵当饭。剥削阶级及各种人形禽兽从来没有把劳苦大众当人看的，和平时期把老百姓当牛马奴役，战乱时期就把劳苦大众当食品吃了。\n\n　　后汉蔡王刘信掌管禁军时，左右若有人犯罪，就抓来他的妻子和孩子，当着他的面零刀割他们，让犯罪者吃自己亲人的肉。被零割的人身首异处，手足分离，满地鲜血横流，刘信举杯饮酒，并让乐队奏乐，刘信自己不吃人肉。\n\n　　元人陶宗仪所著的《南村辍耕录》里说，“天下兵甲方殷，而淮右之军嗜食人，以小儿为上，……或使坐两缸间，外逼以火。或于铁架上生炙。或缚其手足，先用沸汤浇泼，却以竹帚刷去苦皮。或盛夹袋中，入巨锅活煮。或男子止断其双腿，妇女则特剜其两乳，酷毒万状，不可具言”。人肉曰‘想肉’，食之而使人想也。\n\n　　明代有个名叫王冠的人，热衷于房中术。他有婢妾十余人，恣意纵欲，婢妾怀孕快要分娩时，王冠就让她服药打胎。胎儿产出，王冠就把胎儿放在石臼中捣成肉酱，配制成药丸。他还购买别人家的幼儿烹熟食肉。后来事情败露，王冠被治罪，凌迟处死。那些认为虎毒不食子的人，好好想想吧，其实许多人形禽兽比真正的禽兽是残忍恶毒千百倍的，说它们是禽兽都是对禽兽的侮辱。它们是宗教传说里的魔鬼！千万不要认为只要有人的形状和体貌特征就一定是人，那人的标准也未免太低了！\n\n　　明末的刘泽清是一位活吃人的典型人物。他镇守庐州(今合肥)，平时读书作诗，颇为风雅，实际上极其凶残。有一天，刘泽清设宴请客，让一只猩猩捧着一盏装有三升酒的金瓯向客人跪着敬酒，客人吓得浑身发抖不敢接酒。刘泽清笑着说：“你连这畜生也害怕吗？”他又叫人拉过来一名死囚犯，在宴会厅中当场打死，取出脑浆和心肝放在另一盏金瓯中，让另一只猩猩捧着，刘泽清吃着血淋淋的人心肝，喝着白花花的人脑浆，旁若无人，宾客莫不胆战心惊。后来刘泽清投降清朝，清朝担心它反复无常，寻借口把他磔死。\n\n　　清顺治九年（1652年）南明将领李定国攻新会，城中粮尽，清军开始杀居民为食。新会被围八个月，吃掉居民近万人。有一回城门正要关闭，有几百名乡下百姓涌到城门外请求进城避难，县令不同意收留他们，清军守将说：“让他们进来吧！到紧急的时候，这批人可作为我们十天的口粮。”于是打开城门，把百姓放进来。姓莫的媳妇愿代婆婆而死，清军把莫氏烹食。有户人家数口被吃，只有一人幸免，这位幸存者有一天在路上遇见了清军守将，就跪下向他下拜。守将感到惊讶，问：“你拜我干什么？”那人说：“我的父母妻子都安葬在你的肚里了，他们都没有坟墓。如今寒食节临近，我不朝着你的肚子下拜又到哪里去拜呢？”守将满面羞惭，急忙离去。对于吃自己亲人的仇人，还要跪拜，人已经彻底被驯化了，这样的人怎么可能还有反抗精神呢？！所以，今天我们看到许多人还给贪官污吏等禽兽们下跪也就不要奇怪了，彻底被驯化的人就只会下跪自杀了！\n\n　　人性能承受的恐惧有一条脆弱的底线。当人遇上了一个凶狂的杀手，杀手不讲理，随时要取他的命，人质就会把生命权渐渐付托给这个凶徒。时间拖久了，人质吃一口饭、喝一口水，每一呼吸，他自己都会觉得是恐怖分子对他的宽忍和慈悲。对于绑架自己的暴徒，他的恐惧，会先转化为对他的感激，然后变为一种崇拜，最后人质也下意识地以为凶徒的安全，就是自己的安全。这种屈服于暴虐的弱点，就叫“斯德哥尔摩精神症候群”。人是可以被驯化的——斯德哥尔摩综合征。历史上的各种禽兽就是通过酷刑，屠杀，吃人彻底驯化了劳苦大众的多数，甚至大多数，所以中国的老百姓总是在大多数人活不下去的情况下才会起来反抗的，而一些还是宁可自杀也不反抗的！ \n\n　　中国人是一向被同族和异族屠戮,奴隶,敲掠,刑辱,压迫下来的,非人类所能忍受的楚毒（酷刑）,也都身受过,每一考查,真教人觉得不像活在人间。——这是鲁迅说的，鲁迅先生早就通过历史发现了奴性是杀出来的（但鲁迅先生好像没有直接明确指出，现在我直接明确指出，而且他似乎侧重批判儒释道。），不仅仅是儒释道的奴化，由于不断地被屠戮，所以勇于反抗的基因基本被清除了。 所以，以后必须对各种禽兽反复地不断地杀至少百年，百年不够，就千年亿万年，则可基本清除各种禽兽的基因！历史记录了许多禽兽们酷刑折磨人，屠杀人，吃人等等丑恶历史，而没有记录的估计更多更残忍！可以说，中国人民几千年以来是恐怖主义最大的受害者。无论是奴隶制，还是封建制，还是现代的资本主义制度，统治控制人民的手法主要就是剥削阶级国家的暴力恐怖主义。\n\n　　驯化后的狗,脑容量较狼小了百分之二十到三十。所以被驯化就是一种退化，虽然人类的脑容量和智力高低没有绝对的必然联系，但考虑几千年的剥削阶级禽兽对劳苦大众的屠杀驯化，估计还是会对劳动人民的平均智力水平造成一些影响的，所以说各种剥削阶级及各种人形畜生对人类的整体素质造成了很恶劣的后果，并波及劳动人民的后代，是极有可能的。\n\n　　苏联人做过实验，原理是准备一个数量足够大的样本库（好几个国营狐狸养殖场的数千头毛皮用狐狸为此服务），从中挑选出对人类表现较为亲近的让其繁殖下一代，然后再挑选......50代后的狐狸虽然还有少数返祖现象（机警，疑心重，性格凶猛），但大部分狐狸已经学会卖萌和摇着尾巴问研究院要东西吃了——狐狸可以被驯化，人也可以，剥削阶级禽兽就是通过各种酷刑屠杀恐吓驯化出了劳苦大众的奴性！\n\n　　一项小鼠的反射研究表明，特定的恐惧感可以代代相传。所以，历史上对劳动人民的不断的大屠杀所造成的恐惧是会遗传给劳动人民的后代的，而奴性正是在大屠杀的恐惧下产生的！不但恐惧，根据现代科学的研究，精神气质都可以遗传，所以应该好好研究遗传学！ 我原来就思考过恐惧能否遗传，我估计差不多，后来搜到了这个，这更说明奴性确实是杀出来的！  所以对反动派进行基因根绝是绝对正确的，绝对有必要和可行的！  反动资产阶级对权力，利益的争夺，对人民的剥削压榨残害，作威作福的享受也是一种瘾，是丝毫不差于毒瘾的，甚至比毒瘾还厉害的一种巨毒瘾，对这种瘾的消除最好的方式是基因根绝！！！http://tieba.baidu.com/p/2773418748\n    \n　　美国总统胡佛(1874-1964)曾在1899年来到中国工作过几年，虽然胡佛干的是贩卖中国劳工去南非的罪恶勾当，但他也说出了中国劳动人民的真实生活状况，它说中国90%的劳苦大众在生死线上挣扎，几乎每座村庄每年都会有人冻饿而死。胡佛是在清朝末年到中国的，他的说法验证了几千年劳动人民的生活水平和状况。即便所谓的贞观之治和什么康乾盛世，老百姓的生活也不会好太多的。况且这样的所谓盛世在历史上总共加起来不会超过300年。\n\n　　宦官从被强行阉割到自己自愿净身，经历了一个漫长的过程，而其中关键在于宦官地位的提高。早在春秋战国时期就出现了“自宫以适君”的竖刁之流，此后大凡是宦官得势的朝代，自宫现象便格外普遍。东汉时期的宦官横行猖獗，势倾朝野，因而多有“腐身熏子”自愿成为刑余者。唐朝宦官气焰嚣张，权势登峰造极，以至能随意任免朝臣、抉立及杀死皇帝，自宫一时竟成风气。明代宦官势力最盛，自宫现象亦最为严重，其中有“已婚而自阉者”；有“熏腐其子”者；有“兄弟俱阉”者。更有甚者，竟有人“尽阉其子孙以图富贵”，其行为绝非“可鄙”二字足以形容，着实令人发指。唐朝时武则天有个男宠叫张易之，有人在他家门上贴了个纸条上写：“看你横行到几时”，张易之竟狂妄地回贴：“为欢一日已以足”。 这是在一本书里和网络上看到的内容，所以，我们绝不能低估一些畜生和贱货的残忍和无耻程度！所以，当今也有为了十大家族，为了自己那一点可怜的狗粮和一时的享乐，而宁愿全家被灭绝的东西的。现在国内的新资产阶级让狗腿子文痞忽悠要取消死刑，说取消死刑是文明社会的标志等等忽悠欺骗人民的无耻谰言！它们的罪恶目的是让剥削阶级禽兽横行无忌。革命胜利后，有人提出取消死刑也是绝对不行的！何止死刑，有人反血债血偿理论也是不行的！在未来革命取得胜利后，假左会提出血债血偿理论太血腥，不给人改正错误的机会等等忽悠欺骗人民群众的，如果是基层的党员提出这样的问题，应该开除。如果是上层的假左提出来这样的问题，可以对它进行血债血偿了。如果假左篡夺了革命果实，那人民就要起来革命推翻这些禽兽，把这些禽兽的基因根绝。对于人民提出这样的问题，要教育这些迂腐善良的普通人民群众！\n\n　　有人说中国老百姓的奴性最强，如果这是正确的话，那就应该得出这样的结论，中国的人形禽兽的兽性最强，因为只有最强的兽性才能驯化出最强的奴性，这是个很简单的辩证关系，很容易推理出来的，为什么没有人指出呢？！我感到十分奇怪的是，为什么总见许多人义愤填膺地指责人民奴性深重，而很少听到有人指责剥削阶级禽兽及其它各种禽兽兽性强呢？！ 大概是因为指责被驯化的老百姓没有人会报复他吧，而指责禽兽就会招到禽兽的疯狂报复吧，呵呵！还有许多反奴性的正是各种人形禽兽，许多人可能会奇怪，其实一点不奇怪，它们反奴性是为了维护自己主子的地位。如果我们一味反奴性，在私有制下，当主子的各种人形禽兽就高兴地不得了。我亲身经历了许许多多的事情，有的人声色俱厉地骂道：“中国人就是奴隶坯子，你不管他就不行！”  反奴性反来反去，和各类人形禽兽没多大关系，许多人形禽兽也反奴性，则是说中国民众需要它们的管制，它们光反奴性，却不反私有制，也不会反兽性，更不可能让它们管制的普通人起来造它们的反的，反奴性倒成了它们管制民众和它们权力合法性的解释了。所以，我认为，提反奴性，必须提反兽性、反私有制或推翻私有制才行，而且更应该首先反兽性，如果不反兽性，光反奴性，没有任何作用，反倒成了人形禽兽管制驯化大众的借口了！而且光反奴性，不反兽性，不推翻私有制，不残酷杀戮人形禽兽，奴性也根本不可能消除！\n\n\n　　对于反革命及各种对人民犯下滔天罪行的人形禽兽一定要基因根绝，还要用各种残酷手法惩罚。它们根本不属于人类。所以，对于那种认为这么干，那你们不就和人形禽兽一样了嘛的脑残不必理会，这种脑残也是降低人类整体认知水平的人，这类人要逐渐边缘化他们，不要让他们的愚蠢呼声毒害大众。凡事不可做地过绝，得饶人处且饶人。这是各种人形禽兽或普通人民群众经常说的话，禽兽说这话的目的是为了免遭惩罚，而人民也这样自我安慰是怕禽兽的疯狂报复，在私有制下，人民群众这样说是可以理解的。但今后革命胜利后，如果还有人民群众这么说，就是迂腐愚蠢了。各种禽兽对人民群众的各种兽行是绝而又绝的，所以，革命胜利后，对各种禽兽的惩罚一定要绝而又绝！！！\n\n　　许多人可能会认为，人类社会中的人形禽兽也是有用的，有血性的，抗击外敌侵略它们也有用的，所以，不应该把它们基因根绝。对此，我绝对不敢苟同。它们有血性，笑话。那是兽性（现在它们把兽性忽悠成了狼性，狼性似乎成了个褒义词，多滑稽可笑！《狼图腾》毒书的作者就是个歌颂禽兽的畜生，为人形畜生合理合法的生存在人类社会公开叫嚣！）。它们残害人民展现的不是血性，是赤裸裸的禽兽性，人民丝毫不需要这样的禽兽基因。抵抗外敌入侵绝大多数也不是这类禽兽，是人民大众。不要被假共造假的土匪抗日忽悠了，呵呵！这些禽兽对人民残暴，对更强大的暴力团伙就剩下狗性了。乔四孙子这个黑社会头子临死前要花钱保住自己的狗命，丝毫没见到什么血性！四川宜宾市黑帮头子郝鸿打了李鹏这个假共大黑帮头子女儿的司机，后来知道是谁的司机了，吓得花几百万疏通关系，结果还是全家被抓捕了。周永康的狗，黑帮头子刘汉居然在法庭上哭了，呵呵。笑死了，这些恶心的小丑！黑社会是暴力团伙，是有组织的，是假共豢养的不穿制服的狗。人民早都被假共弄成一盘散沙了，当然多数人不敢和有组织的暴力团伙硬碰硬了。真正有血性的是胡文海，是杨佳，是钱明奇，这样的个人勇敢地反抗假共黑社会团伙的孤胆英雄！勇于反抗剥削阶级和各种禽兽的人民群众是真正的有血性，是真正的有人性，这些人是民族中的真金，无比宝贵，是被各种禽兽反复屠杀几千年的中华民族剩下的为数不多的血性英雄！如果有人认为反抗剥削压迫是狼性，血债血偿禽兽是兽性，那这东西不是畜生就是脑残弱智。\n\n\n　　人形禽兽也有信仰的，可能许多人不信吧，当然那是禽兽的信仰，那就是暴力，权力和享受！！！ 禽兽的信仰非常坚定执着（就是顽固不化），禽兽为了追求自己的罪恶信仰可以说是不折手段，百折不回，至死不渝！ 各种禽兽通过暴力手段霸占人民的生产资料以此获得权力，骑在人民头上作威作福的压榨剥削奴役人民，享受人上人的快乐，这就是禽兽的信仰。许多人认为反革命禽兽的亲人家族后代等是无辜的，根本是胡说八道，恰恰相反，反革命禽兽反革命的动力正是来源于为了自己的亲人家族能世世代代地骑在人民头上剥削压榨奴役人民的兽性欲望信仰。事实上，当今我们看到的情况是禽兽的亲属家族基本都是在享受禽兽掠夺人民的血汗。所以那种认为禽兽的家属亲人是无辜的，不是迂腐愚蠢的人，就是别有用心地想给反革命禽兽留下罪恶基因后代的畜生！\n\n　　剥削阶级禽兽及其一切狗奴才总忽悠人民要靠制度，靠杀是不行的，是不文明的，这就是忽悠欺骗！改造反人民禽兽不行，杀也不行，怎么都不行，其意思就是它们反人民禽兽是任何人奈何不了的，是神一般的存在，就是说它们是不可战胜的，还是由它们统治奴役人民是合理的，是谁也动摇奈何不了它们的。这根本就是个天大的笑话！对付反动禽兽最好的办法就是屠杀，基因根绝的杀！！！！！！要坚持不懈地百年千年亿万年地坚持清理畜生基因。杀戮驯化是可以改变生物的基因的，现在科学已经揭示出这个真理了，有许多案例！所以许多人认为对禽兽光杀没有用，不是别有用心，就是糊涂！ 咱们也没有说光靠杀，但对各种禽兽光杀戮或灭杀他们的基因，产生的震慑效果和基因选择的良好效果至少占95%以上。假共的狗忽悠人民靠杀戮是不行的，就是企图逃脱惩罚，它们忽悠制度法律也是这个目的，因为它们总能从它们忽悠的法律和制度钻空子逃脱惩罚，所以人民群众一定要牢记：对付各种反人民禽兽最好的办法就是屠杀，基因根绝！！！要做好共产主义接班人的工作，多多培养革命家，保证红色江山永远有真正的人民的领路人带领，这就是周群老师的教诲，做好思想大普及，不断地文革加武革，坚持不懈地清理反人民畜生的基因！！！当然，前提得必须保证人民的红色江山必须永远有自己真正的领路人，必须不断地培养真正的共产主义接班人！！！否则，屠杀，清理畜生基因的工作就会中断，还可能给人民带来毁灭性的后果！\n\n　　专政是直接凭借暴力，不受任何法律约束的政权————佛.伊.列宁 。  资产阶级怎么会跟无产阶级讲法律。无产阶级也不应该对资产阶级讲什么法律，假左在IS语音聊天软件的红旗频道有个叫老王的家伙，总在那里谈法律的重要性，这就是企图忽悠人民相信法律， 在未来无产阶级专政的社会主义社会，企图束缚住人民的手脚，企图让资产阶级不彻底被人民专政。 资产阶级对人民的上访、游行等在资产阶级法律范围内允许的行为都派出军警殴打残杀镇压，不经过任何程序的，相反，资产阶级文痞还造谣无产阶级专政不讲法律程序，真是无耻到极点，专政确实应该是不讲任何法律程序的，但在毛主席时代，镇压阶级敌人也是要公审，宣判走程序的，即使文革也是开群众大会批斗有程序的，都不是直接随意打杀的，资产阶级专政才是不讲任何程序的！大家一定要记住专政是不讲任何法律的对阶级敌人的直接暴力！\n"
		},
		{
			"post_id": 8,
			"title": "周群文章《颠覆资产阶级政权（兼评颠覆国家政权罪）》",
			"date_published": 1463165478.49,
			"body": "　　之前我倒是还真的不敢相信资产阶级政府居然胆敢公然要以颠覆国家政权罪的罪名来判无产阶级革命者的罪，这实质上就是在公然要以颠覆资产阶级政权的罪名来判无产阶级革命者的罪。直到不久前出现了国家机器的警察居然冲着我们无产阶级革命阵营的同志如此大叫大喊发神经病时，才令我如梦初醒并倍感震惊：现在的人居然已经愚蠢到脑子都出问题了！\n\n---\n\n　　仅需脑子尚且正常的人全都明白：国家、政权之类的都是没有性质的名词而已，必须在其前面加上表明性质的形态词才能说明问题。比如国家，必须在其前面加上资本主义或社会主义；比如政权，必须在其前面加上资产阶级或无产阶级，才能说明这个国家或政权是什么性质的。而也唯有如此标明了性质才能断定其的好坏，才能确定要不要颠覆、要不要推翻、要不要打倒。\n\n　　然而，现在的中国政府居然一边自称仍然是无产阶级革命先锋队的共产党执政、仍然是社会主义国家，一边却要以颠覆国家政权罪的罪名来宣判无产阶级革命者颠覆资产阶级政府的革命、来宣判人民群众推翻资本主义私有制建立社会主义公有制的言行，这不是把全世界的人类全都当作了傻瓜蠢蛋、脑残白痴在耍吗？！而我周群早就说过了：把世人全当作傻瓜蠢蛋、脑残白痴耍的人，即是这世上最傻瓜蠢蛋、最脑残白痴的人！\n　　实际上是人皆知，资本主义国家存在资产阶级，而社会主义国家不存在资产阶级，这根据生产资料是国人共同拥有、共同生产、共同享受的公有还是生产资料被极少数人掌握、霸占的私有，是极易判断的。且资产阶级政权是资产阶级政府维护资产阶级骑在无产阶级头上剥削压迫的专政体制，而无产阶级政权是无产阶级政府维护无产阶级不被任何人骑到头上剥削压迫的专政体制，更仅需是人就该明白的最基础、最基本的概念了。\n　　由此可见，颠覆国家政权罪是完全不成立的！而如果改成：颠覆资本主义国家资产阶级政权罪，或改成：颠覆社会主义国家无产阶级政权罪，倒是可以成立的。但必须在此特别强调的是：绝对不可再继续把资本主义国家资产阶级政权假冒社会主义国家无产阶级政权，绝对不可再继续把世人全当作傻瓜蠢蛋、脑残白痴进行欺骗了！因为，俗话的“人在做，天在看。”我周群早就把之改成了：你在做，人民群众在记帐！"
		},
		{
			"post_id": 7,
			"title": "长文：当今中国主要政治势力大揭秘",
			"date_published": 1463144186.869,
			"body": "　　关于当今中国的主要政治势力，在周群老师的文章和讲话录音里都有介绍，我主要依据这些，还有其它一些资料整理和集中说明一下，便于人民群众认清真相，避免被欺骗。假共对人民的欺骗是全方位的，并且许多所谓的和假共对立的势力是假共的狗或棋子而已，和假共演双簧欺骗人民，这欺骗性就极大了，许多人很难避免被欺骗，所以必须予以揭露！\n\n---\n\n　　首先说明一点，真正的中国共产党，在1976年10月6日晚，四个无产阶级革命家被走资派政变逮捕后，就已经亡了，中华人民共和国也于同天亡国了。人民从此就成了亡国奴，当然这个过程是个潜移默化缓慢的温水煮青蛙的过程。所以，现在假共通过媒体和他们的狗一方面胡扯防止颜色革命，防止和平演变，避免亡党亡国就是无耻的忽悠，中国人民的红色江山早都被他们改变颜色了，变成了特色资本主义，挂着共产党，社会主义的牌子欺骗愚弄人民群众。另一方面通过各种媒体和他们的各种狗，把他们复辟近40年所做的一切罪恶都推到真正的共产党和社会主义的头上，使人民群众仇恨真正的共产党，仇恨社会主义，从而彻底否定共产党，否定社会主义，达到脱衣摘帽，把抢劫人民的生产资料等巨额财富合法占有，因为社会主义制度被否定，脱衣摘帽后是资本主义社会，假共的许多头目以反体制（他们反的是社会主义，其实76年后的政治体制是资本主义体制）的英雄的面目出现，不但无罪还有功，自然无法追究他们的罪行了。如果社会主义制度不被彻底否定，他们抢劫人民巨额财富的滔天罪行就总担心被人民清算。总之，他们要么戴着共产党的假面具，忽悠人民保党救国，维护资本主义社会的稳定；要么彻底否定共产党和社会主义，达到脱衣摘帽免受惩罚的美好结局。而这两方面都需要走狗来忽悠欺骗人民，所以就引出了两个所谓的政治势力，假左和民运分子。其实基本都是假共的狗，从不同方面以不同方式欺骗忽悠人民群众。\n\n　　先说下所谓的民运分子，就是追求所谓民主自由的这些家伙的内幕，我深揭深挖，把他们从根子挖出来。其实，最早被许多民运分子认为的民主运动是1976年4月5日的所谓四五运动，是趁清明节怀念周恩来的时机，许多人到天安门广场烈士纪念碑前送花圈送挽联，贴出反对“四人帮”的政治诗文，形成了1976年的所谓“天安门民主运动”。现在假共对此的解释是：指于文化大革命后期的1976年4月5日发生的以天安门事件为中心的反对“四人帮”、否定文革的全国性的群众抗议运动。其实，这个四五运动在毛主席生前是被定性为反革命暴乱事件的。为什么？ 因为这是当时的走资头子邓小平幕后操纵的。\n\n　　\n　　1988年7月19日：“耀邦告诉我，1976年四五事件也是邓小平怂恿他搞起来了的。他已经与作家师东兵在88年3月和4月两次谈过四五事件的来龙去脉。是秘密地在家里与师东兵见的面，连家人和秘书都瞒住了。耀邦告诉我，76年1月15日，邓小平在周总理追悼会上致完悼词后。找到我，说，今天我给总理致悼词，或许我们死后就没有人给我们致悼词了。我们不能坐以待毙，要搞点行动。3月中旬，邓又找到我，说他的孩子听人说，4月5日清明期间，有人决定去天安门给总理送花圈。这是个好机会，要想办法把事情搞大，给主席一个刺激，证明并不是人人都听他的。耀邦又说，小平让我找几个干部子女，让他们去工人中间鼓动一下，把矛头对准江青和张春桥。1988年8月5日：\"又和耀邦见了一面，耀邦说，小平是过河拆桥式的人，你要当心。同时，耀邦又向我透露了一件大事，说这是他最见不得人的事件，不说出来对不起自己的良心。80年4月，我们当时以清理‘三种人’为理由，将北京市公安部门24名科级到处级的干部骗到云南大理秘密枪决，当时还派了王震去现场观看。我问，为啥子秘密枪决他们，他们犯了啥子罪？耀邦说，他们当时掌握了我和小平是76年四五事件幕后指挥的证据。另外，有些人也掌握了邓榕和其他的高干联动成员是1966年8月5日打死北京师范大学附属女子中学副校长卞仲耘凶手的证据。当然，还有人也掌握了联动成员于66年8月在北京大兴县杀死大批所谓的“黑五类”人员的证据。——这是杨尚昆日记里的内容，当然假共是否认的，还把作家师东兵逮捕判刑了，说他伪造历史，以诈骗罪判处15年徒刑。对此，人民群众应该能有判断是非的能力，而且当初把这个四五运动定性也是有证据的，是毛主席派人调查后定性的。毛主席看了有关四五运动的简报，并派秘书到天安门广场实地了解情况后说：“谁说没有政治后台？这个政治后台，你们都怕他嘛！他有社会基础，有军方保护。”姚文元证实，对七六年清明天安门事件的定性、镇压，都是由毛泽东决定的。1978年11月21、22日《人民日报》刊登的《天安门事件真相》指出：天安门事件期间，邓小平同志完全处在与外界隔绝的状态，跟事件毫无关系。这个报道百分百是假的，76年10月6日就复辟了，78年底的人民日报对邓的澄清怎么能令人相信，呵呵！\n\n　　在四五运动中，高干子弟是主要的骨干，他们忽悠人民群众去攻击毛主席革命路线的执行人，也就是四人帮，他们甚至攻击毛主席。他们当然反文革，因为文革就是斗争这些资产阶级当权派的，也就是他们的父母！文革初期，这些高干子弟甚至组织联动反革命组织，就是高干子弟红卫兵，镇压打杀革命群众和无辜人员，文革的许多血案就是他们或各地走资派镇压造反的人民群众造成的，文革后他们把这些惨案污蔑成文革的所谓罪恶！他们要的民主自由当然是资产阶级的民主自由，就是表面不分阶级的民主自由，其实就是他们官僚的自由，这怎么能容忍，当然要镇压。从这里我们就找到了所谓的民运分子的源头了！\n\n　　1979年出现的争取所谓民主自由的“民主墙运动”（海外多称之为“北京之春”）究竟是怎么回事，许多人几乎一无所知，尤其是对20世纪70年代以后出生的人来说。西单墙在北京西单十字路口东侧路北的人行道旁，几路公共汽车站都设在这里。在这些公共汽车站的后面，是一排约有200米长的矮墙。因为这里来来往往的人很多，常常有人在这排矮墙上张贴寻人启事和小广告，引人注目。从1978年春开始，有些人在这里贴大字报，看大字报的人很多，一传十，十传百，逐渐形成一个聚拢越来越多人的场所。1978年11月16日，一份署名“机修工0538号”的大字报明确指出毛泽东晚年犯下了错误。11月24日，黄翔在毛泽东纪念堂旁边的栅栏上写下了大字标语，“毛泽东必须三七开，文化大革命必须重新评价”。同一天，人们在“民主墙”上读到了对邓小平的颂扬。11月25日，一次所谓自发的“民主”会在“民主墙”前举行。  1978年12月5日，魏京生以“金生”为笔名在“民主墙”上贴出了题为“第五个现代化──民主及其他”的大字报。魏京生认为，中国除了需要当局已经提出的“四个现代化”（农业、工业、国防和科技现代化）之外，还需要\"民主\"。该文谴责了共产党的\"一党独裁\"，质疑共产党政权的“人民”特性，认为共产党政权的独裁本性是中国走向现代化的惟一真正障碍。几乎与北京同步，在全国各大城市也出现了类似的政治活动。从1978年11月11日开始，即兴聚会每天晚上都在上海市中心的人民广场举行，聚会者人数最多时达到15万人。人们讨论政治问题与毛泽东的功过是非，在激烈的讨论中，甚至出现了这样的口号，“万恶之源是无产阶级专政”、“坚决彻底批判中国共产党”。\n\n　　由于与“民主墙”相关的活动越来越多，而西单的这块围墙场地有限，无法满足人们张贴和传播文章的需要，于是“民主墙”的参与者开始组织起来，自行印刷发行民间刊物。12月中旬，《民主墙》杂志（下称《民主墙》）创刊，其功能是搜集、保存并传播“民主墙”上的大字报。12月16日，《四五论坛》问世。月底，文学杂志《今天》和《群众参考消息》创刊。1979年1月创刊的所谓民间杂志还有《北京之春》、《探索》、《中国人权》、《人民论坛》等。《北京之春》的大部分编委会成员来自干部或知识分子家庭，不少人是在校大学生或即将进入大学，其副主编是王军涛，这些人都参加过“四五运动”。他们认为，支持邓小平的政策是走出蒙昧主义与专制主义的第一步（在资产阶级分子眼中，人民的专政就是专制，人民参与文革就是愚昧，需要他们的启蒙，真是无耻到极点！）。《北京之春》在创刊号发刊词中说明，其编者是在马列主义思想光辉的指引下，支持共产党和社会主义道路。这是无耻的说法，都已经复辟资本主义了，是假共产党了！\n\n　　西单民主墙的繁荣基于复辟初假共批判华国锋的“两个凡是”和开展真理标准的大讨论。华国锋虽然是个蠢货，但他还是要坚持毛主席的社会主义路线的，他不过是个想当头的傻瓜野心家！不过他和叶剑英等抓捕了毛主席路线的执行人，走资派顿时失去了一切障碍，他的一切维护毛主席路线的言论就成了复辟头目的眼中钉了。华国锋已经没有任何力量对抗复辟后的假共头目了。1979年3月，任畹町等人在西单民主墙贴出《中国人权宣言》。随后的3月25日，魏京生贴出《要民主还是要新的独裁》。二者以西方的人性自由和人权保障质询中国新一代领导，要求全面的西方式的民主化和自由化。看看这些家伙宣传的是什么民主自由，就知道这些东西是什么货色了。与西单民主墙同时期的关于真理标准的大讨论，随后的平反所谓冤假错案，为农村四类分子脱帽，取消家庭成份的划分，以及文化、艺术、教育禁区的被突破。其实就是给剥削阶级平反，让资产阶级文化自由发展。网上有文评价民主墙运动和邓小平的所谓实事求是，解放思想的影响，释放了被政治与思想禁锢的中国人，尤其是知识分子和精英阶层沉埋已久的对民主、自由、博爱、平等，以及物尽其用，人尽其才理想国度的向往与追求。这句话是关键，就是让官僚和资产阶级知识分子翻身解放。\n\n　　这个民主墙运动，许多资产阶级文痞说是自发的，是历史的必然产物，是所谓人民的觉醒。让我们看看师东兵披露的杨尚昆回忆录里是怎么说的：1988年7月14日：\"耀邦告诉我，没想到小平同志这么霸道，听不得任何的不同意见。竟然搞垂帘听政。很后悔采用卑鄙手段搞倒华国锋，扶持邓小平。耀邦说，西单民主墙就是在邓小平的怂恿下搞起来的，目的就是搞臭华国锋，让邓小平上台。但没想到，邓小平上台后便把民主墙封掉了，把魏京生也抓进了大牢。\" 西单民主墙就是邓幕后操纵的，甚至制造的。为他攻击华国锋的两个凡是（其实两个凡是也是邓的狗腿子文痞制造的，然后华国锋念潜伏在他身边的邓的文痞制造的稿子后，就说是他华国锋说的）制造民意基础。其实，我们可以通过西单民主墙的内容进行判断，怎么那么巧，西单民主墙的大字报内容里，有人要重新评价文革，有人要给毛主席三七开，说毛主席晚年犯了错误，这不都是以后邓小平给毛主席安的罪名嘛！民主墙的内容几乎都是宣传资产阶级民主自由的，还有攻击无产阶级专政和共产党的，这基本就是最早的民运分子的开头了，还不是源泉，源泉是四五运动，但影响大的却是西单民主墙。看看吧，西单民主墙运动创办的《北京之春》的大部分编委会成员来自干部或知识分子家庭，不少人是在校大学生或即将进入大学，其副主编是王军涛，这些人都参加过“四五运动”。大家明白了吧，这些家伙基本全是资产阶级家庭或走资派官僚家庭出身！他们当然宣传西方资本主义的所谓民主自由了！这些高干子弟当然是听命于邓的了，这个西单民主墙运动也就是邓操纵的无疑了。这里有几个人，在当今的海外民运分子中很有名气的，一个是魏京生，一个是王军涛，还有一个是徐文立。魏京生是被称为中国民运之父，徐文立被称为民运教父，这几个人都是西单民主墙里展露头角的。其他两个人的家庭背景不清楚，但这个魏京生可是高干子弟，魏京生的父亲魏梓林是空军司令吴法宪的嫡系，最高官职是军级。魏京生文革时候是联动反革命分子，联动是高干子弟红卫兵，被毛主席定性为反革命组织。魏京生作为“联动”干将到处逞强打斗。在联动猖獗期间，魏京生强奸了藏族学生平妮，并强迫其同居，任其泄欲。西单民主墙最后被邓小平镇压了，因为他攻击华国锋的目的达到了，还有当时毕竟是刚刚复辟，也不适合过度地宣扬资产阶级的民主自由。他把魏京生等抓起来，忽悠人民。其实魏京生之类不过是他的走狗而已，他们是互相配合欺骗人民群众。后来，邓小平还搞了反资产阶级自由化运动，以标榜他是坚持社会主义道路的，以此欺骗人民群众。\n\n　　魏京生曾经是文革中著名的极端造反派“联动”的成员，后来入伍，退伍后进入北京动物园做了一个平常电工。1978年，中国在文革之后开始“拨乱反正”，开始进行以经济建设为中心的改革开放。其时，也适逢“西单民主墻”运动如火如荼之时。当时的魏京生每天除了偷听大陆禁止的“敌台”之外，就是在“西单民主墙”上贴大字报“造反”，声称要推翻中共政府“搞革命”；还数次向驻北京的法国外交官提供当时中越战争的军方文件。1979年，他被大陆警方逮捕，以泄露国家机密罪和反革命煽动罪获刑15年。——这是某个海外网站对魏京生的简介，呵呵！一个普通的电工能获取国家军事机密文件，简直是笑话。\n\n　　\n　　随着复辟资本主义而带来的官僚腐败问题，在80年代中后期逐渐凸显出来。1985年11月初，原中国科技大学副校长方励之和原全国作家协会成员刘宾雁到交通大学、同济大学对学生演讲，鼓吹全盘西化。在这些民运分子的煽动下，86年就出现了学潮运动。最终，1989年的大学生反腐败，反官倒的64学潮运动爆发。这场最大的维权运动是借由悼念胡耀邦的死引起的，许多老百姓认为胡耀邦，赵紫阳是好人，其实这是不懂政治和两条路线斗争的误解，他们怎么可能是好东西。1976年10月复辟资本主义后，上台的都是坚定地追求资本主义道路的资产阶级政客。否则他们也不可能上台，资产阶级是最讲阶级成分的，最讲政治可靠的，当然他们是不会说出来的。这两个东西是坚定地反文革反毛主席的畜生，他们和邓的分歧或斗争不过是资产阶级内部的狗咬狗而已！不错，胡耀邦可能是反腐败的，但反腐败只会更好地维护资本主义体制。赵紫阳不同意开枪镇压学生而被软禁，因而很能引起人民的同情和拥护，这点应该是他更具欺骗性的原因。他不过是不想留下历史骂名，成为千古罪人，或者怕受到追究连累后人。赵紫阳文革中镇压过革命群众，而那个学生们悼念的胡耀邦，在文革中却镇压过学生。这些当时的大学生多数都不知道，就是现在知道的人民群众也不多吧，这都是历史事实。64的悲剧在于当时的人民群众和大学生都没有认识到当时的社会已经是被复辟的资本主义社会了，而腐败是私有制社会的不治之症，反腐唯一的办法是推翻资本主义私有制，重建社会主义公有制，维权是行不通的，只有造反夺权才是唯一出路。反腐败维权，结果就是与虎谋皮以悲剧收场！89年的学生反腐败事件中活跃着民运分子，这些人有方励之，李淑娴、王若望、刘宾雁、严家其、柴玲、 乌尔凯西、王丹等。其中，方励之，李淑娴、王若望、刘宾雁是老家伙，在毛主席时代，他们中有几个人57年被划为右派，都是坚定地追求资本主义民主自由的畜生。严家其当时是中年，曾在赵紫阳领导下的“政治改革办公室”工作。柴玲、 乌尔凯西、王丹等是当时的年轻大学生，他们可能是被忽悠的，或本身就是追求资本主义的东西。这些所谓的民运分子，其实就是毛主席当年划的那些右派思想的东西，就是要走资本主义道路的恶畜，打扮成为民的样子，忽悠人民追求欧美的资本主义民主自由。\n\n　　可以看出，这些东西许多有假共政府背景，严家其曾在赵紫阳领导下工作，方励之，刘宾雁，王若望在邓的反资产阶级自由化中被开除出党。似乎邓是坚持毛主席路线的，其实这是误解，邓不过是不急于彻底资本主义化的政治改革而已，继续挂着共产党和社会主义的招牌欺骗人民群众，还有稳住当时的那些所谓的坚持毛主席路线的左派，就是邓力群等人。这些所谓的左派连经济基础决定上层建筑都不懂吗？已经复辟资本主义了，还不知道吗？ 经济基础变为了私有制，虽然还保留了些公有制的基础，当然会改变上层的意识形态的。他们不过是在做徒劳的坚持，或者根本是和邓贼互相配合欺骗人民群众。现在还有假左忽悠人民有党内健康力量，就算80年代有几个，但新世纪都过去十多年了，还怎么可能有健康力量在党内，这样的人也不可能被假共容忍存在的。邓是怕过早暴露自己的真面目于己不利而制定了所谓的四项基本原则和开展反资产阶级自由化的运动。虽然邓小平从1986上半年开始，在内部讲话和同外宾谈话中，开始反复谈到政治体制改革问题，但重心是行政改革。行政改革的重点内容是权力下放，这就是让官僚贪腐，作为逐步彻底复辟的一种手段。显然不是西方资本主义化的政治改革，但假共党内有些家伙，如胡耀邦赵紫阳等就是急于求成的要把政治彻底西方资本主义化，要脱衣摘帽，因此与邓小平产生矛盾。胡耀邦亲自上阵，号召全国民众吃东西改用刀叉。表面理由是用刀叉比筷子卫生，实际上要改变中国人的生活习惯。当时香港电视反复播出有关镜头。电视系列片《河殇》是一部否定“龙文化”、“长城文化”、“黄河文化”，倡导西方蓝色文化，污蔑中华民族炎黄子孙的坏片子，赵紫阳公开支持，让它增加拷贝到处放映。这都是他们要彻底西化的表现。最后，1987年初，胡耀邦以反自由化不坚决等原因被邓赶下台。1989年4月，他的死引发了64学潮。此后，他和赵紫阳成了民运分子所谓的中共（其实是假共，民运分子是不区分的，好忽悠人民群众反对真正的共产党和共产主义）内有良心的政治家，很大程度上成了他们的精神领袖和偶像。因为这些民运分子骨干基本都是胡耀邦，赵紫阳等人的心腹。\n\n\n　　赵紫阳下台的原因很偶然，即他在5月16日会见戈尔巴乔夫时，在和戈尔巴乔夫的会面中，赵紫阳透露：我们所有重大决定都要请示小平同志，邓小平虽然退休了，但他在中共党内的决策地位不变，遇到最重大的事情，我们需要向他请教。赵紫阳在接见戈尔巴乔夫时透露了邓小平的幕后老板地位，并被中央电视台做了公开报道。这是赵紫阳想把一切责任都推给邓小平，面对学生运动时，赵紫阳甚至以为，这可能是他借助学潮逼退邓小平的一个机会，然后由他独掌大权。社科院政治所前所长严家其（在赵紫阳的“政治改革办公室”工作）和已故自由派知识分子包遵信等人发表《5·17宣言》，把矛头直接对准邓小平，呼吁结束老人政治。学生们也打出了“要廉政，不要垂帘听政！”“不要中国特色的摄政王！”等标语口号。其后，有人开始冲击邓小平位于景山后街的住宅，并在天安门广场上出现了打倒邓小平的口号。邓小平遂决定把赵紫阳赶下台。\n\n\n\n　　王丹是方励之家中沙龙上的常客，同样的常客还包括赵紫阳身边的那几个智囊，说穿了王丹不过是假共内部急于彻底西方资本主义化的赵紫阳等在学生运动中的传声筒和联系人。他的言行来自于智囊们的指导。维吾尔族的吾尔开希的父亲隶属于兰州军区空军，吾尔开希是从兰州乘空军专用飞机逃至珠海的。后到澳门，再转香港前往法国。没有假共高层的默许，他乌尔凯西的父亲能随便调动军机？！柴玲是1989年六四天安门事件中第一位撤离广场的学生领袖，当年与封从德是夫妻关系。她在学运后期坚持与当局继续抗争，曾在法国访问中坦言预计会在6月4日出现流血事件，但称“宁愿看到流血”，要用流血来唤醒国民，仍然坚持运动而不让学生撤走，自己却单独离开。在绝食过程中也被人披露其偷偷独自进食，被不少人认为她是一个不顾其他人性命的人、自私的人。可以看出柴玲，王丹，乌尔凯西等是打入学生内部的卧底，这些民运分子推出自由女神像，为邓小平和贪官们制造镇压学生的足够的借口，指责学生是要搞资本主义，是反革命，使得假共站在了舆论高地，这样才能彻底清洗贪官的反对势力，同时把奴性恐惧重新深深地植入人民的灵魂深处。柴玲等许多民运分子领袖能安全地逃出全城戒严的北京，也就毫不奇怪了。普通学生死了那么多，学生领袖都安然无恙，呵呵！他们不过是被假共有意地通过这种方式安排到国外，在海外以反共，彻底看清共产党，看清共产主义罪恶的面目出现，通过广播等媒体欺骗国内的人民群众，让人民仇恨共产主义，仇恨毛主席，达到搞乱颠覆人民思想的罪恶目的。这样的欺骗忽悠才是最高明而不易被人发现的。假共是无比阴险毒辣的。\n\n　　《王丹人品低劣 来港所为何事》一文指王丹“根本就是一个人品低劣、财色皆贪的市侩小人，被人讽为‘朝求台湾财，暮伴台男睡’。”这是来自台湾传媒及其他媒体的大量报道。 “民运人士”中人品低劣、财色皆贪的市侩小人不胜枚举。从王炳章假护照事件、彭明假钞票事件、王希哲大闹国会、魏京生自我沉沦、吾尔开希夜总会召妓、胡平虐打前妻致残，到柴玲信用欺诈、刘青私吞公款等等，“民运人士”的丑闻不胜枚举。王丹还经常光顾台湾的同性恋场所寻欢，与一批又一批男同性恋者约会，直至被台湾《TVBS》周刊曝光。他们20余年前在北京曾经把自己打扮成“反腐败”的英雄。经过20余年的反覆表演，恰恰充分证明，他们本身就是一股最为腐败的政治势力。一位曾是“圈里的人”，把这帮人搞的所谓海外“民运”形容为“奸商宵小贻害无穷”的“丑陋的海外民运”，“差不多成了几个争地盘的流氓团伙”，“民运人士”王希哲也曾自揭说，民运中百分之九十五都是“坏人”。在海外民运分子的基地美国，上演了一幕幕令人恶心的丑剧，或令人捧腹大笑的闹剧！ 从前面的一些资料信息可以看出这些民运分子基本都是出卖灵魂的狗，他们的行为也就没什么奇怪的了，呵呵！就算不当狗，追求资本主义的能有几个好东西，都是畜生！\n   \n　　这就是假共通过西单民主墙和89年的最大的反腐维权运动制造的两拨所谓的民主人士，海外民运分子，当然国内也有这类民运分子，他们和国外的同行内外遥相呼应，共同欺骗愚弄人民。还有不少被他们欺骗的小右民运，就是被他们忽悠的，或本身也是追求资本主义的垃圾！\n\n　　民运分子说，知识分子是社会的良心，基本就是指他们自己，往自己脸上贴金，其实这是极度无耻的欺骗。知识分子不能说全是，但多数是资产阶级思想的，这已经在复辟近40年，由他们自己淋漓尽致地表现出来了！社会的良心当然有，但多数却不是什么知识分子！民运分子欺骗人民的方法有许多，如我在《揭秘资产阶级骗人常用政治概念词汇》一文中揭露的那些欺骗性政治词汇，就是他们经常反复使用来欺骗人民群众的。一谈到当今中国的社会问题，他们就会说是制度或体制问题。中国当今的问题是制度问题，这没有错，但他们却不说明当今中国是什么社会制度，就是有意地误导欺骗人民，让人民认为中国的问题是社会主义制度导致的，是共产党造成的，是毛主席造成的。其实中国当今是被复辟倒退的资本主义社会，挂着社会主义的招牌而已。中国当今的一切社会问题都是资本主义制度造成的，是戴着共产党帽子的假共邪党造成的，是复辟的罪魁祸首邓小平、李先念、叶剑英等和被他们利用的傻瓜野心家华国锋造成的，与毛主席他老人家没有丝毫关系！\n\n　　紧接着中国89年的反腐维权运动，被苏联假共集团操纵的东欧假社会主义国家的假共产党们纷纷倒台，苏联默许了这些，也为苏联假共制造假政变解体苏联摘去共产党帽子做了周边国际的环境舆论准备。1990年美国进行高科技海湾战争，1991年12月25日苏联假共集团制造假政变解体国家成功。被世界3年内的剧变吓破胆的邓小平，在苏联解体仅仅24天后，1992年1月18日，他急如星火“南巡”，气急败坏“不争论，大胆地试，大胆地闯”、 “主要是防止‘左’”、“计划经济不等于社会主义”、“市场经济不等于资本主义”、“发展才是硬道理”、“不问姓社姓资”，不顾一切全面投降，试图用大规模搞资本主义私有化经济来博得美国欢心以逃避美国的锋芒，此后假共彻底沦为美国的狗奴才。如果说78年邓唆使万里去安徽小岗村制造分田单干骗局，瓦解了农村的公有制经济基础的话，他的这次所谓的南巡是进一步加剧瓦解了公有制经济基础，为以后的彻底颠覆社会主义公有制经济作了一个非常重要的铺垫。从邓贼的南巡之后，中国的工人大规模下岗开始，到98年禽兽魔鬼朱镕基上台，进一步加剧。这个朱镕基简单说明下，这个畜生是极其恶毒的禽兽，有太多被欺骗的群众，认为他是大清官，真是糊涂！说一个人好坏，就要说明原因。假共媒体一忽悠他是大清官，许多人也就认为他是大清官，这是十分幼稚的！反腐败要依靠群众运动，不能幻想和依靠所谓的清官反腐，而资本主义私有制下反腐败也是不可能成功的事，因为腐败是私有制的不治之症，必须首先推翻资本主义私有制。朱镕基是假共复辟以来除邓贼之外最恶毒的畜生！他本身就是贪污了数十万亿元人民血汗的窃国大盗式的巨贪。教育产业化、医疗产业化、住房产业化就是此畜上台搞的，仅此一点就使人民背上沉重的大山。他早已经被中革中央旗下真共党评选为百大恶人！中革中央官网有极其详尽的资料说明他罪恶滔天不止。这里就不详细说明了，因为不是重点。面对这罪恶的所谓改革，人民生活在水深火热中，而被软禁的民运精神领袖赵紫阳却说这改革好的很，民运分子认为改革还不彻底，只进行了经济改革，政治没有改革。他们说的政治改革无非是三权分立，多党制，宪政等西方资本主义的政治制度。这些欺骗性的政治词汇，我在《揭秘资产阶级骗人常用政治概念词汇》一文中都详细的揭穿了！赵紫阳虽然2005年下地狱了，但他还有个秘书叫鲍彤，也被所谓软禁中，经常接受外国媒体采访攻击共产党，攻击毛主席。当然，这个鲍彤是不分真假共都攻击的。就是故意让人民仇恨真正的共产党，把假共的恶行都推到共产党身上。甚至说现在的一切都是共产党和社会主义造成的，是毛主席造成的，和假共配合互相欺骗人民群众。目的是让人民仇恨共产党，仇恨社会主义，仇恨毛主席，逐渐消除真正的共产党，真正的社会主义和毛主席在人民心目中的伟大印记。\n　　\n　　邓小平等还是不愿意摘掉共产党的帽子过早暴露自己的面目，一是怕过早暴露于己不利，另一是为了更好地欺骗掠夺人民。而赵紫阳等是想摘去帽子的，这保帽派和摘帽派基本没有本质的矛盾仇恨，64学潮导致了官僚资产阶级中的“保帽派”与“摘帽派”的冲突。结果是两派几乎毫发未损，该当官的当官，该出国的出国，死伤受损的是反对官倒的学生和人民群众。事件过后，两派在美国主子调和下进行了苟合。许多胡赵集团的人物登上假共上层建筑。现在假共党内还有胡耀邦和赵紫阳的心腹，如温家宝是胡耀邦提拔的，在1989年天安门学潮时候，赵紫阳去天安门广场的大客车里对学生讲话，温家宝陪同。可以说民运分子就在台上，他们就是想摘掉共产党的帽子，以十大家族为首的官僚资产阶级，要彻底实现西方资本主义的政治制度。到今天，保帽派的影响已经被边缘化。因为随着资本主义复辟的逐渐深入明显，许多原来的保帽派也想摘帽了，以此保住自己的抢劫成果。只不过现在的摘帽派，已经改头换面，叫做普世价值派。\n\n　　为摘帽，他们不断制造事件，以此探测民意。他们在国内又弄出些个所谓的民主人士，如胡佳，艾未未等等，还有毛主席时代的一些老右派分子，如茅于轼、铁流等老畜生，用他们欺骗人民。民运分子不能说全是假共的狗，但多数是，少数是被欺骗忽悠的，误以为西方的政治制度能给中国人民以人权民主自由等等。假共把魏京生，何清涟等以各种名义放逐到美国，在国外通过广播网络等欺骗国内民众。新西山会议（另称杏林山庄会议），是2006年3月4日在北京西山杏林山庄，由中国经济体制改革研究会会长高尚全组织的一次闭门秘密会议，正式名称为“中国宏观经济与改革走势座谈会”，后在网上被和西山会议相联系，被称为新西山会议。主要参加者有贺卫方、张维迎、杨东平、石小敏等。会议后不久，其会议纪要即在网上泄漏，在网上引起了激烈的论战。其实，这不过是假共让狗叫，然后故意放出他们的会议纪要，刺探民意。这个所谓的会公开要求进行资本主义的政治改革，要求实行多党制，公开叫喊共产党没有注册登记，共产党“非法”等等。这其实都是天大的笑话，当年毛主席领导的真正的共产党要推翻国民党，精神错乱才会去国民党那里注册，难道毛主席会精神错乱吗，还是他们这些狗奴才精神错乱？就是真去注册，国民党能给注册吗，呵呵！假共黔驴技穷，让狗奴才们抛出这种低级的论调，呵呵！2008年工贼李瑞环提出，为体现国情，倡议共产党改为人民党或社会党。这都是他们急于要摘帽抛出的笑话。结果遭到多数人的反对和讽刺，当然就不了了之了。因为中国经历过社会主义，人民经历过伟大的文革，可以很清楚地看出他们的把戏。\n\n　　2008年12月10日，一份由303名所谓中国公民签署的《零八宪章》在互联网上流传、并征集公众签名。这是刘晓波抛出的，刘晓波参加过89年的学潮。这个宪章说明是这样的：为了纪念“中国立宪百年，《世界人权宣言》公布60周年，‘民主墙’诞生30周年，中国政府签署《公民权利和政治权利国际公约》10周年”，303名中国知识分子、企业家、农民和普通市民在《零八宪章》上签字，要求中国政府实现最大程度民主、尊重人权。这一文件，旨在依照一九七七年捷克斯洛伐克知识分子、活跃分子联名发表的《七七宪章》的形式，呼吁前东欧各国政府尊重人权。\n\n　　我们从发起签署的303人看“中国《零八宪章》”闹剧，这303人中，自称工人的5个，占1.65%，自称农民的8个，占2.64%。自称工程师的10个，占3.30%。自称的职业属于“知识分子”的199个，占65.68%，自称的职业属于“政治活动分子”的57个，占18.81%——“知识分子”与“政治活动分子”加起来共256人，占84.49%。头两批签名有鲍彤、方励之、严家其、王军涛、王丹、刘晓波等人，这都是假共的狗，在历次的重大历史事件中都有他们的魔影。由此可见，闹“中国《零八宪章》”的基本是一群所谓“知识分子”、“知识界”、“知识型”的“文氓”、“文痞”兼“文丐”的酸臭文人。这都是假共导演的，一计不成，再施一计，反复欺骗人民群众。欺骗人民去相信西方资本主义国家的政治制度能够给人民带来民主自由等等。现在是2014年6月份，网上看这个签名已经有30批了，基本都是资产阶级知识分子，有几个所谓的工人和农民，可能是冒充的，有些身份为学生的应该不少是被欺骗的，有所谓的维权人士，还有不少只署名公民，真可笑。无论什么国家，工人农民等劳动人民是主体，没有他们的民主，根本不能称之为民主，这些08宪章签名人基本都是知识分子，所谓的社会良心，看看他们是什么良心，不过是想实现资本主义的民主，就是少数剥削阶级的民主，不要说他们都是被假共逼迫欺骗人民的，多数是真心追求资产阶级民主的，他们在真正的共产党时代确实感受不到他们要的民主，他们绝不是为了劳苦大众的社会良心，他们真的是良心大大的坏了！\n\n\n　　民运分子还帮助不少被假共欺压残害的人民群众进行维权，目的是扩大自己在民众中的影响，提高民运的威望，更好地欺骗人民接受他们的虚假的政治理念。维权在私有制下基本是毫无用处，89年的反腐败反官倒就是最大的维权，结果就是与虎谋皮。有个新公民运动，是由许志永主持的公民组织（前身为公盟），提倡以“自由，公义，爱”为主旨的一系列活动的统称。新公民运动的纲领诉求：其一是政治的，即推动整个国家以和平方式朝向宪政转型；其二是社会的，即推动整个社会从臣民社会朝向公民社会转型。“新公民运动”这个名称是许志永在2012年5月发表的纲领性文章《中国新公民运动》中提出并正式开始使用的。新公民运动倡导大家堂堂正正做公民，告别“推翻、打倒、敌人”等专制理念，践行自由、公义、爱的新公民精神，以建设心态推动民主法治，在服务社会中成长为体制外健康力量（他们不过是假共体制外豢养的狗，也许本身就是假共体制内的装扮成体制外人员忽悠欺骗人民群众），最终推动中国以最小代价完成宪政文明转型。这些完全是虚假的资产阶级的政治概念，就比如敌人，难道不提这个词，就没有敌人了吗，太幼稚可笑虚假了！这应该是假共欺骗人民不要革命，要维权，目的是维护假共政权的稳定。\n\n\n　　2011年初，民运分子又搞了个茉莉花的革命事件，他们宣传说：中国茉莉花革命指的是中华人民共和国的人民受突尼斯茉莉花革命的影响，为结束中国共产党一党专政和独裁统治而号召中国民众在2011年2月20日于中国13个城市的闹市或广场举行名为\"茉莉花活动\"的集会。部份维权律师和网络活跃人士被逮捕。其实，这也不过是出闹剧，当时各个城市也没有多少人响应集会。“革命”集会基本是警察、记者以及围观民众组成。假共目的是借此摘帽或维稳，如果集会有大规模群众参加，那么假共会故意与潜伏在民众中的他们的狗，也就是民运分子对话，做出支持人民呼声的表示，并会说社会主义的历史实践出现了重大问题，社会主义带来了许多罪恶，发现共产主义是不可能的，走不通，响应人民的要求做西方式的政治改革，作为反体制的英雄摘帽保住掠夺抢劫人民的生产资料等巨额财产！人数少，更好办，就说这是西方策划的反华阴谋，要推翻社会主义，为维护社会主义优越制度，坚决镇压，加强维稳控制人民！为此，他们不惜请美国大使洪博培出现在北京街头！网上有文章《为何都愿意去争当“中国茉莉花革命”的发起者》，此文披露了一些有名的海外民运分子（王丹等）争当所谓茉莉花革命发起者的事，该文作者显然是个小右民运分子，他指责这些人不依靠民运大团队，不考虑国内实际。这应该是被欺骗的小右民运分子，他哪里知道这些人是假共的狗，不过是想操纵所谓的茉莉花革命而已，就像他们在89年卧底学潮运动一样。\n\n　　如今，假共看到摘帽基本不可能成功了，也就抛弃了民运分子了。但他们中一些人还不明白，继续忽悠西方的民主自由，制造事端，结果就被主子镇压抓捕了。其实，许多未必是不明白，其实是有野心的。他们许多也想通过搞各种事件，像89年64那样，利用人民群众的血肉，夺取假共主子的政权搞他们当主子的资本主义，做人上人，极其险恶毒辣。民运分子介绍到这里，也就彻底把他们解剖了，让他们彻底暴露于人民面前，人民看过后，应该彻底看清他们的丑恶嘴脸了，应该明白这些忽悠资本主义民主自由的恶狗的罪恶目的了！\n\n\n　　下面介绍，假共的另外一个重要的狗团队，就是假左。何谓假左？就是打着左派，毛派的招牌，不去推翻假共的资本主义社会，却忽悠人民把假共当真共，忽悠人民去保党救国的骗子和狗奴才。民运分子欺骗没有经历过毛主席时代的年轻人还可以，他们根本忽悠不了太多经历过毛主席时代，尤其经历过文革的中老年人。因为当今的众多中老年人是经历过文革的，他们不好欺骗，也因为假共复辟以来的各种资本主义社会的不治之症都发生，发展到彻底暴露的程度了，所以有必要弄出这个忽悠骗子团伙。更主要是为了对抗当时的无产阶级革命导师周群老师公开提出的推翻假共的革命主张。下面是引用的周群老师揭露假左的文章部分内容。\n\n　　这场二零零二年启动的无产阶级大革命浪潮虽然掀起之初就明确了：以毛主席一生成就推翻资本主义私有制建立社会主义公有制为这场大革命的方向目标！可是，后来却遭到了走资派躲在幕后暗中推出一批假冒左派的太监文痞、御用文犬的捣乱破坏，这些走资派的太监文痞、御用文犬争相在走资派背后支撑的乌有之乡网站上大叫大喊自己是毛派、左派，然后它们又把毛主席推翻资本主义私有制的主张改换成了不仅不反对资本主义私有制还要大家都去紧跟资产阶级总后台头领的主张，以此搅混视线的方式来对这场无产阶级大革命进行捣乱破坏，以致令无产阶级大革命浪潮几度被打压至濒临绝境的危险地步。走资派所控制的太监文痞、御用文犬身后竟然都能够很跟上了一大批的小狗假左，声势浩大地来与无产阶级革命真左派争夺左翼宣传舆论制高点，要把左派唤醒中国人民一起推翻资本主义私有制的革命方向目标，改换成它们的让中国人民一起不仅不反对资本主义私有制还要都去紧跟资产阶级总后台头领的反革命方向目标。特别是太监文痞张宏良屁股后面紧跟着的大批小狗假左，居然还有胆量直接攻击无产阶级革命的造反有理精神，把中国人民实践马列毛的造反有理言行污蔑成是汉奸买办沉船派。张宏良及其走狗奴才恶意绕过无产阶级专政体制的船早已在一九七六年后就被走资派砸沉的历史，反倒说现在的资产阶级专政体制的船绝对不能被砸沉，如果资产阶级专政体制的船被砸沉那就会导致中国从地球上消失了，它们这是在恶意回避唯有砸沉资产阶级专政体制的船才能使得无产阶级专政体制的船浮起来的事实，更恶意回避当年毛主席就是砸沉了资产阶级专政体制的船才让无产阶级专政体制的船浮起来实现了无产阶级专政体制，以及解放后刘邓率领走资派实施走资步骤时毛主席就义正辞严说如果再搞资本主义私有制毛主席就要带领解放军重上井冈山的历史，张宏良及其走狗奴才就是以此胡说八道谬论来破坏无产阶级大革命浪潮，进而维护它们所要维护的资本主义私有制社会的。\n\n\n　　事实上，无论有没有我们无产阶级革命先锋队，也不管有没有假左的捣乱破坏，这场中国人民为了能够生存而消灭剥削压迫的大革命都是会爆发的，其有所不同的是这场大革命过程中的中国人民伤亡率大小。如果中国人民能够在我们无产阶级革命先锋队引领下，形成了具有凝聚力、向心力和号召力的推翻资本主义私有制建立社会主义公有制的革命方向目标，那么中国人民就会团结一致、万众一心走到一起劲往一处用、力往一处使，这样就能避免被奴性折磨造成和无序暴动造成的伤亡率，使得中国人民在血腥灾难来临时少死很多人。但话也要讲清楚，假左非但是这场无产阶级大革命浪潮的头号敌人，并且至目下假左也已经导致中国人民的明确革命方向目标进程被延迟了，而进程延迟所致的中国人民被奴性折磨造成和无序暴动造成的伤亡率将由假左全额承担，哪怕假左逃到天涯海角，中国人民也绝对不会放过，一定血债血偿追缴到底！\n\n\n　　这就是周群老师揭露假左的内容，假左是假共豢养的狗，装扮成左派、毛派忽悠欺骗人民不但不要革命，还要去保假共党，救资产阶级国，是万分邪恶的。假左有好多忽悠欺骗人民的网站，如乌有之乡，毛泽东旗帜网等等。还有许多欺骗人民群众的假左头目，如孔庆东，韩德强，张宏良，司马南等等。这些假共的大狗下还有许多小狗，在假左网站发文章，在IS，YY等语音聊天软件里建设频道，忽悠欺骗人民群众，如长征，前进，红旗等假左建立的聊天频道就是专门忽悠欺骗人民群众的！这些假左除了忽悠人民，还经常通过他们的言行抹黑毛派的形象，用以增加人民对毛派的反感，用心险恶无耻至极！张宏良就是其中一个很有名的假共狗文痞！这个假共狗奴才揭露现在资本主义社会下的黑暗，用以吸引群众的注意和好感，好兜售他骗人的黑货。当然，他是不会说现在是资本主义社会的，他忽悠人民：党虽然腐败了，但党内还有健康力量，要人民群众相信并依靠所谓的健康力量，要保党救国。他还忽悠说没有阶级了，说什么有586电脑的是资产阶级，还是286的是资产阶级，公开无耻抹杀阶级的存在。无产阶级和资产阶级的区分不是个人生活资料的多少，而是是否占有生产资料！假左的忽悠口号主要有保党救国，大众民主，共同富裕，反腐锄奸。\n\n　　反腐败，反美，反转基因，反汉奸，挺胡锦涛，挺习近平或挺薄熙来是假左的几个忽悠欺骗主题。先说反腐败，腐败是资本主义私有制下的不治之症，在私有制下根本反不掉的，有些被查出的腐败官僚也是权力斗争的牺牲品罢了。要真正反腐，必须首先推翻资本主义私有制才可以。假左大小头目不是不懂，就是故意把次要矛盾当成主要矛盾去转移人民的视线。反美也是个重要的欺骗主题，2009年假共的鹰犬戴旭渲染中国被美国C型包围了，借以把阶级矛盾转移到民族矛盾上，阻挡人民的革命，维护假共的罪恶统治！其实，假共高层，甚至中下层的许多官僚都把财产转移到欧美了，老婆情妇子女等亲属多数都移民欧美或取得欧美国籍了，假共彻底投降欧美出卖国家民族的一切利益，美国怎么可能打击中国，美国进行战争是为了利益，假共大家族出卖了国家民族的一切，美国再打中国不是多此一举嘛！假左团伙也一直在忽悠人民，中国的问题是美国造成的，美国控制了中国的经济，当前矛盾是民族矛盾，忽悠人民中国28个主要行业有21个被美国控制了，张宏良更是耸人听闻地说中国的自来水都被美国控制了，欺骗人民去反美。中国现在各种社会问题都是复辟资本主义私有制带来的，即便美国控制了中国的一些行业，也是假共汉奸带路党引来的。张宏良极其无耻，把要推翻假共的真正的毛派左派污蔑成是汉奸买办沉船派或带路党。其实这些称呼给他的主子正合适。反汉奸也与反美紧密相连，假左忽悠人民去反茅于轼、袁腾飞等小汉奸，说他们卖国，忽悠美国的价值观，反毛等等。其实，没有假共默许纵容，甚至幕后操纵这些东西，这些东西能在各种媒体忽悠美国的民主自由吗，能公开发表咒骂毛主席的文章视频吗？！这些他们所谓的汉奸就是老右派，或民运分子，他们是假共的另一条狗，经常和假左互相攻击欺骗人民。两个骗子有共同的主子，他们互相咒骂，不知道内幕的人民群众还以为他们是仇敌呢！假左所谓的这些小汉奸卖国，基本是胡说八道，他们有权力卖国吗？？？许多不过是发表了些汉奸言论而已。 真正卖国的是大汉奸，就是台上的假共大头目，邓胡赵江朱胡温习李之类。假左是反小汉奸，不敢反大汉奸，大汉奸是他们的主子。假左头目张宏良挺胡锦涛，骂温家宝，说温是大领导更是无耻。仿佛问题都是总理造成的，和胡无关，真是可笑。习没上台他就挺习，在这些狗的心中，谁是一把手谁就是健康力量，就是毛派左派的天然领袖，大家就要紧跟，可笑无耻之极！76年复辟以来上台的一把手二把手之类的假共大头目没有一个是好东西，都是坚定的资产阶级政客，否则他也不可能上台的。目前假共党内根本没有什么健康力量。大众民主，共同富裕更是欺骗，在资产阶级霸占生产资料的情况下，人民大众怎么能有民主，怎么能实现共同富裕，简直是笑话！\n\n\n　　2010年，张宏良又忽悠大家反转基因，说转基因对人有害，能让人绝育断子绝孙。这又是假左忽悠人民，转移革命目标的手段。无论转基因有害还是无害，在资本主义私有制下，在假共掌握政权的情况下，根本是反不了反不掉的。只有推翻资本主义私有制，推翻假共的罪恶统治，才能反转基因，才能消除资本主义带来的一切罪恶！张宏良不是不懂，他只不过是把将要爆发的革命引向别处，延长假共的生命，从主子那里领到更多的骨头而已，也制造了更多的人民血债！因为假共晚灭亡一天，就有更多的被残害的人民群众。结果4年了，三大主粮全部转基因了。这就是反转基因的结果，也证明了周群老师讲的必须推翻资本主义才能反转基因的论断！\n\n　　薄熙来从2009年开始，在重庆唱红打黑。不久，张宏良、孔庆东、司马南等公开支持挺赞薄熙来。说他是毛泽东思想的继承人，甚至吹捧他是薄泽东。毛泽东思想是什么？周群老师有非常经典的论述，那就是：推翻资本主义私有制建立社会主义公有制的经验教训的总结！唱红歌，打击黑社会说明不了什么，这都是形式，何况薄熙来所谓的红歌里，还有改革复辟以来的黑歌。资本主义私有制社会，如意大利、美国等也打击黑社会，所以薄熙来的打黑更说明不了什么！薄熙来一家三代都不是什么好东西，其父薄一波是叛徒，给大贪官刘青山求过情。薄熙来是文革中的联动反革命分子，改开后在辽宁镇压过工人运动，2009年他在重庆抓捕毛共成员。他的儿子薄瓜瓜是拿着人民血汗留学的纨绔子弟。他的这些唱红打黑的举动不过是为了配合胡锦涛的假政变阴谋！一直以来，反动派胡锦涛致力于维护资本主义私有制，残酷剥削压榨中国人民，疯狂镇压各地人民群众的反抗运动，中国人民的血债能量与日俱增。为了破坏革命，反动派胡锦涛利用假左将革命阵营与人民群众相隔离，通过反转基因、反汉奸，支持赵东民、红歌会等手段转移革命方向甚至将想要革命的人民群众打成反革命。在资产阶级政府内部，其手段之阴险毒辣，无人能及。\n\n　　反动派胡锦涛非常明白，如果不能卸掉中国人民的血债能量，自己一生奋斗的结果换来的将是子孙后代被起来后的中国人民无限止的追杀，自己家族将会成为中国人民锁定的血债血偿的对象。因此，胡锦涛在最后的任期内，一切努力都为卸掉自己家族欠中国人民的血债能量。胡锦涛设计的是假政变阴谋——利用体制内的薄熙来将自己赶下台的一出苦肉计。2010年，张宏良受令炒作薄熙来，张宏良先把重庆的资本主义私有制制度胡说八道成是社会主义公有制。而假左阵营乌有之乡同时开始跟随薄熙来倡导的夹杂着歌颂邓小平的黄歌、黑歌之“唱红歌”，使用大量维稳资金在全国各地大搞“红歌会”，实质上是破坏掉无产阶级革命阵营的全国各地共产主义小组。乌有之乡授命于胡锦涛全力炒作薄熙来就是为薄熙来积累假政变的政治能量。政变的时间点即是2011年假共两会期间，由薄熙来发动政变将胡温赶下台并驱逐出境。如此一来，胡锦涛即可达成利用薄熙来贪图权力的欲望将自己家族的血债能量转嫁给薄熙来的目的，并同时将中国经济崩溃和社会动荡的责任推给薄熙来。胡锦涛设计这一惊天阴谋的漏洞就在于——政变后的薄熙来已不完全在胡锦涛的控制之下，薄熙来一旦识破其阴谋就会假戏真做，将中国出现的一切问题全部归咎于胡锦涛。这样一来，胡锦涛不仅不能达到卸掉中国人民血债能量的目的，反而会更快地把自己家族送上断头台。感到事态严重的胡锦涛不得不采用让王立军逃入美国大使馆避难的方式对假政变急刹车，同时将薄熙来监禁。薄熙来已被假左炒作成为假左的精神领袖，一旦将薄熙来打倒势必波及当初被胡锦涛授命炒作的假左。薄熙来被揭露出的许多贪腐问题和未被揭露出的许多重大罪恶，使得吹捧他们的假左受到了质疑攻击，张宏良之类逐渐被唾弃，乌有之乡最后也被关闭了。\n\n　　胡锦涛这个极其阴险恶毒的家伙，在快要下台前，导演了一出反日大游行的闹剧！用民族矛盾转移阶级矛盾。2012年下半年为抗议日本把钓鱼岛国有化，在全国许多城市有许多人打着爱国者的旗号或毛派左派的旗号，举着国旗和毛主席像打砸日本汽车和商品，甚至打伤了一些买日货的国人。这些车和商品还都不是日本人的，是中国人买的日货。这些游行都是假共头子胡锦涛授命假左干的，都是被操纵的闹剧，目的是转移人民的视线，损害毛派左派的形象，把毛派左派污蔑成暴徒。然后，假共的另一条狗民运分子说这些人是爱国贼，和假左配合污蔑毛派左派！其实，这些人都是被组织的，被假共假左操纵的。在资本主义社会，假左忽悠人民爱国是极其无耻的，他们岂止是贼，简直是畜生。\n\n\n　　虽然张宏良等假左遭到多数人反感，失去了忽悠市场，但假共还是要欺骗人民的，在2013年又弄出个新的假左骗子艾跃进，他虽然肯定文革，但企图把文革忽悠成单纯的文化领域的革命！艾跃进就是不说文革是要培养人民群众造反有理的精神，因为假共政府最怕的就是人民有造反有理的精神！艾跃进不说现在是资本主义私有制，是要大家认为现在还是社会主义，但是走资派占了上风，要大家紧跟习近平。据网传，2014年5月，艾跃进近期在各地的讲座被叫停，原因不明。这是由于有无产阶级革命阵营的存在，无数人民群众的雪亮的眼睛，艾跃进也忽悠不下去了，被主子叫停了吧，呵呵。 \n\n　　但假共还是有高级参谋的，2014年5月，又出现一个最具有欺骗性的假左田忠国，说他最具欺骗性，是因为他也提出真假共产党，真假左派等问题，虽然和周群思想里的真假共产党、真假左派有区别，但很有欺骗性的。他也提出要革命，成立了全国人民革命委员会，还弄出了个革命章程。这个章程里的第十四条是这样的：对于在历史上曾经犯过错误，包括严重错误，帮助走资派搞颜色革命的人，只要其纠正错误，并有纠正错误具体表现的，全国人民革命委员会给予其改正错误的机会。伪装的再隐蔽，也还会是暴露的，有好几条都是要从轻处理各种对人民犯下滔天罪行的禽兽的。革命目标方向没有问题，但是要建立根据地，武装革命，这就是打着革命的旗号反革命了， 是假革命。因为按照革命导师周群的思想，中国是经历过社会主义的，经历过文革的，有毛主席留下的巨大的政治遗产，这次革命是不战而夺人之兵，那就是思想理论大革命，让人民群众觉悟起来，包括军警，让军警站到人民群众一边或保持中立，不要站到官僚资产阶级一边，把军警这个暴力机器同资产阶级政权剥离开，大革命来临之际，将不会是无产阶级之间互相残杀，人民群众夺取政权将是轻而易举的事情。假共是想通过假左成立个假的革命组织，欺骗人民去加入，使人民和周群老师建立的真正革命阵营中革中央隔离，破坏真正的革命阵营中革中央，避免被血债血偿，进而篡夺将来的革命果实，用假革命的头目，就是他们的狗操纵国家政权，假共头目躲到幕后或海外指挥他们的狗继续骑在人民头上作威作福。这中国梦做地挺美，呵呵！随着形势的发展，假共或许会推出一个个更具欺骗性的假左忽悠头目！\n\n\n　　下面讲讲所谓的民族分裂问题，主要是新疆和西藏的民族分裂势力，这是中国的两个政治势力，但这两大势力是怎么产生的呢？\n\n　　1959年达赖叛乱失败后，和一些叛乱分子以及一些被裹胁的藏族群众从西藏流亡到印度。他们在印度成立了所谓的“西藏临时政府”，颁布伪“宪法”。根据伪“宪法”，这个所谓的“西藏国”的元首和非法的“西藏政府”的首脑就是十四世达赖喇嘛。达赖跑到印度去了，西藏参与叛乱没跑走的旧贵族也被镇压了。所以，59年后，中国西藏没什么民族分裂问题了，社会很稳定。但胡耀邦上台后，扶植少数民族旧贵族，打压拥护共产党的积极分子。胡耀邦和万里1980年12月到西藏后，把仍在服刑的376名“西藏叛乱”分子全部释放，戴帽监督改造的600人一律摘帽，清退过去被查抄的财产。1959年的叛军司令拉鲁坐牢6年，以后回乡务农。胡耀邦请其出山，当上自治区政协副主席，其妻任政协常委，儿子任自治区宗教局副局长。与此同时，翻身农奴重新回到地狱，沦为弱势群体，工作、收入无保障，非常困难。不仅如此，胡耀邦还提出“要把80％的汉人从西藏撤出来”。\n\n　　胡耀邦在干部路线上是认人唯亲的代表，他手中一有权，就打开狱门找同盟军，借口平反冤假错案，把一大批胡汉三式的人物从狱中放出来，扶上领导岗位。后来，这些人成为反毛反共反社会主义的中坚。更有甚者，他还把新疆分裂主义头子从狱中放出，扶上政协副主席位子，这个货色，自视有胡耀邦作后台，便以办经学院为名，培训分裂势力骨干。后来，新疆动乱，被公安部通缉的对象，几乎全是胡耀邦的徒孙。胡耀邦干这些坏事期间，用他的儿子胡德平作秘书，胡耀邦干的坏事，很多都与胡德平有关系。这个胡德平总是装出一副亲民爱民的样子，欺骗了不少人，但一提文革，他就说一定要彻底否定文革，暴露了自己丑恶的、真实的嘴脸，呵呵！胡耀邦在新疆问题上提出，党中央只要三个权：国防权、外交权、内政否决权。即除了国防、外交归中央管外，新疆自治区范围里的内政都由新疆地区决定。胡耀邦推出的“两少一宽”（对少数民族的犯罪分子要坚持少捕少杀，在处理上一般要从宽）等等政策，使稳定多年的西藏、新疆开始动荡，为2008年西藏的“3·14”，2009年新疆的“7·5”事件埋下了隐患，时人称为“胡耀邦，胡乱邦，乱了西藏乱新疆”。可是今天还有人说胡耀邦坚持正确的民族政策，呵呵！\n\n　　可以看出，正如周群老师所说的那样，所谓的民族分裂问题，是被假共十大家族等头目搞出来的，是他们制造出来的。他们制造民族分裂是为了学习苏联假共头目的手法，将来解体中国，好躲避人民的惩罚。因为国家分裂了，人民就不好追究或追究不了他们的滔天罪行了！下面再举些不同材料的案例来更好地说明他们的极度险恶！\n\n　　1.W族大学生诉说“两少一宽”害苦了我\n\n　　前不久在火车上，对面座有一个XJW族小伙，20多岁，很英俊帅气。旅途寂寞，便交谈起来。他毕业于国内某名牌大学，学的是热门专业。他很健谈，但显得不开心，唉声叹气道：“大学刚毕业，想留上海工作，但联系了好多个单位，人家都没要我。我学的可是社会很需要的热门专业，就业很紧俏的，我的学校也很著名，我的成绩很优秀，各方面条件都很好，同时去找工作，但上海的那些单位宁愿要一些比我差的人，也没要我。原因嘛，后来有人告诉我，其实我的条件都很优秀，但因为我是XJW族人，怕我进单位后带来麻烦。”\n\n　　他说：“XJW族是祖国56个民族大家庭中的一员。但W族的形象这些年被毁坏了，一些人全国到处窜，偷东西，强卖切糕，还喜欢打架，不讲理…… 这些人只是W族中的少数，但败坏了我们整体的形象。每当看到这些，我都很痛心，为这些不争气的同胞，为我自己，更为了我们整个民族。这样下去，我们民族的明天将会是什么？”“都是‘两少一宽’的政策给害的！这个奇怪的政策，‘宽’的对象是少数民族中的犯罪分子，注意，是针对少数民族中的‘犯罪分子’实行的政策，而不是针对全体少数民族，如果你守法，你就享受不到这个政策的‘好处’，而如果你去犯罪，你就可以得到这个政策的好处。\n\n　　从这个案例，可以看出就是鼓励少数民族的分裂分子和各种坏分子。\n\n　\n　　2.热比娅所谓的保外就医\n\n　　2005年3月，美国国务卿赖斯访华前夕，刑期未满的热比娅，以“保外就医”的名义被释放。也有消息说是赖斯直接带走了热比娅。释放前，热比娅一再保证：出境后绝不参与危害中国国家安全的任何活动。释放当天，热比娅在美国外交官的陪同下踏上了前往美国的旅程。一下飞机，刚踏上美国领土，热比娅立即背叛了自己无数次的承诺，开始攻击中国。第二天，美国一名高官向媒体透露，热比娅的获释，是美国“精心策划的交易”。1999年8月,热比娅因危害国家安全罪被批捕。2000年3月,乌鲁木齐中院以向境外组织非法提供国家情报罪判处热比娅8年徒刑。服刑期间,热比娅个人提出保外就医申请,司法部门同意其申请。2005年3月17日,热比娅获批赴美保外就医。2007年底香港记者吴小莉采访王乐泉时，吴小莉问道：2005年我们为什么会同意她保外就医呢？王乐泉回答：当时客观地说，她在监狱里边，一再地检讨，一再地悔过，一再表态说我们怎么样，她很会说，为这个还曾经给她减刑一年，后来她自己要求去到美国去就医，也是种种原因吧，就是放她出去了。\n\n　　美国精心策划的交易，和假共的交易呗，呵呵！假共早都投降美国了，什么交易自然他们都清楚。假共就因为热比娅改造表现好就相信她了，假共有那么蠢吗？王乐泉说种种原因吧，就释放热比娅了，显然是编造不出什么好理由了，用种种代替了，呵呵！就是制造出个假共的反对势力，用某种理由把她弄到国外，作为分裂势力的一个所谓的头领！\n\n　　3.2009年新疆75事件内幕\n\n　　安全人员其实早就有相关情报，并上报新疆公安厅，公安厅却完全不防范。7月4日，海莱提.尼亚孜（新疆经济报资深记者）去面见努尔白克力（中共新疆维吾尔自治区党委副书记，新疆维吾尔自治区主席），告诉他请派军队，马上要出事儿了。白克力很委婉地告诉他，发兵权在王乐泉手里。当局因为怕真正的英雄海莱提.尼亚孜先生事后揭发，便在10月将其判监。至于王乐泉去哪里了，目前也是个迷。佛晓的时候，王乐泉书记终于出现了，王乐泉请示中央军委，可惜胡锦涛在意大利开会，中央无人可以派兵，在一番周折联系了胡之后，从驻扎在张掖的兰州军区陆军21军第55旅在早晨启程去乌市，可笑的是，这只部队竟然找不到足够的卡车，大部分部队是坐临时征用的民用客车到达的。\n\n　　从这可以看出，他们是故意拖延不在现场，故意让事态扩大！怎么那么巧，事情发生时，王乐泉偏偏不见了，怎么那么巧，胡锦涛出国访问了，怎么那么巧，部队用的军车都不够，怎么这么巧，这些巧合都碰到一起了，这能有多大的几率，呵呵！\n\n　　\n　　4.无所不在的视频监控\n\n　　其实从头到尾都有完整的录像资料，这源于五年前中国在全国省会城市各大街道安装视频摄像的计划。乌鲁木齐、拉萨和北京、上海等属于第一批全部装上摄像设备的大城市，这次新疆整个暴乱事件以及武警处理事件的过程，其实已经完整摄入装配在各处的摄像镜头里。然而，事件后，这些摄像镜头全部被封存。这些摄像带真实记录了当时街头的情况，也是唯一可以让所有人信服的证据，却被封存了。\n\n　　最可气的是，你不是明知有人正在煽风点火要\"闹事\"吗，为什么一不防、二不堵、三不疏、四不导、五不禁，连给可怜的汉族市民们发个安全警报的简单防范措施都不做，就眼睁睁放任事态激化、让大街小巷变成了杀人的屠场？难道党国官员、军警特务们都是些白吃干饭的废物？镇压和平抗议你绰绰有余，对付暴力杀戮却一筹莫展？还是欲擒故纵，成心拿无辜市民作诱饵，自己\"别有用心\"地躲到一边，若无其事地\"观其言察其行\"去了？\n\n　　从这可以看出，假共就是纵容事态的扩大，因为无所不在的视频监控极其容易发现危机情况，从而迅速即时采取措施，把各种暴力行为扼杀在萌芽，最大限度减少人民的灾难。\n\n　　5.一名西藏学生对314事件的看法\n\n　　境外那些藏独，都是当年逃过去的农奴主的后代，我们已经翻身当主人了，他们只能在境外当狗，客死他乡，肯定不平衡。旧西藏才是世界上侵犯人权最为严重的地方。只是有个小小的要求，政府执法的时候要强硬点。我真觉得可笑，中央政府也真贱，黄教喇嘛越闹，中央就对他越好，像我们这些不闹事的藏族人，中央政府就不在意。\n\n　　我是藏南门巴族，政府能不能武装我们，让我们以志愿军的形式越境去印度端掉藏独老巢，我有些同学在那边，熟悉路径。这帮农奴主的后代越来越嚣张了，要再不出来，他们又要回来奴役我们了！达赖最可笑，西藏又不是他黄教一家的，就是独立了，西藏也是内战不断。有西方游客讲述，在事件发生后的一段时间内，当地政府似乎只是旁观，听任骚乱藏民打砸抢烧。\n\n　　从这个资料可以看出喇嘛越闹，假共中央就对他越好，还是纵容！外国游客的讲述还是说明假共希望事态扩大。\n\n　　6.最近的昆明事件说明什么？\n\n　　2014年昆明301事件就是假共自编自导的一出戏,目的就是要制造恐慌,增加老百姓的奴性。让老百姓觉得自己离不开这个反人民政府。同时通过制造恐怖事件,制造轰动效应,转移老百姓对国内不可调和的阶级矛盾的注意力,转移老百姓对自己受剥削压迫的注意力,以延缓他们的反动统治，还有就是故意制造民族对立分裂。对访民、维族人等等监控得非常严密，现在这种情况下，维族人从新疆跑到昆明，火车票实名制，班车票实名制，住宿实名制，手机实名制监控，你说它能不清楚吗？这些人行动前，互相一通话商量，就会被假共当局监控到。现在的信息技术，假共早都得到消息了，就是故意让它发生，许多人还不相信假共这么邪恶！\n\n   \n　　民族分裂势力介绍完了，都是假共制造的！他们想分裂解体中国，逃脱人民的惩罚。但中国的情况和前苏联不同，中国的民族都是很杂居的，虽然新疆很大，但也是多民族的，汉族也占有很大比例，不好分裂的。西藏的广大藏民都是解放的农奴，对达赖等旧贵族没什么好感，就是那些被胡耀邦放出来的分裂分子和达赖里应外合闹独立，没有多大市场，所以假共制造民族分裂也不能得逞，现在成为了它延缓自己反动统治的手法了。下面谈谈假共制造的另一个棋子法轮功。\n\n　　法轮功口口声声说自己不问政治，是个讲真善忍的修炼团体，真是这样吗？这当然是胡说八道！它早都在海外和假共的一条狗，也就是民运分子同流合污狼狈为奸沆瀣一气了！这个法轮功本身就是假共为了愚民制造出来的一个所谓的修炼团体。假共搞资本主义复辟，必然带来的剥削压迫和种种社会问题，必然导致人民的精神心理产生各种问题，这时候，他们适时地推出这个所谓的修炼功法欺骗愚弄麻痹人民的精神，让人民心甘情愿地忍受剥削压迫。这个垃圾功法所谓的教义就三个字真善忍，其实不真更不善，就是提倡老百姓要忍受苦难压迫，这才是它的真实目的，它的教义其实就是一个忍字。假共弄出这个功法显然是为了维护自己的反动统治的！这么个大团体，没有假共的操纵或至少是默许，怎么可能发展成这么大的团体？！ 其实，假共复辟初期就打着解放思想的旗号，重新弄出各种封资修的腐朽的垃圾东西，什么气功热，周易热，股票热，特异功能热等等！就是要把人民的思想搞乱了，所谓浑水好摸鱼。这就是周群老师所说的假共的“搅散民心、掠夺人民、金蝉脱壳的完美三部曲。弄乱人民思想，好掠夺人民，抢劫人民后，想逃脱人民惩罚，推出民运分子，目的是要摘掉共产党的帽子以逃脱惩罚保住抢劫成果，弄出民族分裂分子，是为了解体中国以逃脱惩罚保住掠夺果实。现在这两种逃脱方法基本无用，所以用另一条狗，假左忽悠欺骗人民，阻止人民的反抗革命或想篡夺人民革命果实！假共为什么要镇压法轮功？ 因为它围攻中南海，或按法轮功的说法是去中南海附近的信访办上访，不管怎么回事，总之，假共因法轮功的人数和组织结构感到了某种威胁和恐惧，尤其是江泽民这个禽兽小丑！但假共内部还是有不少人不支持镇压的，和法轮功上层还是有某些联系的，用以利用法轮功像利用民运分子那样，说假共不便于说不敢公开讲的东西，比较典型的就是重点攻击毛主席时代的真正的社会主义和真正的共产党，当然还要攻击伟大的毛主席。因为法轮功的上层基本都是假共的走狗，底层的法轮功许多是被欺骗愚弄的普通群众，当然也有不少毛主席时代的黑五类之类和新资产阶级分子，因为法轮功是不管真假社会主义都反的，很合新老剥削阶级的口味，呵呵！\n\n　　法轮功说共产党破坏了中国的传统文化，真是胡说八道，中国的传统文化主要是地主剥削阶级的文化（解放前绝大多数普通群众都是文盲，甚少90%以上的人是文盲），充满了腐朽的糟粕，何止该破坏，应该消除这些糟粕文化，这就是反对毛主席发动的各种清除剥削阶级有害思想的各种运动。法轮功及民运分子还有个极其险恶的说法，说是当代的道德崩溃和人民的各种有害思想行为是毛主席建立的制度造成的，简直是瞪着眼睛胡说八道，今天的资本主义社会的种种问题都是复辟资本主义带来的，和毛主席时代的真正的社会主义没有丝毫关系！\n\n　　法轮功还弄出个所谓的《九评共产党》的小册子，不区分真假共产党，对真正的社会主义时期和毛主席恶毒攻击，其实这个小册子的内容，在掌握真正的马列毛思想和一些历史真相的人看来是很好反驳的。这个九评的小册子内容充满了历史谎言和歪理邪说，对不懂马列毛和不了解一些历史真相的人很具有欺骗性。例如：说什么农民分到地主的东西，半夜给送回去了，因为农民也知道不能白拿别人东西的道理，这说法简直无耻到了极点！ 经历过毛时代的无数老人都健在，他们就敢这么无耻的撒谎! 农民那是担心还乡团回来报复，而不敢要地主剥削自己所得的本属于农民的东西!还乡团是中国历史上特有的残暴现象，如果单就其残暴程度来讲，绝不亚于日本法西斯和德国纳粹。大家看一下当初国民党还乡团那令人发指的残暴兽行，就会明白为什么中国老百姓宁可上吊自杀，也不敢选择革命的根本原因。因为千百年来，禽兽给善良人民的打击是非常残酷的，是毁灭性的，报复手段是极其狠毒的！法轮功还自鸣得意，说九评一出，无言以对，高干捧读，良心有悔。假共当然不会反驳这个九评的，因为反驳会暴露自己是假共产党，更主要的是这个九评本身就是假共弄出来的嘛！！！ 为什么这么说呢？因为九评的内容和思想言论显然是民运分子的，而民运分子是假共的狗，法轮功高层也是假共的狗，他们和假共不过是合伙演双簧愚弄人民群众罢了！法轮功被镇压后，这么多年了，法轮功的传单、横幅、书籍、光盘那么多散落在民间，这些东西难道都是信法轮功的人自己秘密私自制造的？一些简单的传单、小薄册子可以自己制作，那些很厚的小册子，如九评，自己制造就有点困难了，就是能制造，也不会很多。还有横幅挂历都有不少，这个人私自制作也有点难度，关键是不能大规模批量生产，而法轮功的各种物品非常像是大规模批量定点生产的。有人会说是回国的或来华的人从海外带回来的，这个很可能，但海关很容易发现吧？假共为什么不阻拦，呵呵！这是一个可能，更大的可能是这些法轮功的各类宣传品就是国内假共制造或默许法轮功散发的！然后再派警察没收一些传单和抓捕一些底层被欺骗的法轮功人员演双簧欺骗人民，许多警察和法轮功人员可能都不明内情，那这戏就更像真的了。假共是非常希望人民反真正的社会主义，反真正的共产党和毛主席的。假共通过民运分子和法轮功来反，因为这些是挂着共产党牌子的假共不能说不能做的，呵呵！虽然法轮功被镇压，但假共上层的许多人还是通过各种手段，一定程度地控制着国内外的法轮功的运作，至少是有很多联系。就像他们操纵民运分子一样。所谓高干捧读，良心有悔更是笑话，这些法轮功所谓的高干就是他们的主子，是些老投机分子，当年参加革命不过是投机。革命成功后就是想走资本主义道路，要当官做老爷的老畜生，不过被毛主席阻挡了近30年，现在他们已经走了近40年资本主义道路，想摘帽保住自己抢劫人民的巨额财富！\n\n　　法轮功搞的退党活动，也应该是假共高层某派指示的，为的是瓦解人民的社会主义公有制思想，丑化真正的社会主义和真正的共产党，把假共所犯下的一切罪行都推到共产党和社会主义身上（真正的共产党和真正的社会主义早已经被颠覆，他们就是要把资本主义社会的罪恶和假共党的一切罪行推到共产党和社会主义身上，让人民误以为这一切是社会主义和共产党造成的，从而引导人民去仇恨早已经消失的社会主义和共产党，极为阴险恶毒），积聚反共产主义的民间基础力量，为摘帽或解体国家做思想舆论准备！我说明下，我母亲在一个法轮功人员的说服下，把我们一家都退出假共的组织了！我家虽然没有假共党员，但退团或退队了。那是好几年前的事了，当时也不太懂什么，不过也清楚中国已经是资本主义社会了，退就退吧，无所谓，我连什么内容都没看，因为当时不在家。我特此声明我退出的是假共的组织！\n\n　　法轮功的网站是大纪元和无界浏览，这个需要翻墙软件自由门等才可以登录。说起翻墙，最早的翻墙方法可能是收听欧美的华语广播吧，比如美国之音，自由亚洲，伦敦BBC，法国国际广播电台，德国之声等等。许多人认为翻墙听到的或看到的全是真相。其实，通过我上面的介绍，就应该知道了吧，翻墙看到的不一定是真相，而很可能是假象，是骗局。就像三国演义里的蒋干盗书一样，自以为得到了真相。就说那些欧美的外国短波电台吧，就是歌颂欧美的民主自由，谴责中国不尊重人权等等，说中国社会主义是邪恶的，当然他们是不会区分真假共产党的，只要是戴着共产党帽子的，不管真假，他们都反对，不管真假社会主义，他们都敌视！他们自己说，好像没有说服力，这时候，从中国所谓逃出或所谓被驱逐的民运分子就登场了，比如魏京生、王丹、王军涛、何清涟等等。这些家伙当然对中国批判指责，尤其是真正的社会主义和共产党时期，对毛主席是极端的仇恨。我就听过个民运垃圾在外国电台里咒骂毛主席是湖南乡下出来的一个粗鄙不堪的小文人。一代雄才大略的伟大领袖被他们极端仇恨。就因为没有让这些人渣走资本主义道路作威作福！其实，通过我前面的文章，也可以知道这些是什么东西了吧，这些都是假共的狗，当然也是美国的狗，假共想脱衣摘帽，想分裂解体国家，美国也希望中国崩溃成为废墟，中国资源已经被欧美掠夺的差不多了。所以他们都是一伙的，共同愚弄欺骗中国人民群众，因为多数中国人民早已经不相信假共谎言铺天的媒体了，纷纷转向外媒和国外网络了。其实也很好理解，在当今资本基本控制了全球媒体，不反社会主义和共产党的，那就怪了！国内的民运分子、右畜也经常在外国电台发言，一般是通过电话采访或网络。如胡星斗这个对社会主义刻骨仇恨的畜生叫兽。\n\n　　法轮功的网站基本都是忽悠文，宣传欧美资本主义的民主自由，揭露所谓共产主义的罪恶，把毛主席描绘成一个荒淫残暴的帝王，忽悠人民私有制是合理的，公有制是罪恶的，还有揭露所谓的假共的各派内斗的文章，再有就是弄几个PS处理的图片，如鬼魂神灵图片，证明鬼神是真实存在的，善恶是有报的，都是愚弄人民的封建迷信的垃圾东西！最近他们就弄了篇《政治老师退休前的最后一课，惊呆学生！》的毒文，讴歌私有制是合理的，咒骂公有制的所谓罪恶，恶毒咒骂毛主席。这毒文估计是编造的，就真的有这么个政治叫驴也不奇怪，知识分子有几个不反毛反社会主义的，太正常了！我简单揭露毒文的两个谬论就可以了，里面有这么句：生产资料的私人占有，或者叫资本的私人占有与社会化生产的结合，是人类进入社会一开始就有的，是一种最基本的生产方式。——这是纯粹的谬论，人类的原始社会，连生活资料都很少，怎么能人类进入社会就占有生产资料呢，太可笑了！还有这么句：自私是一切动物的本性和生存的本源，它是人类社会生存和发展的最为原始的动力，消灭人的自私既不可能也是愚蠢的。——这就是人不为己天诛地灭的另一种说法，是一切剥削阶级和有剥削阶级思想的禽兽的座右铭！自私不是人的本性，原始社会是平均分配食品等生活资料的，在解放后，中国一些比较落后的地区是原始分配物品的。这都是有历史和现实依据的，正是生活资料，生产资料有了剩余，私有观念才产生的，自私不是从来就有的，也不是永远存在的。当物质生活资料的极大丰富必然导致人的私有观念的逐步弱化直至消亡！给人民群众灌输自私思想是维护资本主义私有制的重要手段，就是让人民群众自私性加重，从而使人民一盘散沙，不能反抗剥削阶级的反动统治，按剥削阶级思维，人民群众就是永远被奴役的命运，这是人文领域的阶级斗争，妄图从思想灵魂奴役人民。很简单的道理，剥削阶级已经霸占生产资料奴役人民，人民群众都私心重，按资产阶级思维行事能得到什么呢，根本就是万劫不复的被奴役之路。现在有许多所谓的按富人思维的书籍都是这类毒书，还有穷人为什么穷，富人为什么富的书。还有穷人缺什么的书等等。富人富裕是因为霸占生产资料奴役穷人，相对地，穷人被剥夺生产资料只能被奴役。穷人现在缺的的是革命无罪，造反有理的革命精神！人类社会要想生存和发展必须建立社会主义公有制社会，当今世界人民已经被欧美主导的资本主义私有制带来的各种问题弄的焦头烂额！委内瑞拉前总统查韦斯说过，火星上曾经可能存在过生命,但是资本主义和帝国主义让火星上的生命消亡。\n\n　　值得一提的是法轮功还利用中国人的比较根深蒂固的迷信思想预言共产党的灭亡，其实真正的共产党早在76年10月6日就亡了。下面举几个案例：\n\n　　1.有民间高人表示，从神传文化中可测出中共结束的时间，但必须用正体“共产党”来测：\n\n　　共：廿八年，是毛的共产时代，是穷人“万里香”的年代。\n　　产：十八年（六加七加五），是邓的猫时代，往钱看，有钱能使鬼推磨的年代。\n　　党：二十年，是江的黑时代，用权与钱欺压贫穷的老百姓。\n\n　　该民间高人表示，共产党六十六年结束：在2014年10月1日至2015年10月1日期间结束。从1999年7月大骂法轮功四十二个月，然后再黑暗残害十二年，即吞灭中共时。\n\n　　这个例子的所谓民间高人不过是假共的狗文痞罢了，就是欺骗忽悠人民什么天时已到，愚弄人民。真正的共产党76年就亡了，现在要灭亡也是假共要灭亡。测字方术不过是封建时代古老的骗术，在当今还拿出来愚弄迷信思想重的人。这个所谓的高人还不识数，江泽民时代不过是15年（江89年上台，04年才全退，交出军委主席大权），不要相信什么所谓的高人预言，如果人民不起来推翻邪恶势力，任何邪恶力量都不可能自己自动垮台的！\n\n　　2.预言中共的命数 “江湖习五”\n\n　　《大纪元》早前报导，有一知情人李兴（化名）透露，上世纪八十年代，他在四川雅安工作时，有一民间高人曾给他留下一句话：后邓时代，中共的命数将应在“江湖习五”这四字上。\n\n　　李兴表示，当时这位高人并未留下文字，到底是“江湖习五”、“江胡习武”、“江胡习无”还是“江胡习伍”，不得而知。当年他并未把这句话当回事，但30年过去了，看着习近平将登临大位，他才不得不佩服这位高人的神机妙算。\n\n　　从80年代后中共的历史看，当年那个民间高人说的四个字，前3个应该是“江、胡、习”无疑了。从上个世纪80年代后期至今，江泽民、胡锦涛、习近平先后登上了中共最高权力顶峰。 \n\n　　有分析认为，按中共的说法，习近平现在是第五代接班人，但目前中共气数将尽，江、胡、习之后，已无第六代之说。那民间高人四字中最后一个字，应该是“无”了。 \n\n　　编造这个故事就是愚民，让迷信思想严重的老百姓认为朝代气数已尽，该改朝换代了，共产党要亡了，这是天数。其实共产党早都亡了，要灭亡也是假共要亡党亡国了，但假共就是愚弄人民，让人民认为共产党要亡了，好彻底否定共产党和社会主义。\n\n　　3.贵州“藏字石”示警天灭中共\n\n　　2002年6月，贵州省平塘县掌布乡，发现地质奇观“藏字石”，“中国共产党亡”六个横排大字浮雕般突出于石面。\n\n　　据中国著名地质学家们实地考察，该“藏字石”上的字位于距今2.7亿年左右的二叠统栖霞组深灰色岩中，字体均匀排列，没有人工雕凿及其他人为加工的痕迹。贵州“藏字石”被称为震惊世界的地质奇观。 \n\n　　贵州省平塘县掌布乡发现的“藏字石”，预示着中国共产党即将覆灭，警示中国人退出中共邪党保平安。\n\n　　这是法轮功忽悠十多年的骗局了，那个所谓的藏字石根本是假造的，甚至根本不用假造，弄了PS图就可以。还把地质学家弄出来了，呵呵！就是真有这么个砖家也不奇怪，现在的砖家基本都是满脑子资产阶级思想，一心替主子叫唤。许多砖家叫兽为什么发疯般地否定马列毛，为什么散布马列毛失败，破产，过时的论调， 是同一个道理，他们一是为了主子叫唤，更是为了免遭清算，这些砖家叫兽三十多年盘剥人民，残害学生的事情没少干，为的是愚弄人民好逃脱被清算，也算是正常的畜生心理。\n\n　　4.有高人预言末法时的乱象称：\n\n　　八分到了末教年，胡灵附体闹中原。\n　　大官小官皆贪官，虎狼土匪街上窜。\n　　娼妓遍地盗贼起，欺压百姓冤冲天。\n　　官杀官来贼杀贼，中原净剩无能为（贪官是公贼）。\n　　到那时：灯头朝下（电灯），千里说话（电话主），\n　　人有酒壶高（电视里的人），马有兔子大（电脑里的马）。\n\n　　这也是轮子网上的反动诗句，编造的好像很古老的样子，其实就是当今的文痞编造的，特别说明一下，我的亲人中也有被欺骗的，什么兵打兵，贼打贼，将来净剩无能为，和这诗句里的一句很像，其实这是极端蔑视人民大众的极反动的词句，把人民大众看成是无能之辈，加以污蔑。这是认为人民离不开官僚和贼匪的统治，无论什么时代都该是官匪统治人民，反动透顶！！！\n\n\n\n　　法轮功和民运分子早已经合流，法轮功网站的许多文章显然是民运分子所作。法轮功网站揭露的所谓假共内斗不是他们揭露的，是他们的假共主子故意让他们放出的某些信息，借助海外的媒体为自己的斗争增添筹码或揭露对手。当然许多内斗的信息不一定是真的，许多是故意让人民群众看到，让人民以为他们在斗争，故意愚弄人民，让人民以为他们在斗，人民有希望了。其实这些资产阶级的狗咬狗，不管谁上台，人民群众都是被剥削奴役的！人民的希望在于推翻资本主义私有制，建立社会主义公有制！法轮功网站里那些评论很值得说一下，那些评论可真不是人评论的，根本是一大群疯狗！一个个对毛主席，对共产党，对社会主义，对共产主义充满感情、饱含深情、歇斯底里、丧心病狂地、发疯般地、极其恶毒的咒骂！一个个要把毛主席从水晶棺里拽出来要鞭尸，这都是什么东西，这都是对毛主席刻骨仇恨的新老剥削阶级禽兽吧，呵呵！就这些东西嘴里动不动的要实现中国的民主自由，简直是宇宙级笑话，呵呵！有一段时间，有两个分别署名军人后代和江苏老干部的畜生，整天在那里咒骂共产党，说体制问题等等。其实这两个畜生都是既得利益者，为的是彻底否定真正的社会主义和真正的共产党，疯狂制造舆论，为摘帽或解体使出了吃奶的劲，为的是免遭人民惩罚并保住抢劫果实！不懂马列毛的，还以为他们是体制内的人，也反体制，是难得的英雄开明人士呢，呵呵！\n\n\n　　法轮功的网站里经常有访谈的视频节目，里面的民运分子都谈到中国现在是资本主义了，说到官僚资产阶级了，却还是说共产党如何坏，共产党如何残暴，呵呵！这极其阴毒险恶的用意在掌握了真正的马列毛思想的人看来是很清楚的，而不懂革命理论的人，多数还认为他们讲得对呢！他们的目的就是把假共干的所有罪恶都推到真正的共产党身上，推到真正的社会主义身上，让人民仇恨社会主义，仇恨共产党，为摘帽解体做愚弄人民思想的准备。大纪元网站里有个叫石涛的小白脸矮胖子，有个自己的栏目吧，整天在那里嬉皮笑脸地揭露所谓共产党的罪恶和假共内斗的所谓内幕，几乎从来不谈阶级斗争，提也是否定咒骂，他只说官民矛盾，呵呵！这和国内的假左头目张宏良的说法一样，张宏良也否定阶级的存在，也谈官民矛盾，他们都是假共的狗嘛，呵呵！国内的民运分子和老右畜也经常在法轮功等海外网站发表反毛反社会主义垃圾毒文！比如那个著名的老畜生铁流！说法轮功是假共的狗，还可以从法轮功的网站里对假共头目的阿谀谄媚看出来，胡锦涛和习近平上台后，法轮功的网站管他们叫胡大大，习大大，真是狗奴才的嘴脸，直接叫爹得了，呵呵！\n\n　　\n　　下面说说假共，假共是中国目前表面上最大的政治势力，当然，它是极其反动的禽兽集团。它是由十大家族掌控的。这个反动集团戴着共产党的帽子，披着社会主义的外衣对内疯狂镇压人民，对外跪舔欧美列强，极其残暴下流无耻，用人类一切形容禽兽的词语都难以描绘它的极端反动残暴丑恶嘴脸。对内镇压就是各种极度野蛮残忍的兽行，这大家都有目共睹，不必多说。对外是不断出卖国家民族的一切，超越了历史上所有的卖国贼。所以，才有假共的狗奴才不断给历史上的所有大奸大恶翻案的一幕幕丑剧。假共就是右派，就是维护资本主义制度的畜生禽兽群体。最可笑的是假共的狗假左和民运分子等还忽悠人民群众，说假共党内有所谓的健康力量、左派，真是无比卑鄙险恶的愚民罪行。假共最恶毒的是毒害人民的思想灵魂，用以维护自己的反动统治。下面主要讲这方面的一些情况和案例。\n\n　　当年参加革命的许多人没有什么远大的理想，许多是投机革命，满脑子打江山坐江山的农民起义的思维，网上有一段很好的揭露文字，下面摘录如下：\n\n　　许多高级干部，尤其是军队中的那些高级将领及从军队中走出来的高级干部，大多数都是文化程度很低或是根本就没有文化的贫苦农民出身，他们当中的一大部分人，当初参加革命的动机和目的，并不是怀有什么崇高的革命理想，而不过与陈胜吴广一样，就是要通过“老子打天下，老子就应该坐天下”的这种方式，以求改变自身的命运，而有的参加革命的动机甚至竟然就是为了能混上一口饭吃这么简单。由于这些人的文化程度很低或是根本就没有文化，所以不可能系统地学习马克思列宁主义理论。而在艰苦繁忙的革命战争年代，党也无法对他们进行系统地培养和教育。这些人虽然文化程度很低或是根本就没有文化，对马克思列宁主义的理论了解知道的也更少，但是由于他们都经过了长期革命战争的千锤百炼，所以每个人都具有极其丰富的斗争经验和胆识。特别是由于在他们参加革命的初期，都是在相对独立和分散的状态下成长起来的，并且由于自身的党性不强而在传统文化的熏陶下封建意识却很强烈。\n\n　　革命成功之后，这些人都身居高位。其中有些人在“老子打天下，老子就应该坐天下”这种思想的驱使下，迅速地腐化变质。杨尚昆刚进北京不久，就在香山上为自己建了二层小楼，毛主席知道后，狠狠地批评了杨尚昆，甚至说要枪毙他，吓得杨差点瘫倒。刘青山居然要在冬天吃不放韭菜却要有韭菜味的饺子。毛主席所说的：“做了大官了，要保护大官的利益。他们有了房子，有汽车，薪水高，还有服务员，比资本家还厉害”这句话，就是指向的他们。而且也就是他们，在文革初期还仅仅是对文革表示出了极大的反感。而当文革触及到了他们的既得利益的时候，他们便出来公然抗拒文革了。甚至像制造“武汉七·二0事件”的陈再道和青海的赵永夫等人，竟然敢于武力抗拒。而在中央，几位老帅更是带头掀起了“二月逆流”。\n\n　　在毛主席时代的真正的社会主义时期，正是以刘少奇邓小平为首的这些要打江山坐江山的投机分子，为了能够实现自己及子孙后代坐江山，剥削压迫奴役中国人民的禽兽心理愿望，不断破坏社会主义的建设，不断破坏毛主席为巩固人民的社会主义江山而发动的一次次运动，因此毛主席时代一直有两条道路，两条路线的斗争，所以，毛主席说过党内有个资产阶级的司令部。这个资产阶级团伙非常强大，几乎一度架空毛主席，他们还让杨尚昆等在毛主席专列火车上安装窃听器。被发现后，杨尚昆说安装这设备是经刘少奇邓小平同意的，中央书记处有个内部决议，为了随时记录下毛主席的新指示，新理论等，为了替全党保存珍贵的党史资料。1959年4月18日刘少奇当选为国家主席。他和邓小平不断刮共产风，浮夸风等五风，直到搞地造成饿死人！76年复辟以后，邓贼的狗腿子奉命把大饥荒的罪行栽赃给毛主席，不断造谣饿死了几千万人。私有制几千年中的无数战乱饥荒死的人那么多，没几个人提，假共的狗对60年左右的饿死人的事却极其关注，可见其险恶的目的用心！\n\n　　57年的反击资产阶级右派文痞运动是极其正确的，许多人讨厌仇视现在的砖家叫兽公知，其实这些禽兽不就是资产阶级文痞嘛，毛主席发动的反右斗争反的就是这些畜生，太正确伟大了！许多人不懂政治，一边认为反右是毛主席的罪恶，一边反感现在的砖家叫兽，着实可悲！66年的文革则早已经被证明是万分正确的，文革就是为了防止资产阶级复辟而发动的，现在已经复辟近40年了，资本主义的一切罪恶都在神州大地显现了，但资产阶级禽兽们是极度无耻的，还在不断咒骂文革的所谓罪恶，还要把资本主义社会的罪恶推到毛主席身上，说是毛主席建立的制度造成的，这群畜生的无耻是无法形容的！文革中的血案都是走资派镇压造反派，或挑动群众斗群众造成的，所谓的反文革的英雄张志新，遇罗克等的真面目都已经被揭露出来了，他们都不是什么好东西，那个遇罗克就是个极其反动的家伙，他认为工农兵学哲学的时代远未到来，认为斗走资派和阶级斗争无关。不让他上大学就极度仇恨，现在看来不让剥削阶级子弟进入高校是毛主席无比英明的决策，这些畜生子弟对劳动人民本来就刻骨仇恨，为他们失去的天堂无比伤心。就不多举例了，这些被新资产阶级热情讴歌的反文革畜生能有什么好东西！\n\n　　1977年12月恢复高考有个惊天大阴谋。 假共自上而下口头传达：考生为文革受“迫害”的直系亲属优先录取（也包括地富反坏右的子女），有些人是\"请来\"参加高考的.要它们务必参加高考,并告知：录取的机率很大。随着一些地富子女纷纷考上大学.一些农民甚至沮丧的说：“不服人家种好是不行的。”又有谁知道,看似公道的高考竟藏如此之玄机！ 邓贼恢复高考真实目的是为了让他的所谓改革后继有人！从此工农兵都靠边站了。所以，现在假共的各级政府机关里的东西基本都是原来的剥削阶级禽兽子弟，他们现在不时发出反人民的言论，不时做出残害人民的举动就毫不奇怪了。他们才是真正不忘阶级仇恨的，真正最有阶级斗争意识的。我原来还以为剥削阶级家庭有读书的环境优势，所以考上的多，原来这里有个大阴谋！所以说， 毛主席不让原来的剥削阶级子弟上大学是正确的，毛主席是光明正大的，而剥削阶级禽兽净干些见不得人的卑鄙罪恶勾当！所以他们才特别重视保护什么个人隐私，也就是保护他们的各种罪恶不被曝光揭露，保护他们残害人民的罪行。他们其实是最讲阶级斗争，最有阶级斗争意识的，当然他们是不会公开说出来的，并还极为愤慨地公开否定阶级斗争！\n\n　　\n　　为什么搞改革开放？ 周群老师说过搞改革开放的目的是邓小平带领走资派头领要侵吞、霸占人民的生产资料，成为资产阶级十大家族，骑在人民头上剥削压迫，作威作福。1976年7月发布的第七期《红旗》杂志精准地预言了邓贼的复辟野心和手法：邓小平在经济建设方面的谬论很多，其中贯穿着一条黑线，那就是：对内代表资产阶级，同无产阶级争夺国民经济的领导权，要把我国的社会主义经济变为官僚垄断资本主义经济；对外搞投降卖国，妄图把我国变为帝国主义、社会帝国主义的殖民地半殖民地。这实质上是一种买办资产阶级的经济思想。\n\n　　为了投降帝国主义，邓贼发动了所谓的对越自卫反击战，献上投名状，换取美国主子的信任和支持。\n　　\n　　根据目前解密的档案看，为取得欧美资本主义的支持，中国发动了一场在中国官方称之为“自卫反击战”对越战争，这是一场中国政府告别苏联模式的世界宣言，美国政府终于看出中国政府的诚意，对越“自卫反击战”后，中美政治、经济与文化交流开始漫入快车道。中国终于取得了对外开放的欧美通行证。这才是中国改革开放的逻辑起点。对越“自卫反击战”是中国改革开放的逻辑起点，不是什么“十一届三中全会”，因为即使“十一届三中全会”中国想改革开放，没有欧美通行证，中国政府只是一厢情愿而已，如同男女恋爱双方，没有对方的认同，最多就是单相思。——这是那个长年看跌房价的牛刀的博客里的一段话，这个牛刀也是个讴歌美国的民运分子，还装作整天和假共对着干的样子，揭露所谓的政治经济内幕，不过是主子让他叫而已，不然早都让他闭嘴了，他在他的博客里不时歌颂美国，正是主子的授意或默许。当然他的许多消息不都是假的，因为现在资讯异常发达，假共对一些不太重要的信息也不太封杀，况且许多事情随着发展已经很明朗了，也不必封杀。还有牛刀把将要发生的经济崩溃归结到政府，而这个政府是资产阶级政府他却不说明，就是把要发生的灾难推到共产党和社会主义身上，转移革命的目标，也是个十分险恶的东西。是假共的奴才无疑。牛刀和任志强一个忽悠房价将下跌，一个叫嚣房价要不断上涨，从不同方面对民众忽悠，使得大众犹豫、彷徨，产生心理压力，最终许多人被忽悠买了房子，成了房奴。2014年7月末他发表的微博热情赞扬戈尔巴乔夫伟大光荣正确，歌颂他推进了民主进步，是不贪恋权力的英雄。可见这是个什么东西了，呵呵！\n\n　　谈到戈尔巴乔夫，就涉及苏联解体的问题了。许多人不明真相，以为苏联解体证明了社会主义的失败或证明资本主义制度是合理的，是人性的等等。其实苏联解体是个惊天的骗局。是一场假政变解体国家保住抢劫果实的骗局。自从1953年斯大林去世后，苏联就被苏共内的投机分子赫鲁晓夫等倒退回资本主义制度了，他们不改变党的名字，不改变社会主义的名称，披着共产党和社会主义的外衣对苏联人民进行资产阶级专政，抢劫了人民的生产资料等巨额财产，并不断搞乱人民的思想，假苏共的媒体不断揭露所谓的内幕，不断丑化十月革命，丑化列宁斯大林，和当今中国的假共的做法一样，中国的假共集团智力极为有限，不得不学习假苏共的种种忽悠欺骗手法。这样过了38年，到1991年，假苏共策划了假政变，分裂解体了国家，摘去了共产党和社会主义的帽子，彻底实行资本主义制度，否定十月革命，否定列宁斯大林，保住了抢劫果实。社会主义制度不存在了，人民无法追究分散在解体后各个国家的抢劫犯。苏联分裂解体完全是一小撮投机分子的作为，苏联解体前的民意测验有70%以上的要保留联盟的，结果还不是被少数投机分子解体了。所以说戈尔巴乔夫和叶利钦等是什么东西 ，就不难看清了吧，歌颂戈尔巴乔夫的是什么东西，也不难看清了吧！当今俄罗斯的新权贵，除了金字塔顶上的人之外，几乎全是原来的假苏共的各级官僚。苏联解体就是一个抢劫团伙分裂解体了国家，保住抢劫成果的一个惊天骗局。\n\n　　1978年邓贼唆使万里这条老狗去安徽凤阳小岗村制造分田单干的大包干大骗局，还弄了个18人按血手印的单据。这单据过了三十多年红色依然很浓，呵呵！如果是血的话，时间久了早都发黑了！2009年，广东省陆丰东海镇龙光村700多村民在上访信上按了血手印，为的是上访维权告卖地的村支书，这个村人均土地只有0.4亩，达到村民生存的极限平均土地水平，村支书李华盛15年来将原本1650亩地卖到只剩下900亩，人均仅剩0.2亩。这么多村民按的血手印时间不长已经有些发黑了。一个是为了把集体的粮田分为个人所有制出了18人的“血手印”，另一个是为了维护集体的粮田不被贪官卖掉制出了700多人的“血手印”。前者却被存入“中国革命博物馆”，后者捅破天了却还没有人理采。\n\n　　那个提出实践是检验真理的唯一标准的畜生，说当年自己写毒文时已经准备好坐牢了，其实这都是骗人的，那个胡福明老禽兽是一条嗅觉极其灵敏的文狗，当时无产阶级四个革命家已经被他们抓捕有近两年了，他已经嗅到主子要干什么了，因而为主子写了这个真理检验标准的所谓历史性的文章。或许他早都接受到主子的指示写的，就像小岗村一样是假共头目捏造的骗局！许多人还认为这句话是真理，这个是十分荒谬的言论。真理多数是被实践检验过的才能称之为真理。退一步，就算真理需要检验，那实践也是检验真理的一个标准，不可能是唯一的，有些真理是不验自明的。再退一步，就算真理必须被实践检验，那从76年到现在他们的各种所谓的真理，检验出了什么成果，我想正常人都能看清吧！http://news.sohu.com/20080102/n254406552.shtml\n\n　　其实这个检验真理的标准的文章是反击所谓的两个凡是的。而这两个凡是也是假共头目的狗腿子弄出来的。下面摘录几段揭露这个骗局的文章：\n\n　　在中国，马列主义、毛泽东思想被人厌恶，并且在全党全民心中开始负面化，始于“两个凡是”的提出。其实真正懂马列主义毛泽东思想的，不会提出“两个凡是”，也不会鼓动“两个凡是”。事实上，正是“两个凡是”的提出，使真正的左派、真正的马列主义毛泽东思想信仰者十分被动，而反共反社会主义的右派则找到了一个攻击毛泽东思想的重要突破口。\n\n　　《半月谈》杂志的创办者、曾任人民日报总编室主任、中央外宣办秘书长的喻权域在2008年5月《对真理标准讨论的再思考》一文披露了两个凡是出台的内幕：\n\n　　【粉碎“四人帮”后，中央的陈云、李先念、叶剑英、王震等领导同志和全党全国的许多同志，都主张为1976年清明节发生的“天安门事件”平反，都主张恢复邓小平同志在党内外的职务，重新出来工作。当时担任党中央主席的华国锋同志，并不反对上述主张。但是他主张过一段时间，待“时机成熟”的时候才作出平反决定。】\n\n　　【1977年2月，中央的两位“秀才”――郑必坚和龚育之为“两报一刊”起草了一篇题为《学好文件抓好纲》的社论，经当时在中央主管宣传工作的李鑫同志审阅、签发，于2月７日在《人民日报》、《解放军报》和《红旗》杂志上发表，引起全国轰动。那篇社论的要害是提出了“两个凡是”――“凡是毛主席作出的决策，我们都坚决维护；凡是毛主席的指示，我们都始终不渝地遵循。”很明显，这是要阻止中央为“天安门事件”平反、为邓小平同志平反。】\n\n　　【当年在中央书记处研究室工作，“八九风波”之后由中央派到人民日报社当副总编辑的张云声同志，亲口对我说：那天早上，食堂已经开饭好一阵，郑必坚和龚育之才到。一坐下来就得意洋洋地对在座的同志讲：昨天晚上他们俩人挖空心思，在灯下写出了“凡是毛主席作出的决策，我们都坚决维护；凡是毛主席的指示，我们都始终不渝地遵循。”那两句重要的话。1978年5月，胡耀邦等同志组织了关于真理标准的大讨论。新华社和《人民日报》等全国各大报刊发表了许多讨论文章，各省、自治区、直辖市的党委都发表了意见。】\n\n　　【据湖南的同志讲，华国锋同志辞去中共中央主席之后，于80年代中期回到他曾经长期工作过的湖南省看望。他曾几次在湖南发牢骚说：两个秀才（指郑必坚、龚育之）起草了一篇讲话稿，我拿到会场上去念了一遍，就把“两个凡是”的错误主张栽到我头上了。】\n\n\n　　假共右畜们是极相信谎言重复千遍就是真理的。邓小平在刚复出时就对胡乔木说过：“要把文革说得像日本鬼子进中国来的一样坏，具体怎么做是你们理论家的事，我相信你们是有办法的。”所以，后来伤痕文学出来了，知青文学出来了，各种文革的假回忆录出来了，饿死三千万，四、五千万、七千万，近年来又创了历史新高，饿死一亿四五千万也出来了，还衍生出丑化真正的共产党毛主席时代的文章，抹黑毛主席的书籍，否定毛主席时代的反动观点等等一起出笼了。总之，在造谣者的笔下，共产党是可怕的怪物，应该向西方学。三十多年来，的确多数人的思想被搞乱了。这正是周群老师所讲的搅散民心！\n\n　　叶剑英的一段话就是邓小平骗术的最好注脚。叶剑英79年说过这样一段话：“要借毛主席的话来整他们，没有这个武器，全国人民不答应，也回答不了全国人民的疑虑。毛主席的话，就是断章取义也要这么办，我估计在很长的一个历史阶段，我们都得要高举毛泽东思想的旗帜。对毛主席说过的所有的话和指示，都要严格控制，未经中央办公厅审核，不得让任何人外泄或传抄，这里的道道多着呢！”\n\n　　下面揭露几个反毛畜生，他们都是写了反毛毒书的，我们看看他们究竟是什么东西！\n\n　　1.李锐 编有反毛毒书《毛泽东的功过是非》，李锐1958年开始任毛主席秘书，因刘少奇邓小平等在1959年庐山会议上想借打倒彭德怀企图打倒毛泽东周恩来等领导人，因而作为毛泽东的秘书李锐首先被打倒，在1959年07月庐山会议上受到严厉批判，撤销了一切职务，开除了党籍。\n\n　　李锐认为自己的遭遇是因为跟着毛泽东的缘故，非但不反省自己的思想言行与阶级立场，反过来却利用自己是毛泽东的秘书身份来进行彻底反毛、反社会主义。在1966年刘少奇邓小平想利用文化大革命初期，仿照苏联罢免赫鲁晓夫的形式搞突然袭击，召开中央全会罢免毛主席的一切职务，从而达到彻底篡党夺权复辟资本主义的罪恶目的，李锐与反毛分子沆瀣一气，更加肆无忌惮地反党反毛反社会主义。\n\n　　1967年11月10日－1975年，李锐因为反党反社会主义被人民政权审判为反革命罪投进监狱，在北京秦城监狱关押8年。在毛主席的亲自过问下于1975年被提前释放，但其非但不思悔过，不感谢人民，不感谢毛泽东，反而变本加厉更加昧着良心污蔑诽谤毛泽东等无产阶级革命领导人，歪曲否定无产阶级文化大革命。\n\n　　2.辛子陵 编有反毛毒书《红太阳的陨落》，辛子陵1974年根据邓小平授意撰写的《林氏春秋的破产》，1975年经邓小平主持军委办公会议讨论批准，2月18日在《解放军报》头版发表，为批判所谓极左思潮立功。\n\n　　3.高华 编有反毛毒书《红太阳是如何升起来的》，高华生于1954年，不过2011年12月26日就死了。他的父亲在1957年被划成右派。\n\n　　4.李志绥 编有反毛毒书《毛泽东私人医生回忆录》，其父为国民党政府高级官僚。\n\n　　5.张戎 英籍华人，和她的丈夫编有一本《毛泽东鲜为人知的故事》，张戎是生在红旗下，长在红旗下的\"高干子女\"。十四岁的张戎曾从故乡成都来到北京，作为红卫兵的一员，接受毛主席的检阅。随着文革的进展，她的父亲因支持陶铸而成为反革命，送进山区劳改。张戎因此丧失了她原来的优越生活，开始了她的所谓“苦难历程”：先是到农村插队，后又到喜马拉雅山麓的藏族村落当赤脚医生。\n\n　　我们看出身，但不能唯出身论，但这些家伙丧心病狂地著书立传反毛反社会主义反文革，很难说与他们的出身经历无关！这些东西写的书许多在香港出版，假共还装模作样地在海关检查没收这些书籍，表明他们好像是拥护毛主席，是毛主席的继承者，太滑稽了，演出双簧欺骗人民。要是假共真是热爱毛主席，就应该拘捕公开审判这些畜生才对！他们不过是假共故意放出的狗而已，就是要让他们搅散民心，破坏真正的共产党和毛主席在人民心中的光辉形象。这些反动畜生的电子版的书籍在百度可以随便搜到，可见假共的用心了！假共搞网络封锁是很有一套的，但这些毒书却从来不封锁，呵呵！假共让网民看到的基本都是它想让大家看到的。\n\n　　\n　　南方周末，创刊于1984年2月11日，以“反映社会，服务改革，贴近生活，激浊扬清”为特色。这是对南方周末报纸媒体的介绍，服务改革才是它存在的真正目的，这是假共的反动报纸，就是维护资本主义私有制的反动读物。炎黄春秋，1991年创刊，由资深的老革命家领衔创办。就是老投机分子们创办的，呵呵。炎黄春秋主编吴思的父母是文革中的牛鬼蛇神，这货弄出两本书来，《血酬定律》和《潜规则》。都是有毒书籍，血酬定律打着揭露历史规律真相的幌子变相宣传弱肉强食的社会达尔文主义，潜规则使得中国目前各行各业潜规则泛滥，这货却说，随着宪政民主的建立，潜规则会逐步萎缩等谬论，其实潜规则是资本主义私有制的必然产物，美国有他所谓的宪政民主，美国的潜规则更是泛滥。所以这货编书的目的就是愚民！这些报刊杂志就是鼓吹西方资本主义制度好的反动书刊，为的是维护假共的资本主义社会，为假共的特色资本主义提供反动的理论依据，并忽悠人民中国还没有政治改革，为资本主义的政治改革摇旗呐喊，为假共摘帽积聚民间基础力量，许多小右民运分子就是被这些右畜媒体忽悠的！假共的中央党校更是反社会主义反毛反文革的基地，里面的许多砖家叫兽整天在那里论证社会主义的所谓罪恶，论证共产主义是空想，抹黑毛主席。许多人还认为他们揭露了所谓的真相，其实他们是在愚弄人民，维护资本主义社会的稳定。自称共产党的理论专家却专门反共产党反社会主义也就毫不奇怪了。当然党校里也有些砖家叫兽在那里绞尽脑汁的论证邓小平理论，江泽民的三个代表，胡锦涛的科学发展观，习近平的中国梦等歪理邪说是马列毛的发展，一群昧着良心编造谎言的无耻畜生！凤凰卫视，是假共的媒体，在香港办个电视台却没广东话节目频道，除香港外的内地也能看到，呵呵！这还是骗术，大众不是不相信央视嘛，假共就在香港弄家电视台忽悠欺骗国内的人。还有民众不信任国产奶粉，假共的资本家就去民众信任的新西兰等国去开奶粉工厂，假冒国外的奶粉卖给国内的民众！\n\n　　前面提到了假共豢养的文痞总是说共产主义是乌托邦，是幻想，还有忽悠马列毛是平均主义的，现在简单介绍些理论，揭穿这些砖家的欺骗忽悠。\n\n　　马克思主义的平等不是人们体力和智力的平等，不是人们的个人需要相同，而是大家都平等地摆脱了生产资料的私有制和剥削，大家都平等地用公共的生产资料进行工作，大家平等地有从事劳动的义务，对大家是同样按劳分配的。马列毛绝对不是剥削阶级和他们的各种狗所污蔑的是平均主义！所以，不要一谈共产主义就认为是要把个人家里的财产都剥夺了，个人是不能占有生产资料的，这是社会主义所不能允许的，社会主义制度下，生产资料是全体人民共同占有共同享用的。个人霸占生产资料的私有制是劳动人民的灾难和一切罪恶的根源，必须消灭个人占有生产资料的私有制。但是个人生活资料是不能剥夺的，也是不允许的，因为生活资料是个人生活的保障！许多人不明白生产资料和生活资料的概念和区别，以为共产主义是要剥夺个人财产，对共产主义产生误解和仇恨。社会主义和共产主义是要消灭个人占有生产资料的资本主义私有制，个人生活资料是保留的，不能剥夺的！\n\n　　共产主义的各尽所能，按需分配的原则是逐渐准备起来的，是随着生产力的发展和在这个基础上创造出丰富的消费品，随着确立了单一的共产主义所有制，随着社会成员达到适合共产主义的文化思想水平和觉悟程度而逐渐准备起来的。共产主义绝对不是空想，共产主义的初级阶段社会主义早已经在世界许多国家实现了。当然多数被复辟为资本主义了，这主要是因为投机分子在各国共产党内多数存在而导致的。按需分配也不是想要什么分什么，不要把按需分配理解为按欲望分配，资产阶级才是霸占生产资料按欲望消费人民的血汗的。有些人要按需分配女人更是荒谬的，资本主义社会才是把人异化为商品的。所以资产阶级说共产主义是共产共妻是极度无耻的欺骗忽悠。真正共产共妻的是资产阶级，他们霸占了人民的生产资料，进而利用生产资料榨取人民血汗，并利用这些人民的血汗占有人民的妻女，他们真正干着最邪恶的事，却把这些罪恶的勾当栽赃给别人，这是自蒋介石以来，到邓小平复辟后的一切剥削阶级禽兽的最丑恶的嘴脸。共产主义按需分配是按个人基本需要分配生活消费品，就是生活资料。分配消费品也可能有人多拿多要，所以需要消费品数量大，人的思想觉悟的提高才可以达到。(说句实话，如果不是被邓贼复辟倒退，共产主义高级阶段当今就可以在中国基本实现了。就比如现在的房地产，那么多房子，如果按人民的基本需要分配完全可以满足全国人的需要，但却被新资产阶级作为榨取人民血汗的金融炒作工具了！) 生产资料是绝对不可能分配的！在社会主义和共产主义下，生产资料都是禁止私人占有的！苏联建立初期，出现的星期六义务劳动，就是被列宁高度赞扬的有共产主义萌芽和觉悟的事件。我国真正的社会主义时期，就是毛主席时代，也有许多高度觉悟的人民踊跃为国家集体义务劳动奉献的，比如雷锋，王进喜等等，这都是向共产主义迈进的萌芽事件。（当然，现在假共的狗说雷锋是造假的，地主周扒皮是冤枉的，呵呵。他们为什么在许多媒体这么忽悠，就是要搞乱人民思想，丑化真正的社会主义。在多数老剥削阶级心中，他们对真正的社会主义时代是没什么好感的，他们当然认为雷锋是造假的，他们巴不得整个毛主席时代都是假的，是他们的一场噩梦而已，呵呵！）所以随着生产力的高度发展，消费品等生活资料的丰富，人民的思想觉悟的进一步提高，实现共产主义是很自然的事情，绝不是什么空中楼阁或乌托邦的幻想！而私有制社会才是不会长久存在的乌托邦，中国历史上的改朝换代就是私有制是乌托邦的铁证，私有制造成人民被残酷剥削压迫奴役，必然导致人民的反抗起义，造成中国历史上不断的血腥周期律的上演。有人会说私有制几千年了，很长久。这是错误认识。因为没有人发现真理，所以跳不出私有制的怪圈，直到马克思发现了真理，才使人类看到了希望并使得世界许多地区一度跳出了私有制的怪圈。虽然许多社会主义国家被颠覆了，但人民并没有摆脱私有制造成的各种灾难，如果不进行社会主义革命，也跳不出私有制的罪恶怪圈的。假共就是通过各种媒体和各种叫兽砖家欺骗忽悠人民群众，忽悠人民共产主义是幻想，是不可能实现的乌托邦，来从思想灵魂深处让人民否定共产主义，从而为资本主义的合理性找借口，为稳定资本主义私有制社会而洗脑人民群众，让人民放弃反抗，进而让人民认同资本主义私有制好，资本主义是民主自由的，美国的资本主义更是民主自由的灯塔等等骗人的无耻谰言！所以，一个反动叫兽要比千百个流氓无赖黑社会分子对人民的危害更大更严重、罪行更深重！\n\n　　文革就是为了避免当今的资本主义复辟而发动的，复辟禽兽以为人民家里都没有老人吧，老人都是糊涂的好骗的吗，呵呵！现在的结果已经使得无数的老人明白了文革的伟大正确！复辟禽兽自欺欺人的堵住人民的嘴污蔑文革，自以为把文革和毛主席彻底否定胜利了，真是十足的阿Q！\n\n\n\n　　假共文犬李泽厚提出反动的告别革命论，告别革命论把革命丑化为洪水猛兽、只破不立, 从辛亥革命开始，否定近代的一切革命。告别革命论者宣布: 21世纪不能再革命了, 这种对21世纪发号施令、挥舞指挥棒的主张, 听起来是十分滑稽可笑的，表现了新资产阶级的极度恐惧的心理。曹思源编出《人间正道私有化》反动书籍，为假共的复辟鼓吹呐喊，为假共抢劫国企，抢劫人民的生产资料叫嚣助威。老文痞作家王蒙呼吁青年人拒绝崇高，其实就是羞羞答答地追求堕落的表白。中年著名痞子作家王朔直接教导做流氓。这些反动文痞就是假共放出的各种反动文犬，忽悠人民不要革命，要追求堕落生活（资产阶级的奢靡堕落生活可不是谁想过就能过的，那是霸占了生产资料的剥削阶级的特权），忽悠人民私有制是合理的，为维护资本主义社会的稳定而愚弄人民群众。当然还有各种书刊报纸媒体，刊登各种反动的封资修的内容。我有一批当今的社科类的书籍，里面几乎都是或明或暗的反毛主席，反文革，反社会主义的内容，许多都揭露共产主义是所谓乌托邦和幻想。这些是什么东西，都是假共的文痞，忽悠欺骗人民大众，我在没有接触周群思想前，也相信了他们的某些言论，就是被欺骗了。当我学习了周群思想就彻底看穿了这些砖家叫兽的反动本质。这些家伙大多是经历过文革的中老年高级资产阶级知识愤子，对真正的社会主义时代极其仇恨的反动文痞！\n\n　　\n　　假共的电视媒体现在大都是上演封资修的影视剧欺骗愚弄人民。如80年代初引进了反动的电视剧《上海滩》，把黑帮头子塑造成有血有肉的充满人情味的英雄形象，还编造了个凄美的爱情故事，欺骗了无数无知的人，其实真正的黑帮头子能有人情味吗？！这个剧就是假共呼唤狗腿子的招兵令，因为它们毕竟戴着共产党的帽子，许多坏事公开干不方便，因此迫切需要一批不穿制服的狗腿子。此后，中国大地假共豢养的黑帮狗腿子就开始出现了，假共就是最大的黑社会团伙，全国各地的黑社会都是假共经营管理的！假共的许多抗日电视剧也非常有毒，比如在这类电视剧里歌颂各种军阀土匪抗日，其实这类人抗日也应该给与肯定，但假共通过歌颂他们给人民下毒药，不懂马列毛周群思想的很容易被骗，其实就是把阶级矛盾转移到民族矛盾上。军阀土匪这类货对人民的残害不比外敌差，事实上，这类货在日本鬼子侵略中国时，许多都成了汉奸，就比如张作霖那个土匪班子成员的许多人都成了伪满洲国的高级官僚，还是骑在人民头上作威作福。但假共的电视剧里只要这类货抗日了，反抗外敌了，仿佛他们剥削压迫奴役人民的一切罪行就没有了或就可以一笔勾销了，不但如此，这类货好像还成了圣人似的，真是纯粹的愚民谎言闹剧。当今的假共头子习近平的老娘们彭某在80年代的电视剧《聊斋志异》主题曲里唱出了“牛鬼蛇神倒比正人君子更可爱”的无耻论调，三十多年了，实践检验出牛鬼蛇神就是牛鬼蛇神，你再怎么为他们歌功颂德，再怎么为他们讴歌，他们也成不了正人君子，更不可能比正人君子可爱。这都是愚民的谎言闹剧。许多人如果认为那歌曲里的牛鬼蛇神就是指电视剧里的鬼怪，那就被欺骗了，他们正是通过这类电视剧为曾经的牛鬼蛇神正名。2013年中秋节期间，我还见过商场里卖月饼的包装上写着黑五类的字样，呵呵!\n\n　　\n　　《狼图腾》这本毒书是2004年出版的，其实04年前，中国已有非常多恶狼当道了！现在作者该更满意了！当今神州更是恶狼遍地肆虐了。这本毒书就是歌颂弱肉强食的社会达尔文主义，歌颂法西斯罢了，为当今的中国新剥削阶级奴役压榨人民找个歪理邪说。直接宣扬法西斯弱肉强食的社会达尔文主义太露骨，批了件狼外衣，以发现了什么新大陆似的面目推出！这书的作者吕加民本身就是个民运分子，本身就是条恶狼，先后抛弃两个妻子，不折手段的向上爬的垃圾，和76年的四五运动的人员有些瓜葛，进入了所谓四五英雄的群体，也就是高干子弟群体，他本身也是个干部子弟，和曹思源是同学，而这个曹思源也是个恶畜。这个吕加民的哥哥是吕加平，是揭露江泽民恶畜的罪恶历史的人，不过他也是个民运分子。吕加民还积极参与了79年的所谓西单民主墙运动，这些恶狼当然追求资本主义的民主自由了，就是禽兽的民主自由！\n\n\n　　从众多资料来看，姜戎（狗图腾作者的笔名）的确是个充满狼性的投机政客。其人生轨迹，就是一个残忍狡诈的狼的一生。而被它伤害欺骗出卖过的人们，则全部被它视作理该被弱肉强食的羊。如今他又借《狼图腾》这本书来宣扬自己的狼的哲学，并通过炒作和利用如今国内道德底线崩溃民众（羊们）没有精神归依的机会而一举成名。这个现象，的确应该引起有识者关注。 正如我们曾讨论过的，羊是一种愚昧无知胆小又喜欢跟风的动物。羊被狼残害却仍高举狼图腾山呼万岁的，中国有之，外国亦有之。姜戎宣扬的玩意儿，不是什么新东西了，不过是几千年的“吃人”哲学，换成“吃羊”而已，还要穿上“可持续性发展”和“人文学术思考”的华丽新衣，招摇过市，便被有钱有闲一族和文化政治吹鼓手们炒的火热。什么叫“狼狈为奸”？请看中国二十一世纪有关《狼图腾》炒作之怪现状。到了洋人来凑这个热闹，赏了几角碎银子，羊们也开始迷惘：洋人都这么看重，可能狼性真的是高于咱们羊性吧？——这是网上的一段很不错的评论，让羊高举狼的图腾，崇拜狼，这还是人文领域的阶级斗争，就是让被剥削的劳动人民崇拜残害他们的剥削阶级禽兽。按禽兽的思维去行事，结果当然是万劫不复，因为人民的生产资料已经被剥削阶级霸占，广大的劳动人民也不是狼，就算是去按狼的行为去行事，也基本是不可能成功的事情，就像毒剧《大宅门》里的郑三旦，他说他干不出来白景琦干的那些缺德事发家致富，其实他只讲对了一半，因为一个穷小子如果拿一包屎当宝贝到当铺诈骗去，不被打个半死才怪，而白景琦去骗能成功，是因为那被骗的早已经知道他是大宅门的少爷了！在今天中国的资本主义社会里也一样，许多大诈骗犯背后有假共高官的保护，结果就没什么事，许多平民搞大点的诈骗都被抓被判刑了。网上传有这么一段话：中国就有这么一群奇怪的人, 本身是最底阶层, 利益每天都在被损害,却具有统治阶级的意识。在动物世界里找这么弱智的东西都几乎不可能。有人说这段话是林语堂说的，不管是谁说的，这段话表明了说话者感到许多社会底层人的思想意识的颠倒错位和为此感到很怪异。也说明了说话人不懂马列毛思想，因为懂马列毛思想的人很容易看出，这是剥削阶级愚民的后果。因为从思想意识上愚弄普通民众，让他们充满剥削阶级思想，正是剥削阶级人文领域对无产阶级的阶级斗争，其目的是稳定剥削阶级社会，和为了培养更多的狗奴才。所以剥削阶级的各种腐朽反动思想不仅仅是剥削阶级所独有的，几千年的剥削阶级的各种思想也根植于多数普通民众的头脑中，所以毛主席发动的文化大革命也是要革除中国多数人头脑中的各种剥削阶级有毒有害思想。\n\n　　假共的智障团伙实在没有什么忽悠手法了，用狗腿子民运分子和法轮功忽悠起国民党和蒋介石来了，说国民党抗日，蒋介石伟大，民国是民主自由的，呵呵！所以在中国的网络等媒体上不时出现了歌颂赞扬民国，讴歌蒋介石的奇景。在所谓的共产党国家，出现了热情讴歌自己曾经的敌人的奇怪闹剧。其实一点不奇怪，他们本来就是混进原来的真正的共产党内的剥削阶级分子，从内部政变推翻了真正的共产党。民国就是资本主义社会，讴歌民国就是让人民认同资本主义社会是好的，是民主自由的，呵呵。其实假共就是国民党嘛，甚至比国民党更邪恶，不过他们戴着共产党的帽子而已，欺骗性很大。可惜他们太急了点，那么多经历过民国的老人都健在，他们的子女后代应该更相信他们才是，他们没有理由欺骗他们的后代。\n\n　　韩寒这个所谓的作家，在2012年初被揭露是个骗子。结果假共还是不揭穿他，他还是一如从前的招摇撞骗。可见这个骗子也是假共弄出来的，也是个愚民的工具，就是欺骗年轻人不好好学习也照样能成名成功。其实，资本主义社会，贫民子弟不管学习好坏与否都基本是不可能成功上升的，因为资本主义社会的鸿沟是很深的，资产阶级也不会随便允许平民进入他们的圈子的，他们才是最有阶级意识的。假共的媒体也提出了阶层固化的问题。但不管怎么样，不好好学习是不行的，因为不掌握一定的知识，始终是被资产阶级愚弄的对象。这就是假共制造韩寒骗子的目的，为的是愚弄青年人，好维护资本主义社会的稳定。韩寒是个假天才，不管真假，假共总是宣扬天才，这是为什么呢？马克思恩格斯早就一针见血地指出了，就是为了得出这个最终的结论：应该由贵人、贤人、智者来统治！宣传天才，宣传崇拜天才就是为了维护资产阶级的统治，认为天才就是应该获得远远超越普通人的财富资源，为资产阶级霸占人民的生产资料提供所谓的理论依据，用以愚弄人民！\n\n　　假共极度恐惧暴力革命，派出文痞忽悠人民不要以暴制暴，暴力只能带来暴力或更大的暴力，会出现暴力循环，许多人被欺骗，也反对暴力革命，认为暴力革命会带来灾难。文痞们要人民面对各种禽兽的残酷的暴行要理智，要克制，要按法律办事，真是无耻到极点了！按假共文痞的说法，那抗日也不用了，那也是暴力，只能是暴力循环，简直是精神病的说法，就这也欺骗了很多的人了。事实上，反动暴力集团都是被暴力推翻的，如日本法西斯，德国纳粹，如果不以暴制暴，人类将万劫不复！而且以暴制暴是唯一的办法！毛主席说过句很经典的话：凡是反动的东西,你不打,他就不倒。这也和扫地一样,扫帚不到,灰尘照例不会自己跑掉。\n\n　　2014年7月，陈毅的儿子陈小鲁谈了他对文革的反思，并表示文革是共产党体制必然的结果，体制问题总有一天要解决。 这个文革中的联动反革命，就是希望摘去共产党的帽子，彻底否定共产主义，好免遭惩罚和保住自己的抢劫成果！朱镕基的儿子朱云来也跳出来谈制度问题，忽悠人民现在的种种社会问题是社会主义带来的，资产阶级大家族的许多人纷纷跳出来公开否定社会主义制度，为的就是要摘帽或解体国家，提前发声以反体制的英雄的面目出现，好免遭人民清算和保住抢劫果实。最近他们表现的有些急不可耐了，说明当下社会问题的严重性。\n　　\n　　\n　　许多人不知道吧，忽悠共济会的何新，是假共高层的所谓智囊，其实就是邓贼的狗腿子之一，他忽悠共济会的目的就是转移阶级矛盾，转移年轻人的视线而已。这个何新还被称为预言家，许多不知真相的人，还挺崇拜他。他能预言什么，笑话。他不过是知道主子的内幕消息，根据主子的政策和内幕信息，先说出这些政策的结果罢了。假共忽悠年龄大不懂政治的普通人，用封建迷信思想欺骗愚弄，对于年轻人则用什么共济会、愚乐新闻、特异功能、远古文明、外星人等等转移年轻人视线或欺骗愚弄他们。对于大众中资产阶级思想严重的用民运分子忽悠，对于掌握一定马列毛思想的人用假左欺骗忽悠。网上用五毛来欺骗忽悠大众，五毛就是假共培养的替他们说话的狗，用以在网上引导舆论的工具。假共给他们一个称呼叫作网络评论员，简称网评员，五毛得名于他们回复一贴就给他们狗粮五毛。当然直接替假共说好话，太露骨，很容易被揭穿被嘲弄，因而五毛也打扮成不同的角色，有的装作民运分子，忽悠欺骗人民美国的政治制度好，愚弄大众接受美国的所谓民主，来为摘帽聚集民间基本力量，有的扮作左派、毛派欺骗人民，欺骗人民假共要左转了，忽悠人民谁谁上台就有希望了。假共用自己的各种狗或棋子欺骗不同类型的人或转移人民的视线，把阶级矛盾转移到民族矛盾上，让人民去仇恨假想敌人，比如美国，日本等。其实当今人民的最大敌人就是假共禽兽团伙。假共最近几年的对内镇压人民的维稳费早已经超过了军费，假共早已经把人民当成了最大的敌人了，假左等假共的狗却忽悠人民敌人是美国，日本等等，简直是太可笑了。\n\n   \n　　2014年6月底假共头子习近平开展的所谓打老虎反腐运动，处理了徐才厚，周永康等所谓的大老虎，目的主要有三点：一是打掉自己的反对势力，换上自己的爪牙，二是为了抢劫这些家伙贪腐的财富自己吃饱，三是欺骗人民群众，让人以为他是动真格的，真正在反腐，骗取人民的信任维护资本主义社会的稳定。\n\n\n　　下面介绍中革中央（中国无产阶级革命中央委员会），这是当今唯一公开提出推翻假共的革命毛派组织，是真正的左派，是最强大的政治力量，因为中革的基础是觉醒后的人民群众。中革中央于二零一零年七月一日成立。目前，革命三要素早已经具备，革命灵魂人物是革命导师周群，革命核心力量是中革中央，革命理论是马列毛主义周群思想！\n\n　　中国无产阶级革命中央委员会，简称“中革中央”。发起者为中国江苏省苏州市周群同志，周群同志原是江苏省苏州市一名普通工人，1992年下岗后独立思考、积极探索，把马列主义、毛泽东思想同中国具体革命实践相结合，形成当代中国的马列主义——周群思想，周群同志通过自己的不懈努力一步步成为中国当代伟大的无产阶级革命家。2002年起周群同志致力于无产阶级革命理论的宣传工作，并发起成立中国左翼联盟，2006年起周群同志努力构建全国各地共产主义小组，但遭到中国无产阶级革命事业最主要敌人假左的疯狂破坏。2010年3月，周群同志宣布组建中国无产阶级革命中央委员会，并致力于培养中国无产阶级革命家，构建中国无产阶级革命中央委员会核心力量。\n\n　　中革中央是目前中国唯一高举马列主义、毛泽东思想伟大红旗，致力于推翻资本主义私有制，重建社会主义公有制的无产阶级革命组织。是唯一能引领中国劳动人民再次翻身解放的坚强力量。\n\n　　中革中央以马列主义、毛泽东思想、周群思想为指导，在正确认识和判断当前中国执政的是假共产党，中国社会是假社会主义的基础上，明确提出了推翻资本主义私有制，重建社会主义公有制的革命目标。围绕这个革命目标，结合当前中国无产阶级革命实践，制定了具体的革命步骤：\n\n　　第一步：培养一大批具有高度思想境界、理论水平、思维能力的无产阶级革命家和革命者，构建中革中央核心力量；\n\n　　第二步：不断宣传发动人民群众，在革命内因、外因结合时机成熟时，高举造反有理的革命大旗，一举推翻资本主义私有制，重建社会主义公有制，建立无产阶级专政，以保证人民群众真正当家作主；\n\n　　第三步：在无产阶级专政下继续革命，进行彻底的全面的无产阶级革命思想大普及思想大竞赛，以捍卫社会主义公有制，捍卫无产阶级革命胜利成果。\n\n　　中革中央认为，人类近百年的历史就是资本主义私有制同社会主义公有制两条路线的斗争史；马列主义、毛泽东思想的核心和精髓就是造反有理；周群思想是运用马列主义、毛泽东思想精髓，结合当前中国无产阶级革命实践产生的革命思想，是当代中国的马列主义，是引领全国劳动人民推翻资本主义私有制重建社会主义公有制从而真正当家作主的有力思想武器。\n\n　　中革中央认为，真共产党是致力于消灭剥削压迫追求共产主义的政党，假共产党就是制造剥削压迫不信仰共产主义的政党；真社会主义是全国人民共同拥有生产资料，没有任何个人可以私自占有生产资料以剥削压迫他人的社会制度，假社会主义是少数人霸占全部生产资料残酷剥削压迫人民的社会制度。以此为标准，中革中央认为，毛泽东同志缔造的真正的中国共产党，自1976年投机分子发动反革命政变后，逐步蜕变成假共产党，成为官僚买办资产阶级的法西斯政党；以此为标准，中革中央认为，中国人民的不孝子孙、无产阶级革命事业的投机分子邓小平一步步把毛泽东同志创建的社会主义社会复辟倒退成资本主义社会。\n\n　　中革中央认为，唯有明确提出打倒官僚买办资产阶级十大家族，推翻资产阶级政府，消灭资本主义私有制，重建社会主义公有制的革命目标，并为之不懈奋斗，才能引领吃二遍苦受二茬罪的中国劳动人民彻底消灭剥削压迫，重新翻身解放，实现人民真正当家作主。\n\n　　中革中央认为，无产阶级革命事业的成功，不仅需要大批具有高度思想境界、理论水平、思维能力，勇于实践、善于斗争的无产阶级革命家和革命者不断涌现形成中革中央核心力量；更需要身受国内外反动派双重剥削压迫处于水深火热之中的广大人民群众的觉醒。因此，无产阶级革命阵营唯有高举造反有理的革命大旗，广泛宣传、充分发动广大人民群众，无产阶级革命事业才能一步步从胜利走向胜利！ 无产阶级革命成果才能牢牢得到捍卫！\n\n　　中革中央认为，无产阶级专政下捍卫社会主义公有制，捍卫无产阶级革命成果，必须开展全面彻底的无产阶级思想大普及和思想大革命。只有人人拥有独立思考能力，人人拥有分辨是非能力，人人拥有造反有理精神，才能不断把社会主义事业向前推进，才能永葆无产阶级革命政权永不变色。\n\n　　中革中央旗下真共党宣布成立于2012年5月16日，多数党员同志光天化日之下走上街头，在全国各地张贴传单，拉出横幅，在人民群众面前公开讲演，揭露假共十大家族的罪恶，揭露当今是假共产党假社会主义的现实。中革这样多次公开发动人民群众，假共的所有媒体没有任何报道，这也是很正常的，但被民运分子歌颂的所谓民主自由的西方媒体也没有任何报道，法轮功的网站也没有任何报道，可见在资本主义世界，对共产主义运动抵制立场的高度一致性。\n\n\n　　维权不如造反夺权，为人民服务的共产党1976年10月6日就亡了，人民的共和国也于同日亡了。所以人民已经是亡国奴了，哪有什么权利？！因此要造反夺权。上访下跪祈求官僚更是无用的，资产阶级官僚怎么会替人民做主，要自己夺取权力，自己为自己做主才是，培养自己当家做主的意识。骂禽兽下地狱更是没有丝毫用处，要亲自动手送禽兽下地狱才是最好的办法！毛泽东思想就是推翻资本主义私有制，建立社会主义公有制的经验教训的总结。革命无罪，造反有理！！！！！！"
		},
		{
			"post_id": 6,
			"title": "看了这个后你还会认为Youtube、Facebook是言论自由的地方吗？",
			"date_published": 1463142514.883,
			"body": "李国亮讨伐脸书、Youtube管理员檄文\n\n\n　　中国无产阶级革命中央委员会（简称：中革中央）是中国唯一以马列毛主义、周群思想为指导，大力鼓动老百姓醒觉起来推翻资本主义私有制、建立社会主义公有制的无产阶级革命组织。\n\n　　中革中央革命者李国亮（真名：李梓廉）向应中革中央的鼓动、宣传革命的号召，义无反顾地为中国人民冲破假共产党资产阶级政府所设的网络障碍，在海外网站发表中革中央文章及有关信息，让港澳台、海外华侨的老百姓得知中革中央宣传信息，籍此鼓动港澳台、海外华侨老百姓醒觉起来推翻资本主义私有制、建立社会主义公有制。中革中央革命者李国亮多次在脸书、Youtube发表中革中央文章和连接的留言，而脸书、Youtube管理员却对中革中央革命者李国亮进行封锁，即使中革中央革命者李国亮不断注册用户、不断发表留言，脸书、Youtube管理员有如丧心病狂般那样，不断疯狂地进行言论封杀、用户封锁。\n\n---\n　　中革中央革者李国亮在脸书、Youtube发表鼓动老百姓醒觉起来推翻资本主义私有制、建立社会主义公有制的言论是有益于人民是好的言论，是符合不喜欢剥削压迫的群体即人民的追求，任何有良知的人也会义无反顾地向应正义的事业，而脸书、Youtube管理员的良知却如被狗吃了那样接受营造剥削压迫的资产阶级政府指令，对中革中央革者李国亮发表有益于人民是好的言论进行打压，这分明是与中国人民为敌。脸书、Youtube管理员的行为是对人类良知的严重挑衅，是名副其实的畜生行为。\n\n　　现在警告脸书、Youtube管理员切勿再对中革中央的宣传进行言论封杀、用户封锁，对革命者进行言论封杀、用户封锁是反革命行为，与中国人民为敌的下场是不好过的。将来中国人民翻生解放，必然对此种反革命行为进行血债血偿式清算加惩罚，别要以为身处美国就安全，不论反革命者来自那个国家和民族，只要是破坏和阻碍中国人民的革命，血债血偿式清算加惩罚也适用于任何国家和民族的反革命者及其家庭成员。也不要以为美国资产阶级政府会保护你和你家庭成员，美国资产阶级政府最终会为了自身的外交等利益来把你和你家庭成员出卖，甚至其会主动为了销毁不利自身东西而把你和你家庭成员灭口。\n\n　　因此，脸书、Youtube管理员在执行封锁工作前，无论是出于主动、还是受公司上司或政府部门指令，请慎重考虑清楚应否接受执行工作，否则将来遭受血债血偿式清算加惩罚，后悔也为时已晚。\n\n李国亮\n2015年2月19日0时"
		},
		{
			"post_id": 5,
			"title": "腾讯公司反革命事件",
			"date_published": 1463140816.53,
			"body": "腾讯公司在明知道中革中央做的是宣传发动人民打倒假共、打倒十大家族、推翻资本主义私有制、建立社会主义公有制的革命工作，本来完全可以做到与无产阶级革命阵营井水不犯河水，接到垃圾畜生的举报就推给网警了事，但腾讯高管是铁了心要替十大家族当低级炮灰、替罪羊，是铁了心要与中国人民为敌！先前不断地对中革中央用于宣传发动人民群众的QQ群进行封群，后又故意限制革命者、革命家QQ帐号的功能，让我们不能在QQ群里打字、发图。最近更有甚者以违反为资产阶级服务的法律的借口直接冻结多位无产阶级革命者、革命家的QQ帐号，这也明确地表明了腾讯公司高管就是要维护、捍卫资本主义私有制社会，就是要为十大家族充当鹰犬走狗，这是严重的反革命行为。中革中央于2013年12月27日专门向马化腾等腾讯高管发送了警告信，但他们还是置若罔闻，仍然死不悔改、明目张胆地捣乱革命，无产阶级革命阵营早已把腾讯公司高管如何捣乱破坏革命的相关证据保留下来，将来中国人民革命胜利后交给中国人民，凡是参与捣乱破坏革命的相关人员必定会被中国人民以“反革命罪”进行家族式血债血偿清算加惩罚。\n\n---\n\n　　腾讯公司高管这种明知故犯破坏中国人民翻身解放大革命的现行反革命犯罪，是在公然向全体中国人民明确表达一个意思：中国人民中凡是冤死了父母的人全都该去索腾讯高管父母的命；中国人民中凡是冤死了儿女的人全都该去索腾讯高管儿女的命；中国人民中凡是冤死了兄弟姐妹的人全都该去索腾讯高管兄弟姐妹的命；中国人民中凡是冤死了亲朋好友的人全都该去索腾讯高管亲朋好友的命。\n\n\n　　所以，中革中央顺应这些畜生腾讯高管要实现自己家族被灭的要求和愿望，把腾讯高管的反革命事件到处宣传。让中国人民都知道并 且记下腾讯高管的反革命、反人民丑恶罪行。如果中国人民不想再被人骑到头上剥削压迫、作威作福；如果中国人民不想再吃三遍苦、受三茬罪；如果中国人民还有出息、血性的话，那么等到因为十大家族剥削压迫导致的大革命爆发后，对腾讯高管的父母、\n儿女、兄弟姐妹和亲朋好友实施血债血偿清算加惩罚的行动吧！并且这是一场绝不能有漏网之鱼的全球性不达目的决不停止的无限时、无止境追杀！\n\n\n　　此外，基于中革中央是最仁慈、最善良的无产阶级革命者和革命家所组成，因此特此加发劝告：凡曾经是腾讯高管朋友 或者腾讯高管周围的人，请赶快第一时间远离腾讯高管与腾讯高管彻底划清界线！否则被视作腾讯高管的亲朋好友而遭到中国人民的血债血偿清算加惩罚，一概是源于你自己不赶快远离腾讯高管所导致的后果，绝对不是我们中革中央没有事前对你郑重警告！更绝对不能怪\n中国人民的仇恨能量如同火山爆发的巨大威力！\n\n\n                                                                                         \n\n\n中国无产阶级革命中央委员会\n2015年3月5日"
		},
		{
			"post_id": 4,
			"title": "服从假共十大家族命令抓捕革命者的反革命军警必将被血债血偿！",
			"date_published": 1463139294,
			"body": "　　近日，德国地方法院以谋杀共犯的罪名，判处前纳粹党卫军成员、曾于二战期间在波兰奥斯维辛集中营担任记账员的Oscar Goening四年监禁。虽然作为记账员，奥斯卡并未直接杀人，但是按照德国刑法，谋杀共犯的罪名并不冤枉。\n\n---\n\n　　1947年，波兰开始奥斯维辛集中营审判，40位被告39人获刑，良心医生拒绝上级命令，被无罪释放。以此为代表，德国人开始反思纳粹罪行。\n\n　　在纳粹德国战败后，同盟国组织了纽伦堡审判。因为该审判所针对的主要是纳粹德国的军政首脑，对中下级军官完全没有涉及，加之1947年前德国去纳粹化流于形式，所以德国人普遍认为，纳粹只是国家与军队领导人的责任。而这架杀人机器上为数众多的“零件”，只是在单纯地执行命令，无需为罪行负责。真正促使德国人对纳粹反思的，是对集中营惨状的揭露与对相关人员审判，这又以对奥斯维辛集中营相关人员的审判为代表。因为奥斯维辛为波兰领土，故1947年时，波兰在克拉科夫展开了对奥斯维辛集中营管理人员的审判。审判共涉及40位被告，从集中营负责人到守卫乃至司机均有涉及。这40位被告有39名被判有罪，其中21人被判死刑并立即执行。\n\n　　唯一被判无罪的是曾在集中营中担任医生一职的Hans Münch，因为其拒绝执行上级指派给他的犯人“甄别”的任务（在犯人下火车后决定哪些人应该被送入毒气室处死，符合处死标准的大都是不能从事体力劳动的人，以及不愿意与孩子分开的母亲），所以最终法庭确认他与发生在集中营中的屠杀无关。据集中营幸存者Louis Micheels在审判中所说，集中营关闭前，Hans Münch所做的最后一件事就是给了他一把左轮手枪来帮助其逃跑。在美国作家Robert Jay Lifton的《纳粹医生》一书中，称Hans Münch认为“希波克拉底誓言（是希波克拉底警诫人类的古希腊职业道德的圣典，是约2400年以前中国孔子时代，向医学界发出的行业道德倡仪书，是从医人员入学第一课要学的重要内容，也是全社会所有职业人员言行自律的要求，而且要求正式宣誓，没有医护人员不知道希波克拉底这位历史名医名言的。）远重于党卫军的命令”。\n\n　　1963到1965年德国在法兰克福审判奥斯维辛集中营中下层管理人员，审判中确立了“服从即有罪”的原则，使得“服从命令”不再是纳粹分子逃脱法律制裁的借口。而1979年德国联邦法院取消了特别手段谋杀的追溯时效，使得德国能够做到对纳粹分子的无限期追则。高龄纳粹分子获刑，恰恰体现了德国对于清算纳粹罪行的决心。\n\n　　2009年，前集中营看守John Demjanjuk受审成为了纳粹罪行无限期追责的里程碑式事件。当年，91岁的Demjanjuk被引渡至德国受审。法庭上Demjanjuk像以往的纳粹集中营工作者一样坚称自己“从未亲手杀人”，而且“连杀鸡都要交给妻子来做”，但法庭并不为所动。2011年，Demjanjuk作为谋杀共犯被判处5年有期徒刑，判决中写到：“有28000人死在索比布尔集中营，没有哪个守卫能置身谋杀之外。”这一案件的审理为更多纳粹大屠杀罪犯的审判提供了先例。2013年，德国负责调查纳粹罪行的“中央办公室”向检察机关提交了30名前奥斯维辛集中营人员资料，建议对其提起诉讼。\n\n　　2013年7月23日，数以千计“通缉纳粹战犯”的海报在德国柏林、汉堡等几大城市张贴。海报以纳粹集中营的黑白照片为背景。上面用德文写着“迟了，但还不算太迟”这是战后60多年来的惯常一幕。德国对于纳粹的罪行，直至今天仍然在反省和清算。\n\n　　2015年1月27日，德国总理默克尔在奥斯威辛集中营解放70周年之际提出拒绝承认罪责即为共犯 。 默克尔说：“德国人对于发生的一切深深地感到羞愧，因为德国人对于数百万人的痛苦和死亡负有罪责，并且有一些德国人对于这些予以容忍，德国人过去是犯罪者和协同犯罪者，那些拒绝承认这一点的人，他们是沉默的共犯。”\n\n相关链接：http://news.163.com/15/0720/03/AUUGIODC00014JHT.html\nhttp://v.ifeng.com/documentary/m ... -2c440db7f4d4.shtml\n\n\n    \n\n\n　　以上是转载的内容，德国对纳粹战犯的追捕一直没有停息，对共犯的处理也是很严酷的，没有时间限制的追查，对战犯的惩处非常严苛。当然，德国还是资本主义国家，真正残害人民的幕后罪犯，那些资助希特勒的大资本家，至今还没得到惩罚，德国清算纳粹还不够彻底。尽管，德国清算纳粹还不够彻底，但有关清算纳粹的行动仍起了震撼效果。 对战犯的审判中确立了“服从即有罪”的原则，使得“服从命令”不再是纳粹分子逃脱法律制裁的借口。举这个例子是让借口服从假共的命令抓捕革命者的警察清醒一下。所以，假共的军警抓捕革命者革命家后，以服从命令来推脱罪责，逃脱惩罚是十分幼稚可笑的。服从假共命令抓捕革命者革命家就是罪！是反革命的大罪，是葬送整个家族的大罪，还有配偶的整个家族。\n\n　　不要讲上级命令不服从不行，不要说上级逼迫也是无奈没办法啊！个人的选择权力是有的，不要狡辩什么为了混口饭吃，那都是无耻的无赖的说法！ 就比如军警镇压人民，你们会说服从命令，混口饭吃，这都是邪说，命令你可以不服从，你可以选择不干！至于说为了吃口饭，更是胡说八道，无数劳动人民都艰苦地生存着，也没有你们的福利待遇，怎么你不干军警就活不了了，天大的笑话！！！你不干军警可以干别的谋生，找不到工作可以要饭去！要饭也比整个家族被灭绝强吧，你是要脸还是要命？！不想干别的，无非是当小主子当习惯了，无非是军警待遇高，还可以骑在人民头上作威作福罢了！！！也有军警待遇低，还反革命，那就愚不可及了！ 任何禽兽想为自己的兽行狡辩是没用的，你们逃脱不了被血债血偿的！！！ 反革命军警整个家族被灭绝的命运和拒绝服从假共命令的轻微后果，哪个轻哪个重？正常的头脑应该能想明白！\n\n　　血债血偿理论没有任何时间限制。有许多脑残白痴认为，即便革命胜利了，它们也死了。其实，你们死了一点不要紧，你们还有家人嘛，革命胜利越晚，你们的家族人数越可观，基因根绝的场面就越壮观，对各种禽兽的震慑效果就越好！假共的警察以为抓捕革命者没有留下书面或音像证据，就没事了，幼稚的可笑！只要你们出警了，谁也跑不了，每个革命者所在地区的派出所等地方的警察，将来都将接受调查，当今的科技，你们跑得了吗？！当年杀害刘胡兰的畜生都被调查出来惩处了。1923年镇压工人运动，制造二七惨案的刽子手赵继贤，解放后都被调查出来并枪毙了。时间过了近30年都抓捕处决了。企图通过时间消耗掉血债能量是极其幼稚愚蠢的，而且周群思想的血债血偿理论是针对整个家族的，你以为你死了就了结了，幼稚愚蠢可笑！\n\n　　学学纳粹集中营的医生Hans Münch吧，对你们整个家族都是有好处的。纳粹集中营的看守、司机、医生、记账员等许多人没有亲自直接参与杀人，还是受到惩处了，被判刑了，被处死了。因为它们是集中营的共犯，没有它们，整个杀人集中营也运转不起来，所以，它们被惩罚一点不冤枉。军警也是假共国家机器的一部分，我们认为你们是被蒙骗的，跟你们说清楚了周群思想，讲明了道理，还执迷不悟的替假共卖命，抓捕革命者革命家，那就是铁定的反革命行为。纳粹集中营的共犯是判刑处理的或处死本人的。反革命军警可没有这么好的结果的。反革命军警的整个家族都将彻底消失在这个星球上的。你们的主子绝不会带着你们逃跑的，你们在假共头子眼中根本赶不上它们家的宠物狗。即便你们的主子特喜欢你们，特爱你们，它们想把你们全带走，也没有哪个国家能收留这么多狗奴才的，呵呵！欧美等国家也不需要你们这些低等狗奴才的。或许你们会认为谁抓捕革命者了，假共就会把谁的家族弄到国外去或你们自己整个家族跑到欧美，这都没有什么意义。你们或许认为许多贪官在欧美留下了，躲到欧美或许能存活。但你们要想好了，血债血偿理论没有任何时间地域限制，不达目的决不罢休！革命胜利后，动用整个国家机器追捕反革命！欧美能否永远强大，还是个很大的问题。当今，欧美已经显露出了自己的衰弱趋势了，呵呵！没有邓贼等的倒退复辟资本主义并投降欧美出卖国家民族的一切资源供养欧美，欧美早都衰弱甚至崩溃了，是假共犯罪团伙的投降挽救了欧美资本主义阵营，暂时避免了列宁预言的资本主义的总崩溃。邓贼等对世界劳动人民都犯下了滔天罪行！\n\n　　许多警察可能认为抓捕革命者是立功升官发财的绝好机会，迫不及待地向主子邀功请赏。你们或许会得到重赏，但请记住，这也是你们家族的最后的晚餐！革命爆发前，假共头目一定会掐断自己反革命的罪证，你们底层的狗会莫名其妙的死亡或被自杀！你死了，是假共弄死的。但你的家族未必会全死，你的家族将继续承受革命爆发后，人民的血债能量的，将彻底被基因根绝，你被假共弄死，你的家族也逃脱不了被灭绝的必然结果！不要以为革命阵营会可伶你们挽留你们的家族，血债血偿理论是刚性的，是谁也不能篡改的！还有军警认为，血债血偿理论涉及家人不人道，也是可笑的说法。每天都有人民不断地被资本主义制度残害而死，这难道是人道？ 一些畜生或许会说，这和它无关。是无关还是有关，看你的行为，抓捕了革命者革命家，阻碍了人民翻身解放，每天死伤的人民有好几万，那就都和你有关系了。人民晚翻身一天，被害死的就是好几万，反革命整个家族被灭杀都偿还不了被害死的人民群众的生命的。血债血偿理论，对被害死的大量人民群众没有丝毫公平可言，对被残害致死的人民群众才是不人道的，不公平的。而且，对反革命讲人道也是很可笑的愚蠢的，革命阵营自然不存在这种蠢人！！！还有的军警不学习不看革命理论，革命者讲解也不听，或假装听不懂，坚决抓捕革命者，铁了心反革命。这是白痴蠢货，最后也不会因为你不懂就能逃脱免罪的，整个家族也是要被根绝的。装傻是逃脱不了灭亡的，呵呵！不能因为愚蠢，反革命就无罪了！愚蠢也要付出愚蠢的惨烈代价。中国人民因为华国锋那个蠢货吃的苦受的难太多太冤了，所以，对于蠢货反革命也要毫不留情地基因根绝！\n\n　　跟这些白痴蠢货，或自以为聪明的傻瓜说多了无用，它们只服从主子的旨意，也只驯服于枪炮，几千年了，这类崇拜强权的被驯化的奴才多得很，谁最强大，就投靠依附谁，谁最强谁就是它们的主子，它们就是乖乖狗！它们只相信所谓的实力，却不知道人民的力量是最强大的，或根本不相信人民的力量，认为自己的主子最强大。人民现在是一盘散沙，力量当然很弱，但一旦革命爆发或组织起来，是任何反动力量都要被彻底摧毁的。而反动畜生相信人民永远不能翻身，它们的主子是能千秋万代的。其实，秦始皇也是这么想的，呵呵！禽兽只畏惧立即马上的毁灭性打击，没有办法，这是禽兽的智力所决定的。这些傻瓜还可能认为，现在是它们所谓的文明社会，家族式的根绝是不可能的，可能还认为那是违反国际法的，或认为是封建社会的做法，这些蠢货！那个国际法就是资本主义国家间制定的，无产阶级根本不可能承认的，那个法就是保护各国资产阶级利益的。顺便告诉各种禽兽脑残白痴，什么是真正的文明社会。根据周群思想，文明社会的标志应该是没有黑社会、娼妓、毒品、贫民窟和高犯罪率的状况。人民群众拥有医疗、教育、就业、住房、养老社会福利保障和安宁的社会环境状况。这样的社会只能是社会主义社会。\n\n　　禽兽也有信仰的，可能许多人不信吧，当然那是禽兽的信仰，那就是暴力，权力和享受！！！ 禽兽的信仰非常坚定执着（就是顽固不化），禽兽为了追求自己的罪恶信仰可以说是不折手段，百折不回，至死不渝！ 各种禽兽通过暴力手段霸占人民的生产资料以此获得权力，骑在人民头上作威作福的压榨剥削奴役人民，享受人上人的快乐，这就是禽兽的信仰。许多人认为反革命禽兽的亲人家族后代等是无辜的，根本是胡说八道，恰恰相反，反革命禽兽反革命的动力正是来源于为了自己的亲人家族能世世代代地骑在人民头上剥削压榨奴役人民的兽性欲望信仰。事实上，当今我们看到的情况是禽兽的亲属家族基本都是在享受禽兽掠夺人民的血汗。所以那种认为禽兽的家属亲人是无辜的，不是迂腐愚蠢的人，就是别有用心地想给反革命禽兽留下罪恶基因后代的畜生！反革命军警也是反动禽兽的一种，它们占有的权力和利益虽然跟十大家族比起来微不足道，但比许多老百姓要强得多。所以，这微不足道的的权益它们也爱不释手，要留给自己的家族和后代，现在假共反动禽兽政府的各个机构的职位，许多都是或明或暗的世袭了。\n\n　　其实，对反革命我们也是欢迎的。人民的血债能量太多太大，跳出来的反革命太少，根本不够用。无论谁跳出来，都是对人民发泄血债仇恨能量有好处的，也是一种“舍小家为大家”的壮举，令人“钦佩”，人民会“感谢”你们这种天大的“无私”精神的，我都有些被你们这种精神“感动”了。但我们革命阵营都是大慈大悲的大善人，总是极力挽救各种反动分子的。我们做到极致了，你们非要反革命，我们也毫无办法，道路都在自己的脚下，尊重你们的选择！现在你们可以为所欲为，后果你们无法把握！\n\n　　点到为止，借用单田芳单老经常在评书中讲的话，那就是好良言难劝该死的鬼啊！对于坚定执着的反革命，是好良言难以挽救该死的整个家族，呵呵！"
		},
		{
			"post_id": 3,
			"title": "致中国人民军警的一封公开信",
			"date_published": 1463134210.896,
			"body": "热烈祝贺中国真共产党在2012年5月16日正式成立了！\n\n人民的军警同志们：\n\n　　中国真共产党的成立，标志着以马列毛主义周群思想为指导的中革中央在周群、宇红的领导下，为被剥削压迫人民的解放事业又向前推进了一大步，使人民群众能够慧眼识真假。\n---\n　　1976年毛主席逝世后，以邓小平为首的一大批投机分子走资派搞政变，推翻了真共产党，颠覆掉了社会主义公有制制度，倒退复辟了资本主义私有制，它们利用你们——人民的军警这一强大的工具作为后盾，大肆地把原社会主义公有制下属于人民群众的共同生产资料进行掠夺、霸占为己有，成为它们瓜分后的私有财产，一夜之间，它们成为了中国最大的大资本家、大富豪继而形成了十大家族。它们披共产党、社会主义的外衣欺骗你们——人民的军警为它们的私欲服务。 30多年来，你们——人民的军警们，在被骗的情况下不知不觉中帮着十大家族对你们的父老乡亲进行残酷地剥削压迫。你们的亲人正在吃二遍苦，受二茬罪；你们的亲人看不起病、养不起老、买不起房、读不起书；你们的父亲、兄弟成为了资产阶级的奴隶正在被奴役；你们的母亲、姐妹为了生存、为了把你们抚养成人，背着你们被迫卖淫；你们的孩子一出生就喝上毒奶粉、生病遭遇假药；你们每天正吃着地沟油、苏丹红、毒大米、瘦肉精。。。。。。这一切有害于人民群众的东西，都是它们倒退复辟了资本主义私有制造成。众所周知，共产党是以消灭剥削压迫、消灭私有制为己任的，它们不但没有消灭剥削压迫、消灭私有制，反而背叛自己的誓言而制造剥削压迫、制造私有制，它们勾结外国资产阶级一起来剥削压迫中国人民，无产阶级正遭受双重地剥削压迫。\n\n　　人民的子弟兵军警同志们，你们要清楚，你们是靠人民在养活着，你们的责任就是保护你们的亲人不被欺负、不被人剥削压迫骑在头上作威作福，你们的使命就是保卫社会主义公有制不被投机分子走资派颠覆为资本主义私有制。你们不是资产阶级的帮凶，你们更不是十大家族的家丁打手、走狗奴才，你们是人民和社会主义公有制的保护神。请你们擦亮你们的眼睛，认清真假共产党、真假社会主义，站在人民群众的立场上，投入到无产阶级革命阵营里来，调转枪口，消灭扶持资产阶级专政体制的资产阶级政府，打倒骑在人民头上剥削压迫、作威作福的十大家族，逮捕对人民群众已犯下了反人民罪、反革命罪、叛党罪、颠覆社会主义公有制国家政权罪、掠夺、抢劫、霸占公有生产资料罪、卖国罪等的投机分子走资派十大家族，颠覆掉资产阶级国家资产阶级政权，夺回属于人民群众的共同生产资料，推翻资本主义私有制，建立社会主义公有制。\n\n　　马克思主义证明了资本主义必然崩溃、共产主义必然胜利，指出无产阶级是资本主义制度的掘墓人，资本主义不可避免地要让位于社会主义，社会主义必然代替资本主义是社会生产力发展的要求和合乎历史规律的结果。毛泽东主义：哪里有压迫，哪里就有反抗。周群思想指出：剥削压迫必定导致革命。被剥削压迫的人民已经觉醒，正在准备组织起来造反有理而发动一场轰轰烈烈地人民大革命运动，到时候十大家族还想利用你们来打压革命为它们的私利服务只是痴心妄想，你们不会听命于它们，反而会为了被剥削压迫人民的翻身解放消灭它们这一群披着羊皮的狼。至于哪些顽固不化、不思悔改的，胆敢跳出来对革命进行捣乱破坏的、为十大家族顶罪、充当炮灰的傻瓜、蠢蛋，人民群众将会对你家族式的血债血偿清算加惩罚，请你记住，死你一个人算小事，你的家人、家族、父母兄妹、子孙后代、亲朋好友都会被你牵连而受死。"
		},
		{
			"post_id": 2,
			"title": "中国无产阶级革命中央委员会告全国人民书",
			"date_published": 1463133327.249,
			"body": "中国无产阶级革命中央委员会，-简称：中革中央，由各阶层的普通老百姓自发团结起来组成，通过学习、掌握和发展了马列毛革命理论，公开成立了中革中央革命组织；公开成立了要打掉现执政假共党的真共产党；公开把邓小平及其徒子徒孙（改革开放以来的一把手、二把手）钉上了历史百大恶人耻辱柱上；公开向跳出来破坏捣乱大革命的政府官员发出了家族追杀令；公开高举了打倒资产阶级十大家族政府、推翻人吃人的资本主义私有制的革命大旗（登高振臂一呼）；公开架构了全国各地的中革中央地方革命政府省委，并且使得资产阶级反动政府再也无法正面撼动革命阵营而只能暗中偷偷摸摸捣乱破坏革命阵营了。\n\n\n中革中央指定的游行、示威口号：打倒假共！打倒十大家族！打倒资产阶级政府！推翻资本主义私有制！建立社会主义公有制！"
		}
	]
}