{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Magyar nyelvű anyagok - ZeroNet",
			"body": "Információk a ZeroNet-ről. Magyarul!",
			"added": 1490776513
		},
		{
			"topic_id": 2,
			"title": "Terria és Lerzia meséje - avagy mese a bankrendszerről",
			"body": "Tóth Bálint írása - 2009\n\nElőszó:\nA világról szóló ismereteid 99.99%-át más emberektől nyered különböző kommunikációs csatornákon át. A tudásod 99.99%-a valójában tehát HIT, hogy az embertársaid azért osztják meg veled a tudásukat, mert ily módon hatékonyabban tudunk kooperálni egymással a sikeres lét érdekében. Még az olyan triviális igazságok is, mint hogy a Föld gömbölyű, ezen alapulnak - hacsak nem utaztad körbe ténylegesen. Az emberek közötti információáramlás redundáns: egy adott csomópontból származó információ jár körbe közöttünk. Egy információ pedig akkor hiteles számodra, ha a \"forrás\" hiteles, ez a \"forrás\" pedig: az a csomópont, ahonnan kaptad, és nem a kiindulási csomópont. A kiindulási csomóponttal általában nem vagyunk tisztában; ha az egyetemen egy plutónium-izotóp tulajdonságairól tanulsz, nem törődsz vele, hogy az ismeretet melyik kutató szerezte meg, a professzor és a mögötte működő intézmény hitelébe vetett bizalom elég. Ha egy gráfként rajzoljuk fel az emberek közötti információáramlást, megkapjuk azokat a személytelen intézményrendszereket, amelyeket a gráfon belül zárt egységként bekarikázhatunk, és a karikákra ráírhatjuk, hogy AUTORITÁS. Ha a karikák közül elég sokba behelyezünk egy olyan csomópontot, amely forrásként működik és mi irányítjuk, viszont maga a csomópont a kívülállók számára ismeretlen, akkor gyakorlatilag mi irányítjuk azt, hogy mi igaz, és mi hamis - és mivel a valóságot az emberek értelmezési szűrőkön keresztül vizsgálják, még olyasmit is el tudunk hitetni velük, ami ellentmond a személyes tapasztalatuknak.\n\nTerria és Lerzia meséje - avagy mese a bankrendszerről\n\nHol volt, hol nem volt, volt egyszer egy hatalmas birodalom, neve Terria. Minden tartománya, összes népe gazdgságban, biztonságban, boldogságban élt. Jólétük forrása a termőföld volt, mely kevés gondozásért cserébe bőséggel látta el a birodalom lakóit élelemmel és nyersanyaggal.\n\nTerria leghíresebb tartománya a mesés, gazdag Lerzia volt. A lerzek kiváló iparosok voltak, s okos, nagy tudású, jó szívű és derék, szorgalmas embereknek ismerték őket minden tartományban, ahol megfordultak; mert utazgattak, igen sokat, szemben más tartományok népeivel, kik a lábukat se nagyon tették ki a falusi járásból, nemhogy a tartományukból. A lerz helytartót birodalomszerte a legbölcsebb embernek tartották. De nem csak legbölcsebb, hanem legvagyonosabb is volt mind közül.\n\nEgyszer aztán Terria királyának azt javasolta egyik lerz tanácsnoka, hogy változtassák Terriát ipari birodalommá - ha hatalmas gyárakat építenek, az embereknek nem kell két kezi munkával előállítaniuk saját hétköznapi használati tárgyaikat, így még kevesebb munka árán még többet birtokolhatnának; Terria gazdagabb lenne, mint valaha.\n\nA király hallgatott az okos szóra, és hatalmas iparváros építésébe kezdett - minthogy e munka koordinálása sokkal nehezebb feladat volt, mint a földművelésé, idővel trónszékhelyét is ide helyezte át, s az új fővárost Terropolisznak nevezték.\n\nHogy, hogy nem, pár év után azonban kifogyott a kincstárból az arany, bár Terropolisz felépítése még nem ért a végére. Búsult is a király... Hamarosan azonban megjelent udvarában a lerziai helytartó, s a lerzek tizenkét szekéren hozták mögötte az aranyat! A király nagyon megörült, bár nem értette, a lerzek miért akarják a birodalmat ily önzetlenül megsegíteni. A helytartó biztosította róla, nem kér semmit cserébe; ám az aranyat nem örökbe adja, csak kölcsön, s a király majd visszafizeti neki, mikor a hatalmas beruházás megtérült.\n\nÚgy is lett. A terriai ipar virágzott, a gazdag falvak kalandvágyó fiai pedig a még gazdagabb városi létről álmodoztak, s a kincstár hamarosan roskadozott az aranytól. A király, hálája jeléül nem tizenkét szekérnyi aranyat adott vissza a lerz helytartónak, hanem tizenhármat, s olyannyira csodálatos dolognak tartotta a kölcsönzés intézményét, hogy rendelkezett: állami bankot kell létrehozni, mely a pénzt igénylő embereknek szerény kamatra kölcsönad.\n\nHosszú sor kígyózott a Terriai Királyi Bank előtt reggeltől estig: kérelmezők hada folyamodott hitelért, némelyek a rossz termés miatt szorultak meg, mások nagyobb, cifrább házról álmodtak - de a legtöbben lerzek voltak közöttük, ügyes és szorgalmas mesteremberek, akik saját ipari vállalkozások alapítására kértek hitelt, a haszonból megfizetve azt kamatostul.\n\nTerria ipara hamarosan százszorosára növekedett, ontotta magából az árukat, s a munkaerő csak úgy özönlött a falvakból az egyre szaporodó és növekvő városokba. Özönlött, csak özönlött - s eljött az ideje, hogy nem maradt elég ember a vidéken, megművelni a földeket, s jóllakatni önmagukon kívül a városok egyre csak szaporodó lakosságát.\n\nHatalmas éhínség köszöntött Terriára. Városi és falusi egyaránt a kétségbeesett, tehetetlen királyt okolta; mindenki másként hitte, mi a kialakult válságos helyzet pontos oka, de mindenki egyformán tudni vélte a megoldást, s a kocsmákban gyakran vitatkozó embereknek sok nem kellett hozzá - csak néhány bölcs lerziai filozófus, kik az emberi egyenlőségről és a központi kormányzás megszüntetéséről álmodtak -, hogy felkeljenek a király ellen, lefejezzék, s Terriát szövetségi köztársasággá kiáltsák ki, független, a nép által választott tartományi kormányokkal.\n\nTelt-múlt az idő.\n\nÁgrólszakadt Jánoska egy nyomorúságos kis faluban látta meg a terriai napvilágot. A gyermekkor nélkülözéssel telt évei után a város felé vette az irányt - Terropolisz felé, ahol már az iparban is csak kevesek dolgoztak, hisz gépek végezték a munka nagy részét, az emberek pedig kényelmes irodákban ültek, adminisztratív munkakörökben dolgozva. Legtöbb fiatalnak ez volt az útja, hiszen falun már úgysem volt munka, a földet is gépekkel művelték...\n\nJánoskát egy lerz bankvállalat alkalmazta - több száz ilyen működött már Terriában, a király bukása óta bárki foglalkozhatott hitelezéssel, s a lehetőséget főleg a lerziai üzletemberek használták ki. A fiú kapott egy lakócellát a vállalati lakótelepen, s hogy munkáját megfelelően végezhesse, a vállalati iskolába, a Lerz Pénzügyi Főiskolára kellett járnia.\n\nHallgatótársai, a kedves, derék lerz iparosok leszármazottai, az ifjú lerziai bankártitánok legtöbbször szinte levegőnek nézték Jánoskát. Ha szóltak is hozzá, foghegyről beszéltek vele, de leginkábbis egymás között diskuráltak fennhangon a csak általuk ismert lerziai nyelven. Ágrólszakadt Jánoska úgy érezte, falusi származása miatt nézik le ezek a Terropoliszban felnőtt lerz fiatalok, s gyakran szeretett elbújdosni a főiskola néptelen részein; szolgálati helyiségekre nyíló kihalt folyosókon mászkált, alagsorokban kalandozott, eljutva olyan helyekre, hol tán még az öreg lerz professzorok sem jártak soha.\n\nEgyszer azután rábukkant a legmélyebben fekvő folyosóra, melyben örök sötétség honolt. Jánoska villanyt sem talált, csak két mobiltelefonjának háttérvilágítását egyesítve tudott előrehaladni. Fémes csengés-bongás és víz csurgása-csobogása hallatszott a folyosó távoli végéből, hol Jánoska, óvatosan előrehaladván, egy réges-régi faajtót világított meg telefonjaival.\n\nA furcsa zajok elhallgattak, s egy rekedten károgó férfihang azt kiáltotta:\n\n- Ki az? Ki van odakint?\n\nJánoska nem tudta hirtelen, mitlévő legyen... ám az ajtó kitárult, s ő egy vénséges-vén, összeaszott arcú, púpos hátú, hosszú ősz szakállú öregembert pillantott meg egy sötétbe vesző, hatalmas terem közepén állva, mögötte irdatlan hegynyi csillogó aranypénzzel, előtte pedig egy kőtállal, amelyben víz felszínén csillogott a benti fény. Közelebb lépve észrevette, hogy az öregembernek tipikus lerz arcvonásai vannak.\n\n- Te lerziai vagy... - nyögte bután, hisz ezerszer érdekesebb tényeket is szóvá tehetett volna, például az aggastyán háta mögött tornyosuló végeláthatatlan aranydombságot.\n\n- Így van, fiacskám. Nem is akármilyen lerz... Én voltam az utolsó terriai király uralkodása alatt Lerzia helytartója! Én találtam fel a bankot!\n\n- De hiszen az évszázadokkal ezelőtt volt...\n\n- Úgy van! E helyt állott a Terriai Királyi Bank központi értéktára. S a lefejezett király a túlvilágról iszonyú büntetéssel sújtott engem, amiért a bankrendszert megalkottam, s amiért utána a forradalmat a háttérből szerveztem és támogattam pénzzel: minden egyes alkalommal, mikor a lerz bankok egy korabeli aranypénznek megfelelő értékű Terrkreditet multiplikálnak, nekem itt egy aranypénz megjelenik a semmiből, s azt meg kell mosnom ebben a kőtálban, hogy újra semmivé foszoljon. Addig kell élnem, amíg e munkát el nem végeztem! Ha mindet megtisztítottam, akkor meghalhatok. - S a csontvázszerűvé aszalódott kezek hátrafelé intettek: - Amint láthatod, kissé le vagyok maradva.\n\nJánoska tudta, mi az a pénzmultiplikáció, hiszen pénzügyi iskolába járt, így csak annyit kérdezett:\n\n- De hát miért haragszik rád a király szelleme a multiplikált pénz miatt? Hiszen annak az élettartama véges, nem igazi pénz, kikerül a forgalomból, s aki erején felül multiplikál, csődbe juttatja magát!\n\nAz öregember keserűen felnevetett.\n\n- Valóban ezt tanítják, ez volt a multiplikált pénz valaha - s ne aggódj, minden alkalommal, mikor egy aranypénznyi Terrkreditet kivonnak a forgalomból, a hozzá tartozó érme tisztítás nélkül eltűnik mögülem. Fiacskám, ez a hegy a hátam mögött egyre csak növekszik, már a végét se látom. Ennyi az a multiplikált pénz Terriában, melyet soha nem fognak kivonni a forgalomból, mely helyett valódi kézpénzt soha nem fognak követelni az emberek a bankokon; miért is tennék! A csekket, átutalást, bankkártyát mindenki épppúgy elfogadja!\n\n- Hogy hagyhatja az Állami Bankárügyi Főhivatal, hogy a bankok ezt csinálják?! - kiáltotta döbbenten Jánoska. - Nekik tudniuk kell róla...\n\n- Ugyan, fiam, három alulfizetett állami hivatalnok fogja megállítani a lerziai bankokat abban, hogy bekebelezzék a világot? Elárulok azonban még valamit... de előbb felelj jól egy kérdésemre: hogy számolod ki a forgalomban lévő összes pénz mennyiségét?\n\n- A pillanatnyilag forgalomban lévő multiplikált pénz és a jegybankpénz összege - vágta rá az iskolában tanult képletet Jánoska.\n\n- Magyarán? - vonta fel szemöldökét az öreg lerz.\n\n- Magyarán az emberek betétei a bankban és a forgalomban lévő készpénz együttesen.\n\n- Úgy van! Most mondd meg, hogyan számolod ki az összes hitel mennyiségét!\n\n- Az összes hitel... - felelte töprengve Jánoska. - Ezt még nem tanultam...\n\n- Ohó! És nem is fogod! Ezt nem tanítják semmilyen iskolában! De gondolkodj csak... ha a bank a betétes pénzét adja ki hitelbe, akkor a hitelek összege egyenlő a...\n\n- A betétek összegével! - kiáltott fel Jánoska, hirtelen rádöbbenve az egyszerű igazságra. Azonban az aggastyán olyan rikácsolva kiáltott fel, hogy a fiú összerezzent:\n\n- Tévedés, tévedés, tévedés!!! Az összes hitel nem csak az összes betétnél, de az összes pénznél is sokkal több! Na figyelj ide, te mamlasz! Bemegyek a bankba, és beteszek egymillió Terrkreditet. Neked kéne az a pénz, de nincs, ezért kölcsönkéred a banktól. Bemész egy bevásárlóközpontba, amit „véletlenségből\" szintén a lerz bankárok birtokolnak, és veszel belőle egy marhanagy plazmatévét! A pénzt kifizeted, az visszakerült a lerzekhez, ők meg visszaadják nekem, és ott tartunk, ahol az elején, igaz?\n\n- Ööö... igaz.\n\n- Nem igaz, te tuskó, hogy lenne igaz! Használd az eszedet, még mindig tartozol a banknak az egymillióval!\n\nJánoska dermedten próbálta a hallottak jelentőségét felfogni, az öreg azonban megelőzte:\n\n- Na így haladja meg a hitelállomány mérete a betétállományét! - Fújt egyet. - De végül is a pénz körbejár. Mitől csökken a hitelállomány? ...Ne tátsd a szád! Hogyan szünteted meg a fennálló adósságodat?\n\n- Kifizetem a ténylegesen megkeresett pénzemből.\n\n- Vagyis dolgozol. Az elvégzett munka mennyisége csökkenti, az elfogyasztott javak mennyisége növeli a hitelállományt - és ezt a nagy kupacot itt mögöttem! Márpedig az öreg király pont azért kezdte a terriai ipart építeni, hogy kevesebb munkával többet fogyaszthassunk - hiszen a gépek dolgoznak majd helyettünk! Ehelyett, a piac ugyan tele van árukkal, az emberi munkaerő értéke viszont csökken... de sebaj, mindig lehet hitelt felvenni! Na ezért is nem fog ez a hegy soha elfogyni mögöttem, s ezért válik majd egy szép napon egész Terria fizetésképtelenné. - Az öreg lerz szinte suttogta az utolsó mondatokat: - S akkor minden a lerz bankok tulajdona lesz majd, s mindenki az ő rabszolgájukká válik majd.\n\n- Elmondom! Nyilvánosságra hozom! - kiabálta Jánoska. - Ha az emberek megtudják, vége lesz az egész rémálomnak, és... - szava elakadt az aggastyán pillantásától.\n\nA jellegzetes sötétkék lerz szemek huncut csillogással fürkészték Jánoska arcát, majd az öregember végre megszólalt:\n\n- És ugyan ki fog hinni neked...?",
			"added": 1491549621
		}
	],
	"topic_vote": {
		"2_17Vhhuwp8hQnqT54AyH3dHEwwH8mxrKM1f": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1_1JLMVnLTd72f6UiP16P3XxkKLyatmt9PSu": [
			{
				"comment_id": 1,
				"body": "Sracok! Nem véletlenül vagyunk itt! Kérlek titeket, segítsük egymást!\nÉpítsünk, gyarapítsunk.",
				"added": 1490468681
			}
		],
		"1_1N8Lt8mUks1ntSQwWUWRrdapfstVHuEXeo": [
			{
				"comment_id": 2,
				"body": "Nagyon jó a kezdeményezés!",
				"added": 1490468769
			}
		],
		"1_1HVJvkzPdXDEtsjBSzFLyx6KsG8Tg2nnr5": [
			{
				"comment_id": 3,
				"body": "Szevasztok! Jók leszünk, úgy hiszem!",
				"added": 1490468938
			},
			{
				"comment_id": 5,
				"body": "Én személy szerint még nem. Illetve böngészném a 0day listákat, de rengeteg oldal egyszerűen totálüres, nem tölt be semmit. Én vagyok a béna? Mit rontok el?",
				"added": 1492101765
			}
		],
		"1_17Vhhuwp8hQnqT54AyH3dHEwwH8mxrKM1f": [
			{
				"comment_id": 4,
				"body": "\"Kocsis Tamás: ZeroNet\"\nhttps://www.youtube.com/watch?v=CIYlnnyJ6YE\n-\n\"ZeroNet - Decentralizáljunk weboldalakat\"\nhttps://www.youtube.com/watch?v=H1m0_rMUWgY",
				"added": 1490776671
			},
			{
				"comment_id": 6,
				"body": "Igaz, igaz. De most a cél szentesíti az eszközt. \n\nHUP fórum:\nhttps://hup.hu/cikkek/20170322/kocsis_tamas_zeronet_sikeresen_ithon_passioners_talk_ted2017_the_future_you_eloadasok",
				"added": 1492712899
			}
		]
	},
	"comment_vote": {}
}