{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1564689513,
			"title": "An in-browser, self signed identity?",
			"body": "So I have heard about Nasasi and someone said that the public and private key of the creator is within the files of the zite. Does that mean anyone who has access to this zite can modify other peoples keys since they have the creators public and private key? Wouldn't they just be able to edit the zites files?\n\nAnother question I have is, would the identities on this zite always be unique? Or is it possible that someone may have a dated version of the zite which will allow someone to register a username that has already been registered by someone who has the latest version, if that makes sense?",
			"added": 1564689512
		},
		{
			"topic_id": 1564794694,
			"title": "anyone know if there are any disadvantages to giving public and private key to the public?",
			"body": "for cert signing? and what if you want to pause registrations? can you just remove the private key from the zite and people will be unable to register?",
			"added": 1564794692
		},
		{
			"topic_id": 1565144194,
			"title": "testing, please help",
			"body": "https://youtu.be/Ti2WrGet6gE\n\nNever mind the video, I am testing to see if random people like me can embed videos into posts as I've visited someone else's blog and noticed that they were connecting me with a clearnet site which obviously leaks your IP address. The zite would load some shit from the clearnet and it was impossible for me to know until I opened that zite and saw the status bar loading clearnet links. How can I avoid zites with auto loading clearnet links? Or how can I completely block the clearnet but allow zites to work without affecting other browsers?",
			"added": 1565144191
		},
		{
			"topic_id": 1565145631,
			"title": "I don't think the owner wants developers for Zeronet...",
			"body": "Because he knows that once people understand how everything works the whole project will be out of his hands... Like how the fuck am I supposed to read this ZeroFrame.js file when there is no formatting what so ever?\n\n(function(){var e,t=function(e,t){return function(){return e.apply(t,arguments)}},n=[].slice;e=function(){function e(e){this.onCloseWebsocket=t(this.onCloseWebsocket,this),this.onOpenWebsocket=t(this.onOpenWebsocket,this),this.route=t(this.route,this),this.onMessage=t(this.onMessage,this),this.url=e,this.waiting_cb={},this.wrapper_nonce=document.location.href.replace(/.*wrapper_nonce=([A-Za-z0-9]+).*/,\"$1\"),this.connect(),this.next_message_id=1,this.init()}return e.prototype.init=function(){return this},e.prototype.connect=function(){return this.target=window.parent,window.addEventListener(\"message\",this.onMessage,!1),this.cmd(\"innerReady\")},e.prototype.onMessage=function(e){var t,n;return n=e.data,t=n.cmd,\"response\"===t?null!=this.waiting_cb[n.to]?this.waiting_cb[n.to](n.result):this.log(\"Websocket callback not found:\",n):\"wrapperReady\"===t?this.cmd(\"innerReady\"):\"ping\"===t?this.response(n.id,\"pong\"):\"wrapperOpenedWebsocket\"===t?this.onOpenWebsocket():\"wrapperClosedWebsocket\"===t?this.onCloseWebsocket():this.route(t,n)},e.prototype.route=function(e,t){return this.log(\"Unknown command\",t)},e.prototype.response=function(e,t){return this.send({cmd:\"response\",to:e,result:t})},e.prototype.cmd=function(e,t,n){return null==t&&(t={}),null==n&&(n=null),this.send({cmd:e,params:t},n)},e.prototype.send=function(e,t){return null==t&&(t=null),e.wrapper_nonce=this.wrapper_nonce,e.id=this.next_message_id,this.next_message_id+=1,this.target.postMessage(e,\"*\"),t?this.waiting_cb[e.id]=t:void 0},e.prototype.log=function(){var e;return e=1<=arguments.length?n.call(arguments,0):[],console.log.apply(console,[\"[ZeroFrame]\"].concat(n.call(e)))},e.prototype.onOpenWebsocket=function(){return this.log(\"Websocket open\")},e.prototype.onCloseWebsocket=function(){return this.log(\"Websocket close\")},e}(),window.ZeroFrame=e}).call(this);",
			"added": 1565145627
		},
		{
			"topic_id": 1565148747,
			"title": "ZeroNet 8Chan is dogshit just like most other big ZeroNet sites",
			"body": "ZeroNet is not a platform for large communities or anything big for that matter, large sites don't load or take forever to load. One large site will slow down your whole fucking network making ZeroNet unusable. ZeroNet is a great idea but terrible in practice. Better technologies will probably come in the future.",
			"added": 1565148742
		},
		{
			"topic_id": 1565197963,
			"title": "What's wrong with all the trackers?",
			"body": "Only connected to 3 out of 14?",
			"added": 1565197957
		}
	],
	"topic_vote": {
		"1564689513_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": 1,
		"1564319237_1K2yxrbNgfo8ZtuGfvvUiPVueUrZEAbfJe": 1
	},
	"next_comment_id": 25,
	"comment": {
		"1564319237_1K2yxrbNgfo8ZtuGfvvUiPVueUrZEAbfJe": [
			{
				"comment_id": 1,
				"body": "@kxoid.bit doesn't work for me at all, I don't know why people keep posting this rubbish. When I try to register an ID it says there is a 15 second wait but you can wait for half an hour and yet nothing will happen.\n\nKaffieID I need to look into because it doesn't sound bad if the users aren't unique as long as they can post with a unique string, if they can't post with a unique string then it's completely worthless as people will end up impersonating each other.",
				"added": 1564690266
			},
			{
				"comment_id": 2,
				"body": "> [moor](#comment_168_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): PeerMessage plugin\n\nSo you think? Have you actually tried registering with them or are you just going to copy and paste what other dumb people say? The PeerMessage plugin doesn't do shit, the registration still doesn't work which only suggests that kxoid also has a central server that is down and not working probably due to the owner leaving it to die or because there is something wrong with ZeroNet.",
				"added": 1564778250
			},
			{
				"comment_id": 3,
				"body": "> [kaffie](#comment_858_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): aking it truly decentraliz\n\nSweet, thank you for the explanation, makes a lot of sense.",
				"added": 1564778537
			},
			{
				"comment_id": 8,
				"body": "> [moor](#comment_170_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): Jesus, you don't need to bite me head off. i registered on kxo some time ago.\n\nI'm not biting your head off, I just see too many dumb people trigger happy to write a reply without knowing if what they're about to write currently works. They might as well be spamming as what they're writing is completely unproductive, misleading and a waste of space and other peoples time. It's not possible to even try to register with kxoid without downloading that gay plugin. There's a clear message on the website and the \"CREATE ID\" button is blanked out. I wouldn't write about trying to register if I was unable to press that button.",
				"added": 1564794422
			},
			{
				"comment_id": 9,
				"body": "> [moor](#comment_172_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): i agree but what i said is accurate, it was fair to assume that kxo was working 'cause i didn't saw anyone posting anything recently saying otherwise. additionally there's this, which states pretty much how kxoid works, right on its zite, very visibly.\n\nYeah, I've read that shit, still of no use to me as I am unable to register an ID on that zite. Every other ID provider works for me but them.",
				"added": 1564795647
			}
		],
		"1564763476_1BEt1F2JpPiMu7kxjyk92uYUz1z8JYRb59": [
			{
				"comment_id": 4,
				"body": "> [duende](#comment_97_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): Kill yourself, moron.\n\nI will if you do it first and send me a live stream link so that I can be sure. :DDDDDD",
				"added": 1564778602
			}
		],
		"1564701974_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 5,
				"body": "I like the crystals. Nice and clean design.",
				"added": 1564778687
			}
		],
		"1564702262_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 6,
				"body": "why would anyone give a fuck about what you wrote with that gay as random username of yours\n\nthe old net is strong and alive for years to come",
				"added": 1564778761
			}
		],
		"1564689513_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": [
			{
				"comment_id": 7,
				"body": "> [styromaniac](#comment_797_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): The cert is stored in users.json in the data directory for ZeroNet. It's not stored in the site. Your cert is on your device only.\n\nThank you, that was helpful.\n\nOne more thing, do you or anyone know if an owner of a site deletes it from their end if it will eventually end up dead or will it still be accessible to new peers since peers other than the owner will have a copy? Or does it work in the way that the owner can just modify the site to like a picture and thereby deleting all content from the original meaning that once people get an update the site will also be dead to them and any other new peers?",
				"added": 1564778926
			}
		],
		"1564794694_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": [
			{
				"comment_id": 10,
				"body": "> [kaffie](#comment_859_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Downside is that you can't enforce specific cert criteria (ie unique names). Other than that there's no harm. [...]\n\nThank you, that was a very helpful reply. How would one go about hiding the private key? Like how can I use the private key to sign certs without making it available on the zite yet at the same time being able to generate working ID's but without a php backend? Or is that not possible?",
				"added": 1564880377
			},
			{
				"comment_id": 11,
				"body": "> [kaffie](#comment_860_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): There's no way to make the private key usable but unable to be exploited. The only way is having centralized control over the key, and using some centralized backend (either by hand or by computer) to sign certs. Since you need the key to sign the cert, and if you make it usable/visible to the client, then they can use it for whatever. So instead the client sends a request by sending their public key to the backend centralized server, which signs the cert, and provides the signed cert to the client. [...]\n\nYes I understand that part but how would one go about signing certs by hand or manually without a backend so that the private key isn't available to the public? And if possible how do you hide the private key from the zite? Where do you generate these public/private keys? Thank you.",
				"added": 1564923289
			},
			{
				"comment_id": 12,
				"body": "Thanks for the replies kaffie, it's nice to see someone consistently active around here. They've been very helpful, now I just need to figure out how to get those certs signed manually with a central backend. What I am puzzled by is what software do I use to sign certs manually? Or do I just create a hidden zite that I don't give the link to anyone else and generate these on that zite?",
				"added": 1564997033
			},
			{
				"comment_id": 21,
				"body": "> [kaffie](#comment_862_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): It's been a long time since I touched this. The easiest way to go would be to grab the zeroid backend code, or the cert signing code of kaffieid, and then just using that privately to sign certs. I think in kaffieid I nicely commented everything?  [...]\n\nHad a look at it and can't really figure it out, I can probably get it working like it does on the original zite but I probably won't be able to do anything else with it. I will try doing some reading but I doubt I will be able to figure anything out, not a programmer.",
				"added": 1565146727
			}
		],
		"1564978498_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW": [
			{
				"comment_id": 13,
				"body": "> [sceptique](#comment_27_1TWoxhM5cZiLpzybpLyYtEsskuGJ9yVhv): \"I'm in your computer and I can see all your history... OH MY GOD WTF AAH DISGUSTING PIG, it BURNS MY EYES!\"\n\nDamn son, you got to be more respectful to your mother.",
				"added": 1565032194
			}
		],
		"1565142042_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": [
			{
				"comment_id": 14,
				"body": "I've read the whole thing and I don't see where you got your conclusion from?",
				"added": 1565143891
			}
		],
		"1565138815_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": [
			{
				"comment_id": 15,
				"body": "people like you are the reason we can't get real discussions going on",
				"added": 1565144062
			}
		],
		"1565144194_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": [
			{
				"comment_id": 16,
				"body": "> [223556](#comment_17_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): It works\n\nthx man, I updated my post after seeing that the video link doesn't get embedded...",
				"added": 1565144554
			}
		],
		"1565141688_1Kz61HMH26hFwXwRzJoMbHePywcgLCG9fD": [
			{
				"comment_id": 17,
				"body": "> [nickwa](#comment_185_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): My ZeroNet is still fast. Btw if you have 8chan, thats probably whats slowing down your network. Its having tons of requests per second from the flood of new users.\n\nwhere's the 8chan link? link me plox",
				"added": 1565144963
			}
		],
		"1565144688_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 18,
				"body": "everyone keeps talking about zeronet 8chan but no one has a fucking link?",
				"added": 1565145911
			},
			{
				"comment_id": 23,
				"body": "Cloudflare is dogshit that has infected the web to try to take over it.",
				"added": 1565197720
			},
			{
				"comment_id": 24,
				"body": "Cloudflare is dogshit that has infected the web to try to take over it.",
				"added": 1565197813
			}
		],
		"1565145571_17Yg9q5JQGGAYFEyg3mJf6Jky8DyXR7WaE": [
			{
				"comment_id": 19,
				"body": "nofish is dead, hasn't been on reddit zeronet for like 9 months...",
				"added": 1565145969
			}
		],
		"1565145631_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": [
			{
				"comment_id": 20,
				"body": "> [duck0](#comment_82_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): Contribute code cleanup readability / comments.\n\nunfortunately I am not a programmer so unless someone else can do that I can't even use this shit because I do not understand it...",
				"added": 1565146030
			},
			{
				"comment_id": 22,
				"body": "> [steelmemes](#comment_15_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg): He flat out said that he didn't about a year ago. When Zeronet started taking off people volunteered to help but he said he didn't need any because he got a bunch of funding from some unnamed source.\n\nmaybe that is why no one is donating via the github donation buttons...",
				"added": 1565146863
			}
		]
	},
	"comment_vote": {
		"855_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"858_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"112_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"797_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"859_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"860_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"861_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"862_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"5_1E6tCCUJTK8L9c6mQygDB74yzmBrmvxLVq": 1,
		"20_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE": 1,
		"8_1NcurpanUoXCULWJdFWMQ63RUcHeGp2vuA": 1,
		"161_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1
	}
}