{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1534627839_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1529723752_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": 1,
		"1532695200_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1544289028_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "I would recommend Bitmessage for sensitive emails.",
				"added": 1546732089
			}
		],
		"1534157849_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 2,
				"body": "Good luck. For the most part, the people you would contact for a website (that is more than a hobby site) would not know how much, where or how your data is accessed. On top of this, the amount of data the big 5 have through the services they offer and sdks is incredible. There would also be no way for you to verify it's removal in most cases. Due to GDPR, as you are European, an air of regulatory oversight is merely a misdirect. Once they have your data it is unlikely to be removed.The best step forward is to be more diligent moving forward.",
				"added": 1546732644
			}
		],
		"1533555669_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 3,
				"body": "Sadly if you are on the internet and asking this question you are normal. Think of Google/Amazon/Facebook as an extension of the US government.",
				"added": 1546732819
			}
		],
		"1532695200_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 4,
				"body": "I would recommend listening to 'Railroaded: The Ross Ulbricht Story'(from memory). He was set up.",
				"added": 1546733594
			}
		],
		"1527410242_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 5,
				"body": "While US corps are holding the data of EU citizens it is a huge leap of faith that these regulations are implemented/enforced on anything more than a superficial level.",
				"added": 1547077140
			},
			{
				"comment_id": 6,
				"body": "> [ssdifnskdjfnsdjk](#comment_43_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): On page \"Who does the data protection law apply to?\" they claim this law apply also on \"a company  established outside the EU offering goods/services (paid or for free) or monitoring the behaviour of individuals in the EU.\"Which is quite all services like Facebook, Google i think. I do not understand these legal things, but i think EU put some charges on Facebook because they violated EU laws. Why not in case they violate GDPR law.\n\nI think that recognition of the fact that companies, tech or otherwise, will say anything to keep business is important. There is no way to escape the negative effects of how companies actually operate.",
				"added": 1547293419
			}
		]
	},
	"comment_vote": {}
}