{
	"next_topic_id": 9,
	"topic": [
		{
			"topic_id": 1521706732,
			"title": "PooTeen must die",
			"body": "Does anyone take Putin's threats seriously?",
			"added": 1521706731
		},
		{
			"topic_id": 1521810131,
			"title": "Docker",
			"body": "1. Who uses it and for what purposes?\n2. What features do you use?\n3. How long have you used it and why did it interest you?\n4. Have you used Vagrant before and can you compare the problems?\n5. Do you keep such things separately as cache, logs, project dependencies (eg vendor folder, node_modules)?",
			"added": 1521810129
		},
		{
			"topic_id": 1521965207,
			"title": "Yandex (Яндекс)",
			"body": "I heard that Yandex services (such as email) is popular in USA because Yandex is not available for FBI",
			"added": 1521965204
		},
		{
			"topic_id": 1521979266,
			"title": "Political correctness",
			"body": "Political correctness brings up weak people",
			"added": 1521979262
		},
		{
			"topic_id": 1521980671,
			"title": "Islam is the religion of terrorism",
			"body": "Perhaps the adherents of this religion can say more why it acquired such coloring and perceptions. But it seems to me that the extremists are true believers. The same applies to Christianity",
			"added": 1521980666
		},
		{
			"topic_id": 1522040967,
			"title": "Misanthropy",
			"body": "People are mostly hypocrites. This is one reason to hate they at least",
			"added": 1522040961
		},
		{
			"topic_id": 1522352320,
			"title": "Has ZeroNet some progress?",
			"body": "I have no seen obvious augmentation of activity from last summer in ZeroNet... What do you may say about it?",
			"added": 1522352313
		},
		{
			"topic_id": 1523848521,
			"title": "Personal archive.org (decentralized network)",
			"body": "Problem of existing decentralized networks such as ZeroNet is that they need a lot of extra effort to support and almost no one need they until he or she no problem with internet connection and government don't block a necessary resources. Really usefull decentralized network must be at least backup of plain Internet and use plain Internet URL to identify resources. For example this DecNet have Chrome extension that send every URL that an user visit to user's local DecNet peer application that backup it. DecNet peer time to time updates information on all URLs so user have always actual copy of information he or she need. When plain Internet becomes unavailable user may receive updates by decentrilized way. The problem of truth source exists in this model but information availability is more important than authenticity. For authenticity check may exists dozens of add-ons on this DecNet",
			"added": 1523848513
		}
	],
	"topic_vote": {},
	"next_comment_id": 28,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "http://127.0.0.1:43110/15R3rJPiVDGzygCYb4AWfc1QjUbdGTLWYm",
				"added": 1521536441
			},
			{
				"comment_id": 4,
				"body": "> [togis](#comment_1_13XUfd7owPjmWY2ZGpWy6bV8oZ3MrFZ72i): Can't find the node\nLoaded already \nhttp://127.0.0.1:43110/15R3rJPiVDGzygCYb4AWfc1QjUbdGTLWYm\nNot for epileptics :) ||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||",
				"added": 1521719572
			}
		],
		"1521582492_128dbVaHobAMsFW25rUVyFxwdCvvfkidzT": [
			{
				"comment_id": 2,
				"body": "PureOS has no page in English wikipedia",
				"added": 1521706304
			},
			{
				"comment_id": 5,
				"body": "> [tvax](#comment_14_128dbVaHobAMsFW25rUVyFxwdCvvfkidzT): So?\n\nDistributors pay insufficient attention to advertising",
				"added": 1521756655
			},
			{
				"comment_id": 7,
				"body": "> [tvax](#comment_16_128dbVaHobAMsFW25rUVyFxwdCvvfkidzT): So?\n\nThe system is for nerds, I forgot",
				"added": 1521790603
			},
			{
				"comment_id": 8,
				"body": "How much > [tvax](#comment_14_128dbVaHobAMsFW25rUVyFxwdCvvfkidzT): So?\n\nWikipedia has standard format for describing things. I have no desire to read advertisement on official site and description on plenty of tech blogs to suppose uses cases that I can suppose from a few paragraphs on wikipedia. Not all people like to read.\n\nI find for more lightweight debian-compatible alternative for docker. Alpine has not enough packages",
				"added": 1521938776
			},
			{
				"comment_id": 9,
				"body": "> [sstrooper](#comment_29_1PfpsxK9HpYgyPkBtdr7C7UJNfhMwFACue): Write a simple, a short, an elegant explanation at least.\nExplanation of what?",
				"added": 1521947656
			}
		],
		"1521706732_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF": [
			{
				"comment_id": 3,
				"body": "> regime helps world's peace\nbullshit. \"Defense from terrorists\" in Syria is just TV show for russians which changes focus from refrigerator. The war in Syria can be succeed without Russia.\nI don't know how can I translate a word, but Russia is main пидор of world now",
				"added": 1521718501
			},
			{
				"comment_id": 6,
				"body": "> [elektrichka](#comment_6_1LxYETyQSqQkJpXnG8QGgbXY9hx7dgPejc): Leaders of nations are always looking out for their own self-interests, not seeking to sow chaos and disorder.\n\nSelf-defense is when you stole your neighbor's territory",
				"added": 1521790466
			},
			{
				"comment_id": 22,
				"body": "Recently in Homeland TV series was mentioned how Russian agents works",
				"added": 1522044465
			}
		],
		"1521962808_1He5bfTsvbUXQXp5HCuKLdYutSiqDUjBrs": [
			{
				"comment_id": 10,
				"body": "I see no use cases for usual user with not restricted Internet. So I guess the user no need for ZeroNet",
				"added": 1521964965
			},
			{
				"comment_id": 12,
				"body": "Without full-functional availability in the plain web (through gateways/proxy) 0net have no chance to become widespread.",
				"added": 1521972382
			},
			{
				"comment_id": 18,
				"body": "If ZeroNet peer would be Chrome extensions...",
				"added": 1521983368
			}
		],
		"1521965207_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF": [
			{
				"comment_id": 11,
				"body": "> [karmakun](#comment_2_1CDsYvuQP8StQGAMEgWVZuztHTsXPhCZZn): lol, So if not US spying you, it would be Russian goverment?\nIt does not matter for not Russian resident",
				"added": 1521969989
			},
			{
				"comment_id": 14,
				"body": "> [anotherneko](#comment_4_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Orly?\n\nFor @karmakun it's not so obvious, I guess",
				"added": 1521977876
			},
			{
				"comment_id": 16,
				"body": "> [karmakun](#comment_3_1CDsYvuQP8StQGAMEgWVZuztHTsXPhCZZn): I do not want any goverment to have any my private data. \nDo you fuck children or sell drugs? Maybe you are paranoid? May foreign government agents blackmail you with your home porn? I guess you don't use social networks...",
				"added": 1521979777
			},
			{
				"comment_id": 20,
				"body": "> [anotherneko](#comment_5_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Did you allow a security cams in you toilet?\n\nWe are talking about a different matter.",
				"added": 1521984626
			},
			{
				"comment_id": 21,
				"body": "> [anotherneko](#comment_6_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): I think it is the same.\n\nStoring your data and cameras placement?",
				"added": 1521986164
			},
			{
				"comment_id": 23,
				"body": "> [karmakun](#comment_4_1CDsYvuQP8StQGAMEgWVZuztHTsXPhCZZn): You do not appreciate your rights very much\n\nI did not say that I disagree with you in general. Based on information from social networks about you special services know enough to treat you as a threat or not.",
				"added": 1522057176
			},
			{
				"comment_id": 24,
				"body": "> [karmakun](#comment_5_1CDsYvuQP8StQGAMEgWVZuztHTsXPhCZZn): I have a lot of fakes in russian social network\nIn Russia, there are more threats of freedom than in Ukraine) I have personal (not fake) profile in social networks with data that I can share with anyone. For secrets I use Telegram. It enough to satisfy my paranoia\nAnd you don't connected in you social networks profile with any relatives, coworkers, neighbors, groupmates, classmates I guess. Are they not friends, never sent messages, never viewed their profiles from your fake profile?",
				"added": 1522063253
			},
			{
				"comment_id": 25,
				"body": "I guess you must have frontal digital person for FBI/ФСБ, so that they do not look for fake accounts",
				"added": 1522064795
			}
		],
		"1521975087_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 13,
				"body": "> who continuously rambles on about the need for gender equilibrium in the IT industry\nIn IT? Seriously?)) Presence of boobs is argument today?",
				"added": 1521977625
			},
			{
				"comment_id": 15,
				"body": "> Everybody hates me .. and I hate everybody. And I hate myself for being such a moody, cringy, millennial twat.. but there's nothing I can do about it.\nKill yourself. Maybe a gym makes you happy. Low dosage of amphetamine with cannabis (1 hour after amphetamine) ought to speed up your realization who you are and what you want. If gym and realization don't makes you happy then maybe you have serious depression. Fall in love to your (today's) shit is a secret of happiness",
				"added": 1521978891
			}
		],
		"1521980671_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF": [
			{
				"comment_id": 17,
				"body": "> [ssdifnskdjfnsdjk](#comment_185_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I do not think it apply for christianity.\n\nBible is bloody book too",
				"added": 1521981340
			},
			{
				"comment_id": 19,
				"body": "> [ssdifnskdjfnsdjk](#comment_187_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): but i do not say it, because generalizing is bad in my oppinion\n\nBad analogy. My nation are not guided by (wild) Scripture",
				"added": 1521983608
			}
		],
		"1522391642_1Jt6aamh4UWpSRG421JivqanL5SQc7xLAX": [
			{
				"comment_id": 26,
				"body": "Because of censorship and firewall in China",
				"added": 1522411856
			}
		],
		"1522352320_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF": [
			{
				"comment_id": 27,
				"body": "> [ssdifnskdjfnsdjk](#comment_204_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Many new features are into background working [...]\nI don't talking about functionality",
				"added": 1522412005
			}
		]
	},
	"comment_vote": {
		"14_1CLQdyjUXGdhWumfS4c7vMA8TkjUhNHQkc": 1
	}
}