{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "ZERONET NO СПАСИБО: 4 месяца работы уничтожены !! ... в двенадцатый раз",
			"body": "Когда я проверил с помощью клиента ZeroNet, чтобы убедиться, что мои файлы доступны, ни один из моих файлов, загруженных в IFS за последние 4 месяца (!!), не был более доступным! Моя полная учетная запись IFS исчезла со всеми файлами, хотя мой ZeroNet Cliend притворялся мне !! Я попробовал это со всеми хитростями, такими как: с и без Tor Proxy, Ultrasurf Proxy, правилами совместного использования портов и переадресации в (Fritz Box) Hardware / Rooter, VPN (IKEv2 / LPT / OpenVPN ...) с освобождением порта (как Соединение UDP или TCP) и различные провайдеры DynDNS !! IFS теперь двенадцатый (!) Абсолютно ненадежный проект ZeroNet для меня! Все двенадцать проектов ZeroNet, которые я тестировал, оказались бесполезным мусором! Проекты ZeroNet всегда кажутся чрезвычайно умными, полезными, функциональными и интеллектуальными, но на самом деле они просто неустойчивые, ошибочные, бесполезные обманы (шутка / мошенничество) очень и очень небольшой группы разработчиков и сторонников, которые не имеют реального использования есть !! ZeroNet - это просто пре-альфа-концепция, нелепый эксперимент, претендующий на полезность!\nZERONET NO SPASIBO: 4 mesyatsa raboty unichtozheny !! ... v dvenadtsatyy raz\n\nKogda ya proveril s pomoshch'yu kliyenta ZeroNet, chtoby ubedit'sya, chto moi fayly dostupny, ni odin iz moikh faylov, zagruzhennykh v IFS za posledniye 4 mesyatsa (!!), ne byl boleye dostupnym! Moya polnaya uchetnaya zapis' IFS ischezla so vsemi faylami, khotya moy ZeroNet Cliend pritvoryalsya mne !! YA poproboval eto so vsemi khitrostyami, takimi kak: s i bez Tor Proxy, Ultrasurf Proxy, pravilami sovmestnogo ispol'zovaniya portov i pereadresatsii v (Fritz Box) Hardware / Rooter, VPN (IKEv2 / LPT / OpenVPN ...) s osvobozhdeniyem porta (kak Soyedineniye UDP ili TCP) i razlichnyye provaydery DynDNS !! IFS teper' dvenadtsatyy (!) Absolyutno nenadezhnyy proyekt ZeroNet dlya menya! Vse dvenadtsat' proyektov ZeroNet, kotoryye ya testiroval, okazalis' bespoleznym musorom! Proyekty ZeroNet vsegda kazhutsya chrezvychayno umnymi, poleznymi, funktsional'nymi i intellektual'nymi, no na samom dele oni prosto neustoychivyye, oshibochnyye, bespoleznyye obmany (shutka / moshennichestvo) ochen' i ochen' nebol'shoy gruppy razrabotchikov i storonnikov, kotoryye ne imeyut real'nogo ispol'zovaniya yest' !! ZeroNet - eto prosto pre-al'fa-kontseptsiya, nelepyy eksperiment, pretenduyushchiy na poleznost'!",
			"added": 1573782127
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}