{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1610350298_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 1,
				"body": "I have a shitload of machines/servers.\n\nGaming Desktop: Pop!_OS / Windows LTSC non-activated\nGaming Laptop: Pop!_OS\nOld Test laptop: Windows 7 and or Windows 10 (usually I use that one to make bootable USB key for Windows Installer when I need to help someone. I had ABSOLUTELY no luck making a working one from Linux, even with countless way from different how-to that \"should\" work).\nNAS: TrueNAS (formerly FreeNAS)\nServers: Debian\nRaspberryPi: RaspberryOS mostly (formerly Raspbian) and derivative\n\nNow, if you're interested in decentralized internet, privacy and encryption, it depend on the level you want to achieve. You can do that on just Pop!_OS (Ubuntu derivative) with full disk encryption or you can go deeper with Qubes OS or even further with only a live USB of Tails. It depend on the level of security you want. If you aren't doing something sketchy or messing around just Pop!_OS will be enough.",
				"added": 1610451824
			},
			{
				"comment_id": 2,
				"body": "> [cl4ud10](#comment_4_17KBErLZFLA8ktw9qqoCZvA4Xy8RNfPB5j): Si QubeOS es una buena idea, pero se necesita hareware relativamente moderno, sino no funciona.\n\nObviously, since it's based on virtualization and compartmentation, it come with a higher need of resources. The choice on what OS/method you'll use depend on what hardware / money / ease of use you're looking for.",
				"added": 1610522549
			}
		],
		"1610507385_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx": [
			{
				"comment_id": 3,
				"body": "Zer0net doesn't seem fully decentralized. It seem that it use tracker (which are still centralized servers, even if anybody can host one) and not the DHT protocol (which IS decentralized and replace trackers).",
				"added": 1610523465
			},
			{
				"comment_id": 4,
				"body": "> [mxh69420](#comment_44_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx): then i guess its time we moved zeronet to a dht, id start writing some pull requests but i have no idea how dhts work so i have to figure that out first\n\nSo, tracker work in the way that user connect to them to then be connected to other user who have the file you seek (trackers get/send the information and have an index of the files and who have it). \nDHT basically is a huge index of file hash and users that's itself is distributed between all users and you cache the list of user/ip.\n\nThe first time you try to join the DHT, you still need to know an \"ip\" or a \"tracker\" who know/have access to the index (you can't invent it out of nothing) so the first time you want to access it you need to \"kickstart\" the process but once launched, it's cached and updated and you don't need that IP/tracker.\n\nIn a few word, it's a decentralized trackers shared among everyone who accessed it.",
				"added": 1610525624
			}
		]
	},
	"comment_vote": {}
}