{
	"next_topic_id": 10,
	"topic": [
		{
			"topic_id": 1610388766,
			"title": "Calculating the Master Secret for a TLS session",
			"body": "I've got my Wireshark capture session and see the following sent twice from the endpoint:\n\n-Client Hello, which has the Client Random\n-Client Key Exchange, Change Cipher Spec, Encrypted Handshake Message\n(Interestingly this exchange contains the Pre-master secret instead of coming in the client's response.)\n\n-Server Hello, which has the Server Random\n---They agreed upon Cipher Suite: TLS_RSA_WITH_AES_256_GCM_SHA384\n\n-Certificate, Server Hello Done\n---The server sends 3 certificates, which I extracted from the captured packets.\n-Change Cipher Spec\n-Encrypted Handshake\n\nSo I am looking at all three 'legs' of the 'security triangle', and I understand how they all fit together. Client Random + Server Random + Pre-master Secret = Master Secret. \n\nIs there a utility/tool to take the data I have and get the master secret for that session?",
			"added": 1610388765
		},
		{
			"topic_id": 1611354750,
			"title": "Identifying unknown files",
			"body": "I have obtained some configuration files for a VOIP device and want to know if there is any information that can be extracted from them. Anyone who wants to try can have them, free of charge.",
			"added": 1611354748
		},
		{
			"topic_id": 1612193748,
			"title": "Making a Zerotalk forum specifically for the GME/stock market discussion?",
			"body": "Very, very new to Zeronet but wanting to make an uncensorable alternative/backup to Reddit. How do I 'clone' Zerotalk or similar to do so?",
			"added": 1612193745
		},
		{
			"topic_id": 1615399993,
			"title": "Where to pitch a business proposal",
			"body": "Have a genuine business idea I'm looking to get funded.\n\nThe general idea is to purchase a \"INMANIS\" model machine from Terahack and then rent it out for password auditing - cash or crypto only. \n\nI have two problems: the need for funds (~$55,000 for the machine) and someone with enough business knowledge to know how much I should charge and for what services, such as charging per-password or per-hour.\n\nIs anyone interested? Where would be other good places to pitch this on alt/deepnet?",
			"added": 1615399989
		},
		{
			"topic_id": 1615820872,
			"title": "Doxxing the leftist doxxers - Christian Michael Exoo, Abner Bashir Hauge, Talia Brach Lavin, Madeleine Blair “Molly” Conger, Rapper Key Nyata, Emily Florence Gorcenski",
			"body": "https://vdare.com/articles/doxing-the-doxers-antifa-s-war-against-regular-americans-is-run-by-spoiled-rich-kids",
			"added": 1615820867
		},
		{
			"topic_id": 1615858060,
			"title": "Support Tinhorn Flats Saloon & Grill",
			"body": "A leftist \"judge\" in cahoots with the mask Nazis has ordered the POWER shut off to their family business.\n\nDonate, like, and dine there!",
			"added": 1615858054
		},
		{
			"topic_id": 1627754943,
			"title": "\"Freedom Flashdrive\" for prospective black market businesses",
			"body": "Hit on an idea to help people whose business has been shut down or limited due to the virus panic:\n\nA premade flashdrive image including multiple anonymity network programs (Tor, Zeronet, I2p) and a simple graphical \"how to\" for users to plug a flashdrive into their Windows computer and access multiple government-resistant networks to reach customers and coordinate business safely.\n\nIs such a thing reasonably possible?",
			"added": 1627754936
		},
		{
			"topic_id": 1629852541,
			"title": "$15 drug gets COVID patients off oxygen support in under week – study",
			"body": "https://www.jpost.com/health-science/15-treatment-gets-covid-patients-off-ventilators-in-under-a-week-study-677479\n\nFourteen out of 15 severe COVID-19 patients who were treated in an investigator-initiated interventional open-label clinical study of the drug TriCor (fenofibrate) didn’t require oxygen support within a week of treatment and were released from the hospital, according to the results of a new Hebrew University of Jerusalem study.\n\nFenofibrate is an FDA-approved oral medication. The results were published on Researchsquare.com and are currently under peer review.",
			"added": 1629852533
		},
		{
			"topic_id": 1636952225,
			"title": "Donations to Rittenhouse legal defense",
			"body": "Left-leaning tech Nazis shut down Kyle's efforts to raise funds and the crucial part of his trial is coming up. Are there any cryptocurrency links set up specifically for him?",
			"added": 1636952216
		}
	],
	"topic_vote": {
		"1610388766_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne": 1,
		"1615399993_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne": 1,
		"1615820872_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne": 1,
		"1615858060_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1610354654_18DohwbEgQT6xm3fBQWYMkdq35CwK7Pre3": [
			{
				"comment_id": 1,
				"body": "I can NEVER get it to fucking work. Use Zeroid.",
				"added": 1610388858
			}
		],
		"1610223531_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": [
			{
				"comment_id": 2,
				"body": "Post your community links if you must, but DON'T FOR THE LOVE OF JESUS TAPDANCING CHRIST DON'T LINK TO ANY CONTENT!!!!\n\nIf people get busted for downloading \"hot\" material by accident Zeronet will be abandoned in DAYS.",
				"added": 1610389469
			}
		],
		"1611354750_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne": [
			{
				"comment_id": 3,
				"body": "https://drive.google.com/file/d/1t6BUtIzaLTfTquhsJqNaEPtw5FL4vaKV/view?usp=sharing",
				"added": 1611430942
			},
			{
				"comment_id": 4,
				"body": "> [savuth](#comment_14_1BkXMCkwtTN6xTcZEEfMRPhvHJHaeUPH7E): Post them OP\n\nDone.",
				"added": 1611430963
			}
		],
		"1611396015_1ADFcv5XufTv9PXUVnKwyEcGGJtHoDkwrH": [
			{
				"comment_id": 5,
				"body": "Hello Mr.FBI agent! Tell your ZOG handlers that we aren't as stupid as you think, even if we were kiddy fiddlers.",
				"added": 1611459199
			}
		],
		"1611787253_139pHaxesZa11czwptXVY62ZrNWUh4NxRQ": [
			{
				"comment_id": 6,
				"body": "1. USE TOR! ALWAYS AND WITHOUT EXCEPTION!\n2. Encrypt your entire hard drive (Veracrypt is a good one) on the off chance you do click something you shouldn't, or some assnozzle thinks it's funny to put illegal content somewhere you didn't expect it t o be.\n\nI recommended #2  to everyone anyway because of how fast \"hate speech\" laws/sentiment are expanding. It's quite likely your LEO  will be searching your machine one day soon for reasons that have nothing to do with bombs or CP.",
				"added": 1611792263
			}
		],
		"1612193748_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne": [
			{
				"comment_id": 7,
				"body": "> [mfs](#comment_108_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W): Already have one at http://127.0.0.1:43110/1NYRa6RcLLqTPg4JEnGeUc99XVDUqWSjKu/\n\nThank you!",
				"added": 1612280063
			}
		],
		"1615820872_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne": [
			{
				"comment_id": 8,
				"body": "Please feel free to add additional information about these individuals here, or send it directly to vdare.\n\nLeftist digital info-pirates are bad for business. Let's fight fire with fire.",
				"added": 1615820914
			}
		],
		"1627637997_1B6JScbE4NxJHgSVTGGjeNhk157tpeLfWT": [
			{
				"comment_id": 9,
				"body": "You'll want a Kali Linux \"live drive\" and to install the WiFite package, for starters.\n\nAfter that you'll need to capture their handshake and use hashcat to crack it and get the plaintext password. Hashcat will need as many wordlists as you can throw at it (googles ya friend). You'll want an external hard drive at least 1 TB to hold them all.\n\nDon't bother bruteforcing more than ~8 digits, it'll take to long. Don't try hashcat with a laptop unless it's a very high end gaming one, same reason.\n\nIf you find the password, log in to their router and try the default username/password for it (google). If that works, set the password to something else and put your MAC address on an always-allowed list, if the router supports it. This will keep them from changing the WiFi password or blocking your device easily, but they can still push a reset button or yank the power.\n\nIf you don't understand any of the terms here, do your homework.",
				"added": 1627654451
			}
		],
		"1627296188_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj": [
			{
				"comment_id": 10,
				"body": "Best wishes for your progress!!!",
				"added": 1627654489
			}
		],
		"1627754943_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne": [
			{
				"comment_id": 11,
				"body": "> [xcape2net](#comment_912_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): 1\n\nWhat programs does it have? I'm interested.",
				"added": 1628257740
			}
		],
		"1636952225_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne": [
			{
				"comment_id": 12,
				"body": "> [cyberk1d](#comment_3_148jFFH43GX5qkcpTXmeRiTaYJahpiWrSW): All of the money for his trial and bail has already been spent.  IIRC there's been plenty collected, and apparently Robert Barnes wasted 100k on jury selection experts that wasn't even used.  If you feel like spending some money I'd suggest giving it to actual free speech platforms, maybe gab and odysee.\n\nThank you for that information. Gab is trying to start a parallel economy and I think they're a good place to start.",
				"added": 1637175262
			}
		]
	},
	"comment_vote": {
		"14_1BkXMCkwtTN6xTcZEEfMRPhvHJHaeUPH7E": 1,
		"36_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": 1,
		"2921_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"20_1JorDyDxuLrircDbzzmn4B1ndcbSJahXLH": 1,
		"912_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1
	}
}