{
	"posts": [
		{
			"id": "6c288694-4f18-431f-a166-b67c86ef6185",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c7efbd2c-9a13-4386-b72d-73436fbefd25",
			"body": ">>c7efbd2c-9a13-4386-b72d-73436fbefd25\nHow about a search engine?\n\n>>a8013579-dfed-47e0-8f99-ef978f51f21a\nI think that's already possible to do, archived_before parameter on content.json. But no reason to set a limit before we've actually hit that limit, by which time maybe there's a better alternative to ZeroNet, or our storage capacity has grown more than the board has grown anyway.",
			"time": 1567082220577,
			"files": "[]",
			"last_edited": 1567082247277,
			"subject": null,
			"capcode": null
		},
		{
			"id": "39b2f20d-b0ab-43e8-baa0-983e0d873f74",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "17f22a9d-8c86-440d-a727-262dcc4af749",
			"body": ">>1af114d9-d46a-4fb8-94b4-216288cabc36\n>i do not think auth_address or self_signed cert can influence anonymity.\nIf all your posts are linked to a single identity, it is '''very easy''' to collect bits of information about that person until only one individual in the whole world fits the poster's profile. That's how doxing is done.\n>And even without Tor, no one proved to match particular ID/certificate/auth_address to a IP. You do not know if person is an initial poster of a regular peer.\nAgain, in theory, sure. In practice, it's easy for an attacker controlling a large number of the nodes to analyze which IPs he was connected to when he received each new post coming from a certain ID, and statistically correlate an ID to a certain IP address with 99% certainty that both belong to the same person (because that IP shows up a disproportionally large number of times in the \"bearer of unseen posts made by this ID\" list compared to the other IPs). It sounds like this is a theoretical attack, but it actually has been used by the police to catch a pedo on Freenet (which uses a network structure largerly similar to ZeroNet's). I don't have the links, but they've been posted somewhere on /pol/ already. Grep your files if you want to read more about it.",
			"time": 1567082527700,
			"files": "[]"
		},
		{
			"id": "65c206f7-0658-4ae4-a264-5c78c1fe8466",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4dedafae-793a-42dc-a493-fb2287fb2b1a",
			"body": ">>95a06663-7c51-4ddd-9ce4-85d517140add\nStop spreading this meme. You've made like 4 posts talking about this supposed problem lol.\nAgain, the only required files are the content.json and data.json files. Everything else is optional and only downloaded when you actually enter a thread. So a 5k post thread with an average of 300 characters per post would only increase an install's size by about 2 megs.\nAnd even then, as I've mentioned somewhere else, there probably are ways around it if the required files get too high.",
			"time": 1567083035640,
			"files": "[]",
			"last_edited": 1567083067740,
			"subject": null,
			"capcode": null
		},
		{
			"id": "53f6d8c3-ce63-4642-803c-2527efcbc2fc",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4dedafae-793a-42dc-a493-fb2287fb2b1a",
			"body": ">>b97f547d-be94-4f6a-8fc7-d9a2372b67ba\n>Your brain gives up before your harddrive if you have to follow a 5k post long thread.\n... Except you don't have to read that thread if you don't want to?\n>And searching for potential issues that never happen with 1000 users but become unbearable with 10.000, is important after a single spammer fucked all the active boards into the dirt. I would rather fix them while we're small to avoid a single event rendering the site unusable.\nThen fix them. The code is open source. If you make it better then the changes will be integrated by the admin into the site. What's stopping you from spinning up a Millchan instance and writing the scripts to stress test it and see how it holds up, and fix whatever issues may arise? Nothing. You just sit there and complain about potential scaling issues to people who understand the actual scaling issues better than you do, and thus are in a better position to judge whether they should be prioritized over other work that needs to be done.",
			"time": 1567085706014,
			"files": "[]",
			"last_edited": 1567085737614,
			"subject": null,
			"capcode": null
		},
		{
			"id": "2485365b-1fd9-41aa-bec0-8abf022edb2a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "2cbee092-5b44-4bcb-a242-df11ea82d8b1",
			"body": ">>12ef8fda-3f25-4a14-84ed-8faac21e6f3e\nYou're doing everyone a disservice by not using random usernames.",
			"time": 1567085905847,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}