{
	"title": "FreeSpece",
	"description": "只分享有用的东西",
	"links": "*   [Source code](https://github.com/HelloZeroNet)\n    友情链接\n*   [FreeRoom](http://127.0.0.1:43110/freeroom.bit)\n*   [QianChen](http://127.0.0.1:43110/qianchen.bit)\n*   [ShutDown-t](http://127.0.0.1:43110/shutdown-t.bit)\n*   [Ghost Talk](http://127.0.0.1:43110/ghosttalk.bit/)\n*   [灵异谈](http://127.0.0.1:43110/ghosttan.bit)",
	"next_post_id": 20,
	"demo": false,
	"modified": 1517462366,
	"post": [
		{
			"post_id": 19,
			"title": "读书是最便宜的事，也是最应该做的事",
			"date_published": 1517462272.462,
			"body": "<div id=\"primary\" class=\"content-area\">\n\n<nav class=\"current_nav\">最近，香港一家新加坡资本的连锁书店 PAGE ONE 全线停业了，之前行内就传说他们欠帐，行家已不再发货给他们，他们门市店面也潦草杂乱，显出一种败象来，终于捱不住，酿成一次香港最大规模的书店“执笠”事件。\n</nav>\n\n<div class=\"entry-content\">\n\n这年头纸媒寿终正寝似乎是正常现象，香港人照常早出晚归，没什么哀悼心情。要来的总会来，差别只是迟早。\n\n* * *\n\n但曾经，PAGE ONE 是香港极有代表性的书店，它走高档路线，目标读者为具高消费能力的中产。中英文图书均采购严谨，以美术、设计、建筑、摄影、时装、潮流等大型画册占主流，思想文化类的图书也在当眼位置，对流行读物则倾向有选择性精选的策略。他们的店面装修走高雅简洁风格，空间比较宽舒，采光适中，音乐抒情，给香港读者的印象，是类似台湾的诚品，虽然远不如诚品的多元化。\n\n书店不景已不自今日始，业者无不在寒冬中度日，除了左派集团的书店有强大后盾之外，其余的都在捱紧日子。书店日子难过，出版自然也好不起来，整个行业江河日下，看不到前景。\n\n信息爆炸的年代，社交媒体史无前例地扩张，生活极度方便后，并没有给人们提供更多闲暇。再加上娱乐花样日新月异，如盘丝洞一样易进难出。人们将有限闲暇分配给不同亲友圈，分一点关注时事，剩下来的就用来疯传一些似是而非的心灵鸡汤，读书至此成为一件奢侈的事。\n\n但实际上，世上没有比读书更便宜的事，也没有比读书更让自己增值的事。自古以来，写书的人都是各行业的专家，出版一部著作是一件严肃的事，李时珍写《本草纲目》，原稿丢失后要全文重写，曹雪芹写《红楼梦》要“披阅十载”，真是呕心沥血。作者写好后，要经有经验的编辑审稿，再三修订斟酌，然后还要排版、校对、制版等不同工序，最后才到工厂印刷。印一批书出来，要经发行渠道散到书店，店员要花心思摆设，作必要的宣传推广，然后你大爷一样到书店，挑挑捡捡，付钱带一本书走，你根本不知道一本书里有多少人的心血。\n\n一个专家穷大半生的精力致力于专业研究，然后以深入浅出的文字将自己的研究成果转化为一部著作，书印出来，以人人都可负担的售价在市场上流通，如此专家的学说便成为人们共同的文化资产。\n\n有些知识未必是你实时需要的，有些需要不同的知识作参照和综合，但在大量知识融汇到你内心时，会在那里产生奇妙的反应。那时彷彿有一些先前没有的认识事物的澄明智慧产生出来了，你看问题会有不同角度，你会时常对某些事物产生灵光一闪的顿悟，你会从不同事物中间归纳出相同的规律，你会觉得面对陌生事物时，拥有比先前更细致、灵敏、深刻的感受力。\n\n一个优秀作家将他的人生经验化成小说或散文，他对社会人生、历史文化有敏锐的洞察力，通过一些生动的故事和生活细节，展示社会的真实面貌，剖析人性的复杂与人心的幽微，在那些曲折而丰富的情节推展中，暗含人生的感悟与智慧。读一部小说，不但经历了某些人的人生，还从那些陌生人的遭遇里，感染世间的真善美，荡涤心灵，让自己的精神境界得到升华。\n\n有些故事发生在不同的时空，有些人的经历与你风马牛不相及，但普遍的人性毫无例外地广披古往今来的社会。千古以下，人间都有正义，卑劣的人到处横行，亲情、爱情、友情、乡情、家国民族之情，放诸四海而皆准。你在没有恋爱之前，已经饱尝爱情的狂喜与折磨﹔你在未失去亲人前，已经领略骨肉撕裂的痛楚﹔你身无寸铁，已经参加过起义﹔你锦衣玉食，已经感受大厦将倾的恐惧。\n\n文学作品让你经历更丰富的人生，让你更深刻地体认生命的真谛。虚构的故事反应的是真实的世界，那个世界比你亲身经历的更广阔、更丰满、更富于启示，你比别人积累更多的人生经验，也比别人更洞悉生活的奥秘。\n\n数千年来，人都是通过读书来长知识、长智慧，随着年岁的增加来长阅历、长经验。没有读书，阅历和经验都只在感性的层面，一个不识字的农民也有种田的经验，也经历生老病死，但他的眼界始终离不开大山，他的心胸也只有三分地一间屋。人要更深刻和广阔地认识世界，唯有通过读书来达到，因为人的实际生活经验有限，而知识的疆域无垠。\n\n现在有些年轻人不读书，他们以为信息已经够泛滥了，要明白世界，有各种社交媒体上流传的信息，世界就是那么回事，没什么奥妙，有什么不懂，随时“谷歌”一下，就有现成的答案。至于为人处世，一个时代有一个时代的方式，千年以下那一套东西已经不灵了，年轻人自有应对世界的心法，那些在朋辈之间的交往中，自然会形成起来。\n\n年轻人意气风发，面对复杂的世界信心爆棚（信心满溢），指点江山激扬文字，追赶潮流唯恐不及。他们已经很难安静地坐下来，好好读一本书，用心读很多书，想很多事，从历史中去追寻前辈的足迹，以更宽阔的心胸去想象未来。他们对身处的社会有关怀，但找不到着力处，他们对人世的是非有激情，但缺乏判断力。\n\n当然，任何时代的年轻人都有共同的优势，也有各自的弱点，但现在的年轻人与前辈年轻时不同的是，他们不读书了。想想五四那一辈、民国那一辈、甚至红卫兵那一辈，虽然也都经过荒唐的青春岁月，但他们的思想底子，显然与现在的年轻人不同。最近有台湾中学生将纳粹标志拿来巡游，有香港的年轻人也为一些不切实际的理念碰壁，笔者以为，那都是不读书的缘故。\n\n纸媒的没落已成定局，没有人可以挽狂澜于既倒，但在可见的将来，书店还会存在，即使再过一百年，总还会保留一些图书馆吧，也就是说，书会永远在那里等你，你去不去找它，那是你的事情。\n\n你一心想发达，想干一番大事业，你学会钻营，会耍一点小聪明，在人际关系玩一点小花样，然后记住一些心灵鸡汤式的所谓人生哲理，你就信心满满去行走江湖了。你虽然也算是现代都市人，一天到晚出入社交媒体，打游戏所向无敌，你到处拿来现成的知识，能说会道，什么都懂（一点），什么都过目即忘，你当然也会活下去，甚至活得不赖，但到最后，年轻人，你的生命会沉淀下什么？\n\n读书是最容易的事，也是最便宜的事，是最应该做的事，也是最值得做的事。没有人读书的结果是，也没有人好好去写书了，写了书也没有人好好去编辑出版它了，编辑出版了，也没有人用心去推广销售了，百年以后，整体人类的平均思想水平会变成什么样子呢？这样的未来，难免令杞人忧天了。\n\n————–\n\n原标题：不读书的年代拼什么？\n作者：颜纯钩\n来源：腾讯大家\n\n</div>\n\n</div>"
		},
		{
			"post_id": 18,
			"title": "读书为何是终生进行时？",
			"date_published": 1515149144.697,
			"body": "目上的设问，一般可用“学海无涯，人生有限”来简括回答。这样说太笼统，人们难能确切把握，它其实还可以分几个层面来加以体会。\n\n* * *\n\n人生过程中，儿时“发蒙”教育之外，到了一定年龄，总要先读书学习相当数量的实际知识，用以基本谋生。沿着这条道路前行，人们得不停读书，以保持自身不落伍。时代发展，即使一个学科的知识，也层出不穷，这就使你无法停止脚步。只有不断读书，才能保证能较好完成生存基本所需的工作责任。\n\n与友人交谈，他提出一个问题：孔子提到的“五十知天命”的“天命”如何理解？彼此探讨的结果，以为是外界对人的限度。对与不对，每人都有自己的体会。可这引起了笔者对孔子这段话的思考：“吾十有五而志于学，三十而立，四十而不惑，五十而知天命，六十而耳顺，七十而从心所欲，不逾矩。”这段话，历来就有多种解读，见仁见智。随着人年龄增加，体悟还会发生变化。笔者以为孔子是通过年龄来说明人生精神境界不断提升的过程：三十岁时，人有其立志的激情；四十岁，应该有恰当的人生道路抉择；经过奋进、努力，五十岁应该懂得人不仅得有志向，还当有合适的外界机缘；六十岁，人历练已久，听得进各种顺耳不顺耳的话了；七十岁，应该通识人世、人生，达到内心自在而行为又在规范之中。每一个年龄段，都是一种新的认知境界。这是因为许多世事，需要经过时间的历练，才能真实认知；再有，它应该还包含人每个时段身体状态的发展，内外两方面的体验叠加，才能够达到孔子所描述的层层提升的不同人生境界。\n\n但笔者还有疑惑，这种认知境界，是自然而然就可得到，无须修为，无须个体努力吗？观察世事，显然不是如此。一些人，到了一定年龄段，并未达到“不惑”或“知天命”，更毋庸说“耳顺”等境界。这似乎非孔子描述不当，而是部分人缺少通过读书来不断补充知识营养，使得某部分心智不能伸展有关。心智的进步，最佳的积累传递来自阅读，阅读保证了思想有营养来源。通过阅读，得到智者先贤的不断启迪，再加上随年龄增长而获得的生命体验，这两方面共同合力，才使我们获得提升思想境界的可能。这种阅读，是无论修习文科理科的所有人都得进行的。因为这方面的问题，是所有年龄段的人都须面对，无可幸免的。\n\n此外，在读书过程中，我们都有过这样的感受：一部书，在青年时期也许觉得特别好，多年后拿起它，你以为能找到初读时的印象，可惜极少；另外一些书，初读它时，也许是硬着头皮，慢慢品咂出滋味。随着时光流逝，它竟然成了你的最爱。正如启发过马克思的德国哲学家黑格尔说过的那样：对于同一句格言，出自饱经风霜的老年人之口与出自缺乏阅历的青少年之口，其内涵是不同的。笔者以为，这说明，一部著述，有时还不是读了一次就满足，它的内涵底蕴，或许需要思绪的沉潜，生命阅历的增加，才能深切感受体味，这是读书是人的终生活动的又一层含义。\n\n我国当代著名作家孙犁，直到晚年还创作不辍，而且一直保持着很高的水准，有学者评论他的创作几乎没有废笔。他晚年写成的十册文集，几乎篇篇可读。这些作品中显现的思想的成熟和文字运用的自在，真可谓是“从心所欲不逾矩”的境界。为何？笔者以为，是读书所得。孙犁的身体并不佳，说不上有多么旺盛的创造力。但他的一生，直到晚年，一点不以“识途老马”自居，他给青年人写信，常常鼓励他们读书；他自己，晚年还出过一本《书衣文录》，即陆续在包书纸上写的读书体会。这些书，古今中外，正史野札，文史哲学，日记序跋，金石书画，甚至《古泉（钱）丛书》……真正五花八门，无所不包。这可以算是读书是终生活动的又一显著实例。\n\n因为人生短促，知识无穷；因为新知识不断产生，人们需要不断掌握；因为人的成长，理解感悟能力发展变化，需要不懈调适掌控；我们需要提升自己，使自己总能够更高质量地生存……而这些都需要通过阅读来完成或解决，所以：读书是我们应该终生进行的活动。"
		},
		{
			"post_id": 17,
			"title": "诚实难于死：知识分子应该是社会真相的守夜人",
			"date_published": 1514468553.378,
			"body": "西班牙内战是一场非常独特的战争。二十世纪有过更残酷的战争，也有过更重要的战争，但却很少有哪场战争在文化界引了起如此大的狂热。西方知识阶层普遍把西班牙内战当成一次左与右、善与恶、光明与黑暗的战斗，就如同中世纪的信仰之战。许多知识分子也真的拿起武器，前往一个陌生的国家，参加一场跟他们并无直接关系的血腥战争，对于他们来说，这就是他们的殉道之旅，就是他们的十字军圣战。而要理解这种激情与狂热，就首先要理解三十年代知识界的精神状态。\n\n* * *\n\n## 三十年代的天使与魔鬼\n\n欧洲知识分子在十九世纪是相当自鸣得意的。他们相信文明，相信进步，而且大致来说，也相信宪政民主的力量。但是第一次世界大战给了他们当头一棒。这场大战在欧洲知识阶层引起了一场严重精神危机。战争导致了很多人死亡，让人悲痛，但这还不是关键所在。二战的物质破坏更为严重，但它毕竟是一场有结果、有意义的战争。但是第一次世界大战是一场无法理喻的战争。除了摧毁文明世界的根基以外，它毫无意义。欧洲的知识分子对文明丧失了信心。以往他们相信上帝，等他们不相信上帝的时候，他们相信进步。现在他们既不相信上帝也不相信进步。二十年代的知识界弥漫这一种无力感，就像大病初愈的病人一样。他们是迷惘的一代。\n\n在三十年代，迷惘的一代迅速变成了极端的一代。这跟经济大萧条导致的社会崩溃有关。我们生活在一个经济繁荣的年代，对市场经济颇有信心，所以很难理解那时人们的绝望。在三十年代，大家普遍觉得市场经济那套行不通，必须得让国家把经济接管过来。民主宪政也成了一条落水狗。1920 年的时候，全世界有 35 个立宪政体，到了 1938 年，只剩下了 17 个，减少了一半。人们普遍流行一种感觉，就是宪政民主解决不了问题，市场经济解决不问题，我们必须另找出路。\n\n颓废的知识分子也没有闲暇颓废了，他们一下子变得亢奋而狂热。他们开始寻找一种能够拯救世界的东西：一面旗帜，一种信仰，一个承诺。自由主义者给不出立竿见影的药方，但是斯大林和希特勒可以。西方的知识界迅速地分裂为左翼和右翼。而在英美法这样的民主国家，左翼知识分子占压倒性的多数。英国作家奥威尔回忆说：“在 1934 年或者 1935 年，如果作家不左倾的话，会被认为是个怪物。”那一代知识分子几乎集体迷恋上了苏联，要是你说苏联发生了一些可怕的事情，他们会觉得你造谣。要是你说的实在有根有据，他们会解释说那也是没办法的事儿，然后追问你为什么心眼这么脏，非要纠缠于这些事情。法国作家纪德就是写了一本《访苏归来》，对苏联说了一些坏话，虽然说得颇有节制，甚至有点“为党提意见”的意思，但是也不行。他被作家同行们围攻声讨，弄得处境极其尴尬。三十年代的知识界就活在这样一个气氛中，完全被意识形态所支配。\n\n西班牙内战是因为社会革命引发的，交战双方又分别得到了希特勒和斯大林的帮助。在这个大背景下，它就带上了强烈的意识形态色彩，成了天使与恶魔的战斗。西班牙内战双方都在国外做宣传，力证自己是天使而对方是恶魔。但是西欧普遍左倾，佛朗哥当然宣传不过共和军。再说，共和军提出的口号也确实更激动人心，再加上它本来就是民选出来的合法政府，占据法理优势，所以共和军的宣传大获全胜，就连非左翼的人士也往往倾向于同情共和军。以坚决反共的丘吉尔为例，一开始他觉得共和军比佛朗哥还坏，共和军挑起红色恐怖而佛朗哥只是“野蛮报复”，但是后来他变得更倾向于共和军，甚至以私人身份向共和军的部长提政治建议。\n\n佛朗哥在知识界也有一些支持者，比如著名作家伊夫林.沃，诗人克罗岱尔，作家贝洛克等等，其中还有我们非常熟悉的《魔戒》作者托尔金。这些人有个共同特点，就是他们都虔诚地信奉天主教。共和军在西班牙没收教会财产，关闭修道院，杀死了超过 4000 名教士和修女。托尔金这些人未必对佛朗哥有多大好感，但是他们被共和军的这种行为深深激怒了，所以他们坚定地站到佛朗哥一边。在信奉天主教的爱尔兰，人民也普遍憎恨共和军。爱尔兰甚至还有一支几百人志愿军前往西班牙，支持佛朗哥。\n\n不过，跟共和军的支持者比起来，这些人就显得微不足道了。几万名志愿者从世界各地赶来参战。英法等国都禁止本国公民参战，威胁要逮捕他们，但是依旧无法阻止志愿者。民间普遍把这些人当成英雄，志愿者坐火车穿越法国-西班牙边界的时候，海关官员不仅不逮捕他们，还对着火车欢呼：“西班牙万岁！”\n\n这些志愿者都是些什么人？他们职业分布五花八门，既有码头工人和教师，也有杂技演员和犹太拉比。这些人大多热爱阅读，喜欢思考。记者们就注意到，这些国际战士不得不减轻行李的时候，丢弃了许多随身携带的书籍，有康德，黑格尔的书，也有马克思和尼采的书。他们非常勇敢狂热，在战争中阵亡率高的惊人，比如美国志愿者的死亡率有三分之一，英国志愿者的死亡率也有近四分之一，如果加上负伤者，那比例就更高了。\n\n前往西班牙支持共和军的不仅仅有这些普通人，还有很多文艺界的精英，甚至是顶级的精英，比如英国作家奥威尔就到巴塞罗那参战。英国诗人奥登跑到西班牙去开救护车。法国著名作家马尔罗则组织募捐，为西班牙共和军购买了几十架飞机，组成了“马尔罗飞行队”。可惜马尔罗本人不会驾驶飞机，所以只能穿上飞行夹克跟飞机合影，希望读者误以为他英勇参加了空战。还有很多文艺精英作为记者来到第一线，比如海明威、帕索斯、卡帕、《小王子》的作者圣埃克絮佩里等等。他们都是怀着远大的理想前来，希望向全世界证明西班牙共和军的光荣和伟大。\n\n但是问题在于，共和军并不仅仅有光荣和伟大，它也有血腥残酷的一面，更有彼此残杀的一面。知识分子要如何对待这些黑暗之物？这些左翼知识精英在立场和事实、理想和良心之间要如何取舍？\n\n## 你是站在我们一边，还是站在敌人一边？\n\n对于海明威来说，一切都很简单。西班牙内战是自由战士和法西斯匪徒之间的战斗，你要是说共和军的坏话，那你就是支持法西斯匪徒，你就是个坏蛋。\n\n海明威是个怪人。他确实有一定的理想主义色彩，但他骨子里主要是个强烈的自我中心主义者。他在政治上显得非常激进，但是你很难说他的激进是认真思考后的结果。他更像是在追求一种浪漫化的硬汉效果：炮火纷飞中一个勇敢的男人直面死亡，完成了他的使命。他在第一次世界大战中的参战经历，对他似乎有一种深刻的影响。他虽然写出了《永别了武器》这样的反战小说，但是他其实对战争是一种迷恋的。他热爱斗牛，热爱暴力，热爱一切看上去和战争有点相像的东西。海明威对生命缺乏尊重，对是非对错其实也没有什么兴趣。他曾粗暴地说：反对苏联阵营的，“不是傻瓜就是无赖”。一个如此发言的知识分子，几乎可以肯定，他对立场的兴趣远远大于对具体是非的兴趣。\n\n海明威确实很勇敢。在西班牙内战中，他曾经遇到过相当危险的场景，却表现地非常镇静。但是他的大部分时间还是呆在马德里的酒店里，和各种各样的人物（包括苏联派来的政治委员）一起猛灌威士忌。他有专业记者的素养，很仔细的观察着周围的一切，为自己的作品搜集素材。在马德里发生的一些可怕事情，海明威肯定知道，但是他保持了沉默。他不光是当时保持了沉默，而且终其一生都保持了沉默。为什么呢？也许是他觉得说出这些黑暗之物对左翼大业不利。但更有可能的是，海明威觉得这些黑暗之物一点也不重要，甚至是理所当然。\n\n但是帕索斯不这么认为。帕索斯是位著名作家，写过《美国三部曲》，还上了时代周刊，在当时名气比海明威可能还要大一些。他和海明威是老朋友，连他的妻子都是通过海明威才认识的。帕索斯也是个左翼知识分子，全面支持西班牙共和军，万里迢迢地跑来，要拍一部纪录片《西班牙土地》，为共和军做宣传。可是电影还没拍呢，就出事了。帕索斯有个叫罗布雷斯的好友。他是一位西班牙籍教授，同时也是支持共和军的左翼人士。帕索斯打算让罗布雷斯当他的翻译兼联络人，谁知道他刚到西班牙，就发现罗布雷斯失踪了。\n\n罗布雷斯是被捉走了。当时西班牙共和军正搞肃反，罗布雷斯就落网了，不久就被当成法西斯间谍处决了。处决是秘密的，帕索斯只知道朋友失踪了。他一边安抚老朋友的妻儿，一边到处找人，想要搞清楚到底是怎么回事。但是没人搭理他。海明威跟他住在一个酒店，看他那副沮丧样子，冷言冷语地说：“你的教授朋友失踪了，看开点，很平常的事儿。”在海明威看来，帕索斯真是莫名其妙。伟大的战争正如火如荼，帕索斯居然为损失个把朋友而伤心！要是帕斯被捉去枪毙了，海明威就绝不会当回事。\n\n帕索斯忧心忡忡地问海明威：“我心底一直藏着一个问题，就是如果公民自由在战争中被毁灭了，那么人们为了自由而打一场战争还有什么意义呢？”海明威的回答是：“公民自由，狗屎。你是站在我们一边，还是站在敌人一边？”\n\n帕索斯理想破灭，离开了西班牙，海明威认为他懦弱，对他充满了鄙视。后来帕索斯在文章里写出了他对战争的感受，海明威读后勃然大怒，给他写了一封信说：我知道你为什么写这种反动肮脏的东西，“是为了钱。”他断定帕索斯被反动势力收买了。后来他们在一个火车站碰到了，海明威上去要揍帕索斯，被人拉开了。两个人彻底决裂了。\n\n海明威留在西班牙，写了许多文章。后来他还写出了《丧钟为谁而鸣》和《第五纵队》两本书。《第五纵队》来源于一个广泛流传的说法，就是人民阵线内部有一个内奸部队。事实上，这个说法完全是子虚乌有。历史学家已经证明了根本不存在所谓的第五纵队。可是几千人为这个谣言丧生。不过那又怎样？红光闪闪的《第五纵队》一直到现在还是文学经典，被广泛阅读。\n\n## 必要的谋杀\n\n奥威尔的经历更糟糕。他是个热血的左翼作家，为了筹措去西班牙的旅费，把家里的银餐具都典当掉了。但是他虽然一腔左派热血，但是对政治局势相当模糊。他想要在英国找个左翼组织给他开个介绍信。但是找谁开呢？奥威尔凭直觉先去找的英国共产党，可是人家不肯给他开。他就拐弯抹角联系上了西班牙的马统工党，简称 POUM。POUM 是一个比较小的党派，也是西班牙人民阵线的一部分，当时控制了巴塞罗那地区。在奥威尔看来，在这场内战里天下左派是一家，共产党也好，POUM 也好，有什么差别呢？其实差别大了。就在奥威尔开介绍信的时候，斯大林已经下了密令，要求彻底铲除掉 POUM。西班牙共产党表示坚决执行。\n\n奥威尔直奔巴塞罗那。巴塞罗那的革命形势让他精神大振。那里几乎所有的私人企业都被没收了，咖啡馆里的侍者跟顾客互相用同志相称，大家都穿着同样的制服，所有的街道都涂满了革命标语。奥威尔一下子就被迷住了。其实这些场景跟奥威尔在《1984》里描写过的大洋国很像，但他自己并没有意识到。终其一生，奥威尔都在怀念当时的巴塞罗那，认为那才是真正美好的革命。他在战壕里呆了好几个月，勇敢地像个疯子，最后咽喉中弹，被送进了医院。\n\n就在他住院的时候，POUM 覆灭了。它的领袖安德烈.宁被逮捕，严刑拷打后处死。马统工党的 40 名执行委员几乎全部被捕，监狱里的政治犯已经高达数千人。奥威尔正巧住院，大家把他给忘了，否则他一定也难逃罗网。\n\n奥威尔对外界情况一无所知。他的妻子当时也在巴塞罗那，他出院后去找妻子，妻子一脸微笑，用手勾着他脖子，在他耳边小声说：“快走。”奥威尔像野兽一样东躲西藏，住在废弃的洞穴里呆了三天。后来他们夫妻觉得风头已过，大着胆子去监狱探访朋友，哪里的情景让奥威尔大吃一惊。监狱里居然关着小孩子，明显不到 12 岁。还有两个被截肢的伤员，被逮捕的时候连拐杖都没带，只能在监狱里一蹦一跳。奥威尔从没见到过这么残酷的景象。\n\n奥威尔获得英国领事馆的帮助，逃出了西班牙。从此以后，奥威尔的政治观点发生了巨大的变化。他还是一个坚定的左派，但是极其地厌恶斯大林，厌恶苏联，厌恶一切极权政治。他决心要把自己看到的真相说出来。\n\n可是没有人要听。英国的左派不愿意听奥威尔的大喊大叫。他们几乎都像海明威一样，认定最重要的是立场，“你是站在我们一边，还是站在敌人一边？”如果你站在我们一边，你就不能说人民阵线的坏话。就算你说的是真相，那也是应该被隐藏的真相。奥威尔写了一篇《目睹巴塞罗那》，杂志不肯登，因为“它立场不正确”，奥威尔又写了一篇《西班牙战场》的书评，杂志还是不肯登，因为“它的立场还是不正确”。奥威尔写了一本揭露真相的书《向加泰罗尼亚致敬》，费好大力气出版后只卖掉了几百本。\n\n奥威尔第一次发现了人们其实不关心真相，如果立场要求他们承认二加二等于五，那他们就会说二加二等于五。这个发现让奥威尔极度惊骇，也成了他以后作品的一个最核心主题。在他愤怒的时候，诗人奥登撞到了他的枪口上。奥登从西班牙回来以后，写了一篇著名的诗歌《西班牙》，里面有这么一段：\n\n> _今天，是死亡几率的有意增加\n> 是对必要的谋杀中的罪犯心存宽恕\n> 今天，是短命的传单和在无聊的会议上\n> 行使权力。_\n\n奥登的意思是说，“今天”虽然有种种迫不得已的烂污事儿，比如“必要的谋杀”，但是这些事儿能换来美好的明天，所以也是值得的。奥威尔却被激怒了：“只有根本不懂什么叫谋杀的人，才会写出这么个词儿。对我来说，谋杀是应当避免的。每个普通人也是这么想的。”那么为什么奥登不这么想呢？奥威尔的答案很简单：因为那发生在其他地方，发生在其他人身上，所以，”奥登先生的这种无道德感才能产生。”奥威尔评论说：“一群甚至不知道火是热的人在玩火。”\n\n奥威尔说出了很重要的一点。当时英美知识分子并不真正理解极权主义。他们满眼只看到了自身社会的种种不好，但是却不真正明白大清洗是什么、洗脑是什么、政治谋杀又是什么。就像奥威尔在一篇文章里说的那样：对于英国人来说，想象这些事情是很困难的，所以他们不知道害怕。奥登从来不担心自己在英国会秘密失踪，从不担心自己会在午夜被捉走送进集中营，所以他对这些事就不是很生气，他生气的是英国统治阶级的虚伪和可恶。如果真有一天，奥登他们求仁得仁，落到了苏联同行的处境，那他们肯定会先是惊骇不已，然后就只能低头顺从。\n\n大家读到这里，也许会认为在立场和真相之间，奥威尔选择了真相。但是事情并不那么简单。他真的说出真相了么？他真的认为“谋杀就是谋杀”了么？\n\n没有。奥威尔同样用立场遮蔽了真相。在《向加泰罗尼亚致敬》，他把 POUM 统治下的巴塞罗那描写成一片正义和光明，“我看到了精彩的景象，最终真正信仰了社会主义，而我以前从未这样。”事实上，POUM 是一个带有强烈无政府主义色彩的政党，他们的行为极端残暴。他们没收财产，处死阶级敌人，屠杀修士，其激烈之处甚至超过了马德里的人民阵线。斯大林镇压 POUM 的一个重要理由，就是觉得他们太过火了。斯大林认为要打赢战争就要团结一些中间力量，但是 POUM 坚持认为对敌人决不能手软。奥威尔坚定地站在 POUM 一边。也就是说，奥威尔认为斯大林不够革命，没有在西班牙马上推行集体化，没有消灭资产阶级，没有消灭收入差距！我们可以为奥威尔做辩解，说他虽然理念激烈，但并没有亲眼看到巴塞罗那的屠杀，所以也是被骗了。但奥威尔实际上是知道的，他自己就提到过墙上的枪眼，那些枪眼是 POUM 处决修士和阶级敌人时留下的。对于奥威尔来说，这是不是“必要的谋杀”呢？\n\n## 诚实难于死\n\n西班牙内战已经过了将近八十年。从现在看过来，共和军和佛朗哥的国民军都干了很多残暴的事情，双手都沾满了血。我们不能因为共和军的红色恐怖，就宽宥国民军。事实上，国民军杀的人更多一些。至于他们的政治路线，都相当极端。我们可以猜测，如果共和军获胜，西班牙要经历的道路可能会更坎坷，但这也只是一种猜测。我们真正能说的，就是一场悲剧。\n\n至于那些热情参战的国际志愿者，当然值得我们致以敬意。有一位美国的年轻人，留给他母亲一封信后前往西班牙。这封信里写道：“我必须去西班牙打法西斯，这样以后我不会后悔，说在我们还有机会打败法西斯的时候，却没有去。”这种情怀是让人感动的。奥威尔变卖家产前往作战，同样让人感动。但是在感动之后，我们也看到了事情的另一面。许多理想主义者最终在立场和事实中间选择了立场，在理想和良心之间选择了理想。他们像奥登一样，为自己找到了种种借口，要展望未来，要牺牲小我，要顾全大局，要原谅这一点小小的屠杀。就连奥威尔也在说出真相的时候，掩藏了真相背后的真相。\n\n可是在一个社会里，知识分子应该是社会真相的守夜人，就像科学家应该是科学事实的守夜人一样。当知识精英都要为了大局出卖真实的时候，这个社会就离堕落和疯狂不远了。他们来到了西班牙，他们勇敢作战。他们是勇士，他们不怕死，但有时候，诚实比死还难。\n\n（给《国家人文历史》的一篇文章）\n\n—————-\n\n原标题：诚实难于死\n作者：押沙龙"
		},
		{
			"post_id": 16,
			"title": "困惑与危机：节节败退的中产阶级",
			"date_published": 1514210463.776,
			"body": "最近，中国的中产阶级感到前所未有的危机。2016 年 7 月 9 日《经济学人》(The Economist) 的封面文章是《2.25 亿人踏入中产阶级，让中国执政者担心》的分析文章，指出了中国执政者在对待中产阶级时的困惑，更是指出了中国中产者的困境。\n\n* * *\n\n![China-Middle-Class.jpg (350x489)](data/img/post_16_China-Middle-Class.jpg)\n\n▲ 2016 年 7 月 9 日《经济学人》(The Economist) 的封面文章\n\n在过去三十年中，中国经济发生了重大的飞跃发展与变化。中国的中产阶级人数从 1980 年代的几乎为零增长到今日的 2.25 亿。文章指出，“中产阶级对现状是不甚满意的，他们担心养老；他们担心因病返贫；他们担心房产权得不到保证……”。\n\n尽管本编辑部对于《经济学人》这篇文章的结论并不赞同，但不得否认，它还是触及到了中产阶级的痛楚。过去的几年，对于中产阶级而言，确实可以用“节节败退”来形容。这个阶级目前遭遇到了结构性的困境，他们挣扎于理想的彼岸与现实的此岸之间。\n\n以下是三个真实的案例：\n\nA 君，从小县城考上了北京某名牌大学，毕业后努力奋斗，成为了一家公司的营销总监，及时买房买车，事业有成。但是 2012 年公司人事变动，他被迫离职。之后投资了几个项目，但最后因为没通过政府审批而血本无归。目前年近 40，就业难度剧增。\n\nB 君，也是在上海名牌大学毕业，2004 年毕业后进入报社。因工作原因，先后浪迹上海、广州、武汉，最后定居深圳。从 2014 年起，报业没落，收入打折，房租则大幅攀升，他又一次到了失业的边缘。\n\nC 君，医生，生活在南京。最近，全国频发的“袭医案”让他情绪极为低落，工作状态大不如以前。最近，在网上看到了江苏省高考削减 3.8 万学位的新闻，作为父亲的他，准备给孩子办移民手续。\n\n## 一、中产的脸谱\n\n按照对于中产阶级的定义，是指人们低层次的“生理需求和安全需求”得到满足，且中等层次的“感情需求和尊重需求”也得到了较好满足，但不到追求高层次的“自我实现需求”的阶级（或阶层）。\n\n总结起来，应该满足以下条件：\n\n1.  中产阶级，大多从事脑力劳动，或以技术为基础的体力劳动；\n2.  主要靠工资及薪金谋生，家庭年收入在 1.15 万美元和 4.3 万美元（约合人民币 7 万——28 万）之间；\n3.  一般受过良好教育，具有专业知识和较强的职业能力及相应的家庭消费能力；\n4.  有一定的闲暇，追求生活质量，对其劳动、工作对象一般也拥有一定的管理权和支配权；\n5.  他们大多具有良好的公民、公德意识及相应修养；\n6.  他们分布在中国各大一、二线城市。\n\n换言之，从经济地位、政治地位和社会文化地位上看，他们均居于现阶段社会的中间水平。或者我们再说具体一点，就是近20年踏入职场的、受过高等教育的、受到社会认同的职业人，比如说白领、律师、医生、学者、教师、记者、公务员（可能是一部分）、设计师、程序员、中小企业的经营者等。还有一个词汇与之相当：知识阶层。在更早期，人们还将他们叫“社会精英”。\n\n一般而言，大学生在毕业后，需要经历十年以上的奋斗期，直到拥有体面的工作、拥有良性的职业发展道路。因此，他们的岁数大多是在30岁以上，相当一部分人已经结婚。不管是体制内的公务员，还是体制外的“高级打工者”，或是自主创业的个体户，他们都要通过知识技能和职业发展得到社会认同。\n\n在北京、上海、广州、深圳等一线城市，中产阶级的微信里一般会有几个“校友群”，对他们来说，这种通过学历和知识建立起来的身份认同感，远远比地域带来的认同感要强得多。你可以看见中产用微信加了一个“xx 大学校友团”，但是你未必会看见中产去参加一个鱼龙混杂的“xx 老乡会”。从中产的身份认同里，可以看出这是一个受过高等教育的阶层，拥有良好的教育背景是中产阶级的重要特征。\n\n中产阶级的兴起也带旺了很多产业：他们热衷国外品牌催生了“代购”；他们喜欢自助旅游催生了大量“旅游攻略 APP”；他们喜爱看美剧促进了职业字幕组的发展……在互联网世界上，中产阶级也是中国第一批网民。早期互联网世界的知识共享和社区建设，是这部分人的心血结晶。\n\n中产阶级的脸谱从以上描述可以得出个大概，“拥有财富”是成为中产阶级的必要条件；但是，中产阶级的资格，是通过每一个个体奋斗而来，甚至说，大部分是在高考这场血腥战役中的赢家。\n\n在不久前的过去，他们曾经是光芒四射。\n\n## 二、中产的沦陷\n\n但是，近十年间，中产阶级的光环开始消退。\n\n### 1、1999 年起大学扩招。\n\n这或者是一个起点，从那时开始，大学生就业变得艰难起来。人力资源开始贬值，知识阶层的优势地位不再，尤其是进入2006年之后，大学生显得严重过剩，对薪金的期望值不断降低。高竞争、高淘汰率加深了知识阶层就业的困境。当中产阶级读到这些新闻时，还在为师弟师妹忧虑，但现在回过头看，这一切环环相扣：在优质人力资本价格如此低廉之际，作为打工者的中产，边际效益也在消失。\n\n“社会支出加大，福利制度不完善，固定资产疯狂升值，加上高效资本配置下的财富两极分化，中国的中产阶级在08年前后迎来了整个群体的流失周期。”中央电视台财经评论员许一力这样说。\n\n“然而进入后工业时代之后，社会的重心从生产效率向资源和精神溢价方向转移，第一批中产阶级的社会地位开始降低……近几年频频看到的所谓高薪快递员，高薪泥瓦工，高薪保姆等等现象，就是这种社会重心偏转的表现。”\n\n以“供求决定价格”的朴素道理去理解，就能知道教育产业化，对中产阶级而言，是致命的打击。尽管职场人总是强调，“现在的大学生水平越来越低”，但不能改变大量高学历人才涌入而导致的市场恶性竞争。\n\n### 2、高涨的房价是一个显著的标志。\n\n从 2006 年开始，房价猛涨。在 2006 年至 2008 年期间，一线城市的一手楼价涨了一倍。这对准备置业的年轻中产而言，手头的钱立即不够用了。随之而来的 CPI 的激增，尤其是教育、饮食、消费上的涨价，使中产开始感觉到压力。2009 年火遍大江南北的电视剧《蜗居》，引爆了社会对高房价的忧虑。有一篇论文指出，“《蜗居》折射出中产阶层的现实困境，他们在高房价的折磨下失去了梦想的自由。”而《经济观察报》另一篇评论则指出，“那些仍然存有中产阶级幻象的人们徒劳地为现实所困，难以找出有效的解决方案。人们抱怨说自己的所有梦想与激情全部消耗在同包括房子在内的现实的搏斗中。”\n\n![WoJu.jpg (350x113)](data/img/post_16_WoJu.jpg)\n\n▲ 电视剧“蜗居”剧照，这部电视剧深刻地反映了高房价下年轻大学生的困境 。\n\n但悲痛的是，从 2009 年只是开始，到 2013 年之后的房价狂飙猛进，中产阶级可谓一败再败。在今天，以深圳为例，房价已经比 2009 年涨了 3-5 倍，比 2006 年涨了近 10 倍。这个数字超出了知识阶层的购买能力，也击垮了 90 后的大学生。他们通过读大学而实现阶层流动的梦想基本破碎。而对于一些有了房子的中产，并没有因为房子的大幅升值而激动，相反，他们已经变得神经脆弱，生怕因为一次决策失误，从而失去一切。“逃离北上广深”，这样的想法每天都在重复。\n\n### 3、知识换代太快，竞争力下降。\n\n近两年带来的移动互联浪潮，带来巨大的技术革新。很多中产阶掌握的技能，在科技更新浪潮中被边缘、被遗弃，而一部分中产阶级从“脑力工作者”沦为“普通技工”。\n\n在这里，以前文讲到的 B 君的故事比较有代表性。他原是一位熟练的编辑，但因为传播方式的改变，他的技术已经跟不上移动互联时代。这意味着，他必须要重新经历一次技术上的更新，才能重新获得竞争力。因此，他的下一步计划，就是攻读一个博士学位。\n\n近十年来，很多行业都发生了翻天覆地的变化。高校教师开始实行以论文为指标的评价体系，编辑记者则要适应新媒体的写作，程序员的技能要求不断被更新，服务行业更是全面互联网化。对于很多知识阶层而言，必须面临艰巨的探索任务。\n\n## 三、中产价值观的崩溃\n\n与物质上的窘迫相比，中产阶级的价值观崩溃，才是他们焦虑的真正原因。他们曾无比相信，知识能改变命运，奋斗能带来成功；他们强调法制化，需要权益与尊严得到保障；他们认可全球化，认可自由主义，因为只有市场经济才能让他们的价值获得最大体现；他们强调个人价值，强调生活质量，强调教育质量与公平。但是，目前的形势，正在逐一否定他们的价值观。\n\n深圳著名作家钟二毛表示，“中国的中产阶级硬件达到了欧美中产的标准，但不能说中产，我把他们叫‘小中产’。”为此，钟二毛写了一部小说，题目就是《小中产》，讲述中产只是“黄粱一梦”。“中国中产阶级没有安全感与幸福感，这源于社会的保障体系的不完善，以及政策的不连贯性。比如说政策上，股市今年上半年的熔断机制，有钱都变成没钱。还有最近的延长退休，关于养老的一些担忧。”钟二毛说。\n\n中国中产价值观的崩溃，应是出现在这几年：\n\n### 1、上升的途径无法打开。\n\n这一点是比较早期遇到的。中产阶级中的佼佼者，他们已经跨过了最大的几个陷阱，但在通往上层、顶层的步伐中遭遇了困境。这一点尤其表现在官场上、事业单位中，他们举步维艰、步步为营。中国的富豪阶层与特权阶层有着千丝万缕的联系，不管是先天基因还是后天营养，都不足以让中国的中产阶级与上层社会有过多的交集。在涉及到权力与利益的交换中，中产阶级发现道路极其狭窄。那是一个更讲关系、资源、潜规则的世界，“背景”、“后台”、“靠山”等游戏规则，并非中产阶级所擅长，就算是有路子的企业家，要打通这样的关系，也不是容易的事。\n\n“有背景的妖怪都被神仙收回去了，没背景的妖怪都被打死了。”这句总结《西游记》的名言，在网上流传甚广。虽然，有些中产阶级被迫成为“妖怪”，但因为没有过硬的背景，因此总会在一些事件中成为牺牲品。不少落马官员，事实上前半生都是中产的奋斗史。\n\n### 2、知识崇拜的破灭。\n\n“知识就是力量，奋斗可以带来成功”，对中国的中产阶级而言，这是他们最核心的价值观之一。中产阶级笃信知识的价值，他们通过考试进入高等学府、运用知识获得机会和财富，并且大多通过专业知识在所处的领域得到自我实现和社会尊重。但是，由于知识贬值，让他们竞争力下降。\n\n此前一度消失的“读书无用论”，重新在农村出现。当知识无法兑现为财富时，农村人不再愿意为孩子的教育承担更多费用。大批农村孩子辍学、弃考，据2015年华龙网的报道，重庆地区高考人数比例一度创下新低。“知识无用论”在某种意义上，否定了中产阶层所坚持的知识崇拜。\n\n真正打击中产的，还不仅是“读书无用论”，而是与中产信仰背道而驰的“厚黑学”横行。《经济观察报》的那篇评论《蜗居》的文章说，“在这部电视剧中，真正的成功者仍然是主流价值观所反对的一类既得利益者。原有的获取富有尊严的生活的路径，变得极度狭窄，你需要牺牲自己一贯接受的道德准则，向已有的体系妥协，才能获得物质上的满足。”事实上，在多个行业中，潜规则已经摆在那里。一些行走在灰色边缘的事，比如收回扣、收红包、敲诈勒索、刑讯逼供等，成为很多职场中人难以避免之困。\n\n### 3、个人的不安全感。\n\n今年5月发生的雷洋案，引发了中产阶级的极度不满。人民大学硕士毕业生、中国循环经济协会的工作人员雷洋在一次所谓的“打飞机”之后死亡，无论是死亡者本身，还是警方在事后的说辞，都引起了社会层面的强烈不满。以人大校友会为首，多个校友会联合发声，加上多位媒体人、学者、律师的批判。这反映了中产阶级对于个人权益上存在的巨大疑虑。在面对强大的国家机器时，他们的人权意识高涨起来。\n\n在政治立场上，中产阶级普属于保守派。一方面，他们是改革开放的受益者，并因此获得了一定的财富积累。他们需要更健全的法制来保障自己的权益。另一方面，他们对现状又带有批判性，包括不透明的司法制度、审查制度，细思极恐的新闻封锁。因此，他们希望渐进式改革，渴望进一步民主化，希望法制更健全。但最近的一些“国进民退”的迹象，让他们感觉苍凉。\n\n在中国大环境的裹挟下，中产阶级对于手中的财富有着极强的不安全感。他们害怕政府的某一个决策会压缩自己的库存、威胁自己的利益。钟二毛所说的“熔断机制”，就让万千散户血本无归。这引发了社会层面的不满，更加深了中产阶层的忧虑。\n\n2015 年 8 月 12 日天津爆炸事件，多位小区业主遭遇了惊心动魄的一幕，幸存者则开始了漫漫无期的维权之路。《VISTA 看天下》的封面标题是《消逝的中产梦》。文章写道，“一个世界里，人们在美好雅致的小区环境里，编织自己小富即安的中产梦；另一个世界里，一连串的漏洞，则在酝酿成一个巨大的炸药桶，扑向梦中人。”\n\n![TianJin-TangGu-DaBaoZha.jpg (350x217)](data/img/post_16_TianJin-TangGu-DaBaoZha.jpg)\n\n▲ 2015 年 8 月 12 日晚天津塘沽大爆炸现场，附近的小区也被卷入其中。\n\n### 4、反全球化思潮的兴起。\n\n拥有较高文化水平的中产阶级，普遍支持全球化和对外开放。中产阶级对西方文化比较认同，同时也具备不错的外语能力，甚至不少人也有过西方国家留学的经历，他们受益于全球市场竞争而带来的红利。大量的中产阶级任职于外企，这种打开国门自由竞争的方式，使得知识和智力成为核心竞争力，也使得中产阶级得以更好成长。\n\n但是，近些年的国际形势是向左转，保守势力开始抬头。底层民众开始表达自己的愤怒，反全球化思潮已经出现。\n\n从英国公投脱欧、“伊斯兰国”卷土而来、土耳其“伊斯兰化”到特朗普在美国大选中的强势，一些国家和地区开始重新审视自己在全球化过程中的利弊取舍，全世界开始进入一个自我意识复苏、排斥全球化的逆转时期。这个时期的到来犹如在寒冬里下了一场雨，对全世界的中产阶级而言，他们将要面对的，是不断萎缩的国际市场，还有在“本土意识”绑架下的精神困局。\n\n在中国，由于南海问题引发的爱国热，就导致了中产与底层民众截然不同的价值观。当草根民众开始高调爱国、转发“一个都不能少”的图片之时，遭到了中产阶层、尤其是知识阶层的嘲笑。他们以撰文等方式，讥讽“爱国者”是“脑残”。同样的，他们也遭到了草根民众（现在出现一个词，叫“不明真相的吃瓜群众”）的围攻，被谩骂为“汉奸”。我们从中看到了中国不同社群之间的价值观撕裂。同时，因赵薇事件也形成了“倒赵”与“保赵”两大阵营。尽管中产或许更接近客观事实的本质，但是面对草根民众气势汹汹的追问和恶搞，以及反智主义的兴起，中产阶层已经无法保持在话语建构的高地了。在互联网的海洋里，“精英”已经成为孤独的群落。\n\n与西方国家关系的恶化，对西方价值观的否定，也是对中产阶级的沉重打击。在本土主义与反智主义崛起之际，人们从全球化的拥抱者转而成为否定者之时，中产阶级此前的优势已经荡然无存。有网友评论称，“他们似乎已经站在了时代的对立面。”\n\n## 四、未竟的中产梦\n\n在中国，“文革”的阴影始终盘旋，非理性非正义常常占领着制高点，中国的中产阶级在这样的背景下，对于“法制”、“公正”的呼声空前高涨。他们清楚地知道，只有在法制健全、起点公平的社会里，他们的利益才能得到保障。\n\n![KFC-FenQing.jpg (350x262)](data/img/post_16_KFC-FenQing.jpg)\n\n▲ 因南海问题而包围肯德基必胜客的愤青\n\n不难想象，在未来的十年，中国的中产阶级会经历一个“寒冰期”，他们有一条更艰难的路要走。不管是努力寻求全球资产配置，还是丢下过往选择逃离，都是短暂消解中产阶级阵痛的镇静剂。前路在何方？他们一直在问自己。\n\n首先，中产阶层所期待的更高质量的生活环境及更美好的社会 (a better society)，恐怕不会到来。因为，此前的市场经济与发展主义的模式，很快将遭遇逆转。法治化、市场化、国际化的方向，也将走回头路。因为“平等”的呼声压倒了“发展”，全世界都是如此。地沟油、雾霾、莆田系医院、毒跑道、三鹿奶粉……这些中产阶级所深恶痛绝的东西，不会就此消失，或者他们将更普遍地抬头，以“中国制造”、“民族品牌”的身份抬头，在“中国崛起”的大背景中，他们将高歌猛进。大学教育将进一步保守化，一些西方的经典教材逐渐被取缔，比如说西方经济学、西方政治学等。前文引述的《经济学人》的文章，也提到了中国社会思潮中的保守一面，“不同于韩国和台湾等原东亚专制政体，中国中产阶级人数的量变并没有带来社会民主法制化的质变。”\n\n其次，野狼编辑部曾经预言过战争的可能性。如果国际社会的主题从合作变成对抗，那么，战争的可能性就必然存在。编辑部的判断是，哪怕战争不打响，但很可能将保持“不战不和”的状态，也就是说一直处于战备状态。即使如此，国内的形势将进一步从宽容变为紧张，对经济的打击将不可避免。\n\n更糟糕的是，近年来，中国民粹主义兴起，从“抵制日本而打砸日系车”到“保卫南海而砸苹果手机”，民粹主义打着“爱国”的旗号不断壮大，而队伍的人群，大多数是中国的下层社会民众。随着中国社会贫富差距不断拉大，阶层的固化越来越严重，不管是资源的分配还是政策的红利，下层社会分到的蛋糕越来越小。下层社会的民众，知识文化水平普遍不高，在以智力和知识为核心的市场竞争中，一直处于劣势，而且处境愈发艰难。在城市里，如果说中产阶级为了买一套房而身心疲惫，那么，下层社会可能是为了租一间房而咬紧牙关。而那些处于城镇和农村的下层社会，更容易成为“庶民”的代表，在现实的社会里失意，只能用仇恨报复社会。以小粉红为代表的二三流大学的学生，已经具备了斗争意识与强大的话语建构能力。\n\n在民粹主义高涨的时代，中产阶级有可能成为牺牲品。野狼编辑部认为，由于草根民众的强烈呼吁，政策不可避免地将向左转。对他们来说，他们不具备参与市场下的竞争的能力，“重新分配”成为他们迅速翻身的唯一稻草。而所谓的“重新分配”，抢走的无非是中产阶级的碗中羹。那些被砸的“日系车”和“苹果机”，被推倒的围墙，被践踏的小区，统统都由中产阶级买单。\n\n因此，编辑部谨慎地认为，中产阶级或许在未来十年，进一步节节败退。也许是中产阶级已经走得太快，需要停下来，等待庶民的脚步。\n\n**参考资料：**\n\n1.  李春玲：《如何定义中国中产阶级: 划分中国中产阶级的三个标准》。\n2.  周晓虹：《中国中产阶级的沉浮：自变量与因变量》。\n3.  ［美］陈捷 著，蒋林 陈红慧 译《中国的民主化和中产阶级：中产阶级的民主态度》。\n4.  陆学艺：《当代中国社会流动》，社会科学文献出版社 2004 年版。\n5.  周晓虹：《中国中产阶级调查》，社会科学文献出版社 2005 年版。\n6.  张宛丽：《对现阶段中国中间阶层的初步研究》，《江苏狂会科学》2002 年第 4 期。\n7.  杨宝璐、易萱、张恒：《梦断塘沽：爆炸后消逝的中产梦》，《VISTA看天下》。\n8.  许一力：《为什么中产阶级在消失》，腾讯财经。\n9.  曾于里：《中产梦的艰难：走向保守或反抗平庸》， 摘自《南方周末》。\n10.  何伟：《寻路中国：从乡村到工厂的自驾之旅》。\n11.  许知远：《中国纪事》，2008。\n12.  Homi Kharas. China Middle Class. Wolfensohn Center for Development at Brookings. 2012.\n13.  Homi Kharas, Geoffery Gertz. The Global Middle Class: A Cross-over from West to East,2010.\n\n—————\n\n原标题：节节败退的中产阶级\n作者：微信公众号野狼大势"
		},
		{
			"post_id": 14,
			"title": "《芳华》：人为什么要善良，这是我听过最好的答案 ",
			"date_published": 1514032215.645,
			"body": "<span style=\"max-width: 100%;font-size: 15px;color: rgb(136, 136, 136);box-sizing: border-box !important;word-wrap: break-word !important;\">导读：</span>\n\n<span style=\"max-width: 100%;color: rgb(136, 136, 136);font-size: 15px;box-sizing: border-box !important;word-wrap: break-word !important;\">不管这个世界让人绝望到什么程度，都要坚持做善良的事。</span>\n\n**Part**\n\n**1**\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">看完《芳华》，我把黄轩饰演的刘峰定义为好人。</span>\n\n* * *\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">因为：</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">做梦都想去上的大学，有人更需要，他便拱手相让；</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">战友让他带去修的手表，太过名贵没人敢修，他便自己研究后修好了；</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">战友结婚，为了给他省钱，他自己买材料亲手做了两个沙发；</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">南方的女战友，不喜欢吃饺子，他就煮挂面给她吃；</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">食堂煮破没人吃的饺子总是他主动打来吃；</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">就连猪跑了，别人也第一时间是叫他来帮忙。</span>\n\n**<span style=\"font-size: 15px;color: rgb(123, 12, 0);\">他竭尽全力地帮助所有人，大家也热情地叫他</span>**<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">**<span style=\"font-size: 15px;color: rgb(123, 12, 0);\">活雷锋。</span>**</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">可好人总是难做。刘峰的善良在浑浊的背景下，显得那么单薄和活不下去。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">他喜欢文工团的女独唱，那个叫林丁丁的姑娘。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">在一次“冲动”的告白后，刘峰尝试拥抱林丁丁，却不幸被路过的男战友撞了个正着。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">男战友们看到后的第一句话是：</span>\n\n> <span style=\"font-size: 15px;color: rgb(136, 136, 136);\">好哇，林丁丁，你居然敢腐蚀活雷锋!</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">林丁丁怕这样传出去自己就算跳到黄河也难以洗清了，只好向组织告发：刘峰是主动强行“触摸”她。</span>\n\n**<span style=\"font-size: 15px;color: rgb(123, 12, 0);\">而这次不大不小的“触摸事件”却成了刘峰人生的分水岭：</span>**\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">他被下放连队，随即参加战争，战争中一心寻死却落到终身残疾，之后的他，退伍还乡，生活潦倒。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">下放连队前，之前受他帮助的战友，一个都没来相送。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">转业后的刘峰来到海口，不再是战斗英雄，也不再是雷锋楷模，他只是底层一个最不起眼谁都可以欺负的残疾人。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">岁月漫漫，芳华刹那，特殊的年代，刘峰的善良只剩下卑微个体的苟延残喘。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">但电影的最后说：</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">之后的他，看起来那么知足，那么冷静。</span>\n\n**<span style=\"font-size: 15px;color: rgb(123, 12, 0);\">每个人都爱刘峰，可惜却没人喜欢他。</span>**\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">正如马男波杰克所说：</span>\n\n> <span style=\"font-size: 15px;color: rgb(136, 136, 136);\">直到有一天，你看看自己的周围，发现大家都爱你，但没人喜欢你，那将是最孤单的感觉。</span>\n\n![](https://mmbiz.qpic.cn/mmbiz_png/cyFh1D1vibv9TBwwty8ylC8miaDYr8ZGZVkX8k0iavrGkiaqWbfNe0ooug8OEkomNJV9GMWCGkp2urjOPrz49oAphA/?wx_fmt=png&wxfrom=5&wx_lazy=1)\n\n![](https://mmbiz.qpic.cn/mmbiz_png/cyFh1D1vibv9TBwwty8ylC8miaDYr8ZGZV8QUKeia3VdVhAiaJNq29Ep9209dDUPiasFvmdQap6kPhfwDPhyA45mPMg/?wx_fmt=png&wxfrom=5&wx_lazy=1)\n\n![](https://mmbiz.qpic.cn/mmbiz_png/cyFh1D1vibv9TBwwty8ylC8miaDYr8ZGZV83bLxg8mMctNNZe9YVJXUntiaRUJSck1Jn5tKF5KAwmb15gRdTW17TQ/?wx_fmt=png&wxfrom=5&wx_lazy=1)\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">我想，没人喜欢的刘峰，他的孤独是蚀骨的。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">大家爱你只是出于对某种身份的认同，只是自己的利益得到了维护，那并不是发自内心的喜欢。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">他们爱那个没有缺点，没有死角，甚至有点虚假的你，却不喜欢偶尔有点小确丧，有七情六欲，甚至稍显放肆的你。</span>\n\n**<span style=\"font-size: 15px;color: rgb(123, 12, 0);\">在那个年代，好人不配有青春。</span>**\n\n![](http://mmbiz.qpic.cn/mmbiz_png/cyFh1D1vibvibPvoTRlNq0CRIaGHMAjzCwvUGGyVafU7Fibr0dwicbf7RqxsZoKHWY62ibFlufl2YCSM6uMLKfVYr2A/?wx_fmt=png&wxfrom=5&wx_lazy=1)\n\n**Part**\n\n**2**\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">好人没好报，祸害1000年。虽然不想承认这个观点，但身边却总被这样的新闻环绕：</span>\n\n*   **<span style=\"font-size: 15px;color: rgb(123, 12, 0);\">3名学生扶摔倒老太，反被索要10万。</span>**\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">2017年12月3日，江西上饶某中学三位学生在放学路上看到一位老奶奶摔倒，他们赶紧上前扶起。老太太不但不感激，反而指责他们把她的拐杖踢倒，才导致自己会摔跤。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">相应的索赔从最开始的50元，到后来的100元，2000元，5000元，最后干脆说要10万元去住院。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">无奈之下，3名学生只好报警。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">事发地段的探头最终证实老太太是自己摔倒的，孩子们只是去上前扶她，才得以将事情解释清楚。</span>\n\n*   **<span style=\"font-size: 15px;color: rgb(123, 12, 0);\">622杭州保姆纵火案</span>**\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">嗜赌成性的保姆莫焕晶，欠下一屁股债后，为了向雇主借钱，打算在主人家纵火后再灭火以此来邀功借钱。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">这场火灾最终导致妈妈和三个可爱的孩子全部死亡，无一幸免。其中最大的孩子只有11岁，最小的只有5岁。一场大火一夜之间，让林先生家破人亡。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">林先生的太太会经常给保姆买书。之前保姆说老家要盖房子，林太太也拿了10万给她，后来才知道是还赌债而已。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">警方更是在莫焕晶的住处搜到一些金银细软和名贵手表，据林先生指证，都是自己家的。保姆（莫焕晶）也对这些偷盗行为供认不讳。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">我想，愿意这样对保姆的中国家庭实在不多。可惜，好人在承受哀莫大于心死，坏人至多一死了之。</span>\n\n*   **<span style=\"font-size: 15px;color: rgb(123, 12, 0);\">陈世峰杀人案</span>**\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">最近开庭审理的江歌被杀案，更是将“好人没好报”演绎到极致。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">江歌，善良地收留了处于感情纠葛期的刘鑫，却在发生争执时被迫独自面对闺蜜暴戾的前男友；</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">刘鑫，江歌最好的朋友，却在事发时将江歌和歹徒独自留在室外，事后也并不体恤死者妈妈，如今在法庭上更是说着可能是谎话的证词；</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">陈世峰，那个穷凶极恶的凶手，死在他十二刀下的江歌尸骨未寒，他就已经迫不及待般去极力脱罪。</span>\n\n**<span style=\"font-size: 15px;color: rgb(123, 12, 0);\">好人最惨的死法，大概就是死在去做好人的途中</span>****<span style=\"font-size: 15px;color: rgb(123, 12, 0);\">。</span>**\n\n**Part**\n\n**3**\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">是啊，好人难做，太难做了，可我们就因此不再做好人了吗？</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">哈维尔曾说：</span>\n\n> <span style=\"font-size: 15px;color: rgb(136, 136, 136);\">我们坚持一件事情，并不是因为这样做了会有效果，而是坚信，这样做是对的。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">我们选择做一个好人，我们选择做善良的事，不是为了回报，只是因为这是对的。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">美国有一个儿童心理学家，专门主持儿童电台，并回答孩子们提出来的问题。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">有一天，一个叫Alice的六岁小女孩打来电话问了一个问题。</span><span style=\"color: rgb(70, 70, 70);font-size: 15px;\">她问：</span>\n\n> <span style=\"font-size: 15px;color: rgb(136, 136, 136);\">我是个好孩子，我弟弟是个坏孩子。爸爸妈妈要求我们每晚9点上床睡觉，每一次我都很听话，按时上床。可弟弟却不听话，每次要一个苹果才肯上床，而他居然每次都能得逞。</span>\n> \n> <span style=\"font-size: 15px;color: rgb(136, 136, 136);\">我也想要一个苹果，但父母从来不给我。为什么弟弟是个坏孩子，他总能得到苹果，而我是个好孩子，却总得不到苹果？</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">这个著名的儿童心理学家被这个问题问住了，他诚实地告诉Alice，很抱歉，我现在不知道。如果有一天我知道答案了，一定第一时间告诉你。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">一晃三年就过去了，那天，他去参加一场婚礼。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">婚礼上，紧张的新郎将本该戴在右手的戒指戴在了新娘左手。神父为他解围说：</span>\n\n> <span style=\"color: rgb(136, 136, 136);font-size: 15px;\">孩子，她的左手已经完美无瑕了，你戴在她的右手吧</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">心理学家这才恍然大悟。他迅速离开婚礼，回到电台，叫停了所有正在播出的节目，开始呼喊Alice的名字。</span><span style=\"color: rgb(70, 70, 70);font-size: 15px;\">他说：</span>\n\n> <span style=\"font-size: 15px;color: rgb(136, 136, 136);\">Alice你在吗？你在收音机前吗？你还记得3年前的问题吗？我很抱歉，你现在9岁了，我才有了答案。我希望你能认真听，希望你不要再为坏孩子得到苹果而耿耿于怀。</span>\n> \n> <span style=\"font-size: 15px;color: rgb(136, 136, 136);\">坏孩子虽然得到了苹果，但其实你得到了上帝最好的礼物，就是你是个好孩子。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">这就是著名的**<span style=\"font-size: 15px;color: rgb(123, 12, 0);\">“上帝不奖励好孩子”。</span>**</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">上帝给我们最好的礼物，就是我们都是好人。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">成为一个好人，心中自有美好世界，这就是做好人的最大福报。</span><span style=\"color: rgb(70, 70, 70);font-size: 15px;\">孟子云：</span>\n\n> <span style=\"font-size: 15px;color: rgb(136, 136, 136);\">仰不愧于天，俯不怍于人。这就是人这一生最大的底气和福气。</span>\n\n![](http://mmbiz.qpic.cn/mmbiz_png/cyFh1D1vibvibPvoTRlNq0CRIaGHMAjzCwbDzO6x5R5FucibfY7icSNkcD4JAefZ3hdTicEibNHndXXuJPk7E6ojs9ibw/?wx_fmt=png&wxfrom=5&wx_lazy=1)\n\n**Part**\n\n**4**\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">人为善，福虽不至，祸已远离。人为恶，祸虽不至，福已远离。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">我们做好人不是为了要回报，只是为了成为更自由的人，而不是身受枷锁。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">上大学时，我参加了志愿者队。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">有一次，我们去汉中的一个贫困县做为期一周的志愿活动。活动内容主要是把在学校筹得的物资送过去。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">在那里短暂的一周，我们是住在当地村民的家。我们住的那家只有一个小男孩和他的爷爷。</span>\n\n> <span style=\"font-size: 15px;color: rgb(136, 136, 136);\">我们问爷爷：孩子的爸爸妈妈呢？</span>\n> \n> <span style=\"font-size: 15px;color: rgb(136, 136, 136);\">爷爷含糊地说：都去外面打工了</span><span style=\"font-size: 15px;color: rgb(70, 70, 70);\">。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">后来听别的村民说，他家的儿子在监狱服刑，出事后媳妇就出去打工了，只是定期寄些钱和衣服回来，一年也回来不了几次。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">等我再回头看小男孩，发觉他的衣服脏脏的，脸也像个小花狗，瘦削的小身板坐在门槛上，唯唯诺诺地不敢上前和我们打招呼。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">那天，我们把他们家的脏衣服一并洗了，也打扫了室内室外的卫生。小男孩也开心地跑来跑去帮我们。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">临走时，我把身上能留下的都留给了他。我在给他的笔记本上，认真写下我的电话号码，说，遇到困难了可以找姐姐。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">虽然他们整个村都没有几部电话，但我说，你在学校好好表现的话，老师会让你给我打电话的。他很认真地点了点头。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">回去后，我偶尔会把自己攒下的生活费寄给他们，最多的时候也就四五百，少的时候只有一两百。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">有朋友提醒我：</span>\n\n> <span style=\"font-size: 15px;color: rgb(136, 136, 136);\">这是个无底洞，况且他们会慢慢习惯你的好的。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">不久后，我就收到了一张明信片。上面写着一行歪歪扭扭的字，说：</span>\n\n> <span style=\"font-size: 15px;color: rgb(136, 136, 136);\">姐姐，我和爷爷很想你，有时间记得来看我们。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">室友说：都是老师逼着让写的，他们没一个自愿的。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">我笑了笑没当回事，**<span style=\"font-size: 15px;color: rgb(123, 12, 0);\">不料，一周后，我接到了他的电话。</span>**</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">他用不流利的普通话扯着嗓子对着话筒吼：</span>\n\n> <span style=\"font-size: 15px;color: rgb(136, 136, 136);\">姐姐~我们老师允许我打电话了~我爷爷说要等过段时间给你寄新鲜大米呢。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">我在电话这头，竟哽咽到说不出话。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">那时起，我就坚定：</span>\n\n> <span style=\"font-size: 15px;color: rgb(136, 136, 136);\">不管这个世界让人绝望到什么程度，都要坚持做善良的事。</span>\n\n**Part**\n\n**5**\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">佛语有言：</span>\n\n> <span style=\"font-size: 15px;color: rgb(136, 136, 136);\">“ 诸恶莫作，众善奉行 ”。</span>\n\n**<span style=\"font-size: 15px;color: rgb(123, 12, 0);\">只有众善够重，诸恶才能被诛。</span>**\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">如果这个世界还不够好，不是说做好人没好报，只能说我们的善良还太少太单薄。</span><span style=\"color: rgb(70, 70, 70);font-size: 15px;\">列夫·托尔斯泰曾说：</span>\n\n> <span style=\"font-size: 15px;color: rgb(136, 136, 136);\">如果“善”有原因，它不再是善；如果“善”有它的结果，那也不能称为“善”，“善”是超乎因果联系的东西。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">如果你还问，为什么要做好人？</span>\n\n**<span style=\"font-size: 15px;color: rgb(123, 12, 0);\">那是因为，善良是本能：</span>**<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">老吾老以及人之老，幼吾幼以及人之幼；</span>\n\n**<span style=\"font-size: 15px;color: rgb(123, 12, 0);\">那是因为，善良是武器：</span>**<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">它是唯一能对抗邪恶的武器。</span>\n\n**<span style=\"font-size: 15px;color: rgb(123, 12, 0);\">更因为，善良是人性：</span>**<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">聪明也许是天赋，但善良是“人之初”那与生俱来的人性。</span>\n\n<span style=\"font-size: 15px;color: rgb(70, 70, 70);\">当你被早晨第一缕阳光温柔唤醒，就注定这将是，也必将是，纯善的一生。</span>\n\n轉自：公眾號麥子熟了"
		},
		{
			"post_id": 13,
			"title": "灵感 何以穿越时空而来\n",
			"date_published": 1513857323.864,
			"body": "<span style=\"color: rgb(77, 77, 77); font-family: &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; font-size: 14px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; background-color: rgb(247, 247, 247); text-decoration-style: initial; text-decoration-color: initial; display: inline !important; float: none;\">世界上最复杂难解的课题恐怕非思维莫属。其中，对于神秘莫测的灵感现象，从古至今更是众说纷纭……</span>\n\n灵感（inspirations）这个词最早在古希腊出现时是个宗教用语，意为神祇灵气的吸入。以古希腊思想家苏格拉底、亚里斯多德为代表的古典主义认为：灵感是神的意旨。后来，人们把文艺家创作时的灵感归于神赐。后来的学者试图揭示灵感降临的规律，找到通往成功之门的快捷方式，但至今仍无一个无可辩驳的圆满答案。\n\n* * *\n\n<div class=\"widget ad-300x250 ad-ecf\" style=\"box-sizing: border-box; margin: 0.4em 1.2em 0px 0px !important; background: rgb(211, 211, 211); width: 300px; height: 250px; padding: 0px; float: left; color: rgb(51, 51, 51); font-family: &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; font-size: 18px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; text-decoration-style: initial; text-decoration-color: initial;\"><ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-1519518652909441\" data-ad-slot=\"9768754376\" data-adsbygoogle-status=\"done\" style=\"box-sizing: border-box; display: inline-block; width: 300px; height: 250px;\"><ins id=\"aswift_1_expand\" style=\"box-sizing: border-box; display: inline-table; border: none; height: 250px; margin: 0px; padding: 0px; position: relative; visibility: visible; width: 300px; background-color: transparent;\"><ins id=\"aswift_1_anchor\" style=\"box-sizing: border-box; display: block; border: none; height: 250px; margin: 0px; padding: 0px; position: relative; visibility: visible; width: 300px; background-color: transparent;\"><iframe marginwidth=\"0\" marginheight=\"0\" vspace=\"0\" hspace=\"0\" allowtransparency=\"true\" scrolling=\"no\" allowfullscreen=\"true\" id=\"aswift_1\" name=\"aswift_1\" style=\"box-sizing: border-box; left: 0px; position: absolute; top: 0px; width: 300px; height: 250px;\" data-cke-pa-onload=\"var i=this.id,s=window.google_iframe_oncopy,H=s&amp;&amp;s.handlers,h=H&amp;&amp;H[i],w=this.contentWindow,d;try{d=w.document}catch(e){}if(h&amp;&amp;d&amp;&amp;(!d.body||!d.body.firstChild)){if(h.call){setTimeout(h,0)}else if(h.match){try{h=s.upd(h,i)}catch(e){}w.location.replace(h)}}\" width=\"300\" height=\"250\" frameborder=\"0\"></iframe></ins></ins></ins>\n</div>\n\n<div class=\"widget ad-300x250 ad-ecf\" style=\"box-sizing: border-box; margin: 0.4em 1.2em 0px 0px !important; background: rgb(211, 211, 211); width: 300px; height: 250px; padding: 0px; float: left; color: rgb(51, 51, 51); font-family: &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; font-size: 18px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; text-decoration-style: initial; text-decoration-color: initial;\">米开朗基罗在创作罗马教堂壁画中，想以壮观的场面表现上帝的形象，但苦思冥想却没有满意的构思。一天暴风雨过后，他去野外散步，看到天上白云翻滚，其中状如勇士的两朵白云飘向东升的太阳，他顿时彻悟，突发灵感，立刻回去绘出了气势浩大的天顶画杰作《创世纪》。\n</div>\n\n![__.jpg (1000x661)](data/img/post_13___.jpg)\n\n理查．施特劳斯认为：“莫札特所写的作品几乎全部来自灵感。”音乐天才莫札特手中仿佛握有天使之笔，笔随着灵感在飞动。他活到36岁为止所创作的作品，即使请当时最好的抄写员来抄，也难以在同样的时间里把这些作品抄完，更何况在莫札特的草稿中找不到在其他作曲家草稿本中常见的修改习惯……\n\n![_____-1888-600x399.jpg (600x399)](data/img/post_13______-1888-600x399.jpg)\n\n在莫札特的手稿中几乎找不到修改的片断，所有作品一气呵成。(Pixabay)\n\n巴尔扎克、歌德、舒伯特、托尔斯泰等文学艺术家们，都留下了灵感神奇出现的例证。\n\n中国古代文学家也有很多灵感的验证，苏东坡诗云：“作诗火急追亡逋，情景一失后难摹。”就是描写灵感来去倏然，稍纵即逝的特点。\n\n许多身历灵感的人都有同样的感受：灵感是在大脑放松即休息时，无意中跳跃而出，可以说它不来源于大脑的主动意识；灵感是全新的东西，超出了知识和经验积累的范围。\n\n## **神奇的灵感之梦**\n\n那么灵感来自哪里呢？西方学者提出了“潜意识”之说，认为在肉体的表层意识之下，还有一个潜在的琢磨不透的意识。那么潜意识又从哪里来？这就不能不说到另一种更匪夷所思的现象——灵感之梦。\n\n众所周知，俄国“化学之父”门捷列夫发现了元素周期表。后来的苏联时期教科书上说，周期表是门捷列夫经过20年的努力钻研发现的。被掩去的事实是：门捷列夫为了将已经发现的63种元素整理成周期表，常常废寝忘食，好几天都在办公室走来走去，百思不得其解。有一天，他坐在椅子上睡着了，突然他被惊醒，因为他梦见了一张清晰的元素周期表，他急忙把梦里的那张表画了下来，后来发现这个周期表只有一处需要修正。\n\n![_____509-600x299.png (600x299)](data/img/post_13______509-600x299.png)\n\n门捷列夫1871年的元素周期表（维基百科）\n\n中国文化中有关梦的灵感记述更多，只是中国人称之为“点化”。清代指画创始人高其佩就有这样的奇遇。高其佩从8岁开始学画，二十多岁时已经画得很好，但一直恨自己不能自成一家。有一天，他在小睡时梦见一位老人把他领进一间土屋，四壁挂满了名画。高其佩想临摹，但室内没有纸墨。情急中，见老人手指一盆清水笑而不答。高领会于心，于是用手蘸水对画临摹。梦醒以后，他就用手指蘸墨在纸上试着摹仿，十分得心应手。从此改笔为指，以指画名世。高其佩曾刻了一块印章：“画从梦授，梦自心成。”这件事后来被侄孙高秉记在《指头画说》中。\n\n当代中国冰雪画家曹醉梦也有一次刻骨铭心的灵感之梦。那是1996年春天，曹醉梦想创作一幅有古韵诗意的画，查遍古诗旧韵，难以如愿。一天早上，他躺在床上似睡非睡，朦胧之中，不知从何处飘来一个声音：“清风拂过扇入池，惊走飞鸟人不知。”曹醉梦惊觉地睁开眼环顾四周，静静的没有一个人。冥冥中他有一种说不出的感悟，创作的冲动难以自抑，立即起身，挥笔就此诗完成一幅画。这幅画在后来的全国性展览中获奖，被中国书画家研究会收藏。他后来也凭记忆重画了一幅，形相似，但神已非。这也是灵感的一个特点：不可复现性。\n\n灵感不是专家或者名人的专利，人人都可能会有。我的父亲是个没念过几天书的农民，1975年，他到建筑队做小工，很希望大工匠能教自己怎样砌砖抹灰，但是没人告诉他，很是苦恼。一天夜里，他梦见一个须发皆白的老人，手拿拂尘对着他挥动几下就消失了。他一下醒来，在想着这个奇梦的时候，忽然像开了窍似的，领悟了瓦工的一些要领。此后不久，他就成为所在建筑队最能干的瓦匠，许多没干过的难活，他都能得心应手。但是我的父亲只是跟家里人谈起这件事，从不对外人说。他因此相信神灵的存在。\n\n这样的事在中国民间不少听闻，但登不上大雅之堂。其实在过去的几千年中，中国人对天地、神鬼、佛道的认知自然而然。认为万物有灵，可以相通，而这种沟通往往是借助于梦境。这种观念是中国传统文化的一个特点。为人熟知的成语“妙笔生花”与“江郎才尽”，就是来自跟梦有关的历史人物故事。《开元天宝遗事》中记载了一段诗仙李白的逸闻，说李白小的时候梦见自己用的笔头上面生出了花，后来果然妙笔生花，名闻天下。与之相反的是江郎才尽的故事。在《南史•江淹传》记载：南北朝时期南朝著名的文学家江淹罢官住在冶亭时，梦见一人，自称郭璞（西晋时著名的文学家，《晋书》称他“词赋为中兴之冠”），对江淹说：“我的笔在你那里多年，现在可以还给我了吧！”江淹随即向怀中一摸，竟真的有一枝五彩笔，也只好归还郭璞。五彩笔归还，江淹自然就无才可用了，从此再也没有写出好文章。\n\n![_____1889-600x400.jpg (600x400)](data/img/post_13______1889-600x400.jpg)\n\n南北朝时期著名文学家江淹，在梦境中交出自己的五彩笔后，再也没有写出好文章。(Pixabay，图片与内容无关)\n\n诸如此类的记述在中国史书中屡见不鲜。汉语中把“灵感”解释为灵应、灵验——人对神灵的感应和体验——实在是很恰和中国文化。由于众所周知的原因，这部分中国传统文化不被见容于当代中国大陆的主流意识。\n\n## **灵感与另外空间**\n\n梦的灵感更加印证了灵感是在人大脑处于前念已熄，后念未起之际的混沌、空白阶段（即没有了自我意识时）突然降临，因为它反映在大脑中，有人就说是“潜意识”，其实这种潜意识，我们完全可以把它视为另外空间人或物的真实反映。\n\n美国总统林肯在遇害三天前的夜里，清楚梦到自己死后众人哀悼的场景，他及家人因此产生了不祥的预感。林肯遇刺这个美国尽人皆知的史事，打破了夜有所梦来自日有所思的定论。但现代有些学者对上述这些奇异的梦大多避而不谈，甚者干脆以迷信为由而拒绝接受。这样在一孔之中去研究灵感，不可能准确把握灵感的脉络。\n\n另外空间什么样，目前科学还无法探知；天堂、地狱等这样的认识来源于宗教和信仰者的体验，科学无法验证其有或者无。但是科学技术的发展，能给我们一个很好的启示。有实验表明：一个小白鼠的细胞可在电脑上显示出小白鼠的形象资讯。细胞是由分子构成的，而分子又是由原子、质子、电子等等微粒构成，追查下去，每一层粒子都是由更小的粒子构成。一层粒子就构成一层空间，那么不同空间中，会不会都有小白鼠？现在科学已经逐渐认识到，诸如人、花、鸟等的一个细胞微粒中就具备各自的生命特质，包括精神方面的脾气、秉性等特质。在人眼中，一粒细胞不是什么生命，但在另一空间，它却是完整的生命资讯。同样，空气、石头、钢铁等看似无思想感情的非生命物质，可能就像细胞微粒一样，很可能在某一空间中也存在着灵性甚至形象资讯。物质越往微观去同一层粒子的范围就越大。粒子是运动的，体现着生命的律动，那么粒子之间的资讯是不是就可以相通？\n\n## **灵感垂青于谁？**\n\n灵感穿越时空而来，助人发明、创造、创新。尽管它来去倏忽难以追寻，但还是有迹可循。所有有成就和造诣的杰出人物，都是灵感经常光顾的对象，他们表现得勤奋、好思，孜孜不倦，好像就是为了印证中国的古话“天道酬勤”。但人们常常忽略了一点——被灵感垂青的人往往淡泊物欲、不逐名利。\n\n如果我们把灵感所在的时空称之为天，那么人与灵感之间的关系就可视为天人感应，人何以感应天呢？像古语常说：诚心感动天地。也就是汉朝王充所说的：“精诚所至，金石为开。”（《论衡．感虚篇》）\n\n那么精、诚是什么？在中国古代注释中，凡物纯到极点都可称之为“精”；善、好、纯正无伪，就叫做“诚”。也就是说，人心达到纯正纯善纯美的境界，念力能够破开像金属和石头一样坚固的东西。\n\n要达到这种纯净，没有一丝私心杂念，就需要摒弃人中的名利欲情的执著。中国古人对此认识很深，所以整个社会都重视修炼身心，参禅悟道。道家宣导修真养性、返本归真，如《庄子．渔父》：“真者，精诚之至也。”可见道家的“真”就是达到了纯正纯善纯美的境界。古人用斋戒等方式清心寡欲，打坐静修。在人念不起的寂静状态，所谓潜意识开始活跃——“寂然不动，感而遂通”——灵感进入大脑，把存在于另外空间的事物本质和规律传达给人，人就能对事物进行感知，对未来进行预测。佛经中称之为“妙有”。这就不难理解古人何以熟练把握人体经络的运行，不难理解诸葛亮、刘伯温等人的神机妙算，不难理解张衡如何知道宇宙是圆的而地球如蛋中黄……人在不断纯净自身的过程中，就会层层感知更高的越来越微观越细腻的物质，人得到的智慧就越来越多。最后达到“真”境，道家认为这样人就可以不受自然物质的束缚，可以“无为而无不为”。\n\n![__-481700-640-600x450.jpg (600x450)](data/img/post_13___-481700-640-600x450.jpg)\n\n打坐冥想(Pixabay)\n\n回过头去看看那些与灵感不期而遇的幸运儿，他们无一例外地具有真性。无论他们在哪一领域，他们对自己所做之事都敬爱勤勉，而不是把事业当作获取名利的敲门砖。当他们对事业的虔诚和专注越来越精，心无旁鹜，不被名利情欲所左右时，纯正无邪的思想就会穿破物质的阻隔，思接千载，神与物游，用中国民间俗话说就是“心到神知”。但此时，思考占据大脑，灵感还无法切入。一旦不想了，大脑似乎空白，灵感就会倏然间点燃思维。尤其是在无我的睡眠状态中，近似于“空”，灵感就会直接在睡梦中以各种形式出现。\n\n人在灵感来时，常常陷于丧失常态的痴迷，这是因为高级的灵感需要人忘情无我，从而借机占据人的大脑，指挥着人活动。如大科学家牛顿请人吃饭，结果他陷于灵感之中达数小时。客人实在等不及就吃完饭走了。牛顿从灵感中解脱后，走近餐桌看见客人吃剩的残汤剩饭，竟以为这是自己刚才吃过剩下的。\n\n灵感惠顾精诚之人，助其成事，这就是天道。顺天则兴，逆天则衰。江淹晚年时，依附权贵，安享尊荣，远离了真性，灵感就离他而去。如果李白“摧眉折腰事权贵”，陶渊明“为五斗米折腰”，爱恩斯坦清楚自己每个月挣多少钱……那么，今天有谁会知道他们呢？江郎才尽式的人物数不胜数，因为人在名利物欲的薰染中容易丧失纯真。而能保持真本性的，无一不是心中有道之人。爱因斯坦、牛顿、托尔斯泰等心怀上帝的圣言，中国几千年中书写灿烂文明的英才们，不是礼佛就是守道。是他们的真心引来了灵感，而灵感又引领着他们走向杰出。现代有些明士，也认识到人心修善的关键，通过气功等正道法门修炼身心，打开虚静的门，恭请灵感的驾临。\n\n追究灵感的缘起，似乎又绕回了古老的从前。今人当作过时丢掉了的学说和文化，却蕴含智慧的真机。\n\n灵感之神在不远处逡巡，找寻适合她的栖息地，随时准备穿越时空而来。"
		},
		{
			"post_id": 11,
			"title": "格非：盲目“信书”比不读书更糟糕",
			"date_published": 1513599110,
			"body": "# 为什么要读书？你要是找一百个学者来回答这个问题，一百个学者里面可能有九十个回答是一样的：为了获取知识、获得技能、了解世界，我的理解可能有一些不同。\n\n* * *\n\n生活里面有很多人其实不读书，比如说我母亲，她不识字，因此没法读书，可是我母亲是我非常崇拜的一个人。她不读书，但并不意味着她对社会，对世界没有判断。她有很多很重要的判断，也对我产生了很重要的影响。在我看来她特别有智慧，也有非常广阔的生活阅历，无论哪个方面都可以做我的老师。\n\n<div class=\"entry-content\" style=\"margin: 0px 0px 12px; padding: 0px; border: 0px; font-size: 17px; vertical-align: baseline; line-height: 28px; color: rgb(0, 0, 0); font-family: Palatino, Times, arial, &quot;Hiragino Sans GB&quot;, &quot;Microsoft Yahei&quot;, &quot;Microsoft Yahei UI&quot;, sans-serif; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; background-color: rgb(255, 255, 255); text-decoration-style: initial; text-decoration-color: initial;\">所以我觉得很多人不读书也没有很大的问题，但是为什么我们要读书呢，我觉得最重要的一点是，它能帮助我们摆脱知识的“奴役”。假如你从不读书，那么你只好听信别人叫你吃什么、叫你做什么，告诉你什么是有科学依据的，什么是正确的，你就会被被动地包裹在大量的信息里面，就没办法有自己的理解。假如对某件事，你的答案刚好和别人的答案不一样，那你就要读书，你要到书里面寻找那些赞同你意见的人，寻找共鸣。所以我觉得阅读一个非常重要的功能就是建立认同关系，然后让我们在非常深的彼此理解中，更好地发展自己。\n\n## 阅读的“前理解”至关重要\n\n很多好的阅读习惯需要你自己建立起来。成为一个优秀的读者，需要一些重要的前提条件，其中一个最重要的前提条件之一，就是你手边得有一本字典。首先你得认得字，你得自己学会去查文献。你不能人家怎么说怎么信，这就比不阅读还要糟糕。孟子说“尽信书不如无书”，盲目“信书”的人还不如那些没读过书的人。你要是全部相信书里面的内容，你还不如不读书，不读书起码可以保持你的天性，因为你在生活中，生活教会你很多的经验。今天，我们想把阅读推向纵深，推向更好的境界，阅读的方法的培养非常重要。\n\n今天我讲一个最最简单的问题，就是阅读和历史情境。举个非常简单的例子，杜甫的诗《江南逢李龟年》，四句话：“岐王宅里寻常见，崔九堂前几度闻。正是江南好风景，落花时节又逢君。”这四句话小孩子都懂，意思很简单。然而就算你把这首诗读上一百遍，可能你还是理解不了这首诗的中心思想。想要理解它你必须要知道这个诗具体的历史背景，也就是你得有“前理解”，你得查阅相关文献。\n\n## 负责任的学者应有广阔的文化视野\n\n现在很多人不注重对“原典”的阅读。很多大学生现在写论文都不是去查一手的资料。我记得有次一个学生做论文答辩，他的题目是关于先锋文学的，他在答辩中举了很多的例子，然而我一听那些例子完全没有根据，他的材料不知道哪儿来的。事后我问他，材料是哪儿来的，他说我都是从网上看来的呀！现在好多青年学生都这样，他不去读一手材料，他去读二手的材料、三手的材料，错误百出，随意轻信。\n\n历史是一位任人打扮的新娘，谁都可以打扮她。比如很多学生喜欢胡兰成、张爱玲，其实这没什么关系，但这造成的情况就是，有一年我在上海，有一半以上的学生选做论文研究方向都是张爱玲，这个跟整个社会对文学史的描述是有关系的，我们很轻易地就相信了这些描述。张爱玲当然是很优秀的作家，但是是不是整个文学史就只剩下张爱玲、沈从文了呢？当然不是！你如果是一个负责任的学者，你应该有更宽阔的历史文化视野。\n\n所以我说，不管是文学研究还是大众阅读，中间充斥着很多的谬误，有些人毫不负责，传一些小道八卦的消息，做一些非常不负责任的写作，然后你把这些小道消息当作历史真实来了解，这不是缘木求鱼吗？\n\n读书时候不能盲目把自己交给作者，而是要确定自己的主体地位。必须有自己的判断，读书帮助确立自我，而不是为了迷失。现在很多阅读是让我们迷失了自己。好的方法培养太重要了。\n\n## 青年知识分子肚子里要有“干货”\n\n我们那个年代，很多书你想读读不到，比如我当时想读陈寅恪先生的《柳如是别传》我根本就读不到，你去哀求别人借给你，人家都不借，出版和资讯都没有今天这么发达。但其实这也有好处，因为这样所以我们过去当时只能读一些很平常的书，比如《史记》、《论语》这些原典，所以我们这代人就很容易在一些方面研究得比较专门、比较深入。今天读书“博”的方面，反而会成为一个问题，所以我给清华大学的学生提出来，你读多少书我们管不着，但是你读的书里必须要有原典，肚子里得有些“干货”，否则你的“自我”会被别人带走。\n\n其实这不是一个很高的要求，我希望年轻人在某些领域有自己的判断，去“较真”。你只要下功夫读那么几本书，你就会成为某方面的专家；你认真读十本西方经典书籍，你一开口就不一样。现在很多人读到研究生，都不去读原典，这是当今非常大的一个问题，也是我很担心的问题。\n\n————\n\n以上文字根据中国作家协会会员、清华大学中文系教授、茅盾文学奖获得者格非在 2016 江苏书展上发表主题为“阅读与历史情境”的演讲整理。\n\n作者：格非\n整理：庞雪汀\n来源：新浪读书\n\n</div>"
		},
		{
			"post_id": 10,
			"title": "那些你不知道的爬虫反爬虫套路\n                                                       ——不明觉厉的爬虫与反爬虫 ",
			"date_published": 1497582043.917,
			"body": "**前言**\n\n[爬虫](http://www.wangqianfang.com/tag/%e7%88%ac%e8%99%ab)与反[爬虫](http://www.wangqianfang.com/tag/%e7%88%ac%e8%99%ab)，是一个很不阳光的行业。\n\n这里说的不阳光，有两个含义。\n\n第一是，这个行业是隐藏在地下的，一般很少被曝光出来。很多公司对外都不会宣称自己有[爬虫](http://www.wangqianfang.com/tag/%e7%88%ac%e8%99%ab)团队，甚至隐瞒自己有反[爬虫](http://www.wangqianfang.com/tag/%e7%88%ac%e8%99%ab)团队的事实。这可能是出于公司战略角度来看的，与技术无关。\n\n* * *\n\n第二是，这个行业并不是一个很积极向上的行业。很多人在这个行业摸爬滚打了多年，积攒了大量的经验，但是悲哀的发现，这些经验很难兑换成闪光的简历。面试的时候，因为双方[爬虫](http://www.wangqianfang.com/tag/%e7%88%ac%e8%99%ab)理念或者反[爬虫](http://www.wangqianfang.com/tag/%e7%88%ac%e8%99%ab)理念不同，也很可能互不认可，影响自己的求职之路。本来程序员就有“文人相轻”的倾向，何况理念真的大不同。\n\n然而这就是程序员的宿命。不管这个行业有多么的不阳光，依然无法阻挡大量的人进入这个行业，因为有公司的需求。\n\n那么，公司到底有什么样的需求，导致了我们真的需要爬虫/反爬虫呢？\n\n反爬虫很好理解，有了爬虫我们自然要反爬虫。对于程序员来说，哪怕仅仅是出于“我就是要证明我技术比你好”的目的，也会去做。对于公司来说，意义更加重大，最少，也能降低服务器负载，光凭这一点，反爬虫就有充足的生存价值。\n\n那么爬虫呢？\n\n最早的爬虫起源于搜索引擎。搜索引擎是善意的爬虫，可以检索你的一切信息，并提供给其他用户访问。为此他们还专门定义了robots.txt文件，作为君子协定，这是一个双赢的局面。\n\n然而事情很快被一些人破坏了。爬虫很快就变的不再“君子”了。\n\n后来有了“大数据”。无数的媒体鼓吹大数据是未来的趋势，吸引了一批又一批的炮灰去创办大数据公司。这些人手头根本没有大数据，他们的数据只要用一个U盘就可以装的下，怎么好意思叫大数据呢？这么点数据根本忽悠不了投资者。于是他们开始写爬虫，拼命地爬取各个公司的数据。很快他们的数据，就无法用一个U盘装下了。这个时候终于可以休息休息，然后出去吹嘘融资啦。\n\n然而可悲的是，大容量U盘不断地在发布。他们总是在拼命地追赶存储增加的速度。L\n\n以上是爬虫与反爬虫的历史。\n\n电子商务行业的爬虫与反爬虫更有趣一些，最初的爬虫需求来源于比价。\n\n这是某些电商网站的核心业务。大家如果买商品的时候，是一个价格敏感型用户的话，很可能用过网上的比价功能(真心很好用啊)。毫无悬念，他们会使用爬虫技术来爬取所有相关电商的价格。他们的爬虫还是比较温柔的，对大家的服务器不会造成太大的压力。\n\n然而，这并不意味着大家喜欢被他爬取。毕竟这对其他电商是不利的。于是需要通过技术手段来做反爬虫。\n\n按照技术人员的想法，对方用技术怼过来，我们就要用技术怼回去，不能怂啊。这个想法是很好的，但是实际应用起来根本不是这么回事。\n\n诚然，技术是很重要的，但是实际操作上，更重要的是套路。谁的套路更深，谁就能玩弄对方于鼓掌之中。谁的套路不行，有再好的技术，也只能被耍的团团转。这个虽然有点伤技术人员的自尊，然而，我们也不是第一天被伤自尊了。大家应该早就习惯了吧。\n\n**一、真实世界的爬虫比例**\n\n大家应该听过一句话吧，大概意思是说，整个[互联网](http://www.wangqianfang.com/tag/%e4%ba%92%e8%81%94%e7%bd%91)上大概有50%以上的流量其实是爬虫。第一次听这句话的时候，我还不是很相信，我觉得这个说法实在是太夸张了。怎么可能爬虫比人还多呢？ 爬虫毕竟只是个辅助而已。\n\n现在做了这么久的反爬虫，我依然觉得这句话太夸张了。50%？你在逗我？就这么少的量？\n\n举个例子，某公司，某个页面的接口，每分钟访问量是1.2万左右。这里面有多少是正常用户呢？\n\n50%？60%？还是？\n\n正确答案是：500以下。\n\n也就是说，一个单独的页面，12000的访问量里，有500是正常用户，其余是爬虫。\n\n注意，统计爬虫的时候，考虑到你不可能识别出所有的爬虫，因此，这500个用户里面，其实还隐藏着一些爬虫。那么爬虫率大概是：\n\n(12000-500)/12000=95.8%\n\n这个数字你猜到了吗？\n\n这么大的爬虫量，这么少的用户量，大家到底是在干什么？是什么原因导致了明明是百人级别的生意，却需要万级别的爬虫来做辅助？ 95%以上，19保1？\n\n答案可能会相当令人喷饭。这些爬虫大部分是由于决策失误导致的。\n\n**二、哭笑不得的决策思路**\n\n举个例子，这个世界存在3家公司，售卖相同的电商产品。三家公司的名字分别是A，B，C。\n\n这个时候，客户去A公司查询了下某商品的价格，看了下发现价格不好。于是他不打算买了。他对整个行业的订单贡献为0。\n\n然而A公司的后台会检测到，我们有个客户流失了，原因是他来查询了一个商品，这个商品我们的价格不好。没关系，我去爬爬别人试试。\n\n于是他分别爬取了B公司和C公司。\n\nB公司的后台检测到有人来查询价格，但是呢，最终没有下单。他会认为，嗯，我们流失了一个客户。怎么办呢？\n\n我可以爬爬看，别人什么价格。于是他爬取了A和C。\n\nC公司的后台检测到有人来查询价格……\n\n过了一段时间，三家公司的服务器分别报警，访问量过高。三家公司的CTO也很纳闷，没有生成任何订单啊，怎么访问量这么高？ 一定是其他两家禽兽写的爬虫没有限制好频率。妈的，老子要报仇。于是分别做反爬虫，不让对方抓自己的数据。然后进一步强化自己的爬虫团队抓别人的数据。一定要做到：宁叫我抓天下人，休叫天下人抓我。\n\n然后，做反爬虫的就要加班天天研究如何拦截爬虫。做爬虫的被拦截了，就要天天研究如何破解反爬虫策略。大家就这么把资源全都浪费在没用的地方了。直到大家合并了，才会心平气和的坐下来谈谈，都少抓点。\n\n最近国内的公司有大量的合并，我猜这种“心平气和”应该不少吧？\n\n下面我们谈谈，爬虫和反爬虫分别都是怎么做的。\n\n**1、为python平反**\n\n首先是爬虫。爬虫教程你到处都可以搜的到，大部分是python写的。我曾经在一篇文章提到过：用python写的爬虫是最薄弱的，因为天生并不适合破解反爬虫逻辑，因为反爬虫都是用javascript来处理。然而慢慢的，我发现这个理解有点问题（当然我如果说我当时是出于工作需要而有意黑python你们信吗……）。\n\nPython的确不适合写反爬虫逻辑，但是python是一门胶水语言，他适合捆绑任何一种框架。而反爬虫策略经常会变化的翻天覆地，需要对代码进行大刀阔斧的重构，甚至重写。这种情况下，python不失为一种合适的解决方案。\n\n举个例子，你之前是用selenium爬取对方的站点，后来你发现自己被封了，而且封锁方式十分隐蔽，完全搞不清到底是如何封的，你会怎么办？你会跟踪selenium的源码来找到出错的地方吗？\n\n你不会。你只会换个框架，用另一种方式来爬取。然后你就把两个框架都浅尝辄止地用了下，一个都没有深入研究过。因为没等你研究好，也许人家又换方式了。你不得不再找个框架来爬取。毕竟，老板等着明天早上开会要数据呢。老板一般都是早上八九点开会，所以你七点之前必须搞定。等你厌倦了，打算换个工作的时候，简历上又只能写“了解ｎ个框架的使用”，仅此而已。\n\n这就是爬虫工程师的宿命，爬虫工程师比外包还可怜。外包虽然不容易积累技术，但是好歹有正常上下班时间，爬虫工程师连这个权利都没有。\n\n然而反爬虫工程师就不可怜了吗？也不是的。反爬虫有个天生的死穴，就是：误伤率。\n\n**2、无法绕开的误伤率**\n\n我们首先谈谈，面对对方的爬虫，你的第一反应是什么？\n\n如果限定时间的话，大部分人给我的答案都是：封杀对方的IP。\n\n然而，问题就出在，IP不是每人一个的。大的公司有出口IP，ISP有的时候会劫持流量让你们走代理，有的人天生喜欢挂代理，有的人为了翻墙24小时挂vpn，最坑的是，现在是移动[互联网](http://www.wangqianfang.com/tag/%e4%ba%92%e8%81%94%e7%bd%91)时代，你如果封了一个IP？不好意思，这是中国联通的4G网络，5分钟之前还是别人，5分钟之后就换人了哦！\n\n因此，封IP的误伤指数最高。并且，效果又是最差的。因为现在即使是最菜的新手，也知道用代理池了。你们可以去淘宝看下，几十万的代理价值多少钱。我们就不谈到处都有的免费代理了。\n\n也有人说：我可以扫描对方端口，如果开放了代理端口，那就意味着是个代理，我就可以封杀了呀。\n\n事实是残酷的。我曾经封杀过一个IP，因为他开放了一个代理端口，而且是个很小众的代理端口。不出一天就有人来报事件，说我们一个分公司被拦截了。我一查IP，还真是我封的IP。我就很郁闷地问他们IT，开这个端口干什么？他说做邮件服务器啊。我说为啥要用这么奇怪的端口？他说，这不是怕别人猜出来么？我就随便取了个。\n\n扫描端口的进阶版，还有一种方式，就是去订单库查找这个IP是否下过订单，如果没有，那么就是安全的。如果有，那就不安全。有很多网站会使用这个方法。然而这其实只是一种自欺欺人的办法而已。只需要下一单，就可以永久洗白自己的IP，天下还有比这更便宜的生意吗？\n\n因此，封IP，以及封IP的进阶版：扫描端口再封IP，都是没用的。根本不要考虑从IP下手，因为对手会用大量的时间考虑如何躲避IP封锁，你干嘛和人家硬刚呢。这没有任何意义。\n\n那么，下一步你会考虑到什么？\n\n很多站点的工程师会考虑：既然没办法阻止对方，那我就让它变的不可读吧。我会用图片来渲染关键信息，比如价格。这样，人眼可见，机器识别不出来。\n\n这个想法曾经是正确的，然而，坑爹的技术发展，带给我们一个坑爹的技术，叫机器学习。顺便带动了一个行业的迅猛发展，叫OCR。很快，识别图像就不再是任何难题了。甚至连人眼都很难识别的验证码，有的OCR都能搞定，比我肉眼识别率都高。更何况，现在有了打码平台，用资本都可以搞定，都不需要技术。\n\n那么，下一步你会考虑什么？\n\n这个时候，后端工程师已经没有太多的办法可以搞了。\n\n不过后端搞不定的事情，一般都推给前端啊，前端从来都是后端搞不定问题时的背锅侠。　多少年来我们都是这么过来的。前端工程师这个时候就要勇敢地站出来了：\n\n“都不要得瑟了，来比比谁的前端知识牛逼，你牛逼我就让你爬。”\n\n我不知道这篇文章的读者里有多少前端工程师，我只是想顺便提一下：你们以后将会是更加抢手的人才。\n\n**3、前端工程师的逆袭**\n\n我们知道，一个数据要显示到前端，不仅仅是后端输出就完事了，前端要做大量的事情，　比如取到json之后，至少要用template转成html吧？ 这已经是步骤最少最简单的了。然后你总要用css渲染下吧？ 这也不是什么难事。\n\n等等，你还记得自己第一次做这个事情的时候的经历吗？真的，不是什么难事吗？\n\n有没有经历过，一个html标签拼错，或者没有闭合，导致页面错乱？一个css没弄好，导致整个页面都不知道飘到哪去了？\n\n这些事情，你是不是很想让别人再经历一次？\n\n这件事情充分说明了：让一个资深的前端工程师来把事情搞复杂一点，对方如果配备了资深前端工程师来破解，也需要耗费3倍以上的时间。毕竟是读别人的代码，别人写代码用了一分钟，你总是要读两分钟，然后骂一分钟吧？这已经算很少的了。如果对方没有配备前端工程师……那么经过一段时间，他们会成长为前端工程师。\n\n之后，由于前端工程师的待遇比爬虫工程师稍好一些，他们很快会离职做前端，既缓解了前端人才缺口，又可以让对方缺人，重招。而他们一般是招后端做爬虫，这些人需要再接受一次折磨，再次成长为前端工程师。这不是很好的事情吗。\n\n所以，如果你手下的爬虫工程师离职率很高，请仔细思考下，是不是自己的招聘方向有问题。\n\n那么前端最坑爹的技术是什么呢？前端最坑爹的，也是最强大的，就是我们的：javascript。\n\nJavascript有大量的花样可以玩，毫不夸张的说，一周换一个feature(bug)给对方学习，一年不带重样的。这个时候你就相当于一个面试官，对方要通过你的面试才行。\n\n举个例子，Array.prototype里，有没有map啊？什么时候有啊？你说你是xx浏览器，那你这个应该是有还是应该没有啊？你说这个可以有啊？可是这个真没有啊。那[]能不能在string里面获取字符啊？哪个浏览器可以哪个不行啊？咦你为什么支持webkit前缀啊？等等，刚刚你还支持怎么现在不支持了啊？你声明的不对啊。\n\n这些对于前端都是简单的知识，已经习以为常了。但是对于后端来说简直就是噩梦。\n\n然而，前端人员自己作死，研究出了一个东西，叫：nodejs。基于v8，秒杀所有的js运行。\n\n不过nodejs实现了大量的feature，都是浏览器不存在的。你随随便便访问一些东西（比如你为什么会支持process.exit），都会把node坑的好惨好惨。而且……浏览器里的js，你拉到后台用nodejs跑，你是不是想到了什么安全漏洞？这个是不是叫，代码与数据混合？如果他在js里跑点恶心的代码，浏览器不支持但是node支持怎么办？\n\n还好，爬虫工程师还有phantomjs。但是，你怎么没有定位啊？ 哈哈，你终于模拟出了定位，但是不对啊，根据我当前设置的安全策略你现在不应该能定位啊？你是怎么定出来的？连phantomjs的作者自己都维护不下去了，你真的愿意继续用吗？\n\n当然了，最终，所有的反爬虫策略都逃不脱被破解的命运。但是这需要时间，反爬虫需要做的就是频繁发布，拖垮对方。如果对方两天可以破解你的系统，你就一天一发布，那么你就是安全的。这个系统甚至可以改名叫做“每天一道反爬题，轻轻松松学前端”。\n\n**4、误伤，还是误伤**\n\n这又回到了我们开始提到的“误伤率”的问题了。我们知道，发布越频繁，出问题的概率越高。那么，如何在频繁发布的情况下，还能做到少出问题呢？\n\n此外还有一个问题，我们写了大量的“不可读代码”给对方，的确能给对方造成大量的压力，但是，这些代码我们自己也要维护啊。如果有一天忽然说，没人爬我们了，你们把代码下线掉吧。这个时候写代码的人已经不在了，你们怎么知道如何下线这些代码呢？\n\n这两个问题我暂时不能公布我们的做法，但是大家都是聪明人，应该都是有自己的方案的，软件行业之所以忙的不得了，无非就是在折腾两件事，一个是如何将代码拆分开，一个是如何将代码合并起来。\n\n关于误伤率，我只提一个小的tip：你可以只开启反爬虫，但是不拦截，先放着，发统计信息给自己，相当于模拟演练。等统计的差不多了，发现真的开启了也不会有什么问题，那就开启拦截或者开启造假。\n\n这里就引发了一个问题，往往一个公司的各个频道，爬取难度是不一样的。原因就是，误伤检测这种东西与业务相关，公司的基础部门很难做出通用的。只能各个部门自己做。甚至有的部门做了有的没做。因此引发了爬虫界一个奇葩的通用做法：如果PC页面爬不到，就去H5试试。如果H5很麻烦，就去PC碰碰运气。\n\n**三、爬虫反爬虫套路现状**\n\n那么一旦有发现对方数据造假怎么办？\n\n早期的时候，大家都是要抽查数据，通过数据来检测对方是否有造假。这个需要人工核对，成本非常高。可是那已经是洪荒时代的事情了。如果你们公司还在通过这种方式来检测，说明你们的技术还比较落伍。\n\n之前我们的竞争对手是这么干的：他们会抓取我们两次，一次是他们解密出来key之后，用正经方式来抓取，这次的结果定为A。一次是不带key，直接来抓，这次的结果定为B。根据前文描述，我们可以知道，B一定是错误的。那么如果A与B相等，说明自己中招了。这个时候会停掉爬虫，重新破解。\n\n1、不要回应\n\n所以之前有一篇关于爬虫的文章，说如何破解我们的。一直有人要我回复下。我一直觉得没什么可以回复的。\n\n第一，反爬虫被破解了是正常的。这个世界上有个万能的爬虫手段，叫“人肉爬虫”。假设我们就是有钱，在印度开个分公司，每天雇便宜的劳动力用鼠标直接来点，你能拿我怎么办？第二，我们真正关心的是后续的这些套路。而我读了那篇文章，发现只是调用了selenium并且拿到了结果，就认为自己成功了。\n\n我相信你读到这里，应该已经明白为什么我不愿意回复了。我们最重要的是工作，而不是谁打谁的脸。大家如果经常混技术社区就会发现，每天热衷于打别人脸的，一般技术都不是很好。\n\n当然这并不代表我们技术天下第一什么的。我们每天面对大量的爬虫，还是遇到过很多高手的。就如同武侠小说里一样，高手一般都比较低调，他们默默地拿走数据，很难被发现，而且频率极低，不会影响我们的考评。你们应该明白，这是智商与情商兼具的高手了。\n\n我们还碰到拉走我们js，砍掉无用的部分直接解出key，相当高效不拖泥带水的爬虫，一点废请求都没有（相比某些爬虫教程，总是教你多访问写没用的url免得被发现，真的不知道高到哪里去了。这样做除了会导致机器报警，导致对方加班封锁以外，对你自己没有任何好处）。\n\n而我们能发现这一点仅仅是是因为他低调地写了一篇博客，通篇只介绍技术，没有提任何没用的东西。\n\n这里我只是顺便发了点小牢骚，就是希望后续不要总是有人让我回应一些关于爬虫的文章。线下我认识很多爬虫工程师，水平真的很好，也真的很低调（不然你以为我是怎么知道如何对付爬虫的……），大家都是一起混的，不会产生“一定要互相打脸”的情绪。\n\n2、进化\n\n早期我们和竞争对手打的时候，双方的技术都比较初级。后来慢慢的，爬虫在升级，反爬虫也在升级。这个我们称为“进化”。我们曾经给对方放过水，来试图拖慢他们的进化速度。然而，效果不是特别理想。爬虫是否进化，取决于爬虫工程师自己的KPI，而不是反爬虫的进化速度。\n\n后期打到白热化的时候，用的技术越来越匪夷所思。举个例子，很多人会提，做反爬虫会用到canvas指纹，并认为是最高境界。其实这个东西对于反爬虫来说也只是个辅助，canvas指纹的含义是，因为不同硬件对canvas支持不同，因此你只要画一个很复杂的canvas，那么得出的image，总是存在像素级别的误差。考虑到爬虫代码都是统一的，就算起selenium，也是ghost的，因此指纹一般都是一致的，因此绕过几率非常低。\n\n但是！这个东西天生有两个缺陷。第一是，无法验证合法性。当然了，你可以用非对称加密来保证合法，但是这个并不靠谱。其次，canvas的冲突概率非常高，远远不是作者宣称的那样，冲突率极低。也许在国外冲突是比较低，因为国外的语言比较多。但是国内公司通常是IT统一装机，无论是软件还是硬件都惊人的一致。我们测试canvas指纹的时候，在携程内部随便找了20多台机器，得出的指纹都完全一样，一丁点差别都没有。因此，有些“高级技巧”其实一点都不实用。\n\n3、法律途径\n\n此外就是大家可能都考虑过的：爬虫违法吗？能起诉对方让对方不爬吗？法务给的答案到是很干脆，可以，前提是证据。遗憾的是，这个世界上大部分的爬虫爬取数据是不会公布到自己网站的，只是用于自己的数据分析。因此，即使有一些关于爬虫的官司做为先例，并且已经打完了，依然对我们没有任何帮助。反爬虫，在对方足够低调的情况下，注定还是个技术活。\n\n4、搞事情，立Flag\n\n到了后来，我们已经不再局限于打打技术了。反爬虫的代码里我们经常埋点小彩蛋给对方，比如写点注释给对方。双方通过互相交战，频繁发布，居然聊的挺high的。\n\n比如问问对方，北京房价是不是很高啊？对方回应，欧巴，我可是凭本事吃饭哦。继续问，摇到号了吗？诸如此类等等。这样的事情你来我往的，很容易动摇对方的军心，还是很有作用的。试想一下，如果你的爬虫工程师在大年三十还苦逼加班的时候，看到对方留言说自己拿到了n个月的年终奖，你觉得你的工程师，离辞职还远吗？\n\n最后，我们终于搞出了大动作，觉得一定可以坑对方很久了。我们还特意去一家小火锅店吃了一顿，庆祝一下，准备明天上线。大家都知道，一般立flag的下场都比较惨的。两个小时的自助火锅，我们刚吃五分钟，就得到了我们投资竞争对手的消息。后面的一个多小时，团队气氛都很尴尬，谁也说不出什么话。我们组有个实习生，后来鼓足勇气问了我一个问题：\n\n“我还能留下来吗？”\n\n毕竟，大部分情况下，技术还是要屈服于资本的力量。\n\n**四、爬虫与反爬虫的未来**\n\n与竞争对手和解之后，我们去拜访对方，大家坐在了一起。之前网上自称妹子的，一个个都是五大三粗的汉子，这让我们相当绝望，在场唯一的一个妹子还是我们自己带过去的（就是上面提到的实习生），感觉套路了这么久，最终还是被对方套路了。\n\n好在，吃的喝的都很好，大家玩的还是比较high的。后续就是和平年代啦，大家不打仗了，反爬虫的逻辑扔在那做个防御，然后就开放白名单允许对方爬取了。群里经常叫的就是：xxx你怎么频率这么高，xxx你为什么这个接口没给我开放，为什么我爬的东西不对我靠你是不是把我封了啊。诸如此类的。\n\n和平年代的反爬虫比战争年代还难做。因为战争年代，误伤率只要不是太高，公司就可以接受。和平年代大家不能搞事情，误伤率稍稍多一点，就会有人叫：好好的不赚钱，瞎搞什么搞。此外，战争年代只要不拦截用户，就不算误伤。和平年代还要考虑白名单，拦截了合作伙伴也是误伤。因此各方面会更保守一些。不过，总体来说还是和平年代比较happy。毕竟，谁会喜欢没事加班玩呢。\n\n然而和平持续的不是很久，很快就有了新的竞争对手选择爬虫来与我们打。毕竟，这是一个利益驱使的世界。只要有大量的利润，资本家就会杀人放火，这不是我们这些技术人员可以决定的。我们希望天下无虫，但是我们又有什么权利呢。\n\n好在，这样可以催生更多的职位，顺便提高大家的身价，也算是个好事情吧。\n\n## 致敬我们可爱的前端后端的工程师们\n\n> 注：内容有略微改动（原文的广告已删除）\n> \n> 转自：往前方：[http://www.wangqianfang.com/12204.html](http://www.wangqianfang.com/12204.html)"
		},
		{
			"post_id": 7,
			"title": "买书不读是一种什么病？\n                                                 ——我已经浪费钱买游戏了，什么？还要浪费时间玩游戏？",
			"date_published": 1497150879.968,
			"body": "在日语中有这么个词特别的单词：**積ん読（Tsundoku）**，用来形容买很多书却把它们扔在角落积灰的行为，这个词的起源可以追溯到明治时代，翻译成中文大概就是“**买书如山倒，读书如抽丝**”。\n\n* * *\n\n![Tsundoku.jpg (700x442)](data/img/post_7_Tsundoku.jpg)\n\n对，说的就是你。\n\n在开始阅读这篇文章之前，先告诉我，你书架上和 Kindle 中现在放着的书里，有几本你读了还不到 1/3？有几本根本就没打开过？\n\n“买书不读”就像 14 世纪流行欧洲的黑死病一样，堪称当代社会最严重的瘟疫之一，它虽然不会威胁你的生命，却会谋杀你的钱包，并带给你永无止境的负罪感。今年 4 月 21 日，亚马逊中国发布了《**2016 年“全民阅读”调查报告**》，将近 1/4 的受访者一年看书不超过 5 本。2015 年美国电子书商 Kobo 研究也发现，60% 电子书消费者从来没打开过他们买回来的东西。\n\n说到买书不读的原因，最普遍的理由是“**没时间**”和“**静不下心**”。这也解释了为什么上厕所时总是我们阅读效率最高的时候，卫生间这个迷之圣地不仅圈出了封闭的空间和固定的时间，还将其他一切会让你分心的娱乐方式排除在外，只要那扇毛玻璃门一关上，别说黑格尔和康德了，给我一卷手纸我能把洗发水配方表都背下来。\n\n为了能静下心来读书，我们往往要抵制住的手机、游戏、电影的诱惑，这也是很多人在 iPad 和 Kindle 之间选择了后者的原因。可是你有没有想过，为什么你会毫不费力的选择打游戏而非读书？这是因为大脑已经自动替你选择了最有效率的娱乐方式，而其选择的依据则是浸入难度的不同。在网络科技高度发达的读图时代，大数据和信息图风靡一时，纯文字书籍这种形式本身已经不再是获取信息最有效率的方式。\n\n和游戏对比一下，我们就能发现不同媒介在获取信息的友好程度上有多大差别。在**《为什么游戏重要？》**一文中， RED 老师讲过这样一段话：\n\n“当我们将游戏看成一种放松身心的娱乐时，往往也就默认它必须是浅薄的，而没有意识到蕴含在游戏过程中的高互动性、高参与感在与虚拟世界的体验结合之后，在艺术创作层面带来的可能性，更没有意识到人类在不知不觉的游戏过程中所投入的情感，是比任何其它艺术形式都要更加强烈和直接的。”\n\n如果我们的刻板印象已经将放松身心等同于浅薄，那么，当我们将读书看成一种门槛较高、难以浸入的活动时，往往也就默认了它的高雅，并将它从“娱乐”的范围中排除了出去。在时间的洗涤下，书籍——这种历史最为悠久的信息载体——本身已经被神圣化，成为了“知识”的象征，可说到底，它和游戏电影们的差别只是不同类型的媒介而已。\n\n一个真正爱看（某本）书的人，感兴趣的是书籍的内容而非载体，哪怕把字印在天花板上他都能仰着脖子看完。而我们买书不读的根本原因，很可能是我们对那本书的内容不够感兴趣。\n\n面对墙角积灰的书堆，我曾经扪心自问：我真的有那么想看这些书吗？既然我对它的兴趣都不足以让我把它从书架上拿下来翻开，为什么我还在坚持不懈的买书？\n\n最大的锅一定是图书电商的：他们丧心病狂的打折，不买简直就是吃亏。便宜是促使我们屯书的前提条件，在印刷术普及之前，书籍一度是权贵阶层们用来炫富的方式。而在看个电影吃顿饭都要百八十块钱的今天，书籍变成了最便宜的正版娱乐形式。便宜不仅让我们开始屯书，还使我们屯起了游戏，欧美网友们根据日文单词 Tsundoku 发明了新单词 Steamdoku，专门用来形容在 Steam 上买了游戏而不打的行为。\n\n除了便宜，储物癖也在驱动着我们不断下单——剁手——再下单。在当代青少年的三大特征“买书不读，买游戏不打，买黑胶不听”中，占有欲扮演着罪魁祸首的角色。一套心水的漫画怎么能不收全呢？一部心爱的电影怎么能不买蓝光呢？收藏才是正义啊，虽然我知道把这本书这张碟买回家来使用的机会约等于零，但这株毒草一天不拔我的灵魂就一天不得安宁。\n\n被称为“外国豆瓣”的 **Goodreads** 网站上有个小组叫做 **Book Buying Addicts Anonymous（买书成瘾症）**，聚集着一大波买书不读的病友。对这些重症患者来说，买书已经演化为了成瘾行为，当你在从事飞叶子、抽烟等其他上瘾性行为时，大脑会释放出一种名为多巴胺的化合物，正是它让你在购物时兴奋到颤栗。艾奥瓦大学精神病学教授唐纳德·布莱克写道：“购物已经成为全美排名第一的娱乐活动，人们购物是因为他们乐在其中。”回想一下你收快递时的心情，是时候给自己打一针安定了。\n\n在后现代主义中，消费主义也被视为是一种获得愉悦的活动形式。鲍德里亚认为，消费是一种狂欢与释放，人们通过购买符号逃离日常生活的空虚无聊，获得满足与愉悦。购物在上帝已死的时代起到了宗教的作用，给了我们表达内心的狂热与忠诚的渠道：“给爸爸打钱！”\n\n鲍德里亚还认为，广告赋予了商品一种文化迷思，促使消费者为了建构个人认同而进行消费，也就是我们俗称的“贴标签”。作为一个星战粉，我怎么能不收齐星战 1-7 蓝光全集？有时我们买东西已经不是为了使用欣赏，而是提醒自己我应该是个怎样的人。**We are what we buy**，购物行为本身是一种流行且有效的自我表达方式，它正在帮助我们构建自己的身份。\n\n至于“书非借而不能读也”之所以屡试不爽，是因为借书这个行为排除了书籍的收藏和贴标签两种属性，让它只剩下承载信息一种用处。所以，面对一本看不进去的书，最好的解决方式是从朋友那里借来蹲在厕所看，虽然感觉有点对不起朋友……\n\n通过上述胡说八道，我们已经对“买书不读”的行为进行了洗地，可是当深夜面对书架的时候，我还是能听见无数未拆封书籍的冤魂在向我控诉，我该拿这份负罪感怎么办？\n\n在经济学中，这种现象被称为“沉没成本谬误”。有时我们会强迫自己看一场毫无兴趣的电影，只因为害怕浪费了票钱。这种行为在经济学家们眼中反而是“不理智”的，因为它基于不相关信息，错误的分配了时间资源。所以，你大可抛开“来都来了”和“值回票价”的心理，学学 Steam 玩家们的豁达态度：_**“我已经浪费钱买游戏了，什么还要浪费时间玩游戏？”**_\n\n买书不读产生的负罪感一部分来源于沉没成本，另一部分则是通过“抽丝”，我们突然意识到，自己其实不是我们原来认识的那个人。下单时的你可能真的对《三峡水电站水位与铁三角耳机声音效果研究》非常感兴趣，可是当加完班考完试拖完稿快递到手之后，你已经不是买书时的那个你了，此时的你只想躺在床上边吃炸鸡边看岳云鹏相声，至于发电机组到底是西门子还是通用，你已经无所谓了。\n\n无论你看书的目的是为了放飞自我还是涨知识走向人生巅峰，追根到底，我们之所以读书，是因为读书能带给我们实打实的满足与快乐。买书不读非但不是病，而是一种再合理不过的行为，因为对“病友”们来说，买书这项活动本身带给你的快乐已经远远超过了读书。\n\n谁规定买了书就非得读呢？总之，你开心就好。\n\n> 转自：kindle伴侣"
		},
		{
			"post_id": 6,
			"title": "戴“套”大作战，成功！",
			"date_published": 1496821303.2,
			"body": "捣鼓了两天Tor匿名终于可以working了。看了大量的教程，也还是不行。无奈只有看官方的英文教程才捣鼓好的。感叹：啥东西，还是原装的好啊！还有如果有零友需要tor匿名也可以在下面留言哦！也可以给我发比特信：BM-2cWr3jV8BvYffJpg47z3Jn4gMP7wXY8fYq 。"
		},
		{
			"post_id": 4,
			"title": "第一次分享，有所不足，请多赐教",
			"date_published": 1496810728.077,
			"body": "分享自己整理的一些p2p软件 sync：BQAMTCXQWEDEBJ3J4MZZZ6AMJAFBD3JJI"
		},
		{
			"post_id": 1,
			"title": "开博客，第一天",
			"date_published": 1433033779.604,
			"body": "今天我的第一个zeronet博客，终于建好了。谢谢Cundhi，我是看你的文章才建的博客。希望大家多多关注哦！我会经常为大家发布一些资源的哦！有什麽需要的也可在下面留言哦。我们一起创建一个真正的internet。谢谢"
		}
	]
}