{
	"next_comment_id": 6,
	"comment": [
		{
			"comment_id": 1,
			"body": "I'm interested",
			"post_id": 10,
			"date_added": 1560879389
		},
		{
			"comment_id": 2,
			"body": "Thank you! :-)",
			"post_id": 17,
			"date_added": 1561041640
		},
		{
			"comment_id": 3,
			"body": "Is there a way to choose a port rather than IP? I use a private proxy to access ZeroNet, so that would be usefull.",
			"post_id": 20,
			"date_added": 1561231565
		},
		{
			"comment_id": 4,
			"body": "> [jamesholden](#comment_10_12w3zJ6gRrcAw2kSCQXDkorgqxuXnkKkF8): I am not sure I understand your use case ? Where do you need to set the port rather than IP ? On your favorite zites ? The favorite zites field is freetext so anything put there will be tentatively translated by the browser (even clearnet sites) so there's no restrictions if you want to include a proxy URL I think.\n\nThe extension works only if the IP is 127.0.0.1, but I use a ZeroNet proxy, so the IP I use is 192.168.70.5 or my external IP, so it would be more useful for me if the IP could be anything (I don't have a static external IP), but a specific port (*:43110). But I could always use an SSH tunnel instead of port forwarding.",
			"post_id": 20,
			"date_added": 1561235267
		},
		{
			"comment_id": 5,
			"body": "> [jamesholden](#comment_11_12w3zJ6gRrcAw2kSCQXDkorgqxuXnkKkF8): Ah, I see, thanks for clarifying ! It doesn't seems possible though, it's denied by the regex Firefox use to define the scope of the add-on :\n> There was an error during installation: Extension is invalidReading manifest: Error processing content_scripts.0.matches.0: Value \"http://*:43110\" must either: be one of [\"<all_urls>\"], must either [match the pattern /^(https?|wss?|file|ftp|*):\\/\\/(*|*.[^/]+|[^/]+)\\/.$/, or match the pattern /^file:\\/\\/\\/.$/], or match the pattern /^resource:\\/\\/(*|*.[^/]+|[^/]+)\\/.*$|^about:/\n\nOh well, I guess I'll use tunnels from now on.",
			"post_id": 20,
			"date_added": 1561235790
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}