{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "hello world",
				"added": 1566698588
			}
		],
		"1566461918_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 2,
				"body": "yea it was that fukin mossad isralie \"art\" group gelatin that had full access to the floor that were hit a couple of weeks prior to the attack and were seen bringing in many boxes of fuse holders along some other suspicious activities. they are still around today and in 2005 have changed their name to \"gelitin\" and have relocated to  zionist hq  vienna austria. their website is gelitin.net. they are a group of 4 artist",
				"added": 1566701309
			},
			{
				"comment_id": 3,
				"body": "> [brahman](#comment_3_17tQX9J2fScN9APmweSUnzEU4EfTG1ojYb): sure, i trust you, give me no references\n\nwhat you want me to breathe for you also? I'm just giving you a bread crumb, find the way yourself",
				"added": 1566748794
			},
			{
				"comment_id": 4,
				"body": "> [memesadler](#comment_105_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): Never mind this whole saudi-israeli op to fly planes into towers, they should be trialed just for this shitty jewish art.\n\nSERIOUSLY, it's so bad!",
				"added": 1566954969
			}
		],
		"1567815493_14vGy5BMcRS26xrfaVZfcTuVm8XTaZv3mi": [
			{
				"comment_id": 5,
				"body": "i am so sorry for your struggle.  i know i am a stranger but i would be your friend. you are still connected to your loved one even though it may not seem like it.  We are all connected through the cosmic energy of this universe and i hope that you are able to find the will to go on.  i would try dmt before resorting to suicide as it may help give your answers or  perspective and may help you find peace.  good luck my freind.",
				"added": 1567912841
			}
		],
		"1567904814_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": [
			{
				"comment_id": 6,
				"body": "> [defconzero](#comment_9_1C4sZqqLnExKmkEWXvxtcHyPWE7ogzfjCE): My problem with that drama is that there was only one reporter that took all the pictures and reported on his death.  Nobody else, from any publication, anywhere.  They all repeated what he posted.  I think he's dead, due to the inmate reports of his screaming for his life.  But there is no evidence.  The forensic path doing the autopsy is a FBI bitch that does shit work in the real world.  Dead or not isn't important.  What is important are that these pedo-vampires are controlling our governments, politicians, and businesses and they need to be treated just like Epstein was.  Two snapped vertebrae and a crushed hyoid.\n\nman what if that photo was actually epstien alive pretending to be dead and they were actually butsting him out",
				"added": 1567913420
			}
		]
	},
	"comment_vote": {
		"2_15dh9yJTSgewL53B9uMW7TTkJF7wHp1tge": 1
	}
}