{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1557648920,
			"title": "Mirroring an enture Zite (including optional files)",
			"body": "Hey kind of new here, thought id ask if there's an easy way to do this? The TL;DR is that I have another computer that I just want to mirror my sites on however its not grabbing any of the optional files I have on it (a few video files). Thought id ask on here, did a bit of a google and didn't really find anything out there, or I'm not typing the right things in.",
			"added": 1557648919
		},
		{
			"topic_id": 1583503902,
			"title": "ZeroMe Hubs and how you find them and connect to them.",
			"body": "So I just spun up another zeronet instance on a server to test out some stuff and bumped into a bit of a problem. \n\nI jumped into ZeroMe as on this new instance and noticed it only connected me to the moonhub when I signed in. Didn't see any sunhub at all, and I didn't even realise this till I noticed I wasn't seeing some peoples posts that I saw on my instance on my PC. \n\nSo now I'm just curious if there are other hubs I've never seen and people I've never met on ZeroNet because of this. If I remember correctly ZeroMe automatically added thoes hubs on my PC and now im curious why it didn't on here. Or how you even find them? Never seen any hub like ZeroNet site around.\n\nThought id pic some peoples brains on it.",
			"added": 1583503900
		},
		{
			"topic_id": 1586990520,
			"title": "Incoming Trump Bucks",
			"body": "So how many of you guys got your trump bucks today / yesterday?\n\nSaw a bit of an explosion on twitter and thought I'd ask lol",
			"added": 1586990517
		}
	],
	"topic_vote": {
		"1558291815_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"1580943879_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7": 1,
		"1583557114_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71": 1,
		"1586981807_145UdHkipHkyVRvbjGSB8CLGt9JwzVTsgg": 1
	},
	"next_comment_id": 17,
	"comment": {
		"1557049303_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 1,
				"body": "yeah nah",
				"added": 1557206834
			}
		],
		"1557537700_1KnsqabvZFW3M93ejGdJX3NHdNuSaPsJAv": [
			{
				"comment_id": 2,
				"body": "Thought id just throw this here https://keybase.io/triplesec/ #JustJavascriptThings",
				"added": 1557611013
			}
		],
		"1557647082_14EdfbbdCHp18C276cTBHQ8mmG5n6U4b9S": [
			{
				"comment_id": 3,
				"body": "Have my server running this 24/7 if you have a site you want me to help seed shoot me a zeromail. :)",
				"added": 1557664170
			}
		],
		"1557337953_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": [
			{
				"comment_id": 4,
				"body": "Should have just stuck to applebees. Mind you the train wreck has been very fun to watch.",
				"added": 1557664465
			}
		],
		"1557648920_1Mj79LYD98Up6EBBtETMhWaLUk4uPhGbo2": [
			{
				"comment_id": 5,
				"body": "> [anal](#comment_1_1DSnM3xHWxHbkHCADMTfhvXMfZDE34vwQJ): Why don't you copy-paste the zite folder ? Anyways, if you want all the files including those optional that you don't already have, there's an option to download and share the whole zite in its Zero menu ( The Zero in the top right corner).\n\nYeah I did just end up copying the folder to my other host. Also I had no idea you could drag that menu over on the right haha! You just blew my damn mind with that, I always just thought it was a go home button. Thanks for the heads up on that!",
				"added": 1557699523
			}
		],
		"1580943879_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7": [
			{
				"comment_id": 6,
				"body": "Saw your stuff on on Kopy Kate and ill make sure to help seed!",
				"added": 1582882363
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 7,
				"body": "> [hardway](#comment_2_1EF86pXfsBpDKRBLfNWSLKTUofq6N8hyf5): Is there a way to remove your own content from ZeroMusic?I made a mistake in the name of the Album I uploaded and then I uploaded to the correct name.Now there are 2 copies of the music 1 with incorrect Album name.this could get messy if there is no way to control your own content and also take more space than necessary.Is there a Solution or is this system still too beta?\n\nGot a link to this? I'm guessing the content or at least the stuff you have uploaded is stored in a json in a user folder with your ID as the name. You could go into there and change it manually and then publish it that way. Have had to do that with a few sites on here since some places just have a post and no edit option.",
				"added": 1583504107
			}
		],
		"1583503902_1Mj79LYD98Up6EBBtETMhWaLUk4uPhGbo2": [
			{
				"comment_id": 8,
				"body": "> [schiz0](#comment_99_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k): List of all hubs: [...]\n\nAwesome thanks for the links!\n\n> [pexo](#comment_193_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): There is a fairly complete list at innocentchilds room\n\ncheers for that quite a few in there!\n\n\nAlso sorted out my problems, apparently rebuilding the database when you add hubs into ZeroMe makes everything magically work again as well :)",
				"added": 1583629595
			}
		],
		"1583642366_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid": [
			{
				"comment_id": 9,
				"body": "Makes no difference where I live. In a small town in the shire where everyone here just promises to fix roads that magically never get looked at.",
				"added": 1583665165
			}
		],
		"1580612515_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": [
			{
				"comment_id": 10,
				"body": "Yeah never worked for me either. I click on any content and it just goes to a blank screen.",
				"added": 1583665664
			}
		],
		"1584402406_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 11,
				"body": "> [bigbadbob](#comment_1074_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Maybe he contracted air-born aids.\n\nMight have got the coof you know",
				"added": 1586831620
			}
		],
		"1586990520_1Mj79LYD98Up6EBBtETMhWaLUk4uPhGbo2": [
			{
				"comment_id": 12,
				"body": "> [edgelordofdecent](#comment_470_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): What the fuck is a trump buck\n\nThat $1200 that stimulus package that people are getting.",
				"added": 1586992141
			}
		],
		"1586981807_145UdHkipHkyVRvbjGSB8CLGt9JwzVTsgg": [
			{
				"comment_id": 13,
				"body": "Sup going good fam",
				"added": 1586993435
			}
		],
		"1590536017_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 14,
				"body": "Don't usually run ZN on my laptop or my phone, so i just ssh to my box and forward the port my to local device. Made a little thinclient app that looks like Zeronet to keep the experience the same as well lol",
				"added": 1590833599
			},
			{
				"comment_id": 16,
				"body": "> [merithtk](#comment_39_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): thinclient? do you have source code for us or examples? i would love to look at something like that\n\nOh as for connecting to it you can just make a shortcut with ssh, just have to have something in your network you can connect to, I have ZeroNet on my server and just connect to a raspberry pi. You can forward ports using something like this  \n\n``` ssh -L 43110:(IP of ZeroNet):43110 (ssh server ip)``` \n\nthen that will allow http://127.0.0.1:43110 to connect to your copy of ZeroNet as if it was on your local machine (saves you having to setup passwords on your instance of ZeroNet and you don't have to have it exposed to the internet as well).\n\nI made a system tray icon just using a program called AutoIT. Takes 2 seconds to make something and compile it into a exe for windows.\n\nAs for my phone I use an app called ConnectBot. Just do the same thing on that to let me access ZeroNet on my phone.",
				"added": 1591146013
			}
		],
		"1590742559_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": [
			{
				"comment_id": 15,
				"body": "Think this was something to do with how many threads you have to manage the files. At the bottom of your settings you can up the amount of threads you can have per action. Might have to tweak that a little to make ZN usable. I'm already in that boat.",
				"added": 1590834122
			}
		]
	},
	"comment_vote": {
		"1_1DSnM3xHWxHbkHCADMTfhvXMfZDE34vwQJ": 1,
		"61_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": 1,
		"1841_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"3_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7": 1
	}
}