{
	"next_topic_id": 13,
	"topic": [
		{
			"topic_id": 1616003989,
			"title": "What would happen to a sherif arresting former AG Barr?",
			"body": "CIA/FBI death squad pop up to liberate the pedo protectors? or only DoD?",
			"added": 1616003988
		},
		{
			"topic_id": 1616012216,
			"title": "What is the system of values that american mothers and fathers used to raise a generation of pedos protectors at the nsa, cia, dod, fbi, doj, congress etc?",
			"body": "very curious... big science project !",
			"added": 1616012214
		},
		{
			"topic_id": 1616142771,
			"title": "for most american of african descent : their problems isn't slavery, but that they (themselve) didn't owned the plantation mansion !",
			"body": "bounties !",
			"added": 1616142768
		},
		{
			"topic_id": 1616143720,
			"title": "so kashogi betrayed the King of Ksa (I don't like this word, better in arabic original I am sure :D) to serve david agenda",
			"body": "\"“We are grateful to the Washington Post, the New York Times, Time Magazine and other great publications whose directors have attended our meetings and respected their promises of discretion for almost 40 years......It would have been impossible for us to develop our plan for the world if we had been subjected to the lights of publicity during those years. But, the world is more sophisticated and prepared to march towards a world government. The supernational sovereignty of an intellectual elite and world bankers is surely preferable to the national autodetermination practiced in past centuries.” \"\n\nand died ! nice !!!\n\ntraitors must die !\n\nyou know tribal allegience is mercyless... your are born with the lead, you die with him, or die fighting ! \n\nthere is no other path ! \n\nfor me If I was in KSA, I know who is the boss, and to whome my problem to report (his assistant, aka the tribal model) and if I see a tribal assistant ,  aka representant betraying the supreme lead > direct report to the lead... who cares if it was wrong ,and misunderstanding and grave insult to the assistant.. clean with the supreme tribal lead that all that counts, and then of course apologize to the wronged ones... \n\npeople don't understand tribal dynamics :).",
			"added": 1616143716
		},
		{
			"topic_id": 1616144585,
			"title": "the whole murdoch family will be assassinated !! kiss you kiddies shit bag !",
			"body": "why? first word on fox news : world sleep day ... aka UNO  / global agenda promotion backing RINOpedos !! 101...\n\nyou are dead !",
			"added": 1616144580
		},
		{
			"topic_id": 1616146599,
			"title": "The real question : Japan and the UNO / global agenda !",
			"body": "between the emperor, the shogun, the warlords, the keiretsus, the absolute love and devotion for japan as a landmass ! \n\nthe problem I guess for the UNO / global agenda is that they can't get a grip on japan ;).\n\nif only japan recognized that those fish islands have always been and will always be chineses... and did it's mea culpa about all this invasion / uno global agenda attempted conquest of china... \n\nmaybe... it could have a great future... otherwise... it will be harder...",
			"added": 1616146593
		},
		{
			"topic_id": 1616147005,
			"title": "i fully support using ivanka trump, rex jones and chelsea clinton for blooding practices !",
			"body": "very great ! I hate them all !",
			"added": 1616146998
		},
		{
			"topic_id": 1616147854,
			"title": "so the core issue in the pedo western feodalist conquest : how to defend israel while attacking china with iran arming ?",
			"body": "hehehehehehe,.... it's a real problem... they know the us won't be left unscattered (if ever exist) after a full on war with china on taiwan.\n\nthe more iran is backed the less the pedowestern forces can think about taiwan...\n\nfurthermore once usa gone... hehehehehehe... I imagine the Sunnah will quickly recalibrate...\n\nso the goal of the pedo is to direct a sunni / sunnah fight in the open to get the windows to attack china over taiwan...\n\nthey saw their covert cia shit regime change failed... so what's next?\n\nand so for israelis the situation has never been doomer !!!\n\nwhy? the pedo gig unresovlved leading to tel aviv, and the control of the west + ww1 and 2 and fiat to get it... \n\nthe perfect setup that the shia / persians are to really provide a massive front (+ proxy help) I mean YUGE...\n\nand PLA on it's HOMETURF? ehhehehehe... even the khan didn't won against pla, he just converted them, or more exactly restored real military doctrines and not some crap shit lead by feminization :).",
			"added": 1616147846
		},
		{
			"topic_id": 1616148720,
			"title": "my hope for america, is still the american troops so called grunts and those who saw through the lies even if grading...",
			"body": "so yes, shitbags ! or you fucking wage clean this IW 2, grunt and so called educated, and I mean farming the pedo feodalists crap, don't worry about socio / economic issues...\n\nWE LOVE IT ALREADY !!! \n\nwhy market rotation and volatilty to make what ?\n\nAMERICA GREAT AGAIN ! and 1st (that will be harder with the competition :D)\n\notherwise it's fight for the pedo feodalist while they rape your kids, in a thousand way...\n\ntime to end it.\n\n250k first batch...\n\nremember corporations are structured to see all those workers specially ceo and others csuits peons as expendable commodities... expendable... no value... extracted and trashed...\n\nremember if war has eternal laws, money too :).\n\nI don't see why you are afraid to frag the children of chelsea clinton or ivanka trump... I mean what value do they hold beyond the neuroprogramming that your conditionning lead you to believe?\n\nnothing... none. what so ever.\n\nPLA 4 eva !",
			"added": 1616148711
		},
		{
			"topic_id": 1616149451,
			"title": "you note it's the negroes who attack the asians... why? because they have money !",
			"body": "and the negroes want just to be themselves the slave masters ! lol... (not all, provocation 101).\n\nand the shooting maybe a death squad training to remove some preceived as foreign agents? who knows... or just someone with a strong grudge... but why such travel if not a kill list applied?\n\nwho knows who knows... \n\none sure thing, occupied america is trapped. you can't support israel (pedo, uss liberty etc, fiat, etc etc) while at the same time fighting china and keeping in check Islam :D.\n\nlol... and I don't mean reckoning the ice giants :D.\n\nand the whole while... ay ay ay... to much crap. impossible to not be overflooded, from uno, to gmo to all the crap of the depopulationists... I mean, there are so many fronts, that the waring tribes is even more approriate for the usa...",
			"added": 1616149441
		},
		{
			"topic_id": 1616149523,
			"title": "if abbot from texas wants respect, he better use an open source decentralized system",
			"body": "saw his gig about gab (the new corral by the twitter guys), so okay closed...\n\nbut if not opening a new venue, be it bitmessage or zeronet or something truely UNCENSORSABLE... it' sjust another rino to be used as blooding target...",
			"added": 1616149512
		},
		{
			"topic_id": 1616150297,
			"title": "so the goal is to murder ian bremmer to prevent berlin to drag bruxelles in a war against China...",
			"body": "easy with their pedos control in bruxelles and berlin, they could get there... I hope france will be smarter and let all those eurofolks die... \n\nhehehhehehe... our revenge :D.\n\nand they first have to reach china... there is a bear along the way :)\n\nkeeping out is WINNING !",
			"added": 1616150285
		}
	],
	"topic_vote": {},
	"next_comment_id": 81,
	"comment": {
		"1533632541_16LdT3GLYKemm8EWbR5BYXKMmMoZrSoet5": [
			{
				"comment_id": 1,
				"body": "Alex jones knew all along that trump is a pedo.",
				"added": 1616002732
			}
		],
		"1527230895_1Kma1Pz9kBSHmDtK1iYtHTox14Edmx2e5f": [
			{
				"comment_id": 2,
				"body": "> [tommykakashi](#comment_1_1rYi49f3DNfJntyt2EV3H1xjpVobJMoLz): Agreed.Think is one thing. Action means much more. We can't blame people for thinking some thing illegal. But we will punish those who dare to make a move.\n\nwe are still waiting... since then the whole pedogate / litte st. james island resulted in 2 arrests. thanks pedotrump !",
				"added": 1616002862
			}
		],
		"1615487471_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 3,
				"body": "Maybe one day, mexico will be the capital of the whole conus ! the flag, in Cicero, Chirak was carried properly.",
				"added": 1616003559
			}
		],
		"1616003989_1Hokap9vnjUTCeaQS91AQqUqW8Qry4rJTA": [
			{
				"comment_id": 4,
				"body": "it's always possible to capture his daughter and bait him like this, and if it does work, she dies.",
				"added": 1616004035
			},
			{
				"comment_id": 5,
				"body": "predators with hellfire munition rerouting, 3,2,1...",
				"added": 1616004108
			},
			{
				"comment_id": 6,
				"body": "/eliminateallevidence in 3...2...1...",
				"added": 1616004124
			},
			{
				"comment_id": 7,
				"body": "and cnn will say there was a gaz leak. job done ! pedo safe ! MIIC HAPPY !",
				"added": 1616004151
			}
		],
		"1616012216_1Hokap9vnjUTCeaQS91AQqUqW8Qry4rJTA": [
			{
				"comment_id": 8,
				"body": "What's cool is that we have a batch of 3 millions profiles, at least... so I am curious what the data will reveal ! I guess it will refined with this one, as we have more than for their parents ! \n\ninteresting way to see the thing...",
				"added": 1616012282
			},
			{
				"comment_id": 9,
				"body": "Do you have premises? ideas? I mean factually the cia, dod, etc... have protected and defended the pedos. facts.\n\nand the question is why and more exactly how their parents raised them to be like this.\n\ncultural, social, economical, genetic, epigenetics, biochemicals, emf, propaganda conscious and subliminal... I mean the whole data set to get an understand of the root cause of what affects them.\n\nI don't want to sound superior to the americans researchers who would wish to participate in this science projet. I just find your values aborhrent abominal and worst... but it's yours. I am not here to judge anymore, but to study as it's the trend nowadays !\n\nso of course it's an open source spirit, don't hesitate to put your little names as it'ŝ important for you... but please welcome ! we need first hand subjects with a little bit more expression than the vast majority...\n\nso how did their mothers and fathers educated them to become pedoprotectors and find that great and proud of their jobs? It's crazy seen like this... but it's just science. At the end some will have promising theories, or explicative and predictive framework, others will keep speewing bullshit.\n\nat least the observation is possible? do you think the subjects will evolve by being watched :D?",
				"added": 1616012560
			},
			{
				"comment_id": 10,
				"body": "And of course to really complete the study we need to study to the counter example, like for example the guys of project veritas. Why have the mothers and fathers raised them and how... and you see... the counter group :).",
				"added": 1616014477
			},
			{
				"comment_id": 11,
				"body": "an interesting point is to establish a real starting date for this culture. Sadly I can't help in this regard. I have heard rumors, stuff and their contrary... so... I just know that today it's the products of those mothers and fathers education, aka how they raised them. the question is that was it wanted, or unwanted... hm? I don't know. because the question is then did their grand parents raised their parents like that and up and up...",
				"added": 1616016018
			},
			{
				"comment_id": 12,
				"body": "and just to clear that out, I don't believe any more it's possible to solve that without wiping them all at once in a zero retaliation first strike complex system :). but that's not the point, they are still alive, and so the empirical evidences are NOW !!!! while there is still time...",
				"added": 1616016113
			},
			{
				"comment_id": 13,
				"body": "it's as important as the manhattan project for any serious organization, military or not.",
				"added": 1616016138
			},
			{
				"comment_id": 14,
				"body": "and so it's really important to abord the scientific with the widest fields of researches, as we can't yet tell, how long the empirical data will be extracteable from the live subjects... I don't say it couldn't last a thousand more years, just that it's even more important than the manhattan project... \"soul of the nation project\"....",
				"added": 1616016248
			},
			{
				"comment_id": 15,
				"body": "and really it's beyond the msn / hollywood pop culture camo... it's really about those 3 millions dod cia fbi doj etc... what raised them... I mean it can't be human... let's be direct :).",
				"added": 1616016307
			},
			{
				"comment_id": 16,
				"body": "it will be crazy to read the first theories... until the first unifiers and maybe finally a day, where a short text, or even mathematical formula will be able to explain it ! all the variables etc, you can produce pedogens... worst 3millions minimum of them !",
				"added": 1616016417
			},
			{
				"comment_id": 17,
				"body": "bcz those people could say NO, but they don't. and that's a FACT.",
				"added": 1616016442
			},
			{
				"comment_id": 18,
				"body": "often we neglect the uprising, but wrong... there is a systemic parental failure there !",
				"added": 1616016468
			},
			{
				"comment_id": 19,
				"body": "I am sorry for the use of failure... a systemic occurence producing in a large swath of the american forces a full support for pedos...",
				"added": 1616016498
			},
			{
				"comment_id": 20,
				"body": "and to get the role of the uprising of those individuals. and that's important the focus on this study isn't on the interactions to establish and or exploit this pedo network, but how at an individual each of those individuals chosed to side with the pedos... each one. and how their parents, all differents have collective markers, maybe, able for us to produce a theory on the matter!",
				"added": 1616016583
			},
			{
				"comment_id": 21,
				"body": "it's not gay work :).",
				"added": 1616016598
			},
			{
				"comment_id": 22,
				"body": "but it stay science, a \"wild guess with some evidences in an infinite universe... so lightly... but still relevant ! I am not sure it's the type of research the pedo feodalist west would like to finance :D.",
				"added": 1616016691
			},
			{
				"comment_id": 23,
				"body": "for example interviewing the children of trump , what is it to cover for a pedo? maybe they weren't raise like that ! ah !!! even more interesting.... but they are outside the scope of the study... we need to keep it on dod, cia, nsa fbi, doj... gun people and their clerks... :).",
				"added": 1616016777
			},
			{
				"comment_id": 24,
				"body": "for me it's now like a study on cannibals in certain part of the world... you know... once you remove the hollywood lies and nuke threat...\n\ncannibals with hollywood and nukes... you get why it's important to study them carefully, once to wipe them as fast as possible, secondly to be able to prevent the emergence of that among ourselves.",
				"added": 1616016885
			},
			{
				"comment_id": 25,
				"body": "and you know my dream, if one day among a group to top gen of pla a shit like this happen, that can't spread... you see? the true dream? not even counter coup, invisible transition, no even earlier. standing.",
				"added": 1616016966
			},
			{
				"comment_id": 26,
				"body": "and that , china wide ! don't worry I know, or can believe there are bad bad bad situation in 1.4 billion people, but I too believe that this standing, is already the case ! why? I have my theories, but they are not relevant to the study at hand... ;).",
				"added": 1616017067
			},
			{
				"comment_id": 27,
				"body": "if I may say it's a macro study... the big factors in making those in this generation pedos supporters at least. I don't care of each individual story... it's an avg of 3 millions what made that of them and the role of their parents specifically. limited.",
				"added": 1616017214
			},
			{
				"comment_id": 28,
				"body": "hobby research, wild guess welcomed no limit, be creative, nothing is wrong , it's just theories idea etc... throw it may stick :) even by being in the wrong post :D.",
				"added": 1616017278
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 29,
				"body": "you mean active duty?",
				"added": 1616028185
			}
		],
		"1615970209_1JbdNgiHeruxZbhuQgd8QtkhbC2to5r61j": [
			{
				"comment_id": 30,
				"body": "> [edgelordofdecent](#comment_809_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Could you quit making multiple accounts and spamming?\n\nirritating?",
				"added": 1616028261
			}
		],
		"1616137845_18BioUS1ntAqP4hN6pJJUjdCqUfKe1599i": [
			{
				"comment_id": 31,
				"body": "blinken : \" threaten the rules based order that maintain global stablity\"\n\npersonal translation : the pedo feodalist americans want to keep spreading GMOs (to corner the food supply, weaken immune system and ultimately depopulate the earth for only their children (as such and why their offsprings have to be killed to really thwart their whole plan).\n\nsecondly, it western pedos wants global stability to be able to keep raping their serfsexslavechildren.\n\nso rules? I thaught the usa had a constitution and bill of rights that were the supreme law of the land... that's I guess wrong since at least the league of nation establishment...\n\nthe first real treason\n\n(as the native genocide and slavery were original sins)\n\nand so that's why they want to revert to the issue of slavery, as it permits them to avoid the real elephant in the room, the league of nation, now UNO / global agenda...\n\nfor example how to explain otherwise the lack of consequences to the ICC personals? it's just one easy... so all is clear, mr blinken... \n\nwhat happened to you to betray america like this? because you said nothing when your great treasonous teachers told you to fuck the usc and bor and that there was only the UNO / global agenda and to get an A+ from those people to get a clerck job you said yes yes yes...\n\nfuck you. traitor.",
				"added": 1616141953
			},
			{
				"comment_id": 32,
				"body": "let's say that blinken and the pedos feodalists oppose the liberation of mankind by PLA / CCP / MSS / the chinese People ! :).",
				"added": 1616142052
			},
			{
				"comment_id": 33,
				"body": "ahh angry feodalists that the shackle on their serfs are broken and that those they saw as below ants have no embarked on the great march foward? lol... so classical... it ended baddly for the feodalists in china buddies... very badly... :D. rightly so !",
				"added": 1616142118
			},
			{
				"comment_id": 34,
				"body": ">Blinken was born on April 16, 1962, in Yonkers, New York, to Jewish parents, \n\nLoL, nothing will happen on taiwan !!! ahahahh they just shit their pants regarding IRAN / PERSIA / SHIA advance !!! ahahahahah...\n\nlol...",
				"added": 1616142261
			},
			{
				"comment_id": 35,
				"body": "to not have dual citizens in china is such a blessing... such a streamlining of operations :).",
				"added": 1616142281
			},
			{
				"comment_id": 36,
				"body": "so the jews can pull between 18-24millions... ? more? vs... 1:1400000000... and worst who know feodalism :)... the most advance form of it on earth ever ! so what?\n\nthere won't be a single arrest in pedogate / weinstein ,... yes maybe a few more lamb... but nothing else.\n\naustin is a bounty... as long as he lines the pockets of his shareholders all is good (what's the gig here? what type of county club syphoned his cash?, how big the mcmansion mr austin? a colonial plantation one?\n\nwill see...\n\n>Austin was born on August 8, 1953, in Mobile, Alabama[3] a\n\nLOOOOOOOOOOOOOOOOOOL\n\nso nailed... a track with the guidestone agenda maybe ?\n\nso sullivan?\n\nthe evangelical saydaym? \n\n>Jacob Jeremiah Sullivan\n\nahh maybe not ...\n\nso quick read : worked all along pedogate.. .clinton, obama... a rape track there?\n\nwho knows...\n\nor some money from the mullahs ?\n\nwh oknows... \n\n>ullivan is married to Margaret Goodlander, \n\nit's funny this aristocratic web... I understand why you don't give a shit if the serfs are contaminated (gmo and co) or raped... they are serfs... underlying... things to be used.. as some said \"goyim\" but in the worst inhuman way... things... tools...",
				"added": 1616142665
			},
			{
				"comment_id": 38,
				"body": "“We are grateful to the Washington Post, the New York Times, Time Magazine and other great publications whose directors have attended our meetings and respected their promises of discretion for almost 40 years......It would have been impossible for us to develop our plan for the world if we had been subjected to the lights of publicity during those years. But, the world is more sophisticated and prepared to march towards a world government. The supernational sovereignty of an intellectual elite and world bankers is surely preferable to the national autodetermination practiced in past centuries.”",
				"added": 1616143269
			},
			{
				"comment_id": 39,
				"body": "you will get killed !!! ahahhaha !",
				"added": 1616143308
			},
			{
				"comment_id": 40,
				"body": "and your kiddies !!! war !",
				"added": 1616143331
			},
			{
				"comment_id": 41,
				"body": "chainsaw massacrint the whole cnn atlanta building... no need to flee DE... you will be rounded up... this won't be afghan nice... no... all packed and then killed kiddies, unborn and old dying... unrestrited war.",
				"added": 1616143389
			},
			{
				"comment_id": 45,
				"body": "you are so defeated ! you lost the informationwar... lol !",
				"added": 1616144761
			},
			{
				"comment_id": 46,
				"body": "now it's iw2 time !",
				"added": 1616144776
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 37,
				"body": "“We are grateful to the Washington Post, the New York Times, Time Magazine and other great publications whose directors have attended our meetings and respected their promises of discretion for almost 40 years......It would have been impossible for us to develop our plan for the world if we had been subjected to the lights of publicity during those years. But, the world is more sophisticated and prepared to march towards a world government. The supernational sovereignty of an intellectual elite and world bankers is surely preferable to the national autodetermination practiced in past centuries.”",
				"added": 1616143242
			}
		],
		"1616143720_1Hokap9vnjUTCeaQS91AQqUqW8Qry4rJTA": [
			{
				"comment_id": 42,
				"body": "and so you hate CCP because of the treason policy? ahhahaha... war noobs...",
				"added": 1616143759
			}
		],
		"1616144585_1Hokap9vnjUTCeaQS91AQqUqW8Qry4rJTA": [
			{
				"comment_id": 43,
				"body": "ahh new south china... what a stupid project when seeing the perfect weather of china :).",
				"added": 1616144619
			},
			{
				"comment_id": 44,
				"body": "your shit pedo gig... gone... dusted... your feodalist model? uncompetitive... ahahahah.",
				"added": 1616144646
			},
			{
				"comment_id": 47,
				"body": "with ivanka... hehehehe... we get it... ivanka jared the sons of sorros, the son of mudoch... who else? bill gates? i guess he is really hell bent on his extermination project... you are such losers... \n\nit's the problem of aristocratic regime... \n\nthe son of... who expect the sons of mike tyson to ever reach the level of the \"beast\"? no one...\n\nadn that's your fundamental sin... of course you could ride over the queen of england, pown her, trap her kids etc... soon a king ! will see... if he gets it :).",
				"added": 1616145131
			},
			{
				"comment_id": 48,
				"body": "and trapping the bbc into abeiding and supporting pedos... what a ill organized broadcast...",
				"added": 1616145197
			},
			{
				"comment_id": 49,
				"body": "proposal to the aussie / uk / mi6 and co... why not try some luxurious blooding with the murdoch to see if the harrass on stars and royals diminishes? you want a step further? you know what I am thinking... so revenge killing...",
				"added": 1616145405
			},
			{
				"comment_id": 50,
				"body": "because those things, the murdoch once bloodbathed will leave a more sane... empty chair protocol can be initialized until a satisfactory heir appears... or splinter the medias empire into kingdom and rules... with more chairs to empty :).\n\noh they fear violence :)...",
				"added": 1616145469
			},
			{
				"comment_id": 51,
				"body": "so how are the murdoch planning to take over the chinese media space? already capitulated sinners?",
				"added": 1616145525
			},
			{
				"comment_id": 52,
				"body": "hahahahaha.",
				"added": 1616145533
			},
			{
				"comment_id": 53,
				"body": "the first step is take back skynews into english hands... can be by threat... then kill... easy... blooding...",
				"added": 1616145696
			},
			{
				"comment_id": 54,
				"body": "then all his newspapers... strip him from any uk assets or reach... by using violent means (or what ever the perfid albion is capable off which shall not be underestimate nor even imagine due to their historical nature)...\n\nso goal : nothing murdoch controlled in the whole of the UK..\n\n/informationwar active.",
				"added": 1616145762
			},
			{
				"comment_id": 55,
				"body": "at the end of the stripping, back by violence and the use of this children as blooding practice, he must say thank you, bowing before the majesty...\n\nthen he dies :) for other reason...\n\naka his surrender to the crown of the uk, doesn't mean the end of his troubles... oh nooo...",
				"added": 1616145832
			},
			{
				"comment_id": 56,
				"body": "with me it goes way faster ; the whole murdoch family in the meat grinder... then the senior is feeded until he dies naturally, with sometime doing interviews for the public consumption, to tell how is he going :D ahhahahahaah... he will be feeded... such suffering... and then once he has shitted them all, die or not :)... ahhahahah.",
				"added": 1616145941
			}
		],
		"1616147005_1Hokap9vnjUTCeaQS91AQqUqW8Qry4rJTA": [
			{
				"comment_id": 57,
				"body": "the problem is that austrialia has way too small military aged men population to really participate in my blooding progams... one each... so it will quickly cycled... \n\neven with all the sorros, rockefeller, gates and co... you don't enough MAM.",
				"added": 1616147069
			}
		],
		"1616147854_1Hokap9vnjUTCeaQS91AQqUqW8Qry4rJTA": [
			{
				"comment_id": 58,
				"body": "as tom cruise would have said : mission impossible !",
				"added": 1616147967
			},
			{
				"comment_id": 59,
				"body": "and waht's even funnier is that this positive feed back loop : arming iran to thwart occupied usa, works for russia too :)\n\nand the real kicker is to make a secret alliance between the shia and the sunnah, no direct conflict as long as israel exists :)... hehehehehehehh...\n\nand then the americans pedo westerners can do absolutely nothing, it even more provide an opporunity for the sunnah to arm massively :).\n\nwin win win....\n\none side loses.",
				"added": 1616148168
			},
			{
				"comment_id": 60,
				"body": "and the real question for the genius is how to get the haredim out of this mess?",
				"added": 1616148184
			},
			{
				"comment_id": 61,
				"body": "my proposal is that who ever wins against israel treat the haredim as the rashydoons did, but I would advise them to leave soon :).\n\nyou can't fight maff with narrative !",
				"added": 1616148221
			}
		],
		"1616148720_1Hokap9vnjUTCeaQS91AQqUqW8Qry4rJTA": [
			{
				"comment_id": 62,
				"body": "how many pla front line active duty could recognize the children of chelsea clinton now? 0 ! who cares... fight for china not uno / global agenda... no treason remains unpunished... and there are close to none :) so... you know... ccp work speaks for itself, and china eternal glory is for all to live since birth... so... your crap... out.",
				"added": 1616148868
			}
		],
		"1616149451_1Hokap9vnjUTCeaQS91AQqUqW8Qry4rJTA": [
			{
				"comment_id": 63,
				"body": "and don't forget fiannce, will milk you and just before the last squeeze drop you to only return after the hashes have cooled down... and the worst, it will look all okay to you, all along, until the evac... some will have advance, the others will perish at the gateways, crushed :).",
				"added": 1616149627
			},
			{
				"comment_id": 64,
				"body": "financial wmds isn't a saying... hard work, lot of maffs and intitutions :) you won't survive :)",
				"added": 1616149683
			},
			{
				"comment_id": 74,
				"body": "why do latinos don't attack asians? because like for anyone, if there are no reason to attack why attack? looting is bad... trading is good !",
				"added": 1616150533
			},
			{
				"comment_id": 75,
				"body": "and those goes to the core issue of blacks... it's hard to accept they were TRADED by other black men who saw in them commodities to sell to get shit to impress their bimbos... a classical :).",
				"added": 1616150583
			},
			{
				"comment_id": 76,
				"body": "using the n word is hard for many slaves isn't it? like NO ! no to censorship or pc speech, isn't it negroes ?",
				"added": 1616150644
			},
			{
				"comment_id": 77,
				"body": "I am not negros fucker, I am kakao !",
				"added": 1616150676
			},
			{
				"comment_id": 78,
				"body": "hot hot !",
				"added": 1616150687
			},
			{
				"comment_id": 79,
				"body": "what happen to alicia keys? it's her white part messing around with her mind? lol...",
				"added": 1616150717
			}
		],
		"1616150297_1Hokap9vnjUTCeaQS91AQqUqW8Qry4rJTA": [
			{
				"comment_id": 65,
				"body": "and so who ever wins, will visit paris ahahhah ! no grudge, no participation ! ahhh funny to see them all go die for nothing :).",
				"added": 1616150315
			},
			{
				"comment_id": 66,
				"body": "the advantage of french? no one wants to speak in anglois...",
				"added": 1616150358
			},
			{
				"comment_id": 67,
				"body": "ahahahh bremmer knows he lost !",
				"added": 1616150376
			},
			{
				"comment_id": 68,
				"body": "the face of defeat !",
				"added": 1616150390
			},
			{
				"comment_id": 69,
				"body": "no uscker china doesn't depend on usa at all ! we are on market :).",
				"added": 1616150410
			},
			{
				"comment_id": 70,
				"body": "well regulated by the ccp !",
				"added": 1616150425
			},
			{
				"comment_id": 71,
				"body": "he is so low iq.",
				"added": 1616150432
			},
			{
				"comment_id": 72,
				"body": "now he starts his fetish on \"john kerry\" miss heinz boyfuck? lolllll.... hahahahahahahahahahah...",
				"added": 1616150453
			},
			{
				"comment_id": 73,
				"body": "it's so pathetic.",
				"added": 1616150459
			}
		],
		"1616146599_1Hokap9vnjUTCeaQS91AQqUqW8Qry4rJTA": [
			{
				"comment_id": 80,
				"body": "and so let me bet : the japanese served the league of nation by invading china? will check with the date... but I remember the imperial japanese gen said it himself... as unifiying north east asia, for what? to create the block the UNO / global agenda sought to merge in their pedo feodalist serfdom...",
				"added": 1616151862
			}
		]
	},
	"comment_vote": {}
}