{
	"next_comment_id": 3,
	"comment": [
		{
			"comment_id": 1,
			"body": "Those \"duplicates\" are not technically duplicates - you merged two separate indexes, which are used in two different places (one is for one search option, one is for another) which means that there are only 4 duplicated that the user will see - which means that the script is correct.  We are not 'misrepresenting' search results either, I've tried to bring back some functionality and I'm going to be working on more stuff.  We don't use regex searching - or siterank for that matter - to keep things simple and present the user with what they want to see.  At some point in the future we'll implement search logging to put sites where they need to be on the results table, so that more popular sites are at the top.  ",
			"post_id": 18,
			"date_added": 1458974454
		},
		{
			"comment_id": 2,
			"body": "This is pretty cool, I love how Kaffiene supports other types of search indexes (both my JSON format & your simpler format) and I would love to see somebody make some sort of compressed format for indexing, especially since they're getting larger the more ZeroNet grows.  \nI may eventually convert Bwoi's naive searching into regex searching and implement some sort of algorithm for zites (i.e. peer order) but that would likely require using a database, which is quite tricky considering that the Bwoi engine is quite difficult to modify in its current state.  I may also get a blog myself for updates instead of hogging the comments section here / whatever, too.  \nIt's also pretty cool to see that you also have an autotagging script; it's a megaton better than mine is and probably ever will be, so I'll probably end up using that instead of my attempt at tagging using certain words (i.e. if it has \"blog\" in the title, give it the tags \"blog\", \"personal\") and see if I can get a better way of doing it.\n\nBwoi",
			"post_id": 23,
			"date_added": 1470682541
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"20": 1,
		"21": 1,
		"22": 1,
		"23": 1,
		"27": 1,
		"41": 1
	}
}