{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "BloxelWars!",
			"body": "http://127.0.0.1:43110/143TbAqxkbJsYtLnMSkAKjyJoQmFhp1cDR",
			"added": 1492537832
		}
	],
	"topic_vote": {
		"1_128jDCWZixae8vrVCFRf12e4MgwCiHp5Ra": 1
	},
	"next_comment_id": 8,
	"comment": {
		"30_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 1,
				"body": "add - zeropub (ebooks en español)\nhttp://127.0.0.1:43110/1DYwX4W1qfSaiihfN5gW6ahLp5332TawH5",
				"added": 1489225759
			}
		],
		"1_1MaKJotNGHhDQh1BnZCEBqU5Gwj88gFLyR": [
			{
				"comment_id": 2,
				"body": "yeah absolutely /r/place inspired. The implemented PoW in the site is pretty naive but it was fun to program!. Will do canvas bigger as soon as I figure out how to deal with the user file size limit problem.",
				"added": 1492584240
			},
			{
				"comment_id": 3,
				"body": "> [redstoneb](#comment_3_15dMbdM7c2RT9RhNTJRqzc4vYSvrSJvxyG): What PoW function are you using? It is a partial hash collision?\n\nHonestly I don't know :D\nWhat I'm actually doing is calculating the difficulty using a custom function and then the solution hash should have as many '0' as difficulty at the beginning. So, to mint a valid bloxel with dif 5 you'll need a hash like 00000a4f9276e...",
				"added": 1492593512
			},
			{
				"comment_id": 4,
				"body": "> [redstoneb](#comment_4_15dMbdM7c2RT9RhNTJRqzc4vYSvrSJvxyG): Great way to prevent spam! Kinda like Captcha but for computers, I guess. I love your site shows what we can do with Zeronet.\n> By the way, how do you handle conflicts? (Like if I edited a pixel offline but another person edited as well, and what happens when I come online?)\n\nEvery bloxel has an offset relative to the timestamp of the previous one. The difficulty function is based on this offset. The lesser the offset, the higher the difficulty. If there are two bloxels with same sequence number, the one with the lesser offset wins.",
				"added": 1492595671
			},
			{
				"comment_id": 5,
				"body": "> [redstoneb](#comment_5_15dMbdM7c2RT9RhNTJRqzc4vYSvrSJvxyG): Nice mechanism! One suggestion: the dark gray color doesn't match the original gray exactly, is that intentional?\n\nYes, it was intentional. Those are called 'god' bloxels and all have 'grey' color.",
				"added": 1492700190
			},
			{
				"comment_id": 6,
				"body": "> [redstoneb](#comment_6_15dMbdM7c2RT9RhNTJRqzc4vYSvrSJvxyG): Nice. How feasible is it to scale the website (canvas, syncing etc.)?\n\nI'm working on updating the canvas to something faster and more like /r/reddit, I think adding more bloxels to the canvas will be easy if we really need that.\nAbout syncing... I don't really know what kind of problems would appear. Most of the current problems and cheats are 'client' fault (html/js), not a protocol failure. Time will tell",
				"added": 1492851947
			},
			{
				"comment_id": 7,
				"body": "just released a new version with bigger canvas, guys!",
				"added": 1492969434
			}
		]
	},
	"comment_vote": {
		"323_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1
	}
}