{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1550266119_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1
	},
	"next_comment_id": 18,
	"comment": {
		"1527230895_1Kma1Pz9kBSHmDtK1iYtHTox14Edmx2e5f": [
			{
				"comment_id": 1,
				"body": "Agreed.\nThink is one thing. Action means much more. We can't blame people for thinking some thing illegal. But we will punish those who dare to make a move.",
				"added": 1527323245
			}
		],
		"1527176149_1D1DTxbngBSkKe6BfHPyuudBrB8ZapNjoV": [
			{
				"comment_id": 2,
				"body": "Maybe you will hate it. But I think I am a communist.",
				"added": 1527323742
			}
		],
		"1540732726_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 3,
				"body": "The price of free speech. You gotta endure such a person who is willing to spend so much time saying nonsense.",
				"added": 1540774347
			}
		],
		"1540893676_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR": [
			{
				"comment_id": 4,
				"body": "Nice idea",
				"added": 1540947280
			}
		],
		"1542267691_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 5,
				"body": "Yes, you are right. China is a huge jail. What's the point? Do you wanna set the prisoners free or let them fight against the warden?\nUnfortunately most of  the prisoners are happy with their environments. It's nearly impossible to change their minds in short notice. When the time is right, there is no need others to bother. We Chinese are very familiar to overturn their leaders. Look at our history, we don't give a shit about any Gods, high born, nobles. As long as we are not happy, we will choose a new one eventually.",
				"added": 1542274667
			},
			{
				"comment_id": 6,
				"body": "> [leftside](#comment_328_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Chinese government is spending money on building higher and higher fences around the country's boundary in order to keep its people blind from outside world. And it's transferring those technologies to the neighboring countries and even to the bloody dictatorship countries in Africa. It's poisoning the whole world.  [...]\n\nNice metaphor, except for I've read it several years ago. I don't want to persuade you or prove you anything about the evil CCP is murdering its people. Not necessary, the time will prove you are wrong. Or me.All I wanna say is that it's getting less and less efforts of posting threads in such less know anonymous network forums. Not zeronet, I2P, or any other forums.\n\nPlus, I do wanna tell you my point of view for CCP narrowing people's view in mainland China.Instead, more and more people now becoming realizing why CCP did what has to be done to make China and its people here. At least me. Not because I am blindly brainwashed by CCP. I've heard worse things compare to what you've said. But after researches of different sources(I know plenty of anti-GFW technologies), I chose to believe CCP did  a good job so far.",
				"added": 1542338253
			}
		],
		"1540124660_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 7,
				"body": "I believed you are indicating Wang Qishan\nhttps://en.wikipedia.org/wiki/Wang_Qishan",
				"added": 1544764449
			}
		],
		"1548012943_14hRA2Pze5PXYZLf8JCm9hknxLZTQ4qGqN": [
			{
				"comment_id": 8,
				"body": "Why Christ alone. Should be anti any religion.",
				"added": 1548030012
			}
		],
		"1568690664_1PwFiHiDEbu8MDK9PZe5Lt2cNg6bPYDCo": [
			{
				"comment_id": 9,
				"body": "From a Chinese perspective, Trudeau administration is quite anti-China. I doubt he will sell you to China.",
				"added": 1568729255
			}
		],
		"1569591354_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 10,
				"body": "Yes you are right. CCP is too evil. Don't mess up with them otherwise you will get hurt.",
				"added": 1570717244
			}
		],
		"1569604850_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 11,
				"body": "Maybe because they are afraid of their people.",
				"added": 1570717346
			}
		],
		"1570208803_137P7ceKGpm24X9C5mxNmp1bCkQpY8vWAh": [
			{
				"comment_id": 12,
				"body": "It's all about money. If you are rich enough, there are plenty ways to fight against GFW. For example, rent an Azure server.",
				"added": 1570717741
			}
		],
		"1569934923_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 13,
				"body": "Common, you guys don't even have enough courage to fight alone. Look at protesters in Ireland or people in middle east. If you don't want to sacrifise, for what reason other people help you?",
				"added": 1570717922
			}
		],
		"1585212415_19913irDUyBcw4rBHtdPdsMFW5vkqKBTY6": [
			{
				"comment_id": 14,
				"body": "At least 260,000 Korean are not that decent as they behaved. But who am I to blame them. I might also be the same.",
				"added": 1585366031
			}
		],
		"1586288287_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 15,
				"body": "I'm from the SFA and I confirmed what he/she stated here is the truth.",
				"added": 1586322570
			}
		],
		"1591199751_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 16,
				"body": "Yet another conspiracy theory",
				"added": 1591234920
			}
		],
		"1610987594_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz": [
			{
				"comment_id": 17,
				"body": "Blame China.\nChina China China",
				"added": 1611016344
			}
		]
	},
	"comment_vote": {
		"4_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": 1
	}
}