{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1629402955_19BXHBD1GfYpSpvdHsuHJsJ97mYpxWjUE": [
			{
				"comment_id": 1,
				"body": "> [justasking2](#comment_4_1Jov3pVU2keecPrdREqkVETsnNQMAJH9v4): Who wants to live around people who accuse you of making them ill, if you don't do as they told? [...]\n\nBy this same logic, if someone enters a conversation, having already been coughing before they join in, it should make sense that I can ask them to leave since \"no one forces you to stay around other people\", right? If they're allowed to stay, are they not infringing upon a conversation they were not originally part of? Furthermore, is there or isn't there a difference between \"breathing\" and coughing within close proximity of someone?",
				"added": 1629621931
			},
			{
				"comment_id": 2,
				"body": "> [justasking2](#comment_10_1Jov3pVU2keecPrdREqkVETsnNQMAJH9v4): I hope all like minded people can see it. This is not sustainable. It is the same reason Hitler needed the SA to throw out people who just wanted to disturb his speeches, so that nobody could hear what he wanted to say. [...]\n\nI'm sorry, how does suppression of speeches relate to this? Like, I understand that hypothetically, a person who happens to be coughing may be really adamant on talking to others in-person, but is wanting space from someone *coughing* the same as wishing to disregard their words? Couldn't a compromise be made, such as talking from a further distance, communicating via phone or internet, etc?",
				"added": 1629623385
			},
			{
				"comment_id": 3,
				"body": "> [justasking2](#comment_11_1Jov3pVU2keecPrdREqkVETsnNQMAJH9v4): No. This is not how you can live in a stable society. In order to trust other people.But any way sometimes it happens that the society falls apart and it gets us vs them.Now we are here. So get the fuck out.\n\nStill being able to talk to someone, even in-person, is the collapse of society? That seems quite marginal compared to other candidates for disorder",
				"added": 1629758964
			}
		]
	},
	"comment_vote": {
		"30_1NRVBTxrbgEFdVBNLczx4Cc6NV3H4Pykzc": 1,
		"10_1KFTNuxkQipsabR2q9XhxxTTtqn9QiSxeP": 1
	}
}