{
	"next_topic_id": 26,
	"topic": [
		{
			"topic_id": 1518969401,
			"title": "Wrapper to control ZeroNet instances running under Docker",
			"body": "Hi!\n\nI wrote a wrapper script to easily manage multiple ZeroNet instances running under Docker:\n- [The manual page.](http://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/?Post:16)\n- [The source code at Git Center.](http://127.0.0.1:43110/1FEvdSRAqTEuGpc31s9ad7rPc4jqRpeWfG/)\n\nFeel free to test, use and improve it and to send pull request. :D\n\n(I'll also really appreciate it, if you help me fixing any errors in my English on the manual page or in the help message of the script.)",
			"added": 1518969400
		},
		{
			"topic_id": 1548999855,
			"title": "What is your native language?",
			"body": "I created a bit crazy poll at ZeroPolls, containing 100 languages. Please vote! ðŸ˜Ž\n\n### [ZeroPolls: What is your native language?](http://127.0.0.1:43110/ZeroPolls.bit/?Poll:5-1GooUE19488nDwG3TdkM8seYAHct4gjkq4)",
			"added": 1548999852
		},
		{
			"topic_id": 1549435574,
			"title": "Let's join our forces to make ZeroNet wonderful place",
			"body": "Please read my propsal, that is set out in these two documents:\n\n### 1. [Why we need the ZeroNet Council](http://127.0.0.1:43110/1fzncZRMPGPBdyUBm2ATVSkRAsnvMq5VN/?Post:2)\n### 2. Draft of [The Manifest of The First ZeroNet Council](http://127.0.0.1:43110/1fzncZRMPGPBdyUBm2ATVSkRAsnvMq5VN/?Post:1)\n\nPlease share your thoughts and suggestions on the subject.\n\nYou can also read [my discussion with Kaffie](http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/?Topic:1549168166_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/). It perhaps answers some your questions.\n\nI installed a set of forums, according to my propsal:\n\n*   [Talks: General](http://127.0.0.1:43110/1fznctFebYHnmjmFZCmAWPd7nnamAy3Tg)\n*   [Talks: Politics](http://127.0.0.1:43110/1fzncJdLpbsT5eeeYP14EKSaStHhtn5LY)\n*   [Talks: ZeroNet](http://127.0.0.1:43110/1fznc4VQbbrQAf4UzHrWS6W2mpGFqXSeD)\n*   [Talks: Council's Services Support and Development](http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD)\n*   [Administration](http://127.0.0.1:43110/1fzncGxeyDpbCz1CkvBkooEDsXGFq1GfK)\n\nThe forums right now are running on the default ZeroTalk engine.\nI'm planning to improve it greatly.\nHere is [the todo list](http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/?Topic:1549014898_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/).\nAnd here is [the test version](http://127.0.0.1:43110/1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y/).\n\nThe forums are supposed to be moderated to maintain them free from spam and offtopic content. [Here are the rules.](http://127.0.0.1:43110/1fzncGxeyDpbCz1CkvBkooEDsXGFq1GfK/?Topic:1549008843_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/)\n\nI'm looking for people who are agree to help me in running and managing the forums. I'd like to invite the following users, those I guess I can trust:\n\n* anotherneko@zeroid.bit\n* binchan2@zeroid.bit\n* ekaterina@zeroid.bit\n* gitcenter@zeroid.bit\n* gomzik@zeroid.bit\n* kaffie@zeroid.bit\n* krixano@kxoid.bit\n* zalex@zeroid.bit\n\nPlease answer if you are agree to take a position, and also propose other candidates [in this topic](http://127.0.0.1:43110/1fzncGxeyDpbCz1CkvBkooEDsXGFq1GfK/?Topic:1549433471_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/).",
			"added": 1549435570
		},
		{
			"topic_id": 1561515103,
			"title": "A clone of ZeroTalk with the moderation feature",
			"body": "[In my ZeroTalk fork](http://127.0.0.1:43110/1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y/), I implemented the UI for moderators to modify and delete the content of other users.\n\n1. Clone [my forum](http://127.0.0.1:43110/1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y/).\n2. Open `data/users/content.json` in a text editor:\n   * Add the public keys of your moderators under \"user_contents\" -> \"permission_rules\" -> \".*\" -> \"signers\".\n   * ([See here](http://127.0.0.1:43110/1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y/data/users/content.json) for an example.)\n   * Sign and publish `data/users/content.json`.\n3. Moderators are able to modify or delete any content with the usual \"pencil\" button.\n\nPlease test and report any issues.\n\nSee also:\n* http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1552760858_14JMe2K9H9F9DwFi2s6tuwiQT66FY7H1dg/\n* http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1538923063_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr",
			"added": 1561515098
		},
		{
			"topic_id": 1562163868,
			"title": "Rework of the plugin AnnounceShare + new plugin TrackerList",
			"body": "## AnnounceShare\n\nhttps://github.com/geekless/ZeroNet/tree/AnnounceShare-rework\n\n* Allow sharing trackers of any supported protocols, not just `zero://`. (Right now it includes BitTorrent over HTTP(S) and BitTorrent over UDP.)\n  * The supported protocols are autodetected, not hardcoded, so the modification of the plugin is not required in the case of implementation of new protocols.\n* Working trackers are now counted on per protocol basis. The plugin tries to maintain the up-to-date list of functional trackers for each available protocol.\n* Be more conservative on removal trackers from the list. Don't delete trackers on errors if no successful connections have been established recently, in the case of the network connectivity issues.\n* Other small code refactorings.\n\n## TrackerList\n\nhttps://github.com/geekless/ZeroNet/tree/TrackerList\n\n(The plugin is disabled by default in the source tree. Should be enabled manually before running ZeroNet. The branch also contains the updated AnnounceShare, no additional merging is required.)\n\nTrackerList is a plugin, that fetches a list of trackers from any external source (URL or local file path) and adds them info the AnnounceShare list. If the trackers are functional, AnnounceShare spreads them throughout the network to other peers.\n\nBy default, it fetches the data from https://github.com/ngosang/trackerslist.\n\nThe reworked AnnounceShare is required for TrackerList to work. It is also required on a peer, looking for new trackers, in order to be able to receive non-`zero://` trackers. (The old AnnounceShare forbids other tracker protocols.)\n\nPlease test and report any issues.\n\n## UPDATE:\n\nAnnounceShare will be forked and renamed to TrackerShare.\n\nTrackerShare, TrackerList, gitcenter's PeerMessage and BackgroundProcessing will be packed together with the core and provided as a preconfigured distribution. A least, it will be available as a source archive and a docker image for Linux. (A bundle for Windows is possible too.)\n\nTwo more plugins are in development by me now as well.",
			"added": 1562163862
		},
		{
			"topic_id": 1584246912,
			"title": "ZeroTalk clones and alternatives, if you run out of the space limit here",
			"body": "* [Unlimit.Talk](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/). 2000 KB per user.\n* [NetTalk](http://127.0.0.1:43110/1LfvE91ZF18jdG3wW62Dw7NtfTZh737KPL/). 4000 KB per user. Owner: @ssdifnskdjfnsdjk.\n* [ZeroTalk Tech](http://127.0.0.1:43110/1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq/). 50 KB per user. Owner: @xcape2net.\n* [FZNC Talks: General](http://127.0.0.1:43110/1fznctFebYHnmjmFZCmAWPd7nnamAy3Tg/). 300 KB per user. Owner: me (@geekless). Administrator: @caryoscelus.\n* [FZNC Talks: Politics](http://127.0.0.1:43110/1fzncJdLpbsT5eeeYP14EKSaStHhtn5LY/). 300 KB per user. Owner: me (@geekless). Administrator: @caryoscelus.\n* [FZNC Talks: ZeroNet](http://127.0.0.1:43110/1fznc4VQbbrQAf4UzHrWS6W2mpGFqXSeD/). 300 KB per user. Owner: me (@geekless). Administrator: @caryoscelus.\n* [FZNC Talks: ZeroNet Development](http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/). 300 KB per user. Owner: me (@geekless). Administrator: @caryoscelus.\n\n(Probably, I'll add some more admins to my forums later.)\n",
			"added": 1584246905
		},
		{
			"topic_id": 1584357168,
			"title": "ZeroWiki",
			"body": "So far, we have:\n\n* [ZeroWiki](http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/). 500 KB per user. The owner is cub3@zeroid.bit, I guess. (Really not sure.) Is he/she active? \n* [New ZeroWiki](http://127.0.0.1:43110/1LX2wiouHctuUXtu5WkVM9TJJ3YoL6gAfm/). 500 KB per user. The owner is krixano@zeroid.bit, and he left the project.\n\nSeems that nobody's working on the ZeroWiki engine. Are there any forks with new features?\nAlso, if @cub3 is missing in action, and @krixano doesn't come back, we have no actively maintained wiki sites at all. I guess, 500 KB per user is really not enough in the case of wiki, where all the revisions of each page are kept as separate entries.",
			"added": 1584357160
		},
		{
			"topic_id": 1585024413,
			"title": "From Russia, With Music (my new blog)",
			"body": "Hi!\n\nWhen @aassddff had made a site with Brazil music, I thought I'd also been wanted to make a similar site for a long time, but as usual there was no time for it. So I've made a new blog:\n\n### => [From Russia, With Music](http://127.0.0.1:43110/1BUk8jGHn2wX2dnSmbfy8psmJoUf7aiRR8/)\n\nThere will be:\n\n* Patriotic Russian songs\n* WWII songs\n* Russian romance songs\n* Folk music of different nationalities from Russia\n* Modern pop, rock, alt rock etc\n* ...and maybe more\n\nI haven't added any lyrics and translations for the songs yet, but maybe I'll do it later.\n\nIf you like the idea and my selection of music, please press \"Help distribute added optional files\" in the right sidebar, ot improve the file availability. I'm connected via Tor, so visitors who don't use Tor may experience problems accessing the songs.",
			"added": 1585024404
		},
		{
			"topic_id": 1597818504,
			"title": "The centralized parts of ZeroNet",
			"body": ".\n### ZeroID\n\nCurrently, there seems to be no reliable solution for that. My drafts: http://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/?Post:41\n\n### ZeroTalk and ZeroMe Hubs\n\nWhile the major features are decentralized, the user space limit management is centralized. There is a script somewhere that runs periodically (once a month or several months, I guess) and adds some space for every user who is about to run out of space.\n\nI don't see the point in this approach.\n\nA new user comes to the forum and quickly runs out of the default 50k. S/he tries to contact to @nofish, but no luck. S/he asks others, but no one can help them. So the new user concludes that ZeroNet is inconvenient and impractical.\nS/he either leaves ZeroNet or decides to give it one more chance and registers another ID.\nThe second ID runs out of space as well.\n\nFinally, after some suffering, if a user is persistent enough, s/he gets more space \"for some reason\". In fact, no reason, just a dumb script.\n\nWhy do we need that suffering part, and why not just give a user a default megabyte or so?\nAnd why should we have this single point of failure at all?\n\nThe script doesn't solve any actual problems.\nSpammers are still able to register lots of IDs, so the 50k limit is not a problem for them at all.\nIt's just ordinary users who are in trouble.\n\nBTW, @gitcenter sucessfully tested the automated flood attack against this forum several years ago.\n\n### ZeroSites\n\nIf you navigate to ZeroSites, you see that each zite has 2 numbers: \"stars\" and \"peers\". The latter is collected by a server and injected into the ZeroSites DB in the centralized way.\nZites are ordered by \"popularity\", which is `MIN(200, peers) + star * 20`.\n\nPreviously, the peer stats were updated every few hours. Now it's long broken. I [reported the issue](https://github.com/HelloZeroNet/ZeroSites/issues/14), but no luck.\n\nZeroSites engine also has no check for the data relevance. As a workaround, if statistics have not been updated for a while, we can just ignore it. But that simple solution is not implemented.\n\nA more sophisticated way is to make a new plugin for the core engine that integrates ZeroSites DB and Bootstrapper (peer tracker) DB. So any tracker with this plugin enabled can provide the actual stats. And a user chooses to trust it or not.\n\nThis stats problem doesn't look like a big issue, but it shows what may possibly happen if the server-side part of ZeroID or ZeroTalk goes down. Such flaws mustn't be present in a decentralized network.\n\n### The default site list\n\nIt's not a centralization issue per se, but it adds some more problems to what described above.\n\nWhen a new user installs ZeroNet, s/he sees a list of \"default\" zites in the left bar. The contents of this list is controlled by a single person and not by the community. I'm really not sure how this can be addressed, and if this should be addressed at all, but the infrastructure of ZeroNet is totally centralized and is ran by a single person.",
			"added": 1597818494
		},
		{
			"topic_id": 1597936978,
			"title": "Russian opposition leader Alexei Navalny poisoned, now in coma",
			"body": "https://www.bbc.com/news/world-europe-53844958\n\nhttps://www.euronews.com/2020/08/20/russian-opposition-politician-navalny-in-hospital-for-poisoning\n\nLooks like >somebody< decided to kill Navalny before Russia turns into Belarus.\n\nIn the past, two other opposition activists were poisoned with similar symptoms. Fortunately, both survived.",
			"added": 1597936967
		},
		{
			"topic_id": 1598113485,
			"title": "ZT++: now you can change the topic sorting order",
			"body": "Just a little announce of a little update of [ZT++](http://127.0.0.1:43110/1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y/?Topic:1549373688_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/CHANGELOG+ZeroTalk+forum+engine).\n\nIf you use a forum engine to run a news site, it's often desirable to sort news by the news date itself, not by the date of the last comment. I added a simple configuration option, so now you can choose the sorting order: `last_activity` (default), `topic_creation`, `topic_author`, `comments_num`, `votes_num`.\n\nI run [OpenNews ðŸ‡·ðŸ‡º](http://127.0.0.1:43110/1Nowr5oVEdbU5ZTQBriRd2jJVj2vhsDJd4/). You can see an example of using the sorting option there. The settings are in [content.json](http://127.0.0.1:43110/1Nowr5oVEdbU5ZTQBriRd2jJVj2vhsDJd4/content.json).\n\nBy the way, previously I also added an option to adjust view of the topic list: brief (just a title of each topic), normal (the same as on ZeroTalk), long (formatted content, limited by height), full (formatted content fully). As you can see, the stickied topics are displayed as \"brief\" on OpenNews, and ordinary topics as \"normal\".\n\nIf you set topic_list_mode=full and topic_list_order_by=topic_creation, you may use the forum engine as a collective blog. The topic list will be displayed in a manner similar to what is normally used for blogs.\n\nThese settings are currently available to the zite owner only. I should add some UI for a visitor to be able to change these settings locally on the fly, but right now I'm too lazy to mess with HTML. I'm going to do this later...",
			"added": 1598113473
		},
		{
			"topic_id": 1598171387,
			"title": "Guardicore has discovered FritzFrog, a sophisticated peer-to-peer (P2P) botnet which has been actively breaching SSH servers since January 2020",
			"body": "https://www.guardicore.com/2020/08/fritzfrog-p2p-botnet-infects-ssh-servers/",
			"added": 1598171374
		},
		{
			"topic_id": 1604480176,
			"title": "name.yo spamming updates",
			"body": "@gitcenter:\n\nUpdates every few seconds. Why so often?\n\n```\n[08:54:05] Site:1NAMEz..qDNv Update for data/issuers/1M2XsD13r7opv2n1Akucd8LdPMAAhYXCwL/content.json looks valid, saving...\n```",
			"added": 1604480162
		},
		{
			"topic_id": 1616503348,
			"title": "ZeroNet development? We need new heroes! We need you!",
			"body": "Hi, guys!\n\nIn November 2020, I had been working on a patch set for ZeroNet, but the lack of spare time did not allow me to bring the work to its logical conclusion.\n\nHere is the change log draft of what has been done: https://github.com/zeronet-enhanced/ZeroNet/blob/massive-rework/ZNE-ChangeLog/ChangeLog-0.8.0.md\n\nNow, when the upstream seems to be almost dead, it's time to join forces and make an actively developed fork. There are many wonderful patches and ideas here and there on the network, but we seem to have no place to commit them to any more. So we need to move on on our own.\n\nIf you have some dev skills and motivation, feel free to contact me. https://github.com/zeronet-enhanced/ is an organization profile, and I can add new devs as \"members\" or \"owners\" for the organization.\n\nMy primary goals/interests in developing ZeroNet are:\n\n* Improving the stability.\n* Fixing the connectivity and scalability issues.\n* Implementing new transports, such as I2P. Or \"sync over Freenet\". Or maybe the offline update mode aka \"sync this node from a USB flash stick\".\n* Bringing support of more crypto algorithms besides good old Bitcoin's elliptic curves.\n* Implementing the multisign support of the root `content.json`: *right-way-this-time*. The current implementation is broken.\n* Fixing various flaws in user-level muting/blocklisting.\n* Implementing the darknet mode aka friend-2-friend mode, so one can use ZeroNet in a RetroShare-like manner.\n* Bringing support of flexible zite-level control over user space limits etc, so zite policies may at some extent be scaled and controlled by its users, when the owner abandoned it.\n* Implementing a declarative API that makes possible running a zite with dynamic AJAX updates and without executing an untrusted zite-level JS code in your browser. Running an untrusted code should be an option, not the core requirement.\n* ...etc\n\nNot my goals:\n\n* Breaking things just because they are implemented \"in a wrong way\".\n* Rewriting the engine in a shiny new programming language.\n\nP.S. Related links:\n\n* [\\[BUG\\] ZeroNet losts user data](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1616552733_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/+BUG+ZeroNet+losts+user+data)\n* [nofish implemented a misfeature for wiping inactive users (??!)](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1616648188_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/nofish+implemented+a+misfeature+for+wiping+inactive+users)\n\nUPD:\n\nSince nofish is missing for long time, I cannot consider the mainline ZeroNet forum as secure any more. We have no clue where is nofish and where are his private keys. I assume the worst: the keys are in wrong hands and the zite may be erased at any time.\n\nSo I move all the important topics related to the development [to my forum](http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/).",
			"added": 1616503333
		},
		{
			"topic_id": 1616552733,
			"title": "[BUG] ZeroNet losts user data",
			"body": "...or more precisely, it forgets syncing the data between peers in some conditions.\n\nHere's how it looks: http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/ZeroNet-lost-user-content.png\n\n```\n190 vs 239 likes\n1662 vs 2188 comments\n\n121 vs 151 likes\n335 vs 421 comments\n```\n\nAnd 2188 comments is not a final count, there may be much more lost comments behind the scene.\n\nBugreport: https://github.com/HelloZeroNet/ZeroNet/issues/2476\n\nnofish labeled the report as a enhancement request. Well, it's not about \"enhancement\", it's clearly a major bug. The current zite updating scheme is way too optimistic and doesn't work in the way it supposed to.",
			"added": 1616552717
		},
		{
			"topic_id": 1616648188,
			"title": "nofish implemented a misfeature for wiping inactive users (??!)",
			"body": "Folks, some controversial news...\n\n### ISSUE 1\n\nIf you [look here](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/data/users/content.json), you see the following data block:\n\n```\n \"user_contents\": {\n  \"archived\": {\n   \"1165u6pt5mQNFjyhMVwy6azB7bZuQGLA9b\": 1523088096,\n   \"125b8FxS36xSSCHkvZEhimvF5KPxjckS7o\": 1523088096,\n   \"127tNdRpqjPKrVbgYNJHyvHV2Hz43VApCK\": 1523088097,\n   \"128SPB2TNDuT8sxcTRZ83BaN2T72c7QHDC\": 1523088099,\n   \"128Vo1cvEvptz267w81cHfpqENkVUk8NXv\": 1523088096,\n   .\n   .\n   .\n   LOTS OF IDS HERE\n   .\n   .\n  },\n  \"archived_before\": 1523088096,\n```\n\nWhat does this block mean? Here is what documentation says:\n\n> `archived` - Delete the specified user content directory that is signed earlier than the specified timestamp (key: directory name, value: timestamp)\n> `archived_before` - Delete all user content directory if that is signed earlier than the specified timestamp\n\nMy first thought was nofish made some script for moving old data into zite-controlled files to make free room for new posts in user files. But it doesn't seems to be the case. ZeroTalk has no additional data files besides user-provided ones.\n\nWhich means that any users that had no activity sinse `\"archived_before\": 1523088096`, i.e. **Apr 07 2018**, are erased from the forum. No posts, comments, likes, anything. Any topics that were created by those users, aren't accessible any more, even if those topics contain long and meaningful discussions.\n\nWhat we can guess is that there is some script somewhere, that runs, or used to run, periodically and updates the `archived_before` field, wiping all the data of inactive users. We have no clue if the script is still active or not and when it gets activated the next time.\n\nThe only way to make sure your posts are safe is to visit the forum every few months and post/like anything in order to renew your activity status. Wow! Not sure about you guys, but for me it's definately not a thing I expect from a p2p storage that was designed to keep data almost forever. Correct me if I'm wrong, but this \"feature\" doesn't documented anywhere in the forum.\n\n### ISSUE 2\n\nThe next level:\n\nThe misfeature was misused for banning users from the forum. You can ask, what happens if one assigns for a user an archivation date in the future? ZeroNet wipes the data and also refuses accepting and relaying user's data until the specified date in this case. And this means: a temporary ban.\n\nOf cause one also can \"archive\" (ban) a user forever taking a date in a distant feature:\n```\n\"128Vo1cvEvptz267w81cHfpqENkVUk8NXv\": 9999999999\n```\n\nThe latter is no news, since the ban can also be set up by user-space control policies. (No space -> no posts -> ban). But the old kind of ban is pretty straightforward: a user is either banned entirely or not. No temporarily ban is possible (at least, without additional scripts). So it is intended primarily for bots etc, and not for \"punishing' users. The temporary ban opens up new opportunities for censorship.\n\nI am not claiming that nofish applied the temporal ban for any user. It looks more like he used to block only bots. But he (or an owner of any zite) has the capability of doing that.\n\n### OK, WHAT WE SHOULD DO?\n\nMy question is, is this \"archivation\" feature more for good or for evil? What should I do with it in my fork?\n\nKeep it as is, since it can be used for implementing the real archivation of the user generated content?\n\nOr disable it, as it can be easily misused intentionally or accidentally?\n\nP.S.\n\nMaybe \"the depth of diving into the past\" should be controlled by a user? User will have an option of choosing, if s/he wants to download a zite with the full history or from a selected date.",
			"added": 1616648171
		},
		{
			"topic_id": 1616666439,
			"title": "What if the original nofish's infrastructure is lost?",
			"body": "http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/?Topic:1616666284_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/",
			"added": 1616666421
		},
		{
			"topic_id": 1616688942,
			"title": "FZNC Talks",
			"body": "Folks, I'd like to invite you to my forum which is an alternative of ZeroTalk with more features and more space by default.\n\n[FZNC Talks](http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD) is a collection of forums I run as a part of the [FZNC initiative](http://127.0.0.1:43110/1fzncZRMPGPBdyUBm2ATVSkRAsnvMq5VN).\n\nThere are 4 major sections in the forum:\n\n* [General](http://127.0.0.1:43110/1fznctFebYHnmjmFZCmAWPd7nnamAy3Tg)\n* [Politics](http://127.0.0.1:43110/1fzncJdLpbsT5eeeYP14EKSaStHhtn5LY)\n* [ZeroNet Support](http://127.0.0.1:43110/1fznc4VQbbrQAf4UzHrWS6W2mpGFqXSeD)\n* [ZeroNet Development](http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD)\n\nSome highlights:\n\n* Each section is implemented as a separate zite, so you don't have to seed sections you are not interested in.\n* 300KB per user in each section by default.\n* The forums are powered by [ZeroTalk++](http://127.0.0.1:43110/1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y/):\n  * Media embedding is supported, including images, audio and video.\n  * The search bar with advanced filtering options.\n  * More details in [the manual](http://127.0.0.1:43110/1fznc4VQbbrQAf4UzHrWS6W2mpGFqXSeD/?Topic:1616686869_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/).\n  * Yet more details about differences from the classic ZeroTalk are in [dev change log](http://127.0.0.1:43110/1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y/?Topic:1549373688_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/).\n* The forum is supposed to be moderated. Inappropriate content is to be removed in accordance with [the forum rules](http://127.0.0.1:43110/1fzncGxeyDpbCz1CkvBkooEDsXGFq1GfK/?Topic:1549008843_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/).",
			"added": 1616688923
		},
		{
			"topic_id": 1634848133,
			"title": "I'm back and keep working on my ZeroNet fork",
			"body": "Hi! I integrated the anonymoose's TORv3 patch in my branch and keep working on other features:\n\nhttps://github.com/zeronet-enhanced/ZeroNet/commits/massive-rework\nhttps://github.com/zeronet-enhanced/ZeroHello/commits/master\n\nI'm digging ConnectionServer and FileServer implementation attempting to improve the networking facilities. Anyone now working on other forks? We can join forces and prepare the next ZN release together.\n\nAny actual patches, pull reqs etc?\n\n@styromaniac\n@zeroseed\n@anonymoose",
			"added": 1634848113
		},
		{
			"topic_id": 1635415504,
			"title": "PoW-based size limits",
			"body": "http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/?Topic:1635414903_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/+idea+PoW+based+size+limits",
			"added": 1635415483
		},
		{
			"topic_id": 1635444258,
			"title": "The oldest not updated sites in ZeroNet",
			"body": "http://127.0.0.1:43110/1fznctFebYHnmjmFZCmAWPd7nnamAy3Tg/?Topic:1635443729_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/",
			"added": 1635444236
		},
		{
			"topic_id": 1635496137,
			"title": "0net-preview.com by @zeroseed",
			"body": "Made a pinned topic on my forum dedicated to @zeroseed's proxy:\n\nhttp://127.0.0.1:43110/1fznc4VQbbrQAf4UzHrWS6W2mpGFqXSeD/?Topic:1635495807_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/",
			"added": 1635496114
		},
		{
			"topic_id": 1635503415,
			"title": "How many sites do you host?",
			"body": "> 2.3 GB in 737 sites",
			"added": 1635503391
		},
		{
			"topic_id": 1635682514,
			"title": "Should the forum engine support more kinds of markup languages besides Markdown?",
			"body": "Possible options:\n\n* HTML (limited safe subset)\n* Good old BBCode\n* [Textile](https://en.wikipedia.org/wiki/Textile_%28markup_language%29)\n* [reStructuredText](https://en.wikipedia.org/wiki/ReStructuredText)\n* [AsciiDoc](https://en.wikipedia.org/wiki/AsciiDoc)\n* ...?",
			"added": 1635682489
		}
	],
	"topic_vote": {
		"1514422899_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"1535753075_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": 1,
		"1535817841_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1536118400_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"1539303530_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": 1,
		"1548974921_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7": 1,
		"1549416429_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1549540803_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1549554952_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1556161291_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": 1,
		"1562634059_1Mm1ztyaX85grxg2uu8KUWa8MiJi1dG2GK": 1,
		"1583768669_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1564701974_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1583786953_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": 1,
		"1582469629_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": 1,
		"1583926359_1G9KPmTFFXgarsKRjpPuvRd13mYf8aDm3E": 1,
		"1567156332_1BDuQk2j7RCQKqK4xyPzNLsrNDH6kAXF2q": 1,
		"1548256806_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1585071681_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"1594775906_1ufDwJisEDriKQxYJSz2HuUhgqAG15JyL": 1,
		"1634223386_1NAbpFqUHZXi4CmoA2v9pZrRrXNwvAJz8b": 1
	},
	"next_comment_id": 323,
	"comment": {
		"1522756617_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q": [
			{
				"comment_id": 2,
				"body": "You can also try my [wrapper to control ZeroNet instances in Docker](http://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/?Post:16)",
				"added": 1522771164
			}
		],
		"1528039084_1NEAivkF2GyHcnRQfJjahZD5XyWfJv1a1W": [
			{
				"comment_id": 4,
				"body": "> [leftside](#comment_275_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): But there's no way for the others to distinguish those users with the same names, isn't there??\n\nEach user has an unique address, which is used to verify the signed content. For example:\n\n    leftside@zeroid.bit: 16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm\n\nIt is not possible to use the same address without knowing your master seed.",
				"added": 1535695622
			},
			{
				"comment_id": 5,
				"body": "> [leftside](#comment_276_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): For example, on the article list in ZeroTalk, others can't recognize who's who.\n\nThe user ID address is displayed when you hover the mouse over nick, but that's all. We probably need something like https://jdenticon.com/ for visual representation of the address.\n\nI also think, if 2 or more users have the same nick, the site engine should display their full ID in the form of `user@provider:address`.",
				"added": 1535698906
			},
			{
				"comment_id": 6,
				"body": "> [gitcenter](#comment_323_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): By the way, ZeroTalk colors the usernames (at least in comments) based on the address.\n\nHaving the ID provider's private key (as in KaffieID case), you can easily brute force the color. You do not need to be absolutely accurate, any close color will fit. I believe, it will be much harder against a good identicon implementation.",
				"added": 1535706886
			},
			{
				"comment_id": 7,
				"body": "> [gitcenter](#comment_323_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): By the way, ZeroTalk colors the usernames (at least in comments) based on the address.\n\nOops. It is based on the user name, not the address:\nhttps://github.com/HelloZeroNet/ZeroTalk/blob/master/js/TopicShow.coffee#L181",
				"added": 1535719183
			},
			{
				"comment_id": 8,
				"body": "The same for ZeroBlog. Should we report the bug?\nI'll definately fix it my ZeroBlog++. I'm working on implementing the user profile pages right now.",
				"added": 1535719535
			}
		],
		"1535817841_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 9,
				"body": "Do you mean this kind of prototype? Sure, it works. :)\n\n```\n* | |\n--+-+--\n  | |\n--+-+--\n  | |\n```",
				"added": 1535818092
			},
			{
				"comment_id": 10,
				"body": "> [gitcenter](#comment_331_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): @geekless Can you please try it?\n\nYeah, but I have to rebuild the docker image first)",
				"added": 1535818665
			},
			{
				"comment_id": 11,
				"body": "> [gitcenter](#comment_332_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): ÐÑƒ Ñ‚Ð¾Ð³Ð´Ð° Ð¶Ð´ÐµÐ¼ :)\n\n\"Please wait till someone wants to play.\"",
				"added": 1535819312
			},
			{
				"comment_id": 12,
				"body": "> [gitcenter](#comment_333_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Ð’Ñ‹ Ð²Ñ‹Ð±Ñ€Ð°Ð»Ð¸ ZeroID?\n\nÐ£Ð¶Ðµ Ð¿Ð¾Ð´ÐºÐ»ÑŽÑ‡Ð¸Ð»Ð¾ÑÑŒ.",
				"added": 1535819439
			},
			{
				"comment_id": 13,
				"body": "> [gitcenter](#comment_334_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Ð¢Ð°ÐºÐ¾Ðµ Ð¾Ñ‰ÑƒÑ‰ÐµÐ½Ð¸Ðµ, Ñ‡Ñ‚Ð¾ Ð’Ð°ÑˆÐ¸ Ñ„Ð°Ð¹Ð»Ñ‹ Ð½Ðµ Ð´Ð¾ÑˆÐ»Ð¸ (data/users).\n\nÐ¢Ð¾Ð³Ð´Ð° Ð¼Ð½Ðµ Ð½Ð°Ð´Ð¾ ÐºÐ°Ðº-Ñ‚Ð¾ Ð¿Ñ€Ð¸Ð½ÑƒÐ´Ð¸Ñ‚ÐµÐ»ÑŒÐ½Ð¾ ÑÐ´ÐµÐ»Ð°Ñ‚ÑŒ sitePublish",
				"added": 1535819731
			},
			{
				"comment_id": 14,
				"body": "> [gitcenter](#comment_335_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): ÐŸÐ¾Ð¿Ñ€Ð¾Ð±ÑƒÐ¹Ñ‚Ðµ Ð¿Ð¾ÑÑ‚Ð°Ð²Ð¸Ñ‚ÑŒ \"This is my site\" Ð¸ Ð¿Ð¾Ð´Ð¿Ð¸ÑÐ°Ñ‚ÑŒ data/users/.../content.json Ð² ÑÐ°Ð¹Ð´Ð±Ð°Ñ€Ðµ. ÐžÐ½Ð¾ Ð²Ñ€Ð¾Ð´Ðµ Ñ€Ð°Ð±Ð¾Ñ‚Ð°ÐµÑ‚ Ñ Ð¿Ð¾Ð»ÑŒÐ·Ð¾Ð²Ð°Ñ‚ÐµÐ»ÑŒÑÐºÐ¸Ð¼Ð¸ Ñ„Ð°Ð¹Ð»Ð°Ð¼Ð¸.\n\nÐ¯ Ð¿Ð¾Ñ‚Ñ‹ÐºÐ°Ð» Ð² Ð½Ð°ÑÑ‚Ñ€Ð¾Ð¹ÐºÐ¸ Ð°ÐºÐºÐ°ÑƒÐ½Ñ‚Ð°, Ð³Ð¾Ð²Ð¾Ñ€Ð¸Ñ‚, Ñ‡Ñ‚Ð¾ Ð¾Ð¿ÑƒÐ±Ð»Ð¸ÐºÐ¾Ð²Ð°Ð½Ð¾ 1 Ð¿Ð¸Ñ€Ñƒ Ð¸Ð· 1.",
				"added": 1535819847
			},
			{
				"comment_id": 15,
				"body": "What is amazing is how much nice projects you develop here in ZeroNet!\n\n> [gitcenter](#comment_339_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): And very fast!\n\nWell, having just 2 peers. It is just a direct connection))",
				"added": 1535820253
			},
			{
				"comment_id": 16,
				"body": "What library do you use for the user icons? `jdenticon`?",
				"added": 1535820508
			},
			{
				"comment_id": 17,
				"body": "> [gitcenter](#comment_342_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): That's for security. If you see that an icon is different from the one you usually see, it means that it's not your friend.\n\nðŸ‘\n\nI think, it can became a good de-facto standard to be used in blogs, boards and other media here. We just should have some consensus about the exact input format and the library version (in case it produces different results in different releases).\n\nI've just been thinking about embeding it in my blog engine.",
				"added": 1535820940
			}
		],
		"1538835755_129GZPA7VpPa3YaRRW2ani34CaowY5hYB8": [
			{
				"comment_id": 18,
				"body": "I'm currently working on various zeroblog improvements.\n\nWhat do you exactly mean by \"Admin panel\"?",
				"added": 1538841096
			}
		],
		"1538923063_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 19,
				"body": "> [nofish](#comment_1197_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Yes, the site owner can delete and edit any content on the site.\n\nOops. But it means the site engine should display some warning when the user's data is signed with the site owner's key.",
				"added": 1538994047
			},
			{
				"comment_id": 20,
				"body": "> [nofish](#comment_1198_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): The site owner can also modify the displayed content with javascript, so we have to accept: the site owner has total control over the content displayed on the site.\n\nAnyway, it should be good to indicate that the data was moderated, just like it is done on clearnet websites.\n\nOn the other hand, if we assume the site owner's bad intention, we can always check the signs with 3-rd party tools.",
				"added": 1538997813
			}
		],
		"1539303530_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [],
		"1546939398_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 22,
				"body": "ZeroNet **is able to use** the existing BitTorrent tracker infrastructure to find the peers. ZeroNet connects to the trackers and requests peers for zites as if zites were usual torrent files.\n\nZeroNet **is also able not to use** any BitTorrent trackers, since it implements its own tracker protocol as well. (That one is more suitable for ZeroNet needs, since it can be used to locate peers behind TOR.)\n\nZeroNet has nothing to do with the BitTorrent file transfer protocol. ZeroNet file transfer protocol is [this](http://127.0.0.1:43110/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/help_zeronet/network_protocol/).",
				"added": 1548091541
			}
		],
		"1548825111_14uRvph7yp9ZaBRpJMJGZABwVu56N1AMwU": [
			{
				"comment_id": 23,
				"body": "> [leftside](#comment_512_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): You can't say there's no islamist or no pedophile in ZeroNet since you can't reach the site if no one tells  the address, theoretically.\n\nYou can run the tracker plugin, so you probably see 99% addresses in its database, theoretically. ;)",
				"added": 1548899054
			},
			{
				"comment_id": 24,
				"body": "> [leftside](#comment_513_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): I knew that and many commented about that before, but have never tried it.Can u show the process how to install the plugin and how to browser 99% addresses in detail? thanks.\n\nI haven't tried it either, lol. I should try running it on a host with a public IP, but I have not much free time now.",
				"added": 1548914206
			}
		],
		"1549178487_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [],
		"1549416429_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 26,
				"body": "If you remove the permissions, all the user-generated data will be removed.\nIt is not a \"freeze\", but a kind of full reset.",
				"added": 1549425688
			},
			{
				"comment_id": 27,
				"body": "The freezing procedure is kinda complicated.\n\nIf you want to keep all the user generated content, you should do the following steps (theoretically, I've never tested it) :\n\n1. Find all `data/users/*/content.json`-s and resign each manually, using the site owner key.\n2. Delete `data/users/content.json`.\n3. Delete `data/users/content.json` from the `include` section of the root `content.json`.\n4. Add all `data/users/*/content.json`-s to the `include` section.\n5. Sign the root `content.json`\n\nThe purpose of those steps is to transfer the ownership of all the data under `data/users/*/*` from users to the site owner. So the files will be kept and not removed from the network, and at the same time, users cannot modify them.\n\nWell, if you make some mistakes on any steps, the data will be lost.\n\n**Edit: Modified the step 4. Looks like the initial idea was incorrect.**",
				"added": 1549426174
			},
			{
				"comment_id": 28,
				"body": "> [kaffie](#comment_732_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Oh. Does the data get removed if you remove permissions? \n\nIf you remove the permissions for the certificates, ZeroNet consider all the files that are signed by the certificates as invalid. Not sure if it removes them from the file system instantly, but for sure it stops transferring them over the network and displaying the content in the UI.",
				"added": 1549426446
			},
			{
				"comment_id": 29,
				"body": "Well, looks like we need a feature to set the check-sum of the secondary `content.json`-s from the master one. That allows freezing the 3rd party data without the need to resign it under the master key.\n\nBut they'll say me again, that I'm trying to establish the censorship in the network.",
				"added": 1549426695
			},
			{
				"comment_id": 30,
				"body": "> [leftside](#comment_524_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): I'm just thinking of designing timestamp based hub system\n\nOne of the drawbacks of the nofish's archiving approach is the need of the central server, that archives the data on schedule. The timestamp based hub system probably solves that issue. \n\nThe other approach I think of is the combination of optional and non-optional files, that is managed by a user (probably, automatically, by the forum software, not manually). New posts and comments are kept in non-optional `data.json` and old ones are moved to a set of optional `data-{timestamp}.json`-s. The non-optional limit can be set relatively small, and the optional one can be large (many gigabytes?).\n\nA site visitor can set a limit, how old data files he/she wants to download in order to browse the old topics.\n\nThat approach requires no server and no need to connect new hubs. Users manage the data by themselves in transparent way.",
				"added": 1549443708
			}
		],
		"1545308490_1CSyXuUPje7aUipDKqm3xhm6BKH3SjDZUu": [
			{
				"comment_id": 31,
				"body": "> [quantumworld](#comment_225_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I know I will get allot of flack for saying this but I do want a timed posting system.  I had this on my blogs and on tweetdeck when I used it. It allowed timed posts. However I would have its output as saying that it was a timed post. Or a pre recorded post. I think this would give a nice add on for new content posting and also for going live on content posting.  (I am going to go hide now for making this post for a week or two.. lol)\n\nThat can be easily implemented. As long as you are okay about the fact that timed posts are just hidden from the UI, but can be viewed in the data file.\n\nThe ZeroHello news feed hides posts from the future. ZeroBlog displays them by default (at the top of the list), but can be easily patched to hide them too.",
				"added": 1549523230
			}
		],
		"1549554952_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 32,
				"body": "Good old `sed` is still helpful, lol. Vivat, Unix!\n\nThe trouble is implementing the JS part of the idea.",
				"added": 1549561600
			},
			{
				"comment_id": 45,
				"body": "> [oncatcoaster](#comment_26_155V1pDJWxxohR8eNgocGarkipstcSEARJ): NO! this require to you resource like VPS and you need to maintain that.\n\nThat's not necessary, since ZeroNet doesn't require such level of connectivity as conventional server applications do.\n\nI run my laptop almost 24/24h 7/7d, with short offlines when my ISP have some problems or when I install updates. So a group of volunteers can run a kind of cluster with truly 100% online.\n\nAnyway, I also pay for a VPS just $6 per month, so it's not a big problem. If the only thing you need is a simple script, almost any hardware will do.",
				"added": 1549690863
			},
			{
				"comment_id": 46,
				"body": "> [leftside](#comment_557_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): By the way, is VPS to be trusted enough to deal with site administrator's private key for zeronet??\n\nIt is possible to use [a secondary key](http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/?Topic:1549045300_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/) there.\n\nYou can add a key, that can be used to sign a non-root `content.json`, and place it on the VPS. If the key is leaked, you can revoke it and restore the zite from a backup.",
				"added": 1549691305
			},
			{
				"comment_id": 47,
				"body": "leftside, please also read my reply [here](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1549631999_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm).\n\nKrixano tried to run a decentralized cert provider, but he found no way to really distribute the signing procedure over partially trusted nodes.\n\nI guess, the issue can be easily solved, if we run not **cert providers**, but providers of the \"it's not a bot\" verification. Any number of those providers can run independently, and any number of \"not-a-bot\" signatures can be added to user-signed data.\n\nIt requires support from the Zeronet core, but I guess it's worth that. And in meantime, we can run the verification checks on the level of particular zites to test the idea.",
				"added": 1549691886
			}
		],
		"1549631999_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 33,
				"body": "> PS: Where on earth @blurhy has gone??? He's a specialist on this field! Where's @binchan?\n\n+1",
				"added": 1549634859
			},
			{
				"comment_id": 34,
				"body": "> Introduction of CAPTCHA for the new users.\n\nIt should be implemented on the ID provider's side, not on a particular zite.\n\nAnyway, a provider should be a centralized thing, so it can run as an .onion service and interact with users in usual client-server way.",
				"added": 1549635064
			},
			{
				"comment_id": 35,
				"body": "Your catcha doesn't solve the spam problem, if a spammer can create any number of accounts. It is possible to cause the DoS, attacking your data/users/content.json via your bot.\n\n>  [leftside](#comment_534_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): without the need of changing the source code of zeronet.\n\nWhy does running a provider require changing the source code of zeronet?",
				"added": 1549636112
			},
			{
				"comment_id": 36,
				"body": "> And the bot will just set the default max_size property of the every new users to zero\n\nThat is what I told about.\n\n\n```\n   \"16APV8RqRHmu7Az39JLALAap8PKoJ4rAov\": false,\n```\n\n49 bytes per ban. Not so much, but it requires 49 MB for one million ban records.\n\nEvery zite has its own `data/users/content.json`, so we can attack many zites in parallel.\n\n100 zites -- 4900 MB.\n1000 zites -- 49 GB.",
				"added": 1549637926
			},
			{
				"comment_id": 37,
				"body": "> [leftside](#comment_537_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Just put them in LZ4 symlink\n\nDoes Zeronet support compressed content.json?\n\n49 GB, consisting mostly of random characters in auth_addresses. Not so much to compress.\n\n> and remove those suspicious users from the list periodically\n\nSo they can freely spam.\n\n> [leftside](#comment_537_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Just put them in LZ4 symlink and remove those suspicious users from the list periodically.Solved.\n\nNo, it's not how it happens on clearnet.\n\nOn Clearnet, if a site refuses registration, it costs no space in the DB for the site. The space is spent only for confirmed registrations. On ZeroNet, it's opposite.",
				"added": 1549638429
			},
			{
				"comment_id": 38,
				"body": "> No matter it is clearnet site or zeronet site,\n\nIt does matter, since those MBs or GBs of your ban lists should be kept on EVERY Zeronet node.\n\n> u have to pay the cost to deal with this kind of attacks.\n\nThe cost of network throughput and CPU performance, not storage space.\n\nInstead of just not signing certificates for automated registration, you are trying to fight the enemy, when it already gets inside of your system.\n\n> You're exaggerating too much, aren't u? :)\n\nParanoia is a necessary trait, when you deal with IT security. Anything that is technically possible to be used against you, for sure will be used against you someday, when you get somewhat popular.",
				"added": 1549640079
			},
			{
				"comment_id": 39,
				"body": "> No, no, no.. if the bot distribute DDoS attacks into thousands of signup sites, all those sites will be stored and shared only among the attackers' PCs not among innocent users'.\n> Existing users have nothing to do with those signup site to visit or download.\n> All those MBs or GBs will be burdened on the attackers PCs.\n\nAre you aware of how the user-signed data is implemented on ZeroNet? `data/users/content.json` must be present on every computer, or else you just can not see any user generated-data on the zite.\n\nOn the other hand, an attacker doesn't even need to download any files from attacked zites. It may just be a python script, that generates cert-signed data on the fly and send it over the network. (in rotation, for each of millions certificates it has)\nIf other nodes answer with an error code, it means the give auth_address is banned, and if they accept the data, the address isn't banned.",
				"added": 1549640949
			},
			{
				"comment_id": 40,
				"body": "> Go read again.\n\nI've re-read:\n\n> If the user without a paired key for that unique HTML page for him tries to post or vote in the site, in the beginning his post will be uploaded to the peers' PCs. But the bot will detect this activity and will mention this user while replying him with the link to the captcha which is generated for him as mentioned above.\n\nSo, what I get is that any certificate has a default non-zero size limit. On the target zite, not on the signup zite.\n\nIf not, please explain, how it can be possible to post anything on the peers.",
				"added": 1549641722
			},
			{
				"comment_id": 41,
				"body": "So users can not post anything by default on the target zite?",
				"added": 1549641971
			},
			{
				"comment_id": 42,
				"body": "> [leftside](#comment_544_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Unless the users make correct answers to the CAPTCHA for each of them.\n\nWhich technically makes little difference from running a separate cert provider. And for a provider, I guess, we already have some software. (Is the ZeroID's server side open-sourced? I haven't checked out...)\n\n> All the heavy content.json file will be shared among the ATTACKERS, NOT existing users.\n\nYou don't need to keep any 3rd-party data in order to post updates on other peers. Just patch your Zeronet instance not to check allowed addresses.",
				"added": 1549642322
			},
			{
				"comment_id": 43,
				"body": "OK, got your point.",
				"added": 1549643788
			},
			{
				"comment_id": 44,
				"body": "> [kaffie](#comment_772_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Anyone who knows me should know my position on this by now. I'm opposed to any sort of centralized captcha. Decentralized captchas or pow is fine, provided it can be done without a centralized authority. I made KaffieID explicitly so that the backend server was not needed and people can still use zeronet without connecting to it. [...]\n\nI'm thinking of having various providers, that can be applied to the same ID.\n\nInstead of having just single `cert_sign`, a user can have many signs from different centers, where the verification is done with captcha, or manually, or somehow else. All the signs are listed in `data/users/auth_address/content.json`, and if at least one is trusted by the zite owner, the user is allowed to publish data.",
				"added": 1549683971
			}
		],
		"1552760858_14JMe2K9H9F9DwFi2s6tuwiQT66FY7H1dg": [
			{
				"comment_id": 48,
				"body": "> [legacy](#comment_7_168mhtccHKUEXnMvCGV8VRbBeC81WmaB87): Doesn't that contradict the point of zeronet?\n\nNo, it doesn't contradict. Moderation is totally possible, since there is nothing in the ZeroNet core engine that can prevent it. It is just not implemented in the ZeroTalk UI.\n\nIf you want no admin, moderator, government etc to be able to censor you, block you or modify your posts, run your own zite. That is the point.",
				"added": 1561462750
			},
			{
				"comment_id": 49,
				"body": "> [quantumkitty](#comment_202_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): i think that given the nature of ZeroNet databases, it might be hard to do without having two people (your moderators in this case) share the same private key.\n\nIt can be easily achieved by adding the keys to the list of allowed signers.\n\nFor example: http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/data/users/content.json â€” there are 2 signers there who can sign any files in the data/users/ subdirectory.",
				"added": 1561463099
			},
			{
				"comment_id": 50,
				"body": "> [xcape2net](#comment_4_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): If we wanted moderation, we would be on reddit, were we can be shadow-banned without any explanation given.\n\nYou post it here on ZeroTalk, where the admin can ban you at any moment lol. RTFM.",
				"added": 1561464452
			},
			{
				"comment_id": 51,
				"body": "> [xcape2net](#comment_50_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): If the domain name provider of my clearnet website decides to revoke my domain name in order to take down my site, then I just get a new domain name with another provider under a fake identity and put my site right back up with a new domain name. So, how does running a ZeroNet zite give me any real protection that running my own clearnet website doesn't, other than site name continuity?\n\nWhat's the point of a website that keeps being shut down over and over again? You consider it pure theoretically, and we have it in practice in Russia. Many popular websites were blocked in that way. Online libraries, opposition media etc. There's no point of a media that has no stable domain name, it is not visible by search engines and so on. Finally, the law now provides the conception of \"forever ban\" for a illegal site, so any copies on any domains are to be immediately blocked once noticed.\n\nOn the other hand, ZeroNet sites are addressed by bitcoin addresses, so that is pure math, and it cannot be banned by any government as long as they cannot ban math calculations. It is also not possible to shut down the hosting, since the site is hosted by a large number of users located all over the world in different jurisdictions. If at least one copy remains available, there again will be dozens of it soon.\n\nZeroNet provides the ability to keep the data potentially forever as well. It no longer matters that your hoster is down for some reason or you forgot to pay for the next month or your bank delayed the transaction. It also doesn't matter if you have lost interest in your websites, or hospitalized, or maybe you died, who knows. ([balancer73's zites still keep working six months after his death](http://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/?Post:45) and will probably work as long as we have any compatible browser to visit them.)\n\nZeroNet is also a kind of transport to be used in the poor connectivity conditions. Updates can be delayed for any time, but never lost and to be transmitted once the connection is possible. They can be transmitted via 3rt party peers by many hops, and finally you get them. ZeroNet-like network is probably the only possible kind of communication [in the deep space](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/1549542994).\n\nWell, in my opinion it is absolutely clear that ZeroNet is the future and the client-server websites are a soon-to-be-obsolete technology.\n\n> Also, given that ZeroSites could refuse to put a link to your zite, how would you let people know where your zite is?\n\nThat is the issue. I see no technical way to resolve it. I think we need many different zite directories run by different people, who hold different political views, religions etc, so a zite hardly to be banned in all the places. There at least are ZeroSites, 0list.bit, ZeroCentral etc.",
				"added": 1561475618
			},
			{
				"comment_id": 52,
				"body": "> [ssdifnskdjfnsdjk](#comment_855_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I assume it is the one i see in the address bar when i open that person ZeroMe profile, zerotalk topic or hover over his username here on zerotalk? In your case 1Goo... right ?\n\nYeah.",
				"added": 1561484194
			}
		],
		"1561515103_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 53,
				"body": "> [qspitzer](#comment_20_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX): I feel like this is a bad idea. ZeroNet was created to prevent censorship, and moderating what other's post seems like it will lead to ZN becoming like the rest of the clearnet\n\nThe site owner here on ZeroNet has the full control over the site in the pretty same way as in clearnet. The topic is not about idea, it's about UI. @nofish designed the engine in that way, he just didn't code some UI for ZeroTalk. I did, because I hated incomplete features.\n\nif you don't want someone to censor you, run your own zite. That's how it works.",
				"added": 1561517000
			},
			{
				"comment_id": 57,
				"body": "> [xcape2net](#comment_62_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): people who want to have the freedom\n\n\"want to have\" or \"do have\"? lol",
				"added": 1561548688
			}
		],
		"1561528142_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 54,
				"body": "ZeroNet has no means to protect from spam at all. Some glitches in UI don't matter, while you are able to generate and sign a throusand of posts and comments in a millisecond.",
				"added": 1561528537
			},
			{
				"comment_id": 56,
				"body": "> [filips](#comment_36_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): That glitches in UI shouldn't happen. User can do this by mistake.\n\nSure! It's a usability issue and should be fixed.\nWhat I mean is that this particular bug is not a security issue per se. Unfortunately we now have no way (PoW-based or other...) to prevent actual spamming.",
				"added": 1561541523
			}
		],
		"1561523274_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 55,
				"body": "> can be tricked into deleting videos by pro-censorship actors by them pretending they would be seeding videos in your stead but delete or go offline once you are no longer a seeder \n\nYep, that should be taken into account designing various \"smart\" seeding algorithms. \"Smart\" stuff won't work in that way. Thanks for the reminder.",
				"added": 1561528864
			}
		],
		"1561542721_1KuQZvrUnzurrxTvTnjVzYXko33dVHyz3V": [
			{
				"comment_id": 59,
				"body": "Multiple instances of ZeroNet work just fine under the Linux containers. But I guess the topic starter runs Windows. Does Windows have any containerization software, suitable for running ZeroNet? There should probably be something similar...",
				"added": 1561555167
			},
			{
				"comment_id": 60,
				"body": "> [hellfire](#comment_1_1KuQZvrUnzurrxTvTnjVzYXko33dVHyz3V): I'm running ZeroNet on Linux but i'm writing a few decentralized apps for Windows that create zites on the fly and use ZeroNet in it's Appdata directory. If the end user has an instance of ZeroNet running the site gets also added into his/her directory as well.\n\nHow does your app communicate with its private ZeroNet instance?",
				"added": 1561556977
			}
		],
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 61,
				"body": "Way too radical proposal.\n\n> This means that, if nofish gets hacked (which wouldn't be a surprise to be honest), ZeroHello code can be changed to destroy the whole network. [...] Give private keys from ZeroHello, ZeroUpdate, ZeroMe, ZeroTalk and probably a few other sites to the most reliable users.\n\nSo you'd like to increase the attack surface. Is that actually a solution?\n\n> multisign support\n\n1. The multisign support was broken, when I checked it the last time.\n2. It makes no sence, since the master key is still master key, and it can be used to force the update. And still if the master key is leaked, all the network is under attack, as you described above.",
				"added": 1562007709
			},
			{
				"comment_id": 62,
				"body": "> [gitcenter](#comment_491_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Do you know a better solution? \n\nTo solve problems as they appear. I'm for evolution, not revolution.\nForks and alternative distributions can solve some problems. And if they won't be very popular, they are not very good. ;)",
				"added": 1562008312
			},
			{
				"comment_id": 63,
				"body": "> [gitcenter](#comment_491_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): There will be no master key with the new implementation.\n\nIf you see a bitcoin address, someone have a private key of it. Are you going to change the addressing model? That will be an incompatible network.",
				"added": 1562008499
			},
			{
				"comment_id": 64,
				"body": "> [gitcenter](#comment_496_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): That will be changed a little. I.e., the site owner will be able to send a request to mark that the site is now multisign-only. After that, the master key is invalidated.\n\nTo send a request *where*? To `content.json`?\n\nJust imagine a situation:\n\nI send `content.json` (to several peers), that claims the zite should be signed by keys *A, B, C* from now, and a millisecond later I send `content.json` (to another set of peers), that claims the zite should be signed by keys *D, E, F*.\n\nOkay, now we have 2 incompatible versions of the zite, with different content and different signers. Peers are splitted into 2 camps: who seed the first one and who seed the second one; and each camp considers the other camp's version as \"wrong\".\n\nThat's not a sound solution. As I said in the previous discussions, bitcoin addresses are pure math, so we can trust them in the same way as we can trust arithmetic operations. There's no blockchain, web-of-trust, a certificate authority etc, which all are human-dependent solutions and can be hacked in various ways. That's great. And I'd like to keep that greatness.",
				"added": 1562041400
			},
			{
				"comment_id": 65,
				"body": "> On ZeroNet, any site that supports user content can't really live without any interaction from its owner.\n\nWhich actually means we should move away from the \"site\" paradigm. There should be \"applications\" to access and operate data in personal and collective \"hubs\", and all those things should be located on separate addresses.\n\nApplications should be compatible and interchangeable in the same way as text editors are compatible to each other, or web browsers, or email clients etc.",
				"added": 1562042063
			},
			{
				"comment_id": 66,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_380_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Democracy is a decoy set and developed by our leaders to channel the living forces. I have already explained the illusions of democracy, here and elsewhere.\n\nThat's not demo-cracy. That's I-dont-write-any-code-but-I-want-to-make-decisions-cracy.",
				"added": 1562042401
			},
			{
				"comment_id": 67,
				"body": "> [gitcentermobile](#comment_13_1BDzk7UPg7TeTu8gdY5eefwKKRyu4yWpXo): ZeroNet can't be controlled by nofish only.\n\nIt is not. Is nofish's permission required for you to write the code? Absolutely not.\n\n> However, we should move forward. Several people (including me) have asked nofish to decentralize the development process somehow, but none of us got a reply.\n\nSo why can't you actually \"decentralize the development\"? You need some permission? Make a fork and write the code. Isn't it **that** simple?\n\nIf you need a central authority to bring you decentralization, what's the point of that decentralization?",
				"added": 1562054944
			},
			{
				"comment_id": 68,
				"body": "> But it won't be ZeroNet anymore.\n\nIE6 is the only browser, no other browser is possible... oh wait, IE6's long dead. The only browser now is Chrome. That is called evolution.\n\nNo evolution is possible without competition. You want other people (nofish etc) to agree with you on all the issues, but it is not the case. Sometimes people disagree. If your solutions are better, time will tell.",
				"added": 1562056005
			},
			{
				"comment_id": 69,
				"body": "> [gitcenter](#comment_512_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I'm not against a reply like \"sorry I don't like this\". I'm against no reply at all -- and that's what happens.\n\nLooks like he prefers to remain silent. It can't be helped. The question is do we actually depend on what nofish does and wants to do, what he thinks of, writes he code or not etc. If he'll keep silent on that topic too, what do you plan to do? That is the matter. If the network is decentralized, it can live without nofish. And if it can't, we should try harder. Which primarily means to write the code, make mistakes, learn lessons and write the better code.\n\nIf the only conclusion that can be made from this discussion is that ZeroNet is non-functional without nofish, that is a really bad conclusion. Do we have some skillful developers here, or...",
				"added": 1562065893
			},
			{
				"comment_id": 73,
				"body": "> [filips](#comment_54_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY):  There need to be another solution for IDs instead of current providers or PoW.\n\nPlease read my old proposal: http://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/?Post:41. It's based on PoW and at the same time doesn't require for a user *to feel pain*.\n\nWhat is your opinion?",
				"added": 1562170161
			},
			{
				"comment_id": 74,
				"body": "> [zeroconfig](#comment_14_1LU47z6YewqdERYNFysqjDZ8NVG5WWpkVU): That will require ZeroNet users to run their own Namecoin nodes.\n\nThere is a plugin for connecting to a local Namecoin node, so a user is free to choose, if s/he trusts ZeroName cache or not.",
				"added": 1562170373
			}
		],
		"1562068614_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 70,
				"body": ">  but how much trouble are Russians and Chinese ZeroNet users having when they try to access ZeroNet zites from peers located in western countries?\n\nZeroNet works without problems in Russia. They haven't yet got down to it. Right now the government are fighting against VPN services, Telegram, BitTorrent trackers and pirate movie sites.",
				"added": 1562072182
			}
		],
		"1562074727_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 71,
				"body": "If you need read-only access to the data of another zite, you can use the CORS API. ([example](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/file/?15u2FYH7eVQPKLuyfX4AA8sjB3775kbN2W/js/10-utils/CorsRequester.coffee@master))\n\nIf you need read-write access, the only way is to use the Merger API, which means the other zite should declare in its `content.json` that it can be merged.\n\nThere's currently no way to run another zite as a service and communicate with it via some API.",
				"added": 1562080000
			}
		],
		"1562093171_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": [
			{
				"comment_id": 72,
				"body": "> [gitcenter](#comment_522_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): When I've used PHP last time (a few years ago, so things might have changed), it was a server-only language.\n\nPHP can be run from the command line in the same way as python, sh or any other general-purpose interpreter. It has various bindings as well, including some GUI facilities, AFAIK.\n\nHowever, to be honest, using PHP in applications other than web scripts, looks like a really weird idea..",
				"added": 1562093630
			}
		],
		"1562163868_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 75,
				"body": "https://github.com/HelloZeroNet/ZeroNet/pull/2068",
				"added": 1562179544
			},
			{
				"comment_id": 76,
				"body": "> [ssdifnskdjfnsdjk](#comment_863_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Wondering how much data one request to a tracker need. nofish was saying zero:// trackers are much better than others because of lower connection count (lower bandwidth). Also why zero:// trackers are not enough? Is it because there is too low number of these so it allows easier blocking?I think zeronet should work on 150kbit/s mobile internet with 500 sites.\n\nTorrents have been in use for ages without such kind of problems as the tracker network bandwidth.\n\nThe request from a client is just a simple HTTP GET query, and the answer is a short plaintext document (`bencode`d) contaning the list of peers.\n\nWhy should we artificially limit ourselves to zero://, which are now just 10 or 11 all over the network, while we can utilize [several dozens](https://github.com/ngosang/trackerslist/blob/master/trackers_all_ip.txt) trackers as well?\n\nAnyway, ZeroNet connects to several hardcoded torrent trackers in the default distribution, so I have absolutely no idea, what's wrong with the PR.",
				"added": 1562269091
			},
			{
				"comment_id": 77,
				"body": "> [nofish](#comment_1275_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): If you have at least 1 working tracker, then you should be fine and there is no real benefit to connect more trackers.\n\nIf I have it now, it doesn't mean that I'll keep having it in a hour. It may get down, blocked, hacked, DDoSed etc.\n\nFor what purpose do you update the tracker list in the core distribution then? \"We have zero://zero.booth.moe, it does work, and that's enough\" - according to your logic.\n\nTalking about zero://, it seems to be clear for everyone including me and you, that the purpose of AnnounceShare is to improve the network connectivity and stability by automatically spreading out the working trackers over the network. But when we talk about torrent, a user \"should be fine\" with the hardcoded list. Uhh?\n\nSorry for the conspirology, but it smells really bad. All the trackers currently in use by the network are either running your code (zero) or manually filtered by you (torrent). So my question is who is actually controlling those honeypots?",
				"added": 1562300152
			},
			{
				"comment_id": 78,
				"body": "AnnounceShare will be forked and renamed to TrackerShare.\n\nTrackerShare, TrackerList, gitcenter's PeerMessage and BackgroundProcessing will be packed together with the core and provided as a preconfigured distribution. A least, it will be available as a source archive and a docker image for Linux. (A bundle for Windows is possible too.)\n\nTwo more plugins are in development by me now as well.",
				"added": 1562302775
			},
			{
				"comment_id": 79,
				"body": "> [nofish](#comment_1278_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): You can create your own list using the trackers file feature.\n\nIt makes no sense, if you are the single person who uses a tracker for zeronet, and nobody else is present in its database, and you know it. That's ridiculous.\n\nYou just pull quotes out of context answering me and ignore the actual points.",
				"added": 1562338653
			},
			{
				"comment_id": 80,
				"body": "> [zeroconfig](#comment_17_1LU47z6YewqdERYNFysqjDZ8NVG5WWpkVU): Maybe the first point of the pull request (sharing of Torrent trackers) can be omitted and still be merged?\n\nThe whole point of the pull request is the rewrite of the plugin in a uniform way, so it can be used for sharing any trackers of any protocols of the past, present or future, that were, are or will be implemented for ZeroNet.\n\nSo, if we still need torrent trackers, the plugin can help sharing them. And if we don't need them, the plugin has nothing to do with them.\n\nIf the project goal is not creating a network of the maxinum connectivity and stability, that is able to find content delivery paths in any possible conditions, but developing a sandbox, isolated from the real world, creating vendor lock-in techniques, playing the \"I do everything by myself\" games or other obscure things, then okay... It can't be helped in any way.",
				"added": 1562339943
			}
		],
		"1562445173_1CubdeDePywZpDx99J81tZSjJDNDGCzfzS": [
			{
				"comment_id": 81,
				"body": "Pentium D 935 @ 3.20GHz works just fine in 2019.",
				"added": 1562517028
			}
		],
		"1562661518_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 82,
				"body": "You're probably behind the NAT of your ISP, so your router cannot accept incoming connections from Internet.\n\nIf you have Tor enabled, your zites will be accessible for most of the network anyway.",
				"added": 1562664699
			},
			{
				"comment_id": 85,
				"body": "> [blurhy](#comment_257_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Do you have a public IP? If not, ask your ISP to provide it.\n\nLooks like it took 3+ hours for your comment  to appear on my laptop. A GWF filtering issue?",
				"added": 1562677675
			},
			{
				"comment_id": 87,
				"body": "> [blurhy](#comment_258_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): No, it's your fault. My ZeroNet is running on the VPS in the US\n\nLooks weird. My instance is online 24/7 via Tor, still has some connectivity issues.",
				"added": 1562679855
			},
			{
				"comment_id": 88,
				"body": "> [sergery](#comment_5_1CeQt9V6HXQjKEipGLs6RSAYD8aLEvG7KC): I always get that my IPV4 port is closed,tho it is certainly open and I get incoming connections as well.IPV6 port detection works great tho\n\nIdeally, the software should ask other peers to test the incoming connections, but it asks some 3rd party web service.",
				"added": 1562688858
			}
		],
		"1562671898_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 83,
				"body": "Trump is going to follow the path tested and approved by Putin lol",
				"added": 1562672352
			},
			{
				"comment_id": 84,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_426_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): proofs ?\n\nPutin's government bans messaging apps which refuse to provide a backdoor for FSB. You can search for proofs in Google.",
				"added": 1562676959
			}
		],
		"1562198429_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 86,
				"body": "> [xcape2net](#comment_104_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I noticed Cloudflare is now hosting a large percentage of the Interplanetary File System.  I don't know what to think about that.\n\nYeah, Cloudflare supports IPFS. The next \"Don't be evil\" corporation?",
				"added": 1562677864
			},
			{
				"comment_id": 89,
				"body": "I don't trust to the Pale Moon devs.",
				"added": 1562694010
			},
			{
				"comment_id": 90,
				"body": "> [filips](#comment_74_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Do you trust anyone? ðŸ˜ƒ [...]\n\n1. Tor Browser \n2. Firefox + Noscript\n\n:D\n\nBut I have to allow JS for ZeroNet... %-)",
				"added": 1562694313
			},
			{
				"comment_id": 91,
				"body": "> [filips](#comment_75_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): I actually tried to put more browsers on second place, but ZeroTalk UI automatically \"fixed\" numbers.\n\nThe markdown parser seems to be \"smart\". :) Can be done in this way:\n\n1. Aaa\n2. Bbb\n  * X\n  * Y\n  * Z",
				"added": 1562694690
			},
			{
				"comment_id": 93,
				"body": "> [diff](#comment_13_17husSAraRRvc7qRWxwA7KF7PTwjhTmxhD): Chrome is new IE. Electron is new Flash.\n\nThey said Flash had dangerous vulnerabilities, but it seems the most dangerous vulnerability Flash had was actually the fact it was invented not in Google.",
				"added": 1562779428
			},
			{
				"comment_id": 94,
				"body": "> [filips](#comment_83_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Flash really has many vulnerabilities.\n\nYeah, it has, and it's also a closed-source technology, so better alternatives are welcome. Adobe could try to open the sources and initiate a standardization process, but they missed the time and lost their market.\n\nBut when corporations such as Google or Apple talk about Flash shortcomings, users should understand that corporations really don't care. The only thing they care about is the market share of their own products.",
				"added": 1562818653
			}
		],
		"1562989255_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 95,
				"body": "Good. Writing the code... https://github.com/zeronet-enhanced/ZeroNet/commits/plugins",
				"added": 1563008231
			}
		],
		"1562978975_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 96,
				"body": "Too long to read. Looks like a big whining.",
				"added": 1563008444
			}
		],
		"1563053899_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 97,
				"body": "\"Another six years of Latin and you will see how our young people calm down.\" (count Dmitry Tolstoy, Education Minister, 1869)",
				"added": 1563089150
			}
		],
		"1562866332_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 98,
				"body": "> What if these \"accidental\" internet shutdowns we've experienced lately are really just the US government testing to verify that it can shut down the internet whenever it feels the need?\n\nYeah, and they also take control over such \"decentralized\" solutions as IPFS. *If you can't ban it, lead it.* Now Cloudflare provides its own IPFS service, so one has no need to run their own. Which means what? \"Just use our services, it's easier and cheaper than running your own ones, -- and we also are able to simulate an accidental failure of your sites whenever we want\"",
				"added": 1563099382
			},
			{
				"comment_id": 99,
				"body": "> [caropc5](#comment_1_1AuxFfYUeKuSqqtkUCRRfJDKj5S8BnStjo): zeronet is up :D\n\nZeroNet works over Tor, and Tor was developed by IC and DARPA, lol. ZeroNet should support many different tunneling facilities, not just one. I2P, Tox, IPFS...",
				"added": 1563099816
			}
		],
		"1581976802_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 100,
				"body": "> [ssdifnskdjfnsdjk](#comment_967_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @zeroseed this site is mean to be czâ‚¬ch language zerotalk forum, consider seeding it, it has rather low peer count. \n\nhttps://github.com/HelloZeroNet/ZeroTalk/pull/96",
				"added": 1583760016
			},
			{
				"comment_id": 186,
				"body": "> [xerog](#comment_12_1DWCrTtmJ1g3gLgwENAmzG75QvTkmjmoFv): Wouldn't it hurt zeronet \n\nWhat's the problem?",
				"added": 1584874061
			},
			{
				"comment_id": 187,
				"body": "@zeroseed, could you consider adding these sites?\n\nOpenNews ðŸ‡·ðŸ‡º http://127.0.0.1:43110/1Nowr5oVEdbU5ZTQBriRd2jJVj2vhsDJd4/\nZeroChat RU http://127.0.0.1:43110/1N5h8HMhsXskakdcaaLoPniwqmMsRWMXgV/\nZeroTalk++ http://127.0.0.1:43110/1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y/\nZeroBlog++ http://127.0.0.1:43110/19fZJhX7FGENeRRLB8ftgrziBJ5vsLtFog/\nInf0nesy Talk http://127.0.0.1:43110/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/\nLOR Talk http://127.0.0.1:43110/1BpFtPez7mSiShtXfb4wPfMT1dZTuRybfZ/",
				"added": 1584874599
			}
		],
		"1583761084_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 101,
				"body": "> How to automatically seed all those that this user will share in the future? Currently this is not a feature of the kopykate site\n\nYou can (in theory) enable the `optional_help` feature manually.\n\nI guess the following code should do the job, if you run it in the in-browser JavaScript console on the appropriate zite:\n\n```\nPage.cmd(\"OptionalHelp\", [\"data/users/1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS\", \"SSDifnskdjfnsdjk's new files\"])\n```\n\nUnfortunately, as I've just checked, the `Page` object isn't externally available on KopyKate. So, the option 2:\n\n1. Close ZeroNet application.\n2. Inspect `sites.json` and locate some `optional_help` keys.\n3. Edit `sites.json` and add the similar `optional_help` for KopyKate.\n4. Restart ZeroNet application.\n\nI've not tested whether it works.",
				"added": 1583763202
			},
			{
				"comment_id": 102,
				"body": "Oops.\n\n> [geekless](#comment_101_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): I've not tested whether it works.\n\nLooks like it doesn't. You also have to manually add some entries to `content.db`.\n\nSo `Page.cmd(\"OptionalHelp\", ...` is the only proper way to enable the feature.",
				"added": 1583763803
			},
			{
				"comment_id": 103,
				"body": "> [gitcenter](#comment_1225_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): \n\nThanks!",
				"added": 1583770355
			}
		],
		"1583768669_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 104,
				"body": "Should we do it together then?\nIf someone is brave enough to make a fork and continue the development, I'm happy to help with some patches and pull requests. Just see no reason to do it now, when the development seems to stall.",
				"added": 1583771483
			},
			{
				"comment_id": 105,
				"body": "> [xplosive](#comment_37_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6): Currently used: 19.3k/50k. I know that the site admin can increase it if I am about to run out of it. But I am currently far from that.\n\nAFAIK the limit is increased automatically by a script somewhere on a nofish's host. The purpose of the limit is for new accounts not to be able to spam and DoS the forum.\n\nAlso, check out my ZeroTalk fork with some bug fixes and improvements: http://127.0.0.1:43110/1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y/",
				"added": 1583814822
			},
			{
				"comment_id": 106,
				"body": "> [bitcoren](#comment_1_1J3zHeRQJosJJJhd4RRondHRyfSVGnCmNv): Is your ZeroBlog++ working fine? I canâ€™t save the post there, on cloned zite.\n\nIt's probably because your new site has no known peers.\n\nDoes it show the following popup messages? If yes, it's just the peer issue.\n\n> 1. Content publish failed.\n> 2. No peers found, but your content is ready to access.",
				"added": 1583822593
			}
		],
		"1583786953_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": [
			{
				"comment_id": 107,
				"body": "Ok, now it partially loaded, but `all.js` is still missing.",
				"added": 1583823722
			},
			{
				"comment_id": 108,
				"body": "I've added your site to the list at http://127.0.0.1:43110/1LtvsjbtQ2tY7SCtCZzC4KhErqEK3bXD4n/\n\nHope it helps.",
				"added": 1583823812
			},
			{
				"comment_id": 110,
				"body": "OK, I gave up trying to download the jft's forum and created another one. Hope it will be better luck.\n\nPlease help seeding:\n\nhttp://127.0.0.1:43110/1YwB6u3f9TUfre8H9scXkbPyeuMaJSJio/\n\n## [ZeroTalk en Esperanto](http://127.0.0.1:43110/1YwB6u3f9TUfre8H9scXkbPyeuMaJSJio/)",
				"added": 1583827314
			},
			{
				"comment_id": 114,
				"body": "> [4202](#comment_14_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA): \n\n    there are only 16 simple grammatical rules\n\nWhat a bullshit! Such kind of propaganda doesn't help at all.\n\n    verbs do not vary with person and number\n\nWell, the verb conjugation isn't a especially difficult thing. In fact, I miss such a feature sometimes.\n\nOther points are nevertheless completely correct.\n\nI'm not fluent in any Romance language, however I'm able to understand Spanish, Portuguese and Italian, to some extent. So I can say, Esperanto looks really simple and easy, compared to those languages. (Well, not only Esperanto, but also other auxiliary languages such as Ido or Interlingua.)",
				"added": 1584016150
			}
		],
		"1583926359_1G9KPmTFFXgarsKRjpPuvRd13mYf8aDm3E": [
			{
				"comment_id": 112,
				"body": "Just few days ago, the similar idea was discussed on a Russian Linux forum in the clearnet.\n\nMy thoughts on ZeroMe design:\n\n* The registry address shouldn't be hard-coded in the engine sources. Registries can be added dynamically via the merger feature.\n  * In order to support various user ID providers and possible future extensions of the core design.\n* The existing collective hubs should be used as a cache to keep recent entries.\n  * There also may be thematic hubs, similar to user groups and communities in the clearnet social networking apps.\n* Each user has their own personal hub.\n* When you post a message, it lands to your personal hub as well as to any number of collective hubs, at your choice.\n* An owner of a collective hub can ban you or censor you, but since there will be thousands of collective hubs run by different people, it's practically impossible to ban you from the network entirely.\n* An even if you're banned from a hub, people, who has been subscribed to your personal hub, are still able to read your posts.\n* Comments and likes aren't necessary to be saved at the same hub, as the original post. (That's required in the current design.) They can be merged from different hubs. Again, to prevent censorship. And also, to make possible merging different user ID providers and engine extensions. A reader can choose in the settings, if s/he follows the censorship policy of the post author, or prefers merging comments from various sources regargdless of the author's hub config.",
				"added": 1583931622
			}
		],
		"1583945887_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 113,
				"body": "> [styromaniac](#comment_1887_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Don't complain to me about the app. Pretty simple. I'm not the author.\n\nBut it's you who promotes the app.",
				"added": 1583976723
			}
		],
		"1584077470_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 115,
				"body": "[x] A centralized DNS\n[?] Unattended updates **<= You are here**\n[?] Telemetry\n[?] Fingerprint-based copyright law enforcement\n[?] NSA integration\n[?] All ZN keys are stored by a government service. Generating local keys considered illegal.\n\nJust kidding lol.",
				"added": 1584107954
			},
			{
				"comment_id": 116,
				"body": "> [gitcenter](#comment_1252_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): The question is what is the sensible default. \n\nIt's better to ask user on the first startup.",
				"added": 1584108056
			}
		],
		"1584164125_1KeJfumP5mjv7jrFKnFaWLt5uQa1vLe62J": [
			{
				"comment_id": 117,
				"body": "No, it is forever.",
				"added": 1584166907
			},
			{
				"comment_id": 118,
				"body": "If you created any sites by cloning existing ones via the ZeroHello UI, you've probably lost  the admin access to them as well. The private keys for those sites are derived from your `master seed`, in the same way as for your user id.",
				"added": 1584167193
			},
			{
				"comment_id": 119,
				"body": "> There is no point in asking admins (besides, I'm not certain if there are any) to reset it\n\nzeroid.bit is run by @nofish",
				"added": 1584167287
			},
			{
				"comment_id": 120,
				"body": "> [scpketerz](#comment_2_1KeJfumP5mjv7jrFKnFaWLt5uQa1vLe62J): It's not centralized anyway\n\nIt is.",
				"added": 1584168696
			},
			{
				"comment_id": 122,
				"body": "> [blurhy](#comment_355_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): That's also the reason why i recommend developing the new network\n\n*Which will be designed better because.......* ?",
				"added": 1584192753
			},
			{
				"comment_id": 125,
				"body": "> [gitcenter](#comment_1277_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I'm wondering how to fix that. Perhaps storing the keys on a separate machine would work?\n\nUSB security token?",
				"added": 1584193287
			},
			{
				"comment_id": 128,
				"body": "> [blurhy](#comment_357_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Because I can design it. In contrast, I can do nothing on ZeroNet because nofish controls it\n\nno code -- no design\nIdeas cost nothing.",
				"added": 1584195283
			},
			{
				"comment_id": 130,
				"body": "> [blurhy](#comment_358_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): For anonymity, the design of the network should be discussed secretly.\n\nI don't think so.",
				"added": 1584196243
			},
			{
				"comment_id": 132,
				"body": "> [blurhy](#comment_359_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): For example, if i revealed the name of project, and published it on github, the new identity has a connection with current identity.Agents in China can just arrest me without any reasons, as the identity I'm using now has phone number leak which is associated with my real name\n\nIn that case, you shouldn't trust me either.",
				"added": 1584196998
			}
		],
		"1584181525_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [
			{
				"comment_id": 121,
				"body": "> [aassddff](#comment_54_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): I just post local songs in order to share my culture with others.\n\nYou can clone my [ZeroBlog++](http://127.0.0.1:43110/19fZJhX7FGENeRRLB8ftgrziBJ5vsLtFog/) and make a blog dedicated to songs etc.\n\nZeroBlog++ allows embedding audio and video content in posts, so you can upload videos on ZeroUp or KopyKate and paste links into your blog posts.\n\nThis way, you may post just short annonces on ZeroMe, in order to save space, and also your content will be located at your own site, managed and controlled exclusively by you.",
				"added": 1584192586
			}
		],
		"1584190267_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 124,
				"body": "http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/file/?1FEvdSRAqTEuGpc31s9ad7rPc4jqRpeWfG/docker-zeronet@master",
				"added": 1584193098
			},
			{
				"comment_id": 126,
				"body": "> [gitcenter](#comment_1279_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di):       Docker would probably be a problem for me because I need to quickly make code changes and quickly restart the instance.\n\nA long-running container with a directory mounted to the sources?",
				"added": 1584193482
			},
			{
				"comment_id": 127,
				"body": "Firejail uses the same linux namespace feature as Docker. It probably also enables additional security techniques, but I'm actually not sure.",
				"added": 1584194544
			},
			{
				"comment_id": 135,
				"body": "> [gitcenter](#comment_1279_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): quickly restart the instance.\n\n```\n$ time docker build -t local/zeronet-py3 .\nreal 0m18,000s\nuser 0m0,114s\nsys  0m0,138s\n```\n\nIsn't fast enough?",
				"added": 1584201595
			},
			{
				"comment_id": 136,
				"body": "> [gitcenter](#comment_1289_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): This would be fast enough for just running ZeroNet, but I sometimes modify the code really often (debug-by-print, yeah).\n\nHah! I guess you've never debugged C++. 18 seconds per build is really fast :D\n\nI probably should write a custom Dockerfile and some scripts to restart the app instantly, without need of copying the sources into the docker image. But I'm too lazy.",
				"added": 1584202444
			},
			{
				"comment_id": 137,
				"body": "> [gitcenter](#comment_1293_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): \n\nhttps://github.com/HelloZeroNet/ZeroNet/issues/2476\n\nCan you reproduce the issue?",
				"added": 1584206674
			},
			{
				"comment_id": 138,
				"body": "> [gitcenter](#comment_1296_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): \n\nThanks!",
				"added": 1584207493
			}
		],
		"1584033612_1LgMfbn4Sv1jxzq8oZFyMi9m6kfEUgcXdf": [
			{
				"comment_id": 129,
				"body": "I have that \"missing 1 required positional argument\" bug sometimes too, but haven't noticed any pattern.",
				"added": 1584196191
			},
			{
				"comment_id": 131,
				"body": "> [styromaniac](#comment_1928_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You are correct that there is no pattern.\n\nMaybe your doubleclick suggestion is correct, but the system should be under some load for the bug to occur. The last time when I faced that bug was the update after a long offline, so many sites were downloading at the same time.",
				"added": 1584196666
			}
		],
		"1584198532_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": [
			{
				"comment_id": 133,
				"body": "```\nChina 1170 peers\nUnited States 383 peers\nRussia 68 peers\nFrance 58 peers\nCanada 46 peers\nAustralia 42 peers\nGermany 41 peers\nUnited Kingdom 35 peers\nBrazil 33 peers\nNetherlands 30 peers\nJapan 23 peers\nSingapore 23 peers\nSpain 20 peers\nSweden 19 peers\nOther 234 peers\n```\n\nI have no idea what it means. Why so many peers form China? Shouldn't ZeroNet connections be filtered by GFW?",
				"added": 1584199546
			},
			{
				"comment_id": 134,
				"body": "> [z0z0z0z0z0z0z0z0](#comment_85_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA): BTW whats your total peers number?\n\n```\nConnections\n54 of 4174 peers\nOnion: 1893 peers (30 connections)\n```",
				"added": 1584199991
			}
		],
		"1584212301_1BRxJEa4TJ3hk6KcGHYFTGjAb81Vxz2RW3": [
			{
				"comment_id": 139,
				"body": "> It now shows only solid black background for me. Is it just me or do you have it too?\n\nIt's just you.",
				"added": 1584212471
			}
		],
		"1584215413_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": [
			{
				"comment_id": 140,
				"body": "1. Just tested, ZeroMail works okay, message is sent.\n2. The space limit will be raised by an automated script. I don't know how often it runs, but it runs periodically...",
				"added": 1584215695
			},
			{
				"comment_id": 141,
				"body": "> [xplosive](#comment_76_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6): [...]\n\nDo you have nofish in this popup list -- http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/2020-03-15-101955_1366x768_scrot.png ?\n\nIf not, try deleting and redownloading ZeroMail. Maybe some bug in the DB...",
				"added": 1584243452
			}
		],
		"1584244208_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": [
			{
				"comment_id": 142,
				"body": "```\nUpload 553 MB Download 1.1 GB\nUpload 695 MB Download 958 MB\nUpload 640 MB Download 871 MB\nUpload 918 MB Download 1.2 GB\nUpload 766 MB Download 890 MB\netc\n```\n\n```\nTotal size\n1.6 GB in 641 sites\nContent sources: 87813 files\nOptional downloaded: 299 MB of 2386.6 GB\n```\n\nI stopped seeding from a peer that was running on a VPS 24/7 with a public IP. There were much bigger numbers there.",
				"added": 1584245363
			}
		],
		"1584246912_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 143,
				"body": "Added `ZeroTalk Tech` to the list.",
				"added": 1584262603
			},
			{
				"comment_id": 145,
				"body": "> [gitcenter](#comment_1301_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): @geekless For some reason I've only found FZNC today. Is the project still running? I've also had a similar project (namely, a ZeroNet Open Standards Community) so it'd be cool if there were many people sharing the idea.\n\nThe forums are, obviously, up, and I keep writing some code in my spare time.\nCommunity? As you can see the community prefers discussing the conspiracy theories and being engaged in mutual insults here on ZeroTalk, instead of doing the real work. There's nothing I can do with that. Finally, we as a community will get the future that we deserve.",
				"added": 1584263488
			}
		],
		"1576021217_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 144,
				"body": "@xcape2net:\n\n> ZeroTalk Tech -- my zite about anything having to do with technology\n\nCould you consider raising the default limit from 50KB up to some more user-friendly value?",
				"added": 1584262941
			},
			{
				"comment_id": 152,
				"body": ">  I assume other people can still post and make comments, but no one has made one since the 11th.\n\nSince the 11th? Does it mean that you can't see 2 comments by @xplosive and me [in that topic](http://127.0.0.1:43110/1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq/?Topic:1583888040_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz/)\n\n> I can set your limit individually. What number are you at now, and what limit would you like? Also, all you have to do at any time to get your limit raised is to post a comment on ZeroTalk Tech asking to have it raised.\n\nThanks you, I'm now just at 2KB, so no need to worry.",
				"added": 1584326771
			},
			{
				"comment_id": 160,
				"body": "> [ssdifnskdjfnsdjk](#comment_973_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): just search at ZeroHello the error you have got or post that error on Zerotalk to get help.\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1583940559_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz/",
				"added": 1584352509
			}
		],
		"1567156332_1BDuQk2j7RCQKqK4xyPzNLsrNDH6kAXF2q": [
			{
				"comment_id": 146,
				"body": "Wow!",
				"added": 1584266018
			},
			{
				"comment_id": 147,
				"body": "> [gitcenter](#comment_902_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): The real question is: do we really need to limit registration? Bots became an important part of our communication. And if fake 200 users can do harm, it means that real 200 users can do the same. Personally, I don't see any problem in bots registering IDs. From my point of view, ZeroTalk should support some kind of whitelist: you specify what users you want to read. Posts/comments from those users rise up. Non-whitelisted posts/comments are either hidden or made almost transparent.\n\nDo you have any solution that scales well?",
				"added": 1584276419
			}
		],
		"1584271096_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY": [
			{
				"comment_id": 148,
				"body": "> [ranshit](#comment_108_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): Be aware that ZeroUp Unlimited vs ZeroUp does not have a search feature. [...]\n\nEveryone complains about missing features, but nobody writes the code.",
				"added": 1584292621
			},
			{
				"comment_id": 149,
				"body": "> [ranshit](#comment_109_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): Nobody would visit IFS or KopyKate if there was nothing on it.\n\nNobody would visit KopyKate if it doesn't work. And it barely does.\n\n> My skill is in C, not Python, CSS, Javascript, and HTML.\n\nMine too, but who cares? At least, I'm trying to implement a better forum engine.",
				"added": 1584293197
			}
		],
		"1584291401_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": [
			{
				"comment_id": 150,
				"body": "> [progi](#comment_17_17KQehVm2u5r4GAjqkC3jRcxepzK6ri51W): [...]\n\nNewGFWTalk seems to have 200KB per user by default, which looks reasonable.",
				"added": 1584302706
			}
		],
		"1583940559_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 151,
				"body": "http://127.0.0.1:43110/1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq/data/users/content.json :\n\nHere is how it looks from my side:\n\n```\n{\n \"address\": \"1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq\",\n \"files\": {},\n \"ignore\": \".*\",\n \"inner_path\": \"data/users/content.json\",\n \"modified\": 1566998611,\n \"signs\": {\n  \"1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq\": \"HKHFgaJ72RdxAfE6zbFuD++oGHev5TBbjrAyTzn57R3IRtogOasUO8YCoqT+hNI2PB2z77BHSuWr0Kjlo5PY9TQ=\"\n },\n \"user_contents\": {\n  \"cert_signers\": {\n   \"kxoid.bit\": [\"12F5SvxoPR128aiudte78h8pY7mobroG6V\"],\n   \"zeroid.bit\": [\"1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz\"]\n  },\n  \"permission_rules\": {\n   \".*\": {\n    \"files_allowed\": \"data.json\",\n    \"max_size\": 50000\n   },\n   \"bitid/.*@zeroid.bit\": {\"max_size\": 40000},\n   \"bitmsg/.*@zeroid.bit\": {\"max_size\": 15000}\n  },\n  \"permissions\": {\n   \"bad@zeroid.bit\": false,\n   \"xcape2net@zeroid.bit\": {\"max_size\": 200000}\n  }\n }\n}\n```\n\nDo you have the same content on your system? Is it possible that the file is corrupted on your machine?",
				"added": 1584322124
			},
			{
				"comment_id": 165,
				"body": "I still have the old version of http://127.0.0.1:43110/1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq/data/users/content.json here.\n\nHave you signed and published `data/users/content.json`?",
				"added": 1584422285
			},
			{
				"comment_id": 167,
				"body": "What is the size of `1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq/data/users/1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz/data.json`? I guess it is > 200000 bytes.\n\n> [16:19:14] Site:1EfLnw..ZTMq [FAILED] 83.162.192.96:17791: None\n\nPeers refuse to save the file since it violates the `user_contents` restrictions. Namely, it's bigger in size than allowed, I guess.\n\nThis happens, because all the peers have the old version of `data/users/content.json`.\n\nSo, the question is why your host doesn't sign and send the new version? What is in the log when you manually sign `data/users/content.json` from the sidebar?",
				"added": 1584462900
			},
			{
				"comment_id": 170,
				"body": "I can see the new version now:\n\n```\n{\n \"address\": \"1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq\",\n \"files\": {},\n \"ignore\": \".*\",\n \"inner_path\": \"data/users/content.json\",\n \"modified\": 1584484287,\n \"signs\": {\"1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq\": \"G0CcDYbAfYmA2AxGhEtJ1BuxQjLPNlzQABHL2FI+VtRiAgrQglYRye8W5ZqqKJgw3VSK000RIJJ0Bjq7kf4AUiE=\"},\n \"user_contents\": {\n  \"cert_signers\": {\n   \"08chan\": [\"1NwwLdiFBcVAA4jXQ712ZtQfDHEMvk8BiD\"],\n   \"cryptoid.bit\": [\"18143WPue3rQykNaopx5KJKzYmaYhCjqhv\"],\n   \"kaffie.bit\": [\"1KH5BdNnqxh2KRWMMT8wUXzUgz4vVQ4S8p\"],\n   \"kxoid.bit\": [\"12F5SvxoPR128aiudte78h8pY7mobroG6V\"],\n   \"nanasi\": [\"16KzwuSAjFnivNimSHuRdPrYd1pNPhuHqN\"],\n   \"zeroid.bit\": [\"1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz\"],\n   \"zeroverse.bit\": [\"1HPgDoReCFtE9qy71hnp55ksBVvV1gHJLQ\"],\n   \"zv.anonymous\": [\"1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb\"]\n  },\n  \"permission_rules\": {\n   \".*\": {\n    \"files_allowed\": \"data.json\",\n    \"max_size\": 50000\n   },\n   \"bitid/.*@zeroid.bit\": {\"max_size\": 40000},\n   \"bitmsg/.*@zeroid.bit\": {\"max_size\": 15000}\n  },\n  \"permissions\": {\n   \"bad@zeroid.bit\": false,\n   \"xcape2net@zeroid.bit\": {\"max_size\": 1000000}\n  }\n }\n}\n```",
				"added": 1584493273
			},
			{
				"comment_id": 171,
				"body": "> [xcape2net](#comment_701_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Could it be that it took a couple of tries to publish the correct /data/users/content.json file (the one that wasn't missing the comma)?\n\nProbably.",
				"added": 1584535147
			},
			{
				"comment_id": 172,
				"body": "BTW, you could miss posts/comments of other users due to this bug https://github.com/HelloZeroNet/ZeroNet/issues/2476",
				"added": 1584535344
			},
			{
				"comment_id": 173,
				"body": "> [xcape2net](#comment_701_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz):  And when I was replacing the broken version with old versions of /data/users/content.json that were correct, why weren't they working? I kept getting messages saying that signing and publishing was working.\n\nYou should place the new file AND sign it. ZeroNet caches `content.json`s for faster access, so it doesn't re-read those files unless you tell it so.\n\nAlso, I've noticed, that in some cases, ZeroNet silently throws away an invalid `content.json` and just restores the cached version, when you're signing it.",
				"added": 1584535719
			},
			{
				"comment_id": 174,
				"body": "> [xcape2net](#comment_702_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Wonderful.  I assume this will be fixed on a future version of ZeroNet?\n\nI hope so.",
				"added": 1584535764
			},
			{
				"comment_id": 175,
				"body": "My guess:\n\n1. You saved the file with syntax errors.\n2. ZeroNet keeps working, since it uses the cached file.\n3. You restart ZeroNet.\n4. ZeroNet re-reads all `content.json`s.\n5. Since the file, where the `user_contents` section was defined, wasn't parsed, ZeroNet had no idea, that your site could contain the user-generated content.\n6. At this stage,  you're getting error `Private key invalid! Valid signers: ['1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq']`. ZeroTalk engine tells ZeroNet to sign the data with the used id key, but ZeroNet believes it's only the site owner who is allowed to sign the data.\n7. For the same reason, you aren't able to receive user-generated updates for your site.\n8. You're trying to fix the situation in different ways, so maybe some bugs occur in the engine, which prevent correct publishing of the data. Really not sure.\n9. Finally the valid `data/users/content.json` has succesfully published and your ZeroNet instance has parsed and cached it as well. Now user-generated content works both on your machine and other peers.",
				"added": 1584537032
			}
		],
		"1583512099_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": [
			{
				"comment_id": 153,
				"body": "> [rannulfr](#comment_48_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51): We are looking for developers to implement new features in a fork of the project as the original Dev is mia. Help us build this into a central point of Zeronet for content. [...]\n\nHi! I have a few questions...\n\nWho is the original developer? Is his/her user id known?\n\nWho is \"we\" and how many you guys there are?\n\nWhat is the current status of the project? Any progress since the announcement?",
				"added": 1584332176
			}
		],
		"1584337202_1KeJfumP5mjv7jrFKnFaWLt5uQa1vLe62J": [
			{
				"comment_id": 154,
				"body": "> Is it possible to somehow run ZeroNet on another port and make it host sites from my home directory instead?\n\nSure it is, in many different ways. Mine is:\n\nhttp://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/?Post:16\n\nhttp://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/file/?1FEvdSRAqTEuGpc31s9ad7rPc4jqRpeWfG/docker-zeronet@master",
				"added": 1584337456
			},
			{
				"comment_id": 155,
				"body": "> other users on my machine able to use ZeroNet web UI\n\nI guess this helps\n\nhttps://github.com/HelloZeroNet/ZeroNet/tree/py3/plugins/disabled-UiPassword",
				"added": 1584337708
			},
			{
				"comment_id": 156,
				"body": "> [scpketerz](#comment_7_1KeJfumP5mjv7jrFKnFaWLt5uQa1vLe62J): I'm not a really advanced docker user, how do I run this one?\n\nWell, first you should install docker, add yourself to the `docker` group and enable&start the docker service in systemd.\nAnd second, just run my script with the appropriate port, data directory path and UID specified, as described here: http://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/?Post:16",
				"added": 1584339106
			},
			{
				"comment_id": 157,
				"body": "> [scpketerz](#comment_10_1KeJfumP5mjv7jrFKnFaWLt5uQa1vLe62J): python: not found\"\n\nMy bad. Looks like I forgot to commit and push a fix a few months ago. o_O Now fixed.",
				"added": 1584343973
			},
			{
				"comment_id": 158,
				"body": "Fuck! \"Not fixed\" => \"Now fixed\". I'm typing too fast lol\n\nUpdate the repo and `git pull`.\n\nOr just replace `exec su \"$TARGET_USER\" -c \"python \\\"\\$@\\\"\" -- zeronet.sh \\` with `exec su \"$TARGET_USER\" -c \"python3 \\\"\\$@\\\"\" -- zeronet.sh \\` manually.",
				"added": 1584344697
			},
			{
				"comment_id": 161,
				"body": "> [scpketerz](#comment_13_1KeJfumP5mjv7jrFKnFaWLt5uQa1vLe62J): I'm periodically receiving error messages like 'Your Web UI is open to the whole Internet, check configuration'. Any way to fix that?\n\nIt's okay. In that case, Docker is your firewall actually. ZeroNet just doesn't know that it works in docker and its ports are unavailable from outside. I don't know how to force ZeroNet not to display that message.",
				"added": 1584367623
			}
		],
		"1584324810_19913irDUyBcw4rBHtdPdsMFW5vkqKBTY6": [
			{
				"comment_id": 159,
				"body": "> After a while I said, \"I'm an American, and I'm very interested now. Which country do you think is the most powerful country in the world to prevent and control CV-19?\"\n\nAnd what happened next?\n\n> I'm an American\n\nLOL. Got it. Mexican, Chilean, Brazilian etc people are for sure \"Americans\" since the both whole continents are \"America\". So which exactly American are you?\n\n> rabinovich\n\nNice nickname, BTW",
				"added": 1584351970
			}
		],
		"1584357168_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 162,
				"body": "> [gitcenter](#comment_1312_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I'm wondering if you can add Kiwipedia?\n\nKiwipedia doesn't work for me. It never shows any content and also ZeroNet prints error messages such as :\n\n```\n[11:04:01] Site:1KiwiB..kN9r Json merged-Kiwipedia/1ETbbRZvf64WVeH3PgQpPvDub7tcM4mPZD/data/users/1EA2A9K7M1agtM6gE2MWtiF26dYcaSLbh/i2p.json load error: InterfaceError: Error binding parameter 1 - probably unsupported type. in SiteStorage.py line 364 > ContentFilter/ContentFilterPlugin.py line 213 > SiteStorage.py line 117 > Db.py line 490 > DbCursor.py line 105\n```",
				"added": 1584368275
			},
			{
				"comment_id": 163,
				"body": "> [gitcenter](#comment_1313_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I believe I have the private key for New ZeroWiki so I could make some modifications (I hope Krixano won't blame me for it), but only as long as this doesn't change the original idea.\n\nNice to hear that. So, if I make a fork and implement some features some day, I'll let you know. I'd like to add some features, such as the aggregated change log for all the pages, ability to erase old revisions to save some space etc.",
				"added": 1584368591
			}
		],
		"1584402406_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 164,
				"body": "Some people join, some people leave...\n\nHere are some names I can remember of:\n\ndaniell@zeroid.bit:\n * http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1N9sU8qh3S4ei9PHE1qQyYPbcckJomvwMd/15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe/\n * http://127.0.0.1:43110/daniellmesquita.bit/\n\nleftside@zeroid.bit:\n * http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm/\n\nzorg13@zeroid.bit:\n * http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1KFqej3sgCjw62yRAqgdaGUzmTAuSDmbW2/\n * http://127.0.0.1:43110/1N5h8HMhsXskakdcaaLoPniwqmMsRWMXgV/\n\nshift@zeroid.bit:\n * http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/\n\nekaterina@zeroid.bit:\n * http://127.0.0.1:43110/ZeroPolls.bit\n * http://127.0.0.1:43110/1Kp5xdjQyrPth5mEJsn6NDBKZxcaeYz86N",
				"added": 1584421915
			},
			{
				"comment_id": 166,
				"body": "> [gitcenter](#comment_1317_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): @geekless Does daniell's ZeroMe hub load for you? I've reported an issue but I wanted to make sure it's not just me.\n\nIt works on the existing installation, but \"`CONTENT.JSON DOWNLOAD FAILED`\" is on the fresh one.",
				"added": 1584427616
			}
		],
		"1584462344_1KeJfumP5mjv7jrFKnFaWLt5uQa1vLe62J": [
			{
				"comment_id": 168,
				"body": "> [gitcenter](#comment_1319_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Clone ZeroBlog via ZeroHello; Rename the data directory to 1MyFancyAddress.\n\nHe probably should also manually sign `content.json` and `data/users/content.json` from the sidebar in that case.",
				"added": 1584463920
			},
			{
				"comment_id": 169,
				"body": "> [styromaniac](#comment_1939_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I kept hearing that Tor peers are necessary to publish unless you have an opened port.\n\nIf you don't use Tor and you are behind NAT, the publishing can be tricky:\n\n* Find some volunteer peers with port open. http://127.0.0.1:43110/1LtvsjbtQ2tY7SCtCZzC4KhErqEK3bXD4n/ can be helpful to find some peers. You can also use public proxies, if they have port open.\n* These peers go to trackers to find your peer, but they are not able to connect to you through NAT. However, they register themselves at the trackers.\n* Now you open your site and publish some data or just sign content.json from the sidebar.\n* Your host is trying to push the updates to some peers, so it requests the peer list from trackers.\n* Since your volunteer peers have port open, your host succesfully connects and sends the data.\n* Now you can publish any updates, and visitors can access your site, connecting to volunteer peers.\n* If volunteer peers go offline or remove your site from the storage, connectivity is broken and you have to find some others.\n\nSo, generally speaking it's better to always run Tor to avoid those troubles.",
				"added": 1584465650
			}
		],
		"1584541101_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": [
			{
				"comment_id": 176,
				"body": "> zeronet.link\n\nWhat the hell is this?",
				"added": 1584541471
			},
			{
				"comment_id": 177,
				"body": "> [krzysztof113](#comment_24_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5): Here's about main feature of zeronet.link\n\nGot it.",
				"added": 1584542556
			}
		],
		"1584570227_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": [
			{
				"comment_id": 178,
				"body": "Well, just some random facts you could anyway learn from my posts here:\n\nI'm from Siberia, Russia.\n\nIn my spare time, I develop some free software for Linux and for ZeroNet.\nIf I have a choice, I prefer coding in C. But Python and JS are also okay, as long as ZeroNet is implemented in those languages.\n\nI'm a language learning fan. I speak some Slovenian and Serbian/Croatian, and I can also understand to some extent Bulgarian, Slovak, Czech, Polish, Spanish, Portuguese, Italian, Japanese.\n\nI like listening to music from all over the world.\n\nI don't relate to any religion, but I do believe in God. The religion closest to my views is Zen Buddhism.",
				"added": 1584583810
			},
			{
				"comment_id": 181,
				"body": "@krzysztof113:\n\nTopic starter, how about you? It's not very polite to ask for some bio and not to introduce yourself first.",
				"added": 1584584604
			},
			{
				"comment_id": 182,
				"body": "> [bigbadbob](#comment_1032_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I am a banana!\n\nNot a tomato?",
				"added": 1584591536
			}
		],
		"1584569853_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": [
			{
				"comment_id": 179,
				"body": "Old topics and comments might be deleted when people were searching for free space for new posts.",
				"added": 1584584416
			},
			{
				"comment_id": 180,
				"body": "BTW, does anyone remember the old ZeroTalk?\n\nhttp://127.0.0.1:43110/1TaLk3zM7ZRskJvrh3ZNCDVGXvkJusPKQ/",
				"added": 1584584489
			}
		],
		"1584595173_1CpcxT1xWtqTRZTRR1KnH8gGsY2i4rJ7du": [
			{
				"comment_id": 183,
				"body": "> [gitcenter](#comment_1330_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): js/all.js\n\no_O",
				"added": 1584624236
			}
		],
		"1584763992_1CpcxT1xWtqTRZTRR1KnH8gGsY2i4rJ7du": [
			{
				"comment_id": 184,
				"body": "> [sdfsdgasdew](#comment_18_1CpcxT1xWtqTRZTRR1KnH8gGsY2i4rJ7du): Yes , I modified the right file\n\nNo, you didn't.\n\nThe icons are embedded into css.\n\nThis way:\n\n```\n.icon-topic-chat {\n\twidth: 48px; height: 48px;\n\tbackground-image: url(data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAADAAAAAwBAMAAAClLOS0AAAAG1BMVEUAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAACUUeIgAAAACHRSTlMAgNQU5YYaPyFs1vYAAAB6SURBVDjLY6AHYPXowAJaAhgiOrCCVgaPAmzmsLcwdGC3oWPgJRgFUYAATolROxBGCeCUGExRi00CZxIFJWqgJmYNjETN6gGSMMLIBmDzgBrUsFuU1GSAVYJNQxm706AaMCWgNmBKQDVgSijjyNG4NDDg0sCQwEAVAABD2ltuVHtQdgAAAABJRU5ErkJggg==);\n}\n```\n\nYou have to modify css.",
				"added": 1584807331
			},
			{
				"comment_id": 185,
				"body": "> [gitcenter](#comment_1340_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Wait... does this mean one icon is embedded and another one isn't?\n\n\nThe only non-embedded icon seem to be `img/loading.gif`.\n\n```no-highlight\ncontent.json:64:  \"img/edit.png\": {\ncontent.json:68:  \"img/loading.gif\": {\ncontent.json:72:  \"img/topic-chat.png\": {\ncontent.json:76:  \"img/topic-group.png\": {\nindex.html:32:  <li>![image alt](img/logo.png)</li>\nindex.html:78: <div class=\"topics-loading\"><img src=\"img/loading.gif\"/>Loading...</div>\ncss/all.css:221:\tcolor: rgba(0,0,0,0) !important; background: #999 url(../img/loading.gif) no-repeat center center;\ncss/all.css:445:\tcolor: rgba(255,255,255,0); background: #2ecc71 url(../img/loading.gif) no-repeat center center;\ncss/ZeroTalk.css:83:\tcolor: rgba(0,0,0,0) !important; background: #999 url(../img/loading.gif) no-repeat center center;\ncss/ZeroTalk.css:307:\tcolor: rgba(255,255,255,0); background: #2ecc71 url(../img/loading.gif) no-repeat center center;\n```",
				"added": 1584811920
			}
		],
		"1585026249_15NgM1u7cfVeBm4kuHVZ3kQ2a66x35LUKY": [
			{
				"comment_id": 188,
				"body": "Find the `master seed` in your old `users.json` and save it somewhere in a secure place:\n\n```\n\"master_seed\": \"...\"\n```\n\nUnpack a new copy of Zeronet or delete `users.json` in the existing one.\n\nStart and stop ZeroNet. (In order to create a new empty `users.json`)\n\nOpen the newly created `users.json` and replace the `master seed` with your old value.\n\nStart ZeroNet.\n\nGo to ZeroID. ZeroID should recognize that you have already registered and restore your ID data.\n\nNow go to any zite and login as usual.",
				"added": 1585026616
			}
		],
		"1585024413_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 189,
				"body": "Just noticed, the site doesn't open on outdated ZeroNet versions, since content.json contains utf8 paths.",
				"added": 1585044848
			}
		],
		"1595218824_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 190,
				"body": "That is a long-standing bug. Fixed in my fork: http://127.0.0.1:43110/1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y/?Topic:1549373688_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/CHANGELOG+ZeroTalk+forum+engine",
				"added": 1597474608
			}
		],
		"1597502109_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 191,
				"body": "> LimeWire once was the most used file-sharing application worldwide.\n\nWas it? I have no idea about it. Various torrent apps are the most used file-sharing applications as far as I know.",
				"added": 1597502246
			}
		],
		"1597578463_1NgTAHQ6Ee7pWNXbmnJzfSCBNZoMhhbC4G": [
			{
				"comment_id": 192,
				"body": "> OK, is Putin insane enough to intervene in Belarus, to save his comrade Lukashenko?\n\nI don't think so.\n\nThere were a long standing history and background of the Ukrainian-Russian conflict, that made Putin's pro-Russian propaganda possible in the regiones of Ukraine. It's not true in the case of Belarus.\n\nThe Belarusian uprising against Lukashenko is clearly seen as a fight for civil rights, uniting all political movements from conservative nationalists to liberals. The Putin's intervention will result in a full scale war. There will be literally no one in Belarus who support invaders. And it will be very difficult to convince the citizens of Russia in this war as well.\n\nOrdinary Russians do not see regime change in Belarus as a threat to Russia's national security, as far as I know. In fact, many Russians, who oppose Putin, support the Belarusian opposition too.",
				"added": 1597587505
			},
			{
				"comment_id": 193,
				"body": "> [driud](#comment_94_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Przeczytajcie historiÄ™ [...]\n\nIt's funny that speaking 2 Slavic languages and having the English translation of the text, I can understand (almost) each Polish word here. If there were no translation, it would be quite difficult. The Polish orthography is a puzzle for me.\n\nThat doesn't make your point clear, though.",
				"added": 1597592129
			},
			{
				"comment_id": 194,
				"body": "https://twitter.com/BBCSteveR/status/1295003032762097665\n\n> Russian TVâ€™s latest report on Belarus is full of references to â€˜coloured revolutionsâ€™ & claims of foreign meddling. Some truly bizarre moments. â€œThe Poles have dreamed of dominating in the region since the Polish-Lithuanian Commonwealth of 1619.â€",
				"added": 1597596407
			},
			{
				"comment_id": 195,
				"body": "An example of the far-right propaganda: https://sun1.sibirix.userapi.com/c858328/v858328450/230504/sSP0Yd-vUes.jpg\n\nThe picture is from an article written in 2015.\n\nThe picture shows the areas of Belarus (painted in red) that \"were transferred to Belarus by the Soviet Union and should belong to Russia\".\n\nThe author of the article threatens that if Lukashenko \"persists in the heresy of independence, a new People's Republic may appear on the East of the country.\" (reference to Lugansk and Donetsk People's Republics)\n\nThese views, however, are extremely unpopular, and the authors do not represent any political party.",
				"added": 1597598039
			},
			{
				"comment_id": 196,
				"body": "https://twitter.com/novosyolov/status/1295057483766083584 LOL",
				"added": 1597604553
			},
			{
				"comment_id": 197,
				"body": "https://twitter.com/novosyolov/status/1295043059240050688 \n> A Belarusian asked a question to the police:\n> \"Why is there order where there is no police? As soon as there is no police on the streets, there immediately are peace, happiness, joy for the people. And as soon as the police are on the streets, there is terror and disorder. Answer yourself to this question.\"",
				"added": 1597604967
			},
			{
				"comment_id": 198,
				"body": "https://pbs.twimg.com/media/EfjPYCHXgAMzMfn?format=jpg&name=large",
				"added": 1597605207
			},
			{
				"comment_id": 199,
				"body": "!!! Some Twitter users from Russia report that military trucks without identification marks are moving towards Belarus right now.",
				"added": 1597613346
			},
			{
				"comment_id": 202,
				"body": "https://twitter.com/belteanews/status/1295272584569921541\n\nPeople: \"GO AWAY! GO AWAY! GO AWAY!\"\n\nLukashenko: \"Thank you! I answer you on this question. You may shout more.\"",
				"added": 1597653285
			},
			{
				"comment_id": 203,
				"body": "He's totally insane.",
				"added": 1597653311
			},
			{
				"comment_id": 204,
				"body": "Lukashenko: \"We held elections. Until you kill me, there will be no other elections.\"\n\n`Â¯\\_(ãƒ„)_/Â¯`",
				"added": 1597653515
			},
			{
				"comment_id": 205,
				"body": "https://t.me/nexta_live/8577\n\nLukashenko's meeting with the workers' collective seems to be legendary.\n\nLukashenko: \"You working people have always supported the president.\"\n\nWorking people: \"NOOOOOOOO!!!\"\n\nLukashenko, after some pause: \"As a man, I will tell you: the most terrible thing in the life is betrayal.\"\n\nEpic!",
				"added": 1597654271
			},
			{
				"comment_id": 206,
				"body": "https://twitter.com/DominicRaab/status/1295254880790237191\n\n> The UK does not accept the results of this fraudulent Presidential election",
				"added": 1597654439
			},
			{
				"comment_id": 228,
				"body": "Many television employees have quit in protest against being forced to lie to Belarus people.\nThey say Lukashenko has hired employees from Russia.\n\nA news presenter on a Belarus TV just said \"Belarussia\" instead of \"Belarus\".\nA crew of Putin's propagandists haven't accustomed to their new workplace.",
				"added": 1597961641
			}
		],
		"1597641256_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2": [
			{
				"comment_id": 200,
				"body": "> Pin comments to the top\n\nI'll add this to the todo list of my ZeroTalk fork. Thanks!",
				"added": 1597642152
			},
			{
				"comment_id": 201,
				"body": "> The function to delete other peopleâ€™s comments may be against the pursuit of uncensored freedom by Zeronet.\n\nIt isn't. The site owner can do just anything. If you don't want to be censored ever, run your own zite. When you post anything on someone else's zite, technically, it is not your data any more, since it's not only you who are able to control it.",
				"added": 1597642368
			}
		],
		"1597659956_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p": [
			{
				"comment_id": 207,
				"body": "Yellow press.",
				"added": 1597660855
			},
			{
				"comment_id": 208,
				"body": "> [c2vjcmv0](#comment_41_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3): There should be a feature to mark posts as fake, although I guess that feature would be abused like hell :P\n\nThat is why any \"downvote\", \"dislike\", \"mark as unacceptable\" features make no sense.",
				"added": 1597665052
			}
		],
		"1597799191_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG": [
			{
				"comment_id": 209,
				"body": "If there are no significant changes in the near future, we probably should fork it.\n\nI am aware of several problems that have not been fixed for years. My approach is conservative: I prefer fixing bugs and working on improving existing features, rather than introduce breaking changes.\nSo I think we should just provide some maintenance for the core engine and focus on the development of zite engines. The latter is a real issue for now.",
				"added": 1597811831
			},
			{
				"comment_id": 210,
				"body": "The bad news is that not all sources are available. AFAIK there's no source code of the Windows-specific launcher.",
				"added": 1597812016
			},
			{
				"comment_id": 211,
				"body": "> [marcusfinch](#comment_22_1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ):  If you're talking about the ZeroNet.exe, I think that's just built using a pyinstaller package\n\nOh, I didn't know about that.",
				"added": 1597814010
			},
			{
				"comment_id": 212,
				"body": "[The centralized parts of ZeroNet](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1597818504_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/)",
				"added": 1597818568
			},
			{
				"comment_id": 242,
				"body": "> [kapec](#comment_24_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): It works as long as there is no middle-man involved between payer and creator. Only then the creator can be in charge of his/her labor.\n\nIt's 21 century. One can donate to almost any writer, artist, blogger, developer...",
				"added": 1598102526
			}
		],
		"1597818504_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 213,
				"body": "> [xlaits](#comment_2_1QCHWK54BuGgwqcg7ytQYmEQe9pdvpa2Fk): There is no \"centralized\" anything in ZeroNet afaik\n\nThat's not funny how you read about what parts of ZeroNet are actually centralized, and write your \"afaik\".\n\nWithout the server side of ZeroID you can't even register an ID and post to this forum.\n\n[The first version of ZeroTalk](http://127.0.0.1:43110/1TaLk3zM7ZRskJvrh3ZNCDVGXvkJusPKQ/) was a client-server application, and the P2P part was only used as a CDN. Now we have a true P2P forum, but some parts a still managed by the server.",
				"added": 1597826133
			},
			{
				"comment_id": 236,
				"body": "> [marcusfinch](#comment_27_1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ): We could use a routing system like uucp mail where a mail is routed to the user and only copied to machines along the route.  We would need DHT/PEX, though, so a path could be discovered from point A to point B through peers.  Each peer would try to forward to one peer closer until the node was reached, holding onto the mail until it gave it to another peer or a timer expired, etc.\n\nOne of the key features of the existing approach is that nobody actually knows who is the recipient of each letter, and where both a sender and a recipient are located. Neither physically, nor relatively to network peers.\n\nAnother one is that letters can be kept forever, without the need of a server on any side. No such thing as \"time expiration\". I was absent for 4 month, and I'm still able to read what was sent to me in April. I think, it's a mail system after all, not a SMS. It should handle that condition properly.\n\nPersonally, I'd prefer the old mail system, if there were a choice.",
				"added": 1597993874
			},
			{
				"comment_id": 237,
				"body": "> [marcusfinch](#comment_25_1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ): To slow down spammer account creation one possibility is to use proof of work much like bitcoin uses it.  To create a new ID, some problem that takes a long time could need to be solved.  Of course, the determined could set up \"id creation farms\" that do nothing but generated proof-of-work to obtain a lot of Ids, but it's a step in that direction and doesn't require a central authority to approve the person - just has to validate that the work was done.\n\nWhen using PoW, we may just drop the server and count on the PoW itself. Please read my sugestion: http://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/?Post:41\n\nWith PoW-based IDs, it's not possible to register unique human-readable names, but we can deal without them in most cases. Many people here already use meaningless IDs intentionally.\n\nAnd if a person wants to resister a human readable name it's possible to use a third-party network such as Namecoin.",
				"added": 1597994992
			},
			{
				"comment_id": 238,
				"body": "> [marcusfinch](#comment_26_1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ): ZeroID could use blockchain combined with my suggestion below for a proof-of-work to slow down spammers.\n\nI don't think it's a good idea to run one more blockchain.\n\nWe can use simple PoW-based IDs, that have just a hash and no meaningful human-readable name. And for users, who actually want registering a meaningful name, we can support the integration of an already existing blockchain. In the same way as it works for zite addresses. You either use cryptographic hash as an address or pay for registering an address in Namecoin.",
				"added": 1597995534
			}
		],
		"1597847864_15HwpjShZKp2dpMuZqFaariQtJvMawYLVq": [
			{
				"comment_id": 214,
				"body": "> [otbtechnologies](#comment_60_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd): Uncensored vs Censored Sections seems legit...\n\nThe problem is that ZeroTalk is not censorship-resistant by design.\n\nThe owner has full power to do just anything. If she delegates that power to someone else, it's not a big deal. The power is power. It wasn't censorship-free in the first place any way.\n\nIt's possible to use ZeroNet for building both moderated and unmoderated applications, and we should clearly distinguish one from the other. We shouldn't call something unmoderated just because someone has the power to moderate it, but promises not doing that. It should be based on the math.\n\nSo now we have no true unmoderated forum here on ZeroNet.",
				"added": 1597890277
			},
			{
				"comment_id": 215,
				"body": "> [thorburn](#comment_109_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): I don't get why this is an issue if someone has a forum that is badly moderated users will leave and create their own forum. \n\nIt's not an issue itself, but what is the issue:\nThe people come to this forum and they do think that they are totally free to do just anything in this place.\nThey just don't realize that this place has an owner, and they are just guests, who are allowed to post here as long as the owner finds it appropriate.\n\nAnd when I talk about moderation tools, it turns out that it's me who is a bad guy violating their freedom of speech.\n\nThe truth is that if someone can influence what you may or may not speak about, you haven't the freedom of speech in the first place. In the case of this forum, it's just because it's not your forum, and the data you post here is not your data any more as soon as you press the Submit button.\n\n.\n\nI believe it was a mistake when ZeroNet developers made ZeroBlog, ZeroTalk and ZeroMe completely different and independent engines. And especially, the poor integration of ZeroMe and ZeroHello's subscription feeds.\n\nI have already published my thoughts on how we can organize the network in a more integrated and at the same time in a more free way. I repost it here:\n\n.\n\nhttp://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/1583932254\n\n*An author deleted [the topic](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1583926359_1G9KPmTFFXgarsKRjpPuvRd13mYf8aDm3E/), so I repost my comment here:*\n\nJust few days ago, the similar idea was discussed on a Russian Linux forum in the clearnet.\n\nMy thoughts on ZeroMe design:\n\n* The registry address shouldn't be hard-coded in the engine sources. Registries can be added dynamically via the merger feature.\n  * In order to support various user ID providers and possible future extensions of the core design.\n* The existing collective hubs should be used as a cache to keep recent entries.\n  * There also may be thematic hubs, similar to user groups and communities in the clearnet social networking apps.\n* Each user has their own personal hub.\n* When you post a message, it lands to your personal hub as well as to any number of collective hubs, at your choice.\n* An owner of a collective hub can ban you or censor you, but since there possibly will be thousands of collective hubs run by different people, it's practically impossible to ban you from the network.\n* Even if you're banned from a hub, people, who have been subscribed to your personal hub, are still able to read your posts.\n* Comments and likes aren't necessary to be saved at the same hub as the original post. (That's required in the current design.) They can be merged from different hubs. Again, to prevent censorship. And also, to make possible merging different user ID providers and engine extensions. A reader can choose in the settings, if s/he follows the censorship policy of the post author, or prefers merging comments from various sources regargdless of the author's hub config.",
				"added": 1597894173
			},
			{
				"comment_id": 216,
				"body": "P.S.\nThe issue of the mentioned approach is performance. Can ZeroNet deal with a plenty of merge operations? Or have we to develop some other core mechanics to archive a similar result on the application level with a good performance?",
				"added": 1597894393
			},
			{
				"comment_id": 217,
				"body": "> [geekless](#comment_215_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): The people come to this forum and they do think that they are totally free to do just anything in this place.\n\nI thought so too. I changed my mindset when @nofish clearly stated that the site owner has the full control over user-level certs and data, and it's by design. It makes no sense to limit the owner's power, since she controls the JS code of the zite. So she's able to hide, modify or fake any data at the application level.\n\nSo censorship-free applications should be constructed in a such way where each user has the full copy of her data under her own primary key.",
				"added": 1597894703
			},
			{
				"comment_id": 218,
				"body": "> [thorburn](#comment_110_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Giving people the freedom of choice doesn't make you the bad guy. Guns don't kill people...people with guns can kill people if they choose to.\n\nI totally agree. It's all about the freedom of choice.\nThe freedom to join a community ran by some leaders as well as the freedom to go one's own way.\n\n> If the owner of a site is tyrannical in their moderation people will simply leave and go else where. It's not the same as being de-platformed by the by a few monopolosed players.\n\n+1\n\nMoreover, the openness of ZeroNet makes it very hard to tie people to a website or app, as it happens in the clearnet.\n\nYou can easily clone not only the site engine of an existing forum, but also all the content entirely. That makes tyranny hardly possible. Users just migrate to a new zite in a few days or weeks leaving the tyrant alone.\n\nAnother example:\n\nThe admin of http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE paid very little attention to the forum, not updating the engine for years. Many people complained about bugs, missing features and absence of the essential information in the stickied topics. So one day I just copied the whole forum to a new address, and now I run http://127.0.0.1:43110/1RuZntipLvXcLKFEjT6Fr7ZA3GuywYfr5\n\nSuch a scenario just isn't possible in the clearnet. You can't get to the whole site database, nor even easily migrate your own data away.",
				"added": 1597900109
			}
		],
		"1596497359_12kkzRK2n9vRvQLcycbGZNsD3vqzWe1Jeh": [
			{
				"comment_id": 219,
				"body": "Communism is just a mental exercise of some philosophers.\nThe practical implementations were so far from the theory so I really doubt if any of communist leaders actually believed in communism. They used it for propaganda, in order to establish their tyranny.",
				"added": 1597906313
			},
			{
				"comment_id": 220,
				"body": "> [trickstar](#comment_6_1J6U7uZyNHj7BJEDHY7QfJL1V1SFQhZ7pJ): Not many can survive the wrath of Communism y'know...Take Soviet Russia as an example.\n\nBy the way, there wasn't Communism in Soviet Russia officially. There was socialism, which according to the propaganda of the CPSU should result in establishing communism in the (relatively near) future. They weren't embarrassed that such an assertion was contrary to the Karl Marx's theory.",
				"added": 1597907083
			}
		],
		"1597908401_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2": [
			{
				"comment_id": 221,
				"body": "> to transform those vicious spammers into good citizens\n\nImpossible. They are bots after all.\n\n> 1) For users who often post good messages, with little use of curse words, vulgar content, when 50% of the default 50K space is consumed, the 50K limit will be automatically upgraded to be 100K.\n\nNot possible with the current implementation of ZeroNet core engine.\nThe application-level space limits are not supported.\nNamely, an application can generate new limits, but there's no way to inject those without the admin.\nThere should be a person who can write to `data/users/content.json`.\n\n> 1) For users who often post derogatory messages, with frequent use of curse words, vulgar content, when 10% or 25% of the default 50K space is consumed, the 50K limit will be automatically downgraded to be 40K.\n\nAre you aware that any autodetection of obscene words can be fÐ¸ÑÐºÎµÑ‚ Ð¸Ñ€?",
				"added": 1597909348
			},
			{
				"comment_id": 223,
				"body": "> [c2vjcmv0](#comment_52_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3): ...and user voting \"karma\" is not a grantee that the information that is up-voted is accurate. Just look at the shit storm that is reddit or hackernews.\n\nOr StackExchange...",
				"added": 1597921647
			},
			{
				"comment_id": 224,
				"body": "> [wwg1wga](#comment_25_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF): Exactly. Some just suggested user moderation by vote and I brought this up. They claim they only want to moderate spam and CP for example. Thats how it starts then things get convoluted of course. Just like with any other form of government.\n\nWhat's wrong if a person runs a site with some silly moderation rules? It's his/her choice and nothing forces you using it.\nDo you really think John Doe can establish a government to rule you?",
				"added": 1597921906
			},
			{
				"comment_id": 225,
				"body": "> [wwg1wga](#comment_26_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF): Look at America; a country of rebels that formed their own government aside from the English. These now deceased ancestors of the American people had formed their own government back in the 1700s which has become corrupt. So, now the people of America are in the process of overthrowing said corrupt government while simultaneously forming their own form of government as we all speak...\n\nWhat does this story have to do with such private property as a personal website?\n\nWhen you are on your own territory, you freely decide who is allowed to enter and on what conditions. The same for your own website.\n\nAnd if you dictate someone what they may or may not do on their territory, THAT IS a violation of basic freedoms. That is exactly what happens when you say that someone should not set moderation rules.\n\nYour are free to go and publish anything on your own site and set your rules there as well. But not to dictate how other websites should work.\n\n> No they want to force people to delete their content if the admin's appointed moderators downvote it though... Which is censorship...\n\nOkay, let's take a look:\n\n```\n$ grep false 1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT/data/users/content.json \n   \"authhh@zeroid.bit\": false,\n   \"bad@zeroid.bit\": false,\n   \"doom1@zeroid.bit\": false,\n   \"doom1b@zeroid.bit\": false,\n   \"hakudushi@zeroid.bit\": false,\n   \"realdonaldtrump@zeroid.bit\": false,\n   \"requrequ@zeroid.bit\": false,\n   \"sdh@zeroid.bit\": false,\n   \"xp@zeroid.bit\": false,\n```\n\nThese are accounts that have been banned from the site. So does nofish do censorship or not?\nIf he does, looks like you have to leave this forum in accordance to your principles.",
				"added": 1597939196
			},
			{
				"comment_id": 226,
				"body": "> [wwg1wga](#comment_28_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF): nofish, being the owner of a Zite that is highly popular and is an introduction point for new users to ZeroNet holds more power as is and thus would be wise how he chooses to use his power.\n\nCensorship is bad unless it is nofish who censor you.\n\nLOL. I got your point.",
				"added": 1597956829
			},
			{
				"comment_id": 229,
				"body": "> [wwg1wga](#comment_33_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF): Putting words in others mouths is a cheap trick in the field of politics.... Lol :)\n\nJust stop seeding this forum since nofish censors people. It's that simple.",
				"added": 1597986008
			},
			{
				"comment_id": 230,
				"body": "> [freemankind](#comment_27_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue): we dont need censorship heredont seed the zites you dont want to see\n\nSo should I stop seeding my own zite if some asshole comes and posts CP there?\n\nAnd who is responsible of what each zite is for?\nAn owner? Or some random people who come and post some shit there?\n\nWhat you're talking about is fucking Socialism: \"All I have is mine and all you have is mine too. I may just go and post anything anywhere just because fuck you, that's why.\"\n\nThat's not reality. If you enter my house intending to kill me, I shoot you, and if you enter my zite intending to destroy it, I ban you.\nThat's how human rights work. Socialism failed, you know?",
				"added": 1597986470
			},
			{
				"comment_id": 231,
				"body": "> [wwg1wga](#comment_34_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF): Exactly.Fuck all the Socialist and Communists on here that say otherwise. Fr fr... :-S\n\nSo looks like you have to fuck yourself. \"Take everything and divide it up for everyone\", that's called Communism.",
				"added": 1597986589
			},
			{
				"comment_id": 232,
				"body": "Nice attitude to take ZeroNet down, by the way.\n\nA government officer: goes and posts CP everywhere.\nNobody: deletes this shit since it would be terrible censorship.\nThe government: \"Look, they are posting CP everywhere in this fucking darknet! Declare the devs on the international wanted list! Take down all the public nodes!\"\n\nGreat plan.\n\nWhen Chinese spammers flooded ZeroTalk and ZeroMe with lots of meaningless messages making the zites unusable, sure users were delighted with freedom of speech... oh wait... no, they were delighted when nofish deleted all that stuff. And they weren't just stop seeding the zites during the attack, as you would like them to do.",
				"added": 1597987813
			},
			{
				"comment_id": 233,
				"body": "> [otbtechnologies](#comment_65_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd): Only a fool would bother argue with these subhumans.\n\nA typical fighter for free speech: \"censorship is unacceptable\".\nThe same fighter: classifies people into Ãœbermensches and Untermensches.",
				"added": 1597988561
			},
			{
				"comment_id": 235,
				"body": "> [zerolady](#comment_21_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p): So another suggestion is that all those advertisements related to porn content be automatically pushed into another category, which can be named as \"Special Categoryâ€, under an independent folder, with an independent label just as the language marks on the toplinks of the webpage. In this way, porn content will not be banned, but itâ€™d be regulated. How about the idea?\n\nNot sure if it works.\n\nThe complete automatization isn't possible, human intervention will still be necessary.\nThere will be false negatives, when porn have to be moved to its category manually.\nAnd what is much worse, there will be false positives, so users have to fight the automation in order to communicate.\n\nAnd the question is why they need \"Special category\" at all on a site where they aren't welcome? Why not to run a thematic site and publish there freely just anything one wish?\n\nThe whole ZeroNet is like a big social app. We can use the same IDs on any zite, create new blogs and discussion boards in just 2 clicks etc.",
				"added": 1597992179
			},
			{
				"comment_id": 243,
				"body": "> [kapec](#comment_25_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): If at all it should be done as an external plugin/addon in which the end user can tag inappropriate content/user to his/her individual liking and moral values. \n\nDo you mean [blocklists](http://127.0.0.1:43110/1CufK1ZtvekbFXEpSyKT2gDjf9jnqW8KwG/)?",
				"added": 1598111905
			}
		],
		"1595165517_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 222,
				"body": "> For a while, I was seeing comments appearing on ZeroTalk every couple of minutes. Now, that has slowed to hours. \n\nMaybe it's because ZeroTalk lacks many features people are used to, and its development stagnates for years? People don't see any progress of ZeroNet.\n\nWell, I remember the high activity on ZeroTalk too. There were many posts in Chinese. Then they migrated to a separate subforum. Then, to a distinct copy of ZeroTalk, I guess. But even without users from China, the main forum was active. There were many discussions every day.\n\nThe same in ZeroMe, not only ZeroTalk. New posts appeared every few minutes in the \"Everyone\" feed previously. There were many posts both in English and Chinese, I guess, 50%/50%. Now ZeroMe looks extinct. Is GFW now totally impossible to pass, or Chinese people just have disappointed of ZeroNet in the same way as English-speaking ones?\n\nAnother reason I know of is lack of news about ZeroNet in the clearnet. We just have no significant releases and there's nothing to post news about. Just look at various federative networks, IPFS etc. There ARE news about those on many websites, but not about ZeroNet. Nobody knows about us.\nThere is a reason why Ubuntu makes releases twice a year no matter if they have any significant progress or not. It's kind of advertising, to be visible to people.\n\nbalancer73 and me tried to promote ZeroNet at www.linux.org.ru, a large Russian-speaking community. Several people came here from that site. Now balancer73 is dead, and I erased my account entirely from that site for personal reasons.\n\nMany people are fond of federative social platforms because those platforms have a fancy-schmancy design, don't require to install anything on the computer and promise the \"free\", \"uncensored\" communication. We should actively promote ZeroNet and P2P technologies in general, explain people that the federative approach shares the same flaws as centralized services and also has somewhat worse drawbacks. Federative social media can be easily taken down, can be censored, users may be banned, and users don't control their data. We should tell why it is important, and why the freedom of speech guaranteed by the cryptography is a huge step forward compared to applications that just promise you freedom without any guarantee.",
				"added": 1597917025
			}
		],
		"1597936978_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 227,
				"body": "> [freemankind](#comment_26_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue): if he was real opposition he would already be dead, he is being groomed to be the new putin with a legacy of \"fighting\" him so he couldn't possibly be just like him\n\nA typical government propaganda.\n\n*Everything is predetermined. Everyone is being watched. They kill you if you go against them. Resistance is futile. There's nothing you can do. Just stay home and watch TV.*",
				"added": 1597957132
			},
			{
				"comment_id": 234,
				"body": "*Doctors of the Omsk hospital refused to transport Alexei Navalny to Germany*\n\nhttps://translate.google.ru/translate?hl=ru&sl=ru&tl=en&u=https%3A%2F%2Fmeduza.io%2Fnews%2F2020%2F08%2F21%2Fvrachi-omskoy-bolnitsy-otkazali-v-perevozke-alekseya-navalnogo-v-germaniyu",
				"added": 1597991221
			},
			{
				"comment_id": 239,
				"body": "https://twitter.com/nekulachenkov/status/1296677780646748160\nOmsk doctors do not allow Navalny to be transferred to another hospital, claiming that he is not transportable, even though Navalny's friends and colleagues have found specialists who know how to transport him.\n\nhttps://twitter.com/nekulachenkov/status/1296680729473155073\nAccording to Navalny's spokesperson Kira Yarmysh, the doctors initially said they would be ready to allow Alexei's transportation, but suddenly changed their minds at the last moment.\n\nhttps://twitter.com/nekulachenkov/status/1296677882715045888\nNavalny is practically being kept hostage and denied any opportunity to receive the necessary treatment\n\nhttps://twitter.com/nekulachenkov/status/1296686462805651457\nOne of the policemen at the hospital told Ivan Zhdanov that the poison found in Navalny's body is dangerous not only for him, but also for the others\n\nhttps://twitter.com/nekulachenkov/status/1296703097239199750\nAlburov: the only reason not to allow Navalny to be taken to a plane that is equipped better than the hospital and has all the specialists on board is the desire to wait until all traces of the poison disappear from his organism\n\nhttps://twitter.com/nekulachenkov/status/1296720143297523713\nPhoto from the head physician's office. The head physician himself is absent, the three suited men refuse to introduce themselves or answer any questions about Navalny\n\nhttps://twitter.com/nekulachenkov/status/1296720272666632192\nThe same doctor who talked about a deadly poison an hour ago now claims that they haven't found any signs of poisoning so far. He also says they've already told the diagnosis to Navalny's wife and brother",
				"added": 1597998695
			},
			{
				"comment_id": 241,
				"body": "The head physician says it's not posoning but just diabetes.\n\nSo it's because of diabetes Navalny can't be transported to Germany?\n\nThe head physician can literally be considered as a criminal who takes part in the homicide.",
				"added": 1598006572
			}
		],
		"1597999990_1EvSiWY7H61zpcecgT2uAMD5QGA5AFJEq6": [
			{
				"comment_id": 240,
				"body": "> a bunch of normies realized they could be making a profit buying and selling turning the current crypto scene into \"get rich quick\" vaporware.\n\nThat was quite predictable.\n\n> Could the tradition functions of governments be decentralized and regulated with cryptocurrency \"tax\" collection and granting privilege to private key holders for their services? \n\nI don't think so. Not in the foreseeable future. It's just meaningless bytes, if lots of people aren't ready to support the idea. First the society as a whole should change in some direction. It should be done by real people in real politics.\n\nGovernments are likely able to maintain the status quo for ages. People are too unorganized, confused and brainwashed to take real steps towards new ways of social organization.\n\nIt is similar to how the transition from empires to democratic republics was carried out. The idea has matured for long time until the masses realized that they don't need and don't want the old power to rule.",
				"added": 1598001869
			}
		],
		"1594775906_1ufDwJisEDriKQxYJSz2HuUhgqAG15JyL": [
			{
				"comment_id": 244,
				"body": "> \"I think that making some standalone mobile applications for popular Zites (ZeroMe, for example) where you just open the app and are immediately presented with the content - might really improve the ease of use for new users.\n\n+1\n\nThat is what I have been thinking about for a long time.",
				"added": 1598114063
			},
			{
				"comment_id": 245,
				"body": "@ astrr232:\nYou blog lacks `data/users/content.json`, so visitors aren't able to comment and like your posts.",
				"added": 1598114237
			}
		],
		"1598113485_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 246,
				"body": "> [anonymouslogin](#comment_216_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X):  http://127.0.0.1:43110/14Famoc8KJoS5T9WCSbzxGAmA6TfXcdSPD/\n\nWhere's the source code?",
				"added": 1598168632
			},
			{
				"comment_id": 247,
				"body": "There are no sources. It's an autogenerated JS one have to manually decompile back to CoffieScript.\nIn that case, it's better to reimplement the missing functions from scratch.",
				"added": 1598172740
			},
			{
				"comment_id": 252,
				"body": "> [anonymouslogin](#comment_216_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Search engine\n\nNow in ZT++ too.\n\nThe same restrictions for now. Searches only for topics, not comments. Work in progress.",
				"added": 1598267941
			},
			{
				"comment_id": 256,
				"body": "> set such settings on site, not needing to accidentaly find some undescribed option in content.json file\n\nNot yet. It's possible to port the admin settings page from ZB++...",
				"added": 1598542425
			}
		],
		"1598175701_197jsoB6dvq3kKxENBre1AfZhG5JbhXrRF": [
			{
				"comment_id": 248,
				"body": "> PHP language\n\nDude, PHP has nothing to do with ZeroNet sites. It's all about JS, HTML and CSS.",
				"added": 1598177093
			},
			{
				"comment_id": 249,
				"body": "> This newly added section is planned to appear at the bottom center position of the page, instead of the left position.\n\nThis way?\n\n```\n\n  <div class=\"links\" style=\"text-align: center\">\n  <a class=\"prev\" href=\"http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/\">â† <span>Home</span></a>\n  <a class=\"next\" href=\"http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:8_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p/Some+special+information+on+Coronav\n  <a href= \"http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Home\">é¦™æ¸¯å’Œå¤§é™†è”åˆèµ·æ¥ï¼</a> é›¶ç½‘ â€” é›¶å°é”ã€å¹¿ä¼ æ’­ <br>\næŠŠå…¬ç½‘é¡µé¢è½¬æ¢ä¸ºhttp://127.0.0.1:43110/ ......  å¼€å¤´çš„é›¶ç½‘æœ¬æœºé¡µé¢ï¼Œæ˜¯é›¶å°é”çš„ç½‘ç»œåˆ›ä¸¾ï¼<br>\n  <a href= \"http://zeronet.io\">ZeroNeté›¶ç½‘è½¯ä»¶</a> â€”åºŸé™¤ç½‘ç»œå°é”ã€åŽ»é™¤ä¿¡æ¯é›¾éœ¾ <br>\n  <strong><a href= \"http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1597510687_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc/Watch+NOW+before+this+is+taken+down+ShadowGa\n  <a href= \"http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1597510687_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc/Watch+NOW+before+this+is+taken+down+ShadowGate\">the\n\n  <strong>A Hot Topic at the Sensitive Season â€” <a href= \"http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1597510687_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc/Watch+\n  <a href= \"http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:20\">é“è¡€æ³•æ²»ã€æ›¿å¤©è¡Œé“ï¼</a> é›¶å°é”ã€å¹¿ä¼ æ’­<br>\n  <a href= \"http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:8\">æ´—é›ªå½“ä»£å›½è€»ã€ç»Ÿä¸€è™šæ‹Ÿä¸»æƒ </a>ç”± <a href= \"http://zeronet.io\">ZeroNet </a> é©±åŠ¨<b\n  <a href= \"http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/\">éžæš´åŠ›çˆ±å›½è¿åŠ¨è®ºå›</a>  &middot;\n  <a href= \"http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:5_1PkZ7yY9mWov9ndHGG327hJSAEmfB5jj5/\">æŽ¨å¢™ä¸Žæ³•æ²»â€”æŽ¨ç‰¹å…šçš„é‡è¦ç›®æ ‡</a> <br>\n  </div>\n```",
				"added": 1598177674
			},
			{
				"comment_id": 250,
				"body": "By the way, why do \"some Christians\" have a site all in Chinese? Just wondering...",
				"added": 1598177853
			},
			{
				"comment_id": 251,
				"body": "> [techmgr](#comment_1_197jsoB6dvq3kKxENBre1AfZhG5JbhXrRF): IPFS technology\n\nIPFS may be used if you are okay with the fact that IP addresses of you and all your visitors are public and observable by the whole world. If it's not okay, it's better to use ZeroNet over Tor.",
				"added": 1598178039
			}
		],
		"1598305624_1PFBZmDixgHPejjatauiJQHUukQcqjMCxN": [
			{
				"comment_id": 253,
				"body": "> [mg0](#comment_340_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): I do so with a custom .pac file in firefox (desktop, not mobile).\n\nI just set SOCKS5 proxy 127.0.0.1:9050 in the preferences tab.\nConnections to 127.0.0.1 are never proxied, so ZeroNet can be accessed.\n\nAnd the clearnet is unreachable, since there's no proxy running on 9050.\nWhen necessary, I run Tor on this port.",
				"added": 1598379059
			}
		],
		"1598405387_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb": [
			{
				"comment_id": 254,
				"body": "> [zaron](#comment_184_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): How do we know you're not all the same person?\n\nAt least two of IDs:\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1598232523_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb/\notbtechh22f4wcu: \"Excerpt from my book\"\nwwg1wga: \"Its already widely distributed, but since it was written in 2019 I have a few things to tweak.\"",
				"added": 1598438105
			}
		],
		"1598385884_1JEkT4fCm1xo9HX4KPHLJM341j9M1bVYBa": [
			{
				"comment_id": 255,
				"body": "> [frtgvc](#comment_1_1JEkT4fCm1xo9HX4KPHLJM341j9M1bVYBa): but is like 2 years old\n\nWe have no other developers for you.",
				"added": 1598442272
			}
		],
		"1598551981_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 257,
				"body": "Yeah, nice application.",
				"added": 1598607529
			},
			{
				"comment_id": 261,
				"body": "> [claude](#comment_4_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1): sir, this is an english forum\n\n+1\n\nWell, he says he read the article and he saw commands for installing OnionShare under Ubuntu there. And Ubuntu is not Linux, blablabla etc.",
				"added": 1598715995
			},
			{
				"comment_id": 262,
				"body": "> [driud](#comment_110_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH):\n\nDude, just build it from the sources under any Linux distribution you wish. Are you a Linux user independent from corporations, or just yet another snowflake blaming all over the world for your own problems?",
				"added": 1598716005
			}
		],
		"1598683262_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 258,
				"body": "> They better take down all the webbrowsers, email-clients, chat-apps, games, Well, everything since it can be abused in any way.\n\nLOL. Yeah. Google should ban Chrome first.",
				"added": 1598713043
			}
		],
		"1591804075_12MBVCw8iNrKvgTrV5NMPtPf6Z5V2WRHYU": [
			{
				"comment_id": 259,
				"body": "> Could something like the size of Facebook exist here?\n\nIt probably could, if we switch to that design:\nhttp://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/1583932254\n\nThe current hub model is not very scalable.",
				"added": 1598713489
			}
		],
		"1598706433_14ZGwsuBg5ZUhu3VZpp3yXeVQcES4N4DeN": [
			{
				"comment_id": 260,
				"body": "http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/1583932254\n\nIf you are able to write code, you are welcome.",
				"added": 1598713729
			}
		],
		"1603476273_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 263,
				"body": "> [gitcenter](#comment_1414_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): This simply does not work. Others have tried this. People have created forks, cloned ZeroTalk for different topics, etc. -- but no one uses them because https://zeronet.io references the official distribution, everyone links to nofish 'es sites, and he refuses to add any mentions of external services to ZeroHello.\n\nIt's not a nofish'es problem. It's our problem. If we, the community, are not able to run the network in a decentralized way, why the hell we talk about decentralization at all?\n\nSo that's the problem we should solve ourselves.",
				"added": 1603518150
			},
			{
				"comment_id": 265,
				"body": "> [bigbadbob](#comment_1168_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): When was the last time anyone got an increase? \n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/data/users/content.json\n\n```\n\"modified\": 1590595520\n```\n\n27 May 2020",
				"added": 1603645682
			},
			{
				"comment_id": 275,
				"body": "> [gitcenter](#comment_1418_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): It's not like we can't do anything without nofish, it's that we can't do anything against nofish. [...]\n\nI missed that long post somehow. My answer is: any big work can be done by little steps. Provided that someone actually makes those steps.\n\nI've spent the last week and a half digging into the network code. You can see my progress here:\n\nhttps://github.com/zeronet-enhanced/ZeroNet/commits/massive-rework\n\nThe problem we are struggling with is not nofish, but time. There are only 24 hours in a day, and most of them, one should do something for living. I'm not aware of your progress, but what about me, I'm not physically able to write code any faster compared to what you can see in the git log above.\n\nFor example, tomorrow I'll be busy all day, the day after tomorrow I go to dentist, then, Saturday and Sunday both are fully scheduled as well. So tonight is the last time I can pay some time to ZeroNet development in this week.\n\nBack to the topic: as I said earlier, ZeroNet's now working \"somehow\" and nobody knows exactly how and why. The code needs reviewing and auditing. Many bugs have been lasting since the beginning of time, and there are lots of relatively new regressions as well. The poor network connectivity is what we used to, but that's not how a P2P network is intended to work. It should be fixed before we move any further. ZeroNet is not even under attack yet, but performs bad on its own. \n\nAnd we should stop talking about new features until the existing features are fully debugged and proved to work. If one is going to be a ZeroNet developer, he or she should take the responsibility of the existing code base. It is not a question of who will have priority in what. It's a question of how to make a damned thing working.\n\nI've made a lot of changes to the networking logic related to pulling and pushing site updates between peers. It performs much better in my test cases now, and the overall network connectivity should get better after these changes appear in the release version. But I'm still facing freezes and instability from time to time, so there is still a lot of work there.\n\nNow I need a break from this network stuff, so I switched to the Content module. I'm going to implement multisign support... I mean, **working** multisign support instead of the broken one we have right now. A site owner will be, at any time, able to grant and revoke the right of signing the root content.json to any number of keys.\n\nIt will probably break the current multisign implementation, but since it's broken in the first place, I guess nobody uses it, so nobody will be affected.\n\nI also need to finish debugging a couple of plugins I plan to integrate to the repository, and then I'll be able to make a release.\n\nAs you can see these changes are not so fantastic as those you talked about in these days. But that's the real level of coding I can provide.\n\nI'm upset of you not sharing my views on ZeroNet development, but, well, so I will do it on my own. Hopefully there will be a community around ZeroNet development some day.",
				"added": 1604498246
			},
			{
				"comment_id": 280,
				"body": "> [geekless](#comment_265_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): \n> \"modified\": 1590595520\n> 27 May 2020\n\nNo updates since that.\n\nWhich ZeroMe hubs are controlled by nofish? I guess at least these ones:\n\n> http://127.0.0.1:43110/1White24UrrwQrD86o6Vrc1apgZ1x1o51/data/users/content.json\n> Jan 10 2020\n\n> http://127.0.0.1:43110/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/data/users/content.json\n> Aug 13 2019\n\n> http://127.0.0.1:43110/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/data/users/content.json\n> Feb 18 2020\n\n> http://127.0.0.1:43110/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/data/users/content.json\n> Nov 30 2019\n\nZeroSite doesn't receive any automated updates as well.\n\nSo I conclude, nofish's servers/laptops/whatever that ran the maintenance routines for his zites are offline for long time.\n\nWe don't even know if he is alive or not. Is it safe to continue using these zites? They can be erased at any time, if the keys are in wrong hands.\n\nFortunately, ZeroID keeps working. But can we trust it?",
				"added": 1616652806
			},
			{
				"comment_id": 282,
				"body": "http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/?Topic:1616666284_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/",
				"added": 1616666396
			}
		],
		"1603608731_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 264,
				"body": "> [gitcenter](#comment_1436_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Let's start with proposals\n\nWe already have a lot.\nWhat we actually don't have is the manpower.\n\n> That would be kind of unfortunate if no one uses the fork because why should I make it in the first place? Anyway, let's do that and see how it goes.\n\nYou won't change people's mind by just talking to them. People change their mind when they see some real progress and perspective.",
				"added": 1603645403
			},
			{
				"comment_id": 266,
				"body": "> [gitcenter](#comment_1438_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I know?.. You aren't telling me anything new, I just wanted to know if anyone is actually going to use a fork if I make it; I've got the response and it's 'Yes' so just wait and don't expect me to give you lots of code in two days, ok?\n\nÐšÑƒÐ´Ð° ÑÐ»Ð°Ñ‚ÑŒ Ð¿Ð°Ñ‚Ñ‡Ð¸?))",
				"added": 1603648945
			}
		],
		"1603695205_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 267,
				"body": "When I talk people about ZeroNet, I still sometimes have been asked why the latest version cannot run on WinXP 32-bit. I have to explain that it's due to py3 not supporting this configuration any more.",
				"added": 1603697313
			},
			{
				"comment_id": 269,
				"body": "> [gitcenter](#comment_1445_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Perhaps I should be more specific... it's a virtual filesystem driver.\n\nSounds not good. ZeroNet should run and be fully functional without admin privileges.",
				"added": 1603698616
			},
			{
				"comment_id": 270,
				"body": "Edit files?\n\nZeroNet is like \"Torrents made right, with cryptography and batteries included\". So you just edit files, sign files, and it works. No bullshit over there.\n\nWhat you describe is something very different from the initial idea.\n\n> is the best solution I've found to support content-addressed data, data deduplication and merkle trees at the same time optimally.\n\nJust make the data deduplication optional and disable it for \"owned\" sites by default. The data deduplication should be a feature that makes things better, not worse.\n\nAnother possible option is to virtualize not user file paths, but ZeroNet's file paths. So, if I have a large folder with books, and I want to share some books over ZeroNet, I go to an improved version of ZeroUp, point ZeroNet what books I want to share, and it remembers their file paths and represents them at the API level as if they were physically located under ZeroUp directory.\n\nWhen implementing the content-addressable storage, you have to implement the file path virtualization at API level anyway. So it can be extended for making sharing big files easier at the same time.\n",
				"added": 1603700080
			},
			{
				"comment_id": 271,
				"body": "I have always been unhappy that ZeroNet imposes restrictions on filenames (restrictions that are not required in BitTorrent, and BitTorrent is still fully cross-platform) and zite structure. I was thinking about how to remove these restrictions and make the use of ZeroNet more transparent so that a user doesn't have to rework half of their directory structure just to share some files over ZeroNet and keeping these files in the home directory at the same time.\n\nSo now you suggest introducing one more level of indirection between a user and the user's data, so that starting using ZeroNet one day, he or she have to keep using it just to deal with their own files. Hmmm...",
				"added": 1603702008
			},
			{
				"comment_id": 272,
				"body": "That doesn't look like going to be constructive. I'd rather quit here. Sorry.",
				"added": 1603702991
			},
			{
				"comment_id": 273,
				"body": "> [gitcenter](#comment_1453_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Sorry, that's not how development works.\n\nFor sure you know better. Why the hell do you talk about collaboration, if there are just 2 opinions in the universe: one is yours and the other one is wrong.\n\nI won't write any code on the code hosting platform of your choice, for the architecture of your choice, following the roadmap of your choice, etc. The nice thing is that you don't need my assistance any way, so we have nothing to argue about.",
				"added": 1603704039
			}
		],
		"1604079393_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 274,
				"body": "It never worked in the first place. So RIP.",
				"added": 1604091337
			}
		],
		"1616231596_1CQzPmMXnfH3eJvpKGNfsVnUXxiHZM3jp2": [
			{
				"comment_id": 276,
				"body": "> [floatingghost](#comment_1_1KkANbCsG8Naxc2u5oCaVr9agkAN9tGQCi): We are all ghosts. Let's go to heaven. Btw, tor-0.4.6.1-alpha removed v2 onion. We will be unable to use \"Tor Always/Enable\" in zeronet soon. This is true death of zeronet for me!\n\nWe should fix it. Doesn't look difficult at the first glance.",
				"added": 1616478827
			},
			{
				"comment_id": 295,
				"body": "ZeroNet trackers are limited to accepting v2 addresses only in the current implementation.\nWe have 5 months to fix the code and upgrade the trackers (or run new ones).",
				"added": 1617261166
			}
		],
		"1613138654_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": [
			{
				"comment_id": 277,
				"body": "> This attribute makes people feel as if they are secretly doing something illegal when they use it. \n\nIt actually depends on what country you are in.",
				"added": 1616577036
			},
			{
				"comment_id": 278,
				"body": "> I often open a certain ZeroNet site and browse it, then I canâ€™t wait to delete it, and then download it next time I want to see , I feel very irritable to repeat it. But leaving the database on the computer to occupy storage space and network bandwidth feels a loss\n\nWow. You're doing it wrong. %) Or maybe ZeroNet just does not meet your expectations, but there's no bug that should be fixed.\n\nAnd ZeroMe... unfortunately, ZeroMe is broken by design. There should be a tighter integration between ZeroBlog, Zerotalk and ZeroHello engines instead. ZeroHello itself can be redesigned for functioning as a frontpage of a social media. We had no need of ZeroMe in the first place.\n\nMy 2 cents: http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/1583932254",
				"added": 1616578245
			}
		],
		"1616552733_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 279,
				"body": "A complicated bug...\n\nLooks like desync between the actual file data and the DB cache:\n\n```\n[21:40:21] Site:1TaLkF..jipT CheckModifications: Peer:167.179.77.133 of 1TaLkF..jipT has older version of data/users/1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG/content.json, publishing there (1/5)...\n[21:40:21] Site:1TaLkF..jipT CheckModifications: Peer:167.179.77.133 of 1TaLkF..jipT has older version of data/users/1EWfVBr3cRiXcK8iS9Ytwky7VCVTSbv4Fs/content.json, publishing there (2/5)...\n[21:40:21] Site:1TaLkF..jipT CheckModifications: Peer:167.179.77.133 of 1TaLkF..jipT has older version of data/users/1P15MJjsGY8M8pMyDxnU4vESgJFzHzbLy3/content.json, publishing there (3/5)...\n[21:40:21] Site:1TaLkF..jipT CheckModifications: Peer:167.179.77.133 of 1TaLkF..jipT has older version of data/users/1HeEWnYs69J1BV4P4niDN775yBVqNijhjG/content.json, publishing there (4/5)...\n[21:40:21] Site:1TaLkF..jipT CheckModifications: Peer:167.179.77.133 of 1TaLkF..jipT has older version of data/users/1LVTLq9JeFiFMnhJKuZiUfK8urw9DBd4w/content.json, publishing there (5/5)...\n[21:40:21] Site:1TaLkF..jipT CheckModifications: 19 new modified file from Peer:167.179.77.133 of 1TaLkF..jipT\n[21:40:21] Site:1TaLkF..jipT [OK] 167.179.77.133:23333: File not changed 1/1\n[21:40:21] Site:1TaLkF..jipT [OK] 167.179.77.133:23333: File not changed 1/1\n[21:40:21] Site:1TaLkF..jipT [OK] 167.179.77.133:23333: File not changed 1/1\n[21:40:21] Site:1TaLkF..jipT [OK] 167.179.77.133:23333: File not changed 1/1\n[21:40:21] Site:1TaLkF..jipT [OK] 167.179.77.133:23333: File not changed 1/1\n```\n\n```\n[21:41:10] Site:1MaiL5..Ju27 CheckModifications: 3 new modified file from Peer:193.183.98.77 of 1MaiL5..Ju27\n[21:41:11] Site:1MaiL5..Ju27 CheckModifications: 2 new modified file from Peer:144.91.93.204 of 1MaiL5..Ju27\n[21:41:11] Site:1MaiL5..Ju27 data/users/18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH/content.json: verify error: VerifyError: We have newer (Our: 1616616464, Sent: 1602202613) in ContentManager.py line 1025 > 961\n```",
				"added": 1616622597
			}
		],
		"1616503348_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 281,
				"body": "@zeroseed4\n\n@styromaniac\n\nI'm moving to [my own forum](http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/).",
				"added": 1616664479
			}
		],
		"1615948566_19RaaMJeGXcJzLxeKXWH9pynfjgmm33VZS": [
			{
				"comment_id": 283,
				"body": "There's no such thing as \"server\" in Zeronet, nor \"client\".\n\nAny instance of the application is a \"peer\", and all the peers work in the pretty same way.",
				"added": 1616677236
			}
		],
		"1548671064_1PpoRxgiiEd3xCZ4MDUxx3m87JbAPDCaHK": [
			{
				"comment_id": 284,
				"body": "The code compares the list returned by `site.content_manager.getValidSigners(inner_path)` with the value of `user.getAuthAddress(self.site.address)`. So the problem can be in any direction: either `getValidSigners()` returns the wrong list of keys allowed to sign the file, or the application forgets the choosen auth address.\n\nIf rechecking the files from UI helps, I'm inclined to blame `getValidSigners()`.\n\nIs there a sustainable way to reproduce the problem?",
				"added": 1616679100
			}
		],
		"1615555101_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 285,
				"body": "@zeroseed4,\n\nHow about adding to the proxy:\n\n* http://127.0.0.1:43110/1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y/\n* http://127.0.0.1:43110/1fzncZRMPGPBdyUBm2ATVSkRAsnvMq5VN\n* http://127.0.0.1:43110/1fznctFebYHnmjmFZCmAWPd7nnamAy3Tg\n* http://127.0.0.1:43110/1fznc4VQbbrQAf4UzHrWS6W2mpGFqXSeD\n* http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD\n* http://127.0.0.1:43110/1fzncJdLpbsT5eeeYP14EKSaStHhtn5LY\n* http://127.0.0.1:43110/1fzncGxeyDpbCz1CkvBkooEDsXGFq1GfK",
				"added": 1616680714
			}
		],
		"1610690590_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 286,
				"body": "> [deuxzaron](#comment_121_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): Isn't it on github? couldn't it just be forked?\n\nIt's not so simple \"just\".\n\nhttp://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/?Topic:1616666284_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/What+if+the+original+infrastructure+is+lost",
				"added": 1616730006
			}
		],
		"1616209212_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": [],
		"1612011009_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": [
			{
				"comment_id": 288,
				"body": "> i already deleted the main ZN content . db file.\n\nZN or ZM? Each zite has its own DB. Try rebuilding ZeroMe DB.",
				"added": 1616764223
			},
			{
				"comment_id": 289,
				"body": "> After rebuilding ZM db now, one more recent post appeared \"Mar 22, 2021\".\n\n:-D What a naughty thing...",
				"added": 1616765247
			}
		],
		"1616648188_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 290,
				"body": "> [caryoscelus](#comment_297_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): \n\nYep. I talked about the autodeletion feature.",
				"added": 1616777848
			},
			{
				"comment_id": 291,
				"body": "> [xcape2net](#comment_840_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): As a site owner, how can I delete a post without it being reinserted automatically by other seeders?\n\nhttp://127.0.0.1:43110/1fznc4VQbbrQAf4UzHrWS6W2mpGFqXSeD/?Topic:1616805960_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/",
				"added": 1616806026
			}
		],
		"1616688942_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 292,
				"body": "New forum features:\n\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/1616923066-ztpp-toolbar.png",
				"added": 1616923632
			}
		],
		"1616953116_15cApprVFcr1skAkWssq5aAXKa7pDwJJve": [
			{
				"comment_id": 293,
				"body": "Leah Rowe: [\"Defend Richard Stallman!\"](https://libreboot.org/news/rms.html)",
				"added": 1617207445
			}
		],
		"1617244448_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 294,
				"body": "By the way... Should I implement the dislike button for [ZeroTalk++](http://127.0.0.1:43110/1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y/)?",
				"added": 1617247726
			}
		],
		"1634240089_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 299,
				"body": "I2P support is on my todo list, but I have only 24 hours of life in a day. %-)",
				"added": 1635278251
			}
		],
		"1634848133_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 297,
				"body": "Which versioning scheme should I use?\n\n* Bump the `version` and `rev` numbers and declare ZNE to be the official ZN release. (Frankly, I don't think nofish ever releases a new version... maybe except for single one fixing the TORv3 issue)\n* Keep the `version` and `rev` numbers untouched and add new field `zne_rev` to the `serverInfo` block.",
				"added": 1634875442
			},
			{
				"comment_id": 298,
				"body": "Please help seeding http://127.0.0.1:43110/1HeLLoPVbqF3UEj8aWXErwTxrwkyjwGtZN/\n\nIt's a ZeroHello fork supporting new ZNE features.",
				"added": 1634875755
			},
			{
				"comment_id": 301,
				"body": "Fixes applied to ZT++ dark theme.",
				"added": 1635316634
			},
			{
				"comment_id": 303,
				"body": "Hmmmm, should ZNE be renamed to ZeroNet2?",
				"added": 1635319407
			},
			{
				"comment_id": 304,
				"body": "http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/?Topic:1635324765_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/",
				"added": 1635324993
			},
			{
				"comment_id": 305,
				"body": "Designing a more informative sidebar:\n\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/zeronet-new-sidebar.png",
				"added": 1635342452
			},
			{
				"comment_id": 306,
				"body": "I missed the moment when the editor was added to the upstream and noticed its presence just a few days ago, lol.",
				"added": 1635396136
			},
			{
				"comment_id": 307,
				"body": "Please seed. New site for ZT++: http://127.0.0.1:43110/14Zjt1CcoLXs6xu3huy5sYoK4PRMC1Qdfp/\n\nThe old site is for testing and can be broken at any time, as I submit untested code there on the fly: http://127.0.0.1:43110/1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y/",
				"added": 1635401832
			},
			{
				"comment_id": 308,
				"body": "http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/?Topic:1635414903_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/+idea+PoW+based+size+limits",
				"added": 1635415184
			},
			{
				"comment_id": 310,
				"body": "http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/?Topic:1635452073_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/",
				"added": 1635452242
			},
			{
				"comment_id": 311,
				"body": "http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/?Topic:1635453498_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/",
				"added": 1635453686
			},
			{
				"comment_id": 315,
				"body": "# !!!\nhttp://127.0.0.1:43110/14Zjt1CcoLXs6xu3huy5sYoK4PRMC1Qdfp/?Topic:1635674379_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/",
				"added": 1635674496
			},
			{
				"comment_id": 320,
				"body": "> [ssdifnskdjfnsdjk](#comment_1126_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Can you make default the massive-rework? \n\nDone.",
				"added": 1636130948
			},
			{
				"comment_id": 321,
				"body": "> ```\n> AttributeError: 'Peer' object has no attribute 'ip_type'\n> ```\n\nLooks reasonable, since `ip_type` is missing from `__slots__`.  My Python installation seems to ignore `__slots__`, no idea why. So I don't get this error when run the code.",
				"added": 1636132200
			},
			{
				"comment_id": 322,
				"body": "**1.**\n\nLooks like the slot-related bug is normally hidden behind the plugin system. I should test all the classes without plugins.\n\nThe Bigfile plugin failed to load. This caused the bug to become visible in the Peer class.\n\n**2.**\n\nThe Bigfile plugin failed to load because of \"ImportError: bad magic number in 'merkletools'\", which most likely means you have incorrect `*.pyc` files. Try `find . -name '*.pyc' -delete`.",
				"added": 1636167615
			}
		],
		"1635380995_1NZLf9ua6XqTiK2SLyJMhN9pZhUVJVPi6g": [
			{
				"comment_id": 309,
				"body": "Find someone to exchange voice messages: https://www.interpals.net/",
				"added": 1635430744
			}
		],
		"1635637273_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 312,
				"body": "Do you have the IPv6 connectivity at all?",
				"added": 1635654616
			},
			{
				"comment_id": 313,
				"body": "Last time I checked my ISP didn't support IPv6. So I cannot do any tests right now. Probably need to configure a test network between laptops...",
				"added": 1635655500
			},
			{
				"comment_id": 319,
				"body": "http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/?Topic:1635871309_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/",
				"added": 1635871495
			}
		],
		"1546466091_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": [
			{
				"comment_id": 314,
				"body": "> [cyraxhero](#comment_5_1EbCBQfgjsBucLKuzNdkEPA4wPpbyfnYLh): Nice\n\nDon't trust http://127.0.0.1:43110/0sh.bit/\n\nAnybody can replace your link with their own.",
				"added": 1635664200
			}
		],
		"1632719590_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 316,
				"body": "We should make the correct internationalization\n\nMany strings are hard-coded into all.js.  :-(",
				"added": 1635701657
			}
		],
		"1635682514_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 317,
				"body": "> [musickiller](#comment_9_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): Some of them won't work together I'm afraid...\n\nJust a switch next to the Submit button. As on https://www.linux.org.ru/ (they support both markdown and a local variation of bbcode)",
				"added": 1635702143
			},
			{
				"comment_id": 318,
				"body": "The problem... I quite often copy & paste text betwen clearnet forums, and they require different formats. For converting into Markdown, I found a solution, a plugin for Firefox that converts selected text. But it stopped working recently, no idea why.\n\nAnd I thought, there surely are JS libraries for converting all those formats into html. And for the forum engine it really makes no difference which converter to run. So let it support a few.",
				"added": 1635702652
			}
		]
	},
	"comment_vote": {
		"4_15kHQPHwsB18wZyPVftd49ZBdncgdTmA4f": 1,
		"192_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"29_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"16_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7": 1,
		"5_155V1pDJWxxohR8eNgocGarkipstcSEARJ": 1,
		"20_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1,
		"548_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"747_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"741_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"565_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"165_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"14_1BDzk7UPg7TeTu8gdY5eefwKKRyu4yWpXo": 1,
		"64_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1": 1,
		"3_1CkhdKhyEwqcihKX5dXe1mchYpLcvpYpiA": 1,
		"76_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"13_17husSAraRRvc7qRWxwA7KF7PTwjhTmxhD": 1,
		"83_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"165_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"65_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"21_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": 1,
		"1225_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1867_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"26_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1,
		"1914_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"63_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": 1,
		"1296_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1305_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1310_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1313_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1314_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1945_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"24_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": 1,
		"19_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1,
		"21_1DWCrTtmJ1g3gLgwENAmzG75QvTkmjmoFv": 1,
		"22_1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ": 1,
		"108_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"110_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"43_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1
	}
}