{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1592067672,
			"title": "Cyber: A decentralized Google for provable and relevant answers",
			"body": "A decentralized google. An innovative search protocol that provides provable answers, without an intermediary opinion\n\nBuilt with the help of Cosmos-SDK / Tendermint / CUDA / Aragon\n\n\nDocs: \nELI-5| https://github.com/cybercongress/congress/blob/master/ecosystem/ELI-5%20FAQ.md \n\nHomestead doc|  https://github.com/cybercongress/congress/blob/master/ecosystem/Cyber%20Homestead%20doc.md\n\nWhite Paper| https://ipfs.io/ipfs/QmPjbx76LycfzSSWMcnni6YVvV3UNhTrYzyPMuiA9UQM3x\n\n Product:\nThe app| https://cyber.page/\n\nGitHub| https://github.com/cybercongress\n\nCommunity: \nTelegram| https://t.me/fuckgoogle \n\nTwitter| https://twitter.com/cyber_devs \n\nForum | https://ai.cybercongress.ai/\n\nOriginal protocols of the Internet, such as: TCP/IP, DNS, URL, and HTTP/S have brought the web to a stale point. Considering all the benefits that these protocols have produced for the initial development of the web; along with them, they have brought significant obstacles to the table. \n\nIntroducing cyber: Cyber is a decentralized google, for provable and relevant answers, without an intermediary opinon. Its mission is to create a universal search protocol to (a) build an open semantic field of the internet with the help of blockchain technology and cyberlinks, and (b) decentralize the infrastructure of the web with the help of blockchain \n\nCyber is a brand new protocol for adding and searching information onto a distributed knowledge graph. Users create links between 2 IPFS hashes and place them on a knowledge graph by spending bandwidth (this means that transactions are free). Where one hash is the content and the other is the keyword. That content is then dynamically ranked with the help of digital tokens and the current parameters of the networks load. All this is computed by validators. This allows to search data on the web, rank it, query it and create knowledge databases without blackbox intermediaries .\n\nThe interesting thing is that such a simple mechanism allows creating a lot of powerful tools as a result. For example: unified semantics, SEO instruments, autonomous robots, and a lot more.\n\nA Gift to over 1 million addresses:\n\nWe want to give the ability to evaluate the proposed approach for as many agents as possible, but without adding complexity such as KYC and/or captcha. \nThat is why we give away:\n 8% of CYB tokens in Genesis to the Ethereum community \n1% of CYB tokens to the Cosmos community \n1% of CYB tokens to the Urbit community \n\n\nYou can read more about the drop in our Gift FAQ: https://github.com/cybercongress/congress/blob/master/ecosystem/Gift%20FAQ%20and%20general%20gift%20information.md\n\nOur values:\nWe do not believe in captchas. We do not believe in KYC. We do not believe in licensing and any other similar to the above-mentioned bullshit. We do believe in code. We believe in innovation and in making use of our knowledge to make the world a slightly better place for our children.\n\nWith that in mind, what I'm trying to say, is that cyber and cyb are not just technological results. They are much more. At its base lay the values of the team behind cyber. We hope that our project can re-create certain values of what we believe the blockchain paradigm stands for. With that said, we are open to communication and will be happy for any feedback on our code.[/size]\n\nWhat can Cyber do?\n\nCyber can be defined as a smart, distributed computer. It can process, store and compute value in the form of providing answers to questions. At first glance, this might seem like a very primitive utility, suited, maximum, for an innovative browser. But that is far from the case. First of all, it is worth pointing out that Cyber provides useful computations! It is one of the first times in the history of blockchain technology where the computations done by the distributed computer have obvious and useful utility, not just to the end-user, but to the whole world. The forming of relevant and provable answers, that will shape an open semantics field.\n\nAn open semantics field lets you shape the internet differently. It allows users with interest in prosperity to receive more by using yesterdays' tools. It can make these instruments fairer, more efficient and more relevant. The basic idea is to create an Intercommunication Knowledge Protocol that can interact with everything that matters to the user. Cyber can account for a large number of use-cases, like: unified semantics, autonomous robots, programmable semantics, personal assistants, language convergence, universal oracles, proof of location and much more. All of these cases are built on semantics. Including simple cases like e-commerce, that can flourish fairly on local markets, thanks to a distributed, accessible knowledge graph. Queries can be delivered straight out of your personal browsing application. Answers can provide subjective relevance that is important at the time, at the place, for this community.\n\nOther cases, like social networks, prediction markets, offline search, etc are also possible but are less global, although can have more reach, based on consumer behavior. The ability to create a Wikipedia without the censorship and blackbox intermediaries is astonishing. The idea of recreating search at its original vision, where you can search for academic papers, search inside of a social network, interact with your own search results, etc, is astonishing.\n\nSpecification:\nConsensus: Tendermint \nComputation: CUDA / GeForce \nTokens: CYB / THC: \n-CYB: is a native token of the sovereign Cyber protocol powered by the Tendermint consensus algorithm. It has 3 primary uses: (1) staking for consensus, (2) bandwidth limiting for submitting links, and (3) expression of will for the computing of cyber~Rank \n-The genesis block contains 1 000 000 000 000 000 CYB (one petacyb or 1 PCYB)\n-There is currently no such thing as the maximum amount of CYB tokens, this is due to the continuous inflation paid to the network validators\n-THC: is a creative cyber proto substance. THC being an Ethereum ERC-20 compatible token has utility value in the form of control over cyber~Foundation (an Aragon DAO) and the ETH from the auction proceeds.\n-One of the core values of THC, is the ability to be able to receive CYB tokens (1 to 1) for anyone staking THC during cyber~Auction  \n-Prior to Genesis cyber~Congress has minted 700 000 000 000 000 THC (seven hundred terathc) \n\nTeaser: Web-3 In-browser implementation:\n\nPlay the Game of Links: https://cyber.page/gol\n\nYou can play the Game of Links, which is incentivized testing of Cyber, by creating cyberlinks and filling the knowledge graph with... knowledge. Playing GoL allows you to earn rewards. \nRead all about it here!: https://cybercongress.ai/game-of-links/\n\nJoin cyber as an evangelist and spread the word and get rewards: https://cyber.page/evangelism\n\nJoin our ambassador program  earn rewards, test our cross-chain mechanics and build up your reputation in web3!\nhttps://cybercongress.ai/post/obep/\n\nYou can also earn rewards and help to bootstrap the network by running a validator node.\n\nWhy should you run a validator on cyber:\n-You can use your cards to take part in computing the knowledge graph and be a part of an interesting project\n-You will be receiving rewards for running a validator, just like in Cosmos (ATOM)\n-You will be eligible to build your reputation in the system and can participate in governance during the mainnet \n-You can receive a commission from delegators on the mainnet\n-You can take part in forming the knowledge graph of the new Great Web\n-Become a web3 provider\n\nSpecifications:\nIn theory, if you are already using an instance with similar GPU's you might be able to run a validator node. But, to stay \"true\" to the cause, we recommend using the following specs:\n-CPU: 4 cores (6 is better)\n-RAM: 16 GB (64 would be better)\n-SSD: 256 GB (512 is preferred)\n-Connection: 100 Mbit fiber\n-GPU: CUDA / GeForce 1070/80\n-Software: Linux, Docker\n\nOn our website, you can find a very throughout guide on how to start your validator\nhttps://cybercongress.ai/docs/cyberd/run_validator/\n\nPlease feel free to review out work on GitHub . Feel free to ask questions. Join the discussion on our Telegram chat. \n\nF**kGoogle right now!\nhttps://cyber.page/gol/takeoff",
			"added": 1592067671
		}
	],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1592067672_1QBa3qVPi84otXt5PzBgRu9VyqXZ3Hz68Y": [
			{
				"comment_id": 1,
				"body": "> [kanade](#comment_104_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP): lol nvm. i read their github readme. they sound so fucking pretentious holy shit -  [...]\n\nThis project is also being developed with the help of the community. I am one  community member. If you are interested in this project, you can join.\n I think it would be interesting to integrate Cyber ​​into Zeronet as well.",
				"added": 1592073506
			},
			{
				"comment_id": 2,
				"body": "> [kanade](#comment_105_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP): i wouldn't mind joining but the way they come across when they talk about the project just sounds so stupid - \"become a hero\" on the website, next there'll be some shit like \"join the revolution\"naturally i'd be a bit skeptical when there's shit like that on any project\n\nThis is due to gamefication.\n\nI also think that validators can be considered heroes. Some of them support the network for more than a year.",
				"added": 1592073865
			}
		]
	},
	"comment_vote": {}
}