{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1613138654_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1613138654_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": [
			{
				"comment_id": 1,
				"body": "This is a cool \"article\". \n\nI think by my life experience that those problems you mention could be surpassed by achieving a big goal.\n\nThose problems must be solved by any user itself. But that would be so easy for them if they find their goals achieved while navigating. \n\nMy goal when I open zero is to reach this kind of conversation. The proposal and the comments are inspiring. \n\nSo lets continue feeding.\n\nLet the hype become real.\n\nIt's not only zeronet what needs a flood of good content. All over internet is now flooded with bad news. \n\nSending a successful space mission to put a robotic explorer on Mars is not enough. It needs people to find that activity attractive. So people that supports and love Mars exploration want to create and contribute doing things that improves the experience of newcomers.\n\nTechnically ZeroNet is \"full of papers\". You can find so freak conversations about technical solutions here.\n\nBut meanwhile people is receiving calls and message notifications from their friends, work and watching tv shows in their phones.\n\nYou have to actively access zeronet to see whats happening here and to find what u want to follow.\n\nSo may be we just need to flood zeronet with some cool things to do, some cool things to read about. And some cool new ways of interaction.\n\nBut here you cant simply say \"Hey dude! Come to my neighborhood. We have a party today!\" \n\nIts also about timing and placement. \n\nIt would be lovely to see something here that inspires yourself to spent your time here being an anonymous attractive entity.",
				"added": 1614898491
			},
			{
				"comment_id": 2,
				"body": "> [ihaphleas](#comment_17_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A): other apps ... p2p messaging, like ZeroMail, but more like Jami ... a standalone application that simply uses the protocol. Jami is great, but only works when both devices are on. A way to store sent messages with other peers for a while would be a great improvement.\n\nWE could just create a new zite for each private conversation and we can use those like chatrooms. \n\nMay be we can encrypt those zites \"chatrooms\" in a computer that is allways online. But to have to be online in the same time is also a cool feature. May be we can set a date in hour weekly calendar to be online at the same time. And may be we can write a little script to do that automatically and periodically. \n\nIts possible to use wget to download a zite?\n\nThat would also solve the mentioned \"search engine on your face\" problem. \n\nThere are some zites indexing interesting zites. That concept could be used as friend lists. Or as chatting groups.\n\nYou can find | grep your local hard disk looking for concrete words in a list. Or even look for changes in a file to know if there's new content published. So you could just download your favorite indexing zite like a thread in zerotalk for example and activate notifications if certain words are found. Not being needed to perform an active search and neither to be neccesary to find things instantly. May be you can setup a word to be found. Wait a week, and come to see whats been seen about that word in zerotalk that week. Or may be you can receive an email or some kind of notification weekly including the new zerotalk content about that topic.\n\nI ts you as an user who have to become the search engine. At least at the beginning.\n\nLet users say what they look for in a thread and let them also see what other users are looking for.",
				"added": 1614900341
			}
		]
	},
	"comment_vote": {
		"17_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": 1,
		"1_1CKk3qb2LbBwoR5Pn62KzwxHr44d282o7k": 1
	}
}