{
	"next_comment_id": 7,
	"comment": [
		{
			"comment_id": 1,
			"body": "new.html not found. I guess, you've already updated an old one?)",
			"post_id": 53,
			"date_added": 1634898877
		},
		{
			"comment_id": 2,
			"body": "How does \"report\" button work on big.kopykate.bit?\nThere are loads of hateful anti-semitism videos there.",
			"post_id": 52,
			"date_added": 1635150423
		},
		{
			"comment_id": 3,
			"body": "> You can find that here.\n\nWhy is it not cloneable? Or I just can't find the button? xD",
			"post_id": 52,
			"date_added": 1635150983
		},
		{
			"comment_id": 4,
			"body": "> [kaffie](#comment_74_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Check zerotalk. The zeroid domain name seems to have gone down. I don't really think there's anything that can be done. That's the problem with those centralized ID systems... Guess it's time for everyone to start using kaffieid?\n\nBut is kaffieid spammer-safe? Bitmessage was a good way to make sure you have to do at least some PoW to get the ID. ZeroID was so centralized it could check the IP of a person before giving the ID. Hence some protection. What about your ID? What's stopping the user from frequent change of the ID (to counter the filters) to kill whole ZeroNet over a week?\n\nI like the idea behind your kaffieid, but I'm not sure people will use it correctly, so not sure I want that on my blog, etc...",
			"post_id": 2,
			"date_added": 1635319724
		},
		{
			"comment_id": 5,
			"body": "> [xterix](#comment_1_14EHytsD6XdHp8cVqv9nzGb8SYutDoX9Pi): \"Error while during request: error undefined\"\n\nIs ZeroID it still down? I think I saw some new people, seem to be registered after the 01.09 o_O\nAnd was he using the domain name in the code of the zite?? that seems wrong..",
			"post_id": 2,
			"date_added": 1635319788
		},
		{
			"comment_id": 6,
			"body": "> [kaffie](#comment_75_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): User authentication on Zeronet works via public keys, not by unique username. If you're concerned about blocking/banning, you can ban/block the auth address directly. As for spammers making new auth addresses, this is also a vulnerability with zeroid (albeit they need unique names each time). Changing one's username/id for kaffieid doesn't get around auth address bans, if that's what you're concerned about.\n\nThanks for a detailed answer! I don't think that's exactly what I'm concerned about, but certainly a part of it.\n\nAnd I see now that we can't avoid spammers changing addresses. Unless we're tracking and blocking IPs and that may lead to a whole lot of complication and privacy issues...",
			"post_id": 2,
			"date_added": 1635413995
		}
	],
	"comment_vote": {},
	"post_vote": {
		"45": 1,
		"47": 1,
		"48": 1,
		"53": 1
	}
}