{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "tesssssssst",
				"added": 1572212569
			}
		],
		"1571272586_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 2,
				"body": "12 year old need some luvs?",
				"added": 1572212626
			}
		],
		"1572121659_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 3,
				"body": "the only thing here that makes sense is what I would more likely call \"privileged\" people of color having no right to speak for the \"non-privileged\" people of color, and wag their ass around like they're \"woke\" by default. That shit pisses me the fuck off.",
				"added": 1572212779
			}
		],
		"1572129251_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 4,
				"body": "yeah... I think someone I know started identifying as \"nonbinary\" just so they could tell all \"those\" jokes in their stand-up routine. pfft",
				"added": 1572307403
			}
		],
		"1572028122_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 5,
				"body": "> [laracroft](#comment_3_1LvCmKVRHi59Sa5wfK4yyjR4hijrabpbm5): Yeah new here just got Zeronet working on this remote system, is this where all the cool kids hang out, I take it even though you have the free speech to say nigger shit fuck cunt dick wank kike gas the jews hitler did nothing wrong....You seem passed all of this, i.e. even though you have the freedom here to say whatever you want without fear of shadowbanned you choose not to. Curious. I can see more people will migrate to Zeronet in the future, there's a genocide happening right now. Mathematically impossible to get an affordable wage, lack of affordable housing, mass unemployment, mass homelessness, mandatory vaccinations, chemtrails, GMOs, 5G, police shooting people dead in the street, Where is epstein's body? Is the Earth a level plane or a ball 6,371km in radius? What's ACTUALLY in area 51? Was the New Zealand mosque shooting a staged event to grab people's guns? Why is anyone who quotes verses from the Talmud immediately silenced? Why are Ashkenazi Jews all in positions of power in media, banking, politics, television, military industrial complex, mass surveillance? What happened to Bin Laden's body? Who really did 9/11? Where are Saddam's Weapons of mass destruction? Why is there fluoride in the water? Why do the Jesuits IHS Society of Jesus control all the observatories and what are they hiding in the Vatican archive? Why is it forbidden to even talk about the aether but you must conform to the belief in virtual particles that nobody's seen? Why are so many more people autistic, studies that show links between autism and the vaccines are attacked so fiercly and hollistic doctors supporting it are being suicided. Why is the entire internet right now under total lockdown of free information, what is really going on? What are they desperately trying to hide? [...]\n\nThe people who use that hate speech are usually just doing it for attention. The earth is round, I'm sorry. Area 51 is filled with experimental weapons. Talmud response depends on local culture, as in all things. Jewish success is similar to all other close-knit groups who place high cultural value on education and economy. The weapon's of mass destruction were made up to help brainwash the public to go to war, those papers came out a while ago. Fluoride in the water reduces cavities in children. The \"aether\" was an old \"scientific\" concept which had entire science texts published on it, not sure why it's forbidden to speak of old stupid science where you are. Autism rates have risen because 1) parents have first children at older ages and the gametes have mutated further prior to conception and 2) autism drastically increases from lack of socialization as a child (yay cellphones and shitty parenting). The internets aren't under total lockdown, beyold <-- --> they are, however, desperately trying to control the flow of information, because it inherently results in a true democracy.\nAs for Epstein, mosque shooting, Bin Laden, & 9/11: meh",
				"added": 1572308381
			}
		]
	},
	"comment_vote": {
		"17_12SMhQYY24LU82PZ4P4VTJg9j3mp6JRB5w": 1,
		"21_19s8EgXft8KuYsk9tEGgnmLo3Kcmw3ME5E": 1
	}
}