{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1572478148_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 1,
				"body": "Small is good. Way better than trying to import the unnecessary.",
				"added": 1574554604
			},
			{
				"comment_id": 2,
				"body": "> [nuttslammer](#comment_2_1Gvs3AKBY5YjUMPchHuoQuAYnWApBm1myY): I agree to a point. We can still have our \"safe spaces\" but I feel it is also our duty to grow this because it provides such a benefit for those who may not even have considered it an option.\n\nYou can feel that. You can also derive an ought from an is. I'm not Jewish, so I don't ever feel its my duty to grow societies by claiming some benefit by dutifully injecting it with the inconsiderate.",
				"added": 1574563603
			}
		],
		"1574560433_1Gvs3AKBY5YjUMPchHuoQuAYnWApBm1myY": [
			{
				"comment_id": 3,
				"body": "the Holocaust was actually 9 gay jews that died in a roller blading accident. 6 million was blown way out of proportion.",
				"added": 1574563729
			},
			{
				"comment_id": 4,
				"body": "> [spukkinfaceship](#comment_29_13eTQePN4cvnxL9qFurmPFgHRTXMGNNbCy): it's disappointing that given this opportunity for un-censorable free speech there are those who still choose to squander it with this idiotic nonsense.\n\nIf I consider ad hominems as \"idiotic nonsense\", I'd say you're the \"squanderer\".",
				"added": 1574624942
			},
			{
				"comment_id": 5,
				"body": "> [spukkinfaceship](#comment_32_13eTQePN4cvnxL9qFurmPFgHRTXMGNNbCy): sure, but if you then try to replace the narrative with something provably false that's on you, and makes you seem like an idiot.\n\nyou can't prove false things. its not possible. why are you bringing bullshit here?",
				"added": 1574714946
			},
			{
				"comment_id": 6,
				"body": "> [spukkinfaceship](#comment_31_13eTQePN4cvnxL9qFurmPFgHRTXMGNNbCy): i think it's fair to call holocaust deniers \"idiots\" . their defenders aren't much better.\n\ni think its fair to define \"Holocaust denial\", then see if it equals an idiot. The neutrality in your comment makes it almost useless.",
				"added": 1574715262
			},
			{
				"comment_id": 7,
				"body": "> [spukkinfaceship](#comment_30_13eTQePN4cvnxL9qFurmPFgHRTXMGNNbCy): high school history barely scrapes the surface of the stpry of mass murder of jews,gypsies and others in europe during ww2 at the hands of the fascists.\n\nHigh school scrapes your brain, and replaces it with the idea that jews were murdered on a mass scale. However, more Germans were murdered than anyone. The whole point of the war was to wipe the German race off the face of the earth.",
				"added": 1574715704
			},
			{
				"comment_id": 8,
				"body": "> [z3n5if](#comment_96_17ZzQakCby5cKd1FduZm4DX7SYFZMVWYsD): This is cowardice. Say plainly what you have issue with regarding my post. Who are you afraid of. Why do you write like you must save face?\n\nIt cares too much how its perceived. like a Jew. They can stand up for themselves, so they have to make everyone feel lower than them, with words of course. I don't know whats wrong with these people. You could have a debate about a math problem and they would just tell you that all your answers are wrong, but never show their answer. Its a secret king mentality, they have all the knowledge, but they can't say, (teehee) they can only call people stupid. Gamma behavior, pure and simple.",
				"added": 1576847428
			}
		]
	},
	"comment_vote": {
		"277_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"85_17ZzQakCby5cKd1FduZm4DX7SYFZMVWYsD": 1,
		"74_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn": 1,
		"4_1L4PrPHHR8HnHUggZiEYr3VKZUkxAshbKV": 1,
		"1327_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"3_1Gvs3AKBY5YjUMPchHuoQuAYnWApBm1myY": 1,
		"2_1MdNH4cGtA5tzspwg7tHiR6Rjx72uB2pKv": 1
	}
}