{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1571615422_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": 1
	},
	"next_comment_id": 18,
	"comment": {
		"1570044887_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd": [
			{
				"comment_id": 1,
				"body": "AHAHAHAHAHAHAHAHA.  https://www.reddit.com/r/conspiracy/comments/46vc3q/alex_jones_wants_us_to_believe_hollywood_is_run/\n\nYou may as well cite Alex Jones as your reference instead of the article you sourced as evidence for Saudi Arabia running media/finance/government.  Seriously...HOW ARE SOME PEOPLE STILL FALLING FOR THIS BS???\n\nRead a document called, \" The Hidden Tyranny\".  The document precisely explains who runs everything and why.  I provided a link below this statement.\n\n\nhttp://www.biblebelievers.org.au/tyranny1.htm",
				"added": 1571113401
			},
			{
				"comment_id": 2,
				"body": "> [styromaniac](#comment_1105_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You know that Trump is close with Saudi Arabia, right? He gave them weapons. [...]\n\n> [megatonjim](#comment_19_18xxerUUwEh2hVsNw1Ym6pML9JfwiKLUJT): Jews are behind communism, socialism, LGBT, feminism, political correctness, etc... Jews always work to destroy the societies they infest. Their Satanic \"How To\" book known as the Talmud tells them what to do!\n\nSpecifically the Babylonian Talmud!!!!!",
				"added": 1571113529
			},
			{
				"comment_id": 4,
				"body": "The Jewish Mafia owns and runs ALL political parties in the United States.  > [xcape2net](#comment_453_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I thought Satan owned the democratic party?",
				"added": 1571168296
			},
			{
				"comment_id": 12,
				"body": "Please post some credible sources for the existence of a Russia connection.  You are correct about the Communists wanting an Arab invasion.  No doubt about that!> [whyamihere](#comment_4_19VWN3686xhWFFoEMoXWuGSKtx7TuhQanY): The Jewish Mafia owns and runs ALL political parties in the United States.  > xcape2net: I thought Satan owned the democratic party?> [wertup](#comment_6_126rNR8K25HUiECkWc11qtLyWNFEbG4sV9): i would never visit a site called biblebelievers looking for news or in the attempt to make myself an opinion about today reality...\n\nWhy?",
				"added": 1571251274
			},
			{
				"comment_id": 13,
				"body": "Posted the full comment by accident.....",
				"added": 1571251973
			},
			{
				"comment_id": 14,
				"body": "SOURCE:http://www.truedemocracy.net/hj33/08.html\n\n\n\n\n The Saudi Royal Family Are Crypto-Jews\n\nhttp://www.fortunecity.com/boozers/bridge/632/history.html\n\nBy Abdulaziz Saud\n\nTHE SAUDI DYNASTY: FROM WHERE IS IT? AND WHO IS THE REAL ANCESTOR OF THIS FAMILY?\n\nRESEARCH AND PRESENTATION OF: MOHAMMAD SAKHER , who was ordered killed by the Saudi Regime for the following findings:\n\n1. Are the Saudi Family members belonging to the Tribe of ANZA BEN WA'EL as they allege to be?\n\n2. Is Islam their actual religion?\n\n3. Are they of an ARAB ORIGIN at all?\n\nIn the year 851 A.H. a group of men from AL MASALEEKH CLAN, which was a branch of ANZA Tribe, formed a caravan for buying cereals (wheat and corn) and other food stuff from IRAQ, and transporting it back to NAJD. The head of that group was a man called SAHMI BIN HATHLOOL. The caravan reached BASRA, where the members of the group went to a cereal merchant who was a Jew, Called MORDAKHAI BIN IBRAHIM BIN MOSHE'. During their bargaining with that merchant, the Jew asked them : \"Where are you from?\" They answered: \"From ANZA TRIBE; a clan of AL MASALEEKH.\" Upon hearing that name, the Jew started to hug so affectionately each one of them saying that he, himself, was also from the clan of AL MASALEEKH, but he had come to reside in BASRA (IRAQ) in consequence to a family feud between his father and some members of ANZA Tribe.\n\nAfter he recounted to them his fabricated narrative, he ordered his servants to load all the camels of the clan's members with wheat, dates and tamman; a remarkable deed so generous that astonished the MASALEEKH men and aroused their pride to find such an affectionate (cousin) in IRAQ- the source of their sustenance; they believed each word he said , and , because he was a rich merchant of the food commodities which they were badly in need, they liked him (even though he was a Jew concealed under the garb of an Arab from AL MASALEEKH clan).\n\nWhen the caravan was ready to depart returning to NAJD, that Jewish Merchant asked them to accept his company, because he intended to go with them to his original homeland, NAJD. Upon hearing that from him, they wholeheartedly welcomed him with a very cheerful attitude.\n\nSo that (concealed) Jew reached NAJD with the caravan. In NAJD, he started to promulgate a lot of propaganda for himself through his companions (his alleged cousins), a fact, which gathered around him a considerable number of new supporters; but, unexpectedly, he confronted a campaign of opposition to his views led by SHEIKH SALEH SALMAN ABDULLA AL TAMIMI, who was a Muslem religious preacher in AL-QASEEM. The radius of his preaching area included Najd, Yemen, and Hijaz, a fact which compelled the Jew (the Ancestor of the present SAUDI FAMILY to depart from AL QASEEM to AL IHSA, where he changed his name (MORDAKHAI) To MARKHAN BIN IBRAHIM MUSA. Then he changed the location of his residence and settled at a place called DIR'IYA near AL-QATEEF, where he started to spread among the inhabitants a fabricated story about the shield of our Prophet MOHAMMAD (p.b.u.h), that it was taken as a booty by an Arab Pagan in consequence of OHOD Battle between the Arab pagans and the Muslems. \"That shield, he said, was sold by the Arab Pagan to a Jewish Clan called BANU QUNAIQA' who preserved it as a treasure! He gradually enhanced his position among the Bedouins through such stories which indicated how the Jewish clans in Arabia were so influential and deserved high esteem. He gained some personal importance among the Bedouins, and decided to settle permanently there, at DIR'IYA town, near AL QATEEF, which he decided to be his (Capital) on the Persian Gulf. He aspired to make it his spring board for establishing a Jewish Kingdom in Arabia.\n\nIn order to fulfill his ambitious scheme, he started to approach the desert Arab Bedouins for support of his position, then gradually, he declared himself as their king!\n\nAt that juncture, AJAMAN Tribe together with BANU KHALED Tribe became fully aware of that Jewish cunning plan after they had verified his true identity, and decided to put an end to him. They attacked his town and conquered it, but before arresting him he had escaped by the skin of his teeth.\n\nThat Jewish Ancestor of the SAUDI FAMILY, (MORDAKHAI), sought shelter in a farm called at that time AL-MALIBEED-GHUSAIBA near AL-ARID, which is called at our present time : AL-RIYADH.\n\nHe requested the owner of that farm to grant him an asylum. The farmer was so hospitable that he immediately gave him sanctuary. But that Jew (MORDAKHAI), no longer than a month had he stayed there, when he assassinated the land lord and all members of his family, pretending that all were killed by an invading band of thieves. Then he pretended that he had bought that real estate from them before that catastrophe happened to them! Accordingly, he had the right to reside there as a land lord. He then gave a new name to that place: He named it AL-DIRIYA - the same name as that he had lost.\n\nThat Jewish Ancestor of the SAUDI FAMILY (MORDAKHAI), was quick to establish a \"GUEST HOUSE\" called \"MADAFFA\" on the land he usurped from his victims, and gathered around him a group of hypocrites who started to spread out false propaganda for him that he was a prominent Arab Sheikh. He plotted against Sheikh SALEH SALMAN ABDULLA AL TAMIMI, his original enemy, and caused his assassination in the mosque of the town called (AL-ZALAFI).\n\nAfter that, he felt satisfied and safe to make (AL-DIRIYA) his permanent home. There he practiced polygamy at a wide scale, and indeed, he begot a lot of children whom he gave pure Arab names.\n\nEver since his descendants grew up in number and power under the name of SAUDI CLAN, they have followed his steps in practicing under ground activities and conspiracies against the Arab Nation. They illegally seized rural sectors and farm lands, and assassinated every person who tried to oppose their evil plans. They used all kinds of deceit for reaching their goals: they bought the conscience of their dissidents; they offered their women and money to influential people in that area, particularly to those who started to write the true biography of that Jewish Family; they bribed writers of history in order to purify their ignominious history, and make their lineage related to the most prominent Arab Tribes such as RABI'A, ANZA, and ALMASALEEKH.\n\nA conspicuous hypocrite in our era whose name is MOHAMMAD AMIN AL TAMIMI- Director/Manager of the contemporary Libraries of the SAUDI KINGDOM, made up a genealogical tree (FAMILY TREE) for this JEWISH FAMILY (THE SAUDIS), connecting them to our Great Prophet, MOHAMMAD (P.B.U.H). For his false work, he received a reward of 35 (THIRTY FIVE) THOUSAND EYPTIAN POUNDS from the then SAUDI AMBASSADOR TO CAIRO, EGYPT, in the year 1362 AH.- 1943 A.D. The name of that Ambassador is: IBRAHIM AL-FADEL.\n\nAs aforementioned, the Jewish Ancestor of the SAUDI FAMILY, (MORDAKHAI), practiced polygamy by marrying a lot of Arab women and begot many children; his polygamous practice is, at the present time, being carried out \" to the letter\" by his descendants; they cling to his marital heritage!\n\nOne of MORDAKHAI'S sons called AL-MAQARAN, arabized from the Jewish root (MACK-REN) begot a son called Mohammad, then another son called SAUD, which is the name of the present day SAUDI DYNASTY.\n\nDescendants of SAUD (the present day SAUDI FAMILY )started a campaign of assassination of the prominent leaders of the Arab Tribes under the pretence that those leaders were apostates; renegading from the Islamic Religion, and deserting their Koranic doctrines; so they deserved the SAUDI condemnation and slaughter!\n\nIn the History Book of the SAUDI FAMILY pages (98-101), their private family historian declares that the SAUDI DYNASTY considers all the people of NAJD blasphemous; so their blood must be shed, their properties confiscated, and their females be taken as concubines; no Muslim is authentic in his /her belief unless he/she belongs (affiliates) to the sect of MOHAMMAD BIN ABDUL WAHAB, (whose origins are also Jewish from TURKEY.) His doctrines give authority to the SAUDI FAMILY to destroy the villages with all their inhabitants-males including children, and to sexually assault their women; stab the bellies of the pregnant, and cut off the hands of their children, then burn them! They are further authorized by such a BRUTAL DOCTRINE to plunder all the properties of whom they call renegades (not following their Wahabi Sect).\n\nTheir hideous Jewish Family has, in fact, done all that kind of atrocities in the name of their false religious sect (the Wahabi), which was actually invented by a Jew so as to sow the seeds of terror in the hearts of people in towns and villages. This Jewish Dynasty has been committing such brutal atrocities ever since 1163 A.H. They have named the whole Arabian Peninsula after their family name (SAUDI ARABIA) as if the whole region is their own personal real estate, and that all other inhabitants are their mere servants or slaves, toiling day and night for the pleasure of their masters (THE SAUDI FAMILY).\n\nThey are completely holding the natural wealth of the country as their own property. If any poor person from the common people raises his/her voice complaining against any of the despotic rules of this Jewish Dynasty, (the Dynasty) cuts off his/her head in the public square. A princess of theirs once visited FLORIDA, USA, with her retinue; she rented 90 (NINETY) Suite rooms in a Grand Hotel for about One Million Dollars a night! Can anyone of their subjects comment about that extravagant event? If he/she does, his/her fate is quite known: DEATH WITH THE EDGE OF THE SAUDI SWORD IN THE PUBLIC SQUARE!!!!!!\n\nWitnesses on the Jewish Ancestry of this Saudi Family:\n\nIn the 1960's the \"SAWT AL ARAB\" Broadcasting Station in Cairo, Egypt, and the YEMEN Broadcasting Station in SANA'A confirmed the Jewish Ancestry of the SAUDI Family.\n\nKing FAISAL AL-SAUD at that time could not deny his family's kindred with the JEWS when he declared to the WASHINGTON POST on September 17, 1969 stating: \"WE, THE SAUDI FAMILY, are cousins of the Jews: we entirely disagree with any Arab or Muslem [sic] Authority which shows any antagonism to the Jews; but we must live together with them in peace. Our country (ARABIA) is the Fountain head from where the first Jew sprang, and his descendants spread out all over the world.\" That was the declaration of KING FAISAL AL-SAUD BIN ABDUL AZIZ!!!!!\n\nHAFEZ WAHBI, The SAUDI Legal Adviser, mentioned in his book entitled: \"THE PENINSULA OF ARABIA\" that KING ABDUL AZIZ AL-SAUD, who died in 1953, had said : \"Our Message (SAUDI MESSAGE) encountered the opposition of all Arab Tribes; my grandfather, SAUD AWAL, once imprisoned a number of the Sheikhs of MATHEER Tribe; and when another group of the same tribe came to intercede for the release of the prisoners, SAUD AWAL gave orders to his men to cut off the heads of all the prisoners, then, he wanted to humiliate and derogate the interceders by inviting them to eat from a banquet he prepared from the cooked flesh of his victims whose cut off heads he placed on the top of the food platters!! The interceders became so alarmed and declined to eat the flesh of their relatives; and, because of their refusal to eat, he ordered his men to cut off their heads too. That hideous crime was committed by that self imposed king to innocent people whose guilt was their opposition to his most cruel and extremely despotic rules.\n\nHAFEZ WAHBI, states further that King ABDUL AZIZ AL-SAUD related that bloody true story to the Sheikhs of the MATHEER Tribe, who visited him in order to intercede for their prominent leader at that time, FAISAL AL DARWEESH, who was the king's prisoner. He related that story to them in order to prevent them from interceding for the release of their Sheikh; otherwise, they would face the same fate; He killed the Sheikh and used his blood as an ablution liquid for him just before he stood up for his prayer (after the false sect doctrine of the Wahabi); The guilt of FAISAL DARWEESH at that time was that he had criticized King ABDUL AZIZ AL-SAUD when the king signed the document which the English Authorities prepared in 1922 as a declaration for giving PALESTINE to the Jews; his signature was obtained in the conference held at AL AQEER in 1922.\n\nThat was and still is the system of this Regime of the JEWISH FAMILY (SAUDI FAMILY): All its goals are: plundering the wealth of the country, robbing, falsifying, and committing all kinds of atrocity, iniquity, and blasphemy-all are executed in compliance with their self invented Wahabi Sect which legalizes the chopping of the heads of their opposing subjects.",
				"added": 1571252957
			},
			{
				"comment_id": 15,
				"body": "> [chergriog](#comment_18_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd): FBI is an American crime drama television series created by Dick Wolf and Craig Turk that airs on CBS, where it premiered on September 25, 2018.[2] The series is produced by CBS Television Studios and Universal Television, with Wolf, Arthur W. Forney, Peter Jankowski, and Turk serving as executive producers. The series features an ensemble cast including Missy Peregrym, ZEEKO ZAKI, Jeremy Sisto, Ebonée Noel, Sela Ward and Alana de la Garza.Born into a multi-generational law enforcement family, Special Agent Maggie Bell commits deeply to the people she works with as well as those she protects. Her partner is Special Agent Omar Adom \"O. A.\" Zidan, a West Point graduate from Bushwick who spent two years undercover for the DEA before being cherry-picked by the FBI. [...]\n\n\nWhat?  You are referring to some drama on CBS of all things????  What??",
				"added": 1571264782
			},
			{
				"comment_id": 16,
				"body": "AHAHAHAHAHAHAHAHAHAHAHAHHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAH\n\nYes it is a mass delusion! Of course!  Why did I not think that explanation?  Talk about some chutzpah coming out of your mouth!",
				"added": 1571281470
			}
		],
		"1570492144_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 3,
				"body": "Why in the world would you want too???  Are you crazy?  We already have examples of Bolshevism/Communism from the 20th century to learn from.  However, if society is stupid enough to believe anything they are told, then naturally Communism follows...",
				"added": 1571113720
			}
		],
		"1571160843_1JzkAAtaVNqg2E1NRSbwL8tJ6egxnoxyDM": [
			{
				"comment_id": 5,
				"body": "Supposedly there was a sixteen page manifesto out there...",
				"added": 1571168857
			},
			{
				"comment_id": 6,
				"body": "> [reichardnixon](#comment_48_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr): Seems like he dindu nuffin. Low score at least.\n\nNot exactly funny.  You are dealing with people's lives and freedom.  We are on the cusp of complete 1984 Communist/Bolshevik takeover.",
				"added": 1571169204
			},
			{
				"comment_id": 7,
				"body": "> [reichardnixon](#comment_49_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr): Yeah we are. Its not funny, its pretty sad that his life will be thrown away for this and he did almost nothing compared to St.Tarrant or Dylann. Those carried a lot more meaning than this will.\n\nWhat do you mean in your second sentence, \"Those carried a lot more meaning than this will?\"",
				"added": 1571169819
			},
			{
				"comment_id": 8,
				"body": "> [reichardnixon](#comment_51_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr): Read more here.http://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/?:users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v:pol:3c0fbc49-e1c8-4f62-8b80-3094503ecac5\n\nAlright, thank you for the heads up.",
				"added": 1571177485
			},
			{
				"comment_id": 9,
				"body": "> [reichardnixon](#comment_50_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr): The weight of his actions will be less relevant due to the low score. Less impact, less publicity.  I didnt even know about this event until i clicked the link in the thread. Still have not seen links to the manifesto or video. Normally there is a .zip of all the relevant content by now... [...]\n\nI see the manifesto.  Did this really go to the trouble of doing this?  I mean AT THE VERY LEAST cite some decent sources for your justification for going on a psychotic rampage.  For all the shoot outs I have seen the manifestos are SERIOUSLY lacking in any real knowledge about who runs the system.  \n\nAnd why is it someone ALWAYS has to write manifesto like the Uni-bomber???",
				"added": 1571177872
			},
			{
				"comment_id": 10,
				"body": "> [reichardnixon](#comment_52_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr): No, the only thing on zeronet is the reposts of the content that is being purged from the clearnet. TBH its not that cool anyways... nothing your average nigger couldnt find online with a few minutes of time.\n\nThat makes sense about the manifesto information.",
				"added": 1571185559
			}
		],
		"1571185468_15io4gegLAkgg9jNErcMyY6bpD64HULMCw": [
			{
				"comment_id": 11,
				"body": "Act as if you really want to be here and start posting on threads that interest your grey matter.",
				"added": 1571185606
			}
		],
		"1571615422_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 17,
				"body": "> [kaffie](#comment_1114_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I'm big on the \"separate but equal\" concept. How about we give each race their own land, and allow us to do what we will do. Civilized people can behave properly and build up society without interference, and literal ape men can play king of the hill and fight each other constantly achieving nothing.\n\nThat will never happen.  All governments in the West are ran by the iron first of INTERNATIONAL JEWRY (Banks/Media/Legal System/NGO's like ADL/Mossad).  Unless whites wise up to who is behind the curtain of Bolshevism, we all fall.",
				"added": 1571687284
			}
		]
	},
	"comment_vote": {
		"19_18xxerUUwEh2hVsNw1Ym6pML9JfwiKLUJT": 1,
		"453_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"49_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"52_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1
	}
}