{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Чего не хватает в русскоязычном ZeroNet?",
			"body": "Думаю создать зайт и начать наполнять контентом, что будет наиболее востребовано по вашему мнению?",
			"added": 1574376441
		}
	],
	"topic_vote": {
		"11_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": 1,
		"1_1DMpDMVvaeUTgC6WjCqav9CRGedc3opwkF": 1
	},
	"next_comment_id": 13,
	"comment": {
		"2_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": [
			{
				"comment_id": 1,
				"body": "Очень хорошо, что позакрывали это днище. Может, хоть сидов на рутрекере прибавится.",
				"added": 1572243410
			},
			{
				"comment_id": 3,
				"body": "> [fant](#comment_56_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): Вряд ли значительно прибавится. Посмотрите статистику скачавших и сидирующих на том же рутрекере. \"Скачать\" и \"сидировать\" две огромные разницы.\n\nБудут ли изменения, увидим в ближайшее время. Не рассчитываю на высокую сознательность качающих, многим просто лень или забывают уйти с раздачи, и то какая-то поддержка. Но весьма вероятно что большинство тупо пойдет на нетфликс или его аналоги.",
				"added": 1572351299
			}
		],
		"1_1HVtb9ohKcH19u1Cp3WrwTJipYdm1P6ceE": [
			{
				"comment_id": 2,
				"body": "Тут еще никакой защиты от спама нет и он отсутствует лишь потому что людей мало, ну еще спамеры пока тему не проюхали.",
				"added": 1572244541
			}
		],
		"1_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM": [
			{
				"comment_id": 4,
				"body": "Первый отзыв и впечатление - ничего не изменилось.",
				"added": 1572705647
			},
			{
				"comment_id": 5,
				"body": "Оптимисты всех успокаивают, пессимисты рассказывают страшилки о цифровом рабстве, а реалисты рассказывают знакомым о зеронете и других средствах обхода блокировок, помогают установить и настроить.",
				"added": 1573214526
			},
			{
				"comment_id": 6,
				"body": "> [if0](#comment_250_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Какие-то странные реалисты, которые полагают, что преодолевая последствия они борются с причиной, их пораждающей.\n\nТак просвяти нас насчет причин и как с ними эффективно бороться. Критикуешь - предлагай.",
				"added": 1573376390
			},
			{
				"comment_id": 8,
				"body": "Прошлой ночью на одной русскоязычной борде появилось как минимум два треда,  котором анонимы сообщали о перебоях в работе зарубежных сайтов. При это отечественные сайты открывались без проблем. Высказывалось предположение, что тестировались механизмы изоляции рунета. \nА сегодня прошла информация, что роскомнадзор серьезно берется за ряд сайтов, на котором размещен \"русофобский и экстремистский\" контент. Вот такие вот дела.",
				"added": 1573848137
			}
		],
		"1_1LPWDoyPyLywNDWafMdS7EU7vKUUHzdJ61": [
			{
				"comment_id": 7,
				"body": "Хороший кстати вопрос, как в зеронете бороться с такого рода спамом.",
				"added": 1573377317
			}
		],
		"1_12GKd5hKKNsTyxWqE3arbSurnbq6Ek8spk": [
			{
				"comment_id": 9,
				"body": "И что, ни одного бэкапа файлов, загруженных в сеть, находящуюся в альфа-тестировании?",
				"added": 1573848344
			}
		],
		"1_1DMpDMVvaeUTgC6WjCqav9CRGedc3opwkF": [
			{
				"comment_id": 10,
				"body": "Скорее всего будут удалять аккаунты с большими объемами видео и низкой посещаемостью. Хотя кто знает что им взбрело в голову. Может, готовятся к введению подписки за хранение видеоконтента. В любом случае самые важные видео всегда лучше сохранять youtube-dl или аналогичной утилитой. Их и до этого часто удаляли по разным причинам.",
				"added": 1573982204
			},
			{
				"comment_id": 11,
				"body": "Потестил https://www.bitchute.com/, работает быстро, есть хороший контент. Развивается за счет пожертвований, принимает криптовалюту. Вполне себе альтернатива все более огороженому ютубу.",
				"added": 1574159829
			}
		],
		"1_1MR3MSi8wAjrMmZ795tYqbgaZ3dmbXGgh7": [
			{
				"comment_id": 12,
				"body": "> [vinden](#comment_5_1MaQotHdgVHw85GNi8ZBziGmGc2F5JUmcE): Например, старый фильм, \"Солярис\"\n\nНовый, кстати, тоже не плох, что бы не говорили.",
				"added": 1574360432
			}
		]
	},
	"comment_vote": {
		"244_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"243_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"5_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM": 1,
		"249_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"19_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": 1,
		"23_15bXfYrgn11ULbJ71nHqDrERcxNotpYsqP": 1,
		"76_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2": 1,
		"11_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM": 1,
		"1_1EzNhcaq8eqsamfqobDECK6cEV52k5hF54": 1,
		"72_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": 1,
		"2_1EzNhcaq8eqsamfqobDECK6cEV52k5hF54": 1,
		"74_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": 1
	}
}