{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1524765490,
			"title": "Hacking",
			"body": "All about hacking.",
			"added": 1524765489
		},
		{
			"topic_id": 1525117484,
			"title": "self.fix()",
			"body": "to _delete(self), first you must self.save()",
			"added": 1525117482
		}
	],
	"topic_vote": {
		"1524708171_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": 1,
		"1524765490_1D2E7WbvtaBxyunA2P3M1rFzsWBaZhDUCW": 1,
		"1524439656_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": 1,
		"1524327364_1GkmeCNuarifRQooJ8P5xawoXCweDdLrUJ": 1,
		"1525117484_1D2E7WbvtaBxyunA2P3M1rFzsWBaZhDUCW": 1,
		"1525144895_16mEBTR7dyjQc7Lxmc9um4TfvM8W4oaAnV": 1,
		"1525203779_1KCJ86Jg3LNBpHxcaRojsHTg9Qme9vuV1j": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1524708171_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 1,
				"body": "Can you link to the actual post in question, please?",
				"added": 1524763386
			}
		],
		"1524765490_1D2E7WbvtaBxyunA2P3M1rFzsWBaZhDUCW": [
			{
				"comment_id": 2,
				"body": "To start things off:\nI made a Twitter-based C2 server - https://github.com/AgeOfMarcus/TwitterC2",
				"added": 1524765523
			},
			{
				"comment_id": 3,
				"body": "> [thunder33345](#comment_13_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): Lets make a CNC structure based off how zeronet would function!We could effectively hide who actually control the botnet, or its just another victim propagating commands throughout the networkand ideally it would be impossible to be shut down(unless the controller's keys get destroyed or self destruct command initiated via a compromised key if it's implemented)problem arise when you want to send something back to the botmaster, essentially it's kinda a one way channel which is not very ideal for certain use cases\n\nThat sounds like a really cool idea. Does ZeroNet have an API? But another problem, we would have to add the zeronet files to the payload, if it were to be done :(\nThat would make deployment more difficult as the file would take up more space and use more resources running.\n\nHowever, if only the botmaster used ZeroNet, is there anyway something like that would work?",
				"added": 1524766748
			},
			{
				"comment_id": 4,
				"body": "> [thunder33345](#comment_14_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): Idea is to built another system up from ground but only possesses the necessary parts(bulky malware makes easy spotting) with barebone(we are suppose to just use mirror how zeronet works without using it) [...]\n\nWell, it's an interesting idea, but pretty much just an idea for me as this is waayyyy above my level. It would be cool if it someone created it, though.",
				"added": 1524770259
			}
		],
		"1525203779_1KCJ86Jg3LNBpHxcaRojsHTg9Qme9vuV1j": [
			{
				"comment_id": 5,
				"body": "Worked for me, first try! Really cool!",
				"added": 1525278115
			}
		]
	},
	"comment_vote": {
		"13_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"14_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"15_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1
	}
}