{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1574357441_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1575162021_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 1,
				"body": "Simply install Linux, even simple basic installs are fairly secure.   Nearly any distro nowadays will secure you well enough that you do not have to worry too much...  Unless you are contending with hackers who are attacking your computer / system you should be fairly secure.",
				"added": 1575205275
			},
			{
				"comment_id": 2,
				"body": "> [somuchfood](#comment_43_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk): Software is the easy part, but hardware is a real issue. If his threat model contains government, then Intel ME/AMD PSP is out of the question, as they are gov backdoors. They can also be compromised by hackers anytime. AMD not wanting to release PSP source code makes me think it relies on security-through-obscurity, so yeah, very insecure. [...]\n\nI hear you but think you are wrong in your notion.   Intel CPUs are VERY insecure, and even Android hardware is insecure ESPECIALLY if you are purchasing from China or brands from China.   AMD is your best bet and if you expect proprietary code to be released to trust such you will NEVER find a system because companies are trying to prevent other companies and even nations from stealing their intellectual property! \n\nIntel used to be a great option until a last few years when viruses started causing HUGE issues!   HOWEVER, with AMD you do not have the same issues...    If your computer is connected to the internet or has a wifi connection you can be hacked.  Use an Ethernet connection behind a router. \n\nA NON Chinese motherboard, Linux distro, NO wifi (can be traced!) instead Ethernet , and sandbox environment.\n\n\"but hardware is a real issue\"  NO not really! ...   The REAL issue is that governments and even corporation can grab your data send via the internet fairly easily   No Intel and AMD are not backdoors as that suggest that these companies insert misc code...    Rather it is the companies who communicate with governments but more one to one... Can hardware be flashed YES but if you walk into your local computer shop not knowing what to buy and you simply piece together a system it will be clean if you put it together.   There are plenty of online forums talking about the tech and known vulnerabilities!\n\nAre you doing something sensitive that you NEED super security?  ...  In HONG KONG stuff is getting really bad and if you are there then DO NOT buy anywhere else then from outside China, for example.\n\nPut nothing sensitive on your computer and if you do make sure everything is encrypted.    Scan for ROOTKITS and make sure you know who made your hardware.\n\nAny insecurity will be on you, NOT your computer!  ...  Keep in mind if you leave your computer without security watching it, someone or group you trust, someone else can trespass hack your pc....   So even if you secure your computer someone can drop something on your system to spy on you or steal anything of value.   \n\nLater,  :)",
				"added": 1575286849
			}
		],
		"1575760689_1BwGVP2XMmmfdPEAZAvKmcVBFecxGSpnjY": [
			{
				"comment_id": 3,
				"body": "Simply use kali linux within Virtualbox or VMware.   By the time you learn any weaknesses then have someone exploit such that distro of software would have already patched any code.    You could most likely hack the AAPANEL simply by watching some free Youtube videos...",
				"added": 1575777622
			}
		],
		"1575733657_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 4,
				"body": "Mostly the ZeroTalk is meant to cut down on spam...   All you need to do is create a new ZeroID simply to keep using ZeroTalk, such is free...  Also you can still use other services if you have your old ZeroID but with your limit reached.",
				"added": 1575777797
			}
		]
	},
	"comment_vote": {}
}