{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1_1AQie8nrfvwWudryJpQtk1QJfrjHdWTSbF": [
			{
				"comment_id": 1,
				"body": "Se ti riferisci ad un sito che hai clonato, da ZeroHello (la pagina principale di ZeroNet) vai a fianco della tua copia del sito, clicchi sui tre puntini a destra e poi su \"Update code\".\n\nSe invece vuoi aggiornare il programma ZeroNet ci sono i tre pallini in alto a sinistra di fianco alla scritta \"Hello ZeroNet\" e da lì fai clic su \"Revisione ...: Aggiornato!\"",
				"added": 1537090723
			}
		],
		"1_13fF8ReM7zvX4ytjPkwEaRtBbtFKeho7XS": [
			{
				"comment_id": 2,
				"body": "Ti dirò la verità, non c'è molta documentazione in giro per i merged sites, ci sono alcuni tutorial in markdown di non mi ricordo chi che puoi trovare linkati in una delle issue di Github di ZeroNet che li spiegano in maniera decente. (Quando ho tempo provo a vedere se li ritrovo).\n\nUn modo in cui puoi imparare è guardare prima la (poca) documentazione che c'è [sulla documentazione online di ZN](https://zeronet.readthedocs.io/en/latest/site_development/dbschema_json/) e poi guardare i sorgenti (li trovi sempre su github) di ZeroMe.\n\nSe hai domande più specifiche chiedi che provo a darti una qualche risposta (e comunque sul forum in italiano non troverai molta gente, se hai qualcosa da chiedere ti conviene farlo su quello in inglese visto che la maggior parte degli sviluppatori di siti attualmente disponibili non è italiana). Se ho tempo più tardi magari ti scrivo qualcosa di più.",
				"added": 1542842718
			},
			{
				"comment_id": 3,
				"body": "@shibeotp Scusa se ti rispondo in ritardo ma ero via.\n\n> [shibeotp](#comment_1_13fF8ReM7zvX4ytjPkwEaRtBbtFKeho7XS): A: Non mi aspettavo fossi italiano..\nSe posso chiedere, come mai?\n\n> B: Il fatto che Zeronet non abbia una documentazione fatta bene, spinge molti programmatori a non programmare per la piattaforma.\nQuesto purtroppo è vero. Anche io quando ho iniziato ho avuto un sacco di problemi proprio perché non si trovano documentate neanche delle feature abbastanza standard come i Merged Sites. Ho sollecitato varie volte HelloZeroNet (qui nofish) che è il creatore di ZeroNet per discutere della questione documentazione ma non ho mai ottenuto una risposta.\nPenso quindi che attualmente sia considerata un optional. La mia idea era quella di creare un sito dove si potessero iniziare a documentare autonomamente certe cose ma per mancanza di tempo non ho mai iniziato (e se almeno inizialmente non ci sono un po' di cose utili già documentate, il resto delle persone non ha voglia di scriverci qualcosa).\n\n> D: Ho provato a vedere i codici sorgente dei mergedsites di ZEROME ovviamente... non si capisce un cazzo.E: Comincio a presupporre che il DB sia un NOSQL insomma un db fatto ad albero, richiamabile come un oggetto di oggetti. (GIA. UN OGGETTO DI OGGETTI [un .db che non contiene la struttura di dati che viene fornita da un DBSCHEMA.json]).\nSi, anche a me tocca spesso guardare il sorgente vista la poca documentazione, e riconosco che non sia scritto bene, avendo anche pochissimi commenti per chi lo legge per la prima volta.\n\nComunque per quanto riguarda il db attualmente ha una struttura asimmetrica: nel senso che l'utente scrive su dei file json in una struttura opportuna e questi vengono poi presi da ZeroNet ed inseriti in un database SQLite per velocizzare la ricerca dei dati.\nDa quello che ho capito leggendo varie cose prima dovevi anche leggere dai file json e questo ovviamente rendeva molto più lenti tutti gli applicativi (in pratica perché dovevi scriverti a mano l'implementazione di un database).\n\nFermo restando che non è davvero il modo giusto di farlo (perché ad esempio come query puoi dare solo dei SELECT, mentre gli UPDATE ed i DELETE devi farli caricandoti i file json in memoria, cosa che ovviamente non scala di per sé).\n\nProvo a descriverti come funziona nel dettaglio il processo in modo che tu possa averne un'idea migliore:\n- Per scrivere nel db devi utilizzare la cartella con nome l'hash della tua chiave pubblica (che solitamente si trovano in `data/users/1...`) e scrivere un file qui dentro (solitamente `data.json`, ma questo è specificato nel `data/users/content.json` del sito).\n- `data.json` è un JSON appunto, dove si trovano i dati che poi verranno inseriti nel database SQLite (uno per sito). Qui grossomodo la chiave identifica la tabella su cui verranno scritti (dico grossomodo perché la mappa chiave --> tabella è scritta nel `dbschema.json` del sito) e il valore è una lista di oggetti, che saranno i record da inserire. Un esempio (abbastanza simile alla struttura di ZeroTalk):\n```\n{\npost: [\n  { id: 1, titolo: \"Post di esempio\" }\n],\ncomments: [\n  { id: 1, post_id: 1, user_id: \"1FA3...\", body: \"Bello questo post\"},\n  { id: 2, post_id: 3, user_id: \"176C...\", body: \"Hello!\"}\n]\n}\n```\n\nCome vedi ciascun utente ha la sua numerazione di post e commenti, e per riferirsi a quelli degli altri devi scrivere esplicitamente a quale utente ti stai riferendo (visto che il dato \"utente che ha inserito questa riga\" è visibile nel database in modo che tu possa fare le query opportune).\n\n- Scritto questo file, usi le API `siteSign` e `sitePublish` con il percorso del file che hai scritto per permettere a ZeroNet di firmarle e di pubblicarle per te.\n\n- In questo modo arrivano agli altri utenti e Zeronet si occupa di inserirle nel database.\n\n- Tu dal sito usi il comando `dbQuery` assieme ad una query SQL tipo `SELECT * FROM post LIMIT 10;` e ti viene restituita una lista di oggetti che la tua ricerca ha prodotto, dopodiché puoi presentarli all'utente.\n\n> F: IL FATTO DI DOVER CERTIFICARE IL SITO è INTELLIGENTE... MA TROPPO COMPLICATO.\nBeh questo in realtà è l'unico modo noto (almeno a me) per permettere a qualcuno di pubblicare in maniera anonima un sito e di essere sicuro che non venga modificato dagli altri senza il suo permesso.\nInoltre le funzioni della API di ZeroNet `siteSign` e `sitePublish` aiutano abbastanza ad abbassare la complessità di tutto ciò.\n\n> G: (NAMECOIN...) un network che vuole essere gratuito... libero e senza il dominio le grandi aziende... per avere un dominio tipo salcazzo.coin devi PAGARLO. OK. DACCORDO. (BASTAVA UN PLUGIN CHE GESTIVA QUESTA COSA... AL POSTO DI ALTRI PLUGIN.).\nQuesta è una cosa a cui si sta pensando perché a molti non va giù (me compreso). Il problema è che se non metti un qualche tipo di \"tributo\" per registrare un dominio (in cryptovalute, tempo di calcolo della macchina o simili) qualcuno potrebbe arrivare subito con un dizionario di parole e registrare tutti i possibili domini con accoppiamenti di quelle parole (un sacco dei quali le persone vorrebbero poi registrare per davvero) per rendere inutile il tutto ed ottenere il monopolio sui domini (e poi cederli ad altri facendosi pagare). È una cosa abbastanza complicata da evitare.\nPer non parlare del fatto che per avere un sistema distribuito ed univoco come vorresti il DNS l'unica soluzione è avere una blockchain, con tutti i problemi correlati. Diciamo che è un campo di ricerca e non ci sono davvero delle soluzioni buone.\n\n> H: Comincio a SUPPORRE... che CHAT private siano impossibili... perchè i dati vengono scaricati da tutti.. e non so come viene gestito il sistema di protezione dei dati(se è presente... si presuppone esista.).\nA questo riguardo ci sono attualmente (quasi) due soluzioni:\n- La prima e più \"antica\" è quella utilizzata da ZeroMail: ovvero nel tuo `data.json` scrivi la tua mail cifrandola con un segreto ottenuto dalla chiave pubblica del tizio a cui vuoi scrivere in modo che solo lui possa decifrarla. In questo modo l'update lo mandi a tutti (e quindi ti aiutano anche a trasmetterla a quello a cui vuoi scrivere) ma poi il messaggio può leggerlo solo lui (e ZeroMail è anche fatto in modo che non si possa sapere a chi hai scritto: semplicemente ciascuno cerca di decifrare tutti i messaggi nuovi che arrivano e se gli danno un contenuto sensato li mostra all'utente).\n  \n  Ha come problema che gli update a ZeroNet sono a tempo (puoi mandare un update per sito ogni 26 secondi), quindi non potresti davvero rispondere real time, ma la messaggistica sarebbe limitata ad un ritmo di 26 secondi per risposta.\n- La seconda e che ancora non esiste (nel senso che è contenuta nel plugin PeerMessage, che è attualmente già sviluppato da Maggio ed è in coda nelle pull request di github per un'analisi delle vulnerabilità da parte di nofish. Puoi comunque scaricare autonomamente il plugin ed usarlo da subito): con il plugin PeerMessage puoi mandare un update solo ad un certo Peer (e gli altri ti aiutano a routare il traffico, anche se non so davvero come funzioni) e questo lo può leggere e passare al tuo sito.\n\n  Ha il pregio di non avere il limite dei 26 secondi (ma gli altri non ti aiutano a tenere i messaggi che tu mandi) ed è quindi ottimo ad esempio per giochi real-time o chat in cui entrambi sono presenti.\n  Con altri metodi poi (tipo il localStorage versione ZeroNet) puoi salvare le cose che ti arrivano in locale dall'utente per ripresentargliele la volta successiva.\n\n---------\n\nUna mia ultima nota: ZeroNet per quanto mi riguarda è molto meglio di IPFS o altri simili sistemi di Web decentralizzato per molte ragioni, ma purtroppo è stato pensato per funzionare il prima possibile, ed ha alcuni gravi problemi di design a cui si arriverà se dovesse crescere in quantità di utilizzatori.\nInutile dire che la mancanza di documentazione per gli sviluppatori e la reticenza a fornirne sono un grossissimo punto di debolezza.",
				"added": 1543226943
			},
			{
				"comment_id": 4,
				"body": "@shibeotp Ecco ho ritrovato qualche link:\n- [Grosso indice di risorse per sviluppatori](/Talk.ZeroNetwork.bit/?Topic:1509171908_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h), un po' datato ormai, ma contiene anche un link a\n- [The truth about ZeroNet](https://github.com/krixano/ZeroNet-Dev-Center/files/1334487/The.truth.about.ZeroNet.zip), una serie di tutorial di imachug sullo sviluppo di siti in ZeroNet (in inglese), che erano quelli di cui parlavo nel mio precedente commento.\n\nComunque ho aperto anche una [wiki (in inglese) per gli sviluppatori](/18hFUweFE3AJwZWnaMeq3fJMobrq8jevfd). Sui Merger non c'è ancora nulla, ma parecchie altre cose sono presenti.",
				"added": 1543249386
			}
		]
	},
	"comment_vote": {}
}