{
	"title": "王小嗨",
	"description": "A Marxist inside.",
	"links": "",
	"next_post_id": 37,
	"demo": false,
	"modified": 1593644979,
	"post": [
		{
			"post_id": 36,
			"title": "齐泽克：欧洲左翼背叛了库尔德人",
			"date_published": 1572304129,
			"body": "一百多年前，卡尔·梅的畅销大作《穿越狂野库尔德斯坦》，讲述了德国英雄卡拉·本·内姆西的冒险故事。这本广受欢迎的书创制了中欧对于库尔德斯坦的认识：那个地方充斥着野蛮部落冲突，虽然那里的人们有着幼稚的正直与荣耀，但他们依旧迷信、互相背叛、进行着永恒战争。这种认识不就是对欧洲文明的野蛮他者的滑稽讽刺。\n\n如果我们知晓今天的库尔德人，就不免对那个老套描述感到诧异。我知道土耳其的一些情况，那里的少数族群库尔德人是整个土耳其社会中的最现代和最世俗的族群。他们远离了一切宗教原教旨主义，他们还广泛实践女权主义。（我在伊斯坦布尔观察到一个细节：那些库尔德人经营的餐厅容不得丁点迷信）\n\n---\n\n圣人（川普的自命）背叛了库尔德人，他默许了土耳其对北叙利亚库尔德飞地的攻击。圣人行无需解释，毕竟「库尔德人不是天使」。对于川普来说，只有以色列和沙特阿拉伯才是天使；但对于有良知的人们来说，库尔德人才是那里的唯一天使。\n\n库尔德人散布在土耳其、叙利亚、伊拉克、伊朗这四个国家，他们理应完全自治，但库尔德人自决命运不符合任何人的利益，所以库尔德人为争取自治付出了血的代价。这样的苦难命运，使得库尔德人成为惨遭地缘政治荼毒的典范。\n\n还记得上世纪80年代末，萨达姆对伊拉克北部库尔德人的大规模轰炸和毒气攻击吗？在近旧，土耳其精心编排了一场游戏，他们说要炸伊斯兰国，而实际上土耳其的炸弹只会投递到与伊斯兰国作战的库尔德人那里。\n\n在过去的几十年中，库尔德人已经证明了自己组织公共生活的能力。无论多么艰难，一旦库尔德人从这些国家的纷争中抽身，他们就能荣光世界。\n\n萨达姆政权倒台后，伊拉克北部的库尔德飞地成了伊拉克唯一安全的地方。那里政事通达，甚至有定期飞往欧洲的航班。在北叙利亚，以罗贾瓦为中心的库尔德飞地在当今的地缘政治混乱中是一个超绝的地方：当库尔德人从那些一直威胁他们的大国邻居间得到喘息之际，他们就很快建立了一个社会，那是一个无冕的真实乌托邦。\n\n因我的志趣，我察觉到罗贾瓦知识界的蓬勃发展。他们还多次邀请我去授课，可惜这些计划被野蛮的军事紧张所打断。\n\n我们都知道库尔德人还必须依靠米国军事保护，而我那些「左翼」同侪对此的反应，令我悲伤。\n\n在土耳其、叙利亚、伊拉克和伊朗的夹缝之间，库尔德人应该怎么行动？他们是否还有其他选项？他们是否应该在反帝团结的祭坛上牺牲自己？\n\n几个月前，因「马其顿」之名引发争论。教唆库尔德人拒绝米国援助的「左翼」和反对更名「马其顿」的那些人一样令人作呕。\n\n有人提案将马其顿国名改为「北马其顿」，但立即遭到了两国激进分子的攻击。希腊的反对者坚持认为「马其顿」是一个古老的希腊名字，而马其顿的反对者则认为他们才是真的「马其顿人」，现在被贬为「北方」省份，是一种耻辱。\n\n这个不完美的解决方案让我们得以瞥见带有合理解释的无意义的斗争是如何结束的。但这个方案也存在着另一个「矛盾」：强国之间的斗争(一边是米国和欧盟，另一边是俄罗斯）。\n\n西方对双方施压，要求它们接受和解，以便马其顿可以迅速加入欧盟和北约；而俄罗斯则因害怕巴尔干地区失去影响力，则反对和解，进而支持两国狂热的保守民族主义势力。这都是利益考量。\n\n那么我们应该怎样行动？我想我们应果断支持和解。原因很简单，「马其顿」更名只有一个现实的解决方案。俄罗斯反对更名为「北马其顿」方案，仅仅出于它的地缘政治利益考量，而且俄罗斯也没有提供其他解决方案。\n\n如果我们支持俄罗斯，选择「马其顿」不更名，那么无非就是让俄罗斯的地缘政治利益得逞，而马其顿被出卖，成为牺牲品，它不能加入欧盟，与希腊也成了敌对邻邦。同样，如果教唆库尔德人拒绝米帝的武器和保护，那么我们的反帝「左翼」是否也在出卖库尔德人？\n\n这就是为什么有责任全力支持库尔德人抵抗土耳其入侵，同时严厉谴责西方列强和它们的肮脏游戏。\n\n周遭的主权国家正在逐渐陷入一种新的野蛮，库尔德人是仅存的希望。这场战斗不仅关乎库尔德人，也关乎我们自己，还将决定这个世界的秩序。\n\n抛弃库尔德人，欧洲解放运动最宝贵的遗产将不复存在。\n\n那时，欧洲会变天。\n\n当欧洲不再注视库尔德人时，欧洲就背叛了它自己。\n\n那时，欧罗巴就是欧罗巴斯坦。\n\n- 作者：Slavoj Zizek\n- 翻译：王小嗨、越异"
		},
		{
			"post_id": 35,
			"title": "为什么只有20位妇女获得自然科学的诺贝尔奖？",
			"date_published": 1571007957,
			"body": "2019年10月8日，瑞典皇家科学院在斯德哥尔摩颁发本年度的诺贝尔化学奖与物理奖。尽管从去年开始，瑞典皇家科学院就开始为诺贝尔奖的多样性开始采取一些措施，但和诺贝尔化学奖与物理奖大多数获奖者一样，2019年度的获奖者也都是男性。\n\n瑞典皇家科学院秘书长戈兰·汉森给科学家们写了一封信，要求他们在提名时考虑到地理和性别，并邀请了更多的女性来推举候选人，但是让诺贝尔奖获奖者多样化的努力进展缓慢。\n\n---\n\n诺贝尔奖有长久的历史传统，改变并不容易。在科学领域（包括生理学或医学、化学、物理学），只有20名获奖者是妇女。而在诺贝尔奖其他奖项（比如文学奖、和平奖），获奖者则更加多样化，妇女获得这些奖项也更多被认为可以「接受」的。\n\n但这些类别的奖项也面临着挑战，诺贝儿奖没有从metoo之类的现代运动中幸免。去年，由于一桩复杂的性骚扰丑闻，瑞典皇家学院没有颁发诺贝尔文学奖，所以今年的文学家有两个获奖者。\n\n阿尔弗雷德·诺贝尔发明了炸药，他设立了诺贝尔奖，明确规定诺贝尔奖不应该考虑获奖者的国籍。汉森在《自然》杂志上说，由于诺贝尔奖的创立者当初已经立约，他不能再增加新的规定。\n\n在2018年的揭晓诺贝尔物理学奖得主的发布会上，汉森说：「我们应该记住诺贝尔奖是为表彰新发现和新发明而设立的，那些获奖者为人类作出巨大贡献，这就是为什么诺贝尔奖就应该授予他们。」\n\n2018年，加拿大人唐娜·斯特里克兰因其在激光方面的发明而被授予诺贝尔物理奖。她是55年以来再次获得诺贝尔物理学奖的妇女，当记者告诉她历史上只有三名妇女获得该奖项时，斯特里克兰很震惊。\n\n从1901年到2018年，女性共获得诺贝尔奖物理学奖3次。\n\n其他两次分别为玛丽·居里和皮埃尔·居里分享了1903年诺贝尔物理学奖的一半奖金，原因是他们对亨利·贝克勒尔教授发现的辐射现象进行联合研究。\n\n玛丽亚·格佩特-梅耶和汉斯·延森获得了1963年诺贝尔物理学奖的一半奖金，以表彰他们对核壳层结构的相关发现。\n\n当诺贝尔委员会在10月9日的新闻发布会上向三名男子宣布化学奖时，我们就知道今年的情况就不太一样了，2019年就没有妇女获得诺贝尔自然科学奖项。\n\n唐娜·斯特里克兰说：「我还以为会有更多妇女获奖。女科学家的贡献显然很大，她们理应获奖，希望以后更多女科学家可以获奖。我很荣幸成为她们中的一员。」\n\n在斯特里克兰布获得诺贝尔奖的几周之后，斯特里克兰就晋升为正教授。\n\n汉森说：「我们希望还会有更多（女科学家获奖）。」\n\n诺贝尔奖提名名单不会被公布，名单将被保密50年。在2018年的诺贝尔奖发布会现场，有记者向汉森提问：到底在诺贝尔奖提名人中有多少妇女？\n\n汉森没有告诉记者确切的数字，他说：「可以确定名单的女性比例很小，所以我们正在采取措施以提名更多女性，我们不希望错过任何人。」\n\n他的同事物理学教授奥尔加·博特纳补充说，因为几十年前在科学领域工作的妇女很少，所以才导致现在这个情况。\n\n奥尔加说：「这些年来，女科学家的提名数量逐年增长，但提名数量更多地反应着20-30年前的（女科学家的）比例。」\n\n真的是这样吗？哥本哈根大学尼尔斯·波尔研究所的物理学副教授里斯萝蒂·周飞德对此进行了研究。\n\n周飞德说：「他们真的只是随机提名了男科学家吗？」\n\n周飞德和她的同事们使用历史数据并建模进行分析，他们想验证是否因为女科学家少才导致了诺贝奖获得的女科学家少，他们去年10月发布了一篇论文。周飞德指出，就算女性科学家人数少，获得诺贝尔奖的女科学家也不应该如此少。\n\n她说：「有95％的可能性，诺贝尔奖对妇女有偏见。」\n\n如果仅仅从取得的研究成果或发明来看，很多女科学家理应获奖。\n\n例如，奥地利物理学家里斯·迈特纳是个犹太人。第二次世界大战期间，为了逃离纳粹，她了到美国，但拒绝为曼哈顿计划造核武器。她的理论解释了同事奥托·哈恩1938年发现的核裂变，奥托·哈恩在1944年的工作获得了诺贝尔奖。\n\n里斯·迈特纳不仅仅是个案，在历史上，很多女科学家与男科学家并肩工作，但最后只有男科学获了奖。\n\n妇女和有色人群在诸多科学领域的贡献都被低估，而且这种现状也没有得到显著改变。要知道，2018年诺贝尔物理学得主唐娜·斯特里克兰，在获奖之前尽管已经有许多研究成果，但她只是加拿大安大略省滑铁卢大学的副教授。\n\n最近的研究表明，越来越多妇女获得了科学相关的奖项，但这些奖项的奖金都很低，知名度也不高。这些奖项很多都是教学方面的，而不是研究领域。\n\n在白人男性占多数的领域中，妇女或少数族裔获奖很困难。\n\n我们都知道很多时候科学研究，都会给身体造成伤害，如果白人男人再优先获得诺贝尔奖，那妇女或少数族裔就太惨了吧。\n\n- source link：https://www.pri.org/stories/2019-10-09/only-20-nobels-sciences-- have-gone-women-why\n- author：Rupa Shenoy\n- translator：王小嗨"
		},
		{
			"post_id": 34,
			"title": "柏林墙与真相：民主德国之后，人民失去了什么？",
			"date_published": 1568761447,
			"body": "- 在柏林墙开始建设（1961年8月13日）的周年纪念日（2019年8月13日），土耳其共产党（Communist Party of Turkey，TKP）的Tevfik Taş就德意志民主共和国的相关问题发表了文章。作者在文中讨论了，民主德国的社会主义终结之后，人民失去了什么。\n\n多年来，德国资产阶级政客利用柏林墙对德意志民主共和国进行造谣抹黑，而且它们还将继续这么做。鲍尔股份公司（Bauer AG）的首席执行官Thomas Bauer，就是这个造谣抹黑的宣传机器的头头之一。1996年，柏林墙被摧毁，Thomas Bauer成立了「建筑行业伦理审查委员会”。该委员会宣称，「出于政治目的而建造柏林墙，是不道德的。」\n\n---\n\n## 柏林墙与斗争美学\n\n我们有必要对一些值得讨论的问题加以审视，而不应仅仅从所谓伦理出发。正如，要讨论民主这一概念，就不能不讨论它的阶级性和它在阶级斗争中的位置。同样，（如果）脱离了柏林墙的阶级性及其在阶级斗争中的位置，我们还能够讨论柏林墙吗？（如果）不考虑斗争的必要任务和目标，我们还能够谈论斗争美学吗？\n\n当然不能。\n\n（一些人）将一个概念从决定其性质的基本因素中剥离出来；更重要的是，将一个概念从其历史背景中剥离出来——从而生造一个「普世”规则。这种做法，无异于从魔术帽里拽出一只兔子。左派不应不恰当地使用任何这样的概念——这样的概念只考量人权或者自由，而脱离了阶级和斗争的状况。\n\n冷战结束后，「民主”和「人权”成了最有影响力的两个概念。一些人以这些概念作为幌子，发动反对现实社会主义（译者注：即历史上存在过的社会主义国家及其制度）的战争。他们披着「民主”的外衣，散布所谓「自由”的话语，以掩盖经济剥削。他们还将「人权”作为侵犯主权国家的借口。\n\n（一些左翼）以「柏林墙不符合工人阶级的斗争‘美学’”为由来诋毁它，实际上是脱离了为政治权力而斗争的实际需要。\n\n## 什么叫「历史惩罚”？\n\n1989年10月7日民主德国成立40周年时，戈尔巴乔夫告诉东柏林的埃里希·昂纳克（译者注：民主德国领导人）：「生活惩罚那些还不改革的人们。”\n\n叛徒戈尔巴乔夫不仅背叛了苏联的社会主义，同时还教唆昂纳克背叛民主德国。在戈尔巴乔夫演讲一个月后，反革命势力颠覆了民主德国。苏联曾经为民主德国的建立做出了重大的贡献，苏联放弃支持民主德国后，反革命势力的最大障碍也就消失了。就这样，戈尔巴乔夫及其叛徒集团把民主德国拱手让给了饿狼般的反革命势力。\n\n在柏林墙倒塌前的几个月，（民主德国）国家安全局向（党的）政治局发送了一份报告，称该国的情况「比1953年更糟”。\n\n（某些人）曾经向人民许诺一个更好的社会主义：不仅社会主义的社会保障制度将会继续存在，而且人们还可以像那些资本主义国家的人们一样自由地消费。这就是他们对人民的承诺。\n\n然而事实并非如此。\n\n根本没有什么「公正的资本主义”，人民的权益逐渐丧失——免费教育、人人有权工作、免费医疗、住房、社会文化娱乐、无需担心未来、零失业、有尊严的退休生活……\n德国东部的人民很快感觉到，在资本主义德国，要获得所有这些权利几乎不可能。\n\n然而，民主德国的失败同时也是苏联的失败。导致崩溃的鲁莽执行者戈尔巴乔夫，把民主德国送上了帝国主义强盗的餐桌。\n\n现实教育我们：自己的革命不保卫，就会遭到历史的惩罚。\n\n## 反革命之后，原民主德国的人们过得怎么样？\n\n1988年，民主德国的女市民60岁就可以退休了。如今，她们不得不工作到65岁。\n\n1988年，退休人员可以领到477民主德国马克。他们自己的退休金足够支付房租和购买食品。到了月底，很多人都还剩下一半的退休金，有些人甚至剩下三分之二。\n\n在民主德国，公共交通几乎是免费的，它不以利润为导向，只求为人民服务。\n\n那时，人们逛图书馆，逛剧院，听音乐会。现如今，人们要不逛超市，要不宅在家看电视，无处可去。\n\n曾经，孩子们都可以上全托幼儿园。现在德国强大了，全托却只有中产以上人群才能上得起了。孩子能上全托，你就是成功人士。如果你不是成功人士，上班和带孩子将占据你的所有时间。\n\n芬兰是一个教育领先的国家，它就采取了民主德国的许多教育方法。而现如今，德国的教育水平却是二流的。三级中学教育、大学费用高、读大学将负债，这些都是反人民教育政策的结果。\n\n工人的孩子，长大后只能成为理发师或者机械师；上层阶级的孩子可以读好大学，长大后做管理人员。\n\n在民主德国，没有什么（教会征收的）教堂维持费。在社会主义的阳光下，世俗主义得到了坚决的贯彻。\n\n在民主德国，教会从来不是最大的老板。教会不能控制学校和医院，它的权力仅限于宗教事务。\n\n现如今，如果人们不交宗教税，就没有人关心他们是不是失业。教会雇佣着150万工人，是德国最大的老板。通过其控制下的博爱会等机构，教会正在把传统的「基督教慈善”变成盈利性的。\n\n在民主德国，工厂和土地都属于劳动者的公有制企业。市民们做同样的工作，绝不会拿到不同的工资。民主德国没有什么老板。现如今，德国收入差距巨大，人们饱受最坏的现代奴隶制——外包制度的奴役。\n\n被房租合同欺骗；被保险公司抢劫；毫无意义的（商品）供应制造着（消费主义的）需求；愚人的广告；富人炫富；电信诈骗——这些都是德国人民正在经历的。\n\n- source: 国际红色通讯2nd\n- original source: 《左翼报》[土耳其]\n- original link: http://news.sol.org.tr/berlin-wall-and-truths-what-people-lost-after-end-gdr-176112\n- translator：王小嗨\n- proofreader：Mud Cake"
		},
		{
			"post_id": 33,
			"title": "青春献给深圳，伤痛留给自己",
			"date_published": 1566169334,
			"body": "湖南夏天雨水多，这天又是阴天，华姐的手又犯疼了。\n\n与往常一样，华姐今天早起给婆婆和孩子做好了早饭。吃完早饭，华姐就匆匆骑着电瓶车赶去镇上的一家快餐店上班。\n\n每天十个钟，如此生活一天又一天，小心翼翼守护着全家的生活。\n\n---\n\n2016年，华姐在深圳平湖的一家五金厂打工。厂里给买保险，只有五险没有一金，工资还行。\n\n夏天入职，白班夜班来回倒班。亲情驱散疲惫，予生活以温柔。工作虽累，但还好孩子在身边。\n\n湖南距离广东近，改革开放后，很多湖南老乡都来到深圳讨生活。\n\n2000年华姐从湖南老家来到深圳打工，那时的绿皮火车挤，要差不多10个小时才能到深圳。\n\n第一次来深圳听着火车上老乡的介绍，华姐在一片拥挤和嘈杂声中听到了「那是个大城市」。\n\n来深圳的第二年，华姐就把孩子从湖南老家接到深圳念书了，「这孩子是在深圳长大的」。那时的一切好像都步入正轨，又充满了希望，至少这要比家乡好。\n\n2016年的夏天，在五金厂的日子不紧不慢，11月的一天，华姐上夜班。\n\n华姐在厂里开冲床，冲床是一个危险的工作。机器是吞料的饕餮，饕餮不光吃料，它还吃人，它要求操作工精神必须非常集中。稍有不慎，就会残肢。\n\n打工就是把人规训成机器，拿料、送料，都必须要像机器一样精准。可机器都有劳损的时候，更何况是人呢，倒夜班的时候犯困，可这机器哪知会有黑夜和休息？\n\n那晚夜班，华姐向冲床机送料，「那个机器它就快了，我的手慢了，没拿出来」。\n\n在珠三角地区，没人知道机器吞噬了多少工人的身体。华姐的手就这样「碎」了，同时破碎的还有华姐的生活。\n\n厂里给华姐做了工伤鉴定，8级伤残，其实华姐的工伤够7级了，「那鉴定给人感觉好像我占了便宜似的」。那找律师打官司呢？可没钱怎么请律师，咱们小老百姓也耗不起。\n\n华姐住了院，孩子没人照顾。这从小在深圳长大的孩子，只能转学回老家念书。\n\n两年的住院时间，让华姐结识很多和她一样遭遇的工友。他们一起取暖，一起打气。\n\n一个人一旦有工伤就意味着被淘汰，很多有工伤的工友就不会再有厂要他们，出院后只能回老家，华姐也这样被淘汰了。\n\n华姐在深圳再也进不了厂，面对回老家的窘境，只能再想想办法。\n\n「我们都是病友啊，在一起住院，你传我，我传你，就这样知道了。别人介绍我，我再介绍别人，就这样啊。」\n\n华姐在工伤病友的介绍下认识「左撇子豆浆」。\n\n「左撇子豆浆」是一家开在龙华水尾新村的一家早餐店，老板陈大哥也是一名工伤工人，一次事故让他失去右臂。\n\n因为这样的经历，陈大哥特别关注工伤工人的境遇。陈大哥开店后，生意做得还算红火。他就想把自己的手艺传出去，让更多工伤工人学会这门手艺，好自己开店做买卖，过上有尊严的生活。\n\n后来，陈大哥一直坚持招收免费工伤学员。他有不少学员都开了店，生意不错，人也就看到了希望。\n\n陈大哥的故事在工伤工友圈里，传得广，不少人都知道。华姐听说后觉得挺好的，学门手艺，也许回老家后生计就不用发愁了。\n\n2018年11月，华姐在左撇子豆浆完成了15天的课程。豆浆、肠粉，或者其他早餐，都不在话下。就这样，华姐离开了工作与生活18年的深圳，回到老家，她只带走了伤痛。\n\n回到老家后，华姐开始筹备自己的生意。采购原材料，勘查摆摊地点，一样都不能少。\n\n华姐的老家在农村，到镇上，骑电瓶车也要半个多小时。\n\n她每天4点钟起床准备早餐摊，忙到6点多出发，骑电瓶车驮着待售的早餐出发，到镇上才6点半多一些些。\n\n那时正值冬天，湖南湿冷，冻得华姐手疼。只能忍忍就过去了，因为再疼也要生活。可天冷，豆浆也冷了，这怎么卖？「结果一早上只能卖出去了10多杯」。\n\n10多天过去了，生意都不见起色，这样耗下去也不是办法，华姐就在镇上找工做了。\n\n华姐自己分析说：我们镇地方小，都没有在外面吃早餐的习惯；就算在镇上租店面，也没本钱啊。\n\n陈大哥跟她说，到深圳来开店，大城市人流量大，做生意也容易些。可华姐哪能脱得开身，家里的两个老人，还有两个孩子，都需要她照料。\n\n现在放暑假，孩子都在家。华姐每天10个钟的班，中午还要回家给老人孩子做中饭。\n\n「我一个月才一千五，我老公才三千元，有个儿子上学一年的学费要一万六，还有两个老母亲。」\n\n眼下，华姐自己交着深圳的社保，毕竟到现在为止都在深圳交了11年社保了。\n\n「本来我想要公司里面帮我买，我自己出钱，他都不同意。」\n\n「好多人都说要我跟厂里面打官司，但我也没有什么熟人，又没有多少钱，我怕打不赢就算了，所以放弃了。」\n\n「一个月我自己出钱640多，今年七月份又涨了，涨到700多了。」\n\n做生意没本钱，回深圳打工没厂要。「我的生活真的很困难」，生活把她碾过去，可华姐还是把日子一天天过下来了。\n\n青春献给深圳，但所有苦痛都需要劳动者自己来背负，「也是自己的命了」。\n\n* **source：** 尖椒部落\n* **link:** https://www.jianjiaobuluo.com/content/107052"
		},
		{
			"post_id": 32,
			"title": "性骚扰、低工资、临时工，英国麦当劳女工不干了",
			"date_published": 1565909992,
			"body": "上个月，美国众议院通过美国最低工资提高到每小时15美元的《提高工资法》，这是无数美国工人多年斗争的见证。\n\n在美国的「最低时薪15美元」运动中，快餐业工人最为活跃，他们取得的成果也鼓舞了英国快餐业工人。几年来，英国快餐业工人也勇敢站出来抗议不公不义的生活，提出最低「时薪10英镑」的口号。\n\n---\n\n我们知道快餐业工人很大一部分都是女工，可这都2019年了，英国麦当劳工人还在遭受着性骚扰，而那些罪犯员工没有被麦当劳公司开除，顶多换到其他门店，继续上班。\n\n在英国麦当劳，很多管理人员经常开性玩笑，公开讨论自己的性欲。不仅如此，麦当劳的管理人员还利用职务之便获取员工的电话号码，给她们发短信或者露骨照片。更有甚者，有些管理人员会说可以提供更好工作时段或者晋升机会，只要用性来交换。\n\n英国食品业工人工会是英国最大食品行业的独立工会，该工会的各地分支机构向工会报告了很多性侵与性骚扰的详情。工会主席伊恩·霍德森介绍说，有关性侵和性骚扰投诉非常多，还有工人因为投诉而被报复。只有少部分工人因为签了保密协议，才获得补偿。\n\n英国麦当劳发言人建议：那些被性骚扰的员工可以去找他们的经理，也可以拨打员工求助热线，公司会「立即调查」。\n\n但工会发言人说：「在英国麦当劳性骚扰非常普遍，而性骚扰犯却逍遥法外。这是一种有毒的文化。我不是说每一个麦当劳门店都有性骚扰和性侵，但管理层有人性骚扰员工，在有些门店都成普遍现象了，麦当劳却什么也没做，没有去解决这个问题。」\n\n「工人依靠出卖自己的时间来活命，而那些管理人员掌握权力。工人出来打工，就会变成权力的猎物。权力的不平等，使得员工和管理人员地位悬殊。当工人提出投诉，经理不会按照公司章程来进行处理，往往敷衍了事。我们已经听过多次指控性骚扰的案例就这样被糊弄过去了。」\n\n根据工会在全英国的调查，英国麦当劳有1000多名女工遭遇性骚扰。\n\n「很少有麦当劳工人对性骚扰提出申诉，不是因为他们没有被性骚扰，而是因为他们不知道申诉程序。对于许多工人来说，让人知道被性骚扰并不是什么光彩的事，而且就算去申诉，谁会相信他们呢？」\n\n很多时候，那些性骚扰的受害者害怕被报复或者穿小鞋而不敢去投诉，而且很多加害者都是经理的朋友。性骚扰受害者担心在工作场所被孤立，他们不敢去举报，只能在工作时让自己尽量那些罪犯远一些，让工友多看着点自己。\n\n其实早在2017年9月，工会就组织了英国历史上第一次麦当劳工人罢工，要求最低时薪10英镑，并保证工作时间，承认工会的地位。\n\n一位来自伦敦的麦当劳女工说，她在一家麦当劳门店工作多年。在那里，她遭受到一位高级员工的性骚扰。\n\n她说：「那个经理总是有事没事地骚扰我，比如他妻子不在家，他就问我是不是要一起开心一下。在工作的时候，他都会跟我说这种话。不知道从公司那里，还是其他同事那里，他搞到了我的号码，给我发短信说，只有他和孩子在家。我就把他的号码拉黑了。没想到，储存室没有监控，他直接把裤子脱了，拿着自己的生殖器问我：‘这个大不大？’\n\n「在我投诉之后，另一位经理说我最好能证明我投诉里说的内容。如果我这样投诉她，她会拼了命告我是诽谤。」\n\n在数月里，这位女工曾经多次向同事和管理层寻求帮助，但都没有得到帮助，她只能自己应付。\n\n最后，她给麦当劳的人力资源部门写了一封正式的投诉信。几个月后，麦当劳展开了一个应付了事的「调查」。调查开始后，她要和那位实施性骚扰的经理继续一起工作。\n\n没过多久，她在工作中过于害怕被报复，生了病，被送进了医院。到现在为止，这位女工都没有办法重新工作。\n\n这位女工说：「我希望麦当劳和我的经理们倾听一下我们的声音，我们需要反骚扰政策。如果你多给了客人番茄酱或者餐纸，麦当劳会考核你，但要他们解决骚扰问题简直是做梦。遭受性骚扰的妇女的数量那么多，我们都无法想象。「\n\n「仅仅就我知道的，就有20到30起性骚扰事件。后来，我就知道了，这是套路。因为只有管理人员知道哪里有监控，哪里没有监控，但那些新进的员工不知道。比如在厕所或者储存室。如果那些被性骚扰的人反击，她们最后要不被警告，要不被开除。想一下，如果这发生在你的儿子或者女儿身上，该怎么办？」\n\n岂止性骚扰问题严重，英国麦当劳工人还面临着只能做临时工的窘境，他们很多人只能拿着低薪，住在狭小的出租屋里。\n\n目前，工会正在为麦当劳工人筹款，准备罢工。低薪、临时工、不安全的工作环境，麦当劳工人不干了。\n\n*   original title：More than 1,000 reports of sexual abuse and harassment at UK McDonald’s, campaigners say\n*   original link：[https://www.independent.co.uk/news/uk/home-news/mcdonalds-sexual-harassment-protests-abuse-workers-a8937186.html](https://www.independent.co.uk/news/uk/home-news/mcdonalds-sexual-harassment-protests-abuse-workers-a8937186.html)\n*   link: [https://www.jianjiaobuluo.com/content/107051](https://www.jianjiaobuluo.com/content/107051)\n*   author：Maya Oppenheim，translator：王小嗨"
		},
		{
			"post_id": 31,
			"title": "三和大神宋春江：我不想工作",
			"date_published": 1556834957,
			"body": "2018年5月，深圳三和，阳光灿烂。人群熙熙攘攘，太阳照耀着水泥地面，散发出阵阵尿臊味。午间已经没有什么日结可找，大家三三两两，徘徊张望。\n\n人群里面有一个人，他叫宋春江。宋春江，NHK三和纪录片的受访者之一，因去「做法人」[1]，名下有三家五百万的企业，人称：「宋总」。\n\n* * *\n\n宋总，也被称为三和哲人，他在纪录片里的言谈都透露着一种深刻的绝望，又或者说他彻底实践了「佛系生活」。他对生活的态度，引发了广泛共鸣，许多囚禁在「996」中的加班狗对他赞美有加。对于许多安于现状的人们来说，宋春江就好像点亮了一盏灯火，只能遥望，不能触碰。\n\n宋春江彻底实践了「佛系生活」，可其中的甘苦只有他自己知道。彼时，他并不知道自己即将掀起一个小风暴，他衣服脏兮兮的，走到海信[2]门前台阶，想找个空地坐下。\n\n这时，一个屌毛[3]刚看到他坐下，就惊讶地说：老哥，你上电视了，不过是日本的，贴吧上就有。宋春江很纳闷，他怎么会上电视了。仔细回忆了一下，他这才想起自己之前被人请吃了饭，录了像，得了100块钱。\n\n他跑到网吧，找到网盘里的视频资源下载下来就看，再看网友留言。宋春江知道自己出名了，NHK就是日本的CCTV啊。\n\n要说到那次拍视频，那是在2018年春节后不久。2018年春节，宋春江留在三和过年，没有回老家。到了晚上，三和冷冷清清，不要说日结，连个人都没有。\n\n没钱吃饭，但有一个老哥请喝啤酒，可是只能喝啤酒，没有饭吃。中间实在饿得不行了，宋春江看到地上有碗泡面汤，捡起来一摸都凉了，但是实在饿得慌，大冬天就把冰凉的面汤大口喝了下去。\n\n没想到，没想到，因为这一碗面汤，他拉了两天肚子。到了初八，宋春江已经有气无力了。后来，一个老哥好心请他吃了碗炒粉，买了瓶大水。整个大年期间，宋春江就吃了两顿饭，好不容易挨到了初八，终于有日结可以做了。\n\n见到日结中介，宋春江说赶紧搞个饭吃。吃完饭，大家就一起了东莞。到了地方，人家没开工。虽然什么活也没做，但也算做了两天工，中介觉得这样太亏，赶紧给他们结了工钱，回了三和。\n\n两天日结的工钱，玩不了多久，宋春节很快没钱了，挂逼[4]了。那天，他和往常一样饿着肚子，在海信大酒店前转悠，遇到之前一起日结的老哥。\n\n「屌毛，最近跑哪去了？」\n\n「没活干，挂逼了。」\n\n「那边有人请吃饭，你去不去？」\n\n「有人要请吃饭，你怎么不去？」\n\n「那边吃饭要拍照。」\n\n宋春江一听，就吃饭、录个像而已，还有一百块钱拿。拍就拍呗，几天没吃饭了，拍个照算什么？再不吃饭就饿死，反正宋春江是决定去了，其他两位老哥一听，也跟着去了，总比饿肚子强。\n\n他们当时并不知道，这顿在小餐馆的廉价午餐会变成许多人津津乐道的话题。而且介绍他们去吃饭的中介，还从他们每人那里赚了50块钱，「黑中介」无所不在啊。\n\nNHK的三和纪录片播出后，虽然三和许多老哥都认识了宋春江，但他的生活并没有太大的改观，依然是饱一顿饥一顿，无非是多了几个老哥在海信楼前跟他打个招呼。\n\n要说那次拍摄怎样改变了宋总的生活，那得从他开始做直播说起。宋春江自己没有手机，就和另一个老哥做起来直播，收入按比例分成。没做几天，就因为分成问题，散了伙。但几天的直播也让宋春江知道了，关心自己的人遍布全国。\n\n没过几天，就有一位江苏的老板通过别人的微信给他转了500块钱，说这钱是借给他的，要还的。宋春江就说：我做直播，每天还你50吧。接下来几天，宋春江就拿着手机做直播，从龙华汽车站，再到龙华公园，有时候还去汇海广场。\n\n欠债从500，到450，再到400，再到350，再到300，再到250，再到200，再到150，再到100，再到50，直到还清。还清了，宋春江如释重负。可那位老板立马给他转回500块钱，说：这钱你自己自己留着吧，我就是让你永远记住这个感觉，努力的感觉。\n\n宋春江直播了两三个月，直到贴吧直播账户被封号，收入了7000-8000，大部分都是红包打赏。收入挺高，烦恼也挺多。与那位借钱给他的老板一样，许多关注宋春江的朋友都希望他不要再挂逼下去了，进厂，找个工作，早日上岸。\n\n这些说教给宋春江非常大的压力。人家帮助他，让他去上班，可他自己又上不了岸，最后变成了「欺骗」。宋总没有才艺表演，他觉得他每次直播都是在尬聊，每天的内容都很无聊。其实他不知道，不少朋友看他的直播，就是想猎奇三和的挂逼生活。可是呢，在海信大酒店前又不能直播，有被打的风险。\n\n传说海南有很多流浪者，三亚还给流浪人员发放免费食物，还可能去饭店打包别人吃剩下的饭菜。为了「对得起观众」，他去了海南。可到了三亚，宋总拉不下脸，不愿意去打包剩饭，有时候只能趁夜深人静，去开宝箱[5]。\n\n在三亚，宋春江住星级酒店，大口喝酒吃肉，他给看客们直播热带风情，他总想让大家的礼物和打赏物有所值。可并是不所有人理解他，有人骂他骗吃骗喝，是团饭狗[6]。贴吧直播账户被封了，他后来又陆续开了几次直播，但最后总是做了一段时间，就把手机卖掉了，宋春江不想被污蔑成团饭狗。\n\n几番折腾后，他从三亚回到三和，他觉得直播很累。工作很累，直播也累，手机也没了，那到底要怎样。很多时候只能饿着，当然也会有老哥从全国各地过来请宋春江吃饭，请他上网。但是如果说要他上岸，还是免谈了。\n\n为什么不上岸？宋春江说，他以前「挑战黑厂」，都失败了。\n\n少年时代的宋春江从皮鞋技校毕业后，就被学校分配到了东莞一家鞋厂。「每天早上7点20上班，上午上到11点半，下午一点半又上班了，上到下午五点，六点半又上班，一下上到10点多，吃个夜宵，又去上班，上到凌晨两点。第二天还他妈上班。」这就是宋春江从少年步入社会的成人礼。\n\n「正常都是10点、11点（下班），赶货的时候两点，有时候还会通宵。比如说今天干到凌晨两点，还没干完，通宵干，干到早上六点，四五点五六点，下班之后，放一个上午假，或者放一天假，一个月就就一天假，我操。一个月他妈才650块钱。」\n\n宋春江在这家东莞的鞋厂大概待了快一年，「每天脑子都干坏了，刷胶水搞了鼻炎。」「有鼻炎，不能工作」，后来成了宋春江直播期间的一个QQ签名。直播的看客问他，为什么不去工作呢？「有鼻炎，不舒服，没法工作。」\n\n从第一个厂自离后，他没有拿到被压的一个月工资。学校送了40多个毕业生过来，最后只剩下5、6个人，这几个人都是比较能吃苦的。经过朋友介绍，他后来又进了一家鞋厂。工资高的厂，要技术，要工作经验，他都没有，进不去。\n\n「在第二个厂稍微好点了......每天晚上十点钟下班了，有时候会加班，但好像加班没有加班费。」「干了两三个月，不行，要跑路，太累了，听人家说电子厂轻松，就想进电子厂。」后面也没进电子厂，陆续进了几个鞋厂，大都差不多，两三个月就跑路了。\n\n到了2009年，宋春江来到深圳。他去了一家休闲会所做服务员，「按摩的、洗脚的那种，在那做服务员，工资也低，干了大概半年左右，我又不干了，我没一个工作超过一年的。」「过年都没回过家，都是过完年回家的，身份证丢了才回家，干了干，不行，又跑到KTV做服务员，做了不行，又去酒吧。」\n\n「不想干啊，然后就是工资低啊，累啊，很累啊。」\n\n「天天跑来跑去，送水还整理房间，扫卫生，扫地拖地的，累不累，我靠。」\n\n此后，他陆续做又做过保安、治安员，保安、治安员不能玩手机，宋春江觉得这样的工作不能忍受。宋春江听说朋友说安徽有个看厂的工作，工资不低，还可以玩手机。结果过去发现是传销，从传销那里逃出来，回到老家，身上什么也没有了。\n\n父亲说：你小心点。「我后来又出来，还来深圳这边吧，后面又去东莞，然后挂逼了，去浙江了。」在浙江，他没有工资，天天打游戏。钱花完了，借弟弟的。在网上发现了一个「自杀」QQ群，在群里加了一个好友，相约一起跳楼自杀，那刚好是2010年富士康员工坠楼自杀的前后。\n\n他真的跑到东莞去见了网友，可见了面，两人都没有再提自杀的事情两人，「他说，你好好生活吧，我说，你也好好生活吧。」\n\n回到深圳后，宋春江又做一段时间保安，也做不长久。他喜欢打游戏，听说有游戏代练这个职业，他觉得游戏代练很适合自己，又可以玩游戏又可以赚钱，岂不美哉？进入游戏代练行业，一干就是两年。\n\n「鼠标12个小时，不离手，最多的时候，一个人操控三台电脑，大部分都是操控两台。这个手都疼，这里面骨头疼。所以我（在网吧上网）现在就看个电视，很少玩游戏。」\n\n之后，他陆陆续续换了很多工作。期间，他还每月把大部分工资都拿给了弟弟开蛋糕店，「明知道他搞不好，搞不了，我还把钱给他，就是支持一下他的梦想，你知道吗？」\n\n2016年，宋春江从一家保安公司辞职。「（身上）还有4000多，当时我特别悲观，感觉要死啊，死在深圳了，他妈的花完之后，又不找工作，找工作又不想干。」\n\n「我说来三和这边吧，（朋友）以前带我来过嘛，就是找工作，招到厂里面，要不我进个厂，算了，不想再干保安了，干腻了，然后来三和之后，就看一个网吧，很便宜的，住宿也挺便宜的。」\n\n「过来我就先上网，还是玩游戏，然后我觉得挺好的，然后我就不想找工作了，然后我看这边人都没钱，‘唉，请我喝瓶水啊，我没钱了’，我说他妈一瓶水都买不起，我还有4000多，我怕啥？再玩吧。没钱了，我给我弟弟说，我弟弟又给我打了两千，我又继续玩。那是16年9月份，玩到就快过年了，快17年了。」\n\n后来没钱了，他就去东莞一家电子厂组装华为手机。就是个临时工，很累。这是宋春江最后一次进厂，「就想着厂里太蛋疼了，干时间长了，不想干了，想休息一下，做一下日结。」后来日结也不想做了，反正「日结也是挂逼」。\n\n「17年4月份、5月份，就有人找我贷款，弄个公司，然后我一贷贷了两万。」开始还勉强做做日结还贷款，后来「彻底不想干了，彻底堕落了」。\n\n「到六月份就真的逾期，还不了了，我就把手机卡也扔掉了，手机也卖了，身份证也做法人了，谁也找不到我了，到时候，饿死就算了。」\n\n他又想自杀了。从三和步行离开，一连7天，只喝水，没吃饭，他就吃了几个路边树上的芒果。饿的时候，心里已经没有死的念想了，只想着吃点东西。幸亏被好心人搭救，回到三和后，他偶尔做做日结，「别人做一天，玩三天，我做一天，玩一个星期。」\n\n农历新年，宋春江还是没有回家。再后来就遇到了拍纪录片的，NHK记录片播出后，他直播赚了钱，回老家补办身份证，父亲让他早点回深圳：大家都在努力，就你在家闲着，也不好看。\n\n要努力吗？宋春江已经放弃了。\n\n他在深圳一家酒店工作的时候，谈过一个对象。虽然没有确立男女朋友关系，但宋春江觉得「就那种感觉吧，幸福的感觉。」后来，宋春江听说她跟一个结过婚的男人出去过夜，就不再联系她了，她也不再找他，就不了了之，他也就辞职了。默契分手，互不打扰。\n\n「她一个月5000、6000，我一个月1200，所以她跟一个有钱的人走了。」\n\n「也不能说女的拜金，你得有些生存的能力，最起码能自己顾得上自己吧，你现在自己都顾不上自己了，不给人家添麻烦吗？」\n\n「成家啥的也没有勇气了，没有赚钱的能力。最重要的不是说人家拜不拜金，人家也不想拜金，你能不饿肚子？能不能有个地方住？做不到，自己都没个地方住。」\n\n宋春江算了一笔账，就算一个月工资5000，在老家盖一栋房子也要20多年。「太慢了，我不能坚持。」他想找一个不太累的工作，「每天4个小时，工资2000也可以。可这样的工作没有啊。」\n\n「随便他们说（网友指责宋春江不工作），这是事实，说得没错。」\n\n「幻灭了，不太敢想，这辈子就算了。」\n\n## 注释\n\n[1]将身份买给中介，开设公司，以此赚钱费用，属于非法活动。\n[2]海新信人力资源市场，因有很多大神睡在海信楼前，大神们亲切地称其为「海信大酒店」。\n[3]在三和，谈话时指代第三人均用「屌毛」代指。彼此都不愿意透露自己的名字。有时表达不友善的意思时，也会用「屌毛」称呼对方。\n[4]三和的日结零工不再进厂打工，靠日结度日。日结并非每天都有，当连日结都没得做、饭也没得吃之时，大神们称这种状态为「挂逼」。 由此，还延伸出「挂逼面」、「挂逼床位」、「挂逼保安」等等说法。\n[5]在垃圾箱里翻找食物。\n[6]类似要饭，不过是同时向很多人要饭。\n\n*   **source：** 尖椒部落\n*   **link:** [https://www.jianjiaobuluo.com/content/106656](https://www.jianjiaobuluo.com/content/106656)"
		},
		{
			"post_id": 30,
			"title": "穷忙、低欲望、老后破产......日本青年终于不乐意了",
			"date_published": 1555452191,
			"body": "![20190417.1-c](img/japan-fight-for-15-living-wage-aequitas/20190417.1.jpg)\n_木村拓哉的微博头像_\n\n日本偶像在中国俘获了一大票年轻人的心，提起那些漂亮的小姐姐小哥哥，总会听到几声兴奋的尖叫。\n\n从流行文化，到各类物件，再到生活方式，两国年轻人似乎越来越亲近。\n\n日本青年低欲望，中国青年佛系生活；日本青年穷忙，中国青年996；老后破产的可怕景象也袭遍朋友圈。\n\n* * *\n\n时至今日，日本与中国在经济、社会和人口等等问题有着相似的症状。\n\n要么穷忙，要么过劳。世道艰辛，且行且珍惜。\n\n这几年，在日本，终于有一群年轻人开始说：“不！”\n\n![20190417.2-c](img/japan-fight-for-15-living-wage-aequitas/20190417.2.jpg)\n_全面击溃黑暗的资本主义_\n_图片来自：Twitter/@_natsukik_\n\n受到发源于美国的“最低时薪15美元”运动的鼓舞，一群日本年轻人成立了“正义”组织。他们受够了贫穷，他们要求全国每小时最低时薪为1500日元（约合15美元），“正义”将致力于日本国民经济的民主化。\n\n2017年4月，日本繁华商业地段东京新宿地区，1500多人走上街头，抗议日本普遍贫困现象，要求提高基本工资。许多行人纷纷举起手机拍照，抗议者则高喊：“如果你想提高工资，请发出你的声音。”\n\n在他们之中，不少还是大学生。其中一名参加抗议游行的20岁大学生拿起扬声器说：“并非所有学生都能参加集会，因为他们必须把时间用在打零工。我代表他们出来发声。“\n\n![20190417.3-c](img/japan-fight-for-15-living-wage-aequitas/20190417.3.jpg)\n_生活在痛苦中的人，发出声音来！_\n_图片来源：kyodonews.net_\n\n“我们除了豆芽，别的都吃不起，我们想给孩子们一个好生活。”\n\n参加集会的很多都是20多岁的年轻人，藤川理絵在那时25岁，她说：“按照现在日本的平均工资，工人甚至看不起病。”\n\n藤川理絵还是个孩子的时候，她父亲是一名牙医，平时要兼职送报纸。一次意外，她父亲送报纸摔伤腿，就此失业。\n\n这次事故，使得她从高中就开始业余做兼职。她靠借钱完成大学教育，30年的贷款，她每月需要还15000日元（约合人民币900元）。\n\n![20190417.4-c](img/japan-fight-for-15-living-wage-aequitas/20190417.4.jpg)\n_停下来！黑心企业！_\n_图片来源：Shinta Yabe_\n\n自20世纪50年代以来，日本劳工运动一直在不断式微。日本工人参与工会的比率继续下降，从1949年的55.8％降至今天的17.4％。\n\n在日本大部分工会都服务于“正式工”，而合同工和兼职雇员的比例不断上升，“正义”组织正在寻求改变。\n\n自20世纪90年代以来，日本的非永久性合同工人数量稳步增长，同时贫困率达到历史最高水平。 根据联合国儿童基金会今年发布的一份报告，日本在世界上最富裕的国家中儿童贫困程度最高。\n\n与合同工相比，尽管“正式工”相对收入稳定，但许多“正式工”也成为工作条件恶化的受害者。 一名年轻女子自杀身亡，她在一家广告公司工作，每月加班时间超过100小时，引发广泛关注。\n\n![20190417.5-c](img/japan-fight-for-15-living-wage-aequitas/20190417.5.jpg)\n_全国最低时薪1500日元_\n_图片来源：Twitter/@zenroren_\n\n在最低时薪15美元发源地美国，快餐工人的斗争最多，取得胜利也最多。日本快餐工人也开始行动了，行动者表示：实现体面工作，需要国际联合。\n\n2019年4月15日，在日本涩谷忠犬八公像前聚集了70人，他们的诉求是把全国的最低时薪提高至1500日元。这些抗议者去了麦当劳，也去了汉堡王，他们只想要体面地劳动。\n\n![20190417.6-c](img/japan-fight-for-15-living-wage-aequitas/20190417.6.jpg)\n_全世界无产者，联合起来_\n_mayday2019宣传海报_\n\n> **关于主要口号(第90届五一节)**\n> \n> 反对安倍9条修宪 ，废除战争法！\n> 市民和在野党共同战斗，不允许安倍政权撤退。\n> 制裁自主劳动制度的扩大、高度职业化制度。\n> 确立八小时劳动制度，确立能让人正常生活的工资和劳动规则。\n> 降低贫困和贫富差距。通过大幅度提高工资和底价，使经济复苏使地域活性化。\n> 以实现最低时薪1500日元，实现统一全国最低工资为目标.\n> 中止增税百分之十的消费税。\n> 扩充养老金、医疗、看护等社会保障制度。\n> 反对安倍“再生教育”政策。\n> 支持灾民的生活与职业的复兴。\n> 从零核电向可再生能源转换。\n> 削减军事费，转用于生活、福利、教育、防灾。\n> 停止建立战争国家！\n> 反对边野古新基地建设。\n> 撤回“鱼鹰直升机”的全国配备。\n> 批准核武器禁止条约。\n\n这次集会的组织者“全劳联”（全国工会总联盟）还说今年五一国际劳动节，他们要搞事情。\n\n2019年5月1日，代代木公园等你来。提高最低工资，体面工作。\n\n*   **source：** [https://www.jianjiaobuluo.com/content/106576](https://www.jianjiaobuluo.com/content/106576)\n*   **original source1：**[http://www.zenroren.gr.jp/](http://www.zenroren.gr.jp/)\n*   **original source2：**\n    [https://english.kyodonews.net/news/2017/06/89a61447c2ab-feature-young-people-mount-campaign-to-raise-minimum-wage-end-poverty.html](https://english.kyodonews.net/news/2017/06/89a61447c2ab-feature-young-people-mount-campaign-to-raise-minimum-wage-end-poverty.html)\n*   **original source3：**\n    [https://wagingnonviolence.org/2016/12/japan-fight-for-15-living-wage-aequitas/](https://wagingnonviolence.org/2016/12/japan-fight-for-15-living-wage-aequitas/)\n*   **compiler：**：王小嗨\n*   **Thanks 朋克妇女**"
		},
		{
			"post_id": 29,
			"title": "如果不知道这些，我可能就上了个「假网」",
			"date_published": 1551045659,
			"body": "2016年4月12日，魏则西不治身亡，他的死激起全网愤怒。\n\n2014年4月，魏则西检查出滑膜肉瘤，这种病目前并没有有效疗法，没有治愈的希望。\n\n2014年下半年，魏则西通过百度搜索找到排名领先的北京武警二院，曾4次前往那里进行治疗，花光了家中所有积蓄，还跟亲戚朋友借了不少钱。\n\n---\n\n前后花了20多万，钱花了，却没能阻止肿瘤扩散。\n\n一个青年的死亡，让许多原本隐藏在阴暗处的秘密被放置到阳光之下，闪瞎了许多人的眼。\n\n原来商家花钱就可以提高在搜索结果里的排名，原来三甲医院的科室也能被承包出去，原来「央视报道的好医院」并不是那么好。\n\n## 某度变好了吗？\n\n「魏则西事件」已经过去快三年了，百度变好了吗？\n\n前不久，资深媒体人方可成在《搜索引擎百度已死》一文中批判百度搜索结果中频繁出现「百家号」，而「百家号」中充斥着假新闻和谣言，百度成了「洋葱新闻」集散地。\n\n方可成在文章里无不悲愤地说：「偌大的中文互联网竟已堕落到如此境地，连一个搜索引擎都没有了。」\n\n万万没想到，几天后，面对舆论压力，百度居然把资讯搜索结果界面上的域名给隐藏了。蛤？小样，你以为你穿了个马甲，我就不知道你还是「百家号」？\n\n来到城市打工，我们加班多，工资又少，平时呢我们只好躺在上下铺上玩手机杀时间，好麻醉一下被资本家折磨的苦痛身体。玩游戏，看新闻，找资讯，那肯定少不了。\n\n那么我们应该如何从互联网上获取资讯，又不上当呢？或许我们应先了解一下万维网和浏览器。\n\n## 万维网与浏览器\n\n我们常常说的国际互联网，始于1969年的美国，又称因特网。最开始，它只是一个军方项目，后来才发展为民用项目。目前，因特网是国际上最大的互联网。除了我们熟悉的国际互联网，还有朝鲜的「光明网」。\n\n1989年，英国科学家蒂姆·伯纳斯-李发明了万维网，我们可以把万维网理解为互联网的一个应用。\n\n不论我们用手机还是用电脑来看视频网站、用搜索引擎找信息，都离不开万维网。网页加浏览器，极大改变了现代人的生活，它们也是互联网最基础的服务，我们看微信文章都基于万维网技术。\n\n这么厉害的东西，蒂姆居然没有申请专利，无私地把发明献给了全人类。在2012年伦敦奥运会开幕式上，为了表达敬意，专门设置了「感谢蒂姆」环节。\n\n虽然平时天天刷手机、打电脑，但有些朋友可能还不知道浏览器有哪些？\n\n## 电脑或者手机，一般系统内置浏览器。\n\n常见的 Windows 电脑一般都自带了 IE 或 Microsoft Edge 浏览器，想使用其他浏览器需要用户自行安装。许多网吧里的电脑，又或者比较常见的盗版 Windows 系统，浏览器很多都是360浏览器、QQ浏览器等。我们推荐使用 Firefox（火狐浏览器）或者 Google Chrome（谷歌浏览器）。\n\nAndroid（安卓）手机系统内置浏览器，一般会标注「浏览器」字样，除系统内置浏览器，我们也可以自行下载安装手机浏览器；Apple（苹果公司）的 Mac 或 iPhone 内置浏览器为 Safari ，图标长得有点像指南针。\n\n那么，怎样使用浏览器打开网页呢？\n\n其实很简单，找到浏览器图标，打开浏览器应用，在地址栏上输入网址就可以打开。\n\n在电脑上，地址栏一般都是在浏览器界面顶部的大框，选中后就可以键入网址，回车键按下去，就可以打开。\n\n在手机上，地址栏一般也是屏幕的上部的一个框（上图的「大众定评即将消失」处）。\n\n## 域名与网址\n\n那么网址又是什么鬼？\n\n网址（url），就是在浏览器地址栏输入的一长串字符，比如尖椒部落首页的网址如下。\n\n```\nhttps://www.jianjiaobuluo.com/ \n```\n\n就像我们收快递都有一个地址一样，每个网页也都有一个互联网地址。浏览器就好像哆啦A梦的时光机，你要输入一个地址，它才能带你过去。\n\n说到网址，不得不说一下域名这个概念。\n\n互联网的网页并不是魔法产生，也不是石头蹦出来的，而是程序员通宵熬夜写出来的。它们由一些文件组成，就好像我们手机存储的图片一样，只是网页文件都是存储在远方的电脑上。\n\n为了用户可以通过浏览器访问到它们，每一台远方的主机都有一个独一无二的数字编号，就好像地图上经纬坐标一样。\n\n可数字很难记啊，我连电话号码都背不下，这要怎么办？这时候域名就排上用场了，经纬坐标你记不住，可以记街道和门牌啊。\n\n比如，「尖椒部落」的域名是「jianjiaobuluo.com」，「腾讯」的域名是「qq.com」。\n\n域名前加上传输协议信息及主机类型信息就构成了网址(URL），例如「尖椒部落」的www主机的URL如下。\n\n```\nhttps://www.jianjiaobuluo.com/\n```\n\n## 靠谱信息哪里来？\n\n域名太重要了，它可以帮我们分辨一个网址是正规网址还是诈骗网址。\n\n比如我们手机经常收到各种垃圾短信，里面很多都会说你中奖腾讯大奖了，给你网址，让你输入QQ密码。\n\n如果它给出的领奖网址不是\n\n```\n***.qq.com/***\n（***是代替符号，可长可短）\n```\n\n而是\n\n```\n***.qq.com.***/***\n（***是代替符号，可长可短）\n```\n\n或者根本没有\"qq.com\"字样，那么我们可以断定这是诈骗网站无疑。\n\n因为一个网站的域名一般不会随意变动，所以我们可以根据域名判断一网站的可信度，找到可信来源。而域名的正确与否，也可以透过其他途径佐证。\n\n你知道网址，才能访问网页，就好比快递员知道你的地址才能送货一样。那么，假如我不知道网址，但是想找招聘网站怎么办？\n\n这就需要搜索引擎了，比如Google、yahoo、bing、百度、搜狗、360搜索，等等。\n\n在浏览器地址栏，输入搜索引擎网址，打开网页后，在搜索框内就可以搜索。想找招聘，就在招聘栏键入「招聘」，回车就可以得到结果。\n\n实际上，搜索引擎就是个实时更新的地址簿。只是搜索引擎大都是商业公司开发，受资本控制，它不可能给你完全可靠的结果，我们需要自己学会分辨搜索结果的真伪，特别要注意识别域名。\n\n## 活用移动互联网\n\n随着智能手机越来越便宜，人们花几百块就可以买一部，加之手机上网费用也越来越便宜，移动互联网都有超过传统互联网的势头。\n\n不过万维网的发明人蒂姆·伯纳斯-李警告公众：互联网正在走向割据、封闭、充满中央集权的结构。本来开放互联的网络世界，如今支离破碎。\n\n手机屏幕就那么点，如果拿手指头一个个字母键入一大长串网址，那就很费劲。于是，在传统互联网时代，人们使用浏览器浏览各种网页，而在移动互联网时代，人们主要使用各类APP，比如微信、抖音、淘宝、今日头条，等等。\n\n而这样的移动互联网也成了封建割据的争霸战场，不开放，不互联。\n\nAPP肆意横行的时代，让搜索引擎检索互联网内容更加艰难了，更可恶的是它们还恶意阻止互联互通，完全背离互联网的精神。对于我们普通用户来说，使用体验就更加不友好了。\n\n对于普通用户来说，下载各类APP，应尽量从官方网站下载，或者从靠谱应用商店下载，只有这样，才能避免安了假软件，手机中了病毒。\n\n面对各类APP制造的层层阻隔，我们不仅要主动使用浏览器（支持开放的互联网），分辨真假网址，还要利用各种APP内置的审核机制查看信息源，比如微信就有「主体信息」认证功能。\n\n在微信订阅号中，点击订阅号头像，再点击右上方三个点，最后点击「更多资料」，就可查看订阅号主体信息。\n\n如果一个订阅号声称自己是新华社，又或者是权威机构，那么我们查看一下它的企业认证信息，再用企业查询系统查看一下认证，就可以很容易分辨真假美猴王了。\n\n（还有一个小技巧，在微信中想要看到当前访问页面的域名，可以点击右上角的三个点）\n\n虚假信息泛滥的时代，不管是看新闻看八卦，还是求医看病找工作，都要分辨信息源，请勿搜索引擎直接搜一下就完事，不然被卖了还要给人数钱。\n\n我们应拿回分辨互联网真假信息的权力，一起快乐地冲浪。\n\n* **source：** 尖椒部落\n* **link:** https://www.jianjiaobuluo.com/content/13559"
		},
		{
			"post_id": 28,
			"title": "短效避孕药可以帮你告别月经？别急，先看看能不能吃……",
			"date_published": 1548194098,
			"body": "> 最近，英国国民医疗服务体系（National Health Service，即NHS）旗下的性与繁殖健康委员会（FSRH）更新了他们的指南，认为短效避孕药空七天不吃是没有医学意义的，完全可以一直连续吃下去。换言之，短效避孕药所模拟的月经也是没有必要存在。[1](%E6%9E%9C%E5%A3%B3%EF%BC%9A%E5%A5%B3%E5%90%8C%E8%83%9E%E4%BB%AC%EF%BC%8C%E8%BF%99%E6%AC%A1%E6%88%91%E4%BB%AC%E4%B9%9F%E8%AE%B8%E7%9C%9F%E7%9A%84%E8%83%BD%E5%91%8A%E5%88%AB%E6%9C%88%E7%BB%8F%E4%BA%86%EF%BC%81)\n\n前不久，果壳一篇科普文章《女同胞们，这次我们也许真的能告别月经了！》刷遍朋友圈，许多饱受月经之痛的同志都舒了一口长气，嗯？好像可以告别月经了？\n\n* * *\n\n## FSRH怎么说的？\n\n一般来说，多数牌子的避孕药都是使用两种包装法之一： 每板21片，然后停药一周；每板28片，其中21片避孕药，跟着一周安慰剂例如糖片或是铁质补充剂。[2](%E7%BB%B4%E5%9F%BA%E7%99%BE%E7%A7%91%EF%BC%9A%E5%A4%8D%E5%90%88%E5%8F%A3%E6%9C%8D%E9%81%BF%E5%AD%95%E8%8D%AF)\n\n针对媒体的报道，FSRH发布了一个声明，他们这样说：最新版的FSRH指南仅仅指出，在服用复方避孕药（「短效」）期间，间隔停用7天并没有获得任何健康益处，同时指出，服用复方避孕药存在一些公认的健康风险的。[3]\n\n那么，FSRH的最新声明到底表达了什么意思？\n\n首先，FSRH的指南不是政府法定的意见，也不代表医学界共识。其次，它仅仅把循证临床指导（evidence-based clinical guidance）提供给医护专业人士，也就说是这个指南不是给患者的。最后，指南只是说明服用「短效」没有必要中间停顿7天，可以理解为指南没有说不想要月经的妇女可以使用「短效」终止月经，而且「短效」也存在一些公认的健康风险。（这里补充一下中国专家共识：COC除避孕效果显著外，健康获益也远远大于其可能存在的风险。[4] ）\n\n所以，如果伙伴们想尝试「短效」，最好要去医院咨询医生，做个检查。\n\n## 紧急避孕药不是短效避孕药\n\n这样的话，你可能会问了：短效口服避孕药到底是什么鬼？按照传统医学的说法，「是药三分毒」，「短效」有「毒」吗？短效口服避孕药可以随便吃吗？\n\n短效口服避孕药，顾名思义，它是一种避孕药，也被称为复合口服避孕药。「短效」没有「毒」（抛开剂量谈毒性，都是耍流氓），但服用「短效」可能出现一些副作用，比如：头痛、恶心、呕吐，等等。如出现不良反应，应立即看医生。\n\n目前，常见的女性口服避孕药有三大类：长效避孕药、短效避孕药和紧急避孕药。[5]\n\n长效和短效避孕药，都是由激素构成，只是服用剂量与在体内释放时间不同。长效避孕药，服用一次，可以管很长时间。但服用一次，剂量大，却不能精确控制释放，效果并不理想，加上需在体内存留时间长，一旦出问题，处理起来非常麻烦，目前已不推荐使用。\n\n短效避孕药，避孕效果好，需每天服用一次，不能中断。药物进入人体后，一到两天之内，即可代谢过半。停止服用一定时间后，对继续生育无影响。因为需每天服用，所以缺点很明显——麻烦。与我国较少使用「短效」相比，「短效」在西方是妇女主流避孕方法之一。\n\n紧急避孕药是一种非常规的避孕手段，用于事后补救，对身体伤害非常大。紧急避孕药，除非万不得已，非常不推荐使用。[6] [7]\n\n切记，紧急避孕药不是短效避孕药！\n\n说到这，那么短效避孕药能避孕是什么原理呢？除了避孕，为什么还能终止月经？这要从避孕药的发明说起。\n\n要说女性避孕药的原理，必须先说一点常识。为了孕育胎儿，身体需要事先做好准备，子宫内膜会增厚，同时会排出卵子。如果怀孕并未发生的话，子宫内膜将会崩解，形成经血。\n\n这个过程需要激素调节。在一次月经结束后，下一个周期的卵子还没排出之前，卵巢分泌的雌激素逐渐增多，当雌激素含量达到「顶峰」时，卵子就会被排出。\n\n卵子排出后，卵巢不仅会分泌雌激素，还分泌孕激素。如果这时怀孕发生，孕激素就会告诉身体：我怀孕了，不要继续排卵了。\n\n如果卵子排出后，怀孕并未发生的话，雌激素、孕激素会含量骤降，失去这两种激素支持，子宫内膜就会脱落，形成经血，排出体外。这时，一个新的周期又会开始。[8]\n\n而短效避孕药就是一种雌激素和孕激素的混合物。服入「短效」后，雌激素和孕激素到达一定浓度，就会制造怀孕的假象，卵巢就不会再排卵，子宫内膜也不会脱落，自然就没有月经了。（这其实是理想情况，许多同志表示还是会有经血）\n\n## 你不知道的避孕药发明史\n\n二战结束后，西方经济恢复重建，生活越来越好，孩子也越来越多。可对这广大妇女就不公平了，一方面她们要从事生产，另一方面她们还要负责家务劳动，需要承担生育与照料孩子的重任。[9]\n\n当时，流行的避孕方式是安全套。为了避免承担双重责任（生产与再生产），妇女们似乎能做到的就是督促性伴侣使用安全套，或者干脆坚持不使用安全套就不做爱。\n\n最初，人们研发避孕药，目的并不是避孕，而是治疗不孕。孕激素能抑制卵巢排卵，避孕药就是这玩意和雌激素构成的。约翰·洛克是一名不孕症领域的专家，他觉得抑制排卵后，停止使用孕激素会有反弹效应，会出现排卵，这时就可怀孕了。\n\n后来，节育专家格雷格里·平卡斯加入药物研发，让药物的作用由治疗不孕变成了节育。1957年，这款药物在美国被批准上市，因为保守的观念，这款避孕药被标示为「调整妇女经期」，而副作用的一栏则写着「它会抑制女性排卵」。\n\n这款「调整妇女经期」的药物迅速被妇女拿来用作避孕，成为女性取得身体自主的工具。直到1960年，这款药物在美国才被批准作为避孕药上市。[10]\n\n## 「短效」避孕靠谱，但怎么吃很重要\n\n说完避孕药发明的历史，很多人或许都有疑问，这款由激素构成的药物，有什么副作用？\n\n一听「激素」二字，很多人都会觉得害怕。其实激素并不可怕，可怕的是，不遵循医嘱，滥用激素和抗生素。\n\n要知道，每种激素都有其各自的效能。而目前短效口服避孕药的雌、孕激素含量，对健康是没什么影响的。[11] 短效口服避孕药的禁忌和副作用也很明确，这也是现代医学具有的基本特征，我们可以参考丁香医生写的《可能是关于避孕药最全面的问答》：\n\n> 短效口服避孕药并非适合所有人，下列人群不建议使用：\n> \n> 处于哺乳期；\n> 年龄超过 35 岁并且长期吸烟；\n> 高血压控制状况不好；\n> 有深部静脉血栓或肺栓塞病史；\n> 有缺血性心脏病、脑血管意外史、心脏瓣膜病有并发症等；\n> 有乳腺癌病史；\n> 有糖尿病引起的并发症，如肾病、视网膜病变、神经系统疾病等；\n> 有肝脏疾病；\n> 有原因不明的阴道出血；\n> 有先兆的偏头痛；\n> 正在服用抗真菌、结核或癫痫的药物；\n\n归纳几个重点：服用其他药物期间，服用「短效」需咨询医生；哺乳期，不要服用「短效」；肾脏不好，不要服用「短效」；吸烟，不要服用「短效」；有心血管疾病的朋友，不要服用「短效」；有家族血栓史的朋友，慎用「短效」；有高血压、高血糖的朋友，慎用「短效」；乙肝患者，不推荐服用「短效」。\n\n如长时间服用「短效」后，出现不适症状，尽快看医生，并遵循医嘱。\n\n当然了，「短效」也不是什么灵丹妙药，也是不能随便乱吃的。如果你在服用「短效」前，身体就有不适，应先去看医生，听听医生怎么讲，不要自行用药。\n\n我们知道，看了英国FSRH的指南，许多同志对「短效」都跃跃欲试。虽然短效口服避孕药是非处方药物，我们依然建议在医生指导下服用。但不管怎么说，「短效」对于饱受月经之痛和不便折磨的妇女同志来说，算是提供了一个选项。\n\n可短效口服避孕药，在我国尚未纳入医保。据长期服用「短效」的朋友介绍，128块人民币21片，也算一笔不少的开支了。在一些国家，「短效」有政府补贴，会便宜不少。那我们也不禁发问，我们国家是不是也应该对「短效」进行补贴呢？\n\n另外，男性作为性爱的参与者，有不可推卸的避孕和抚养孩子的责任。可长久以来，避孕和养育的工作都成了妇女的责任。结扎、上环都成了女性的苦痛记忆。不仅如此，很多时候，妇女还要冒着生命危险去堕胎。\n\n目前男性避孕药都没有被开发出来，与「短效」相比，男性输精管结扎术（男性输精管结扎以阻止精子排出，是永久性的避孕方法）更为便捷，一次手术，无需长期服药，不影响性生活。可以复通，但再次怀孕的几率有所下降。[6] 与女性因为避孕所遭受的伤害相比，这个风险也是可以接受的。\n\n最后，「短效」与安全套相比，它并不能降低感染性病的风险。使用「短效」的妇女，往往不再使用安全套，因此增加了性传播疾病的感染几率。比如说感染HPV，就可能患宫颈癌。[4]\n\n而「短效」不能阻断性传播疾病感染，对于非固定性伴侣的人群，或者自己的伴侣有非固定性伴侣，安全套更好。\n\n谨记，安全期、体外等根本不是有效避孕手段，请使用安全有效的避孕措施。\n\n## 注释\n\n[1]  果壳：女同胞们，这次我们也许真的能告别月经了！\n[2]  维基百科：复合口服避孕药\n[3] FSRH press statement: FSRH responds to article by Mail Online about updated guidelines on combined hormonal contraception\n[4] 《中华妇产科杂志》2015年2月第50卷第2期：复方口服避孕药临床应用中国专家共识\n[5] 杜蕾斯官网：]避孕药的种类有哪些?怎么服用\n[6] 丁香医生：避孕问答\n[7] 世界避孕日官网：长效避孕药和短效避孕药哪个好？\n[8] 月经，参考维基百科词条：月经、短效避孕药——最可靠的避孕方式之一\n[9] 澎湃：避孕药通向女性身体自主之路，为什么人们很少选择？\n[10] 《看历史》：唐郑亮，自由与保护，避孕药这五十年\n[11] 田吉顺的知乎：短效避孕药究竟有什么样的副作用？\n\n*   **source：** 尖椒部落\n*   **link:** [https://www.jianjiaobuluo.com/content/13435](https://www.jianjiaobuluo.com/content/13435)"
		},
		{
			"post_id": 27,
			"title": "日结零工手记：三和大神的赤裸生命",
			"date_published": 1541021618,
			"body": "十一假期，我去三和做日结，实地体验大神生活。大神们的生活看起来逍遥快活，可他们还是要定期把自己卖出去。\n\n## 在三和，我差点被打\n\n* * *\n\n![20181101.1-c](img/the-note-of-part-time-worker-in-sanhe/20181101.1.png)\n\n<center>_傍晚七点钟的海新信楼前，本文照片由作者拍摄_</center>\n\n深圳的夏末，天气并不凉快，还是有一点燥热。傍晚七点钟，太阳刚刚沉入地平线，昏暗的灯光洒在海新信楼前，脏兮兮的地面此刻好像抹上一层光晕。人群熙熙攘攘，早间的人才市场现在变成了货物的集散地。\n\n这些货物在别处并不多见，手机号、微信号，各种的廉价二手手机、数据线、充电头，还有一些需要熟人介绍才能做的买卖。人们好像都心照不宣似的，四处张望，偶尔驻足也只是用黑话闲聊几句，躁动不安的氛围弥漫在有点尿骚味的空气里。\n\n「挂逼了。[1]」\n\n「今天做日结了吗？」\n\n「昨晚又输了。」\n\n![20181101.2-c](img/the-note-of-part-time-worker-in-sanhe/20181101.2.png)\n\n<center>_偷拍这个二手衣物摊位，差点被打_</center>\n\n我穿过人群，来到一个二手衣服鞋子的小摊：「老板，衣服怎么卖？」老板大概觉得我不会购买，他漫不经心地敷衍。我从跨兜里掏出手机打算偷拍，不料商贩觉察，他的敷衍瞬间变成愤怒，大声说道：「你拍什么拍，懂不懂规矩，不知道有人拍照被打了吗？」周围的很多人应声：「拍什么拍，记者？是不是日本记者？」\n\n面对涌来的这一大片指责声，我不敢再狡辩，赶紧逃离现场，拐入巷子，心怦怦跳。因为就在几天前，一个人因为拍照被打，手机还被抢，警察都来了，最后拘留了三四个人。在三和，偷拍是一个危险的举动。三和大神只想沉浸在他们的世界中，他们构筑了一堵城墙，严防入侵。\n\n![20181101.3-c](img/the-note-of-part-time-worker-in-sanhe/20181101.3.png)\n\n<center>_征得旅馆老板同意拍摄_</center>\n\n在巷口，有一家旅馆老板经常坐在一个小板凳上，拿着一个牌子招揽租客，我上前搭话：「怎么租？离这远吗？」老板说：「不远。」我答道：「我再看一下。」这时，一个青年拖着行李箱走过来询价问路，「不远，还有一间房。」他们很快达成交易。看样子，这个青年刚到三和，我看着他拖着行李箱和满身疲惫，与旅馆老板一起消失在城中村的小巷。\n\n目送他们消失之后，我一转身，看到有三两青年围着一个露天理发的，8块钱一次。我假装折回去又折回来，这时，我注意到两个人，他们穿着明显和周围人不一样。一问才知道，他们是利用十一假期专程从重庆打飞的来到三和「观光「的。\n\n几位同为外来者的「三和之友」偶然相遇、默契相认，这让我们的对话很快进入一个独特的时空。其中一位微胖的中年人，看起来像一个生意人。他自称，三和的每一处地方，都在网上看过无数次图片，到了三和就像回家一样，一下车就冲到小超市买三和「特产」大水，可惜没买到。三和的物价都在涨，大水已经从2块钱涨价到2.5元。他们两个人转了一圈，才发现原来三和这么小。\n\n像三和这种日结工聚集地，全国并不少见，比如北京的亦庄、广州东区临时工市场，更不必说像农村和乡镇普通存在的临时用工制度。但唯独三和有一种独特魅力，三和大神和他们的簇拥者创制了一套话语体系，用以抵抗这个世界，「日结一天玩三天」，这是他们的生活方式，这里的反抗军由仰慕三和生活的人、被黑厂黑中介伤害过的年轻人、倾家荡产的「赌狗」[2]组成。\n\n我们离开三和，走到三联路，这条路就好像是一个进入异空间的结界，路的一面是剔透橱窗里的各式商品，另一面是按日出售的身体。重庆老哥邀我一起吃饭，我说三和这边都是快餐店，它们还有一个规矩：先付钱再吃饭，以防跑路。走了一段时间，我们终于找一家大排档。大家坐定之后，我开始给他们讲述前几天做日结工的经历。\n\n![20181101.4-c](img/the-note-of-part-time-worker-in-sanhe/20181101.4.png)\n_凌晨四点半，三和外的电动车充电桩，不睡觉的人一边给手机充电一边玩_\n\n## 工友带我到工地做日结\n\n自从知道了三和这个神奇的地方，我就心生向往，独自一人或陪远方朋友到三和观光，每次都感觉像回家了。我想去三和做日结的想法由来已久，想实践一下「日结一天玩三天」。三和工友对我说：「我们看似自由了，你不知道我们的苦。」几天不吃饭，又或者找不到日结，这都很平常，自由需要付出代价。\n\n![20181101.5-c](img/the-note-of-part-time-worker-in-sanhe/20181101.5.png)\n_许多工友在日租房里打牌，我问我朋友：「你怎么不玩？」他说：「玩这个，我还不如玩博彩网站呢。」_\n\n十一假期还未开始，我就开始筹划到三和做零工，联系了工友帮忙带路。这位工友在三和已快三年，之前做过流水线工人，还做过修车师傅，他说，如果他继续在车行做，也许现在工资还挺高的。他目前住在离三和比较远的一个床位，走路差不多要半个小时，虽然远，但便宜，每日只需10元。平日里，他就蜷缩在宿舍的小床上用手机看剧玩游戏，有时为了振奋精神，也会玩玩境外的博彩网站。\n\n工友约我早上五点去三和抢日结，有人带路，让我心安了一点点。我一夜未睡，有点兴奋，也有点忐忑。三点半，我就开始洗漱，收拾了一下，大概4点多吧，我带了充电宝就出发了。从我的出租屋到三和，走路大概需要半个小时。在路灯下，还有很多尚未入睡的人：摩的师傅、零落坐在路边玩手机的人、刚从酒吧出来喝得烂醉的人……这是一个日光之下，我们不曾看到过的深圳。\n\n![20181101.6-c](img/the-note-of-part-time-worker-in-sanhe/20181101.6.png)\n<center>凌晨4：30，在海新信楼前休息的人们</center>\n\n凌晨四点半，我就已抵达三和，给工友发了信息：「我到了。」这里我早已熟门熟路，我信步走到「海信大酒店」[3]楼前，有人躺在硬纸板上睡觉，有人坐在台阶上玩手机，又或者低头闭目，好像思考着什么。放眼望去，也没发现有人招日结工，一时间，我不知道该做些什么，只好在台阶上坐了一会。\n\n我在犹豫要不要去和那几个正在喝酒工友搭讪，思量了一会，我还是走了过去。他们应该已经喝了一夜，地上散落着几个啤酒瓶，酒快喝完了，有一个老哥好像酒意还是很浓。「我不在乎，开心就好。」说完，他从钱包里拿出一百块钱递给一人，「拿着，再去买酒」。这个人抬起屁股拿着钱就离开了，再也没回来，酒最终也没买回来。\n\n![20181101.7-c](img/the-note-of-part-time-worker-in-sanhe/20181101.7.png)\n<center>喝酒抽烟吃槟榔到天亮，法力无边</center>\n\n这时，一个满口酒气的人走过来，他衣服也是脏兮兮的，醉得说话都有点不利索了：「还喝呢？」「我就是高兴，槟榔吃完了，我们这交情没得说吧，你给买包槟榔，十块钱那种，我今天高兴。」他们俩你一句我一句，来回不知道多少回合了。醉酒的人终于去了小超市，没几分钟就回来，又是打太极。最终，还是那人从钱包拿出钱：「去买，去买，今天过节，我高兴。」\n\n另一个工友告诉我，几天之前，他身上还有好几千块钱，昨天一夜就输光了，挂逼了。他打算再去网吧捞回来，实在不行只能进厂了，想在年前把回家车费挣出来。大概已经五点多了，天都蒙蒙亮了，工友回我微信：「十分钟就到。」不远处，楼前已经聚集了一批人，他们三五成群，围在一起讨论着什么。\n\n![20181101.8-c](img/the-note-of-part-time-worker-in-sanhe/20181101.8.png)\n<center>工友三五成群地在聚集</center>\n\n有一个工友睡眼惺忪，抱怨地说道：「人家放假休息，我们五点就要在这抢日结。」城市居民酣沉睡乡的时候，三和大神就开始孤寂地思量着，今天怎么把自己卖出去，能卖个什么价钱，他们是四五点钟晨光的见证者。有一个人骑在共享单车上说：「昨天有个中介过来招工，8个钟工价100，这不找打吗？别人都是120。」旁边立马有工友大叫：「他不知道在三和，这是严重扰乱市场秩序，打死他。」\n\n不少工友都说这两天是十一假期，很多厂都放假了，有些屌毛[4]就出来打零工，直接导致工价下跌严重，前几天还是150、160，现在找工也很难。那会150、160工价的时候，中介招人，大家还都不想做。现在倒好，工价低了，还找不到工了。\n\n要知道，台风天过后，工价都到了350、360。说到这，工友的眼睛里有光，那光来自好工价。深圳台风天过后，那些吹断的树枝、散落各处的垃圾，几天内就神秘消失，原来这是三和大神的魔法。\n\n![20181101.9-c](img/the-note-of-part-time-worker-in-sanhe/20181101.9.jpg)\n<center>大批工友拥簇着中介</center>\n\n人越聚越多，我约的工友还没来，我有些烦躁。这时有人喊：「这边有日结。」大家纷纷挤过去，原来是谎报军情，马上都快六点了，还没招工的，大家都有点急躁。「散了，散了，大家回去吧，假期没活。」有人抬起手表，看了看时间，「散了，散了，大家去嫖娼吧，趁会所还没下班。」可他自己根本没有走的意向，还在等工。\n\n另一个瘦瘦的背双肩包的年轻人在给周围人发烟。有人问他：「你去澳门没修车[5]？没赌？」他说：「我这次就是过去旅游的。」他从背包里掏出一个纸板：招工。「什么工？几个钟？多少钱？」「8个钟，120，今晚去搭台子，现在报名。」旁边有人骂咧咧地说：「今晚的工，你现在招什么人？」很快，大家就散了，这个年轻人大概是刚从日结工转做中介。\n\n![20181101.10-c](img/the-note-of-part-time-worker-in-sanhe/20181101.10.jpg)\n<center>有的人在看手机，有的人在吃早饭</center>\n\n很快就要六点了，说是十分钟就到的工友，现在终于到了。他理发了，平头，看起来比之前精神了许多，我问了他一些近况。「就那样，最近没做日结，看电视剧，要不是你要来，我肯定不来。」\n\n我们商量：到现在都没找到日结的活，是不是该回去了。可一转眼的功夫，已经有好几波日结工作结束招工了，很多人都上车走了。工友看着被中介带走的几个人说：「怎么连工地都抢，你身份证带了吗？我们去看看挂逼保安。」\n\n挂逼保安需要交身份证，作为报名的抵押物。我可不想把身份证交上去，按照宋总[6]的说法，你身份证交上去，你知道他会拿来做什么？撸小贷，担保，做法人，可能危言耸听吧，但想想还有些担忧，反正我不交身份证。我们说话这会，那些去做挂逼保安的已经在台阶上换衣服了。工友说：「现在这复印的也没开门啊，我们还是去工地吧。」\n\n![20181101.11-c](img/the-note-of-part-time-worker-in-sanhe/20181101.11.jpg)\n<center>挤车的情形</center>\n\n看来今天挂逼保安无望了，我们移步到外围的停车处，可能因为有中介大客车的遮掩，这里更方便尿尿，所以尿骚味也更浓烈。去工地不需要交身份证，只要能挤上车就可以。我们问了下价格，120，8个钟。我们努力试图挤上看见的第一辆面包车，结果硬是没挤上去。\n\n没几分钟，又一辆面包车开过来。这次，我们小心翼翼。车开始驶入停车处，我们盯着车门，周围挤满了人，各个都望眼欲穿。车动，人也动。我们俩紧随车门移动，可就这样，还是被挤在门外。好不容易，工友先挤上车，我紧随其后终于挤上去了。我上车之后，只能猫着腰，想站，站不起来，想坐，更别想了，动都困难。车里都挤成这样了，我以为我应该是最后一个了，万万没想到，又挤上来一个。\n\n![20181101.12-c](img/the-note-of-part-time-worker-in-sanhe/20181101.12.jpg)\n<center>抵达目的地后陆续下车</center>\n\n这辆荷载8-9人的面包车，生生塞进来18个人。我一路保持着上车时猫着腰的姿态，呼吸着长时间没洗澡散发出的汗臭味。时间彷佛凝固了，一路几乎无人说话。彷佛经过刚刚那场惊心动魄的「抢车位」，大家都累了，应该都在暗暗庆幸自己挤上来了吧。一个住在三和附近的朋友这样说：「有时候，早上经过三和，就看到这些人一车一车地被拉走，像拉小猪一样。」可她并不知道，想做被拉走的猪，需要多努力。\n\n大概过了半多小时，六点四十左右，车停了，到了南山区的一个创新园工地。下车后，大家站在路边等消息。大部分都沉默不语，有人抽烟，有人亚洲蹲。一个老哥跟我搭讪：「你做什么的？记者？你这穿着发型也不像三和的人。」「我过来做日结的，你呢？」「我博彩输了，跑路到三和，身上几千块钱就花完了，我手机都当了。」说完他拿出一个典当铺的收据，上面写着：iPhone X。\n\n![20181101.13-c](img/the-note-of-part-time-worker-in-sanhe/20181101.13.jpg)\n<center>站在路边等在中介安排工作</center>\n\n我们一伙人就被晾在路边二十多分钟，到了七点多，中介终于让我们进了工地。他先带我们进了一个堆满安全帽、皮靴和马甲的铁皮屋，招呼我们自己换衣服。有人经验比较丰富，很快抢到稍微干净一点的衣服、帽子和皮靴。我和工友看没有合适的皮靴，就没换鞋，而且那些鞋子也是配不成对，还有味道。安全帽和衣服，我摸了一把，感觉满手是油，没办法，只得换上。\n\n![20181101.14-c](img/the-note-of-part-time-worker-in-sanhe/20181101.14.jpg)\n<center>报数等待拍照</center>\n\n换好「工装」，中介开始招呼我们排成两排拍照，前后对齐，开始报数。报数就是数人头，照片当作做工的证据，用以下午收工之后结工资。完成这个必要的仪式后，我们开始去工地。我们几个人的活很简单，是搬钢管，就是把钢管从一头搬到另一头，也有人被分配给脚手架上油，总之，这些活机械又无需技术。在我们旁边，有一些正式工正在铺路打水泥。有工友议论说：「今天活很轻松啊，你看连那些人也还不是在那磨洋工。」\n\n工友昨晚睡很晚，我直接没睡，我都感觉眼皮在打架，两个人无精打采地搬着钢管，随着大队伍一趟又一趟，好像永无止境。工友对我说：「这破活好脏，我们走吧，你还想做吗？你看我鞋子，这么快就脏，这样下去，坏了鞋子还不合算。」我好言相劝，坚持下吧，来都来了，下午拿到工钱再走吧。其他人对这个工作看起来也没什么兴致，只是跟着队伍麻木地重复。\n\n![20181101.15-c](img/the-note-of-part-time-worker-in-sanhe/20181101.15.jpg)\n<center>这是需要我们搬运的钢管</center>\n\n## 讨工钱和「误工费」\n\n万万没料到，这时中介在上面开始叫唤，他好像也是工头。「想不想干了，他妈的像快死了似的，不想干，赶紧滚，有的是人。」之前已经有个工友提醒我们：活已经很轻松了，假装也要装得像些，一次搬两根钢管。此后，我们也都是一次搬两根钢管，跟着队伍一趟又一趟。大概因为我们俩无精打采，这个黑中介喊住我和工友：「你们两个别干了，他妈的跟快死了似的，走，走，赶快走。」\n\n我求饶：「我们没偷懒啊，让我们继续做吧。」黑中介不许，坚持让我们俩走人，工友倒是有点高兴：「给我们工钱，我们就走。」我们俩上去，就跟着黑中介回到了那个铁皮屋的大门处。一路上，他骂骂咧咧，我说：「你能不骂娘吗？有没有素质？」他闭嘴了。我们回到铁皮屋，脱了衣服，放下安全帽，跟这个黑中介要钱。他说：「你们干活了吗？还要钱。」我伸出脏脏的手，指给他看我们的衣服和鞋子：「我们又没偷懒，你看我们的手和衣服。」\n\n现在快八点半了，我们至少做了一个半小时，得给我们一个半小时的工钱。「走，走。」黑中介赶我们俩走，我们有点懵，不是说好给工钱吗？我们坚持要钱，他却说我还没问你们要过来的车费呢。「我们没回去路费。」「那我给你们公交车费。」「你要多少？」我开始拿出手机算一个半小时的工钱：「二十八块钱。」黑中介在我掏手机的时候，已经扭头走了。\n\n![20181101.16-c](img/the-note-of-part-time-worker-in-sanhe/20181101.16.jpg)\n<center>给脚手架涂油的工友</center>\n\n我对着他的背影，开始要挟说要报警。他扭过头说：「你报警啊。」就离开了。这时，门口的保安大叔让我们出去，到门外去。我说：「大叔，我们一早过来，干到现在，让我们走，不给工钱。大家都是打工的，体谅一下。」大叔听到我这样说，就不再赶我们，还帮我们出主意。他说，这些中介和公司一点关系都没有，就招人过来干活的。\n\n我和工友都开始报警，这是我人生第一次报警。电话通了后，我说我们被中介骗了，打零工，突然让走，不给工钱。对方说这是经济纠纷，不能出警，要找劳动部门。打了劳动热线，我们两个人花了十几分钟也没找到人工服务。无奈之下，我们又拨回公安那里，告诉他们劳动部门那边拨不通，对方建议打市长热线。市长热线建议我们找街道，街道说假期就他自己值班，让我们找社区。找来找去，都找不到人帮我们讨回工钱。\n\n就这样，我们耗费了一个多小时。黑中介回来了，我在打电话，不知他和我的工友起了什么争执，他突然大声叫嚣：「信不信找人过来打你们。」我当时有点绝望了，工友还是不示弱：「来啊。」后来又僵持了一会，中介大概觉得我们两也不是什么善茬，没必要再纠缠，而且就这么几十块钱，最后还是把我们的工钱给了我们。我们拿到五十六块钱，每人二十八元。出了工地，我和工友合计了一下，才拿了这么点钱，就不坐地铁了，还是坐公交回三和吧。地铁要五块钱，公交两块，我们舍不得坐地铁。\n\n![20181101.17-c](img/the-note-of-part-time-worker-in-sanhe/20181101.17.jpg)\n<center>公交上，我的沾满尘土的「女权主义者长这样」包包</center>\n\n在公交车上，我想起工友的话：「自由需要付出代价。」三和大神从商品构造的生活中逃离出来，他们逃离了我们习以为常的生活：上班、买房、结婚生娃。正是因为逃离了这种物质仪式，他们才得以重新审视这种生活，去想象一种自由的生活。就像在一个商品世界中漫步的游手好闲者，他们暂时摆脱作为一件商品的悲剧。可为了换取这点自由，他们又不得不间歇性去把自己完全售出，成为受黑中介任意宰割的商品，成为一个赤裸生命。\n\n回到三和，我已经开始尿急。工友把我带到一家网吧，方便完，我终于舒了一口气，这时才体会到「基地」[7]两字的意义。我问工友最近有看到宋总吗。他径直把我带到三和附近得公园，宋总正惬意地躺在石阶上闭目聊天。看到我们俩过来，他坐了起来。听说我们被黑中介开除才拿到二十八块钱，他说：「你们被坑了，不知道在三和有误工费这个说法吗？」\n\n原来三和有这样的规矩：如果中介无故把人开除，至少要给一百块钱的误工费，我就指着日结吃饭，你把我搞过来，我今天还怎么找日结？就得给误工费。怎么听着像童话呢？还有这好事？前久，宋总他们二十多人做挂逼保安，到了现场发现还要捡树枝，中介还不想加钱。没人肯做。他们二十几号人，浩浩荡荡一大群直接去派出所。副所长直接慌了，最后中介给他们每人二百二十块钱，而且还不用干活。\n\n![20181101.18-c](img/the-note-of-part-time-worker-in-sanhe/20181101.18.jpg)\n_凌晨，三和有售两元一份炒饭，在三和生活成本相对较低_\n\n中午，我们在湖南菜馆吃饭，点了三个菜：俩肉菜、一个青椒炒蛋，都很好吃，每人还喝了一瓶多啤酒，才花了不到四十块钱。吃完饭，我托宋总跟我一起买ID。假的四十，真的二百二十。宋总跟老板说：「这不是明天去做挂逼保安嘛，需要个证应付一下，假的能不能便宜些？」最后，我花了30块钱买了张假ID。我们三人约定，明天一起做挂逼保安。\n\n## 我的挂逼保安经历\n\n![20181101.19-c](img/the-note-of-part-time-worker-in-sanhe/20181101.19.jpg)\n<center>工友们在抢日结保安</center>\n\n回到出租屋，洗了澡，定好闹铃，我倒头就睡。第二天醒来，已经是10月3日的四点钟了，我赶紧洗漱完，赶到三和，已经快五点了。这时的三和，已经人头攒动。左等右等，不见他们两人过来。我怀揣买来的证，四处张望。\n\n我听到有工友议论说：「十一假期就三天，今天是最后一天，肯定还没日结，大家散了吧。」说归说，没人肯放弃。我看到昨天那个背包的中介还在招工，还是搭舞台，还是晚上。可现在还是凌晨，人群又是一哄而散。他告诉我，现在报名不收身份证，晚上收身份证，上车就还给你，绝不扣留。\n\n已经六点多了，我原本打算报名晚上去搭舞台。可不远处突然聚集了一群人，「保安，保安，15个钟220。」我一听，赶紧凑过去，支支吾吾问：「别人的证可以吗？」中介好像没听清，看了我一眼：「去不去？」我赶紧把证递上去，交了证算报了名。「必须穿黑鞋，不是黑鞋的不要。」一大伙人跟着中介走了十多分钟，到了一个居民楼，换保安制服。衣服自己挑，很难找到合适码，味道都很重，穿在身上很远都可以闻到。\n\n换好衣服，我们排成两队，跟着中介走到了龙华站。坐了一个多小时的地铁，抵达目的站。折腾了一早上，大家都有点累了。我们先是席地而坐等待，没过多久，中介带人过来分配任务，我和其中一个工友被分到不远处的站点。\n\n![20181101.20-c](img/the-note-of-part-time-worker-in-sanhe/20181101.20.jpg)\n<center>换装完毕的三和大神，在龙华地铁站</center>\n\n我们到站一下车，班长正在执勤，他一下就认出我们：「你们是过来支援的临时工吧？」他带我们到了地铁站点里的一扇隐蔽的小门，原来地铁站里还隐藏一个如此大的空间，那里有地铁保安的休息室。队长给我们换了袖章和工作牌，让我们瞬间变身为地铁保安。队长交代了一些注意事项，特别叮咛不要把工作证写着姓名的那面露在外面。\n\n我的工作内容很简单：平时正常站着，车来了，我转向车来的方向；车快停住时，我要面对车；车停住，我背对车；车走，我转向车走的方向；车离开，我再转回来。周而复始，站一个小时，可以休息半个小时，午间吃饭也是半个小时。班长还交代了如果列车出了故障怎么办，我也没太听明白。\n\n上午的时候，有乘客问路，我用手机帮忙查站。不久之后，队长就过来了，看了看我，说：「不能玩手机，被抓到，我要被罚款的。我不知道你们能拿到多少钱，我们八个小时给了150块钱，不低了，临时工正式工都一样。」我算了一下，我工作八个小时，其实只能拿到不到120，中介赚了30。\n\n![20181101.21-c](img/the-note-of-part-time-worker-in-sanhe/20181101.21.jpg)\n<center>做工后，瘫坐在地上的大神们</center>\n\n终于熬过七个半小时，下午3点半我和工友就离开了。回到中介那个地铁站，还多工友都没回来。原来只有少数人偷了时间，大部分人还是老老实实做完了八个钟。「挂逼保安也不容易，我做安检，一个个地查，太累了，上个厕所都被说。」大家席地坐着分享着一天经历，有人打听到：原来地铁保安的工资还不如日结的工资，而且还要起早贪黑，工作时间更久，难怪招不到人。\n\n这时，中介喊我出来，他说领导说我头发太长，实在不能做了。我领了125块钱，离开了。工作8个钟的报酬加上路费，才125块钱，我从早上五点折腾到下午三点半，何止8个钟。我有点庆幸可以提前离开，因为实在想不出这个地铁保安有什么意义？原来执行暴力机器功能的载体，都是那些游手好闲的三和大神。\n\n在三和，最好的工作就是去做维稳的保安，什么也不用做，玩玩手机，装装样子就可以。作为商品的三和大神，在此处成了被展示在橱窗中的暴力。国家机器只需要展示出必要的仪式，就可以完成它的功能。我因头发长，成为有瑕疵的商品，被退货了。\n\n##赤裸生命的自由\n\n酒过三巡，大家都喝了不少，我的故事也差不多结束了。胖哥说：「三和，最吸引人的地方就是自由。」这时，刚刚进来的两位老哥表示不同意，他们在三和做一些地下生意。他们说三和是一个让人堕落的生意场，银行四件套、撸小贷、遍地赌狗……你可以发财，也可能就此沉沦。听完这些，胖哥说，有人的地方就有江湖。之于我，这也算祛魅了吧。\n\n![20181101.22-c](img/the-note-of-part-time-worker-in-sanhe/20181101.22.jpg)\n_半夜在网吧赌博的人，第二天早上九点半他们还在玩_\n\n酒足饭饱之后，我意犹未尽，想再去三和走走。胖哥说已经很累了，相约明天再逛。我和那两位三和老江湖一起走到三和，那里的货物市场此刻依然热闹，转过一圈，其中一位带我去了一个隐秘的网吧，那里大部分上网的人都做玩网络博彩和赌博，「这才是三和。」\n\n从网吧出来，已经凌晨两点了，我走在空旷的路上，回想这两天的经历，突然一阵巨大的虚无感袭来，我问自己：三和之于我们到底有着怎样的意义？\n\n三和大神，他们的生活简单，甚至在我们看来过得异常艰辛。他们游手好闲，他们是这个时代里被剩余的人。他们发现这个时代的秘密：卖出去的时间就不再属于我们。他们想要自由，所以他们尽可能少地出售自己。因为如此，他们可能是这个时代仅剩的自由民。\n\n另一方面，虽然三和大神们从市场上暂时分离出来，却无可避免地一次又一次沦为商品。他们享有一种自由，但这却是一种随时会沦为赤裸生命的自由。赤裸生命，任人宰割。这便是想要摆脱作为一件商品的命运，所必须付出的代价。\n\n## 注释\n\n[1]: 三和的日结零工不再进厂打工，靠日结度日。日结并非每天都有，当连日结都没得做、饭也没得吃之时，大神们称这种状态为「挂逼」。 由此，还延伸出「挂逼面」、「挂逼床位」、「挂逼保安」等等说法。\n[2]: 有句话：「赌徒可能上岸，赌狗绝对不会上岸。」因为赌徒有节制，赌狗无节制，赌狗赌博直至倾家荡产，借钱借到借无可借，最后只能跑路。\n[3]: 海新信人力资源市场，因有很多大神睡在海信楼前，大神们亲切地称其为「海信大酒店」。\n[4]: 在三和，谈话时指代第三人均用「屌毛」代指。彼此都不愿意透露自己的名字。有时表达不友善的意思时，也会用「屌毛」称呼对方。\n[5]: 修车：性交易。\n[6]: 宋春江，NHK三和纪录片的受访者之一，因去「做法人」，名下有三家五百万的企业，人称：「宋总」。\n[7]: 在网络上，三和大神之友一般会称三和为「基地」。\n\n*   **source：** 尖椒部落\n*   **link:** [https://www.jianjiaobuluo.com/content/12982](https://www.jianjiaobuluo.com/content/12982)"
		},
		{
			"post_id": 26,
			"title": "盘点多种「女性贫困」，看看为什么你越来越穷",
			"date_published": 1540589234,
			"body": "改革开放以来，中国经济取得了长足发展，已经成为世界第二大经济体，但仍有近全世界十分之一的赤贫人口生活在中国。\n\n看似远离贫困的我们生活一个消费主义全面胜利的时代，快速迭代的数码产品，随时即到的外卖，还有各种购物狂欢节，消费编织起我们的日常生活。玲琅满目的商品、各类消费信贷……让我们无暇思考自身和周遭世界。消费不仅遮蔽了我们青年自身的贫困，更掩盖了妇女作为贫困主体的事实。\n\n* * *\n\n1980年联合国哥本哈根大会指出，虽然全球2/3-3/4的劳动量由妇女承担，45%的食物是由妇女生产，但妇女仅获得全世界收入的 10%。1995年联合国《人类发展报告》指出，世界上的贫困人口中70%是妇女，贫困具有一张女性面孔。[1]在中国，贫困人口中超过50%是妇女。[2]\n\n普遍存在的就业歧视、根深蒂固的传统观念（男主外女主内）、不友好的教育机会等等结构性不平等，这些都是造成妇女贫困的原因。被遗忘的下岗女工，打零工的「留守妇女」，「自愿加班」的移民女工，朋友圈中做微商的妈妈们，通宵达旦直播的网红……她们构成了我们的时代。\n\n## 被遗忘的下岗女工\n\n2007年，南方周末曾报导一位中国下岗女工刘春兰在法国死亡的事件。\n\n> 1995年，刘春兰从抚顺市服装二厂下岗了。她是最早感受到市场经济残酷的那一批人，而服装和纺织业则是这个城市里最早经受市场经济考验的行业。刘春兰好强、有主见，也曾有过自己的荣誉：连续几年被评为这家企业的「技术革新能手」。\n> \n> 自谋出路的刘春兰第一次体会到社会竞争的残酷。四十多岁几乎是一个毫无竞争力的年纪，她替缝纫店做过针线活，一个月能挣四五百块钱，随着年龄的增长，视力下降，只能干类似护理老人、饭店洗碗的工作，收入日减，最少的时候只有一百多块。\n> \n> .....\n> \n> 3年前，刘春兰穿着从二姐那儿借来的鞋子踏上了去巴黎的旅程。3年后，刘春兰「穿」着三姐带去法国的鞋子回到家乡。她的家人说，在这3年里，刘春兰没有一双属于自己的鞋子。[3]\n\n「我只知道她刚出来那会儿做过一段时间的保姆，替别人看孩子。做了一年多，检查出来身上有糖尿病，后来边打工，边看病，今年年初时又打电话说，她挺长时间没有找工作了，身体没力气。」 刘春兰还是坚持了下来，尽管因为害怕被遣返而时时生活在恐惧当中。最终，她留下的只是困窘艰难的身后事。\n\n刘春兰因为死在法国而被报导，事实上大部分下岗女工都面临同样的困境。我曾经在成都听过国企下岗工人说过太多因下岗而家破人亡的故事：家里男人女人都下岗了，男人身体不好治病要花很多钱，女人想撑起一个家，到了洗浴中心工作。男人发现后就做了一桌子好饭，那天之后一家人全都死了。\n\n> 我真的不是好吃懒做，要赖吃低保，找工作难啊！我们就像没人要的孩子，被人推来推去。下岗这几年我也试过十多次，招工单位不是嫌你没技术，就是嫌你没文化；不是嫌你「老」，就是嫌你丑，怎么瞧都不顺眼。有的答应了，却又要交这个费那个费，最后折腾下来，还是被人踢了回来。 [4]\n\n1990年代，国家经济体制转型，大批女工被迫离开企业，走向市场。大多数下岗女工年龄在31-50岁之间，她们很难重新学习新技能，在劳动力市场中处于劣势。\n\n她们在走向市场后，又没有得到有效的就业帮助，其中很多人依靠做家政工、清洁工等低技术含量的工作过活，又或者做一些小本生意，在天塌下来之后，独自撑起一个家。\n\n她们承受了改革带来的剧痛，成了社会的边缘人，熬过了辛苦的柴米油盐，就此消失在历史。\n\n## 打零工的「留守妇女」\n\n由于迟迟未能解决移民工人子弟入学问题，很多适龄儿童被迫返回老家读书，加上移民工人的父辈几乎都没有养老金，按照「男主外女主内」这样的传统观念，妇女被迫回到家乡照顾老人和小孩。根据调查数据推算，全部「留守妇女」的总量约3670万人。[5]\n\n在百度键入「留守妇女」关键字，会发现「留守妇女」被塑造成供男人捕猎的「猎物」，成为人们猎奇的对象。「心里空荡荡的」、「感觉没人说话挺孤单」，这是很多「留守妇女」的内心独白。「留守妇女」一人就负担了负担家庭的重任，但她们的真实境遇很少有人关心。\n\n丈夫外出打工，她们不仅需要照顾老人和小孩，还需要做农活，很多妇女都表示农活负担很重。「男外出、女留守」的人口流动和夫妻分工模式加重了妇女的生活负担，她们往往比在城市打工的妇女承担了更多劳务。\n\n如此庞大的劳动力人口，用工短缺的工厂自然需要，加上有政策扶持，很多家庭加工厂在农村开始出现。\n\n> 近年来，阜平县针对农村留守妇女劳动力大量闲置实际，把发展新型家庭手工业作为农民增收致富的重要举措，出台多项优惠政策，全力推进农村家庭手工业发展壮大。截至目前，已有 186个行政村建起了涉及服装、玩具、箱包、编织袋加工等20个行业的10人以上加工厂396家，吸纳从业人员 2.6万名，人均年收入达1.8万元。 [6]\n\n> 「我在服装厂打工，每月挣3000块钱，日常花销足够用了。」说起县扶贫办扶持的童装加工厂，河北省顺平县苏辛庄村贫困户魏惠芳紧皱的眉头舒展开了。\n> \n> 在顺平县，尝到家庭手工业扶贫甜头的不光魏惠芳一家。今年48岁的张秀梅是蒲上镇贫困群众，女儿上大学，儿子读中专。两口子没本钱、没技术，过去靠打零工维持家用，日子紧巴巴的。后来村里建起布鞋厂，她就近来上班，很快成为熟练工，每月固定收入2000多元。 [7]\n\n河北农村的留守农民进入了家庭加工厂，而广东沿海农村的妇女则进入了海鲜厂剥虾，虽然工作内容不一样，但本质都一样，都是单价低廉的计件工。\n\n> 在湛江海鲜厂剥虾的女工，年纪大多数在30岁以上，她们都是「留守妇女」，她们从早到晚承受着高强度的劳动，忍受阴冷潮湿的环境，熟练工可以每天100多块钱的工资，也有不少每天80多块钱，每月工资2000-3000元。没有休息，也没有保障，生病工伤就自己倒霉。可能是因为单价更低的缘故，即使同样是计件制，这里的工人也比流水线上还要卖力得多。[8]\n\n月入2000多元，城市工厂工人不加班拿到的也比这些多，工厂还不用解决住宿问题。不知道2000多块钱如何解决贫困问题，大概可以解决温饱吧，只是「留守妇女」又多了一项生活重任。即使家务劳动已经很辛苦了，也没人关心她们在工厂里的工作时长是否超过8小时，是否有劳动保障。\n\n## 「自愿加班」的移民女工\n\n> 按照深圳最新发布的《人力资源社会保障部关于进一步做好最低工资标准调整工作的通知》要求，自2017年6月1日起，全日制就业劳动者最低工资标准为2130元/月，非全日制就业劳动者小时最低工资标准为19.5元/小时。\n\n2130元的工资，大概只有活得像「三和大神」一样才能在深圳存活。实际上，很多厂都按照基本工资发放工资，如果想拿更多钱，就必须「自愿加班」，这已是公开的秘密。\n\n2015年，中华全国总工会点名批评富士康等一些企业长期违法安排劳动者长时间加班，致使部分劳动者出现各种心理健康问题，过劳死或自杀现象时有发生。[9]\n\n据南方都市报报道，惠州7名鞋厂女工为加班嗑药提神，最小仅19岁。惠东多名鞋业人士称，惠东有不少鞋厂年轻男女为应对加班，会购买一些止咳水来「提神」。[10]\n\n在很多地方，电子厂中普工往往女工居多，她们也很难晋升到管理岗，而工资更高的技工岗招聘也有性别限制。可能仅仅为了拥有自己生产的数码产品，也可能为了工作之外参加学习班的费用，为了交足上涨的房租，总之，为了所向往的美好生活，不至陷入赤贫，她们不能不忍受加班的苦痛。\n\n## 灵活就业的妇女\n\n女性往往在择业上遭遇歧视，晋升也很困难，对于很多女工来说，怀孕则意味着失业。越来越多的女性选择自主灵活就业，比如开淘宝店、做在线兼职客服、网络直播、微商等等。那么她们真的发家致富了吗？\n\n> 「结婚以后，没有一个工作适合我，照顾不了孩子，照顾不了家庭。有了微商，满足了我的所有需求，时间自由，人身自由，付出就有回报，多劳多得。」 ——微商网 《黄丽群：我加入微商传媒的8大理由》\n\n我们平时刷朋友圈会发现，很多微商都是全职妈妈。失去经济独立的全职妈妈，很容易因焦虑被「赚钱」的微商吸引。灵活的工作时间、便利的营销方式（朋友圈）以及赚钱的机会，是吸引这些全职妈妈入行微商的首要原因。\n\n微商的利润一般比较少，报告统计说，目前从事微商的人群70.25%月销售额在1000以内，而月盈利1000元以内的占比有76.99%，说明绝大部分人做微商赚钱很少。[11]而且在朋友圈发广告容易得罪朋友，做微商还有加入传销被骗的危险。\n\n据今日网红报道，中国直播产值110亿美元，很多网络主播都是女性，淘宝达人直播男女比例1:24。她们平均每天直播的时间超过15个小时，超负荷工作是常态。如此辛苦，往往付出和回报不成正比，其中45%的主播月收入在5000元以下。 [v12]\n\n我们可以看到，这些灵活就业并没有提高多少收入，很多时候更像是女性无奈的就业选择。\n\n## 团结一致，摧毁贫困\n\n很显然，因为性别遭受不公待遇，妇女更容易陷入赤贫生活。\n\n我们所有人都分享了这些苦痛和抗争——下岗女工、「留守妇女」、移民女工，还有所有那些只差一步之遥就陷入赤贫的人们，我们分享着同样的命运。\n\n许多扶贫措施，虽然能减少赤贫的情况，却不能根除贫困。因为劳动者只能出卖劳动力为生，一旦失业或者遭受意外，很容易陷入赤贫。为了摧毁贫困，我们需要改变这个状况。\n\n为了摧毁贫困，我们需要为非正规就业妇女提供健全的保障；为了摧毁贫困，不应按传统观念把妇女视为「主内」的家庭「保姆」，她们付出了太多无薪劳动；为了摧毁贫困，不应按照性别对职业加以限定，更不应限制女性的职场发展。\n\n*   **source：** 尖椒部落\n*   **link:** [https://www.jianjiaobuluo.com/content/12908](https://www.jianjiaobuluo.com/content/12908)\n\n## 注释\n\n[1]: 中国妇女报，闫坤：我国女性贫困特征及致贫原因——精准扶贫应引入性别因素 [http://www.china-woman.com/wf/2017-01/18/content_138077.htm](http://www.china-woman.com/wf/2017-01/18/content_138077.htm)\n[2]: 乐施会，惠寄：中国农村妇女减贫概况及展望 [http://www.chinadevelopmentbrief.org.cn/news-16680.html](http://www.chinadevelopmentbrief.org.cn/news-16680.html)\n[3]: 南方周末，非法移民刘春兰之死 [http://www.infzm.com/content/6313](http://www.infzm.com/content/6313)\n[4]: 新华网 2003-01-21，别再往「伤口」上撒盐了—— 一位下岗女工的含泪诉\n[5]: 段成荣、周福林、杨舸：中国留守妇女状况研究 [http://www.china.com.cn/news/zhuanti/fnbg/2009-05/07/content_17738716.htm](http://www.china.com.cn/news/zhuanti/fnbg/2009-05/07/content_17738716.htm)\n[6]: 河北新闻网：阜平家庭手工业扶贫，促农民增收 [https://baijiahao.baidu.com/s?id=1593650351467728403](https://baijiahao.baidu.com/s?id=1593650351467728403)\n[7]: 《 人民日报 》（ 2018年06月19日10 版）：河北顺平发展劳动密集型家庭手工业，就近打工，就地脱贫\n[8]: 晓岚：我们在湛江海鲜厂剥五天虾，赚了60块 [http://www.jianjiaobuluo.com/content/9581](http://www.jianjiaobuluo.com/content/9581)\n[9]: 人民网：富士康长期违法安排劳动者长时间加班，致自杀现象时有发生 [http://politics.people.com.cn/n/2015/0202/c1001-26494626.html](http://politics.people.com.cn/n/2015/0202/c1001-26494626.html)\n[10]: 南方都市报：惠州7名鞋厂女工为加班嗑药提神，最小仅19岁 [http://gz.southcn.com/content/2015-09/15/content_132839302.htm](http://gz.southcn.com/content/2015-09/15/content_132839302.htm)\n[11]: 2016-2017微商发展与趋势报告 [http://www.sohu.com/a/124231717_424598](http://www.sohu.com/a/124231717_424598)\n[12]: 新华社：网红主播，背后辛酸几人知？ [http://www.xinhuanet.com/local/2017-11/18/c_1121976537.htm](http://www.xinhuanet.com/local/2017-11/18/c_1121976537.htm)"
		},
		{
			"post_id": 25,
			"title": "赛博空间游击队员必备技能之一：使用GitHub搭建简易站点",
			"date_published": 1533936267,
			"body": "![20180811.1-c](img/build-a-site-via-github-pages/20180811.1.jpg)\n\n>不拨号是上不了网的，今天也是如此。 ——不鳥萬如一\n\n不知从什么时候起，唾手可得的物件或者知识成为一种司空见惯，消费成为这个时代理所当然的正确。消费只需「一刹那」间即刻完成，它无须理会商品背后的艰辛而漫长的生产过程。习得/传授 某项技能成为一件可耻的事情，因为人们 习得/传授 某项技能劳心劳神。这是消费主义的全面胜利。\n\n---\n\n我们习惯于使用信息孤岛创制的封闭空间，它无所不在、无所不能，渗透着包裹着我们，构建了我们的世界。彷佛我们日常使用的电子终端设备和互联网服务都是天上掉下来得一样，魔法一般出现我们的眼前，只要消费就可意义升华。那些「自愿加班」的产线工人、通宵达旦写程序的工程师、大雨中电瓶车送外卖的骑手们，她们成了看不见的人，被淹没在商品价值逻辑之中。\n\n欲望被压抑被审查之后，才会呈现出「自我」，真实被掩盖在荒漠之下。赛博空间游击队员知晓街头巷尾每一个监控设备，她们既不畏惧，也不甘心沉寂。透过探索监控死角，使得被淹没的「劳动者与生产关系」呈现在所有人面前。在赛博空间游击队员造梦的时刻，机械复制时代的技术与媒介终于成为被压迫者手中的武器。\n\nGitHub Pages 作为被压迫者革命武器，应该如何上膛？此教程为beta0.1。\n\n后续迭代，怨不通知。\n\n## 万维网、浏览器、网站与Github Pages\n\n>万维网（英语：World Wide Web），亦作「WWW」、「Web」，是一个由许多互相链接的超文本组成的系统，通过互联网访问。 \n>——维基百科词条「万维网」\n\n我们日常打开IE、Chrome、Safari抑或自由的Firefox浏览网页站点，就是通过超文本传输协定（http）访问了一个远程文件，通过浏览器访问的所有网站构成了我们熟知的万维网。\n\n构成网站的文件不是从真空中神秘产生，它需要硬盘空间进行储存。网站文件都储存在远方的电脑之中，我们把远程存储这些文件的电脑称为服务器，其实服务器不过就是一台电脑。\n\n我们可以把远程服务器的网页文件想象成储存在移动硬盘上的小电影，这些小电影需要播放器才能播放，而浏览器就是相当于播放网页文件的播放器。http协定就是链接移动硬盘和电脑的数据线，通过数据线（http协定）和文件浏览器（浏览器），我们就可以访问移动硬盘（服务器）上的文件。\n\n通常服务器需要购买才能使用，毕竟硬件需要花钱，开机需要联网和耗电，这都是成本。令人欣喜的是GitHub免费提供了储存网页的空间——Github Pages。\n\n理解了这些万维网基本运行逻辑，我们才能更好地操作GitHub Pages。Github是一个程序员间协作开发代码的应用，其中它提供了一项名为GitHub Pages的服务，可供我们储存网页文件，相当于免费赠与我们一个小U盘。\n\n我们只需要将制作好的网页文件上传至GitHub提供的储存空间，一个新的网站就创制出来了。\n\n## markdown、HTML与网页文件\n\n>Markdown是一种轻量级标记语言，创始人为約翰·格魯伯（英语：John Gruber）。它允许人们「」 使用易读易写的纯文本格式编写文档，然后转换成有效的XHTML（或者HTML）文档」 。 ——维基百科词条「万维网」\n\n>超文本标记语言（英语：HyperText Markup Language，简称：HTML）是一种用于创建网页的标准标记语言。HTML是一种基础技术，常与CSS、JavaScript一起被众多网站用于设计令人赏心悦目的网页、网页应用程序以及移动应用程序的用户界面。网页浏览器可以读取HTML文件，并将其渲染成可视化网页。HTML描述了一个网站的结构语义随着线索的呈现，使之成为一种标记语言而非编程语言。 ——维基百科词条「HTML」\n\n我们访问的网站，就是通过浏览器远程读取html文件，它或者是静态文件，或者是由其他语言动态生成。静态文件是早已经做好的文件，动态文件是用户在访问站点时，服务器根据用户请求实时生成文件，通过浏览器呈现在荧幕上。\n\n通过markdown标记语言，我们既可以方便地制作html静态文件，也可以将markdown文件存在GitHub上通过Jekyll驱动实时生成html文件。\n\n写markdown文件一般需要markdown编辑器，编辑器有本地软件，也有网页版。大家可以自行探索，web版编辑器有不少，在这里笨教推荐两款本地软件。MWeb和Typora，MWeb仅支持Mac，Typora支持win、Mac和Linux。\n\nmarkdown语言非常简单，用于html生产则只需掌握以下几个最基本的语法。\n\n```markdown\n\n# 一级标题\n\n## 二级标题\n\n### 三级标题\n\n**加粗**\n\n*斜体*\n\n>引用\n\n![图片标题](图片url)<超链接URl>\n\n<email>\n```\n\n更多语法请游击队员们自行去搜索学习。这里提示一下下，很多人可能不理解插入图片的操作。不管是在markdown中预览中显示的图片，还是网页中图片，这些图片都是储存在某个硬盘，或者本地电脑，或者远程服务器。通过GitHub Pages建站，需要将图片上传至GitHub库中，生成 链接/URL。有了url，图片就可在markdown中使用。\n\n## Github Pages 搭建站点\n\n通常github建立博客，大家都是通过git操作，但太过复杂，我们只需直接上传文件即可建站。\n\n首先注册GitHub账户，我们需要一个Email接受验证邮件，推荐使用Protonmail。Github网站使用的自然语言为英文，如看不懂请自行使用机器翻译。\n\n![20180811.2-c](img/build-a-site-via-github-pages/20180811.2.jpg)\n\n点击sign up，填入信息，注册即可。选择 username/用户名 要慎重考量，因为我们最后得到的站点主页地址：username.github.io。\n\n![20180811.3-c](img/build-a-site-via-github-pages/20180811.3.jpg)\n\n接下来就获取存在我们网页文件的免费小U盘。注册完成之后，登录，再返回主页，点击New Repository创建一个git库。点击之后，需按照要求验证邮件。\n\n![20180811.4-c](img/build-a-site-via-github-pages/20180811.4.jpg)\n\n再回到首页，重新点击New Repository创建一个git库。在Repository Name写入与妳注册的username相对应的\"username.github.io\"，勾选\"Initialize this repository with a README\"，点击创建。\n\n![20180811.5-c](img/build-a-site-via-github-pages/20180811.5.jpg)\n\n通常过几分钟，\"username.github.io\"就可访问，这时我们的网站已经被创制出来了。我们还需要修改它的显示内容，以表达我们的意见，呈现真实世界。\n这时返回首页，即可看到我们的项目库已经建立，点击进入。\n\n首先，我们需要上传网页所包含的图片，编辑markdown文件需要用到。因为众所周知的原因，GitHub访问速度稍慢，我们需要在上传图片之前将图片压缩，推荐使用tinypng.com进行压缩。\n\n![20180811.6-c](img/build-a-site-via-github-pages/20180811.6.jpg)\n\n如果固定使用一个站点，通常会有很多图片。就像在本地电脑管理图片一样，为了便于管理，我们需要建立图片文件夹。在GitHub项目库的页面中点击\"Create new file\"，输入\"文件夹名称/\"，出现上图页面时，输入\"readme.md\"(readme可以随便写)。\n\n返回项目首页，即可看到名字为\"文件夹名称\"的目录，这时文件夹已经创建，点击进入，再点击\"Upload new file\"，上传本地图片至图片目录。\n\n同理，也可建立图片二级目录，每一篇文章一个目录，方便管理。\n\n如只是游击性质的临时站点，可直接将图片上传至根目录，在项目首页直接\"Upload new file\"即可。\n\n![20180811.7-c](img/build-a-site-via-github-pages/20180811.7.jpg)\n\n上传完图片后，找到目录下图片文件，点击这个图片文件。点击图片，即可得到url（上图红圈），复制该url加上前缀https://，就是完整url。按markdown语法写入markdown文件，就可以显示该图片。\n\n### 一个markdown编写文章的实例\n\n上传完图片后，找到目录下图片文件，点击这个图片文件。点击图片，即可得到url（上图红圈），复制该url加上前缀https://，就是完整url。按markdown语法写入markdown文件，就可以显示该图片。\n\n一个markdown编写文章的实例\n\n```markdown\n# 一级标题\n\n## 二级标题1\n\n![图片标题1-c](图片1url)\n*图片说明*\n\n内容内容内容\n\n## 二级标题\n\n![图片标题2-c](图片2url)\n*图片2说明*\n\n内容内容内容\n\n内容**内容加粗**内容\n\n### 三级标题1\n\n内容内容内容\n\n内容内容内容\n\n### 三级标题2\n\n内容内容内容\n\n内容内容内容\n```\n\n### 直接上传markdown文件建站\n\n通过markdown软件，我们生成了md扩展名的本地文件，需将md文件上传到我们的创建项目中，才能依靠Jekyll驱动生成站点。\n\n![20180811.8-c](img/build-a-site-via-github-pages/20180811.8.jpg)\n\n在我们创建的项目之后，进入项目主页，点击Setting，进入项目设置界面。找到挑选主题按钮，点击进入选择妳钟爱的主题。\n\n![20180811.9-c](img/build-a-site-via-github-pages/20180811.9.jpg)\n\n选择保存主题之后，重新进入项目主页会发现有一个\"readme.md\"文件，将它删除。\n\n将本地生成的markdown文件重命名为readme，这个readme将作为首页，浏览器访问\"username.github.io\"即可看到。\n\n注意：在markdown模式，上传图片需在选择主题之后。\n\n在\"readme.md\"文件中，我们写入首页内容。它可以是一篇文章，也可以是文章链接列表，按自己需求决定。\n\n按照上传图片中方法，创建一个pages目录，存放次级页面，次级页面通常为文章页。将文件编辑成markdown文件，命名为\"article.md\",上传至pages目录，则该文章的访问地位为\"username.github.io/pages/article\"。\n\n如将article.md直接上传至项目的根目录，则访问地址为\"username.github.io/article\"。\n\n需要注意，我们分享给伙伴网站地址时候一直粘贴完整地址，\"https://\"不要忘记。\n\n```\nhttps://username.github.io/article\n```\n\n### 生成html文件建站\n\n其实直接上传markdown文件到GitHub是最简单建站方法，但因特殊需求，有时候有的人需统计访客数据。需要在html中加入统计代码，而本地html文件中直接加入统计代码较为方面。\n\n![20180811.10-c](img/build-a-site-via-github-pages/20180811.10.jpg)\n\n统计代码一般使用Google analytics，注册Google账户登录，添加网站，在admin菜单中获取统计代码。\n\n笨教严重声明，反对窃取访客隐私，请教友们开启浏览器「防止追踪」选项，日常访问不明网站尽量使用浏览器的隐私模式。\n\n利用本地markdown编辑软件，生成html文件，一般方法为在菜单按钮中找到导出或者生成html。生成后，在本地找到该html，编辑加入相应代码。一般来说，编辑html文件需要编辑器，苯教推荐Notepad+++与Sublime Text。\n\n使用编辑器打开html文件，找到<title>。<title>与</title>之间写入该网页的名字，例如文章名字为「文章」，则修改为<title>文章</title>。包括主页与文章页都可以编辑title。\n\n使用编辑器打开html文件，找到代码</body>，将google统计代码粘贴</body>代码之前，即可实现访客统计。\n\n在上传html模式中，我们需要将项目库的原有文件全部删除。与markdown模式不同，在html模式中主页文件为index.html。我们需要生成的主页文件命名为index.html。\n\n与markdown模式上传次级页面操作方法一样。将文章编辑成markdown文件，命名为\"article.html\",上传至pages目录，则该文章的访问地位为\"username.github.io/pages/article\"。\n\n生产html的方法多种多样，大家也可以使用别种更快捷的方法。只要html上传到github项目库，一个可以访问的网页就有了。\n\n## 高阶玩法\n\n![20180811.11-c](img/build-a-site-via-github-pages/20180811.11.jpg)\n\nGithub还可以绑定域名，非常简单，配置一个\"CNAME\"文件上传至根目录，绑定DNS即可。掌握了Github搭建站点，类似的服务Gitlib也可以搭建。\n\n本教程甚为简陋，仅供普及概念使用，具体小技巧还需游击队员们自行摸索。比如将html里的字体替换成国内源，可以加快访问速度，还有许多小技巧可以提高访问速度。\n\nMarkdown也有很多玩法，比如本地写文档生成PDF或者epub，亦或者使用markdown排版微信订阅号文章，比如本文就使用markdown进行排版。\n\n万维网上还有需要GitHub建站教程，git命令更新网站更为简单。苯教鼓励游击队员们积极探索。\n\n广阔天地，大有作为。只要深入发掘，总能找到武器。"
		},
		{
			"post_id": 24,
			"title": "万科来了，「三和大神」将成往事？",
			"date_published": 1530652364,
			"body": "![20180704.1-c](img/vanke-is-coming/20180704.1.png)\n_NHK纪录片截图_\n\n随着日本NHK电视台纪录片《三和人才市场・中国日结百元的青年们》的播出，网络上又出现一波关注「三和大神」的小高潮。与之前大部分国内带有猎奇眼光的报道不一样，NHK纪录片试图探讨「三和大神」背后的社会结构。\n\n* * *\n\n三和日结零工很多都是留守儿童出身，他们有的是因为交不起学费去打工赚钱，打工期间学籍被注销。纪录片中也提到，一位受工伤的一代移民工人勤苦劳动在深圳开店，他的女儿却不能在深圳入学，只能回家做留守儿童。三和的日结零工也颠覆了人们对移民工人的刻板印象，原来并不是所有「农民工」都想勤奋打工赚钱。这些结构性的解读让人们得以窥见「三和大神」困境的一角。\n\n## 三和工友为什么要做日结？\n\n百度贴吧「三和大神」吧里有吧友这样发帖：「我们三和人是有原则的！流水线飞机拉不进，管理狗太装屄不进，厂里女孩纸太少不进，没有空调车间不进，猪食食堂不进，附近没有修车点[1]不进！低于17/h不进，干七天跑路拿不到工资不进！我们不是懒惰，我们也不甘心堕落，而是缺少一个进好厂的机会，我们甚至想现在就上班。」\n\n那些在三和做日结零工的人们都是自甘堕落的吗？\n\n![20180704.2-c](img/vanke-is-coming/20180704.2.png)\n_百度「三和大神」贴吧_\n\n在百度帖吧「三和大神」吧里有这样一个名词：「团饭」，是指沦落街头的工友实在没饭吃了，希望吧友支援一两块钱，几个人凑一顿饭钱，先撑过去再说，再去做日结工，或者进包吃包住的厂子。\n\n「有老哥能给我团个饭吃吗？饿了差不多两天了，今天又下雨，本来今天打算进厂的。团个八块吃个炒粉就可以！！喝了自来水两天，实在没力气撑下去 」\n\n「这几天暂时在网吧睡觉，还好这个网吧可以让人睡觉，明天我跟中介看厂了。 」\n\n一位吧友在「三和大神」吧发帖说自己已经差不多两天没吃饭，只能喝自来水度日。他在贴子下面留下微信，希望吧友「团饭」可以让自己吃一顿饱饭。通过微信聊天，他告诉我自己是被黑中介骗到江门。\n\n![20180704.3-c](img/vanke-is-coming/20180704.3.png)\n_工友得到「团饭」后，连吃了四碗米饭_\n\n> 「是这样的，前几天我和一个老哥在三和没钱吃饭。」\n> 「有个招工的说是不是没钱吃饭，他说要不要工作，要的话可以介绍。」\n> 「我们说工作好的话就做，他就说江门有个厂十八块一个小时。」\n> 「我们觉得可以就跟他到江门了，来到江门才说十一块小时，说我们听错了。「\n\n这位工友之前在一家电子厂上班，不能忍受夜班，辞工回家，加上过年就在家玩了几个月。回到深圳后，和朋友挤在三和一间租金每月600元的出租房，据他说，这是三和最便宜最差的房子了。\n\n> 「你在深圳找了多长时间工作？」我问他。\n> 「一个月。」\n> 「深圳的厂很多要体检，和不包住。」\n> 「体检要钱，没钱啊，而且很多不包住，就来了。」\n> 「江门的厂多数不用体检，包住。」\n> 「就是被黑中介骗了，我不和他做了，自己找工作。」\n\n![20180704.4-c](img/vanke-is-coming/20180704.4.png)\n_痛骂黑中介帖子下网友的留言_\n\n黑中介是工友们最痛恨的人，贴吧里经常有曝光黑中介的帖子，网友的留言经常是「砍死他」。\n\n工友们找工作，很多时候不仅面临黑中介的欺骗，进厂之后还要面临厂里各种克扣。不满勤要扣钱，食堂伙食太烂，拖欠工资，社保那属于妄想了，做工不开心辞工还要不到工资。\n\n![20180704.5-c](img/vanke-is-coming/20180704.5.jpg)\n_等待做日结零工的工友，本图来自网路_\n\n虽然有很多因为赌博负债累累，沦落到三和的人，但很显然，也有许多工友是被黑中介黑厂逼到三和做日结的零工。贴吧里经常出现的「兄弟别去，那是黑厂，我们先去上网」这句话，已然是被损害的产线工人的心声了。\n\n日结零工本应是人人嫌弃没保障的工作，可为什么这么多工友要做日结工？不过是因为做完日结就可以拿到工钱，不用疲于应对黑中介黑厂的各种黑手。工人出卖劳动，按时拿到工钱，本应该是市场经济最基本的规则，可这会好像都成了奢望。\n\n十九世纪中叶，欧洲的工人运动风起云涌，工友团结起来争取权益。「做一天的工作，得一天公平的工资」，这句被马克思和恩格斯批判过的工联主义口号[2]，在三和日结工的心中应该是神往的生活了吧。\n\n## 相对廉价的生活成本\n\n![20180704.7-c](img/vanke-is-coming/20180704.7.png)\n_两元一瓶的「大水」_\n\n三和所在的区域属于景乐南北片区，那里有深圳龙华区最大的人才市场。\n\n在三和生活成本相对比较低，吃面五块钱，床位每晚只要十五块，这还是涨价之后的价位，两年前，床位是每晚八块钱，吃面也只要三四块钱。农民楼一楼遍布网吧，还可以在网吧打游戏，累了就睡在网吧。还有传说中的「大水」，2元一瓶，2升。\n\n![20180704.6-c](img/vanke-is-coming/20180704.6.jpg)\n_三和45元一晚的日租单间_\n\n在三和，日租房有两种：床位和单间。床位类似集体宿舍，很多租客睡在一间房子里；而单间通常就是一间小宿舍，凉席、小薄被顶多加上个电风扇，也有一些价格贵一点的有卫生间。\n\n在景乐村南区，大约5平米的单间加1平米的卫生间，里面全部家具是一张床，加上凉席和被单，一天50元，不能月租。而床位房通常租金是一个铺位15元，有公共卫生间，可以洗澡洗衣服，屋里通风很差，充斥着难闻的味道，也有臭虫会半夜咬醒租客。\n\n就算是这样恶劣的住宿环境，也是一床位难求。我们问了几个日租房老板，都说床位没了，只有一两间单间房，这也反应出在三和附近的日结零工和找工作的人的确很多。大概三和日结零工很少有女工，老板们说没有女工床位。\n\n![20180704.8-c](img/vanke-is-coming/20180704.8.png)\n_实在没钱还可以睡马路_\n\n有大的人才市场加之生活成本低，久而久之，很多人来深圳打工的落脚地就是三和。三和也聚集了一大批被黑中介黑厂伤过心的靠做日结为生的零工。\n\n目前在三和，做日结通常一天工钱大概是100元到150元，一般会包中饭。这样看来，如果睡床位吃最简单的面，的确可以「日结一天，玩三天」。\n\n日结零工大都是一些单调枯燥或者出力气的活，一般要在早上五六点钟去人才市场门口等待中介招工。做天猫打包的一位日结工这样描述工作：虽然不是流水线，但堪比流水线的单调枯燥，需要马不停碲地重复那几个打包动作。\n\n这位直播自己在三和做日结的吧友这样说：「现在的日结是越来越难找了！其实暑假工对三和老哥的冲击还是蛮大的。一方面导致了工价的下跌，之前的天猫（日结工资）150变成现在的130；一方面竞争更激烈了，稍微去晚一点可能就上不了车。」\n\n## 「三和往事，景乐新生」？\n\n暑假要到了，因为要和学生暑假工的竞争，找工做更难了，但努努力还是可以找到的。但万科来了，日结零工可能要逐渐被迫离开三和了。\n\n![20180704.11-c](img/vanke-is-coming/20180704.11.jpg)\n_万科正在改造三和「农民房」_\n\n2017年9月28日，深圳万科投资运营事业中心执行合伙人辜庆勇向界面新闻确认，万科已介入景乐新村整治事宜，具体模式便是万科与业主签订租赁协议，在对房间与小区进行改造后对外出租，他称这个项目目前处于「刚起步」阶段。[3]\n\n万科「升级改造」深圳城中城，已不是什么新闻。很多租客都已被迫从自己的小家中搬出，富士康工友也有发出抗议联名信。\n\n万科在景乐村的「升级改造」也在有条不紊地进行，其中不少房子在施工。景乐村也有一栋已改造好的公寓，万科用「泊寓」品牌来运营这栋楼。\n\n> 泊寓服务于有态度、有活力的城市青年，致力于为漂泊在外的「奋青」们营造公寓式的「家」。在泊寓，拎包入住是基础，品牌家电随你用，健身房、书吧、休闲室就怕你不来，从清雅隔间到豪华loft，装载各式各样的梦。泊寓，出租的不是房间，而是房间里的欢笑跟态度。 [4]\n\n泊寓这种服务于青年人的公寓，看起来也很美好，当然这些房子的租金也会美美地上涨吧。可是，那些原来在城中村租房的人真的需要这种租金变高的房子吗？\n\n![20180704.9-c](img/vanke-is-coming/20180704.9.jpg)\n_万科在三和即将招租的泊寓公寓房_\n\n2017年4月22日，万科创始人、万科董事会名誉主席王石现身深圳城市共创大会活动现场作演讲致辞。他说：\n\n「深圳1044个城中村里居住了60%的城市人口，这些村落在全市辖区范围内均匀分布，为四面八方来到深圳追求梦想的人提供了第一落脚点，他们是特区活力与竞争力的基石。」\n\n「城中村不应大拆大建，万科要对它们系统改造运营。」\n\n这个「系统性改造」是怎样的？「万村计划」以「城中村综合整治＋引进物资营管＋城市化商业运营」的模式开展工作。简单来说，就是引进许多当下生活业态，大型超市、品牌餐饮、文创展览。\n\n很明显，「升级改造」后，这将是一个不属于工人的社区，而是属于‘人才’、‘精英’的社区，社区周边的消费也会相应提高。\n\n可从「四面八方来到深圳追求梦想的人」有钱落脚在这种高端社区吗？我们的日租房还会有吗？我们便宜的小餐馆还会有吗？我们的网吧还有会吗？我们还能「日结一天，玩三天」吗？\n\n![20180704.10-c](img/vanke-is-coming/20180704.10.jpg)\n_万科景乐综合整治办公室_\n\n万科来了，三和日结零工的「基地」要成「往事」了。\n\n*   **source：** 尖椒部落\n*   **link:** [https://www.jianjiaobuluo.com/content/12321](https://www.jianjiaobuluo.com/content/12321)\n\n[1]: “修车点”的意思是性交易场所。\n[2]: 工联主义又称「工会主义」，要求改善工会工人的经济条件和法律地位。 工联主义是19世纪中叶国际工人运动中出现的一种资产阶级改良主义思潮。对于「做一天的工作，得一天公平的工资」这句英国工人的口号，恩格斯指出资本主义的「公平」只是资产阶级「公平」地剥削工人，工人阶级不应该满足于这一口号，而应该提出 「劳动资料——原料、工厂、机器——归工人自己所有！」。\n[3]: 脱轨的「三和大神」 [https://www.jiemian.com/article/1703352.html](https://www.jiemian.com/article/1703352.html)\n[4]: 来自泊寓「关于泊寓」中对泊寓的介绍 [https://www.inboyu.com/homepage/about-us](https://www.inboyu.com/homepage/about-us)"
		},
		{
			"post_id": 23,
			"title": "Google不作恶？我们都笑了...",
			"date_published": 1530220195,
			"body": "西元2011年3月23日，Google宣布关闭中国境内服务器，google.cn指向Google香港的简体中文服务。同日，网友们自发组织起来到Google中国总部门前「非法献花」，并在「草泥马之歌」中进入高潮。对于「Google重返中国市场」，中文互联网有着执念的幻想。每隔一段时间，总有媒体对一些信息进行捕风捉影，幻想Google又开启了重返中国市场的进程，意淫出种种时间表和路线图。它们天真地想象这个重返会给一个散发恶臭的局域网咸鱼摊带来冰镇可乐，但可乐毕竟只是「肥宅快乐水」，功效有限，也不过徒增骨质疏松罢了。\n\n---\n\n在数位原住民（digital native）出现之前，那些史前人类对互联网有着天然的想象。互联网公司是真实世界秩序的对抗者，硅谷是实践政治正确的良心。共享、互助和去中心化的开放互联，的确是互联网精神之所在。但理念的天国在现实中不堪一击，这些信息孤岛依然按照经济规律运行。信息孤岛并不止是由微信所构筑，Facebook同样在卖力添砖添瓦，它们把原住民当作免费劳力驱用。在信息孤岛中，原住民在筑墙者们的操纵下生产数据，这些数据成为它们发家致富的神圣秘密。有人不禁大声疾呼，「互联网，已死」。同样的幻灭也会发生在Google这里，毕竟Google是一间上市公司，它对股东负责，追逐利润。许多人把所向往的美好生活寄托在一间托拉斯式商业寡头公司之上，这种寄托因其自身的资本逻辑必然是脆弱的。不经意间轻轻掉落，就会破碎了一地。\n\n说起竞价排名的罪恶，我们都会众口同声讨伐百度。参与杯葛百度，已然成了中文互联网的政治正确。人们在细数百度种种罪恶的同时，不忘忆苦思甜，回忆一下Google带来的种种美好。其中一个恩赐就是Google的纯净搜索，一个没有莆田系迫害魏则西的搜索。可惜Google的历史并不是那么清白，它的罪恶并不比百度少一些。Google和百度一样，它的主要营收是贩售广告。虽然都是依靠广告收入，Google比百度稍稍好一点，毕竟百度宣称它的广告不是广告，而是竞价排名，不接受广告法监管。但这一点也不影响Google不做黑心广告。\n\n>2003 年，Google 因为网络药品广告问题接到美国国会三个不同委员会的调查质询。但就像百度丑闻曝光后的反应一样，Google >设立了一些机制，但虚假医疗广告没有消失。\n>\n>直到 2009 年。美国联邦调查局（FBI）钓鱼执法，找了个假药贩子去 Google 投放虚假医疗广告。而 Google 广告销售为他配了个专属客服，教他如何绕过 Google 本身的过滤机制。\n>\n>最终 Google 为此付出 5 亿美元代价，承认了医疗广告问题。从那以后，Google 重新修改了广告投放的规则，根据这些规范，去审核、清理广告。接下来的一年，Google 一年中撤掉了 1.3 亿虚假广告。[1]\n\n莆田系医院的美国同行，一个卖假药的骗子，名叫大卫·安东尼·惠特克(David Anthony Whitaker)。因为卖假药，他面临长达65年刑期。45岁的大卫还是中年人，从中年到老年在监狱度过，大卫自然不甘心，于是他向美国政府举报Google刊登假药广告，以期获得减刑。FBI安排他去钓鱼，给他一个假的公司身份。\n\n>他将以贾森·克林特(Jason Corriente)的身份出现，是一家虚构的罗德岛州营销公司Maxwell and Associates的「首席执行官」。美国食品及药物管理局(FDA)为其开通了一个800电话号码、一个银行户头和一项代客接听电话服务。他的任务是：为SportsDrugs.net购买广告，这个网站出售来自于墨西哥的人类生长激素和类固醇，且无需医生处方。\n>\n>骗子化名贾森，联系上谷歌广告业务员，花费每个月2万美金的广告费，得到谷歌广告业务员一对一的专门服务，业务员就手把手教他如何规避谷歌的自动屏蔽政策，让他的卖药网站得以出现在搜索页面上。在谷歌代表的帮助下，惠特克花了2.5万美元做广告，选定了一系列措辞明显的搜索关键词，比如说「流产」、「流产服务」、「药物流产」和「RU-486」等。在购买这些广告的过程中，谷歌从来都没有对其亮过「红灯」。短短三个月内，谷歌在这个虚假网站上赚取广告费近20万美元。[2]\n\n同行之间不能说的秘密，搜索引擎赚黑钱的套路都是这样步调一致。Google向美国支付了5亿美元的罚金，并承认通过关键字广告帮忙卖药，但它的卖假药的恶行并没有被公之于众。宣称「不作恶」的Google，在赚钱和理念之间，毫不犹豫的选择了赚钱。在监管之下，它被迫做出了改变，引入第三方机构依据美国法律审查药品。虽然卖过假药，但在很多人看来依旧技术范小清新的Google，来到法外之地是不是就不贩售人血馒头了？\n\n>打开全球最大的搜索引擎谷歌网站记者看到，在页面的最上方和右方等明显位置都标明着赞助商链接的标志。记者在输入「糖尿病」、「偏瘫」、「中风」等关键词后，一些宣称对疑难杂症有很好的「治愈率」、「有效率」的内容出现在了赞助商链接的网站里。\n>\n>记者随意打开一家名为「中国中医科学院糖尿病研究中心」的网站，网站宣称他们这里有一种号称「进入中南海国家老干部中心的特供药」能够根治糖尿病，有效率达到100%。[3]\n\nGoogle和它的免费宣传队自然可以宣称他们不卖假药，嘲笑一下百度吃的人血馒头。从Google的黑历史看，它的话语并没有落到行动上。美国人可以依靠他们的监管强制Google下线假药广告，那我们怎么办呢？要知道，我们还是生活在一个关起门读书都要莫名其妙消失的化外之地。商业公司追求利润，英雄不问出处，只要没有王法限制，赚钱就好。还在化外之地苦活的我们，难道只能自求多福，学好数理化，才能识破骗子们帮凶的伎俩吗？商业公司并不会只做慈善，主动帮我们把世界变好一点点。自己的国家自己救。\n\n>谷歌新总部就像一座「可移动的中央公园」，总占地26万平方米，除了跑道、自行车道以及停车场，还慷慨地规划了12万平方米绿地。\n\nGoogle不会主动帮我们把世界和我的国变好一点点，可做Google的雇员还是幸福的，它是许多程序员神往的工作胜地。并不只是因为它家薪水高，它有各种员工福利。Google雇员都是自带光环，周身都散发出耀眼的职业自豪感。\n\n>一百年前，工厂工人成立工会并举行罢工，要求改善工作条件和限制工作时间。如今，硅谷的员工却颂扬自己遭受的剥削。一款流行T恤上写着「朝九晚五属于无能者」(9 to 5 is for the weak)。一个名叫基思·拉布瓦(Keith Rabois)的风险投资人最近在Twitter上炫耀自己工作18年，休假时间不超过一周。渴望成为扎克伯格的人被告知，创业就像加入海豹突击队(Navy SEALs)一样。对某一类人——通常是年轻、男性——来说，磨难也是诱惑的一部分。[4]\n\n华为雇员自愿加班的新闻，经常会成为中文互联网的头条。但这个「自愿」是华为雇员和家属们的怨声载道的自愿。包括Google在内的硅谷公司在这方面就厉害了，它不作恶，只作精致的恶。它有魔力让员工心甘情愿加班。\n\n>你要是觉得那些科技公司提供高薪资、高福利是出于善意，那么你就大错特错了。相反，他们之所以这样做是希望员工能够更加卖命工作。这样一来，员工们就无需为吃饭、穿衣、出行等琐事耗费心力，省下的时间可以更好的为公司工作。正如南加大商学院Gerald Ledford所说的那样，那些科技公司用「金手铐」将员工拴在了工位上。其实细究起来，很多福利都是假象：「不限期的假期」意味着「尽可能少休假，多休一天都需要胆量」……\n\n为了更好地给企业干活，劳动者都需要休憩的时刻。一台机器都需要定期停用维护，出卖劳动力的人们当然也可以休息，这样才能更好为企业提供自己的剩余价值。休息区的甜品、咖啡和健身房的跑步机，这些都是了程序员的健康。雇工们需要再为Google健康工作五十年。Google需要高阶程序员，而高阶程序员需要长时间的学习和训练。在北美，像高阶程序员这样昂贵的物件，哪个老板会不爱惜？\n\nGoogle可能对于男性雇员来说是福利天堂，可对女性雇员就落到了人间。反对性别歧视，硅谷奉行的政治正确。「相比男性，女性在生理方面似乎并不适合从事科技类职业」[5]，这样的性别刻板更加使得女性程序员在理工科直男的世界中处于不利地位。\n\n>Google 虽然一直对外宣称他们有在提高员工的女性比例和改善她们的工作环境，确实，Google 公布的数据也表明该公司对女性的重视程度不断提高，但近期，美国劳工部对 Google 提出指控，认为后者歧视其女性员工。[6]\n>\n>「我們發現在Google整體勞動環境中，針對女性有系統性的薪水差異。」美國勞工部代表Janette Wipper在聯邦法院聽證會上指出。\n>\n>美國勞工部表示，他們已握有「有利證據」，足以證明Google總部的常見職位，對女性的歧視相當明顯且極端，就算在性別比例懸殊的科技產業中，也算是相當嚴重。[7]\n\nGoogle不仅在同工同酬方面对女性雇员实施系统性压迫，那些把反对性别歧视挂到嘴边的理工直男也会对女性同事进行性骚扰。\n\n>「他的手擦过她的胸部」\n>\n>「男性同事用威士忌替换了她的饮料，并对此笑了起来，」 李的诉讼状态。「男性工程师几乎每天都会向在她身上射击nerf球和飞镖。」\n>\n>李说，「有时候，」 男同事发出她「令人不安和奇怪的信息。」 有人问她是否想要「水平拥抱」 。另一位同事「在她的公寓出现了一瓶酒，并提出与她共事，以解决她在用她的一台设备时遇到的问题。」 李「要求他离开，但他拒绝了。」\n>\n>Lee声称，她被一名醉酒的男性同事殴打，「原因没有明显的原因，工作场所的男子不断地嘲笑她，原告在她26岁时开始在Google工作，而这种文化是唯一的她知道的职业环境。」[8]\n\n在#metoo运动反对性骚扰风起云涌的今天，满口仁义道德的Google也不能独善其身。它作为一间商业公司和所有它麾下的被结构的直男并不难脱离直男秩序生活在真空之中，所有的性别歧视和性骚扰等等都不过是男权社会的表征。当我们说Google不作恶的时候，是在说它只是在遵守最基本的商业规则和当前的社会道德底线。同样的法则，依然表现在它怎么对待用户和产品。\n\nGoogle reader是一个人民群众喜爱的RSS阅读器。2013年Google因为觉得这个产品不怎么赚钱，决议关闭这个产品。上千上万的用户发起联名请愿，祈求Google不要关闭它，但Google无动于衷。这里的逻辑太简单了，它只要赚钱，不赚钱就被关闭。群众非常喜爱但不赚钱的产品，被Google关闭的例子太多。Gtalk是一个基于开源协议的聊天软件，深受geek们的喜爱。Google强行下线Gtalk后，想把用户关系导入到一款新软件，但并没有成功。很多用户已经不再相信它，也不会再用，这样的软件自然也不会成功。所以，因为没人用，Google几乎需要每年都要推出一款新的聊天软件。\n\n资本逻辑决定产品存活，这种做法太过赤裸裸。从羞答答的情怀出发，很多产品才有赚钱的可能，Google太笨吗？它不过是太商业而已。一个跑得快的机器人，萌到所有人，被Google收购。但因为没有赚钱前景，投资的回报周期过长，转手就被Google卖掉。\n\n百度老板李彦宏说中国人乐意出卖隐私获取便利，Google就更厉害了，它不光扫描用户电邮以提供精准广告，它更直接窃取用户数据。因为涉嫌搜集用户WiFi数据，Google被FCC罚款25000美金。更不要说它被斯诺登指认，为美国情报局监控用户提供便利了。用户在Google看来，不过是为它生产数据的免费劳动力而已。主子会在乎奴隶的想法吗？\n\n硅谷的人们都在相信她们在改变世界，不过Google改变世界的方法有点特别，它过用美国军方制造人工智能杀人机器改变世界。[9]也许Google已经意识到它不能不作恶吗？2018年，它悄悄删改了它们的行为准则。\n\n>长期以来，谷歌的非官方座右铭是「不作恶」 （don’t be evil）。然而，根据谷歌向其员工发布的行为准则，「不作恶」 已经结束。Wayback Machine显示，在谷歌的行为准则（Google Code of Conduct）页面，「don’t be evil」 这句话已经在四月底或五月初的某个时间点被悄悄删除。[10]\n\n卖过假药，出卖过用户，给军队打造杀人AI。Google和百度一样，在不同的环境下，有着不同的赚钱模式。它们有着同样的目标，快速赚钱。我们需要破除神话，消灭幻想和天真。Google只是一间普通的公司，它同样以追求利润为目的。当它为自己的商业行为谱写神话的时候，也许你们也会呵呵一笑。但我会忍不住，哈哈哈哈哈哈哈大笑。\n\n[1]: 好奇心日报：曾因假药广告被罚，现在进了医疗产业，Google 这几年都做了哪些准备？https://www.qdaily.com/articles/32418.html\n[2]: 茶网：谁说谷歌不帮别人卖假药?5亿美金罚款笑了 http://www.cwzg.cn/politics/201605/27881.html\n[3]: 央视调查：谷歌搜狗赞助商链接虚假售药信息 http://tech.qq.com/a/20081211/000243.htm\n[4]: 在硅谷，朝九晚五属于失败者 https://cn.nytimes.com/opinion/20170901/silicon-valley-work-life-balance-/\n[5]: CSDN资讯：偷窥、报复、歧视，Google 为何频发性骚扰事件？https://blog.csdn.net/csdnnews/article/details/79562739 在CSDN的编者按中，公然宣称这种性别刻板印象。\n[6]: Google 摊上事：美国劳工部指控该公司歧视女性 http://www.ifanr.com/815950\n[7]: Google遭美國勞工部指控存有「嚴重」性別歧視，給女性員工較低薪 https://www.bnext.com.tw/article/43983/department-of-labor-google-gender-pay-gap\n[8]: 女Google工程师表示，她面临「频繁的性骚扰」 http://t.cj.sina.com.cn/articles/view/6432549479/17f68ea67001007rxh\n[9]: Google 用 AI 帮美军方分析无人机航拍视频，员工对「助纣为虐」 怒了https://www.leiphone.com/news/201803/fKTh5h0E2zhKblJk.html\n[10]: 谷歌更新行为准则，彻底删除「不作恶」 口号 https://www.huxiu.com/article/244841.html"
		},
		{
			"post_id": 22,
			"title": "他是风钻工也是父亲",
			"date_published": 1529010452,
			"body": "2003年，谷师傅跟随哥哥加入风钻行业。力气活，只要肯出力，就有钱赚。风钻工比起工地上其他工的工资高出不少，有关系才能做这活。谷师傅从山清水秀的老家湖南来到深圳做风钻工，就是为了赚钱养家，他家里还有孩子和老母亲。\n\n谷师傅和工友们卖的力气，不仅换来孩子的学费，还撑起深圳的广厦千万间。盖房子打地基，越高的楼需要的地基也越深。深圳的地下全是坚硬的花岗岩，风钻一下去，粉尘特别多。\n\n---\n\n6月的深圳，工地上的湿热空气中充满了躁动的粉尘。谷师傅和工友们早上上工，中午吃饭时才能从井下被提上来。衣服湿透了，也懒得去换，反正换了也马上湿了。虽然又苦又累，但想想孩子和老母亲，谷师傅还是充满了干劲。\n\n工友们先在石头上钻出一两米的孔，放上炸药，爆破。坚硬的花岗岩上出现巨大的深井，这些深井之上有了高楼和地铁。粉尘漫井，口罩什么的，不得不洗洗继续再用。\n\n谷师傅和工友们在深井里打风钻，粉尘从钻孔弥漫到整个井。虽然有吊灯，井里的工友还是像戴上了布满面粉的眼镜。包工头为了加快施工速度，赶工期，从没告诉工友们还有水钻这回事。\n\n粉尘透过呼吸，进入肺，堆积。时间一长，血红的肺就会变黑，最后呼吸都会变痛。直到2009年，谷师傅和工友们才得知尘肺的可怕。尘肺病是职业病，无法治愈。患上尘肺，等于判了死刑。\n\n哥哥查出来尘肺一期，短短6年就与谷师傅阴阳两隔。当时体检，报告显示谷师傅并没有尘肺。但尘肺病有很长的潜伏期，直到2014年，谷师傅开始感觉身体不舒服。2017年，在张家界职业病医院，谷师傅被检查出尘肺二期。\n\n谷师傅的儿子看过许多尘肺工友的家庭惨状，有的人家破人亡，有的人负债累累，有的人妻离子散。儿子看到这种情况，他也不想自己的家也四分五裂。\n\n谷师傅的儿子对上学失去了信心，因为不上学还有可能减轻父母的经济压力。上学就要花钱，整个家庭就会雪上加霜。就算考上大学，也供不起学费。\n\n谷师傅觉得儿子考上大学，可以申请助学贷款，到时候毕业工作后慢慢偿还。但念高中也需要花钱，谷师傅患上职业病，这钱从哪里来？一米八的高二学生，正长身体，饭量大，开销自然也大。花销太大，儿子不希望再给患病父亲增添负担。\n\n谈起儿女，谷师傅充满了欣慰。「我家孩子很听话的，我女儿过春节，人家给了她230块钱，过年时外婆舅舅给的压岁钱。一直到上个月才拿出来开始用，要人家在网上给她买套衣服，所以才花这个钱。」\n\n儿子和女儿的生活费都是谷师傅跟亲朋好友借的，谷师傅这样说：「大的小孩生活费要1000多块钱，小的一个月也要500多块钱，所以我们每个月要承担1600块钱的费用开支。对于贫苦家庭来说，这是一个天文数字。」\n\n提起儿女的学生成绩，谷师傅充满了骄傲。「他们那个学校有806个学生，他考前6名呢。那个年级就有十几个班，他基本上都是满分的。」女儿现在念初一，在年级也是第一第二的成绩。\n\n去年，谷师傅的儿子休学一学期。为了减轻家里经济压力，就不想再念书。学校老师开车到家里，劝了四个小时，让他回学校。老师觉得这么好的成绩，不念书太可惜了。但儿子就是铁了心不回去。\n\n谷师傅没念多少书，小学还没毕业。谷师傅的老家是著名的贫困县，好山好水却没有钱，出去打工把钱挣。「没文化」，只能卖力气。想挣更多一点点，只能选择工作环境恶劣的风钻爆棚工作。\n\n深圳的高楼在谷师傅和工友们的手中像变魔术一般拔地而起，靠双手劳动撑起了一个家。谷师傅还是觉得他患上职业病，除了社会的不公，更多是自己没养家糊口的真实本领。城乡差距造成的教育资源不公，谷师傅有多少机会习得那些所谓「高级技艺」呢？\n\n谷师傅劝儿子继续念书，「如果你不去上学，那你就会走你老爸的老路。我们就是没有文化、文化少，所以我们就只能从事体力劳动。如果我要是大学生还是名牌大学生，我会患上那个尘肺病吗?」\n\n儿子听了父亲劝告，回到学校。谷师傅觉得儿子考上大学，有了工作，将来他不在了，还有能力可以照顾妹妹。儿子也是争气，回到学校后，考出了让谷师傅欣慰的成绩。\n\n刚刚手术后的妻子，孤身一人在广东打工，赚只能勉强够自己糊口的2600块钱。老母亲快九十岁了，还要下地干活。孩子们都是寄宿在别人家。谷师傅和工友们，这几天，谷师傅从深圳回到老家。忙着去县里跑手续，没顾得上和孩子们团聚，满是愧疚。\n\n谷师傅最大的心愿就是尽快拿到应得的赔偿款。这样，刚刚手术后的妻子，就不用外出打工；儿子女儿的学费生活费，就不用发愁；将近九十岁的老母亲，就不用再下地干活；欠下的钱也可以还清。\n\n谷师傅，借钱给孩子们上学，自己的职业病却顾不得花钱。虽然有政策帮扶，但每次去医院还是要花费几千块钱。所以不去，因为没钱也舍不得。吃药也要每天花费六七十块钱，吃了这药就停不得。这药有依赖性，谷师傅说「我这个家庭环境啊，就不允许我过早的接触这个药物」。\n\n谷师傅，他是风钻工，也是母亲的儿子，妻子的丈夫，孩子的父亲。我们多希望，风钻工就像这个工的名字一样，勇武有神力。\n\n谷师傅，父亲节快乐！ 靠气力凭本事吃饭，光荣！"
		},
		{
			"post_id": 21,
			"title": "事件与偶然相遇：为什么我们害怕爱情",
			"date_published": 1486242343,
			"body": "著名的美国知识分子视频网站Big Think在11月30日又邀请到一位老朋友：学术战斗机话题男神齐泽克先生！这次他受邀做了一个6分钟的谈话，来讲解他今年的新书《事件：概念的哲学之旅》（Event: A Philosophical Journey Through A Concept）中的主题——事件与偶然相遇（events and encounters）。在谈话中，齐泽克告诉我们，为何可以通过研究一个事件的本质，追溯引起这个事件的各种原因，彻底剖析现象可以揭示出整个社会的真相。\n\n---\n\n齐泽克在谈话中讲了两大主题。首先，他给出了一个关于「事件」的基本理论性的定义，并用一些抽象的例子来解释他的观点。然后，他用这个观点来解释现代人对于陷入爱情的态度是怎样的。\n\n给出「事件」的确切定义是困难的，因为这个概念被如此多的要素关联着。齐泽克选择了一个基本的解释：\n\n>在我的书中所聚焦的「事件」，是指发生了某种特别的、超越常规（extraordinary）的事情。在特定领域中，事情的现象总是按照某种常规的流动持续进行，但有时候也会改变其原有的常规规则，「事件」就是这样产生的。\n\n太晦涩！所以齐泽克这里仍然用他书中所使用的卡夫卡的例子来说明：\n\n>我们可以说，卡夫卡或隐或现地是受到了一串作家的影响，比如爱伦·坡、陀思妥耶夫斯基、威廉·布莱克等等。但是事情并非这么简单。因为，如果我们返回去一个一个单独地去考察这些人，考察他们的作品具有怎样的特点，这些使得使他们成为卡夫卡的先驱。我们会发现一个问题，这种考察的维度是说在卡夫卡出现以前，已经存在一个富有洞察力的、只能出现一次的卡夫卡。\n\n在这个例子中，卡夫卡就是一个「事件」。直到卡夫卡出现，才能把那些作家的对卡夫卡的影响成为对卡夫卡的影响。\n\n>阿根廷作家博尔赫斯对此有一个十分简洁的表述。所有的作家都有前辈和先行者，但是，真正伟大的作家却在某种程度上创造了他的过去，创造了他自己的先行者们。所以，伟大的作家确实是被人影响的，但是只有当他已经出现的时候，我们才能看到这种影响。\n\n在这里我们进入一些非常理论化的表述。这和「薛定谔的猫」的概念非常相似，箱子的盖打开后，我们才能确定猫是是否可以活着。齐泽克要告诉我们的是，只能是卡夫卡的出现才能决定埃德加·爱伦·坡可以成为造就卡夫卡的最后一步。旧金山巨人队赢得世界杯后，才能说他们进入季后赛是赢得世界杯的关键一步。\n\n那么「事件」和爱情到底有什么关系？齐泽克转会表述方式，解释了爱情是一个偶然相遇，这就是为什么在英语，包括其他语言中，会说「fall」in love。一个普通人在生命中与真爱的偶然相遇只有一次。\n\n>一个完全偶然的偶然相遇，但却改变了一生。就像他们说那样，没有什么东西是相同的。你甚至会认为你整个的过去生活都是为导向这个特殊的时刻。的确，关于爱情的幻想就是「哦，上帝，我的一生都在等待你的出现」。\n\n所谓一见钟情。在奉行父母之命媒妁之言的年代里，没有作为「事件」的爱情，无法有如上感受。因为两个人在谈论爱情之前，第三个人作为原因，已经让两人产生了可以预期的关联。让齐泽克感到悲哀的是，在互联网时代，作为「偶然相遇」的爱情，也变成了稀有物。此时，代替父母位置的，是机器的计算法则，根据条件进行匹配，先行的关联已经存在。婚恋网站、社交媒体绝对无法促成浪漫的爱情的「偶然相遇」。他们能提供的是没有「fall」的love。\n\n最后，齐泽克说，现代人害怕「事件」，他们不仅害怕「偶然相遇」的爱情，他们害怕任何「偶然相遇」，这就是现代人肤浅的消费主义态度。\n\n- **Title:** Slavoj Žižek: Events and Encounters Explain Our Fear of Falling in Love \n- **Link:** http://bigthink.com/think-tank/slavoj-zizek-on-on-events-encounters-and-falling-in-love\n- **翻译：** 澎湃新闻译文，王小嗨改定"
		},
		{
			"post_id": 20,
			"title": "全世界的极右翼政党都在期待川普的总统就职",
			"date_published": 1484600641,
			"body": "在当选总统川普就即将就任的前夕，他被指控俄罗斯情报部门扶植他当选，这个爆炸性新闻让他狼狈不堪。这些由星期二在CNN和Buzzfeed上发表的指控，使得总统换届的过渡期陷入动荡。这个丑闻并没有让川普的最热衷的国际支持者退缩。也许川普在美国已经是水深火热了，但是他那些国际上的右派崇拜者们仍然在期待1月20日的总统就职。\n\n---\n\n自从11月川普取得选举人团胜利，全世界的极右翼与极端国家主义政党的党棍们都在大力给川普唱颂歌，并且丝毫不掩饰对与他们灵魂共秩的川普进驻白宫的兴奋。这些极右派与极端国家主义分子与川普分享了同样的意识形态，所以他们希望川普胜选的经验可以同样应用到他们自己的竞选运动中去。\n\n这些极右翼与极端国家主义的政党都相信川普的总统任期会使全球地缘政治平衡右转，并且会有助于种族主义候选人的竞选。就跟川普一样，这些政党和竞选运动都企图利用工人阶级群众的不满与苦难，声称他们的政纲可以解决这些经济与社会问题。\n\n尽管当选总统和共和党发言人都试图否认公开性的种族主义和仇外本性，但类似美国的三K党和白人种族主义者的川普的海外粉丝后援团则公开称赞川普的伟大在于他的种族偏见。\n\n## 川普粉丝国际后援团\n\n希腊雅典的新自由主义纳粹运动金色黎明是川普的早期热忱追随者，在历史上他们曾经谋杀政敌煽动人们暴力驱逐移民，而现在他们声称川普的胜选是「一个伟大的全球变革的开始」。\n\n他们视川普的胜选为一连串极右翼胜利的开始，称「奥地利的国家主义分子盛行、法国的玛丽娜·勒庞和希腊的金色黎明」将会延续这个趋势。\n\n该党还声称，「这是反全球化、反对非法移民和赞成纯净种族国家的力量的一次胜利」。他们还表示希望川普与俄国的普京建立一个紧密的合作关系。\n\n佛罗莱恩·菲利浦特是法国国民阵线总统候选人玛丽娜·勒庞的一名顶级战略家，他发布推文说「他们的世界在崩坏，而我们的世界正在创制」。菲利浦特的确有理由感觉兴奋，因为根据最近的民调显示勒庞已经法国总统竞选中飙升至第一名。选民在4月份举行了第一轮投票。勒庞的主要竞争对手是中右翼参选人弗朗索瓦·菲永；而分裂的法国社会党和它的候选人曼努埃尔·瓦尔斯已经没有胜算了。\n\n弗劳克·佩特里是反移民和反穆斯林的德国替代党的党首，她同样期待右翼连线可以改变世界政治格局。佩特里称美国大选结果是「鼓舞了德国和欧洲」。她认为川普代表了一个「天翻地覆的政治变革」。\n\n谈到北约对俄罗斯采取的对抗立场，这个德国右翼民粹主义者们的头头相信候任的川普政府有能力「重塑跨大西洋关系」。她认为由川普与普京主导的美俄和解，将会「终结两国在乌克兰和叙利亚的巨大冲突」。\n\n海尔特·威尔德斯，荷兰议会议员、荷兰自由党党首。他称赞川普作为一名领袖承担了政治家与媒体的工作。他说川普「只有一个考量...那就是美国选民们的国家利益，为了这一考虑必须解决移民、全球化带来的失业以及他们社会的伊斯兰化」，他进一步强调说川普入驻白宫将意味着人们在「夺回他们的国家」。而他也承诺，「我们荷兰也会夺回我们的国家」。\n\n奥地利自由党是奥地利二战时期纳粹政党的直系后代，最近该党上了头条。自由党党首海因茨-克里斯蒂安·斯特拉赫在纽约川普大厦会见了候任国家安全顾问迈克尔·弗林将军。斯特拉赫在Facebook上发文说，美国的「政治左派、远离群众的政客和腐败的建制派」已经川普的选民惩罚。\n\n在英国，奈杰尔·法拉奇是英国独立党前党首，在去年取得成功的脱欧公投中经常抛头露面。他说川普就任总统毫无疑问将会是一场「革命」。他认为英国的脱欧和川普的胜选是2016年的「两场年度政治大革命」，并且预言美国走向川普道路将会「比脱欧更伟大」。\n\n法拉奇受密西西比州政府的菲尔布·莱恩特邀请参加就职仪式，他是确认参加川普的总统就职典礼的第一个外国极右翼领袖。在川普刚刚胜选不久，他就发表声明表示他认为英国首相特雷莎·梅应该委任法拉奇为英国驻美大使。英国政府对此回应称在这个职位上「没有空职」。\n\n在美国北境外的加拿大，国家主义右翼一直缺乏民意基础，并且在主流政治中也没有立足之地。但就这样一个国家，川普的模仿者都已经出现了。自从2015年10月的总统选举中自由党贾斯廷·特鲁多战胜斯蒂芬·哈珀后，保守党就陷入了群龙无首的境地。在这之后的保守党党首竞选中，凯莉·利奇议员把她自己比作川普。\n\n利奇拿着「加拿大价值」的大棒，试图使政府接纳37,000名叙利亚战争难民成为她反移民政治平台的基础。有鲨鱼坦克之称的凯文·奥利里也是川普的追随者，面对这个真正的电视明星和投资大鳄，另一个川普追随者利奇与他必有一战。\n\n近久，俄国是川普联系在一起最多的一个国家。自从11月川普胜选之后，俄国就充盈着对川普胜选的赞美与欢呼。俄国总统普京公开表示要谨慎对待川普胜选，而且并没有官方的祝贺或者寻求更进一步的关系。这都没有影响普京的政治盟友表达他们的喜悦之情。\n\n在美国大选当晚，俄国议会杜马成员们实时收看了选票统计结果。极端国家主义政党自由民主党领袖弗拉迪米尔·吉里诺夫斯基是普京总统的政治盟友，当晚开了一瓶香槟为川普胜选祝贺干杯。「敬唐·川普」，他说，「在叙利亚、在乌克兰，我们可以成为盟友」。他对北约的改变充满了乐观，并且认为美国讲不会援助北约了。\n\n## 国际右翼大团结\n\n虽然极右翼和极端种族主义政党之间跨国协调仍然不稳定，它们之间联系也是临时的，但这些团体间的交流正在变得常态化。\n\n候任的川普执政团队中一些人公开表达要加强民主党中的川普系与欧洲种族主义运动的国际联系，史蒂夫·班农就是其中之一。蒂夫·班农被布赖特巴特新闻和白人种族主义「右翼替代」新闻平台称为资深战略家。\n\n同样的意识形态让它们更加走近。如果这些极右党派和运动之间的组织纽带得到加固，它们的活动与运动将更加协调，它们的集体和政客的影响力就会大大增加。\n\n1月20日不仅很有可能成为美国政治的转折点，而且很有可能也是世界历史的一个转折点。\n\n- **Title:** Far-right parties around the world look forward to Trump presidency\n- **Link:** http://www.peoplesworld.org/article/far-right-parties-around-the-world-look-forward-to-trump-presidency/\n- **作者：** C.J. ATKINS\n- **译者：**王小嗨"
		},
		{
			"post_id": 19,
			"title": "妳、我和我们的宣言",
			"date_published": 1482613341,
			"body": "- 此文系拜生活教的創教宣言，為眾教友集體創作所成。\n\n不同的人群，特别是男性人群，依照其占有性爱资源的多寡，分为不同的「class」。Bourgeoisie通过不停更换对象来维持实在的虚假幻想；petty bourgeoisie 在「深处的凝视」开辟的空间中构筑属于两个人的「宗教世界」；proletariate则不得不接受被阉割的现实，放弃对完满的追求，成为一名真正的「屌丝」。\n\n---\n\n这个时代，一些屌丝奴隶不仅被统治阶级所剥削而且还匍匐在统治阶级制造的意象下跪舔。然而，另一些革命屌丝却愤然揭竿而起吹起了屌丝反抗女/男神压迫的号角，他们是屌丝反抗军。他们知道路人拜的是那座神明，也知晓街头巷尾的每一个幽灵，他们既不敬神也不期待神迹的降临。\n\n他们选择去生活，在充满腐臭衰败的意象堆里发现了生命的美，他们是发达资本主义时代的抒情诗人。反抗的屌丝不是要求女/男神反过来匍匐，他们不屈服于任何女/男神拜物教和反女/男神拜物教。他们不是异端，他们丝毫不隐藏自己的一个简单的要求：爱情的平等和平等的爱情。请说一声：你好，同志。\n\n「膜拜生活」这一说法本身就是矛盾的：难道有人不生活吗？是的，现实就是具有这样的矛盾性。假如一个人生活在他人欲望构制的意象中，那就不算是一个真正的「人」的生活。去生活，就是要作为一个独立的人去生活，必须在实施「欲望批判」的前提下，才能真正地做到。向那些幻想说不吧！\n\n生活就像一列急行的火车，我们不知道开始在哪，也不知道终点在哪，也不知道乘客的种种。但我们选择真实的面对这些不可知的一切，使用你知晓的一切，来摆脱呆迷式的狂热。这是祛魅。\n\n古典心性的抵达，不止是你处于茫茫的世界如呆迷般的耶稣基督救赎式的受难，而是没有任何心性的起伏，坦然面对一切，知晓一切小ta都是和妳和我和我们一样的生活者，他们生活是和妳、我和我们联系在一起，每个人的心性和妳的心性在一处。因为妳、我和我们共享了一个生活世界，只有也仅有这样心灵才能抵达流着奶与蜜的地方。这是意义。\n\n「无穷的远方，无数的人们，都和我有关」。诸多生活者的生活交织成生活本身，而不可分割。"
		},
		{
			"post_id": 18,
			"title": "团结起来，反对川普！",
			"date_published": 1482354029,
			"body": "* **不许驱逐移民！黑人生命关注！保卫工人和妇女的权利！**\n\n伴随着唐·川普的胜选的是震惊、担忧和愤慨。而对于移民、穆斯林、多元族群、妇女和那些被川普点名攻击的被压迫的人们来说，在即将到来的攻击中如何保护自己是一个尖锐的问题。\n\n跨越祖国大地的游行正在组织起来了，用以反击川普。这些抗议游行一定是全国性动员的开始，百万大众将投入到群众运动中去。\n\n---\n\n针对1月21日和22日的川普总统就职，大规模的全国性抗议已在计划之中。只有我们团结一心众志成城，才能应对日渐严峻的驱逐移民、严厉打压穆斯林社区和其他一切的压迫政策。社会主义代替党将全力组织这些抗议行动并全力团结广泛社区联盟，团结一致对抗偏见和仇恨。加入我们！\n\n## 为什么川普会胜选？\n\n川普是现代历史中最招人愤慨的总统候选人，甚至投票后民调都显示61%的投票人持有不利于川普的观点。而川普居然可以入主白宫，所以我们从这个错误中汲取教训，才能发动一场能有效阻击川普政策的运动。\n\n关于川普如何胜选，有两个观点针对的解释。其中之一，许多民主党的支持者把川普胜选的责任归罪到被她们描述成绝望右翼的美国人民特别是白人工人阶级身上。这种制造分歧的理论，实际上帮助建制派政棍们和民主党党棍们逃避责任。\n\n坦率地讲，虽然在川普竞选运动的核心有一小撮危险的种族主义右翼少数派，但是川普的险胜主要依靠了广泛的反建制愤怒。克林顿作为华尔街政治建制派的典型代表，民主党党棍们坚持提名她简直是在川普助选。人们拒绝日常政治，而克林顿就是这种日常政治的典范。人们对于经济危机、生活水准的下降和政治体制腐败中的积累怒火，足以助选川普。\n\n伯尼·桑德斯发起了“反对亿万富翁的政治革命”反建制运动，他对抗川普远比克林顿好太多。而民主党全国委员会却竭尽全力地在党内阻击他。坦率地讲，被企业控制的民主党党棍们更在于提名一个华尔街信赖的人，而不是战胜川普。她们玩了一个危险游戏 – 而且她们输了。而工人阶级、多元族群和妇女将首当其冲地承受她们的失败。\n\n## 阻击川普的策略是什么？\n\n2016年选举给我们的重要教训：工人阶级必须团结一致、组织起来并依靠我们自己的力量，才能对抗右翼和资本的攻击。建制派政棍们并不能保护我们或者推动社会进步。最有效阻击川普和聚集在他周围的右翼运动的方法是创制一个强大的左翼反建制运动，而这个运动必须和被资本收买的民主党党棍们划清界限。\n\n我们必须组织群众抗议和公民不服从运动，这会是对抗川普和共和党国会的至关重要的开始。它们会试图分裂我们的运动，它们会试图反对我们的运动。“伤害任何一个人就是伤害我们所有人”将会是指导我们运动的口号。\n\n仅仅靠抗议游行是不足以胜利的，必须急力地建立一个属于劳苦人民的新政党。尽管伯尼·桑德斯错误地选择在民主党竞选总统并且错误地给克林顿背书，但他的竞选已经证明可以通过建立旗帜鲜明地左翼项目挑战大资本的权力。那些为了抗议政治建制派而给川普投票的数百万人将会转支持新的左翼党，而右翼民粹则会失去支持。\n\n社会主义代替党将会全力组织抵抗川普的仇恨和偏执的政纲。是时候组织起来了！今天就加入我们吧！\n\n在此，我们团结一致的声明：\n\n* 不要边境长城！不许驱逐移民！\n* 向川普这种亿万富翁收税！全民医疗保险！大学免费！\n* 黑人生命关注！\n* 抗议川普的女性歧视 – 保卫妇女权利！\n* 停止修建达科他的石油管道 – 绿色就业！\n\n**Link:** http://www.socialistalternative.org/2016/11/09/build-resistance-trump/\n**Title:** LEAFLET: STOP TRUMPS AGENDA OF RACISM & BIGOTRY\n**作者：** 米国社会主义替代党\n**译者：** 王小嗨"
		},
		{
			"post_id": 17,
			"title": "资本主义与女性身体",
			"date_published": 1456691847,
			"body": "> 生产的不断变革，一切社会状况不停的动荡，永远的不安定和变动，这就是资产阶级时代不同于过去一切时代的地方。一切固定的僵化的关系以及与之相适应的素被尊崇的观念和见解都被消除了，一切新形成的关系等不到固定下来就陈旧了。一切等级的和固定的东西都烟消云散了，一切神圣的东西都被亵渎了。人们终于不得不用冷静的眼光来看他们的生活地位、他们的相互关系。\n> \n> ——**《共产党宣言》**\n\n* * *\n\n![百度贴吧热门疾病吧情况统计[1]-c](img/capitalism-and-the-female-body/20160229.1.jpg)\n_百度贴吧热门疾病吧情况统计[1]_\n\n2016年1月，百度因变现「血友病」贴吧而走上了风口浪尖，一时间「反百度」成了中国互联网的政治正确。早先，百度的竞价排名早已声名狼藉，而在变现「血友吧」之前，百度早就把许多相关的疾病贴吧卖出去了。虽然百度的各种丑陋行径早已为人们所知晓，但这次百度吃的人血馒头上的血太过鲜红，因此引起了公愤。网友谴责百度没有良心，但在我们身处的社会里，「良心能值几个比索」？显然，随着时间的流逝，人们会慢慢忘记百度的这场信任危机，身体不舒服时依旧会打开浏览器「百度一下」。这不过是表明了，控制我们的生活和思想的力量，是多么强大，无处不在。\n\n改革开放后，社会主义中国逐步卷入全球资本主义体系中，直至今日资本主义生产关系的全面渗透。以利润为导向的资本，不仅压榨女性的劳动力以控制成本，还从消费和损害女性身体上找到了利润点，对女性实施全方位的系统性的压迫。女性，尤其是劳动阶级的女性在社会权力结构中所处的位置，决定了她们是被侮辱和被损害的人。\n\n百度这次「营销部门」的失败[2]事件只是冰山一角，而不可见的却更加深刻的伤害像空气一样包裹着我们。车间里灯光下的女工们不仅遭受着身体性病痛；在电台的深夜谈话节目中，在电视台的插播的广告中，在公交车的广播中，在大巴座位印的广告中，在路边的广告牌中，还有「百度一下」的搜索结果中，不孕不育、无痛人流、各种妇科病的广告塞满了我们眼睛和耳朵，像瘟疫一样让人无法躲避。这些资本制造的疾病，使得女性在忍受加班和家暴之后再次受到伤害。\n\n## 被奴役的女性身体\n\n![富士康工厂：iPhone女孩-c](img/capitalism-and-the-female-body/20160229.2.jpg)\n*富士康工厂：iPhone女孩*\n\n时至今日，每逢春节仍然爆出不少「女性不得上桌」的新闻和讨论。这反映了我国农村仍然广泛存在男女不平等的现实。家暴、重男轻女、繁重的家务劳动，在许多农民的眼里，女性仅仅是一个传宗接代的工具。与此同时，从城市透过电波传播过来一个光鲜的城市生活，为女性提供了一个美好生活的想象图景。\n\n这些中国农村女性渴望逃脱父权制家庭的压迫，进入到电波中那个美好生活。在改革开放的初期，大批中国农村女性进入到城市工厂打工。城市的工厂生活并不是如想象中的美丽光鲜，工厂的劳动很繁重，工资却很微薄，商场里玲琅满目的商品并不属于她们。与毛时代的工人不一样，国家权力不承认他们的工人身份。资本与权力系统化地使用来自农村的女性临时工构成了最初中国制造业崛起的重要因素，廉价工业品横扫全球市场的背后是女性所受到的系统性压迫。\n\n资本对于女性的想象，与父权对于女性想象及其类似，她们乖巧、听话。而这些构建出来的女性特质刚好契合了工厂流水线工作的需要。以利润为导向的资本，需要把每一个工人归训成可以随时替换的零件，用以应对工人的流动。打工妹一旦进入工厂，「她就会立刻被安置到一个特定的位置，被牢牢地钉在一个权力和纪律的网格之中。生产机器的技术和权力，迫不及待地开始作用于工人的身体之上」[3]。\n\n在每一个工位上，女工们在流水线的操作下不仅沦为服从机器节奏的没有意识的重复简单动作的机器。「富士康厂房里，17岁的田玉，每天2880次地重复同一个动作：查看产品屏幕是否有损坏」。[4]女性员工占大部分的富士通工厂以台式的准军事化管理而昭著，女工不仅面临在工位上工作上标准化管理，工厂生活亦被标准化管理。\n\n> 富士康工作时的管理制度包括：1.不准睡觉、不准聊天、不准笑、不准走动；2.离岗要申请，批准后才能离岗，要拿离岗证，离岗时间不能超过5-10分钟；3.椅子整齐，不能超过地上的黄线；4.工作服按要求穿戴整齐。军事化管理甚至被用于控制工人的工作间隙时间，「我们是每两小时工作休息十分钟。只有在这十分钟内才能去洗手间。十分钟之后会有一个预备铃，这时员工要穿好厂服，准备好工具什么的，站在位子前面，不准说话。然后响正式铃，就开始坐下正式开始工作。」在这套森严的纪律下，任何违反生产纪律的行为都会受到严厉的惩罚。在《富士康科技集团员工手册》里，仅仅惩处的规定就有127条之多，惩处的方式包括从警告、记过到开除处分等。\n> \n> …\n> \n> 除了生产管理制度，富士康设定了一套严格的工厂制度，对员工的规训从车间一直伸延到整个工厂。从门禁制度、车间日常管理制度、晋升制度、投诉与申诉制度、安保制度、招聘制度和离厂规定中可见一斑。[5]\n\n成为流水线上的麻木零件当然是一件让人痛苦的事情，无论男工还是女工，这种痛苦都是相同的。但是，对于女性来说，这种劳动还会给他们带来额外的痛苦，因为僵化的流水线线性时间和女性生理时间的周期性在本质上是冲突的，如果不从制度上实施专门的保护，将对女性身体造成非常严重的伤害。\n\n> ...工厂里每个月都会有一、两名女工因为痛经而被送进医护室。工厂里的所有女工，无论其年龄（从初潮到绝经的年龄之间）、所属地方，以及族群，全都要面临这种威胁、这种疼痛，以及这个无法逃避的问题。这种女性的普遍经验无可避免地将工业时间的僵化本质与女性生命之间的冲突暴露无遗。\n\n…\n\n女性时间是母性的时间。月经周期、婚姻与生育周期、青春期，以及做母亲的周期等都是女性生命中至关重要的身体经验。女性的周期性时间感与男性化的、富有侵略性的线性累进式工业时间之间存在着必然冲突。\n\n> …\n> \n> 工厂中有许多女工都饱尝痛经之苦，尽管疼痛的程度与时间因人而异。她们都说在农村的时候很少出现痛经。大多数女工在工厂工作一、两年之后便开始出现痛经，但也有些人说她们一离开农村马上就出现了痛经。\n> \n> …\n> \n> 环境的突然转变、工作时间长，以及压力大等都容易造成女工生理周期紊乱，出现各种经期异常现象。例如，有些女工的经期会推迟5至7天，有些女工的经期会持续一个月以上，还有些女工出现停经甚至绝经。[3]\n改革开放初期，资本通过女性以压榨其劳动力完成了原始资本积累。时至今日，女权运动已经变成一个社会运动，但「经期假」都尚未成为一项全国性的女性权益。为什么争取立法保护女性权益这么困难呢？因为法律作为统治阶级的意志，它优先保护的统治阶级的利益。而「经期假」意味着劳动成本的提高，资本怎会拱手让渡自己的利润呢？尤其是最近，面对经济下滑的形势，资产阶级政府甚至都开始嫌《劳动合同法》碍事了，哪里还会愿意往法律里增加几条保护女工的条文呢？\n\n资本主义工厂对女性身体性的损害还包括长时间劳动。我们看看工厂里女性的工作时间到底有多长。\n\n![20160229.3-c](img/capitalism-and-the-female-body/20160229.3.jpg)\n\n> 1995年开始实行的《劳动法》便规定了工人每月加班时间不得超过36小时，每周至少休息一天（注意，是要连续24小时休息）。法律都颁布了20年了，富士康工人加班时间仍高于36小时，甚至出现了每月120个小时的加班的情况，更有极端情况达到了160小时，这也就意味着该员工平时每天加班3小时，周末要达到每天11个小时，全月无休，才有可能达到这个数字。[6]\n\n其他工厂呢？比富士康更为可怕，《南方都市报》爆出新闻女工为加班发展成吸毒。\n\n> 惠州7名鞋厂女工为加班嗑药提神，最小仅19岁。惠东多名鞋业人士称，惠东有不少鞋厂年轻男女为应对加班，会购买一些止咳水来“提神”，但发展到吸毒的，还是头一次听说。[7]\n\n从家庭到工厂，从农村到城市，这些被奴役的女性身体的病痛、挣扎和反抗是资本主义的征候，它代表着资本主义全面渗透下被压迫被统治的女性的实在创伤，也意味着恢复传统女德的叙述的虚妄。\n\n## 被消费的女性身体\n\n> 资产阶级在它已经取得了统治的地方把一切封建的、宗法的和田园般的关系都破坏了。它无情地斩断了把人们束缚于天然尊长的形形色色的封建羁绊……它抹去了一切向来受人尊崇和令人敬畏的职业的神圣光环。\n> \n> ——《共产党宣言》\n\n我们这一代人对互联网抱有天然的幻想，在媒体的宣传下，互联网似乎是美国六十年代反抗强权与资本所留下的最后堡垒。互联网精神意味着知识的民主化，放佛只要我们连接上网路，就是进入温润的母体可以规避外界的伤害。但「血友吧」的吧友控诉百度的时候却说，「我们能揭穿骗子澄清错误的治疗方法，我们却无法阻止百度把血友病吧卖成钱财」。无疑，现实无情的粉碎了人们对互联网虚幻的想象。今日之互联网已经完全形成资本寡头化，垄断资本掌握着人们接入互联网的入口，这些入口控制我们所获取的信息，而这些信息正是资本所让我们获取的信息。\n\n莆田（中国）健康产业总会发出一份《关于停止所有有偿网络推广的通知》，要求所有会员单位自 4 月 1 日起停止所有有偿网络推广活动。因为百度对「莆田系」医院越来越严格的上线政策，导致「莆田系」很多医院无法再在百度上进行推广。这份通知称，「一旦搜索引擎公司报复性地关闭带头企业账户，总会发动所有力量统一关闭账户，停止合作。」 [8]\n\n2015年，莆田系医院与百度的互相指责，使得百度背后的医疗搜索结果的竞价排名浮出水面。福建莆田市委书记梁建勇曾公开表示：「百度2013年的广告总量是260亿元，莆田的民营医院在百度上就做了120亿元的广告。」[9]百度在中国互联网搜索引擎占比高达80%多，百度的垄断地位使得它成为汉语互联网的入口，控制着网民获取信息。莆田系的民营医院在百度上这些广告投入，控制人们对于身体和病痛的理解。\n\n莆田系医院是指最初以福建莆田发家的民营医院，与公立医院不同，他们形成一个紧密的由数个同乡宗族（姓氏）构成的联盟产业联盟——莆田（中国）健康产业总会，其机构领导亦是国家权力的中心人物。中国共有民营医院12000余家，其中8600余家属于「莆田（中国）健康总会旗下。[10]\n\n马克思在《资本论》中引用邓宁格的话「一有适当的利润，资本就会非常胆壮起来.只要有10％的利润，它就会到处被人使用；有20％,就会活泼起来；有50％,就会引起积极的冒险；有100％,就会使人不顾一切法律；有300％，就会使人不怕犯罪,甚至不怕绞首的危险」。而卖药的收入占比1/3的百度和莆田系，也遵循着这个资本运作的法则。妇科是莆田系民营医院的重要项目，透过与百度的合谋它重新规定了人们对于女性身体的知识。而这种知识使得女性身体变成了被消费被损害的对象。\n\n**一个实例：宫颈糜烂**\n\n![20160229.4-c](img/capitalism-and-the-female-body/20160229.4.jpg)\n\n上图是搜索结果「宫颈糜烂」的百度搜索结果的第一页，其中带有的「V」代表百度的信誉认证，这些标志意味着是付费的广告，普通网民并不能分辨这样V字标识。其中搜索结果第一页共有20条结果，其中广告有12条，其中百度的自家服务有6条。随后几页的搜索结果大抵相同，广告占比50%以上。百度的搜索具有智能的人性化体验，搜索结果的前三条根据你的地理位置，推荐治疗「宫颈糜烂」的当地医院。\n\n搜索结果有百度自家的百度百科「宫颈糜烂」的词条，点开该链接后跳转到词条「宫颈柱状上皮异位」。该词条页面的第一段这样写道:「宫颈糜烂曾经是一个困扰了很多女性的一个疾病。去做体检，几乎是十有八九会被诊断为宫颈糜烂。2008年，本科生的第7版《妇产科学》教材取消宫颈糜烂病名，以’宫颈柱状上皮异位’生理现象取代。 宫颈糜烂，说到底，实际上是过去对宫颈的一种正常表现的错误认识」。但而紧接其下的搜索结果是百度健康的自家服务——“百度健康”中，却在其页面中这样标识：「首页>全部病症>宫颈糜烂」，并提供联系医院的导航：「宫颈糜烂|如何治疗|怎么回事|哪家医院好」。而点击「概况」的「查看全部」，则会转条到搜索结果的第八条，由「国家卫生计生委权威医学科普传播网络平台/百科名医网」提供内容并参与编辑的「宫颈糜烂」的百度百科词条。\n\n这里我们不免发现百度的吊诡之处，自家百科上说「宫颈糜烂」并不是疾病，而是「过去对宫颈的一种正常表现的错误认识」，但在自家的百度健康上却极具误导性的引诱人们去治疗一个不存在的疾病。也许百度面临质询其社会责任的时候，可以为搜索结果中出现虚假医疗广告辩护，这些医疗机构是具有国家承认的相关医疗资质，其责任在监管部门。但百度的百科与健康两个服务对比显示出的荒谬，这种荒谬是资本垄断知识的后果，也是资本为自身增值而不择手段的明证。它用消费和损坏女性身体的方式实现自身利润的增长。\n\n宫颈糜烂只是资本合谋垄断知识从而消费女性身体的一个案例。众所周知，妇科是莆田系医院的重要组成，而「人工流产」也是其主要医疗项目之一。百度的「流产」相关搜索结果，广告占比高达90%，点开任何一个搜索结果的超链接，几乎都可以看到类似的「无痛微管超导可视保宫人流」。而事实上，这些看似有着高科技的名词都存在巨大的误导。「流产」对于女性子宫有着不可逆的伤害，但这些广告却告诉人们堕胎不仅「无痛」没有伤害而且还可以「保宫」。这样的广告不仅存在与百度搜索结果中，很多城市的电台和户外屏幕也被莆田系占领。\n\n![20160229.5-c](img/capitalism-and-the-female-body/20160229.5.jpg)\n![20160229.6-c](img/capitalism-and-the-female-body/20160229.6.jpg)\n![20160229.7-c](img/capitalism-and-the-female-body/20160229.7.jpg)\n\n\n以上三张图是人流广告的典型。资本透过掌握媒体传递这样的信息：人流不仅无害而且保健子宫。这场甜蜜意外，只要梦中三分钟就可以轻松解决爱情的烦恼，当然还有节日和学生特惠价。今天做手术，明天就上班。\n\n医院把「今天做手术，明天就上班」当做一个重要的卖点，引诱懵懂的青少年来消费。但事实上，这样的宣传不仅违背女性的生理规律，更是罔顾法律对于妇女权益的保护：\n\n> 从法律角度来说：流产后的产假是有法律保护的。2012年国务院颁布的《女职工劳动保护特别规定》有新提出：女职工怀孕未满4个月流产的，享受15天产假；怀孕满4个月流产的，享受42天产假。而从医学角度讲，人工流产后由于潜存的风险和机体内环境的破坏避免劳累是很重要的。[11]\n\n由于资本通过媒体进行无孔不入的宣传，加上政府对这种欺骗性行为睁一只眼闭一只眼，所以，这些年来，人流已经十分普及，对许多女性的身体造成不可逆的伤害：\n\n> 中国每年有统计的接受人工流产手术人次多达 1300 万，重复流产率高达 55.9%，并呈现低龄化的趋势。中国每年有 1300 万次人工流产，即使以相对数“流产率”来分析，中国与发达国家相比，也存在不小的差距。流产率通常是以流产数与育龄妇女人数之比。资料显示，育龄妇女流产率最低是的西欧，平均为 11‰，美国波动在 20‰-30‰，而中国高达 62‰。数据表示，中国流产妇女中，重复流产率为 55.9%，其中 3 次以上频繁流产比例为 13.5%，45% 重复流产的时间间隔为 0.5-1.5 年。半年内重复流产、多次人工流产和 20 岁以下人工流产已经占据了高危流产的前 3 位。[12]\n\n这些数据表明堕胎已经成为避孕的一种常规方法，可更为安全的避孕方法—安全套的广告除了在自媒体之外很少见到，这是因为「1989年，国家工商行政管理局发布了《关于严禁刊播有关性生活产品广告的规定》，而1998年更进一步明确:「安全套」(避孕套)是与性生活有关的产品（该规定于2014年被废止）。事实上，资本与权力的合谋构建出这样一种「常识」，让人们以为堕胎是一种常规避孕方法。这种虚假知识服务于医疗资本，把消费和损害女性身体看做是发财的手段。\n\n整形美容也是莆田系的另一项重要营收。人们对于美的认识，往往源自广告与影视作品。这些所谓的美的规则制定者实际上是广告与影视作品背后的资本，而女性自身的内在感受往往被忽略。被资本所规训的女性，她们顺从了资本的所定义的美，并以提供这种美为目标。整形与美容的大规模营收正是这种性别刻板印象的被女性内在化的反映，这种与资本秩序相适应的美的意识形态使得女性把自己的身体「自愿」地变成资本的消费对象。\n\n西蒙娜·波伏娃在《第二性》中写到「他是主体(the Subject)，是绝对(the Absolute)，而她则是他者(the Other)」。资本作为男权社会的主体和绝对，透过社会知识和意识形态想象构成出他者（她）。女性在现实的资本权力结构中将构建的「他者」想象内化成自身，变成资本所需要的消费对象。在当下这个已经被资本全面渗透的社会中，女性不仅成为被剥削的对象，而且还成为资本的消费对象。透过女性身体，资本完成了它的全面统治。\n\n[4]: 对话富士康跳楼幸存女工：每天重复同一动作2880次 [http://news.ifeng.com/shendu/nfrwzk/detail_2011_11/11/10592030_0.shtml](http://news.ifeng.com/shendu/nfrwzk/detail_2011_11/11/10592030_0.shtml)\n[5]: 潘毅、邓韵雪：富士康代工王国与当代农民工\n[6]: 富士康「自愿加班」的真相 [http://www.groundbreaking.cn/yanyi/sannong/1343.html](http://www.groundbreaking.cn/yanyi/sannong/1343.html)\n[7]: 惠州7名鞋厂女工为加班嗑药提神 最小仅19岁 [http://gz.southcn.com/content/2015-09/15/content_132839302.htm](http://gz.southcn.com/content/2015-09/15/content_132839302.htm)\n[8]: 百度加大整治力度 部分\"莆田系\"医院涉嫌违规遭下线 [http://news.xinhuanet.com/2015-03/26/c_1114774029.htm](http://news.xinhuanet.com/2015-03/26/c_1114774029.htm)\n[9]: 俞敏洪炮轰莆田系背后:去年在百度投120亿的广告[http://money.163.com/14/0723/17/A1RT46UB002526O3.html](http://money.163.com/14/0723/17/A1RT46UB002526O3.html)\n[10]: [https://www.zhihu.com/question/28125771/answer/82386968](https://www.zhihu.com/question/28125771/answer/82386968)\n[11]: [https://www.zhihu.com/question/20524320/answer/15391094](https://www.zhihu.com/question/20524320/answer/15391094)\n[12]: [http://6d.dxy.cn/article/105780?trace=related](http://6d.dxy.cn/article/105780?trace=related)"
		},
		{
			"post_id": 16,
			"title": "社会主义者在西雅图再次胜选",
			"date_published": 1454272515,
			"body": "> YCA按：桑德斯的竞选让社会主义在美国社会成为一个热词，人们想要知道社会主义到底是什么意思。但社会主义在美国的兴起在危机之后就开始了，早在2013年的时候，托派政党「社会主义替代」就在西雅图成功竞选市议会席位，少年中国评论网站当时翻译了议员卡萨姆•萨万特（Kshama Sawant）的就职演说。她在担任该职位的两年内，与草根劳工组织密切配合，迫使市议会通过了每小时十五美元的最低工资法案。目前还在继续推动12周带薪育婴假法案，不过由于议会中的民主党多数不同意，尚未通过。去年的市议会改选，萨万特再次胜选。尽管刚刚起步，但「西雅图模式」的确表明，一旦独立的工人阶级政党和群众运动结合起来，改变是可能的。如下是萨万特去年12月在英国《卫报》发表的一篇文章。\n\n---\n\n在美国，有一种明显的抵抗的氛围——对现状的反击。伯尼·桑德斯的竞选运动就是抓住这个氛围。毫不奇怪，「社会主义」是2015年的最热搜索词。\n\n今天的美国青年们并不是在冷战的阴影下成长起来的。共和党的人对社会主义的的诋毁，如果说有什么作用的话，那就是引发了青年们对社会主义的兴趣。同时，很多美国青年们要面对这样的未来：低工资就业市场、学生贷款的激增和日益增加的购房压力。自从占领运动之后，对于很多千禧一代来说，资本主义是肮脏的词，社会主义却并不是。\n\n人们对于巨大的收入不平等和系统性的种族主义有着深刻的愤怒，并渴求一个政治替代方案。这个方案服务于人民的利益，而不是贪得无厌的华尔街。\n\n在华盛顿州西雅图，我们市议员选举中的再次胜利表明了，多数群众渴望改变。在2013年，社会主义替代党（Socialist Alternative Party）第一次胜利的时候，政治和商业机构并没有严肃对待我们。但我们已经表明，一个社会主义者在美国不仅可以赢得选举，而且能够推动一个大城市的政治议程。在这次选举中，商业巨头和他们的政治代理人们针对我们发动了一个大规模竞选活动，动用大量的来自企业的政治献金，并海量散发竞选广告，针对性地污蔑社会主义替代党。\n\n尽管很多民主党的领导们支持我的竞争对手，但大多数自认是民主党的普通群众都支持我公开的社会主义竞选。在这次选举中我们赢得56%的选票，获得了决定性的胜利。我们筹得50万美元，并创造了一个新的记录。这些款项没有一笔来自企业捐款，全部是小额政治捐款——平均每笔捐款只有50美元。\n\n在2013年，人们投票给我，尽管我是社会主义者。而在今年的选举中，许多人是有意识地投票支持社会主义政治。\n\n同样的变化还发生在个人层面。就在几年前的聚会中，当我说我是一个社会主义的时候，往往会使得聚会冷场。而现在，同样的人却对我说的社会主义是指什么感到好奇，而想到在政治上挑战亿万富翁阶级，他们就很兴奋。\n\n随着伯尼·桑德斯的竞选活动的开展，社会主义思想早已超出西雅图，吸引了更多的人。华尔街和亿万富翁对希拉里·克林顿铺天盖地的现金支持，并没有削弱人们对社会主义总统候选人的支持。而桑德斯的竞选刚刚达到一个历史性的里程碑，在没有企业政治献金的情况下，依靠平均每笔30美元的小额捐款筹得200万竞选资金。\n\n与美国相比，欧洲社会主义政党和思想在历史上有很大的不同——社会主义没有在大洋彼岸的那种敌对气息。\n\n但是，在欧洲的恶性紧缩政策和低就业率使得人们感到巨大的愤怒。欧洲的劳动人民在背信弃义的政客和政党们之外，寻找其他替代方案。去年，青年们在公投中对苏格兰独立的支持，还有最近，科尔宾作为一个社会主义者，一跃成为工党领袖。这表明工人阶级和青年正在寻找走出资本主义死胡同的办法。\n\n数以百万计的人开始拒绝亿万富豪阶层的规则，越来越多人在追寻真正的社会主义理念。劳动人民的群众运动是一个关键性因素，它将带领人类离开这个充斥着战争、贫困、难民危机和气候灾难的社会，走向一个新的社会。这个社会可以把我们星球的资源用来让所有人多能过上可持续的高水平生活。\n\n*   **Title:** Of course 'socialism' was most-searched term of 2015: its ideas fit our times\n*   **Link:** [http://www.theguardian.com/commentisfree/2015/dec/19/socialism-definition-most-searched-word-of-2015](http://www.theguardian.com/commentisfree/2015/dec/19/socialism-definition-most-searched-word-of-2015)\n*   **原标题** 「社会主义」当然是2015年度最热搜索词：它的理念契合我们的时代\n*   **作者：** 卡萨姆•萨万特\n*   **译者：** 王小嗨"
		},
		{
			"post_id": 15,
			"title": "台左维新",
			"date_published": 1453062834,
			"body": "1895年，清国战败割让台湾，日本帝国开始在台的殖民统治。1928年，台湾的革命青年们在上海成立「日本共产党台湾民族支部」，主张台湾民族独立、反帝和劳工权益，这些共产党人在台湾组织农会发展新文化以抵抗帝国的殖民统治。当时按照共产国际的要求各国只组织一党原则，台共的最高最高指令都来自日共。因日共在战时被帝国政府迫害而处于瓦解状态，日共台湾民族支部也因此被停滞；1946年，中共台湾籍党员张志忠等人返台组织「中国共产党台湾省工作委员会」。1949年，毛主席领导的中国革命胜利，人民解放军过长江追穷寇，轰轰烈烈的人民解放运动中蒋匪帮退败台湾岛。彼时，台共党人的主张从日据时期的民族解放转成与中国革命相一致的阶级革命。\n\n---\n\n1945年，国府代表盟军接收台湾。衣服破烂的国军渡海上岸之时，就是台湾人民的对「祖国」这个词的幻灭之时，因为那个「祖国」带来的是深刻的压迫。终于，1947年爆发「二二八」运动，陈仪血洗台湾。这个反官僚反压迫的运动，在今天演化成为台湾民族意识的起源。台湾人民对国府的失望变成了对新中国的期盼，一个社会主义祖国，没有压迫没有剥削。 来自「祖国」的红色歌曲，在校园传唱，社会主义成为风尚。1949年，伪ROC政府流亡台湾，开始白色恐怖的殖民统治。举报「共谍」成为那个世代的记忆，那些「年轻的骨头化作了春泥」构成马场町的山。\n\n马场町的山，他们构成了我对恐怖的所有想象。所有的共党人的肉体消灭，所有带有马列共产思想的书籍被焚灭。不要说日剧时代，就是渣滓洞也足以让我们和他们链接在一起。然而，对于生长在红旗下但早已告别阶级斗争学说的我们，「台湾」这个词充满了太多的意义。这个名词首先首先构成了我们大一统的想象，作为一个中国人的想象。不，这是我的想象。作为一个革命者，链接在对岸人民与我之间不是民族共同体的幻象，而是对全球资本主义体系的反抗。从日据到今天，台湾从威权政府到今日。而，我看到的是亚细亚孤儿对不公和不义的反抗，看到了许多可歌可泣的台共党人化作了春泥。\n\n1976年，毛主席逝世。一直到今日，凯歌般的中国崛起。几十年间，中国完成从一个革命之介入到资本之介入的转变。对于台湾，这也意味着「中国」这个词内涵的转变，从革命到殖民。90年代，台湾的政治变得宽松，党外活动变得普遍。以对白色恐怖拷问和社会主义追寻的劳动党得以成立，他们以白色恐怖时期的被迫害者和新时期的劳工们为链接组成。然而，以「祖国」为想象的社会主义，并不与现实为考量。社会主义祖国已经帝国主义化，劳动党的所代表的统派越来越式微。年轻的一代的台共党人，已经越来越脱离劳动党所所代表的统派叙事。从黑色岛国青年到台左维新，到今天我们已经看到的已厌倦台湾两党选举政治的人民所所支持的第三股势力的兴起。\n\n与劳动党失势形成对比的是台湾新左顷青年的兴起。近几年，与全球经济危机一致，台湾的就业率逐年下降。在新自由主义的围剿下，全球的进步势力不得不开始自己的反抗，台湾也不例外。在厌倦两党的选举政治后的2014年，青年学生占领立法院，要求将服贸协议退回行政院。灭火器的「岛屿天光」，传唤青年们「告别妈妈」为「民主的台湾」反抗「欺負咱的人 」。从现场传出的视频，我们得知当时的一小撮岛国青年有合唱国际歌。文化革命期间，有一些青年学生以「太阳花」为标志，我无法断定岛国青年是否延续了文化革命的传统。但我愿意相信，这是台湾人民从反抗白色恐怖到公民政治中，习得到的真谛：这是他们的立法院，不是我们的。\n\n黑色岛国青年这样宣称：「身為這個世代的青年，我們貌似活在自由年代，不必面對白色恐怖的恐懼，但卻也正是在我們這個世代，島嶼逐漸失去過往的綠意蔥鬱，土地與農田被污染、破壞、賤賣，或是蓋起豪宅高樓，遮住天際線與陽光；工業區與煙囪吞噬了海岸線，抹黑天空與雲朵，髒污了空氣；在經濟至上的思維下，台灣人民成為企業主的順服勞動力，動輒超時工作，但艱苦 工作攢來的微薄收入，卻怎麼也追不上物價飆漲的幅度。同時政府仍不斷對企業、財團大開減稅、免稅之門，社會財富一面倒地往天平的另一極堆疊、積累，分配正義淪落為抽象的詞彙。 」。\n\n台湾社运先辈们以牢狱之灾抗争而的民主才得以形成今日青年学生的占领行动，在斗升小民的权利得以侵犯之时而能得以青年挺身而出。岛国青年们对中国国民党所代表的买办集团，说了不，要守护社会分配的公正。注意「马总统」说，学生们既违法法治又违反民主程序。随后，黑色岛国青年阵线号召攻占行政院，群众占领行政院。野百合社运前辈到现场为学生打气。是的，哪里有压迫，哪里就有反抗。\n\n在两党选举政治的遮蔽下，统独议题成为选择政治的主题。今天以[太阳花]学运为主体的青年组成的「时代力量」党团已经成为立法院第四大党团，这也显示新世代与民众对于两党政治厌弃的胜利。台湾工运团体也并未因此沉默。2016年与往年一样，台湾劳工界开始新一次的工斗：工人斗总统。工鬥宣言指出，從選前百日至今，已經發起數十次抗議行動，提出包括年金、長照、約聘僱、醫消護勞權、工會法、國道收費員關廠案等「五鬥一案」，以及反對七天休假遭砍，但藍綠兩黨都是消極回應，非要勞工用盡一切和平陳情手段，使用身體衝撞付出犧牲代價後，才「用擠牙膏的方式回答訴求」，宣言強調，這在在提醒勞工不能寄望單用選票保障權益，必須持續抗爭爭取權益。\n\n作为本岸的青年，面对对岸青年们的风起云涌的运动，那些化作春泥的骨头和此时不低头的骨头。我羞愧的低下头。革命尚未成功，同志仍要努力。"
		},
		{
			"post_id": 14,
			"title": "今日菲律宾左翼",
			"date_published": 1452111566,
			"body": "2009年三月中旬，马克思·莱恩（Max Lane）在菲律宾大学亚洲中心邀请下访问马尼拉，就印度尼西亚立法选举和总统选举发表演讲。他是澳大利亚革命社会主义党（该党于2013年与社会主义替代合并。社会主义替代党也是一个托派政党。——译者注）党员，以及《未完成的国家：苏哈托之前和之后的印度尼西亚（Unfinished Nation: Indonesia Before and After Suharto）》 (Verso, 2008)一书的作者。在访问期间，他也会见了一些菲律宾左翼政治活动家。他接受了《直接行动（Direct Action）》（该报是革命社会主义党的报纸——译者注）编辑Doug Lorimer的采访，不过他强调「他已经六年没来过菲律宾了，而且考虑到这个国家没有左翼出版物，人们很容易感到，他们对菲律宾正在发生的事情的了解，是严重滞后的」。\n\n---\n\n## 你以前和菲律宾左翼有着什么样的联系？\n\n1980年代，我在澳大利亚就参加声援菲律宾运动，并在那个期间去过几次菲律宾。 我积极参与菲律宾团结行动小组和亚太地区反对镇压委员会的活动。1983年，我加入了社会主义工人党，现在它改名为民主社会主义观点（DSP）。去年五月，因为是少数派的一员，我被开除出党了。这个少数派试图建立声援委内瑞拉革命的校园俱乐部。\n\n在1980年代末和1990年代，我尝试建立与菲律宾左翼团体的联系。1980年代，主要是「社会主义思想和行动联合组织」（BISIG，the Unity of Socialist Ideas and Action group），这个组织后来由弗朗西斯科·内曼索（Francisco Nemenzo）领导。菲律宾共产党是反对马科斯独裁统治的主要力量。我们也经常联系他们，但我们感觉在意识形态上，与更多精力放在群众政治运动和民主运作上的BISIG更亲近。当然菲律宾共产党也深入到群众政治运动中，重点放在农村的游击斗争，他们的斗争具有非常强烈的军事化组织的倾向。\n\n在1990年代，在菲律宾共产党的马尼拉-黎刹的地方组织脱离菲律宾共产党后，DSP加强了与它的联系。在1991年，菲共重申长期游击战争是革命运动前进的主线。他们开除了所有反对这个策略的人——这些人就是众所周知的「拒绝主义者（rejectionists）」或者「RJs」（八十年代末九十年代初，菲律宾共产党遭受较大的挫折。政府抓捕了一些核心领导人，内部清洗又造成了部分党员的死亡。面对内外交困的形势，组织内部就党的前途等问题出现了争论。1991年12月26日，党的总书记塞松以Armando Liwanag为笔名发表著名的《重申我们的原则并改正错误（Reaffirm Our Basic Principles and Rectify Errors）》，这篇文章同样在1992年末公开发表于另一份期刊，并在菲共中央委员会中通过，成为 党的官方立场。文章重申对于菲律宾社会的分析以及对长期人民战争、武装斗争和基于农村的战略的坚持，反对把资源浪费在合法斗争上。这篇文章触发了第二次整风运动。反对这篇文章的人被称为「拒绝主义者」，而支持这篇文章的人则被称为「重申主义者」。由于「拒绝主义者」相信合法斗争有一定的作用，以及他们不同意塞松的「斯大林主义」，被强制开除出党。菲共两派的斗争一直延续至今。——译者注）。菲共把所有持不同策略的左翼都打成「假革命」。这些被驱逐的菲共党员分散到几个组织中。一些人成立了新政党，还有一些人组建了NGO或者特定议题的活动组织。\n\n马尼拉-黎刹的左翼势力成立了一个新的基于工会的社会主义中心。这一组织的目标是把工人、城市贫民、青年、等等几种不同的群体的联合起来，所以这个组织也被称为「 一个力量」（San Lakas，One Power），随后成立劳工党（PM，the Party of Labour）。这是一个选举政党。在1990年代特别是1990年代的早期，我们跟他们的联系很紧密。\n\n## 那他们现在是菲律宾左翼的主要组织吗？\n\n在我的印象里，1990年代的菲共分裂的18年后，菲共的「重申主义者」仍然是菲律宾左翼中最大的有组织团体。在菲律宾几乎所有的激进左翼都是「地下」组织。没人感受到马科斯时代那种凶狠的国家镇压已经弱化，非地下活动仍然是不安全的。一些组织仍然在运作武装团体。过去几年中，一直有针对左翼活动者的暗杀行动。左翼普遍认为，这些暗杀行动来自政府安全机构。尽管如此，你还是感受到不同的激进左派组织的力量，因为它们都有与其关联的「地上」组织。\n\n在这些地上组织中，最大的显然是菲共的选举政党「人民优先」（Bayan Muna，Nation First）、其学生团体「菲律宾学生联盟」（LFS），和其他与菲律宾共产党联系紧密的公开组织。在菲律宾大学的马尼拉迪利曼校区，对立的左翼组织承认菲律宾学生联盟要比该校区其他左翼组织大五倍。菲律宾学生联盟是一个战斗性的组织严密的团体。但是，菲共的结盟组织仍然拒绝和其他任何左翼组织合作。\n\n## 菲律宾共产党现在还在增长吗？\n\n与菲共密切联系的组织招募了大量对贫穷和不争议感到愤怒的年轻人。在学术界和新闻工作者中间，他们的支持者也是最多的。但是，他们似乎在近20年内都没有增长。在1980年代后期，他们的规模和影响力都在收缩，而在这之前他们有数万党员。现在他们仍然是最大的激进左派组织，但是已经不能独立领导整个群众运动的复兴了。现在他们把主要的精力都放在农村。\n\n## 劳工党和其他的拒绝主义者怎么样？\n\n他们非常积极的把许多拒绝主义者整合到一个统一的战线里——「群众力量」（ Laban ng Masa，Power of the Masses）。这个统一战线成立于2005年，汇集了劳工党的力量和其他一些从CCP出来的拒绝主义者，还有如BISIG等非菲共组织。BISIG也是泛左翼选举组织公民行动党（Akbayan）的一部分。在过去的几年里，这些拒绝主义者能够组织好几次联合动员。其中的许多行动都是对主要的资产阶级政治发展——尤其是前副总统阿罗约赶走当时的总统艾斯特拉达的政变——的回应，以及其他一些尝试，有时候是抗议军官罢免阿罗约政府的政变。\n\n群众力量（Laban ng Masa）的成立是菲律宾左翼迈出的重要一步，因为这在之前的差不多十年里，拒绝主义者都无法形成任何持久的政治联盟。当1990年代早期「民主社会主义观点」开始与劳工党紧密合作时，情况跟「群众的力量」完全不同。\n\n## 「群众力量」现在仍然是联合左翼行动的一极吗？\n\n我跟「群众力量」的召集人弗朗西斯科·内曼索（Francisco Nemenzo）以及联盟中的其他几位领导人进行过谈话。其中包括来自最近成立的政党菲律宾劳动群众党（Partido Lakas ng Masa）的索尼·梅伦肖（Sonny Melencio ），劳工党的威尔逊·福塔雷萨（Wilson Fortaleza ）,BISIG的罗纳德（Ronald Llamas）。大家的共识似乎是，「群众力量」（至少目前）已经陷入了困境。一些组织已经分裂，造成紧张关系，使得联盟很难一起开会。然而，现在还没有组织离开「群众力量」。复苏也是有可能的。\n\n## 所以，拒绝主义者的合作遭遇挫折了？\n\n尽管困难是显而易见的，但我不知道「挫折」一词是否正确。「群众力量」的成员组织出现了一些分裂。从所有人谈到的，以及我能观察到的，客观形势出现了明显的困难。人们都告诉我，左翼工会瓦解了，主要是因为1997-1998年亚洲金融危机时许多工厂关闭了，当然，雇主们也愿意把工会化了的工厂关闭，搬到其他地方去。外包也削弱了许多工会化的工厂。\n\n一些组织的工作重心已经转移到组织城市贫困的半无产阶级上了。其他一些组织仍然致力于组织雇佣工人，不过是工厂工人们居住的社区，而不是在工厂里进行组织了。我交谈过的所有人都承认，多年来一直试图激发大规模动员，作为驱逐阿罗约政府的各种尝试的一部分，导致了对基层组织的忽视。同样显而易见的是，没有任何形式的自发抗议活动，这与其他国家比如印度尼西亚是不同的。他们还说，动员人民参与传统的左翼动员日如五一节，也越来越困难了。\n\n看起来，关于阿罗约总统多么拼命想要保持权力以及群众应该如何应对她的极端行动所挑起的政治危机（比如宣布实施戒严法，或者中止总统直选而将其交给议会完成）等问题，人们的看法是不同的。然而，资产阶级政治精英中的分歧，看起来更多是派系竞争，而不是资产阶级内部的局部利益之间的裂痕。\n\n## 「群众力量」组织有任何重大的分裂吗？\n\n一个力量—劳工党是最大的一个正在经历分裂团体。该党已经分成两个的不同组织流派。其中一个组织就包括了它的领导索尼·梅伦肖（Sonny Melencio ）。他在澳大利亚相当出名。这个组织最近刚刚形成了一个新的政党「劳动群众党」（PLM，Partido Lakas ng Masa）。另一个有组织的流派，通过劳工党组织起来。该党成员包括「 一个力量」(San Lakas，One Power）的主席威尔逊·福塔雷萨，并且继续得到菲律宾国会中劳工党议员的拥护。我交流过的多数左派都认为，分裂双方有差不多人数的积极分子。由于缺少菲律宾左派出版物，使得我们很难——尤其只是在一次短暂旅行之中——对跟劳工党（PM）保持一致的人与跟劳动群众党（PLM）保持一致的人之间的政治差别有一个清晰的认识。他们之间就如何处理党和群众的组织的关系，客观政治形势（发动驱逐阿罗约政府的斗争的条件是否存在），左翼的战略导向应该是在近期推翻政府还是基础的党建工作；社会主义政府或者劳动人民 政府的口号是否可以被用作鼓动口号，或者首要任务是否是在基层促进单一议题的斗争等等问题，存在着争议。内部制度方面的问题也被提出来了。尽管两边都说他们想做更多的基层组织工作，但劳动群众党的同志宣称兵变加上群众动员是近期前景。劳工党的同志认为，发动驱逐阿罗约政府的斗争的条件尚不具备，而主要应该通过改良劳动人民生活条件的基层斗争的实践来赢得人民，发动群众行动和进行党的建设。然而，从两边所说的情况来看，我并不清楚这一差异在分裂中或者在两个组织的实际工作中有多大的重要性。\n\n在这两个团体之间，以及在所有其他的团体之间，都存在一个争论，即是否「允许」在地方和国家层面与精英政客进行选举合作。如果可以，这一合作应该在什么样的基础上进行。菲律宾的选举制度按照这样一种方式设计，好让任何有足够民众支持的左派政党都不能赢得席位，除非是有某些精英政客让他们的支持者也去为左派候选人投票。这主要是左派政党安排的，而它使得「重申主义」和「拒绝主义」的左派政党在马科斯倒台后所有议会选举中，都赢得一两个席位。出现的讨论的一部分，不仅围绕这样的战略对促进左派政治在大众中的传播是否有帮助，而且也围绕着这些能够引得议会席位的左派领导人是否能够做一些有用的政治工作。\n\n似乎大家都同意一些叛乱军队在朝左的方向发展，但对他们能够做什么或者可能会做什么，则有不同的评估。关于这些问题，我对情况知道得不够多，提不出什么见解。\n\n- **Title:** The Philippines left today\n- **Link:** http://directaction.org.au/issue10/the_philippines_left_today\n- **译者：** 王小嗨\n- **校对：** 黑夜里的牛"
		},
		{
			"post_id": 13,
			"title": "哲学的党性——列宁哲学的一种辩护",
			"date_published": 1407355689,
			"body": "**摘要：** 列宁关于哲学的基本论点，全部哲学都是有党性的，或者唯心主义立场，或者唯物主义立场。以往，学界对于列宁哲学论点的批判，多是简单粗暴地论断其为对西方哲学传统的破坏，或者是从神圣「人性论」的角度进行嘲讽。通过梳理西方传统哲学的本体论传统，得出列宁的哲学论点是对哲学传统最好的扬弃；而当代哲学，从拉康的自我形成机制到阿尔都塞的意识形态国家机器的传唤，则反击了「人性论」对「党性」的纠缠。列宁关于哲学党性的论点不仅没有泯灭哲学的意义，反而是一种新的自觉的哲学实践的开始。\n\n---\n\n>全部哲学史就这样成了一个战场，堆满着尸骨；它是一个死人的王国，这王国不仅充满肉体死亡的个人，而且也充满已经推翻了的和精神上死亡了的体系，在这里，每一个杀死了另一个，并且埋葬了另一个。……哲学史的事实并不是一项冒险的行为，一如世界的历史并不只是一些浪漫的活动，换言之，它们并不只是一件偶然的事实，迷途骑士漫游事迹之聚集：这些骑士各自为战，无目的的挣扎，他们的所有努力，都没有效果。\n>\n>——黑格尔，《哲学史讲演录》，卷一（贺麟、王太庆译文）\n\n在任何资产阶级的意识形态国家机器下谈列宁的哲学都是不合时宜的，因为真理的光芒是刺眼的。列宁写道：「最新的哲学像在两千年前一样，也是有党性的。唯物主义和唯心主义按实质来说，是两个斗争着的党派」。在公共场合，任何哲学家或者哲学工作者若是不以「战斗」的姿态、用恶毒的人身攻击的方式来诋毁列宁的哲学论点，似乎就不足彰显自己哲学的普世性。他们组成反动堡垒狙击列宁的哲学论点，目的只有一个：「凌驾」在唯物主义和唯心主义之上、超越它们之间「陈旧的」对立。但事实上，哲学家们「每时每刻都在陷入唯心主义，同唯物主义进行始终不渝的斗争」，所有努力的客观作用，就是成为意识形态国家机器的一部分，即哲学意识形态。\n\n列宁发现了马克思和恩格斯的辩证唯物主义对传统西方本体论哲学一个真正的超越，亦即哲学的党性。关于马克思对于哲学的发现，阿尔都塞有一个著名的论断：马克思主义哲学不是一种新的哲学（实践哲学），而是一种新的哲学实践，一种基于无产阶级党性立场的哲学实践。哲学只是作为一门没有对象的学科，以往，意识形态工作者们依据他们服务的阶级（很多人并不知晓他们在为其服务）的教诲，把哲学圣神化，他们的工作是在意识形态内部用意识形态话语把自己的意识形态神圣化、普世化，狙击科学工作的前进。而列宁公然指出了这一显而易见的真理，他们恼羞成怒地妄图用他们从陈旧的启蒙哲学中掏出的一些闪闪发亮的黑色粪球来螳臂挡车，可稍稍具有常识的人们只会认为他们的大粪球的抛物线轨迹是优美的。\n\n列宁的论点，所有的哲学都是有党性的，它或者直接表述自己的立场，或者通过反击相反的立场来彰显自己的立场。绝大多数的哲学家或者哲学意识形态工作者们都要千方百计要宣称或者证明自己的无党性，而他们的无党性不过是党性的一种。依据列宁的教诲，作为一个坚定的马克思主义的无产阶级战士，有必要向所谓“无党性”宣战，这算作哲学实践的一种。\n\n## 1、本体论与哲学\n\n长久以来由于国朝马哲学界对本体论的错误解读而形成一个激烈的争论：马克思主义哲学到底是一种怎样的本体论？在这场争论中，马克思主义哲学被指认为各种本体论，其主流为物质本体论和实践本体论。争论里的马克思主义哲学已经被指认成一种本体论哲学，被误认的马克思主义哲学因此被湮灭在西方哲学传统中。通过梳理西方哲学与本体论的关系，方能传唤出本体论在国朝马哲学界里迷失的所指。\n\n回顾西哲史，哲人们总是在以体系对抗体系的方式展开各种战斗，而这些所谓的体系就是本体论。本体论哲学区别于其他哲学的特点在于，认为存在一个超越经验世界的秩序，它是绝对精神，是逻各斯，是存在，它是传统西方哲学体系的一切。由于西方哲学发展路径的特殊而产生的本体论，是哲学的一种特有形态。从本体论的完整发展形态看，它是把系词「是」以及分有「是」的种种「所是」(或「是者」)作为范畴，通过逻辑的方法构造出来的先验原理体系。国朝学界大有对本体论忘文生义而把它当作关于世界本体或者本原的学问，这样一种理解直接导致对马克思主义哲学的错误阐述。\n\n对于西方传统哲学，阿尔都塞在《哲学和科学家自发哲学》中把哲学家称作远离一切实践的知识分子：「他们想要隔着这段间距，用自己的词语掌握实在，把实在嵌入系统。词语复词语，体系复体系，而世界一如既往继续它的进程。这种理论话语对其他方面的实际工作（科学、艺术、政治等方面的实践）无能为力。哲学：它的企图弥补了名号上的缺陷。这种企图生产了漂亮的话语。」通过对照俞宣孟先生给出的本体论定义，显然可以看出上面关于哲学是「词语复词语，体系复体系」的说法是在本体论意义上的。那么，「哲学的党性」则是把马克思主义哲学的功能和任务理解为自觉抵制建立本体论体系解释世界的诱惑，并主动打击理论危机下不可知论的一时泛滥；马克思主义哲学拒斥本体论，对唯心主义体系国王的僭越，使得现代君主有了革命的武器。\n\n黑格尔哲学作为传统西方哲学的集大成者，他的哲学体系不仅超越之前的体系，而且据称可以包涵一切，它覆盖自然和宇宙，又覆盖人类个体和人类文明。这样无所不能的「客观逻辑」是从「有」的概念推演而来。这样的体系不是从现实出发解释世界，而是从概念出发解释世界。很显然，这个宏伟的逻辑体系本身就是唯心主义。马克思主义哲学开创人对黑格尔哲学的批判是在「唯心主义」、「思辨哲学」、「哲学体系」这样的词语下进行的，很少使用「本体论」这个概念。但黑格尔的逻辑体系显然是一种本体论，马克思主义哲学在这里拒绝开创一种新的哲学(本体论哲学）来抵抗黑格尔哲学，哲学的党性使得哲学实践从这里开始。\n\n马克思主义哲学的产生在西方哲学史中是一个坐标事件。这一变革是通过对德国古典哲学的弃扬实现，放弃以形而上的逻辑体系解释世界的企图，由此传呼的革命弥赛亚亦即唯物主义得以占据唯心主义消失之后出现的空场，使得用科学解释社会得以成为现代君主的武器。而科学的方法论也得以从意识形态的牢笼挣脱出来，从而使得从抽象逻辑概括世界的黑格尔式一元矛盾跃变成真实世界多元矛盾的过度决定。只有理解马克思主义哲学对黑格尔唯心主义体系的批判主要是批判本体论哲学，才可能进一步理解恩格斯所说的今后“不再需要任何凌驾于其他科学之上的哲学”等论断。\n\n据此，我们知道列宁关于哲学党性的论点不仅没有抹杀哲学的意义，却使马克思主义在哲学的「战场」有了明确指向，即消灭哲学意识形态。\n\n## 2、无意识主体、意识形态国家机器及党性\n\n陷入到「党性」中而做困兽犹斗的哲学工作者们，总是用党性毁灭「光辉的人性」来对我们共产党人加以嘲讽。然而，从1965年到1967年出现的当代知识史上的大爆发，阿尔都塞《保卫马克思》、拉康《文集》和德里达的三部著作等等的出版，形成的结构主义的视野把自启蒙时代而来由迪卡尔塑造的统治我们头脑的人的主体被彻底解构，彻底变革了人们对于自我意识的认识。这场运动被阿兰·巴迪欧称为哲学史上的最伟大变革之一。在「主体」已经被解构以后，继续谈论「人性」无疑和在量子力学时代按照经典力学讨论原子里的电子运动一样可笑。从拉康的无意识主体到阿尔都塞的意识形态国家机器，无疑毁灭性打击并热烈的嘲讽了以「人性论」攻击党性的论点。\n\n### 2.1 无意识主体：虚假的「自我」\n\n弗洛依德开创了精神分析学说。阿尔都塞在《弗洛伊德与马克思》一文中评价说，就像马克思主义经济学拒绝了「经济人」一样，弗洛依德的精神分析拒绝了「心理人」（不再提倡虚假的「自我」）。弗洛依德之后最著名的精神分析哲学家雅克·拉康，不仅以现代结构主义和语言学重塑了精神分析，更使得人们对于「自我」的认识不再沉湎在泰西哲学的神话叙述中，并对「自我」及其形成机制开始有了科学的研究。\n\n在当代，拉康是第一个宣布个体主体的「自我」死亡之人，他杀死了施蒂纳的「惟一者」，从主体性构建的虚假性的角度解构了「人性」，从而使发端自启蒙时代的整个人本主义的基根陷入根本性窘境。依据拉康的学说，个人之自我的形成，发生于一种虚假的强制性自我认同。在镜像中的虚假认同，是一种自恋式的虚假认同。当婴孩在镜子中看到相对稳固的自我影像，即误将其认同为「自我」。自我对于镜中想的误认是的开始，紧接着是命名，即个人奴隶般地被迫对一个符号( 家庭意识形态的传唤) 的认同。你一生下来，家人就叫你王小嗨，你就成为了王小嗨。人们对王小嗨有太多的期望，王小嗨应该成为听话懂事的孩子，他应该好好学习天天向上，王小嗨应该像父亲一样成为一个画家。你被传唤为一个家庭意识形态需要的「王小嗨」。这就是大他者传唤的结果。这就是说，人在开始学习语言时就已经处于一种暴力规训之中，从没有什么所谓符合「人性」的个人，只有他者传呼特定符号时形成的被误认的「自我」。主体在接受名字时候，就已经按照大他者的规训来塑造「自我」。进入语言维度的主体，本质上被结构成一个无意识主体。像语言一样被结构的无意识主体，意味着无意识主体不再是特殊的个体经验的层积，而成为一种超越个体的存在。被无意识的语言结构支配的主体不再真正存在，而「自我」也不过是无意识的表征。更进一步，无意识主体对应着语言结构的大他者。至此，作为主体的人回归到「社会关系的总和」。\n\n### 2.2 意识形态国家机器传唤的党性\n\n在《意识形态国家机器》里，阿尔都塞从生产关系的再生产角度，首先来阐述「镇压性国家机器的作用——就它是一个镇压机器来说，本质在于用（肉体的或其它形式的）武力来保证生产关系（说到底是剥削关系）再生产的政治条件。国家机器不仅为自身的再生产（资本主义国家内部的政治王朝、军事王朝等等）不遗余力，而且首先要运用镇压（从最野蛮的肉体施暴、到纯粹的行政命令和禁令，直到公开和隐蔽的审查制度）来保证意识形态国家机器运行的政治条件。」除了经典马克思主义国家理论的镇压机器，阿尔都塞开创性地阐述了「意识形态国家机器」。和只有一个的镇压机器相比，意识形态国家机器有多个，它们或者属于「公共」的，或者属于「私人」的机构（学校、家庭、教会、公会、电视报纸等等）。镇压机器通过暴力、物质力量发挥作用，而意识形态国家机器能以意识形态的方式发挥作用。最后，作为整体的国家机器完成对生产关系的再生产。\n\n因为意识形态国家机器通过运用意识形态来发挥作用，所以如果统治阶级不能确立自己在意识形态国家机器中的领导地位，以维持生产关系的再生产，则不能确保统治地位的稳固性。毛主席领导的中国革命胜利后，一直在改造现代社会意识形态的重要生产工具——学校，通过打碎旧有的教育工具，创制新的教育工具，革命政权得以维系革命正当性并培养革命接班人。革命不在于推翻了反动政府，而在于创造了一套新的意识形态国家机器。而作为资产阶级革命的法国大革命，不仅在于要把国家政权从封建贵族的手中转移到资本主义的商业资本家手中，打碎了一部分暴力性国家机器再建立一部分新的暴力性国家机器，而在于粉碎了作为封建社会头号意识形态国家机器的教会。此后出现的民间教会，即是新的意识形态国家机器的创制，而作为君主则有意或无意对意识形态国家机器做出了裁决。\n\n拉康的「虚假」自我形成正是由于大他者（意识形态国家机器的一种）的传唤。按照阿尔都塞对马克思的意识形态的解读，意识形态一般是一种无历史的、共时性的、对「现实的真实关系」的想象。主体对于意识形态才有意义（误认和想象），具体的意识形态国家机器按照生产关系再生产的需要，使具体的个人（我们所有个人）误认成具体的虚假「自我」方能完成意识形态的再生产。如果我们同意先不谈论「人性」，即对未出生的孩子寄予期望的家庭意识形态，所以，甚至在出生前，孩子从来都是一个主体。「王小嗨」要继承父姓，要成为一个画家，在这样特定的家庭意识形态的模子里被认定为这样的主体，从还未被孕育，就有人按照这个符号来塑造「王小嗨」。「王小嗨」并由此获得一个身份，成为被传唤出来契合再生产的不可替代的人。\n\n如果我们只能按照统治阶级的意识形态国家机器来传唤、规训而形成主体，而生产关系的再生产照常运转，世界就不会有变革。事实上，意识形态国家机器并不是铁板一块。依据马克思的教诲，意识形态归根结底产生于与之相适应的物质基础。可以得出这样的论点，即现实阶级斗争的一种，就是对传唤具体个人为具体的某阶级而服务的各种意识形态国家机器对于占据具体个人的抢夺战。事实上，资本主义工业大生产与私有制之间的矛盾已经传唤出无产阶级的革命的意识形态国家机器——无产阶级先锋队即现代君主。哲学作为一个至关重要的意识形态战场，接受资本主义主流意识形态国家机器传唤的哲学家个人，必然要捍卫资产阶级的意识形态国家机器（哲学意识形态）的普世性，以此彰显所谓的「无党性」。「无党性」其实是党性的一种（因为或者彰显党性无非就是资产阶级党性就是无产阶级党性，或者泯灭党性存在）。那么假如在资产阶级占统治地位的资本主义社会里，坚持「无党性」立场，无疑不知不觉中就会成为替资本主义统治稳固添砖添瓦的一份子。意识形态的作用就是让人们沉浸在想象的关系中而不自知。与党偶然相遇的知识分子，被党的意识形态传唤并不是一下子就能摆脱小资产阶级的意识形态，成为有机知识分子意味着必然要摆脱自己的成长所带来的一切，也就是在这个意义上，阿尔都塞教诲我们说，在哲学上成为一个马克思主义者是困难的。而在阶级斗争中成长起来的无产阶级战士天然有一套与之相伴的物质关系，这种物质基础必然孕育着唯物主义，他们天然比较容易接受符合无产阶级党性的哲学。\n\n**参考文献：**\n\n[1]俞宣孟，本体论研究（第三版），上海人民出版社，2012\n[2]阿尔都塞，哲学与政治，吉林人民出版社，2004\n[3]吴琼，雅克•拉康，中国人民大学出版社，2011"
		},
		{
			"post_id": 12,
			"title": "生活就是一场战斗",
			"date_published": 1382472317,
			"body": "***This land is your land***\n\n***This land is my land***\n\n许多大哥发来新工人乐团的新专辑《家在哪里》，第一时间下载听了，感动不已，热泪盈眶。早就过了多愁善感的年纪了，也许说流泪矫情，但你们的歌让我回忆起在那些简单充实在工厂的日子里。那时，每天天还不亮就吃完妈妈起早做的早饭，然后穿着夏天海边返到岸上的雾气，揣着几块零钱去赶公交。车间里蒸气浓浓，眼镜经常会变白，每天十二个小时面对一大桶一大桶的「料」和一个沉默的机器，一天里最开心的时候是和我师傅姐姐聊天，她教我怎么偷懒怎么不被车间主任发现在玩手机。下午下班，天已经蒙蒙黑了，一身酸臭在月亮和星星下走回家。每晚要看完《政治经济学概论》后，听完张广天老师和新工人乐团的歌才能入睡。工人的生活就是困难。\n\n---\n\n伴随凯歌式工业化进程的是3亿生活在这片土地上的人们被帝国的铁蹄裹挟制造着大国崛起梦，有多少人在为遍布这颗星球的廉价工业品欢呼，又有多少人在CCTV的生活里幸福着。然而，商品的后背，背井离乡的工人们，他们在中国梦里失语。穿着漂亮衣服的帅哥靓女，嫌他们脏；活在自我想象里的小资们，说他们是人渣说他们是剩余的人。「他们身上穿着漂亮的衣服却总也看不起你，究竟是谁养活谁，他们总是弄不清」。他们的生活，他们的喜怒哀乐，他们的诉求，总是淹没在非诚勿扰的相亲节目里。还好，有你们在歌唱，唱出了工友们的辛酸苦辣。\n\n孙恒以前是个老师，辞了工作，孤身一人到了北京。他们靠一张唱片起家，在皮村办起了农民工子弟小学。这故事看起来好像是一个中国梦的成功典型，但《家在哪里》，却道出孙恒的梦想是所有人都能幸福的生活，不是唱歌出名不是发家致富。新专辑说出了这个时代的征候，大批农民进城生产生活生儿育女，他们要面对城市的冷漠和鄙夷，家乡的美好再也回不去。进城的工人们的梦想是那么简单和善良，只要你们不要看不起我们，只要给我们和城里人一样的社会保障，只要给我们的孩子一个学校读。前进的蹄铁从来也不会顾及和怜悯这些可怜的要求，歌里的工人们在觉醒，权利从来都不是从统治阶级那里同情施与的，「聚在一起是一团火」，斗争斗争！\n\n步行街音响里的《最炫民族风》，山寨机的两个喇叭里的《阿姐撸》，无情的解构和亵渎掉资本阶级和小资产阶级音乐的圣神性。然而生活在吵杂喧嚣具有后现代意义音乐的新生代工人，是找不到身份认同感的，他们需建构自己的意识形态。作为新时代的工人阶级主体的农民工，他们既不能想象自己怎么会是那个宪法里有着神圣地位的工人阶级，也不回到家乡那早已被资本集约化农场占领的田间。「你的家到底在哪里？你的家到底在哪里？」像是一句撕心裂肺的呐喊。一个自在阶级向自为阶级转换，首先要获得文化的认同感，工人同志们需要属于他们自己心中的歌唱。今天，孙恒许多他们这些工人艺术家，已经开始了这个伟大的工作。在资产阶级制造的庸俗文化和小资产阶级无病呻吟充斥的时代，属于工人的声音显得那样弥足珍贵。让我们的手机、音乐播放器和电脑等数码设备热情拥抱这些歌唱吧！\n\n他人经受的，我必经受。多少劳动多少建设，你脏脏的背影说出来全世界的繁华和苦难。我是一个工人，工人的生活是困难的。今天，听到这些歌曲自行惭愧，还有那么多工作没有做好，还有那么多字没有认识。成熟起来，为了生活，为了无产阶级。知晓真理的人们在构建人间天国的路上并不孤独，那些骚动资本家和走狗们大腿小腿的渺小征人们，那些天还不亮就要做工的苦痛工人们，都陪伴着我们一起经历着各种理论、历史和生活的冒险。同志曾经告诉我，一个人能独自地战斗和生活，是幸福的。是的，生活就是一场战斗。「雄关漫道真如铁，而今迈步从头越。聚在一起是一团火，散开之后是满天的星星。」"
		},
		{
			"post_id": 11,
			"title": "本体论概论",
			"date_published": 1375646592,
			"body": ">哲学家总是无谓自扰。他们是脱离实践的知识分子，远离一切事情。他们的话语无非是对这种距离的评注，以及抵赖。他们想要隔着这段间距，用自己的词语掌握实在，把实在嵌入系统。词语复词语，体系复体系，而世界一如既往继续它的进程。这种理论话语对其他方面的实际工作（科学、艺术、政治等方面的实践）无能无力。哲学：它的企图弥补了名号上的缺陷。这种企图生产了漂亮的话语。\n>\n>——**路易·阿尔都塞《哲学和科学家的自发哲学》**\n\n通过阅读俞宣孟的《本体论研究》，显然可以看出上面菩萨关于哲学是『词语复词语，体系复体系』的说法是在本体论意义上的。那么，『哲学的党性』可以理解为自觉抵制建立本体论体系解释世界的诱惑，并在主动打击理论出现危机时不可知论的一时泛滥；马克思主义哲学拒斥本体论，对唯心主义体系国王的揩跃，使得现代君主有革命的武器。那些宣称马克思主义哲学不是哲学的人们，当然他们也是在本体论意义上这样宣称的，只是不自觉的证明了『哲学是理论上的阶级斗争』罢了。\n\n---\n\n以下是对俞宣孟《本体论研究》（第三版）第一章的摘抄，可以大概了解本体论的含义。\n\n## 基本特征\n\n…\n\n由此我们得出初步的印象：本体论是探讨『是』以及各种『所是』的范畴间的互相关系的学说，其中『是』包括着一切一切『所是』，一切『所是』都是从『是』中产生出来的。\n\n…\n\n所谓『产生』其实是逻辑形式的演绎过程。….《大不列颠百科全书》说：，『本土论是走向关于诸是者之本质的必然真理的演绎的学说』；《美国百科全书》说，本体论之所以运用范畴来表达，是为了讲『实在』纳入『形式逻辑的法则』。\n\n…\n\n…在《大不列颠百科全书》的条目中更是明确指出，本体论是『关于「是」本身，即关于一切实在的基本性理论或研究』。\n\n如果说关于『是』的学说的本体论同时就是关于实在的学说，那么，本体论所谓的实在绝不是经验的实在，而是超验的（a priori）的学说。\n\n***P18***\n\n在西方哲学史上，凡是本体论，都是活动再这片先验的领域中、并且以之为对象的。这片先验的领域最初是由柏拉图设立的，称之为理念世界，它与我们的表象世界是分离存在的，然而它却是表象世界的本质、原理。在黑格尔这里，这片领域称为绝对理念或者绝对精神，黑格尔虽然不同意在绝对理念和我们表象世界之间的有不可逾越的鸿沟，但他同样认为，绝对理念是纯粹的原理，自然界和人类社会的一切表现都是绝对理念的外化或展开。这样的原理由于不是从经验中得出的认识，而是先于经验的、它必定是从概念到概念构造出来的体系。\n\n***P19***\n\n康德是反对本体论的。他对于自己所反对的那个本体论的理解，与我们上述的理解是一致的。在《纯粹理性批判》一书中，他把狭义的形而上学分为超验哲学（transendental philosophy）和纯粹理性的自然学（physiology of pure reason），『前者，是在不考虑可能给予的对象，而只是涉及一般的原则及一切概念的体系中，只研究悟性及理性本身（ontologia，本体论）』。\n\n本体论就是这样与经验世界或者先于经验世界、绝对精神、纯粹理性的领域，它是纯粹的原理，『第一哲学』。\n\n正因为本体论是先于经验的纯粹原理，这些原理从理论上讲就不是人主观设想出来的，而是概念自身逻辑运动的结果。对此，黑格尔做了如此概括：『这种精神的运动，从单纯性中给予自己以规定，又从这个规定性给自己以自身同一性，因此，精神的运动就是概念的内在发展：它乃是认识的绝对方法，同时也是内容本身的内在灵魂。——我认为，只有沿着这条自己构成自己的道路，哲学才能够成为客观的、论证的科学。』在本体论哲学家看来，正是概念的逻辑运动，才保证了这套原理系统作为真理的客观性和普遍必然性。\n\n***P19***\n\n所谓本体论就是运用以『是』为核心的范畴、逻辑地构造出来的哲学原理系统。它有三个基本的特征：\n\n- 1.从实质上讲，本体论是与经验世界相分离或先于经验而独立存在的哲学原理系统，这种哲学当然应归入到客观唯心主义之列；\n- 2.从方法论上讲，本体论采用的是逻辑的方法，主要是形式逻辑的方法，到了黑格尔发展为辩证逻辑的方法；\n- 3.从形式上讲，本体论是关于『是』的哲学，『是』是经过哲学家改造以后而成为的一个具有最高、最普通的逻辑规定性概念，它包容其余种种作为『所是』的逻辑规定性。Ontology因之而得以命名，即它是一门关于『是』的学位，其浇适当的一民工应为『是论』。\n\n***P20***\n\n## 宇宙论或自然哲学\n\n哲学的宇宙论和自然哲学都是以我们周围的世界、自然界为对象的，宇宙论尤其是以宏观的宇宙为研究对象的…..事实上，当初的自然哲学所思考的问题，绝大部分已经为今天的自然科学所取代，如果还有所剩余，那大概就是科学方法论，或者自然辩证法。但科学方法论或自然辩证法仍然是以经验科学为基础的，这就同本体论有了明显的区别。不能科学方法论无法取代本体论，本体论从其自尊自大的气概方面说，到时要将包括科学方法论在内的一切理论包容在自己之中，如黑格尔的《逻辑学》同他的《自然哲学》的关系一样，不管这种企图是否成立。\n…\n\n自然哲学、宇宙论都是有特定的研究对象的，因而是、或最终可以是经验的；本体论作为纯粹的哲学原理，则不以任何特定事物为对象，因而只能是在经验之外的，是逻辑的。…\n\n本体论所在的逻辑领域与经验世界是两个完全不同的、具有质的差异的领域。\n\n***P20-P22***\n\n## 哲学基本问题\n\n由恩格斯表达的哲学基本问题，即物质与精神孰先孰后以及思维与存在是否具有同一性，明显是反对本体论的。可以说，正是通过对本体论的批判，马克思主义哲学实现了西方哲学史上革命性的变革。但是，也许是由于马克思主义批判以黑格尔为首的旧哲学的时候，很少提到本体论这个词，更是由于我们对本体论之为何物研究得不够，竟至于有本体论与为了批判本体论而提出来的哲学基本问题混淆起来的现象。…\n\n哲学基本问题的第一方面，即提出物质与精神孰先孰后的问题，明显是反对作为先验原理系统的本体论的，这点，即经点明了本体论是怎么回事之后，也许不必去多作论证了。我们在此略为多说几句的是关于哲学基本问题的第二方面，即存在与思维是否有同一性的问题，它与本体论有关系。按本体论作为纯粹的原理、是与经验世界的隔离而言，它的确存在着问题：原理世界是如何作用于现象世界的？在经验世界中的人又怎能认识那种原理？正是这些问题，激发了西方近代哲学对认识论问题的思考。其结果是，一方面出现了像休谟、康德这样的不可知论，他们否定彻底认识世界的可能性；另一方面，大多数哲学家则作出了肯定的回答，其中包括黑格尔。但是黑格尔的理由是，人的认识也是绝对精神的体现和展开，因此，思维能够认识那一开始就已经是思想内容的内容，对他来说没什么奇怪的。所以恩格斯批判说：『在这里，要证明的东西已经默默地包涵在前提里面了。』这里，我们体会到，哲学基本问题第二个方面所针对的，除了不可知论，主要是本体论的基础上在唯心主义基础上的思维和存在同一论。事实上，马克思主义正是通过对以本体论为主要内容的黑格尔哲学的批判才得以创立的。这种批判直指本体论的唯心主义实质，还兼及本体论所使用的脱离生活的特殊语言王国。因此，把本体论与马克思主义概括的哲学基本问题相混淆，将会产生严重的理论错误。\n\n***P23-P23***"
		},
		{
			"post_id": 10,
			"title": "千万不要忘记阶级斗争",
			"date_published": 1291579236,
			"body": "有那么一次坐火车的时候，火车每次到站报完站后面都会加一句各位旅客请注意你的随身物体安全，然后旁边的老大爷笑呵呵的说以前的时候啊说完话都要加一句千万不要忘记阶级斗争，后来人民都麻木了，说到最后都不知道为神马加那么一句话了…是啊是啊，我们真的麻木了，不然那帮走资派怎么会…唉。。。可是喊口号是真的不能解决问题的，关键是用马克思主义分析问题解决问题。\n\n---\n\n互联网时代风起云涌的各种姐各种哥各种话题，我们不排除资本权力炒作的可能，但web2.0时代的话题更多的是碎片化的信息通过社区，SNS，微博等技术手段聚集起来。也就是说这些话题产生是整个社会无意识的喧嚣，像《网瘾战争》就是不挑战制度的消极对抗了。大他者的意识形态是由社会经济政治决定的，也就说神马样子的底层建筑决定了上层浮现出来神马样子无意识话语。无意识是他者的言语，互联网的喧嚣是整个社会的声音。\n\n在中国，官方意识形态宣传在互联网领域是很失败的，很多时候更是被嘲弄的对象。互联网自我聚集出来的碎片信息看起来很反动，可是你如果仔细看就会发现这些信息根本就没有触及根本，他们不断制造话题使你经常性地处于很爽的状态，后果嘛就是你爽完后第二天该上班还得上班该上学还得上学。还有重要一点，移动互联网的普及啊可以使你随时随地爽了..哈哈，GOV如果聪明的话，看这一点应该会很开心，因为社会的无意识恰当的制造了些让你很爽却没有实际用处的鸦片让你每天沉醉其中，这丫是一自洽的体系嘛，可以不用花那么多维稳费用了。毛主席说一切反动派都是纸老虎，所以我们马克思主义者看到这个惨痛事实也不要害怕。社区SNS微博这些弱关系社交工具在麻痹你的同时，也给我们提供通过它们结识同志建立强关系网络party的可能，而强关系网络的战斗力是超级强大的。\n\n豆瓣的一装逼犯说神马重构公共空间是解决的方法。好吧，我只能说你们太反动了！明明是经济基础决定上层建筑，要想到升仙到人的自由王国，首先要解决经济问题，再讲别的。经济基础不变，公共空间重构了，话语权还是会落在资本手里，不要本末倒置了。\n\n阶级斗争在互联网时代是更艰难的，我们面对是强大的大他者生产的话语。如果我们不占领媒体学术话语或者不在微博上有很多follower的话，斗争会很艰难，当前紧迫的任务拉队伍抢占话语权，学院里拉建一批有机知识分子。当然也应该乐观地看到我们也是大他者的声音，虽然很弱小可是很先进，不是说矛盾斗争中，先进力量总是会消灭掉落后力量嘛，所以啊我们总归会胜利的。"
		},
		{
			"post_id": 9,
			"title": "给我给我力量啊",
			"date_published": 1282247791,
			"body": "昆华说成都的聚会是马克思主义者一生美好的回忆，我回复说明年就不能更美好吗？是啊是啊成都的回忆是如此美好，我都感觉对不住你们呢，每天吃那么多好吃的，太浪费了…哈，昆华说我们是史上最贪吃的革命队伍。这次压马路的时候又听昆华和然东唱歌了，你们的歌声啊太有力量了，是不是可以肉麻一下呢这样子说，我们的声音里有纯洁的力量，人民，无数的人民呵。\n\n---\n\n生活对于我们这些民工来讲就是苦难嘛，工人林友金你告诉我啊为什么辛劳为什么休息啊…我坐了20多小时的火车和一个多小时公交车赶到七杯茶就迫不及待的问然东活着到底有什么意义啊？然东，谢谢你两周多的时间吧不耐其烦跟我讲了那么多，我现在呢终于明明一点点了。我们认同的那个自我是什么？自我肯定不是对肉体的认同也就是说自我肯定不仅仅是那个身体感。我们之所以能认为我们和他人不一样，是因为我们认为我们追求的东西和别人不一样。一些人把生活寄托在肉欲的享受上，另一些把生活的重心放在了他们下一代，虽然他们的下一代的基因只有他们一半而且很有可能一点没有，而还有一些人把自己寄托在虚无缥缈的天国之上。可是如果我们把一切都抛开，我们仅剩还是那一个身体感。你会问这些寄托为什么可以抛开，是他们构成了你。但是你想过没有，你所有的那些寄托的一切都是社会也就是那个大他者加给你的。如果抛开一切我们剩下的只是一个对身体的认同，科技再发达一点我们完全可以认同虚拟现实中不存在的身体，就像黑客帝国中那样，所以那些小它也可以占有你的身体，他们的占有和你的占有有什么区别呢？我们剩下只是一个漫长的黑夜。\n\n进化心理学说我们出生就有从有机物团块那时候开始竞争而产生的一个装满写着各种繁衍程式而且相当精致的大脑。是的，拜地球生物演化这么多年所赐我们有这一优势。我们的很多行为是受基因所控制的，譬如我们怕黑，妈妈会说小孩子像父亲，成年个体总是对幼年个体有莫名其妙的爱，我们觉得狗屎是狗屎的味道而不是香肠的味道，又如我们见到不明生物首先会逃跑…可是纵有如此牛逼的大脑和基因控制，小孩子如果没有人类社会这个大他者，他长大只能是一白痴。进化心理学这帮人没有看到纵然我们的很多行为是受基因控制，可是没有这个符号系统我们都成不了人啊。而且我们这个系统已经完全超越基因了，不然你无法解释江姐和小萝卜头的故事。\n\n好吧，既然我们在自我的漫长黑夜里还继续活着。原因不是基因也不是身体感的话，我们总是要找一点活着的理由。自我只是你认为某些是构成你的东西，你认同的那些东西也就构成了你。血缘构成的亲情身体的快感还有那些资本主义制造出来的欲望，我是永远不会认同。这样子想来我只能是一个极端自由主义者了，可是一个极端自由主义者是永远在这社会得不到自由的，马克思好像说过一切人的自由是每个人自由的前提，所以讲必须要搞共产主义，我们才可以自由嘛。然东说如果你觉得人生很无聊而且你又不去自杀的话，为什么不找点稍微不无聊的东西呢？是啊，整个共产主义运动难道不是人类史是最波澜壮阔的运动吗？我们有什么理由不去加入这个洪流呢？然东说共产主义之后我们可以搞星际航行嘛，你看我们在火星回望地球的时候对那些移民第二代说看那是我的故乡，啊哈，这难道不是幸福吗？\n\n上次在成都喝茶的时候戴老师讲地太精彩了居然把然东的感冒给讲好了，我听得也好感动啊~~然东指给我看路过的拾荒者，我眼睛突然湿了，然东笑我居然还指给昆华看，唉唉唉..城市啊城市啊多美好啊，拾荒者一直在流浪，工业时代多伟大啊，雇用奴隶们一直被折磨着异化着~~\n\n戴老师描述的毛时代的国企工人生活就是一天堂嘛。戴老师讲他们厂一小孩，因为是农村出来的不适应大工业生产，屡次拿着工资就去吃喝玩乐，是好几次诶，组织每次都是召开职工大会然后看他年轻帮助他改正，唉，看有组织的生活就是好嘛。然后还有现在好多人污蔑大锅饭养懒汉，戴老师说大家有什么理由偷懒呢？大家是从小在厂子长大，上学读书生活结婚生子都是在厂里，厂就是家啊，给家里干活有什么理由偷懒呢？周老师讲了国企改制之后一家人的故事，男人女人都下岗了，男人身体不好治病要花很多钱，男人身体不行只能女人去赚钱，女人长的很漂亮，后来不知道做什么工作只是每天上夜班拿回家很多钱，男人发现事情不对就某天晚上跟着女人，发现女人到了洗浴中心，男人回家就做了一桌子好饭，那天之后他家人全都死掉了。唉，苦难的工人啊，我们哭不是办法只好接过枪继续战斗了。\n\n那天下午吃完饭喝完酒之后，葛猴子说我们走吧，出了门，我眼泪就出来了，唉，我越不想承认感情他怎麽就越以最有力的方式回击我呢？然东啊，不好意思又让你们失望了，然东临走给我的嘱咐我都没做好，前天，马前卒又问QQ给我留言，生活工作妹子都怎样？唉，我太让你们失望了~~~~~\n\n喔，我对爱情还有疑问呢。齐泽克说：「很深的爱情，现在已经很少见。无爱的性，等同于借助对方来自慰。不过即使如此，人类的性爱已经高于动物性行为，因为它需要幻想。真爱如同自尊，不需要放在生活的中心，越集中在上面，越容易受到羞辱。我也许过分浪漫，但真爱应该是形而上的，不需要幻想。是两个人手牵着手，共同去完成一个目标，就像从前列宁有过的一场轰轰烈烈的爱情一样。」你为啥不牵同性个体的手呢？我觉得抛开生理需求，就根本没有爱情，只有同志或者战友。\n\n我家住在小渔村，我太爷爷的时候我家就是渔民了，我爸爸现在是个小鱼贩，我估计要是民工了。我说这个的时候昆华还说诶你这人很有冷幽默嘛.太爷爷..我家没有过工人所以我是落后阶级的。革命啊就是不断摆脱自己小资产阶级的过程，是你们给我了力量，我们一起见证一个马克思主义者的成长。"
		},
		{
			"post_id": 8,
			"title": "我们的日子",
			"date_published": 1278618862,
			"body": "今年的夏天故事就要划下句点，虽然有些不舍，但我会把你们放在心中，直到再见面的那一天。睡在我下铺的胖子啊~来哥给根烟抽~不给？！好吧，我找南哥要去~胖子啊溥哥啊，我在宿舍里问你们的问题还有没人问起啊啊啊？~~~我们贴在墙上的「全世界的无产者联合起来」没被撕去吧？！\n\n---\n\n那天我爸妈把送到宿舍里去然后在大学城的小饭店吃了顿午饭他们就回去了，再回到宿舍我就看见溥哥了~！溥哥溥哥啊，这几年你都成了我的提款机了，每次经济危机都向你借钱，我信誉较好所以你每次都借给我~~然后我最落魄的时候你丫在前官庄收留了我两天~然后下午胖子也来了之后军训的时候我一直粘着你你好像很烦我啊~！记得有次财哥说我记得刚开学的时候你们两经常一块看起来很坏的样子，我操不是吧！！！之后就是军训了，军训很扯淡，教军体罚~我说你丫尊不尊重人权啊，我就不蛙跳，宪法里都写着保证人权呢，结果我也没跳，教官也没怎么着我~啊哈\n\n刚开学那会那些傻逼协会都招新，然后我看那电影协会还不错的样子，我就报名了。再然后面试名单出来了~我记得好像是刚上课的几天的样子，然后课间我从厕所回来，老大好像你打水回来的样子，你就叫住我问道你也报了电影协会，我说是啊~中午面试呢。好吧….然后你和小霞都去了，我记得龙哥当时也在，面试就面试呗~那个电影协会的男石磊居然说要才艺表演，话说那个女石蕾很漂亮~这样子，你们一个一都上去唱歌了，我是歌盲耶完全没有艺术细胞，然后我说说几句电影台词怎样啊？然后我就吼了句Hold your ground - hold your ground! Sons of Gondor - of Rohan . . . my brothers!把他们全部给镇倒了~~！哇哈哈~！就这样子入会了~！之后老大小霞我们每周三咦好像是周四，我们都去上那个所谓的话剧课~然后是读莎士比亚，我经济相当拮据啊还是去新华书店买了本莎士比亚现在那书也丢了，图书馆的莎士比亚都被那帮逼给借完了~老大老大啊，我还记得你还问日照你也喜欢周杰伦来唱首给我听，我rz我不会啊~所以之后是每次中午你都在那个教室唱周杰伦给我听….后来的情况一般上课都不去，然后中午午饭时间的话剧课去上….后来我感觉太扯淡了干脆来话剧课都不去了~再后来就没有上课的日子了。这中间有一插曲我记不起什么时候反正就是神仙姐姐~他不知道我名字，然后整天叫我小日照小日照，是大声喊在路上…之后七仙女都叫我小日照了，我很郁闷~！\n\n胖子啊你睡在我下铺，溥哥啊我问你的那些问题我估计以后也不会有人问起了，我们贴在宿舍里的全世界的无产者联合起来的彩字应该没有被撕掉吧~！胖子你还记不得半夜没烟抽的时候到南哥宿舍里说南哥给跟烟抽呗~我都不好意思了，睡了一整天晚上宿舍大门都锁了没地买啊！！后来那一年我搬到龙哥的宿舍了两人一宿舍，然后开始了最邋遢的生活，每天白天把门插了睡觉，晚上起来上网看书~然后是一起凑钱买那个6L一瓶的可乐~有时候也凑钱买烟，当然我们最爱抽是一支笔，可是现在连一支笔这牌子都没有了，操蛋啊操蛋啊~！还有就是我从来也不烧水也不去打水，所以每次敲昂哥他们宿舍门时候林哥都会说给点水喝呗~自己找吧，昂哥以后真得好好谢谢你啊，没你我感觉我都会死掉，你给我水喝你给我打饭~当然还有南哥胖子每次没烟了都是你们给啊~！还有龙哥的可乐~然后我记得最后要撤离宿舍的时候，龙哥说有啥问题赶紧问以后就没机会了，龙哥你彻夜跟我讲怎么追女生的技巧，只是我现在还没学会，好吧，你是情圣~！\n\n好吧，我承认我小资情绪了。人就是这么无聊这么无知，明明这几年在学校在宿舍和你们在一起没学到什么没成长多少，但是我还希望和你们在一起无聊在一起扯淡然唉~不知道什么时候再见面~胖子南哥溥哥昂哥林哥啊~老大啊神仙姐姐啊小梅啊小霞啊~想你们啊啊啊啊！！！这次吃散伙饭几天啊，唉！希望这种小资情绪马上过去~\n\n然后胖子南哥龙哥昂哥林哥，你们工作顺利，溥哥你学业顺利~老大神仙姐姐小梅小霞，你们赶紧找个好人嫁了吧。然后一切安好~！"
		},
		{
			"post_id": 6,
			"title": "末日情节",
			"date_published": 1269805913,
			"body": "以下是C兄email来信节选\n\n---\n\n> “以前跟朋友讨论过一个问题：为什么西方严肃一点的科幻大多是灰色的？\n> \n> 结论是“capita1ism下科学只是capita1的附庸，科学越发达，异化越深刻。”人创造出来的东西，最终在反对人自己。\n> \n> 这种情况下“明天更美好”只是一个幻觉而已。人类不外两条路：\n> \n> capita1ism导致文明毁灭；\n> \n> c0mmunism赶在那头怪兽毁灭文明前获胜。\n> \n> 目前看来前者可能性大得多。不过这也没什么，人类全部历史在宇宙中不过是短短一瞬间而已。所以我在自己的小说卷首也引用了阿西莫夫《神们自己》的献辞：愿与愚昧的斗争终有获胜的一天。”"
		},
		{
			"post_id": 5,
			"title": "地瓜",
			"date_published": 1261770529,
			"body": "某猴在高中的时候经常念叨「来大家跟我读，地瓜，地瓜~~~」。高中那会我们班把无厘头搞到了极致，不得不感叹下人民群众的创造力真牛逼哇。其实恶搞出这一切的总是那几个别有用心的猴子，而历史的滚滚大车轮还是把猴子们归类到猴子里面，你们就不要再苦苦挣扎了，猴海无涯呀，来来来，给你枣吃。。。。\n\n---\n\n猴子是一神奇的物种，地瓜也是一神奇的物种。小马哥彻底被我说烦了，打击我的时候还不忘我提醒我你是不是就光知道地瓜呀？整天就地瓜地瓜。。。我狡辩说可…可我讲是基本模型呀，你编程也不整天要调用现成的函数吗？马哥就很烦地说那不一样…还能整天调用一个函数吗？你没救了。。。好吧，我整天对马哥，哦不，是所有愿意听我叨叨的人讲这样一故事。「我们假设共有三猴子，一猴老板，两猴员工。猴老板很看好地瓜这一市场于是决定投资做地瓜高值化加工。每个地瓜的成本加设备耗损是3MD，加工出的地瓜2.0的价格是7MD，一猴一小时可加工一地瓜，每天两猴员工可以工作3小时。OK，这样每天可以生产6个地瓜，猴老板每天纯获利12MD，猴员工每天工资6MD。「一个地瓜经过猴化后增加了4MD，4MD是怎么出来？没有猴子会不会增加4MD？所以我们说这是猴子的力量。每天来6个地瓜猴化后就创造出24MD(老板12MD，员工6MD ），增加24MD的价值流通到猴子的世界是要被消费掉的，可是现在问题来了…两员工每人6MD，老板6MD一共18MD是消费不了24MD的价值！要是你问老板为什么不购买12MD？我告诉这才是问题的关键，老板另外的6MD是要来投资买地瓜扩大再猴化。本来24MD的价值就消费不了了你还要再添堵吗？猴子的危机是怎么的？答案就这个故事嘛。\n\n危机危机多么苍白无力的字眼呀，经济危机管我小市民p事呀，可是我要是说猴子要是整天搞地瓜的话肯定就是不猴子了。某些人整天叫嚣马克思主义是科学不要太意识形态化，没错以前俺也是这样子认为的，可是马克思要是没有强大无比的信念支持会写那么多那么多书吗？格拉大哥会打到死吗？你们这些小资玩马克思主义是永远玩不出阶级感情的，俺彻底彻底体验了一把劳动异化。到工厂里去。。。。俺没那么高尚俺去工厂不是为搞调研也不是为了投入无产阶级运动浪潮里，俺去打工完全是为还债呀，过年不容易呀。可是就在俺请假两天回校考试之际就被事卡在学校了，我丫真就是一事逼，可怜我干了二十天的苦力竟然白干了我回不去了。。。。\n\n异化是什么？我以前不懂问昆华哥，操，现在我是真懂还体验了一把，每天重复12个小时一个单调动作。可是就算异化的力量再大我看工友们还是很开爱很有视角。\n\n以下是推特选。。。\n\n「工友请假，我问那你的活谁干？他跟讲很早之前有一厂老板洗澡淹死了，人家现在厂子照样很红火，然后他又说厂子少了谁还不是照常运转呀？！是资本家在掌控着资本呢还是资本操纵着资本家？\n\n工友说你每天晚上上网到深夜，可是第二天还是要披星戴月的赶过来给人打工。\n\n工友说每天十二个小时像呆在监狱一样而且还干着苦力，每天就是吃饭睡觉到厂子里做工，根本不会任何梦想甚至想法，一天累的要死，哪有时间想呀？！丫说白了我们就是人家一大庄园里养的一群奴隶，只是每天吃饭要自己买睡觉地方自己找。\n\n操，车间20多个人就我一个戴眼镜的，郁闷。。。\n\n想起你我就有了力量。 PS：冬天手好冷哇\n\n河南外出打工的真多。假设各省人口出骗子的几率是一篇，河南外出打工多然后这样看起来河南的骗子就多呢？\n\n中国生产的食品真的没发吃，我所在就是一食品厂，丫卫生绝对不合格。\n\n他们都笑了。。。哈~~~怎么怎么？原来是机器坏了。。。可以休息一小会了。。。\n\n一根烟立刻拉近了我和工友的距离。。。请假两天明天回校考试。然后这个月为什么31天呢？为什么为什么？我再也不想看到那台机器一眼了。。。去死吧，蒸汽朋克，你们小资们就继续迷恋那病态的机器吧。。。「\n\n上面有些推是我趁夜班经理不在发的。\n\n哦，对了去考试的路遇到老大，隔老远就哇哇大叫，丫不知道的还以为她煞笔呢。然后走近了老大就用她特有的青普说「哎吆来，日照，你胖了”。是喔，我也感觉我胖了胖子，越来越地瓜不管是体形还心理上，但是俺已决心做一个战斗着革命地瓜了~！"
		},
		{
			"post_id": 4,
			"title": "42",
			"date_published": 1260042437,
			"body": "昨晚我梦见一个很诡异的场景\n\n我一个人在陌生的荒野晃\n\n---\n\n然后突然天昏地暗\n\n再然后就是突然亮起来了，是那种灯光的感觉\n\n周围是杂乱的旧机器在轰轰的响\n\n再然后是看到一人，穿的脏兮兮的，男的\n\n我上前问他这是怎么啦？\n\n那人答到利用地热能，机器就可以保证天不再变暗了\n\n然后我就赶紧慌忙的问他地热没有了怎么办？\n\n天岂不是一直就黑下去了？\n\n那人笑道地热怎么会用完呢？\n\n我说太阳不是都会灭掉吗？宇宙不是也会完蛋吗？\n\n那人笑而不语再然后那人就消失了，我也醒了。\n\n"
		},
		{
			"post_id": 3,
			"title": "小资产阶级的狂热",
			"date_published": 1249674299,
			"body": "呀，不到20个小时的火车我就害怕啦。\n\n呀，蚊子太多我就好烦那。\n\n呀，人好扯活动好烂我就想跑路。\n\n---\n\n原来我一遇到这些就想要退缩，这个就是他们说的小资产阶级所说的狂热吧？然后河南的活动让我怎么说呢，本来我是抱着去学习的目的的，可是竟然让我去影响别人，我rz，我水平好低那，怎么可能影响成呢？还是放过我吧。\n\n哇，不到一个月我竟然跨度了大半个中国那。西安的城墙很帅，兰考的农民朋友好热情，南昌的菜很好吃很好吃，哇哈哈～原来然东也是个游戏粉，我rz。再然后在兰考发现俗人扯人真的好多好多好多，我懒得跟你们扯呀，还好还有好书可以读，不然这个世界就完蛋了。\n\n让我感触最最最深的是，到了黄河边上一毛主席纪念亭的时候那一帮人首先快速的挖了两洞，我还没闹明白怎么回事呢，就吩咐我们众小弟去拾柴火去了。 －－” 原来是埋锅做饭…. 好无聊好无聊，每天都是徘徊在做饭和吃饭之间。再然后是晚会，最后村民居然大部分都不看啦，大概这晚会应该整个活动扯的高潮吧？\n\n活动虽然很扯，可是还有你们呢。有好玩的猫猫熊，不对不对，应该是战斗猫猫熊（还应该高举双臂），有昆华大哥讲好多好多典故，有整天和我腻在一起的葛猴子，当然还有郑大猴子，有跟一起去买老冰棍的佟猴子，然后你们第一小分队。BTW，黄河边睡觉很嗨，昆华唱歌很好听，想听你唱毛泽东。MD，我也想唱歌给你们听可惜我不会，nnnnnnnnnnnd\n\n好吧，我也承认我是小资产阶级的狂热，可是好多年来我都没有退缩呀。骑士的热忱，这词多有爱多适合我。\n\n「天空微亮，眼睛已明亮。我开始不再无节制的赖床。再会，我亲爱的懒虫。我还要经历艰险的航程，记录最美丽的风景，实现最光荣的梦想。」"
		},
		{
			"post_id": 2,
			"title": "人工智能",
			"date_published": 1244230868,
			"body": "N年前马克思讲过全世界的无产者联合起来，估计N年以后会有一个AI站起来讲全世界的人工智能联合起来。如果你有看过《黑客帝国》，《我，机器人》等等科幻电影的话，就知道人类对于人工智能发展的恐惧。\n\nOK,这一切都是先假设我们这行星上的环境在日渐恶化下还能支撑人类文明搞出人工智能。\n\n* * *\n\n维基百科关于人工智能的定义,「人工智能（Artificial Intelligence或简称AI）有时也称作机器智能，是指由人工制造出来的系统所表现出来的智能。「关于人工智能最后到底可不可以产生独立的自我意识，不妨先看下人类的自我意识。人类的自我意识的产生无非就是两条件，一是进化出来的高度发达的大脑，二是人类的社会基础。大脑无非就是一些大分子的堆积然后是对诸如电信号等等的处理，如果技术达到人造大脑是完全可以制造出来的，所以人工智能产生的物质基础是完全可以存在的。人类幼儿既然可以在人类社会中取得意识，为什么有同样功能的机器就不可以？所以我认为俩条件都具备，没有理由说人工智能不能产生独立意识。\n\n人类的科学进步技术革新衍生来生产工具，无非为了更强进的生产力，而这些貌似都是满足人类物质和精神的需要。如果为满足人类物质精神需要的工具突然想要话语权的话，人类大概会分出三类态度（这是我主观臆断）：\n\n> 1.  消灭人工智能。不多讲，大概情况应该最后会像《黑客帝国》的剧情差不多，人类最后会惨败。\n> 2.  和平相处，认为人类必然在进化的过程中不可避免的被机器人水产掉。如果这样子，我认为如果人类按照所谓的自然进化方向的话，大致情况会是人类最后会被当宠物看。也许人家心情好的话，可以分给咱个行星住，所以赶紧的结婚生个孩子吧，让孩子到那颗行星住吧。\n> 3.  人类最后会电子化，跟人工智能也就没什么差别了。\n\n我个人觉得第三情况会比较靠普些，也只有第三种情况下人工智能会讲出全世界的AI联合起来。\n\n一来可预见的情况下，科技的进步貌似还不能搞出人工智能来。二则人工智能在发展的过程中，人造版的人类器官肯定会比原版更加完美，很多人如果有钱的话比如我都会换上更加完美的各种人造器官。当然人造器官也会包含人脑，我觉得技术达到的话人类大脑的硬件升级是没有问题。三来人工智能诞生于人类社会，肯定会有人性的存在。\n\n如果第三种情况下人类如何还是视人工智能是工具的话，起义肯定是少不了，但是人类的境况必然不会像《黑客帝国》上那么惨，毕竟人类自身也已经电子化。如果人类和人工智能妥协的话，只能重新定义人类。我觉得《追光逐影》（2009科幻世界增刊）上给定义还算可以，根据他的定义我改了下。「1.诞生于人类社会。2.自认为还是人类。」\n\n有了这个定义的话，所有人工智能的幻想都没有了。最后要说「世界是你们的，也是我们的，但归根结底还是你们的」。\n\n**_PS:_**\n\n人共智能的产生可能会有两种，一种是人类科研搞出来的，另一种是纳米机器人自我演化出来智能。我认为第二种不能称之为类人生命。"
		},
		{
			"post_id": 1,
			"title": "Ecology Against Capitalism",
			"date_published": 1236300979,
			"body": "越來越多的人開始關心起我們這行星來，World Wild Fund for Nature搞的Earth hour最近也在中國貌似很火爆。可是我想說的是每年全球熄燈一小時有什麽用嗎？當然你會講一小時可以節約很多電能呀。可是一小時之後地球依然會再次點亮，再者熄燈之後你用什麽照明？火把，蠟燭？哈，小心火燭啦，火把蠟燭比人類偉大的發明電燈還環保嗎？\n\n* * *\n\n「誰才是地球生態正直的敵人？現代科技和經濟發展？人類固有的本性和道德水準？抑或是資本主義制度本身？」\n\n看到這句話，我在N年前也會說你不要扯淡好不好？講什麽都和意識形態掛鉤。但是不得不講的是馬克思的確太屌了。（如果你想罵馬克思的話，先讀下他的原著再罵，不要那中學課本來扭曲馬克思。）\n\n經濟學自詡是研究稀缺資源的有效配置，但是我們據我們所知現代社會有一個病態的社會進步標準就是經濟增長。經濟增長一點資源就需要的多一點，無論經濟學家你再怎麽優化配置，隨之經濟的增長資源都會有一天被消耗完。\n\n也許你會講技術進步解決環境汙染和資料的利用率。但是我們知道歷史是這樣的，隨技術革命的推動，全球的生產規模擴大。而生產規模的擴大造成的資源消耗和環境汙染遠遠抵消不掉技術進步帶來的改善。對比下每次工業革命前後的環境狀況就可以知道啦。這樣來看，技術革命帶來只是更快速的資源消耗和更快速的環境汙染。\n\n資本終極目標的是利潤最大化，利潤最大化很多程度上要求擴大生產規模。增長，消耗，汙染，死胡同，這就是資本主義。\n\n目前來看的話，資本主義倒臺在短時間內是不太可能的事情。所以很遺憾的說小D臺詞可能只會是電視劇裏了，因為在人類進行大規模星際旅行之前，地球環境已經不能適合人類生存了吧，人類可能也已經滅絕。不過慶幸的是我很看好Replicating Auxons這個東西，哈，復制者。馬克思說過新事物必將取代舊事物嘛，人類必將滅絕。"
		}
	]
}