{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1518182702,
			"title": "Zeronet clear cache",
			"body": "How do I clear Zeronet cache?\nI thought of deleting my \"$HOME/zeronet/ZeroBundle/ZeroNet/data/*\" directory. But, I am not sure if it will destroy my Zeronet setup.",
			"added": 1518182701
		}
	],
	"topic_vote": {},
	"next_comment_id": 16,
	"comment": {
		"1516894858_1HD3RkKTWrhJLNBpDDxp59iMLN1sWTbzVb": [
			{
				"comment_id": 1,
				"body": "I am not here, but there :)",
				"added": 1516895297
			}
		],
		"1516327946_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 2,
				"body": "There is no such thing as IQ. This is a pseudoscience theory, mainly used during the WWII. New researches about intelligence level in the Psychology of Education field talks about types/kinds of intelligence. Read about that.",
				"added": 1518182948
			},
			{
				"comment_id": 3,
				"body": "> [helium](#comment_155_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p):  it measures the student's \"IQ\" in the context of the past few chapters of the study book\n\n\" it measures the student's \"IQ\" in the context of the past few chapters of the study book\". So, it is not an \"IQ\" test as you have said twice. This time you have written it between quotes. If you are talking about science, \"IQ\" cannot be taken metaphorically. What you said is not an IQ test, but a memory test.",
				"added": 1518185258
			},
			{
				"comment_id": 4,
				"body": "> [helium](#comment_157_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): If I'm very cynical, I can certainly take ANY test as just a measurement device that has its flaws and measurement environment. Call it science or pseudoscience :-D\n\nI am not discussing if you have freedom or not to take \"IQ\" or whatever test you want. But, rather, the lies behind \"IQ\" tests throughout men's history to manipulate, segregate, control, label and even exterminate other people. As I have quoted before during the WWII. So that the statement \"I will consider Russia as a low IQ nation as China\" is a false premiss, based on pseudoscience, full of prejudice and supported by a generalisation that will end up in, of course, a wrong conclusion. If you know what I mean.",
				"added": 1518186203
			}
		],
		"1530451214_12rREqqdMUPsAPuMR1p87Zj8TS4YocoUCX": [
			{
				"comment_id": 5,
				"body": "The Bible goes beyond mental illness. It states that homosexuality is related to sin and sin is related to demonic phenomena --> a very complex subject --> https://en.wikipedia.org/wiki/Christian_demonology   see also the links in this page --> \"... Ambrogio de Vignati, disagreeing with other authors, asserted that demons, besides of not to have a material body could not create it, and all what they seemed to do was a mere hallucination provoked by them in the mind of those who had made a diabolical pact or were \"victims\" of a succubus or incubus, including the sexual act...\"",
				"added": 1539301304
			},
			{
				"comment_id": 7,
				"body": "> [nekololi](#comment_275_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): nice! this corroborates my theory that gay guys all have angry demons living inside their buttholes.\n\nAre you being ironic about my comment or you are serious about reading and researching other points-of-views?",
				"added": 1539303896
			},
			{
				"comment_id": 8,
				"body": "> [nekololi](#comment_276_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): im being ironic about your comment.\n\nWhy?",
				"added": 1539305262
			},
			{
				"comment_id": 9,
				"body": "> [styromaniac](#comment_180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): God is in my pee hole.\n\n> [styromaniac](#comment_180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): God is in my pee hole.\n\nWhich God are you talking about?",
				"added": 1539309154
			},
			{
				"comment_id": 10,
				"body": "> [nekololi](#comment_277_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): because i think it's important to openly ridicule insane beliefs and ideologies. but it wasn't a personal attack against you, you were simply stating other people's interpretations of parts of the bible. [...]\n\nWhat makes you to think that your thought about reality are any better than those of those \"insane\" beliefs and ideologies. Why do you categorize your view as not being insane as well?",
				"added": 1539310198
			},
			{
				"comment_id": 11,
				"body": "> [nekololi](#comment_278_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): demons just seem pretty outrageous to me --> the fact that daemons seem outrageous to you does not change any reality about them. Also humans are not only biological beings. About psychology, it also deals with paranormal issues. Human sexuality in many cultures are mixed with worshiping gods and such. So yes, human sexuality is very complex and has to do with other connections. But you can deny it. It is also your interpretation because your cannot grasp the reality per se since you are a filter of the reality around you. As for the lack of minerals and such I also do not think that it is the case. Finally I do not need no one backing me up. Just go to a coven of witches and see for yourself if sexual relationships have nothing to do with evil spirits. In that case, it is better to ask witches than your christian friend.",
				"added": 1539311753
			},
			{
				"comment_id": 12,
				"body": "> [nekololi](#comment_279_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): based on your suggestion i shall go out and visit a witch coven on this very night. i will ask the witches their understanding about gay butt demon possession. if i learn anything more i will report back to this thread tomorrow.\n\nOk. God there if you are brave enough...",
				"added": 1539311991
			},
			{
				"comment_id": 13,
				"body": "> [achylles](#comment_12_13vv2eRHS2KMArxEo1rKh4xQGogjJNhKr4): Ok. God there if you are brave enough...\n\nOk. *Go...",
				"added": 1539312086
			},
			{
				"comment_id": 14,
				"body": "I am done with you all idiots - now I am using an \"ad hominem\" at you. Because we cannot have a decent argumentation here. So far, you have used some fallacies - appeal to ridicule, argumentum ad populum and red herring twice (specially you styromaniac),  that do not lead to any logical thinking or line of argumentation. Go back to school and take some Philosophy classes, because you all were made dumb by the System...",
				"added": 1539354633
			},
			{
				"comment_id": 15,
				"body": "> [swastika](#comment_37_1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7): \"Homosexuality\" was popularized since 1900, and would simply die off since people cannot reproduce with same-sex relationships\n\n\"\"Homosexuality\" was popularized since 1900, and would simply die off since people cannot reproduce with same-sex relationships\" --> finally, someone who can use the brain to formulate a logical argument.\nThx.\n\nBut, I had enough about this topic...\nPerhaps when I saw it, I just got it wrong thinking that it was supposed to raise a discussion...",
				"added": 1539388572
			}
		],
		"1538081577_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": [
			{
				"comment_id": 6,
				"body": "> [vergreeneyes](#comment_13_13SeW8Gn6YsZFqUaQp5JWSGvzjHWfKHqBY): Of course, there's no evidence of it being a globalist conspiracy - it's just companies dumping toxic waste because there's no regulation preventing them from doing so\n\nOf course, you know that for sure --> that they are not doing that on purpose...",
				"added": 1539303300
			}
		]
	},
	"comment_vote": {}
}