{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1G8X5xnLri7S9dzMLveQisPkejtJa8hNWm": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"2_1FDGXTS5vrbUJj81LwFmAG8o4MnJjaHwuC": 1,
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": 1,
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": [
			{
				"comment_id": 1,
				"body": "> [tuber](#comment_3_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd): Angie Tribeca\n> Na história, Gabriel Black (Holloway) é um ex-fuzileiro naval que atualmente trabalha como oficial da inteligência. Com um microchip implantado em seu cérebro, ele consegue processar as informações como se fosse um computador e acessar internet, WiFi, celulares e satélites. Gabriel realiza missões para a U.S. Cyber Command, unidade que trabalha com segurança tecnológica, sob o comando de Lilian Strand (Marg Helgenberger, de CSI). Para manter Gabriel sob controle, Lilian chama a agente Riley O’Neill (Meghan Ory, de Once Upon a Time), que forma dupla com ele em suas missões de campo.\n> \n> https://megaseriehd.com/series/angie-tribeca/\n\n#Esta é a sinopse da série \"Intelligence\"",
				"added": 1547595347
			}
		],
		"2_1FDGXTS5vrbUJj81LwFmAG8o4MnJjaHwuC": [
			{
				"comment_id": 2,
				"body": "#Curso de Inglês! - O Fantástico Método para Ser Fluente\n- https://www.udemy.com/share/1000mC/",
				"added": 1547595403
			},
			{
				"comment_id": 5,
				"body": "#Duolingo\nAulas de Inglês dosificadas. Divertidas, eficazes e 100% gratuitas.\n\n- https://pt.duolingo.com/course/en/pt/Aprenda-Ingl%C3%AAs-On-line",
				"added": 1547596778
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 3,
				"body": "No princípio era o Verbo, e o Verbo estava com Deus, e o Verbo era Deus.\nEle estava no princípio com Deus.\nTodas as coisas foram feitas por ele, e sem ele nada do que foi feito se fez.\nNele estava a vida, e a vida era a luz dos homens.\nE a luz resplandece nas trevas, e as trevas não a compreenderam.\nHouve um homem enviado de Deus, cujo nome era João.\nEste veio para testemunho, para que testificasse da luz, para que todos cressem por ele.\nNão era ele a luz, mas para que testificasse da luz.\nAli estava a luz verdadeira, que ilumina a todo o homem que vem ao mundo.\nEstava no mundo, e o mundo foi feito por ele, e o mundo não o conheceu.\nVeio para o que era seu, e os seus não o receberam.\nMas, a todos quantos o receberam, deu-lhes o poder de serem feitos filhos de Deus, aos que crêem no seu nome;\nOs quais não nasceram do sangue, nem da vontade da carne, nem da vontade do homem, mas de Deus.\nE o Verbo se fez carne, e habitou entre nós, e vimos a sua glória, como a glória do unigênito do Pai, cheio de graça e de verdade.\nJoão testificou dele, e clamou, dizendo: Este era aquele de quem eu dizia: O que vem após mim é antes de mim, porque foi primeiro do que eu.\nE todos nós recebemos também da sua plenitude, e graça por graça.\nPorque a lei foi dada por Moisés; a graça e a verdade vieram por Jesus Cristo.\nDeus nunca foi visto por alguém. O Filho unigênito, que está no seio do Pai, esse o revelou.\nE este é o testemunho de João, quando os judeus mandaram de Jerusalém sacerdotes e levitas para que lhe perguntassem: Quem és tu?\nE confessou, e não negou; confessou: Eu não sou o Cristo.\nE perguntaram-lhe: Então quê? És tu Elias? E disse: Não sou. És tu profeta? E respondeu: Não.\nDisseram-lhe pois: Quem és? para que demos resposta àqueles que nos enviaram; que dizes de ti mesmo?\nDisse: Eu sou a voz do que clama no deserto: Endireitai o caminho do Senhor, como disse o profeta Isaías.\nE os que tinham sido enviados eram dos fariseus.\nE perguntaram-lhe, e disseram-lhe: Por que batizas, pois, se tu não és o Cristo, nem Elias, nem o profeta?\nJoão respondeu-lhes, dizendo: Eu batizo com água; mas no meio devós está um a quem vós não conheceis.\nEste é aquele que vem após mim, que é antes de mim, do qual eu não sou digno de desatar a correia da alparca.\nEstas coisas aconteceram em Betabara, do outro lado do Jordão, onde João estava batizando.\nNo dia seguinte João viu a Jesus, que vinha para ele, e disse: Eis o Cordeiro de Deus, que tira o pecado do mundo.\nEste é aquele do qual eu disse: Após mim vem um homem que é antes de mim, porque foi primeiro do que eu.\nE eu não o conhecia; mas, para que ele fosse manifestado a Israel, vim eu, por isso, batizando com água.\nE João testificou, dizendo: Eu vi o Espírito descer do céu como pomba, e repousar sobre ele.\nE eu não o conhecia, mas o que me mandou a batizar com água, esse me disse: Sobre aquele que vires descer o Espírito, e sobre ele repousar, esse é o que batiza com o Espírito Santo.\nE eu vi, e tenho testificado que este é o Filho de Deus.\nNo dia seguinte João estava outra vez ali, e dois dos seus discípulos;\nE, vendo passar a Jesus, disse: Eis aqui o Cordeiro de Deus.\nE os dois discípulos ouviram-no dizer isto, e seguiram a Jesus.\nE Jesus, voltando-se e vendo que eles o seguiam, disse-lhes: Que buscais? E eles disseram: Rabi (que, traduzido, quer dizer Mestre), onde moras?\nEle lhes disse: Vinde, e vede. Foram, e viram onde morava, e ficaram com ele aquele dia; e era já quase a hora décima.\nEra André, irmão de Simão Pedro, um dos dois que ouviram aquilo de João, e o haviam seguido.\nEste achou primeiro a seu irmão Simão, e disse-lhe: Achamos o Messias (que, traduzido, é o Cristo).\nE levou-o a Jesus. E, olhando Jesus para ele, disse: Tu és Simão, filho de Jonas; tu serás chamado Cefas (que quer dizer Pedro).\nNo dia seguinte quis Jesus ir à Galiléia, e achou a Filipe, e disse-lhe: Segue-me.\nE Filipe era de Betsaida, cidade de André e de Pedro.\nFilipe achou Natanael, e disse-lhe: Havemos achado aquele de quem Moisés escreveu na lei, e os profetas: Jesus de Nazaré, filho de José.\nDisse-lhe Natanael: Pode vir alguma coisa boa de Nazaré? Disse-lhe Filipe: Vem, e vê.\nJesus viu Natanael vir ter com ele, e disse dele: Eis aqui um verdadeiro israelita, em quem não há dolo.\nDisse-lhe Natanael: De onde me conheces tu? Jesus respondeu, e disse-lhe: Antes que Filipe te chamasse, te vi eu, estando tu debaixo da figueira.\nNatanael respondeu, e disse-lhe: Rabi, tu és o Filho de Deus; tu és o Rei de Israel.\nJesus respondeu, e disse-lhe: Porque te disse: Vi-te debaixo da figueira, crês? Coisas maiores do que estas verás.\nE disse-lhe: Na verdade, na verdade vos digo que daqui em diante vereis o céu aberto, e os anjos de Deus subindo e descendo sobre o Filho do homem.\n\n- João 1:1-51",
				"added": 1547595631
			}
		],
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": [
			{
				"comment_id": 4,
				"body": "#Gerador de Criptomoedas - Como criar uma moeda / blockchain.\n- https://youtu.be/Kjk9RE2HGmo\n\nScript: https://github.com/tiagosh/AltcoinGenerator.git",
				"added": 1547596116
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 6,
				"body": "#Existem universos paralelos? A teoria das cordas\n\n- https://youtu.be/5T_V6kud-h8",
				"added": 1547597251
			}
		]
	},
	"comment_vote": {
		"4_1PXYbAuqbq7gYnYnxfeJti58Wc7HjrrWGX": 1,
		"5_1PXYbAuqbq7gYnYnxfeJti58Wc7HjrrWGX": 1,
		"2_1PXYbAuqbq7gYnYnxfeJti58Wc7HjrrWGX": 1
	}
}