{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1586185241,
			"title": "Барановирус как прикрытие процесса Глобализации и введению \"цифрового концлагеря\"",
			"body": "Обсудим эту тему пожалуй. Наверняка часть людей не понимает по каким принципам работают \"силы зла\", которые загнали мир в такой тупик. Да и я не претендую на \"всезнайку\".",
			"added": 1586185240
		},
		{
			"topic_id": 1586594582,
			"title": "#pizzagate #pedogate #adrenochrome аресты идут в полный ход",
			"body": "Смотрите ютуб, твиттер и просто поиском гугла по данным тегам. Вам может показаться, что это всё выдумки и \"конспирология\". Но во-первых все звёзды голливуда и римские священики внезапно начали \"заболевать коронавирусом и умирать\", а во-вторых про некоторых людей есть уже 100% достоверная инфа, например см. про Вайнштейнов.",
			"added": 1586594580
		}
	],
	"topic_vote": {},
	"next_comment_id": 25,
	"comment": {
		"1584551115_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 1,
				"body": "удобно устанавливать можно через AuroraDroid (форк f-droid) в нём уже есть все репозитории\nhttps://f-droid.org/en/packages/com.aurora.adroid/\nhttps://github.com/HelloZeroNet/ZeroNet-kivy\nhttps://f-droid.mkg20001.io/repos/jVVkbOD2it_bf_UxFIGGh1qa950KrUsq/repo/assets/qr_code.html",
				"added": 1584808472
			}
		],
		"1586039346_1PTQGb5VUyuPnY2i9fah56KowV2gpEHzBu": [
			{
				"comment_id": 2,
				"body": "1) людям ничего не разъясняют, как будто их мнение ничего не стоит (то есть допустим к вам в деревню/город приезжают чужеземцы и начинают без разрешения наводить свои правила) 2) когда люди выражают своё недовольство, если они против, что нужно делать? нужно слушать их т.к. это их земля и только они вправе ей распоряжаться. Часто люди выступают с разумной аргументацией: покажите исследования. Но в ответ что? Только манипуляции и издевательства.",
				"added": 1586180637
			},
			{
				"comment_id": 3,
				"body": "Если вам нравится быть стадом овец, которое пасёт кучка \"богоизбранных\" так другим не навязывайте такой образ жизни!",
				"added": 1586180710
			},
			{
				"comment_id": 4,
				"body": "На самом деле почти все т.н. \"теории заговора\" правда (кроме нло, рептилоидов и различного рода БОГИ). Просто вас дурят как лохов (стригут как овец).",
				"added": 1586181001
			},
			{
				"comment_id": 5,
				"body": "https://pikabu.ru/story/teorii_zagovora_okazavshiesya_pravdoy_4374793",
				"added": 1586181050
			},
			{
				"comment_id": 6,
				"body": "Если бы вам рассказали сейчас впервые о концлагерях и сжигании людей в печи и трудовых лагерях (гулаг) вы бы тоже сказали что это лишь фантазии",
				"added": 1586181137
			}
		],
		"1586185241_1JzkNnKvtbyhws9GwvYSjAx8oHRHevmksn": [
			{
				"comment_id": 7,
				"body": "Точка зрения каббалиста Михаэля Лайтмана https://www.youtube.com/post/UgwP7sAPiCSG8rWqTT14AaABCQ",
				"added": 1586185363
			},
			{
				"comment_id": 8,
				"body": "Рав Булочник тоже имеет свою точку зрения https://www.youtube.com/watch?v=UUZQDp9mvgA",
				"added": 1586185485
			},
			{
				"comment_id": 9,
				"body": "https://www.youtube.com/watch?v=oL-PRDdJSNs",
				"added": 1586186411
			},
			{
				"comment_id": 10,
				"body": "Пандемические облигации https://www.youtube.com/watch?v=urPJH-x38ys",
				"added": 1586186603
			},
			{
				"comment_id": 11,
				"body": "https://www.youtube.com/watch?v=sBCjy-SatNI Сценарий самоизоляции\nТеперь вы знаете что будет дальше",
				"added": 1586201089
			},
			{
				"comment_id": 12,
				"body": "Удалось кое-что выяснить, но темы надо разделять в таком случае и формат бы reddit-like был бы удобнее. План был следующий: пустить коронавирус, забрать права-свободы, вакцинировать под предлогом спасения от вируса (вакцина это во-первых id, а во-вторых далее у них план был убавить население, так что скорее всего сама вакцина работает как стерилизация). Теперь 100% доказательства: \nhttps://id2020.org/\nhttps://centerforhealthsecurity.org/event201\nhttps://youtu.be/InJ13TOLen4\nhttps://youtu.be/ajyxweFUx7o\nhttps://youtu.be/EoV9PVyOw-U\nhttps://youtu.be/JMzOZO_p8gI",
				"added": 1586594161
			},
			{
				"comment_id": 21,
				"body": "> [vialemar](#comment_10_1PTQGb5VUyuPnY2i9fah56KowV2gpEHzBu): даже если короновирус лишь проект, чтобы мир в него поверил нужны реальные случаи заражения! но если нет способов сдерживания вируса который предположим где-то в секретной лаборатории делают для будущих скрытых войн уже биологическим оружием то те кто это делают безумцы, вирусы не подконтрольно распространяются очень быстро и непригодны в качестве оружия! опять же если нет способа избирательного инфицирования, или ручного где способ проверки от него включает заражение им, не знаю, можно строить множество версий)\n\nПлан LOCK STEP от Рокфеллера: https://www.youtube.com/watch?v=IIZEU1JblaE\nID2020.ORG\ncenterforhealthsecurity.org/event201/about\nEVENT 201: https://www.youtube.com/watch?v=Vm1-DnxRiPM",
				"added": 1587133069
			},
			{
				"comment_id": 22,
				"body": "https://www.nommeraadio.ee/meedia/pdf/RRS/Rockefeller%20Foundation.pdf",
				"added": 1587133328
			},
			{
				"comment_id": 24,
				"body": "Причём планету засрали именно эти уроды. Люди давно борятся за охрану природы и животных. Рыночная экономика не подходит для человечества и этой планеты, когда бОльшая часть еды просто выбрасывается в помойку.",
				"added": 1587133654
			}
		],
		"1587107391_15zutMkc1LGBS6ntJdYxyYkXbnM7t3BJ43": [
			{
				"comment_id": 13,
				"body": "\"Нет никакого мирового правительства\" зачем вы утверждаете БЕЗ КАКИХ-ЛИБО доказательств, что его нет, если просто не знаете существует оно или нет?\nТо что вы описываете на бардак и не анахия, это называется управляемый хаос. Т.е . вам очень сложно разобраться в происходящем.",
				"added": 1587131485
			},
			{
				"comment_id": 14,
				"body": "https://www.youtube.com/watch?v=MBoiDyhH1KM объяснение как для детей.",
				"added": 1587131646
			},
			{
				"comment_id": 15,
				"body": "Доказательства конечно есть: это их собственные слова: гейтс, тёрнер, дэвид рокфеллер и т.д.",
				"added": 1587131679
			},
			{
				"comment_id": 16,
				"body": "По вашему ГУЛАГ тоже выдумки? а теперь узнайте кто управлял этими лагерями, узнайте так же кто финансировал гитлера во время войны.",
				"added": 1587131753
			},
			{
				"comment_id": 17,
				"body": "А Троцкий который уничтожал русских миллионами - тоже выдумка?",
				"added": 1587131776
			},
			{
				"comment_id": 18,
				"body": "EVENT 201: https://www.youtube.com/watch?v=Vm1-DnxRiPM \ncenterforhealthsecurity.org/event201/about\nID2020.ORG\nПлан LOCK STEP от Рокфеллера: https://www.youtube.com/watch?v=IIZEU1JblaE",
				"added": 1587132105
			},
			{
				"comment_id": 19,
				"body": "Вы не имеете право доказанный заговор называть ТЕОРИЕЙ.",
				"added": 1587132296
			},
			{
				"comment_id": 20,
				"body": "Трамп объявил о приостановке финансирования ВОЗ. Президент США заявил, что организация «не справилась со своей основной обязанностью и должна нести ответственность». Действия ВОЗ, вероятнее всего, привели к более масштабной вспышке коронавируса, считает Трамп.\n\nПо мнению Трампа, действия организации способствовали «дезинформации» Китая о коронавирусе COVID-19, что, вероятнее всего, привело к более масштабной вспышке, чем могло бы быть в противном случае.\n\nДоля США в финансировании ВОЗ равна астрономической сумме $452 млн. В то время как Китай оплачивает в качестве ежегодных взносов $40млн. Россия платит $7,3 млн, Украина - $2,6 млн.\n\nНо самые большие взносы в бюджет ВОЗ делает Фонд Билла и Мелинды Гейтс. В 2010 году Гейтс выделил ВОЗ $ 10 млрд, открыто обещая сократить численность населения, в частности, с помощью новых вакцин. После обнародования этой скандальной информации в 2014 году Ассоциация католических врачей Кении обвинила ВОЗ в химической стерилизации миллионов кенийских женщин с помощью фиктивной кампании вакцинации против столбняка.\n\nВ дальнейшем независимые лаборатории выявили в каждой протестированной вакцине химикаты для стерильности женщин. После некоторого отрицания обвинений ВОЗ наконец признала, что разрабатывает вакцины для бесплодия уже более десяти лет.\n\nАналогичные обвинения в адрес ВОЗ поступили (https://medalternativa.info/entry/vaktsin-poliomielit/)  из Танзании, Никарагуа, Мексики и Филиппин./ В дальнейшем выяснилось, что вакцины Гейтса оказались разрушительными для детского здоровья. В период с 2000 по 2017 год «лекарство» миллиардера парализовало 496 000 детей. В 2017 году правительство Индии запретило прививки Гейтса и выдворило его миссию из страны. \n\nКак стало известно позже, Фонд Билла и Мелинды Гейтс купил блокирующий пакет акций американского фармацевтического гиганта GlaxoSmithKline, и все перечисленные смертельные вакцины были произведены по лицензии именно этой компании. Сейчас Фонд Гейтса активно разрабатывает вакцину против коронавируса, а её производителем выступит все та же компания GlaxoSmithKline. Когда вакцина будет готова, она будет поставляться на мировые рынки. Ожидается, что вакцинирование будет обязательным, в том числе в России.",
				"added": 1587132635
			},
			{
				"comment_id": 23,
				"body": "https://www.nommeraadio.ee/meedia/pdf/RRS/Rockefeller%20Foundation.pdf",
				"added": 1587133335
			}
		]
	},
	"comment_vote": {
		"16_1N7ozinXUWETvJKAfmTTdKzYp2pVtY3p7X": 1
	}
}