{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "qualcuno che sa come funzionano i merged Sites?",
			"body": "Ho notato una cosa chiamata MergedSites e volevo sapere se qualcuno sapeva come implementarli correttamente per gestire una sorta di db , dato che volevo gestire i dati modularmente.",
			"added": 1542836710
		}
	],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1_13fF8ReM7zvX4ytjPkwEaRtBbtFKeho7XS": [
			{
				"comment_id": 1,
				"body": "> [trenta3](#comment_2_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): Ti dirò la verità, non c'è molta documentazione in giro per i merged sites, ci sono alcuni tutorial in markdown di non mi ricordo chi che puoi trovare linkati in una delle issue di Github di ZeroNet che li spiegano in maniera decente. (Quando ho tempo provo a vedere se li ritrovo).\n> Un modo in cui puoi imparare è guardare prima la (poca) documentazione che c'è sulla documentazione online di ZN e poi guardare i sorgenti (li trovi sempre su github) di ZeroMe.\n> Se hai domande più specifiche chiedi che provo a darti una qualche risposta (e comunque sul forum in italiano non troverai molta gente, se hai qualcosa da chiedere ti conviene farlo su quello in inglese visto che la maggior parte degli sviluppatori di siti attualmente disponibili non è italiana). Se ho tempo più tardi magari ti scrivo qualcosa di più.\n\nA: Non mi aspettavo fossi italiano..\nB: Il fatto che Zeronet non abbia una documentazione fatta bene, spinge molti programmatori a non programmare per la piattaforma.\nC: Anche in zeronet sono presenti documentazioni, ma sono delle fotocopie di quelle che si trovano nei siti originali.\nD: Ho provato a vedere i codici sorgente dei mergedsites di ZEROME ovviamente... non si capisce un cazzo.\nE: Comincio a presupporre che il DB sia un NOSQL insomma un db fatto ad albero, richiamabile come un oggetto di oggetti. (GIA. UN OGGETTO DI OGGETTI [un .db che non contiene la struttura di dati che viene fornita da un DBSCHEMA.json]).\nF: IL FATTO DI DOVER CERTIFICARE IL SITO è INTELLIGENTE... MA TROPPO COMPLICATO.\nG: (NAMECOIN...) un network che vuole essere gratuito... libero e senza il dominio le grandi aziende... per avere un dominio tipo salcazzo.coin devi PAGARLO. OK. DACCORDO. (BASTAVA UN PLUGIN CHE GESTIVA QUESTA COSA... AL POSTO DI ALTRI PLUGIN.).\nH: Comincio a SUPPORRE... che CHAT private siano impossibili... perchè i dati vengono scaricati da tutti.. e non so come viene gestito il sistema di protezione dei dati(se è presente... si presuppone esista.).",
				"added": 1542911348
			}
		]
	},
	"comment_vote": {
		"2_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": 1
	}
}