{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "习二将把中国人民带入万劫不复的深渊，过往的40年对中国人民而言不过是黄粱一梦！",
			"body": "",
			"added": 1541388119,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 2,
			"title": "北京高院宣布 中国人无权知道国土版图",
			"body": "2017年8月15日，殷敏鸿向外交部申请政府信息公开：1949年以后，中华人(专题)民共和国政府有没有签署过放弃中国国土（唐努乌梁海地区）的协议。\n\n　　历史资料参考（来自百度百科）：唐努乌梁海，属于中国领土，1914年被沙俄占领，16.8604万平方公里，现俄罗斯图瓦共和国管理，历史其他政府从未在法律上正式放弃俄占唐努乌梁海的领土主权。\n\n　　外交部答复如下：\n　　<无法贴图>\n\n　　2018年3月7日，殷敏鸿向北京市第三中级人民法院起诉了中国外交部。结果如下：\n　　<无法贴图>\n\n　　这么简单问题，为什么搞的这么复杂：1.外交部答复：中国领土版图涉密，中国人没有权利知道。2.北京高院回答：外交部答复正确，我们不管。中国的版图中国人不能知道，谁能知道呢！这个问题太深奥了，无法解答。\n\n　　我国刑法第二百八十二条规定非法获取国家秘密罪：非法获取国家秘密的，处三年以下有期徒刑、拘役、管制或者剥夺政治权利；情节严重的，处三年以上七年以下有期徒刑。\n\n　　某些人小心了，如果你知道中国实际版图，是否应该被追究刑事责任呢？\n\n　　钓鱼岛和台湾(专题)岛加起来都没有唐努乌梁海地区四分之一大，但是中国人连知道中国领土都要冒着被判刑的风险，驱除黄俄，恢复中华！！！",
			"added": 1541514495,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 3,
			"title": "奇文《政审你大爷》,习近平你大爷！",
			"body": "习近平亲信陈敏尔担任市委书记的重庆市准备对报名高考的中学生政审，遭到强烈反弹，被指文革死灰复燃。当局在压力下再三易口，先说“政审”二字是党报记者弄错，连党媒大佬胡锡进都难以置信之后，又说不是政审，而是“思想政治考核”，被人指愈描愈丑，就在这当口，一篇猛烈抨击这一荒谬事件的檄文在网上流传，文章题名『政审你大爷』! 作者署名红拂女。一上网，遭审查官秒删，然而，这篇奇文还在以各种形式在中国网络飞传……(全文附后)\n\n重庆市委机关报『重庆日报』日前报道，2019年高考，政审不合格者不能参加高考。政审不合格事项包括：反对四项基本原则，道德品质恶劣，有违法犯罪行为。此举引发舆论强烈反弹。\n\n红拂女于是写了『政审你大爷』，文章开头就很不凛：“这国很多政策荒语绝伦，但制定者为自己辩护起来总是振振有词，问题就在于他们不知道自己是谁。”\n\n作者反问：“高考报名要政审？”“大学是你家开的吗？这国绝大多数大学都是公立大学，公立大学，公立的意思是花纳税人的钱办教育。你们收税时从来不觉得我们道德品质恶劣，不要我们的肮脏钱，凭啥到了我们的孩子考大学的时候，就嫌弃我们的孩子道德品质恶劣，不让报名考大学了呢？”\n\n文章回头质问，“道德品质恶劣是怎么界定的？”，“谁有资格来界定？”“制定这种规定的脑残，你们自己的道德品质过关了吗？”“申请信息公开，要求知道有没有签过放弃唐努乌梁海领土的条约，算道德品质恶劣吗？”\n\n“这国有道德品质罪吗？有道德法庭吗？一边昭告天下要依法治国，一边私下里对纳税人的孩子进行道德审判，取消他们的高考报名资格，这事儿不荒谬吗？说一千道一万，只要我们的孩子没犯罪，凭啥取消孩子的高考报名资格，这事儿不荒谬吗？”\n\n作者举例，“在美国，犯人都是可以接受教育的，部分表现好学业优秀的甚至可以申请联邦佩尔助学金接受大学教育”，“不仅美国，欧美国家都有类似的监狱教育系统”。\n\n作者问当局制定“这种脑残规定的时候，查过宪法吗？问过纳税人答应不答应吗？”\n\n“动不动就取消这个剥夺那个，这个收费那个涨价，不就是因为摆不正自己的位置吗？老以为老百姓的一切都是你们恩赐的，忘了你们的一切都是纳税人恩赐的。”\n\n作者表示，“连五代十国的后蜀皇帝孟昶都知‘尔俸尔禄，民服民’”、“‘下民易虐，上天难欢‘，那意思是当官的吃的是老百姓的饭，要知道感恩，欺负老百姓狠了，是要遭天打五雷劈的”。\n\n重庆当局后来出面改口说他们的意思不是“政审”，作者批评“”重庆的官儿一看这事闹大了，出来否认说没政审这回事，’我们叫思想政治的考核和现实表现的审核‘越抹越黑了。’思想政治的考核‘，这是在治思想罪吗？如果思想有罪，那全国人民都可以入罪，谁思想有问题还不是你们一句话的事吗？”\n\n文章最后指出：“以思想政治审核的名义剥夺孩子接受高等教育的权利，说穿了，就是把公民该有的权利当作奖赏与筹码来控制孩子脑子里想什么。孩子连思想的自由都没了，还会有创造力吗？难怪泱泱大国十四亿人口却造不好一个小小的芯片，造不好一个小小的圆珠笔尖…….”。\n\n奇文面世，但凡审查官够得着，立即秒删，但是照旧在各种网络渠道飞传，微博呆不住了，传到微博，国内呆不住，传到中国禁止的推特，脸书，然后又以照相版，文字版复制等多种形式再反传中国大陆，妙传对秒删，就这样传来传去，一时形成网络奇观。\n\n政审你大爷\n\n作者:红拂女\n\n重庆高考报名要政审的事儿火了，我一听，又乐了:有些东西又不知道自己是谁了。\n\n这国很多政策荒语绝伦，但制定者为自己辩护起来总是振振有词，问题就在于他们不知道自己是谁。\n\n高考报名要政审? MMP，大学是你家开的吗?这国绝大多数大学都是公立大学，公立的意思是花纳税人的钱在办教育。你们收税时从来不觉得我们道德品质恶劣，不要我们的肮脏钱，凭啥到了我们的孩子考大学的时候，就嫌弃我们的孩子道德品质恶劣，不让报名考大学了呢?\n\n再说，这道德品质恶劣是怎么界定的?申请信息公开，要求知道有没有签过放弃唐努乌梁海领士的条约，算道德品质恶劣吗?道德品质恶劣与否，谁有资格来界定?制定这种规定的脑残，你丫自己的道德品质过关吗?这国有道德品质罪吗，有道德法庭吗?一边昭告天下要依法治国 ，一边私下里对纳税人的孩子进行道德审判，取消他们的高考报名资格，这事儿不荒谬吗?说一干道一万，只要我们的孩子没犯罪，凭啥取消孩子的高考报名资格，剥夺孩子接受高等教育的权利?你们制定这种脑残规定的时候，直过宪法吗，问过纳税人答应不管应吗?你丫的工资是从天上掉下来的吗?纳税人掏钱付你工资,是让你为人民服务来着，不是祸祸人民来了。动不动就取消这个剥夺那个,这个收费那个涨价，不就是因为摆不正自己的位置吗?者以为老百姓的一切都是你们恩赐的,忘了你们的一切都是纳税人恩赐的。\n\n连五代十国的后蜀皇帝孟昶都知\n\n“尔俸尔禄，民服民\n\n“下民易虐，上天难\n\n欢” ，那意思是当官的吃的是老百姓的饭，要知道感恩，欺负老百姓狠了，是要遭天打雷劈的。在21世纪的今天，你们还不懂这道理，是脑残还是心坏呢? 重庆的教育官儿一看这事闹大了，出来否认说没政审这回事，“我们叫思想政治的考核和现实表现的审核”.越抹越黑了，“思想政治的考核” ?这是在治思想罪吗?如果思想有罪，那全国人都可以入罪,谁思想有问题还不是你们一句话的事吗?\n\n看过《肖申克的教赎》的瓜友可能都还记得，安迪辅导年轻犯人汤米考大学的事儿。犯人也可以考大学?没错，在美国，犯人也是可以接受教育的，部分表现好学业优秀的几人甚至可以中请联邦佩尔助学金接受大学教育，美国有专门的监狱教育，对犯人进行R业技能和基础文化教育等等。不仅美国，欧美国家都有类似的监狱教育系统。\n\n有人可能会质疑说犯人凭什么接受教育，这不是在变相奖励犯罪吗?不是。欧美国家推行监狱教育，是因为犯罪率高的人群往往也是受教育程度较低的人群，因此他们认为让犯人接受教育,刑满回到社会后，二次犯罪的概率会大幅降低。\n\n事实证明，这个理论是成立的。英国司法部的统计显示，有了监狱教育后，二次犯罪率降低了一半以上,从而为司法系统节省了大量预防犯罪和起诉罪犯等等的开支，也就是说监狱教育替纳税人省了钱，也提高了纳税人的安全保障，\n\n监狱教育，一方面拯救了犯人的后半生，方面保护了纳税人的钱袋和安全。相信犯人也能通过教育洗心革面,是人道至上的文明理念，绞尽脑汁为纳税人减负、对纳税人负责，是饮水思源的现代执政理念。说白了，人家的ZF，知道自己是谁，知道是谁养活了谁，谁该为谁服务。\n\n教育的目的本来就是商人，通过教育让孩子们成长为更好的自己.在社会上找到自己的位置，为社会发展责献-己之力,也出幸福快乐的自己，连犯人接受教育洗心革面，是人道至上的文明理念，绞尽脑计为纳税人减负对纳税人负责，是饮水思源的现代执政理念，说白了，人家的ZF，知道自己是谁,知道是谁养活了谁，谁该为谁服务。\n\n教育的目的本来就是育人，通过教育让孩子们成长为更好的自己，在社会上找到自己的位置，为社会发展贡献一己之力，也活出幸福快乐的自己。连犯人接受教育后都能洗心革面，更何况还处于思想成长期的孩子?以思想政治审核的名义剥夺孩子接受高等教育的权利，岂不是背离了教育的初衷与目的?人家资本主义国家都有信心教育好犯人，N个自信的你们倒没信心教育好孩子吗?\n\n以思想政治审核的名义到夺孩子接受高等教育的权利,说白了就是把公民该有的权利当做奖赏与筹码来控制孩子脑子里想什么。孩子连思想的自由都没了，还会有创造力吗?难怪泱泱大国十四亿人口却造不好一个小小的芯片，造不好一个小小的圆珠笔尖。也难怪国产骄做华为手机竞然是日本人研发的。\n\n有些东西，长点心吧,别老为了自己小集团的利益把全国人的利益和权利踩在脚底，把干千万万人的命运当儿戏，当心“上天难，装逼遭雷劈\n\n政审,审你大爷！",
			"added": 1541916450,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"1_113Pbte2GsyoEesvt3JTM8Amr8xCvJ8CER": [
			{
				"comment_id": 1,
				"body": "人怎么说关你屁事？你就是一犯红眼病的货！",
				"added": 1541387955
			}
		],
		"2_1Nv9coai3XzgiS8VgetKQF7VXxfZZoJq93": [
			{
				"comment_id": 2,
				"body": "不愧是靠发帖挣钱的五毛，为靠有效帖数挣钱真的绞尽无数博士级小学生的脑汁。\n不知道兲朝网站满屏的哭了，跪了，尿了的新闻有啥好评论的？\n\nzeronet的技术皮毛都不知道还设想，跟习博士的人类命运共同体比比如何？",
				"added": 1541916854
			}
		],
		"178_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 3,
				"body": "> [remarkable](#comment_63_1Nv9coai3XzgiS8VgetKQF7VXxfZZoJq93): 我说的“撒谎”指的标题为《国内再无个人及家庭隐私可言了》的报道——不好意思，即是你。如果只看我党的报道，可没有把“雪亮工程”报道成无隐私工程。不知道您的标题中“再无个人和家庭隐私”从何而来。\n\n你要相信匪党把高清摄像头，麦克装你家客厅卧房是为了保护你和你家人的人身财产安全，那别人也真的不好说什么。\n但如果你要蛊惑其他人也相信你和匪党，那你就真是个贱种了！",
				"added": 1541927201
			}
		],
		"1_18JqgXYQvzEHxKm3CyMN3k9JxsPfVpisJm": [
			{
				"comment_id": 4,
				"body": "单凭“妄议中央”这一条规矩就知道他是个草包，智商还不及俺家的边牧！\n“二”的名号，对一般人是调侃，但“习二”可是一步一个脚印实打实干出来的，实至名归，无人能望其项背。",
				"added": 1542089102
			},
			{
				"comment_id": 9,
				"body": "> [xyoax](#comment_6_18JqgXYQvzEHxKm3CyMN3k9JxsPfVpisJm): 妄议中央?你麻痹你干嘛来zeronet sb.就他任时还有时间出书逗不,是想青史留名吗,他是个被主席耽误的作家吧?\n\n真是个无脑猪头，兲朝人民就这种智力水平？出一个习近平不是偶然而是必然啊。\n同样问候一下你麻痹！",
				"added": 1542259343
			}
		],
		"1_1Jm5yf8rx8at9LHKcu2t3pWXtXkFbPnfGS": [
			{
				"comment_id": 5,
				"body": "60年的茅台，你付钱了没？\n60年开工62年建成的滴水洞别墅你付钱了么？",
				"added": 1542182271
			},
			{
				"comment_id": 6,
				"body": "毛泽东在住的方面耗费公帑最甚。1959年毛泽东到韶山故居水库游泳，看到这里谷深青幽，竹木繁茂，流水潺潺，是避暑疗养的好处所。他便跟陪同的湖南省委书记周小舟说：你能不能在这里给我搭一个茅草屋啊？我来游泳的时候有个休息地方，等我退了休，也好有个住处。于是，第二年这里便耸立起一座仿中南海主席住处建筑风格，集办公室、卧室、卫生间、图书室、（后来又有了防原子弹的地下行宫）于一体的“滴水洞”别墅群。造价值1.2亿元。当年是无数百姓活活饿死的悲怆岁月，一亿二千万元能买十多亿斤粮食，救活几百万条命。本文摘自网络。\n\n\n1966年6月21日，毛泽东在韶山滴水洞和中央警卫局张耀祠、湖南公安厅高文礼、警卫处长曲琪玉（后排从左至右）合影（图源：《张耀祠回忆录：在毛主席身边的日子》）\n\n在普遍贫困的毛时代，毛的行宫遍布全国，远远超过古今中外的历代皇帝。那些行宫，无论是从规模还是从豪华的程度来说，都与民居有天渊之别。修一座行宫的钱，供他每天山珍海味地一辈子也绰绰有余。邓小平1980年8月18日在政治局扩大会议曾说：“1958年以后，到处给毛泽东同志和其他中央同志盖房子，造成很坏的影响，很大的浪费。”彭德怀1959年在庐山会议上也提到“好多省都给毛主席修别墅，搞什么名堂？”\n\n毛泽东一进城就选择了帝王的住所中南海。从58年开始，各省市为毛造行宫，一些中等城市如包头、鞍山等也竞相效尤。河南郑州的省委第三招待所修建于60年，在远离市区的黄河附近。当时正值河南省内饿殍遍野，但这些宫殿照样大兴土木，用靠高征购、高积累聚敛起来的民脂民膏兴建的这个宫殿群永远将铭刻在这些累累白骨堆起来的墓碑上。这个行宫除按当时中央委员和候补中央委员的人数以每人一个套间盖了一幢大楼外，还别出心裁地给当时中共的七位领袖每人建了一幢别墅，从总书记到党中央主席规格面积逐级递增，以毛别墅最为宽大考究。毛的卧室里专门修了一条秘密地道，用以毛遭遇万一情况时逃跑。当年建成后因信阳事件案发，中共中央再没来郑州开会，尤其是那幢主席别墅永远紧锁着大门，自建成从未有人住过。如今已经改为达官显贵下榻的黄河迎宾馆，或许将其改为纪念无数河南饿死鬼的大跃进纪念馆更为合适。\n\n414工程上海西郊宾馆圈地1133亩，是上海最大的花园别墅式国宾馆，始建于1960年9月。园林、花木、房屋修建，连同女服务员，100多人长年为它服务。20年间，毛泽东总共没有住过几天，而100多人的工资外加维修费用，恐怕一年不下百万。湖南省委在长沙为毛泽东建的蓉园一号，也仅在1959年住过一次。要是将各省为毛泽东建的房子合在一处，其规模大概也可以和紫禁城相比了。要是拿前国民党政府总统蒋介石的别墅同毛泽东、林彪等中共领袖的“房子”相比，那就寒酸了。仅庐山一处，芦林一号的建筑面积就是蒋介石那座美庐的5倍，而美庐也归毛泽东使用。济南南郊宾馆建于60年代初，占地面积1,160亩，建筑面积115,800平方米，素有山东钓鱼台之称。金华西郊一片树林里，有幢500多平方米的601别墅建于建于1961年。主房子设有一处地下指挥部，入口处设有厚厚的电动钢板门。不远处还有一个小型铁路站台，并铺设了投资36.2万元的601铁路专线，火车可直达毛的行宫后门。毛泽东喜欢杭州的西湖行宫和武汉的东湖行宫，广州就要为他特别修建南湖行宫。绝大多数行宫常年空着，但也要众多工作人员为空荡荡的行宫服务，浪费掉的民脂民膏难以计数。\n\n在饿孚遍野的1960年5月中旬，毛泽东在湖南与张平化谈起韶山，说那里有个滴水洞，地方很好。张平化深谙朕意，便主持修建了湖南韶山滴水洞行宫，代号203工程。整个滴水洞地区封锁保密。参照毛泽东在中南海的住房式样，再吸取苏联建筑保暖防寒的优点，修建了以三座大楼为主体的建筑群，毛泽东住的那栋楼有主房、副房、会议室、餐厅、娱乐室等，同时还修通了韶山冲到滴水洞的公路。后来又增修了防核防空的防空洞。滴水洞工程建于大饥荒年代从1960年下半年开工到1962年，一、二、三号主体工程完工，建筑面积共3638.62平方米。连同韶山冲至滴水洞的公路，也同时竣工。整个工程造价高达上亿元。在此期间，全国有四千多万人死于大饥荒，创人类历史和平时期死亡记录。\n\n与滴水洞同时建造的领袖别墅还有：庐山芦林一号别墅、南昌八二八宾馆、长沙蓉园、成都金牛坝宾馆、武汉东湖梅龄别墅、武汉东湖宾馆、郑州省委第三招待所、北戴河莲花山别墅、北京密云水库别墅、哈尔滨花园村一号楼、广州南湖行宫、广州小岛一号楼、南京紫金山宾馆、济南南郊宾馆、青岛迎宾馆、青岛八大关小礼堂、杭州西湖行宫、杭州刘庄宾馆、杭州汪庄宾馆、金华601别墅、上海西郊宾馆等61处奢华行宫，其中滴水洞使用率最低，滴水洞从1962年竣工到80年代末期开放，毛泽东仅于1966年6月18日至28日在此居住过11天，真是一日千万金。1986年滴水洞终于水滴石穿，对外开放，已经变成韶山的著名旅游景点。\n\n庐山庐林一号、武汉梅岭一号、湖南滴水洞别墅、杭州刘庄、广州南湖行宫。",
				"added": 1542182287
			},
			{
				"comment_id": 7,
				"body": "这些行宫即使在现在也是打着腊肉的旗号招揽顾客！",
				"added": 1542182337
			},
			{
				"comment_id": 8,
				"body": "1958-1960，在中国是个饿殍遍野的时代。",
				"added": 1542182398
			}
		],
		"1_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 10,
				"body": "> [hwong](#comment_8_19CAUZrhQtkzsCEUzWY8tK5RT3EnGheA6k): 很讨厌这些推销政见者，兴百姓苦，亡百姓苦，这么浅显的道理都不懂\n\n兲朝的百姓苦纯属活该，它们成天等星星盼月亮，求明主求青天大老爷，却从来也走不出自己的一亩三分地，\n弱势的时候装苦逼，强势的时候不可一世。\n它们只是没有机会，一旦获得权势，就会欺压弱势的一方，整个一死轮回！\n从不知道求公平正义，不懂得利他就是利己。\n几千年下来还是原地转圈，可怜可悲更可恨！",
				"added": 1542260326
			}
		]
	},
	"comment_vote": {}
}