{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1554989632,
			"title": "Assange Arrested",
			"body": "This should concern us all:\nhttps://caitlinjohnstone.com/2019/04/11/assange-has-been-arrested-for-us-extradition-the-time-to-act-is-now/",
			"added": 1554989631
		},
		{
			"topic_id": 1557452116,
			"title": "Best Statistics Websites",
			"body": "Can anyone suggest websites with good statistical data? If possible please state pros/cons, overall impression.",
			"added": 1557452114
		},
		{
			"topic_id": 1560821466,
			"title": "Why We Use ZeroNet",
			"body": "and why we need more de-centralized technology like it ...\n[Chinese Social Credit](https://www.youtube.com/watch?v=eViswN602_k)",
			"added": 1560821463
		},
		{
			"topic_id": 1561879672,
			"title": "What is the difference between a rapist and a voter?",
			"body": "Yes, it's a hyperbolic question, but I'm genuinely interested to know what YOU think.",
			"added": 1561879668
		}
	],
	"topic_vote": {
		"1516184122_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": 1,
		"1541703008_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1557356335_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1557536353_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1558691316_15Gk4wzjyNbPU3JZ31UnqMM3CMrX8pxmzF": 1,
		"1562036082_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1562093171_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1563987524_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": 1,
		"1565142123_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": 1,
		"1566704216_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1
	},
	"next_comment_id": 128,
	"comment": {
		"1516184122_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": [
			{
				"comment_id": 1,
				"body": "Hi, \n\nI have read: http://zeronet.readthedocs.org/en/latest/faq/#how-can-i-register-a-bit-domain\nbut so far I'm unable to display the site through it's .bit address.\n\nI have a ZeroNet site: http://127.0.0.1:43110/1C1hKsqjQTR1iy1ijB3qtrqBwfH2Hf7TMW/ I bought a .bit domain: squashpassionapps.bit which is verified at: https://namecha.in/name/d/squashpassionapps\n\nIs the namecoin domain 'pointing' to the zeronet address because the 'value' is the the Bitcoin address generated by zeronet (1C1hKsqjQTR1iy1ijB3qtrqBwfH2Hf7TMW)?\n\nIf so it's not working when I type \"http://squashpassionapps.bit/\" or \"http://127.0.0.1:43110/squashpassionapps.bit/\" into the browser  (http://127.0.0.1:43110/1C1hKsqjQTR1iy1ijB3qtrqBwfH2Hf7TMW/ still works fine).\n\nUpdate: I've added the following to the data field: {\"ip\":\"<my IP>\", \"map\": {\"*\": {\"ip\":\"<my IP>\"}}} \"zeronet\": { \"1C1hKsqjQTR1iy1ijB3qtrqBwfH2Hf7TMW\": \"1EU1tbG9oC1A8jz2ouVwGZyQ5asrNsE4Vr\", \"blog\": \"1BLogC9LN4oPDcruNz3qo1ysa133E9AGg8\", \"talk\": \"1TaLk3zM7ZRskJvrh3ZNCDVGXvkJusPKQ\" }\n\nIs this correct? Is there more I should add? I'm on win 7 and have avoided the CLI so far and would prefer to work just from the GUI, which should be possible if it is to achieve wider adoption.\n\nCurrently the Chrome browser just reports:\nNot Found\n/squashpassionapps.bit\n\nWhat have I missed?/Should be looking at?\n\nThanks for any help ...",
				"added": 1529055179
			},
			{
				"comment_id": 3,
				"body": "Update: I used the simple format in the 'value' field of 'manage names' in namecoin-qt:\n{\"zeronet\": { \"\": \"1GW6cZopqosRPfRs8sws9P8nAjorEQGo4C\"}}\nand finally got my .bit address working through my browser (only once the block countdown had started in namecoin-qt).\nThe documentation (referring to sub-domains etc., although useful in for more advanced use) was misleading. Simple as possible (as above) first is best to get up and running initially.",
				"added": 1529993265
			}
		],
		"1516732205_18cuVo4ak3NDVwhTCXE5WtUc4q5ZXYYMu1": [
			{
				"comment_id": 2,
				"body": "I got from WEX a couple of days ago - no problems ...",
				"added": 1529055316
			}
		],
		"1526455814_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": [
			{
				"comment_id": 4,
				"body": "I've created some original content (a site). Is there any way I can be identified as the original creator of that content? I know it can be copied and 'improved' upon, which is fine. The site has a 'donation' page for anyone who may appreciate the original content. Presumably there's nothing to prevent someone simply changing the donation crypto references and re-publishing the site as their own? Do I need to make it a 'private' site?",
				"added": 1529994891
			},
			{
				"comment_id": 5,
				"body": "> [marketforce](#comment_23_1ENvPHLeuUKJAWsup9tL9C1mdZeb1ycjp8): As was said, there's nothing that can prevent others from republishing. But I guess you could digitally sign the hash of your content with your site's private key and publish the hash and the signature here. Then if somebody copies the content there would be a proof in everyone's zeronet database that you were the first to publish it.\n\nThanks guys for the responses. I will try to digitally sign which might be best of both worlds. Ability to claim original ownership whilst enabling anyone to improve according to their own requirements.",
				"added": 1530061006
			},
			{
				"comment_id": 6,
				"body": "Isn't the  hash of the content of the two main files (in content.json) already generated from the site's private key in users.json? The signature is the public key address of the site. So I post that and the hash of the two main content files here and I should be good to go? Which makes me consider if there could perhaps be some kind of 'original content' register linking relevant content hashes with ZeroID?",
				"added": 1530069668
			},
			{
				"comment_id": 7,
				"body": "Thanks for the info. For the sake of clarity, this is my understanding: I can sign the site with any message I like. The signature (generated with the private key) will be cryptographically related to both the message and the site's address (public key) proving that only I (owner of private key) could have created that signature relating to that message. If challenged I could send a message to the challenger relating to the same address (public key) and another signature (which would be different if the message is different),  again proving my ownership. In other words because of my ownership of the private key only I can relate messages to the site address (public key)/signatures.",
				"added": 1530240214
			}
		],
		"1530706658_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 8,
				"body": "Any of them from SAD/PAG? https://en.wikipedia.org/wiki/Special_Activities_Division",
				"added": 1530715978
			}
		],
		"1534274094_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 9,
				"body": "I wrote an [article on this](http://127.0.0.1:43110/1NKRzUcFsMC6ihXDMtKi5EVwKopShVtYHE/?Post:6:Emancipate+Women+By+Attacking+Men%27s+Freedom+-+A+%27Good%27+Idea+) a while back ...",
				"added": 1534324579
			}
		],
		"1535350915_1JqBT2ANj2qEW2CVpLoNji7ZozNEf4oQt1": [
			{
				"comment_id": 10,
				"body": "Can hear shots but doesn't show anything ...",
				"added": 1535416744
			}
		],
		"1535570683_1EfMhUuLdZe7M91AqnKmPKrbTTNfE2ECJj": [
			{
				"comment_id": 11,
				"body": "I've set up Linux Mint and a development environment (Github/Atom/Embark) on two separate PCs and been pleased with the results.",
				"added": 1535588748
			}
		],
		"1536242915_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 12,
				"body": "Forget the 'MEP's and other politicians. Get your friends/associates onto ZeroNet and don't look back ...",
				"added": 1536283592
			},
			{
				"comment_id": 15,
				"body": "> [bvkgkg](#comment_1_13DCCcLjfMB4hPDdV7kFtYZnt5cBBDguzS): we are fighting the deep state here. No matter how much you vote, the state will always win. We must start a revolution and destroy the state\n\nDon't 'destroy', [undermine with counter - economics](https://en.wikipedia.org/wiki/Agorism)\n\nThe simple fact is the State will keep looking for new ways to censor the Internet. If this petition succeeded they'd conjure up another one before long ...\n\n[Agora](http://127.0.0.1:43110/agorablog.bit)",
				"added": 1536540663
			}
		],
		"1537287344_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 16,
				"body": "I'm busy giving out 'Free Ross' leaflets -  free trade shouldn't be illegal",
				"added": 1537344714
			}
		],
		"1537816041_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": [
			{
				"comment_id": 17,
				"body": "I would like to express my un-appreciation for any centralization of power ... get the State off the individual's back ... say 'no' to taxation ...",
				"added": 1537841236
			}
		],
		"1538552691_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": [
			{
				"comment_id": 18,
				"body": "I agree it should be something familiar to people on this forum (if not here, where?). I've Whatsapped people in my [meetup group](https://www.meetup.com/Red-Pill-Society/discussions/) to support Ross and to friends/family and corresponded with his mother. I've also been giving out \"Free Ross\" leaflets in the park for months. Few that I meet appear to appreciate the significance although the petition is going relatively well.",
				"added": 1538658951
			},
			{
				"comment_id": 19,
				"body": "> [homulilly](#comment_72_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD): Libertarians are fucking stupid, man\n\nAsinine. Care to elaborate?",
				"added": 1538885779
			},
			{
				"comment_id": 20,
				"body": "> [homulilly](#comment_80_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD): Huh, interesting. Insanely fucked up he got life in prison then.\n\nIt's Libertarians (and Agorists) who are most consistently and vehemently opposed to this kind of State activity against free market places.",
				"added": 1539152169
			},
			{
				"comment_id": 21,
				"body": "> [homulilly](#comment_81_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD): They should be more focused on prison reform.\n\nI suggest they're correctly focused on the absurdity of the idea that a market place should be outlawed and that imprisonment for free trade is legitimate. The actual conditions of imprisonment are almost completely irrelevant to that debate. If you think prison reform is more important you're a Reformist. Why should a Libertarian focus on something that has very little to do with Libertarian-ism?",
				"added": 1539237234
			}
		],
		"1539790604_1BJ3zfhsAzFD9FGBQeoN8jq7WU5WKSuyVH": [
			{
				"comment_id": 22,
				"body": "[Echoes of WW1](https://www.corbettreport.com/echoes-of-wwi-china-the-us-and-the-next-great-war/)\nAnarchy (no leaders), not Socialism (forcing your values onto others via State violence) is the way out ...",
				"added": 1539841086
			}
		],
		"1540443278_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 23,
				"body": "Here's a story about how people who are supposedly anti-mainstream have been doing just such a thing. [Hope you find this relevant/interesting ...](https://steemit.com/kokesh/@larkenrose/67obapny)",
				"added": 1540447901
			}
		],
		"1541600740_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 24,
				"body": "Disliking child abuse isn't a reason to dislike ZeroNet. Child abuse is a manifestation of one person's Will being imposed without consent upon another (a foundational concept of our Society); ZeroNet is a manifestation of free speech, something that is essential to limiting the ability of the powerful to impose their Will upon the weak. You're disliking (a part of) the remedy because you dislike the symptoms of the disease, which, I suggest, is neither moral nor rational.",
				"added": 1541637204
			},
			{
				"comment_id": 25,
				"body": "> [moor](#comment_41_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): back up a little bit, symptom/disease was just an analogy, but you can't conclude from it. either way i think you are wrong,  (the act of) disliking may be subjective but it can essentially be objective and thus either rational or moral. [...]\nWhat do you consider to be \"the actual consequence of the nature of ZeroNet\"?",
				"added": 1541640743
			},
			{
				"comment_id": 26,
				"body": "> [moor](#comment_43_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): exactly what you said, \"ZeroNet is a manifestation of free speech\", by being as such it defines the problems implied in it, free speech can take many forms, these forms, whatever they may be, are the consequence of 0Net nature.\n\nIf free speech takes the form of ZeroNet, am I wrong to say \"Disliking child abuse isn't a reason to dislike ZeroNet\"?",
				"added": 1541643855
			},
			{
				"comment_id": 27,
				"body": "> [moor](#comment_44_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): that wasn't my problem with your statement, but only the part that I've highlighted, which was your analogy.i agree with what you've said and the use of the analogy \"You're disliking (a part of) the remedy because you dislike the symptoms of the disease\" but you conclude from the analogy \"which, I suggest, is neither moral nor rational\". [...]\n\nThanks for your point. I will consider the issues under [Argument from analogy](https://en.wikipedia.org/wiki/Argument_from_analogy) and how they relate.",
				"added": 1541647093
			},
			{
				"comment_id": 28,
				"body": "> [peterme](#comment_1_1MbDT6wKmPFovbPV6q7E5LDN3GeYWiiNNW): what about deriving the moral from http://www.un.org/en/charter-united-nations/ ?I would propagate that und would be glad if i find followers here.\n\nDoes centralizing power lead to moral outcomes? for e.g. [Is the EU's recent pronouncement on free speech moral?](https://www.nationalreview.com/2018/10/free-speech-sharia-european-court-of-human-rights-ruling/)",
				"added": 1542246252
			},
			{
				"comment_id": 29,
				"body": "> [ornataweaver](#comment_49_139zVkd4AsZqs9qSYk6ypPDAqDcjPCmRm4): What I truly dislike, is seemingly selfless people expecting you to be selfless for them.It's a twisted and sick kind of selfishness.\n\nAgree. Writing this immorality into law in the form of taxation (extortion) is it's visible manifestation.",
				"added": 1542352906
			}
		],
		"1547014808_1JGp4gaBwTZ6rjuLytHJ1o9C93kfk7UQiD": [
			{
				"comment_id": 30,
				"body": "Is there any way for a Chinese person to access a free idea?",
				"added": 1547027157
			}
		],
		"1548145805_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 31,
				"body": "The US is supporting regime change and they have no real interest in upholding their own or anyone else's Constitution. This will be used as a political football until people realize that all forms of Statism are illegitimate.",
				"added": 1548204430
			}
		],
		"1549561050_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": [
			{
				"comment_id": 32,
				"body": "\"Support the program from the state budget\". Where does the money for that come from? The State's extortion racket. Not a good basis for a free system. Don't vote, pay for the services you want with no expectation of others to 'pay their share'. If people really believe in the idea they'll pay to make it happen ...",
				"added": 1549588356
			}
		],
		"1546031606_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 33,
				"body": "Thx. Good question...",
				"added": 1550761484
			},
			{
				"comment_id": 34,
				"body": "> [randomshit](#comment_2_18wj1JzTXc2gNiG4MnUvToPyJkB4e6P79r): I had a similar experience, I remedied it by  [...]\n\nThx. Useful info ...",
				"added": 1550761501
			}
		],
		"1541703008_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 35,
				"body": "Thx. Useful...",
				"added": 1550795842
			}
		],
		"1552644409_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": [
			{
				"comment_id": 36,
				"body": "As an Agorist, I would say that there is no censorship in an Agora. New Zealand is a nation state. Such an artificial entity will look for ways to perpetuate it's existence; fear and ignorance being primary sources. It needs censorship to survive. Do you?",
				"added": 1552960025
			}
		],
		"1553596906_1Lh89nAb4YeizEER15JUcpscy37mZwDUer": [
			{
				"comment_id": 37,
				"body": "State/corporate attacks on free speech never do 'more good than harm'",
				"added": 1553673389
			}
		],
		"1554091689_12J9C7UzPWdvcmGtYGDRqnLsjpUByVPtwk": [
			{
				"comment_id": 38,
				"body": "> [d14na](#comment_90_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4): Email seems so \"legacy\"; why not use Matrix? Offers integrations (video link) to IRC, Telegram, Slack, and so many others.\n\nMatrix is interesting ...",
				"added": 1554177525
			}
		],
		"1554989632_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": [
			{
				"comment_id": 39,
				"body": "> [anonymoususer234](#comment_1_12aP9VpiXhkCuYDpT7jpK5qbSMBt8m2jb8): This is absolutely horrible that you can get arrested for exposing government secrets that violate human rights. Is the government not made to serve the people?\n\nNo. It's an extortion racket made to serve itself. Don't vote - it makes them think they have a Right ...",
				"added": 1555027829
			},
			{
				"comment_id": 40,
				"body": "> [deadfwd2018](#comment_9_19DoHhKBBkfpbVjRyo5mvdJVTqK96xZyYr): Well he did divulge the secrets of an entire nation. Flip it around, what if he did that to Russia? He would have been dead now.\n\nHe passed along a selection of the secrets of a tiny clique of gangsters. If he did that to Putin, and his Russian gangsters, he might be dead. Going from imprisonment to death isn't flipping it around; it's the same idea taken to it's logical conclusion. My opinion is that this is not a 'good' development. What's your opinion?",
				"added": 1555058628
			}
		],
		"1555449613_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": [
			{
				"comment_id": 41,
				"body": "Why value of BCH coming down?",
				"added": 1555463585
			},
			{
				"comment_id": 56,
				"body": "> [geekosan](#comment_8_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4): Bitcoin.com, that's why. They are hoaxing people who are interested in Bitcoin to invest in BCH instead. That's kind of like selling a Lada with a red paint-job as a Ferrari.\n\nThey must be good ar it since the value is going up...",
				"added": 1555996649
			},
			{
				"comment_id": 59,
				"body": "> [delta9](#comment_2_1AnpXwyjaKj6ccazqk7NKYCL8skScCMpG1): BCH is in full-on bull pennant formation at the moment based on the TraderView charts referencing Coinbase. It is the top performing larger-cap altcoin over the last three months with EOS up there as well.\n\nIndeed ...",
				"added": 1556026114
			}
		],
		"1555707064_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 42,
				"body": "Listen to [Hazlett - Economics In One Lesson](https://youtu.be/L6Lw-QAHzk4) to understand why this would be repeating old mistakes and making things worse. Don't vote. Ignore politicians.",
				"added": 1555727588
			},
			{
				"comment_id": 43,
				"body": "> [adotham](#comment_9_1P8TFEmsFJruqWErsBLpTxmpczHFW3raWF): Right, because the best way to make yourself heard is to stop speaking\n\nPoliticians speak to coerce with violence. Can you only speak through them?",
				"added": 1555753829
			},
			{
				"comment_id": 44,
				"body": "[David Friedman](https://www.youtube.com/watch?v=Bpn645huKUg) encourages us to consider a system in which we can put our money where our mouth is and remove the need for politicians as they are conceived of today. Real change comes from ideas, which is why there's a concerted worldwide effort to censor. Don't let them divide and conquer. Give everyone the ability to choose economically rather than through 'rationally ignorant' voting.",
				"added": 1555893975
			},
			{
				"comment_id": 45,
				"body": "> [anonymouslogin](#comment_229_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I  suspect a solution such as this would require a revolution, and my experience with the US is one of widespread apathy. Revolution doesn't seem likely. I think incremental change perhaps through rationally ignorant voting will get more done in the short term.\n\nSlavery wasn't abolished incrementally.  For a good reason. It's wrong in principle. So is [voting](https://www.youtube.com/watch?v=hdKmkg6GVDU)",
				"added": 1555899137
			},
			{
				"comment_id": 46,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_38_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"Slavery wasn't abolished incrementally. For a good reason. It's wrong in principle.\"Obviously [...]\n\nLearn to listen. Watch the video before replying. Yes, voting is a tool, but who is really wielding it?",
				"added": 1555900673
			},
			{
				"comment_id": 47,
				"body": "What they didn't realize is that giving the slaves 'freedom' [wouldn't make any real difference](https://www.youtube.com/watch?v=vb8Rj5xkDPk).",
				"added": 1555905858
			},
			{
				"comment_id": 48,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_39_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"Yes, voting is a tool, but who is really wielding it?\"Those who vote, hence the interest of voting, [...]\n\nThose who vote gave us Clinton, Bush, Obama, Trump - all freedom haters.They delude themselves as they fall into the trap. But far more importantly they delude the underlings who do the dirty work into believing they have the Right to use violent coercion to impose their will on others. Many have seen it for what it is and hence there is often little interest in voting in the political sphere. The 'interest' only grows among those who don't really understand what they're doing - which is why they're encouraged to do it ... Even Adam Kokesh 'Not For President' doesn't work.",
				"added": 1555979776
			},
			{
				"comment_id": 49,
				"body": "> [anonymouslogin](#comment_231_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Who said anything about worship? What do you advocate? Anarchy?\n\nWhat's wrong with anarchy?",
				"added": 1555979886
			},
			{
				"comment_id": 50,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_44_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Nothing wrong:absolutely nothing: it gives me the right to kill you: and to go and have a little cocktail afterwards, just before raping your wife and killing your parents for the end of the evening: I See Only Advantages.\n\nHow does anarchy give you the Right to kill me?",
				"added": 1555986146
			},
			{
				"comment_id": 51,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_45_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Politics is a game of chess, not a game of elections, democracy is a Masonic Fallacy; if the people were sovereign, they would have no reason to vote.the majority of states were created by freemasons. it is for this reason that symbolism is identical worldwide and so is architecture. [...]\n\nVoting is not playing it 'smart'. Look around. You seem rather obsessed with Freemasons. Like politicians (of whom many are Freemasons) I suggest simply ignoring them and building your own systems of collaboration and commerce. Let them slide into irrelevance ...",
				"added": 1555986636
			},
			{
				"comment_id": 52,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_46_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Because I like it and there is no prison. Isn't that a great model ?\n\nYou would like to kill me? You don't even know me ... There may be a prison ... It depends on whatever arrangements I have with my preferred [Rights Enforcement Agency](https://www.youtube.com/watch?v=jTYkdEU_B4o).",
				"added": 1555989732
			},
			{
				"comment_id": 53,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_47_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): You should be obsessed with the Masonic Perspective but like most people you are far too wrapped up in your filthy ignorance to understand how this world really works. Don't worry, they've got you warm in the palm of their hand. [...]\n\nWhere will you be?",
				"added": 1555989839
			},
			{
				"comment_id": 54,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_48_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Anarchy means no prison, now you want a prison, so it's no longer anarchy kiddo;it's order. [...]\n\nHow are you defining anarchy?",
				"added": 1555993099
			},
			{
				"comment_id": 55,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_49_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Where do you want me to be, looney,you choose your neighbors ?\n\nWhere do I want you to be? Getting an education somewhere ... i don't wish to be rude, but you did ask ...",
				"added": 1555993238
			},
			{
				"comment_id": 57,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_50_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): lol. You're talking about anarchy and you don't even know what anarchy is. You're here for a salon chat, you need cupcakes with your tea?\n\nThat's not an answer. Can you answer the question?",
				"added": 1556023830
			},
			{
				"comment_id": 58,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_51_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): It's not very grammatical, these bits of sentences.\n\nExcuse me. It wasn't apparent from your posts that grammar is important to you ...",
				"added": 1556024143
			},
			{
				"comment_id": 60,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_54_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Everything I learned I learned by myself, I never waited for the answer.If you expect something from me, you're not going to be served. [...]\n\nI didn't think so ...",
				"added": 1556033618
			},
			{
				"comment_id": 61,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_55_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): WHO CARES. lol. Not Me.You are trying to establish a dialogue to brighten up 'your dull life'. If you're not aware yet, sitting behind a computer is NOT EXACTLY LIFE.Ah these young generations and their virtual worlds; they shop online, they fuck online, and think that a chat IS AN EXCHANGE BEWTEEN PEOPLE. These generations are so lost.\n\nIt's clear who is lost  ...",
				"added": 1556065013
			},
			{
				"comment_id": 64,
				"body": "> [gametangia](#comment_18_193rzuH9AAHfvHKwSFS5oq6jRpXwDJ2rEW): That is true, nations don't account for external costs, businesses and customers do. And I already gave a pretty fair example of how environmental costs are handled in a free society. People want clean air, people want clean water, people don't want mercury and coal dust dumped in their back yards, and if you privatize these costs with DROs, then suddenly you have people spending money on protecting the environment, and that money is invested in R&D and infrastructure to limit environmental damages; and the companies with the best R&D divisions sell the best technology to other firms and so on.I don't know what you do for a living, I don't want to make any presuppositions, but I do think that people who don't work natural resource management have been painted an inaccurate picture of how procurement companies function. I manage forests and timber/fiber plantations, and here in the southeastern United States, 95% of forested land is privately owned, it is productive, well kept, and sustainably managed because people harvest the wood on it. You hire timber cruisers to assess the property, some trees are taken for lumber, others are left to regrow the forest. Meanwhile the government managed land out west is Hell--theirs is used more for grazing than forestry of course but compare the value of an acre of government land set aside for ranchers to graze cattle on to an acre of privately managed land, it's night and day. [...]\n\nThanks for a response which demonstrates you actually know what you're talking about. One of the problems of our current electoral system is that your opinion on this topic only carries as much weight as the next brainwashed group-thinker. It's not granular so that those in the know get to determine how an industry e.g. timber, is properly managed. Instead people look for one 'dear leader' who can take all the responsibility and do all the thinking for them (and end up just telling the ignorant what they want to hear). The best way I'm aware of to make that transition is to abandon traditional politics as we know it altogether and allow our spending to do the 'talking'. If some of the contributors here had to put their money where their mouth is, it wouldn't be long before they had very little currency left to do any damage with their shallow and irrelevant thinking. This is Agorism.",
				"added": 1557104108
			},
			{
				"comment_id": 67,
				"body": "> [anonymouslogin](#comment_267_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I fail to see how America's leadership could get worse than Trump and his policies.\n\nIt always gets worse as each new administration bloats the bureaucracy of the State, trampling freedom as it goes.",
				"added": 1557127295
			},
			{
				"comment_id": 68,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_102_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): We must train generations and generations of LEADERS WITH VALUES, there are no miracles. no leaders=no defenders of values.= destruction of society From Within.\n\nSo you want someone else to make all the tough decisions on your behalf? The search for 'leaders' is the problem. Use your own judgement.",
				"added": 1557189595
			},
			{
				"comment_id": 69,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_108_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): One example I did in the army, there were people I hated, but I also saw people who made me realize that I could follow THEM BECAUSE THEY 'WERE VALUABLE'. [...]\n\nThey must have resonated with your existing value system for you to perceive them as valuable. It came from you, not them. You don't need to be in the army to recognize people you value and to decide for yourself if you will follow them (e.g. perhaps your boss at work). In the army you must follow the people you hate as well as the people you value. Sacrificing who you are and your value system for the supposed 'greater good' is a tragic loss to humanity, of your humanity.",
				"added": 1557276646
			},
			{
				"comment_id": 70,
				"body": "> [anonymouslogin](#comment_269_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Aside from the obvious political persuasions of China in general, all I see is  a man with a committee overseeing the removal of corrupt officials from positions of power in the Chinese government. Xi Jinpings doesn't appear to me to be anything but a good influence on the governmental structure.\n\nOur media is managed, as it always has been, so that we see enormous concentrations of power in the hands of single individuals as a positive development. Even if he is a 'good influence' (I'm in no position to determine), if you're a good influence on a bad entity, is that a good thing?",
				"added": 1557277784
			},
			{
				"comment_id": 71,
				"body": "> [anonymouslogin](#comment_272_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Bad systems (entities) don't get better without good influences. The fundamental structure of the US political system is not likely to change quickly. Why perpetuate the agenda of the bad system by electing people who are likely to perpetuate it?\n\nIndeed, that's why I'm suggesting not electing anyone. Ignore them all and encourage them, and everyone else who never considered the idea, to understand that their perceived 'authority' is a dangerous delusion.",
				"added": 1557297601
			}
		],
		"1556340609_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 62,
				"body": "A threat may be evidence that you can pass on to your chosen private security agency - no more. Certainly not an excuse for the extortion racket known as the State to destroy free speech.",
				"added": 1556353292
			}
		],
		"1556096165_18aVoqjXuLUuftUDoyhsawC3TLdWGW6tqh": [
			{
				"comment_id": 63,
				"body": "They have no idea what the point is ...",
				"added": 1556462871
			}
		],
		"1557049303_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 65,
				"body": "Why the silly title?",
				"added": 1557104312
			},
			{
				"comment_id": 66,
				"body": "> [duende](#comment_36_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): Why not? People need to hear this message.\n\nDo they? How does anyone benefit from this?",
				"added": 1557108637
			}
		],
		"1557356335_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 72,
				"body": "They're turning out the lights. Few are noticing. Thanks for alerting me to this one ...",
				"added": 1557408528
			}
		],
		"1557452116_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": [
			{
				"comment_id": 73,
				"body": "> [duck0](#comment_58_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): What type of statistics are you looking for?\nI'm really looking to open up a bit of a debate in order perhaps to determine what can be trusted etc. e.g can we completely trust UN backed websites?\nI was expecting a bit of push back for asking such an open ended question, so thanks for your positive response.\nEconomics would be a good start. Others would include perhaps, health, environment and historical data.",
				"added": 1557540763
			},
			{
				"comment_id": 74,
				"body": "> [duende](#comment_46_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): Lulz, another retard. I can help put you into the statistics, if you want.\n\nI believe in free speech ... despite the, at times, seeming drawbacks ...",
				"added": 1557540943
			}
		],
		"1557536353_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 75,
				"body": "It's a problem because centralizing power diminishes freedom.",
				"added": 1557794412
			}
		],
		"1557931740_1CVLeFVQw2wWbBdpM5PtQhtzd7wjKzB24b": [
			{
				"comment_id": 76,
				"body": "You could help the 'criminal' Ross Ulbrecht. He represents an idea the State/law considers dangerous. You can be a 'good' person (whatever that is) and help 'criminals'.",
				"added": 1558147578
			}
		],
		"1558691316_15Gk4wzjyNbPU3JZ31UnqMM3CMrX8pxmzF": [
			{
				"comment_id": 77,
				"body": "'Bureaucrat' is a euphemism for extortionist. Voting facilitates the mass delusion that perpetuates their existence. They don't need it currently though, as 'Brexit' has shown ...",
				"added": 1558837214
			},
			{
				"comment_id": 78,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_163_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Not voting is worse, it means giving way to garbage people.We must vote for the \"least worse candidate\", who defends the most values. The candidate who is closest to us.\n\nVoting is worse. It means giving in to extortion, which isn't a value worth defending.I have nothing in common with an extortionist, especially one who's good at pretending he's 'close' to me...",
				"added": 1558842519
			},
			{
				"comment_id": 79,
				"body": "> [znuser2](#comment_3_1Gc3uLxhgPABiU5HAE1vQNAo5VWoHtNHho): voting or not voting...it doesn't matter they all suck\n\nVoting legitimizes their system ... that matters to their followers ... who will eventually come for you ... does that matter to you?",
				"added": 1558876193
			},
			{
				"comment_id": 82,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_165_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"Voting legitimizes their system\", not voting is passivity behavior, the masonic one and they love it that you act like that. Study more then maybe you will get it and understand the difference.\n\nThey want you to play their game by their rules. Their rules are that once you, or anyone else who's lived a whole life of indoctrination (which includes me, of course), vote, you've given them the moral authority to do whatever they like. Did you vote for a war with Iran? Is it 'passive' to challenge the fundamental foundation of our entire extortion racket world? What have you studied that has given you such 'insight'?",
				"added": 1558918425
			},
			{
				"comment_id": 84,
				"body": "> [daz](#comment_35_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr): I guess voting was ok when it could change things. Voting in England for none lords came about because of the industrial revolution some none lords started to gain lots of money and wanted to change a few things to make more money. Then when some very poor people had a bit of money they wanted to have a say as well.  After women got the vote I think it became less and less relevant to vote, Then voting was just a ploy to keep the slaves happy and find new ways to keep the poor poor and the rich rich if you got in a exclusive gang you could get help to move into a middle position. You vote now on which face you like to look at on TV. but as soon as the face you like steps out of line a spot of blackmail  or they just get a lot of bad press or they have a heart attack.  I am sure now that any one with a following of people that wants to introduce any major change to help humans I mean a free banking system remove fine based tax and god forbid you stand up for a country who's banking system is not controlled by the powerful families. But what ever you do never try to explain it to people just talk about football of some xbox game  or some pinkfoot tv show try your best to fit in this crazy world. May be at some point a hundredth monkey will set in motion a critical mass change. but a bolt of lighting hitting thousands of people at the same time all over the world is\n\nYou've probably already seen [this](https://www.youtube.com/watch?v=vb8Rj5xkDPk) but it sums it up nicely",
				"added": 1558958040
			},
			{
				"comment_id": 89,
				"body": "> [eightyfour](#comment_107_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): The GDPR is a joke.\n\nIt's not a joke or a failure if you are centralized power that creates regulations 'to protect us all', but really to consolidate power for their buddies in the oligarch corporations. It's a success for the people we are told we give all our power to by way of voting. The 'joke' is that people keep falling for the same old tricks ...",
				"added": 1559036987
			}
		],
		"1558916843_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 81,
				"body": "Voting endorses the idea that it is ok to violently coerce others. Who told you that makes sense?",
				"added": 1558917823
			},
			{
				"comment_id": 83,
				"body": "> [fantoski](#comment_37_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): All good for me, considering I'm pro-EU, but it really sounds dumb to not vote on that matter imo.\n\nIt's good for you if you believe in violently coercing others to follow your opinions ... as such it makes sense that you are pro-EU. It is not 'dumb' to not subscribe to violent coercion through voting. What is it about voting that you believe is so smart?",
				"added": 1558952894
			},
			{
				"comment_id": 85,
				"body": "> [anonymouslogin](#comment_318_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Violent coercion is fascism in the form of dictatorship. However one must be careful about who is writing the labels applied. Castro was not a dictator. He was a humanist, and he did the best he could for his people under the very dark shadow of US special interests.\n\n[This](https://www.youtube.com/watch?v=kkdmlcV_tDw) gives another perspective ...",
				"added": 1559025520
			},
			{
				"comment_id": 87,
				"body": "> [anonymouslogin](#comment_322_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): They control us everywhere by fomenting dissent between us as individuals. The create borders between countries by creating resource disparities between populations. If we agree as individuals, or disagree and work to reach solutions together, they have no power. This is why they censor the internet. They don't want us speaking to each other. They fear consensus, and they should. Together we are powerful.\n\nAgreed. They don't want us speaking to each other. They only want us to rubber stamp their 'right' to force us to pay for things we don't want (like wars). Once that's established it's just a matter of divide and conquer to keep us all bleating whilst they get on with dismantling freedom in the name of 'keeping the peace' and 'protecting the children'.",
				"added": 1559026305
			},
			{
				"comment_id": 90,
				"body": "> [fantoski](#comment_38_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): Because the world works that way, \nYes, it does. But the point of sharing ideas/information is to consider how it might work better.\n> you aren't gonna change anything. \nAs individuals there's very little you or I can change. But ideas can change a lot.\n>Once you accept that evil people win, you start figuring you gotta do evil stuff to win too.\nIf we lay violent coercion down as the fundamental basis of society then 'evil people win'. The first step is for people to see it for what it is without being confused by the politician's euphemisms. Most people don't set out with the intention of being evil. Doing 'evil' stuff yourself isn't winning, it's losing - reacting to the lies instead of seeing through them...",
				"added": 1559119109
			},
			{
				"comment_id": 92,
				"body": "> [nickwa](#comment_137_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): I can understand people who are apolitical because of how corrupt politicians and the system is to a certain level. If you vote for someone and then they lie, you become dissuaded. I do vote regularly though and advice people to vote. I will always vote for lesser evil. I understand no party in the US will never match my views, but that the Republican party will be better for me than white and man hating Democrats. Not only that, but less gun control and the like to make me free for less government. I know with the Fate of Empires, it is inevitable for the left to win, but I just want to push it back enough till I am old enough not to care about Socialist States of America. When im old, I can then laugh as everything burns and enjoy the decline. Sometimes I just want to live off the grid and not care. You can argue all you want about the corrupt parties, and I agree, but I just want to push it back till I do not care anymore.\n\nHope you don't mind a link but [this is a little more optimistic](https://www.youtube.com/watch?v=jTYkdEU_B4o) ... removes the need to argue (or at least worry) about corrupt parties ...",
				"added": 1559210748
			}
		],
		"1559024997_1KDopZdzm9GLunEmGTZzdhfHBauzzV1uo1": [
			{
				"comment_id": 88,
				"body": "The State will take more money from ordinary people who end up paying more for the same goods. People will be ripped off (again) for years to come ...",
				"added": 1559026537
			}
		],
		"1559108355_1AWBY95uu7MctMC2yKdizY6iqgkAAbMeja": [
			{
				"comment_id": 91,
				"body": "Ideologically and politically I support it. However, practically, for myself, I am unable to at this time. Sorry.",
				"added": 1559119350
			}
		],
		"1559682182_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 93,
				"body": "[Save Lives With Fossil Fuels](https://www.forbes.com/sites/bjornlomborg/2014/08/22/saving-lives-with-fossil-fuels/#60fe45b3105e)",
				"added": 1559807348
			},
			{
				"comment_id": 94,
				"body": "> [anonymouslogin](#comment_317_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I read the article, and I'm sure the claims are correct about rampant poverty but the conclusions the author makes are far fetched. Fossil fuels are far from the answer,  move even distribution of wealth and resources would have a much larger impact.\n\nWho gets to do the distributing? History shows that demagogues are always furthest from the 'answer'. Please name one (past, present or future) that you would recommend ... ?",
				"added": 1559907172
			}
		],
		"1560807628_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ": [
			{
				"comment_id": 95,
				"body": "Sounds like a school project that might actually be useful one day. How to avoid online regulation. This is why:\n[Chinese Social Credit](https://www.youtube.com/watch?v=eViswN602_k). To answer your question I think not superficially, but it depends how hard an entity is trying to find out what you're doing. Ultimately I suggest getting ready to defend your actions on the grounds of free speech, rather than overly relying on technical hide holes (Julian Assange comes to mind). Technology is neutral, politics is not.",
				"added": 1560822668
			}
		],
		"1561288542_14hmCEXpoVdYQqeve93LpieDx2k8aFyT66": [
			{
				"comment_id": 96,
				"body": "What's your motive?",
				"added": 1561429402
			}
		],
		"1561879672_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": [
			{
				"comment_id": 97,
				"body": "> [moor](#comment_148_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): idk, you can defend yourself against a rapist?\n\nIn this case a voter would be a rapist you cannot defend yourself against. If this voter can do this by way of partaking in a mass delusion, would the defense not be to dispel the delusion?",
				"added": 1561941629
			},
			{
				"comment_id": 98,
				"body": "> [petrina](#comment_1_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz): Both are despicable, none.\n\nWhat would you suggest as an alternative to the ideology of rape, which we call 'democracy', that is worshiped throughout the world?",
				"added": 1561941810
			},
			{
				"comment_id": 99,
				"body": "> [whitewolf](#comment_24_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8): Racially, rapists are overwhelmingly non white.\n\nI was asking from an ideological, as opposed to racial, perspective. Do you have an opinion on the basis of what a voter believes he has the right to impose on another and a rapist (of whatever race)?",
				"added": 1561942015
			},
			{
				"comment_id": 100,
				"body": "> [qspitzer](#comment_22_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX): rapist has a 'p', voter does not\n\nIt also has an 'a' and an s' . Is spelling the only difference between the two?",
				"added": 1561942243
			},
			{
				"comment_id": 101,
				"body": "> [brianhanson2nd](#comment_1_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE): A rapist is breaking the law, a voter is fulfilling their civic duty. I honestly don't even see how one would compare the two.\n\nIs it ever right to break the law?",
				"added": 1561942386
			},
			{
				"comment_id": 102,
				"body": "> [brianhanson2nd](#comment_4_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE): Yes, obviously it is right the break the law at times. Are you suggesting that we should legalize rape, and get more people to be rapists?If it weren't for people breaking the law none of us would be here, as our ancestors would have never revolted against evil empires.\n\n> Are you suggesting that we should legalize rape?\nNo. I'm asking 'What is the difference between a rapist ('legalized' or otherwise) and a voter?'",
				"added": 1561960490
			},
			{
				"comment_id": 104,
				"body": "> [petrina](#comment_4_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz): There are many proposals for alternatives already. The problem is to act and get there.But people are waking up and speaking out about this farce. One example: https://kiwifarms.is/members/simply-outplayed.37061/#profile-post-comment-210139\n\n\"The problem is to act and get there' - agreed.\nI'm currently most persuaded by the [counter-economics argument for peaceful dissolution of the State.](https://en.wikipedia.org/wiki/Agorism).\nRe: the link. Psychology has shown us that turning rage upon oneself isn't a good idea. It also made me (once again) think of this quote of Jung's:\n\"Everything that irritates us about others can lead us to an understanding of ourselves\"",
				"added": 1562059115
			}
		],
		"1562036082_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 103,
				"body": "Do you have any other links corroborating the 'declared independent from mainland China' statement? The provided link stated 'Not Found' ... thanks ...",
				"added": 1562053111
			}
		],
		"1562093171_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": [
			{
				"comment_id": 105,
				"body": "Thanks for your work on this ... One question: Apart from it can be used in local programs, such as Node.js and Electron are there any other benefits that non-technical users can appreciate?",
				"added": 1562111788
			}
		],
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 106,
				"body": "What appears to be the disappearance of @nofish for whatever reason underlines how we cannot rely on any one implementation of P2P or any technology alone. I suggest broadening one's understanding of P2P generally so that this kind of dependency is reduced and we're better equipped to switch implementations and/or even develop our own. [Perhaps a starting point could be this video and others like it ...](https://www.youtube.com/watch?v=4DFalocsoQo). Personally I would avoid getting bogged down in governance issues ...",
				"added": 1562119417
			},
			{
				"comment_id": 107,
				"body": "> [styromaniac](#comment_724_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): He's still active. Jumping to conclusions doesn't help you.\n\nHelp me do what?",
				"added": 1562148885
			},
			{
				"comment_id": 108,
				"body": "I'm not a technical contributor. Judging by some of the comments I didn't get the impression this was a particularly technical thread. I'm making a general point regarding dependency, including my own need to understand P2P better.",
				"added": 1562151752
			},
			{
				"comment_id": 110,
				"body": "> [atomiserxenolith](#comment_109_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): As a technical contributor do you have a credible response to gitcenter's original, and well formulated, points?",
				"added": 1562199080
			},
			{
				"comment_id": 111,
				"body": "> [styromaniac](#comment_738_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): That's more about moderation and maintenance of sites. He's not missing. Problem is that there aren't more of them in that role while he's coding in Python. A lot of features need his attention. I agree with GitCenter, but not you saying he's MIA as though that is in entirety.\n\nI'm new to the thread (wasn't that obvious?). I have no opinion on 'his' whereabouts other than the impression I had from other posters comments. All this touchiness about whatever a single individual is doing or not simply underlines the point of the thread and the point I made about relying on a single software implementation.",
				"added": 1562199642
			}
		],
		"1562866487_1MEFyQ6EisGzSQ8VL8ZwQ7aug4x1iVvv9L": [
			{
				"comment_id": 112,
				"body": "Why do you look to the State to solve your problems?",
				"added": 1562890939
			},
			{
				"comment_id": 113,
				"body": "> [sceptique](#comment_14_1TWoxhM5cZiLpzybpLyYtEsskuGJ9yVhv): don't trust individuals to make a impartial justice and decisions\n\nIf you don't trust individuals, who do you trust?",
				"added": 1562934347
			},
			{
				"comment_id": 114,
				"body": "> [sceptique](#comment_17_1TWoxhM5cZiLpzybpLyYtEsskuGJ9yVhv): A group of people does not behave the same way an individual does. The whole is different at the sum of its parts. You could trust people but not groups of people, or the opposite depending on your perspective. I don't know what's better.I give you my feeling about my country's people: I think most of them do not trust people for the justice and violence (I willingly grant them that often, popular justice spills a lot of innocent blood).\n\nI suggest that it is better to trust individuals more than groups of people, although there's nothing wrong with many individuals organizing together (it's the discretion to not follow that is key). It's difficult to say with certainty who others trust. Better, I suggest, simply to stick to who you trust. Who do you trust to provide 'justice' and (presumably you mean prevent) 'violence'.",
				"added": 1563149471
			}
		],
		"1563904309_164cJJtm3Q2Xd7NZbFxJYngmW8MSqUMMxi": [
			{
				"comment_id": 115,
				"body": "The State hates competition. Free Ross!",
				"added": 1563933593
			}
		],
		"1563987524_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 116,
				"body": "I suggest we stop running and hiding from the State. If you play their game by their rules (physical violence, technology, media etc.) they're going to win every time. It's weakness is the ideas that form the basis for it's existence. The idea that you somehow formed a contract with it to be governed by it. The idea that it can manage economic affairs better than people left to freely negotiate their own contracts. The idea that you cannot be secure without it. The idea that it is the ultimate authority. Not having a good grasp of these topics and making them more widely understood is what's brought us to this. That they now have a microphone embedded in every corner of our households is just a nasty symptom. A 'subversive' conversation in your house is not so much of a problem if there are millions of 'subversive' conversations taking place every minute of the day. Until 'want to get rid of Government altogether' and phrases like it become an everyday expression, it'll stand out like a flagpole among all the conversations about football, Donald Trump and Boris Johnson. There will be tacit support for your being removed from the 'civilized' World e.g. Assange. Until people understand why we have to get rid of Government itself they'll continue to  believe 'why should I care, I do nothing wrong'. I recommend Lysander Spooner https://www.youtube.com/watch?v=dWESql2dXoc",
				"added": 1564016864
			},
			{
				"comment_id": 117,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_481_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): it's the basic idea, butbutnot many of us 'have that instinct' 'to get rid of'... [...]\n\nmy way is to blog in the 'Agora' blog here in ZeroNet ... but everyone will have their own preferred way of 'resisting'.",
				"added": 1564022953
			}
		],
		"1565139581_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": [
			{
				"comment_id": 118,
				"body": "\"we would in fact be worse off if it werent for our constitution\". \nPlease check out Lysander Spooner:\nhttps://www.youtube.com/watch?v=dWESql2dXoc\n\"It ain't what you don't know that gets you into trouble. It's what you know for sure that just ain't so.\"",
				"added": 1565141246
			}
		],
		"1565095300_1PnHUGmQkYq4NKZBxFp8o1Wb1ZZijeeYvF": [
			{
				"comment_id": 119,
				"body": "> [223556](#comment_8_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): Freedom is non-negotiable. These people will lose theirs if they do not do more than riot in the street. Nobody will help them in maintaining other then themselves. There is all the means out there for the people to start their own insurrection, they need to make the arms necessary. the iron, the chemicals and the machies, it's already there. These people need to learn to use the tools of modern warfare, that being the difference to the prospering of your people or becoming like the bugmen on the mainland.I can't give you freedom, but I can give you the know-know to acquire it. And that's worth more than gold.Shoot politicians. Shoot their benefactors. Shoot the financier. Shoot the cop protecting the system. Cut the grid. Burn their institutions. They either get with the program or perish like the communists they are.\n\nPlaying into their hands. Chinese authorities salivating at the prospect. You can't fight a violent cult (the State) with violence ... only by exposing the violence that lies at the heart of the State ... the extortion of taxation that feeds it ... and conducting trade outside the purview of the State - i.e. economic and political approach - military is bad tactics",
				"added": 1565142457
			},
			{
				"comment_id": 125,
				"body": "> [223556](#comment_21_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): What are the protests then? What are the riots with using umbrellas as roman shield tactics? The people fighting in the streets right at this moment?You say that the entire prospect is useless, you imply that they should stop protesting aswell. Better just lay down and die.You are wrong. Every freedom loving person in the world should have a rocket launcher, rifle and tank. That if someone wishes to take their freedom, they will pay in blood. If they wish to keep the freedom with the Chinese at the gate, they will have to fight for it. Hong Kong is more an asset than a threat for the Chinese.If the people hold a torch to the city, show the Chinese they would rather burn the whole city than give it up to a communist, they'll fuck off and keep it to psyops. [...]\n\n'you imply that they should stop protesting as well'. \nNo, I fully support their cause.\n\n'Every freedom loving person in the world should have a rocket launcher, rifle and tank'. \nBut they don't, that's my point.\n\n'That if someone wishes to take their freedom, they will pay in blood'. \nNot if they're sitting in a tank they won't.\n\n'If they wish to keep the freedom with the Chinese at the gate, they will have to fight for it'.\nYes, but how? It's too late to come to the table with no leverage. I wish them the best but, sadly, I suspect this will end up as just another warning to the rest of us that will again go unheeded. I suggest we remember this next time we discuss the 2nd Amendment with anyone. They often conflate the unlikely possibility of being shot by a psychopath (especially if you're armed) with the very real possibility of being shot by the State (which is actually the same thing). HK is going to show us what globalization is really all about. I hope I'm wrong.\n\n'Hong Kong is more an asset than a threat for the Chinese'\nRight now HK is a political liability for China. They will happily torch the place to demonstrate to their own people the futility of resistance. That's why I suggest that opposition takes the form of highlighting the hypocrisy and violence inherent in all States, rather than adopting Statist ideas and practices only to be beaten by experienced people who are better at it ...",
				"added": 1566862924
			}
		],
		"1565314153_1Cx3BTrQckf6v9Hm9KSAJxztGxqoTwAT4m": [
			{
				"comment_id": 120,
				"body": "As James Corbett points out here:\nhttps://www.corbettreport.com/conspiracy-theorists-are-domestic-terrorists-propagandawatch/\nit's never been more urgent.\nNo-one appears to appreciate the need.\nI blog an article here most weekdays in 'Agora'",
				"added": 1565317342
			}
		],
		"1566704216_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 121,
				"body": "Why ask one terrorist organisation if it recognises another?",
				"added": 1566711292
			}
		],
		"1566766301_1LMHSz6pwoimKuAr4MC57yhRLAQYFzRVwD": [
			{
				"comment_id": 122,
				"body": "What if the aggressor wears a costume, carries a badge and strongly believes he has 'authority'?",
				"added": 1566778672
			},
			{
				"comment_id": 123,
				"body": "> [bigbadbob](#comment_420_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Shoot them with a camera instead... And hope for the best.\n\nA good idea in the more common and non-life threatening situations ... but what if the costumed aggressors become even more violent? Shouldn't you be equipped to defend yourself adequately?",
				"added": 1566781408
			},
			{
				"comment_id": 124,
				"body": "> [bigbadbob](#comment_421_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): In life threatening situations there really are only two options.  Fight or flight.   Where i am from there is only so much one can do to \"equip\" themselves.\n\nIf you chose the fight option what's preventing you from equipping yourself?",
				"added": 1566803569
			}
		],
		"1566980845_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": [
			{
				"comment_id": 126,
				"body": "Where are you reporting from?",
				"added": 1566988872
			}
		],
		"1567063520_18CNiJ2fa4qWU3mqbmE5kndxLk15oVsxi5": [
			{
				"comment_id": 127,
				"body": "your contribution is?",
				"added": 1567064878
			}
		]
	},
	"comment_vote": {
		"14_193rzuH9AAHfvHKwSFS5oq6jRpXwDJ2rEW": 1,
		"133_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"18_193rzuH9AAHfvHKwSFS5oq6jRpXwDJ2rEW": 1,
		"21_193rzuH9AAHfvHKwSFS5oq6jRpXwDJ2rEW": 1,
		"22_193rzuH9AAHfvHKwSFS5oq6jRpXwDJ2rEW": 1,
		"58_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"4_1Gc3uLxhgPABiU5HAE1vQNAo5VWoHtNHho": 1,
		"36_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": 1,
		"336_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"4_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": 1,
		"5_1LU47z6YewqdERYNFysqjDZ8NVG5WWpkVU": 1,
		"28_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6": 1,
		"2_14A3LXiT8D3gtRGJSMG3eMbKDtRPdLeU2S": 1
	}
}