{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1555768901,
			"title": "读博期间怎样才能发好文章？——写给博士生的一封信",
			"body": "写给博士生的一封信\n\n亲爱的博士同学：\n\n你好！\n\n最近过得如何？实验进展顺利吗？上次被拒的文章打算修改后投到哪里？\n\n我知道你最近过的不好，考上XX大学博士的那一刻已经离你远去多年，毕业的年限也一天天的向你飞奔而来，而你却还两手空空。昔日的同学，或工作，或留洋，不少人已经有了房子车子，抑或已为人父母；而你却要天天泡在实验室里，没有周末，没有假日，每天吃着食堂里已经吃了数百次的饭菜，夜里睡在阴冷的宿舍里，甚至还要忍受一位变态的室友。你很苦恼，为这逝去的时光而愤懑，为这看不到尽头博士生活而感到无助。但是你已经敏锐的发现，要结束这样的苦难，居然只是靠几篇甚至一篇文章，你绞尽脑汁也想不明白，人的命运怎么能由几张纸来决定？\n\n亲爱的博士同学，暂且松开你紧皱的眉头，放下手中的实验。作为一个马上就要完成博士学业的过来人，我想跟你谈谈，如何才能顺利的完成博士学业，如何才能在三五年的短暂时间里发表出更多更好的文章。\n\n对了，亲爱的博士同学，你还不了解我。我也曾和你一样是一个苦恼博士，不过现在我已经走出了那个困局，并且自认为做的还不错。为了增加这封信的说服力，我先将我自己的论文发表情况向亲爱的苦恼博士做一介绍。\n\n在博士期间，我发表的论文列表如下：\n\n[1] xxx\n[2] xxx\n[3] xxx\n[4] xxx\n[5] xxx\n[6] xxx\n[7] xxx\n[8] xxx\n[9] xxx\n[10] xxx\n[11] xxx\n\n在这十一篇有我署名的文章中，第一作者五篇，其中Anal. Chem.是分析化学学科最好的期刊，我发表了两篇，Lab Chip是我从事的微流控芯片领域最好的期刊。第一作者文章影响因子(IF)共20.135，xxx系博士生毕业要求发表文章影响因子总和大于4，也就是说我的工作够毕业5个博士的。但是，亲爱的苦恼博士，千万不要羡慕我，相信你也能够做的跟我一样好。\n\n亲爱的博士同学，首先你要搞明白学术论文是个什么东西。学术论文，俗称“文章”，英文称为“Paper”，哈佛大学的George M. Whitesides教授曾专门写了一篇题为“Writing a paper”的文章给他研究组的学生参考，其开篇即高度概括了什么是文章以及文章在科研工作中的重要性：“A paper is an organized description of hypotheses, data and conclusions, intended to instruct the reader. Papers are a central part of research. If your research does not generate papers, it might just as well not have been done.”也就是说文章是你在科研工作中提出的设想、获得的数据和结论的有组织的描述，面向的对象是读者。文章是工作的总结，发表文章是科技工作者的职责，没有发表成文章的研究工作可以认为是根本不存在的。因此要发表文章尤其是高水平的文章，必须要有好的研究工作，在已有的高水平研究工作基础之上，发表高水平的文章便是水到渠成的事情。\n\n亲爱的博士同学，在你为发不出文章而苦恼时，请从如下三个方面寻找原因：1）你是否从你的导师那里获得了充分的指导；2）你是否从你的师兄师姐以及其他同学同事那里获得了大量的经验和技巧；3）你是否对科研有明确的目标和兴趣，以及是否为之而努力奋斗。\n\n[1]\n\n导师是研究生在开展科研工作中最重要的指导者，合格的导师应该长期从事某一领域的研究工作，对这一研究领域的历史和目前的发展现状有全面的了解和认识，通过结合本研究组已取得的成果和学生自身的特点，能够判断和预测未来研究方向，并提出后续开展的研究内容，在学生的科研工作中能够提供有力的指导和帮助，当然搞钱也是很重要的内容。但是很不幸，目前中国高校大多数的导师都是不合格的，xx大学里的教授也是如此，不过在搞钱上一般都还干的不错。据我在XXX系十年的体验，十个导师里，能够真正对学生进行指导的不过两三人，剩下的要么是没有学术水平只能混日子，要么就是醉心于申请基金和拉项目，对如何搞好科研是根本不放在心上的。\n\n以我自己的导师为例吧。我现在基本一周能跟他碰上一面，说三五句无关紧要的话。这个学期已经过了一多半，组会还没有开过。导师很忙，也不知道天天忙什么，基金申请书找学生写，出去开会作报告找同学完成，学生的实验自己设计，遇到问题自己解决，实验结果自己总结，文章学生自己写，自己修改后自己投稿，导师在整个科研的过程中基本不起任何作用。当然这还不算最坏的情况，导师不起作用比起负作用还是要好不少的。有不少同学就抱怨导师什么也不懂，只会瞎指挥，听他的话就啥也做不出来，不听又不让毕业，这真是骑虎难下左右为难。\n\n我有幸在博士期间去美国进行为期半年的合作研究，这一段经历给我留下了深刻的印象。除去优越的硬件条件、自由的学术氛围不提，单单是导师细致而有效地指导就给我留下了深刻的印象，也坚定了我继续出国深造的决心。在美国的这个实验室里，大老板是美国人，质谱研究领域的大牛，和我一起合作的小老板是中国人，他给我发薪水。和大小老板之间的交流主要靠电子邮件。邮件交流很方便，不会对每个人的日程安排产生影响，我至今不明白XX大学网络这么发达，导师有什么事情非要把人叫到办公室去面对面地说，组里有个什么事情还要靠同学们之间口口相传。为了说明问题，我把和XX导师，和美国的大小老板之间的邮件做了一个统计，画了三个饼图，结果如下：\n\n从邮件的数量上可以直接看出我和各导师之间的交流程度的差异，和美国大老板平均每月6.4封邮件，和美国小老板19.1封，和XX老板只有3封。从邮件的内容上也可以体会出高水平的导师和低水平导师的区别（我在XX大学的导师还不算差了，毕竟是长江学者）。和美国的大老板讨论实验和文章讨论的内容分别占到了27%和42%，和美国小老板为37%和29%，两项之和基本在2/3左右，也就是说我们之间的交流内容是以科研为主，而且这种交流是具体的、细节上的交流，充分体现了一种以学生为主要完成人，导师提供指导和思路的合作关系。再来看看我和我老板的邮件情况，比例最高的一项是论文投稿，占到总数的39%，但这和前述的文章讨论是两个概念，论文投稿仅仅包括论文的投稿、评审、拒稿等手续上的内容，并不涉及到具体的科学内容，也就是说导师并没有给予我在具体的科研中有所帮助和指导，只是一种以发文章为目标，不断催促的过程。也不要觉得奇怪居然没有实验讨论的内容，事实就是如此，只重结果不重过程，这也是绝大多数导师的心态。此外还有帮导师写材料占据了11%的比例，包括给导师写基金申请书、计划书，写报告用的ppt等材料，占据了相当多的时间，我有三个春节都是在写申请书中度过的。此外还有训话这种富有中国特色的邮件，导师会在信里对你最近的表现做一些评价甚至是批评和威胁，心理素质不好的学生看了这种信肯定气得够呛。\n\n除了邮件这种交流方式外，学生和导师之间面对面的讨论对搞好科研也是很有必要的。在美国的时候，除了每周一次的组会进行详细的讨论以外，在其他时间也有很多的讨论，甚至是走廊里碰到老板就可以站着讨论半小时。那个美国的大老板年纪应该有70了，经常和我们在实验室站着聊一小时。反观XX大学的这些导师，白天上班时间都没几个在办公室，找某个老师办点什么事情非要花两三天才能找到本人。我特意拍了一张照片（为保密起见，这里省略），周日晚上的XX楼，可以看到导师办公室基本都是黑的，实验室大多灯火通明，当然工作日也是这样的情况，但是就是这样，很多老板还是嫌学生不够努力。\n\n因此，亲爱的博士同学，你大可不必因自己导师不指导你而感到委屈，绝大多数的博士跟你的境遇是一样的。俗话说的好，“死了张屠夫，不吃混毛猪”，没有导师的指导，一样能够做好科研，虽然这样会比较困难，但完全可以换一个角度去思考，这也是锻炼自己独立开展科研工作能力的好机会嘛。当然，这一过程也是有捷径可以走的，其中比较重要的一点就是从实验室的师兄师姐那里着手，从他们的身上吸取有益的经验教训，从他们的工作中挖掘可以继续深入的研究内容，甚至可以直接接手他们已经进行了一部分的工作。\n\n[2]\n\n博士阶段的科研工作和本科时期的学习过程是截然不同的，本科的学习过程主要以获取知识和解题为主，基本上是一种重复性的记忆过程，基本不需要分析、研究和创新等高层次的思维活动。而博士阶段的科研工作则是一种根据已有的成果、已报道的文献等内容进行改良、发展和创新的以创造和发明为主的活动，本科阶段学习的知识可以说完全无用。要做好科研需要的是扎实的实验技术，丰富的前沿知识，敏锐的洞察力，缜密的分析问题的能力，以及一刹那的灵感等无法培训出来的能力，尤其是知道做什么和怎么做是更重要的。做什么和怎么做是需要长时间的积累和体会才能够悟到的，对于只有三五年时间的研究生来说，在没有导师指导的情况下，从师兄师姐那里获得帮助就十分重要了。\n\n那么从师兄师姐那里能够获得哪些帮助？一般可以分为三类，第一类，实验仪器的使用方法，操作技巧和各种基本的实验技术。本科阶段也有实验课，能够学习到一些实验方法，但是完全不能满足研究生阶段的实验需要，研究生阶段的实验内容更加专一和深入，其复杂程度和精密程度也更高。很多时候实验的成功更需要运气，往往表现出类似玄学的特征，很多微小的细节会决定整个实验的成败，从师兄师姐那里获得这些细节的东西无疑是一条捷径。第二类，成功与失败的经验。师兄师姐的经验更加丰富，他们在若干年的科研活动中肯定有自己的体会和想法，他们的经历往往能够作为参考，哪些研究方向比较难，哪些内容是不可行的，哪个工作容易做出成果，他们往往比导师更加清楚，直接从他们的经验教训能够获得很多有用的信息，能够使自己的工作量大大减轻，而且能够少走弯路，避免很多不必要的失败。如果你想自己从头开始进行摸索，那么请做好准备，在未来的一两年里你都很有可能一事无成。以我为例，当然我是开门弟子，没有师兄师姐可以帮我，所以很多时候觉得十分无助，只能自己探索。但是我的师弟师妹从我这里得到的帮助则大得多，去年毕业的两个硕士就是按照老板的思路做了一年后无果，最后做了我提出的课题顺利毕业的，一个师妹毕业后去日本深造，另一个师弟去宝洁公司做研发，都是不错的出路。第三类，师兄师姐能够向你提供一张合理的时间表。在恰当的时间做恰当的事，往往是最重要的事情，甚至比做好科研本身更重要。比如什么时候开题，什么时候文章需要投稿，什么时候论文应该送审，什么时候交该交的材料等等，这些时间点一旦错过，往往要再等半年或一年，会严重影响毕业的顺利进行。在师兄师姐的指点下能够更加有效地规划好整个研究生期间的时间安排，能够避免因为时间安排不当而造成的损失。记住一点，提高效率比埋头苦干更有效。\n\n因此，亲爱的博士同学，放下架子直接向你的师兄师姐们请教吧，也许他们手头正好有做了一半而不想做的工作可以让你接手，这对你来说不啻为一根救命的稻草。对于你来说，他们的帮助是一笔十分丰厚的财富，当然也要记得回报，可以帮师兄师姐们做一些力所能及的事情，这样才能构建一个和谐实验室。\n\n[3]\n\n在分析了导师和师兄师姐对你科研所起的作用以后，我想再谈谈苦恼博士你个人自身的问题。为什么把这一点放在最后谈，是因为我觉得个人的主观能动性和学术水平只是顺利开展科研工作的保证。“千里马常有而伯乐不常有”，为什么名师出高徒，虽然绝大多数学生都不会成为科学家，但是通过正确的培养和良好的环境熏陶，绝大多数学生都是可以做出一些很好的科研工作的。不幸的是，可怜的苦恼博士你既没有受到正确的培养，也没有良好的环境，你是这世界上最不幸的博士中的一个。’Fight to the end, Never give in.’马XX老先生是这样教育我们的，因此亲爱的苦恼博士，要靠自己，要发挥主观能动性，要努力提高自己的学术水平，只有你自己能够帮你了。苦恼博士，我要问你几个问题，请你回答并反思。\n\n##你真的想做好科研吗？\n\n很多人读博士是为了名为了利，不是为了享受科学发现的快乐，这种人很可怜，每天要做自己不感兴趣的事情，这种人也很可悲，他们会发现拿到了学位后自己的人生并没有太大的改变，2009年高校毕业生一共623万，想靠读研混个学位找个好工作来改变自己人生的时代已经一去不复返了！因此，亲爱的苦恼博士，希望你是以一种积极向上的态度来看待科研，把它当做一种乐趣，而不是一个手段，有了这种态度才能在科研过程中体会到快乐，也更容易做出好的成果。\n\n##你看了足够的文献了吗？\n\n文献是已报道的工作的总结，能够从中获取前人的经验，加以提高、改进和综合，阅读大量的文献往往能够产生新的想法和思路，可以指导后续的工作。目前来看，很多研究生对文献的把握很不够，一是看的太少，任何一个方向，每年都可能有数千篇的相关文献，对其中高质量期刊上的数百篇应该有选择的阅读，而不是只盯住其中几篇，我认为整个博士期间至少要精读200篇，略读500篇，不然不足以对整个研究方向形成正确的认识；二是刻意模仿他人的工作，很多同学看到一个和自己方向类似的文献后，就完全按照文献去做实验，这不仅没必要，也是不可取的，更可悲的是很多同学连重复别人的实验都做不好。文献’reference’毕竟只是一个参考，必须要从别人的工作中提炼出新的思想以为己用，只有这样才能有所创新。亲爱的苦恼博士，如果你这方面做的还不够，那就向我们系的XXX教授学习吧，每天雷打不动看20篇文献。\n\n##你有独立思考的能力吗？\n\n系主任XX不止一次在报告中强调博士生培养的三个阶段，第一阶段是帮助导师实现他的想法，第二阶段是受到良好的训练，第三阶段是产生自己的想法，培养独立科研的能力。从XX系主管学生就业的老师那里获得的数据表明，70%的博士毕业后选择继续深造或进行科研工作，这就需要较高的独立思考能力。既要有解决问题的能力（不能一有困难就向别人求助），更需要有提出问题的能力，需要有分析现状，结合自身条件，开拓未来的一系列能力。不过我认为这种独立思考的能力很大程度上是由性格决定的，很难在成年后培养出来。\n\n##你投入了足够的时间和精力吗？\n\n现在的整个社会很浮躁，能踏实办事的人很少，板凳须坐十年冷的情况很难发生了。年轻人受到的诱惑更多，尤其是中国的美食和各种娱乐活动丰富多彩，占据了大量的时间和精力。我在美国半年做的工作差不多跟在XX大学做5年相等，很重要的一个原因就是在美国没有什么社会关系，也没有娱乐活动，很多时候除了科研就无事可做，这种环境里想要做不出成果都难啊。因此，请亲爱的苦恼博士反思一下，是什么浪费了你的时间和精力？美食，娱乐，网络，游戏，恋人，家人还是闲聊？\n\n##你能将你的工作表达出来吗？\n\n自己的科研工作是好是坏，不是自己能够评价的，目前的科研评价体系最根本的一点是’peer review’，必须要同行说好才是真的好。这样就涉及到一个表达的问题，如何将自己的工作通过期刊、论文集、著作、会议、报告来向同行和外行进行介绍，不仅需要较好的写作能力，更重要的是口头表达能力。表达的思路要清晰、内容要丰富、描述应准确、评价要客观、结论要真实可信，做到这些要点才能够让他人理解你的工作，认可你的工作。对于这方面的能力，我认为是可以后天训练提高的，20多岁也不晚，多读、多写、多讲，能够实现逐步的累积和提高。亲爱的苦恼博士，努力去做吧，如果有一天你能够把自己认为是垃圾的工作都能讲得天花乱坠，那你在科研的道路上至少已经成功了一半。\n\n亲爱的博士同学，这里已经是信的结尾，我希望你读了这封信后能够稍微的不苦恼一些，如果你依旧苦恼，不妨摆正心态，十年前我进入XX的时候，有一个内容是心理咨询中心的老师跟我们新生上课，有这么三句话我一直记着：“如果不能改变社会，那就改变自己；如果不能改变他人，那就改变自己；如果不能拥有完美的人生，那就拥有完美的人生观吧。”赠与苦恼博士共勉。\n\n此致\n祝一切顺利！\n\n曾经的苦恼博士",
			"added": 1555768900,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		}
	],
	"topic_vote": {
		"1555512367_1GWtddwTWnfPiNy74196ckmKiKSeFtE9XM": 1
	},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}