{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1565645808_1NkqJSocDr3nAa6WWDCAHgtf3ftwBUGGCK": [
			{
				"comment_id": 1,
				"body": "It's half of the population of the united states. Most of the world is leftist as a result of years and years of poorly thought out crony capitalist policies that increase inequality massively while fleecing the population with taxes to benefit a few kleptocrats...",
				"added": 1565705840
			},
			{
				"comment_id": 2,
				"body": "> [nicehat](#comment_7_1LPjWhB47YZwaWoSQH1d2tnj2E3JnMU2cw): Trolls as a result of mainstreem news covering this place as a haven for huwite supreeeeeemicy.\n\nThis is partly true, but bottom line is probably many users are actually coming back here after a while off the platform. Lefties are usually more open to new technologies and are usually the early adopters. Righties here are here because they are getting screwed hard by big tech in the outside world.",
				"added": 1565706196
			},
			{
				"comment_id": 3,
				"body": "> [hggggfff](#comment_20_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y): tl;dr:• Communism is by definition ANTIDEMOCRATIC ... • Communism is by definition IMPERIALISTIC ... • Communism is by implication AUTHORITARIAN ...\n\nTrue, but everything you just said (apart from imperalism) can be said about any household. Most households run according to communist rules. The problem with communism is not inherent, it's brought on by scale. It would work pretty well I think below the 100,000 people mark (assuming you are not super authoritarian and let people leave if they want).",
				"added": 1565706448
			},
			{
				"comment_id": 4,
				"body": "> [styromaniac](#comment_972_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): [[[ urinalist ]]]\n\nJEREMY HAMBLY IS THAT YOU?!",
				"added": 1565706541
			}
		],
		"1565708858_1BP1yj9evars2xjLc1Hw6icEg3BKJaLUyk": [
			{
				"comment_id": 5,
				"body": "Well, IANAL, but if we seed illegal material without our knowledge placed there by another user, could we not use the same DMCA safe harbour clauses the big boys do when users post illegal shit?",
				"added": 1565712166
			},
			{
				"comment_id": 6,
				"body": "> [arhipo](#comment_3_1GyzQuxTLxM4VZHrscHm5iY5W4B8b6f6QL): I don't believe any bunch of 0s & 1s could be illegal. \n\nWell, you're wrong, so lets move on accepting that. We need a lawfag to have a say here. If only Nick Rekieta was on zeronet...",
				"added": 1565712268
			}
		]
	},
	"comment_vote": {}
}