{
	"next_comment_id": 57,
	"user_name": "Kaffie",
	"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
	"post_like": {
		"149fw3hkktHfJAJsFbruMWJMvq7VgFqYnF_1515863744": 1515922815,
		"1LrDWSzi63MhST9ZNkefSPJGFAuByRMeCx_1516580163": 1516601581,
		"12w3zJ6gRrcAw2kSCQXDkorgqxuXnkKkF8_1516741464": 1516794614,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1517124069": 1517128105,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1517080549": 1517128411,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1517072397": 1517128450,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1517063712": 1517128758,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1517140017": 1517214670,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1517934752": 1517969445,
		"1Kh3qLdTH2QKewUb6cWZa2dMveMT5EcVer_1534834083": 1534842482,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1535817578": 1535853766,
		"1LYAhznicuncP8P6qiJFv6E1cw9ccCoqbX_1536060056": 1536116261,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1536336220": 1536379777,
		"168LyXF27YeknvCoPEZB3jM8gpb1npT44v_1549155715": 1549157665,
		"1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1549388933": 1549429070,
		"1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1549542994": 1549543874,
		"1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1549547068": 1549547192,
		"16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm_1553605893": 1553664908,
		"191jbK3GNmVritcMymKkFuxyYFXxqv2xpC_1557236638": 1557286592,
		"191jbK3GNmVritcMymKkFuxyYFXxqv2xpC_1557355769": 1557364780,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1566398075": 1566431417,
		"1PMuHrGm4GFBBNbvRgr8zvyyRTc3rHpGYz_1567584593": 1567682545,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1603568769": 1603620809,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1603529325": 1603620828,
		"1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu_1609981271": 1610334675
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "That shouldn't happen. If it did, it's because you failed to transfer everything properly.",
			"post_uri": "1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE_1515713520",
			"date_added": 1515724205
		},
		{
			"comment_id": 2,
			"body": "No. You only need to \"join\" one hub. That will be where your posts are stored. Feel free to *download* more hubs, as it will show more content in your newsfeed.",
			"post_uri": "1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE_1515709615",
			"date_added": 1515724267
		},
		{
			"comment_id": 3,
			"body": "@Johnny Mnemonic: Did you do it by hand, or use a tool? Both are prone to errors. By \"failed to transfer\" I don't mean in terms of the computer failing. I mean in terms of copying what you need to copy.",
			"post_uri": "1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE_1515713520",
			"date_added": 1515740565
		},
		{
			"comment_id": 4,
			"body": "@Johnny Mnemonic: Ah, there you go. You pretty much entirely broke it. NEVER go back to the \"create profile\" page. It only leads to disaster.\n\nGo [here](http://127.0.0.1:43110/1QHbf72f4vdx3QAxN1LTN9KP19J428Q85R/) to unfuck your account. Basically you set up multiple profiles on multiple hubs, which is impossible on zerome and leads to bugs. The weird deletion is because it's counting by one, but deleting the other. The random vanishing of the avatar and posts is because you're viewing the different profiles.",
			"post_uri": "1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE_1515713520",
			"date_added": 1515749168
		},
		{
			"comment_id": 5,
			"body": "I was playing around with something like that. Being able to search through zeroup files. Search by: title, file name, username, auth_address, etc. See [this screenshot.](https://i.imgur.com/weFMENe.png)",
			"post_uri": "12w3zJ6gRrcAw2kSCQXDkorgqxuXnkKkF8_1516460897",
			"date_added": 1516510049
		},
		{
			"comment_id": 6,
			"body": "It's a slow trickle of content. A small but dedicated, albeit inactive community. We all stick around cuz we all have high hopes for ZN.",
			"post_uri": "12w3zJ6gRrcAw2kSCQXDkorgqxuXnkKkF8_1516741464",
			"date_added": 1516794647
		},
		{
			"comment_id": 7,
			"body": "If these are manga/doujins, you should consider making a [0gallery](http://127.0.0.1:43110/0gallery.bit/) 'hub' and uploading them there. Might as well contribute to existing projects :)",
			"post_uri": "126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB_1516733520",
			"date_added": 1516794815
		},
		{
			"comment_id": 8,
			"body": "We really need a ZeroUP clone that doesn't have filesize limits.",
			"post_uri": "126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB_1516824296",
			"date_added": 1516861430
		},
		{
			"comment_id": 9,
			"body": "@Nekololi: I'd just love to see 0gallery effectively become zeronet's version of exhentai. That'd be amazing.",
			"post_uri": "126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB_1516733520",
			"date_added": 1516861617
		},
		{
			"comment_id": 10,
			"body": "@styromaniac@zeroid.bit: I mainly meant for smaller files.",
			"post_uri": "126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB_1516824296",
			"date_added": 1516943170
		},
		{
			"comment_id": 11,
			"body": "Beautiful. Apparently I complained too much :P",
			"post_uri": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1517934752",
			"date_added": 1517969465
		},
		{
			"comment_id": 12,
			"body": "Honestly they just look like a warez group to me.",
			"post_uri": "126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB_1518713286",
			"date_added": 1518833275
		},
		{
			"comment_id": 13,
			"body": "@Chikan: Just a heads up, anarchism isn't terrorism. Most people here on zeronet are anarchists. However, none of us are terrorists. But yeah, seems kinda odd that they'd have those things. I wonder what they're up to.",
			"post_uri": "126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB_1518713286",
			"date_added": 1519097539
		},
		{
			"comment_id": 14,
			"body": "yeah... this is where I nope out, sorry. I don't mind people dealing with loli/shota stuff. Not my thing but it's w/e. But as soon as CP is involved, I can't support it.\n\nHonestly, distributing CP is worse than being a pedo. Pedos at least know it's fucked up and just try to live their life without harming anyone (and loli/shota doujins are a great outlet for them). But selling CP? Fuck that.",
			"post_uri": "126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB_1530820302",
			"date_added": 1530880869
		},
		{
			"comment_id": 15,
			"body": "No one to play against lol.",
			"post_uri": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1535817578",
			"date_added": 1535853777
		},
		{
			"comment_id": 16,
			"body": "@Krixano: Sure. I just wanted to see it work lol. Could something like this be used to make an anon-chat like omegle or fakku.dating?",
			"post_uri": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1535817578",
			"date_added": 1535854788
		},
		{
			"comment_id": 17,
			"body": "@Krixano: Even if you had to be signed in, I'm just wondering if the \"live matching\" bit would work. Since that was typically the problem (avoiding storing the text, and being able to find a random match)",
			"post_uri": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1535817578",
			"date_added": 1535854904
		},
		{
			"comment_id": 18,
			"body": "@Krixano: That's actually really cool. I'm excited to see what it brings in the future. Is there any plans to have it added to zeronet officially?",
			"post_uri": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1535817578",
			"date_added": 1535855674
		},
		{
			"comment_id": 19,
			"body": ">58 sites\nI don't use that many sites regularly lol. Though I might have commented or posted on that many.",
			"post_uri": "1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1536047227",
			"date_added": 1536064720
		},
		{
			"comment_id": 20,
			"body": "I'm attracted to men so I'd fuck my boyfriend's body with my boyfriend's brain.",
			"post_uri": "15mag6bD3zPSDn4p4Yjpou5bdW2ZNZ59LZ_1536151221",
			"date_added": 1536199491
		},
		{
			"comment_id": 21,
			"body": "It didn't seem to save what I drew.",
			"post_uri": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1536336220",
			"date_added": 1536380032
		},
		{
			"comment_id": 22,
			"body": "They're different front ends for ZeroMe.",
			"post_uri": "1MaNnFswuYYyEP3B1BU8fctPX6puHzhsBg_1536422757",
			"date_added": 1536458094
		},
		{
			"comment_id": 23,
			"body": "Capitalism is crashing and on the way out. There's a reason you aren't paying to use social media.",
			"post_uri": "1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX_1537631400",
			"date_added": 1537670307
		},
		{
			"comment_id": 24,
			"body": "@Erinlalouve: There's ZeroTalk which is just a typical forum, albeit reddit-like. And then the closest we have is [ZeroVoat](http://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/) which is kinda dead, and is honestly pretty shit. A reddit clone is definitely needed. Ideally as a merger site.",
			"post_uri": "15Yab63fdrkKWDkvGdeK4DD4UjUBcNirTC_1538083313",
			"date_added": 1538274914
		},
		{
			"comment_id": 25,
			"body": "Has anyone actually gotten it to work? If y'all chinese peeps just want ipv6, no need to run cjdns. But cjdns is pretty cool, so definitely help try to get that set up.",
			"post_uri": "1MtG87PaFbgHfhnaVWP7RwXZrtbe1H7P5V_1538503649",
			"date_added": 1538542029
		},
		{
			"comment_id": 26,
			"body": "This is actually pretty cool. Went ahead and set it up on my end. I also went ahead and set up a site for my auth_address, so it should be accessible through it or through http://zero/kaffie.zeroid",
			"post_uri": "1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1538840061",
			"date_added": 1549259518
		},
		{
			"comment_id": 27,
			"body": "@Geekless: Well consider me a huge fan, even if there's no active development. Seems to work like a charm, and works to resolve the domain name filled gap we have right now. No one wants to use namecoin due to squatting and being locked into a centralized financial system. And pure addresses are kinda obnoxious.\n\nThe plugin here resolves everything and gives easy domain names based on usernames. I'm curious what else you have in mind.\n\nEdit: We really need a clean url standard. The long local ip+port is obnoxious and ugly and doesn't match everyone. But not everyone has http://zero/ or zero:// or raw name.bit support in their browser. I personally configured my browser to add support for just jumping straight to a name.zeroid site just as i can do with name.bit. But the lack of a standard is frustrating.",
			"post_uri": "1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1538840061",
			"date_added": 1549261830
		},
		{
			"comment_id": 28,
			"body": "I've been banning them from kaffiehub, and muting them on my own mutelist. Muting unfortunately doesn't prevent downloading/sharing apparently. But banning *does*. But I don't have access to every site to ban them from.\n\nI think it's probably a good idea to get a mutelist for the chinese spammers at least. And if there was a way to auto-ban a followed list that'd be neat too.\n\nI suggest that if y'all find \"nope content\" (in terms of CP or other things you don't want to share) that you *don't* rely on mutes, but instead rely on avoiding sites that allow that content. @nofish: is already aware of the problem of mutes still distributing content, and said he'd fix it after the python3 migration.\n\n\n@Eightyfour: I agree with the idea of different *kinds* of mute and blocklists. Pedos, loli/shota, nsfw content, spammers, etc. That way people who don't want, say, pedos or spammers can follow those lists, while still allowing nsfw content.\n\nAs it stands, I'll be banning any of these chinese spammers (or any spammer) that pops up. Can't say the same for nofish's sites haha. Just gotta mute and move on I suppose.",
			"post_uri": "191jbK3GNmVritcMymKkFuxyYFXxqv2xpC_1549495378",
			"date_added": 1549506256
		},
		{
			"comment_id": 29,
			"body": "Followable mutelist for spammers [here.](http://127.0.0.1:43110/1CufK1ZtvekbFXEpSyKT2gDjf9jnqW8KwG/)",
			"post_uri": "191jbK3GNmVritcMymKkFuxyYFXxqv2xpC_1549495378",
			"date_added": 1549509261
		},
		{
			"comment_id": 30,
			"body": "The comments on this are beautiful.",
			"post_uri": "1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1549540704",
			"date_added": 1549540887
		},
		{
			"comment_id": 31,
			"body": "@Geekless: Maybe it's just one chinese guy trying to make friends but he has no idea how to speak english or how social connections work.",
			"post_uri": "1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1549540704",
			"date_added": 1549543651
		},
		{
			"comment_id": 32,
			"body": "Imagine interplanetary ZeroNet 😍",
			"post_uri": "1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1549542994",
			"date_added": 1549543899
		},
		{
			"comment_id": 33,
			"body": "The live appearing content thing is something that sites have to manually add. nofish just has an incredible skill with polishing stuff to be really sleek.",
			"post_uri": "1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1549547068",
			"date_added": 1549547272
		},
		{
			"comment_id": 34,
			"body": "@SSDifnskdjfnsdjk: Technically untrue. While you *do* need a zeroid for a lot of major sites right now, it's *unneeded* for zeronet to work. As there are sites like millchan and zerovoat which don't require zeroid, and stuff like [kaffieid](http://127.0.0.1:43110/id.kaffii.bit/) lets you register without relying on any backend server whatsoever.",
			"post_uri": "1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1549547068",
			"date_added": 1549548175
		},
		{
			"comment_id": 35,
			"body": "@SSDifnskdjfnsdjk: That's not a problem with zeronet itself though. That's a problem with community education, and content. nofish isn't responsible for making every zite. That's up to users. So if you want to eliminate that \"requirement\", you need to promote alternative id providers that don't rely on a centralized backend.\n\nI've been pushing/proposing a way to allow permissions to *all* providers, without specifically listing them, and then having a blacklist. However, nofish has said he wants to do a proof of work provider system if that happens.\n\n@Geekless: Multiple id providers can be used on the same sites. Which makes it far superior to clearnet stuff. The bottleneck is that the zite owner has to list them all manually.",
			"post_uri": "1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1549547068",
			"date_added": 1549550176
		},
		{
			"comment_id": 36,
			"body": "@Geekless: Unfortunately I don't have a link on hand. The ID discussion has been going for a long time over many different posts. There might be something on github tbh.",
			"post_uri": "1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1549547068",
			"date_added": 1549575249
		},
		{
			"comment_id": 37,
			"body": "@Quantumworld: It's fast here on earth. But once you start going interplanetary or between galaxies or w/e it'll take a long time.",
			"post_uri": "1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1549542994",
			"date_added": 1549674501
		},
		{
			"comment_id": 38,
			"body": "I don't use the tor browser and I get that every time I come across recaptcha. It's horribly annoying to the point where I often just give up. See [here](http://127.0.0.1:43110/big.kopykate.bit/?Video=1549253667_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh)",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1551263397",
			"date_added": 1551263731
		},
		{
			"comment_id": 39,
			"body": "People talk a big game but then never follow through. Even I'm guilty for that. It is what it is. I don't really expect anything.\n\nPeople expect results, and unfortunately I struggle to provide any. And the zeronet crowd isn't really the most eager to participate in patreon or use clearnet services.\n\nI really wish I had an answer on how to fix my functioning. 100s of ideas I'd like to work on, a dozen half-finished projects, and 0 work being done lately. Docs are clueless about the cause of my issues unfortunately.\n\nI honestly feel like it's some fucked up mixture of mental illness, bad habits, bad environment, and a fucked up addiction to consumerism.\n\nBut thanks for any help you can provide.",
			"post_uri": "16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm_1553576306",
			"date_added": 1553576447
		},
		{
			"comment_id": 40,
			"body": "@styromaniac@zeroid.bit: That would be amazing. I don't have a paypal I can share yet, as they require some legal stuff I don't have situated yet (and haven't managed to get situated despite several visits to the DMV). AFAIK patreon takes paypal. I'm not sure if you can do a 1-time payment with that.",
			"post_uri": "16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm_1553576306",
			"date_added": 1553661156
		},
		{
			"comment_id": 41,
			"body": "ummm wtf? ngl sounds like you were talking more about aryans and nazis than the jews.",
			"post_uri": "15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1553635695",
			"date_added": 1553663191
		},
		{
			"comment_id": 42,
			"body": "@Realjohndoe: ummm you're kinda dumb lmfao. Though I'm curious: do you have an issue with their religion (judaism)? Or the race itself (levantine/phoenician/canaanite descent)? Because honestly it just looks like you are blindly hating jewish people without really even thinking through why you hold the views you do, and just mostly have a lot of biased views; many of which aren't true for a lot of people.\n\nNot all jewish people are zionists. Not all jewish people are greedy or bankers. Not all racially jewish people believe judaism and some are even christian.\n\nAs for the \"nasi/nazi\" thing, that's the stupidest shit I've ever heard. Nazi is short for national socialist; aka fascism. \"nasi\" and \"fascism\" don't share an etymological root. Nor do nasi and national socialism.\n\nThey don't even hold the same views. Nazis are *opposed* to jews and southern europeans in general. Nasi would be jewish people, who are naturally supportive of jews. Literally complete opposites. ",
			"post_uri": "15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1553635695",
			"date_added": 1553722327
		},
		{
			"comment_id": 43,
			"body": "Same as usual. I've been getting an itch to make something new for zeronet but I haven't had much time lately for it.",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1553709868",
			"date_added": 1553736803
		},
		{
			"comment_id": 44,
			"body": "looking at the donations I received? :P",
			"post_uri": "16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm_1553758785",
			"date_added": 1553764166
		},
		{
			"comment_id": 45,
			"body": "I feel like the only people you can really trust to not fucking lose it and do stupid shit like taking everything down is me and nofish.\n\nI'm mentally unstable but if I lost it I'd probably just vanish rather than burn my stuff.",
			"post_uri": "16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm_1557316231",
			"date_added": 1557365260
		},
		{
			"comment_id": 46,
			"body": "@leftside: Either way I keep my critical sites cloneable. If you can't trust me, make copies of my sites. You can trust that :P",
			"post_uri": "16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm_1557316231",
			"date_added": 1557366288
		},
		{
			"comment_id": 47,
			"body": "@Anonymouslogin: The sites I reupped are merger sites. you're free to clone the client and run your own hub. The client can't touch the data, and my hub is only one of many. As for what data I allow on my hubs/sites, I pretty much only remove spam and CP. Though sometimes I may ban people who only have an intent to spread hate and cause problems, rather than use the platform legitimately (discussing things, sharing ideas, talking, etc) regardless of views. For instance, talking about your views which may be deemed homophobic or transphobic is fine, but intentionally harassing users calling them fags is not good.\n\nI generally make it clear what my own views are and how I moderate my sites. If you're uncomfortable with that there's no reason why you can't clone the sites I have uploaded (which I encourage people to do).",
			"post_uri": "16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm_1557316231",
			"date_added": 1557469829
		},
		{
			"comment_id": 48,
			"body": "there's like a total of 3 girls on zeronet.",
			"post_uri": "15C1QHgbZtqgBQm8DY9MLkftgND9CZbbNY_1557465720",
			"date_added": 1557542136
		},
		{
			"comment_id": 49,
			"body": "The state of LGBT stuff is so bad that most \"LGBT\" people aren't even gay or transsexual.\n\nThe person in question isn't \"homosexual\", they're a heterosexual man. They aren't trans in the slightest either. Hell they don't even have gender identity disorder nor gender dysphoria. It's just someone exploiting they shitty political agenda/narrative to do shitty things that everyone expected.\n\nIt's really sad to see people like that dragging the reputation of my medical disorder through the mud like that. Since actual transsexuals are nothing like that.",
			"post_uri": "15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1564358129",
			"date_added": 1564408522
		},
		{
			"comment_id": 50,
			"body": "@Realjohndoe: Saying \"you are all the same\" really shows you've bought into the MSM narrative. The reality is that there's three distinct groups getting lumped under the same label.\n\n1. Literal fetishists like what you're talking about here. These people absolutely shouldn't be recognized as the opposite sex. Guy's a dude, no way around that.\n\n2. People with gender identity disorder. These are still largely men trying to be women. And are sort of a grey area in terms of what we should do. This is the main group that gets lumped into \"trans\". They tend to overlap with the fetishists, though not all of them are. It's messy.\n\n3. Lastly people like me, who are transsexual. IE the original disorder before it got appropriated and dragged through the mud. Basically we're very similar to intersex people in that we grew up as girls despite having male reproductive anatomy. These are corrected as a part of medical treatment. We're functionally asexual due to the nature of the disorder, and attracted to men, not women. So the Yaniv scenario literally *can't* happen with people like me.\n\nI actually agree on strict regulations/laws/etc. for legal sex. Traditionally here in california, us transsexuals had to have a doctor testify in court about our situation, the court would approve/deny, and we'd go on our way. Any history of crime, sexual assault, or weird medical history would result in a rejection. This, of course, was just scrapped for the \"uwu you are what you say you are\" model that groups 1+2 are pushing for to get into women's spaces.\n\nIf being attracted to older men is pedophilia, I guess all women are pedophiles?",
			"post_uri": "15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1564358129",
			"date_added": 1564451495
		},
		{
			"comment_id": 51,
			"body": "@SSDifnskdjfnsdjk: There's blocklists for spam. [Here's one I maintain.](http://127.0.0.1:43110/1CufK1ZtvekbFXEpSyKT2gDjf9jnqW8KwG/) Site owners can also manually remove spam (or do so by hand/having a centralized backend bot).",
			"post_uri": "1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy_1565076124",
			"date_added": 1565168221
		},
		{
			"comment_id": 52,
			"body": "Not possible. You *can* whitelist specific usernames as you would with zeroid, however there's nothing stopping people from changing their cert username to the whitelisted one.\n\nFor example if you whitelist \"kaffie@kaffie.bit\", then anyone can go onto the kaffieid site, sign themselves a kaffie@kaffie.bit cert, and then use your site. Instead the proper way of doing things is to whitelist *auth-addresses,* regardless of the specific id provider.",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1565445765",
			"date_added": 1565494362
		},
		{
			"comment_id": 53,
			"body": "sorry but I'm laughing so hard at this",
			"post_uri": "16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4_1580271822",
			"date_added": 1580273843
		},
		{
			"comment_id": 54,
			"body": "200,000 on 9/20/2020. They're really bad at hiding things.",
			"post_uri": "15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1600835897",
			"date_added": 1600845969
		},
		{
			"comment_id": 55,
			"body": "I see an image that says \"apollonian germ\". And the title of the thread is \"test topic\". Seems to load fine.",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1631621347",
			"date_added": 1631666297
		},
		{
			"comment_id": 56,
			"body": "@SSDifnskdjfnsdjk: yeah that's definitely odd.",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1631621347",
			"date_added": 1631696497
		}
	]
}