{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1575485461_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn": [
			{
				"comment_id": 1,
				"body": "I'm not too big on them myself though perhaps you could try look for an offline solution that interfaces via bluetooth or something that doesn't require sync to a server? Also I am a ZeroNet newcomer and am enjoying it so far.",
				"added": 1575496744
			},
			{
				"comment_id": 4,
				"body": "That's pretty rubbish. Potentially there's a smartphone app for example Huawei Health that allows you to interface locally with a wristband. I know for sure you can disable syncing there but its up to you on who you trust.",
				"added": 1575497512
			},
			{
				"comment_id": 5,
				"body": "> [myriri](#comment_78_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn): Huawei is heavily associated with the Chinese Communist Party and its armed wing (the Peoples Liberation Army)So they're not trustworthy. At all.\n\nI owned an Honor at one stage (sub brand of Huawei) then I ditched it for an S7 Edge earlier this year. Looking at Motorola as their Stock Android One looks attractive. Also regarding your fitness goal I've made a page on my site to try and get you some help. http://127.0.0.1:43110/1MpshuQA91fxBqrjCMUzDqXXCJMLs1en98/?Post:2\n\nHope you're doing good and if you need me my ZeroMail is: britical@zeroid.bit and I'll try get back to you ASAP.\n\nHave a good one,\nBritical.",
				"added": 1575498016
			}
		],
		"1575374057_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 2,
				"body": "Thank you everyone for cloning this stuff - very useful. Does anyone know if Libgen has been cloned yet?",
				"added": 1575496787
			}
		],
		"1575161695_1KDpaUh79hAu9u5dFdZeJptTi2u3wQcCUT": [
			{
				"comment_id": 3,
				"body": "Yeah it looks pretty awesome to me. How are you mperkins - new to this myself just curious as to how you are finding it. Considering putting my blog content on here. Need to work out how it works for publishing.",
				"added": 1575496973
			}
		]
	},
	"comment_vote": {}
}