{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1565321266_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1565188740_1JpWZr3hPmL8cYSKQCzuqUyhG25UuQsjPh": [
			{
				"comment_id": 1,
				"body": "We know. But it wasn't \"one rich guy.\" \"One rich guy\" doesn't result in a Democrat congressional committee sending you an \"invitation\" four days later, to answer for your thought crimes on live television. Jim and codemonkey WILL get us back on the clearnet eventually, but I do hope that a decent number of anons see the pragmatism in supporting the development of spooky solutions to partisan problems. This has been long overdue.",
				"added": 1565189963
			}
		],
		"1565145631_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": [
			{
				"comment_id": 2,
				"body": ">When Zeronet started taking off people volunteered to help but he said he didn't need any because he got a bunch of funding from some unnamed source.\nCould always fork it, if he really won't accept help.",
				"added": 1565194673
			}
		],
		"1565211401_17Z4Nn5umMdKxmgypwHXfe34rqnPPAq6nP": [
			{
				"comment_id": 3,
				"body": "Wanting to maintain a territorial border as a country to keep out anything other than a foreign military is inherently an artifact of racial reasoning. Borders are for keeping out unwanted people. The unwanted people are mostly \"People of Color.\" So yes, it is White Supremacy. Whites want to maintain their collective right to self-determination. That is White Supremacy.",
				"added": 1565222043
			},
			{
				"comment_id": 4,
				"body": "> [dailycallout](#comment_2_17Z4Nn5umMdKxmgypwHXfe34rqnPPAq6nP): dailycallout \n\nGiraffes bleed red too. I identify as a giraffe now. If you don't accept that I am a giraffe then you are a bigot.",
				"added": 1565222230
			},
			{
				"comment_id": 5,
				"body": "> [bigbadbob](#comment_42_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): wax my balls...bigot\n\nAs a giraffe, I'm afraid that I don't have fingers.",
				"added": 1565224088
			},
			{
				"comment_id": 6,
				"body": "> [tamamshud](#comment_3_13wBVRbx9AW7LaCUpcwgtoqN7wS7wEGR9Z): the \"sovereignty\" crowd \n\nIf you're referring to white supremes, the reason they don't \"try to improve labor rights and living conditions abroad\" is because they don't believe it's possible in the first place. As for unionizing illegals, that would be counterproductive... They would never leave and would then have an even greater air of legitimacy. Plus they would never engage in that in the first place because it would remove their advantage in the job market. There would literally be no reason to hire them. Employers being able to pay them less and not having to worry about a billion employment regulations is exactly why they do it.",
				"added": 1565225618
			}
		],
		"1565213051_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": [
			{
				"comment_id": 7,
				"body": "> [aspidochelone](#comment_1_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): We should allow racists in ... we should not leave them unchallenged. \n\nGood. That's a healthy attitude.\n\n> [aspidochelone](#comment_1_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z):  This forum can become the sewage treatment plant for the politics of humanity.\n\nThat's exactly why they chased us down in the first place. People came to us to try to convince us that our ways are wicked, only to eventually find themselves convinced. That's why we had to be stopped. Come engage us. Ask questions. Find out why we're the way we are.",
				"added": 1565227911
			}
		],
		"1565292753_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": [
			{
				"comment_id": 8,
				"body": "> [mg0](#comment_86_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): wether normies get here to catch a glimpse of it and leave or stay, I cannot predict\n\nThe media is unintentionally signal boosting ZeroNet because they're completely retarded and think they can stop anons from coming here by telling everybody that they'll be distributing CP if they come to the DARK WEB OF NEFARIOUS MYSTERIES. There's already been articles from CNN, Kotaku, Thedailybeast, and a bunch of other places about it. They thought that by hitting a (the?) central hub of political wrongness, anons would just disperse and stop organizing. Instead the media and the political left just played themselves to the tune of Barbra Streisand. Get comfy, you're in for quite a show.",
				"added": 1565299022
			},
			{
				"comment_id": 9,
				"body": "> [masterik](#comment_6_1LFedFTgmtHTfqqMRd4euD7BrVQBzatZUi): I'm more excited about it catching the attention of web developers and webmasters. Would be nice to see more cool sites up and running.\n\nYou do realize that 8ch had a /tech/ board, right? They're here too now.",
				"added": 1565305383
			}
		],
		"1565342542_16vtDQkRKY8atc9K3oCBTvMW1ojLLVxry5": [
			{
				"comment_id": 10,
				"body": "There's a size limit button/option for a reason.",
				"added": 1565353721
			}
		],
		"1565321865_18Eg3doTf26uabVuTnryFMUk9cKEz9idu7": [
			{
				"comment_id": 11,
				"body": "We can't stupidproof the software and there will always be zites that host illegal stuff, just like they do on the clearweb. The media is just spreading FUD because that's what they're good at and they know it's a fairly effective tactic to corral the uncritical masses. The pure, ignorance-induced panic I'm seeing on some clearweb forums and chans about \"OMG HOW DO I MAKE SURE EVERY TRACE OF ZERONET IS BLEACHED FROM MY HARDDRIVE?\" is absolutely hilarious. But as long as there are any zites on ZeroNet that are hosting illegal content, the media will always have something to latch onto to emphasize just how DARK and SPOOKY the \"dark web\" really is.\n\nIf you want to counter-signal the media's poisoning of the well, we'll have to reframe the conversation on the clearnet with positive memes. For example, stop calling ZeroNet a \"dark net.\" People from meat world don't know what that term means and aren't going to take the time to look it up. They just see the word \"dark\" and their sphincters contract reflexively. Instead we have to settle on a new descriptor for it and then \n-----------we all have to be on the exact same message in order to make it stick.----------- If we deviate from the agreed upon phrase, then it won't stick and the media wins by default. Everyone has to be using the exact same phrase. So a few examples, why not meme ZeroNet as a:\nBubbleWeb\nShareWeb\nSideWeb\nSocialNet\n\nIt needs to be something happy sounding or at least neutral. Those are just a few ideas off the top of my head. Avoiding \"net\" in favor of \"web\" may also be a good idea too since it sounds too techy, but that's negotiable.",
				"added": 1565355842
			}
		],
		"1565321266_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": [
			{
				"comment_id": 12,
				"body": ">Personally, I'm not mad at the person doing it. I think he is doing a good thing.... he is forcing us devs to find a solution for this.\nYes. We need more evolutionary pressure. Overcoming the crisis this creates will present an opportunity for our kind to evolve even further.\nhttps://youtu.be/ZQO8JzV2FN4?t=342\n\n\n> [zeronetanon4](#comment_24_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v):  Perhaps something that asks random questions on things that require you to do light Googling to solve it. \n\nA good solution in that scripts don't do abstraction well. Remember that if the questions are too generic, google itself will provide the answer. Two problems: Compiling a well of questions to use requires human input. The questions have to be factual. \n\nSeeing as the solution we're seeking would also be useful for stemming the flow of non-automated spam, Holohoax questions would be perfect and a wonderful way to troll since leftists wouldn't want to answer them accurately, even if they knew the right answer. They're perfect because you'd be turning google's own bias against it. Google would be biased in favor of spitting out lies when asked questions relating to that topic. This would slow down both bots and human bad actors.\n\n\n> [zeronetanon4](#comment_24_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v):  For instance.... what date did event occur (with dropdown menu for day/month/year), or the atomic weight of a certain element, or the CEO of a random large company, etc. \n\nThose questions wouldn't take long for someone to find a way to pull that data automatically. It needs more abstraction. But that plus the additional complexity you suggested would work well for the near term and would be easy to populate a list for.\n\n\n> [removeboomer](#comment_7_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5): I saw the admin of 08chan talk time limiting ID creation, that would do the trick for now at least.\n\n> [zeronetanon4](#comment_25_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v):  Accounts could require further validation every 1-2 weeks to prevent against a bad actor amassing a large amount of dormant accounts.\n\nRate limiting ID creation is definitely the way to go for now. This has the added benefit of limiting the flexibility of shills to switch IDs for astroturfing/consensus cracking. I think IDs should require further validation at most every few days though. Depends on what the ID creation rate is going to be set at.\n\n\n> [aspidochelone](#comment_16_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): If you work out a way to block him, that mechanism will soon be used to block any badthink.\n\nIn theory, yes it could be. It doesn't have to be. Right now we basically have two choices: benevolent dictator or tyranny of a minority. Both Ludwig von Mises and Murray Rothbard made it clear that when presented with such a situation, they'd take the benevolent dictator any day. Besides, on here any content that gets \"blocked\" would just be hidden... Not actually removed.\n\n\n> [tinktinktink](#comment_1_15QMtSMe3Ckgr3m3bajRgDbNsChibX6sK4): Thanks for not hating me so much.\n\nHi Mr. Tinky.\n\n> [tinktinktink](#comment_6_15QMtSMe3Ckgr3m3bajRgDbNsChibX6sK4): Let's see where the future leads us, I will be there on every update to try to break everything and burn it to the ground lmao\n\nIt's a date. <3\nBring flowers next time please.",
				"added": 1565359131
			},
			{
				"comment_id": 13,
				"body": "> [tinktinktink](#comment_16_15QMtSMe3Ckgr3m3bajRgDbNsChibX6sK4): it also limits legit users who want to stay as anonymous as possible.\n\nBest practice would be to assume that you're always exposed anyway, is it not? A false sense of security is potentially more dangerous than none at all. If users are following that principle, then what difference does it make if each post stands alone or if an hour's worth of posts are linked? Most of those posts could already be fairly reliably linked through text analysis anyway. I think the tradeoff is worth it if the alternative is the board being functionally non-functional.\n\n> [rusnoob1](#comment_10_1CyoFuqywpEgKYPHjQUui3TJQuEDqNqThN): Again: Use phone like password is used. Compare salted hash, dont store it.\n\nFFS, that's basically what all the qboomers are suggesting on twitter. You'd instantly lose at least 90% of the user base if you started charging... That's a non-starter for so many reasons that I don't even know where to start.",
				"added": 1565361099
			}
		],
		"1565358798_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 14,
				"body": ">For those who really have this desire to understand, go see on the side of non-duality\nHow many genders are there?\n\n>Those who will resist the idea are precisely those who are still identified with that false sense of identity.\nBut you're posting with a false identity too. Why aren't you posting under your real name so that you can be truly decentralized? Be the hero that Gotham needs right now.\n\n\n> [xcape2net](#comment_195_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz):  Then, or preferably before you hit the limit, you have to email @nofish to get it raised. \n\nNo, you just make a new ID. Why the hell would you bother him to raise your limit? This isn't twitter... No blue checkmarks here.",
				"added": 1565361720
			},
			{
				"comment_id": 15,
				"body": "> [trevorlaneray](#comment_20_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): That's... hmm. Good point. Not sure how @nofish would feel about this becoming the norm.\n\nPretty sure it's already the norm. I've been here for years and seen plenty of ID switching.\n\n\n> [randomshits](#comment_34_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): some lamer seeking attention by posing unfounded assumptions. \n\nThis guy isn't nearly as entertaining as the Aussie tranny from a year or two back that posted a video of itself on copykate where they had a psychotic meltdown and started passionately making out with their monitor. They were spamming up ZeroTalk like this too.",
				"added": 1565362884
			},
			{
				"comment_id": 16,
				"body": "> [randomshits](#comment_37_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): The 'good' trolls are added to Zeronet blocklists.\n\nNah, they weren't trolling. They were legit unhinged. OP probably is too.\n\n\n> [trevorlaneray](#comment_25_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): The mental image of that just gave me the giggles.\n\nIt would have been funny, but by the time it gets to that point in the video it's just genuinely disturbing. It's clear that the guy was quite insane. I know I still have the video laying around somewhere... I'll try to find it.\n\n\n> [h3bhkj5gqz4n3pjm](#comment_712_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): your computer creates an identity for zeronet, yes or no\n\nNo, I am a silicon based entity. Assuming my molecular makeup like that really triggered me. There's no need for that kind of bigotry here.\n\n\n> [trevorlaneray](#comment_27_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): Seriously though, I think it's just that he's either not a native English speaker, or just has difficulty with vocalizing what he means.\n\nNah, they're just nuts. This isn't a language barrier thing, even if English isn't his first language.",
				"added": 1565363517
			},
			{
				"comment_id": 17,
				"body": "> [xcape2net](#comment_210_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Did not know that. Thanks. Of course, he could also be a schizophrenic AI.\n\nPretty sure he's not Cortana.",
				"added": 1565363823
			},
			{
				"comment_id": 18,
				"body": "> [trevorlaneray](#comment_25_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): The mental image of that just gave me the giggles.\n\nI FOUND IT. Sylvaine was his name and I even found the kopykate post. http://127.0.0.1:43110/big.kopykate.bit/?Video=1521868593_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG",
				"added": 1565379305
			}
		],
		"1565386027_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": [
			{
				"comment_id": 19,
				"body": "The Big Data industry is pure cancer, but if it's on NetFlix then I'm sure it will just be a partisan hit piece, devoid of meaningful information. They openly make fun of white people on a regular basis.",
				"added": 1565388441
			}
		]
	},
	"comment_vote": {
		"3_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": 1
	}
}