{
	"next_comment_id": 3,
	"comment": [
		{
			"comment_id": 1,
			"body": "hola che.. la verdad cuando entre aqui senti ese \"olor a nuevo\" que no experimentaba desde hace ya 16 años al frente de una pc, con aquellos chats de uol y tener una casilla de yahoo o hotmail, cosas todas juntas que parecian las puertas de un nuevo mundo.\n Pero bueno, todo resulto ser una mierda (menos las juntadas de CS 1.5 y 1.6 en las que si se formaba una comunidad, increible no?). No tanto por el capitalismo creo si no por la calidad en humanidad y conocimiento de la gente que fue utilizando estos servicios 'centralizados'.\n Bien,  te cuento esto para que veas.. mejor dicho.. seas testigo de la esperanza o sentimiento que puede experimentar una persona al entrar en estas \"nuevas redes\" (freenet aun no la probe.. y los dominios onion me resultaron una porqueria). Que javascript no es lo mejor? bue.... que no hay cifrado... bue...\n Pero que es lo que queremos esconder en definitiva? tener buenas intenciones? porque desde aqui -y desde ninguna web, wikileaks ya es la prueba- a un gobierno o poder concentrado vamos a derrocar.\n Solo nos queda crear, para mi punto de vista, un nuevo mundo que tenga nuevas herramientas, como esta por ejemplo donde no hay banners ni populan los sitios generados por interés comercial (aun!).\n Algo mas viejo (aqui en argentina decimos 'viejo' mostrando confianza o amistad),  yo estoy con tor activado y desde la misma web de zeronet dicen como hacerlo. Precisamente seguí esos pasos.\n Saludos y espero contacto o respuesta...",
			"post_id": 112,
			"date_added": 1466051265
		},
		{
			"comment_id": 2,
			"body": "gracias che por el resumen. Bastante conciso lo noto... y muy util para alguien que como en mi caso no posee tantos conocimientos tecnicos.\n En resumen sale ganando freenet en todos los campos.\n ZeroNet me parece hace doler menos la cabeza al usar javascript (o es json?) para efectos, fuentes y cosas visuales. Hace la experiencia mas agradable que en Freenet. Supongo que Zeronet se ideo bajo la siguiente premisa:\n Crear una red p2p de gran calidad visual y poder de competencia para con la \"World Wide Web\" y otras similares.",
			"post_id": 114,
			"date_added": 1466063589
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}