{
	"next_post_id": 87,
	"next_comment_id": 32,
	"next_follow_id": 105,
	"avatar": "jpg",
	"user_name": "Topnet",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "*   [p2p software](http://127.0.0.1:43110/1P5Sybb44xTi6T6o5e2buZ8SR1zdsbX3Ae/)\n\n    [My YouTube - ZeroNet Channel](http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?My)\n\n*   [p2p blog](http://127.0.0.1:43110/1N3KuCTPnU4gWmHpJKfv6kLJV4xuYiaeGP)\n\n*   [Полезные статьи](http://127.0.0.1:43110/1Mv6N3tZD8txahjwRCKXWe5U86wWYzfnLB/)\n\n\n\n",
	"post": [
		{
			"post_id": 1,
			"date_added": 1577373896,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1577377413,
			"body": "python",
			"date_added": 1577377410,
			"meta": "{\"img\":\"900,675,fffccbbca897764888dddaa9675544533554786eee333322,0001234500067389AB6078BC8B9C7D5BBBCC4831BBB9EAF987994BB9EFFBE94BB99EE95BEEEE9EEE\"}"
		},
		{
			"post_id": 1577377435,
			"body": "",
			"date_added": 1577377431,
			"meta": "{\"img\":\"586,700,754764875788631843321853a73b96b84963642332773da5,00122321452222065121214671211746892A2B46B919AB46A8993C4DAAA99CECFFFFAFE0FFFFF9FF\"}"
		},
		{
			"post_id": 1577377464,
			"body": "\n\nPrivacy using our Tor-inspired onion routing\nSearch and download torrents with less worries or censorship\n\nhttps://www.tribler.org/\n\n#tribler #torrent #p2p #network #sharing #security #peer-to-peer #privacy #Awesome #software #шифрование #анонимность #приватность #слежка #защита #цензура #роскомнадзор #блокировки #обход-блокировок #caesura #privacy #Конфиденциальность #обходблокировок #доступ #россия #peer-to-peer #Network\n",
			"date_added": 1577377459,
			"meta": "{\"img\":\"900,506,777999666333232222444,011022220034355555554533555543554555555455335555343366333363\"}"
		},
		{
			"post_id": 1577377516,
			"body": "",
			"date_added": 1577377510,
			"meta": "{\"img\":\"900,506,333655766444555222676999777888578566789345,01233433553343678355446369935533334883504430046055AA8BBCADDD\"}"
		},
		{
			"post_id": 1577377525,
			"body": "",
			"date_added": 1577377518,
			"meta": "{\"img\":\"900,684,a99aaa8986877998aabbb577998788cdc876875bcc,000111234511456477341816612244191AA6BBBB976AA6BBCB999AAD08B2929ADD61B9220A661000\"}"
		},
		{
			"post_id": 1577377557,
			"body": "тигра",
			"date_added": 1577377549,
			"meta": "{\"img\":\"525,700,888bbc9aa8ab777542432211567000764555976753ca7b86,0001111122003311004003305677775877740440997977AB79AC76D577AE567667DF6767676D6656\"}"
		},
		{
			"post_id": 1577377594,
			"body": "\n\nopen source Driver Installer /\nSnappy Driver Installer\n\nInstall missing drivers and update old drivers\n\nIf you’ve lost your driver discs, you’re unable to find drivers on the manufacturer’s web site or Windows Update can’t configure your hardware, use this tool to quickly find and install all missing drivers.\n\nIf you’re a PC technician, keep Snappy Driver Installer on your USB flash drive or external hard drive and take it with you wherever you go. In environments with no Internet access you can quickly get things working. No more searching for drivers after a clean install, just let Snappy Driver Installer do it’s thing and your job will be done in no time.\n\nhttps://sdi-tool.org/\n\n#Install #Installer #Driver #sdi #driverpack\n",
			"date_added": 1577377585,
			"meta": "{\"img\":\"900,532,8bb5ab6bb7ab8b99b87b87a88a98a7acd8cd7bc8a67cd,012033456733848889940A0BBBBBB004022CC2C0DD422EEEB0DD8CCBBBB0\"}"
		},
		{
			"post_id": 1577377633,
			"body": "\n\nLoRa Mesh Chat\n\nA simple add-on for mobile phones to enable SMS-like messaging in a group when outside cell coverage, or in disaster scenarios.\n\nhttps://www.hackster.io/scottpowell69/lora-mesh-chat-5267d9\n\nhttps://github.com/spleenware/ripple\n\n#sms #phone #radio #Mesh #chat #LoRa #LoRaMeshChat\n",
			"date_added": 1577377623,
			"meta": "{\"img\":\"900,675,baa98899a4684576798ac68b87789a444766234666655122,0000122022000234522200267551180157691AB822637884CD2BB981ECA81B1111AFD1181111EE81\"}"
		},
		{
			"post_id": 1577377675,
			"body": "\n\nВыпущен специализированный Linux-дистрибутив CAINE 11.0, который предназначен для проведения криминалистического анализа и поиска скрытой информации. Эта Live-сборка основана на Ubuntu 18.04, поддерживает UEFI Secure Boot и поставляется с ядром Linux 5.0.\n\nДистрибутив позволяет анализировать остаточную информацию после взлома на системах Unix и Windows. В комплекте идёт большое количество утилит для работы. Отдельно отметим специализированный инструмент WinTaylor для анализа ОС из Редмонда.\nИз других утилит можно упомянуть GtkHash, Air, SSdeep, HDSentinel, Bulk Extractor, Fiwalk, ByteInvestigator, Autopsy, Foremost, Scalpel, Sleuthkit, Guymager, DC3DD, а также скрипты к файловому менеджеру Caja, которые позволяют проверять все компоненты ФС, в том числе дисковые разделы, реестр Windows, метаданные и удалённые файлы.\n\nНовая система поддерживает по умолчанию монтирование разделов только на чтение. Также в дистрибутиве сокращено время загрузки, а загрузочный образ можно копировать в ОЗУ. Добавлены утилиты для получения данных из дампов памяти и остаточной информации из образов дисков.\n\nСкачать новинку можно по ссылке. Дистрибутив будет полезен системным администраторам, компьютерным криминалистам, судебным экспертами и специалистам в области информационной безопасности.\n\nhttps://www.caine-live.net/\n\n#CAINE #linux #экспертиза #мвд #фсб #обвинительноезаключение #следствие #суд\n",
			"date_added": 1577377664,
			"meta": "{\"img\":\"900,507,110111000011210320421431100222,012222222231204553221102675022113204222213840488229122222322\"}"
		},
		{
			"post_id": 1577377701,
			"body": "\n\nCAINE (Computer Aided INvestigative Environment) is an Italian GNU/Linux live distribution created as a Digital Forensics project\nCurrently the project manager is Nanni Bassetti (Bari - Italy).\nCAINE offers a complete forensic environment that is organized to integrate existing software tools as software modules and to provide a friendly graphical interface.\nThe main design objectives that CAINE aims to guarantee are the following:\n\nan interoperable environment that supports the digital investigator during the four phases of the digital investigation\na user-friendly graphical interface\nuser-friendly tools\n\nWe recommend you to read the page on the CAINE policies carefully.\n\nCAINE represents fully the spirit of the Open Source philosophy, because the project is completely open, everyone could take on the legacy of the previous developer or project manager. The distro is open source, the Windows side is freeware and, the last but not least, the distro is installable, thus giving the opportunity to rebuild it in a new brand version, so giving a long life to this project …\n\nhttps://www.caine-live.net/\n\n#CAINE #linux #экспертиза #мвд #фсб #обвинительноезаключение #следствие #суд\n",
			"date_added": 1577377689,
			"meta": "{\"img\":\"900,507,110111000011210320421431100222,012222222231204553221102675022113204222213840488229122222322\"}"
		},
		{
			"post_id": 1577377734,
			"body": "\n\nPeer-to-peer ephemeral public communities\nOpen source, self-governing communities with auditable moderation and mod elections\nAether Pro released\nIt’s a collaboration app based on Aether, but for teams. It works well for startups and for engineering, PM and design organizations\n\nhttps://github.com/nehbit/aether\nhttps://getaether.net/\n\n#Aether #install #linux #p2p\n",
			"date_added": 1577377721,
			"meta": "{\"img\":\"900,483,133233455333223433565456534445544,012344444513633443450173333338019334444541A3333335\"}"
		},
		{
			"post_id": 1577377778,
			"body": "\n\nThe Orville Season 3 Release Date, Cast, Episodes, Plot, and News\n\nThe Orville Season 3 will boldly continue on Hulu. Here is everything we know about The Orville Season 3.\nThrough two seasons, The Orville is the little Star Trek homage that could. Like its (unofficial) Trek forefathers, The Orville has built up a small but formidable fanbase. Fox has rewarded that fanbase by ordering The Orville Season 3…but it won’t air on Fox.\n\nOrville creator Seth MacFarlane announced during San Diego Comic-Con 2019 that the show will be moving to Hulu for Season 3. That’s right. The Orville is no longer a Fox show. It is now a Hulu original. With Hulu itself being exclusively owned by Disney, just as the show’s former network home of Fox, the shoe apparently fits.\n\nHere is everything else we know about The Orville season 3.\nThe Orville Season 3 Release Date\n\nIt’s not clear when The Orville season 3 premiere will happen…particularly with the move to Hulu. The first season arrived in the traditional September premiere window, while season two was held for midseason and didn’t arrive until nearly January. Considering that this is an intricate, expensive show to produce, The Orville season 3 might be a better fit for midseason.\n\nAs Seth MacFarlane said of the move to Hulu:\n\n“The Orville has been a labor of love for me, and there are two companies which have supported that vision in a big way: 20th Century Fox Television, where I’ve had a deal since the start of my career, and FOX Broadcasting Company, now FOX Entertainment, which has been my broadcast home for over 20 years. My friends at the network understood what I was trying to do with this series, and they’ve done a spectacular job of marketing, launching and programming it for these past two seasons. But as the show has evolved and become more ambitious production-wise, I determined that I would not be able to deliver episodes until 2020, which would be challenging for the network. So we began to discuss how best to support the third season in a way that worked for the show. It’s exactly this kind of willingness to accommodate a show’s creative needs that’s made me want to stick around for so long. I am hugely indebted to Charlie Collier and FOX Entertainment for their generosity and look forward to developing future projects there. And to my new friends at Hulu, I look forward to our new partnership exploring the galaxy together.\"\n\n#Orville #TVseries #startrek #movie\n",
			"date_added": 1577377764,
			"meta": "{\"img\":\"900,506,e97943d75854843632532521b65742411a65311622b64a53,0122345567854843497ABCA5D777AA5CA577A7CADC71D7AACAEC9F957AA5\"}"
		},
		{
			"post_id": 1577377815,
			"body": "",
			"date_added": 1577377800,
			"meta": "{\"img\":\"900,512,341552773663898acc742632885ccaddbcb9964c97aa8,0112231145011113613301327676889AABC8CDEEBAABBEEBBBBBA9999EEE\"}"
		},
		{
			"post_id": 1577377878,
			"body": "\n\nandroid one\n\nAndroid One is a series of smartphones that run the unmodified Android operating system. It is a hardware and software technical standard created by Google intended to provide a consistent user experience and improved security through frequent updates and Google Play Protect. Android One was launched in 2014 and focused on entry-level devices for emerging markets, but later evolved into Google’s principal mobile program\n\nhttps://www.android.com/one/\n\nhttps://en.wikipedia.org/wiki/Android_One\n\nСкорость транзакций Litecoin test скорость перевода Transaction speed test\n\ndims.jpg\n\n#android #one #nokia #phone #\n",
			"date_added": 1577377862,
			"meta": "{\"img\":\"900,506,44733642711122266668946876977a88979a999bbb777444,01110223410567800433087798851488AB89854489777AA513CDC6ADCEF4\"}"
		},
		{
			"post_id": 1577377913,
			"body": "\n\nBliss ROMs\n\nWorking together to bring you an Open Source OS, based on Android, that incorporates many customizations, options and added security features.\n\nAnd it is available for…\n\nAbout Bliss\n\nWe are a volunteer based non-profit organization that works to maintain various open source & closed source development projects. We provide the inspiration, training and mentorship to help the dreams of those that join, become reality.\n\nOne of our main focuses is to provide a quality ROM/OS that can run on all your devices, preserving customizations and options by syncing across all platforms. We try to include all the features you can imagine, for just about any situation.\n\nhttps://blissroms.com/\n\n#android #x86 #OS #Bliss #desktop\n",
			"date_added": 1577377896,
			"meta": "{\"img\":\"900,648,aaa888666111222444333234777999,0111111110234566444223466667428464444442866444444286444434420888888889\"}"
		},
		{
			"post_id": 1577377927,
			"body": "Bliss OS (x86)\n\nAndroid for your PC\nAn Open Source OS, based on Android, that incorporates many customizations options and added security features. And it is available for just about any Chromebook, Windows/Linux PC or tablet released in the last 4 years\n\nhttps://blissroms-x86.github.io/",
			"date_added": 1577377909
		},
		{
			"post_id": 1577377943,
			"body": "\n\nMaps\n\nOpenStreetMap offline maps with track recording and custom bookmarks .kml path. Based on MAPS.ME project. Features include:\n\nTrack Recording (record your tracks)\n\nCustom Bookmarks path (helps backup your bookmarks with apps like: Syncthing)\n\nRemoved ads and binaries (peace and freedom)\n\nScreenlock option (prevent app stay turned on while in pocket with lockscreen enabled)\n\nhttps://f-droid.org/ru/packages/com.github.axet.maps/\n\n#maps #osm #openstreetmap\n",
			"date_added": 1577377924
		},
		{
			"post_id": 1577377959,
			"body": "\n\nStreetComplete is an Android app which finds wrong, incomplete or extendable data in the user’s vicinity. It lists them as easily answered questions, thereby allowing changes to be made directly on site without having to use another editor.\n\nData issues are presented to the user as markers on a map. They can be solved by filling out a simple form to complete/correct the information. The user’s answers are then processed and directly uploaded into the OSM database categorised by quest type in the name of the user’s OSM account. Since the app is meant to be used while out and about, it works offline and otherwise aims to be economic with data usage.\n\nThe app is aimed at users who do not know anything about OSM tagging schemes but still want to contribute to OpenStreetMap by surveying their neighbourhood (or other places). Because of the target group, the app only presents issues which are answerable very clearly by asking one simple question, and which involve very few false positives. It is also useful for more experienced mappers who can skip creating notes and manual entering data.\n\nhttps://f-droid.org/repository/browse/?fdid=de.westnordost.streetcomplete\nhttps://github.com/westnordost/StreetComplete/\n\n#StreetComplete #openstreetmap #osm\n",
			"date_added": 1577377939
		},
		{
			"post_id": 1577377998,
			"body": "",
			"date_added": 1577377977,
			"meta": "{\"img\":\"700,700,aaa444222333999eeefff888555bbb777ccc666000111,01231456667322879666982AA45544732887B0BC22223818882D22852221DDD23CA888DDEEE9E218DDD2EDDD23DDDD2DDDDE\"}"
		},
		{
			"post_id": 1577378033,
			"body": "\n\nP2P anonymous file sharing анонимный обмен файлами retroshare\n\nВся информация в сети retroshare передается в зашифрованном виде в retroshare нет прямых соединений вся информация передается через другие узлы сети в зашифрованом виде к примеру в сети 10000 активных пользователей и если создать анонимную личность то узнать будет невозможно кто что раздавал или скачивал плюс ко всему retroshare пробивает nat если вы за НАТ то торрент фаилы вы раздать не сможете а вот retroshare пробивает НАТ\n\nнастройка для глобальной анонимной раздачи файлов\n\nрезультаты поиска поиск в retroshare просто офигенный намного лучше чем в emule и подобных программах\n\nhttps://retroshare.cc/\n\nhttps://appimage.github.io/RetroShare/\n\nhttps://github.com/RetroShare/RetroShare/releases\n\nhttps://github.com/RetroShare/RetroShare/releases/tag/v0.6.4\n\nhttps://retroshare.ch/\n\nhttps://retrochat.piratenpartei.at/\n\n#p2p #retroshare #network #sharing #security #peer-to-peer #privacy #Awesome #software #шифрование #анонимность #приватность #слежка #защита #цензура #роскомнадзор #блокировки #обход-блокировок #caesura #privacy #Конфиденциальность #обходблокировок #доступ #россия #peer-to-peer #мессенджер #GNU #Network\n",
			"date_added": 1577378011,
			"meta": "{\"img\":\"900,458,bcccccddcdddeeefff,01111123323413321343453343145445334314543313331232\"}"
		},
		{
			"post_id": 1577378049,
			"body": "\n\nWelcome to Fedora Pagure\n\nPagure is an Open Source software code hosting system.\n\nhttps://pagure.io/\n",
			"date_added": 1577378026
		},
		{
			"post_id": 1577378071,
			"body": "\n\nOverview\n\nmpv is a fork of mplayer2 and MPlayer. It shares some features with the former projects while introducing many more.\n\nhttps://mpv.io/\n\n#player #mpv #media\n",
			"date_added": 1577378047
		},
		{
			"post_id": 1577378151,
			"body": "\n\nKeePassXC\nKeePass Cross-Platform Community Edition\n\nThe thing computers can do best is storing information.\nYou shouldn’t waste your time trying to remember and type your passwords.\nKeePassXC can store your passwords safely and auto-type them into your everyday websites and applications.\n\nhttps://keepassxc.org/\n\n#KeePassXC #password #passwordmanager #менеджерпаролей\n",
			"date_added": 1577378126,
			"meta": "{\"img\":\"900,615,dddeeefffcdccccbbb,0111112211000000111111113311111110000111114455441110000000011111111111\"}"
		},
		{
			"post_id": 1577378200,
			"body": "\n\nhttps://retroshare.ch/\n\n#RetroShare #chatserver #chat #server #p2p\n",
			"date_added": 1577378174
		},
		{
			"post_id": 1577378321,
			"body": "\n\nRats on The Boat - BitTorrent search engine\n\nBitTorrent search program for desktop and web. Collect and navigate over base of torrents statistic, categories, and give easy access to it. Work over p2p network and support Windows, Linux, Mac OS platforms.\nFeatures\n\nWorks over p2p torrent network, doesn't require any trackers\nSupports own p2p protocol for additional data transfer (like search between rats clients, descriptions/votes transfer, etc.)\nSearch over torrent collection\nTorrent and files search\nSearch filters (size ranges, files, seeders etc...)\nCollection filters (regex filters, adult filters)\nTrackers peers scan supported\nIntegrated torrent client\nCollect only statistic information and don't save any torrents internal data\nSupports torrents rating (voting)\nP2P Search protocol. Search in other Rats clients.\nWeb version (web interface) for servers\nTop list (mostly common and popular torrents)\nFeed list (Rats clients activity feed)\nTranslations: English, Russian, Ukrainian, Chinese\nDrag and drop torrents (expand local search database with specific torrents)\nDescriptions association from trackers\n\nhttps://github.com/DEgITx/rats-search/releases\n\n#Поисковик #торрентов #btdigg #DHT #DHTsearchengine #btdig #BitTorrent #Torrent #поисковик #торрент #торренты #search #p2p #network #sharing #security #peer-to-peer #software #шифрование #анонимность #защита #цензура #роскомнадзор #блокировки #обход-блокировок #caesura #privacy #Конфиденциальность #обходблокировок #доступ #россия #peer-to-peer #мессенджер #GNU #Network #torrent-search #npm #github\n",
			"date_added": 1577378294,
			"meta": "{\"img\":\"900,483,76788878a766777aaa9aa532543643111222fffeeedee,0121334556778997AAB8CCCDEDCCCCCCECCCCCCCCCDCCCCCCC\"}"
		},
		{
			"post_id": 1577378444,
			"body": "\n\nМетеостанция для OpenWeatherMap на Raspberry Pi Weather station for\n\nWeatherStation 1.2.0\nhttps://github.com/DzikuVx/WeatherStation\n\n#OpenWeatherMap #RaspberryPi\n",
			"date_added": 1577378416,
			"meta": "{\"img\":\"900,673,7995886764764663548ab454565bdd343677acd9bcbde789,0111232345604278234590235A744BC602525A759D01B22847EC00BBB602EC0122F0DD\"}"
		},
		{
			"post_id": 1577379113,
			"body": "\n\nRetroShare p2p Tutorial\n\nhttps://www.youtube.com/watch?v=Cce0208UidM\n\nhttps://www.youtube.com/watch?v=sUfF7HVDsKw\n\nhttps://www.youtube.com/watch?v=tAicw7KgAEU&t=221s",
			"date_added": 1577379084,
			"meta": "{\"img\":\"900,458,bcccccddcdddeeefff,01111123323413321343453343145445334314543313331232\"}"
		},
		{
			"post_id": 1577381627,
			"body": "\n\nДецентрализованная дискреционная платформа patchwork\n\nScuttlebutt can be transformative for society, decentralizing and enabling local community development free of big corp. It is a fast growing decentralized social network. As an alternative to the large corporate social networks it enables autonomy for the users and a free zone from big data harvesting\n\nhttps://www.scuttlebutt.nz/\nhttps://ssbc.github.io/docs/scuttlebot/howto-setup-a-pub.html\nhttps://handbook.scuttlebutt.nz/guides/ssb-server/setup-a-pub\nhttps://github.com/staltz/easy-ssb-pub\n\nготовые пабы\nhttps://ssb.webcookies.pub/\nhttps://ssb-pub.picodevelopment.nl/\n\nhttps://git.scuttlebot.io/\n\n#ssb #Scuttlebutt #pub #pubserver #p2p #invite #invite #invites #install\n",
			"date_added": 1577381597,
			"meta": "{\"img\":\"900,475,eddeeedddcccccbcba853543654bbbaa9432789ccd211333,001001111021103043011115667891311A7B7CD1D11ABEFCD1\"}"
		},
		{
			"post_id": 1577381655,
			"body": "REDasm is an interactive, multiarchitecture disassembler written in modern C++11 using Qt5 as UI Framework.\nIts core is modular and it can be easily extended in order to support new file formats and instruction sets.\nYou can hack and improve REDasm without any issues and limitations.\n\nRuns on Windows and Linux.\n\nhttps://redasm.io/",
			"date_added": 1577381624
		},
		{
			"post_id": 1577381665,
			"body": "\n\nZoneMinder\n\nA full-featured, open source, state-of-the-art video surveillance software system.\n\nMonitor your home, office, or wherever you want. Using off the shelf hardware with any camera, you can design a system as large or as small as you need.\n\nhttps://zoneminder.com/\n\n#gpl #video #CCTV #Видеонаблюдение #сервер #ZoneMinder\n",
			"date_added": 1577381633
		},
		{
			"post_id": 1577433845,
			"body": "\n\nWhat is digiKam?\n\ndigiKam is an advanced open-source digital photo management application that runs on Linux, Windows, and MacOS. The application provides a comprehensive set of tools for importing, managing, editing, and sharing photos and raw files.\n\nhttps://www.digikam.org/download/\n\n#image #Photo #image #editor #photoeditor #фоторедактор #digiKam\n",
			"date_added": 1577433812,
			"meta": "{\"img\":\"900,241,555765556666888877532865445455777644533444,01100023304567080029A4BC9888D8\"}"
		},
		{
			"post_id": 1577433869,
			"body": "\n\nLibreELEC is a lightweight ‘Just enough OS’ Linux distribution purpose-built for Kodi on current and popular mediacentre hardware. We forked from the OpenELEC project in March 2016 when it became clear the original project could no longer operate effectively with one person in charge, and with that one person refusing to communicate or listen to other team members (untested changes in public releases was a frequent source of friction). Since forking our team has grown, but retains a strong focus on stable development. We also believe passionately in the long-term value of collaboration and upstreaming code instead of hoarding patches, and we participate actively with other Open Source projects and the ecosystem of regular and drive-by contributors that surround us. LibreELEC remains Kodi oriented but we too have been forked to provide the stable JeOS base for Plex Embedded, Lakka, and a number of single-purpose IoT and maker projects.\n\nhttps://libreelec.tv/downloads_new/\n\n#linux #libreelec\n",
			"date_added": 1577433835,
			"meta": "{\"img\":\"900,506,122333233133134234245355344455,000000000001212223100245567450314556748008222223900300000030\"}"
		},
		{
			"post_id": 1577434523,
			"body": "darktable is an open source photography workflow application and raw developer. A virtual lighttable and darkroom for photographers. It manages your digital negatives in a database, lets you view them through a zoomable lighttable and enables you to develop raw images and enhance them.\n\nhttps://www.darktable.org/",
			"date_added": 1577434488,
			"meta": "{\"img\":\"900,506,333443644733765555554544434886888689777564976685,0011111100012324567000849ABC70004DDDDE70014DD55410015FF4D510\"}"
		},
		{
			"post_id": 1577435833,
			"body": "\n\nKdenlive is an open source video editor. The project was started around 2003. Kdenlive is built on Qt and the KDE Frameworks libraries. Most of the video processing is done by the MLT Framework, which relies on many other open source projects like FFmpeg, frei0r, movit, ladspa, sox, etc…\n\nOur software was designed to answer most needs, from basic video editing to professional work.\n\nKdenlive is developed by a small team and new contributors are welcome.\n\nhttps://kdenlive.org/en/features/\n\n#video #videoeditor #editor #photoeditor #видеоредактор\n",
			"date_added": 1577435797,
			"meta": "{\"img\":\"900,506,344332233888345221211988322112645443865766554544,001222222034156555207421895910A01BCD89000182EE280000FAF22222\"}"
		},
		{
			"post_id": 1577436382,
			"body": "\n\nRawTherapee Screenshot\nPrevious\nNext\nAbout\n\nRawTherapee is a powerful, cross-platform raw photo processing system, released as Free Software (GPLv3). It is designed for developing raw files from a broad range of digital cameras and targeted at users ranging from enthusiast newcomers who wish to broaden their understanding of how digital imaging works to professional photographers.\n\nRawTherapee provides a powerful suite of tools for you to produce amazing photos and showcase your creativity.\n\nRawTherapee benefits users who take the time to learn what it can do. Luckily the community is quite welcoming and helpful! Check out the Forum, read up on RawPedia, and ask questions - there’s always something neat to learn! :)\n\nhttp://rawtherapee.com/\n\n#image #Photo #image #editor #photoeditor #фоторедактор #rawtherapee\n",
			"date_added": 1577436345,
			"meta": "{\"img\":\"900,506,333642653444550760a60950546c51764c80c62c71831,0011222113144456672825556699AA0455799BA80266CD66100167C67E10\"}"
		},
		{
			"post_id": 1577460936,
			"body": "\n\nProxmox Virtual Environment is an open source server virtualization management solution based on QEMU/KVM and LXC. You can manage virtual machines, containers, highly available clusters, storage and networks with an integrated, easy-to-use web interface or via CLI. Proxmox VE code is licensed under the GNU Affero General Public License, version 3. The project is developed and maintained by\n\nhttps://pve.proxmox.com/\n\n#Proxmox #virtual #virtualization #виртуализация\n",
			"date_added": 1577460898,
			"meta": "{\"img\":\"900,506,cccdddeeeddefffefe,012222222342224244444244444222424544444422424444442222444422\"}"
		},
		{
			"post_id": 1577461532,
			"body": "\n\nСоздавайте, проигрывайте и распечатывайте прекрасные музыкальные произведения\nСамый популярный в мире нотный редактор\n\nYou can even use a MIDI keyboard as input and simply play the tune you want to create the notation of.\n\nIn order to make use of it, you need to know how sheet music notations work. In either case, you can just play something using your MIDI keyboard or any other instrument and learn how the music notations work while using it.\n\nSo, it should come in handy for beginners and experts as well.\n\nYou can download and use Musescore for free. However, if you want to share your music/composition and reach out to a wider community on the Musescore platform, you can opt to create a free or premium account on Musescore.com.\n\nhttps://musescore.org/\n\n#Proxmox #virtual #virtualization #виртуализация\n",
			"date_added": 1577461493
		},
		{
			"post_id": 1577477710,
			"body": "The coreboot project is proud to announce to have released coreboot 4.11.\n\nThis release cycle was a bit shorter to get closer to our regular schedule of releasing in spring and autumn.\n\nSince 4.10 there were 1630 new commits by over 130 developers. Of these, about 30 contributed to coreboot for the first time.\n\nThank you to all contributors who made 4.11 what it is and welcome to the project to all new contributors!\n\nhttp://www.tuxmachines.org/node/130699\n\n#coreboot #bios #motherboard",
			"date_added": 1577477670
		},
		{
			"post_id": 1577478467,
			"body": "\n\nDrawpile is a Free software collaborative drawing program that allows multiple users to sketch on the same canvas simultaneously.\n\nhttps://drawpile.net/\n\n#Drawpile\n\n\nDrawpile is a Free software collaborative drawing program that allows multiple users to sketch on the same canvas simultaneously.\n\nhttps://drawpile.net/\n\n#Drawpile\n",
			"date_added": 1577478426,
			"meta": "{\"img\":\"730,700,cccddd888fff666777aaa788c98ba7333222555bbb566,0000111111223333111145333131114533101111453330611145333333335713331892ABBBC012DDABBBC031114EEE701111\"}"
		},
		{
			"post_id": 1577513117,
			"body": "\n\nKDevelop A cross-platform IDE for C, C++, Python, QML/JavaScript and PHP\n\nhttps://www.kdevelop.org/\n\n#KDevelop #IDE #C #C++ #development #Entwicklung #Python\n",
			"date_added": 1577513075,
			"meta": "{\"img\":\"900,590,abbbbbdddeeecccfff,0000110000233233333243223333522323323553223332222322333223332222233333\"}"
		},
		{
			"post_id": 1577513143,
			"body": "#IDE  #WingPython #development #Entwicklung #python \n\nhttps://wingware.com/",
			"date_added": 1577513100,
			"meta": "{\"img\":\"900,664,556555455334333233344323445234345,001122212234445546556633455245344477386666664446866464449A656445555995\"}"
		},
		{
			"post_id": 1577515670,
			"body": "Twister linux Децентрализованный P2P аналог Twittera\n\nhttps://www.youtube.com/watch?v=vQpD1ellAgo\n\n#twister  #p2p",
			"date_added": 1577515626
		},
		{
			"post_id": 1577518409,
			"body": "Tux Machines is a community-driven public service/news site which has been around for over a decade and a half and primarily focuses on GNU/Linux http://www.tuxmachines.org/",
			"date_added": 1577518364
		},
		{
			"post_id": 1577557575,
			"body": "The-Federation.info\n\nTracking various projects using the ActivityPub, Matrix, Diaspora, OStatus and other protocols.\n\nSite found at: https://the-federation.info\n\nhttps://github.com/thefederationinfo/the-federation.info",
			"date_added": 1577557529
		},
		{
			"post_id": 1577564374,
			"body": "\n\npostmarketOS\n\nAbout\nWe are sick of not receiving updates shortly after buying new phones. Sick of the walled gardens deeply integrated into Android and iOS. That’s why we are developing a sustainable, privacy and security focused free software mobile OS that is modeled after traditional Linux distributions. With privilege separation in mind. Let’s keep our devices useful and safe until they physically break!\n\nhttps://postmarketos.org/\n\nhttps://gitlab.com/postmarketOS\n\n#postmarketOS #linux\n",
			"date_added": 1577564327,
			"meta": "{\"img\":\"394,700,500622899887610765bcca99400344577300401876511,000000000000000000001234005674809A54BCD210BB8E00BBB800BBBB80\"}"
		},
		{
			"post_id": 1577614717,
			"body": "Social networking, back in your hands\n\nFollow friends and discover new ones among more than 2.2M people. Publish anything you want: links, pictures, text, video. All on a platform that is community-owned and ad-free. \n\nhttps://github.com/tootsuite/mastodon\n\nhttps://joinmastodon.org/",
			"date_added": 1577614669
		},
		{
			"post_id": 1578069623,
			"body": "",
			"date_added": 1578069574,
			"meta": "{\"img\":\"793,700,fffffedecefddfbefcceacebdebbeaefbded,010000000002300010000330004541033113446103678994500366696A10054433441018143353401101B30031\"}"
		},
		{
			"post_id": 1578069630,
			"body": "",
			"date_added": 1578069580,
			"meta": "{\"img\":\"900,421,ab9898886775bcbbb9db8a96a98ba6986655c98b76433455,0001023456728109A1879A87893B26CC5D897E365445CD2F16\"}"
		},
		{
			"post_id": 1578069636,
			"body": "",
			"date_added": 1578069585,
			"meta": "{\"img\":\"900,675,aab776665a99abdbcecdea77964778b85c95654234322000,001223045603781993307AAB722CDCCCC88CC2EF22C2C2C2DF2112CDCCCFDC2CDDC2CEDDDDDDDCCD\"}"
		},
		{
			"post_id": 1578093006,
			"body": "Peek - an animated GIF recorder\n\nPeek makes it easy to create short screencasts of a screen area. It was built for the specific use case of recording screen areas, e.g. for easily showing UI features of your own apps or for showing a bug in bug reports. With Peek, you simply place the Peek window over the area you want to record and press “Record”. Peek is optimized for generating animated GIFs, but you can also directly record to WebM or MP4 if you prefer.\n\nPeek is not a general purpose screencast app with extended features but rather focuses on the single task of creating small, silent screencasts of an area of the screen for creating GIF animations or silent WebM or MP4 videos.\n\nPeek runs on X11 or inside a GNOME Shell Wayland session using XWayland. Support for more Wayland desktops might be added in the future (see FAQs below).\n\nhttps://github.com/phw/peek\n\nhttps://github.com/phw/peek/releases/tag/1.3.1",
			"date_added": 1578092954,
			"meta": "{\"img\":\"900,506,99a55657889accd889899bcdcdeeeefffeefbdd,0111221113405555556789AAAAAAB88BAAAAAAA889AAAAAAB8444CCCCCCC\"}"
		},
		{
			"post_id": 1578294584,
			"body": "retroshare chat server\n\nhttps://retroshare.ch/",
			"date_added": 1578294530
		},
		{
			"post_id": 1578335413,
			"body": "",
			"date_added": 1578335358,
			"meta": "{\"img\":\"900,563,865987777875998aa9754544787cbbb88c86b75422222743,00123132454141223322607631331859448376AB54448806BCDE0524470F\"}"
		},
		{
			"post_id": 1578335454,
			"body": "",
			"date_added": 1578335398,
			"meta": "{\"img\":\"466,700,48c6adec58bbccc796aa8cde642b76fff655333876012a44,0100122111132243531343356337889477786AAB8CBCDDBB8BE8BBB8BCBBBB8FFFBBBF\"}"
		},
		{
			"post_id": 1578505172,
			"body": "\nYggdrasil is an early-stage implementation of a fully end-to-end encrypted IPv6 network. It is lightweight, self-arranging, supported on multiple platforms and allows pretty much any IPv6-capable application to communicate securely with other Yggdrasil nodes. Yggdrasil does not require you to have IPv6 Internet connectivity - it also works over IPv4.\n\nAlthough Yggdrasil shares many similarities with cjdns, it employs a different routing algorithm based on a globally-agreed spanning tree and greedy routing in a metric space, and aims to implement some novel local backpressure routing techniques. In theory, Yggdrasil should scale well on networks with internet-like topologies. Take a look at the About page for a detailed overview.\n\n\nEnd-to-end encryption for all traffic across the network \tNo \tYes\nDecentralised routing information shared using a DHT \tNo \tYes\nCryptographically-bound IPv6 addresses \tNo \tYes\nNode is aware of its relative location to other nodes \tNo \tYes\nIPv6 address remains with the device even if moved \tNo \tYes\nTopology extends gracefully across different mediums, i.e. mesh \tNo \tYes\n\nhttps://yggdrasil-network.github.io/\n\n#p2p #dht #linux ",
			"date_added": 1578505115
		},
		{
			"post_id": 1579970734,
			"body": "\n\nShelter - Isolate your Big Brother Apps / Multiple Accounts\n\nShelter is a Free and Open-Source (FOSS) app that leverages the “Work Profile” feature of Android to provide an isolated space that you can install or clone apps into.\n\nShelter comes with absolutely no advertisement / statistics / tracking SDKs bundled with it. All source code is available in this public Git repository and the sources are licensed under WTFPL.\n\nThis app depends on your Android system’s implementation of Work Profile. Some vendor / custom ROMs may have a broken implementation that may cause crashes and even bricking of your device. One such example is MIUI from Xiaomi. I currently provide no support for such ROMs because I personally do not own any of these devices. If you are running Shelter on these ROMs, you are on your own. If any developer out there own these devices and could make Shelter run on these ROMs, please send pull requests and I’ll be happy to merge them.\n\nhttps://github.com/PeterCxy/Shelter\n\n#песочница #FOSS #android #sandbox\n",
			"date_added": 1579970676
		},
		{
			"post_id": 1580540309,
			"body": "My blog zeronet http://127.0.0.1:43110/1Mv6N3tZD8txahjwRCKXWe5U86wWYzfnLB/",
			"date_added": 1580540250
		},
		{
			"post_id": 1580540682,
			"body": "Etcher is a powerful OS image flasher built with web technologies to ensure flashing an SDCard or USB drive is a pleasant and safe experience. It protects you from accidentally writing to your hard-drives, ensures every byte of data was written correctly and much more. It can also flash directly Raspberry Pi devices that support the usbboot protocol\n\nSupported Operating Systems\n\n    Linux (most distros)\n    macOS 10.10 (Yosemite) and later\n    Microsoft Windows 7 and later\n\nhttps://github.com/balena-io/etcher/releases",
			"date_added": 1580540622
		},
		{
			"post_id": 1580541359,
			"body": "Электролитические конденсаторы: качество\nПроизводители хороших и качественных конденсаторов:\nSanyo\nRubycon\nNippon Chemi-Con\nNichicon\nFujitsu\nEPCOS\nCapXon\nJamicon\nMatsushita (Panasonic)\nHitachi\nHITANO\nELNA\nVishay\nSAMWHA\n\nСереднячки\nTeapo\nOST\n\nCapson\n\n\"Черный список\" производителей конденсаторов\nD.S (VENT)\nChhsi (HK(M), WG(M))\nG-LUXON (SM)\nGSC\nFuhjyyu\nHEC\nJackcon\nJee\nLi-con (Licon)\nJenpo\nJPCON\nJODEN\nRulycon\nRubysun\nTayeh\nLelon\nLtec\nE.V.A.TOP\nJunFu (WG, HK)\nFULLTEC\nKYS\nSOWA\nSu'scon\nKSC\nEASICON\nGjt\nElite\nTREC\nSC или CS (непонятно, логотип только)\nGLORIA (GAE)\nMK (M)P8\nSamxon\n",
			"date_added": 1580541298
		},
		{
			"post_id": 1580541416,
			"body": "Как правильно выбрать смартфон\n\nКаждый, кто покупал смартфон за границей, мог столкнуться с тем, что новенький и полностью работоспособный гаджет почему-то отказывается функционировать в российских сетях 4G. Проблема в том, что сети четвёртого поколения строятся в самых разных частотных диапазонах. А девайсы, как правило, выпускают под тот или иной набор этих диапазонов, а не под любые возможные диапазоны и их комбинации. Чтобы не пожалеть о покупке, нужно разбираться в некоторых технологических деталях, и мы попробуем вам в этом помочь.\n\nГоворя о правильном выборе смартфона, в этот раз мы не имеем в виду платформу, на которой он собран, особенности операционной системы или камеру. Сосредоточимся на параметрах, обеспечивающих наилучшую работу вашего аппарата в сетях 4G/LTE. Это особенно важно для всех, кто активно пользуется мобильным Интернетом. Пользовательский опыт в сети LTE обычно заметно отличается от пользовательского опыта в сети 3G, даже в варианте HSPA+. Проще говоря, если вы в зоне уверенного покрытия LTE, а гаджет поддерживает современные режимы передачи данных, у вас, что называется, «всё летает». А вот о том, какие характеристики смартфона важны для достижения максимальной скорости — читайте в статье.\nЧастоты LTE: что это за бэнды и почему они важны\n\nПочему вообще нужно чем-то заморачиваться, ведь мы же не выбираем смартфоны по особенностям их работы с 3G? Всё просто. Для технологий 3G/WCDMA в мире закреплена полоса частот в диапазоне 2100 МГц. Поскольку этих частот не хватает, кое-где для 3G применяется также диапазон 900 МГц. В большинстве случаев любой современный аппарат поддерживает работу в 3G в обоих этих диапазонах. «Чистый» 3G сейчас нигде не используется, поэтому смартфон должен также понимать такие «расширения» технологии, как HSPA и HSPA+, ускоряющие работу с мобильным Интернетом. Чаще всего новые девайсы поддерживают и эти технологии.\n\nИное дело с LTE. Данный стандарт изначально подразумевал возможность построения сетей связи и мобильного Интернета в самых разных частотных диапазонах. В мире их используется больше десятка, причём в разных странах — разные комбинации частот. Ещё и не каждый оператор поддерживает одинаковый набор диапазонов даже в пределах одной страны. В России набор используемых частотных диапазонов LTE не так уж велик. Тем не менее, покупая смартфон за границей (например, в интернет-магазине), можно остаться без 4G из-за несовместимости приобретённого аппарата с той или иной нашей сетью.\n\nЧтобы такого не произошло, желательно выбирать гаджет, исходя из того, какие частоты LTE поддерживает оператор в вашем регионе. Ситуация со временем меняется, операторы обзаводятся всё новыми частотами, поэтому задумываться о совместимости следует каждый раз, когда вы покупаете новый девайс.\n\nНа сегодня в России операторы «большой четвёрки» располагают сетями LTE в следующих основных диапазонах: 1800 МГц (b3), 2,5-2,7 ГГц (b7), 800 МГц (b20). Буква b c числом, приведённые в скобках — это «бэнд», название диапазона по классификации международной группы 3GPP, занимающейся разработкой стандартов LTE. Перечисленные диапазоны применяются для организации сетей FDD LTE с так называемым частотным разделением каналов, когда входящий и исходящий потоки данных идут на разных частотах. Есть также технология TDD с временным разделением каналов: когда входящий и исходящий потоки данных поочередно гоняются между аппаратом и сетью с использованием одной и той же полосы частот. В России эта технология также используется. Задействованный под неё диапазон — 2,5-2,6 ГГц (b38).\n\nРезюме: какие частоты нужны в России. В идеале ваш смартфон должен в обязательном порядке поддерживать диапазоны b3 и b7 — это основа хорошего мобильного Интернета. Желателен диапазон b20: есть места, где он — единственная возможность получить доступ к LTE. Что касается b38, то его можно сравнить с вишенкой на торте — жить без неё можно, но как украшение не помешает. Сотовые сети во всем мире постояно развиваются базовые станции постоянно меняются меняются и частотные каналы чем больше каналов поддерживает ваш телефон тем лучше быстрее интернет надедежнее связь разница в каналах на сегодняшний день огромная смотрите на скриншотах\n\n1.PNG (1170x656)2.PNG (1163x586)3.PNG (1172x500)\nШирина полос: чем шире, тем качественнее и быстрее\n\nЕщё одно важное правило: чем шире частотная полоса, которая есть у оператора в том или ином диапазоне, тем на более качественную услугу можно рассчитывать. То есть в сети с полосой 5 МГц средние скорости чаще всего меньше, чем в сети с полосой 20 МГц. Это зависит также от числа пользователей — чем их больше, тем средние скорости меньше. Есть зависимость даже от тарифных планов — если они включают большие пакеты трафика в месяц, то средняя скорость опять же может оказаться меньшей, чем в пустой сети с узкой полосой. В регионах ситуация с частотами нередко разнится даже у одного и того же оператора (особенно это касается диапазона 1800 МГц).\nШирина частотных полос у операторов",
			"date_added": 1580541354
		},
		{
			"post_id": 1580541520,
			"body": "Борная кислота от тараканов - отличный способ избавиться от вредителя\n\nИз всех известных человеку насекомых тараканы являются самыми надоедливыми. Борьба с ними настолько же утомительна, как и истребление муравьев на садовом участке. Несмотря на всю примитивность этих существ, они обладают удивительными способностями к сохранению рода.\n\nНатолкнувшись на ядовитую ловушку, тараканы успевают предупредить своих собратьев об опасности, что затрудняет качественную зачистку помещения. К тому же, вредители активно мигрируют, поэтому полностью исключить \"встречу\" с ними не получается.\n\nСуществует много средств, позволяющих истребить усатых гостей, но борная кислота от тараканов считается самой эффективной. Обыкновенный аптечный антисептик уничтожающе действует на многих вредителей и на тараканов, в том числе.\n\nЧто собой представляет борная кислота?\n\nBornaya-kislota-ot-tarakanov-2.jpg (700x484)\n\nЭто белый порошок с чешуеобразными крупинками. У него нет ни запаха, ни вкуса. При высокой температуре вещество плавится и испаряется, меняясь в химическом составе.\n\nДобывают порошок из минералов, образующихся в Средиземном море. Борная кислота против тараканов используется и в виде спиртового раствора, однако от нее вдвое меньше эффекта, чем от порошка.\n\nЗапах спирта отталкивает вредителей, поэтому отравление не происходит.\n\nЯвляясь сильным ядом для насекомых, борный порошок практически безвреден для человека и животных, но нельзя, чтобы он попадал в пищевод или дыхательные пути.\n\nБорсодержащие препараты начали использовать еще с середины прошлого столетия. Нет точных подтверждений, что эти средства на 100 % уничтожают тараканов, их эффективность определялась народным опытом. \n\nДействие борной кислоты на тараканов\n\nДанное средство характеризуется медленным действием. В отличие от нейротоксинных приманок, отрава от тараканов с борной кислотой приводит к гибели лишь через неделю или даже две. Многие считают это минусом, но за длительный инкубационный период вредители успевают заразить значительно большее количество своих сородичей\n\nБорная кислота разрушает пищеварительную систему насекомых и парализует их. Она не вызывает привыкания, поэтому при повторных набегах прусаков будет оставаться эффективной.\n\nНа сегодняшний день народные средства от тараканов с борной кислотой активно используются в жилых домах. Они результативны и экономичны, так как одного пакетика порошка хватает для уничтожения многотысячной популяции вредителей.\nОсобенности применения\n\nСуществуют два основных правила безопасности:\n\n    нельзя чтобы борный порошок или раствор попадал на кожу;\n    необходимо расставлять приманки в таких местах, где их не достанут домашние питомцы.\n\nПрепарат следует оставлять в местах скопления тараканов или на их пути. Лучше всего делать дорожки из борного порошка возле умывальников и других местах с повышенной влажностью. Очень важно исключить доступы к воде, иначе успешной борьбы не получится.\n\nДостаточно эффективный способ - насухо вытирать все влажные поверхности и оставлять только одну емкость с водой, содержащей борную кислоту.\n\nПрежде чем приготовить средство от тараканов с борной кислотой, полезно понаблюдать, где именно обитают вредители, чтобы перестраховаться наверняка. Просто нужно несколько раз зайти на кухню вечером и, включив свет, внимательно следить, куда разбегаются усатые гости. В тех местах и следует сыпать борную кислоту или расставлять приманки.\n\nПри небольшом количестве тараканов такие действия дадут результаты. Зараженные особи погибнут, а выжившие покинут опасное для них место обитания.Если прусаки слишком сильно наводнили жилье, одними дорожками борного порошка не обойтись.\n\nЧтобы была более эффективнаяборьба с тараканами борной кислотой, рецепт отравленной приманки нужно готовить дополнительно.\n\nкупить можно в любой аптеке стоит от 20 до 70 рублей",
			"date_added": 1580541457
		},
		{
			"post_id": 1580541618,
			"body": "Фипронил – это инсектицид широкого спектра действия. Его используют для уничтожения муравьев, жуков, тараканов, моли, саранчи, термитов и других насекомых, а также их личинок. Он входит в состав инсектицидов, используемых в сельском хозяйстве, а также ветеринарных препаратов для уничтожения насекомых, паразитирующих на домашних животных и птице. Его запрещено применять для продуктивных животных.\n\nХимически фипронил относится к фенилпиразоловым пестицидам – одним из наиболее широко применяемых пестицидов, наряду с неоникотиноидами. Механизм действия этих веществ основан на блокировке рецепторов ГАМКА и глутамат-зависимых хлорных каналов. Последние присутствуют у насекомых, но отсутствуют у млекопитающих, в том числе, у человека. Поэтому вещество, вызывающее у насекомых сильную стимуляцию нервной системы, что приводит к их гибели, относительно безопасно для млекопитающих. Однако сульфон фипронила – его метаболит – обладает заметно большим сродством к хлорным каналом млекопитающих и может вызывать отравления.\n\nПри отравлении фипронилом наблюдаются потливость, тошнота, рвота, головокружения и головные боли, боли в животе, нервное возбуждение, в тяжелых случаях – судороги. Это результат его нейротоксичности. Для крыс ЛД50 фипронила составляет 97 мг/кг массы тела при поступлении с пищей и более 2000 мг/кг массы тела при контакте с кожей. При хроническом отравлении этим веществом также наблюдаются судороги. У крыс при хроническом отравлении фипронилом отмечали снижение уровней гормонов щитовидной железы. При длительном хроническом воздействии это вещество вызывало у крыс онкологические заболевания щитовидной железы. Поэтому в США фипронил классифицируется как канцероген группы C (предположительно, канцерогенен для человека).\n\nФипронил является экотоксикантом. Он опасен для водных беспозвоночных, ракообразных, многих видов рыбы, а также для кроликов, некоторых ящериц и курообразных. Это вещество – одна из причин гибели пчел и синдрома разрушения пчелиных колоний – одновременного покидания улья семьей пчел. В природе фипронил разрушается преимущественно под действием солнечного света. В глубине почвы период его полураспада составляет от 4 месяцев до года.\n\nДо 2017 года в Евросоюзе не проверяли содержание фипронила в пищевой продукции, поскольку предполагалось, что фипронил не может попадать в мясо и другую продукцию животного происхождения. Однако в июле 2017 года выяснилось, что одна из голландских компаний использует это вещество для уничтожения насекомых у кур-несушек и для обработки курятников. Анализ яиц показал, что в них присутствует фипронил, причем это выяснилось в Бельгии. Вскоре сообщения о фипрониле в голландском яйце начали поступать из Германии. Мониторинг международной торговли яйцом и яичным порошком продемонстрировал, что фипронил используют на фермах Италии, Восточной Европы, Южной Кореи, Тайваня. Поскольку яичный порошок используют для промышленного производства макаронных изделий и выпечки, фипронил попал и в эту продукцию. Кроме того, были сообщения о присутствии фипронила в курятине.\n\nСтоль масштабная контаминация пищевой продукции требовала соответствующих мер. В Нидерландах многие фермы закрылись на проверку либо размещали на упаковках яиц предупреждения о возможности содержания в них фипронила. В Великобритании сняли с продаж продукцию, в которой присутствовало голландское яйцо и яичный порошок. Для этого проследили партии по кодам и определили степень риска контаминации. В Германии сняли с продаж яйца, но не сняли продукцию, содержащую их. В результате, в течение следующих двух месяцев фиксировали сообщения о присутствии фипронила в продуктах питания. В Польше проверки показали, что на некоторых местных фермах, как и в Италии, фипронил применяют для обработки курятников. В этой стране присутствие фипронила в курином яйце фиксировали до декабря 2017 года. Отзывы продукции, мониторинг и проведение проверок нанесли существенный финансовый и репутационный ущерб компаниям, производящим и перерабатывающим куриное яйцо. Всего было затронуто 15 стран Евросоюза, Швейцария, а также Южная Корея и Китай.\n\nКонтаминация фипронилом куриных яиц показала, что способность химических веществ проникать в продукты питания не всегда оценивают верно. Кроме того, если нарушение закона выгодно производителям, одним-двумя случаями оно не ограничится. В\n\nВ Российской Федерации и странах Таможенного Союза фипронил, согласно «Единым санитарно-эпидемиологическим и гигиеническим требованиям к товарам, подлежащих санитарно-эпидемиологическому надзору (контролю)», необходимо контролировать в картофеле и зерне хлебных злаков. Его содержание в этих продуктах не должно превышать 0,005 мг/кг. Такие же нормы установлены в ТР ТС 015/2011 «О безопасности зерна». При этом пестициды, содержащие фипронил, допускается использовать для обработки сельскохозяйственных культур: пшеницы, ячменя и картофеля. В странах Евросоюза фипронил также допускается использовать для обработки растений и как ветеринарный препарат для домашних животных.\n\nВ пищевом сырье и продукции фипронил выявляют хроматографическими методами. Компания СТАЙЛАБ предлагает стандарты фипронила и его метаболита – сульфона фипронила для его количественного анализа. Стандарты фипронила изготавливаются в соответствии с ISO 17034:2016 (аккредитация A2LA). Система контроля качества соответствует ISO 9001:2015 (аккредитация DQS). Их стабильность и точность концентрации гарантируется производителем.\n\nПестицидное средство Фипронил обладает мощным эффектом против вредных и синантропных насекомых, включая тараканов. Средств может использоваться не только в квартирных условиях, но и в сельском хозяйстве, для проведения медицинской или санитарной дезинсекции.\nЧто такое Фипронил: общее описание\n\nФипронил является активные инсектицидным веществом, использующимся для ликвидации вредных насекомых в жилых помещениях. Инсектицидные и акарицидные свойства препарата обусловлены наличием в его составе хлора и фтора (ядовитых галогенов).\n\nПомимо дезинсекции в жилых помещениях Фипронил можно использовать для уничтожения паразитов в медицинских учреждениях, а также для борьбы с сельскохозяйственными вредителями.\n\nФипронил выпускается в двух формах: в виде гранул и эмульсии. В чистом виде препарат не используется. Допускается применение препарата с другими инсектицидными средствами в виде гелей, спреев или приманок (ловушек).\n\nФипронил – это яд с замедленным действием, заражающий тараканов не только при поедании средства, но и при контакте с ним. Паразитам достаточно провести усиками или лапками по препарату и их организм будет отравлен.\nКак Фипронил воздействует на тараканов?\n\nФипронил оказывает нервнопаралитическое действие, провоцируя спазм, а затем и паралич мышц насекомого. Вскоре после этого наступает гибель паразита. При правильном использовании препарата полное уничтожение всей популяции тараканов происходит через 2-3 суток.\n\nПосле заражения насекомого оно не сразу испытывает симптомы отравление, проходит несколько часов (обычно до 8) относительного благополучия. За это время паразит неминуемо контактирует со своей популяцией заражая других насекомых.\n\nПередача яда в популяции происходит даже после гибели первоначальных носителей (тех, что заразились первыми). Этому способствует поедание здоровыми тараканами трупов своих отравленных сородичей, в итоге отрава быстро распространяется по колонии.\n\nВсего остаточное действие яда сохраняется в течение 30-35 дней. Помимо тараканов погибают и другие вредные насекомые, которые могут контактировать с препаратом, фекалиями или трупами тараканов (прежде всего это домашние муравьи).\n\nВозможно наличие резистентности у отдельных особей паразитов к действию яда, поэтому производитель гарантирует гибель только 95% от всей популяции в течение 3 дней. Но в большинстве случаев колония вымирает полностью.\nКак вещество воздействует на человека?\n\nФипронил является ядом не только для насекомых, но и для людей или домашних питомцев. Последствия контакта с ним могут быть разными:\n\n    Повышенная раздражительность, тремор.\n    Спазмы мышц, конвульсии.\n    Летаргия.\n    Раздражение кожных покровов.\n    Кашель, обострение бронхиальной астмы (при попадании средства в легкие).\n\nСимптомы отравления проходят самостоятельно после прекращения действия средства. Фипронил относится к третьему классу опасности для людей. Средство очень опасно для пчел (первый и третий класс опасности).\n",
			"date_added": 1580541554
		},
		{
			"post_id": 1580569049,
			"body": "ZeroNet Py3 updater\n\nhttp://127.0.0.1:43110/1uPDaT3uSyWAPdCv1WkMb5hBQjWSNNACf/",
			"date_added": 1580568984
		},
		{
			"post_id": 1580593936,
			"body": "test",
			"date_added": 1580593869
		},
		{
			"post_id": 1581178962,
			"body": "test",
			"date_added": 1581178894
		},
		{
			"post_id": 1584610686,
			"body": "ZeroMeHubList\n\nhttp://127.0.0.1:43110/1HNf26SK9Hi9LES1kUKg6r36hDwhBdNBKM\n\nhttp://127.0.0.1:43110/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/\tKaffieHub\nhttp://127.0.0.1:43110/1NFiNiTYxiKn5PJo9eDEsiusJJUFkew5Vo/\t1nfinity Hub\nhttp://127.0.0.1:43110/18FheQ1v3bz4iv5yx8hr9hg5W5BJ8WNJ8d/\tYellow Hub\nhttp://127.0.0.1:43110/12rTbtzcEZH7RiVfShBB3qhoe3rfwbpm8S/\tBitcoin hub\nhttp://127.0.0.1:43110/15mV5T1R1wxg3E1FPsvZw19bw6QzvRREfn/\tHub Español\nhttp://127.0.0.1:43110/1GnSLuqqmB8oRAJ4SK4hvzt6Jo1qAnEbXn/\tYellowHub\nhttp://127.0.0.1:43110/185yXNL48LTZyKfNo6WgyKshtMgcV3mecL/\tIcf20's Hub\nhttp://127.0.0.1:43110/16bNGdxFkGWGnCEfVue3w4CSp3Ew2hcyBB/\tTrump 2016 hub\nhttp://127.0.0.1:43110/1CiGGh6RrTtaTJfutVKUrfURsP5J4stJDk/\tAnarcho Capitalism hub\nhttp://127.0.0.1:43110/1D7xb8vwnWUYSXziENcnoi3meD5Gk2xgFj/\tTrue red hub\nhttp://127.0.0.1:43110/1Gb25pK7XqrgnBYjhHLGBjEYURg2MhbJCq/\tLime hub\nhttp://127.0.0.1:43110/1ARSTRDgMSH2E81pcZCbaEq28TZ72Levxh/\tOrangeIsTheNewBlack Hub\nhttp://127.0.0.1:43110/1JUDmCT4UCSdnPsJAHBoXNkDS61Y31Ue52/\tBot hub\nhttp://127.0.0.1:43110/1MATTnuthfsvTUqEwtvTR6nMiLmtqGXyfv/\tReligion hub\nhttp://127.0.0.1:43110/1AbRRDveQD5EFtmXxBqQfS1guUWXxytMJZ/\tTorrents hub\nhttp://127.0.0.1:43110/12cm58PYhaSaHUkKgsbf62Rg9Db5DukWYd/\tIpfs hub\nhttp://127.0.0.1:43110/1LQeBa8AgXPd9YXyfTGm9FbcJZTM4p1vgY/\tGreat Dane Hub",
			"date_added": 1584610617
		},
		{
			"post_id": 1592928725,
			"body": "\n\nVirtual machine hypervisor\nWhat is QEMU?\nQEMU is a generic and open source machine emulator and virtualizer.\n\nhttps://www.qemu.org/\n\n#Virtualization #Fullsystememulation #qemu #hypervisor\n",
			"date_added": 1592928655
		},
		{
			"post_id": 1592986603,
			"body": "fediverse network\n\nhttps://the-federation.info/\n\nhttps://fediverse.network/\n\nhttps://github.com/thefederationinfo/the-federation.info\n\n#fediverse #p2p #matrix #Diaspora #Mastodon #serverlist #foss",
			"date_added": 1592986532
		},
		{
			"post_id": 1593186186,
			"body": "\n\nCanvasBlocker\n\nThis add-on allows users to prevent websites from using some Javascript APIs to fingerprint them. Users can choose to block the APIs entirely on some or all websites (which may break some websites) or just block or fake its fingerprinting-friendly readout API.\n\nhttps://github.com/kkapsner/CanvasBlocker\nhttps://addons.mozilla.org/ru/firefox/addon/canvasblocker/\n\n#fingerprint #browser #firefox\n",
			"date_added": 1593186114
		},
		{
			"post_id": 1593186207,
			"body": "\n\nDecentralize!\nДецентрализованные и распределенные сети. Безопасные средства коммуникации. Шифрование.\n\nhttps://vk.com/dcntr\n\n#vk\n",
			"date_added": 1593186134
		},
		{
			"post_id": 1593186229,
			"body": "\n\n#exif #compression\n\nCaesiumPH\nLossless JPEG compression for photographers and webmasters.\n\nhttps://saerasoft.com/caesium/ph/\n",
			"date_added": 1593186155
		},
		{
			"post_id": 1593186242,
			"body": "\n\nQuiteRSS is a open-source cross-platform RSS/Atom news feeds reader\n\nhttps://quiterss.org/\n\n#RSS #Atom\n",
			"date_added": 1593186167
		},
		{
			"post_id": 1593253601,
			"body": "\n\nThis page uses different techniques to recognize whether a browser extension is installed to spoof the canvas fingerprint result or not. Sometimes to protect browser identity, a browser extension adds random noise to the canvas and this noise alters the fingerprint result (hash code). Although the actual identity might be protected, there are still methods to detect\n\nhttps://webbrowsertools.com/canvas-fingerprint/\n\nhttps://addons.mozilla.org/ru/firefox/addon/canvasblocker/?src=search\n\n#canvas #fingerprint #Firefox\n",
			"date_added": 1593253525,
			"meta": "{\"img\":\"900,362,eeeddd,0000000000000000000010000000001000000000\"}"
		},
		{
			"post_id": 1593257471,
			"body": "\n\nThis tool allows you to record a selected area of your screen, live feed from your webcam or live drawings from a sketchboard. Afterwards, you can edit and save the animation as a gif, apng, video, psd or png images.\n\nhttps://github.com/NickeManarin/ScreenToGif/releases/\n\n#gif #gifwindows #opensource\n",
			"date_added": 1593257394
		},
		{
			"post_id": 1595595167,
			"body": "the fastest frame-accurate media cutter + joiner\n\nA modern, simple to use, constantly evolving and hella fast MEDIA CUTTER + JOINER w/ frame-accurate SmartCut technology + Qt5, libmpv, FFmpeg and MediaInfo powering the backend.\n\nhttps://snapcraft.io/vidcutter\n\nhttps://github.com/ozmartian/vidcutter\n\nhttps://github.com/ozmartian/vidcutter/releases",
			"date_added": 1595595089
		},
		{
			"post_id": 1597029577,
			"body": "China is now blocking all encrypted HTTPS traffic that uses TLS 1.3 and ESNI\n\nThe block was put in place at the end of July and is enforced via China’s Great Firewall.\n\nThe Chinese government has deployed an update to its national censorship tool, known as the Great Firewall (GFW), to block encrypted HTTPS connections that are being set up using modern, interception-proof protocols and technologies.\n\nThe ban has been in place for at least a week, since the end of July, according to a joint report published this week by three organizations tracking Chinese censorship – iYouPort, the University of Maryland, and the Great Firewall Report.\nChina now blocking HTTPS+TLS1.3+ESNI\n\nThrough the new GFW update, Chinese officials are only targeting HTTPS traffic that is being set up with new technologies like TLS 1.3 and ESNI (Encrypted Server Name Indication).\n\nOther HTTPS traffic is still allowed through the Great Firewall, if it uses older versions of the same protocols – such as TLS 1.1 or 1.2, or SNI (Server Name Indication).\n\nFor HTTPS connections set up via these older protocols, Chinese censors can infer to what domain a user is trying to connect. This is done by looking at the (plaintext) SNI field in the early stages of an HTTPS connections.\n\nIn HTTPS connections set up via the newer TLS 1.3, the SNI field can be hidden via ESNI, the encrypted version of the old SNI. As TLS 1.3 usage continues to grow around the web, HTTPS traffic where TLS 1.3 and ESNI is used is now giving Chinese sensors headaches, as they’re now finding it harder to filter HTTPS traffic and control what content the Chinese population can access.\n\nPer the findings of the joint report, the Chinese government is currently dropping all HTTPS traffic where TLS 1.3 and ESNI are used, and temporarily banning the IP addresses involved in the connection, for small intervals of time that can vary between two and three minutes.\nSome circumvention methods exist… for now\nStay fully connected with Wi-Fi 6 Campus\nHuawei has a full array of Wi-Fi solutions that ensure comprehensive coverage under different campus scenarios so enterprises can stay ahead of the trend.\nSponsored by Huawei\n\nFor now, iYouPort, the University of Maryland, and the Great Firewall Report said they were able to find six circumvention techniques that can be applied client-side (inside apps and software) and four that can be applied server-side (on servers and app backends) to bypass the GFW’s current block.\n\n“Unfortunately, these specific strategies may not be a long-term solution: as the cat and mouse game progresses, the Great Firewall will likely to continue to improve its censorship capabilities,” the three organizations also added.\n\nZDNet also confirmed the report’s findings with two additional sources – namely members of a US telecommunications provider and an internet exchange point (IXP)\n\nhttps://www.zdnet.com/article/china-is-now-blocking-all-encrypted-https-traffic-using-tls-1-3-and-esni/",
			"date_added": 1597029498
		},
		{
			"post_id": 1597029596,
			"body": "Китай начал блокировать HTTPS-соединения, устанавливаемые с TLS 1.3 и ESNI\n\nКитай внедрил блокировку всех HTTPS-соединений, в которых используется протокол TLS 1.3 и TLS-расширение ESNI (Encrypted Server Name Indication), обеспечивающее шифрование данных о запрашиваемом хосте. Блокировка осуществляется на транзитных маршрутизаторах как для соединений, устанавливаемых из Китая во внешний мир, так и из внешнего мира в Китай.\n\nДля блокировки выполняется отбрасывание пакетов от клиента к серверу, а не подстановка пакетов с флагом RST, которая ранее выполнялась при выборочной блокировке по содержимому SNI. После срабатывания блокировки пакета с ESNI в течение от 120 до 180 секунд также блокируются все сетевые пакеты, соответствующие связке из исходного IP, целевого IP и номера порта назначения. HTTPS-соединения на основе старых версий TLS и TLS 1.3 без ESNI пропускаются как обычно.\n\nНапомним, что для организации работы на одном IP-адресе нескольких HTTPS-сайтов было разработано расширение SNI, осуществляющее передачу имени хоста в открытом виде в сообщении ClientHello, передаваемом до установки шифрованного канала связи. Подобная особенность даёт возможность на стороне интернет-провайдера выборочно фильтровать HTTPS-трафик и анализировать какие сайты открывает пользователь, что не позволяет добиться полной конфиденциальности при применении HTTPS.\n\nНовое TLS-расширение ECH (ранее ESNI), которое может применяться совместно с TLS 1.3, устраняет этот недостаток и полностью исключает утечку сведений о запрашиваемом сайте при анализе HTTPS-соединений. В сочетании с обращением через сеть доставки контента применение ECH/ESNI также даёт возможность скрыть от провайдера и IP-адрес запрашиваемого ресурса. Системы инспектирования трафика будут видеть только обращения к CDN и не смогут применить блокировку без подмены TLS-сеанса, в случае которой в браузере пользователя будет показано соответствующее уведомление о подмене сертификата. Возможным каналом утечки остаётся DNS, но для скрытия обращения к DNS клиентом может применяться DNS-over-HTTPS или DNS-over-TLS.\n\nИсследователи уже выявили несколько обходных путей для обхода китайской блокировки на стороне клиента и сервера, но они могут потерять актуальность и их следует рассматривать лишь как временную меру. Например, в настоящее время блокируются только пакеты с идентификатором расширения ESNI 0xffce (encrypted_server_name), который использовался в пятой версии черновика стандарта, но пока пропускаются пакеты с актуальным идентификатором 0xff02 (encrypted_client_hello), предложенным в седьмом черновике спецификации ECH.\n\nДругим вариантом обхода является использование нестандартного процесса согласования соединения, например, блокировка не срабатывает при предварительной отправке дополнительного SYN-пакета с неверным номером последовательности, манипуляциями с флагами фрагментирования пакетов, отправке пакета с одновременно выставленными флагами FIN и SYN, подстановке RST-пакета с некорректной контрольной суммой или отправке до начала согласования соединения пакета с флагами SYN и ACK. Описанные методы уже реализованы в форме плагина к инструментарию Geneva, развиваемого для обхода методов цензурирования.\n\nhttps://www.opennet.ru/opennews/art.shtml?num=53520\n\nhttps://habr.com/ru/news/t/514390/",
			"date_added": 1597029516
		},
		{
			"post_id": 1597864405,
			"body": "Airspy, a High Quality Approach to Software-Defined Radio\n\nAirspy is a line of Popular Software-Defined Radio (SDR) receivers developed to achieve High Performance and Affordable Price using innovative combinations of DSP and RF techniques. The goal is to satisfy the most demanding telecommunications professionals and radio enthusiasts while being a serious alternative to both cost sensitive and higher end receivers. Airspy Radios feature world class reception quality and ease of use thanks to the tight integration with the de facto standard free SDR# software for signal acquisition, analysis and demodulation.\nThe SDR Revolution Today\n\nSoftware-Defined Radio (SDR) is a new technology that offers a simple alternative to bulkier analog radio, adding more flexibility, performance and a smaller form factor. SDRs are everywhere nowadays, from your cell phone to your wireless headset and your cable modem. \n\nMy rtl sdr r820t\n\n\nhttps://airspy.com/\n\n#sdr #rtl #sdrsharp #gnuradio #radio #foss #opensource ",
			"date_added": 1597864324,
			"meta": "{\"img\":\"900,479,333222211111000,01111012211133313331013333333211444444423333111332\"}"
		},
		{
			"post_id": 1597864595,
			"body": "MenuetOS is a pre-emptive, real-time and multiprocessor Operating System in development for the PC written entirely in 64bit and 32bit assembly language. Menuet64 is released under License and Menuet32 under GPL. Menuet supports both 64 and 32bit x86 assembly programming for smaller, faster and less resource hungry applications.\n\nMenuet isn't based on other operating system nor has it roots within UNIX or the POSIX standards. The design goal has been to remove the extra layers between different parts of an OS, which normally complicate programming and create bugs.\n\nMenuet's application structure isn't specifically reserved for asm programming since the header can be produced with practically any other language. However, the overall application programming design is intended for 32/64 bit asm programming. Menuet programming is fast and easy to learn. Menuet's responsive GUI is easy to handle with assembly language. And Menuet64 is capable of running Menuet32 applications.\n\nhttp://menuetos.net/",
			"date_added": 1597864513
		},
		{
			"post_id": 1598299717,
			"body": null,
			"date_added": 1598299634,
			"meta": "{\"img\":\"900,675,246243233345122012354565356464575799577254,001213224500678882120298ABC277127C288112122C2236226328242222DD23724444DDD9AA7255\"}"
		},
		{
			"post_id": 1598300538,
			"body": "Ventoy is an open source tool to create bootable USB drive for ISO/WIM/IMG/EFI files.\nWith ventoy, you don’t need to format the disk over and over, you just need to copy the ISO/WIM/IMG/EFI files to the USB drive and boot them directly.\nYou can copy many files at a time and ventoy will give you a boot menu to select them (screenshot). Both Legacy BIOS and UEFI are supported in the same way. 470+ ISO files are tested (list).\nA “Ventoy Compatible” concept is introduced by ventoy, which can help to support any ISO file.\n\nhttps://www.ventoy.net/\n\nhttps://github.com/ventoy/Ventoy/releases",
			"date_added": 1598300454
		},
		{
			"post_id": 1598431722,
			"body": "Отравление навального \nhttp://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1598358560_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd\n\n",
			"date_added": 1598431637
		},
		{
			"post_id": 1598612646,
			"body": "A secure socks5 proxy,\ndesigned to protect your Internet traffic.\n\nSuper Fast\n\nBleeding edge techniques using Asynchronous I/O and Event-driven programming.\nFlexible Encryption\n\nSecured with industry level encryption algorithm. Flexible to support custom algorithms.\nMobile Ready\n\nOptimized for mobile device and wireless network, without any keep-alive connections.\nCross Platform\n\nAvailable on most platforms, including Windows, Linux, Mac, Android, iOS, and OpenWRT.\nOpen Source\n\nTotally free and open source. A worldwide community devoted to deliver bug-free code and long-term support.\nEasy Deployment\n\nEasy deployment with pip, aur, freshports and many other package manager systems.\n\nhttps://github.com/shadowsocks/shadowsocks-android/releases\n\nhttps://github.com/shadowsocks/shadowsocks-android/releases\n\nzeronet link http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/184rhnxM89SU1gDuPEaQPjynfytkRtSEVd/1598612468-Shadowsocks.zip\n\n#shadowsocks #p2p ",
			"date_added": 1598612560
		}
	],
	"post_like": {
		"13EcmTsfiR4mFvepkVNHgFgLDSNCrbe4PP_1574693415": 1577380535,
		"184rhnxM89SU1gDuPEaQPjynfytkRtSEVd_1577564374": 1577599815,
		"1CzEAyCn5ciNVJrz7qKw69UJ6xGx9LQbnU_1577607867": 1577632884,
		"1NcWsRRfJKDtuoxbt7RzXPsbisRXCb1jXG_1577571965": 1577643306,
		"1BsefYDX8Cvc8cN4ShdoAWBhfksfdg6mMH_1577801995": 1577859349,
		"1MityxAx6QVFTYWjzSJFc6nCX6eyT5W5yQ_1578109600": 1578119097,
		"184rhnxM89SU1gDuPEaQPjynfytkRtSEVd_1577379113": 1578254112,
		"13qMquPdWJ59qDHa4e9oJK2kpnHDe1HYV1_1577359487": 1578254168,
		"13EcmTsfiR4mFvepkVNHgFgLDSNCrbe4PP_1578273349": 1578297570,
		"1N7ozinXUWETvJKAfmTTdKzYp2pVtY3p7X_1576220668": 1578297946,
		"1FfatX3G2z43rV6nc1F3koYtn8tmD5EVb6_1578396167": 1578497354,
		"13qMquPdWJ59qDHa4e9oJK2kpnHDe1HYV1_1580992361": 1580995338,
		"1CqNrgtYzPRgpMfeuC1sprqTwPxhDTmqY4_1580888526": 1581055240,
		"129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71_1582469077": 1582666777,
		"12BB69A9mu4AkS1XqsCWBt9gSnWAau5BGW_1582451299": 1582666786,
		"17wgDCN4xqwb1ZbtTyYQm7jBtdTisZY7VE_1583134053": 1583136625,
		"1E1M4LRh1x21xPQ5i6Kcvio3hwo7TmxjDr_1583484446": 1583500148,
		"1N7ozinXUWETvJKAfmTTdKzYp2pVtY3p7X_1583918282": 1583937399,
		"19ZfXPt29amPfF8efHUreayzwWnx85ngi3_1584611069": 1584611172,
		"184rhnxM89SU1gDuPEaQPjynfytkRtSEVd_1584610686": 1584676416,
		"1E8Vp3fwjv3cHzj6qx5pCW8DeWK4Cwfenq_1584811208": 1584824025,
		"1E8Vp3fwjv3cHzj6qx5pCW8DeWK4Cwfenq_1584905218": 1584952235,
		"1HfK1cdvKHMDJkHnAXroUqvfYw19iZh5yd_1585673078": 1585673123,
		"13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm_1568243164": 1585689357,
		"13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm_1554466739": 1585689403,
		"13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm_1576463743": 1585689626,
		"13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm_1569879300": 1585689629,
		"13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm_1585686691": 1585689798,
		"13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm_1568855665": 1585716892,
		"1L4Ev3e99ZaMRqaTPUc5ZwHkWa62oGuFUU_1586359755": 1586366089,
		"14Rw6GKaWbojrAsJUh8Aj3LDEoG4bXgkDu_1586775716": 1586826328,
		"1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1586874465": 1586964787,
		"1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1589487155": 1589535646,
		"1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1590856787": 1590864056,
		"1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1589097089": 1590864110,
		"18BU8cPZhTo3jPVUyVzVHPzwfSxXDeFHPQ_1591013710": 1591014043,
		"184rhnxM89SU1gDuPEaQPjynfytkRtSEVd_1592986603": 1593139416,
		"184rhnxM89SU1gDuPEaQPjynfytkRtSEVd_1593253601": 1593257383,
		"184rhnxM89SU1gDuPEaQPjynfytkRtSEVd_1593257471": 1593415328,
		"1JeTJBQxC7CuQFxijHjjEqKgQnXJhRFF94_1592916464": 1593795894,
		"1J4G2evnydnAMBRGeAxpTmyfva2xv6FM7s_1594815002": 1594832182,
		"1J4G2evnydnAMBRGeAxpTmyfva2xv6FM7s_1594465923": 1594832216,
		"1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1598144307": 1598299651,
		"1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1598144364": 1598556187,
		"1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1598144207": 1598556196,
		"1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7_1597682921": 1598556230,
		"1594vakbsDPrQW8Tw2ZfRJUKXudpgCPG1i_1601122817": 1601439329,
		"1HvtaEP4h88QTu4Pv1a7SDuq1H6v7TDgsN_1606896421": 1606909578,
		"184rhnxM89SU1gDuPEaQPjynfytkRtSEVd_1577378151": 1607798172,
		"184rhnxM89SU1gDuPEaQPjynfytkRtSEVd_1597864405": 1608220995,
		"184rhnxM89SU1gDuPEaQPjynfytkRtSEVd_1578335413": 1608221243,
		"184rhnxM89SU1gDuPEaQPjynfytkRtSEVd_1578335454": 1608221245,
		"184rhnxM89SU1gDuPEaQPjynfytkRtSEVd_1577377557": 1608221293,
		"184rhnxM89SU1gDuPEaQPjynfytkRtSEVd_1577377413": 1608221360
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "привет",
			"post_uri": "1HnepkYQUYxzgLMr1SYhWURoR2vs9NENFL_1574217719",
			"date_added": 1577380588
		},
		{
			"comment_id": 2,
			"body": "ну зачем это гавно",
			"post_uri": "1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk_1577382055",
			"date_added": 1577382076
		},
		{
			"comment_id": 3,
			"body": "привет",
			"post_uri": "1M6qYFjYmB5NkAUHs96bBUCDc6U4CGTrww_1577709581",
			"date_added": 1577710129
		},
		{
			"comment_id": 4,
			"body": "sexy",
			"post_uri": "1BsefYDX8Cvc8cN4ShdoAWBhfksfdg6mMH_1577801995",
			"date_added": 1577859359
		},
		{
			"comment_id": 5,
			"body": "Всем похуй делай чтото полезное для интернета",
			"post_uri": "1M6qYFjYmB5NkAUHs96bBUCDc6U4CGTrww_1578074826",
			"date_added": 1578094463
		},
		{
			"comment_id": 6,
			"body": "@Димка: я вкурсе",
			"post_uri": "184rhnxM89SU1gDuPEaQPjynfytkRtSEVd_1577377134",
			"date_added": 1578165659
		},
		{
			"comment_id": 7,
			"body": "@Fuoz: no",
			"post_uri": "184rhnxM89SU1gDuPEaQPjynfytkRtSEVd_1578294584",
			"date_added": 1578311939
		},
		{
			"comment_id": 8,
			"body": "retroshare chat server\n\nhttps://retroshare.ch/\n",
			"post_uri": "1FfatX3G2z43rV6nc1F3koYtn8tmD5EVb6_1578396167",
			"date_added": 1578456421
		},
		{
			"comment_id": 9,
			"body": "http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1570989643_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1",
			"post_uri": "1FfatX3G2z43rV6nc1F3koYtn8tmD5EVb6_1578396167",
			"date_added": 1578456641
		},
		{
			"comment_id": 10,
			"body": "http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:2_14JmpT6tbroLtkGYQMAkUJHQLRmqWk2pxz",
			"post_uri": "1FfatX3G2z43rV6nc1F3koYtn8tmD5EVb6_1578396167",
			"date_added": 1578456662
		},
		{
			"comment_id": 11,
			"body": "@珏龖: retroshare chat server\n\nhttps://retroshare.ch/\n\nhttp://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:2_14JmpT6tbroLtkGYQMAkUJHQLRmqWk2pxz\n\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1570989643_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1",
			"post_uri": "1FfatX3G2z43rV6nc1F3koYtn8tmD5EVb6_1578396167",
			"date_added": 1578497545
		},
		{
			"comment_id": 12,
			"body": "хорошая штука https://www.youtube.com/watch?v=Hp1O-4fZbOE",
			"post_uri": "14MxWo8bKoyxW5tDsYMq7bbj8cTfenBURU_1578418849",
			"date_added": 1578566871
		},
		{
			"comment_id": 13,
			"body": "IPV6 IS THE NEW NORMAL\n\nMajor Internet service providers (ISPs), home networking equipment manufacturers, and web companies around the world are permanently enabling IPv6 for their products and services.\n\nGlobal IPv6 traffic has grown more than 5000% since World IPv6 Launch began on 6 June 2012, with some networks now reporting 80 or 90% deployment of IPv6! (See our measurements.)\n\nOrganized by the Internet Society, and building on the successful one-day World IPv6 Day event held on 8 June 2011, World IPv6 Launch represents a major milestone in the global deployment of IPv6. As the successor to the current Internet Protocol, IPv4, IPv6 is critical to the Internet’s continued growth as a platform for innovation and economic development.\n\nhttps://www.worldipv6launch.org/",
			"post_uri": "1f14ZYyzStz4VrDw3o8Ta6x89t27CXsNN_1582278996",
			"date_added": 1582398265
		},
		{
			"comment_id": 14,
			"body": "Statistics\n\nGoogle collects statistics about IPv6 adoption in the Internet on an ongoing basis. We hope that publishing this information will help Internet providers, website owners, and policy makers as the industry rolls out IPv6.\n\nhttps://www.google.com/intl/en/ipv6/statistics.html",
			"post_uri": "1f14ZYyzStz4VrDw3o8Ta6x89t27CXsNN_1582278996",
			"date_added": 1582398280
		},
		{
			"comment_id": 15,
			"body": "https://www.youtube.com/watch?v=JIDIK55GJ8o",
			"post_uri": "1Q9vgKagehDHwvhYF32zpRPuDaBNDQ3PaE_1580368848",
			"date_added": 1582398393
		},
		{
			"comment_id": 16,
			"body": "неужели правда",
			"post_uri": "1N7ozinXUWETvJKAfmTTdKzYp2pVtY3p7X_1583918282",
			"date_added": 1583937409
		},
		{
			"comment_id": 17,
			"body": "super",
			"post_uri": "13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm_1568855665",
			"date_added": 1585716901
		},
		{
			"comment_id": 18,
			"body": "прикольно",
			"post_uri": "14Rw6GKaWbojrAsJUh8Aj3LDEoG4bXgkDu_1586775716",
			"date_added": 1586826336
		},
		{
			"comment_id": 19,
			"body": "цензура началась",
			"post_uri": "1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1590856787",
			"date_added": 1590864066
		},
		{
			"comment_id": 20,
			"body": "sexy",
			"post_uri": "18BU8cPZhTo3jPVUyVzVHPzwfSxXDeFHPQ_1591013710",
			"date_added": 1591014065
		},
		{
			"comment_id": 21,
			"body": "test",
			"post_uri": "16p5GeaN7icACoKSnL2oKrhHq62qkNyD3_1591460887",
			"date_added": 1591464986
		},
		{
			"comment_id": 22,
			"body": "ok",
			"post_uri": "1FY9i3xWS63Vf9AfiGJsttHb3cYDg1QzoY_1",
			"date_added": 1593897323
		},
		{
			"comment_id": 23,
			"body": "прикольно",
			"post_uri": "1J4G2evnydnAMBRGeAxpTmyfva2xv6FM7s_1594815002",
			"date_added": 1594832192
		},
		{
			"comment_id": 24,
			"body": "зацени пои инструменты в моем профиле",
			"post_uri": "1J4G2evnydnAMBRGeAxpTmyfva2xv6FM7s_1594465923",
			"date_added": 1594832237
		},
		{
			"comment_id": 25,
			"body": "i2p где ",
			"post_uri": "1J4G2evnydnAMBRGeAxpTmyfva2xv6FM7s_1594465923",
			"date_added": 1594832331
		},
		{
			"comment_id": 26,
			"body": "мы тут",
			"post_uri": "1NAVQ21k5UPcbYM8RmWBMjPf9ytn5VFcrP_1603813550",
			"date_added": 1603982786
		},
		{
			"comment_id": 27,
			"body": "ok",
			"post_uri": "129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71_1607847773",
			"date_added": 1607875281
		},
		{
			"comment_id": 28,
			"body": "hi",
			"post_uri": "1GrAPRXhSt1gJf7f7iHvNQME7V8ByjsC1C_1608040950",
			"date_added": 1608118722
		},
		{
			"comment_id": 29,
			"body": "я понимаю",
			"post_uri": "1Aab6orXaQW6dkAV6qHYnsvYPjbr1TdrGW_1610221521",
			"date_added": 1610269692
		},
		{
			"comment_id": 30,
			"body": "привет",
			"post_uri": "1Aab6orXaQW6dkAV6qHYnsvYPjbr1TdrGW_1610221407",
			"date_added": 1610269698
		},
		{
			"comment_id": 31,
			"body": "хахахах сука его в твитере забанили он сюда пришол",
			"post_uri": "1FweE4266fmDJDpR7zSFueXHYrYy8R2XS4_1",
			"date_added": 1610269730
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "184rhnxM89SU1gDuPEaQPjynfytkRtSEVd",
			"user_name": "Topnet",
			"date_added": 1577379374
		},
		{
			"follow_id": 3,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "13EcmTsfiR4mFvepkVNHgFgLDSNCrbe4PP",
			"user_name": "珏龖",
			"date_added": 1577380557
		},
		{
			"follow_id": 5,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "13t3sJJF35Eei5GApCSAVFp65aZjjZB5jE",
			"user_name": "黄油绅士",
			"date_added": 1577380710
		},
		{
			"follow_id": 7,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1Fcvuso49sa7PXuYqxBBnSAnSdF6U7p5Ta",
			"user_name": "瓶子",
			"date_added": 1577381807
		},
		{
			"follow_id": 8,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk",
			"user_name": "Haxxer",
			"date_added": 1577382063
		},
		{
			"follow_id": 9,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4",
			"user_name": "Lianna",
			"date_added": 1577561959
		},
		{
			"follow_id": 10,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1M6qYFjYmB5NkAUHs96bBUCDc6U4CGTrww",
			"user_name": "Ussr2",
			"date_added": 1577710190
		},
		{
			"follow_id": 11,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw",
			"user_name": "Balancer73",
			"date_added": 1578224508
		},
		{
			"follow_id": 12,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "15bXfYrgn11ULbJ71nHqDrERcxNotpYsqP",
			"user_name": "Too Late",
			"date_added": 1578229522
		},
		{
			"follow_id": 13,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv",
			"user_name": "Calmaquesse",
			"date_added": 1578229528
		},
		{
			"follow_id": 14,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1CtQYHYjLTJzmztarDcifKU5SrGtZy8ptH",
			"user_name": "Balandoppel",
			"date_added": 1578229531
		},
		{
			"follow_id": 15,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1MHe9EDywJ7mrA52BikRPmbwQtQs1xNGEW",
			"user_name": "Dorysan",
			"date_added": 1578229545
		},
		{
			"follow_id": 16,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1KFqej3sgCjw62yRAqgdaGUzmTAuSDmbW2",
			"user_name": "Zorg13",
			"date_added": 1578229545
		},
		{
			"follow_id": 17,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1FKuNsExQML7APuNmkCV8uzB5pKupcmnck",
			"user_name": "Piloth The Mack",
			"date_added": 1578229546
		},
		{
			"follow_id": 18,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1J3zHeRQJosJJJhd4RRondHRyfSVGnCmNv",
			"user_name": "Bitcoren",
			"date_added": 1578229547
		},
		{
			"follow_id": 19,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1638vBEtAaRwFQpLUCwSaufp43MT6tbmYG",
			"user_name": "Deadclover",
			"date_added": 1578229548
		},
		{
			"follow_id": 20,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj",
			"user_name": "ZeroLSTN",
			"date_added": 1578229548
		},
		{
			"follow_id": 21,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh",
			"user_name": "Deepstrelok",
			"date_added": 1578229549
		},
		{
			"follow_id": 22,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1BghwqwD4SJaigm7kQjxvgTyEdxZgzWhSS",
			"user_name": "Stanz",
			"date_added": 1578229550
		},
		{
			"follow_id": 23,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di",
			"user_name": "Git Center",
			"date_added": 1578229551
		},
		{
			"follow_id": 24,
			"hub": null,
			"auth_address": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj",
			"user_name": "ZeroLSTN",
			"date_added": 1578229552
		},
		{
			"follow_id": 25,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC",
			"user_name": "Promusik",
			"date_added": 1578229553
		},
		{
			"follow_id": 26,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1GooUE19488nDwG3TdkM8seYAHct4gjkq4",
			"user_name": "Geekless",
			"date_added": 1578229553
		},
		{
			"follow_id": 27,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh",
			"user_name": "Kaffie",
			"date_added": 1578229555
		},
		{
			"follow_id": 28,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe",
			"user_name": "Plasmmer",
			"date_added": 1578229557
		},
		{
			"follow_id": 29,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR",
			"user_name": "weakish",
			"date_added": 1578229559
		},
		{
			"follow_id": 30,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F",
			"user_name": "Zerro",
			"date_added": 1578229563
		},
		{
			"follow_id": 31,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx",
			"user_name": "ks",
			"date_added": 1578229577
		},
		{
			"follow_id": 32,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1DB5vzATvqvQykj1zjL2xdMtYSqXc8cmP3",
			"user_name": "Freedombelarus",
			"date_added": 1578229970
		},
		{
			"follow_id": 33,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "18WFCAqYM3Kdhm5qskvR1rS3REQVZGjiHe",
			"user_name": "Chenyu",
			"date_added": 1578229971
		},
		{
			"follow_id": 34,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx",
			"user_name": "ks",
			"date_added": 1578229971
		},
		{
			"follow_id": 35,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1CTut2qbaj54ZjNoYeuWSGwV75iVieKY6N",
			"user_name": "Quadrangle",
			"date_added": 1578229972
		},
		{
			"follow_id": 36,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ",
			"user_name": "GomZik",
			"date_added": 1578229973
		},
		{
			"follow_id": 37,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "14kxkh1pLNYuCwCZ161HCQkSjvWW29ybNz",
			"user_name": "Geobor",
			"date_added": 1578229975
		},
		{
			"follow_id": 38,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "14qbGJTZ1cyF9YcSUVYj73xfxyTJjUEQWY",
			"user_name": "The33",
			"date_added": 1578229976
		},
		{
			"follow_id": 39,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ",
			"user_name": "ulrichard",
			"date_added": 1578229978
		},
		{
			"follow_id": 40,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu",
			"user_name": "Krixano",
			"date_added": 1578229979
		},
		{
			"follow_id": 41,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "15bXfYrgn11ULbJ71nHqDrERcxNotpYsqP",
			"user_name": "Too Late",
			"date_added": 1578229984
		},
		{
			"follow_id": 42,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4",
			"user_name": "Kopykate",
			"date_added": 1578249432
		},
		{
			"follow_id": 43,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1Dg6peqnLM18odQJZxDb2tEUNgAChwfdRT",
			"user_name": "Zero2proxy",
			"date_added": 1578249432
		},
		{
			"follow_id": 44,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH",
			"user_name": "Moor",
			"date_added": 1578249433
		},
		{
			"follow_id": 45,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1FKuNsExQML7APuNmkCV8uzB5pKupcmnck",
			"user_name": "Piloth The Mack",
			"date_added": 1578249435
		},
		{
			"follow_id": 46,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6",
			"user_name": "Kid Courageous",
			"date_added": 1578249438
		},
		{
			"follow_id": 47,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv",
			"user_name": "Siliks",
			"date_added": 1578249438
		},
		{
			"follow_id": 48,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "18UukzxVzEwd9ugyvKWYe2vud77GyL72Px",
			"user_name": "Sirlotaplot",
			"date_added": 1578249442
		},
		{
			"follow_id": 49,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC",
			"user_name": "Pexo",
			"date_added": 1578249443
		},
		{
			"follow_id": 50,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7",
			"user_name": "Shift",
			"date_added": 1578249443
		},
		{
			"follow_id": 51,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "13aB79mzuRLgDYzQthn9wzycjw77WyDXh6",
			"user_name": "Polar",
			"date_added": 1578249445
		},
		{
			"follow_id": 52,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK",
			"user_name": "blurHY",
			"date_added": 1578249449
		},
		{
			"follow_id": 53,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "19M1DT5vruSATEcbEczYRwCk2uPuLcATBa",
			"user_name": "Talnicrom",
			"date_added": 1578249449
		},
		{
			"follow_id": 54,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ",
			"user_name": "fant@zero - АУДИОКНИГИ",
			"date_added": 1578249450
		},
		{
			"follow_id": 55,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs",
			"user_name": "klu9@zeroid.bit",
			"date_added": 1578249453
		},
		{
			"follow_id": 56,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS",
			"user_name": "Ansho Rei",
			"date_added": 1578249453
		},
		{
			"follow_id": 57,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE",
			"user_name": "Quantumworld",
			"date_added": 1578249454
		},
		{
			"follow_id": 58,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "18rfzg99UZ36sYDxjNZ6rn2Krvdiq2QKpk",
			"user_name": "Iormungard",
			"date_added": 1578249455
		},
		{
			"follow_id": 59,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "14ytAKDfNjArMTqGecTi7ginG3aZTsRAum",
			"user_name": "Polar🍀☘️🌿🌾🌴",
			"date_added": 1578249457
		},
		{
			"follow_id": 60,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi",
			"user_name": "Eibriel",
			"date_added": 1578249458
		},
		{
			"follow_id": 61,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "12w3zJ6gRrcAw2kSCQXDkorgqxuXnkKkF8",
			"user_name": "Jamesholden",
			"date_added": 1578249461
		},
		{
			"follow_id": 62,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K",
			"user_name": "Thunder",
			"date_added": 1578249463
		},
		{
			"follow_id": 63,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "16LvuB65gAqLXgy5Pg9UNE6soj6E5huquN",
			"user_name": "Binchan",
			"date_added": 1578249465
		},
		{
			"follow_id": 64,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "14ytAKDfNjArMTqGecTi7ginG3aZTsRAum",
			"user_name": "Polar🍀☘️🌿🌾🌴",
			"date_added": 1578249466
		},
		{
			"follow_id": 65,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1Dg6peqnLM18odQJZxDb2tEUNgAChwfdRT",
			"user_name": "Zero2proxy",
			"date_added": 1578254280
		},
		{
			"follow_id": 67,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH",
			"user_name": "Moor",
			"date_added": 1578254286
		},
		{
			"follow_id": 68,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "18UukzxVzEwd9ugyvKWYe2vud77GyL72Px",
			"user_name": "Sirlotaplot",
			"date_added": 1578254288
		},
		{
			"follow_id": 69,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "16LvuB65gAqLXgy5Pg9UNE6soj6E5huquN",
			"user_name": "Binchan",
			"date_added": 1578254295
		},
		{
			"follow_id": 70,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K",
			"user_name": "Thunder",
			"date_added": 1578254296
		},
		{
			"follow_id": 71,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "14ytAKDfNjArMTqGecTi7ginG3aZTsRAum",
			"user_name": "Polar🍀☘️🌿🌾🌴",
			"date_added": 1578254298
		},
		{
			"follow_id": 72,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "12w3zJ6gRrcAw2kSCQXDkorgqxuXnkKkF8",
			"user_name": "Jamesholden",
			"date_added": 1578254301
		},
		{
			"follow_id": 73,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi",
			"user_name": "Eibriel",
			"date_added": 1578254304
		},
		{
			"follow_id": 74,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1FKuNsExQML7APuNmkCV8uzB5pKupcmnck",
			"user_name": "Piloth The Mack",
			"date_added": 1578254308
		},
		{
			"follow_id": 75,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7",
			"user_name": "Shift",
			"date_added": 1578254310
		},
		{
			"follow_id": 76,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ",
			"user_name": "fant@zero - АУДИОКНИГИ",
			"date_added": 1578254313
		},
		{
			"follow_id": 77,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS",
			"user_name": "Ansho Rei",
			"date_added": 1578254315
		},
		{
			"follow_id": 78,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE",
			"user_name": "Quantumworld",
			"date_added": 1578254317
		},
		{
			"follow_id": 79,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs",
			"user_name": "klu9@zeroid.bit",
			"date_added": 1578254319
		},
		{
			"follow_id": 80,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "18rfzg99UZ36sYDxjNZ6rn2Krvdiq2QKpk",
			"user_name": "Iormungard",
			"date_added": 1578254321
		},
		{
			"follow_id": 81,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "14ytAKDfNjArMTqGecTi7ginG3aZTsRAum",
			"user_name": "Polar🍀☘️🌿🌾🌴",
			"date_added": 1578254323
		},
		{
			"follow_id": 82,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "19M1DT5vruSATEcbEczYRwCk2uPuLcATBa",
			"user_name": "Talnicrom",
			"date_added": 1578254325
		},
		{
			"follow_id": 83,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC",
			"user_name": "Pexo",
			"date_added": 1578254327
		},
		{
			"follow_id": 84,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "13aB79mzuRLgDYzQthn9wzycjw77WyDXh6",
			"user_name": "Polar",
			"date_added": 1578254328
		},
		{
			"follow_id": 85,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK",
			"user_name": "blurHY",
			"date_added": 1578254330
		},
		{
			"follow_id": 86,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv",
			"user_name": "Siliks",
			"date_added": 1578254359
		},
		{
			"follow_id": 87,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6",
			"user_name": "Kid Courageous",
			"date_added": 1578254361
		},
		{
			"follow_id": 88,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "13qMquPdWJ59qDHa4e9oJK2kpnHDe1HYV1",
			"user_name": "3Dporno",
			"date_added": 1578254414
		},
		{
			"follow_id": 89,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC",
			"user_name": "Draugrdeathlord",
			"date_added": 1578297654
		},
		{
			"follow_id": 90,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1FcZzWQFrMuEKNtRCSJcj5rcZGrFsQMczc",
			"user_name": "Caropc1",
			"date_added": 1578297868
		},
		{
			"follow_id": 91,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1N7ozinXUWETvJKAfmTTdKzYp2pVtY3p7X",
			"user_name": "Space Punk",
			"date_added": 1578297934
		},
		{
			"follow_id": 92,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u",
			"user_name": "Lola",
			"date_added": 1578335497
		},
		{
			"follow_id": 93,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1LFxK1BSHEnkJcXXb4qGszVUxEwqLVSJU8",
			"user_name": "Hermes32",
			"date_added": 1578425427
		},
		{
			"follow_id": 94,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1FfatX3G2z43rV6nc1F3koYtn8tmD5EVb6",
			"user_name": "Fuoz",
			"date_added": 1578456690
		},
		{
			"follow_id": 95,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco",
			"user_name": "Digitalworship",
			"date_added": 1578497783
		},
		{
			"follow_id": 96,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd",
			"user_name": "Styromaniac",
			"date_added": 1578497890
		},
		{
			"follow_id": 97,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1PGFKCfMSL1QdudndfYCo4mGM8E8XKzMMG",
			"user_name": "Rcastanonz",
			"date_added": 1578497920
		},
		{
			"follow_id": 98,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1Ko7622HKggRGbJny5hCS4n9wwMAVVLTSf",
			"user_name": "Birdvd",
			"date_added": 1579970601
		},
		{
			"follow_id": 99,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "19TSBC2cLuuaveC1TyLnR5mB8QK26RzRbQ",
			"user_name": "Pgkjk",
			"date_added": 1580597016
		},
		{
			"follow_id": 100,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj",
			"user_name": "Nofish",
			"date_added": 1584610480
		},
		{
			"follow_id": 101,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS",
			"user_name": "ZAlex",
			"date_added": 1584610485
		},
		{
			"follow_id": 102,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy",
			"user_name": "Glightstar",
			"date_added": 1584610497
		},
		{
			"follow_id": 103,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu",
			"user_name": "PaintNinja",
			"date_added": 1584610501
		},
		{
			"follow_id": 104,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS",
			"user_name": "SSDifnskdjfnsdjk",
			"date_added": 1584610508
		}
	]
}