{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 15,
	"comment": {
		"1566570350_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 1,
				"body": "Religion taught our masses education, hospitals, to read and welfare just to name a few.\nSee western civilisation is a majority judeo-christion society. And you are a minority, a traitor and a heratic.\nbeing a christian myself, i would have no problem removing you so my majority culture can survive.",
				"added": 1566739976
			},
			{
				"comment_id": 6,
				"body": "> [fiattoiletpaper](#comment_5_1MgPQAFQwHMiHTouXfUiS98cHrnyLScEQd): believe in Jesus as much as you want, he's not going to help you [...]\n\nGod does exist, but only to those who believe in him! Most Christians are weak and have been kind and empathtic, without being vigilant. And those weak Christians is why our culture is now under an invasion. By allowing non Chrisian leaders to lead our countries has been our greatest mistake. For these traitors who do not represent our cultuire our land or citizens. They represent themselves, they have no more faith than my horse. They are traitors and spy's who have poisoned our wells, destroyed our walls of protection and now open our gates to the hordes. You have been blindfolded into thinking man is greater than his own creator, but only the fool does not know the history of his culture and of what his forefathers built, worked and died for. And that is so their future generations could inherit their culture of a white Judeo-Christian majority!",
				"added": 1566742596
			},
			{
				"comment_id": 7,
				"body": "> [ratsmack](#comment_36_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): Seriously... the only people that refer to Judeo-Christians are cuckservatives and woke boomers. [...]\n\nDo Jews not believe in the same God as Protestants and Catholics?\nOr do you wish to start another english cival war?",
				"added": 1566744895
			},
			{
				"comment_id": 10,
				"body": "2 Timothy 3\nGodlessness in the last days.\n\nBut understand this, that in the last days there will come times of difficulty. For people will be lovers of self, lovers of money, proud, arrogant, abusive, disobedient to their parents, ungrateful, unholy, heartless, unappeasable, \nslanderous, without self-control, brutal, not loving good, treacherous, reckless, swollen with conceit, lovers of pleasure rather than lovers of God, having the appearance of godliness, but denying its power. \nAvoid such people. \nFor among them are those who creep into households and capture weak women, burdened with sins and led astray by various passions, always learning and never able to arrive at a knowledge of the truth. Just as Jannes and Jambres opposed Moses, so these men also oppose the truth, men corrupted in mind and disqualified regarding the faith. \n\nBut they will not get very far, for their folly will be plain to all, as was that of those two men.",
				"added": 1566749940
			}
		],
		"1566725876_1MgPQAFQwHMiHTouXfUiS98cHrnyLScEQd": [
			{
				"comment_id": 2,
				"body": "btc is run by a computer algo, just like most of the fiat markets. btc is also run by the jews and they will draw a menorah in the chart just to prove you are mostly dumb fucking sheep every now and then. you can believe its legit buying and selling all you want, but the real fact is you know nothing about trading. For their is only two ways you will know the rich mans tricks, you are either born into the family who knows and keeps these secrets guarded or you have the time and observation to work it out for youself, you are neither!",
				"added": 1566740422
			},
			{
				"comment_id": 5,
				"body": "> [fiattoiletpaper](#comment_4_1MgPQAFQwHMiHTouXfUiS98cHrnyLScEQd): thanks for enlightening me !\n\nI trade $100M USD a month, its going to around 9K then back to 12K then its bombs away suckers!\nhttps://bitcoinwisdom.io/grids/begmqf25uwxthu",
				"added": 1566741469
			},
			{
				"comment_id": 9,
				"body": "> [znnex](#comment_52_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): That person is definitely legit.slash ess\n\nas legit as your inability to prove otherwise.",
				"added": 1566745890
			}
		],
		"1566342722_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 3,
				"body": "this thread is tighter than a ten year old!",
				"added": 1566740648
			}
		],
		"1550241221_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 4,
				"body": "do i need the autotuner connected?",
				"added": 1566741008
			}
		],
		"1566743767_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 8,
				"body": "let me guess, your asking for a \"friend\"???\nGlorious? > [moor](#comment_190_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): that could be an interesting novel, maybe.\n\nSound more like the OP is describing his gay fantasy!",
				"added": 1566745595
			}
		],
		"1566749586_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 11,
				"body": "im nobody else! \nwhat you going to do now grasshopper?\n\ncrack a fortune cookie?",
				"added": 1566753027
			}
		],
		"1566448853_12XcKUGvjkDZ5ufLFESyYLYXgELagrHyxz": [
			{
				"comment_id": 12,
				"body": "Aww Shit, even after 11 years this crap never gets old!",
				"added": 1566753200
			},
			{
				"comment_id": 13,
				"body": "hey you dumbass's its a computer driven algo, its not moved by news or people buying and selling whatsoever.",
				"added": 1566753311
			}
		],
		"1566796194_1PeZW92EEP6UvxaSbL3cLMRPSG4agoiFTq": [
			{
				"comment_id": 14,
				"body": "Silver is worthless! The only reason you buy silver is if you dont know its worthless!",
				"added": 1566797524
			}
		]
	},
	"comment_vote": {
		"191_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1
	}
}