{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1560035677,
			"title": "Is anyone interested in archiving old Operating systems, as well as new ones?",
			"body": "Just as the title says.  Ive been busy creating Operating System install discs on Blank DVDs and CDs.  I tend to stick to doing 64 bit, but also want to do more 32 bit, 16 bit, and even 8 bit operating systems.  Is anyone else interested in this, or is already doing such a thing?",
			"added": 1560035676
		},
		{
			"topic_id": 1560112205,
			"title": "Create own site for hosting files?",
			"body": "What is the best way to create a Zeronet site for hosting your own files?",
			"added": 1560112203
		},
		{
			"topic_id": 1560146219,
			"title": "Starting a Zite to Preserve a pure internet",
			"body": "I wish to create a zite to preserve the word of god, and that which is pure in this world.  It shall NEVER contain Porn, nor will it permit perversions that people might have, such as Homosexuality, Transsexuality (also known as Gender Dysphoria), Transhumanism, or attempting to rise above God.  This wicked and perverse generation shall not stand, and does not live up to the glory of God.  On this site, I wish to host files that are taken down elsewhere, as these demonic people wish to pervert the word of God with their so called \"Tolerance\" of the intolerable.  No, this shall not host Nazi content.  Videos shall be what is mostly hosted.  YouTube is taking down videos that conflict with the true word of God, and we must preserve the word of God, AS IT STANDS, AND HAS ALWAYS STOOD!  Amen!",
			"added": 1560146216
		}
	],
	"topic_vote": {
		"1559829157_14MHxcFsxWxxJzBAGwHjoP38625Pv7FaeB": 1,
		"1560035677_159A9mgy8Rj1VR6hVoen597LKFZYuvU722": 1,
		"1560053525_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1559765720_1Q1jvHD9GzJskrk2PuWLbudrdFLDT2nvGg": 1,
		"1560146219_159A9mgy8Rj1VR6hVoen597LKFZYuvU722": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1559937565_1NFEZa8hNrGfpw1EK4yRPWVquQJi59pMV7": [
			{
				"comment_id": 1,
				"body": "I can be a retard without fear of retribution.",
				"added": 1559979767
			}
		],
		"1559682182_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 2,
				"body": "Pipe down commie scum!",
				"added": 1559979859
			}
		],
		"1560035677_159A9mgy8Rj1VR6hVoen597LKFZYuvU722": [
			{
				"comment_id": 3,
				"body": "> [qspitzer](#comment_11_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX): https://winworldpc.com/library/operating-systems currently has archives of old operating systems (along with games and other abandonware). It's probably missing some, but it is a good start if you are planning on downloading any\n\nThank you.  I have been actively using that site for some releases.  I am still trying to figure out if it would be worth it to download all versions (including multi language, and upgrades), or if the Retail versions (for Windows as an example) are best for this.",
				"added": 1560059322
			}
		],
		"1559765720_1Q1jvHD9GzJskrk2PuWLbudrdFLDT2nvGg": [
			{
				"comment_id": 4,
				"body": "> [leftside](#comment_778_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): I wish I was born in America or in Japan in regard with computer tech.Of course nowadays it's meaningless anymore.\n\nas someone who was born in the U.S, I have to say, its not all its cracked up to be (anymore).  Having been born at the end of the 90s, I grew up a fairly plain life.  Porn was my go to for tech since 2006.  Steady fast internet allowed for degeneracy.  Not, I wouldn't have wanted to be born in any other country, but just be thankful for where you are from.",
				"added": 1560120321
			}
		],
		"1560146219_159A9mgy8Rj1VR6hVoen597LKFZYuvU722": [
			{
				"comment_id": 5,
				"body": "> [d4v3an0n](#comment_1_17NuSXNjuWqZuwVKBKzehMVJ7ML2Jtmn4D): fuck off pal. Go bother someone else with you shitty conservative and homophobic ideas!The concept itself of p2p internet is freedom, the right for anyone to do whathever the fuck they want and the right to BE who they are. So if you are a conservative, YOU ARE IN THE WRONG PLACE\n\nThis zite is neither conservative, nor \"homophobic\".  Stop trying to place politics above God.  The term \"homophobia\" is retarded, because it is the gays attempting to tell people that if they don't accept their perversions, than they are \"homophobic\".  I do not scare someone who Is less than me.\n\nYou say the concept of P2P is freedom, but then you tell me to go somewhere else, as you think I am \"in the wrong place\".  You are a hypocrite my friend.",
				"added": 1560199864
			}
		],
		"1560364768_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": [
			{
				"comment_id": 6,
				"body": "Icke is a hack.  He preaches Aliens (fallen angels and devils).  Nothing more than Satan's pawn.  Sure, he is right on things like 5G and somewhat of our government, but even a broken clock is right two times a day",
				"added": 1560590117
			}
		]
	},
	"comment_vote": {
		"3_1E1ETHw8wzWhza7R49wyrM1U9ZRHvykejr": 1,
		"1_159A9mgy8Rj1VR6hVoen597LKFZYuvU722": 1,
		"11_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"3_159A9mgy8Rj1VR6hVoen597LKFZYuvU722": 1,
		"67_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"787_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"2_1DZh9ZwU3TsEdn7G7xsMFaX4d55ud323Fz": 1,
		"46_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1
	}
}