{
	"next_comment_id": 7,
	"comment": [
		{
			"comment_id": 1,
			"body": "13:01：午后密切关注上午盘尾级别不大分时线低点的支撑力度，行情能否真正走强，需要看持续性！\n\n 12:46：因此，午后密切关注直播分析，大盘能否持续反弹，大盘能否放量和有没有领涨权重板块出现，这两点很重要！\n\n 12:44：今天淘气在午评《淘气天尊：午后大盘关键的两种走势分析！》中已经分析过午后大盘可能的两种走势，第一种是以午盘前的分时线低点支撑为契机，然后反复消化后去直接逼近或突破3000点，技术上再次出现对位高点反压；第二种是午后大盘反弹持续缩量，那么反弹力度不会太大，红绿盘再次持续震荡后盘尾再次回踩消化，不过回踩大概率能在2950-2980区间出现分时线低点共振以后再次支撑有效！\n\n\n12：40：看直播原则：直播提示个股，之前直播都有说明，不知道的请回看直播，乱问或乱回答的，将会被禁言或黑名单处理！授人以鱼不如授人以渔！谢谢理解和支持！\n\n12：35：往期直播回顾：http://blog.sina.com.cn/s/articlelist_1617732512_5_1.html\n\n 12:30：如果你觉得直播好，电脑网页版直播下方请点击“喜欢”或“赠金笔”！微博可以请“点赞”支持！也可以点击最下方的【微博打赏】！淘气天尊新浪微博地址：http://weibo.com/tqtz（点击关注后，你能用手机时刻关注播主盘中直播，并且还能时刻知晓播主生活细节！）\n\n 12:45：淘粉们，下午好！感谢小伙伴们的关注和支持！来到淘气直播第一件事情，那就是留下脚印，证明你的存在！淘气不需要小伙伴们的任何赞美，只需要小伙伴们一句真诚的问候，“下午好”、“报道”、“我来了”或者一个表情等等均可，淘气只想知道有多少人关注着淘气！这个要求过分吗？——淘气在这里，你们在哪里？\n",
			"post_id": 855,
			"date_added": 1462338949
		},
		{
			"comment_id": 2,
			"body": "富贵花",
			"post_id": 528,
			"date_added": 1462344341
		},
		{
			"comment_id": 3,
			"body": "顶",
			"post_id": 856,
			"date_added": 1462363098
		},
		{
			"comment_id": 4,
			"body": "> [gjwzye](#comment_3_12V5BTGFEYTWsK7X3YwQowPvoyM83Txmib): 顶的\n\n",
			"post_id": 856,
			"date_added": 1462363151
		},
		{
			"comment_id": 5,
			"body": "1949年，大陆政权易主后，民间慈善力量灰飞烟灭，官方机构独家垄断。这些年来，随着文明的回归，随着中产阶级的兴起，民间慈善快速发展，已经无法压制。《慈善法》应当认清现实，不可抗拒趋势。",
			"post_id": 852,
			"date_added": 1462423222
		},
		{
			"comment_id": 6,
			"body": "领导，能稍稍流露点人性吗？ 作者：李鸣涛    2016-05-06 12:10栏目：时政\n标签： 平等 政治 人性 尊重\n52  1  0\n平等,尊重,谦卑,人性,政治\n\n1881年，26岁的梅藤更医生被英国基督教圣公会派往中国，他服务中国达20多年。上图为他在查房时与中国小患者行礼。一个中年老外给一个中国小屁孩九十度鞠躬行礼，画面既让人捧腹又让人感慨。中国还在搞“父为子纲”的时代，英国人已经视孩子为一个独立的个体，能够平等相待了。\n\n长幼之间是一种平等的尊重，而不是把孩子当成私产，把孩子当成可以随意控制的对象。\n\n在这方面，当今西方国家的政治家为我们做了很好的表率。他们不吝在孩子跟前低下他们高贵的头。\n\n平等,尊重,谦卑,人性,政治\n\n在美国白宫，最近几十年美国总统工作和生活照片挂在西翼，每张照片不久就会被更新的照片替换。然而，这张照片已经在那里挂了三年。2009年5月8日，美国华盛顿，白宫工作人员家属参观白宫时，美国总统奥巴马在椭圆形办公室内俯下身来让一名小男孩摸自己的头发。\n\n民主国家的元首，也不吝公开流露他们普通人的一面。\n\n平等,尊重,谦卑,人性,政治\n\n英国首相卡梅伦和纽约市长布隆伯格一起在街头吃热狗。\n\n平等,尊重,谦卑,人性,政治\n\n新任台北市长柯文哲深夜单身一人搭乘捷运（地铁），乘摩托车考察市政。\n\n平等,尊重,谦卑,人性,政治\n\n2015年5月2日，时任国民党主席朱立伦自拉行李（没走贵宾通道）前往大陆参加国共论坛并会见中国共产党总书记。\n\n姿态还能再低一点吗？能！\n\n平等,尊重,谦卑,人性,政治\n\n民主国家的政治家告诉大家，他们是人，是很普通，但很可爱的人，他们可以亲近，值得信任。\n\n为什么威权国家的领导人不是这样的呢？\n\n一、他们公私不分。一旦坐到那个位置上，从早到晚从系鞋带到打伞全部有人伺候，当然费用是老百姓买单。所以，他们根本就没有百姓的生活。不像民主国家公私必须分明，上班前下班后接送孩子买菜做饭那是你的个人事情，不能占一分钱国家财政的便宜。\n\n平等,尊重,谦卑,人性,政治\n\n德国总理买菜/英国首相骑自行车送孩子上学。\n\n二、私事全部拍马匹者做完了。威权国家的所有资源都在领导的掌握下，只要他愿意，就可以随意赏赐给下属。所以，拍马屁者如过江之鲫络绎不绝，挡都挡不住。那怕系鞋带这样的事情，都有人抢着效劳。\n\n平等,尊重,谦卑,人性,政治\n\n三、百姓都是废物，也只配为领导打杂。威权国家除了领导一人英明之外，其他人都是没有思想不敢有思想的废物。这么多的废物，闲着也是闲着，就让他们干点力所能力的活，比如给领导端茶送水、打伞擦鞋、拍马屁逗逗乐之类。废物太多，领导的私事都被抢光了。\n\n四、威权国家的领导不是通过选票上台，所以不需要“秀亲民”。\n\n五、威权领导不是人，是神！威权国家的统治靠的是武装维稳和愚民宣传、个人崇拜。领导不是人，是永远不会犯错、伟大英明的神。所以需要永远保持庄严肃穆、如丧考妣，“面瘫”一点也不大要紧。\n\n六、防备政敌的需要。威权国家的官僚中总有“阴谋家、野心家”，个个都是“两面人”，表面上一团和气，背后天天在搜集对手的黑材料。所以，不露真情也是官场自保的的不得不然。\n\n平等,尊重,谦卑,人性,政治\n\n这恐怕是世界上最大的单人伞了。不过，前面那人带上手铐就不枉后面那把手枪了。\n\n平等,尊重,谦卑,人性,政治\n\n再看看这位猴王是不是和上面那位帝王神似？当然，猴王更可爱一点。\n",
			"post_id": 731,
			"date_added": 1462532419
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}