{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1555194783_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1555156444_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1555759517_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1
	},
	"next_comment_id": 24,
	"comment": {
		"1554925733_1PZnbAYUg4AzDgJU4gtTupekoaNp1Mwizi": [
			{
				"comment_id": 1,
				"body": "#### [This Question on KxoQA](/1PHBjZSAc6mHDMkySJNs3XeSXUL7eY7Q7W/?/1HfXMzGHoz36sQBw7WqLSdxwq1agwWVR27/1PZnbAYUg4AzDgJU4gtTupekoaNp1Mwizi/1554994486703)",
				"added": 1555138667
			}
		],
		"1555156444_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 2,
				"body": "> [klu9](#comment_151_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): I don't know how possible it would be, but adding other ID providers needs to be made easier for regular users. At the moment it apparently involves a zite owner doing stuff with a Coffeescript compiler (among other things). Probably easy for developers, but for ordinary bloggers etc it's a bit steep.\n\nThe stuff with the CoffeeScript compiler is annoying, but it's only for zites the use CoffeeScript - but all the official zites use it, so yeah....\n\nBtw, there's really no possible way to make this process any easier, *unless* -- **Idea** (@gitcenter @zerolstn @glightstar): What if for the \"certSelect\" command, it automatically uses the id's available in a config setting either in content.json or user's content.json (if we choose users content.json, we'd potentially be relying on merger zites' logins, and we'd have to agregate those - so it would probably be better to put in root content.json).\n\nThe other problem that we have is - all of the \"official\" zites (nofish's zites) only allow for ZeroId. I tried adding support for KxoId to ZeroTalk I think, but @nofish: I don't think accepted my PR.",
				"added": 1555194018
			},
			{
				"comment_id": 3,
				"body": "Here's my PR for adding KxoId to ZeroTalk: https://github.com/HelloZeroNet/ZeroTalk/pull/76",
				"added": 1555194321
			}
		],
		"1555000915_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": [
			{
				"comment_id": 4,
				"body": "> [kaffie](#comment_831_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I'm not sure I get the appeal? It just looks like it adds extra bullshit requirements on top, making it more difficult to develop sites, not less.\n\nWell... for inexperienced devs who don't know how to use npm, gulp, and browserify, yes. But for devs learning these things, or experienced devs who don't want to have to setup gulp and browserify every time, then no.\n\nAdditionally, there is a reason why people - like me, gitcenter, zerolstn, glightstar, millchan, etc. - use npm and gulp (or webpack)... because literally every package for javascript uses npm, and JS transpilers are *written* in JS, as well as a bunch of other JS dev tools. It's crappy, but if you want to use libraries and want to easily import them or use JS tools like Babel, then you have to deal with this.",
				"added": 1555213929
			}
		],
		"1553138703_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": [
			{
				"comment_id": 5,
				"body": "> [lavaphox](#comment_17_13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm): prob: i cant find search bar when i resize window width to 700px or lower\n\nYes I know. I'll be working on that soon. Thanks!",
				"added": 1555236967
			},
			{
				"comment_id": 6,
				"body": "> [ssdifnskdjfnsdjk](#comment_791_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Due to deleting channel and then editting data.json (as mentioned in previous comment) to change channel of the videos to newly created one, i can no longer see other people comments under my video, only mine comments.\n\nI don't own the Ecology channel's merger zite - so I'll have to have you make the changes in your data.json file on there.\nOk, so go in your data.json file on the Ecology channel and change `1553291060684` to `1553290923372`. Then, go to Ecology's zite and in sidebar sign your content.json file (I believe you had to do this before, so hopefully you know how - ask me if you don't).\n\nOnce you do this, everything should be fixed.",
				"added": 1555554497
			}
		],
		"1555670435_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 7,
				"body": "Just as a sidenote: I'm a **native** English speaker, and I still call merged zites \"merger zites\". I think nofish has used it interchangeably or mistakenly used merger for merged in the past.\n\nHonestly, I agree that we should come up with less confusing names.",
				"added": 1555673569
			},
			{
				"comment_id": 8,
				"body": "Btw, the reason I call merged zites \"merger\" zites is because they merge *themselves* into the main zite. They do the *merging* to themselves *into* the main interface zite.\n\nBut, it also makes sense to call the main interface zite a merger if you think that *it* does the *merging* of merged zites.\n\nMy main point is this: We can't really determine which word should be used (merger vs. merged) by using logic or definitions because they **both** logically work\nSo, yeah.... basically, imo, the words need changed.",
				"added": 1555674710
			}
		],
		"1555759517_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 9,
				"body": "> [caryoscelus](#comment_132_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Even with many people, it shouldn't be too hard to find a peer with least delay; you may need to run a lot of nodes to make sure you get the origin, but i wouldn't call that next to impossible. But then, with current 0net scale, \"a lot\" isn't even that much for someone really interested. [...]\n\nIt **does** work through tor.\n\n----\n\nJust as a sidenote, gitcenter, anthyg, zerolstn, thunder, and me started this project around 5 months ago, and I decided to get on (pester) gitcenter to finish it, since it was literally almost done. I'm glad it's been released!",
				"added": 1555777486
			},
			{
				"comment_id": 10,
				"body": "I'm testing out streaming from StreamZ here: [/1BTZh5pymEKzMYr3qgDtgr4dMmap77QvEs/?/watch/1MuMmTMP87Zp6gJAeUxmfFoPPUZpCxarS2/6anw656606t/Livestream%20Test%20-%20Krixano](/1BTZh5pymEKzMYr3qgDtgr4dMmap77QvEs/?/watch/1MuMmTMP87Zp6gJAeUxmfFoPPUZpCxarS2/6anw656606t/Livestream%20Test%20-%20Krixano)",
				"added": 1555780569
			},
			{
				"comment_id": 11,
				"body": "Sorry guys, still trying to fix stuff. New URL for my stream: http://127.0.0.1:43110/1BTZh5pymEKzMYr3qgDtgr4dMmap77QvEs/?/watch/1MuMmTMP87Zp6gJAeUxmfFoPPUZpCxarS2/tyui0n2qwp9/Testing%20Livestreaming%20%232%20-%20Krixano",
				"added": 1555781797
			},
			{
				"comment_id": 12,
				"body": "Me and glightstar's streams are being restarted due to a new update to StreamZ that should lower the bandwidth required to stream videos (by switching from base16 to base64 encoding).",
				"added": 1555790417
			},
			{
				"comment_id": 13,
				"body": "> [ssdifnskdjfnsdjk](#comment_801_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): When someone start a stream it means his identity can be paired with his IP address by the stream clients/watchers? peermessage itself allows this even i am not using streamz?\n\nPeerMessage works through Tor, **and the ip address listed when using Tor is an onion address.** Additionally, the ip of where the original broadcast happened isn't stored - only the ip of the peer who sent the broadcast to you.",
				"added": 1555791344
			},
			{
				"comment_id": 14,
				"body": "> [k3z0](#comment_2_1DgRMcgsHLQfLfsXGKkFVnSoFtEYPpnkeb): Btw. what happens to streams after they finish for later view?\n\nThey aren't saved yet, but this is a feature already on the backlog and will be added in the future.",
				"added": 1555793098
			},
			{
				"comment_id": 15,
				"body": "Go to this link to see currently active streams: http://127.0.0.1:43110/1BTZh5pymEKzMYr3qgDtgr4dMmap77QvEs/?/search",
				"added": 1555802819
			},
			{
				"comment_id": 19,
				"body": "> [toyata](#comment_56_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1): \"StreamZ is currently closed-source, and will be released open-source in a year.\" [...]\n\nI'm guessing you have a problem with closed-source software? lol.\n\nGiving reasons, letting us know *why* you'd rather it be open-sourced from the beginning, etc. is a much better argument than insulting us, btw.\n\nThere are some people on ZeroNet who like to make clones of zites *without any modification* and try to make other's believe it was their own code. E.g. YouTube (clone of KopyKate), Peeper (clone of ZeroMe Plus), Snifferdog (clone of Kaffiene), a chinese clone of Important Zites (even after I added multi-language support), etc.\n\nSo... we are going to release this as open source, but only after a certain period of time. I think this is a good middleground, imo.\n\nBtw, I think if you ask us and we know you well - we'll give you the source code (I'll have to check with the other's on this though).",
				"added": 1555834158
			},
			{
				"comment_id": 20,
				"body": "> [1pgallery](#comment_65_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE): people can still clone without source, and could easily switch out images/text, I personally don't think your points about open/closed sourcing Zites are valid. As developer of a ZeroNet service (1+Gallery and GalleryHub+), the reason the available source isn't always up-to-date on Git Center is mainly just that I sometimes forget to sign :-)\n\nThe reasons why aren't valid? Or the ability to even keep a zite closed-source in the first place isn't valid? There's a difference.\n\nYes, sources are technically already open - so what's the actual problem here? lol.\n\nBtw, how I get around this is by hiding a line of code in my zites - where if the zite address is different than expected, I give a **notification that the zite is a clone.** This at least forces a person to search for and delete this line, which requires effort. Sources are also minified - requiring more work to read and modify the sources. And I don't allow direct cloning... so either the person needs to copy the sources over, or has to setup the dev environment (npm and gulp).\n\nIt'd be one thing if this zite was like ZeroBlog where it's supposed to be cloned. But it's not. It's more like a service (like KopyKate, KxoVid, ZeroMe, etc.)\n\n**IMO, other people shouldn't get credit for work they didn't do - PERIOD.**\n(especially when nobody's getting any money off of the hours of work we're putting in - so the least people can do is not steal it and claim it as their own)",
				"added": 1555875452
			},
			{
				"comment_id": 21,
				"body": "> [robione](#comment_225_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): so it records the entire browser screen?that doesn't seem right since you ask for x,y in pixels.some simple JS could calculate the size of the box you draw, and pass it as the pixels to the page, no?OBS would be great.\n\nNo, I'm saying the **browser** handles what's recorded. These API's let websites access the phone's camera or screen for recording, but it has to go through the browser because of sandboxing/privacy/permissions. Website's can't directly access cameras or the screen - they must go through a browser API.\n\nThe resolution is *given to the browser* so that the browser resizes the screen recording to the correct *output* size. Then the browser just hands the recorded blobs to the website to be sent over via PeerMessage and displayed on the watcher's screen.\n\nLook up what MediaStream and MediaRecorder is.",
				"added": 1555996377
			}
		],
		"1538339767_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [
			{
				"comment_id": 17,
				"body": "> [slim2k](#comment_2_1HiD82hP36YF93PEqKcgdgfgmAq8UigrjD): This is on Debian stretch: [...]\n\nThe security vulnerability was fixed many months ago... I have no idea if the snap was updated - and I don't believe the snap is even official anyways (meaning... it's likely not supported by nofish). As long as you are on Rev3616 or higher you are fine. You can see what revision you are on by clicking the 3 dots menu on ZeroHello.",
				"added": 1555814436
			}
		],
		"1555707064_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 18,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_26_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"universal basic income\"???????????????????????????? [...]\n\nWow... your thinking isn't so rational either.",
				"added": 1555815126
			}
		],
		"1556123202_19DYn6cniSuoTXfWAHkFPDcEtim51Bgg8B": [],
		"1556136561_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": [
			{
				"comment_id": 23,
				"body": "A portion of KxoNetwork's code - the part that does the signing of ids - isn't open-source *currently* - in the future it will be.",
				"added": 1556161142
			}
		]
	},
	"comment_vote": {
		"830_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"402_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"422_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"423_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"3_1KoFQ8qs1bvxJ3XNAuT1yJYcXiUgzTnFn9": 1,
		"2_1DgRMcgsHLQfLfsXGKkFVnSoFtEYPpnkeb": 1,
		"425_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"426_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1270_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"430_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1
	}
}