{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1584935552,
			"title": "Get naked",
			"body": "Why ya'll stressing, we gonna rob and fuck a ton of bitches.  Dick or gun.  I already been posing as military humvee, they dont take a second look bc the military is basically retards that didn't qualify for a regular job.  Much like cops.  Trump is a retard lmao, he's trying to be a boomer shitposter. It's cringe, his second account of Qheer anon is just terrible for national security.",
			"added": 1584935551
		},
		{
			"topic_id": 1584939910,
			"title": "Does anyone else want parents to die?",
			"body": "I live separately but both my parents sound like I did when I was a juggalo 14 year old except it's always news for them, but when I ask for source documentation they are lost.  Fox news said it, well, what study?  I'll check it out.  Oh no you need to watch fox news 18 hours a day to know the truth.  LOL, no thanks.  Where is the study I can read in 5 minutes?  Did Fox news give links to that study?  Did you read it?  Nope, they just trust it.  I don't give a shit about politics bc it's all gay nigger shit but if you do try to fearmonger me, you better back your shit up with not only the speak, but several hours of background checks of who that person is, the information, and  being skeptical on why they might have said it.  \n\n99% of it is fake news, they told me months ago some bat decided to spread a common flu and it was somehow super strong.  4 Months later, my calculator still doesn't register bc it's such a small fraction of people even effected.  My huge cock has killed more people than corona virus due to pelvic separation. Nothingburger.",
			"added": 1584939908
		}
	],
	"topic_vote": {
		"1584640277_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": 1,
		"1584818151_1LnUZ9Csee6oXiuNsZXXWvtBTeT3qHFT4y": 1,
		"1584939910_1LyiVyfhYN2tEhwMJRCcxEFyBekXbqcMk7": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1584640277_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 1,
				"body": "You have a 1 in 600,000 chance of catching it in a major population. 7.8 billion people divide by 330,000 cases.  You have a 98% chance of surviving if you do catch it unless you have pre-existing conditions like, you are gonna die anyway.  If you aren't a retard and actually wash hands and use food safety, bc most people cross contaminate and weaken themselves.  99.999999999% chance of surviving.  Good luck everybody, I'm sheltering in place, I can';t take the risk of 0.00000000000000001 of dying, gonna go ride my motorcycle to clear my head.",
				"added": 1584931904
			},
			{
				"comment_id": 2,
				"body": "> [anonymous1973](#comment_3_17uEjJm6477fBX1thzLmUEBpG59fz6ZN3R): Banking system collapse\n\nmore like renters lose their scam sites.  lol, 800 hostile people at once your dead dude.  Lots of \"renters\" are giving 2-3 months with no pay, but they will be killed on month 4 at te mention of kicking them out.  Guess we don't deserve land.  Secondly, we did it our selfves, only so many people can fit.  Wanna have 12 kids?  Enjoy the india type living unless you got the money.  To bad they produce shitty kids.",
				"added": 1584934697
			}
		],
		"1584935552_1LyiVyfhYN2tEhwMJRCcxEFyBekXbqcMk7": [
			{
				"comment_id": 3,
				"body": "I know it's trump bc his phone is wide open and he downloaded my app.  Whata boomer.  I don't care if zuckerberg listeners to me i got nothing to hide.  LMAO.  How about poor boy rural america?  I sold that shit though, fuck trump.",
				"added": 1584935746
			},
			{
				"comment_id": 4,
				"body": "I got 200k off it, way better than i expected wen i made the kangaroo with stalone face app.",
				"added": 1584935844
			}
		],
		"1584818151_1LnUZ9Csee6oXiuNsZXXWvtBTeT3qHFT4y": [
			{
				"comment_id": 5,
				"body": "cia fearmongering site.  zero good info.",
				"added": 1584936202
			}
		],
		"1584854478_1NrpsRRGN5SiUCgcTqaw2sJZnSv2CJQz3h": [
			{
				"comment_id": 6,
				"body": "what do you want i will send you link in drive.  Let google take te brunt lol.",
				"added": 1584936380
			}
		],
		"1584826915_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 7,
				"body": "When society fails.  I myself have become a robbery type person.  Nt gonna give be food stamps bc I can't go to a 8 hour class 6 hours away, I'll take what I'm owed.  I have 30 years of working btw.  I'm into robbing my friends, just get them to increase insurance before you do it.  LMAO.",
				"added": 1584936622
			}
		]
	},
	"comment_vote": {}
}