{
	"next_comment_id": 6,
	"comment": [
		{
			"comment_id": 1,
			"body": "Thanks for your comment.\nWhy do any organizations have to pay taxes? Why should churches only be exempted?\nInfrastructure: please take a [moment to watch](https://www.youtube.com/watch?v=m1gninLwFEM)\nMy position doesn't point a gun at your head and then expect you to move if you disagree. 'Might is right' is a compelling act, but not a compelling argument.\nIs it ever good to break the law?\n",
			"post_id": 29,
			"date_added": 1534726953
		},
		{
			"comment_id": 2,
			"body": "Rape is committed by one human against another and in doing so he is making a conscious choice. This blog isn't focused on acts of nature (unless man made), it's focused on political relations. Natural tornadoes don't make conscious choices and/or convince people that their devastation is good for society.\nWhat does taxation mean to you?",
			"post_id": 32,
			"date_added": 1534727500
		},
		{
			"comment_id": 3,
			"body": "> [nekololi](#comment_1_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): diaspora is a federated network. each federated instance of it has its own rules and management. like email providers. you were only locked out of one federated instance. it was probably a shitty one. but i couldn't tell you if there is a good one to choose instead.\n\nI see, thanks for the info. I may, may not, spend some time seeking out a more free speech oriented instance. Combined with the necessity to individually filter out foreign language posts diaspora has proven to be troublesome compared to ZeroNet ... which is unfortunate given the inspiring original idea ...",
			"post_id": 35,
			"date_added": 1536884267
		},
		{
			"comment_id": 4,
			"body": "> [krakodeal](#comment_3_127XxNDivWJX4hUWTHGSsiW1xxczYp8cWu): Both statements are false. It never was an effective alternative. And diaspora's \"lot of traction\" is nothing compared to a facebook popularity.\n\nWhen it first appeared it offered the most 'Facebook' like experience that I had seen (perhaps you know of others at that time?). Considering the differences in terms of commercial aspirations I felt, as an end user, it was a great attempt to provide a free p2p alternative. By 'effective' I'm referring also to it's censorship resistance. I don't expect anything that enables genuine free speech to be 'popular', that's why such enabling technologies are so important.",
			"post_id": 35,
			"date_added": 1542672670
		},
		{
			"comment_id": 5,
			"body": "> [1bfqutudhtexlka](#comment_1_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): the deep state must be removed from the roots\n\nand the roots are?",
			"post_id": 114,
			"date_added": 1578074179
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}