{
	"next_comment_id": 5,
	"comment": [
		{
			"comment_id": 1,
			"body": "Heey, i followed your search engines development from the start, and i was the guy behind ERR0R but for some reason i couldnt update the site so i decided to start a new project, later Rabbitsearch, not ever published, but the site had search functionality, search into categorys, tags, changable urls for admins of sites, but again i ran into teh same problem, but anyways, i wanted to ask you if you are searching for any logo, since i am a graphic designer and i like your site.\n\nGreetings, infect.\n\nPS: Don't get me wrong, the logo are totally free :)\nPSS: i cant seem to get zeromail work..",
			"post_id": 45,
			"date_added": 1503689577
		},
		{
			"comment_id": 2,
			"body": "\n> [kaffie](#comment_43_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Sure. If someone wants to help contribute to the look and feel of Kaffiene, I'm all ears. Any contributions you'd like to make are fully welcome.\n> RabbitSearch sounds pretty neat. I'd like to see what you have done. The big issue with Kaffiene I'm facing is updating the index in an automated and useful manner. I'm way behind on including zites, so there needs to be a better way of gathering and tagging them.\n\nCool, i will make something for you :) wich colors are prefered? also the rabbitsearch wasnt really that special, it was based upon zerotalk",
			"post_id": 45,
			"date_added": 1503800499
		},
		{
			"comment_id": 3,
			"body": "Hey, i was coding a theme, and i ran into something i cant figure out, the search results, the feature where it shows the peers, now its above the sitename, but i need it under the sitename, just above the tags, i found that it is coded into the javascript, but im not very good at javascript, so ca you please tell me, how can i fix this?\n\nits because when the window is resized to a smaller size, the peers and sitename will overlap each other, trying to make it look good on small screens :)\n\nPS: im making a theme where you can easily change the colors, im not good with lighter colors so..  it's mostly black..  because it looks good with alot of colors, and white, and one other color you can easily swap with another color :) im gonna try to make a cyberpunk theme too (cyberpunk like in the animes right? )",
			"post_id": 45,
			"date_added": 1503988658
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}