{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Internet sem operadoras: o que é uma Rede Mesh ou \"rede em malha\"?",
			"body": "Você sabe a diferença entre uma rede centralizada e uma descentralizada? Já ouviu falar em Redes Mesh ou em malha? Esses dois últimos conceitos são possíveis maneiras de deixar as telecomunicações mais baratas e confiáveis. Imagine se cada smartphone fosse um ponto de repetição de sinal e, quando todo mundo estivesse com o seu ligado, uma rede se formaria sem a intervenção de uma operadora ou qualquer controlador central. Isso seria uma Rede Mesh ou em malha, uma vez que não contaria com um núcleo emissor de sinal do qual todos os receptores dependem.\n\nSe para você não ficou muito claro, usando o exemplo das redes celular que temos atualmente, existe uma rede “semi-centralizada” que nos permite conversar, mandar SMS e usar a internet em nossos smartphones.\n\nAssim, sempre que precisamos de algum serviço, nossos aparelho se conectam à torre mais próxima de uma operadora e, a partir dessa torre, você é conectado à outras pessoas e a outros serviços. Isso quer dizer que, mesmo que você esteja ao lado de um amigo e fizer uma ligação para ele, o seu aparelho vai se conectar a essa torre da operadora e ela é quem vai conectar você a ele.\n\n#Sem núcleos\n\nEm uma rede descentralizada nos padrões de uma Mesh, todos os celulares atuariam como uma torre de operadora e como celulares comuns ao mesmo tempo. Assim, se você ligasse para seu amigo ao seu lado, os aparelhos se conectariam diretamente, sem o intermédio de ninguém. E se seu amigo estivesse muito longe, sua voz viajaria de celular em celular pela cidade até atingir o colega.\n\nHá a possibilidade ainda de construir pontos de emissão para deixar a rede mais estável. Assim, se um celular que estivesse no meio do caminho entre e você e seu amigo se desligasse, sua chamada não seria interrompida. Nesse caso, a rede Mesh seria construída toda a partir desses pontos de emissão que se conectariam um ao outro, mas sem funcionar como uma operadora tradicional, que liga fibra ótica em cada uma de suas torres e, em seguida, conecta todas elas a uma central.\n\n#Exemplo a seguir\n\nHá estruturas que funcionam dessa maneira em São Francisco CA, nos EUA, que conectam cerca de 400 mil usuários à internet. Assim, o local espalha o sinal de um único roteador e os repetidores da cidade espalham essa banda por todos os cantos. Esse modelo de rede está sendo padronizado internacionalmente e há expectativa para que ele substitua ou se torne pelo menos uma alternativa ao 802.11, sendo nomeado 802.11s.\n\nAté o momento, há poucas experiências feitas nesse sentido. Ainda assim, o modelo não deixa de ser promissor, principalmente por prometer acabar com as falhas em larga escala, o que é bastante fácil de acontecer nas redes atuais que, quando algum cabo subterrâneo se quebra, estados inteiros ficam desconectados da internet.\n\nNas redes do modelo Mesh, isso não aconteceria tão facilmente, pois quando um ponto de acesso apresentasse problemas, outros milhares poderiam fazer o seu trabalho. É nesse ponto que as redes desse formato se mostram mais resistentes. Por conta disso, uma pesquisadora da Universidade de Harvard, Primavera de Filippi, nos EUA, publicou recentemente um artigo explicando as vantagens desse tipo de rede na revista Wired. Ainda assim, ela conta que, até o momento, não há exemplos muito bem-sucedidos por não haver estudos suficientes na área e um modelo padronizado para controlar todo o tráfego.\n\n- Fonte: https://www.tecmundo.com.br/internet/54716-internet-operadoras-rede-mash-rede-malha.htm",
			"added": 1577762925
		},
		{
			"topic_id": 2,
			"title": "Construir um Satélite - Dados importantes.",
			"body": "- http://labdegaragem.com/forum/topics/construir-um-sat-lite-dados-importantes\n- https://gateway.pinata.cloud/ipfs/QmeWreaJFJ3fotmvCvqYADb1FHaTPbzJRwuZms2ZtQHZNt",
			"added": 1577763107
		},
		{
			"topic_id": 3,
			"title": "Aprenda a criar um “supercomputador” com vários Raspberry PI",
			"body": "https://web.archive.org/web/20190420083341/https://pplware.sapo.pt/informacao/aprenda-a-criar-um-supercomputador-com-varios-raspberry-pi/",
			"added": 1577763488
		}
	],
	"topic_vote": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1
	},
	"next_comment_id": 5,
	"comment": {
		"2_136d658NYQsvMuyFwvc2sbrwe56nZ9F4TM": [
			{
				"comment_id": 1,
				"body": "#CubeSat\nUm CubeSat é um tipo de satélite miniaturizado usado para pesquisas espaciais e comunicações radioamadoras. Os CubeSats normalmente possuem volume de 1 litro e massa de até 1,33 kg. Normalmente, esse tipo de satélite usa componentes eletrônicos \"de prateleira\".\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/CubeSat.html",
				"added": 1577763181
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 2,
				"body": "#Jogador Nº1 - Ernest Cline\n\nUm mundo em jogo, a busca pelo grande prêmio. Você está preparado, Jogador número 1? O ano é 2044 e a Terra não é mais a mesma. Fome, guerras e desemprego empurraram a humanidade para um estado de apatia nunca antes visto. Wade Watts é mais um dos que escapa da desanimadora realidade passando horas e horas conectado ao OASIS – uma utopia virtual global que permite aos usuários ser o que quiserem; um lugar onde se pode viver e se apaixonar em qualquer um dos mundos inspirados nos filmes, videogames e cultura pop dos anos 1980. Mas a possibilidade de existir em outra realidade não é o único atrativo do OASIS; o falecido James Halliday, bilionário e criador do jogo, escondeu em algum lugar desse imenso playground uma série de easter-eggs que premiará com sua enorme fortuna – e poder – aquele que conseguir desvendá-los. E Wade acabou de encontrar o primeiro deles.\n\n- https://gateway.pinata.cloud/ipfs/QmTehQm8gj6QgR55bFnwyWU7BnXsspNsqB2HDTMAtGXMrW",
				"added": 1577763679
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 3,
				"body": "Os [Prêmios dos Problemas do Milênio](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Millennium_Prize_Problems.html) (em inglês: Millennium Prize Problems) são sete problemas matemáticos estabelecidos pelo Instituto Clay de Matemática. A correta solução de qualquer um destes problemas resulta em um prémio de um milhão de dólares entregues pelo Instituto a quem realizar esta resolução. Atualmente, apenas a conjectura de Poincaré foi resolvida, em 2010, pelo matemático russo Grigori Perelman, que recusou tanto este prêmio quanto a Medalha Fields em 2006. \n\n- https://gateway.pinata.cloud/ipfs/QmbSn7or76LsBqchbc4WUZkgqy83mQhzmkGGwcyUVEZfGZ",
				"added": 1577764298
			},
			{
				"comment_id": 4,
				"body": "#Problemas de Smale\nOs chamados [problemas de Smale](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Smale's_problems.html) são uma lista de 18 problemas matemáticos não resolvidos propostos por Steve Smale em 2000. Smale compôs esta lista em resposta a um pedido de Vladimir Arnold, então presidente da União Matemática Internacional, que pediu a vários matemáticos que listassem os problemas matemáticos mais interessantes para o século XXI, inspirado na lista de [problemas de Hilbert](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Hilbert's_problems.html) propostos em 1900.\n- https://gateway.pinata.cloud/ipfs/QmdcQUMfhzF4X9aFgsGG3jNPowJe3UhPc9SfjF67K5vmo9",
				"added": 1577764627
			}
		]
	},
	"comment_vote": {}
}