{
	"next_post_id": 7,
	"next_comment_id": 45,
	"next_follow_id": 14,
	"avatar": "jpg",
	"user_name": "SadLoli",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "A random ZeroNet user, now motivated by the shock of my life to better the things I love!\n\n---\n\n_**[SadMetadata](/19dfPUtRhw6KxzAYBzfntburwuZDQULMZ3)(in development)**_\n\nA backup of all metadata on sadpanda/exhentai searchable by gallery url.",
	"post": [
		{
			"post_id": 1,
			"date_added": 1564504220,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1564505863,
			"body": "Anyone here want to join the effort of building an archive of sadpanda/exhentai here on zeronet?  \n  \nWhere do we best coordinate a project like this? Are there already people here trying to do that and if so could someone point me in their direction?\n  \nEvery help is appreciated, but I'm especially searching for someone with zeronet development knowledge right now.  \n  \n---\n   \nFarewell Sadpanda,\n*see you, space cowboy...*",
			"date_added": 1564505861,
			"meta": "{\"img\":\"700,700,aaacccddd898565333fffeeecba7872226769b9444aca,0112321103140256721028142166217718716672672246666766697A6667660B26666739453033C3CD5DDBEECCEE9CECCCCC\"}"
		},
		{
			"post_id": 1564582941,
			"body": "The fist version of [SadMetadata](/19dfPUtRhw6KxzAYBzfntburwuZDQULMZ3) is now online!\nIt is a backup of **all** metadata on sadpanda/exhentai (which includes e-hentai as well), made hours before it died.\nThe database files are optional, so please pull the '0'-icon on the top right to the left, enable the 'Download and help distribute all files'-option and wait until all database files are downloaded.\nYou cannot find metadata, that is in database files, that you haven't downloaded yet! In addition the more people do this, the faster it will load for everyone in the future so it would really help the site out.\n\nFeatures include:\n- Ugly IU (will be worked on)\n- Searching metadata and tags by custom SQLite query(shown in image)\n- Finding metadata and tags by metadataID(which is the latter part of the exhentai url to the gallery)\n\nFeatures planned:\n- Better UI\n- Browsing the available metadata.\n- Searching for multiple at once metadataIDs.\n- A way to customize SQLite Queries for people with no idea what SQLite is.\n- Syntax highlighting for the search by SQLite query page\n- Better documentation(currently there's none at all)\n\n----\n\nBug reports and contributions as well as advice and seeders are always welcome.\n~SadLoli",
			"date_added": 1564582938,
			"meta": "{\"img\":\"772,700,edeeeeffffeedddddc,000122111111222211312222221111222222145122222214412222223111222222111122222211112222221111\"}"
		},
		{
			"post_id": 1564690547,
			"body": "A new update for [SadMetadata](/19dfPUtRhw6KxzAYBzfntburwuZDQULMZ3)!\n- SadMetadata is now on ZeroSites under [Services](/Sites.ZeroNetwork.bit/?Category:9)\n- I've redone the way the json files were being stored.\n- There is now a convenient button that you can use to automatically download the metadata files\n- It will now show you how many galleries you've already downloaded.\n- I found out that some files have not been parsed correctly before and weren't included in the json files at that time... They now are\n- The UI is still terrible\n\nCuriously the number of gallery entries in the big ~500MB json file is: 691733 while the total number of galleries in the split up json files is 690583. That means that somehow 1150 galleries gone missing in splitting the file into smaller ones. Gonna look into that later.",
			"date_added": 1564690543,
			"meta": "{\"img\":\"900,110,fffeee,0000001000\"}"
		},
		{
			"post_id": 1564772078,
			"body": "# Sad panda/exhentai is back online!\n\nhttps://exhentai.org\n## In other wonderful news AllTheFallen are also online, again under a .moe domain!\n\nhttps://allthefallen.moe\n\n---\n\nTruly a wonderful day we have today!",
			"date_added": 1564772073
		},
		{
			"post_id": 1564987320,
			"body": "Just a heads up for everyone on here.\n[Recently cloudflare has decided to deny service to 8chan](https://new.blog.cloudflare.com/terminating-service-for-8chan/). There is discussion of moving to an replacement on zeronet which is a (pretty out of date) clone of millchan.  \n  \nWhile that means that zeronet will get tons more activity and a lot of awesome and pretty cool people, it also means that there's a high probability that the **dipshits**, that ruined 8chan for everyone, will also come here.",
			"date_added": 1564987314
		}
	],
	"post_like": {
		"1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6_1564449395": 1564574659,
		"1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6_1565163630": 1565166313
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Wormstweaker: Sweet! Gonna give it a try.\nAre you by any chance interested in helping?",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564506854
		},
		{
			"comment_id": 2,
			"body": "@Wormstweaker: You don't necessarily need to have knowledge of zeronet to help. Spreading word around would also be of great value especially here, where we need seeders to remain online. Getting more people also increases the chances that someone with actual skill might choose to help.\n\n>Oh and crap, this is more of an image board\n\nI've been around, I actually prefer imageboards to reddit.",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564507349
		},
		{
			"comment_id": 3,
			"body": "@SadLoli: Why are your mentions of me linked by my mentions of you aren't?",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564507412
		},
		{
			"comment_id": 4,
			"body": "@Wormstweaker: Great! I think I'll post updates here on this ZeroMe account.",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564508854
		},
		{
			"comment_id": 5,
			"body": "@caryoscelus: I have a ~530 MB compressed JSON file with all metadata for all sadpanda(with a few exceptions) galleries. I want to make a searchable site by metadata ID(the locator part of the url to the gallery) and some browsing options, in the future at least.\n\n>Perhaps the only thing needed is to make sure all those big files are marked as optional\n\nWhat's the difference?\n\nAs for the images I thought of registering the galleries by hash(probably sha1, because that's what BitTorrent uses) and giving out gallery IDs, which will be the xored hashes of all images of the gallery. This way the order in which the images are uploaded will not matter. The site will not allow duplicates to be uploaded checked by hash. Unless one offers a higher resolution. \n\n>It seems like scrapping data from servers is a bigger task\n\nScraping time is over, Sadpanda is dead.",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564510272
		},
		{
			"comment_id": 6,
			"body": "@SSDifnskdjfnsdjk: Thanks, already digging through quite a bit of documentation, but more sources are always better.\nMillchan is still loading, I think I'm gonna make a post there a bit later, when I actually have something to show.\n\n> i seen this static torrent index zite\n\nI'll look into it.\n  \n  \nI already *really* like that you can see the source of each website here.\n  \nYou two seem to know quite a bit, would you or @caryoscelus: be interested in helping with development?",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564511562
		},
		{
			"comment_id": 7,
			"body": "@Sirlotaplot: Thanks! I'm happy to get this much response from here.\n>very thin silver lining to the fall of Sadpanda.\n\nI guess, so. I'm actually looking forward to the discussion on p2p alternatives that will happen, once ATF gets back up. I guess that really is a plus. I've also been looking into IPFS recently, but it doesn't seem like you can have dynamic sites there, yet. Please correct me if I'm wrong, but I couldn't find anything in that regard.\n\n>I'm running two hentai manga focused ZeroGallery hubs\n\nSweet! Currently saving space for Exhentai backups, but looks interesting. How do you reckon 1+Gallery would perform with ~50TB of shared data?\n\n\\>Millchan Engine\nWhat's the difference between 'millchan' and 'millchan engine'?",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564513105
		},
		{
			"comment_id": 8,
			"body": "@caryoscelus: \n>I don't think 0net can work with compressed JSON\n\nI didn't mean compressed as in gzip/tar compressed, but compressed as in no indentation/spaces in the json file(with those it's about 1.3 or 1.8 GB in size).\n\n>Perhaps it might be a good idea to split it, though\n\nAbsolutely the full file took forever. to sign I've split it into about 3000 files with 600 entries each. It works reasonably well, database building takes ages however. But I'm not sure if I can do anything about that.\n\n>It is also possible to not use 0net-specific stuff and just parse metadata from JS, but that might be just too slow\n\nI did the initial parsing in JS and I don't have enough fingers or toes to show you how many times the tab or even the browser crashed ; )\n\n>Most users will likely not want to seed all of the galleries\n\nFor now only the metadata. I think I'm gonna use that hub mechanic to combine it with the actual galleries.\n\n>I'm not familiar with the site\n\nSee @nekololi: s comment.\n\n> but what's their status? \n\nThey are down/offline, admins say that there is a full backup somewhere and the they'll look into more permanent storage options for the backup while telling people to get and save as much data to increase redundancy, so not sure how much the backup actually is a thing.\n\n>JS & 0net api (i still remember the pain of creating my meh engine..), but possibly i can help with some advice\n\nThanks, should I make the json files optional or required? I don't think that zeronet can tell in which file the gallery metadata can be found in and querying the data only really makes sense if you have all of it to search through, right?",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564572776
		},
		{
			"comment_id": 9,
			"body": "@Sirlotaplot: \n>blurhy's IPZN or something like it\n\nLook interesting.\n>I'd bet it can handle 10x what I'm doing now (if it's linear), but that'd still only be 4TB.\n\nThat's good to know so we could split the ~50TB into like 13 Hubs and see from there. There's also the possibility that @1pgallery manages to improve efficiency so much that we don't need the hub thing, but I guess we just have to see for now.\n>Engine one has each board be it's own zite which means you only download the ones you want\n\n@SSDifnskdjfnsdjk: \n>Millchan Engine is utilising merger sites - using \"merger\" feature of the zeronet. \n\nOh, okay thanks you two!",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564573168
		},
		{
			"comment_id": 10,
			"body": "@SSDifnskdjfnsdjk: \n>zeronet is not yet redy for large databases\n\nThe database worked fine for me(on SSD), it's ~530MB not sure if that's much.\n>Btw. i would like to help you, but as mentioned, i am not a developer nor a coder.\n\nDude, you are already helping a ton, as is everybody in this thread <3",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564573917
		},
		{
			"comment_id": 11,
			"body": "@Mg0: I guess proxies are a good poin't since they, if commercial servers, will have fast SSDs to quickly query the database.\n>just make sure to use content.json files properly. Not too many files for each\n\nHow many would you say that would be?",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564573947
		},
		{
			"comment_id": 12,
			"body": "@nekololi: \n>but would be happy to help seed as well as link any site that gets made in the process on loliguide.\n\nHighly Appreciated!\n>loliguide\n\nNice!\n\n>i don't know offhand if there is anyone with zeronet development experience who is also interested in a hentai related project like this\n\nIf you happen to find someone that does please point them in this direction. Millchan /l/ seems dead, is there somewhere else a more active community here on zeronet?",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564574501
		},
		{
			"comment_id": 13,
			"body": "@Kid Courageous: Sweet! Should I make a repo somewhere and how should be communicate?\nI've already seen that there is GitCenter, are there others on here?",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564574628
		},
		{
			"comment_id": 14,
			"body": "@caryoscelus: \n>Nah, i meant what's the distribution terms / license? Were those author-uploaded pics, \"illegal\" copies, or just anything?\n\nThat thing is difficult:\nMost stuff on there is commercial, but only really available in japan and in japanese. However some of the stuff was also from western artists.\nMost artists didn't mind it being uploaded there, while some (historically) did. Some artists (both western and eastern) used it to upload their own works on there. Many didn't.\n\n**A lot** of translators published their works(translations/edits like decensoring and many more) there. Some had their translations uploaded there of which some didn't want them to be there.\n\nSo in short: kind of?\nStrictly answering the that question is inconclusive at best:\nWere those author-uploaded pics, \"illegal\" copies?: No, except when they were.\n \nYou could think of sadpanda as a weaker enforced pixiv, if that helps.\n\n>AFAIK ZeroTalk and here are two most active places..\n\nGood to know.\n\n>split by some thematic criteria and allow users to download only parts of db they're interested in\n\nThe main purpose would be to search by id, which look like this: '/g/1330079/ea3aaac89f/'. Because most people have only downloaded the images, but not the metadata. Not sure what I can do there in terms of presorting",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564578011
		},
		{
			"comment_id": 15,
			"body": "@caryoscelus:\n>Hmm, i'm not sure what exactly is your purpose.\n\nFor now just building a site where one can search:\n- by SQLite Query\n- by metadataID\n- by multiple metadataIDs\n- by browsing through the data\n\nSo that I lean how do zeronet, basically and at some point basically this: \n>build a site on which users can upload whatever they have downloaded and then display it as it was intended\n\nAnd looking at what @Sirlotaplot: said, that'll probably either be a fork of 1+Gallery or a collaboration with it since 1+Gallery is based of 0Gallery which itself was based of sadpanda/exhentai. Doesn't make much sense to reinvent the wheel here.\n>What is the shape of metadata you've got?\n\nI'm not sure what you mean by 'shape'.\nMetadata object in js after a query:\n{\n\"title\": String,\n\"pages\": Integer,\n\"uploader\": String,\n\"href\": String,\n\"type\": String,\n\"uploadDate\": Integer,\n\"tags\":[\n{\n\"namespace\":String,\n\"name\":String,\n\"power\":String\n},\n{...}\n],\n\"SET_INFO\": String,\n\"ID\": String,\n\"PAGE\": Inetger,\n\"IS_DATA_MISSING\": Boolean\n}\n\nI'm currently signing what I have so far. And I've noticed that it takes a lot longer if I include a dbschema.json that will actually use the data to make a database. I think ZeroNet is rebuilding the database regardless of whether or not it needs to be rebuild on every signing.\nThe rebuild happens between:\n[log]- css/index.css\nand\n[log]Adding timestamp and sha512sums to new content.json",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564581579
		},
		{
			"comment_id": 16,
			"body": "Here is what I have so far:\nhttp://127.0.0.1:43110/19dfPUtRhw6KxzAYBzfntburwuZDQULMZ3\n\n(Is it working?)",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564583121
		},
		{
			"comment_id": 17,
			"body": "I also noticed that. It seems to be a bug/feature in Tor Browser.\nIf you use firefox or chrome it works.",
			"post_uri": "15BCRgfgP2Keu75BD2p7FFKB5F27r6jAVY_1564582709",
			"date_added": 1564583270
		},
		{
			"comment_id": 18,
			"body": "@Tooltoulto: Well, I'm beat. People only talked about this being specific to Tor Browser.",
			"post_uri": "15BCRgfgP2Keu75BD2p7FFKB5F27r6jAVY_1564582709",
			"date_added": 1564583751
		},
		{
			"comment_id": 19,
			"body": "@Tooltoulto: Greatly appreciated! \n\n(please tell me if it worked)",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564582941",
			"date_added": 1564583938
		},
		{
			"comment_id": 20,
			"body": "@Kid Courageous: So [GitCenter](/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t)?",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564586816
		},
		{
			"comment_id": 21,
			"body": "@Zboy: I do now!",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564582941",
			"date_added": 1564633031
		},
		{
			"comment_id": 22,
			"body": "@Wormstweaker: But it id download in the end, right?",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564582941",
			"date_added": 1564633086
		},
		{
			"comment_id": 23,
			"body": "@Mg0: Good to know, I guess I'm going to do some testing as well.\n\n@SSDifnskdjfnsdjk: Runs fine for me. It feels like 500MB shouldn't be too bad for a database. Everyone with a HDD running into issues? The search can currently only search for galleryIDs. That's why there's the beginning part of the url right in front of the search field. If you have the link to a gallery you saved, and want to know the metadata for just complete the link and hit search. You can put in '/g/1330079/ea3aaac89f/', a personal favorite of mine ;-),  to test it if you like.\n\n@blurHY: \n>wasting resources\n\nin what way?",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564634118
		},
		{
			"comment_id": 24,
			"body": "@SSDifnskdjfnsdjk: \n>Downloaded: 0.00MB\n\nOh okay, I haven't done anything to make the site download the pieces it needs, yet. So unless you press the Download and help distribute button, nothing will be downloaded. Therefore the database is empty therefore every query will return no results. \nYou can check this by running:\n'select count(ID) as TotalNumberOfGalleries from metadata'\n(without the quotes) in the 'Make your own Query here!' page and see how many galleries your database currently has.\n\n>\"(..db.|nbproject.|\\..)\"\n\nThat means that my zeronet client will not sign and publish the database that my client build for me. 'nbproject' isjust the project folder of netbeans(the IDE I use) and '\\..'tells zeronet to no sign any hidden files.\n\n@blurHY: Yeah, I think I'm gonna sort the jsons by ID rather than in a pack of 600 per file, maybe this helps.",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564673697
		},
		{
			"comment_id": 25,
			"body": "@weakish: All json files should be around 300kB or less. So a limit of 1MB should be fine.\n\n\n@Wormstweaker: \n>My 0net instance crashed a few times, but that's probably because I installed it like shit \n\nSeems to be an issue of zeronet every time a database rebuild happens with a fair amount of data maybe what I written [here](/Me.ZeroNetwork.bit/?Post/1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2/1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT/1564505863) in response to @caryoscelus: has something to do with it.\n@nofish: Is that my fault or a known bug in zeronet?\n\n>Anyway, files downloaded, and seeding\n\nðŸ‘\n\n>somehow I downloaded 627mb, instead of the 622 announced\n\nOdd. Maybe that is the total amount downloaded and counts failed downloads and webside data(html, js...) as well?\n\n>so it checks on eh if the gallery still exist, even if the metadata isn't in the database\n\nI would need to make a XHR connection to clearnet to that and I'n not sure if that works. Need to do some testing on that, but sure if it works.",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564582941",
			"date_added": 1564674318
		},
		{
			"comment_id": 26,
			"body": "@blurHY: Sounds sweet! When will this be ready? \nI thought about doing this on IPFS but decided this is more user friendly.",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564582941",
			"date_added": 1564676361
		},
		{
			"comment_id": 27,
			"body": "@SSDifnskdjfnsdjk: Just pushed an (couple of) update(s). You can now just push an button and it should download them automatically. I also reworked the structure I stored the json files such that every content.json file now only stores about 1000 files. Signing page updates now works **much** faster for me since the database doesn't need to be rebuild every god damn time.",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564688488
		},
		{
			"comment_id": 28,
			"body": "@SSDifnskdjfnsdjk:\n>Wondering if also images will be shared (somewhere, some day).\n\nI am however thinking about including the gallery thumbnails, since the guy that made the front page scrape this data is based on also made a collection of every thumbnail for each gallery that has been scraped.\n\nBut full on galleries probably not on that site, but I plan to do that eventually.",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564690780
		},
		{
			"comment_id": 29,
			"body": "@blurHY: Looking forward to that.",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564582941",
			"date_added": 1564690833
		},
		{
			"comment_id": 30,
			"body": "@Zboy: I think I already did. Can you send me a mail to test if it worked?\n\n@Mg0: I'm glad you helped!",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564694956
		},
		{
			"comment_id": 31,
			"body": "@caryoscelus: Thanks!\nGonna look into those later.",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564690547",
			"date_added": 1564695038
		},
		{
			"comment_id": 32,
			"body": "@Kid Courageous: Took me a while, but I have now made a [GitCenter repo](/1MqTXukdSULZVC6kXVwgC7pNkUum6TbmyH).\n\n@all here: I'm making a Contributors/Thanks page if you want to be listed there under the 'Information about zeronet' section please tell me that. I will not add anyone that didn'e explicitly told me they want their name on there.\n\n@Zboy: I'm getting some weird crypt errors when I visit ZeroMail... Tell me, if you already sent me anything!",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564734271
		},
		{
			"comment_id": 33,
			"body": "@Wormstweaker: Holy shit your right!!",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564690547",
			"date_added": 1564767880
		},
		{
			"comment_id": 34,
			"body": "@Wormstweaker: Judging by what @Sirlotaplot: said [here](/Me.ZeroNetwork.bit/?Post/1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2/1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT/1564505863), maybe.",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564772078",
			"date_added": 1564840362
		},
		{
			"comment_id": 35,
			"body": "@SSDifnskdjfnsdjk: Done.",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564924171
		},
		{
			"comment_id": 36,
			"body": "@SSDifnskdjfnsdjk: \n\n>unsure if board owner can give mod rights also to others and how it is done.\n\nI've gone through the source code and they can't.(but that is in development, though)\n\n>or other zites (maybe like this one)\n\n'Splash damage' was my main concern. On millchan you can just mute the board and you are done. Having these retards leak out to everywhere else will be annoying.",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564987320",
			"date_added": 1564991396
		},
		{
			"comment_id": 37,
			"body": "@SSDifnskdjfnsdjk: \n>millchan engine\n\nYeah, looked through the repo of it, too.\nApparently the development on the moderation system was started because of it.\nIt looks like millchan engine was actually rather kind of an PoC, because many of the commits in the repo break compatibility with the current hubs/boards and it really isn't up to date with the code in the repo.",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564987320",
			"date_added": 1564993745
		},
		{
			"comment_id": 38,
			"body": "@Zbroevich: Last I saw was in the 8chan /v/ thread.\nctrl+f type 'zeronet' and you should find it. If you can still access 8chan, that is.",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564987320",
			"date_added": 1565025041
		},
		{
			"comment_id": 39,
			"body": "@Zbroevich: Me neither, only getting timeouts.",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564987320",
			"date_added": 1565029741
		},
		{
			"comment_id": 40,
			"body": "Are you sure?",
			"post_uri": "1C2VBZqc7w2588wPWYq3FwRUM7SsCpFJoB_1",
			"date_added": 1565084527
		},
		{
			"comment_id": 41,
			"body": ">I know Bitcoin will be something\n\nWith the surge in popularity of zeronet, I think bitcoin will be dead within months, because of [this millchan /b/ thread](/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/1H5YxVHvcfKM4STjJwyjYaBe8qbPyR6EZr:b:9ea42cb5-fb15-4de0-a8c3-b7f25fb1af0a), which plans to have childporn inserted into the blockchain, thus making it illegal to download it.",
			"post_uri": "1GTypPCKjKG5gD1Leey2crVW92uj3krsLt_1565160563",
			"date_added": 1565166610
		},
		{
			"comment_id": 42,
			"body": "@Jaoheah: I mean you could, but someone could just port the program to put it into that other blockchain. It's more of an issue of the immutability of blockchains, which is fundamental for all cryptos, rather than the individual blockchain. \n\n@caryoscelus: Doesn't look like anyone had the balls to actually go through with it (even within the thread). But with the influx of people of questionable morals, I'm not sure if that it will keep being that way.\nNews like this would fly through the media, if that were to happen.",
			"post_uri": "1GTypPCKjKG5gD1Leey2crVW92uj3krsLt_1565160563",
			"date_added": 1565187127
		},
		{
			"comment_id": 43,
			"body": "@ulrichard: \n>All the random non-monetary stuff I saw so far was in text form, maybe even ascii art.\n\nIn the thread I referenced, they were talking about that there already is an (\"really tame\") image in there:\n>\"That image has a very low resulution and depicts a girl(she looks to be around age 15-17) flashing her boobs to the camera. Thats it. \"\n\nThere is also the transactionID/hash to it in there.\n\n>In what format would that be?\n\nThe README in [the repo](/126KYGEVcPaw9u7NKA6ZxqBUgFjGxqpF15) for it is pretty elaborate.\n>\"The file is cut into 20 byte slices. These are than encoded as retrieving addresses and put into an Bitcoin transaction.\"\n\nIn there is also a more technical explanation.\n\n\n@caryoscelus: \n>Such program would essentially contain some predefined CP picture.\nLike the negative of a photograph. The actual information would've been encoded into source code.\nIn this case the actual information is encoded into the blockchain.",
			"post_uri": "1GTypPCKjKG5gD1Leey2crVW92uj3krsLt_1565160563",
			"date_added": 1565196868
		},
		{
			"comment_id": 44,
			"body": "@Styromaniac: anime IsReaL?",
			"post_uri": "1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz_1565316257",
			"date_added": 1565354133
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS",
			"user_name": "SSDifnskdjfnsdjk",
			"date_added": 1564511260
		},
		{
			"follow_id": 2,
			"hub": "1White24UrrwQrD86o6Vrc1apgZ1x1o51",
			"auth_address": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE",
			"user_name": "caryoscelus",
			"date_added": 1564511263
		},
		{
			"follow_id": 3,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1HGtveysLbnRmqkAQWvbLMhMrroKsbh9ww",
			"user_name": "Wormstweaker",
			"date_added": 1564511264
		},
		{
			"follow_id": 4,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB",
			"user_name": "nekololi",
			"date_added": 1564511296
		},
		{
			"follow_id": 5,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp",
			"user_name": "LoliGod",
			"date_added": 1564511302
		},
		{
			"follow_id": 6,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "18UukzxVzEwd9ugyvKWYe2vud77GyL72Px",
			"user_name": "Sirlotaplot",
			"date_added": 1564512541
		},
		{
			"follow_id": 7,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa",
			"user_name": "Mg0",
			"date_added": 1564561242
		},
		{
			"follow_id": 8,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6",
			"user_name": "Kid Courageous",
			"date_added": 1564561247
		},
		{
			"follow_id": 9,
			"hub": "1KNmG5rJUGhgUJGFbLkv2B5isaqu9PrZqi",
			"auth_address": "1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE",
			"user_name": "1pgallery",
			"date_added": 1564561301
		},
		{
			"follow_id": 10,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh",
			"user_name": "Kaffie",
			"date_added": 1564561315
		},
		{
			"follow_id": 11,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di",
			"user_name": "Git Center",
			"date_added": 1564561322
		},
		{
			"follow_id": 12,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj",
			"user_name": "Nofish",
			"date_added": 1564561332
		},
		{
			"follow_id": 13,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz",
			"user_name": "Port220irq5dma1",
			"date_added": 1565353460
		}
	]
}