{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1528386725_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1534157849_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "I'm not sure they are under any obligations to do as you are asking.",
				"added": 1544181098
			}
		],
		"1532695200_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 2,
				"body": "> [happyrabbit](#comment_1_1Hd7H8VUbdieey29AGC2xLxedDiPdM7JTT): double life thats over kill\n\nthey are making an example of him to discourage others from starting a new market place.",
				"added": 1544181663
			}
		],
		"1538386317_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 3,
				"body": "Did people think it was safe to start with? so many apps and not enough people to check them.",
				"added": 1544195178
			},
			{
				"comment_id": 5,
				"body": "> [anonymouslogin](#comment_3_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Do you really think that average people think? :^)\n\nno I just wish they did, I actually use an app called bouncer so that it will auto remove permissions after you grant them, example, I can let brave browser take a picture but then revoke the permission after it's done.",
				"added": 1544539443
			}
		],
		"1544289028_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 4,
				"body": "you could just into you privacy settings on google and tell it to stop tracking you and remove the data. I have no reason to doubt this would work.\n\nI use a number of providers, gmail, outlook and protonmail. You have to give up some privacy for emails to work.",
				"added": 1544442689
			}
		],
		"1544691845_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 6,
				"body": "However, your full fingerprint is unique among the 914968 collected so far. \n\nthink i'm safe\n",
				"added": 1544712178
			},
			{
				"comment_id": 7,
				"body": "> [znnex](#comment_2_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): I think that means the opposite of what you think it does. Being easily identified out of a group of nearly a million isn't indicative of safety.\n\nactually yeah :/ I am using brave I would have thought it would be better...",
				"added": 1544715820
			}
		]
	},
	"comment_vote": {
		"1_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"40_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	}
}