{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_12v6isNzUBMu7qmZosCrKuhRgeu1qPiUbs": 1,
		"1_15ZCzHPEspA94YwXMHBrrDspmVc1RiaQJr": 1,
		"1_1Ms9usgvtM6au9xLaDNivYSyPgjjE6USW4": 1,
		"2_12DmbMA1K9H3zAyBLDyrf38KhSG7GkD9Va": 1,
		"1_1AD6remHtX8u7H4g7UsHD89AYrDYNwZG2n": 1,
		"1_1MHbzJdRSSfjeXkgDoBLvGigZiBWmrSANR": 1,
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": 1,
		"2_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": 1,
		"1_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": 1,
		"1_1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg": 1,
		"3_1P7XWfLKfZiM8ob59bB1GvCYeXujKdWKSk": 1,
		"6_1P7XWfLKfZiM8ob59bB1GvCYeXujKdWKSk": 1,
		"1_1QKoQM1N4XHQxznk8nF5pcKLZUwu7ChTE7": 1,
		"1_1DXwV6AnTivjXn2p4r1a6Rd1J7VGZKTKr3": 1,
		"3_1JRKxTnn3vj2sNKTZSzX1ou54XAwTseiFu": 1,
		"1_1JszFQz363JeWJ5zG6bqFw5nKRsei3eppo": 1,
		"1_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": 1,
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1
	},
	"next_comment_id": 5,
	"comment": {
		"2_12v6isNzUBMu7qmZosCrKuhRgeu1qPiUbs": [
			{
				"comment_id": 1,
				"body": "Então as obras são para \"demonstrar\" que somos salvos? Não faz sentido. Para quem eu demonstrarei que estou salvo e por que? Cuidado, me parece que você está caindo no mesmo erro de um certo homem do séc. XVI, o erro da sola fide.",
				"added": 1561052065
			}
		],
		"3_1CkgC7bFTCM1hW61V331Rnk1EVRpud6u87": [
			{
				"comment_id": 2,
				"body": "Não é surpresa que o lado que sempre triunfa na democracia é o comunismo. Quando isso acontece, surge os anti-comunistas não-liberais, que são chamados de fascistas pelos primeiros, e também surge os liberais de toba e tudo, que querem vencer os comunistas no papo até chegar o poder, e depois disso, torcer para que os comunistas não o substituam e roubem o poder. Nenhum deles possuem a bala de prata contra o comunismo. Os neocons estão cegos em um ideólogo duvidoso e auto-bajulador, e os liberais estão se preocupando em lacrar do outro lado, mas nenhum deles querem proibir outros partidos. Eles temem serem chamados de fascistas e anti-democráticos. Que título honroso é o \"anti-democrático.\"",
				"added": 1561052493
			},
			{
				"comment_id": 3,
				"body": "> [desenhoeanime](#comment_6_1KoFQ8qs1bvxJ3XNAuT1yJYcXiUgzTnFn9): \n> Fora isto, o que quero é algo como libertarianismo ou anarcocapitalismo.\n\nO ancapismo não é a verdade suprema, além de ser materialista. Essa ideologia pode ser muito seduzente, mas de praticidade nada tem. Pouco me importa se estou pagando imposto ou não, contanto que a minha família tenha uma vida digna e não seja atrapalhada por marginais. Dito isso, eu nunca deixaria meus filhos à mercê de uma sociedade teórica e semi-revolucionária. O que os adeptos dessa ideologia não entendem é que os bilionários, de maioria socialista, embora sejam a favor do capitalismo para eles, será o contrário quando o assunto não é a sua própria família, ou seja, eles serão uma ameaça à esta sociedade hipotética. Não ficarei surpreso se vocês forem mortos por algum esquema de crime organizado à altura dos bilhões de dólares. Ou melhor, os super voláteis bitcoins, que seriam capazes de fazer uma empresa de segurança privada falir em uma semana e te deixar, de novo, à mercê dos mega bilionários. Ou poderiam escolher o ouro e rezar para que os extratores não manipulem o preço, ou até mesmo uma moeda centralizada em bancos privados. De novo, estarão à mercê de interesses privados. Há muito a ser criticado nessa ideologia, mas por hoje basta isso.",
				"added": 1561053105
			}
		],
		"1_1CcSAqVEXCdPyYKP4d7JHeCFxBB4bt7jtM": [
			{
				"comment_id": 4,
				"body": "Eu conheço o redecanais, mas ultimamente ando assistindo na assistirseriados.net, assistir.me, tuaserie.com, e recentemente instalei o Stremio e o Popcorn Time que indexa filmes e séries de vários sites em torrent para assistir enquanto baixa. Recomendo estes.",
				"added": 1566510827
			}
		]
	},
	"comment_vote": {
		"3_1NhJGZ6PxfCbBJg7pEaCr5R9pc3WMicnVY": 1,
		"2_1CkgC7bFTCM1hW61V331Rnk1EVRpud6u87": 1,
		"4_1NhJGZ6PxfCbBJg7pEaCr5R9pc3WMicnVY": 1,
		"3_1CmKnRkBqGcBLEJomTcERHEMtR77TTv3ag": 1,
		"7_1EYJ26A4UeiqMgW2ug2d94kpmp3UtJEdCK": 1
	}
}