{
	"next_topic_id": 27,
	"topic": [
		{
			"topic_id": 1567130430,
			"title": "First Post",
			"body": "This is for DMD file requests from our catalogs, comments etc...\nhttp://127.0.0.1:43110/1BVQqm21fV2K3yw5iaXvoZk23mho1vaqHv\nhttps://dmd.delivery\nWe are currently uploading any requests to ZeroUp\nhttp://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc\nThanks!",
			"added": 1567130429
		},
		{
			"topic_id": 1567219503,
			"title": "Magazines Set1 about to come down on ZeroUp",
			"body": "",
			"added": 1567219501
		},
		{
			"topic_id": 1567220532,
			"title": "Books Set2 now uploaded to ZeroUp",
			"body": "http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/?Latest",
			"added": 1567220529
		},
		{
			"topic_id": 1567301636,
			"title": "Books Set2 and Magazines Set2 will be removed soon",
			"body": "",
			"added": 1567301631
		},
		{
			"topic_id": 1567310528,
			"title": "All media packs will now have their contents listed here when uploaded to ZeroUp",
			"body": "",
			"added": 1567310522
		},
		{
			"topic_id": 1567484746,
			"title": "Book Pack1 uploads on ZeroUp will be removed soon",
			"body": "",
			"added": 1567484738
		},
		{
			"topic_id": 1567498378,
			"title": "Magazine Pack1 is now up on ZeroUp",
			"body": "",
			"added": 1567498369
		},
		{
			"topic_id": 1567670307,
			"title": "Magazine Pack1 will be removed soon",
			"body": "",
			"added": 1567670296
		},
		{
			"topic_id": 1567708968,
			"title": "Book Pack2 Contents",
			"body": "Book Pack2 - 12 architecture books - \n150 Best Minimalist House Ideas.epub\n50 Architecture Ideas You Really Need to Know.epub\n50 Housing Floor Plans.pdf\nA Concise Dictionary of Architectural Terms.epub\nA Critical History of Contemporary Architecture, 1960-2010.pdf\nA Handbook of Sustainable Building Design and Engineering.pdf\nA Place of My Own - The Architecture of Daydreams.epub\nAdvances in Architectural Geometry.pdf\nAn Introduction to Architectural Theory - 1968 to the Present.pdf\nDelivering Sustainable Buildings - An Industry Insider's View.pdf\nGreen Cities of Europe - Global Lessons on Green Urbanism.pdf\nHandbook for Blast Resistant Design of Buildings.pdf\n\nBook Pack2 - 17 biography books - \nAdmiral of the Fleet Earl Beatty - The Last Naval Hero - An Intimate Biography.epub\nAdolf Hitler - The Definitive Biography.epub\nAlbert Einstein - Physicist & Genius.pdf\nBad Girls Throughout History - 100 Remarkable Women Who Changed the World.epub\nBeyond Belief - My Secret Life Inside Scientology and My Harrowing Escape.epub\nBeyond Uncertainty - Heisenberg, Quantum Physics, and The Bomb.epub\nElizabeth Taylor - There is Nothing Like a Dame.epub\nFrida Kahlo - Beneath the Mirror.pdf\nIngmar Bergman - The Life and Films of the Last Great European Director.pdf\nIt's Not Easy Bein' Me - A Lifetime of No Respect but Plenty of Sex and Drugs.epub\nJohn Quincy Adams.epub\nJoni - The Creative Odyssey of Joni Mitchell.epub\nKicking & Dreaming - A Story of Heart, Soul, and Rock & Roll.epub\nLives of the Novelists - A History of Fiction in 294 Lives.epub\nMeat Eater - Adventures from the Life of an American Hunter.epub\nNapoleon - A Biography.epub\nProdigal Genius - The Life of Nikola Tesla.pdf\n\nBook Pack2 - 19 random books - dealer's choice - \n(Studies In Big Data Vol. 62) Mario Kubek - Concepts And Methods For A Librarian Of The Web-Springer (2020).pdf\nAldren Watson - Hand Bookbinding -A Manual of Instruction.epub\nBuild Your Own Time Machine_ Th - Brian Clegg.epub\nCyber Security Comprehensive Beginners Guide to Learn the Basics and Effective Methods of Cyber Security.epub\ndesign_motifs_of_the_decorative_twenties_by_henri_gillet.pdf\nDo Dice Play God__ The Mathemat - Ian Stewart.epub\nFat Witch Brownies_ Brownies, Blondies, and Bars Frork's Legendary.epub\nFranklin De Lima Marquezino, Renato Portugal, Carlile Lavor - A Primer on Quantum Computing (2019).pdf\nFuture Foods - David Julian McClements.epub\nHack Proofing Your Network - Internet Tradecraft- R.Russell.pdf\nLaura Zerra - A Modern Guide to Knifemaking_.epub\nLinux_ 2019 Easy Guide for Begi - Willard Drake.epub\nPaul Deitel, Dr. Harvey Deitel - Python for Programmers_ with Big Data and Artificial Intelligence Case Studies (2019).pdf\nPossum Living_ How to Live Well - Dolly Freed.epub\nRussell Tuckerton - 15 Minutes to a Better Interview.epub\nScience_Year_by_Year__A_Visual_History_From.pdf\nSherlock Holmes_ The Complete Collection - Arthur Conan Doyle.azw3\nThe_Bodybuilding.com_Guide_to_Your_Best_Body_210618191939.epub\nUbuntu Unleashed 2019 Edition_ Covering 18.04, 18.10, 19.04, 13th Ed-SAM Pearson Education (2019).pdf\n\nBook Pack2 - 28 complete idiots books - \nComplete Idiot's Guide to Trouble-Free Car Care.pdf\nComplete Idiot's Guide to Understanding Men and Women.pdf\nIdiot's Guides - Speed Math.epub\nThe Complete Idiot s Guide To Vitamins And Minerals.pdf\nThe Complete Idiot's Guide to Amazing Sex.pdf\nThe Complete Idiot's Guide to Back Pain.epub\nThe Complete Idiot's Guide to Bartending.pdf\nThe Complete Idiot's Guide to Chess.epub\nThe Complete Idiot's Guide to Dairy-Free Eating.epub\nThe Complete Idiot's Guide to Eating Smart.pdf\nThe Complete Idiot's Guide to Electrical Repair.pdf\nThe Complete Idiot's Guide to European History.pdf\nThe Complete Idiot's Guide to Finance for Small Business.pdf\nThe Complete Idiot's Guide to Game Theory.mobi\nThe Complete Idiot's Guide to Genealogy (2nd Edition).pdf\nThe Complete Idiot's Guide to Great Quotes for All Occasions.pdf\nThe Complete Idiot's Guide to Investing.epub\nThe Complete Idiot's Guide to Magic Tricks.pdf\nThe complete idiot's guide to reading body language.epub\nThe Complete Idiot's Guide to Statistics, 2nd Edition.epub\nThe Complete Idiot's Guide to Sushi and Sashimi.pdf\nThe Complete Idiot's Guide to Vegan Cooking.epub\nThe complete idiot's guide to WordPress.epub\nThe Complete Idiot's Guide to World History.pdf\nThe Complete Idiot's Guide to Writing a Novel, 2nd Edition.epub\nThe Complete Idiot's Guide to Yoga.pdf\nThe Complete Idiots Guide to Quick Total Body Workouts.epub\nThe Complete Idiot's Guide to Coping With Difficult People.epub\n\nBook Pack2 - 32 erotic and sex books - \nAbsolute Lesbian Sex.epub\nAccidental Sex Goddess By Lexi Ryan.epub\nAlien Abduction Sex Stories For Adults.epub\nAlien Captive Interracial Sex Abducted by Aliens.epub\nAt Home and in Bed with Sabrina Maree - 100+ Erotic Photos Intimate Portraits of Women.epub\nBabysitter Erotica - A Forbidden Erotic Older & Younger Romance Short Story of Love & Deception.epub\nDeep Inside - Extreme Erotic Fantasies.epub\nDirty Secrets & Filthy Fantasies - An Erotic Collection.epub\nDoctor's Orders - Medical Erotic Story.epub\nDreaming by the Sea (an erotic paranormal short story).epub\nDrink Deep, Ride Hard - A Biker Erotic Romance.epub\nDuty and Desire - Military Erotic Romance.epub\nElizabeth's Erotic Bondage; Anal Submission; Pain and Pleasure; Cherry; Love Ties.epub\nEnchanted Again - More Erotic Bedtime Stories For Women.epub\nEnchanted Submission - An erotic bdsm fantasy novella.epub\nEnchanted- Erotic Fairy Tales (Bear Skin; The People in the Garden; The Three Riddles).epub\nEnough To Make You Blush - Exploring Erotic Humiliation.epub\nErotic Amusements By Justine Elyot.epub\nErotic Viking Voyage By Carl Swenson.epub\nFairy Tale Lust - Erotic Fantasies for Women.epub\nFaithfully Unfaithful - Erotic Letters to my Cuckold.epub\nFalling - An Erotic Love Story.epub\nFAMILY TIES - A Mafia Love Story (Erotic Mafia Romance).epub\nFANtasy - A Hot Interracial BWWM Western Rockstar Erotic Story.epub\nFifty Shades Of Black - An Erotic Romance.epub\nFilthy Smut Vol. 4 - 35 Erotic Stories.epub\nCoping With Premature Ejaculation.pdf\nFuck Better A Simple Guide to Superior Sex.mobi\n0756639794.pdf\nOral Sex for Every Body Giving and Receiving for Men and Women.mobi\nThe Big Book of Breasts The Golden Age of Natural Curves.pdf",
			"added": 1567708956
		},
		{
			"topic_id": 1567728243,
			"title": "DMD Sites",
			"body": "DMD Sites - \nRegular Internet - www.dmd.delivery\nZeroNet - http://127.0.0.1:43110/1BVQqm21fV2K3yw5iaXvoZk23mho1vaqHv\n(warning, the ZeroNet site only has movie catalogs due to size limitations)\nBeaker Browser - dat://b5cd5bc575a2d9a55f13ace95deb65e8eb0447185d6a7cf38e12788ba84eb789\nOR\nYou can download the catalogs directly from us by going to the main page of our web site and clicking on \"Contact Info, Downloads and Other Ways to Find Us\"",
			"added": 1567728228
		},
		{
			"topic_id": 1567729289,
			"title": "ZeroNet 352 Flash Drop (DMD media giveaway)",
			"body": "We are giving away 15 flash drives with your choice of media on them.\nPlease see our post on ZeroTalk for information about this offer.\nCannot post here for some reason due to a size error.",
			"added": 1567729269
		},
		{
			"topic_id": 1567791248,
			"title": "ZeroNet 352 Flash Drop - 128gig flash claimed, 14 flash drives left",
			"body": "Someone has put in an order for the 128gig flash drive being offered for our free media giveaway - ZeroNet 352 Flash Drop.\n14 flash drives left\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1567728985_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1/ZeroNet+352+Flash+Drop+DMD+media+giveaway\n",
			"added": 1567791227
		},
		{
			"topic_id": 1568345188,
			"title": "New site for media download",
			"body": "In an effort to make it easier to get media to everyone, we've started a new site called Cat UtPult - \nhttp://127.0.0.1:43110/1t8TNKTUfJWrrxR7xqUKGjdt1K9EsqUtP\n\nFind movies, TV, music, books etc... that you want in the DMD Catalogs, send in your request and we will post a download link on Cat UtPult that you can paste into your browser.\nWe are using WebTorrent because it makes it very easy for anyone to download since everything happens in the browser. Equally important, WebTorrent it is P2P based like ZeroNet so files go directly from our servers to you. It is also a true BitTorrent based system so the more seeds there are the faster downloads happen. You can seed a downloaded file just by leaving the download page (Instant Io) open in your browser.\n\nThis is an experiment and we have a limited amount of server bandwidth to throw at this so let us know if you have problems or questions (post on DMDTalk at http://127.0.0.1:43110/1LBUGxoE9kvLUNshAeTWWZUiofaHpT1nhR).\n\nThanks!\nDMD",
			"added": 1568345165
		},
		{
			"topic_id": 1568345549,
			"title": "Cat UtPult site details",
			"body": "At the moment, file size for download should be under 2 gigabytes. Otherwise you could be waiting over an hour for a download. This assumes the worst case of only 2 seeders. Speed goes up dramatically with just a few more seeders.\n\nIgnore all the errors you see on the Instant Io download page. They are mostly for the developers and usually don't affect the download.\n\nWe have two servers for seeding so you should see 2 peers on the download page. A lot of the time the second server/peer doesn't get added until about 20% of the file is down.",
			"added": 1568345525
		},
		{
			"topic_id": 1568346200,
			"title": "Movies and TV on Cat UtPult",
			"body": "To get things started have put up about 50 movies and TV shows on Cat UtPult\nThe Movies are all SD quality to get them under 1 gigabyte for a reasonable download time.\nThe TV shows are all the first episodes of a smattering of popular shows",
			"added": 1568346175
		},
		{
			"topic_id": 1568504670,
			"title": "NoScript on WebTorrent (Cat UtPult) will not allow downloading",
			"body": "IMPORTANT -\nIf you are using a plugin like NoScript with your browser it will prevent the download from beginning.\nEven if you give WebTorrent (Instant Io page) temporary permissions with NoScript it still will not start.\nIf you have NoScript installed you must disable it and restart your browser - then WebTorrent will work.\n\nIn other words, like ZeroNet, Javascript must be enabled in order for WebTorrent to work.\n\nYou should see \"Log\" and \"Downloading torrent from (address)\" come on the screen and then 30-60 seconds later the download should begin.",
			"added": 1568504644
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1567311563_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1": [
			{
				"comment_id": 1,
				"body": "Double checked the original uploads and they all have the text file links - not sure why yours is missing, sorry about that.\nYes, your right, posting in bulk would be better, but the owner of ZeroUp has put limitations on it.\nAll files must be 10mb minimum and 200mb maximum, with only a few file types such as .zip accepted.\nIt also looks like the maximum you can have up at any one time is 1 gigabyte.\n\nWe may switch to another site or clone one eventyally, but for now ZeroUp is simple and easy to use.\nthanks for your comment,",
				"added": 1567389527
			},
			{
				"comment_id": 2,
				"body": "By the way,\nthe uploads we do on ZeroUp are really just to try and duplicate a free upload service we have called File Cannon.\nWe have millions of files available through the DMD catalogs.\n\nOur ZeroNet zite - (only movie catalogs can fit due to size limitations)\nhttp://127.0.0.1:43110/1BVQqm21fV2K3yw5iaXvoZk23mho1vaqHv\n\nOur clearnet site -\nhttps://dmd.delivery\n\nLook under \"Catalog and DMD Statistics\" for more information on what we have available.",
				"added": 1567390221
			}
		],
		"1567484746_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1": [
			{
				"comment_id": 3,
				"body": "If you mean on ZeroNet, yes, we would love to, but ZeroUp has a 1 gig ceiling.\nYou probably know more about the other zites on ZeroNet than we do, save us some time and suggest a good site we can upload to and we will leave all of our stuff up.\nThe media we are posting here is the most recent stuff, but of course you can request anything that is a little older from the massive catalogs we have with DMD.\nOur File Cannon service will email you any file we have that is 25mb or less for free, all you have to do is ask.\nhttp://127.0.0.1:43110/1BVQqm21fV2K3yw5iaXvoZk23mho1vaqHv\nwww.dmd.delivery\nthanks,",
				"added": 1567495295
			},
			{
				"comment_id": 4,
				"body": "Sorry, yes we did look at 08chan and Millchan using the links you provided.\nThe only issue with those being because of their size there is a lot of updating and loading going on, slowing things down. This may be more of a problem from our side due to running everything through Tor, not sure.\nZeroUp is convenient because it is small and light.\nThat being said, we will most likely take your advice and upload to those sites in order to keep files available to everyone.\nthanks,",
				"added": 1567499619
			}
		],
		"1568491418_1CTghuxuyrvoERqDiBxnFhJHUtn6iF3ktq": [
			{
				"comment_id": 5,
				"body": "Right now we are only uploading files that are 2 gigabytes or smaller on Cat UtPult because we have a limited number of servers/peers. That file is 3.4 gig so with only a couple of peers it would take a really long time to download.\nYou can always pay a little to have it sent to you on flash drive - \nhttp://127.0.0.1:43110/1BVQqm21fV2K3yw5iaXvoZk23mho1vaqHv\nwww.dmd.delivery\n\nthanks!",
				"added": 1568493639
			}
		]
	},
	"comment_vote": {
		"1_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	}
}