{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1554091689,
			"title": "Decentralized Email Services",
			"body": "Every decentralized email service doesn't actually seem to interoperate with traditional email services. For example, you can't send an email to a gmail account from ZeroMail or BM (without paying). Why are there no /real/ decentralized email services?",
			"added": 1554091688
		},
		{
			"topic_id": 1560042831,
			"title": "Advanced Worm Operations Leveraging (AWOL)",
			"body": "Advanced Worm Operations Leveraging (AWOL) would be the use of robust worms, ideally utilizing deep system insecurities (to lay underneath GRUB or higher-level operating system control), in a coordinated effort to force traffic through specific networks and hold systems hostage (large-scale multi-level ransomware). If you had worm ransomware spreading decently fast, you could use it to force all infected nodes to route their traffic through the ZeroNet or TOR networks for example. The large increase of nodes would also scale network processing and make the network considerably faster. You could then install a robust GUI-based program (with decent UI) on all infected systems that serves as a tutorial for how to un-entrench yourself from the gilded cage you were used to before you had access to free (decen+dist+unperm) systems, this would train normies to use their new system. The infected system would also brick itself if you tried to remove the worm, making it a, \"Freedom or death,\" worm. My only question is that with the advanced deep-system exploits intel agencies have, why they haven't done this already (they probably have for surveillance software but nothing else)?\n\nWhat do you guys think of this idea? Should I pursue this and write a formal paper on it?\n\nArchive of this outline on clearnet: https://privatebin.net/?b27efae48a9f6eca#kPYDwNleflytLIcHq9pfoLufvqLgRV3nsg+uYEOHAoI=",
			"added": 1560042829
		}
	],
	"topic_vote": {
		"1554091689_12J9C7UzPWdvcmGtYGDRqnLsjpUByVPtwk": 1,
		"1554106645_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1": 1,
		"1554143647_1Cj5g289VvLkA7tsv7ewLKLpUYSnz3Ut4C": 1,
		"1560020808_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1560042831_12J9C7UzPWdvcmGtYGDRqnLsjpUByVPtwk": 1,
		"1560428512_16GG19wZtGAcebcKhf2hEmcf1sETig7DLA": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1554091689_12J9C7UzPWdvcmGtYGDRqnLsjpUByVPtwk": [
			{
				"comment_id": 1,
				"body": "> [kaffie](#comment_819_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Email itself is already \"decentralized\". How it works is that you send a command to the OS over the internet to save the message, addressed for a particular person. This later evolved into dedicated software managing the arrival of mail, and then to centralized services that provide addresses for people (so their computer didn't need to be on 24/7). [...]\n\nI understand how email works. I'm asking why, since there /are/ BM gateways for sending/receiving to normal addresses, this isn't free or available in other distributed+decentralized+encrypted networks (like ZN)? To anticipate the obvious, no I'm not asking why someone is charging for a service, I'm asking, since all these other services are free, why someone hasn't set up a gateway to handle traffic for free as well. Have people just not thought about this? Is it too technically difficult for most? If it's not too difficult, and since it is a big hole in these systems, wouldn't it be very beneficial to set up a gateway service between ZeroMail and clearnet email just like BM has?",
				"added": 1554098934
			},
			{
				"comment_id": 3,
				"body": "> [kaffie](#comment_820_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Seems straight forward. It hasn't been done because there hasn't really been an incentive to do so. ZeroNet is still very small, and most of it's users are just going to use zeromail to communicate with one another, rather than people not on zeronet.\n> [krixano](#comment_716_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Actually, I've thought about doing a gateway thing... just haven't had the time to research and work on it, or the incentive I suppose, or the money to actually run a server.\n\nTo both of you, I understand ZN is relatively small right now, but if there was a robust gateway for ZeroMail I guarantee you there would be a flood of people coming to use it. A dist+decen+crypto network like this is the holy grail of privacy/anonymity and creating interoperable services would be a massive plus for obvious reasons. The only network that conforms to this currently is BM (Tor and I2P services either die quickly or stay unconnected to clearnet), and BM has a paywall for the gateway. If you want help on something like this Krix, I will help however I can! I fully believe ZN is too good to /not/ have this functionality.",
				"added": 1554169480
			},
			{
				"comment_id": 4,
				"body": "> [d14na](#comment_90_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4): @snax email seems so \"legacy\"; why not use matrix? offers integrations (video link) to irc, telegram, slack, and so many others.\n\nBecause Matrix is highly centralized. Federated systems are neither distributed nor decentralized systems. If you're worried about email being 'legacy', then you should be similarly worried about the owner of a Matrix server being able to see everyone's info and arbitrarily abuse that (censorship is the least worry here, although censorship is rampant on Matrix servers).",
				"added": 1554178186
			}
		],
		"1554106645_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1": [
			{
				"comment_id": 2,
				"body": "Very cool. This is like the BTC blockchain torrent that helps people sync faster on their initial download+install. It would be cool to see ZN have a torrent/git of like a thousand popular zites.",
				"added": 1554142338
			}
		],
		"1560020808_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 5,
				"body": "> [pexo](#comment_100_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): There is difficulty implementing it. The only viable DHTs are udp based and as such can't work with tor clients(since to is tcp only).See this(Clearnet) github issue for more info.\n\nConversely, you wouldn't need to run any traffic through TOR if IP was anonymized properly inside of ZN anyways. DHT would be a massive improvement to ZN, making it truly decentralized; OP brings up an important point.",
				"added": 1560042321
			},
			{
				"comment_id": 8,
				"body": "> [pexo](#comment_101_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): I agree but keep in mind that proper anonymization is really hard to do and needs to be under regular attack to guarantee that it still (or rather to what degree it) can protect you. There is a reason why there seem to be only the big anonymization projects (pretty much) I2P, Tor and freenet( + gnunet at some point). All of them have existed for at least a decade and have proven to effectively protect you. [...]\n\nYea, why not both then? DHT as a parallel process for archiving content? It'd be like a decentralized RAID system (does decentralized RAID already exist?).\nAlso GNUnet looks /very/ interesting imo.",
				"added": 1560599814
			}
		],
		"1560042831_12J9C7UzPWdvcmGtYGDRqnLsjpUByVPtwk": [
			{
				"comment_id": 6,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_200_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): What's the purpose?\n\nTo force a large segment of the society (as many as possible) to switch off of centralized, trust-based, privacy-raping systems and into better options with a permanent boost to those better options.",
				"added": 1560045039
			},
			{
				"comment_id": 7,
				"body": "> [anonymouslogin](#comment_334_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): https://www.forbes.com/sites/andygreenberg/2012/07/26/meet-rakshasa-the-malware-infection-designed-to-be-undetectable-and-incurable/\n\nThis is great, thanks. The next step is to utilize something like this to force all internet traffic through decen networks.",
				"added": 1560051177
			},
			{
				"comment_id": 9,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_208_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): [...]\n> [holeyhouseofair](#comment_7_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57): [...]\nA bit off topic, but I'm not too worried about the disruptive sequela, just whether or not it can be done in the first place.\n\n> [holeyhouseofair](#comment_6_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57): id laugh if it happened but also more dangerously the same could be done with subversively entrapping software with the overt image of freedom. I for one welcome our new NOTNSA!_OS overlords. [...]\nI think \"Not NSA\" will be a good name for the worm. Thanks.",
				"added": 1560600230
			}
		]
	},
	"comment_vote": {
		"1_12J9C7UzPWdvcmGtYGDRqnLsjpUByVPtwk": 1,
		"135_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1,
		"820_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"716_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"3_12J9C7UzPWdvcmGtYGDRqnLsjpUByVPtwk": 1,
		"4_12J9C7UzPWdvcmGtYGDRqnLsjpUByVPtwk": 1,
		"5_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd": 1,
		"389_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"687_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"684_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"68_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"41_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"475_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"334_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"201_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"101_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"6_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": 1
	}
}