{
	"next_topic_id": 53,
	"topic": [
		{
			"topic_id": 1576213352,
			"title": "Targeted Individual (TI)",
			"body": "Share your experience while the end is near...",
			"added": 1576213351
		},
		{
			"topic_id": 1576213773,
			"title": "Government worldwide are after digital currency holders by silently liquidating them.",
			"body": "share similar stories near you...",
			"added": 1576213771
		},
		{
			"topic_id": 1576214137,
			"title": "There's a dark agenda to defraud and enslave all humanity.",
			"body": "Your thoughts!?",
			"added": 1576214134
		},
		{
			"topic_id": 1576214481,
			"title": "CIA, MOSSAD, ZIONIST are EVIL, in the shadow operations, destroying GOD's CREATION.",
			"body": "The world is awakening, Contribute...",
			"added": 1576214477
		},
		{
			"topic_id": 1576215313,
			"title": "MEETUP.COM is a hidden CIA, MOSSAD, ZIONIST company to recruit new agents for their Evil Agenda. Mostly young good looking women are recruited to target individual on their list (business men, wealthy men etc.) by blackmailing them into prostitution, pedophilia, fake romance, criminal activities, murder/ suicide and defraud law-abiding people out of their hard earned money/ life",
			"body": "It's all about money and power....you could be one of them, stop working for that criminal enterprise and repent to be saved.",
			"added": 1576215308
		},
		{
			"topic_id": 1576217447,
			"title": "Always expect CIA, MOSSAD, ZIONIST out of BOILER ROOMS Worldwide with unlimited budget to troll and disrupt their hidden dark Agenda in order to change the narrative.",
			"body": "Sharpen your eyes for the trolls, they are everywhere like a virus...",
			"added": 1576217441
		},
		{
			"topic_id": 1576233739,
			"title": "AND YES EPSTEIN WAS KILLED BY CIA, MOSSAD, ZIONIST BECAUSE...",
			"body": "He was a LIABILITY for criminal enterprise/ operation (CIA, MOSSAD, ZIONIST) to blackmail all influential individuals worldwide but before he was epsteined, got stripped off his wealth on paper, which the criminal gansters anyway controlled.\n\nA WARNING TO ALL WORKING FOR THE CABAL, this is the end-game once you become a liability !",
			"added": 1576233732
		},
		{
			"topic_id": 1576287725,
			"title": "ISIS",
			"body": "=ISRAELI SECRET INTELLIGENCE SERVICES=CIA, MOSSAD, ZIONIST.\nFollow the money...",
			"added": 1576287717
		},
		{
			"topic_id": 1576288144,
			"title": "\"THE CHOSEN ONE\" ARE BEING DECEIVED TO DO EVIL BY SATAN IN DISGUISE.",
			"body": "There's a special place awaiting them upon \"Judgement Day\"\n\nNow is the time to repent \"Chosen One\" or else you won't be saved.",
			"added": 1576288135
		},
		{
			"topic_id": 1576291196,
			"title": "ONCE YOU SET FOOT ON U.S. SOIL, IT'S THE DEVILS PLAYGROUND.",
			"body": "I travelled a lot to U.S. many beautiful scenery areas, a few beautiful minded people, always enjoyed it but once you land in the United States, it's MAGIC, CURSED (Holy Wood, Disney Land, EPCOT, SILICON and much more) to get you to work for SATAN in Disguise. SATAN's time is coming to an END. WAKE UP AMERICA and SAVE your once so beautiful country, Land of the Free. \nBut unfortunately the American Empire is dying, THE NEW BABYLON will FALL.\n\nREPENT FOR YOUR MISTAKES NOW.",
			"added": 1576291186
		},
		{
			"topic_id": 1576568035,
			"title": "Together, we are Strong, devided, we are weak.",
			"body": "Never forget, we are all ONE, therefore treat everyone as you would treat yourself or your neighbor or loved ones. We are all brothers and sisters.\n\nIf you allow \"Divide & Conquer\" Agenda to succeed, we are lost.\n\nPeople should never insult others easy by hiding behind anonymity, instead discuss the issues/ threads like grown up to increase knowledge.",
			"added": 1576568024
		},
		{
			"topic_id": 1576725447,
			"title": "HOW TO FIGHT CIA, MOSSAD, ZIONIST, IT'S ALL ABOUT US.",
			"body": "-live off the grid as much as possible. Extremely difficult in our technology time.\n\nPlease add your ideas, I would like to see, how woke people are.",
			"added": 1576725435
		},
		{
			"topic_id": 1577334436,
			"title": "Indians worldwide, mostly in tech industry, are being used for evil, nefarious, criminal activities to defraud humanity.",
			"body": "Due to their (Indians) desperation (e.g. lack of financial means), background and faith, they are a perfect example of how they are being used by CIA, MOSSAD, ZIONIST to defraud and kill Christians and other religions worldwide, except of course, of the initiator themselves, THE  FALSE JEWS (ZIONIST) for the fake, evil money printed out of thin air.\nWhat they (Indians) don't realize, at the end of the day, they are just MINIONS and GOYIMS and the \"CHOSEN ONE\" will get rid of them when the time comes and when not needed anymore.\n\nThey are even sending neg. SPELLS to them as we speak (see huge unrest and protest in INDIA for citizenship bill, used as pretext), similar things happening in HONG KONG.\n\nWARNING TO INDIANS: STOP SELLING YOUR SOULS TO THE SO-CALLED CHOSEN ONE, THEY WILL DEFRAUD YOU AND WISH YOU MAYHEM AS IT IS ALREADY DEVELOPING.",
			"added": 1577334423
		},
		{
			"topic_id": 1577776813,
			"title": "Do not go gentle into that good night...",
			"body": "In a time of universal deceit - telling the truth is a revolutionary act.\nGeorge Orwell",
			"added": 1577776797
		},
		{
			"topic_id": 1577943090,
			"title": "We got their Attention.",
			"body": "The controllers/ gatekeepers (CIA, MOSSAD, ZIONIST) are here already. They are pushing for irrelevant threads in order to hide the relevant one, the truth. Look for patterns and some  specific users...\n\nNow it is extremely important to comment (with proof, links and deep research) on the relevant one and disregard the irrelevant threads created by them.\n\nBeware: They are extremely knowledgeable to the human psychs \nZERONET is their nightmare, they will try to dominate it by majority users trying to change the narrative.",
			"added": 1577943073
		},
		{
			"topic_id": 1578028720,
			"title": "The beauty of Zeronet is...",
			"body": "to connect the like-minded-one, enlighten one, in the know,  and to let the one in the dark, asleep one, skip, troll without substance due to lack of knowledge.",
			"added": 1578028702
		},
		{
			"topic_id": 1578034470,
			"title": "US are drawing us all into WAR",
			"body": "WAKE UP PEOPLE TO THE FRAUD, they are the real enemies within.\n\nhttps://www.zerohedge.com/geopolitical/rocket-attack-shuts-down-baghdad-airport-after-joint-us-iraqi-base-targeted\n\nUnnecessary killing for PEACE?",
			"added": 1578034451
		},
		{
			"topic_id": 1578111851,
			"title": "Some proof to Flat Earth",
			"body": "https://153news.net/watch_video.php?v=7M45NS69BUSW",
			"added": 1578111831
		},
		{
			"topic_id": 1578131377,
			"title": "All dissidents in U.S. especially Influencers, YOUTUBERS will not be allowed to leave the country.",
			"body": "The southern border wall to Mexico is not to keep immigrants from coming but to not let U.S. citizen/ residents, especially Dissidents, from leaving when SHTF soon. Get ready for FEMA CAMPS in empty WALMARTS and underground facilities all over the U.S.\n\nThey have a LIST of all of them/us due to GOOGLE/ ALPHABET, TWITTER ETC\n\nProject ZYPHR & POGO",
			"added": 1578131356
		},
		{
			"topic_id": 1578573647,
			"title": "h3bhkj5gqz4n3pjm bahaviour, so obvious, should be BANNED",
			"body": "Let's vote\n\nupvote < 10 = BAN BY ADMIN",
			"added": 1578573625
		},
		{
			"topic_id": 1578981843,
			"title": "Proof Cia, Mossad, Zionist operate illegally in disguise on foreign soil worldwide",
			"body": "They have given themselves the right to do so... (because \"chosen one\"?)\nThis unlawful Right/ Privilege must Stop !\n\nhttps://www.zerohedge.com/political/assange-may-walk-free-thanks-cia-bumbling-former-nyt-general-counsel",
			"added": 1578981820
		},
		{
			"topic_id": 1579175074,
			"title": "UFOs are here and among us to save humanity till judgement day.",
			"body": "They are Benevolent... \n\nhttps://www.youtube.com/watch?v=GEGLctVlbmw&feature=youtu.be\n\nand do your own research...",
			"added": 1579175050
		},
		{
			"topic_id": 1579230993,
			"title": "Biometrics to keep you in the MATRIX",
			"body": "And track all your movements...\nCriminals and terrorist reason were just a PRETEXT.\n\nhttps://www.zerohedge.com/technology/america-4th-worst-abuser-biometric-privacy-rights-world",
			"added": 1579230968
		},
		{
			"topic_id": 1579313840,
			"title": "British Monarchy is a corporation / US is a Corporation not a Country",
			"body": "https://www.youtube.com/watch?v=-0Itvml2mgQ&feature=emb_logo",
			"added": 1579313814
		},
		{
			"topic_id": 1582033580,
			"title": "ASSANGE DEATH IS BEING PREPARED TO ACCUR SOON",
			"body": "-They are setting signs hidden in plain sight...",
			"added": 1582033553
		},
		{
			"topic_id": 1582197021,
			"title": "I have come to the conclusion ZEROHEDGE is controlled by CIA, MOSSAD, ZIONIST.",
			"body": "After deep, lengthy research and observation, they have unfortunately infiltrated ZEROHEDGE too.\n\n-To always control the narrative\n\nMONEY IS THE ROOT OF ALL EVIL.\n\nand yet, time is running out for them, seek the most high, it's still not too late people.",
			"added": 1582196993
		},
		{
			"topic_id": 1583563665,
			"title": "Covid-19 biggest HOAX of our LIFETIME",
			"body": "-to collapse the current SYSTEM and put NWO in place.",
			"added": 1583563636
		},
		{
			"topic_id": 1584256859,
			"title": "CV-19 HOAX, ECONOMIC COLLAPSE REAL, FINISHING OFF PEOPLE IN HOSPITALS REAL, especially eldery 70 up for now.",
			"body": "Make your research...",
			"added": 1584256829
		},
		{
			"topic_id": 1584287601,
			"title": "TO ALL THE MINIONS OF SATAN HERE, NOW IS THE TIME TO LEAVE YOUR MASTER.",
			"body": "REPENT TO YOUR REAL CREATOR AND NOT TO THE ONE OPPOSING HIM. THEN, YOU WILL HAVE NOTHING TO FEAR.",
			"added": 1584287570
		},
		{
			"topic_id": 1584640277,
			"title": "ALL COUNTRIES BEING LOCKED DOWN FOR AN EVENT OF EPIC/ BIBLICAL DIMENSION.",
			"body": "-PRIME TIME IN FRONT OF TE-LIE-VISION",
			"added": 1584640245
		},
		{
			"topic_id": 1584983883,
			"title": "WONDER WHY INDIA IS STILL SPARED FROM THE VIRUS?",
			"body": "CAUSE, THEY ARE THE MINIONS/ PUPPETS OF CIA, MOSSAD, ZIONIST, OPERATING IN DISGUISE, WORLDWIDE ON FALSE GROUNDS TO THE FULFILLMENT OF NWO.\n\nBEWARE OF YOUR NEIGHBORS...\n\nINDIA, YOU ARE BEING DECEIVED, WAKE UP !",
			"added": 1584983849
		},
		{
			"topic_id": 1585004492,
			"title": "(1) PROBLEM, (2) REACTION, (3) SOLUTION, WE ARE PHASE 2",
			"body": "PHASE 3 (VACCINE, MARK OF THE BEAST, 5G, TOTALITARISM, BIG BROTHER ALWAYS WATCHING, NO RIGHTS, NO FREEDOM, MODERN SLAVERY, PRISONER, OBEDIENCE ETC.) WILL FOLLOW SOON, DO NOT FALL FOR THE DECEPTION. IT IS A CRIME AGAINST HUMANITY.",
			"added": 1585004457
		},
		{
			"topic_id": 1585133073,
			"title": "STOP WATCHING/ BELIEVING MEDIA, NEWS (ALL A BIG LIE), THEY ARE ALL CROOKS AND CRIMNALS FOR EMINENT DESTRUCTION OF ECONOMY.",
			"body": "",
			"added": 1585133037
		},
		{
			"topic_id": 1585226591,
			"title": "CORONA=666=MARK OF THE BEST=SATAN COINCIDENCE?",
			"body": "​MARK OF THE BEAST 666 \n\nCORONA\n\nC = 03 \nO = 15 \nR = 18 \nO = 15. \nN = 14 \nA = 01 \n\n=66+6 Letters\n\nTOTAL ADDED UP = 6 66 \n\nLETTERS OF THE ALPHABET ( 26 ) \n\nA = 1 B = 2 C = 3 D = 4 E = 5 N = 14\n\nDO YOU ALL STILL BELIEVE IN COINCIDENCES? \n\nWAKE UP CHILDREN OF GOD TO THE DECEPTION AND FIND YOUR TRUE CREATOR AND NOT THE ANTICHRIST.\n\n\"THERE'S NO SUCH THING AS COINCIDENCES\"",
			"added": 1585226554
		},
		{
			"topic_id": 1585419457,
			"title": "YOUR TV IS THE REAL VIRUS (FEAR and MANIPULATED CASES), NOT THE COVID VIRUS ITSELF.",
			"body": "But hidden, there's a man-made super deadly virus out of Wuhan, Israel, U.S., Canada, in disguise, imported by the MINIONS to almost all countries to depopulate and steal your hard-earned wealth, and likely with no cure. All Countries/ Governments are hiding this fact. \nNo masks, gloves etc. protecting. \n\nJUST PRAY THAT THE DEADLY ONE IS NOT NEAR YOU.\n\nThere has been a DIVINE INTERVENTION TO ALTER THE VIRUS.\n\nREPENT AND FIND YOUR TRUE CREATOR.",
			"added": 1585419419
		},
		{
			"topic_id": 1585584700,
			"title": "THERE IS A MONOLITHIC AMOUNT OF PEOPLE WORLDWIDE BETRAYING US, LIKELY 66%",
			"body": "They are the MINIONS (SOLD THEIR SOULS) OF SATAN to FULFILL THE AGENDA.\n\nSPREAD THE TRUTH TO BRING THEM DOWN.",
			"added": 1585584661
		},
		{
			"topic_id": 1585602643,
			"title": "COVID Backwards DIV/CO DIVIDE AND CONQUER 19 = A I  in gematria",
			"body": "COINCIDENCE ? NOPE",
			"added": 1585602603
		},
		{
			"topic_id": 1585634533,
			"title": "WHILE ON LOCK DOWN AND SOCIAL DISTANCING 1.5-2m, BIG BROTHER  IS LISTENING.",
			"body": "\"THE BEAST\" IS LISTENING AND COLLECTING ALL MOBILE, INTERNET AND SMART TV COMMUNICATION WORLDWIDE AND USE IT AGAINST YOU IN THE NEAR FUTURE.\n\nWE HAVE BEEN SOLD TO BIG CORPORATION, GOVERNMENT =  (TO GOVERN MINDS) WHILE ASLEEP AND NO CLUES ABOUT THESE TECHNOLOGIES.\n\nTECHNOLOGY AND HUMAN EVOLUTION IS GOOD BUT NOT IN THE WRONG HANDS!",
			"added": 1585634492
		},
		{
			"topic_id": 1585842700,
			"title": "THE MAIN CULPRIT IS USA, CIA, MOSSAD AND ZIONIST, WAKE UP PEOPLE AND SHARE.",
			"body": "",
			"added": 1585842658
		},
		{
			"topic_id": 1585895340,
			"title": "STOP SAYING CORONA VIRUS, COVID-19, IT'S CURSED BY THE FALSE \"CHOSEN ONE\"",
			"body": "JUST SAY VIRUS OR FLU...\n\nTHE REPETITIVENESS OF THESE WORDS AGAIN AND AGAIN ARE SPELLS .\n\nIT'S ALL VERY SPIRITUAL, THE WAR, WE ARE IN...",
			"added": 1585895297
		},
		{
			"topic_id": 1585905585,
			"title": "ALL OF THIS LOCKDOWN SHOWING, ELITES OWN US.",
			"body": "WAKE UP PEOPLE AND DO NOT CONSENT !",
			"added": 1585905541
		},
		{
			"topic_id": 1586080503,
			"title": "RACISM DOESN'T EXIST BUT ZIONISTS HAVE INDOCTRINATED US FROM THE BEGINNING TO DIVIDE AND CONQUER.",
			"body": "",
			"added": 1586080458
		},
		{
			"topic_id": 1586090019,
			"title": "DO NOT BELIEVE THE JOHN HOPKINS UNIVERSITY (JHU) FOR WORLDWIDE DATA",
			"body": "ON EVERY VILLAGE, CITY, COUNTY, STATE, COUNTRY, CONTINENT.\n\nDO YOU BELIEVE, THEY ARE ALMIGHTY? OR JUST INPUT AS THEY PLEASE FOR THE AGENDA (NWO)?\n\nhttps://gisanddata.maps.arcgis.com/apps/opsdashboard/index.html#/bda7594740fd40299423467b48e9ecf6",
			"added": 1586089973
		},
		{
			"topic_id": 1586239205,
			"title": "WE MAY WIN THIS WAR/ ATTACK ON US BY KEEPING EXPOSING THE TRUTH. DO NOT FEAR!",
			"body": "",
			"added": 1586239158
		},
		{
			"topic_id": 1586338168,
			"title": "THE INTERNET (KNOWLEDGE, AWAKENING) WILL BE THEIR (ELITE, CABAL) OWN DOWNFALL.",
			"body": "",
			"added": 1586338120
		},
		{
			"topic_id": 1586342092,
			"title": "DO YOU BELIEVE JACK DORSEY (TWITTER) IS REALLY DONATING 1 BILLION?",
			"body": "HE IS ONLY A SCAPEGOAT (e.g. BILL GATES, SOROS ETC.) HOLDING SHARES IN DISGUISE FOR THE CABAL (CIA, MOSSAD, ZIONIST).\n\nHE HAS ABSOLUTELY NO SAY. JUST REPRESENTS THE WISHES OF THE POWERS THAT BE.\n\nREMEMBER: WHEN YOU REACH A CERTAIN AMOUNT OF WEALTH, THE CABAL WANTS TO BE INVOLVED AND CONTROL IT !",
			"added": 1586342043
		},
		{
			"topic_id": 1586343993,
			"title": "POSSIBLE SOLUTION TO SET YOU FREE",
			"body": "https://www.hanomy.com/",
			"added": 1586343943
		},
		{
			"topic_id": 1586620500,
			"title": "THOSE ENABLING THIS LOCKDOWN/ AGENDA, YOU THINK, YOU WILL WALK FREE?",
			"body": "THINK AGAIN, YOU ARE JUST BEING USED AS SLAVE/ CATTLE AND YOU WILL BE SLAUGHTERED AT THE END.\n\nCAUSE YOU AREN'T IN THE CLUB OF THE 0.2 %",
			"added": 1586620449
		},
		{
			"topic_id": 1586683890,
			"title": "THE VIRUS, THE BIGGEST STUNT OF OUR LIFETIME.",
			"body": "DO YOUR OWN RESEARCH...",
			"added": 1586683838
		}
	],
	"topic_vote": {},
	"next_comment_id": 160,
	"comment": {
		"1576215313_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 1,
				"body": "> [robione](#comment_350_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): No it's not.  [...]\n\nYou see only the nice surface, dig deep enough and you will be enlightened, except you are a collaborator yourself, like many...",
				"added": 1576216665
			},
			{
				"comment_id": 35,
				"body": "To all commenters, I would appreciate you staying on the topic, share your experience and not drifting away, subject to a new thread, thanks...",
				"added": 1577774615
			},
			{
				"comment_id": 91,
				"body": "Be vigilant...",
				"added": 1579178072
			},
			{
				"comment_id": 138,
				"body": "A Reminder to TRUTH...",
				"added": 1592805607
			}
		],
		"1576287725_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 2,
				"body": "> [styromaniac](#comment_1436_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You're not going to convince people that easily. Try uploading documentaries.\n\nWill...step by step, more to come...",
				"added": 1576288278
			},
			{
				"comment_id": 3,
				"body": "> [mmtech](#comment_9_1K8NrwqEfy49zAMWzHgywnToZib7PRaQMP): you can say all of your opinions in one thread!no need such many threads\n\nRepeat a lie long enough and you will believe it at some point, Repeat a TRUTH long enough and you will be enlightened...",
				"added": 1576288439
			},
			{
				"comment_id": 5,
				"body": "> [clearnet15bad](#comment_60_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7): Please do.\n\nEvidence will be coming...I am not spamming but bringing ideas of thought, no one need to read my threads if not interested...",
				"added": 1576292177
			},
			{
				"comment_id": 14,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1304_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you're an uneducated person:Isis is a goddessthe name was chosen for this purposenot by accident\n\nIs it a coincidence that they \"the chosen one\" have created ISIS for terror worldwide and ask yourself why ISIS never attacked Israel? By the way, about the goddess, I am well aware....but speak for myself as you would read/ know my thoughts...",
				"added": 1576500458
			},
			{
				"comment_id": 15,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1309_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): lolyou don't have the balls to be a chosen ones.\n\nOnly GOD can choose and not as by self-declare...",
				"added": 1576504072
			},
			{
				"comment_id": 86,
				"body": "Paid by trucks full of cash...USD of course.",
				"added": 1579177294
			},
			{
				"comment_id": 97,
				"body": "The same goes for AL QAIDA...",
				"added": 1579587147
			},
			{
				"comment_id": 139,
				"body": "A Reminder to TRUTH...",
				"added": 1592805656
			}
		],
		"1576291196_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 4,
				"body": "> [nickwa](#comment_483_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): I am the devil. I am the chosen one who is also the devil.\n\nAre you enjoying a cool operation room with other minions to troll 24/7 the net in order to keep the agenda/ truth hidden and monitor the narrative...",
				"added": 1576291899
			},
			{
				"comment_id": 26,
				"body": "some proof...\n\nhttps://www.youtube.com/watch?v=LP_Yl9WZv8M",
				"added": 1576891969
			},
			{
				"comment_id": 87,
				"body": "For now Satan is in control...",
				"added": 1579177458
			},
			{
				"comment_id": 140,
				"body": "A Reminder to TRUTH...",
				"added": 1592805673
			}
		],
		"1576214137_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 6,
				"body": "PART 1\nhttps://www.youtube.com/watch?v=4_whzciUOpo\nPART 2\nhttps://www.youtube.com/watch?v=H91goZ4nggM",
				"added": 1576293103
			},
			{
				"comment_id": 13,
				"body": "> [somuchfood](#comment_60_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk): Isn't it already? We are enslaved by NSA, google, facebook, microsoft, CPU backdoors... and we are defrauded because of the huge gap between filthy rich and dead poor\n\nthis is just beta, worse to come...",
				"added": 1576329440
			},
			{
				"comment_id": 144,
				"body": "A Reminder to TRUTH...",
				"added": 1592805788
			}
		],
		"1576213773_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 7,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1284_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you watch too many conspiracy\n\nI personally know of a few cases, but speak for myself as if you knew my life and experience.\nAside conspiracies, some have a lot of truth in them for the open eyes to be seen...It's all in hidden symbols and signs.",
				"added": 1576296187
			},
			{
				"comment_id": 49,
				"body": "First, they let you do KYC as a law-abiding citizen in the dark, then the controlled/ bought exchanges, share info with the respective government without your knowledge or consent, then they slowly/ silently target you and your family to steal it from you by criminal activity...why? Because they cannot control it otherwise. These orders are from the hidden 0.01 % powers that be, never to be seen in media. It's a conspiracy to keep slaves, slaves.",
				"added": 1578123055
			},
			{
				"comment_id": 70,
				"body": "Watch out behind your back...",
				"added": 1578467699
			},
			{
				"comment_id": 84,
				"body": "They are monitoring big balances attached to names to steal from you...",
				"added": 1579176199
			},
			{
				"comment_id": 141,
				"body": "A Reminder to TRUTH...",
				"added": 1592805699
			}
		],
		"1576214481_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 8,
				"body": "> [n3uronmaster](#comment_8_12ytyx8zmYMn58UavemioxPnMwaDNND3Ww): stop bringing your hate here please\n\nit's not hate but truth...",
				"added": 1576296294
			},
			{
				"comment_id": 142,
				"body": "A Reminder to TRUTH...",
				"added": 1592805715
			}
		],
		"1576309972_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 9,
				"body": "It's still very valuable if you know how...",
				"added": 1576312391
			}
		],
		"1576288144_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 10,
				"body": "> [jazzman44](#comment_1_14fZAxxUzBwb8nWUiZP3YXEqmSpfZR7cVQ): don't want to be saved\n\ncontinue your goodnight-sleep...",
				"added": 1576323904
			},
			{
				"comment_id": 11,
				"body": "> [somuchfood](#comment_62_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk): I don't care\n\nIgnorance is bliss...",
				"added": 1576324086
			},
			{
				"comment_id": 143,
				"body": "A Reminder to TRUTH...",
				"added": 1592805729
			}
		],
		"1558691316_15Gk4wzjyNbPU3JZ31UnqMM3CMrX8pxmzF": [
			{
				"comment_id": 12,
				"body": "GDPR is trying to protect Euro-Citizen from CIA, NSA, MOSSAD hidden shell-companies eavesdropping on Europeans , at least on paper, but they are so criminal that they don't give a damn about these regulations. Theoretically, you could sue them for millions with proper evidence.  I agree, the accept button is annoying but do not forget the good intentions.",
				"added": 1576329212
			}
		],
		"1576568035_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 16,
				"body": "> [jokercrusader01a](#comment_13_157VVUxncF9T6AJyBqccov3387r13ru7ir): Truth HURTS Huh?\n\nnot at all...",
				"added": 1576576681
			},
			{
				"comment_id": 17,
				"body": "> [edgelordofdecent](#comment_348_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): What does this thread have to do with jews?\n\nThank you...",
				"added": 1576625356
			},
			{
				"comment_id": 18,
				"body": "> [draugrdeathlord](#comment_3_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Maybe there are people causing the division in the media and world governments\n\nIt's not \"maybe\" but absolute certain...be more confident to tell the \"Truth\" or research more...",
				"added": 1576641301
			},
			{
				"comment_id": 21,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1338_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): unity does not exist    ...so community\n\nEither way, you \"maybe\" know what I am pointing to...",
				"added": 1576724392
			},
			{
				"comment_id": 23,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1340_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): do you?or you're in your echo chamber.\n\nget lost you imbecile troll...",
				"added": 1576746312
			},
			{
				"comment_id": 24,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1345_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Lol i troll your shit(delusion)but no one but you care [...]\n\nWish your Mama Merry Xmas and not your enemies, you deranged, retarded psycho...",
				"added": 1576751731
			},
			{
				"comment_id": 25,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1347_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): lol, go in your church 'where yuo belong'\n\nplease do me a favor, upload your picture and location here, so we all can throw stones at you for others to enjoy...",
				"added": 1576757433
			},
			{
				"comment_id": 88,
				"body": "By dividing, you are digging your own grave",
				"added": 1579177578
			},
			{
				"comment_id": 145,
				"body": "More relevant than ever...",
				"added": 1592805911
			}
		],
		"1576213352_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 19,
				"body": "Ever wondered why your life, business, health are upside-down, you may be a (TI) Targeted Individual, by (DEW) Direct Energy Weapon for your health, by sabotage, suing, stealing your business, by blackmailing you, in personal and family life. \n\nYour guess, who is able to do this...",
				"added": 1576645621
			},
			{
				"comment_id": 28,
				"body": "They have hidden \"GATEKEEPERS\" everywhere to target dissidents to their AGENDA.",
				"added": 1576897867
			},
			{
				"comment_id": 31,
				"body": "Even Signal or Telegram will not protect you, once on their radar, they have infiltrated all of them, because they can.\nOne life means nothing to them because eternity, reincarnation, heaven and hell are real, they know it all too good but it is kept secret for the masses.",
				"added": 1577082310
			},
			{
				"comment_id": 33,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1383_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"eternity, reincarnation, heaven and hell are real\"some valid proof, religious moron?\n\nIt's all hidden in plain sight by signs, symbolism, mysticism for your eyes to see and decode, a good start is with the BIBLE. Beside that, the internet is full of proof, do your own research.",
				"added": 1577158630
			},
			{
				"comment_id": 90,
				"body": "They will try to cut you off from the financial system, then from family and finally friends.\nYou got to be way ahead of them to conquer.",
				"added": 1579178020
			},
			{
				"comment_id": 146,
				"body": "A Reminder to TRUTH...",
				"added": 1592805924
			}
		],
		"1576697039_1JorDyDxuLrircDbzzmn4B1ndcbSJahXLH": [
			{
				"comment_id": 20,
				"body": "Learn to write first, then bury yourself alive,...you are disgusting to humanity. No respect to the Mom who carried you.",
				"added": 1576724264
			}
		],
		"1576725447_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 22,
				"body": "> [robione](#comment_354_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): I am working on it.\n\nDo you mind to share for others to see?",
				"added": 1576731912
			},
			{
				"comment_id": 27,
				"body": "Leave home without your SMARTphone, easier said than done, but you get the idea...it can be done, just think out of the box.",
				"added": 1576895158
			},
			{
				"comment_id": 30,
				"body": "STOP USING GOOGLE (ALPHABET), THEY ARE THE BIGGEST CRIMINALS ON EARTH OPERATED IN THE HIDDEN BY THE YOU KNOW WHO...",
				"added": 1577081646
			},
			{
				"comment_id": 32,
				"body": "> [edgelordofdecent](#comment_355_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): US Government\n\nIt goes deeper than that, look at my title and do your own research...",
				"added": 1577158187
			},
			{
				"comment_id": 89,
				"body": "Do not sell your soul.",
				"added": 1579177735
			},
			{
				"comment_id": 101,
				"body": "Stop dealing with them...",
				"added": 1579755663
			},
			{
				"comment_id": 105,
				"body": "It's time to fight back.",
				"added": 1583770873
			},
			{
				"comment_id": 109,
				"body": "THESE SATAN'S MINIONS WILL BURN IN HELL...",
				"added": 1583917694
			},
			{
				"comment_id": 111,
				"body": "\"The BEAST\" is Hidden in Belgium.",
				"added": 1583997417
			},
			{
				"comment_id": 113,
				"body": "ALL OF THEM NEED TO BE BROUGHT TO JUSTICE. JUDGEMENT DAY WILL FOLLOW.",
				"added": 1584172429
			},
			{
				"comment_id": 135,
				"body": "relevant...",
				"added": 1586694904
			},
			{
				"comment_id": 147,
				"body": "A Reminder to TRUTH...",
				"added": 1592806023
			}
		],
		"1576885309_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 29,
				"body": "finally, waking up huh...",
				"added": 1576900671
			}
		],
		"1577499241_1Hrz1rynf2scp9MZ7Abt6FfRgUMCmZ8H2v": [
			{
				"comment_id": 34,
				"body": "Hong Kong is an amazing, thriving city, good for business, transparency and taxation but too expensive for living, unfortunately. I guess, it all comes at a price.\n\nTo all Hong Kongers: \n\nYou have allowed for too long, bad actors like CIA, MOSSAD and the ZIONIST to use your infrastructure to launder money through your financial hub and use the ease of doing business for all kind of criminal activities, unfortunately. Furthermore, there is a spell going on, as we speak, to destabilize the city by a very special book by \"the chosen one\" .\n\nTo be honest, Hong Kong belongs to China (1997) but \"they\" want to steal it from China again, although agreed otherwise (1997). \"They\" would rather destroy that amazing hub than to see China controlling it, especially all the criminally involved CIA, MOSSAD, ZIONIST living and operating from the city, that's the reason, they pushed to abolish the \"Extradition Bill\" via media propaganda. \"They\" are scared to death now to be prosecuted and many of them have left Hong Kong already for other innocent countries.\n\nChina knows this too well and despite the cost of daily unrest, Chinese government have adopted a wait-and-see strategy and win at the end, given enough time.\n\nTo Hong Kong citizens:\nGet rid of your foreign infiltrated criminals within your city, social credit is coming worldwide, it's not only a Chinese problem, but it is being used as propaganda to scare off Hong Kong citizen and others living there.\n\nWAKE UP HONG KONGERS AND SAVE YOUR CITY FROM THIS HORRIBLE SPELLS (in disguise) COSTING YOU A FORTUNE.",
				"added": 1577620954
			},
			{
				"comment_id": 36,
				"body": "Hong Kongers are smart and what is going on, as we speak, cannot be explained logically, it's under a spell for the few ones \"in the know\" disguised for the masses...",
				"added": 1577775233
			},
			{
				"comment_id": 47,
				"body": "Some proof of what's going on...and the culprits, Hong Kong and China know too well.\n\nhttps://www.hongkongfp.com/2020/01/04/us-photography-professor-covered-ongoing-protests-barred-hong-kong/",
				"added": 1578116505
			}
		],
		"1577722948_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 37,
				"body": "Be careful, what you wish for...Satan can hear you and he will come for your soul, if you can fulfill his Agenda...",
				"added": 1577775456
			}
		],
		"1577334436_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 38,
				"body": "If liberty means anything at all, it means the right to tell people what they do not want to hear.\nGeorge Orwell",
				"added": 1577776257
			},
			{
				"comment_id": 50,
				"body": "MONEY IS THE ROOT OF ALL EVIL, ESPECIALLY USD, CHECK THE SYMBOLISM ON THE DOLLAR BILL, HIDDEN IN PLAIN SIGHT, FOR OPEN EYES TO S33.\n\nUNFORTUNATELY, MOST PEOPLE (ESPECIALLY, THE ONES MENTIONED HERE) WOULD SELL THEIR MOMS, DADS & CHILDREN FOR MONEY, FAME AND POWER.",
				"added": 1578128464
			},
			{
				"comment_id": 54,
				"body": "SAME APPLIES TO MUSLIM, BUDDHIST, ATHEIST AND OTHERS, AGAINST CHRISTIANS BECAUSE THE JEWS DID THE BIGGEST SIN TO CRUSIFY JESUS, THEREFORE, THEY ARE TRYING TO TURN AWAY EVERYONE (BY WAR, HATRED, FALSE EDUCATION, PROSECUTION, GENOCIDE) FROM CHRISTIANITY, THE TRUTH AND TO OBFUSCATE THEIR CRIMES AGAINST HUMANITY. \n\nNO NEED TO BELIEVE ME, DO YOUR OWN RESEARCH AND THE TRUTH WILL SET YOU FREE.",
				"added": 1578202632
			},
			{
				"comment_id": 65,
				"body": "All bought/ collaborating  Indians, hidden cells hiding in silence? Absolutely, it's a global evil network disguised.\nLack and love of money is the root of all Evil.",
				"added": 1578466273
			},
			{
				"comment_id": 66,
				"body": "> [quantumkitty](#comment_376_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): I don't think Indians are the only ones who are broke and desperate in today's world.\n\nThat's right, citizens of every country are involved but pointing to especially Indians (huge population, poor, Buddhist and very vulnerable) in this topic.",
				"added": 1578466665
			},
			{
				"comment_id": 81,
				"body": "All criminal minions quiet like a dove, serving their MASTERS...",
				"added": 1579175932
			},
			{
				"comment_id": 148,
				"body": "A Reminder to TRUTH...",
				"added": 1592806043
			}
		],
		"1577009989_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 39,
				"body": "The further a society drifts from truth the more it will hate those who speak it.\nGeorge Orwell",
				"added": 1577776466
			}
		],
		"1577943090_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 40,
				"body": "> [hferbwauif](#comment_30_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP): kill yourself lolmuted\n\none of the \"EXPOSED\" !",
				"added": 1577943384
			},
			{
				"comment_id": 41,
				"body": "> [hferbwauif](#comment_31_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP): yes I'm Illuminati mind control now what are you going to do about it bitch boi?\n\njust exposing you and watching you closely...",
				"added": 1577943717
			},
			{
				"comment_id": 42,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1498_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): one of the \"EXPOSED\" !\n\nanother one \"EXPOSED\" !",
				"added": 1578028847
			},
			{
				"comment_id": 72,
				"body": "Do you see the pattern?",
				"added": 1578467981
			},
			{
				"comment_id": 82,
				"body": "Do you all see, wake up !",
				"added": 1579176006
			},
			{
				"comment_id": 149,
				"body": "A Reminder to TRUTH...",
				"added": 1592806055
			}
		],
		"1577776813_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 43,
				"body": "The truth is hidden in plain sight...what you hear, see, always research for yourself...",
				"added": 1578033868
			},
			{
				"comment_id": 150,
				"body": "A Reminder to TRUTH...",
				"added": 1592806063
			}
		],
		"1578007868_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 44,
				"body": "Privacy Breach !\nSolution: Talk nicely to neighbor, install a camera doing the same or else get a court order. You are fighting for a privacy long gone, my friend, and it is getting worse day-by-day.\n\nAt some point, even your bedroom will be monitored...\nWatch this:\nhttps://www.youtube.com/watch?v=_ZyNJ3cKfEg",
				"added": 1578037720
			},
			{
				"comment_id": 48,
				"body": "This is a non-relevant thread (solution offered many times) being pushed by the gatekeepers/ controllers to its irrelevancy to disguise the relevant one (see the patterns?)",
				"added": 1578117077
			}
		],
		"1578034470_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 45,
				"body": "The time has come to ISOLATE U.S. WORLDWIDE.\n\nLet them deal with their 21 Trillion debt implosion internally.",
				"added": 1578069319
			},
			{
				"comment_id": 46,
				"body": "-STOP USING USD\n-STOP USING SWIFT\n-STOP BUYING U.S. PRODUCTS\n-STOP PROVIDING SERVICES TO U.S. GOVERNMENT\n-STOP WORKING WITH CIA, MOSSAD, ZIONIST AND ALL THE MINIONS WORKING FOR THEM \n WORLDWIDE\n-STOP TRAVELLING TO U.S.\n-STOP OPENING U.S. COMPANIES FOR TAX PURPOSES\n-STOP WATCHING CNN (666), FOX (666), DISNEY (XXXX)\n-STOP THE SPYING OF ALL U.S. EMBASSIES WORLDWIDE\n-STOP IMMIGRATING TO U.S.\n-STOP U.S. INTERFERENCE ON FOREIGN SOIL\n-STOP USING SILICON PRODUCTS AND SERVICES (GOOGLE, TWITTER, APPLE ETC.)\n-STOP BEING FRIENDS WITH AMERICANS DOING NEFARIOUS ACTIVITIES\n-STOP BELIEVING THE WEEKLY SHOOTING IN U.S (ONLY PURPOSE TAKE YOUR GUNS)\n\nTHIS COULD WAKE UP GOOD AMERICANS TO STAND UP AND NOT CONSENT TO THESE ATROCITIES\n\nFEEL FREE TO CONTINUE THE LIST...",
				"added": 1578102909
			},
			{
				"comment_id": 57,
				"body": "-STOP INVESTING ON WALLSTREET\n-STOP HOLDING ASSETS IN U.S.\n\nYou will not get it back once, SHTF, mark my WORDS.",
				"added": 1578210191
			},
			{
				"comment_id": 58,
				"body": "> [totaldarkness](#comment_11_1KRJTDNcfHhogWdZRoMSkfS1FZoCCPvjer): PLEASE.  LISTEN TO thetruth. [...]\n\n-STOP BEING COPS OF THE WORLD AND MIND YOUR BUSINESS.\n\n-THE WORLD WOULD BE A MUCH BETTER PLACE WITHOUT YOU AND YOUR PROBLEMS. I GUESS 90% WOULD AGREE.",
				"added": 1578217016
			},
			{
				"comment_id": 59,
				"body": "ANOTHER INDOCTRINATED SHEEP, ASLEEP, BLINDED BY EDUCATION AND MEDIA. DON'T YOU GET IT, IT'S NOT ABOUT ISLAM. IF YOU WERE EDUCATED OUTSIDE THE BOX, YOU WOULD AT LEAST SEE, IT'S OIL, CONTROL AND YET, THE REAL REASON IS VERY DEEP IN THE RABBIT ROLE FOR ONLY A FEW TO S33 AND UNDERSTAND. LET'S FORGET THE PAST FOR A MOMENT (MANY MISTAKES HAVE BEEN DONE, YES), THE PRESENT AND THE FUTURE OF OUR CHILDREN ARE AT STAKE AND ONLY THAT CAN BE INFLUENCED AS WE SPEAK NOW. DO YOU CARE?\n\nWAR=MONEY=FORCE USD SYSTEM TO IRAN FOR OIL AND SERVICES, AND  KEEP ON PRINTING USD AT WILL AND FLOODING THE SYSTEM OR ELSE THE PRINTING MACHINERY WOULD COLLAPSE VERY FAST. ASK YOURSELF, WHY YOUR DEBT ARE 21 TRILLION AND ACCELERATING AND NEVER TO BE REPAID. GUESS, YOU ARE AMERICAN WITH ASSETS THERE, PREPARE TO LOSE ALL (ASSET FORFEITURE). THIS RESENT ACTION IS JUST A PRETEXT TO HIDE THE REAL REASON BEHIND U.S. PROBLEMS, ALL THE PAST, PRESENT UNFORGETTABLE LIES, DECEIT AND TO START A WAR AND BLAME OTHERS FOR THE COLLAPSE OF THE SO-CALLED AMERICAN EMPIRE. \n\nDO YOU KNOW HOW MONEY IS AND WAS CREATED IN THE U.S.? I GUESS NOT. RESEARCH IT.\nDO YOU WHO CONTROLS AMERICA? I GUESS NOT. RESEARCH IT.\nDO YOU KNOW WHO CREATED ISIS? I GUESS NOT. RESEARCH IT.\n\nFURTHERMORE, THERE IS A HIDDEN SPIRITUAL WAR GOING ON BEHIND CLOSED DOOR, AWARE OF? I GUESS NOT. RESEARCH\" ZIONISM\"\n\nTHIS IS ONLY A FRACTION OF WHAT'S GOING ON BUT A GOOD START TO WHERE THE U.S. ARE HEADING.\n\nRESEARCH, RESEARCH, RESEARCH AND THE TRUTH WILL SET YOU FREE.",
				"added": 1578226256
			},
			{
				"comment_id": 62,
				"body": "He was likely on a friendly, peace mission with Saudis, of course U.S. hate PEACE.\nPEACE=WAR\n\nhttps://www.zerohedge.com/geopolitical/soleimani-was-baghdad-diplomatic-mission-saudi-peace-iraq-pm",
				"added": 1578385364
			},
			{
				"comment_id": 63,
				"body": "And now this...coincidence?\n\nhttps://www.zerohedge.com/geopolitical/ukrainian-boeing-737-180-board-crashes-after-takeoff-iran",
				"added": 1578465792
			},
			{
				"comment_id": 67,
				"body": "Ukraine is a CIA, MOSSAD, ZIONIST CENTER, think about that for a moment and connect the dots.",
				"added": 1578466844
			},
			{
				"comment_id": 73,
				"body": "The list goes on...\n\n-STOP PATENTING YOUR IDEAS ON U.S. SOIL\n-STOP EMBARKING VENTURE CAPITAL FROM SILICON VALLEY AND U.S. AT ALL",
				"added": 1578472431
			},
			{
				"comment_id": 80,
				"body": "All scripted to the core...",
				"added": 1579175746
			},
			{
				"comment_id": 98,
				"body": "US citizens, don't look further, the world is not your enemy but the enemy within your own borders hidden as the false tribe, wished chosen one (CIA, MOSSAD, ZIONIST)...",
				"added": 1579587466
			},
			{
				"comment_id": 151,
				"body": "A Reminder to TRUTH...",
				"added": 1592806073
			}
		],
		"1578105095_1G79HnSxfCixN2HD2jP1Zabs1B8xzw298s": [
			{
				"comment_id": 51,
				"body": "WAR, UNREST, ECONOMIC DOWNTURN, MEDIA DECEIT, DECEPTION, COGNITIVE DISSONANCE  AND THE EXPONENTIAL AWAKENING AND MUCH, MUCH MORE FOR EYES TO S33.",
				"added": 1578196749
			},
			{
				"comment_id": 52,
				"body": "> [quantumkitty](#comment_327_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Rather than worrying about money, worry about producing the things that money buys. Gold would be useless in an uninhabited island.\n\nMONEY is just a little tiny part of the EQUATION ...but you need something of value for the next move.",
				"added": 1578197087
			},
			{
				"comment_id": 69,
				"body": "TIK TOK, TIK TOK. TIME TICKING.",
				"added": 1578467228
			}
		],
		"1578131377_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 53,
				"body": "Other countries and Unions will follow, it's a GLOBAL AGENDA, All the leaders are playing the \"GAME\" perfectly.",
				"added": 1578200935
			},
			{
				"comment_id": 56,
				"body": "> [fib](#comment_46_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK): Grow marijuana, collect books, gather tools, and preserve food. [...]\n\nFor many of us, it will be game over, long before your suggested steps...",
				"added": 1578203949
			},
			{
				"comment_id": 61,
				"body": "Judgement Day will make all atrocities of the U.S. right...",
				"added": 1578383166
			},
			{
				"comment_id": 64,
				"body": "The U.S. is fulfilling PROPHECIES...",
				"added": 1578465903
			},
			{
				"comment_id": 92,
				"body": "and Patriots will be blinded to stay for their own destruction.",
				"added": 1579178859
			},
			{
				"comment_id": 153,
				"body": "A Reminder to TRUTH...",
				"added": 1592806435
			}
		],
		"1578201607_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 55,
				"body": "Have you considered, they are all connected to the hidden \"GAME\" to fulfil the AGENDA?",
				"added": 1578203783
			}
		],
		"1578268512_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": [
			{
				"comment_id": 60,
				"body": "> [draugrdeathlord](#comment_215_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): h3bhkj5gqz4n3pjm\n\nh3bhkj5gqz4n3pjm IS NOT AN INDIVIDUAL BUT A GROUP OPERATING OUT OF A BASEMENT WITH 3 SHIFTS 24/7 THAT EXPLAINS YOUR DUMP/ SMART QUESTION ABOUT \"THEY\"",
				"added": 1578279612
			}
		],
		"1578028720_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 68,
				"body": "...to spread Truth and wake people up.\nAlways do your own research...",
				"added": 1578467022
			},
			{
				"comment_id": 154,
				"body": "A Reminder to TRUTH...",
				"added": 1592806564
			}
		],
		"1578111851_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 71,
				"body": "It seems, they are other priorities/ worries than discussing Flat Earth now...",
				"added": 1578467869
			},
			{
				"comment_id": 83,
				"body": "Big Bang is distraction from the CREATOR...",
				"added": 1579176112
			},
			{
				"comment_id": 155,
				"body": "A Reminder to TRUTH...",
				"added": 1592806577
			}
		],
		"1578547730_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 74,
				"body": "Absolutely, therefore comment on relevant one, always...",
				"added": 1578573207
			},
			{
				"comment_id": 79,
				"body": "Absolutely, needs to be brought to first page again, as reminder to all...",
				"added": 1579175612
			}
		],
		"1579155770_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 75,
				"body": "YT (AI) is reading your SOUL, always watch logged out and bookmark your favorite vdo or channel and use vpn.",
				"added": 1579172577
			}
		],
		"1578573647_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 76,
				"body": "> [1bfqutudhtexlka](#comment_153_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): as far as i know , you can't ban someone on zeronet , you can mute him individually , so if you disagree with his comment you can mute him and you will never see him on your zeronet again\n\nAnother one joining the club of IMBECILES, a copycat of h3...",
				"added": 1579173474
			},
			{
				"comment_id": 95,
				"body": "At least, I brought his inconclusive behavior to all here, it is something...",
				"added": 1579586197
			}
		],
		"1578981843_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 77,
				"body": "> [mj6cp7czwnhyzxkp](#comment_13_1KMFhezc9fqBCbWg8xbu6HimdG5nMSQwBD): Just some kindergarten teachers worst students trying to retain their bullshit jobs. CIA, Mossad...whatever. All are wards of the state and their taxpayer's problem. [...]\n\nAnother one \"EXPOSED\", belonging to the false \"TRIBE\"",
				"added": 1579174134
			},
			{
				"comment_id": 156,
				"body": "A Reminder to TRUTH...",
				"added": 1592806647
			}
		],
		"1579116500_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 78,
				"body": "His only purpose, distract, deceit, spit on all of you...because they can (authority given by the false TRIBE), we are just their GOYIMS...have warned you.",
				"added": 1579174578
			}
		],
		"1576233739_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 85,
				"body": "He is legit...\n\nhttps://twitter.com/officialmcafee/status/1217428109873623041",
				"added": 1579177066
			},
			{
				"comment_id": 157,
				"body": "A Reminder to TRUTH...",
				"added": 1592806659
			}
		],
		"1579175074_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 93,
				"body": "There has been a contract/ understanding and it was breached by humans again, as no man can be trusted, especially men from U.S.\n\nThere will be blood...",
				"added": 1579195817
			},
			{
				"comment_id": 158,
				"body": "A Reminder to TRUTH...",
				"added": 1592806674
			}
		],
		"1579517170_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 94,
				"body": "Use Holy Wood as a Tool to find Truth, hidden, coded in words, signs and numbers in many movies, in plain sight.\n\na good movie to start with is UNDER THE SILVER LAKE\n\nhttps://www.youtube.com/watch?v=pkAztth9PpY",
				"added": 1579583658
			},
			{
				"comment_id": 99,
				"body": "> [bigbadbob](#comment_908_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): But what would be the purpose of reading into it?  To feel informed?  or to be prepared?\n\nKNOWLEDGE IS POWER and is being used by not-so-good actors for centuries to communicate among them and control us.",
				"added": 1579589972
			}
		],
		"1579313840_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 96,
				"body": "Therefore, you have been all lied to...",
				"added": 1579587055
			},
			{
				"comment_id": 159,
				"body": "A Reminder to TRUTH...",
				"added": 1592806706
			}
		],
		"1579598887_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 100,
				"body": "...will likely DIE in PRISON (ASSANGED). \"Powers that be\" don't like to be challenged at all.",
				"added": 1579753676
			},
			{
				"comment_id": 102,
				"body": "> [thetruth](#comment_100_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ): ...will likely DIE in PRISON (ASSANGED). \"Powers that be\" don't like to be challenged at all.\n\nAnd yet die in Prison...",
				"added": 1579941171
			}
		],
		"1582197021_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 103,
				"body": "Because \"THEY\" like to play on both sides of the EQUATION...manipulating and deceiving the world.\n\nGetting banned by Twitter is part of the game to make us feel, they are on our side.",
				"added": 1582242075
			},
			{
				"comment_id": 104,
				"body": "They have infiltrated everything, when I mean everything, all our lives, it's EVIL and part of the AGENDA.",
				"added": 1583748454
			},
			{
				"comment_id": 107,
				"body": "SAME GOES FOR WIKIPEDIA OF COURSE...\n\nhttps://www.zerohedge.com/political/wikipedia-disinformation-operation",
				"added": 1583824090
			}
		],
		"1583587826_154DLn4k3ckpT1v151SLaFh7mmy4TnccmT": [
			{
				"comment_id": 106,
				"body": "IT'S A SCAM, HIDDEN TAX FOR THE ONES NOT-IN-THE-KNOW.",
				"added": 1583823984
			}
		],
		"1583563665_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 108,
				"body": "SATAN'S MINIONS AT ITS BEST...",
				"added": 1583916142
			},
			{
				"comment_id": 110,
				"body": "still believing the HOAX?",
				"added": 1583997318
			},
			{
				"comment_id": 112,
				"body": "CAN YOU SEE HOW THEY PUSHED DOWN THE RELEVANT THREADS?",
				"added": 1584172273
			}
		],
		"1584256859_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 114,
				"body": "> [bigbadbob](#comment_1022_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): If I was a laywer and presenting a case to a judge, and told him to \"make his own research\"...  Do you think he would take me seriously?\n\nMost Lawyers and Judges (FREEMASON) are part of the club and \"IN-THE-KNOW\", therefore no research needed.",
				"added": 1584342169
			},
			{
				"comment_id": 115,
				"body": "relevant...",
				"added": 1584952183
			},
			{
				"comment_id": 121,
				"body": "who sees the \"DECEPTION\" beside the MINIONS?",
				"added": 1585044381
			}
		],
		"1584287601_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 116,
				"body": "relevant...",
				"added": 1584952901
			},
			{
				"comment_id": 119,
				"body": "relevant...",
				"added": 1585044220
			}
		],
		"1584645497_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 117,
				"body": "> [bigbadbob](#comment_1047_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): and..... Nothing happened.  Other than the end of the world as we know it of course.\n\nWould you still commit a crime, if you knew, your adversary knows about it? They are called \"Secret Societies\" for a reason, \n\n\"Something is always happening\", \n\nfor many things, hidden in disguise, as we speak.\n\nTheir actions are tight to \"KARMA\", they have to put their plan into your face for you to decipher, like 911 on WTC, it can be stopped, if we know their next move, otherwise \"KARMA\" will hit back hard on them.\n\nI am very happy to be wrong than to not warn people and exposing the TRUTH.",
				"added": 1585043791
			},
			{
				"comment_id": 122,
				"body": "> [bigbadbob](#comment_1053_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): \"Something is always happening\",  [...]\n\nISOLATE USA, CIA, MOSSAD, ZIONIST, 5 EYES, ALL SECRET SOCIETIES and ALL MINIONS WORLDWIDE WORKING FOR THEM, THE AGENDA NWO. THIS IS WAR ON HUMANITY, THE PEOPLE. DO NOT CONSENT AND REPENT TO YOUR CREATER, GOD.",
				"added": 1585124189
			}
		],
		"1585004492_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 118,
				"body": "relevant...",
				"added": 1585044191
			},
			{
				"comment_id": 124,
				"body": "relevant...",
				"added": 1585226793
			}
		],
		"1584983883_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 120,
				"body": "now starting to pick up in INDIA...hmm",
				"added": 1585044306
			},
			{
				"comment_id": 123,
				"body": "Seems the curse is backfiring on them now...",
				"added": 1585124891
			}
		],
		"1585226591_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 125,
				"body": "> [peppefail](#comment_35_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ): after the quarantine, visit a psychiatrist\n\nCognitive dissonance!",
				"added": 1585257335
			}
		],
		"1585842700_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 126,
				"body": "> [kaaza](#comment_6_15cApprVFcr1skAkWssq5aAXKa7pDwJJve): The main victims of #COVID-19 are patients of schizophrenia that can't have access to their medication.Press F to send prayers and thoughts.\n\nCognitive Dissonance, another BLIND AND IGNORANT SHEEP.",
				"added": 1585844770
			},
			{
				"comment_id": 128,
				"body": "> [edgelordofdecent](#comment_450_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): A bot that writes nonsense then links it to CIA, MOSSAD, ZIONIST\n\nI AM NOT A BOT, BUT THANKS FOR THE COMPLIMENT, \nLINKS TO PROOF ARE MASSIVE, DO YOUR OWN RESEARCH, FOLLOW THE MONEY...\n\nI AM HERE TO MAKE PEOPLE QUESTION EVERYTHING...",
				"added": 1585985312
			}
		],
		"1585882218_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 127,
				"body": "HAVE NO FEAR AND KEEP TELLING THE TRUTH BACKED BY EVIDENCE !",
				"added": 1585895582
			}
		],
		"1586239205_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 129,
				"body": "AND REMEMBER, EVIL FOOLS US FOR NOW, BUT GOD IS IN CONTROL AND WILL PREVAIL.\nTIME TO TAKE SIDE.",
				"added": 1586240331
			},
			{
				"comment_id": 130,
				"body": "> [tajny2z](#comment_13_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr): It's all great, but why you never elaborate on anything you claim?\n\nDO YOUR OWN RESEARCH, AND NO, I EXPLAIN SOMETIMES, IF YOU KNOW ME.",
				"added": 1586248189
			},
			{
				"comment_id": 131,
				"body": "> [tajny2z](#comment_14_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr): And I think you are able to turn the capslock off, right?\n\nIT'S INTENTIONAL...",
				"added": 1586248225
			},
			{
				"comment_id": 133,
				"body": "> [wh0dat](#comment_5_15QJDMQutfov1oMp9fF1aCPTGH3ey8NHi4): This kid is annoying as fuck.  Is there no way to block / ignore a user in Zero talk?\n\nJUST BLOCK ME...AND STAY A SHEEP",
				"added": 1586254385
			}
		],
		"1585133073_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 134,
				"body": "relevant...",
				"added": 1586694375
			},
			{
				"comment_id": 136,
				"body": "more than ever...",
				"added": 1587536559
			}
		],
		"1586683890_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 137,
				"body": "relevant...",
				"added": 1587536741
			}
		]
	},
	"comment_vote": {
		"17_1JYuNAwYAcQXhGRZKMGFGgBvvFi6F9yC7m": 1
	}
}