{
	"title": "СССР-Россия. 1988-2018",
	"description": "Что было, как было, что стало…",
	"links": "*   [USSR-Russia. 1988-2018](/18ZaNRBjjZSxV38omZS5tu3ngNExnRYxxA/) — English version of this blog.\n* [Россия 1990-х](/1JvjE44zqAhDiAxQFDRcfg8NLJo4z2Q9BL/) — параллельный проект\n*   [Tanzpol.Org Blog](/1Anxiq4y8oJUBisB7igP8jKQNK1DPGiSR1/)\n*   [Balancer's Blog](/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/)",
	"next_post_id": 10,
	"demo": false,
	"modified": 1540379208,
	"post": [
		{
			"post_id": 9,
			"title": "Никольская ул., Москва",
			"date_published": 1531897939.635,
			"body": "Так выглядела ул. Никольская в 90-е. И так она выглядит сейчас.\n\n![photo_2018-06-22_15-31-51.jpg (960x638)](data/img/post_9_photo_2018-06-22_15-31-51.jpg)![5346790.jpg (1200x800)](data/img/post_9_5346790.jpg)​​​​​​​"
		},
		{
			"post_id": 8,
			"title": "Палаточный лагерь у стен Кремля, 1990 год",
			"date_published": 1531896376.786,
			"body": "Палаточный лагерь у стен Кремля, 1990 год\n\n![photo_2018-05-23_13-16-22.jpg (800x572)](data/img/post_8_photo_2018-05-23_13-16-22.jpg)"
		},
		{
			"post_id": 7,
			"title": "Школы",
			"date_published": 1517784065.38,
			"body": "Ещё одно место, в котором изменения были очень яркими. Школа. Советские школы были достаточно утилитарными по сравнению с современными. Но их было очень много. Даже многие небольшие или труднодоступные деревни имели свои школы. Когда я в 1980-м году пошёл в сельскую школу, в моём классе вместе со мной было 7 учеников. В классе, который был на три года старше моего училось только две девочки. Весь класс — два человека :) Это было практически индивидуальное обучение :D В городах, конечно, были и большие классы, в некоторых случаях до 30-40 учащихся. Школы считались очень безопасным местом. Дети уже в первом классе ходили в школу из дома самостоятельно, иногда за несколько километров. И родители не переживали, что с их ребёнком может произойти что-то плохое. Заборы вокруг школ были чисто символическими. А часто отсутствовали вообще.\n\nПосле начала перестройки и к моменту распада СССР ситуация сильно изменилась. В школах стала появляться наркомания, преступность, алкоголизм. Я уже не застал этот период, потому что окончил школу в 1990 году. Но, конечно, много слышал об этом периоде от родственников и друзей, кто учился в школе в это время или чьи дети там учились. А ещё моя мама — преподаватель.\n\nПотом образование в России подверглось большой переделке. Школ стало намного меньше по количеству, но они стали крупнее. Вокруг школ появились заборы. На входе в школы сидит охрана. Особенно после Беслана, когда чеченцы напали на школу, в результате чего погибло более 300 детей. В последние годы школы подвергаются серьёзному ремонту, переоснащению новейшим оборудованием. Но главная беда — очень низкий престиж преподавателей. Низкие зарплаты учителей, невысокий социальный статус. Это очень большая проблема современной России.\n\nТак выглядели советские школы в 1988 году:\n\n![1.09.1988-1024.jpg (1024x803)](data/img/post_7_1.09.1988-1024.jpg)\n\n![image053.jpg (1200x850)](data/img/post_7_image053.jpg)\n\nА вот так выглядит моя сельская школа в наше время:\n\n![DUF0zBtX0AAyG8c.jpg (1200x675)](data/img/post_7_DUF0zBtX0AAyG8c.jpg)\n\nВыглядят сегодня школы, конечно, намного лучше, чем в СССР. Но вот уровень образования стал заметно слабее :-/"
		},
		{
			"post_id": 6,
			"title": "1992. Москва",
			"date_published": 1516452250.799,
			"body": "Пожалуй, пока возьму паузу, чтобы вся эта моя работа не пропадала, сделаю сохранение этого материала в виде отдельного блога в даркнет (ZeroNet). Продолжу чуть позже. Надеюсь, это интересно :) Напоследок две фотографии. Москва 1992 года и Москва 2017 года (опять же, моё личное фото).\n\n![38fd4959652096cef922f4f7df6d0f75.jpg (720x479)](data/img/post_6_38fd4959652096cef922f4f7df6d0f75.jpg)\n\n![20170812_160416.jpg (1200x675)](data/img/post_6_20170812_160416.jpg)"
		},
		{
			"post_id": 5,
			"title": "1991. Провал ГКЧП",
			"date_published": 1516452207.386,
			"body": "А это просто фотография без глубокой подоплёки :) 1991-й год. Провал путча ГКЧП, который пытался сохранить СССР. На табличке лозунг: «Долой КПСС!»\n\n![06-4371520-13.jpg (800x582)](data/img/post_5_06-4371520-13.jpg)"
		},
		{
			"post_id": 4,
			"title": "1994. Грозный, Чечня",
			"date_published": 1516451836.428,
			"body": "Тут потребуется длинная история для того, чтобы пробиться через толстый слой мифологии.\n\n![huge.jpeg (814x643)](data/img/post_4_huge.jpeg)\n\n---\n\nРоссия после распада СССР оказалась очень слабой. СССР был, по сути, конфедерацией независимых государств. Поэтому,  когда власть ослабла, он  легко распался. Россия тоже является составным государством, федерацией нескольких республик. Когда республики, из которых состоял СССР, стали независимыми, в республиках России тоже начались тенденции к сепаратизму. Особенно, после того, как Ельцин заявил — \"Берите столько суверенитета, сколько сможете проглотить\". Чеченская республика была крайне националистической, там не любили русских и она почти сразу обрела ещё не юридическую, но фактическую независимость. Увы, но одной независимости недостаточно, чтобы накормить и сплотить людей. Чечня активно культивировала из русских образ врага. Начались этнические чистки. Русских убивали, изгоняли из республики, брали в рабство, публично казнили. Точных чисел уже не будет никогда, но считается, что в Чечне в тот период геноцида было убито около 30000 русских. И ещё 200000 русских бежало в Россию, бросив дома и имущество. Но Россия была так слаба, что не стала ничего предпринимать даже после таких событий.\n\nНо этого было мало. И Чечня стала нападать на соседние регионы и совершать теракты в самой России. В 1994 году Россия попыталась навести в Чечне порядок силой. К сожалению, почти всё советское оружие на территории Чечни досталось боевикам. Все они при СССР проходили военную подготовку. Командующий ими Джохар Дудаев был опытным советским генералом. И поэтому война очень долго шла практически на равных. Вот фотография того, во что превратился Грозный после того, как чеченские войска были разбиты.\n\n![maxresdefault__1_.jpg (1280x720)](data/img/post_4_maxresdefault__1_.jpg)\n\nДве чеченских войны продолжались с 1994 по 2000-й года. В 2000-м году чеченские войска и банды, в основном, были разбиты. А к власти было приведено пророссийское правительство. Начался процесс восстановления региона. Это потом много лет вызывало много недовольство у русских националистов. Их любимый лозунг на много лет: \"Хватит кормить Чечню!\" Но результат на лицо. Теракты в России практически прекратились, а Грозный сегодня выглядит вот так:\n\n![119ssii.jpg (1200x699)](data/img/post_4_119ssii.jpg)\n\n![city.jpg (1200x801)](data/img/post_4_city.jpg)"
		},
		{
			"post_id": 3,
			"title": "1990/2014. Красная площадь.",
			"date_published": 1516451607.699,
			"body": "Прошло всего два года. 1990 year. Лагерь беженцев у Красной площади.\n\n![20121221103319316.jpg (700x465)](data/img/post_3_20121221103319316.jpg)\n\n* * *\n\n![20130703111221440.jpg (903x605)](data/img/post_3_20130703111221440.jpg)\n\nКрасная площадь сегодня — все её видели, так что это фото я больше для иностранцев публиковал. Но выбрал специально «не официальную», уже из собственного фотоархива. На фото — моя дочь :)\n\n![20140409-1902-img_8407.jpg (1200x801)](data/img/post_3_20140409-1902-img_8407.jpg)"
		},
		{
			"post_id": 2,
			"title": "1988. Конкурсы красоты",
			"date_published": 1516451386.098,
			"body": "Начну с картинок для привлечения внимания :)\n\n1988-й год был годом, когда СССР ещё казался нерушимым, но процессы его перестройки уже шли полным ходом. Железный занавес рухнул и в СССР хлынули западные ценности. Кино, литература, ТВ-шоу, конкурсы красоты... Именно в 1988 году в СССР начали проходит массовые конкурсы красоты на всех уровнях, от местных клубов до официального государственного уровня :)\n\n![Lenin_na_pervom_konkurse_krasoty_v_SSSR_1988_god_4.jpg (674x910)](data/img/post_2_Lenin_na_pervom_konkurse_krasoty_v_SSSR_1988_god_4.jpg)\n\n* * *\n\n1988\\. Конкурс «Московская красавица»\n\n![Moskovskaya-krasavitsa-88-1.jpg (938x864)](data/img/post_2_Moskovskaya-krasavitsa-88-1.jpg)"
		},
		{
			"post_id": 1,
			"title": "Об этом проекте",
			"date_published": 4672125773,
			"body": "За последние 30 лет Россия прошла очень сложный путь. Мало на свете людей, которые представляют себе этот процесс. И не только на Западе, но многие забывают это уже в самой России. Также, очень многие, знавшие Россию только в 1990-х годах, судят о ней по тому периоду. На американских форумах я попытался иллюстрировать этот путь отдельными фотографиями, наиболее ярко подчёркивающими происходящие изменения. Без какой-то определённой логики и не во временной последовательности. В расчёте на длительный процесс :) Планировалось это всё для англоязычных иностранцев, но тексты я пишу на русском и перевожу потом на английский. Подумал, что кому-то будет интересно почитать это всё и в оригинальном виде. Тем более, что уже выросло одно-два поколения тех, кто своими глазам этот период не увидел. Для подобных публикаций отлично подходит ZeroNet. А лёгкость клонирования блогов и ярко выраженная тематика прямо диктуют заведение для этой задачи отдельного блога :)\n\nНадеюсь, кому-то это будет интересно. Не стесняйтесь комментировать.\n\nИ заранее прошу прощения за стилистику. Тексты писались так, чтобы их максимально просто переваривал Google Translate и понимали иностранцы, незнакомые с историей России. Поэтому будут встречаться примитивные обороты, отсылки на очевидные для нас вещи и лёгкие гиперболы ;)\n\n## Смотри также:\n\n- [Россия 1990-х](/1JvjE44zqAhDiAxQFDRcfg8NLJo4z2Q9BL/) — параллельный проект.\n- [Мемуары Balancer'а](/1BFvnf2QHmMsjZ8dnfT89WfW8mVX7FrQj7/) — там тоже много из этого периода."
		}
	]
}