{
	"next_topic_id": 9,
	"topic": [
		{
			"topic_id": 1591510796,
			"title": "p2p/decentralized backend and database for json data",
			"body": "surprised there isn't anyone working on p2p backends or p2p databases that runs similar to ipfs where you run a node/peer.\n\nwith ipfs you have a peer that saves static files. i wonder how difficult if someone did the same thing for regular databases. i know databses can be distributed but obviously its not like running a ipfs peer. same thing with backends. lets say you run a decentralized daemon, and then you register a bucket and throw your backend files. and then if someone likes your stuff they can host it too. everyone is familiar with client-server model. if the main parts of a website(frontend app, backend server, database, static files, streaming media) can have decentralized equivalent systems then it can make adoption a lot easier and it will grow the user base.",
			"added": 1591510795
		},
		{
			"topic_id": 1591512859,
			"title": "hypothetical new american country",
			"body": "what would a new american country be called?",
			"added": 1591512857
		},
		{
			"topic_id": 1592362442,
			"title": "what if you can run your own region and have an adventure? would you? would other people? share opinions",
			"body": "if there was an entire region where there is a lot of resources, plenty of women there to have sex with(and if you want, start a family with them and have children), it is cheap living there, people there are dumb so you have higher value so the place is basically yours, and people from other regions around the world are going there as well so you can make friends. it can all be yours. though, you would have to move for some years or maybe even permanently. would you do it? if not, how many out of a 100 people do you think would do it?",
			"added": 1592362439
		},
		{
			"topic_id": 1593666130,
			"title": "my first blog post on zeronet, also on tor",
			"body": "posted about this subject on zerotalk before but now i will talk about it more on my zeronet blog\n\nhere is the link\n\nhttp://127.0.0.1:43110/165Aqxg5KpezsmV9oPTajHfUdZoXr8LVvb/?Post:2:A+better+world+will+mean+changing+the+only+region+that+does+not+fit\n\nalso on tor\nhttp://xnippwvb7nmov57x.onion/world/2020/07/01/a-better-world-will-mean-changing-the-only-region-that-does-not-fit.html",
			"added": 1593666126
		},
		{
			"topic_id": 1594759872,
			"title": "my second blog",
			"body": "http://127.0.0.1:43110/1FoesXVDqM3URaKZeMvhUh4wSXdgboJx4n/",
			"added": 1594759867
		},
		{
			"topic_id": 1595180163,
			"title": "my zites, blogs and tor links",
			"body": "i had some blogs that people were seeding but it was using the zeroblog theme which doesn't have some features that i am used to. i found a better theme, cloned it and moved all my posts to it. so i got new zite address and have to start over as far as seeders. instead of making a thread every time i make a new blog or make a new post, i will just keep updating this thread. that way i don't make too many threads.\n\ngeneral blog\n-----------------\nhttp://127.0.0.1:43110/1MkWEQaNywwKviwxg5tUE4E1n6TRfFud2F/\nhttp://44vv6f2ygg3v5zxj.onion/\n\nblog about the americas\n---------------------------------\nhttp://127.0.0.1:43110/1N2AmSZ88Ctjg6tv5eGu9QhGJdrygUFXH4/\nhttp://7z23rkjfqrppe57c.onion/\n\nblog about africa\n-----------------------\nhttp://127.0.0.1:43110/1ARh5KjdwT549rKNwJ72ehJE5uFboGZzZ8/\nhttp://omse4ax4jm2g3vy2.onion/\n\nblog about europe\n-------------------------\nhttp://127.0.0.1:43110/1CcgWnZBHLSPZWTqwnrrvRJywsjKotvEra/\nhttp://s2mjx5op3z4qbtno.onion/\n\nblog about asia\n---------------------\nhttp://127.0.0.1:43110/18x9U7DxGxFNcbjU2uwmyecSds7BQVFrU1/\nhttp://6zqs7n6hkmtb7ipm.onion/\n\nblog about living\n----------------------\nhttp://127.0.0.1:43110/15UmjxFULZ4BPtE6X1cJD2BRQPwg5cJwp5/\nhttp://wlcmvmckdwoegzlz.onion/\n\nblog about community\n------------------------------\nhttp://127.0.0.1:43110/17B6q4hcZjjHGAsfcngGWMK9GKFSeUNePZ/\nhttp://umwvv5bphrymyx7e.onion/\n\nblog about life and events\n-----------------------------\nhttp://127.0.0.1:43110/1EwuD7JcU2Xrb9qd2zRQYSbGcc2qVQ1wkA/\nhttp://therc6cfslsgeb53.onion/\n\nrandom blog\n-----------------\nhttp://127.0.0.1:43110/1Li6krN4vyXdzarbVzNrxLakd16QMe11Ue/\nhttp://ap2czrr4oitlesm4.onion/",
			"added": 1595180157
		},
		{
			"topic_id": 1596593236,
			"title": "explosion in beirut",
			"body": "https://twitter.com/sahouraxo/status/1290674344532701184\n\nwhat do all of you think, so who did it?",
			"added": 1596593229
		},
		{
			"topic_id": 1597624836,
			"title": "an app to share back-end packages with other users and run those apps at the same time",
			"body": "http://127.0.0.1:43110/15Pm3vX7uUqtBdXKMkquQceJ7nyQ58dSJ4\n\nthat is the repo on gitcenter on zeronet, its a nodejs app\n\ni had this idea where multiple people can run the same bkac-end server app at the same time with a hash, like this\n\nsomeHASH8274376/some/route/endpoint\n\nwhen someone hits that endpoint, then the someHASH8274376 turns into a url/ip like -> 182.456.234.345:3000/some/route/endpoint or someurl.com/some/route/endpoint the hash basically routes to a random url/ip that is sharing that backend app. so multiple people can run a specific app. unfortunately, it did not work out. i couldn't make something that automatically routes to a random address. i got close though. i will make a tutorial for this app. i will keep on working at it and see if i can finish it out exactly how i wanted it. as of right now this is how it works.\n\nit uses webtorrent and hyperswarm-dht to keep up with peers. webtorrent is used to share the apps/packages with other peers. and then when you run those apps, the dht share that address, with the command inputs you can do look ups and see who else is running that same app. once i post a tutorial, i will paste it here.",
			"added": 1597624828
		}
	],
	"topic_vote": {},
	"next_comment_id": 68,
	"comment": {
		"1591512859_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": [
			{
				"comment_id": 1,
				"body": "states of the american league or divided states of america(cutting edge name)",
				"added": 1591522962
			},
			{
				"comment_id": 3,
				"body": "asshole states of america lol",
				"added": 1591571211
			},
			{
				"comment_id": 5,
				"body": "how about united states of america.... 2",
				"added": 1591581615
			},
			{
				"comment_id": 6,
				"body": "the sequel to the 1776 classic smash hit",
				"added": 1591581696
			},
			{
				"comment_id": 7,
				"body": "southwest usa will be interesting",
				"added": 1591623745
			},
			{
				"comment_id": 9,
				"body": "how many years or decades you think usa has left as a superpower?",
				"added": 1591630394
			}
		],
		"1591510796_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": [
			{
				"comment_id": 2,
				"body": "they have orbitdb which saves the json data in a static file on ipfs, don't know how the performance would be for large sites",
				"added": 1591571137
			},
			{
				"comment_id": 4,
				"body": "there is also  the fediverse but it can still fall into the same issues",
				"added": 1591581125
			},
			{
				"comment_id": 8,
				"body": "> [ls9125s](#comment_19_1MoiNscMBZopwz1HdWDky1kXHAb4GrTruH): SQLitehttps://www.sqlite.org/saves all of the data into a database instance specific file that is determined at the initialization of a database connection. SQLite is implemented as a C library. The PHP stdlib includes that C library, meaning, SQLite is supported by PHP by default without any database drivers. SQLite is supported by many, if not all, programming languages and an SQLite database size can be multiple GiB, although the SQLite file based approach is totally unsuitable for a situation, when a lot of threads tries to access the database at once, as is the case with web sites with lots of simultaneous visitors. The SQLite supports almost all of the standard SQL. That being said, a \"back end\" is still an oxymoron in the ZeroNet world. What might be done is that the browser side JavaScript might usehttps://github.com/emscripten-core/emscripten/wikito run a console application that is written in C and that console application might run the SQLite, which might read in the SQLite database, but that unnecessarily complicates things, because then the option might already be the use of thehttps://javascript.info/indexeddbcombined with thehttps://jsstore.net/ [...]\n\nbe a better model later by improving as you go along. adoption and user traffic is what matters and what decides what gets used. a similar but different model will makes sure that any regular user can smoothly move over and use. a model that is too different will be lowered to an alternative with low amount of users worse it might be known as a place for \"dark underground people\"...... EXACTLY what people say about zeronet. i see zeronet and the idea zeronet brings as a piece of a bigger whole",
				"added": 1591624823
			}
		],
		"1591804075_12MBVCw8iNrKvgTrV5NMPtPf6Z5V2WRHYU": [
			{
				"comment_id": 10,
				"body": "sure it can hold big sites, but it wouldn't matter without a user base and traffic",
				"added": 1591899244
			}
		],
		"1591828065_1gn57j2UokAkXvA1VyhkHvKZvg59RoXuW": [
			{
				"comment_id": 11,
				"body": "there is fun in everything. fun in pisitives of life and the negatives as well. so its great to build, but it is also fun to destroy.",
				"added": 1591899375
			},
			{
				"comment_id": 29,
				"body": "you have always had these undesirables. the problem is their numbers have grown, as the concept of globalism and the \"world community\" grew.",
				"added": 1592271853
			}
		],
		"1590981433_19mfoWfh42vCabe3TVkFSXRTJKyFqmiMUA": [
			{
				"comment_id": 12,
				"body": "as far as communities go, it is non-black on one side and black on the other side. how ever you cut it, non-blacks can as a lowest common denominator build basic functional communities and systems, while black can not.",
				"added": 1591899551
			}
		],
		"1591900871_19Nh4E7nU8DstH29eriZNvAxg6nHuXCrqk": [
			{
				"comment_id": 13,
				"body": "the world is doing alright",
				"added": 1591911623
			},
			{
				"comment_id": 14,
				"body": "> [getit](#comment_2_19Nh4E7nU8DstH29eriZNvAxg6nHuXCrqk): what world do you live in??\n\nyou don't think the world is doing good? explain, why do you think the world is doing bad?",
				"added": 1591982293
			}
		],
		"1592059237_1QPc2ZGPDgxrTJc4jMdEH4XrEb7gQBs4t": [
			{
				"comment_id": 15,
				"body": "without it having more user base and higher traffic it will not mean anything",
				"added": 1592061430
			},
			{
				"comment_id": 18,
				"body": "> [cexy](#comment_35_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): No password yet further from corporate spies! [...]\n\n> [xpyxel](#comment_4_15ebtdT12VepdkSH4fX5qkRdXkM5Kpf7t8): I kinda like it having a smaller user base, feels \"exotic\" if that makes any sense\n\nas the eyars go by, clearnet companies will restrict things and make new rules to kick out people speaking honestly. wayback machine is disabling ebooks for examples. with all these developments, guaranteed communication is not possible anymore. an alternative would be a good thing to have. but for this alternative to be practically viable, it needs to be easy to move over to and simple.",
				"added": 1592098646
			},
			{
				"comment_id": 20,
				"body": "as things go forward, people will will post their pre-approved posts on the corporate websites. they will buy their corporate food and have some corporate kids with their corporate wife. then they will die and pass on from their corporate life.",
				"added": 1592153192
			},
			{
				"comment_id": 23,
				"body": "> [cexy](#comment_35_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): No password yet further from corporate spies! [...]\n\nits great to find the info you want very quickly but the ability to communicate itself is more important. the main problem of crapnet is they can purge you and any alternatives are taken down by playing dirty. there is twitter, then someone makes an alternative. people brand the alternative as a bad project and people don't use it and the webhost of the alternatives kicks them out. what is needed is a system where they do not have a way to stop alternatives. if things ran like zeronet then it would be better. if one day you start hating twitter, you can switch to an alternative all the time. no one can be turned off. web devs and web designers are set in their ways though. they way they create sites might not fully transfer over to zeronet, for example, databases. people don't wanna learn new things. so its an uphill battle. for alternatives to take off, it has to be either super simple or similar to the conventional stuff and then change over time.",
				"added": 1592186459
			}
		],
		"1591776814_1EisAdDMyEXWtPiKWM8t4wme5yXX1q9552": [
			{
				"comment_id": 16,
				"body": "fuck twitter",
				"added": 1592061462
			}
		],
		"1591795514_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": [
			{
				"comment_id": 17,
				"body": "> [agentrogue](#comment_17_13gz7jEayVZjubcAGS16kR3Ze4RJSgVFVw): this is honestly a solid indicator of the growing political instability of America. only a matter of time before we see more of these zones pop up or violent suppression of them by the govenment waco/ruby ridge style. either way this situation has little chance of going back to normal. probably a good idea to have a plan in your back pocket incase things really go to shit.\n\nthis zone thing is great",
				"added": 1592062334
			}
		],
		"1592140848_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": [
			{
				"comment_id": 19,
				"body": "they do not need any reforms, they need to harden up even more",
				"added": 1592151885
			}
		],
		"1591821395_19ev8HmfPQ2VC8aWDA4Ck7E2vLYDYFgw9P": [
			{
				"comment_id": 21,
				"body": "> [anonymouslogin](#comment_206_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): A more sustainable approach is to promote p2p network like zeronet to more content producer. So their (quality) content will be seeded by peers.And the network will organically discard content that no one else care.\n\nhopefully this decade will see lots of p2p and distributed developments",
				"added": 1592153609
			},
			{
				"comment_id": 24,
				"body": "hold it on ipfs",
				"added": 1592186567
			},
			{
				"comment_id": 28,
				"body": "> [halo1117](#comment_11_1FWLs7rQh1QN8q6hvu82NUVokaU9Er7XsJ): Zeronet + ipfs will be better\n\non an another note, as soon as there is a p2p nosql database like ipfs but for holding json data, i will jump on making sites for the dweb/p2p web. i am to used to making sites the regular way, backend + db then front end. i wish concepts like p2p dbs and p2p backends would be further a long. hopefully this decade. concept like these would make backing up things and presenting/displaying them a lot easier. why i am brining up a p2p db/p2p backend is dynamic and realtime content. that is what people are used to.",
				"added": 1592233894
			},
			{
				"comment_id": 32,
				"body": "> [glosrozsadku](#comment_2_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG): Come on, The Freenet Project gives you both anonymity and distribution. It's like Zeronet+IPFS written in Java. A little old, a little slow, a little complicated to run at the first time, but also mature, stable and field-tested. And it's perfect for storing large volumes of data. https://freenetproject.org/\n\ni think people will go with zeronet and ipfs and whatever alternatives that can be added along with these 2. zeronet is simple, and ipfs is simple as well. easier to get started and they have their roles.",
				"added": 1592316925
			}
		],
		"1592177248_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": [
			{
				"comment_id": 22,
				"body": "interesting, so do i have the correct tldr. replacing older blood with younger blood makes you gain years back?",
				"added": 1592185434
			},
			{
				"comment_id": 26,
				"body": "> [frankwalter](#comment_19_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV): No, by using a solution of substances found in plasma, old age can be reversed, not young blood. They have not given the precise formula, but they will give it in the final research, because they are patenting it. \"Young\" blood is only a clue, however the same can be done with synthesized products. You won't have to kill children for the intent, because some on reddit believed so lol\n\nhuh amazing. nice, i will be following this thing, hopefully they have more developments",
				"added": 1592233534
			}
		],
		"1590579164_1G7AgufdSvApA47h2Y4JhFMViX1g5Q27ho": [
			{
				"comment_id": 25,
				"body": "hey thanks for this software, this is the kind of stuff i was looking for",
				"added": 1592186594
			}
		],
		"1589480365_1EgS5evb1aJWQuYS9kwn4jXyUgxfiWWoZ8": [
			{
				"comment_id": 27,
				"body": "there is vpn services that take only bitcoin, so your info is not given to them. i would probably use them",
				"added": 1592233607
			},
			{
				"comment_id": 59,
				"body": "> [zeronetbackups](#comment_13_1NnNkUjvgoqCmr2mFkUx8HWJ28Nx1CYP3E): I don't understand how this makes one anonymous. You connect to VPN's from your own IP. If they keep logs then using bitcoin is fucking useless.\n\nthis thread was about vpn, so i suggested an alternative vpn. doesn't mean you will be anonymous. if you want to be anonymous or close to anonymous as possible, use tor",
				"added": 1596042718
			}
		],
		"1592264885_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": [
			{
				"comment_id": 30,
				"body": "yes, this thing is NOT a challenge to the system. it IS the system(or the \"ideals\" of the system) times 10. this \"movement\" has set a bar for the system/public to follow. for the next 5 to 10 years, things will become more consolidated and restrictive. the start and end of all this is usa. as long usa(west by association) leads things and projects its power, all this stupid crap like 24/7 race talk and rioting over police stuff will grow. until the usa declines and loses ground, which is inevitable. we are watching a very good experiment at work, and the knowledge will help future historians. let's help them by documenting all of this.",
				"added": 1592276231
			},
			{
				"comment_id": 33,
				"body": "> [0435048ijg](#comment_36_1e6paNoDoqwCZGNa4o4uX43GrawvJuVB5): The changes will never come, precisely because peaceful protests do nothing. You must work from outside the system in order to achieve any meaningful change. Our political system in America does not care about the will of the masses and never has. It was not constructed to act that way. The American political system is designed to facilitate and maintain the existence of property and plutocratic domination. The only thing that can help us at this point is a full blown revolution against the American government.\n\nkind of agree. there does not seem to be a middle ground and it does not seem like things can be fixed or changed. either usa falls or it doesn't(which will keep all of this going).",
				"added": 1592317709
			}
		],
		"1592307347_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji": [
			{
				"comment_id": 31,
				"body": "use one of the search engines on zeronet",
				"added": 1592316549
			}
		],
		"1592336884_15BUFmc7TAvBcv9ay1y8uaorEwXGrteSVT": [
			{
				"comment_id": 34,
				"body": "what?",
				"added": 1592338181
			}
		],
		"1592362442_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": [
			{
				"comment_id": 35,
				"body": "> [frankwalter](#comment_23_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV): Why not do the same thing with religion instead? There are a great many African peoples where the Catholic Church has not yet gone. You just go there and start saying things a little more fun than the Catholic Church. Like you're a prophet and instead of using vaccines you're working a miracle. Religion or region, I've always liked doing things like that, but you must have a lot of friends to do it with. The truth is that very few people want adventure. At least 10 that I told, only one of them said, \"that's cool.\" And you know, to do things like that, you need people you trust around you.\n\nsub-saharan africa is the region this post was about, looks like you got it somehow. there are multiple ways movement of people can happen. you are right, most people do not like adventures. for example now in the modern day, economic/easy life is clearly one of the biggest reason, if not the biggest reason. like the mass movement of people into europe. then you also have it where countries sends their own small group of people somewhere else, because population density reasons or security reasons. like uk sending their prisoners to australia. it is not for the adventure, fewer people will go because of a journey. the more things move forward, sub-saharan africa looks like it hits multiple points for people.\n\nfirst economic, you have china, russia, india, and few other countries trying to do a lot of things there. especially china, they are doing a lot of things there. they are at the bottom compared to the world, they can not develop the resources they have since they have no industry. second women/family, countries across north africa to east asia have more males than females. i can see them having incentives to go there to find females to have sex and have a family later. you have a region where you can send some of your frustrated male population. third low cost, once these workers and foreigners find out they can live cheaply, there might be an entire supply of people(mostly males at first) that would be interested to go there. fourth conquer, there are always few guys who wants to take over places. pretty self-explanatory, this place should be the easiest to take over.\n\ni am seeing a lot of connections. i might be off, i just wouldn't be surprised by seeing something like this happening in the future. it has all the ingredients.\n\ni didn't think about the religion part though, huh i can see that. people might want to go and spread themselves by using religion. asian christians might wanna go there, i have met some. you got arabs too. you have talked to others about stuff like this, nice. i wish i knew more people who can talk about things like these. its very interesting. i find it fascinating. i think the more the years go by, the more people(mostly guys) will be doing unconventional things like this. especially as the world changes, this year alone has been pretty crazy.",
				"added": 1592455873
			},
			{
				"comment_id": 36,
				"body": "yeah dumber people might be more superstitious. superstition might be a good way to get in.",
				"added": 1592536616
			},
			{
				"comment_id": 37,
				"body": "> [edgelordofdecent](#comment_569_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Sounds like most regions\n\nthere are a few places that are not in the same standards as most countries in the world. papua new guinea, bhutan, and most of sub-saharan africa are the only major parts of the world i can think of the top of my head. sub-saharan africa is different than the others since it does commerce with the rest of the world while papua new guinea and bhutan is more isolated and introverted.\n\n> [cexy](#comment_38_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): Dumb people are most places majority. Financial hubs however, cities, filled with them, are obscenely over-priced, and any freeminded productive person will face a fascist financier legal shoe on their neck first minute of their honestly earned success. A woman attracted to such a productive intelligent man will leave him first time she will get a periodical tantrum correlated with the financial fascist confiscating his wealth of which tiny portion will be given to her as a bribe when she applies for a social welfare [love&share]. Not all women fall for it, but most. Most places are full of resources in that sense. They end up so miserably, because the higher value men can't keep those places theirs as you say and they are then taken over by twats and lowlifes in THE suits.\n\ndon't think it is simple as that. most people in most countries has a certain average standard. the difference i see is in regions. certain region's average standard has a huge gap compared to the rest of the world.\n\n> [frankwalter](#comment_27_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV): Yes, I agree, even in my opinion since the economy has become like today, people have gradually become lazy and do not even think about doing similar things, which in ancient times was normally. Which is fine, however, in recent times, many of these things seem crazy, and it seems exaggerated to me. That is, it has gone from a time when the state was only a tool (although I do not want to exaggerate, because they guillotined you easily enough), to now where is the core of a population and there is NOTHING more important and all choices have to go through this. The terminology you used in the first post is intriguing, that is, the last time I heard these things was in a TV series or a movie. Or in some biography of some 18th century pirate lol. Precisely because in those periods it was the norm, as it would naturally be.\n\npirates lol, i take that as a compliment. if globalism declines a little bit then these type of adventurous sentiments grows. the job and rent life has taken everyone over. i wonder how something like that can be undone. i wonder if people had more hardships, would they become even more stuck to their city life and think ideas like this is crazy, or would they learn to let go of the city stuff and be more adventurous. if usa is on a decline, usa shouldn't be the same in 20 to 30 years. i wonder what the reaction of the people will be.\n\nyeah, you want people you trust at first. other than if it is business, or something backed by an organization. you have any prediction for the next 20 to 30 years? how the world will go, anything you are certain and sure about? by the way also, how often do you get on zeronet and how long you been using it? i don't talk to a lot of people like you, most folks wouldn't receive this post in a positive way or wouldn't care.",
				"added": 1592626323
			},
			{
				"comment_id": 38,
				"body": "> [frankwalter](#comment_30_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV): The estimate I made before, 1/10, is a lot, keep in mind that my friends are among the new generations, all in their twenties. I have the impression that many are returning these feelings especially in the new generations. Also consider that it is also right that not everyone has them. Even in the past there were craftsmen who all they wanted to do was crafts. It is normal for only a minority (like 1/10) to consider such things as fun. However, the problem is another, today's society makes people feel very small, able to do nothing if alone, I don't know if you have heard around that on average people underestimate what they can do in 10 years. These feelings remain only dreams therefore. But what do you care? It is not necessary for others to have these feelings. As long as you have them. However if you are interested in a prediction here's what I think: [...]\n\nthere are multiple reasons why i care about things like these. but i can sum it up with accountability for communities of human beings that live around each other. you will have multiple regions that will be hosting multiple groups of people. its efficient and cool if they fit into a certain standard, but few groups out there on the average will be an anchor weighing the rest down. few of these groups will not be able to meet certain societal standards. case in point, sub-saharan africans. sub-saharan africa is also one region that is growing in population, and it is growing beyond what the local environment would naturally handle because of importing things from the west and the rest of the world. now add in globalism and movements of people initiated by the established powers (the west, usa, israel, saudi arabia, power projecting from usa). with all this you have them moving up to europe. with eu approving all this, the western european countries take the hit. this is one example. maybe as things move forward, they will move to asia or australia, or latin america. i can not help but see a big contrast between some immigrants. so i thought what is the best way to take care of the immigration issue? have probably the last great adventure on earth, and change the place where the sub-standard immigrants are coming from. it starts with the mind, mentality, will, desire, uncomfortable existence that makes one change themselves and their thinking. it will be good if you are correct about the new generation. a new paradigm of thinking would be nice to see from people. these things are interesting to me, so it is a thought exercise. it was one scenario that seemed very interesting. though i am aware the future/fate/life/god/universe/take your pick lol, will bring what it wants to bring. this was more of the on the ground, political/human events stuff. now on to the more interesting stuff.\n\nglad you brought up colonization of extraterrestrial places. yes, mars, utilizing the moon, orbital habitats for building vehicles and ships. also airships in venus which would have the perfect atmospheric pressure for people up high in the venus sky. i am sure one day the outer solar system will be utilized as well. opening space will obviously not happen quickly. but people will be surprised how much space will change 15 to 30 years. then you have the maybe the start of longevity with longer lifetimes. i have been seeing more stuff on anti-aging field and they seem like they are doing a lot of work. also prosthetics. awesome to see, would be nice to get some years back lol. interesting times we live in.",
				"added": 1592690364
			}
		],
		"1590898064_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": [
			{
				"comment_id": 39,
				"body": "he is not important enough for the world to protest and riot. he is important enough for usa to protest ann riot though\n\nhe shouldn't have died, though i don't care about him either. he was a negative for society.",
				"added": 1592690723
			},
			{
				"comment_id": 40,
				"body": "> [metalhat](#comment_4_1BYktGU5CJE8npw2TMaizUC9sekZ6iV2um): let's be real here guys, all the race war bullshit being spout out by the media is being used to distract the masses from realizing we need a class war against the elites\n\nyou are correct, but at the same time, all these things happening itself also says the country is disconnected and there is less of a center. a country that is mentally and soulfully intact would not be having these things happen to this extent. usa has been splintered for awhile and now it is leveling up that splinter. it will be a good thing to study.",
				"added": 1593230982
			},
			{
				"comment_id": 41,
				"body": "> [wircu](#comment_1_1D5qCaq8QxxkxLoFRUF3pznN3fAnQitMi9): It's amazing how empty this, lets remember the black man who died by police. in the west where the amount of black people killed by cops is less than white people killed by cops. [...]\n\ntrying to make people care about something never works. all this is telling you what they care about, so basically they do not care about slaves in africa. now if you also stop caring then the world opens up. means slavery is ok and open in africa, so if you want slaves, then go there.",
				"added": 1593290914
			}
		],
		"1593525780_12vUEi3fE9s7VKn8XtAaRfdEKtgfhuDTmJ": [
			{
				"comment_id": 42,
				"body": "introductions of phenomenons such as mass migration and slogans such as black lives matter, a polarizing impact has already occurred. it is not problems and solutions. it is events and results. if a society wants to live on and be peaceful and have a mentally rich life and most of all survive, you do NOT introduce mass migration and slogans like blm into your society. we live in the world but people are not global, people want to personally live and see their family and friends live. you can even say sentiments such as yours are a sign of the unrest that will be coming. for every person who wants to be \"open\" another wants to be \"closed\" and with that you get conflict. west europe/north europe fucked itself, it is what they deserve. can't have sympathy for people who do this to themlseves by their own hands. well not all by themselves, they became the bitch of usa thats also another reason lol.",
				"added": 1593542396
			},
			{
				"comment_id": 47,
				"body": "all this love, hate and care stuff seem like a huge waste of time",
				"added": 1593822596
			}
		],
		"1593666130_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": [
			{
				"comment_id": 43,
				"body": "plan to make more blog posts later, good to contribute to alternative networks",
				"added": 1593691137
			},
			{
				"comment_id": 44,
				"body": "> [styromaniac](#comment_2407_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It's not the first blog post on ZeroNet. It's YOUR first blog post on ZeroNet.\n\nthat is obvious. how and why would i be the one to have the first blog on zeronet? lol",
				"added": 1593700650
			},
			{
				"comment_id": 45,
				"body": "> [styromaniac](#comment_2408_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Just sayin'. Newbies might not have known better had you not updated your title.\n\nmakes sense, didn't think about any new person using zeronet. wonder how many new users zeronet gets every week/month.",
				"added": 1593714194
			},
			{
				"comment_id": 46,
				"body": "> [frankwalter](#comment_45_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV): Seeding\n\nthanks, i plan to submit another post tomorrow. you have any site or blog on zeronet? i like reading a lot of the stuff on zeronet and other networks.",
				"added": 1593822152
			},
			{
				"comment_id": 48,
				"body": "> [frankwalter](#comment_46_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV): At the moment not, but possibly in the future I will do one about physics and biohacking.\n\nthat would be cool, i share those interests. i listen to thespaceshow.com sometimes, they have physicists that come in as guests. sometimes though it can get technical, i'm more of a general layman. still interesting stuff. biohacking stuff is interesting too, i thought more people would be experimenting by now. small devices shouldn't be a big deal compared to replacing someone's hand. the north compass device seemed cool, it goes on your chest and then you know where the north is all the time. i'm sure things will grow as time goes on. subject of enhancement/biohacking seems to be expanding right now with the neural-link project.",
				"added": 1593876762
			}
		],
		"1589945996_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [
			{
				"comment_id": 49,
				"body": "> [aassddff](#comment_78_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): Yeah, people talk about zeronet like it's a tor replacement or some shit.\n\nwhy not just use the tor feature on zeronet? its already built in",
				"added": 1594165890
			}
		],
		"1594225869_1FYnqRnNx4xbmec3dhwMaq1aE8WCqAVPHL": [
			{
				"comment_id": 50,
				"body": "you can learn internet marketing. there are a lot of internet marketing forums that you can learn from. but tttaevas is correct, what skills do you have? what are you good at? what kind of person are you? all those questions are important.",
				"added": 1594230097
			}
		],
		"1569889390_1NVmsWAF88eiamogSRiUzzSVKbsakUnn62": [
			{
				"comment_id": 51,
				"body": "there is msgsafe.io, i have used them before. did what it was suppose to do.",
				"added": 1594563383
			}
		],
		"1594602645_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 52,
				"body": "wait, i thought they selling their services for money. do they have a free tier or something?",
				"added": 1594606414
			}
		],
		"1594759872_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": [
			{
				"comment_id": 53,
				"body": "> [styromaniac](#comment_2483_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I have sad news for you. You cloned Nofish's ZeroBlog, which has an unreadable mobile dark theme. I already opened an issue about it. I'll let you know when it's fixed so you can upgrade the code.\n\nthat sucks, i didn't see that problem coming lol. yeah man that would be awesome let me know when it is fixed. i'll update what needs to be updated.",
				"added": 1594760931
			}
		],
		"1594775906_1ufDwJisEDriKQxYJSz2HuUhgqAG15JyL": [
			{
				"comment_id": 54,
				"body": "if it is possible, and from what i read it seems doable, then yeah its a great idea. so you download a single app, in this case zerome. that app comes with its own instance package of zeronet which runs. but it only focus and runs zerome as the only site/app. so you just have to make the ui/look/feel of zerome better. while i know javascript/nodejs and a little python. i never did a big project like this. i have only made basic front-ends and basic backends. vuejs, and nodejs/express. made my own version of a very small and light \"chan\" sites, so basic stuff, kind of boilerplate code. i haven't coded in awhile though. but coding concepts are the same so i am sure i didn't forget everything. i would be better for the internet marketing phase. its what i have been doing for a long time.",
				"added": 1594781757
			}
		],
		"1595165517_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 55,
				"body": "when i first came to zeronet i loved it, i still do. but as you said, zerotalk and zerome and other zero places are not as active anymore. i loved the content and conversations that happened here. sure, i saw crazy, zannie and trolly things sometimes, but most of the stuff was thought provoking and actually interesting. if people on zeronet are moving over to seeding movies and just watching movies then that would suck because that means less content creating. you have clearnet for movies. if people are just creating their own videos instead of writing then i can understand that, making videos of your thoughts and opinions is easier than writing. i just hope people are not sitting for hours watching mainstream movies when they can do that on clearnet. things like zeronet is needed, i made a lot of blogs which i plan on updating when ever i want to write about something. i'm thinking of making videos where i can elaborate on the things i write about. if i share my ideas about humanity, the world, the future, religion, culture and other things my posts would be buried if not removed even though i never use hateful or harsh words. in here people actually consider ideas and talk.",
				"added": 1595176639
			}
		],
		"1595180163_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": [
			{
				"comment_id": 56,
				"body": "some posts on the tor sites are missing, i will update them tomorrow",
				"added": 1595201749
			}
		],
		"1595245747_1H957LnCvbdc8nSN3j4miBMMNH2awZ2Dst": [
			{
				"comment_id": 57,
				"body": "yes more languages would be good. surprised we don't have hindi as well. that is a big part of the world. clone zerotalk and run it.",
				"added": 1595251820
			}
		],
		"1595367284_1EdFvRMCSsjRQDSwKEaYDu3aU2o5PfzhrX": [
			{
				"comment_id": 58,
				"body": "i'm gonna wait until other people tries this",
				"added": 1595391529
			}
		],
		"1596507535_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": [
			{
				"comment_id": 60,
				"body": "i stay in america for some months then southeast asia for some other months. so yeah im kind of american. so what cover up are you talking about?",
				"added": 1596524711
			},
			{
				"comment_id": 61,
				"body": "> [conservador](#comment_1_13hd8JZq58AiYtoP6Ggq1FYUnu6DjKv3g4): I live in Brazil and I can confirm that this is a very orchestrated move from communist China. Here China is moving fast, buying lands, energy plants and transport structures. The same strategy that is being implemented in US is being implemented here. Journalists that are exposing this are being banned from social media and some of them are being arrested. These are journalist that did not commit any crime, they simply exposed the communist strategies. Most people don’t understand this. They are losing their ability to think. Here in Brazil is much worst than in the US. Our most important journalist has left our country last week so he could share some information about our Supreme Court, which is one the most powerful arms of the communist China in Latin America. [...]\n\nget on zerome, i want to follow people from latin america and other regions",
				"added": 1596587040
			},
			{
				"comment_id": 63,
				"body": "> [otbtechnologies7](#comment_70_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w): I may not be in Latin America, but I have two connections there. Add me on ZeroMe if interested. Thanks.\n\nadded you",
				"added": 1596648822
			}
		],
		"1596593236_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": [
			{
				"comment_id": 62,
				"body": "> [zaron](#comment_166_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): Seems to have been a fireworks warehouse.. so maybe Bart Simpson?\n\ni am 90 percent sure there was no foul play. just leaving 10 percent open because you never know these days. but yeah tragic. i hope the best for lebanon.",
				"added": 1596598705
			},
			{
				"comment_id": 64,
				"body": "> [thorburn](#comment_91_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Not sure they use Nitrous oxide in fireworks...Bart could have some fun with it though. The Lebanese foreign secretary resigned the day before. The Lebanese government is bankrupt due to predatory IMF lending, and investments in useless projects. They have been refused further international loans. Lebanon is allied with Syria and Iran both of whom are in a financial war against international sanctions. Ukrainian ship moments - Metro Star? The explosion was right on the docks 50% of the force from the final explosion went out to sea. What ships were docked and what were they carrying? Nitrous Oxide and what else? What caused the first explosion/fire which seems to be the catalyst for the large explosion? [...]\n\ni just say 90 percent to not seem like a conspiracy theorist because that's the first thing people will throw at you. this way i get past all those low hanging fruit insults. but yes i share your thoughts. i actually wouldn't be surprised if there was some clear foul play. in a hot place like that, this must be investigated to the maximum. if it was truly just misplacement of military packages or something then great, solved. but man, that explosion was huge, and they are next to israel. and its on a port, lebanon needs imports, with all this sanction stuff against that region and now this. just so many things at once, seems odd and stands out. wouldn't be surprised if there was foul play. can't wait until more news and thoughts/opinions comes out, very interesting",
				"added": 1596649511
			}
		],
		"1597624836_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": [
			{
				"comment_id": 65,
				"body": "i made some updates to it. it works well enough, now i just have to make some small changes to improve the cli commands.",
				"added": 1597710035
			},
			{
				"comment_id": 67,
				"body": "made an update. so now you download packages through torrent. you can host server apps. and now i added a feature to download entire front-end(static site/html file) as well.",
				"added": 1598232932
			}
		],
		"1597726785_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ": [
			{
				"comment_id": 66,
				"body": "pay to post on 4chan? what? 4chan is free to use, anyone can post there.",
				"added": 1597727599
			}
		]
	},
	"comment_vote": {
		"45_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1
	}
}