{
	"title": "吴越独立",
	"description": "主张吴越独立\n共同见证吴越独立的历程",
	"links": "[kai0的视频频道](http://127.0.0.1:43110/big.kopykate.bit/?Channel=kai0@zeroid.bit)\n\n[kaishen的视频频道](http://127.0.0.1:43110/big.kopykate.bit/?Channel=kaishen@zeroid.bit)\n\n[零网使用方法](http://127.0.0.1:43110/14qzPjqXiZV5PokSbX1EnkKZtpUASNxnfZ/)\n\n[颠覆国家政权群](http://127.0.0.1:43110/16EwXiGi4Dn9EZFSeEuKc2HNZYRD3RcVDs/)\n\n[吴越独立大论坛](http://127.0.0.1:43110/1F1AHWYc7Mt3GBV9ZgphyyG2Go7uodmBtL/)\n\n[非洲人的生活](http://127.0.0.1:43110/15zvMb12PZ5XMc6yJBWUEmn2dQvV3TyuQU/)\n\n[上海街头](http://127.0.0.1:43110/18iNFjfBKNM2rM4Mov6ShR1Ygu9EihsHWt/)\n\n[今日新疆西藏](http://127.0.0.1:43110/16LDCk5oggAfrnvSN9a7LkStWkqmozEtay/)\n\n[中国发展模式](http://127.0.0.1:43110/1HNYEHtg6BPAW1jmWfBGPrRMxsPjd6nVA2/)\n\n[中国故事](http://127.0.0.1:43110/1PhcqYWiQHAiasQkcpsHp6btASom2tMGQK/)\n\n[共产党的故事](http://127.0.0.1:43110/17DwzkEgpqtCWK9i1CGdioXojBpN1uaJ2N/)\n\n[天安门大屠杀](http://127.0.0.1:43110/1NT2LeRWQs3zCFCRwuPWbKwcamXVEu1hbU/)\n\n[郭文贵揭露的腐败](http://127.0.0.1:43110/1JWBMmJtHs7uDK1pm6wEJjrZFn3uk1FG6V/)\n\n[中共惊人的腐败](http://127.0.0.1:43110/1PPF2jZ2uBiQyFD75VPpXdCapRHrvezFtz/)\n\n[地狱 中国](http://127.0.0.1:43110/1P9MwRTBWUdbyRgrytY7jg191trnZTomu9/)",
	"next_post_id": 550,
	"demo": false,
	"modified": 1564150822,
	"post": [
		{
			"post_id": 549,
			"title": "自娱自乐的民主运动是没有胜算的",
			"date_published": 1564150796.027,
			"body": "推动中国民主化的舆论如果始终只能在海外，与大部分的中国人没有关系，最终只会成为自娱自乐的民主运动。\n\n中共掌握着全中国的电视，电台，报刊，杂志，互联网，还渗透了海外大部分的中文报刊，网站，还凭借资金等渗透入西方的媒体，海外民主运动只能守着及其有限的一些网站，如此对阵，海外推动中国民主化的人士及组织有取胜的把握吗？难道就等着国内一些漏网之鱼翻墙出来偷窥一下，就能推翻中共的统治了？\n\n用P2P技术把海外的信息扩散到国内去，这是海外推动中国民主化的人士及组织必须做的事。不管现在P2P技术有多少缺陷，不管使用上有多困难，都必须尽快用起来。\n\nFeb 14, 2017"
		},
		{
			"post_id": 548,
			"title": "不能掌握利用先进通讯科技是海外民运人士及组织的硬伤",
			"date_published": 1564150619.923,
			"body": "在通讯科技如此发达的今天，海外民运人士及组织始终无法将海外的信息扩散到国内，只能由国内的少数人翻墙出来偷窥，实在是海外民运人士及组织的硬伤。\n\n海外的一些宣传民运的网站其实只有一些自娱自乐的功能，与大部分的中国人没什么关系。海外民运也只是一种“贵族”民运，即与大部分的中国人没有关系，也逐步被西方主流社会及政界人士远离。\n\n法轮功还能开发翻墙软件，在国内推广派发翻墙软件。海外的民运组织却只能看着中共封锁网络，索手无策。\n\n其实现在的P2P网络已经完全可以打破中共的网络封锁了，可惜海外的民运人士及组织即不能认识信息扩散入大陆的重要性，也无法掌握，使用这种先进通讯科技。\n\nZeronet的博客虽然还有不足，但是可以改进的，比之20年前经常崩溃的网络及经常崩溃的服务器，今天的Zeronet博客不知道好多少了。\n\n真正致力推动中国民主化的人士及组织，对任何可以有效地将信息传递到中国大陆的工具都会尽量地去掌握，去利用，不管使用上有多困难，不管这种工具还有多不完善，决不会等待别人完善各种工具才去使用。\n\nFeb 14, 2017"
		},
		{
			"post_id": 547,
			"title": "环境决定论--柬埔寨与台湾独立",
			"date_published": 1550577955.947,
			"body": "事物的变化是有内因与外因，但是起决定作用的是外因，即外部环境，内因只起自我复制的作用，相当有限。\n\n1975年4月12日清晨，迪恩大使最後一次坐進金邊大使館的辦公室，打開一封柬埔寨前副總理施里瑪達親王（Prince Sirik Matak，施亞努的表兄）的親筆信：「我從來不相信，你們會拋棄一個追求自由的民族。相信美國人，是我犯下的唯一錯誤。」施里瑪達拒絕隨迪恩撤離金邊，9天之後，他被赤柬的行刑隊槍決。\n\n这个可怜的亲王到死都没有明白，是柬埔寨的社会环境适合共产病毒的生存，而不是美国人抛弃了柬埔寨。如果这个可怜亲王当年能认识到是柬埔寨的社会环境有问题，如果这个可怜的亲王当年在柬埔寨掀起反华反越的社会运动，柬埔寨就不可能落入共产党的手中。\n\n一個追求自由的民族怎么可能出现遍地的共产党游击队与地下组织？一個追求自由的民族怎么可能杀死自己的同胞200万？柬埔寨王室至今也没有明白这个道理，所以，柬埔寨今天在中共的支持下又回复了专制政权，无法避免。\n\n台湾也广泛存在这样的认识，认为美国会抛弃盟友。这也是蔡英文政府在当前全球围剿社会主义的环境下，缺乏果断作为的原因。\n\n其实台湾需要考虑的是台湾有没有适合共产病毒生存的社会环境，如果台湾存在共产病毒生存的社会环境，一旦与中共发生战争，台湾遍地是共产党游击队与地下组织，美国是救不了台湾的，而不是美国会抛弃盟友。\n\n台湾存在三大族群。本土原住民；从福建过来的闽越族，这些基本都是绿营；随蒋介石退守台湾的外省人，多数是吴越人士，这些多数是蓝营。\n\n本土原住民的文化传统不了解。就绿营的闽越族与蓝营的吴越族文化传统而言，其实是闵越族的文化传统更适合共产病毒的生存。这从民进党高层很多人士都读过毛泽东的书就能看出。从东南亚华人广泛参与共产党势力的渗透也能知道，东南亚华人中有不少闽越族人士。再看看世界各地的福建同乡会，都成了中共的代理机构。\n\n台湾要抵制中共的渗透，要追求独立，首先应该检讨台湾的社会环境，消除社会环境中适合共产病毒生存的因素，引进西方的价值观，引进西方的生活方式，改变闽越，吴越两大族群的文化。\n\n环境才是决定一切的。"
		},
		{
			"post_id": 546,
			"title": "环境决定论--韩战与越战",
			"date_published": 1550482503.308,
			"body": "事物的变化是有内因与外因，但是起决定作用的是外因，即外部环境，内因只起自我复制的作用，相当有限。\n\n美国在远东进行过两场战争韩战与越战，目的都是为了遏制共产主义由北向南的扩张。韩战成功遏制了共产主义的扩张，越战却失败了，共产主义成功扩张到了越南，老挝，柬埔寨。\n\n从这两场战争看，其实韩战对于美国是比较困难的，一方面南韩只剩下釜山很小一块地方，另外一方面中共派出了几百万军队直接参战，光死伤就达到100万，而且还有苏联空军的参战。而越南共产党只是在北方存在，被美国几次轰炸就只能逃到一些偏僻农村生存了。中共也没有大规模直接参与越战。\n\n结果却是韩战美国成功遏制了共产主义的扩张，越战却失败了。\n\n决定这两场战争胜负的并不是战争的内在因素--军队，武器，战略，战术等因素，而是战争的外部因素--社会环境。\n\n在韩战期间，无论是南方的韩国还是北方的朝鲜，都没有出现大量的共产党游击队，也没有大规模的反美游行。北方的朝鲜共产党军队占领南方地区后也没有出现成千上万的民众欢迎的场面。反而是朝鲜民众与中共志愿军的关系非常紧张，朝鲜民众并不欢迎中共的志愿军。\n\n越南战场情况则完全不同，无论是北方还是南方，都有无数的共产党游击队及地下组织，到处是反美示威集会。\n\n这样的社会环境当然就决定了这两场战争的结果。也可以看出，越南的社会环境及文化传统适合共产病毒的生存，而朝鲜的共产党政权似乎可以看作是外来政权，目前还难以确定朝鲜的社会环境与文化传统是否适合共产病毒的生存。"
		},
		{
			"post_id": 545,
			"title": "环境决定论--东南亚通过反华抵制共产病毒扩散",
			"date_published": 1550377583.621,
			"body": "事物的变化是有内因与外因，但是起决定作用的是外因，即外部环境，内因只起自我复制的作用，相当有限。\n\n共产主义意识形态是一种极其残酷，野蛮，反人性的思潮。这种意识形态在一般的文明中是难以生存的，只有在中华文明这样的极其愚昧，残酷，反人性的环境中才能适应，并迅速扩展开来，而且能持久地存在。\n\n中共在60年代曾经向东南亚大力输出过共产主义意识形态，最后都失败了。中共是通过华人这个病原体向东南亚扩展共产病毒的。印尼华人几乎都成了共产党员，居然发展到200多万。周恩来夸口一夜就能在印尼实行共产暴政。\n\n中共向东南亚输出共产病毒的失败并不是因为东南亚的文明高度发达，并不是东南亚人民能够认识到共产主义的危害。事实上东南亚的文明是很落后的。东南亚国家印尼，马来西亚，缅甸，泰国，菲律宾是通过反华阻止了共产主义病毒的扩散。\n\n东南亚文明并不产生《通往奴役之路》《1984》《动物庄园》《古拉格群岛》这样的思想著作，但这些落后的文明还保留着原始文明的纯真与人性，这些原始的文明因素天然地与残酷，反人性的中华文明有冲突。\n\n东南亚通过反华阻止了邪恶的共产主义病毒的扩散也反过来证明了中华文明的邪恶与反人性，同时也证明了共产主义这种邪恶病毒的扩散是需要中国人这样的邪恶群体才能完成的。而一旦出现反华的外部环境，共产主义病毒的传播就会被阻止。"
		},
		{
			"post_id": 544,
			"title": "环境决定论--中国人是共产癌细胞",
			"date_published": 1550203549.865,
			"body": "事物的变化是有内因与外因，但是起决定作用的是外因，即外部环境，内因只起自我复制的作用，相当有限。\n\n现在对癌症的治疗有外科切除，化疗，放射性治疗，药物治疗。早期外科切除当然有效，因为把事物本身都切除了，也就不会有事物的变化了，也就没有内因与外因了。\n\n化疗，放射性治疗，药物治疗都是试图杀死癌细胞，这些都是认识论上的错误，导致方法论上的错误，都是无效的。\n\n环境决定论认为事物的发展外部环境是起决定作用的，内因只起一个自我复制的作用。所以要阻止癌细胞发展成恶性肿瘤，只需改变癌细胞周围的外部环境，使复制产生的癌细胞无法生存，自然就不会发展成恶性肿瘤。最终癌细胞完成生命周期，癌症就获得治愈。\n\n看一个具体的癌细胞扩展实例：\n\n中国是一个由共产病毒导致的恶性肿瘤，每一个中国人都是一个共产病毒的癌细胞。这20多年来，中国人扩展到世界各地，向全世界复制共产癌细胞。\n\n前几年，世界各地都可以看到疯狂的中国人，共产病毒的癌细胞，到处挥舞共产党血淋淋的旗子，现在突然就消失了。其实并没有哪个国家现在禁止中国人挥舞这面血旗，现在也没有哪个国家突然禁止中国人进入，可是这个现象就是消失了。因为外部环境不适合共产病毒的生存。\n\n中国人这共产病毒癌细胞刚复制到欧美国家时还带有在中国时感染的病毒活性，到了欧美由于外部环境不适合这种病毒的生存，逐渐就失去了原有的病毒活力，逐渐萎缩了。\n\n可见，共产病毒这个癌细胞会不会从中国扩散到其它地方发展成恶性肿瘤，并不是由中国人这个内因来决定，而是由外部环境来决定。"
		},
		{
			"post_id": 543,
			"title": "环境决定论--中国的环境决定了你就是一个畜生",
			"date_published": 1550039315.817,
			"body": "事物的变化是有内因与外因，但是起决定作用的是外因，即外部环境，内因只起自我复制的作用，相当有限。\n\n受党文化唯物辩证法毒害的会拿鸡蛋来说事了。鸡蛋能孵出小鸡，是鸡蛋这个内因起决定作用，环境温度这个外部因素不起决定作用。石头就无法孵出小鸡。\n\n这是唯物辩证法典型的偷换概念。鸡蛋孵小鸡与石头孵小鸡是两个不同的概念。\n\n鸡蛋孵出小鸡，环境温度是起决定作用的，没有合适的温度，鸡蛋不可能孵出小鸡。至于鸡蛋这个内因在孵化的过程中只起自我复制的作用，复制是成功的就能孵出小鸡，复制不成功就无法孵出小鸡。决定复制能否成功主要是环境温度，与鸡蛋本身的质量关系不大。\n\n至于石头能否孵出小鸡，那是另外一个概念，与鸡蛋孵出小鸡没有关系。\n\n中国这个国家，遍地都是脑残，傻逼，畜生，很正常，这是中国这个环境决定的。在中国这个环境下，不会有正常的人。这与个人的素质，家庭情况，受教育程度等等内在因素没有关系。\n\n中国的环境决定了你就是一个畜生，这就是环境决定论。"
		},
		{
			"post_id": 542,
			"title": "民主社会是认可亲情复仇的--致吴越地区的警察",
			"date_published": 1548180648.66,
			"body": "2018年12月，中共公安部在北京的新闻发布会上通报，于2019年2月1日起正式施行关于警察执法方面的“新规定”，警察执法给公民、社会组织造成的权益侵害可以不负责任。对警察扩权，鼓励警察开枪。\n\n中共历来对枪支管理严格，即使军队都是枪，弹分离，现在鼓励警察开枪，不用负责。大家都知道，这是中共自知政权不稳，来日无多。想靠警察加强镇压民众来维持政权。\n\n中共自己都知道政权不稳，来日无多了，它还能保证你随便开枪杀人，以后不会被清算吗？长点智商吧。\n\n我提醒你们，吴越地区的警察，中共倒台以后建立的民主社会一定会清算的，你们谁要是相信了中共，充当中共的打手，手上沾了血，将来一定会被清算的。\n\n我还提醒你们，吴越地区的警察，中共倒台以后建立的民主社会一定是认可原始正义的，一定是认同亲情复仇的。你们谁要是相信了中共，充当中共的打手，手上沾了血，中共倒台以后，很可能还没被新政府清算，就已经被死者家属报复杀死了。而死者家属杀死这种手上沾血的警察是不会被民主政府定罪的。\n\n日前，在长春税务小区一起邻里纠纷中，警察胡兆明到场后就开枪打死一名当事人，好不威风。可以肯定，这个胡兆明在共产党倒台后就会被死者家属追杀，根本就等不到民主政府的清算。\n\n中国人虽然愚蠢，但是小算计还是有的，值不值得为共产党卖命，你们自己会盘算的。手上沾了血是洗不掉的。"
		},
		{
			"post_id": 541,
			"title": "吴越引入500-1000万欧美移民以后再开制宪大会",
			"date_published": 1547835002.588,
			"body": "网友问我吴越独立后实行什么政体？我本来认为现在谈这些还太早，不过后来我认为现在确实应该谈这个，因为中国人实在太过愚蠢，需要早一点谈这些，否则以后又会有大麻烦的。\n\n我的看法是中国人实在太过愚昧，这点不用多辩，世界上早就没有一个大国还在实行专制政体的，这足以证明中国人智力低下。吴越人也不聪明，吴越人如果聪明，1亿多人口，早就有1千万个零网节点了，中共的网络封锁早就失败了。\n\n所以，实行什么政体这种大事不能由我们吴越人来确定，否则以后一定会有麻烦的。\n\n吴越独立以后，我认为首先要引入500-1000万欧美移民，除了西欧的移民以外，还要引入一定比例的匈牙利，捷克，波兰移民。因为匈牙利人在1956年就知道起来反抗共产党专制政权了，捷克人在1968年就知道起来反抗共产党专制了，波兰人也在80年代就有了团结工会，说明他们的文化有优势。匈牙利人，捷克人，波兰人在生活条件远比中国人好的时候就知道反抗共产党专制，反观中国人，吴越人，直到今天还头脑不清，还在做中国梦，智力比他们低下实在太多。\n\n吴越引入500-1000万欧美移民以后再开制宪大会，确定政体。制宪大会1/3的席位由欧美移民出任，确定政体这样的大事要听取欧美移民的意见。\n\n甚至在一定的时间内，比如10年之内，国会的1/3的席位要由欧美移民出任，以保障吴越独立后的民主制度的顺利运行。\n\n如果没有欧美移民的参与，吴越独立以后建立的民主制度一定也是个低端民主制度，腐败丛生。"
		},
		{
			"post_id": 540,
			"title": "各方都在等变局",
			"date_published": 1547726016.427,
			"body": "中共当然在密切观察伊朗的局势，希望伊朗的民众抗议会平息下去，甚至期望伊朗最后也像叙利亚一样，变天失败。所以结果没有明朗之前，中共不可能做出实质的改变。所以贸易谈判不会有真正的结果。\n\n朝鲜也在等伊朗的局势明朗，如果伊朗这样都不会变天，三胖没理由相信中共会倒台，这样他也没可能真正去核。川普要与三胖再次会面，三胖即得意，又为难，所以先得到中国摸下底，这也正常。\n\n美国也在等伊朗局势明朗。伊朗变天，朝鲜去核就没有困难。伊朗变天，就可以与中共谈结构改革。否则中共为什么要改？\n\n其实，越南，古巴，叙利亚也在看伊朗的变局。伊朗变天，对越南，古巴，叙利亚的压力也很大。\n\n包括伊朗也在等各方的变局。伊朗当然希望中共与美国谈崩了，双方斗起来。伊朗还等土耳其开战。\n\n我也在等伊朗变局，伊朗都无法变天，自然不可能让中国变天。"
		},
		{
			"post_id": 539,
			"title": "也是天命",
			"date_published": 1547665152.985,
			"body": "2015年，中共把一带一路，亚投行，A股纳入MSCI指数，人民币纳入SDR炒的轰轰烈烈，A股也配合的很好，一路走强。\n\n眼看中共的计谋都要得逞了，突然冒出一股势力把A股砸的稀巴烂。啥都被砸成泡影了。\n\n亚投行要是搞成了，现在一带一路的窟窿就是欧美国家来填了。人民币纳入SDR就可以印很多人民币应对地方债务危机了。幸亏有这么一砸，把世界都砸清醒了。\n\n没有2015年对A股的砸盘，川普现在面对的局面会很困难的，而且需要很长时间来解决。\n\n可是2015年对A股的砸盘不是美帝，也不是反华势力，更不是散户小股民。也不是民间炒股团伙涨停板敢死队，他们没这么大的能力，徐翔他们只是做了替死鬼。\n\n砸盘的正是想红色江山代代传的红二代势力。也正是他们这么一砸，把红色江山代代传的美梦砸成了泡影。\n\n自己把自己砸死了，这不就是天命嘛。"
		},
		{
			"post_id": 538,
			"title": "冥冥天意",
			"date_published": 1547490414.659,
			"body": "说起来有点不可思议。中共从一开始就主张中国各民族独立建国的，是主张中国分裂的。不仅主张，而且还实际参与，组织甚至领导新疆，台湾的独立运动。\n\n中共一夺取政权，就承认了蒙古的独立。还把无法用武力解决的云南南部干脆送给缅甸，把内战变成了国际问题，使得蒋介石无法再支持云南的武装力量。\n\n按理，顺理成章的应该是把台湾踢出中华人民共和国的版图，不承认台湾是中国的一部分，让台湾自己去独立建国，与云南一样，把内战变成国际问题，把反攻大陆变成侵略行为，断了蒋介石反攻大陆的可能。\n\n可是很奇怪，中共夺取政权之后，却与苏联合谋，把新疆独立运动的领袖都害死了，没让新疆独立。也不知道斯大林当时是怎么想的，这个不太好理解。又没让西藏独立，用欺骗，恐吓，武力占领了西藏。\n\n从中共的核心利益是掌握政权这点上来讲，中共不应该占领新疆，西藏的。因为新疆，西藏一直不属于传统中国。西藏很明确一直是独立国家，满清朝只是附属国。新疆一直有很多独立的邦国的。这两地区对中国有很强的分离倾向的。在中国版图之内迟早会叛乱的。这点中共打天下的军头如果不知道，也只需问一下称毛泽东为亲爷爷的郭沫若就能了解的。\n\n一个从一开始就主张，推动各民族独立的团伙，夺取政权之后就把两个有严重分离倾向的地区强行并入版图中，这是什么意思？是为以后的分裂埋下隐患？中共的行为没有逻辑性，非常荒唐。\n\n到了现在，很明显新疆，西藏这两个地区严重危及中共的政权稳定了。中共现在可能很后悔当初没让新疆，西藏独立了。\n\n更玄乎的事，习近平上台后就时不时的要叫唤一下：不忘初心！\n\n共产党的初心不就是全国各民族独立嘛。56个民族56个国家。他是怕大家忘了共产党主张分裂中国的初心啊。\n\n这是不是冥冥中的天意？"
		},
		{
			"post_id": 537,
			"title": "郑也夫真男儿也，可惜晚了10年。",
			"date_published": 1547400023.378,
			"body": "郑也夫的文章直指中国问题的关键--政治变革，真男儿也。尽管从他的文章可以看出他还没有走出内心的恐惧，即使恐惧也要说真话，这是真男儿。可惜他的这些话晚了10年，分裂的大势已经形成，人力无法扭转。\n\n如果郑也夫教授能早10年说这些话，中国就不会有现在的局面。\n\n2009年我回国时，就看到所谓的维稳已经搞的乌烟瘴气，遍地的冤案，可是居然没有一个人敢站出来说一下，因为维稳是胡锦涛时期的重要政策，中国人都聪明，不会犯这种政治错误。只有吴敬琏老先生在不着痛痒的不断地呼吁“国退民进”，“民进国退”。\n\n我当时就感叹，中国这么多读书人，居然没有一个人敢站出来指出中国的实际情况。直让我感叹“竟无一个是男儿”。没想到，后来习近平这蠢货居然跑到俄罗斯去说苏联共产党倒台，竟无一个是男儿。\n\n当时倒是温家宝，一直在呼吁人民觉醒，一直在说政治改革需要人民觉醒，没有政治改革，经济改革不可能进行下去。很难明白为什么很多人称他“影帝”，却不听他一直在呼吁的政治改革需要人民觉醒？估计温家宝也只能徒呼奈何。\n\n要是郑也夫教授能早10年站出来，老胡不太可能抓人。而且刚好呼应温家宝先生，如果能有更多的人站出来，当时推动政治改革是有可能的。\n\n现在太晚了，习蠢货已经走的太远了，无法回头了，国际形势也已经完全不同了。\n\n习近平这男儿刚上台就扬言要抓40万新五类分子，现在光新疆就已经抓了100万，这如何回头？我真想问问这蠢货，共产党的家业就守住了？\n\n在习王这两个狂妄之徒执政下，共产党即不可能推动政治改革，也不可能自动退出历史舞台。"
		},
		{
			"post_id": 536,
			"title": "敦促胡锦涛，温家宝，宋平三先生退出共产党！",
			"date_published": 1546665858.684,
			"body": "日前在网络上看到宋平先生对习近平的倒行逆施十分愤慨，大骂自己当年瞎了眼，看错了人。\n\n我愿意相信宋平先生年轻时是怀着理想加入了共产党的，我还愿意相信胡锦涛先生，温家宝先生年轻时也是怀着理想加入共产党的。\n\n可是我近些年从网络上看到，其实早在100年前，共产主义兴起的早期，就有先知先贤们指出共产党的无产阶级专政一定会演变成共产党的一党专政，最后演变成领袖的个人独裁。这个在列宁的导师普列汉诺夫的遗言中写的很清楚，而且这还不是他一个人的论断。\n\n我不清楚你们加入共产党的时候，在听党课的时候有没有听过共产主义运动早期的这些争论，有没有听过第二国际与第三国际的分歧，也不知道你们的党课教材中有没有考茨基的《恐怖主义与共产主义》。\n\n但是我想，至少现在你们应该都知道这些了吧。不知道你们现在是如何看待这些论断与著作的？\n\n不知道宋平先生是学什么专业的，胡锦涛先生与温家宝先生都是理工专业的。理工专业都是实证科学，是要讲究实证的，一切理论是要符合实际的观察结果的。否则这理论就不能成立。\n\n百年来的共产主义运动，从实际实行的结果看，所有的共产主义政权最后都验证了从无产阶级专政到共产党一党专政，再到领袖个人独裁这个论断。没有一个例外。\n\n共产主义在中国近70年的实践，前30年完全实现了从无产阶级专政到共产党一党专政，再到毛泽东个人独裁。习近平上台之后，短短5年时间就再次实现了从共产党一党专政到习近平个人独裁。\n\n胡锦涛，温家宝两先生，我不知道你们是如何看待这个实证结果的？这样的观察结果，你们认为还不足以否定共产主义理论吗？\n\n既然共产主义这个荒唐的理论已经被实证否定了，那你们就应该果断退出共产党这个组织。以尊重科学与理性，尊重人类良知。\n\n如果你们认为实证结果已经足以否定共产主义这个荒唐理论，却还不退出共产党，那又说明什么呢？你们又想证明什么呢？\n\n在这样的实证结果下，你们还不退出共产党，那就很难取信天下人，你们年轻时加入共产党是怀着理想的。而且，你们也无法向自己的后人解释，自己为什么要加入共产党，为什么在共产党政权给人类造成极大的灾难之后依然不肯退出共产党组织。\n\n胡锦涛，温家宝，宋平三先生退出共产党吧！"
		},
		{
			"post_id": 535,
			"title": "中国陷入中等收入陷阱是早就预料的",
			"date_published": 1546629077.949,
			"body": "其实早在10几年前，很多人就在讨论中国将陷入中等收入陷阱的话题了，就是拉美化。我的看法是中国要陷入这个陷阱的，理由很简单，中国没有后续发展的社会环境，没有后续发展的科技，本质上是政治制度的问题。\n\n中国陷入中等收入陷阱与美中贸易战没有关系，美中贸易战只是激化了这个问题。\n\n中共其实也知道有很大的可能会陷入中等收入陷阱。所以才会有2025计划，一带一路。\n\n10几年前讨论中国将陷入中等收入陷阱的前提是中国是在进行改革的，至少海外是误以为中共还在进行改革的。可是习近平上台以后，中共在政治上全面倒退，这个前提早就不存在了，所以现在要讨论的就不是中国将陷入中等收入陷阱，而是中国经济将崩溃到什么程度。"
		},
		{
			"post_id": 534,
			"title": "上海要达到加拿大的发达程度只有分裂",
			"date_published": 1545047921.612,
			"body": "大概在2000年前后，我说过，再过50年上海也达不到加拿大的发达程度。我是做过测算的哦。\n\n现在近20年过去了，可以看的很清楚，上海显然无法在30年内达到加拿大的发达程度。别说30年，就是再过50年，上海还是不可能达到加拿大的发达程度。\n\n中国的发展高峰期已经过去了，而且还要与普世价值对抗，即便再过100年，上海也达不到加拿大的发达程度。其它地方就可想而知了。其实我的感觉是，差距又会拉开的。\n\n中国人实在太过疯狂，这种疯狂你没回到大陆是无法想象的。我遇到的每一个中国人都狂妄到不可思议，都以为中国已经是世界上最发达的国家了，这包括了我的家人。你根本无法与中国人正常对话，他们一开口，让你感到就像在与一个疯子说话。\n\n难以理解，中国人才过了几年能吃饱饭的日子，为什么会如此狂妄？\n\n今天中共又在威胁加拿大了，要加拿大承担一切后果。什么后果呢？我在想，大概就是像我刚到加拿大的时候一样，商店里没有一件从中国来的商品。哦，当然，唐人街还是有一些中国来的土特产的。而且这些土特产还是要配额的，还得是与中共政权有点关系的侨领们才能从中国政府那里拿到这些配额。比如湖北的咸鸭蛋；上海的梅林罐头；广东的腐乳，豆豉凌鱼。\n\n上海要达到加拿大的发达程度只有分裂，不然根本就没有可能。\n\n就因为一个人要向世界提供治国理政的方案，你们就愿意为他付出代价？你就愿意为他付出代价？"
		},
		{
			"post_id": 533,
			"title": "我对世界局势的看法：依次发生下列事件",
			"date_published": 1543946543.53,
			"body": "伊朗变天，毛拉政权垮台。\n\n朝鲜三胖弃核，走越南道路，政治不变，也不挑战美国，继续观望中共政权会否倒台。\n\n西藏独立建国开始\n\n新疆起义\n\n宁夏穆斯林独立建国开始\n\n两广起义，大动荡开始。\n\n云贵川独立运动\n\n吴越独立，隔断南北，中共垮台。\n\n有3个变数，能改变进程次序：\n\n日，俄能找到满洲独立的代理人，推动满洲独立，进程次序被改变，可以加快中共政权崩溃的进程。\n\n中国人智商变高了，零网在中国普及开，网络封锁被突破。这个可能性不大。\n\n中共加快印钞，物价暴涨，各地都出现抗议示威。这样自杀挺滑稽，不过对专制政权来说也不奇怪。"
		},
		{
			"post_id": 532,
			"title": "G+上有人发了这样一个贴",
			"date_published": 1543491424.931,
			"body": "**《明史•外國傳•意大里亞》便認為：\"意大里亞，居大西洋中，自古不通中國。萬曆時，其國人利瑪竇至京師，為《萬國全圖》，言天下有五大洲。……其說荒渺莫考。……禮部言：《會典》只有西洋瑣裡國，無大西洋，其真偽不可考。\"**\n\n这贴证明了中国人的愚昧无知，而且这种愚昧极其顽固。\n\n明朝是推翻了蒙古人的统治后建立的朝代。蒙古人统治中国将近100年，而蒙古人是知道欧洲的，也是知道大西洋的。蒙古人统治了中国近100年，还是无法让中国人知道大西洋。\n\n可见中国人不但愚昧，这种愚昧还极其顽固。100年都无法改变中国人的愚昧。"
		},
		{
			"post_id": 531,
			"title": "祈祷文",
			"date_published": 1542810665.577,
			"body": "万能的主啊，你能不能让中国人的智商提高一点？至少比猪的智商高一点。当然这个很困难，因为中国人在猪圈生活的太久了。\n\n那你能不能先让生活在海外的中国人智商提高一点？先把他们的智商提高到比猪的智商高一点？\n\n或者你能不能先让生活在海外，具有博士学位的中国人智商提高一点？先把他们的智商提高到比猪的智商高一点？让他们知道P2P网络是中共无法封锁的，让他们的智商达到会使用零网的程度？\n\n祈求万能的主，阿门！"
		},
		{
			"post_id": 530,
			"title": "上海这种脑残傻逼最有幸福感",
			"date_published": 1542463786.61,
			"body": "上海最有幸福感的是这样一批人。他们的爷爷辈20几岁从苏北逃荒到上海，在苏州河以北，肇家浜以南搭建了一个草棚子。然后在码头上当苦力，给资本家打工。日本人来了给日本人打工。\n\n然后，回苏北娶了媳妇带来上海，或者找了个在日本纱厂的同乡女工结婚。两人在国民党时期，日本人时期打工积攒了10几20年，把草棚子翻新改建成了砖木结构的瓦房。也有向上海本地人买的房子。这种瓦房一般都是一层楼的平房，少数也有两层楼的。\n\n他们的爷爷辈都是这样从一穷二白开始，然后有了自己的家，又生了他们的父辈。码头上一天干下来，回家还有点小酒喝。花生米，大闸蟹，臭豆腐是他们平常的下酒菜。黄鱼在解放前是很便宜的，在国民党时期，日本人时期富有的上海家庭是不吃的，黄鱼是解放前码头工人家庭的标准菜。\n\n上海最有幸福感的一批人的爷爷辈40多岁的时候，他们的父辈20岁左右的时候，共产党来了。他们的爷爷辈与父辈都变成了给共产党打工了。\n\n他们爷爷辈建的砖木结构的瓦房也20多年了，有些破败了。\n\n不过码头已经不叫码头了，叫港区了。他们的爷爷辈与父辈也成了国家主人了，不再是苦力了。\n\n尽管他们的爷爷辈与父辈都成了国家的主人，回家后已经没有小酒喝了，花生米，大闸蟹，臭豆腐也成了奢侈品了，黄鱼要逢年过节才有吃了。当然也就没可能把已经破旧的房子再整修一下了，更没可能新建一个家了。\n\n这最有幸福感的一批人就是在他们爷爷辈建的，已经破败的房子里长大的。\n\n等这批从苏北逃荒来上海的爷爷辈死了，这批爷爷辈的留下的父辈也为共产党打了一辈子工退休了，这最有幸福感的一批人也已经30岁左右的时候，中共开始了改革开放，他们中的很多人都下岗了。\n\n又过了20多年，2004年之后，他们的家，他们的爷爷辈留下的破房子都被拆迁了。兄弟姐妹都在离上海30几公里处分到了一套新房子。这新房子是他们原来想都不敢想的。\n\n他们感到非常幸福，全靠共产党的领导，他们才有了今天的幸福生活。全靠共产党的改革开放他们才搬出了他们住了一辈子的破房子。他们的幸福感是最强烈的，他们感到全世界都羡慕他们。\n\n当然他们死去的爷爷并不会这样想。\n\n这群傻逼脑残从来不会想，为什么他们的爷爷辈赤手空拳来到上海为资本家打工，为日本人打工，只用了10几20年就在上海有了自己的房子。而他们的父辈与他们自己两代人为共产党打了一辈子工，却没有能力买自己的房子。\n\n这群傻逼脑残更不知道，他们的爷爷辈当初如果不是在苏州河以北，肇家浜以南盖房子，而是在离上海30公里的地方盖房子，是可以盖一大片房子的。\n\n这群傻逼脑残也不知道，他们的爷爷辈给他们留下的破房子是连着土地的，是有永久产权的。而共产党拆迁分给他们的房子是只有70年产权的，而且不带土地产权的。\n\n上海最有幸福感的这样一批人就是标准的被共产党卖了，还帮共产党数钱的傻逼脑残。"
		},
		{
			"post_id": 529,
			"title": "习猪头只有下台了",
			"date_published": 1542431457.045,
			"body": "民主党对华强硬派不可能让川普与习猪头私下妥协的。\n\n川普的贸易战一定会被民主党捆绑新疆，西藏，人权律师等等。\n\n新疆的集中营是种族灭绝；\n西藏的问题是种族隔离；\n全国拆教堂拆十字架是宗教迫害；\n709案是大规模人权危机。\n\n这些都是民主党的主要议题。好搞笑，中共还希望民主党赢中期选举，这下更糟了。\n\nG20会谈除了川普早就提出的一些公平贸易要求之外，还得谈立即拆除新疆集中营；立即解除禁止西方人士进入西藏的禁令；立即停止拆教堂，拆十字架；立即停止迫害人权律师；立即停止政治失踪。\n\n这些都是习猪头干的事，习猪头不下台，这些议题根本就无法谈判。\n\n而且，根据中国帝制的历史，加九锡之后，一般都是要砍皇帝的狗头的。这次也一样，不用奇怪。\n\n本来北戴河就应该把猪头赶下台的，一定是长者不行了，估计长者现在满身都是管子了，被猪头逃过了北戴河一劫。\n\n现在内外条件都具备了。哈哈哈哈，傻逼斗狠，现世报啊。"
		},
		{
			"post_id": 528,
			"title": "加九锡之后应该是砍脑袋了",
			"date_published": 1542267510.074,
			"body": "这是中国帝制的传统，不需要很大的学问就能知道。也不需要内部情报才能分析出来的。\n\n这两家伙，一个狂妄，凶狠；一个阴险，狡诈。谁砍掉谁的脑袋还不好说。\n\n王还会被习当枪使吗？没这可能。九锡白加了啊？\n\nG20看来是一定要会谈了。谈成了，砍谁的脑袋？谈不成，砍谁的脑袋？\n\n两个人互捏命门，不砍脑袋是不可能的。\n\n屁民不用高兴，加九锡，砍脑袋从来跟屁民没关系。看看热闹就可以。"
		},
		{
			"post_id": 527,
			"title": "南北战争是解放奴隶的战争",
			"date_published": 1542209913.821,
			"body": "美国国务卿蓬佩奥和国防部长马蒂斯与中国政府的外交总管、国务委员杨洁篪和国防部长魏凤和举行有关安全问题的会谈时，国务委员杨洁篪和国防部长魏凤和居然告诉美国国务卿蓬佩奥和国防部长马蒂斯：中共准备不惜一切代价再打一次美国的南北战争。\n\n看来杨洁篪和魏凤和不知道南北战争是解放奴隶的战争。\n\n现在只有中共专制下的14亿人才是奴隶。台湾民主社会并不实行奴隶制，美国早在南北战争之后就解放了奴隶。台湾与美国早就实现了领导南北战争的林肯总统所说的：民治，民有，民享。\n\n新的南北战争不可能挽救中共的覆灭，新的南北战争一样会是一场解放奴隶的战争。\n\n14亿被奴役的奴隶正期待着爆发一场新的南北战争来解放他们。"
		},
		{
			"post_id": 526,
			"title": "语无伦次的梁家河大学问",
			"date_published": 1542098283.972,
			"body": "习近平在上海进博会上语无伦次地发表他的梁家河大学问：“中国经济是一片大海，而不是一个小池塘。大海有风平浪静之时，也有风狂雨骤之时。没有风狂雨骤，那就不是大海了。狂风骤雨可以掀翻小池塘，但不能掀翻大海。”\n\n习猪头一定在梁家河见识过小池塘被掀翻的样子。\n\n事实上，中国经济这片大海在历史上无数次被掀翻过。最出名的是一次被蒙古掀翻，一次被满清掀翻。而且不但经济被掀翻了，还亡国了。\n\n中华民国国民党执政时期，中国经济这片大海也被掀翻过两次。一次被日本入侵掀翻，一次被共产党作乱掀翻。也是不但经济被掀翻，连中华民国都亡国了，被赶到台湾去了。\n\n中共执政之后，中国经济这片大海已经被掀翻过两次。一次是大跃进时期，结果饿死4千万人。一次是文化大革命时期，这次掀翻把中国变成了世界最贫困国家，国民人均产值与坦桑尼亚，赞比亚持平。而且这两次掀翻还是中共自己掀的。用梁家河大学问来说，是艰难探索。\n\n倒是中国周围的一些小池塘，从来没有被狂风骤雨掀翻过。尼泊尔这小池塘从来没有被掀翻过；不丹这小池塘从来没有被掀翻过；泰国这小池塘从来没有被掀翻过；斯里兰卡这小池塘也从来没有被掀翻过。\n\n这次中国经济这片大海很快又要被掀翻了，已经要全国民众准备吃草了，已经要全国吃草的民众与吃山珍海味的中共共度时艰了。\n\n这次中国经济这片大海被掀翻，中华人民共和国也一样会亡国的。"
		},
		{
			"post_id": 525,
			"title": "專家倡推動勞工權利革命 以終結現代奴役",
			"date_published": 1542035488.06,
			"body": "（路透美國新海芬3日電）律師、學界人士和社運人士表示，要終結全世界的現代奴役現象，單靠聚焦法律行動並不夠，還必須支持勞工權利「革命」，保護民眾免於遭剝削和強迫勞動。\n\n多名專家在美國耶魯大學一項年度會議表示，政府多將現代奴役和人口販運視為犯罪議題，而不是人權和勞工議題，然而僅極少數強迫勞動案例遭起訴。\n\n華盛頓人口販運法律中心（HTLC）主席范登柏格（Martina Vandenberg）說，各國應更專注於確保勞動者享有勞工權利，以及有權力組織起來集體要求改善薪資和勞動條件。\n\n全球估計有4000萬人受奴役，現代奴役越來越被視為全球重大問題，如何以最好的方法達到聯合國訂的目標，在2030年終結每年獲利1500億美元的奴役罪行，相關討論日益增多。\n\n范登柏格在奴役會議上說：「解決強迫勞動案件代價昂貴、費時甚長，需要很大的政治決心。我們必須採取革命性作法…不是訂定更多法律，而是採取更多組織活動，讓民眾享有勞工權利和權力。」\n\n反奴役的佛羅里達州農工團體伊莫卡利勞工聯盟（Coalition of Immokalee Workers）負責人傑米諾（Laura Germino）說：「我們要的不是起訴奴役行為，我們要的是結束奴役。」\n\n跨國勞工和移民團體組織「全球勞工正義」（Global Labor Justice）美國負責人羅森邦（Jennifer Rosenbaum）說：「人口販運的反面不是不再販運人口，而是讓移民和勞工能組織起來，提出他們的權利要求。」\n\n「讓勞工組織起來和建立勞工組織，將創造環境讓各州和法院對植基權利的作法抱持開放態度，讓企業負起責任。」中央社（翻譯）"
		},
		{
			"post_id": 524,
			"title": "中华文明其实是贫穷落后的代名词",
			"date_published": 1541172958.16,
			"body": "我在70年代去过北方。过了长江，对我们江南人士就是北方了。过了长江，就是有名的苏北了。满眼望去，一片荒凉。这视觉的冲击，对南方人是震撼性的。\n\n一江之隔，差别居然会如此之大。\n\n黄河流域，更见荒凉。黄河流域的荒凉，南方人根本就想象不出来。\n\n长江流域与黄河流域之间这片荒凉，贫困之地，就是孕育中华文明的土地。长江流域与黄河流域之间这片荒凉，贫困之地的文化就代表了中国的文化传统。\n\n你当然不会认为长江以南是中华文明的核心区域。你当然不会认为浙江文化，广东文化是代表了中国的文化传统。\n\n中华文明是在一片极其贫困的土地上产生，发展的。几千年来，中华文明就是浸泡在这样的贫困之中的。这样的文明，会很伟大？会很有高度？会有宽广的视野？会有爱心？会无私奉献？这样的文明会产生追求真理的欲望？会产生追求正义，公平的冲动？这样的文明会产生很大的智慧？\n\n这贫困还不是最重要的。更糟糕的是，中国社会2000年来，一直是在极其残酷的专制制度下过来的。各种惨无人道的刑罚，当然也是从这个文化中产生出来的。\n\n中国人的狂妄，无知，冷漠，当然都是这个文化的自然产物。\n\n我想，即便是东南亚这些贫穷国家的人士，如果在60-70年代到中国北方来，他们的视觉冲击也一定会是相当震撼的。\n\n一些人认为中国文化没有问题，中国人本身没有问题，中国的所有问题都是因为共产党造成的。持这种观点的人，本身就是中国文化的代表。这些人本身就体现了中国人普遍的无知。\n\n中国人的狂妄来自于中国人以为世界各地的文明都产生于极端的贫困。"
		},
		{
			"post_id": 523,
			"title": "日本，美国，俄罗斯，印度共同推动西藏独立",
			"date_published": 1541172843.642,
			"body": "日本，美国，俄罗斯，印度共同推动西藏独立是能够成功的。\n\n西藏独立对日本的利益最大。其次对印度的利益也大。\n\n所以，日本，印度要主动拉拢美国，俄罗斯，共同推动西藏独立。"
		},
		{
			"post_id": 522,
			"title": "日本的有识之士要扶植在日满洲人士",
			"date_published": 1541090970.064,
			"body": "西藏，新疆，南蒙古都有独立运动组织，就是满洲没有独立运动组织。\n\n满洲人士在日本有很多，日本的有识之士要扶植在日满洲人士，帮助他们成立独立运动组织。要向他们提供资金，帮助他们组织抗议活动。\n\n满洲的独立对日本有最大的利益。满洲独立以后，就把中共与朝鲜的直接联系切断了。这样朝鲜的核武问题，导弹问题就解决了。满洲独立以后，中共对日本的威胁也解决了。\n\n满洲是个资源很丰富的地区，日本帮助满洲复国，也可以在满洲获得很大的利益。"
		},
		{
			"post_id": 521,
			"title": "普京应该与日本联手推动满洲复国",
			"date_published": 1541090905.46,
			"body": "除了满洲复国，俄罗斯并没有什么其它好的方案能阻止中共的腐败大规模入侵西伯利亚。\n\n普京应该与日本联手推动满洲复国，应该尽快制定具体协助满洲复国的方案。\n\n普京推动满洲复国还能拉近与日本的关系，从而改善与美国的关系。\n\n推动满洲复国对普京好处很多。"
		},
		{
			"post_id": 520,
			"title": "川普要尽力分裂中国，永远结束中国的专制传统。",
			"date_published": 1540994732.632,
			"body": "科技发展到今天，已经具备了结束中国2000年专制传统的条件。中国2000年的专制传统一直无法打破，是有其客观条件的，并非只是主观的思想意识。\n\n中国南方并没有大一统的专制意识。在中国2000年的中央集权专制历史中，仅有一次是南方军队攻入北方，即推翻第一个中央集权政权-秦王朝。其它无数次的王朝覆灭以后，南方各地产生的政权都不愿意越过长江进入北方。\n\n中国的大一统专制集权一直是由北方政权建立的。南方无法阻止北方政权建立大一统专制政权，这是有客观原因的。现在这个建立大一统专制集权的客观条件已经不存在了。所以，川普应该尽力分裂中国，永远结束中国的专制传统。\n\n中国大体上可以长江为界，分为北方与南方两部分。北方中国主产小麦与杂粮，南方中国主产水稻。北方中国的语言是很相似的，北方各地基本都能听懂。南方中国各地的语言完全不同，互相无法听懂。这南北两个部分是非常不同的。\n\n南方中国的最北面是长江三角洲，是个冲积平原与丘陵地区，称为“江南\"是传统中国最富裕的地区。\n\n古时军营生活困苦，一天几个馒头，要在“江南\"地区征兵是很困难的。没人愿意放弃“江南\"的富裕生活去当兵。\n\n再往南一直到南海边的广东，古时称为”百越\"。”百越\"地区多山，是无数的群居部落，言语风俗各不相同。交通不便。在北方看来，”百越\"都是山蛮，意思还没开化。用西方的语言来说，都是土著民族。所以，要在”百越\"地区征兵，困难更大。\n\n北方地区则完全不同，北方地区征兵非常容易。只要有人出钱招兵买马，很容易就能拉起一支队伍。这应该与北方地区的普遍贫困有关，一天几个馒头的军营生活，在北方是能吸引年轻人的。\n\n这个现象从东汉的刘秀造反开始，一直延续到近代。\n\n刘秀只是一个普通农民，200年前其家族与皇室有血缘关系，到刘秀一代早已不再富裕，也没政治地位。但是，就是这样一个普通地主家庭，就能招兵买马，建立自己的军队。并且很快就能扩张到与中央政权对抗的规模。\n\n所以在2000年的专制历史中，南方很难扩张军事力量，很难征集几十万的兵力，也就不可能征服北方，建立大一统的政权。相反，北方中国却很容易就能征集上百万的兵力。\n\n这个就是南方政权无法抵抗北方政权的入侵，南方政权无法长期独立的根本原因。\n\n但是，现代科技的发展已经使得战争不再单纯依靠人数取胜。北方中国追求大一统专制的客观条件已经不存在了。只要中国再一次发生分裂，南方各地一定会独立，而且是持久地独立。北方已经无法再通过军事力量来建立一个大一统的国家。\n\n分裂中国，就能永远地结束中国的东方专制传统。"
		},
		{
			"post_id": 519,
			"title": "东北人要尽快行动起来",
			"date_published": 1540994654.433,
			"body": "东北在这40年里完全被牺牲了。因为如果广东没有特权设立特区，日本的汽车厂，电子工厂不可能设在广东，而应该设在东北。广东的发展显然是以牺牲东北的利益为代价的。\n\n东北人在这40年的大发展中，像个叫花子一样，都没人敢站出来，太丢人了。\n\n现在经济崩溃，以后东北人的日子更不好过。\n\n东北人应该站出来，推动满洲复国。满洲复国了，日本的资金，日本的企业就会搬到东北来，东北的经济就会大发展。\n\n新疆有独立运动，西藏有独立运动，连内蒙古都有独立运动，就是满洲没有独立运动组织，东北人能不能长点志气，别再像叫花子一样了好吧？\n\n东北人敢站出来推动满洲独立，首先可以争取到日本的支持，还可以争取到美国的支持，俄罗斯的支持。争取满洲独立，地理条件比西藏，新疆都要好，比新疆，西藏更容易获得外国的直接支援。\n\n东北人别再没出息了，赶快行动起来。先成立满洲复国运动组织，然后尽快到俄罗斯境内，蒙古国境内成立武装组织。先把边境口岸漠河占领几天，拍些视频放到网络上，扩大声威。"
		},
		{
			"post_id": 518,
			"title": "美日俄联手恢复满洲国",
			"date_published": 1540920310.951,
			"body": "恢复满洲国俄罗斯一定会出力，因为满洲建国后就把中国与俄罗斯的远东地区分隔开了，有效阻止了中共的腐败大规模直接进入俄罗斯的可能。恢复满洲国也是日本最愿意看到的结果，日本以前就扶植过满洲独立建国。\n\n恢复满洲国对美国也是很有利的。满洲独立建国就把朝鲜与中共的直接联系隔开了。朝鲜的核问题就很容易解决了。\n\n除了中共之外，俄罗斯，日本，韩国，美国都是乐意看到满洲独立建国的。\n\n满清与大明本来是两个国家。1644年满清占领吞并了大明，变成了一个国家。\n\n1911年辛亥革命爆发，满清政权面临崩溃，这时进行了南北议和，满清政权与南方临时政府双方同意保留皇室，实行共和体制。\n\n比较奇怪的是，当时的南北合议不是建立君主立宪制，而是自创了一个君主共和制。\n\n结果这个中国人自创的君主共和制很自然地，很快地就失败了。\n\n当然，南北合议时的所有合约，协定也就都作废了。中国人好像根本就没有考虑过要遵守合约。\n\n既然当时的所有合约都作废了。那么，满清与大明原本是两个国家的事实就不能否认。满清重新建立自己的国家也就顺理成章。\n\n美日俄联手恢复满洲国也就非常合理。"
		},
		{
			"post_id": 517,
			"title": "川普应该与普京联手让西藏独立",
			"date_published": 1540804052.758,
			"body": "西藏独立，中国的问题就解决了一半。而且这是普京愿意合作的。\n\n普京一定知道，用不了多久，俄罗斯远东地区就会被中共弄的腐败遍地，环境破坏。然后建几个毫无用处的形象工程，欺骗普通民众。这种工程都是腐败工程，用于中共权贵的贪腐洗钱，当然也包括与俄罗斯当地官员勾结贪腐。\n\n普京对这个潜在的危机没有什么好的对策。而且俄罗斯是否有能力单独应对这种危机也是令人怀疑的。\n\n西藏独立之后，对俄罗斯的这种危机就会减小很多。\n\n而且西藏紧邻印度，与印度关系密切，印度与俄罗斯有长期友好关系。独立后的西藏对俄罗斯而言没有任何威胁。西藏与蒙古关系也很密切，俄罗斯与蒙古有长期友好关系，应该俄罗斯是很欢迎西藏独立的。\n\n西藏与尼泊尔，不旦，朝鲜，琉球一样，以前都是满清的附庸国，并非满清的行政区域。西藏的独立从国际法而言没有任何障碍。\n\n西藏并非满清的殖民地，所以西藏独立都不需要依据殖民地独立的原则进行全民公投，只要西藏人民的行政当局，即西藏流亡政府宣布废除与中共签订的17条就可以。\n\n西藏本身推动独立的能力很有限，需要西方世界的支持，尤其需要美国的支持。可是如果能联合俄罗斯，那西藏独立就容易多了。"
		},
		{
			"post_id": 516,
			"title": "通告",
			"date_published": 1540803975.59,
			"body": "吴越独立以后，凡因反抗中共暴政而坐牢的吴越勇士，不管是否生活在吴越地区，其坐牢时间按工令计算，计算为养老金缴纳时间。\n\n凡因反抗中共暴政而牺牲的义士，不管是否吴越人士，不管是否生活在吴越地区，都由吴越政府向其亲属发放抚恤金。如杨佳，贾敬龙，夏俊峰，钱文昭，钱明奇，金重齐等。"
		},
		{
			"post_id": 515,
			"title": "中国的分裂会从这几个地区开始",
			"date_published": 1540702962.658,
			"body": "中国的分裂一定会发生，这个与中国是否实行民主制度无关，是与近70年的中共高度集权有关，与民众普遍厌恶严密的社会控制有关。\n\n一定会分裂的有三个地区，新疆，西藏，广东。新疆，西藏因为原来就不属于中国，分裂很自然。广东地区普遍地有排外性，似乎广东对任何非粤语地区都排斥。走向独立就显得很自然。\n\n另外东北与内蒙古，这两个地区目前看东北独立意愿不强，内蒙古有一定的独立意愿，似乎推动比较困难。但是这两个地区如果能获得外部支持，特别是能获得日本，俄罗斯的支持，这两个地区的独立可能反而比新疆，西藏，广东的独立要容易。\n\n而且，日本与俄罗斯一定都愿意支持东北与内蒙古的独立的。\n\n再一个是上海，上海有很强的独立意识。上海的人口组成主要是江苏南部与浙江北部，也就是吴越人士。上海的独立一定会带动吴越地区，成为吴越独立。"
		},
		{
			"post_id": 514,
			"title": "中共并没有表面看来的那样强大",
			"date_published": 1540702792.285,
			"body": "现在钢化玻璃很普遍，你一定知道钢化玻璃很硬，即使用锤子都不能砸碎它。可是只要在一个边角上，敲掉小小一块，整个玻璃就全碎了。因为它内部的应力非常大，内部的应力平衡被破坏了，就会把整个玻璃都粉碎。\n\n中共政权也一样，表面看上去它很强大，任何外力都拿它没办法。其实它内部的各种应力非常大。哪怕在边角上出现一道裂缝，整个政权就会分崩离析。"
		},
		{
			"post_id": 513,
			"title": "美国协助中国各地独立符合中国传统道德，符合中国的原始正义。",
			"date_published": 1540662886.307,
			"body": "如果说孔子的学说代表了中国的传统价值观，道德伦理观，那么孔子学说最根本的一条就是“兴灭国\"。所谓“兴灭国\"就是恢复已经被灭亡的各邦国。\n\n现在的这个中国，或者说汉人为主的这个国家，原来只是很小的一个区域。只是从黄河流域到长江以南的平原地区，往西只到湖南一带。而且分布着数量众多的邦国，号称800诸侯。\n\n这些邦国不知道为何原因，也不知道是从什么时候开始，有了一个共推的共主。这共主对各邦国并没有管辖权，但是有号令天下的权力。\n\n如果某个邦国毫无理由地攻击其它邦国，用现代的语言就是发动侵略，或者某个邦国的君王无道，用现代的语言就是该国发生大规模人道危机，那么共主有权力号令天下，共同讨伐。\n\n可见，兴灭国，伐无道，在远古中国就符合天然正义，是天下共识。\n\n民主的美国，是当然的天下共主。协助中国各地独立，恢复被暴力并吞的国家，推翻中共暴政，即符合中国远古的原始正义，也符合中国2000年来的传统道德。"
		},
		{
			"post_id": 512,
			"title": "希望美国政府能明白：分裂中国优于宪政改革",
			"date_published": 1540647038.676,
			"body": "中国的分裂已经无法避免，即便中国实现了宪政改革，也会走向分裂。与其先进行宪政改革，再让整个中国在宪政下走向分裂，即无必要，也极易造成混乱甚至战乱。\n\n事实上要在中国实行宪政改革，还有一个无法逾越的障碍。中国的司法系统是最腐败的一个系统，而且它不是用来维护法制的，是用来维持中共专制统治的。如果要在中国实行宪政改革，首先会遇到一个难题，几乎所有的中共法官都会被起诉，会被起诉到个人破产，甚至大多数法官都会面临刑事起诉。\n\n这在政权没有变更的情况下，几乎无法启动宪政改革。\n\n中国人在中共近70年的洗脑下，全部都有不同程度的脑损伤。想在中国实行宪政改革，其过程会相当长，而且一定会出现反复。\n\n尤其是中国存在一个红二代权贵集团，这是一个极端主义思潮的政治集团。这个集团的关系非常紧密，能量非常强大，在一个统一的中国，无论实行什么制度，其影响力及破坏力都不可低估。\n\n这个红二代的多数父辈都是中国贫困地区出身，在一个分裂的中国，他们只能在一些贫困地区有强大的影响力，对发达地区不会有很大的影响力，这样他们的势力就会自然消亡。\n\n古代中国其实是很多的邦国，都是独立的邦国。尤其是中国南方，只是群居部落。但是这些邦国早期有一个共推的共主，至于为什么会出现一个共推的共主，具体是什么时候出现的，这已经无法知道。\n\n一个统一的中国是经历了500多年的残酷战争才形成的。中国走向分裂，其实也只是回归原始正义，并没有与现代政治文明有任何的冲突。\n\n尤其是西藏，新疆，及现在的东北三省，直到明朝还不是中国的疆域。西藏是一个很古老的独立国家，满清时期才成为附庸国。\n\n美国试图通过协助中国发展经济进而使中共放弃专制独裁的努力已经失败了，没有必要再一次的尝试。中共的专制本质不会改变。\n\n分裂中国可以获得俄罗斯的支持，这点比试图改变中共的专制体制来得容易实现。\n\n俄罗斯并不希望在它边上有一个强大的，统一的，蛮横不讲理的国家，这对俄罗斯有极大的威胁。如果没有这次的中美冲突，只需再过20年，俄罗斯的远东地区，甚至整个西伯利亚都会有很大的麻烦。这点俄罗斯应该是很清楚的。\n\n在俄罗斯爆发共产主义革命以后，有大量的俄罗斯人逃往上海，其中的一部分一直居住到50年代60年代。相信脱离共产党专制暴政的独立运动是能够获得俄罗斯民众的同情与支持。\n\n分裂中国应该先从西藏开始。美国政府应当协助流亡藏人向西藏传递信息。不但要向西藏民众传递信息，还要向西藏地区的中共军警传递被中共封锁的信息。向中共西藏地区的军警传递中共高层的腐败信息，向中共西藏地区的军警传递中共高层在海外的资产的信息。\n\n美国政府还应当协助西藏民众发动武装起义，即便能短期地占领一些西藏边境地区的市镇也是对独立运动有及其重大的意义。"
		},
		{
			"post_id": 511,
			"title": "给各地老兵的忠告",
			"date_published": 1540573850.315,
			"body": "各地老兵们，随着房地产市场的崩溃，各地的财政就没有来源了，政府部门的工资都发不出了。医保，社保的钱也没了。你们的诉求就更没有可能达到了。\n\n趁现在地方政府还有点钱，赶快维权吧，能拿到多少就先拿多少。以后的日子越来越艰难。\n\n习近平不惜大饥荒也要打贸易战，王歧山要中国人吃草，人民日报要中国人共度时艰，都已经说的很明白了。\n\n100人，200人的维权不要上北京，人数不够多，没有人会理你们的。中共的匪首忙着转移资产到国外去，忙着做倒台前的准备，哪里会有时间管你们的事？你们再喊拥护党中央也没用的，再喊拥护习近平也没用的。\n\n先坚持不断地在本省维权，由本省的政府拿出钱来，这比较可行。先把本省的老兵都聚集起来，然后再与其它省的老兵联合上北京。\n\n随着物价的上涨，更多的民众会与你们一起维权的。只要你们坚持，先在本省坚持维权，更多的民众会加入你们的维权队伍的。有其它维权群体加入你们的维权队伍，当地政府就会拿出钱来与你们谈判，因为他们怕局势失控。\n\n从网络上的视频看，你们的年龄都很大了，中共不垮台，你们一直到死都不会有好日子过了，你们以后的日子比你们现在的日子还要差。如果中共不垮台，与全世界对抗，经济是不可能好转了，你们以后的日子会越来越差，直到你们死都不会改变这个趋势。\n\n只有推翻共产党暴政，你们以后的日子才会好转。"
		},
		{
			"post_id": 510,
			"title": "震惊：高官也希望中共倒台？",
			"date_published": 1540573738.947,
			"body": "朋友与某厅官聊天获知：他们也希望中共倒台！ 原因：\n\n1.不安全！ ——害怕反腐自己被抓：风声鹤唳，连常委如康师傅、国际刑警组织主席孟宏伟都不安全，何况自己！中共倒台，反贪中止，方可安全！\n\n2.洗白脏款！ ——中共倒台，贪官所贪财物即可洗白，变为合法资产！"
		},
		{
			"post_id": 509,
			"title": "中共已经开启了沉船计划",
			"date_published": 1540480725.741,
			"body": "了解中共高层犯罪内幕的人物，一个接一个都被灭口了。了解中共高层腐败资金走向的人物也一个接一个被灭口了。\n\n应该还会有更多了解中共高层参与政策制定的人员，接受过内部杀人指令的低层级官员被灭口。\n\n想要自保的该想想后路了。\n\n想在被灭口以后，在中共倒台以后，民主政府能清算灭你口的人，你就该把你知道的相关资料妥善保存，并做详细的说明。最好是有视频保存在可靠的地方。不然你被灭口以后，就算共产党倒台了，灭你的人也无法追究了。视频最好要说明录制的时间。总之，作为证据的要素你应该知道有哪些。\n\n不做证据保存，你死了也是白死。"
		},
		{
			"post_id": 508,
			"title": "郭文贵要把600亿资产夺回来容易的很",
			"date_published": 1540480367.207,
			"body": "到泰北去成立一支反共武装，攻下一个县城就能把600亿抢回来。如果把昆明攻下来，那就赚大发了。"
		},
		{
			"post_id": 507,
			"title": "郭文贵早就该在泰北成立反共武装",
			"date_published": 1540396916.398,
			"body": "郭文贵在爆了王歧山的料之后，美国就会提供保护，保命的目的就已经达到。之后就应该在泰北成立反共革命军了，有了一支武装，就有了与中共讨价还价的资本，才有可能保财。\n\n郭文贵以为靠爆料能保财，想靠网络舆论让中共让步，私下与中共勾兑，实在太过幼稚，实在太不了解中共。\n\n中共只讲实力的，你没实力，它根本就不会理你。\n\n郭文贵以为他有18盘录像带就可以威胁习近平，太可笑了。你这18盘录像带哪怕是王歧山的淫乱录像带，习近平也不会尿你。习近平根本就不在乎牺牲任何人。只要对他本人没有直接的，立即的危险，他根本就不在乎。\n\n郭文贵最终没有把财保住吧。靠你每天在阳台上发几个小视频就能把几百亿财保住？太幼稚了吧？\n\n现在北京政泉控股有限公司强迫交易罪判处罚金人民币600亿元，都没了吧。你要是早在泰北成立反共革命军，中共就没可能开这个庭。\n\n问题是，现在是中共把你的财夺走了，中共倒台了，民主政府也不会把这些资产还给你。因为你的资产一定有问题的。\n\n你认为现在这些砸锅的，会同意民主政府把资产还给你吗？\n\n你想要在中共倒台之后把财产拿回来，靠你每天在阳台上发几个小视频能行吗？\n\n尽快在泰北成立反共革命军吧，在推翻中共政权的过程中，你能做出多大的贡献，这个才决定了将来民主政府是否会把资产归还给你。\n\n再说一遍，为了保财，尽快在泰北成立反共革命军。"
		},
		{
			"post_id": 506,
			"title": "是时候了，行动起来，彻底铲除共产暴政！",
			"date_published": 1540220474.274,
			"body": "海内外各路反共豪杰，是时候动手了！行动起来，有钱出钱，有力出力，今冬明春，把中共赶下台！\n\n现在首先要把重点放在支持老兵维权上，从资金上，技术上支援老兵维权。特别对一些贫困农村地区的老兵，如广西，云贵地区的农村老兵，一个月才150多块收入，要资助他们路费，让他们能到省会城市加入老兵维权的队伍。\n\n老兵一般都只会使用微信，行动计划完全被中共掌握，信息传递也容易被中共控制，要从技术上支持他们。最好能教会一些老兵使用零网，这样维权的信息能及时无障碍地传递，有利于其它地区老兵的增援。\n\n各地的反共勇士要主动去接触维权老兵，了解他们的情况，了解他们最需要的支持是什么。\n\n目前四川老兵的集结能力最强，要重点关注四川老兵的行动。主动为他们提供各种支持。四川老兵有最先占领广场的可能性。\n\n某地发生老兵集中维权，要尽力促成当地及周边地区其它维权群体与老兵维权同步进行，使中共难以集中警力，为各地老兵增援争取时间。\n\n要鼓动处于险境的贪腐官员拿出资金来支持老兵维权，要鼓动私人企业主资助老兵维权。海外的民运组织要派出人员潜入大陆，推动老兵维权。\n\n立即着手准备西藏武装起义！藏人流亡政府要立即开展起义武装的训练与装备。立即与美国黑水公司签订合约，协助西藏武装起义。\n\n流亡海外的中国富豪尽快组织私人武装，准备协助西藏武装起义。能组织一个营，一个团的兵力也是非常有力的支持。可以与西藏流亡政府签订合约参与西藏独立建国武装起义。\n\n各缺乏资金，缺乏组织能力的反共豪杰可以尽自己的能力行动起来。首先可以推广零网的使用，这不需要资金与组织能力，可以个人独立进行。尽快在各地建立起零网的同步站点。\n\n尽可能地将各地的民众维权信息，各地的反抗中共的行动发布到零网上，起到推波助澜的作用。\n\n是时候了，大家行动起来，彻底铲除共产暴政！"
		},
		{
			"post_id": 505,
			"title": "六名中共政治局现任及前任常委家族在港拥有巨额物业",
			"date_published": 1540200004.525,
			"body": "香港消息：香港媒体披露六名中共政治局现任及前任常委家族在港拥有巨额物业，总值超过21亿港元。\n\n香港《苹果日报》星期三盘点数名中共政治局现任和前任常委的家族成员在香港投资情况，发现其中总书记习近平的家族成员拥有物业市值约6.4亿港元，但资产最多的是前副总理张高丽的家族，拥有总值8.6亿元的物业。此外，胡锦涛家族、张高丽家族、贾庆林家族、栗战书家族、汪洋及万里家族的资产和资金同样落地香港，而2016年前则是这些高官在香港楼市扫货的高峰。\n\n报道披露，张高丽的女儿张晓燕已来港十多年，她与丈夫的生意遍及中港两地，拥有数十栋房产，总资产近8.6亿元。中国政协前主席贾庆林的外孙女李紫丹于2015年以全款3.87亿元购入一处房产。而贾庆林的妻子贾蔷早在1993年便以别名林青在港买楼，贾的女婿李伯潭则在1993年至2002年间买卖六个写字楼及商铺物业，多数在转售时获利。"
		},
		{
			"post_id": 504,
			"title": "房地产，疆藏，老兵",
			"date_published": 1540119629.707,
			"body": "房地产，疆藏，老兵这3个坎是中共过不去的，一定会垮在这的。中共的各地财政是从房地产来的，只要房地产垮了，维稳的钱就没了。没钱了，那些本来用来维稳的辅警，保安就成了维稳的对象了。\n\n当然中共各地的财政还有一部分是靠印钱支持的，而且房地产垮了，就得印更多的钱。这样物价就会越涨越高。退休人员首当其冲，这群脑残，毛粉，跳广场舞的傻逼就都成了维稳的对象。\n\n房地产现在只是一些地方的新盘崩盘了，好像二手房还没崩盘。我得去中介看看了。房地产是否真正崩盘这个大家可以了解的，只要去中介看看就知道了。中共无法隐瞒的。\n\n你看到中介的房价都在跌，那就是中共倒台的时间到了，你可以大胆出手干些什么了。\n\n疆藏这两个地方的分裂已经无法改变了。不过这两个地方控制非常严，大规模的民众抗议活动很难出现。判断最终会出现武装暴动。新疆边境已经聚集了一批维族武装，正在等待机会。西藏目前还没有武装力量，估计最终会出现的。\n\n一旦疆藏地区出现持续的武装起义，有一定的规模，中共就无法压制了。其它地区奋起反抗的时机就到了，可以大胆出击了。\n\n老兵维权目前越演越烈，规模越来越大。老兵这个群体规模庞大，行动力强，迟早会占领某个省会城市的广场。一旦占领某个省会城市的广场而中共无法驱离，那就是中共倒台的时刻了。\n\n老兵的弱点是只会使用微信，造成行动完全被中共掌握，无法有效聚集。也造成维权现场视频的发布不及时。而且很多老兵在财力上也无法长期维权。\n\n我们可做的是帮助他们传递信息。目前最需要的是能够向他们提供资金支持。如果能教会他们中的一部分人使用零网，那就太好了。老兵维权目前都是数百数千的聚集，视频发布到零网上，立即可以获得数百数千个节点，向外扩散的速度会很快的。\n\n房地产，疆藏，老兵是目前观察中共倒台时间最准确的指标。各路反共豪杰可以密切关注这3个指标，制定自己的行动方案。"
		},
		{
			"post_id": 503,
			"title": "以孟宏伟为例给各路腐败官员提个醒",
			"date_published": 1540051945.122,
			"body": "像孟宏伟这样的官员，公安部副部长，国际刑警组织主席，说消失就消失，如果不是他老婆在法国报警，至今没人知道他在哪里，也没人知道生死。\n\n你们的官位有他高吗？你们的背景比他强吗？你们感到恐怖吗？如果你不感到恐怖，那就不用看了。如果你感到很恐怖，想有个退路，我以孟宏伟为例子，给你说说。\n\n中共抓捕孟宏伟这手段实在太烂，把习近平这几年在国际上吹的治国理念全搞砸了。应该是出于无奈，事情太过紧迫，顾不上了。其中应该还有一个原因，他们没有估计到孟妻敢在法国报警。\n\n他们估计孟妻不敢在法国报警是有依据的，因为中共也了解如何在西方申请政治庇护。一般来说，以孟宏伟在中共体制内这样的官阶，像孟宏伟妻子这样的身份，是不太可能在西方申请政治庇护的。\n\n中共已经派出2个小组，直接向孟妻挑明这点，孟妻自然不敢报警。孟妻显然不知道这些，从她的记者会，接受采访的言论可以看出，她完全不懂这些。\n\n应该是孟发出的那个刀把子图片起了作用，那个图片让孟妻赶在中共小组到达前就报警了，打乱了中共的计划。\n\n有人会说，令完成不是在美国受到庇护了嘛，俞振声的哥哥也在美国受到庇护了。没错他们是受到庇护了。一般来说他们是不可能受到庇护的。他们应该是向美国提供了极高的机密。提供这些机密，对中共方面来说，是属于叛国罪。这与一般的贪官外逃是不同的。\n\n你不可能在国内贪污一笔钱，然后逃到西方国家，声明叛逃，然后申请政治庇护。中共把你抓回去也不会按叛国罪审判你。这个看那些被抓回去的外逃贪官就能理解。\n\n如果孟宏伟的妻子能在法国成功申请政治庇护，那她一定有向法国提供极高机密的文件，对中共而言，足以构成叛国罪。否则她不可能在法国获得政治庇护。当然如果她现在就参与反共组织，参与反共活动，那又当別论，是否能申请成功难说。\n\n那么下面要讲你们这些身处险境的腐败官员利害相关的话了。\n\n如果哪天你也遇上了孟宏伟这样的事，你在海外的家属手上有极高的机密吗？可能性不大。万一你被抓了，家人能在西方申请政治庇护吗？不太可能。或者他们造假取得的身份会被取消吗？肯定会被取消，然后遣送回来。你自己能在出事前逃亡西方申请政治庇护吗？没可能。\n\n那怎么办？有没有办法给自己先留一条后路，万一出事了，家人能在西方申请政治庇护。万一出事了，自己能逃亡西方申请政治庇护。\n\n有的。你不是地下室里放了大堆的现金嘛。拿出一部分资助反共活动，留下证据。\n\n你可以资助老兵维权，你可以资助律师维权，你可以资助西藏，新疆的人权运动。你可以做的有很多。只要留下证据。\n\n资助老兵维权很容易，你总有可靠的亲属吧，通过他们去老兵维权现场捐款，给老兵提供车费，旅馆住宿费用，去老兵维权现场送物资，去老兵维权现场给他们买盒饭。用手机拍下视频，发到网上最好，便于以后查证。发视频实在不安全，那就自己放在安全的地方。将来都可以用来申请政治庇护。这种证据越多越好，资助的钱越多越有利于申请政治庇护。\n\n这很难暴露的，因为民众自发给维权老兵提供物资，提供盒饭很多的。\n\n当然你还可以有更好的方法。千万别像孟宏伟的妻子，开记者会证明他先生清白，那完全没可能在法国获得庇护。她继续这样下去，最终的结果是几亿贪污所得不是被中共没收，就是被法国政府没收，人还会被赶回中国，与孟宏伟一样坐牢。"
		},
		{
			"post_id": 502,
			"title": "孟宏伟的妻子应该披露中共跨境执法的内幕",
			"date_published": 1539786175.97,
			"body": "现在中共派了2个工作小组到法国来威胁你，对你造成人身威胁，这显然是违法的行为，你也感觉到了这种暴政的恐怖。\n\n可是你先生是公安部的副部长，他长期在公安部工作，他也一定做过很多这样的事。除了跨境执法，还有很多在国内的跨省抓捕，你先生都参与过，或者指挥过，或者指示过。\n\n你应当了解其中的内幕，你应该了解很多细节，你应该知道有很多家庭遭受了这样的恐怖，你应该知道有很多孩子的父亲因此消失了，你应该知道有很多妻子的丈夫因此消失了。\n\n现在你应该把这种黑幕揭露出来，让真相大白于天下；在你应该把这种黑幕揭露出来，负起历史的责任；在你应该把这种黑幕揭露出来，让所有的妻子和孩子的丈夫和父亲不再消失。"
		},
		{
			"post_id": 501,
			"title": "孟宏伟的妻子只有背叛才能获得安全\n",
			"date_published": 1539702179.861,
			"body": "孟宏伟的妻子需要明白你自己都处在危险之中。孟宏伟是中共专制集团的重要成员，不是他一被抓你就自然获得向西方国家申请政治庇护的资格的。你作为中共专制集团重要成员的配偶，是不具备在西方国家申请政治庇护的资格的。\n\n你只有背叛，背叛你们的专制集团才有可能向西方民主国家申请政治庇护！\n\n你的记者会还在维护中共的暴政，还在声称孟宏伟是在中国推动法制，你根本就不可能在法国申请政治庇护的。\n\n你在记者会发表几句豪言壮语，说几句不着边际的追求真相、正义和历史责任的空话也不能构成在法国申请政治庇护的条件。\n\n你不能在法国获得政治庇护，当孟宏伟被中共以刑事罪名定罪之后，你及你的孩子也一定会被中共抓捕回去的。法国没有理由庇护你！\n\n赶快行动吧，背叛你的祖国，背叛这个罪恶之邦，背叛你丈夫孟宏伟推动的恶劣法制，这样你才有安全，你才能在法国申请政治庇护，你才可能帮助你那作恶多端的中共犯罪集团的重要成员的丈夫。\n\n你不太可能掌握足够的资料来保障孟宏伟的安全，甚至可能没有足够的资料在法国申请政治庇护。你只有行动，积极参与到反共的行列中，这样才可能在法国申请政治庇护，这样才可能帮助你那在权力斗争中失败的丈夫。\n\n搞乱中共的天下，这才是对你丈夫最大的帮助。你能做的就是把贪腐得来的钱拿一部分出来，资助维权运动，资助反共革命。目前最好的方式是资助老兵维权。\n\n如果你无法资助老兵维权，你没有这样的渠道，你也可以资助西藏独立运动，资助维吾尔独立运动，这渠道很容易获得，在法国就可以联系藏人流亡政府的代表，就可以联系世界维吾尔代表大会的代表。"
		},
		{
			"post_id": 500,
			"title": "孟宏伟的妻子不想孟宏伟以后坐在轮椅上就得赶快行动",
			"date_published": 1539517618.835,
			"body": "孟宏伟的妻子掌握的材料肯定比不上令完成。孟宏伟所能掌握的机密远比不上令计划能掌握的机密。\n\n孟宏伟的结局肯定达不到令计划的结局，不过应该能比王立军的结局好一点。在这两者之间。\n\n孟宏伟的妻子不想孟宏伟以后坐在轮椅上，就得赶快行动。\n\n你没有可能让中共放人，没有可能把孟宏伟救出来。你唯一能做的是拿出钱来，支持老兵维权。把中共的天下搞乱，让中共顾不上处理孟宏伟，这样才能救他。\n\n你也很难申请政治庇护，因为你是中共犯罪集团的成员。孟宏伟不是中共专制的受害者，他是权力斗争的失败者，这不构成申请政治庇护的条件。你只有直接参与到反共革命的事业中才有可能申请政治庇护。\n\n直接资助国内的反抗运动，直接支持，参与把共产党的天下搞乱，这样你才能申请政治庇护。\n\n你得赶快行动，你即使已经取得法国的身份也是没用的，这个以欺骗手段获得的身份是无法保护你的。"
		},
		{
			"post_id": 499,
			"title": "想救孟宏伟，孟宏伟的妻子就该拿出钱来！",
			"date_published": 1539267202.545,
			"body": "孟宏伟的案子绝对不会只牵连到王健谋杀案，也绝对不会只牵连到江泽民，也绝对不会只牵连到王歧山。必要时习近平是一定会牺牲掉王歧山的。\n\n孟宏伟一定是关联到习近平的死活。不拿出钱来，根本就救不了孟宏伟。\n\n只有中共倒台才可能救孟宏伟，想要加快中共的倒台，孟宏伟的妻子就该拿出钱来，资助老兵维权。\n\n向孟宏伟这样的中共高官，贪腐的资金都是几百亿，几千亿，你不拿出来，迟早也被黑吃黑。\n\n先拿出1-2个亿，通过秘密的渠道，资助老兵维权，这才是孟宏伟妻子唯一的选择。\n\n孟宏伟失踪前发了一把刀的图片，除非你们夫妻之间早有约定，不然孟宏伟的意思直白的很，无非就是血拼，或者要你大出血。其实这是一个意思，血拼也好，大出血也好，你能做的就是拿出几个亿，资助老兵维权。"
		},
		{
			"post_id": 498,
			"title": "谈谈老兵维权",
			"date_published": 1539109705.661,
			"body": "网上有些人对老兵维权颇多微词，认为老兵本是中共的走狗，打手，不过是被中共抛弃了，所以不值得同情。\n\n我以为这不可取。要说老兵本是中共的走狗，打手，那体制内的人，哪个不是中共的走狗，打手？哪个不在参与作恶？\n\n8000万中共党员更是中共的走狗，更是直接参与作恶。没有退出中共，还在缴纳党费的是直接在资助犯罪集团。\n\n老兵维权是否合理？我认为当然合理。因为中共当初是承诺了他们退伍以后的待遇，承诺了他们退伍以后的干部编制，承诺了他们退伍以后安排就业。\n\n然而中共违背了承诺，就像中共违背了在发展中解决历史遗留问题的承诺一样，就像中共违背了加入WTO的承诺一样，就像中共违背了依法治国的承诺一样。\n\n中共一贯的做虚假承诺，应该要让他们为此付出代价。\n\n老兵的维权就是要中共兑现承诺。老兵维权也是告诉美国，中共的承诺不可信。\n\n所以我们应该支持老兵维权。"
		},
		{
			"post_id": 497,
			"title": "“川军”的做法是对的",
			"date_published": 1539025284.439,
			"body": "看到有些人在网上讽刺老兵川军的做法，我认为很不妥当。“川军”的做法是对的，值得提倡。\n\n老兵维权根本就不可能有结果的，这点在网上讽刺川军的可能还不明白，可能他们还对共产党抱有希望。\n\n川军比这些人明白，川军知道这种维权不会有结果的。他们现在这种高调出发，每次能获得一些补偿的做法非常可取。有利于沿途各地老兵加入维权队伍。这样不但能给自己先拿到一些利益，还能把老兵维权持续下去。\n\n如果他们不能获得一定的补偿，有多少老兵能这样长期维权？指责川军做法的人为老兵维权提供了多少资金支持？\n\n川军的做法能为全国各地仿效，那么老兵维权的队伍就更大了。\n\n下面是网上讽刺川军做法的言论：\n\n【经过一天一夜，“川军”才磨蹭到西安站，并且一路用微信播报位置。没猜错的话，他们就是希望走到某一站，被省级维稳队伍拦截，然后每人敲一笔钱回家。和上次声援镇江一样。没出息！】"
		},
		{
			"post_id": 496,
			"title": "彭斯副總統发《出师表》",
			"date_published": 1538764944.005,
			"body": "以下是美國之音根據白宮發佈的彭斯副總統演講稿所做的全文翻譯：\n\n肯(哈德遜研究所總裁兼首席執行官Kenneth R. Weinstein)，感謝你的介紹。尊敬的各位理事，白邦瑞博士(Dr. Michael Pillsbury)、各位尊敬的嘉賓以及“以非傳統方式思考未來”的在座各位，能來哈德遜研究所演講是我的榮幸。\n\n大約半個世紀以來，哈德遜研究所致力於“推進全球安全、繁榮與自由”。儘管哈德遜研究所的領導層不斷更迭，有一件事從未改變：你們不斷推進尋求真相，美國的領導力照耀著前進的道路”。\n\n今天，談到領導力，請允許我帶來美國在國內外發揮強大領導力的宣導者---第45屆美國總統唐納德·特朗普的問候。\n\n---\n\n特朗普總統上任伊始，就把與中國和中國國家主席習近平的關係列為重要議題。去年4月6日，特朗普總統在海湖莊園與習主席會面。去年11月8日，特朗普總統前往北京，中國領導人熱情接待了他。\n\n在過去的兩年裡，我們的總統與中華人民共和國主席建立了堅固的個人關係，他們合作推進共同利益，最重要的就是推進朝鮮半島的去核化。\n\n我今天來到這裡，是因為美國人民有權利知道這一點，那就是在此刻，北京正在使用一種全政府的手段，利用政治、經濟、軍事工具以及宣傳，在美國推進其影響和利益。\n\n中國也比以往更活躍地使用其力量，來影響並干預美國的國內政策和政治。\n\n在特朗普總統的領導下，美國使用我們的原則和政策，開始對於中國的行動展開決定性的回擊。\n\n特朗普總統去年12月公佈的《國家安全戰略》中，談到了“大國競賽”的新時代。外國開始“重塑他們在區域和全球的影響力”，並“挑戰美國的地緣政治優勢，並試圖改變國際秩序使之適合他們的利益”。\n\n在這項戰略中，特朗普總統明確表示，美國已經對中國採取新的政策。我們尋求公平、對等以及相互尊重主權的關係，而且我們已經開始採取迅速有力的行動來達成這個目標。\n\n特朗普總統去年訪問中國期間表示，“我們有機會加強兩國的關係並改善兩國民眾的生活”。我們對未來的願景建立在過去的最佳時期，那時美中兩國以公開和友善的態度互相接觸。\n\n在獨立戰爭之後，當我們年輕的國家尋求新的出口市場時，中國人對帶著滿載著人參和皮毛的美國貿易者敞開了大門。\n\n當中國經受“百年恥辱”之際，美國拒絕加入，並主張“門戶開放”政策，我們能夠與中國進行更自由的貿易，並維持他們的主權。\n\n當美國傳教士帶著福音來到中國海岸，他們被古老而充滿活力的人民和深厚的文化所吸引。他們不僅傳播了信仰，還創立了中國一些最早和最優秀的大學。\n\n隨著二戰開始，我們做為盟國共同打擊帝國主義。在戰爭之後，美國確保中國成為聯合國的一部分，成為戰後世界的一股重要力量。\n\n但是，中國共產黨在1949年掌權之後開始了威權擴張主義。很難想像五年之前我們並肩作戰，而五年之後我們在朝鮮半島的山區和峽谷中交戰。我的父親也參與了那場自由之戰。\n\n然而，甚至殘酷的朝鮮戰爭都沒能磨滅我們恢復人民之間長期紐帶的共同願望。中國與美國的隔離在1972年結束，之後不久，我們恢復了外交關係並開始經貿往來，美國大學也開始培訓新一代的中國工程師、商業領袖、學者和官員。\n\n蘇聯垮臺之後，我們認為中國將不可避免地成為自由國家。帶著這份樂觀，美國在21世紀前夕向中國敞開大門，將中國納入世界貿易組織。\n\n此前的政府做出這個決定，希望中國的自由將蔓延到各個領域---不僅僅是經濟，更是政治上，希望中國尊重傳統的自由主義原則、尊重私人財產、個人自由和宗教自由，尊重人權。但是這個希望落空了。\n\n中國人民自由的希望仍沒有實現。北京仍然口頭上在說“改革開放”，然而鄧小平的這個著名政策已經變得空洞。\n\n在過去17年，中國的GDP增長九倍，變成了世界第二大經濟體。這很大程度上得益於美國對中國的投資。中國共產黨也使用了與自由公平貿易不符的一系列政策，包括關稅、配額、貨幣操縱、強制技術轉移、智慧財產權盜竊以及工業補貼。這些政策建立了中國製造業的基本，而以競爭對手特別是美國的利益為代價。\n\n中國的行為給美國帶來了巨大貿易赤字，去年這個數字是3750億，幾乎占我們全球貿易赤字的一半。就像特朗普總統本周說的，我們在過去25年重建了中國。\n\n現在，通過“中國製造2025”，中國共產黨試圖控制全世界90%的最先進的工業，包括機器人、生物科技和人工智慧。為了贏得21世紀經濟的領導權，北京指導其工業官員和商界以任何方式獲取美國的智慧財產權。這是我們經濟領導力的基石。\n\n北京現在要求很多想在中國做生意的美國公司交出他們的商業秘密，也要求並支援對美國公司的並購，以獲取他們的創意。最可怕的是，中國的安全機構掌握了大量竊取美國科技的能力---包括最先進的軍事技術。使用這些偷竊的技術，中共正大規模地化犁為劍。\n\n中國的軍費是亞洲其他國家的總和，北京將在陸海空，乃至外太空抗衡美國軍力作為首要任務。中國希望將美國擠出西太平洋，並試圖阻止我們援助盟友。但是他們會失敗。\n\n北京也比以往任何時候都更廣泛地宣示其力量。中國船隻經常在由日本管理的尖閣列島附近巡邏。儘管中國領導人2015年站在白宮玫瑰園裡說他的國家“無意將南中國海軍事化”，今天，在人工建造的島嶼上的軍事基地裡，北京部署了先進的反艦和防空導彈。\n\n中國這星期展示了咄咄逼人的行為，一艘中國軍艦逼近在南中國海進行自由航行的美國“迪凱特號”軍艦，兩艦相距僅有不到45碼，迫使我方軍艦迅速採取避撞動作。儘管受到這樣魯莽的騷擾，美國海軍將在國際法允許的範圍內、在我們國家利益的要求下，繼續飛行、航行和運作。我們不會被嚇倒；我們不會退縮。（掌聲）\n\n美國曾希望經濟自由化將讓中國與我們和世界建立起更好的夥伴關係。相反，中國選擇了經濟侵略，而這又壯大了中國不斷擴大的軍隊的膽量。\n\n北京也沒有像我們希望的那樣讓自己的人民邁向更大的自由。曾有一度，北京慢慢地走向更大的自由以及對人權的更大尊重。然而，近年來，中國朝著控制和壓迫本國人民的方向急轉彎。\n\n如今，中國已經建立了無以倫比的監控國家，範圍越來越廣，越來越具侵入性，而且經常是在美國技術的幫助之下。他們所說的“中國防火長城”也築得越來越高，嚴重限制著中國人民的資訊自由流通。\n\n到2020年，中國的統治者試圖落實奧威爾式的體系，也就是所謂的“社會信用分數”，前提是幾乎控制人們生活的方方面面。用這一專案藍圖的官方文字的話說，該體系“讓守信者暢行天下，讓失信者寸步難行。”\n\n在宗教自由的問題上，中國的基督徒、佛教徒和穆斯林正在經受新一波迫害浪潮的衝擊。\n\n上個月，北京關閉了中國最大的地下教會之一。在全國各地，當局拆毀十字架、焚燒聖經、監禁信徒。北京如今還與梵蒂岡達成協議，讓公開宣稱不信神的共產黨在任命天主教主教方面發揮直接作用。對中國的基督徒來說，這些是絕望的時刻。\n\n北京也在打壓佛教。過去十年來，超過150名藏僧為了抗議中國壓制他們的信仰和文化而自焚。在新疆，共產黨在政府營地內監禁了多達一百萬維吾爾穆斯林。他們在那裡經受晝夜不停的洗腦。營地的倖存者描述他們的經歷說，這是北京蓄意要扼殺維吾爾文化並消滅穆斯林信仰。\n\n歷史已經證明，那些壓迫本國人民的國家很少就此住手。北京還試圖將其勢力擴展到全世界各地。正如哈德遜研究所的白邦瑞博士所寫，“中國反對美國政府的行動和目標。實際上，中國正在與美國的盟友和敵人打造自己的關係，與北京的任何和平或積極的意圖背道而馳。”\n\n事實上，中國用所謂的“債務外交”擴大其影響力。今天，中國為亞洲、非洲、歐洲甚至拉丁美洲的政府提供數千億美元的基礎設施貸款。但這些貸款的條款就算往好裡說也是不透明的，而且帶來的利益壓倒性地流向北京。\n\n問問斯里蘭卡吧，他們借了巨額債務讓中國國企建造商業價值存疑的港口。兩年前斯里蘭卡無法償還貸款，於是北京迫使斯里蘭卡將新建的港口交到中國手裡。這個港口可能很快就要成為中國不斷擴展的藍水海軍的前沿基地了。\n\n在我們的半球內，北京向委內瑞拉腐敗無能的馬杜羅政權提供了一條生命線，承諾提供50億美元的、可以用石油償還的貸款。中國還是該國最大的單一債權人，讓委 內瑞拉人民背上了超過500億美元的債務。北京還通過向承諾配合中國戰略目標的政黨和候選人提供直接支持來腐化一些國家的政治。\n\n自去年以來，中國共產黨已說服三個拉丁美洲國家與臺灣斷交，轉而承認北京。這些行動威脅到臺灣海峽的穩定—美利堅合眾國對此予以譴責。儘管我們政府將遵守三個聯合公報和《臺灣關係法》所反映的一個中國政策，美國始終相信，臺灣對民主的擁抱為所有華人展示了一條更好的道路。（掌聲）\n\n這只是中國試圖在世界各地推動其戰略利益的幾種方式而已。然而，前幾屆政府忽視了中國的行動。在很多情況下，他們還助長了他們。但是，這樣的日子結束了。\n\n在特朗普總統的領導下，美利堅合眾國一直在以重新煥發的美國實力來捍衛我們的利益。\n\n我們正在使世界歷史上最強大的軍隊更為強大。今年早些時候，特朗普總統簽署法律，讓我們的國防經費有了羅奈爾得·雷根時代以來最大的增長，撥款7160億美元，以加強美軍在各個領域的實力。\n\n我們正在把我們的核武庫現代化。我們正在部署和開發新的先進戰鬥機和轟炸機。我們正在建造新一代航空母艦和戰艦。我們對我們武裝部隊的投資是前所未有的。這包括啟動建立美國太空軍的進程，以確保我們在太空的主宰地位能夠持續下去。我們已經採取行動，授權加強在網路世界的能力，打造針對我們對手的威懾力量。\n\n在特朗普總統的指示下，我們還在落實針對2500億美元中國產品的關稅，最高額的關稅特別對準了北京試圖佔領和控制的先進產業。總統也明確表示，我們還將徵收更多的關稅，有可能大幅增加這筆數額，可能會翻一番還多，除非達成公平與對等的協定。\n\n這些行動行使了美國的實力，造成了重大影響。中國最大的股市在今年頭九個月跌落了25%，大部分原因是因為本屆行政當局對北京的貿易行為採取了堅定的立場。\n\n正如特朗普總統所明確表示，我們不希望中國的市場遭殃。事實上，我們希望他們的市場繁榮。但是，美國希望北京尋求自由、公平和對等的貿易政策。我們將繼續堅持要求他們這樣做。（掌聲）\n\n可悲的是，中國的統治者到目前為止拒絕走那條道路。美國人民理應知道：做為對特朗普總統所採取的強硬立場的回應，北京正在推動一場全面而有協調的運動，以破壞總統、我們的議程和我們國家最珍貴的理想所受到的支援。\n\n今天我想告訴你們我們瞭解到的中國在美國國內所採取的行動，有些是我們從情報評估中收集的，有些是可以公開獲取的。但是一切都是事實。\n\n就像我說過的那樣，就在我們此時說話之際，北京正在利用全政府的方式來推進其影響力並謀取其利益。北京正在以更為主動和脅迫性的方式使用這種力量，干涉美國的國內政策和政治。\n\n今天，中國共產黨政府正在獎賞或脅迫美國的工商企業、電影製片廠、大學、智庫、學者、記者、地方、州和聯邦政府官員。\n\n最惡劣的是，中國發起了前所未有的行動，以影響美國公眾輿論、2018年選舉和2020年總統選舉前的環境。坦率地說，特朗普總統的領導正在奏效；中國希望美國有個不同的總統。\n\n毫無疑問,中國正在干涉美國的民主運作。就像特朗普總統上個星期所說的那樣，我們“發現中國在試圖干預我們2018年即將到來的中期選舉。”\n\n我們的情報界表示，“中國正在瞄準美國的州和地方政府和官員，以利用聯邦政府和地方政府在政策上的分歧。中國正在利用一些可能引起意見分裂的議題，如貿易關稅問題，以推動北京的政治影響力。”\n\n今年6月，北京發出了一份名為宣傳管理通知的敏感檔，其中提出了它的戰略。該通知的原話說，中國必須精准出擊，分化美國國內不同的群體。\n\n為了達到這一目的，北京調遣其隱秘的行動人員、幌子組織和宣傳機構來改變美國人對中國政策的看法。我們情報界一位資深職業官員最近告訴我說，跟中國正在美國各地所做的事情相比，俄羅斯正在做的事情是小巫見大巫。\n\n一些中國高級官員還試圖把美國一些工商界領袖意圖維持他們在中國的公司運營的願望作為杠杆來影響他們，要他們譴責我們的貿易行動。最近的一個例子是，他們威脅美國一家大公司說，如果該公司拒絕公開發聲反對美國政府的政策，就不批准他們在中國的營業執照。\n\n就影響中期選舉而言，諸位只需要看一看北京針對我們的關稅政策提出的反制關稅就可以了。北京特意鎖定那些可能在2018年選舉中發揮重大作用的行業和州。 有一種估算是，中國選擇打擊的美國的郡有80%以上曾在2016年投票支持特朗普總統；如今，中國希望把那些選民調轉過來反對我們的行政當局。\n\n中國還直接向美國選民發出訴求。上個星期，中國政府出資在《得梅因紀事報》刊登了好幾頁的插頁廣告。那份報紙是美國駐中國大使的家鄉州愛奧華州的主要報 紙，也是2018年選舉的一個具有關鍵州。那些廣告的版面設計看上去像是新聞報導，把我們的貿易政策說成是魯莽的，對愛奧華州的人是有害的。\n\n幸運的是，美國人不吃這一套。例如，美國農場主跟總統站在一起，而且也正在看到特朗普總統所採取的堅定立場有了實際的效果，其中包括本星期美國-墨西哥-加拿大協議(USMCA)，我們以實質性的方式為美國產品打開了北美的市場。USMCA對美國的農場主和製造業來說是重大勝利。（掌聲）\n\n然而，中國的行動並不僅僅專注於影響我們的政策和政治。北京還在採取步驟，利用其經濟杠杆力和巨大市場的誘惑力，對美國工商界施加影響。\n\n北京如今要求在中國經營的美國合資企業在公司內部建立他們所說的“黨組織”，讓共產黨在雇人和投資決策上擁有發言權甚至否決權。\n\n中國當局還對把臺灣描述為獨特地理實體或者偏離中國西藏政策的美國公司發出威脅。北京迫使達美航空公司不在網站上把臺灣稱為“中國一個省”而公開道歉。北京還迫使萬豪解雇了一名只是轉推了一條有關西藏推文的美國雇員。\n\n北京經常性地要求好萊塢嚴格地正面描繪中國。那些沒有這樣做的製片廠和製片人受到懲罰。北京的審查人員對哪怕對中國只有小小批評的電影都迅速加以剪輯或取締。影片《僵屍世界大戰》(World War Z)必須刪掉劇本裡提到的一種病毒，因為這種病毒源自中國。影片《赤色黎明》(Red Dawn)利用數位技術進行了修改，把反面人物變成朝鮮人，而不是中國人。\n\n但是，除了工商和娛樂領域之外，中國共產黨還在為美國境內，而且坦率地說，在全世界各地的宣傳機構花費數以十億計美元。\n\n中國國際廣播電臺如今在美國30多個電臺播放對北京友好的節目，很多電臺位於美國大城市。中國國際電視臺觸及到7千5百萬美國人，它直接從中國共產黨的主子那裡接受行動命令。中國最高領導人視察這家電視網路總部時說了這樣的話：“黨和政府主辦的媒體是黨和政府的宣傳陣地，必須姓黨。”\n\n出於這些原因和這一現實，司法部在上個月下令該網路登記為外國代理人。\n\n共產黨還威脅和拘押那些對問題挖掘太深的美國記者的中國家人。中共還封鎖美國媒體機構的網站並增加了我們的記者獲得簽證的難度。這發生在《紐約時報》發表了有關中國一些領導人的財富的調查報告之後。\n\n但是媒體不是中共試圖營造審查文化的唯一領域。學術界也是這樣。\n\n只需看看中國學生學者聯合會就夠了。這個組織在美國各地校園有150多個分支。這些群體幫助為在美國學習的43多萬中國國民中的一些人組織社會活動，當中國學生和美國學校偏離了共產黨路線時，他們還向中國使領館報告。\n\n在馬里蘭大學，一名中國學生最近在畢業典禮上談到了她所說的“言論自由的清新空氣”。共產黨官方報紙立刻斥責了她，她成為嚴格控制下的中國社交媒體批評風暴的受害者，她的家人在國內受到騷擾。而對馬里蘭大學本身而言，它與中國的交流專案本是美國最為廣泛的，突然間從源源不絕變成了點點細流。\n\n中國還通過其它方式施加學術壓力。北京慷慨地向大學、智庫和學者提供資金，彼此的理解是他們會回避共產黨認為危險或冒犯的觀點。中國事務專家尤其知道，如果他們的研究與北京的口徑相抵觸，他們的簽證將被延遲或拒絕。\n\n即使避免從中國拿錢的學者和組織也成為中國的打擊目標。哈德遜研究所就有親身體會。在你們提出要為一位北京不喜歡的講話人主辦講座時，你們的網站遭到源自上海的重大網路攻擊。你們比多數人都瞭解，中共試圖破壞美國今天的學術自由和言論自由。\n\n這些以及其它行動加在一起，構成了不斷加劇的努力，目的是要讓美國的公眾輿論和公共政策偏離堅持美國優先的特朗普總統的領導。但是我們向中國統治者發出的訊息是：本屆總統不會退縮，（掌聲）美國人民不會動搖。雖然我們希望改善與北京的關係，但我們將繼續堅定地捍衛我們的安全和我們的經濟。\n\n本屆行政當局將繼續採取果斷行動，保護美國的利益、美國的就業和美國的安全。\n\n在我們重建軍隊的同時，我們將繼續維護美國在印太地區的利益。\n\n在我們回應中國的貿易行為時，我們將繼續要求與中國建立自由、公平和互惠的經濟關係。我們將要求北京打破貿易壁壘，履行義務，全面開放經濟——就像我們開放我們的經濟一樣。\n\n我們將繼續對北京採取行動，直到盜竊美國智慧財產權的行為永遠消失。我們將繼續堅定立場，直到中國政府停止強行技術轉讓的掠奪性做法。我們將保護美國企業的私有財產利益。(掌聲)\n\n為了推進我們自由開放的印度洋-太平洋地區願景，我們正在與從印度到薩摩亞等整個地區與我們有著共同價值觀的國家建立更牢固的新紐帶。我們的關係將源于夥伴關係的尊重，而非統治。\n\n我們正在雙邊基礎上達成新的貿易協定，就像上周特朗普總統與韓國簽署了一項改善後的貿易協定一樣。我們不久將開始與日本進行歷史性的雙邊自由貿易談判。(掌聲)\n\n我還高興地報告，我們正在精簡國際發展和金融項目。我們將給外國一個公正、透明的選擇，以取代中國的債務陷阱外交。事實上，本周特朗普總統將把《建設法案》(Build Act)簽署成為法律。\n\n下個月，我將有幸代表美國參加在新加坡舉辦的東盟峰會和在巴布亞紐幾內亞舉辦的亞太經合論壇。在那裡，我們將公佈新的措施和計畫，以支持一個自由開放的印太地區。我將代表總統傳達這樣一個資訊:美國對印度洋-太平洋地區的承諾從未如此堅定。(掌聲)\n\n在國內，為了保護我們的利益，我們最近加強了外國投資委員會的權力，加強了我們對中國在美投資的審查，以保護我們的國家安全不受中國政府掠奪性行為的影響。\n\n當涉及北京對美國政治和政策的惡意影響和干涉時，我們將繼續揭露它，無論北京採取何種形式。我們將與社會各階層領導人合作，捍衛我們的國家利益和最珍視的理想。美國人民將發揮決定性作用——事實上，他們已經在起作用了。\n\n當我們聚集在這裡的時，一種新的共識正在全美興起。越來越多的商界領袖考慮的是下個季度以後的事情，如果要交出他們的智慧財產權或協助北京的壓迫，在進入中國市場之前，他們會三思而後行。但更多企業必須效仿。例如，谷歌應立即終止“蜻蜓”應用的開發，該應用將加強共產黨的審查，並損害中國消費者的隱私。(掌聲)\n\n我們也很高興看到更多的記者報導真相，不用恐懼也沒有偏袒，深入挖掘如何中國干涉我們社會以及背後原因。我們希望美國和全球新聞機構將繼續加入這一努力。\n\n越來越多的學者也在大聲疾呼，捍衛學術自由，越來越多的大學和智庫也在鼓足勇氣拒絕中國政府的容易錢，它們認識到，每一美元都有相應的要求。我們相信他們的隊伍會不斷壯大。\n\n在全國範圍內，美國人民的警惕性越來越高，他們重新讚賞美國政府的行動，以及特朗普總統重啟美中經濟和戰略關係的領導能力。美國人堅定地支持一位把美國放在第一位的總統。\n\n在特朗普總統的領導下，我可以向你們保證，美國將堅持到底。中國應該知道，美國人民及其兩黨民選官員的問題已經得到解決。\n\n正如我們的國家安全戰略所指出的那樣:我們應該記住，“競爭並不總是意味著敵意”，它也不必如此。特朗普總統已經明確表示，我們希望與北京建立建設性關係，共同促進我們的繁榮與安全，而不是分離。儘管中國政府一直在進一步偏離這一願景，但中國領導人仍可以改變路線，回歸幾十年前兩國關係開始時的改革開放精神。美國人民別無所求;中國人民理應得到更多。\n\n偉大的中國作家魯迅經常感歎他的國家，他寫道，“對於異族歷來只有兩樣稱呼，一樣是禽獸，一樣是聖上”，但從沒有說“他同我們也一樣”。今天，美國向中國伸出了我們的手。我們希望，北京很快會以行動而不是言詞作為回應，重新尊重美國。但請放心:在我們與中國的關係建立在公平、對等和尊重我們主權的基礎上之前，我們不會讓步。(掌聲)\n\n中國有句古話:“人看眼前，天知未來。”在我們前進的道路上，讓我們以決心和信念追求和平與繁榮的未來。相信特朗普總統的領導力和遠見，以及他與中國國家主席建立起的關係。相信美國人民和中國人民之間的持久友誼。相信上天能看到未來——在上帝的恩典下，美國和中國將共同迎接未來。\n\n謝謝。 上帝保佑你們。 上帝保佑美利堅合眾國。 （掌聲）"
		},
		{
			"post_id": 495,
			"title": "资助老兵维权 创造兵变条件",
			"date_published": 1538643461.59,
			"body": "海军中将馬發祥居然跳楼自杀，实在太过丢人现眼。一个现役的解放军中将，居然会在贪腐分赃的内斗中跳楼自杀，也太他妈的没用了一点。黑帮内部都知道火拼，他妈的一个解放军的中将只会跳楼自杀，真连黑帮都不如。\n\n这些年跳楼自杀的将军也不是一个，这些跳楼的解放军将军，难道你们不知道你们自己虽然是孬种，可是来抓捕你们的也是孬种？你们只要敢把来抓捕的纪委人员抓捕起来枪毙了，还会有人敢来抓捕吗？纪委人员敢到军营来，立刻抓捕还会有人敢来吗？\n\n一个海军中将，难道不会指挥一艘导弹驱逐舰往日本跑？往台湾跑？还能来抓捕你吗？需要跳楼自杀吗？实在太过愚蠢，太过无能。\n\n还没有跳楼自杀的解放军贪腐将军们，不要再跳楼自杀了，那实在太丢脸。你们可以资助老兵维权，把老兵维权搞的轰轰烈烈，为兵变创造条件。你们贪腐那么多钱，一跳楼不是啥都没有了？干嘛不拿点出来资助老兵维权？等着习近平，王歧山了吞并？你们能拿一个亿出来资助老兵维权，早就把共产党的天搅翻了。\n\n这个腐败制度下，哪个当官的不贪腐？推翻这个共产党腐败政权才是你们的出路。"
		},
		{
			"post_id": 494,
			"title": "中共已是穷途末路，跳楼自杀不如拼死一博。",
			"date_published": 1538583879.37,
			"body": "中共军队中的贪腐官员们，中共已经是穷途末路了，全世界都在围剿，跳楼自杀不如拼死一博。\n\n你们虽然都是贪腐大量财富，但是在这个腐败体制中，哪个官员不贪腐？凭什么比你们贪腐更多的习近平，王歧山可以来抓捕你们？你们又何必索手就擒？放手一博吧，置之死地而后生。\n\n在你们还没有被抓，在你们还没有被双规之前，主动积极联系美国CIA，主动联系军中至交，主动联系军中反习势力，积极准备军事政变。\n\n只要你够胆起兵，社会上各反共势力都会响应，绝对不会孤单。全世界都会支持你起兵反习。中共内部的反习势力也会支持你。\n\n推翻习近平独裁暴政，只在于你是否够胆。即便最差的情况，也只是在国际协调下流亡西方，比索手就擒，比跳楼自杀好太多。"
		},
		{
			"post_id": 493,
			"title": "保财保命，主动联系CIA，不要愚蠢到索手就擒。",
			"date_published": 1538488821.721,
			"body": "中共军队中的贪官想保命保财就应该主动联系CIA，请他们协助发动军事政变。这样才能保命保财。只有推翻共产党暴政，你们才可能将功折罪，换取民众的宽恕，还可以保留一部分贪腐得来的财富。\n\n当然你也可以学毛魔头，说早知道中共要完蛋了，我贪腐的钱本来就是准备用于民主革命的。这不是贪腐，是为革命做准备，这样就更有理由获得一部分的报酬了。\n\n像周永康，徐才厚，郭伯雄这样的蠢货，贪了几百亿，几千亿有什么屁用，到头来索手就擒，都是一场空。周永康还被搞的家破人亡。都成为了历史的笑料。\n\n别说自己没这个能耐，难道你们不学无术到了连古代章回小说都没看过？不知道养门客，收谋士这些把戏？只要你有胆，自然会有人来敲门的。\n\n保财保命，要主动联系CIA，不要愚蠢到索手就擒。"
		},
		{
			"post_id": 492,
			"title": "CIA应该主动策动中国兵变",
			"date_published": 1538406257.87,
			"body": "中共大量的官员家属都在美国。当然也包括了中共军队的高级官员的家属。CIA要策动中国兵变其实很容易，直接联系这些官员的家属就可以。\n\n中共内部要反习近平的大有人在，只是他们不敢，怕到时候没有支持。如果CIA能主动联系他们，打消他们的顾虑，那么敢于发动兵变的人就会有很多。\n\n这些人他们有中共内部的联系，也容易与国内各种势力联系，由他们在国内联系各维权群体，发动大规模维权，为兵变创造条件，兵变就会很容易发动。\n\n如果有CIA的直接支持，中国任何省份都可以发动兵变，不受兵变地区是否容易接受外部援助的影响。任何一个省份发动兵变，只要能坚持一个星期以上，就能有其它省份响应。"
		},
		{
			"post_id": 491,
			"title": "薄熙来小丑耳",
			"date_published": 1538134754.164,
			"body": "薄熙来在重庆闹腾的似乎很有气色，还到云南军区去装模作样，表演的好象很有能力，好像真的很厉害，其实薄熙来只是一个小丑，志大才疏，注定会去秦城监狱。\n\n薄熙来如果真有能耐，王立军一出事，他就该动手了，哪里还有去北京索手就擒的事。\n\n薄熙来如果在四川举兵起事，周永康在北京自然就扮演袁世凯的角色，哪里还会有现在习猪头的事。\n\n薄熙来如果在四川起事举兵，西藏的军队不可能前往镇压，否则西藏就造反了；新疆的军队也不可能前往镇压，路太远了，而且新疆也会不保；兰州军区也不可能前往镇压，宁夏也会趁乱起事，宁夏一乱把新疆都分割了；云南的军队也不可能前往镇压，云南军区本来就与薄有瓜葛，而且山路崎岖，容易受阻；最后只有湖北方面的军队能出动，完全就是辛亥革命剧本的重演。\n\n可见薄熙来不过小丑耳。当然周永康，徐才厚，郭伯雄之类也都一样。现在的中国根本连枭雄都没有了，全都是一批小丑。"
		},
		{
			"post_id": 490,
			"title": "把习近平踢下台很容易",
			"date_published": 1538074595.22,
			"body": "中国这种帝制换皇帝其实并不是什么一般人想的那么不可能。中国2000年帝制历史中随便换皇帝发生过太多次了，甚至简单到几个太监就能换皇帝。\n\n太监没读过什么书，受教育程度很低，很小就进皇宫，连社会阅历都没有多少，也根本就不实质掌握什么军队，可是就几个太监就能轻易更换皇帝。\n\n这个是帝制独裁的先天缺陷，没办法解决的。\n\n现在习近平搞帝制独裁，把他踢下台轻而易举。中共党内，军内比太监受教育程度高的人太多了，比一个太监社会阅历多的人也太多了，所以要把习近平踢下台简直易如反掌。\n\n太监能把皇帝踢下台主要是他们没有家室，没有后顾之忧，所以只要他们想干就很容易把皇帝踢下台。\n\n中共内部的反习人士，只要把家属安排到欧美国家，这很容易做到，也就没什么后顾之忧，把习近平这独裁皇帝踢下台太容易了。"
		},
		{
			"post_id": 489,
			"title": "各维权群体要跟着老兵一起上",
			"date_published": 1537874589.375,
			"body": "老兵维权是全国各地都有的，每个省份都有的，不管你在哪个省份都可以跟着老兵一起上。\n\n老兵维权他们的组织能力好，行动力强，而且老兵的诉求根本就不可能解决的，他们只能一直维权下去。所以其它的维权群体就可以跟着他们一起上。\n\n不管是被强拆，还是P2P维权，假疫苗，泛亚，e租宝，等等维权群体，你们要关注老兵维权的动向，注意他们什么时候集体维权，等老兵们集结起来，你们就马上跟进，老兵去省委省政府示威，你们也跟上，也去省委省政府，老兵占领广场，你们也占领广场，老兵们进京，你们也跟上一起进京。\n\n老兵们在政府前集合，你们就在他们附近集合。"
		},
		{
			"post_id": 488,
			"title": "老兵们要把动静弄的更大一点",
			"date_published": 1537788485.539,
			"body": "美国对中共中央军委装备发展部及部长李尚福实施金融制裁，这将激起中共老家伙们对习近平的群起而攻，不分派系。\n\n这些老家伙的孙子辈都在美国，资产也都放在美国，这下都危险了。而这一切都是习近平对美国斗狠造成的，都是习近平的以牙还牙造成的。这些老家伙现在恨不得把习近平生吞了。\n\n但是老家伙们要等一个机会，要有一个机会才能把习近平这家伙踢下台，打入秦城监狱。\n\n这个机会可以由老兵来创造，老兵们要把动静弄的更大一点，动静弄的更大老家伙就会出场，动静弄的更大老家伙就有机会出场，动静弄的更大就会有老家伙在暗中支持你们，你们反而安全。\n\n10月期间是很好的机会，要准备2套以上的方案，或者大规模进京，或者占领各省会城市广场，或者占领几个省会城市的广场，总之现在的动静不够大，还要弄的更大。\n\n那么老兵这样做会不会是被人当枪使？会不会被老家伙们当枪使？我们这样看，以习近平的斗狠策略，你们的上访本来就是一种挑衅，他决不可能退让，你们的诉求根本就不可能得到解决。其实本来就不可能解决。而且在美国的贸易战下，中国的经济会越来越差，你们的诉求就更不可能得到解决。\n\n老家伙们把习近平踢下台，与美国的贸易战可以暂停，得看上来的是什么人，实行什么政策，这决定中国经济是否会崩溃。如果不崩溃，那么你们的诉求可能可以得到少量的解决。你们的诉求要完全解决是没有可能的。\n\n真正每个人都能有尊严地生活，只有推翻共产党的专制。"
		},
		{
			"post_id": 487,
			"title": "你们的艰难探索 我们的悲惨人生",
			"date_published": 1537433894.081,
			"body": "你们的艰难探索，是长春市民的30万白骨；\n你们的艰难探索，是村村见血后200万勤劳耕作地主的惨死；\n你们的艰难探索，是上百万工商业人士的家破人亡；\n你们的艰难探索，是无数青年学子三青团员的屈死；\n你们的艰难探索，是朝鲜战场上的百万炮灰；\n你们的艰难探索，是300万国军抗日将士及国民政府公务员的冤死；\n你们的艰难探索，是百万知识分子的屈辱人生；\n你们的艰难探索，是四川少年右派们的荒冢；\n你们的艰难探索，是大饥荒饿死的4千万饿鬼；\n你们的艰难探索，是文革10年的浩劫；\n你们的艰难探索，是几十万女知情的屈辱；\n你们的艰难探索，是每年5.1,10.1期间的杀人榜；\n你们的艰难探索，是法轮功信徒的活摘器官；\n你们的艰难探索，是我们的悲惨人生！\n\n你们的艰难探索，是睡地主小老婆；\n你们的艰难探索，是长征逃亡路上的辣子鸡丁与茅台酒；\n你们的艰难探索，是南泥湾的鸦片；\n你们的艰难探索，是你们的特供商品；\n你们的艰难探索，是你们的高级干部医院；\n你们的艰难探索，是你们的高干子弟学校；\n你们的艰难探索，是你们的各级特权；\n你们的艰难探索，是你们的奢侈生活！\n\n你们的艰难探索，是习近平家人在澳洲加拿大的幸福生活；\n你们的艰难探索，是王歧山在美国的100多座豪宅；\n你们的艰难探索，是各级共产党官员家里成吨的现金；\n你们的艰难探索，是我们的悲惨人生！"
		},
		{
			"post_id": 486,
			"title": "天下苦共久矣！",
			"date_published": 1537189499.158,
			"body": "中国自古以来农村的土地都是农民私有的。皇家所有的土地是很少的，各地官府拥有的官地也是很少的。中华民国继承了满清皇朝，中华民国政府拥有的土地也是很少的，农村的土地也还是农民拥有。\n\n可是共产党来了，变着花样折腾，现在农村的土地居然都变成了共产党所有，共产党想抢就抢，想夺就夺。\n\n中国自古以来城市的房产都是市民私有的。皇家除了皇宫与几座行宫没有其它的房产。各地的衙门及衙门所有的房产也是极其有限的。\n\n中华民国继承了满清，政府所有的房产也很有限。城市的房产还都是市民所有。\n\n共产党来了，城市的房产居然差不多都变成共产党所有了。经过改革开放，居然所有的房产都变成共产党所有了。你即便花了全世界最高昂的代价买了房子，也只有70年的使用权，房子还是共产党所有。\n\n中国自古以来城市的居民都是有自己的营生，有自己的生意。不是开店铺做买卖，就是有自己的作坊生产，没有人是皇帝养着的。\n\n中华民国建立之后，民国政府大力传播西方先进文化，介绍西方先进社会，鼓励现代工商业发展，全国各地城市出现大量现代工厂，这些工厂基本都是私人资本建立的，都是私人所有。\n\n共产党来了，通过公私合营，结果这些工厂都变成共产党所有了，美其名曰国家所有，实质没有国民的份。连私人的小作坊，小店铺也变成共产党的了，甚至连包租婆的房子也变成共产党的了，城市所有的资产都变成共产党的了。\n\n改革开放之后，这些所谓的国家所有的工厂，店铺又都变成共产党党委书记所有了，变成共产党支部书记所有了，变成共产党员所有了。\n\n部分人在改革开放之后辛辛苦苦地打拼，又拥有了自己的生意，现在共产党又要党建全覆盖，又把手伸过来了。私人律师事务所都已经有共产党的政治委员了，民营企业都有党委了，又要开始公私合营了。你的生意又要变成共产党的资产了。\n\n中国自古以来是有王法的。大明律，大清律都是公开的。中华民国建立之后也是有法律的，六法全书也是公开的。中国自古以来审判是公开的，民众都可以上衙门围观。县太爷审判的好，大家可以称赞一下，县太爷审判的不好，大家可以骂一声。不服审判可以向更大的衙门告状，甚至可以去敲皇帝的登闻鼓。\n\n中国自古以来到衙门击鼓申冤，县太爷是一定要升堂的。你敢敲登闻鼓，那是一定要三堂会审的，甚至皇帝是要亲审的。\n\n共产党来了，完全变得无法无天，审判是秘密进行的。你上法院诉讼，党员法官是可以不受理案件的，不受理的原因是不告诉你的。中共的法律是糊弄人的，中共有内部文件。你不知道这些内部文件是从哪里来的，你也无权知道这些内部文件是些什么，你甚至不知道他们是不是真有什么内部文件。\n\n天下苦共久矣！\n\n你们本来只是山上的土匪，怎么农村的土地都会变成你们的？\n\n你们本来只是山上的土匪，怎么城市的房产都会变成你们的？\n\n你们本来只是山上的土匪，怎么全国的企业，店铺都会变成你们的？\n\n天下苦共久矣！"
		},
		{
			"post_id": 485,
			"title": "你们还能糊弄几个美国总统？",
			"date_published": 1537098547.384,
			"body": "卡特总统真心诚意想帮助中国人选举，这么大年纪，几十年来不辞辛劳到中国农村帮助中国农民进行乡村民主选举。你们从一开始就在糊弄他，你们从一开始就没有真的想进行乡村民主选举。卡特这个美国老头不明白，中国人还会不明白？你们就这么糊弄了他几十年。\n\n克林顿总统真心想帮助中国，想用帮助中国经济发展来推动中国的民主进步。克林顿总统支持中国加入WTO，你们却糊弄他，加入WTO的所有承诺的只是用来糊弄他，根本就没有考虑过真的要落实承诺。\n\n小布什总统反恐，你们表面上支持小布什反恐，其实只是糊弄他。暗地里却勾结巴基斯坦支持恐怖主义，向恐怖组织提供金钱，武器支援。\n\n奥巴马总统要解决朝鲜核问题，你们弄个6方会谈糊弄他。糊弄了他8年，结果连三胖都看不下去，一定要踢开你们，要美朝韩3方会谈，要直接与美国会谈。\n\n现在你们又想糊弄川普总统，不知道这次能糊弄多久？不知道你们到底还想糊弄几个美国总统？"
		},
		{
			"post_id": 484,
			"title": "你敢横空出世 必有英雄来归",
			"date_published": 1536835518.548,
			"body": "中国是世界上爆发民众造反，暴力革命最多的国家，凡是准备举事的豪杰，都不要怀疑是否会获得支持，都不要担心参与的人数太少。只要你敢横空出世，必有英雄来归。\n\n在中国造反，只是首义困难，需要一定的基础。响应就容易的多了，所以一旦你敢首义，响应者很可能立即遍及全国，超出你的想象。\n\n首义不是一般人能做到的，要有一定的人员基础及物质基础。比如太平天国的金田起义，除了有拜上帝会的人员还不够，还得有石达开这样的土豪，拿出家产打造兵器。比如隋唐英雄起义，先得有一个受到地方势力支持的帮派，而且有地方土豪参与其中。\n\n再比如共产党造反，南昌起义，先得有共产国际的支持，有鲍罗廷的领导，有国民党武汉政府的支持，有汪精卫等人的支持。\n\n辛亥革命武昌首义，因为是新军内部的革命党起事，自然具备首义的条件。\n\n从这些起义可以看出，首义需要有一定的人员规模，还得有一定的物质基础，最后还得有一定的政治势力参与其中，也就是有一个政治口号，或者叫政治诉求。\n\n中国目前的局势，具备这3个条件，具备首义条件的势力很多，不是只有1-2个。\n\n首义的口号可左可右，甚至还可以打共产党的旗号。甚至可以是“打倒习王反党集团”，“要求立即召开全国党员代表大会”这样的口号，争取中共老人支持。\n\n当然也可以是要求立即实行民主制度这样的口号，争取西方国家的支持。不过我认为以目前的中国局势，以反对习近平与美国打贸易战，要求罢免习近平这样的口号最好。可以争取最多的支持。可以争取民营企业家的支持，也可以争取股民的支持，股民的数量远超过P2P投资参与的人数。大力宣传习近平为一己私利与美国打贸易战，造成股市暴跌，争取股民参与造反。\n\n总之，只要你敢横空出世，天下英雄必然来归。"
		},
		{
			"post_id": 483,
			"title": "彼可取而代之！",
			"date_published": 1536769653.292,
			"body": "中国的帝制已经延续了2000年，帝制制度中的各种权斗方法已经发展到高度完善，已经没有什么可以创新的地方了。无论是官场的权斗，还是宫廷政变，也无论是底层民众造反还是地方大员举事，各种案例都有，都可以用来参照。\n\n共产党专制，就是改头换面的帝制。共产党专制制度下的各种权斗没有新鲜事，都可以参照2000年帝制中的案例。\n\n习近平这猪头，满脸横肉，言语粗鄙，胸无点墨，志大才疏。周围都是些王崎山，栗战书，这样的痞子，或者王沪宁这样的谄媚小人。习猪头也没有李渊这样的宗亲或者姻亲替他坐镇各地，比中国帝制历史中那些被赶下台的帝王，亡国的帝王还不如。\n\n彼可取而代之！\n\n共产专制与历史上的帝制的区别是共产专制是在现代科技社会中建立的帝制。这个共产专制对社会的控制远超过历史上的帝制。\n\n但是，科技进步从来就不是为专制制度续命的，先进的科技一定是旧制度的终结力量。\n\n很多人认为，以前冷兵器时代容易造反，像中共这样的暴政，在冷兵器时代早就造反了，早就被推翻了。现在的武器先进了，热兵器时代要造反已经很困难了。言下之义是科技进步了，专制政权变得很难推翻了。\n\n其实这是错的，实际的例子并非如此。冷兵器时代最后的一场大规模造反，太平天国造反，席卷了半个中国，最后还是被专制政权镇压下去了。早前的李自成，张献忠，造反规模也非常大，但几次都被镇压下去。最后李自成能攻入北京其实是大明朝边境出了问题，没有边境的危机，李自成应该还是会被镇压下去的。\n\n同治年的“回乱”席卷陕甘，其实还一直延伸到新疆，最后还是被满清镇压下去。当然这时满清当局已经掌握了热兵器，满清当局掌握先进科技，造反的一方不掌握先进科技。\n\n但是，在热兵器时代，先进科技电报电话，新式步枪进入中国以后，辛亥革命，楚望台一个工兵营就能举事，一通电报南方各省就相继独立。这在冷兵器时代是不可想象的。\n\n抗战胜利以后的国共内战，这在冷兵器时代，中共断无成功的可能。抗战之后，国民党政府有几百万军队，中共虽然趁抗战之机在各地发展了几百万军队，但是他们没有像样的武器，唯有东北地区可以获得苏联的援助。中共在东北一地获得苏联大量的武器，人员与财政的援助，对国民党军队形成压倒性的优势，最后才造反成功。\n\n可见，冷兵器时代才可能造反成功的说法没有依据，热兵器时代造反更容易成功。从上面的几个例子可以看出，谁掌握了先进科技才是成功的关键，是否能获得外国的援助才是成功的关键。\n\n就目前的局势看，先进的互联网科技严重冲击了中共的统治。但是反共人士并不掌握最先进的科技，反而是中共掌握的科技比反共人士先进。中共的网络封锁技术可以严密封锁网络的信息，可以通过网络大量传播对中共有利的信息。反共人士却对中共的网络封锁索手无策，只能在海外自娱自乐。\n\n反共人士的智商过低，始终无法掌握先进科技，这才是中共得以苟延残喘的根本原因。\n\n有心取习而代之的豪杰，只需掌握先进的网络技术，用零网突破中共的网络封锁，大量传播反习舆论，争取国外援助，倒习之战实属易事矣！无德无能之辈可取而代之！"
		},
		{
			"post_id": 482,
			"title": "华夏无人 让竖子成名",
			"date_published": 1536667382.761,
			"body": "习近平这竖子能张狂到现在，足证华夏无人。\n\n早在几年前习猪头外访后不敢回国，躲在葡萄牙的一个小岛窥探国内的情况，反习豪杰就应该果断竖起反旗，他哪里还敢回国，哪里还会有他今天的张狂。\n\n乌镇国际互联网大会，这么好的时机，都没人敢动手，白白错过天赐良机。\n\n乌镇这么一个小镇，通往外面的路不过2-3条，只要封锁这几条路，习猪头还能往哪里跑？全部警卫不过4万人员，配备一些轻型坦克及装甲车，这种轻型坦克及装甲车重机枪就能把它打成筛子，更别说反坦克火箭筒。在乌镇这种小镇，无法施展，甚至用汽油瓶都能解决。这4万警卫部队，不可能都在乌镇内，即要保护习猪头，又要阻止起义部队进攻，哪里还顾得过来。只要有几支突击小分队深入小镇，这些警卫部队早就像没头苍蝇一样了，早就自己先打起来了。\n\n杭州G20会议，也是极其好的军事政变机会，先在上海发动民众维权，把周围的军事力量都吸引过去，一举突入杭州，包围国际大型吃喝场所，有再多的警卫部队也没用。\n\n青岛的上合会议，更是容易得手。\n\n用民变支持兵变，以兵变策动民变。可以学学亚美尼亚变天，士兵冲出军营参与民众示威。中国的士兵不可以冲出军营参与老兵维权吗？\n\n如此多的机会都错失。这么多的将官，不是跳楼，就是索手就擒。华夏无人，才让习猪头这竖子成名。"
		},
		{
			"post_id": 481,
			"title": "发动军事政变推翻习近平独裁暴政！",
			"date_published": 1535985144.09,
			"body": "依我判断中共军方针对习近平已经进行过多次行动，而且牵扯的级别还很高，但都失败了。从各种迹象看，行动的时机都有问题，客观上不会成功。\n\n除了行动的时机有问题，行动的动机或者目的也有问题，这才是造成行动失败的根本原因。\n\n军事政变的目的是中共内部权力斗争就不会成功。因为你只能偷偷摸摸在极小的一个范围内获得支持，你根本不可能达到林彪集团的范围，林彪都没有成功，你也就不可能成功。\n\n军事政变只有把目标设定为推翻暴政，建立民主体制才有成功的可能。只有政变目的的正义性，才有政变成功的可能性。\n\n军事政变是有其正义性的，第三波世界民主浪潮就是从葡萄牙的军事政变开始的。\n\n习近平这独裁者不学无术却好大喜功，想充当世界领袖，为世界提供“习近平治国理政思想”，经常在中国召开大型国际会议，这就为军事政变提供了极好的机会。\n\n军事政变不需要太多的人员参与，只需要一个团的兵力就足够了，当然有一个师更好，关键是行动的时机。\n\n发动军事政变的地点以沿海为最佳地点，吴越地区，两广地区，福建，山东，大连，这些都是极好的地区。一旦军事政变中途有意外，便于在国际协助下退出中国大陆。也便于动员参与人员，减少内部出现叛变。\n\n内地当然也可以发动政变，那就看你手上最后能拿到什么。但是比沿海条件差，这不可否认。\n\n军事政变只要达到两种情况，就一定成功。一种是直接抓捕到习近平，一种是军事政变激起民变，获得广大民众的支持。由民众占领广场。从这点看，沿海地区的条件就非常好。\n\n直接抓捕到习近平比较困难，难在准确情报的获得。围困住习近平很容易做到，最容易围困到习近平的时机应该是在大吃大喝的时候。大型国际会议的吃喝排场很大，无法隐藏地点。而且有外国领导人来参与吃喝，不可能偷偷摸摸跑到一个秘密地点吃喝。\n\n这个是发动军事政变最好的时机。记住了！国际大型吃喝场所是发动军事政变最好的时间与地点！\n\n一旦围困住习近平，政变就一定成功！大型国际吃喝场所很难脱逃，除了北京的人民大会堂。而且有大量外国领导人在场，消息立刻可以传遍全球。这就保证了即使政变失败也可以由国际协助离开中国。\n\n政变能导致民变也是政变成功的一种情况，这样即使习近平能侥幸逃脱，也不需要离开中国，可以直接领导民众革命，推翻中共暴政。"
		},
		{
			"post_id": 480,
			"title": "终结共产主义 ——告全党全军全国各族人民书",
			"date_published": 1535383568.786,
			"body": "共产主义幽灵诞生一百七十多年来，传到哪里，哪里就是苦难，斗争，战争，分裂，暴力，恐怖，群体屠杀，贫困，野蛮，饥饿，毁灭。它挟持一股邪恶的旋风，从欧州，到欧亚。从俄罗斯形成实体苏联政权，辐射周边，旋转中国，输出世界。它以反文明反人类反传统的复辟力量，形成强大的逆流，冲击全世界的生活秩序，文化文明，政治经济，道德伦理等等一切。它惊人的破坏力，给全世界给全人类带来的灾难和所犯下的罪恶罄竹难书。对世界自欧州文艺复兴以来，走向开放多元、契约法治、自由平等、民主宪政、人权至上的现代文明，起到了强大的反动和破坏作用。让全世界面临工业文明的冲击而处于风雨飘摇状态下的封建专制独裁体制，苟延残喘，借尸还魂，复辟重生。\n\n共产主义，由苏联输入中国。自五四运动以来，知识分子急于自强求成，在全盘西化的主张下，彻底抛弃中华传统文化，清除民族文化障碍，全盘引进马列思想共产文化。在共产国际的直接领导下，建立中国共产党，建立苏维埃伪共和国。借中华民族国民革命之际，混入国民革命队伍，破坏了以三民主义为理论基础的国民革命。以伪民主乌托邦的形式，建立了以马列主义为理论基础的共产革命。借助日本帝国主义侵略中国，中华民族危亡之时，阴谋壮大。又在国民政府抗战之后，精疲力尽之际，以逸待劳挑起内战。并在苏联共产国际政治经济军事的全力支持下，打断了中华民族走向现代文明的正常道路，颠覆了中华民国，复辟了封建专制独裁，变本加厉地建立了政教合一的马列极权体制。\n\n马列西来，幽灵乱华，暴力窃国，谎言施政。数典忘祖，政教合一，结党祸国，暴政害民。先是鼓动农村没有文化的地痞流氓，打士绅分田地。后又利用马列思想之阶级斗争，暴力革命，无产阶级专政，公有制，唯物主义，发起各种运动。毁我华夏文化，乱我道德人心，杀我民族精英，颠覆民权民国。挖我先贤祖坟，烧我文物古迹，断我文脉根基，夺我资源财富。污我山川河流，败我江山社稷。以马列党文化，强迫我中华各族接受，传承共产主义，毁我道统法统，洗脑人民，将炎黄子孙，沦落为马列奴才。将礼仪之邦变为禽兽之域。\n\n共产主义横行中国，象一架巨大的绞肉机，造成了包括许多共产党人在内的上亿中国人民死于非命，血债累累，罪恶昭昭。 时至今日，世界共产主义已经没落，唯中共借经济改革，垄断政治经济，掠夺我中国人民创造的巨大财富，形成权贵新阶级，巩固了其统治基础。他们以国库为党库，以权力为盗具，将中华民族创造的巨大财富，据为己有，转移国外。对外撒币万亿，损主权以稳政权，对内横征暴敛，用政权剥夺人权。与民争利，锱铢必较，苛捐杂税，敲骨吸髓。山河污染，资源败空，土地荒废，人心沦亡。贪污腐败，亘古未有，腐蚀输出，举世震惊。国尚在而山河破，民尚存而文化亡。\n\n中共开启改革开放，从以阶级斗争为纲，转向以经济建设为中心。从坚持一穷二白的社会主义，到不管白猫黑猫抓住老鼠就是好猫的实用主义。从最高领袖终身独裁，到常委会集体领导任期制。在经历89-64短暂的倒退之后，重新加大改革开放力度。从理论创新地提出了三个代表，吸收民营资产者进入党内，将中国共产党扩展为全民党。到提出科学发展观，建设和谐社会的理论。将基于马克思主义意识形态唯一的理论基础，转向中国传统文化为基础的思想意识。以淡化共产主义意识形态，回归中华民族传统文化，前进的脚步虽然一波三折，困难重重，却也是在改变。中共十八大后中央高层重提坚持共产主义不动摇，重提所谓共产主义理想。共产主义幽灵又在中华大地上倒行逆施，文革的阴影重新笼罩中华大地。中共十九大，推出所谓新时期特色社会主义思想理论，文革之雷平地炸起，个人崇拜死灰复燃，不忘初心的原教旨毛泽东思想借尸还魂，复辟阴云笼罩中华大地。全然不顾民主自由宪政的历史潮流，不反思共产主义所带来的灾难，驾驶历史倒车逆流而行。\n\n中国传统的政治文化，是以伦理道德建设为基础而形成的文化中轴政治文化，通过伦理道德知识的潜移默化深入人心，从而为人的行为，价值标准产生人文情怀和心理准则，对人类行为转化为社会行为奠定了道德基础和人文基础，具有相当的仁爱性、稳定性和安全性。现代西方的政治文化，是以普世价值建设为基础而形成的制度中轴政治文化。自由、博爱、民主、平等、契约、人权等通过法治的强化而深入人心，从而为人类社会文明生产出硬性的文明准则和价值体系。马列主义是一种缺乏安全感和广泛稳定性的文化，是一种动荡冲突的斗争文化。它的暴力革命，公有制，阶级斗争，无产阶级专政，唯物主义等思想价值理论，具有强烈的破坏性、排他性和反人类性。马列主义文化中，不具备建立稳定的社会架构的基础性理论，没有那种为万世开太平的基因存在，更没有奠定人类文明结构的基因。它的体系理论基础，是建立在暴力，谎言，乌托邦的基础上。马列主义与文化中轴的政治文化和制度中轴的政治文化都不相容。这就是为什么中国社会从毛时代到邓时代，江时代到胡时代，一直到现在所谓的新时代社会主义，都没有形成系统的稳定的政治结构和社会结构的思想理论原因所在。中国未来的走向，必须抛弃马克思列宁主义，在回归伦理道德的文化中轴政治文化的基础上，向普世价值的制度中轴政治文化转型。否则，中国社会永远都会在动荡的漩涡中打转。\n\n同胞们，历史不容倒退，复辟不得人心，中华民族不能永远脱离世界文明。近百年来的共产主义实践和历史事实告诉我们，共产主义理论基础和意识形态，是中国社会一切乱象的根本，是中国人民苦难的源头，是中华民族伟大复兴和中华文化现代化的障碍。坚持共产主义就是逆世界潮流而行，就是自绝于人类文明。共产主义不只是在全世界破产，在中国人民心中也早已破产。在九千万党员中，真正相信共产主义的党员，已经基本上没有。加入共产党，不是基于信仰和价值取向，而是基于现实的利益诉求。共产主义已死，共产主义现实和历史必须终结。全体中国共产党员也不必为共产主义陪葬，应该彻底抛弃共产主义，改旗易帜，弃暗投明，重组转换成其他名称的政党。全党全军全国各族人民，世界潮流浩浩荡荡，顺之则昌，逆之则亡。我们都是炎黄子孙，我们拥有优秀的本民族文化，自三皇五帝，尧舜禹汤，文武周公，老子孔子孟子以降自成道统法统。屹立世界五千年而不倒，创造过灿烂辉煌的物质文明和精神文明。中国传统文化现代化进程，早在辛亥革命就已经开启，三民主义上承中华道统，外接世界文明，中西合璧，融为一体，通过国民革命，曾经在中华大地上开出过灿烂的自由之花，已经在台湾结出了丰硕的民主宪政之果。\n\n同胞们：三千年未有之大变已经开启，我们中国共产党人，在伟大的民族变革中，选择了错误的道路，给国家民族带来了深重的灾难，放下屠刀立地成佛，我们应该反思和忏悔。该是我们拿出勇气面对现实，重新选择的时候了。今天，我们在此呼吁，全党全军全国各族人民团结起来，解体极权专制，解散共产党组织，终结罪恶的共产主义意识形态和政权。回归民族民权民国，再造民主共和，为建设一个民主自由宪政的新中国而努力奋斗！\n\n一批曾在中共体制内工作的党政官员\n2018年8月27日"
		},
		{
			"post_id": 479,
			"title": "川普內閣發布歷史性宣言 吁信仰自由作為各國要務 提出全球具體方案",
			"date_published": 1532882833.607,
			"body": "周四（7月26日），美國國務卿蓬佩奧代表國務院發布了**《波托馬克宣言》**（Potomac Declaration）和**“波托馬克行動計劃”**（Potomac Plan of Action），敦促世界各國政府把宗教自由作為優先政策。這是川普（特朗普）政府推動宗教自由的進一步舉措，被外界評為“歷史性”文件。\n\n**具有歷史意義的文件**\n\n7月26日，美國國務院舉辦的“推進宗教自由的首屆全球部長級會議”在華盛頓舉行，包括來自世界各地的數十名部長級代表在內的八十多個代表團與會。\n\n這次會議的重要成果是《波托馬克宣言》和“波托馬克行動計劃”。《波托馬克宣言》中說道：“宗教自由是一項意義深遠、普遍而深刻的人權，所有善良的人民和國家都必須在全球範圍內進行維護。”\n\n“在現代歷史上，沒有任何一個國家發布的任何文件，能夠如此全面和切實地針對當前全球的宗教自由現狀。”“這是真正具有歷史意義的（文件）。”與會的宗教自由倡導者摩爾（Johnnie Moore）說。\n\n**呼籲各國政府把維護信仰自由作為首要任務**\n\n自去年上任以來，川普就非常強調宗教自由。蓬佩奧說，川普總統承諾將宗教自由作為本屆政府外交政策的“優先任務”，《波托馬克宣言》和“波托馬克行動計劃”證實了這一點。\n\n“《波托馬克宣言》是一個正式的肯定，首先說明美國嚴肅對待宗教自由問題，我們將與世界各地的人一起，幫助那些因為信仰受到攻擊的人。我們希望世界各地的領導人也要維護宗教信仰，成為他們的首要任務。”蓬佩奧說。\n\n今年10月，美國國務院將舉辦為期三天的一個名為Boldline的研討會，以支持和擴大創新的公私夥伴關係，促進和捍衛世界各地的宗教自由。\n\n**“是時候來直接對付”宗教迫害了**\n\n在《波托馬克宣言》中，美國政府強調，全球近80%的人受到嚴重的（信仰）限制；太多人因為宗教、信仰或不信仰而受到迫害、鎮壓和歧視，現在是時候直接來對付這些挑戰了。\n\n蓬佩奧表示，這次會議的成果“真的令人難以置信”，並補充道，“我們所做的工作具有永恆的意義。”\n\n**這些文件要求：**\n\n    人們有權改變自己的信仰、改信新宗教；\n\n    宗教社區有權進行印刷、進口和發傳單等活動；\n\n    不應以國家安全為幌子壓制宗教言論；\n\n    國家無權挑選和選擇在本國可以信仰哪些宗教；\n\n    應廢除《褻瀆法》［註：《褻瀆法》（blasphemy law）是伊斯蘭教中的規定，侮辱穆罕默德的人可處以死刑，毀損《可蘭經》要坐牢等］；\n\n    各國不能要求人們登記其宗教信仰。\n\n**“波托馬克行動計劃”提出全球具體方案**\n\n“波托馬克行動計劃”提出很多具體辦法，幫助國際社會和各國政府更好地保護宗教自由。\n\n美國國務院設立了一個新的國際宗教自由基金，這是一個與其它國家共同設立的基金，用來支持宗教自由維護者的工作，並協助受害者。\n\n國務院還創建了一個名為“國際訪客領導計劃”，這個為期十天的項目將幫助那些在宗教自由前線工作的人來到美國。該項目側重於促進宗教多元化和保護宗教少數群體的權利。\n\n美國政府還準備發起“恢複種族滅絕罪和迫害反應”倡議，這將有助於受迫害的團體。\n\n“雖然我們首先關注的是我們對伊斯蘭國（IS）在伊拉克實施的種族滅絕，但我們希望這個計劃能夠幫助許多不同地方的受害者。”蓬佩奧說。\n\n國務院還發布了一些聲明，譴責對宗教不容忍或迫害的國家，包括緬甸、中國（中共）和伊朗。在有關中國部分，聲明說：“我們對中國（中共）對宗教自由的箝制深感關切，我們呼籲中國政府尊重所有人的人權。”“包括維吾爾族、回族和哈薩克穆斯林、藏傳佛教徒、天主教徒、新教徒、法輪功，由於他們的信仰面臨嚴重的鎮壓和歧視。”\n\n**《波托馬克宣言》前言部分的翻譯：**\n\n《世界人權宣言》第18條宣稱：“人人有思想、良心和宗教自由的權利；此項權利包括改變他的宗教或信仰的自由，以及單獨或集體、公開或秘密地以教義、實踐、禮拜和戒律表示他的宗教或信仰的自由。”\n\n享有信仰自由是神賦予每個人的人權。尋求神並付諸實踐的自由——包括個人按照良心做事的自由，是人類至關重要的經歷。\n\n政府不能理所應當地把它（這項權利）拿走。相反，每個國家都有捍衛和保護宗教自由的莊嚴責任。\n\n今天，我們跟70年前《世界人權宣言》所宣稱的理想——“人人享有思想、良心和宗教自由的權利”相去甚遠。這項權利在全世界受到攻擊。據報導，全球近80%的人受到嚴重的（信仰）限制。對許多人來說，因為宗教、信仰或不信仰而受到迫害、鎮壓和歧視是當前現實。現在是時候直接來對付這些挑戰了。\n\n捍衛宗教或信仰自由是​​全球的集體責任，宗教自由對於實現國家內部和國家之間的和平與穩定至關重要。在保護宗教自由的地方，其它自由如言論自由、結社自由和集會自由也會得到充分保護。對宗教自由的保護直接有助於實現政治自由、經濟發展和法治。沒有宗教自由的地方，就會有衝突、不穩定和恐怖主義。\n\n當宗教自由蓬勃發展時，我們的世界也變得更美好。在整個人類歷史中，個人和團體的宗教信仰與表達，對於社會的繁榮至關重要。有信仰的人在我們社區中發揮著寶貴的作用。信仰和良心激勵人們促進和平、更近寬容和正義、幫助窮人、照顧病人、慰藉孤獨、參與公開辯論，並為他們的國家服務。\n\n宗教自由是一項意義深遠、普遍而深刻的人權，所有善良的人民和國家都必須在全球範圍內進行維護。\n\n【阿波羅新聞網 2018-07-28 訊】"
		},
		{
			"post_id": 478,
			"title": "给全国维权老兵的建议",
			"date_published": 1531418197.297,
			"body": "老兵们现在这样维权力量太分散，效果不好。因为临时动员全省各地的老兵集中，能来的人数肯定不会太多。这样对当局的压力不够，中共根本就不会理睬你们的。\n\n我建议你们每个月的第一个星期日，第三个星期日，全国老兵到自己所在的省会城市集中维权，一个月两次，风雨无阻。集中维权一天，当天解散。天晴维权集会时间维持2-3小时，不要太长，方便路远的老兵来回。雨天集会时间维持1小时多些。\n\n这样将集中维权的日子固定下来，便于大家安排时间，这样可以集中比较多的人数，可以形成比较大的力量。\n\n每次集中维权日统计人数，并形成相对比较固定的领头人物，维权核心人物。全国各省都要统计到场人数。各省的维权核心人物要互相通报参加人数，以便掌握维权进程。\n\n等统计人数稳定达到10万，也就是平均每个省都要达到3300人以上的参与，可以考虑每月一次全国老兵进北京维权。\n\n参与维权人数能集中10万，中共就不得不面对你们的诉求了。\n\n另外我还建议老兵维权的口号，也就是诉求，也要改动一下。老兵维权的第一口号应该是：要尊严！要人权！\n\n其它的口号都是次要的。合理的诉求没有人理会，这个首先体现的是你们没有尊严！没有人权！"
		},
		{
			"post_id": 477,
			"title": "川普精准击碎习近平的“发财梦”",
			"date_published": 1530113656.173,
			"body": "美中贸易战，美国敢打，有实力打，但是川普不想打。习近平想打，非常想打，但是没有本钱打。\n\n美国不想打是很明确的，除了川普再三声明之外，美国的2000亿，或者4000亿关税都是在500亿的关税遭到中共报复以后才会实行的。如果中共没有报复，其实只有500亿，而且还没有实施。而中国的关税早在美国刚一公布要增加500亿商品的关税时就已经增加了对美国农产品的关税。\n\n习近平干嘛找死啊？我想这是很多人困惑的。\n\n川普计划增加关税的500亿输美商品据说是针对中国的2025计划的。但是，中国的2025计划还只是一个计划，并不是商品，当然还没有办法出口美国。美国当然还无法向2025计划增加关税。\n\n这500亿美元的商品都是现在已经出口美国的商品，所以才能增加关税。\n\n据说这500亿商品都是高科技产品。我们都知道，中国输美的产品根本就没有高科技产品，充其量不过是一些与高科技有些关系的产品。\n\n不过就是一些比服装，鞋子等多点技术含量的商品嘛，那习近平的反应为什么如此激烈？\n\n我们看一下中国的经济结构就明白了。\n\n中国的经济是由中共权贵几个家族控制的：\n\n江家控制着电讯；李家控制着电力，煤炭；朱家陈云家及王歧山家族控制着金融；邓家以前通过五矿控制着有色金属；王震家族控制着军工；周永康的石油帮以前控制着石油。现在周永康倒了，石油不知道哪家权贵控制着。\n\n习近平看上去权势熏天，其实他的权势比不上上面这些家族，财政实力也远遜上面这些家族。习近平家族虽然也是一个巨贪家族，可是习家族没有控制一个很大的垄断性行业。他也想通过权势获得这样的一个超级垄断性的行业。\n\n本来习近平与王歧山联手，通过所谓的反腐败，斗垮了所有的政敌，大权在握，党内已经没有人敢对抗他了。他已经可以通过他掌握的权力来聚集大量的财富了。结果被川普精准打击，击碎了习近平的发财美梦，所以他才会表现的难以致信的激烈。\n\n习近平的发财美梦是先弄一个2025计划，以国家发展的名义，集全国的财力，支持他妹夫吉利汽车的老总李书福发展新能源汽车，发展电动汽车。类似王歧山发展海航集团。\n\n这个计划本来实施的很成功，在中国当局大力收紧中国公司海外并购政策之际逆势而上，从国有公司得到92亿美元的融资，投资德国著名汽车制造厂商戴姆勒集团，成为其最大股东之一。\n\n习近平的这个计划对美国及欧洲的新能源汽车，电动汽车行业有直接的，非常危险的打击。习近平以倾全国之力打击西方的汽车行业，美国，欧洲的汽车制造商当然不是对手。\n\n没想到川普的增加关税直接打击了习近平的这个计划，直接击碎了习近平的“中国梦”，直接击碎了习近平家族的发财梦。\n\n了解这些就完全明白为什么习近平会对川普的500亿美元的关税反应如此激烈了。\n\n所以，习近平是非常想打这贸易战的，他想打掉这500亿美元关税，这500亿美元商品的关税是他家族发财的障碍。\n\n当然，他这一狂妄举动对美国没有任何影响，也不可能阻止川普对500亿美元商品增加关税。可是，他这一狂妄举动却害苦了中国民众，害苦了中国股市的投资人。他这疯狂举动造成了中国股市的大幅度下跌，不计其数的股民遭到了惨重的损失。\n\n习近平这狂妄，贪婪之徒，还中国股民的血汗钱！"
		},
		{
			"post_id": 476,
			"title": "对镇江老兵维权失败的经验总结：",
			"date_published": 1530037744.83,
			"body": "1,以后的维权要提高集结速度，在中共还没有从外面调集武警时，人员集结就要达到一万左右。\n\n这次老兵集结的速度不够快。慢了一天，如果快一天，效果会更好。如果提早一天达到23日的人数，那么，22日晚中共就不敢出动清场。\n\n2,一旦发现中共从外面调集维稳力量，立即动员全国老兵向周围城市集结。一方面，原来的集结地有一万左右的人员集结，就不是很容易清场的。其次，全国老兵向周围城市集结，中共就很难继续向集结地集中维稳力量。\n\n比如这次老兵在镇江集结了大量人员，发现中共从外地调集维稳力量就动员全国老兵向南京，常州，扬州集结，这样江苏就没有这么多的维稳力量了，必须从外省调集维稳力量了。这样就无法在镇江清场了。\n\n![1.jpg (0x0)](data/img/post_476_1.jpg)\n\n3,要及时控制高速公路出入口，至少要控制一个出入口。高速公路的出入口警察人数并不多，才10几个，维权老兵可以很容易控制他们。\n\n以后老兵集结应该在人数达到上万以后就分出一部分力量迅速控制高速公路出入口，至少要控制一个出入口。将高速公路出入口的警察包围起来。这样增援的老兵就能够源源不断地进入示威区域。\n\n这次失败的主要原因之一是没有控制高速公路出入口，导致前来增援的老兵无法进入镇江。\n\n4,老兵中至少要有一部分能掌握使用【零网】ZeroNet，这个人数应该至少要在一万左右。这一点是最最重要的。\n\n信息不能及时传递是维权失败最主要的原因。这是从中共严厉控制网络就能知道的常识。\n\n【零网】是目前唯一的一个中共无法封锁，又方便使用的网络工具。各地领头的老兵一定要会使用。\n\n零网的功能非常强大，只是界面的设计还跟不上。但是所有的信息都能无障碍传输。\n\n使用零网其实非常方便，只要下载一个客户端就可以了。如果不发贴，只观看，什么都不用做，就安装一个客户端。如果需要发布信息，那就要注册一个ID，零网的ID不需要绑定任何其它个人信息的，不需要手机号码，不需要电邮邮箱。所以这个零网ID你要保存好，弄丢了就无法找回来了。\n\n领头的老兵可以自己在零网上做一个群，也可以做一个博客网站。当然自己不会做也可以在零网的很多论坛，聊天室发信息。\n\n零网的ZeroUp，KopyKate Big都是可以上传大文件的，很长的视频都可以发布，ZeroUp还可以上传压缩文件。\n\n这次镇江老兵维权虽然失败了，但是也展示了老兵维权的气势，对中共政权的打击是非常成功的，非常有力。"
		},
		{
			"post_id": 475,
			"title": "向兴华会的勇士致敬！向兴华会的勇士学习！",
			"date_published": 1529158690.146,
			"body": "非常高兴看到江西【兴华会】的勇士向中共暴政发出挑战，大家都看到你们在江西各地的标语，口号了。非常鼓舞人心。\n\n![8.jpg (0x0)](data/img/post_475_8.jpg)\n\n你们是时代的英雄，你们是站在反共最前沿的勇士！\n\n![9.jpg (0x0)](data/img/post_475_9.jpg)\n\n你们的行为极大地鼓励了民众，你们张贴的标语，口号非常有利于民众克服恐惧心理。\n\n向【兴华会】的勇士致敬！向【兴华会】的勇士学习！\n\n不过我建议你们先推广零网（zeronet）。今天的民主革命，是新科技战胜旧制度的革命。新的革命需要我们充分利用先进的科学技术，用先进的科学技术来战胜中共这垂死的政权。\n\n零网是基于网络技术中的一种新技术，区块链技术的一个应用软件，它能完全突破中共的网络封锁，中共不但无法封锁，也无法删除零网上的帖子，无法关闭零网上的网站。而且这种技术正在蓬勃发展，有不少相似的软件，比如星际网络也是基于这种技术的一个应用。不过就目前而言，零网在使用上最方便，只要安装一个客户端就可以了，任何人都会使用。\n\n推广零网风险比较小，中共难以发现。而且推广零网也比在外面刷口号，标语来得方便。大部分人只是不知道有这么一种APP，只要告诉他们一下就可以了。有些人可能不知道到哪里去下载这个客户端，也只要告诉他们一下就可以了。可是效果在某种程度上比在外面刷口号，标语要好。因为零网上资料非常多，有新闻，有图片，有文章，有视频，有电子书，等等。\n\n当然网络最终不能代替现实中的抗争，但是如果我们不能在网络舆论上占据优势，现实中的抗争很容易失败，709律师及公民运动的失败都是应该汲取的教训。\n\n只有当我们在网络上获得压倒中共的优势以后，我们在现实中的抗争才不会轻易被中共镇压下去。\n\n我建议你们【兴华会】的勇士，先行推广零网，大力地推广零网。【兴华会】的勇士都要成为零网的一个节点。最好是有用机顶盒或者树莓派做的节点，可以低成本24小时运行（目前机顶盒的APK版本还没有更新，可能会找不到节点，要看当地的网络环境）。当然也应该有电脑做的节点。\n\n期望【兴华会】的勇士取得更大的成功，早日将零网推广到江西各地。\n\n向兴华会的勇士致敬！向兴华会的勇士学习！"
		},
		{
			"post_id": 474,
			"title": "董存瑞故事证明中国人善于编造谎言",
			"date_published": 1527344593.096,
			"body": "董存瑞故事证明中国人善于编造谎言，而且毫无逻辑。如此胡编乱造的谎言都有人信，足以证明中国人智力低下。\n\n董存瑞故事说的是河北隆化县隆化初级中学东北角外侧有一条二三十米宽的干河沟，横跨旱河的一座桥上有一个“桥形碉堡”，桥离地一米多高，两旁是光滑的墙壁，是砖石砌的，没沟、没棱，顶上是平平的泥板，哪儿也没有安放炸药包的地方。狡猾的敌人，在桥上修了一个伪装得十分巧妙的暗堡，拦住了我军冲锋的道路。桥型堡上有6个暗藏的机枪在扫射。董存瑞左手托起炸药包，紧紧贴住桥型碉堡，右手猛地一下拉开了导火索，把这座桥型暗堡炸掉了。\n\n这种谎言编的实在离谱。\n\n按这谎言所描绘，这旱河有二三十米宽，深超过一人高，董存瑞需要把手举起来才够到桥的高度。也就是这旱河有近2米深。\n\n从网上搜索到的图片看，河北隆化县的地形是这样的。这是农村地区，县城的地形也应该是平坦的，并且远离山区。这样的地形会有深2米，宽20-30米的旱河吗？连农村地区都不会有这样的旱河，县城更不会有。编造谎言的人完全没有基本的地理常识。\n\n![1.jpg (0x0)](data/img/post_474_1.jpg)\n\n这样的地形会有深2米，宽20-30米的旱河吗？\n\n在河北隆化县，这样的一座20-30米长，高出河床2米的桥，很远就能看清楚，几里路外就能看到，桥上有一只狗都能看见。这样的桥上能建一个暗堡吗？暗藏到哪里去？在这20-30米长，高出河床2米的桥上能建一个伪装得十分巧妙的暗堡吗？\n\n![2.jpg (0x0)](data/img/post_474_2.jpg)\n\n你如何把这样一座暗堡暗藏到一座木桥上？\n\n![3.jpg (0x0)](data/img/post_474_3.jpg)\n\n你如何把这样一座暗堡暗藏到一座木桥上？\n\n董存瑞谎言接着描述：桥离地一米多高，两旁是光滑的墙壁，是砖石砌的。\n\n河北隆化县这个盛产骗子的地方，在1947年，连人住的都是土坯房，一条旱河的河岸会是砖石砌的吗？\n\n按董存瑞谎言所描绘，这旱河有二三十米宽。旱河上有一座木桥，这木桥没有桥墩，没有桥柱，是单跨度木桥。\n\n![4.jpg (0x0)](data/img/post_474_4.jpg)\n\n骗子们说这是一座20-30米跨度的木桥\n\n河北隆化县这个盛产骗子的地方有20-30米长，足够粗的木料来建这样一座单跨度的木桥吗？河北隆化县这个盛产骗子的地方的树是长这样的。这样的树木能建20-30米单跨度的木桥吗？\n\n![5.jpg (0x0)](data/img/post_474_5.jpg)\n\n河北隆化县这个盛产骗子的地方的树是长这样的\n\n![6.jpg (0x0)](data/img/post_474_6.jpg)\n\n河北隆化县这个盛产骗子的地方的树是长这样的\n\n董存瑞谎言接着描述：顶上是平平的泥板，哪儿也没有安放炸药包的地方。\n\n木桥桥面下为什么要安装平平的泥板？这平平的泥板又是怎么安装到桥面下的？\n\n![7.jpg (0x0)](data/img/post_474_7.jpg)\n\n这平平的泥板又是怎么安装到桥面下的？\n\n董存瑞谎言是一个多人参与编造的谎言。董存瑞谎言证明河北隆化县是个盛产骗子的地方。吴越人士要尽量避免去那种地方，不要去那种地方旅游，不要去那种地方经商。对于那种地方的贫困现象不要有廉价的同情，你怎么知道不是另外一个骗局呢？\n\n如此荒唐拙劣的谎言都有这么多人信，足以证明中国人的智力极其低下。大量的人群还传播，维护这样拙劣的谎言，足见中国人不但智力低下，而且品行恶劣。\n\n与这种智力低下，品行恶劣的人群生活在一起是没有前途的。吴越独立建国才有光明的前途。"
		},
		{
			"post_id": 473,
			"title": "美国需要扶植中国的自由资本",
			"date_published": 1527001724.579,
			"body": "美国在这次贸易对话中需要扶植中国的自由资本，不然这个贸易对话将是失败的。\n\n关于一个国家的经济发展了，中产阶级增加了，是否会带来社会的民主这种讨论已经很久了。其实一个国家的经济发展了，中产阶级增加了，是一定会带来民主的。这是在世界民主发展历史上经得起检验的。\n\n但是，有人提出，为什么中国的经济发展了，中产阶级增加了，却没有给中国社会带来民主？这是因为对中产阶级的定义没有弄清楚。\n\n---\n\n中产阶级，是指拥有一定的资产，拥有投票权的一批人。因为早期的西方民主制度并不是普选制度，拥有投票权的人是要具有一定的资产的。\n\n在中国，拥有一定资产，有一定的经济基础的人士并不具有投票权。所以，在中国并不存在所谓的中产阶级。中国的经济发展了并没有随着经济的发展而培育出一批中产阶级，只是改变了一部分奴才的待遇。\n\n这样的经济发展当然也就不会带来社会的民主。同样的情况也在越南发生。可以预期，越南经济的发展也不会带来越南社会的民主。\n\n造成中国这种经济发展了，却不能产生中产阶级这种现象的原因主要在西方资本。\n\n西方资本进入中国以后没有培育中国的自由资本。西方的资本进入中国以后都是与国家政权交往，都是与中共权贵来往。经济活动都在专制政权的控制之下，结果造成经济发展了，专制政权反而更强了，更专制了。\n\n如果80年代早期，美国贝尔公司进入中国以后，将一部分的零配件向私人企业采购，美国的通用汽车，德国的大众汽车进入中国以后，将一部分的零配件向私人资本采购，这样就会培育出大量的自由资本，就能在中国培育出中产阶级。中国的社会就会与现在不同，专制政权就不会像现在这样被加强了。\n\n这次美中贸易对话，必须把重点放到中国的自由资本的培育上。\n\n中共承诺大量增加美国农产品的进口。这些进口必须有中国私人资本的参与，不能都由政府采购。最好是美国在中国的贸易公司进口，在中国寻找代理人，将美国农产品的分销放给中国私人资本。\n\n中共承诺能源产品将在3-5年内达到500-600亿美元。这个贸易量是非常大的，可以在中国培育大量的自由资本。\n\n美国资本必须将其中的一部分交由中国的私人资本来完成。特别是其中的汽油产品，要分销给中国的私人资本。由中国的私人资本在各地建立加油站，打破中共国有企业的垄断地位。\n\n当然培育中国的自由资本也不能没有美国银行资本的参与。\n\n但是，中国是一个完全没有法制的国家，不但私有财产没有任何保障，根本就连法律诉讼都无法在法院立案。没有司法保障，也不可能在中国培育私人自由资本。\n\n100年前，美国保障中国基督徒的信仰权利，100年后依然需要美国保障中国人的法律权利。\n\n服务贸易的谈判需要关注美国律师事务所在中国的经营。美国的律师事务所应该大量进入中国，美国进入中国的律师事务所应该有中国的合伙人。尤其是中国的人权律师，是美国律师事务所的优先合伙人。\n\n美国进入中国的律师事务所的业务应该覆盖中国的民事诉讼，及行政诉讼。特别需要覆盖中国民众的产权诉讼。\n\n没有美国律师事务所的介入，这种产权诉讼案件在中国根本就无法立案。\n\n中国民众与中共政权的产权诉讼非常之多，是一个非常大的市场，涉及的金额在万亿以上。美国的服务贸易不应该放弃这样的市场。\n\n美中贸易谈判的细节谈判必须解决这些问题，而不是谈判中共政权的政府采购。因为按照WTO的规则，政府采购是应该公开招标的。"
		},
		{
			"post_id": 472,
			"title": "积极做好准备，迎接这3000年未见的大变局的到来。",
			"date_published": 1524841675.224,
			"body": "朝鲜的核试验场崩塌了，应该暂时没有其它试验场可取代。在几年内金三应该不得不暂停核试验。这样判断，金三与川普的谈判应该有成功的可能，即使他只是缓兵之计。\n\n越南是完全复制中国所谓的改革开放的过程。本质不会变，依然是共产专制。但是还在“韬光养晦”阶段，几年内不可能跳出来挑战民主制度，不可能公开跳出来挑战周边国家，这样会导致内乱，引爆革命。\n\n叙利亚美国没有直接推翻阿萨德的意愿。库尔德的势力很强，只需获得西方的支持，阿萨德不可能战胜库尔德武装。所以，叙利亚应该暂时还会维持僵局。\n\n这样，这3个中共的爪牙应该暂时都不会有大的变化。\n\n依此判断，美国的目标是非常清楚的，直接捣毁中共这个专制堡垒。\n\n我判断有2个不同的方式，一个是迫使中共落实改革开放的承诺。这以言论自由，开放互联网；落实法制，释放政治犯；开放市场，减少国有企业为观察标准。可是这3项都是与习近平这几年在推动的相对立的。谈判非常困难，不太有成功的可能。\n\n另外一个是直接肢解中国。先让台湾独立，然后西藏，新疆，内蒙古。观察标准一是台湾，更重要的观察标准我感到是维吾尔武装。\n\n这2个方式可能会交替进行。\n\n我认为直接肢解比较好，中国内部各地独立的声音已经不小了，条件已经具备了。外部也可以获得中国周边国家的支持，美国的压力比较小，甚至可能获得俄罗斯的支持。\n\n各路反共势力，蒙藏维及各地主张独立人士应该积极做好准备，迎接这3000年未见的大变局的到来。即不盲目行动，也不消极等待。吴越人士请积极推广零网。"
		},
		{
			"post_id": 471,
			"title": "这段话说于2500年前",
			"date_published": 1524759051.764,
			"body": "![1.jpg (0x0)](data/img/post_471_1.jpg)\n\n“我们无须羡慕任何其他国家的政体。我们的政体不是模仿他国得来的。我们的制度要成为别人的模范。我们的政体之所以称为民主政体，是因为政权在多数公民手中，而不是少数人手中。\n\n在这一政体下，每个人在法律上都是平等的，担负公职的人能够得到的荣誉，不是因其出身，而在于他的努力和贡献。\n\n任何人，只要他能对国家有所贡献，绝对不会因贫困而默默无闻。\n\n我们的日常生活和政治生活一样，享有充分的自由。市民享有的自由程度之高，甚至连怀疑、妒忌都是自由的。\n\n尽管如此，我们可以享受各种娱乐，丰富我们的精神世界，忘却日间劳作的辛苦。\n\n我们用每个人所具备的能力，即决断力，来应对考验。我们的勇气不是产生于法律的要求，而是源于每个市民在日常生活中各自的行为准则。\n\n我们爱美，但我们有度，我们尊重智慧，但绝不迷恋于此，我们追求财富，但我们只会尽可能地利用它，而不以此炫耀。在雅典，贫穷不可耻，可耻的是不为脱离贫穷而努力。\n\n我们尊重个人利益，却是为了更加关心公共利益。这是因为在追求个人利益为目的的事业中表现出的能力，同样可以服务于公共事业。\n\n在雅典，一个不关心政治的人，我们不会认为他爱好和平，我们认为他不具有市民的资格。”\n\n——古希腊雅典执政官伯里克利，2500年前。"
		},
		{
			"post_id": 470,
			"title": "《中蘇友好同盟特別協定》",
			"date_published": 1524668034.494,
			"body": "中華人民共和國中央人民政府與蘇維埃社會主義共和國聯盟友好同盟特別協定，並加強中華人民共和國與蘇維埃社會主義共和國聯盟之間的密切合作，共同防止帝國主義用任何形式上的侵略行為，以及勾結日本帝國主義的再起，以建立亞洲新秩序，鞏固中蘇友好合作關係，特在兩國友好同盟互助條約以外，締結特別協定，為此各派全權代表如左：\n\n中華人民共和國中央人民政府特派中國政務院總理兼外交部長 周恩來\n\n蘇維埃社會主義共和國聯盟最高蘇維埃主席團特派外交部長 安德列．維辛斯基\n\n兩全權代表互相校閱證書認為妥善後，同意下述各條：\n\n第一條：締約國雙方為共同防止帝國主義之侵略，及共同應付第三次世界大戰，中華人民共和國允許蘇維埃社會主義共和國聯盟駐兵中國境內，以共同保衛世界和平。\n\n第二條：自締約日起，中華人民共和國先行劃交東北華北海空基地予蘇維埃社會主義共和國聯盟，作軍事上之部署，並由中國人民解放軍負責協助進行東南亞的解放事業，以完成亞洲解放大業。\n\n第三條：締約國雙方同意，將中國人民解放軍改編為國際紅軍，由紅軍最高統帥直接指揮。\n\n第四條：中華人民共和國，負責籌集華工一千萬人，協助蘇聯，共同建設中蘇軍事設備，以應付帝國主義之侵略行動。\n\n第五條：中華人民共和國應將華北各口岸開放予蘇聯永久駐兵，並自由出入，其中包括秦皇島、海州、煙台、威海衛、青島、大連。\n\n第六條：中華人民共和國，在本年底以前增加兵額四百萬，以準備帝國主義侵略行動。\n\n第七條：中華人民共和國之人口，因目前資源缺乏，非減少一億，決不能支持，其詳細辦法，由中華人民共和國自行定之。"
		},
		{
			"post_id": 469,
			"title": "我从来没有遇到过比中国人智商更低的民族",
			"date_published": 1524289186.468,
			"body": "从来没有遇到过一个从世界其它地区来的人会认为非洲人是不用吃东西，晒晒太阳就能长大的，或者认为其它贫穷国家的人民是整天饿着肚子，或者吃树皮草根过日子，或者吃观音土过日子的。\n\n只有中国人会认为在共产党政权之前的中国人是整天饿着肚子，或者吃树皮草根过日子，或者吃糠过日子，或者吃观音土过日子的。\n\n现在总算能吃饱饭了，所以比非洲人整天晒晒太阳，没有东西吃好多了，比世界上吃吃树皮草根过日子的国家好多了，比吃糠过日子的国家好多了，比吃观音土过日子的国家好多了。\n\n中国是一个非常封闭的社会，对外面的事物完全缺乏了解，造成中国人非常狂妄，无知的特点。也造成了中国人的智力普遍低下。\n\n其实，有些事情是很容易理解的，对于中国人却非常困难，无法明白。\n\n比如，菲律宾很穷，但是菲律宾人也是吃米饭长大的，这很容易理解。但是中国人却不明白他们是怎么长大。以为他们不用吃东西就能长大，或者以为他们是吃树皮草根长大的，或者以为他们是吃米糠长大的，或者以为菲律宾人是吃观音土长大的。\n\n中国人现在能吃饱米饭了，感觉比菲律宾人伟大多了，很了不起。可是菲律宾人几百年来就是吃米饭长大的，中国人现在不过是刚跟他们一样而已。\n\n这种简单的事实，中国人却无法明白。\n\n其实，这世界上是有一个说法叫【稻米共和国】，全世界的人都知道这个词，只有中国人不知道。\n\n全世界的人都知道【稻米共和国】的意思是指出产稻米的国家都是贫穷落后的国家，这些国家的人只有稻米吃，连非洲的黑人都知道，只有中国人不知道。中国人以为贫穷落后的国家都是吃树皮草根的，都是吃观音土的。\n\n现在的中国人比满清时期的中国人还愚昧，智商还低。满清时期的中国人虽然愚昧不堪，他们还知道那些蛮夷都是吃肉，吃奶制品的，没有蔬菜吃，所以要进口中国的茶叶。他们愚昧地以为如果没有中国的茶叶，这些蛮夷就都会大便不通，然后涨死。\n\n现在的中国人比满清时期的中国人更愚昧，现在的中国人连蛮夷是吃肉类，吃奶制品的都不知道，还以为蛮夷都是吃树皮草根过日子的。\n\n这样的人在中国决非少数，而是绝大多数中国人都如此愚昧。你不可能把如此大的愚昧群体都改变过来，让他们聪明起来。如果你认为你有这样的能力，那只说明你太过狂妄，与这些愚昧的中国人并没有本质的区别。\n\n与如此多的愚昧中国人一起过日子是不可能富裕的，是不可能成为富裕国家的。所以，吴越人士要及早清醒，必须远离这些愚昧的中国人，独立建国，这样才有可能过上富裕的生活。"
		},
		{
			"post_id": 468,
			"title": "刘胡兰--劣等民族中的一个典范",
			"date_published": 1522919890.594,
			"body": "在正常的社会，一个13-14岁的小女孩，还是个天真浪漫的孩子，还是一个情窦初开的小姑娘，是一个编织着自己梦想，幻想着有一天遇到自己的白马王子的小姑娘。\n\n可是在中国，一个13-14岁的小女孩，却整天与一些不三不四，游手好闲的二流子混在一起。整天与一些地痞流氓躲在见不得人的地方，偷偷摸摸地商量怎么杀人。怎么杀死一个与他们无怨无仇的人，而且这个人还是他们都认识的，是同村的，看着她长大的长辈。\n\n这样恶劣的行为，在中国却是值得尊崇的行为，还被中共政府封为烈士，还要让全国的小孩子学习。而且你还不能指出这种做法是不当的。如果你批评这种做法，你就是犯罪分子，因为他们还制定了法律不容许别人指出这种做法的邪恶。\n\n足见这个民族有多邪恶，足见这是一个劣等民族。\n\n像刘胡兰这样的人，在中国并非少数，这样的恶劣行为也并非少数，而是铺天盖地的多。是多到全国每个村子都有的，是多到全国每个城镇都有的。是多到全国每个村子都有很多这样的人，发生过很多这样的恶劣行为；是多到每个城镇都有很多这样的人，发生过很多这样的恶劣行为。\n\n刘胡兰们在中共执政之前就在很多农村，很多城市，偷偷摸摸地躲在见不得人的地方，商量做伤天害理的事。中共执政以后，这样的事就更多了。\n\n所谓的土改，就是土改工作队几个人，与所谓的土改积极分子，农会主席，躲在见不得人的地方，偷偷摸摸地商量怎么杀人，杀哪些人；怎么整人，整哪些人；怎么夺人财产，夺哪些人的财产。这种恶劣行为是在全国范围发生的，并不是少数地方发生的。\n\n所谓的镇压反革命，就是换了一批刘胡兰们，就是党支部书记，与几个所谓的民兵，躲在见不得人的地方，偷偷摸摸地商量怎么杀人，杀哪些人；怎么整人，整哪些人；怎么夺人财产，夺哪些人的财产。这种恶劣行为是在全国范围发生的，并不是少数地方发生的。\n\n所谓的三反五反，所谓的工商业改造，就是又换了一批刘胡兰们，就是工作组几个人，躲在见不得人的地方，偷偷摸摸地商量怎么杀人，杀哪些人；怎么整人，整哪些人；怎么夺人财产，夺哪些人的财产。这种恶劣行为是在全国范围发生的，并不是少数地方发生的。\n\n所谓的反右斗争，就是又换了一批刘胡兰们，躲在见不得人的地方，偷偷摸摸地商量怎么杀人，杀哪些人；怎么整人，整哪些人；怎么夺人财产，夺哪些人的财产。这种恶劣行为是在全国范围发生的，并不是少数地方发生的。\n\n所谓的四清运动，就是又换了一批刘胡兰们，躲在见不得人的地方，偷偷摸摸地商量怎么杀人，杀哪些人；怎么整人，整哪些人；怎么夺人财产，夺哪些人的财产。这种恶劣行为是在全国范围发生的，并不是少数地方发生的。\n\n所谓的文化大革命，就是又换了一批刘胡兰们，躲在见不得人的地方，偷偷摸摸地商量怎么杀人，杀哪些人；怎么整人，整哪些人；怎么夺人财产，夺哪些人的财产。这种恶劣行为是在全国范围发生的，并不是少数地方发生的。\n\n直到现在还是这样，一些刘胡兰们，躲在见不得人的地方，偷偷摸摸地商量，拆哪些人的房子，抢哪些人的土地。\n\n一些刘胡兰们，躲在见不得人的地方，在政法委书记的指挥下，以党小组的名义，以法院的名义，偷偷摸摸地商量怎么抓人，怎么杀人。\n\n一些刘胡兰们，躲在见不得人的地方，在王歧山的指挥下，偷偷摸摸地商量，怎么以反腐败的名义，抢其他贪官的财产。\n\n这样的刘胡兰们，在中国并不是少数人，而是多的很，一批又一批地产生，在全国范围一批又一批地产生。足见中国人这个民族是何等的邪恶，足见中国人是一个劣等民族。刘胡兰只是其中的一个典范。\n\n![1.jpg (0x0)](data/img/post_468_1.jpg)"
		},
		{
			"post_id": 467,
			"title": "齐巧巧持有江西稀有金属公司百分之十八的股份",
			"date_published": 1506417820.997,
			"body": "网上已查证：\n齐巧巧持有江西稀有金属公司百分之十八的股份，其余股份大部分由孟海晶持有，蓝金黄计划在正国级领导成功实现，绑架已是不争的事实。"
		},
		{
			"post_id": 466,
			"title": "彭博社：习近平家族财富过亿，权贵精英身家几何",
			"date_published": 1506416600.92,
			"body": "核心提示：彭博社的这篇报道让彭博财经网站在中国被屏蔽。这篇报道的信息均来自于公开资料，也十分谨慎地说明了巨额财富并不能追踪到习近平、彭丽媛、习明泽，而是主要由他的姐姐齐桥桥一家和妹夫吴龙以及习远平所有。\n\n原文：Xi Jinping Millionaire Relations Reveal Fortunes Of Elite\n\n来源：彭博社\n\n发表：2012年6月29日\n\n本文由\"译者\"志愿者翻译并校对，参考了其他\"同来源节译\"，此为全网首发完整译文。\n\n![1.jpg (0x0)](data/img/post_466_1.jpg)\n\n【文中提到的习家全家福。来源：香港侨报】\n\n习近平，这位\"内定\"的中国下届主席在2004年的反腐电话会议上警告说：\"管好你的配偶、子女、亲属、朋友和下级，发誓不用权力来谋私利。\"\n\n彭博社收集的公开资料表明，在习近平在党内逐步攀升时候，他的亲属们将商业利益扩展到了矿业、房地产、手机设备等领域。\n\n* * *\n\n这些利益包括在总资产达$3.76亿的众多公司中的投资，包括在一家资产达到$17.3亿的稀土公司的18%的间接股权；还有在一家公开上市的科技公司价值$2020万的股票。这些数字没有计入负债的部分，因此也不反映习氏家族的净资产。\n\n根据这些资料，这些资产不能追踪到习近平本人、他的妻子或他们的女儿，习近平本月就59岁了；他的妻子彭丽媛49岁，是中国人民解放军的一名歌手。没有证据显示习近平插手推动他的亲属们的商业交易，也未发现习近平和他的家族成员有什么不法行为。\n\n多家控股公司经营，政府对查看相关企业资料设限，以及某些情况下的网络审查，都使得这些投资处于公共视线之外。然而在数千页的监管文件中，人们依旧可以找到这些投资的影子。\n\n根据这些资料，可以查到习家在可以俯瞰南中国海的香港的山顶，有一座价值$3150万元的别墅。连接着电线的门铃摇摇晃晃，邻居们说这幢房子已经空了多年。习家在香港至少还有六处房产，总价值据估计有 $2410万元。\n\n# 常委\n\n过去三十年来，习近平在党内稳步上升，在好几个省都当过一把手，在2007年进入了政治局常委。这一路上，他因主政清廉而获得好评。\n\n根据《人民日报》的报道，他在富裕的沿海省份浙江领头抓过一次反腐运动，2004年也是在那，他发表了那通要官员们\"自我约束\"的警告。而后，在一起高达37亿人民币的丑闻后他接任了上海的党委书记。\n\n2009年的一份美国外交电报引用习近平的一位熟人的说法说，他不腐败，他的动力也不是钱。习近平对\"无所不在的中国社会的商业化，包括与之伴随的新富，官员腐败，价值、尊严和自尊的沦丧等等感到厌恶。\"这份由维基泄密透露出来的电报引述朋友的话这么说。\n\n美国政府的发言人拒绝就这份文件置评。\n\n# 分一杯羹\n\n人们对中国最有权势的家族在经济增长中谋取财富越来越厌恶，这已经形成了对中共的挑战。根据国际货币基金组织的报告，过去20年来，中国城市中的收入差距已经成为亚洲之最。\n\n位于圣地亚哥的加州大学中国经济方面的教授劳福顿（Barry Naughton）说：\"普通中国人在听到有些人利用政治影响力能赚数亿，甚至几十亿美元的时候感到愤怒。\"他并没有特指习氏家族。\n\n在十年一度的权力交接即将在今年下半年开始时，对官员财富的审查也加强了。习近平和下一代领导人将在本次交接后接班。三月，薄熙来，这位中国最大的城市重庆的党委书记遭到清洗，他被控卷入腐败和谋杀丑闻，让公众对任人唯亲和权钱交易深恶痛绝。中国的两家财经刊物和微博上都呼吁高层官员要公开财产。四月，彭博社曾报道，薄家积累了至少$1.36亿的资产。（相关译文可以查看《译者合集 薄王败局》）\n\n# 革命领袖\n\n习近平及其手足是已故的革命家习仲勋的孩子，他帮助毛泽东在1949年后控制了中国，他们曾誓言要结束数个世纪来的不平等和以权谋私。习的出身让他成为\"太子党\"中的一员，他们都是高层党领导的孩子，在政治和商业上获得了很大的影响力。\n\n据彭博社的研究，习家的大部分资产都可以追踪到习的姐姐，63岁的齐桥桥；她的丈夫邓家贵61岁；他们的女儿张燕南，33岁。\n\n截止6月8日的时候，邓家贵还拥有江西稀土和稀有金属钨业有限公司18%的间接股份。这种可以用于风力涡轮和美国的智能炸弹中的金属因为中国收紧了供应而价格飙升。\n\n# 远为集团\n\n2011年12月的记录显示，齐和邓在深圳远为投资有限公司持股共值18.3亿元（2亿8800万美元），这是深圳市一家经营房地产的多元化控股公司。远为旗下有其他几家公司完全由这对夫妇所拥有，总价值至少有5.393亿元（8480万美元）。\n\n张燕南在北京合康亿盛变频科技有限公司（Hiconics Drive Technology Co 300048）投资了317万元，从2009年至今增值了40倍，按照深圳股市昨日的收盘价，已经达到1.284亿万元（2020万美元）。\n\n彭博社联系到邓家贵的手机，邓称他已经退休了。当问及他的妻子，女儿和全国各地的生意时，他说：\"不方便跟你就此说太多。\"彭博社试图通过电话和传真到齐和张的公司找到他们，但无果，我们试图按照注册的地址去找，也不成功。\n\n# 新邮通信\n\n习近平的妹夫吴龙开了一家名叫\"新邮通信设备有限公司\"的通信公司。根据公开资料和对该公司的一名注册所有人的采访，到5月28日时，这家公司仍由吴的亲戚——他弟弟的妻子所有。\n\n根据北京咨询公司\"博达克（BDA）（中国）有限公司\"的说法，\"新邮通信设备有限公司\"从国营的中国移动通信公司赢得了数亿元的合同。按用户人数计算的话，中移动是全球最大的电话公司。BDA为多家技术公司提供咨询服务。\n\n因为这一话题的敏感性，彭博社在过去两个月中联络的数十人都不愿就习家置评。我们在联络了习近平的侄女和她的英国丈夫之后，介绍这两人的网页随即被删掉。\n\n习近平亲属所拥有公司的总资产可以看出他们商业运作的广度，但不代表其盈利程度。香港房产价值是根据与其可比房产最近的交易价格来估算的。\n\n# 身份证\n\n彭博社只计算了在文件中是由习家家人拥有的可以被明确计算的资产、房产和持股。根据公开商业记录、采访熟人、香港和中国的身份证可以追踪到的资产。\n\n如果习家人用的是不同于在大陆和香港的名字的话，彭博社是与那些见过他们的人谈话，并通过不同的公司文件上所显示的相同的名字和住址来查证。\n\n彭博社提供了一张列有习家资产的单子给中国的外交部。政府方面没有回应。\n\n2000年10月，习仲勋的家人在他87岁生日时，在深圳的一个国宾馆聚会，这位开国元勋在两年后去世。深圳毗邻香港，现已成为中国最富的城市之一，这应部分归功于习仲勋，是他说服邓小平将这个渔村变成了开放市场的试验田。\n\n# 家族照片\n\n在这张照片中，习仲勋穿一件红色毛衣，拄着拐杖，坐在轮椅中。他的左边是女儿齐桥桥，右边是孙子，他旁边挨着齐心，习仲勋的妻子。后面是齐桥桥的丈夫邓家贵；她的哥哥习远平及习近平，旁边是齐安安和她的丈夫吴龙。\n\n官方媒体把习仲勋描绘成有原则、有道德的领袖，根据报道习仲勋常向自己的孩子灌输革命精神。家人们在采访中回忆说他让孩子们都穿打补丁的哥哥姐姐传下来的衣服。\n\n根据一本习仲勋的传记所说，习仲勋还拒绝让桥桥在北京上最好的中学，那时她的考分不够但是学校还是愿意招收她。后来，她以母姓上了另一所学校，这样同学们都不知道她的背景。桥桥和安安有时也用父姓。\n党校\n在今年三月一日，北京的中央党校，习近平对2200名干部说有些人入党因为认为这是通往财富的快捷之路。\"要保持党的纯洁性更困难了，但也比以往更重要了。\"一本官方的杂志这样记录了他的演讲。\n\n他的女儿习明泽则避免曝光。她在麻省剑桥的哈佛大学读书，用的是化名。\n\n习近平将被提升到接替胡锦涛成为中国的最高领导人还没有最终确定。他必须在18大上成为中共的总书记，然后才能在明年三月的人大会议上成为国家主席。\n\n# 邓小平\n\n对执政精英们利用政治权力来获取个人财富的不满，从30年前邓小平的经济改革开始时就已经存在了，当时他说\"要让一部分人先富起来，然后带动其他人共同富裕\"。\n\n其他高层领导的亲属们也有商业活动，温家宝的儿子与他人共同成立了一家私募基金。温家宝的前任朱镕基的儿子则是中国的一家投资银行的老总。\n\n亚洲开发银行的首席经济学家万广华说：\"我真正担心的是金权挂钩，使贪污腐败和不平等愈演愈烈，持久不消。\"\n\n政府官员炫富引起日益激烈的公开批评。前海关总署署长去年被发现配戴劳力士金表，网民们表示不齿。前总理李鹏的女儿李小琳今年3月出席政协会议，也有人讥嘲她身穿的一套国际名牌，价值12000元，足以让200个贫困儿童穿上暖和的衣服。\n\n# \"不平等\"\n\n加州大学河滨分校中国学者林培瑞（Perry Link）说：\"民众很愤怒，因为赚钱途径不平等，成果被少数人掠夺，大众利益照顾得不够。\"\n\n温家宝在3月26日的国务院会议上说权力必须\"在阳光下运行\"，以打击腐败。虽然中国官员必须向有关当局申报收入和财产，以及直系亲属的私人资料，可是这些资料并不公开。\n\n由于缺乏透明，更加助长在中国要发财得靠\"关系\"的想法。这种情况说明了没有正式职务的太子党何以势力这么大，或者像中国俗语说的：一人得道，鸡犬升天。\n\"上面有人\"\n研究中国精英政治的哈佛大学教授马若德（Roderick MacFarquhar）说，\"如果你是中国某个要人的手足，人家会认为你可能是潜在的权力代理人，拼命巴结你，希望与权贵搭上关系。\"\n\n政治权力和财富之间的结盟并非中国独有。根据总统图书馆的介绍，1927年，约翰逊（Lyndon B Johnson）早年很穷，他是靠借来的$75元上了西南德州师范学校。但1964年（他的第一届总统任期期满时）生活杂志上的数据显示，就在竞选成功后的30年，到了1964年，他和他的家族在媒体和房地产的控股价值达到$1400万。\n\n纽约亚洲协会美中关系中心主任夏伟（Orville Schell）说，在任何国家都可能发现金权勾结，可是以中国为最，只要属于这些家族成员，就占很大的便宜。\n\n# 对习不公平\n\n退休的政府研究学者姚坚复呼吁领导人更多地公开财产，但这样把习近平和他的家族的生意联系起来不一定是正确的。\n\n姚在电话访谈中说：\"如果家族的其他成员是独立的商业代表，我认为这样把习家的财富算作是习近平的就不公平了。\"\n\n习氏家族的关系并非总是优势。习仲勋在1962年被毛泽东清洗。和许多其他的\"太子党\"一样，在文革中，习家的孩子被赶到了农村。齐桥桥和其他500名年轻人在内蒙古种田，有5元钱就感觉象发财了，她在接受清华大学的访谈时这么说。\n\n1976年毛死后，习家重新兴旺，习近平的姐姐齐桥桥到军队开始工作，成为了武警的一名指导员。1990年父亲退休，她便辞职在家照顾父亲，她在上述的访谈中这样说到。\n\n# 购置房产\n\n一年后，她在当时的英属地香港以300万港币的价格买了一套公寓——当时这一价格相当于普通中国工人年收入的900倍。地产登记记录显示，这一位于香港宝马山的宝马山花园的一套物业仍在她的名下。\n\n根据文件记录，1997年，齐和邓在后来成为深圳市远为实业公司的企业中投资1530万元。这家公司的资产不能公开交易。但是其中的一个子公司深圳亚伟投资名下的资产到2010年底时为18.5亿元。根据一家股票公司2011年的文件显示，这对夫妇拥有这家公司的99%股份。\n\n在那次清华访谈中，到了2002年，习仲勋去世后，齐桥桥才决定进入商界。2006年，她获得清华经管学院的MBA学位，并成立了一家民间鼓乐队，这是习仲勋的老家陕西省的民乐。\n文件追踪\n过去20年，齐桥桥、邓家贵、张燕南的名字，以股东、董事或法人代表（也就是董事长等公司负责人）的名义，出现在中国和香港至少25家公司申报的文件中。\n\n在一些文件中，齐还使用了Chai Lin-hing的名字。可以确认这是她因为中国公司的一份文件中的生日等特征信息和其他以齐桥桥的名义公开访谈一致。Chai Lin-hing 在香港和邓家贵还拥有数家公司和一处物业。\n\n2005年，张燕南开始在香港的文件中出现，那时齐桥桥和邓家贵把一家物业控股公司的99.98%转移给了她。这家公司名下有一处物业，位于Park的Regent的一个单元，估值有5400万港元。\n\n# 浅水湾别墅\n\n土地登记纪录显示，张燕南2009年以1.5亿港元在香港浅水湾丽景道购买一幢别墅，而自那时以来当地房价上涨大约六成。\n\n她的香港身份证号码出现在一份销售文件上，与在她和母亲、邓家贵所拥有的Special Joy投资有限公司上所用的身份证号码一致。五月十二日的登记文件显示，三个人共享了同一个香港地址。\n\n张在香港会景阁拥有另外四户豪华单位，该处房产毗邻君悦酒店，可以看到港岛全景。\n\n自从1997年从英国回归中国治下，香港一直实行自治，拥有自己的立法和银行系统。据中原地产统计，大约1/3的新豪宅的购买来自中国大陆的买家。\n\n在中国大陆，齐桥桥和邓家贵的开发项目是一个名为\"观缘\"的豪华复式住宅，靠近北京的金融区，广告号称其拥有精心修整的花园以及重现北京城历史宅院风貌的灰砖外墙。因为北京限制了对公司的查询，开发商的融资细节难以获知。\n\n# 北京项目\n\n在2006年的一次采访中，他们告诉《成功营销》杂志，为了给开发提供融资，夫妻俩从朋友和银行那里借款，目标是吸引国有公司的官员和管理人员。官方数据显示，首都的房价在随后的四年中上涨了79%。\n\n根据北京市土地资源局的数据，该项目的开发商——齐和邓的远为公司拥有70%的份额——在2004年以9560万元获得了超过1万平方米的土地，用于开发观缘。\n\n6月，观缘一套189平方米（2034平方英尺）的三室公寓在网上的挂牌价格是1500万元。每平方米售价79365元，比中国的年度人均GDP的两倍还要多。\n\n公众对飙升的住宅成本非常恼怒，使得房地产对于中国领导人而言成了一个特别敏感的问题。温家宝总理3月份表示，房价\"远远超过了合理水平\"。\n\"竞争环境\"\n缺少一个公平竞争的环境，难以承受的房价，意味着\"你只能远离中国梦\"，专注于中国政治研究的波士顿大学亚洲研究中心主任傅士卓（Joseph Fewsmith）如是表示\"如果靠此类不公平的机会来取得发展，中国的崛起能够持续吗？\"\n\n国立新加坡大学东亚研究所高级研究员薄智跃表示，那些找对了人脉的人能够获得政府控制的资产。\n\n他说：\"他们所需要的一切只不过是比其他人更先一步加入游戏，然后他们就能够获得巨大的收益。\"薄并不是特指习氏家族成员的投资。\n\n邓家贵另外一起投资的时机也把握得非常好，是在一家国有公司中投资稀土金属。\n\n# 稀土\n\n一份债券说明书显示，2008年，邓家贵的上海王朝投资公司以4.5亿元（7100万美元）购买了江西稀土30%的股权。\n\n邓在上海王朝中持股60%。在公司的登记文件中，有一张邓的中国身份证的复印件，与在原位分支机构文件中发现的身份证相同。文件显示，原位集团相关的管理层同时担任江西稀土的副董事长和首席财务官之职。\n\n中国在稀土金属的生产上近乎拥有垄断地位，而这笔投资恰发生在中国正在收紧控制稀土的生产和出口之时。该政策导致部分稀土金属的价格在2011年飙升了4倍。\n\n在位于南昌的江西稀土，总裁办公室的一位女性接听了电话，说她无法提供财务信息，因为公司并没有在交易所上市。她拒绝谈论上海王朝的投资，说这太敏感了。\n\n# 合康亿盛变频\n\n齐桥桥的女儿张燕南在合康亿盛投资317万元，三年后这家总部位于北京的电气设备制造商于2010年公开上市。根据合康亿盛的创始人刘锦成在清华网站上的资料，他和齐桥桥曾就读于同一个EMBA班。\n\n公司董事会秘书王东没有对传真的问题和要求评论的电话作出回复。\n\n齐和邓的商业利益可能更为广泛：他们的名字是位于北京和深圳至少11家公司的法人代表，两个城市都对获取公司的文件信息都设限，很难判断公司的所有权或者资产的价值。\n\n# 大连万达\n\n例如，邓家贵是一家总部位于北京的公司的法人代表，在2009年的一次私人配售中，该公司以3000万元购买了中国最大的开发商之一大连万达商业地产集团0.8%的股权。大连万达商业去年的销售额是953亿元（150亿美元）。\n\n大连万达商业在一份电子邮件声明中表示\"不就私人交易进行评论\"。\n\n一家官方网站和公司记录显示，邓也是一家获得政府10亿元（1.57亿美元）桥梁建设合同的公司的法人代表，该项目位于中国中部的湖北省。\n\n研究中国金融和政治的史宗翰（Victor Shih）是位于伊利诺斯州埃文斯顿市的西北大学的一名教授，他说复杂的所有权结构在中国很常见。史宗翰表示，太子党任用他们信任的人，通常是远系家族的成员，代表他们开设公司、从国有企业竞标合同。他并非特指习氏家族。\n\n# 新邮通信\n\n拿习近平的妹夫吴龙来说，广州开发区网站的两份报告（一份2009年，一份2010年）可以证实他是新邮通信的董事长。\n\n新邮通信在网站上没有提供管理层名单。在中国的搜索引擎百度上用\"吴龙\"和\"新邮通信\"搜索，会引发一个中文的警告：\"搜索结果可能不符合相关法律法规和政策，未予显示。\"\n\n资料显示，新邮通信由两位名为耿敏华（音）和华丰（音）的人拥有。在公司的文件中，他们的地址指向北京一座数十年楼龄的9层混凝土建筑物，耿年老的母亲住在那里，在她的客厅墙上钉着她女儿的手机号码。\n\n6月6日通过电话联系，耿证实她和儿子华丰拥有新邮通信，她的女儿嫁给了吴龙的弟弟吴明（音）。耿说吴龙负责公司，她不参与公司管理。\n\n# 另外的所有者\n\n在6月27日一份6页的声明中，新邮通信证实另外两个人洪英（音）和马文彪（音）为公司所有人，并表示公司的头是一个叫刘然（音）的人。公司没有对我们再一次提出解释所有人不同的要求作出回复。我们未能联系到吴龙和他的妻子齐安安进行评论。\n\n新邮通信是一家从国家合同中受益的初创公司。它的专业领域是政府强制的、由中国移动部署的家用3G移动电话标准。据BDA的消息，2007年它击败了摩托罗拉等众多的资深竞争者，获得一份手提终端的供货合同。\n\nBDA董事长邓肯·克拉克（Duncan Clark）说：\"他们原本籍籍无名，突然一下子冒了出来。人们本来认为摩托罗拉在设备合同中会获得很大份额，然后一家无名的公司就一下出现在了榜首。\"\n\n新邮通信在声明中说，2007年，国内的移动标准仍在发展中，很多大竞争者在袖手旁观，让公司获得了很大的市场份额。\n\n# 习远平\n\n去年从摩托罗拉分拆出来的摩托罗拉移动被谷歌有限公司收购，其在北京的发言人威廉·莫斯（William Moss）拒绝对任何单独竞标的细节发表评论。中国移动公司的发言人张璇（音）在电子邮件中表示，中国移动\"一贯坚持公开、公平、公正和可信的竞标原则\"。\n\n习近平的弟弟习远平创建了一家名为国际节能环保协会的能源咨询机构，并任主席。据一位拒绝透露身份的雇员说，他在该机构中并未充当积极角色。\n\n习近平的一位侄女拥有丰富资历。去年，齐安安与吴龙的女儿吴雅凝（Hiu Ng）及其35岁的丈夫Daniel Foa被列为一个网络座谈会的发言人，与英国亿万富翁理查德·布兰森（Richard Branson）和女演员达里尔·汉娜（Daryl Hannah）一起代言马尔代夫的可持续旅游。\n\n# 哈德森清洁能源\n\n吴雅凝最近开始与哈德森清洁能源合伙公司合作，帮助其在中国寻找投资机会，该公司在美国管理着一个超过10亿美元的基金。\n\n在彭博社记者联系这对夫妻之后，他们的细节被从互联网资料中删除。Foa在电话中说不能就他们2007年建立的清洁能源公司FairKlima资本发表评论。吴雅凝没有对要求采访的电子邮件作出回应。\n\n在FairKlima的网站上，两人都不再被提及。6月3日一个\"联系我们\"的缓存页面上，在\"高管团队\"的标题下还包括有吴和Foa的简历。\n\n6月8日在吴的Linkedln资料中提及她曾在新邮通信工作过，此后被删除，同时被删的还有她的\"哈德森清洁能源合伙中国公司副董事长\"的头衔。\n\n总部位于新泽西的私人股权投资公司Teaneck创始欧尼尔（Neil Auerbach）说他曾与吴雅凝共事，因为吴对可持续性长期以来都有兴趣。\n\n在6月13日的采访中，欧尼尔说：\"我们了解她的政治关系，但她的关注点是可持续投资，那就是目的。我们很乐于与她共事。\"\n\n相关阅读：\n查看更多\"太子党\"译文专辑\n\n关于本文，请联系彭博新闻社：北京，Michael Forsythe，atmforsythe@bloomberg.net; 香港，Shai Oster，soster@bloomberg.net; 香港，Natasha Khan，nkhan51@bloomberg.net; 纽约，Dune Lawrence，atdlawrence6@bloomberg.net\n\n本文版权属于原出版公司及作者所有。©译者遵守知识共享署名-非商业性使用-相同方式共享 3.0许可协议。\n\nPOSTED BY 译者 AT 下午10:37 43 COMMENTS\n\nLABELS: PRINCELING, XJP"
		},
		{
			"post_id": 465,
			"title": "民主革命领袖教程（下）",
			"date_published": 1505983977.071,
			"body": "辛亥革命的志士总结革命的方法唯有：宣传，暗杀，起义。辛亥革命的志士远比我们现在的民运组织，反对派，异议人士聪明及具有行动能力。辛亥革命志士从1904年光复会在上海设立暗杀组织【军国民教育会】到1911年辛亥革命成功，仅用了7年时间就推翻了满清皇朝。所以我们现在的民主革命人士只需按照辛亥革命志士指明的革命方法去做就可以了。\n\n革命的方法第一是宣传。但是现在中共控制了所有的言论，控制了所有的报刊，杂志，电台，电视台，互联网，根本就不存在可以宣传的地方。但是有一个地方中共无法控制，这就是P2P网络。这个就是民主革命的宣传阵地。\n\n---\n\nP2P网络软件中，目前经我实际测试使用，以零网为最好，使用方便，也已经有了一定的网络基础。其次是Resilio，Resilio的基本原理与零网非常相似，但也有不同，各有优势。其它的一些P2P网络软件在使用的便利性上还需要改进，暂且我们不必关注。\n\n民主革命的宣传无非2个方面，内容的制作也就是写文章与网络的建设与推广。\n\n写文章我们不用考虑，几百年来西方关于民主政治的论述多如牛毛，随便摘取一些段落就是很好的民主革命宣传资料，重要的是网络建设与推广。\n\n民主革命的领袖人物就是要做P2P网络的建设与推广工作。网络建设分软件开发；站点建设与内容提供；节点推广，其实就是市场推广。民主革命领袖人物无需关注软件开发，重点在节点推广，站点内容的提供作为次要工作。P2P网络的存在与稳定依靠的是众多节点，节点越多网络越稳定，效果越好。\n\n具体说如何把自己培养成一个民主革命的领袖人物：\n\n如果你是生活在一个县城，把目标放在建立10个稳定的零网同步站点上。\n\n在县城几乎所有的人都互相认识，或者至少都知道。这就是一个对你推广同步站点很有利的条件。一般你很容易在一个县城建立起10个零网同步站点的。如果这很困难，你应该检讨一下原因，究竟是什么原因造成。\n\n建立零网的稳定同步站点要用电脑，手机的容量有限，不是很适合的。民主革命不是流氓无产阶级革命，如果连购买电脑的能力都不具备，这样的人不适合成为民主革命的主要力量。这是你在建立零网同步站点时要注意的事项。\n\n你先要了解你生活的县城里具有民主意识的年轻人，或者维权人士。了解他们是否拥有电脑，如果具备这2个条件，就可以鼓励他建立一个稳定的零网同步站点。如果他不懂如何建立，你可以教会他如何使用零网客户端，帮助他关注一些零网上宣传民主革命的站点，这样一个零网同步站点就建成了。\n\n你也可以以帮助你们县城的做小生意的人士建立零网小店的方式开展，这也是很方便的，我在零网使用方法介绍的站点上有介绍的。这个甚至可以是一种收入。\n\n建立任何形式的民主革命团体或者组织都会很容易招到中共的严厉镇压，但是建立零网同步站点却不同，这不需要一个明确的组织。你可以以好奇的面目出现，向朋友推荐零网。也可以以炫耀的姿态出现，向合适的人推荐零网。当然也可以以其它各种方式，无声无息地建立起10个稳定的同步站点。\n\n一个县城有10个稳定的同步站点就足够了，全国3000个县城，建立3万个稳定的同步站点，这是非常了不起的革命事业。在建立了10个稳定的零网同步站点以后，再建立10个Resilio同步站点就很容易了。\n\n如果你是生活在大中城市，可以把目标放在建立100个稳定的零网同步站点，每个区建立10-20个。方法可以通过同学聚会，亲戚朋友聚会，公园，小区聊天时推广。可以从推荐零网上的欧美电影，新闻等入手。可以有目的的向维权人士推荐。各种方法可以自己摸索。\n\n秘密建立的稳定的同步站点最好不要做任何注册，不要发言，跟贴，这样就很难追踪这个同步站点的具体位子，即使追踪到了，也不能说明任何问题。只是关注了一些站点而已。这就是零网传播信息的优势，零网不需要转发，只要关注了一个站点，就等于转发了所有的信息。\n\n零网目前已经有很多内容了，足以吸引更多的人加入。但是零网目前还缺专门的新闻站点，如果你在自己的县城，或者生活的城市已经建立了稳定的同步站点，达到了你的目标，下一步可以考虑建立自己的新闻站点。在还没有达到建立同步站点的目标之前，不适合先行建立新闻站点，以避免一事无成。\n\n在还没有完成建立同步站点的目标之前，实在有地区性的新闻要发布，完全可以发布在目前已经有的很多零网论坛上。\n\n在全国各地都建立起稳定的同步站点以后，零网在中国有了广泛的使用者以后，我们可以到上海召开零网使用者大会，或者零网爱好者大会，也可以在上海召开零网爱好者国际大会。大张旗鼓地宣传零网，大张旗鼓地庆祝突破中共的网络封锁。大张旗鼓地传播民主革命的理念。大张旗鼓地主张吴越独立！"
		},
		{
			"post_id": 464,
			"title": "蒙藏维手拉手--学习波罗的海三国争独立",
			"date_published": 1505351998.434,
			"body": "![2.jpg (0x0)](data/img/post_464_2.jpg)\n\n![3.jpg (0x0)](data/img/post_464_3.jpg)\n\n![4.jpg (0x0)](data/img/post_464_4.jpg)\n\n![5.jpg (0x0)](data/img/post_464_5.jpg)\n\n![6.jpg (0x0)](data/img/post_464_6.jpg)"
		},
		{
			"post_id": 463,
			"title": "西藏独立理念者大会",
			"date_published": 1505309430.716,
			"body": "【西藏之声2017年8月22日报道】来自海外的中国民主活动人士，以及台湾、维吾尔、南蒙古等遭受中共打压的群体代表，参加了在巴黎举行的第四届西藏独立理念者大会，强调各方应携手对抗中共的殖民统治。\n\n![1.jpg (0x0)](data/img/post_463_1.jpg)\n\n第四届西藏独立理念者大会昨天（8月21日）在法国巴黎市召开。该场活动除流亡藏人社区持独立理念者出席，亦有来自世界各地其他民族群体的志同道合者出席。\n\n* * *\n\n台湾法学博士曾建元、流亡德国的中国女作家徐沛、世维会秘书长多里坤•艾沙、世界南蒙古大会主席席海明，以及旅澳学者袁红冰等出席了会议。\n而根据活动筹备方公布的视频与新闻稿，西藏议会议员朗杰卓嘎作为主要嘉宾之一，在致开幕词时提出，理念与派系间的相互敌视绝不应该出现在西藏抗争中。她认为，壮大西藏独立运动，主要依靠团结对抗中共，在介绍西藏独立历史的同时，也应该向民众阐释争取西藏独立的利益。\n西藏前政治犯李科先发言时，提到藏人必须做好准备，抓住世界趋势变化的机遇，而世维会秘书多里坤•艾沙则谈到东突厥斯坦的未来与独立抗争，强调与所有反抗中共统治的人民进行联盟的重要性；徐沛博士在发言中介绍了中共对世界民主的威胁。"
		},
		{
			"post_id": 461,
			"title": "反共人士请先提高智商",
			"date_published": 1504622726.214,
			"body": "智商不够是不可能推翻中共这样一个政权的。难道你们始终不能从你们发的帖子的点击率看出你们的影响及其有限吗？这么长时间都不能明白这点，这只能说明你们的智商有待提高。\n\n如果当年没有上海【申报】对秋瑾一案持续1年多的跟踪报道，清国民众根本就不可能知道有大批的革命党在试图推翻满清政权，也就根本不会有这么多的人士加入革命党，也就不会有后来的辛亥革命成功了。\n\n现在的通讯条件远比辛亥革命时期要好。可是反共人士有几个知道什么网络技术可以突破中共的信息封锁？反共人士有几个在使用可以突破中共网络封锁的软件？反共人士在国内建立了几个宣传革命主张的站点？\n\n709一案，范围远超过满清时期的秋瑾案，持续的时间也远超过当年的秋瑾案，可是，海外这么多反共组织，反共人士，与当年的上海【申报】比较，你们是不是太无能了一点？\n\n谈论反共革命，民主革命，请先提高智商。请先弄明白如何把网站建立到国内去，请先弄明白如何让国内的民众了解革命的主张，如何让国内的民众了解反共革命的必要性。"
		},
		{
			"post_id": 460,
			"title": "中国民主革命的定位---新科技冲垮旧制度",
			"date_published": 1503812521.398,
			"body": "向民主革命大会提议\n\n当代革命党人要以辛亥革命党人为老师，要承认辛亥革命党人远比我们聪明，能干。只有按辛亥革命党人指明的方法，步骤去做，革命才会成功。\n因为辛亥革命从1904年光复会在上海成立【军国民教育会】到1911年武昌起义，仅用了7年时间就推翻了满清政权。而当代的海外民运，自从王秉章1978年在海外成立民运团体【中国民主联盟】到今天已经40年了，还是一事无成，也看不出有任何成功的可能。\n辛亥革命党的领袖人物都是些高智商人才，他们中的大多数都掌握当时世界的先进科技，在中国几乎无人知晓的先进科技--化学。\n在欧洲，火枪手冲垮了中世纪骑士集团。在中国，是现代化学冲垮了八旗集团。\n\n---\n\n反观今天海外民运的“大佬”，几乎都是一些低智商人物，对现代科技一无所知，却异常狂妄，不可一世。\n只要对中国有那么一点了解的人都知道，中国的优秀学生都进入了理工科专业，连在国外高度竞争的医学院都难招最优秀的学生。可是，如果你浏览海外的“民运”网站，杂志，你会误以为中国最优秀的人才都进入了人文学科。你会误以为中国的人文学科，政治学，社会学，都是在世界上处于领先地位。因为这些“民运大佬”创造了太多的“第一”，“民运”中有太多的“第一个”创立各种理论的人物。\n辛亥革命党人对革命方法的认识就是“宣传，暗杀，起义。”\n今天的革命党人进行宣传，条件远远比辛亥革命时期好，简直好太多了。可惜，海外民运进行了40年，国内的大多数民众根本就不知道海外有人在搞民运，实在是对“海外民运的大佬，几乎都是一些低智商人物”的最好注释。\n海外目前的一些宣传民主的网站，大部分，或者几乎都被中共渗透，即便还有独立性也只是自娱自乐。大部分中国人都不会上这些网站的。如果大量中国人都来上这些网站，他们早就发大财了。早就像新浪，网易，腾讯，阿里巴巴一样发财了。这些宣传民主的网站在中共的严厉封锁下，除了自娱自乐，向民主基金会申请一些资金吃民运饭之外，没有多少实质意义。\n民主革命大会首先就要讨论解决这个问题，如何运用先进科技把海外的信息，民主意识传递给国内民众，而不是在海外办一个网站，坐等国内的人千辛万苦的翻墙出来。\n目前的P2P技术是中共无法封锁的网络，至少在中共垮台之前，他们是无法封锁的。零网，自由网，Resilio，都是P2P网络软件，当然还有更多这样的软件。要把宣传民主革命的网站建到零网，自由网，Resilio上去。\n在P2P网络上建立网站不需要申请域名，不需要租用服务器，只要有电脑就可以了。建立网站的成本是非常低的。\n民主革命大会要研究具体责任到人，由哪些人负责建立，维护P2P网站。\n民主革命大会还要研究解决如何将在海外建立的P2P网站传递到国内去。我提议要在中国大陆每个省建立至少20个同步站点。最好能在每个省建立100个同步站点。由民主革命大会在海外募集资金，给于支持购买电脑，将海外革命党建立的P2P网站同步到国内去。海外革命党人在国内建立的同步站要选用台式电脑，一来通风效果好，有利于长时间运行，另外扩充硬盘容量比较方便。同步站要同步大量的数据，所以要准备硬盘容量扩充。\n在国内建立同步站点并不需要什么技术，只要会用这些软件就可以。但是要注意保密，不要暴露，以免被中共破坏。\n对于国内的零网同步站点，只要安装一个客户端，不要注册任何其它东西，不要发贴，只关注海外革命党建立的网站，把数据同步过来，这样中共就很难发现同步站的位置，无法破坏。\n零网的单个站点不要建的太大，数量上可以多建几个。每个站点最好不要超过1个G，方便大家同步关注。如果一个站点最多一个G，100个站点也只有100G。国内的同步站点要将这些站点都同步过来，国内普通民众可以根据需要分别同步自己喜欢的站点。\nResilio我正在尝试建立网站，理论上可行，实际上有什么问题还不好说，因为使用的人太少，数据同步非常困难。\nResilio是商业公司，民主革命大会可以与该公司联系，负责在中国大陆的市场推广，可以商讨一个利益分成的方案，这样就能为中国的民主革命筹集资金。\n自由网软件我还没有试用过，根据介绍似乎是基于数据流技术。目前无法发表看法。\n民主革命大会要确立明确的行动目标，在1个月内完成海外P2P网站的建设及在国内每个省建立至少20个同步站。3个月时间，网上的动员能力要达到100万以上。网上动员能力不能达到100万以上，现实中就不具备发动全民起义的条件。\n中国的民主革命就是用新科技冲垮旧制度的革命。民主革命大会解决了海外P2P网站的建立，解决了国内同步站的建设，解决了广大民众的参与，中共的网络封锁就彻底失败了，中共的谎言就破产了，中共政权就崩溃了。\n如果半年之内网上动员能力还不能达到100万以上，海外革命党就应该果断放弃在汉人地区发动民主革命的目标，转向全面支持蒙藏维地区独立革命。"
		},
		{
			"post_id": 458,
			"title": "你们甚至不敢姓自己的姓",
			"date_published": 1501983431.842,
			"body": "因为看到一些女性朋友站出来支持文贵，所以我也站出来讲话，讲一些真心话。\n\n郭文贵拿出一些资料，包括海航股份，包括王岐山家族在美国的房地产，包括他们在海航的波音七八七私人飞机，我是半信半疑地，但是后来国内把防火墙越挡越高，还出来辟谣，出于好奇我就继续追踪郭文贵，结果是越追踪越相信。\n\n你们怕什么？为什么设立防火墙，为什么微信上跟海航有关的帖子不准评论，为什么刘呈杰成为敏感词，搜索不到，你们怕什么？\n\n---\n\n你们心虚了，你们害怕人们知道真相，你们怕谷歌，怕YouTube，怕推特，怕网友发帖，怕网友跟帖，怕提到任何你们家里的人的名字，你们甚至不敢姓自己的姓，王岐山的女儿姓孙，儿子姓贯，姚庆的儿子女儿姓赵，你们连自己的姓都不敢姓，你们有多么怯懦。\n\n郭文贵有没有说谎，我不敢说，我只知道我有没有说谎，根据我自己的判断，他讲的是真的，我也可能判断错误，但是，你们可以声明，可以控告他，也可以打开防火墙让大家看看有这么一个荒谬的人，满嘴胡言乱语，让大家来骂他。可是你们敢吗，你们就是一群胆小鬼，你们怕人们知道真相。\n\n你们偷了老百姓的钱，拿到美国去，还怕人知道，不准我们谈论，我们中国有多穷？一个二十几岁的男孩，在工厂每天工作十几个小时，一个月两天休息还被老板吃掉，一个月只赚一千人民币，中午一盒盒饭就要十块钱，他连盒饭都吃不起。\n\n你们有人心吗，你们的私人飞机在天上飞，每小时烧掉十万块，你们烧的那是钱吗？你们烧的是老百姓的血，那些贫穷的同胞，你们把他们当人了吗，你们骗走大家的血汗钱，然后告诉我们中国如何强大如何值得骄傲，你们是些吃人不吐骨头的家伙。\n\n一直以来，我对自己的定位是吃瓜的群众人，现在，我这个吃瓜群众也要说话了，你们要是有点廉耻心，就打开防火墙，你凭什么不让我的同胞知道你们做了什么。"
		},
		{
			"post_id": 456,
			"title": "打击中共基层干部是瓦解中共专制的特效办法",
			"date_published": 1501904512.875,
			"body": "对执行中共暴政的基层干部，究竟该不该反抗？总有好些故作高深的迂腐人说：中共的暴政出自上面，与下面的执行者作对，无济于事，对自己也很危险！\n\n也有貌似激烈的人说：要杀，就杀制定暴政的人，杀那些城管、公安小喽喽有什么用？他们并以此否定杨佳、夏俊峰等武力抗暴者的价值。\n\n其实这些观点似是而非，且毫无可行性。\n\n---\n\n的确，“冤有头，债有主”，制定暴政的中共高官，是最该打击的对象，如习近平、王岐山、张德江、俞振声、刘奇葆之流。问题是他们安保严密、戒备森严，民众根本无法接近他们，更遑论打击他们。“六四”之后，中国撕下“人民政权”的伪装，赤裸裸法西斯化，打造警察国家，如今市一级的官员，老百姓都已很难接近。\n\n因此，反对派要“打蛇打头”——打击暴政的制定者，毫无可行性。\n\n但是，广大中共的基层干部，他们并没有严密的警卫，老百姓也容易接近他们，他们的住所、家人，也无法与普通老百姓隔离开来...因此，打击他们是完全可行的。\n\n那么，打击中共的基层干部，对于动摇中共专制，真的无济于事吗？非也！现阶段，打击中共的基层干部，恰恰是瓦解中共专制的特效办法。\n\n因为，现阶段打击中共的基层干部，会严重动摇中共统治集团的士气，且会大大增加其维稳的成本。\n\n“六四”大屠杀，加上“六四”后邓小平的“南巡”全面走资，导致共产党意识形态彻底破产；因此，从江泽民时期到今天，中共广大基层干部之所以帮中共维持统治，全靠利益驱动。\n\n理想主义丧失、纯利益驱动，其后果有二重性：一是不可理喻性——你无法以讲理、规劝、良心等方式感化利益驱动的作恶者（所以那种以上书规劝等方式所谓“引导中共”的做法，纯属伪类放屁）；二是容易动摇性，即：\n\n如果帮中共“维稳”的风险不断上升，他们的士气很快就会瓦解。\n\n这全然不比上世纪五十年代，那时候中共意识形态正旺，广大吃了政治迷魂药而不怕苦、甚至不怕死的基层干部，很难被风险吓阻，故彼时中共，尽管被土匪和国民党游击力量干掉许多基层干部，仍然最终牢牢掌控了江山。\n\n昔非今比，今天的中共基层干部，不再有任何献身精神，都是色厉内荏、欺善怕恶的人渣、无赖，一旦民众的强烈反抗，令他们死伤了几个人，便会大面积的齐齐吓破胆。\n\n今天的中共基层干部，之所以仍然普遍凶恶猖狂，是因为为中共效劳，暂时还有利益刺激，而民众普遍地又没有反制手段，他们不用担心作恶后遭报复。以上海为例，上海的国保（政治警察），早在2005年就达十万年薪，而上海人在中国又以缺乏反抗精神（动不得真格）出名，所以上海的国保警察特别嚣张。\n\n但是，在少量民风强悍的地方，民众已经勇敢地起来打击中共基层干部了，并取得了“和平、理性、非暴力（又曰：“公开、和平、透明、守法”）根本取不到的好效果：\n\n面对强征土地暴政，四川好些农村自发地进行有组织的武力反抗，他们利用崎岖的地形，挖断山路，打退包括公安武警在内的强征队，废黜中共任命的村支书、伪村长、另立自治领导人...令中共付出了巨大的镇压代价。结果不得不在事后收敛暴政，进行安抚。\n\n面对强征土地暴政，民风强悍的浙东农民，则把卖地村干部的家打得稀烂，吓得当地农村基层干部，不得不收敛巧取豪夺的行径。\n\n而同样面对强征土地暴政的广东太石村，在范亚峰、郭飞熊等人的非暴力误导下，完全放弃抗暴自卫权，以数倍于军警的人数，居然软弱到眼睁睁看着中共匪警冲进村委会办公室强抢账本，都不敢抵抗的程度！\n\n结果是广东党官匪警气焰万丈，太石村维权彻底失败，连最低的补偿都得不到。\n\n广东和浙东一样富庶，但广东人却不敢象浙东人、四川人那样暴力反抗，其结果是中共广东当局非常嚣张（直到今天），张德江主掌广东时，之所以敢于赤裸裸地开枪屠杀汕尾村民维权，就是看透了广东人的软弱而肆无忌惮。\n\n计划生育方面，敢于反抗（打击中共基层干部）和不敢反抗的效果，对比同样鲜明：\n\n清朝以来，四川就以民风强悍著称，四川多地农民以暴力反抗中共“计划生育”暴政，令“邓计生”在当地形同虚设。他们采取“敌进我退”的游击战术，在山道伏击进村拆房抓人结扎的计生队，甚至将计生队员连人带车推下悬崖。吓得中共在四川的计生工作人员，长年不敢下乡“执法”，惟以虚报的数字应付上级。\n\n四川农民对“邓计生”的英勇反抗，令中共的“计生”国策在四川多地农村形同虚设。\n\n相比之下，湖南的农民，就普遍比较软弱，不敢组织起来打击中共基层干部，只敢流亡外地，变身“超生游击队”，其结果是湖南农村计生之野蛮，全国闻名，湖南乡县的计生系统，频频窜到外地，去绑架、结扎“超生”、“超怀”者，可见嚣张到何种程度！\n\n同为广西，面对“计生”暴政，桂林十二县的农民就比较软弱，因此桂林的“计生”系统之野蛮猖狂，广西闻名：笔者同乡，民主党人李志友的表姐，怀孕八个月，已近临产，虽藏身桂林市，仍然被临桂县计生委搜出绑架、惨绝人寰地将即将临盆的男婴拉出来用剪刀戳死（曾节明按：这种血债今后一定要偿还！）\n\n而玉林农民对“邓计生”的暴力反抗广西闻名，因此多年来当局对玉林农村的“超生”睁眼闭眼，2007年，时广西一把手刘奇葆欲以“计生”作政绩，恶抓玉林“计生”，结果激起玉林地区十多万农民大规模暴动，把乡、县政府砸得稀烂，十多个乡、镇的中共政权，竟在短时间内垮台，当地大批中共基层官吏，吓得不敢上班，不敢回家，流亡在外...而捅了大漏子后，刘奇葆在胡面瘫的保护下，仓皇调任四川。玉林农村的“计生”，也就不了了之了。\n\n以上可见，现今完全由利益驱动的中共基层干部不可理喻，只认反制手段（打击），你的反制手段越多、越硬，他（她）越收敛、越“文明”，而你越和平、越理性、越守法，他（她）越嚣张、越野蛮。这同样表现在个人案例上：\n\n2008年杨佳手刃六名上海公安后，数年之间上海公安的嚣张气焰收敛很多，出事的闸北分局尤其老实规矩了很多，这种效果，是非暴力、规劝、喊冤根本取不来的。\n\n2008年，笔者一个个体户老板朋友，没有“准生证”生了第二胎，当地计生办主任带人找上门，要按年收入比例罚款几十万元，这位朋友苦口婆心的论理，表示愿意缴纳几万元罚款，计生办头头蛮横拒绝，态度傲慢，严令限期缴纳罚款，还跑去威胁勒索女方，这位朋友闻讯勃然大怒，把心一横，拿了一把杀猪刀藏在衣服里，当晚就在计生办主任必经的归家之路上，把他截住，抽刀喝道：\n\n妈了个X，再敢惹我，老子砍死你！老子奈何不了共产党，总奈何得了你吧！总奈何得了你家里吧！你他妈的也有家有口，你试试看！\n\n结果吓得几乎尿裤子的该计生办头头，再也不敢来找麻烦，一分钱罚款没交，还上了户口！\n\n笔者做记者的时候，尝与一个派出所的年轻干警聊天，他自诉干这一行风险不小，说：\n\n抓赌因为利润丰厚，所以公安特别来劲，以前去抓赌，他总是冲在最前面，因为还没遭遇过抵抗；结果有天晚上去抓赌，遭遇一个赌徒开砂枪反抗，伤了五个，他腿上面还有几颗铁砂没取出来，所以现在抓赌，他再也不敢冲在最前面了...\n\n现在中共基层干部之所以为中共效劳，无一不是出自为己为家，因此，如果反对派针对作恶基层干部进行跟踪或人肉索，摸清其住址，家人、子女（或孙子、孙女）所在单位、学校（或幼儿园）（这并不难做到）...这无疑会对中共基层干部带来巨大的心理压力，甚至令其寝食难安，从而决不敢肆无忌惮地为中共卖力。\n\n由于现今的中共基层干部，都是意识形态全无、纯粹由利益驱动的地痞、流氓、混混，他们色厉内荏、欺善怕恶，因此，打击他们，可以极其有效地吓阻广大基层干部为中共效力，令他们不敢作为。\n\n而基层干部又是中共政权的基础、地方政权的支柱，基层干部一旦士气崩溃，大面积地不作为，也就意味着中共专制管控的失控，和地方政权的大面积坍塌，这样，反对派在国内就有了运作的空间，这样，中共中央政权的就不堪一击、一推就垮了。\n\n由于现在的基层干部为中共效力，纯粹出于利益，没有人会为中共的事业而献身，因此一旦他们在民众的反抗打击下，风险不断增长，他们必然就会向上级要价，要装备，要设施，要奖金...否则不愿作为，这就会极大地增加中共维持政权的成本：\n\n中国2010年的维稳支出金额为5,490亿元已经超出国防费用的5,340亿元人民币，此后维稳经费的继续连年上涨，超越军费越来越多，成为中共政权身上的毒瘤。\n\n2016年初，中共官方承认：中国三十一个省（市、自治区）有十三个发生了债务危机；当年2月官方更新的数据显示，中国100多个市级、400多个县级政府债务率超过100%，处于实质性财政破产状况，而且此种趋势还在滚雪球一般扩大...\n\n因此，打击基层干部会加速中共国的经济危机和财政破产，而经济崩溃是民众大面积上街的最好的动员力量。\n\n曾节明 于丁酉乙巳丙辰与阴雨纽约州May 30, 2017"
		},
		{
			"post_id": 455,
			"title": "回复杨建利博士对主张暴力革命的质疑",
			"date_published": 1501770443.973,
			"body": "杨建利博士对主张暴力革命的质疑主要有这几点：是自己干还是鼓动别人干；什么时候干；还没有干是不是受非暴力主张影响。\n\n我看了一下杨建利博士质疑的关键还是“自己干还是鼓动别人干”。这与五毛们的言论一样。\n\n我的回答非常明确：鼓动别人干！\n\n---\n\n我知道很多人都抓到把柄了，你自己不干鼓动别人干，让别人流血当炮灰。\n\n我要是这么容易就让你把嘴堵上了，我还会来回答吗？\n\n鼓动别人干的原因是吃民运饭的落后普通民众太多了，反共人士落后普通民众太多了，不得不鼓动别人干！\n\n大陆的普通民众早就在用暴力反抗中共的暴政了，最具代表性的是杨佳；穿着婚礼服，带着煤气瓶，汽油瓶站在房顶上的是女性代表。我做过一个初步的统计，大陆民众自发的暴力反抗已经远远超过辛亥革命时期革命党人发动的暴力攻击。再不公开鼓动暴力革命就太落后了，太不负责任了。因为民众自发的暴力反抗力量太小，不足以震慑中共，不可能推翻中共暴政。这样的反抗只能是无谓的牺牲。\n\n我们必须公开的鼓动暴力革命，公开的鼓动有组织的暴力革命。把民众自发的暴力反抗，把民众对中共贪腐官员的个人复仇，汇聚到革命团体的领导下，这样才能对中共产生足够的威慑，这样才能动摇中共暴政，这样才是对民众负责任。\n\n在民众的暴力反抗还没有被引导到革命团体的领导之下，主张暴力革命的人自己以孤胆英雄的方式对中共发动暴力攻击，这种示范是不负责任的做法。反对主张暴力革命，不去引导民众自发的暴力反抗，让民众陷与孤立，陷于绝望，更是不负责任的做法。\n\n鼓动别人干的原因是太多的人陷于绝望，他们把暴力的对象转向了幼稚院的小朋友，转向了学校的学生，转向了无辜的路人。\n\n这是反共团体没有提出暴力革命主张的后果，如果暴力革命的主张能在国内广泛传播，这些陷于绝望的人士知道在海外有主张暴力革命的团体，他们就不会陷于绝望，他们可以寻找革命团体，参与革命团体。他们就不会去对幼稚院的小朋友，学校的学生，无辜的路人发动暴力攻击，他们能在革命团体的协助下对中共政权发动暴力攻击。\n\n鼓动别人干的原因是太多的人陷于绝望，他们把反抗的形式变成了自焚，跳楼，服毒，上吊。\n\n对于中共这种前所未有的残暴政权，自焚，跳楼，服毒，上吊，没有任何作用。中共夺取政权后，土改，镇压反革命就杀了400多万民众。西藏民众陷于绝望有150多人自焚，没有任何作用。我极力反对这种抗议形式。必须尽快将暴力革命的主张传播到西藏地区，让陷于绝望的藏人参加到海外的革命团体中，用暴力革命的手段推翻中共这个残暴政权。\n\n鼓动别人干的原因是太多的人陷于绝望，他们无力反抗，只能被中共强拆的履带压死，被重型卡车压死，被倒塌的房屋压死。\n\n真正的反共人士必须尽快传播暴力革命的主张，让这些无助的受害人走出绝望，参与到推翻中共暴政的革命团体中来。\n\n在暴力革命的主张还没有在中国大陆广泛传播之前，主张暴力革命的反共人士不可充当孤胆英雄，不可做这样的示范。主张暴力革命的反共人士先要广泛传播对中共发动暴力革命的必要性，先要在舆论上击垮与中共对抗要采用“和平，理性，非暴力”的错误思想，先要把中国大陆大量的陷于绝望的民众争取到革命团体之中，然后才可以以革命团体的力量对中共发动暴力攻击，然后才可以自己参与到对中共残暴政权发动的暴力攻击中去。"
		},
		{
			"post_id": 451,
			"title": "台湾姑娘支持郭文贵 人越多越安全",
			"date_published": 1501590224.702,
			"body": "<video src=\"data/video/46.webm\" controls=\"\" autoplay=\"\" width=\"600\" height=\"400\"> your browser does not support the video element.\n</video>"
		},
		{
			"post_id": 447,
			"title": "夏业良教授别再错下去了",
			"date_published": 1501397385.693,
			"body": "郭文贵是如何与你闹翻的我不清楚，也没关心是具体哪件事引起的。不过很明显应该是你一直在质疑郭文贵爆料的真实性引起的。在郭文贵爆料这件事上，你犯了很多明显的，常识性的错误。\n\n近几年，我们一直在鼓动民众对共产党暴政不要跪下去，要敢于反抗，必要的情况下要实行自然法则。现在总算有一个中国的商人敢于站出来反抗了，你却反复地质疑他说的话。你这不是明显的犯了低级错误吗？\n\n郭文贵爆料是中共内斗引起的，或者说就是中共的内斗，这不需要任何民运大佬，公共知识分子来告诉大家。中共内斗垮台本来就是我们早就预期中的一个可能性。鼓励他们内斗，才是你应该做的。\n\n在对待郭文贵这件事上，暴露了你知识上，认识上的很多不足。暴露了你对中共政权的残酷性认识不足；暴露了你对美国社会的认识不足，缺乏起码的法律常识；暴露了你对中共政权垮台的必然性认识不足；也暴露了你一些人格上的缺陷，你与大多数的中国人一样缺乏同理心，而且非常固执。\n\n* * *\n\n像郭文贵这样揭露中共高层的腐败，揭露的如此详细，他是冒着极大的风险的，是会被中共政权追杀的。这点大家都清楚，郭文贵也清楚。而你却看不到他的勇敢。你可能会说，他是被逼到绝境了，没有选择，只能反抗。但是，不是所有被中共逼到绝境的人都敢反抗的。\n\n你死死抓着郭文贵不反习，还把习近平这政治流氓捧成千年圣君不放。其实这暴露了你与大多数的中国人一样缺乏同理心。如果你有1千亿资产被中共扣押，而且可以肯定这些资产会被中共权贵侵吞瓜分，你会在这样的情况下公开在美国反习吗？\n\n缺乏同理心是中国人普遍的民族性，你自己感觉不到，但是有同理心的人能看出来。就像那些唱红歌，穿着红卫兵服装的人一样，他们感觉不到这样做是对很多中共政权受害人的冒犯。他们看不到这些红歌背后的斑斑血迹，他们感觉不到这些红卫兵服装背后的受害人的血泪。因为他们没有同理心。\n\n我也是在VOA断播之后开始关注郭文贵的。以前我根本就不知道有郭文贵这么一个人，我对中共的内斗也没有任何兴趣。只是当时我很奇怪VOA怎么会把一个揭露中共内幕的直播节目断播了，这不是把潜伏在VOA的中共人员暴露了嘛。所以我才看了一下郭文贵在VOA的节目。郭文贵在VOA节目中只是把矛头对准了傅政华，他后来的报平安节目也很清楚可以看出他在与中共讨价还价。但是只要对中共政权的本质有清楚的了解，一看就知道他走上了一条不归路。\n\n海外的很多民运人士，如果原来你看不出郭文贵走的是一条不归路，可以理解。或者像倪育贤先生那样，本能地就对中国的那些富豪反感，这也可以理解。郭文贵自己都说他是从大粪坑里爬出来的。但是，如果直到现在你还看不出他走的是一条无法回头的不归之路，直到现在你还看不出他一定会走上反共的道路，那是你对中共政权的残酷性认识不足。\n\n郭文贵的指控都是非常严重的。大家应该还记得他最初在推特上爆料是被推特封了帐号的。你认为这是因为渗透在推特的中共人员干的吗？我告诉你不是，是推特怕承担责任。郭文贵虽然以个人的身份在推特爆料，但是推特是一个公众平台，推特是公共媒体。\n\n如果郭文贵的指控都是胡编乱造，不但郭文贵会被起诉，推特也一样会被起诉。而且不管是郭文贵还是推特，都会受到严厉的惩罚。你作为公共知识分子，连这些起码的法律常识都没有，暴露了你对美国社会的认识不足，不了解美国的法制环境。\n\n中共政权从本质上说与2000多年的中央集权制皇权体制没有区别，只是很多名称改了，忠君爱民改成了为人民服务；青天大老爷改成了人民公仆；衙门改成了人民政府；至高无上的皇权改成了党的权威。不过，有一点与2000多年的中央集权制皇权体制是不同的，以前的皇权是不传外姓的，而中共的党权是传外姓的。\n\n这可能长久吗？以前的皇权不传外姓都杀到血流成河，现在的党权是传外姓的，他们可能不杀到天昏地暗吗？郭文贵卷入这种党权争斗是一种必然，而且还会有更多的与中共勾结的商人会卷入这种党权争斗。在中共政权崩溃之前，郭文贵还有回头的路吗？不管他是参与中共的内斗还是他对抗整个体制，他只能一直斗下去。\n\n这个就是中共政权会崩溃的必然性的内在原因。\n\n郭文贵追求一个有公平法制的社会环境，在中共独裁政权下，这可能吗？不管郭文贵对中共还有多少幻想，他只能失望，再失望，直到绝望。最终走上反共反习的道路。\n\n认识不到这点，暴露了你对中国文化，历史的认识不足，暴露了你对中共政权崩溃的必然性认识不足。其实，你只要看一看现实也可以很容易地明白，所有的共产党政权，只有朝鲜，古巴这2个党权不传外姓的还能维持。东欧，苏联这些党权传外姓的都崩溃了。越南也是一个党权传外姓的共产党政权，越南共产党已经摇摇欲坠了，只要越南人民能发起一次反共大游行，越南共产党政权就垮台了。同样，中共也会在一次人民大起义时崩溃。\n\n党权要能够传外姓，它就必须不是一个至高无上的权力。只要它是一个至高无上的，不可挑战的权力，它就一定不能传外姓。这是所有共产党政权都无法回避的历史与现实。\n\n最后，我还想说一下，中国任何一个朝代崩溃之前，都是充满了流言蜚语。即使郭文贵的爆料都是胡编乱造，那又如何？我们应该很欢迎这样的流言蜚语，我们应该期待更多的流言蜚语，只要中共恐惧，我们就乐见这些流言蜚语的广泛传播。这样的流言蜚语不是正印证了中共的末日吗？"
		},
		{
			"post_id": 445,
			"title": "参加过中共的解放军是你人生中的污点",
			"date_published": 1501140982.657,
			"body": "<div class=\"ELUvyf\">\n\n看到大量的老兵维权时都在喊“拥护党中央”，“拥护习近平”的口号。我想你们一定认为参加过中共的解放军是很光荣的，是值得骄傲的吧？可是你们了解中共的这支所谓“解放军”的历史吗？\n\n---\n\n<div jsname=\"uwfEUd\" id=\"body:i9\">你们上访，维权时都举着这支解放军的“八一”军旗。可是你们知道这个“八一”南昌起义，是以国民党左派的名义起义的吗？你们知道这“八一”南昌起义是支持汪精卫武汉政权，反对蒋介石南京政府吗？所以你们上访，维权时举着“八一”军旗，就应该喊“拥护国民党”，“拥护汪精卫”这样的口号才是正确的。\n\n<div class=\"fu5e3b sMVRZe\" data-th=\"180\" style=\"\">这支军队南昌起义失败后，就与毛贼的一群痞子一样上井冈山投奔土匪王有才。然后就火并了王有才，与梁山上火并王伦一模一样。这支军队上了井冈山之后，就是专干拦路抢劫，打家劫舍，绑票勒索的勾当。当然也像所有的土匪一样，血腥内斗，争夺控制权。最后被国民政府镇压围剿，只能像历史上的流寇的一样，到处流窜。但是，与历史上的流寇不同的是，这伙匪徒在逃亡前大量的杀害自己的同伙，数量达到惊人的10万之众！\n\n<div class=\"wftCae\" jsname=\"EjRJtf\" dir=\"ltr\">这支军队逃亡到陕西之后，就像它逃亡到井冈山一样，立即火并了收留它的土匪刘志丹。然后在抗日战争中勾结外敌坐大。\n\n这支军队在抗日战争胜利后立即在东北按苏联斯大林的指示进行暴乱，结果被国民政府打的屁滚尿流。后来在朝鲜共产党派出3个师的帮助下，伙同被苏联关押的30万日本战俘，在苏联提供巨量的武器及金钱的支援下，在东北叛乱成功。\n\n你们参加过的这个中共的解放军，从来就没有像真正的军人一样进行过一场战争。\n\n在东北的暴乱，是靠裹挟民众，制造人道危机迫使国民政府军投降。在所谓的淮海战役，靠的是挟持民众当人肉盾牌。\n\n在朝鲜战场，是无视士兵的生命，用所谓人海战术这种自杀行为博取对方的同情与怜悯。在中苏珍宝岛冲突中，同样是以无视士兵的生命，让士兵用木棍，手榴弹去对付苏联的坦克，是对手怜悯士兵的生命才避免了更多死亡。\n\n你们根本就是炮灰啊，哪有什么光荣与骄傲啊？\n\n这支军队倒是在天安门广场对手无寸铁的学生，民众进行过大规模屠杀。参加过这样的军队绝对是人生中的一个污点。\n\n如果你因为不了解中共的这支“解放军”的历史而参加了它，这不是你的错，因为中共用谎言掩盖了真实的历史。如果你是因为不得已而参加了这支军队，这也不是你的错。\n\n但是，如果你知道了真相，还是甘当炮灰，甘当奴才，还要拥护“党中央”，还要“拥护习近平”，那你就活该被奴役。参加过解放军就绝对是你人生的一个污点。</div>\n\n</div>\n\n</div>\n\n</div>"
		},
		{
			"post_id": 444,
			"title": "拒绝官派律师的再次声明",
			"date_published": 1501117779.113,
			"body": "拒绝官派律师的再次声明\n——709李文足\n\n2017年7月14日和今天，先后有两位大名鼎鼎的律师通过各种“途径”找我。一位通过短信告诉我已经会见王全璋。我回复短信：我坚持聘请原来的律师。他又给我电话，被我拒绝。另一位是通过我信任的好友传话，坚持要见我，却不说原因。我本以为是全璋的同道关心家属，就见面了。没想到他竟然是官派律师！\n\n```\n从王全璋被抓的那天起，我就聘请了我非常信任的律师，在律师圈里也是有口皆碑的好律师！但是，他们一直被官方百般违法阻止，万般变态施压。\n```\n\n这当中有被官方威胁，被迫退出的李仲伟、袭祥栋律师；有被官方痛下杀手的王秋实律师（他被失踪后扣上的罪名是“颠覆国家政权”）；有被官方狠辣摧残，变成“无所律师”的余文生律师；还有一直被官方实施各种打压却总不低头的程海律师！\n\n* * *\n\n这些律师作为王全璋的辩护人有一个共同特点：就是两年多的接力会见中，始终见不到王全璋！而且他们自身被官方狠狠打压！为什么？因为这些律师知道709案是个错案，他们为公义站出来，不会允许王全璋被构陷成罪！\n\n而两位“准官派”律师，为什么在明知道家属已经聘请了律师的情况下，还被官方牵着鼻子，违反程序介入王全璋的案子后，再出面试图让我同意？你们今天违反程序跟官方站在一起，就是伙同官方把一个清白的同行陷害成罪犯，帮着官方把王全璋的罪名做实！\n\n不管你是多么大牌的律师，不管你是不是熟人朋友，我李文足都不会“领情”，绝不会买账！以天津律协杨玉芙、温志胜为代表的官派（官驭）律师，在地球上已经是名副其实的“臭大街”了。你们要前仆后继的加入此行列，着实叫人震惊！而我所聘请的律师和我，不单单是维护王全璋个人的合法权益，更重要的是维护王全璋等709律师所坚持的法治精神。\n\n因此，为近日频繁发生的官派律师上门的情况，我，709案王全璋律师的妻子再次严正声明：\n\n第一，家属有权利聘请律师，我坚持自己聘请的律师。\n\n第二，王全璋现在处在不自由的状态下，如他有看似选择的律师，一定是被酷刑的情况下，万般无奈的选择。（如许多709被释放人士所揭露的，就是专案组绝不允许他们聘请自己想聘请的律师。）\n\n第三，我，坚决抵制所有官派律师。不管是哪个圈子的，如果你违背程序介入王全璋的案子，你就是与官方一伙，构陷王全璋。就算你曾经是我丈夫王全璋的熟人朋友，做了官派律师，也就是害我丈夫的人了，不再是朋友了。\n\n此声明发出，如再有所谓的“律师”找上门，我不保证我的情绪会一直像今天这样稳定。\n\n特此声明，请拟做官派律师者自重。\n\n```\n声明人：709 李文足（王全璋之妻）\n    支持人：王峭岭（李和平之妻）\n      金变玲（江天勇之妻）\n      原珊珊（谢燕益之妻）\n      陈桂秋（谢阳之妻）\n      樊丽丽（勾洪国之妻）\n      刘二敏（翟岩民之妻）\n      王全秀（王全璋姐姐）\n      徐孝顺（吴淦爸爸）\n      2017年7月25日\n```"
		},
		{
			"post_id": 441,
			"title": "北京数万民众示威",
			"date_published": 1500961083.975,
			"body": "<video src=\"data/video/45.mp4\" controls=\"\" autoplay=\"\" width=\"300\" height=\"400\"> your browser does not support the video element.\n</video>"
		},
		{
			"post_id": 438,
			"title": "全国上访老兵们，你们不要再自己欺骗自己了！",
			"date_published": 1500803896.913,
			"body": "<div class=\"body\" data-editable=\"body\" data-editable-mode=\"meditor\">你们这样长年上访，你们在全国各地上访，包围军委大楼，你们以为中共党中央不知道你们的情况吗？你们以为习近平不知道你们的情况吗？那你们为什么还要高喊支持习近平，拥护党中央？你们这是自己在欺骗自己。你们这是把自己放到了全国上访民众的对立面，你们这是把自己放到了中国受压迫民众的对立面。\n\n奴才是没有资格争取权益的！你们既然甘当中共的奴才，那还争取什么个人权益？岂不荒唐？\n\n你们真要争取自己的权益，并不需要到北京去上访，并不需要去包围军委大楼，并不需要到省政府去上访，并不需要到县政府去请愿。只要在任何一个你们自己的城市，甚至在任何一个小小的县城，在任何地方，无论是广场还是公园，无论是市中心还是偏僻街道。只要聚集几百人，甚至只需要聚集几十个人，高喊“打倒中国共产党”，这样就足够了。这样就足以震慑中共！这样中共党中央就会立即出来面对你们的问题，这样习近平就会立即面对你们的诉求。\n\n无论这个城市多么小，无论这个地方多么偏僻，只要你们能聚集起来高喊“打倒中国共产党”都足以震慑中共，都足以震慑习近平。就看你们有没有这个胆量。\n\n当然，你们的问题是不可能解决的，无论你们是高喊“拥护党中央”，“拥护习近平”，还是高喊“打倒中国共产党”，都不会解决。因为钱没有了，因为中国这30年的发展成果，这30年的财富积累都被“延安儿女”们拿走了，都被“延安儿女”们转移到国外去了，都被“延安儿女”们藏到巴拿马去了。\n\n全国上访老兵们，你们不要再自己欺骗自己了！\n\n</div>"
		},
		{
			"post_id": 435,
			"title": "王岐山美國成片買房，地下室藏金",
			"date_published": 1500627118.551,
			"body": "<video src=\"data/video/44.webm\" controls=\"\" autoplay=\"\" width=\"600\" height=\"400\"> your browser does not support the video element.\n</video>"
		},
		{
			"post_id": 430,
			"title": "王岐山的大灰机",
			"date_published": 1500283684.821,
			"body": "<video src=\"data/video/41.webm\" controls=\"\" autoplay=\"\" width=\"600\" height=\"400\">your browser does not support the video element.</video>"
		},
		{
			"post_id": 426,
			"title": "“半条被子”纪念碑树立仅三个月就被当地人砸毁，可见老百姓之痛恨！",
			"date_published": 1499933287.253,
			"body": "![1.jpg (0x0)](data/img/post_426_1.jpg)\n\n![2.jpg (0x0)](data/img/post_426_2.jpg)"
		},
		{
			"post_id": 424,
			"title": "为人民服务",
			"date_published": 1499521167.433,
			"body": "<video src=\"data/video/40.webm\" controls=\"\" autoplay=\"\" width=\"600\" height=\"400\"> your browser does not support the video element.\n</video>"
		},
		{
			"post_id": 422,
			"title": "孟建柱你在新疆杀了多少人？",
			"date_published": 1499428290.872,
			"body": "<video src=\"data/video/39.webm\" controls=\"\" autoplay=\"\" width=\"600\" height=\"400\">your browser does not support the video element.</video>"
		},
		{
			"post_id": 421,
			"title": "你可听到人民在呐喊",
			"date_published": 1499400234.654,
			"body": "<video src=\"data/video/38.webm\" controls=\"\" autoplay=\"\" width=\"600\" height=\"400\">your browser does not support the video element.</video>"
		},
		{
			"post_id": 419,
			"title": "王岐山请回答",
			"date_published": 1499325385.161,
			"body": "<video src=\"data/video/37.webm\" controls=\"\" autoplay=\"\" width=\"600\" height=\"400\">your browser does not support the video element.</video>"
		},
		{
			"post_id": 411,
			"title": "湖南灾民抗议“人祸”",
			"date_published": 1499095283.21,
			"body": "<video src=\"data/video/33.mp4\" controls=\"\" autoplay=\"\" width=\"300\" height=\"400\"> your browser does not support the video element.\n</video>"
		},
		{
			"post_id": 410,
			"title": "夏业良，章立凡被郭文贵骂纯属活该。",
			"date_published": 1499093261.715,
			"body": "郭文贵爆料牵涉到这么多人的贪腐与性生活关系，任何一条不实都足以使他破产。夏业良，章立凡作为公共知识分子，连这点起码的法律常识都没有，还讲什么人权，法制？如何推动中国的法治？活该被骂。\n郭文贵爆料牵涉到的人难道不知道这点？他们贪腐了这么多资金难道没钱咨询律师？为什么不在美国起诉郭文贵？\n因为起诉郭文贵就要在法庭上举证，就会留下证据。就会证实他们更多的贪腐行为。他们不敢在美国起诉郭文贵。"
		},
		{
			"post_id": 408,
			"title": "举报贪腐，发家捷径：美国彻查居民海外资产，隐报谎报要坐牢",
			"date_published": 1499092699.254,
			"body": "<div class=\"body\">所有移民美国的人包括绿卡持有者不管是否居住在美国，隐瞒海外的银行存款或房产等资产，将被重罚坐牢。美国国税局欢迎中国人举报，为举报人保密，并给予举报人涉税金额15～30%的奖励。美国国税局北京办事处电话：010-85313983, 传真：010-85314287\n\n　　上周，美国国税局公布了《海外账户纳税法案》（FATCA）部分实施细则。根据税法规定，截至2011年12月31日，居住在美国境内、在海外拥有5万美元以上资产或者居住在美国境外、在海外拥有20万美元以上资产的美国公民和持有美国绿卡的外国人都需要在2012年4月15日前向政府申报；藏匿海外资产拒不申报被视为有意逃税，一经查出会被处以高达5万美元的罚款，严重的还会被判刑。\n\n　　此外，美国政府还规定，所有想在美国经营的外国银行从2013年1月1日起都必须向美国国税局提供存款超过5万美元的美国公民账户信息，否则就被视为与美国政府不合作。对于不合作的金融机构，若有美国来源所得，美国将对其总收入（而不是净收入或利润）征收30%的惩罚性税收。\n\n</div>"
		},
		{
			"post_id": 407,
			"title": "美国国税局奖励举报富人海外隐瞒资产者1.04亿美元",
			"date_published": 1499092506.418,
			"body": "<div class=\"body\">2013年02月16日 10:09\n\n　　北京时间2月15日下午消息 CNN报道，美国国税局周三表示，2012年共向偷税漏税检举者派发了1.25亿美元的奖金，远高于前一年的800万美元，显然创下了新高。\n　　其中一个人的贡献最大，但他也得到了最丰厚的奖励，得到了高达1.04亿美元奖金。他是瑞银前银行家Bradley Birkenfeld，他向国税局揭露了瑞银帮助美国富人在海外隐瞒资产的信息。\n　　Birkenfeld所提供的信息为美国政府与瑞银在2009年达成和解铺平了道路。瑞银同意向美国政府支付7.8亿美元罚金，并将数千名美国富人的账户情况提交给了美国。\n　　Birkenfeld本人也因在瑞银帮助美国富人逃税事件中的作用被判处14个月的监禁。\n　　自1867年以来，美国国税局便得到授权可以给予偷税漏税检举者奖励。2006年通过的法律更是让国税局增强了处理检举者信息的能力，并提高了奖金。\n　　如果检举者举报的逃税额在200万美元以上，那么在提供了证据后，检举者可以得到追回资金的30%的奖励。如果举报的逃税额在200万美元以下，那么奖励比例要相当小一些。\n\n</div>"
		},
		{
			"post_id": 406,
			"title": "先把姚明珊的房产查封了",
			"date_published": 1499004521.892,
			"body": "<div class=\"body\">查封中共在海外的腐败资产不必等到查出几万亿，几十万亿才查封。应该先从姚明珊的资产开始查封。\n\n因为姚明珊的房产是在89年64后购置的，这个资金无论如何她都无法证明是合法来源。估计她购置美国房产的资金就是传说中64时期中共准备倒台后流亡海外，政治局瓜分的国家资产。\n\n先把姚明珊的房产查封了，按美国的法律依照比例提成，这样可以鼓励更多的人追查中共在海外的腐败资产。\n\n</div>"
		},
		{
			"post_id": 405,
			"title": "打铁还需鸡巴硬",
			"date_published": 1498981764.308,
			"body": "<video src=\"data/video/32.mp4\" controls=\"\" autoplay=\"\" width=\"600\" height=\"400\"> your browser does not support the video element.\n</video>"
		},
		{
			"post_id": 404,
			"title": "709律师大反攻的方法",
			"date_published": 1498961407.758,
			"body": "709律师都亲身经历了中共的酷刑，能实际指证那些当事人。可以直接向美国的人权组织报告，将他们列入制裁名单。但是这还不够，要调查他们子女在西方留学的情况，要调查他们的家属在西方的情况，更要调查他们在西方国家的财产，将这些情况都向美国人权组织报告，将他们都列入制裁，没收他们的腐败资产。\n中共的贪官往往将子女送到西方留学，将转移到西方的财产放在子女的名下，把这些都找出来，没收他们的腐败资产。"
		},
		{
			"post_id": 403,
			"title": "709律师可以大反攻了",
			"date_published": 1498926376.872,
			"body": "<video src=\"data/video/31.mp4\" controls=\"\" autoplay=\"\" width=\"600\" height=\"400\"> your browser does not support the video element.\n</video>"
		},
		{
			"post_id": 402,
			"title": "哈哈哈，跟着郭文贵发大财。",
			"date_published": 1498925654.958,
			"body": "<video src=\"data/video/30.webm\" controls=\"\" autoplay=\"\" width=\"600\" height=\"400\">your browser does not support the video element.</video>"
		},
		{
			"post_id": 400,
			"title": "再贴一遍：致吴越地区公安，国宝的公开信。",
			"date_published": 1498835707.172,
			"body": "看了郭文贵的爆料，相信你们应该会认同我的判断：中国这30多年的发展，有一半的财富都被红二代及与他们勾结的利益集团拿走了。\n如此巨额的财富流失，是可以推算的，是可以从多个方面推算的，不是空口白话。\n\n[致吴越地区公安，国宝的公开信。](http://127.0.0.1:43110/1JfzWXHBzELkVF12km6ZdnKSZFUAs8mZBw/?Post:286:%E8%87%B4%E5%90%B4%E8%B6%8A%E5%9C%B0%E5%8C%BA%E5%85%AC%E5%AE%89%EF%BC%8C%E5%9B%BD%E5%AE%9D%E7%9A%84%E5%85%AC%E5%BC%80%E4%BF%A1%E3%80%82)"
		},
		{
			"post_id": 396,
			"title": "北方某地发生爆炸",
			"date_published": 1498664651.473,
			"body": "<video src=\"data/video/29.mp4\" controls=\"\" autoplay=\"\" width=\"300\" height=\"400\"> your browser does not support the video element.\n</video>"
		},
		{
			"post_id": 395,
			"title": "顺德公交车司机集体罢工",
			"date_published": 1498664468.039,
			"body": "<video src=\"data/video/28.webm\" controls=\"\" autoplay=\"\" width=\"300\" height=\"400\"> your browser does not support the video element.\n</video>"
		},
		{
			"post_id": 394,
			"title": "顺德公交车司机维权行动暂无满意答复，据说明天行动升级至集体罢工。",
			"date_published": 1498664169.473,
			"body": "<video src=\"data/video/27.mp4\" controls=\"\" autoplay=\"\" width=\"300\" height=\"400\"> your browser does not support the video element.\n</video>"
		},
		{
			"post_id": 390,
			"title": "有时候我根本不想回想我的祖国是中国",
			"date_published": 1498560787.608,
			"body": "<video src=\"data/video/26.webm\" controls=\"\" autoplay=\"\" width=\"600\" height=\"400\">your browser does not support the video element.</video>"
		},
		{
			"post_id": 388,
			"title": "共产党靠的就是不要脸",
			"date_published": 1498483924.452,
			"body": "<video src=\"data/video/24.mp4\" controls=\"\" autoplay=\"\" width=\"600\" height=\"400\"> your browser does not support the video element.\n</video>"
		},
		{
			"post_id": 387,
			"title": "林耶凡：中国共产党 你有什么资格坐在人权理事会上！",
			"date_published": 1498481675.477,
			"body": "<video src=\"data/video/23.mp4\" controls=\"\" autoplay=\"\" width=\"600\" height=\"400\"> your browser does not support the video element.\n</video>"
		},
		{
			"post_id": 382,
			"title": "北京民眾在盤古樓前支持郭文貴",
			"date_published": 1498370226.106,
			"body": "<video src=\"data/video/22.mp4\" controls=\"\" autoplay=\"\" width=\"550\" height=\"400\">your browser does not support the video element.</video>"
		},
		{
			"post_id": 380,
			"title": "跟着郭文贵去发大财！",
			"date_published": 1498311630.459,
			"body": "<div class=\"body\">很多人在质疑郭文贵爆的料是真的还是假的；很多人在质疑郭文贵爆的料有多少是真的；很多人在质疑郭文贵爆料的动机；很多人在质疑郭文贵是中共哪一派的。这些人都是傻逼，跟着傻逼不会发财，离他们远点。\n\n郭文贵爆料是什么动机关我们什么事？郭文贵爆料的真实性有多少关我们什么事？郭文贵爆料给我们提供了很多线索，给我们提供了发大财的机会，这个就值得我们关注。</div>\n\n<div class=\"body\">美国早几年立了一个法，向美国政府举报藏匿在美国的腐败资产，可以按比例提取奖金！向美国政府举报美国护照持有人藏匿在海外的资产，可以按比例提取奖金！\n\n郭文贵的爆料给我们提供了很多这样的线索，提供了很多中共官员藏匿在美国的资产线索，我们把这些资产调查清楚，向美国政府举报，就可以获得巨额奖金。\n\n郭文贵的爆料还给我们提供了很多中共官员家属持有美国护照的线索。我们只要把这些官员家属在中国的资产调查清楚，向美国政府举报，就可以获得巨额奖金。\n\n郭文贵爆料虚虚实实，那是他在与中共讨价还价。他不可能完全把底牌摊出来，底牌都摊出来还怎么讨价还价？他只能爆一些线索，这就够了。如果他把底牌都摊出来了，我们也没有发财的机会了，因为美国政府也不再需要你举报了。就是这样有点线索才好，就是这样有点线索才有发财机会。\n\n别再浪费时间去质疑郭文贵了，这跟你没屁关系。去仔细研究他的爆料中的线索，把那些资产调查清楚，向美国政府举报，去拿巨额奖金。\n\n</div>"
		},
		{
			"post_id": 368,
			"title": "汝州老兵维权",
			"date_published": 1497958890.547,
			"body": "<video src=\"data/video/21.mp4\" controls=\"\" autoplay=\"\" width=\"230\" height=\"400\">your browser does not support the video element.</video>"
		},
		{
			"post_id": 365,
			"title": "暴政下的冤民",
			"date_published": 1497796888.768,
			"body": "<video src=\"data/video/20.mp4\" controls=\"\" autoplay=\"\" width=\"300\" height=\"400\"> your browser does not support the video element.\n</video>"
		},
		{
			"post_id": 361,
			"title": "超级低俗屠夫（吴淦）宝典之一：杀猪宝典",
			"date_published": 1497599252.204,
			"body": "这几年接触了许多访民，也有一些访民向我求助，由于我一般介入正在发生的案子，还有各种原因，无法一一帮到。看到那么多人受到司法不公的伤害，在上访过程中又要再遭受各种伤害，身心，精力，金钱都付出很多，却无法得到公正解决。有人几十年轮回在上访的路上，看到这些，感到很心痛和无奈。之前我在微博上简单写了一个杀猪宝典，深受大家欢迎和认可，为了减少访民无谓的付出和伤害，为了让更多人了解现状，所以抽空写了这个杀猪宝典与访民朋友探讨。\n\n---\n\n上访在正常国家是不存在的，正常的国家一切问题走司法程序，靠法治和司法的公正维系。他们有健康的纠错机制，各司法有关部门独立相互制约，还有自由的新闻媒体监督，所以也不会存在信访部门。在我们国家，司法不公，政法委，纪检一手遮天，公检法一家流水线制造冤案，政治办案，领导凌驾于司法之上，权大与法，政治挂帅，发生冤假错案没有纠错能力，他们为了面子可以牺牲法律和程序正义，所以旧冤未了，新冤又出。每年冤假错案越来越多，冤死的人大有人在。\n\n一：做为访民要了解以下几个现实：\n1：信访制度是国家用来骗人民和制衡地方政府的一种工具。对人民可以起到欺骗作用，欺骗让你相信有包青天，欺骗你相信上面是好的，欺骗你一直浪费在上访轮回路上。另一方面用信访制度制衡地方，访民成为它们的工具，用这个工具来考核地方政府的政绩，还可以让国家信访局有关人员敲诈地方的一个发财途径。所以上面整天装成没看到地方截访、买卖核销名单、黑监狱、暴力等存在。其实最高决策者也知道信访制度是无用的，但信访制度是对它们来说是个好工具，所以一直不取消。\n2：想通过上访信访来解决冤案的几率非常小，就如儿子犯错，你找它爸爸爷爷，当然它们会保护，加上它们是从不认错反省的一个流氓集团，所以你叫它们认错纠错就等于要它们的命。\n3：上访信访是一件劳命伤财的事，而且风险性极高，你可能被截访，被关黑监狱，被拘留判刑劳教，被自杀，被强奸，被侮辱，被软禁等等，可能还会累及家人。精力，金钱，时间上更不用说了，所以上访是一条不归路。\n4：司法不公的根源在于这制度，这种制度不改，法律都是摆设。上下都是一样的腐烂，不要有包青天的情结，最坏的人都在上面。在这种制度下你千万不要相信法律，好人在这种恶制度下也会变坏，个人面对这个制度是无能为力的，不作恶已经算仁慈了。\n5：千万不要相信北京的各种所谓什么都能搞得定的能人，律师，记者等，骗子最多的在北京，不要轻易相信，特别涉及到钱，只要涉及到钱，基本都是骗子。向媒体求助和寄希望的事情尽量少做，因为目前在中国，媒体基本都是喉舌，为它们服务，它们对此类的事不感兴趣，更不敢报道，除非你运气好遇上好人。\n6：用自杀、自焚、下跪、伤害自己，和伤害无辜百姓方式来解决问题是最愚蠢的方式。用自杀、自焚、下跪、伤害自己方式不但它们不会同情和解决，还会被鄙视和嘲笑，可能还会被戴上罪名，网民也反感这种做法。当然大家敬重杨佳等捍卫尊严的方式。\n二：访民如何诉求呢？\n1：诉求要基于一个前提，那就是案子确实是被冤枉的，不是无理取闹，只有诉求合理合法于法有据，才会赢得尊重和支持。不能凭空想象和捏造事实，更不能无中生有，恶意诽谤，所以真实性，于法有据，和保存证据非常重要。虽然法律在它们眼里是玩物，司法程序可能是走过场，我个人建议还是要先走司法程序，请专业的人帮你，提供有效的证据，写诉求时不能用个人情感和情绪写文书，需要真实可靠的相应证据和法律依据。寻找案子切入点很重要，要抓住重点，不要在一些无谓的问题上纠缠。\n2：司法程序途径如果走到尽头走不通的时候，或者案子拖太久无法解决的时候就得另辟蹊径寻求解决方案，不要再走上访这条老路，在这国度，你要面对现实。\n3：在各种司法渠道走不通的时候，我个人建议采取最原始的方式来诉求，比如，冤有头债有主，找给你制造冤案的人。你把时间浪费在轮回的上访路上，不如直接找制造冤案的人。既然你翻案无望，那么也需让它们付出代价，当然不是采取暴力行为。有时你不诉求自己案子的时候，反而会得到你想要诉求的。你可以搜集制造冤案的人或者现在负责的人所有信息，你中南海，国家信访局都能找得到，难道找不到自己生活城市制造冤案的领导吗？有的访民连死的勇气都有，难道连“关心”领导的勇气没有吗？你可以用拍摄，录音，跟踪等等方式去了解它们的各种违纪违法行为和腐败生活，找到证据很重要的。当然它的父母小孩，二奶等也是你关心的对象。它们去的腐败风月场所，你也要去看看，你没事可以天天去领导家，它二奶家，它子女学校和单位逛逛，问候它们，关心它们。问领导是否需要换煤气，帮忙扛，问领导是否要帮忙接送小孩，也可以提两斤水果去领导家拜访，千万不能用暴力包括语言暴力和威胁，要和气，要持之以恒的关心，记得要微笑，要温馨，要和领导相亲相爱一起共建“和谐”社会！\n4：针对一个单位和部门永远比针对领导个人来的笨和无效，因为你针对一个机器，谁也没责任，谁都不害怕，针对具体人才是最有效的方式，当然要找大的。领导最怕什么，它们最怕的是丢官帽，所以你不要做它们不痛不痒不害怕的事，它们最怕什么，你就做什么，但这里讲的不是使用违法手段和使用暴力，是公民在法律允许下所采取的各种行为。有时针对某一个人，用别的事情来攻击它，你有资本逼迫它的时候，你的问题反而能得到解决，因为你抓住它的痛处，它想息事宁人。要充分利用制度上的相互制约机制来牵制、消耗、折腾它们，尽量利用内部狗咬狗的机会。\n5：充分利用互联网成本低传播快的特点，平时多上网学会上网。微信、微博、推特、G+，facebook、论坛等都要充分利用，要和外界保持信息畅通渠道，一旦有危险，大家可以帮忙呼吁，尽量把信任的人和经常联系的人还有家人做个信息相互备份，一旦几天没消息出事了，大家都会知道，而且可以联系到家人和网友。网络上一定要遵循实事求是，不能夸大造谣的原则。\n6：网上网下可以采取各种形式的诉求，各种行为艺术、恶搞、抗议、罢免、申请作恶官员财产公示、举报控告、各种信息公开\n、联名等等，要懂得用别的案子来揭露它们，不单单停留在自己的诉求，要注意一点，不要被抓住把柄，以免被它们做文章迫害。\n7：找对方软肋和为自己找筹码这是维权的核心，如何找软肋？如何为自己增加筹码？这是需要用脑子的。尽量不要把路走死，适当的妥协也是需要的，在恰当时机做出恰当选择。\n8：线下多参与本地和相邻地区访民、网友的交流和饭醉，团结才有力量，要大家同心，有事一起围观呐喊。多多参与各种社会事件围观，认识更多志同道合朋友，认识多了人，自然渠道和力量就多。\n最后补充一下：如果真的解决无望的时候，我个人建议你放弃，先调整自己，先过上正常生活后，慢慢再寻找机会再来折腾它们。\n大家要知道大的环境不改变，个人的事情是很难改善的，所以你要融入大的环境诉求与改善当中去，在你还没有被伤害的时候就要去关注这个社会，去关怀别人，参与各种公共事务，不要等到自己被伤害的时候才醒悟。不要整天诉求自己的事而不去关注别人的事和其它公共事务。不要整天要求别人关注你，而是你要多去关注别人，这样道义资源才会有，道义资源多了，你的力量就强大了。我看到有一些人从诉求自己的案子改变成诉求整个社会环境改变的路子上去，结果他力量变大了，知名度也有了，自己的事也得到解决和改善，这是最智慧和正确的做法。因为你付出了就会有回报，就如我付出介入一些社会公共案子，当我出事的时候，很多不认识的人为我呐喊和帮助，这社会是相互帮忙和相互温暖的，在你需要别人帮你的时候想想自己为别人付出了什么？所以你要经常的去围观，线下交流，与各种人群融入，积极参与各种公共事务，努力传播真相，揭露谎言，拒绝洗脑，不合作，一起推墙，相信不久的未来，经过大家一起努力，公平正义一定会到来的！\n\n```\n                          超级低俗屠夫（吴淦）\n                             2012/3/4\n```"
		},
		{
			"post_id": 359,
			"title": "惩罚人权恶棍",
			"date_published": 1497498259.14,
			"body": "![6.jpg (0x0)](data/img/post_359_6.jpg)"
		},
		{
			"post_id": 356,
			"title": "上海南京路民众大规模示威",
			"date_published": 1497255325.502,
			"body": "<video src=\"data/video/17.webm\" controls=\"\" autoplay=\"\" width=\"600\" height=\"400\">your browser does not support the video element.</video>"
		},
		{
			"post_id": 355,
			"title": "蒙藏维满港大起义计划书",
			"date_published": 1496992990.703,
			"body": "<div class=\"body\">1,用1-2个月传播大起义的消息。要把大起义的消息传遍藏地，维地，蒙地的每一个村子。中共的垮台只需要1-2个星期，所以，在消息没有传遍各地之前不必匆忙发动大起义。要达到蒙藏维满港遍地都知道，人人都知道很快要发动大起义了这样的效果。\n\n2,要把大起义大致的时间及地点传播给每一个人。要让每个人都知道在中共所谓19大之前将发动全民大起义。要让每个人都知道大起义不会迟于中共的所谓19大。这样能让中共的地方高官无法去北京开什么19大，要让他们整天惶惶不可终日，处于戒备防范之中。\n\n3,要把起义的形式与地点传播到每一个村，每一个人。蒙藏维满港大起义不是武装起义，是全民占领中心城市的广场，包围中心城市。西藏全民向拉萨集中，包围拉萨，占领拉萨的中心广场。南蒙古全民向呼尔浩特集中，包围呼尔浩特，占领呼尔浩特。新疆南疆全民向喀什与和田两地集中，包围喀什与和田，占领喀什与和田。北疆向乌鲁木齐与和田集中，包围乌鲁木齐与和田，占领乌鲁木齐与和田。\n\n4,起义的准备工作。发动大起义要准备很多大小看板，用来与前来镇压的军警对抗。靠近中心城市的人要多做一些，可以分发给远处赶来的人。看板用来向军警展示中共官员的腐败信息，展示中共官员在欧美国家的财产，展示中共官员家属在欧美的生活。还要用木板做一些盾牌，用来保护自己，避免被军警打死打伤。起义者也要准备一些干粮与饮用水。还要准备一些露宿的毛毯，防雨防水的材料。特别还要准备一些对讲机，防止手机通讯被中断。\n\n5,起义的口号。初期口号【落实内蒙古地区真正自治】，【落实新疆地区真正自治】，【落实西藏地区真正自治】，【反对中央指派自治区领导人】，【自治区全民选举自治区领导人】。内蒙古地区可以以庆祝内蒙古自治区成立70周年为号召集会游行，并向呼尔浩特集中。\n\n包围中心城市，占领中心城市广场以后将口号改变成【废除一党专制】，【打倒腐败政府】。一旦转变成暴力对抗，立即将口号转变成【独立建国】。\n\n6,起义的策略。农村以村为单位，城镇以镇为单位，全体民众集体行动，结团向中心城市集中。这样少量的军警无法阻挡。沿途的政府部门，警察机构一概回避，这些都不是大起义的目标。绝对不要冲击途中的政府部门及警察机构。中共历来惯于制造事端嫁祸于人，途中看到有人冲击政府部门，警察机构，不要围观，不要停留，更不要参与。制造这种事端无非是想嫁祸于人，并且分散向中心城市集中的人数。\n\n行进途中遇到少量中共军警阻拦，想办法绕过去。遇到大量中共军警阻拦，即不前进，也不后退，避免冲突，立即就地安营。人群不要分散，将各种展示板围成圈，向前来阻挡的军警展示中共官员的腐败，并坚守在展示板圈内。不要怕拖延时间。如果在远离中心城市的地方能拖住大量的军警，那么中心城市就很容易被其它民众占领。如果在中心城市附近拖住大量军警，那么远处的民众就能源源不断地赶来。\n\n西藏，内蒙古各500-600万人口，中共10万20万军队是无法阻挡的。维吾尔族1000万人口中共根本就无法阻挡如此多的人群。\n\n注意与各地保持通讯联系。现场情况即使向网络传送。\n\n7,一旦占领了中心城市的广场，就要把口号立即改变成【结束一党专制】，【实行民主制度】，【推翻共产暴政】，等待沿海地区响应。如果沿海地区迟迟无法跟进响应。蒙藏维满港就应该采取果断措施，寻求独立建国。\n\n8,如果被军警阻挡在中心城市周边，无法占领中心城市，就长期围困，等待事态进一步变化，等待国际力量的支持。\n\n9,正确应对军事戒严。一旦中共实施军事戒严，喀什地区要立即转变成武装起义，全力夺取喀什，独立建国，成立喀什共和国。喀什独立了，南疆就可望了。其它地区尽力配合，但无需都转变成武装起义，要根据形势的发展决定，等待下一次大起义。\n\n10,新疆2000万人口，维族仅1000万人口，必须尽力避免发生维汉冲突。要识破中共挑起维汉冲突。新疆有大量从上海发配充军过来的知青，要向他们传递吴越正在争取独立的信息。要让他们都知道吴越独立以后他们都可以回到上海，享受吴越共和国公民的待遇。要争取他们共同参与大起义，至少不能对立。\n\n11,大起义的最低目标是把公开与普世价值对抗的习近平赶下台，最高目标是各地独立建国。所以要尽量联合各地的反习势力，支持这些势力在19大把习近平赶下台，作为交换，获得一定的政治空间。达到释放伊利哈木，释放因政治原因被捕的藏人，蒙古族人，释放709案当事人，及其受习近平政治打压的其它人权活动人士及维权人士，这个最低目标不难达成。\n\n</div>"
		},
		{
			"post_id": 351,
			"title": "共产党为什么这么黑！",
			"date_published": 1496574960.146,
			"body": "<video src=\"data/video/16.webm\" controls=\"\" autoplay=\"\" width=\"600\" height=\"400\">your browser does not support the video element.</video>"
		},
		{
			"post_id": 347,
			"title": "对郭文贵先生讲几句话",
			"date_published": 1496287472.001,
			"body": "<div class=\"body\">1,你的爆料在国内传播范围相当有限。你的爆料只在关心政治的人中间传播。但是，大部分的中国人不关心政治，或者不敢关心政治，所以你的爆料在普通人中间没有传播。现在我在google上根本都无法搜索到你的推特。\n\n![3.jpg (0x0)](data/img/post_347_3.jpg)\n\n---\n\n2,中国翻墙的人数我做过评估，大体在20万至30万。原因也是很简单的，翻墙浏览的效果太差，很多人不愿意翻墙。更多的人不会翻墙。三大社交网站对中共低三下四的原因就是经常翻墙的人实在太少。推特上关注你的人大多数都是在海外的留学生，海外大部分的留学生并不是你可依靠的基础，因为他们家庭的原因，他们是中共的社会基础。你可以从白宫签名网站的签名看出，为什么签名要求美国政府把你遣送回大陆的人数会有这么多？在你爆料之前，这些签名的人有几个知道你？\n\n3,海外所谓民运人士绝大多数也不是你可以联手的力量，他们中的绝大多数智商太低，不足以成事。他们的智商稍微高一点，零网早就有大量的新闻博客了。他们中的绝大多数感兴趣的是在一个自己的很小的圈子里传递信息，他们的民主运动与国内普通民众没有什么关系，基本上属于自娱自乐的民主运动。\n\n4,国内的访民是你可以联合的力量，但是他们是要有人引领的。老兵是你可以联合的力量。国内的底层民众是你可以动员的力量，可是你先得把信息传递给他们。逃亡海外的一些企业家是你可以联合的力量，他们很多都是实干家，有真实的能力。\n\n5,国内的私人企业家是你可以联合的力量。\n\n6,蒙藏维2千万人口是你可以联合的力量，这个力量是非常强大的。因为他们追求的是民族独立，是全民族的事业，是义无反顾的。如何将你的诉求与他们的诉求结合起来，共同行动，这是你要考虑的。\n\n7,目前最要紧的是如何将你的爆料尽量向国内普通民众扩散。\n\n</div>"
		},
		{
			"post_id": 341,
			"title": "独立建国，铲除腐败。",
			"date_published": 1496064796.776,
			"body": "![8.jpg (0x0)](data/img/post_341_8.jpg)![9.jpg (0x0)](data/img/post_341_9.jpg)"
		},
		{
			"post_id": 339,
			"title": "郭文贵爆料王岐山家人上亿美元贪腐",
			"date_published": 1495872895.712,
			"body": "<video src=\"data/video/14.webm\" controls=\"\" autoplay=\"\" width=\"600\" height=\"400\">your browser does not support the video element.</video>"
		},
		{
			"post_id": 337,
			"title": "我的父亲是流氓",
			"date_published": 1495861357.299,
			"body": "1\n父亲要死了。\n我是从雪姨发来的电报知道的。我向学校请了假，乘火车往老家赶。一下火车，就看见二弟高阳傲视天下般地立在站台边。他见我走来，只是点了点头，提过我的包就往停车场走。直到跨上他那辆白色的宝马，才说了一句：“老爷子真是的，死都死了几次了。”\n\n---\n\n我跟着二弟来到父亲的病房。病房里有许多人。雪姨和我大弟都在病床边，用哀伤的眼神看着我。病床上的父亲已经失去知觉，双目紧闭，那两条粗黑的剑眉还是那样显得威风凛凛，只是浮肿的面部给人一种有点夸张的感觉。医务人员在忙碌，他们应该比谁都明白这些忙碌并没有多少意义，只不过以各种无效的抢救来等待那必然的最后结果。\n雪姨将我们兄弟三人叫到病房外的陪护间，对我说父亲得到了本市最好的治疗。我绝对相信雪姨的这种有点表功意味的说明。这不仅由于父亲曾是这里的最高领导人，更主要是他有一个现为常务副市长的二儿子高兵及一个号称千万富翁的三儿子高阳。而作为书生的大儿子我，绝不是能让父亲享受这种待遇的理由。\n雪姨很有主见地安排着父亲的后事。尽管她比我还小一岁，但作为父亲的第三任夫人，我们还是愿意听她调遣。雪姨叫高兵与市委领导商量父亲的悼词和追悼会的规格，要高阳负责通知亲朋好友并主管日常事务，要我准备一份家属发言稿，表示亲人们的崇敬、悲哀及感激之情。为完成雪姨交给的任务，我不得不回顾父亲即将结束的一生，思考亲人们心目中的父亲。这是几十年来我最不愿意想的问题了。然而，当我像平时从事科学研究一样分析父亲那久远的历史后，我发现，尽管父亲的一生复杂而富有传奇，但大体上可分为三个阶段，而且这些阶段具有里程碑意义的是三个女人。这三个女人就是父亲的老婆我妈、父亲的爱人高姨以及父亲现在的夫人雪姨。有了这一发现，我竟然兴奋起来。\n2\n父亲和我妈的故事发生在我的老家，也就是湖南南部的永州市远郊一个名叫黄沙塘于家的小村子里。永州这个地方，由于一位很有名气的文人写过一篇《捕蛇者说》而闻名于世。事实上，我在这里生活过十二年，却很少看到蛇，更不要说专事捕蛇的人了。\n父亲大约生于一九二一年五月，具体哪一年我是没有办法搞清楚的。因为，父亲的各种人事表格有关出生年月变化较多。在讲究资格的年代，父亲将其出生年月定在一九一六年五月；在领导干部年轻化的时候，报上公布父亲的出生年月却是一九二六年五月。两者相差有十年。如果取中间数，也就是一九二一年比较合宜。\n据说，我父亲的父亲，也就是我爷爷，曾到省城长沙读过书，后来成为了当地较富有而深得乡邻尊敬的绅士。父亲是爷爷的独子，爷爷又是老爷爷的独子，也就是父亲一家是三代单传。奶奶在三十多岁才有我父亲，就更视为掌上明珠。但在父亲十六岁那年，我父亲的父亲以及父亲的母亲相继去世了，父亲也就成为了孤儿。\n本来父亲对家里事是从来不关心的。因为是家中的独苗，所以在十岁前一直跟随在他母亲身旁，到十岁才开始进村里的学堂。成了孤儿后，他不得不理会家里的四十多亩土地和近二十间房子。当然，具体的事情都是由长工做的。如果，后来父亲不因赌博而输掉了全部家产，解放后父亲肯定是个地主，而且是一个从十六岁就开始剥削劳动人民的吸血鬼。\n父亲成为赌徒是在他父母去世半年后的事。也就是在他快十七岁的那年冬天。最初是他远房堂兄于朝龙带他去玩一种当地很流行的押大小的游戏，赌吃喝，慢慢地就直接玩起钱来了。从小到大，越玩越想玩。大约二年光景，父亲就将祖传的四十多亩良田和二十多间房子全玩完了。其中有一半成为了他堂兄于朝龙家的产业。当于朝龙一家搬进我家祖屋时，父亲哭着住进了于朝龙家废弃的牛栏房。从此以后，读过六年书的父亲开始成为了村里最不受欢迎的人。谁家少了东西首先想到的就是我父亲。村里人开始忘记了他的姓名，都叫他收账鬼。他就在东摸西拿中度过那艰难困苦的日日夜夜。好在当时日本鬼子也经常进村，人们对收账鬼的作为也就不太计较。\n在父亲二十三岁那年，他还是单身一人。那时都习惯早婚，二十三岁尚未婚配很能说明这个人的品行和家境。可人的青春期生理要求并不因没有金钱而丧失。没有钱上赌场时，他就像个发春的公牛，在村子里四处游荡。特别是夜深人静之际，青春分泌物使他像夜游神一样听过许多家的墙根。这就成了村里人的心病。他们总是叫女儿媳妇们千万注意，切不要答理收账鬼，最好是看到他就远远地避开，不然可能有危险。事实上，父亲从没当面对什么女人有什么过分的举动。但村里人在夜间行夫妻之事时，再也不敢像原来那样放荡了。据说，有人还因害怕收账鬼听墙，成为了阳萎。若干年后，我作为学者，曾对那几年村里人口变化进行过调查分析，我发现，在父亲二十岁到二十三岁那几年，是于家村人口出生率最低的年份。由于没有发现其它原因，我就认定与父亲听墙有直接的关联。\n可见，父亲的行为已经严重地影响到于家村的生存和发展了。最要命的是，村里人也意识到了这种危机的存在，而且，随着日月的推移，这种危机感也就越来越压抑人心地在村中弥漫。终于有一天，村人不约而同地找到已是村中首富的于朝龙，商量如何解决收账鬼的问题，尽管有人主张送官法办，但苦于没有可以送官定罪的事情和证据。最后，村人们只得同意，给收账鬼找个女人并租二亩村里的公田给他养家立命。\n于是，村里人就行动起来，到处访那些难寻婆家的女子或死了老公的寡妇。可想而知，方圆十里是不可能有收获的。有人大骂了那些提亲的人还扬言，就是死也不将自己女儿嫁给收账鬼。\n正在村里人万分为难之时，村里来了二位从河南过来讨饭的母女。事情也巧，母女俩刚踏进我们村，母亲就倒下了。村里人循着那女孩的哭声，才知道那老要饭的死了。于是，村里人叫来了于朝龙。于朝龙没有看那已经死去的母亲，而对那个正在伤心但已无力哭泣、可能有十五六岁但骨瘦如柴、相貌极为普通甚至可以说有点丑的姑娘看了好一会。他和蔼且富有同情心地问了姑娘一些问题，当知道姑娘的父亲和兄弟已在早几年走日本时就死了，唯一相依为命的母亲也饿死在这千里之外的他乡时，于朝龙就高兴起来。他叫人立即将我父亲从赌桌旁揪了过来，本来因没有赌资只能当观察员而气恼的父亲，一听将这个姑娘送给他做老婆，也高兴地叫起了朝龙哥。于朝龙就让村里人将姑娘的母亲埋在后山的野地里，叫家人拿点高粱饼就将姑娘送进了我父亲借住的牛栏房。这个于家人连姓名也懒得知道的女人，就是我妈。\n父亲是在我妈用眼泪吞食高粱饼时将她变成女人的。可以想象，一个刚死了母亲、自己又快饿死的少女，对食物渴望和对性的需要，态度应该是完全不一样的。可对一个二十三岁还没有亲近女人的健康男人来说，有了属于自己的女人还要等待那也是要命的。于是，在我妈用黑黑的手扼住那块高粱饼拼命往肚子里送时，我父亲用力剥下了她少得可怜的裤子，像猛虎下山一样顺势长入。也许是想起了刚死的母亲或是由于父亲的粗暴给她刚因有了食物而恢复知觉的肉体带来的痛苦，在父亲没完没了的动作中，我妈小声地哭泣起来。我妈的哭声使已心满意足的父亲大为恼火，他动作很大地穿上裤子，对着我妈血淋淋的下身就是一脚，大声地说“妈巴子的，饭也吃了，娘也埋了，让老子快乐一下就哭，哭个屁。”说完转身就走，不用说肯定是到赌桌边观战去了。\n自从有了自己的女人，村前村后就再不见父亲深夜四处游荡的身影了。父亲有钱时一定是在牌桌上，没有钱就折磨那个属于他的女人。因此，在他借住的牛栏里，经常传出打骂声和女人悲凄的哭泣声。还算善良的村人，每当看到被打得面目全非的我妈在租种的二亩地里劳作时，也会生出一些内疚。“唉，真是个命苦的女人。”当然，只是说说而已，心中更多的还是为自己家的女人不用再担心那发春的公牛而暗暗地窃喜。\n村里人最终发现，他们的如意算盘还是打错了。父亲虽然再不会因雄性分泌物去侵害他们的女人，但并不是说父亲因需要赌资而放过他们的财物。就在父亲将我妈的肚子搞大，也就是怀上我的第七个月，终于发生了于家村自有文字记载以来最大、最严重的事件。\n事情的经过很简单。父亲在邻村赌博欠了钱，在深夜很不情愿被赶下了牌桌，只能回去将女人折腾一番。在经过原属于他家而现在成了他远房堂兄于朝龙家产业的院子时，一股恨意油然而生。胆因怒生，他熟悉地翻过院墙，潜进了书房，就象在自己家里取物一样拿过几件值钱的器皿，正要离开时，被他堂兄的小老婆发现了。这个娇小的女人，本来因这晚没有得到应该属于她的春宵而愤愤不平，难以入眠。所以，不顾天寒地冻，决心到另外两个也是小老婆的女人窗下察看一下，她要知道是谁侵占了应属于她的一夜，好明天找老大诉苦。她刚走出房间，就象见到鬼一样发现了我父亲，不由自主地大叫起来。这一叫，就苦了我父亲，他被吓得站在院子中央，不知所措。当于朝龙和家人们用乱棍将他打倒并捆成粽子押到于家祠堂后，他还没有回过神来。就在村人们因将我父亲送官法办还是以族规处置发生争吵时，我妈腆着肚子来了。这个没有姓名而且很少在村人面前说话的女人，还是那样一声不响，跪在地上，对每一个村人磕头。看到这个架势，事主于朝龙就说：“这次算了，放他一马，下次如果再犯，老子要了他这条狗命。”\n历史已经证明，地主于朝龙犯了一个致命的错误，他不仅无法要了我父亲的狗命，最终到是让我父亲将他送上了西天。\n松了绑的父亲同我妈默默地回到了牛栏房。在我妈用盐水清理他被恶打的伤口后，他默默地呆坐了好一会，眼中显露出一股杀气。他拿了家里唯一的半盒洋火，什么也没有说，甚至连看也没看我妈一眼，就走出了那个借住的牛栏房，溶没在茫茫的黑夜中。不大一会，于朝龙的书房，也就是我父亲的父亲建造的书房发生了冲天大火。\n那是一场很大的火。村里人说，自立村安家以来，黄沙塘于家就从来没有这样火红过。那火将于家半边天都烧红了。如果不是村人奋力扑火，就会将整个天都烧没。后来，在父亲成为一位共产党的大官时，村里人传言，在发生火灾时，有一条火龙冲天而上。那条龙就是父亲，这把火将压在他身上的厄运全烧掉了。父亲在自传中却称：主席教导我们说，哪里有压迫哪里就有反抗。为反抗恶霸地主的欺压，我勇敢地烧掉了他的家，义无反顾地参加了“革命”游击队。事实上，父亲放完火后，就不分方向地拼命跑。天亮才发现，他竟跑到了离家三十里地的大山边了。于是，父亲就潜进山林，用野果充饥。不日遇上了被国民党称为土匪的共产党游击队。带队的看他年青力壮，就叫他跟着一起干，给他饭吃。正处于饥饿而无处可投的父亲一听有饭吃，想都没想就同意了。由于父亲读过几年书，在这支大都由本地赤贫的流浪者组成的队伍里算是有文化的了，不久便成了带队的勤务兵。随着队伍的扩大，带队的从队长成为了司令，父亲也就成为了这支“革命”队伍一个队的副队长。我读大学时，为研究流氓无产阶级的命运和心理，读过许多著作。我在共产党的创始人那部有名的选集中读到过这样一段话：那些失了土地的农民，是人类生活中最不安定者。处置这一批人，是中国的困难的问题之一。他们很能勇敢奋斗，但有破坏性，如引导得法，可以变成一种“革命”力量。每读到此，我都会深深地感到共产党领袖们的伟大。只有他们才能这样深刻地认识父亲这些在当时中国普遍存在的群体，而且那样成功地将他们塑造成为伟大的“革命”战士。\n我是在父亲放火亡命天涯后的第三个月出生的。父亲纵火后，我妈并没有离开于家村。一方面她怀着我已有七个月，更主要的是她无处可走。村里人看着她老实本份而且可怜，或许是怕父亲突然回来放火，也就没有太为难我们母子。我妈就种着那二亩公田度日。于朝龙家看在族人的份上，对我们母子还算照顾，有时甚至有意保护我们不受欺负。按照辈份，他让我叫他朝龙大伯。\n我第一次见到父亲，是五零年初，那时我已经四岁多了。有一天我们村里来到好多人，直奔朝龙大伯家，一会儿就将朝龙大伯和他的儿子们全部捆绑着押了出来，全村的人都集合到了谷坪中，听一位穿黄军装挎盒子枪的人讲话。那人讲完之后，手一挥，有几个和他一样装扮的人就将朝龙大伯押着往后山走，一会就听到了几声枪声。之后，村里的人有点畏缩地将我和我妈推到那讲话的人面前。那人一改刚才讲话的那气愤的神态，很和蔼地抱起我说，“这就是我儿子？”。村里人连忙讲，“宁子，快叫爹啊”。我看着妈，妈点着头。但我感到要尿尿，于是就叫起来，“快放我下来，我要尿尿。”那个抱着我的人，也就是我父亲，很失望地将我放下来，又大度地打了我屁股一掌说，“妈巴子的，连爹都不会叫。”\n那几个押走朝龙大伯的人回来后，父亲就带领他们走了。连他曾住过的，我和我妈现正住着的牛栏房都没有进去过。\n父亲走了后，朝龙大伯家里大小都哭了起来。村里人帮着他们将朝龙大伯埋在后山于家的祖坟中。我要跟去看，我妈很紧张地将我拖回家，并在大白天就将门关上，对我说，“宁子，以后别乱走，千万别到朝龙大伯家里去。”我不解地看着妈，她好像做了对不起人的事一样。待了好一会，她流着眼泪又说，“好在你爹当官了，要不了多久就会接我们走，不然，我们在村里如何做人啊。”那以后，村子里面很热闹，先是朝龙大伯一家从那高楼大院搬了出来，住进了我家住的牛栏屋。我和我妈及原来最穷的几家搬进了大火后朝龙大伯重修的我家祖屋里。\n对村子里的变化我是能感受到的。事实上我自己也在变化，其中最大的变化就是老到村口去玩，盼着父亲能接我走。有时也等来几个同爹一样着装的人，他们有的也到我家坐一会，或带点吃的穿的东西给我们，并告许我爹已经从部队转到县上工作了，当了什么县公安局长之类的，但就是没有带我们到城里面去的意思。因此，我很失望。\n父亲再没有回来。快过年了也没有父亲回家的任何消息。于是，腊月二十九我妈决定到县城里去了一次。本来说好要带我去的，后来妈说，最好能去接你爹回家过年，要当天去当天回，所以让我在家等爹就行了。当天傍晚，妈回来了，是一个人回来的，没有父亲的影子。我问妈，妈什么也不说，只是坐在那里发呆。于是我就吵着要爹，呆坐着的母亲突然将我一把推到在地，狠狠地打着我的屁股，鬼哭般地说，“你哪有爹。你爹早就死了。你爹才是个流氓。”\n数年后，我才知道，那天我妈在县城好不容易找到我父亲时，父亲正和几个青年男女在研究工作，其中有个长得很美的女人同父亲坐在一条长椅上。父亲见我妈胆怯地由警卫员领着站在门外时，刚才的笑容一下就没有了。他威严地近似咆哮着说：“谁叫你来的？”将所有在场人都吓住了。警卫员立即揪住我妈就住外拖。将我妈拖进门房后，警卫员厉声地追问我妈：你不是说，是我们局长的老婆，为什么局长一见到你就发火呢？我警告你，假冒局长的老婆就是流氓，流氓是要法办的。我妈早被吓得一句话也不敢说，听说这样来找老公是流氓，是要法办的，就连忙独自往家赶。\n不久，就有人从县上来我们家，对我妈说，你与我们局长成为老公老婆是地主于朝龙包办的，现在政府不承认，你就在这张离婚书上押个手印。我妈呆呆地一声不响地押了个手印。好像对父亲休妻早就预料到了一样，平静得很。只是在来人说要将我带回城里去时，我妈哭了起来，她低着头喃喃地说：带走我的宁子我就不想活了，我就死，我就死。县上的人见这样，也就没有说什么走了。我长大后就想，父亲可能根本就不想带我进城，这不只是他那时工作忙，更主要的他正在同他的“革命”同志恋爱，如果有我在身旁那不大煞风景。\n我妈是在一九五八年饿死的。那时，父亲已经是邻县的县委书记，也就是一位七品父母官。由于我一直跟我妈生活在老家，父亲还不时叫人送点吃的东西给我们母子俩。但我从来没有发现我妈吃一口，就是在她因缺食品饿得快不行时，也绝不动父亲送来的食品。她最终同她母亲一样，也饿死在黄沙塘于家这个陌生的村子里。所不同的是，她母亲留下的是一个也快饿死的无依无靠的小女子，而她留下的则是有一个已为父母官的父亲的我。\n3\n父亲和高姨的故事，是那个年代最普通最平常的事情，可以说没有半点传奇色彩。刚解放那时，“革命”队伍的同志们，大都要按电脑程序一样完成人生的一件大事，这就是没有结过婚的要选美定亲，原来有结发夫妻的要按“革命”条件”进行重新审查，能换的就尽量换。自古来，就将江山和美人联系在一起的。“革命”成功了，江山归同志们了，没有美人相伴也就违背了古训。何况“革命”队伍中美人多得很。高姨就是父亲领导下的“革命”队伍中的大美人。\n高姨出生在大城市天津一个工厂主家庭，其父亲拥有当时天津较有名的纺织厂。高姨是这个资本家最小的女儿，受过很好的教育，是共和国首任总理夫妇的校友。也许正是南开的“革命”激情的影响，高姨在十八岁那年参加了南下部队来到了湖南，后来就同我父亲一样转到地方从事新政权的建设工作。在我父亲担任县委书记时，高姨就是这个县的妇联主任了。\n父亲是在与我妈办完离婚手续不久与高姨结为“革命”夫妻的。起初是情窦初开的高姨爱上了年轻有为的县委书记的。她感到这个大她许多的男人，是那样优秀的。他出身赤贫，苦大仇深，经过“革命”的战争洗礼，那样具有“革命”的理想，有为“革命”事业献身的精神。就是他表现出来的粗鲁也应该视为“革命”者的粗犷和豪气。当父亲知道高姨爱上他时，更是欣喜若狂，立即请来了他的老首长，在他的老首长及其新夫人的主持下，举行了婚礼，组建了让多少人眼热的“革命”家庭。\n我在我妈死后的第三天由村里人送到了父亲和高姨家。我妈死了，村里人没有通知我父亲。村里人说，他已经将她休掉了。这么多年他又从来没有回来过，现在又当了那么大的官，还是不要告诉他了吧。于是，我这个孝子作为唯一的亲人，在大家的帮助下将我妈埋葬在她母亲的坟墓旁。但对只有十二岁的我以后如何生活，被饥饿折磨的村里人却一致认为，应该将我送到城里面去。他们说：当了官不要老婆自古以来多着呢，就是做了皇帝也会要儿子的。于是，我和两位算是本家的村里人来到父亲任职的那个县，好不容易找到了县委大院，站岗的却不放我们进去，说先要通报。村里人就说，你告诉他，他原来的老婆死了，我们给他送儿子来了。过了一会父亲的秘书就来了，将我们接到父亲的办公室。父亲很有教养地拉了一下村里人的手，并习惯地将手伸向了我。见我害怕一个劲往后退，父亲就用他那双大手抚摸了一下我的头说，“宁子，几年不见长这么高了，有十二岁吧。”村里人的诉说我妈死了，孩子太小，不是村里人不愿意抚养，而是怕跟着学坏。父亲先是有一些吃惊，然后中气不足地说：死了就没有办法了，宁子是我的儿子，就放在我这里吧。之后就叫秘书陪村里人去食堂吃饭。\n这是父亲为官后第一次请村里人吃饭。特别是在那个充满饥饿的年代，请人吃饭是给人很大面子的。这种事对于家村的人来说，更是如此。刚解放后不久，父亲在县城当官后，村里有人来找过他。有的为了找个工作，也有为了各种难事来请求帮助。父亲都拒绝了。只要有人提出此类要求，他就会说，“你认为共产党的江山是我的，我想怎样就怎样。想参加“革命”，不要说好听的，原先为何只知道在家抱老婆过日子，为什么不像我一样提着脑袋参加游击队？！”慢慢地，就没有人再找他了。这些事让还不是我父亲爱人的高姨知道了，她以无比崇拜的心情写成了文章，在报上说父亲“革命”性和原则性很强，不利用职权为亲友谋福利。我想，父亲看后会在心里说，“妈巴子的，狗屁亲友，老子落难时谁都欺负我这个孤儿。”然后就会黯然神伤地沉默好一会。对父亲十分明显可以说还有点仇恨的回避，村里人是明白的。也许对原先欺负过这个无依无靠的孤儿感到内疚和后悔，慢慢地村里人就不再找他了，大家闲谈时也尽量不提他，好像他与于家村没有什么关系。只是在与外村人提起父亲时，那种自豪感就特别明显。这一次，村里人因送我而享受了这难得的一餐，那兴奋之情可想而知。只是让他们感到遗憾的是，父亲没有同他们坐在一起共进午餐。\n村里人吃完多日不见的白米饭，心满意足地走了。我坐在父亲的办公室不敢直视这个陌生却十分想念的父亲。父亲用电话叫来了一位女人。他们低声地谈论着什么，父亲是同她用官话加家乡的土话说的，从我能听到的，他妈饿死了，送他到寄宿学校等片言只语中，我知道他们在谈论我。最后，那女的说：“他终究是你儿子啊，就让他和我们生活在一起吧。”说完就走到我身旁，拉着我的手，对我说，“宁子，我们回家，好吗。”我看着父亲，只见他眼含着热泪，用感激的声音对我说：“还不快叫妈。”见我没有开口，那女人就说，“就叫高姨吧，好吗。”\n这是我第一次见到高姨。看惯了村妇的我，简直没有办法形容她的美丽和气质。那时的高姨，已经同父亲为“革命”制造了两个“革命”接班人”，这就是我四岁的大弟高兵和二岁多的二弟高阳。她作为少妇区别于少女的只是那本来圆滚的胸脯和臀部更加圆滚，更加鲜嫩。她的笑是那样灿烂，好看的红晕印着两个令人心醉的酒涡。她全身上下，一举一动都体现出知识女性的矜持和圣洁，善良而贤慧，且充满了温情。当然，这些形容词都是我现在想出来的。当时，我只觉得她好像我们村里供着的观音菩萨一样，高高在上，让人仰视，让人崇拜。更准确地说，我真有点忌妒这个在村里广为流传其劣迹的父亲，不知他前世修了什么福气，竟能占有高姨这样的女人。我多么为刚死去了的我妈抱不平。\n特别重要的是，高姨不只是父亲因“革命”而获得的一个美女。在一定程度上，高姨还是父亲“革命”事业的得力助手。甚至可以说，如果父亲是在游击队转战城乡中成为一位“革命”战士的话，那么，在“革命”成功并掌握了政权后，是高姨用她完美的行为将他培养成为共产党的一位优秀地方领导人的。\n高姨是个美丽而有教养的女人，但更是一个“革命”者，是一个富有理想的“革命”者。在她的心目中，父亲也是一个有共产主义伟大理想的“革命”战士。她之所以愿意为父亲献出宝贵的青春和美丽，因为她将父亲当成了“革命”战士的化身。她是共产党队伍中少有的知识女性，她对共产主义“革命”事业是那样的坚信不疑，她心地纯洁，真心实意地为共产党的每一个英明决策而欢呼。她充满爱心，热爱“革命”队伍的战友们。作为妻子、作为母亲，高姨对自己的亲人们倾注了满腔热情。当然，这些亲人也应该是“革命”者或者将来是“革命”者，而象高姨的父亲那样的资本家虽然也是亲人，却只能体验那种与亲情和爱心完全相反的东西。\n\n高姨的父亲来投奔高姨是在我投奔我父亲几年后的春天。准确地说，应该是六零年春天的故事了。高姨的父亲是在公私合营之时失去他心爱的工厂的，当然这绝对不能与我父亲在赌博中失去土地和房子相提并论。我父亲和高姨这些“革命”者，通过一种叫赎卖的办法剥夺了象高姨父亲那样的剥削者，其目的就是要将这些剥削者变成劳动者。那时候，高姨的父亲是不能再掌握工厂的经营管理权了，因为“革命”者认为，象高姨的父亲这样的剥削者，只有同工人们一起用铁器敲打铁钉才算劳动。于是，这位年过花甲、长期以管人和经营为生活内容的剥削者，想到了他同是“革命”者的女儿和已在“革命”队伍中当了官的女婿。于是，他在没有征得女儿女婿同意的情况下，就从那遥远的都市般的天津城，南下来到我们这座小县城。于是，就有他那从小丧父逝母的、现已掌握了政权成为了当地百姓的父母官的女婿，出于内心的热烈欢迎。于是，也就有了他那快十年不见、现也成为了“革命”者的女儿，大义灭亲之举。\n准确说来，高姨之举也不是什么大义灭亲。她看着她的父亲在我父亲欢天喜地的陪同下来到家里时，先是有点吃惊，然后连忙关上门动员那满怀希望的老人回到工厂去劳动。“爸，你这样做是不对的。现在政府是收走了你的工厂，要你劳动，这是在挽救你。你过去靠剥削工人发家，那些财富本来就是工人们的，现在政府只不过代表工人拿回他们自己的东西。何况，你对政府不满就到我这里来，我这里不就变成了剥削者的避难所了。我和我爱人都是共产党员，还是领导干部，我们能这样做吗？你住在我这里，会影响我爱人进步的。爸，不是女儿不孝，而是你必须服从“革命”的需要。等你改造好了，我一定接你养老。”那很有教养和风度的老人，听到这些话什么都没有说。他艰难地弯下腰，提起那个还没有打开的包。他的眼角有一点潮湿，也许是风将沙子吹进他那已显昏暗的眼睛。他小心地用那很好看的手帕蒙了一会眼睛，头也没回地踏上了北归之路。正计划如何孝敬这远道而来的岳父大人的我父亲，也被爱人的话惊醒了。他多么佩服爱人的思想觉悟和及时的决定。从此以后，我再没有看见那可敬又可怜的老人。他也没有再与他那女儿女婿通任何消息。据说，前些年，我二弟也就是高姨生的第二个儿子高阳，到过天津，见到了已有九十高龄的外公。老人曾问过这个一身名牌、出手大方的外孙开什么工厂，生产什么产品，如何在短短几年积累了这么多钱。当老人知道我二弟的公司除了倒卖政府批文外什么产品也不生产时，他惊讶中还有点气愤地说：“原来你们就是这样“革命”的。”不用说，这里的你们，肯定是指他那已黄泉做鬼的女儿和还在阳世为官的原女婿。\n但是，我并不认为高姨真正理解了我父亲，特别是我父亲这些为生存而参加“革命”的人所具有的理想世界。的确，父亲常说的一句名言就是“我们这一代人，为了“革命”，什么都可以不要，甚至生命。”不管人们如何评价这好像有点口号式的话，我还是相信父亲说的话是真的，是出于内心的。与那些有意识地为穷苦大众的解放而牺牲小家的党的领袖们不同的是，像父亲这些被“革命”领袖分析过的流氓无产阶级，参加“革命”最大的原因是有了生存的机会和复仇的希望。我曾经这样假设过，如果在游击队时代，遇到了不离开了游击队就只有死的选择的话，父亲十有八九会选择生，因为他参加游击队本身就是为了生存。正是针对这一点，“革命”队伍的领导者们就要给这些战士们灌输除了生存之外的理想和道德观。他们告诉自己的部属们，战场上是你死我活的，只有战胜敌人才可最终获得生存的权力。胜利了就会有属于自己的土地、房子和女人。投降或逃跑是没有好下场的。“革命”成功后，是那能主宰他人生命的权力，才让父亲们真切地体会到“革命”的崇高和神圣。他们已经认识到，如果“革命”政权失去了，或者因自己的错误离开了这个掌握政权的“革命”队伍，那就意味着失去已经拥有的一切。所以，他们有为了“革命”牺牲自己生命的豪言壮语。也就是说，是生存的需要和共同的既得利益使父亲们具有为维护“革命”事业而奋不顾身的勇气和精神力量。高姨是没有办法认识到这一点的，就是认识到了，她也决不会承认这种让人痛苦的结论。\n高姨和父亲对待“革命”理想的认识和理解是不同的，这在史无前例的文化大“革命”中完整地体现出来了。当父亲从受人敬仰的地区专员、高姨从地区党委宣传部长成为“革命”群众专政的对象时，父亲能够很快地适应了“低头认罪”的大气候，他可以通过各种方式向代表“革命”和正义的红卫兵及所有的造反派承认自己的错误，他一次又一次地痛改前非的表示，让自己一次又一次逃过了皮肉之苦。而高姨则不同了，她永远坚信自己“革命”理想崇高而神圣不可侵犯，就是被打断了肋骨也不愿意向造反派承认任何有关“革命”原则问题的错误。于是，她这个资本家的臭小姐被关进了牛栏，关进了父亲“革命”前住过的那种吞没人意志的地方。高姨是坚强的，是勇敢的，始终不渝坚信共产党是会还她清白的。\n然而，高姨最终还是没有等到那一天。当红卫兵将父亲的认罪书和与死不认罪的资产阶级孝子贤孙的现行反“革命”脱离夫妻关系的声明书，放在高姨面前时，高姨那漂亮的面孔被伤感和愤怒所扭曲。她不敢相信这是真的，她不相信十多年来崇拜而献身的“革命”者竟这样否定了“革命”的原则，她不敢想象那样爱着自己的爱人就这样将她出卖了。她从一个“革命”斗士很快变成了就像我妈押离婚手印时一样的村妇。她神经质地反复读着那两份材料，终于流下了就是惨遭毒打也没有流下的泪。她喃喃地自语：“怎会是这样呢？怎会是这样呢？”几天后，她找机会投河自杀了。\n父亲是在下放到五七干校劳动改造后，由我带着两个弟弟将高姨自杀的消息告诉他的。尽管他没有说什么，但看得出来，他还是很悲伤的。高姨终究是他深爱的女人。他只是为了向党证明自己从没有与党有二心，才写了那份与死不承认错误的爱妻脱离关系的声明。他看着天空，口中念念有词，好像在说：“古言云，识时务者为俊杰，好多比我你地位高得多的老共产党人都为了生存在讲违心话，你又何必那样死心眼呢。”当然，这些话父亲是不会当着我们面说的，可能他心里也不是这样想的。他只是恶狠狠地说了一句“妈巴子。”\n记得自从高姨指出“妈巴子”这句话是流氓语言后，常挂在父亲口上的“妈巴子”已有好几年没有说了。\n4\n父亲和雪姨成为夫妻，是父亲文革后复出成为这个城市的领导人之后的事情。父亲是七七年平反成为这里市委书记的。那时，距高姨自杀已有九年多，父亲也五十六岁奔六十的人了。\n雪姨刚好比父亲小二十六岁，比我小一岁，是个三十岁尚未婚配的老姑娘。雪姨是市物资局机关里的一位普通工作人员，其父母都是我们城市一家街道工厂的工人。雪姨共有五个弟弟和一个妹妹。雪姨中学毕业就到机关里担任打字员工作。开始时，机关里那些未婚青年好像也有人给雪姨写过纸条，送过电影票，但都没有很好地发展。主要原因大多是雪姨强调要与父母一道承担抚养弟妹的义务，慢慢地那些原来怀着热呼呼希望的青年冷却了。开始雪姨并没有当回事，但随着岁月无情的流逝，弟妹长大后，雪姨自己也就急了起来。\n这时，父亲文革前的秘书到物资局出任局长。这位新局长在同机关干部谈话时知道了雪姨的情况。于是，他连夜赶到我们家，在书房里与父亲密谈了一会就走了。\n第二天，父亲在家里接待了物资局局长和物资局办公室工作人员雪姨。父亲先还是与那位心照不宣的局长谈了几句工作，后就和雪姨谈天说地起来。也许雪姨从来没有和父亲这样大的官面对面谈过话，开始有一些紧张，后看到父亲还很随和，也就能说上几句。他们走时，父亲一改平时不送下属的习惯，很高兴地将他们送到大门口，反反复复说着那话“很好，就这样定了，就这样定了”。\n不久，雪姨就入了党，从打字员提升为办公室副主任，后来就和父亲结了婚，成为了我们兄弟三人的继母。\n父亲同雪姨结婚前，我们就没有同父亲居住在一起。我和二弟都在父亲平反前就分别在就业的工厂和商店娶妻生子，住在各自单位用厂房和仓库改建的宿舍里，三弟还在农村接受贫下中农再教育。本来，对于已官复原职的父亲，我们这几个在文革中跟着他受过苦的儿子们，曾抱有幻想，希望能得到某种补偿。父亲英明地洞察到了我们的企图，为了粉碎我们的依赖思想，父亲很严肃地将我们兄弟三人叫到他的书房里，讲述了许多“革命”道理，他要求我们要安心工作，要靠自己立足社会。我们对父亲虽然有一些看法，但从内心上还是“崇敬”父亲作为一个“革命”者“伟大”的品德。但无论如何，我们还是把父亲的住所当成我们公认的家。我们兄弟经常带着妻子儿女回到共同的家一聚，共述父子和兄弟的“革命”感情。父亲也乐意与我们兄弟和孙子孙女们在一起。雪姨来到这个家后，我们慢慢感觉到了有些变化。\n这种感觉起初是朦胧的，最终的明朗还是雪姨的杰作。那是一个深秋的夜晚，我大弟临时休假，闲来无事，就和他的儿子回家看望父亲和爷爷。象往常一样，他用自己的钥匙打开门，只见暗暗的客厅除了电视机的光亮外没有其他的灯光，于是，他五岁的儿子也就是我侄子熟悉地打开了灯。这下，可让我弟弟惊惶失措了。原来只穿着短裤的父亲正抱着差不多没穿什么的雪姨在看电视。父亲开始有一点尴尬，立即就升起了一股怒火，他厉声地对着平时恩爱有加的小孙子吼道：“这样没有礼貌，进房连门也不敲。真没有教养。”我大弟那可爱的孩子被吓哭了，我已过而立之年的弟弟低着头，牵着伤心哭泣的儿子，红着脸边向门外退边小声说“我们不知道，我们就走。”弟弟走出家门后，听到房里父亲怒骂声。“妈巴子的，叫你不要这样，你偏要。妈巴子的。”接着就是雪姨娇泣声。\n我是在我自己的家里知道这件事的。大弟怀着万分懊悔和失落的心情回到家后，他那已经不再哭泣的儿子将刚才的遭遇告诉了他母亲，也就是我的大弟媳。这个在我父亲还是政治贱民时、顶着她那领导一切的工人阶级家庭的百般阻挠、爱上并最终嫁给了我弟弟的女子，一听就火冒万丈，她不顾我弟的反对，硬是拖着我弟弟和他们的儿子到了我家。当着我老婆和女儿的面讲述了这一切。最后，我弟媳强调指出：“大哥大嫂，你们说说，那不是我们自己的家吗？！回自己家难道也需要敲门。他们为什么不注意自己的形象呢。老爷子还好意思骂我的儿子。”我发现我的妻子和女儿也一个劲地点头称是，一股钻心的痛苦莫明奇妙地涌上心头。我真不愿意承认，那已经不是我们的家了。\n第二天，我和大弟不约而同地来到父亲的办公室，将父亲和雪姨家的钥匙交给了父亲。父亲甚至连看都没有看放在他办公桌上的钥匙，就压低嗓门说：“妈巴子的，你们想造老子的反？”在这庄严的市委书记的办公室里，这粗野的骂声，也充满了权力的威严。自此以后，我和两个弟弟不时有“宁愿跟着叫化子娘，也不要跟着当官的爹”的感叹。不久，我们三兄弟经过考试，分别到北京和省城上学深造后，父亲家就更难得见到儿子和孙子们的身影了。就是有时父亲发话，想见见孙子孙女，我老婆和弟媳总是有各种理由而让父亲难以如愿。\n好在父亲工作忙。他的口号是将四人帮耽误的时间夺回来。于是为了响应“英明”领袖的“伟大”号召，他根据中央的十个大庆油田等类似的经济发展目标，绘制了我们城市的宏伟蓝图。“革命”的事业和“革命”的理想就像兴奋剂，使父亲充满了活力。他没日没夜地工作，他经常告诫部属们，要为官一任，造福一方。他则要为“革命”鞠躬尽瘁，死而后已。改革开放后，父亲的自我感觉更是良好。他那花白的头发，在雪姨的“强迫”下染成了乌黑发亮，真如焕发了“革命”青春。\n父亲在岁月的流逝中，在人民群众有肉吃和有电视看而为他们这些掌握权力的“革命”者歌功颂德时，又一次深刻体会到了一个“革命”者伟大的人生。他在赞扬声中开始忘记了青年时代在黄沙塘于家和在文化大“革命”中所受到的欺压和羞辱。他甚至不愿意再去回顾更不想思考那些岁月。然而，那岁月的痕迹像幽灵一般，时不时钻进他的生活。\n那时改革开放和引进外资是联系在一起的。有一天，父亲的部属很高兴地向父亲汇报说，终于钓到了一条大鱼，美国某大集团公司董事长原来是我们市某县五十年代出去的。那可是个能人，从讨饭到打工、再到开小店最后办成了有几十亿美元家产的大公司了。他富了不忘乡亲，有意到家乡投资，现在由省里某厅某领导陪同已下榻在我市的某宾馆里，希望书记能前往共同晚餐。父亲哈哈一笑，也没问这外商姓何名谁，就兴高采烈地前往宾馆。在宾馆的总统房的客厅里父亲见到了那位由省某厅某领导陪同、由大小秘书伺候着的美国大公司的董事长。可双方刚准备握在一起表示友谊和问候的手却在半空中凝固了，一个共产党的市委书记和一个来自美国的大公司董事长都目瞪口呆地盯着对方。最后，还是父亲首先清醒过来，他将原伸过去准备握手的大手变成了挥动的手势，很不礼貌地指着对方而十分威武地说：“你不是五二年叛国的大地主于朝龙的二儿子吧？！”美国公司的董事长也很快从当初的惊惶中解脱出来，他的手绅士般地将油光发亮的头发整理了一下，扶了扶昂贵的金丝眼镜，很大度地说，“家父是本市某县的黄沙塘于家的于朝龙先生。难道你不认识？！”并回过头来很鄙视地用英语对其秘书说了些什么。\n那已准备好的美味佳肴父亲是无缘享用了。尽管省里某厅的领导和父亲的部属想从中调节一下这俩位关键人物因历史造成的紧张而尴尬的气氛，父亲还是气愤地离开了宾馆，并将随之而来的因胆怯脸都变了色的部属狠狠地骂了一通。部属有口难言，不敢作任何解释。\n于朝龙的儿子并没有被父亲的粗鲁和权势所吓倒，尽管他明显地感觉到各级官员对他的态度的变化。第二天，他就用美元租了这座城市最好的十部小车，同他的秘书带着各种礼品回到了他当年亡命而别的故土。当他知道那些留在家乡的兄弟和母亲都先后命归九泉时，并没有流下一滴眼泪。他的秘书给全村每家都送去了贵重的礼品，全村人都感激不尽地接受了，并自发地拿着工具同他一道整修着他父母兄弟的坟墓。后来，他向村里人很礼貌地鞠了三躬，留下二十万美元给村里人修水库和建学校就走了。他是直接从老家到省城坐飞机走的，以后再也没有了他的消息。\n村里人不管乡和县里的反对，用于朝龙儿子留下的美元，很夸张地为于朝龙夫妻及儿子们修建了一座很大的坟墓，并在坟墓不远处修建了方圆百里最好的学校。村里最有学问的老夫子亲自书写的“朝龙学校”几个大字，立在学校的屋顶，红红的，好远都可以看到。\n这些情况父亲是知道的。在公开场合他没有说什么，也没有干预。他只是对几十年没有往来的乡亲们感到不解。他曾私下说，“妈巴子的，共产党对你们还不好。几十万美元就将你们收买了。”尽管父亲表现得那样不屑一顾，但可以看得出，父亲对于朝龙儿子用金钱得到的尊敬在骨子里还是很在意的。\n就在于朝龙儿子回于家村后不久，我父亲叫雪姨将大学毕业后回到故乡工作的大弟和二弟找回家。在父亲的书房里，父亲同那两个日益疏远的儿子很认真地说：我老了，干“革命”几十年总算明白了一些道理。我知道，你们对我不关心你们的前程有意见，不是我不关心，而是时机不到。你们想想，我在位时，你们在我手中能做多大的官呢，搞得不好还会有人东告西告的。现在我要退了，对你们还是要有个安排的。我想，老二你可以从政，老三你可以从商，你们大哥在外省教书，我就没有办法管了，如果他愿意，可以调回来，从政从商由他选。\n可想而知，当我两个一直对父亲抱有成见的弟弟，从“革命”者的父亲口里听到这些严肃而富有亲情的安排时，真是目瞪口呆不敢相信。他们看着父亲那少有的慈祥而真切的眼光，深深地体会到父爱的伟大。我二弟后来多次对我说起他那时的感受，最后总是感慨地说，无论如何还是血浓于水啊。\n父亲是八十年代中期从第一线退下来的。那年父亲年已六十有五。当时，中央在反复强调什么废除领导干部职务终身制。省里领导找父亲谈话时，父亲一再说自己身体还好，可以为党奋斗终生，最后还是同意退居二线。但提了一个要求，就是：“江山是我们这些老家伙打下来的，应该交给我们信得过的人。我们的孩子生活在我们身边，受我们教育多年，是信得过的最可靠的“革命”事业接班人。比如我家二小子，就是很有觉悟和政治水平的好青年，应该好好培养。”\n据说，省里面的领导非常同意父亲的观点，因为，中央就有相当权威的人公开说过类似的话。于是，在父亲从书记成为顾问委员会主任的同时，我大弟就从工厂的工程师成为了市团委书记，后来就成为市委组织部长进了常委班子。在顾问委员会完成其历史使命，父亲最后完全退下来时，大弟已是市政府常务副市长了。\n事实又一次证明，我父亲的决定是十分正确的。我大弟的确非常具有政治家的天赋。他不仅继承了我父亲“敢说敢干”的无产者精神，而且在所有的公众场合，他都能将高姨礼貌和给人信任的修养完整地体现出来，更为重要的，他所受的教育比父亲们能更快地接受新思想和新事物。他在为城市的经济发展做了大量工作的同时，还能用许多非常合理的口号将社会流行的诸如卡拉、桑拿之类披上改革开放的外衣。在他的策划下，我二弟就能从一个工薪人士，迅速地合情合理合法地成为了掌握上千万资产的大老板。\n我那很有觉悟和政治水平的大弟，就曾这样对我说过：古时候总是将升官和发财联系在一起说的，共产党的官在表面是不允许个人发财的，只能说为人民服务。但为人民服务，人民是需要付出代价的，这种代价就是交出你作为主人的权利，特别是对社会经济资源和政治资源及文化资源的支配权。共产党的权力在很大程度上就意味着对社会财富的占有。如果没有实际利益，人们也就没有追求权力的兴趣了。天下熙熙，利之所趋。但权力这个东西是有时效性的。因此，对权力的继承从来就是权力掌握者在权力有效期间必须认真考虑的问题。我们家老爷子尽管没有读过政治学，但事实上也精通此道。你想，如果没有我及他培植的接班人掌握着权力的话，他离休后，最好的情况就是按政策享受那些有限的待遇了，而且要看人家的脸色。\n对这点，父亲虽然从不在公开场合加以评论，但有一次我探亲回家同完全闲赋在家的父亲小饮，他在几杯茅台下肚后，看看左右无人轻声地对我说：“妈巴子的，你俩个弟弟比你强，为官的如鱼得水，为财的合理合法。你啊，就会读死书。如果想通了，还是回老家来吧，我叫人给你个职务。这里干点什么都方便。”说完就嘿嘿地笑了起来。可以看得出，父亲尽管为自己不能亲自再在官场上拼杀感到有一些失落，但为自己的后人有如此造化也感到心满意足了。但我总感到，那充满父爱的笑声又多么象狡诈的老农骗取了他人财物后的窃笑。\n父亲与雪姨的关系还算可以。人们对老夫少妻之间最担心的事情，莫过于年少妻子的青春荡漾如何在已不提当年勇的老爷子那里得到有效的抑制而不决堤外泄。这些问题在父亲那里应该不是问题。雪姨就曾很神秘地对我的老婆、也就是她那和她年龄相近的儿媳说起过老爷子那永不满足的欲望。“真不知道吃错了什么药，越老越行了，离休之后竟然天天需要。我真的受不了了。他的儿子也是这样吗？如果这方面都遗传的话，做于家的儿媳妇可就惨了。”我老婆听到这些话，竟脸红得不知如何回答这位长辈的发问。就是在晚上同我恩爱后向我讲述这些话时，我还能感到她脸在发烧。但凭着我们这些年青体壮的于家后代的亲身体会，雪姨这些话，应该有点夸张，或许是在嗔怪中证明自己选择的正确，也可能还有点对自己能很好地开发老年人的性爱潜能感到骄傲。我的这些想法并没有告诉我老婆，我不愿意与自己的女人讨论长辈的那种事，尤其在没有穿衣服的床上。\n尽管父亲宝刀未老，但雪姨还是没有同意与父亲生孩子。其理由是父亲家老大和老二，也就是我和大弟高兵的孩子都有几岁了，雪姨再生孩子有点难为情。尽管这也许不是真正的理由，但我们兄弟还是真心感谢雪姨的，我们都不希望自己的孩子叫比他们小得多的父亲的孩子叫叔叔或者阿姨。雪姨没有为父亲制造“革命”后代，并不影响父亲对雪姨家事的关照。因为他知道雪姨是为了弟妹们而耽误了婚姻才将处子身献给他的。所以，无论父亲是否在位，凡是有关雪姨家的事，他都要亲自出面办理。在父亲的亲自关怀下，雪姨高中毕业的大弟到党校深造后担任了一个区的副区长，二弟从工厂调到了团市委担任青工部部长，三弟到工会担任办公室副主任，四弟和五弟都保送上了我们市属大学，六妹初中毕业不愿意上学就到了公园担任出纳。仅此一点，雪姨也是感激父亲的。\n父亲德高望重，且“革命”事业后继有人。他心满意足地安度着晚年。但不知为何，当他生命进入倒计时后，他总爱和儿孙们谈论他的父母和几十年没有回过的故乡，有一次在饭后闲谈中，父亲竟然说，他这一生要感谢于朝龙。如果不是于朝龙教他赌博，他可能就会守着那几十亩地而在解放后成为地主。如果不是于朝龙因他拿东西而毒打他，他也不会火烧于朝龙家房子而远走他乡参加“革命”。如果没有于朝龙包办，他就不会与我妈成亲也就没有我了。看着父亲那忧郁的老脸，弟弟和部属们就建议他到故土看一看，或请老乡亲们来家坐坐。然而，每当这时，他又总是很豪放地说，“革命”者四海为家，哪有那么多婆婆妈妈的事情。\n但我是知道的，他在心里一定在骂，“妈巴子的，于家人从来就没有当我是人呢。”\n5\n父亲要死了。\n尽管他日益虚胖的身躯，会给人各种错觉。然而，所有了解他的人都知道，他的五脏已全部发生了不可逆转的病变。\n我同许多人守候在病房里，在等待着他死亡。\n市委办公室送来了为父亲准备的悼词。这篇由父亲原秘书、现市委书记审定的悼词对父亲评价很高。\n文称，父亲出于贫苦人家，青少年时代因反抗地主的压迫而投身“革命”，历任游击队队员、副队长，解放后任县公安局长、县委书记，地区专员。文化大“革命”受冲击，文革后任市委书记，为废除领导干部终身制，主动退居二线，担任顾委会主任，最终享受副军级待遇。是忠诚的共产主义战士，是党卓越的地方领导者，是人民的好儿子….\n---中国社会科学院农村发展研究所教授于建嵘"
		},
		{
			"post_id": 336,
			"title": "郭文贵美国之音爆料精彩部分",
			"date_published": 1495861081.452,
			"body": "[http://127.0.0.1:43110/12QDpKdCkd1ZBz37jL1e5FeGSPx5BcsgDP/player.html?type=video/mp4&codecs=avc1.42c01e,mp4a.40.2&json=files/guowengui.mp4/file.json&moov=files/guowengui.mp4/moov_box.dat](http://127.0.0.1:43110/12QDpKdCkd1ZBz37jL1e5FeGSPx5BcsgDP/player.html?type=video/mp4&codecs=avc1.42c01e,mp4a.40.2&json=files/guowengui.mp4/file.json&moov=files/guowengui.mp4/moov_box.dat)"
		},
		{
			"post_id": 335,
			"title": "民主日重庆民主人士韩良宣传民主",
			"date_published": 1495698905.013,
			"body": "<video src=\"data/video/13.webm\" controls=\"\" autoplay=\"\" width=\"600\" height=\"400\">your browser does not support the video element.</video>"
		},
		{
			"post_id": 332,
			"title": "郭文贵云南起事，他的目的都可以达到。",
			"date_published": 1495504131.041,
			"body": "<div class=\"body\">如果郭文贵在云南起事，最理想的结果是再造共和，救民于倒悬，流芳百世。\n最差的结果可以达到蒙，藏，维，云南独立。这样云南就是一个独立国家了，郭文贵作为云南开国功勋，自然是新国家的公民。这样郭文贵与中共之间的问题就成了外交问题，成了国际问题。郭文贵被中共掠夺的财产就可以通过外交途径解决。郭文贵的家人，员工的问题也成了外交问题，可以通过联合国解决。\n\n郭文贵现在要举事比当初蔡锷将军举事要容易的多\n\n而且郭文贵举事完全可以按蔡锷将军举事的路线。云南起事，进兵四川，两广。等各地响应。\n\n郭文贵要在云南起事，首先要派工作组进入泰北。\n\n与原国军93师取得联系，共谋大业。原93师都为云南籍人士，重返云南，独立建国是他们的天然使命。郭文贵能与93师联手，大功必成。\n\n郭文贵在云南起事可以获得台湾军情局的援助\n\n可以获得资金，武器，人员，物资，情报各方面的支持。也可以获得美国cia的援助。当然也能获得海内外全体反共人士及团体的支持。\n\n云南，广西是越战老兵集中的地区，是郭大将军的有力支持。\n\n郭大将军在云南起事必定成功！大量的越战老兵生活无靠，就等郭大将军振臂高呼，各路英雄八方来归。\n\n郭文贵的3年爆料期太过保守\n\n严重低估了各路反共豪杰的实力，严重低估了各地独立革命的决心。\n\n</div>"
		},
		{
			"post_id": 331,
			"title": "沉船计划",
			"date_published": 1495353269.69,
			"body": "![5.jpg (0x0)](data/img/post_331_5.jpg)"
		},
		{
			"post_id": 329,
			"title": "吴越独立的好处(3）",
			"date_published": 1495336316.218,
			"body": "请吴越民众广为传播\n\n中共每年要花费7000多亿军费。这个军费中的大部分也是由我们吴越地区承担的。\n\n中共的军费开支不是用来添置先进武器的，因为从89年64天安门屠杀之后，欧美国家就对中共实行武器禁运了，一直延续到现在。\n\n中共的军费开支最大的一部分是用来收买各大小军头，维持中共专制统治的。一个团长一年的工资收入就在100万以上，比公安系统同级别的官员要高出约10倍。所以公安系统意见很大。\n\n---\n\n中共有200万的军队，该有多少团长，师长，军长？像徐才厚，郭伯熊这样的军头，收入更是高到离谱。现在内斗抓他们了，就说是贪腐2000多亿，变成“非法”收入了，其实2000多亿根本就是他们的“合法”收入。军队系统这个级别本来就比其它系统同级别各部头领收入高出10几倍，其它国家级头领哪个没有几百亿的财产？\n\n中共军费开支第二大的部分是用在新疆，西藏地区。每年几十万的军队在新疆，西藏实行事实上的军事戒严。几十万的士兵都要发工资的。这个钱主要是由我们吴越地区承担的。\n\n其实新疆，西藏离我们吴越很远，比日本，韩国，台湾都远。独立也好，不独立也好，与我们吴越没有关系，与我们吴越的生活没有关系。\n\n新疆，西藏独立只对中共有危险，对中共政权有危险。\n\n我们吴越独立了，我们根本就不需要养200万军队来对付中国各地的老百姓，每年7000亿的军费我们就不用承担了。这些钱就可以用来改善吴越民众的生活。\n\n吴越独立的好处是每个吴越人士看得到，摸得着的。是每个吴越人士立即可以得到的。\n\n请每个吴越人士广泛的传播吴越独立的好处。请每个吴越人士每天传播吴越独立的好处。"
		},
		{
			"post_id": 328,
			"title": "吴越独立的好处(2）",
			"date_published": 1495258220.161,
			"body": "![7.jpg (0x0)](data/img/post_328_7.jpg)\n\n请吴越民众广为传播\n\n中共为了在世界上混下去，每年要向很多小国提供千百亿的援助，不然没办法混。\n\n另外，中共为了在联合国否决一些对它不利的提案，也需要不断地向一些小国进行贿赂。\n\n特别是为了一些针对中共的人权问题提出的提案，中共更得向一些小国进行贿赂。\n\n---\n\n当然，为了孤立台湾，中共也得不断地向一些小国提供贿赂。\n\n更主要的是，中共的很多对外援助中是有回扣的。这些对外援助中有很大一部分是中共外交部官员的回扣，是中共驻外使馆领导的回扣。\n\n中共的很多对外援助中是有利益输送的。比如向非洲国家援助一个体育馆，或者一条公路，这些工程就包给了红二代控制的企业。你明白了这些，就不会像傻逼一样对中共的对外援助感到很自豪了。你明白了这些，就明白了中共为什么很喜欢对外援助了。\n\n当然中共外交部官员，中共驻外使馆领导，红二代们也不能把这些援助款全部都拿进腰包，他们还得拿出一部分贿赂当地的官员。所以，欧美国家说中共输出腐败，这是有根据的。\n\n中共每年几千亿的对外援助主要也是从我们吴越地区搜刮的钱财。我们吴越独立了，这种搜刮就不存在了。这些钱就成了我们吴越民众的收入了。\n\n吴越独立的好处是每个吴越人士看得到，摸得着的。是每个吴越人士立即可以得到的。\n\n请每个吴越人士广泛的传播吴越独立的好处。请每个吴越人士每天传播吴越独立的好处。"
		},
		{
			"post_id": 326,
			"title": "吴越独立的好处（1)",
			"date_published": 1495178153.141,
			"body": "请吴越民众广为传播\n\n中共有2000多中央委员，中央候补委员，这些人的除了亿万计算的腐败之外，还有很好的工资，待遇，福利。这些福利都覆盖他们的家属的。\n\n供养他们的这些开支主要是由我们江浙沪上交中央财政承担的。\n\n---\n\n中共还有数以万计的国家级官员，副部级以上，司局级以上的中央官员。还有享受国家级待遇，享受副部级以上待遇，享受司局级以上待遇的人物。\n\n中共还有不知道有多少数量的已经退休的享受国家级待遇，享受副部级以上待遇，享受司局级以上待遇的人物。\n\n供养这些人的费用每年都以万亿计算，这些供养开支主要的也是由我们吴越地区承担的。\n\n我们吴越独立了，供养这些寄生虫的开支就没有了。这些开支足以在吴越地区实行全民免费医疗，免费教育，足以覆盖吴越地区的全民养老金，失业保险金。\n\n中共在所有的企事业单位都有党政工团4套班子，我们吴越地区也一样，这些人根本不干活，只是整天给大家找麻烦。可是他们的工资都比我们干活的人拿的多很多。他们退休以后的离休金还是比我们多很多，在上海都是1万多，比上海普通工人3000多的退休金要高3倍。\n\n他们还有比我们普通工人好太多的离休医疗保险。\n\n吴越独立以后，这群寄生虫也不用养了。供养这群寄生虫的钱足以建立吴越的社会福利保障体制。\n\n吴越独立以后，中共这些寄生虫不需要我们供养了，我们吴越国的人均收入就会大幅度提高，大致能提高到台湾，南韩的水平。我们吴越就能向台湾，南韩一样建立完善的社会保障体制，我们吴越国民就有自尊，就有体面的生活，就会受到国际社会的尊重。\n\n我们吴越国民有体面的生活，受到国际社会的尊重，就能免签证进入美国，加拿大，英国，法国，德国，等等。年轻人就能很方便的去欧美国家留学。毕业以后也能很容易的在欧美日本等找到工作。\n\n吴越独立的好处是每个吴越人士看得到，摸得着的。是每个吴越人士立即可以得到的。\n\n请每个吴越人士广泛的传播吴越独立的好处。请每个吴越人士每天传播吴越独立的好处。"
		},
		{
			"post_id": 324,
			"title": "民众示威必备装备",
			"date_published": 1494730823.278,
			"body": "![8.jpg (0x0)](data/img/post_324_8.jpg)\n\n![6.jpg (0x0)](data/img/post_324_6.jpg)\n\n![7.jpg (0x0)](data/img/post_324_7.jpg)"
		},
		{
			"post_id": 323,
			"title": "民众示威必备装备",
			"date_published": 1494644918.399,
			"body": "![5.jpg (0x0)](data/img/post_323_5.jpg)\n\n![6.jpg (0x0)](data/img/post_323_6.jpg)"
		},
		{
			"post_id": 322,
			"title": "民众示威必备装备及使用方法",
			"date_published": 1494644792.161,
			"body": "![1.jpg (0x0)](data/img/post_322_1.jpg)\n\n![2.jpg (0x0)](data/img/post_322_2.jpg)\n\n![3.jpg (0x0)](data/img/post_322_3.jpg)\n\n![5.jpg (0x0)](data/img/post_322_5.jpg)"
		},
		{
			"post_id": 321,
			"title": "民众示威装备使用方法",
			"date_published": 1494576312.312,
			"body": "![1.jpg (0x0)](data/img/post_321_1.jpg)\n\n![2.jpg (0x0)](data/img/post_321_2.jpg)\n\n![3.jpg (0x0)](data/img/post_321_3.jpg)\n\n![4.jpg (0x0)](data/img/post_321_4.jpg)\n\n![5.jpg (0x0)](data/img/post_321_5.jpg)"
		},
		{
			"post_id": 320,
			"title": "民众示威方法",
			"date_published": 1494575955.401,
			"body": "![1.jpg (0x0)](data/img/post_320_1.jpg)\n\n![2.jpg (0x0)](data/img/post_320_2.jpg)\n\n![3.jpg (0x0)](data/img/post_320_3.jpg)"
		},
		{
			"post_id": 319,
			"title": "民众示威必备装备",
			"date_published": 1494508734.482,
			"body": "![5.jpg (0x0)](data/img/post_319_5.jpg)\n\n![4.jpg (0x0)](data/img/post_319_4.jpg)\n\n![2.jpg (0x0)](data/img/post_319_2.jpg)\n\n![3.jpg (0x0)](data/img/post_319_3.jpg)\n\n![1.jpg (0x0)](data/img/post_319_1.jpg)"
		},
		{
			"post_id": 306,
			"title": "欧洲八律师团体致函中国关注709抓捕案",
			"date_published": 1493270311.062,
			"body": "欧洲8个律师及法律人团体，4月24发表致中国公安部长郭声琨的公开信，对在2015年709大抓捕案中仍被拘禁律师的身心，以及家属持续遭骚扰状况表示深切关注。\n\n这封由危难律师国际观察站、日内瓦律师公会、国际律师联盟、欧洲律师协会理事会、巴黎律师协会等联署的公开信，星期二晚由维权网站参与网披露。\n\n---\n\n公开信促请中国当局遵守法律和宪法，以及兑现对履行人权责任的国际承诺，确保对在押律师的审讯过程，完全符合正当法律程序及公正审讯的基本原则，以符合联合国禁止酷刑公约。公开信还呼吁停止骚扰和威吓被羁押律师的家人，以及他们的辩护律师。\n\n公开信表示，据悉，被羁押中的李和平律师的妻子王峭岭和王全璋律师的妻子李文足都被持续监控及恐吓，家门前被装摄像头，时刻被跟踪，在街上被不明人包围，被威胁带走等等。因此，非常关注这些企图摧毁被羁押律师家人生活的行为。\n\n公开信还对在押律师李和平和王全璋一直没有音信，以及可能遭受虐待及酷刑感到深深的焦虑。\n\n据香港中国维权律师关注组的最新统计，截至2017年4月21日，709大抓捕案至少有320名律师、律所人员、人权捍卫者和家属被约谈、传唤、限制出境、软禁、监视居住、逮捕、强迫失踪。目前仍有包括李和平、王全璋、湖南律师谢阳、维权人士吴淦等8人在押候审，北京律师江天勇被指定居所监视居住。"
		},
		{
			"post_id": 305,
			"title": "如果中共军队进入朝鲜。。。",
			"date_published": 1493179767.117,
			"body": "美国一旦展开对朝鲜的军事行动，我认为中共会快速进入朝鲜北部靠近中国的地区，建立所谓的缓冲区，以隔离中国民众直接与民主国家韩国的接触。\n\n我认为中共不可能太过向南，直接与美军对峙。一来风险太大，无法控制。二来，与美军直接对峙的是需要很大数量的军队，中国目前国内的局势军队需要在国内维稳，不可能派出大量的军队。而且后勤支援也跟不上。\n\n那么，中共在朝鲜北部建立的缓冲区是否还叫朝鲜？是否还属于一个国家？是否建立一个傀儡政权？这样的政权联合国承认吗？朝鲜民众承认吗？\n\n如果韩国要求中共军队退出，那该怎么办？中共军队以什么名义占领朝鲜北部？最大的麻烦是中共军队在朝鲜北部建立的所谓缓冲区内会不会出现游击队？中共建立的缓冲区内出现朝鲜游击队怎么办？\n\n这些都将成为国际问题。这些都是中共这些土包子不会考虑的问题。\n\n即便中共军队在朝鲜北部占领了以后不退出。那么一旦国内局势发生动荡，这些在朝鲜北部的军队是否还能控制？\n\n这些军队是会向韩国投诚，转去欧美？还是就地起义，反攻东北？其实变数是很大的。\n\n中共企图在朝鲜北部建立缓冲区的想法是一厢情愿的，后果根本就无法预料。"
		},
		{
			"post_id": 304,
			"title": "谢阳妻子与美议员讨论709酷刑问题",
			"date_published": 1493093555.587,
			"body": "图片：2017年4月20日，抵美的709被捕律师谢阳妻子陈桂秋（前右）与美国国会及行政当局中国委员会联席主席史密斯（前左）会面。（吴亦桐提供）\n\n![3.jpg (0x0)](data/img/post_304_3.jpg)\n\n---\n\n709律师谢阳妻子陈桂秋安全抵达美国后，近日与美国众议员史密斯会面，讨论709案酷刑、媒体抹黑，以及株连家属等侵害人权行为。\n\n709被捕律师谢阳案件将于周二（25日）开庭消息传出后，谢阳妻子陈桂秋周四（20日）与美国众议员、美国国会及行政当局中国委员会联席主席史密斯（Chris Smith）会面，这次是陈桂秋抵达美国后首次公开现身。\n\n陈桂秋向本台透露，她与史密斯谈及709案律师和公民遭受的酷刑折磨、官方阻止律师会见、官媒抹黑和家属们受到株连等大陆当局严重侵犯人权的问题。史密斯承诺会加大对709案的关注，并敦促美国总统特朗普在案件上有所作为。\n\n陈桂秋说：史密斯对709的事情是密切关注的，他都知道律师们所受到的酷刑、家属受到的非法待遇等。他说，他将加大对709（律师和公民）营救的力度，他将会在国会复会之后向川普（特朗普）报告这个事，并有一系列的计划出来。\n\n今年1月中，谢阳的代理律师陈建刚公开与谢阳会面的2份笔录，谢阳所遭受的酷刑细节曝光，引起国际社会关注；陈桂秋亦遭当局威胁，她被迫带同2名女儿出走，短暂滞留泰国后成功到达美国。\n\n陈桂秋早前公开质询当局为何强行安排官派律师介入，她接受本台采访时认为，对中国政府来说，709案持续近2年，其国际形象不断下滑，最好的办法是尽快释放709案的律师和公民。\n\n陈桂秋说：最好的做法就是把这些人放了，国际上的呼声这么大。本来这些人都是没有罪的，你（大陆当局）硬是要给安上个罪名让这些人入狱，这是最不人道的做法。\n\n同样是在周四（20日），美国总统特朗普就“全球马格尼茨基人权法案”的落实情况，致函美国国会，并提交1份落实情况报告。特朗普表示，报告展示了美国政府对法案的支持，以及对法案全面、有力执行的承诺。其执政团队正在搜集相关证据，在未来几周到几个月，各联邦机构将展开跨部门审查行动，以确保对人权侵犯者和腐败官员追责。\n\n“中国人权问责中心”发起人之一的曹雅学，在接受本台访问时表示，希望法案对709案中的人权侵犯者，特别是酷刑实施者能够有真正的制裁。她也透露，联合国人权高级专员、欧盟，一些国际律师协会、人权机构，对709案的酷刑高度关注。\n\n曹雅学说：马格尼茨基法案肯定是要用的，709酷刑的确是非常震动，特别是谢阳酷刑的披露，他的系统非常有权威性的，第1次完整的给709酷刑1个案例的全貌，就我们所知，709其他的酷刑可能只会更糟。\n\n谢阳案即将开庭消息传出的同时，有大陆官方内部不愿具名人士亦向本台表示，当局有意透过官派律师充当“白手套”为谢阳案收场，不排除为李和平、王全璋、吴淦等709系列案件作为样本。就在本台即将截稿之时，被秘密监视居住的律师江天勇父母家附近道路，被安装监控设备，官方是否决意为709案收场，似乎依然不甚明朗。\n\n来源：自由亚洲电台\n作者：吴亦桐，戴维森"
		},
		{
			"post_id": 302,
			"title": "New blog post",
			"date_published": 1493082976.934,
			"body": "![3.PNG (0x0)](data/img/post_302_3.PNG)"
		},
		{
			"post_id": 298,
			"title": "中国民主化的必要条件以及日本的角色",
			"date_published": 1491625873.303,
			"body": "楊建利\n\n在日本明治大学的演讲稿 2017年4月1日\n\n让我从研究当代中国政治最重要的参照点——1989天安门事件——开始。\n\n1989民主运动是反对政府腐败、争取民主自由的运动。这场运动规模宏大但以悲剧收尾。天安门大屠杀让普通人对政治产生了恐惧和回避心理，任何能制衡政府专横权力的公共制度的可能性被铲除了。它也在中共统治者内部制造了一种恐惧和危机感，它开始让人权和民主的观念深入人心，民主国家的集体谴责和经济制裁使中共外交孤立。统治者必须面对完全不同的国际国内环境。\n\n此后苏联的解体和东欧的变局更是让中共官员头上阴云笼罩。“红旗还能打多久”？他们都开始感到前所未有的不安。\n\n---\n\n为度过天安门危机，对统治者最重要是打破国际孤立。然而，大屠杀之后不到三个星期，当中国领导层还在对未来不确定、勉强应对外来压力的情况下，布什总统派他国家安全顾问作为他的特使秘密访华，会见邓小平和其他中国领导人。\n\n布什总统的这个姿态暴露出美国的弱点，让中国领导层确信美国愿意继续承认专制政权，并与之保持正常关系，即便中国政府并不打算承认或改变它严重的错误或罪行。\n\n这次会面后来公之于众了。民主党，尤其是当时正在在竞选总统的克林顿州长，严厉地批评布什对中国“卑躬屈膝”，一些共和党人也认为，在北京尚未表示忏悔的前提下，布什的这个举动太失算。\n\n关于对中国采取什么样的立场的问题上的分歧在有关中国最惠国待遇的辩论中体现出来。我们中国的民主人权人士，主张美中贸易关系应当和中国的人权状况挂钩，如果不把两者联系在一起，任由贸易正常（实际上很不正常）进行，就像是对中共政权输血，这会使其更加猖狂，损害到各国人民的利益。\n\n但克林顿就任总统一年之后，180度大转弯，将贸易和人权脱钩。而这一转变，与4年之前在日本发生的事情不无关系。\n\n1990年，日本不顾美国等西方集团的反对，无条件地率先解除对中国的经济制裁，恢复第三批对华日元贷款，启动对华高技术出口，而且无偿地大量对中国输出工业设备制造技术，并在西方七国首脑会议上反对全面制裁中国，帮助中国政府撕开了制裁的裂口。日本率先改善对华关系的行动，对美国1993年放宽对华高技术出口管制、并最终改变对华强硬立场、减轻在人权问题上对中国的压力起到了推动作用。\n\n当时民主国家为这一立场改变能拿到台面上的理由是基于在政、学、商界广泛接受的一种理论之上，即贸易可以导致民主，因为贸易可以带来经济增长和中产阶级的成长，后者会转而提出政治自由的要求。\n\n二十多年过去了，这个中产阶级理论至今看来似乎在中国失灵。\n\n随着美国、日本和其他西方国家、台湾、香港输入的资金和技术，中共政府不但安然度过了1989年危机，而且风头强劲地进入了21世纪。中国从最贫穷的国家之一变成了世界第二大经济体；但中国在民主发展的指数中仍然排名倒数。多年来，中国的中产阶级默默承受了一党专制的体制及其对人权的粗暴践踏。到底是哪里出错了？\n\n让我们先来看中国。\n\n1992年，邓小平进行了南巡，进一步推动经济开放。中共各级官员很快认识到三个现实：第一，中国共产党掌权和共产主义意识形态毫无关联。第二，“经济增长高于一切”，也就是说，经济增长是中共这艘船得以继续前进最后也是最大的希望。第三，为了维护一党专制，它必须依靠人性黑暗、罪恶的一面：给精英阶层腐败的机会以换取他们的忠诚。\n\n在懂得这三个现实后，中共官员发展出一套不成文但普遍接受的行为规则——腐败准则。所以，每一片政府权力都在市场上待价而沽，市场的每一个角落都被政治权力霸占。所有政府机构的官员都把主要的精力用于增长GDP、权力交易、行贿长官，以及寻求巨额的个人回报。这些曾经自我标榜为“无产阶级先锋队”的中共精英们，或者成为一夜暴富的资本家，或者变成国内以及外国资本家的经纪人、支持者、背后靠山。\n\n在这种政治环境中，政治权力与资本力量大跳亲密的探戈。人权低标准，低工资，环境保护法规和执法的缺位，以及对集体谈判的禁止都为国内、国际的投机资本家创造了黄金条件，他们几乎无一例外地寻求掌权者的保护，使他们在不公平的条件下获得市场机会。在某种意义上，中共作为“中国公司”原先唯一的股东，现在开放了股权，允许资本家购买。\n\n与此同时，“中国公司”的股份也免费提供给了知识分子，只是要按照其表现来定夺。为了维护社会稳定，中共政权提供了各种贿赂，拉拢社会上有影响力的人。贿赂的对象包括每一级官僚、学者、知识文化精英、艺术表演者、著名运动员等等。政府为这些人买单，形式有高薪酬、奖金、国家报销的花费、免费医疗保险、住房补助、免费的养老金计划等等。法律和政治向这些人倾斜，以换取他们对现存政治秩序的认可和接纳。他们通过收入和外快迅速积累的财富远远高于普通的工人、农民、店员和小企业主。这种遴选、收买潜在反对力量的政策再和天安门屠杀后的整肃和迫害政策相结合，变得非常有效。残酷的政治现实在知识分子心中制造了恐怖，起到了心理威慑的作用。随着时间的流逝，恐惧变成了玩世不恭，他们逐渐对正确与否不再关心。冷漠和虚伪迅速变成了当代中国知识分子崇尚的新时尚。\n\n如上可以帮我们懂得为什么“中产阶级理论”在中国失灵。\n\n第一， 就中国政府与市场的关系而言，中产阶级成功的原因在其从政府获得的靠山和特权。期望这种严重依赖国家政权的阶级提出大胆的政治主张，是耽于幻想。\n第二， 贸易和商业及经济的发展是国家政策主导实施的，和英、美这种早期的“自然发生”的发达国家不同，中国快速的经济增长并没有自然产生一个政治上独立的中产阶级，相反是把商业精英吸纳到其统治结构的层级中。例如，中共第16届全国代表大会发表的新党章欢迎资本家成为党员。\n\n在1990年代和21世纪的头十年中，中国的权力（政治精英）、资本（经济精英）以及“头脑”（社会和文化精英）结合在一起，组成了一个维护现存政治秩序的联盟。这个联盟拥有并运转“中国公司”，以财富、强权、购买力让世界为之炫目。背靠中国巨大的地理空间和人口数量，中国公司的股东们凭着财富积累和经济增长的惊人速度让各方观察家留下了深刻印象，也让他们相信一党专制有利于经济增长。同样的道理，这些股东控制了信息流通的渠道，占领了公共话语的空间，让外界的观察者认为他们就代表中国，他们就是中国——全中国。\n\n事实是，有另外一个叫中国的社会，由十亿为“中国公司”卖命的中国人组成，他们的基本人权几乎完全被忽略了，人们讽刺地把这个中国称为“屁民的中国”。 这是习近平上台之前我经常谈到的“两个中国结构”。这是一个只有两个玩家的游戏。\n\n在同一时期，民主国家认为人权问题不方便他们与中国的交往，尽力避免涉及这个问题。面对不断崛起的中国，民主国家逐渐失去了其主导权。现在中国领导层实际上不是很把西方的公共舆论放在眼里，因为世界各国的政客和商人对中国巨大的购买力、投资和市场垂涎三尺。不夸张地说，中国领导人在世界大多数国家是最被抬举的客人；中国也是渴望财富的世界精英们首要的目的地之一。\n\n北京严格控制着媒体。他们可以随时驱逐Google和Yahoo；他们拒绝过纽约时报记者和重要学者的入境签证，也阻断了对Twitter和Facebook的浏览。但他们这么做没有得到任何惩罚。与此同时，他们可以在民主国家建立他们的媒体。讽刺的是，中国这个对印刷品和电子出版物实施严格审查制度的国家，竟然被法兰克福、伦敦和纽约书展以主宾国的身份邀请。好莱坞是美国自由文化的缩影；电影制作者可以自由讽刺、挖苦和批评美国的政客和政府官员，包括参议员、法官和总统在内，而不用担心迫害。但为了追求中国的票房成绩，好莱坞的执行官们自觉清除电影中涉及批评中国政府的内容。虽然如此，外国电影在中国仍然受到审查，有的甚至被禁止。所有外国媒体在中国都是被封杀的。今天在世界各地，中国政府及其代理人与大学、智库和广播公司建立广泛的联系，进行大外宣。\n\n中国正运用在西方帮助下取得的经济力量建立一支令人生畏的现代军队。随着其权力的增长，中国试图修改国际准则和规范，意图在亚太地区以中国为中心，这将威胁到区域和世界的和平。目前东海、南海的紧张形势就是一个例子。\n\n简单的说，民主国家在推动中国人权和民主方面的失败最终影响到了它长期的国家利益和民主的生活方式。\n\n让我们再看看中国还有些什么机会在等待我们。\n\n虽然习近平在中国实施了中共建政以来最大规模和强度的反腐败行动，向世界显示，他比前任更坚定地走一党专政的道路， 而不是进行民主改革。\n\n但中国也在发生微妙的变化，这很大程度上是因为习近平的个性、反腐败运动和不可阻止的经济下行。\n\n习近平已经把权力集中在自己手中，并且推崇个人崇拜。 习近平通过反腐运动做到的成功地集权抛弃了“集体领导”体制。这种做法使他疏远了各个层级的“同志”，这些人现在都懒于做事，以消极抵抗。习近平反腐败运动的其中一个被观察家忽视的原因是两个中国的统治模式（即在精英中以腐败换忠诚）成本越来越大，已经入不敷出。但结束这种模式而又不给予人自由是不可行的。这种模式造成的局面是最高领导层越来越疏远政治、经济以及知识精英，还包括中产阶级。随着经济放缓，中产阶级越来越感到不安，寻求离开这个统治结构，甚至这个国家。\n\n与此同时，习近平出于对失去权力和红色政权的恐惧展开了自天安门屠杀以来对政治异议人士最残酷的镇压，逮捕律师、学者、工人和民间社会活动家，对媒体和因特网进一步收紧控制。\n\n政治上说，开始反对现政权的精英们发现他们陷入了夹缝中，上面是统治集团，下面是工人和农民组成的大众，和任何一方他们都没有互信。\n\n习近平改变了游戏规则。他把两个玩家的游戏变成了三个玩家，消解了六四后帮助这个政党维持其统治地位的权力基础。这是习近平政权最深的危机。\n\n但我不会假装革命明天就会发生。\n\n必须注意的是，在任何专制国家，需要四个因素同时具备才可能开始真正的民主转型：1）人们对政治现状的普遍强烈不满； 2）可持续由生命力可行的民主反对运动；3）专制政权中的领导层分裂； 4）国际社会对民主反对运动的承认和支持。\n\n让我进一步阐述。\n\n第一，中国的维稳体制把每个公民当作假想敌，而且事实上它已经成功地把他们变成了敌人——异议人士、独立知识分子、失地农民、强拆强迁受害者、强制堕胎受害者、退伍军人、农民工、藏人、维吾尔人、蒙古人、基督徒，以及法轮功修炼者，还可以数下去。中共并不缺少敌人。当经济放缓的时候，普通民众的怨气会愈发凸显，社会不安定因素越积越多。\n\n第二、民主概念已经开始深入人心，这要感谢多少年来中国内外的民主化力量作出的努力。与此同时，普通民众在争取自身权利的斗争中已经变得更成熟，更有智慧，也更主动。一般来说，当民众的力量成长起来，民间反对日益高涨，共产政权内部不同派别之间的权力斗争将会公开化。尤其是，当外界的压力到了临界点的时候，中共内部的反对派将不得不把民众的力量考虑进去，并寻求他们的帮助。说到这里，我想强调的是，我们需要一个整体性的、可持续的民主运动来迫使独裁者开放。为达到这个目标，重要的阶段性努力是让能代表大众的民间领导人组合起来，形成可见有机的民间领袖群体，这个领袖群体能整合中产阶级和下层人民的力量去争取民主，至少能部分地阻断目前的政治秩序，这个领袖群体将吸引国际社会的关注承认和支持，并能和政府实施有效的政治谈判。\n\n第三、我前面已经提到，中国精英分子已经开始瓦解。党的领导群体也已涣散，这在自2012年以来对薄熙来、令计划、周永康等人的整肃中已经显示出来。在过去三十年中，中国政治制度唯一的成就可能就是建立了“两届十年一代”的任期制。很多观察家认为，这种体制可以保证中共政权长期的稳定，一厢情愿地认为这种制度帮助中共克服了历史上长期困扰独裁者的权力延续的问题。然而，薄熙来一案毫不留情地搓破了这个泡沫。现在是习近平本人开始挑战这个规范。党内的裂痕日益加深。\n\n第四，国际社会的支持。一党专制下的中国不可能和平崛起，所以实行民主转型，尊重人权、法治、言论自由和宗教自由对各国都有益处，包括日本。\n\n那么，就让我来谈谈日本的角色。\n\n人们常说，二十一世纪是亚洲的世纪，其实，二十一世纪是每一个人的世纪，好坏赖于自己的把握。亚洲目前的情况并不像一些预言家描述的那么美好，也许恰恰相反，亚洲蕴酿着可能造成全球问题的危机爆发点：朝核、东海、南海、台海、印巴，环境、人口、难民、中国的变局，不一而足。然而，亚洲缺乏集体减除和应对这些危机的国家联盟，尤其是没有以民主国家为核心的联盟，毕竟大部分危机的根源或者不能消除这些危机原因是专制。日本作为亚洲最强大的民主国家，应该在形成这样的区域机制上扮演角色领导。这样的以民主国家为核心的区域联盟的建立，客观上将对中国的民主化起到推动作用。\n\n今天，中国在经济、军事上的发展令世人瞩目，但这种发展更接近于二战前的日本，是一种具有严重缺陷的现代化进程。这种缺陷导致中国在外交关系上无法被有效纳入现代文明秩序。更重要的是，这种半现代化、半野蛮的状态下，社会制度和价值观层面的困境难于破解：中国不再是一个对外封闭的国家，却又在制度和价值观层面上，对这种变革表现出极为敏感的警觉，不惜代价构造起抵抗这种变革的强大镇压力量。在中国，东方专制主义和列宁主义的专制特色形成了一股强大的合力。\n\n民主化是现代化的一个组成部分，也是中国实现全面现代化的最后一步，只有走完这一步，我们才可以说中国自鸦片战争以来的社会变革走向可预测的阶段。\n\n因此，当我们谈论中日关系的时候，应该看到，这不是一个简单的国家关系，也不是一般的睦邻关系，而是一个现代国家与一个半现代国家之间、混合了各种现实利益和历史纠葛的关系。\n\n中国军事实力的全面增长，对日本二十一世纪的国家安全构成最大的不利因素，日本与中国之间的矛盾，究其根本是意识形态的矛盾，或者说，如果没有价值观的根本冲突的话，两国的矛盾、利益冲突都有理性法治化的解决途径而不会走向极端，因此，我们也可以说，与中国的基本价值观的对立才是日本国家安全的最主要成因。\n\n远的不说，1989年“六四”之后，中共传统意识形态破产，不得不脱掉其无用的外壳而保留其内核，这种情况下，民族主义、国家利益取代共产主义理想，成为统和社会共识的唯一手段，为了维护共产统治，中共放弃了早先的无产阶级国际主义信念，摇身一变将自己打扮成民族、国家利益的代表。于是，日本就成了最方便的靶子，中共纵容乃至鼓动民间的“反日”力量，转移民众对腐败、法治、人权等问题的视线。\n\n中国政府煽动仇日情绪的另一个原因，是日本与美国的联盟关系，这是中共惧怕“普世价值颠覆”的必然反映。\n\n遗憾的是，日本政府对这种价值的冲突缺少足够的省察。六四事件之后，1990年日本的表现我上面已经提到。\n\n日本的这一做法，可能与对侵华战争的内疚心理有关，也与日本长期轻视中国的经济、军事发展潜力有关，无论1979年开始的对华援助，还是1990年取消对华制裁，都是中共经济发展史上最重要的推动力量之一，日本对当代中共的经济发展起到了不可抹杀的贡献，但日本没有看到中共经济实力的迅速提升和民主化的长期滞后这一矛盾将会给世界，也给日本带来什么样的长远危害。\n\n中国经济实力的提升，首先被中国政府用于军事力量上的提升，于是，日本开始面对这样一个现实：中国正取代日本，成为亚洲最强大国家，而这个国家领导者的政治理念是极为落后的，无论对内对外，它漠视对自己不利的规则。中国开始成为亚洲和平的潜在威胁。然而，以中国体量之大，简单的军事对抗是无法想象的，只有帮助中国实现完整意义上的现代化，即政治民主化，才可能拥有真正的和平。\n\n可是，无论1978年、1990年，还是今天，我们都没有看到日本在这一方面的太多努力，对于中国的人权、法治状况，日本对中国的关注是远远不够的。\n\n如果这样的政策继续下去，虽然表面上可以减少与中国政府的冲突，但是长远来说，不利于化解中国民间对日本的仇视心理。相反，我们可以看到，尽管中国政府对美国的“人权压力”（实际上也远远不够）表现出对立的态度，但在民间，却形成一种强大的亲美潜在力量。\n\n因此，我建议，日本应该调整以前的对华外交策略：将对华民间外交提升到与官方外交同等重要的高度。如果说中日战争对中国造成了伤害，那绝不是伤害了今天的中共政府，所以，日本的内疚心理也好，赔偿意识也好，应该是针对中国民众表现出来，这种善意的表示，最重要的就是帮助中国完成现代化进程。\n\n持有这种意见，并非由于我作为中国民运人士的身份，而是立足于对中日百年历史纠葛和今天中日关系僵局的分析之上的。今天日本不再是二战时的日本，而是一个实现了现代化的民主国家，日本应该有更多的自信心和责任感。\n\n从历史和地理的角度上看，日本对中国民主化的影响能力可能高于欧美国家。历史上日本曾经这样做过，无论最终的效果如何，但我们能够看到，当时的日本以极小的代价，通过支持孙中山等人的革命，在中国发挥过重要的作用。今天，日本对华民间外交的视野应该更为开阔，通过人员往来、思想、文化、教育、经济等领域的民间交流，加深两国民众间的相互了解和信任。当日本选择从各个不同领域展开对华民间外交的时候，中日百年宿怨将真正开启终结之途。我想再次强调说：日本应该将对华民间外交放到比官方外交同等重要的位置考虑。\n\n没有人可以准确预言巨大变革的时机将在什么时候降临中国。但过去几十年中世界上几乎每一个民主革命的事件都让世界感到突然。\n\n最为重要的是要对我的同胞有信心，他们能够而且必将加入世界上大多数已经享有自由或者部分自由的国家行列。变革的时机可能在今后几个月中发生，也可能还要花上好几年。但如果没有集体的努力，包括国际社会的支持，它将不会到来。所以我们必须坚持，保持信仰，并做好准备。?\n\n《公民议报》记者 刘睿"
		},
		{
			"post_id": 297,
			"title": "人与人之间最大的距离，是价值观。",
			"date_published": 1491530079.679,
			"body": "反萨德闹得最厉害的时候，我和朋友一起吃饭。席间很多人对封杀乐天加油鼓劲，大感快意。在如此热烈的爱国氛围中，我一直低头吃饭，未发一言。朋友大感诧异，说你作为一个坚定的反对排外的人，为什么这种场合反而沉默呢？\n\n我说，夏虫不可语冰。\n\n一辈子都活在夏天的虫子，你跟他说这个世界还有秋叶之静美，还有冬雪之晶莹。人品好他会说你胡说八道，人品差会告你造谣。不管我们需不需要保持谦逊，这都是残酷的事实。\n\n我深切的认同这样的话：人与人最大的差距，不是地位、贫富、学历或者美丑，而是价值观的差距。\n\n---\n\n二、\n\n在我的文章还没有某网站全面封杀的时候，我的消息箱里面最多的消息就是“汉奸”“带路党”“卖国贼”“美帝走狗”之类的叫骂。我的文章的跟帖，一半以上是唾骂，甚至连带问候祖宗、家人的也不少。\n\n但我从来没有回应过。往往是一笑了之，甚至看都不看。原因很简单，狗咬了你，你总不能趴着咬回去。这样的交流是背离了传道的初衷的。\n\n除开叫骂，即便是那些要问文雅一点的宇宙真理来开化我、和我辩论的跟帖或纸条，我也不回复。因为差距几百年上千年的价值观，是没有讨论基础的。你跟一个还生活在中世纪笃信地心说的人去谈宇宙大爆炸和量子理论，怎么谈？\n\n三、\n\n事实上，现实生活中的大部分出发点不同的争论都是无效的。\n\n因为价值观的背后，实际上代表了个人的阅历、学识、认知、阶层等等综合性的因素。这些因素，绝不会因为三言两语或一场辩论、一篇文章、一个讲座而改变。\n\n你吃猪蹄喜欢红烧，我喜欢清蒸，这是不同口味，不分高下。但你一定要说红烧就是比清蒸先进，谁他么清蒸谁就不是真的爱猪蹄，这就没法说了；你说这匹鹿不太像鹿，有点像马，这是不同观点，可以接受。但你一定要说这就不是鹿，它就是一只马，这也是没法说了。\n\n共同探讨需要两个基准：一是基本的逻辑推断；二是基本的常识认定。\n\n很遗憾，大部分时候，很多人是不具备这两点的。更多的时候，你面对的只是拿着弱肉强食的准则耍流氓的人，你讲法律的时候他说国情，你说国情的时候他谈阴谋……就是无法讲道理。\n\n四、\n\n有句老话说，你叫不醒装睡的人。还有，那些把睡着当做幸福的人。但实际上，除了一小撮美加澳业主或者家属代表，很多人是真的睡着了。\n\n即便是我们身边那些歇斯底里的爱国者，其实都是很简单的人。在生活中，实际上都是很正常的，践行着传统价值观的好人。他们并不会去结交狐朋狗友，也以认贼作父背信弃义为耻，也相信这个世界总是邪不压正，会越来越好。\n\n只是，只是，长期在地窖中生活，他们拿着最先进的科技工具，却重复着一百年前的祖辈思维，脱离了对现代文明的认知，缺乏最基本的常识学习。一旦遇到打着国家旗号的煽风点火，就极容易被操纵和利用，亟不可待的冲上献祭台。\n\n前不久有个读者说，你就不怕中国变成伊拉克吗？我说你知道伊拉克现在什么样吗？你知道伊拉克总人口比萨达姆时期增长了50%，实际GDP已经比战前翻了两番，人均国民总收入是战前1.8倍……你知道新闻联播的水深火热，自然就看不到这个世界的变化。\n\n这不完全是他们的错。人是一种特别容易被圈养的动物。篡改一个国家的历史，只需要一代人。但一个国家的觉醒，可能需要一代又一代的努力。\n\n五、\n\n既然交流如此的低效，我们还需不需要勇敢呐喊，捍卫真正的人的价值和尊严？\n\n当然需要。\n\n山东辱母杀人案发生后，如果细心一点，我们会发现，即便有组织的洗地文章那么多，不乏极力抹黑受害者的下作，但还是有很多人发出了“母辱不卫，国辱关我卵事”的感慨。这些人，可能前一天还在热烈的响应抵制乐天的号召，还在沉醉于为国报仇的快意，但转瞬之间，残酷的现实终于让他们看到，如果不能保卫自己的亲生母亲，那保卫什么祖国母亲只能是扯淡。这个时候的每一嗓子，都可能会成为触动这类人觉醒的契机。\n\n现实是最好的教员。当俄罗斯人在普京“给我二十年还你一个强大的俄罗斯”的迷梦中熬过二十年后，才发现二人转的体制除了培养出一堆包括普京和梅弟在内的一堆窃国寡头外，可怜的俄罗斯依然距离强大很远，反而成了国际社会的孤儿。\n\n当真的有人站出来高喊“不需要普京的俄罗斯”后，应者云集，沙皇的幻象急速破灭。这正是呐喊的意义。\n\n六、\n\n青山遮不住，毕竟东流去。不用水晶球我们也能预见这个世界未来的诸多变化。有缺点的战士终究是战士，再完美的苍蝇终究是苍蝇。概莫如是。\n\n来源:\n二大爷别院\n作者: 二大爷"
		},
		{
			"post_id": 296,
			"title": "中共政权崩溃的时间点",
			"date_published": 1491365465.103,
			"body": "看了《2017 中國破局與民主新希望研習营會議》的一些视频，看到大家对中共政权的崩溃都很有自信，大家情绪都很高涨。海外民主运动总算走出低谷，迎来高潮了。我也很感高兴。有幸见证中共政权的崩溃，实在是人生一大乐事。\n\n不过，参加研習营會議的人士对中共政权崩溃的时间点都无法预测，对中共政权的崩溃方式也无法预期。政变说之类的也没有令人信服依据。\n我对中共政权崩溃的时间点，及中共政权崩溃的方式，倒可以做出明确的预测。而且我可以论断，这个时间点掌握在我们手上，不掌握在中共手上。\n\n---\n\n中国民主革命的进程由我们主导，不是由中共主导。\n\n经过我长时间的试用，zeronet的博客已经很理想了，完全可以用做新闻网站，把海外的信息直接放到国内去。zeronet的聊天室，论坛也很成功了，都可以在大陆推广开来。这样就完全打破中共的网络封锁与舆论控制了。\nP2P的软件并非只有zeronet一个，是有很多的。zeronet的成功，说明P2P技术已经完全达到实用的程度了。其它的P2P软件也一样可以在大陆推广开来。twister只差一步就成功了，resilio只要增加一个前端界面就与zeronet完全一样，区别只在zeronet使用数据库技术，resilio完全把数据存放在你的硬盘上。\n\n中共是个靠谎言及舆论控制维持的政权，只要P2P网络在大陆成型，中共就无法控制舆论了，谎言都被拆穿了，中共政权崩溃的时间点就到了。当然我这样说太过笼统，还是不够具体。\n\n具体的说，只要现在海外的新闻网站及各海外民运组织的网站都用零网博客把海外的新闻及各民运组织的宣传直接放到国内去。那么，接触到国外信息的人数立刻就比现在要成倍数的增加。我认为，短时间内就可以达到20万人左右。当然这是需要大家努力推动的。\n\n这样一个稳定的P2P网络就可以在大陆成型。P2P网络是在大陆形成，这与从国内翻越中共防火墙不同，一方面中共无法封锁，另一方面，它的传输速度快，很多人愿意使用。现在使用翻墙软件，一方面要准备多个梯子，另一方面速度很慢，这确实是阻挡了大部分人接触海外网站。不然中共也不会投入大量的资金与人力。\n\n一旦零网的站点在大陆达到20万，中共除了彻底剪断所有的网络，关闭手机无线通讯之外没有别的办法。要么完全失去舆论控制权，要么彻底没有网络。\n\n彻底剪断网络，就是年轻人占领广场的时候。不剪断网络，在零网站点达到20万之后的半年，就是中共政权崩溃的时间点了。\n所以，中共政权崩溃的时间点是掌握在我们的手上，端看我们如何去推广P2P软件的应用。我们能在一个月的时间内在大陆建立20万个零网站点，半年后中共政权就崩溃。我们只是在海外自娱自乐的鼓吹民主革命，那么中共政权崩溃的时间点，中共政权的崩溃方式，就得听天由命，无法预测。"
		},
		{
			"post_id": 295,
			"title": "《革命策》",
			"date_published": 1491183626.496,
			"body": "辛亥革命的经验依然值得我们借用\n\n辛亥革命时期暗杀团的暗杀目标是非常明确的，针对清廷的省部级以上的官员，军区司令，皇太后行刺。所以，他们搞了50多次暗杀行动，却没有民众抱怨是恐怖活动，反而受到民众的支持。这与穆斯林极端分子炸平民百姓是完全不同的。\n\n---\n\n辛亥革命时期暗杀团把目标直接对准统治集团的高层，是一个很好的策略，具有极大的震撼效果。最好的例子是秋瑾一案的主审官，最后居然在多地都无法上任，被逼自杀。可见当时社会舆论的压力。（比较一下现在的“犯官”异地上任。）\n\n辛亥革命的组织策划人员都是当时中国的精英人才，他们的经验现在依然值得我们借用。辛亥革命是在缺乏武器，缺乏资金，缺乏物资，缺乏外援的情况下，依靠自己的力量，用正确的方法，推翻了强大的满清皇朝。从1904年光复会建立暗杀团，仅3-4年时间，到1907-1908年，革命形势就大为改观，到1911年武昌起义，仅用了7年，就推翻了强大的满清皇朝。\n\n中共的所谓“农村包围城市”，那只是编故事骗小孩子的。中共完全是依靠斯大林这个“父亲”提供的武器，资金，人员，物资才夺取了国家政权。\n\n当然，现在的社会形态，科技水平，资讯流通，交通发达程度都不是辛亥革命时期可以比的。比如辛亥革命时期革命党都是自制炸弹，经常在制作时出意外。现在我们可以用定时炸弹，遥控炸弹，声控炸弹，感应炸弹。\n\n而且我们现在还能争取各种国际支援，武器，资金，物资，战略指导，组织策划。我们现在并不需要完全照搬辛亥革命的经验。我们只需参考辛亥革命的经验，就可以更容易的达到推翻中共独裁统治的目的，就可以在更短的时间内推翻中共的统治。\n\n比如，辛亥革命时期暗杀团的暗杀目标是针对清廷的省部级以上的官员，军区司令，皇太后。但是策划一次这样的暗杀行动准备时间是很长的，联系沟通，人员往来，策划行动细节，一般要几个月时间。现在我们并不需要一开始就把打击目标对准省部级以上的官员，军区司令，习近平，但是可以达到同样的震慑目的，而且可以在很短的时间内就展开打击行动。\n\n习近平现在是依靠“公，检，法”这个“刀把子”来实行恐怖政策，打击民主人士及维权人士，妄想以此来阻吓民主运动与公民运动。但是现代社会没有法院判决就不能把人关进监狱，不管公安，检察院怎么无法无天，只要法官不判罪，就奈何不了你。而且还可以对公安，检察院的无法无天提起诉讼，要求赔偿。还能对公安，检察院的无法无天提起责任追究。\n\n所以，打击充当中共“刀把子”的法官是个关键！打到没人敢充当中共的“刀把子”，打断习近平的“刀把子”是关键。打击充当中共“刀把子”的法官就同时震慑了公安与检察官，也一样震慑了中共的高层，因为极大多数中共高层官员的家属，财产都在欧美国家。\n\n对这些充当中共“刀把子”的法官只需“暴打”一顿就能收到足够的震慑效果。\n\n而且打击这些“刀把子”非常容易，并不需要准备几个月的时间。打击这些“刀把子”也没有什么危险，太容易脱身了。中共的公安破案能力相当低的，看看那么多的冤案就知道了。看看这么多的官员死的不明不白就知道了。\n\n安徽阜阳一村委会副书记家门口身中4支毒镖身亡，到现在也没有破案。2014年6月14日藏族义士血呷击毙四川新龙县维稳办副主任张伟，至今依然在逃，很可能已经逃亡境外了。出动了1万多正规军围山搜捕的周克华，至今都生死不明，到底击毙的是什么人无人知晓。\n\n打击充当中共“刀把子”的不法法官只需产生震慑效果，并不需要打死。所以即使无法脱身，也没多大风险。无非坐一阵子牢，共产党都要垮台了，还怕坐共产党的牢吗？能坐多少时间？再说，“暴打”这些充当“刀把子”法官只是一个前期警告，后继的震慑是用炸弹。没有几个法官愿意以自己的身家性命来维护赵家人的政权的。\n\n打击的目标应该非常明确，直指审理“寻衅滋事罪”；“扰乱公共场所秩序罪”；“煽动扰乱公共场所秩序罪”；“煽动颠覆国家政权罪”；“颠覆国家政权罪”的法官。正面打击习近平的嚣张气焰。\n\n辛亥革命时期暗杀团的组成一般是4-5人为主要成员，设立在境外。暗杀计划策划，资金筹划等都在境外进行。计划完成，资金筹划完成，物资准备完全，派人潜入内地做前期准备，包括暗杀目标侦察，具体操作步骤安排等。（在这个阶段并没有危险，也不会被当局破获。）前期准备完成后，派入1-2执行人员，等待机会执行。\n\n因为前期警告只需对目标法官实行“暴打”即可。参考辛亥革命时的模式，现在可以在境外组织“暴打组织”，负责资金筹划，安排顺利出境的路线，列出具体目标等。然后派出1-2人进行前期侦察，弄清目标的住处，经常出现的场合，周围的环境，监控头位置，撤退路线等。\n\n由于现在的通讯发达，已经不需要像辛亥革命时期派人潜入，在国内就可以有前期的侦察人员。侦察人员通过网络接受任务，获得所需情报以后交给境外组织指定的执行人员，随即脱离当地（当然交的方法有很多）所以不会有大的危险，即使执行人员执行任务之后无法脱身也没有危险，因为执行人员不认识侦察人员，甚至都没有见过面。\n\n执行人员接受任务后只需等待机会执行，然后快速脱离现场，一次震慑行动便告完成。\n\n对于经过警告性“暴打”依然猖狂地充当中共“刀把子”的法官，必须定点清除。定点清除也只需按上面的步骤即可。同样，打击政法委官员，省委书记等猖狂人员也只需按上面的步骤即可。\n\n光复会暗杀团的组织是非常严密的，互相之间甚至都不认识，各阶段的执行人员都是光复会成员。支那暗杀团只招收同盟会会员，同样各阶段的执行人员都是同盟会成员。\n\n不过，看看中共那些鸟官“双规”时尿裤子的吊样，看看那些官员接二连三跳楼的吊样子，看看习近平无法无天玩“刀把子”却没有一个高层官员敢站出来说一句的吊样，我不认为需要去扔炸弹，“暴打”一顿足够了，吓死他们了。\n\n“暴打”充当中共“刀把子”法官的风险并不大，可以选在人多的地方，如商场，地铁站，以故意找茬的方式，寻衅滋事，暴打一顿，扰乱公共场所秩序。按照现在的社会环境，只会有人围观，不会有人报警。也可以在人少的地方，暴打一顿。\n\n而且由于中共警察的主要功能是按照上级指示从政治方面镇压民众，所以他们的刑事侦察能力是非常低的。虽然他们以“寻衅滋事”的名义抓捕过大量的人，但是对于这种真正的“寻衅滋事”，他们根本就束手无策。\n\n基于这个原因，执行人员不必是革命党人，可以通过网络大量的招收社会人员，支付报酬就行了。由于风险比较低，容易脱身，即使脱不了身，也就是短期坐牢，招收执行人员比较容易。一个省会城市10组“暴打”人员，只需招募20-30人即可。全国只需招募200余人即可形成极大的威慑力量。每“暴打”一个“刀把子”支付1万美元，成本也能承担。\n\n每个“暴打小组”独立行动，互相不能联系，免得被一锅端了。只能从海外接受任务。只要没有一锅端，即使被抓一些，中共的“刀把子”也有顾忌。“暴打小组”只需建立在东部沿海，从东北一直建立到广东，西部地区意义不大。东部沿海都建立以后，对西部地区具有同样的威慑力。\n\n建立了“暴打小组”之后，革命形势就会有极大的转变，接下来就是全力推动民众占领广场。\n\n齐尔塞斯库把民众聚集到广场，一个星期政权就垮台了。我们需要多少时间才能把民众聚集到广场？3个月时间？那么中共政权的垮台时间就是3个月加一个星期。6个月时间？那么中共政权的垮台时间就是6个月加一个星期。12个月时间？那么中共政权的垮台时间就是12个月加一个星期。\n\n中共的垮台是必然的，而且时间也不会太久。现在就看我们如何去做。必须明白，中国民主化的进程由我们主导，不是由中共主导，更不是由习近平这小丑主导。"
		},
		{
			"post_id": 294,
			"title": "《民主革命领袖教程》",
			"date_published": 1491092960.55,
			"body": "![1.jpg (0x0)](data/img/post_294_1.jpg)\n\n**（第一章）革命需要领袖**\n\n这里说的民主革命是人民革命，不是武装革命。人民革命与武装革命不同，武装革命只要有世界民主阵营的支持，只需几百人，几千人就能推翻共产党政权。\n\n人民革命不同，人民革命需要几十万人，几百万人敢于站出来。仅有几十人，几百人，几千人，甚至几万人都不可能成功。\n\n* * *\n\n而且要几十万人，几百万人敢于站出来直接反对共产党政权才可能成功。任何以反腐败的名义，维权的名义，或者要求共产党某个领导人下台而站出来都不会成功。就像法轮功人数极多，但始终不能成功。像89年6-4时期，不敢公开要求共产党下台，最终导致人民革命失败。最近的例子如茂名维权。\n\n如何让几十万，几百万的人公开站出来反抗中共极权，这是一个民主革命领袖人物首先要考虑的问题。\n\n只有极少数的人天生无所畏惧，绝大多数人的勇气是需要逐步提升的。也只有极少数的人受到压迫会不计后果的反抗，绝大多数的人会权衡得失。同样只有极少数的人会在自身利益没有受到直接损害的情况下冒很大的风险站出来，绝大多数的人要在自身利益受到直接损害的情况下才会冒很大的风险站出来。\n\n要让几十万，几百万的人公开站出来反抗中共极权，平均到每个省，一个省就得至少有上万人敢于站出来。这个是有很大的难度的，但是只要方法得当，也是可以做到的。\n\n现存的自身利益受到直接损害的就有3大群体，一个是访民群体，一个是失业工人群体，一个是法轮功群体，这3个群体的人数就过百万。平均到每个省就已经过万，这些人是敢于公开站出来的，当然他们的诉求不是直接要求共产党下台，需要逐步引导。\n\n访民群体，失业工人群体，法轮功群体,再加上潜在的敢于站出来的市民，人民革命的条件是完全具备的。但是作为革命领袖，你也应当明白，这些都不是民主革命的领导力量。\n\n民主革命的领袖要做的是寻找革命的领导力量与中坚力量，带领这些群体站出来反抗中共暴政。民主启蒙，批判中共，都不是民主革命领袖人物现今该做的工作。\n\n**（第二章）寻找民主革命的领军人物与中坚力量**\n\n要想在全国范围发动几十万，几百万人勇敢站出来，就得在每个省会城市发动几万人站出来。要能在每个省会城市推动几万人站出来，至少需要在每个省会城市发展出几十个领军人物，全国就得发展出几千，上万个领军人物。\n\n其实说起来也不算多，上万个领军人物，并没特别大的危险，申请难民加拿大一下子就全部都接收了，台湾都能一下子全部接收。有西方民主阵营这样的保障，每个省会城市发展上百个领军人物并不困难。\n\n就现在来说，每个省会城市5-10个领袖人物是有的，由这些领袖人物每人再发展10几个领袖人物，就有几十，上百的领军人物了。现在的网络通讯很发达，建立全国性的组织并非必要，民主革命的积极活动人士只需在自己所在的省份努力发展，重点在省会城市。\n\n寻找革命的领军人物可以通过网络，也可以通过朋友，亲属，同学会，工作单位的同事。围观，举牌，同城聚餐也是很好的方式。甚至还可以通过海外的民运团体为你推荐所在地区的民主斗士。\n\n同城聚餐要避免过多的同质重复，不然就会流于清谈。参与围观，举牌要与尽量多的活动人士交换通讯方式，不然你就不是一个民主革命的领袖人物了，只是一个普通的维权者，或者是一个普通的参与者了。民主革命的领袖人物参与围观，举牌的目的是寻找革命的领军人物，不是去扩大声势。\n\n民主革命的领袖人物要有造就别人心胸，不然你不会成功。因为在你鼓励下敢于站出来的人的活动能力，交友能力，组织能力完全可能远超过你。你发展10个人都感觉很困难，他完全可能发展几十个人都不感到困难。在你所在的城市推动几万人出来抗争不是容易的事，必须在运动中发现出能力超强的人物，配合他开展活动。\n\n寻找民主革命的领军人物与中坚力量是人民革命能否开展起来最关键的一步。\n\n**（第三章）消除民众的恐惧心理**\n\n消除民众的恐惧心理是人民革命最重要，最关键，最困难的一步。因为共产党政权就是靠制造恐怖维持的。习近平现在就在制造恐怖，以此避免中共垮台。民众的恐惧心理消除了，中共也就垮台了。\n\n消除民众的恐惧心理门槛要低，越低越好。脑残爱国游行为什么会有这么多人？因为没有恐惧。即便在美国，英国脑残爱国游行也能聚集大量的脑残，如果有参与者全部驱逐回中国的恐惧，就没有人参与这种脑残活动了。\n\n消除民众的恐惧心理门槛最低，成本最低，效果最好是张贴传单，派发传单。围观不错，鼓励当事人，但是飞来飞去限制了很多人参与，门槛有点高。同城聚餐，举牌，只能发到网上才有点影响力，现实空间的影响实在太小。唯有张贴传单，派发传单在现实空间有影响力。\n\n张贴传单能长时间留在那里，影响时间长久，成本却很低，门槛也很低，什么人都能参与。派发传单虽然时间不长，但是面对面的影响力却是超过张贴的效果的，而且门槛也低，什么人都能参与。\n\n张贴传单，派发传单的风险可控，对刚参与民主革命的人没有太大恐惧感。传单的内容一开始可以是联合国人权宣言，这个中共很难找出理由来抓捕。如果传单的内容是联合国人权宣言也有顾虑，还可以再降低风险，张贴，派发“改革大法好”也是可以的。把参与者的风险降到尽量低。逐步提高参与者的勇气。因为张贴，派发传单不是目的，只是一种手段，目的是联络人员，扩大影响，发现革命的领军人物。\n\n作为民主革命的领袖人物，尽量不要自己亲力亲为的去张贴，派发。你的作用是组织活动，提供材料，联系人员，发现人才，籌募资金，解决参与人员的后顾之忧。\n\n这种时候还不是一个民主革命领袖人物冲锋陷阵的时候。你冲锋陷阵的时候是在占领广场以后站在最前面扔汽油弹，在攻打各地中共党委的时候像辛亥革命时期的蒋介石一样，身上绑满炸弹冲进去。\n\n**（第四章）转移处于危险的积极参与者**\n\n无论民主运动如何低调，都会遭到中共的严厉镇压，这是共产党政权的本质决定的。所以对于积极参与者随时要做好安全转移的准备，把处于危险的积极参与者送到境外，申请难民，移民欧美。\n\n作为领袖人物，建立一个安全的通道，与海外民运团体取得联系，把处于危险的积极参与者送到境外，是决定你能否成功的关键。如果你领导的民主团体中处于危险的积极参与者都能安全逃亡，移民欧美。那么你的团体就会有越来越多的人加入，很快就能达到带领民众去占领广场的规模。如果你对中共的抓捕束手无策，只能喊几句口号，发几个帖子，那么你领导的团体很快就会被打散。\n\n从中共的方面来说，你作为领导者才是真正要严厉打击的对象，具体在外面张贴传单，派发传单的反倒不是中共要严厉打击的对象。中共不会抓几百几千个张贴传单的失业工人关几年，出来后又变成访民。中共要抓的是你这个领导人物，但是你即不能随便逃亡，又不能随便去光荣坐牢，因为你是领袖。所以这个是难点，是需要你有点智慧去解决的。\n\n所以你要避免与直接行动人员接触，要通过一个中间层运作。并且，这个中间层的活动人员不能长期工作，工作一段时间以后就送出国外，让他去申请难民，移民欧美。你作为领袖人物，至少要做到一年内不能被中共抓捕，一年以后中共就完蛋了。\n\n**（第五章）募集资金资助受难家属**\n\n募集资金资助受难家属与把处于危险的积极参与者送到境外申请难民一样重要。无论你如何小心，如何低调的推广民主运动，公民运动，宣传民主，法治，都会遭到中共的严厉打压，都会有人去坐牢。\n\n所以作为领袖人物，你从一开始就要考虑如何募集资金资助坐牢朋友的家属。募集资金的重点要放在海外，通过海外的民运团体募集。因为国内的工商人士向你提供资助很快就会被中共打压的。海外有很多民主基金会，人权团体，NGO，宗教团体，等各种形式的组织向世界各地的遭受迫害的人士提供各种资助。\n\n当你领导的民主团体的活动已经有一定的影响力的时候，海外的各种团体会主动与你接触的。\n\n把处于危险的积极参与者送到境外申请难民，募集资金资助受难家属，这2件事做好了，你领导的民主团体就会越来越壮大，所有的参与者就没有太大的恐惧了。很快你就能把你领导的民主团体发展到能够领导民众占领广场了。你只需等待一个时机，占领广场，你就是推翻中共暴政的伟大英雄人物了。这个时机很快就会来临的。\n\n把自己培养成一个民主革命的领袖人物吧！在这2000年未见的伟大变革时代写下你浓墨重彩的一笔！在你人生的历程中写下永远值得你自豪的一页！\n\n**（第六章）占领广场！最后决战！**\n\n作为民主革命的领袖人物，你的全部目标就是占领广场，带领愤怒的民众占领广场。首战即是决战！\n\n不管是以反对腐败占领广场的，还是以农民工讨薪，访民抗议，环保诉求，养老金问题等等起因占领广场的，一旦占领了广场，立即把口号提升到打倒中共！推翻暴政！首战即是决战！\n\n不参与任何对话，不接受任何妥协，目标明确就是打倒中共！推翻暴政！首战即是决战！\n\n一旦占领广场，立即修筑街垒，燃烧汽车轮胎，造成声势。\n\n一旦占领广场，立即组织“百人队”。\n\n一旦占领广场，立即武装起来，囤积汽油瓶，夺取派出所武器，敢于反抗者立即镇压。对敢于组织镇压的中共官员，立即展开报复。\n\n一旦占领广场，立即把西方势力的旗帜都打出来，直接面对中共的所谓西方势力操控的舆论挑战。\n\n一旦占领广场，立即把各地独立的旗帜都打出来，直接面对中共的所谓分裂势力操控的舆论挑战。\n\n不必太过担心中共军队镇压，一旦全面占领广场，新疆，西藏，云南，广西，广东，福建，浙江，江苏，山东，东北，内蒙古都可能发生武装起义。\n\n不用怀疑这个占领广场的时机会否出现。上千万的访民的诉讼成本早就已经高到无法解决了；工人失业的情况会越来越严重；法轮功事件牵涉的责任人员多到无法解决；政府部门庞大到足以压垮地方政府财政。\n\n以习近平的智商也就是开足印刷机印钱来应对。大概通货膨胀导致物价暴涨，经济衰退导致的严重失业问题，股市下行造成的投资人利益问题，会与6-4这个敏感时间点会合。2016年夏天将是一个非常敏感的时间点。\n\n民主革命的领袖们，你们准备好了没有？推翻暴政在此一举！"
		},
		{
			"post_id": 293,
			"title": "南蒙古大呼拉尔议会法国分部人员应邀参加藏人反抗中国殖民暴政58周年游行示威活动",
			"date_published": 1491018363.619,
			"body": "![1.jpg (0x0)](data/img/post_293_1.jpg)\n\n![2.jpg (0x0)](data/img/post_293_2.jpg)\n\n![3.jpg (0x0)](data/img/post_293_3.jpg)\n\n![4.jpg (0x0)](data/img/post_293_4.jpg)"
		},
		{
			"post_id": 292,
			"title": "中共对全体民众的3次财富大抢劫",
			"date_published": 1490679316.913,
			"body": "中共对全体民众的第一次大抢劫是从1946年开始的。土改，三反五反，工商业改造，人民公社，一直延续到1959年，直到饿死几千万人才停止。这次抢劫的对象主要是地主的土地与家产，资本家的工商企业。\n\n中共对全体民众的第二次大抢劫是从1966年开始的。这次抢劫的对象主要是资本家的房产与美元黄金，及一般中产阶级的房产。这些普通中产阶级即不算地主富农，又不是资本家，反动军官，只是普通的有产阶级。\n\n中共对全体民众的第三次大抢劫是从1979年开始的。一直延续到今天。这次的抢劫是从国有企业改制开始，扩展到医疗，教育，股市，房地产。现在主要是对农村土地与房产的抢劫。\n\n中共的3次大抢劫遍及社会的所有阶层。无论地主富农，资本家，工商业者，还是普通中产阶级，工人，农民，无一幸免。"
		},
		{
			"post_id": 291,
			"title": "大康药房的故事",
			"date_published": 1490679226.296,
			"body": "![113.jpg (0x0)](data/img/post_291_113.jpg)"
		},
		{
			"post_id": 290,
			"title": "老兵扫墓，公安取证忙。",
			"date_published": 1490610443.24,
			"body": "![6.jpg (0x0)](data/img/post_290_6.jpg)\n\n![5.jpg (0x0)](data/img/post_290_5.jpg)\n\n![4.jpg (0x0)](data/img/post_290_4.jpg)\n\n![3.jpg (0x0)](data/img/post_290_3.jpg)\n\n![2.jpg (0x0)](data/img/post_290_2.jpg)\n\n![1.jpg (0x0)](data/img/post_290_1.jpg)"
		},
		{
			"post_id": 289,
			"title": "如此盛世",
			"date_published": 1490453426.471,
			"body": "![124.jpg (0x0)](data/img/post_289_124.jpg)"
		},
		{
			"post_id": 288,
			"title": "斯大林故乡禁止传播共产主义",
			"date_published": 1490453381.688,
			"body": "![123.jpg (0x0)](data/img/post_288_123.jpg)"
		},
		{
			"post_id": 287,
			"title": "你以为你是谁？",
			"date_published": 1490316861.916,
			"body": "2016年8月17日墙外仙\n作者：孙立平\n\n经常弄不清自己是谁；放历史情境里，更不知道自己会是谁。\n\n多年前的一天，我列举了中国历史上一大堆文学家、艺术家、科学家、教育家、政治家等著名人物，然后问学生们：你最崇拜其中哪一位？\n\n被选择最多的群体是政治家，政治家中被选择最多的是可想而知那几位，可想而知那几位里被选择最多的是成吉思汗。\n\n---\n\n理由是，当时国家最强，打的最远，疆域最大，一代天骄，举世无双，“有威名、有魄力、有智慧、异常英勇……”\n\n接着，我问了这样一个问题：如果恰好活在他那个时代，想一想，你会是谁？\n\n问题显然有点出乎意料，众人一时摸不着头脑。\n\n好吧，我来帮你们设想一下。\n\n首先成吉思汗就一个，成为他的可能性几乎没有。退而求其次，宗室诸王、万户官、千户官，一共分封还不到百人。\n\n你不怕流血厮杀，想象当个勇猛的骑士也不错，这也一共才几十万。\n\n就是整个蒙古民族，当时不过百多万，在中国版图内各民族人口中属于很少一部分，就整个欧亚大陆来说更是如此。\n\n成吉思汗曾说，男子最大之乐事，在于压服乱众，战胜敌人，夺取其所有的一切，骑其骏马，纳其美貌之妻妾。历史记载，蒙古铁蹄所到之处，屠城无数，哀鸿遍野，文明摧毁，满目疮痍。\n\n而你，从概率上看，最有可能是家产遭掠，亲人被夺，沦为奴役，甚至死于非命的被征服民族中一员。\n\n就算你熬过了战乱，别忘了蒙古统治者还把人分为四等：蒙古人；色目人，即中西亚人；汉人；南人，也就是南宋人。后两种人按规定被打不能还手，十户一把菜刀，结婚蒙古人有初夜权，人老直接送坟墓等死，不准集会、不准拜神、不准打猎、不准买卖……你觉得你更可能是哪一等？\n\n就算你幸为蒙古人，那又如何？蒙古人也要提供大量赋役，遇到征伐，还要自备马匹、兵械、衣食出征，为筹备这些有人甚至要出卖妻儿。出征一次多少年，常常一去不复还……\n\n说到此，我停下望着他们，底下一片沉默。\n\n现在，社会变迁，思维多元，但弄不清自己是谁这种症状并未明显减少，依然经常有所表现。\n\n那年，美国发生911恐怖袭击，竟有那么多人欢呼喝彩。国际上每每发生恐怖袭击事件，尤其针对西方国家，都不乏叫好之声。恐怖主义本来是无规则、无底线、无差别的反人类，是世界公敌，好多人却当成了反对霸权的英雄。后来，塔利班组织在巴基斯坦一个高山上，杀害了多名登山者，其中包括两名中国人，有些人才惊异的意识到，恐怖分子原来也杀中国人。你以为你是谁？\n\n有次国庆节在家看电视，又见圆明园里一女游客在镜头前谈爱国，说看了遗址心里特别不舒服，侵略者把我们这么美好家园给破坏，现在他们不敢了，我们人民也不允许这样。一时间声泪俱下。\n\n且不说那场战争的发生清朝有多大责任，更不为事实俱在的抢劫辩护，我只想小声提醒一下这位女士，如果您不姓爱新觉罗，就请注意点产权问题。那圆明园是皇帝的私家园林，好像没您什么事儿，别我们我们的，那时候就算没烧，能让您进去？就是现在，您也是买了门票的吧。\n\n最近，又时常听到有人怀念、颂那个“火红年代”。先看看下边这些，你觉得你那个时候会是谁：“造反有理”的学生；“广阔天地练红心”的知青；遭遇“自然灾害”的农民；“停产闹革命”的工人；“知识越多越反动”的知识分子；“地富反坏右”或他们的子女；被打倒的“走资派”；被揪斗的“牛鬼蛇神”；死得不明不白的将军、元帅、国家主席……\n\n你对伟大领袖“与人斗其乐无穷”、“为有牺牲多壮志，敢叫日月换新天”的豪迈敬佩得五体投地，你怎么知道被斗的不是你，牺牲的不是你？核战争有什么了不起，中国6亿人，死一半还剩3亿，你怎么知道你不是死的那一半？\n\n当你为一种力量的崛起而叹，乃至热血沸腾的时候；当你为一种力量的覆灭而悲情，感到愤怒屈辱的时候；当你为一种力量的肆虐而欢呼，感觉事不关己，幸灾乐祸的时候，最好先想一想这个问题：\n\n你，以为你是谁；你，以为你会是谁？！"
		},
		{
			"post_id": 286,
			"title": "致吴越地区公安，国宝的公开信。",
			"date_published": 1490316728.029,
			"body": "80年代，日本经济最好的时候，我在东京生活过。中国经济最好的时候，我在上海生活。我从直觉上能感觉到，中国经济最好的时候与日本经济最好的时候相比，上海人的生活水平比东京人差了一半。\n\n---\n\n从经济最好的时候两个很具代表性的行业建筑业与餐饮业看，日本当时建筑工地一个小工，也就是负责扫扫地，捡捡垃圾之类的工作，工资是日元8000-10000/天，约合当时的美元，每天30-40美元。上海建筑工地没有这样的小工，不过上海建筑工地一个普通技术工是100块人民币一天，约合美元16块。\n\n日本当时餐馆一个洗碗工是700日元一小时，约合当时美元3块。上海是按月计算，前几年是1千多人民币一个月，现在应该是2000一个月，大约每天80人民币，比建筑工地少些，约合8块一小时，折算成美元是1.3美元一小时。\n\n当时在日本，一碗面或者一个午饭定食是500日元-700日元，是洗碗工一小时的工资或者不到些。上海现在一碗面，或者一个中午普通快餐大概是12-15块，高于餐馆工一小时的工资。\n\n所以，从工资与物价来比较，我的直觉是有依据的。\n\n日本从50年代开始，经过30年的发展，到80年代发展成了发达国家，中国从79年改革开放算起，到09年也是30年，可是上海人的生活水平却比东京人差了一半，要知道，上海79年时的基础远远好过东京50年代。\n\n为什么会差这么多呢？你可能会想，中国地方大，很多地方都很穷，上海要支援这些落后地区。你错了，这30年中，没有一个地区是依靠上海的福利生活的。\n\n而且，上海直到现在很多人还居住在非常差的环境中，80年代的东京是没有这样差的居住环境的。\n\n上海的污染之严重也是80年代的东京所没有的，治理这些污染是要花很多钱的。80年代的东京也没有有毒食品。\n\n更重要的是，中国这30年的发展是通过强拆强征，强占民房发展的。这是日本没有的。这其实是一笔欠账，是一笔很大的欠账，如果上海要偿还欠账，赔偿强占的民房，总体上海人的生活水平还得下降。\n\n那么到底是什么原因，上海人的生活水平会比东京人差这么多？钱到哪去了？这个问题我也困扰过，直到海外揭发出红二代们数以百亿美元计的财产，我才明白，中国这30多年的发展，有一半的财富都被红二代及与他们勾结的利益集团拿走了。\n\n吴越地区的公安，国宝们，你们甘心吗？\n\n或许你认为凭你在公安系统，国宝系统所建立的关系，你的子女以后也能参与这财富分割游戏，也能发大财。我告诉你这是很危险的。你应该看到这几年有多少官员自杀。习近平上台后抓了多少平民出身的贪官。即便你或者你的子女能爬到江泽民这样的地位，江泽民能保证他死后他儿子没事吗？\n\n因为你不是赵家人！你参与这样的财富分割游戏是很危险的。\n\n或许你认为你的子女不进入体制，仅凭你在公安，国宝系统建立的关系做生意，一样可以发大财。那么，牟其中，袁宝璟，刘汉，吴英等等都是榜样。因为你不是赵家人！你参与这样的财富分割游戏是很危险的。\n\n上面啰里啰唆的说了一大堆废话，现在说正经的。\n\n吴越地区只要独立，没了红二代贪腐集团，很快大家的生活水平都能提高一大截。中国傻逼多啊，管不了其它地区了，我们管自己就是了。\n\n现在那些访民，那些举牌的人士，那些围观法院开庭的人士，那些宣传主张民主的，反共的，民国派，要求官员公开财产的，他们做的都是红二代贪腐集团最恨的。可是对你，对你的下一代，对我，对这些维权人权，民主人士都是有好处的。\n\n你们没必要去盯着他们这么紧，让他们去折腾，让他们去串联，他们冲在前面对我们有好处，对我有好处。湖北有个访民来上海去管他干什么？傻逼才去管。你们要是够胆，就暗中支持他们，鼓动他们。没胆就眼开眼闭，能交差就行。访民中有要出国申请难民的，多开几张拘留证，逮捕证，让他们去申请难民，这对我们有好处。\n\n再说，中共很快就要倒台了。这点你们比我们清楚，你们整天到处维稳，加班加点，很清楚现在的局势。依我判断中共明年就会倒台，你们可能不相信这么快。不管如何，反正总是要倒台了，最愚蠢的事莫过于，你没参与红二代的抢劫，中共倒台后你倒要上人权法庭受审判。千万别干这种蠢事。\n\n吴越独立才是我们共同的利益。特别是上海地区的公安，国宝，上海地区很快就会成为人民革命的重点地区，你们自己把握分寸，不要严厉打压和平的民主运动，如果和平的民主运动被严厉镇压，北京，上海，广州是革命党重点扔炸弹的地区。弄到革命党到上海扔炸弹大家都没好处。\n\n你是访民你就打印一张随身带着，警察抓你到派出所，你就把这交给他，他不是疯子的话，应该不会太为难你了。他是上海的警察应该知道我说的都是真实的，他不是上海的警察，生活水平更差远了，他没底气跟你发疯。"
		},
		{
			"post_id": 285,
			"title": "善意提醒中共网警",
			"date_published": 1490316558.625,
			"body": "![118.jpg (0x0)](data/img/post_285_118.jpg)"
		},
		{
			"post_id": 284,
			"title": "往广场一坐问题就能解决",
			"date_published": 1490316448.975,
			"body": "![119.jpg (0x0)](data/img/post_284_119.jpg)"
		},
		{
			"post_id": 283,
			"title": "四川老兵上街啦！",
			"date_published": 1490255065.77,
			"body": "![1.jpg (0x0)](data/img/post_283_1.jpg)"
		},
		{
			"post_id": 282,
			"title": "形势大好，同胞们请随我上街！",
			"date_published": 1490254889.006,
			"body": "全国所有良心未泯的同胞们，如果你们希望自己的子孙更多阳光、更少雾霾、上得起学、买得起房、就得了业…就请跟我老秦上街散步、围观！\n\n现在形势大好，十月十一日我们老军人已经有一万五千人聚集在北京中央军委八一大楼围观，现已有十多个小时，我们准备今晚在八一大楼周围过夜，只要坚持到天明，北京周边四省的十万参战老兵就会进京声援！\n\n---\n\n这次我们这么多人能顺利地围观“八一”大楼，出乎我们意外，昨天，有我们无法核实的小道消息说：中央有人故意放我们进来，希望我们闹得越大越好。\n\n总之现在形势很好，时机很好。全体访民们、全国同胞们，你们还等什么？乘我们包围“八一”大楼的时机，跟我老秦一起上街散步吧！围观吧！大家一起上街，全国全面开花，大家就安全了，他们就无法抓人了，也许隔天就撑不住了。\n\n同龄的访民同胞啊，说句心里话，我们老了，出国也晚了，而且也没有钱出国，我们图个什么呢？还不是图自己儿女孙子有个更好的明天，不要象我们一样被他们涮了，为了儿女孙子有一片蓝天净水，有一份社会公平…我们豁出去一把老身，上街散散步，健健身，有什么不可以呢？\n\n顺便忠告街对面的公安武警兄弟，当年我们也和你们现在一样威风、一样年轻，我们当年上战场为他们流血卖命，竟落得这般下场，你们为他们抓人打人，明天会比我们更好吗？与其吃力不讨好，不如做做样子，陪我们一起散步观光更好！\n\n中国访民党 发言人 老秦\n2016年10月12日 北京\n\n附：中国访民党党纲——“五还”精神\n还我人权，\n还我住房，\n还我工作，\n还我选票，\n还我真相。"
		},
		{
			"post_id": 281,
			"title": "New blog post",
			"date_published": 1490254818.661,
			"body": "![120.png (0x0)](data/img/post_281_120.png)"
		},
		{
			"post_id": 280,
			"title": "New blog post",
			"date_published": 1490254736.623,
			"body": "一、中共将在2017年临到可耻的崩亡下场。\n\n二、中共将会被宣布为恐怖组织，为这个犯罪集团历史性地正名。\n\n三、中国将设立审判前政权人员反人类罪罪行的特别法庭。"
		},
		{
			"post_id": 279,
			"title": "彻底铲除中共反动政权",
			"date_published": 1490233142.437,
			"body": "![108.png (0x0)](data/img/post_279_108.png)"
		},
		{
			"post_id": 278,
			"title": "君子之怒",
			"date_published": 1490233057.975,
			"body": "彻底铲除中共邪恶集团三手段\n\n1，暗杀。针对中共“刀把子”公检法，政法委官员中疯狂镇压民众的急先锋展开暗杀行动。针对积极镇压民众，打击维权人士，打击宗教团体的决策人物实行暗杀行动。\n\n2，大起义。发动多个地区的民众同时起义，占领广场。并攻占各政府部门，广播电视台，占领军火库，机场，车站。\n\n3，万一大起义失败，全面爆破中共的重要企业。重点爆破沿海4省，广东，浙江，江苏，山东的电子工厂。吓退所有的港台资企业及外资企业。"
		},
		{
			"post_id": 277,
			"title": "中共已经无法再设骗局了",
			"date_published": 1490232973.246,
			"body": "![107.png (0x0)](data/img/post_277_107.png)"
		},
		{
			"post_id": 276,
			"title": "充当革命军之马前卒！",
			"date_published": 1490232749.737,
			"body": "不要自焚，不要跳楼，不要烧公交车，不要杀幼稚园孩子，不要开车撞路人，这些都没有用，不能解决你的诉求，不能给你任何补偿，也不能惩罚责任人。\n\n去张贴传单，去派发传单，去鼓动别人一起与你张贴传单，去鼓动别人一起与你派发传单。这样政府部门就不会不理你，这样政府部门就不会躲着你，他们会来找你。\n\n你连死都不怕，还用怕张贴传单，派发传单吗？\n\n---\n\n而且，这样做，你还能申请难民！移民欧美！\n而且，这样做，你还能申请难民！移民欧美！\n\n你担心移民欧美不会语言，没有技能吗？不用担心，只要你年轻，去参加美军！\n\n美軍在法拉盛緬街，就設有徵兵辦公室，可聯絡陳彥豪士官長咨詢詳情。徵兵辦公室地址：紐約法拉盛緬街36-40號。\n\n访民朋友们，你们的诉求其实是不可能解决的，中共也从来就没有想过要解决你们的诉求。所有的一切都只是敷衍你们。\n\n你们试想一下，你们5年10年无法立案，5年10年的上访，这开支有多少？这帐你能跟中共算吗？你们的各种诉求的标的是多少？这5年10年下来产生的利息是多少？这帐你能跟中共算吗？\n\n你把你自己的个案，乘100万倍，乘1000万倍，这个金额有多少？这帐你们能跟中共算吗？\n\n中共这些腐败官员早就把从你们这里抢夺来的财富转移到国外去了，中共这些腐败官员转移到国外的资金有几十万亿，他们会把这些钱再拿回来还给你们吗？中共这些腐败官员转移到国外的资金有几十万亿，那么他们从哪里弄出钱来还给你们？\n\n所以，只要中共还在继续专政，你们的诉求就不可能解决。想要解决你们的诉求就得推翻中共暴政！中共倒台了，西方国家冻结他们存在那里的几十万亿资产，你们的诉求就能解决了。\n\n不要担心你没有能力推翻中共。不用担心你没有能力带领别人推翻中共。你只要有勇气自己站出来围观，只要有勇气自己去派发传单，去张贴传单，有勇气鼓励你身边的人站出来围观，有勇气鼓励你身边的人与你一起去张贴传单，有勇气鼓励你身边的人与你一起去派发传单。中共就会倒台了。\n\n失业下崗的工人们，很快要失业下崗的工人们，看看90年代东北的下崗失业工人吧，他们到现在都还没有工作呢。看看沈阳下崗后当小贩的夏俊峰的结果吧。\n\n90年代那时还有中国获得美国最惠国待遇，还有加入WTO，由此带来的大量国际贸易机会与相关工作机会，东北几十万工人下崗都这么惨。这次不但没有这样的新增国际贸易机会，反而大量的港台日企业在向东南亚转移，大量的工作机会在流失。再加上TPP协议生效，中国完全被排斥在国际贸易之外，你们的前景比90年代东北的失业工人更暗淡。\n\nTPP的影响是长远的，而且中国不可能加入TPP。因为TPP要求保护自由工会；因为TPP要求保护通讯安全，容许外资进入互联网通讯行业，任何人都可以随便办网站，政府不能删帖；最重要的是，TPP容许第三国诉讼。\n\n中国几千万访民都是对政府的诉讼，律师是能够把这些诉讼转变成第三国诉讼的。如此多的对中共政府的诉讼在美国，加拿大提起，中共能承受吗？所以中国是无法加入TPP的。\n\n从目前的情况看，美国可能直接解放朝鲜，一旦南北韩统一，大量的南韩在华企业将转入朝鲜，又将造成大量的工作岗位流失。\n\n你们的前景非常暗淡，你们面临的是长期失业，是一代人的毁灭。为了你们的家庭，为了你们的下一代，勇敢站出来，充当革命军之马前卒！\n\n去组织下岗失业维权组织！去要求党，政，工，团，先下岗！去参与围观！去派发传单！去张贴传单！\n\n只要你们敢站出来，积极争取自身权益，你们就能申请难民，移民欧美！你们的孩子就能申请难民，移民欧美！\n\n中国的年轻人，你们没有前途！因为这个国家没有前途。这个国家很快就要分崩离析了。你们的前途在移民！申请难民，移民欧美！\n\n你们想当公务员？公务员要裁减几百万。\n你们想进外资企业？外资企业在大量外移。\n你们想进国有企业？国有企业要裁员几百万。\n你们想进私有企业？私有企业在大量倒闭。\n你们想做小贩？城管等着你们。\n\n起来推翻中共暴政才是出路！充当革命军之马前卒！去法院围观！去派发传单！去张贴传单！去参加人大代表选举！这样就可以申请难民。\n\n德国每年接收50万难民！加拿大每年接收20-30万移民！这个才是你们的出路！\n\n反抗专制可以申请难民！\n\n上访的退伍军人们，你们的诉求是没有解决的可能的，因为你们这个群体人数在几百万，上千万。情况都大同小异。\n\n如果你还年轻，去参加美军吧，去参加法国外籍兵团吧！\n\n参加美军你要先把自己变成难民，其它身份你们不容易取得，没有难民身份，你们是不能参加美军的。法国外籍兵团的情况不了解。\n\n美国开始海外征兵，半年即可入籍，子女学费全包，保险覆盖全家，月薪5千3百美金。\n\n公开反抗中共可以向联合国申请难民！去上访，去围观，去举牌，去派发传单，去张贴传单，去参加人大代表选举，这样就能申请难民。\n\n去参加美军，去参加法国外籍兵团，打垮全世界的独裁专制。\n\n另外，国军93师在泰国北部，你们可以组织起来与93师联系，去泰北组织民主革命军。93师都是云南籍人士，打回云南，独立建国！\n\n注意，泰北，缅北有大量中共特务活动，那边形势很复杂的。"
		},
		{
			"post_id": 275,
			"title": "蒙藏维满港大起义",
			"date_published": 1490169490.267,
			"body": "![1.jpg (0x0)](data/img/post_275_1.jpg)\n\n![2.jpg (0x0)](data/img/post_275_2.jpg)\n\n![3.jpg (0x0)](data/img/post_275_3.jpg)\n\n![4.jpg (0x0)](data/img/post_275_4.jpg)\n\n![5.jpg (0x0)](data/img/post_275_5.jpg)"
		},
		{
			"post_id": 274,
			"title": "作为领袖人物，你必须明白大起义为什么能成功。",
			"date_published": 1490169384.702,
			"body": "作为领袖人物，你必须明白大起义为什么能成功，不然你无法动员民众参与大起义。大起义靠的是人多势众，人数多到军警及其它维稳的力量无法阻挡，所以必定会成功的。\n\n---\n\n蒙藏维满4地人口数量超过1亿，以动员起1亿人参与大起义估算，以一个中共军警能阻挡100个起义人士计算，中共需要出动100万军警。一个军警显然不能阻挡100个起义民众。以一个中共军警能阻挡10个起义人士计算，中共需要出动1000万军警，中共在蒙藏维满4地显然没有这么多的军警来阻挡起义。\n\n问题的关键在于你如何才能动员起这么多的人，同时参与起义，占领同一个广场。所以大起义的日期必须是公开的，起义的地点也必须是公开的。必须在起义之前把起义的日期让每个参与起义的人员知道，必须在起义之前把起义的地点让每个参与起义的人员知道。\n\n这需要一个比较长时间的准备，同时需要做好协调。大起义需要准备足够的后勤物资，这也是需要一个比较长时间的准备的。\n\n当务之急是协助满洲地区成立能够领导，动员起义的组织。同时也应该成立蒙藏维满港大起义同盟，协调发动大起义，研究具体的起义步骤及策略。"
		},
		{
			"post_id": 272,
			"title": "New blog post",
			"date_published": 1490144344.145,
			"body": "![1.jpg (0x0)](data/img/post_272_1.jpg)\n\n![2.jpg (0x0)](data/img/post_272_2.jpg)\n\n![3.jpg (0x0)](data/img/post_272_3.jpg)\n\n![4.jpg (0x0)](data/img/post_272_4.jpg)\n\n![5.jpg (0x0)](data/img/post_272_5.jpg)\n\n![6.jpg (0x0)](data/img/post_272_6.jpg)\n\n![7.jpg (0x0)](data/img/post_272_7.jpg)\n\n![8.jpg (0x0)](data/img/post_272_8.jpg)"
		},
		{
			"post_id": 271,
			"title": "New blog post",
			"date_published": 1490090079.084,
			"body": "![1.jpg (0x0)](data/img/post_271_1.jpg)\n\n![2.jpg (0x0)](data/img/post_271_2.jpg)"
		},
		{
			"post_id": 270,
			"title": "大晋自由宣言 ——致特朗普总统的一封信",
			"date_published": 1490089699.692,
			"body": "总统先生，您好！首先恭贺您成功当选美国总统。作为关注您并认同您诸多理念的一群晋人，我们相信，您的当选不仅会改变美国，而且将深远地影响世界。\n\n您一定没有听过晋人这个生活在亚洲内陆高原的民族。我们民族主要分布在现在中国境内的山西省和内蒙古中西部等地，拥有自己独特的语言和风俗习惯，发源于3000年前的晋公国，并继承、融合了进入这片土地的内亚族群，终于形成了近代意义上的民族——晋人。\n\n---\n\n我们的民族曾有辉煌的过往，也曾充满朝气和希望，如今却被囚禁在红色中国制造的牢笼之中。出于对我们民族的命运的关切，我们希望向您分享我们的若干看法。我们认为，我们民族的悲剧，东亚大陆的赤化，美国在东亚不得不面对心怀敌意的挑战者，美军在韩战和越战付出的牺牲，这一切都可以归结到中国没有解体。只要中国继续存在，东亚的灾难就不会结束。如果美国对此有清晰的认识和采取相应的对策，问题是可以迎刃而解的。\n\n晋在东亚所处的地理位置\n\n![33.jpg (0x0)](data/img/post_270_33.jpg)\n\n我们注意到，在中东国家的旧框架下移植西方制度没有解决当地的冲突和乱局。阿富汗、伊拉克和叙利亚的故事重复了自由民主遇挫的苦涩；全世界的反美分子却在趁机攻击和嘲笑美国的价值观。美国战士为自由事业付出牺牲，为何却换来这样的结果？这些国家都有着文化、认同存在巨大差异的多个族群。这些族群又有各自的世代居住区域，换言之，他们与生活于其上的土地有着长期的有机联系。所以，各个族群之间达成共识的难度太大，难以形成政治共同体，要么注定成为碎片化的失败国家，要么依靠强权维系——前者意味着长期的动荡，后者意味着专制的牢笼。从历史经验来看，在这种情况下，只有实现多国的独立和共存，和平和秩序才有可能。其他的权宜性安排都只会是推延而不是解决问题。\n现代中国继承了统治众多族群的古代征服帝国的遗产，因而面临着同样的困境。中华民国是模仿合众国建立的国家，然而由于族群、地域和派系的复杂纷争，建构这样的国家有着天然困难。前期的中华民国只是一个动荡的松散邦联，各地拥有一定的但缺乏保障的自治权。 部分地域的先觉者已开始着手于民族运动。这一切都被苏联的颠覆打断。国民党在苏联的资助下发动武装叛乱，极力将中华民国改造为集权国家。这个列宁式政党奉行对外敌视国际体系、谋取区域霸权，对内压制地方自治、为统一不择手段的大中华主义，无视国际条约，发起与日本的持续冲突。这样的冲突不但把美国拖入了战场，也最终将东亚大陆送入共产主义手中。中共在苏联的帮助下，借日本和国民党两败俱伤的机会，建立了红色帝国。如果清帝国瓦解时各个邦国就实现独立，这些灾难本来是不会出现的。\n\n苏联灭亡后，中国继承了邪恶轴心的位置。共产主义丧失了蛊惑能力，因此中共捡起了国民党的大中华主义，并将美国视为阻碍中国统一和复兴的敌人。如今的中共比过去三十年任何时候都想挑战国际秩序。即便中共能够克制自己的挑衅冲动，空前灰暗的经济前景和严峻的统治危机，也预示着中国的崩溃行将到来。\n\n红色帝国的灭亡是必然的，但是残局如何收拾呢？我们认为，仅仅消灭中共是不够的。中国本身就意味着继承征服帝国的全部遗产，而继承这份遗产唯有通过持续的暴政。专制的幽灵仅仅以改头换面的形式继续存在。中国的存在意义就是给这个邪灵提供宿主，所以中国必定是邪恶的。\n鉴于东亚大陆的历史传统和共产暴政的多年摧残，中国崩溃以后很可能出现动荡的局面。东亚居民不仅面临着中共残余势力，还面临大陆腹地的流寇势力和东进的伊斯兰极端主义的威胁。犹如饿狼之于羊群，这些新的征服者对于各个族群和地域没有认同和亲和性，而是将其视为抢掠对象。出于占有更多抢掠对象的贪欲，他们自然会袭用中国的牌号制造新的囚笼。美国一直希望与文明人打交道，然而有可能成为中国统治者的群体必定是经过逆向淘汰筛选出来的最无赖、最残忍的邪恶势力。他们不会对文明世界的价值观有任何尊重。如果他们的意图得逞，这样的另外一个中国也会继续与自由世界为敌，并继续威胁周边国家，成为亚洲的长期乱源。所以，中国在崩溃之后的再度统一必定是一场灾难。这是一个必须拒绝的选项。\n\n同时，正如中国历史一再发生的那样，动荡中也会出现若干小型的、自守的、施政较为文明、能够代表本地族群的政治势力，但是他们缺乏国际认可，随时有被那些邪恶势力吞并的危险。一劳永逸的解决方案就是，不再认可和支持任何代表中国和谋取统一的政治势力，而是对那些遵守文明规则的小型政治实体有条件地予以承认，对资格尚不具备的则给以留待观察的机会，逐步有序承认。清理红色帝国的废墟，注定艰难而曲折，但是通向光明和希望。当这一切完成时，东亚大陆对世界的威胁就永久性地解除，国际社会则增添了一批建设性的新成员，美国维护亚太秩序的负担也将大大减轻。\n\n中国崩溃之后会出现哪些国家？这是无法规划的。百年以来，中国的文化精英出于对帝国遗产的贪恋，无视和抹杀东亚居民的多元性，武断地将他们囊括于单一的政治标签下。基于这样的观念，中国政权系统地篡改历史，强制推广普通话和压制地域文化，迫使亿万人认同官方认定的伪民族身份。尽管这样的努力无法取得成功，却极大地妨碍了真正的民族认同的形成。\n\n幸运的是，如今的东亚大陆有一群热爱自由的人敏锐地觉悟到了何为真正的民族认同，并将民族建国和消灭暴政视为互为表里的事业。他们主张拆毁中国这个关押诸民族的囚笼，重建各自的国家。他们不仅支持台湾、吐蕃，香港的独立，还主张南粤、吴越、满洲、巴蜀等这些具有独特文化历史的民族也以独立身份加入文明世界。东亚各民族正逐渐从沉睡中苏醒，各民族已经产生了自己的代言人。他们开始打破禁忌和恐惧，大胆地发出自己的声音。我们相信，只要给予这些民族的种子和幼芽以适宜的水土和阳光，他们可以成长为未来的参天大树。\n\n在此，我们谨代表我们的故国和民族发出呼声，希望您和美国人民可以了解我们的民族，聆听我们的愿望。\n\n我们有着独特的民族记忆。我们的祖国是一个有着伟大传统的国度。在漫长的历史中，晋人所捍卫的这块土地一直是自由势力对抗专制帝国的前沿。\n\n在两千多年前的春秋时代，如同美国在如今的世界，我们的先人最早建立的国家晋国长期是东亚国际秩序的主要维护者。在其后的战国时代，我们的国家顽强地阻挡过像纳粹德国一样疯狂扩张的秦帝国；东亚第一个集权帝国的邪恶图谋，在一场对晋人的大屠杀之后才最终得逞。\n依靠奴役建立的帝国的虚弱很快暴露无遗。中国统治者不得不一再引入草原的游牧部落补充人口和士兵，同时将奴役的枷锁强加于他们。像晚期罗马的日耳曼人一样，入居晋的匈奴人、鲜卑人、突厥人奋起反击，在帝国的废墟上相继建立起自己的国家。这些短暂的国家被新起的统一势力扼杀。众多勇武的内亚族群则融入晋人。\n\n我们的先民始终向往着独立和自由，也因此一再遭到中国侵略者的迫害。一千年前的宋帝国在吞并我们的沙陀王国之后，彻底摧毁了我们的古老都城，并像亚述帝国流放犹太人一样流放我们的民族精英。七百年前的明帝国在侵略战争中遭遇晋人的抵抗之后，像押送罪犯一样对我们的先民实施斯大林式的强制迁徙。\n\n近五百年以来，我们的先民将兴趣转向商业和资本主义。在数百年里，他们是东亚最优秀的商业民族。他们用马车、驼队和商船进行遍及亚洲的长途贸易；他们还创造了独具特色的股份制和商业银行。\n\n现代世界来临，在新式军官群体的推动下，大晋先从清帝国取得了独立，随后又以独立的身份加入了中华民国，从此进入一段三十七年未间断（1912—1949）的自治时期。就像当时的吐蕃，其间的大晋犹如高度独立的自治邦，拥有自己独立的货币、军队、政党和情治系统。\n\n摆脱了帝国羁绊的大晋焕然一新，开始向现代社会迈进。晋人政治精英集团是一批热爱乡邦和父老的自治主义者，阎锡山则是其中最杰出的代表。他们推行了基层自治，建设了现代工业，实施了中华民国最成功的基础教育。他们小心翼翼地避开战争，在战乱和喧嚣中维持了和平和秩序，同时为了捍卫自治和防范共产主义，发展了强大的军事工业。这些成绩赢来了广泛的赞誉——美名甚至飘洋过海。1930年的美国《时代》杂志写道：“作为山西省的模范督军，阎实际上耸立在一个独立王国之中。阎为1100万人带来了繁荣。在中国，他们最富裕，因而使他显得出类拔萃。阎的嗜好不是女人、酒、鸦片，甚至也不是金钱，而是优质的道路、纺织、防御部队、维持秩序的警察，发展优良的牛、马、耕具、家禽、肥料……所有能为他的乡亲直接带来好处的事物。”他们驱逐了苏联资助的外来战争贩子，将晋人的自治从山西扩展到绥远。在另一位政治精英傅作义的治理下，这块灾荒和土匪肆虐的土地迅速变成百业俱兴的又一个模范省。这段历史充分证明了现代晋人良好的自治能力。\n\n阎锡山登上1930年5月19日的时代杂志封面\n\n![3.jpg (0x0)](data/img/post_270_3.jpg)\n\n狂热的大中华主义者蒋介石挑起中日战争，将连绵的战火引入了晋地。阎锡山是一位坚定的反共斗士，与日本也关系友好，却被绑上中国的战车，被动地卷入了战争，并被迫与中共进行合作。我们的军队和人民在战争中遭到了重大损失，中共却在趁机抢占土地和蹂躏民众。阎锡山对赤化的前景忧心忡忡，希望与日本恢复和平，集中力量消灭大肆扩张的中共，却遭到中国统治者以叛国罪和武力讨伐相威胁。中日战争结束后，广大的农村已被中共占据。在随后的抗赤战争中，我们的军队顽强地抵抗到最后。中共依靠优势的苏援装备围困太原，遭遇了惨烈的城市攻坚战，不得不付出前所未有的代价。晋与吐蕃一样是被中共武力吞并的，而我们的先辈从未选择妥协，抗争的壮烈和光荣有过之而无不及。\n尽管时常遭到中国政权令人憎恶的压制，我们的政治精英审慎地选择了保卫自治的成果，而没有争取彻底的独立，最终尝到了无法主宰自我命运的痛苦。如今，我们已从这段晋人自治史吸取了惨痛的教训。\n\n被中国侵略者非法侵占的数十年内，晋人遭受了深重的苦难。在中共的暴力土改中，晋人的乡村精英遭到了整体性毁灭：数十万“地主富农”被百般凌辱、施以酷刑和处死；他们的土地、财产甚至妻女被夺走。中共则将这场中国最为惨烈的土改作为成功经验推广。在镇反中，中共大肆关押和处决我们的抗赤勇士——大部分晋绥军军官难逃此劫。在中共建政后的反右、大跃进、文革历次政治运动中，晋人也有无数不忍卒听的惨痛遭遇。\n中国侵略者将这里极其丰富的资源占为己有，长期廉价向外供应煤炭和电力。在电力紧缺时期，为了优先满足外地的需求，许多农村甚至城镇只能点起蜡烛和煤油灯来照明。长期的滥采带来了众多矿难，严重的土地、空气和水污染，造成了大面积的采空区和土地沉降。晋人从中所得无几，还失去了安居乐业的美好家园。如今我们的故国经济停滞，产业凋敝，沦落到异常悲惨的境地。\n\n我们有自己的民族语言晋语。我们使用母语无法与其他民族交流。中共将晋人划为所谓的汉族，这与将意大利人、墨西哥人和巴西人划为单一的拉丁民族一样荒谬。我们更无法容忍以这样的拙劣理由作为我们接受中国统治的依据。中共对晋人实施系统性的文化灭绝，数十年如一日地推行曼达林语（Mandarin, 普通话），并告诉我们使用祖辈相传的晋语是可耻的。\n\n我们居住的土地被蓄意分割为几个省区。为了统战蒙古族的共产主义势力，中共还建立了所谓的“内蒙古自治区”，并将晋人占绝大多数的绥远（蒙古族只有大约5%）并入其中。中共在此采取一种类似肯定性行动的政策，蒙古族得到教育机会，甚至是计划生育政策的照顾。晋文化和晋语在此没有任何地位——蒙古语是名义上的官方语言之一。当然这些仅仅是奴役形式的细微差异。蒙古族与晋人一样饱受中共暴政的摧残，同是严重生态破坏的受害者，也同样面临着民族文化消亡的危险。一百多年来，绥远的晋人和蒙古族长期混居，友好相处，互相影响。我们对他们的境遇怀有深切的同情。我们愿意与蒙古族像兄弟一样携手共建一个崭新的国家。\n\n我们对大洋彼岸的伟大国度怀有特别的好感。一百六十多年前，我们的一位先贤徐继畲就高度称颂华盛顿总统和美国的政治制度——一块刻有这段话的石碑仍保存在华盛顿纪念塔。我们不会忘记，在帝国的闭塞之中，是那些美国传教士为晋带来了医疗和现代教育，培养出了东亚的一流金融家孔祥熙。如今他们播下的福音种子已结出丰盛的果实。我们也不会忘记，在太原被中共军队围困的危急关头，是陈纳德将军的飞虎队为城中军民运来了急缺的粮食和枪弹。\n\n我们先人的勇士曾在两次帝国崩解的乱世中捍卫了我们的土地，并拯救了濒于人口灭绝的东亚大陆。今天的我们也愿意为晋人的自由而奋战，而且我们必须保证我们的事业成功。中共曾将其非常忌惮的傅作义将军的军队投入韩战，也曾将一条贯穿晋的铁路拆掉用于支援越共。邪恶势力如果成功，我们的同胞、我们的资源可能会在威逼和强征下为其所用，用于对抗自由世界。这是我们不惜任何代价都要避免的可怕悲剧。\n\n总统先生，我们欣赏您的爱国精神和“让美国再度伟大”的目标，也钦佩您面对邪恶国家的坚定斗志。我们祈盼您和您的国家能成为晋人自由事业的支持者。我们愿意为使大晋重新独立，并继而使大晋再度伟大而战！我们愿意始终坚定地站在自由世界的阵营，为维护东亚的秩序担起责任。我们真诚地相信，晋人的自由和美国人的自由是一体的。\n\n大晉自由同盟 LIBERTY LEAGUE OF JINLAND·2017年1月8日"
		},
		{
			"post_id": 269,
			"title": "西藏青年会将加大展开复国运动",
			"date_published": 1490089496.639,
			"body": "2016年9月，西藏青年会大会经过六天会议通过的决议案包括，西藏青年会按照其建会宗旨将加大展开复国运动。\n\n为期六天的西藏青年会第十六次大会于上星期六（9月3日）在印度达兰萨拉闭幕，会议通过了一系列决议案，并选举产生了新一届理事会领导成员。\n\n西藏街景\n\n![1.jpg (0x0)](data/img/post_269_1.jpg)\n\n![2.jpg (0x0)](data/img/post_269_2.jpg)\n\n![3.jpg (0x0)](data/img/post_269_3.jpg)\n\n![4.jpg (0x0)](data/img/post_269_4.jpg)"
		},
		{
			"post_id": 267,
			"title": "南蒙古大呼拉尔（议会）成立大会在东京召开、韩连潮博士到会祝贺",
			"date_published": 1489996185.962,
			"body": "《公民议报》记者 何佳 2016年11月11日\n\n南蒙古大呼拉尔（议会）第一届大会（成立大会）于11月10-11日在日本东京日本参议院的会议厅举行，会议庄严而隆重，对南蒙古民族来说这是一个新纪元。内蒙古人民党主席席海明当选为第一届大呼拉尔主席。席海明作了激情昂扬的就职演讲。南蒙古大呼拉尔台主张南蒙古（内蒙古）高度自治。\n\n---\n\n公民力量主要负责人之一韩连潮博士应邀代表公民力量出席会议并在开幕式上演讲（演讲稿附后）。\n\n出席会议的贵宾还有：日本众议院议员长尾敬，日本参议院参议员山田宏，日本前众议员三宅，西藏流亡政府前议员、达赖喇嘛的侄儿凯度顿珠，前西藏流亡政府驻日代表佩马伽露农，台湾多个民间社团代表李酉潭教授，曾建元副教授，周美里，张龙桥，朱政骐等，香港民族党召集人陈浩天，及发言人周浩辉，世界维吾尔代表大会驻日代表，全球支持中国和亚洲民主化论坛秘书长潘永忠，民主中国阵线代表王国兴，民主团结联盟副主席王进忠，中国民主运动联席会议日本代表相林，日本的民运界朋友方仲宁、田仲文、王戴，日本各社团的朋友，各新闻媒体的代表等百来人出现了会议。给大会发来贺电的有：西藏流亡政府司政洛桑森根，世界维吾尔代表大会主席热比娅，中国民运联席会议主席魏京生等。\n\n韩连潮博士在开幕式上的演讲词：\n\n各位朋友，大家好，首先感谢南蒙古人大会和发起人席海明先生邀请我前来参加这个盛会，我代表公民力量主席杨建利博士向大会致以热烈的祝贺，并预祝大会取得园满成功。世界是多元的 – 自然界是多元的，人类社会也是多元的。正是这样的多元性才让世界丰富多彩。在现代社会中，弱肉强食的丛林法则已被抛弃，任何一个民族都不能强迫另一个民族放弃其生活方式、文化传统和宗教信仰。因为这样的做法既没有道德基础，又不符合联合国宪章开宗明义所确定的人民自决和自治的权利。 中国的古代圣贤孟子很早就对人民、国家和统治者之间的关系作了说明，他指出， “民为贵，社稷次之 ，君为轻。 ” 我认为任何信奉普世价值和民主原则的人都应当秉持这一民本思想。 从上述理念出发，公民力量支持南蒙古人民的维权抗争。我们愿和你们一道争取中国社会和平的有序的民主转型。 很多占少数的其他民族和人民担心即使中国实现民主，他们的权利和地位仍然得不到保障。的确，民粹主义是我们必须警惕的，但从长远来看，一个真正的成熟的民主政体不是多数人的暴政，而一定要有机制来保障占少数的民族和人民的权利，这些权利甚至不应当允许通过多数人的立法来剥夺。你们建立在历史权利之上的土地、文化、宗教等都必须得到充分尊重和保护。让我们一起努力，推动中国人权、法制的进步，实现中国民主社会的转型，重建属于自己的家园 。再次祝贺大会成功。谢谢。"
		},
		{
			"post_id": 266,
			"title": "New blog post",
			"date_published": 1489995539.401,
			"body": "![1.jpg (0x0)](data/img/post_266_1.jpg)\n\n![3.jpg (0x0)](data/img/post_266_3.jpg)\n\n![4.jpg (0x0)](data/img/post_266_4.jpg)\n\n![5.jpg (0x0)](data/img/post_266_5.jpg)\n\n![6.jpg (0x0)](data/img/post_266_6.jpg)\n\n![7.jpg (0x0)](data/img/post_266_7.jpg)\n\n![8.jpg (0x0)](data/img/post_266_8.jpg)\n\n![9.jpg (0x0)](data/img/post_266_9.jpg)\n\n![10.jpg (0x0)](data/img/post_266_10.jpg)\n\n![11.jpg (0x0)](data/img/post_266_11.jpg)\n\n![12.jpg (0x0)](data/img/post_266_12.jpg)\n\n![13.jpg (0x0)](data/img/post_266_13.jpg)\n\n南蒙古独立运动人士及新疆独立运动人士在东京中共大使馆前抗议\n\n![14.jpg (0x0)](data/img/post_266_14.jpg)\n\n![15.jpg (0x0)](data/img/post_266_15.jpg)\n\n![16.jpg (0x0)](data/img/post_266_16.jpg)\n\n![17.jpg (0x0)](data/img/post_266_17.jpg)\n\n南蒙古独立运动人士在东京新宿活动\n\n![58.jpg (0x0)](data/img/post_266_58.jpg)\n\n南蒙古独立运动人士会见达赖喇嘛\n\n![20.jpg (0x0)](data/img/post_266_20.jpg)\n\n南蒙古大学蒙古族学生发起穿蒙古服运动\n\n![63.jpg (0x0)](data/img/post_266_63.jpg)"
		},
		{
			"post_id": 265,
			"title": "New blog post",
			"date_published": 1489972729.252,
			"body": "![11.jpg (0x0)](data/img/post_265_11.jpg)\n\n![22.jpg (0x0)](data/img/post_265_22.jpg)\n\n![33.jpg (0x0)](data/img/post_265_33.jpg)\n\n![44.jpg (0x0)](data/img/post_265_44.jpg)\n\n![55.jpg (0x0)](data/img/post_265_55.jpg)\n\n![66.jpg (0x0)](data/img/post_265_66.jpg)"
		},
		{
			"post_id": 264,
			"title": "New blog post",
			"date_published": 1489911416.54,
			"body": "![1.jpg (0x0)](data/img/post_264_1.jpg)\n\n![2.jpg (0x0)](data/img/post_264_2.jpg)\n\n![3.jpg (0x0)](data/img/post_264_3.jpg)\n\n![4.jpg (0x0)](data/img/post_264_4.jpg)\n\n![5.jpg (0x0)](data/img/post_264_5.jpg)\n\n![6.jpg (0x0)](data/img/post_264_6.jpg)\n\n![7.jpg (0x0)](data/img/post_264_7.jpg)\n\n![8.jpg (0x0)](data/img/post_264_8.jpg)\n\n![9.jpg (0x0)](data/img/post_264_9.jpg)"
		},
		{
			"post_id": 263,
			"title": "叶利钦说“共产主义”",
			"date_published": 1489911072.687,
			"body": "乐 朋\n\n马克思恩格斯创立的共产主义学说揭示了人类社会的发展趋势，其普遍原理永远不会过时。但我们无法回避这样的事实：作为理想制度的社会主义和共产主义在上世纪末屡遭重创——东欧剧变易帜，苏联轰然崩溃。共产主义实践的大失败，引起了对前苏联模式社会主义、共产主义的大审视、大反思。\n\n---\n\n早在上世纪三十年代，斯大林就公开宣布苏联建成了社会主义；后继者赫鲁晓夫、勃列日涅夫，或称“共产主义”就是“土豆加牛肉”，或自诩苏联进入了“发达社会主义”。前苏联的“共产主义”竟为何物，是否同它的宣传家所说的那样美妙无比，至今犹似雾里看花。俄罗斯前总统叶利钦的说法，或可聊备一格：\n\n“你在职位的阶梯上爬得越高，归你享受的东西就越丰富……如果你爬到了党的权力金字塔的顶尖，则可享有一切——你进入了共产主义……共产主义完全可以在一个单独的国家里为那些获取权位的少数人而实现”（《我的自述》）。\n\n当过莫斯科市委书记、国家建委副主席，且曾跻身苏共中央政治局这个“权力金字塔的顶尖”的叶利钦，如是说“共产主义”，可谓知情人的“夫子自道”吧？前苏联权力圈的特殊化，到晚期特权阶层的弄权腐败，已为无数事实所确证，而绝非有人恶意中伤、诽谤。\n\n据现今披露的见闻，前苏联党政军领导层，特别是爬上政治局高位的人们，其“享有一切”的特权，在物质生活上包括下列种种——\n\n高薪制，从制度上保障他们的高收入。高官与平民的工资差，由三十年代的30:1，拉大到五十年代的50:1甚至更多，而且实行兼职兼薪，即一个人可以领取几份高薪；\n\n秘密附加款，即所谓“大信封”津贴。领导干部每月都会收到一个装着许多卢布的大信封，职位越高钱越多，一般是公开月薪的一至两倍，而且由于秘密发放，所以不要交税，也不计入党费缴纳的计算基数，斯大林在世时就常常把“大信封”转送给他的女儿、情妇；\n\n政治局、书记处成员，在七、八十年代还享有一张“特别存折”，可以到中央银行随意支取，银行就像是他们家的钱柜子；\n\n“小白桦”商店，专为权贵而设，花最少的钱买最好的紧俏货，包括进口高档商品，以满足他们的奢侈消费需求；\n\n为领导人建造豪华别墅，免费到风景名胜之地旅游度假，且老婆孩子一同沾光，潇洒享乐，配最好的轿车，分最佳的住房，等等。据俄罗斯学者估计，到勃列日涅夫时期特权阶层约有50—70万人，加上其家属，占全苏总人口的1.5％左右。\n\n叶利钦说得不假，对于那些特权阶层而言，他们物质生活的衣、食、住、行、玩，达到了“享有一切”，无比丰富、优裕的程度。经典理论告诉我们，共产主义就是社会物质产品的极大丰富，以及人的“各尽所能，按需分配”。前苏联的权贵们，有使不尽的卢布，享用不完的好东西，他们想要什么就有什么，想怎样享受就怎样享受。说他们进入了“共产主义”的“天堂”，还有什么疑问吗？不，他们用种种特权营造的“共产主义”，实至名归！\n\n然而，这个“共产主义”只属于一小撮特权阶层。占人口总数98.5％的苏联工人、农民、知识分子，连同大多数普通公务员，却无福消受“享有一切”的“共产主义”。他们的生活很辛苦，仍未能摆脱贫困的折磨！他们对这种权贵“共产主义”报以不满、仇恨的目光！失去民心的前苏联“共产主义”，终被火山的爆发所吞没、焚毁了。叶利钦反腐败之能一呼百应，老百姓对苏共垮台无动于衷，乃至叫好，不就因为这种权贵“共产主义”积怨太久，造孽太深，触犯众怒的缘故么？\n\n前苏联“共产主义”的颠覆表明，暴力革命虽然可以推翻资本主义，但在官本位的极权体制下建不成马恩擘划的科学社会主义、共产主义。人民贫穷、无权，极少数特权阶层则“享有一切”的“共产主义”，与权贵资本主义、权贵封建主义其实是一丘之貉，只不过换了一块好听的招牌。有人说，“苏联共产党是唯一一个在自己的葬礼上致富的政党”；事实上，在“葬礼上致富”的并不是苏共，而只是那些掌握大权的前苏联权贵们。包括叶利钦女儿在内的如今俄罗斯大亨，多半不就是前苏联权贵摇身一变而成的吗？他们到底撕下了“共产主义”的假面具！\n\n“朕富有四海，士马如林，欲使辙迹周宇内，游观无休息，绝域采奇玩，海外访珍馐，岂不得耶？劳百姓而乐一人，朕所不取也”（《旧唐书·宗室列传》）。从物质生活特权说，唐代皇帝李世民早就抵达了“享有一切”的“共产主义”，可他却有此见地；前苏联那些打着“共产主义”旗号的权贵们，以垄断的权力去掠夺一切，“享有一切”，是不是显出等而下之的虚伪与卑鄙？\n\n让反人民的权贵“共产主义”见鬼去吧！\n\n（注：有关前苏联特权阶层的数据、材料，见黄苇町著《苏共亡党十年祭》一书。）\n\n来源: 雨花/雨花杂志社·—月刊·—ISSN 1005-9059·—2004-1,总第463期,P41-42\n适用对象: 全部"
		},
		{
			"post_id": 262,
			"title": "New blog post",
			"date_published": 1489887084.718,
			"body": "![1.jpg (0x0)](data/img/post_262_1.jpg)\n\n![2.jpg (0x0)](data/img/post_262_2.jpg)\n\n![3.jpg (0x0)](data/img/post_262_3.jpg)\n\n![4.jpg (0x0)](data/img/post_262_4.jpg)\n\n![5.jpg (0x0)](data/img/post_262_5.jpg)\n\n![7.jpg (0x0)](data/img/post_262_7.jpg)"
		},
		{
			"post_id": 261,
			"title": "New blog post",
			"date_published": 1489830030.554,
			"body": "![1.jpg (0x0)](data/img/post_261_1.jpg)\n\n![2.jpg (0x0)](data/img/post_261_2.jpg)\n\n![3.jpg (0x0)](data/img/post_261_3.jpg)\n\n![4.jpg (0x0)](data/img/post_261_4.jpg)\n\n![5.jpg (0x0)](data/img/post_261_5.jpg)\n\n![6.jpg (0x0)](data/img/post_261_6.jpg)\n\n![7.jpg (0x0)](data/img/post_261_7.jpg)\n\n![8.jpg (0x0)](data/img/post_261_8.jpg)"
		},
		{
			"post_id": 260,
			"title": "为什么不爱国",
			"date_published": 1489800014.878,
			"body": "![9.jpg (0x0)](data/img/post_260_9.jpg)"
		},
		{
			"post_id": 259,
			"title": "New blog post",
			"date_published": 1489799880.958,
			"body": "![3.jpg (0x0)](data/img/post_259_3.jpg)\n\n![4.jpg (0x0)](data/img/post_259_4.jpg)\n\n![2.jpg (0x0)](data/img/post_259_2.jpg)\n\n![1.jpg (0x0)](data/img/post_259_1.jpg)"
		},
		{
			"post_id": 258,
			"title": "New blog post",
			"date_published": 1489799782.564,
			"body": "![5.jpg (0x0)](data/img/post_258_5.jpg)\n\n![6.jpg (0x0)](data/img/post_258_6.jpg)"
		},
		{
			"post_id": 257,
			"title": "New blog post",
			"date_published": 1489764447.986,
			"body": "![1.jpg (0x0)](data/img/post_257_1.jpg)\n\n![2.jpg (0x0)](data/img/post_257_2.jpg)\n\n![3.jpg (0x0)](data/img/post_257_3.jpg)\n\n![4.jpg (0x0)](data/img/post_257_4.jpg)"
		},
		{
			"post_id": 255,
			"title": "New blog post",
			"date_published": 1489736541.191,
			"body": "![1.jpg (0x0)](data/img/post_255_1.jpg)\n\n![2.jpg (0x0)](data/img/post_255_2.jpg)\n\n![3.jpg (0x0)](data/img/post_255_3.jpg)\n\n![4.jpg (0x0)](data/img/post_255_4.jpg)\n\n![6.jpg (0x0)](data/img/post_255_6.jpg)\n\n![7.jpg (0x0)](data/img/post_255_7.jpg)\n\n![8.jpg (0x0)](data/img/post_255_8.jpg)\n\n![5.jpg (0x0)](data/img/post_255_5.jpg)\n\n![10.jpg (0x0)](data/img/post_255_10.jpg)\n\n![9.jpg (0x0)](data/img/post_255_9.jpg)\n\n![11.jpg (0x0)](data/img/post_255_11.jpg)"
		},
		{
			"post_id": 254,
			"title": "New blog post",
			"date_published": 1489709853.161,
			"body": "![77.jpg (0x0)](data/img/post_254_77.jpg)\n\n![33.jpg (0x0)](data/img/post_254_33.jpg)\n\n![66.jpg (0x0)](data/img/post_254_66.jpg)\n\n![822.jpg (0x0)](data/img/post_254_822.jpg)\n\n![1.jpg (0x0)](data/img/post_254_1.jpg)\n\n![22.jpg (0x0)](data/img/post_254_22.jpg)\n\n![888.jpg (0x0)](data/img/post_254_888.jpg)\n\n![5.jpg (0x0)](data/img/post_254_5.jpg)\n\n![44.jpg (0x0)](data/img/post_254_44.jpg)"
		},
		{
			"post_id": 253,
			"title": "天意如此",
			"date_published": 1489649488.434,
			"body": "![73.jpg (0x0)](data/img/post_253_73.jpg)"
		},
		{
			"post_id": 252,
			"title": "New blog post",
			"date_published": 1489649249.603,
			"body": "![67.jpg (0x0)](data/img/post_252_67.jpg)\n\n![68.jpg (0x0)](data/img/post_252_68.jpg)\n\n![66.jpg (0x0)](data/img/post_252_66.jpg)\n\n![71.jpg (0x0)](data/img/post_252_71.jpg)\n\n![69.jpg (0x0)](data/img/post_252_69.jpg)\n\n![72.jpg (0x0)](data/img/post_252_72.jpg)\n\n![70.jpg (0x0)](data/img/post_252_70.jpg)"
		},
		{
			"post_id": 251,
			"title": "New blog post",
			"date_published": 1489649061.571,
			"body": "![36.png (0x0)](data/img/post_251_36.png)"
		},
		{
			"post_id": 250,
			"title": "New blog post",
			"date_published": 1489648917.279,
			"body": "![103.jpg (0x0)](data/img/post_250_103.jpg)"
		},
		{
			"post_id": 249,
			"title": "海底：辛亥暗杀——拉开革命序幕",
			"date_published": 1489557919.375,
			"body": "[日期：2016-08-23]来源：博客中国 作者：海底\n\n暗杀是一种你在明处我在暗处的狙杀攻击行为，暗杀的重要前提就是敌强我弱，因为没有硬实力火拼，不能两军旗鼓相当对垒，所以，暗杀作为一种有效保护自己而能出其不意攻其不备的主观能动性战法，已经被纳入近代政治经济暗斗时代最好的注脚。\n\n---\n\n中国有句谚语：“射人先射马，擒贼先擒王”，就是致对手万马军中于不顾，而智取上将之首——如果说作为单一刺客面对敌方强大武装阵营是不堪一击的弱者？那么反过来，敌方首领作为单个自然生活人面对一个强悍训练有素的暗杀团队无疑他亦就同样成了弱者。在政治力量博弈理论上这是一个剪刀叉反差——个体对群体必然难以胜数，但群狼对独虎就有可能完全占据行为上的主动，那就是不管你有千军卫护？我只取其便溺困顿时击之，一旦对手还原生活角色，他就成了可怜的被狙杀对象，正如金蝉脱壳——一旦离开外壳保护的那一刻就是它最脆弱的时刻。\n\n所以，暗杀就成为了辛亥革命党缺一不可的小成本付出而收益巨大的原始革命方法。\n\n由此、辛亥时期，随着孙中山黄兴屡屡起义，以弱对强的失败，各地部分激进分子暗杀组织一时风起云涌——参加者有黄兴、陈天华、龚宝铨、杨毓麟，蔡元培、陶成章等人。与此同时，杨笃生、吴樾等人在保定也组织了北方暗杀团——1905年，同盟会成立专门暗杀部门，下设筹款部、造药部和实行部，由方君瑛负责主持，吴玉章、黄复生、喻云纪等也参与其中；刘思复、李熙斌和梁绮神，李应生、李沛基、周之贞等受黄兴委派的诸人奔赴广州，开设成记杂货店，作为暗杀联络机关。\n\n当时革命党的暗杀口号是：“非隆隆炸弹，不足以惊其入梦之游魂，非霍霍刀光，不足以刮其沁心之铜臭”。\n\n革命党认为昏聩的统治阶级已经病入膏肓无可救药 。\n\n回顾辛亥暗杀的史料很多，随着史坚如刺杀两广总督德寿拉开暗杀序幕。相继发生吴樾刺杀北洋五大臣事件，黄复生、汪精卫刺载沣和温生才刺孚琦；万福华刺王之春，徐锡麟刺恩铭；以及那拉、铁良、载湉、奕劻，凤山诸人均遭到不同程度的暗杀。总个轰动王朝暗杀事件最著名的有十九件之多，其他一般暗杀则不计其数。\n\n满清大员，朝廷干将在风声鹤唳的暗杀中如履薄冰，其走狗奴才朝不保夕胆战心惊——王朝铁网统治出现无可避免的政权飘摇，金字塔集权开始上下分离，朝廷再亦不能号令地方狐假虎威，从而导致很多朝廷大员因为害怕暗杀，甚至暗中奉上银两贿赂革命党保其性命，还有更绝的就是要求和暗杀团私下和解，并相继宣布本地区与清廷决裂而倒向革命阵营，连清王朝心腹干将广州水师提督李准亦同意广州独立不再依附清王朝统治集团。\n\n暗杀拉开伟大辛亥革命以弱胜强的铁血序幕，严重地动摇了封建专制王朝的统治信心，革命党视死如归的铁血意志使王朝内部的依附者，观望者，骑墙者纷纷抛弃王朝权贵而倒戈——不少清兵则干脆调转枪口不再做少数王朝权贵的炮灰——十八省接连宣布独立脱离清王朝统治，清王朝统治阶级孤立无支由此分崩离析，土崩瓦解，迅即坍塌。一个外强中奸，貌似强大，实际不堪一击，民心尽失的颓废腐朽王朝由此走向灭亡不归路。"
		},
		{
			"post_id": 248,
			"title": "辛亥革命的经验依然值得我们借用",
			"date_published": 1489557810.062,
			"body": "辛亥革命是在缺乏武器，缺乏资金，缺乏物资，缺乏外援的情况下依靠自己的力量用正确的方法推翻了强大的满清皇朝。从1904年光复会建立暗杀团仅3-4年时间，到1907-1908年革命形势就大为改观，到1911年武昌起义，仅用了7年就推翻了强大的满清皇朝。\n\n辛亥革命时期暗杀团把目标直接对准统治集团的高层，是一个很好的策略，具有极大的震撼效果。最好的例子是秋瑾一案的主审官，最后居然在多地都无法上任，被逼自杀。可见当时社会舆论的压力。（比较一下现在的“犯官”异地上任。）"
		},
		{
			"post_id": 247,
			"title": "辛亥革命志士对武装革命的认识",
			"date_published": 1489557683.161,
			"body": "当时的革命党人，醉心暗杀者为主流。即使以温和著称的宋教仁，也将革命方法概括成“暴动”与“暗杀”，而文质彬彬的蔡元培，同样认为“革命止有两途：一是暴动，二是暗杀”。"
		},
		{
			"post_id": 246,
			"title": "迎接英雄辈出的“暗杀时代”重新来临",
			"date_published": 1489557608.108,
			"body": "黑格尔说：中国在本质上是没有历史的，有的只是不断的重复。这个论断没错。现在的中国就是在重复100多年前的中国。“洋务运动”已经重复过了；“百日维新”也已经重复过了；“中学为体，西学为用”也已经重复过了；“同治中兴”也已经重复过了； 现在已经到了重复“暗杀时代”的时候了。“暗杀时代”之后就是“虚假立宪”与“武昌起义”。连海外都是在重复100年前的情况，“改良与革命”大辩论已经结束了。接下来是筹组各路“暗杀团”了。一个英雄辈出的年代正在重新来临！"
		},
		{
			"post_id": 245,
			"title": "革命党暗杀团需要的是勇气",
			"date_published": 1489557525.803,
			"body": "革命党暗杀团需要的是勇气，是面对中共暴政的反抗勇气，其它什么都不重要。 今天的革命党暗杀团比之辛亥革命时的暗杀团，革命条件好太多了。这就是文明的进步，这就是现代文明对落后专制制度的淘汰。\n对于革命党暗杀团来说，中共在武器方面并不占任何优势。所有的飞机，大炮，坦克，导弹，机关枪，迫击炮，都等于零。近身决斗还不如刀。 中共官员无论怎么偷偷摸摸，总是在明处，暗杀团是在暗处。可以用于暗杀攻击的武器多了去。无论中共搞多少实名制，都有办法做出合适的暗杀武器。"
		},
		{
			"post_id": 244,
			"title": "辛亥革命暗杀团的暗杀目标",
			"date_published": 1489557416.391,
			"body": "辛亥革命暗杀团的暗杀目标是针对清廷省部级以上官员，军区司令，皇太后。但策划一次这样的暗杀行动准备时间是很长的，联系沟通人员往来策划行动细节，一般要几个月时间。现在并不需要一开始就把打击目标对准省部级官员，军区司令，习近平，可以达到同样的震慑目的，而且可以在短时间内就展开打击行动。"
		},
		{
			"post_id": 243,
			"title": "比较辛亥革命时期与现在的三大“反对”势力",
			"date_published": 1489534562.864,
			"body": "（说“反对”势力其实是不合适的，因为改良派也就是“保皇党”，只反“后党”。立宪派并不反朝廷，只主张立宪，拥护朝廷立宪。这里只是方便叙事用三大“反对”势力。）\n\n清末三大“反对”势力\n\n1，革命党。革命党在当时造成比较大社会影响的其实是几次暗杀。上海万福华暗杀广西巡抚王之春案，吴樾刺杀五大臣，秋瑾，徐锡麟案，汪精卫刺杀摄政王载沣等。虽然革命党在当时成立过50多个暗杀团，但不是同时成立的，而是先后成立过。这些暗杀团的人员是有重复的。这里有个很重要的原因是100多年前会制造炸弹的人是很少的。所以，暗杀团的真实人数其实很少的，我估计不会超过100人。\n\n---\n\n孙文在南方的起义其实多数都是出钱鼓动一些会党人员，底层民众，用现在的话来说，就是冲击政府机关。这些起义，在当时除了革命党在海外的报纸宣传，海外知道一些。国内连黎元洪这样的军队高级官员都不知道的。普通国内民众根本就不知道南方有革命党起义。\n\n孙文与黄兴的革命党都是以底层民众为主，江浙的光复会是以江浙地区的社会上层人士为骨干。\n\n2，改良派。改良派与朝廷的实力派人物李鸿章，张之洞，袁世凯都能有秘密的沟通的。改良派甚至还能在张之洞的容忍下秘密组织军事力量“自立军”，人数达到3000人。我判断后来的武昌起义新军中的革命党其实很多都是原来的“自立军”成员。\n\n改良派在海外的募款能力远超过革命党。\n\n3，立宪派。立宪派在当时是合法的，能在全国各地设立咨议局，公开发表立宪主张。立宪派是以社会上层人士为骨干，并且能与朝廷有良好的沟通。立宪派还有能力发动3次全国大请愿。与革命党，改良派以海外为基地不同，立宪派扎根国内。\n\n比较之下，清末三大“反对”势力以立宪派最强大；改良派其次；革命党势力最为弱小，人数不过数百。\n\n现在三大“反对”势力\n\n1，革命党。维族全体几乎都可以看作革命党。藏人140几个自焚的毫无疑问属于革命党，与投海自尽的陈天华一样。只是他们没有找到合适的革命小团体运作方式，所以采取自焚作为革命手段。一旦他们找到合适的方式，力量是非常强大的。这个合适的方式是存在的。\n\n王秉章，彭明属于革命党，不过也属于莽夫。\n\n2，改良派。其实海外所有的民远团体都可以看作改良派。不过，这些改良派没有与朝廷大员沟通的秘密渠道。更不要说在朝廷实力派人物的容忍下发展组织。这也是因为中共党内也不存在改良派实力人物。温家宝，汪洋似乎属于改良派人物，可是他们也不敢公开扛起改革大旗。\n\n3，立宪派。在台湾还没有独立之前，国民党属于立宪派，可是国民党无法在大陆各地设立机构。但是台湾拥有自己的政府，武装，司法。中共的花瓶党也可以看作潜在的立宪派，他们在全国各地都有分支机构，一旦时机成熟，相当于清末的立宪派。\n\n比较现在的三大“反对”势力，还是立宪派实力最强；不过革命党其次；改良派实力最弱。现在海外的改良派几乎只有写写文章，抓抓特务，回忆一下文革时代的风云这点事了。当然杨建利等人这2年的救援国内受难人士家属的工作还是很有意义的。\n\n与清末相比，现在的立宪派实力远超当时；现在的革命党实力也远超当时；但是现在的改良派实力不如清末。\n\n不过这些年国内维权发展很快，一股新的反对力量正在兴起，也正在遭遇当局打压。后续发展还有待观望。现在还无法把他们归到哪一类。\n\n总之，从整体看，现在的革命形势远好过清末辛亥革命时期。"
		},
		{
			"post_id": 242,
			"title": "满清政权与中共政权强弱对比",
			"date_published": 1489534413.393,
			"body": "（首先，满清政权垮台并非众叛亲离，是谈条件的。可以说是体面的移交政权，换取优待。可以合理假设如果满清当时提出的条件是满人退回满洲，汉地18省与西藏，新疆，蒙古全部独立，这样的条件也是会被接受的。\n\n中共今年垮台，是否会众叛亲离？是否有条件可谈？现在无法下定论，等中共垮台后就知道结果了。）\n\n---\n\n清末时期中国人口4亿，满清政权拥百万军队。现在中共拥200万军队，200万警察，人口13亿。按人口比例中共拥军警数高于满清政权。\n\n满清有八旗兵，始终忠于朝廷。直到武昌起义，革命党，改良派鼓动袁世凯趁机攻入北京，袁世凯手握北洋重兵，依然感到无法对抗八旗10万精骑。\n\n中共没有红二代兵，没有始终忠于中共的军队，不然就不用枪弹分离了。\n\n满清有一批有能力，有担当的忠臣，曾国藩，左宗棠，李鸿章，张之洞，袁世凯。他们都曾经手握足以推翻满清政权的兵力，而且有这样的机会，不过他们依然忠于朝廷。对朝廷的错误决策，他们敢顶住。朝廷支持义和团作乱，袁世凯敢顶住，不准义和团进入山东。太后老佛爷向12国开战，李鸿章，张之洞敢顶住太后的诏书，搞东南互保，严守中立。这可是杀头的罪，甚至可能连累家人。\n\n中共没有这样的人物，中共也不敢把如此多的军队交给某个官员。\n\n清末法治依然存在，以杨乃武案最为典型。秋瑾案也证明法治尤存，秋瑾涉徐锡麟案，但罪不至死，所以处决秋瑾激起各地多起民众示威抗议，最后主审官迫于压力自杀。\n\n中共法治荡然无存，遍地冤案。\n\n清末维新是为变法图强，并非迫于遍地群体事件，也并非迫于经济崩溃，民众与朝廷没有严重的冲突，所以立宪派可以合法存在，公开活动，宣传主张。中共的改革开放是迫于经济崩溃，而且现在已经是遍地都是上访民众，每天都在发生群体事件。民众与政府的矛盾冲突非常严重，以至于民众聚餐都成非法活动。\n\n清末列强是支持清庭的，并不支持革命党，现在西藏，新疆的独立运动，南蒙古独立运动，都有强大外援。\n\n所以，满清政权与中共政权强弱对比是明显的，满清政权要强于中共政权。"
		},
		{
			"post_id": 241,
			"title": "三大“反对”势力如何运作？",
			"date_published": 1489534252.902,
			"body": "1，立宪派国民党\n\n国民党根本就是失去了方向，连到底是否要返回大陆政治舞台都没弄清。别人看不清，国民党自己也说不清。\n\n国民党如果打算返回大陆政治舞台，光承认9-2共识，与共产党碰碰杯，喝喝酒是不够的，需要向民众宣告大陆政策，究竟如何返回大陆政治舞台。否则只会越来越被动，即不能获得独立派民众的认同，也不能获得统一派民众的认同，前景可想而知。\n\n---\n\n国民党不放弃统一立场，至少得像清末立宪派一样，能在大陆各地设立分支机构，能够发动三次全国大请愿，要求中共实行宪政。不是等着中共来统战，来招安。\n\n国民党要直接在大陆各地设立党部，中共显然不会同意。但是变通的方式还是有的。国民党可以把大陆各地的民国派人物组织起来，成立9-2共识维持会，“一个中国，各自表达”宣传民国宪法，宣传9-2共识。其实宣传9-2共识中共是害怕的，中共对大陆民众只说一个中国原则，却从来不说“各自表达”。92共识不是“一个中国原则”，而是“一个中国，各自表达。”\n\n国民党还可以在大陆各地把国军后代组织起来，成立各种联谊会。还可以把大陆各地的“三青团”后代组织起来，成立各种联谊会。国民党还可以通过网络招收大陆网络党员，召开网络大陆国民党党代表大会，召开网络大陆国民党全党大会。总之，方式是很多的。\n\n中共既然坚持“9-2共识”，国民党自然可以表达在大陆发展国民党党员，发展国民党组织。\n\n如果国民党已经打算放弃大陆政治舞台了，就应该立足台湾，准备台湾独立建国了。不然即不返回大陆，又不立足台湾，是无法让民众认同的。\n\n2，革命党维族藏族\n\n中国现在的革命党维族藏族之势力比之辛亥革命时期大过何止千万倍。维族，藏族之暴力反抗比之辛亥革命时期其烈度何止强过千万倍。维族藏族付出之代价不可谓不大。可是效果却远不如辛亥革命时期。显然没有找到正确的方法。\n\n我认为在目前中共以几十万的镇压力量进入新疆，西藏的现实下，继续在新疆开展暴力反抗是为不明智的做法。藏人以自焚作为暴力反抗之手段更为不明智。如果是140个刺客而不是140个自焚抗议者，效果会如何？答案是显然的。\n\n维人，藏人现在应该把暴力反抗放到汉人地区。但是维人，藏人的外貌特征太过明显，在汉人地区进行小组革命活动也显然太过危险。所以需要与汉人联手进行暴力革命。这样更容易成功，取得震动社会的效果，鼓励更多的人站出来反抗。汉人中并非没有想以暴力手段来反抗中共的暴政，只是汉人多数胆小，国安的特务又多，难以有真正敢实施的勇士。\n\n不过，维汉，藏汉联手进行暴力革命的方法还是有的。参照辛亥革命的剧本，暗杀团是分成侦察，执行，支援小组的。汉人设立暗杀团侦察，支援小组没问题，只是执行小组难找勇士。而维人，藏人多的是勇士，只是在汉人地区进行侦察不容易，两相合作就能干大事。\n\n先选定打击目标，把中共那些民愤很大，很嚣张的官员，法官作为打击目标。由汉人侦察小组完成侦察，然后把情报交给维人，藏人革命团体。这种情报转交都可以不用见面的，所以安全性很高，比单纯的汉人暗杀团行动更安全。维人，藏人革命团体获得情报后再自行判断，从一批打击目标中选出具体打击对象，等待合适机会动手实施打击。\n\n首先应该选定云南作为革命团体开展合作的地区，云南容易脱身，跑到缅北泰北就安全了，可见缅北泰北对中国民主革命很重要，需要有能力的人去那里打开局面。次选东北。\n\n对于这种暴力反抗行动，是否真的打死几个中共官员并不重要，重要的是有这样的行动。行动就能造成社会影响。如掀起辛亥革命暗杀潮的万福华，他根本连枪都不会使用，他只是在上海闹市中心持枪揪住广西巡抚大骂了一通，就造成了社会震动。如汪精卫刺杀摄政王，整个过程犹如搞笑，同样达到了震动社会的效果。\n\n维人，藏人只要能与汉人联手在云南实施几次行动，就能激发全国范围的暴力反抗革命运动。\n\n3，改良派海外民运\n\n由于中共党内没有真正的改良派，即便如总理温家宝也最多只能说说“要靠民众觉醒”，仅此而已，没有实质的改良行动，也无法形成改良派势力。所以，海外民运团体作为改良派，在中国的民主变革进程中难以有什么作为。\n\n不过还是有2件事是海外民运可以做的。一是协助国内良心犯家属逃亡欧美，申请庇护。另外一件事是将国内的人权案向联合国人权理事会提出申诉。\n\n当然，海外民运团体也可以变身为革命党。"
		},
		{
			"post_id": 240,
			"title": "New blog post",
			"date_published": 1489476389.408,
			"body": "![101.jpg (0x0)](data/img/post_240_101.jpg)"
		},
		{
			"post_id": 239,
			"title": "New blog post",
			"date_published": 1489476244.65,
			"body": "![100.jpg (0x0)](data/img/post_239_100.jpg)"
		},
		{
			"post_id": 238,
			"title": "New blog post",
			"date_published": 1489475956.736,
			"body": "![11.jpg (0x0)](data/img/post_238_11.jpg)"
		},
		{
			"post_id": 237,
			"title": "New blog post",
			"date_published": 1489475817.045,
			"body": "![97.jpg (0x0)](data/img/post_237_97.jpg)"
		},
		{
			"post_id": 236,
			"title": "New blog post",
			"date_published": 1489473242.578,
			"body": "![102.jpg (0x0)](data/img/post_236_102.jpg)"
		},
		{
			"post_id": 234,
			"title": "New blog post",
			"date_published": 1489454291.775,
			"body": "![32.jpg (0x0)](data/img/post_234_32.jpg)"
		},
		{
			"post_id": 233,
			"title": "New blog post",
			"date_published": 1489454177.711,
			"body": "![29.jpg (0x0)](data/img/post_233_29.jpg)"
		},
		{
			"post_id": 232,
			"title": "New blog post",
			"date_published": 1489454077.7,
			"body": "![20.jpg (0x0)](data/img/post_232_20.jpg)"
		},
		{
			"post_id": 231,
			"title": "New blog post",
			"date_published": 1489454021.834,
			"body": "![26.jpg (0x0)](data/img/post_231_26.jpg)"
		},
		{
			"post_id": 230,
			"title": "New blog post",
			"date_published": 1489453971.426,
			"body": "![27.jpg (0x0)](data/img/post_230_27.jpg)"
		},
		{
			"post_id": 229,
			"title": "New blog post",
			"date_published": 1489453885.107,
			"body": "![25.jpg (0x0)](data/img/post_229_25.jpg)"
		},
		{
			"post_id": 228,
			"title": "乌克兰革命",
			"date_published": 1489311005.352,
			"body": "![11.jpg (0x0)](data/img/post_228_11.jpg)"
		},
		{
			"post_id": 227,
			"title": "黄埔后代基金会上海分会志愿者实习基地正式挂牌成立",
			"date_published": 1489308386.654,
			"body": "（维权网信息中心报道）本网获悉：2016年9月14日，黄埔后代基金会上海分会志愿者实习基地在上海市定西路1318号正式挂牌成立。黄埔后代基金会会长黎明；黄埔后代基金会上海分会会长王宗泽、副会长李治平、周洪宝；黄埔后代基金会上海分会志愿者董春馥、潘家全、杨勤恒、邓成联、王燕亭、周国淮、王宝妹、魏勤、陈建芳等参加挂牌仪式。逸仙舰副舰长章仲樵的孙子章华麟先生也到场祝贺并参观了基地。\n\n* * *\n\n中华民国国旗和国民党党旗及孙中山和蒋介石的遗像挂在黄埔后代基金会上海分会办公室的墙上。大家在黄埔后代基金会上海分会会客室一起商讨如何发扬孙中山先生倡导的“天下为公”， 天下为公的意思是：天下，是天下人的天下。不是某一个党某一个派的天下，更不是共贪党的天下。既然是天下人的天下，就必须由天下人来管理，民主选举、监督、任用、弹劾官员。\n\n为了表示拥护孙中山先生倡导的三民主义“主权在民”的原则，民生主义则强调了“耕者有其田”的观点，黎明会长和上海分会3位会长及志愿者对当今社会不公现象及为愤怒，一起举牌声援乌坎、促进民主。\n\n附：\n黄埔后代基金会香港地址：香港九龙尖沙咀广东道5号海洋中心9楼906室；\n黄埔后代基金会大陆地址：上海宝山区城银路555弄绿地领海大厦16座1104室；\n黄埔后代基金会上海分会地址：上海市定西路1318号。\n\n![14.jpg (0x0)](data/img/post_227_14.jpg)\n\n![13.jpg (0x0)](data/img/post_227_13.jpg)"
		},
		{
			"post_id": 226,
			"title": "New blog post",
			"date_published": 1489306968.327,
			"body": "![104.jpg (0x0)](data/img/post_226_104.jpg)"
		},
		{
			"post_id": 225,
			"title": "New blog post",
			"date_published": 1489306800.203,
			"body": "![12.jpg (0x0)](data/img/post_225_12.jpg)\n\n![11.jpg (0x0)](data/img/post_225_11.jpg)\n\n![15.jpg (0x0)](data/img/post_225_15.jpg)\n\n![10.jpg (0x0)](data/img/post_225_10.jpg)"
		},
		{
			"post_id": 224,
			"title": "New blog post",
			"date_published": 1489203055.878,
			"body": "![16.png (0x0)](data/img/post_224_16.png)\n\n![17.jpg (0x0)](data/img/post_224_17.jpg)\n\n![18.jpg (0x0)](data/img/post_224_18.jpg)"
		},
		{
			"post_id": 223,
			"title": "New blog post",
			"date_published": 1489202908.369,
			"body": "![________.jpg (0x0)](data/img/post_223_________.jpg)"
		},
		{
			"post_id": 222,
			"title": "New blog post",
			"date_published": 1489202814.231,
			"body": "![9.jpg (0x0)](data/img/post_222_9.jpg)"
		},
		{
			"post_id": 221,
			"title": "New blog post",
			"date_published": 1489202724.218,
			"body": "![8.jpg (0x0)](data/img/post_221_8.jpg)"
		},
		{
			"post_id": 220,
			"title": "中共的苏维埃制度根本不配美国“尊重”",
			"date_published": 1489202615.429,
			"body": "克鲁兹参议员今天发表文章，批评国务卿克里的关于中国的谈话。以下是摘译。\n\n国务卿克里说：“如同习近平主席说的，中美有不同的制度、文化和历史。俺们承认并尊重对方。”\n\n俺尊重中国5000年的文化，但中共的苏维埃制度根本不配美国“尊重”。从毛到习，中国人民惨遭独裁者不断的迫害。大跃进和文革使数以百万计的中国人丧生，可以说是共产制度失败的墓碑。"
		},
		{
			"post_id": 219,
			"title": "New blog post",
			"date_published": 1489143381.568,
			"body": "![7.jpg (0x0)](data/img/post_219_7.jpg)"
		},
		{
			"post_id": 218,
			"title": "New blog post",
			"date_published": 1489143343.169,
			"body": "![6.jpg (0x0)](data/img/post_218_6.jpg)"
		},
		{
			"post_id": 217,
			"title": "New blog post",
			"date_published": 1489143163.389,
			"body": "![5.jpg (0x0)](data/img/post_217_5.jpg)"
		},
		{
			"post_id": 216,
			"title": "New blog post",
			"date_published": 1489143108.875,
			"body": "![4.jpg (0x0)](data/img/post_216_4.jpg)"
		},
		{
			"post_id": 215,
			"title": "New blog post",
			"date_published": 1489142882.575,
			"body": "![_____.jpg (0x0)](data/img/post_215______.jpg)"
		},
		{
			"post_id": 214,
			"title": "习近平的依宪治国",
			"date_published": 1489057585.703,
			"body": "![3.jpg (0x0)](data/img/post_214_3.jpg)"
		},
		{
			"post_id": 213,
			"title": "苏联瓦解的原因",
			"date_published": 1489057449.631,
			"body": "![2.jpg (0x0)](data/img/post_213_2.jpg)"
		},
		{
			"post_id": 212,
			"title": "吴淦案会见简述：",
			"date_published": 1489057233.189,
			"body": "今天下午经过一点波折和耐心等候之后，在天津市第二看守所顺利会见了吴淦先生（网名屠夫）。我首先转达了大家对他的新春问候。他也祝大家新春快乐，特别问及了各良心犯的近况，并请他们的律师一一代为问候！\n虽难以启齿，但本人还是告诉了其岳父大人于2017年2月4日凌晨1点25分病逝的消息。 吴先生听闻其岳父辞世十分悲痛，请其夫人处理好老人家的后事，并照顾好自己，节哀顺变，保重身体。亦请其夫人、岳母及所有亲属谅解他无法尽孝的罪过。\n吴先生透露年二十九下午（2017年1月26日，当天下午燕薪律师要求未果），天津市二分检的检察官宫宁和另一位检察院领导前往天津市第二看守所劝说他认罪，配合庭审，被其严词拒绝！\n\n     人权律师 葛永喜\n      二0一七年二月八日"
		},
		{
			"post_id": 211,
			"title": "杨建利促请海外组织协同营救中国政治异议人士的妻儿",
			"date_published": 1489056908.257,
			"body": "[日期：2016-07-23] 来源：RFA 作者：\n\n杨建利与平安到达旧金山的刘晓冬母子（CK摄）\n\n中共在残酷迫害政治异议人士的同时，也无情的摧残他们的妻子和儿女。民运和人权组织“公民力量”创办人杨建利促请：海外民运和人权组织协同合作，开展营救政治异议人士妻儿的活动，让她们获得一个正常的生活和学习环境。\n\n---\n\n杨建利刚刚从泰国曼谷营救中国政治异议人士赵常青的妻儿刘晓冬母子来到美国。参与这次营救行动的，除了杨建利创办的“公民力量”外，还有“人道中国”、“基 督教对华援助协会”和“现在自由”等人权组织。杨建利亲自飞去曼谷执行营救计划，他不是美国公民，持中国护照，这意味着要承担巨大风险，但他相信营救行动 一定成功。\n\n赵常青的妻子刘晓冬带着4岁的儿子，怀着第二胎，5月9日到达曼谷。原本打算向联合国设于曼谷的难民公署申请政治难民身份，不料被曝光，泰国对于刘晓冬母子来讲已经不是安全的地方。于是参与营救行动的杨建利、周锋锁、傅希秋等人紧急磋商，决定由杨建利向美国国务院求助。\n\n杨建利说：“我赶快去找一直和我合作的律师Jared Genser，我 们一起去国务院。管人权事务的助理国务卿没有时间，他让他的副助理国务卿见我们。我们把这个案子一谈，那时候赵常青为了纪念六四第五次被捕，真正的民运人 士的牺牲，对当时跟我们谈的副助理国务卿和中国事务顾问震撼很大，他们说马上启动紧急人道救援，但必须国务卿批，我们这个小组马上报上去。”\n\n在 国务卿批准之前，杨建利还应约前去国务院，回答了副助理国务卿提出的问题。他告诉美国官员，刘晓冬在泰国正处于被中共绑架回国的恐惧之中。杨建利并出具了 自己和周锋锁为刘晓冬母子来美国生活提供的经济担保书。美国官员还对杨建利前往曼谷的安全问题表示关切，对此杨建利也做出了令他们放心的回答。\n\n美国国务院7月14日向美国驻曼谷大使馆发出为刘晓冬母子提供人道保护、特许母子俩直接入境美国的备忘录。15日，杨建利登上飞往曼谷的飞机，16日抵达曼谷；17日是星期天，杨建利帮助刘晓冬母子做完签证前的准备工作；18日星期一，美国大使馆打破隔日取签证的惯例，不到两个小时，就把刘晓冬母子的入境签证办妥；19日，刘晓冬母子在杨建利陪同下，安全飞抵旧金山。\n\n近 几年来，旧金山的“人道中国”已经救助多名政治异议人士的妻子和子女逃离中国来到美国，但四个民运和人权组织协同行动，营救政治异议人士的妻儿，这还是第 一次。对此杨建利说：“我觉得这次创造了一个很好的模式：你看我们几个组织合作得这么好，我们大家诚心诚意的配合，各自发挥自己的长处，使得我们民运的第 二代，或者是良心犯的孩子们，未来的前途好一些，使他们的父辈在国内奋斗下去心里也踏实些。”\n\n杨建利接着表示：“中国的恐怖输出非常严重，在泰国可以看到它的很多影响。但是泰国仍然是出现紧急情况避难的一个地方，虽然不是万全的地方，总比在中国安全一些。只要我们计划缜密，行动的人非常谨慎，事情是可以做。”\n\n在杨建利飞去曼谷之时，旧金山的“人道中国”组织便做好了接待和安置刘晓冬母子的准备工作。由于刘晓冬怀着九个月身孕，这一接待安置和营救一样，也需要计划缜密、行动谨慎。"
		},
		{
			"post_id": 210,
			"title": "2017年3月7上午上海地铁12号线上一幕",
			"date_published": 1488886628.664,
			"body": "![2017_3_7______12_____.jpg (0x0)](data/img/post_210_2017_3_7______12_____.jpg)\n\n![2017_3_7______12_____2.jpg (0x0)](data/img/post_210_2017_3_7______12_____2.jpg)\n\n![2017_3_7______12_____3.jpg (0x0)](data/img/post_210_2017_3_7______12_____3.jpg)"
		},
		{
			"post_id": 209,
			"title": "孙富贵2017年3月3日举牌于烟台莱山新世界百货广场﻿",
			"date_published": 1488886453.053,
			"body": "![5.jpg (0x0)](data/img/post_209_5.jpg)"
		},
		{
			"post_id": 208,
			"title": "谢阳律师的声明",
			"date_published": 1488724944.882,
			"body": "![4.jpg (0x0)](data/img/post_208_4.jpg)"
		},
		{
			"post_id": 207,
			"title": "中共的核心利益:第一是维护共产党专制",
			"date_published": 1488710425.83,
			"body": "2009年，中美经战略与经济对话会上，时任中共国务委员戴秉国的一席话更加表露出中共的心态。戴秉国在谈及中美关系时表示，中共的“核心利益第一是维护基本制度和国家安全，其次是国家主权和领土完整，第三是经济社会的持续稳定发展”。\n\n对此，莫之许说，不会误读的是，所谓基本制度和国家安全，当然指的是现行政治制度，也就是现行的一党专政体制，以及对应的对民众的权利剥夺状况。"
		},
		{
			"post_id": 206,
			"title": "New blog post",
			"date_published": 1488710165.999,
			"body": "![3.jpg (0x0)](data/img/post_206_3.jpg)"
		},
		{
			"post_id": 205,
			"title": "New blog post",
			"date_published": 1488710020.128,
			"body": "![2.jpg (0x0)](data/img/post_205_2.jpg)"
		},
		{
			"post_id": 106,
			"title": "New blog post",
			"date_published": 1486129524.605,
			"body": "![1.jpg (0x0)](data/img/post_106_1.jpg)"
		},
		{
			"post_id": 105,
			"title": "习近平亮剑",
			"date_published": 1486129404.332,
			"body": "![3.jpg (0x0)](data/img/post_105_3.jpg)"
		},
		{
			"post_id": 104,
			"title": "New blog post",
			"date_published": 1486129350.778,
			"body": "![tumblr_o9gojiVUV81vyx9i9o1_540.jpg (0x0)](data/img/post_104_tumblr_o9gojiVUV81vyx9i9o1_540.jpg)"
		},
		{
			"post_id": 103,
			"title": "New blog post",
			"date_published": 1486129284.415,
			"body": "![tumblr_o9jaroax4O1vyx9i9o1_500.jpg (0x0)](data/img/post_103_tumblr_o9jaroax4O1vyx9i9o1_500.jpg)"
		},
		{
			"post_id": 102,
			"title": "New blog post",
			"date_published": 1486129130.399,
			"body": "![tumblr_o9gqtwX4HX1vyx9i9o1_540.jpg (0x0)](data/img/post_102_tumblr_o9gqtwX4HX1vyx9i9o1_540.jpg)\n\n![tumblr_o9gr3gnd8i1vyx9i9o1_540.jpg (0x0)](data/img/post_102_tumblr_o9gr3gnd8i1vyx9i9o1_540.jpg)"
		},
		{
			"post_id": 101,
			"title": "New blog post",
			"date_published": 1486128923.153,
			"body": "![tumblr_o9f7caka4p1vyx9i9o1_540.jpg (0x0)](data/img/post_101_tumblr_o9f7caka4p1vyx9i9o1_540.jpg)\n\n![tumblr_o9f7caka4p1vyx9i9o2_540.jpg (0x0)](data/img/post_101_tumblr_o9f7caka4p1vyx9i9o2_540.jpg)"
		},
		{
			"post_id": 100,
			"title": "Kunga Tashi (贡噶扎西)公开",
			"date_published": 1486127830.081,
			"body": "![2.jpg (0x0)](data/img/post_100_2.jpg)\n\n特朗普政府将支持西藏问题\n\n今天美国参议院表决通过了雷克斯·蒂勒森担任美国务卿的提名。在提名表决前，参议院外交关系委员会就西藏问题以书面形式对蒂勒森提问，他对各问题均作出积极肯定的回答。\n\n蒂勒森先生在答复中承诺，他将把人权问题，包括政治犯的问题纳入美国和中国的外交接触中。他将有关基督徒、藏传佛教、维吾尔穆斯林和法轮功学员的宗教自由问题列为优先考虑的问题。他补充说，关于宗教自由状况的评价应继续列入每年发表的“国际宗教自由报告”，同时强调2016年中国重新进入“受特别关注”的国家。\n\n* * *\n\n关于美国对中国－西藏对话问题的相关承诺，他的回答是在承认西藏是中华人民共和国的一部分的同时，他将继续鼓励北京和西藏“流亡政府”以及达赖喇嘛的代表之间展开对话。 他强调将鼓励北京以及所有的国家政府尊重和保护全世界藏族人民独特的宗教，语言和文化特性。\n\n在被问到是否愿意和达赖喇嘛会面时，他给出了十分肯定的回答。他同时表示，拒绝对类似西藏那样限制行动自由和信息流通的地方发签证，阻止记者、民间社会行动者、外交官和其他人进入西藏的做法是“有问题的。”\n\n关于是否会对中国官方媒体驻美高官或行政人员限制美国签证发放数量，以及对那些拒绝给美国公民签发入藏签证的中国官员实施签证制裁的问题，蒂勒森先生承诺将进一步考量最佳对策，同时指出给予互惠待遇是国家双边关系中的一个主体。\n\n在他被新总统特朗普提名为国务卿之前，雷克斯·蒂尔森先生是埃克森美孚公司的董事长兼首席执行官。今天美国会参议院外交关系委员会以11票赞成，10票反对的结果批准对蒂勒森的提名进行表决，之后，参议院以56票赞成、43票反对、1票弃权的结果通过他的提名。\n\n2017年2月1日，达赖喇嘛尊者驻北美代表处提供。"
		},
		{
			"post_id": 99,
			"title": "【对于联合国禁止酷刑委员会的建议，中国政府如是说】",
			"date_published": 1486127504.524,
			"body": "1.对被拘留人获得律师会见的限制\n\n中国政府：“……上述规定仅要求极少数特殊案件中律师会见需得到许可，系对保障被拘留人人权与维护国家和公共安全、司法正义的适度平衡，且相关规定仅适用于侦查期间，待有碍侦查或者可能泄露国家秘密的情形消失后以及案件移送起诉以后，有关部门应当许可会见，并及时通知看守所和辩护律师。实践中，公安、检察等侦查机关严格遵守相关规定，采取各种措施依法保障律师会见权利。”\n\n---\n\n2.对向被拘留人家属发出羁押通知的限制\n\n中国政府：“……上述安排是对保障被拘留人人权与维护刑事司法正义的适度平衡，且相关规定仅适用于侦查期间，有碍侦查的情形消失后，应当立刻将相关情况通知被拘留人家属。在司法实践中，公安、检察机关严格执行《刑事诉讼法》有关规定，依法保障被拘留人家属的知情权。”\n\n3.所谓对“维权律师”和“活动人士”的“打压”\n\n中国政府：中国政府不存在对所谓的“维权律师”和“活动人士”进行“打压”的情况。实践中，存在极个别律师受到法律的追究和制裁的案例，这是因为他们违反执业道德和纪律，超出法律规定的律师执业范围，涉嫌违法犯罪。任何人不能因其律师身份而享受任何“特权”。这是对绝大多数依法执业律师利益的维护，有助于营造良好的律师执业环境，促进律师事业健康发展。\n\n关于审议中提到的锋锐律师事务所案，此案已于 2016 年 8月 2 日至 5 日在天津市第二中级人民法院公开审判。周世锋、翟岩民、胡石根、勾洪国被依法判处刑罚。四人均认罪忏悔、服从判决，相关情况媒体已有报道。上述人员在羁押期间，其合法权益均得到充分保障。\n\n4\\. 酷刑指控调查的独立性\n\n中国政府：“人民检察院与公安机关没有隶属关系，在侦查公安民警涉嫌酷刑犯罪时，能够保障调查的独立性。虽然检察机关同时拥有公诉权和侦查权，但是在检察机关内部，公诉权和侦查权是由不同部门行使的，能够在侦查酷刑行为时保证监督的独立性和公正性。同时，中国政府正在开展国家监察体制改革试点。”\n\n5\\. 关于中央政法委的主要职责\n\n中国政府：“中央政法委是协调各方职能、督促依法履职、创造公正司法环境等，政法委支持审判机关、检察机关依法独立公正行使审判权、检察权，不协调个案，亦不对案件的事实证据、定罪量刑提出具体意见。”\n\n6\\. 关于《国家保密法》、解密酷刑资料\n\n中国政府：“中国政府在审议对话前的问题单答复材料中已提供部分涉及被羁押人数量、酷刑行为起诉和审判的数据，但由于中国幅员辽阔，人口众多，地区发展不平衡，人力和资源有限，各个区域的统计口径也不尽相同，难以在短时间内收集并汇总出其他各项详细细分数据。我们将认真研究委员会提出的建议，争取尽快提升数据统计的能力和水平。”\n\n——摘自《中国政府关于联合国禁止酷刑委员会结论性意见的后续答复材料》"
		},
		{
			"post_id": 95,
			"title": "王江松 ‏@JiangsongWang",
			"date_published": 1486048175.853,
			"body": "英国保守党人权委员会于去年夏天开始就中国人权近况展开调查，并邀集人权组织、相关个人和团体进行了二次分别长达三小时的听证会，最后出台了这份名为《最黑暗时刻》（ The Darkest Moment ）的报告。"
		},
		{
			"post_id": 94,
			"title": "海外红二代",
			"date_published": 1486047644.213,
			"body": "高干子女在香港特区定居的12万5千多人，在澳门特区定居的1万1千2百多人。在香港特区拥有亿元以上资产的官二代官三代有10万3千多人。在澳门特区拥有亿元以上资产的官二代官三代有6千6百多人。在港澳特区定居的官二代官三代中有95%已持有英国加拿大美国澳大利亚等西方国家定居权或国籍。"
		},
		{
			"post_id": 93,
			"title": "不给普世价值留空间",
			"date_published": 1486047430.44,
			"body": "![1.jpg (0x0)](data/img/post_93_1.jpg)"
		},
		{
			"post_id": 90,
			"title": "索要参选人大代表的表格被拘留",
			"date_published": 1486045934.247,
			"body": "（维权网信息中心报道）本网获悉：2016年8月23日江西独立候选人杨微（杨霆剑）于户籍所在地抚州市资溪县鹤城镇政府索要参选人大代表的表格遭拒，至县政府再次申请，但警察前来将其带至资溪鹤城派出所后拘留于江西省资溪县公安局拘留所。\n\n据了解，2016年8月23日江西独立候选人杨霆剑于户籍所在地抚州市资溪县鹤城镇政府索要参选人大代表的表格遭拒，随后至县政府再次申请，但警察前来将其带至资溪鹤城派出所。\n下午四时，杨霆剑从派出所致电家属告知警察要拘留他十天。 傍晚时分其父亲前往派出所希望了解情况，证实其行政拘留十天，但派出所民警表示“国家规定，拘留只需口头通知即可，不需要拘留通知书。” 凌晨1时，杨霆剑被送至江西省资溪县公安局拘留所拘留。"
		},
		{
			"post_id": 89,
			"title": "受过虐待的儿童习近平",
			"date_published": 1486045824.32,
			"body": "但也有少数受过虐待的儿童，由于心理创伤过于深重，长大后变成施虐者。很不幸，习近平就是其中一个。\n\n1962年，时任国务院副总理的习仲勋被毛泽东、康生迫害，全家遭株连。当时才九岁的次子习近平成了“黑帮子弟”，遭受了可怕的歧视、欺凌和折磨。文革中，习近平曾被红卫兵追赶羞辱，被戴上高帽批斗，被威胁说要枪毙他。他挨饥受饿，被逼流浪，还曾被抓到北京少管所作为犯人关押。后来他下乡在陕西最贫困的窑洞村，被变相劳改了七年。\n\n令这个少年的情感唯一源泉枯竭的一个事件，是他在落难时曾被自己的母亲告发。据媒体报道，当年习近平被关押时，有一次趁雨天跳窗逃回家，想让妈妈给饥饿的他弄点吃的。但他没有想到，之前被迫在他挨斗时举手喊口号打倒他的妈妈，见儿子逃回家不但没给他东西吃，反而冒着大雨告发儿子去了。绝望的习近平只能痛哭着从家里逃走，第二天又被抓进少管所。"
		},
		{
			"post_id": 88,
			"title": "New blog post",
			"date_published": 1486045531.485,
			"body": "![tumblr_o9gpqt719y1vyx9i9o1_540.jpg (0x0)](data/img/post_88_tumblr_o9gpqt719y1vyx9i9o1_540.jpg)"
		},
		{
			"post_id": 87,
			"title": "广东人权捍卫者甄江华遭遇强迫失踪",
			"date_published": 1486045352.717,
			"body": "（维权网信息中心报道）2016年9月6日，本网获悉：广东珠海人权捍卫者甄江华2016年9月3日前往广东陆丰乌坎村时被警察带走，后被强行押回珠海，截至今日，尚未获得自由并音信皆无，应是遭遇强迫失踪。\n9月3日，晚七点左右，甄江华在广东省陆丰县乌坎村內小店被带走到当地派出所。之后甄被扣押審訊超过二十四小时。\n9月4日晚十点后，甄江华本人电话出来，说已经被带回珠海，并在一个派出所里。晚十二点左右，甄电话出来说已经被带离派出所，要过几天才能出来。但没有说去哪里，已经确认遭遇强迫失踪。\n甄江华(Guests Zhen)： 青年人权捍卫者，资深社工公益人，服务于维权群体已逾十年，长居珠海，曾供职于澳门某非营利组织，同时是翻墙网 ATGFW.ORG 执行编辑；权利运动HRCCHINA.ORG 技术顾问；中文維基百科指导专家；香港艾滋病基金會 跨境旅客艾滋病預防宣傳教育項目珠海地区负责人，从事翻墙理念及知识的普及和推广工作，曾参与国内多起社会行动的组织策划工作，长期支援弱势社群维权。"
		},
		{
			"post_id": 86,
			"title": "《革命策》节选",
			"date_published": 1485923283.882,
			"body": "![5.jpg (0x0)](data/img/post_86_5.jpg)"
		},
		{
			"post_id": 85,
			"title": "《革命策》节选",
			"date_published": 1485923196.49,
			"body": "![4.jpg (0x0)](data/img/post_85_4.jpg)"
		},
		{
			"post_id": 84,
			"title": "暴力反抗操作细则",
			"date_published": 1485923102.999,
			"body": "![3.jpg (0x0)](data/img/post_84_3.jpg)"
		},
		{
			"post_id": 83,
			"title": "暴力反抗的操作方式",
			"date_published": 1485922995.992,
			"body": "![2.jpg (0x0)](data/img/post_83_2.jpg)"
		},
		{
			"post_id": 82,
			"title": "覃臣寿律师：唐志顺案办案记录（2017年1月30日）",
			"date_published": 1485922871.228,
			"body": "当局2015年7月9日拉开大幕对大陆维权律师进行抓捕、约谈恐吓、强迫失踪，王宇送其儿子包蒙蒙到机场被抓回，包蒙蒙护照也被扣缴，出境读书不得。唐志顺、幸清贤二人于2015年10月1日开始护送包蒙蒙出境缅甸，后被抓回，从此下落不明，音讯全无。最初黑龙江韦良月律师与山东冯延强律师介入唐志顺案，后因司法局压力，冯、韦二人先后被迫退出，广西覃臣寿律师、湖北张科科律师随后接力办理。\n\n---\n\n1、2015年12月广西百举鸣律师事务所接受唐志顺家属委托，指派覃臣寿担任唐志顺辩护律师。此时家属、律师都不知道唐被关押于何处，涉嫌罪名，办案机关 等，手上只有内蒙古兴安盟公安局扣押到北京唐志顺住处扣押台式电脑主机的扣押决定书一份，以及从央视、新华社等的有关唐志顺、幸清贤在国外反华分子协助下裹挟包蒙蒙出境的铺天盖地的污名化、抹黑报道。\n\n2、2015年12月11日，覃臣寿律师分别向中国公安部、天津市公安局、内蒙古兴安盟公安局EMS邮寄了“关于唐志顺案的律师意见及请求”及委托书、律师事务所函等，要求告知唐志顺的被羁押地点、涉嫌罪名、办案机关、保障律师会见权等，返向单、公安部收发章等证实公安部、天津市公安局、兴安盟公安分局都已经收到以上材料。12月15日天津市公安局来电说他们不确定这个案子是否属于他们管，叫律师与内蒙古兴安盟公安局联系，我说内蒙古公安局晗局长说案件已经移送天津。律师要求书面会读，随后被挂掉电话。\n\n3、2015年12月22日，律师再次向中国公安部、天津市公安局、兴安盟公安分局，通过顺丰速运邮寄 “（唐志顺案）基于人性人道人权的申请”，要求书面告知律师、家属唐志顺被关押于何处，办案部门及人员、涉嫌罪名等；保障律师会见权；保障唐身体健康、持续提供药物治疗甲亢、提供足够衣物、保障其足够睡眠及食物；书面保证其不收到刑讯逼供等酷刑对待、不被强迫失踪等。但至今未答复。\n\n4、2015年12月28日，律师到天津市河西看守所要求会见唐志顺，经查询后告知唐没有被关押在该看守所。当晚，律师到北京与唐志顺家人见面，家人都非常担心唐的安危。\n\n5、2015年12月29日，早上律师坐飞机到内蒙古兴安盟，到公安局提交授权委托书和律师证复印件，该局要求律师回去等消息。下午律师到兴安盟检察院控告公安局长违法扣押唐志顺电脑和拒不告知关押唐的地点，检察院不接受材料，僵持中兴安盟公安局来电话说安静涉及国家秘密就挂断电话。后律师通过申通快递向兴安盟检察院、内蒙古检察院邮寄控告书。同日，唐志顺妹妹集母亲也到朝阳区检察院提交控告常营派出所违法扣押电脑，检察院拒收，口头告知说回去等消息。\n\n注：2016年1月8日，覃臣寿律师在皇岗口岸不得出境香港，随后发表“哪里有自由，哪里就是我的祖国（办理唐志顺案有感）”\n\n6、2016年2月16日，律师再次向中共公安部、天津市公安局、兴安盟公安局邮寄“（唐志顺、幸清贤案）基于人性人道人权的再次申请”，三个单位都已经签收，但至今无答复。\n\n7、2016年3月24日，律师第三次向以上三个单位邮寄“基于人性人道人权的第三次申请”，至今也无答复。\n\n8、2016年5月3日，律师向中国公安部、天津市公安局、兴安盟公安局邮寄四页的“覃臣寿：关于唐志顺、幸清贤护送王宇之子出境缅甸被强迫失踪的办案过程集意见”，至今没有答复。\n\n9、2016年5月20日，幸清贤家属收到幸被关押在天津市第二看守所的通知书后，律师持有效证件到看守所要求会见唐，被告知要找预审管建童（音），管要求律师在大厅等办案人员，后警号281269持天津市河东分局牌子的李斌出现，告知律师说唐自己已经委托律师。后其问律师要家属电话说要邮寄通知书。等候期间我写好控告书，投递到天津市检察院第二分院驻所检察室信箱。后离开。\n\n10、2016年5月22日，唐志顺妹妹唐志英收到天津市公安局邮寄的津公（法）捕通字（2016）22号逮捕通知书，上写：经天津市检察院第二分院批准，我局于2016年5月4日十五时对涉嫌组织他人偷越国（边）境罪的唐志顺执行逮捕，现羁押于天津市第二看守所。至此，唐志顺被失踪八个月后，外界首次知悉羁押其的办案机关、羁押地点、涉嫌罪名。\n\n11、2016年5月25日，覃臣寿律师签署“中国律师对官方非法排除“709系列案“辩护律师的联合声明。\n\n12、2016年5月27日，律师向天津市律师协会会长邮寄了”覃臣寿律师声讨天津无良律师的横幅一副”，同时也向广西律师协会邮寄横幅一份，要求律协帮助维权。但至今没有回复。\n\n13、2016年6月30日，覃臣寿与张科科律师向天津市检察院第二分院提交控告书，控告天津市公安局局长赵飞、及唐志顺案办案人员、李斌等剥夺律师会见权、辩护权、追究其渎职、失职、侵权行为。同时向检察院提交历次向天津市公安局邮寄、提交的材料证据，证实其违法侵权行为。第二分院收下材料并出具回执。当天，第二分院以（2016）津检二分院控复字第52号答复函答复已将材料转往该院侦查监督处审查处理。下午到天津市检察院控告，被告知周世锋系列案相关控告由天津市检察院第二分院处理，市检察院不熟控告材料。早上，杨金柱为周世锋案，在天津市检察院门口翻筋斗。\n\n14、2016年7月11日上午，覃臣寿律师到天津市第二看守所要求会见唐志顺，遇到程海、黄汉中、卢廷阁、文东海、葛文秀、李伯光灯律师及家属王峭岭、李文足、原姗姗、樊丽丽等。递交登记材料后看守所一直不安排会见。无关人员李斌出来搪塞。之前对其控告，检察院没有答复。昨天晚上的709周年研讨会顺利召开。\n\n15、2016年7月29日，覃臣寿、张科科律师收到天津市检察院第二分院（2016）津检二分院控复字第54号答复函答复：你反应的天津市公安局在办理唐志顺安静期间侦查活动违法，经审查（调查），认为公安机关的侦查活动并无不当。检察院明目张胆的为违法犯罪行为张目了。\n\n16、2016年8月1日至4日，周世锋、胡石根被以颠覆国家政权罪重判，翟岩民、勾洪国被判缓刑。覃臣寿律师被本地国保约谈，内容为对周世锋、胡石根案的看法。\n\n17、经辗转得知，唐志顺已经被取保，但幸清贤至今下落不明，二人是否已经被判刑不得而知。\n\n至此，截至今天（2017年1月30日）作为辩护律师，至今没能见到自己的当事人，甚为遗憾。\n\n发帖者 维权网 时间： 下午6:28"
		},
		{
			"post_id": 81,
			"title": "只要你敢暴打流氓法官，我就担保你申请加拿大难民。",
			"date_published": 1485922691.691,
			"body": "只要你敢暴打流氓法官，我就担保你申请加拿大难民。\n\n无论你是告状无门，还是看不过中共的无法无天，只要你敢组织暴打队，暴打中共的流氓法官，你哪天逃离中国，逃到加拿大，我就担保你申请加拿大难民。\n\n在没有法治的地方实行自然法则具有天然的正义性。美国宪法保障公民的持枪权并非保障美国公民可以持有枪支玩玩，而是保障美国公民在法治被破坏的情况下，美国公民有实行自然法则的权利。\n\n不要恐惧共党成员的恐吓，加拿大人有能力分辨恐怖暴力与原始正义。\n\n你暴打中共流氓法官之后就面临即时的危险，这就是你申请难民最正当的理由！\n\n当然，你要逃亡到加拿大可能有难度，好在台湾很快就要通过“难民法”了。你逃亡台湾还是很方便的，很多人抱个皮球就能游到金门。\n\n更好的方法是你主动联系台湾军情局，无论你要报私仇还是泄公愤，只要是暴打流氓法官，你可以要求他们协助你，这样你就更容易向台湾申请难民了。"
		},
		{
			"post_id": 80,
			"title": "应该考虑筹组《暴打队》",
			"date_published": 1485922610.324,
			"body": "先暴打那些不懂“寻衅滋事”；“扰乱公共场所秩序”；“煽动颠覆国家政权”；“颠覆国家政权”是怎么回事的法官。打到他们明白为止。 每打一个奖励1万美元！"
		},
		{
			"post_id": 79,
			"title": "我主张",
			"date_published": 1485922531.882,
			"body": "**我主张把不懂什么叫“寻衅滋事”；“扰乱公共场所秩序”的法官先暴打一顿，以示警告。** \n\n**让他们明白什么叫“寻衅滋事”；什么叫“扰乱公共场所秩序”。**"
		},
		{
			"post_id": 78,
			"title": "可以考虑设立暴打基金",
			"date_published": 1485922460.114,
			"body": "![1.jpg (0x0)](data/img/post_78_1.jpg)"
		},
		{
			"post_id": 77,
			"title": "习近平批示全面打压",
			"date_published": 1485922311.915,
			"body": "习近平批示全面打压 洛阳一月内50教会改组\n\n[日期：2016-08-18] 来源：RFA 作者：\n2016年7月15日，河南省民族事务委员会及省宗教局发布消息指，对家庭教会进行整顿。\n\n国家主席习近平上月主持全国宗教工作会议后，传递对宗教政策的讯息后，各省市对家庭教会的打压进一步加大。其中河南省宗教局的通告显示，上月中开始的一个月内，洛阳市有50间家庭教会归顺政府，加入官方的三自教会；有15间不肯妥协就被迫关闭。有广东省家庭教会的牧师指，政府愈是打压，愈令家庭教会绝处逢生。（黄乐涛 报道）\n\n---\n\n美国对华援助协会的消息指，习近平上月主持全国宗教工作会议后，各地对家庭教会的打压进一步加大。当局对家庭教会先采取强逼加入官方三自会的政策，如果不从，就采取断水断电、驱离聚会点、抓捕传道人等办法，最终令家庭教会消失。从官方通知显示，被洛阳当局纳入管理、强行加入三自的家庭教会有50家，而被当局关闭的有15家，其他宗教建筑被强迫停工的有6处。\n\n本台周三（17日）曾致电洛阳市10多间教会查询，但电话不是无法接通便是无人接听。\n\n河南省宗教局的电话亦无人接听。\n\n广东省东莞市中福万民教会的牧师李鹏，周三（17日）接受本台查询时，亦指出现在于广东省的家庭教会，亦不断受到当局打压，强逼加入官方三自教会。\n\n李鹏：这边就是说深圳有不少家庭教会，被迫加入三自，广州也有，然后被迫搬家的， 他（政府）就是给房东施加压力，迫你搬走啊。\n\n记者问：如果你不搬，会不会停水停电这样做的？\n\n李鹏：会的，就是广州不是他们（政府）封门都会封门的，都是（把人）拉走，封门的这样子。\n\n他表示，家庭教会即使受到政府的不断打压，但是教友们是不会退缩的，反而政府愈是打压得厉害，教庭教会愈不会消失。\n\n李鹏：我们肯定不会妥协，坚决不加入，那我们就小组集会了，政府这样做，只会加大教会的发展，或许家庭教会在这几年能够发展，就是因为受到逼迫，然后以家庭单位发展教会，每一个家庭就每一个集会点，政府愈来愈逼迫，教会愈复兴，这个是他（政府）想不到的事。\n\n他指，希望政府停止对家庭教会的打压，给予人民信仰自由。\n\n香港浸会大学宗教哲学系高级讲师陈士齐向本台表示，认为现在大陆政府要扩充打压家庭教会，要将全国教会归顺政府才罢休。\n\n陈士齐：他（大陆政府）这个是颠覆力量来的，对他来说，很简单吧，就是外来宗教是信不过的，中国千多年的宗教就信得过了，回教是信得过的，佛教就信得过吧，道教自己传统宗教就信得过吧，（家庭教会）全部要跪低，他（政府）现在要维稳，维稳大过天了。\n\n他表示，其实大陆家庭教会的教友亦没有办法，这是很难抵抗当局打压的。\n\n陈士齐：（家庭教会的教徒）是没有办法保护自已的，（以前）你让我知道我是（家庭教会的），你可以不加入（三自教会的），即是以前胡锦涛、温家宝年代是宽松一些，现在就开始愈来愈紧了。\n\n河南省民族事务委员会及省宗教局，上月在官网发布通告表示，在“保护合法、制止非法、遏制极端、抵御渗透、打击犯罪”的基本原则下，对家庭教会进行整顿。"
		},
		{
			"post_id": 73,
			"title": "MRC 中国人权支持会",
			"date_published": 1485920987.145,
			"body": "越来越发现我们和国际人权机构的合作是如此之少，海量的中国人权案例居然进入不了这些机构的日常视野之中。为加强这方面的合作，中国人权支持会现寻求翻译义工，英德法西俄语种皆可，请有意协助者发邮件至mrcnrb@gmail.com 请大家帮忙各处转发。"
		},
		{
			"post_id": 72,
			"title": "中国开始听起来像朝鲜",
			"date_published": 1485920714.821,
			"body": "（博谈网记者赵亮编译）本文译自《福布斯》7月26日刊登的Panos Mourdoukoutas的文章，题目为“中国开始听起来像朝鲜”。以下为译文： 当涉及到处理南海争端的方式，北京开始听起来像朝鲜中央通讯社（KCNA）。 这对投资者来说是个坏消息。军事对抗将破坏该地区的经济一体化和发展，伤害全球经济，特别是中国，它还尚未发展出国内导向型经济。 南海争端始于中国和一些邻国之间的区域性拉锯战，但很快就变成了中美之间在经济和军事实力上的摊牌。 两年前，中国通过在南海建造人工岛屿来提高赌注。美国的反应是扩大美国海军在该人工岛屿周围的存在和升级其在韩国的导弹能力。"
		},
		{
			"post_id": 71,
			"title": "联合国人权报告员称中国政府干扰其工作",
			"date_published": 1485920595.769,
			"body": "[日期：2016-08-24]来源：VOA  \n\n联合国人权报告员星期二称，他在中国工作期间受到中国政府的干扰，无法与他事先约好的联系人会面。\n\n联合国赤贫和人权问题特别报告员菲利普•奥尔斯顿（Philip Alston）在结束了他9天的中国之行后对路透社表示，他启程之前就告知中国政府他此行希望会见的人，这是联合国特别报告员的例行工作。但是他说，“没有安排任何一次会面，而且我从我联系的一些人那里得到信息，他们被告知在此期间必须休假。”\n\n奥尔斯顿表示，他在所有其他国家访问时从没有遇到过类似的情况。他对路透社说：“特别报告员有权会见任何他想见的人，有权去任何他想去的地方。”\n\n奥尔斯顿应中国官员的安排，访问了中国的云南省。中国官员称，他们从来没有接到过少数民族社区的抱怨，也不觉得会发生任何抗议。\n\n奥尔斯顿星期二在联合国驻北京代表处介绍他的初步调查结果时说，中国减少贫困的努力使数亿民众的生活水平有所提高，但是如果不根除腐败和妥善解决民众的不满，中国目前取得的成果将在未来被破坏。"
		},
		{
			"post_id": 70,
			"title": "请李春富律师的律师立即提起刑事自诉并附带不低于1亿赔偿金的民事赔偿",
			"date_published": 1485920470.834,
			"body": "请李春富律师的律师立即提起刑事自诉\n\n并附带不低于1亿赔偿金的民事赔偿。\n\n请大家积极参与，围观李春富律师案件，确保不低于1亿赔偿金兑现。\n\n参与，围观的人越多越好。人数越多越好，越多越能拿到赔偿金。"
		},
		{
			"post_id": 69,
			"title": "以暴制暴",
			"date_published": 1485920365.356,
			"body": "![6.jpg (0x0)](data/img/post_69_6.jpg)"
		},
		{
			"post_id": 68,
			"title": "习近平的斗狠策略必将导致暴力革命",
			"date_published": 1485920244.748,
			"body": "![tumblr_o9bzf2sCou1vyx9i9o1_540.jpg (0x0)](data/img/post_68_tumblr_o9bzf2sCou1vyx9i9o1_540.jpg)"
		},
		{
			"post_id": 67,
			"title": "20万奖金！",
			"date_published": 1485920122.871,
			"body": "![tumblr_o9jbt9uS6j1vyx9i9o1_540.jpg (0x0)](data/img/post_67_tumblr_o9jbt9uS6j1vyx9i9o1_540.jpg)"
		},
		{
			"post_id": 66,
			"title": "习近平的斗狠策略使法官成为革命党的暗杀对象",
			"date_published": 1485919979.888,
			"body": "![tumblr_o9bzejau361vyx9i9o1_540.jpg (0x0)](data/img/post_66_tumblr_o9bzejau361vyx9i9o1_540.jpg)"
		},
		{
			"post_id": 65,
			"title": "反共的正确道路",
			"date_published": 1485919865.501,
			"body": "顾晓军 ‏@guxiaojun53\n\n6月18日\n\n大批律师被抓，再一次说明，反共走白道是没有希望的，因为共匪黑白通吃。反共必须坚持走黑道的路线，也就是组织地下帮会。只有在黑道上，才有希望在斗争中打破共匪的政权优势，以遍地开花的杀奸锄贼，使其政权瘫痪。其众多军警将毫无作用，甚至起义。这是反共的正确道路。"
		},
		{
			"post_id": 64,
			"title": "律师维权已死 街头革命开始",
			"date_published": 1485919659.926,
			"body": "709周年反思：律师维权已死 街头革命开始\n\n民一心\n\n709大抓捕1周年了，我们依然没有被抓被关押律师公民的任何消息，反思一年来，中国律师的努力和公民的呼吁关注，我得出中国民主运动当下的面临的形势是：律师维权已死，街头革命开始。\n\n---\n\n一、“709大抓捕”始于“519”\n\n2015年7月9日深夜，北京警方先在首都国际机场控制抓捕了包龙军父子，后又连夜袭击王宇家里，砸门抓捕。北京律师公民连夜驰援、国内公民关注，国外民运人士加入关注。7月10日，中国人权律师团发声表达声援关注王宇包龙军一家被抓的行动，全国各地由此展开抓捕、喝茶、威胁、警告、约谈、上岗等国家恐怖主义的序幕，据统计全国约抓319人，至2016年7月4日，其中传唤、强制约谈、短暂拘留后获释的有264人，限制出境39人，取保候审16人，批准逮捕24人，软禁1人。关押30多人。\n\n其实，在我看来这次抓捕实际上是从5月19日抓北京锋锐律师事物所行政助理吴淦（网名：超俗地级屠夫）开始，之后6月15日山东潍坊17公民律师的抓捕，再才是“709大抓捕”。这是中共流氓专制当局有计划、有预谋、有组织的迫害律师和公民群体的大暴露。\n\n这表明从上世纪90年代郭旭举提出维权概念后，民间、律师展开维权运动拉开序幕，至2015年5月，维权运动正式宣告失败，法律维权、律师会见权、律师预审侦查辩护权、法庭辩护权统被剥夺干净，中共魔鬼党露出赤裸裸的流氓专政的流氓、骗子嘴脸和本性。一副“我是流氓我怕谁？”不顾国内的民心民意，不管国际的关注呼吁谴责，上演了不准聘请律师、编造当事人的书面委托书、为当事人指定律师、威胁家属聘请律师、欺骗家属、恐吓家属不要发声、限制家属出境、甚至连孩子都不放过等等一系列的闻所未闻、骇人听闻、创秘密关押嫌犯时间的纪录，先是监视居住，后又一次又一次延长侦查时间，可以说在法律程序上无所不用其极，知法者在犯法，强奸当事人，迫害嫌疑人，搞家属连座，如吴淦父亲被重新收监，哥哥被调查，妻儿被冻结银行账户，断绝经济来源。谢燕益律师的夫人原珊珊身怀六甲被暴力、生产之后不到一月再到天津又被暴力非法扣押3天，逼迫房东让原珊珊母子搬家等。手段之卑鄙，行为之无耻连民间的普通流氓地痞都望其项背，自叹弗如！这就是共匪专制魔鬼打手、狗奴才做出的侵害中国公民的累累罪恶、毫无人性的罪行！\n\n二、法律维权已死\n\n这一轮709大抓捕，让我们看清了习特勒“以法治国”的本质：非法的流氓专制政府的流氓恶魔党连恶法的底线也不守了，随心所欲、为所欲为、肆无忌惮！律师们还会相信中国有法制？是法制社会？在我看来，709大抓捕暗示着中国流氓专制当局、习李独裁政权已进入末日的猖狂，流氓治国，谎言欺骗百姓的邪恶手段昭然于天下。律师们寄希望中共高层的改良之幻想应该彻底破灭，近20多年的法律维权至2015年7月证明，法律维权已走到尽头，律师的会见权、被暴力已遍及全国，律师法律维权模式已死，街头革命将成为未来主导中国民主转型的主要模式和唯一有效手段！\n\n我这里说的律师法律维权模式已死是指律师想以法律为武器、走司法维权、会见、辨护都已经被控制和堵死，所有走形式、走程序都被司法机关违法，法院开庭、辩护、宣判等也是早早决定好的，没有任何回旋的空间和辩赢的可能。律师可以继续做，要注意人身安全，但不会有实质性突破。\n已判案例：2016年6月17日，浙江民主党人吕耿松和陈树庆被以颠覆国家政权罪名宣判，吕耿松没有律师到场审判，陈树庆有律师到场，律师辩护权、个人辩护权被剥夺，分别判刑11年和10年6个月。\n\n未判案例：湖北赤壁黄文勋、袁兵、袁小华案，2013年5月25日，被警方刑事拘留。3人起初被控“聚众扰乱公共场所秩序罪”、“寻衅滋事罪”，至今未判决。郑州的于世文案，2014年5月被刑拘至今，为开庭审理判刑，广州的苏昌兰煽颠案，2014年10月27日被刑拘关押，2016年4月21日开庭，至今而不判决。709大抓捕案件中，至今被关押的胡石根、周世锋、翟岩民、勾洪国等近期被起诉，还有王宇律师、王全璋、吴淦、刘四新、包龙军等等，全被秘密关押，不让家属聘请的律师会见，估计还会秘密审判。\n\n三、街头革命前的必要条件\n\n民主人士、公民圈如何加快同城队伍建设，组建成熟团队，培训预演，鼓励各地敢死队、暗杀队，做好英雄的善后工作，送温暖、送爱心、送民心、送民意。这是走向街头关键，也是街头革命的前提条件。\n\n所以，当下中国国内公民，重在发展队伍，挖掘培养8090后为主的青年团队，组建各种有生的行动力量，为上街提供安全保障，为街头革命提供“枪口抬高十公分”的条件，为街头参与镇压的狗奴才消解警棍飞舞创造震慑条件。\n\n在全民走向街头之前，必须经历清除街头革命被镇压的嚣张气焰，定点清除，暗杀走狗奴才、打手帮凶、贪官污吏是革命的必经阶段，让参与镇压实施者面对手无寸铁的百姓，不敢警棍飞舞、枪口对准百姓子弹乱飞的血流成何的局面。前苏联转型暗杀5万多人，中国至少不少于此数，5～10万是底线。没有暗杀就不可能大规模上街，时机不成熟，上街了也会被镇压、被抓捕、被扑灭。中国过去无数次群体事件被扑灭，就是这个原因。\n\n如果说，维权是律师法院辩护，法庭口舌之争；公民小规模走上街头拉横幅，拍照上传网络的表演。那么，街头革命就是暗杀加大规模街头的实力对抗，进入实质性的操作阶段，杀一个或杀一家，震慑一大批狗奴才，正义才会得以彰显，民心民意才会力量无限，社会正气才会逐渐回归，觉醒的人就会越来越多。从而分化瓦解体制内的人，进而扩大民心民意，以此动摇军心、抬高枪口或调转枪口才成为可能，街头革命的氛围才会形成。\n\n四、街头革命风起云涌\n\n中国民主转型的“革命”一词有别于共匪的“暴力革命”、“武装革命”等含义。中国民主转型当下的革命是指革新每个中国公民的奴隶、奴民、奴才的命运，革新没有选票、没有免费医疗、免费养老、免费教育的权利，革新没有言论自由、没有人身迁徙自由、没有宗教信仰自由、没有结社自由、没有集会自由、没有游行示威自由、没有组党自由等，没有各种法律面前人人平等的权利，没有呼吸新鲜空气、喝清洁的水、干净的土壤的权利，没有自由参与选举各级行政领导的权利等个人和群体的命运。这里的“革命”是指革新中国平民百姓的命运，改变无一人一票的选国家或地区行政领导人的选票、无清新的空气、无清洁的水、无污染的土壤、无免费的医疗、无免费的养老、无免费的教育、无公平正义的司法制度等。\n这次中国民主转型街头革命的核心就是以联合国颁布的《世界人权宣言》、《经济、社会和文化权利国际公约》、《公民权利和政治权利国际公约》及《联合国宪章》等所载明的每个人所拥有的基本自由和权利。\n\n街头革命是指包括律师在内的所有中国人，面对非法的流氓政府的肆意妄为，我们的应对工作策略的重点，应该转移到网上线下发展708090后有生力量，积蓄实力，扩大队伍，组建团队，抓住机会，时刻准备上街，开展全国性的轰轰烈烈的街头游行示威革命。\n中国街头革命从2015年以来，逐渐增多，特别是随着中国的经济危机日渐加重，外资撤离中国的速度和规模加快，中国劳工走上街头的频率越来越高，据China Labor Bulletin的统计，中国街头罢工次数2013年为656次，2014年为1378次，2015年为2726次，2016年前两个月为792次。\n街头革命案例：2015年12月28日，甘肃金昌市永昌县一名小女孩因被怀疑偷拿巧克力、被超市方逼死，导致数千民众与中共警方发生冲突，警车被砸，现场指挥的金昌市市长被打得头破血流。\n\n2016年以来，全国各地如3月份黑龙江双鸭山矿工10万人罢工、吉林矿工罢工、陕西澄合矿务局部分职工罢工。e租宝事件全国各地投资受害者近10万人向北京结集；6月22日在广东陆丰市乌坎村村民声援被抓的村主任兼支书林祖銮5000村民上街游行，持续游行28天；6月27日湖北省潜江市、28日仙桃市，29日湖南省宁乡县，7月3日广东肇庆市高要区禄步镇等因反对建垃圾焚烧厂、农药厂等环保问题走上街头抗议，规模达到数万人之多。虽然都被镇压，但是未来挡不住民心、民意、民运继续频发，中国街头革命正如火如荼在全国各地展开。\n\n中国民主转型的街头革命除针对当地提出诸如环保诉求、要土地诉求等之外，一定要明确提出公民的政治诉求：要求废除一党专制，打倒共产党，推翻流氓专制、暴力维稳体制的假社会主义，建立民主宪政中国，要求放开报禁党禁，撤除环联网的防火墙，实行全国一人一票选举各级行政领导人直到国家领导人。否则，无法形成全国声援的合力与声势，达不到全国一个口号和目标，更无法形成全国性的、大规模的、持续多天的大游行示威。只有全国联动，才能彻底葬送邪恶中共的流氓专制独裁政府下台。这才是中国街头革命的最终目的和最后归宿。\n\n2016.7.8-7.22修改"
		},
		{
			"post_id": 63,
			"title": "尽快把唐荆陵袁新亭王清营家属接到美国",
			"date_published": 1485919405.749,
			"body": "尽快把唐荆陵袁新亭王清营家属接到美国，以鼓励更多的人站出来反抗中共暴政。\n\n据广州三君子家属表示：唐荆陵、袁新亭、王清营三人已分别被送往监狱服刑。唐荆陵在广东怀集监狱，袁新亭在广东四会监狱，王清营在广东韶关监狱。"
		},
		{
			"post_id": 61,
			"title": "上海人权捍卫者春节持续上街举牌声援唐荆陵袁新亭（图）",
			"date_published": 1485866451.927,
			"body": "（维权网信息中心报道）2017年1月30日，本网获悉：春节期间，上海人权捍卫者王燕亭、周洪宝、魏勤、徐佩玲、顾学群、丁菊英、张惠仙、陈桂英、蔡晓红、唐霞珍、胡伯森、韦开珍、郑培培、吴玉芬、陈国英、彭妙林、王宝妹、朱金娣、陈建芳等持续上街举牌声援被政治迫害坐牢已2年8个月的广州三君子中的唐荆陵和袁新亭（王清营获刑2年6个月已刑满释放）。\n\n在民间有“中国甘地”之称的唐荆陵律师和袁新亭、王清营一起推动公民不合作运动，希望带来自由和民主的中国。阐述“公民不合作运动”理念的5本书籍是：《从独裁到民主》、《粉碎邪恶轴心》、《草根群众组织》、《自我解放•终结独裁政权或其他压迫的行动战略规划指南》、《论战略性非暴力冲突：关于基本原则的思考》。他们还有推动“六四静思节”行动、429纪念林昭等。\n\n唐荆陵、袁新亭、王清营于2014年5月16日被广东省广州市警方以涉嫌“寻衅滋事罪”刑事拘留，2014年6月21日被以“煽动颠覆国家政权罪”逮捕。2015年6月19日他们三人被“煽动颠覆国家政权罪”一案在广州中院开庭。同年7月23日上午8时30分在广州中院第二次开庭审理。2016年1月29日宣判：唐荆陵被判处有期徒刑5年、袁新亭被判处有期徒刑3年6个月、王清营被判有期徒刑2年6个月。\n\n2016年6月1日辩护律师收到唐荆陵、袁新亭、王清营被控煽动颠覆国家政权罪一案的二审裁定书，案号：（2016）粤刑终619号，驳回上诉，维持原判。\n\n唐荆陵律师（CPPC编号：00135）是中国公民不合作运动的首倡者和积极推动者，他致力于推动公民不合作运动，希望借此带来民主和自由的中国。其设计的公民不合作运动主要包括内容：\n1.赎回选票行动（不参加不公平的选举）\n2.关注疫苗安全、精神病强制收治滥用\n3.六四静思节行动 （以静思方式纪念六四）\n4.429林昭纪念日悼念 （4.29日集体到林昭墓前悼念）\n5.明信片行动（向政治犯寄送明信片）\n6.告别专制倒计时行动 （预设中国专制政权还能维持十年，然后不断倒计时）\n7.自由民主文化衫行动（将宣传自由民主的口号印在衣服上）\n8.583行动（要求工人5天8小时月薪3000元待遇）\n9.普惠制基本养老金（老人最基本养老金550元人民币）\n10.废除户籍隔离\n11.平等待遇(军转、民师、下岗、同工同酬)\n12.MZ行动(网名以MZ标注代表民主)\n13.反暴政（强拆、强征、强计、火化、城管）\n14.反奴工蓝丝带行动\n15.接力签名救援行动（黄丝带行动）\n16.清除洗脑教育\n17.废除退休双轨制\n18.模拟公投、五区公投（香港）\n19.反岐视（乙肝、残疾、妇女权益等）\n20.反盘剥（出租车、公营事业、乱收费）\n21.反垄断（开放投资）\n22.土房运动\n23.非暴力普选八条等\n\n2017年1月30日星期一\n发帖者 维权网 时间： 上午12:52\n\n![photo_2017-01-29_23-51-15.jpg (0x0)](data/img/post_61_photo_2017-01-29_23-51-15.jpg)\n\n![photo_2017-01-29_23-51-30.jpg (0x0)](data/img/post_61_photo_2017-01-29_23-51-30.jpg)\n\n![photo_2017-01-29_23-54-45.jpg (0x0)](data/img/post_61_photo_2017-01-29_23-54-45.jpg)"
		},
		{
			"post_id": 60,
			"title": " 709谢阳律师起诉书（文字版）",
			"date_published": 1485865977.084,
			"body": "湖南省长沙市人民检察院\n\n起 诉 书\n\n长检刑二刑诉[2016]85号\n\n被告人谢阳，男，1972年2月4日出生，身份码：430304197202042051，汉族，硕士研究生文化，湖南纲维律师事务所执业律师，户籍所在地：湖南省长沙市芙蓉区远大二路1071号宿舍，现住址：长沙市岳麓区阳光100国际新城3-23栋14 01房。2015年7月12日因涉嫌颠覆国家政权罪、扰乱法庭秩序罪被长沙市公安局指定居所监视居住；2016年1月8日因涉嫌煽动颠覆国家政权罪经本院批准逮捕，次日由长沙市公安局执行逮捕。\n\n---\n\n本案由长沙市公安局侦查终结，于2016年8月8日以被告人谢阳涉嫌煽动颠覆国家政权罪、扰乱法庭秩序罪向本院移送审查起诉。本院受理后，已于2016年8月10日告知被告入有权委托辩护人，依法讯问了被告人，听取了辩护人的意见，审查了全部案件材料。期间，因部分事实不清、证据不足，本院分别于2016年8月17日、2016年10月17日退回公安机关补充侦查；2016年9月17日、2016年11月17日公安机关补充侦查完毕后，重新移送审查起诉。\n\n```\n经依法审查查明：\n一、煽动颠覆国家政权罪\n被告人谢阳长期受反华势力渗透影响，逐渐形成了推翻国家现行政治制度的思想。2012年以来，谢阳先后多次公开发布言论攻击、诋毁政府部门、司法机关及国家法律制度，公然煽动他人颠覆我国国家政权，并多次赴境外参加境外组织的培训，通过“微信”、“电报”( telegram)等网络联系方式与翟岩民（因犯颠覆国家政权罪被判刑）等境内外意图颠覆我国国家政权的人员串联，以“维权”为幌子，长期插手、炒作近年来国内发生的热点案件、事件，通过肆意歪曲事实、煽动他人在公共场所非法聚集滋事、利用舆论挑起不明真相的一些入仇视政府等方式，攻击和诽谤我国现行政治制度，煽动他人颠覆我国国家政权、推翻社会主义制度，严重危害国家安全和社会稳定。具体事实如下：\n1、2012年以来，被告人谢阳先后在新浪网注册“谢阳律师911”和“律师谢阳911”微博号，通过上述两个微博发布大量攻击我国政府和现行体制的言论，鼓吹“颠覆政权是基本人权”，煽动他人颠覆我国国家政权。经查，上述两个微博自创建以来至案发，累计发布博文1万余条，微博粉丝上万人，所有博文均系转载对政府、司法机关、我国法律和政治制度的负面新闻或对正面新闻报道进行负面评论，其中180余条直接攻击我国政府、煽动颠覆政权等言论的博文具有30余万的阅读点击量，部分博文被大量评论和转载。\n2、2015年4月，被告人谢阳代理谢丰夏（化名“谢文飞”）涉嫌煽动颠覆国家政权罪一案。该案在审查起诉阶段，谢阳以辩护律师的身份至广州市看守所会见谢丰夏，其后起\n```\n\n草、炮制了《谢阳律师会见谢文飞》一文，并将其发表在互联网上，公然鼓吹“煽动颠覆国家政权无罪，号召大家一起努力结束独裁统治”。该文先后被部分个人微博和境外反华网站转载，造成恶劣的政治影响。\n3、2015年5月，黑龙江省庆安县火车站候车室一袭警人员被执勤民警当场击毙。事件发生后，被告人谢阳伙同律师谢燕益（涉嫌煽动颠覆国家政权罪，另案处理）、刘书庆等人赶赴黑龙江省哈尔滨市、庆安县等地，采取网下聚集滋事、网上鼓动对立等方式恶意炒作此事，诽谤执勤民警故意杀人，先后在黑龙江省公安厅、黑龙江铁路管理局、庆安县火车站广场、庆安县政府门前等地非法聚集举字幅、拉横幅，声称“枪杀公民天怒人怨”、“问责庆安警方，履行宪法权利”。后又通过互联网发布上述举牌行为的照片和歪曲事实真相的言论、声明，煽动不明真相的人员与国家政权机关对立。\n4、2015年5月18日，被告人谢阳在广西壮族自治区南宁市代理一起经济纠纷案件时，案件当事人双方组织多人在代理公司持械发生暴力冲突，谢阳被对方当事人组织的人员持棍棒殴打小腿致轻伤，南宁市公安局及时出警处置。其后，谢阳通过微博就其被打事件发表言论恶意诽谤南宁市公安局。声称“南宁警方组织黑社会插手经济纠纷”、“南宁警方是凶手”，并影射其因代理庆安事件而遭到迫害，通过抹黑政府形象煽动不明真相的人员仇视政府。上述博文发布后，引发了多家媒体、网络论坛转载、评论，造成恶劣影响。\n认定上述犯罪事实的证据如下：\n1、手机、电脑等物证照片；2、出入境记录、北京微梦创科网络技术有限公司提供的已删除微博打印件、到案情况说明、户籍资料等书证；3、证人王勋、谢丰夏等人的证言；4、被告人谢阳的供述与辩解；5、电子数据。\n二、扰乱法庭秩序罪\n2014年至2015年3月间，湖南省长沙市雨花区莲湖村双塘组部分村民因土地征收拆迁事宜向长沙市雨花区人民法院提起行政诉讼。被告人谢阳接受十七户村民的委托代理该案，并向村民表达无胜诉可能，将采取拖延庭审时间，达到迫使雨花区政府满足村民补偿条件的想法。为实现上述目的，被告人谢阳纠集不具有律师资格的王全平、范标文等人代理该案，且在庭前要求村民在庭审中充分相信和支持其在庭审上的一切行为，并尽可能将亲友全部召集参加旁听庭审，其后又通过网络和电话纠集无关人员参加旁听庭审给予“围观声援”。2015年3月9日上午，长沙市雨花区法院开庭审理时，认定王全平、范标文不具备公民代理资格，要求王、范离开审判区域时，被告人谢阳采取拍打桌子、辱骂法官等方式煽动当事人及旁听人员对抗法庭决定，聚众哄闹、冲击法庭。值庭法警依法维持法庭秩序时遭到谢阳等人的阻扰，造成庭审秩序严重混乱，庭审被迫中止二个小时。\n认定上述犯罪事实的证据如下：\n1、手机等物证照片；2、出庭通知书、旁听人员名册、庭审笔录等书证；3、证人向斌、张莉斌、周杰等人的证言；4、被告人谢阳的供述与辩解；5、庭审现场录像视听资料；6、电子数据。\n本院认为，被告人谢阳煽动他人颠覆国家政权、推翻社会主义制度，罪行重大；又聚众哄闹、冲击法庭，严重扰乱法庭秩序，其行为触犯了《中华人民共和国刑法》第一百零五条第二款、第三百零九条，犯罪事实清楚，证据确实、充分，应当以煽动颠覆国家政权罪、扰乱法庭秩序罪追究其刑事责任。被告人谢阳犯数罪，根据《中华人民共和国刑法》第六十九条的规定，应数罪并罚。依据《中华人民共和国刑事诉讼法》第一百七十二条之规定，提起公诉，请依法判处。\n此致\n湖南省长沙市中级人民法院\n\n长沙市人民检察院 检察员：方惠\n代理检察员：李志明\n2016年12月16日\n\n附： 1、被告人谢阳现羁押于长沙市第二看守所；\n2、案卷材料14册、光盘24张；\n3、证人名单1份。"
		},
		{
			"post_id": 59,
			"title": "我认为是时候对709案发起反击了",
			"date_published": 1485865896.879,
			"body": "我认为是时候对709案发起反击了。海内外联手发起反攻。海外向联合国各机构提供材料，请求联合国介入调查。国内发起起诉709案责任人。"
		},
		{
			"post_id": 58,
			"title": "709事件被捕者的64名律师，家属联署控告公安部。",
			"date_published": 1485865748.49,
			"body": "![3.jpg (0x0)](data/img/post_58_3.jpg)"
		},
		{
			"post_id": 57,
			"title": "为 709 专案全体被捕人士辩护",
			"date_published": 1485865594.312,
			"body": "辩护书\n\n709 专案全体审判人员,审判长先生:\n\n中共在 1949 年建立了新的国家政权,建立了社会主义制度。这个社会主义制度从一开始就在国家政权的最高层产生犯罪分子:1953 年,国家副主席,中央人民政府国家计划委员会主席高岗是犯罪分子;中共中央组织部部长饶漱石是犯罪分子。\n\n接下来又层出不穷的在国家政权的最高层产生犯罪分子:国务院副总理兼國防部部長、中共中央军事委员会副主席彭德怀是犯罪分子;中共中央政治局常委、中共中央副主席、中华人民共和国主席刘少奇是犯罪分子;中国共产党中央委员会副主席、国防部部长、中共中央军委第一副主席林彪是犯罪分子;中国共产党主席的夫人,中央文革领导小组组长,中央政治局委员江青是犯罪分子;中共中央副主席王洪文是犯罪分子;中共中央政治局常委、中华人民共和国国务院副总理、中共中央军事委员会常委兼中国人民解放军总政治部主任张春桥是犯罪分子;中共中央政治局委员姚文元是犯罪分子;全国政协副主席苏荣是犯罪分子;中国共产党中央政治局常委,中央政法委書記周永康是犯罪分子;中国共产党中央政治局委员、中央军事委员会副主席,上将徐才厚是犯罪分子;中国共产党中央政治局委员、中央军事委员会副主席郭伯雄是犯罪分子;中共中央宣传部副部长,中国科协党组书记,中国共产党中央纪律检查委员会委员申维辰是犯罪分子。最高人民法院院长肖扬是犯罪分子;最高人民法院副院长奚晓明是犯罪分子;最高法院副院长黄松有是犯罪分子;中办主任,中共统战部部长令计划是犯罪分子;铁道部部长刘志军是犯罪分子;中国国家统计局党组书记、局长王保安是犯罪分子。\n\n除了这个社会主义制度的国家政权最高层不断的出现犯罪分子之外,这个社会主义制度的国家政权各阶层也不断的出现犯罪分子。\n\n全国各地很多省委书记是犯罪分子;市委书记是犯罪分子;省长是犯罪分子;市长是犯罪分子;法院院长是犯罪分子;检察院长是犯罪分子;政法委书记是犯罪分子;人大主任是犯罪分子;政协主席是犯罪分子;人大代表是犯罪分子;政协委员是犯罪分子;法官是是犯罪分子;检察官是犯罪分子;公安局长是犯罪分子;很多部门局长是犯罪分子;处长是犯罪分子;科长是犯罪分子;街道主任是犯罪分子;村支书是犯罪分子;村长是犯罪分子。\n\n这个社会主义制度的国家政权中,到处都充塞着犯罪分子,我无法一一列举具体的犯罪分子。\n\n这个社会主义制度从一开始就大量的屠杀农村劳动民众,以“地主”的罪名,杀了 200 多万无辜农村劳动民众。即便在这个社会主义制度的法律中,地主也从来就不是一个罪名。这个社会主义制度从一开始就以 “反革命”的名义大量的屠杀无辜民众,共计以“反革命”的名义杀了 200 多万无辜民众。\n\n这个社会主义制度从一开始就迫害工商人士,迫害致死的工商人士无以计数。\n这个社会主义制度从一开始就迫害知识分子,迫害致死的知识分子无以计数。\n这个社会主义制度在和平环境下,无辜饿死几千万的农村人口。\n这个社会主义制度煽动全国民众互相斗争,完全颠覆中国人民的正常理智,“文攻武卫”地互相斗了 10 年,斗死民众无以计数。\n这个社会主义制度造成中国普遍的贫穷,直到今天依然有 2亿多人口生活在联合国贫困线之下。\n这个社会主义制度造成中国普遍的环境破坏。\n这个社会主义制度造成中国普遍的腐败。\n这个社会主义制度造成中国普遍的冤案。\n这个社会主义制度直到今天还在还在制造冤案,制造数以千万的上访民众。\n这个社会主义制度充满了邪恶,谎言,腐败,专制,道德败坏。\n这个社会主义制度是一个反人类的制度!\n这个社会主义制度是现代奴隶制!\n\n然而,我们 709 专案的全体人员没有能力去推翻这样一个邪恶的,反人类的社会主义制度,也没有能力去颠覆这个由大量犯罪分子组成的国家政权。我们只能尽自己微薄的力量去帮助那些在这个社会主义制度中遭到迫害的人们,遭受冤屈的人们,在法律途径许可的范围内,些微的争取一点权益。虽然这对他们依旧是不公正的。\n\n值得庆幸的是,我们的工作得到了全国广大的正义人士的支持与援助。也得到了世界很多人权组织,公益组织,人权活动人士的支持与资金援助。由于国家政权的腐败,由于社会主义制度的邪恶本质,大量的冤案,大量的侵犯公民财产案,大量的侵犯公民人身权利案的诉讼成本都被推的非常高。没有世界很多人权组织,公益组织,人权活动人士的支持与资金援助,这些案件根本就不可能进入司法途径。\n\n709 专案全体审判人员,审判长先生:\n\n锋锐律师事务所受理的所有案件的当事人确实都想推翻社会主义制度,确实都想颠覆这个国家政权。不管他们是如何表达的,含义却是明确的。基于众所周知的原因,现实的历史,他们的个人经历,及他们的案例,我们能够理解他们的这些想法。同时,我们也告知了他们,颠覆这个国家政权,推翻社会主义制度,我们锋锐律师事务所没有这个能力。颠覆这个国家政权,推翻这个社会主义制度要靠西方民主阵营,最主要是要靠美国的干预。里根总统说过:独裁者只听得懂大炮的语言。\n\n锋锐律师事务所只能帮当事人依法维权。由于社会主义制度是一种不依法律运行的社会制度。1978 年之前只有一部《婚姻法》,这个制度照样运行了 30 年。1978年之后开始制定法律,但是没有一部法律是真正得到实施的,这个制度也照样运行了 30 多年。可见社会主义制度是一种完全不依法律运行的社会制度。\n\n既然社会主义制度是一种完全不依法律运行的社会制度,而锋锐律师事务所却是一个依照法律为当事人争取权益的服务机构,它要求司法机构,执法机构尊重法律。它的服务自然会推翻社会主义制度不依法律运行的本质,自然会推翻社会主义制度,自然会颠覆建立在这个社会制度上的国家政权。这是一个合理的结果,这是一个合乎逻辑的结果。这个问题并不在锋锐律师事务所,而是在社会主义制度本身。\n\n国家政权要避免被依法维权颠覆,要避免被依法开展工作颠覆,应该去解决法律如何在一个不依法律运行的社会制度中运行,而不是把依照法律开展工作的律师抓起来。\n\n709 专案的公诉人,全体审判人员,审判长先生:\n\n你们指控我们“颠覆国家政权”,“推翻社会主义制度”,这个我们无法否认。作为一个正常的人,主观上确实都想颠覆这个腐败,残忍的国家政权。作为一个正常的人,主观上也确实都想推翻这个用谎言与杀戮建立起来的社会主义制度。客观上,锋锐律师事务所是一个依法开展工作的机构,它的所有工作也都会推翻这个完全不依法律运行的社会主义制度,进而颠覆建立在这个制度上的国家政权的。\n\n但是,我们没有罪,我们也不需要认罪。\n\n709 专案全体审判人员,审判长先生:\n\n中国共产党的总书记,中国这个社会主义制度国家的主席认为法律是一个刀把子,是用来砍人的,不是用来维护社会公正与正义的。中共的人民日报公开宣告:借“法治”削弱党的领导是痴心妄想。中国这个社会主义制度国家的外交部发言人认为“法律不是挡箭牌”。全中国的法院也公开明确过要“做党的刀把子。可见由于中国这个社会主义制度国家从来不实施法治,这个国家的政权根本就不知道法律是什么。\n\n由于社会主义制度从来不实施法治,所以根本就不存在法律意义上的法庭,也不存在法律意义上的法官。同样也不存在法律意义上的检察官,警察。因为真正的法律意义上的法官,检察官,警察不能凭空产生,只能在一个法治环境下形成。\n\n由于社会主义制度从来不实施法治,所以根本就不存在合资格的法官。大量的法官不但不具备法律常识,甚至连基本的常识都不具备,认为网络上的文章被大量点击会造成公共秩序的严重混乱。不知道网络上的信息流动只是电子流,并非人流,电子流又如何能造成公共秩序的严重混乱?\n\n因为没有法律意义上的检察官,警察,也就是没有合格的检察官,警察,所以在这案件的一开始,你们在程序上就已经违法了。你们在侦察取证阶段也违法了。你们以非法的手段所取得的证据都是无效的,这些非法证据是不能呈堂作证的。也就是说,你们根本就没有证据。\n\n709 专案全体审判人员,审判长先生:\n\n没有合法的证据你们如何开庭审理案件?\n\n709 专案全体审判人员,审判长先生:\n\n你们连独立的人格都没有,只是别人手上没有灵魂的刀把子,那你们又能如何依据法律与证据来开展审判工作呢?“颠覆国家政权罪”只是一个抽象的罪名,公诉人员又如何能提出具体的证据呢?这是一个简单的逻辑命题。\n\n709 专案全体审判人员,审判长先生:\n\n中国各地有上千万的访民,这些访民大多数都是与政府部门的纠纷无法进入司法途径解决而上访。无法进入司法途径解决纠纷到底是因为法官的职业素质太低而无法立案?还是因为访民的法律知识太少而不知如何正常立案?\n\n如果是因为法官的职业素质太低而无法立案,那么你们今天有什么资格在这里审判?如果是因为访民的法律知识太少而不知如何正常立案,那么我们开办“法律援助站”,培训无牌法律工作人员,培训访民,提高他们的基础法律知识有什么错?有什么罪?\n\n中国有上千万的访民,我们计划在全国开办 10 余个这样的“法律援助站”培训访民。以一个“法律援助站”一年能培训 1000 访民计算,全国一年能培训 1 万余访民。大概用 1000 年时间,我们就可以把这些缺乏法律知识而不知如何正常立案的访民培训成具有基本法律知识,能完成正常立案手续的诉讼当事人。把与政府部门的纠纷从上访转变到通过司法途径解决了。\n\n中国有上千万的访民,如果仅以共计有 100 万宗有效诉讼案计算,我们“中国维权紧急援助组”计划对政府部门每年展开96 宗诉讼案,那么大概用 1 万年的时间,我们就能协助各地政府部门与访民双方完成诉讼,解决纠纷了,也就不会再有每天都有成千上万的民众上访的壮观景象了。相比于社会主义制度 60 多年都还没有确立起基本的法治环境,用 1 万年时间完成 100 万宗诉讼,也算不错的成绩。\n\n大量的诉讼案件由于无法正常立案,诉讼的成本被推的非常高。还是以共计有 100 万宗有效诉讼案计算,如果平均每个诉讼案件的诉讼成本被推高 1000 元,那么 100 万宗诉讼案增加的诉讼成本就是 10 亿。而实际上,大量的诉讼案件 5 年 10 年都无法立案。平均每个诉讼案件的诉讼成本被推高远不止 1000 元,应该高达万元以上。以共计有 100 万宗有效诉讼案计算,被推高的诉讼成本应该在 100 亿以上。这 100 亿仅仅是因为无法正常立案被推高的诉讼成本,并不包括诉讼标的及其它的赔偿金之类。\n\n我们现在已经获得了海外 7 个人权组织及 NGO 的资金支持,虽然这些人权组织及 NGO 已经做出了慷慨的资金支持,可是离 10 亿这个数相差实在太远了。当然我们还会积极争取获得更多的资金支持,没有这些人权组织及 NGO 的资金支持,根本就无法协助各地政府部门与访民双方完成诉讼。\n\n709 专案全体审判人员,审判长先生:\n\n“中国维权紧急援助组”是一个依据联合国《世界人权宣言》开展工作的组织,是一个依据国务院《国家人权行动计划》开展工作的组织。“中国维权紧急援助组”依据国务院《国家人权行动计划》下列条例开展工作:\n\n《国家人权行动计划》\n四、人权教育\n——鼓励并推动企事业单位普及人权知识,形成尊重和保障人权的企业文化。\n五、国际人权条约义务的履行和国际人权交流与合作\n(二)国际人权领域的交流与合作\n中国致力于在平等和相互尊重的基础上,开展国际人权交流与合作,推动国际人权事业健康发展。\n六、实施和监督\n——在实施《行动计划》过程中,尊重和发挥人民群众的主动性、积极性和创造性。创新社会管理机制,发挥社会组织在人权保障中的建设性作用。\n——将《行动计划》作为人权教育和培训的重要内容,切实提高实施《行动计划》的自觉性。\n\n最后的声明:\n\n这个腐败的国家政权一定会被正义的民众颠覆!这个邪恶的,反人类的社会主义制度一定会被正义的民众推翻!这一天已经不远了!\n\n辩护人:kai shen"
		},
		{
			"post_id": 53,
			"title": "李和平被解除律师",
			"date_published": 1485864843.201,
			"body": "![2.jpg (0x0)](data/img/post_53_2.jpg)"
		},
		{
			"post_id": 52,
			"title": "电视批斗会",
			"date_published": 1485864765.529,
			"body": "![1.jpg (0x0)](data/img/post_52_1.jpg)"
		},
		{
			"post_id": 51,
			"title": "维权律师张凯：恐惧之下不再言不由衷",
			"date_published": 1485864655.71,
			"body": "[日期：2016-08-31] 来源：VOA\n\n中国维权律师张凯星期二（8月30日）在微博上发声，称早些时候接受中国媒体采访谈及“709案”时所说的话是“恐惧下的被迫表达”，并非出自真实意愿。张凯发布这些言论后不久，他的微博账号即被查封。\n\n---\n\n从8月2日起，天津市检察院开始陆续审理去年“709事件中”被抓捕的周世锋等几名涉嫌颠覆国家政权罪的维权人士。出人意料的是，处于取保候审的维权律师张凯一连三天出现在旁听席上。\n\n8月4日晚，他在接受总部设在香港的凤凰卫视采访时说，“庭审做到了司法公开，在法律程序上也是公正合法的。”谈及对几名被告的看法时，张凯说：“我个人认为他们可能也走得太远，做的一些事情非常不当。”\n\n张凯的行为被一些人看作是公然为当局的“作秀审判”背书，但是也有人认为整个事情疑点重重。\n\n“一个被取保候审的犯罪嫌疑人，竟可以‘自行前往’外地去旁听案件，并靠‘自行申请’得到旁听证，且连续三天旁听三场庭审，”维权律师刘晓原说：“打死我也不相信。”\n\n8月30日，张凯在微博上发表“告知书”说，此前在凤凰卫视上关于周世锋案件所言并非出本人真实意愿，而是“恐惧之下的被迫表达”。他表示撤销所有评论，并请求709事件家属原谅。\n\n在“709案”中被抓捕的维权律师李和平的妻子王峭岭说，她一直都相信，那次采访绝不是张凯在自由状态下的自由表达。\n\n王峭岭对美国之音说： “张凯律师是我先生的朋友、同行，也是他在这个行业里比较欣赏的一个年轻有为的律师。2015年7月10日我先生被带走。 张凯律师在我先生出事后，第一时间打电话表示对我先生和我们全家的支持，后来他又打过两次电话。”\n\n也正是那些谈话中张凯告诉王峭岭，她的丈夫李和平在他那里放了一份委托书。后来在一次整理家务时，王峭岭又在家中发现了王全璋律师的委托书。\n\n“我才知道原来他们都互相写了委托书，其实他们做这个工作可能都是有所准备的，” 王峭岭说。\n\n张凯曾向王峭岭讲述，2015年8月的一天，他是如何在在浙江温州的一个小渔村里，半夜里被警察按在床上。此前张凯曾为浙江省的基督教会提供法律援助。这些教会一直在反抗政府自2013年底开始的拆除十字架的决定。\n\n”我们听了都觉得非常震惊，才知道原来官方的操作模式是这样的，” 王峭岭回忆说。\n\n那一次，警方以涉嫌“聚众扰乱社会秩序罪”、“为境外窃取、收买、非法提供国家秘密、情报罪”对张凯施以6个月的监视居住。\n\n2016年2月，张凯成为又一位在中国官方电视台上公开认罪的维权人士，之后他被改为为刑事拘留，直到3月底获释。\n\n张凯在“告知书”中写道，“经历过半年之久暗无天日的羁押，家中年迈父母跟着担惊受怕，我始终无力克服因此带来的恐惧与心灵的伤害，更无力抗衡来自强权的压力。”\n\n他表示，“愿意为自己曾经因心灵的软弱和恐惧而做出的行为，向上帝忏悔。 ”\n\n王峭岭说，曾经有人说，张凯不该认罪，不该投降，但是她认为，没有经历过这种地狱般经历的人没有资格指手画脚。她说，中国敢发声的人本来就不多，大多数人都在监狱里。张凯在已经获得某种程度的自由下继续发声尤为可贵。\n\n王峭岭对美国之音说：“其实他只要跟官方配合，就能有不再危险，不再提心吊胆的日子了。他在这种状况下愿意公开发言，而且向大家道歉。我对他心里充满了敬重。 ”\n\n总部设在香港的非营利机构“中国维权律师关注组”总干事陈洁文也对张凯的行为表示敬佩。她说，在中国这种大环境下能做到这一点不容易。从张凯的微博账号被查封这一点可以看出，尽管张凯已经获释几个月了，但他目前仍不自由。\n\n陈洁文对美国之音说：“不能因为是取保候审，就认定是真正的自由。在中国目前的情况下，任何一个地方都有可能变成一个看守所。”\n\n“中国维权律师关注组”同时对王宇、包龙军、任全牛、赵威等其他一批处于类似状态的律师和维权人士感到忧心。陈洁文说：“到目前为止，没有人能够真正地接触他们，确认他们是真正处于自由的。”\n\n她表示，“中国维权律师关注组发言人”将继续关注他们的安危。\n\n美国之音反复尝试，终于在北京时间星期二晚间接通了张凯律师的电话。张凯说，自己目前正在取保候审期间，不便接受采访。"
		},
		{
			"post_id": 50,
			"title": "张凯解聘律师之谜",
			"date_published": 1485864529.699,
			"body": "![tumblr_inline_ohpwnpxNWO1upo0oy_500.jpg (0x0)](data/img/post_50_tumblr_inline_ohpwnpxNWO1upo0oy_500.jpg)"
		},
		{
			"post_id": 49,
			"title": "张凯告知书",
			"date_published": 1485864374.637,
			"body": "![tumblr_inline_ohpsajucS31upo0oy_500.jpg (0x0)](data/img/post_49_tumblr_inline_ohpsajucS31upo0oy_500.jpg)"
		},
		{
			"post_id": 48,
			"title": "李蔚：刘家财在监狱服刑处境堪忧 呼吁关注",
			"date_published": 1485864191.59,
			"body": "2016年8月12日接到正在服刑的湖北维权人士刘家财妻子王玉兰的电话，说：刘家财在监狱处境很不好，经常挨罚，压力很大，目前在服用精神类药物。会见时有警察站在旁边，有些话刘家财不便说。她让我与刘家财一名已经出狱的狱友联系了解详情。\n\n经多次联系后，终于与该湖北籍人士联系上了，听他讲了刘家财所在的湖北省汉津监狱和刘家财的处境等初步情况。改天再联系该刘家财的狱友进一步了解，电话就无法打通了。\n\n---\n\n刘家财因煽动颠覆国家政权罪于2015年5月8日被湖北省宜昌市中级人民法院判处有期徒刑5年，刑期至2018年8月11日。\n\n以下是通过刘家财已经出狱的一名狱友了解到的情况：\n\n一、监狱服刑人员作息时间\n\n上午\n5：45AM起床\n7：00AM早饭\n8：30AM－9：00AM出工\n中午\n12：00PM吃午饭，午饭时间20分钟\n12：20PM出工\n晚上\n8：30PM－9：00PM收工\n10：00PM 就寝\n一天劳动时间几乎有12个小时。\n\n二、服刑人员经常受到体罚和克扣口粮\n\n汉津监狱服刑人员的主要劳动任务是缝制服装。制作服装是流水线作业，每名服刑人员负责不同的工序。\n\n从入监队开始就需要出工劳动。\n\n每名服刑人员每天都有劳动定额，完不成劳动任务的服刑人员会受到惩罚。惩罚手段之一:晚上10点其它服刑人员就寝后需要站几个小时才能睡觉。惩罚手段之\n\n三、早餐和晚餐只发一小饭勺稀饭吃。\n\n以下是我与刘家财的狱友的问答。问话者是笔者，回答者是刘家财一名已经出狱的湖北籍狱友。\n\n问：\"你们劳动时间那么长的原因是什么？季节性的还是长期如此？\"\n答：\"长期如此。监狱为了创收啊。\"\n问：\"司法部不是规定收支两条线吗？\"\n答：\"上有政策，下有对策。天高皇帝远。沙洋农场在当地（黑暗）是出名的。过去有'（狱警）自行车比汽车跑得快……‘的歌谣。\"\n\n四、监狱其它方面对服刑人员的严苛管理\n\n1、新犯入监先进入监队2个月。规定时间背不会『服刑人员行为规范』的服刑人员，此后每天需要晚上加班学习到第二天凌晨1：00AM－2：00AM才能睡觉。\n\n2、背完『服刑人员行为规范』后，还需要背『弟子规』，如果在规定的时间内背不会，还需要天天晚上罚站。\n\n3、劳动时，如需要上厕所，需要向管教干部（狱警）报告，经同意才能去。去上厕所需要一路小跑，回来后要向干部报告， “谢谢干部教育。”\n\n该狱友说：入监时，他和刘家财在同一个入监队两个月，后来分到不同监区了。在监狱，虽然干部表面上对刘家财很客气，但背地里狠着呢。干部不允许其他犯人和刘家财说话，说他是反革命政治犯。谁和他说话谁就要受处罚。\n\n一些良心犯在服刑期间都会遇到与刘家财类似的处境，虽然监狱法明确禁止体罚或虐待服刑人员，但是向检察院控告往往得不到支持，起诉到法院，法院往往以服刑为刑事诉讼法授权的行为为由不予立案。\n\n请大家给刘家财邮寄信件，关心和鼓励他。也请社会各界关注服刑人员特别是良心犯在监狱的处境，呼吁保障他们权益！\n\n附:刘家财简介\n\n刘家财，男，1965年10月26日出生，原系葛洲坝集团职工。1998年至2000年期间，由于某种原因，葛洲坝下岗职工合法权利受到非法侵害及葛洲坝企业可能存在某种严重问题，刘家财为数千下岗职工讨要工资、为职工子女争取教育经费维权，嗣后在困难环境下为争取维权成功，依宪、依法组织独立工会接受一些媒体采访，因此被湖北省宜昌市司法当局于2001年以煽动颠覆国家政权罪判处管制两年，剥夺政治权利两年。\n\n刘家财出狱后，当地国保对其长期监控骚扰，甚至刘家财因此丢了工作，但刘家财多年来并未因长期遭受非法对待及承受的巨大压力而放弃公民权利，继续通过各种方式，依法、理性、平和、坚定为公民权利、自由、民主、法治、人权鼓与呼为良心犯声援，参与许多具体维权工作。\n\n2013年8月2日刘家财因在网路上转发山东维权律师李向阳的《复仇血洗公告并招募敢死队员》而被员警带走，第二天被宜昌市公安局伍家岗区分局以“虚构事实扰乱公共秩序”行政拘留10天，关押在宜昌市拘留所。\n\n2013年8月12日刘家财被以“涉嫌煽动颠覆国家政权罪”刑事拘留，同年9月18日被湖北省宜昌市伍家岗区检察院批准逮捕。2013年11月21日，宜昌市检察院以“涉嫌煽动颠覆国家政权罪”向宜昌市中级法院提交起诉。2014年7月23日宜昌市中级法院对刘家财“涉嫌煽动颠覆国家政权”进行开庭审理。2015年5月11日湖北省宜昌市中级人民法院以\"煽动颠覆国家政权罪\"判处刘家财有期徒刑5年。2015年12月2日湖北省高院裁定驳回刘家财的上诉，维持原判。\n\n刘家财目前服刑地点：\n\n湖北省汉津监狱\n通讯地址：湖北省荆门市平湖路沙洋汉津监狱第五监区，邮政编码：448200\n\n刘家财妻子王玉兰电话:15971646832\n\n李蔚\n2016年8月26日"
		},
		{
			"post_id": 43,
			"title": "709案是政治流氓习近平制造的虚假案件",
			"date_published": 1485657532.53,
			"body": "![__.JPG (0x0)](data/img/post_43___.JPG)"
		},
		{
			"post_id": 42,
			"title": "习近平的流氓嘴脸",
			"date_published": 1485657324.002,
			"body": "![__.JPG (0x0)](data/img/post_42___.JPG)"
		},
		{
			"post_id": 41,
			"title": "709谢阳律师遭残暴酷刑的刑事控告状",
			"date_published": 1485657235.481,
			"body": "刑事控告状\n\n控告人：谢阳，男，汉族，1972年 月 日出生，现被羁押于长沙市第二看守所\n\n代理人：刘正清，广东安仁律师事务所律师，联系电话：13543432448\n\n被控告人：李克伟，男，湖南省长沙市公安局国保支队支队长\n被控告人：李峰，男，湖南省公安厅国保总队警察\n被控告人：王铁铊，男，长沙市国保支队第六大队大队长\n被控告人：周浪，男，长沙市国保支队警察\n被控告人：屈可，男，长沙市国保支队警察\n被控告人：叶云，男，长沙市国保支队第六大队指导员\n被控告人：尹卓，男，长沙市国保支队警察\n被控告人：李阳，男，长沙市国保支队警察\n被控告人：周毅，男，长沙市国保支队警察\n被控告人：庄晓亮，男，长沙市国保支队警察\n\n控告事项：\n\n依法追究被控告人李克伟、王铁铊、李峰、周浪、屈可、尹卓、李阳、周毅、庄晓亮以剥夺睡眠、暴力殴打、坐吊吊椅等刑讯逼供方式强迫控告人自证其罪的刑事责任。\n\n---\n\n事实与理由：\n\n控告人于2015年7月11日凌晨在怀化市洪江市托口镇黔洲大酒店被控告人李克伟等非法抓捕，7月12日被指定监视居住于开福区德雅路732号国防科技大学第一干休所，时长达六个月整。期间，被控告人李克伟、王铁铊、李峰、周浪、屈可、尹卓、李阳、周毅、庄晓亮等以暴力殴打、剥夺睡眠、坐吊吊椅、烟熏眼睛、有病不医、不给水喝、威胁家人生命、阻绝律师会见等刑讯方式（具体情节见附件《律师会见谢阳笔录》），逼迫控告人自证其罪、诬陷同仁，其肉体和精神之折磨超出人能承受之极限，令人发指，以致控告人几度欲自杀以求解脱。\n\n为惩罚犯罪，维护法律和人道的尊严，控告人现提出控告，请检察机关依法履行查处公务人员职务犯罪的职责，对被控告人立案调查，追究这些披着警察外衣却身犯极其严重罪行的犯罪分子的刑事责任，以使冤屈得申，以使罪恶受惩，以使正义昭彰。\n\n此致\n长沙市人民检察院\n\n控告人：谢阳\n代理人：刘正清\n2017年1月20日\n\n附件：律师会见谢阳笔录\n\n发帖者 维权网 时间： 上午11:48"
		},
		{
			"post_id": 40,
			"title": "请李春富律师的律师立即提起刑事自诉",
			"date_published": 1485657163.561,
			"body": "请李春富律师的律师立即提起刑事自诉\n\n并附带不低于1亿赔偿金的民事赔偿。\n\n请大家积极参与，围观李春富律师案件，确保不低于1亿赔偿金兑现。\n\n参与，围观的人越多越好。人数越多越好，越多越能拿到赔偿金。"
		},
		{
			"post_id": 38,
			"title": "联合国禁止酷刑委员会",
			"date_published": 1485656994.929,
			"body": "![6.jpg (0x0)](data/img/post_38_6.jpg)"
		},
		{
			"post_id": 37,
			"title": "联合国强迫失踪问题委员会",
			"date_published": 1485656888.532,
			"body": "![5.jpg (0x0)](data/img/post_37_5.jpg)"
		},
		{
			"post_id": 36,
			"title": "人权条约规定的个人投诉程序",
			"date_published": 1485656691.001,
			"body": "![4.jpg (0x0)](data/img/post_36_4.jpg)"
		},
		{
			"post_id": 35,
			"title": "向条约机构投诉通讯方式",
			"date_published": 1485656547.505,
			"body": "![3.jpg (0x0)](data/img/post_35_3.jpg)"
		},
		{
			"post_id": 34,
			"title": "这些异常行为足以证明709案是政治流氓习近平制造的虚假案件",
			"date_published": 1485656381.208,
			"body": "1，赵威被关押了1年，已经被取保候审从看守所出来1个多月，可是她却不与家人联系，也不与朋友同事联系，反而不可思议的隐蔽在一个不为人知的地方，洋洋洒洒的写了一篇《致朋友们的一封信》，更不可思议的是还玩起了自拍。要知道她的案件并没有了结，目前只是取保候审，她这种表现非常异常，不像一个精神状态正常的人的行为。\n\n2，王宇被关押了1年，已经被取保候审从看守所出来1个多月，她明知道她儿子曾经被人绑架，差点被偷渡到国外去，可是她却不急着见她儿子，也不与家人联系，不与朋友同事联系，反而不可思议的隐蔽在一个大花园，反反复复地召开记者招待会，甚至还委托天津一个律师事务所发声明，反对美国某个人权机构给她颁奖。要知道她的案件并没有了结，目前只是取保候审，如此行为，太过异常。\n\n3，任全牛律师取保当天晚上回到家，呆了半个小时收拾衣物，便与警察一同去旅游了。而且旅游的地点和持续的时间均未告知任何人。走时只给其妻留下两个号码，称可联系报平安。要知道他的案件并没有了结，目前只是取保候审，有正常的人会拿了取保候审的单子与警察一起出去旅游吗？如此行为，太过异常。\n\n4，2016年8月2日，天津市第二中级人民法院对翟岩民涉嫌颠覆国家政权案一审公开开庭审理。翟岩民是一个法律工作者，他是知道控方对他的指控是非常严重的，翟岩民却向法院出具了不同意其妻及其他亲朋好友旁听的书面声明。如此行为，太过异常。\n\n5，周世峰、胡石根、勾洪国都是专业维权法律工作者，他们的庭审都是公开的，开庭审理当天，人大代表、政协委员、法学学者、职业律师、各界群众代表及来自多家国内媒体和境外媒体的记者几十人，共40多人旁听了庭审。可是他们的家人却没有出席旁听，作为专业维权的法律工作者，他们明确知道这个庭审是严重侵犯了他们的权益，是不公正的，可是他们都在最后的陈述中认为“今天的审判让我感到法庭是公正的，整个审判过程保证了我的权利”。这种言论太过异常，与他们平时的言论差异太大。\n\n6，王全璋是个优秀的律师，从被逮捕至今1年多的时间，无法会见律师，无法会见家属，他当然会知道当局对他的指控是非常严重的。可是面对如此严重的控罪，他却非常离奇的通过检察官作出声明，“拒聘任何律师直到审判结束”。这种行为太过异常。"
		},
		{
			"post_id": 32,
			"title": "中共需要回答国民一个问题：中情局是否在主导颠覆中共政权？",
			"date_published": 1485655599.184,
			"body": "中共还要继续709案就必须先回答国民一个问题，美国是否在颠覆中共政权？中央情报局是否直接在主导这个颠覆行动？\n\n要么709案是一个虚假的颠覆国家政权案，要么就是美国中央情报局在主导颠覆中共政权的行动。两者必居其一。\n\n中共不能以捕风捉影来制造颠覆国家政权案\n\n中共要制造709颠覆案就必须坦诚承认中情局在主导颠覆中共政权的行动\n\n709颠覆案家属应该站出来在国内网络上谴责中央情报局颠覆中共政权的行为，把中央情报局正在主导颠覆中共政权这个事实广泛的告知国人。中共不能一边制造709颠覆案，一边又否认中央情报局正在主导颠覆中共政权这个事实。"
		},
		{
			"post_id": 31,
			"title": "709颠覆案是政治流氓习近平炮制的虚假案件",
			"date_published": 1485655507.023,
			"body": "周世峰，胡石根，勾洪国，翟岩民，王宇，赵威，任全牛等人的异常行为，我判断中共是在用虚假的资料制造虚假案件。这些虚假资料很可能还是英文的。周世峰，胡石根，勾洪国，翟岩民，王宇，赵威，任全牛等人应该是相信了这些虚假资料，所以才有如此异常的行为。其余的709关押人员还没有被这些虚假资料唬住，所以，这个709案本来是一个案件，应该一起审理的，变成了一个一个的审理。所以，被关押了1年多，还不准会见任何人。因为与外界一接触，整个把戏就会穿帮。\n\n大家应该读过香港书商林荣基的文章，里面提到中共使用虚假资料欺骗他。大家应该还记得709案中的那个瑞典人彼得。彼得回国后也说过，中共向他出示过一份文件，他当时非常奇怪，因为他在这个NGO内部从来没有看到过这样的文件。\n\n这个彼得后来去了泰国北部，继续他的NGO事业。以我对西方人的了解，如果彼得认为中共向他出示的文件是真实的，那么，除非这个彼得是特工人员，否则他应该会辞去这个NGO的工作的，因为这与他的个人理念不合，报酬也不相符。可是，如果这个彼得是特工人员，他已经暴露了，还去泰国北部干什么？缅北，泰北对中共是非常敏感的地方。\n\n其实，我是很希望中共使用的是真实的情报，这太令人兴奋了。这说明美国中央情报局CIA在直接主导推翻中共政权。彼得这个中情局的特工去泰国北部干什么还不清楚吗？93师反攻云南指日可待啊！\n\n锋锐事务所被端了，CIA下一步会怎么做？应该不会再搞同样的模式了。那么接下来的应该是策动蒙藏维满港大起义。应该是策动西藏，新疆政变。应该是组织93师反攻云南。那么这2年来，如此多的中共官员死的不明不白就容易解释了，是中情局小组在行动。"
		},
		{
			"post_id": 30,
			"title": "如何向联合国人权理事会申诉人权案",
			"date_published": 1485654742.271,
			"body": "![__.JPG (0x0)](data/img/post_30___.JPG)"
		},
		{
			"post_id": 29,
			"title": "如何向联合国人权理事会申诉人权案",
			"date_published": 1485654698.935,
			"body": "![2.jpg (0x0)](data/img/post_29_2.jpg)"
		},
		{
			"post_id": 28,
			"title": "如何向联合国人权理事会申诉人权案",
			"date_published": 1485654615.863,
			"body": "![1.jpg (0x0)](data/img/post_28_1.jpg)"
		},
		{
			"post_id": 16,
			"title": "中共绝对没有改良的可能",
			"date_published": 1485601655.785,
			"body": "张雪忠：如果我说中共绝对没有改良的可能，也许会显得过于武断；但个人从来都不对此抱有幻想。首先，中共是一个彻底否定自由，民主，法制等现代化原则的政党。它的组织形式，政治理念都与宪政体制格格不入。它在中国建立的政权结构并不具有逐步转变为宪政体制的可行性。前苏联以及东欧各国的政治转型，都是以共产极权体制的坍塌与崩溃为前提的。\n其次，现行政权在存续的六十多年里，制造了太多的灾难与罪恶！中共已完全丧失了引领中国政治转型的正当型和道义的基础。并且，中国当前的党政权利结构和既得利益格局，也不允许其领导人启动政改进程。\n\n另外，中共领导人多是一些完全缺乏现代化政治意识的人，不大可能领导中国实现政治现代化。他们甚至可以公开说出“红色江山永不变色”这种具有严重的政治意识还停留在“打江山，坐江山”上的水平。在他们看来，整个国家都是属于他们少数人的私产！这些公开把党派利益置于国家利益之上的人，怎么可能会主动改变现有的一党专政体制？！\n\n我知道，尽管过去曾经有过多次失望；每当新领导人上台，还是有不少人期盼甚至臆测他们会自动所谓的政改；我理解这些人的想法，因为人人都有一些沉溺于虚幻希望的倾向，但我个人认为，十三亿中国人眼巴巴地等着七个品行和才智都十分可疑的人来决定自己该享有多少权利和自由，这本身就是极其荒唐的。"
		},
		{
			"post_id": 15,
			"title": "东亚新地图",
			"date_published": 1485601482.072,
			"body": "![1.jpg (0x0)](data/img/post_15_1.jpg)"
		},
		{
			"post_id": 14,
			"title": "论西藏独立革命之可行",
			"date_published": 1485601398.04,
			"body": "西藏是最具独立的理由与条件的地区,比台湾还具有条件与理由.因为西藏自古以来就是一个独立国家,而且西藏的地势非常高,不适应内地人士生存也不适合中共的武器.中共的飞机,坦克,运输汽车都会因为西藏的高度而受到影响.\n\n西藏的独立革命必须依靠武力,不能依靠自焚.中共完全漠视生命,夺取政权以来,杀人不计其数,直到现在都这样,根本就不会在意自焚.\n\n西藏要发动武力革命,就需要达赖喇嘛,或者西藏流亡政府向西方国家筹募武器.至少得筹募30-50万支自动步枪,并筹募相应数量的迫击炮,火箭筒,反坦克导弹,单兵防空导弹.这些武器可以向西方国家的私人公司租借,以西藏,青海的采矿权做抵押.\n\n30-50万支自动步枪,及相应数量的迫击炮,火箭筒,反坦克导弹,单兵防空导弹仅几十亿美元,100亿都不到,以西藏,青海的采矿权做抵押是很宽松的,对独立以后的西藏不会有任何财政压力.\n\n西藏的独立革命除了需要获得西方国家的支持,还需获得印度,尼泊尔的支持.这需要很强的外交能力.最重要的是要让印度,尼泊尔明白西藏独立不可阻挡.一但西藏独立成功,印度,尼泊尔就与中共政权没有了边境连接,而是与图博国有边境连接.如果能争取到印度,尼泊尔的支持,西藏独立革命就顺利多了.\n\n西藏独立革命的资金可以以西藏流亡政府的名义发行\"独立革命债券\",以西藏,青海的采矿权做抵押,革命成功后1比10兑现.先期募集20亿美元.\"独立革命债券\"能否顺利发行,其实就已经决定了独立革命能否成功.全世界都看好西藏独立, 发行\"独立革命债券\"自然很容易,10倍的回报,会很难买到的这债券的.如果全世界都不看好,这债券自然发行不了.\n\n解决了武器,资金后就可以在印度,尼泊尔建立军事训练基地,并且偷运一部分武器进入西藏,以便里应外合,当独立革命军攻入西藏后,藏民可以起义配合.\n\n一旦占领拉萨,立即宣布独立建国,与西方国家建立外交关系;与美国,印度,尼泊尔建立共同防御体系,将拉萨的防御交予美国主导,并由印度协防."
		},
		{
			"post_id": 13,
			"title": "论新疆独立建国之可行",
			"date_published": 1485601278.144,
			"body": "新疆独立建国难度比西藏大，但是一样可行。新疆独立难度比西藏大主要有3个原因。\n\n1，西藏，青海的资源非常丰富， 西藏紧靠印度。随着印度的工业化，西藏，青海的资源对印度是有巨大的吸引力的。没有运输上的风险，运输成本也低。所以，在西藏独立的进程中，印度只有支持，暗中鼓励的可能，不太会有反对的可能。新疆虽然也是资源丰富的地区，可是新疆的邻国都不是资源缺乏的国家，甚至还是资源丰富的国家。\n\n2，西藏历史上就是一个独立的国家，这点国际上没有争议，特别是在西方国家，是人们普遍的认知。新疆虽然历史上也有独立的国家，可不是一个统一的国家，是分散的新疆各地的王国。\n\n3，西藏有流亡政府，而且长期运行，并且还有公开的民主选举制度。这使西藏流亡政府发行“独立建国债券”具有良好的基础。维吾尔人虽然也有“世界维吾尔人代表大会”，可是公信力无法与西藏流亡政府相比。\n\n但是，新疆独立建国也有自己的优势，就看维吾尔人如何努力。对新疆独立革命影响最大的应该是俄罗斯。如果俄罗斯能支持新疆独立，那新疆的独立革命应该比西藏还容易了。俄罗斯其实是希望中国分裂的，它一直不希望有一个强大的中国，这对它有很大的威胁。从斯大林坚决要把蒙古从中国分裂出去就可以印证，这与中国实行什么制度无关。但是俄罗斯又不希望中国民主化，所以俄罗斯对中国的独立革命是很矛盾的心理。如果俄罗斯干预新疆独立革命，那困难就很大了。但是，不管俄罗斯对新疆独立的态度如何，只要西藏独立了，南疆也就独立了，新疆沙漠以西也就独立了。\n\n新疆独立可以获得土耳其的全力支持，也可以获得中东穆斯林的支持，这点也是西藏独立运动无法比的。\n\n新疆的独立革命也与西藏独立革命的步骤一样，先募集武器，再募集资金。有了充足的武器，募集资金就容易多了，反之则不可行。因为募集武器的能力就反映了独立革命的组织能力与外交能力。\n\n武器也至少得筹募30-50万支自动步枪，并筹募相应数量的迫击炮，火箭筒，反坦克导弹，单兵防空导弹。这些武器可以向西方国家的私人公司租借，以新疆的油气资源与煤炭资源做抵押。 独立革命的资金同样以“世界维吾尔人代表大会”的名义发行“独立革命债券”，以新疆的油气资源与煤炭资源做抵押。革命成功后1比10兑现。先期募集20亿美元。\n\n武器募集成功以后是否应该把“世界维吾尔人代表大会”转变成“东土耳其斯坦流亡政府”，以方便募集资金，这是需要考虑的问题。\n\n新疆一旦独立成功，由美国主导防御可能会招致俄罗斯的反对，从而引起俄罗斯干预新疆独立革命。由土耳其主导防御，或者由土耳其，中亚五国与新疆建立共同防御体系?这方面似乎比较复杂，没有西藏独立革命来的简单。“世界维吾尔人代表大会”有很多工作要做。"
		},
		{
			"post_id": 12,
			"title": "论满洲独立建国之可行",
			"date_published": 1485601105.135,
			"body": "满洲入关是中原政权亡国这个历史西方人一般都不知道，这对募集革命资金及武器有很大的影响。所以满洲独立建国先需要做舆论宣传。不过日本人倒是知道这段历史。所以满洲独立建国争取日本的支持比较容易，独立革命的武器，资金主要应该向日本募集。\n\n至少得向日本筹募30万支自动步枪，并筹募相应数量的迫击炮，火箭筒，反坦克导弹，单兵防空导弹，通讯器材，再募集10亿美元的独立革命资金。这些武器与资金可以用东北20-30个农场做抵押，等独立建国之后把这些农场租借给日本，租期100年。当然也可以把长春租借给日本，租期100年。租界的管理可以参照香港的模式，也可以参照以前上海租界的模式，当然也可以参照以前日本在长春的管理模式。只要满洲人喜欢，什么模式都行。\n\n满洲独立建国比较困难的是满洲人不像藏人，维人那样普遍的追求独立。而且藏人的流亡政府，维吾尔人的“世界维吾尔人代表大会”，在国际上都有一定的影响。满洲复国运动并没有获得普遍的响应，满洲复国运动的代表性不够，在国内，国际都没有足够的影响。需要广泛的宣传主张。\n\n但是满洲复国运动也有有利的一面，满人与东北境内的大量齐鲁移民没有矛盾，如果能广泛的动员起满洲独立运动，内部的分歧比较少。\n\n大陆在日本有超过10万的留学生，这应该是满洲独立运动首先组织动员的对象。凡参与满洲独立运动的大陆籍人士，在满洲独立建国以后都可以自动取得满洲国国籍，甚至可以自动取得长春市籍。长春如果租借给日本，凡持有长春市籍的都可以自由的在日本工作，生活。与持有日本长期居留证享受同等待遇。这些都是需要满洲复国运动主要领导人积极展开的工作。\n\n除了组织动员在日大陆人士之外，还应该积极争取日本人士参与满洲复国运动，最好能争取几万从自卫队退役的日本人参与满洲独立运动。凡参与满洲复国运动的日本人，在满洲独立建国之后都可以自动获得满洲国籍。愿意农耕的可以获得土地，愿意在城市居住，工作的，国家奖励房产。\n\n满洲独立之后即加入美日韩共同防御体系。"
		},
		{
			"post_id": 11,
			"title": "论宁夏甘肃独立建国之可行",
			"date_published": 1485600960.814,
			"body": "一旦西藏，新疆爆发独立革命，宁夏甘肃穆斯林就有极好的机会独立建国了。陕甘宁穆斯林100多年前的独立建国梦想会在今天实现，着实让人感到命运之不可测。看来靠改地名也不能改变命运，什么改名改变命运，纯属无稽之谈。\n\n一旦西藏，新疆爆发独立革命，陕甘宁穆斯林就能从以沙特为首的中东穆斯林国家获得大量的武器与资金援助。陕甘宁这个共匪老巢，延安儿女的故乡，呵呵，我无法预知这些穆斯林与延安儿女会如何相处。不知道共匪倒台后习近平能不能去那里避难。\n\n好搞笑的是习近平现在正与中东穆斯林打的火热。\n\n西藏，新疆爆发独立革命，陕甘宁穆斯林独立建国没有悬念，所以也没有什么好说的啦。只是提醒一下陕甘宁的非穆斯林，万一西藏，新疆发生独立革命，你们要注意陕甘宁穆斯林的动向，注意自身的安全，他们的攻击目标非常混乱的。最好了解一下同治回乱。"
		},
		{
			"post_id": 10,
			"title": "论南蒙古脱离中共之可行",
			"date_published": 1485600832.278,
			"body": "南蒙古有一个同民族的蒙古国邻国是脱离中共统治最大的优势。南蒙古没有率先独立的实力，但是，一旦西藏，新疆爆发武装独立革命，南蒙古却有可能率先独立成功。因为大量的武器，人员，物质可以方便地从蒙古国进入南蒙古。\n\n南蒙古同样可以以采矿权与土地作为抵押，募集武器，发行“独立革命债券”以募集资金。南蒙古上市企业兰太实业的市值在50多亿，光抵押这一个上市企业就能获得足够的独立革命资金。兰太实业中小投资人持有的股权不多的，主要的股权都控制在中共，红二代，及贪官的手里。独立革命成功后，这些股权本来就要收归新政权的，所以独立革命实在是造福南蒙古人民的大好事。\n\n对于独立革命，资金不是问题，武器也不是问题。需要的是大张旗鼓地宣传独立革命，需要的是积极的行动。“南蒙古大呼拉尔”的影响实在太小，知道的人太少，需要持续地造声势，需要不断扩大参与的人数。需要在各主要社交网站上不断地发表言论，需要每个星期都上街去展示自己的存在。"
		},
		{
			"post_id": 9,
			"title": "论福建云南广西独立建国之可行",
			"date_published": 1485600652.958,
			"body": "有金门，玛祖这两个岛，福建的独立革命要比其它省份更容易获得武器。\n\n台湾的军情部门应该积极介入大陆的反抗运动，在福建，广东，浙江，江苏各地协助成立大量秘密的反共小团体，并提供资金支持。协助各维权群体开展维权活动，组织罢工，组织游行抗议活动。等待武装起义的机会。\n\n一旦西藏，新疆等地爆发武装起义，就能通过金门，玛祖把武器快速的分散到福建，广东，浙江，江苏等各地的秘密反共小团体 ，配合西部地区的独立革命。\n\n一旦西藏，新疆等地爆发武装起义，金门，玛祖就应该派出特战部队，协助福建，广东，浙江，江苏等地的反共小团体及起义民众攻打政府部门。\n\n一旦福建，广东，浙江，江苏等地的民众发动武装起义，台湾正规部队就应该率先登陆福建，占领福建全境，并宣告福建独立。\n\n**论云南独立建国之可行**\n\n云南武装起义独立建国的条件非常好，因为在缅北，泰北就存在着云南籍的国军及后人。而且还是成建制的，拥有武装。只需重新整编装备一下就是反共复国的独立革命军了。\n\n以缅北，泰北现有的人员，再招募一批大陆青年及流亡东南亚的大陆人士，重新整编10个师并不困难。可以向台湾招募一批重装备操作人员，这样就不用在缅北，泰北训练了。\n\n泰北93师可以与泰国政府协议，以土地换军援。云南独立后归还泰北的土地，以换取武器装备。\n\n独立革命的资金可以向台湾争取。另外由于西藏流亡政府要比云南独立革命容易募集资金，可以借给西藏流亡政府3个师，以换取独立革命资金。云南独立以后可以与缅甸组成自由联邦，所以可以向缅甸争取后勤支持。\n\n现在云南籍人士中还没有出现独立革命的领袖人物，这样的人物可能要在缅北，泰北产生。时代呼唤英雄人物的出现，在这3000年未见的大变局中，写下你人生中光辉的一页吧。\n\n**论广西独立建国之可行**\n\n西藏独立，新疆独立，云南独立之后，广西的独立将会水到渠成。广西连独立革命军都不需要，只要向云南支付一笔资金，云南独立革命军就趁势攻入广西，推翻广西共产党政权。\n\n广西独立革命的意义在于分割了中共政权与越南共产党政权的直接联系，越南共产党的垮台便指日可待了。因为现在迁入越南的台湾企业，日本企业，港资企业在云南，广西建立了民主政权之后便会快速地迁离越南这个共产党腐败体制，迁入云南，广西，缅甸这些新兴的民主国家。\n\n同样的情况也会发生在满洲独立建国以后。满洲的独立将切断中共政权与朝鲜政权的直接联系，金家王朝的垮台也一样指日可待。朝鲜的核问题也能因此而解决。所以，满洲独立是可以获得美日的大力援助的。"
		},
		{
			"post_id": 8,
			"title": "论台湾独立建国之可行",
			"date_published": 1485600495.757,
			"body": "台湾独立建国是比较容易的，只需：\n\n向西藏流亡政府提供，出售武器，购买西藏流亡政府发行的“独立建国债券”；\n向世界维吾尔人代表大会提供，出售武器，购买世界维吾尔人代表大会发行的“独立建国债券”；\n向满洲复国运动提供，出售武器，购买满洲复国运动发行的“独立建国债券”；\n向南蒙古大呼拉尔提供，出售武器，购买南蒙古大呼拉尔发行的“独立建国债券”；\n向泰北93师提供，出售武器，购买93师发行的“独立建国债券”；\n\n大陆各省份都独立建国了，台湾自然也就独立建国了。\n\n而且，这些“独立建国债券”都是1-2年内就有10倍的回报，台湾还能向各独立团体出售武器，军服，头盔，通讯设备，各种军用物质，甚至包括军用食品，为台湾创造大量的就业机会，台湾独立建国简直就是一个有利可图的事业。\n\n台湾政府应该主动的去接触，支持，扶植各独立团体。就看蔡英文总统的胆识了。"
		},
		{
			"post_id": 7,
			"title": "被吴越后人尊为开国先贤是无上的光荣",
			"date_published": 1485600152.638,
			"body": "![2.jpg (0x0)](data/img/post_7_2.jpg)"
		},
		{
			"post_id": 2,
			"title": "鼓吹吴越独立新阵地开张啦！",
			"date_published": 1484570750.193,
			"body": "在中共牢里的抗争勇士新年好！\n\n在小监狱外面抗争的勇士新年好！\n\n推动吴越独立建国的朋友新年好！\n\n2017年，我们一起干翻共产党！\n\n2017年，我们翻中共的天！\n\n鼓吹吴越独立新阵地--Zeronet网站开张啦！"
		}
	]
}