{
	"message": [
		{
			"body": "  Witam wszystkich.",
			"date_added": 1551026217540
		},
		{
			"body": "Wyświetla;Unlimit Talk - Zero Net.",
			"date_added": 1551044976510
		},
		{
			"body": "Całkowicie popieram; Ale jest jeden problem z werbunkiem. Ludzie wstydzą się przyznać że nie rozumieją jak to działa.A mówią że to ich nie interesuje, albo mają normalnie stracha. Takiego totalnego stracha. ",
			"date_added": 1551109096187
		},
		{
			"body": "Witam; Werbować=namawiać, do korzystania. To się równa reklama, to też namawia, tylko inne słowa zostały uzyte.Agresywna reklama = werbunek to jest to samo, namawiam , reklamuję produkt; tak aby klijent, kupił dał się skusić. To cały czas jest to samo, tylko zostały uzyte inne słowa.Do Bn80; Jest takie powiedzenie, Mądry polak po szkodzie. A ja dodam od siebie; Przed szkodą, jak i po szkodzie.e",
			"date_added": 1551181017390
		},
		{
			"body": "Nigdy się nie bedę sprzeczał; jestem starej daty, w tym czasie w naszym słownictwie zaszly olbrzymie zmiany. A ja wciąż tkwię w tym dawnym, i dlatego czasami zwracam na to uwagę. Ale, naważniejsze to być dobrze zrozumianym.Pozdr.",
			"date_added": 1551201330344
		},
		{
			"body": "Witam;Wiadomość do;\"Koltci\".Film wrzucony na YouTubePL- Nie można otworzyć ani seedować.Chodzi o Pola tetniące życiem. Wrzuć jeszcze raz to samo. To się nałozy na siebie. Pzdr.",
			"date_added": 1551720290894
		},
		{
			"body": "Witam;Wiadomośc do;\"ey2xjpdx\". Ostatni film jak i poprzedni na YouTubePl- Nie mozna otworzyć ani seedować. Wrzuć dubel ,to samo, to się nałoży. Pozdr.",
			"date_added": 1551727327756
		},
		{
			"body": "Kopy kate, chodzi bez błednie, zawsze; to tylko na youtubepl- sa problemy.Twój film z przed paru dni, dalej wisi, i nic nie można zrobić. Cały czas mowa o YouTubePL- Mam pytanie? Masz Windowsa czy Linuxa? Może to jest przyczyną.A co do koltci, to jak można wrzucić film i nie seedować?Przecież wszystkie filmy które wrzucamy są seedowane.A wrzucenie drugi raz tego samego, powoduje nałożenie się obydwu na siebie, jeden warunek pliki musz ą być takie same,sprawdzałem parę razy. Ja podejrzewam ze coś pomiędzy windows i linux, zgrzyta. Dlatego dajcie znać jakie dystrybucje macie? Dzięki. ",
			"date_added": 1551743964696
		},
		{
			"body": "W obecnej chwili są wrzucone,takie filmy,trzy sztuki.-01-Pola tętniące życiem.-02-  26.02.2019.[PL]-policja-w-. -03- 04.03.2019.[PL]-wynik-brauna-.   Wszystkie trzy są zablokowane.  Jest czwarty od Engeiermarcel- Stick Figure-Smoking love,ft. I ten się otwiera i dał seedować. Czyli raz idzie raz nie idzie, te od siebie sprawdzałem - otwierają się i dają seedować.  Sprawdzałem na znajomego komputerze. Pozdr.y  - ",
			"date_added": 1551744757173
		},
		{
			"body": "Próbowałem te filmy wielokrotnie seedować w ciagu doby, Noc jest bardziej aktywna.Ani razu nie udało się trafić na właczony - wyłaczonu komputer. Ja tylko próbuję spełnić obietnicę seedowania, wszystko co jest po polsku.Ja mam właczony 24-godziny, 7-dni w tygodniu. Jeśli ja seeduję to jest cały czas do pobrania i obejrzenia.Non stop.Małe pliki pobierają się automatycznie,- tak mam ustawione; a duże - decyzja należy do mnie.Zgłaszam ten problem, bo to jest w interesie nas wszystkich. Bezpośrednio, jak i pośrednio.Odemnie zawsze można pobrać cały czas, niema żadnych ograniczeń. To jest chyba ważne dla wszystkich.A sytuacja kiedy jest coś wrzucone, i za chwilę bedzie wyłaczony komputer? Co ja mam na to powiedzieć? Jeśli się wrzuca coś, to trzeba dać trochę czasu na to abym mógł to seedować.U mnie jest to dostępne 24-godz.Lepiej nie potrafię wytłumaczyć, reszta zależy tylko od tych co wrzucają filmy. Pozdr. ",
			"date_added": 1551820597666
		},
		{
			"body": "2919.03.04.01.[PL]- ten text, też jest na ZeroVoat. Jest tam Zero Polska.",
			"date_added": 1552238111388
		},
		{
			"body": "Próbowałem wgrać ponownie, ale nie przyjeło; 2/5 peerów.Wrzuciłem jako komentarz. Przyjeło, ale tytuł dało od starego tekstu. Niestety.",
			"date_added": 1552238671657
		},
		{
			"body": "Jest umieszczone w komentarzach.Tym razem sobie odpuszczę dalsze grzebanie. Nastepny artykół spróbuję poprawnie wgrać, o ile to zależy odemnie.",
			"date_added": 1552345798830
		},
		{
			"body": "Witam;qiq - na pokładzie lotniskowca.",
			"date_added": 1552399617768
		},
		{
			"body": "Co myślicie na temat;KxoVid- Czy to nie jest,stary - nowy internet?Jakie jest wasze zdanie, na ten temat?",
			"date_added": 1552857241293
		},
		{
			"body": "Witaj, na pokładzie.",
			"date_added": 1554425019946
		},
		{
			"body": "Witaj;Zaglądamy tutaj, jak kolega powiedział o różnych porach dnia i nocy.",
			"date_added": 1555097436390
		},
		{
			"body": "Jeśli się umówimy, że o 20,00- będziemy rozmawiać; to napewno będzie szybko działało. Ja zgłądam 2 - 3 razy, jak coś jest- to mogę dać odpowiedź; ( jeśli wiem ).Wtedy będzie działało szybko.",
			"date_added": 1555105252085
		},
		{
			"body": "Witam;Wesołych Świąt,smacznego jajka, i mokrego dyngusa życzę wszystkim.",
			"date_added": 1555800629432
		},
		{
			"body": "   Łączenie... Trackers announcing: 0, error: 1, done: 13 Nie odnaleziono użytkowników równorzędnych",
			"date_added": 1555978547999
		},
		{
			"body": "Dalej jest to samo; tylko liczba na pozycja - done:14-  się zmieniła na 14-.",
			"date_added": 1556012705445
		},
		{
			"body": "Internal error: KeyError: 'content.json' UiWebsocket.py line 83 > UiWebsocket.py line 267 > SidebarPlugin.py line 529 > SidebarPlugin.py line 121 > ContentDbDict.py line 59 Na drugim kompie też nie odbiera,(key error:content.json). ",
			"date_added": 1556065590863
		},
		{
			"body": "Wszyscy się pospali, albo są zmęczeni.",
			"date_added": 1557344992446
		}
	]
}