{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1,
			"title": "Novíssimo Dicionário de Economia",
			"body": "Este novíssimo Dicionário de Economia traz mais de 4 mil verbetes sobre a história da economia, das finanças e da administração no Brasil e no mundo. Abrange todas as modernas teorias e práticas econômicas, as dinâmicas de administração que regem o mundo empresarial e financeiro, os órgãos da administração pública. Aborda assuntos de interesse atual, como Plano Real, globalização, privatizações, ataques especulativos, Euro etc., tudo em linguagem clara e de fácil compreensão.\n\n- https://www.scribd.com/doc/6965717/Paulo-Sandroni-NOVISSIMO-DICIONACIRIO-DE-ECONOMIA",
			"added": 1559770249
		},
		{
			"topic_id": 3,
			"title": "Crise econômica",
			"body": "http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?18r69sEtZJnaFRcpgeZoUAW3X6jxLQ3PtZ_0",
			"added": 1559770510
		},
		{
			"topic_id": 4,
			"title": "Marxists Internet Archive",
			"body": "O Marxists Internet Archive (também chamado MIA, em português Arquivo na Internet de Autores Marxistas) é uma biblioteca virtual multilingue, colaborativa e não comercial que se dedica a recompilar textos de autores marxistas, distribuídos sob a licença Creative Commons.\n\nO MIA conta também com uma seção de \"arquivos suplementares\", onde se encontram escritos de autores que não são considerados marxistas (anarquistas, social-democratas, socialistas utópicos, etc.), mas contribuem, de algum modo, para a compreensão do marxismo. A seção em inglês (a mais completa de todas) inclui, nos seus arquivos suplementares, textos sobre Psicologia, História, Ciências Naturais e outros.\n\n- https://www.marxists.org/portugues/index.htm\n- Tor: http://www.marxist7mbr3mbaj.onion/",
			"added": 1559770744
		},
		{
			"topic_id": 5,
			"title": "Quão segura é a ZeroNet contra a computação quântica?",
			"body": "http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1559711646_1w9czsVapAVmVVQzf7xzuSqvqGar6xd2C",
			"added": 1559777636
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "#BRIGHTBURN - FILHO DAS TREVAS\nQuando uma criança alienígena cai no terreno de um casal da parte rural dos Estados Unidos, eles decidem criar o menino como seu filho. Porém, ao começar a descobrir seus poderes, ao invés de se tornar um herói para a humanidade, ele passa a aterrorizar a pequena cidade onde vive, se tornando uma força obscura na Terra.\n- https://www.megafilme.co/?trembed=0&trid=25634&trtype=1",
				"added": 1559777387
			}
		],
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": [
			{
				"comment_id": 2,
				"body": "#A História de Deus com Morgan Freeman\n\nO apresentador Morgan Freeman explora o papel da religião na história, como nossas crenças nos conectam e possíveis respostas para algumas dúvidas do ser humano.\n\n- https://megaseriehd.com/series/a-historia-de-deus-com-morgan-freeman/",
				"added": 1559778074
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 3,
				"body": "#Primeira Epístola de João\nI João é a primeira epístola do apóstolo João, um dos livros do Novo Testamento da Bíblia.\n\n#Capítulos\n\n- 1: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?18r69sEtZJnaFRcpgeZoUAW3X6jxLQ3PtZ_1\n- 2: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?18r69sEtZJnaFRcpgeZoUAW3X6jxLQ3PtZ_2\n- 3: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?18r69sEtZJnaFRcpgeZoUAW3X6jxLQ3PtZ_3\n- 4: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?18r69sEtZJnaFRcpgeZoUAW3X6jxLQ3PtZ_4\n- 5: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?18r69sEtZJnaFRcpgeZoUAW3X6jxLQ3PtZ_5",
				"added": 1559780245
			},
			{
				"comment_id": 4,
				"body": "#Introduzindo: o livro de Gênesis\nGênesis é o primeiro livro da Bíblia, que conta sobre as origens do mundo, da humanidade, do pecado e do grande plano de Deus para nos salvar. Nesse livro também descobrimos de onde veio o povo de Israel e como Deus estabeleceu Sua aliança com eles.\n\nGênesis significa “origem”.\n\n#Por que ler Gênesis?\nGênesis faz parte de um grupo de cinco livros chamados de Pentateuco, ou Torá. Esses primeiros cinco livros da Bíblia lançam os fundamentos de todo o resto do Antigo Testamento. Para entendermos melhor a situação do nosso mundo, e compreendermos o resto da Bíblia, precisamos ler o livro de Gênesis.\n\n#Que tipo de livro é Gênesis?\nGênesis é um livro histórico. Seu objetivo é contar a história das origens da humanidade e do povo de Israel. É um relato histórico, com registro de genealogias e eventos importantes que marcaram a História do mundo.\n\n#Como foi escrito?\nNão se sabe ao certo quem escreveu Gênesis mas uma tradição muito antiga diz que o autor foi Moisés. Se foi escrito por Moisés, provavelmente foi nos anos em que viveu no deserto do Sinai, liderando o povo de Israel depois que foram libertos da escravidão no Egito. Moisés viveu por volta do século XIV a.C.\n\n#Temas centrais em Gênesis:\n- O estado original do mundo\n- As consequências do pecado\n- A soberania de Deus\n- Deus cumpre Suas promessas\n- As bênçãos de uma vida de fé em Deus\n\n#Leia e reflita:\n- O que acontece quando pessoas e povos se deixam levar pelo pecado?\n- Como Deus mostra Sua justiça e misericórdia em Gênesis?\n- Veja como as escolhas e os pecados de cada pessoa trazem consequências. Você já sentiu as consequências de suas ações?\n- Como a fé em Deus afetou a vida de Noé, Abraão, Isaque, Jacó e José?\n\n#A organização do livro de Gênesis:\n#A criação do mundo e do homem - capítulos 1-2\nNo princípio, Deus criou todas as coisas, formando o mundo com Suas palavras. Ele criou tudo para ser bom e criou o homem e a mulher para dominar o mundo (Gênesis 1:27-28). O mundo ficou completo em seis dias e, no sétimo, Deus descansou e declarou que tudo era bom.\n\nDeus colocou o primeiro casal, Adão e Eva, no jardim do Éden, para cuidar dela. Os dois viviam felizes no jardim, em harmonia com Deus. Havia muitas árvores com frutos bons e eles podiam comer de qualquer uma, exceto da árvore do conhecimento do bem e do mal. Deus avisou que, se comessem o fruto dessa árvore, eles morreriam.\n\n#A queda e o pecado - capítulos 3-5\nUm dia, a serpente convenceu Eva a comer do fruto da árvore proibida, dizendo que iria torná-la igual a Deus. Adão também comeu do fruto e o pecado entrou no mundo. Deus confrontou Adão e Eva e castigou-os com o exílio. Nunca mais iriam poder viver no jardim do Éden e sua vida iria ser difícil (Gênesis 3:16-19). A serpente também foi amaldiçoada por sua maldade.\n\nDepois dessas coisas, Adão e Eva tiveram dois filhos chamados Caim e Abel. Caim ficou com ciúmes de Abel e matou-o, tornando-se o primeiro assassino. Caim foi banido e Deus deu outro filho a Eva, no lugar de Abel, chamado Sete. Adão e Eva também tiveram vários outros filhos e filhas, que começaram a povoar a terra. Mas o pecado continuava a crescer no mundo…\n\n#A história de Noé - capítulos 6-11\nDeus viu que a humanidade se tinha corrompido completamente, se dedicando inteiramente ao pecado. Por isso, Ele ficou muito triste e decidiu destruir o mundo com um dilúvio. Mas havia um homem chamado Noé (descendente de Sete), que andava com Deus. Então Deus decidiu salvar a humanidade através da família de Noé.\n\nDeus mandou Noé construir uma arca e, quando ficou pronta, encheu o navio com animais de toda a espécie. Noé, sua esposa, seus três filhos e as esposas deles entraram na arca e foram salvos do dilúvio que matou o resto da humanidade. Quando o dilúvio acabou, Deus fez uma aliança com Noé e prometeu nunca mais destruir o mundo com um dilúvio. Para lembrar dessa aliança, Ele criou o arco-íris (Gênesis 9:11-13).\n\nOs descendentes de Noé se multiplicaram e povoaram a terra. Em Babel, eles tentaram construir uma torre para chegar ao céu mas Deus confundiu as línguas e não conseguiram terminar a construção. Foi assim que surgiram várias línguas diferentes.\n\n#A história de Abraão - capítulos 12-23\nNoé teve um descendente chamada Abrão, que Deus um dia chamou para sair de sua terra (Gênesis 12:1-3). Deus prometeu abençoar todos os povos da terra através de Abrão! Por isso, Abrão deixou seu povo e se tornou nômada, à procura da terra que Deus tinha prometido aos seus descendentes.\n\nAbrão teve várias aventuras pelos lugares onde passou e, quando chegou à região de Canaã, Deus lhe disse que seus descendentes iriam herdar essa terra. Só havia um problema: Abrão não tinha filhos. Sua esposa, Sarai, era estéril. Então Deus prometeu dar-lhe um filho.\n\nDeus fez mais uma aliança com Abrão, mudando seu nome para Abraão, e Sarai para Sara. O sinal dessa nova aliança era a circuncisão. Todo homem descendente de Abraão deveria ser circuncidado, como sinal que fazia parte do povo de Deus. É por isso que os judeus praticam a circuncisão. Depois, disso, Sara engravidou e teve um filho chamado Isaque…\n\n#A história de Isaque - capítulos 24-26\nIsaque cresceu e se casou com sua prima Rebeca. Ele também andou com Deus, como seu pai, e creu na promessa. Rebeca era estéril mas Isaque orou e ela ficou grávida de gêmeos: Esaú e Jacó. Deus prometeu que o mais novo, Jacó, iria ser maior que o mais velho (Gênesis 25:23).\n\n#A história de Jacó - capítulos 27-36\nJacó era traiçoeiro e o favorito de Rebeca. Com a ajuda de sua mãe, Jacó enganou seu pai idoso e recebeu a bênção do filho mais velho. Esaú ficou muito zangado, por isso Jacó fugiu para outra terra. Pelo caminho, Deus falou com ele num sonho, prometendo cuidar dele (Gênesis 28:13-15). Na outra terra, Jacó se casou com duas irmãs que eram parentes suas: Lia e Raquel. Elas e suas duas servas deram a Jacó doze filhos homens. Esses se tornaram as doze tribos de Israel.\n\nJacó se desentendeu com seu sogro (que também era seu patrão) e fugiu de volta para casa, com sua família. Pelo caminho, ele lutou com um anjo, que o abençoou e mudou seu nome para Israel. Jacó nunca mais foi o mesmo.\n\n#A história de José - capítulos 37-50\nJacó tinha um filho favorito: José. Ele tinha sonhos de Deus e o dom de interpretar. Os outros filhos ficaram com inveja de José e um dia apanharam-no e venderam-no como escravo. José foi levado para o Egito e, depois de algum tempo trabalhando como escravo, foi lançado injustamente na prisão.\n\nNa prisão, José foi chamado para interpretar os sonhos do faraó, porque ninguém mais conseguia. Deus revelou a José o significado: estava chegando uma época de fome muito grave. Vendo a sabedoria de José, o faraó o colocou como seu primeiro-ministro, preparando mantimento para os anos de fome. Graças ao trabalho de José, o Egito foi poupado da devastação.\n\nA fome também chegou a Canaã e Jacó enviou seus outros filhos para comprar comida no Egito. De início, eles não reconheceram seu irmão José mas, na segunda visita, ele se revelou a eles e os perdoou (Gênesis 50:19-20). Deus tinha permitido essa maldade para salvar a família toda! Jacó se mudou para o Egito com sua família, onde José tomou conta deles. E foi assim que o povo de Israel se estabeleceu no Egito, durante 400 anos.\n\n- Fonte: https://www.respostas.com.br/introduzindo-o-livro-de-genesis/",
				"added": 1559781266
			},
			{
				"comment_id": 5,
				"body": "#Introduzindo: o livro de Êxodo\n\nÊxodo é o segundo livro da Bíblia, que relata como o povo de Israel foi escravizado no Egito e depois liberto por Deus, através de Moisés. Com grandes milagres, Deus levou os israelitas para o deserto e fez uma aliança com eles para serem Seu povo. O grande sinal dessa nova aliança foi a construção do tabernáculo, onde todos podiam adorar a Deus.\n\nÊxodo significa “saída” ou “partida”.\n\n#Por que ler Êxodo?\nO livro de Êxodo conta uma parte muito importante da História de Israel, que marcou tudo que veio a seguir. Também mostra como Deus é fiel e tem poder para mudar até as situações mais impossíveis. Além da história da partida do Egito, o livro de Êxodo lança as bases da justiça: os Dez Mandamentos.\n\n#Que tipo de livro é Êxodo?\nÊxodo é um livro histórico. Em suas páginas você vai encontrar um relato histórico sobre como os israelitas foram libertos da escravidão e saíram do Egito. Êxodo também narra em detalhe a construção do tabernáculo no deserto do Sinai e como surgiram as primeiras práticas religiosas judaicas.\n\n#Como foi escrito?\nSegundo uma tradição antiga, o livro de Êxodo foi escrito por Moisés, enquanto liderava o povo de Israel no deserto. Moisés viveu por volta do século XIV a. C. Não há forma de confirmar se foi escrito por Moisés, porque o livro não dá nenhuma indicação sobre quem foi o autor.\n\n#Temas centrais em Êxodo:\n- O poder de Deus para salvar\n- A glória da presença de Deus\n- A justiça de Deus\n- A importância da obediência a Deus e o perigo da rebelião\n\n#Leia e reflita:\n- Moisés não era perfeito mas Deus usou-o para libertar seu povo. Se ninguém é perfeito, o que faz alguém ser um verdadeiro líder?\n- Deus mostrou várias vezes Seu poder e Sua glória. Mesmo assim, o faraó resistiu e os israelitas se rebelaram! Não há falta de evidência do poder de Deus. Qual será a verdadeira razão por que as pessoas O rejeitam?\n- Como Deus mostra Sua justiça e Seu perdão em Êxodo?\n- Por que será que o tabernáculo era tão importante? Como reflete nossa relação com Deus?\n\n#A organização do livro de Êxodo:\n#A origem de Moisés - capítulos 1-2\nCerca de 400 anos depois da família de Jacó se ter estabelecido no Egito, no fim de Gênesis, seus descendentes tinham se tornado um grande povo. O faraó, com medo do poder dos israelitas, escravizou-os e tentou matar todos os meninos recém-nascidos. Mas um menino sobreviveu: Moisés.\n\nMoisés foi criado como filho da princesa mas ele nunca se esqueceu de suas origens israelitas. Certo dia, ele matou um egípcio que estava machucando um israelita e teve de fugir do país. Ele foi para Midiã onde casou e morou durante muitos anos como pastor de ovelhas (Êxodo 2:21-24).\n\n#O anúncio da libertação - capítulos 3-6\nUm dia, quando estava cuidando das ovelhas, Moisés viu uma sarça em chamas, que não era consumida pelo fogo. Ali, Deus falou com Moisés e o enviou para o Egito para libertar seu povo da opressão (Êxodo 3:7-8). Como Moisés sentia dificuldade em falar, seu irmão Arão seria seu porta-voz.\n\nMoisés voltou para o Egito e pediu permissão ao faraó para deixar seu povo ir fazer sacrifícios a Deus no deserto. Mas o faraó viu que queriam fugir e, em vez de permitir, aumentou a opressão. Por isso, Deus avisou que iria castigar o faraó e todo o Egito…\n\n#As dez pragas e a saída do Egito - capítulos 7-14\nDeus enviou nove pragas sobre o Egito, que devastaram o país mas não atingiram os israelitas. Mesmo assim, o faraó não cedeu. Então Deus enviou uma última praga: a morte dos primogênitos. Todo filho mais velho das famílias egípcias morreu mas os israelitas sacrificaram cordeiros e colocaram o sangue nas batentes das portas. O anjo da morte não entrou em nenhuma casa com sangue na porta. Essa foi a primeira Páscoa.\n\nQuando seu filho morreu, o faraó deixou os israelitas partir. Eles foram para o deserto mas, entretanto, o faraó mudou de ideias e decidiu persegui-los. Os israelitas ficaram encurralados entre o Mar Vermelho e o exército egípcio. Quando tudo parecia perdido, Deus abriu o Mar Vermelho e os israelitas atravessaram em segurança! - Êxodo 14:19-22 Quando os egípcios tentaram segui-los, o mar se fechou e eles se afogaram.\n\n#A viagem para o monte Sinai - capítulos 15-19\nDo outro lado do mar, os israelitas continuaram a caminhar pelo deserto. Apesar da rebeldia e da falta de fé do povo, Deus providenciou comida e água para todos. Os israelitas também tiveram sua primeira batalha e vitória militar.\n\nPor fim, o povo de Israel chegou ao monte Sinai, onde Deus se revelou com fogo e trovões (Êxodo 19:18-19). O povo foi avisado para se manter puro e Moisés foi chamado para subir o monte e se encontrar com Deus.\n\n#Os mandamentos de Deus para Israel - capítulos 20-31\nNo monte Sinai, Deus deu a Moisés os Dez Mandamentos e várias leis para governar Israel. O povo se comprometeu a obedecer aos mandamentos de Deus e fez mais uma aliança com Ele. Moisés voltou a subir o monte, onde Deus escreveu os Dez Mandamentos em duas tábuas de pedra (Êxodo 24:12-13).\n\nComo sinal da aliança, Deus mandou construir o tabernáculo, um lugar de adoração a Deus. Todos os sacrifícios deveriam ser feitos no tabernáculo pelos sacerdotes e esse seria o lugar onde o povo poderia se encontrar com Deus.\n\n#A rebelião e a renovação da Aliança - capítulos 32-34\nMoisés ficou no monte Sinai durante 40 dias. Entretanto, o povo se rebelou e construiu um ídolo de ouro na forma de um bezerro. Moisés voltou, viu toda a idolatria e quebrou as tábuas de pedra na sua ira. Os levitas se reuniram a ele e atacaram o povo, matando várias pessoas. No entanto, Deus não destruiu completamente os israelitas, que se arrependeram e renovaram a aliança.\n\nMoisés subiu novamente ao monte, onde recebeu tábuas novas com os mandamentos e viu a glória de Deus de perto (Êxodo 33:18-20). Quando voltou, seu rosto brilhava!\n\n\n#A construção e dedicação do tabernáculo - capítulos 35-40\nSeguindo as instruções de Deus, os israelitas construíram o tabernáculo e todos os seus utensílios. Arão e seus filhos foram escolhidos por Deus para ser seus sacerdotes e a tribo de Levi ficou encarregue de cuidar do tabernáculo.\n\nO tabernáculo foi montado e os sacerdotes foram consagrados. Quando tudo estava pronto, a glória de Deus desceu sobre o tabernáculo na forma de uma nuvem. A partir de então, a nuvem ficava sobre o tabernáculo e guiava os israelitas pelo deserto (Êxodo 40:36-38).\n\n- Fonte: https://www.respostas.com.br/introduzindo-o-livro-de-exodo/",
				"added": 1559781552
			},
			{
				"comment_id": 6,
				"body": "#Introduzindo: o livro de Eclesiastes\nEclesiastes é um dos livros de sabedoria da Bíblia, que explora o problema do sentido da vida. O autor analisa sua vida e o mundo à sua volta, mostrando a inutilidade de muitas das coisas em que as pessoas confiam. O livro tem também conselhos sábios e aponta para o verdadeiro sentido da vida: Deus.\n\nEclesiastes significa “pregador” ou \"alguém que fala para uma assembleia”.\n\n#Por que ler Eclesiastes?\nO livro de Eclesiastes obriga a pensar na vida e nas coisas em que você coloca sua confiança. Qual é o sentido da vida? De onde vem a verdadeira satisfação? Existe justiça no mundo? Como viver uma vida de valor? Eclesiastes não dá respostas fáceis mas ensina lições profundas.\n\n#Que tipo de livro é Eclesiastes?\nEclesiastes é um dos livros de sabedoria da Bíblia. Um livro de sabedoria é um texto escrito com o propósito de ensinar. Eclesiastes é uma lição sobre a vida, com reflexões profundas mas também conselhos práticos.\n\n#Como foi escrito?\nEclesiastes provavelmente foi escrito por Salomão, em Israel, por volta do século X a.C. (Eclesiastes 1:1) É possível que o livro tenha sido editado por outra pessoa mais tarde, mas não podemos ter a certeza disso. O livro foi escrito na época de maior prosperidade de Israel, provavelmente mais para o fim da vida de Salomão.\n\n#Temas centrais em Eclesiastes:\n- A falta de sentido na vida humana\n- A futilidade da riqueza e do poder\n- As injustiças da vida\n- A morte é inevitável\n- A importância de desfrutar da vida e de temer a Deus\n\n#Leia e reflita:\n- Muitas pessoas se identificam com os sentimentos expressos nesse livro. Você também já sentiu que a vida não tem sentido?\n- Muitas pessoas acham que a solução para o vazio no seu coração é dinheiro, fama, poder, educação, conhecimento, prazeres de todos os tipos… Salomão teve todas essas coisas. Qual foi a conclusão dele?\n- Quais são as coisas em que você tem confiado para dar sentido à vida? Será que dão mesmo sentido?\n- Eclesiastes foi escrito antes de Jesus vir ao mundo. Como é que a salvação e a vida eterna mudam o quadro?\n\n#A organização do livro de Eclesiastes:\n#Introdução: nada faz sentido - capítulo 1\nEclesiastes começa com o “filho de Davi, rei em Jerusalém” declarando que tudo é inútil, sem sentido (Eclesiastes 1:1-2). A natureza segue seu curso, a História se repete, mas ninguém se lembra do passado. Salomão dedicou sua vida ao conhecimento e à sabedoria mas não encontrou satisfação nem sentido para sua vida.\n\n#Não há sentido no prazer, na sabedoria nem no trabalho - capítulo 2\nSalomão gastou suas riquezas nos prazeres da vida: comida, bebida, bens, música, mulheres, grandes construções… Mas nada dessas coisas deu sentido à sua vida. Ele chegou à conclusão que também não vale a pena trabalhar muito e acumular riqueza quando um dia se vai morrer e deixar tudo para trás. Ele viu que a sabedoria não salva ninguém da morte e que é uma bênção de Deus poder desfrutar do presente (Eclesiastes 2:24).\n\n#Tudo tem seu tempo - capítulo 3\nAs coisas da vida são passageiras, não duram para sempre. Assim como não vivemos sempre em alegria e paz, também não vamos viver para sempre na tristeza, no medo e no sofrimento. Cada coisa tem seu tempo certo e Deus está no controle de tudo.\n\n#As injustiças da vida - capítulos 3-4\nSalomão viu que as pessoas muitas vezes não se dedicam à justiça, preferindo a maldade, e estão sempre em competição umas com as outras. Algumas pessoas trabalham sem parar para acumular dinheiro mas não desfrutam dela, quando poderiam gastar mais tempo com a família e os amigos (Eclesiastes 4:8). A sabedoria pode tornar um homem pobre em um rei mas não garante que seus sucessores sejam bons.\n\n#A importância de temer a Deus - capítulo 5\nDeus está muito acima da humanidade. Todas as outras coisas são inúteis mas a reverência a Deus faz sentido. Não se deve fazer pouco caso de Deus.\n\n#O dinheiro não satisfaz - capítulos 5-6\nMuitas pessoas procuram a felicidade na riqueza, mas ela nunca traz satisfação. Para quem ama o dinheiro, nunca há dinheiro suficiente. As pessoas querem sempre mais mas não sabem desfrutar dos bens que têm (Eclesiastes 5:10-11). É melhor ter menos com paz e contentamento, do que ter muita riqueza com frustração e preocupação constante. De qualquer jeito, no fim ninguém pode levar seu dinheiro consigo quando morre.\n\n#Conselhos e pensamentos sábios - capítulo 7\nNesse capítulo, Salomão dá vários conselhos úteis sobre como viver bem, agradando a Deus. É melhor ter boa reputação, temer a Deus e ser sábio do que ser rico e tolo. O sábio evita os perigos da ira e da imoralidade sexual, mas a maioria das pessoas corre atrás de intrigas.\n\n#A importância da justiça e de honrar o rei - capítulo 8\nO rei tem muito poder, por isso não é sensato se virar contra ele. Quem é leal e de confiança vive em paz e segurança. Mas o mundo está cheio de pessoas que cometem injustiças. O pecado pode até parecer que compensa mas no fim Deus fará justiça e recompensará quem é justo.\n\n#Desgraça e morte atingem a todos - capítulo 9\nNão há forma de escapar da morte. As pessoas ruins morrem e as pessoas boas também, os sábios e os tolos (Eclesiastes 9:2-3). Também não podemos evitar as desgraças do acaso com nossas ações. Nem sempre recebemos o que merecemos nessa vida mas podemos desfrutar das coisas boas que Deus nos dá e ser gratos a Ele por isso.\n\n#Outros conselhos e pensamentos sábios - capítulos 9-11\nA sabedoria é melhor do que ter muita força ou riqueza, por que dá mais garantia de sucesso. Mesmo assim a sabedoria nem sempre é apreciada e as pessoas fazem tolices. O trabalho do tolo é muito menos eficaz que o trabalho do sábio, que é diligente e não se deixa levar pela preguiça.\n\n#Conselhos para jovens - capítulos 11-12\nA juventude é a época para aproveitar a vida mas tudo deve ser feito com reverência a Deus. A força da juventude não dura para sempre e todos envelhecem, perdendo muitos de seus prazeres. Um dia você vai morrer e vai ter de prestar contas a Deus. Por isso, siga a Deus desde sua juventude e seja feliz (Eclesiastes 11:9-10).\n\n#Conclusão: tema a Deus - capítulo 12\nSalomão se dedicou muito à sabedoria e ao conhecimento. Depois de analisar todas as coisas, ele concluiu que o mais importante da vida é temer a Deus e obedecer aos seus mandamentos. No fim, é Deus quem estabelece a justiça (Eclesiastes 12:13-14).\n\n- Fonte: https://www.respostas.com.br/livro-de-eclesiastes/",
				"added": 1559781836
			}
		]
	},
	"comment_vote": {}
}