{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1568452695,
			"title": "Sub-Forum Creation",
			"body": "The news here is uncategorized, apart from into different languages. Is there a way to create, read or contribute to sub-fora?",
			"added": 1568452694
		},
		{
			"topic_id": 1568452819,
			"title": "Test Group Creation - TestGroup",
			"body": "This is an attempt to create a \"Group\", which hopefully would be a sub-forum of some type.",
			"added": 1568452817,
			"type": "group"
		},
		{
			"topic_id": 1568452876,
			"title": "Test topic -",
			"body": "This is a test to see if a new topic can be created and added to a newly created group.",
			"added": 1568452873,
			"parent_topic_uri": "1568452819_1GL3BhudLGH4B4EoKSwFhZPLDUdHQL94vF"
		},
		{
			"topic_id": 1568452959,
			"title": "Test second topic",
			"body": "This is a second news topic which hopefully appears categorized under the newly created testgroup",
			"added": 1568452955,
			"parent_topic_uri": "1568452819_1GL3BhudLGH4B4EoKSwFhZPLDUdHQL94vF"
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1568452695_1GL3BhudLGH4B4EoKSwFhZPLDUdHQL94vF": [
			{
				"comment_id": 1,
				"body": "> [katian](#comment_43_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx): maybe try to clone Zero Talk ?!\n\nIt seems that you can create a sub-forum, though in Zero Talk I think it is called a Group.\n\nYou create a post and then categorize it as a Group, instead of a topic. After that Group has been created, people can create related posts which appear under that Group.\n\nI can't see a way of browsing which Groups have been created yet. Somebody might have created one for your area of interest already...",
				"added": 1568455583
			}
		],
		"1568442422_1CULW1fmGcWRuzieU9rKarUGHa2ngwqTEH": [
			{
				"comment_id": 2,
				"body": "It would be a good time for aliens to arrive!\n\nFind some good computer games to play.",
				"added": 1568455660
			}
		],
		"1568342293_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1": [
			{
				"comment_id": 3,
				"body": "When you visit that instant.io site, none of the videos stream...\n\nAlso, webtorrent works if many people seed the torrent, just the same as bitorrent. Webtorrent allows streaming while downloading the torrent, but I think some bittorrent clients allow you to do that too, eg Deluge.",
				"added": 1568455816
			}
		],
		"1568379812_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3": [
			{
				"comment_id": 4,
				"body": "Using terms like inferiority/superiority is likely to be unhelpful in discussions, as it will sidetrack debate. To try and keep focus on the issue it would be better to say significantly different. The differences are real and non-trivial and better understanding of these differences can be used to help us enhance our decsions and policy making, in healthcare and immigration laws, for example.",
				"added": 1568456111
			}
		]
	},
	"comment_vote": {
		"43_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx": 1,
		"6_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3": 1,
		"4_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3": 1
	}
}