{
	"next_topic_id": 6,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"2_18VhT9MmPNHTj6ZaAXigPP251FAq1kxKVR": [
			{
				"comment_id": 1,
				"body": "> [kaffie](#comment_1_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): No seeds. Try webseeding with dropbox.\n\nI uploaded ACDC and Black Eyed Peas but I can't get them to play. I don't know what I did wrong but I noticed other people have made the same mistake. There needs to be a video tutorial posted on Kopy Kate to show people the correct way to upload videos and get them to play.",
				"added": 1491261940
			},
			{
				"comment_id": 2,
				"body": "> [kopyjanealt1](#comment_1_1GtycK2P4yBJd6svhARpyxsEBn96WQweSk): Think of it like the YouTube equivalent of The Pirate Bay.\n> One cannot upload videos to The Pirate Bay because it's only a database for finding magnet links. If the magnet links aren't being seeded, you won't be able to download anything.\n> Likewise, this is a browser-based Torrent engine that can stream videos. You need to have the torrent seeding on your WebTorrent.Desktop client, and it needs to be running 24/7. If you can't have the PC running 24/7 the other option would be to use a webseed. (Tutorials coming soon!)\n\nThanks, I'll wait on the tutorials before I try it again.",
				"added": 1491279673
			}
		],
		"3_1EqerKajfi14bzTkqwSfqVrxKmQW1w6Nzk": [
			{
				"comment_id": 3,
				"body": "> [kaffie](#comment_9_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): You should follow the dropbox webseeding tutorial. None of these are working for me.\n\nI've tried every thing, I want be trying to use Kopy Kate again. I'm just using centralized video hosting from now on.",
				"added": 1491774090
			},
			{
				"comment_id": 5,
				"body": "> [kopyjane](#comment_13_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE): Remember that webTorrent.desktop needs to be open for this to work, with the torrent you uploaded.\n> Uploading to kopykate is like uploading to Pirate Bay. If you close your torrent client, videos won't work, because the videos aren't stored on a server.\n> Seems to me like the user must have a basic understanding of torrenting in order to use the uploader correctly .. but I think that's not too much to ask for. If you want freedom and an uncensored media platform, you'll need to be willing to make a bit of effort. Otherwise, there's always YouTube.\n\n> [kopyjane](#comment_13_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE): Remember that webTorrent.desktop needs to be open for this to work, with the torrent you uploaded.\n> Uploading to kopykate is like uploading to Pirate Bay. If you close your torrent client, videos won't work, because the videos aren't stored on a server.\n> Seems to me like the user must have a basic understanding of torrenting in order to use the uploader correctly .. but I think that's not too much to ask for. If you want freedom and an uncensored media platform, you'll need to be willing to make a bit of effort. Otherwise, there's always YouTube.\n\nI kept webTorrent.desktop opened.",
				"added": 1491854977
			},
			{
				"comment_id": 6,
				"body": "Thanks for your guys help but I'll stick with centralized video hosting. Things like WebTorrent, Dropbox and Instant.io need integrated into Kopy Kate or something like them needs integrated into Kopy Kate. There are just to many steps needed to get videos to play right, that's a big turn off for me. Kopy Kate needs to be more like ZeroMusic but for videos instead of mp3's, where people can just upload videos directly to Kopy Kate.",
				"added": 1491855018
			}
		]
	},
	"comment_vote": {
		"1_1GtycK2P4yBJd6svhARpyxsEBn96WQweSk": 1,
		"3_14aG268HqAHbykUN9h1kRzaGZHfrMtV33R": 1
	}
}