{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1591804075,
			"title": "Scalability",
			"body": "How scalable is ZeroNet? Could something like the size of Facebook exist here?",
			"added": 1591804074
		},
		{
			"topic_id": 1592403341,
			"title": "Gaming",
			"body": "Gaming over ZeroNets network, would it be possible?\nWhat is the pros / cons?",
			"added": 1592403339
		},
		{
			"topic_id": 1593971855,
			"title": "FreeBSD",
			"body": "Are there any particular reason  to switch over to FreeBSD? What are you thoughts on it?",
			"added": 1593971852
		}
	],
	"topic_vote": {
		"1594047986_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	},
	"next_comment_id": 14,
	"comment": {
		"1591804075_12MBVCw8iNrKvgTrV5NMPtPf6Z5V2WRHYU": [
			{
				"comment_id": 1,
				"body": "> [frankwalter](#comment_4_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV): Something like the size of Facebook would work very good. The problem is something that is not the size of Facebook. For peers, you know?\n\nI understand. So the more peers ZeroNet has, the larger network it is able to sustain?",
				"added": 1591804818
			},
			{
				"comment_id": 4,
				"body": "> [frankwalter](#comment_5_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV): so it's not that a peer downloads all Facebook\n\nThat was my first thought, that every peer had to download the WHOLE Facebooks content etc etc which would cause an issue.",
				"added": 1591805714
			},
			{
				"comment_id": 5,
				"body": "> [frankwalter](#comment_9_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV): The main problem with zeronet, in my opinion, is that webmasters believe it is the web, as they left it in the centralized internet. But no, zeronet, as Wikipedia says, is a web-like, and requires completely different design choices from the normal web. Even as soon as a site far exceeds the default quota of 10 mb, it is very likely that the site was poorly designed. It is not uncommon to see mp4 stuck directly into the browser's <video> player which obviously gives problems, or pages that act as galleries full of images that all consume the quota of 10 mb by default. A website that takes full advantage of zeronet potential, which was designed FOR zeronet, can easily host millions of users.\n\nInteresting",
				"added": 1591969040
			},
			{
				"comment_id": 6,
				"body": "> [frankwalter](#comment_7_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV): Everyone has an SSD, and the file system problem is relative.\n\nI don't.",
				"added": 1591969084
			}
		],
		"1591633616_17kfQsU2wofPg9sM1smPiny9K1yzLc7Pux": [
			{
				"comment_id": 2,
				"body": "> [z0net](#comment_79_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS): I'm guessing you had access to this guy's password at work and he reuses passwords.Having one of us fuck up his account removes you from responsibility and from feeling bad.A few years ago, I'd have enjoyed doing just that, but I don't fuck with those who are undeserving anymore.Also, you aren't some leet hacker. You don't have some kind of backdoor to google or linkedin lol.\n\nFacts",
				"added": 1591805302
			},
			{
				"comment_id": 3,
				"body": "Didn't he have 2FA?",
				"added": 1591805332
			}
		],
		"1592307347_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji": [
			{
				"comment_id": 7,
				"body": "No idea",
				"added": 1592316124
			}
		],
		"1593971855_12MBVCw8iNrKvgTrV5NMPtPf6Z5V2WRHYU": [
			{
				"comment_id": 8,
				"body": "Currently reading the docs http://127.0.0.1:43110/18vK8Ns4q1YKbTDm965fBLFVJTEXXEh9Z/nutshell.html",
				"added": 1593971885
			},
			{
				"comment_id": 11,
				"body": "> [vcrovuep4lnye2b9](#comment_3_1JHhs98RB4734pGx6sL9i88ATF7GF2d1Ex): No switching to FreeBSD for most people is not the best idea...   If you are a system administrator who has a background in BSD and prefer it to Linux then either FreeBSD or OpenBSD will be useful to you...   If you use Linux nearly any flavor / distro will be secure...    BSD and Linux were developed during about the same timeline, Linux for most being the more simple of the two.\n\nI am generally more curious of why it is being so shilled and what the hype is about. I'm thinking of trying it out just to gain some personal experience. jail(8) seems very cool to me!",
				"added": 1594048952
			}
		],
		"1589945996_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [
			{
				"comment_id": 9,
				"body": ">propaganda/shilling\nDon't",
				"added": 1594044272
			},
			{
				"comment_id": 13,
				"body": "> [blurhy](#comment_539_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): We don't need propaganda if something is good enough\n\nFacts",
				"added": 1594219702
			}
		],
		"1594047986_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 10,
				"body": "Bump",
				"added": 1594048762
			}
		],
		"1594185414_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 12,
				"body": "> [styromaniac](#comment_2436_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Now, compare your brain to a CPU. I'd say my brain is like a single core CPU with a high clock speed. I'm not a good multitasker, but with focus, I do pretty well at solving some problems and some things I can be fast at, but not everything.\n\nYour brain can easily mold itself while the CPU only follows the instructions exactly as it is being told.",
				"added": 1594218686
			}
		]
	},
	"comment_vote": {
		"43_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": 1,
		"208_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"18_13gz7jEayVZjubcAGS16kR3Ze4RJSgVFVw": 1,
		"24_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"3_1JHhs98RB4734pGx6sL9i88ATF7GF2d1Ex": 1,
		"539_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1
	}
}