{
	"title": "1blolg#博客",
	"description": "HolyINS測試博客，太恐怖了。。",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 5,
	"demo": false,
	"modified": 1519719739,
	"post": [
		{
			"post_id": 4,
			"title": "11333New blog post",
			"date_published": 1519719670.339,
			"body": "Blog post body"
		},
		{
			"post_id": 3,
			"title": "迷樣的數字自我療法",
			"date_published": 1516703782.583,
			"body": "B一、前言\n---\n迷者困惑、惑亂也，事實是有，不知究理，說是被事理所迷。迷信，把錢財花在迷信的行為上，如卜卦算命等方面。迷者撲朔、迷離，雄兔腳毛蓬鬆，雌兔眼睛瞇縫，當其雌雄兔子奔跑時很難辨別雌雄。此事錯綜複雜，還真難以明瞭其真相。有的「財迷心竅」，用此簡易法來賺錢。有的沉醉、陶醉於此途，因簡單又沒副作用，死不了人，所以就更「著迷」、「入迷」、「沉迷」了。\n\n上海陳白華老師於去年底來台參訪，回去後不久寄來一本薄薄五十幾頁的小冊子，稱為「象數入門」，她說依此數字，經默念兩三小時後，對於她的痼疾似有幫助。此象數是「象數理卜」之象數，「象數理卜」是八卦的術語，象者形象，數者數字，理者是易經之真理，卜者用於推算未來事，也就是大家喜歡算命的卜卦。接到此迷樣的書，半信半疑，選個最簡單的組合數字「20‧60‧40」，但不依其建議用心念慢慢唸的，若要唸數字不如來唸佛，所以就先用黑墨筆寫在勞宮穴處，寫後不到數十秒，60是走腎臟，所以腳底湧泉穴即開始發脹，奇怪了，真有這麼神奇嗎？\n\n剛好爾幻大德拜大禮拜後，手臂受傷不能抬起，看了幾位推拿大師，雖是有改善但不能解決根本問題。就幫她選了一個號碼─03820‧60‧50，讓她寫在3M黏貼紙上貼在小手臂上，這一貼上不久她也說有氣發起來要通穴脈了，所以手臂就覺得很疼痛，幾日後口乾舌燥再改03820‧60‧40。爾虛大德用精神集中之碼─010‧060‧0540貼於大椎穴處，她說整理「解深密經」講稿，因腦筋清楚了，腦筋就比較管用了，一拿掉又恢復了常態，這表示氣機較通順了。\n\n還有位就讀某學校的女胖學生，體重有89kg，且經常便秘，在太白、衝陽、關元三處貼了一組數字─80‧20‧60‧50，在三、四天中體重真的降下至83kg，當然這不是減肥成功，而是拉出好多的宿便，從此大便也正常了，天天有大號了，還有虛胖身體所含水的細胞也脫水了，所以體重下降5、6kg。真有這麼好用？那還要什麼醫生呢？\n\n於是大家就開始依自己的毛病來找出適合的密碼試試，也就開始開發出自己的數字密碼。剛開始我用自創的五臟平時調理碼─781200‧6400‧54300，耳鳴就消失了，工作精神很high，真的提高工作效率。總歸一句話，對於有氣感的人，此等數字密碼感覺效果是蠻明顯，而且又是滿快而好用的。\n\n象數療法會用到中醫的藏象學說，就是關於人體的臟腑學說。這裡的臟腑，不單純是一個解剖學的概念，更重要的是一個生理、病理學方面的概念。古人認為藏象有兩種含義，一是指人體之臟器，二是指比類取象。這裡象即是包括臟腑外部顯露出來的，直接可見的具體形象，又包括臟腑內部蘊含的徵象，也就是生理、病理之象，也可說是指能量泉源。所謂比類取象，就是用類比方法，來說明人體五臟六腑組織間的生理、病理現象，能把握各臟腑之間，以及臟腑與環境之間的相互影響和相互制約的關係，就能理出編碼的技巧。\n\n \n\n二、象數療法發展的歷史\n\n此理念發明於1993年，1993年8月，大陸李山玉醫師在心理學副教授李健民的協助下，經十年臨床實驗，首創中國八卦象數療法。第一篇論文《八卦象數療法》在中華醫藥會主辦的中央級刊物《中華氣功》(第4期)正式發表。1993年l0月，李山玉應邀參加在北京召開的第二屆世界醫學氣功學術交流會，並被吸收為世界醫學氣功學會會員。1994年9月，李山玉、李健民合著的《中國八卦象數療法》一書，由學苑出版社(中央級)正式出版發行。中國中醫研究院研究生部楊力教授為本書作序。1995年3月12—15日，首屆國際易醫學術研討會在南京召開。本次研討會由南京中醫學院、國際易學研究院、國際易經學會聯合主辦。李山玉和李健民的論文《八卦象數療法的臨床研究》被評為優秀論文並收入《易醫文化與應用》一書，由華夏出版社正式出版發行。1996年8月，由中國中醫藥學會與美國國際易經醫學研究會聯合舉辦的“國際中醫與周易學術研討會”在鄭州召開。李山玉參加了會議，提交了論文《關於八卦象數療法疑難問題的臨床研究》，並在大會上宣講。1997年2月18日，經山東省龍口市政府主管部門批准正式成立了“龍口中國八卦象數療法研究所”，李山玉任所長。同年四月舉辦八卦象數療法普及函授班，面向海內外招生。1997年2月，龍口中國八卦象數療法研究所開始編印《易醫文化》(內部資料，雙月刊)。《易醫文化》的學術方向是以研究易醫文化為主題，以開發易醫科技為重點，以推廣八卦象數療法為目標。1998年8月，經內蒙社會心理學會批准，在赤峰正式成立“內蒙古社會心理學會易醫文化心理專業委員會”，李健民任主任。1998年12月30日，“龍口中國八卦象數療法研究所”登出，其全部業務移交內蒙古社會心理學會易醫文化心理專業委員會。八卦象數療法的研究推廣基地回到了它的故鄉。1999年1月，由李山玉、李健民共同編著的《八卦象數療法再現神奇》一書由學苑出版社正式出版發行，該書選取部分函授學員的101個典型病例。這些實踐報告，用生動的事實再一次有利的說明瞭八卦象數療法強大的生命力。1999年2月15日，赤峰李山玉易醫科技研究所，經赤峰市科委審批正式成立。3月18日在工商局松山區分局正式註冊。1999年5月，赤峰李山玉易醫科技研究所與《中國氣功科學》雜誌聯合舉辦函授班。1999年12月3日，衛生部直屬的中國醫療保健國際交流促進會自然醫學研究會象數療法推廣中心在赤峰正式成立。李山玉任該中心主任。這標誌著象數療法已進入了一個新的發展階段。\n\n \n\n三、上海推廣象數療法的張廣苓居士\n\n張廣苓居士原名張延寧女士，是一高級工程師，1969年畢業於北京醫學院藥物化學本科專業(即現北京大學藥學院)，2000年，她經過了腰椎手術後兩年臥床不起，生活無法自理，在2002年春天也接觸了象數療法，剛開始不輕易相信任何新東西，就算試試看吧！就這樣開始學習八卦象數療法，即根據自己的毛病，計畫配方為自己治療。過了一段時間之後，身體真變好了，能站起來走路了。2002年五月，她也參加了李山玉主任的課程，學習象數療法。現在她自己也研究出密碼，寫了本「健康象數入門」小冊子，也寫了《易學與健康》、《易學與健康導讀》等參考書。現在於上海市大力地在推廣象數療法，教導人家怎麼自己恢復健康。\n\n \n\n四、轉載《中國八卦象數療法簡介》一文\n\n                                                                                                     李山玉 中醫師\n\n張景岳曾經這樣論易醫結合—“賓嘗聞孫真人曰：「不知易，不足以言太醫」。每竊疑焉。以為《易》之為書在開物成務，知來藏往。而醫之為道，則調之贊化，起死回生。其義似殊，其用似異。且以醫有《內經》，何借于《易》？捨近求遠，奚必其然。而今已年逾不惑，茅塞稍開，學知知差，方克漸悟。乃知天地之道，以陰陽二氣而造化萬物。人生之理，以陰陽二氣而長養百骸。《易》者，易也；具陰陽動靜之妙。醫者，意也；含陰陽消長之機。雖陰陽已備於《內經》，而變化莫大乎《周易》，故曰：‘天人一理’者，一此陰陽也。‘醫易同源’者，同此變化也”、“易具醫之理，醫得易之用，學醫不易，必謂醫學無難 ……。知易不知醫，必謂易學深玄。”、“醫不可以無易，易不可以無醫，設能兼而有之，則易之變化出乎天，醫之運用由乎我。”、“人身小天地，具無一毫之相間矣。今夫天地之理具乎易，而身心之理獨不具易乎？引天地之易，外易也；身心之易，內易也。”、“醫之為道，身心之易也，醫而不易，其何以行之哉？”\n\n針對上述理論，中醫師李山玉、心理學專家李健民教授創造了融易學、中醫學、心理學為一爐的中國八卦象數療法。她是患者通過默念一組按易、醫原理排列的象數配方而達到治病健身目的的一種易、醫、氣相結合的資訊療法。\n\n八卦象數療法以天一合一的思想為指導，以易學的陰陽五行、八卦象數學說為核心，以中醫的藏象理論為基礎，以氣功默念為基本方式，使易、醫、氣相結合。它有如下突出的特點：\n\n(一)、大道至簡\n\n在治療過程中，不需要任何藥物和器械，不吃藥，不打針 ，無須任何複雜的氣功套路，而是念數即有功，有功即有力，有力即有效。\n\n念數不拘時間、地點、方位、姿勢，既可以在早晚集中默念，也可以貫穿於行、住、坐、臥之中。是最簡單化、最生活化、最自由化的氣功。她操作簡單，只要心中默念象數，就能產生能量巨大的次聲波。(註：若念佛的人，不能用唸的，可以把密碼寫在貼紙上，然後貼在主要穴位上或額頭、手臂上，要注意貼帶的過敏反應之問題。)\n\n(二)、返樸歸真\n\n宇宙萬事萬物都有象，有象就有數，有數就有“度”。象數是事物內在規律的反映。數隨著宇宙起源而發生，數的歷史與宇宙發生的歷史一樣久遠。宇宙八卦與人體八卦均有數，所謂“法於陰陽，合於術數”，是強調人養生保健，其生活就必須遵循自然界變化的規律及人體生理病理發展變化的規律。數不是宇宙萬物的唯一本源，但是宇宙萬物的本質屬性之一。\n\n雖然不同民族表達同一數的符號是千差萬別的，但其內容是完全一致的。八卦象數療法在實踐中，使用不同的語言來默念象數配方都能達到治病健身的效果，其“奧秘”就在這裏。\n\n雖然宇宙之事物，宇宙之數是無限的，而八卦象數療法中的象數是有限的（僅1、2、3、4、5、6、7、8，加上0）但卻能溝通萬事萬物的資訊。這是因為八卦象數能“通神明之德”，“類萬物之情”，所以它也是無限的。八卦象數是有限與無限的統一，是天道、物道、人道的載體，這樣才能使人體八卦場與宇宙八卦場同步共振，才能實現天人合一。\n\n用八卦象數療法治病是抓住其“根本”，抓住其“本源”。《黃帝內經》中所講的“正氣內存，邪不可干，陰平陽秘，精神乃治”，正是八卦象數療法的治療觀。由於八卦象數療法抓住了“正氣內存”，“陰平陽秘”這個根本，所以不用做“環境調理”和“飲食調理”同樣可以收到良好的治療效果。\n\n(三)、功力非凡\n\n八卦象數療法功力非凡，表現在兩個方面：第一方面是內效應。敏感的患者，剛默念象數幾分鐘，體內就產生效應，有的症狀立刻得到緩解。不少用藥物久治無效的頑症可以被象數攻克。第二方面是外效應。在患者無法默念象數配方的特殊情況下，由他人握住患者的手或其他接觸方式代替默念也同樣產生療效。這說明八卦象數療法的效應來得快，而且能量巨大。\n\n(四)、療效奇特\n\n人有病，不用吃藥、打針，只默念一組合理的象數配方就能治病，這個事實本身就是很奇特。而有許多疑難雜症，一些連大醫院都說不清，道不明的疑難怪病，甚至醫療領域中一些久攻不克的頑症和“不治之症”，通過默念象數配方就取得顯著療效，這就更令人驚奇。\n\n我們無意把八卦象數療法神化，因為世界上沒有一種萬能的包醫百病、包打天下的治療方法，人類健康事業和醫療科學的發展需要多種治療方法並存和互補。但八卦象數療法療效奇特，在眾多的醫療方法中以不吃藥、不打針、省錢、省時，無副作用著稱。患者若能與八卦象數療法有緣，無疑是一件幸運的事情。 \n\n(五)、適應範圍\n\n八卦能“通神明之德”，“類萬物之情”，它所包含的宇宙資訊是全方位的，是無限的。宇宙是大太極，人體是小太極，人體的每一部位都與宇宙間某一物質相對應，人體的任何疾病都可以用八卦來歸類。由此可知，八卦象數療法可以治療的疾病種類是無比廣泛的。\n\n在臨床實踐中，八卦象數療法對上百種疾病有顯著的療效。如：各種頭痛症、失眠症、嗜睡症、眼耳鼻咽喉口腔疾病、聲音沙啞、咳嗽痰盛、多年哮喘、肺結核、腸胃病疾、肝膽疾病、腎臟疾病、心臟病、高血壓、動脈硬化、靜脈炎、腦血栓、噁心眼花、甲狀腺疾病、糖尿病、泌尿系統疾病、陽萎、腰痛、坐骨神經痛、關節痛、肩周炎、肌肉疼痛、骨質增生引起的疼痛、牛皮癬、蕁麻疹、面癱、半身不遂、跌打扭傷腫痛、癲癇病、癌痛、出血症以及減肥、美容，等等，無法一一列舉。對一些疑難雜症和連大醫院也說不清道不明的疑難怪病的療效也常常令人驚奇。\n\n八卦象數療法在大多數情況下，可以作為單獨的治療手段來應用，在特殊的情況下，也是極好的輔助治療手段。如遇上需要縫合的外傷，八卦象數療法不能代替針線縫合，但可以止痛止血和加速傷口癒合，對一些不宜麻醉的部位的手術，用八卦象數療法減少手術疼痛，相當有效。\n\n八卦象數療法治療的有效率達百分之九十一以上，治癒率達百分之七十二以上，雖然這個比例是極高的，但它畢竟不是百分之百，這其中涉及象數配方是否合理對症，患者默念品質是否保證以及個人緣份、福份等因素。在治療過程中，對不同的人和疾病也有見效快慢之分。如果一個頑症患者經過其他手段多年治療仍未見效，而苛刻地要求八卦象數療法在很短的時間內治癒，否則就簡單否定，這種心態不利於患者與宇宙八卦場的資訊溝通。\n\n(六)、治療要領\n\n1、八卦象數配方分為一元結構和多元結構，如“010”為一元結構，“06‧04‧03”、“640‧380”為多元結構。\n\n2、默念八卦象數配方時要連續直念，不作一般的數字按千百十為單位來念，如“640”不念作六百四十。多元結構的配方，各元之間 以“‧”號只表示兩元之間的停頓，不用念，默念時兩元之間大約停頓半秒到一秒時間。默念象數配方一般要保持中速，不能過快過慢，如默念“640”一數大約用一秒到一秒半的時間。一個配方按以上方法從頭到尾念，周而復始。\n\n3、默念八卦象數配方不拘時間，早晚各集中一段時間默念效果最好。平時只要一想起配方就默念，即使只念上幾遍十幾遍，也可以保持人體與宇宙八卦場的資訊溝通，每天默念累計的時間越長見效越快，一般人每天默念累計的時間不應少於兩個小時以上，症狀明顯的患者，應安排一定時間集中默念。如住院或退休或其他有充裕時間的患者，每天默念累計時間要達5—8小時以上，以求速效，對那些有時間專心默念的患者，到一個月左右會達到隨時自發而念的狀態。\n\n4、默念八卦象數配方不拘時間、地點、方位、姿勢，行、住、坐、臥均可。\n\n5、默念時只專心於八卦象數配方，不用其他意念，更不要意想患處。\n\n6、在默念八卦象數配方中不知不覺地入睡，可以使人體在氣功狀態下休息，效果最好，當睡醒時只要想起配方，又繼續默念。\n\n7、八卦象數配方力求由患者自行默念，在特殊情況下，可由他人握住患者的手或用其他按觸方式（如嬰兒可由大人抱著）幫助默念。\n\n8、默念八卦象數配方後有頭清目明精神爽的感覺，或病狀緩解的感覺是有效的表現。有的人身體的一些部位有酸、麻、脹、熱、跳、動及關節等部位發出響聲等情況，這屬於正常效應，不必驚慌。\n\n9、極個別的人默念八卦象數配方時若有心臟、頭部、胃部有嚴重不適的反應，要停止默念，停止後不適感會自然消失。對出現這種情況的患者，可以重新調整配方，直至無不適感覺為止。\n\n10、如默念八卦象數配方時病狀好轉，但停止默念時則病狀反復，說明功力不足，應繼續默念，待功力增強後就不會有反復。\n\n11、八卦象數配方為患者個人專有資訊，病癒之前不宜向外人宣揚。若固定某一配方為常年健身的伴侶，更應保持資訊的專一擁有。\n\n12、一般患者在默念八卦象數配方時，應停止服藥，一些危重患者和一直未敢離開過藥物的患者，可視病情好轉的情況逐步減少服藥量，直到完全停止服藥。\n\n13、磁療器材，如磁療床對八卦象數配方有干擾作用，用八卦象數療法的患者應暫停使用。\n\n14、八卦象數配方治病機理獨特，針對性強，用此方法治病的患者，應暫時停用其他功法，以保證專一性，不互相干擾。\n\n \n\n五、提供一些中醫經絡圖\n\n若要自利或要利他，藏象學說與八卦象數療法，要深入去學習。藏象學說，也就是關於臟腑的學說，臟腑，即五臟六腑和奇恒之腑三類。五臟指心（包括心包絡）、肝、脾、肺，腎；六腑指小腸、膽、胃、大腸、膀胱、三焦。臟與腑，主要是根據它們功能特點的不同而區分的。五臟是貯藏精、氣、神、血、津液的，六腑是主管食物授納、消化、吸收、傳導、排泄的，所謂“臟以藏為主，腑以通為用”。(註：詳下十二經絡連結運行圖。)\n\n六腑之外，還有奇恒之腑，即腦、髓、骨、脈、膽、女子胞。因為它們既有異于正常的五臟，又不同於一般的六腑，所以稱為“奇恒之腑。”它們在生理、病理方面與臟腑關係極為密切，也可以說代表能量的起源部位。\n\n\n \n\n五臟六腑及十二經走向\n\n手三陽從手走到頭\n\n         手陽明大腸經\n\n       手少陽三焦經\n\n       手太陽小腸經\n\n手三陰從胸走到手\n\n         手太陰肺經(金)\n\n       手厥陰心包經\n\n       手少陰心經(火)\n\n足三陽從頭走到足\n\n         足陽明胃經\n\n       足少陽膽經\n\n       足太陽膀胱經\n\n足三陰從足走到腹         \n\n足太陰脾經(土)\n\n足厥陰肝經(木)\n\n足少陰腎經(水)\n\n \n\n\n\n少陽經→陽氣減弱之義，位半表裡，故為太陽與陽明兩經之樞紐\n\n太陽經→陽氣旺盛之義，位最表層，感受外邪最先發病之經脈\n\n陽明經→陽氣發展之最後階段，乙太陽少陽兩經之基礎繼續發展之義，是兩陽合明之簡稱，位太陽與少陽之裡面\n\n \n\n\n\n太陰經→陰氣旺盛之義，位三陰經最表層，故有太陰為開之稱\n\n少陰經→陰氣減弱之義，位太陰與厥陰之中間，故有少陰為樞之稱\n\n厥陰經→陰氣發展之最後階段，開始從新向陽轉化，太陰與少陰陰氣交盡際，位太陰與少陰之裡面，故言厥陰為合\n\n\n  \n\n第一輪\n\n手太陰肺經(金2)→手陽明大腸經(1)→足陽明胃經(7)→足太陰脾經(土8)\n\n土生金─所以編碼要用820 或 7820 或 120 或 210，也可試 217800之編法。此法是依十二經絡連結來編碼。\n\n第二輪\n\n手厥陰心包經→手少陽三焦經→足少陽膽經(5)→足厥陰肝經(木4)\n\n膽是木陽，肝是木陰，450 或 540皆可，045 或 054亦可\n\n第三輪\n\n手少陰心經(火3)→手太陽小腸經→足太陽膀胱經(9)→足少陰腎經(水6)\n\n金生水、木生火，所以編碼→260 或 1260 或 430 或 530 或 4530 或 5430\n\n若是依後天八卦，足太陽膀胱經可作為(9)，亦可編960 或 9640等之碼\n\n \n\n\n\n1.肺經→終點大拇指內側→   3.胃經→終點二趾外側→\n\n5.心經→終點小指內側→     7.膀胱經→終點小趾外側\n\n9.心包經→終點中指內側→   11.膽經→終點四趾外側\n\n2.大腸經→起點食指外側→   4.脾經→起點大趾內側\n\n6.小腸經→起點小指外側→   8.腎經→起點小趾外側連接入湧泉穴\n\n10.三焦經→起點中指外側→  12.肝經→起點大趾內側甲根毛際\n\n \n\n六、理解五臟六腑關係\n\n如以五行類比來配合臟腑的不同屬性、功能和特點：肺氣主肅降，金有清肅、收斂的特性，故以肺屬“金”；腎有藏精，主水的功能，水有潤下的特性，故以腎屬“水”。肝喜條達，有疏泄的功能，木有生髮的特性，故以肝屬“木”；心有溫煦的作用，火有陽熱的特性，故以心屬“火”；脾為生化之源，土有生化萬物的特性，故以脾屬“土”。臟腑理論用這種類比的方法，不僅把五臟六腑歸屬於五行，同時還把臟腑之間生理、病理複雜現象，用陰陽五行相生相克制化之原則關係來類比闡述。\n\n中醫的臟象理論用天人合一的整體觀，運用“遠取諸物，近取諸身”的原理，用“比類取象”的方法，把大自然的物質與人體臟腑相通應，如八卦中“巽為風”，《內經》把“風”善動的特性(即風之象)類推到人體病機方面，把凡是活動性的，善變的，遊走性，動搖性的病症(如眩暈、震顫、抽搐、行痹等)皆類比為屬“風”，從而創立了“風氣通於肝”的理論等等。\n\n總之，中醫在《周易》樸素的類比思維的基礎上，把“比類取象”的方法，廣泛地應用於病理學和生理學之中，推動了中醫學的發展，構成了中醫學獨有的特色。在八卦象數療法的臨床實踐中，用“比類取象”的方法，即根據臟腑蘊含的生理、病理之象以及它們的相互關係來取數配方；絕不是只根據各臟腑對應的象數來機械套用或簡單對號，而是遵循“八卦為體，五行為用，比類取象，辨證施治，平衡陰陽”的原則(這一點後面將舉例說明)。中醫的藏象學說是把天象、地象、人象合為一體，並將陰陽五行貫穿其中，是人與天地相應的整體觀的精華。為中醫內外相應“以外揣內”的獨具特色的診斷奠定了理論基礎。\n\n“中醫藏象學說來源於《周易》，並在天象物象和人象三結合中進行了發展，尤在接受易理、比類取象的基礎上，使法象有了新的突破，創立了頗具特色的中醫理論核心——中醫藏象學說，賦于了中醫學永恆的生命力”(《周易與中醫學》)。\n\n \n\n七、結語\n\n「象數療法」不一定要搞懂理念，什麼先天伏羲八卦、後天周易八卦，或什麼五行與八卦、周易中醫等等，若覺得學起來有困難，就不必勉強學它，只要身體有氣感的人，依自己的體驗就是正確的開發出數字密碼。但若有人要治療大病、重病，就要參考人家的經驗碼，然後有耐心的堅持做下去。若您有病且由西醫之醫生在作治療，雖然李山玉醫師不大同意此夾雜的治療作法，但您也可以把象數療法，當作自己的輔助療法可也。要知道何密碼是好、是有用，就要看人家的使用心得報告，大陸的象數療法，網路上有很多站。此法好像滿有這回事的，您不信何妨試試看，主要是不用花錢，又沒大的副作用耶！\n\n\n\n                    【法爾開發之數字密碼】                                  2011.05.31.製\n\n症狀                    \n\n象數密碼           \n\n黏貼位置                       \n\n腳板久坐疼痛          \n\n5300‧6400‧7200      \n\n腳板及太白穴處\n\n胸腰頸椎脊柱痛    \n\n010‧6000‧050        \n\n大椎穴\n\n                      \n\n00100‧1600‧400       \n\n大椎穴\n\n平時全身保養          \n\n81200‧6400‧5300     \n\n額頭、三陰交\n\n平時全身保養          \n\n781200‧6400‧5300     \n\n額頭、三陰交\n\n平時全身保養     \n\n781200‧640‧053             \n\n額頭、三陰交\n\n                      \n\n720‧600‧4300         \n\n三陰交\n\n \n\n200‧400‧600                \n\n三陰交 \n\n平時全身保養          \n\n078200‧6400‧5300   \n\n(貼後心悸加0於前)\n\n平時全身保養      \n\n217800‧6400‧5300    \n\n(依經絡次序)\n\n平時全身保養        \n\n078200‧96430‧4530   \n\n(膀胱9加進來)\n\n以上耳鳴、頭痛通用 \n\n781200‧6400‧45300   \n\n以上同額頭、三陰交\n\n耳鳴、頭痛         \n\n7200‧400‧5300       \n\n左手內關\n\n \n\n7200‧1600‧400       \n\n右手內關\n\n上牙齦腫痛           \n\n007‧0016             \n\n上牙齦外處                   \n\n失眠、心浮躁           \n\n20‧60‧40            \n\n勞宮、神門   \n\n                                         \n\n20‧60‧4300         \n\n勞宮、神門、內關\n\n手臂拉傷疼痛           \n\n038200‧640‧500      \n\n手臂各處、肩\n\n \n\n038200‧6400‧5300    \n\n(平時用電腦時可用)\n\n \n\n03820‧60‧50            \n\n口乾換下碼\n\n \n\n03820‧60‧40         \n\n手臂、肩部   \n\n高血壓            \n\n7820‧1600‧005        \n\n左手內關\n\n                       \n\n7820‧1600‧400          \n\n右手內關\n\n下肢不良          \n\n003‧004‧0016              \n\n太沖、太白   \n\n心臟不良　    　       \n\n245300                 \n\n神門、內關(030一般用)\n\n腎部痛            \n\n126600‧4400‧5300‧780 \n\n內關、腰部\n\n腎結石            \n\n720‧650‧380\n\n內關、腰部、大腿膀胱經\n\n \n\n720‧40‧60亦可\n\n內關、腰部、大腿膀胱經\n\n喉部痛            \n\n06200 或 00620 或 781200\n\n喉結部\n\n \n\n00200 或 001200 或 00260       \n\n取一組貼喉部\n\n \n\n0781200                 \n\n喉結部\n\n腿部無力               \n\n710‧6000‧050           \n\n與下合兩碼一起用\n\n腿無力(老人家)         \n\n00700‧5400‧370      \n\n陰/陽陵泉\n\n膝蓋痛            \n\n00700‧5400‧07800\n\n陽/陰陵泉輪用              \n\n　                           \n\n00700‧5400‧070      \n\n陽/陰陵泉輪用      \n\n胃陰虧損               \n\n7200‧1600‧400     \n\n內關(腮腺炎可用)         \n\n(胃陽不足)          \n\n07200‧1600‧400\n\n與上碼二選一用\n\n腳板氣不通            \n\n5300‧6400‧7200\n\n 腳板痛處\n\n肝火旺盛           \n\n200‧400‧600            \n\n三陰交、太淵\n\n腎部位痛          \n\n126600‧4400‧5300‧780    \n\n腎痛                               \n\n耳鳴遠處理               \n\n710‧6000‧050                 \n\n陰/陽陵泉(1)\n\n(此三組合用)\n\n7200‧6600‧4300           \n\n環跳穴(2)\n\n                              \n\n126600‧4300‧7800         \n\n委中穴(3)\n\n一般便祕              \n\n810‧1660‧440 \n\n三陰交、內關 \n\n \n\n80‧1660‧440  \n\n三陰交、內關\n\n　    　                   \n\n7810‧12660‧440  \n\n支海、照海                       \n\n \n\n780‧12660‧450           \n\n支海、照海\n\n長期嚴重便秘    \n\n80‧20‧60‧50     \n\n太白、衝陽、關元同時用\n\n                        \n\n380‧650 \n\n太白、衝陽、關元同時用\n\n耳鳴                    \n\n6640‧0530\n\n耳後之耳根部       \n\n耳鳴(三組共用)                \n\n450‧530   \n\n耳前之耳珠處\n\n耳鳴                 \n\n03820‧640‧500          \n\n手臂上(合上成3處)\n\n血瘀阻、腳板抽筋 (外側)\n\n4440‧600‧53780\n\n4、5腳趾上\n\n血瘀阻、腳板抽筋 (外側)  \n\n5300‧6400‧7200\n\n4、5腳趾上\n\n血瘀阻、腳板抽筋 (外側)  \n\n12600‧5300‧7800\n\n陽陵泉(以上三組共用)\n\n腳板抽筋 (外側)  \n\n00700‧5400‧070\n\n足三里\n\n腳板抽筋(內側)      \n\n4440‧600                \n\n太白穴往後延伸\n\n胃部不適             \n\n78100‧640‧530          \n\n中脘、衝陽並用\n\n                         \n\n7200‧5300‧6400         \n\n中脘、衝陽並用\n\n精神病問題            \n\n78120‧6640‧5430    \n\n額頭按摩手掌背各痛點\n\n心慌意亂情迷         \n\n37800‧640‧4530         \n\n額頭按摩手掌背各痛點\n\n心悸、心跳無力       \n\n0064530或030(輕微用)\n\n雙手內關       \n\n婦女病                \n\n260‧4380‧720          \n\n衝陽、太蹊、崑崙\n\n                         \n\n9640‧5380‧7200        \n\n衝陽、太蹊、崑崙\n\n乳房腫塊                   \n\n640‧000‧7820          \n\n膻中、三陰交貼加默念微聲念\n\n各型肝炎併發          \n\n0001000‧7820          \n\n專注緩慢默念微聲念(1)\n\n(腳痛無力)              \n\n650‧30‧20            \n\n專注緩慢默念微聲念(2)\n\n風溼關節炎            \n\n00100‧00700           \n\n衝陽穴貼加默念微聲念\n\n(嚴重選此用) \n\n00071000‧6000‧500   \n\n衝陽穴貼加默念微聲念\n\n近視或眼睛保養         \n\n0064                    \n\n貼於兩眼之下眼簾處\n\n糖尿病(輪流用)         \n\n78200‧6400‧5300       \n\n三陰交、內關、外關\n\n糖尿病(輪流用)      \n\n0780‧1260‧4530           \n\n中脘、內外關輪用\n\n大人發高燒              \n\n003‧0082‧004‧0016       \n\n額頭、勞宮穴\n\n嬰兒發高燒            \n\n003‧0064‧7800             \n\n額頭\n\n浮腫排尿困難        \n\n7820‧1260‧540             \n\n三陰交、內外關\n\n下肢浮腫            \n\n7820‧1260‧530             \n\n三陰交、內外關\n\n血液黏稠            \n\n200‧600‧400               \n\n三陰交\n\n \n\n[ 象數療法] [ 健康教室 ] [ 首 頁 ]log post body"
		},
		{
			"post_id": 2,
			"title": "再說一次，到底是什麼鬼點子？",
			"date_published": 1516702434.704,
			"body": "這是蝦米意思？"
		},
		{
			"post_id": 1,
			"title": "祝賀！你丫的！",
			"date_published": 1433033779.604,
			"body": "這是什麼套路！？！"
		}
	],
	"tag": [
		{
			"value": "1",
			"post_id": 1
		},
		{
			"value": "1",
			"post_id": 2
		},
		{
			"value": "鬼",
			"post_id": 2
		},
		{
			"value": "blog",
			"post_id": 2
		},
		{
			"value": "營養",
			"post_id": 3
		},
		{
			"value": "治療",
			"post_id": 3
		},
		{
			"value": "疾病",
			"post_id": 3
		},
		{
			"value": "象數",
			"post_id": 3
		}
	]
}