{
	"next_topic_id": 9,
	"topic": [
		{
			"topic_id": 1,
			"title": "O \"economicismo\" e a manutenção de privilégios no Brasil",
			"body": "O vídeo discute o conceito de \"economicismo\", no que concerne a uma forma de enxergar os problemas da sociedade a partir de um prisma puramente econômico, e mostra em termos gerais como se dá a manutenção de privilégios na sociedade brasileira. \n\nEste vídeo está plenamente ancorado na introdução do livro \"A ralé brasileira\", do sociólogo brasileiro Jessé Souza.\n\n- https://video.datsemultimedia.com/videos/watch/ae65248e-dc7d-4028-8100-ce74ec19bc31",
			"added": 1550423032
		},
		{
			"topic_id": 2,
			"title": "O Banco Central é a boca de fumo dos banqueiros - Jessé Souza",
			"body": "#O Banco Central é a boca de fumo dos banqueiros\n\n- https://video.datsemultimedia.com/videos/watch/428af498-1f64-420a-a02d-a71ee1d2f0b1",
			"added": 1550423671
		},
		{
			"topic_id": 3,
			"title": "Jessé Souza explica a classe média",
			"body": "O sociólogo Jessé Souza, autor do premiado \"A elite do atraso\", fala sobre seu novo livro, \"A classe média no espelho\", em entrevista aos jornalistas Florestan Fernandes Júnior e Leonardo Attuch.\n\n- https://video.datsemultimedia.com/videos/watch/27096a0f-0f61-48fa-a2dc-9aaaf0d3e2c9",
			"added": 1550423892
		},
		{
			"topic_id": 4,
			"title": "Aula Magna - Políticas Públicas e Desigualdade em Tempos de Crise (Palestrante: Prof. Dr. Jessé Souza)",
			"body": "Aula Magna - Políticas Públicas e Desigualdade em Tempos de Crise\n- https://video.datsemultimedia.com/videos/watch/baa44bac-0401-43ee-99eb-239a372d063e",
			"added": 1550424862
		},
		{
			"topic_id": 5,
			"title": "Que País é Esse? com Jessé Souza",
			"body": "Conversa com o professor, sociólogo e pesquisador Jessé Souza sobre as diferentes forças que moldaram o sistema político-social brasileiro ao longo dos séculos.\n\n- https://video.datsemultimedia.com/videos/watch/b695147f-72aa-4462-8b81-a915bd6a6e2b",
			"added": 1550425156
		},
		{
			"topic_id": 6,
			"title": "Jessé Souza fala sobre seu novo livro, \"A Classe Média no Espelho\"",
			"body": "Em participação no programa Direto da Redação, o sociólogo Jessé Souza falou sobre seu novo livro, \"A Classe Média no Espelho\".\n- https://video.datsemultimedia.com/videos/watch/83cefb66-6d5c-4a55-a29f-dd19ee51cf86",
			"added": 1550425190
		},
		{
			"topic_id": 7,
			"title": "Noam Chomsky - Não deixa a mídia lhe fazer lavagem cerebral",
			"body": "#Noam Chomsky - Não deixa a mídia lhe fazer lavagem cerebral\n\n- https://video.datsemultimedia.com/videos/watch/bac6f13a-350c-457a-8931-79844067dbc9",
			"added": 1550426761
		},
		{
			"topic_id": 8,
			"title": "Mídia: Propaganda política e manipulação",
			"body": "Neste livro, Noam Chomsky fala sobre o poder de manipulação que a mídia exerce nos Estados democráticos modernos, os quais procuram fazer que o povo seja impedido de conduzir seus assuntos pessoais e que os canais de informação sejam estreita e rigidamente controlados. Ele diz como essa noção de Estado democrático se desenvolve e por que e como o problema da mídia e da desinformação se insere nesse contexto.\n\n- Livro: https://anonfiles.com/G4kbodu4b9/M_dia_Propaganda_pol_tica_e_manipula_o_pdf\n- SHA-256: f8c8b4759583f4137646991632fed30e0a9a51a2b86df320a51153c9eb8905ce",
			"added": 1550427470
		}
	],
	"topic_vote": {
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"8_1D2KCSJS5KFM9j47kS8T12FWkByzfj9q4P": 1
	},
	"next_comment_id": 20,
	"comment": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 1,
				"body": "#Desenhos Bíblicos - Sinais do Fim dos Tempos\n- https://video.datsemultimedia.com/videos/watch/7c9bb9b3-52b4-4d54-8061-873c9d14d438",
				"added": 1550421250
			},
			{
				"comment_id": 18,
				"body": "#Livro de Apocalipse - Completo Narrado por Cid Moreira\n- https://video.datsemultimedia.com/videos/watch/2aab9f42-78c5-42f9-ae19-c93a00606566",
				"added": 1550428564
			},
			{
				"comment_id": 19,
				"body": "#Desenhos da Bíblia sobre a historia de Jesus e dos primeiros discipulos - Coletânea 5H\nAssista uma coletânea  de desenhos Bíblicos que contam a historia de Jesus  e de seus primeiros seguidores uma historias cheia de princípios e valores que vão mexer com seu coração!\n\nInfelizmente os desenhos e filmes não traz toda a verdade da Bíblia... Por isto quando assistir os desenhos procure acompanha-los pelas escrituras. \n\nDeus vos abençoe...\n\n- https://video.datsemultimedia.com/videos/watch/2e0d0366-91f3-4338-b8b0-9ea3e455dd76",
				"added": 1550428912
			}
		],
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": [
			{
				"comment_id": 5,
				"body": "#ADOLF HITLER / HISTÓRIA\nAdolf Hitler, por vezes em português Adolfo Hitler, foi um político alemão que serviu como líder do Partido Nazista, Chanceler do Reich e Führer da Alemanha Nazista de 1934 até 1945. Como ditador do Reich Alemão, ele foi o principal instigador da Segunda Guerra Mundial na Europa e foi figura central do Holocausto.\n\n\"Quem não recorda o passado está condenado a repeti-lo.\" - George Santayana\n\n- https://video.datsemultimedia.com/videos/watch/0b5e89c4-92db-4dc5-9060-ed3c9b21dbe8",
				"added": 1550421580
			},
			{
				"comment_id": 6,
				"body": "#Gêngis Khan e o império mongol\nNascido às margens do Rio Orhon, filho de um chefe que comandou a Mongólia desde a região de Amur até a Grande Muralha da China, Temujin sucedeu ao pai quando tinha treze anos de idade. Mas não havia obtido nenhuma vitória militar até derrotar os keraites em 1203. Com isso, seu povo o declarou Gêngis Khan, que significa \"imperador universal\". O novo título foi aceito sem hesitação e, para fazer jus a tamanha homenagem, ele decidiu sair numa campanha de eonquista que duraria nada menos que 25 anos. Gêngis primeiro voltou sua atenção para os tártaros. Após derrotá-los, ele seguiu para o sul em direção à China, onde a dinastia Sung estava à beira da ruina e, portanto, era um alvo fácil para os saqueadores mongóis. Gêngis capturou Beijing em 1214 e em pouco tempo ocupou a maior parte da Ghina. Durante séculos, os mongóis haviam sido um povo nômade que vivia nas vastas planícies da Ásia central. Eles se espalhavam pelas estepes e viviam lutando entre si e pilhando vilarejos nas franjas do Império Chinês. Além de sua terra natal, poucos povos jamais haviam ouvido falar nos mongóis. A Grande Muralha da China, cuja construção teve início por volta de 200 d.C., os tinha mantido distantes, e a maior parte da Europa ficava a milhares de quilômetros dos desertos elevados e frios habitados pelos mongóis.\n\nMas, depois que Gêngis assumiu o poder, distância ou muralha não eram mais obstáculos para suas ambições. Em 1219, o \"imperador universal\" rumou para oeste, por terras que nunca tinham ouvido falar em suas conquistas. As Hordas Mongóis, como passaram a ser conhecidas as vastas ondas de cavaleiros fortemente armados, varreram a Rússia, detonaram o Império Persa, engoliram a Polônia e a Hungria e ameaçaram a Europa como um todo.\n\nO chefe guerreiro dos mongóis, que não tinha muita afinidade com os finos produtos das civilizações chinesa e européia, dormia em uma tenda e costumava cavalgar um rápido e robusto garanhão mongol. É bem provável que ele tenha sido o líder militar de maior sucesso na história do mundo. Gêngis Khan não via limites para a expansão do Império Mongol. Pelos oito anos seguintes, ele reuniu o mais longo império contínuo que o mundo já havia visto. O sucesso de suas Hordas destruidoras, no entanto, dependia totalmente da habilidade e liderança de Gêngis Khan e da unificação dos mongóis. Durante algum tempo após sua morte, quando ele foi sucedido por seu terceiro filho, Ogodei Khan (1185-1241), as conquistas continuaram. Mas, depois, o império começou a se esfacelar e as Hordas Mongóis tomaram o rumo de casa. Na China, a dinastia Mongol, ou Yuan, teve vida longa: ela resistiu até 1368.\n\nA grande importância de Gêngis Khan e do Império Mongol na história foi o de terem tornado povos de lados opostos do mundo, como a China e a Europa, cientes um do outro. As Cruzadas haviam reaberto o antigo diálogo entre a Europa e o Oriente Médio, mas, antes dos mongóis, os europeus em sua maioria ignoravam a existência do Extremo Oriente.\n\n- https://video.datsemultimedia.com/videos/watch/6e03c63f-e6fd-4c59-8590-1f033eedf664",
				"added": 1550421639
			},
			{
				"comment_id": 7,
				"body": "#Atila, o Huno\nÁtila (406-453) foi um dos maiores guerreiros da história, o mais perverso dos reis hunos. Comandou o ataque aos dois impérios romanos (do Oriente e do Ocidente), saqueou várias cidades, dominando toda a região Norte da Península Itálica. Conquistou um grande império que se estendeu entre a região do Mar Cáspio na Ásia Central e o rio Reno, na fronteira com a Gália, região da atual França.\n\n- https://video.datsemultimedia.com/videos/watch/0c7b4e39-ae08-45f9-962b-13c851d1467b",
				"added": 1550421678
			},
			{
				"comment_id": 8,
				"body": "#Núbia, um Reino Esquecido\nSinopse: Enterrada nas areias do Sudão encontra-se o ancestral reino de Núbia, uma civilização foi tão poderosa que chegou a conquistar o Egito. Mas o reino de Núbia foi esquecido e sua fama foi obscurecida pelos tesouros do antigo Egito.\n\n- https://video.datsemultimedia.com/videos/watch/6af388e8-9341-4409-b17f-3b803b2b8c3f",
				"added": 1550421709
			},
			{
				"comment_id": 9,
				"body": "# HISTÓRIA DO BRASIL POR BÓRIS FAUSTO\nAtravés de documentos e imagens de arquivo, Bóris tenta demonstrar de que forma o processo histórico brasileiro ajudou a definir a nação que temos hoje. Em um panorama político, social e econômico do Brasil, dos tempos coloniais, passando pela Era Vargas e também pelo regime militar, Bóris também é ajudado pelos seus entrevistados: personalidades que ajudaram a fazer essa história.\n\n- https://video.datsemultimedia.com/videos/watch/6969fd63-b747-4090-a65e-a4721ed155f5",
				"added": 1550421746
			},
			{
				"comment_id": 10,
				"body": "#O que é anarquismo? - Conceitos Históricos\n- https://video.datsemultimedia.com/videos/watch/32788e13-2145-4664-b375-ccd1fcb3b8b7",
				"added": 1550421848
			},
			{
				"comment_id": 11,
				"body": "#Como se definem Direita e Esquerda? - Conceitos Históricos\n- https://video.datsemultimedia.com/videos/watch/97c8a91f-375d-40ba-a691-576a62527f49",
				"added": 1550421997
			},
			{
				"comment_id": 12,
				"body": "#O que é Fascismo? - Conceitos Históricos\n- https://video.datsemultimedia.com/videos/watch/bae1d8be-2d1f-41b2-879f-3f62fd62b7f7",
				"added": 1550422156
			},
			{
				"comment_id": 13,
				"body": "#O que é Ideologia (e o que não é)? - Conceitos Históricos\n- https://video.datsemultimedia.com/videos/watch/7ee2198b-b0ac-4af0-a6cd-d4edac63d35f",
				"added": 1550422298
			},
			{
				"comment_id": 14,
				"body": "#O Brasil \"deu ERRADO\" por ser \"colônia de EXPLORAÇÃO\"?\nCom certeza você já ouviu várias vezes aquela história de que os Estados Unidos \"deram certo\" porque foram uma \"colônia de povoamento\", enquanto o Brasil \"deu errado\" por ser uma \"colônia de exploração\". Será mesmo?\n- https://video.datsemultimedia.com/videos/watch/4f343964-c6fe-42c5-9c4c-904c3cab21c1",
				"added": 1550422453
			},
			{
				"comment_id": 16,
				"body": "#O que é Feudalismo - Conceitos históricos\n- https://video.datsemultimedia.com/videos/watch/2e790410-4218-4200-9e1d-4a815265b8bf",
				"added": 1550428247
			},
			{
				"comment_id": 17,
				"body": "#Construindo um Império (History Channel) \n\nA grandeza arquitetônica dos impérios tem deslumbrado e cativado o mundo inteiro desde sempre. Ainda que estas edificações tenham se erguido sem os computadores e as ferramentas que hoje nos oferece a tecnologia, ainda se mantêm resplandecentes por sua grandiosidade, tamanho e singular beleza.Descubra os mistérios por trás da construção dos maiores impérios da história. Una-se a nós e descubra como se realizaram estas incríveis obras.\n\n- https://www.youtube.com/playlist?list=PLKUrNAB1azYMzWLS-Vmi00PrZPSBstTJJ",
				"added": 1550428465
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 3,
				"body": "#A Onda - 1981\nTem início com o professor de história Burt Ross explicando aos seus alunos a atmosfera da Alemanha, em 1930, a ascensão e o genocídio nazista. Os questionamentos dos alunos levam o professor a realizar uma arriscada experiência pedagógica que consiste em reproduzir na sala de aula alguns clichês do nazismo: usariam o slogan 'Poder, Disciplina e Superioridade', um símbolo gráfico para representar 'A onda', etc. O professor Ross se declara o líder do movimento da 'onda', exorta a disciplina e faz valer o poder superior do grupo sobre os indivíduos. Os estudantes o obedecem cegamente. A escola inteira é envolvida no fanatismo d'A onda, até que um casal de alunos mais consciente alerta ao professor ter perdido o controle da experiência pedagógica que passou ao domínio da realidade cotidiana da comunidade escolar.\n\n- https://video.datsemultimedia.com/videos/watch/b9ae9b90-0825-4931-8854-2bdd497b56cf",
				"added": 1550421475
			},
			{
				"comment_id": 4,
				"body": "#Anibal: O Pior Pesadelo de Roma\n200 anos antes do nascimento de Cristo, Roma se torna a nova potência do mundo antigo. Ela acha que é invencível, mas um homem está destinado a mudar isso. Um homem guiado pelo seu juramento de vingar as injustiças inflingidas ao seu lar. Hannibal explora o homem atrás do mito, revelando o que levou um gênio de 26 anos de idade a executar o mais audacioso plano militar de todos os tempos. Com 40 mil soldados e 37 elefantes, ele marchou 1.500 milhas para desafiar o seu inimigo em seu próprio território.\n\n- https://video.datsemultimedia.com/videos/watch/28d4eb93-0713-455b-bd75-4fcd2ab3b91e",
				"added": 1550421529
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 15,
				"body": "#Mídia: Propaganda política e manipulação\nNeste livro, Noam Chomsky fala sobre o poder de manipulação que a mídia exerce nos Estados democráticos modernos, os quais procuram fazer que o povo seja impedido de conduzir seus assuntos pessoais e que os canais de informação sejam estreita e rigidamente controlados. Ele diz como essa noção de Estado democrático se desenvolve e por que e como o problema da mídia e da desinformação se insere nesse contexto.\n- http://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:8_1D2KCSJS5KFM9j47kS8T12FWkByzfj9q4P/M+dia+Propaganda+pol+tica+e+manipula+o",
				"added": 1550427512
			}
		]
	},
	"comment_vote": {}
}