{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_18ZfPCaU1pYAeos3A7YhZVgtsmXqXeRRW7": 1,
		"1_1GnAPT8ioRWpyqDkKrjLp1woEG3TBQgt87": 1,
		"2_12pnvfwuwBJJ3cFfbMEhZTQUod2qYUCKfb": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1_1GnAPT8ioRWpyqDkKrjLp1woEG3TBQgt87": [
			{
				"comment_id": 1,
				"body": "Pensées partagées. Moi ce qui m'embête grandement c'est que j'ai l'impression d'être dans une bulle, partagée par un petit nombre de personnes, qui ont, comme moi, vraiment conscience des problèmes, et qui, par un tel constat, savent qu'il faut agir, et que c'est surtout la seule chose à faire. Le plus exaspérant c'est sûrement de connaître les solutions possibles et de voir à quel point notre société est rétrograde.",
				"added": 1463588832
			}
		],
		"2_12pnvfwuwBJJ3cFfbMEhZTQUod2qYUCKfb": [
			{
				"comment_id": 2,
				"body": "Je suis pour, on a tous besoin de mettre notre esprit critique à l'épreuve :) !",
				"added": 1463674105
			},
			{
				"comment_id": 3,
				"body": "up4 :\n> Moi je me lance: je crois que le futur de l'hétérosexualité en général et de la femme en particulier est dans un bocal de formol au musée d'histoire naturelle.\nJ'ai pas tout compris mais moi ça m'a fait penser à la manif pour tous. Je me demandais de quel droit s'opposent-ils au droit du mariage pour chacun ?\n> Ce projet entend ainsi supprimer légalement l’altérité sexuelle et remettre en cause le fondement de l’identité humaine : la différence sexuelle et la filiation en résultant. Il ouvre la voie à une nouvelle filiation « sociale », sans rapport avec la réalité humaine. Il crée le cadre d’un nouvel ordre anthropologique, fondé non plus sur le sexe mais sur le genre, la préférence sexuelle.\nOk, merci les sexistes. S'ils avaient de se questionner un peu plus, il pourrait voir que la majorité des drames que l'humanité a connu sont pas mal liés à cette entêtement à vouloir différencier les êtres.\nVivement le jour où l'homme et la femme seront considéré comme simples humains.",
				"added": 1463674577
			},
			{
				"comment_id": 4,
				"body": "> [up4](#comment_7_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz): Moi je me lance: je crois que le futur de l'hétérosexualité en général et de la femme en particulier est dans un bocal de formol au musée d'histoire naturelle. C'est essentiellement là-dessus que je me fait censurer dans le monde et le web commercial. Comme se sont fait censurer Michel Foucault, les proto-moines pâcomiens et à peu près tous les philosophes depuis l'invention de l'écriture. Merci de votre compréhension.\n\nJ'ai pas tout compris mais moi ça m'a fait penser à la manif pour tous. Je me demandais de quel droit s'opposent-ils au droit du mariage pour chacun ?\n> Ce projet entend ainsi supprimer légalement l’altérité sexuelle et remettre en cause le fondement de l’identité humaine : la différence sexuelle et la filiation en résultant. Il ouvre la voie à une nouvelle filiation « sociale », sans rapport avec la réalité humaine. Il crée le cadre d’un nouvel ordre anthropologique, fondé non plus sur le sexe mais sur le genre, la préférence sexuelle.\n\n(source : http://www.lamanifpourtous.fr/qui-sommes-nous/notre-message/)\n\nOk, merci les sexistes. S'ils avaient de se questionner un peu plus, il pourrait voir que la majorité des drames que l'humanité a connu sont pas mal liés à cette entêtement à vouloir différencier les êtres.  \nVivement le jour où l'homme et la femme seront considéré comme simples humains.",
				"added": 1463674739
			}
		]
	},
	"comment_vote": {
		"1_18ZfPCaU1pYAeos3A7YhZVgtsmXqXeRRW7": 1
	}
}