{
	"next_comment_id": 28,
	"user_name": "ZeroLSTN",
	"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
	"post_like": {
		"1LrDWSzi63MhST9ZNkefSPJGFAuByRMeCx_1516580163": 1516700122,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1516948592": 1516951523,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1517140017": 1517191611,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1517124069": 1517192728,
		"1Lvvv3N4dEvhQpTYf1NN72eY5BTSH3Kh1F_1519365325": 1519380371,
		"1LhnZbDzKdeA3ynoB7uYqmE6q4pHhbmXkp_1519452749": 1519455557,
		"12w3zJ6gRrcAw2kSCQXDkorgqxuXnkKkF8_1528221371": 1528231353,
		"1FKuNsExQML7APuNmkCV8uzB5pKupcmnck_1528217971": 1528231359,
		"1FKuNsExQML7APuNmkCV8uzB5pKupcmnck_1528293662": 1528308546,
		"1FKuNsExQML7APuNmkCV8uzB5pKupcmnck_1528906271": 1528913964,
		"1FKuNsExQML7APuNmkCV8uzB5pKupcmnck_1528549518": 1528913968,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1536336220": 1536425468,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1540051503": 1540051538
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Binchan: Yeah I'm aware. I've gotten rid of the 'Songs' tab for now to prevent the home page locking up.",
			"post_uri": "1LrDWSzi63MhST9ZNkefSPJGFAuByRMeCx_1516580163",
			"date_added": 1516700144
		},
		{
			"comment_id": 2,
			"body": "Thanks Lxpz, I'm seeding them as well. \"Imported From ZeroMusic\" isn't really a genre though :P However I understand the inability to sort through all of it.\n\nOnce anyone can edit metadata, we'll be able to fix up titles and stuff. Unfortunately if we allow anyone to move songs from genre to genre (essentially deleting on one genre and uploading to the other), that would give anyone to ability to delete a song which is not what we want. Perhaps we can get a community effort in moving the songs from the 'Imported' genre to where they actually belong.",
			"post_uri": "1LrDWSzi63MhST9ZNkefSPJGFAuByRMeCx_1516580163",
			"date_added": 1516700460
		},
		{
			"comment_id": 3,
			"body": "@Lxpz: I'd rather just do a wiki-like version where anyone can edit anything, as doing bookkeeping for suggestions for edits which could be accepted or rejected would be more work, plus the original uploader may never come back to see it.\n\nI'm also interested, since batch-file uploading isn't yet supported, how did you upload all these songs? Did you write a script to edit your data.json?",
			"post_uri": "1LrDWSzi63MhST9ZNkefSPJGFAuByRMeCx_1516580163",
			"date_added": 1516788560
		},
		{
			"comment_id": 4,
			"body": "@Lxpz: Oh neat, had no idea this was written. Hopefully won't be necessary in the future. I'm also looking into scanning ID3 tags from the website itself on upload as there's a JS implementation.",
			"post_uri": "1LrDWSzi63MhST9ZNkefSPJGFAuByRMeCx_1516580163",
			"date_added": 1516832986
		},
		{
			"comment_id": 5,
			"body": "Looks like a good start. Some Wiki-markdown like the infobox not being parsed but I assume we can do that manually. A couple spelling/grammar mistakes as well but those are easy to fix. Also the yellow on the left is a bit jarring. Maybe something a lot lighter, so your attention is immediately focused on the article rather than the sidebar when the page loads. Overall starting to look like a reality, awesome work!",
			"post_uri": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1516948592",
			"date_added": 1516951688
		},
		{
			"comment_id": 6,
			"body": "@ZeroLSTN: Also looks like @Nofish currently holds the ZeroWikipedia.bit name reservation? :P",
			"post_uri": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1516948592",
			"date_added": 1516951775
		},
		{
			"comment_id": 7,
			"body": "@Git Center: \n\n> I do parse this, just found a reason why not boxes are parsed.\n\nSweet.\n\n> Hope you will help me when I will be about to release this.\n\nFor sure man! Let me know when a good time is to do a full pass over all the strings.",
			"post_uri": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1516948592",
			"date_added": 1516956883
		},
		{
			"comment_id": 8,
			"body": "I've created a PR with the *one* typo I found on the main zite :)\n\nThere were a few typos which I couldn't find in Kiwipedia's code, as they are likely part of the hub instead, which isn't on Git Center:\n\n\"adding a new article to English version\" -> \"adding a new article to **the** English version\"\n\n\"For latest version\" -> \"For **the** latest version\"\n\nAwesome work on the zite!\"",
			"post_uri": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1517124069",
			"date_added": 1517192726
		},
		{
			"comment_id": 9,
			"body": "/me looks on with interest.",
			"post_uri": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1517138040",
			"date_added": 1517193136
		},
		{
			"comment_id": 10,
			"body": "@Git Center: Do you have any diff'ing between different article versions or are you just storing the full text of the article over and over again?\n\nTo save space, you could have the full text of the article stored somewhere that is globally editable by any user (if possible), then diff revisions would be stored in user's data folders. This way you get the benefit of saving space over storing entire revisions over and over again with only minor changes, without the overhead of processing all of those revisions to build the full article again on every page load. You would only need to do any processing if someone was viewing the history.\n\nMy only concern there is if someone edits the page, then more edits pile on top, then someone deletes their edit and sign/publishes, making all edits afterwards invalid. I wonder if there's a way to get around that without storing the entire page text on every edit.\n\n@Ssdifnskdjfnsdjk: Just browsing around once the auto-importers up should be sufficient.\n\nAlso may enlist you once ZeroLSTN has metadata-editing ;)",
			"post_uri": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1517140017",
			"date_added": 1517193564
		},
		{
			"comment_id": 11,
			"body": "@Git Center: That could work... I'd be interested to see how that plays out in reality.",
			"post_uri": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1517140017",
			"date_added": 1517207711
		},
		{
			"comment_id": 12,
			"body": "> Instead, genres are too large to be maintained by one person and too different to be wanted to seed.\n\nI don't get this point. The \"maintainer\" of the genre doesn't really have to do anything, they are just the key holder to the data contained within. Other people can upload to a genre and edit the song/album/artist metadata themselves.\n\n @Gobottheelphant: Are you suggesting one merger zite per album? A single album is much less likely to be seeded than an entire genre, plus it would clutter one's ZeroHello if they had 200+ album zites in the sidebar.\n\n> Moreover, some songs may apply to several genres.\n\nThis is true, perhaps I'll add a way to tag a song with multiple genres, but it really can only be stored under one. That's ok though, because if you like Hip Hop and a song that's Hip Hop/Jazz comes with it, that should still be within your realm of interested. It would be cool to be able to download all Hip Hop/Jazz songs if you added the Jazz or Hip Hop genre, but I don't think that's technically feasible.",
			"post_uri": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1517513583",
			"date_added": 1517533420
		},
		{
			"comment_id": 13,
			"body": "@Jetten: Yeah ZeroNet has issues if you don't pass along the right headers because all ZeroNet sites are in an iframe. CORS treats it as a separate origin due to that. Adding the correct headers should be the solution, not many instances of Access-Control-Allow-Origin.",
			"post_uri": "195oGGXB8AhwWSoXFHpbVT4TL4wLi1Af5e_1518132542",
			"date_added": 1518252298
		},
		{
			"comment_id": 14,
			"body": "Welcome!",
			"post_uri": "1Lvvv3N4dEvhQpTYf1NN72eY5BTSH3Kh1F_1519365325",
			"date_added": 1519380378
		},
		{
			"comment_id": 15,
			"body": "hai",
			"post_uri": "14J2zzJT5Pm7ng7qzL31ReYcm8hxMoX3XU_1519312598",
			"date_added": 1519419107
		},
		{
			"comment_id": 16,
			"body": "Command line tools will be super useful, thanks!",
			"post_uri": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1520012334",
			"date_added": 1520027540
		},
		{
			"comment_id": 17,
			"body": "> is there a way to masstag everything? like batch tag the general or other values since sometimes it's just youtube rips with partial tagging (using my own script)\nNot yet, but I'll add an issue for it on the issue tracker. It is on my TODO list as it's kind of a pain in the butt to tag things one-by-one (just like it was with uploading one-by-one).\n\n> also some sort of language filter will be good idea\n\nYes, especially as more music comes online. Not sure if there's any way to filter the music besides asking people to tag the language when they upload (mass-tagging will help immensely with this as well).",
			"post_uri": "1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K_1528107764",
			"date_added": 1528108432
		},
		{
			"comment_id": 18,
			"body": "@Thunder: \n\n> also links will be nice so i can share a specific album/songs/my playlist\n\nAt the moment you can just copy the page URL to share an album or an artist. There is a dedicated button on the playlist page, but I'll add one for albums and artists as well. You can track that [here](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/view/?1Code5125iycoEFCMi9a4XVejFwauoyGqj/12@16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj). Linking to a specific song requires some design though. Should the song just start playing once you've navigated to the link? Maybe take them to the album page? Or perhaps the Now Playing page? Let me know your thoughts on this here or the [issue page](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/view/?1Code5125iycoEFCMi9a4XVejFwauoyGqj/8@16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj).\n\n> also can you help me investigate something, if you go to albums there and search \"minecraft volume\" you can see two duplicated entries for two of these same volumes dunno what caused it\n\nI'm only seeing \"Minecraft Volume Alpha\" and \"Minecraft Volume Beta\". If this is still an issue, try rebuilding your database from the ZeroNet sidebar.\n\n> and how do i label things that i have no clue what the title, author, album is? i have one album of songs and only thing i know is it's played on \"hang\" and where i got if off the streets(sadly hardcover lost)(highly likely to be independent artist)\n\nYeah, this is sort of an unknown at the moment. Just leave it blank for now and we'll figure something out.\n\n> and how does the edit other's songs works? since you dont own their entry and wont that be open to potential abuse\n\nEach edit is non-destructive. The site determines the most recent edit to a song and displays that. I'll probably show edit history per-song in the future.\n\n> EDIT: also some way to set \"seed all\" or seed limit related, it's PITA to go to each age and set seeding enabled\n\nSomeone mentioned this earlier, yeah. Will definitely be making a page with toggles for each decade. Issue [here](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/view/?1Code5125iycoEFCMi9a4XVejFwauoyGqj/13@16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj).",
			"post_uri": "1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K_1528107764",
			"date_added": 1528150559
		},
		{
			"comment_id": 19,
			"body": "Do you have a source code repository somewhere so we can see what it's doing?",
			"post_uri": "12w3zJ6gRrcAw2kSCQXDkorgqxuXnkKkF8_1528221371",
			"date_added": 1528231352
		},
		{
			"comment_id": 20,
			"body": "@Thunder: \n\n> the ability to be able to tag things, like instrument_piano has_singer music_only and description?\n\nThis is a good idea. Some set properties like title, genre, etc, and then generic tags. Description is a good idea too, as is lyrics which someone mentioned earlier. [New issue here](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/view/?1Code5125iycoEFCMi9a4XVejFwauoyGqj/20@16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj).\n\n> also tag a whole album(which only apply to the album showing in search not the songs inside\n\nThis is kind of hard at the moment, as there isn't technically an *album* object. Albums are just built out of songs that have the same album. I could have an artist/album combo represent an album, but then if someone renames the album then that link no longer exists. Will need to think about that one more.\n\n> also info bubble/hover long enough to show description for things like \"this song is part of a compilation album\" means also help new users out\n\nMmm, maybe. I do have tooltip support and I agree we should explain everything we can, though not sure if compilation album is something that needs explaining. It is shown in the album view, though we might not have any compilation albums yet to demo that.\n\n> site translations would be nice too, if you need chinese translators ill volunteer\n\nYes, this will definitely be needed. I need to build the infastructure first, and it's more of a priority 2 instead of a 1 at the moment, but still one of the top things on my list. [Issue here](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/view/?1Code5125iycoEFCMi9a4XVejFwauoyGqj/22@16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj).\n\nThanks for all these suggestions btw, they're awesome!",
			"post_uri": "1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K_1528107764",
			"date_added": 1528232570
		},
		{
			"comment_id": 21,
			"body": "@Jamesholden: That works, but isn't super frictionless to view. For the future GitCenter or some other site with browsable source files is definitely recommended for getting possible contributors/issues/feedback :)",
			"post_uri": "12w3zJ6gRrcAw2kSCQXDkorgqxuXnkKkF8_1528221371",
			"date_added": 1528232682
		},
		{
			"comment_id": 22,
			"body": "@Jamesholden: If you're familiar with git it's no different, just do\n\n```\ngit remote add origin /home/user/zeronet/data/yourgitcentersite/znqa.git\n```\n\nAnd then git push'ing will push directly to that file. Then simply hit the 'Sign and Publish' button on Git Center and off your repo goes!",
			"post_uri": "12w3zJ6gRrcAw2kSCQXDkorgqxuXnkKkF8_1528221371",
			"date_added": 1528232906
		},
		{
			"comment_id": 23,
			"body": "You can add multiple repos and push to both at the same time. Might be easiest to run a `git push -f` first just to overwrite any garbage history the repo has.",
			"post_uri": "12w3zJ6gRrcAw2kSCQXDkorgqxuXnkKkF8_1528221371",
			"date_added": 1528244106
		},
		{
			"comment_id": 24,
			"body": "@Thunder: \n\n> maybe using album IDs?\nas in a song can be in an album by it's ID(or the other way around or both ways)\n\nSo we could generate an album ID when you uploaded a song, but what if the user renames the Album to something else? Would a new album ID be generated, unless there was an existing one? This could also be useful for sending people links to albums/artists that don't change when someone renames an album...\n\n> maybe reworking the genre system into tags but i doubt there's any improvement that could be done, other then an offsite wiki for how to tags to set the standards for easy searching, and also what each tag means\n\nSome *booru sites get away with just letting the users figure it out and make new tags, and things work. Definitely helps to suggest tags while they type though, and have a few categories of required ones (like genre).\n\n> yes lyrics will be good, maybe option to import via clearnet? like a button that says \"try search lyrics over clearnet and contribute to this entry\"\n\nAs long as there's an easy API to hook into, I don't see why not.\n\n> also i have a question on how to add album art after they have been submitted?\n\nThere's a button for it on the edit page (Upload Art), but at the moment it's not working. Let me fix that :)\n\n> maybe there should be like a section of wishlist? maybe as a LSTN talk for contributing songs and talks on how to contribute\n\nhttp://127.0.0.1:43110/Talk.ZeroLSTN.bit/ ;)",
			"post_uri": "1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K_1528107764",
			"date_added": 1528501120
		},
		{
			"comment_id": 25,
			"body": "Judging from the URL: http://127.0.0.1:43110/ZeroLSTN.bit/?/album/NightWish%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20/Wishmaster\n\nIt looks like the artist tag had some spaces tacked on the end. I've fixed the songs and now trim tags before uploading them.\n\nThanks for reporting!",
			"post_uri": "1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1528563881",
			"date_added": 1528571859
		},
		{
			"comment_id": 26,
			"body": "你见过的电脑总数是多少？ 这似乎真的很高，但。",
			"post_uri": "1KGtYK158PoXNdtmu8agaYvw7A9F2K9S97_1528642583",
			"date_added": 1528653222
		},
		{
			"comment_id": 27,
			"body": "Can't publish to any peers it seems. I do have latest master of plugin installed.",
			"post_uri": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1536336220",
			"date_added": 1536425487
		}
	]
}