{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1568893908,
			"title": "Tor (FIREFOX) BROWSER is not anonymous. Do NEVER use it.",
			"body": "MOZILLA Firefox browser leaves open backdoors for government surveillance. You are all exposed.",
			"added": 1568893907
		},
		{
			"topic_id": 1570044887,
			"title": "Saudis own mainstream social media, Hollywood, and the Democratic Party.",
			"body": "https://qz.com/519388/this-saudi-prince-now-owns-more-of-twitter-than-jack-dorsey-does/\nThe MUSLIMS arab saudis are those who set the rules of what you can say or not say, criticize or not criticize on social media and ALL media. And since the LEFT are all in favor of the arab muslims invasion, your twitter and facebook account gets banned if you criticize the LEFT.  Zeronet is the obvious place for RIGHT people to speak freely and uncensored. Whyle you chase the supposed russia connection to the Trump election, you miss the SAUDI connection to the Obama election and to Hillary Clinton campaign, to the UN, to the hollywood studios productions, to the american tv companies (ABC, CBS, NETFLIX, even FOX) productions where the black, the latinos and the MUSLIMS are depicited as the good and clever ones while in reality it's the opposite.",
			"added": 1570044885
		},
		{
			"topic_id": 1570659602,
			"title": "MAMA Make America Muslim Again. And not just America...",
			"body": "http://www.bbc.com/culture/story/20190620-how-muslims-became-the-good-guys-on-tv",
			"added": 1570659599
		}
	],
	"topic_vote": {
		"1569419442_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": 1,
		"1569697321_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": 1,
		"1569767202_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1570755525_1PY5FP1G6QNSCsA8nM1SjuXiPWZnQhQj9P": 1
	},
	"next_comment_id": 21,
	"comment": {
		"1568405412_14BhfodWhzPjujQB97t8A5R4r59T7iqopJ": [
			{
				"comment_id": 1,
				"body": "what's the news?",
				"added": 1568672334
			}
		],
		"1568893908_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd": [
			{
				"comment_id": 2,
				"body": "> [filips](#comment_209_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): What are you talking about? Again nonsense statements without any proofs. [...]\n\nThere is no perfectly safe browser. If there was one, the us government would shut it down and make it disappear or force the company to distribute it with some 'bug' that can be exploited. I'm using one that in my opinion is better and more safe than mozilla firefox.  One point of my safety is by not revealing which one it is.\nAs some know, the only way of being truly anonymous is by hiding ip addres. The only way of hiding ip address is by NOT having one. The only way of not having one is by a public free wifi hotspot (or stolen credential for a private wifi). also a computer you buy with cash, without any hdd or ssd, and run by a live os, and some more shrewdness. We can hide from our isp and from our local police and local government, which is something, but we will never hide from the big corporation espionage and big government intelligence. I'm using a windows 10 OS, so i'm basically screwed. But i don't mind. I'm pefectly aware that i'm not completely anonymous. I'm doing nothing worth the attention of the cia/fbi, mi6 or the mossad. They surely have the means to find me. But since i'm not a threat to anybody...",
				"added": 1568924525
			},
			{
				"comment_id": 4,
				"body": "> [funman](#comment_8_12nYWrJ4WfemBx1sC1w3wTUJsX7iSkTv4c): I'd much rather use firefox than edge or chrome or ie or safari - sure firefox may have some bugs, but less bugs than any other proprietory browser.  Id have to see some proof of that - bring up the code for the backdoor, explain how you know it's a backdoor, show us you even know anything about what you are talking about.\n\nforensics KNOW exactly which browser you are using with Tor because Tor RECOMMENDS Mozilla Firefox. If you switch browser you gain an advantage. I guess better stay away from Chrome or Opera. There are others valid open source web browsers.",
				"added": 1568984078
			}
		],
		"1569149074_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 5,
				"body": "The only way to 'cure' pedophilia is to prevent it. Sterilize pedophiles before they breed. Because all human behaviours is genetic determined/inherited. The issue is to find the pedophiles. Unless you stop criminalizing them, so they come to the light and declare themselves without being afraid of imprisonment or social shun/hate. before doing that you should seriously ask yourself if all the kids will be ok with that. Thing is, some kids do enjoy premature sex with adults, they actively seek for it. Are they also to be cured? And what do we call their 'condition'? It's called teleiophilia. What do we do to those sick kids? Do we arrest them too? Do we have to 'cure' them too?",
				"added": 1569180716
			}
		],
		"1568753767_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 9,
				"body": "I love Freenet. But it's slow. So i had to switch to zeronet. And because i'm banned from facebook and from twitter",
				"added": 1569268898
			}
		],
		"1569169868_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3": [
			{
				"comment_id": 7,
				"body": "if it's a leftist/liberal/democrat/communist/marxist, i have the sacred duty to mute him/her. They already own google, facebook, twitter and all the rest of the shitnet",
				"added": 1569185008
			}
		],
		"1567252307_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 8,
				"body": "> [kasgjwogksdojgsk](#comment_2_15uXDCC8pjPpGGMz8DZiNC2mPyqBWN2wuj): Pro-tip: If you're from a country that's been at odds with the country you're living in, and part of a religion that's been at odds with the majority population of the country you're living in... move.\n\nif you are part of a muslim religion, then.. DIE!!!",
				"added": 1569195588
			},
			{
				"comment_id": 10,
				"body": "> [maximiliano](#comment_1_123P4aaXmDecX21RXdXmMwRg8gmDuXupmQ): Anyone who accepts the killing of a group of people because of their religion is as bad a person as a murderer\n\nIf you 'religion' is about converting others to your religion or i die, or i go to hell, or something bad may happen to me, or i'm damned, or i'm an infidel... then you are a serious obstacle to peace and civilization and you have to be killed, before you cause any more pain.",
				"added": 1569358648
			},
			{
				"comment_id": 13,
				"body": "> [dieinyourrage](#comment_1_1JYv14XBkng6zGFmkhkdyS3FmyvDUZgrRA): Die in your rage, your rage and hatred towards Islam only increases the faith of the believers. Your lunacy is stupid as well as humorous. The spread of Islam into your lands only causes you rage and anger and Monotheism will continue to spread until the final hour.\n\nWait untill you see the spread of my hatred into islam land, with the final destruction of Mecca.",
				"added": 1569452096
			}
		],
		"1569339504_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 11,
				"body": "Google is at the end of the road. A business cannot thrive if it doesn't meet the requests of the customers. Since Google is become a political instrument, it has ceased to be a good business. And it will die. Like Facebook did. The company will soon fall on the stock market. The market has rules. They can cheat the rules for some time, but on the long run companies will pay the mistakes. The Market is an unforgiving beast.",
				"added": 1569367407
			}
		],
		"1569442712_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": [
			{
				"comment_id": 12,
				"body": "the type of government makes no difference. It's the people that makes the difference. A dictatorship in a country full of good pelople is better than a democracy in a country full of bad people.",
				"added": 1569450779
			}
		],
		"1569810770_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 14,
				"body": "Google sucks. I advertise business and Google truly sucks at advertising my business. Google is useful to find an address. Nothing else. Yandex search is way better than google. Bing is also better than google. Facebook is total shit (as the stock market demonstrate). It's good for nothing, except for what it was intended in the first place, keeping in contact with friends and relatives. Except Whatsapp is quickly taking it's place.",
				"added": 1569875873
			}
		],
		"1570208803_137P7ceKGpm24X9C5mxNmp1bCkQpY8vWAh": [
			{
				"comment_id": 15,
				"body": "TOR. TOR has been made just for that by the US government.",
				"added": 1570217230
			}
		],
		"1571110186_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 16,
				"body": "The chinese government is tracking moslems. I think this is very good. Whoever thinks this is good, has my full support. I hope one day soon the US government start tracking moslems just like China do. And i hope one day soon, both governments join forces in the fight against this plague.",
				"added": 1571173226
			},
			{
				"comment_id": 20,
				"body": "> [testuser3](#comment_15_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg): The CCP is Nazi party(Chinazi),they do everything what ever German Nazi  did.https://qz.com/1715719/hong-kong-protesters-defend-their-use-of-nazi-imagery/“Making this term ‘Chinazi’ is to send a warning to the world: if we do not stop the CCP (Chinese Communist Party), the deaths and the tragedies will probably keep happening,” he said. “The victims may not only be the Chinese people, the Hongkongers, the Taiwanese, but may be you. The history of German Nazi surely repeat itself.”\n\nwhat's wrong with the nazi? they were the good guys.",
				"added": 1571433904
			}
		],
		"1571178755_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 17,
				"body": "Which one is worse, China or Saudi Arabia?",
				"added": 1571180666
			}
		],
		"1570044887_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd": [
			{
				"comment_id": 18,
				"body": "FBI is an American crime drama television series created by Dick Wolf and Craig Turk that airs on CBS, where it premiered on September 25, 2018.[2] The series is produced by CBS Television Studios and Universal Television, with Wolf, Arthur W. Forney, Peter Jankowski, and Turk serving as executive producers. The series features an ensemble cast including Missy Peregrym, ZEEKO ZAKI, Jeremy Sisto, Ebonée Noel, Sela Ward and Alana de la Garza.\nBorn into a multi-generational law enforcement family, Special Agent Maggie Bell commits deeply to the people she works with as well as those she protects. Her partner is Special Agent Omar Adom \"O. A.\" Zidan, a West Point graduate from Bushwick who spent two years undercover for the DEA before being cherry-picked by the FBI.\n\nZeeko Zaki (born January 18, 1990)[1][2] is an American actor best known for his role portraying Omar Adom \"O. A.\" Zidan on Dick Wolf's FBI.[3]\n\nZaki was born in Alexandria, Egypt, and emigrated to the United States at one month of age.[1][4] Zaki's maternal grandparents immigrated before him and his parents.[2] His extended family remained in Egypt, and Zaki visited his hometown during the summers of his childhood.[5]\nZeeko Zaki is a practicing MUSLIM.[2][4][5] Zaki speaks both English and ARABICfluently.[4]",
				"added": 1571263131
			},
			{
				"comment_id": 19,
				"body": "> [whyamihere](#comment_14_19VWN3686xhWFFoEMoXWuGSKtx7TuhQanY): SOURCE:http://www.truedemocracy.net/hj33/08.html [...]\n\npeople see jews everywhere. it's a mass delusion. if there were extraterrestrials from another planet, i bet they would be jews too.",
				"added": 1571269393
			}
		]
	},
	"comment_vote": {
		"2_1MTxJHycYg5VBaCZUPg96nZt3RAYsrKJBe": 1,
		"124_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"200_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"46_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": 1,
		"25_19MNueeefmtMbBKPCdqtB8UnQmZC8QwLJX": 1,
		"42_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": 1,
		"397_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"8_1Dv4WujRBuQiwcfAGHy3aLQxVe3S68xtpc": 1,
		"3_1D9mg5Mzk96FBLEkjCxabcydfY4Bbp3nmG": 1,
		"1_1G7SmMgyvuYxnyYFqDrUzP1aWEnUdh6jSr": 1,
		"13_17EbpUZgWWK4fHVsp4fPuTphiBkSZ16cZu": 1,
		"5_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1,
		"2_19s8EgXft8KuYsk9tEGgnmLo3Kcmw3ME5E": 1,
		"3_19s8EgXft8KuYsk9tEGgnmLo3Kcmw3ME5E": 1,
		"4_19s8EgXft8KuYsk9tEGgnmLo3Kcmw3ME5E": 1,
		"61_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": 1,
		"32_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": 1,
		"190_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"130_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1
	}
}