{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1620075300,
			"title": "[MEGA POST 2] the downfall of the usa !!! (what happened to the first one???)",
			"body": "",
			"added": 1620075299
		},
		{
			"topic_id": 1620117334,
			"title": "The Criminalization of Dissent",
			"body": "One of the hallmarks of totalitarian systems is the criminalization of dissent. Not just the stigmatization of dissent or the demonization of dissent, but the formal criminalization of dissent, and any other type of opposition to the official ideology of the totalitarian system. Global capitalism has been inching its way toward this step for quite some time, and now, apparently, it is ready to take it.\n\nGermany has been leading the way. For over a year, anyone questioning or protesting the “Covid emergency measures” or the official Covid-19 narrative has been demonized by the government and the media, and, sadly, but not completely unexpectedly, the majority of the German public. And now such dissent is officially “extremism.”\n\nYes, that’s right, in “New Normal” Germany, if you dissent from the official state ideology, you are now officially a dangerous “extremist.” The German Intelligence agency (the “BfV”) has even invented a new category of “extremists” in order to allow themselves to legally monitor anyone suspected of being “anti-democratic and/or delegitimizing the state in a way that endangers security,” like … you know, non-violently protesting, or speaking out against, or criticizing, or satirizing, the so-called “New Normal.”\n\nNaturally, I’m a little worried, as I have engaged in most of these “extremist” activities. My thoughtcrimes are just sitting there on the Internet waiting to be scrutinized by the BfV. They’re probably Google-translating this column right now, compiling a list of all the people reading it, and their Facebook friends and Twitter followers, and professional associates, and family members, and anyone any of the aforementioned people have potentially met with, or casually mentioned, who might have engaged in similar thoughtcrimes.\n\nYou probably think I’m joking, don’t you? I’m not joking. Not even slightly. The Federal Office for Protection of the Constitution (“Bundesamt für Verfassungsschutz”) is actively monitoring anyone questioning or challenging the official “New Normal” ideology … the “Covid Deniers,” the “conspiracy theorists,” the “anti-vaxxers,” the dreaded “Querdenkers” (i.e., people who “think outside the box”), and anyone else they feel like monitoring who has refused to join the Covidian Cult. We’re now official enemies of the state, no different than any other “terrorists” … or, OK, technically, a little different.\n\nAs The New York Times reported last week (German Intelligence Puts Coronavirus Deniers Under Surveillance), “the danger from coronavirus deniers and conspiracy theorists does not fit the mold posed by the usual politically driven groups, including those on the far left and right, or by Islamic extremists.” Still, according to the German Interior Ministry, we diabolical “Covid deniers,” “conspiracy theorists,” and “anti-vaxxers” have “targeted the state itself, its leaders, businesses, the press, and globalism,” and have “attacked police officers” and “defied civil authorities.”\n\nMoreover, back in August of 2020, in a dress rehearsal for the “Storming of the Capitol,” “Covid-denying” insurrectionists “scaled the steps of Parliament” (i.e., the Reichstag). Naturally, The Times neglects to mention that this so-called “Storming of the Reichstag” was performed by a small sub-group of protesters to whom the German authorities had granted a permit to assemble (apart from the main demonstration, which was massive and completely peaceful) on the steps of the Reichstag, which the German police had, for some reason, left totally unguarded. In light of the background of the person the German authorities issued this “Steps-of-the-Reichstag” protest permit to — a known former-NPD functionary, in other words, a neo-Nazi — well, the whole thing seemed a bit questionable to me … but what do I know? I’m just a “conspiracy theorist.”\n\nAccording to Al Jazeera, the German Interior Ministry explained that these querdenking “extremists encourage supporters to ignore official orders and challenge the state monopoly on the use of force.” Seriously, can you imagine anything more dangerous? Mindlessly following orders and complying with the state’s monopoly on the use of force are the very cornerstones of modern democracy … or some sort of political system, anyway.\n\nBut, see, there I go, again “being anti-democratic” and “delegitimizing the state,” not to mention “relativizing the Holocaust” (also a criminal offense in Germany) by comparing one totalitarian system to another, as I have done repeatedly on social media, and in a column I published in November of 2020, when the parliament passed the “Infection Protection Act,” which bears no comparison whatsoever to the “Enabling Act of 1933.”\n\nThis isn’t just a German story, of course. As I reported in a column in February, The “New Normal” War on Domestic Terror is a global war, and it’s just getting started. According to a Department of Homeland Security “National Terrorism Advisory System Bulletin” (and the “liberal” corporate-media propaganda machine), “democracy” remains under imminent threat from these “ideologically-motivated violent extremists with objections to the exercise of governmental authority” and other such “grievances fueled by false narratives” including “anger over Covid-19 restrictions.”\n\nThese Covid-denying “violent extremists” have apparently joined forces with the “white-supremacist, Russia-backed, Trump-loving “Putin-Nazis” that terrorized “democracy” for the past four years, and almost overthrew the US government by sauntering around inside the US Capitol Building without permission, scuffling with police, attacking furniture, and generally acting rude and unruly. No, they didn’t actually kill anyone, as the corporate media all reported they did, but trespassing in a government building and putting your feet up on politicians’ desks is pretty much exactly the same as “terrorism.”\n\nOr whatever. It’s not like the truth actually matters, not when you are whipping up mass hysteria over imaginary “Russian assets,” “white-supremacist militias,” “Covid-denying extremists,” “anti-vax terrrorists,” and “apocalyptic plagues.” When you’re rolling out a new official ideology — a pathologized-totalitarian ideology — and criminalizing all dissent, the point is not to appear to be factual. The point is just to terrorize the shit out of people.\n\nAs Hermann Goering famously explained regarding how to lead a country to war (and the principle holds true for any big transition, like the one we are experiencing currently):\n\n“[T]he people can always be brought to the bidding of the leaders. That is easy. All you have to do is tell them they are being attacked and denounce the pacifists for lack of patriotism and exposing the country to danger.”\n\nGo back and read those quotes from the German Interior Ministry and the DHS again slowly. The message they are sending is unmistakeably clear. It might not seem all that new, but it is. Yes, they have been telling us “we are being attacked” and denouncing critics, protesters, and dissidents for twenty years (i.e., since the War on Terror was launched in 2001, and for the last four years in their War on Populism), but this is a whole new level of it … a fusion of official narratives and their respective official enemies into a singular, aggregate official narrative in which dissent will no longer be permitted.\n\nInstead, it will be criminalized, or it will be pathologized.\n\nSeriously, go back and read those quotes again. Global capitalist governments and their corporate media mouthpieces are telling us, in no uncertain terms, that “objection to their authority” will no longer be tolerated, nor will dissent from their official narratives. Such dissent will be deemed “dangerous” and above all “false.” It will not be engaged with or rationally debated. It will be erased from public view. There will be an inviolable, official “reality.” Any deviation from official “reality” or defiance of the “civil authorities” will be labelled “extremism,” and dealt with accordingly.\n\nThis is the essence of totalitarianism, the establishment of an inviolable official ideology and the criminalization of dissent. And that is what is happening, right now. A new official ideology is being established. Not a state ideology. A global ideology. The “New Normal” is that official ideology. Technically, it is an official post-ideology, an official “reality,” an axiomatic “fact,” which only “criminals” and “psychopaths” would deny or challenge.\n\nI’ll be digging deeper into “New Normal” ideology and “pathologized totalitarianism” in my future columns, and … sorry, they probably won’t be very funny. For now I’ll leave you with two more quotes. The emphasis is mine, as ever.\n\nHere’s California State Senator Richard Pan, author of an op-ed in the Washington Post: “Anti-vax extremism is akin to domestic terrorism,” quoted in the Los Angeles Times:\n\n“These extremists have not yet been held accountable, so they continue to escalate violence against the body public … We must now summon the political will to demand that domestic terrorists face consequences for their words and actions. Our democracy and our lives depend on it … They’ve been building alliances with white supremacists, conspiracy theorists and [others] on the far right …”\n\nAnd here’s Peter Hotez in Nature magazine:\n\n“The United Nations and the highest levels of governments must take direct, even confrontational, approaches with Russia, and move to dismantle anti-vaccine groups in the United States. Efforts must expand into the realm of cyber security, law enforcement, public education and international relations. A high-level inter-agency task force reporting to the UN secretary-general could assess the full impact of anti-vaccine aggression, and propose tough, balanced measures. The task force should include experts who have tackled complex global threats such as terrorism, cyber attacks and nuclear armament, because anti-science is now approaching similar levels of peril. It is becoming increasingly clear that advancing immunization requires a counter-offensive.”\n\nWe’ll be hearing a lot more rhetoric like this as this new, more totalitarian structure of global capitalism gradually develops. Probably a good idea to listen carefully, and assume they mean exactly what they say.\n\n#\n\nCJ Hopkins\nMay 3, 2021",
			"added": 1620117332
		}
	],
	"topic_vote": {},
	"next_comment_id": 30,
	"comment": {
		"1619906359_1HGKXBnrJs6kTo2QqTUMYEicDsSwrYqwKN": [
			{
				"comment_id": 1,
				"body": "> [deuxzaron](#comment_141_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): Take to laundromat. Drop in washer. Hit delicate cycle. profit.\n\nI would love to have such a delicate sense of humor :). Fabric softener? and the last word, priceless... \n\n\n> [lol69420](#comment_5_1NAU3T4B9DxPjPssPvtrg8fDSzYi7CxGPf): Mild soap, no spin cycle.\n\nI see, contrarian? I would have say the silk program for perfect finish...",
				"added": 1620069509
			},
			{
				"comment_id": 9,
				"body": "https://www.youtube.com/watch?v=M6qEee1_4fw (1:07)",
				"added": 1620071549
			}
		],
		"1619248411_1LQt9gDDNMnknHDQ43S4WYaXxocLyFzpVd": [
			{
				"comment_id": 2,
				"body": "> [lol69420](#comment_4_1NAU3T4B9DxPjPssPvtrg8fDSzYi7CxGPf): Makes sense that species acclimated to ice age earth would have problems surviving in the Holocene warming period.  Every day species go extinct and come into being.  This is business as usual.  It does not represent some kind of crisis for the biosphere.\n\nwrong, reread : The current rate of extinction of species is estimated at 100 to 1,000 times higher than natural background extinction rates.\n\nHolocene is to be understood in the context or period of the mass extinction of native species of the earth, linked to the explosion of the human population and it's inability to handle itself properly or harmoniously or generously, or lovingly with the rest of the creation... due mainly to the hypergamic nature of the human female... and the inability of the human male to resist to such drive, and surrender to hindmind... leaving the earth barren like in the movie wall-e.\n\n>The Holocene extinction, otherwise referred to as the sixth mass extinction or Anthropocene extinction.\n\nhttps://en.wikipedia.org/wiki/Holocene_extinction\n\nI know, it doesn't fit the co2 narrative...",
				"added": 1620069949
			}
		],
		"1619989133_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 3,
				"body": "> [diurpagissa](#comment_90_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK): wait for the nth wave, it will be devastating as in georgia stones was written\n\nfinally someone able to read... it's in 7 languages I guess... so not too hard. it's clear, but maybe to be clearer georgia guide stone or stones? maybe monument? \n\nI am curious to know if the guidestoners see themselves as supremacists or not, meaning if they believe themselves to be able to achieve their utopia or if they will themselves self perish in their project? \n\nthen, I am little bit curious in their approach regarding wmds... nuke plants, bls4+ labs etc... LEE... life extinction event isn't such a conspiracy... happen of in the galaxy... \n\nand so there I guess the more radicalized current, of no human on earth... so the guidestoners have at least a two front war... one humanity (expanding exponentially etc) and the nihilist (or absolutist)... and even the absolutists won, who knows what the chimps would do... so will they kill the chimps? and if the chimps are killed, it's expected that the squids and others octopuss will soon learn to walk and then fly... maybe, they already do... \n\nbut to get back to the key point, it's about sharing, or preserving... it's easy to say, but very hard to do... a lot fears, from the wild...",
				"added": 1620070311
			}
		],
		"1619964755_1NJcfEP5FK4bJrR2Kfb4t5hNP9ox4bpcVJ": [
			{
				"comment_id": 4,
				"body": "the latest babel tower... hopeless.",
				"added": 1620070369
			},
			{
				"comment_id": 14,
				"body": "and one thing I hate even more, is that this uno agendas, and all the policies, are lowering in nature... they never seek to emulate the bests, but rather, lower what is currently most appropriate to the subpar standards of others... \n\nthe \"equality\" to the lower common denominator concept... \n\nslow the 1st world, for the 3rd world to catch up... it doesn't work like this... look at cell phones... only wall street and dod could afford them, now, who hasn't one? \n\na lack of trust in the competitive nature of the free market... free but regulated... regulated it's not on the how it's traded, but what, or more exactly what isn't appropriate to trade... forbidden, banned... excluded, not there... go away kuffars...",
				"added": 1620074566
			}
		],
		"1619824684_1HtGhiVHZwMd5UW9SyW6uWb91Tsy4gcxo1": [
			{
				"comment_id": 5,
				"body": "> Flynn took a 40-foot leap off a cliff to retrieve two soldiers stranded in the ocean and bring them back to shore to be airlifted. \n\nWhat did flynn do before 2000? moon base? stargate sg1? who knows... because there is a gap : https://en.wikipedia.org/wiki/Michael_Flynn#U.S._Army\n\nI was looking for if flynn was on Operation Desert Shield  or Desert Storm... ahhh finally... the stormtroopers are back ! only the sands reveals...",
				"added": 1620070753
			}
		],
		"1615487471_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 6,
				"body": "mehyko",
				"added": 1620070777
			}
		],
		"1616487804_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 7,
				"body": "for archives : \n\n>I understand what Alex is saying about the globalist’s agenda, but he’s missing a MAJOR key factor in this. No human being is capable of doing this, not because people don’t have the capacity for such evil, but because they’re simply not capable of devising such a brilliant plan. This, and I mean ALL of this, is from their “ET” overlords, (aka Seraphim celestial hive minds who are looking for a new host). These entities are every real, they are NOT interplanetary beings, they are inter dimensional beings, HOWEVER, they are from actual stars. This might sound nuts, but I have scientific evidence to back my claims... here’s how it works. There are ancient stars in the universe that are actually conscious... a prime example of an entity like this would be the Hindu God shiva, the biblical seraphim, or DMT sacred geometry entities... they’re either dying and about to completely crystalize, or they’re about to be sucked into a black hole’s event horizon... either outcome would reduce them to light memory. So what they do, is offshoot plasma time crystals (ufo) that will carry their consciousness in the form of silicone based, hive minded beings, to another host which must be a planet inhabited by sentient beings that can be assimilated for the download of consciousness. They will achieve this via an artificial virus or viral vector (which btw are quantum capable and hive minded) and then by a silicone based biotech serosurveillance system. We are carbon based beings, these are scilicone based beings that come from a crystalline core of a star... carbon + scilicone = crystal. Once you take that mark (i.e. the quantum dot tattoo), you are now able to store light information like a quantum computer, and can thus be assimilated by the celestial entity that will operate like a quantum AI from a database stemming from the earth’s core which is also crystal, causing the earth to operate like a massive quantum Qubit with males and females in superposition. I have proof!!\n\ninteresting theories... at this level, it's chaintheories... a lot of premises, but very very innovative and creative !!! but we want the proofs of theory ! \n\n> [lol69420](#comment_6_1NAU3T4B9DxPjPssPvtrg8fDSzYi7CxGPf): I too do not like it when they try to turn the frikkin frogs gay.\n\nexactly, part of the holocene mass extinction, or the so called roman water pipe situation... \n\nthat's the real issue, with knowledge, comes power, but this technological knowledge without consciousness, or love, sharing, caring etc... can quickly end up in a death trap... and frankly those in the void of the stars, may really have been super exceptional and lucky... at one point, so many chances to blow it all, not in a few millenials and already for humans at the current rate, but on million years scale... \n\nit's so important to learn to say NO...\n\nif eve... or adam... hmhmmm",
				"added": 1620071113
			},
			{
				"comment_id": 8,
				"body": "no offensive resistance is the path of the Christ... there is no harder path... but as long as the temporal consequences are explained... and the boiling phiraonic oil is a poignant example... more power to you... but you won't keep it... some in Rome took those statements at face value. you said, you want, you get, and let's make money along the way... \n\nmany say they can chew, but few can talk a walk they never took...",
				"added": 1620071284
			}
		],
		"1618427843_1Mx9Lz182swtKLQBaBRfvjH9kr3tmUoFaH": [
			{
				"comment_id": 10,
				"body": ">Taliban spokesman Zabihullah Mujahid issued the following statement: \"As withdrawal of foreign forces from Afghanistan by agreed upon May 1st deadline has passed, this violation in principle has opened the way for [Islamic Emirate of Afghanistan] Mujahidin to take every counteraction it deems appropriate against the occupying forces.\"\n\nit's very clear... \n\n>Afghanistan's defense ministry counted over 100 Taliban insurgents killed over the prior 24 hours in a statement on Sunday, at a moment the US is said to have started the process of withdrawal. The statement counted a further 52 Taliban wounded. Separately an attack on the Ghazni military outpost left at least 17 national soldiers dead and some 25 captured, according to international reports.\n\nyou have to be crazy to even think occuyping the \"janahists\" on their home turf... imagine if they had the best sol air defense system in the world...  \n\n>\"The Mujahidin of IEA will now await what decision the leadership of Islamic Emirate takes in light of the sovereignty, values and higher interests of the country, and will then take action accordingly, Allah willing.\"\n\nhttps://www.zerohedge.com/geopolitical/taliban-declares-open-season-americans-weekend-fighting-erupts-scores-dead-wounded\n\non personal note, I saw some females going to the hairdressers, done by the other females, and for me as long as it's not all day long, meaning a few hours, I could tolerate this :) ahahahah.\n\nit's again fundamentally a question of respect, care, tradition, culture and faith... \n\nhow are the two last jews (they are enemies, the rumor goes) going? if the jewish ultra ortodox chosed the armed way? hmmm... \n\none sure it's a very complicated situation, but for me a critical aspect is the role of the medium of exchange in trade, in regards to the hypergamic nature of the human female, and the lack of resistance of most males...\n\nthe craziest people in this story, imho, are those attempted to social engineered afghans... it's suicide, without janah... ridicule... empty, as their promises... \n\nit's really sad that the afghans, and I mean the talibans, don't have more modern weaponery... already symetry would be fun, but if they had the hedge over america... lol... \n\nand the sadest is how it's a giant failure, with such lives, sweat, blood, members, and wealth...\n\nfundamentally, it's impossible for america, as gov system to export democracy : pedogate.\n\namerica should clean itself, and mind it's own business...",
				"added": 1620072188
			},
			{
				"comment_id": 11,
				"body": "and guess what? bidet, will certainly too change it's mind, as the next (if there is) and so on...",
				"added": 1620072217
			}
		],
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 12,
				"body": "I ask myself if Israel couldn't support the talibans? heheheh...  they believe. then I don't say there may not be an issue with the last mosk on earth, but they believe... and they didn't took at least to my knowledge position on eretz... \n\nthey seem to consider afghanistan as their holly land... \n\nthe second point is about this \"increased faith, incompatible with military service concept\"... is it in relation with ihmran (islamic certainly badly worded and even less understood concept)? I may have heard that during it, it lowered? \n\njokingly : the more you pray and study the books, the more pious you get? or closer to ... ? interesting... \n\n\"the flame of the faith\"?\n\nin those secular societies... it's almost as if only numerical wealth counted... which some call recently the \"stimmies\"... who knows what it could be...",
				"added": 1620072554
			},
			{
				"comment_id": 28,
				"body": "elie chouraki, is one of the most stupid and dangerous \"jew\" I ever saw on tv... hall of fame.\n\nI explain, I quickly zapped on i24fr... and saw sahara markbrouk, journalist of a still boycotted propaganda framework (cnews, fr disinformation and anger/despair generating channel). \n\nWhat was she saying that lead me to write this post :\n\nin simple term, she is an agent of euromagrhebian... \n\nhow? she pretends that the agents of \"moussa\" minister of interior in france, are always and forever just (like the nazis said about the SA, we all know that some SS betrayed their orders, and had to be executed :)).\n\nfurthermore she is one of those criminalizing words, like laura loomer.\n\nnow you add those 3 concepts together and what do you get?\n\nthe establishment of the eurabian police state force.\n\nto reexplain as some have really serious iq problems :\n\nmake speech illegal, create idea : cops always and forever best, just just servant of the law, take over the law, impose and replace the native population, using invaders as cops, etc... \n\n I wont use the term eurabia, as those conducting this aren't arabs.\n\nas you know I am a big supporter of the orthodox world, however they better not think to impose their ways, laws, culture, etc on me... unless I chose to live among them and as such would of myself attempt to impose them on me with their help... \n\npassing by... \n\nand really a big mistake is to only see nazism, through the prism of the eugenist policy is a big yuge mistake, masking a lot of what was the political ambition... for me it's mostly and above all : national socialism... aka nazi... \n\nthat's the problem most state face, to not become nazi jew/infirm/wanderers/etcgenocidists...\n\nI am in the other camp  : liberty and specially the \"don't thread on me\", I won't on you, rest assured, I am too buzy to even think about it...",
				"added": 1620116745
			},
			{
				"comment_id": 29,
				"body": "(what's funny is that I am almost certain that those who censored the mega post about the downfall of the usa, have 0 chance, almost, to be able to prevent this post to reach tel aviv... none what so ever, the next maybe... but not this one when submit is clicked... now? later, when)...\n\nterrible...",
				"added": 1620116909
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 13,
				"body": "clarissa wards is a bio terrorists... you do know that it's air born and use any soft wet tissue, like the eyes? so why no full gears? double mask in a red zone... they teach you nothing at cnn or what? it's full gears /on... no shame... it's life.\n\nis it my fault that the indians, chose to reach this point? no... they make their beds, they sleep in it.\n\nand that a major issue I have with uno game plan...",
				"added": 1620074360
			}
		],
		"1619555817_14z94p9VMTXLV7CAdS4MD6ZmHWLzSCSe8w": [
			{
				"comment_id": 15,
				"body": "cats defense forces, knows only in matching power (sometimes) : the dogs allied united fronts... it's gonna be mercyless... there are clear boundaries that will be set there... I am sure CDF will be way way way more astute... there is no fucking way... it's not even red lines, those are cats lines... \n\ndogs will kill and often feed...\n\ncats, too, but play too :).\n\ndead or alive, who cares, make it move !",
				"added": 1620074890
			},
			{
				"comment_id": 16,
				"body": "the ubris of some to believe their lives was worth more than even the corpse of a dead car, a dreamin...\n\nwhen the cats spirits lead you to the path of war, even the dragon watches...\n\nmadness...",
				"added": 1620075014
			},
			{
				"comment_id": 27,
				"body": "what would happen to those who come after the doggies of the queen of england and all possession thereoff?  I believe that she would be way recklesser than for the aggressors of all those british children, like in telford...",
				"added": 1620116127
			}
		],
		"1617871050_1HLrjtGEat9GB6HSJRmm2ivRbvSnQy6F37": [
			{
				"comment_id": 17,
				"body": "prion warfare... so violent...",
				"added": 1620075068
			}
		],
		"1617968655_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 18,
				"body": "where is the fbi...\n\n> [styromaniac](#comment_3053_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Pedocrats\n\naccurate terminology.",
				"added": 1620075128
			}
		],
		"1620075300_1AEUvcwh6yyUse45jWaK5NqrVwkWrgm7bZ": [
			{
				"comment_id": 19,
				"body": "it was to try to understand the idea behind the war on so called \"white supremacism\"... my guess is that it's part of the uno strategy to flood the \"west\" with invaders...",
				"added": 1620075362
			},
			{
				"comment_id": 20,
				"body": "scandale that the original mega post : the down fall of the usa...",
				"added": 1620075419
			},
			{
				"comment_id": 21,
				"body": "it's gone...",
				"added": 1620075440
			},
			{
				"comment_id": 22,
				"body": "they can censor everywhere...",
				"added": 1620075453
			},
			{
				"comment_id": 23,
				"body": "on the other hand it's stupid as what is censored will naturally attract more attention, otherwise why take the time to censor something?",
				"added": 1620075484
			},
			{
				"comment_id": 24,
				"body": "this digital world is such a trap...",
				"added": 1620075508
			},
			{
				"comment_id": 25,
				"body": "at least I agree on that with those guidestoners... they would have put their combat pledge on the internet, it would have already memory holed, however, you have to be concise...",
				"added": 1620075605
			},
			{
				"comment_id": 26,
				"body": "and that leads me to the idea to grave a mini stone, a put in in front (north) of their monuments with simply :\n\nNO\n\nwritten on it... maybe on a slick face... but natural... a mini menhir... a micro celtic stone... \n\nat the exact distance north of where the longest shades reach, so that the little no stone is always light up :)\n\nanyway...",
				"added": 1620075746
			}
		]
	},
	"comment_vote": {}
}