{
	"next_topic_id": 9,
	"topic": [
		{
			"topic_id": 1520915070,
			"title": "More details on Tor options in ZeroNet",
			"body": "I'm aware of the FAQ but am looking for more information on how the latest version of Zeronet uses Tor in default mode, and what the difference is to the \"everything through Tor\" mode that is optional. How are onion services used if no Tor client is installed separate from ZeroNet?",
			"added": 1520915069
		},
		{
			"topic_id": 1520942114,
			"title": "ZeroNet not connecting through Tor on Mac",
			"body": "TorBrowser is running and available through SOCKS on port 9150 but ZeroNet doesn't get any data when I switch to \"everything through Tor\" mode. Suggestions?",
			"added": 1520942112
		},
		{
			"topic_id": 1544944813,
			"title": "ZeroNet vs Dat/Beakerbrowser",
			"body": "Does anyone have thoughts on or links to comparing ZeroNet to Dat & Beakerbrowser as a P2P alternative for the centralized web? Would love to read a detailed comparison of both archtectures.",
			"added": 1544944810
		},
		{
			"topic_id": 1545026098,
			"title": "How to change default ZeroNet browser that gets launched when starting the app?",
			"body": "I'd like ZeroNet to launch in TorBrowser by default.",
			"added": 1545026094
		},
		{
			"topic_id": 1545029431,
			"title": "Has the ZeroNet client been security audited?",
			"body": "I keep reading about how insecure it is to use ZeroNet, and others replying that \"all you have to do is run it through Tor only\". Has there been a third-party security audit to catch major bugs?",
			"added": 1545029426
		},
		{
			"topic_id": 1545042706,
			"title": "Tool to create clearnet mirrors on ZeroNet?",
			"body": "Is there a tool or service that makes it easier to create mirrors of clearnet websites and keep the up to date? Would be useful to make sure content from the centralized web remains accessible.",
			"added": 1545042700
		},
		{
			"topic_id": 1545043571,
			"title": "Adding films to ZeroNet Play?",
			"body": "Who gets to curate the movies included in ZeroNet Play? Is there a  similar zite that anyone can add content to? I'm aware of ZeroUp.",
			"added": 1545043564
		},
		{
			"topic_id": 1545642302,
			"title": "Best blogging and wiki platform on ZeroNet?",
			"body": "What's the best blogging tool and wiki that works well on ZeroNet? I've seen an old version of TiddlyWiki here -- is anyone running the latest version? Is there a better wiki for ZeroNet that allows multiple people to edit it, and maybe even supports user accounts? Thanks",
			"added": 1545642294
		}
	],
	"topic_vote": {
		"1520915070_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": 1,
		"1542422330_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"1543348094_16VrCKQQiVZpJ6S5xJASR8LCFLv24M5bfn": 1,
		"1542440901_1PWTu9NnYyjJy5NsqnFt2NvwhQZPSyRV1h": 1,
		"1544703954_1GHXQ3vMtadfHFjTwS3roqYe8LUsyDqN8f": 1,
		"1543862269_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1544944813_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": 1,
		"1528403696_1DbNJYiNELNpS2BbYMXa3mkRz8jrSbm9hc": 1,
		"1536069895_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": 1,
		"1541312581_1CCFrYzi8UsmLJsqZiN69ft2jDDqH2JqvJ": 1,
		"1545167966_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1545287200_1FqHbECdkkaK3ixwJMqE5UJJxpfzZk1nhX": 1,
		"1549224277_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1,
		"1548887246_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1547014808_1JGp4gaBwTZ6rjuLytHJ1o9C93kfk7UQiD": 1,
		"1563929280_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	},
	"next_comment_id": 15,
	"comment": {
		"1520942114_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": [
			{
				"comment_id": 1,
				"body": "Nevermind, got it sorted thanks to the comments in this Reddit thread: https://www.reddit.com/r/zeronet/comments/81hl1o/help_setting_up_zeronet_with_tor_browser_on_mac/",
				"added": 1520943249
			}
		],
		"1542440901_1PWTu9NnYyjJy5NsqnFt2NvwhQZPSyRV1h": [
			{
				"comment_id": 2,
				"body": "I think it depends how you define \"most advanced\". It depends on what the problem is you are trying to solve. Check out Dat/BeakerBrowser for another approach that prioritizes speed and reliability over anonymity.",
				"added": 1542452723
			}
		],
		"1544944813_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": [
			{
				"comment_id": 3,
				"body": "> [timelinehyperbot](#comment_88_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): The .Dat (Beakerbrowser) has some benefits over ZeroNet in some ways; HOWEVER, ZeroNet is a better option. [...]\n\nThanks for your reply, but I'm not sure how it shows that ZeroNet is a better option. The challenge of reaching a critical mass before P2P content is always available in the network is the same in both cases, except I'm not sure if ZeroNet offers a pinning service like Hashbase on Dat. The main differences I see so far are:\n\n- ZeroNet has Tor support out of the box, while Dat has no anonymity protections except when you use a VPN\n- ZeroNet has more discovery features built in\n- Dat has its own browser (Beakerbrowser) which makes for better URL handling than ZeroNet\n- Dat may be more scalable due to a bittorrent-based architecture, but I'm not sure how that really compares to ZeroNet\n- ZeroNet has a much bigger community, but Dat & Beakerbrowser seems to have more active developers\n- Anything else?",
				"added": 1544951059
			},
			{
				"comment_id": 4,
				"body": "> [timelinehyperbot](#comment_89_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): I'm not sure if you are trying to rant or do not understand my point. [...]\n\nSorry, I didn't mean to rant :) Beakerbrowser also seeds websites you visit, just like ZeroNet. Maybe that's why I didn't quite catch your argument. Didn't mean to sound dismissive.",
				"added": 1544956417
			},
			{
				"comment_id": 5,
				"body": "> [schiz0](#comment_46_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k): to proxy my zitesI make a dat:// site from zite's directorythen I archive it on HashBaseso it became accessible from clearnet [...]\n\nThat's cool!",
				"added": 1544973647
			},
			{
				"comment_id": 6,
				"body": "> [thunder33345](#comment_362_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): personally i feel like zeronet is more web focus and dat protocol is a more \"all round\" thinglike zeronet is build for web in minddat can be used without webbasically boils down to:are you using it for a website, if yes use zeronet else use datdat seems to be more versatile at the cost of less focus to web side of things\n\nYou're right that Dat is file-focused, but with Beakerbrowser it seems just as suitable to publish websites as ZeroNet is. Or is there a fundamental difference?",
				"added": 1544976149
			},
			{
				"comment_id": 7,
				"body": "> [timelinehyperbot](#comment_90_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): np, I thought initially that Beakerbrowser was an excellent idea as well as IPFS...  I have looked at how I could host a simple website that was either on a blockchain or distributed via a network...  I had learned that such was not nearly as simple as what a great many people claim. [...]\n\nI didn't realize that submitting form content is a challenge in either of these architectures. Interesting.",
				"added": 1544976196
			},
			{
				"comment_id": 8,
				"body": "> [timelinehyperbot](#comment_91_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): Yes there is a fundamental difference...  Traffic of people who would initially come across your content.  If no one see your .dat website as there is NO community of people who are simple just checking out new stuff it becomes a REAL issue...  With a .dat website the other people who visit do not automatically mirror / seed your site...  Your computer needs to be on 24/7...   [...]\n\nThanks for elaborating! How does ZeroMail work if you can't have private account data on Zeronet?",
				"added": 1545025641
			},
			{
				"comment_id": 9,
				"body": "> [timelinehyperbot](#comment_91_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): Yes there is a fundamental difference...  Traffic of people who would initially come across your content.  If no one see your .dat website as there is NO community of people who are simple just checking out new stuff it becomes a REAL issue...  With a .dat website the other people who visit do not automatically mirror / seed your site...  Your computer needs to be on 24/7...   [...]\n\nYou're right that ZeroNet does a great job onboarding people because you immediately see community activity after starting it, thanks for ZeroTalk. Beakerbrowser has no such thing. In terms of seeding, it seems pretty similar to me. The issue with private accounts and dynamic content you mentioned are beyond my understanding, but it would be a real bummer of Dat was architecturally incapable of serving dynamic websites.",
				"added": 1545025909
			},
			{
				"comment_id": 12,
				"body": "> [thunder33345](#comment_365_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): see, lets say your account has nws_pubkey as pub key, nws_privkey as priv keyi can send you something encrypted with nws_pubkey which you can decrypt with the priv key [...]\n\nThanks for the explantion -- that reminds me of BitMessage.",
				"added": 1545043410
			}
		],
		"1545026098_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": [
			{
				"comment_id": 10,
				"body": "> [tusiko](#comment_32_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs): When Zeronet launches, it opens the default browser. To change to the Tor browser, you have to change the default browser of your system. But now every software opens this browser by default.To avoid this, you can prevent Zeronet from starting a browser. I open the Tor browser manually and ZeronetHello is the default starting page.\n\nGot it, thanks.",
				"added": 1545033204
			},
			{
				"comment_id": 11,
				"body": "> [tusiko](#comment_32_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs): When Zeronet launches, it opens the default browser. To change to the Tor browser, you have to change the default browser of your system. But now every software opens this browser by default.To avoid this, you can prevent Zeronet from starting a browser. I open the Tor browser manually and ZeronetHello is the default starting page.\n\nHmm, it seems the setting is ignored on macOS. Even when that option is disabled, ZeroNet always launches Safari. Known issue?",
				"added": 1545033296
			}
		],
		"1545043571_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": [
			{
				"comment_id": 13,
				"body": "And what's the difference between Play and Play+ ?",
				"added": 1545045708
			}
		],
		"1545029431_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": [
			{
				"comment_id": 14,
				"body": "> [nekololi](#comment_327_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): if zeronet was not secure to use, running it in tor would probably not alleviate the security flaws. all tor does is anonymize your traffic. there has been no third party security audit for zeronet. i don't think there ever will be one? [...]\n\nI'm asking because there are a lot of users here from countries where accessing or sharing certain content can get you in serious trouble. A security audit could reduce the risk for de-anonymization attacks that would put these users at risk.",
				"added": 1545047233
			}
		]
	},
	"comment_vote": {
		"1140_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"4_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"33_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": 1,
		"29_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": 1,
		"362_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"398_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"555_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"113_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"32_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs": 1,
		"25_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ": 1,
		"99_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"557_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"566_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1_1AAAGerzGimCBY5z7h4U8kRfjjWbHMXhPP": 1,
		"49_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq": 1
	}
}