{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Chat P2P no navegador",
			"body": "Comunicação simples de duas vias e sinalização visual usando uma conexão peer-to-peer [WebRTC](https://en.wikipedia.org/wiki/WebRTC).\n\n- https://gateway.pinata.cloud/ipfs/QmSUrMmCZaFqotPRZokWMMYCZm6pocdfcCfHyFby9Jpi1w\n- https://github.com/jmcker/Peer-to-Peer-Cue-System.git\n\n#Atenção!\n\nWeb Real-Time Communication (WebRTC) é um conjunto de tecnologias padronizadas que permite que os navegadores da Web se comuniquem diretamente sem a necessidade de um servidor intermediário. Os benefícios da WebRTC incluem: velocidades mais rápidas e menos lag para aplicativos web, como bate-papo de vídeo, transferência de arquivos e transmissão em tempo real.\n\nNo entanto, quando dois dispositivos falam entre si diretamente via WebRTC, eles precisam conhecer os endereços IP reais uns dos outros. Em teoria, isso poderia permitir que um site de terceiros explore a WebRTC em seu navegador para detectar seu endereço IP real e usá-lo para identificar você. Isso é o que chamamos de vazamento de WebRTC.\n\nQualquer vazamento do seu endereço IP público é uma ameaça à sua privacidade, mas os vazamentos da WebRTC são menos conhecidos, facilmente ignorados, e nem todos os provedores VPN protegem você contra eles!",
			"added": 1577732824
		}
	],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1_18JXG9iYQk4vKHPTL8Wxoz3ERrA2J8riXW": [
			{
				"comment_id": 1,
				"body": "#Bate-papo [p2p](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Peer-to-peer.html) no navegador com criptografia [OTR](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Off-the-Record_Messaging.html)\n\n- https://otr.to/\n- https://github.com/OTRMan/otr.to-chat.git",
				"added": 1577733087
			}
		],
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": [
			{
				"comment_id": 2,
				"body": "#Sentido da vida\nO sentido da vida constitui um questionamento filosófico acerca do propósito e significado da existência humana. Segundo P. Tiedemann, ela demarca então a \"interpretação do relacionamento entre o ser humano e seu mundo\". Há uma quantidade inumerável de possíveis respostas para \"o sentido da vida\", frequentemente relacionadas ou com a religião ou com a filosofia. Opiniões sobre o sentido da vida podem por si próprias se distinguir de pessoa para pessoa, bem como também podem variar no decorrer da vida de cada ser humano. No entanto, de uma forma mais ampla, não existe consenso sobre tal.\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Meaning_of_life.html",
				"added": 1577733377
			}
		]
	},
	"comment_vote": {}
}