{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1,
			"title": "Pole",
			"body": "Pues eso, hijos de puta, dejad de saturar el ZeroTalk en español, que no es para eso. Propongo hacer este el espacio forocochero libre en ZeroNet.\n\nIlitri, hijo de puta.",
			"added": 1525344571
		},
		{
			"topic_id": 2,
			"title": "NO es NO +gif",
			"body": "jeje \n\nhttps://gfycat.com/gifs/detail/uncommonbitesizedgartersnake",
			"added": 1525351256
		},
		{
			"topic_id": 3,
			"title": "Webs de PELIS y SERIES en STREAMING",
			"body": "Podéis compartir las que conozcáis y las voy recopilando?\n\nEn inglés:\nhttps://ymovies.tv/\n\nEn español:\nhttps://www.plusdede.com/",
			"added": 1525362430
		},
		{
			"topic_id": 4,
			"title": "ESPAÑA es YA el país con MÁS USUARIOS en ZERONET",
			"body": "Las feminazis y la dictadura del pensamiento único han conseguido que ahora mismo haya más españoles huyendo de la censura que en la puta China comunista.\n\nhttps://s7.postimg.cc/5f4mj7sff/2018-05-04_12.53.40_pm.png",
			"added": 1525431377
		},
		{
			"topic_id": 5,
			"title": "Bienvenidos a 2018, bienvenidos a la era de ZeroNet",
			"body": "Podéis distribuir este texto a través de este enlace: http://telegra.ph/ZeroCoches-el-ForoCoches-descentralizado-e-inmune-a-la-censura-05-04\n\n-------------\n\nBienvenidos a 2018.\n\nBienvenidos a la era de la posverdad.\n\nBienvenido al control de medios, a la manipulación de las masas, y a la eliminación del pensamiento crítico.\n\nEstamos en guerra. Una guerra por el control del relato, una guerra por el futuro. Y una guerra que estamos perdiendo. En 2018, en la era digital, ya no es necesario asesinar al disidente, ni mucho menos. Basta con que una turba enfurecida te señale para eliminarte completamente.\n\nEs por ello que debemos reagruparnos, debemos cambiar nuestras estrategias, debemos huir del lugar que siempre ha sido nuestro refugio, Internet, y buscar uno nuevo.\n\nEste nuevo lugar tiene nombre, y se llama ZeroNet.\n\nAquí puedes encontrar más información.\n\nEsta nueva herramienta es muy poderosa y tiene implicaciones muy variadas. La primera y más obvia es que no existe un servidor central que la aloja, cada persona que se conecta a ella se convierte en un nodo que comparte todo el contenido como cuando descargas un archivo por Torrent.\n\nHoy día 4 de mayo de 2018 ha muerto oficialmente la libertad de expresión en ForoCoches. Su dueño se ha rendido ante las presiones externas en un comunicado que roza el ridículo. Poderoso caballero es Don Dinero y por primera vez en 15 años se pronuncia públicamente ante el riesgo de perder a sus anunciantes.\n\nPues bien, ha llegado el momento de decir basta a todo ello. Basta a que nuestras comunicaciones dependan de que el colectivo de moda decida presionar o no al dueño de un foro. Basta a que se eliminen cuentas de usuarios de forma injustificada según lo que le parece bien al administrador y a su -ya oficialmente reconocido- equipo de moderadores. Basta a que se plantee un buzón de reportes externos para contentar a una marabunta enfurecida.\n\nZeroNet tiene solo dos años de vida y todavía está en pañales. Aún así podemos disponer, desde ya, de un refugio digital que hará las veces de limitado foro. \n\nUna vez hastas instalado ZeroNet en tu ordenador podrás acceder a ZeroCoches pulsando aquí. También podrás encontrar un enlace desde el índice ZeroSites.\n\nBienvenidos a ZeroCoches. Bienvenidos a una nueva era.\n\nP.D. Es recomendable combinar el uso de ZeroNet con Tor.",
			"added": 1525435277
		},
		{
			"topic_id": 6,
			"title": "Dominio zerocoches.bit",
			"body": "http://127.0.0.1:43110/zerocoches.bit\n\nILITRI, PREPARATE",
			"added": 1525447279
		},
		{
			"topic_id": 7,
			"title": "TEFO a HOLLY CLOAR? +18",
			"body": "Fotos:\nhttps://ibb.co/dJNLin\nhttps://ibb.co/j8uY3n\nhttps://ibb.co/dEWrpS\nhttps://ibb.co/fk1P9S\nhttps://ibb.co/fWAvG7\nhttps://ibb.co/mqvvG7\nhttps://ibb.co/ci06On\nhttps://ibb.co/nmKBpS\nhttps://ibb.co/fgEY3n\nhttps://ibb.co/bO12w7\nhttps://ibb.co/gH0vG7\nhttps://ibb.co/koepb7\nhttps://ibb.co/heS9b7\nhttps://ibb.co/imj0in\nhttps://ibb.co/m9jY3n\nhttps://ibb.co/buYhw7\nhttps://ibb.co/k9U0in\nhttps://ibb.co/gACWpS\nhttps://ibb.co/djMfin\nhttps://ibb.co/gkpNw7\nhttps://ibb.co/gvwrpS\nhttps://ibb.co/cHe5G7\n\nVideos:\nhttps://openload.co/f/0Mj9nC3zxO4/2017-08-23_17.33.13.mp4\nhttps://openload.co/f/0ap6wcvCNQM/C314F42C-2346-47DC-87C5-2813543FADFB.MOV\nhttps://openload.co/f/mwhhkJYqCLU/DC82B3F1-1E32-4C5B-BC4D-850F98FD5874.MOV\nhttps://openload.co/f/b-ugUq2jex4/F817F423-38A1-48B9-9E29-66321705920B.MOV\nhttps://openload.co/f/dHfFmLERGjI/holly.mov",
			"added": 1525449996
		}
	],
	"topic_vote": {
		"1_17S5FgSs8aAVn11ZtHGpiskwmGbH4oRgJ5": 1,
		"2_17S5FgSs8aAVn11ZtHGpiskwmGbH4oRgJ5": 1,
		"1_1F2aEpJZEJQa9fCbr8r2szUoAjxriSriXT": 1,
		"5_17S5FgSs8aAVn11ZtHGpiskwmGbH4oRgJ5": 1
	},
	"next_comment_id": 25,
	"comment": {
		"1_1M7F6u6eucA1MoqsZWpT4XtP5iLzUHSn2b": [
			{
				"comment_id": 1,
				"body": "pole\n\nmenos mal que has creado el hilo, estaba pensando en que no funcionaba :roto2:",
				"added": 1525349665
			}
		],
		"1_12TyaKw4g16ddPsGsSzoHXHSRLXCEEQ6UH": [
			{
				"comment_id": 2,
				"body": "pero que dices hijo de puta, que cada uno se folle a la gorda que quiera",
				"added": 1525351886
			},
			{
				"comment_id": 3,
				"body": "> [ethereum333](#comment_5_1DB21GxzAgLKyWpKt8oYncmj7F7hbGFDYn): Pues yo no lo descargue pero estaba en yutu y tenia miles de visitas , alguien lo habra descargado seguro\n\npero si era una mierda :roto2:",
				"added": 1525355932
			},
			{
				"comment_id": 9,
				"body": "> [lamepingas](#comment_3_1LEiAd7VuRA4FLMBqcKU2Ay2CWX694P5Vp): Vídeo de YouTube: Fotos y vídeos cortos con el móvil unidos y con música de fondo. No sale nada raro, unas cuantas pavas en su día a día que si  cenando, que si haciendo mojitos, y fotos. Creo recordar que el vídeo era para celebrar un cumpleaños o para felicitar a una amiga. Habían subido una copia a ForoParalelo pero parece que TheErik se ha jiñao o se lo han borrado nose.\n\nQue alguien invite a TheErik! Aqui todos somos amigos, chico",
				"added": 1525358602
			}
		],
		"1_1Q9jUKoBpVsFgd3sWwURapdFnJcWcei7MU": [
			{
				"comment_id": 4,
				"body": "que yo sepa no se puede moderar nada, solo resetear la base de datos completamente (pero seguirías teniendo localmente una copia) o borrar la página entera (pasaría lo mismo).\n\nSobre los subforos, no. lo que cualquiera puede hacer es clonar este sitio y editarle un par de cosas, pero vamos, creo que ahora mismo pensar en eso es contraproducente con el poco trafico que hay. hablad aqui de cualquier cosa e ya.",
				"added": 1525356826
			},
			{
				"comment_id": 6,
				"body": "> [ripvapor](#comment_2_1PDo28BRpH6kZpuX2TwQHVAXC1XNNPPXpr): ¿Donde están todos los archivos locales? O sea, donde se guardan, para borrarlo todo, claramente\n\nEn la carpeta data, la localizacion depende de tu sistema operativo",
				"added": 1525357266
			},
			{
				"comment_id": 8,
				"body": "> [ripvapor](#comment_3_1PDo28BRpH6kZpuX2TwQHVAXC1XNNPPXpr): windows\n\nVeo por Reddit aqui, aunque es un mensaje antiguo c:\\SOFT\\Net\\ZeroBundle\\ZeroNet\\data\\ \n\npero vamos, estara donde tengas instalado zeronet",
				"added": 1525357516
			}
		],
		"2_17S5FgSs8aAVn11ZtHGpiskwmGbH4oRgJ5": [
			{
				"comment_id": 5,
				"body": "> [anonim0](#comment_7_1Q9jUKoBpVsFgd3sWwURapdFnJcWcei7MU): Cuál de las dos es?\n\ngafas",
				"added": 1525357060
			}
		],
		"1_1F2aEpJZEJQa9fCbr8r2szUoAjxriSriXT": [
			{
				"comment_id": 7,
				"body": "mis dies",
				"added": 1525357344
			}
		],
		"2_1DB21GxzAgLKyWpKt8oYncmj7F7hbGFDYn": [
			{
				"comment_id": 10,
				"body": "mefo a silvia barrera",
				"added": 1525359124
			}
		],
		"1_1JKAnMeMMvyfiLJCakGwUVyKE9yuetsrLR": [
			{
				"comment_id": 11,
				"body": ":flanders:",
				"added": 1525360741
			}
		],
		"3_1DB21GxzAgLKyWpKt8oYncmj7F7hbGFDYn": [
			{
				"comment_id": 12,
				"body": "pole bol zeta",
				"added": 1525361263
			}
		],
		"1_1JWNCmquAPBEirtg5X5Nq61541iNDjTdqE": [
			{
				"comment_id": 13,
				"body": "Aquí no se pueden subir vídeos per se, hay que enlazarlos desde fuera. Es un software pensado para la privacidad 100% y si se pusieran imágenes directamente aquí se podría rastrear la IP fácilmente desde fuera de Zeronet.",
				"added": 1525362685
			},
			{
				"comment_id": 14,
				"body": "> [josu](#comment_4_1JWNCmquAPBEirtg5X5Nq61541iNDjTdqE): sí, pero hay alguna plataforma aquí dentro dónde subir fotos y videos en vez de solo texto plano como lo que estamos haciendo ahora?\n\nTienes Hispachan http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/1fTdT3yTh6fJZcvhzrVY7PG2zqTthvWA4:hispachan:0",
				"added": 1525362987
			}
		],
		"1_1FwhwYBwon26Z5aWnpnQteWspmprCBuPTj": [
			{
				"comment_id": 15,
				"body": "Un puto planchabragas, ayer baneó a un shur que abrió un hilo sobre ZeroCoches en 3 minutos. Al muy subnormal le debieron entrar sudores fríos al pensar que la gente pudiera descubrir un lugar incensurable y lejos del control del pensamiento único.\n\nRealmente lo único que le ha hecho mover el culo por primera vez en 15 años ha sido que las feminazis han empezado a acosar a los anunciantes. Si no hubiera sido así habría pasado del tema, para variar.",
				"added": 1525430422
			}
		],
		"3_17S5FgSs8aAVn11ZtHGpiskwmGbH4oRgJ5": [
			{
				"comment_id": 17,
				"body": "Up, mas contribuciones pls",
				"added": 1525431197
			}
		],
		"1_1AAtVzfGMaNhYDCRcK66ZccerTxy5UPqqT": [
			{
				"comment_id": 18,
				"body": "0chan está muy bien pero al final no deja de ser un imageboard, no? Quiero decir, creo que zerotalk, que es todo lo cutre y limitado que puedas imaginar, es más foro que 0chan. También ocupará más espacio para todos con imágenes, etc. Todo es hablarlo o esperar que ZeroTalk se vaya desarrollando.\n\nNadie dijo que la libertad sería glamurosa.",
				"added": 1525439938
			},
			{
				"comment_id": 21,
				"body": "> [harvol](#comment_4_1JhhFzz2ED4Z8DR9eWnGAyib8LFn61ZTCC): Tienes razon, lo idea, seria mezclar 0chan y ZeroTalk. Me refiero a hacer un ZeroTalk con subforos en cuyos posts se puedan incrustar imagenes.\n\nLos subforos realmente se pueden hacer clonando este mismo y cambiando el \"General\" del título de un par de archivos por el título que se quiera. Y si eso podemos poner enlaces en todos para que se comuniquen unos con otros. Aunque yo, con el tema de subforos, no me metería todavía porque esto no tiene nada de tráfico.",
				"added": 1525447156
			}
		],
		"1_1Q2MDUJ54Qon73LRsrTovcweNsnRhpBcb8": [
			{
				"comment_id": 19,
				"body": "> [sactrta](#comment_1_1EnyNpK9Go2AqYTRvXXSW6cpBjG6yjQ8gx): Hola a todos. Yo soy nuevo. El motivo es que quiero sentir la experiencia de pertenecer a una comunidad libre. Eso espero al menos. Un saludo.\n\nBienvenido!",
				"added": 1525442060
			}
		],
		"1_1JJkfbPoQhrmjk6SpHWNf4MEEEWAwFv1C2": [
			{
				"comment_id": 20,
				"body": "http://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/",
				"added": 1525444088
			}
		],
		"6_17S5FgSs8aAVn11ZtHGpiskwmGbH4oRgJ5": [
			{
				"comment_id": 22,
				"body": "> [usuario](#comment_4_17Yr1nddo5LnE9vxbqAgJ6mK8kEBJZZbNz): Como se apaña un dominio asi?\n\nUtilizan la crypto namecoin. Aquí tienes info https://zeronet.readthedocs.io/en/latest/faq/#how-can-i-register-a-bit-domain. \n \nPara comprar el dominio puedes hacerlo de forma sencilla aquí en dólares (más barato que en el equivalente de namecoin o bitcoin de hecho) https://dotbit.me/ Una vez lo has comprado puedes transferírtelo a tu cliente o dejarlo ahí. Entonces le tienes que añadir a qué dirección de zeronet quieres que apunte así https://namecha.in/name/d/zerocoches\n\nUna vez tiene la dirección puesta, zeronet lo detecta automáticamente y crea la redirección en zeroname.",
				"added": 1525457807
			}
		],
		"2_1BxoC1C7mdBnZgCRtshd7pxQDfiJysFLBC": [
			{
				"comment_id": 23,
				"body": "Es una trolleada, no creo que existiera tal video",
				"added": 1527240324
			}
		],
		"3_12wH9Vw9gydwdHWQVRP1iZFpy9YyidBoHP": [
			{
				"comment_id": 24,
				"body": "+1",
				"added": 1527240344
			}
		]
	},
	"comment_vote": {
		"1_1BGWexcsjvPpnPZVmmioZvwBBQ3WoZsWuQ": 1,
		"20_17S5FgSs8aAVn11ZtHGpiskwmGbH4oRgJ5": 1
	}
}