{
	"title": "El Blog de Roberth Castaño",
	"description": "Articulos de interés, Tutoriales, Opinión, Programación, Producción musical, Arte Digital, entre otras cosas... ",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 7,
	"demo": false,
	"modified": 1453094652,
	"post": [
		{
			"post_id": 6,
			"title": "Agrega archivos grandes a tu blog por medio de webtorrent o BTorrent",
			"date_published": 1453093160.864,
			"body": "En el post anterior dí con la forma de agregar un vídeo o un archivo de audio desde un repositorio por medio de la etiqueta _video_ o _audio_ respectivamente, pero incluir estos archivos directamente a la página, provoca que la carga se incremente demasiado. \n\n---\n\nPara resolver este problema nos podemos valer de los torrents para repartir archivos mas grandes\n\n<script src=\"https://cdn.jsdelivr.net/webtorrent/latest/webtorrent.min.js\"></script>\n<script>\nvar client = new WebTorrent()\n\nvar torrentId = 'magnet:?xt=urn:btih:d68ab1df2b5bda23d19803035e9b537efc3a7e2d&dn=Dramatic+Chipmunk.mp4&tr=udp%3A%2F%2Fexodus.desync.com%3A6969&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Ftracker.internetwarriors.net%3A1337&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&tr=wss%3A%2F%2Ftracker.btorrent.xyz&tr=wss%3A%2F%2Ftracker.webtorrent.io'\n\nclient.add(torrentId, function (torrent) {\n  // Torrents can contain many files. Let's use the first.\n  var file = torrent.files[0]\n\n  // Display the file by adding it to the DOM. Supports video, audio, image, etc. files\n  file.appendTo('body')\n})\n</script>\n\n"
		},
		{
			"post_id": 5,
			"title": "Incluyendo audio & vídeo a tu post.",
			"date_published": 1450947633.034,
			"body": "Dí con esta solución por accidente. Al parecer, ZeroBlog tiene una forma rápida para incluir medios audiovisuales en el blog, lo que hay que saber es que el blog acepta código **html** por defecto así que es muy facil adjuntar este tipo de medios usando lo que ya sabes de programación web.\n\n---\n\n## Incluyendo vídeo:\n\n```\n<video controls> \n  <source src=\"video/small.ogv\" type=video/ogg> \n</video>\n```\n\nEl resultado se muestra a continuación\n<video controls> \n  <source src=\"video/small.ogv\" type=video/ogg> \n</video>\n\n## Incluyendo Audio\n\n```\n<audio controls>\n    <source src=\"audio/musica.ogg\" type=\"audio/ogg\">\n</audio>\n```\n\nPor cierto me gustaría saber si al usar este tipo de medios, se aumenta demasiado el tiempo de carga al momento de entrar a este blog, por que puede que siga subiendo mas contenido de este tipo y no quisiera saturar la carga de la página.\n\nEspero la información les haya servido."
		},
		{
			"post_id": 3,
			"title": "¿Cómo cambiar el ávatar de tu blog?",
			"date_published": 1450933012.176,
			"body": "Estaba frustrado tratando de encontrar la manera de cambiar el ávatar que trae por defecto ZeroBlog, intenté modificar el archivo all.js que viene con ZeroBlog pero esto hace que toda la página colapse. Afortunadamente he dado con la solución, gracias al blog de drwasho, \npueden visitar su blog aquí:\n\n---\n\n[Blog de drwasho en Inglés](http://127.0.0.1:43110/1NwdZCCLZSFZ7euWgYX6sUpGLUvgqHp64i)\n\nBueno, lo primero que se debe hacer es abrir el archivo `all.css` que se encuentra en la carpeta css de tu blog. luego busca la etiqueta:\n\n`.left .avatar {`\n\nA continuación busca un campo que diga:\n\n`image-rendering: pixelated;`\n\ny reemplázalo por:\n\n`background-image: url('data:image/png;base64,*****');`\n\nEn donde los asteriscos son la representacion de tu imagen en código base64. Dicho código lo puedes obtener subiendo tu imagen aquí:\n\n[Base64 Image Encoder](https://www.base64-image.de/)\n\nRepublica tu blog haciendo click en **Sign** y luego en **Publish** y ya está.\n\nTambien se puede cambiar la redondez de la imagen modificando los atributos del mismo selector css:\n\n- -webkit-border-radius\n- -moz-border-radius\n- -o-border-radius\n- -ms-border-radius\n- border-radius\n\nSí necesitas alguna explicación extra no dudes en comentar."
		},
		{
			"post_id": 1,
			"title": "¡Comenzamos!",
			"date_published": 1433033779.604,
			"body": "Hace ya un rato que quería subir mis aportes a ZeroNet, hoy por fin comenzaré a ejercer esa posibilidad y ese privilegio. ZeroNet es asombroso, una red p2p de una calidad sorprendente, bien ejecutada, dinámica, fácil de usar, visualmente atractiva y aunque tiene trabajo por delante, no deja de ser uno de los proyectos bandera para la liberación de nuestra información.\n\nEn este blog aportaré todo lo que esté a mi alcance, entre lo que voy creando hasta lo que me parece interesante compartir. Espero sea de su agrado."
		}
	]
}