{"next_post_id":134,"next_comment_id":42,"next_follow_id":31,"avatar":"png","user_name":"UndyingFirewall","hub":"1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v","intro":"The secret diary of a Russian yandere   guy and wannabe sysadmin who just can't take a calm breath at VK.","post":[{"post_id":1513178828,"body":"I will fight for people, not for goverment. Even if fighting for people will mean fighting with goverment.","date_added":1513178811},{"post_id":1518624601,"body":"Cyka blyat!","date_added":1518624582,"meta":"{\"img\":\"900,675,986a87976975875653654754865,01111111112200000001001111000002222234444200222222222222222332222222345678884444\"}"},{"post_id":1523535015,"body":"\"Becoming Yandere\" (finally complete)\nfor my very very good friend\n\nWhat's the worst? It's when\nYou have good things to do,\nYou wanna, but not authorized to!\n\"What's this?\", you definitely will say.\nFor instance, it's began on holiday.\nJust imagine: alarm clock is not set.\nLooks like it's fine but you are so upset!\nYou think, have a soft drink,\nThen realize:\nHometown! That's it!\nThat's why you memorized!\n\nOkay, hometown. You can forget the rest.\nYou think your mind again will do its best.\nFalling asleep, you hear a scream.\n\"That's all mistake!\" You're entering the dream.\nHometown again, you are in grandma's home.\nAnd grandma left. But you are not alone.\nYou look through the room, you hear a yell.\nYou follow it... AND SOMETHING I CAN'T TELL\nOccurs. You wake up feeling good.\nYou switch on your computer\nTo check your network neighborhood.\nWhile it starts up, let's make some tea.\nLook at the calendar... Two weeks before the IWD!..\n\nSo, who's online? The contact list is green entirely\nAlmost. One user is away. I was...\nOkay, set up a trigger and just wait.\nThree days past now, computer makes a noise.\n\"Hello, It's me, I...\" You interrupt\nAnd start hitting Backspace.\n\"Hello, how are you?\", you send.\nYou're worried despite she can self-defend.\n\"All is okay\", received by you next day.\n\"I'm just really was away\" ...Okay.\n\nNext day. It's workday. And she's absent.\n\"I'll save you! I wanna be your friend!\",\nIt fills your head. And this is what you say:\n\"I'm sorry, she can't come, she is still in a train\". \n\"Oh yeah, of course, did you mean the subway?\"\nSomeone is making fun of living further south.\nYou feel insulted, but don't open your mouth.\nYou write down everything she needs,\nGoing to home,\nYou report everything via your phone\nAnd go on with the routine...\nYou finish all your tasks, your \"mission\" is complete.\nIt's just for now, but you can go to sleep.\n\nYou start to fall asleep in your usual manner.\nWhat do you see? You're in a camp. It's summer.\nWho is this purple-haired girl next to the statue?\nShe comes to you. She carries a knife, prepare for a battle.\nBut all is OK 'cause she behaves nice.\nShe came to give you an advice.\nYou can't hear anything but you remember.\nA song... That's it! It's worth a try!\nLyrics are a bit off-topic, but you are going to rewrite.\n\nAwake again, you quickly take your phone.\nThe time is 4:20. You are logging on.\nYou have to find something,\nAnd so you go online\nYou look for it, then copy to text editor\nAnd begin to rewrite.\nTwo hours of typing, editing and online conversations.\nYou did it! Almost. It's like a reservation.\nThe IWD's next Tuesday - your plans're becoming real.\nYou will congratulate her, or I'll have to kill...\n\nThe IWD's today and all is learnt by heart.\nExit the subway... Look, things are going hard.\nSo, what you do? Maybe you leave a letter?\nIt'll be anonymous what's much more safe and better.\nThen goes the moment X and you're on the meeting point.\nBut where's she? What if you disappoint?\nThat was a while. And she's finally here.\nYou are confused, but then what's why to wear\nA special uniform? So, you go on. Looks like you're very honest.\nBecause it's true. You sing, and this is your confession.\nNew lyrics are a bit your self-presentation.\nYou finish. Then you see her face is shining.\nShe says \"thank you\". It's really worth your finding.\n\nNow you're happy - as it's not just you.\nHow did you guess? Nobody ever knew.\nYou go to home, today don't have to argue\nWith your homemates. But please, make a quick capture!\nBefore a stranger will message you.\nHe'll ask everything, then leak - again, nobody ever knew.\nYou are blackmailed. What a fucking shit!\nMoreover, it's online! You even can't delete!\nSo  you complain everything directly to her.\n\"I'm sorry, I'm so introvert, and I forgot to warn!\"\nBut you are also introvert, so what is going wrong?\nIt's just the stranger. He was asked\nTo make a leak, to blackmail, to \"report\".\n\nSo, what you do? Of course, you lock your soul.\nBut this is not enough because it's Moscow and, you know...\nAnd you begin a purge...\nYou purge your heart, your soul,\nYour social media profile.\nYou even burn your diary\nBecoming more mobile.\nSo, what remains? Your moral principles.\nYour purge will be complete.\n'Cause Moscow doesn't need them anyway.\n\"Are you sure with delete?\"\n\"OH YES! I SURE! I clean them.\nI clean, I purge, I wipe.\nI burn them out from my heart!\n(Who ever would divine?)\"\n\nAgain, you're empty. What a shame!\nNow you're a stalker - permanently.\nAnd everybody runs away\nBut you don't care. If only things went better...","date_added":1523534993},{"post_id":1535363188,"body":"100 mbit ethernet, samba and 8 year-old router rulez!","date_added":1535363154,"meta":"{\"img\":\"900,585,15936947a99979a89aaa9bb8abbbbb57aaaacaaccb9aaaab,01110000002333444452267689899A2BCDDDDD9A2E9833998A2EFE55FFEA1AAAAAAA21\"}"},{"post_id":1535908881,"body":"I've long since moved away from the axis of symmetry of the hyperbola. But we all know that hyperbole never crosses the axis. Of course, you can simply multiply the function by x to the power of n and return to zero coordinates, but is this correct? Or you can trust the hyperbole with a bad draftsman - and he will either cross it with the axis, or make it part of an ellipse, 50/50. I am this draftsman.","date_added":1535908841},{"post_id":1550152539,"body":"Have embarrassed a groupmate to a cold. What a monster am I!","date_added":1550152489},{"post_id":1564233386,"body":"How amazing! My laptop is only 48C warm despite I run a composite WM with plenty of transparencies and an actual (according to Debian repo) web browser!\nBTW, I use Zero via _almost_ dialup! And it runs just fine. Looks like even Yopta fails to throttle P2P (in grandma's village reception is not ideal anyway).","date_added":1564233332,"meta":"{\"img\":\"733,700,dc7cb6db7dc9eeecccaaabbabbbddcccb999,012344444456785559999559955555966795A99958559999999B7757A9999555555999966788599959999955555999995778\"}"},{"post_id":1564944199,"body":"So, as midnight slowly comes to my actual TZ, VK is becoming extremely laggy (unlike XMPP!), everyone important is offline already, but my tab is finally inside Moscow VPN updating our data bank at the moment, I am brushing my teeth and going to watch dreams full of faith, hope and love before visiting the dentist! Good luck everyone (I'll probably need it tomorrow)!","date_added":1564944142},{"post_id":1565125170,"body":"I found her... No, she found me as I said \"Caught you finally\" about some malware in auditorium's LAN, and she even accepted my yandere habits and love of freedom. And yes, now we chat almost every evening. Moreover, sometimes she is the one who begins the conversation.\n\nFor example, today she asked me for help in hacking neighbors' WLANs 'cause of bad cellular reception and, lemme guess, shortage of data plan... Unfortunately everyone has just updated the firmware and WPS now can block itself))0)\n\nMy Hope is... @UndyingFirewall, be more serious, make up a good local password and look after the facts! But don't give up, who knows what will happen.","date_added":1565125111},{"post_id":1565469425,"body":"Нет, я не хакер, я другой,\nЕщё не знаю, чей избранник,\nКак он, обычный русский странник,\nНо только с яндере душой.\nЯ позже начал, кончу ране,\nЭх, всё успеть не суждено;\nВ душе моей уже успели\nОставить из BAD-секторов пятно.\nКто может, океан угрюмый,\nТвои изведать тайны? Кто,\nКто воплотит все мои планы и припомнит думы?\nЯ — иль она — или никто!\n\nP.S. To be honest, IMHO changing the first line was enough for a \"modern adaptation\" of Lermontov's rhymes. The rest is rewritten just to prevent plagiarism.\nP.P.S. Hope I'll \"finish later\" in fact. And looks like I'll recall the proverb about hope more often than I should.","date_added":1565469365},{"post_id":1568391307,"body":"Today I realized how do I really like my job. Just dunno how to interpret in another way being horny when I see a dream about being at work.","date_added":1568391240},{"post_id":1589713331,"body":"Loneliness is when you flirt with your fake profile accidentally. That's so the lockdown. So fuck it. And fuck Mr. Sobyanin.","date_added":1589713258},{"post_id":1590440999,"body":"Though I'm not a real hypertapper too. But, anyway, BOOM ,TETRIS FOR UNDYNE THE UNDYING!","date_added":1590440922,"meta":"{\"img\":\"683,700,544353676575131030141252665463786454352020,00000000001232345677888888888869A1B7564955555555556C1A6DD61C55555555551182B1964155555555550000000000\"}"},{"post_id":1591964975,"body":"The only benefit of waking up early is having a calm breakfast while others are sleeping.\n\nHonestly, doubly sick of being unable to reach Ms. Senpai while also my mother is being able to reach and interrogate me 24/7 (she is always doing so).","date_added":1591964897},{"post_id":1604276761,"body":"\"We are going to make some CTWC-branded \"D-cider\"©\nSo let's raise our glasses full of D-cider for... Joseph!\nAgain, BOOM, \"TETRIS\" FOR JOSEPH!\nhttps://twitch.tv/ClassicTetris","date_added":1604276674},{"post_id":1604875616,"body":"A legendary match (one of).","date_added":1604875523,"meta":"{\"img\":\"900,522,553442331221111110543000322422300211311400100421,0123445544635447774428545774756957A77B55CDEEE77775FBB3383333\"}"},{"post_id":1605218206,"body":"Heh, looks like I've guessed that I'll run into troubles for posting hate speech to Zoom \"fans\" even if the network is uncensored, enough pseudonymous and consists of people who agree with that. The post was just long enough to make it close to 0Me's storage cap.\n\nAnd it wasn't Mrs. Bogacheva's fault after all although she behaved like it was primarily hers. But, after all, as generally I believe in humanism (to the people who shares this belief, of course), I won't doubt her occasional confessions.\n\nAll in all, I'm not going to initiate zSBP (looks pretty similar to SIP, doesn't it?),  anymore, will rather cast a good curse to the chairman who's in charge of \"Zoom\"ing our private space (and then breaking the law, but who cares in Russia).\nBut the research will be preserved anyway and, if requested, will be shared among... us (of course, except the impostor - even a perfect group such as ours has one unfortunately). Cause nowdays everyone is desperate, more or less; Zoom situation was just the trigger. And I would prefer to support my crew- groupmates. Even that badly, if I have to breed hope (that something can be done by us) like this.\n\nBecause hope must remain. Especially after the 2019's case.))0)\nHope must remain, and there is no any kind of... \"Monokuma\"* to ruin it and get away with this. Oh, I meant \"Junko Enoshima\" of course, how could I forget that Monokuma was just RC'ed. Anyway, ruining hope is a crime and it ought to be prevented and/or, if possible, punished.","date_added":1605218091},{"post_id":1605255817,"body":"\"Write 0xFF to pay respects\"...","date_added":1605255701},{"post_id":1606563276,"body":"...Plz remind me next time that I shouldn't discuss justice or just speak my mind to parents. That they have no souls, and that they're going to defend any immoral thing, deny my moral values and so etc...","date_added":1606563156},{"post_id":1606601990,"body":"Being a \"Sherlock Holmes\" is kinda pleasant.\nFor example, when you can tell that your neighbor is watching TV and name the exact channel by just accidentally^1 hearing the channel's jingle (and having no any TVs). You can even say that the TV is on its normal volume because you know at that very moment you are being at the room where inter-floor sonic isolation is a bit worse.\n___\n^1 As your hearing somehow becomes better exactly when there is something to overhear.","date_added":1606601869},{"post_id":1607022398,"body":"From an Infosec lecture about penetration testing:\n-- ...Use John the Ripper and you'll be fine. St. Patrick will help you with breaking passwords.\n-- If it comes to breaking passwords and stuff, the only saint who will help is... is Lain Iwakura!","date_added":1607022274,"meta":"{\"img\":\"900,675,11143332254376545599aa97677886810621732876943954,000112344102563377712897437663864489967953AA3454983BCCAD4BB2BACCE79F32AABFFD7741\"}"},{"post_id":1607192892,"body":"\"Funny English with Slavs\"\n\nFromneighbor (n) -- a neighbor who becomes noisy at the very moment when, for example, you have a phone call, record a vlog or just try to get asleep.","date_added":1607192767},{"post_id":1607211001,"body":"Last year I asked a groupmate of mine if she has an Hipst^W Instagram account, and she said something that \"I'm too lazy for this\". It sounded like she felt sorry about this. I definitely should have had to say that it's better not to think about creating one. To say it like The Master said it to Ivan Bezdomniy.\n\nHope she got it anyway...\n\nDunno why I recalled that.","date_added":1607210875},{"post_id":1613646280,"body":"Running out of my hub's storage cap, so will clean my profile. And migrate then... I probably mean starting over with a new profile or even with an ZeroBlog instance and re-posting good stuff from here.\n\nHeh, luckily, as I've managed to clean my, lemme say, NVRAM, now I have some posts to delete without any sorry. And looks like someone's excellent student's spirit had transferred into me completely. Ok, I'll take care of it. \n\nThe only thing that may remain (except some more \"reallocated NVRAM blocks\")...\nHope I'm safe.\n\nThanks for support during Desperate lockdown times.","date_added":1613646149},{"post_id":1621884961,"body":"\"The Hacker Tab: It can't break into the Pentagon^1 or something like that, but it cracks minds of co-travelers in Moscow Subway just fine!\"\n\nYep, seeing a gal starin' with puzzle and wonder at your backpack (after you have just scrolled OpenNet and LOR newsfeed then SSH'ed home in front of her) is pleasant... and also hopeful! Especially if she gets it.))0)\n\nP.S. Yep, there is a Docker cheat sheet at the background.\n____\n^1 A Russian scholar meme","date_added":1621884829,"meta":"{\"img\":\"900,676,bb8ba5cb5cc8984774dc8454eeb245235342226997331664,001111111232224555666663777708688379AA588863BCCA7668637B777D666377BBB73330BEBF40\"}"},{"post_id":1622176907,"body":"Ohhh, looks like St. Juno Gasai is really saint! As only a prayer to her managed me to exit a nightmare tonight.","date_added":1622176774}],"post_like":{"18d5Zv5xUX1PCJyuWV9RWJuQH25aKFQGMf_1496176367":1508597052,"18d5Zv5xUX1PCJyuWV9RWJuQH25aKFQGMf_1496128400":1510596294,"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550141105":1550727632,"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1565022920":1565030429,"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1565144359":1565175394,"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1568171289":1568321063,"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1588302602":1588699145,"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1595309206":1596121061,"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1605222831":1605218124},"comment":[{"comment_id":3,"body":"Battle transcription:\n[battle start]\nParty:\nS. Firewall - 100/100 HP, 0/0 MP\nTurn 1: SKILLS>EXPEL>Yandere-tan\nYandere-tan attacks S. Firewall. Damaged by 1 HP\nS. Firewall disarms Yandere-tan. Lost: KNIFE.\nTurn 2: SKILLS>LOOK AROUND\nYandere-tan casts SPARE WEAPON. Got KNIFE.\nS. Firewall looks around. Discovered: STRANGE DOOR.\nTurn 3: SKILLS>STRANGE DOOR\nYandere-tan equips KNIFE.\nS. Firewall opens the strange door. Oh, it's a time portal! Learned: REWIND.\nTurn 4: SKILLS>REWIND\nYandere-tan attacks S. Firewall. Miss!\nS. Firewall rewinds the time. Yandere-tan is not yandere anymore, but is going to be a yandere!\nThe past is not changed. Time reverts back to the present. Learned: UN-YANDERE\nTurn 5: SKILLS>UN-YANDERE>Yandere-tan\nExtra turn 5,5: SKILLS>CALM DOWN (*works only in lucid dreams and for female enemy) > Yandere-tan\nYandere-tan does nothing.\nS. Firewall rewinds the time. Yandere-tan is not yandere anymore, but is going to be a yandere!\nEx-Yandere-tan does nothing.\nS. Firewall calms down Ex-Yandere-tan. Success.\nThe past is changed and becomes stable.\n[end of battle]\nS. Firewall's party was victorious!\nEarned 666 EXP.","post_uri":"19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S_1492152548","date_added":1492179488},{"comment_id":4,"body":"@Sksn: I moved here this summer, but now I feel I made a mistake. And it was permanent. My good marks, my yandere girlfriend, my hometown...","post_uri":"19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S_1510589660","date_added":1510594922},{"comment_id":6,"body":"It's Senpai-tan.","post_uri":"19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S_1535302194","date_added":1535362964},{"comment_id":8,"body":"So, does it support XP?","post_uri":"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1562391759","date_added":1562412214},{"comment_id":10,"body":"\"My fingers had already slid to the keyboard of my T430, pressed the button with no signs, and typed in the appeared terminal a command to run “Shark” - a network monitor. Scarlett was not a fan of any hacker stuff, so it was surprising that she wrote to me directly on BMPP ... Don't get distracted! So, this UDP session... According to the signature, yOS of earlier versions. According to WHOIS - a Russian mobile ISP ... Yet another dynamic IP pool, it could not be else. Hopeless! But we can still sniff into GPS tags the photo of the house from the Hipstagram on Google Street View\".","post_uri":"19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S_1564233860","date_added":1564234359},{"comment_id":11,"body":"@caryoscelus: thank you, everything went okay. :)","post_uri":"19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S_1564944199","date_added":1565030296},{"comment_id":12,"body":"It IS a sexual organ. Don't argue with M. Wislotskaya.","post_uri":"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1565045938","date_added":1565123687},{"comment_id":13,"body":"@😍Leinariys😎: стараюсь)","post_uri":"19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S_1565469425","date_added":1567541088},{"comment_id":14,"body":"What a dream I had today...\nThe nightmare launch trigger has already appeared, but I managed to disarm it. Then I went to a party where I met my adorable...the girl from the 4th course who can't use torrents The dream froze as she hugged me. And then my server woke me up. But this time I woke up slowly, and I still felt her hugs while I was waking up.","post_uri":"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1568171289","date_added":1568316215},{"comment_id":15,"body":"Я тоже задаюсь этим вопросом. Вернее, пока нет - после того, как раскошелился на лишние 8ГБ ОЗУ для ноута, и браузер наконец-то перестал лагать.","post_uri":"1quZypjcRH7SQtX1cCfqTxHWakVEPww3Z_1568384216","date_added":1568398151},{"comment_id":16,"body":"Eh... M$ Windoze is unstable enough that is crashes with MCEs on a 5-month old desktop. (And Debian does not).\n@Styromaniac: Is it the Quantum-powered Firefox or something sticked with Gecko like Pale Moon?","post_uri":"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1588269103","date_added":1588283112},{"comment_id":17,"body":"@Styromaniac: So, if you'd seen my comment before it was edited, you know, what I would do if I were you. :-)\nI used to have less than 4 gigs of RAM, so I know what I'm saying.","post_uri":"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1588269103","date_added":1588284261},{"comment_id":19,"body":"So, what was the problem? And what do you think about the Keenetic series?","post_uri":"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1589947893","date_added":1590095219},{"comment_id":20,"body":"...and claiming that they love the opensource despite ignoring FSF's requests","post_uri":"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1589862241","date_added":1590095374},{"comment_id":21,"body":"@Styromaniac: At least in isn't a kind of vendor's blacklist. I had such a bad experience with an ASUS RT-G32. It used to crash constantly when my ThinkPad ran anything related to P2P, especially BitTorrent. And this happened only in the combination of these two devices, LOL. Looks like I'd rather have left it in the sold flat instead of the Linksys WRT54G2, but I prefered a router with a 802.11n support firmware update and Telnet admin access. Heh, unfortunately, when I got a real IP, I realized that the Telnet is unconditionally accessible from WAN too...\nNow I have RT-G32 in the switch mode, \"separating\" my room's LAN from the rest of the flat, and the main router is Keenetic Extra II, and everything is just fine. Months of uptime, no crashes, and even somehow throughput between the \"switched\" and \"unswitched\" segment is higher than the theoretical bandiwdth of the \"switch\". At least, Midnight Commander says it at the begining of a file operation on the LAN.","post_uri":"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1589947893","date_added":1590148222},{"comment_id":22,"body":"Does it really matter after porting 10 Enterprise to Pi? AFAIK it does contain an x86 emulation layer.\nP.S. Bought Rπ3Β+ couple of days ago, and the first thing I ran on it was Faux86, and it was just fine. I mean, if someone buys an x86-powered SBC not to run Win10 or GNU/Linux but rather to play retro games on bare metal, he doesn't really need it. Unfortunately, x86-powered SBCs are not as geek-oriented as such devices usually are.","post_uri":"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1592610763","date_added":1592598600},{"comment_id":23,"body":"A couple of years ago, only an accidental backup helped me (but it actually did). The only thing remained that I still can't do is to transfer my identity to a multi-user instance.\nI am going to create a restricted proxy on my spare server to kinda offload the workstation and also to give easy ZN access to some my friends.","post_uri":"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1593095824","date_added":1593102413},{"comment_id":24,"body":"@ssdifnskdjfnsdjk@zeroid.bit: Does such an app really exist? For which platforms, if does?","post_uri":"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1595309206","date_added":1596121095},{"comment_id":25,"body":">I estimate that it would be a lot of work\nAlso it would be a lot of data... Of mobile data.","post_uri":"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1604245740","date_added":1604240871},{"comment_id":27,"body":"@Mg0: According to the research, it's least likely that other people will suffer (it by \"other people\" you mean everyone except Mrs. Bogacheva and my group which is mad at Mrs. Bogacheva entirely, some of them are even more than me... What about me - after all this happened, I think I would felt good realizing her home router got fried up.\nThis is an exceptional case.","post_uri":"19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S_1604256584","date_added":1604268407},{"comment_id":28,"body":"@Mg0: At spring lockdown, we were fine with the Canvas internal messenger which is just like some kind of e-mail. I hope to force falling back to it. There is no any sense of inviting random people from 4chan to the conference etc, like many others do.\nSo, the goal is to make a series of emergency call shutdowns which will demotivate Mrs. Bogacheva from using Zoom. If everything goes fine, Mrs. Bogacheva will feel like there are real long-term tech difficulties and think of a workaround.","post_uri":"19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S_1604256584","date_added":1604268604},{"comment_id":29,"body":"@Mg0: well, hope does die last...","post_uri":"19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S_1604256584","date_added":1604271685},{"comment_id":30,"body":"Well, the entire X.509 is confusing in some measure. That's why my private services are likely going to prefer plaintext-over-SSH/THS/VPN instead of this.","post_uri":"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1604280110","date_added":1604272177},{"comment_id":31,"body":"@Styromaniac: the actual problem is that business is the only financially justified reason to get a cert when many non-business applications use same technologies and also require the same cert for normal operation - not just a SSH or PGP key pair, for instance. The \"funniest\" thing that TOFU is perfectly implemented even for Web applications but is not so common to be even considered a normal practice as in a Web browser a TOFU confirmation would be called a \"security warning\" and not formally being related to any kind of TOFU.\nAlso, since CAs are commercial organizations, they are prone to corruption.","post_uri":"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1604280110","date_added":1604273586},{"comment_id":32,"body":"@Styromaniac: depends of your application. If it's business-related, of course a valid cert (of course, not a self-signed one) is good and expected practice. But it will worth it at least.\nBut when you just want to bring up a simple, private and lightweight file sharing service for your groupmates... The entire X.509 trust model becomes a pain in the neck.","post_uri":"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1604280110","date_added":1604274675},{"comment_id":33,"body":"test","post_uri":"19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S_1605033418","date_added":1605033324},{"comment_id":34,"body":"@Mg0: Maybe it was, who knows... She was really a lot like the character.\nP.S. The previous comment which was deleted by an accident:\n>@Mg0: Chiaki used to be a groupmate of mine. Sadly, it appeared that there is no place for a Super High School Level Gamer among supposed Super College Level Sysadmins.","post_uri":"19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S_1605218206","date_added":1606244876},{"comment_id":35,"body":"Oh, it wasn't about force updating the hub. It actually was about canceling all the pending changes which I did during the malfunction of my server.","post_uri":"19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S_1606245145","date_added":1606299610},{"comment_id":36,"body":"Unfortunately, it's not Minetest. As it become active enough, it dropped my wannabe primary OS...","post_uri":"19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S_1525199131","date_added":1606944891},{"comment_id":37,"body":"P.S. Oh, the famous SSH client called PuTTYn is also their work.","post_uri":"19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S_1607014663","date_added":1607021579},{"comment_id":38,"body":"Hmm... I think it contains Unicode pseudographics or some no-break spaces at least, doesn't it?","post_uri":"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1607138725","date_added":1607179856},{"comment_id":39,"body":"@Styromaniac: On Windows any Unicode character can be entered by typing its decimal code at the numpad while holding Alt. For the no-break space it's Alt+[2,5,5].","post_uri":"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1607138725","date_added":1607182895},{"comment_id":40,"body":"@Styromaniac: some may, some not. Some sites don't even accept plain spaces.","post_uri":"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1607138725","date_added":1607184382},{"comment_id":41,"body":"Does App 0 still work? Somewhy I can't even reach ZeroHello via my proxy from either Bromite and latest Chromium from Debian repos (despite being able to go past UiPassword), not to mention that App 0 stopped working for me since, lemme recall, 2019.","post_uri":"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1624084078","date_added":1624300714}],"follow":[{"follow_id":3,"hub":"1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v","auth_address":"1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci","user_name":"Noti0-News","date_added":1484661885},{"follow_id":4,"hub":"1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v","auth_address":"18d5Zv5xUX1PCJyuWV9RWJuQH25aKFQGMf","user_name":"NotYourBit","date_added":1484661892},{"follow_id":5,"hub":"1KNmG5rJUGhgUJGFbLkv2B5isaqu9PrZqi","auth_address":"1BkgWBWWN9CoXNeEmyyuagid7roJruBVjz","user_name":"cyberslave","date_added":1510596193},{"follow_id":6,"hub":"1BLueGvui1GdbtsjcKqCf4F67uKfritG49","auth_address":"18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6","user_name":"Border0464fred","date_added":1510596229},{"follow_id":8,"hub":"1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v","auth_address":"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd","user_name":"Styromaniac","date_added":1534242213},{"follow_id":9,"hub":"1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v","auth_address":"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd","user_name":"Styromaniac","date_added":1534252930},{"follow_id":10,"hub":"1White24UrrwQrD86o6Vrc1apgZ1x1o51","auth_address":"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE","user_name":"caryoscelus","date_added":1588282865},{"follow_id":12,"hub":"12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv","auth_address":"12BRJSQrTETJVZzt2jHdqPywv3SdugSywC","user_name":"draugrdeathlord@zeroid.bit","date_added":1591476138},{"follow_id":13,"hub":"1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2","auth_address":"168Ze2ScKyzmQMpGqpwA3VkznNDke9z9s3","user_name":"Maho911","date_added":1591476212},{"follow_id":14,"hub":"1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2","auth_address":"1JfAyi1JV5YaBjNZ9Jfu73TVR9Jeg7H5re","user_name":"Dilans","date_added":1591552290},{"follow_id":15,"hub":"1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2","auth_address":"144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY","user_name":"1bfqutudhtexlka","date_added":1592048124},{"follow_id":16,"hub":"12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv","auth_address":"1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ","user_name":"ulrichard","date_added":1592049256},{"follow_id":17,"hub":"1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a","auth_address":"15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL","user_name":"Realjohndoe","date_added":1592049421},{"follow_id":18,"hub":"1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v","auth_address":"1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB","user_name":"nekololi","date_added":1592049720},{"follow_id":19,"hub":"1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2","auth_address":"1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS","user_name":"Ansho Rei","date_added":1592064931},{"follow_id":20,"hub":"12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv","auth_address":"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh","user_name":"Kaffie","date_added":1592297353},{"follow_id":21,"hub":"1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2","auth_address":"1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz","user_name":"Port220irq5dma1","date_added":1604272519},{"follow_id":22,"hub":"1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2","auth_address":"1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x","user_name":"If0","date_added":1604778500},{"follow_id":23,"hub":"12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv","auth_address":"1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx","user_name":"mxh69420","date_added":1606944577},{"follow_id":24,"hub":"1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2","auth_address":"1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93","user_name":"Tulpa","date_added":1613667628},{"follow_id":26,"hub":"1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2","auth_address":"1PhUyqJqsdYXuGTLxRjVmZMzDLwCcAPBEp","user_name":"Tod","date_added":1615752221},{"follow_id":27,"hub":"1White24UrrwQrD86o6Vrc1apgZ1x1o51","auth_address":"1BTR1SP5uKs6nURymSE4uX74vJ8CmAXyB9","user_name":"Мокшанец","date_added":1615752392},{"follow_id":28,"hub":"1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v","auth_address":"12TDAgyHEsMVgzVmEQzSBEAPRJKT6yR88u","user_name":"Khiabo","date_added":1615752421},{"follow_id":29,"hub":"1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2","auth_address":"1BkXMCkwtTN6xTcZEEfMRPhvHJHaeUPH7E","user_name":"Savuth","date_added":1615752519},{"follow_id":30,"hub":"1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a","auth_address":"1QJxCwuNW6Wwhkd5E8pRzKbjSG7ik9KMBq","user_name":"Gorlum","date_added":1615752939}]}