{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "A possible explanation of Trump's erratic post-election behavior",
			"body": "Via [wikipedia](https://en.wikipedia.org/wiki/Paradise_Syndrome):\n\n> a condition in which a person suffers a feeling of dissatisfaction despite having achieved all their dreams\n\nAlso expressible with the phrase \"...now what?\", I feel like this is what Trump is experiencing right now. I doubt he really intended to win in the first place. He may have intended to loose and launch a news empire to rival the likes of even Fox and Breitbart--remaining the underdog fighting against _the man_, and corralling followers by that fact alone (It's not that far-fetched; he's had years of acting experience). But now he has **become** the man, and no longer has that advantage. He now has to be the very thing he's styled himself as fighting against.\n\n\nIn a sense, everyone has called his bluff by electing him. He no longer has Hillary to blame for things, and is suddenly accountable for things in a way he wasn't before. He's put [an awful lot](https://trumptracker.github.io/) on his plate. It's time to see how much he finishes.",
			"added": 1488411152
		}
	],
	"topic_vote": {
		"2_1EaqopZaaZ4K5eCV4egV9nuFoVnc7ffVWQ": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1_18NsJqjikBYBjwLzMVp7aBJSpqtyRSd9qF": [
			{
				"comment_id": 1,
				"body": "> [1488475982](#comment_1_1B53QF3NE5rsWF3d2kYa6mT1EmfzRSAZiV): Could that explain his many lies?\n\nUnlikely, since he has been lying from very early on. This one's harder to explain.",
				"added": 1488509456
			}
		],
		"2_1EaqopZaaZ4K5eCV4egV9nuFoVnc7ffVWQ": [
			{
				"comment_id": 2,
				"body": "http://immigration.findlaw.com/citizenship/u-s-citizenship-through-parents-or-by-birth",
				"added": 1489127423
			}
		],
		"16_1EsbUMPVeLGNe2QdbfnbsbhcqnEKWSQ1X": [
			{
				"comment_id": 3,
				"body": "https://www.documentcloud.org/documents/3476455-LEITF-HSGAC-Letter-022717.html",
				"added": 1489161021
			}
		]
	},
	"comment_vote": {
		"3_18NsJqjikBYBjwLzMVp7aBJSpqtyRSd9qF": 1
	}
}