{
	"next_topic_id": 12,
	"topic": [
		{
			"topic_id": 1568723470,
			"title": "5大服务之详细介绍",
			"body": "1．冰火\n冰火是冰火二重天的简称，实际意思是指MM拿一杯冰水和一杯热水，分别含在嘴里为你口交，这样你的阴茎就可以一会享受热水和MM的舌头的同时刺激，又可以享受冰水和MM舌头的刺激，两种截然不同的感受，会令你的阴茎暴胀，变是非常坚硬挺拔。\n该名词源于香港，她们的应召女郎如此玩的。如果男人不够猛，一下就挂了，这样钱就很好赚啦！但由于她的超强感观刺激，很快变成爽友传说中的终极秘籍。冰火九重天，顾名思义，就是冷热交替。在小姐替你进行口交的时候，变化口内的温度其具体过程如下：先用手或口刺激你的另一半，待你一柱擎天后，小姐再将冰块放进口中，此刻，小姐的手还在不停的在做活塞运动。然后用冷冰冰的嘴含住你的另一半，这感觉就像是突然电到一样。几分钟后，你感觉她口腔的温度慢慢的恢复正常，这时她将冰块吐出。，再次重复刚刚的程序，只不过这回放进口中的是热水。那感觉突然把手伸到火里似的。这么来来回回，回回来来，突然间就让你就超越临界点，火山爆发啦。\n2．毒龙\n毒龙就是MM用舌头帮你舔屁眼，当然前提是你要洗干净，MM用舌头猛舔你的屁眼和周围敏感部位，温暖的舌头直往你的屁眼中钻进去，男人通常觉得非常刺激，受不了。\n清洗肛门完毕后，嘴里含温水，通过舌头的活动把水经过肛门注入大肠，再含，再注入，注入到一定程度后，客人会有便急的前兆，然后让客人自然排泄，再次清洗，然后再次注入，直到客人的排泄物中脏物比例较少为止，这样算一个套系，耗时40-60分钟左右，做毒龙的时候，由于客人的肛门生理原因，适当的可以准备一些蜂蜜或生理润滑液（客人自备）。\n毒龙钻其实就是用舌头伸进你的消化道末端抽插加舔吸，一开始你会觉得小姐的舌头只是慢慢的在外围打转，渐渐的，她会把舌头卷了起来，拼命的往里面钻去，有职业道德的美眉一边钻，一边还会喘着粗气，浅吟低唱几句。这时你的末端会随着舌头又插又钻而传来一阵温暖和一种独特的刺激。让你忍不住想立即把她就地正法。这是由于肛门周围是粘膜质的敏感部分，这里受到的刺激会传送到脊髓的神经中点，所以只要刺激这里，脑部就会收到***官一样的刺激。而且，这个部分还有大幅度增加生殖器官之刺激的功效。但一定得注意卫生，大肠杆菌待在大肠里是对人体无害的，待在嘴里我就不知道啦。\n3．推油\n推油就是MM用婴儿油涂在你的阴茎上，然后帮你手打飞机(也就是手淫)，直到你射出为止。\n1前奏:5到10分钟帮你全身按摩。\n2调婴儿油(加热)，轻轻涂抹你的全身，有的美眉还会给你作胸推\n3开始用婴儿油挑逗你的敏感带，最棒的是从后面伸进去，前和后搓揉你的小弟弟，再用舌头由浅见深的攻击你的消化道末端。\n4吹你那滚烫的小弟弟，此时经验不足的人就射啦!!\n5重要关头，较资深的小姐直接跨在你的上面-夹紧，垂直上下，通常不出10~20下，就GameOver啦!\n6你出的时候，通常小姐会假装一起高潮，并说“你真棒，弄得人家好爽”通常全套服务时间45分钟，根据小姐统计只有不到5%的人可以超过30分钟。\n4．波推\n波推就是MM用她的大波(大乳房)为你打飞机，直到你射出在MM的乳房上为止\n5．红绳\n红绳比较复杂，意思是指在床上面吊着一个红色的用布折叠做成的绳子，然后小姐双腿吊在上面，头部朝下，帮你口交或毒龙，因为绳子是活的，所以小姐可以进行转动，这样就可以一边用嘴含住你的阴茎，一边转动360度，男人通常感觉非常刺激。而且转到720度以后，小姐突然一松手，这时小姐就被绳子带着快速回转，而小姐的嘴含着你的阴茎也在快速旋转，这时你通常会觉得不可思议，感觉太神奇了，因为口交通常只是进进出出，而不可能是旋转的，发明红绳的家伙太强了",
			"added": 1568723469,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1568723516,
			"title": "高难度的桑拿10大极品服务（据说是红绳十式）",
			"body": "一、倒挂金钩：我正常平躺，MM双脚扣住红布条，倒头向下，用口含住DD做BJ.这一过程中，MM分别用冰，热水，跳跳糖各做一次。\n二、风火轮：我仍是平躺，MM双脚倒挂，头向下，用口含住DD做BJ，一边BJ一边做360度转，将布条拧成麻花后双手一松，MM的身体，MM的嘴含着我的小DD就像飞速地转动\n三、荡千秋：MM坐在布条上，我站立着推动MM，象荡千秋一样做ML，MM张开大腿和交叉大腿，分别迎合我的进攻。\n四、金鸡独立：MM一脚站立，另一脚用布条高挂做一字，我从中进攻；\n五、一马平川：我正常躺，MM两腿做一字，一腿架在偶的左肩膀上，另一腿斜放在偶的右腿侧，让我DD插入攻击。\n六、四季发财：我正常躺，MM坐在上面，由我的小DD插入后，MM分别面向东南西北四个方向做上下直插式进攻。\n七、花开富贵：MM作倒立双手顶床，头和肩膀靠着床头支撑身体，我从上向下将小DD插入.\n八、排山倒海：MM平躺在布条上，成平行状，我从MM后面插入进攻，两人身体形成直角。\n九、天女散花：我平躺，MM将一木棍置于布条间，两手紧握棍，垂体曲脚，我的小DD插入ML，小MM边ML边转身，待布象麻花状时，MM突然双脚悬空，其身体即刻在空中旋转，我的小DD在小MM的深洞里也转得爽。\n十、海底捞月：MM两手抚摸我的两颗着蛋蛋，并抬高臀部迎合DD的进攻，让小DD和精华落入MM的深洞中",
			"added": 1568723514,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1568723588,
			"title": "BODY MASSAGE 解密",
			"body": "现在不少桑拿和洗浴中心的包房里有一种替你全身洗浴按摩服务，在香港和澳门管这叫BODYMASSAGE.不过还是泰国浴最是正宗。要是有机会去泰国的朋友可以试一试。在国内只在包房里提供，那是因为它要在包房的小浴池里，由全身抹满浴液的美眉用她的身体替你按摩洗澡。\n第一步，正面交锋\n首先，你躺在浴缸里。小姐会压在你的上身，然后利用手臂支撑身体，用她高耸的双峰在你的全身不停的扫来扫去。好多兄弟在这样的刺激下，下身已经开始举旗致敬进入状态啦。\n第二步，左右踏波\n洗完上半身，小姐会坐到你的对面，用双手抬起你的双腿，把你的双脚一左一右的放在她的双峰上按来按去。那感觉就像踏在了两个又暖又滑，又有弹性的凝脂球上。一种异样的刺激。\n第三步，完全接触\n之后，小姐会示意你和她一起站在浴缸里，她继续用她那柔滑的双峰摩擦你的全身，洗完前面当然还有后面啦。\n第四步，手足之欲\n洗完全身，又怎么会忘记四肢哪？这个时候，小姐会起身坐在你的大腿上，用她的小妹妹前后摩擦你的大腿！此时你的双手当然也不会闲着，可以充分的爱抚一下她那孤傲的双峰啦。\n第五步，过足手瘾\n做完腿，当然是做手啦。此时小姐会用她的双手抓住你的手臂放在她的两腿之间前后左右移动，做完左手做右手。至此全套的BODYMASSAGE告一段落。\n诸位兄弟要是想完成全套的话千万要坚持到底，这可是非常考验你的承受能力！嘿，她就是个仙女你也要忍住呀。另外，常用语包括：\nML=makelove\nFL=发廊\nHJ=handjob打飞机\nBJ=BlowJob**\nFJ=footjob",
			"added": 1568723585,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1568723653,
			"title": "解密 黑话",
			"body": "01、打飞机：指客人躺床上，小姐给你手淫，直到阴精向上射出，用到日常生活中也指男人手淫，也叫打枪；\n02、打炮：做爱，插入，暗号是kaobi.com，指与小姐做爱，和小姐性交，尻屄，也叫打真军；\n03、口交：男女用舌头舔，摩擦，用嘴亲吻、含、吮吸，抽插对方的性器官(主要是阴茎、BB)；\n04、漫游：小姐用舌头舔客人全身，也叫身交；\n05、胸推：用乳房夹小弟弟，或者是乳房按摩全身(又称波推)；\n06、臀推：用屁股按摩小弟弟；\n07、口爆：射在小姐嘴里，小姐一般不能吐，要完全吞下；\n08、毒龙：毒龙钻，舔屁眼，小姐用舌头舔、卷、钻男的肛门。\n09、冰火：小姐用冰、热水交替为男子口交；\n10、双飞：一个男的与两个小姐性交；\n11、大活：指做爱，尻屄，也一个字母一个字母念做kaobi.com；\n12、足交：用脚帮你弄到射，一般用脚掌按揉，用脚趾夹；\n13、沙漠风暴：小姐口含跳跳糖为你口交，嘴有噼劈啪啪之声，棒棒糖跳动时刺激阴茎；\n14、一剑穿心：用吸管把碎冰吹进男人肛门，然后再吸出来；\n15、空中飞人：坐在男人身上，阴茎插入阴道，身体旋转；\n16、盐浴：就是小姐用盐帮你擦洗(奶浴，茶浴等都类似)；\n17、蚂蚁上树：用舌舔遍全身。重点是耳部，颈部，乳头，小弟弟，会阴，臀部，脚底及脚趾；以舌头由下至上，从前到后舔遍全身。\n18、帝王浴：即小姐用全身(主要是MIMI)给你洗澡，在浴盆里给你洗遍全身；\n19、三通：用小弟弟干小姐的嘴，B和菊花门，也就是口，阴道，肛门；\n20、观音坐莲：女上男下之姿势；\n21、细佬：男人的小弟弟；\n22、鲍鱼：女人的性器官，也叫屄；\n23、春袋、袋袋：男性的阴囊；\n24、颜射：将精液射向女人的脸上，男人有一种征服欲得到满足的快感，小姐不能表现出厌恶情绪；将精液喷向荡女之芳容。\n25、金鱼缸：供嫖客们挑选小姐们的玻璃橱窗(单向透光)，把小姐比喻为金鱼，也叫金丝笼；\n26、点台：指定小姐；\n27、卡台：换小姐；\n28、水晶之恋：是小姐把果冻放进阴户让你用阴茎插，插烂再换，连续几个；\n29、洗脸：用私处在客人脸上磨蹭；\n30、连体婴：全裸互吻30秒；\n31、秀舞：指小姐在包厢内跳艳舞给客人看；\n32、后庭：指肛门，也叫后庭花；\n33、骑马：倒坐在客人大腿上随意摆动；\n34、封包：将毛巾挂在包厢门外，以表示不愿外人进入之意；\n35、出场：带小姐去外面，一般以10小时计算(有分全场跟半场)；\n36、激情百家乐：由大家轮流做庄，闲家可押任何指定动作，例：全裸互吻30秒......等；\n37、国王与我：以股子定输赢，赢家可指定输家任何动作，例：吸奶头30秒等(包含一些限制级动作)；\n38、萤火虫：将点燃的香烟放入后庭，关灯后在包厢内四处跳跃；\n39、买春：玩小姐，卖春自然指出卖肉体，与人尻屄；\n40、水果盘：小姐在沙发平躺，将水果放置身体任一部位，由客人蒙眼以嘴搜寻；\n41、今晚上kaobi.com吧：这句话通常用在酒吧，舞场等和小姐接头的地方，意思是今晚上做爱；\n42、溜小鸟：将卷筒卫生纸搓揉成绳状，一端绑在男人重要部位上绕场；\n43、钓鲍鱼：将卷筒卫生纸搓揉成绳状，一端塞在女人重要部位内绕场；\n44、神仙水：将尿渗在酒里喝下去。性福联盟#\n45、长寿酒：意指将男人阴茎放在酒杯中搅拌后的酒；\n46、女儿红：将脚趾头放在客人嘴中，酒由大腿倒下顺流至口；\n47、桃花香：酒由小姐私处倒下顺流至口；\n48、猴儿酒：酒由客人私处倒下顺流至小姐口里；\n49、山泉酒：将酒由股沟或乳沟间倒下顺流至客人口里；\n50、高尔夫：将西红柿放至小姐乳沟间或私处，用鸡鸡挥竿至肚脐；\n51、过山洞：将西瓜中央挖洞，鸡鸡套进去，由小姐将西瓜吃完；\n52、点唱机：两人全裸拥抱，转圈唱完一首歌，模拟恋人行径；\n53、奶油派：将奶油涂抹在异性身体任一部位，用舌头舔完，依部位不同派名不一，比如乳房派，kaobi.com派，玉门派；\n54、枪王打通关：由小姐帮客人打枪3次，依次逐一猜拳，赢换下位，输再打3次；\n55、果汁牛奶：口含冰块，舌吻奶头，配合各式水果；\n56、骨场：指按摩松骨店。性息乐园#\n57、骨女：按摩女郎；\n58、桑拿：三温暖；\n59、北姑：港台地区称大陆妹；\n60、鬼妹：即金丝猫，指被人包养的女子；\n61、金鱼缸妹：指橱窗女郎；\n62、代支：指服务费；\n63、砌：干。36963.com\n64、后门：指女子屁眼，相对于阴道而言。又叫菊花、菊花门、后庭、后庭花；\n65、细佬：男人的阴茎，又叫小弟弟、老二，阳物，阳货；\n66、小妹妹：指女子的阴蒂，泛指阴部，屄；\n67、欧式按摩：一种西方按摩方式；\n68、上海式按摩：纯按摩，指压功夫一流；\n69、泰式按摩：按摩60分钟(包括敏感部位)，然后打飞机；\n70、中式按摩(HandJob)：正宗的按摩90分钟，按摩90分钟再打手枪；\n71、日式按摩：又叫自由式按摩，全套服务，共约两粒钟；\n72、短房：休息宾馆房，又叫钟点房；\n73、街钟：出场费。十大动化网站#\n74、台钟：坐台费；\n75、出街：带出场；\n76、太小妹：指叛逆女子，在酒吧混，一般不卖身；\n77、茶舞：夜总会下午场(4-11pm)下午4点到11点；\n78、晚舞：夜总会晚场(12-3am)凌晨12点到深夜3点；\n79、推油：把牛奶或婴儿油涂客人阴茎上，用手帮客人撸弄阴茎，套弄龟头，直至射精；\n80、“叼”：口交(形象吧)念diao；\n81、69式：尻屄姿势的一种，男女前后上下头尾颠倒互相口交；\n82、BJ：口交英文BlowJob的缩写；\n83、dd：男子的阳具，雄之阳具，就是弟弟取首字母；\n84、FK：Fuck的缩写，搞、操、干、日，尻，嬲；\n85、TT：指安全套，又叫雨衣；\n86、MM：指女人的咪咪(乳房)，有时指“妹妹”。“小妹妹”是指阴蒂，阴部，屄；\n87、FL：发廊，取发廊的首字母；\n88、kaobi.com:做爱，kaobi；\n89、ML:做爱(英文全称：MakeLove，kaobi.com)；\n90、KJ：口交(汉语版的，全称拼音KouJiao，和kaobi不同)；\n91、框：包的意思，在这里是指包到底之意，一般以7小时计算；\n92、跑台：两桌以上客人同时坐同一位小姐；\n93、点台：指定小姐(一般以2节计算)；\n95、节数：时间计算单位，通常以10分钟或15分钟算一节；\n96、炮房：指色情场所与小姐打炮尻屄的房间；\n97、走后门：指肛交，也就是干后庭；\n98、波夹：又叫乳交，指女子用乳房夹住男子阴茎，男子抽插至射精；\n99、鸡奸：指男人与男人发生性行为；\n100、打手枪：多指男性自己手淫至射精，简称打枪；\n101、坐台：指小姐在色情场所陪酒、陪聊、陪舞(不提供性服务)；\n102、出台：指小姐跟客人提供性服务；\n103、包夜：指客人要小姐通宵陪睡觉；\n104、包婆：指客人在一次出差期间或者一段业务活动时间内把小姐“包下来”陪自己；\n105：电做：男女通过电话做爱。性虎时光#\n106、网做：男女在网络上通过可视听的聊天做爱；\n107、冰火五重天：以冰块及热茶轮流用口吸奶头或私处；\n108、SN：桑拿；\n109、尻屄:kaobi，做爱，性交，交媾。尻，抽插的动作；屄，女人阴门；\n110、PWB:PornWorldBank、色情镜头博览；\n111、HJ，FJ:飞机；\n112、鸡胸堡：以胸部拍打脸部(可加奶油，巧克力)；\n113、大亨堡：用鸡鸡敲打脸部；\n114、喜从天降：将100元钞票丢至空中，两人以胸部夹击；\n115、满地黄金：将数张100元钞票洒至沙发上小姐全裸翻滚，钱沾到身上就自行收下；\n116、神鬼传奇：全裸互拥以卫生纸包扎全身；\n117、亚当夏娃：全裸互拥跳入大塑料袋中，将蕃茄汁由颈部淋下，再互舔干净；\n118、骑马打仗：全裸背着小姐绕场一圈；\n119、磨擦生热：用私处在客人身体上磨蹭；\n120、吮指留香：舌舔脚趾；\n121、九九神功：由小姐想尽办法将弟弟变硬、吊冰筒、高根鞋..等；\n122、溜滑梯：将婴儿油涂至胸部或私处磨擦身体；\n123、吸星大法：将蕃茄放至私处深处，用嘴吸出；\n124、上膛开枪：以嘴吸舔蛋蛋，打手枪；\n125、夫妻交拜：送入洞房；\n126、敲锣打鼓：用鸡鸡敲打胸部及臀部，各10下；\n127、码子：女朋友，女友，一般指kaobi.com(做爱)后的；\n128、灌单：将买单金额提高；\n129、盘子：指被骗的顾客；\n130、呼弄：蒙骗之意；\n131、双配备：既能秀舞又能作s的小姐；\n132、宰土羊：意指不懂行情不会看单之顾客；\n133、搬火山：指去风月场所之意；\n134、打真军：打炮；\n135、起双飞：一皇二后的玩法，就是一个男人两个女人混合玩；\n136、内射：射在小姐屄里面。性息乐园#\n137、出火：又叫交货，指男子射精；\n138、灌肠：肛交之前，将水从肛门灌入，清洗肠子；\n139、剃毛：将小姐阴毛剃掉；\n140、SM:性虐待，一种变态玩法。比如用皮带捆绑手脚，鞭子抽打之类；\n142、gay:男同性恋，同志，肛交为主；\n143、les:女同性恋，拉拉，身体按揉，阴部摩擦获取快感；\n144、性奴：甘愿受性虐待来获取心理满足生理快感的人；\n145、女王：相对性奴而言，对性奴发号使令的人；\n146、BODYMASSAGE:身体按摩，桑拿和洗浴中心的包房里有一种替你全身洗浴按摩服务:由全身抹满浴液的美眉用她的身体替你按摩洗澡。",
			"added": 1568723649,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1568723741,
			"title": "成都西藏饭店红宫洗浴红绳做爱（以前的经历）",
			"body": "【时尚地址】：成都人民北路10号西藏饭店3层红宫洗浴\n【时尚时间】：2007年12月\n【信息来源】：成都的朋友介绍的\n【时尚项目】：漫游、波推、臀推、红绳、全套\n【小姐数量】：几十个吧\n【小姐素质】：90分\n【小姐胸围】：38C（我觉得很丰满）\n【年纪身高】：年龄22岁；身高162\n【重点推荐】：红绳（在绳子上当着秋千做爱真的很爽！）\n【环境设备】：88分\n【时尚价格】：768元=268（洗浴+包房费）+500（全套，包括红绳）\n【安全隐患】：99\n【时尚细节】：\n朋友们都说西藏饭店的红宫桑拿很棒，晚上决定去爽一把。打车到地方后，在西藏饭店内做电梯、走走廊、爬楼梯终于到了红宫桑拿，虽然大厅不大，但装修还算豪华。就看见身着华贵服饰的迎宾非常客气地欢迎我们，然后就换鞋，进洗浴间，洗毕穿上浴袍，收拾停当进入休息大厅，说做全套就下一楼。一人进了一间房。房间还算可以，温度也调整得刚刚好，令人有一种做爱的欲望。根据本狼指示，妈咪很快安排进来小姐，选了三个以后，本狼终于选定55号小姐，身穿一身大红色调带连衣裙，前胸很低，能看见深深的乳沟和硕大的乳房（小弟很喜欢），长相也不错，更令人诱惑的是她有一个丰满的肥臀，在连衣裙下依然凹凸挺拔（真是令我兴奋不已）。按照小姐说的，我选择了红绳做爱全套（不带红绳400一位）。我躺在床上，这时让她开始一系列服务：漫游、波推、臀推，由于臀推时我身上抹了油太滑，她滑下来好几次，很是好玩!我看她已是气喘吁吁，香汗渗出。本狼心里顿生怜爱之心，她说没关系不累，还有红绳呢，说着就把随身的红绸丝带掉在房上的两个栏杆上，然后小姐就是一个倒挂金勾（把双腿缠在红绸丝带上，倒身头朝下）给我做口交，即便如此依然能每次深喉，套弄得我的鸡巴狂爽不已。面对这么个尤物，我的性致也很浓，紧接着就来了个荡秋千式（小姐面对我坐在红绸丝带上双腿劈开，我的鸡巴插入，然后就象荡秋千一样地干她）。身材太爽的时候也导致本狼不能太持久，只做了二十分钟左右吧!她很配合，我不停的猛烈的抽送，随着秋千的荡漾，我一次次深深的出入她的小bb，小姐淫荡的叫床声令我大呼过瘾，就在阵阵淫声中我的小dd终于再也受不住，倾盆而出，和那些淫水交织在一起！就这样就交枪了。\n【经验交流】：最后做完还剩近十分钟，她说哥哥你可以继续呆一会儿还我们再聊会儿天!她对我妩媚地一笑躺下来，说一边聊一边按摩吧!我们就这样儿着，我摸着她的大腿和BB!她抚摸着我的臂膀和阴茎，性爱在进一步升华!我想：下一回，我还找她",
			"added": 1568723736,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1568724121,
			"title": "郑州市大浪涛沙洗浴中心",
			"body": "【性息地址】：郑州市大浪涛沙洗浴中心\n【性息时间】：2008年4月\n【性息来源】：朋友\n【性息项目】：KJ+ML+红绳\n【对象名字】：几十个，自己挑\n【对象籍贯】：云南\n【对象身高、体重、胸围】：啥样都有自己挑\n【对象年龄】：大小都有\n【外形评分】：85\n【环境设备】：优\n【安全隐患】：应该还好\n【性息花费】：500\n【性息细节】：\n和几个同事到郑州，去大浪涛沙洗澡。换衣服时，有服务生帮你擦干全身，并拿好一次性内裤和休息服。\n休息房，是独立的小房间，大约8个平米左右，放着那种靠背的长沙发和茶几。服务生送来水果一盘，开水一杯，还有几支香烟。我喝了两口水，看了会电视，等服务生带我去按摩房。\n按摩房里面只有一张床和一个床头柜，和刚才的休息室差不多大。只是灯光暗了许多，有一点发红。按摩小姐身高不低于165，素面朝天，长发披肩，唇红齿白，落落大方；穿着一套非常职业的套装，是那种办公室职业的黑色西服和短裙，手里还抱着一个工具箱，看上去绝对是一个正规的按摩小姐，甚至给我的感觉是良家，有点让我着迷。于是点头示意可以。服务生退去，小姐关上房门。其实关不关都一样，门上有一个大大的窗口，里面看得一清二楚。小姐开始介绍服务内容。最基本的按摩198元，还有推油和全套等等。\n我想来个推油也是不错的。小姐说，先生你看做个全套好吗？我有点诧异，问：是你做吗？心中想，如果是你的话，我就要了。小姐笑笑：当然是我了。晕，这么清纯的小姐也做，有点走眼。小姐报钟，并从工具箱拿出一块绸布，把门上的窗子挡起来了。而后脱去自己身上的衣服。我这下看仔细了，胸很挺，估计有34D的样子，全身非常协调，感觉没有一块多余的肉，但是用手不论摸到哪个地方都很有肉感，皮肤也非常细腻。小姐开始漫游了，依次口含热水和冰水，从耳朵开始，顺着后背，轻轻地，柔柔地，像是一团云彩在你身上抚摸，超级享受。先是背面，再是正面，并重点照顾了我的ＲＴ和腿内侧。\n小姐在进入下一程序前问，先生你的耐力怎么样？我说，一般。小姐说，那要不要先带上套子？这样的刺激会小一点，不容易很快就被吹出来了。我说，这点不是问题。我自信适当的ＫＪ是不大容易就让我交枪的，除了那种专营店才会让我在５分钟内交货。但还是感觉到小姐的敬业，没有让你立即交枪走人的意思。小姐的水平真是没得说，一下一下都很到位，一会儿深到喉咙停留几秒，一会儿又只吸住头研磨几下，一会吹气，一会又吸气，一会舔，一会儿又磨蹭，一会儿又轻咬冠状沟部，一会儿又用舌尖往马眼里钻，让人又痒又麻又爽又刺激，还间歇性的发出那个渍渍的响声。我的手也没闲着，感受那对丰满的乳房所带来的良好手感，从视觉到听觉到感觉都是那么的好，刺激。\n前面完了，小姐让我翻身。那柔软的舌尖不知在我的屁眼门口徘徊了多少圈，舔得我全身酥麻。终于钻了进去，还在抖动！又一下下地往里面插，我能明显得感受到舌头前端卷起来像是一条小肉棍！我快受不了了！忽然，一阵超级凉意和略微的痛楚从后门往里一钻，原来是小姐用舌头把几个碎冰块顶了进去，并用舌头死死的抵住。过了一会儿，又一个东西进去了，我感觉到那是吸管。小姐把里面化成水的碎冰全部吸了出来。而后又是一口热水吹了进去，再用吸管吸出。如此往复几次，我已不知今昔是何年了。更不知道时间是什么时候了。这就是传说中的一剑穿心！\n再翻回来，小姐看小弟弟有点垂了，再用冰火之法吹之，很快又冲天而起。小姐问可以带上套上做吗？我在感觉到爽极之时，说，以前在南方体验过红绳子，那种感觉很爽。不料小姐说：我们这里也有红绳子，并且是南京第一家和最好的一家。我不信。小姐问，那你想要红绳子吗？红绳子全套500块，只比做这样的全套多几十块钱。我当然是试了。小姐说，好，我们换个房间。于是又打电话问：红绳的房间有吗？得到肯定答复。于是小姐拿了块毛巾把身子一裹，就要往外走！\n我叫一句：“就这样出去了？”小姐停下正在开门的手，想了想，还是把衣服又穿上了，但是内衣都没穿，而是放在手上拿着。还要把我的那条一次性内裤给我套上。我说：“不要穿了吧！”小姐说：“最好还是穿上吧！这样卫生。”还真是体贴人的妹妹冒。\n从房间出来，我已经分不清东南西北了，只记得是往里面拐了个弯，而后又拐了个弯，前面没有路了，是一堵墙。小姐说：到了。推开最后一个房门，开灯，进去了。在路上，顺便问了小姐的名字，叫小向。\n新的炮房时灯光比刚才的房间好像还亮一点，也许是刚才走黑路带来的感觉吧。大小差不多，也是一张床和一个床头柜。但是那张床开始让我血脉喷张！那是怎样的一张床呢？我只见过在天花板上打杠挂红绳的，这里不是！红色的床身，结实的四条床腿，床的四角伸出来四根粗壮拱形的钢管，在床的顶部汇合，在顶上又有横向的四根钢管把拱形管牢牢的固定在一起，在与床同向的两根钢管上面垂下来两条宽大长长的红布。床的下部是一个控制系统，有三个档位控制。莫非这是一张自动床？！我已心狂。\n小向把门封好，挂上了布帘，已经脱得一丝不挂！小向再一次问：“要不要戴上套子？等会儿会更刺激。别出来了，冒在我嘴里就不好玩了。”我再一次否定。小向说：“我们接着来。”很温柔的除去我身上的短裤。\n小向在床上比划好长短，把绳子固定好，试了试是否结实，为了防止出事，我还上去拉了拉，很牢固。我在床上躺好了，等待享受的时刻。好一个小向！只见她抓住绳子，猛地一个倒翻身就头朝下脚朝上了！动作幅度之大都令我吃惊，这也是一个女孩子的动作？！\n红绳第一式：天旋地转。小向用双腿缠住红绳，倒着的小嘴正好够到我的小弟，于是毫不客气，一口吞入，几到根部！我的小弟弟已经怒目而视。小向先是常规动作动作做了十几下。而后，含住我的小弟弟，手按在我的肚子和大腿上，由左到右开始旋转。一圈，一圈，又一圏，估计有１0圈左右吧，随着转动圈数的增加，红绳子的上部紧紧的缠绕在一起如麻花一样，小向的呼吸也变得急促起来，看得出她很吃力。学过物理的都知道，这么多转圈的目的在于积蓄势能，如同手表上发条一样。此时，小向松开手，只用嘴含住龟头部分，哦！天哪！小向在上面由于红绳的作用，整个人开始在空中旋转起来。我的小弟弟在小向的嘴里面跟着转动。小向张开双手，如同飞天的仙女。我的小弟弟也在做摇圈运动。小向的嘴里面炙热且光滑，令我产生一阵阵酸麻的感觉从小弟弟处直冲脑门！要坏！精关不保啊？我赶紧收收心，控制了一下自己的迷乱心情，深呼吸一口。我尽量让自己是去想想革命先烈、保持***员先进性以及三个代表等！还好，没有丢人！小弟弟还更见雄伟。小向又开始从右往左转圈，一样动作，一样的迷人，一样的刺激，一样的爽！不过这次没感觉要冒。估计就像跑长跑一样，过了那个极限点以后就没关系了！\n小向从上面下来。又问我，“你玩过沙漠风暴吗？”我说：“听说过，还没试过。”“那要不要试试？”当然要了！只要是新奇的和刺激的，以我的本性来说，没有不尝试的！小向打电话要来一瓶冰可乐，从工具箱里面拿出一包跳跳糖，撕开口后全部倒入口中，再喝上一口可乐，然后把我小弟弟一口吞入。冰可乐太冰了，我小弟弟有一点麻木了，虽然能够感觉到跳跳糖在小向的口里面猛烈的跳动，但是对于小弟弟的刺激不是十分明显，不过那种点点跳跳的状态还是让人足够兴奋的。小向的舌头还在里面不停的搅动，逐渐地小弟弟开始升温，感觉也开始起来了。持续了有几分钟，跳跳糖已经不是很强烈地跳动了。小向把可乐和着跳跳糖的满满一口吐掉后，又用冰可乐给我单独含弄了一会儿，又用热水再来一遍，说是洗一洗。我的小弟弟已经是处于高度兴奋之中了。小向这时说，来吧！于是用嘴给我带上套套。我一看，呵呵，还是杜蕾斯超薄装！星级的服务就是不一样！\n红绳第二式：扭转乾坤。小向又座在了第二根红绳上面，两腿分得很开，挂在第一根红绳上面。我站在两根红绳中间，扶起小弟弟，摸了摸小向的B，已经是潮水泛滥，我猛地朝里面插进去，一下子就干到底了，毛毛都碰在一块。我两手抚摸那对丰满的乳房，几乎不需要动。因为小向借着绳子的晃动，像一个仙女在荡秋千，一下下的吞没我的小弟弟！几乎次次到底。我也感觉小向很有状态，她两目微睁，每干一下就轻轻的哼一下。完全是那种想要的骚样。下面水也太多，我一摸，红绳的布都湿掉了。加上小向还在说：我快受不了了！这样的浪叫，只会让我干得更狠！同时，我的手还不停地摸她的已经突起得像一粒黄豆！就这样连续干了有５分钟左右，小向突然一把松开绳子，猛地直起上身把我一把抱紧并抖动着。抖动持续了十来秒钟后，小向说：“不行了，我没力气了！我在上面躺不住了。”我感觉到那是真的高潮。因为小向的脸和乳头都发红了，眼神也开始迷乱！我问她，她不告诉我。只叫我自己体会！那一刻，我觉得我自己像个君主，统治了整个世界。真得，非常自豪。我的小弟弟还是挺拔依旧。我又把小向翻了过来，变成趴在上面，这样她就可以省点力气，我也可以干我最喜欢的后入式。我算是明白了什么叫老汉推车！我双提着小向的两条修长的白腿，站立着，小向趴在绳子上，我从后面不停的干她，就像一个老汉在推他家里的独轮车一样。太形象了！以前都是在床上面趴着用这一式，不能体验到其中的精华，今天算是过足了瘾！又是一气插了可能有七八十下。我都觉得奇怪，我今天怎么这么能干！但是我的体力也消耗很大。虽然有空调开着，身上已经开始出汗。小向在高潮过后休息了几分钟，对我说，你躺下吧，我来。我确实有点累了，我说，小向，你真会体贴！小向娇笑：你真的很棒！听得我心里美美的，真是舒坦。于是平躺到床上。小向一个跨步上来就把我小弟塞了进去。然后开始大起大落地套弄我的小弟弟。过了一会儿，小向说，我搞不动了。我休息了几分钟，体力有所恢复，于是一个翻身，把小向压在了身下，猛烈地干进干出。又是几分钟，我也累了。我说，我也搞不动了，怎么办？突然想起床来。小向也说：想不想试试这张自动床？当然想试了，差点都忘记了！\n红绳第三式：自动瞄准。小向两手扶着红绳子，并把床的开关打开，调到一档。只见床中间突出来一块，一下下的往上鼓动。我挪了挪屁股，好让鼓动的地方正好能够让小弟弟伸缩自如。小向又跨了上来。这下认谁都不用动了，床在动，一下，一下，又一下，不停地住小向的１３里面冲击。我又伸手去调节到了二档，速度一下子快了很多，小向又开始在上面叫了。什么受不了了，快不行了，要给搞死了什么的。我又调动了三档，更快了！速度可能达到一秒种两到三下左右。小向紧紧的拉住绳子，为了不使自己全部坐到我的身上来。因为这种速度、深度和强度，她已经不能够接受了。她大叫：不行了，我要给顶死了！急急忙忙地把床关掉了，一下子瘫在我身上。我说，怎么不行了？小向说：你是不是吃药了？我笑：我从来不吃药！自豪啊！小向说，要不我把你吹出来吧。我说，怎么了，不行了？不用吹，再来会儿就差不多了。我还想享受一下这张床呢！\n小向又上来了。说，不要调最快那档，我受不了。于是帮我调到二档，不快不慢，正正好。我也觉得已经玩到位了，完全享受起来。把什么共产主义、革命先烈、先进思想什么的全部抛到脑后，全部精力集中眼前的可人儿身上，小向在努力地用她的最后一点力气使劲的夹住她身体里的那条龙！终于，在床的连续动作下，在小向胡乱的叫喊声中，在瞄准了许久之后，一下子射出了我的万千子孙。我分明的感觉到小弟弟跳动了好几下，小向也在夹紧她的小１３。在我发出最后的吼声后，两个人都一下瘫倒在床上，以至于小向都没有把我的小弟弟从小B里面拿出来，只是趴在我身上喘气。我也一把将她抱住。\n郑州西站路华星洗浴-红绳-镜子！！\n【原创】郑州西站路华星洗浴-红绳-镜子！！\n【嬉点地址】郑州市西站路窗帘大世界旁\n【嬉点时间】2006年7月28日\n【信息来源】自己开发\n【服务项目】漫游乳推吹萧冰火地中海红绳打炮洗浴睡觉\n【小姐数量】15左右\n【小姐素质】80\n【环境设备】80\n【营业时间】24小时\n【价格一览】200全套（门票20你要说免掉）\n【服务态度】88\n【安全评估】100\n【验证细节】郑州市西站路窗帘大世界旁的华星洗浴，在西站路南面一个院子内。2006年7月28日晚上突然浑身骚动，精虫翻滚，想找个地方放松。好象以前在论坛上听说过华星这个名字，就到西站路上寻找了。大概凌晨1点我道了大厅，就有小弟亲切招呼，不过靶台内是一个中年妇女，后来知可能是老板娘。换鞋，拿了毛巾，小弟朝二楼高喊：216，贵客一位！上楼后又有小弟忙给开门，进屋后小弟就说：哥哥，冲冲吧，上楼看看。我就想肯定了。快速冲洗完毕，有小弟带着上了三楼，叫开一个防盗门，一个吗迷过来：弟弟，在楼上包间做200，在你的房间小姐包夜400。我暗想，听说楼上房间内有工具呀。就在楼上吧。\n这时候吗迷叫了一声：有客人！从一个房间里出来4个小姐，真是各有不同呀！高矮胖瘦，各有特色！我喜欢一个较瘦的身材也不错的。小姐立刻说：哥哥先来这个房间，我去拿工具。我在走廊里还听到一个房间里穿出小姐淫荡娇滴滴的叫床声，马上有了感觉呀。进了房间，一个双人床，上铺一次性床单，一个电视正在播放着A片，我正在欣赏画面时，小姐提者一个澡篮进来了，我一看有：按摩油，TT5个，两杯水，一杯冰块，一包湿巾。小姐坐在床上，摸者我的mm说，哥哥我帮你脱裤子吧。我马上抱着了XJ，开始亲她的耳朵和脖子，她立刻淫荡的叫了起来。我不喜欢她一下子脱的光光的，我说把长裙脱了，只剩下上下内衣了。开始漫游吧。XJ口含了一口温水开始在漫游，先从我的脖子、MM、胸部、肚子、大腿一直到脚趾，然后我翻身过来，她润滑的小舌又开始在我的背上滑动，一直到PP，爽死了！！这时她拿出擦湿巾了我的DD，开始冰火。先是一口热水，我的DD在她口中来回抽插，突然她又含了一口冰水，这样来回作乐3次，真刺激！小姐让我翻过身子，拿出湿巾擦了我的后门，然后用舌头添，插，我说，MM，你想用舌头奸我呀！哈哈。这一说，XJ更是用劲了的舔插，搞的我DD都有点受不了了。\n这时我想起来怎么这房间没有镜子呀，就问XJ，她说在对面的房间，我说换换房间吧。我们就这样赤身裸体拿起衣服到对面的房间了。里面没有床，有tatami，房顶上有两根钢管，掉着红布带子。\n我站在镜子前面，让XJ跪着给我吹吹，看者镜子中的我们，感觉别有一番风味！吹的我快要受不料了了，我说推油吧。我躺在床垫上铺有塑料布，XJ给我身上摸上油，小姐让我给她摸，我就把油在她的MM和肚子上，她用她丰满的双蜂给我上下推，一直推倒我的小DD，给我套弄的早硬起来了。小姐说带上TT吧，她趴在镜子前，我在后面插了十几下，感觉硬度更大了。我说上绳吧，她上了绳子，象坐秋千一样，我站在她前面，她调整好高度，正好能插入，就这样来来回回二十几个回合，实在不幸了。我拽掉TT把我的精虫全部射在了XJ的RF和肚子上。真是精辟力尽了。躺下来，XJ用湿巾给我DD擦了，又给自己擦擦。我们相互拥抱着聊了聊，知道她是一个东北妹子，25，叫海宁。我们前后两个小时，感觉不错。下楼冲冲，去房间倒头就睡。第二天早上起来洗涮完毕下楼结帐200走人。\n【总体评价】安全（据说有背景），环境一般，小姐服务态度好，经济实惠。85分吧桑拿工作时的真实见闻与体会本人在桑拿从事了多年的管理工作，想写点自己看到的一些事，有点乱，但绝对是小弟在桑拿工作时的真实见闻与体会，一句话：小姐也是人，也很不容易。。。。。\n\n\n1.小弟不想去过多的介绍这一行业里的服务项目内容，网上介绍的太多了，我只想写一些我与小姐，客人接触，还有那些发生在这个行业背后的一些事，可以说是我的工作体会吧。小姐确实很不容易，在我看来不管场子档次高低，小姐的地位永远是这个社会最低的。\n2、她们也许会跟你做最好的朋友，会很讲义气，她们也会去深爱一个男人，但是她们不喜欢身边的人同情她们，选择了这条路，她们不愿意去承认和面对自己在这个社会是被可怜的人，要想对她们好，要想去怜惜她们，那么去光顾她们的身体才是在她们看来最实在的关心。对于小姐来说，吃饭睡觉的时间是无法掌握的，因为嫖客不会定时间来光顾。小姐有时刚点来快餐，刚扒几口饭，＂点钟＂（客人指定的某号小姐）来了，于是把嘴一擦就跑去上钟，还要在短时间内补补妆，在包厢里帮客人波推、ＫＪ、毒龙、红绳、ＭＬ等服务做了一个多小时下来，继续吃饭……她们对这种事已经习惯了，记得有次一个小姐嘴巴里含着饭菜去试钟的，结果刚好点到她，她趁客人不注意赶紧把饭菜咽了，做服务时发现那客人下面是包皮，可能长时间不清洗往下一翻一层白白的污垢……她说当时看了恨不得连昨天的饭都要吐出来了。【我们这有一般式的包厢，只配卫生间的，不能在里面洗澡，满足低消费客人，他怎么洗就不知道了。除非客人要VIP房间，或是先去专用洗浴间由小姐伺候洗的宫廷盐奶浴，一般普通全套的客人只能自己在公共区洗。小姐每月一次的例假来了后，这时经理或者部长就会让来例假的小姐到卫生间里，让她们当着面用棉签插进下面然后抽出来“验证”，没办法的，因为有些小姐会骗人──为了休假。用此办法之前我们曾被骗过，某些小姐用红药水洒在卫生巾上给我们看说自己来例假了要休假，甚至还有跟与自己关系好的女服务员借用过或正在用着的卫生巾来混淆骗过我们的……哎~也许太累了，是不想因为请假被扣钱而逼出来的……\n3.有种说法，一帮小姐在一起呆久了处在一个空间里，会互相影响经期，经常会神奇的同时几个小姐来例假，这时会产生小姐不够的现象，如果有几个还没来或者知道自己马上要来例假的小姐，我们会要求她们服用一种药物（名字我忘记了），这种药吃了以后会将来例假的时间延后，但是服用的小姐会变的脸色苍白，易怒，烦躁，厌食……甚至因此而导致月经絮乱症。\n4.小姐最怕的就是跟客人ML时突然来例假，客人最忌讳最讨厌的就是享受服务的过程中小姐来例假，我们最烦的就是以上情况发生，因为这样的话必须为客人免单。有次，一个新来的小姐急急的打总台电话找我上去说出事了，我赶忙冲去包厢，一进去发现那小姐下身到大腿全被血染“红”了，那客人盘腿坐在床上，双手搭在大腿上，手和腿上还有那话全都是血，客人无辜的看着我的眼神好象他刚误杀了人一样……于是这单免掉了，还要跟客人赔礼道歉。那客人对我说：“兄弟，我可是靠炒股吃饭的啊，最他*的怕见红……我的股票要是跌了我可要找你麻烦！”（补充一下，我那时听了也没多想，估计这是一种逆反心理吧，炒股的客人一般喜欢反向思考。就好比我们平时看到血也会不由而然的觉得会有血光之灾到来一样，是一种精神上的忌讳。）我开玩笑的说：“大哥，我们这难得有客人中这种标，可能是您运气好吧，赶紧去买注彩票试试去。”\n5.做这行什么样的人都能见到，而且是见他们最“阴暗”最不为人知的一面。有个大学教授是我们这的常客，每次来都带一个皮包，里面放了一根假鸡〈！-->巴和一个MP3，上他钟的小姐，必须先戴上MP3随着里面的音乐在他面前跳艳舞，然后他就自己打飞机，跳完后他让小姐拿假鸡〈！-->巴捅他的屁眼……有次他来的很晚，上他钟的小姐事后跟我说：“我捅了他一个多小时，捅的我手都酸了，后来不小心一打滑，捅到他的蛋蛋上，疼的那客人大呼小叫的。”还有一个客人喜欢叫小姐拿吸管往他屁眼里吹气……还有一个客人喜欢在小姐为他口交时撒尿……还有个客人喜欢一边用手指扣小姐下面一边打飞机……哎呀，反正什么千奇百怪的客人都有。\n6.小姐们练基础＂口技＂时，就是买香蕉回来，然后一人叼一根，半小时后拿出来看，香蕉上不许有牙印。\n7.小姐们在技师房里经常一边看Ａ片学样子一边吃饭。小姐最引以为豪的一句话“老子可是什么鸟都见过哦~”\n9.小姐也会在网上拉客，但是这种是她们赚的外快和她们的私事，我们一般也不管，别耽误上班就行。\n10.小姐只抱怨或感叹两件事，一件是“哎，怎么客人那么少啊”；另一件是“哎，累死了，今天喂完这帮臭男人还要回去喂老公”。小姐都有老公，她们老公的角色90％主要是＂小白脸，混混，赌徒，鸭子＂，还有10％是喜欢长期包养小姐的有钱人，拥有混混和赌徒这两种老公的小姐，她们老公来接她们的第一句话就是“今天上了几个钟？”，如果觉得他老婆上的钟少了，就会破口大骂…….拥有小白脸和鸭子这两种老公的小姐，她们老公来接她们的第一句话就是“宝贝今天累吗？”，然后反过来悄悄问我们部长“我老婆今天上了几个钟”。如果觉得上的钟少了，就会请我们经理或者部长喝酒，桌上称兄道弟的希望我们能多介绍客人给他老婆…\n喜欢长期包养小姐的有钱人一般不来接也不会关心他们所谓的“老婆”，因为他们本身就是嫖客……\n11.小姐由于长期劳作，下面经常会引发炎症，于是她们的工具包里除了化妆品和服务用品外还有一瓶”妇炎康”，我们一般一个月带他们去体检一次，炎症好对付主要是怕她们得病，懂的人一般知道，女人如果下面有炎症，身上会有股味道散发出来，在封闭的小姐房里，一走进去就能闻到那种气味…闻的多了，我觉得我现在有项很强大的功能：靠近某女一闻，就知道她是否有炎症…\n12.小姐房里小姐们聊天的内容很杂很多样很本行：＂那天那个客人下面好大，疼死我了，妈Ｂ的老子还要装舒服。。＂，＂我的Ｂ毛好象少了，来，让我看看你的撒。。＂，＂现在套子做的好差，我那个客人戴着不舒服。。＂，＂刚才跟某号双飞，我帮客人推屁股推的我都高潮了他还没好。。＂，＂昨天都那么晚了，那个熟客还要来干我，××妈Ｂ的。。＂，＂我又打胎了，这个是第Ｎ个了。。＂\n13.有次下午来了个客人，选了个新来的小姐，过了半个钟（一个钟为45—50分钟）左右服务员打电话下来说客人投诉，到包厢后发现床上一滩血，这个客人说小姐服务差不配合，小姐哭着告诉我说＂客人不要做服务，只喜欢用中指扣我下面，都出血了他还要扣，而且越来越用力＂，我让小姐服务员把小姐扶走，我忍着气对客人说＂先生，＂扣小姐＂这种服务我们这还没有，请您别这么做，您把小姐扣伤了她就不能上班了＂，客人狡辩说＂操！我没扣她啊＂，他说这话的时候右手抬了一下，我看到了他那只变态的手指上还沾有血迹，而且那指甲跟清朝宫女戴的指套差不多一样长。。。。我们的处理办法是：让客人赔钱！什么？你说客人不赔怎么办？哦，这个没事，因为楼下已经有我们叫来的10来个＂黑保＂等着呢，做桑拿的都是黑白通吃，没办法，这个时候我们必须维护小姐们的根本利益，说白了也就是＂小姐受伤了，人数减少了，我们吃亏了＂\n14.红绳又称荡秋千、红粉佳人，由来已久，最初始于日本，后先传入中国武汉桑拿界，又被全国各地的其它场所效仿。红绳材料一般选用价格较贵的红色丝绸（质感好，不会磨损皮肤），截取合适尺寸后将之悬挂于包厢内的按摩床之上，使之成一弧型，服务全程都由小姐坐或者倒挂在上面完成。该服务被誉为桑拿服务里最有技术含量的项目，共有36式，其中19式最为普及，据说功夫好的小姐用到第4招一些客人就无法招架了。。。。有技术含量的也就是空中飞人，天女散花，俄罗斯轮盘，这几招，其它的都是凑数。F现在流行椅子功（也戏称为婴儿床），专门购置了数台价格不菲的性爱椅。其实桑拿服务的花样已趋于饱和，有些太夸张的服务虽然新颖，但是不实用，还是朴实一些比较好，小姐漂亮能干最实际。\n15.小姐发彪时跟客人说＂你回去干你老婆吧！＂，小姐高兴时跟客人说＂宝贝你好厉害哦！＂，小姐难过时跟客人说＂宝贝慢点，我下面干了。。＂，小姐疲劳时只跟客人说＂哦，哦，啊，啊。。。＂吃多了避孕药，腰两测会长赘肉，小姐为了保持身材一般没事不吃的。除个别喜欢不戴套的客人ＭＬ后射进去了，一般小姐下钟后会马上吃紧急避孕药。\n17.沙漠风暴属于冰火服务系列的一种，就是多了跳跳糖这个道具而已，现在我们这已经过时了。跳蛋是性用品，男女皆可使用，因为我们这个城市市场对这种需求的客人较少，所以一般小姐不佩带，有些客人（比如那个大学教授）会自己携带性道具，因为他们怕小姐带来的脏。\n18.桑拿小姐跟坐台小姐有个根本的区别，就是在称呼上，坐台小姐不管怎么变都是称呼她们三陪，小姐，鸡，桑拿小姐还有个比较正规的称呼“技师”。。。。其实我想也对，技师嘛，“妓中之师”，桑拿小姐的功夫的确在同行中是最优秀最有技术含量的。哎，反正小姐这个称呼已经被搞臭了，见到女孩不能随意称呼别人小姐了。。。。。国外除外。\"\n19.小姐们经常会在师傅（通常小姐中年纪最长，功夫最好的一个）的组织下进行服务强化，用来培训的资料大都来自自己看A片时产生的灵感和其它场子推出的新服务，综合以后进行训练俗称“练功”。搜集其它场子服务情报的任务就是由我们部长（必须是男的哦）负责。。。我们管这种行为叫做考察（呵呵，就是“靠插”喽），主要是去学习和观察其它场子有无新的服务项目，别以为这差事很爽，搞不好还会“中标”的，老板倒也厚道，说“你放心去吧，得病了公司会帮你报销”（>__<），通常这种情况发生了小姐会使用“跳钟”（不是跳牌）的方式同时运作，就是跟这个干会儿再跟那个干会儿，这可需要口才和功夫双管齐下才能搞定，有些客人不喜欢为自己服务着的小姐在自己还没离开前给别人玩的，最多时曾遇到4个同时来同时要马上解决的，当然就是我们这的红牌啦，那次我安排完这个小姐的客人就出去吃饭了，40多分钟后回来，在包厢走廊遇见她正在跳钟，她满脸潮红的笑着对我说“你才回来啊，我刚才都跟3个干完了\n23.桑拿管理做久了真的也很枯燥，有时没事幻想着是否能把桑拿的管理和经营模式改成像美国西雅图的帕克鱼铺那样活泼快乐，咱来个中西结合，像翠花楼那样扯着嗓子喊“×号~出来见客啦~”，“服务员招呼~上房全套客人一位~”，“您下钟啦~爽好了吗您~”。。。。呵呵别扯了，人家那卖的是鱼，俺们这卖的是B，这么整非把场子整封了不可。。\n24.桑拿部长也有女的当的，负责的工作内容是一样的，只不过不能去考察，不能去作靶子，有些场子女部长是从小姐中选出来的，也可以跟客人上钟。为了提倡严格规范的管理制度和氛围，我们这不这么安排，都是以男部长当家。桑拿主任这个称呼在广东用的比较多，其实跟部长是一样的，根据不同场子的制度和责任，其权利各不相同。老实说写这个行业的事其实有点沉重的感觉，所以我专门加入了一点颜文字表情符号，希望能使它活泼些，也希望大家在看的同时能对我们这些“幕后工作者”的行为和心态有所了解。\n25.客人很了解女人吗？也许吧，客人很了解女人用品吗？不一定，有次小姐打电话下来说客人要换小姐，可是这个房已经开始服务20分钟了，按规定超过15分钟只要不是特殊原因是不给换的，除非客人愿意签一个钟的小费给小姐，可是这个客人不愿意，还说我们这乱搞，安排来例假的小姐给他，我说“不可能的啊，安排来例假的小姐上钟除非我们有病”，客人让小姐脱下内裤给我看，说“你看！她里面垫了卫生巾！”，我一看，靠~这是护垫嘛，保洁下面用的，不是卫生巾。。。我赶忙跟客人解释，我说“大哥，您误会了，这个是一种保洁产品，好象是娇爽护垫（我见过，我女朋友也在用），是MM保持下体干净的，您看上面没有血，不是卫生巾啊”，客人死活不信有这种东西，解释了半天，这个客人竟然说你要是拿包装出来给我看我就信，NND没办法，问小姐，小姐说这是最后一片了，去找其它小姐，大部分上钟去了，还有的不是用这个牌子的样式颜色不一样，我拿着条内裤楼上楼下跑了两转就差找其它部门的女同事问了囧，后来没折，只有跑去场子对面的超市里买，长那么大见过但还是第一次买这玩意儿，为了不至于尴尬，我想我就用买烟的方式吧，不知道价格，刚才急了也没问小姐，买的时候我很潇洒的甩出一张二十块钱给超市女收银员，说“给我来包娇爽”，女收银用异样的眼神望了我一下，对那边货架的同事喊到“×美女，拿包娇爽给这位先生”，那美女喊到“他要卫生巾还是护垫啊？”（娇爽有卫生巾和护垫两种系列）。。。。靠啊，喊什么啊~整个超市的人都往我这望过来，没见过穿西装打领带的男人买这个吧，我这下真是囧大了。。。。好不容易把护垫买回去给客人看了解释了上面的作用说明，客人相信了开始爽了，护垫买了送给小姐了，我TM开始郁闷了。。。。\n26.有些客人经常跟小姐说“下次来我还找你”，结果没来。有些客人经常跟收银员说“钟费应该打折的吧”，结果没打。有些客人经常跟服务员说“小姐要点什么饮料你必须先要告诉我”，结果没点。有些客人经常跟我们说“这个还可以，下次要帮我安排个更好的哦”，结果是下次来他还点这个上。有些客人经常跟他朋友说“这里我很熟的，等会你要多选两个”，结果只选了一个。有些客人总是电话里说“我在外面忙着，不方便接电话”，结果是让我们接，说他在开会。\n我们经常跟客人说“这个小姐的服务是全场最棒的”，结果其实是一般的。\n27.“12号”，这个可不是日子，是一个小姐的牌号，她不是红牌，但绝对是我认为最优秀最敬业最不是被迫做这行的小姐。24岁，个子不高，长的有点像刘青云他老婆叫郭什么来着？。。她很强，真的，旅游旺季时，一天最多上过11个钟（其中部分并不是2个钟时间全满才下钟，2个钟是全套标准时间，1个半小时左右），别人上了六七个都累趴了，她还满脸红扑扑笑着跟没事儿人似的，她跟我说她做小姐之前好象得了某种亢奋症，一看到男人裆部就想那啥。。。。可是以前又很腼腆，不可能烂的满街找男人找到就上吧，后来她朋友开玩笑说她做小姐挺合适，她还真来做小姐了，她做了以后说想不到还有这么能挣钱还能满足自己那方面的工作啊：-_-X：（我可不是在歌颂这行，例外，她完全是例外）。。。。什么？您问她怎么厉害啊？这么说吧，就说我朋友来玩那次吧，我那朋友就喜欢“够劲”的，结果我安排了12号给他，只记得下钟后是我去包厢接他的，呵呵，当然没那么夸张，我只是在等他，因为他放在我这的手机一直在响，只见他右手扶墙，左手搂着12号从包厢里出来，慢慢的走。。。12脸色红润，他脸色暗黄。。。。被吸了不是，后来我才知道12跟他啥服务没做，尽ML了，做了5次半，做完一次12就用口技帮他H起再继续，剩下那半就是他实在不行半途而废了，12号实在无法使他雄起了就温柔的帮他按摩，直到到钟才搀他出来。。第二天上班12号还问我“你那个朋友没事吧”，我说“放心，他没老婆，回去不用交公粮”，我打电话问我朋友，他说“你是不是知道我喜欢猛的，专门给那小姐吃药啦！MD，她那下面跟开水厂一样的，我都不要了她还要，也不是这么个敬业法吧”。。。强大的12号啊，我永远记得周年店庆那晚我们在卡拉OK喝醉了，送你回去你跟我‘练’的那一夜，吾精尽不人亡但也半死了。。。。\n28.前面扯着扯着扯到我们跟小姐的关系了，嘿嘿说说吧，很多场子是不允许管理人员与小姐发生关系的，但是小姐又偏偏总会送上门来，谁叫我们是可以为她们介绍客源的部长呢。。我们这儿有句俗话嘛‘B从门前过不干是罪过’，只要别张扬没人会知道，小姐也超现实，跟你做了，想发展的话那就保持秘密关系不公开，不想发展就当是一夜情，像我跟12号那样的，第2天起来穿好衣服各干各的，还是同事关系。在这还是友情奉劝一下那些希望跟小姐发生美好爱情的兄弟们，还是不要伤害自己连累了她，小说里的浪漫感人故事很难发生，真爱很难拯救她们的，大家都是成年人，有需要有感觉就互相补给一下行了。这世上阿尔芒很多，但是玛格丽特很少。。。。。。。我刚做桑拿部长那年，就曾爱上了一个小姐，后来悄悄在一起了，整天上了班就是看着她跟别人ML，下了班就是抱着她跟我ML，后来爱也没了，就剩ML了，当然跟我发生关系的那段时间她的点钟也比以前多了，都是我暗中操作的，这也算是另一种方式的交易吧，谁也不欠谁，后来她做了场子的师傅。。。。。说实话，自己干桑拿这些年也跟不少小姐M过L了，感觉也没啥意思，就是技术好点，她们求财的同时空虚寂寞好冷，我们工作的闲暇无聊落寞心痒，做我们这行找伴侣很难找性伴侣倒容易，别人工作的时候我们在睡觉，别人睡觉了我们还处在兴奋时间，交个正常的女朋友出去吃饭，她朋友的老公这个是白领那个是干部，我呢。。桑拿部长，你说要是饭店经理那可能还好介绍说说客气话拉近关系，“哎兄弟，有空去我那吃饭啊”，对吧，“哎兄弟，有空去我那桑拿全套啊”。。。。靠，我女朋友的朋友不集体翻桌子才怪呢，于是不久女朋友也分了。。。。\n在我一岁的时候父母就离婚了，我与母亲在一起生活，我妈是个典型的家庭妇女，知识份子，可惜她身上的优良传统我是一点都没继承。长大了以后我才慢慢明白童年阴影这个东西真的会影响一个人的一生，于是我现在对婚姻根本就不抱什么幻想。在我所生活的那个大院里，从小玩到大的一共7个人，从小我们就有了“各司其职”的想法，各有各的梦想，由于我妈经常出差，一出就是10天半个月，所以我经常带着我们院哥儿几个到我家来住，我16岁时就在家里组织女孩跟同伴一起集体mL。。。。。我们在院里除了“杀人放火”没干，基本上什么缺德事都干了，就是这样的一群人，现在长大了能把自己‘梦想’坚持到最后的也就我和另一个兄弟，他从小喜欢航模后来做了航模工程师，我从小喜欢带着问题女孩从事‘不法行为’，后来做了高档皮条客，其它几个有去驻港部队的，有当黑老大的，有做珠宝鉴定师的，有当律师的，还有可以把什么锁都撬开的。。。。怎么说呢，我做这行也是迫不得已，也许是命吧，反正做其它的都不顺，偏偏搞娱乐休闲这行特别投缘，我也认了。\n30.很多场子都有称之为“金鱼缸”的设施，其实也就是一面连接小姐房，里面看不到外面而外面可以瞧见里面的玻璃墙，有些熟客我们会领他们到这来直接选小姐，在客人准备去筛选之前我会按一下手里的对讲机，另一个放在小姐房的对讲机会发出‘滴，滴’的声音，这时小姐们知道要被选了，全部摆出妩媚的姿态，有撇开大腿的，有专门撩起裙子漏出半个屁股的，有赶紧拉紧内衣挤露出乳沟的，还有朝玻璃墙这边猛抛眉眼的。。。。。客人在外边指好了，我就安排客人洗浴上房，然后带上他选定的小姐，当然也有直接让小姐帮他洗奶浴的，但是要加钱。有次有个台湾熟客选了4个小姐要了VIP房，然后小姐投诉说他吃伟哥，搞的群P的小姐们吃不消，有个小姐下面都搞肿了，于是在我们的协调下罚了客人1000块钱，是的，只允许绿色SEX行为，不许药后行事，这也是为我们的小姐身体着想，毕竟她还要为别人服务，被你一个吃药的搞残了，我们吃亏了，客户虽然是上帝，但是场子原则还是要遵守的，我们这里不是发廊。\n31.大部分的小姐都是有幕后集团控制的，其实这些所谓的黑势力并没有传闻的那么黑，他们绝不会打骂手下的小姐，他们只会负责把自己手头的女孩送来场子里上班，与场子负责人交涉后，由场子经理将小姐薪金扣出部分作为佣金反给他们，或者小姐领了钱以后自己交一部分给他们，这些幕后的人也很会做，隔三叉五的请小姐吃吃饭补补，去酒吧嗨嗨，他们管这叫做‘洗脑’，让这些‘向钱看齐’的女人们进一步了解到有钱有享受的好处，于是更加一心一意的努力接客赚钱。顺便一说，小姐是新型viper的主要消费群体之一，用她们的话来说就是‘上班好烦，压力好大，需要发泄’，其实那些小说和电视里编的B社会势力殴打手下MY女，那都是夸大的，或是那种低级残暴的MY团伙才干的事。桑拿有档次做幌子，事情没那么严重，他们要打要骂的一般是场子里没安排好他们的小姐上钟的负责人，所以桑拿经理并不好当，又要防白的，又要哄黑的，遇到不厚道的老板不管事，场子被封了还要去坐牢。\n32.要说打小姐的除了个别客人变态，就还有她们自己的那些所谓的老公了，认识的途径多为在外面酒吧嗨药时认识的，都是些浪迹社会的闲散混混，比如：卖H药的，放赌债的，罩场子的小弟，鸡头的小弟，业余鸭子等等，总之这些人都有个共同爱好，就是找个有稳定收入的妞来养自己，无疑这些同样浪迹天涯，有着较高收入的桑拿妹成了他们最好的猎物，而这些小姐们也喜欢跟他们在一起，一来他们可以满足自己的真欲望（陪玩，陪睡，小姐跟客人那是逢场作戏，她们也需要有个情人来哄自己开心，哪怕明知道不会有结果），二来这些混混可以在小姐危难时挺身而出，但是这些小姐们要付出成倍的免费身体和每月供养他们的代价，合在一起时间长了，这些混混的本性也显现出来，自己的‘老婆‘上钟少了，没有足够的钱来供他们在外吃喝嫖赌，那么就会对小姐拳打脚踢，我亲眼见过一个小姐因为下体发炎无法上钟，两天没上钟结果下班时被她的老公在场子门口打的趴地求饶，打完了还要乖乖的跟那家伙回去，哎~真是一个愿打一个愿挨。。。。有些没素质的小姐一跟客人发生矛盾，觉得自己委屈了，就打电话叫这种小混混来帮自己出头，这些混混酒吧网吧一招呼，一来就是二三十个，拿刀拿棒的堵在场子门口要放客人的血，我们也很头疼，这样会吓着客人，对生意和场子名誉都不好，所以一般我们会先“放点血”送些好烟或请他们吃宵夜，稳住后第二天把这个小姐开除，然后找关系来收拾那些个来坏我们场子声誉的混混，在这一点上我们是绝对要维护客人的利益的，同时也是警告其它的小姐不要把自己的‘老公’扯到场子里的事来。\n33.在桑拿场子里不管哪个阶层的人都能遇见，这也是我认为此行能给我带来回报的一方面吧，广阔的‘交际与见识’，与其耳闻，不如亲眼所见来的那么震撼，使我深知这个进化中的社会是多么疯狂。有次我们这个城市举办中型的全国煤炭会议，当时全市大中小型酒店全部客满，随之，我们这些以娱乐休闲为主的场所也生意火爆，据说这些来自国内盛产煤炭之乡的代表们相当有钱，挥金如土，而且这些会议代表都还只是那些煤炭老板身边的跟班而已，大老板是不会来开会的。那天下午小姐培训刚结束，场子里来了5个操山西口音的客人，一个貌似‘带头’的问我，‘你们这现在有多少小姐？’，我回答‘足够您选的’，他笑了一下说‘你先帮我安排我的兄弟先’，于是我安排了他的4个同伴进入VIP间，我正准备去小姐房叫小姐出来选钟，他又过来扶着我的肩说‘这样，你直接给他们每人安排3个妹行了，不用选了快点’，我按他的吩咐按小姐的排钟顺序依次安排了他的朋友每人3个小姐，这时他问我‘还有几个小姐’，我开玩笑的说‘还有10来个吧，大哥您全要？’，他说‘小费多少？’，我答‘不含钟费，普通全套300，尊贵全套400’，他提出要去小姐房看看。。。看我为难他递给我300块钱，我没接，他又加了200。。。呵呵，500块带你看小姐房，好吧，反正量你也不会怎么样，到了小姐房，他环顾了一下里面的小姐，然后他就坐在厅中间的桌子旁，自己嘟了句‘恩，你们这比×××酒店的要好看些’，然后朝小姐问道‘谁会斗地主啊？’，我和小姐都给他搞愣了，他反应倒很快，忙说‘我每人给500块，你们脱了衣服陪我打牌怎么样，打到我兄弟们出来’，小姐们还没搞明白怎么回事，他已经从包里掏出一捆钱，一个个的发了起来，边发还边笑着说‘这可比你们上钟划算啊’，钱发完，10几个小姐的衣服也都脱完了，要说小姐的‘见钱办事效率’就是高，他回过来又给我500，说‘呵呵，部长就别脱啦，帮我去外面等我朋友吧。我懂的，只是开心，我不会碰你们妹妹的，有客就去上，没客就在这陪我玩’，他掏出扑克，小姐们开始两个两个的裸体陪他斗地主，我觉得这画面比我做靶子时还要壮观。。。下钟的小姐对我说，她那个客人不要做服务，包厢里每人先给了400块现金，叫3个小姐互相对摸自慰给他看，3个小姐就这么熬到了钟结束，他每人又签了800小费（VIP标准是500小费），另一个房的小姐说他那个客人让她们三个翘着PP跪趴成一排，他一个个干，嘴里还叼着烟，后来还顺手把烟戳在×号的屁股上，完事了每人签了700小费，额外给那个被烫了屁股的小姐500现金。。。。。。。出来以后那个带头的现金买单，没注意，反正把小费钟费单子都算好，一分钱折都不打，2个女收银一起用验钞机点的钱，那边小姐房里一片‘今天发财喽~’的欢呼声。。。。。都说山西人不喜欢刷卡，那次算见识了。\n34.工作之余总会跟小姐聊起她们上钟的事，有些细节听了让人‘忍俊不止’的同时又真为她们捏把汗。。。23号是一个很有特点的小姐，因为她总带着一副金丝镶边的眼镜，别说，有些客人还就喜欢带眼镜的，也许看上去斯文老实些吧，有次她上一个BT客人的钟，客人要求她拿着饮料吸管对着他的PY里吹气，23号应允了，于是那客人翘起屁股给23吹，吹着吹着那客人突然放了个屁。。顿时。。23说‘当时我看见了，有FEN水流出来’。。；16号，一个来自贵州花戏团的舞旦，做小姐后就以熟练的‘深喉功’见称，有次跟个客人ML到中途，客人突然要求要在她里面撒尿，16拒绝了，于是客人要求16帮他KJ出来，K着K着，16刚把嘴移下到他的DANDAN上，这个客人的尿突然“喷涌而出”，喷了16一脸。。。床单也。。。据说这个客人是留英的硕士生。。。。；28号，场子五大红牌之一，丰满风骚，一个自称是房地产老总的儿子是她的熟客，这个客人只喜欢两件事，ML时用力掐小姐和ML时只干大腿不干B，就是用JB在28的大腿上用力摩擦达到满足，同时还让28用手拍他的屁股。。。。所以28上他的钟下来浑身上下都是青一块紫一块的。。。；很抽象，很不可理喻，不得不佩服这些小姐的耐性，以上事件发生时她们竟无一生气，而且，这些还只是‘桑拿怪事’之中的凤毛麟角，当‘恶搞’与辛酸放在一起时，该如何形容呢。\n35.跟小姐们在一起时间长了，聊天时还能了解到很多发生在她们身后的悲惨故事，有父母死了被奶奶拉扯大，后又被村霸强J了逼出来坐台的；有曾经守着一份满以为会圆满的爱情，怀孕几次被打掉又被情郎甩了的；有被青梅竹马一起长大的男友逼出来卖的；有家里父母、兄弟姐妹就只靠她赚钱糊家的；有成天被老公当出气桶爆打，然后绝望自杀未遂而转投这行的；更有因嫁错了郎，打多了胎，结果还患宫外孕绝孕了，被骂成“不下蛋的鸡”而含恨跑出来做的……男人们伤害了她们，悲痛欲绝而靠以出卖色相报复男人，其实不管选择了什么从始自终她们都在被伤害。有人说女孩都曾是天使，为了爱而坠入人间，但在我看来她们都是被爱神遗弃的孤灵，她们不相信真爱却渴望真爱，不敢去寻找真爱因为怕再受伤害……只能如行尸走肉般的徘徊在各种可以容留她们的淫贱之处，把自己作为女人那最后的道德低线冲破，然后开始永远无法靠岸的生活……她们选择了小姐这个角色，并“努力”的去饰演它。我们曾好好的让她们过了一把角色扮演的瘾（我们管这种服务叫RPG模式）……\n36.我并不是在描述那些“欢场”的服务，我只是想告诉大家，不管哪一行只要专心去做，总是能琢磨出一些属于自己风格的东西，更别说我们这种以娱乐大众为己任的行业了，但是也要受到相关限制，没办法，因为我们生存在这个具有社会主义特色的大环境中。“RPG”，来源电子游戏模式的一种称谓，意为：角色扮演，不是自夸，早在05年广东开始流行这种模式之前。04年我们就开始尝试了（广东称之为“制服诱惑”），灵感来自我接触的那些日本A片，作为我们桑拿管理者除了保证场子日常的运营，也要时不时的向老板提出创新经营的方案，RPG服务就是其中一个，以同一个小姐为例，给她配置不同的服装进行搭配，给予相应的培训进行扮演角色的形象行为强化，来满足客人对社会各种层面女人的视觉上及欲望上的需求，这便是RPG服务的性质和魅力所在。我们初期只提供4种角色装扮（主要体现在服装），分别为：白领公关（办公套装），清纯学生（学生装），白衣天使（护士装），运动活力（体育装），当然，每种服装我们都要求制服商进行了特殊改造，呵呵，也就是比常规的服装SEX些吧，同时，我们买了大量的关于这4种层面女性的杂志给小姐们看，让她们去吸收……\n37.RPG的服务终结了，好不容易创新的花样就因为“后台人物”一句话被彻底和谐了……小姐们每人被扣掉上千元购买的职业服装也报废了，我还打趣的跟她们说“没事儿，这里不能用还可以拿回家跟你们老公玩啊~”，其实不要以为小姐会因为场子想出的服务花样变态，她们就会不从并抵制，在她们眼里只要是能生财的她们都乐意接受，吃着这行饭嘛，桑拿毕竟不像发廊那样，给个几十百把就直接躺下来趴腿，毫无技术含量……桑拿的服务讲究细节，讲究具有“体贴式”的针对型“性技术”，哪怕是变态的也要变态出个花样来，不能满足客人的需要，那么你这个场子的整体质量就下降了……SM服务是在我们的悄声无息下进行的，为此小姐师傅跟老板还专门去了趟东莞讨学，SM（英文简称）是一种具有虐待型的性行为，说简单点也就是受虐和施虐，想不到以前被我们禁止客人的这种行为，变为我们现在向客人提供这种服务……真是残酷的市场竞争和委琐的人类性行为啊~~~小姐要掌握这种服务只需具备两样，一样是道具，一样是耐力，因为市场需求量还不是很多，所以我们准备的SM道具没有广东那么丰富（其实我觉得我们这的人压力可能没有广东那边大，所以有虐待发泄倾向的相对少些），准备的道具只有塑胶鞭，蜡烛，塑料手铐，带刺边的长靴，小姐们一般去做这种服务会把道具装好，然后穿紧身短皮裙和带刺长靴上钟，初期我们只是针对熟客推出，比如常光顾的那个大学教授和房地产公子，这下可爽着他们了，当然，我们的小姐也“遭殃”了，我永远记得那天，那次一个熟客点了26号红牌上钟SM服务，那是26号第一次做这种钟。每次我带其它客人经过那个包厢时都能听到里面传出26号的嘶哑惨叫声……1个半小时过后，不出所料，服务员叫我去包厢说26不愿出来，当时客人已经下去洗澡了，签的小费是常规价的2倍。床上乱七八糟的，26号小腿向外趴开着坐在床上哭，双手被拷住还被悬挂在天花板上的红绳子绑着，也许因为挣扎上面的红绳子已经脱了掉下来搭在26的身上，26全身裸着的，肩膀上胸上大腿上都是蜡滴和略带红的鞭印……我叫服务员拿来红花油，帮26把身上的东西拿开并用大毛巾擦她身上的污垢，在帮她擦红花油的时候她突然抱住了我，我感觉就像自己女朋友被欺负了一样，我用左手在她背后轻拍了几下，我能做到的只有安慰，我说“没事的，习惯了就好了”（说这话的时候我真TM想抽自己一嘴巴），她抬起头跟我点了点，我看见她头发上还挂着一点点客人遗留的精液。操TM的，果然变态，乱玩就算了还要乱射……在我的主张和征询老板的同意之下，SM服务推出半个月后便出台了SM服务三不允规定，小姐们很感激我，我仿佛伸张了正义一样，特有自豪感，其实无非是尽量帮她们减少点身体上的痛苦罢了，心灵上的我永远无法帮她们治愈，或许只有钱才能带给她们些许安慰吧……不止小姐是个矛盾体，其实我们这整个行业都是……高档桑拿小姐的培训过程一群美丽姑娘从家乡来到星级酒店桑拿部上班，她们不会按摩，不会其它形形色色的桑拿手法，于是要接受公司安排的培训。大致过程如下：他们首先在早上八点几乎没有客人的时候集中在休息大厅，培训由桑拿部资深女领班主持，先是领班讲话。领班很敬业，讲话也很有水平，内容有点象战时的战前动员。各位姐妹们：大家好！欢迎大家加盟到大都会这个大家庭。大家来之前，应该都知道这里是做什么的，明白了自己的工作职责，就要全心全意投入到工作中。我们这里的工作是高收入的事业，出色的姐妹一个月能赚到四五万，许多姐妹在这里做了几年后，都成了百万富姐。说白了，大家吃的是青春饭。青春是美丽的，青春是有价的，青春又是短暂的。所以大家一定要珍惜机会，在自己最美丽的时刻赚到最多的钱。我们这里是市内为数不多的一家星级酒店，在桑拿部消费90分钟就是800块。所以来我们这里的客人都不会缺钱，大家在给客人服务的时候只管用心去服务，谈钱不用你们操心。只要你们服务好了，客人就会爽快地付钱。好的东西总能让人回头，如果你们能让客人痛快，客人就会不断来我们酒店，不断点你上钟，你就可以赚到越来越多的钱。因为你们的服务直接关系到酒店的声誉，也直接关系到你们的收入，我现在在这里宣布一下我们的纪律，或者也可以说是职业道德。这纪律我们不再张贴，大家也不要记录，但一定要记在心里。1、月经期一律休息，禁止上班；2、除非客人拒绝，否则手活、口活包括毒龙、打真军缺一不可；3、禁止在客人签小费的时候和客人讨价还价，严厉禁止服务过程和客人谈价钱。说到这里，我插入一件这里曾发生的事情.我们这里以前有个小姐，碰到一个很有钱的客人，那个客人不仅有钱，做那事也特别厉害，当做到一半的时候，这位小姐说:先生你做了这么久，等会给我多签200的小费吧.这位先生当即很扫兴，马上买单走人.后来我发现了，马上开除了这位小姐.总之一句话，用心做你的事，谈钱不是你们的事。4、用心去服务。要怀着很享受的心态去工作，没有高潮也要假装高潮。以上纪律在培训期间我每天会重复一次，下面请陈诗小姐，高级技师传授按摩和口活技巧。陈小姐有20年的从业经历，阅人无数，曾经创造过一天上20粒钟，也就是900分钟，让香港富商6次起飞的傲人记录。现在请陈小姐上台，大家鼓掌欢迎。一阵掌声过后，38岁的打扮妖艳的陈斯很有动感地走上前台。大家好，我叫陈斯，今天和大家一起探讨按摩和口活的技巧问题。按摩主要是要掌握一般的穴位知识，至于口活和打炮，我总结出来的经验是5个字：用心去投入。我们这里以前开除了一位小姐，之所以开除她，是因为她和客人做爱时一边唱”洪湖水浪打浪”.这是严重不敬业的表现.象刚才领班讲的一样，大家要用心去工作，实在不行要学会假装，没有快感假装快感，没有高潮假装高潮，假装久了，你就会象真的一样，让客人痛快淋漓。下面我介绍一下培训的主要教程：1、首先观看一组高档桑拿按摩的全程录象，大家一边看一边要用心去体会；2、明天会有一批免费客人供大家试验，大家对照着录象的情景去做就可以，并注意控制好时间；3、来试验的客人都是老板的好朋友或者关系户，大家要认真对待，并注意每工作5分钟就征求一下客人的改进意见。那些客人的关系面都很广，服务好了，他们会给你介绍很多客人.",
			"added": 1568724115,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1568724869,
			"title": "世界女性叫床大观（上）",
			"body": "为何女性做爱高潮时会发出叫床的声音呢？倘就医学的观点言，性的刺激是与大脑的某些部位有关连的。譬如说，男性主要是刺激大脑皮质。这地方掌管最高层次精神功能之处。相对的，女性则是在间脑的下视丘，而这里只是能够左右原始本能产生兴奋度的地方。换言之，当受到性刺激时，男性会产生高次元的反应，女性则只在低次元本能的地方来接受这种刺激。因此，女性会产生强烈的告白欲望。亦即，当性行为达到高潮时，女性会情不自禁发出各种叫床的声音。由此项研究而感，或许不少男性会认为：“这么说来，女性还是比男性低等罗！”其实这也不能全算对，因为据多位风月场所的女子表示，在她们男性客人当中，竟然也有６０％会发出类似这种欢愉的叫床声。总之，声音和**是有绝对密切关系的。走笔至此，凑巧听到了隔壁那只发春期的猫咪叫声。诸位倘有幸亦得而闻之，并相对照一下后想想，或许你就可以更加了解叫床而必恍然有所悟。原来猫咪会发出妨碍我们睡眠、使我们感到困扰的声音，就是生殖期（发情期）需要异性的时候，这对它们而言是十分必要、不可或缺的哩。 \n        \n      一、女人叫床的叁种类 \n        首先，女人叫床可分成叁种类，这是每位男生必须记住的： \n        \n      1.因为有感觉而出声。人会发出声音是由大脑的左半部，亦即由语言中枢所控制。然而在某一些场合或近於丧失心智的状态下，此时人们却没有办法接受大脑皮质的指示，只是会无意识地、反射性的发出声音。例如强烈性兴奋达到高潮的场合就是如此，全身紧张产生一种缺酸的状态，意识也会变的模糊，在无意识中发出的声音就是一种“喜悦之声”。\n         \n      2.为了要有感觉而出声。例如有些女性，无论男生如何的努力，却都无法达到高潮。然而她们会因为听到自己的声音，而产生了无比强烈的性兴奋。所以这类女性她会尽量叫出声音来，不管“啊！”也好，“呜！”也好，或者是加上一些暧的字眼也没关系。她叫床的目的，不过是为了要使自己可以达到高潮而已。\n       3.虽然没有感觉，但还是出声。譬如*女、风尘女郎等。她们总是希望客人们能够越早结束越好，因此发出叫床声就是她们常使用的方法之一。\n      此外，有时候女方因为过於疲倦、或者兴致缺缺，但是男方却要求作爱，故而只好尽量的发出声音。每次都装出好像很有感觉的样子，让丈夫感到兴奋，然后以便很快的结束。\n         \n      然而，很遗憾的是，很多男性对於女生所发出的声音，所代表的到底是什么意义，却往往不能够加以区别。亲吻的时候如果对方张开眼睛的话，男性也许是可以了解对方的想法，但是在声音方面却无法分辨。作爱时，如果女生突然“啊！”的大声叫，由於男性都是单细胞物，很快地就会被女性的叫声带入高潮而草草结束。\n         \n      二、 叫床的古典传统与流行 \n       最典型、最传统的“叫床”如下：\n         “啊……”是一种自我陶醉的型态、\n      “哇（伊）……”是一种快感的表现型态、\n      “呜……”是自我压抑的呻吟型态、\n      “唉（嗯）……”是一种感动的型态、\n      “喔……”是一种野性的型态。\n      然而，近年来由於性知识的普及、女权情欲自主的推波助浪、加上最近北大女舍观看Ａ片的公开化……等，叫床已不再是仅仅限於上述这言词语句、声音，另外一些词语，也都广泛地被用来加强情绪的表现，甚至变成了一种流行。譬如：“我快要死了。”这句话，大家已经可以常常在床第上听到了。往往如此单纯的一句话，常会让双方感到更为陶醉。也往往因这句话，而令男生感到全身颤动不已。 \n      “你的花园好像很濡……”这是属於喜欢作梦作诗的型态。\n       “啊！我快飞走了，抓住我！”这种觉得自己在飞翔的女性，是属职业妇女型态。\n       “好可怕！”遇到人间凶器。“杀了我吧！”（……？）",
			"added": 1568724862,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1568724911,
			"title": "世界女性叫床大观（下）",
			"body": "三、各论篇－－“叫”的种种类类     \n      甲）中国篇   \n       １．ＹＥＳ型　这类型的叫声，如行文一般。非常有起、承、转、合、高、低、起、伏，令听者有如沐春风、常喜不自胜…… \n      基本音效：“OH……N……ye……ye……ye……yes……”。\n        \n      分析：事实上，在中国几乎很少有女生是这样子叫的。这种叫床法大部份是发生在金发碧眼的外国女孩子身上。但有叁种例外情形：一、华裔美人。二、看太多外国Ａ片而效法之。叁、观光饭店赚取外汇的应召女郎。\n      备注：本研究因限於地域问题、经验关系，只以黑发女性为主。\n        ２．春字型　基本音效：“春……春……春……”。\n        分析：这是“性教育”失败的典范。因为坊间书刊常谓：当“做爱”时女性会忍不住叫春……於是天真无知的少女在献身给心爱的人时，唯恐被怀疑是“性冷感 \n      ”，便唯妙唯肖的表演了起来：“春……春……春……”\n      备注：本案例资料确实发生在各地绝非危言耸听。\n           ３．贤妻型　基本音效：“喔……喔……喔……”（Repeat，可无限次循环）。\n            \n      分析：这类型的女性，受了中国传统“优良文化”的薰陶，是贤妻良母型。她们认为：婚姻中应尽的义务，就是在床第中让丈夫满足。所以她们使用最传统的声调呻吟着，无论节奏、拍子、强弱、都配的恰到好处，宛如一曲美妙的二重奏……一直到丈夫达到高潮，心满意足的爱猫扑.爱生活之后，自己脸上方敢露出传统女性满足的微笑，而停止这首可无限循环的室内交响乐章。\n      备注：这型女生是不会去考虑：自己本身是否有达到高潮。\n           ４．淑女型　基本音效：“嗯……嗯…嗯……嗯……”（若有似无，只可断续听到……）。\n            \n      分析：这类型自小家教良好，在母亲细心调教下，她学会了喝汤不出声、笑不露齿、走路臀部摆幅不超过７．５。因此，即使她受到了激烈的激荡，也能压抑住音量，只在喉间发出连续而含糊的声音，以传达心中喜悦的效果。\n      备注：男生倘不把耳朵挖乾净些，恐有听不见之虞喔。中国目前的女生，大多数应该都是属於此种类型。         \n      ５．闷骚型　基本音效：“……”（没有声音，就是没有声音……）。\n       \n      分析：别纳闷了，是真的没有声音。难道是喇叭坏了？哈……顾名思义，既是“闷”字，当然不叫罗。这类型的女人打破“女人与聒噪”间的自然法则。大半咬紧牙关、忍住了想叫的冲动。不敢将自己真实的感情流露出来。可能的原因如下：一、因为她的罗蜜欧是爬窗进来，两人偷情怕被人知道。二、隔墙有耳、或她老爸正在楼下持关刀把大门，怕被别人听到。叁、她的“他”有口臭，所以她必需紧闭嘴巴，以避免接吻。\n      备注：据统计：中国女生，至少有一半以上，都属於不会叫的类型。这可能是受了中国五千年传统文化洗礼的关系……\n        ６．飙女型　基本音效：“快、快！喔、喔……再一次、喔、喔……”。\n       分析： \n      这是男人梦寐以求的床上荡妇型。可是她并不是每个男人都有福气消受得了，必须自己本身要有相当足够的床第实力，才可以应付。这类型的女孩多半年轻、富朝气、有活力、而且做风大胆。从小就懂得偷看老爸偷藏的Ａ带、哥哥的PLAYBOY、弟弟的黄色小说……在中国是最近才掘起的时髦女，以前根本是不可能有这款的代志。\n      备注：这种女孩的确是有够劲！瞧……那人已被折磨的一身憔悴…… \n       ７．受虐型　基本音效：“ＮＯ！……NO！……No！……no ！……”。\n      分析：可别报警，这不是强暴。这种女人心理上有某种程度所谓的“受虐妄想症”的倾向。是属於比较不适合和男人作爱之类型。另外的可能是：一、男的身体太过於肥胖，快被压成碎骨头。二、或男的尺寸过长，被吓到啦…… \n      备注：藉此告诫普天下女孩：千万别以为“他”越强壮，就越能保护你，尤其不幸你的身材又是特别细瘦的话！！切记。切记。\n       ８．碰撞型　基本音效：“喔……碰！喔……喔……碰！”（音色繁多，不一而足）。\n      分析：这种类型是有地域性的。多半在非高级住宅区才听的到，尤其是大专校园附近、木板隔间房间、特别多的地方。其实，这种“碰！碰！”的声音，是脚踢到木板床、木板墙之类发出来的。因为大学生穷酸、年纪既轻、血气又方刚、更流行什么试婚、校外同居、自然也就顾不了隔墙有耳了。\n      备注：有偷录“床上春天组曲”雅兴者，这地方是最上上乘之选。\n      ９．强人型　基本音效：“快！…  …喔……喔……快！来不及了…… 喔…… 喔……”。\n       \n      分析：一个外表威风八面的女强人，其实背后是很辛苦的。工作、家务、人事关系……样样都得面面俱到，由不得她随兴所至。一大堆事累积起来，不管她到底爱不爱做，一天二十四小时根本是不够用的，更别说花时间去享受人生情趣啦！\n      备注：女强人对男人而言，实是一种严重的威胁和考验。\n        １０．暴君型　基本音效：“照我意思，乖乖的这样做，听到了没？”（充满魅力的声音）。\n       \n      分析：这种类型的女人颇有主见，不肯乖乖的按照传统的方式叫床，一定要搞东搞西的，哇啦啦的指挥那位可怜的男人。既不肯一丝丝的让步，更没有一点点温柔的味道，不浪漫至极。\n      备注：当男人碰上这种女人，常被压的死死的，连翻身机会都没。天啊！\n       １１．神女型基本音效：“哦……哦……甜心，真行。哦……哦……你比他强多了……”。 \n        \n      分析：这种女人可说最诚实了。刚刚火热缠绵得不可自拔，马上就又飕地放出一支冷箭。使得这个男人彷佛被泼下一盆冷水，差点心脏病突发而去。此种情形多半在ＨＯＴＥＬ、宾馆中发生。一男一女、一前一后、分别进房唯恐被人发现了什么蛛丝马迹。而这种女人，往往所拥有的男人不只一个，手段支持，掌控自如、神乎其技、出神入化、神出鬼没……\n      备注：简直厉害得不像凡人，故称神女。\n       １２．好奇型基本音效：“陪人家试啦。哦…哦……好啦！不试怎知道？哦……哦……”  \n       \n      分析：相信她，她绝对不是性**狂。此型女孩外表上起来非常的可爱、眼睛圆亮、爱玩、爱说话、教人全不起一点点提防之心。只是很爱看奇奇怪怪的书和杂志，所以时常会有很多令人意外的点子。\n      备注：因为她太好奇了，所以……有时难免会做些冒险和新的尝试。\n       １３．木偶型　基本音效：“喔喔……然后呢？……哦哦……再来呢？……哦……哦……”。\n       分析：这类型女孩，一个口令、一个动作、凡而降、克制不住内心的兴奋、那个男人的声音此刻提高了八度，所以乍听之下根本无法分辨出到底是谁在叫。\n      备注：此时的叫声此起彼落、两相呼应、高低有致、实乃人间至美天籁也。\n          \n       乙）、外国篇\n      　\n      一般最常说的语句：\n      （１）美国、英国：   １．啊！我来了！（I AM COMING NOW!）   ２．我已经不行了！（I AM LOST）   \n      ３．停！停！（STOP IT）   ４．GOOD   ５．I’M COMMING   ６．**** ME HARDER   ７．I CAN’T \n      STOP ……等\n      （２）法国：   １．啊！好啊！（啊.些比安）   ２．好棒！（蒙．雪利）   ３．快出来了！（沙、阿里乌、比安斗乌）\n       （３）意大利：   １．好啊！（毛鲁得）   ２．拜托、拜托（普利哥）   ３．快融化了（啊弗玛西、那得）\n       （４）德国、奥地利：   １．哦！快出来了（啊、可姆得、可姆得）   ２．再用力、再用力（比特、比特）\n       （５）西班牙、墨西哥：   １．快！快！（普罗得、普罗得）   ２．燃烧了，快燃烧中！（卡利安得．姆琴．卡利安得）\n       （６）葡陶牙、巴西：   １．啊！已经好极了（哦、哦特摩）   ２．好啊（澎）   （７）瑞典：   １．爱我（爱路斯卡玛）   \n      ２．已经不行了（雪依克码奴） \n       （８）菲律宾：   １．舒服极了（玛．沙拉普）\n       （９）泰国：   １．好啊！（利码库）\n       （１０）韩国：   １．流出来了！（卡约、卡约）   ２．好啊（切达）\n       \n      －－－多多看Ａ片，多多学习啦－－－\n           \n      四、结论篇－－“叫床”的结论\n             \n      本篇是本文的“真正精华”。是阿里巴巴启门的“要诀”，看来简单，运用困难，除了要有敏锐的观察力以外，还要有“各方面”的知识与学养，否则必如雾里看花，似懂非懂，最后，还莫明其妙。\n         １． 叫床：\n      　   小声呻吟：音调柔美……舒服凄惨……痛苦。\n         大声尖叫：突然疼痛……刺耳……大高潮……。\n         悦耳狼吼：从子宫头深处出来……罕见的高潮。\n         从口鼻间出来……非常的须要高潮的来临。\n          ２． 摇床、拆床：\n         左右摇……平衡好，适合侧击为主。 \n        前后摇……劲力够，适合上位。\n         左右摇又前后枫……适合各种体位。\n         动作无奇不有且大而持续……拆床专家。\n          ３．软床、硬床：\n         喜软床……藉力为主，喜“温柔”。\n         喜硬床……实力为主，喜“体贴”。\n         二床皆喜欢（换着用）……经验丰富，喜温柔与体贴。        \n      4．习惯用单字者 \n      ──譬如：不、要、想、爱、啊、吧、嗯、痒、痛、爽、快、慢、来、去、再、见、你、我、浅、深、左、右、动、停、转、退、进、浪、荡、婆、娘、父、夫、哥、姊、弟、妹、干…… \n        以上单字只用五个以内……脑子简单、乾脆。\n         以上单字只用叁个以内……个性封闭、保守。\n         以上单字用十五个以上……精敏能干、脑子清楚。\n         重覆单字、频仍使用……缠绵悱恻。\n         音调低而乏力……没有兴趣、勉强应付。 \n         音调高、强而有力……很有兴趣、煞不住车。",
			"added": 1568724903,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1568725074,
			"title": "公交私通",
			"body": "作者：塞外奇侠\n今天是周休，我却很早就起来了。为的是兑现早在周一就许下的诺言，给妻添套夏装。妻要\n加班，这个光荣的任务就理所当然落在我这位新好男人的身上。\n从商业大厦完成使命出来的时候，已近中午。我打算到对面的皇亭吃点东东或西西。刚走出\n凉爽宜人的大厦门口，一团热浪便迎面袭来。正想随口咒骂老天的狂热之际，忽然眼前一亮,\n一位身穿短裙的女孩提了一大袋的衣物从我身后走了出来。惊鸿一瞥间，似面目清秀,未施粉\n黛,一副女大学生的神采。我不由亦步亦趋在其身边行注目礼，只见其女身材高挑,一对浑圆的\n乳房把粉红色紧身T恤撑得鼓鼓的,腰很细,充分发育的臀部更显丰满。\n在电光石火之间我迅速作了食欲与色欲的抉择。遂放弃了去皇亭的念头，先欣赏一下美女吧\n。无锡的美女甚少，如此气质与身材并俱的美眉更如凤毛麟角。主意拿定，我便不近不远的跟\n在女孩身后，眼睛盯在她丰满的屁股上舍不得离开。浑圆的臀部随着走路左右摇摆，哇COW！\n真是难得一见的旖旎风景。女孩没穿丝袜的双腿雪白修长，想象着她脱光衣服后的模样，胯下\n的东西不知不觉硬了起来，我用很隐蔽的动作调整了一下胯下的衣服，以不至于在大街上支起\n跟着她不知不觉来到了很近的中山路公交车站，哦？她要上车？失望之余正想走开，这时公\n交车慢吞吞的开了过来，往车上看时，只见里面黑压压挤满的人，立刻一个更爽的念头跳了出\n来，何不如此如这般、这般如此.....\n来不及多想,车站上一大堆人蜂拥着向还没有停稳的车涌去,女孩也夹杂在人流中挤向车门，\n我赶紧使出浑身解数，努力挤到女孩身后。伴随着身后传来的抱怨声，我终于紧跟在女孩身后\n挤上了车。由于是星期天，车上的人出奇的多，真真是摩肩接踵，一进到车里面，我和女孩立\n刻被人群紧紧的挤着贴在了一起。哇COW，女孩象棉花一样柔软的身体立刻压在我身上，前面\n的人挤的已经没有一丝缝隙，后面的人还在拼命的往前拥，借着拥挤，我努力的享受着女孩身\n体的触感。\n车门终于啪的一声关上，车开始启动，车上的人在颠簸中艰难的调整位置，很快的人群稳定\n下来，我一直紧紧贴在女孩身后，最后停在了车中部靠前的部位，这里的人最多，除去两排座\n位中间足足挤了4排站着的人。我和女孩被加在中间，前后左右都是密不透风的人墙。开始我\n只是把身体贴在女孩背后，女孩身高跟我差不多，她的臀部刚好处在我小腹的三角部位，借着\n车身的摇晃摆动腰部，早已硬梆梆的老二贴在女孩屁股中间的裂缝上摩擦，隔着薄薄的衣服，\n可以感觉到她身体热乎乎的肉感。\n借着色胆，我逐渐加大力度，双腿分开向前靠拢，夹住女孩的大腿，腰部也用力向前压迫丰\n满柔软的屁股，硬梆梆的老二开始挤在屁股沟里上下左右的蠕动，可以感觉到女孩的屁股上的\n嫩肉被我弄的左右分开。按常理在这种力度的压迫下，女孩肯定应该有所察觉，不过在这么拥\n挤的情况下，也不能就此说我是故意非礼。我逐渐放大胆量，索性松开吊环，双手从人缝里向\n前探，缓缓的放在女孩屁股两边，借着拥挤轻轻的抱住她的屁股，哇！这样可以完全感觉她屁\n股的丰满程度，哇！感觉比想象中还要大。我随即晃动腰部，下腹紧紧贴在她屁股上，完全是\n一种背后插入的姿势，只不过没真的插。\n我突发奇想，她现在会不会已经感觉到了背后的骚扰，由于羞于启齿而默默忍受呢？我决定\n试探试探，于是暂时松开紧贴的身体，一只手大胆的抚摸在女孩短裙下面裸露的大腿上若即若\n离的抚摸，她不会感觉不到皮肤的直接接触，我一面加大抚摸的力度，一面悄悄的观察她的表\n情，女孩一直没有反映，我大胆的用手在她腿上用力的捏了一把，这时女孩忽然扭过头来，双\n眉微皱，四目相接，我心头狂跳，暗想这下完蛋了，正欲拿开那只手，谁知女孩发现我也在看\n看她时，又迅速的扭开了头，我偷偷观察她长发半遮的脸，很明显的她的脸已经变的绯红，我\n不仅心中狂喜，正如预料的一样。\n我的手重新抚摸她的腿，她开始微微的扭动身体，像要摆脱似的，但周围都是人墙，根本无\n从逃避。事实确定，她是出于害羞的原因不敢声张，我此时开始放心大胆的抚摸，双手从两侧\n抱住她光滑的大腿，手指顺着大腿外侧慢慢的从短裙下面伸进去，在人墙的掩护下，没人会察\n觉我此时的动作。在我逐渐放肆起来的抚摸下，女孩渐渐的停止了徒劳的挣扎，可以感觉到她\n身体在微微的颤抖，嘿嘿...我一步步的加大力度，伸进短裙里的双手贴在女孩完全裸露在底\n裤外面丰满的屁股上，挑逗似的抚摸那里滑嫩的肌肤......\n女孩缩紧双腿，默默的忍受我的骚扰。我渐渐放掉戒心，肆意的玩弄女孩的身体，一只手继\n续在她屁股上摸，另一只手伸到前面,一路向上进攻,由于她一只手抓着拉环,所以很容易就被\n我摸到了那饱满的大奶。我从缝隙里继续向上移动手掌，直到可以完全握住乳首的位置，然后\n用力揉弄，正点！！女孩的乳房十分丰满，我用拇指和食指捏住乳头的部分，手掌用力，柔软\n又有弹性的乳峰被我弄得大大变形，我还从来没享受过如此极品的奶子。另一直手也伸到前面\n，粗暴的从她另一直手臂的腋下伸过去，双手同时抓住两只大奶，忘乎所以的玩弄。摸了大约\n一分多钟的光景，我开始更进一步的攻击，两手从T恤底下伸进去，先是在她光滑的腹部摸了\n几把，由于天热加上十分紧张的缘故吧，她皮肤粘着汗水。\n我迫不及待的从T恤下面直接摸到了那对奶子，柔软粘滑的触感给我带来前所未有的快感。我\n的手指从奶罩的边缘伸进去，抚摸她弹性十足的乳房。很快的，我暗地用力，终于被我扯开了\n她的奶罩上从裙底伸到前面。看样子堵车的情况没有改观，我不慌不忙的把她的奶罩完全褪到\n腰部，揭开拉扣，不动声色的把散发着汗香的奶罩从她衣服下面抽出来，塞到我的裤兜里面。\n对于我来说，她的乳房已经是赤裸裸的暴露在我的手掌下了，因为她的T恤显然阻挡不了我的\n进攻，反而成为掩护我的工具。当我两只手重新抓紧她两只硕大的奶子的时候，那感觉爽的无\n法形容，我一面不慌不忙的细细品味乳房的美妙触感，一面用手指扭紧她的奶头，乳头有花生\n米那么大，我几乎可以感觉到乳头上那细微褶皱，很快我明显察觉到娇嫩柔软的乳头开始变硬\n。\n在这过程中，除了我动作大的时候女孩稍稍扭动几下之外一直一动不动的站在那里，住我手\n掌贴在她小腹上，手指在她阴阜上骚动，在这样大胆的抚摸下，她又开始扭动身体。车走了几\n十米又吱的一生停下了。我开始不仅仅满足于她的奶子了。于是左手继续在她T恤的掩护下轮\n流揉搓两只赤裸裸的乳房，右手不顾一切地隔着底裤在花瓣的部位用力的揉弄，双手同时从上\n下夹击她身体的敏感部位。然后我渐渐的把她的短裙往上卷。女孩现在似乎被我这种大胆的骚\n扰吓的不知所措，提着塑料袋的手几次想掩护，但一接触到我的手又立刻慌张的躲开，就这样\n半推半就的她的短裙被我完全卷到腰部，我偷眼象下望去，女孩裸露的屁股立刻呈现在我的眼\n底，粉色内裤紧紧裹着两片雪白的臀肉。我抑制住狂跳的心情，赶紧把身体贴上去，以防止被\n人发现我正在进行的地下工作。\n车到了五爱路站台。真是天助我也，几乎没人下车，却又上来了几个人。车厢里面又发出一\n轮抱怨声，纷纷埋怨司机不该继续上客。车又启动了，才走了几秒钟，车忽然停住不动了，堵\n车！嘿嘿，真是天公作美，我继续刚才由于停车而停顿下来的动作，这一次我放心大胆的迅速\n卷起她的短裙，一面抚摸，一面把身体紧紧压在她身上，勃起的小弟弟隔着薄薄的衣服贴在柔\n软的屁股上摩擦。堵车的情况似乎很严重，我估计到下一站没那么快，索性更进一步的享用这\n嘴边的意外大餐。\n我暂时放开她的乳房，双手伸到下面用不被人觉察的动作把她的底裤向一边拉开，女孩的屁\n股沟完全裸露出来。我用双手直接抚摸裂谷两边滑嫩的肌肤，手指以猥亵的动作抓住女孩的臀\n肉向两边分开，勃起的小弟弟挤进裂缝深处，隔着裤子顶在女孩完全赤裸的菊花蕾上，以性交\n似的动作扭动，充分享受着女孩浑圆柔软的屁股。在色心的冲击下，一不做二不休，我索性拉\n开拉链，把涨的滚烫的阴茎拉出来直接顶在女孩的屁股上，刚一接触到那里柔软温暖的嫩肉，\n立刻觉得血往上涌，阴茎突突的脉动，几乎射精。\n我立刻停止动作，贴紧她的身体，定了定神，抑制住射精的冲动。双手从侧面抱紧女孩的屁\n股，身体前倾，全身贴在她背后，用身体把她裸露的屁股遮住，向四下观察，虽然不可能有人\n发现我的动作，但我还是确认一下才能放心。我探过头一边观察女孩的表情，一边开始继续缓\n慢而有力的揉摸她丰满的屁股。这时女孩似乎已经支持不住似的，身体软绵绵的靠在我身上，\n脸颊通红，靠近点可以听到她急促的喘息声。\n我一直次保持着这个姿势，直到车又象蜗牛似的向前缓慢的移动，我的手继续在她屁股上大\n力的抚摸，充分感受着女孩光滑又充满弹性的皮肤带来的触感。摸到底裤侧边接缝处的时候，\n忽然发现两边都有绳结，哇，原来是这种内裤啊，一个更大胆的念头立刻冒出来。本来我只想\n就这样摸几下算了，因为要脱掉她的内裤动作太大了，人群一动，这里的光景会被人发觉。可\n现在既然是这种内裤，我就即刻改变了主意，拉开绳结，内裤立刻松脱。\n女孩察觉到内裤被脱，立刻慌乱起来，夹紧大腿想阻止我的动作。此时的我怎肯罢休，我把\n脱下来的内裤也悄悄的塞到裤兜里。这时她外衣下面的身体已经是赤条条的了，把她的短裙拉\n下来，遮住我的双手和肉棒，伸到前面的手在她的阴部轻轻的捏弄，手指沿着肉嫩的裂缝来回\n摸索，挺起身体把滚烫的肉棒挤进她紧闭的大腿，双手用力向后拉过她的身体，阴茎在她屁股\n沟来回摩擦了一会儿。然后双臂抱紧女孩的腰身，双手从前面伸进她紧闭的大腿根，摸到娇嫩\n的花瓣，立刻发现那里两片嫩肉湿漉漉的滑不留手……\n从粘滑程度可以断定绝不仅仅是汗水，我用力抓紧她大腿内侧的嫩肉，企图向两边掰开紧闭\n的大腿，此时她努力的作着最后的挣扎，但我还是前后同时配合着把肉棒伸进了她的大腿中间\n，下一步就是抱紧她的屁股，转圈似的扭动腰部，肉棒紧紧被她大腿根的嫩肉夹着，龟头摩擦\n着柔嫩湿滑的花瓣。我把身体向后移动少许，同时抱紧她的腰，使她的屁股向后突出，肉棒顶\n在开始向后张开的花瓣上，由于太滑，加上她的阴道口很细小，我几次努力想插进去都没成功\n，于是一手拦住她的腰，固定住她的身体，另一直手从前面摸索到阴部，用手扶助阴茎终于塞\n进了她窄小的阴道。目的达到后，我抑制住只冲脑际的快感，开始很小幅度的有节奏的抽插，\n虽然不能完全插入，但龟头被滑嫩的肌肉紧紧夹住的感觉还是令我兴奋的几乎昏了过去……\n在车厢的摇晃中，我逐渐加大动作，一只手搂着她的腰用力向后拉，一只手从衣服下面抓紧\n她饱满的乳房，臀部向前用力，用力朝她身体深处插进去。女孩丰满的屁股被紧紧地挤压在我\n的腹部，虽然隔着衣服，但还是可以感觉到柔软的臀肉被我压迫的变形。我注意着车厢的晃动\n情况，每当出现较大的晃动时，我就全身配合的快速做几次大力的抽插。如果两人都是光着身\n子的话，她的屁股一定会被我弄的“啪啪”做响吧！\n我心里暗想，真TMD难以想象，竟然有着等情况发生，在人流拥挤的公交车上，我正搂着一个\n漂亮女大学生赤裸的屁股……\n车继续缓慢的向下一站移动。大约有五六分钟的光景，我断断续续抽插的次数也应该有几百\n下。不知不觉车上的报站广播响起来，汽车西站马上就到了，时间不多了。我开始不顾一切的\n加大动作，把阴茎尽力插进阴道深处，伴随着女孩阴道的抽搐，我几乎叫出声来，快感传遍全\n身，用尽力气大力抽插了十多次之后我闷哼一声，精液喷射出来全数注进了女孩的阴道深处.\n.....\n此时，我似乎听到女孩也发出了竭力掩饰的呻吟声，由于车里车外声音嘈杂别人不会注意到\n她的呻吟声。与此同时，我明显感觉到她的阴道也在阵阵收缩，几乎要夹断我阴茎的感觉，我\n把身体紧紧压在她背后，享受着这种无与伦比的快感....\n终于,车厢停止了晃动,随着沉闷的刹车声,车到站了.我迅速回过神来,赶忙抽出肉棒,还没有\n完全变软的肉棒离开她阴道的时候,我感到好像拔掉瓶塞似的,随着身体结合部位的脱离,发出\n轻微的“噗”的一声，阴道又似当初般紧闭。人流开始移动，我也迅速整理好衣服，当然也把\n女孩的短裙拉了下来，她的底裤还在我裤兜里，没时间还给她了。我移动身体拉开我和她的距\n离，她在人流簇拥下向车门移动，看不到她此时的表情，我离开她几个人的距离，也随着人流\n走向车门，看不到她了，应该是下车了吧，忽然门口的群一阵小小的骚动，我挤到门口，赫然\n看到刚才的女孩几个踉跄茶点倒在地上，肯定是被我弄的虚脱了吧，我心虚的躲到一边，等看\n到女孩终于在人们诧异的注视下脚步摇晃的走开的时候，我才若有所失的望着车外，此时车又\n启动了。\n回头一想,公交车?嘿嘿!真是“公交”车啊！哈哈哈……从车上下来后，终于有一丝凉风拂\n面而来。我头脑一阵清爽。外面的天空万里无云，回想方才，真是恍如隔世矣。\n今晚，我迫不及待在网上写下了此文，希望与性虎的朋友分享快乐；若然有一天当事人（那\n位公交车上的女孩）有幸得阅此文，希望与我联系。我在x_hali@sohu等你！",
			"added": 1568725065,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1568725182,
			"title": "电影院性事",
			"body": "作者：王军\n那天下午，天下着雨。我的心情很不好。没有什么地方去，心想去看一场电影吧。于是\n就信步来到市中心的百花电影院购票。这时一个穿着入时的女子也来到窗口，样子也是想看电\n影的。她在我的后面，轻轻对我说：“请我看电影吗？”我一惊，我又不是她的什么朋友，怎\n么请看电影呢？后来一想，那新闻里不是说过吗，有一种女子是妓女，在看电影时陪男人玩。\n不知道那时我是怎么转过的弯，一下子就答应了。好吧。于是我俩就一前一后地进了电影院。\n过了几分钟，她发言了，对我说：“有女朋友吗？”我说：“没有”。她又说：“那你\n和女人玩过吗？”意思是说性交过吗。我说也没有。其实是有过的，她于是又进一步靠了过来\n，把她的头枕在我的肩上，一面用她的小手拉我的手，并压在她的乳房上，我的心一个劲地跳\n，我喜欢她。也喜欢这种感觉。只是有一点怕。怕被人家看见了。怕突然有警察把我们给抓起\n来。但是她给我的感觉真是太好了。\n我沉浸在她给我的温暖当中。我的阴茎开始勃起。她也感到了我的变化。她的手有意无\n意地在我的下身探索。我觉得好过极了。。。。我本能地看了一下四周，四周黑黑的，电影在\n放，全场只听见嗞嗞的放电景的声音，象是没有人的一样，静极了，座位很高，也看不见别人\n在做什么。我想这就是电影院给人们的一种方便吧。于是我的胆子也大了起来。我也用手摸了\n她的乳房。她还把我的手位到她的下面。让我摸她的阴部。她的阴部早已湿了，好温暖。我呑\n了一口口水，就和她拥抱在一起。\n她是一个职业女人，很懂得男人的心。她不紧不慢地摸我的阴茎。同时也接受我对她的\n爱抚。我们吻在一起。至于电影在演什么，就不知道了。她一边和我玩，一边问我。想不想插\n穴。我点点头表示想。她就把下面的衣服脱了下来，坐在我的大腿上。我的阴茎硬硬的，也跳\n出来了，我们在黑暗中就进行着人类最伟大的活动。她很内行，一上一下地往我的阴茎套。我\n舒服死了。但是我们都不敢作声，只是默默地进行着性交。\n我问她，你经常这样吗？她说，是的，但是今天是第一次，可能的话晚上还要来一次。\n我问，要多少钱？她说，不一定。一般是随客人的便，我因为不知道这行里的价码，不好少给\n，少了说我小气，多了又舍不得。她也爽快。知道我是第一次，不知道行情。就对我说，你是\n第一次，你就给五十元吧。别人一般是一百，也有给二百的。不过我真的是喜欢你了。一上手\n就知道，你不是老手，这倒让我喜欢。她看上去不到三十，一付精明的样子，要不是知道她是\n一只鸡，我还真的会爱上她的。\n我们在电影院里玩了一个多小时，又谈了一些话。我的心情好了许多。我想这个世界还\n真是可爱的。在我心情不好的时候，有那么一个女人陪我渡过了一个快乐的下午。要是\n那位女子看到了这篇文字，请和我联系。",
			"added": 1568725172,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1568726687,
			"title": "我的女友游泳时被强奸",
			"body": "他们其实都很喜欢我女朋友，但都被拒绝了。于是对她产生了更加强烈的欲望。那是一个炎热的下午，他们打电话约了我女朋友一起去游泳，由于我女朋友是外地人，火车票又买的晚，所以宿舍只剩她一个人了。开朗的她爽快的答应了。于是四个人一起来到了附近渡假山庄的游泳馆。照以往游泳的学生应该很多，但那一天很特殊，大部分学生都放假回家了，因此游泳馆里只有一两个人。（后来才知道，那都是他们三个想好的）换好泳衣进了游泳池，我女朋友不太会，还带着游泳圈。虽然穿的是较为保守的泳衣，但这也挡不住她诱人的身材和白皙的皮肤。开始的时候他们还很规矩。\n但后来，先前的几个人都走了，不大的泳池只剩下他们四个。三个男生的胆子大了起来，也开始了他们的计划。其中一个游的好男生先提出要教我女朋友学游泳。跟着其它两个也要教。我女朋友只好答应。\n他们三个一个人拉着我女朋友的两个手，另外两个各抬一只脚。把她带到了深水区。并且说带着游泳圈永远学不会，就把游泳圈取掉了，这样一来，我女朋友很害怕，他们则很得意。看着我女朋友在水里害怕的样子和不时的尖叫，他们三个底下都硬了。这时拉手的那个男生干脆抱住我女朋友，并用身体不停与我女朋友的乳房蹭，另外两个也从脚抬到了大腿，就我女朋友说，当时还有人用手摸她的屁股。水里的她是那么无助，但也没有办法。此时的三个男生，已经抑郁不住自己心中的欲火，后面的一个男生在水里脱掉了自己的泳裤，两手抱着我女朋友的大腿，使劲用他的小弟弟顶我女朋友那里。而前面的那位一手抱着她的腰，一只手直接托在她的乳房上，更加过分的是，剩下的一个人从我女朋友泳衣里面伸了进去，并摸到了她的半个乳房。我女朋友这时已经开始哭了，并且向他们三个求饶，在他前面的男生，终于说出了他们真正的目的。我女朋友害怕极了。但外表强硬，内心软弱的她，还是一步步屈从于他们三个。（她后来告诉我，她要是不答应，他们就把她衣服扒光，然后走人，她真的害怕了。。）事情到了这个地步，三个禽兽把我女朋友直接带到了泳池边上，他们早已是裸泳了。于是开始脱我女朋友的泳衣，我女朋友只是小声的说着“不要”和象征性的阻止，三个发狂了的禽兽，一下就扒光了她。看着他们做梦都想摸的身材和皮肤，他们都显得手忙脚乱。由于水的浮力，我女朋友就平躺在水面任三个男人摆弄。毕竟水里干事不方便，三个禽兽马上把她带到了男更衣室。（此时游泳馆早已没人了）白皙的皮肤更加清晰的展现在他们面前。我女朋友缩在一个角落不停抽涕。三个禽兽命令让她站起来！在被煽了一个耳光后，我女朋友知道现在能做的只有听话。她颤颤的站了起来，抱着自己的乳房更显刺激！由于我女朋友阴毛较浓密，三头禽兽的目光都瞄向了那里！“手放下来！”于是，一对小白兔跳了出来。三个禽兽再也看不下去了，又一次围了上去，把我女朋友放倒在长椅上，把她的双腿，大幅度分开，三个禽兽轮流开始品尝我女朋友的阴部。都是第一次面对女人那里，三个人非常激动，由于我女朋友较多的阴毛，他们不得不拨开阴毛寻找蜜洞。阴户完全的暴露，和他们粗野又不乏细微的行为，使我女朋友浑身都软了。这时一个硬物顶到了她的阴唇上并不停摩擦，由于硬物十分的烫，我女朋友竟不争气的流出了爱液。还发出了有生以来的第一声春叫。三个禽兽不约而同的笑了起来，其中一个还在用他的阳物不停摩擦，另外一个把小弟弟放在我女朋友脸上乱蹭，剩下那个则疯狂的舔食着她的乳房。我女朋友终于被这样“待遇”征服了，心里想的只是让那个硬物赶快进去。于是接连发出了叫床的呻吟，那个举着我女朋友双腿的禽兽，终于慢慢开始挺进了，一下、两下。。随着“啊！”的一声惨叫，整个巨大充血的阳物全进去了。等它再次出来时，带着斑斑血迹，但这并未阻止它的前进。反而更加疯狂的开始抽插。男人不停低声的轻吼着，他的下体与我女朋友的下体发出“啪、啪。。。”的声音。更让他们热血沸腾的是我女朋友那一声声的“啊~啊。。。”声。很快，大概十分钟，第一个禽兽的发泄结束了。他迅速跑过来，手握阳物，把一股股浓精射在了我女朋友的乳房上，并用手把精液均匀涂抹在她的乳房上，甚至是发硬已久的乳头上。接下来是各个子不高的男生，他的阳物也显得粗短，但龟头很亮很大，而且已经吐出了一些精液，他显得很笨拙，好不容易找到了位置，但这一过程，使我女朋友又流出了大量的爱液。大概我女朋友很喜欢这种形状的小弟弟，虽然不能够深入，但大大的“帽子”加上频率飞快的撞击，让她彻底崩溃了。脸上已经不时绽放出了笑容。三个禽兽看到这些，马上开始对我女朋友进行语言上的羞辱，那个已经泄精的禽兽一边在旁边冲澡，一边辱骂着我的女朋友是个浪女，并说等他洗完后还要继续操她。第三个禽兽看到我女朋友已经开始发春，干脆一把抓住我女朋友的头发，并把快要爆炸了的阳物送到她的嘴边，野兽似的狂叫到“给我含住，快！”我女朋友有生以来头一次这么近的接近男人的阳物。吓的她直摇头。最后那个禽兽强行捏开了她的嘴，终于将巨大的阳物放了进去。这时正在疯狂抽插的那个禽兽，似乎到了高潮，他抱起我女朋友的双腿并搭在他肩上，开始了最后冲刺，我女朋友这时顾不上嘴里的阳物，双手紧抓长椅，准备迎接暴风雨的来临。两个人似乎有了默契，在稍休息了2、3秒中后，那个禽兽开始由慢到快最后到疯狂的抽插，响亮的“啪、啪。。。”声不停回响。长椅也随之变换着位置。我女朋友更是狂叫不断。偶尔也能看到她的一丝微笑，两个已经膨胀了的乳房总也跟不上我女朋友的身体，上下左右的不停乱晃。那个禽兽不知从什么时候起，也发出了啊、啊的叫声，终于，在一阵超快的“劈啪”声后，他迅速抽出自己的阳物，并拌开我女朋友的大腿，把他的阳物夹在中间，仅漏的巨大龟头，痛快的喷射着，精液粘满了我女朋友的小肚子，还有少量射到了奶子上，在最后的几下无力的涨射后，白色的精液挂满了我女朋友的阴毛。禽兽终于喘着粗气放下了我女朋友的腿。此时我女朋友象个半死的人一样，慢慢蜷起双腿，以为一切都结束了。但她忘了还有一个禽兽正在等待发泄。此时我女朋友几乎全身都是精液，于是最后这头禽兽打算先给她洗洗，由于三个人中就他力气最大，于是他抱起我女朋友来到淋浴，一阵冲洗后，也许是在水里找到了感觉，他竟把我女朋友抱到了泳池边上，然后自己先下水，再把她也抱下水，两人在水里都是裸体，我女朋友有怕水，于是死死的抱着他，两条腿也盘在他腰上，加上水的浮力，刚好使这个禽兽在水里很轻松自如，两只手不停的拨弄着她的阴唇和阴缔。嘴里又咬着其中一个奶子，我女朋友说，当时她整个人都坐在那禽兽的阳物上，由于那东西特别的坚挺，加上水的浮力，足以承受她的重量。没多久，那禽兽就受不了了，凭感觉将阳物对准了她的阴户，然后轻轻一送，就完全进去了。他的阳物是三个人中最大的，这样一插，我女朋友马上闭上了眼睛，开始享用。水里的频率并不快，但每一次抽差都非常实在，让我女朋友下体的欲火达到了巨大的燃烧！她已经不能忍受这种频率了，终于，从她口中说除了一个词：“快点嘛~”那禽兽一听，阳物顿时增大好多！直接顶着我女朋友来到泳池边上，先抽出阳物，然后让我女朋手抓着友泳池边上的扶手，使她的身体自然漂浮在水面上，那禽兽就从后面抱着她的两条大腿，非常到位的插了进去。这样的姿势，因为水位刚好没腰，使那禽兽想多快就多快。他疯狂的前后扭动着，并不时击打起朵朵浪花，我女朋友也因为第一次被别人从后面干，而发出了痛并快乐的叫声，女人的叫春就是野兽的催化剂，不久，随着一阵急促的冲刺，那禽兽猛地抽出阳物，发亮的龟头对准我女朋友的屁股上狂喷猛射，精液顺着股沟流向屁眼和还没来得及闭合的“花瓣”。。。。。我女朋友已经筋疲力尽。正当她用尽最后一点力气爬到泳池边上时，第一个干过她的男生，挺着他那再一次坚硬的巨棒，兴致勃勃的走了过来，我女朋友绝望的闭上了眼睛，这一次她是真的晕了过去。。。。不知过了多久，当她醒来时，自己已经躺在自己宿舍的床上，穿的是睡衣，但里面却没了内衣。后来才知道，自己晕过去以后，把三个禽兽吓坏了，连忙帮她穿好衣服，抬回了学校，校警问时，他们说她游泳时溺水呛着了。便把她直接扶近了女生公寓，进入宿舍关上门以后，三个禽兽听见我女朋友还正常呼吸以后，再一次淫性大发，将她在宿舍进行了轮奸。临走时，还每人剪了一撮她的阴毛，并拿了好多她的内衣。。。最让她至今仍不敢告他们的是：他们拍了与她作爱时的很多照片。以至她自己默默的承受了这一切。。就这样我女朋友在大学失去了她的“第一次、第二次。。。。”。然而她可以忍受，我却不能，所以我坚决地和她分手了。我知道她会伤心，但我还是处男呢",
			"added": 1568726676,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		}
	],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1532926147_1BbN1xhBnifxrrSLqriYip76y3nqMCGPvK": [
			{
				"comment_id": 1,
				"body": "> [asqw@zeroid.bit](#comment_1_12hbwWu8G1L7uo3MiLnNLkU4Sj4ZtPKQU8): 一直以为NSFW是恐怖视频，不敢看 [...]\n\nNot safe for work.",
				"added": 1568724172
			}
		]
	},
	"comment_vote": {}
}