{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Короновирус из Китая",
			"body": "",
			"added": 1580205965
		}
	],
	"topic_vote": {
		"1_1JE6djoBJfroS1y5DnwpMWRRcMkruPpkyv": 1,
		"2_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": 1,
		"1_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1_16mWmW6vF78uq9DJ95s77uTsK3YedBQ4Ri": [
			{
				"comment_id": 1,
				"body": "Китай как обычно всех наебал!\n\nОшеломительную аферу, как полагают некоторые эксперты, провели власти Китая на теме с коронавирусом. Версия по этому поводу выложена в соцсетях.\n\nАвторы версии полагают, что используя начавшуюся эпидемию коронавируса, Поднебесная заработала 20 миллиардов долларов и вернула 30% акций собственных монополий.\n\nВ то время как из Китая по миру расходятся пугающие вести об эпидемии коронавируса, власти этой страны обводят всех вокруг пальца. Об этом заявляет Faktxeber.\n\nПо предположениям издания, КНР использовала оригинальную экономическую тактику и за считанные дни заработала более 20 миллиардов долларов. К тому же в Китай вернулись около 30% акций собственных монополий.\n\nКак же Китай одурачил США и ЕС?\n\nДело в том, что на фоне паники. возникшей из-за эпидемии коронавируса, который за несколько дней, по данным властей Китая, убил 132 человека, в стране стремительно начали падать цены на акции китайских технологических компаний, часть которых принадлежала американским и европейским компаниям.\n\nЭто привело к тому, что иностранные акционеры стали распродавать свои доли дешево. Дождавшись этого момента, лидер КНР Си Дзиньпин распорядился скупить акции одновременно у всех крупных держателей, таким образом вернув акции в страну.\n\nЕсли так все и есть на самом деле, то можно ожидать в ближайшее время спада эпидемии коронавируса, ведь теперь Китаю экономически невыгодно продолжать обман. Не исключено, что и данные о большом числе заболевших – большое преувеличение.\n\nТем не менее приходящие вести об эпидемии , правдивость которых пока не опровергнута, не утешают. На данный момент известно о почти шести тысячах заболевших коронавирусом и о 132 погибших.\n\nВ то же время ранее мы приводили данные, что от обычного гриппа за год в тех же США умирают тысячи людей. Так что в статистике смертей от заболевания коронавирусом нет на самом деле ничего экстраординарного.\nhttps://www.yandex.kz/turbo?text=https%3A%2F%2Flentachel.ru%2Fnews%2F2020%2F01%2F29%2Fkitay-zarabotal-na-koronaviruse-20-mlrd-dollarov-teper-epidemiya-poydet-na-spad.html",
				"added": 1580290560
			},
			{
				"comment_id": 2,
				"body": "Страсти по коронавирусу: зарабатываем на панике \n\nhttps://vc.ru/finance/103399-strasti-po-koronavirusu-zarabatyvaem-na-panike",
				"added": 1580292346
			}
		]
	},
	"comment_vote": {
		"78_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2": 1,
		"7_1AnmkJak6Ts5pwkzeUVnds1W6Nw3GeHPEC": 1,
		"1_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": 1
	}
}