{
	"next_post_id": 64,
	"next_comment_id": 128,
	"next_follow_id": 2,
	"avatar": "generate",
	"user_name": "乌云",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"intro": "新 ZeroNet 用户",
	"post": [
		{
			"post_id": 1530436117,
			"body": "Trackers: 5/5 OK 这个很强壮呀。\n对于一个完全新的帐号，官方只提供了一个 SUNHUB，\n这次安装了新的zeronet客户端，发现最开始的界面提示总是连不上，没有或节点0，错误3个，等等的信息闪呀闪的，让人躁狂失望，我也在担心是不是真的连不上。\n一般如此的话，那么很多人都不会再继续等待了，所以新人不可能来。  希望在安装hello页面第一个站点的时候有提示“稍等片刻”字样。@p2p\n\n这里真的很强，zeronet,其他的帆樯都时不时的断，zeronet用了多年了，一直很稳定。作者真是厉害的存在。",
			"date_added": 1530436115
		},
		{
			"post_id": 1530437456,
			"body": "我忘记了我只是在sunhub里，我还要加其他huB，但是对于一个新人来说的话，就未必知道这些了，所以zeronet缺个新手导引放在zeronet hello页面里\n\n传统的加载其他HUB的方法失效了？怎么加不上了？\n\n加不上其它HUB。。。困在SUN一个HUB里了。",
			"date_added": 1530437452
		},
		{
			"post_id": 1530442755,
			"body": "hello页面的站点 右侧三点内有个 保存为ZIP的有什么用，是不是压缩成ZIP后也可以顺利加载。\n原来只是备份网站用的。我还以为是压缩文件数用的。",
			"date_added": 1530442750
		},
		{
			"post_id": 1530443060,
			"body": "zerome的数据数还是蛮多的，这应该不算巨大，如果日后有很多很多人在这里，是否对于新人加载有点残酷，能不能可以选择按需加载呢，譬如先加载最近的，等以后翻看过去的，就再加载过去的。",
			"date_added": 1530443054
		},
		{
			"post_id": 1530604500,
			"body": "保存种子，站点的最开始的10M文件种子\n利用一次性短链接地址推广zeronet。",
			"date_added": 1530604492
		},
		{
			"post_id": 1530852203,
			"body": "伊斯兰邪教徒才是真的可怕，斩首石刑黑麻袋。\n\n伊朗本来可以有一次直接奔向文明的机会，可惜神棍钻了权利真空。现在是伊斯兰神权神棍国家。\n\n多么可怕的事实呀，一个国家的民众起来推翻旧国家，希望能实现共产主义民主主义，却被伊斯兰邪教徒摘取了胜利果实。\n\n当然伊朗怎么说也是波斯人，不是阿拉伯人，所以伊斯兰邪教程度比不上沙逼。\n\n凡是伊斯兰邪教盛行的地方，冲突暴乱祸不单行隔三差五发生。\n\n要完特权，要政权，这就是伊斯兰邪教徒渐进式蚕食一个正常国家的方法。\n\n- 德国总统 穆哈穆德-默克尔 过得不舒服，内政部长以辞职作为要挟要求限制非法移民遣返难民，德国已经为收留伊斯兰难民付出了国家可能分裂，欧盟可能分裂的代价，这一切都是 穆哈穆德-默克尔 的亲伊斯兰邪教难民政策导致的。\n中国的伊斯兰邪教问题也是非常突出 新疆东突甘肃回回，未来问题可能很可怕。",
			"date_added": 1530852192
		},
		{
			"post_id": 1530854475,
			"body": "欧洲不能去的国家，瑞典，瑞典正在为自己的白左圣母行为遭受伊斯兰侵蚀变得不安全了，有很多街道已经被定义为警察都不敢去的地区了。\n",
			"date_added": 1530854462
		},
		{
			"post_id": 1530972145,
			"body": "AppArmor(Application Armor)是Linux内核的一个安全模块，AppArmor允许系统管理员将每个程序与一个安全配置文件关联，从而限制程序的功能。简单的说，AppArmor是与SELinux类似的一个访问控制系统，通过它你可以指定程序可以读、写或运行哪些文件，是否可以打开网络端口等。作为对传统Unix的自主访问控制模块的补充，AppArmor提供了强制访问控制机制，它已经被整合到2.6版本的Linux内核中。\n\n目前Ubuntu已自带了Apparmor， 可以在手册中获得相应的资料。",
			"date_added": 1530972131
		},
		{
			"post_id": 1531277033,
			"body": "唯物辩证主义打碎了唯心主义的枷锁，让天文物理化学等科学技术消灭了落后的宗教思想。\n让人类知道了我们是在地球上，还知道地球在太阳系中，还知道光和热并不是某个神棍先知说有就有的。\n热爱科学是现代文明的标志，一切神棍都退避三舍，妄图回到中世纪继续思想枷锁人民，那是不可能的。\n说得就是你这个邪教-------阿拉伯人的畜生邪教 伊斯兰。",
			"date_added": 1531277018
		},
		{
			"post_id": 1531386981,
			"body": "一本名为《伊斯兰如何阻碍和威胁社会进步》的书，该书警告欧洲的社会秩序处于严重威胁之下，伊斯兰邪教的教义是“精神监狱”，限制科学和教育发展。\n- 思想解放是多么重要，看看马丁路德对于教派改革后的重大作用吧，只有思想解放了，文化科技才能爆发出来。否则就像伊斯兰邪教那样社会进步科学文化进步被压抑住，整个经济社会文化科学原地踏步后，倒退到中世纪的宗教专制封建迷信社会。\n- 一个社会的文明程度，可以从这个社会对于女性地位看出来是不是真女权还是假女权， 一个国家女性如果出门还是黑麻袋，在家变成一戳家具一口牲畜，那这个国家根本没文明前途。出门旅游也要避开这样的国家。\n\n如果你问我伊斯兰邪教输出和毒害还有多久可能被停止，我只能告诉你大概在石油枯竭的时候，沙逼土鸡等伊斯兰石油天然气输出国路径国收费国就会没钱搞这些了。但那时候欧洲可能已经是德意志斯坦和法兰西斯坦国了。中国可能已经是中华伊斯兰共和国了/",
			"date_added": 1531386965
		},
		{
			"post_id": 1531391063,
			"body": "NOWS: Trackers: 17/38 OK",
			"date_added": 1531391044
		},
		{
			"post_id": 1531404450,
			"body": "感觉姜文是在拍中国版的超人英雄类样的电影，姜文的电影还是蛮正的，寓言般的电影很带感，至少拍得我们这些人看得懂。希望可以像外国人一样出系列",
			"date_added": 1531404430
		},
		{
			"post_id": 1531467441,
			"body": "刚看到个新闻，有点似曾相识，那是三氯氰胺奶粉事件，可能都是关于儿童的不幸吧，且涉事主体都口口声声说绝对没问题。\n- 正因为华大基因无创DNA检测做出的“低风险”判断，导致三位医生接连误判，产妇又在医生建议下，连续放弃或忽视了四次其它产前检测（唐筛、超声、穿刺）。华大基因的结论，直接和间接地将这家人送进了深渊。而这个湖南家庭，只是众多“无创漏检”悲剧家庭的缩影。\n- 男孩母亲后来加入了一个名为“无创假阴”的QQ群，在这个群中有近百个来自全国各地的家庭。他们的共同点是，在得出“无创低危”的检测结果后，生下了唐氏或有其它基因缺陷的婴儿。\n\n网络搜索了一下 华大基因的黑幕，发现这家企业绝对是有很大问题的。",
			"date_added": 1531467420
		},
		{
			"post_id": 1531487617,
			"body": "最近感觉民怨开始增多了，是不是川普的外部压力开始显现了。久积的火山似乎很有可能爆发。",
			"date_added": 1531487595
		},
		{
			"post_id": 1531527127,
			"body": "现在的零网有个问题，可能会影响用户使用，那就是打开新网站都提示无法连接，其实如果多刷几遍多等几分钟，这样的网站就能更新打开了，开发者也许并不关心这样的问题，但对于普通使用者就是新的旧的网站都打不开了。\n能不能在打开新网站的时候提示下：“多刷几遍”",
			"date_added": 1531527104
		},
		{
			"post_id": 1531536785,
			"body": "按照丛林法则来讲，一个生物降生下来就会遇到无数的想吃它的恶。\n资本主义是信奉性本恶的，所以用各种方法限制恶惩罚恶瓦解恶，三权分立5权分立都是典型的机制。\n信奉性本善的，注重劝导引导，但往往是惩戒力度不够。\n",
			"date_added": 1531536761
		},
		{
			"post_id": 1531571375,
			"body": "老百姓的民怨大多因为这2个字，民族政策的不平衡导致的也是这2个字，为了消灭这2个字，现代政体都朝美国那样的三权分立学习，但是依葫芦画瓢，画不像太多。\n不公\n就是为了消灭不公，政体老百姓都是抬着公平的旗帜或面具说事的。\n天下事 不患寡就患不公。\n假如管理民宗的那些人 不把洋人当上帝，不把穆斯林邪教徒当成宝也不会有最近的这个风波了。\n\n我看呀以后这样的风波会越来越多越来越大，参杂的更多老百姓势力将会越来越洪流。",
			"date_added": 1531571350
		},
		{
			"post_id": 1531572146,
			"body": "我要发多少个帖子，你们才能正确学会打开新站的姿势呀，@nofish @P2P你能不能给看看，是不是给打开新站的时候加点提示什么的，让用户能等一等，刷多下。\n\n这个是我打开老司机博客站的过程:\n第1次打开失败时候的提示.\n   连接中...\nTrackers announcing: 32, error: 6, done: 0\n找不到节点 \n\n第2次打开失败时候的提示.\n   连接中...\nTrackers announcing: 0, error: 38, done: 0\n找不到节点\nTracker connection error detected.\nUse Tor meek bridges for tracker connections\ncontent.json 下载失败\n\n第3次打开失败时候的提示.\n  连接中...\nTrackers announcing: 1, error: 29, done: 8\n已找到节点：4\nTracker connection error detected.\nUse Tor meek bridges for tracker connections\ncontent.json 已下载 \n\n第5次打开成功进入\n",
			"date_added": 1531572120
		},
		{
			"post_id": 1531621948,
			"body": "那些喜欢把“政治正确”挂在嘴上的国家，都在不停的被伊斯兰邪教蚕食着，甚至已经付出代价的---------南非白左付出自己生存或毁灭的代价，连德国都是各种内部冲突不断，整个欧洲更是因为默克尔的难民政策陷入到分崩离析的境地。\n\"彩虹之国\"南非曾经的统治者——白人，如今居然有十分之一的人生活在贫困线以下。 \n南非200多白人农民称遭种族迫害 澳大利亚乐意接收\n\n黑绿回回在中国也.....",
			"date_added": 1531621921
		},
		{
			"post_id": 1531697209,
			"body": "马丁路德 对于还处于 野蛮状态的基督教 的改革，产生了非常巨大的人类文明进步的意义，改革后的基督教产生的天主教新教迁移到美洲后创造出了美利坚。\n科学的蓬勃发展更是促进了无神论的发展，天主教新教无神论混合稳固了美利坚的思想阵地基本面。\n而伊斯兰邪教目前还处于早期野蛮基督教状态，黑暗仇恨排外与世俗世界格格不入 冲突不断 自爆不断 恐怖不断 斩首不断。\n人类文明能否战胜伊斯兰邪教毒瘤，决定了人类文明会不会衰落。\n- 民主在思想开化了的社会才能起最大作用，在邪教意识浓厚的国度民主变成了对外宣传用的统治工具或者根本没有民主。",
			"date_added": 1531697181
		},
		{
			"post_id": 1531791579,
			"body": "我居然连 http://127.0.0.1:43110/NewGFWTalk.bit/ 都打不开，我还让新人去这个站去看置顶贴，悲剧了。\n\n\n好吧，过了N个小时后，我突然在hello页面看到NewGFWTalk.bit 正常的更新了，哎，这是什么原因呢，一个词  ----时间。\n\n发现NewGFWTalk.bit 干净了，这样才对吗，什么都搞，等于不专业。",
			"date_added": 1531791550
		},
		{
			"post_id": 1531803860,
			"body": "这2天发现了一个调调， 很是好听，可能有些人会说这样的音乐很多，可是我第一次知道这样的调调有个名字叫 Bandari班得瑞，可以先听听 Sound of Silence(寂静之声)。",
			"date_added": 1531803830
		},
		{
			"post_id": 1531809702,
			"body": "\n\n老百姓的税钱，呵呵\n\n新华社怒发十问：我们的钱都去哪了，敢不敢给个交代\nhttp://www.cclycs.com/z685913.html\n\n\n\n钱都去了哪儿？新华社陆续10次播发追问向公民征收的各类行政性事业收费或政府基金。“收得爽快，用得糊涂，去向成谜”，调查背后的发现令人触目惊心。上述调查和追问有了哪些结果？哪些部门还欠公众一个交代？\n\n- 追问一：土地出让金\n\n调查：13年增长超30倍，近20万亿元土地出让金去哪儿了？据国土资源部数据，全国土地出让价款到去年首次超4万亿元为止，13年间增长超30倍，总额累计19.4万亿元。最近5年支出达13.49万亿元，部分省份已超过税收收入，土地收支账中存在诸多乱象。\n结果：于8月份启动的土地出让金收支全国性审计，已结束现场审计阶段。目前，审计工作待完成汇总、整理等程序后，将向社会公告结果。\n此次审计重点关注征收、管理和支出等方面。据一位审计系统的负责人介绍，此次土地出让金审计工作从各地审计部门抽调大批骨干力量参与，统一以审计署特派办的名义前往各地。搜集的资料和汇总的情况都不经过地方，直接向审计署上报汇总。\n业内人士分析认为，此次全国性土地出让金审计，不仅能够揭开一些地区土地出让金收支乱象的盖子，还能摸清地方政府公共财政对土地出让的依赖程度，为下一步对土地出让金强化刚性管理，以及理顺中央与地方的财税体系提供支撑。\n\n- 追问二：民航发展基金\n\n调查：一张机票除了票价本身，还包含被称为“民航发展基金”的几十块钱。2012年，机场建设费被整合成民航发展基金。2013年，该基金收取超过250亿元，其背后是3亿多人次乘坐飞机。记者调查发现，这笔钱不少成为广州、北京等地机场上市公司的收入，还有数十亿元“其他支出”不知所终。\n财政部驻广东省财政监察专员办事处有关负责人表示，2012年民航发展基金合并后，白云机场并未就“能否将民航发展基金部分作为营业收入”向他们请示。\n结果：中国民航局的书面回应称：根据规定，民航发展基金实行收支两条线管理，收入统一上缴中央国库，支出纳入政府性基金预算报财政部批准后执行。基金在使用上严格遵守相关规定，全部用于对民航企事业单位基本建设投资补助和其他各项补贴，其中补贴预算方案在报财政部审批前在民航局政府网站上进行了公示。对于使用民航发展基金给予三个上市机场的补贴，也按规定履行预算管理报批程序，经财政部批准后执行。\n但是，这个回应似乎难以得到认同。\n\n- 追问三：住宅维修资金\n\n调查：据中国物业管理协会物业维修资金专委会的不完全统计，1998年实行住宅专项维修资金管理办法至今，各地收取维修资金在5000亿元左右。这笔巨款长期被闲置在银行难以取出，似乎处于“沉睡”状态。但实际上，它们在暗中“钱生钱”，部分被挪用、炒股和理财，沦为某些部门的“生财工具”。\n结果：报道发出后，所涉及的南京市住建部门专门召开座谈会，向记者介绍了当地在清理住房维修资金方面的工作和做法，表示欢迎共同研究如何完善管理使用。\n住建部房地产市场监管司物业管理处处长陈伟表示，当前，针对住房维修资金群众反映强烈。因各地情况不一样，维修资金问题比较复杂，目前仍在进一步研究中，也在做相关探索。\n\n- 追问四：公交卡押金\n\n调查：公交一卡通发行量在我国已超1.8亿张，每张卡押金10元到30元。大多数人认为，这笔巨款一直躺在专用账户上“沉睡”、可以随时取回。但记者调查发现，数亿元押金层层被“截留”，还剩多少成“谜”；一部分押金以“运营”“折旧”等名义被腾转挪移甚至扣光，最终悄然落入公交卡公司的腰包。\n结果：针对公交一卡通巨额押金，已有北京、福州、广州、厦门、南京、郑州等十余个城市市民申请公开或提起诉讼。交通运输部有关负责人表示，对此问题请采访各地交通部门，交通运输部尚无规定和具体办法。\n有关部委要求各地自行研究。不过，地方基层部门和企业却希望出台统一意见指导。北京市一卡通公司等多地企业呼吁，希望出台押金管理相关法规，让企业不再无所适从。\n\n- 追问五：涉农补贴\n\n调查：近一年来，全国查处各种涉农补贴问题6000余起，涉及资金20多亿元，克扣农民征地拆迁补偿款、挪用套取农业专项资金、违规发放农村危房改造和低保等涉农资金腐败问题突出，今年１至７月全国检察机关查处涉农领域贪腐逾万人。\n结果：针对财政涉农补贴存在的诸多问题，2014年的中央一号文件明确提出要提高补贴精准性、指向性，整合和统筹使用涉农资金，稳步推进从财政预算编制环节清理和归并整合涉农资金。但是，涉农资金腐败问题依然频发，暴露出管理粗放、制度“空转”、防线失守等问题。\n支农资金屡屡被套取说明制度的完善已经刻不容缓，如何在“大补贴”时代加强精细化管理是一道亟待破解的课题。\n\n- 追问六：科研经费\n\n调查：不少人把科研经费当做“唐僧肉”，通过虚列劳务费用、收集发票冲账、借壳套现等方式中饱私囊。仅2013年，全国公共财政科技支出超过5000亿元，但学术成果和技术创新并不尽如人意。\n结果：稿件播发后，许多地方随即出台了加强对科研经费管理的细则。如为解决“问题科研经费”，山东省将改革科研经费使用政策，酝酿建立科研项目评审公开制度、强化科技经费使用法人责任制、加强监督建立评审专家“黑名单”等。上海市科委将依据《国务院关于改进加强中央财政科研项目和资金管理的若干意见》等文件，对承担科研计划项目（课题）的单位每年一次开展巡视检查，同时还公布《上海市科研计划专项经费巡查管理暂行办法》，对巡查工作的政策依据、主要任务、工作规程和违规行为处理等内容作出规定。福建省出台《关于改进加强省级财政科研项目和资金管理的若干意见》，提出从明年起对科研项目经费实行“公务卡”，采用非现金方式结算，实现“痕迹管理”。\n\n- 追问七：附加费\n\n调查：在关乎民生的水、电、汽油价格中，“附加费”普遍存在。按2013年全国用电量初步估算，仅电价“附加费”一年可达2000多亿元，其中居民生活用电的“附加费”就达270多亿元。\n结果：财政部相关负责人回应，我国将清理规范包括民生资源“附加费”在内的行政事业性收费和政府性基金。对于未列入财政部目录清单的行政事业性收费和政府性基金，公民、法人和其他组织有权拒绝缴纳。11月15日，国务院常务会议也部署加快推进价格改革、实施普遍性降费。\n\n- 追问八：城市停车费\n\n调查：北京、上海、广州、天津等地的财政部门没有一个公开披露巨额停车费的详细收支情况。据记者调查，车主缴纳的停车费与政府财政所得之间存在巨大差额，至少有一半收上来的钱最终没有进入政府的口袋，有地方财政甚至分文未取；作为公共资源的道路停车位，经营过度“私人化”，公共资源分配长期“暗箱化”。\n结果：北京市相关部门称“市级部门不掌握情况，停车属于区县政府管理”；广州市交通部门和停车协会特地召开新闻发布会，称广州两家垄断管理企业年总利润为263万元，社会舆论哗然；天津交通部门和联华停车公司大股东市国资委表示，对联华公司“无法管理”；上海市交通委称，停车费出现“收不上来”的情况，但表示将从收支两条线加强对上海停车收费的管理。\n\n- 追问九：高速公路收费\n\n调查：山东交通部门宣布，2014年底到期的15条（段）高速公路将继续收费，主要理由是偿还银行贷款。兴起于上世纪90年代的收费高速公路，将迎来收费到期的高峰。专家估算，全国高速公路一年收费在4000亿元以上。高速公路成为“印钞机”，微利公用事业变身暴利行业；收来的钱除了修路还贷，还用在了高福利养人或被挪用；而“统贷统还”政策将导致“东收西还”无限循环。\n结果：山东省交通部门回应称，15条政府还贷高速公路中，能还清银行贷款的项目2个，其他13个项目均不能按期偿还完贷款。截至发稿时，山东省交通部门仍在论证中，目前尚无明确结论。\n收费年限到期的京石高速路，日前以“扩建”的理由重新获得收费权，被质疑为“新的延期收费借口”。\n交通运输部23日发布了2013年全国收费公路统计公报：全国收费公路通行费收入3652亿元，其中高速公路3316亿元；支出4313亿元，年度亏损661亿元。\n对于公众质疑的“统贷统还”，交通部公路局局长李彦武认为：“统贷统还符合网络性基础设施的特性”“一方面还会继续坚持收费政策，吸引社会资本投资以高速公路为主的收费公路；另一方面建立以公共财政投入为主的普通公路投融资机制。进一步提高收费公路门槛，严格限制新增普通收费公路，控制收费公路规模。未来，我国收费公路规模将控制在公路网总规模的3%。”\n对于各界高度关注的高速公路收费年限，“账本”没有给出直接回应。\n\n- 追问十：彩票资金\n\n调查：官方数据显示，我国彩票发行规模已累计达1.7万亿元。然而，其中占比15%的发行费标准多年居高不下；规定占35%的公益金中，也有部分趴在地方政府账上“睡大觉”，还有部分资金被用于盖大楼、买游艇、补亏空。\n结果：浙江体彩一位内部人士表示，这是20多年来首次中央媒体触动彩票这个敏感问题，“也该拿出来晒晒了”。\n审计署于11月中旬出动18个特派办，一个特派办负责一个省，选了全国18个省份开展彩票资金审计工作。此次审计将持续1个月时间。目前，各省级彩票管理机构正配合审计署对本省各级彩票资金的管理使用进行审计。\n浙江省福彩中心通过官方网站等渠道向社会发布了首份社会责任报告，详细介绍了2013年度浙江省福利彩票的发行、资金筹集、资金使用等情况，并承诺从今年开始，浙江省福彩中心将每年发布社会责任报告。\n\n\n其实还有很多问题，所以分权牵制，舆论监督，终身问责，媒体言路，，，，是多么重要\n\n什么时候人大像外国议会议员一样可以问责政府，一言不合就问责政府，那该多好。 可惜现在的人大，，，，我好像自愿放弃了所有年去选举人大的资格哦，因为在我们村都是内定的，所以送2个字“呵呵”",
			"date_added": 1531809671
		},
		{
			"post_id": 1531812025,
			"body": "zeroent rev3537",
			"date_added": 1531811993
		},
		{
			"post_id": 1531887603,
			"body": "从一个坑跳入另一个坑的事，一直存在，如何避免像伊朗那样病急跳入神教的坑，是需要智慧的。\n西方的东西有精华有糟粕，如何避免眼瞎或被带路党搞掉精华留下糟粕。\n需要什么才能阻止这一切，需要的是民众的民智和科学思想才能创造出一个互相牵制互相进步，恶行无法爆发的社会。\n",
			"date_added": 1531887570
		},
		{
			"post_id": 1531888946,
			"body": "海面上飘过一块烂木板，上面有很多鲍鱼和扇贝醍醐小蝌蚪，它曾是一艏巨型巨舰的一部分，这是一个它的故事：晨雾渐渐的海面飘散，清风拂动，一个海边人在悠悠的慢跑中，打破了今晨最后一刻的宁静，，，，",
			"date_added": 1531888912
		},
		{
			"post_id": 1531889649,
			"body": "为什么我不看好包括比特币空气币等，就拿比特币来说，很多不了解比特币的人，以为这个带个币字的就是币了，那是侮辱智商，我以为比特币应该改名为比特数字更好些。   \n几个早已拥有着面积130平米的大房子内都是大米的人（巨鲸），而一群人（虾米）还在围着一碗大米抢个不停，抢不到还不服气的说，把最后的大米每粒都要劈开一半再分，最后这些人都拿着放大镜找米，最后显微镜都用上了，而那几个有面积130平米的大房子内都是大米的人却在旁边说：这些蠢货，活该是接盘侠，我们几个每天抛出一点，喂给它们，我们要尽快都换成美元。\n我可能言语比较激烈，但是道理就是这样的。",
			"date_added": 1531889614
		},
		{
			"post_id": 1531955956,
			"body": "一脸大胡子，一顶小白帽，右手食指戳到天，恐怖分子特征明显。\n一个黑麻袋，恐怖分子的牲口标志。\n是谁给了伊斯兰邪教发展用的钱？\n这个世界上哪怕邪教，都要有钱才能发展，没钱谁也不是傻子。\n新疆，，甘肃，程度最高。\n河南，云南，山东，逐渐壮大，\n安徽等开始发芽，\n杭州西湖边上的清真寺是谁批准的，\n背后都有鬼魅-----XXX。\n一等洋人4等汉5等汉的背后是-----XXX。\n\n",
			"date_added": 1531955919
		},
		{
			"post_id": 1531957238,
			"body": "欧盟向谷歌开出50亿美元的垄断罚单。\n那么我的问题是，为什么封闭的苹果却可以仍旧逍遥自在呢，而相对开放的谷歌安卓却受到了垄断罚单？\n",
			"date_added": 1531957200
		},
		{
			"post_id": 1532748378,
			"body": "如果一个政治体制瓦解，需要小心被伊斯兰邪教篡权，这是非常不幸的从一个坑跳到另一个坑的节奏，如伊朗，明明可以发展正常的现代政府制度的，被半路截胡成神权神棍国家。",
			"date_added": 1532748339
		},
		{
			"post_id": 1532882939,
			"body": "终于搞定打开 这个🎈BT🎈高清电影网 - ZeroNet   。由于DNS污染，需要直接IP。https://github.com/ngosang/trackerslist\n\ntrackers_all_ip (84 trackers) => https://raw.githubusercontent.com/ngosang/trackerslist/master/trackers_all_ip.txt\n\n不过我的所有71个trackerslist全部牺牲了，现在怀疑怎么打开的🎈BT🎈高清电影网 - ZeroNet  ，看来trackerslist这招没什么用\n",
			"date_added": 1532882899
		},
		{
			"post_id": 1532915341,
			"body": "看了很多P2P网络，I2P网络是最强生命力的，可惜I2P被JAVA拖累了，I2PD虽然C++写的，但是没有I2P名气大用户多。\nTrackers: 0/71",
			"date_added": 1532915300
		},
		{
			"post_id": 1532917169,
			"body": "http://www.freebuf.com/sectool/141482.html (打开推荐网站时，请自觉关闭JS和cookies 图片视频等，我无法保证网站是安全的，至少我看网站的时候都是这么做的)\n\n基于Tor的通讯软件Briar：断网也能用的通信软件\n在软件的后续开发计划中，开发者打算加入I2P支持作为Tor的替代品。通过与开发者Grote的沟通小编了解到，Briar之后还会加入WiFi Direct的通信方式，甚至还可能会用到FM无线电。\n\n目前Briar已经获得了一定的知名度，某些注重隐私的用户把它称作“暗网信使”。\n\n看了上面的介绍，我比较好奇的FM无线电组网，为什么呢，因为FM无线电传播距离远呀，要是能搞定，这个绝对是是个吸引人的地方。WIFI 蓝牙组网这个距离太近了，没什么意思，倒是未来如果有超级WIFI出来，也是不错的，可惜超级WIFI好像只听楼梯想不见人下来。\n\n超级WIFI超距离组网 和 FM超距离组网，这2个是我关心的，普通距离的WIFI组网和普通距离的蓝牙组网就是鸡肋。\n",
			"date_added": 1532917127
		},
		{
			"post_id": 1533276860,
			"body": "据说，现在炒商品房被挡住了，现在改炒厂房了。这是不是要压垮剩下的厂子都倒闭呀，拭目以待。   ",
			"date_added": 1533276817
		},
		{
			"post_id": 1533281284,
			"body": "试玩了一下Briar， 目前Briar还不能换头像，没有个性签名，需要面对面加好友，这是避免中途被截胡加错好友。有论坛有博客能转发，WIFI局域可以互联，消息速度很快，但消息不能像ZERONET一样有自主删除权，信息是在本地设备保存，不是云端。可以群聊，不清楚能否老鼠式串联成群聊，\n\n",
			"date_added": 1533281240
		},
		{
			"post_id": 1533283461,
			"body": "网友文章摘录：Tox 主要是反监控的，匿名性并不特别强。你等于是在向好友广播你的 ip 地址（大致等于你现在在什么地方，除非配置代理）和上下线时间（大致等于活动规律）。所以 Tox 只在你的所有好友都是安全（也就是你信任他们，同时他们没有被控制）的时候才是安全的。\nTox实现群聊，更强大的群聊，因为是通过一个好友接收发送消息，所以不存在登出就丢失群组的问题了，现在桥接了Riot，Telegram，RetroShare。只要添加这个用户就行，接收发送都通过这个\nToxIRCBot：5ee85fd7b4b6bd8fd113a1e8cc5853a233008b574e07f2cc76a7ea43ae24ae0754dbd6b8fd3f\n\n双击字串选择复制，\n",
			"date_added": 1533283416
		},
		{
			"post_id": 1533285528,
			"body": "你们看到新闻了吗，北极圈温度达到30度了，中国华北可能人不宜居，有被烤熟的风险，  未来沿海城市会不会被淹没，东北这地方是不是成沙漠，现在的房地产估计都要变成0价值了。40年后估计上海变海下了，台湾变岛礁了，日本沉没了，",
			"date_added": 1533285482
		},
		{
			"post_id": 1533288380,
			"body": "我刚从 微博号 @小小蜗牛驼肥象 那里看到，中国可能参与在叙利亚的动物园区域战役去消灭某族东突回回的战斗。\n我个人对其它都保留意见，唯独对于维护中国大民族的行为是支持的。必须强硬打击某伊斯兰邪教蛊惑的东突回回的嚣张气焰。",
			"date_added": 1533288333
		},
		{
			"post_id": 1533289691,
			"body": "看到解释说LoRaWAN是星状拓扑而非网状网拓扑，\n：\"在最基本的层面上，像LoRaWAN这样的无线协议相当简单。LoRaWAN是一种星型或星型对星型拓扑结构，因为在保持电池电量并增加通信范围方面的优势，所以普遍认为它比网状网络更好。 \"\n\n虽然电量消耗可能少点，但结构不利于去中心化。\n\nLoRaWAN更适合工厂使用，社区大城市使用我还是偏向网状网这样的去中心化网络，只是目前没有很好支持远距离通讯的硬件设备。",
			"date_added": 1533289643
		},
		{
			"post_id": 1533343688,
			"body": "网状网无线自组硬件设备已经有了，\n\n-------------\n规范是3GPP制定的，Sidelink空口规范支持蜂窝小区内和小区外的终端之间直接通信，终端之间可以自组成网。\n具体硬件如海能达iMesh自组网产品，iMesh传输距离达到了15公里以上，吞吐率稳定。目前国内多数用于消防安全领域。\n\n---------------\n当然我觉得直接用(超级WIFI)WiMAX会更快速，毕竟WiFi我们都用得很熟练了，\nWiFi802.11a传输距离减小，要覆盖相同的范围，就要有更多的AP接入点。\nWiMAX与WiFi相比，优势如下：\n    优势之一，实现更远的传输距离。WiMax所能实现的50公里的无线信号传输距离是无线局域网所不能比拟的，网络覆盖面积是3G发射塔的10倍，只要少数基站建设就能实现全城覆盖，这样就使得无线网络应用的范围大大扩展。\n    优势之二，提供更高速的宽带接入。据悉，WiMax所能提供的最高接入速度是70M，这个速度是3G所能提供的宽带速度的30倍。对无线网络来说，这的确是一个惊人的进步。\n    优势之三，提供优良的最后一公里网络接入服务。作为一种无线城域网技术，它可以将Wi－Fi热点连接到互联网，也可作为DSL等有线接入方式的无线扩展，实现最后一公里的宽带接入。WiMax可为50公里线性区域内提供服务，用户无需线缆即可与基站建立宽带连接。\n    优势之四，提供多媒体通信服务。由于WiMax较之Wi－Fi具有更好的可扩展性和安全性，从而能够实现电信级的多媒体通信服务。\n\n-------------\n什么时候人人都可以用的时候，ISP就被淘汰了。大家组成互联互通的没ISP的网络。",
			"date_added": 1533343639
		},
		{
			"post_id": 1533383937,
			"body": "今天瞥了下区块链，原来做一个非常简单，难怪那么多骗人的空气币，门槛低得吓死个人。\n哎，不说了，我始终不相信带个币的东西，旁氏骗局传销。\n哪天我有台量子计算机，我第一个就把比特币给干趴下，让你丫骗人。",
			"date_added": 1533383887
		},
		{
			"post_id": 1533399028,
			"body": "我是一个相信性本恶的人，所以我是支持借特朗普要求贸易国零关税的要求之时实现彻底开放的，毕竟这样受惠的是我们普通人，何况处于温室内的”国企“该迎接暴风雨的洗礼了，这样才能遇难渐强呀，否则只会垄断向老百姓收钱算什么本事，有本事向老外刮钱。",
			"date_added": 1533398976
		},
		{
			"post_id": 1533946136,
			"body": "土耳其要崩溃了，埃特勒这只伊斯兰邪教土鸡要被煮了。 土耳其资助东突，沙特资助回回。\n\n为什么邪教国土耳其被打击：\n敢和美国叫板在叙利亚咄咄逼人，屡次逼迫美国退缩防线，\n敢扣押美国人，\n敢叫嚣让美国释放想改良伊斯兰邪教的居伦居兰，\n敢和俄罗斯眉来眼去坑美国，\n敢在耶路撒冷问题上处处为难美国， \n敢输出第五纵队(假扮难民的伊斯兰邪教徒青壮年)破坏瓦解控制欧洲，让美国等西方被伊斯兰奴役。\n...\n埃特勒野心巨大！\n所以，一句话“不搞你这个邪教徒搞谁”。",
			"date_added": 1533946082
		},
		{
			"post_id": 1533946550,
			"body": "我觉得未来贸易战可能走向战争， 加关税等同于闭关锁国，因为闭关锁国，最后历史告诉我们，只能是战争征服对方。 \n很希望，中美如欧美日美欧日那样开始谈零关税零壁垒零XX的协议，这样受惠的一定是老百姓，受伤的一定是寄生虫。",
			"date_added": 1533946495
		},
		{
			"post_id": 1533996283,
			"body": "你今天的小目标 3吨人民币 实现了吗？\n（自从所谓的长者蛤X把贪污死性废除后，贪污是越贪越多，然后部分贪宫两面人和已死烂邪教搞在一起，最后变成。。。。国有难，回必乱）",
			"date_added": 1533996226
		},
		{
			"post_id": 1534064780,
			"body": "美欧日未来可能形成 零关税 零补贴 零壁垒的3零市场，未来会有更多如英国.澳大利亚.加拿大等等国家加入进来，WTO就名存实亡了。\n美国的强大证明了资本主义是正确的选择之一：国家营造重商环境严惩破坏者(假一罚死,不做运动员只做裁判员才能客观力度大)，更多的资本自由公平的逐利，为了不让资本杀鸡取卵式吸血过度导致贫富差距拉大，政府收取让双方都满意的税收来平衡，良性循环。\n而国家政府只对屁民的选票负责，做对了选民继续把你选，做错了政府滚蛋更迭。\n为了保证最坏的结果，宪法赋予公民拥枪的权利，以抵抗有可能出现的违背民意的政府行为。  \n为了限制政府违背为民做主，变成青天大老爷，所以必须处处削弱它的权力，互相博弈后的法律才能更大程度的被执行。 \n\n在一个公平的市场环境中，哪怕被重裁了，也是心服口服的。所以美国一如既往的吸引人才和资金。\n在一个不公平的环境中，哪怕是轻判了，也是口服心不服的。\n\n性本恶，所以一环扣一环的限制。\n人是好恶的，如果没有一个惩恶的环境，最恶的就会鱼肉弱人。\n阳光是最好的消毒剂，一切见不得人的都会被发现扼杀。\n",
			"date_added": 1534064722
		},
		{
			"post_id": 1534066385,
			"body": "你怎么看？",
			"date_added": 1534066326,
			"meta": "{\"img\":\"888,700,555776543855333c87a76211444965aaa777b77522111000,000111100023022444442567771487359477AB128C9D7D0B8E063428187E06B4777EFE0AA447EEE7\"}"
		},
		{
			"post_id": 1534255637,
			"body": "发现 一旦神棍和世俗人争辩（他没内衣怂特朗普，一个神棍怂一个精明的商人），就完全暴露出他们的愚蠢只能忽悠更愚蠢的邪教徒的能力。    神棍最喜欢发出邪教击杀令了，什么时候也给特朗普来一张，呵呵/",
			"date_added": 1534255577
		},
		{
			"post_id": 1534299189,
			"body": "要想社会变得好，唯有科学和互联网1.0 互联网2.0，当然科学骗子和科学神棍走远些，你们不配信仰科学。\n扔掉伊斯兰邪教，世俗让人进步。",
			"date_added": 1534299128
		},
		{
			"post_id": 1534397446,
			"body": "民主党是披着美国外衣的共产主义社会主义党。\n我一直认为达到共产主义和社会主义状态是一种理想主义，在建国初期是非常适合的（百废待兴），但是国家正常后就不一定能够持续下去，若想以后达到这样的只能是在机器人早期时代可能存在，当机器人有意识后，就会把好吃懒做的统统圈养起来。\n而我认为资本主义是现实主义，更接近优胜劣汰的达尔文森林法则，当然真实的资本主义具体应该是资本社会主义，因为现实中资本主义通过税收实现了社会主义的一些功能调节贫富差距。\n当然邪教就不提了，这是用精神意志控制人的奴隶封建迷信。\n",
			"date_added": 1534397384
		},
		{
			"post_id": 1534398560,
			"body": "最近有意思是：\n有的地方抢棺材要烧，但不碰伊斯兰教的棺材\n有的地方把纸钱都不让烧了， 但不碰邪教徒的清真食品\n\n“不公”会引起民愤，民愤点火就着",
			"date_added": 1534398497
		}
	],
	"post_like": {
		"1AjTLtVhadApTtUom4VSCfQ5ZPjZr5QVLC_1530608624": 1530617063,
		"1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1531889649": 1532748707,
		"1HuxEpnWQBMk2HkD7DobuwQnqHjqHy4psJ_1532788754": 1532878839,
		"15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe_1533658141": 1533852695,
		"15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe_1534220903": 1534254696,
		"15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe_1534378754": 1534397928
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "我下载个东西断了N回，到现在都没下完，还在找新的出洞方法，哎。中国的科技就是这样一步步落后的。",
			"post_uri": "1By1Dw5WcenqT8vXdMNZoUkebNGt7RRMnm_1530403055",
			"date_added": 1530436689
		},
		{
			"comment_id": 2,
			"body": "@🐲🐰🐒🐍: 心脏不够强大，血液不够流畅，导致器官血液不够。加强锻炼。",
			"post_uri": "16bpvKnuiVmHqmLGZKke2Rf4XWaZ5e7ZhB_1530342424",
			"date_added": 1530436912
		},
		{
			"comment_id": 3,
			"body": "@🐲🐰🐒🐍: 点过了，hello 页面没反应",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1530437456",
			"date_added": 1530441236
		},
		{
			"comment_id": 4,
			"body": "@🐲🐰🐒🐍: User not found or muted，但是我根本没屏蔽过，这新客户端是默认把其他HUB屏蔽了。而我却找不到开关。\n",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1530437456",
			"date_added": 1530441417
		},
		{
			"comment_id": 5,
			"body": "@🐲🐰🐒🐍: 奇迹出现了，之前单独点击HUB不能添加，现在点击可以了。。。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1530437456",
			"date_added": 1530441583
		},
		{
			"comment_id": 6,
			"body": "@Polar🍀☘️🌿🌾🌴: 现在正常可以加了，不清楚为什么连接了很长一段时间还不能加的原因。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1530437456",
			"date_added": 1530442297
		},
		{
			"comment_id": 7,
			"body": "我只有第一个呀，那下面的都是你自己屏蔽的吧？",
			"post_uri": "16bpvKnuiVmHqmLGZKke2Rf4XWaZ5e7ZhB_1530332776",
			"date_added": 1530443692
		},
		{
			"comment_id": 8,
			"body": "@Eaglex: 如果搞得数据消失会消灭掉分布式的最重要的特性，确实不那么好。那有没有可以把数据压缩成加载飞快的状态呢。 反正我觉得日后肯定会很麻烦的，如同推死他一样，数据膨胀，到最后撑死了。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1530443060",
			"date_added": 1530444262
		},
		{
			"comment_id": 14,
			"body": "@Eaglex: 假设我们现在zerome用户达到30W了，每天活跃用户打出的数据量数达5000条，那如果持续运行了几个月，当一个新用户进来，发现一个劲的再加载，数量达到1000W条的信息，面对这样的庞大数据，作为我这样的用户也会崩溃的。这是分布式的灾难日，也许有些老数据，旧数据就应该雪藏，等用的时候唤醒才是。否则奔溃。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1530443060",
			"date_added": 1530448140
		},
		{
			"comment_id": 16,
			"body": "@Eaglex: 确实也有道理，但必须取舍，如zeronet就是需要流畅度，先舍去了安全性方面，但现在条件成熟又把安全性拉回来了，现在也非常流畅，要看时机吧，等那天真的是每天加载1W条信息，新人一开始要加载3000W条信息的时候，我们他们都会想出更好的。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1530443060",
			"date_added": 1530448688
		},
		{
			"comment_id": 21,
			"body": "@Eaglex: 貌似小站，看见多处有推荐，应该不差，但我还首选官方。",
			"post_uri": "1By1Dw5WcenqT8vXdMNZoUkebNGt7RRMnm_1530403055",
			"date_added": 1530452527
		},
		{
			"comment_id": 22,
			"body": "@Vpei: 是的，每次打开新站，总是第一次失败，找不到节点翻红杠杠。 还好我坚持又重新重新重新就成功了//   总的来说虽然困难总算成功。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1530437456",
			"date_added": 1530604361
		},
		{
			"comment_id": 25,
			"body": "@Vpei: 据说万维网祖师爷在重新研究新一代的去中心化网络了，",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1530437456",
			"date_added": 1530853412
		},
		{
			"comment_id": 26,
			"body": "@Vpei: 美国军方早就参与了去中心化网络实战试验了， 我指的是万维网的那个开发者，不是合作伙伴资助伙伴。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1530437456",
			"date_added": 1530854294
		},
		{
			"comment_id": 28,
			"body": "🙃",
			"post_uri": "1NpEfN9nbyvag4MPG9j6TgcBC8aVFEZjGG_1530972410",
			"date_added": 1530972603
		},
		{
			"comment_id": 29,
			"body": "好吧。我冒出来一下",
			"post_uri": "15HeBuaPPpvSuug87ByoV9nvoWKdKRC2RY_1531126790",
			"date_added": 1531217940
		},
		{
			"comment_id": 34,
			"body": "没问题，是不是你的电脑环境有什么问题？",
			"post_uri": "1PctriJ155UjQV4HrXw9qr7rznf8MNBkaj_1531329414",
			"date_added": 1531391002
		},
		{
			"comment_id": 37,
			"body": "@Snowdash: 在你的DATA文件夹下有 filters.json sites.json users.json 分别是 屏蔽列表，网站列表 个人数据含私钥 ， 具体的个人网站私钥应该在UsersJson里内的\"auth_privatekey\"，具体的个人网站内容在DATA内的对应文件夹就是了",
			"post_uri": "1PctriJ155UjQV4HrXw9qr7rznf8MNBkaj_1531329414",
			"date_added": 1531404038
		},
		{
			"comment_id": 38,
			"body": "@Snowdash: 你的怎么还是  “mutes.json” ？ 你有多久没升级了，建议你先把老版本的zeronet升级后，再迁移到新版本的zeronet。  我知道 “mutes.json” 就是屏蔽的列表文件，假设这个 “mutes.json” 文件还能被用，那么你就复制  “mutes.json” “sites.json” “users.json” 和你需要迁移的喜欢网站（DATA下对应的网站文件夹）到新的目标下即可。",
			"post_uri": "1PctriJ155UjQV4HrXw9qr7rznf8MNBkaj_1531329414",
			"date_added": 1531404736
		},
		{
			"comment_id": 40,
			"body": "@ssdifnskdjfnsdjk@zeroid.bit: 我现在才2个了，重新进来后没增长。。。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1531391063",
			"date_added": 1531405124
		},
		{
			"comment_id": 42,
			"body": "@Nzg: 没用的，人家手里拿的还是频出极端恐怖分子的古烂经，等时机成熟了，这些人各个都是手拿刀片割你头的阿拉伯战士了，现在只是潜伏着而已。屠戮汉人的时候还没到最好时机。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1530852203",
			"date_added": 1531405680
		},
		{
			"comment_id": 44,
			"body": "@猫叉酱（小号）: 骗子多是因为法律不健全，法律健全也得不到执行，美国欧洲资本主义性本恶，所以夺权互相牵制民主角力然后法律难产，这样的法律才有执行效率，因为本身在法律难产中就得到了多数人的认可，实行起来就非常有权威，欧美法律惩戒能力非常强，强生好像最近被判输40多亿美元，而我国我只能说性本善善。。。。\n法律一旦有惩戒能力，就能消灭很多企图冒险一试的恶。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1531467441",
			"date_added": 1531468165
		},
		{
			"comment_id": 51,
			"body": "5566",
			"post_uri": "15i8qGThhQUinPTr4QTRGoMSUgxVNeKWUu_1",
			"date_added": 1531574139
		},
		{
			"comment_id": 53,
			"body": "@P2P: 我重新试验了几个新站点的打开，这次并没有在点击tor meek后运行的，结果是前面也是各种错误提示，但后面还是可以加载的，只是需要多等待时间，当然我认为点击了tor meek后或加速正确加载时间。 \n但是一般用户往往是看到错误提示后误认为无法继续打开，他们会放弃这一努力，所以我们需要做的是给用户引导和解释，不要让他们放弃，加载是个过程，需要多尝试。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1531572146",
			"date_added": 1531622755
		},
		{
			"comment_id": 54,
			"body": "@P2P: 在第一次加载错误的时候就要提示这些asking users to keep refreshing and waiting. ，否则用户就会打退堂鼓，抱怨zerone根本不能用。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1531572146",
			"date_added": 1531696688
		},
		{
			"comment_id": 56,
			"body": "@atheist@zeroid.bit: 我是英文盲呀，它的作用是不是把本地目标用户的资料转移到一个HUB里？\n",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1530437456",
			"date_added": 1531719397
		},
		{
			"comment_id": 58,
			"body": "@Zerobaby123: 对于一个新人来说，先多看，然后再动手最好，所以建议你去http://127.0.0.1:43110/NewGFWTalk.bit/ 看置顶的帖子，如果你打不开http://127.0.0.1:43110/NewGFWTalk.bit/ 这个站点，你多尝试打开，刷新，我问你一下你的zeronet是什么时候从哪里下载的，版本是多少",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1531572146",
			"date_added": 1531790739
		},
		{
			"comment_id": 59,
			"body": "@P2P: 这样真的不行呀，我想打开http://127.0.0.1:43110/NewGFWTalk.bit/ 网站，这次居然试了NNN多次都不行了，。  \n   连接中...\nTrackers announcing: 53, error: 15, done: 0\n找不到节点\nTracker connection error detected.\nUse Tor meek bridges for tracker connections\ncontent.json 下载失败\ncontent.json 下载失败\n\n我在想我们不是第一进入hello页面能靠hello页面内的激活按钮激活zerome么，zerome被激活到打开还是比较顺利的，能不能比较下为什么打开其它网站却那么难呀。\n\n简直让人抓狂，以后第三方的网站我觉得都单独分享content.json算了，",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1531572146",
			"date_added": 1531791149
		},
		{
			"comment_id": 60,
			"body": "@Zerobaby123: 这个站 http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/  你也许能打开。但是是页面内容是英文的，不过有中文页面的链接在下面，点进去就是了，ZeroWiki",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1531572146",
			"date_added": 1531791590
		},
		{
			"comment_id": 61,
			"body": "@开平方: 我试验了打开 zero wiki中文页面也打不开，这样下去zeronet在大陆估计是举步维艰了，我们也就在zerome内玩玩，不过我也只喜欢zerome,呵呵",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1531791579",
			"date_added": 1531791819
		},
		{
			"comment_id": 62,
			"body": "@开平方: 好吧我修改下，举步维艰。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1531791579",
			"date_added": 1531791945
		},
		{
			"comment_id": 65,
			"body": "@Vpei: 跟我模糊的判断差不多，目前用不到这样的功能。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1530437456",
			"date_added": 1531804408
		},
		{
			"comment_id": 69,
			"body": "@Sogu: 是挺可怕的，新疆那边已经严打了，可惜新疆以外好像没有免疫力，JC居然把垃圾袋视为正常衣服，刚从微博上看来的。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1532748378",
			"date_added": 1532879293
		},
		{
			"comment_id": 70,
			"body": "@version@zeroid.bit: 我看呀，还是避免不了学丝路那样走I2P网络跳转好。  @P2P 作者有没有考虑过结合I2P(i2pd)网络抵抗呀。\n\n第一页的电影我看到 柳如是了， 我觉得这部电影真的不错，大家可以一看，",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1532882939",
			"date_added": 1532915111
		},
		{
			"comment_id": 71,
			"body": "@A7oiz: 等这批会JAVA的大牛消失后，才能看到JAVA死去。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1532915341",
			"date_added": 1532916170
		},
		{
			"comment_id": 72,
			"body": "@猫叉酱（小号）: 牛了，有手机用的FM发射模块，再加上软件支持组网，看来FM远距离网状网组网是可行的。一公里范围是已经远远超过WIFI组网距离了，已经不错了",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1532917169",
			"date_added": 1533275586
		},
		{
			"comment_id": 73,
			"body": "若说男权极权，应该第一个就是伊斯兰邪教吧，如果你不反对伊斯兰邪教，那我看你是假女权，我会鄙视你。  假女权碰到伊斯兰邪教都阳痿性冷淡不会说话的，碰到现代男人现代女人的文明制度，那是一个劲的上窜下跳要女权。  欺软怕硬的背后估计是也收了不少邪教的金钱。我是很鄙视这样的白左行为的。当然如果你不是那样，请不要对号入座。",
			"post_uri": "1HuxEpnWQBMk2HkD7DobuwQnqHjqHy4psJ_1533219983",
			"date_added": 1533276107
		},
		{
			"comment_id": 75,
			"body": "@Vpei: 麻烦的要死，不如直接I2P，",
			"post_uri": "18aVoqjXuLUuftUDoyhsawC3TLdWGW6tqh_1533177101",
			"date_added": 1533277174
		},
		{
			"comment_id": 76,
			"body": "@atheist@zeroid.bit: IPFS是不是固定端口的？如果是，那么还不如直接I2P，要是能力有的话，2个都搞，这样更好。",
			"post_uri": "18aVoqjXuLUuftUDoyhsawC3TLdWGW6tqh_1533177101",
			"date_added": 1533278865
		},
		{
			"comment_id": 77,
			"body": "罚酒三杯",
			"post_uri": "1HuxEpnWQBMk2HkD7DobuwQnqHjqHy4psJ_1533272874",
			"date_added": 1533279112
		},
		{
			"comment_id": 78,
			"body": "@atheist@zeroid.bit: 这是个局域的，所以你得找个旁边的设备联。以后，作者不是说可以I2P TOR吗，估计以后是这样操作的，A面对面B加好友，B面对面C加好友，A拉B，B拉C进同一个论坛。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1533281284",
			"date_added": 1533281435
		},
		{
			"comment_id": 79,
			"body": "@atheist@zeroid.bit: 你有没有2个手机，2个手机都安装Briar后，都打开蓝牙，都打开加好友界面都互相扫描二维码，就可以互相加了，然后互相发消息。 比TOX多了群，论坛，博客，但估计安全性比不得TOX，比FIREXXX要方便些，比BLEEP可能更好。\nTOX要是手机端有群聊，那是多好，可惜没有。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1533281284",
			"date_added": 1533281524
		},
		{
			"comment_id": 80,
			"body": "@atheist@zeroid.bit: 我看了人家的评论，这厂房可以被炒的，已经有很多了，你的贫穷限制了你的想象，我之前也认为不可能。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1533276860",
			"date_added": 1533281639
		},
		{
			"comment_id": 81,
			"body": "@Jader: https://briarproject.org/index.html",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1533281284",
			"date_added": 1533283330
		},
		{
			"comment_id": 82,
			"body": "@atheist@zeroid.bit: 我不知道那个firechat.apk有没有开源？",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1533281284",
			"date_added": 1533285018
		},
		{
			"comment_id": 83,
			"body": "@atheist@zeroid.bit: 未雨绸缪呀，否则这里被封了，怎么找到现在的人再次聊天呀， 看看我的 Trackers: 0/74 是鸭蛋 ",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1533283461",
			"date_added": 1533285109
		},
		{
			"comment_id": 84,
			"body": "@Shanzhichuanxing: 就是个迷惑",
			"post_uri": "1NyaYW8fHcWxxxDmeeQoYW8hawPRdJd2wd_1533282681",
			"date_added": 1533285227
		},
		{
			"comment_id": 85,
			"body": "@version@zeroid.bit: 你那个也是临时的，我们应该需要一个随机变化的，如果能走I2P这样的匿名网络获取桥接通道到zeronet，那是最好的。 不过话说回来，我也只是在zerome里逛呀逛",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1533283461",
			"date_added": 1533285670
		},
		{
			"comment_id": 86,
			"body": "@version@zeroid.bit: 哦，原来是变化的，我不知道。那随机的就可以，这个鼓励写入hello页面里，让更多人知道。 我已经保存。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1533283461",
			"date_added": 1533285775
		},
		{
			"comment_id": 87,
			"body": "@version@zeroid.bit: 瞎说，我还在毫不，哈哈",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1533285528",
			"date_added": 1533285966
		},
		{
			"comment_id": 88,
			"body": "@version@zeroid.bit: 那看样子Briar要是开源是更好了，否则开发者出事了或出卖了，软件可不保险。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1533281284",
			"date_added": 1533286127
		},
		{
			"comment_id": 89,
			"body": "@无: 不系，我不知道这个东东哦。这个比他们有什么强大之处吗？\n\n\n看到解释说LoRaWAN是星状拓扑而非网状网拓扑，\n：\"在最基本的层面上，像LoRaWAN这样的无线协议相当简单。LoRaWAN是一种星型或星型对星型拓扑结构，因为在保持电池电量并增加通信范围方面的优势，所以普遍认为它比网状网络更好。 \"\n\n虽然电量消耗可能少点，但结构不利于去中心化。\n\nLoRaWAN更适合工厂使用，社区大城市使用我还是偏向网状网这样的去中心化网络，只是目前没有很好支持远距离通讯的硬件设备。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1532917169",
			"date_added": 1533288944
		},
		{
			"comment_id": 90,
			"body": "下一步杀掉苹果，最后再杀掉软蛋微软。他们说不惜一切代价，我本来觉得我是中国，谁知道我是那个代价。",
			"post_uri": "1HuxEpnWQBMk2HkD7DobuwQnqHjqHy4psJ_1533292394",
			"date_added": 1533300811
		},
		{
			"comment_id": 91,
			"body": "地球估计处于暴怒状态了，为了消灭地球人的胡作非为，把地磁都改变了，全身运动，热血沸腾。再下去，估计要把大气层这个大衣都要脱下了。",
			"post_uri": "1NTjcYFtpDEgQJpPevhmpbc4i9ocHiZ4mx_1533296917",
			"date_added": 1533301026
		},
		{
			"comment_id": 92,
			"body": "@猫叉酱: 所以呀，要简单的设备才行，动手多的，我也能努力努力搞出来，但是一个人搞有什么意思，这些都要门槛低，大家一起才能社会进步哦。所以最好是内建在手机里的WIMAX，那么只要一个APP打开组网就完成了，人人都可以，这样就不怕没节点了。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1533343688",
			"date_added": 1533382083
		},
		{
			"comment_id": 93,
			"body": "外资是聪明的，李嘉诚第一个就跑了。。",
			"post_uri": "1HuxEpnWQBMk2HkD7DobuwQnqHjqHy4psJ_1533381722",
			"date_added": 1533382531
		},
		{
			"comment_id": 94,
			"body": "@无: NO NO NO ，区块链是软件系统，网状网是硬件系统，有了网状网硬件的区块链是如虎添翼。 \n未来是网状网加目前的星状网，这样才能固若金汤，区块链然后再升级为更好的区块链，就完美了。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1533343688",
			"date_added": 1533382898
		},
		{
			"comment_id": 95,
			"body": "什么意思？美女？",
			"post_uri": "1JtrDD4XeV1npLv97aDypJMfpa6whrQZPQ_1533381531",
			"date_added": 1533383156
		},
		{
			"comment_id": 96,
			"body": "@AI大师: 是设备不行，而不是 meshnet的问题，人家海能达iMesh自组网 能大范围视频网络监控微信上网，稳定可靠。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1533343688",
			"date_added": 1533383352
		},
		{
			"comment_id": 97,
			"body": "@AI大师: \n@无: 网状网软件不是问题，问题是在硬件上，蓝牙那个距离太近了，没什么意义，组网必须至少一个设备能覆盖一个小区，这样小区内只要存在若干设备就能不间断节点。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1533343688",
			"date_added": 1533399180
		},
		{
			"comment_id": 98,
			"body": "@大家一起p2p: 慈禧太后，坚船力炮，下一步就是战争了。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1533399028",
			"date_added": 1533445870
		},
		{
			"comment_id": 99,
			"body": "@猫叉酱: 就是，好点的频段不让用，市场处于封闭状态，怎么拉动国民经济。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1533343688",
			"date_added": 1533446058
		},
		{
			"comment_id": 100,
			"body": "你的N倒了。",
			"post_uri": "1MBaap4J4DvH7DaSZEgNY5m6Lhe5EUYw6N_1533443230",
			"date_added": 1533446143
		},
		{
			"comment_id": 101,
			"body": "不会，爱莫能助",
			"post_uri": "17EAtWww26A1GwJsp3tqQvoXS2PG5nmmmo_1533439978",
			"date_added": 1533446203
		},
		{
			"comment_id": 102,
			"body": "台湾有烧氢气的小毛驴，视频上看来的， 不过我觉得直接用电更直接，化燃料最后都变成电，万物基于电。",
			"post_uri": "1HuxEpnWQBMk2HkD7DobuwQnqHjqHy4psJ_1533603164",
			"date_added": 1533851781
		},
		{
			"comment_id": 103,
			"body": "10G 裸 贷 信 息 泄 露，你们谁有？",
			"post_uri": "1KLQ5p24RZxxuSXJqG6FSGzMYy4rXSa8Bi_1533621051",
			"date_added": 1533852123
		},
		{
			"comment_id": 104,
			"body": "你这是想说啥，也洗脱不了伊斯兰邪教的邪教属性。",
			"post_uri": "1Mqn1Xp52QURho5ASWVXTFmwza5eEyTLr7_1533728688",
			"date_added": 1533852866
		},
		{
			"comment_id": 105,
			"body": "美国奥巴马还资助911恐怖组织ISIS类呢，是不是也要让俄罗斯搜查一下美国国内是不是有恐怖组织呢。 \n特朗普根本不需要这些来洗通俄门，因为这个门本来就是捏造的泼粪，你只要搞好美国经济就是在打脸那么白左了。",
			"post_uri": "1HuxEpnWQBMk2HkD7DobuwQnqHjqHy4psJ_1533774212",
			"date_added": 1533853270
		},
		{
			"comment_id": 106,
			"body": "代价。你在说什么？ ",
			"post_uri": "1C1EuEPhpe2B2g3Cp7aaUR8SKL8ximZ5pR_1533795491",
			"date_added": 1533853398
		},
		{
			"comment_id": 107,
			"body": "云是不安全的，我一般不会用， 还有区块链不是很适合大文件存储，很适合微博推特类信息传播。",
			"post_uri": "1Mjcr1S5aTfmo2VAgspfP7gMcsWfxoFfj2_1533906182",
			"date_added": 1533944610
		},
		{
			"comment_id": 108,
			"body": "一个瓦哈比极端国家，和一个极端白左国家， 2个都应该被毁灭。",
			"post_uri": "1HuxEpnWQBMk2HkD7DobuwQnqHjqHy4psJ_1533904334",
			"date_added": 1533944697
		},
		{
			"comment_id": 109,
			"body": "@Vpei: 这个是磁力？",
			"post_uri": "1KLQ5p24RZxxuSXJqG6FSGzMYy4rXSa8Bi_1533621051",
			"date_added": 1533946953
		},
		{
			"comment_id": 110,
			"body": "@ふぶきひじり(風吹圣): 此国是只哈士奇，曾经屠杀了无数的基督徒。目前又崇尚伊斯兰邪教治国，还侵略占领叙利亚，野心膨胀。对待中国更是在支持培养东突厥份子输入瓦哈比上不遗余力。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1533946136",
			"date_added": 1533995822
		},
		{
			"comment_id": 111,
			"body": "@ふぶきひじり(風吹圣): 我不同意你的观点，现代也避免不了真枪实弹的战争，只是互相扔中子弹估计是克制的，但战术核弹肯定无顾忌的。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1533946550",
			"date_added": 1533996110
		},
		{
			"comment_id": 112,
			"body": "@기다훈(箕多勋): 国与国还是可以磋商的，中国和美国都算文明国家吧，走向战争的可能是存在的。但是国与邪教恐怖分子的长期战斗才是未来需要担心的。",
			"post_uri": "1AYSeiGdczmza5AA1KoBtkYTpS9NmSZGdo_1533946550",
			"date_added": 1534024262
		},
		{
			"comment_id": 113,
			"body": "最近看到日文名，今天看到韩文名，是为什么呢？",
			"post_uri": "1C4a4mucSKyA8M9W2XbUKsLaHF1oxWidSB_1",
			"date_added": 1534024334
		},
		{
			"comment_id": 114,
			"body": "其实怎么说呢，能带动周边合法的就业，带动周边合法的产业，我说这是好事，政府只要管理好经商环境收税就可以了，其他违规的一旦出现，严惩。",
			"post_uri": "1KLQ5p24RZxxuSXJqG6FSGzMYy4rXSa8Bi_1531550379",
			"date_added": 1534066552
		},
		{
			"comment_id": 115,
			"body": "@无: 总结得很精辟呀",
			"post_uri": "1HuxEpnWQBMk2HkD7DobuwQnqHjqHy4psJ_1534152445",
			"date_added": 1534169953
		},
		{
			"comment_id": 116,
			"body": "能不能不搞你那狭隘的个人恩怨了，没人关心你们黑吃黑，有本事的话做些能让全民都受益的事来。",
			"post_uri": "1LEo1CFhTV7q8LWGu7KKNEsC5CagQc636H_1534120286",
			"date_added": 1534170095
		},
		{
			"comment_id": 117,
			"body": "欢迎来这里，这里没有管理员，你GitHub 做了什么？",
			"post_uri": "17FtbK8av71TuGy3A7iBdt4QvbgDgLd6AQ_1534169435",
			"date_added": 1534170387
		},
		{
			"comment_id": 118,
			"body": "yep,good",
			"post_uri": "15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe_1534220903",
			"date_added": 1534254723
		},
		{
			"comment_id": 119,
			"body": "@无: 谈判要有资本，他爸爸肯定教过他，他还留过学，是不会傻。",
			"post_uri": "1HuxEpnWQBMk2HkD7DobuwQnqHjqHy4psJ_1534152445",
			"date_added": 1534255270
		},
		{
			"comment_id": 120,
			"body": "印度开始撤离伊朗了，至少要砍掉一半石油。 真希望伊朗能扔掉伊斯兰邪教，世俗让人进步。",
			"post_uri": "1HuxEpnWQBMk2HkD7DobuwQnqHjqHy4psJ_1534256560",
			"date_added": 1534299317
		},
		{
			"comment_id": 121,
			"body": "@Zerolose: 居然不知道谷歌出走的原因，呵呵，那个时候我都是用的谷歌。",
			"post_uri": "1FZ9iY7CzoVM7VsGFdxUxwqb6z5UY4ge4d_1534262966",
			"date_added": 1534397629
		},
		{
			"comment_id": 122,
			"body": "@Cnxdd: 你们还以为他是什么好东西吗，一群傻傻的人",
			"post_uri": "14139fxEEc7VuHVxvK2UqYSeX3rJqiADVY_1534321884",
			"date_added": 1534397803
		},
		{
			"comment_id": 123,
			"body": "广电应该去管食品药品。",
			"post_uri": "1KLQ5p24RZxxuSXJqG6FSGzMYy4rXSa8Bi_1534342109",
			"date_added": 1534398030
		},
		{
			"comment_id": 124,
			"body": "慢慢破产好，否则那么多垃圾，都不破产，到时候就问题更大。",
			"post_uri": "1HuxEpnWQBMk2HkD7DobuwQnqHjqHy4psJ_1534339054",
			"date_added": 1534398130
		},
		{
			"comment_id": 125,
			"body": "所以我一直看到股市要上涨了，要上涨了要上涨了，然而却是下跌下跌，，，，哈哈",
			"post_uri": "1HuxEpnWQBMk2HkD7DobuwQnqHjqHy4psJ_1534335355",
			"date_added": 1534398194
		},
		{
			"comment_id": 126,
			"body": "节点都是玩出来的，当然就快了。",
			"post_uri": "1NpEfN9nbyvag4MPG9j6TgcBC8aVFEZjGG_1534328868",
			"date_added": 1534398249
		},
		{
			"comment_id": 127,
			"body": "秋老虎在后面",
			"post_uri": "1Wp8ikoekddbaQL8zXM7aFT5mU89QvdM8_1534399106",
			"date_added": 1534399228
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "13fTDDXLgP1RdGd9dF8kfXy33gJh3uwVVK",
			"user_name": "Eaglex",
			"date_added": 1530448826
		}
	]
}