{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1566260391,
			"title": "How does zeronet work? Really",
			"body": "I am just curious about the architecture. The topology. The encryption used between peers. I have read the source codes, well just the imports. There are some outdated libraries still being imported. Im not sure if it is still used. \n\nWhere can I find the answers to these?",
			"added": 1566260390
		}
	],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1565877012_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 1,
				"body": "Is there anything in Zeronet from stopping people to abuse the right of anonymity as people in TOR do? Eg, drug trade, gore worship, child-porn etc?",
				"added": 1565879494
			},
			{
				"comment_id": 2,
				"body": "> [aspidochelone](#comment_73_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): @shiok:  ZeroNet is like internet in general.  People can put up the same content on either, and use Tor or many other tools (VPNs) to protect themselves.  The point of the network is to organize the computers without a company in charge of them, so content that is entirely legal to share in countries like the U.S., like \"gore-worship\" and racism, can be exchanged even if Zuckerman doesn't like it.  There are people who do that off ZeroNet (Bestgore, Encyclopedia Dramatica) but they need to do heroic amounts of shopping to find a company to deal with.  It is NOT a crime -- at least, as a matter of law -- to do what the Company doesn't like.\n\nI agree with you on the point that Zeronet is like the rest of the internet out there. In fact, I'll go one step further to state that all other networks out there is same like the rest of the internet. Everyone can post whatever they want anywhere. The difference is, the rule of the network, and the enforcement of such. \n\nI have always have this belief: Either block all, or block none. A gun is all killing, a shield is all blocking, there is no 2 ways about that.",
				"added": 1565881388
			}
		],
		"1565868212_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 3,
				"body": "Everybody has the right to abort. Every parent has the right to not let his/her child suffer because of foretold illness. No parent in this world would ever want to send his/her child off before they do. And no parent would want to worry for their child's survival after they pass away. Not to say parents willing to risk it are not doing the RIGHT thing. Because this is the point, there is no RIGHT thing, it is only a choice. \n\nIt is the natural right of a parent to choose the best for their children. \n\nFor you to ponder, do you think that parents who went through abortion are happy about it either?",
				"added": 1565883653
			}
		],
		"1565914656_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 4,
				"body": "there is already a 8chan with that purpose. How about people that wants views from both sides? What can you gain by isolating with a group of link minded thinkers like yourself except attaining even more narrow-mindedness",
				"added": 1565921571
			}
		],
		"1565942944_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 5,
				"body": "> [genx](#comment_10_1Bov9ZwmSSatH1PkwS2fQ9LGvEJPrvimad): Why does neutrality help the oppressor but never the victim, as quoted on the website?\nbecause neutrality is basically weightless, strength-less and powerless. It is like the pivot of a see saw when it is balanced. It takes 2 equal effort and power to maintain that. However, it is often not the case in real life.",
				"added": 1565947656
			}
		],
		"1566038009_1HnEYBLwyqrym7tJhQgrdyRGQ2W1dkJMsD": [
			{
				"comment_id": 6,
				"body": "FBI is far from sucessful in shutting down ALL dark markets. Not even close.\n\nThere is a silkroad mirror in I2P. I am sure its in the directory.\n\nFor Onion sites, there are many other dark markets. It is not even secret. Just google. Or use Not evil /Torch to find \n\nDark markets offers more than drugs and guns btw",
				"added": 1566043459
			}
		],
		"1566044615_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 7,
				"body": "why would anyone care about brainfuck?",
				"added": 1566047444
			}
		],
		"1565527640_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o": [
			{
				"comment_id": 8,
				"body": "the markets  that are dependent on the DOW and NASDAQ are in correction right now. I wouldn't touch it for another until first quarter of 2020",
				"added": 1566266863
			}
		]
	},
	"comment_vote": {}
}