{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "troleo puntos inseguros",
			"body": "http://madrid.planfreetobe.org/\n\nEstán todas creando una lista de puntos inseguros a donde no deben ir jamás las mujeres.\n\nObjetivo: llenar madrid de puntos inseguros/troll.\n\nEjemplo: No ha pasado nada fuera de lo normal pero el pasillo que hay de la línea cinco es muy largo y además casi no tiene iluminación, por lo que me hace sentirme incómoda al estar pasando esa zona.\n\nPor un foro sin hilos echeniques.\nEdit: han borrado muchísimos puntos inseguros, seguimos en la censura.",
			"added": 1525725320
		},
		{
			"topic_id": 2,
			"title": "--->Un CSI que sería el orgullo de FC y de España entera +tocho",
			"body": "---Gracias a  @BOT--- [Hilo en forocoches](https://www.forocoches.com/foro/showthread.php?t=6426279) <-- ya lo ha borrado otra vez ilitri\n.\n---Ayudadnos a encontrar a este etarra.\n.\n---Se pierde el tiempo para sacar datos y localizar a mindundis y llevarse hostias de la prensa.\nPero una acción CSI que dejase al gobierno español y a los periodistas a la altura de la escoria que son, a la vez que encumbraría FC ante toda España sería sin duda localizar y dar datos de este HDLGP:\n.\n---**JOSU TERNERA**\n(**José Antonio Urruticoechea Bengoechea**, asesino, jefe de ETA, huído de la justicia y aparentemente protegido por el gobierno y la \"prensa\")\n.\n---**Lo que pretendemos con el hilo es que sepa la opinión pública donde está. FORZAR AL GOBIERNO A DETENERLO o al menos DEJARLOS EN EVIDENCIA POR NO HACERLO. Ya sería mucho pedir que tuviesen que dar explicaciones de por qué no lo detienen, pero en fin...**\n.\n---[El cuento de Josu Ternera: el único jefe de ETA al que la policía no captura nunca\nEl jefe de la banda terrorista lleva quince años huido. En ese tiempo, una decena de líderes etarras han sido detenidos.](https://www.elespanol.com/espana/20180504/cuento-josu-ternera-eta-policia-no-captura/304720603_0.html)\n.\n[A pesar de estar en busca y captura desde hace años](https://www.elespanol.com/espana/20180504/cuento-josu-ternera-eta-policia-no-captura/304720603_0.html)\n.\n---No es un CSI al uso (mirar en rrss es inútil en principio, claro*) pero se puede/debe fomentar la colaboración ciudadana. \nAcciones que puedas llevar a cabo desde el sofá o el móvil hay muchas: Mandar la foto a algún amigo que viva en Alemania (se dice que vive allí), colgarlo en tus rrss para que le vean la cara los jóvenes que no saben ni que es ETA... tal vez alguien lo reconozca. No es la primera vez que ocurre.\n.\n---¿Seríamos capaces? \n.\n¿O nos frenarían por miedo a represalias?\n.\n_A raíz de las ultimas infos acerca del trabajo de su mujer y amigos (teatro de marionetas y payasos) no parece tan descabellado buscar en rrss fotos donde se les etiquete a ver si se le ve por ahí escondido, en un reflejo de una gafa al ampliar la imagen o cualquier otra pista._\n.\n---ULTIMAS IMÁGENES CONOCIDAS DE EL\nhttps://www.eldiario.es/fotos/Jose-Antonio-Urrutikoetxea-Josu-Ternera_EDIIMA20171203_0312_19.jpg\n.\n---Edit1---\n[Según publica el mundo, su actual pareja es una titiritera (sic) llamada Agnes Cerlo](http://www.elmundo.es/cronica/2018/05/06/5aee98f146163f19028b45e1.html)\n.\n---Edit2---\n[Vivían en Durban sur Aziere en el Pirinéo francés y no se le levanta.](https://www.vozpopuli.com/buscon/Josu_Ternera-Viagra-ETA_0_611038915.html)\n.\n---Edit3---\n[Según publica La Razón, grabó el comunicado desde Alemania, y fue enviado a través de la fundación Henri Dunant con la que mantiene contacto.](https://www.larazon.es/espana/ternera-grabo-el-comunicado-de-disolucion-de-eta-desde-alemania-FD18283420)\n.\n---Edit4---\n[Aquí una herramienta que me pasa un shur para localizaciones (tal vez su pareja o familiares SÍ usen rrss)+prv](https://www.forocoches.com/foro/misc.php?do=page&template=InfoPRV&tid=5127035)\n.\n---Edit5---\nIncluyo info aportada por @Rhodas\n\n---**JOSU TERNERA**\n**José Antonio Urruticoechea Bengoechea** (Miravalles, Vizcaya, 24 de diciembre de 1950), también conocido como Josu Ternera y como Josu Urrutikoetxea Bengoetxea.\nhttp://www.periodistadigital.com/imagenes/2014/03/01/josu-ternera_560x280.jpg\n.\n---Historico miembro de ETA, fue **detenido en Bayona en enero de 1989** junto a la que era su (segunda) mujer, Elena Beloki (candidata de Bildu), cuando era **numero 1 de ETA** y condenado a 10 años de prisión en Francia, que cumplió en los centros penitenciarios de Fresnes y Muret. **Extraditado a España en 1996** donde cumplió condena hasta el 14 enero del 2000. Aunque la Fiscalía intentó que volviera a prisión desde el mismo momento en que puso un pie en la calle, el Tribunal Supremo desestimó sus recursos al considerar que ya había sido juzgado y condenado en Francia por los delitos que le atribuía el Ministerio Público. \nDesde 1998 era diputado en el Parlamento Vasco por EH.\n.\n---**Lleva huido desde finales de 2002**, cuando los jueces le llamaron a declarar por su presunta implicación como inductor en el atentado contra la casa cuartel de la Guardia Civil en Zaragoza, perpetrado en diciembre de 1987 y que costó la vida a 11 personas, entre ellos seis niños. \n.\n---Desde el día **21 de enero de 2005**, inicia una serie de reuniones de negociación de paz con el gobierno de Rodriguez Zapatero en el Hotel Wilson de Ginebra (Suiza) con el presidente del Partido Socialista de Euskadi (PSE), Jesús Eguiguren.\n.\n---A partir del **21 de junio de 2005**, Eguiguren y Ternera se reunieron de forma alterna (un día sí y otro no) en compañía de representantes del Centro de Diálogo Henri Dunnat en Suiza, muy cerca de Grenoble. Los encuentros se trasladaron a Oslo (Noruega), de forma alterna también entre los días 3 y 12 de noviembre de ese mismo año. Hubo una última reunión entre Eguiguren y Ternera el 31 de diciembre de 2005 en Ginebra. \n.\n---En **2011** la Policía supo que se encontraba en la **localidad francesa de Saint Gervais** visitando su hijo Egoitz, pero una llamada [en español](https://www.elconfidencialdigital.com/Josu-Ternera-hijo_ECDIMA20151008_0003_20.jpg) hecha desde Nairobi, Kenia (donde ETA tenía una infraestructura importante), le puso sobre aviso y logró huir. Los rumores dicen que la llamada fue hecha por el gobierno de España.\n\n(Josu Ternera junto a su hijo Egoitz)\n.\n---Desde** 2011 a 2013 se le ubica en Oslo** (Noruega) esperando negociar con el gobierno, pero es expulsado del país.\n.\n---El **16 de Julio de 2013 de nuevo huye** justo cuando iba a ser detenido en **un pueblo frances llamado Durban-sur-Arize** (150 habitantes). Después se supo de desde 2007 vivió en clandestinidad en dicha localidad como profesor de historia. En esa operación [fue detenida](http://cadenaser.com/ser/2013/07/16/espana/1373932240_850215.html) y puesta en libertad su tercera mujer **Agnes Cerlo**, con la que había tenido una hija recientemente. En la casa se encontró entre otra cosas [una caja de Viagra.](https://www.vozpopuli.com/buscon/Josu_Ternera-Viagra-ETA_0_611038915.html) \n.\n---Meses después de esa huida, se le ubicó en [Grenoble (Francia),](http://www.elmundo.es/cronica/2013/12/01/5299f50b61fd3d2b708b456b.html) no muy lejos de algunas de las localidades antedichas.\n.\n---En **2015 es detenido su hijo Egoitz** (Bayona, 1975) en Paris (Francia) donde estudiaba en la universidad Diderot. Era su hijo de su primera mujer Karmen Laskibar.\nhttp://e03-elmundo.uecdn.es/assets/multimedia/imagenes/2013/11/30/13858221554816_464x0.jpg\n\n---En **octubre de 2016** una decena de agentes de la Policía Judicial se personó en el domicilio en Anglet de la pareja de Ternera, fotografió el interior y los accesos, realizó copias del ordenador y consultó su teléfono móvil.\n--En **2017** su pareja Agnes Cerlo denuncia haber encontrado un [geolocalizador](http://www.elcorreo.com/bizkaia/politica/201706/30/pareja-josu-ternera-denuncia-20170629224850.html) en su coche.\n\n---En 2018 participa en la grabación del vídeo donde se anuncia la disolución de ETA, grabado en la sede de la **Fundación Henry Dunant** en Ginebra.\n.\n---Edit6---\nSi tenéis cuenta en 4chan, twitter, facebook, etc. Colgad sus fotos, pedid colaboración ciudadana. Si esto se mueve a nivel europeo se le puede localizar.\n.\n---Edit7---\nYa se han colgado algunos anuncios en 4chan con un nivel de inglés por encima del nivel medio de español que tienen los ingleses.\n.\n---Edit8---\nSu hijo fue visto hace unos dias en Saint-Étienne-de-Baïgorry (País Vasco francés)\n.\n---Edit9---\n[Link facilitado por](https://www.intelpage.info/forum/viewtopic.php?f=124&t=4905&sid=e1710ee02056cb193ec11793faec83b0) @Oysterrrr de un foro de espionaje y servicios secretos (poco secretos, parece ser) que aporta datos sobre etarras varios. Aquí el hilo sobre Josu Ternera\n.\n---Edit10---\n[Algunos datos sobre su actual pareja encontrados por @Oysterrrr](http://rsocial.elmundo.orbyt.es/epaper/xml_epaper/Cr%C3%B3nica/11_08_2013/pla_11181_CRONICA/xml_arts/art_17045132.xml?SHARE=6C23C0F29C6C4F158F7CA6264B486305A28170095F81F86DC6139FAEDB2FFB6E7F2004711BA2C76BB08DD0591166862B690519B36A04F10E10C8BB4EB8AAF4A774A463599408D5A6D8597A305478849A0F975660320B3FC47B7010021A023C8D)\n.\n---Y a raíz de esta información, no me ha costado localizar la web de la mujer titiritera, \nhttp://www.aufildutheatre.com\n.\n---En dicha web están su [foto](http://www.aufildutheatre.com/wp-content/uploads/2010/03/quisuis-je-reduit-50-copie.jpg) ,teléfono y otros datos públicos\nhttp://www.aufildutheatre.com/wp-content/uploads/2010/01/logo-AFT-pase%CC%81o-copie-copie.jpg\n.\n---Y de ahí sale un whois por parte de @Mk3_ouhyeah\nhttps://i.imgur.com/HKasADu.png\n.\n---Edit11---\nAquí tenemos otro CSI de @Mk3_ouhyeah con la dirección donde está registrada la web de su mujer en google maps\nhttps://i.imgur.com/x6rEhnY.jpg\n.\n---En la imagen se observan DOS furgonetas, una azul en la puerta, con una pegatina de bebé a bordo, (recordemos que se supone que el hijo de la titiritera con Ternera debe tener unos 4 años) y otra blanca en el interior, que en las siguientes fotos no aparece. ¿De quién será esa furgoneta blanca que va de visita?\nhttps://i.imgur.com/eRHoMB7.png\nhttps://i.imgur.com/XNgrU8l.png\n.\n---Edit12---\nNos cuenta @Alejandrift\n\"La pegatina de la foto que se asemeja a las típicas de \"niños a bordo\" en este caso tiene una peculiaridad.\nEn la pegatina se lee la frase \"kontuz pailazoak\", que traducido seria \"cuidado payasos\". Esos payasos a los que hace referencia son los payasos pirritx, porrotx y marimotots. La peculiaridad es que las dos mujeres y el hombre que hacen los shows interpretando a estos payasos (son algo así como unos \"payasos de la tele\" que hacen funciones callejeras en tono de humor para niños pequeños) son conocidos simpatizantes de la izquierda abertzale.\"\n@Amar0k nos aporta esta imagen, como curiosidad\nhttps://www.katxiporreta.eus/wp-content/uploads//cm//f/i/file_28.jpg\n.\n---Edit13---\nAquí muchos datos sobre el etarra de parte de @Sucro\nhttps://rachetonafdy.firebaseapp.com/849734488X.pdf\nEl mismo shur nos ofrece este link con la mujer y sus \"colegas\" presentándose:\nhttps://harpie64.wordpress.com/les-membres-de-la-compagnie/\n.\n---Edit14---\nSobre los payasos, aportado por @samterry\nNo sólo simpatizantes (abertzales). Aiora Zulaika (Pirritx) fue concejala de Euskal Herritarrok en Lasarte-Oria desde 1999 a 2003, precisamente sustituyendo en el cargo a José María Agirretxe (Porrotx).\n.\n---Fue muy sonado cuando en 2001 el concejal socialistá Froilán Elespe fue asesinado a tiros en un bar de la localidad, y tanto ella como el resto de concejales abertzales se negaron a condenar el asesinato. (Fuente: El Mundo)\nhttp://www.elmundo.es/cronica/2001/CR284/CR284-01.html\n.\n---Aquí un video de los susodichos aportado por @TheBadGuy a favor del acercamiento de presos de ETA. Un tema muy adecuado para fiestas infantiles, claro.\nhttps://www.youtube.com/watch?v=jca_0jwQQ_8\n.\n---Edit15---\n¡Hemos vuelto! Ilitri sabe que solo los shurs de buena fe podemos salvar el honor de FC ante la prensa y este hilo es un ejemplo.\nTras muchos hilos de protesta cerrados y hasta algún gif gracioso, se ha logrado. (Mención especial para @Mospol que se ha jugado la cuenta varias veces con sus hilos de apoyo a la causa)\nAprovecho para decir en público a todos los que me felicitaban por el hilo via MP, lo mismo que les decía por privado:\nYo sólo he creado el hilo, el mérito de todo es de vosotros por colaborar.\n¡Enhorabuena shurs!\n.\n---Edit16---\nLa voz de Josu Ternera en el comunicado de disolución de ETA hecho público hace unos dias (verificado que es él por la Fundación Henri Dunant a través de un video que no quieren hacer público)\nhttps://www.youtube.com/watch?v=iHdAqTrnrJ0\n.\n---Edit17---\nEl shur @Loyr nos facilita [esta web pública en la que aparece el teléfono móvil de la compañia de teatro/payasos abertzales](https://www.eke.eus/fr/acteurs-culturels/repertoire-artistes-acteurs-basques/au_fil_du_theatre)\nCon esto y lo del Edit4 ya tendría el CNI medio trabajo hecho. \n**¿De verdad quieren que nos creamos que es inlocalizable?** \n.\n---Edit18---\n¿Quién da cobertura a los etarras fugados?\n\"La estructura Ihesko, refugiados, dirigida desde el PaÍs Vasco francés, se encargaría de coordinar todas las acciones de los huidos etarras, contaría con un 'núcleo reducido' denominado 'Iheslarien Bilgune' que se encargaba de la \"gestión integral de los refugiados en el mundo\", a fin de proporcionarles \"sustento político, ayuda social, jurídica, médica, psicológica, búsqueda de casas y coordinación de éstas\". Esta estructura tenía disponible viviendas en Bélgica, Alemania y Reino Unido, adonde fue trasladando a sus militantes.\"\nSegún nos cuenta el incansable @Oysterrr\n.\n---Edit19---\n[\"El 14 de febrero de aquel año (2004), un informador de la policía extremeña identificó por casualidad a Ternera en el aeropuerto de Francfort.Y escuchó la conversación que mantenía con su interlocutor, «un hombre de entre 55 y 60 años» con escolta. «Se van a enterar los españoles de lo que somos capaces», transcribió el informador las palabras de Ternera. Días después, en Cañaveras, la Guardia Civil interceptaba una furgoneta con 505 kilos de cloratita y 30 de dinamita\"](http://www.elmundo.es/suplementos/cronica/2005/519/1127599205.html)\n.\n---Edit 20---\n[Aquí un hilo con recopilación de noticias sobre el tema](https://www.forocoches.com/foro/showthread.php?p=299183247#post299183247)\nDe nuevo gracias @Oysterrrr",
			"added": 1525773800
		},
		{
			"topic_id": 3,
			"title": "video de la manada \"y el anillo pa cuando\"",
			"body": "https://es.dailystormer.name/2018/06/26/exclusiva-se-filtra-un-nuevo-video-de-la-victima-de-la-manada/",
			"added": 1530098730
		}
	],
	"topic_vote": {},
	"next_comment_id": 17,
	"comment": {
		"1_1FwhwYBwon26Z5aWnpnQteWspmprCBuPTj": [
			{
				"comment_id": 1,
				"body": "propongo crear una recogida de firmas en change.org para eliminar toda la publi de fc(aunque ya están en ello las feminazis), o que lo cierren, ¿por qué no? ya tenemos zerocoches, así dejamos a ilitri sin un duro y que eche huevos de una vez, que no se cague ante la presión social.\npd: ilitri beta.",
				"added": 1525439532
			}
		],
		"2_17JkZDD6K36ZYQVT1uy2D1VN39HpJyYa34": [
			{
				"comment_id": 2,
				"body": "https://t.me/TrolleosZetta --- grupo de forocoches de troleos, normalmente entrevistas en youtube con E.T.\nNO politica.--------------------------- antiguamente eramos \"radiozetta\", ahora somos \"farolina media\"",
				"added": 1525640863
			}
		],
		"1_17JkZDD6K36ZYQVT1uy2D1VN39HpJyYa34": [
			{
				"comment_id": 3,
				"body": "en FC como en todo hay que hecharle cojones, ya que ilitri no los tiene los tenemos que poner nosotros por él.\ncualquier cosa publica que querais enseñarla me lo mandaís que los subiré.",
				"added": 1525727547
			},
			{
				"comment_id": 5,
				"body": "> [ilitrogilipollas](#comment_12_1PrGqYS76NH78qs54gS2c4ddjpk5VRK2bA): los subiras a FC?\n\nsi son cosas publicas(no hacker) si, en FC y FP",
				"added": 1525727943
			}
		],
		"1_16EJxMVkL1bSt42y3KwjCGFXMWRZ44mQr5": [
			{
				"comment_id": 4,
				"body": "le hablé a BOT aber si me los pasaba pero todavía nada, si me lo pasa lo envio",
				"added": 1525727761
			},
			{
				"comment_id": 8,
				"body": "lo e subido aqui tal cual esta",
				"added": 1525773833
			}
		],
		"1_1Ja3ocDF3abwsEKdxvMxsWwUU1aV7iSPYb": [
			{
				"comment_id": 6,
				"body": "hay dibujadas una polla y una esbástica al revés, el que las encuentre le doy una invi",
				"added": 1525732948
			},
			{
				"comment_id": 7,
				"body": "> [josu](#comment_17_1JWNCmquAPBEirtg5X5Nq61541iNDjTdqE): Ya las he encontrado. Pero la esvástica se la están cargando. Y a la polla le están dibujando la eyaculación xD Quiero mi invi.\n\nvaya.. las an borrado, asi que te quedas sin invi.",
				"added": 1525772340
			}
		],
		"2_1Ja3ocDF3abwsEKdxvMxsWwUU1aV7iSPYb": [
			{
				"comment_id": 9,
				"body": "> [vendopelcorsa](#comment_5_1AAtVzfGMaNhYDCRcK66ZccerTxy5UPqqT): http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/data/users/1KrPEvBXpyKfJeLR1JJ1bgDXVoz25Tsz17/src/5ca11e506eec04765f05d5d9c5a1a6fd6147fa07.pdf\n> A ver si funciona\n\nmuy buena esa, ojala se pudiera cambiar de fuente, colores y letra en los post, sería mejor visualmente para poder leerlo",
				"added": 1525794733
			}
		],
		"3_18neEHgfy4dyCSY4tJzUi3AwjHds4U6bw9": [
			{
				"comment_id": 10,
				"body": "y youtube, aunque solo tiene porno la verda...pero tal vez sea buen sitio para subir videos prohibidos",
				"added": 1525795278
			},
			{
				"comment_id": 11,
				"body": "> [arbol](#comment_13_18neEHgfy4dyCSY4tJzUi3AwjHds4U6bw9): Muy cierto, deberia estar en la categoria porno xD\n\nte e dejado un mensaje en el zeromail",
				"added": 1525813667
			}
		],
		"2_1JWNCmquAPBEirtg5X5Nq61541iNDjTdqE": [
			{
				"comment_id": 12,
				"body": "espero que se pueda hacer, el formato de forocoches es muy bueno, haber si alguien se anima",
				"added": 1525949675
			},
			{
				"comment_id": 14,
				"body": "aqui os dejo un clon bastante bueno http://forocarros.epizy.com/mybb/index.php",
				"added": 1526034955
			}
		],
		"2_1H7QuXaGs9Qg4HQX99wJUU3Dh2sV2fk9Sr": [
			{
				"comment_id": 13,
				"body": "> [net2](#comment_11_1H7QuXaGs9Qg4HQX99wJUU3Dh2sV2fk9Sr): A los que tengáis ganas de ayudar avisadme y os hago admins.\n\nlo 1ero yo quiero admin :) \nlo 2ndo bastante bueno el clon, siempre se puede mejorar\nlo 3ero y mas importante, tendriamos que \"fusionar\" zerocoches con forocarros, es decir, usar de diario forocarros y si hay algun tema, fotos o videos que tal vez nos puedan meter en lios, pues pasamos el link de zerocoches y solucionado.",
				"added": 1525992627
			}
		],
		"3_1BxoC1C7mdBnZgCRtshd7pxQDfiJysFLBC": [
			{
				"comment_id": 15,
				"body": "y tambien a salido un video",
				"added": 1530098505
			}
		],
		"2_1AAtVzfGMaNhYDCRcK66ZccerTxy5UPqqT": [
			{
				"comment_id": 16,
				"body": "https://es.dailystormer.name/2018/06/26/exclusiva-se-filtra-un-nuevo-video-de-la-victima-de-la-manada/",
				"added": 1530100720
			}
		]
	},
	"comment_vote": {}
}