{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1589801857,
			"title": "Эффект Матфея. Или эффект неравномерного распределения преимуществ",
			"body": "#метрикадня (хотя по факту она получается метрикой месяца, так как у меня вдохновение скачет)\nЭффект Матфея. Или эффект неравномерного распределения преимуществ (https://ru.wikipedia.org/wiki/%D0%AD%D1%84%D1%84%D0%B5%D0%BA%D1%82_%D0%9C%D0%B0%D1%82%D1%84%D0%B5%D1%8F), когда тот, у кого они есть, получает за счет этого еще большие преимущества.\n\nЧастным проявлением являются такие ситуации как:\n\n1. Ты блогер, у тебя 1 млн подписчиков. За счет этого у тебя 2 млн станет кратно быстрее, чем у того, у кого 10 подписчиков, так как у тебя уже есть миллион. А тот, у кого их десять, будет шуршать где-то внизу.\n\n2. Ты миллионер. Миллиардером ты станешь быстрее, чем тот, у кого миллиона нет. Капитализм построен на принципе \"деньги тянутся к деньгам\".\n\n3. Ты авторитетный ученый, тебя цитируют. За счет этого тебя будут цитировать еще чаще, в результате чего угнаться за тобой невозможно.\n\nЭффект назван так в честь цитаты из Евангелия от Матфея:\n> …ибо всякому имеющему дастся и приумножится, а у неимеющего отнимется и то, что имеет\n\nВ сообществах проявляется постоянно: чем активнее какой-то участник или группа внутри сообщества, чем более тяжело остальным добиться равной степени слышимости или значимости.\n\nКак измерять и учитывать: \n- считайте ряд параметров в абсолютных значениях, а не в процентных. Активность в сообществе выросла на 50%, только рост на 50% у тех у кого был 1 пост в неделю это полтора поста, а у тех, у кого было 10 - это 15.  \n- Cчитайте изменения по когортам - важно не то, что вся система выросла вдвое, важно, за счет кого она выросла. Если рост активности идет только за счет самых гиперактивных, нужно принимать меры.\nПо сути это даже не метрика, а методика когортного анализа: все остальные метрики начинают считаться когортно, в итоге мы видим, что прогресс или регресс неравномерно выражен в разных когортах пользователей.\n\nКак компенсировать: не отнимать преимущество у тех, у кого оно есть, а давать другие преимущества, компенсирующие, тем, у кого их нет. На этом основаны все нормальные программы поддержки начинающих \"кого-то\".",
			"added": 1589801856
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}