{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1524150545_1ErQYVi5mdM9hGb6uT4jg8iwGxcJBJYX8h": 1,
		"1523759449_152jxyDu7V8pxqTh31rc1n8tqPD1NudC2a": 1,
		"1525110299_1LAitKPQa2dNhNPTt2NKT2F4DuHWVqAexc": 1,
		"1521392984_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": 1,
		"1525490283_1DaTaCBTsLEJn1EpEfiuJQpVuDbZrQncwx": 1,
		"1525663104_14AqVUuAqS3HsxsPzNgheYJEYWSQnUk7NW": 1,
		"1526062041_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": 1
	},
	"next_comment_id": 41,
	"comment": {
		"1524357756_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 1,
				"body": "The things that you desire are perfectly reasonable and we all want them. Your freedoms, removal of these career politicians that plague virtually every land, a place to call home... These are good things, these are proper things. But the reality is that you'll never escape identity politics. The only way to get to the things you want is by going through those shitty politics, because you'll be blocked at every turn by organized people, who are pretty much religious about their political ideals, if you try to go around them instead of straight through them. The political method requires numbers to be effective... Numbers require a shared identity. You have two choices: Natural identity or artificial identity. \n\nI speak from experience when I say that artificial identity is weak and easily broken. Race, religion, family... These are natural identity and they're very robust. They fit us all like a pair of gloves and it's so incredibly easy to slip into them. They're as instinctive for us as breathing. We always revert back to them, so why fight this uphill battle? Pick a team and run with it, you'll get so much farther and it's far more fulfilling.",
				"added": 1524434304
			}
		],
		"1524300556_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 2,
				"body": "Look into the owner/founder of DDG before you fall for the same old trick again...",
				"added": 1524434521
			},
			{
				"comment_id": 5,
				"body": "> [ssdifnskdjfnsdjk](#comment_226_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Do You have anything against Gabriel Weinberg ? Mind sharing link to some article?\n\nHe previously owned a social network called The Names Database, which he sold to classmates.com back in 2006. The nose knows people will fall for it again. https://en.wikipedia.org/wiki/Names_Database",
				"added": 1524717400
			}
		],
		"1524150545_1ErQYVi5mdM9hGb6uT4jg8iwGxcJBJYX8h": [
			{
				"comment_id": 3,
				"body": "Nice post, OP. Thank you.",
				"added": 1524435401
			},
			{
				"comment_id": 6,
				"body": "> [homulilly](#comment_15_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD): Not a disorder in and of itself but it's generally a symptom of a mental illness\n\nSo is it a sign of mental illness only when white people do it, or would you also apply this to Africans that believe their race is superior? https://i.imgur.com/nkiWIR6.jpg Melanin is a secret intelligence, after all. :^)",
				"added": 1524717704
			},
			{
				"comment_id": 8,
				"body": "> [homulilly](#comment_29_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD): Obviously believing that \"race\", a completely nonscientific concept genetically determines intelligence is nonsensical regardless of which \"race\" you're talking about.\n\nAh, you want to talk science! No problem. Let's use \"species\" instead of race. Would you agree that some dogs are typically smarter than others, by virtue of their genetic heritage? Would you agree that breed of dog strongly influences their behaviors and even personality traits?\n\nhttps://www.akc.org/dog-breeds/characteristic/smartest-dogs/\n\nIf so, what makes humans exempt from this breeding principle?",
				"added": 1525147085
			},
			{
				"comment_id": 9,
				"body": "> [underd0g](#comment_6_12SuCFUNDaMYRHG9DsWCyCN1NgHGjddwSJ): man , is this world gonna be fucked up by murikanz , and soon .\n\nAmericans who recognize our racial identity don't want to conquer the world and start overwriting non-white societies. We just want to have our own, like everyone else, but apparently that's too much to expect. The irony here is that, by and large, we're extremely non-interventionist, let alone imperialist in our disposition. If you truly wanted to stop all these stupid wars in the middle east, for example, you'd be supporting our efforts. We're one of the only groups that's actually serious about immediately recalling the troops and closing up shop. Why? Because we're not interested in wasting anymore white blood for the sake of Israel or Saudi Arabia's ambitions. It's too precious and, unlike blacks, Hispanics, or Asians, we're a minority on a global scale and we need to worry about ourselves instead of everyone else.",
				"added": 1525282290
			}
		],
		"1523661437_19YSf1pQqhyzuSp49GF3tnw51WmXNCozST": [
			{
				"comment_id": 4,
				"body": "You realize that there are a number of interpretations as to what constitutes \"The Tribulation\", right? Majority view on eschatology down through the ages has been the Amillennialist position. https://en.wikipedia.org/wiki/Amillennialism The most popular interpretation today appears to be the Premillennial Dispensationalist view that all those TV preachers like. https://en.wikipedia.org/wiki/Dispensationalism\n\nI attribute this shift primarily to the incredibly wide distribution of a version of the KJV bible that was accompanied by Mr. John Darby's poorly written notes. It's commonly known as the Darby Bible. https://en.wikipedia.org/wiki/Darby_Bible It was used in seminaries across the US, possibly some places in Europe too to a lesser extent, basically as their curriculum's primary textbook. Naturally, Mr. Darby was a Dispensationalist. The rest is history.\n\nIt's not even been a century yet, so I'm sure this situation will sort itself out in the coming decades once Reformed folks regain control of the seminaries.",
				"added": 1524436437
			}
		],
		"1525110299_1LAitKPQa2dNhNPTt2NKT2F4DuHWVqAexc": [
			{
				"comment_id": 7,
				"body": "It's almost like our judiciary has been pumped full of relativists that are deeply connected to the political left or something...",
				"added": 1525146316
			},
			{
				"comment_id": 35,
				"body": "> [homulilly](#comment_45_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD): calling msnbc \"the left\" is pretty absurd. \nYou are not aware of MSNBC's strong political leanings...? They're the home of Rachel Maddow, for crying out loud. Literally every propaganda outlet - which is what a news network is - has a particular slant...",
				"added": 1525984853
			}
		],
		"1525258130_18NrbxMytZcJcDcsUadLeSAfZ2f49jzPXK": [
			{
				"comment_id": 10,
				"body": "https://www.thevenusproject.com/the-venus-project/aims-and-proposals/\n\nThe project is just another SciFi pipe dream meant to make money, the thing they claim to want to eliminate. \"We want to create a society that doesn't require money to operate, so give us money to create this money-less society!\" Sounds legit.\n\nThe language on the website is riddled with leftist buzzwords and catch phrases... The (now dead) Jewish guy that started it has received an award from the UN... \"The Venus Project is...a 501(c)(3) not-for-profit organization\" is prominently displayed on the front page, to let potential donators know that their donations will be tax deductible... Hmmm...\n\n>This is also in perfect accord with the spiritual aspects and ideals found in most religions throughout the world. What sets The Venus Project apart, however, is that it proposes to translate these ideals into a working reality.\nThat seems to be implying that the view held by participators in this project is that there's never been any religions which have successfully implemented their \"spiritual aspects\" or ideals, but that it wants to serve as a replacement for these religions. That kind of sounds like a cult.",
				"added": 1525285313
			},
			{
				"comment_id": 12,
				"body": "> [quantumcat](#comment_2_1Dy3DRM8GHWFbNg3JmBmGX1GNGyCPvQ18a): Stephen Hawking is dead.. all our heroes are dead.\nStephan Hawking was your hero...? You'd better hope black holes are real and not just a giant question mark imposed on us by the math due to us having an incomplete understanding of physics. Otherwise I'm not sure exactly what his life's work will have amounted to in the grand scheme of things.\n\n>we'll have to find one good system if we want this species to survive\nWhich species did you have in mind? There's many of us.",
				"added": 1525310990
			},
			{
				"comment_id": 13,
				"body": "> [quantumcat](#comment_4_1Dy3DRM8GHWFbNg3JmBmGX1GNGyCPvQ18a): All life.\n\nMosquitoes too? I hate those damn things.",
				"added": 1525311103
			},
			{
				"comment_id": 15,
				"body": "> [lifetrix](#comment_1_17d3S7saDQP5phkkWS9F7tMJTymqLCQmig): Venus Project is feminine from of Marxism. Another attempt to establish Marxism through peaceful brainwashing techniques.\n\nIt's super similar to Marxism, but I would probably play it safe and call it some other variant of egalitarianism based upon wikipedia's noting that he got thrown out of a Young Communist meeting after shouting out that Karl Marx was wrong. I have no idea what he was disagreeing with Marx about or if his views changed later in his life, but I think it's fair to say that ol' Karl doesn't have the exclusive right to claim ownership of social egalitarian bullshit.",
				"added": 1525378251
			},
			{
				"comment_id": 16,
				"body": "> [theanswerer0](#comment_15_1F2ZbgkHvpknveTB6wFa5xNEQBb8yxQnCR): he got thrown out of a Young Communist meeting\n\nHe being the project's founder.",
				"added": 1525378318
			},
			{
				"comment_id": 22,
				"body": "> [eibriel](#comment_42_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi): Why is it a prison? Real Artificial Intelligence (in opposition to fictional AI) is just a tool that humans use, is just as emotion less as any other tool. [...]\n\nBecause hammers and screwdrivers aren't complex decision-making mechanisms that control locks, weapons, access to food, or embedded medical devices.\n\n>Technology is everything we do, so we can't be without technology, is just impossible.\nHe wasn't proposing going back to the dark ages, just that we're capable of achieving those goals on our own, which I agree with.\n\n>What is the alternative you propose?\nHis name is NatSoc, so probably National Socialism, which has already been shown to work exceptionally well. Love them or hate them, that society showed miraculous technological development and harmony in such a short time.\n\n> [natsoc](#comment_1_12rREqqdMUPsAPuMR1p87Zj8TS4YocoUCX): Venus project is based on resource based economy \" an economy based on efficient utilization of resources through technology\". Venus project abolishes the right to hold any kind of property just like communism. This project simply wants to create a modern or high tech prison, for people or workers or employees or labours, \nOkay yeah, that's basically communism... Semantics.\n\n> [sarasa](#comment_4_1HLFF47LhPMfkv43GJoGCn7ZwXEAZmFHC6): My opinion of human survival is that we first need to decide if humans belong to the Earth or if the Earth belongs to humans. \nThere's another option that has already been shown to work. Humans belonging to their respective races.\nhttps://en.wikipedia.org/wiki/Blood_and_Soil",
				"added": 1525636106
			},
			{
				"comment_id": 25,
				"body": "> [shitchell](#comment_51_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo): Recent advances have AI outperforming doctors in diagnoses of many life threatening ailments. It won't be long before AI can also perform surgery to fix those problems. \n\nNot the kind of AI we're talking about.\n\n>would love to see a city based on the Venus project be started. You don't have to live there.\n\nYou're free to give it a try, I've no interest in stopping you. I just don't think the people running the project are as noble as they present themselves.",
				"added": 1525639978
			},
			{
				"comment_id": 26,
				"body": "> [shitchell](#comment_53_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo): There actually hasn't been any AI specifically mentioned other than natsoc vaguely talking about \"emotionless AI\" running \"the prison\"...If memory serves me correctly, the Venus Project makes no mention of utilizing AGI for literally anything.\nI got the impression from the project that it was planning to use AI for civic governance. That's what I had in mind.\n\n> [eibriel](#comment_48_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi): I understand your concern. The problem is how we distribute the resources.\n\nI think we did a pretty good job before everything became so centralized.\n\n>There is a system making those decisions, but is a Dumb system! \n\nNot dumb, malicious. There are parasites using politics and taxpayer money to suck us dry in the least sexy way possible. Those same people, or their servants, would be involved in the process of designing the AI responsible for maintaining the proposed system. Compromised from inception.\n\n>Besides this system would not be centralized (Venus project make clear that the picture of the main computer controlling everything is just a bad metaphor).\n\nSmart contracts or something? That's quite vague.\n\n>On real world implementations I love this one: https://en.wikipedia.org/wiki/Project_Cybersyn\n\nWell that was a cool read. But I find it ironic that the watershed moment that they pinpoint to say that this was a good system is when it circumvented the intentions of 40,000 striking truckers. When scabs do it, it's bad, but when Marxists do it using technology it's okay?",
				"added": 1525646346
			},
			{
				"comment_id": 27,
				"body": "> [sputnikcat](#comment_6_14AqVUuAqS3HsxsPzNgheYJEYWSQnUk7NW): Artificial intelligence is the only politician worth electing, unfortunately. Humans have emotion .. but none of the good deeds can compensate for the severity of evil acts performed around the world. The AI decision-maker would need to apply the principle of Utilitarianism, cooperative game theory as well as the Asimov laws of robotics.\n\nA hard AI, which I assume is what you're talking about, is only going to be as good and well-intentioned as the people who created it.\n\n> [eibriel](#comment_49_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi): The quality of life is improving steadily\n\nFor now. Our current infrastructure won't scale indefinitely, whereas the amount of mouths that need fed is increasing exponentially due to white people's pathologically altruistic meddling. As I said in another thread earlier, Africans in particular are overwhelming consumers, virtually never producers and they generally seem both incapable and unwilling to learn. We're currently in a Red Queen's race, but eventually we won't be able to run fast enough and demand will outpace supply. When that happens, it will inevitably lead to mass slaughter on a scale hitherto unheard of... And it's completely avoidable.\n\n>so going back is not an option\n\nhttps://www.zerohedge.com/news/2016-04-18/nine-meals-anarchy\nWe'll be going back to our agricultural roots one way or the other. The only question is whether or not it will be done voluntarily and how many people are going to die in the process. The centralized system of distribution that so much of the west relies on for food and water is highly susceptible to disruption. I live in a place where natural disasters disrupt supply lines regularly. When food or water supplies start drying up, \"diverse\" areas in particular will be the first to turn into shitstorms because their inhabitants aren't able to care for themselves and never planned for a disaster. They have only one option: kill and steal to survive.\n\nhttps://hooktube.com/watch?v=hYCrMNEdweY\nhttps://hooktube.com/watch?v=Ma-sAduVjno\nhttps://hooktube.com/watch?v=KVklVw7J1Po\nhttps://hooktube.com/watch?v=d5dWyWqHbK8\nhttps://hooktube.com/watch?v=UjWLNqQ8rm4 < this man gets my respect.\n\nImagine what would happen to these people if left without food for a month? They'd be cannibalizing each other because, for them, there's no other way. There's just too many of them for them to sustain their own numbers. Nature will take its course.\n\nAlso I wouldn't personally trust the conclusions of ourworldindata.org due to the project's head apparently being a fan of Karl Marx. https://twitter.com/MaxCRoser/status/992720672651665408",
				"added": 1525656567
			}
		],
		"1521392984_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 11,
				"body": "It would be fairly trivial to get gamers to use ZeroNet, and inadvertently assist with seeding, if it were made easier to rate limit your seeding, like you can do with torrent clients. A better way to organize your zites list would also be an advantage. Maybe a \"recently viewed\" segment so users can more easily find what they just looked at in case they don't want to seed it.\n\nA major problem I see is the number of dead links or links to blog zites that don't even have any posts. Best practice for indexes and search lists should be to prune those. Sadly I can't even find contact information for some of these indexes in order to inform them of broken links.\n\nI also noticed the absence of working clear-net gateways... That is definitely proving an issue.",
				"added": 1525296060
			}
		],
		"1525300121_1CF6pbgXdwTsK1JEmKtnfvrfpaFXCd855s": [
			{
				"comment_id": 14,
				"body": "This is pretty dark. One might even say that it's pitch black. https://my.mixtape.moe/lyphsf.jpg Gnome saiyan, homie?",
				"added": 1525312396
			}
		],
		"1525330800_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 17,
				"body": "I wish your peoples good fortune in returning your lands to their proper borders and rebuilding your cultures.",
				"added": 1525378924
			}
		],
		"1525594763_14AqVUuAqS3HsxsPzNgheYJEYWSQnUk7NW": [
			{
				"comment_id": 18,
				"body": "He even wears a cape! https://my.mixtape.moe/bswtvd.jpg",
				"added": 1525629452
			},
			{
				"comment_id": 30,
				"body": "> [homulilly](#comment_41_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD): God am I tired of hearing about this 2 bit fraud.\n\nI haven't looked into his stuff much. What sort of fraud has he committed?",
				"added": 1525662238
			},
			{
				"comment_id": 32,
				"body": "> [homulilly](#comment_42_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD): \nAhhh, thank you for the detail.\n\n> [zrunner](#comment_5_1GEf23jHEorBnKoQ5pKgh4WdZgCCaZL8Hc): he plays a daddy figure to a bunch of weak bois and asks for donations\nI like that description, thanks.",
				"added": 1525676653
			}
		],
		"1525494845_1EHjrNgbVBWHQ7BiKwqKD6pSbowepFP8sf": [
			{
				"comment_id": 19,
				"body": "BAD OP! Post the hooktube link next time so that you're not linking people directly to Jewtube.\nhttps://hooktube.com/watch?v=Q-wwXhbwfrA\n\nThe video sounds like he's describing someone with manic depression, but given that it's showing up on BigThink (politically left outlet) and he talks about \"5 personality types\", I feel like this probably has political undertones. Particularly because the gist of the video appears to be, \"Binary thinking is always bad! Only Sith deal in absolutes, so stay away from those people.\" Unfortunately the video is too vague to be useful. Anyone with a serious bone in their body will engage in conflict when certain lines are crossed. Bashful folks that prefer to avoid all conflict and don't see a healthy reason for it will likely misapply this video and just cut themselves off from people they disagree with... Sort of like the creative brain vs logical brain thing that's been debunked since forever now.",
				"added": 1525631299
			},
			{
				"comment_id": 24,
				"body": "> [shitchell](#comment_48_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo): Do you suppose that buddhist monks have no serious bone in their body?\n\nConsidering that there are Buddhist monks killing aggressive Muslims invading their territory in southwest Asia right now, no I wouldn't say that about them.\n\n>I agree that binary thinking is wrong. I would argue that there are no moral absolutes and that \"right and wrong\" are man-made constructs. \n\nI suspect that the man in the video would strongly agree with you. I believe that that is the perspective from which he was speaking. Many, probably most, people on the political left that I've engaged with seem to have that outlook. Obviously I don't share that view.\n\n>Depending on your definition of \"conflict\", there seems to be no good reason to engage in it. I'd much rather live a life of peace and going with the flow than fighting for artificially constructed, effervescent \"ideals\".\n\nI'm somewhat unsure of what the man in the video meant by conflict, although I have a fuzzy idea. I assume that by conflict he was referring to non-physical conflict, such as arguments and rivalries, that sort of thing. I do see good reason to engage in these things. I affirm the adage that iron sharpens iron. Debate is how I hone myself and rivalry or being antagonized can be quite motivating. It's good to overcome adversity. It makes you stronger.",
				"added": 1525639623
			},
			{
				"comment_id": 28,
				"body": "> [shitchell](#comment_52_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo): Violence goes against the very core of Buddha's teachings. \n\nI'm aware that they aren't being consistent with their religion's teachings, but I wholeheartedly support their freedom to defend themselves, their land, and their property and I believe that it's wise and good for them to do so. I'm glad they're being inconsistent on this point, for their sake.\n\n>You can refine your own view of the world without engaging in \"conflict\".\nI like both, they're fun.\n\n>Rivalry? As in wanting to be better than someone at something? That stems purely from the ego and lacks compassion.\n\nI have no philosophical or religious objections to the ego. Ego and compassion are not mutually exclusive, in my experience. How can I understand and empathize with someone else unless I first understand myself?",
				"added": 1525657749
			},
			{
				"comment_id": 29,
				"body": "> [sputnikcat](#comment_8_14AqVUuAqS3HsxsPzNgheYJEYWSQnUk7NW): I have already learned my lesson. Violence is a bad thing.\n\nCareful with that binary thinking or the guy in the video might mark you as a high conflict person! :P",
				"added": 1525661900
			}
		],
		"1525500010_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 20,
				"body": "Large governments definitely sometimes secretly kill dissenters, but they're not going to use surgery ninjas armed with weaponized endoscopes to induce a neurodegenerative disease or depression while you sleep. There are much easier ways for them to get rid of you. A far more likely explanation for why you're depressed and experiencing muscle atrophy is that you're severely deficient in several necessary vitamins/minerals. Make a journal of what you're eating for a week and determine the nutritional content of the food. Then you'll have a starting point to figure out what's missing from your diet. I hope that helps.",
				"added": 1525632386
			}
		],
		"1525516596_1KY1YYCNH5sDor7yu19jEr5yMtiZ5QyWwu": [
			{
				"comment_id": 21,
				"body": ">I think, that if the same amount of effort, that went into Cambridge Analytica Facebook data mining, went also into the research of how to grow food efficiently, there would be no hunger anywhere in the world.\nI strongly disagree. White people and some Asian groups can manage that for our own populations already. We've been able to do it for decades, if not centuries now. You're not talking about ethno-nations (that's redundant) taking care of their own though. What you're really proposing is for a small subgroup of the world population to subsidize the continued existence of the other 3/4th to 2/3rds of the planet.\n\nThe more that Europeans feed Africans, the more Africans there are. Africans are especially, by and large, incapable of taking care of themselves. The more we feed them, the more they multiply, the more food and water they want, and the less there is for us to care for our own! They never want to produce it themselves! A few do, but if they were capable of it, they would have done so by now with all the help we've given them. It's a Red Queen's race. https://en.wikipedia.org/wiki/Red_Queen%27s_race",
				"added": 1525634567
			}
		],
		"1525490283_1DaTaCBTsLEJn1EpEfiuJQpVuDbZrQncwx": [
			{
				"comment_id": 23,
				"body": "Good post.\n\n> [prodigy](#comment_3_1DaTaCBTsLEJn1EpEfiuJQpVuDbZrQncwx): I'm a bit confused about the database schema. I assume that the data is actually stored in SQLite locally? \n\nI'm not sure if this will help, but here. A little ways down from there it talks about the DB under dbQuery.\nhttps://zeronet.readthedocs.io/en/latest/site_development/zeroframe_api_reference/#uiserver\nIt looks like it's storing json within the local sqlite DB since it's running actual SQL queries to request the json data. Then it just syncs the DB.\n\n>Page.cmd(\"dbQuery\", [\n>    \"SELECT * FROM json ?\",\n>    {file_name: [\"data.json\", \"content.json\"]}\n>], (res) => { console.log(res.length) })",
				"added": 1525638362
			}
		],
		"1525667222_14AqVUuAqS3HsxsPzNgheYJEYWSQnUk7NW": [
			{
				"comment_id": 31,
				"body": "https://my.mixtape.moe/bxrszp.png",
				"added": 1525669660
			}
		],
		"1525698971_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB": [
			{
				"comment_id": 33,
				"body": ">Something like ZeroMail, but with the attachments.\n\nSounds like you're looking to avoid needing to seed your upload? Otherwise a good, old fashioned magnet link would do the job without needing to reinvent the wheel.\n\n> [ssdifnskdjfnsdjk](#comment_254_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I found no private/password protected file sharing service.\n\nIt would be foolish to use such a service anyway as it would leave your security dependent upon the zite's implementation. Your suggestion to password protect the individual file makes a little more sense.",
				"added": 1525713952
			}
		],
		"1525808694_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 34,
				"body": "> [sylviecloud](#comment_18_14RJhs7d84srMhP3Su4ErpZ5NfpXPRV3Ac): I'm probably one of the few.\n\nhttps://my.mixtape.moe/ehmlxk.mp4\nWhile your production quality isn't bad, I find your upload a bit unsettling.",
				"added": 1525984229
			}
		],
		"1525928204_14RJhs7d84srMhP3Su4ErpZ5NfpXPRV3Ac": [
			{
				"comment_id": 36,
				"body": "> [sylviecloud](#comment_22_14RJhs7d84srMhP3Su4ErpZ5NfpXPRV3Ac): They've infiltrated the network\n\nIt's a public network. You can't infiltrate something that's open to the public. That's silly.",
				"added": 1525985015
			}
		],
		"1525978535_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 37,
				"body": "I would like to see region-specific listing services for OpenBazaar now that listings are provided by third party crawlers... https://www.openbazaar.org That would make it easier to trade services over the platform. I don't mean some listing service that shows global listings and lets you narrow it down by location. I mean services dedicated to cultivating participation for their local area so that the network can grow and become more useful. That's what it's going to take for crypto and things like openbazaar to become more mainstream, in my opinion.",
				"added": 1525985807
			}
		],
		"1526051818_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB": [
			{
				"comment_id": 38,
				"body": "> [chikan](#comment_17_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB): >Why there is so much hostility towards pedophiles?\n\nGoodness, I can't imagine why! It's not like you're exploiting or possess a desire to exploit something that mentally healthy adults are hardwired to want to protect or something. You're such victims, clearly.\n\n>We aren't necessarily rapist (yes, a lot of us are\n\nToo many. Take your shit to FreeNet. It's already saturated by your ilk. Don't shit up ZeroNet with this unwanted garbage. You'll render it unusable and we'll have to fragment the network.",
				"added": 1526064464
			},
			{
				"comment_id": 39,
				"body": "> [chikan](#comment_20_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB): If you don't like this genre of sites, just don't visit them. Nobody is forcing you.\n\nOf course, I'm being silly. It's not like new users that are trying out the platform might be turned off by a pedofaggot advertisement on the front page of ZeroTalk or anything. That totally wouldn't stigmatize the network and drive people away! Drink bleach, you sex obsessed jackass.",
				"added": 1526066130
			},
			{
				"comment_id": 40,
				"body": "> [thunder33345](#comment_38_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): but cant we respect each other?\nYou believe pedophiles that are distributing and attempting to profit off of images of their victims deserve respect? What if he was attempting to sell pictures of dead kittens, would you still feel the same way? In what universe would respect be an appropriate response?\n\n>I think our unfriendly behaviour turns people away more than anything..\nThere won't be too many people left to be offended by how unfriendly I'm being if threads like this are tolerated. He can take his \"business\" somewhere else.",
				"added": 1526077700
			}
		]
	},
	"comment_vote": {
		"3_122Epj7hmiJjKTdB6NJzeLt3N5T424KwsR": 1,
		"1_12rREqqdMUPsAPuMR1p87Zj8TS4YocoUCX": 1,
		"42_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD": 1,
		"5_1GEf23jHEorBnKoQ5pKgh4WdZgCCaZL8Hc": 1
	}
}