{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1577743477,
			"title": "RedIceRadio - The Cosmic Serpent - Jeremy Narby",
			"body": "Incredible podcast (now censored and deleted) by RedIceRadio interviewing Jeremy Narby about anthropology and mythology and a counter theory about the antediluvian origins of our world. \n\nFrom WIkipedia:\nJeremy Narby is a Canadian anthropologist and author. He studied history at the University of Kent at Canterbury, and received a doctorate in anthropology from Stanford University.\n\nNarby spent several years living with the Ashaninca in the Peruvian Amazon cataloging indigenous uses of rainforest resources to help combat ecological destruction.\n\nNarby has written three books, as well as sponsored an expedition to the rainforest for biologists and other scientists to examine indigenous knowledge systems and the utility of Ayahuasca in gaining knowledge. Investigating the connections between shamanism and molecular biology, Narby hypothesizes that shamans may be able to access information at the molecular level through the ingestion of entheogens, specifically ayahuasca. The resulting documentary film was Night of the Liana.\n\nSince 1989, Narby has been working as the Amazonian projects director for the Swiss NGO, Nouvelle Planète.\n\nThe Cosmic Serpent: DNA and the Origins of Knowledge (1995) ISBN 0-87477-911-1\n\nShamans Through Time: 500 Years on the Path to Knowledge (2001) edited by Jeremy Narby and Francis Huxley ISBN 1-58542-091-3\n\nIntelligence in Nature (2005) ISBN 1-58542-399-8\n\nPsychotropic Mind: The World According to Ayahuasca, Iboga, and Shamanism (2010) ISBN 978-1-59477-312-9\n\nPodcast:\n\nhttp://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1G6SeTLb1v6LQfgg7ee4VuGQ61wkNVqdzz/RedIceRadio%20-%20The%20Cosmic%20Serpent%20-%20Jeremy%20Narby.mp4",
			"added": 1577743476
		},
		{
			"topic_id": 1578272360,
			"title": "ThuleanPerspective - The Grey Wolf has become the White",
			"body": "",
			"added": 1578272358
		},
		{
			"topic_id": 1578273275,
			"title": "ThuleanPerspective - The PURPOSE of Civilization",
			"body": "",
			"added": 1578273272
		},
		{
			"topic_id": 1578276020,
			"title": "ThuleanPerspective - The Wicker Man",
			"body": "",
			"added": 1578276016
		}
	],
	"topic_vote": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1577743477_1G6SeTLb1v6LQfgg7ee4VuGQ61wkNVqdzz": 1,
		"1577913264_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": 1,
		"1577903734_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": 1,
		"1578276840_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": 1
	},
	"next_comment_id": 7,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "Third, High, and Just-as-high",
				"added": 1577743655
			},
			{
				"comment_id": 6,
				"body": "> [draugrdeathlord](#comment_212_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Test 456\n\n369",
				"added": 1578270755
			}
		],
		"1577913264_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": [
			{
				"comment_id": 2,
				"body": "> [aspidochelone](#comment_297_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): I couldn't access your video link either.  The twitter link leads to ... a bunch of Twitter crap.  How the fuck does anybody ever figure out what they're supposed to look at based on a link to some account name? [...]\n\nVideo works fine for me.",
				"added": 1577920116
			},
			{
				"comment_id": 3,
				"body": "> [reichardnixon](#comment_90_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr): Your link does not work for me.\n\nVideo works fine for me.",
				"added": 1577920139
			},
			{
				"comment_id": 4,
				"body": "> [aspidochelone](#comment_297_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Nobody has ever stopped a Nazi by making his speech illegal, because Nazis are weakest when they talk - their strength is in murder and corruption.\n\n\"Nobody has ever stopped a Nazi by making his speech illegal, because Nazis are weakest when they talk - their strength is in murder and corruption.\"\n\n[citation needed]",
				"added": 1577920228
			}
		],
		"1578262489_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 5,
				"body": "Just get a Mikrotik Hex lite and put it between the proxy box and your home router. Then force it to dial a permanent VPN session with a kill switch. Block all IPv6. It will make it just irritating enough for them to skip and find easier targets. Also make sure the firewall is properly setup and block everything that isn't necessary.",
				"added": 1578264354
			}
		]
	},
	"comment_vote": {
		"94_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"1_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": 1,
		"22_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": 1,
		"21_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": 1,
		"375_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"1495_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"378_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1
	}
}