{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Марганцовка",
			"body": "Из [RetroShare](retroshare://forum?name=%D0%90%D0%B3%D0%B0%2C%20%D0%BC%D0%B0%D1%80%D0%B3%D0%B0%D0%BD%D1%86%D0%BE%D0%B2%D0%BA%D0%B0&id=a7ece12344fc979761e2be0137a513df&msgid=2f29a86ec9db1c75e060ffad0c1433e31483f3d2)\n\n>>>> Конкретно - марганцовка находится под ограничением, поскольку является компонентом взрывчатых смесей и прекурсором наркотических средств, о подробностях не распространяюсь, ибо нефиг.\n\n>>> Почему «нефиг»? Мы же в RS, тут можно говорить свободно :)\n\n>>> Или ты считаешь, что взрывчатые смеси на основне марганцовки могут быть реально опасны для кого-то, кроме незадачливого подрывника? Так тут, наоборот, нужно грамотность повышать, опытом делиться :) Хотя я точные пропорции составов уже плохо помню, лет 25+ прошло, но наверняка есть и более опытный народ.\n\n>> Помню из далёкого, но бурного детства - 1:1 по объёму марганцовка и алюминиевая пудра.\n>> При хранении может отсыреть/окислиться, надо закупоривать.\n>> Бабахает от любой искры, но если подрывать петардой, эффективность сильно возрастает.\n\n> Это самый простой, но не самый эффективный состав. По хорошему, туда ещё сера добавляется. А оптимальный состав, взорванный на листе газетной бумаги бумагу не только не поджигает, а даже не обугливает. Только бледное пятно. Типа, вся энергия смеси во взрыв уходит. Но вот точные соотношения уже не помню.\n\n>>> …\n\n>>> Про наркотики ничего не скажу, не моя область, тут никогда не экспериментировал.\n\n>> Про них тут скучно все.. винт варят/варили с марганцовкой. Окисляли эфедрин, получался стимулятор для внутривенного потребления. Разумеется, на очистку никто не заморачивался, так и кололи вместе с марганцем, в результате получали энцефалопатии и прочие радости жизни. В нынешнее время крайне мало кто этим занимается, совсем уж маргиналы и немногие дожившие олдфаги. Это было популярно в 90е, насколько я знаю.",
			"added": 1526568842
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}