{
	"posts": [
		{
			"id": "62a872c2-9e93-41ab-975f-6ab106015bec",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "b45720e1-3884-4328-a831-0cdc2ce039dd",
			"body": ">>b45720e1-3884-4328-a831-0cdc2ce039dd\nLibertarian here, I'm actually okay with this",
			"time": 1565153554100,
			"files": "[]"
		},
		{
			"id": "683ed2fe-9d3f-4cd7-88e2-d5007a610ea7",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "87c258b0-f11f-4625-9b18-40175ecade0a",
			"body": ">>f783f712-1f65-410e-9574-99ce4a45d840\nsame",
			"time": 1565153620300,
			"files": "[]"
		},
		{
			"id": "dcb04018-1a35-4e2d-88c5-ba0a041f7e2d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "970aea10-19b2-473a-9ed1-da6aea653c7b",
			"body": "anyone read the official word from the creator of voat?\n\n\n    Voat has always been a wild ride. Community meltdowns over censorship standards to having our hosts terminate agreements to having our legitimate payment processors terminate our service without valid reason. One thing with Voat is that there is a surprise around every corner, each new day brings a separate set of challenges, and the hurdles are never ending and as far as the eye can see.\n\n    One thing I find interesting is the generational change with users. Each year Voat cycles a user base much the same way that humans do, and with each new generation the past is further forgotten. I always find it interesting that there are many currently that don’t have the slightest idea who SaneGoat or Amalek were.\n\n    I say this because many find it confusing that Voat is locked down right now (Authorized Only and Registrations are disabled). They simply don’t understand how an “internet site” can do such “ass backwards” things when every other website is focused on growth and user numbers. With Voat, sometimes things just work out in the best ways possible, completely unforeseen in the beginning.\n\n    Voat has been attacked via DDOS two times now by professionals. They are professionals because both the scale and methods employed are nothing less than professional. The first attack of this caliber used website end-points that were expensive and not widely known (a normal user seldom navigates to these areas of the website). In response we made changes and discontinued publishing code to our github repo. This was a defensive move. This latest attack was responsive in that they were monitoring Voat. When I turned Voat off, they stopped sending traffic, but within minutes of enabling Voat, they continued their assault.\n\n    In response to this dynamic nature, the only thing I could do was to prevent the botnet from being able to function how it was. I accomplished this by requiring Authorized Only access as typical DDOS attacks on a smaller site like Voat don’t usually come with advanced planning (e.g. creating accounts). Based on their persistence and monitoring I had to disable registrations because that would be their next move to get around the first.\n\n    Now fast-forward to CloudFlare, which recently made news for doing something they promised they’d never do again, terminating customer service. They terminated 8chan and while that is horrible in and of itself, they did it in the most callous way possible by giving them mere hours’ notice. They terminated abruptly to inflict the most pain possible, which speaks volumes of the character of that organization.\n\n    Meanwhile the anti-truth, anti-freedom, anti-free speech advocates that dominate our internet media reveled in their victory, they were already looking for an additional trophy to add to their collection.\n\n    This is where I think the hand of God works in mysterious ways. They next came after Voat, but because of the recent attacks, Voat was inaccessible to those without accounts, thus giving them zero content in which to twist and distort in order to pressure a company like CloudFlare (now that they know it works). You can call this happenstance, but it has happened so many times during Voat’s history that I simply cannot accept it isn’t by design. This is where the generational history comes into play, because new goats don’t see how many times over the past 5 years online that Voat has ended up on top from a defeated position.\n\n    I tell you all this, because hardship and challenges chisel the character of man, but life never promises an easy ride. Trust that standing for truth yields the favor of God (and trust in God himself you atheists!) and even in defeat you will have victory.\n\n    Voat has a lot of decisions to make now. Big decisions. Writing custom software from scratch is already a daunting task, we now also have to contend with an environment that is growing increasingly hostile to basic rights of human communication. They won’t stop, and they can’t stop, because the Truth always wins in the end, and Truth isn’t on their side. It will be a fight each and every day going forward. Prepare.\n\n    To the weak: Leave. This isn't a fight for cowards or ladyboys. I don’t know where this will all end but Voat will do the noble thing and continue standing for principles that are the right of every man and child: the freedom of expression, to be free in thought, to live as free men.\n",
			"time": 1565277617700,
			"files": "[]"
		},
		{
			"id": "19f4191b-5f83-4fa8-9e65-43f89706c742",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "970aea10-19b2-473a-9ed1-da6aea653c7b",
			"body": ">>dcb04018-1a35-4e2d-88c5-ba0a041f7e2d\nmy point is this: voat was open source. 4chan nor 8chan are open source. We need an open source platform if we don't want to get fucked. Open source is also a liability because of security vulnerabilites or shutdown based on flaws.\n\nIf we all have a copy, there can be no shutting us down. \n",
			"time": 1565277818000,
			"files": "[]"
		},
		{
			"id": "e13656f2-3a66-4d41-a3b6-52a3eef73e31",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "837be9ef-aa71-40e2-a4f2-ffaad4caaaec",
			"body": "this is an easy fix in the script headers..",
			"time": 1565327258900,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}