{
	"title": "4kbytes.",
	"description": "Hackers that teach you how to do stuff.",
	"links": "[Got problems? Message me or discuss this over at ZeroMe](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i/1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L/bwoi@zeroid.bit)",
	"next_post_id": 6,
	"demo": false,
	"modified": 1475096001,
	"post": [
		{
			"post_id": 5,
			"title": "Pinning Posts on your Blog",
			"date_published": 1475095639.322,
			"body": "Ever had a situation in which you want to pin a post?\nLook no further! I have found a small and simple method to pin your posts to the top of your ZeroBlog.\n\nFirst off, you're going to need to have [this](img/pinned.png) image downloaded to the folder \"img\" on your site.  Go ahead and download that now (other emojis can be used too!)\n\nThen, you'll need to locate the post you want, and hover over the date.  Click the pencil button next to it.  You should now be able to edit the date - change it to something like, Jan 01 3000.  Something way ahead in the future, or whenever you want the pin to expire.  This will keep the post at the top since it is considered the newest post.\n\nYou'll then want to put this HTML in the title of your post for the little \"pin\" icon:\n```<img src=\"img/pinned.png\" width=\"32\" />```\n\nThat's it! Your post should look something like the one you see at the top of this blog.  Keep in mind that it's completely unsupported and might be broken in future releases."
		},
		{
			"post_id": 4,
			"title": "<img src=\"img/pinned.png\" width=\"32\" title=\"Pinned post\" alt=\"Pin\" /> Group Chat!",
			"date_published": 32503680000,
			"body": "<span class=\"post details\">Pinned post</span>\nWe're now available on IRC!\nfreenode #fourkbytes\nCome join :)"
		},
		{
			"post_id": 3,
			"title": "Comparing Linux Distros: the best of the best",
			"date_published": 1475007035.905,
			"body": "When it comes to hacking-oriented Linux distributions, there really isn't too much choice, but there are a few new distros I thought I'd talk about in this article too - look out for those.\n\n###Kali Linux###\nKali is by far one of the best pentest distros available, with a wide array of tools as well as a selection of desktop environments (ranging from GNOME 3 to the classic MATE), I'd recommend this for beginners (which means it'll be the distro used in most tutorials) simply because it has everything you could need and it's highly extensible.\n\n###Backbox###\nBackbox is honestly one of the best looking distributions available.  It runs on XFCE by default, which means it looks good while still retaining good speeds and low memory usage when idle.  It has quite a few good tools, and these are all  organized into categories - albeit differently compared to Kali.  It is a little buggy and unpolished in areas, but this is more than likely due to the tools themselves (as well as a few on XFCE's half!).  I'd recommend this for people who know what they're doing, but still like the simplicity of having everything pre-installed.\n\n###ParrotSec OS###\nParrotSec tries to look good, and it does it well, but it still doesn't look quite as polished as the previous two.  The main reason behind this is probably because it uses MATE, which looks outdated compared to GNOME 3 and the highly customizable XFCE.  It has a literal ton of tools, and I honestly think it's great, but it's very buggy in its current state and you should probably wait a little while for this one.  I'd say that this is quite newbie-friendly due to the massive amount of applications that come pre-installed.\n\n###Pentoo###\nI haven't used this, and I probably wouldn't dare using it simply because it's built on top of Gentoo, and I don't have the interest in using something where you have to compile everything from scratch, and even the tiniest mistake can kill your entire distribution.  From what I've heard it's okay, but I **really** don't recommend this for new users!\n\n###Conclusion###\nTo conclude, I'd say either go for Backbox or Kali right now since they're both very beginner-friendly and contain most of the tools that will be used in the tutorials you see here.  They're also very nice looking, and there are probably other distros I haven't mentioned, but these four are the main most popular ones available right now.\n\n\n\n"
		},
		{
			"post_id": 2,
			"title": "An introduction.",
			"date_published": 1475002439.286,
			"body": "What is 4kbytes?\n4kbytes (or 4kb for short) is a small hacking group dedicated to making sure that everybody can access tools, tutorials and links that are useful when hacking, especially when starting up.\n\nWhy is 4kbytes on ZeroNet?\nWe chose to use ZeroNet over the standard, centralized internet as we felt it would be much safer and easier to get started here, and that it would fit a lot more with the whole deep web thing.\n\nWho are 4kbytes?\nAnyone and everyone can be part of 4kb, but only a few select members have access to posting on our blog, here.\n\nTL;DR: We're hackers.  Stay tuned for tools, tutorials and links."
		}
	]
}