{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1580617751_1G5J3JZZ6SZtdsSAS3etngxaTXjcNg25ge": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1580617751_1G5J3JZZ6SZtdsSAS3etngxaTXjcNg25ge": [
			{
				"comment_id": 1,
				"body": "For the technically literate Babble might actually be very interesting. It's an MIT licensed implementation of hashgraph, that might be used for a variety of decentralised software.\n\nFrom their GitHub page: \"Babble enables multiple computers to behave as one. It uses Peer to Peer (P2P) networking and a consensus algorithm to guarantee that a group of connected computers process the same commands in the same order; a technique known as state-machine replication. This makes for secure systems that can tolerate arbitrary failures, including malicious behavior. [...] We use an adaptation of the Hashgraph consensus algorithm, invented by Leemon Baird.\"\n\nGitHub: https://github.com/mosaicnetworks/babble\nCorporate site: https://www.babble.io/\nDocumentation: https://docs.babble.io/en/latest/",
				"added": 1580683157
			}
		],
		"1580580478_129GZPA7VpPa3YaRRW2ani34CaowY5hYB8": [
			{
				"comment_id": 2,
				"body": "> [filips](#comment_424_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): And in fact, WebStudio is using GrapesJS, open source website builder, so it can be also set up to be used with ZeroNet. And this already exists, although I don't know if it works correctly.\n\nWow! That is brilliant really. Also clonable. I just don't know how to make it signable with my private key. Do you have a pointer for that?",
				"added": 1580685667
			}
		],
		"1581413099_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": [
			{
				"comment_id": 3,
				"body": "> [geekosan]I just can't figure out what's so great about it. I mean... We aren't all the same[...]\n\nAfter this already, I am doubting how much you've read and what you've read. No communist would ever say that humans are equal, as this is obviously not the case. This argument comes typically from cold war anti-communist propaganda and its inheritors.\n\n> [geekosan][...]we can't expect everyone to just fall in line and start donating their work and stuff for free for everyone else. We also can't expect everyone to work as hard as others.\n\n\"From each according to his ability, to each according to his needs\" is the phrase Marx uses in his critique on the Gotha programme (1875), which was an influential piece for what later became marxism. \n\nJust a short citation from wiki: \"The principle refers to free access to and distribution of goods, capital and services. In the Marxist view, such an arrangement will be made possible by the abundance of goods and services that a developed communist system will be capable to produce; the idea is that, with the full development of socialism and unfettered productive forces, there will be enough to satisfy everyone's needs.\"\n\nFrom the critique itself: \"In a higher phase of communist society, after the enslaving subordination of the individual to the division of labor, and therewith also the antithesis between mental and physical labor, has vanished; after labor has become not only a means of life but life's prime want; after the productive forces have also increased with the all-around development of the individual, and all the springs of co-operative wealth flow more abundantly – only then can the narrow horizon of bourgeois right be crossed in its entirety and society inscribe on its banners: From each according to his ability, to each according to his needs!\"\n\nSource: https://www.marxists.org/archive/marx/works/1875/gotha/ch01.htm\n\nIt is, as you can see not \"working for free\" nor that \"everyone works as hard\".\n\n> [geekosan]There will always be groups and individuals who either don't care, or don't even want to participate in the group effort. Like there will always be those who want to exploit all that \"free\" effort.\n\nAntisocial behaviour is a genuine concern, and easily resolved really. Marx proposed replacing money with labour certificates / vouchers that you get by working and you enter back into the system by spending them on anything, like groceries. These days, such an idea could be implemented by using a blockchain or similar technology that tracks what you 'enter' into the system by labour time and what you 'spend' by consuming. I'm sure there are many other solutions. The point being is that there's affluence for anyone participating or having gained exception (like pensioners, those being sick, pregnant women, etc).\n\n> [geekosan]You just can't straight out eliminate all of our differences and \"inequalities\". They are what make us human in the first place. We are not ants, or robots either.\n\nAgreed. That was again never the point to begin with. To a certain degree we are a social species *because* we're different individually. This has long evolutionary roots.\n\nAnd while it is perhaps too much for now to fully deep out these evolutionary origins, it is perhaps worth repeating that Marx and Engels were working from a positive claim on human nature. This claim has been tested and verified in over 150 years of anthropological research, namely that humans are fundamentally a 'communist' social species. Not in the way ants are, which are literal drones, but in the way that makes us human. Without being a social primate we wouldn't have had language, culture, technology and science (which are really a form of collective understanding we've built up over time). We're radically different from our closests primate cousins.\n\nThis ancient hunter-gather society is what Marx and Engels refer to as original communism ('urkommunismus', often wrongly translated as 'primitive' communism). A society without state, class, poverty and the like. A society which formed us as a species for hundreds of thousands of years but which ended by the end of the last ice age.\n\nNow, Marx's positive claim is that after 10 000 years of development of technology and social relations, we have arrived at capitalism which brings us back into the grasp of a new communist society, one where the means of productions are again high enough so that is allows us again to be \"fully human again\".\n\nI'm sure this is not your typical 'human nature' argument you might have heard about!\n\nI'll just leave it there.",
				"added": 1581552239
			},
			{
				"comment_id": 4,
				"body": "> [chernobyl](#comment_6_14giYM2ws7rPBNTE8o9j8QSpkNTPXPUPiE): suprnova: What a cocksucker.  [...]\n\nCome at me bro.",
				"added": 1581616917
			}
		]
	},
	"comment_vote": {
		"5_1G5J3JZZ6SZtdsSAS3etngxaTXjcNg25ge": 1,
		"7_1QF6TdQmnXquDdxnjfmsuBnpp22admdGUm": 1,
		"6_1e6paNoDoqwCZGNa4o4uX43GrawvJuVB5": 1,
		"1_1AE2tYp2pXa7j1PydeRkPRsc2qpWXwrR49": 1
	}
}