{
	"next_comment_id": 5,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [ssdifnskdjfnsdjk](#comment_1_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Hi, \"dead inside\" has some causes and reasons, i would certainly want to know them. I do not think the life is a dead end.\n\nI think I missed a few things in my initial post. Yes, I've had some pretty bad life experiences, including mental and emotional abuse from my stepfather and ex-girlfriends as well as supposed \"friends\" who would berate and belittle me.",
			"post_id": 2,
			"date_added": 1525913331
		},
		{
			"comment_id": 2,
			"body": "> [ssdifnskdjfnsdjk](#comment_2_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I see, the lack of support/love/approval from parents may have bad effect that are uneasy to be overcome later. Though i can not say that i can blame my parents, that would not be fair. Because they themself has some parents which impact made their behavior, and i can confirm as i know my grandfather and grandmother who are divorced, it could not be easy to be their child at all times, but there still was some love at least from one parent in my case. And my mother was a christian and so i learnt these things which helped me to understand love and value of a person a bit, so that is maybe why i can not say i am \"dead inside\", because i see some purposes around and see that life has a meaning. Though i have problems making friends and talking to people probably caused by kind of physical abuse and lack of support/love from my father. Maybe it will help you to see there are certainly people with similar issues like yours. Looking to your blog posts.\n\nI always got love from my mother at the very least, she was also a Christian. I was raised Christian but became agnostic later in life. I've made another post with more info that might shed more light.",
			"post_id": 2,
			"date_added": 1525946751
		},
		{
			"comment_id": 3,
			"body": "> [ssdifnskdjfnsdjk](#comment_3_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): From your posts, you do not seem to be stupid. I think one day is way too short time to adapt. But in my country, even much older people than 30 years old decide to study again so they have more options for employement.\n> \n> i think this can be somethig to write new blog post about\n\nThe reason why I dropped out after a day was I couldn't comprehend anything I was being told in those classes. It was like they were speaking Chinese.\n\nLike, elaborate more on what I said there?",
			"post_id": 3,
			"date_added": 1526011505
		},
		{
			"comment_id": 4,
			"body": "> [ssdifnskdjfnsdjk](#comment_4_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I think most important things that formed young people is what happened in the childhood. Mainly parents, trauma things.. These are things one have to understand and somehow adopt in order to better deal with own future. But life is not ideal, so this is by far not unique opinion - \"I am.... Alone. ...Unloved. ...A waste of oxygen.\", i could say similar things and heard this numerous times on discussions. Though we have to find something good, some value if we do not want to continue feeling that way. I heard that the way to be loved is to give some love/attention/empathy, not to wait one probably do not usually see any ways to do it if is alone, thoug there can be found some small things one can do and be happy about that even if the major time he feel bad/alone, etc.\n\nI'm not sure how though.",
			"post_id": 3,
			"date_added": 1526128380
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}