{
	"posts": [
		{
			"id": "e382fbf6-cdc5-483b-9739-3d4ae6c2c0fc",
			"directory": "users/1LkM33Rh7DP79wJFKKCYiFKv6tkgyXtnGC",
			"uri": "MT",
			"thread": "9f24c0a0-0abe-41eb-bed9-ab5e19bf9434",
			"body": "made a blacklist.json for myself\nBlacklisting __BOARDS__ and not users.\nits very 'thorough'\n259 boards blacklisted\nhttps://pastebin.com/rh1mCKVS\nI would put more on there, but I made it so that only 22 boards were visible.\nIf one was to copy and paste it into their blacklist.json file, they can just delete the lines of text for the boards that they don't want blacklisted.\nIts pretty easy.",
			"time": 1600713412097,
			"files": "[]",
			"last_edited": 1600713676497,
			"subject": null,
			"capcode": null
		},
		{
			"id": "255fbef2-e2f2-4deb-a1ca-b4c77a09efc4",
			"directory": "users/1BHW9TDfbFkuPJaSZyoUTyHosRnUsFZHca",
			"uri": "pastebin",
			"thread": "170be22f-99f9-4c18-a7d1-56eccef2e98d",
			"body": "made a blacklist.json for myself\nBlacklisting BOARDS and not users.\nits very 'thorough'\n259 boards blacklisted\nhttps://pastebin.com/rh1mCKVS\nI would put more on there, but I made it so that only 22 boards were visible.\nIf one was to copy and paste it into their blacklist.json file, they can just delete the lines of text for the boards that they don't want blacklisted.\nIts pretty easy.",
			"time": 1600713971761,
			"files": "[]"
		},
		{
			"id": "7fc79e63-515b-4184-82ba-a379e4015c85",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "5160ecf2-b5ae-4ff1-80bc-b384b7ed27c6",
			"body": "hanging out updating the site\nusing vpn\ncould use tor too but its just too slow\ndid a board blacklist.json file I listed on /pastebin/ and /MT/\nhave to update it again\nboards just keep popping up as I update the site",
			"time": 1600715495269,
			"files": "[]"
		},
		{
			"id": "ad6cd838-a62b-43c0-8187-ca7ff6d62ad4",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "6460fd2c-1c13-48ce-a491-6b3be0ad4cd4",
			"body": "just sold my Oculus Rift-S for $300.00\nI didn't really use it that much anyway.\nIt wasn't really all that great.\nUsing the Flight Simulator was giving me severe motion sickness.\nIn addition, (((They))) will be requiring that a Faceberg account be bound to your Oculus account.\n\n==Facebook’s Bold New Oculus Move Sparks Outrage==\n\n> Facebook has sparked outrage among Oculus users after confirming this week that a Facebook account will be needed to log into their device. The social network—which bought Oculus for $2 billion in 2014—said in a blog that starting in October this year, everyone using an Oculus device for the first time will need to log in using a Facebook account.  \n\n> Existing Oculus users have the option to log in with Facebook and merge their accounts now, and those who choose not to will have two years to use their Oculus accounts—Facebook will end support for Oculus accounts in January 2023. But Facebook warned that those who choose to stick with Oculus accounts will lose functionality. \n\n> “If you choose not to merge your accounts at that time, you can continue using your device, but full functionality will require a Facebook account. We will take steps to allow you to keep using content you have purchased, though we expect some games and apps may no longer work.”\n\n> '''Oculus user outrage'''\n\n> Oculus users expressed their outrage on a Reddit thread, with one pointing out that Oculus founder Palmer Luckey had betrayed a promise he made back in 2016 that people would not need a Facebook account to use the Oculus Rift.\n\n> Luckey responded to the recent accusations, saying: “I am already getting heat from users and media outlets who say this policy change proves I was lying when I consistently said this wouldn't happen, or at least that it was a guarantee I wasn't in a position to make. \n\n> “I want to make clear that those promises were approved by Facebook in that moment and on an ongoing basis, and I really believed it would continue to be the case for a variety of reasons. In hindsight, the downvotes from people with more real-world experience than me were definitely justified.”\n\n> I have contacted Facebook for a comment and will update this article if the firm responds.\n\n> '''EFF: Facebook breaks promise'''\n\n> Privacy advocates the EFF criticised the move on Twitter, saying: “Facebook requires Oculus Rift users to log into Facebook, breaking yet another privacy promise.”\n\n> EFF analyst Karen Gullo sent me an additional statement via email: “The new requirement breaks a privacy promise to users. Facebook should be held accountable—keeping promises should be a minimum standard for new acquisitions.”\n\n> '''What to do''' \n\n> Other privacy experts agree. Jake Moore, cybersecurity specialist at ESET says the move seems “a blatant way to gain user connection information”, adding that “it is rather unusual to only offer one option when signing up.”\n\n> But Moore thinks it’s possible Facebook may backtrack after the backlash from Oculus users: “It is likely that it will only work if Oculus’ user base doesn’t reject the decision to hand over their Facebook details. Therefore, there is a distinct possibility that this move may not ever come to fruition.”\n\n> So, what should you do if you use Oculus, or are planning on buying a device? For now, Moore suggests those who do not feel comfortable in offering up their Facebook details should create a burner account for the single use of Oculus sign up.\n\n> It’s a good idea if you really want to buy an Oculus, and who knows, by 2023, maybe things will have changed. \n\n'''Source:'''  https://www.forbes.com/sites/kateoflahertyuk/2020/08/22/facebook-sparks-oculus-outrage-you-need-an-account-to-log-in/#33a7fd6e405a\n'''Archive:'''  https://archive.ph/UnrN8",
			"time": 1600716200748,
			"files": "[{\"name\":\"zuckerkike.jpg\",\"thumb\":\"61eca156aac8909306dcfb9c60cdba2644feacc1-thumb.jpg\",\"size\":44596,\"type\":\"image/jpeg\",\"original\":\"61eca156aac8909306dcfb9c60cdba2644feacc1.jpg\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]",
			"last_edited": 1600716415648,
			"subject": null,
			"capcode": null
		},
		{
			"id": "b2bfbe2b-88a3-4dca-b0f7-516ab97a19a5",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "b5b05ad4-9d58-4e0f-bc04-55cd7d9e3584",
			"time": 1600728443965,
			"files": "[{\"name\":\"draw-your-favorite.png\",\"thumb\":\"e63ac3b9a430aa407a329bcc4f9418dae4944ee8-thumb.png\",\"size\":3037866,\"type\":\"image/png\",\"original\":\"e63ac3b9a430aa407a329bcc4f9418dae4944ee8.png\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "25fc4478-4442-40a0-8fba-5ec948783fcd",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "352109a0-b3bf-4794-915d-11b501fc2821",
			"body": ">>352109a0-b3bf-4794-915d-11b501fc2821\nI saw some Amish today. One was working the fields with his horses.",
			"time": 1600728529265,
			"files": "[]"
		},
		{
			"id": "9a2fc828-c83c-4685-8324-78be85b2251b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "d3ffe4c7-3fdd-49f7-8937-03e8033de341",
			"body": ">>d3ffe4c7-3fdd-49f7-8937-03e8033de341\nI wish you would stay on long enough to seed",
			"time": 1600739077142,
			"files": "[]"
		},
		{
			"id": "0c743928-dde1-482e-8bc5-95c5651aac64",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "d3ffe4c7-3fdd-49f7-8937-03e8033de341",
			"body": ">>364a374b-ab42-4bb2-acde-63519fa81c45\nI started reading,'' 'The Marketing Of Evil,' ''by David Kupelian (2005).\n**''He never really names the jew''**\nHe states that the U.S. worships its Supreme Court Justices somewhere in the first 50-or-so pages.\nIMO, this is akin to nigger sports-figure worshiping.  disgusting jews place too much importance on these Supreme Court Justices.\nSupreme Court Justices can also be impeached, btw...\nMaybe that's why the repulsive jews are afraid of a Constitutional Republic.",
			"time": 1600743819754,
			"files": "[]"
		},
		{
			"id": "aba47288-389a-4c4a-bfe9-5133abf75264",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "e3154104-e029-4c53-bd30-c38938918a0c",
			"body": ">>e3154104-e029-4c53-bd30-c38938918a0c\npls provide link",
			"time": 1600751346177,
			"files": "[]"
		},
		{
			"id": "0475d7c4-3031-4f44-bcbe-cc42d2d95a49",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "795de928-928b-499d-ba2d-8e367655caf3",
			"body": "'Anti-Semitism' was inevitable.\nIt has happened over and over and over again in the past 3,000 + years, so what is happening now is just par for the course.",
			"time": 1601050648826,
			"files": "[]"
		},
		{
			"id": "bd8c4461-c9d6-4823-b628-78cffb79d173",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "d3ffe4c7-3fdd-49f7-8937-03e8033de341",
			"body": ">>2ab4b4c5-6d16-4057-8235-4400f4f93dad\nnot telling",
			"time": 1601051379592,
			"files": "[]"
		},
		{
			"id": "0ec7af72-276d-4f9e-b4be-d1e3910daa91",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "dd9455a1-28f4-4024-8acc-ae084a896deb",
			"body": ">>dd9455a1-28f4-4024-8acc-ae084a896deb\nNBA and NFL are already collapsing\nWhere is this white-only media shop?\ngot a link?",
			"time": 1601305214654,
			"files": "[]"
		},
		{
			"id": "1e1a846c-e7e1-4fb2-97ab-4dcce85266b0",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "e19310f8-430e-4878-aea2-4334bdd9cbcc",
			"body": ">>e19310f8-430e-4878-aea2-4334bdd9cbcc\nare those shooped?",
			"time": 1601306460700,
			"files": "[]",
			"last_edited": 1601312964603,
			"subject": null,
			"capcode": null
		},
		{
			"id": "5b3983df-56ba-4bcd-acac-9bc8cc93f3fb",
			"directory": "users/1LkM33Rh7DP79wJFKKCYiFKv6tkgyXtnGC",
			"uri": "MT",
			"thread": "9f24c0a0-0abe-41eb-bed9-ab5e19bf9434",
			"body": ">>d50fb676-72b3-40d8-a2a4-e7b355b2714e\nyeah, I know...",
			"time": 1601307670293,
			"files": "[]"
		},
		{
			"id": "da2b8b9d-f8f5-4ba2-ab88-d5d30d9de5bb",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Seeding",
			"body": "Trying to access images today - Okay, so I'm not on at the same time that you are, but shouldn't there be some seeding going on?\n     This is probably why not many users come here.\n     Inability to access images and/or video content due to lack of seeding isfucking it all up.\n     Raise your size limits and seed files.",
			"time": 1601308974323,
			"files": "[{\"name\":\"come-on-man-seed-this-zite.png\",\"thumb\":\"259114865d93a4c7b8705d3eef0becd7ae3dc365-thumb.png\",\"size\":1702158,\"type\":\"image/png\",\"original\":\"259114865d93a4c7b8705d3eef0becd7ae3dc365.png\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"},{\"name\":\"come-on-man-2.png\",\"thumb\":\"d5739ae7211ba4a3f7739e49d12f6667f5aade39-thumb.png\",\"size\":36581,\"type\":\"image/png\",\"original\":\"d5739ae7211ba4a3f7739e49d12f6667f5aade39.png\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "c9027435-2b88-4031-baff-73039ee0fef5",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "da2b8b9d-f8f5-4ba2-ab88-d5d30d9de5bb",
			"body": "I did a pastebin of blocked boards.\n\nhttps://pastebin.com/uPKnwNZ0\n\nThis can be copy-pasta'd into the blacklist.json file, which you can do a search for in your ZeroNet directory.\n\nI'm not sure where it is located in your computer, but because I'm a LinuxFag, I have in inside my /home/user/zeronet/ZeroNet-linux-dist-linux64/ directory so I can access it easy.\nIf you don't want to block certain boards, you can just either delete those lines in blacklist.json, or you can go to the front page > Options (Upper left corner) > find the board and click on it and you will be prompted in the upper right.  (pic-related-2.png)\n\nPic Related 1 (wuts-left.png) is what I see when I come to 08chan.\nPersonally, I don't block users.\nI just block boards because I am really just trying to seed /pol/ anyway.\nI will unblock boards later when I have more data on /pol/ particularly.\n\nramble-ramble-bla-bla\nttyl",
			"time": 1601309894123,
			"files": "[{\"name\":\"wuts-left.png\",\"thumb\":\"0b9cc42fdb0c7f24b1c186373dd55f3fb784f36a-thumb.png\",\"size\":130253,\"type\":\"image/png\",\"original\":\"0b9cc42fdb0c7f24b1c186373dd55f3fb784f36a.png\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"},{\"name\":\"pic-related-2.png\",\"thumb\":\"3142fb9978f7ad874d153c10b02a2203e46e21f2-thumb.png\",\"size\":158449,\"type\":\"image/png\",\"original\":\"3142fb9978f7ad874d153c10b02a2203e46e21f2.png\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "934dd4f1-187a-416f-8edb-0f77b411fa72",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "da2b8b9d-f8f5-4ba2-ab88-d5d30d9de5bb",
			"body": ">>c2516cc8-9b66-46db-bf92-d13f6359cf5c\n> Connected --- 0\nwtf",
			"time": 1602212169494,
			"files": "[{\"name\":\"wtf.png\",\"thumb\":\"32ec4ce679bb2eff1e9af1de7913c252576daccb-thumb.png\",\"size\":284989,\"type\":\"image/png\",\"original\":\"32ec4ce679bb2eff1e9af1de7913c252576daccb.png\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "e24da6f1-ed9f-4f56-93e0-c7cf683e0e41",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "3af00982-1719-4bf7-b5d9-a3393c01fc57",
			"body": ">>3af00982-1719-4bf7-b5d9-a3393c01fc57\nplease repost video",
			"time": 1602213817800,
			"files": "[]"
		},
		{
			"id": "a137ec4a-c6f6-4d40-b291-c2e40cd23731",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "da2b8b9d-f8f5-4ba2-ab88-d5d30d9de5bb",
			"body": ">>34b54485-8018-4b83-ab34-5ddd70aecbb3\n>>d0c8f12f-0b13-43dc-93cb-2e0a3d3d384b\n>>c2516cc8-9b66-46db-bf92-d13f6359cf5c\nI'm just using a VPN with Firefox at this point.\nNot even using Tor Browser",
			"time": 1602213847431,
			"files": "[]"
		},
		{
			"id": "0bb39161-5e2f-4d0f-b7a4-7a129c01340a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "eaad4d76-c931-40f3-a4db-833e9c87f7d6",
			"body": ">>eaad4d76-c931-40f3-a4db-833e9c87f7d6\nthat she-boon needs to be publicly executed and then her body dumped in a landfill - all on video",
			"time": 1602215453000,
			"files": "[]"
		},
		{
			"id": "de393328-2ddc-4f3b-867c-d7cc4a8f09d8",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Beyond White Supremacy: DHS’s New Threat Assessment Also Warned of Antifa Terrorism",
			"body": "'''Beyond White Supremacy: DHS’s New Threat Assessment Also Warned of Antifa Terrorism'''\n\n> ''Posted: Oct 13, 2020 12:44 PM''\n\n> Judging by most of the traditional news reporting about the U.S. Department of Homeland Security’s first annual “Threat Assessment,” the only takeaway worth relentless reporting was that white supremacists now pose America’s “most persistent and lethal” domestic terrorism threat.\n\n> No one has challenged the 25-page DHS report’s credibility on the white supremacist threat matter, despite its having come out of the Trump administration. That’s because the white supremacists are indeed a domestic security threat, as I testified before Congress last year. But American media coverage somehow entirely bypassed the fact that this same highly credible DHS report expends perhaps more ink about the domestic terror threat posed by the Antifa movement. \n\n> The movement’s name – Anti-Fascist Action Network, or Antifa – is never uttered anywhere in the document, for reasons unconfirmed, but the description of it throughout provides ample and clear recognition: “violent anarchist, anti-government, anti-authority extremists” who have been destroying cities, attacking law enforcement and hurting Americans in protest riots for the last six months in cities such as Portland, Brooklyn and Chicago. These violent anarchists, the report said, “have been associated with multiple plots and attacks” and are “increasingly taking advantage of large protest crowds to conduct violence against government officials, facilities, and counter-protestors.” \n\n> “Say the name – Antifa!” could become the new rallying cry outside DHS headquarters and American newsrooms. But that’s plainly Antifa throughout the 2020 threat assessment.\n\n> ''' ‘Increasingly Pervasive’ '''\n\n> The discussion about Antifa movement adherents, or “violent anarchist extremists,” starts high up, in the same much-quoted Forward by Acting DHS Secretary Chad Wolf, where he opined about white supremacists. And predictions about what it might do are below in the body of the document.\n\n> While intelligence community analysts were developing the assessment, Wolf wrote in the Forward, “we began to see a new, alarming trend of exploitation of lawful protests causing violence, death, and destruction in American communities.\n\n> “This anti-government, anti-authority and anarchist violent extremism,” as Wolf called it, caused “violence and destruction in our cities. The co-opting of lawful protests led to destruction of government property and has turned deadly.”\n\n> The DHS document reported 300 injuries in “increasingly pervasive” attacks on law enforcement personnel, who have been “assaulted with sledgehammers, commercial grade fireworks, rocks, metal pipes, improvised explosive devices and more.”\n\n> “This violence, perpetrated by anarchist extremists and detailed in numerous public statements that remain available on the DHS website, significantly threatens the Homeland by undermining officer and public safety – as well as our values and way of life.”\n\n> That’s all recognizably Antifa.\n\n> '''Predicting Antifa’s Near Future'''\n\n> DHS analysts park this fully triggered domestic terrorism threat under a rubric the government calls “Domestic Violent Extremists,” or DVEs. Just like white supremacists or violent Islamists that also fall under the DVE umbrella, the assessment predicts that anarchist extremists of Antifa ideology will continue to use violence to further political or social goals, which is the statutory definition of terrorism in the United States.\n\n> The DHS report sometimes asserts more than it explains, which could be justified by the possibility that the agency did not want to divulge sensitive or classified intelligence. For instance, the report asserts that these anarchist extremists have been “exploited by hostile nation-states, which seek to promote it through disinformation campaigns and sow additional chaos and discord across American society.” DHS leaves unexplained this last intriguing bit about hostile nation-states promoting anarchist extremist violence.\n\n> DHS would certainly count anarchist Antifa extremists as among DVEs that “will drive an elevated threat environment at least through early 2021.” There’s no reason to believe DHS doesn’t see Antifa’s violent anarchists in predicting that “some DVEs and other violent actors might target events related to the 2020 Presidential campaigns, the election itself, election results, or the post-election period. Such actors could mobilize quickly to threaten or engage in violence.”\n\n> Although the report doesn’t say which ones, it seems likely the report is referencing Antifa again in saying DVEs will “continue to target individuals and institutions that represent symbols of their grievances (Confederate statues anyone?), as well as grievances based on political affiliation or perceived policy positions.” \n\n> Imagine if Trump wins the presidency.",
			"time": 1602686281200,
			"files": "[{\"name\":\"0359c581-f329-4f59-9e69-4cda47c37318.jpeg\",\"thumb\":\"522c76d39916a06cb1755217da21f80776bcc6d5-thumb.jpg\",\"size\":93451,\"type\":\"image/jpeg\",\"original\":\"522c76d39916a06cb1755217da21f80776bcc6d5.jpg\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "8349780b-1576-4f79-bbef-e445afdfd434",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "de393328-2ddc-4f3b-867c-d7cc4a8f09d8",
			"body": "> '''Plenty of Hands for Juggling'''\n\n> Acting Secretary Wolf, in his Forward, seems to take Antifa every bit as seriously as white supremacy. Professional analysts are working to understand the threat, or so he said.\n\n> “We are still in the nascent stages of understanding the threat this situation poses to Americans, the Homeland, and the American way of life,” he wrote, referring to the violent, anti-government anarchist extremists tearing up the country.\n\n> White supremacy is a serious threat and deserves time in the spotlight, as well as resources. But so does Antifa. \n\n> In terms of priorities, the nation need not be forced to choose one over any other threat problem. The U.S. homeland security establishment is big enough to handle more than one threat at any given time.\n\n> The American media is big enough to equally report about all of them too.\n\n'''Source:'''  https://townhall.com/columnists/toddbensman/2020/10/13/beyond-white-supremacy-dhss-new-threat-assessment-also-warned-of-antifa-terrorism-n2577984\n'''Archive:'''  https://archive.is/N2Osd",
			"time": 1602686318300,
			"files": "[]"
		},
		{
			"id": "57c7721c-38d6-48f4-8036-c8ddc23721b5",
			"directory": "users/15DasCv6AFrnWQMah4XFoF5LDZwjtjy7ni",
			"uri": "creepingpolicestate",
			"thread": "780a35d3-67dc-407b-a274-7ff920416c6b",
			"body": "would have appreciated an actual link\nbut I searched and found it for you \nhttp://archive.is/YufTl",
			"time": 1602691079306,
			"files": "[]"
		},
		{
			"id": "5d39bbaf-04e4-40bd-9539-7508450a15f9",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "e4de35d9-8a7c-4812-a081-600dd9db572d",
			"body": "> With enough of a mandate, the Biden-Harris administration would also get rid of the Electoral College and two senators per state, resulting in the complete domination of the left-leaning urban centers. This is already the case in many states, such as California, where rural areas are effectively disenfranchised and all the statewide offices are held by Democrats, including around 75% of the State Legislature. The only Republican who could possibly win would be one who can fit into this new context, but even such a person could likely only win by taking advantage of some major Democrat screw up, like an economic depression or rampant corruption. In other words, once this happens, there’s no turning back. It’s over.\n\n> A Democrat victory would speed up the transformation of the educational system. Already, Critical Race Theory, which is basically anti-White hatred and guilt-tripping, has a strong foothold in the public schools and corporations. Trump outlawed teaching it to government workers, but that would change and there would likely be federal money for such programs at all levels of the educational system and for corporations.\n\n> Could the fact that Trump is attempting to appeal to Hispanics and Blacks undermine the GOP as the party of White people? It’s common for politicians to try to expand their base, and the fact is that these groups would benefit from many of the same policies that would benefit White America—opposing the defunding of police, curtailing immigration, and ensuring a robust economy (which Trump delivered on until the virus-induced lockdowns). Latinos in particular may be more open to Trump because of the national obsession with Blacks in the Summer of George.\n\n> No one is saying Trump is the savior, but the reality is that a great many White people are hopelessly caught up in the liberal/left mindset. This is especially true of educated Whites—the White working class has been solidly pro-Trump. These educated urban and suburban Whites are not going to vote Republican in the face of the constant stream of propaganda from the elite media and universities which has resulted in the left dominating the moral high ground, and in massive virtue-signaling and mindless conformity by great masses of liberal Whites whose hatred toward Trump has been fanned into a fever pitch by the elite media. No one on the dissident right saw Trump as the solution, but only as a stepping stone to a more explicitly White candidate. That is still possible, but only if Trump wins. In the meantime, trying to get non-Whites to vote for Trump makes a lot of sense.\n\n> In retrospect, it’s clear that the Trump victory in 2016 energized the left. There were riots in the immediate aftermath of the election and off-and-on throughout his term, crescendoing in the Summer of George—~130 straight days in Portland, with no serious effort to rein it in. The leftist media became nonstop Trump hate, and university professors routinely expressed their hatred in classrooms and in op-eds. Could one argue that a Biden victory would result in the civic peace and tranquility so eagerly desired by all those urban and suburban liberal Whites? I suppose it could, although in Portland the BLM-antifa have made leftist mayor Ted Wheeler a consistent target of their attacks, and they also turned on the mayor of Minneapolis, Jacob Frey; riots have continued to occur in cities dominated by very liberal-left mayors, such as New York and Atlanta.",
			"time": 1603434486744,
			"files": "[]"
		},
		{
			"id": "a1353d02-6539-4602-ac39-4f4141e9b59e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "e4de35d9-8a7c-4812-a081-600dd9db572d",
			"body": "> But the question is, would a Biden victory be good for the dissident right, and the answer is no. The worst possible outcome would be to return to elections between Hillary types and Jeb types. Flip a coin, it really wouldn’t matter. We don’t really want peace and harmony. Polarization is good because the bipartisan center-left—center-right consensus is suicide but would just take a little longer than if Trump hadn’t come on the scene. But now that he attained the presidency, a victory by the energized, radicalized left would result in hegemonic, authoritarian control by the left and a complete eradication of expressions of White identity politics, opposition to immigration, public discussion of the genetics of race, likely the eventual shutting down of sites like The Occidental Observer, and even putting dissenters in prison. When I hung out with radicals in the 1960s, it was common to hear opinions like “worse will be better”—if the present system gets worse, it will ultimately result in a revolution of the left. But when a revolution of the left gains power, as would happen if Biden-Harris win, they will arrogate all power to themselves and ensure that it won’t be possible to give it up. Revenge and punishment will the the order of the day. Just recently Robert Reich, former Obama administration Secretary of Labor, suggested Truth and Reconciliation commissions should be set up in the wake of a Biden victory on the model of South Africa after 1994—although what he really has in mind may more resemble Nuremberg and denazification that occurred after World War II.\n\n> A victory by Biden would be a green light for a return to power of neoconservatives like Bill Kristol, Max Boot, and Jennifer Rubin (who have more or less defected to the Democrats, but they would be happy to return to the GOP so that fanatically pro-Israel policies like war with Iran would be bipartisan). Another group eager to seize power in the wake of a Biden victory would be political operatives like those associated with the Lincoln Project, such as Rick Wilson and George Conway. Forget about a populist GOP. The GOP would once again be the party of Big Business (and hence liberal policies on legal and illegal immigration), wars for Israel, and tacit, if not overt, support for Critical Race Theory indoctrination. I realize that Trump has been gung-ho about doing things Israel wants, but he has stopped short of war and, in my opinion he has done all he can to extricate U.S. troops from the Middle East in the face of powerful opposition from the military (Trump accused them of gunning for post-career sinecures with defense contractors), the Israel Lobby, the media (where the left is dominated by liberal interventionists), and many politicians on both sides of the aisle. Just today Trump renewed pressure on the Pentagon to lower troop levels even further in order to fulfill his election promise, but the Pentagon is resisting the move.\n\n> On the other hand, another Trump victory would cement the populist wing of the party, where opposition to immigration is a major issue. Trump’s victories on immigration have been largely ignored by all sides, but as the LA Times notes,\n\n> Even more importantly, legal immigration has dropped by an astonishing 92 per cent in Fiscal Year 2020. Moreover, the fall in immigration workforce population predates Covid—apparently due to regulatory tightening. “Thanks, in part, to Trump’s (relatively) hard line on immigration, expressed basically via administrative measures, the Trump years saw a labor market where native-born Americans lost relatively fewer jobs than immigrants. This is not quite what Trump supporters had in mind in November 2016. But it’s something.”\n\n> Yes, and a Biden victory would end up being a radical reversal of these trends.\n\n> A Trump victory would exacerbate the social unrest and polarization that has already reached levels not seen at least since the 1960s, but another Trump victory would unleash far greater violence than in the wake of his 2016 win. We have already seen the huge BLM-antifa crowds in urban areas and seen what they can do. It would be much worse as the left, anticipating another victory, would be plunged into despair and become further radicalized. Rioting in all the major cities is to be expected; indeed, the NYPD has already issued a memo saying “We should anticipate and prepare for protests growing in size, frequency, and intensity leading up to the election.” Riots are sure to exceed the violence that occurred after the 2016 election and the riots of this past summer, and continue for long thereafter. Attempts to shut them down, especially by the feds would likely look a lot like civil war—a civil war that I think the right would win at this point. But the longer this thing festers, the less likely that becomes.",
			"time": 1603434509144,
			"files": "[]"
		},
		{
			"id": "34a89be8-ae50-4548-911b-3af78135b0b2",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "e4de35d9-8a7c-4812-a081-600dd9db572d",
			"body": "> As noted at the outset, the 2016 election was a huge defeat for our hostile elite, including the media. Another defeat would be an even greater catastrophe for them and a great victory for everyone else. Not only are the liberal-left media going all out to defeat Trump, now we have social media companies actively censoring information on covid from high administration officials and medical experts. Recently the social media companies and left-leaning newspapers and television (i.e., virtually all of them) have buried the New York Post series on the Hunter Biden-to-Joe Biden kickback scandal. The Trump administration is finally fighting back, suing Google under antitrust laws and reviewing Section 230 of the Communications Decency Act. “If Trump wins, Big Tech will know it’s screwed. The tech giants want to rig the election. Trump won’t forget that, and he will have the power and political capital to pay them back.” If Trump loses, this iron grip on information would be further empowered, even without going after the First Amendment. In effect, it would be a Ministry of Truth run by the private-sector and decidedly on the left.\n\n> Finally, the #1 reason to want a Trump victory would be simply to see massive crowds of Trump haters weeping on TV, a repeat of 2016, but much worse. I would just love to see the likes of Nicole Wallace, Joy Reid, Chris Hayes, Chris Cuomo, Don Lemon, and Lawrence O’Donnell, their faces grim, lashing out at Trump voters as racists, misogynists, haters, etc. Get out the popcorn!\n\n'''Source:'''  https://www.unz.com/article/why-its-important-for-trump-to-win/\n'''Archive:'''  https://archive.is/mihGO",
			"time": 1603434544344,
			"files": "[]"
		},
		{
			"id": "bfb479b4-c65e-41f9-88b6-c5e4abaa2165",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "e4de35d9-8a7c-4812-a081-600dd9db572d",
			"body": "pdf of Article\nKevin MacDonald is the guy who wrote 'Culture of Critique.'",
			"time": 1603434742227,
			"files": "[{\"name\":\"Why It’s Important for Trump to Win, by Kevin MacDonald - The Unz Review.pdf\",\"size\":188704,\"type\":\"application/pdf\",\"original\":\"16005bdda508a9aa153355b3008b595261cc9577.pdf\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "6b9fe227-d5b2-45bc-af47-aacedd1dd7c7",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "a02dbb30-07e2-48aa-b694-9072f6ef5707",
			"body": "https://archive.is/JBM2k",
			"time": 1603435090035,
			"files": "[]"
		},
		{
			"id": "c474acf9-4c3d-4774-8445-fd02d715f22c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Why It’s Important for Trump to Win",
			"body": "==Why It’s Important for Trump to Win==\n\n> KEVIN MACDONALD • OCTOBER 21, 2020\n\n> Trump’s 2016 victory was seen as nothing less than a cataclysm by the American establishment—the greatest shock to the system in memory and perhaps in the entire history of the Republic. After all, Trump was vehemently opposed by the entire establishment from far left to the neoconservative and Chamber of Commerce right. It was, one might say, a hostile takeover.\n\n> The left was on the cusp of going into end-game mode, so losing was incredibly frustrating, especially since Hillary Clinton was expected to win easily. But Trump won. Whatever you think of Trump’s actual performance, the fact is that throughout the campaign and since taking office the media and pretty much the entire left has been labeling him a Nazi and White supremacist (I wrote 5 articles for Vdare on this). And it’s continued, even into the recent presidential debate and the town hall hosted by Savannah Guthrie.\n\n> When Trump won, they were apoplectic — on the verge of complete victory with a “sure thing” Hillary victory, to having “White supremacists” in the White House. The tears that flowed after Trump won were replaced by anger and sheer hatred. The practical result was that Trump’s victory has had the effect of mobilizing the left.\n\n> And because this was framed from the beginning as a contest between the forces of good (our glorious multicultural future) versus evil (the “White supremacist” American past being promoted by the Orange Nazi in the White House), anything was justified. The media ought to throw out normal standards of journalism and do everything they can to destroy Trump’s image. Violence against Trump supporters and certainly against the dissident Right is entirely justified.\n\n> The result is a level of political polarization not seen in this country probably since the Civil War. But the polarization is what had to happen for any possible movement in the direction of the dissident right. The absolute worst thing would have been another Hillary-vs.-Jeb-type election where America keeps sleep-walking to Armageddon. The mobilization of the left has made clear the fault lines. This is about removing the traditional culture of America, and it is about removing Whites from the center of the American story. It is about replacement — first the monuments and the culture, then the people.\n\n> Solid majorities of Americans oppose removing the statues, and ratings for the now-politicized NFL, NBA, and MLB are way down, even though former sports fans are trapped in their homes with nothing much to do because of the pandemic. This means the traditional American majority is moving down the road toward being explicitly aware of what the game is. Reasonable White people watching this unfold cannot possibly believe that the glorious multicultural future will be anything but a disaster for White America. The hatred for White America that has been so obviously directed against activists on the dissident right is inevitably seeping through to “just plain White folks.” The hatred will only intensify when Whites have less power. And this means that the racialization of politics that we have emphasized so much here will accelerate. The ~60% of White America that votes Republican (not including Jews and other people grouped as Caucasians deriving from the Middle East and North Africa) will increase.\n\n> If the left wins they will go into end-game mode. They will establish a more-or-less permanent hegemony (via massive surge in legal and illegal immigration, amnesty to illegals and Dreamers, adding Puerto Rico and D.C. as states, and packing the Supreme Court). A Democrat victory would mark the end of the First and Second Amendments and likely lead to eventually locking up dissidents, as is already the case in Europe. There is now a rich body of academic literature by leftist academics (but I repeat myself) on reining in speech related to diversity. Their mantra is something like, “We won the intellectual war on issues related to race and gender. It’s all over, so anyone disagreeing with our pronouncements on race and gender can and should be shut down — your words do violence to muh feelings.” And liberals like Elena Kagan would love to use these ideas in majority opinions — indeed, she has already written on this.",
			"time": 1603435178985,
			"files": "[{\"name\":\"shutterstock_1593437923-600x337.jpg\",\"thumb\":\"a440fa9bfadffba396184e8b26d9649a763849ab-thumb.jpg\",\"size\":70737,\"type\":\"image/jpeg\",\"original\":\"a440fa9bfadffba396184e8b26d9649a763849ab.jpg\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "ff401bfb-77dc-4bb7-a7ee-8c1d68fc1924",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c474acf9-4c3d-4774-8445-fd02d715f22c",
			"body": "> With enough of a mandate, the Biden-Harris administration would also get rid of the Electoral College and two senators per state, resulting in the complete domination of the left-leaning urban centers. This is already the case in many states, such as California, where rural areas are effectively disenfranchised and all the statewide offices are held by Democrats, including around 75% of the State Legislature. The only Republican who could possibly win would be one who can fit into this new context, but even such a person could likely only win by taking advantage of some major Democrat screw up, like an economic depression or rampant corruption. In other words, once this happens, there’s no turning back. It’s over.\n\n> A Democrat victory would speed up the transformation of the educational system. Already, Critical Race Theory, which is basically anti-White hatred and guilt-tripping, has a strong foothold in the public schools and corporations. Trump outlawed teaching it to government workers, but that would change and there would likely be federal money for such programs at all levels of the educational system and for corporations.\n\n> Could the fact that Trump is attempting to appeal to Hispanics and Blacks undermine the GOP as the party of White people? It’s common for politicians to try to expand their base, and the fact is that these groups would benefit from many of the same policies that would benefit White America—opposing the defunding of police, curtailing immigration, and ensuring a robust economy (which Trump delivered on until the virus-induced lockdowns). Latinos in particular may be more open to Trump because of the national obsession with Blacks in the Summer of George.\n\n> No one is saying Trump is the savior, but the reality is that a great many White people are hopelessly caught up in the liberal/left mindset. This is especially true of educated Whites—the White working class has been solidly pro-Trump. These educated urban and suburban Whites are not going to vote Republican in the face of the constant stream of propaganda from the elite media and universities which has resulted in the left dominating the moral high ground, and in massive virtue-signaling and mindless conformity by great masses of liberal Whites whose hatred toward Trump has been fanned into a fever pitch by the elite media. No one on the dissident right saw Trump as the solution, but only as a stepping stone to a more explicitly White candidate. That is still possible, but only if Trump wins. In the meantime, trying to get non-Whites to vote for Trump makes a lot of sense.\n\n> In retrospect, it’s clear that the Trump victory in 2016 energized the left. There were riots in the immediate aftermath of the election and off-and-on throughout his term, crescendoing in the Summer of George—~130 straight days in Portland, with no serious effort to rein it in. The leftist media became nonstop Trump hate, and university professors routinely expressed their hatred in classrooms and in op-eds. Could one argue that a Biden victory would result in the civic peace and tranquility so eagerly desired by all those urban and suburban liberal Whites? I suppose it could, although in Portland the BLM-antifa have made leftist mayor Ted Wheeler a consistent target of their attacks, and they also turned on the mayor of Minneapolis, Jacob Frey; riots have continued to occur in cities dominated by very liberal-left mayors, such as New York and Atlanta.",
			"time": 1603435309343,
			"files": "[]"
		},
		{
			"id": "6e684b13-7c14-4c81-837d-b21fe94e5092",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c474acf9-4c3d-4774-8445-fd02d715f22c",
			"body": "> But the question is, would a Biden victory be good for the dissident right, and the answer is no. The worst possible outcome would be to return to elections between Hillary types and Jeb types. Flip a coin, it really wouldn’t matter. We don’t really want peace and harmony. Polarization is good because the bipartisan center-left—center-right consensus is suicide but would just take a little longer than if Trump hadn’t come on the scene. But now that he attained the presidency, a victory by the energized, radicalized left would result in hegemonic, authoritarian control by the left and a complete eradication of expressions of White identity politics, opposition to immigration, public discussion of the genetics of race, likely the eventual shutting down of sites like The Occidental Observer, and even putting dissenters in prison. When I hung out with radicals in the 1960s, it was common to hear opinions like “worse will be better”—if the present system gets worse, it will ultimately result in a revolution of the left. But when a revolution of the left gains power, as would happen if Biden-Harris win, they will arrogate all power to themselves and ensure that it won’t be possible to give it up. Revenge and punishment will the the order of the day. Just recently Robert Reich, former Obama administration Secretary of Labor, suggested Truth and Reconciliation commissions should be set up in the wake of a Biden victory on the model of South Africa after 1994—although what he really has in mind may more resemble Nuremberg and denazification that occurred after World War II.\n\n> A victory by Biden would be a green light for a return to power of neoconservatives like Bill Kristol, Max Boot, and Jennifer Rubin (who have more or less defected to the Democrats, but they would be happy to return to the GOP so that fanatically pro-Israel policies like war with Iran would be bipartisan). Another group eager to seize power in the wake of a Biden victory would be political operatives like those associated with the Lincoln Project, such as Rick Wilson and George Conway. Forget about a populist GOP. The GOP would once again be the party of Big Business (and hence liberal policies on legal and illegal immigration), wars for Israel, and tacit, if not overt, support for Critical Race Theory indoctrination. I realize that Trump has been gung-ho about doing things Israel wants, but he has stopped short of war and, in my opinion he has done all he can to extricate U.S. troops from the Middle East in the face of powerful opposition from the military (Trump accused them of gunning for post-career sinecures with defense contractors), the Israel Lobby, the media (where the left is dominated by liberal interventionists), and many politicians on both sides of the aisle. Just today Trump renewed pressure on the Pentagon to lower troop levels even further in order to fulfill his election promise, but the Pentagon is resisting the move.\n\n> On the other hand, another Trump victory would cement the populist wing of the party, where opposition to immigration is a major issue. Trump’s victories on immigration have been largely ignored by all sides, but as the LA Times notes,\n\n> Even more importantly, legal immigration has dropped by an astonishing 92 per cent in Fiscal Year 2020. Moreover, the fall in immigration workforce population predates Covid—apparently due to regulatory tightening. “Thanks, in part, to Trump’s (relatively) hard line on immigration, expressed basically via administrative measures, the Trump years saw a labor market where native-born Americans lost relatively fewer jobs than immigrants. This is not quite what Trump supporters had in mind in November 2016. But it’s something.”\n\n> Yes, and a Biden victory would end up being a radical reversal of these trends.\n\n> A Trump victory would exacerbate the social unrest and polarization that has already reached levels not seen at least since the 1960s, but another Trump victory would unleash far greater violence than in the wake of his 2016 win. We have already seen the huge BLM-antifa crowds in urban areas and seen what they can do. It would be much worse as the left, anticipating another victory, would be plunged into despair and become further radicalized. Rioting in all the major cities is to be expected; indeed, the NYPD has already issued a memo saying “We should anticipate and prepare for protests growing in size, frequency, and intensity leading up to the election.” Riots are sure to exceed the violence that occurred after the 2016 election and the riots of this past summer, and continue for long thereafter. Attempts to shut them down, especially by the feds would likely look a lot like civil war—a civil war that I think the right would win at this point. But the longer this thing festers, the less likely that becomes.",
			"time": 1603435331843,
			"files": "[]"
		},
		{
			"id": "5607ed76-ec39-4108-8686-5c27b8b13676",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c474acf9-4c3d-4774-8445-fd02d715f22c",
			"body": "> As noted at the outset, the 2016 election was a huge defeat for our hostile elite, including the media. Another defeat would be an even greater catastrophe for them and a great victory for everyone else. Not only are the liberal-left media going all out to defeat Trump, now we have social media companies actively censoring information on covid from high administration officials and medical experts. Recently the social media companies and left-leaning newspapers and television (i.e., virtually all of them) have buried the New York Post series on the Hunter Biden-to-Joe Biden kickback scandal. The Trump administration is finally fighting back, suing Google under antitrust laws and reviewing Section 230 of the Communications Decency Act. “If Trump wins, Big Tech will know it’s screwed. The tech giants want to rig the election. Trump won’t forget that, and he will have the power and political capital to pay them back.” If Trump loses, this iron grip on information would be further empowered, even without going after the First Amendment. In effect, it would be a Ministry of Truth run by the private-sector and decidedly on the left.\n\n> Finally, the #1 reason to want a Trump victory would be simply to see massive crowds of Trump haters weeping on TV, a repeat of 2016, but much worse. I would just love to see the likes of Nicole Wallace, Joy Reid, Chris Hayes, Chris Cuomo, Don Lemon, and Lawrence O’Donnell, their faces grim, lashing out at Trump voters as racists, misogynists, haters, etc. Get out the popcorn!\n\n'''Source:'''  https://www.unz.com/article/why-its-important-for-trump-to-win/\n'''Archive:'''  https://archive.is/mihGO\n--- the pdf attached is a copy of the article.",
			"time": 1603435378143,
			"files": "[{\"name\":\"Why It’s Important for Trump to Win, by Kevin MacDonald - The Unz Review.pdf\",\"size\":188704,\"type\":\"application/pdf\",\"original\":\"5fdef2172e8932177f5ca6680785f3311dd75ae1.pdf\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "3ac69d0b-49fa-4d24-82c6-4fd45d830ce8",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "da2b8b9d-f8f5-4ba2-ab88-d5d30d9de5bb",
			"body": ">>12d4ec89-11f1-4359-9380-c8016fd705fc\nOkay, lets say I wanted to start from scratch\nI'm using Linux\nI have a VPN\nI install a fresh version of Tor\nNow what?\nI've been trying to use ZeroNet since 8chan went down and its always been slow and shitty for me while other people have no problems.\nIt just doesn't make sense.",
			"time": 1604131539163,
			"files": "[{\"name\":\"1.png\",\"thumb\":\"1e0106c39af0b7d30c56b15b926e6ffcc8423eef-thumb.png\",\"size\":114569,\"type\":\"image/png\",\"original\":\"1e0106c39af0b7d30c56b15b926e6ffcc8423eef.png\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "3527aeeb-b3cc-45a9-bfe4-6909591f88ca",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "da2b8b9d-f8f5-4ba2-ab88-d5d30d9de5bb",
			"body": ">>227cf3e5-a13b-4df9-9590-953ef9cc9d9d\n>>a3986373-253f-4db4-9ba0-5e3342176c97\ngot an ssd in everything I use so file transfer speed is not an issue\nIts just that its not connecting well for some reason",
			"time": 1604473353857,
			"files": "[{\"name\":\"08globe.png\",\"thumb\":\"a66e487be4c0f2e750e225b166d888fa63a66f80-thumb.png\",\"size\":197899,\"type\":\"image/png\",\"original\":\"a66e487be4c0f2e750e225b166d888fa63a66f80.png\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "c1e5b62c-0a22-4bc3-9869-0818d629d553",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f5a85b93-6501-4faa-aefa-98db1390cf0a",
			"body": ">>f5a85b93-6501-4faa-aefa-98db1390cf0a",
			"time": 1604473573788,
			"files": "[{\"name\":\"blocked trump tweet election night.png\",\"thumb\":\"cf9f6b7f5eed8da52bf979327b8afc141e9e246c-thumb.png\",\"size\":54133,\"type\":\"image/png\",\"original\":\"cf9f6b7f5eed8da52bf979327b8afc141e9e246c.png\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "f4d059d6-f316-44b7-bcf4-e487f083f8d1",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "91678f42-76de-431d-900c-8ed23e9b6e4e",
			"time": 1604473859657,
			"files": "[{\"name\":\"trump is going to win or its turner diaries.png\",\"thumb\":\"22012eb19feacd78d3e353c9e3d46f1fa2dd54c0-thumb.png\",\"size\":566452,\"type\":\"image/png\",\"original\":\"22012eb19feacd78d3e353c9e3d46f1fa2dd54c0.png\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "671f63c3-ea97-47ac-a5f9-3aa70e138c2b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "8f771c07-8605-4b75-9c65-6f9dc010a39f",
			"body": ">>8f771c07-8605-4b75-9c65-6f9dc010a39f\n\"What is 'legal'? Legal is anything that the System does.  Legal is whatever the System allows to happen. Illegal is whatever the System does not allow others, outside the Clone System, to do... The System is legal. Therefore, 'legal' is simply the System.\"\n- Edwin Reynolds",
			"time": 1604474839657,
			"files": "[]"
		},
		{
			"id": "4b19685b-3abe-4ffe-bc08-9674fdfb2ed6",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "8ebf1756-88b3-4d92-bd65-bd89d6410f0b",
			"subject": "bored as fuck with this shit because it has gone on long enough",
			"body": ">>8ebf1756-88b3-4d92-bd65-bd89d6410f0b\nso basically, this shit is going to drag on until 9 December, when the Electoral College is required to vote regardless...\nborrrrrrrrrrr-ing\nI don't care\njust get it over with\nI hope someone blows them all up (Biden/Harris and Trump/Pence)\nIDGAF\nfuckit\n>>ebe31bbd-53c8-40aa-b743-d2bb14475c6e\nThe one thing that this election showed every voter (and the rest of the world for that matter) is that our 'election' process is completely corrupt and untrustworthy.  If you voted, who knows if your vote was counted or not? \nDo you?\nPro-tip\nNo.",
			"time": 1605252902144,
			"files": "[]"
		},
		{
			"id": "242f6900-6166-4858-b84b-9c9c9fbb98c4",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "6ea546bf-6658-48c0-af04-b6c02c4e082c",
			"body": ">>6ea546bf-6658-48c0-af04-b6c02c4e082c\nwould like to maintain a tor relay on a Raspberry Pi\nGot instructions?",
			"time": 1605253455932,
			"files": "[]"
		},
		{
			"id": "a4679778-7b5c-44b9-8ce5-7f8da8e89590",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "a6497066-e980-4251-9e86-ce2cfcf94c2e",
			"body": ">>a6497066-e980-4251-9e86-ce2cfcf94c2e\nOP does not provide links to his blog\nhttps://thezman.com/wordpress/?p=21799\nhttps://archive.is/VRWNo",
			"time": 1605725274356,
			"files": "[]",
			"last_edited": 1605726149102,
			"subject": null,
			"capcode": null
		},
		{
			"id": "2fa2a478-a870-4333-b286-08b96bc5b265",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "603aed50-d45d-4ed1-8b79-74f855ab85ae",
			"body": ">>603aed50-d45d-4ed1-8b79-74f855ab85ae\nunable to view webm\nplease re-upload and delete this thread",
			"time": 1605725398295,
			"files": "[{\"name\":\"unable 1.png\",\"thumb\":\"9d6237520ee5cf6d96c0f5913390ab38cbf737d4-thumb.png\",\"size\":26979,\"type\":\"image/png\",\"original\":\"9d6237520ee5cf6d96c0f5913390ab38cbf737d4.png\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "2f3f2e8b-c8dc-4fa6-9b89-775c766f1ff6",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "68d1749a-2b0b-440c-a721-a591f10c37a2",
			"body": ">>68d1749a-2b0b-440c-a721-a591f10c37a2\n>>b782fe9a-6f78-4513-9523-ad3cfe975c77\nUnable to view previews of what you posted\nwas able to view videos though",
			"time": 1605725548275,
			"files": "[{\"name\":\"unable 2.png\",\"thumb\":\"024a83d6bea980d485dc9f27368ab0f3fa14d317-thumb.png\",\"size\":98487,\"type\":\"image/png\",\"original\":\"024a83d6bea980d485dc9f27368ab0f3fa14d317.png\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]",
			"last_edited": 1605726527075,
			"subject": null,
			"capcode": null
		},
		{
			"id": "4702c18c-90a6-4605-ac63-5d99b9f413f8",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f64bd3ed-a40c-4bf9-abbc-f768111ba2be",
			"body": ">>f64bd3ed-a40c-4bf9-abbc-f768111ba2be\nOP doesn't provide links to his blog\n1.  https://thezman.com/wordpress/?p=21836\nhttps://archive.is/DoLFg\n2.  https://thezman.com/wordpress/?p=21843\nhttps://archive.is/MMILv",
			"time": 1605726126574,
			"files": "[]"
		},
		{
			"id": "de6047f5-512b-432d-8271-5012d31db5c5",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f03f106c-275c-40e4-9845-861968280195",
			"body": "THIS",
			"time": 1605727209750,
			"files": "[{\"name\":\"Electionchangemymind.gif\",\"thumb\":\"fa8e55343368e11ae392cc73f3e58aec057ec2e0-thumb.jpg\",\"size\":396340,\"type\":\"image/gif\",\"original\":\"fa8e55343368e11ae392cc73f3e58aec057ec2e0.gif\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "5c03af70-a7d2-4a1b-9e8c-80318d9f097e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "8ab293a8-388e-4df2-91cb-bd48f2098c28",
			"body": ">>8ab293a8-388e-4df2-91cb-bd48f2098c28\n\nYou will never be a real woman. You have no womb, you have no ovaries, you have no eggs. You are a homosexual man twisted by drugs and surgery into a crude mockery of nature’s perfection.\n\nAll the “validation” you get is two-faced and half-hearted. Behind your back people mock you. Your parents are disgusted and ashamed of you, your “friends” laugh at your ghoulish appearance behind closed doors.\n\nMen are utterly repulsed by you. Thousands of years of evolution have allowed men to sniff out frauds with incredible efficiency. Even trannies who “pass” look uncanny and unnatural to a man. Your bone structure is a dead giveaway. And even if you manage to get a drunk guy home with you, he’ll turn tail and bolt the second he gets a whiff of your diseased, infected axe wound.\n\nYou will never be happy. You wrench out a fake smile every single morning and tell yourself it’s going to be ok, but deep inside you feel the depression creeping up like a weed, ready to crush you under the unbearable weight.\n\nEventually it’ll be too much to bear - you’ll buy a rope, tie a noose, put it around your neck, and plunge into the cold abyss. Your parents will find you, heartbroken but relieved that they no longer have to live with the unbearable shame and disappointment. They’ll bury you with a headstone marked with your birth name, and every passerby for the rest of eternity will know a man is buried there. Your body will decay and go back to the dust, and all that will remain of your legacy is a skeleton that is unmistakably male.\n\nThis is your fate. This is what you chose. There is no turning back.",
			"time": 1605729447263,
			"files": "[]"
		},
		{
			"id": "35591223-c655-49c2-8236-53590987689f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f03f106c-275c-40e4-9845-861968280195",
			"body": "It doesn't matter who 'won' the election though, unless of course you are a MIGA-Tard or a pro-China shill.\n\nBiden:\n> Campaigns\n> Blah blah blah\n> Progressive agenda\n> Free shit etc...\n> Bernie's good too\n> makes great promises\n> yay\n> takes office\n> same old neo-con bullshit\n> increases the class divide (more peasants and more oligarchs and less middle class)\n> promotes technological oligarchy (google/jewtube, twatter, faceberg, amazon, etc...)\n> technical oligarchies are the keepers of 'Freeze Peach'\n> Wars for Israel - Reboot Edition\n> no substantial campaign promises kept - maybe a few of the little ones \n(in Biden's case, he didn't make many campaign promises that I know of, so he doesn't have to keep any)\n> Same Old Neo-Con Bullshit\n> May or May Not mandate gorona vaccines\n> Biden continues presidency\n\neither\n\n__2024__\n> Biden is still in office\n> 2024 Election cycle\n> May/June 2024 Antifa and BLM amazingly come out of the woodwork again\n> Biden says, \"Stahhhhp.\"\n> They stop it\n> Biden wins election again\n\nor\n\n__2021__\n> Biden takes office\n> 1 to 2 years later in 2022/2023\n> 25th Amendment - he's fucking retarded\n> Kamala takes over\n> Mandates Vaccines\n> Takes your guns\n> WW III\n> Uses Nukes because Feminism Wymyn Stronk Too\n\nBiden is what, 78 years old right now?\n> Born November 20, 1942\nso in 4 years he will be 82?\nand another 4 years 86?\n==C'Mon Man==\nI don't see him holding onto the office.\n\nOne anon made a prediction around 2 or 3 years ago where there may be a big happening in or around May 2023.  Makes sense, because that's when it gets warmer and all the niggers start wandering outside again.\nIf Kamala takes over the White House, and she goes for a gun-grab, there's a very high probability that this may happen.\n\nThere seems to be a high probablility that Kamala Harris will be taking over Biden's seat in the next 2 years.\nThat is my prediction. (probably many others' too)",
			"time": 1607531230464,
			"files": "[{\"name\":\"ewwww.jpg\",\"thumb\":\"c38581469b2cf2ebe2d90969adbbf26e17f1630a-thumb.jpg\",\"size\":80327,\"type\":\"image/jpeg\",\"original\":\"c38581469b2cf2ebe2d90969adbbf26e17f1630a.jpg\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]",
			"last_edited": 1607532137064,
			"subject": null,
			"capcode": null
		},
		{
			"id": "de9dc4cb-801d-4478-bbff-4a8722106b43",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "78f4c6a1-312c-48bd-93f0-9213effee98a",
			"body": ">>ad6d2cfe-4835-44be-84bf-10cbc74be274\nnice to hear this perspective from someone else\n> Interesting speculation now :) What would the political fortunes of a Congressman who had killed 4 rioters entering his office be? Maybe our next president?\n> congressman never gets out of his chair and continues to work regardless, shuffling papers, and answering phones\nwould be Chad in Chief",
			"time": 1610162384059,
			"files": "[]"
		},
		{
			"id": "a1d72e7c-8909-434b-9053-3de7fbce46d3",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c600bfa9-cd80-4609-8ced-1c9c05cf0260",
			"body": ">>c600bfa9-cd80-4609-8ced-1c9c05cf0260\nI would turn a blind eye\nI wouldn't say anything\nI would quietly let it happen",
			"time": 1610164397716,
			"files": "[]",
			"last_edited": 1610164445316,
			"subject": null,
			"capcode": null
		},
		{
			"id": "727f28d7-e7ed-4115-8fda-ebd98009451e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Please help to improve the quality of this board",
			"body": "Asking politely - Please help to improve the quality of this board by using the guidelines in this little info-graphic that I used to shill on Infinity.\nOne thing that providing the text of the article does, is that although links are provided, the next user does not have to necessarily have to click on the link, such as a Washington Post link, \na.) giving it clicks and traffic, and,\nb.) being tracked by (((them)))\nReading the article, copied, pasted, and greentexted inside 08chan helps with not only your security, but with the next anon's security.\nAnother thing it does is improve the attractiveness of the board for newfags and sets a standard for when they go back to sites such as halfchan\nRemember to provide an archive link by going to:\n> archive.today\n> archive.is\n> archive.fo\nThere are a few more archive.**'s there but I forget them at the moment.\nAsking for some friends.\n-\nI've had to switch identities several times, due to re-installing ZeroNet on my computer, not because something went wrong, but because I re-installed my OS.  I don't stop in here as often as I used to when this first got shilled when 8ch.net went down. \n08chan was already up, possibly a year before Aug 2019, when I showed up here.\nBe sure to blacklist certain boards that you know you will not visit, or that may contain questionable material.\nAlso be sure to use a VPN or Tor when accessing 08chan, 0chan, (which is in dire need of a catalog) and I'm not sure if there is another one. \nHere is 0chan's link\nhttp://127.0.0.1:43110/0chan.bit/\nAre there any other good or semi-good ones?\npls provide links.\nHave a great day and enjoy the sunshine!",
			"time": 1611546914597,
			"files": "[{\"name\":\"posting_guide_8ch_embed.png\",\"thumb\":\"c8f5557a097e61b8be72e7e4b6dce48d1b4b335f-thumb.png\",\"size\":1932239,\"type\":\"image/png\",\"original\":\"c8f5557a097e61b8be72e7e4b6dce48d1b4b335f.png\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "8ac26e74-bd64-4106-b57a-005fc89467a0",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "9ba27438-fe1b-498e-813b-8197307cbea9",
			"body": ">>d4c1a716-2e8a-4c7c-94c7-f8a8b7807c82\nI shilled this on 4/g/ yesterday",
			"time": 1611576471624,
			"files": "[{\"name\":\"Shilling_ZeroNet.png\",\"thumb\":\"5873cbee461032bc7a5674f2773cdf99e8d69c65-thumb.png\",\"size\":200499,\"type\":\"image/png\",\"original\":\"5873cbee461032bc7a5674f2773cdf99e8d69c65.png\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "e7c98f70-5e03-42af-bf79-6392fc569f38",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"body": "==Sen. Hawley: It’s time to stand up against the muzzling of America==\n''By Senator Josh Hawley - January 24, 2021 ''\n\n> Have you checked your social credit score lately? You might want to. Mine seems to have taken a nosedive this month. You might want to see how yours is doing.\n\n> Everyone knows what a credit score is. But social credit scores are new. They’re the latest corporate import from Communist China, where government and big business monitor every citizen’s social views and statements.\n\n> And they’re the latest form of cancel culture in this country, as corporate monopolies and the left team up to shut down speech they don’t like and force their political agenda on America. For those who still believe in free speech and the First Amendment, this is the time to take a stand.\n\n> Like the old-fashioned kind of credit score, your social credit requires a lot of maintenance. You’ll need to get good grades in school and stay out of trouble with the law. But that’s just the start — you have to earn your right to live in polite society these days. So if you want to get a good job, stay at hotels and be served at restaurants, you will need to do a few other things. You will need to voice the right opinions. You will need to endorse the right ideas. You will need to conform. That’s what the corporate chieftains tell us, anyway.\n\n> They tried to reprimand me this month because I didn’t. On behalf of the voters of my state, I raised a challenge to the presidential electors from Pennsylvania after that state conducted the election in violation of the state constitution. Maybe you agree with me. Maybe you don’t. But whatever your view, corporate America’s rush to cancel those it dislikes should trouble you.\n\n> In my case, it started with leftist politicians demanding I resign from office for representing the views of my constituents and leading a democratic debate on the floor of the Senate.\n\n> Taking that cue, a corporate publishing house then canceled a book it had asked me to write. Ironically enough, the book is about political censorship by the most powerful corporations in America. (And will be published by an independent publishing house.) Now corporate America is canceling my political events, because two parties are apparently one too many for their taste.\n\n> It will get worse. The tech titans have already booted dozens of conservatives off social media, and if they have their way, half the House Republican conference will be expelled from Congress. The corporate titans seem to believe that the only way to get a democracy to their liking is to eliminate all threats to the Democratic Party’s unified control of government.\n\n> The alliance of leftists and woke capitalists hopes to regulate the innermost thoughts of every American, from school age to retirement. And they’ve trained enforcers of the woke orthodoxy to monitor dissent or misbehavior. A “Karen” who cuts the wrong person off in traffic gets followed home on a livestream and shamed into crying for mercy as her license plate is broadcast to an online horde eager to hound her out of a job.\n\n> Everyone knows it can happen to them, so everyone shuts down. The circle of trust narrows. Conversations — too easily recorded — shift to encrypted messaging apps. For now. Until those get banned too for interfering in efficient social credit markets.\n\n> For some time, conservatives, recognizing that we’re now the counterculture, indulged in the delusion that we could opt out of all this. We’d send our kids to schools that don’t teach all the woke stuff. We’d make our friends at church, not at work, and take comfort that trust and openness were still possible in communities of shared purpose. We’d vote our conscience, because the ballot box was something no election could take from us.\n\n> And if ever our political organizing were impeded by censorship — say, by the big tech giants — we could build our own platforms.\n\n> But the left and the corporations are challenging all of this now. Your “conservative” social platform isn’t worth much when Amazon can shut it down. Your vote may still be yours, but if your party is denied the means to effectively organize by corporate monopolies, it’s not going to win. Your church, well, you can still attend for now, but go to the wrong church and you may not have a job in a few years.\n\nmore...",
			"time": 1611613291953,
			"files": "[{\"name\":\"e69831043d8811bd98525c98e51435ef075a3e30.jpg\",\"thumb\":\"05f518a8ef97ba45034000cc0254d048e01eb56b-thumb.jpg\",\"size\":98987,\"type\":\"image/jpeg\",\"original\":\"05f518a8ef97ba45034000cc0254d048e01eb56b.jpg\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "c295877c-5f06-4205-84bc-33375342730e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "e7c98f70-5e03-42af-bf79-6392fc569f38",
			"body": "...continued\n\n> Here’s the good news. The cancel culture agenda will only succeed if we let it. We need live in fear only if we choose to say nothing. In this time of testing, conservatives must not shrink back. We need to stand up for the right of every American to be heard.\n\n> We need to stand up for the basic principles that join all Americans together — the right to speak freely, to debate openly, and to address our differences graciously without fear of being silenced or punished for dissenting views.\n\n> I for one am not going to back down. My book will be published, and I will continue to represent the people of my state without fear or favor, whatever the left or the corporations say.\n\n> The powerful see in the present moment an opportunity to consolidate their control over society and to squelch dissent. That means those who believe in the First Amendment and the fundamental principles of American liberty must now take a stand, while we still can.\n\n''(Sen. Josh Hawley is a Republican representing Missouri.)''\n\n'''Source:'''  https://nypost.com/2021/01/24/its-time-to-stand-up-against-the-muzzling-of-america/\n'''Archive:'''  https://archive.is/lA1TP",
			"time": 1611613394994,
			"files": "[]"
		},
		{
			"id": "1500f3c9-16fc-4834-a26b-96d2bf968d7b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"body": "==Michigan Announces Re-Opening of Restaurants and Bars Two Days After Biden's Inauguration==\nBy Bobby Burack - 23 Jan 2021\n\n> Friday, Gov. Gretchen Whitmer announced that Michigan is reopening indoor dining on Feb. 1.\n\n> The order, which runs through Feb. 21, says restaurants and bars will be allowed to offer indoor dining at 25% capacity with up to 100 people and must close by 10 p.m. In addition, tables must be six feet apart with no more than six people per table.\n\n> “The science around this virus is settled, and if we can all wear masks and be very smart about congregating, and not do it unless it’s necessary, washing our hands, doing that social distancing, we will be in a strong position in a few weeks,” Whitmer said during a press conference. “And we’ll be able to do more. That’s the hope.”\n\n> Ahh, the science. And, maybe, a little bit of timing. Whitmer, whose insane lockdown restrictions have challenged even Gavin Newsom’s, announced her state is lifting a major ban just two days after Joe Biden’s inauguration.\n\n> “That is just a coincidence,” the New York Times is probably drafting as we speak.\n\n> Social media did say Biden’s inaugural address made them want to run through a wall. Did Whitmer run back to Lansing so pumped that she decided to let the state live a bit again? I don’t make guesses, but I was glad to see Whitmer’s so happy on #InaugurationDay.\n\n> Whatever new evidence in the fight against COVID was found this week, Washington, D.C. Mayor Muriel Bowser noticed it too. Friday, the same day of Whitmer’s announcement, Bowser lifted the ban on indoor dining in D.C.\n\n> Whitmer has always wanted to be a trend-setter, and perhaps other unreasonable governors will now follow her lead. Though if you live in California, don’t get too excited. Due to Gavin Newsom’s unbelievable level of incompetence, his state must first fight its way out of ranking dead-last in administering the vaccines.\n\n> As of now, there is no word on what Michigan’s latest COVID ruling means for Whitmer’s husband and his boat.\n\n'''Source:'''  https://www.outkick.com/whitmer-michigan-biden/\n'''Archive:'''  https://archive.is/ntClR",
			"time": 1611614005194,
			"files": "[{\"name\":\"Screenshot_2021-01-25_16-29-47.png\",\"thumb\":\"7c900a0a94517fae7bac88c79aa3de48f28eafaa-thumb.png\",\"size\":307260,\"type\":\"image/png\",\"original\":\"7c900a0a94517fae7bac88c79aa3de48f28eafaa.png\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "54802eb8-cf7d-47f5-9a2d-5d3a315c3537",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f4e37f32-1d0b-4b03-bbe6-8156fcbb8b8a",
			"body": "> But AOC? She needs to become uninsurable and raped by a pack of niggers.\nhahaha toplel man\nI think the same way dude\nAs far as making someone 'uninsurable,' the problem is making them that way.\nThey are already working on giving us a social credit score, like they do in china, but how can the tables be turned on them, is what I am asking.",
			"time": 1611614446716,
			"files": "[]"
		},
		{
			"id": "96fa4faf-292b-4282-9f74-9d47cdcec1fa",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "7c936fd7-1245-4f70-8910-4c836ed2a5b5",
			"body": ">>7c936fd7-1245-4f70-8910-4c836ed2a5b5\nLink 1 - \n> A viral video forced a wealthy Texas suburb to confront racism. A 'silent majority' fought back.\n> Jan. 22, 2021\nhttps://archive.is/X0PXq\n\nLink 2 - \n> Carroll ISD School Board Hosts Special Meeting to Address Offensive Video Made by Students\n> Published November 2, 2018 • Updated on January 22, 2021\nhttps://archive.is/ruJXr",
			"time": 1611621485449,
			"files": "[{\"name\":\"cmon-man.png\",\"thumb\":\"8f5d1b57b53b58d7f2308ce942ace71167e26759-thumb.png\",\"size\":1324406,\"type\":\"image/png\",\"original\":\"8f5d1b57b53b58d7f2308ce942ace71167e26759.png\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "7c9eec2b-43f7-47f8-93ee-c54455f6d6a1",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "1500f3c9-16fc-4834-a26b-96d2bf968d7b",
			"body": ">>fb17e8c4-bd34-444c-bde6-cbe73fb67872\n     Actually a close friend of mine texted me a twatter link to something else and I happened to see this in the 'feed' below the post that he sent me seeing that I never made a new twatter account after my last account was permabanned by twitter niggers for the millionth time.  I even had a burner phone number for it.\n     My friend had been a regular run of the mill Democrat, but turned to Trump during the past 2 1//2 years, mainly concerned about the attacks he had been getting from 'Democrats,' so I eventually started talking with him about the 'Jewish Question,' and he seems to see the problem now too.  Its just awful.  Its everywhere.\n     There's so much going on now that I can't even put into words.\n     What is somewhat bothersome is the fact that Toe Jiden blocked the permit for the Keystone Pipeline usage, or something to that effect, and has banned or will ban fracking, which will not only put those people out of work, it will also increase the U.S. dependence on Middle-East Oil.  Not only will the prices go up, but we will have more wars now in the Middle East with 'Oil' as the usual backdrop for everyone to see, being the unspoken reason of why we have to go back to the Middle East, while behind the scenes, the kikes and sandniggers are working out a deal that just turns the U.S. into more of a cash cow.",
			"time": 1611622730906,
			"files": "[{\"name\":\"1611567479005.jpg\",\"thumb\":\"9d0a8b46d44fc581424c03fbcd4ffad888bcea3d-thumb.jpg\",\"size\":157143,\"type\":\"image/jpeg\",\"original\":\"9d0a8b46d44fc581424c03fbcd4ffad888bcea3d.jpg\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "93f81e9e-367b-43e8-8ee0-487704463f08",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "a6664de5-da5a-44e0-82ff-2d79ee6a8f3e",
			"body": ">>a6664de5-da5a-44e0-82ff-2d79ee6a8f3e\ninteresting",
			"time": 1611623311354,
			"files": "[]"
		},
		{
			"id": "6f0a7620-e273-44f4-8198-671461aa9364",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "39233f08-a69d-4ed2-bd90-d2f6cea21023",
			"body": "this is big\nthis is related to that subreddit 'wallstreetbets' https://www.reddit.com/r/wallstreetbets/\nthey are the ones who fucked these kikes\nI've been following this lightly the past few days.  It keeps on popping up.  They started talking about it on 4/biz/\n\n==GameStop stocks: US hedge fund pulls out after heavy losses==\n'''Melvin Capital Management had bet on failure of store before small investors sent shares soaring'''\n''How GameStop found itself at the centre of a battle between Wall Street and small investors''\n\n\nMark Sweney - Wed 27 Jan 2021 18.36 GMT\n\n> A US hedge fund that has invested heavily betting on the failure of the struggling video game store chain GameStop has pulled out after an army of small investors sent its shares soaring and cost the financial firm a fortune.\n\n> Melvin Capital Management, one of a number of Wall Street firms that stood to make money for investors if GameStop’s shares plummet, has told CNBC it has closed out its short position after taking a huge loss.\n\n> The hedge fund, which has lost 30% of the $12.5bn (£9.1bn) it manages this year, was outmanoeuvred by an army of Reddit users from the forum “Wall Street Bets”. The group sought to punish the financial giants betting against GameStop by sending the chain’s shares soaring.\n\n> The David and Goliath battle has attracted the attention of Elon Musk, the Tesla and SpaceX chief executive who earlier this month became the world’s richest person, who joined the fray posted tweet earlier this week about the company and its Reddit supporters. His intervention reportedly helped the company’s stock surge 50% in after hours trading on Tuesday. Musk, who is affectionately referred to as “Papa Musk” by supporters on the stock trading discussion group, tweeted the single word “Gamestonk” and a link to the Reddit group. “Stonks” is a tongue-in-cheek term for stocks that is widely used on social media.\n\n> The army of traders have declared war on the Wall Street companies looking to “short” GameStop, which involves “borrowing” a company’s shares and selling them with the intention of buying them back cheaper when the company’s share price falls, and it has proved to cost them billions.\n\n> Last week short-seller Citron Research placed a bet against GameStop calling it a “failing mall-based retailer”, and predicting its shares would fall to $20 because it is “pretty much in terminal decline”. It prompted the Reddit traders to push the retailer’s stock through the roof, declaring: “We want to see the loss porn”, which resulted in the short sellers being caught in what traders refer to as a “gamma squeeze” they cannot escape.\n\n> Andrew Left, Citron’s founder, has now given up shorting the stock citing harassment by GameStop supporters, according to CNN. Melvin Capital threw in the towel just days after raising a $2.75bn bailout from backers including Point72 Asset Management, run by the New York Mets owner, (((__Steve Cohen__))).\n\n> A year ago shares in GameStop, which plans to close 450 stores this year, traded at $3.25 each. Now the 37-year old chain is one of the hottest stocks on Wall Street trading at $324, up more than 700% since 1 January. Supporters of GameStop are now in victory mode as the rocketing stock has seen its market value hit $22bn. The US betting site MyBookie as called it the “short squeeze of the century” and reckons GameStop’s stock is on track to hit $420-a-share by April.\n\n> Amateur traders have been boasting of their wins, with one telling the Reddit forum: “I can now write my mom a check and put my sister through lymes [disease] treatment.”\n\n> The meteoric rise has been fuelled by small investors snapping up the stock when it was cheap, using the trading app Robinhood and others services, seeing it as an opportunity to make money if the company can recover.\n\n> Small investors began piling in last September after Ryan Cohen, founder of the online pet food giant Chewy, took a 13% stake in GameStop and began lobbying for it to go digital and become a serious rival to Amazon.\n\n> However, analysts warn of concerns over a potentially unsustainable bubble emerging off the back of gossip over actual financial performance.\n\n> “Amateur investors on social media platform Reddit are engaged in a battle with hedge funds which are shorting GameStop and several other stocks including Blackberry and Virgin Galactic,” said Russ Mould, investment director at AJ Bell. “[This] raises fears about a bubble in the markets given these stocks are being backed on little tangible news.”\n\n'''Source:'''  https://www.theguardian.com/business/2021/jan/27/gamestop-stocks-us-hedge-fund-pulls-out-after-heavy-losses\n'''Archive:'''  https://archive.is/dTc4u",
			"time": 1611781310494,
			"files": "[{\"name\":\"3500.jpg\",\"thumb\":\"9c7c3f68f97ce14024cc4fd5b2dfc02062732308-thumb.jpg\",\"size\":30768,\"type\":\"image/jpeg\",\"original\":\"9c7c3f68f97ce14024cc4fd5b2dfc02062732308.jpg\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "0f34c3d9-c974-4f0a-a46f-8b8dc6740df8",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "39233f08-a69d-4ed2-bd90-d2f6cea21023",
			"body": "and of course, this:",
			"time": 1611781486494,
			"files": "[{\"name\":\"screenshot-boards.4chan.org-2021.01.25-22_43_07.png\",\"thumb\":\"1bc45e425f9b5a34410b472cbc22a194f75ce7bd-thumb.png\",\"size\":2511296,\"type\":\"image/png\",\"original\":\"1bc45e425f9b5a34410b472cbc22a194f75ce7bd.png\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "febfe832-7ba9-4bbe-9a93-f19d3f5532fc",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"body": "==Facebook tries to remind users about benefits of data collection ahead of Apple privacy change==\n\n''By Samantha Murphy Kelly, CNN Business - Updated 0314 GMT (1114 HKT) February 2, 2021''\n\n> (CNN Business)Facebook said Monday that it is testing a new pop-up alert for iPhone and iPad users that stresses the benefits of its apps collecting personal data. The test comes ahead of an Apple privacy change with the potential to upend the social network's core business.\n\n> Apple (AAPL) is set to introduce a new requirement for users to give explicit permission for apps to track them across the internet, a move that has roiled Facebook, which relies on data collection to target ads.\n\n> Now, Facebook plans to show a prompt \"of our own, along with Apple's\" in an effort to show users how personalized ads \"support small businesses and keep apps free,\" the company said in an update Monday to an older blog post called \"Speaking Up for Small Businesses.\"\n\n> \"As we shared in December, we disagree with Apple's approach, but will be showing their prompt to ensure stability for the businesses and people who use our services,\" Facebook said in the post.\n\n> For Facebook (FB), the stakes of Apple's new privacy change couldn't be higher. The social media company, which makes almost all of its revenue from advertising, has repeatedly warned investors that Apple's software changes could hurt its business if users reject tracking permissions.\n\n> In December, Facebook took out ads in The New York Times, Wall Street Journal and Washington Post, saying the requirement could be \"devastating\" to millions of small businesses that advertise on its platform. It also held a press event to trot out small businesses opposed to the change and debuted a new hashtag to discuss it.\n\n> Mark Zuckerberg, Facebook's CEO and cofounder, hammered a similar point on a conference call with analysts last month to discuss the company's most recent earnings report.\n\n> \"Apple has every incentive to use their dominant platform position to interfere with how our apps and other apps work, which they regularly do, to preference their own,\" Zuckerberg said. \"This impacts the growth of millions of businesses around the world, including with the upcoming iOS 14 changes. Many small businesses will no longer be able to reach their customers with targeted ads.\"\n\n> While this latest move may seem like yet another shot fired at Apple, Facebook is taking Apple up on its offer for any developer to explain why it wants certain permissions for tracking. \"We feel that people deserve the additional context, and Apple has said that providing education is allowed,\" Facebook said in the blog post.\n\n> On Apple's privacy and data webpage, the company said developers are allowed to do this \"so long as you are transparent to users about your use of the data in your explanation. ... Apps must respect the user's permission settings and not attempt to manipulate, trick, or force people to consent to unnecessary data access.\"\n\n> Facebook did not immediately respond to a request for comment. Apple declined to comment.\n\n> In a December tweet, Apple CEO Tim Cook shared an image of what Facebook's app tracking transparency messaging could look like. Under the permissions prompt, the example language said: \"Here, in addition to other screens, Facebook can explain why users should allow tracking.\" Users can then \"ask app not to track\" or \"allow.\"\n\n> ''Kaya Yurieff contributed to this report.''\n\n'''Source:'''  https://edition.cnn.com/2021/02/01/tech/facebook-transparency-alert/index.html\n'''Archive:'''  https://archive.is/HTXdE",
			"time": 1612272145924,
			"files": "[{\"name\":\"Screenshot_2021-02-02_07-16-17.png\",\"thumb\":\"718ab899bcf7e0fdb0804f71fb34c1a1a3c9bc6d-thumb.png\",\"size\":391292,\"type\":\"image/png\",\"original\":\"718ab899bcf7e0fdb0804f71fb34c1a1a3c9bc6d.png\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "39f93e32-2f8d-4e3e-a677-277deddc295a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6e02f7a8-494b-4696-b7b0-3eb2277ea3e7",
			"body": "bumping for significance",
			"time": 1612272423680,
			"files": "[]"
		},
		{
			"id": "55540a06-3c5e-4fdc-a19d-9a2a66f932db",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6e02f7a8-494b-4696-b7b0-3eb2277ea3e7",
			"body": ">>cb983391-43b9-4315-a2ef-c10d52937d1c\nwell,\nthey were fired for wanting to keep it a natsoc board\n>>b87bd208-26ad-499e-a606-9651bfe441bc\ncould you re-seed that image please?\nI would like to see it.\n\nas far as norms invasion\nthey are too afraid to come here because they were told too many stories about CP being automatically downloaded to their computers.\nWouldn't be surprised if a user from here started that to keep them out.",
			"time": 1612675228917,
			"files": "[{\"name\":\"reddit-nigger.jpg\",\"thumb\":\"cbbb94b6ab977f910514d1e6877284688722c0cb-thumb.jpg\",\"size\":221957,\"type\":\"image/jpeg\",\"original\":\"cbbb94b6ab977f910514d1e6877284688722c0cb.jpg\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "8c2a0098-22c8-441a-a0e5-ae77f102c33e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "e092411b-32ce-4cf3-b53e-4398179471b2",
			"body": ">>e092411b-32ce-4cf3-b53e-4398179471b2\nnot if you don't pay taxes",
			"time": 1612676085185,
			"files": "[]"
		},
		{
			"id": "c8482831-3b89-4ac3-8595-50fe239463b9",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "68676fee-50ea-47eb-ad41-980147eaac96",
			"body": ">>68676fee-50ea-47eb-ad41-980147eaac96\nyou aren't staying on the page long enough after posting for your images to seed",
			"time": 1612683511586,
			"files": "[]"
		},
		{
			"id": "21a307a7-96db-44f0-aa04-dd39b699afd5",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6e02f7a8-494b-4696-b7b0-3eb2277ea3e7",
			"body": ">>1ccc2d6a-7c1e-431e-b459-840d886a3cf0\nplease\nplease seed your images better\njust takes a few seconds of waiting time to ensure that it went 5/5\nI can't view any of your OP pics",
			"time": 1612683679474,
			"files": "[{\"name\":\"1593670512553.jpg\",\"thumb\":\"110f2fe113060253fe95b662cce5163d23ee6718-thumb.jpg\",\"size\":1013158,\"type\":\"image/jpeg\",\"original\":\"110f2fe113060253fe95b662cce5163d23ee6718.jpg\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "ba297d0f-2911-4c98-8b0d-469fcf4d3975",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "bcb36faf-9de3-4074-94e5-aa64492a2a9e",
			"body": ">>68e56282-a59d-4924-8a35-766ec0798d0f\ndude - are you just blogging constantly or what?\nI'm seriously asking.\nnot even joking.\ntalk to you soon.",
			"time": 1613443914952,
			"files": "[]"
		},
		{
			"id": "4a3eb87a-dfb6-4ab5-bb8d-b91ed7775562",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "bcb36faf-9de3-4074-94e5-aa64492a2a9e",
			"body": ">>f3c366bf-aa8b-481c-8790-f0d2d1adc4b8\ncan't view webm btw",
			"time": 1613445998152,
			"files": "[]"
		},
		{
			"id": "057acbe8-d76f-4b5b-a83c-5b9c8b72aafd",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "c2c76494-2321-41dc-b88c-04568b92b864",
			"time": 1613463476647,
			"files": "[{\"name\":\"no.png\",\"thumb\":\"d8c45f9e27af39051abd7ed92f69f2ca3ed08fad-thumb.png\",\"size\":19567,\"type\":\"image/png\",\"original\":\"d8c45f9e27af39051abd7ed92f69f2ca3ed08fad.png\",\"directory\":\"1KVD6JJPdmSL1EJzdjXYYeQmnkwfJvBRTC\"}]"
		},
		{
			"id": "5a8ab6d6-651c-464c-9c4b-5be1d8fdc47d",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "7109520e-de64-449d-a96f-91a656bc8a4e",
			"body": ">>7109520e-de64-449d-a96f-91a656bc8a4e\nsinner",
			"time": 1613465218351,
			"files": "[]"
		},
		{
			"id": "9a9ed8c1-f392-4a30-a793-dd51b69a9e1f",
			"directory": "users/1GwcsNqMyYs3UtRyRrSa4YuCx2i5712SqD",
			"uri": "pdfs",
			"thread": "752d8f0d-91cf-4f09-92c1-a1ffb450cb5a",
			"body": ">>c544699b-180f-4dd0-8443-9305e99148be\n> https://mega.nz/#F!B4dB2SzQ!h_pMC30v2a_y31iD0dy0sg\n> account terminated\nsry",
			"time": 1613467295464,
			"files": "[]"
		},
		{
			"id": "2416b320-2f1a-47a1-9044-6706bf546cab",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "3cb814e9-8f90-426d-8808-22d87e2537b1",
			"subject": "thank you for keeping this place live anon",
			"body": "thank you for keeping this place live anon",
			"time": 1618549760737,
			"files": "[]"
		},
		{
			"id": "9b8065d6-cd06-4213-bd32-6ae1252b3420",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5b5729b0-be4b-48af-a3e6-213fcb911024",
			"body": ">>5b5729b0-be4b-48af-a3e6-213fcb911024\nno\nneed source\nthis is too far-fetched to be real\nthey didn't actually publish that\nprovide source or it didn't happen.",
			"time": 1618550969017,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}