{
	"posts": [
		{
			"id": "19149d31-d96d-45f2-957e-70aade707524",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "89ce5dda-2fa8-46c6-a7b8-6af2f14d3de3",
			"body": "Someone posted an image on neinchan. Figured I would check there since the fags used to shill their site all the time on 8ch even though nobody was posting on their site. \n\n>>bf7849ec-7ebf-461a-b0c2-b6f406ff49a0\n>>ca545aec-d20b-4cdc-8478-004fd6aaadce\nI was in that IRC and it mostly consisted of bots and Christians. \n\n",
			"time": 1565141505500,
			"files": "[]"
		},
		{
			"id": "ad956f19-b57d-4d8f-8631-99f27b179a29",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "8e6a113e-c7a1-4911-9a8f-60cb8412519b",
			"body": ">>c5738fb5-d468-404d-9bf2-eee717249260\n> kikecord \nNo. Learn to use a chat platform with actual OTR encryption. Pidgin with OTR plugin is a good example of this which I have used for private comms with people. Every movement that ever used discord had its chatlogs pulled and published by someone. \n\n>>930f1e8f-1377-4cb0-b530-be05772f8ca0\n\"journalists\" are just getting their topics on the ''fringe right'' from bots that post on 4chinz the same replies over and over. ",
			"time": 1565141772300,
			"files": "[]"
		},
		{
			"id": "1e924bf6-ac96-490d-a345-4316f1c41393",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "8e6a113e-c7a1-4911-9a8f-60cb8412519b",
			"body": "To add on topic: if you have a plan for anything (doesn't have to be a killing or anything like that) it's best to not let everyone in. General chat hubs where everyone in a group has access to are pretty horrid since logs will get leaked and information gets leaked everywhere. That's what is preventing image boards and also some of those rightwing movements from doing anything. It happened very often that some journalist got a hold of logs, published them and then doxes, harassment and sometimes even lawsuits happened from antifa/sjw trash. \n\n>>8d620ae3-2027-4494-a132-b0edaeaffb13\nThanks for the advice, I'll look into it. I do use discord out of convenience with some contacts who also use pidg. Biggest annoyance when it comes to private contacts is how you both need to be online to chat on pidg. \n\n>>977fd0ad-d272-4ded-8b53-95e04e5f144b\nWhat makes it better, stronger encryption? ",
			"time": 1565143431700,
			"files": "[]"
		},
		{
			"id": "4017c7b3-0ca3-4305-b724-43792da806e9",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "87c258b0-f11f-4625-9b18-40175ecade0a",
			"body": ">>7f68f227-b1a8-4d7f-ba67-5f6984a4234f\nI think someone might have posted a picture telling them how to come here in one of their facebook groups or something. Their LARP must be pretty dead by now though considering the only way to verify Q for them was his tripcode. He didn't announce anything before 8ch got shutdown as far as I know. Not entirely sure why they're posting here though, I think they'll go away in a few days.\n\n>>daa5d82e-eecc-4190-ba97-7ddbf26ca16d\nThey all had their extreme stupidity in common. Hopefully this place remains somewhat hard to access since idiots, schizos, leftists, redditors made 8ch barely usable since imkikey was gone. Though kikey banned those, when imkikey was BO pol was the pro trump board and became very stagnant and shit.  ",
			"time": 1565144819200,
			"files": "[]"
		},
		{
			"id": "cbdec5a4-5a47-493d-a926-f3b5529dc5ab",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5664f64d-be4d-4fa5-8dd5-e42378eb8840",
			"body": ">>151517df-e90f-4113-ad29-53218efc183b\nEven better purging leftypoltards, redditors and other sjws from ruining everything. ",
			"time": 1565144963900,
			"files": "[]"
		},
		{
			"id": "6baada0d-9920-40b7-b296-e463c787608a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "93db8075-555d-4dce-897d-bbeb33ad88b2",
			"body": ">>93db8075-555d-4dce-897d-bbeb33ad88b2\nYou missed the biggest reason to shill on those 60 reasons. \n\nAccuse one guy of being a jew or shill, preferably one of the dumber posters so you derail the thread with the dumb poster. Or this can be done with someone else as well, but I prefer to believe the people who do / did this are genuinely foolish. \n\n>>e4cb65a1-5be9-4e11-8d8b-7480b31e0e6b\nYou could even see it on 8ch quite clearly. It's not just about knowing that (((they))) somehow do it but also about WHY they do it and HOW. Average person can't even explain very predictable politicians they watch in news every day why and how they do things. Even on the right for people who are jq aware they follow the fraudulent BS from people like David Duke (see stormfront). It's a man who routinely twists history against the jews but comes across as a revisionist idiot while doing so, and makes anyone who follows him easy to discard as an idiot. \n\nI don't think the majority of people can think much further politically than ''X BAD'' ''Y BAD''. You can easily make people anti jewish with shit justification if you have the means of information distribution. Look at how western media convinced their population to follow multiculturalism and globalism which are destroying slowly the wealth of upper middle class and below, while also destroying their nations. \n",
			"time": 1565145826300,
			"files": "[]"
		},
		{
			"id": "fb337770-c9f9-433f-bd44-5e6ac23ed58c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "970aea10-19b2-473a-9ed1-da6aea653c7b",
			"body": ">>1baf8c32-8b10-4d54-aa5c-d8bd62e90feb\n> 4chan \nHalf of the posters are actual Artificial intelligence bots at this point if you observe the posting patterns closely. They are bots who learned 4chan lingo through text they've been parsed and they solely exist to to provoke or distract a thread. And then you have all the one line posters and one line threads. What's even the point of it? At least a few years ago there was some humor but now you're talking with bots, data miners, normies and leftist shills... and maybe the rare legit poster here and there. ",
			"time": 1565148091500,
			"files": "[]"
		},
		{
			"id": "6384361e-695d-49c5-acc1-d3b81ecb12fa",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5da8ed4f-fabf-47a1-a056-d251a7ca7664",
			"body": "[M][M][M][M]\n[M][M][M][M]\n[M][M][M][M]\n[M][M][M][M]\n[M][M][M][M]\n\n",
			"time": 1565148719200,
			"files": "[]"
		},
		{
			"id": "770aff72-e309-44b4-a7d9-a9c04a78a8dc",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5da8ed4f-fabf-47a1-a056-d251a7ca7664",
			"body": ">>8dda7f58-3e03-4a76-b018-40d80481764a\nmore surprised why nobody targeted some of those insufferable euro parliament faggots, ecb, fed reserve or IMF. ",
			"time": 1565148814700,
			"files": "[]"
		},
		{
			"id": "daf017f7-089f-4cef-b827-f3a90d255e86",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "1807a71e-e646-4b17-9042-17c0c3244eba",
			"body": ">>988f7c8f-2546-4716-b180-ead3f585874d\nThe fuck are they gonna do about it though? They still struggle hard to find actual CP content creators on .onions. Nah the guys on 8chan duty are probably discussing on how they should approach this write a lengthy report about it and start posting in a few days about their Russian conspiracy stuff. ",
			"time": 1565149162600,
			"files": "[]"
		},
		{
			"id": "0ed2ca7d-02ff-4a41-88e2-f7e36a016596",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "1807a71e-e646-4b17-9042-17c0c3244eba",
			"body": ">>aeb139cf-47fe-4308-92c1-fe5665b4f776\nIt isn't a COD super soldier fantasy. A lot of bad people who control behind the scenes are easy to identify. The huge public figures have a lot of protection and security but most of the truly wealthy who can manipulate these figures often have no security around them. I mean why would they, every time a shooter goes on a spree he ends up shooting up a bunch of irrelevant people. Even though Brenton Tarrant killed a lot of muslims, the ones who brought them there and enabled bringing them should feel the fear and consequences of their policies and manipulation. \n",
			"time": 1565149901400,
			"files": "[]"
		},
		{
			"id": "817f972e-80fc-482c-9713-49840a18897e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "26231fd2-269e-4024-9fc3-a5f93d3d2e66",
			"body": "Key take aways here where that feds were seeding files (often genuine new content) so users would get trapped by that content if they didn't use TOR. Most of their techniques had to do either with seeding stuff themselves or identifying other seeders to take it down. I think Daesh also had the problem that their applications / forums would have like ~10 critical users who would be posting a lot of updates, pictures and video footage. Pol has the benefit that it's not as hierarchically dependent on a few users for content. \n\n>>2b7efe64-5ce7-410e-98dd-9f0faa70b7ee\nIt seemed pretty much a given that TOR would be needed to browse this. Not that I mind it though the site is pretty fast, even when using TOR. ",
			"time": 1565151283300,
			"files": "[]"
		},
		{
			"id": "86547b62-3bcc-4758-9ce9-8e7e2795375e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "26231fd2-269e-4024-9fc3-a5f93d3d2e66",
			"body": ">>9fd528c9-afde-4124-a2a3-6988b88039ad\nI think TOR is easier than a VPN for most. It's quick to install and the site works fast, threads load in 2-3 seconds or so when I click them. Which is much better than the usual .onion 5 minute wait time. ",
			"time": 1565151383100,
			"files": "[]"
		},
		{
			"id": "414bbc70-84e2-48f5-8410-8cbcefd72d14",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "87c258b0-f11f-4625-9b18-40175ecade0a",
			"body": ">>fb3fcf1a-a1cd-4643-9322-a74d68eed14a\nBy the way don't forget the west is free and democratic!\n\n>>555b67be-8aba-49e5-a91d-79fe6270aa17\nYes. Though it would need to be done on voluntarily basis because governments cut off all the ways to make money from what they censor. Even if they would ban VPNs you would still have them around you can't really ban them completely. I also very much doubt they're going to do anything about TOR, they probably can't at this point.   \n \n>>09bd039c-a656-46fd-a57e-4c5fa9772222\nThey were a bigger board than /pol/ was on 8chan somehow. ",
			"time": 1565152722300,
			"files": "[]"
		},
		{
			"id": "d1bb3eaa-fc8b-429b-a312-4c25ed9fdb59",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "3386226c-986a-4ee1-a04b-16bc7dfd66ed",
			"body": ">>26d2681f-6c62-46c0-bfd8-ca18df68124b\nYeah. I just laugh when one of them gets raped by one of their pets, it's what both parties want anyway. \n>>da72a8f7-b548-4a7d-b66a-cd0c06ea15d2\n> wanting to go on faceberg \nThese people have a brain they use to keep themselves ignorant of any facts. It would be similar to talking to a wall. \n",
			"time": 1565189008200,
			"files": "[]"
		},
		{
			"id": "a764416c-1ce2-4e18-a9fe-9372d6abd121",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "b24064a8-8bbd-4177-bc4d-98fb9772ddcc",
			"body": "[M] \n\nleftiecattle \n",
			"time": 1565224735300,
			"files": "[]"
		},
		{
			"id": "9f106226-5de9-4faa-8f9a-c25df3ade64d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4d81b316-b044-4247-bb86-60b2369237ee",
			"body": "lol that jewess should get a knife in her cunt \n\n>>a1b15838-d4da-4420-a97b-684adfc4e2ae\n> repent and become christian \n\nChristianity was written in hebrew language and a Jewish invention. It incorporates many things from judaism into it as well. Christianity won't fix anything.., the only thing it was ever good for was giving people false hopes and incomplete justifications of why things happen. \n\nThe only way to fix judaism is to take an example of what emperor Hadrian did. He managed to crush their religion, culture and people into irrelevancy for a good 500 years. ",
			"time": 1565230329100,
			"files": "[]"
		},
		{
			"id": "ba47ef8c-3cf5-4760-94ff-36599ea6ad53",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "7c3932ee-dc6a-4daf-895a-d258507e8d47",
			"body": "> innocent shitskin \n\nThere are better options than regular cattle shitskins, yes. Such as jewish elites? Curious why OP leaves out jews but rants about talk show hosts and politicians. \n\n[M]\n",
			"time": 1565231110300,
			"files": "[]"
		},
		{
			"id": "2883687f-ecca-412d-860e-b7cdf8f2e0a9",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "e65979fa-51b5-4874-831d-9f8e9dcd1205",
			"body": "They can't really do it unless they actively go on a campaign to remove all end nodes and even then people will likely just keep providing. \n\n>>21c6a725-9aa6-4458-a9df-c2ff60be1ae8\nRedditors are cucks that love cencorship and for a retarded crowd to think for them. They're using a platform that is build on cencorship in multiple forms. One being the obvious one with mods / admins shadowbanning whoever they want. The other is that the upvote system is a soft way to manipulate crowd opinion. \n\n> only a matter of time before you have to register your full name and address \nIt's already there a lot of applications want you to verify through facebook or something similar. Or they pacakage it in the form of discounts. \n\n>>065980f8-54dd-4c70-8e6b-ed84e20bf903\nDemocracy doesn't have to do that, usually it's a chaotic form of government that turns into an oligarchy once it is stabilized. Though in the west people are getting sold there is no oligarchy or the fingers are being pointed at irrelevant celebrities and people who are perceived as important (but are just public figures). Social democrat model that is employed everywhere in Europe is probably the most successful. You keep lower classes in line with benefits, middle classes are taxed to max so you only get an upper class of corporations who benefit from it all. And they only care about their own pockets it doesn't tickle down to a worker.\n",
			"time": 1565389013700,
			"files": "[]"
		},
		{
			"id": "22e45b62-bd6a-4909-8c9b-b95d34149ac9",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "d2a54715-8738-42c5-8c34-473fc2c30ff6",
			"body": ">>0a09a1e2-aaa6-4d79-b59f-b56665063275\nIt does have that leftard spambot though kek. Kinda shows the site needs some counter design for basic spam. \n\nYou can actually talk about FFXIV but what is a sin is talking about government corruption, pizzagate and so on. It's really sad how dumb and predictably stupid normies are, you know the type that sits on reddit on their shitty phone. At least cows on a farmer's farm that will be slaughtered do not violently defend their butcher like those reddit cucks. ",
			"time": 1565406197500,
			"files": "[]"
		},
		{
			"id": "ea82b634-62f8-45ae-a52c-45b44885fc55",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "1ba9411f-febe-4611-97a9-fd85fdb9533e",
			"body": ">>71e58dea-6778-4211-af88-7c1e3fc2bc7a\nYou are probably a fed, how come you're here on bunker but not aware of this? There were many threads on it. Are you a special agent, special meaning you having a severe mental disability? Got to get affirmative action diversity hires... \n\n>>acbd2a7a-c91c-4a54-b4fe-f3e644899e3d\nIf you read the document, they posted some screenshots as evidence of their activity but they wanted to track all the people who were posting in that thread (their IPs). I think the person who wrote the report was painfully unaware of the high VPN usage on 8ch though. Just like how the one who wrote the report was awfully unaware of the you's being identifying material. Likely the guys posting here mailed screenshots to the one writing the report and the screenshots with you's still in them got copy pasted into the person writing the report. The person writing the report obviously being oblivious to the fact that the you's reveal the agents. \n\n>>55d76f61-f19c-4b8f-ab01-7f7bdbaa3a7a\nTheir memes are retarded butchery as well \"sloppy job, putin\" \n",
			"time": 1565635695300,
			"files": "[]"
		},
		{
			"id": "564072a5-a5f6-4150-81b7-bda61e11dcf7",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c461c664-86e1-4933-b221-861bb909957e",
			"body": ">>ad51ccbc-d3ab-4ac1-a3d0-d6fd990e642f\nThis also applies vice versa. They do not have a purpose and are empty, incomplete humans. I hate those people. \n\n>>f64bd29d-9dce-4751-bcf6-32a2e32b92cb\nIt very much follows powerlaws. The one who can get the most users as chat platform has a huge advantage because it has the most users. Something new must be way better to knock off discord. As you saw with Skype that can take years, even now people still use Skype. \n\n>>e037d6db-28c4-49d3-a5c6-f0e369b4dd5a\nDepends on how the dicksuck-sized normalfag botnet service has structured and located their servers / datacenters. You'd probably have to hit multiple locations around the globe at once. It's probably easier to take down the electrical grid of your state (or country if you live in a smaller one). Though nobody really goes around wondering 'hey how can I screw up the electrical grid the most!?'. It mostly affects normalfags since there are many emergency generators when power outages happen. ",
			"time": 1565753968400,
			"files": "[]"
		},
		{
			"id": "1c66a3ef-22f0-44f5-832f-18bb6d19e6df",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "2a10387e-f7ba-4ffa-b938-07a42698737d",
			"body": ">>7ea25795-0216-4fc5-8dd1-1751779bc777\nYes it's why I'm kind of reluctant to believe this is real or forged. Maybe someone forced him to write the whole thing about Russia before he was allowed to also include his political and social views? We know that the feds shilled 8chan immediately after with 'muh russia' after Tarrant killed the muslims, shifting blame to Russia. ",
			"time": 1565820649000,
			"files": "[]"
		},
		{
			"id": "f86599bc-cb5a-4345-80f5-528c7c9a0dc7",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "cfd398be-770c-4eb7-8d19-8984c4053d0b",
			"body": ">>c3cfff50-0f94-4f89-82ae-962bc224196f\nFeatures are things you use in a (machine learning) algorithm. They're points of data. Some are collected through traditional collection methods but some are engineered from collected data. It's what makes a model way more powerful (engineered features). \n\nIt's very obvious from already the arab spring that Google is playing a role in American led 'revolutions'. ",
			"time": 1565820998700,
			"files": "[]"
		},
		{
			"id": "05c160d5-12d6-4a61-b41b-7db23ad37c10",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "7fae6bba-7d04-4440-8090-75b369c7ed1a",
			"body": ">>b826107a-8bb3-4a65-94a8-5858ea152c2b\nThere is little point in going back to 8ch. Its users grew dumber every day and 90% of the topics were complete garbage with a lot of garbage posters accusing each other of being a jew. And that would kill of many threads. Not sure if intel agencies were doing that or the users themselves. Haven't seen those levels of idiocy yet on here. \n\nIt would be pretty weird if this would die out since western governments are increasingly cracking down on alternative opinions. It will probably go into overdrive once we hit a recession that will be inescapable (it's coming very soon if you look at European economies). \n\n",
			"time": 1565821441700,
			"files": "[]"
		},
		{
			"id": "6b6d39cf-a387-4dd7-938e-72719459f5e9",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "0bbba398-89e2-4502-b290-417a0cfaedaf",
			"body": ">>56cd2a4d-cdbc-46e0-b473-0d2c522f2d06\nAfter 2 months or so when the radical lefties remained (the rest got smashed and disavowed in the media instantly) it became much easier to suppress. People weren't that united anymore and it became more about gibs. \n\nThough the good thing is that when a recession happens there is a decent chance an opportunist among the elite can get them to break things. And we're currently entering recession in Europe with a crisis looming ahead.",
			"time": 1565821761100,
			"files": "[]"
		},
		{
			"id": "830f2d2f-fb57-4b9d-a955-66cd03c8f1e4",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "cfd398be-770c-4eb7-8d19-8984c4053d0b",
			"body": ">>064562c2-f374-49b7-90a3-e98a776230e1\nYes. It is ridiculous how much power Google has and people do not realize it. People do not properly make the connection that google has an algorithm where it shows you information, and that algorithm is tuned to show relevant results but can also be heavily manipulated. It's ridiculous how much things have blatantly altered search results since 2016. It's like when Trump won the globalist side went into overdrive to make everything much shittier for everyone. \n\n>>4824cb65-5e68-4329-9262-5fbb7b5a3d37\nThat's a sales pitch. Isn't it more than obvious that one of the most powerful tools to show information is doing these sort of things? Information is how a lot of billionaires made their money. They had information and connections that others did not have. So by manipulating the normie to have only mainstream news approved information you can control people really easily. And a lot of companies like Bing and so on use almost exactly the same algorithm as google with similar results for the trigger words. Which shows that just like mainstream media, these algorithms are tuned to also show people garbage when it comes to anything political. ",
			"time": 1565834736000,
			"files": "[]"
		},
		{
			"id": "43658681-3fb8-4baa-b18c-dfe3f89a437e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "425586cf-3f0e-4c6d-beed-9a36783ea81e",
			"body": ">>cc0b9ff2-fe7d-473c-9e50-a97198e7b50d\nmuh honeypot meme comes from morons who also bought into the ''tor is compromised'' meme that probably feds were spreading to more easily track IPs. ",
			"time": 1565960972400,
			"files": "[]"
		},
		{
			"id": "bfdf4d8b-90e7-4ebb-8952-8766d362f77c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "06797473-4012-4f41-951f-7ccd25332bac",
			"body": ">>81e6739f-010f-49cc-aa76-c8af7127e305\nYes. Though you do not have to fight an army but it's much more effective to go after large business and elites. Maybe politicians but most of the anti white and economic chaos they're sewing is due to connections with business leaders and the elite. \n\nAnd even that in a lone wolf fashion would not really do shit but just transfer power from the people you killed to other who will just be as anti white.",
			"time": 1566287071167,
			"files": "[]"
		},
		{
			"id": "494f154c-bd40-4a58-8f51-92472906458c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "97156e18-7188-4c78-9061-fae6bd1cb916",
			"body": "It isn't coming back. While you consistently whined about jews, the tech jews indefinitely removed 8ch from existing. Jewgle amazon faceberg and so on are cancer, the people working there vain and retarded. Those companies are currently just doing 24/7 psy ops through algorithms on the normie and make them more retarded in corporation with news agencies. When you use google for example you always get news links from the extreme multicultural news orgs that are just lying to people (and somehow very popular due to people loving their lies).",
			"time": 1566287594764,
			"files": "[]"
		},
		{
			"id": "2b6ba41a-7aa9-4568-9443-871d95b6d91b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "daee6313-9c0b-4b5a-a357-c28575b9c46a",
			"body": "The update did kind of break the catalog and posting functions. Didn't like it that much. Though it did seem to have fixed some huge memory issues? I'm not sure but it's not so frequent anymore that RAM usage shoots up all the way to max on my computer when I have a few tabs and threads open on 08.",
			"time": 1566400187513,
			"files": "[]"
		},
		{
			"id": "f3c17e33-7102-46f9-bbba-d8f821ecf71d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "62419a4a-e256-4c78-9bf9-ac83cc12cad5",
			"body": "The hearing on that was months ago when that claim was made. Still nothing won't happen though since Google is a CIA backed government operation. Larry Page got funded by the CIA to design Google so the connections are obvious. They also have ongoing military contracts from what I believe and considering the nature of Google it's pretty easy to fill in what kind of things they would be doing for the military / intelligence agencies. \n\n>>51e19e9b-a8b5-4e45-b8df-d88488d535e9\nThey will get a token fine since it needs to be done to uphold the company in the eye of the public. They won't just outright ban it. Why would they ban one of their strongest intelligence tools over the population? It's even stronger than news agencies at this point since Google just redirects the sheep to the news agencies their websites or other censored / approved content. Their search engine has been getting worse and worse since 2012 or so due to hard propaganda control. \n\n>>8a630a03-4874-40d7-9433-fd2e81987ace\nDidn't both those archive sites delete Brenton Tarrant his stuff as well? \n\n>>2582e694-ae07-4017-8fbd-8f27cb02094b\nThey maybe get split down into a different company or rebrand / rename it under 2 or 3 different entities. Because the operations they do are vital for the elite running America and it's too good of a tool for intelligence agencies and elites to control the population.",
			"time": 1566400515359,
			"files": "[]"
		},
		{
			"id": "969585bd-c67c-4bd5-ac60-0ccb0077c6c5",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "ee112132-7bdf-4120-8d25-c45258913cec",
			"body": "You're right. Except for Monero, every time a bit currency will threaten the actual system it gets subverted, or it will have too much swings to be stable. If it would threaten to be stable and trustworthy and would gain traction governments would team up to subvert it or ban transactions with it.  As you already described in this thread why would the US government / the (((elites))) ruling it, want to lose their control over currency?\n\n>>b27d95bb-36af-4b73-a9af-4719c3fd6247\nThat's a good find. From what they say on the website they gather papers from profs, invite a bunch of leading experts and review some of the findings of those papers? It's remote and the limited attendance / coverage does put some doubt on things. Though you'd need to have an academic background in something data / quantitative related to separate the nonsense from what is real. Especially in those papers. Profs tend to lie and make up things a lot just to be able to publish I don't think that this kind of meeting is any exception. 120 Attendants is probably too much to have a proper conspiracy but what probably really happens is that 80 or so of those attendants are random profs or industry leaders who get asked or have a little speech while around 40 or so are inner core who actually manipulate these things. And they probably will have wine and cheese after the open discussion has ended to further discuss their actual plans.",
			"time": 1566402262653,
			"files": "[]"
		},
		{
			"id": "a42577ab-67f8-40fd-9d00-21ab2c98a86c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "831ee92f-d703-4e20-9d33-ad2031426f6d",
			"body": ">>cd248a7e-25e4-49ea-996d-0ba388963036\n>>cd248a7e-25e4-49ea-996d-0ba388963036\nAren't those just TOR end nodes?",
			"time": 1566402570115,
			"files": "[]"
		},
		{
			"id": "6d5c00fb-6379-472c-a4d4-e6da093bb5fd",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "605f0efb-f741-4956-bf44-f0c06beb1b3e",
			"body": ">>3313a6d0-e9a3-4509-82ed-e6c5af416888\nSome of that on the graph was fake / debunked though (the masonry / jew stuff). Pretty certain he wasn't a mason too much of his great replacement went against their doctrine. Hopefully the mason retard shills have left now that 8chan is gone as well. They were all over that place if you sometimes checked out threads on them. Not sure why they would even go on pol of all places when they got their corrupt friends club devoted to jewish ideals.",
			"time": 1566403340215,
			"files": "[]"
		},
		{
			"id": "e42e10c2-f72d-40a1-9b24-318e54c8c85b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "ee112132-7bdf-4120-8d25-c45258913cec",
			"body": ">>fa431ee6-4de7-4517-ac6a-66ffe472b433\nIt's like that. Usually you can find papers about quantum computing though but those papers if you could obtain them hide their exact methodologies. So replication of whatever study that you'll find in IEEE or somewhere else regarding quantum computing will not have  results that you can produce yourself. \n\n>>77f29c98-7b1c-4067-9960-71ad17f908df\n>>9ac512ab-e416-43b8-a80c-6acc992997b7\nThe military often employs the private sector, academic institutions and corporations to do stuff for them. Military in this way can profit from increased expertise from professionals without needing to hire them. Hiring professionals is a lot harder because not everyone meets the long list of criteria it takes to be employed for intel agencies (often multiple interviews + physical tests + clearances which all take time). Also the employee easily declines for those kind of functions if a long testing procedure is involved but the pay is worse than in private sector. \n\nSo what defense often ends up with is paying the private sector 3-4x, the government pays it for them anyway. And the corporations that have these big defense contracts bribe government so that contracts that the government is overpaying for will be held up.",
			"time": 1566471643135,
			"files": "[]"
		},
		{
			"id": "6c353f03-60ba-47a4-9cfe-b2eb2780f644",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "fa783407-01f6-4800-ad69-7bf37feec21e",
			"body": ">>3bb0ce1d-338f-4c75-abe4-ff0bb7f6ca61\nYou only get muscle imbalances if you skip classical lifts. Classical lifts like deadlift, squat, presses (overhead / bench), a couple of pull ups and you won't really miss any key muscle groups. Can do some extra work on some muscle groups like calves. \n\nIn my experience just lifting heavy things, trying to get progressively stronger on them is the best way of going about getting size and strength. Specific programs only become relevant if you need to manage fatigue or the likes. But I can safely that the overwhelming majority of people never experience fatigue since they simply do not train enough to experience it.",
			"time": 1566529379264,
			"files": "[]"
		},
		{
			"id": "cdad1798-bec0-48c0-9c16-75bdbcdc39ae",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "d05790bd-2d6c-4c92-a5ca-c29b0d56eae4",
			"body": ">>28e477b0-8ab0-46a3-8633-ec249378c416\nQuality of this board is higher. Though I must say the past year(s) or so board quality of 8ch was dropping like a rock. Most of the posters were schizos who would derail any thread calling everyone a jew. If it weren't for these posters it would be some boomers coming over from the Q board or other less intelligent posters. There were only a few quality threads, most quality OPs didn't gain attention and if they did it would be derailed very fast by the types I just described.",
			"time": 1566733713277,
			"files": "[]"
		},
		{
			"id": "8e1f7d53-68a0-4b59-baf1-5b8347e39719",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "d05790bd-2d6c-4c92-a5ca-c29b0d56eae4",
			"body": ">>d05790bd-2d6c-4c92-a5ca-c29b0d56eae4\nYes most went to cuckchan I think. Not sure why because it's proven governments have people on 4chan duty to react swiftly (within 10 minutes or so) if any perceived threat gets posted there. It also doens't allow vpns tor or anything similar so all the IPs of users are exposed for police to swiftly react against. \n\nMost of the posters left on 4chan are people posting endless bait threads, bots, lefties who raid it with nigger porn. It is not usable and the average intelligence has severely dropped since 2016 (while the board increased by 5-6 times in user size).",
			"time": 1566733844277,
			"files": "[]"
		},
		{
			"id": "7b1be916-262a-4849-864a-4e2c6899771e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6c2b5c63-8899-4733-9dfa-f399882dbae8",
			"body": "If you really want to know how jews think I'd suggest finding translations of the zohar. The Zohar is one of the most important esoteric works in Jewish faith imo and a lot of the jewish elites live by its rules. For common Jewish thinking (the pleb jew), they believe that they've been unjustly gasses in WW2 and their ethos is 'never again'. So they push for multiculturalism, globalism everywhere since with races divided and diverse nobody would think again to slaughter the jews. It's very obvious this thinking is flawed though imo. \n\nReason for me recommending the Zohar which is a Jewish book is if you have a grasp of how they think then that is worth more than the second hand texts of people 'exposing' that group. Their thinking and written texts that they (the jews) believe in are exposure enough.\n\nMultiple other enjoyable reads you can look towards are the classics. How Judaism was pre 100. It was very different and the typical characteristics from which we know Jews were all present. A highlight and whitepill would be emperor Hadrian and how he would destroy and almost annihilate their fate and people completely when the jews revolted against the romans. It's sad Hitler couldn't replicate such results (instead Hitler lost and the jews had the most powerful nation as puppet afterwards). \n\nI can post some sources but they're hard to find and I'm not sure if anyone would even be interested in them. \n\n>>9f7dc90b-bbe3-4906-9dd8-4799a610bf36\nI'd recommend staying clear of authors who write against the Jews through a heavily Christian influence / bias. Most of them are lying and have no clue what Judaism is about (probably if they did, they would question their own faith more). \n\n>>73634276-f541-4e40-9018-7c3dab650917\nOne thing David Duke does not do is backing up his shit. Long time ago saw a thread on I think ?Stormfront about how Constantinople fell since Jews would've opened the doors to Arabs in 1453. At least that was Duke's theory, and he based it off the fact that Jews were treacherous so it must've been the Jews even though there was no evidence to it. Yet he wrote it in one of his books as a straight fact. That man is deluded.",
			"time": 1566735025173,
			"files": "[]"
		},
		{
			"id": "bb1d8480-92a8-49c2-b20e-9203e7582f95",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6c2b5c63-8899-4733-9dfa-f399882dbae8",
			"body": ">>45935a09-1adc-4093-8d5b-83371aac0f88\nThose are some excellent reads. Though with Evola I recommend \"mystery of the grail\" first since it delves into the nature of myths and how they motivate people. True way to endure decadence is still finding a purpose and your calling in life that doesn't include decadence. Society sells people that they should earn an income, degree and so forth to be able to afford decadence. But nobody really has decadence as a goal in life, people should stand still and ask themselves what their goal is (more knowledge, more experiences, something that has been thought about). And no a goal in life isn't an addiction or compulsion that society orders you to follow. Which is where the decadence comes from. \n\nI've read the books except Libido dominandi and the one of the hitman I also haven't read.",
			"time": 1566735354073,
			"files": "[]"
		},
		{
			"id": "b061824a-e917-4263-bf0b-0001fde144f4",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "9323ebee-fe89-4b37-a5d1-0bb93db27b98",
			"body": ">>ffe22c5a-7233-419a-b5cc-61428a71a511\nI think they got us mixed up with some magapede idiots (...again). That's probably on imkikey. \n\n>>d9afffc2-b568-4ef7-a55c-faf9d7bf80c1\nI think they care about private because people get more exposed through private conversations since it's the most effective way to expose people to different points of view.\n\nYes more posters would make this place feel more alive. I rather have quality posters than some of the idiots that clearly haven't found their way to this board yet. \n\n>>c9becb68-b223-4195-a8d7-6653c51db2eb\nDo you think people would be more easily convinced if you have citations and sources underneath pointing out why that person is jewish? Most people do not care, because they have a pro jewish bias they will discard such diagrams and graphs as racist and will disagree with them no matter how much evidence.",
			"time": 1567257579531,
			"files": "[]"
		},
		{
			"id": "57ade8dd-91a0-47bd-a22c-8916a7c79dbf",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "bdf55d15-a2d6-467d-a7fb-61888ab3a56d",
			"body": ">>18d5c92a-65bb-4e2c-8cdf-f6d7277a4ccf\nWhat would that add? Most search engines are based on generic algorithms like Pagerank (from jewgle's larry page). I doubt the initial intention of people working on search engines was malicious though.",
			"time": 1567257813988,
			"files": "[]"
		},
		{
			"id": "237d3d6a-216f-45bc-a034-cf16fed394a8",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "e68c9977-f8f8-423f-bc9a-8d552ff2d46f",
			"body": ">>99bdeb9f-9d0c-4562-94dd-3af6fba3e495\nTry to relate to people and how they feel. What reason is there to hate jews for other people who are willingly ignorant about Jews, or perceive that Jews had great injustices done to them? Even Jews themselves are fully on board of pushing multiculturalism since they think it prevents them getting slaughtered in the fashion the nsdap did. \n\nBut to keep being on point, think about what you want to tell people about jews. The easiest way is to start about financial control, e.g. stuff like Sumerian swindle. Talk about history, roles they played in revolutions through the ages. Difficulties Romans faced with Jews (e.g. Hadrian slaughtering Jewish people into irrelevance for centuries for a good reason). History pre 1920's that isn't super heavily biased or less known is the best starting point for conversation with normalfags. They often have little knowledge about it, usually do find it interesting to talk about and are easily convinced. There is no need to lie or make up things about this either. \n\nHolocaust is bad to begin with. Okay so you say there are no gas chambers, and that the number of 6 million is made up and that its 1 million. What does this prove? No normie will agree since 'reputable' sources in their mind claim the opposite and would have you called a retard. So they discard you. Even if they do agree, it was someone with the same points of view as yourself. Dig deeper in history than 1920-1930's Germany, WW2 and post WW2 America / Europe to convince people of the plague that both the jewish people and their religion are.",
			"time": 1567301365235,
			"files": "[]"
		},
		{
			"id": "8ce2d2e7-0ff2-41d0-adea-553d7173e9d9",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "0188815e-c312-4638-b2ff-549c1c9c83fa",
			"body": ">>96587f83-5722-486f-b97a-cf71aa7d19e2\nWhich has become increasingly irrelevant as the means of production have improved a lot since communists where whining about it. Means of information is where its at in the knowledge age. \n\nHaving a much larger production than population has a side effect that you would need to transport this extra production somewhere. If you don't transport that excess, the excess is wasted and has to be destroyed. Distributing that excess among population would decrease prices, create surplus's that aren't intended which benefit lower and middle classes. No country wants that.",
			"time": 1567301812076,
			"files": "[]"
		},
		{
			"id": "7bd0f26b-afcb-452c-9aa0-325d79f61679",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f44d3704-29c2-4b58-9c01-91d5db54d794",
			"body": "I doubt Zognald gets re-elected because I'm pretty sure we will hit full recession / crisis before the 2020 election. He's already not very popular and he's doing nothing at all to stop social media censorship of big tech who now have big plans to give the other side the victory in 2020. Economy that crashes would be the nail in the coffin for Trump. Doesn't matter if the other side brings forth a bunch of even more retarded people. \n\n> dramatic swing to the right \nDoubt. The normalfag kids are raised on multicultural propaganda and climate nonsense. They  believe in it as well, like one would blindly believe whatever a religious leader would tell them. Except then the religious leaders are information dispensers such as google, media outlets, and lastly (((education))).\n\n> racial tensions get worse \nMight be but the elites have tight control so I don't really see why they would allow a civil war to happen. Remember they have the means of information under control and can trigger or prevent one if they want. \n\nWeb 3.0 is basically semantic linking of things together. It's a web where everything is linked together, everything is traceable and everything is fully connected with a lot of data publicly available. Kind of the next stage in dystopic control.",
			"time": 1567456121744,
			"files": "[]"
		},
		{
			"id": "2f7a2e05-8e49-45d7-9d4b-db5dcd15e873",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "ab62a9ef-a077-4f5b-aae0-2f93b5b665ed",
			"body": "Just post 08chan infographics on 8/pol/ whenever it comes back online so we can get more users here. The few leftards checking it out will be easy to [M] on here. And we hopefully can have a slightly larger user base than the current 100 or 200 posts a day we have. \n\n>>fd5223dc-b6f4-4588-a0e2-e554c30278c4\nGovernment agencies around the globe are so much cancer that the only alternative you have is to use TOR for posting. Even though if that will grow too dangerous for a government the tor project will also be shutdown. Quite surprised governments haven't decided to completely shut it down considering so much pedophile and drugs trade is being done through it. But that has its reasons probably as well.",
			"time": 1567702423596,
			"files": "[]"
		},
		{
			"id": "57bacfae-0863-437d-a36b-edbc7c48ba31",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "8fd34724-1136-4992-8b39-45434706b9bc",
			"body": ">>8fd34724-1136-4992-8b39-45434706b9bc\nThese places haven't died at all, on the contrary 4chan I believe is biggest it has ever been. But it is controlled completely by intel agencies. The users have been dumbed down and the sites have been made very accessible and user friendly. Mobile posting and so on. IPs were already logged and were going to be used I was warning for that on original 8chan to only post using vpns or TOR since likely gov agencies around the world would use it to fuck you over in some way. \n\nWhen 8chan comes back on the most useful thing to do would be posting links there to here. So that users who maybe haven't encountered a graphic yet about where the userbase make it here. \n\nI doubt that people need to worry about the install folder though. But TOR is a must when posting on here it should be made very obvious. Also the site isn't slow like most of the other .onion stuff (way faster than TOR used to be on 8ch).",
			"time": 1567703081413,
			"files": "[]"
		},
		{
			"id": "8455b28e-bd1c-4333-9540-5963d01112c8",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "8fd34724-1136-4992-8b39-45434706b9bc",
			"body": ">>73e52674-f08b-434c-a0ab-a73c32a61f8b\nHow come you have like 8000 posts while I'm stuck here at like 4000ish?",
			"time": 1567728646451,
			"files": "[]"
		},
		{
			"id": "9f49bad6-36ff-48bb-8903-e587fdec3fb6",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "112e3faa-c5fa-42bc-a1b1-8cd5aa78198b",
			"body": "I guess there are about ~40 posters left. \n\nI think they went off to neinchan or 4/pol/",
			"time": 1568423306046,
			"files": "[{\"name\":\"220dc11e3167eb171a0801052e0e269485679c967f20ab25265ae48964ec175f.jpg\",\"thumb\":\"13b235a4b889c93fbeb6683f7bb09d2107e15c46-thumb.jpg\",\"size\":61441,\"type\":\"image/jpeg\",\"original\":\"13b235a4b889c93fbeb6683f7bb09d2107e15c46.jpg\",\"directory\":\"1DdX1Yt2y7B4888Rf2GW8aMEtx1cn9uU8x\",\"spoiler\":false}]"
		},
		{
			"id": "ea200c36-c963-4816-8111-67330d0731a0",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4bd6aad7-b27c-4ad5-abe0-aab5bd829f85",
			"body": "> one survey found that 80% of the Chinese agreed with the system \n\nWell duh considering how far reaching the system goes, imagine saying you dislike the system on a survey. You have no way of knowing that the person conducting the survey isn't really bound to the Chinese government. Of course you say you approve of the system on the survey otherwise your score might be lowered without you knowing. That's the entire thing about why it's so evil, people have a partial explanation or no explanation at all behind why things are happening and so they always choose the least risky option that being obedience to the system. \n\n>>084df882-169c-4aef-b2b9-3b54a2cb15af\nYes but in USA and Europe we don't just overtly say that we're using some kind of social credit score. Even though they obviously are with all the website censorship and so on.",
			"time": 1568424350305,
			"files": "[]"
		},
		{
			"id": "1e312a09-a4bb-4b72-95ec-553ccc8f8bf4",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "69c8dbdc-d87e-4fd2-a90e-bc36225a687e",
			"body": ">>929a3b30-f2e8-4967-9386-f55e17d9c1e0\nHe already knew about the org. There was no way he couldn't have known considering the ADL has been on a consistent crusade to censor him and was going after his partners / financial income.",
			"time": 1568424682675,
			"files": "[]"
		},
		{
			"id": "fa12430c-a44f-42e6-90f0-5157b7bcd16b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "00b8c235-b07a-4aea-b0e0-88f166832319",
			"body": ">>92f649d9-1e27-4514-818b-7cceddf14e57\nGDPR when concerned with academic research allows for the researchers to trample on privacy all together. That is if researchers can justify using something for research purposes they can use it. If you're not using TOR for something or the like expect to be tracked in the modern world.",
			"time": 1569157034599,
			"files": "[]"
		},
		{
			"id": "47cda112-6fa0-4335-9ab4-b1beb5ea918d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "af01dafe-0659-4c64-bc27-5e243d74b6d0",
			"body": ">>1c84a6bf-1c7c-477e-b2e1-947770951502\nHow doesn't it fit in with western society? \n\nI don't like western society their values either, white women are typically whores who fuck around and try to prop up their instagram. Yes taking that I can't really disagree with the message.",
			"time": 1569157045767,
			"files": "[]"
		},
		{
			"id": "8a851bf2-ec03-4d93-82d9-4b71af07e501",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "1120501a-1959-4a7d-8650-ff5a5fc8c70d",
			"body": ">>5fedaf53-66ad-471d-9e26-efcab5f0704f\nBesides if you use TOR there is really nothing to fear.",
			"time": 1572065361881,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}