{
	"posts": [
		{
			"id": "f4cc8dab-7f50-428c-a2a3-67a3d74641dc",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "b174a737-ac5a-4d32-b8c3-1e4172b2c220",
			"body": "tor is kind of wonky\nusing a regular browser atm\nEdit:  Nevermind - I forgot to click to help distribute the files",
			"time": 1568182643646,
			"files": "[]",
			"last_edited": 1568183349605,
			"subject": null,
			"capcode": null
		},
		{
			"id": "ecf4d1b0-7426-4f08-83b2-284fcb66f838",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "8fd34724-1136-4992-8b39-45434706b9bc",
			"body": ">>a28d63d4-8c19-4170-b0dc-f33f302cb34a\nmore oc",
			"time": 1568182726546,
			"files": "[{\"name\":\"don't be afraid.pdf\",\"size\":4494,\"type\":\"application/pdf\",\"original\":\"8e2dc094ac15436a8b63649ad997390302257191.pdf\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"},{\"name\":\"don't be afraid 1.png\",\"thumb\":\"6e8a86588f8e3f28c73e1b7a7ae69b1ff04b041f-thumb.png\",\"size\":67770,\"type\":\"image/png\",\"original\":\"6e8a86588f8e3f28c73e1b7a7ae69b1ff04b041f.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"},{\"name\":\"don't be afraid 2.png\",\"thumb\":\"6642bcdbd349248eb4ecd055cbe211e1c4344251-thumb.png\",\"size\":60597,\"type\":\"image/png\",\"original\":\"6642bcdbd349248eb4ecd055cbe211e1c4344251.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"}]"
		},
		{
			"id": "900598c2-0a70-494f-b80d-7d2ed8751ef4",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "8fd34724-1136-4992-8b39-45434706b9bc",
			"time": 1568182822573,
			"files": "[{\"name\":\"Ok to criticize jews.pdf\",\"size\":3700,\"type\":\"application/pdf\",\"original\":\"e602a380571ba8dfb832b638a604639b4f27e74d.pdf\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"},{\"name\":\"ITs ok to criticize jews.png\",\"thumb\":\"e346c17e9696bb948352fad66653de7643ce7e0f-thumb.png\",\"size\":67717,\"type\":\"image/png\",\"original\":\"e346c17e9696bb948352fad66653de7643ce7e0f.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"}]"
		},
		{
			"id": "51428acb-ec73-4927-8466-38b8ca37861a",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "8697ab49-aa20-41dc-ae1d-3afc1dfe7535",
			"body": "works great",
			"time": 1568183033821,
			"files": "[]"
		},
		{
			"id": "9f84d779-4e42-49ba-b784-c7ec9192d4f7",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5da8ed4f-fabf-47a1-a056-d251a7ca7664",
			"time": 1568184776525,
			"files": "[{\"name\":\"its all so tiresome.png\",\"thumb\":\"a0a06df40e6c37bc7ff990c1df0292fdd11911f2-thumb.png\",\"size\":1112355,\"type\":\"image/png\",\"original\":\"a0a06df40e6c37bc7ff990c1df0292fdd11911f2.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"}]"
		},
		{
			"id": "00cb158c-ed95-4485-bf50-a17d502db192",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "sudo",
			"subject": "1",
			"body": "1",
			"time": 1568188624262,
			"files": "[]"
		},
		{
			"id": "4ec551eb-b8df-4a06-ab4f-890be51c0ebc",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "b",
			"thread": "d8ecfeb1-9728-4b21-adf0-d4c90cf11acd",
			"body": "werked fur me",
			"time": 1568188735962,
			"files": "[]"
		},
		{
			"id": "0542d6ec-6ccd-402f-bcba-a7b77c4c4ded",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "62f3f571-cbd3-4b07-89f5-fe17303ca129",
			"body": ">>62f3f571-cbd3-4b07-89f5-fe17303ca129\n>AmRen\nwhat a joke\n>Afraid of calling out the kikes",
			"time": 1568188866934,
			"files": "[{\"name\":\"ITs ok to criticize jews.png\",\"thumb\":\"1a824c485ea0c7d52750048de831b70bef2fb797-thumb.png\",\"size\":67717,\"type\":\"image/png\",\"original\":\"1a824c485ea0c7d52750048de831b70bef2fb797.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"}]"
		},
		{
			"id": "327e068b-09bf-411d-9a96-248917434e14",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "62f3f571-cbd3-4b07-89f5-fe17303ca129",
			"body": ">>0542d6ec-6ccd-402f-bcba-a7b77c4c4ded",
			"time": 1568188971334,
			"files": "[{\"name\":\"don't be afraid to criticize jews.png\",\"thumb\":\"d264df1fc76719c29e3605189b330ff37b538a05-thumb.png\",\"size\":74895,\"type\":\"image/png\",\"original\":\"d264df1fc76719c29e3605189b330ff37b538a05.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"}]"
		},
		{
			"id": "4bd6aad7-b27c-4ad5-abe0-aab5bd829f85",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Uh-oh: Silicon Valley is building a Chinese-style social credit system",
			"body": "==In China, scoring citizens’ behavior is official government policy. U.S. companies are increasingly doing something similar, __outside the law.__==\n\n08.26.19\n\n>     Have you heard about China’s social credit system? It’s a technology-enabled, surveillance-based nationwide program designed to nudge citizens toward better behavior. The ultimate goal is to “allow the trustworthy to roam everywhere under heaven while making it hard for the discredited to take a single step,” according to the Chinese government.\n>     In place since 2014, the social credit system is a work in progress that could evolve by next year into a single, nationwide point system for all Chinese citizens, akin to a financial credit score. It aims to punish for transgressions that can include membership in or support for the Falun Gong or Tibetan Buddhism, failure to pay debts, excessive video gaming, criticizing the government, late payments, failing to sweep the sidewalk in front of your store or house, smoking or playing loud music on trains, jaywalking, and other actions deemed illegal or unacceptable by the Chinese government.\n>     It can also award points for charitable donations or even taking one’s own parents to the doctor.\n>     Punishments can be harsh, including bans on leaving the country, using public transportation, checking into hotels, hiring for high-visibility jobs, or acceptance of children to private schools. It can also result in slower internet connections and social stigmatization in the form of registration on a public blacklist.\n>     China’s social credit system has been characterized in one pithy tweet as “authoritarianism, gamified.”\n>     At present, some parts of the social credit system are in force nationwide and others are local and limited (there are 40 or so pilot projects operated by local governments and at least six run by tech giants like Alibaba and Tencent).\n>     Beijing maintains two nationwide lists, called the blacklist and the red list—the former consisting of people who have transgressed, and the latter people who have stayed out of trouble (a “red list” is the Communist version of a white list.) These lists are publicly searchable on a government website called China Credit.\n>     The Chinese government also shares lists with technology platforms. So, for example, if someone criticizes the government on Weibo, their kids might be ineligible for acceptance to an elite school.\n>     Public shaming is also part of China’s social credit system. Pictures of blacklisted people in one city were shown between videos on TikTok in a trial, and the addresses of blacklisted citizens were shown on a map on WeChat.\n>     Some Western press reports imply that the Chinese populace is suffocating in a nationwide Skinner box of oppressive behavioral modification. But some Chinese are unaware that it even exists. And many others actually like the idea. One survey found that 80% of Chinese citizens surveyed either somewhat or strongly approve of social credit system.\n\n>     IT CAN HAPPEN HERE\n\n>     Many Westerners are disturbed by what they read about China’s social credit system. But such systems, it turns out, are not unique to China. A parallel system is developing in the United States, in part as the result of Silicon Valley and technology-industry user policies, and in part by surveillance of social media activity by private companies.\n>     Here are some of the elements of America’s growing social credit system.\n\n>     INSURANCE COMPANIES\n\n>     The New York State Department of Financial Services announced earlier this year that life insurance companies can base premiums on what they find in your social media posts. That Instagram pic showing you teasing a grizzly bear at Yellowstone with a martini in one hand, a bucket of cheese fries in the other, and a cigarette in your mouth, could cost you. On the other hand, a Facebook post showing you doing yoga might save you money. (Insurance companies have to demonstrate that social media evidence points to risk, and not be based on discrimination of any kind—they can’t use social posts to alter premiums based on race or disability, for example.)\n>     The use of social media is an extension of the lifestyle questions typically asked when applying for life insurance, such as questions about whether you engage in rock climbing or other adventure sports. Saying “no,” but then posting pictures of yourself free-soloing El Capitan, could count as a “yes.”",
			"time": 1568259596012,
			"files": "[{\"name\":\"Pic 1.png\",\"thumb\":\"d260c7aca5530c570ef47a490dea1f6a15d1bd5a-thumb.png\",\"size\":1517068,\"type\":\"image/png\",\"original\":\"d260c7aca5530c570ef47a490dea1f6a15d1bd5a.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"},{\"name\":\"Pic 2.png\",\"thumb\":\"5ac46d3d3982febaa68d8e99d33f880020564812-thumb.png\",\"size\":155193,\"type\":\"image/png\",\"original\":\"5ac46d3d3982febaa68d8e99d33f880020564812.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"}]",
			"last_edited": 1568259705212,
			"capcode": null
		},
		{
			"id": "9371b1f3-866a-4459-a21f-4b014b9e3ed5",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4bd6aad7-b27c-4ad5-abe0-aab5bd829f85",
			"body": ">     PATRONSCAN\n\n>     A company called PatronScan sells three products—kiosk, desktop, and handheld systems—designed to help bar and restaurant owners manage customers. PatronScan is a subsidiary of the Canadian software company Servall Biometrics, and its products are now on sale in the United States, Canada, Australia, and the United Kingdom.\n>     PatronScan helps spot fake IDs—and troublemakers. When customers arrive at a PatronScan-using bar, their ID is scanned. The company maintains a list of objectionable customers designed to protect venues from people previously removed for “fighting, sexual assault, drugs, theft, and other bad behavior,” according to its website. A “public” list is shared among all PatronScan customers. So someone who’s banned by one bar in the U.S. is potentially banned by all the bars in the U.S., the U.K., and Canada that use the PatronScan system for up to a year. (PatronScan Australia keeps a separate system.)\n>     Judgment about what kind of behavior qualifies for inclusion on a PatronScan list is up to the bar owners and managers. Individual bar owners can ignore the ban, if they like. Data on non-offending customers is deleted in 90 days or less. Also: PatronScan enables bars to keep a “private” list that is not shared with other bars, but on which bad customers can be kept for up to five years.\n>     PatronScan does have an “appeals” process, but it’s up to the company to grant or deny those appeals.\n\n>     UBER AND AIRBNB\n\n>     Thanks to the sharing economy, the options for travel have been extended far beyond taxis and hotels. Uber and Airbnb are leaders in providing transportation and accommodation for travelers. But there are many similar ride-sharing and peer-to-peer accommodations companies providing similar services.\n>     Airbnb—a major provider of travel accommodation and tourist activities—bragged in March that it now has more than 6 million listings in its system. That’s why a ban from Airbnb can limit travel options.\n>     Airbnb can disable your account for life for any reason it chooses, and it reserves the right to not tell you the reason. The company’s canned message includes the assertion that “This decision is irreversible and will affect any duplicated or future accounts. Please understand that we are not obligated to provide an explanation for the action taken against your account.” The ban can be based on something the host privately tells Airbnb about something they believe you did while staying at their property. Airbnb’s competitors have similar policies.\n>     It’s now easy to get banned by Uber, too. Whenever you get out of the car after an Uber ride, the app invites you to rate the driver. What many passengers don’t know is that the driver now also gets an invitation to rate you. Under a new policy announced in May: If your average rating is “significantly below average,” Uber will ban you from the service.\n\n>     WHATSAPP\n\n>     You can be banned from communications apps, too. For example, you can be banned on WhatsApp if too many other users block you. You can also get banned for sending spam, threatening messages, trying to hack or reverse-engineer the WhatsApp app, or using the service with an unauthorized app.\n>     WhatsApp is small potatoes in the United States. But in much of the world, it’s the main form of electronic communication. Not being allowed to use WhatsApp in some countries is as punishing as not being allowed to use the telephone system in America.",
			"time": 1568259622512,
			"files": "[]",
			"last_edited": 1568259750112,
			"subject": null,
			"capcode": null
		},
		{
			"id": "61615162-ad91-4872-854c-e12783063c97",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4bd6aad7-b27c-4ad5-abe0-aab5bd829f85",
			"body": ">     WHAT’S WRONG WITH SOCIAL CREDIT, ANYWAY?\n\n>     Nobody likes antisocial, violent, rude, unhealthy, reckless, selfish, or deadbeat behavior. What’s wrong with using new technology to encourage everyone to behave?\n>     The most disturbing attribute of a social credit system is not that it’s invasive, but that it’s extralegal. Crimes are punished outside the legal system, which means no presumption of innocence, no legal representation, no judge, no jury, and often no appeal. In other words, it’s an alternative legal system where the accused have fewer rights.\n>     Social credit systems are an end-run around the pesky complications of the legal system. Unlike China’s government policy, the social credit system emerging in the U.S. is enforced by private companies. If the public objects to how these laws are enforced, it can’t elect new rule-makers.\n>     An increasing number of societal “privileges” related to transportation, accommodations, communications, and the rates we pay for services (like insurance) are either controlled by technology companies or affected by how we use technology services. And Silicon Valley’s rules for being allowed to use their services are getting stricter.\n>     If current trends hold, it’s possible that in the future a majority of misdemeanors and even some felonies will be punished not by Washington, D.C., but by Silicon Valley. It’s a slippery slope away from democracy and toward corporatocracy.\n>     In other words, in the future, law enforcement may be determined less by the Constitution and legal code, and more by end-user license agreements.\n\nSource:  https://www.fastcompany.com/90394048/uh-oh-silicon-valley-is-building-a-chinese-style-social-credit-system\nArchive:  https://archive.fo/LsKhD\n\nPic 2 Twitter Source:  https://twitter.com/interfluidity/status/650803807262130177\nPic 2 Twitter Archive:  https://archive.fo/KAEJy",
			"time": 1568259636912,
			"files": "[]",
			"last_edited": 1568259791812,
			"subject": null,
			"capcode": null
		},
		{
			"id": "7dfc9f64-c100-4157-9161-9c33b2565434",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "25ac81e1-b413-40dd-8af5-044f73584451",
			"body": ">>9ddca972-4178-4111-955d-c5dd5b499182\n>there's an option to enable/disable it in the configurations\nwhere\nI wan to know too",
			"time": 1569276821127,
			"files": "[]"
		},
		{
			"id": "9365da89-e1dc-44a6-9cfc-29562d27fc65",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4dedafae-793a-42dc-a493-fb2287fb2b1a",
			"body": ">>98fa63aa-3f2a-4b63-aa3d-8e57a04d67ae\nShit - it was just up yesterday\nwtf?",
			"time": 1569302725493,
			"files": "[]"
		},
		{
			"id": "32684aeb-b501-4926-a720-ecfd99ec4f77",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "af01dafe-0659-4c64-bc27-5e243d74b6d0",
			"body": "\"Islam is Right About Women,\" (iiRAW) is a threat to the jew programming because it creates serious conflict in the 'progressive liberal' mind.  The 'PL' can't decide whether, \"To shit or go blind,\" as an older gentleman put it some years back.\nThis is not as simple as taking a side for the 'PL' anymore.  IOTBW can still be used as, \"Those White Nationalists...\" but iiRAW on the other hand provides conflict.  They can't choose which side to be on because they are supposed to support both Women and Islam, but when told that Islam is right about women, they react poorly.\nThis is a good OP and this takes IOTBW to another level.  If someone can think of something just as conflicted - but true - that will bother the 'PL' mind, share it.  Please.\nI've already got some ideas in my mind about posting this one, but I'm thinking about taking it a bit further, like, \"Your Employer Doesn't Care About You,\" or, \"Your Lives Are Empty Shells,\" and posting that off of a bridge that crosses a highway to a major metropolitan area.\nI would get a big rectangular piece of canvas from Lowes, put some weight in the lower corners - like something cheap, then tie the upper corners to the rail.  \nSomething to make people feel like shit and useless, but that's my thing.\nacceleration",
			"time": 1569303534817,
			"files": "[]"
		},
		{
			"id": "6f6598ca-84e2-457e-a352-6cc5bd6d5710",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "af01dafe-0659-4c64-bc27-5e243d74b6d0",
			"body": ">>f04038d8-0c46-4f58-88fc-26d713588845\nThere's someone always putting bricks on gas pedals - might as well be me...\nsome more ideas:\n\"Burn Down Your City Hall\"\n\"There Is No Heaven\"\n\"Kill White People\"\n\"Stop Masturbating\"\n\"Just Do Enough To Get By\"\n\"You Will Never Reach Your Full Potential\"\n\"You Will Never Be Fulfilled\"\n\"Stop Eating Or Stay Fat\"\n\"Burn Down Your Nearest News Outlet\"\n\"You Will Never Wake Up From Your Illusions\"\n\"Tell A White Person That They Are A Stupid Nigger\"\n.....and other things",
			"time": 1569378279300,
			"files": "[]"
		},
		{
			"id": "b5e9854a-52d8-4de6-89c4-653a6a5fc169",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4dedafae-793a-42dc-a493-fb2287fb2b1a",
			"body": ">>e74de1c5-5a7e-469f-8d2f-5a5a404abe05\nbest one I've seen today\n>using the \"Recent Posts\" system\nwill try",
			"time": 1569380004503,
			"files": "[]"
		},
		{
			"id": "2f6a676d-c489-4831-b38c-a7125f64891e",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "b3692ad8-0a6f-4a58-a90b-9a459da02d58",
			"body": ">>b3692ad8-0a6f-4a58-a90b-9a459da02d58\n>launch a satellite \nwith the $12,000.00",
			"time": 1569380382532,
			"files": "[]"
		},
		{
			"id": "ac33c50b-67f0-4b61-bbef-e9e492612ec9",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5311feb9-80b8-482c-b2b1-37d87e1bc224",
			"body": ">>68f85b5c-2076-49e0-8a8b-dfc019f460b8\n>If I go to 08chan, I don't really have an expectation of decency\nplease touch my pee pee - its twitchy and jumpy",
			"time": 1569383160795,
			"files": "[]"
		},
		{
			"id": "d70ea7e7-9af8-43bd-a48f-d8a4a66844c6",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Stop Posting on 4chan",
			"body": "Pic Related",
			"time": 1569802799536,
			"files": "[{\"name\":\"Stop Posting on 4 chan.png\",\"thumb\":\"fdc1048e5ed6bae5f8db7913a1d293afce8d2d53-thumb.png\",\"size\":279139,\"type\":\"image/png\",\"original\":\"fdc1048e5ed6bae5f8db7913a1d293afce8d2d53.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"}]"
		},
		{
			"id": "4ab9c527-babc-4adb-bf63-9451efb3185e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "00b8c235-b07a-4aea-b0e0-88f166832319",
			"body": ">>13fd05c6-191a-45fb-91bb-1c686538d8ca\nNO\nYou need Tor\nMost people don't have a VPN",
			"time": 1569802913436,
			"files": "[]"
		},
		{
			"id": "233517df-4d4d-4bb5-90ff-4d9c0c0ef2c8",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "25ac81e1-b413-40dd-8af5-044f73584451",
			"body": ">>576e44ac-6025-4888-9aa5-58a114f9217d\nthank you sir",
			"time": 1569803164900,
			"files": "[]"
		},
		{
			"id": "50d74038-7b32-4489-968b-57b5c6b86de3",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4c662606-d87c-4429-9166-7badef17c4c8",
			"body": ">>445642dc-fd10-409a-8d55-473d1271f495\n>Fatwheels",
			"time": 1569803252466,
			"files": "[{\"name\":\"fatwheels.png\",\"thumb\":\"2c938b1832147970513ee89198960ed636e06e17-thumb.png\",\"size\":1815591,\"type\":\"image/png\",\"original\":\"2c938b1832147970513ee89198960ed636e06e17.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"}]"
		},
		{
			"id": "4cfae97d-038f-4a22-a442-c023081367ad",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5ff1d121-fe98-4513-a0b6-09600a05ef02",
			"body": "https://zeronet.io/\nhttps://github.com/HelloZeroNet/ZeroNet#user-content-how-to-join\n\nWindows\n\nDownload ZeroNet-py3-win64.zip (18MB)\nUnpack anywhere\nRun ZeroNet.exe\n\nLinux (x86-64bit)\n\nwget https://github.com/HelloZeroNet/ZeroNet-linux/archive/dist-linux64/ZeroNet-py3-linux64.tar.gz\ntar xvpfz ZeroNet-py3-linux64.tar.gz\ncd ZeroNet-linux-dist-linux64/\nStart with: ./ZeroNet.sh\nOpen the ZeroHello landing page in your browser by navigating to: http://127.0.0.1:43110/\n\nTip: Start with ./ZeroNet.sh --ui_ip '*' --ui_restrict your.ip.address to allow remote connections on the web interface.\nInstall from source\n\nwget https://github.com/HelloZeroNet/ZeroNet/archive/py3/ZeroNet-py3.tar.gz\ntar xvpfz ZeroNet-py3.tar.gz\ncd ZeroNet-py3\nsudo apt-get update\nsudo apt-get install python3-pip\nsudo python3 -m pip install -r requirements.txt\nStart with: python3 zeronet.py\nOpen the ZeroHello landing page in your browser by navigating to: http://127.0.0.1:43110/",
			"time": 1569805449200,
			"files": "[]"
		},
		{
			"id": "d7ad03f8-a4d0-4d89-be64-81749c9af0eb",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "fd5517ff-1c3d-4468-8897-7ea5345fa079",
			"body": ">>576da759-3e08-448c-bd3c-c6010d519f81\n>Was the previous 8ch opensource code?\nvichan fork",
			"time": 1570072549900,
			"files": "[]"
		},
		{
			"id": "4db2891f-289b-41be-8db9-b0448d5dabae",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "42710d75-7d2f-4231-bcab-14db1e43fae8",
			"body": "yeah, I kinda wished more anons came here instead of going BACK to 4chinz\nor to this Alt-chan federation\njulay.world has a thread on the faggots that are running those places\nhttps://julay.world/cow/res/7486.html\nthis gay ass alt-chan federation\nhttps://julay.world/.media/f62a1ebe4bb64de0154f3aa69cd78d83-imagepng.png",
			"time": 1570634749197,
			"files": "[]"
		},
		{
			"id": "d6e8eb35-73ed-41dc-bdf1-a31aea5ab45e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "cfc09c1e-eebb-404f-8ea8-9a0f4782d3b9",
			"body": ">>a43fb3ea-ab2a-450b-9bf8-e0dd7cea216e\nyes we can see the thread\nI, personally, haven't been on here for over a week",
			"time": 1570634835597,
			"files": "[]"
		},
		{
			"id": "f9041fa8-91fc-4098-bc58-95f2b1e2927c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "a566a0e7-2761-41e5-966e-3d40ae56d581",
			"body": ">>c4d3d013-97ac-4916-963e-e87d45fd41e3\n>while ZeroNet is theoretically impossible to shut down, it is less secure than a clearnet site as raw IPs are visible to all users, and the antispam measure that the site admin implemented through ZeroID basically means everyone is forced to use a username (whether this is temporary or not I'm not sure, we should offer other solutions ASAP). You can always request a new ID (http://127.0.0.1:43110/1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz/) and trash your old one as often as you deem neccesary to remain anonymous. Remember to always use proper OPSEC and only run ZeroNet while behind TOR or a good VPN, and encrypt the install folder using VeraCrypt or TrueCrypt if you're really worried.\nvpns or tor werks to hide my raw ip address\namirite",
			"time": 1570635090897,
			"files": "[]"
		},
		{
			"id": "ddc2ae24-a469-4b83-ba99-bc769f9989bc",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6916c825-7def-4b52-89b0-7005bee33779",
			"body": ">>28ad5117-0d1a-4b99-8482-5fee07fbfe1b\nNYC?",
			"time": 1570635263079,
			"files": "[]"
		},
		{
			"id": "481067e9-56a0-4013-9756-632d6ee5bf53",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "39fc2b2c-e367-487f-8f4b-7ca65f7610fc",
			"body": ">>3e951fb3-1813-4e87-bf2a-1c7eac11a79d\njpgs get blurry when re-sized you stupidhead\nonly time I use jpg is when I have to copy an image from another site to use in a post.\nget with the program",
			"time": 1570636033509,
			"files": "[]"
		},
		{
			"id": "33326d6d-0996-47f8-9c9c-e073723dc1cb",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "3c0fbc49-e1c8-4f62-8b80-3094503ecac5",
			"body": ">>42e6b2e9-7a8c-438b-8192-eba5fac152cd\nyeah - I downloaded the 1GB stream too\nhonestly\nthe guy names 8ch/v/\ncheck out this blunderbuss or whatever the fuck this is\nthere really is no manifesto here\njust a list of his weaponry and his plan.\n>>7d14a076-275a-4c71-aae4-1dfc086faf1d\nbut, at least he named the jew",
			"time": 1570679333966,
			"files": "[{\"name\":\"what the fuck is this.png\",\"thumb\":\"02eb21cda4d55b194689a81d75a12ec82a464ca5-thumb.png\",\"size\":1514959,\"type\":\"image/png\",\"original\":\"02eb21cda4d55b194689a81d75a12ec82a464ca5.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"}]"
		},
		{
			"id": "dcb20305-12b6-40b6-a510-239c5588b844",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "a566a0e7-2761-41e5-966e-3d40ae56d581",
			"body": ">>c08859ff-46e7-42cb-ac2c-889b77751fe2\n>You're better off creating a short, catchy meme image to pass around at varying sizes to avoid spam detection\nlike this?",
			"time": 1570679645011,
			"files": "[{\"name\":\"Stop Posting on 4 chan.png\",\"thumb\":\"dde8a9091aa905292b17997df8f071329a92c79e-thumb.png\",\"size\":279139,\"type\":\"image/png\",\"original\":\"dde8a9091aa905292b17997df8f071329a92c79e.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"}]"
		},
		{
			"id": "9b21954f-0fce-41f0-b0a0-873170f8c8bb",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "42bb9b99-f3df-4209-bef1-e25456da9117",
			"body": "imo, telegram is just as big a honeypot that discord is - unless you are using an email that you __Only__ access via tor/vpn to create your account with, and then using telegram through vpn/tor.\n>why I want to make a tor router\n>need older version of raspberry pi os for starters",
			"time": 1570679887940,
			"files": "[]"
		},
		{
			"id": "a2b79bce-128a-4021-b539-e9f81bba28f2",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "4chinz threat",
			"body": "this thread just popped up in 4chinz\nhttp://boards.4chan.org/pol/thread/231750783\njust saving for posterity",
			"time": 1572584748023,
			"files": "[{\"name\":\"screenshot-boards.4chan.org-2019.11.01-00_01_42.png\",\"thumb\":\"bcdc8fb3401be3348f2d6fb31beaea5183e240bf-thumb.png\",\"size\":1861563,\"type\":\"image/png\",\"original\":\"bcdc8fb3401be3348f2d6fb31beaea5183e240bf.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"}]"
		},
		{
			"id": "f5b817c7-55b6-4a25-a6e5-aa80c05d1e23",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c13a92f0-34e5-4a30-83c9-b9d89b593ee6",
			"body": ">>200e4375-bec5-471d-a73a-5a3163eae093\n>routing directly through the DoD",
			"time": 1572585536871,
			"files": "[{\"name\":\"8kun1.png\",\"thumb\":\"4bc04b2cf3d054f34e3240e6d3a57a8f0bb7fdc8-thumb.png\",\"size\":7304,\"type\":\"image/png\",\"original\":\"4bc04b2cf3d054f34e3240e6d3a57a8f0bb7fdc8.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"},{\"name\":\"8kun2.png\",\"thumb\":\"9b10dca000768efdef4d0cc31ee875cb8b1aaf0c-thumb.png\",\"size\":70113,\"type\":\"image/png\",\"original\":\"9b10dca000768efdef4d0cc31ee875cb8b1aaf0c.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"},{\"name\":\"8kun3.png\",\"thumb\":\"b20def71154b2351916971bae3e0a376d38c6465-thumb.png\",\"size\":258866,\"type\":\"image/png\",\"original\":\"b20def71154b2351916971bae3e0a376d38c6465.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"},{\"name\":\"8kun4.png\",\"thumb\":\"03ac91a52bd6576598b346e7483ef09eb67a9982-thumb.png\",\"size\":244507,\"type\":\"image/png\",\"original\":\"03ac91a52bd6576598b346e7483ef09eb67a9982.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"},{\"name\":\"8kun5.png\",\"thumb\":\"dbed5c5f0463ac36a4ace49a8ae01a2e7f5a8475-thumb.png\",\"size\":245937,\"type\":\"image/png\",\"original\":\"dbed5c5f0463ac36a4ace49a8ae01a2e7f5a8475.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"},{\"name\":\"8kun6.png\",\"thumb\":\"b5fbfa753d84f9e45f2c50b3aa1b92d8b26724b2-thumb.png\",\"size\":256385,\"type\":\"image/png\",\"original\":\"b5fbfa753d84f9e45f2c50b3aa1b92d8b26724b2.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"},{\"name\":\"8kun7.png\",\"thumb\":\"490b22e7be42e51188a9316ed287b1af827713e2-thumb.png\",\"size\":128812,\"type\":\"image/png\",\"original\":\"490b22e7be42e51188a9316ed287b1af827713e2.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"},{\"name\":\"tracerout tail -5.png\",\"thumb\":\"72d1cbd4e651793b202300ac14fdb9355129bed1-thumb.png\",\"size\":162170,\"type\":\"image/png\",\"original\":\"72d1cbd4e651793b202300ac14fdb9355129bed1.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"},{\"name\":\"tracerout tail -5 plus whois.png\",\"thumb\":\"8136806d11ebdc965475774eea0253b1ed5ddbbe-thumb.png\",\"size\":157073,\"type\":\"image/png\",\"original\":\"8136806d11ebdc965475774eea0253b1ed5ddbbe.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"},{\"name\":\"8kuntraceroute list.png\",\"thumb\":\"eed3159f9210dad9105ab678794d9fd66c1cd896-thumb.png\",\"size\":61541,\"type\":\"image/png\",\"original\":\"eed3159f9210dad9105ab678794d9fd66c1cd896.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"},{\"name\":\"just noticed.png\",\"thumb\":\"cac4666d214e24c807ebac0ecb7d365bf473930a-thumb.png\",\"size\":28208,\"type\":\"image/png\",\"original\":\"cac4666d214e24c807ebac0ecb7d365bf473930a.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"},{\"name\":\"8kun2.png\",\"thumb\":\"d089fbf527c2f67532a01d9bab0dc2fddefe139e-thumb.png\",\"size\":70113,\"type\":\"image/png\",\"original\":\"d089fbf527c2f67532a01d9bab0dc2fddefe139e.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"},{\"name\":\"kakapoopoo.png\",\"thumb\":\"84500732250e71acebf16c5f52ca8d9f194d4255-thumb.png\",\"size\":20767,\"type\":\"image/png\",\"original\":\"84500732250e71acebf16c5f52ca8d9f194d4255.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"}]"
		},
		{
			"id": "ee0d816c-45d8-47b6-a9b2-4884e2583cba",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "7cfba737-8bb7-4c9a-9761-73454b198d63",
			"body": ">>7cfba737-8bb7-4c9a-9761-73454b198d63\n>still not up\njej",
			"time": 1572587014852,
			"files": "[]"
		},
		{
			"id": "d545e3df-8a9c-45b2-a147-3d998a6064a4",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Palestinians demonstrate denouncing Balfour Declaration",
			"body": "> ''Created on Friday, 01 November 2019 11:16 | Published Date''\n\n> Palestinians in the besieged Gaza Strip are preparing to take part in the 81st Friday of the Marches of Return and Breaking the Siege under the title of \"Down with the Balfour Declaration\".\n\n> Palestinian mass media quoted the National Agency of the Marches of Return and Breaking the Siege as inviting the Palestinians to participate in the demonstrations that will be staged to affirm that the Balfour Declaration is baseless and to show the Palestinians' commitment to their land and the right of return.\n\n> The Agency stressed that the marches will continue until achieving their objectives, namely ending the tight Israeli siege being imposed on the Strip, guaranteeing the Palestinian people's right to return to their indigenous homeland and foiling the so-called \"Deal of the Century\".\n\n> Tomorrow coincides with the 102ndanniversary of the notorious Balfour Declaration which paved the way for the creation of the Zionist entity on the Palestinian lands.\n\n> About 313 Palestinians were killed and more than 30000 wounded by Israeli forces of occupation since the beginning of the Marches of Return in March 2018.\n\n> K.Q\n\n'''Source:''' http://syriatimes.sy/index.php/don-t-miss/44629-palestinians-demonstrate-denouncing-balfour-declaration\n'''Archive:''' http://archive.md/0gpdB",
			"time": 1572659236300,
			"files": "[{\"name\":\"1572654791435.png\",\"thumb\":\"533366b0b755df3e4b1a2c85f660389a03fda997-thumb.png\",\"size\":463010,\"type\":\"image/png\",\"original\":\"533366b0b755df3e4b1a2c85f660389a03fda997.png\",\"directory\":\"1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1\"}]"
		}
	],
	"boards": [],
	"modlogs": []
}