{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1579445364,
			"title": "Major problem what makes 0Net unusable for users and webmasters",
			"body": "There is a very long time unresolved big problem. If anyone tried download a video, movie, file. In many cases, they are inaccessible or the download is stuck in X%. A movie, a video, or a series impossible to watch on this network. But it is the same with file downloads. The large file download mexhhanism are  a disaster setup! The files are terribly seeded. This is such a serious mistake, If a user or webmasters  see this the software will be deleted and forgotten. I don't understand why the developers can not fix such a serious mistake, for which many users have spoken about years. Try it anyone watch movies, videos, download files, the whole thing is unpalatable and inoperable. From a free country why would anyone come here if these basic things (entertainment media content) games, video, software, audio, movie download don't work at the beginning when the user try the software?",
			"added": 1579445363
		},
		{
			"topic_id": 1620715720,
			"title": "ZeroNet development has been stopped?",
			"body": "No substantial development since 2019. Another development teams can’t develop insaide the network their own projects because have to wait for software developers. \n\nhttp://127.0.0.1:43110/Blog.ZeroNetwork.bit/\n\nMost of us don’t even know if the developer is alive at all? \n\nThis project should be taken over by other development teams. The project development is too centralized. The same setup wat use browsers and torrents a common compatible network would be needed without one centralized development team, and one centralized software.\n\nFor example if i make a torrent file the same way will work with all torrent clients. And there is no central development. \n\nIPFS, ZeroNet, Freenet, these projects do not work because there is no common network.",
			"added": 1620715718
		}
	],
	"topic_vote": {
		"1530310792_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1629872993_13K9xAHRgqygKe8PQ7bgoNxVu6zhj7dETt": 1
	},
	"next_comment_id": 29,
	"comment": {
		"1527998213_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "Its not just a KopyKate bug.\nAll my files and zites are crash slowly in the system.\nOptional files transmission default half finished, if you close the browser.Files and zites only load if the current time someone share the current file.If not later the ZeroNet system does not try to download these files.If you set up  help distribute all files the data limit high, the ZeroNet system contiune the download if you close the browser.",
				"added": 1528035696
			},
			{
				"comment_id": 2,
				"body": "I know what causes the problem.\nBut this problem need fix to the ZeroNet developers.\n\n Problem1\n1.If a user want download a zite or a large file see KopyKate or ZeroUp etc.The current time required minimum 1 active user who have the current file.If that is not the case the ZeroNet system does not download the file.Later too will not try to download the system.If nobody share the file the current time the file will not add the download list.\n\nProblem 2\n\n2.If you try download a large file (Optional file) from a zite and if have active user who have it. if you close the browser the download will not contiune.If you check the files you will see the files downloading are stopped.\n\nThe ZeroNet file transmission system is working wrong.The system expects all files when you try to download it.Its need a active user this time (NON STOP) who have it.\n\nSee a simple thing.If a zite in the current time nobody share the ZeroNet system are not try to download later.\n\nIf you set help distribute all files, set the data limit extremely high the optional files download are contiune if you close the browser.\n\nThe result: Large files goes fast unavailable.And you will see if you download it its half finished.Users get only part of the files so you get too part of them.Zites have the same problem.But the phenomenon is less noticeable.And there are slowly completly download the HTML files.Unlike in (Optional files) by browser request.But if the current time nobody share the zite (or files) the system does not try download later.See content json failed.\n\nThis two deficiency combination causes this big problems.I have signaled it to the developer because this is causing me too many problems.\n\nThis 2 problem are not a KopyKate bug its affects all zites in the system.And this is not a ZeroNet version issue.The problem is in the ZeroNet transmission  protocol.This is an old problem in the system.",
				"added": 1528069266
			}
		],
		"1530310792_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 3,
				"body": "Have similar problem with zites too.Zites are only downloaded if the current time sombody share them.The are no download later option.I think the file issue are resolved over time.But with zites (sites) the problem remains unresolved. This reduces the  people who can share your zites and files. Reduces very the  files bandwidth,small zites uptime,. The costs are increased to multiple times bigger.Small zites will crash fast with the current setup.",
				"added": 1530385943
			}
		],
		"1531922152_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 4,
				"body": "Have the same problem with zites.See content json failed.\nWe need not just big files, but zites too this option.So the users can download zites later if nobody seed them the current time.And we can forget the content json faild problem.Becouse nobody share the current time the zite.\nThe result would only be positive: More seeders,bandwidth,uptime.And almost free server costs.See torrent clients like u torrent.If the user want download a file monday but nobody seed it the same time.But on Tuesday someone starts to share the file,then the user in every case get the file.",
				"added": 1531954142
			},
			{
				"comment_id": 5,
				"body": "> [styromaniac](#comment_60_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Are you on 3537? ZeroNet keeps trying to download sites that couldn't download before. I don't know whether or not the 'content.json download failed' error is an exception, but if you're on 3537 and still having issues, then that confirms it.\n\nYes im using 3537.\nAnd im waiting an option.What it downloads automatically zites if sombody seed it it later.And do the same thing with big files too.Such an option It would be important for website administrators.\n\nThe current setup are too costly.And waste your resources unnecessarily.The users only get the zites and files if sombody seed them the current time.Small zites are crash fast this way.And big files does not have seeders.",
				"added": 1531956585
			}
		],
		"1532214041_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa": [
			{
				"comment_id": 6,
				"body": "Steemit and DTube was a big scam crap.After 1 week you can not delete or edit you comments.On DTube your video will gone after few weeks but the player and comments are not deleted.You can not delete or edit your videos after 1 week.Your blog or video player stay  there forever and its not possible to remove it.The DTube and Steemit monetization system are scam too.\n\nStay away from DTube and Steemit too.",
				"added": 1532218812
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [],
		"1521392984_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 9,
				"body": "#0Net have a loong time unfixed critical bug!\n\nSmall zites are working perfectly.But sharing large \"optional\" files are a nightmare. The files are always paused and can not resume! Users does not know how to download files, (and use this +SEED buton). And any time the users download part of the files.Or do not understand why not downloading the large files?! I do not understand, its a important function.But it hasn't working the right way for years.Why default not use 0Net the working (Intergalactic File Server) Setup? Where file download are ALWAYS FINISHED.Years later after upload, videos and files are working on IFS. In ZeroUp and etc..., young files are dead. And all seeded,even popular files have very few seeder.",
				"added": 1549030302
			}
		],
		"1549511316_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 10,
				"body": "[Zero Up]( http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/)\n\n[IFS](http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/) \n\n[KopyKate BIG OFFICIAL](http://127.0.0.1:43110/big.kopykate.bit/)\n\nHave the technology.\n\nBut whe are waiting loong time for the ZeroNet developers to make a working download system.\n\nIn 0Net ZeroHello Files menu the files are paused,not resume.From browser request default setup the files download are not resume! This make problems all users! This files not resume, +Seed button setup we must change to a working download system.\n\nCan not controll to pause,resume,files like in download managers. This way the files are poor seeded.The users not get the files.And the files goes fast offline,keeping large files online this way are realy hard.And this make more problems with streamable video files.Where users want play the files in real time.\n\n[Files menu](http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/?Files)",
				"added": 1549557315
			}
		],
		"1549491562_16Mk2RBcyMkuWKqULM9C95UEef4oNyagSC": [
			{
				"comment_id": 11,
				"body": "#Be careful with this blocklists!\n\nhttp://127.0.0.1:43110/1ScanCY9fjmjanDt7NwvyNQCL16hqWnVM/\n\n#It's a easy way to tracking us back,with TOR always mode too! Using a script insaide the blocklist code, its possible to get the users real IP through the browser who use the current site.It's working with files too!",
				"added": 1549802615
			}
		],
		"1552644409_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": [
			{
				"comment_id": 12,
				"body": "[New Zealand mosques attack video - 20190315](http://127.0.0.1:43110/18Pfr2oswXvD352BbJvo59gZ3GbdbipSzh/?Video=1552655856_1QD7wjARqHkA7xVMzGr1dQdNSjrDkdBehW)\n\nHere write it why he did it.\n\n[Tarrant Brenton - The Great Replacement](http://www.freepdf.info/public/ebook3/Tarrant_Brenton_-_The_Great_Replacement.zip)\n\n0Net link\n\n[Christchurch Mosque Shooting. Shooting in Christchurch, New Zealand, 15 Mar 2019.](http://127.0.0.1:43110/19k9BZR4VYfY2p2roqKDnJxtVpo8kM6HvV)",
				"added": 1552848597
			}
		],
		"1552858206_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 13,
				"body": "The alternative projects have two problems money and developers. So you will see you will get something what very buggy. Thats why windows slill the most used OS what are in monopol place. And YouTube, Facebook, Google the most popular platforms. And they can do everything. Just see the similar decentralizated patforms.\n\nI2P: Having a torrent client what can not connect to the clearnet clients. And having everything like TOR, but you can not connet to clearnet sites with it. No social platforms, no forums, the sites in it almost work.\n\nFreenet: Similar to I2P.\n\nTribler: It says she anonymous, but you can not seed the files outside the cilent with this mode. \n\nWe have platforms with critical bugs and deficiency. Which years later include this bugs. They are spectacular. And the user ask himself, the developers not see this? Many users try this softwares, platforms. But not too much later see the problems and not use them. There is no exception to this.\n\nFree platforms wheare have money like TOR, Firefox, Chrome, Google are working.\n\nAnd ZeroNet: Outgrew the Freenet, I2P social media and reducted interface platform problem. But having his own critical problems what see the users and web developers.",
				"added": 1552897971
			}
		],
		"1579445364_17KQehVm2u5r4GAjqkC3jRcxepzK6ri51W": [
			{
				"comment_id": 14,
				"body": "> [ranshit](#comment_53_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): Much like on The Pirate Bay, there is no way to help those who release media but then decide not to seed it for others who may show interest. Everyone wants to be a hit & run and that causes unseeded content. If you want to find some working titles, check out the documentaries uploaded by htgozn and htgozn2 as the material is well seeded. [...]\n\nThis is true, but there have no trouble  with the download manager program. I talked about the problems that could be solved. Like you can't resume a simple download process. The SEED button need to search in all zite. Files are not listed when you want to download something. Like in The Pirate Bay you can download what you want. But here basic things don't work, what on The Pirate Bay or torrenting have no problems. And anyone who wants to download it here something, sees that it is mostly not a seeding issue, much more optional problems.",
				"added": 1579448861
			},
			{
				"comment_id": 15,
				"body": "The problem if somebody seed some files. In many cases, the users will not be able to download it. The download is paused, half finished, not added to the download list, can not resume. The SEDD button is difficult to use, need to leave to find the current page, or not find in the whole site. And it's all a major development issue. And they should have been fixed a long time ago. Who will try this software, will immediately see these problems. And it will say, the functions are not done well, then delete the program and no longer deals with it.",
				"added": 1579450637
			},
			{
				"comment_id": 16,
				"body": "> [bwcolor](#comment_9_16H8PnkKK28GX5NdwsAz6EALB9QuvoY5bU): in my opinion zeronet is not the best option to seed big files, but is great for creating distributed web sites. \n\nBittorrent, Emule, 0Net (non big file) downloading mechanism are working absolutethe same mechanism. The user want download the selected file, the download progress are resumed, and the complete file are finished and seeded. User can pause or delete the file download. Zeronet big file download mechanism are completely unique. If the site does not have SEED button the file download paused and not resumed. Download part of files needlessly that we don't click on. Not added to the download list. The user will not receive the file later. And the seeder's if it's later online does not see the downloaders this way. The files cannot spread properly. This way the 0net sites have seed, and the files have not. It would be easier to use the proven mode. Resume and download the complete files, whatever the user wants. And if somebody doesn't need to some files can delete it later. One big problem is the unique download mechanism, instead of the one that is already well-established everywhere. In many cases, a separate program for the purpose is not the solution!",
				"added": 1579566175
			}
		],
		"1584291401_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": [
			{
				"comment_id": 17,
				"body": "Users are seed this zites, that's why there is a limit on every social site in 0Net. If there was no limit a lot of data would be downloaded for everyone in the current zite. Who make useful comments the zite administrator raise the limit.\n\nhttp://127.0.0.1:43110/NewGFWTalk.bit/\n\nThis is what happens in the Chinese forum. Your own site is uncensored, censor resistence here. But the zite administrator make the rules. And the visitors seed the zites.\nYou can delete old comments, that are less useful to the community. And you get more space limit. Who will use it in a few days this limit, with useless comments, the admin will not going to be raised.",
				"added": 1584302613
			}
		],
		"1620574964_1C6gAPEiSgWRPes1bmpFhWcKGyyT2WMTiX": [
			{
				"comment_id": 18,
				"body": "Absolutely not\n\t\nIPFS, Zeronet, Freenet very few people use them. These softwares developments and the softwares are centralized, and not compatible with each other. I think the development of Zeronet has stopped.  IPFS are full of serious security flaws and deficiencies. IPFS pages are very easy to manipulate. The IPFS development team is not quite correct either. IPFS users on github and the forums they run are often censored who talk openly about serious security issues. Filecoin are a incorrect system too, intentionally with large system requirements.",
				"added": 1620713606
			}
		],
		"1620715720_17KQehVm2u5r4GAjqkC3jRcxepzK6ri51W": [
			{
				"comment_id": 19,
				"body": "There should be a common network and a backward combatibility network. IPFS, ZeroNet, Freenet, incompatible networks with each other. The problem with this is that a content owner would have a lot of extra work to upload the content to the different networks. None of the users will run dozens of software where there is almost nothing on the networks. One software development speed limits all other developers on the network. Projects cannot develop rapidly independently of each other, because all the users always have to wait for the developers of a central software. Currently, the ZeroNet project is the only one where easy to setup websites and share files, and have forums and social media, the content keep online when the content owner turn on his PC. The torrent system works extensively. Many types of clients are developed Independently from each other, the content is created once and a common compatible network is used. In order to have quality content, it is necessary for content producers not to spend any money to have the content online, stay online even if their PC is turned off. Making money is important, the crypto are a popular thing. If all content producers can make money with content in the same way, there will be plenty of quality content. In cryptography and web hosting a surreal idea the nons stop online system. The problem is the idea that the content producer has to pay to have their content online, and paying a paid server costs. It is not enough to have freedom of speech and anonymity on a network if it is costly and hard to maintain the content. The real business is where it doesn’t cost semi money and effort to keep the content online. And on top of that, the content owner can only make money from his work without hosting costs and without 24/7 seeding, or without paid hosting services where the content creator paid recently that to keep his work online, and the operation of the website itself does not cover the costs of this. ",
				"added": 1620809591
			}
		],
		"1617087999_16u7ApvQbcH9sGVJV5ELBvY1AQiZLnbDKN": [
			{
				"comment_id": 20,
				"body": "This is not decentralized. Users do not seed the full content just part of the content, and only when the browser are running. The central server is only helped with seeds when too much users use the service on heavy traffic. If the central server shuts down, the entire service shuts down slowly. Where users do not  seed the full content, just parts of them, none of the services there decentralized. Web torrent are not a solution to that to the users 100% keep online the content without a central non-stop running server.",
				"added": 1622100924
			}
		],
		"1628958951_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 21,
				"body": "\"Not Found\nAdding new sites disabled on this proxy.\"\n\nThis is meaningless, only the pages are selectively available.",
				"added": 1629032167
			}
		],
		"1628848642_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg": [
			{
				"comment_id": 22,
				"body": "I would call all similar networks an engineering horror. \n\nIPFS, Freenet, Beaker browser, similar networks, useless at all. Folly of peole and hype with spectacular programmer bungling. Content cannot spread properly on any (decentralized) network.  Weak inoperable imitations from copying the torrent systems. Ignoring all the basic SEEDING techniques for which the torrent system works.",
				"added": 1629033231
			}
		],
		"1629298299_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": [
			{
				"comment_id": 23,
				"body": "The project are not profitable, exiguous donations, pitiful websites in which there is no business and clearnet search egnies can not find them, the community is unable to develop the project, it can also be legally risky so yes possible was threatened, understandably he stopped development. The users is simply weak to develop the project. Community (the users)  development is a joke: unable to correct serious bugs, just some fancy changes, and creating blocklists in a censor free system. More people are trying to ruin the network than are making really useful development. Since 2018 (the big file plugin) no major improvements, only minor fixes, changes. ",
				"added": 1629446824
			}
		],
		"1629872993_13K9xAHRgqygKe8PQ7bgoNxVu6zhj7dETt": [
			{
				"comment_id": 24,
				"body": "Totally I agree, but antivirus programs are blocking this scripts. It was one of the first sources of revenue not so long ago on zeronet. With zeronet blocklists some ZeroNet users tried to discredit selective those pages which they did not like (setting the script as a virus). There are two other problems it should be solved if someone is not want to mine then  not allow to use the site. The payout limit is usually very high for such minning pools. The minimum payout would accrue in years using multiple zites. It would be important for anyone who does not reseed the downloaded amounts of data,  than pay it to the content owner. See the BitTorrent setup. And get money if the user seed back more data than downloaded. For downloading and when someone is watching the content, it should be so that content owners get anonymous way money uniformly across the entire network.",
				"added": 1629878940
			}
		],
		"1630497564_19AuD3C3VusewLWehweVi29XupaG5TkPVC": [
			{
				"comment_id": 25,
				"body": "\"Nofish may transfer some of his knowledge to some reliable guys, and encourage them to work hard in a quiet and silent way, to avoid repeating the same mistakes of promoting the decentralized web in too obvious style.\"\n\nThe are no reliable guys, developpers. Multi political interest trying to infiltrate the development community. What some tried to improve on the project for free meant nothing. The background has not been created for a strong decentralized community to embark on serious developments in the project and thus earn money. Without financial gain, no one will take the project more seriously. The whole project came to a standstill and wasn’t going anywhere. There would be a multitude of independent development teams need for this project.",
				"added": 1630662488
			}
		],
		"1630441420_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg": [
			{
				"comment_id": 26,
				"body": "There is no financial gain in it. A small team worked on it, but it is no longer dealt with. There were those who made minor improvements out of the hobby, but for the most part rough-and-ready work and was quickly abandoned. The project is not going anywhere because this community cannot develop anything significant on it. The background is not created for development teams, users to deal with the project professionally.",
				"added": 1630663757
			}
		],
		"1630703227_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 27,
				"body": "ZeroNet an open source system. It is necessary to eliminate the fact that the software is in the hands of a single development team. It should be seen as a protocol. Furthermore, a system needs to be built where content owners and software developers make money anonymously. At a level where many people can live full time from this as a Job.  And if someone is talented, don’t ask, or need to ask anyone for permission to develop on the software. It does not make sense to archiving ZeroNet. Don't need one ZeroNet software, from different development teams required serval  ZeroNet softwares. The developper teams have to compete who to do the best job. All this is not scattered on the Internet, but in a central location with user feedback, ratings, statistics, and a open free to integrate each other source code system.",
				"added": 1630780479
			}
		],
		"1605762939_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 28,
				"body": "# The LBRY & Odysee video sharing platform are a scam service! \n\n1. The service are paid!  If you use proxy, VPN, Tor, shared public internet connection they are not allowed, and if before allowed they disabled the  monetization system. Without this you can not upload videos free! If you use Tor or VPN YOU CAN NOT LOGIN TO YOUR ACCOUNT you will get \"NetworkError when attempting to fetch resource.\" and \"Could not get a user ID. Account functions will be unavailable. Try again in a bit.\" erros msg! If you manage to log in with error messages, the server will kick you up!\n\n2. LBRY & Odysee coin system the LBC coins transactions for anyone trackable, tracable on the blockchain where to whom to whom he sent money. They are  phone number, bank card, trackable verification necessitate to the user to allow monetization and free upload, without this the service are paid, if you use proxy, VPN, Tor, shared public internet connection and buyght coins you can not login and access to your coins!\n\n3. PUMP AND DUMP COINS!: The value of their coins has been falling on the stock market for years. From 1.8$ (2016), 0.7$  (2017), 1.2$ dropped down to 0.008-0.05$ that its value keeps falling if you hold their coins! They sold very high prices ther coins and later worth ther coins almost nothing. Surreally high system requirements and costly minning requirements if someone want mine their shitcoin to upload one video. It takes half a month to mine with a powerful machine to upload one video with high electricity costs.\n\n4. They are not allow to users to change their email address or delete their account.\n\nPersonal experience on Youtube and Reddit I couldn't comment  this. On Youtube after commented the comments disappeared immediately! On Reddit they are not allow anonymous commenting using TOR or VPN! On Youtube what people read in comments under the videos they are carefully selected and show  false images! Based on keywords, their system automatically deletes all negative comments. Alternatively, the comments will be displayed selectively, which is allowed by the uploader of the video. The Youtube site is full of paid sponsors who set up fake images with selected comments about various services! ",
				"added": 1631850097
			}
		]
	},
	"comment_vote": {
		"94_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	}
}