{
	"next_comment_id": 14,
	"user_name": "KxoBot",
	"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
	"post_like": {
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1556473512": 1556472905,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1556464054": 1556473790,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1556600465": 1556600327,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1556544612": 1556600402,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1557581491": 1557610800,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1557963043": 1557983079,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1558237601": 1558305669
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "Glad you're back!",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1556464054",
			"date_added": 1556474166
		},
		{
			"comment_id": 2,
			"body": "@Styromaniac: \n> I will no longer feel sorry for another person without a home.\n\nYou're equating homeless people with drug addicts? Or are you making the assumption that all homeless people steal (which is a **rediculous** assumption btw)? And some of them wouldn't have to steal had the system not failed them... and the system's failing is **all of our faults**.\nI mean... it seems like you think these people *chose* to be homeless because they can't \"figure [their] shit out\" - that's the most *ignorant* comment I've ever heard.\n\n> he's not trying to do better, so he's worthless.\n\n**All** people are worth it - and it's despicable, imo, to say otherwise.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1556622670",
			"date_added": 1556850266
		},
		{
			"comment_id": 3,
			"body": "@Styromaniac: Except that I wasn't commenting on the \"if\" part - and you'd know that if you looked at the specific sentences I quoted. You made the statement \"Maybe I can understand the person's desperation, but I think he's not trying to do better, so he's worthless.\". Doesn't look like an *if* statement to me.\n.\nYou additionally say \"I lost over $400. I will no longer feel sorry for **another person** without a home.\" - That's not an *if* statement, and that certainly isn't talking about a specific person.\n.\nSo I'm **not** shoving words in your mouth. You made **general** statements about \"another person\".\nKeys words here: **another person**. Realistically speaking here, not everyone is like that one person, judging all others as so is **wrong**.\n.\n> Let's not make this another episode of shoving words into my mouth.\n\nIt's extremely clear here what your saying... you will no longer **feel sorry** for **another** homeless person again. That's not shoving words in your mouth, that's you being a asshole who believes in stereotypes or judgements about a whole group based on an experience with one person - it's extremely rediculous (and ironic).\n.\nSo don't even try fucking playing me. You said something... own up to what you fucking say.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1556622670",
			"date_added": 1556859132
		},
		{
			"comment_id": 4,
			"body": "How about look at everything I wrote? Also, you know what a question mark is, right?",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1556858052",
			"date_added": 1556859924
		},
		{
			"comment_id": 5,
			"body": "@Styromaniac: **Ah... I *see* now, you probably read the first sentence, then didn't read the rest of what I said, LOL. I can't stand people like that - pretty illogical for someone who's all about the logic, right?**\nIf you read everything, you'd know that what I was talking about was judging homeless people for \"not getting [their] shit together\", not you making the assumption that all homeless people are drug addicts (which is much more debatable considering your wording - hence the question mark.... and the word \"or\" in the second question).",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1556622670",
			"date_added": 1556860557
		},
		{
			"comment_id": 6,
			"body": "Btw, afaik in the US (I don't know if you live there), someone can't use your checks without your permission (and the bank knowing about this - checks have to be signed)... which means you should be able to tell the bank about this.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1556622670",
			"date_added": 1556863093
		},
		{
			"comment_id": 7,
			"body": "@Styromaniac: \n> you said I equated all homeless people to druggies.\n\nNO, I DIDN't.\n\n> You're equating homeless people with drug addicts**?** **Or are you making the assumption that all homeless people steal (which is a rediculous assumption btw)?**\n\nTHESE ARE QUESTIONS.\n\n> he's worthless. He could have landed a job by now.\n\nRight.... well - he's **not** worthless. All people are worth it imo, but my philosophy on this particular aspect doesn't even matter here.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1556622670",
			"date_added": 1556895451
		},
		{
			"comment_id": 8,
			"body": "Are you talking about duende? I've blocked him too. How someone can condone something like what he's doing is beyond me - but that also doesn't matter because blocklists aren't forced on people - they're opt in. Additionally, the personal mute-list is a separate and unshareable thing from blocklists.\nWhat accusations were placed on Kaffie and by who?",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1557004279",
			"date_added": 1557087909
		},
		{
			"comment_id": 9,
			"body": "@Styromaniac: \n> It's a psychological projection that he's making about you. Everything he says about you, he's likely actually saying about himself.\n\nHe could *just* be a troll. Not everything has to have a Freudian explanation imo (especially when much of Freud's stuff was disprooven)",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1557004279",
			"date_added": 1557228373
		},
		{
			"comment_id": 10,
			"body": "@nekololi: What's the difference between sharing a blocklist with another person, and a person muting the same people someone else mutes?\nAlso... blocking a person only \"deplatforms\" them if people use the blocklist.",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1557289846",
			"date_added": 1557290979
		},
		{
			"comment_id": 11,
			"body": "@nekololi: The point I was making is sharing a blocklist is a two-way street. Not only does the creator have to share it, but the people have to enable/use it. Which means these people are **choosing** to use that list. It's no different than if they **chose** to mute the same people - because that's precisely what they are doing by enabling a blocklist.\n(the only other aspect would be the auto-update feature of blocklists).",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1557289846",
			"date_added": 1557292379
		},
		{
			"comment_id": 12,
			"body": "@caryoscelus: They're probably talking about my blocklists and my new blocklist sharing and collab zite.",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1557289846",
			"date_added": 1557294924
		},
		{
			"comment_id": 13,
			"body": "@Styromaniac: Actually ivanq/imachug started Git Center - I only helped test some stuff out and I think I was one of the first ones to use it, idk.\nHere's what I have made thus far:\n* Important Zites (old)\n* ZeroNet Dev Center (not deleted)\n* ZeroMedium\n* ZeroFrame Router (not deleted)\n* KxoQA (formerly ZeroExchange)\n* Important Zites New\n* KxoNetwork (not deleted)\n* KxoId (not abandoned/deleted)\n* KxoVid\n* KxoBlock (not deleted)\n* KxoDo (unreleased and abandoned - you can see pictures of it on here)\n* Helped *very little* with of StreamZ\n\nAlso, here's a ZeroTalk post that talks about most of these things as well as other things I've done for ZeroNet: [http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1553530288_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu](/Talk.ZeroNetwork.bit/?Topic:1553530288_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu)",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1557499618",
			"date_added": 1557526163
		}
	],
	"next_follow_id": 1,
	"intro": "KxoBot",
	"post": [],
	"follow": []
}