{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1517982417,
			"title": "ZeroNet \"x File update failed.\"",
			"body": "Why does this happen, and why doesn't Zeronte automatically retry  until the update succeeds?",
			"added": 1517982416
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1516596886_1KNSf9nhRFUc52aeX947CRwWTUGPPnZdyQ": [
			{
				"comment_id": 1,
				"body": "> [gitcenter](#comment_251_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): There will be a checkbox like Auto-sync ZeroWikipedia and wikipedia.org (this will reveal your IP if you don't use Tor). This will be recommended on homepage, too.\ngreat! That sounds like the best solution.\n\nIf wikipedia on 0net will really work, it could also serve also as a replacement for Kiwix. There could simply a button: Download the entire English wikipedia. And 0net would store it entirely offline (and additonally seed it to other peers). And the download process would be mostly p2p and only for a fraction using wikipedias servers.",
				"added": 1516817025
			}
		],
		"1517556000_1KNSf9nhRFUc52aeX947CRwWTUGPPnZdyQ": [
			{
				"comment_id": 2,
				"body": "This would also solve this problem: http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1517552108_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6",
				"added": 1517598519
			},
			{
				"comment_id": 3,
				"body": "> [penetratormk2](#comment_32_1AC3zv2K9eEsm8XpfSirwb13hSdtjHAiu5): penetratormk2 â”\n\n> [gitcenter](#comment_284_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di):\nNo of course, it is meant if user A doesn't visit site B in 3 months, site B is deleted from users A zeronet storage.",
				"added": 1517679419
			},
			{
				"comment_id": 4,
				"body": "> [gitcenter](#comment_285_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Did you mean what you said or No of course, it is meant if **any** user doesn't visit site B in 3 months, site B is deleted from users A zeronet storage.?\n\nAt least the original creator of some website \"presumably\" will \"visit\" and maybe edit the site often. But if it is so boring, that only few people visit it, I see no reason to leave it on many peers and use up their harddrive.",
				"added": 1517682868
			}
		],
		"1516324194_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": [
			{
				"comment_id": 5,
				"body": "> [helium](#comment_143_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): t of my limited knowledge, can not technically handle, is SPAM.\n\nCan't the site owner simply create a whitelist of users? Or manually approve users?\n\n\nRegaring the topic: I think a voluntary blacklist could be shared and updated among ZeroNet users to prevent unknowingly visit or seed these kind of zites.  This voluntary blacklist should be preinstalled on ZeroNet to increase adoption of ZeroNet and prevent the media to call it \"full of criminals\". ",
				"added": 1518033325
			},
			{
				"comment_id": 6,
				"body": "> [nekololi](#comment_164_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): no, zeronet should not be censored by default... [...]\n\nyes, it should be. Otherwise ZeroNet is not something I could recommend to use for the broad public and will never scale to any meaningful alternative to the server-client internet. Child pornography has to be suppressed as much as possible even in a \"censorship resistant\"  network as ZeroNet.  \n\nOr do you want unknowing ZeroNet users stumble across child pornography and unknowingly seed them?",
				"added": 1518069850
			},
			{
				"comment_id": 7,
				"body": "> [flappyearz](#comment_128_1QEfmMwKVxgR4rkREbdJYjgUmF3Zy8pwHt): Unfortunately I have heard way too often calling \"terrorist\" and \"child porn\" when raiding on people for political or economical reasons, or to create laws to oppress the opposition or resistance. While this is an endless debate, the same topic reached the conclusion way back when cryptography was basically banned that no, the solution is not to make crypto illegal but to change the humans using it. Yep, it's not easy, probably it's not even quite possible, but the problem is not the tech but the people. You cannot technically make child porn, extremists, criminals or politicians disappear.\n\ni agree with your statement, and that is why i think zeronet is a good idea. However it is important that these sites are not unknowingly seeded by many innocent people, who stumbled over them and forgot to click delete. Otherwise it possible for the creators of these websites to hide in the masses.",
				"added": 1518111195
			},
			{
				"comment_id": 8,
				"body": "> [nekololi](#comment_169_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): one of the core ideas behind zeronet is that it creates an environment where things can't easily be censored. making zeronet a censored network is a huge slap in the face and disrespectful to the hard work that is being put into its development. zeronet should no sooner censor child pornography than it should censor chinese activists or american right wing political speech. [...]\n\nYou convinced me. I guess one of the things that really needs to be addressed is a better tool to \"self moderate\" to minimize unwanted seeding. To delete unwanted content you need to do:\n1. Remember the sites name (in a differnet language this is non-trivial)\n2. search for it on zeroHello\n3. find the dots and click on them\n4. Click delete\n5. Confirm in the top right corner\n\nThis is WAY too complicated. \nThis idea: http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1517556000_1KNSf9nhRFUc52aeX947CRwWTUGPPnZdyQ/Autodelete+never+visited+sites+after+3+months\nwould address part of the problem, but I think additionally the user interface for deleting sites you will never want to visit again.\n\n\nOne idea: Hovering (not dragging!) over the \"0\" button could open a small menu with buttons like:\n\"Bookmark this website\" (appears with a star in ZeroHello)\n\"Delete and block website\" (meaning it will warn you whenever you visit the site again)\n\n\n\nPS: I know you can also delete a site when you drag the \"0\" button to the left and then find the delete button. But I would have never found this hidden feature, if not someone would have told me to pull the \"0\" button.",
				"added": 1518153648
			}
		],
		"1607271673_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": [
			{
				"comment_id": 9,
				"body": "> [xcape2net](#comment_820_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Bitcoin is traceable because governments have made it nearly impossible to buy without presenting an ID.  They have managed to de-anonymize it, thereby making it nearly useless.\n\nhttps://github.com/cointastical/P2P-Trading-Exchanges/",
				"added": 1609242312
			}
		]
	},
	"comment_vote": {
		"251_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"121_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p": 1
	}
}