{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Abbiamo urgentemente bisogno di nuovi tracker V3 per ZeroNet",
			"body": "Sono un utente italiano di ZeroNet che gestisce un proxy per la clearnet (https://0net-preview.com) e numerosi tracker, tuttavia sto notando ultimamente un deciso calo di prestazioni della rete con difficoltà dei nodi a sincronizzarsi. Il traffico sta aumentando vertiginosamente (soprattutto dall'Iran) e quindi abbiamo bisogno di nuovi tracker compatibili con la versione V3 degli hidden service TOR per tenere la rete in vita. Con lo sviluppatore anonymouse abbiamo creato una patch per far connettere TOR agli indirizzi V3, vi prego di applicarla alla vostra installazione se volete continuare a usare zeronet con TOR da ottobre quando gli indirizzi V2 verranno spenti. Se potete abilitate anche il plugin per creare un tracker (dal vostro computer o meglio affittando un VPS o un server dedicato) per aiutare la rete a funzionare. Per creare un tracker V3 raggiungibile seguite la guida scritta da Styromaniac. Stiamo già pensando di implementare con degli sviluppatori il DHT in zeronet per renderlo indipendente dai tracker.\n\nV3 patch: https://git.disroot.org/anonymoose/ZeroNet_OnionV3\n\nGuida di Styromaniac per settare un tracker V3: http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1631033012_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3/How+to+setup+a+TOR+v3+tracker+on+Ubuntu+20+04+and+Linux+Mint+20+2+using+Anonymoose+s+patch",
			"added": 1632643530
		},
		{
			"topic_id": 2,
			"title": "Zeroseed Pack V3-compatibile ora disponibile anche per Windows e MacOS!",
			"body": "Sono appena riuscito a risolvere i problemi relativi alla versione dello Zeroseed pack compatibile con la versione V3 degli hidden service di TOR. Potete scaricarla dal link sotto ed avviarla assieme al TorBrowser se volete connettervi alla rete ZeroNet tramite TOR (ho tolto la versione di TOR interna all’app perchè molto vecchia). Consiglio di far partire l’app da un percorso non troppo lungo perchè non dia problemi.\n\nhttps://mega.nz/file/7ex03RIL#TfTIVWsKQVolqiSdR8XlbtVgB7uUkwBt1Ds3y4a1WLI\n\nIncollando il codice python e la cartella /data nell’installer Mac ho creato anche una versione per Mac, tuttavia non sono riuscito a testarla non avendo un hardware adatto, fatemi sapere se funziona! 🙂\n\nhttps://mega.nz/file/uOpCDLxS#GiALWjnu_5gYfFzMWqXOpTR370RuJq6HLK0r9dDtxO0\n\nRicordo che la versione linux può essere scaricata da qui:\n\nhttps://mega.nz/file/vDpAgBrT#qLfXqtI0tQhmCOh1jgFsiYkncpSJHlpJ3oz9RcP6mRU\n\nLa versione di ZeroNet per Android (ZeroNet Mobile) è già patchata con la patch V3 di Anonymouse. Diversi Dev stanno già lavorando ad un fork di ZeroNet che integri di default questa patch, nel frattempo gli zeroseed pack permetteranno di usare agevolmente i V3 su desktop!",
			"added": 1632924853
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}