{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Wikipédia distribuída",
			"body": "Wikipedia incensurável no IPFS\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Main_Page.html",
			"added": 1549728693
		},
		{
			"topic_id": 2,
			"title": "Bíblia em PDF – NVI (Nova Versão Internacional) Português",
			"body": "#Antigo Testamento\nO Antigo Testamento, também conhecido como Escrituras Hebraicas, tem 46 livros e constitui a primeira grande parte da Bíblia cristã, e a totalidade da Bíblia hebraica Tanakh. Foram compostos em sua grande maioria em hebraico e partes em aramaico.\n\n#Novo Testamento\nNovo Testamento é o nome dado à coleção de livros que compõe a segunda parte da Bíblia cristã, cujo conteúdo foi escrito após a morte, ressurreição e ascensão de Jesus Cristo e é dirigido explicitamente aos cristãos, embora dentro da religião cristã tanto o Antigo Testamento quanto o Novo Testamento são considerados, em conjunto, Escrituras Sagradas.\n\n- Download: http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/15ugkXYAt4RKhwHV85jTK6FcpVS6nqScCV/Bblia%20em%20PDF%20%20NVI%20(Nova%20Verso%20Internacional)%20Portugus.zip\n\n- Download(alternativa): https://mega.nz/#!Hfo1hIgS!yfY6KX9LZcC3av3ea_P8RMSkjylsCvWAirxX46yb3A0\n\n- SHA-256: f56dcb82da639d3da36e4c8a1baab4d15f919d1c4f6a1d9a96a4396b990caf1b",
			"added": 1549730269
		},
		{
			"topic_id": 3,
			"title": "Só sei que nada sei",
			"body": "\"Qual a primeira obrigação daquele que quer adquirir a sabedoria? Abandonar a presunção. Pois é impossível começar a aprender aquilo que se pensa já conhecer\" (Epictetus, Discursos, livro 2, cap. 17)",
			"added": 1549754128
		}
	],
	"topic_vote": {
		"1_15ugkXYAt4RKhwHV85jTK6FcpVS6nqScCV": 1,
		"2_15ugkXYAt4RKhwHV85jTK6FcpVS6nqScCV": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"1_1CEzchEWM961SEdamhHtAsV4cnwtHiWJkw": 1,
		"3_15ugkXYAt4RKhwHV85jTK6FcpVS6nqScCV": 1,
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1,
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": 1
	},
	"next_comment_id": 33,
	"comment": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 1,
				"body": "#Bíblia em PDF – NVI (Nova Versão Internacional) Português\n- http://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:2_15ugkXYAt4RKhwHV85jTK6FcpVS6nqScCV/B+blia+em+PDF+NVI+Nova+Vers+o+Internacional+Portugu+s",
				"added": 1549730601
			},
			{
				"comment_id": 2,
				"body": "Este é o registro da descendência de Adão: Quando Deus criou o homem, à semelhança de Deus o fez;\nhomem e mulher os criou. Quando foram criados, ele os abençoou e os chamou Homem.\nAos 130 anos, Adão gerou um filho à sua semelhança, conforme a sua imagem; e deu-lhe o nome de Sete.\nDepois que gerou Sete, Adão viveu 800 anos e gerou outros filhos e filhas.\nViveu ao todo 930 anos e morreu.\nAos 105 anos, Sete gerou Enos.\nDepois que gerou Enos, Sete viveu 807 anos e gerou outros filhos e filhas.\nViveu ao todo 912 anos e morreu.\nAos 90 anos, Enos gerou Cainã.\nDepois que gerou Cainã, Enos viveu 815 anos e gerou outros filhos e filhas.\nViveu ao todo 905 anos e morreu.\nAos 70 anos, Cainã gerou Maalaleel.\nDepois que gerou Maalaleel, Cainã viveu 840 anos e gerou outros filhos e filhas.\nViveu ao todo 910 anos e morreu.\nAos 65 anos, Maalaleel gerou Jarede.\nDepois que gerou Jarede, Maalaleel viveu 830 anos e gerou outros filhos e filhas.\nViveu ao todo 895 anos e morreu.\nAos 162 anos, Jarede gerou Enoque.\nDepois que gerou Enoque, Jarede viveu 800 anos e gerou outros filhos e filhas.\nViveu ao todo 962 anos e morreu.\nAos 65 anos, Enoque gerou Matusalém.\nDepois que gerou Matusalém, Enoque andou com Deus 300 anos e gerou outros filhos e filhas.\nViveu ao todo 365 anos.\nEnoque andou com Deus; e já não foi encontrado, pois Deus o havia arrebatado.\nAos 187 anos, Matusalém gerou Lameque.\nDepois que gerou Lameque, Matusalém viveu 782 anos e gerou outros filhos e filhas.\nViveu ao todo 969 anos e morreu.\nAos 182 anos, Lameque gerou um filho.\nDeu-lhe o nome de Noé e disse: \"Ele nos aliviará do nosso trabalho e do sofrimento de nossas mãos, causados pela terra que o SENHOR amaldiçoou\".\nDepois que Noé nasceu, Lameque viveu 595 anos e gerou outros filhos e filhas.\nViveu ao todo 777 anos e morreu.\nAos 500 anos, Noé tinha gerado Sem, Cam e Jafé.\n\n- Gênesis 5:1-32",
				"added": 1549741685
			},
			{
				"comment_id": 3,
				"body": "Jesus tinha cerca de trinta anos de idade quando começou seu ministério. Ele era, como se pensava, filho de José, filho de Eli,\nfilho de Matate, filho de Levi, filho de Melqui, filho de Janai, filho de José,\nfilho de Matatias, filho de Amós, filho de Naum, filho de Esli, filho de Nagai,\nfilho de Maate, filho de Matatias, filho de Semei, filho de Joseque, filho de Jodá,\nfilho de Joanã, filho de Ressa, filho de Zorobabel, filho de Salatiel, filho de Neri,\nfilho de Melqui, filho de Adi, filho de Cosã, filho de Elmadã, filho de Er,\nfilho de Josué, filho de Eliézer, filho de Jorim, filho de Matate, filho de Levi,\nfilho de Simeão, filho de Judá, filho de José, filho de Jonã, filho de Eliaquim,\nfilho de Meleá, filho de Mená, filho de Matatá, filho de Natã, filho de Davi,\nfilho de Jessé, filho de Obede, filho de Boaz, filho de Salmom, filho de Naassom,\nfilho de Aminadabe, filho de Ram, filho de Esrom, filho de Perez, filho de Judá,\nfilho de Jacó, filho de Isaque, filho de Abraão, filho de Terá, filho de Naor,\nfilho de Serugue, filho de Ragaú, filho de Faleque, filho de Éber, filho de Salá,\nfilho de Cainã, filho de Arfaxade, filho de Sem, filho de Noé, filho de Lameque,\nfilho de Matusalém, filho de Enoque, filho de Jarede, filho de Maalaleel, filho de Cainã,\nfilho de Enos, filho de Sete, filho de Adão, filho de Deus.\n\n- Lucas 3:23-38",
				"added": 1549742197
			},
			{
				"comment_id": 4,
				"body": "Registro da genealogia de Jesus Cristo, filho de Davi, filho de Abraão:\nAbraão gerou Isaque; Isaque gerou Jacó; Jacó gerou Judá e seus irmãos;\nJudá gerou Perez e Zerá, cuja mãe foi Tamar; Perez gerou Esrom; Esrom gerou Arão;\nArão gerou Aminadabe; Aminadabe gerou Naassom; Naassom gerou Salmom;\nSalmom gerou Boaz, cuja mãe foi Raabe; Boaz gerou Obede, cuja mãe foi Rute; Obede gerou Jessé;\ne Jessé gerou o rei Davi. Davi gerou Salomão, cuja mãe tinha sido mulher de Urias;\nSalomão gerou Roboão; Roboão gerou Abias; Abias gerou Asa;\nAsa gerou Josafá; Josafá gerou Jorão; Jorão gerou Uzias;\nUzias gerou Jotão; Jotão gerou Acaz; Acaz gerou Ezequias;\nEzequias gerou Manassés; Manassés gerou Amom; Amom gerou Josias;\ne Josias gerou Jeconias e seus irmãos, no tempo do exílio na Babilônia.\nDepois do exílio na Babilônia: Jeconias gerou Salatiel; Salatiel gerou Zorobabel;\nZorobabel gerou Abiúde; Abiúde gerou Eliaquim; Eliaquim gerou Azor;\nAzor gerou Sadoque; Sadoque gerou Aquim; Aquim gerou Eliúde;\nEliúde gerou Eleazar; Eleazar gerou Matã; Matã gerou Jacó;\ne Jacó gerou José, marido de Maria, da qual nasceu Jesus, que é chamado Cristo.\nAssim, ao todo houve catorze gerações de Abraão a Davi, catorze de Davi até o exílio na Babilônia e catorze do exílio até o Cristo.\nFoi assim o nascimento de Jesus Cristo: Maria, sua mãe, estava prometida em casamento a José, mas, antes que se unissem, achou-se grávida pelo Espírito Santo.\n\n- Mateus 1:1-18",
				"added": 1549742367
			},
			{
				"comment_id": 5,
				"body": "No mundo todo havia apenas uma língua, um só modo de falar.\nSaindo os homens do Oriente, encontraram uma planície em Sinear e ali se fixaram.\nDisseram uns aos outros: \"Vamos fazer tijolos e queimá-los bem\". Usavam tijolos em lugar de pedras, e piche em vez de argamassa.\nDepois disseram: \"Vamos construir uma cidade, com uma torre que alcance os céus. Assim nosso nome será famoso e não seremos espalhados pela face da terra\".\nO Senhor desceu para ver a cidade e a torre que os homens estavam construindo.\nE disse o Senhor: \"Eles são um só povo e falam uma só língua, e começaram a construir isso. Em breve nada poderá impedir o que planejam fazer.\nVenham, desçamos e confundamos a língua que falam, para que não entendam mais uns aos outros\".\nAssim o Senhor os dispersou dali por toda a terra, e pararam de construir a cidade.\nPor isso foi chamada Babel, porque ali o Senhor confundiu a língua de todo o mundo. Dali o Senhor os espalhou por toda a terra.\nEste é o registro da descendência de Sem: Dois anos depois do Dilúvio, aos 100 anos de idade, Sem gerou Arfaxade.\nE depois de ter gerado Arfaxade, Sem viveu 500 anos e gerou outros filhos e filhas.\nAos 35 anos, Arfaxade gerou Salá.\nDepois que gerou Salá, Arfaxade viveu 403 anos e gerou outros filhos e filhas.\nAos 30 anos, Salá gerou Héber.\nDepois que gerou Héber, Salá viveu 403 anos e gerou outros filhos e filhas.\nAos 34 anos, Héber gerou Pelegue.\nDepois que gerou Pelegue, Héber viveu 430 anos e gerou outros filhos e filhas.\nAos 30 anos, Pelegue gerou Reú.\nDepois que gerou Reú, Pelegue viveu 209 anos e gerou outros filhos e filhas.\nAos 32 anos, Reú gerou Serugue.\nDepois que gerou Serugue, Reú viveu 207 anos e gerou outros filhos e filhas.\nAos 30 anos, Serugue gerou Naor.\nDepois que gerou Naor, Serugue viveu 200 anos e gerou outros filhos e filhas.\nAos 29 anos, Naor gerou Terá.\nDepois que gerou Terá, Naor viveu 119 anos e gerou outros filhos e filhas.\nAos 70 anos, Terá havia gerado Abrão, Naor e Harã.\nEsta é a história da família de Terá: Terá gerou Abrão, Naor e Harã. E Harã gerou Ló.\nHarã morreu em Ur dos caldeus, sua terra natal, quando ainda vivia Terá, seu pai.\nTanto Abrão como Naor casaram-se. O nome da mulher de Abrão era Sarai, e o nome da mulher de Naor era Milca; esta era filha de Harã, pai de Milca e de Iscá.\nOra, Sarai era estéril; não tinha filhos.\nTerá tomou seu filho Abrão, seu neto Ló, filho de Harã, e sua nora Sarai, mulher de seu filho Abrão, e juntos partiram de Ur dos caldeus para Canaã. Mas, ao chegarem a Harã, estabeleceram-se ali.\nTerá viveu 205 anos e morreu em Harã.\n\n- Gênesis 11:1-32",
				"added": 1549742980
			},
			{
				"comment_id": 6,
				"body": "Quatrocentos e oitenta anos depois que os israelitas saíram do Egito, no quarto ano do reinado de Salomão em Israel, no mês de zive, o segundo mês, ele começou a construir o templo do Senhor.\nO templo que o rei Salomão construiu para o Senhor media vinte e sete metros de comprimento, nove metros de largura e treze metros e meio de altura.\nO pórtico da entrada do santuário tinha a largura do templo, que era de nove metros, e avançava quatro metros e meio à frente do templo.\nEle fez para o templo, janelas com grades estreitas.\nJunto às paredes do átrio principal e do santuário interior, construiu uma estrutura em torno do edifício, na qual havia salas laterais.\nO andar inferior tinha dois metros e vinte e cinco centímetros de largura, o andar intermediário tinha dois metros e setenta centímetros e o terceiro andar tinha três metros e quinze centímetros. Ele fez saliências de apoio nas paredes externas do templo, de modo que não houve necessidade de perfurar as paredes.\nNa construção do templo só foram usados blocos lavrados nas pedreiras, e não se ouviu no templo nenhum barulho de martelo, nem de talhadeira, nem de qualquer outra ferramenta de ferro durante a sua construção.\nA entrada para o andar inferior ficava no lado sul do templo; uma escada conduzia até o andar intermediário e dali ao terceiro.\nAssim ele construiu o templo e o terminou, fazendo-lhe um forro com vigas e tábuas de cedro.\nE fez as salas laterais ao longo de todo o templo. Cada uma tinha dois metros e vinte e cinco centímetros de altura, e elas estavam ligadas ao templo por vigas de cedro.\nE a palavra do Senhor veio a Salomão dizendo:\n\"Quanto a este templo que você está construindo, se você seguir os meus decretos, executar os meus juízos e obedecer a todos os meus mandamentos, cumprirei por meio de você a promessa que fiz ao seu pai Davi,\nviverei no meio dos israelitas e não abandonarei Israel, o meu povo\".\nE assim Salomão concluiu a construção do templo.\nForrou as paredes do templo por dentro com tábuas de cedro, cobrindo-as desde o chão até o teto, e fez o soalho do templo com tábuas de pinho.\nSeparou nove metros na parte de trás do templo, fazendo uma divisão com tábuas de cedro, do chão ao teto, para formar dentro do templo o santuário interno, o Lugar Santíssimo.\nO átrio principal em frente dessa sala media dezoito metros de comprimento.\nO interior do templo era de cedro, com figuras entalhadas de frutos e flores abertas. Tudo era de cedro; não se via pedra alguma.\nPreparou também o santuário interno no templo para ali colocar a arca da aliança do Senhor.\nO santuário interno tinha nove metros de comprimento, nove de largura e nove de altura. Ele revestiu o interior de ouro puro, e também revestiu de ouro o altar de cedro.\nSalomão cobriu o interior do templo de ouro puro, e estendeu correntes de ouro em frente do santuário interno, que também foi revestido de ouro.\nAssim, revestiu de ouro todo o interior do templo e também o altar que pertencia ao santuário interno.\nNo santuário interno ele esculpiu dois querubins de madeira de oliveira, cada um com quatro metros e meio de altura.\nAs asas abertas dos querubins mediam dois metros e vinte e cinco centímetros: quatro metros e meio da ponta de uma asa à ponta da outra.\nOs dois querubins tinham a mesma medida e a mesma forma.\nA altura de cada querubim era de quatro metros e meio.\nEle colocou os querubins, com as asas abertas, no santuário interno do templo. A asa de um querubim encostava numa parede, e a do outro encostava na outra. As suas outras asas encostavam uma na outra no meio do santuário.\nEle revestiu os querubins de ouro.\nNas paredes ao redor do templo, tanto na parte interna como na externa, ele esculpiu querubins, tamareiras e flores abertas.\nTambém revestiu de ouro os pisos, tanto na parte interna como na externa do templo.\nPara a entrada do santuário interno fez portas de oliveira com batentes de cinco lados.\nE nas duas portas de madeira de oliveira esculpiu querubins, tamareiras e flores abertas, e revestiu os querubins e as tamareiras de ouro batido.\nTambém fez pilares de quatro lados, de madeira de oliveira para a entrada do templo.\nFez também duas portas de pinho, cada uma com duas folhas que se articulavam por meio de dobradiças.\nEntalhou figuras de querubins, de tamareiras e de flores abertas nas portas e as revestiu todas igualmente de ouro batido.\nE construiu o pátio interno com três camadas de pedra lavrada e uma de vigas de cedro.\nO alicerce do templo do Senhor foi lançado no mês de zive do quarto ano.\nNo mês de bul, o oitavo mês, do décimo primeiro ano, o templo foi terminado em todos os seus detalhes, de acordo com as suas especificações. Ele levou sete anos para construí-lo.\n\n- 1 Reis 6:1-38",
				"added": 1549743092
			},
			{
				"comment_id": 7,
				"body": "Então, no nono ano do reinado de Zedequias, no décimo dia do décimo mês, Nabucodonosor, rei da Babilônia, marchou contra Jerusalém com todo o seu exército. Ele acampou em frente da cidade e construiu rampas de ataque ao redor dela.\nA cidade foi mantida sob cerco até o décimo primeiro ano do reinado de Zedequias.\nNo nono dia do quarto mês, a fome na cidade havia se tornado tão severa que não havia nada para o povo comer.\nEntão o muro da cidade foi rompido, e todos os soldados fugiram de noite pela porta entre os dois muros próximos ao jardim do rei, embora os babilônios estivessem em torno da cidade. Fugiram na direção da Arabá,\nmas o exército babilônio perseguiu o rei e o alcançou nas planícies de Jericó. Todos os seus soldados o abandonaram,\ne ele foi capturado. Foi levado até o rei da Babilônia, em Ribla, onde pronunciaram a sentença contra ele.\nExecutaram os filhos de Zedequias na sua frente; depois furaram seus olhos, prenderam-no com algemas de bronze e o levaram para a Babilônia.\nNo sétimo dia do quinto mês do décimo nono ano do reinado de Nabucodonosor, rei da Babilônia, Nebuzaradã, comandante da guarda imperial, conselheiro do rei da Babilônia, foi a Jerusalém.\nIncendiou o templo do Senhor, o palácio real, todas as casas de Jerusalém e todos os edifícios importantes.\nTodo o exército babilônio, que acompanhava Nebuzaradã derrubou os muros de Jerusalém.\nE ele levou para o exílio o povo que sobrou na cidade, os que passaram para o lado do rei da Babilônia e o restante da população.\nMas alguns dos mais pobres do país o comandante deixou para trás, para trabalharem nas vinhas e nos campos.\nOs babilônios destruíram as colunas de bronze, os suportes e o tanque de bronze que estavam no templo do Senhor, e levaram o bronze para a Babilônia.\nTambém levaram as panelas, as pás, os cortadores de pavio, as vasilhas e todos os utensílios de bronze utilizados no serviço do templo.\nO comandante da guarda imperial levou os incensários e as bacias de aspersão, tudo o que era feito de ouro puro ou prata.\nAs duas colunas, o tanque e os suportes, que Salomão fizera para o templo do Senhor, eram mais do que podia ser pesado.\nCada coluna tinha oito metros e dez centímetros de altura. O capitel de bronze no alto de cada coluna tinha um metro e trinta e cinco centímetros de altura e era decorado com uma fileira de romãs de bronze ao redor.\nO comandante da guarda levou como prisioneiros o sumo sacerdote, Seraías, Sofonias, o segundo sacerdote, e os três guardas da porta.\nDos que ainda estavam na cidade, ele levou o oficial responsável pelos homens de combate e cinco conselheiros reais. Também levou o secretário, principal líder responsável pelo alistamento militar no país e sessenta homens do povo.\nO comandante Nebuzaradã levou a todos ao rei da Babilônia, em Ribla.\nLá, em Ribla, na terra de Hamate, o rei mandou executá-los. Assim Judá foi para o exílio, para longe de sua terra.\nNabucodonosor, rei da Babilônia, nomeou Gedalias, filho de Aicam e neto de Safã, como governador do povo que havia sido deixado em Judá.\nQuando Ismael, filho de Netanias, Joanã, filho de Careá, Seraías, filho do netofatita Tanumete, e Jazanias, filho de um maacatita, todos os líderes do exército, souberam que o rei da Babilônia havia nomeado Gedalias como governador, eles e seus soldados foram falar com Gedalias em Mispá.\nGedalias fez um juramento a esses líderes e a seus soldados, dizendo: \"Não tenham medo dos oficiais babilônios. Estabeleçam-se nesta terra e sirvam o rei da Babilônia, e tudo lhes irá bem\".\nMas no sétimo mês, Ismael, filho de Netanias e neto de Elisama, que tinha sangue real, foi com dez homens e assassinou Gedalias e os judeus e os babilônios que estavam com ele em Mispá.\nEntão todo o povo, desde as crianças até os velhos, juntamente com os líderes do exército, fugiram para o Egito, com medo dos babilônios.\nNo trigésimo sétimo ano do exílio de Joaquim, rei de Judá, no ano em que Evil-Merodaque se tornou rei da Babilônia, ele tirou Joaquim da prisão, no dia vinte e sete do décimo segundo mês.\nEle lhe tratou com bondade e deu-lhe o lugar mais honrado entre os outros reis que estavam com ele na Babilônia.\nAssim, Joaquim deixou suas vestes de prisão e pelo resto de sua vida comeu à mesa do rei.\nE diariamente, enquanto viveu, Joaquim recebeu uma pensão do rei.\n\n- 2 Reis 25:1-30",
				"added": 1549743187
			},
			{
				"comment_id": 8,
				"body": "No princípio Deus criou os céus e a terra.\nEra a terra sem forma e vazia; trevas cobriam a face do abismo, e o Espírito de Deus se movia sobre a face das águas.\nDisse Deus: \"Haja luz\", e houve luz.\nDeus viu que a luz era boa, e separou a luz das trevas.\nDeus chamou à luz dia, e às trevas chamou noite. Passaram-se a tarde e a manhã; esse foi o primeiro dia.\nDepois disse Deus: \"Haja entre as águas um firmamento que separe águas de águas\".\nEntão Deus fez o firmamento e separou as águas que estavam embaixo do firmamento das que estavam por cima. E assim foi.\nAo firmamento Deus chamou céu. Passaram-se a tarde e a manhã; esse foi o segundo dia.\nE disse Deus: \"Ajuntem-se num só lugar as águas que estão debaixo do céu, e apareça a parte seca\". E assim foi.\nÀ parte seca Deus chamou terra, e chamou mares ao conjunto das águas. E Deus viu que ficou bom.\nEntão disse Deus: \"Cubra-se a terra de vegetação: plantas que dêem sementes e árvores cujos frutos produzam sementes de acordo com as suas espécies\". E assim foi.\nA terra fez brotar a vegetação: plantas que dão sementes de acordo com as suas espécies, e árvores cujos frutos produzem sementes de acordo com as suas espécies. E Deus viu que ficou bom.\nPassaram-se a tarde e a manhã; esse foi o terceiro dia.\nDisse Deus: \"Haja luminares no firmamento do céu para separar o dia da noite. Sirvam eles de sinais para marcar estações, dias e anos,\ne sirvam de luminares no firmamento do céu para iluminar a terra\". E assim foi.\nDeus fez os dois grandes luminares: o maior para governar o dia e o menor para governar a noite; fez também as estrelas.\nDeus os colocou no firmamento do céu para iluminar a terra,\ngovernar o dia e a noite, e separar a luz das trevas. E Deus viu que ficou bom.\nPassaram-se a tarde e a manhã; esse foi o quarto dia.\nDisse também Deus: \"Encham-se as águas de seres vivos, e sobre a terra voem aves sob o firmamento do céu\".\nAssim Deus criou os grandes animais aquáticos e os demais seres vivos que povoam as águas, de acordo com as suas espécies; e todas as aves, de acordo com as suas espécies. E Deus viu que ficou bom.\nEntão Deus os abençoou, dizendo: \"Sejam férteis e multipliquem-se! Encham as águas dos mares! E multipliquem-se as aves na terra\".\nPassaram-se a tarde e a manhã; esse foi o quinto dia.\nE disse Deus: \"Produza a terra seres vivos de acordo com as suas espécies: rebanhos domésticos, animais selvagens e os demais seres vivos da terra, cada um de acordo com a sua espécie\". E assim foi.\nDeus fez os animais selvagens de acordo com as suas espécies, os rebanhos domésticos de acordo com as suas espécies, e os demais seres vivos da terra de acordo com as suas espécies. E Deus viu que ficou bom.\nEntão disse Deus: \"Façamos o homem à nossa imagem, conforme a nossa semelhança. Domine ele sobre os peixes do mar, sobre as aves do céu, sobre os animais grandes de toda a terra e sobre todos os pequenos animais que se movem rente ao chão\".\nCriou Deus o homem à sua imagem, à imagem de Deus o criou; homem e mulher os criou.\nDeus os abençoou, e lhes disse: \"Sejam férteis e multipliquem-se! Encham e subjuguem a terra! Dominem sobre os peixes do mar, sobre as aves do céu e sobre todos os animais que se movem pela terra\".\nDisse Deus: \"Eis que lhes dou todas as plantas que nascem em toda a terra e produzem sementes, e todas as árvores que dão frutos com sementes. Elas servirão de alimento para vocês.\nE dou todos os vegetais como alimento a tudo o que tem em si fôlego de vida: a todos os grandes animais da terra, a todas as aves do céu e a todas as criaturas que se movem rente ao chão\". E assim foi.\nE Deus viu tudo o que havia feito, e tudo havia ficado muito bom. Passaram-se a tarde e a manhã; esse foi o sexto dia.\n\n- Gênesis 1:1-31",
				"added": 1549743716
			},
			{
				"comment_id": 9,
				"body": "#Cronologia Ussher\n A cronologia de Ussher é uma cronologia do século XVII da história do mundo formulada a partir de uma leitura literal do Antigo Testamento por James Ussher , Arcebispo de Armagh e Primaz de Toda a Irlanda . A cronologia é algumas vezes associada ao criacionismo da Terra jovem , que sustenta que o Universo foi criado há apenas alguns milênios por Deus, como descrito nos dois primeiros capítulos do livro bíblico de Gênesis . Ussher caiu em descrédito no século XIX. \n- https://translate.google.com.br/translate?sl=auto&tl=pt&u=https%3A%2F%2Fen.wikipedia.org%2Fwiki%2FUssher_chronology",
				"added": 1549743757
			},
			{
				"comment_id": 10,
				"body": "#Annals of the World\nJames Ussher ou simplesmente Usher foi um Arcebispo de Armagh. Baseando-se na Bíblia, escreveu o livro The Annals of the World em 1658. Neste livro, Ussher fez uma cronologia da vida na Terra baseada em estudos bíblicos e de outras fontes, de tal maneira concluiu que a criação do mundo ocorreu no dia 23 de outubro do ano 4004 antes de Cristo pelo calendário juliano. Na época, a afirmação foi amplamente aceita.\n\n- https://archive.org/download/AnnalsOfTheWorld/Annals.pdf",
				"added": 1549743844
			},
			{
				"comment_id": 11,
				"body": "> [vandamme](#comment_8_15ugkXYAt4RKhwHV85jTK6FcpVS6nqScCV): No princípio Deus criou os céus e a terra.Era a terra sem forma e vazia; trevas cobriam a face do abismo, e o Espírito de Deus se movia sobre a face das águas.Disse Deus: \"Haja luz\", e houve luz.Deus viu que a luz era boa, e separou a luz das trevas.Deus chamou à luz dia, e às trevas chamou noite. Passaram-se a tarde e a manhã; esse foi o primeiro dia.Depois disse Deus: \"Haja entre as águas um firmamento que separe águas de águas\".Então Deus fez o firmamento e separou as águas que estavam embaixo do firmamento das que estavam por cima. E assim foi.Ao firmamento Deus chamou céu. Passaram-se a tarde e a manhã; esse foi o segundo dia.E disse Deus: \"Ajuntem-se num só lugar as águas que estão debaixo do céu, e apareça a parte seca\". E assim foi.À parte seca Deus chamou terra, e chamou mares ao conjunto das águas. E Deus viu que ficou bom.Então disse Deus: \"Cubra-se a terra de vegetação: plantas que dêem sementes e árvores cujos frutos produzam sementes de acordo com as suas espécies\". E assim foi.A terra fez brotar a vegetação: plantas que dão sementes de acordo com as suas espécies, e árvores cujos frutos produzem sementes de acordo com as suas espécies. E Deus viu que ficou bom.Passaram-se a tarde e a manhã; esse foi o terceiro dia.Disse Deus: \"Haja luminares no firmamento do céu para separar o dia da noite. Sirvam eles de sinais para marcar estações, dias e anos,e sirvam de luminares no firmamento do céu para iluminar a terra\". E assim foi.Deus fez os dois grandes luminares: o maior para governar o dia e o menor para governar a noite; fez também as estrelas.Deus os colocou no firmamento do céu para iluminar a terra,governar o dia e a noite, e separar a luz das trevas. E Deus viu que ficou bom.Passaram-se a tarde e a manhã; esse foi o quarto dia.Disse também Deus: \"Encham-se as águas de seres vivos, e sobre a terra voem aves sob o firmamento do céu\".Assim Deus criou os grandes animais aquáticos e os demais seres vivos que povoam as águas, de acordo com as suas espécies; e todas as aves, de acordo com as suas espécies. E Deus viu que ficou bom.Então Deus os abençoou, dizendo: \"Sejam férteis e multipliquem-se! Encham as águas dos mares! E multipliquem-se as aves na terra\".Passaram-se a tarde e a manhã; esse foi o quinto dia.E disse Deus: \"Produza a terra seres vivos de acordo com as suas espécies: rebanhos domésticos, animais selvagens e os demais seres vivos da terra, cada um de acordo com a sua espécie\". E assim foi.Deus fez os animais selvagens de acordo com as suas espécies, os rebanhos domésticos de acordo com as suas espécies, e os demais seres vivos da terra de acordo com as suas espécies. E Deus viu que ficou bom.Então disse Deus: \"Façamos o homem à nossa imagem, conforme a nossa semelhança. Domine ele sobre os peixes do mar, sobre as aves do céu, sobre os animais grandes de toda a terra e sobre todos os pequenos animais que se movem rente ao chão\".Criou Deus o homem à sua imagem, à imagem de Deus o criou; homem e mulher os criou.Deus os abençoou, e lhes disse: \"Sejam férteis e multipliquem-se! Encham e subjuguem a terra! Dominem sobre os peixes do mar, sobre as aves do céu e sobre todos os animais que se movem pela terra\".Disse Deus: \"Eis que lhes dou todas as plantas que nascem em toda a terra e produzem sementes, e todas as árvores que dão frutos com sementes. Elas servirão de alimento para vocês.E dou todos os vegetais como alimento a tudo o que tem em si fôlego de vida: a todos os grandes animais da terra, a todas as aves do céu e a todas as criaturas que se movem rente ao chão\". E assim foi.E Deus viu tudo o que havia feito, e tudo havia ficado muito bom. Passaram-se a tarde e a manhã; esse foi o sexto dia.\n> \n> Gênesis 1:1-31\n\nAssim foram concluídos os céus e a terra, e tudo o que neles há.\nNo sétimo dia Deus já havia concluído a obra que realizara, e nesse dia descansou.\nAbençoou Deus o sétimo dia e o santificou, porque nele descansou de toda a obra que realizara na criação.\nEsta é a história das origens dos céus e da terra, no tempo em que foram criados: Quando o Senhor Deus fez a terra e os céus,\nainda não tinha brotado nenhum arbusto no campo, e nenhuma planta havia germinado, porque o Senhor Deus ainda não tinha feito chover sobre a terra, e também não havia homem para cultivar o solo.\nTodavia brotava água da terra e irrigava toda a superfície do solo.\nEntão o Senhor Deus formou o homem do pó da terra e soprou em suas narinas o fôlego de vida, e o homem se tornou um ser vivente.\nOra, o Senhor Deus tinha plantado um jardim no Éden, para os lados do leste; e ali colocou o homem que formara.\nO Senhor Deus fez nascer então do solo todo tipo de árvores agradáveis aos olhos e boas para alimento. E no meio do jardim estavam a árvore da vida e a árvore do conhecimento do bem e do mal.\nNo Éden nascia um rio que irrigava o jardim, e depois se dividia em quatro.\nO nome do primeiro é Pisom. Ele percorre toda a terra de Havilá, onde existe ouro.\nO ouro daquela terra é excelente; lá também existem o bdélio e a pedra de ônix.\nO segundo, que percorre toda a terra de Cuxe, é o Giom.\nO terceiro, que corre pelo lado leste da Assíria, é o Tigre. E o quarto rio é o Eufrates.\nO Senhor Deus colocou o homem no jardim do Éden para cuidar dele e cultivá-lo.\nE o Senhor Deus ordenou ao homem: \"Coma livremente de qualquer árvore do jardim,\nmas não coma da árvore do conhecimento do bem e do mal, porque no dia em que dela comer, certamente você morrerá\".\nEntão o Senhor Deus declarou: \"Não é bom que o homem esteja só; farei para ele alguém que o auxilie e lhe corresponda\".\nDepois que formou da terra todos os animais do campo e todas as aves do céu, o Senhor Deus os trouxe ao homem para ver como este lhes chamaria; e o nome que o homem desse a cada ser vivo, esse seria o seu nome.\nAssim o homem deu nomes a todos os rebanhos domésticos, às aves do céu e a todos os animais selvagens. Todavia não se encontrou para o homem alguém que o auxiliasse e lhe correspondesse.\nEntão o Senhor Deus fez o homem cair em profundo sono e, enquanto este dormia, tirou-lhe uma das costelas, fechando o lugar com carne.\nCom a costela que havia tirado do homem, o Senhor Deus fez uma mulher e a trouxe a ele.\nDisse então o homem: \"Esta, sim, é osso dos meus ossos e carne da minha carne! Ela será chamada mulher, porque do homem foi tirada\".\nPor essa razão, o homem deixará pai e mãe e se unirá à sua mulher, e eles se tornarão uma só carne.\nO homem e sua mulher viviam nus, e não sentiam vergonha.\n\n- Gênesis 2:1-25",
				"added": 1549743992
			},
			{
				"comment_id": 12,
				"body": "#LIVRO DO GÊNESIS\nGênesis é o primeiro livro da Bíblia, que conta sobre as origens do mundo, da humanidade, do pecado e do grande plano de Deus para nos salvar. Nesse livro também descobrimos de onde veio o povo de Israel e como Deus estabeleceu Sua aliança com eles.\n\nGênesis significa “origem”.\n- https://web.archive.org/web/20170314000317/https://www.apostolas.org.br/2010/capela/biblia/antigo/Pentateuco/Genesis.pdf",
				"added": 1549744627
			},
			{
				"comment_id": 13,
				"body": "Seja a amabilidade de vocês conhecida por todos. Perto está o Senhor.\nNão andem ansiosos por coisa alguma, mas em tudo, pela oração e súplicas, e com ação de graças, apresentem seus pedidos a Deus.\nE a paz de Deus, que excede todo o entendimento, guardará os seus corações e as suas mentes em Cristo Jesus.\nFinalmente, irmãos, tudo o que for verdadeiro, tudo o que for nobre, tudo o que for correto, tudo o que for puro, tudo o que for amável, tudo o que for de boa fama, se houver algo de excelente ou digno de louvor, pensem nessas coisas.\n\n- Filipenses 4:5-8",
				"added": 1549745959
			},
			{
				"comment_id": 14,
				"body": "#Apócrifos da Bíblia e Pseudo-Epígrafos\n\n\"Resultado da tradição oral dos primeiros crentes da era cristã, os apócrifos tornaram-se importantes documentos reveladores do modo como vivia e pensava uma grande parcela da cristandade, cuja voz ficou abafada pela Igreja Oficial. [...] A publicação dos proscritos da Bíblia converte-se em uma nova contribuição para os interessados em aprofundar os estudos das Sagradas Escritura, através de seu cotejo com a produção literária apartada do cânon tradicional.\" - Prof. Dr. Jaime dos Reis Sant'Anna.\n\n- https://mega.nz/#!Pmo0DYqZ!nEpf0MBoNBN6SX9r6L8MJGUa9j03_dtb4YmWSSPBU3g",
				"added": 1549749573
			},
			{
				"comment_id": 15,
				"body": "#O LIVRO DE ENOQUE\n\nO livro de Enoch é um texto apócrifo que é mencionado por algumas cartas do Novo Testamento (Judas, Hebreus e 2ª de Pedro). Até a elaboração da Vulgata, por volta do ano 400, os primeiros seguidores de Cristo o mencionavam abertamente em seus textos e o aceitavam como real. Após a Vulgata ele caiu no esquecimento. Entretanto, o livro é muito interessante e parece real. O livro de Enoch foi preservado somente em uma cópia, na totalidade, em etíope e, por esta razão, também é chamado de Enoch etíope.\n\n- https://mega.nz/#!zmpCEIIC!E35AGyalk_XP3TuaP8FpgAq-jqX9Kt4C7pY_s03sSnE",
				"added": 1549750174
			},
			{
				"comment_id": 16,
				"body": "#O Livro de Mateus\n- https://web.archive.org/web/20170708025935/http://www.adventistas.com/wp-content/uploads/2014/05/EvangelhodosHebreus.pdf",
				"added": 1549750651
			},
			{
				"comment_id": 17,
				"body": "#Arca da Aliança\nA Arca da Aliança é descrita na Bíblia como o objeto em que as tábuas dos Dez mandamentos e outros objetos sagrados teriam sido guardadas, como também veículo de comunicação entre Deus e seu povo escolhido. Foi utilizada pelos hebreus até seu desaparecimento, que segundo especulações, ocorreu na conquista de Jerusalém por Nabucodonosor. Segundo o livro de II Macabeus, o profeta Jeremias foi o responsável por escondê-la no Monte Nebo.",
				"added": 1549751642
			},
			{
				"comment_id": 18,
				"body": "Disse o Senhor a Moisés:\n\"Diga aos israelitas que me tragam uma oferta. Receba-a de todo aquele cujo coração o compelir a dar.\nEstas são as ofertas que deverá receber deles: ouro, prata e bronze,\nfios de tecido azul, roxo e vermelho, linho fino, pêlos de cabra,\npeles de carneiro tingidas de vermelho, couro, madeira de acácia,\nazeite para iluminação; especiarias para o óleo da unção e para o incenso aromático;\npedras de ônix e outras pedras preciosas para serem encravadas no colete sacerdotal e no peitoral.\n\"E farão um santuário para mim, e eu habitarei no meio deles.\nFaçam tudo como eu lhe mostrar, conforme o modelo do tabernáculo e de cada utensílio.\n\"Faça uma arca de madeira de acácia com um metro e dez centímetros de comprimento, setenta centímetros de largura e setenta centímetros de altura.\nRevista-a de ouro puro, por dentro e por fora, e faça uma moldura de ouro ao seu redor.\nMande fundir quatro argolas de ouro para ela e prenda-as em seus quatro pés, com duas argolas de um lado e duas do outro.\nDepois faça varas de madeira de acácia, revista-as de ouro\ne coloque-as nas argolas laterais da arca, para que possa ser carregada.\nAs varas permanecerão nas argolas da arca; não devem ser retiradas.\nEntão coloque dentro da arca as tábuas da aliança que lhe darei.\n\"Faça uma tampa de ouro puro com um metro e dez centímetros de comprimento por setenta centímetros de largura,\ncom dois querubins de ouro batido nas extremidades da tampa.\nFaça um querubim numa extremidade e o segundo na outra, formando uma só peça com a tampa.\nOs querubins devem ter suas asas estendidas para cima, cobrindo com elas a tampa. Ficarão de frente um para o outro, com o rosto voltado para a tampa.\nColoque a tampa sobre a arca, e dentro dela as tábuas da aliança que darei a você.\nAli, sobre a tampa, no meio dos dois querubins que se encontram sobre a arca da aliança, eu me encontrarei com você e lhe darei todos os meus mandamentos destinados aos israelitas.\n\"Faça uma mesa de madeira de acácia com noventa centímetros de comprimento, quarenta e cinco centímetros de largura e setenta centímetros de altura.\nRevista-a de ouro puro e faça uma moldura de ouro ao seu redor.\nFaça também ao seu redor uma borda com a largura de quatro dedos e uma moldura de ouro para essa borda.\nFaça quatro argolas de ouro para a mesa e prenda-as nos quatro cantos dela, onde estão os seus quatro pés.\nAs argolas devem ser presas próximas da borda para que sustentem as varas usadas para carregar a mesa.\nFaça as varas de madeira de acácia, revestindo-as de ouro; com elas se carregará a mesa.\nFaça de ouro puro os seus pratos e o recipiente para incenso, as suas tigelas e as bacias nas quais se derramam as ofertas de bebidas.\nColoque sobre a mesa os pães da Presença, para que estejam sempre diante de mim.\n\"Faça um candelabro de ouro puro e batido. O pedestal, a haste, as taças, as flores e os botões do candelabro formarão com ele uma só peça.\nSeis braços sairão do candelabro: três de um lado e três do outro.\nHaverá três taças com formato de flor de amêndoa num dos braços, cada uma com botão e flor, e três taças com formato de flor de amêndoa no braço seguinte, cada uma com botão e flor. Assim será com os seis braços que saem do candelabro.\nNa haste do candelabro haverá quatro taças com formato de flor de amêndoa, cada uma com botão e flor.\nHaverá um botão debaixo de cada par dos seis braços que saem do candelabro.\nOs braços com seus botões formarão uma só peça com o candelabro, tudo feito de ouro puro e batido.\n\"Faça-lhe também sete lâmpadas e coloque-as nele para que iluminem a frente dele.\nSeus cortadores de pavio e seus apagadores serão de ouro puro.\nCom trinta e cinco quilos de ouro puro faça o candelabro e todos esses utensílios.\nTenha o cuidado de fazê-lo segundo o modelo que lhe foi mostrado no monte\".\n\n- Êxodo 25:1-40",
				"added": 1549751771
			},
			{
				"comment_id": 19,
				"body": "#Kebra Negast\n\nO Kebra Negast ou Kebra Nagast, em português Glória dos Reis, é um livro que conta a história lendária da origem da Dinastia salomónica dos Imperadores da Etiópia.\n\nEscrita em ge'ez há mais de 700 anos, é considerada por muitos membros da Igreja Ortodoxa Etíope e do movimento Rastafari como uma obra de inspiração divina.\n\nO texto foi redatado por volta do século XIII, na mesma época em que chegava ao trono da Etiópia a dinastia de Salomão, que justificava seu poder com base na tradição bíblica. Narra a história do encontro entre Makeda, rainha de Sabá, com o rei Salomão, de cuja união nasce Menelik, primeiro imperador da dinastia etíope (Negusa Negast, ou \"Rei dos Reis\"). Também conta como a Arca da Aliança teria sido trazida à Etiópia, onde até hoje estaria localizada na Igreja de Santa Maria de Sião, em Axum.\n\nO Kebra Negast estabelece a dinastia real etíope como herdeira da tradição israelita e teve um papel muito importante na conformação da cultura do país, uma nação cristã cercada pelo mundo árabe islámico.\n\n- https://web.archive.org/web/20180907183200/http://www.yorku.ca/inpar/kebra_budge.pdf",
				"added": 1549752121
			},
			{
				"comment_id": 20,
				"body": "Melhor é um pedaço de pão seco com paz e tranqüilidade do que uma casa onde há banquetes, e muitas brigas.\nO servo sábio dominará sobre o filho de conduta vergonhosa, e participará da herança como um dos irmãos.\nO crisol é para a prata e o forno é para o ouro, mas o Senhor prova o coração.\nO ímpio dá atenção aos lábios maus; o mentiroso dá ouvidos à língua destruidora.\nQuem zomba dos pobres mostra desprezo pelo Criador deles; quem se alegra com a desgraça não ficará sem castigo.\nOs filhos dos filhos são uma coroa para os idosos, e os pais são o orgulho dos seus filhos.\nOs lábios arrogantes não ficam bem ao insensato; muito menos os lábios mentirosos ao governante!\nO suborno é um recurso fascinante para aquele que o oferece; aonde quer que vá, ele tem sucesso.\nAquele que cobre uma ofensa promove amor, mas quem a lança em rosto separa bons amigos.\nA repreensão faz marca mais profunda no homem de entendimento do que cem açoites no tolo.\nO homem mau só pende para a rebeldia; por isso um oficial impiedoso será enviado contra ele.\nMelhor é encontrar uma ursa da qual roubaram os filhotes do que um tolo em sua insensatez.\nQuem retribui o bem com o mal, jamais deixará de ter mal no seu lar.\nComeçar uma discussão é como abrir brecha num dique; por isso resolva a questão antes que surja a contenda.\nAbsolver o ímpio e condenar o justo, são coisas que o Senhor odeia.\nDe que serve o dinheiro na mão do tolo, já que ele não quer obter sabedoria?\nO amigo ama em todos os momentos; é um irmão na adversidade.\nO homem sem juízo, com um aperto de mãos se compromete e se torna fiador do seu próximo.\nQuem ama a discussão ama o pecado; quem constrói portas altas está procurando a sua ruína.\nO homem de coração perverso não prospera, e o de língua enganosa cai na desgraça.\nO filho tolo só dá tristeza, e nenhuma alegria tem o pai do insensato.\nO coração bem disposto é remédio eficiente, mas o espírito oprimido resseca os ossos.\nO ímpio aceita às escondidas o suborno para desviar o curso da justiça.\nO homem de discernimento mantém a sabedoria em vista, mas os olhos do tolo perambulam até os confins da terra.\nO filho tolo é a tristeza do seu pai e a amargura daquela que o deu à luz.\nNão é bom castigar o inocente, nem açoitar quem merece ser honrado.\nQuem tem conhecimento é comedido no falar, e quem tem entendimento é de espírito sereno.\nAté o insensato passará por sábio, se ficar quieto, e, se contiver a língua, parecerá que tem discernimento.\n\n- Provérbios 17:1-28",
				"added": 1549752572
			},
			{
				"comment_id": 21,
				"body": "#Não se esqueçam disto, amados: para o Senhor um dia é como mil anos, e mil anos como um dia.\nO Senhor não demora em cumprir a sua promessa, como julgam alguns. Pelo contrário, ele é paciente com vocês, não querendo que ninguém pereça, mas que todos cheguem ao arrependimento.\n\n2 Pedro 3:8,9",
				"added": 1549753054
			},
			{
				"comment_id": 22,
				"body": "Para tudo há uma ocasião, e um tempo para cada propósito debaixo do céu:\ntempo de nascer e tempo de morrer, tempo de plantar e tempo de arrancar o que se plantou,\ntempo de matar e tempo de curar, tempo de derrubar e tempo de construir,\ntempo de chorar e tempo de rir, tempo de prantear e tempo de dançar,\ntempo de espalhar pedras e tempo de ajuntá-las, tempo de abraçar e tempo de se conter,\ntempo de procurar e tempo de desistir, tempo de guardar e tempo de lançar fora,\ntempo de rasgar e tempo de costurar, tempo de calar e tempo de falar,\ntempo de amar e tempo de odiar, tempo de lutar e tempo de viver em paz.\nO que ganha o trabalhador com todo o seu esforço?\nTenho visto o fardo que Deus impôs aos homens.\nEle fez tudo apropriado a seu tempo. Também pôs no coração do homem o anseio pela eternidade; mesmo assim este não consegue compreender inteiramente o que Deus fez.\nDescobri que não há nada melhor para o homem do que ser feliz e praticar o bem enquanto vive.\nDescobri também que poder comer, beber e ser recompensado pelo seu trabalho, é um presente de Deus.\nSei que tudo o que Deus faz permanecerá para sempre; a isso nada se pode acrescentar, e disso nada se pode tirar. Deus assim faz para que os homens o temam.\nAquilo que é, já foi, e o que será já foi anteriormente; Deus investigará o passado.\nDescobri também que debaixo do sol: No lugar da justiça havia impiedade, no lugar da retidão, ainda mais impiedade.\nPensei comigo mesmo: O justo e o ímpio, Deus julgará a ambos, pois há um tempo para todo propósito, um tempo para tudo o que acontece.\nTambém pensei: Deus prova os homens para que vejam que são como os animais.\nO destino do homem é o mesmo do animal; o mesmo destino os aguarda. Assim como morre um, também morre o outro. Todos têm o mesmo fôlego de vida; o homem não tem vantagem alguma sobre o animal. Nada faz sentido!\nTodos vão para o mesmo lugar; vieram todos do pó, e ao pó todos retornarão.\nQuem pode dizer se o fôlego do homem sobe às alturas e se o fôlego do animal desce para a terra?\nPor isso concluí que não há nada melhor para o homem do que desfrutar do seu trabalho, porque esta é a sua recompensa. Pois, quem poderá fazê-lo ver o que acontecerá depois de morto?\n\n- Eclesiastes 3:1-22",
				"added": 1549754180
			},
			{
				"comment_id": 23,
				"body": "De novo voltei a minha atenção e vi toda a opressão que ocorre debaixo do sol: Vi as lágrimas dos oprimidos, mas não há quem os console; o poder estava do lado dos seus opressores, e não há quem os console.\nPor isso considerei os mortos, mais felizes do que os vivos, pois estes ainda têm que viver!\nNo entanto, melhor do que ambos é aquele que ainda não nasceu, que não viu o mal que se faz debaixo do sol.\nDescobri que todo trabalho e toda realização surgem da competição que existe entre as pessoas. Mas isso também é absurdo, é correr atrás do vento.\nO tolo cruza os braços e destrói a própria vida.\nMelhor é ter um punhado com tranqüilidade do que dois punhados à custa de muito esforço e de correr atrás do vento.\nDescobri ainda outra situação absurda debaixo do sol:\nHavia um homem totalmente solitário; não tinha filho nem irmão. Trabalhava sem parar! Contudo, os seus olhos não se satisfaziam com a sua riqueza. Ele sequer perguntava: \"Para quem estou trabalhando tanto, e por que razão deixo de me divertir? \" Isso também é absurdo. É um trabalho muito ingrato!\nÉ melhor ter companhia do que estar sozinho, porque maior é a recompensa do trabalho de duas pessoas.\nSe um cair, o amigo pode ajudá-lo a levantar-se. Mas pobre do homem que cai e não tem quem o ajude a levantar-se!\nE se dois dormirem juntos, vão manter-se aquecidos. Como, porém, manter-se aquecido sozinho?\nUm homem sozinho pode ser vencido, mas dois conseguem defender-se. Um cordão de três dobras não se rompe com facilidade.\nMelhor é um jovem pobre e sábio, do que um rei idoso e tolo, que não mais aceita repreensão.\nO jovem pode ter saído da prisão e chegado ao trono, ou pode ter nascido pobre no país daquele rei.\nPercebi que, ainda assim, o povo que vivia debaixo do sol seguia o jovem, o sucessor do rei.\nO número dos que aderiram a ele era incontável. A geração seguinte, porém, não ficou satisfeita com o sucessor. Isso também não faz sentido, é correr atrás do vento.\n\n- Eclesiastes 4:1-16",
				"added": 1549754261
			},
			{
				"comment_id": 24,
				"body": "Quando você for ao santuário de Deus, seja reverente. Quem se aproxima para ouvir é melhor do que os tolos que oferecem sacrifício sem saber que estão agindo mal.\nNão seja precipitado de lábios, nem apressado de coração para fazer promessas diante de Deus. Deus está nos céus, e você está na terra, por isso, fale pouco.\nDas muitas ocupações brotam sonhos; do muito falar nasce a prosa vã do tolo.\nQuando você fizer um voto, cumpra-o sem demora, pois os tolos desagradam a Deus; cumpra o seu voto.\nÉ melhor não fazer voto do que fazer e não cumprir.\n\n- Eclesiastes 5:1-5",
				"added": 1549754322
			},
			{
				"comment_id": 25,
				"body": "#Deus perdoa tudo?\n\nSIM, Deus perdoa todos os pecados daqueles que aceitaram a Seu Filho Jesus Cristo como seu Senhor e Salvador.\n\n#Então Deus perdoa todos os pecados?\n\nAlgo que nos pode ajudar a entender como as coisas funcionam é pensar que para quem crê em Jesus, todos os pecados são perdoáveis (e perdoados), enquanto que para quem não crê em Jesus, nenhum pecado é perdoável (e perdoado).\n\nPara os que são verdadeiramente salvos todos os pecados são perdoados, pode confiar, mesmo que o inimigo queira te convencer do contrário. Essa é uma das suas estratégias para te deixar confuso e triste.\n\n#E o pecado imperdoável?\n\nJesus disse que existe um pecado que é imperdoável, a blasfêmia contra o Espírito Santo (Marcos 3:29, Mateus 12:31-32, Lucas 12:10).\n\nExistem várias perspetivas sobre o que Jesus quis dizer quando disse que a blasfêmia contra o Espírito Santo era imperdoável.\n\nUma das mais comuns e mais simples explicações diz que o pecado eterno, ou pecado imperdoável é rejeitar Jesus como Salvador. Jesus disse isso a pessoas que tinham acabado de ver Jesus fazer um milagre. O Espírito Santo, que nos convence sobre quem Jesus é, estava sendo rejeitado naquele momento, eles estavam atribuindo o milagre a Satanás. Eles estavam se recusando a aceitar Jesus como Messias.\n\n#Devemos continuar pecando?\n\nMas se Deus perdoa tudo, então podemos continuar pecando? O Apóstolo Paulo sabia que muitas pessoas podiam começar a fazer essa pergunta, e por isso ele mesmo escreveu o seguinte em Romanos 6:1-2:\n\n#Que diremos então? Continuaremos pecando para que a graça aumente? De maneira nenhuma! Nós, os que morremos para o pecado, como podemos continuar vivendo nele?\n\nNa sua misericórdia, Deus perdoa todos os pecados daqueles que estão mortos para o pecado e vivos em Cristo. Mas o objetivo de todo cristão é buscar a santidade. Uma das marcas daqueles que são verdadeiramente salvos é a vontade de ser cada vez mais parecido com Jesus e deixar o pecado para trás. Isso é verdadeiro arrependimento.",
				"added": 1549754458
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 26,
				"body": "#Crítica da Razão Pura\n\nCrítica da razão pura, principal obra de Immanuel Kant, divide a história da filosofia em duas: antes e depois da Crítica. Num momento em que a filosofia dividia-se em racionalistas de um lado e empiristas de outro, procurou Kant demonstrar que o nosso conhecimento é, necessariamente, tanto empírico como racional, inaugurando, com isso, uma posição singular no debate filosófico, criando as bases para a Teoria do Conhecimento como disciplina filosófica. Entrar no universo da Crítica da razão pura é aceitar o desafio, colocado pelo próprio Kant, de evitar o dogmatismo sem cair no relativismo; evitar o absoluto sem cair no nada.\n\n- https://web.archive.org/web/20180608232838/https://www.marxists.org/portugues/kant/1781/mes/pura.pdf\n\n\n#Crítica da Razão Prática\n\nEssa obra mostra-se fundamental para a compreensão da filosofia moral kantiana na medida em que Kant, respondendo às diversas objeções levantadas por seus contemporâneos, oferece uma nova exposição da razão prática pura - com recurso à polêmica noção de \"fato da razão\" -, apresenta uma concepção mais elaborada do conceito de respeito enquanto sentimento moral e introduz os conceitos de sumo bem e de postulados práticos para dar resposta ao problema da relação entre felicidade e virtude.\n\n- https://web.archive.org/web/20180717134437/https://www.marxists.org/portugues/kant/1788/mes/pratica.pdf\n\n\n#Crítica do Julgamento\n\nA Crítica do Julgamento, ou Crítica do Juízo, (em alemão, Kritik der Urteilskraft) é um livro escrito pelo filósofo Immanuel Kant, em 1790. Terceira das três críticas publicadas, é nesta obra que Kant apresenta e discute o conceito de juízo estético.\n\nO título da obra que tem melhor tradução do alemão por Crítica da Faculdade do Juízo, é a terceira e última crítica elaborada pelo filósofo alemão Immanuel Kant. A primeira, Crítica da Razão Pura, examina os limites da razão quanto as possibilidade a priori do conhecimento. A segunda, Crítica da Razão Prática, discorre sobre os limites dos princípios morais já fundamentados a priori na razão. Nesta terceira obra, Kant busca além da razão, ele investiga os limites daquilo que podemos conhecer pela nossa faculdade de julgar, que leva em consideração não apenas a razão, mas também a memória e os sentimentos. Em sua primeira parte – Crítica da Faculdade de Juízo Estético – Kant realiza a analítica do belo através das categorias (qualidade, quantidade, finalismo e modo), do sublime e introduz a noção de gênio. Apesar de Kant discorrer sobre o sublime, ao gênio e consequentemente às Belas Artes não se pode dizer que formulou uma teoria estética já que o juízo estético é reflexionante, portanto subjetivo. Kant não chega numa teoria estética, mas funda as bases da teoria de Hegel, poucos anos depois.\n\n- https://web.archive.org/web/20171013112215/https://www.eduardoguerreirolosso.com/Immanuel-Kant-critica-do-juizo.pdf",
				"added": 1549760709
			},
			{
				"comment_id": 31,
				"body": "#Origens do Totalitarismo – Hannah Arendt\nEscrita em 1951, esta obra trouxe um contributo fundamental para a compreensão do totalitarismo, tanto no caso soviético com a luta de classes, como no nazismo com a luta de raças. Hannah Arendt apresenta um quadro completo da organização totalitária, a sua implantação, a propaganda, o modo como manipula as massas e se apropria do Estado com vista à dominação total. A sua crítica da razão governamental totalitária ainda hoje é pertinente, numa época onde vigoram regimes com estas características e, mais do que isso, num terreno onde a democracia liberal não afastou por completo os vestígios de uma ideologia de terror que torna o homem supérfluo. Com a sua lúcida análise, percebemos por que motivo o campo [de concentração] se encontra no âmago do totalitarismo.\n#No final Arendt deixa uma «profecia» desconcertante: «As soluções totalitárias podem muito bem sobreviver à queda dos regimes totalitários sob a forma de forte tentação que surgirá sempre que pareça impossível aliviar a miséria política, social ou económica de um modo digno do homem.»\n\n- https://web.archive.org/web/20190119042422/http://dhnet.org.br/direitos/anthist/marcos/hdh_arendt_origens_totalitarismo.pdf",
				"added": 1549766007
			},
			{
				"comment_id": 32,
				"body": "#Livros digitais; poderiam tornar a censura e a “queima de livros” mais fácil?\n\n“Libertadores civis e defensores dos consumidores chamam isso de“ queima de livros digitais ”: censurar, apagar, alterar ou restringir o acesso a livros em formatos eletrônicos. Embora ainda não tenhamos visto o ebook equivalente a fogueiras orquestradas pelo governo ou cidadãos privados colocando livros “obscenos” na lanterna, há uma tendência preocupante à medida que nos mudamos para a nuvem. ”(Jonathan Zittrain, wired.co. Reino Unido, 8 de julho de 2013).\n\nEspecialistas alertam que a publicação digital de livros pode facilitar a censura desses livros e / ou desaparecer, já que eles não pertencem ao público. Quando os compradores de livros eletrônicos compraram cópias da Orwell's '1984' no Kindle da Amazon em 2009, o livro ainda estava sob proteção de direitos autorais e a Amazon conseguiu deletá-lo de todos os usuários do Kindle que já haviam comprado e baixado o formato digital.\n\nO controle ilimitado dos livros digitais, que os distribuidores de e-books têm, pode no futuro se tornar um método de controlar os leitores, como demonstrado pela capacidade da Amazon de excluir o livro dos Kindles dos usuários com o clique de um botão.\n\nOs formatos digitais para as artes e cultura, como livros, pinturas, esculturas e arquitetura, foram considerados para ajudar na preservação das artes, como as páginas de um livro digital não vão cair com o tempo, ou uma versão digital de alta resolução de uma pintura não se desvanece (o Google Arts Project é apenas um novo banco de dados on-line que seguiu essa ideia). No entanto, os formatos digitalizados poderiam ter o efeito oposto? Se a produção de formatos físicos for reduzida, devido ao uso crescente de formatação digital, apagar um livro digitalmente poderia reduzir a circulação dos livros, ou mesmo, em casos extremos, significar sua extinção. A retratação de livros digitais é tão fácil, que alegações de violação de direitos autorais ou plágio podem ter um livro digital virtualmente arrancado das mãos dos compradores de livros eletrônicos. O controle sobre a retração de livros digitais, que os distribuidores mantêm, evidencia uma clara necessidade de novas leis que protejam os direitos dos leitores.\n\n- Fonte: https://www.digitalmeetsculture.net/article/digital-books-could-they-make-censorship-and-book-burning-easier/",
				"added": 1549768952
			}
		],
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": [
			{
				"comment_id": 27,
				"body": "#Ludwig Wittgenstein\nConsiderado por alguns como o maior filósofo do século XX, Ludwig Wittgenstein desempenhou um papel central, embora controverso, na filosofia analítica do século XX. Ele continua a influenciar o pensamento filosófico atual em tópicos tão diversos como lógica e linguagem, percepção e intenção, ética e religião, estética e cultura. Originalmente, havia dois estágios comumente reconhecidos do pensamento de Wittgenstein - o precoce e o posterior - que foram considerados essenciais em seus respectivos períodos. Em estudos mais recentes, essa divisão tem sido questionada: alguns intérpretes reivindicam uma unidade entre todos os estágios de seu pensamento, enquanto outros falam de uma divisão mais nuançada, acrescentando estágios como o Wittgenstein intermediário e o terceiro Wittgenstein. Ainda assim, é comumente reconhecido que o primeiro Wittgenstein é sintetizado em seu Tractatus Logico-Philosophicus. Ao mostrar a aplicação da lógica moderna à metafísica, via linguagem, ele forneceu novos insights sobre as relações entre mundo, pensamento e linguagem e, portanto, sobre a natureza da filosofia. É o último Wittgenstein, reconhecido principalmente nas Investigações Filosóficas, que deu um passo mais revolucionário ao criticar toda a filosofia tradicional, incluindo seu clímax em seus primeiros trabalhos. A natureza de sua nova filosofia é anunciada como anti-sistemática através e através de, mas ainda conduz à compreensão filosófica genuína dos problemas tradicionais.\n- https://plato.stanford.edu/entries/wittgenstein/",
				"added": 1549762331
			},
			{
				"comment_id": 28,
				"body": "#Outras mentes\n\nO problema de outras mentes é o problema de como justificar a crença quase universal de que os outros têm mentes muito parecidas com as nossas. É um dos problemas consagrados da filosofia, se hoje em dia fora de moda. Várias soluções para o problema estão em oferta. Vale ressaltar que muitos estão em oferta. Ainda mais digno de nota é que nenhuma das soluções oferecidas pode plausivelmente reivindicar o apoio da maioria.\n\n- https://plato.stanford.edu/entries/other-minds/",
				"added": 1549762953
			},
			{
				"comment_id": 30,
				"body": "#Solipsismo e o problema das outras mentes\n\nO solipsismo é algumas vezes expresso como a visão de que \"eu sou a única mente que existe\" ou \"meus estados mentais são os únicos estados mentais\". No entanto, o único sobrevivente de um holocausto nuclear pode realmente vir a acreditar em qualquer uma dessas proposições sem, desse modo, ser um solipsista. O solipsismo é, portanto, mais apropriadamente considerado como a doutrina de que, em princípio, \"existência\" significa para mim a minha existência e a dos meus estados mentais. Existência é tudo que eu experimento - objetos físicos, outras pessoas, eventos e processos - qualquer coisa que seria comumente considerada como um constituinte do espaço e do tempo em que eu coexistir com os outros e é necessariamente interpretada por mim como parte do conteúdo. da minha consciência. Para o solipsista, não é apenas o caso em que ele acredita que seus pensamentos, experiências e emoções são, por uma questão de fato contingente, os únicos pensamentos, experiências e emoções. Em vez disso, o solipsista não pode atribuir significado à suposição de que poderia haver pensamentos, experiências e emoções além das suas. Em resumo, o verdadeiro solipsista entende a palavra \"dor\", por exemplo, como \"minha dor\". Ele não pode, portanto, conceber como essa palavra deve ser aplicada em qualquer outro sentido que não seja exclusivamente egocêntrico.\n\n- https://www.iep.utm.edu/solipsis/",
				"added": 1549763206
			}
		]
	},
	"comment_vote": {
		"29_1PqwSiizFr8j1LRqegXwZPixWiQEntzc3c": 1,
		"21_15ugkXYAt4RKhwHV85jTK6FcpVS6nqScCV": 1,
		"25_15ugkXYAt4RKhwHV85jTK6FcpVS6nqScCV": 1,
		"26_15ugkXYAt4RKhwHV85jTK6FcpVS6nqScCV": 1,
		"9_1A3BnoFadzUFATBLL6XRR8rzs5AsE3T39R": 1,
		"31_15ugkXYAt4RKhwHV85jTK6FcpVS6nqScCV": 1
	}
}