{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1585526551,
			"title": "Wuhan Virus/Covid 19 Smoking Gun",
			"body": "An interesting and in depth article on the roots, reasons and misdirection of current events throughout the world  https://harvardtothebighouse.com/2020/01/31/logistical-and-technical-analysis-of-the-origins-of-the-wuhan-coronavirus-2019-ncov/\n\nhttps://www.youtube.com/watch?v=LlplnH3VYyc",
			"added": 1585526550
		},
		{
			"topic_id": 1607957446,
			"title": "Chinese infiltration throughout the world companies",
			"body": "https://www.skynews.com.au/details/_6215946537001 \nSaid list of CCP party members details  https://gofile.io/d/Jo8W92",
			"added": 1607957444
		},
		{
			"topic_id": 1609457070,
			"title": "The Great Reset Resources",
			"body": "https://winteroak.org.uk/the-great-reset/",
			"added": 1609457067
		},
		{
			"topic_id": 1615243851,
			"title": "Death by Eugenics",
			"body": "https://unlimitedhangout.com/2020/12/investigative-series/developers-of-oxford-astrazeneca-vaccine-tied-to-uk-eugenics-movement/",
			"added": 1615243847
		}
	],
	"topic_vote": {
		"1580617751_1G5J3JZZ6SZtdsSAS3etngxaTXjcNg25ge": 1,
		"1583945887_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1586880504_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": 1,
		"1587791009_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": 1,
		"1604495423_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": 1,
		"1605111093_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": 1,
		"1605635582_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1607823667_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"1608065397_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1612546234_1Phd1v4EgBWqCeAjGD7gtspkpFL8Z6GbkP": 1,
		"1612976844_16E25Tu9jf8GTS2S1W5mZs6Ayc9vQkC8SN": 1,
		"1613419711_16E25Tu9jf8GTS2S1W5mZs6Ayc9vQkC8SN": 1,
		"1614109016_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1615938385_1LnUZ9Csee6oXiuNsZXXWvtBTeT3qHFT4y": 1,
		"1616435266_165aBifCkjbWxo7rEf9ZaiCv39NpinQAtp": 1,
		"1616953116_15cApprVFcr1skAkWssq5aAXKa7pDwJJve": 1,
		"1617087999_16u7ApvQbcH9sGVJV5ELBvY1AQiZLnbDKN": 1,
		"1627296188_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj": 1
	},
	"next_comment_id": 81,
	"comment": {
		"1580617751_1G5J3JZZ6SZtdsSAS3etngxaTXjcNg25ge": [
			{
				"comment_id": 1,
				"body": "thankyou!",
				"added": 1580679260
			}
		],
		"1581696052_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 2,
				"body": "> [fractalzoomer@kxoid.bit](#comment_15_1GhYmYygr9AwgLDix4ge5AAQiMa4voJGuC): Devuan\n\nI tried when it forked for the Debian main having hated systemd and much preferred init.d/rc.* coming from a Unix/Solaris/Linux circa 1998), however aside a few niche  distros everyone has engrossed systemd in its entirity (and I have learned to live with it for now), so for me I accept  as is and use  Deb derivatives dependent on how I feel. Purists will say otherwise and in the end its down to preference what you use.",
				"added": 1581726160
			},
			{
				"comment_id": 3,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1878_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): lol \"i have my own distro for years now\":meaning i can yell and laugh 'at you' anytime i want. Enjoy the \"actual state of linuxs because i do, 'was there before', and 'as usual I took the lead' before you. you complain: I ENJOY. lol\".\n\nMaking your own distro is a complete waste of time, because by the time you have fixed bugs, issues on latest CVEs you're back to square 1 as it  a self fulling prophesy every week. Good luck getting vendor drivers to support your old and ageing hardware as time passes by. All in all an expensive waste of time and money unless you have a thriving community to support  it.",
				"added": 1582844505
			},
			{
				"comment_id": 4,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1878_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): lol \"i have my own distro for years now\":meaning i can yell and laugh 'at you' anytime i want. Enjoy the \"actual state of linuxs because i do, 'was there before', and 'as usual I took the lead' before you. you complain: I ENJOY. lol\".\n\nAnd I'm sure its upto date, no CVE and totally secure...suuuure, maybe it is, but you waste your  sad little life just so you can say otherwise, congratulations.",
				"added": 1583873616
			}
		],
		"1585516116_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 5,
				"body": "I live in the middle of the countryside, watching the panic buying subsiding now that all the idiots have maxed out on more than they can consume in any time frame. My family is avoiding all contact unless its for food (just me) once a week and I can work remotely with  my job, so hopefully over time then the chaos will subside, however I am not watching any main stream media as its pure sensationalism on a grand scale.",
				"added": 1585526273
			}
		],
		"1587761800_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro": [
			{
				"comment_id": 6,
				"body": "Matrix with Jitsi for alternate video messaging https://matrix.org/blog/2020/04/06/running-your-own-secure-communication-service-with-matrix-and-jitsi  alot of the others mentioned are good (nextcloud is good)",
				"added": 1587934172
			}
		],
		"1593096815_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 7,
				"body": "Which Distro? Linux  (Windows no idea) \nHW I assume, if its virtual then it depends on what/where /how... you need to be more specific\n\nIf this is a physical host and you can mount your host disks with a bootable media and recover everything under /var/lib/docker. tar everything up in /var/lib/docker, scp the tar archive to your new host. On your new host ensure docker is installed, group permission added to the required new user. \n\nEnsure docker is enabled, however stopped...(backup your existing /var/lib/docker if you're using it or have been, then extract the tar archive into the directory (ensure  you have the same permsissons/ownership as before.  Then startup Docker via systemctl/service or whatever your flavour uses.  This will recover all your images, containers prior to you losing your server, however...\n\nHINT: Don't run any sort of host that isn't back up off site via USB drive (n+1), cloud storage(personally I don't) or a home NAS or some redundant storage solution. I hope this helps",
				"added": 1593128086
			},
			{
				"comment_id": 8,
				"body": "> [robione](#comment_566_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): I use a self hosted setup with Cloudron.io that does all this for you. [...]\nthats fine, but when it goes pear shaped you have no idea and if you want to learn more its always a good curve to pick up new skills.",
				"added": 1593548006
			},
			{
				"comment_id": 9,
				"body": "> [merithtk](#comment_57_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): I like to be in control of my systems myself, no thanls\n\nSame here, I don't like being spoon fed something that I am not in control of or can't get underneath and configure accordingly.",
				"added": 1593643959
			},
			{
				"comment_id": 10,
				"body": "> [merithtk](#comment_56_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): Ubuntu 18.04 [...]\n\nB> [merithtk](#comment_56_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): Ubuntu 18.04 [...]\n\nAll LTS releases, basically even numbers years now (used to be every multiple of 4) get 10 years of updates. At some point should you still have the host you will need to upgrade, but that a long way off for now. If theres no need to upgrade and you're not bothered then leave it, however should you decide to upgrade ensure you have an offisite BACKUP before you start. The upgrade process/experience from Ubuntu has vastly improved over the years. I never used to do it (when I used it back in 8.04-12.04 days) as it created too many problems it solved.",
				"added": 1593644352
			}
		],
		"1593886909_1EQgeyAy9uQj8GCkPm7ha3jFdrj8Fz8pjL": [
			{
				"comment_id": 11,
				"body": "PHPbb.. what decade is this from? I  seem to remember starting my first website with phpbb back the early 2000s and no https, so not really any idea by the looks of it to gain any traction by anyone.. or any search engine. I'd say learn the basics and then bring a  service  to market, otherwise  it will amount to nothing which seems the case currently. If its not open source then you need a hefty bespoke feature rich list for people to use and to want to pay for which is highly doubtful.",
				"added": 1593992684
			}
		],
		"1593971855_12MBVCw8iNrKvgTrV5NMPtPf6Z5V2WRHYU": [
			{
				"comment_id": 12,
				"body": "If you enjoy pain and suffering maybe... or depends on what your learning curve/persusion is.. pfsense isfreebsd as an open source FW/router...however outside day to day theres plenty more Linux distros you can try/check out...  The latest and greatest can be found here... https://distrowatch.com/  and if you want an impartial take on new distros/features listen to https://linuxunplugged.com/",
				"added": 1593992896
			}
		],
		"1594145192_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 13,
				"body": "Open terminal as root:\n\n    sudo su  #this is bad practice, and inherently wrong... you should be using sudoers and 'sudo su'  will not give you login-specific resource files such as .bash_profile .profile or .login  and will be read by the shell. Neither will it drop yo u into the root ~. this will place you in the current working directory you were in prior to running sudo and enable you delete any files without any recourse whatsoever.\n\nIf this is required sudo -i  or sudo -s (gives you the root user shell) would be more optimal...however you should be reading the man pages before running random commands online with no or little knowledge.\n\nType the following command:\n\n    rm /etc/apt/preferences.d/nosnap.pref  - why are you deleting this file to later rely on it for recovery?\n\nTo disable snapd again:\n\n    Open terminal as root:\n\n        sudo su  - we're already logged in as root, says it all really.\n\nThese steps are how not to run escalated privilege tasks in any Linux distro.\n\nLesson to learn, do not run commands you have no idea about because someone blogged out it.",
				"added": 1594246540
			},
			{
				"comment_id": 14,
				"body": "> [styromaniac](#comment_2459_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Whatever, mate. It's pretty plain to see the instructions are legit and they're found on other reputable sites. [...]\n\nIts not a question of being legit, its a question of being woefully executed, anyway I don't care",
				"added": 1594506490
			},
			{
				"comment_id": 17,
				"body": "> [styromaniac](#comment_2468_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): What are the differences between sudo -i and sudo -s?\n\n-i  run login shell as the target user; a command may also be specified\n-s run shell as the target user; a command may also be specified \n\npersonally I use -i  when I require  root as it will pick up variables that you may expect to use, however in most or all instances its better to user sudoers and define the  correct access,  anything else is lazy and in production you can screw yourself over very easily.",
				"added": 1595068292
			},
			{
				"comment_id": 18,
				"body": "> [styromaniac](#comment_2488_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): And you only have to use either just once per terminal session?\n\nunless you exit out or you ssh config drops your connection  if configured that way. yes.",
				"added": 1595110889
			},
			{
				"comment_id": 19,
				"body": "I would also query why are you deleting 'rm /etc/apt/preferences.d/nosnap.pref' when simply copying it to an alternate location or appending a file extension for later use .bak,  orig or even moving  as it a hidden file unless the   directory is searched by snapd  'mv /etc/apt/preferences.d/nosnap.pref mv .nosnap.pref\n\nStep 3-5  are a waste of time and commands ( you wouldn't want  to do this for a file with 5 or 10lines or more.. far easier to run\n\ncat << EOF > nosnap.pref\nPackage: snapd\nPin: release a=*\nPin-Priority: -10\nEOF",
				"added": 1595369041
			}
		],
		"1594835373_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 15,
				"body": "> [randname666](#comment_37_1HpSHmnQ3cp4oP3hRQsqr1f4U5T7ZL29zK): Actually you can do more than that. By running that caddy on a computer with public IP or a VPS, you can access to ZeroNet wherever you are, without using ZeroNet client and to wait for things to sync up. This is insecure though. Also, if you run a Internet website and it's CGI rendered, by fetching Zite first (HTML, JS, CSS, assets, ...) from the caddy then insert it into the website, you can even display ZeroNet contents inside your Internet website.\n\nSomething similar using a Zero W and Digitalocean/cloud provider",
				"added": 1595033345
			},
			{
				"comment_id": 16,
				"body": "> [binary1173](#comment_15_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G): Something similar using a Zero W and Digitalocean/cloud provider\n\nMight help if I add the link \nhttps://blog.alexellis.io/raspberry-pi-zero-tunnel-gateway/",
				"added": 1595068003
			}
		],
		"1602918342_1BKJiQF8pvdQw99D1XpTG2UJ6eno1zFPCK": [
			{
				"comment_id": 20,
				"body": "The  first rule of trading has nothing to do with choosing stocks or investing. The market is driven by fear and greed which is a reflection of the price action/market sentiment of a particular asset. You first need to understand  why you lost  so much, in essence the weak point in the equation being you, not your choice of stocks and is risk management is and how to correctly position yourself in and out of trades. I would recommend reading https://www.amazon.co.uk/gp/product/0735201447/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&psc=1\n\nAfter understanding this can you only understand how the markets work and how the weak point (you)in the equation needs to behave. Personally I have traded/trade Forex markets due to it being a 24/5 market (Sunday evening to Friday evening) and being way bigger than any  Equity/commodity exchanges....roughty $4Trn per day.\n\nUnderstand fundamental/technical analysis dependent on your  requirements. Don't overload yourself with Western technical (ignore any news outlets as they  only talk about what has happened and have no idea what is going to happen in the main and you won't learn anything from them)as alot tend to be lagging indicators however with Candlesticks (Steve Nison on youtube brought candlesticks to the Western world in the 80s (the Japanese used them from the 1500/1600s to trade rice so they tell a story..complimented  with Western technicals your winning trades will eventually become more successful than your losing ones) so  I would watch absorb anything he says.\n\nOnce you have educated yourself then only then would I open a broker account and paper trade what you have learnt and disciplined yourself to understand and comprehend. Do this for a long time before you even attempt to invest/throw away any money on stocks and continually educate yourself (Steve Nison also does paid training which I am sure you can find on other sites). After that you will start to understand why and how not  to lose money.\n\nWise words from Warren Buffett \nhttps://www.investopedia.com/financial-edge/0210/rules-that-warren-buffett-lives-by.aspx\n\nI will say you have to spend money (education) to make money and it doesn't come just because you are trading..otherwise you're gambling like all the other idiots who think they know what they're doing.",
				"added": 1602939691
			},
			{
				"comment_id": 21,
				"body": "> [grouch0](#comment_8_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt): binary makes some good points but neglected to mention some major factors such as the markets are rigged and manipulated. No matter how smart you are unless you're an insider or top man in a major fund you will never have the edge. [...]\n\nValid points yes indeed, however at some point dependent on your portfolio you need to come to market (most of my portfolio has recovered from the lows seen and posting healthly returns for the year, otherwise all your assets will be illiquid (art, fine wine or whateve)  and hard to liquidate in a rush.I would advocate any portfolio at least 10%  needs precious metals that can't be rebased/revalued by any governments. Crypto obviously has a part to play. However in essence he main criteria is down to Risk and your time frame for the individual...stock picking requires careful attention by anyone as I have proved this year, as I said you have to pay for good advice which  I do. Having an interest in finance helps as you become motivated by the desire and interest it brings.",
				"added": 1603149506
			}
		],
		"1604477660_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": [
			{
				"comment_id": 22,
				"body": "With all the votes in.. I'd say the overwhelming result is that 'No fucks are given' to your underlying statement",
				"added": 1604965564
			}
		],
		"1604495423_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": [
			{
				"comment_id": 23,
				"body": "Great work, thanks",
				"added": 1604966396
			}
		],
		"1604952415_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 24,
				"body": "Depends on your distro...Personally I would go with one that is open source..gnu pg/ dm-crypt via luks fpr eg... however  I am not aware if they're ported to Win/Mac",
				"added": 1604967409
			},
			{
				"comment_id": 25,
				"body": "> [binary1173](#comment_24_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G): Depends on your distro...Personally I would go with one that is open source..gnu pg/ dm-crypt via luks fpr eg... however  I am not aware if they're ported to Win/Mac\n\nMaybe not what you meant..",
				"added": 1604967483
			}
		],
		"1604988183_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 26,
				"body": "Ubuntu 14.04 was EOL a very long time ago.",
				"added": 1605049343
			},
			{
				"comment_id": 27,
				"body": "Using Docker (or  Dockerfile) is the best forward as you can tailor your requirements to the distro and the unsupported package requirements you need for Zeronet.",
				"added": 1605141323
			}
		],
		"1605635582_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 28,
				"body": "I think the morons at RIAA/MPass forgot about the Wayback machine and various other sources pypi.org to even begin to surpress this...however good to see its been re-instated on github. DMCA can go fuck itself.",
				"added": 1605646742
			}
		],
		"1605962988_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": [
			{
				"comment_id": 29,
				"body": "Duckduckgo has gone the way of Google removing results from searches.. searx for me is the way forward especially when you can host you're own instance. I like lbry as an alternative. Instagram is blocked by pihole, I'd block FB as theres only 1 person who uses it.",
				"added": 1606010032
			},
			{
				"comment_id": 31,
				"body": "In the main if I can't automate social media I really cant be arsed, I give it lip service where needed.",
				"added": 1606078285
			}
		],
		"1605890462_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 30,
				"body": "Someone needs to wipe Schwab  and all these Davos morons off the planet.",
				"added": 1606010891
			}
		],
		"1606080511_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": [
			{
				"comment_id": 32,
				"body": "You sound like some half deranged moron, did your Neo-Socialist Green cult kick you out? Everyone can speak and say what they want here, we police ourselves here for undesirables comparable to the clear net. Unless you've got something  of value to add,  fuck off because you won't be missed.",
				"added": 1606087046
			}
		],
		"1606329226_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 33,
				"body": "If you have issues with systemd I suggest you look at alternatives like Devuan or here  https://en.wikipedia.org/wiki/Category:Linux_distributions_without_systemd \n\nFedora is upstream Alpha Red Hat which relies on the Fedora community for its main source of bug fix/features to feed back into major/minor releases, its not corporate controlled , neither is Arch.\n\nQubes - non-free, x86-only, unstable, unreliable and cumbersome - no its not, for first time users perhaps.\n\nLinux (the kernel) is mostly bac contributors andked by 2 US corpos now (google and redhat) so I'm not sure we can trust it in the long run. systemd is so complex that there may well be a backdoor that is so obscure even opensourceness keeps it hidden from sight.  - Completely wrong with a multitude on maintainers (1501 including Linus toravalds)  and contributors from all over the world (corporate and Community) there is a diverse collection of people and companies https://www.linuxfoundation.org/wp-content/uploads/2020/08/2020_kernel_history_report_082720.pdf  \n\nIt sounds like you don't understand any concept with Linux is (Kernel, gnu utilities and core libraries) Vendors (or anyone for that matter) can take this core building blocks and build their own version/distro which is what is used today under GPL as are most Linux distros if they;re released freely under GPL2/3.\n\n I suggest you stick to Windows, its easier to comprehend.",
				"added": 1606337184
			}
		],
		"1607078514_1EQvG7tmmrK7rvVPaXm9zFeHckdhPEXvWR": [
			{
				"comment_id": 34,
				"body": "Not sure about python forums..I found 'Learn Python the Hardway' by Zed Shaw if you're struggling with certain issues a great baseline in python",
				"added": 1607113853
			}
		],
		"1607222817_14H5KfL4SR2RkpxjdQAvqzKBTaA1q4dKf3": [
			{
				"comment_id": 35,
				"body": "I would cite some sourcies to back up your statement. It will probably make it more beleiveable  for everyone here to make up their minds on this",
				"added": 1607268522
			}
		],
		"1607271673_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": [
			{
				"comment_id": 36,
				"body": "Crypto/Bitcoin is just another asset class and you should diversify your portfolio as you would for any asset class. In the old days it was 60-40 (EQ/bonds) split, however this is no longer true. To most BTC is an alternate to the FIAT (a la no counter party risk)  I deem it high beta gold, so a 5-10% amount of risk is a fair  assumption. \n\nIn short would I invest in one asset class(bitcoin or otherwise), no only a fool would (unless you like high stakes poker and can sleep easy at night)! :D",
				"added": 1607274352
			}
		],
		"1607730992_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 37,
				"body": "I've attempted to follow this for the better part of the year so far  https://www.gwern.net/docs/culture/2010-dobelli.pdf ..not easy...but its enlightening when you start to see the benefits... in essence 'news is bad and brings peoples emotions to a breaking point..do they follow the crowd/herd or think for themselves educating within the bigger picture. Unfortunately all too many are willing to be served up what Big Goverment or Big  Data has served up for them no matter how distateful and outlandish it is, even moreso with the shit show that is C19.",
				"added": 1607818421
			}
		],
		"1607823667_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": [
			{
				"comment_id": 38,
				"body": "The only thing I would add to this is create your `ssh-keygen -t ed25519 or whatever cryptographic standard you use beforehand then `ssh-copy-id user@remote.ip` (and harden off the sshd_config for no passwd and ssh keys only), I also add AllowUsers  user  to lock down access more )so connecting to the instance is somewhat painless and quick.",
				"added": 1607866175
			}
		],
		"1607957446_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G": [
			{
				"comment_id": 39,
				"body": "As far as I am concerned the Chinese population is complicit in turning a blind eye to the scourge of the Communists. I don't believe for a second that a population cannot attempt to overthrow these vile people  en masse/",
				"added": 1607958649
			},
			{
				"comment_id": 40,
				"body": "Its 488Mb,  pulled it down via clear net no problem.",
				"added": 1607959862
			},
			{
				"comment_id": 41,
				"body": "There is a 200Mb limit on zero up, I have gzipped it down to 106Mb",
				"added": 1607961492
			},
			{
				"comment_id": 42,
				"body": "> [sword000000](#comment_50_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie): Send us the Zeronet link if you upload it\n\nOops forgot to add it, here you go http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G/shanghai-ccp-member-ch-en.csv.gz",
				"added": 1607966516
			},
			{
				"comment_id": 43,
				"body": "> [sword000000](#comment_51_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie): File list uploaded to ZeroUp as zip [...]\n\nI'm not sure that makes any difference... other than compression size.",
				"added": 1608035502
			}
		],
		"1608065397_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 44,
				"body": "Gets my vote. Markdown for me becomes muscle memory the moreI have used it (similar to dokuwiki as well) however I think it will benefit  all who have never used it once you can repeatedly create content simply.",
				"added": 1608116964
			}
		],
		"1609275892_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 45,
				"body": "$2000 of worthless fiat...hmmm.... I would be more inclined to buy/sell those wheel barrows when the hyperinflation comes.",
				"added": 1609290383
			},
			{
				"comment_id": 46,
				"body": "> [edgelordofdecent](#comment_745_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): They are going to create a new digital currency so wheelbarrows won't be a profitable business.\n\nthey have more than one use",
				"added": 1609456787
			}
		],
		"1610754180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 47,
				"body": "Theres more than enough content out there lamenting the reasons not to use telegram, \n\nhttps://restoreprivacy.com/secure-encrypted-messaging-apps/telegram/\nhttps://www.vice.com/en/article/jgqqv8/five-reasons-you-should-delete-telegram-from-your-phone\n\npersonally I don't rate it very high..signal I am indifferent about. My own personal choice is https://matrix.org/docs/develop E2E, decentralised, open source, federated, bridges https://matrix.org/docs/projects/bridge/  and if so desired you can host your own iteration this is what people should be using and not group thought because someone things its secure. At the end of the day its down to personal preference.",
				"added": 1610841733
			},
			{
				"comment_id": 48,
				"body": "> [freemankind](#comment_61_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue): https://pidgin.im/installhttps://otr.cypherpunks.cahttps://wiki.bitmessage.org\n\npidgin is purely xmpp based (if you're going to use something like jabber) with otr and bitmessage last version update was 2016, so no on all fronts.",
				"added": 1610847649
			},
			{
				"comment_id": 49,
				"body": "> [freemankind](#comment_70_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue): judas atleast get your facts straight :) [...]\n\nI suggest you check your links that you post Judas  https://wiki.bitmessage.org/",
				"added": 1610919699
			},
			{
				"comment_id": 50,
				"body": "> [freemankind](#comment_71_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue): youre just another troll thats been added to a blacklist\n\nRead my words, something you're unable to comprehend.",
				"added": 1610981105
			},
			{
				"comment_id": 55,
				"body": "> [simonbellamy](#comment_35_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT): Matrix is not decentralized, it is federetad. Your data goes through one and only one server. If it goes down, you're entire system is down. No failover. No backup.-> https://ubinodes.org/portfolio/review-end-to-end-encrypted-chat-server-using-matrix-and-riot/\n\nFreudian slip, however its far more transparent than signal/telegram and I would much prefer to use Matrix over signal/telegram.",
				"added": 1611400029
			},
			{
				"comment_id": 56,
				"body": "> [simonbellamy](#comment_35_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT): Matrix is not decentralized, it is federetad. Your data goes through one and only one server. If it goes down, you're entire system is down. No failover. No backup.-> https://ubinodes.org/portfolio/review-end-to-end-encrypted-chat-server-using-matrix-and-riot/\n\nAny self hosted service would and should be backed up(mine all are, this is no differrent), so the mitigation is dependent on the owner/user and how much effort you want to keep your data/privacy safe.",
				"added": 1611400303
			},
			{
				"comment_id": 57,
				"body": "> [simonbellamy](#comment_39_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT): Yes, but again, you're steering the discussion away from the subject. We're not talking backups here, but decentralization. If their is a single point of failure, then it's not decentralized. Whether the user(s) opt for Matrix (federated) or Signal (US centralized open source) or Telegram (global citizen centralized closed source with multiple servers) is based on the threat model. For Telegram, the biggest threat seems to be state-sponsored criminals (aka governments) so they have servers in many countries, which are as many \"jurisdictions\" in legal terms. For Signal, it seems they still think US is a state of law (it's a criminal state to the highest order), so for them being open source in the US does the trick. Matrix is another culture, a culture of developers, they are good at programming but utopians. [...]\n\nEveryone is entitled to chose what they want in the realms of security/privacy, the discussion is about these two which personally I would not/do not use. For every argument about easy/comfortable end user ease of use offerings the open source point is there to be made. Bottom line if you want to use these go ahead, but with so many better offerings out there, its short sighted to assume these two 'main stream top 10' will mitigate the risk posed just because everyone else is getting on the band wagon because all it does is move the goal posts into another barrel that Govt can attack or surpress.",
				"added": 1611405655
			},
			{
				"comment_id": 58,
				"body": "> [simonbellamy](#comment_40_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT): For one, it's not encrypted by default\n\n> [simonbellamy](#comment_40_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT): . For one, it's not encrypted by default, you have to create an encrypted chat room \n\nIt seems you're behind the curve  https://matrix.org/blog/2020/05/06/cross-signing-and-end-to-end-encryption-by-default-is-here. People here are likely to be tech orientated so your point is moot in regards moving account, with bridging it offers alot more functionality/choice than signal/telegram ever will.",
				"added": 1611488407
			},
			{
				"comment_id": 73,
				"body": "Theres a video from the Hatedone on YT recently about the whole Signal/Mobilecoin debacle, one to avoid for sure. When Musk tells his plebs to 'Use Signal' you know its had its day, even moreso with the mud slinging with the crypto payments integration. Matrix for me.",
				"added": 1621725911
			},
			{
				"comment_id": 74,
				"body": "> [styromaniac](#comment_3098_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Yeah, I'm not liking Elon anymore. He's even calling for a carbon tax.\nHis bitcoin comments got smashed to pieces on twitter, more virtue signalling. I personally think the whole EV/Hydrogen battle will go against him and he will become a niche also ran.",
				"added": 1621761954
			},
			{
				"comment_id": 75,
				"body": "> [croatame](#comment_26_19RaaMJeGXcJzLxeKXWH9pynfjgmm33VZS): Of course he's calling for a carbon tax. He's in the business of making zero emissions facilities and vehicles. A carbon tax will hurt his competitors. Him being in favor of that doesn't surprise me and isn't a concern for me because I expect that from him. But, him stopping the acceptance of bitcoin for Telsa under the idea that it will contribute more people to building server farms and increasing the carbon footprint is flat out wrong and stupid. [...]\n\nIf you look at Tesla last quarterly profits reports.. the vast majority was from the sale of carbon credits... vehicles sales were improved, but paltry in comparison. The rhetoric he spouts hides the flaws in his business model and this from a company that will never pay dividends to shareholders (common stock)   “We have never declared or paid cash dividends on our common stock. We currently do not anticipate paying any cash dividends in the foreseeable future. 27 Feb 2021.\n\nAdd in the 10 yr treasury yield tripling since August and that debt pile becomes very hard indeed to manage and for any growth (highly leveraged companies).",
				"added": 1621803558
			}
		],
		"1610999130_1J46C7eJx1gagCBw898jtb8n3RCWp2EXQ1": [
			{
				"comment_id": 51,
				"body": "Wow you're smart a 302 redirect, did someone help you with that?",
				"added": 1611085968
			},
			{
				"comment_id": 53,
				"body": "> [43r34q53erfaw4e](#comment_1_1J46C7eJx1gagCBw898jtb8n3RCWp2EXQ1): 302 redirect\n\nAs dumb as your name clearly.",
				"added": 1611269819
			}
		],
		"1611173019_1BRGE2hVZLhaE4fH39w4CPdDz4hbBxgE4j": [
			{
				"comment_id": 52,
				"body": "gmail on its own is a risk, why if was possible would you want to send emails from encrypted to clear, in my mind yuo need  to segment mediums you use to communicate other I suggest you hand over all your private/public key pairs! :D",
				"added": 1611178558
			}
		],
		"1611260804_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": [
			{
				"comment_id": 54,
				"body": "> [neuroticfish](#comment_31_1KUV6GoC4BTwnDeWEGbrYbgJ84G6AG3s7N): You should look at Tails.\n\nFor the average user this will be far far out of reach for them. In part for their time and more importantly effort to even get something like this or TAILs setup on a usb drive. Convenience over security will always win when you try and force/coerce people into using this sort of setup.",
				"added": 1611272103
			}
		],
		"1611845039_1MW2ZSiMdJJTdhHUbV3ddi7NMdsiqKghX3": [
			{
				"comment_id": 59,
				"body": "I have no sympathy for anyone using robinhood. It coined as stock trading which it clearly is not. It purely unadulterated speculation, nothing more. If people can't comprehend the risks and what actual investing  is then its time to educate themselves before jumping in like all other the morons.",
				"added": 1611871360
			},
			{
				"comment_id": 60,
				"body": "For all those  plebs that didn't read the T&Cs, section  Section 4 & 5F covers RH I'd say... https://cdn.robinhood.com/assets/robinhood/legal/Robinhood%20Customer%20Agreement%20(June%2022)%20(1).pdf",
				"added": 1611871777
			}
		],
		"1612007867_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 61,
				"body": "Everything we see is a perspective not the truth. Everything we hear is an opinion, not a fact  – Marcus Aurelius",
				"added": 1612035323
			}
		],
		"1612546234_1Phd1v4EgBWqCeAjGD7gtspkpFL8Z6GbkP": [
			{
				"comment_id": 62,
				"body": "I'm halfway through.. ironically just listening to this guy talk(Shiva Ayyadurai) and this happens  https://patch.com/massachusetts/cambridge/twitter-suspends-senate-candidate-shiva-ayyadurais-account",
				"added": 1612564092
			},
			{
				"comment_id": 63,
				"body": "1h37.51s/1h44.01s says it all.. watched in full.",
				"added": 1612569512
			}
		],
		"1613061986_1BudWvimweYZjs7PghDjpd8nbuHH4dR84u": [
			{
				"comment_id": 64,
				"body": "Formatting would help, otherwise  you will get very little response.",
				"added": 1613085863
			}
		],
		"1613425717_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 65,
				"body": "If you're using an RC (release candidate or nightly version minor/major)  then for all or most versions you will may experience some sort of issues be it new or old hardware dependent with newer kernels. Its safe to say that anything deemed stable is less likley to give you any issues. \n\nHowever if you mean stable in the sense of erractic behaviour  I say the only one close to that over the years was Ubuntu wayback when around 12.04. Personally I've used jsut about all of them (or the main ones Centos, Fedora, Mandrake,  suse, opensuse, DSL, Slackware, not Gentoo or Arch BTW)  and all have good and bad points its down to the user experience and sometimes you have to go through them to work out what you like. \n\nPersonally I use Debian derivatives...for user experience Mint is good. I;m not a fan of KDE >3, however mate, gnome an xfce4 are all easy to get to grips if using X.",
				"added": 1613430722
			},
			{
				"comment_id": 66,
				"body": "> [zerosol](#comment_6_1KqRW6E7xaTFMVsErAKaN48V6pq3cq8L3z): Ubuntu lts has always been more stable than any other debian based distro I have tried.  [...]\n\nWhich ones have you tried?",
				"added": 1613593708
			},
			{
				"comment_id": 67,
				"body": "> [styromaniac](#comment_2969_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I'm glad I'm neither on Ubuntu nor regular Linux Mint.\n\nIt was binned back at 12.04for me with all the issues with Unity.. Having drifted into it on one SBC, the upgrade from 16.04 -> 18.04 was truly awful as netplan screwed me over, never again.",
				"added": 1613593833
			},
			{
				"comment_id": 68,
				"body": "> [zerosol](#comment_6_1KqRW6E7xaTFMVsErAKaN48V6pq3cq8L3z): Ubuntu lts has always been more stable than any other debian based distro I have tried.  [...]\n\nThey're Debian derivatives and not based on Ubuntu.",
				"added": 1613679650
			},
			{
				"comment_id": 69,
				"body": "> [astrr232](#comment_28_1ufDwJisEDriKQxYJSz2HuUhgqAG15JyL): For me it's either Fedora or Pop!Os, both really stable compared to anything I used before (Arch-based distros tend to be the most unstable in my experience btw)\n\nI think when the time comes, I will try Pop!OS on  the system76 machines they make, as they look awesome.",
				"added": 1613679691
			}
		],
		"1614539923_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc": [
			{
				"comment_id": 70,
				"body": "I like Brave with their Tor browser component. For the die hards surely theres someone who uses elinks or lynx :D",
				"added": 1614550174
			}
		],
		"1615555101_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 71,
				"body": "Backups?",
				"added": 1615562199
			}
		],
		"1616435266_165aBifCkjbWxo7rEf9ZaiCv39NpinQAtp": [
			{
				"comment_id": 72,
				"body": "Great work , thanks!",
				"added": 1616453046
			}
		],
		"1625602818_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 76,
				"body": "> [styromaniac](#comment_3135_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Fuck off. I provided an F-Droid link.\n\nCompletely owned... quality by the sysop!!",
				"added": 1625691856
			},
			{
				"comment_id": 77,
				"body": "> [styromaniac](#comment_3138_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Wat\n\nGood show!!!",
				"added": 1625770084
			}
		],
		"1634431467_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 78,
				"body": "> [anonymoose](#comment_51_12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq): * * * * * su <replace_with_linux_user> -c \"/home/styromaniac/ZeroNet/data/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/cache/1/Syncronite.sh\"\nThis will only work if you have the required privileges to run as that user which depends on group membership or perms to run that directory/file, in essence its only really going to work as root... If its something specific that you want to run as a user, then its much easier to define it in /etc/sudoers.d/filename and define the  requirements for that one command there...which gives a better degreee of security..  with something like akin to this  https://kifarunix.com/run-only-specific-commands-with-sudo-in-linux/",
				"added": 1634596193
			},
			{
				"comment_id": 79,
				"body": "> [styromaniac@kxoid.bit](#comment_144_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): None of those worked. I'm on Linux Mint 20.2\n\nFor debugging bash scripts.. I tend to run $ bash -x  script/name/here.sh as it will give you a verbose output and you can easily see where its failing or failed and you don't have to decipher some cryptic exit code you encounter.",
				"added": 1634596294
			},
			{
				"comment_id": 80,
				"body": "> [styromaniac@kxoid.bit](#comment_142_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Alright, so for some odd reason, v3_trackers only downloads to the proper directory when I manually run Syncronite.sh, not when Syncronite.sh is run by crontab. Same goes for the cat command.\n\nDoes /bin/cat not have 755 perms? Owned by root. Sounds like the user is in not in /etc/cron.allow (none are by default, you have to add them and restart cron/crond.",
				"added": 1634596482
			}
		]
	},
	"comment_vote": {
		"47_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"60_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"8_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt": 1,
		"544_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"1_138JhGhg571ZWe4pA6JecsiDQmR4QvzGLK": 1,
		"1_14uzskV637ZrWJZeVfRgnvafyMdZebPvJk": 1,
		"118_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": 1,
		"94_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1,
		"7_1NrJoibEdrXzVEwJxwyMtHs79G9G29YmV4": 1,
		"3_1KNLne2PbRUL1WrWuN7u71DgBRhwvK5dxu": 1,
		"3135_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}