{
	"next_post_id": 2,
	"next_comment_id": 5,
	"next_follow_id": 4,
	"avatar": "generate",
	"user_name": "Kildraad",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1,
			"date_added": 1566966564,
			"body": "Hello ZeroMe!"
		}
	],
	"post_like": {
		"1LmygkUjVBWQJPJgHgNuqi9vzx1UBY5huh_1566732334": 1567312586
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "thank you for doing this!\n",
			"post_uri": "1LmygkUjVBWQJPJgHgNuqi9vzx1UBY5huh_1566732334",
			"date_added": 1566966629
		},
		{
			"comment_id": 2,
			"body": "Hey Koschei, Im curious, will you only post photos and make brief summaries on each instance, or is there a series of steps you will lay out specifically in what areas you are targeting during intravaneous use (assuming injections since you mentioned this).\n\nIs there an article on anything specific that you would like for us to give a gander that made you transcend into this direction? The only experience i have in medical knowledge, if any, is just a M.S. in Health care (but for business and admin). So i will not know all the terminology, but i do enjoy reading articles and studies.",
			"post_uri": "1LmygkUjVBWQJPJgHgNuqi9vzx1UBY5huh_1567156749",
			"date_added": 1567312777
		},
		{
			"comment_id": 3,
			"body": "just checking in and thanks for the insight bearded!",
			"post_uri": "1LmygkUjVBWQJPJgHgNuqi9vzx1UBY5huh_1567156749",
			"date_added": 1569903737
		},
		{
			"comment_id": 4,
			"body": "@Koschei: Kosc' can you explain why you chose a strong strain of FLU of the RMS bacteria and what you did to 'modify' it? I would hate for you to be feeling seriously ill from doing this but if there are pictures that show your stages of this modified version which you injected yourself with, that would give us a sense of where you are at currently. Please let us know mate. \n\nIn the event that this actually becomes a joke, let us know as well. no hard feelings, it just helps us identify where else to find more information regarding your initial bait to begin with. \n\nI already know China has been working with alot of 'unethical' forms of human science with modification to see if they can encourage super gene society to make theirs more promising than others. The fault in this will lie in whether or not a modified gene from birth will be more susceptible to current human viruses and bacteria. ",
			"post_uri": "1LmygkUjVBWQJPJgHgNuqi9vzx1UBY5huh_1567156749",
			"date_added": 1571624527
		}
	],
	"follow": [
		{
			"follow_id": 3,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1LmygkUjVBWQJPJgHgNuqi9vzx1UBY5huh",
			"user_name": "Koschei",
			"date_added": 1575774087
		}
	]
}