{
	"posts": [
		{
			"id": "2c367033-d1cb-4f90-9d70-2be312542d9d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "8e6a113e-c7a1-4911-9a8f-60cb8412519b",
			"body": ">>8e6a113e-c7a1-4911-9a8f-60cb8412519b\nAs any true polack will tell you this is a board of peace.\nMSM calls things like zeronet the darkweb or any number of similar scary sounding names, but in fact this is the visible tip of the iceberg, this is still a public forum, hence why you are here, why I am here.\nThe true organized threats against existing power structures start out in the real world, away from all surveillance. And should communication over internet become a necessity it would most certainly be done via private encrypted communication, not in the open on a board known to be frequented by individuals with radical beliefs and therefore likely monitored internationally by multiple governments.",
			"time": 1565375359773,
			"files": "[]"
		},
		{
			"id": "ebf5a6ff-9b2f-42ef-a8bb-3245442fb8e5",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "504b65b8-ea6a-4fb9-83a7-7f8ff7ad6a36",
			"body": ">>52fa3bbf-1515-46c1-ab77-8e0230b4a7b5\nI sure as hell won't be modifying my body with anything made by silicon valley kikes.\nAnd technology by itself is neutral. You could destroy everything on this planet that is worth living for or you could be mindful of nature and add technology as a symbiotic not destructive component.",
			"time": 1565691307550,
			"files": "[]"
		},
		{
			"id": "783fdefe-3c6c-45f1-8b70-c0c9667997fc",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "915d3c51-c702-435f-9473-28b7e8d6ab8f",
			"body": "Anyone with an IQ over 5 would figure out that it's not very lethal. Unless the fuel somehow incorporates white phosphorus, that might work.",
			"time": 1565988446674,
			"files": "[]"
		},
		{
			"id": "72e4e3a5-a3d0-4f46-b317-47c1b0bfbdf7",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "915d3c51-c702-435f-9473-28b7e8d6ab8f",
			"body": ">>0d0f8d70-fe5c-439f-91dc-eac708d4a75b\nNapalm then, well that's certainly a lot more effective than a bit of burnt hair and clothing.",
			"time": 1566164815159,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}