{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Me cago en la estupidez de la gente: programas de 'talentos'",
			"body": "Lo siento, pero necesitaba escribirlo... ¿como es que en el puto 2018 todavía haya gente que no vea que los engañan como quieren con la puñetera televisión?\n\nQue te manipulen con el tema de la manada todavía tiene un pase - si vives en el mundo del yupi - pero lo de los programas de talentos me parece aberrante. Pero como santos cojones puede haber gente que se crea de verdad que los niños de la voz kids cantan así a pelo, sin autotune y mierdas varias, en un programa que no es en directo sino que es grabado y cortado antes de ser emitido!\n\n\"Y tu quien eres?\", \"Eeeeeeeeh, me llamo Mario, tengo 11 años y un día mi abuela me ha oído cantarle a mi perrito Lucky que quería mucho pero un día murió atropellado por un hombre blanco heterosexual\" (aquí ya empieza a llorar, y los demás con caras de corderitos), \"muy bien, calmate y a ver que sabes hacer Mario\", \"**Pavarotti is back**\". Es que no se cortan ni lo más mínimo, lo mismo da si rapean, cantan una jota o es un coro, todo liso como la seda.\n\nLo peor de todo es que cuando se lo dices a los que lo están viendo te contestan en plan de \"pero si no ves que están ahí cantando?\", como si tu fueras el raro por pensar que te están engañando en tu puta cara con un programa grabado y da igual que les digas que el programa es grabado, que les intentan engañar haciendo como que es una gala noctura cuando lo mismo el programa lo grabaron un mes antes a las cuatro de la tarde, lo ven y por lo tanto es lo que hay.\n\nLo siento, pero tenía que desahogarme un poco.",
			"added": 1526332093
		}
	],
	"topic_vote": {
		"1_17JkZDD6K36ZYQVT1uy2D1VN39HpJyYa34": 1,
		"7_17S5FgSs8aAVn11ZtHGpiskwmGbH4oRgJ5": 1,
		"1_1Ja3ocDF3abwsEKdxvMxsWwUU1aV7iSPYb": 1,
		"2_17Yr1nddo5LnE9vxbqAgJ6mK8kEBJZZbNz": 1,
		"2_1Ja3ocDF3abwsEKdxvMxsWwUU1aV7iSPYb": 1,
		"1_1PrGqYS76NH78qs54gS2c4ddjpk5VRK2bA": 1,
		"1_1YqDKgbqnmK69y67tYpqBfnMvtrGFFLJH": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1_18neEHgfy4dyCSY4tJzUi3AwjHds4U6bw9": [
			{
				"comment_id": 1,
				"body": "Putos koreanos",
				"added": 1525700048
			}
		],
		"1_1Q2MDUJ54Qon73LRsrTovcweNsnRhpBcb8": [
			{
				"comment_id": 2,
				"body": "No pertenezco a ninguno de los foros, pero parece ser que habrá que usar ZeroNet a partir de ahora para poder debatir.",
				"added": 1525700805
			}
		],
		"1_17JkZDD6K36ZYQVT1uy2D1VN39HpJyYa34": [
			{
				"comment_id": 3,
				"body": "que cochina!",
				"added": 1525703464
			}
		],
		"2_17Yr1nddo5LnE9vxbqAgJ6mK8kEBJZZbNz": [
			{
				"comment_id": 4,
				"body": "http://latribunadecartagena.com/pag/contacto/ que alguien con experiencia le explica a estos como subirlo de manera anónima",
				"added": 1525729720
			}
		],
		"1_1Ja3ocDF3abwsEKdxvMxsWwUU1aV7iSPYb": [
			{
				"comment_id": 5,
				"body": "Parece un puto campo de minas. Tengo mucho que aprender de vosotros",
				"added": 1525731613
			},
			{
				"comment_id": 7,
				"body": "Tiene que ser poco a poco o borran todo de un plumazo... mamones",
				"added": 1525799346
			}
		],
		"1_1YqDKgbqnmK69y67tYpqBfnMvtrGFFLJH": [
			{
				"comment_id": 6,
				"body": "Por lo que puedo entender, guardamos mayormente texto. Deduzco que habrá algún tipo de 'servidor anexo' que mantiene una copia de seguridad de todo y la distribuye en caso de que no hayan seeds abiertos cuando alguien se conecta.",
				"added": 1525798360
			}
		],
		"3_1Jw2LsFMZ2tTJWc3ecjrHGdXpMscmxM1MP": [
			{
				"comment_id": 8,
				"body": "Que la chupen los foros con moderación",
				"added": 1525799511
			}
		],
		"3_13esZg8pXRhUWy9TdPz93TKVf7U2U36em3": [
			{
				"comment_id": 9,
				"body": "El pepe sentanto cátedra de como mangar a manos llenas.",
				"added": 1525799945
			}
		],
		"4_1Jw2LsFMZ2tTJWc3ecjrHGdXpMscmxM1MP": [
			{
				"comment_id": 10,
				"body": "En teoría con el modo tor siempre activado debería ser suficiente no? A mi es que con navegador Tor no me va, ni siguiendo el tuto :/",
				"added": 1525800066
			},
			{
				"comment_id": 13,
				"body": "> [ciudadanozero](#comment_13_1Jw2LsFMZ2tTJWc3ecjrHGdXpMscmxM1MP): yo lo del modo tor solo no me fio ni de coña, pasale esto a tu navegadorpara sabe si es seguro Panopticlick se llama, enlace de la clearnet: https://panopticlick.eff.org/\n\nMuchas gracias! No conocía la herramienta. La diferencia creo que es básicamente usar NoScript para que no te puedan trackear con Javascript, pero el mero hecho de usar un navegador secundario para mantener el anómimato no es tan mala idea. Gracias1",
				"added": 1525907081
			},
			{
				"comment_id": 14,
				"body": "> [ciudadanozero](#comment_17_1Jw2LsFMZ2tTJWc3ecjrHGdXpMscmxM1MP): ami tb me va muy rapido  aqui en zeronet y en onion mas lento, he hecho pruebas de ip y seguridad del navegador TOR configurado al maximo de seguridad y todo correcto.\n\nCreo que es mucho más rápido porque descargas las páginas que visitas desde el momento que arrancas ZeroNet. De hcho, las puedes visitar desconectado una vez bajadas.",
				"added": 1525907131
			}
		],
		"2_17mdQ1RaLCu1m2gqf4wosf15VWgccxuoUk": [
			{
				"comment_id": 11,
				"body": "Es decir, que se el estado se está denunciando a sí mismo...",
				"added": 1525800423
			}
		],
		"1_1DiV63jkL4C9uqTAJ7kfuk465ifcrvBbeR": [
			{
				"comment_id": 12,
				"body": "Tor y suerte",
				"added": 1525800572
			}
		],
		"1_1H7QuXaGs9Qg4HQX99wJUU3Dh2sV2fk9Sr": [
			{
				"comment_id": 15,
				"body": "ZeroPole",
				"added": 1525909131
			}
		],
		"2_1JWNCmquAPBEirtg5X5Nq61541iNDjTdqE": [
			{
				"comment_id": 16,
				"body": "Tengo un montón de curro, pero intentaré echarle un ojo estos días  a ver. Supongo que básicamente esto es una modificación de ZeroBoard no?",
				"added": 1526087003
			},
			{
				"comment_id": 19,
				"body": "> [arbol](#comment_33_18neEHgfy4dyCSY4tJzUi3AwjHds4U6bw9): Es un clon de ZeroTalk, ZeroBoard es un chat\n\nSigo mirando, mucho curro. Se que suena raro pero alguien podría sacar un pantallazo del \"formato de forocoches\". No tengo cuenta ahí",
				"added": 1526332846
			}
		],
		"2_1H7QuXaGs9Qg4HQX99wJUU3Dh2sV2fk9Sr": [
			{
				"comment_id": 17,
				"body": "Cualquier foro hosted es susceptible de ser investigado, espiado y sus usuarios perseguidos. Esto está mucho mejor y siempre que la gente no se ponga con cosas de enfermos (niñas de 5 años y cosas así), nadie se molestará lo más mínimo en invertir millones de euro en investigación y coordinación internacional para chapar un foro.",
				"added": 1526332378
			}
		],
		"2_13VaS2XUc4paeNGrGQcjFuq6oaHMTnjT79": [
			{
				"comment_id": 18,
				"body": "> [parcival](#comment_1_1JG2FcA1tBT5NU6hMj4rp5QUBCs699MQFc): Yo a esto lo que le veo es que tiene un interfaz bastante malo. Por otra parte, no todo el mundo es capaz de instalarlo correctamente (Tor+ZeroNet+TowBrowser). Lo ideal sería tener esto mismo, que tecnológicamente está muy bien, con la interfaz de FC y la sencillez de instalación necesaria para que se masifique.Nosotros lo sabemos bien: el valor de FC está en nosotros, sus usuarios, así que otro foro sólo es posible si una mayoría de usuario de mueve al nuevo foro, sino será un foro más de tanto que hay en inet.\n\nCreo que a la mayoría le sobra con ZeroNet y Tor.",
				"added": 1526332669
			}
		]
	},
	"comment_vote": {
		"8_1BxoC1C7mdBnZgCRtshd7pxQDfiJysFLBC": 1,
		"12_18neEHgfy4dyCSY4tJzUi3AwjHds4U6bw9": 1,
		"1_12jQAtBverLUwHEXJsBxo9KfWyeFSHTacq": 1,
		"1_1B38i8RaJv3hyt35A4qbyZGnTquKPCEJkL": 1,
		"15_1GqCXXyUYQrKJF1zrtGH4yxapQUQAGWVLd": 1,
		"14_1KKSpUM5yc3BML9psRK2fML6mJ2mKnRD2y": 1,
		"1_1JG2FcA1tBT5NU6hMj4rp5QUBCs699MQFc": 1
	}
}