{
	"next_comment_id": 14,
	"user_name": "If0",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "Идеальнейший текст для \"поиска явного и скрытого смысла, которого в нем нет\".",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1560544530",
			"date_added": 1560603861
		},
		{
			"comment_id": 2,
			"body": "Замечательно! Мне понравился перевод, выполненной в такой манере, близко к оригинальному тексту с минимальной русской литературной адаптацией, которая бы легко убила авторский слог. Хотя, читателей, совершенно не занакомых с японским, может малость напрячь некоторая непривычность. После прочтения перевода возникло желание осилить оригинал.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1561493896",
			"date_added": 1561575091
		},
		{
			"comment_id": 3,
			"body": "Читается трудно, понимается еще трудней :-)",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1562441743",
			"date_added": 1562531606
		},
		{
			"comment_id": 4,
			"body": "@caryoscelus: \n>пишу \"как пишется\", во многом для себя, отчасти для своих клонов, и лишь заодно для всех остальных ^_^\n\nСчастливый человек, испытавший погружение в свободное творчество, вырвавшийся из ограничений стереотипов и сковывающих каждое движение мысли пут чужого мнения. Именно этим свободное - самовыражающее творчество отличается от предсказуемо-подстраемого под некие среднестатистические ожидания безликой толпы в надежде снискать ее признание.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1562441743",
			"date_added": 1562538706
		},
		{
			"comment_id": 5,
			"body": ">куда он идёт\n\nОн уже прибыл в место назначения :-(",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1564092208",
			"date_added": 1564164883
		},
		{
			"comment_id": 6,
			"body": ">Реакция российских властей в связи с выборами в МГД может показаться гипертрофированной\n\nЧто свидетельсвует о неких процессах, набирающих силу в обществе, которые представляют реальную угрозу для действующей власти.\n\n>Хотя безусловно и версия о \"давайте запугаем всех\" тоже имеет место\n\nЗапугивание только усиливает ненависть ко власти, убивая последние остатки ее авторитета.\n\n     Вселенский опыт говорит,\n     что погибают царства\n     не оттого, что тяжек быт\n     или страшны мытарства.\n     А погибают оттого\n     (и тем больней, чем дольше),\n     что люди царства своего\n     не уважают больше. ",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1564238801",
			"date_added": 1564253492
		},
		{
			"comment_id": 7,
			"body": "@caryoscelus:\n>Есть опасения, что в конце концов будет два полюса, а это вряд ли кончится хорошо для участников\n\nВ России традиционно ничто ничем хорошим не заканчивается. В начале нулевых была возможность, что-то изменить, но \"развитие\" пошло по традиционному пути. Тяжелое совковое наследие, сдвинувшее мозги не одному поколению, не позволило вылезти из ямы, а наоборот сподвгло ее копать еще глубже. ",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1564238801",
			"date_added": 1564325992
		},
		{
			"comment_id": 8,
			"body": ">бравирующих совковым детством\n\nБлиже к старости начинает казаться, что трава во времена молодости была куда зеленее, что вовсю используется пропагандой для мифологизиции того времени в своих целях, порождая моду на совок. К тому же большинство людей лучше помнят (предпочитают помнить) хорошее, оставившее яркое впечатление, и быстрее забывают все плохое.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1564279393",
			"date_added": 1564328103
		},
		{
			"comment_id": 9,
			"body": "@caryoscelus:\n>а потом оказывается (внезапно) что жизнь в определённый период не сделала его специалистом по нему\n\nМожет быть такой человек просто не застал в разумном возрасте советский период, что бы \"стать специалистом\", а \"мнение иметь\" хочет? Возраст людей \"имеющих свое мнение\" о советском переиоде на данный момент, должн быть как минииум за 50, а то и более. А в таком возрасте ставшие столь далекими \"воспоминания\" уже начинают терять точность и приобратают оттенок субъективности.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1564279393",
			"date_added": 1564405449
		},
		{
			"comment_id": 10,
			"body": "@caryoscelus:\n>мнение можно высказывать спокойно, а можно с самодовольным видом как истину последней инстанции\n\nЗависит от скромности и здравомыслия человека. Иные считают свое мнение авторитетным в любом вопросе, причем, сами искренне в это верят :-)",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1564279393",
			"date_added": 1564407015
		},
		{
			"comment_id": 11,
			"body": "Может быть они просто со временем утратили последние остатки иллюзий по поводу \"ватной породы избирателей\"?",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1567636926",
			"date_added": 1567703522
		},
		{
			"comment_id": 12,
			"body": "@caryoscelus: Хоть что-то надо делать, а если делать, то лучшим способом будет выбрать некий критерий оптимизации с точки зрения своих возможностей. С одной стороны - с шулером бесполезно вести честную игру, с другой - в случае отказа играть по навязанным правилам, проигрыш будет куда больше, чем возможный ущерб от потери репутации.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1567636926",
			"date_added": 1567723422
		},
		{
			"comment_id": 13,
			"body": "    1129:  mov    DWORD PTR [rbp-0x4],0x0 ; i = 0\n    1130:  add    DWORD PTR [rbp-0x4],0x1 ; i = i + 1\n    1134:  cmp    DWORD PTR [rbp-0x4],0x0 ; set ZF = 0 if i != 0\n    1138:  jne    1130 <main+0xb> ; jump 1130 if ZF == 0\n\nUndefined behavior after i == INT_MAX ",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1571697361",
			"date_added": 1571866112
		}
	]
}