{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 15,
	"comment": {
		"1588519592_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 1,
				"body": "> [arione](#comment_1_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY): COVID-19 is a hoax. The tests are not testing for covid-19. Get it through your head. The designer of the test stated that it is not testing for covid-19 therefore all this shit is low IQ waste of time.\n\nYou're either trolling or you need serious help.",
				"added": 1588761856
			},
			{
				"comment_id": 2,
				"body": "> [arione](#comment_9_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY):\n\n> Absolutely everything relies on the fact that people assume COVID-19 tests are testing for covid.\n\nWhat exact kind of test are you talking about?\n\n> How come covid solved all those other health issues because people don't die from other diseases like cancer, hiv, heart attacks?  [...]\n\nYou need to distinguish between excess mortality and case mortality.\n\n> Why 80's computer geek Bill Gates now owns patent now for a virus and why he has so much in WHO, a man with no medical education who wants to make billions on vaccinating the world?\n\nPatent for a virus? You got that wrong. There are patents for vaccines. That happen because a) people in pharma want to make money by preventing others to produce a vaccine and b) organizations patenting vaccines to ensure broad availability so no one else can patent it out of monetary interests.\n\n> Why the very creator of the COVID-19 test said himself that his test cannot be used for covid-19?\n\nAgain, which test and which creator? There are multiple tests in use.",
				"added": 1588762464
			},
			{
				"comment_id": 4,
				"body": "> [xenovich](#comment_24_1C16NYLAnRJ2yppe3aYWT8K2D5sZB4A2u2): @nesselon He is right in that there is no considerable increase in deaths, governments and media terrorized populations.\n\nI disagree.\n\n> Where are the death tolls? Where are the overcrowded hospitals?  [...]\n\nWTF? Have you missed that there have been really catastrophic situations in some places which have had substantial local infection clusters? What do you think happened, e.g.,  in northern Italy? We are pretty lucky most places shut down quick enough instead of letting that thing run through large percentages of the world population with no foot on the brakes. A full outbreak would surely also fuck up much better health care systems than the Italian one.\n\n> I usually find those kind of semantic games mere mental trickery. Are people dying from covid-19 and in what numbers?\n\nThat is really not a mental trickery, it's just the difference in which how deaths are counted. Excess mortality is always a lot higher. I think what you're asking for is how high the case fatality is. Sure, there are different estimations about that number out there, but it's all somewhere between 0.5% and 3.5%. It's not insanely high as with, e.g. ebola, but it is ugly enough.\nHowever, the main problem with covid-19 currently is that a considerable part of infected people have to receive treatment (a little less than 15-20% of all cases). If they can't get reasonable (non-invasive) treatment, their state worsens and they finally need intensive care. But 4-5% of infected people need intensive care anyway, and this is the part where the health care system can get fucked, because all the other health problems that are usually around, some of which you have already mentioned, have not disappeared. They still have to be dealt with as well, and all hospitals that I know are not exactly optimized to have a high amount of ICUs + workers to handle them idling around.\n\n> A patent on a vaccine is much different from a patent on a virus? Is it?\n\nYes it is in general. So now I looked into this specific one. If you're talking about the US patent no. 10130701 then you can look into it and find that it indeed contains the DNA of a coronavirus aimed to produce a vaccine. Unfortunately, this is a different type of coronavirus than the one we are having issues with at the moment. The currently threatening coronavirus was also sequenced and published quite early by different institutes. Long story short: different virus. The one specified in the patent I looked into won't help much in our situation as far as a vaccine is concerned.\n\n> Has the covid-19 virus been extracted and analyzed?\n\nYes of course, actually by many different research groups by now. Also it is going to be sequenced again and again to find mutations and trace the links between infections. This is how you can tell how it was imported into a country.\n\nAs for your other post:\n> This reads like a predictive script for what we’re now seeing with coronavirus, as governments around the world scramble to “manage” this deadly outbreak with martial law, vaccine fast-tracking, quarantines and plenty of fear-mongering.\n\nWell, we expected a pandemic virus to hit the world long ago. Most people thought it would be an influenza one though.\nSure there is a script, a plan, or a procedure that most governments and plenty organizations drafted in order to survive such a scenario. You blame them for that?\n\n> “If we do a really great job on vaccines, health care, reproductive health services, we could lower [the global population] by perhaps about 10 to 15 percent,” Gates is infamously quoted as saying about the true intent of his “humanitarian” efforts.\n\nAnd right he is: If you're able to provide all that, you can prevent many children from dying.\nTherefore, putting it very bluntly, less children have to be produced.",
				"added": 1588777074
			}
		],
		"1588757239_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": [
			{
				"comment_id": 3,
				"body": "Man you need to either check your medication or rethink/readjust your substance abuse.",
				"added": 1588762670
			},
			{
				"comment_id": 5,
				"body": "Don't get me wrong, I'm all for fighting for individual rights and freedom. We sure do need separation of powers and we do need checks and balances, and it is very clear we need it more than ever. But these days, I'm really having a hard time understanding people that just grab a bunch of mixed-up different conspiracy theories and go all-in revolution. Calm down people. If necessary, take your meds.",
				"added": 1588777621
			},
			{
				"comment_id": 6,
				"body": "> [edgelordofdecent](#comment_516_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): You're an idiot. Just believe everything the Mainstream Media tells you.\n\nIdiot, hm?\nIs your life so boring that you prefer to believe some random wild shit someone tells you on youtube?\nBeing critical is important, mainstream media or random source. But I don't need some wild ass conspiracy theory to feel alive.\n\nPS: please don't drink/inject disinfectant ;)",
				"added": 1588786476
			}
		],
		"1588796526_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 7,
				"body": "intravenous vitamin C against coronavirus and cancer?? are you fucking kidding me?",
				"added": 1588797121
			},
			{
				"comment_id": 8,
				"body": "> [mg0](#comment_299_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): What's so wrong about it?\n\nThe fact that there is no significant evidence that this actually helps:\nhttps://onlinelibrary.wiley.com/doi/abs/10.1002/jpen.1471\nhttps://www.ncbi.nlm.nih.gov/pubmed/31035414?dopt=Abstract\nhttps://theoncologist.onlinelibrary.wiley.com/doi/full/10.1634/theoncologist.2014-0381\n\nIt probably doesn't harm much as well, any surplus will just be excreted by the body (except in some cases, such as G6PDD deficiency, which will get you issues).\n\nMaybe I'm just a bit sensitive because I knew someone who died with cancer after refusing all conventional methods (whereas the doctors said she has good chances of recovery after surgery) and trying several alternative therapies just because people could sell it to her better.\n\nI'm not a fan of how the pharma industry works but I believe in science and the scientific method.\nAnd to indicate, as OP did, that large numbers of patients could get cured from cancer with this method ... is imho just wrong as there is just not enough evidence to back that bold claim up.\nBut people that actually need treatment might read such a thing and take the wrong route.",
				"added": 1588799842
			},
			{
				"comment_id": 9,
				"body": "> [mg0](#comment_300_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): \n\n> hmm, so the issue is with lack of scientific evidence on Vitamin C positive effects against cancer.\n\nYeah, that's the one that catched my eye in this thread.\n\n> I think I've read of a case where someone got fully cured of cancer using an antiparasitic prescribed mainly for animals (although it's tolerable for humans), and there have been some other reads that say some really bad and wicked things of authority agencies and agents blocking the way medical practitioners, keeping them from saving many lives (a case about ebola in Sierra Leone comes to mind) so I have fuel for my conspiracy-paranoid self.\n\nSure, some things might work in some settings and maybe not in other settings. That's not enough for broad appliance. However, it is empirical data. Which is important and valuable!\n\n> I don't get why mindful people of the clinical sciences, with or without the backing of prestigious scientific societies, can't conduct experiments or trials about different ways to treat diseases?\n\nOf course, experimental studies are important and they are needed. But they are really difficult to perform in a scientifically useful way. Let me just outline this a bit: Everyone can do \"some kind of study\" and show exactly the impact he/she was looking for. And hell yeah, pharma companies buy a lot of exactly such biased studies. And de-publishing a once shown effect is very tedious too, even if no one can really reproduce the effect in a re-staged experiment. In the end, you have to rely on the peer-review system. But in that system you succeed by publishing articles that show something new, not so much by debunking stuff. That's why this system has trained itself to inspect and accept new results very carefully. So that's one thing: Controlled experiments are a pain in the ass to design, conduct, evaluate, review, and even to reproduce. Plus, trying new or not yet approved medication on humans is something that is even worse than other experimental studies. Usually you go with animal testing first (and before even that there are a bunch of other requirements; mouse/pig/monkey must not be involved imprudently), because clearly you don't want to damage anyone more than necessary. Next issue: participant selection with humans is usually hard enough, you always need a control group, watch your distribution over gender/age/... But worse: subjects who participated in one study, also cannot participate in another. Because that might lead to additional threats to validity. So in the case of very urgent matters where you want to have clean studies in very short time, such as with our covid-19 situation, you basically want to pre-select promising approaches/drugs before you invite participants. And then it's peer-review time again.\n\nBtw: I fully agree when you say that big pharma isn't playing fair. It's a fucking industry and I despise their methods, and unfortunately we just have to deal with them as with any other big industry. That sucks, no question, and there is a lot of things going on there that should be dealt with in courts.\nBut I'm not an industry person, I'm a scientist.\nAnd my point was about what is actually the best for the sick/infected people, and to establish that you need data and evidence, not paranoia and conspiracy theories ;)\n\nPS: also, having already met two of the \"gates-is-the-devil\" and \"new-world-order\" kind of people here in two other threads during my first active day here (hello zeronet btw!), I might be a little quick on the trigger, please forgive me! Probably I was just a bit unlucky with my first forum samples, but I was really starting to assume that everyone is a nutjob here. Hopefully just a bad assumption due to bad data / too small sample size. Classical one in terms of empirical studies :-D\n\nPPS: of course I always knew Gates is the devil, that's why I am using gnu/linux and bsd since 1999 ;) But seriously, that conspiracy stuff people are feeding themselves from random youtube channels, facebook, twitter, and worse is just really frightening. We really need to push a lot more effort on education, especially regarding media competence, i.e., the skill to classify, assess, and evaluate pieces of information in various sources, mainstream or not.",
				"added": 1588807585
			},
			{
				"comment_id": 10,
				"body": "> [mg0](#comment_301_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): \n> my main drive is more like trying to get as much input from whatever so I can feed my inner classifier algorithm better (over time, you start to see flaws in everything that has them).\n\nThat really sounds like training/improving media competence, so I like that a lot! We should have classes for that!\n\n> Welcome to zeronet, by the way. If you have scientific papers you'd like others to have/read, feel free to do so. :)\n\nThanks! Sure, I'll happily share everything I have access to whenever it fits the context or someone has specific inquiries!",
				"added": 1588812545
			},
			{
				"comment_id": 11,
				"body": "> [werevolt](#comment_1_19ZUAyEjVPBC7EDfQoBfaugohL6HzE1qWt):\n> [...]\n\nIf I understood that correctly, you reject (among others) education, science, and rationality.\nIt sounds like you feel powerless and left behind because maybe a lack of education and you see no way to compete anymore?\nWish everything was simple and easy again like it was when people were still living in caves? Because then everyone has equal chances and you finally get a chance of making a difference? Sorry, you were born about a few thousand years too late for that. But that's not a bad thing at all. I can understand that you feel angry, but the issue is not our culture with all its education, science, doctors, whatnot. The issue is in your mind and that can actually be fixed. While you cannot change our culture, you can change your life.\n\n> Western culture has been infested with crap and it needs cleansing, a reset!\n\nNo.",
				"added": 1588849153
			},
			{
				"comment_id": 12,
				"body": "> [werevolt](#comment_2_19ZUAyEjVPBC7EDfQoBfaugohL6HzE1qWt): Let me guess. Not breastfed. Go figure.\n\nHell of an argument. Also, you guessed wrong.",
				"added": 1588861234
			},
			{
				"comment_id": 13,
				"body": "> [adrenochrome](#comment_3_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T): read the studies! there are dozens published about how intravenous vitamin C is causing cell death to cancer cells\n\nAnd even more studies that fail to reproduce such an effect,\nwhich is why I cited a metastudy that tries to show a more complete picture.",
				"added": 1588862064
			}
		],
		"1589201882_17v2UBGNSMncMni3XDXFAJa8HtwGuEdQyB": [
			{
				"comment_id": 14,
				"body": "No offense but if you don't know where to find what you're looking for and are short on time, this operation is probably a really bad idea that might backfire very fast. I suggest you contact a lawyer and press charges against the executive.\n\nUsually there's a smarter route than the one you proposed so far.",
				"added": 1589219335
			}
		]
	},
	"comment_vote": {
		"148_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12": 1,
		"5_16FFktck2XiA33aQcarrqPA8XzK3coaUBD": 1
	}
}