{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1585388893_149RCNaRcGLevbZcMLdhsixwQarCZga6WT": [
			{
				"comment_id": 1,
				"body": "Революция это не русский путь к свободе, это дорога в рабство сионистов. На Украине уже доскакались.",
				"added": 1590596394
			},
			{
				"comment_id": 2,
				"body": "Хохлы пидоры!",
				"added": 1590705516
			},
			{
				"comment_id": 4,
				"body": "> [cra](#comment_105_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): Вы так любую тему будете превращать в срач без аргументов?Сколько знаю лично украинцев - все нормальные чуваки.Это просто jk7 с обострениями - у него любая критика Украины вызывает взрыв негативных эмоций. Ведь про Украину можно либо хорошо, либо ничего. Но это же не значит, что все украинцы такие же как jk7.Не уподобляйтесь ему и не обращайте внимания. С такими людьми невозможно вести конструктивный диалог.\n\nЯ просто связь проверял. Тоже знаю много хороших Хохлов, даже очень хороших. Больше не буду",
				"added": 1590941047
			},
			{
				"comment_id": 5,
				"body": "> [fireinside](#comment_1_1K6GgFxLQ5n1U2oAsrkVoGqmr2K8C2egJ4): Москвичи, если тут есть те, кто считает себя свободным человеком, а не рабом!С 1 июня нас хотят окончательно превратить в скот ! В массу БЕЗЛИКИХ рабов ! Заставляя абсолютно всех носить маски, они проводят над нами эксперимент , над нашей психикой, подсознательно закрывая рты людям, показывая кто здесь кто.Я не терпила, не раб и не марионетка!Если вы не БЕЗЛИКИЕ массы, а личности, которые готовы жить свободными людьми, а не существовать рабами, то нам пора объединиться и действовать РАДИКАЛЬНО ! Я имею ввимду прямое столкновение с полицией, росгвардией и прочими псами режима !Выходите на улицу без масок. Возьмите с собой бандану - такую в каких грабили банки на Диком Западе, так как лицо скрыть будет полезно только в случае радикальных действий вами, но открыто ходите, чтобы показывать окружающим, что вы не БЕЗЛИКИЙ !Я не мастер писать подобные тексты, но я прекрасно понимаю, к чему всё бездействие народа может привести! ВРЕМЯ ДЕЙСТВОВАТЬ!\n\nТвои предложения не осуществимы, с таким успехом можно сразу на захват мирового господства претендовать. Холодильники отключить только и жрать перестать.",
				"added": 1590941362
			},
			{
				"comment_id": 6,
				"body": "> [cra](#comment_125_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): Бабуля чрезмерно ответственно подошла к приказу властей носить маски:https://www.youtube.com/watch?v=G5Wz_Cb8RzA\n\nВообще людей довели реально, без всякого основания, это было в Октябре  19г и мы сейчас так живем. https://www.youtube.com/watch?v=Z8nGo4Bkvr8",
				"added": 1590941962
			}
		],
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 3,
				"body": "Всем Привет",
				"added": 1590705972
			}
		],
		"1584552124_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 7,
				"body": "Остров Святой Елены.",
				"added": 1591373916
			}
		],
		"1590428068_1DF9SmXMYDMz7UGB6pxNXMbq9UgxwJEZie": [
			{
				"comment_id": 8,
				"body": "А если нас реально хотят всех грохнуть?",
				"added": 1591374274
			}
		]
	},
	"comment_vote": {
		"125_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": 1
	}
}