{
	"next_topic_id": 12,
	"topic": [
		{
			"topic_id": 1622616962,
			"title": "Why do you think I hate hipsters?",
			"body": "Maybe because I associate them as those responsible for the election of obama? Maybe because I know they hate me, because they see me as a deplorable? Maybe because they are too stupid, arrogant and insolent to accept that attrazine is really nefarious for batrachians? Maybe because they are the fuckers who with jack dorsey love to censors others, maybe because they are brain injured dumb fucks with whom no discussion is ever possible, as they know better. \n\nanyway, I found a good trick against hate... think about meat :) it works !\n\nedit: \n- they hate the 2ndA.\n- they know it, they read it in the new york times, or saw on it on cnn (or late night \"comic\" shows).\n- and they love the huffington post \n- and reddit is their information source (censored shit)",
			"added": 1622616961
		},
		{
			"topic_id": 1622618793,
			"title": "Distinction to be made between regime change specialists and sometimes the sec teams with them...",
			"body": "as much as I believe that regime change specialists, like \"danny\" have to be send back in vegetable state (be it from mercury/aluminium injection, emf or electroshock), I would encourage not to do that to sec team members. They, they have to be treated as soldiers, aka shot, pow, or send back but in one piece.\n\nbut the \"hipster\" crowd of the regime change ops, they are waste just living corpses.\n\nI think it's fair...\n\nI know some fear more the sec teams of regime change operations, I understand that it's where the rubber hits the road... but they are soldiers, fundamentally, they know the drill. And even if they are enemies, or mercs hired by the regime change international entreprises, a little dignity : shot, pow, send back, whole. they may be tortured for data extraction (where are the hipster hiding) but that's it... and everyone knows that the best data extraction don't leave marks... nothing and pain is just one way to break the will to keep \"secrets\", and that to inflict pain, of course may lead to permanent scares, however they know the drill, that's the risks... but most of the time, they won't get caught, at least alive :).",
			"added": 1622618791
		},
		{
			"topic_id": 1622622498,
			"title": "dear Australian gov, armed forces and others...",
			"body": "you eliminate the murdoch from the american media landscape, or your nation will ceaze to exist.\n\nhave you understood those words?\n\nyou better. act. now.",
			"added": 1622622495
		},
		{
			"topic_id": 1622622705,
			"title": "The murdochs (sons too) have launched through foxnews a propaganda war against the 2ndA",
			"body": "which consequences should this nefarious internationalist family face? How far are they inbeded with the son of sorros. How far are they both, with ivanka and jared.\n\nHow far are the silicon valley embeded with them? even the borg? maybe not for him, but all the others, full on... \n\nthat's what I find despicable with the current american senior military leadership, they are unable to understand the concept of DOMESTIC ENEMIES...\n\nit's quite simple... are they against the constitution and bill of rights?\n\nexample : believing that institution of the potus has failed, as a system, isn't being against the c and bor SPIRIT... it's to make the union more prefect... who knows it could be worst.\n\nhowever being against the 1stA the 2ndA... and hte list goes on is DOMESTIC ENEMY TERRITORY.",
			"added": 1622622701
		},
		{
			"topic_id": 1622626664,
			"title": "So the certificate of vaccination ID is already being morphed into a fully fledge ID system....",
			"body": "As expected... \n\nhttps://www.zerohedge.com/geopolitical/eu-launches-digital-wallet-latest-step-toward-cashless-society\n\n\"What if, instead of carrying a wallet and a phone, we just carried a phone?\"\n\nand then as expected : \"why not a chip and or some kind of bio nano particules\"\n\nit's for your protection and comfort...\n\ncurrently a plastic ID card can go under water, resist to EMP and CME, light heat too... aka it works when SHTF...\n\nyour phone? even broken a plastic ID card works... and you can use it for many other things... like a knife... or I even saw some opening doors with...\n\nwhat can't you do with a plastic \"blade\"? maybe not sizzle rocks...",
			"added": 1622626659
		},
		{
			"topic_id": 1622626996,
			"title": "Borders or geo-fencing? what do you prefers?",
			"body": "the aristocrats globalists fascist intend to have open borders for them and their work force and regime change agents... however for the serfs, it will be geofencing...\n\nyou get the idea? how more pratical it is for them and their estates?\n\nserfs are forbidden by digital tracking to leave their designated pasture... how do you call an area where serfs are only allowed to wander? \n\nyes, a little bit like \"hunger game\"... I love how there are no sattelites in this movie... at least it's almost realist... predictive or neuro programing by the serfs owners?\n\nserfdom is the abolishment of the us constitution and bill of rights... including one day they will come too for the magna carta heritage in england... \n\nI hope the king is ready for a war, as as said, america is separated by an ocean from england... aka it's clear were is england is...",
			"added": 1622626990
		},
		{
			"topic_id": 1622813363,
			"title": "How silicon valley got fucked by the globalists....",
			"body": "step 1 : convince silicon valley against their values, heritage and culture to destroy us, we the people, a1, a2, a4 etc, you know the gig, america 1st, tea party, my body my choice...\n\nstep 2 : once WE THE PEOPLE see you as the enemies, what you have become, the globalists taxes you like shit, take full control, and laugh about how dumb you were... to have censored and silenced the few who cared about usc and bor... now you have only your drones, unable to understand or cope with anything....\n\nbravo...\n\nstep 3 : time to take back the yachts, islands, mansions, penthouse and others gadget... what, it's not \"fair\", it's not \"equaliy\" and our brave leaders from the NWO deserve it... if you think the greed of nancy is limitless, you are right, it's just her appetite that his small in international comparison...\n\nstep 4 : see you in the sewers... suckers.\n\nI hope now... or maybe later you will get it... then the time to counter strike will have come...\n\nahhh and finally victory again...\n\nsuch stupidity... such amateurism, such arrogance... ridicule.\n\nbut again even if you lose I win :) PRC powa! not noob, reading fine prints... understanding meaning and effects... not like you... relying on corrupt lawyers and other tax accountants who only seek to extract to compete with nancy... \n\nyou have to crash and burn to get it...",
			"added": 1622813356
		},
		{
			"topic_id": 1622822457,
			"title": "Kristalina Georgieva",
			"body": "1) why doesn't she learn first to speak proper english?\n2) why she can't understand that the countries with minimal fiscal space deserve to perish? what is complex? they fucked up, they aren't TBTF... so they go to restructuring, population collapse etc... not my problem if their leaders wanted lambos and bimbos, now they will be hung by their serfs rebelling... otherwise it will be the whole world... aka one world gov is trap\n\nit's easier to restructure usa alone, rather than the whole world with china hit by an asteroid the size of the dinos killer...\n\nthose people are dumb, they have accepted their education all their lives, and never asked question but conformed...",
			"added": 1622822449
		},
		{
			"topic_id": 1622828057,
			"title": "how to mute an user",
			"body": "go to zeroid, search name, enter it, click mute, confirm on top. done & gone.",
			"added": 1622828048
		},
		{
			"topic_id": 1622867842,
			"title": "\"I have never called for violence\" - \" I don't want them to be victim\"",
			"body": "I am so suprised by the average so called alternative media supported by the cia psy controller modern americans... (vs wikileaks for example)\n\nthat's not the land I liked...\n\nI see them as weak, hypocritical, racist cowards...\n\nthat clearly deserve to be genocided using constant stream of soft kill weapons and programs.\n\n1. even if they aren't dumb enough to not understand the soft kill programs deployed on them...\n\n2. they are too weak to even been able to theorize or writte about violence, aka counter strikes.\n\nIn short they have become natives.\n\nI am interested by the land.\n\nI think they are soft...\n\nI liked the america who did the invasion and occupation of irak/afganistan...\n\nat least they believed a little in their texts, even if right now I know it was all a lie and the good guys were fundamentally the \"insurgents\" in irak and the talibans in afghanistan...\n\nHowever at least those americans didn't pretended, and went to fight and kill...\n\nnow, those I see in america, are just worthless occupiers of the land I seek.\n\nthey don't fight against child rapists.\nthey don't fight against all the soft kill weapons (gmo, emf (5g), autism, etc)\nthey don't fight against their own gov being again regime changed...\nthey don't even fight for their constitutionnal order.\n\nFundamentally I mean it's a weak country, a weak legal order, and as such an imperfect legal order, as it doesn't draw will to fight for it...\n\nand by fight I mean to kill the unborn of the enemies...\n\nI prefer so much Russian KGB (for the motherland, beyond death), PRC (5000 years of continuous written civilization path won't be stopped by a few round eyes cockroaches, and Islam... \n\nbecause the muslims, of all stripes, they really do, most, believe in their own texts... and they take them very seriously to the point of defeating the \"kuffars\" (americans) or whom ever in all battlefields.\n\nso the americans have the nazis army type (high tech, low capacity) but with cowards unble to win (otherwise why would austin insit on courage, because there is none anymore...\n\n\" i just want to keep my job\" okay...\n\nI guess I must be lost in translation...\n\nincremental soft kill system deployed on non violent coward population, are on track for total victory... \n\nwill see if toward the end they rebels... but apparently they prefer to conform and obey...\n\nit's or science, or they are non violent...\n\n\"it's like shooting fish in a barrel\"...\n\nbut yeah, dispossessing them of their land is good idea... they really have longer growing season, they are really too weak to oppose... \n\nand fundemantally they are occupiers...",
			"added": 1622867832
		},
		{
			"topic_id": 1622878208,
			"title": "The 5 days no tv challenge...",
			"body": "my qol has increased dramatically since I don't watch french propaganda ! it's amazing, however as I keep going in this project i have rewatched more foreign tv propaganda... and sadly, or happily I see the detrimental effects it has on my psyche. \n\nSo I am more and more interested in trying a full western work week without any \"tv\", and I mean everything with motion pictures in it... I would exclude watching some replay of american soldiers being shredded or this type of events... I mean if california finally sinks I will watch in glee :) but barring unexpected events, I think it could only be a net positive psychological experiment...\n\nso text based news, still allowed, but no \"talking heads\", documentaries etc from anywhere, including my great appeasing chinese medias. total.\n\nsome may laugh at the easyness of this challenge as they practice it for years or even since ever... but for me it is a total life change... not a single tv frame for 5 days... from let's say sunday night to friday evening... video games allowed (of course, but I was boycotting since a while)... \n\nit's not yet decided... \n\nI mean by opposing the uno agendas, I live under constant ebb and flow psywarfare, in various forms, with various intensity, but I have found a few text web based news sources, who are too in the lulz to really affect me anymore ( I say that, but it's already weakness from arrogance and overconfidence)\n\nbut anyway... 5 days , no tv... sounds ez...",
			"added": 1622878197
		}
	],
	"topic_vote": {
		"1622828057_1BVj9Z33CpeFjZejQWc7VV9E4sjYeg9eDt": 1
	},
	"next_comment_id": 36,
	"comment": {
		"1615449081_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 1,
				"body": "I am curious if an injectable cocktail of aluminium and mercury would do the job, meaning reducing him to vegetable while protecting his breathing/heart rate, so that it becomes shippeable safely back to his employer in a state not threatening for any foreign nation? furthermore, it will incentivize the \"employers\" to modify the insurance contract, to add a provision with \"vegetable state\", which will increase the burden on the state providing ground force for the regime change legion... more specialist in regime change vegetablized, more upkeep cost... and I love how is buddies in the regime desk change will think... it could have been them, they could be next, if they accept a regime change mission.\n\nI know it's brutal, but it's a war... some call it hybrid warfare, 4th/5th generation, but after all, all those concepts are just lie : kill all the enemies, war over. always true.",
				"added": 1622617151
			},
			{
				"comment_id": 2,
				"body": "but I heard very positive review of emf weapon... the difficulty like with aluminium/mercury cocktail isn't to fry too much... I want a shippeable product to be sendeable to the sender.",
				"added": 1622617210
			},
			{
				"comment_id": 3,
				"body": "or maybe simple aspartame at high level... but again it's just a little medical challenge... ahh war and medicine... an old story :).",
				"added": 1622617474
			}
		],
		"1622618793_1BVj9Z33CpeFjZejQWc7VV9E4sjYeg9eDt": [
			{
				"comment_id": 4,
				"body": "A good counter example are the mercs caught in venezuela. they aren't regime change specialists... what's up with them? forgotten? #secteamgoneawry",
				"added": 1622619118
			},
			{
				"comment_id": 5,
				"body": "and little reminder, to mercs and others sec team of the internationalist fascist regime changers, sometimes, you will face real state operators opposing you... like you were before you joined them once you left the force. It means they have everything you had in your previous roles + all that you didn't needed to know... aka you could have been \"navy seals\", you will face the \"ghost recons\" of the other side on THEIR home turf... expect more than you can believe, even heroic cops... or simple citizens (civilians) not seeking to have their land regime changed by outsiders.\n\nexample: if someone tells you to attack PBOC headquarters, expect the unimaginable, and rest assured, you launch yourself on a suicide mission, where even if you don't reach the border of China, later, you will be killed...",
				"added": 1622619428
			},
			{
				"comment_id": 6,
				"body": "and not to be confused with for example the lybian situation... where the ambassador even if appearing as a regime change specialists wasn't... and it illustrate too the sec team... they are easy to recognize :), it's just the regime change specialists, specially the forward operators... like \"danny\".\n\nWhat I hate a lot is that it asks the question if journalism is still possible? meaning that most western journalist are in reality regime change operators, making journalism work in western media organization impossible... \n\nMaybe a white list of real journalist? no agenda, no spining, facts, but facts are so dubious specially in regime change wars... it's so easy to lie, to cover things, to present only one side of a story, just a little difference in perspective can make all the difference between a victim and regime changer...",
				"added": 1622621159
			},
			{
				"comment_id": 7,
				"body": "and they make tourism dangerous!!!! again secteam, are easy to spot... now you are a tourist, regime change ops happen, and boom, you appearing suspect, because those regime change specialists will hide among...\n\nthey are a peril to be eliminated. And I don't care if it's the cia or some ciaclone used by the international fascist corporation seeking their world extractive sustainable (perpetual) colonial feodal hereditary system.",
				"added": 1622621342
			}
		],
		"1622622705_1BVj9Z33CpeFjZejQWc7VV9E4sjYeg9eDt": [
			{
				"comment_id": 8,
				"body": "do you think they will succeed in imposing the UNO small arm treaty over the Bill of Rights?",
				"added": 1622622731
			},
			{
				"comment_id": 9,
				"body": "if the dod, cia and co, not the fake \"intelligence community\" aka working for the global fascist corporations were for real, they would launch the death squad kill or capture against all those mentionned.\n\nHowever, and to be clear, don't trust micheal flynn... I bet you he could kill point blank sorros or murdoch sons, but at the condition to not face their fathers in the eyes, there his neuroprogramming would kick in and his worship for them start...\n\nthat's the difference between real patriots and fakers... real one, could have killed the KING OF ENGLAND.",
				"added": 1622622848
			},
			{
				"comment_id": 11,
				"body": "ps little aristocrats, you won't ever disarm pla... dream on...",
				"added": 1622623080
			}
		],
		"1622532770_17qgF4cL3wN9yvkUtEPnVBMvL1exu976uk": [
			{
				"comment_id": 10,
				"body": "maybe a quick question, do you think he understand that when the christ said to his disciples, put down your swords, facing the roman arrest, the disciples were carrying already and carrying all along with him? you get it or not? that's one thing removed at least... in a propaganda war, the enemy will use all your neuro programing, existing and created, to achieve their goals... to disarm and impose this uno small arm treaty, another mortal wound to the legal order of the former republic of the usa...",
				"added": 1622623030
			},
			{
				"comment_id": 13,
				"body": "and when sats down, you won't sleep... ohhh no... fist instant and you know it... or should... there it's back with the maps and compass... who invented compass? gl&hf... domestic china is known and mapped before your people invented the wheel...",
				"added": 1622627146
			},
			{
				"comment_id": 14,
				"body": "that's not even a slam dunk, it's \"eagle wing\"... yeah... ereased, wiped, annihilated... then to be clear the road is simple... up, priviet, we are just passing by...  see you later... waving to alaskians... embark, debark, maybe it won't even be necessary spread, bunos dias, waving to real men... we have reached the wall... back.",
				"added": 1622627280
			},
			{
				"comment_id": 15,
				"body": "post sats, post nuke, post anything you have, ofc...",
				"added": 1622627330
			}
		],
		"1622626996_1BVj9Z33CpeFjZejQWc7VV9E4sjYeg9eDt": [
			{
				"comment_id": 12,
				"body": "\"the american childraping corrupt commitee\" seeks world serfdom... which other nation seek to control demographics in others? which, but an evil gov which deserve to be nuked to hashes?",
				"added": 1622627086
			}
		],
		"1622667866_1BDov7xo2ezh8RNpumtUozsEv9C4yJAF9d": [
			{
				"comment_id": 16,
				"body": "cuckservatives are definitely suckers when they become authoritarian rhinos... I understand bush 2 stole the election, now obiden stole it again... all of this for the kabuki theater, as both seek the uno global one world gov...\n\nfbi agents are domestic enemies, since inception.\n\nyou know it, I know it, we know it... \n\nproblem fbi has 0 legitimacy over PRC... and funnier if FBI agents try to enter china illegally, they will finally be put down...\n\nI hope you will remember, when the cia will try to draft you for a suicide mission inside the PRC... \n\nwhy domestic enemies? how many arrests in epstein case? ahhh yeah... but roger stone, flynn... no problem there isn't it? you laughed ? you enjoyed it? we will when it will come the time to execute you... we will... we can't wait...\n\nit will arrives... shot dead, legally, would you want to wear your little tshirt? would be nice... for neuro deframing training... could even invite some aussies from over seas....",
				"added": 1622806842
			}
		],
		"1622800126_1NH9evu6V4qeiyppRGkdUkTk87eM82oMdE": [
			{
				"comment_id": 17,
				"body": "\"mongos\"",
				"added": 1622813384
			}
		],
		"1622813363_1BVj9Z33CpeFjZejQWc7VV9E4sjYeg9eDt": [
			{
				"comment_id": 18,
				"body": "What I find even more pathetic is that the big tech are in reality little suckers who build everything on the shoulders of the cia/nsa... and as such the american tax payers... so they \"privatized\" gave a veil of coolness to surveillance tech denouced among others by biney (in light version, facebook and all the others are gay)... and resulted in monopolies... at least for drones... like in starcraft 1...\n\nand what is pathetic, is when real \"robber barrons\" saw the game play of the \"feds\", to consolidate them, to then rob their empires, those little wannabes aristocrats created the federal reserve... boom in your ass \"feds\"...\n\nso the little suckers in silicon valley, believe that by playing with this one world gov they will be able to save their empire fucking dream...\n\nand as many I believe that it makes a while that the \"pivot\" to p2p has been ordered, logically, even against our lazyness by the real emperors of the cyberspace... who the fuck wants to have one tech companies going under and people unable to communicate, it's self defeating darpa resistance against nuclear strikes... for example zeronet or bitmessage can both work very quickly after a nuclear strike... a few hit on centralized hosting serving, even just with red ants, and the game is up, america is voiceless... defenseless... nothingness... but the people are lazy... as such tehy have to be incentivized... even the idea of a mothership in independence day is lame... a fleet.. always... ridicule...\n\nlittle vermin too stupid to realize they are muppets... ayayay.... you give them girlz and boozes and they have everything they need, even if the barbarians are knocking on the gates they don't see it...\n\nit's to start to ceaze their estate for the collective... that will teach them \"marxism\"... yeah... let's make vakay home for destitue kids (47 millions americans in poverty 1:8) and send their children to those vanadues... google homes, facebook homes etc... fleeced,.. yacht transfered... for the children... what, you oppose?\n\nyou are against the EMPIRE? ahhh you are the enemies... black site you prefer or \"accidental executions\"? cia recruits poor kids too... who cares... they could be rich... private death squad /on ?\n\nso what's this attiude? but but jacinda is my friend... idiots.",
				"added": 1622820434
			},
			{
				"comment_id": 19,
				"body": "but as we say in the land of the middle kingdom, when the forbidden city ordered, executed it already is, or in progress...",
				"added": 1622820490
			},
			{
				"comment_id": 20,
				"body": "the difference is that the \"robber barrons\" had really build their empire by themselves and from scratch ! so the \"feds\" could fuck themselves in hell.",
				"added": 1622820554
			},
			{
				"comment_id": 21,
				"body": "the true american spirit...",
				"added": 1622820565
			}
		],
		"1622817482_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 22,
				"body": "(look at bolivia lithium production... or ask yourself why don't abrams runs on batteries... ask yourself...) don't fall in their narrative... and more importantly what the fuck is going with wehrner von braunies and his book... there you go... and you are confused again with money transfer and lending... as said many time what does it change if it's usd, yuan, pearls or btc for banking? good luck with your p2p lending and subprimes, exit scam and others shenigans...\n\nthis guy is a troll... there are persons who prefer their privacies and who understand that you can't have a reusable rocket project directed from a yacht or some mcmansion in california with a bigger troll in it...  it's a serious business going to mars... elon does the buffoon get the attentions, the perks... for the risks (ala john lenon) meanwhile the construction can keep on going... because it's almost a series of epic fail and sudden hard to understand destruction punctated with success readying the next fallouts...\n\nthen I am not a specialist, but it was funny to learn that lithium was in cobalt... I am lost... but funny... what do you with the cobalt?\n\nyou are confused, subparly educated, and very lazy, while only repeating mainstream feeding... raise up !",
				"added": 1622820990
			},
			{
				"comment_id": 23,
				"body": "you know the bankers specialist on telegraphic transactions... had their golden ages !!",
				"added": 1622821101
			},
			{
				"comment_id": 24,
				"body": "that's by the way a great part of the stories that isn't often mentionned... what an epoch...",
				"added": 1622821156
			},
			{
				"comment_id": 25,
				"body": "lend $ 10 millions to carnegie approved. stop",
				"added": 1622821201
			},
			{
				"comment_id": 26,
				"body": "ooorrahhhayyy!",
				"added": 1622821209
			}
		],
		"1622800027_1NH9evu6V4qeiyppRGkdUkTk87eM82oMdE": [
			{
				"comment_id": 27,
				"body": "islamic finance... trust... working :)\ntaliban coffers? older than america itself... (remember opioids are very useful in chinese wars...).\nand cave? a beautiful farm in an organic transpirant material (mud) with everything organic under the eyes of God with retreat in caves you call that animalisitic? maybe you prefer your biopod... and afgan dogs, contrary to the myth are proud, full standing members of the houses... even giving their lives without any after thought...\n\nagain there is no voila... you have an intermediary in your play... cyber network... don't remember submarines cutting optics cables or sattelite warfare? again trust...",
				"added": 1622821972
			}
		],
		"1622822457_1BVj9Z33CpeFjZejQWc7VV9E4sjYeg9eDt": [
			{
				"comment_id": 28,
				"body": "and if you ask anything, you get censored... because their little brain are just trained neuro path, they have 0 neural flexibility, even an asics is more flexible...",
				"added": 1622822537
			}
		],
		"1622847784_1HKsVQMZ4JucuBTtzpErwhLKMnScUMGvko": [
			{
				"comment_id": 29,
				"body": "Did you change the torrc and removed # from Control Port 9051 and CookieAuthentification 1 ?\nDid you sudo usermod -a -G debian-tor yourusername?\nDid you eedit tor about:config no_proxies_on and entered 127.0.0.1?",
				"added": 1622866937
			},
			{
				"comment_id": 32,
				"body": "yeah the question is if too much torrification isn't a bad practice in itself...",
				"added": 1622873567
			},
			{
				"comment_id": 33,
				"body": "\"the one network to rule them all theory\".",
				"added": 1622873584
			}
		],
		"1622867842_1BVj9Z33CpeFjZejQWc7VV9E4sjYeg9eDt": [
			{
				"comment_id": 30,
				"body": "ps congrats to those executing it, it's flawless... they can do nothing, I particularly note the \"patient war\"... really not my type... you do that as a hobby I guess? \n\nI am more in the fast flash war camp... once and done.",
				"added": 1622868143
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 31,
				"body": "It was maybe a little harsh against VTB. However the guys must understand how critical the situation in western countries is. soft kill weapons are deployed against native population, with 0 opposition. against those forces, top of the game necessary, not regulatory domestic capture and I know ultimately that refugeeing back to SU isn't courage, but seriously, what can I do? neonazis wear pink suits. Natives love it, and don't imagine to kill neo nazis... but maybe they too don't understand the menace... at least when I say to Kremlin, \"neo\"nazis depopulation, bio soft kill weapons... they don't look like amused people, they know what SU had in store for it's enemies... they saw ukrainians comrades become enemies... they saw all the attacks against Russia... and have it all on records. maybe I should remember this expression for bankers : \"paper pushers\" or soft handers. aka weak.",
				"added": 1622868672
			},
			{
				"comment_id": 34,
				"body": "seriously, I just want to be able to open a very small bank account, in a russian bank totally isolated from any possible western sanctions... how do you want poor foreign people to accumulate savings if they are forbidden for being too poor (not meeting the minimal threshold for opening up)...\n\nand it's just a bank account, I am not asking for the wmd programs launch code, aka no need to go to the russian embassy... \n\nand as reminder, we the little people don't want to invade russia, nor can... we did nothing in the fall of soviet union, contrary to those you court... \n\nand the most important argument, we may be very poor, but there are a lot of us !!! and logically some of us may even get super rich one day... \n\nso please... opening up ! welcome foreign little (nano) capital... \n\nwhy this begging? because I sincerly believe and everything putin has ever done proves it, he doesn't want to reduce the russian population... at least it seems from my outsider perspective. I never heard or seen a policy where putin deliberately enacted something intended to reduce the russian population... again I could be wrong, what do I know... but that's what I believe. I don't say he may or will not do mistakes along the way (5g for example) but nothing is deployed or executed with the intentions to wipe or reduce the number of russian people in russia...\n\nagain, I am always open to discussion, counter factual arguments, even theories as far fetched and convulted they may be... I didn't find a single one. \n\nin simple term:\n\nthe current kremlin doesn't want to reduce the russian population.\n\nprove me wrong.",
				"added": 1622874009
			},
			{
				"comment_id": 35,
				"body": "on the other hand this embassy visit to certify documents make the whole system even more secure, at the condition that this certification is only valid once or for a short term duration and or for a specific reason...\n\nin the sense with western identification, send two papers, the state operators can do the same and steal everything however if they have to go to the russian embassy to impersonate someone, it's... let's say  : more tactical...",
				"added": 1622878854
			}
		]
	},
	"comment_vote": {}
}