{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1623098855,
			"title": "Rand Paul reactions to his death threat amuses me...",
			"body": "this guy, like most americans is just a muppet, idiotic, weak, unable to understand the situation...\n\nA question : do you think anyone in china dares to threaten a member of the chinese people congress? you know the consequences of such actions? \n\nlet me explain...\n\nwe don't tolerate foreign or domestic enemy groups.\n\nwe think that if such a threat arises, it would be directed by a nato agent... yeah...\n\nso first, we would recover the suspect inside china, extract the data revealing or leading to his foreign handler...\n\nthen who knows...\n\nso for you the situation is simple, 2 choices :\n\n1. leave. aka admit the fbi is fucking corrupt, gone rogue, a treason treacherous organization who regime changed pedo trump, before protected epstein and his buddies, 911 / wtc 7, fda depopulation dumbing down etc etc etc etc etc...\n\n2. welcome to iw2... yea... and it involved fragging maybe just 20% of the fbi or maybe 80%... the purge... by wall execution or simply mass graving those involved in those activites.\n\nWhat do you chose? play us? do a little poney trick? what did you say about epstein buddies immunities? ahh nothing... why? maybe you should be purged too?\n\nlike manchin said, we can trust no one in this quagmire that this republic has become...\n\nhitlary emails, trump raping kids, I mean... this is fucked up. and it's not because of others destabilization, but it's of your own as a nation incompetence... kids trained to become sex slaves... and you do nothing? and you want to be called even a nation? where are you? what is wrong with you people? what have you watched on tv? do you watch tv? \n\nnefarious and malfeasant has the first american republic become... \n\nI am sorry but memorandum 220 about \"managing demography in other nation\" is act of war, as is guide stone agenda... declaration of war... \n\nmy wish is that there is nothing left of such a people who allowed their nation to become this... nothing left, but the beautiful land and beaches... \n\nit's way past time to wake up... and you will see the nightmare is real... \n\nlook how did the fuck nancy got 120m ? doesn't seem strange? \n\nthe two real problems is that this idea of america was cool and the wmds are real...\n\nthat's the fundamental equation that will have to be resolved, by the outside world...\n\nexpect the unexpectable...\n\n\npoor americans, the election was stolen from a childrapist... paroxysm of decay... \n\nsad sad sad... but so it is, and not admitting it would be even sadder... \n\nadmit, solve, and next.\n\nmoving on...\n\nbut you don't want that, you all, in this congress, want to play politics... ahh you like it? that doesn't solve... you are stuck in your own fiction.\n\nconclusion : leave, go visit china, safe you will be... guaranteed, lot of budget allocated for it, as much as necessary... but your republic has fallen.",
			"added": 1623098854
		},
		{
			"topic_id": 1623102007,
			"title": "The DoD will have to address the CiC/potus concept and free press in the next regime change...",
			"body": "1. CiC/Potus could work with the super heroes, american founders, mr washington... no worry... battlefield tested... they knew the price and risk they took to get their franchise free from the royalties of some seeking the world... today, it doesn't work. \n\n2. the free press... that explain too why 1 (elections), can't work... already there is no battlefield testing (against the red coat in the past), and secondly this press is beholden ultimately to the interests of the federal reserve / banking system / private interests (bankers don't know it all)... imagine alexjones with the budget of the 6 globalist combine? lol... \n\nof course there are no perfect solution... at least I am too stupid to find them. \n\nfor 1. I would say moving to a board system like the federal reserve... or ccpsc... it's too much work and temptation and responsability for one man for the potus system, for the cic, ultimately, can really the civilian world force it's way? it's an interesting problem there... the same failures of the civilians would be as or more dramatic on this side of the operations too.\n\nfor 2. there is already to find a way to dis-intermediate the federal reserve / banking system / private (or worst foreign ) interests from policing speech and the free press... secondly, why not test a mega tax on the 6, like mega, all assets ceased of everyone from ceo, to shareholders, to all employees + a mega redirection of their income to a plural multi tv public channel system, meaning each faction could have his news paid for by the tax levied on the private giant combines... right now the 6 are in reality one.\n\nbecause in a normal res publica : peanuts vaccine development leads to allergies to peanuts > press > judgment > problem solved > executive happy (and not too proud, but job done, next problem). usa? I find that by luck... crazy story, to become subject to autoimmune reaction to peanuts... nuts are base nehandertal food... \n\nanyway... usa = chaos. there is the bests and the worsts... diverse for sure, but it's the worsts who have taken control since a while... maybe since arrivals of the white demons as the 44th would said? \n\nand some ask why I say dod? because contrary to the fbi, most american people, and even the \"cia\", some in the dod saw the post republic stage... it's not pretty... and those who say you need to be a though guy to survive it, lie... it's team work (like in the cjng, who may become one day the new american leadership, who knows what the future holds, but God :D)",
			"added": 1623102005
		},
		{
			"topic_id": 1623130441,
			"title": "A mass execution \"party\" aka live training !",
			"body": "I think it makes a long time  the dod didn't conduct such operations. And as it's an integral part of the american way of war, I think the only problem is to find unwilling participant to this live exercise ! \n\nFor it to be realistic and of value, it needs to be based on \"american\" experimental subjects.\n\nAs my username suggest, I have found the perfect organization to achieve this rare feat of war... \n\nof course the fbi is just part of it, then all the pedos in the congress, in the white house, in the cia and maybe even some internal infiltrators... it's gonna be cool !\n\nmy idea is to put a 3 side wall near a yuge cliff (grand canyon), accumulate them there, and then move from the opposite side of the void, and push them to their fall (and death). \n\nI think it's very cost effective and necessary. Killing the internal enemies of the republic should be fun, interesting and instructive... maybe one will fly away :D. who knows...",
			"added": 1623130438
		},
		{
			"topic_id": 1623132654,
			"title": "today again I feel a little bit dumb... (I am used to it, don't worry)...",
			"body": "so the spike proteins are toxics? heheheh... I mean that would be logical... why only insertion system, but not shards too (or what ever they do in reality) as such...  I let those with an iq above 2 think... (at one 1 it will be too hard, move along :D).\n\nhowever if proven, and it will, sooner or later, there will be more people at the party... there are so many way to reach demographic objectives... I don't like this word \"objectives\"... that's the whole point... it grows, it collapses, the ebb and flow of life. what I don't like is the managed idea or aspect of it... that disturb me, as like for the tax revenues they will farvorize their own... it's only natural... not their fault. I prefer reality based...\n\nthe ship fleet parallel is cool... 1 ship is well build, staffed and stocked... on the side there are buffons with the greatest narrative in the world... shitty ship, unable to crew, not sufficiently stocked... now good ship is ready for it's mission and eventual (probable problems arising) while ship two sucks... ship two real mission, is to return nutrients to the ocean... I know it's hard for the muppets and do talk gooders (like alex jones, or sean hannity etc, who only pretend, but never ran a soup kitchen...)... but ship 1 is on. the trail is full of dead... if there are the wind of life pushing it, naturally as a secondary consequences order there is a trail of dead behind... because you think seamen don't poop? and it's a nice day to poop on the ship 1... once they ran out of stock they didn't on ship 2... at least that's what was heard before they joined the trail...",
			"added": 1623132649
		},
		{
			"topic_id": 1623143244,
			"title": "Urgent Help Needed : my enemy list has no blacks on it !!!! RRRRRAAAAAAYYYYYYYYCCCCIIISSSMMMM !",
			"body": "so of course i add the rices... susan (obidet) and conde (911 2 wars)... but that's unfair on the rices... then I add the obama's as those who covered for pedogate for 8 full years (what a bunch of marxist terrorists) and all the nefarious activities they did.\n\nSo who else? \n\nmaybe adding boko haram for kidnapping children... okay that's a bunch there... but I don't even a kinapper name...\n\nso who else? please make your proposals? \n\nfundamentally I am super angry regarding the total lack of empathy compassion care respect and diligence regarding the mostly white pedogate victims... total treason, but okay wanna play community...\n\nin the same line, I remind that the asian who did the bike attack on the car window, I hope, is in jail for a long time... it was such endagering of life... such a nazi.\n\nbut back to the topic... who?\n\ngeorge flyod, with his shotgun attack and use of fake notes...\n\nokay next?\n\nahh maybe the ceo of pfizer? ahh no he isn't black but there was one... mercks okay... but I have no precise reason but that his part of the drug traffickers... (censorship of natural medicine etc)...\n\nwho else?\n\nhelp... systemic black enemies of mankind?\n\nof course there are those in south africa conducting their white genocide operations against white farmers, but again I couldn't even give a name...\n\nso who are the blacks on your enemy list? I mean systemic... (not your neighbor who is playing too loud music or some kind of shit)...",
			"added": 1623143238
		},
		{
			"topic_id": 1623154590,
			"title": "A world day against tv addiction ! save the planet turn off your tv, tv consumes co2 (lol)...",
			"body": "that would be a nice world day that I could support whole heartily by watching tv :). The fight against TV should be a global endaevor... it's the war on tv !",
			"added": 1623154583
		}
	],
	"topic_vote": {},
	"next_comment_id": 29,
	"comment": {
		"1623102007_1GcwzZUdjRJgy64A6owbCayRMbsJgHCw1v": [
			{
				"comment_id": 1,
				"body": "what's funny is that the usa are first an army, then a country... in china, prc is first a party (ccp) then an army (pla), on a country older than the world... :). a funny moment in the history of china? is when khan men failed the test, and it was the moment to announce them the bad news :). not this time, only the joy of the successful was able to smooth those deceptionned by themselves... as the khan said (I guess) as long as it's fair... now for those failures, time to announce the bad news to the one... to whom none lied to live. #shouldhavestayoverthesteps and I guess he said : maybe next year :).it's already great to have attempted it, and a significant step toward integration. and the question as some like it : why didn't the khan did it? answer :",
				"added": 1623102742
			},
			{
				"comment_id": 3,
				"body": "https://www.zerohedge.com/political/cia-disinformation-operations-come-home-us\n\nwe will kill brennan, but torture him so much that then he will be force to eat a slice of a haspel then her a silice of him, until both in feeding are united for eternity.",
				"added": 1623131074
			},
			{
				"comment_id": 4,
				"body": "you wanted to enslave us, rape our kids, genocide us, and demographically control us... vengeance. and you will see that again the \"jews\" your phantasm just got crushed by ROME... an envoy... nothing fancy.\n\nand I don't want to hear from the losers domesticated docile team : alexjones, mikeadams and his friends, seanhannity or tuckercarlson... please comment , enjoy the show... it's rated gore :) ahhh I get it, you can't make money of it... so you don't like it :D. losers.\n\nto get back to original topic do you seriously believe that a foreigner will be allowed in the forseeable future to control chinese medias? ruppert murdoch is a good example... the fucker is australian, wrong... another dual let me guess, or an ass licker of the dual? I don't even know...\n\nit gave me an idea...",
				"added": 1623131328
			},
			{
				"comment_id": 5,
				"body": "https://www.zerohedge.com/technology/ted-cruz-facebook-could-be-held-liable-actions-and-correspondence-dr-fauci\n\nthe counter example of decency... ohhh they could be liable... what the fuck is this pussification : Tarring and feathering on the rope on the back of the horse, rulez ! We want to see the vulture trail across the plain... what do they put in the water in cancuckistan",
				"added": 1623131496
			}
		],
		"1623126921_17acRdGcjvxADub5JdDmdLpx2D1LbPns5w": [
			{
				"comment_id": 2,
				"body": "You could ask on http://127.0.0.1:43110/1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq/ (zerotechtalk).",
				"added": 1623130053
			},
			{
				"comment_id": 28,
				"body": "> [guaxinin](#comment_2_17acRdGcjvxADub5JdDmdLpx2D1LbPns5w): thankful.\n\nyou are welcome, but I am still doubtful about your quests for an answer here... you could try bitmessage too... if they like you question, prepare for a flamewar about which is best... if they like it...",
				"added": 1623162727
			}
		],
		"1622878208_1BVj9Z33CpeFjZejQWc7VV9E4sjYeg9eDt": [
			{
				"comment_id": 6,
				"body": "day 2 : seriously, since day one I have a clearer vision and mind. like if there was some neuro toxcity from watching tv... like if tv generated brain fog. I mean it's crazy... my theory is one there is the demoralization effect of the narrative, and a second effect, more bio physiological... will see how day 2 goes...",
				"added": 1623133102
			},
			{
				"comment_id": 7,
				"body": "I am starting to think I am experiencing withdrawal symptoms from no time vampire project... those individuals (to be mass executed) are so nefarious and malfeasant that I wouldn't exclude they found some way to create biophysiological dependence on tv... and ruthlessly implemented it... or it could be from over activity yesterday... who knows... what's going with the tv.",
				"added": 1623135079
			},
			{
				"comment_id": 8,
				"body": ">\"After all, what are you going to do, change the channel? Actually, that’s happening. Month after month, ratings reports show CNN and MSNBC getting their clock cleaned by Fox News – and Tucker Carlson in particular. The response is to triple down on wokeness and Democrat talking points, while waging a veritable jihad against Fox for “misinformation.\n\n>to think that the media will come to their senses when the reality of ratings hits them in the face, therefore, is foolish. They simply don't give a damn. Could it be that they don’t care for money as much as they care about power? And not just proximity to political power, but the power to shape and control reality itself, to remake society according to their utopian ideas. Even assuming those ideas are good – and that’s debatable at best – having that sort of power corrupts absolutely, to borrow the expression from Lord Acton.\n\n>The media were meant to be a means through which the public collectively perceives reality – not the creators of reality itself! Yet they act as if the latter is true and intended. That’s dangerous. They believe themselves in control of reality, to the point where they’re impossible to reason with. Confront them with actual facts, or principles, or laws of physics, and they either censor you – or cackle and carry on.\"\n\nthey will pay with their lives, wealth and families... execution walls, sadam style :).\n\nthey ain't press, they are internal enemies.",
				"added": 1623135275
			}
		],
		"1622667866_1BDov7xo2ezh8RNpumtUozsEv9C4yJAF9d": [
			{
				"comment_id": 9,
				"body": "I can wait to watch the execution's replay of the former fbi female of indian origin... it will be soo cool... arabian style, aka in sandals...  it's an impressive picture btw :) (the real one, I mean).",
				"added": 1623135453
			},
			{
				"comment_id": 11,
				"body": "please why are all my fbi enemies whites or indian? add some diversity... I don't want the mass execution to be tainted by raycism accusations... that would sadden the party :).",
				"added": 1623143340
			},
			{
				"comment_id": 12,
				"body": "stroke, page, muller, those who harrassed flynn, those who arrested roger stone (not for corruption based on child rape).... the indian girl... the white girl on cnn (but I guess more a cia reject)... a real terrorist with black hair... I have not a single black or asian or latino enemy at the fbi !!! this is pure raycism... it's not okay ! things much change fast !",
				"added": 1623143506
			}
		],
		"1623143244_1GcwzZUdjRJgy64A6owbCayRMbsJgHCw1v": [
			{
				"comment_id": 10,
				"body": "ahhh I have new a one... lynch... lorretta...",
				"added": 1623143271
			},
			{
				"comment_id": 13,
				"body": "great a new one : Eric Himpton Holder Jr. !",
				"added": 1623143554
			},
			{
				"comment_id": 14,
				"body": "but it's not the way to grow a kill... hmmm... I mean an enemy list... what a lapsus:).",
				"added": 1623143582
			},
			{
				"comment_id": 15,
				"body": "what's sad, is that they are all connected to obamas... that's not diverse !",
				"added": 1623143622
			},
			{
				"comment_id": 16,
				"body": "anyway, maybe you can help...",
				"added": 1623143651
			},
			{
				"comment_id": 17,
				"body": "the core problem is that with my non colonial reciprocal non interference strategy regarding africa, I have really limited the field of possibles...",
				"added": 1623144020
			},
			{
				"comment_id": 18,
				"body": "I won't lower myself to add some talking head from cnn... that could be a good sourcing of low priority/value enemies...  but I would still up don lemon... specially vance, or even the \"german\" aren't on it... sadly... we need some chattel triage :). and the problem is that obama is half white... so he should be on the mullato enemy list... when CRT take over enemy list building...",
				"added": 1623144195
			},
			{
				"comment_id": 19,
				"body": "and so I even have to remove boko haram... not my problem.",
				"added": 1623144246
			},
			{
				"comment_id": 20,
				"body": "I don't endorse... it's just that the list has to be pure.",
				"added": 1623144259
			},
			{
				"comment_id": 21,
				"body": "again I hoped to be able to fill in france... but it's mostly low value/ low priority... like the enraged black girl on crt / decolonialism or her male friend on the israeli tv... or the chimp in the tree girl... what a nazi this one... okay let's make it : christine taubira... yeah... she get to the execution system ! it will make me laugh :).",
				"added": 1623144361
			},
			{
				"comment_id": 22,
				"body": "this issue is clearly a blind spot...",
				"added": 1623144424
			},
			{
				"comment_id": 23,
				"body": "ahhh yes I have found a yuge source !!! those who seek to block the nile ! but again, they are already under scrupulous watch... but I add them, otherwise, really this list is raycist... it's not proportionate to the others...",
				"added": 1623144493
			},
			{
				"comment_id": 24,
				"body": "enough time wasted... maybe with demographic growth, the list will get into high gears someday :).",
				"added": 1623144565
			},
			{
				"comment_id": 25,
				"body": "amazing ! we have a great entry : whoopie goldberg, she goes to the top of the enemy list ! congrasts girl...\n\nthe obamas are removed, I have no problem with the wookie...  and the mulato is on how own personal list.\n\nand of course there are only targets... ooopsssie, I mean living... so floyd is gone. \n\nSo updated : \n\nsusan rice\nwhoopie goldberg\ndon lemon\nloretta lynch\neric holder\ncondolezza rice\nmercks ceo\n\nperfect no misogynism... this femalist revolution has increased the potential so much ! thanks girlz...",
				"added": 1623148345
			},
			{
				"comment_id": 26,
				"body": "We have two new introductions !!! corrie lighfoot (to the lake) and oprah winfrey !!! (I need more males)... and 1 added two more to go :\n\nsusan rice\nchristiane taubira\nwhoopie goldberg\ndon lemon\nloretta lynch\neric holder\ncondolezza rice\nmercks ceo\nlorrie lightfoot\noprah winfrey",
				"added": 1623153432
			}
		],
		"1622967007_1Hkb9FSSux5SJFvuaQ5SKFnievTujtAsZt": [
			{
				"comment_id": 27,
				"body": "> [orien3242](#comment_73_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP): dear stupid,next time a school shooting happens drop your address so I can literally kill you without a gun. I'll make sure to knock politely and ask your mommy if you can come out to play and then pat your loved ones in the head.\n\ndear stupid,\nall authoritarian regime who conducted democides took the gun... learn from history, don't repeat it.",
				"added": 1623153642
			}
		]
	},
	"comment_vote": {}
}