{
	"title": "Thagoat's Blog",
	"description": "Here there be goats",
	"links": "thagoat@zeroid.bit<br>\n[My clearnet blog](https://thagoat.com)<br>\n<b>Projects I Like:</b><br>\n[RaspberryPi](https://raspberrypi.org)",
	"next_post_id": 8,
	"demo": false,
	"modified": 1459057011,
	"post": [
		{
			"post_id": 7,
			"title": "How To Be A Pirate (on the cheap)",
			"date_published": 1459054001.099,
			"body": "So you want to download illegal content?\nGreat! But you have a few options, and they're confusing...\nSo let me clear a few things up.\nFirst, torrenting is dangerous (and stupid if you don't hide yourself). \nTo torrent safely you will need to do one of the following:\n\t1. Buy a VPN (expensive, but relatively easy to setup)\n\t2. Buy a proxy service (less expensive, but slow and unreliable)\n\t3. Buy a vps and host your own VPN/proxy (expensive and technically difficult)\nAnother option is Usenet. It can seem daunting but it's very simple to get running on your machine. Usenet, with the proper provider, is very secure but can become very expensive.\nSo how do we become frugal pirates? IRC!\nWait, IRC? Yes!\nAnd here's how:\n\t1. Intstall an IRC client (XChat, HexChat)\n\t2. Connect to some servers (abjects)\n\t3. Join some rooms (#mg-chat,#moviegods)\n\t4. Follow the instructions provided in the rooms\nEven though downloading from IRC is your safest bet, a few steps should be taken to ensure your anonymity. Connecting through a bouncer like ZNC (visit http://wiki.znc.in/Providers for a list) helps to hide your precious IP. If you have a socks proxy (see my previous [post](http://127.0.0.1:43110/1DXDDPLAvZNrEg4wzsX8CJqAzZvQ9G1Rvj?Post:6:Shadowsocks:+The+ultimate+proxy+server/client) on your home connection you're already ahead of the game, but downloading from an IRC server is very safe due to the fact the downloads are offered on servers that can't track your IP, and are hosted on servers that are exempt from DMCA.\nNow you have the tools, so get downloading!"
		},
		{
			"post_id": 6,
			"title": "Shadowsocks: The ultimate proxy server/client",
			"date_published": 1458434079.654,
			"body": "I found a forum post that mentioned Shadowsocks last year. I installed the server on my server and the client on my desktop PC and my Android. And it's AWESOME! It's basically a SOCKSv5 proxy, but it's end-to-end encrypted with your choice of ciphers. I use AES-256-CFB.\nThe app is super simple to set up. Install the software with pip on both machines (sudo pip install shadowsocks), edit your config file (the same file works on both ends), and start your server/client! The android app impresses because it stays active even if you lose 4g/wifi signal, so no need to reconnect. Linux, Mac and Windows all have GUI clients, and you can also activate the client from the CLI. Android and iPhone have clients, and for you hardware hackers, there's an embedded release for OpenWRT. \nYou can thank Mr. Snowden for all the awareness about the 3 Letter Agencies snooping, and this tool helps you fight back."
		},
		{
			"post_id": 5,
			"title": "And now..",
			"date_published": 1458144304.748,
			"body": "More of the same! Back to work again. Ho hum.\nI think I'll break out the new Raspberry Pi 3 and start to tinker tonight. I got the thing last week and needed a 2.5A power source, which I got right before the weekend waterpark trip. So now that I'm home I'll hack!"
		},
		{
			"post_id": 4,
			"title": "A Big Splash",
			"date_published": 1457872970.496,
			"body": "Today we go to the water park. \"In winter?\" you ask. Yes. It's indoors!\nhttp://www.kalahariresorts.com/pennsylvania\nPlus they have a float up bar...so ya know. Awesome."
		},
		{
			"post_id": 3,
			"title": "So very impressed",
			"date_published": 1457832559.996,
			"body": "I found ZeroNet yesterday on a forum not related to P2P at all. And being the early adopter type, I dove in head first. I haven't been this excited about a new tech idea in years! \nI was late for a dinner date last night because I couldn't tear myself away from the computer. Lame, yeah. But this is such an exciting idea, that no one can take down what everyone publishes. It's radical RAID storage! Fabulous fail-over protection! Ridiculous redundancy!\nOk sorry. I'm just tickled pink =)\nCarry on...."
		},
		{
			"post_id": 2,
			"title": "Jeez, I must be hungover",
			"date_published": 1457802542.905,
			"body": "I tried like hell to make my first blog post this morning, but coulnd't figure it out to save my life. So I cracked open a beer and then, like magic, I figured it out.\nYeah, I'm special!"
		}
	]
}