{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Coïncidence ???",
			"body": " Le Laboratoire biologique chinois de Wuhan appartient en fait à Glaxo,\nqui par coïncidence possède Pfizer(vaccin Covid-19), qui par\ncoïncidence est liée aux finances de Black Rock, qui par coïncidence\ngère les finances de la Open Fondation Society (Soros), qui est par\ncoïncidence proche d’AXA, et par coïncidence de la société Suisse\nWinterthur qui a construit ce laboratoire, acheté accidentellement par\nALLIANZ, qui a comme coïncidence d’avoir un grand actionnaire\nd’avant-garde, comme Black Rock contrôlant les banques centrales et\ngérant 1/3 du capital d'investissement mondial , qui par hasard est à\nla fois un grand actionnaire de Microsoft et Gates, qui est par\ncoïncidence un actionnaire de Pfizer et actuellement le premier\nparrain de l'OMS....\n Vous suivez?",
			"added": 1608990587
		}
	],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"2_16ANkHsczDJfSc8YeKYG3nGi8uGNzCmmU9": [
			{
				"comment_id": 1,
				"body": "Très bonne initiative",
				"added": 1605703113
			}
		],
		"4_17TFi7VtcyxehZB8JUN43trfr5hkjnoHsc": [
			{
				"comment_id": 2,
				"body": "C'est la dictature maintenant ...",
				"added": 1606033046
			}
		],
		"7_14Y5YpotfVjQyQfdrW3PFuYDQTfpPAZ4GK": [
			{
				"comment_id": 3,
				"body": "En fait, on s en fout du macron... MDR. Mais c'est vrai que les médias vont nous bassinet pendant des jours et des jours avec ce connard.",
				"added": 1608388898
			}
		],
		"6_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": [
			{
				"comment_id": 4,
				"body": "Merci pour le lien, mais il est aussi uploadé sur ZeroUp",
				"added": 1608990702
			}
		],
		"6_17TFi7VtcyxehZB8JUN43trfr5hkjnoHsc": [
			{
				"comment_id": 5,
				"body": "Et oui, ils ont réussi au fil des années à tous contrôler ! On ne voit plus qu'eux...",
				"added": 1609502473
			}
		],
		"3_16ANkHsczDJfSc8YeKYG3nGi8uGNzCmmU9": [
			{
				"comment_id": 6,
				"body": "> [mrjack](#comment_2_1BsefYDX8Cvc8cN4ShdoAWBhfksfdg6mMH): Je me suis déjà fait censuré sur une instance Mastodon (miaou.drycat.fr) alors que je n'ai écrit aucune insulte ni de termes péjoratifs. Quand tu vois tous les gauchos qui traînent sur ce réseau, tu comprends mieux la situation. Ils ne supportent pas la critique...\n\nEn même temps, sur des vrais réseaux sociaux, il ne peut qu'y avoir des gens de gauche, puisqu'ils ont un grand côté social",
				"added": 1610562528
			}
		],
		"2_1BsefYDX8Cvc8cN4ShdoAWBhfksfdg6mMH": [
			{
				"comment_id": 7,
				"body": "Oui c'est scandaleux et en même temps, on savait que ces gafam etaient des gauchos",
				"added": 1610566550
			}
		]
	},
	"comment_vote": {
		"2_1BsefYDX8Cvc8cN4ShdoAWBhfksfdg6mMH": 1
	}
}