{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1535486435,
			"title": "Technical help for running ZeroNet on a remote server",
			"body": "I am running ZeroNet on a remove server and do port forwarding to my local PC. Unfortunately when closing the ssh to the remote server ZeroNet dies. What can I do to have it continuously running?",
			"added": 1535486434
		},
		{
			"topic_id": 1535486982,
			"title": "Authorization on ZeroNet gets lost every now and then",
			"body": "While being connected via Tor it looks like the personal identity gets lost at some unclear stage and I have to logout and \"Login to another account\" again. I do have the Multiuser plugin working - at least I think it is working - any idea to improve that ?",
			"added": 1535486980
		},
		{
			"topic_id": 1536332522,
			"title": "I like to support ZeroNet",
			"body": "I have some spare server capacity and like the idea of ZeroNet. As I am not a coder how can I best support the Net in different ways? \n\nYour proposals and hints are highly welcome - the more detailed the better or dont be scared about my follow up questions :-)",
			"added": 1536332519
		},
		{
			"topic_id": 1536424390,
			"title": "How anonymous am I while using ZeroNet with TOR?",
			"body": "was a question here: https://www.reddit.com/r/zeronet/comments/90s4mv/how_anonymous_am_i_while_using_zeronet_with_tor/ \n\nMaybe one can bring discussion a bit into ZeroNet and add value to ZEROTALK by asking here :\n\n\"whatever54654: If you used Zeronet without TOR then you should delete your user data/folder before you connect with TOR. \"  \nAre this files \"poisoned\" - wky, in which way please?",
			"added": 1536424386
		},
		{
			"topic_id": 1537118724,
			"title": "Maximum number of relays under one external IP",
			"body": "Is there like on TOR a maximum number of instances that I can run under one external IP only?\n\nIf so - what makes the limitation?",
			"added": 1537118719
		}
	],
	"topic_vote": {},
	"next_comment_id": 16,
	"comment": {
		"1528382232_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "When I use the tracker list from below, I do get 7/30 or even 12/30...how many percent do I need to get a green tracker notice and update is working",
				"added": 1530037886
			}
		],
		"1535486435_14RCTJp4ozmDH2c49CxmC98Mfp1fsgXz3F": [
			{
				"comment_id": 2,
				"body": "Yes, I do launch it from terminal from the locl PC with \"python2 zeronet.py --ui_ip \"*\" --ui_password\"\n\nWhat I would like is that I start it from local PC and hopefully runs for ever or checks itself and restarts after it might crash, even when I shutdown my local PC",
				"added": 1535491051
			},
			{
				"comment_id": 3,
				"body": "@nofish: Thank you - so i would install \"screen\" local start it and shutdown my local PC?",
				"added": 1535491140
			},
			{
				"comment_id": 4,
				"body": "I am not sure what you mean by child process so let me just explain what I do and happens:\n\nI log into the remote server via ssh and port forwarding the 43110 to a local port on my PC\nthen: ZeroNet-master$ python2 zeronet.py --ui_ip \"*\" --ui_password any-password\nit starts and runs correctly until i send my local PC to hibernation or shut it down.\nThis obviously stops the SSH process right at that time with terminal still open.\nSo if I start back the local PC from hibernation i still can see the time it stopped in my last open terminal session -its the time when the hibernation started",
				"added": 1535492688
			},
			{
				"comment_id": 5,
				"body": "Solved - thank you all who helped.\n\nAs screen was already installed on my PC - i wasn't aware of that - i am doing it with screen - the only change i did is:\n\n3. python2 zeronet.py --ui_ip \"*\" --ui_password any-paasword",
				"added": 1535563300
			},
			{
				"comment_id": 6,
				"body": "Maybe one question left:\n\nIf ZeroNet crashes under those remote circumstances and i am obviously not aware - how can i best bring it to auto-start again (under Linux and FreeBSD) - maybe with sending me a short notice afterwards? \n\nI like to install it on several servers and cant check all the time - maybe there is a special MUNIN template here available as well?",
				"added": 1535563703
			}
		],
		"1536332522_14RCTJp4ozmDH2c49CxmC98Mfp1fsgXz3F": [
			{
				"comment_id": 7,
				"body": "Ok - how to do that most efficiently - I am  a newbie as some call it (and maybe your explanations help others who might read it)",
				"added": 1536333799
			},
			{
				"comment_id": 8,
				"body": "Lets start with seeding sites, as it seems easiest  - not own sides\nDoes this mean that I have to be on each side first and klick on every single link on it or is there a better way to do it - a way of harvesting content?",
				"added": 1536353978
			},
			{
				"comment_id": 9,
				"body": "@robione - whats the advantage for people to come in ZN via a Proxy?\n\nWhats the legal side on offering a Proxy-service for the provider?",
				"added": 1536354921
			},
			{
				"comment_id": 10,
				"body": "> [robione](#comment_17_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): make a public ZN proxyadd it to http://zero.acelewis.com/he also has videos on youtube that explain how\n\nthose proxy seem not work at the time, because of taioan.tk in the background (maybe down) - but I will check the videos - thanks",
				"added": 1536356865
			},
			{
				"comment_id": 11,
				"body": "> [gardenparty](#comment_9_14RCTJp4ozmDH2c49CxmC98Mfp1fsgXz3F): @robione - whats the advantage for people to come in ZN via a Proxy? [...]\n\nok :-), one answer to myself: https://www.reddit.com/r/zeronet/comments/997p2i/zeronet_open_proxy/",
				"added": 1536358330
			},
			{
				"comment_id": 12,
				"body": "> [kaffie](#comment_649_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Just visit the site's homepage and that will seed it. If there are optional files you can start seeding them by enabling the option in the sidebar (click+drag the 0 button in the top right corner).\n\nThats done kaffie - thank you\n\nOn that right side -what are Database (reload, recreate) are doing\nand\nwhat is SiteControl (actualize/pause) for ?",
				"added": 1536407029
			}
		],
		"1536424390_14RCTJp4ozmDH2c49CxmC98Mfp1fsgXz3F": [
			{
				"comment_id": 13,
				"body": "\"I'm volunteering my minimal, surface-level knowledge in case it's useful at all.\" - i like your kind of understatement and help, even if i dont understand every word you say :-)\n\nWhy is an IP attached to a file I hold?",
				"added": 1536439946
			},
			{
				"comment_id": 15,
				"body": "> [caryoscelus](#comment_82_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): As i said, i don't know much details. But there should be a way to check whether site is hosted by peer in order to make transmissions. Perhaps someone more competent can add more details.\n\nYes, could we please have a detailed explanation of that process?",
				"added": 1537349646
			}
		],
		"1537118724_14RCTJp4ozmDH2c49CxmC98Mfp1fsgXz3F": [
			{
				"comment_id": 14,
				"body": "Thanks @ z9eradct .Maybe my question was not clear enough:  How many ZeroNet instances can I run under one single IP and does it make sense at  all to run more than one?",
				"added": 1537174532
			}
		]
	},
	"comment_vote": {}
}