{
	"next_topic_id": 13,
	"topic": [
		{
			"topic_id": 1,
			"title": "Rojava, revolução ameaçada no Oriente Médio",
			"body": "#Como surgiu o singular projeto do PKK, que concilia socialismo, anarquismo e ecologia — com fortíssimo viés feminista. De que modo venceram o Estado Islâmico. Por que Trump entregou-os à Turquia, obrigando-os a um acordo com governo sírio\n\n\nNo texto de hoje, pretendo jogar luz sobre um dos maiores acontecimentos da atualidade e que, mesmo estando diariamente nos noticiários, é pouco falado e aprofundado mesmo no meio progressista e de esquerda.\n\n#Quem são os Curdos?\n\nO povo curdo é uma etnia que existe há milênios e está espalhado ao longo de quatro países: Turquia, Iraque, Síria e Irã. O seu sonho é a construção de um país próprio, o Curdistão, o que é brutalmente combatido por todos esses governos da região, negando o direito à sua própria língua e cultura.\n\nNo Iraque, de maioria árabe, a população curda foi vítima de uma tentativa de limpeza étnica liderada por Saddam Hussein, membro do Partido Baath¹, que chegou a utilizar armas químicas contra civis. Após a queda do governo, o Curdistão iraquiano recebeu uma relativa independência, sendo governado pela família Barzani, uma burguesia alinhada ao liberalismo, ao imperialismo ocidental e à Israel. Por outro lado, no Irã (de etnia persa), todas as organizações curdas são proibidas. O país vive uma ditadura religiosa e fundamentalista controlada pelo clero xiita², que reprime com violência as lutas por autonomia. Todos os anos, militantes curdos são condenados à pena de morte.\n\nNa Turquia é onde se encontra grande parte da comunidade curda, alinhada à partidos de esquerda. O Partido dos Trabalhadores do Curdistão (PKK) era uma organização stalinista que combatia, por meio de terrorismo e guerrilha, pela construção de um Curdistão socialista, até que Abdullah Öcalan, seu líder, foi preso em uma operação da CIA. Na prisão, teve acesso aos escritos de Murray Bookchin e se inspirando em suas ideias, desenvolveu o Confederalismo Democrático.\n\n#O Confederalismo Democrático\n\nMurray Bookchin foi um anarquista norte-americano que desenvolveu diversas ideias no campo socialista. Uma delas foi defendida em sua obra “Ecologia Social”, na qual afirmava a importância do ambientalismo para a esquerda; outra foi o “Municipalismo Libertário”, que significava a mudança da luta de classes do sindicato para os bairros³.\n\nÖcalan, tendo acesso a essas propostas, construiu sua própria: combinou os escritos de Bookchin com outros elementos, produzindo um programa político inovador conhecido como Confederalismo Democrático. Essa proposta incluía a organização de assembleias e conselhos populares, por democracia direta, que funcionariam de baixo para cima com delegações controladas pelas bases.\n\nTambém entendia que a busca pela conquista do Estado não seria positiva, pois promoveria um nacionalismo étnico e militarista, e defendeu que o povo curdo construísse organismos políticos independentes e alternativos com cotas de participação para as diversas etnias. Öcalan também viu no patriarcado um grande problema, e o feminismo passou a ter um local de destaque, colocando a mulher como protagonista da libertação social e coletiva.\n\nGradualmente, o PKK rejeitou a linha pró-soviética e aderiu ao novo modelo. Apesar de em 2012 terem apresentado uma oficina no Encontro Anarquista de Saint-Imier, Suíça, nunca se afirmaram anarquistas, por considerarem que sua ideologia possui diversas inspirações, incluindo o marxismo.\n\n#A Guerra Civil Síria e a Revolução\n\nEm 2011, manifestações explodiram no Norte da África e no Oriente Médio, e foram conhecidas como Primavera Árabe. Na Síria, o governo de Bashar Al Assad, do Partido Baath, reprimiu com extrema violência; a situação se radicalizou e o país mergulhou em uma guerra civil.\n\nO governo Assad é nacionalista e muçulmano xiita, e conta com apoio do Irã, da Rússia e da China. Acusado pelo uso de armas químicas, por bombardear civis e pela prisão indiscriminada de opositores. Uma das cenas mais chocantes foi um vídeo mostrando crianças vítimas de gases lançados pelos soldados.\n\nA oposição, os rebeldes sírios, são formados por uma diversidade de milícias armadas, em sua maioria fundamentalistas religiosas ligadas à Al-Qaeda e à Irmandade Muçulmana. O principal apoio vem da Turquia e da Arábia Saudita, que por serem países sunitas, querem enfraquecer os rivais religiosos; também recebem apoio de Estados Unidos, União Europeia e Israel. Onde as milícias rebeldes conquistaram o poder, perseguições religiosas e opressão às mulheres se tornaram lei. Há também suspeita de uso de armas químicas.\n\nDiante desta situação, a população curda do norte da Síria viu a oportunidade de se tornar independente. O Partido da União Democrática (PYD) assumiu o controle da região e, inspirando-se no PKK, iniciou um processo revolucionário, socialista, ecológico e feminista. A situação militar passou para os braços armados YPG e YPJ, o segundo sendo exclusivamente formado por mulheres. Tanto o Governo quanto os rebeldes rejeitaram a atitude e tentaram tomar o controle da região, mas foram expulsos.\n\nEntão o pior aconteceu. A Al-Qaeda do Iraque se rebelou contra a própria organização e fundou uma inteiramente nova: o Estado Islâmico (ou Daesh). Esse grupo, se aproveitando do caos na Síria e das armas deixadas pelos EUA no Iraque (após a invasão), assumiu o controle de metade de ambos os países, e declarou guerra ao mundo todo. O Daesh começou a realizar vídeos mostrando execuções de prisioneiros, promoveu atentados terroristas, escravizou e estuprou mulheres e crianças e se mostrou uma força quase impossível de ser parada.\n\nO novos extremistas decidiram que o primeiro alvo deveria ser a Revolução Curda, associada ao pecado. Cercaram a cidade de Kobane, e por um momento, o mundo inteiro olhou com apreensão. Mas o jogo virou: a brava resistência curda derrotou os terroristas fanáticos e começou a empurrar seus soldados de volta, expandindo a Revolução para mais e mais regiões. Milícias árabes e de outras etnias se juntaram aos curdos, dando origem às Forças Democráticas da Síria (FDS).\n\nOs Estados Unidos, vendo uma oportunidade para se apresentarem como heróis, decidiram oferecer armamento e apoio militar à FDS no combate ao Daesh. A mídia ocidental começou a falar da importância curda na guerra, mas esconderam o caráter socialista e revolucionário da sua sociedade, apresentando como algo nacionalista e até mesmo liberal. Entre 2017 e 2018, o Estado Islâmico foi completamente derrotado.\n\nToda essa guerra e violência levou milhões de sírios a fugirem para outros países, incluindo na Europa. A grande quantidade de imigrantes fortaleceu partidos racistas e xenófobos de extrema direita, como a Reunificação Nacional na França ou o Alternativa para a Alemanha.\n\n#A Estrada até aqui\n\nA Turquia vive sob um governo de direita liderado por Erdogan, um conservador religioso ligado à Irmandade Muçulmana. Diante do fortalecimento da Revolução Curda, que está na fronteira da Síria e da Turquia, ele decidiu endurecer. O governo turco começou a aumentar a repressão à população curda dentro do próprio país, e também a preparar o exército para atacar a região revolucionária na Síria.\n\nA Turquia é o segundo maior exército da OTAN – uma aliança militar liderada pelos EUA – e atendendo ao pedido de seu aliado, Donald Trump anunciou o corte no apoio aos revolucionários curdos. A saída dos Estados Unidos foi um sinal verde para Erdogan iniciar um ataque em massa contra a Revolução, contando com o apoio dos rebeldes fundamentalistas (que sempre foram apoiados pelo seu governo).\n\nDiante desta situação, a FDS iniciou uma aliança militar com Assad para resistirem aos inimigos em comum. O governo sírio pretende usar a ameaça militar turca para forçar o povo curdo a abandonar a Revolução e voltar a se submeter ao antigo regime; infelizmente, por hora, o curdistão sírio não vê outra opção diante do risco de genocídio.\n\nTudo indica que pode estar sendo construído um grande acordo internacional. A Turquia, vendo que não tem como seus rebeldes vencerem a Guerra Civil Síria, quer o fim da Revolução Curda. Assad quer a unidade nacional síria sob seu controle, incluindo o fim da autonomia curda. Os EUA, a Rússia, a União Europeia e todos os outros governos do mundo estão dispostos a abençoar esse acordo para evitarem novas imigrações.\n\n#É urgente que a esquerda não permita que a maior Revolução do século 21 caia no esquecimento. Ela é a prova de que Socialismo e Democracia podem conviver, fora das experiências autoritárias stalinistas e do reformismo socialdemocrata, conciliando anticapitalismo, ecologia e libertação nacional e da mulher.\n\n¹ Baath significa “Socialismo Árabe”. Apesar do nome, se refere à uma ideologia nacionalista, pan-arabista, que busca unificar os povos árabes em torno de uma luta anti-imperialista regional. Ou seja, está distante de representar o que nós entendemos como socialismo (anticapitalismo e socialização dos meios de produção).\n\n² O Islã é dividido em duas vertentes: xiismo e sunismo. Os sunitas são a imensa maioria em quase todos os países muçulmanos. Os xiitas são maioria apenas no Irã, mas tem presença em governos como na Síria e no Iraque. Ambos possuem fundamentalistas e moderados.\n\n³ Bookchin acreditava que a luta por local de trabalho, ou seja, a luta sindical, estava ultrapassada e não servia mais aos nossos tempos. Atualmente, a melhor estratégia seria a organização popular por locais de moradia, como os bairros, promovendo assembleias populares na vizinhança.\n\n- Fonte: https://outraspalavras.net/outrasmidias/rojava-revolucao-ameacada-no-oriente-medio/",
			"added": 1577809304
		},
		{
			"topic_id": 2,
			"title": "O peculiar totalitarismo do século XXI",
			"body": "#Resgate de Sheldon Wolin, o cientista político que descreveu a fusão entre Estado e corporações. Resultado: precariedade e insegurança constantes, para impor a tirania dos mercados; e violência, quando as multidões despertam…\n\nSheldon Wolin, o mais importante teórico contemporâneo no campo da ciência política nos Estados Unidos, morreu há pouco mais de quatro anos, aos 93. Em seus livros Democracia Incorporada: democracia administrada e o espectro do totalitarismo invertido1 e Política e visão2 – uma vasta pesquisa sobre o pensamento político ocidental que o seu ex-aluno, Cornel West, considera “magistral” –, Wolin expõe a realidade da democracia falida dos Estados Unidos, as causas por trás do declínio do império americano e a ascensão de uma nova e aterrorizante configuração política, formada pelo poder das corporações, que ele chama de “totalitarismo invertido”.\n\nWendy Brown, professora de ciência política na Universidade da Califórnia, em Berkeley, ex-aluna também de Wolin, disse-me num correio eletrônico: “resistindo aos monopólios do marxismo, na esquerda, e da teoria democrática, pelo liberalismo, Wolin desenvolveu uma análise distinta – distintamente americana – da atualidade política e das possibilidades da democracia radical. Ele foi especialmente presciente ao teorizar sobre o forte estatismo do que hoje chamamos de neoliberalismo; eis que revelou a existência de uma nova fusão do poder econômico com o poder político, a qual considerou que envenena a democracia em sua raiz.”\n\nWolin, ao longo de sua vida acadêmica, mapeou a involução da democracia e, em seu último livro, Democracia incorporada, detalhou a forma peculiar que o totalitarismo corporativo assumia nos Estados Unidos. “Não é possível apontar para qualquer instituição nacional que possa ser descrita com precisão como democrática” – escreveu ele nesse livro – “certamente não nas eleições altamente gerenciadas e saturadas de dinheiro, no Congresso infestado por lobistas, na presidência imperial, no sistema judicial e penal classista e, muito menos, na mídia.”\n\n O totalitarismo invertido é diferente das formas clássicas de totalitarismo. Ele não encontra a sua expressão em um demagogo ou líder carismático, mas no anonimato sem rosto do Estado corporativo. Esse totalitarismo invertido mantém uma fidelidade aparente à política eleitoral, à Constituição, às liberdades civis, à liberdade de imprensa, à independência do judiciário e à iconografia das tradições e da linguagem do patriotismo americano, mas aproveita em efetivo todos os mecanismos de poder existentes para tornar o cidadão impotente.\n\n“Ao contrário dos nazistas, que tornaram a vida incerta para os ricos e privilegiados, que proporcionaram programas sociais para a classe trabalhadora e os pobres, o totalitarismo invertido explora os pobres, reduzindo ou enfraquecendo os programas de saúde e os serviços sociais, regrando a educação para formar uma força de trabalho insegura, sempre ameaçada pela importação de trabalhadores de baixa remuneração” – escreveu Wolin. “O emprego em uma economia de alta tecnologia, volátil e globalizada, afigura-se normalmente tão precário quanto durante uma depressão à moda antiga. O resultado é que a cidadania, ou o que resta dela, é praticada sob um estado contínuo de preocupação. Hobbes tinha, pois, razão: quando os cidadãos se sentem inseguros e, ao mesmo tempo, se veem impulsionados por aspirações competitivas, eles passam a desejar a estabilidade política e não o envolvimento cívico, a proteção e não o envolvimento político.”\n\nO totalitarismo invertido, disse Wolin (…) numa entrevista, constantemente “projeta o poder para cima.” É, pois, “a antítese do poder constitucional”. É construído para criar instabilidade, para manter passiva e em desequilíbrio a cidadania.\n\nEle também escreveu: “A redução e a reorganização das empresas, o estouro de bolhas, os sindicatos desestruturados, as habilidades que rapidamente são ultrapassadas, a transferência de empregos para o exterior, tudo isso cria não apenas medo, mas uma economia de medo, um sistema de controle cujo poder se alimenta da incerteza. Porém, segundo os seus defensores, trata-se de um sistema eminentemente racional.”\n\nO totalitarismo invertido “alimenta, sim, a política o tempo todo”, disse Wolin, “mas uma política que não é política”. Os ciclos eleitorais intermináveis e extravagantes, disse ele, são um exemplo de política sem política.\n\n“Em vez de participar do poder”, escreve ele, “o cidadão virtual é convidado a ter “opiniões”, isto é, a fornecer respostas mensuráveis a perguntas premeditadas que suscitam respostas determinadas”.\n\nAs campanhas políticas raramente discutem questões substantivas. Centram-se em personalidades políticas manufaturadas, em retórica vazia, em relações públicas sofisticadas, em anúncios artificiais, em propaganda, no uso constante de grupos de teste, de pesquisas de opinião que visam laçar os eleitores e dizer o que eles querem ouvir. O dinheiro substituiu efetivamente a votação. Cada candidato presidencial atual – incluindo Bernie Sanders – sabe bem, para usar as palavras de Wolin, que “o tema “império” é tabu nos debates eleitorais.” O cidadão é irrelevante. Ele ou ela não é nada mais do que um espectador, autorizados a votar, mas, esquecido tão logo o carnaval eleitoral termina e as corporações e os seus lobistas voltam ao negócio de influir na legislação.\n\n“Se o principal objetivo das eleições é fornecer legisladores flexíveis para que os lobistas os direcionem, tal prática merece ser chamada de “deturpada ou clientelística” – escreve Wolin. Trata-se de um poderoso sistema produtor de despolitização e de redução da cidadania. Com essa feição, ele apenas pode ser caracterizado como antidemocrático.”\n\nO resultado, escreve ele, é que “o uso do poder do Estado é negado ao cidadão comum”. Wolin deplora a banalização do discurso político, uma tática usada para confundir e fragmentar o público, deixando-o perplexo, para que o poder corporativo e o próprio império permaneçam incontestados.\n\n“As guerras culturais parecem indicar que estão em curso fortes batalhas políticas” – escreve ele. “Na verdade, não passam de distração. A atenção que recebem da mídia, assim como dos políticos ansiosos para firmar posição sobre questões não substantivas, serve apenas para distrair a atenção e para contribuir para uma política inconsequente.”\n\n“As facções agora no poder podem operar na suposição de que não precisam mais do chamado público no sentido amplo de um todo coerente – uma noção tradicional”, disse ele. “Agora, eles têm as ferramentas para lidar com as disparidades e as diferenças que eles mesmos ajudaram a criar. É um jogo em que conseguem minar a coesão necessária para que o público não possa ser politicamente eficaz. E, ao mesmo tempo, criam diferentes e distintas facções, as quais se põe inevitavelmente em tensão, ou em desacordo, ou mesmo em concorrência umas com as outras. Deste modo, o processo político parece mais uma briga do que uma forma de formar maiorias.”\n\nEm regimes totalitários clássicos, como os do fascismo nazista ou do comunismo soviético, a economia era subordinada à política. Mas no totalitarismo invertido, o inverso é verdadeiro – escreve Wolin. “A economia domina a política e com essa dominação surgem formas diferentes de crueldade.” E, assim, continua: “Os Estados Unidos tornaram-se a vitrine de como a democracia pode ser gerenciada sem parecer que foi suprimida.”\n\nO Estado corporativo, disse Wolin, é “legitimado pelas eleições que controla.” Para extinguir a democracia, reescreve e distorce as leis e a legislação que outrora protegiam a democracia. Os direitos básicos são, em essência, revogados por meio de decretos judiciais e legislativos. Os tribunais e os órgãos legislativos, a serviço do poder corporativo, reinterpretam as leis para despojá-los de seu significado original, a fim de fortalecer o controle corporativo e suprimir a supervisão sobre as corporações.\n\nEle escreve: “por que negar a Constituição, como os nazistas o fizeram, se é possível explorar simultaneamente a porosidade e o poder legítimo por meio de interpretações judiciais. Pois, protege-se agora as enormes contribuições das campanhas eleitoras por meio da “Primeira Emenda”; trata-se os lobbies fortemente financiados e organizados pelas grandes corporações como simples aplicação do direito do povo de peticionar ao seu governo!”\n\nO sistema norte-americano de totalitarismo invertido evitará medidas duras e violentas de controle “enquanto… a dissidência permanece ineficaz” – disse ele. “O governo não precisa acabar com a dissidência. A uniformidade da opinião pública imposta através da mídia corporativa faz um trabalho muito eficaz.”\n\nAs elites, especialmente a classe intelectual, foram compradas. “Por meio de uma combinação de contratos governamentais, fundos corporativos e fundações, projetos conjuntos envolvendo pesquisadores universitários e corporativos, doações de indivíduos muito ricos, universidades (especialmente as chamadas universidades de pesquisa), os intelectuais, os estudiosos e os pesquisadores foram perfeitamente integrados ao sistema” – escreve Wolin. “Nenhum livro é queimado, nenhum Einstein permanece na condição de refugiado”.\n\nMas – adverte – se a população – constantemente despojada de seus direitos mais básicos, incluindo o direito à privacidade, cada vez mais empobrecida e desprovida de esperança – tornar-se inquieta, o totalitarismo invertido se tornará tão brutal e violento quanto os Estados totalitários do passado. “A guerra contra o terrorismo, com sua ênfase na segurança interna, presume que o poder do Estado, agora inflado pelas doutrinas de guerra preventiva e liberado das obrigações constitucionais e das restrições judiciais, pode se voltar para dentro” – escreve ele. “Confiante de que, em sua busca doméstica de terroristas, os poderes agora reclamados, tal como os poderes projetados no exterior, seriam medidos, não pelos padrões constitucionais comuns, mas pelo caráter sombrio e onipresente do terrorismo tal como foi oficialmente definido.”\n\nA violência policial indiscriminada em comunidades pobres de negros e de hispânicos é um exemplo da capacidade do Estado corporativo “legalmente” assediar e matar cidadãos de modo impune. As formas mais cruas de controle – da polícia militarizada e da vigilância por atacado, bem como a polícia funcionando como juiz, júri e carrasco – é agora uma realidade para a classe baixa e vai se tornando uma realidade para todos. É preciso começar a resistir à canalização continuada de poder e de riqueza para os de cima. Somos tolerados como cidadãos, adverte Wolin, apenas enquanto participamos da ilusão de que vivemos numa democracia participativa. No momento em que nos rebelamos e nos recusamos a participar dessa ilusão, o rosto do totalitarismo invertido parecerá o rosto dos sistemas totalitários do passado.\n\n“O significado da enorme população carcerária afro-americana é político” – escreve. “O que é mais notável sobre essa população é que, em geral, ela é altamente sofisticada politicamente. De longe, é o único grupo social que, ao longo do século XX, manteve vivo um espírito de resistência e de rebeldia. Nesse contexto, a justiça criminal é tanto estratégia de neutralização política quanto um canal de racismo instintivo.”\n\nEm seus escritos, Wolin expressa consternação pelo fato de que toda uma população foi excluída do mundo das ideias e das publicações sutis. Ele vê o cinema, assim como a televisão, como “tirânicos”. Eis que têm a capacidade de “bloquear, eliminar muito do que pode introduzir qualificação, ambiguidade ou diálogo”. Ele protesta contra o que chama de “mídia monocromática”, formada por especialistas aprovados pelas empresas e usados para identificar “os problemas e os seus parâmetros, criando, assim, uma parede contra a qual os dissidentes lutam em vão. O crítico que insiste em mudar o contexto é descartado como irrelevante, extremista, como de “esquerda” – sendo, assim, ignorado completamente.”\n\nA disseminação constante de ilusões permite que mito em vez de realidade domine as decisões das elites poderosas. E quando o mito domina, os desastres caem sobre o império, tal como ocorreu nos quatorze anos de guerra fútil no Oriente Médio. A incapacidade dos Estados Unidos de reagir às mudanças climáticas ilustram isso. Eis o que Wolin escreve:\n\n- Quando o mito começa a governar os tomadores de decisão em um mundo onde a ambiguidade e os fatos teimosos abundam, o resultado é uma desconexão entre os atores e a realidade. Estão convencidos de que as forças das trevas possuem armas de destruição em massa e capacidades nucleares, que a sua própria nação é privilegiada, que um deus inspirou os “pais fundadores” e que eles escreveram a Constituição da nação; e que, ademais, inexiste uma estrutura de classe de grandes e teimosas desigualdades. Uns poucos, sombrios, mas aparentemente alegres, veem sempre presságios de que o seu mundo que está vivendo “os seus últimos dias.”\n\n Wolin atuou, no passado, como piloto e navegador de avião bombardeiro pesado, o B-24, no Pacífico Sul, na II Guerra Mundial. Ele participou de 51 missões de combate. Os aviões em que viajou tinham tripulações de até 10 soldados. De Guadalcanal, ele avançou com as forças norte-americanas que capturaram ilhas no Pacífico. Durante a campanha, o alto comando militar decidiu dirigir os bombardeiros B-24, os quais eram enormes e difíceis de voar, além de ter pouca manobrabilidade, contra os navios japoneses, uma tática que produziu enormes perdas de aviões e de vidas americanas. O uso do B-24, apelidado de “caixão voador”, para atacar navios de guerra munidos com armas antiaéreas, mostrou para Wolin a insensibilidade dos comandantes militares. Eles, alegremente, sacrificaram as tripulações aéreas e as máquinas de guerra em missões que tinham pouca chance de sucesso.\n\n“Foi terrível” – disse ele a respeito das ordens para bombardear os navios japoneses. “Tivemos perdas terríveis, porque essas aeronaves eram grandes e pesadas e, particularmente, porque tinham de voar baixo para tentar atingir a marinha japonesa – nós perdemos inúmeras pessoas assim, inúmeras.”\n\n“Tivemos também algumas vítimas psicológicas… homens, meninos, que simplesmente não aguentavam mais” – disse ele – “simplesmente não suportavam a tensão de se levantar às 5 da manhã para continuar a entrar nesses aviões, tomar tiros e depois voltar para descansar por mais um dia.” Wolin percebeu que os militaristas e os corporativistas formavam uma coalizão profana para orquestrar a ascensão de um império americano global no pós-guerra, assim como para extinguir a democracia americana. Para ele, o totalitarismo invertido era “a verdadeira face da superpotência”. Aqueles que ganham com a guerra e os militaristas, advogando a doutrina da guerra total durante o período da Guerra Fria, sangraram o País de seus recursos. Trabalharam, também, em conjunto para desmantelar as instituições e as organizações populares, como sindicatos, para descapacitar politicamente e empobrecer os trabalhadores. Eles “normalizaram” a guerra. Wolin adverte que, como em todos os impérios, eles eventualmente serão “eviscerados por seu próprio expansionismo”. Nunca haverá um retorno à democracia, adverte, até que o poder descontrolado dos militaristas e corporativistas seja drasticamente reduzido. Um Estado guerreiro não pode ser um Estado democrático.\n\nWolin escreve:\n\n- A defesa nacional foi declarada inseparável de uma economia forte. A fixação na mobilização e no rearmamento inspirou o desaparecimento gradual da agenda política nacional voltada à regulação e controle das corporações. O defensor do mundo livre precisava do poder da globalização, expansão das corporações, não uma economia que promovesse a confiança. Além disso, uma vez que o inimigo era raivosamente anticapitalista, cada medida que fortalecia o capitalismo era um golpe contra o inimigo. Uma vez que as linhas de batalha entre o comunismo e a “sociedade livre” foram desenhadas, a economia tornou-se intocável para outros fins que não um capitalismo “forte”. Pensa-se, pois, numa fusão entre o capitalismo e a democracia. Porém, uma vez que a identidade e a segurança da democracia foram identificadas com sucesso na Guerra Fria e com os métodos para a empreender, o palco estava pronto para promover a intimidação da maioria no campo da política, à esquerda e à direita.\n\n O resultado é uma nação dedicada quase exclusivamente a travar a guerra.\n\n“Quando um governo constitucionalmente limitado utiliza armas de poder destrutivo horrendo, subsidia o seu desenvolvimento e se torna o maior traficante de armas do mundo” – escreve Wolin –, “a Constituição só pode ser usada para servir a esse poder, em vez de servir à consciência.”\n\nMas ele continua:\n\n- Como o cidadão patriótico apoia incansavelmente os militares, assim como o seu enorme orçamento dedicado à guerra, isto significa que os conservadores conseguiram persuadir o público de que tais gastos merecem um tratamento diferenciado. Assim, o elemento mais substancial do poder do Estado é removido do debate público. Da mesma forma, o cidadão norte-americano em seu status de cidadão imperial, sempre desdenhoso da burocracia, não hesita em obedecer às diretrizes emitidas pelo Departamento de Segurança Interna, o maior e mais intrusivo departamento governamental da história da nação. A identificação com o militarismo e o patriotismo, juntamente com as imagens do poder americano projetadas pela mídia, serve para fazer o cidadão individual se sentir mais forte, compensando assim os sentimentos de fraqueza que decorrem de uma economia baseada em excesso de trabalho, força de trabalho exausta e insegura. O totalitarismo invertido, que é antipolítico, requer crentes, patriotas e trabalhadores não sindicalizados.\n\nSheldon Wolin foi muitas vezes considerado como um pária entre os teóricos políticos contemporâneos. Pois eles se concentravam na análise quantitativa e no estudo do comportamento, evitando, assim, o exame amplo das teorias e das ideias políticas. Wolin insistiu que a filosofia, mesmo aquela escrita pelos gregos antigos, não era uma relíquia morta, mas uma ferramenta vital para examinar e desafiar os pressupostos e as ideologias dos sistemas contemporâneos de poder e de pensamento político. Trabalhar com a teoria política, argumentou, constituía-se “primeiro numa atividade cívica e, apenas em segundo lugar, acadêmica”. Eis que ela tem um papel “não apenas como disciplina histórica que lida com o exame crítico dos sistemas de ideias” – disse – mas também é uma força que “ajuda a moldar as políticas públicas e as diretrizes governamentais, contribuindo acima de tudo para a educação cívica e para alcançar os objetivos de uma sociedade mais democrática, mais igualitária e mais educada.” Em seu ensaio de 1969, Teoria política como vocação, defendeu esse imperativo, castigando os seus colegas acadêmicos que concentraram seu trabalho na coleta de dados, assim como em minúcias acadêmicas. Nesse ensaio, ele escreveu, com sua lucidez habitual e floreios literários, o seguinte:\n\n- Em um sentido fundamental, o mundo atual é um produto da deliberação como talvez nenhum mundo anteriormente; um produto de teorias sobre as estruturas humanas deliberadamente criadas, ao invés de historicamente articuladas. Porém, em outro sentido, a concretização das teorias no mundo resultou em um mundo impermeável às próprias teorias. As estruturas gigantes e perpassadas por rotinas desafiam as mudanças fundamentais e, ao mesmo tempo, apresentam uma legitimidade incontestável, pois os princípios racionais, científicos e tecnológicos em que se baseiam parecem perfeitamente de acordo com uma era comprometida com a ciência, o racionalismo e a tecnologia. Acima de tudo, afigura-se como um mundo que parece ter tornado a teoria épica supérflua. A teoria, como Hegel havia previsto, assume a forma de “explicação”. Na verdade, parece que chegou o tempo em que coruja de Minerva já voou.\n\nA obra-prima de Wolin, Política e visão, de 1960, tem como subtítulo “A continuidade e a inovação no pensamento político ocidental”, baseou-se num vasto estudo de teóricos políticos e de filósofos, incluindo Platão, Aristóteles, Agostinho, Immanuel Kant, John Locke, John Calvin, Martinho Lutero, Thomas Hobbes, Friedrich Nietzsche, Karl Marx, Max Weber, John Dewey e Hannah Arendt. O seu objetivo foi o de refletir, a partir deles, sobre a realidade política e cultural contemporânea. A sua tarefa, como afirmou no final do livro, era a de “nutrir a consciência cívica da sociedade” na “era da superpotência”. O imperativo de amplificar e de proteger as tradições democráticas das forças contemporâneas que tentam destruí-las permeou todo o seu trabalho, incluindo seus livros Hobbes e a tradição épica na teoria política3 e Tocqueville entre dois mundos: a realização de uma vida política e teórica4\n\n- 1 Tradução de Democracy Incorporated: Managed Democracy and the Specter of Inverted Totalitarianism.\n\n- 2 Tradução de Politics and Vision.\n\n- 3 Em inglês: Hobbes and the Epic Tradition of Political Theory.\n\n- 4 Em inglês: Tocqueville between two words: the making of a political and theoretical life.\n\nFonte: https://outraspalavras.net/mercadovsdemocracia/o-peculiar-totalitarismo-do-seculo-xxi/",
			"added": 1577810529
		},
		{
			"topic_id": 3,
			"title": "Marilena Chauí: o que é a “nova” ultradireita?",
			"body": "#Ela flerta com o fascismo, mas submete a nação aos poderes globais. É totalitária – mas não impõe a lógica do Estado, e sim a da Mercadoria, da Empresa, da Meritocracia, do Investidor. Contra tal distopia, a ideia de revolução social\n\nTornou-se corrente nas esquerdas o uso de termos fascismo e neofascismo para descrever criticamente nosso presente.\n\nEstamos acostumados a identificar o fascismo com a presença do líder de massas como autocrata. É verdade que, hoje, embora os governantes não se alcem à figura do autocrata, operam com um dos instrumentos característico do líder fascista, qual seja, a relação direta com “o povo”, sem mediações institucionais e mesmo contra elas. Também, hoje, se encontram presentes outros elementos próprios do fascismo: o discurso de ódio ao outro – racismo, homofobia, misoginia; o uso das tecnologias de informação que levam a níveis impensáveis as práticas de vigilância, controle e censura; e o cinismo ou a recusa da distinção entre verdade e mentira como forma canônica da arte de governar.\n\nNo entanto, não emprego esse termo por três motivos: (a) porque o fascismo tem um cunho militarista que, apesar das ameaças de Trump à Venezuela ou ao Irã,  as ações de Nathanayu sobre a faixa de Gaza, ou a exibição da valentia do homem armado pelo governo Bolsonaro e suas ligações com as milícias de extermínio, não podem ser identificados com a ideia fascista do povo armado; (b) porque o fascismo propõe um nacionalismo extremado, porém a globalização, ao enfraquecer a ideia do Estado-nação como enclave territorial do capital, retira do nacionalismo o lugar de centro mobilizador da política e da sociedade; (c) porque o fascismo pratica o imperialismo sob a forma do colonialismo, mas a economia neoliberal dispensa esse procedimento usando a estratégia de ocupação militar de um espaço delimitado por um tempo delimitado para devastação econômica desse território, que é abandonado depois de completada a espoliação. \n\nEm vez de fascismo, denomino o neoliberalismo com o termo totalitarismo, tomando como referência as análises da Escola de Frankfurt sobre os efeitos do surgimento da ideia de sociedade administrada.\n\nO movimento do capital transforma toda e qualquer realidade em objeto do e para o capital, convertendo tudo em mercadoria, instituindo um sistema universal de equivalências próprio de uma formação social baseada na troca pela mediação de uma mercadoria universal abstrata, o dinheiro.\n\nA isso corresponde o surgimento de uma prática, a da administração, que se sustenta sobre dois pilares: o de que toda dimensão da realidade social é equivalente a qualquer outra e por esse motivo é administrável de fato e de direito, e o de que os princípios administrativos são os mesmos em toda parte porque todas as manifestações sociais, sendo equivalentes, são regidas pelas mesmas regras. A administração é concebida e praticada segundo um conjunto de normas gerais desprovidas de conteúdo particular e que, por seu formalismo, são aplicáveis a todas as manifestações sociais. A prática administrada transforma uma instituição social numa organização.\n\nUma instituição social é uma prática social fundada no reconhecimento público de sua legitimidade e de suas atribuições, num princípio de diferenciação que lhe confere autonomia perante outras instituições sociais, sendo estruturada por ordenamentos, regras, normas e valores de reconhecimento e legitimidade internos. Sua ação se realiza numa temporalidade aberta ou histórica porque sua prática a transforma segundo as circunstâncias e suas relações com outras instituições.\n\nEm contrapartida, uma organização se define por sua instrumentalidade, fundada nos pressupostos administrativos da equivalência. Está referida ao conjunto de meios particulares para obtenção de um objetivo particular, ou seja, não está referida a ações articuladas às ideias de reconhecimento externo e interno, de legitimidade interna e externa, mas a operações, isto é, estratégias balizadas pelas ideias de eficácia e de sucesso no emprego de determinados meios para alcançar o objetivo particular que a define. É regida pelas ideias de gestão, planejamento, previsão, controle e êxito, por isso sua temporalidade é efêmera e não constitui uma história.\n\n#Por que designar o neoliberalismo como o novo totalitarismo?\n\nTotalitarismo: por que em seu núcleo encontra-se o princípio fundamental da formação social totalitária, qual seja, a recusa da especificidade das diferentes instituições sociais e políticas que são consideradas homogêneas e indiferenciadas porque são concebidas como organizações. O totalitarismo é a afirmação da imagem de uma sociedade homogênea e, portanto, a recusa da heterogeneidade social, da existência de classes sociais, da pluralidade de modos de vida, de comportamentos, de crenças e opiniões, costumes, gostos e valores.\n\nNovo: por que, em lugar da forma do Estado absorver a sociedade, como acontecia nas formas totalitárias anteriores, vemos ocorrer o contrário, isto é, a forma da sociedade absorve o Estado. Nos totalitarismos anteriores, o Estado era o espelho e o modelo da sociedade, isto é, instituíam a estatização da sociedade; o totalitarismo neoliberal faz o inverso: a sociedade se torna o espelho para o Estado, definindo todas as esferas sociais e políticas não apenas como organizações, mas, tendo como referência central o mercado, como um tipo determinado de organização: a empresa – a escola é uma empresa, o hospital é uma empresa, o centro cultural é uma empresa, uma igreja é uma empresa e, evidentemente, o Estado é uma empresa.\n\nDeixando de ser considerada uma instituição pública regida pelos princípios e valores republicano-democráticos, passa a ser considerado homogêneo ao mercado. Isto explica porque a política neoliberal se define pela eliminação de direitos econômicos, sociais e políticos garantidos pelo poder público, em proveito dos interesses privados, transformando-os em serviços definidos pela lógica do mercado, isto é, a privatização dos direitos, que aumenta todas as formas de desigualdade e exclusão.\n\nO neoliberalismo vai além: encobre o desemprego estrutural por meio da chamada uberização do trabalho e por isso define o indivíduo não como membro de uma classe social, mas como um empreendimento, uma empresa individual ou “capital humano”, ou como empresário de si mesmo, destinado à competição mortal em todas as organizações, dominado pelo princípio universal da concorrência disfarçada sob o nome de meritocracia.\n\nO salário não é visto como tal e sim como renda individual e a educação é considerada um investimento para que a criança e o jovem aprendam a desempenhar comportamentos competitivos. O indivíduo é treinado para ser um investimento bem sucedido e para interiorizar a culpa quando não vencer a competição, desencadeando ódios, ressentimentos e violências de todo tipo, destroçando a percepção de si como membro ou parte de uma classe social e de uma comunidade, destruindo formas de solidariedade e desencadeando práticas de extermínio.\n\n#Quais são as consequências do novo totalitarismo?\n\n– social e economicamente, ao introduzir o desemprego estrutural e a terceirização toyotista do trabalho, dá origem a uma nova classe trabalhadora denominada por alguns estudiosos com o nome de precariado para indicar um novo trabalhador sem emprego estável, sem contrato de trabalho, sem sindicalização, sem seguridade social, e que não é simplesmente o trabalhador pobre, pois  sua identidade social não é dada pelo trabalho nem pela ocupação, e que, por não ser cidadão pleno, tem a mente alimentada e motivada pelo medo, pela perda da autoestima e da dignidade, pela insegurança;\n\n– politicamente põe fim às duas formas democráticas existentes no modo de produção capitalista: (a) põe fim à social-democracia, com a privatização dos direitos sociais, o aumento da desigualdade e da exclusão; (b) põe fim à democracia liberal representativa, definindo a política como gestão e não mais como discussão e decisão públicas da vontade dos representados por seus representantes eleitos; os gestores criam a imagem de que são os representantes do verdadeiro povo, da maioria silenciosa com a qual se relacionam ininterruptamente e diretamente por meio do twitter, de blogs e redes sociais – isto é, por meio do digital party –, operando sem mediação institucional,pondo em dúvida a validade dos parlamentos políticos e das instituições jurídicas, promovendo manifestações contra eles; (c) introduz a judicialização da política, pois, numa empresa e entre empresas, os conflitos são resolvidos pela via jurídica e não pela via política propriamente dita. Em outras palavras, sendo o Estado uma empresa, os conflitos não são tratados  como questão pública e sim como questão jurídica, no melhor dos casos, e como questão de polícia, no pior dos casos; (d) os gestores operam como gangsters mafiosos que institucionalizam a corrupção, alimentam o clientelismo e forçam lealdades. Como o fazem? Por meio do medo. A gestão mafiosa opera por ameaça e oferece “proteção” aos ameaçados em troca de lealdades para manter todos em dependência mútua. Como os chefes mafiosos, os governantes também têm os consiglieri, conselheiros, isto é, supostos intelectuais que orientam ideologicamente as decisões e os discursos dos governantes, estimulando o ódio ao outro, ao diferente, aos socialmente vulneráveis (imigrantes, migrantes, refugiados, lgbtq+, sofredores mentais, negros, pobres, mulheres, idosos) e esse estímulo ideológico torna-se justificativa para práticas de extermínio; (e)transformam todos os adversários políticos em corruptos, embora a corrupção mafiosa seja, praticamente, a única regra de governo; (f) têm controle total sobre o judiciário por meio de dossiês sobre problemas pessoais, familiares e profissionais de magistrados aos quais oferecem “proteção” em troca de lealdade completa (e quando o magistrado não aceita o trato, sabe-se o que lhe acontece);\n\n– ideologicamente, com a expressão “marxismo cultural”, os gestores perseguem todas as formas e expressões do pensamento crítico e inventam a divisão da sociedade entre o bom povo, que os apoia, e os diabólicos, que os contestam. Por orientação dos consiglieri, pretendem fazer uma limpeza ideológica, social e política e para isso desenvolvem uma teoria da conspiração comunista, que seria liderada por intelectuais e artistas de esquerda. Os conselheiros são autodidatas que se formaram lendo manuais e odeiam cientistas, intelectuais e artistas, aproveitando-se do ressentimento que a extrema direita tem por essas figuras. Como tais conselheiros estão desprovidos de conhecimentos científicos, filosóficos e artísticos, empregam a palavra “comunista” sem qualquer sentido preciso: comunista significa todo pensamento e toda ação que questionem o status quo e o senso comum (por exemplo: que a terra é plana; que não há evolução das espécies; que a defesa do meio ambiente é mentirosa; que a teoria da relatividade não tem fundamento, etc.). São esses conselheiros que oferecem aos governantes os argumentos racistas, homofóbicos, machistas, religiosos, etc., isto é, transformam medos, ressentimentos e ódios sociais silenciosos em discurso do poder e justificativa para práticas de censura e de extermínio;\n\n– a dimensão planetária da forma econômica neoliberal faz com que não exista um “fora” do capitalismo, uma alteridade possível, levando à ideia de “fim da história”, portanto à perda da ideia de transformação histórica e de um horizonte utópico. A crença na inexistência da alteridade é fortalecida pelas tecnologias de informação, que reduzem o espaço ao aqui, sem geografia e sem topologia (tudo se passa na tela plana como se fosse o mundo) e ao agora, sem passado e sem futuro, portanto sem história (tudo se reduz a um presente sem profundidade). Volátil e efêmera, nossa experiência desconhece qualquer sentido de continuidade e se esgota num presente vivido como instante fugaz;\n\n– a fugacidade do presente, a ausência de laços com o passado objetivo e de esperança em um futuro emancipado, suscitam o reaparecimento de um imaginário da transcendência. Assim, a figura do empresário de si mesmo é sustentada e reforçada pela chamada teologia da prosperidade, desenvolvida pelo neopentecostalismo. Mais do que isso. Os fundamentalismos religiosos e a busca da autoridade decisionista na política são os casos que melhor ilustram o mergulho na contingência bruta e a construção de um imaginário que não a enfrenta nem a compreende, mas simplesmente se esforça por contorná-la apelando para duas formas inseparáveis de transcendência: a divina (à qual apela o fundamentalismo religioso) e a do governante (à qual apela o elogio da autoridade forte).\n\nDiante dessa realidade, muitos afirmam que vivemos num mundo distópico, no qual as distopias são concebidas sob a forma da catástrofe planetária e do medo. Vale a pena, entretanto, mencionar brevemente a diferença entre utopia e distopia.\n\nA utopia é a busca de uma sociedade totalmente outra que negue todos os aspectos da sociedade existente. É a visão do presente sob o modo da angústia, da crise, da injustiça, do mal, da corrupção e da rapina, do pauperismo e da fome, da força dos privilégios e das carências, ou seja, o presente como violência nua. Por isso mesmo é radical, buscando a liberdade, a fraternidade, a igualdade, a justiça e a felicidade individual e coletiva graças à reconciliação entre homem e natureza, indivíduo e sociedade, sociedade e poder, cultura e humanidade. Uma utopia não é um programa de ação, mas um projeto de futuro que pode inspirar ações que assumem o risco da história, fundando-se na ação humana como potência para transformar a realidade, tornando-se imanentes à história, graças à ideia de revolução social.\n\nA distopia tem um significado crítico inegável ao descrever o presente como um mundo intolerável, porém corre o risco de transformá-lo em fantasma e rumar para o fatalismo, a imobilidade e  o desalento do fim da história. A utopia também parte da constatação de um mundo intolerável, mas em lugar de curvar-se a ele, trabalha para colocá-lo em tensão consigo mesmo para que dessa tensão surjam contradições que possam ser trabalhadas pela práxis humana. A imobilidade distópica decorre de sua estrutura fantasmática: nela, o intolerável não é o ponto de partida e sim o ponto de chegada. Ao contrário, a mobilidade utópica provém de sua energia como projeto e práxis, como trabalho do pensamento, da imaginação e da vontade para destruir o intolerável: o intolerável é seu ponto de partida e não o de chegada.\n\nSe a utopia é a visão do presente sob o modo da angústia, da crise, da injustiça, do mal, da corrupção e da rapina, do pauperismo e da fome, da força dos privilégios e das carências, do presente como violência intolerável, não podemos abrir mão da perspectiva utópica nas condições de nosso presente.\n\n- Fonte: https://outraspalavras.net/outrasmidias/marilena-chaui-o-que-e-a-nova-ultradireita/",
			"added": 1577810745
		},
		{
			"topic_id": 4,
			"title": "Pode Hannah Arendt explicar o bolsonarismo?",
			"body": "#Sim, mas não pela chave do “líder totalitário”. Filósofa descreveu como ninguém a ignorância esmagadora dos “indiferentes” – agora potencializada pelas redes sociais. Por isso, ela é essencial para compreender nosso drama\n\nTem sido comum o recurso ao pensamento de Hannah Arendt para compreender o fenômeno Bolsonaro e, de modo mais amplo, o sucesso de certo tipo de direita ao redor do mundo. O recurso é valioso e deve ser estimulado, mas enfrenta uma dificuldade específica, pois as brilhantes análises da autora levam a comparações fáceis demais com os anos 1930 e à tentação de denunciar como “totalitário” qualquer movimento autoritário. Este equívoco impede a observação precisa do que está acontecendo hoje e, diante deste risco, é necessário afirmar de saída: se tomarmos Arendt como referência, o movimento que levou Bolsonaro ao poder não é um movimento totalitário, e seu governo não parece ter muitas condições de se converter em um governo totalitário. Isto não quer dizer que está tudo bem, evidentemente, pois há indícios de que o atual governo pode se tornar especialmente autoritário ou mesmo desembocar em uma ditadura. O ponto é que falta ao bolsonarismo uma série de elementos que permitiriam caracteriza-lo como totalitário, a começar pela ausência de um líder apto e de uma ideologia totalizante, pretensamente capaz de explicar o curso da história humana desde o início dos tempos até a grande superação final.\n\nA fragilidade do líder, notada por alguns já à época da preparação da candidatura, é hoje patente. Sua autoridade é abertamente disputada por um vice mais preparado, por filhos ambiciosos, pela autoridade técnica do ministro da Economia, pela (suspeita) autoridade moral do ministro da Justiça e pela autoridade mística e intelectual de um guru. Esta disputa no governo expressa ainda a notável falta de unidade ideológica do bolsonarismo, pois é sustentado por ao menos quatro frações muito distintas entre si: liberais, militares, um baixo clero da política institucional e uma fração meio amalucada formada por seguidores do tal guru.\n\nO único elemento comum aos membros deste confuso balaio de gatos é a negação de tudo aquilo que o PT, justa ou injustamente, passou a simbolizar na cena pública: esquerda, sistema, corrupção, democracia, Estado, crise econômica, direitos humanos, comunismo globalista. Ou seja, mesmo a “solidariedade negativa” que cimenta o bolsonarismo é insustentavelmente heterogênea e, portanto, inteiramente incapaz de formar os conteúdos positivos de uma ideologia coesa — quanto menos totalizante! — capaz de conferir um rumo determinado ao movimento e ao governo.\n\nIsto não significa, evidentemente, que a análise dos acontecimentos dos anos 1930 contida em [As origens do totalitarismo](https://ipfs.io/ipfs/QmbDJonR6HW8sfcZrQcJzLmTk1FpWFgXESaR81bqkZtWk4) seja inútil para a compreensão do presente. O ponto é que o livro não oferece padrões de repetição política ou histórica, mas a identificação e a descrição de elementos que cristalizaram em dois governos totalitários, o de Hitler e o de Stálin. Alguns destes elementos sobreviveram ao fim destes dois governos e, se observados de perspectiva adequada, ganham sentido para nós porque ainda estão entre nós e provavelmente permanecerão aí por longo tempo. Faz-se necessário, portanto, identificar com clareza estes elementos e revelar-lhes o sentido.\n\nDentre os elementos decisivos para a compreensão do presente, parece-me importante destacar o papel conferido por Arendt aos indiferentes, ou seja, à enorme massa de pessoas para as quais a cena pública normalmente não desperta interesse. A figura do indiferente se refere a um tipo marcado por uma postura moral, da qual não tratarei aqui, e por uma postura política; ou melhor, uma postura não-política. Presente em todas as classes, o indiferente é aquele que, tendo passado a totalidade de sua existência fechado sobre si mesmo e sobre os seus, ocupando-se exclusivamente com a manutenção da própria vida, permaneceu sempre distante do mundo e do que é comum a todos, de modo que ele é completamente ignorante a respeito do funcionamento do espaço público e do tempo que o estrutura. Tendo garantida aquela liberdade de tipo negativa, que separa sua casa do restante do mundo, e tendo garantida a possibilidade de trabalhar para se manter e talvez prosperar, esta figura é indiferente a tudo o que se passa “lá longe, no mundo”.\n\nUma mudança nesta indiferença foi fundamental para os acontecimentos dos anos 1930, pois os movimentos nazista e comunista “recrutaram seus membros nesta massa de pessoas aparentemente indiferentes e que haviam sido abandonadas pelos demais partidos por serem demasiado apáticas ou estúpidas para merecer atenção. Resultou disto que a maioria dos membros era formada por pessoas que nunca antes haviam aparecido na cena política”, escreve Arendt em [As origens do totalitarismo](https://ipfs.io/ipfs/QmbDJonR6HW8sfcZrQcJzLmTk1FpWFgXESaR81bqkZtWk4). Ou seja, os indiferentes se tornaram um problema porque repentinamente “adquiriram apetite por organização política” e apareceram na cena pública, moveram-se de fora para dentro do espaço público.\n\nMas, ao contrário do que pode parecer à primeira vista, o problema não está na entrada destas pessoas em cena, e sim na reclusão, típica da modernidade, aos interesses e vícios privados, que até pode resultar em benefícios econômicos para o conjunto da sociedade, mas traz consigo também a formação deste enorme e indefinido contingente de pessoas que ignoram completamente o sentido da política e o funcionamento do espaço público. Ou seja, o problema está na formação contínua desta massa localizada bem ao lado da cena pública e composta por milhões de indivíduos que são, no sentido original do termo, perfeitamente idiotas – em grego, idios quer dizer “propriedade”, em oposição ao que é comum, donde idiōtēs, que é “proprietário” e, em oposição ao homem público, é “estranho aos ofícios”, portanto “não versado”, “ignorante”, “vulgar”.\n\nProjetando sobre o espaço público o funcionamento do espaço privado, os indiferentes gritam, aos montes, que os problemas da economia nacional se resolvem se todos acordarem mais cedo para trabalhar, que as questões sociais se sanam com castigos mais severos. Insensíveis ao tempo da política, acreditam que grandes mudanças exigem apenas o tempo de demonstração de suas verdades, creem no fim instantâneo da corrupção e nos efeitos imediatos de leis moralizantes. Sem a mínima noção do que é possível realizar dentro do espaço público, acreditam que um vereador pode acabar com a nudez das artes, que o jornalismo deve entregar bandidos e corruptos à polícia, que seus filhos se tornarão bons alunos porque o presidente prometeu educação rígida.\n\nTodo este apetite por grandes mudanças esbarra, evidentemente, na realidade do corpo político, que, para a surpresa dos neófitos, não cede imediatamente a estes empurrões. Diante da resiliência do real, os indiferentes, incapazes de distinguir o que veem, não sabem se os obstáculos vêm do status quo, de adversários ou da simples impossibilidade do que querem, e terminam por ver, em cada dificuldade, a ação de um abstrato “sistema” contra o qual é necessário “fazer alguma coisa”, do que resulta uma luta confusa contra símbolos de um sistema que não sabem exatamente o que é e nem onde está.\n\nArendt chama esta luta de ativismo, negando-lhe o conceito de “ação”, muito mais nobre em seu pensamento. Para a autora, a ação é uma atividade necessária porque os humanos são todos diferentes entre si e precisam estabelecer consensos em vários níveis, o que faz dela a atividade política por excelência. Mas, para que a ação efetivamente ocorra, é necessário haver um espaço em que as diferenças se tornem visíveis a quem o frequenta, um espaço capaz de receber a pluralidade de atos e palavras de agentes identificáveis; enfim, é necessário um espaço público. Os agentes, para agir de modo eficaz, devem considerar a pluralidade essencial do público, escolher o tempo certo e os meios adequados à ação, ou seja, a ação exige capacidade de se mover no espaço público, senso de oportunidade, percepção das diferenças, conhecimento dos meios, coragem e, sobretudo, disposição para sair do espaço privado em direção ao público. Ela exige, portanto, tudo aquilo que falta a quem passa a existência indiferente ao mundo.\n\nOs indiferentes de hoje são parecidos com os dos anos 1930, mas o surgimento das redes sociais alterou o espaço em que realizam seu ativismo. Antes, a expressão de um mal-estar causado em um indivíduo por uma notícia lida no jornal à mesa do café alcançava os membros da família ali presentes, chegava a alguns colegas de trabalho, talvez a alguns amigos, e só muito raramente cruzava a linha do espaço privado ganhando aparência pública. Isto porque, para ir ao público, seria necessário sair do círculo privado, formar alianças com pessoas incomodadas e dispostas a se mexer, identificar o lugar e o momento certo de cada passo, esperar os resultados, enfrentar as resistências. Ou seja, seria necessário agir, atividade que exige muito e nem sempre vale a pena. Com as redes sociais, no entanto, surgiu uma forma de ativismo que se dá pelo consumo e compartilhamento de imagens, que tem efeitos imediatos, não exige relação com as diferenças e, embora se dê de dentro da esfera privada, garante alguma aparência na cena pública. Sem ser exatamente público nem privado, o espaço das redes sociais permite que os indiferentes, sem perturbar sua liberdade negativa, exerçam forte pressão sobre a cena pública, sobre o espaço onde se faz a política.\n\nNos anos 1930, foi possível a alguns líderes convocar os novatos e formar aquelas massas cujas imagens nos impressionam ainda hoje. Atualmente, o marketing político, servindo-se de certas ferramentas capazes de individualizar a oferta de produtos a consumidores, aperfeiçoou suas técnicas, tornando-as capazes de controlar mais estritamente o que se vê ou deixa de ver nas redes, do que resulta um histérico ativismo fundado em imagens fabricadas para pequenos grupos e não naquilo que está no mundo e aparece para todos os que o frequentam. Hábeis marqueteiros, de dentro de seus escritórios, têm obtido grande sucesso em excitar e acalmar grandes quantidades de indivíduos atomizados que, sem sair do espaço privado, têm dado aparência a todos os seus incômodos e, evidentemente, formulado e exigido grandes mudanças para solucionar seus problemas. A esta altura dos fatos, a pressão exercida por esta forma de ativismo sobre o espaço público é visível na radicalização, nas polarizações, na frequência das afirmações delirantes, e a eficiente manipulação de mensagens de WhatsApp na reta final da campanha de Bolsonaro (assim como o caso Cambridge Analytica) exemplifica o uso eleitoral desta forma de recrutamento.\n\nDeste ponto de vista, a forma política de parte do bolsonarismo parece mais perigosa do que o conteúdo conservador que o anima (um conteúdo que, lembremos, não é exatamente uma novidade no Brasil), pois ela se caracteriza pela entrada na esfera pública de milhões de indiferentes excitados e convocados ao ativismo de redes sociais. Por ter como centro um indivíduo muito parecido com um indiferente, foi especialmente fácil fabricar, a partir da estupidez de Jair, uma imagem de “antissistema” e, assim, atrair os indiferentes. Mas é perfeitamente possível fabricar outras imagens (de esquerda, inclusive) capazes de exercer pressão perigosa sobre o espaço onde fazemos política. De um ponto de vista arendtiano, portanto, o bolsonarismo é uma nova cristalização de certos elementos antipolíticos do mundo moderno, pois tem, entre suas origens, a silenciosa massa de indiferentes e este recente ativismo digital que, ao que parece, também veio para ficar.\n\n- Fonte: https://outraspalavras.net/outrasmidias/bolsonaro-arendt-e-a-ignorancia-esmagadora-dos-indiferentes/",
			"added": 1577810990
		},
		{
			"topic_id": 5,
			"title": "O Socialismo Não Termina Sempre em Ditadura?",
			"body": "#O Socialismo é muitas vezes misturado com autoritarismo. Mas historicamente, Socialistas tem estado entre os defensores mais convictos da Democracia. \n\nUma geração de estadunidenses foi ensinada que a Guerra Fria foi disputada entre a “Liberdade” e a “Tirania”, com o resultado decisivamente vencido a favor do Capitalismo Democrático. O Socialismo, em todas as cores e formas, estava amarrado com os crimes da União Soviética e destinado à pilha de lixo das ideias ruins.\n\nAinda assim, muitos Socialistas foram oponentes consistentes do autoritarismo tanto nas variedades de Esquerda quanto de Direita. O próprio Marx entendia que apenas pelo poder de seus números democráticos os trabalhadores poderiam criar uma sociedade socialista. Para esse fim, O Manifesto Comunista termina com um chamado de clarim para os trabalhadores vencerem a batalha pela democracia contra as forças aristocráticas e reacionárias [1].\n\nLegiões de socialistas seguiram esse caminho, defendendo ardentemente direitos políticos e civis, enquanto também lutavam para democratizar o controle sobre a vida econômica e cultural através de direitos sociais expandidos e democracia no ambiente de trabalho. Apesar da afirmação comum de que “Capitalismo igual a Democracia”, os próprios Capitalistas, na ausência de pressões de uma classe trabalhadora organizada, nunca apoiaram reformas democráticas. Enquanto o sufrágio universal para homens brancos chegou nos Estados Unidos no período Jacksoniano [2], socialistas europeus tiveram de lutar até o final do século 19 contra regimes capitalistas autoritários na Alemanha, França, Itália, e outros lugares para alcançar o voto para a classe trabalhadora e para os homens pobres. Os socialistas ganharam apoio popular como os mais consistentes apoiadores do sufrágio universal masculino – e eventualmente, feminino – assim como o direito legal de formar sindicatos e outras associações voluntárias.\n\nSocialistas e seus aliados no movimento trabalhista também entenderam faz tempo que pessoas em um estado horrível de necessidade não podem ser pessoas livres. Assim, a tradição socialista é popularmente identificada fora dos Estados Unidos com a conquista da provisão pública de educação, saúde, creches e aposentadorias; e dentro dos Estados Unidos por apoiar muitas destas lutas.\n\nPara muitos socialistas, o suporte às reformas democráticas era incondicional; mas eles também acreditavam que o poder de classe necessário para restringir o poder do Capital precisava ser aprofundado para que os trabalhadores pudessem controlar completamente seus destinos sociais e econômicos. Enquanto criticam o Capitalismo como anti-democrático, socialistas democráticos tem se oposto consistentemente a governos autoritários que se clamam socialistas.\n\nRevolucionários como Rosa Luxemburgo e Victor Serge criticaram o governo soviético  desde o início por banir partidos de oposição, eliminar experimentos em democracia no ambiente de trabalho e falhar em abraçar o pluralismo político e as liberdades civis. Se o Estado possui os meios de produção, a questão permanece: quão democrático é o Estado? Como Luxemburgo escreveu em seu panfleto de 1918 [3] sobre a Revolução Russa:\n\n-  “Sem eleições gerais, sem liberdade de imprensa, liberdade de expressão, liberdade de associação, sem a livre batalha de opiniões, a vida em cada instituição pública definha, se torna uma caricatura de si mesma, e a burocracia se eleva como o único fator decisivo.”\n\nLuxemburgo entendeu que a Comuna de Paris de 1871 [4], o breve experimento em democracia radical ao qual Marx e Engels se referiram como um verdadeiro governo da classe trabalhadora, tinha múltiplos partidos políticos em seu conselho municipal, sendo que apenas um estava afiliado à Associação Internacional dos Trabalhadores, de Marx. Fiéis a estes valores, socialistas, dissidentes comunistas, e sindicalistas independentes lideraram as rebeliões democráticas contra a liderança comunista na Alemanha Oriental em 1953, Hungria em 1956, e Polônia em 1956, 1968 e 1980. Socialistas democráticos também lideraram o breve mas extraordinário experimento do “Socialismo com uma face humana” sob o governo Dubček na Tchecoslováquia em 1968. Todas estas rebeliões foram esmagadas por tanques soviéticos.\n\nA queda da União Soviética, porém, dificilmente significou que a democracia foi conquistada. Socialistas rejeitam a afirmação de que a democracia capitalista é completamente democrática [5]. De fato, os ricos tem abandonado seu compromisso até mesmo com uma democracia básica quando se sentem ameaçados por movimentos de trabalhadores.\n\nA análise de Marx no 18 de Brumário [6] do apoio dos capitalistas franceses para o golpe de Luis Napoleão contra a Segunda República Francesa antecipa de forma arrepiante o apoio posterior ao Fascismo nos anos 30. Em ambos os casos, uma pequena-burguesia declinante, uma classe-média sitiada, e elites agrárias tradicionais ganharam o suporte dos capitalistas para frustrar a crescente militância da classe trabalhadora para derrubar governos democráticos.\n\nOs regimes autoritários dos anos 70 e 80 na América Latina, da mesma forma, se basaram em apoio corporativo de natureza similar. Muito do prestígio da Esquerda europeia no pós-guerra e da esquerda Latinamericana atual  vem deles terem sido os mais consistentes oponentes do Fascismo.\n\nOs movimentos socialistas e anti-coloniais do Século 20 entendiam que os objetivos democráticos revolucionários de Igualdade, Liberdade e Fraternidade nunca seriam realizados se um poder econômico desigual pudesse ser transformado em poder político e se os trabalhadores fossem dominados pelo Capital. Socialistas lutam por democracia econômica por causa da crença radicalmente democrática de que “o que afeta a todos deveria ser decidido por todos.”\n\nO argumento capitalista de que a escolha individual no mercado equivale a Liberdade mascara a realidade de que o Capitalismo é um sistema anti-democrático em que a maioria das pessoas gasta a maior parte da vida sendo “mandada” por alguém. Corporações são formas de ditaduras hierárquicas, já que aqueles que trabalham nelas não tem voz em como eles produzem, no que eles produzem, e em como os lucros que eles criam são utilizados. Democratas radicais acreditam que autoridade obrigatória (não apenas a lei, mas também o poder de determinar a divisão do trabalho na empresa) só é válida se cada membro da instituição afetado por suas práticas tem uma voz igual na tomada daquelas decisões.\n\nDemocratizar uma economia complexa provavelmente tomaria uma variedade de formas institucionais, variando de propriedades dos trabalhadores e cooperativas, até propriedade estatal de instituições financeiras e monopólios naturais (tais como telecomunicações e energia) – assim como também regulações internacionais de padrões de trabalho e ambientais.\n\nA estrutura geral da Economia seria determinada através de políticas democráticas e não por burocratas estatais. Mas a questão permanece: como se mover para além da oligarquia capitalista rumo a democracia socialista? Pelo final dos anos 70, muitos socialistas democráticos reconheciam que a lucratividade corporativa tinha sido espremida pelas restrições que os movimentos trabalhistas, feministas, ambientalistas e antiracistas dos anos 60 haviam imposto sobre o Capital. Eles entendiam que os capitalistas iriam retaliar através de mobilização política, terceirizações e “greves de capital” [7]. Assim, por toda a Europa, socialistas pressionaram por reformas que pretendiam conquistar um controle público maior sobre os investimentos. O movimento trabalhista sueco abraçou o “Plano Meidner” [8], um programa que taxaria os lucros corporativos por um período de 25 anos para criar a propriedade pública das principais empresas. Uma coalizão socialista/comunista que elegeu François Mitterrand [9] para a presidência da França em 1981 nacionalizou 30% da indústria francesa e melhorou radicalmente os direitos de negociação coletiva.\n\nEm resposta, os Capitais franceses e suecos investiram no estrangeiro ao invés de em seus países, criando uma recessão que interrompeu estes promissores movimentos na direção do Socialismo democrático. As políticas de Thatcher e Reagan, que inauguraram mais de trinta anos de des-sindicalização e cortes para a rede de segurança, confirmaram a previsão da Esquerda de que ou os Socialistas avançariam para além do Estado de Bem-Estar Social para o controle democrático sobre o Capital ou o poder capitalista erodiria os ganhos da Social-Democracia do Pós-Guerra [10].\n\nHoje, socialistas por todo o mundo encaram o assustador desafio sobre como reconstruir o poder político da classe trabalhadora com força suficiente para derrotar o consenso tanto dos conservadores quanto dos Social-Democratas de “Terceira-Via” [11] em favor da austeridade ditada pelas corporações.\n\nMas e os muitos governos no mundo em desenvolvimento que ainda chamam a si mesmos de socialistas, particularmente os Estados-de-um-partido-só? De muitas maneiras, Estados comunistas de um-partido-só tem mais em comum com os antigos Estados autoritários capitalistas “Desenvolvimentistas” – como a Prússia (hoje parte da Alemanha) e o Japão no final do século 19, e a Coreia do Sul e Taiwan no pós-guerra – do que com a visão do Socialismo Democrático. Estes governos priorizaram a industrialização liderada pelo Estado acima dos direitos democráticos, particularmente aqueles de um movimento trabalhista independente.\n\nNem Marx nem o Socialismo europeu clássico anteciparam que partidos socialistas revolucionários tomariam o poder mais facilmente em sociedades autocráticas, predominantemente agrárias. Em parte, estes partidos se baseavam em uma nascente classe trabalhadora radicalizada pela exploração nas mãos de Capital Estrangeiro. Mas na China e na Russia, os comunistas também chegaram ao poder por que a aristocracia e os senhores da guerra falharam em defender seus povos contra invasão – os exércitos de camponeses derrotados queriam paz e terra. A tradição marxista não tinha muito a dizer sobre como sociedades predominantemente agrárias e pós-coloniais poderiam se desenvolver de uma maneira igualitária e democrática. O que a História nos conta é que tentar forçar camponeses que acabaram de receber terras privadas por revolucionários comunistas, de volta para fazendas estatais coletivas resulta em guerras civis brutais que retrocedem os desenvolvimentos econômicos por décadas.\n\nReformas econômicas contemporâneas na China, Vietnã e Cuba favorecem uma Economia de Mercado mista com um papel significante para o capital estrangeiro e camponeses proprietários de terras. Mas elites de um-partido-só instituindo estes experimentos em pluralismo econômico tem quase sempre reprimido defensores de pluralismo político, liberdades civis e direitos trabalhistas. Apesar do assédio estatal contínuo, as crescentes lutas trabalhistas independentes em locais como China e Vietnã [12] podem reviver o papel da classe trabalhadora na promoção da democracia. É naqueles movimentos, não em governos autocráticos, que os socialistas colocam a sua solidariedade.\n\nÉ claro, existe também uma rica história de experimentos em Socialismo Democrático no mundo em desenvolvimento, variando do governo da Unidade Popular de Salvador Allende no Chile nos anos 70 até os primeiros anos do governo de Michael Manley na Jamaica na mesma década. A “Onda Rosa” latinamericana na Bolivia, Venezuela, Equador e Brasil hoje representa diversos experimentos em desenvolvimento democrático – embora suas políticas de governo dependam mais da redistribuição de ganhos de exportação de produtos primários (também conhecidos como “commodities”) do que na reestruturação das relações de poder econômico. Mas o governo dos Estados Unidos e interesses capitalistas globais trabalham consistentemente para minar mesmo estes esforços modestos em democracia econômica.\n\nA CIA e a Inteligência Britânica derrubaram o governo democraticamente eleito de Mohammad Mosaddegh no Irã em 1954 quando ele nacionalizou a British Oil. O FMI e o Banco Mundial cortaram o crédito para o Chile e a CIA ajudou ativamente no brutal golpe militar de Augusto Pinochet naquele país. De forma parecida, os Estados Unidos conspiraram com o FMI para estrangular a economia jamaicana na Era Manley.\n\nA hostilidade capitalista com governos mesmo moderadamente reformistas no mundo em desenvolvimento não conhece limites. Os EUA derrubaram violentamente o governo de Jacobo Árbenz na Guatemala em 1954 e a presidência de Juan Bosch na República Dominicana em 1965 por que eles favoreceram modestas reformas agrárias. Para estudantes de História, a questão deveria ser não se o Socialismo necessariamente leva a ditadura, mas se um movimento socialista revivido pode superar a natureza oligárquica e anti-democrática do Capitalismo. \n\n#Notas: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1EEj7HkE59AB2rExqQgD5TXsipqHvbtnnP_0\n\n- Fonte: https://ominhocario.wordpress.com/2016/07/20/o-socialismo-nao-termina-sempre-em-ditadura/",
			"added": 1577812739
		},
		{
			"topic_id": 6,
			"title": "Para compreender o neoliberalismo além dos clichês",
			"body": "Imagine se a população da União Soviética nunca tivesse ouvido falar de comunismo. A ideologia que domina nossas vidas não tem nome, para a maioria das pessoas. Mencione-o numa conversa e você verá que seu interlocutor dá de ombros. Mesmo que tenha ouvido o termo antes, encontrará dificuldade para defini-lo. Neoliberalismo: você sabe o que é isso?\n\nO anonimato é tanto sintoma quanto causa de seu poder. Desempenhou um papel importante numa notável sequência de crises: o derretimento financeiro de 2007-8; o ocultamento de riqueza e poder de que os Panama Papers nos oferecem apenas um vislumbre; a lenta derrocada da saúde e da educação públicas; o ressurgimento da pobreza infantil; a epidemia de solidão; o colapso dos ecossistemas; a ascensão de Donald Trump. Mas respondemos a essas crises como se elas emergissem isoladas, aparentemente inconscientes de que foram todas ou catalisadas ou exacerbadas pela mesma filosofia coerente; uma filosofia que tem – ou tinha – um nome. Pode haver maior poder do que operar anonimamente?\n\nO neoliberalismo tornou-se tão penetrante que raramente o reconhecemos sequer como ideologia. Parecemos aceitar a proposição de que essa fé utópica e milenar descreve uma força neutra; uma espécie de lei biológica, como a teoria da evolução de Darwin. Mas essa filosofia surgiu como a tentativa consciente de remodelar a vida humana e mudar o locus do poder.\n\nO neoliberalismo vê a competição como característica definidora das relações humanas. Ela redefine os cidadãos como consumidores, cujas escolhas democráticas são melhor exercidas ao comprar e vender – um processo que supostamente recompensa o mérito e pune a ineficiência. Sustenta que o “mercado” assegura benefícios que jamais poderiam ser conseguidos pelo planejamento.\n\nTentativas de limitar a competição são tratadas como hostis à liberdade. A ideologia afirma que impostos e regulação deveriam ser reduzidos; serviços públicos, privatizados. A organização do trabalho e a negociação coletiva pelos sindicatos são retratadas como distorções do mercado, que impedem a formação de uma hierarquia natural entre vencedores e perdedores. A desigualdade é requalificada como virtuosa: um prêmio para a utilidade, ela é geradora de uma riqueza que se espalha de cima para baixo, enriquecendo todo mundo. Os esforços para criar uma sociedade mais igualitária seriam ao mesmo tempo contraproducentes e moralmente corrosivos. O mercado asseguraria que todo mundo recebe o que merece.\n\nInternalizamos e reproduzimos estas crenças. Os ricos se convencem de que adquiriram sua riqueza por mérito, ignorando as vantagens – tais como educação, herança e classe social – que podem ter ajudado a lhes garantir isso. Os pobres começam a se culpar por seus fracassos, mesmo quanto pouco podem fazer para mudar as circunstâncias de suas vidas.\n\nEsqueça o desemprego estrutural: se você não tem trabalho é porque não é empreendedor. Esqueça os custos impossíveis da moradia: se seu cartão de crédito está no limite, você é imprudente e imprevidente. Esqueça que seus filhos não têm mais uma quadra de esportes na escola: se ficam gordos, é falha sua. Num mundo governado pela competição, aqueles que ficam para trás passam a ser definidos e a se auto-definir como fracassados.\n\nEntre os resultados, como documenta Paul Verhaeghe no livro What About Me?, estão epidemia de automutilação, distúrbios alimentares, depressão, solidão, ansiedade por desempenho e fobia social. Não surpreende que o Reino Unido, onde a ideologia neoliberal vem sendo aplicada com maior rigor, seja a capital da solidão na Europa.\n\n#Agora somos todos neoliberais\n\nO termo neoliberalismo foi cunhado numa reunião de 1938, em Paris. Entre os participantes, havia dois homens que definiriam a ideologia, Ludwig von Mises e Friedrich Hayek. Ambos exilados da Áustria, eles consideraram a social democracia, caracterizada pelo New Deal de Franklin Roosevelt e o desenvolvimento gradual do Estado de bem-estar social da Grã Bretanha, como manifestações de um coletivismo que ocupava o mesmo espectro do nazismo e do comunismo.\n\nEm The Road to Serfdom (O Caminho da Servidão), publicado em 1944, Hayek argumentava que o planejamento governamental, ao esmagar o individualismo, levaria inexoravelmente ao controle totalitário. Como o livro Bureaucracy, de Mises, The Road to Serfdom foi amplamente lido. Chamou a atenção de algumas pessoas muito ricas, que viram na filosofia a oportunidade para libertar-se de impostos e regulação. Quando, em 1947, Hayek fundou a primeira organização que iria espalhar a doutrina do neoliberalismo – a Sociedade Monte Pelèrin –, ela foi sustentada financeiramente por milionários e suas fundações.\n\nCom tal apoio, ele começou a criar o que Daniel Stedman Jones descreve, em Masters of the Universe, como “uma espécie de Internacional Neoliberal”: uma rede global de acadêmicos, homens de negócios, jornalistas e ativistas. Apoiadores ricos do movimento fundaram uma série de thinktanks que iriam refinar e promover a ideologia. Entre elas estão o American Enterprise Institute, a Heritage Foundation, o Cato Institute, o Institute of Economic Affairs, o Centre for Policy Studies e o Adam Smith Institute. Também financiaram departamentos acadêmicos, particularmente nas universidades de Chicago e Virginia.\n\nConforme evoluiu, o neoliberalismo tornou-se mais estridente. A visão de Hayek de que os governos deveriam regular a competição para prevenir a formação de monopólios deu lugar – entre apóstolos norte-americanos tais como Milton Friedman – à crença de que o poder monopolista poderia ser visto como uma recompensa à eficiência.\n\nUma outra coisa aconteceu durante essa transição: o movimento perdeu o seu nome. Em 1951, Friedman se satisfazia com a descrição de si mesmo como neoliberal. Mas, logo depois disso, o termo começou a desaparecer. Ainda desconhecido, mesmo à medida em que a ideologia tornava-se mais nítida e o movimento mais coerente, o nome perdido não foi substituído por nenhuma alternativa.\n\nNo início, apesar de seu generoso financiamento, o neoliberalismo manteve-se nas margens. O consenso pós-guerra era quase universal: as prescrições econômicas de John Maynard Keynes foram amplamente aplicadas. Pleno emprego e combate à fome eram metas comuns nos EUA e na maior parte da Europa Ocidental. As aliquotas máximas do imposto eram altas e os governos buscavam resultados sociais elevados sem constrangimento, desenvolvendo novos serviços públicos e redes de segurança.\n\nNos anos 1970, contudo, quando as políticas keynesianas começaram a desmoronar e as crises econômicas atingiram EUA e Europa, as ideias neoliberais começaram a entrar no mainstream. Como Friedman ressaltou, “quando chega a hora, é preciso mudar … havia ali uma alternativa pronta para ser agarrada”. Com a ajuda de jornalistas simpáticos à ideia e conselheiros políticos, alguns elementos do neoliberalismo, principalmente suas prescrições de política monetária, foram adotadas pelos governos de Jimmy Carter, nos EUA, e Jim Callaghan, na Grã Bretanha.\n\nDepois que Margaret Thatcher e Ronald Reagan assumiram o poder, o resto do pacote veio a galope: cortes maciços nos impostos dos ricos, esmagamento dos sindicatos, desregulação, privatização, terceirização e competição nos serviços públicos. Por meio do FMI, do Banco Mundial, do Tratado de Maastricht e da Organização Mundial de Comércio, as políticas neoliberais foram impostas – frequentemente sem consenso democrático – em grande parte do mundo. O mais notável é que foram adotadas por partidos que no passado pertenceram à esquerda: Trabalhista, na Inglaterra, e Democrata, nos Estados Unidos, por exemplo. Como observa Stedman Jones, “é difícil pensar em outra utopia que tenha sido realizada tão completamente.”\n\nPode parecer estranho que uma doutrina que promete escolhas e liberdade possa ter sido promovida sob o slogan “não há alternativa”. Mas, como observou Hayek em uma visita ao Chile de Pinochet – uma das primeiras nações em que o programa foi exaustivamente aplicado – “minha preferência pessoal inclina-se na direção de uma ditadura liberal, ao invés de um governo democrático que não pratique o liberalismo”. A liberdade que o neoliberalismo oferece, que soa tão fascinante quando expressa em termos gerais, acaba por significar a liberdade para a elite, não para os peixes pequenos.\n\nLiberdade em relação aos sindicatos e à negociação coletiva significa liberdade para reprimir salários. Liberdade em relação da regulamentação significa liberdade de envenenar rios, colocar em risco os trabalhadores, cobrar taxas iníquas de juros e criar instrumentos financeiros exóticos. Ficar livre de impostos significa ficar livre da distribuição de riqueza que tira as pessoas da pobreza.\n\nComo Naomi Klein documenta em The Shock Doctrine (A Doutrina do Choque), teóricos neoliberais advogam o uso de crises para impor políticas impopulares enquanto as pessoas estavam distraídas: por exemplo, a consequência do golpe de Pinochet, da guerra do Iraque e do Furacão Katrina, que Frieman descreveu como “uma oportunidade para reformar radicalmente o sistema educacional” em New Orleans.\n\nOnde as políticas neoliberais não podem ser impostas domesticamente, elas são impostas internacionalmente, através de tratados comerciais que incorporam os “painéis de disputa estado-investidor”: tribunais globais em que as corporações podem pressionar pela revogação de leis e normas que protegem direitos sociais e ambientais. Quando parlamentares votaram para restringir as vendas de cigarro, proteger reservatórios de água das companhias de mineração, congelar contas de energia ou prevenir empresas farmacêuticas de esfolar o Estado, as empresas entraram com processos, muitas vezes bem sucedidos. A democracia reduz-se a um teatro.\n\nOutro paradoxo do neoliberalismo é que a competição universal apoia-se em comparação e quantificação universal. O resultado é que trabalhadores, desempregados e serviços públicos em geral ficam sujeitos a um sistema de avaliação e monitoramento sufocante e enganador, desenhado para identificar vencedores e punir perdedores. Ao invés de nos libertar do pesadelo burocrático do planejamento central, como propôs Von Mises, ele criou um.\n\nO neoliberalismo não foi concebido como um projeto egoísta, mas rapidamente transformou-se nisso. O crescimento econômico tornou-se visivelmente mais lento na era neoliberal (desde 1980 na Grã Bretanha e nos EUA) do que era nas décadas precedentes; mas não para os ultra ricos. A desigualdade na distribuição de renda e riqueza, depois de 60 anos de queda, aumentou rapidamente na nova era, devido à destruição dos sindicatos, à redução dos impostos, ao aumento dos aluguéis, à privatização e à desregulação.\n\nA privatização ou mercantilização de serviços públicos tais como energia, água, ferrovias, saúde, educação, estradas e prisões habilitou as grandes empresas a colocar uma cabina de pedágio diante de bens essenciais e cobrar rendas, seja dos cidadãos ou do governo, para seu próprio benefício. Renda é um eufemismo para dinheiro ganho sem esforço. Quando você paga um preço inflacionado pelo bilhete de metrô, somente parte da tarifa compensa os operadores por seus custos de combustível, salários e outros gastos. O resto reflete o fato de que você está nas mãos deles.\n\nAs pessoas que possuem e administram os serviços privatizados ou semi privatizados do Reino Unido fazem fortunas tremendas investindo pouco e cobrando muito. Na Rússia e na Índia, os oligarcas adquiriram bens estatais através de leilões. No México, Carlos Slim teve garantido o controle de quase todos os serviços de telefonia fixa e móvel e logo tornou-se o homem mais rico do mundo.\n\nA financeirização, como nota Andrew Sayer em Why We Can’t Afford the Rich, teve impacto semelhante. “Como a renda”, diz ele, “os juros são receita acumulada sem qualquer esforço”. À medida em que os pobres tornam-se mais pobres e os ricos mais ricos, o rico adquire controle crescente sobre outro bem crucial: dinheiro. Pagamentos de juros são, de modo devastador, transferência de dinheiro do pobre para o rico. Os preços dos imóveis e a redução de investimentos estatais sobrecarregam as pessoas com dívidas; mas os bancos e os executivos nadam de braçadas.\n\nSayer argumenta que as últimas quatro décadas caracterizaram-se por uma transferência de riqueza não apenas do pobre para o rico, mas no interior das categorias de riqueza: daqueles que ganham dinheiro produzindo novos bens ou serviços para aqueles que ganham dinheiro assumindo o controle de ativos já existentes e recolhendo rendas, juros ou ganhos de capital. O ganho produtivo foi superado pelo ganho improdutivo.\n\nAs políticas neoliberais estão assoladas por falhas do mercado em todos os lugares. Não apenas os bancos, mas também as corporações encarregadas de entregar os serviços públicos são grandes demais para falir. Como Tony Judt apontou em Ill Fares the Land, Hayek esqueceu-se de que os serviços públicos vitais não podem entrar em colapso, o que significa que a competição não pode determinar seu curso. As empresas levam os lucros, o Estado fica com o risco.\n\nQuanto maior seu fracasso, mais extremada se torna a ideologia. Os governos usam as crises neoliberais tanto como desculpa quanto como oportunidade para baixar impostos, privatizar os serviços públicos restantes, abrir brechas na rede de proteção social, desregular as corporações e re-regular os cidadãos. O Estado que se odeia afunda os dentes em cada órgão do setor público.\n\nTalvez o impacto mais perigoso do neoliberalismo não seja a crise econômica, mas a crise política que causou. Conforme se reduz o domínio do Estado, reduz-se também a possibilidade de mudar o curso de nossas vidas por meio do voto. Ao contrário, assegura a teoria neoliberal, as pessoas podem exercer a escolha pelo consumo. Mas alguns têm mais do que outros para gastar: na grande democracia do consumidor ou do acionista, os votos não são igualmente distribuídos. O resultado é um desempoderamento dos pobres e das classes médiass. Conforme os partidos de direita e a ex-esquerda adotam políticas neoliberais semelhantes, o desempoderamento transforma-se em privação dos direitos civis. Um grande número de pessoas foi varrido da política.\n\nChris Hedges observa que “movimentos fascistas constroem suas bases não entre as pessoas politicamente ativas, mas entre as politicamente inativas, os ‘perdedores’ que sentem, frequentemente de modo correto, que não têm voz ou papel a desempenhar no establishment politico”. Quando o debate político não faz mais sentido para nós, as pessoas tornam-se suscetíveis a slogans, símbolos e sensações. Para os admiradores de Trump, por exemplo, fatos e argumentos parecem irrelevantes.\n\nTony Judt explicou que quando a espessa rede de interações entre as pessoas e o Estado é reduzida a nada, a não ser autoridade e obediência, a única força remanescente a nos unir é o poder estatal. O totalitarismo temido por Hayek tem mais probabilidade de emergir quando os governos, tendo perdido a autoridade moral que emana da garantia de serviços públicos, são reduzidos a “persuadir, ameaçar e em última análise coagir as pessoas a obedecê-los.”\n\nComo o comunismo, o neoliberalismo é o Deus que falhou. Mas esta doutrina zumbi continua sua escalada, e uma das razões para isso é o anonimato. Ou antes, um conjunto de anonimatos.\n\nA doutrina invisível da mão invisível é promovida por investidores invisíveis. Devagar, muito devagar, começamos a descobrir o nome de alguns deles. Descobrimos que o Institute of Economic Affairs , que argumentou fortemente na mídia contra a regulação da indústria do tabaco, foi secretamente fundado, em 1963, pela British American Tobacco. Descobrimos que Charles e David Koch, dois dos homens mais ricos do mundo, fundaram o instituto que criou o movimento Tea Party. Descobrimos que Charles Koch, ao instalar um de seus thinktanks, observou que “para evitar críticas indesejáveis, o modo como a organização é controlada e dirigida não deveria ser amplamente divulgada”.\n\nAs palavras usadas pelo neoliberalismo com frequência mais ocultam do que elucidam. “O mercado” soa como um sistema natural que pode nos pressionar por igual, como fazem a pressão atmosférica ou da gravidade. Mas está carregado de relações de poder. O que “o mercado quer” tende a significar o que as corporações e seus patrões querem. “Investimento”, como nota Sayer, significa duas coisas bem diferentes. Uma é o financiamento de atividades produtivas e socialmente úteis; a outra é a compra de bens existentes para deles extrair rendas, juros, dividendos e ganhos de capital. Ao usar a mesma palavra para atividades diferentes, “camuflam-se as fontes de riqueza”, levando-nos a confundir extração de riqueza com criação de riqueza.\n\nHá um século, os novos ricos eram desprezados por aqueles que tinham herdado seu dinheiro. Empreendedores buscavam aceitação social transformando-se em rentistas. Hoje, a relação foi invertida: os rentistas e herdeiros definem-se como empresários. Eles afirmam ter construído aq riqueza pela qual não trabalharam.\n\nEsse anonimato e essas confusões se misturam com o fato de o capitalismo moderno não ter nem nome nem lugar. O modelo de terceirizações assegura que os trabalhadores não saibam para quem trabalham. As companhias são registradas através de um sistema secreto de rede de offshores, tão complexo que nem mesmo a polícia pode descobrir seus proprietários e beneficiados. Os arranjos fiscais logram os governos. Ninguém entende os “produtos financeiros”.\n\nO anonimato do neoliberalismo é ferozmente salvaguardado. Aqueles que são influenciados por Hayek, Mises e Friedman tendem a rejeitar o termo, sustentando – com alguma justiça – que ele é hoje usado apenas pejorativamente. Mas não nos oferecem substitutos. Alguns descrevem-se como liberais ou ulta-liberais (libertarians) clássicos, mas essas descrições são ambas enganosas e curiosamente autodissipadoras, uma vez que sugerem não haver nada de novo em O Caminho da Servidão (The Road to Serfdom), Bureocracy ou o clássico trabalho de Friedman, Capitalismo e Liberdade (Capitalism and Freedom).\n\nPor tudo isso, há algo admirável sobre o projeto neoliberal, ao menos em seus estágios iniciais. Era uma filosofia distinta e inovadora, promovida por uma rede coerente de pensadores e ativistas com um claro plano de ação. Era paciente e persistente. O Caminho da Servidão (The Road to Serfdom) tornou-se o caminho para o poder.\n\nO triunfo do neoliberalismo reflete também o fracasso da esquerda. Quando a teoria do laissez-faire econômico levou à catástrofe em 1929, Keynes inventou uma extensa teoria econômica para substituí-la. Quando o gerenciamento da demanda keynesiana bateu no teto, nos anos 70, havia, pronta, uma alternativa conservadora. Mas quando o neoliberalismo desmoronou, em 2008, não havia nada. É por isso que o zumbi anda. Em 80 anos, a esquerda e o centro não produziram um novo sistema geral de pensamento econômico.\n\nToda invocação de Lord Keynes é uma admissão de fracasso. Propor soluções keynesianas às crises do século 21 é ignorar três problemas óbvios. É difícil mobilizar as pessoas em torno de velhas ideias; as falhas expostas nos anos 1970 não desapareceram; e, mais importante, o projeto não tem nada a dizer sobre nosso problema mais grave: a crise ambiental. O keynesianismo funciona pelo estímulo da demanda de consumo para promover crescimento econômico. Demanda de consumo e crescimento econômico são os motores da destruição ambiental.\n\n- Fonte: https://outraspalavras.net/desigualdades-mundo/para-compreender-o-neoliberalismo-alem-dos-cliches/",
			"added": 1577814111
		},
		{
			"topic_id": 7,
			"title": "Passe o cartão para segregar",
			"body": "#Multinacionais investem alto no “dinheiro digital”. Mas “Visa para todos” gera vigilância e controle sobre nossas atividades e subordina economia local à lógica das cidades globais. Um monopólio de apartheid está se formando?\n\nO pagamento digital – também chamado de “e-money” ou “dinheiro móvel” – cresce em todo o mundo. Andar com dinheiro na carteira parece ter se transformado em algo antiquado. “É no débito ou no crédito?”, já nos perguntam antes mesmo de sacarmos a carteira. Algumas vezes, quando passamos alguma nota, o comerciante nos olha feio, preocupado se terá troco. Afinal, “passar no cartão” ou utilizar outros aplicativos de pagamento pelo celular, parece ser o método mais prático, moderno e seguro para pagar qualquer coisa.\n\nPor isso, corporações financeiras e tecnológicas transnacionais promovem grandes campanhas de “inclusão financeira”, o que, para o ativista Brett Scott, autor de O Guia Herege para as Finanças Globais: Hackeando o Futuro do Dinheiro (Pluto Press, sem tradução no Brasil), representa uma “cruzada contra o dinheiro vivo” – fortalecendo o poder dessas grandes empresas e ampliando a segregação social no mundo.\n\nExagero?\n\nEm texto publicado no site espanhol El Salto, Scott lembra que as transações em dinheiro são realizadas, na maioria das vezes, pelas classes mais baixas, principalmente em uma economia informal (ou clandestina). Um vendedor de peixe em uma vila de pescadores, um cabeleireiro em uma região degradada do centro ou mesmo pequeno traficante “passando” seu produto. São atividades que escapam do controle direto do Estado e das instituições financeiras – e que estão sendo “capturadas” e enquadradas no sistema internacional por meio de uma grande campanha de incentivo ao “pagamento digital”. É o que ele chama de “gentrificação do pagamento”, em alusão ao processo de transformação de centros urbanos em que uma comunidade de baixa renda “dá espaço” a moradores das camadas mais ricas.\n\nA mensagem é clara: nada pode escapar do domínio das gigantes financeiras e tecnológicas transnacionais, nem mesmo a cerveja ou o pastel que compramos com um ambulante ou os produtos que camponesas comercializam em uma remota vila africana ou asiática.\n\n#Pagar como?\nJá estamos enredados – e dependemos – dessas redes do mercado monetário. Então, por que seriam piores as operações digitais?\n\nScott, que já foi corretor da Bolsa de Valores, explica: a maioria das pessoas usam divisas nacionais, ou seja, dinheiro que só tem valor em uma área geográfica concreta. Em nosso caso, o real. Podemos utilizá-lo de duas formas: em dinheiro vivo (avalizado por instituições financeiras vinculadas ao Estado, como o Banco Central) e depósitos bancários digitais (ou seja, o dinheiro em bits que vemos em nossa conta bancária).\n\nO dinheiro que temos no banco é, legalmente, diferente do dinheiro vivo. São espécies de “notas privadas” que um banco emite com a promessa de nos dar, quando pedirmos, a divisa nacional (nossos reais, no caso). Ir sacar essa grana no caixa, por exemplo, é converter essas “notas privadas” de nossa conta no que foi prometido.\n\nO esquema básico das transações econômicas digitais – passar uma compra no cartão, por exemplo – conta com quatro etapas fundamentais: precisamos ter uma conta bancária, ter um modo de demonstrar que somos os legítimos proprietário da conta (identidade e cartão de débito ou crédito, por exemplo), ter um modo de mandar mensagens seguras ao centro de dados de nossa conta para iniciar a transação e, por último, o vendedor precisa de um modo de receber a confirmação do pagamento.\n\nSó que essa complexa mediação se dá de uma forma tão rápida, quase mágica, que nem percebemos. Portanto, enquanto o dinheiro vivo é um “instrumento ao portador” que não necessita de terceiros para intermediar uma compra, o dinheiro digital cria um registro de todas nossas atividades financeiras. Podemos achar que isso não seja relevante, porém surgem grandes implicações políticas: quanto mais pessoas forem incluídas nesse modelo, mais as corporações financeiras e tecnológicas terão acesso aos nossos dados – e poderão lucrar com eles.\n\n#Inclusão para inglês ver\nBrett Scott faz uma interessante comparação sobre os perigos dessa “inclusão financeira” proposta pelas corporações: há um debate, lembra ele, para incluir grupos marginalizados em Oxford e Cambridge, assim como é de consenso que a elite econômica e política inglesa estudou em ambas universidades. Então, o que seria melhor: tentar romper com o elitismo estrutural da sociedade inglesa ou concentrar esforços para que um grupo um pouco mais “diversificado” entrem nessas elites?\n\n“A inclusão financeira tem um problema parecido”, escreve ele. “Se reconhece, implicitamente, que a economia global se caracteriza pela desigualdade hierárquica, com um hierarquia geopolítica de nações e uma hierarquia na divisão de classe em cada um desses países. Acima, estão classes profissionais urbanas em cidades importantes como Nova Iorque, São Francisco, Londres, Tóquio e outras, sobretudo aquelas que estão nos círculos tecnológicos e financeiros. Em geral, não se discute se a economia digital dominante que presidem seja algo bom, e o objetivo não é acabar com as hierarquias fundamentais nela. Ao contrário, o objetivo da ‘inclusão’ é incorporar mais pessoas na rede digital, mas em uma posição de subordinação de quem aceita e utiliza passivamente a tecnologia desenvolvida nas principais cidades globais”.\n\nO controle digital\nO centro nevrálgico do argumento de Scott é que o pagamento digital exclui regiões e países não alinhados a essa imposição das metrópoles globais e favorece um novo e vasto horizonte de vigilância e controle financeiros, ao mesmo tempo que expõe os usuários a novos riscos que não existiam na infraestrutura do pagamento em dinheiro físico. O ativista inglês elenca alguns dessas ameaças:\n\n- 1-Os intermediários podem ver suas transações e recolher informações sobre suas atividades econômicas cotidianas.\n\n- 2-Os intermediários podem bloquear suas transações.\n\n- 3-Como você não possui fisicamente o dinheiro, as instituições podem expropriá-lo ou congelá-lo.\n\n- 4-Se a infraestrutura elétrica ou de telecomunicações falha, ou se os intermediários sofrem uma falha em seu hardware ou software, pode te afetar.\n\n- 5-A conexão digital é suscetível a ciberataques.\n\n- 6-Ainda que o discurso popular na indústria de tecnologias financeiras é que optamos “voluntariamente” pelo pagamento digital, parece não ser bem assim, se tornando quase uma imposição essa “opção”.\n\nAs corporações tecnológicas e financeiras, na avaliação de Scott, evitam uma reflexão crítica sobre as possibilidades negativas de uma extensão de pagamentos virtuais: “estamos apenas oferecendo uma opção a mais”, argumentam. No entanto, à medida que esse sistema cresce e se estabelece como uma forma nova de pagar as coisas, o suficiente para começar a asfixiar os sistemas antigos, começa a se constituir como um perigoso “monopólio”.\n\nJá estamos vendo esforços políticos para demonizar o dinheiro vivo com propaganda direta (às vezes até com o envolvimento do Estado) de grandes empresas do setor, coma a Visa, cujos interesses comerciais incluem livrar-se do dinheiro físico. Não é nenhuma teoria da conspiração: em comunicado à imprensa de 2016, a Visa manifestou abertamente que tinha uma “estratégia a longo prazo para diminuir o dinheiro em espécie para 2020”. Depois disso, a estratégia seria incentivar ainda mais o pagamento digital. A mesma Visa já tem um programa de recompensa para pequenos negócios como cafeterias – localizadas em certas áreas urbanas estratégicas – para que “deixem de usar dinheiro”. O próximo passo seria fechar caixas eletrônicos para dificultar ainda mais as transações em dinheiro vivo e agir junto com o Estado para introduzir, melhorar e ampliar uma infraestrutura para pagamentos digitais.\n\n“O que, na realidade, começa é um processo de expansão da rede digital financeira, que é fundamentalmente um processo de consolidação do poder coletivo do setor bancário, da indústria comercial que ele se assenta, e das empresas tecnológicas que oferecem aplicativos e conexões a esse sistema”, escreve Scott. “À medida que os sistemas de pagamento digital se normalizam e o dinheiro é demonizado, a história de inclusão digital se torna mais nítida. Se há um consenso geral entre os poderosos de que o digital representa o progresso, e se há uma evidência cada vez maior de que a dependência da econômica digital (a maioria organizada pelas mesmas instituições financeiras), então o risco de exclusão por não utilizá-la é maior que nunca, e prover acesso a ela parece mais nobre do que nunca”.\n\n- Fonte: https://outraspalavras.net/blog/passe-o-cartao-para-segregar/",
			"added": 1577836428
		},
		{
			"topic_id": 8,
			"title": "Assim arma-se a próxima crise financeira",
			"body": "Alguns dados deste texto são relativos aos Estados Unidos. Mas no período tratado – o pós-crise de 2008 –, o mundo todo transferiu dinheiro para o sistema bancário, para salvá-lo da falência. O total chega a 22 mil dólares por habitante do planeta. Imagine quanto esta soma poderia ter oferecido para as 2,5 bilhões de pessoas abaixo da linha de pobreza. E quanto teria gerado em vendas de produtos e serviços, que teriam sido criados. Em vez disso, todo o dinheiro foi para os bancos. Desde 2008, o salário médio de um executivo financeiro subiu 328%, contra 8% para os demais trabalhadores. Isso alimentou o ressentimento que impulsionou, junto como medo e a xenofobia, os partidos de extrema direita (muitos dos quais à época nem existiam), dando-lhes a projeção e os governos que têm hoje. (Roberto Savio)\n\nDurante a crise financeira de 2008, os bancos centrais do mundo injetaram trilhões de dólares de dinheiro fabricado no sistema financeiro global. Este dinheiro fabricado criou uma dívida mundial de US$ 325 trilhões, mais que três vezes o PIB do mundo. O dinheiro fabricado foi entesourado por bancos e corporações, emprestado pelos bancos a taxas de juros predatórias, usado para gerar juros sobre dívidas impagáveis ou gasto recomprando ações, o que garantiu milhões para as elites. O dinheiro fabricado não foi investido na economia real. Não houve produção ou venda de bens. Os trabalhadores não foram reconduzidos à classe média, com rendas sustentáveis, benefícios e aposentadorias. Não se lançaram projetos de infraestrutura. O dinheiro fabricado reinflou bolhas financeiras gigantescas, construídas sobre dívidas, num sistema financeiro fatalmente doente e fadado ao colapso.\n\nO que deflagrará o próximo crash? Os 13,2 trilhões de dólares de dívidas insustentáveis das famílias norte-americanas? O US$ 1,5 trilhão em dividas estudantis insustentáveis? Os bilhões que Wall Street investiu na extração de petróleo por fragmentação de rochas[1](https://en.wikipedia.org/wiki/Hydraulic_fracturing), que já consumiu US$ 280 bilhões a mais do que gerou? Quem sabe? O certo é que um crash financeiro global, que tornará pequena a crise de 2008, é inevitável. E desta vez, com as taxas de juros próximas de zero, as elites não têm plano de fuga. A estrutura financeira irá se desintegrar. A economia global mergulhará em espiral de abismo. A raiva de uma população traída e empobrecida vai, caso não surja uma alternativa, empoderar os demagogos de direita. Eles prometem vingança contra as elites globais, renovação moral e um ressurgimento do nativismo, a volta a uma “era de ouro” mítica em que imigrantes, mulheres e negros sabiam seu lugar e um fascismo cristianizado.\n\nA crise financeira de 2008, como aponta Nomi Prins, economista e colunista no Truthdig, “converteu os bancos centrais numa nova classe de intermediários muito poderosos”. Eles “saquearam os tesouros nacionais e acumularam trilhões em riqueza, para se tornar política e economicamente onipotentes. Em seu livro Collusion: How Central Bankers Rigged the World [“Conluio: como os Bancos Centrais fraudaram o mundo”], ela escreve que os dirigentes destes bancos e as maiores instituições financeiras do mundo manipulam de maneira fraudulenta os mercados globais e usam dinheiro fabricado – ou “falso”, em suas palavras – para inflar bolhas de ativos e obter lucros de curto prazo, enquanto nos conduzem a “um perigoso precipício financeiro”.\n\n“Antes da crise, eles estavam apenas dormindo no ponto, em especial o Federal Reserve (Fed), dos Estados Unidos, que é supostamente o principal regulador dos grandes bancos do país”, disse ela quando nos encontramos em Nova York. “O trabalho horrível do Fed é a causa da crise financeira. Ele tornou-se um desregulador, em vez de regulador. Na sequência da crise financeira, a solução para para salvar a economia de uma grande depressão ou recessão – seja qual for a terminologia usada em cada momento – foi fabricar trilhões e trilhões de dólares a partir de um éter eletrônico”.\n\nO Federal Reserve entregou cerca de US$ 29 trilhões, de seu dinheiro fabricado, para os bancos norte-americanos, segundo pesquisadores da Universidade de Missouri. Vinte e nove trilhões de dólares! Só nos EUA, isso teria garantido acesso gratuito à universidade, para todos os estudantes e assistência universal de saúde, reparado a infraestrutura degradada, promovido a transição para energias limpas, perdoado as dívidas dos estudantes, elevado salários, resgatados os proprietários de imóveis endividados, constituído bancos públicos para investir a taxas de juros reduzidas nas comunidades, oferecido uma renda básica garantida para todos e organizado um programa maciço de empregos para os desempregados e subempregados. Dezesseis milhões de crianças não iriam para a cama famintas. Os que sofrem distúrbios mentais e os sem-teto – 553.742 norte-americanos estão nesta condição – não seriam deixados nas ruas ou trancafiados em prisões. A economia reviveria. Em vez disso, US$ 29 trilhões em dinheiro fabricado foi entregue para gangsters financeiros que estão a ponto de fazer a maior parte desta soma evaporar e de nos mergulhar em uma depressão semelhante ao crash global de 1929.\n\nUma cláusula de emergência na Lei do Federal Reserve, de 1913, permite que o banco ofereça liquidez a um sistema bancário estressado. Mas o Federal Reserve não parou, após a criação de algumas centenas de bilhões de dólares. Ele inundou os mercados financeiros com níveis absurdos de dinheiro fabricado. O efeito foi criar aparência de que a economia estava revivendo. E para os oligarcas, que tinham acesso a este dinheiro fabricado, ao contrário de nós todos, ela estava mesmo.\n\nO Fed cortou as taxas de juros para próximo de zero. Alguns bancos centrais na Europa instituíram taxas de juros negativas, o que significava que pagariam aos interessados em tomar empréstimos. O Fed, num truque inteligente de contabilidade, permitiu até mesmo que os bancos em dificuldades usassem estes empréstimos sem juros para comprar títulos do Tesouro norte-americano. Os bancos devolviam os bônus ao Fed e recebiam 0,25% de juros do Fed. Em poucas palavras, os bancos tomavam empréstimos sem juro algum no Fed e na sequência recebiam juros do Fed sobre o dinheiro que haviam tomado emprestado… O Fed também comprou dívidas e ativos tóxicos dos bancos. Como as autoridades do Fed podiam fabricar tanto dinheiro quanto quisessem, não importava como gastavam.\n\n“É como ir a um bazar de garagem de alguém e dizer: ‘Quero aquela bicicleta sem rodas. Vou pagar 100 mil dólares por ela’. Sabe por que? Porque o dinheiro não é meu!’”, diz Prins.\n\n“Estas pessoas manipularam o sistema” ela prossegue, sobre os banqueiros. “Há dinheiro fabricado no topo da pirâmide. É usado para inflar ativos financeiros, inclusive ações. Tem de vir de algum lugar. Como o dinheiro tornou-se barato, há mais crédito, entre as corporações. Há mais dinheiro emprestado, entre os governos”.\n\n“A quem você recorre, para pagá-lo?”, ela pergunta. “Você recorre à nação. Você recorre à economia. Você extrai dinheiro da economia de base, dos programas sociais. Você impõe ‘austeridade’.”\n\nDado o espantoso volume de dinheiro fabricado que precisa ser pago, os bancos constituem represas de dívidas cada vez maiores. É por isso que, quando você atrasa o pagamento de seu cartão de crédito, a taxa de juros sobe para 28% [no Brasil, 300,1%, em junho]. É por isso que quando você declara falência pessoal [recurso não existente no Brasil, onde há 63,2 milhões de pessoas inadimplentes, ou 50% da população\neconomicamente ativa], você continua obrigado a pagar seu empréstimo estudantil. É por isso que os salários estão estagnados ou caíram, enquanto os custos, dos planos de saúde aos remédios, às tarifas bancárias e aos aparelhos essenciais estão disparando. A servidão provocada pelas dívidas cresce para alimentar o monstro, até que, como aconteceu na crise das hipotecas subprime, o sistema predatório desaba devido a calotes em massa. Como em todas as bolhas financeiras, chegará um dia em que, por exemplo, os lucros de setores como o fracking, projetados de maneira selvagemente otimista, não serão mais uma desculpa efetiva para continuar a injetar dinheiro em negócios falidos, liquidados por dívidas impagáveis.\n\n“As 60 maiores empresas de exploração e produção não geram dinheiro suficiente para cobrir suas operações e despesas de capital”, escreve Bethany McLean sobre o setor de fracking em um artigo intitulado “A próxima crise financeira esconde-se sob a terra”, que saiu no New York Times. No agregado, de meados de 2012 a meados de 2017, eles tiveram um fluxo negativo de caixa de US$ 9 bilhões por trimestre”.\n\nO sistema financeiro global é uma bomba-relógio em tiquetaque. A questão não é se ele explodirá, mas quando. E nesse momento, a incapacidade dos especuladores para usar o dinheiro fabricado para encobrir o debate vai desencadear desemprego maciço, altos preços para importações e serviços básicos e uma desvalorização monetária que tornará o dólar quase sem valor, ao ser abandonado como moeda de reserva global. Este tsunami financeiro manufaturado transformará os Estados Unidos, hoje uma democracia já falida, num Estado policial autoritário. A vida será muito barata, especialmente a dos vulneráveis – trabalhadores sem documentos, muçulmanos, pretos pobres, mulheres e meninas, ativistas anticapitalistas e anti-imperialistas rotulados como agentes de potências estrangeiras. Estes serão demonizados devido ao colapso e perseguidos. As elites, numa oferta desesperada para agarrar-se a seu poder sem controle e riqueza obscena, irá estripar o que resta dos Estados Unidos.\n\n- Fonte: https://outraspalavras.net/mercadovsdemocracia/assim-comecara-a-proxima-crise-financeira/",
			"added": 1577836552
		},
		{
			"topic_id": 9,
			"title": "A construção fisiológica do discurso autoritário",
			"body": "#Neurociências apontam: falas que provocam medo, tensão e estresse estimulam o cérebro a reagir primitivamente e bloqueiam o pensamento elaborado. A ultradireita aprendeu a manipular este mecanismo. É preciso desarmá-lo\n\nSerá a espiral de morte da democracia? Estaremos mergulhando, em todo o mundo, num ciclo letal de fúria e reativismo, que bloqueia a conversa fundamentada da qual depende a vida cidadã?\n\nOportunistas políticos que usam agressão, mentiras e indignação para abafar os argumentos existiram em todos os tempos. Mas, ao menos desde a década de 1930, nunca tantos deles foram bem sucedidos ao mesmo tempo.\n\nDonald Trump, Bois Johnson, Narendra Modi, Jair Bolsonaro, Rodrigo Duterte, Nicolás Maduro, Viktor Orbán e muitos outros descobriram que a era digital oferece farto leque de escolhas. A raiva e os desentendimentos que as redes sociais geram, exacerbados por fábricas de insultos, robôs e publicidade política secretamente financiada, vazam para a vida real.\n\nOs políticos e comentaristas usam agora uma linguagem de violência que era impensável poucos anos atrás. No Reino Unidos, o primeiro ministro Boris Johnson zomba da memória do deputado assassinado Jo Cox. Um dos líderes do Brexit, Nigel Farage, refere-se aos funcionários públicos prometendo que “quando o Brexit for concluído, vamos passá-los na faca“. Brendan O’Neill, editor do site Spiked, uma publicação que recebeu financiamento dos irmãos Koch, disse à BBC que deveria haver motins pela demora em concretizar o Brexit. Todos devem saber, particularmente em vista das ameaças e agressões sofridas pelas deputadas mulheres, que a linguagem violenta autoriza a violência. Mas essas declarações parecem lançadas exatamente para desencadear uma agressão irracional.\n\nOs eleitores irão agora acordar desse pesadelo, demitir aqueles que fabricaram as crises e restaurar a política pacífica e fundamentada da qual depende nossa segurança? Infelizmente, não parece tão fácil assim.\n\nRamos fascinantes da neurociência e da psicologia sugerem que, na vida pública, as ameaças e o estresse tendem a se autoperpetuar. Quanto mais ameaçados nos sentimos, mais nossas mentes são dominadas por reflexos involuntários e reações impensadas.\n\nO mais estranho desses efeitos é descrito num estudo dos neurocientistas Stephen Porges e Gregory Lewis. Eles mostram que, quando nos sentimos ameaçados, não conseguimos ouvir vozes calmas e coloquiais. Quando nos sentimos seguros, os músculos do ouvido médio se contraem, com um efeito similar a esticar o couro de um tambor. Isso silencia os sons do ambiente e nos permite sintonizar as frequências usadas na fala humana comum.\n\nMas quando nos sentimos ameaçados, são os ruídos ambientais profundos que precisamos ouvir. No tempo evolutivo, eram esses sons (rugidos, combustão, o estofo de patas ou o estrondo de cascos, trovões, um sinal de inundação num rio) que pressagiavam o perigo. Por isso, nesses casos, os músculos do ouvido médio relaxam, impedindo a escuta das frequências de conversação. No contexto político, quando as pessoas estão gritando conosco, as vozes moderadoras são fisicamente ignoradas. Todo mundo tem de gritar para ser ouvido, aumentando o nível de estresse e ameaça.\n\nQuando nos sentimos particularmente ameaçados ou irados, surge uma resposta de luta-ou-fuga, anulando a capacidade de raciocinar – fenômeno que alguns psicólogos chamam de sequestro da amígdala. A amígdala fica na base do cérebro e canaliza sinais emocionais fortes que podem neutralizar o córtex pré-frontal, impedindo-nos de tomar decisões racionais. Nós atacamos irracionalmente, dizendo coisas estúpidas que desencadeiam depois o sequestro de amígdala em outras pessoas. É mais ou menos assim que as redes sociais funcionam.\n\nTudo isso é exacerbado pelo modo frenético e cego com que buscamos um espaço de segurança quando nos sentimos inseguros. Segurança é o que os psicólogos chamam de um clássico “valor de falta”: aqueles que valorizamos quando sentimos que estão ausente; e que neutralizam outros valores. Isso possibilita às próprias pessoas que nos deixaram inseguros apresentarem-se como “homens fortes”, a quem podemos recorrer em busca de proteção contra o caos que eles mesmos criaram. Uma perturbadora pesquisa realizada pela Hansard Society em abril revelou, na Grã-Bretanha,atualmente 54% dos entrevistados concordam com a seguinte afirmação: “O país precisa de um governante forte e disposto a quebrar as regras”. Apenas 23% discordam.\n\nSuspeito que os demagogos – ou seus conselheiros – saibam o que estão fazendo. Instintiva ou explicitamente, eles compreendem que reagimos irracionalmente a ameaças, e sabem que para vencer precisam nos fazer parar de pensar. Por que Boris Johnson parece querer tanto um Brexit sem acordo? Talvez porque esta hipótese gere as respostas de ameaça e estresse de que depende seu sucesso. Se não quebramos essa espiral, ela pode nos arrastar para um lugar por certo muito sombrio. Mas o que podemos fazer? Como discutimos, em particular, situações de fato alarmantes, tais como a crise climática, sem disparar reações de ameaça?\n\nA primeira coisa que a ciência sugere é: trate todos com respeito. A coisa mais estúpida que você pode fazer, se quiser salvar a democracia, é chamar seu oponente de estúpido.\n\nNunca se deixe arrastar por uma batalha de gritos, por mais ofensiva que a outra pessoa possa ser. Não se distraia com as tentativas de induzir indignação: traga a conversa de volta às questões que você deseja discutir. Devemos nos espelhar na força calma de Greta Thunberg quando responde ao vendaval de ofensas que enfrenta: “Como você deve ter notado, os odiadores estão mais ativos que nunca. Vão atrás de mim, de minha aparência, minhas roupas, meu comportamento e minhas diferenças. (…) Mas não perca seu tempo dando-lhes nenhuma atenção.”\n\nDepois de estudar o sucesso ou fracasso de outros movimentos políticos, o Extinction Rebellion [Rebelião da Extinção, em tradução literal] desenvolveu um protocolo para ativismo que parece um modelo de boa psicologia política. Ele usa humor para desviar agressão; distribui folhetos explicando cada ação e se desculpando pelo transtorno; treina ativistas para resistir à provocação e realiza oficinas sobre desarmar confrontos, ensinando as pessoas a reduzir discussões agressivas em conversas fundamentadas. Pede “respeito ativo” a todos, inclusive à polícia.\n\nAo criar reuniões de pessoas, procura criar um espaço cidadão no qual outras vozes possam ser ouvidas. Como aponta outro artigo, de Stephen Porges, o neurocientista cujo trabalho fez tanto para explicar nossos reflexos, nossos cérebros não nos permitem sentir compaixão pelos outros até que nos sintamos seguros. Criar espaços serenos para explorar nossas diferenças é um passo essencial para a reconstrução da vida democrática.\n\nTudo isso pode soar como senso comum. Mas entender como nossas mentes funcionam ajuda a ver quando elas estão trabalhando inconscientemente para os demagogos. Romper a espiral significa restaurar o estado mental que nos permite pensar.\n\n- Fonte: https://outraspalavras.net/crise-civilizatoria/a-construcao-fisiologica-do-discurso-autoritario/",
			"added": 1577837056
		},
		{
			"topic_id": 10,
			"title": "O luxo arrasador dos super ricos",
			"body": "#Um voo, em seus jatos, consome o combustível de um ano, numa cidade africana. É preciso cortar seu poder. Um começo: limitar a renda e a riqueza individuais; e defender a frugalidade pessoal, combinada com vida coletiva abundante\n\nNão é exatamente verdade que por trás de cada grande fortuna há um grande crime. Músicos e romancistas, por exemplo, podem tornar-se extremamente ricos oferecendo prazer a outras pessoas. Mas parece ser uma verdade universal de que diante de toda grande fortuna está um grande crime. Riquezas imensas traduzem-se automaticamente em imensos impactos ao meio ambiente, independentemente das intenções daqueles que as possuem. Os muito ricos, quase por definição, estão cometendo ecocídio.\n\nAlgumas semanas atrás, recebi uma carta de um funcionário de um aeroporto privado, no Reino Unido. “Eu vejo coisas que realmente não deveriam estar acontecendo em 2019”, escreveu. Todo dia, observa aeronaves do modelo Global 7000 [para 10 a 19 passageiros], Gulfstream G650 [11 a 18 passageiros] e até Boeings 737 decolarem com apenas um passageiro, a maior parte a caminho dos EUA e da Rússia. Os Boeing 737 privados, construídos para levar 174 passageiros, são abastecidos no aeroporto com cerca de 25 mil litros de combustível. Essa é a mesma quantidade de energia fóssil que uma pequena cidade africana utiliza em um ano.\n\nAonde estão indo esses passageiros solitários? Talvez, visitar uma de suas supercasas, construídas e geridas a um enorme custo ambiental, ou a uma viagem em seus superiates, que podem queimar 500 litros de diesel por hora em velocidade de passeio, e são construídos e mobiliados com materiais raros, extraídos às custas de paisagens naturais.\n\nNão deveria nos surpreender o fato de que quando a Google articulou uma reunião dos ricos & famosos no resort de Verdura, na Sicília, em julho, para discutir o colapso climático, seus delegados chegaram em 114 jatos privados e em uma frota de megaiates, e dirigiram pela ilha com seus supercarros. Mesmo quando têm boas intenções, os ultrarricos não conseguem deixar de destruir o mundo vivo.\n\nUma série de pesquisas mostra que a renda é, de longe, o fator mais determinante no impacto ambiental. Não importa quão ecológica a pessoa pensa que é: se tem dinheiro excedente, ela gasta. A única forma de consumo que está clara e positivamente correlacionada com suas boas intenções perante o meio ambiente é a dieta: pessoas que se veem como “verdes” tendem a comer menos carne e mais vegetais orgânicos. Mas estas atitudes têm pouca influência na quantidade de combustível de transporte, energia doméstica e outros materiais consumidos. O dinheiro domina tudo.\n\nOs efeitos desastrosos do poder de compra são agravados pelos impactos psicológicos de ser rico. Estudos abundantes mostram que quanto mais rico você é, menos tem capacidade de se conectar a outras pessoas. A riqueza suprime a empatia. Um dos estudos revela que pessoas que dirigem carros caros têm menos probabilidade de parar para pessoas nas faixas de pedestre do as que dirigem carros populares. Outro, revelou que pessoas ricas tinham menos capacidade que as pobres de sentir compaixão por gente com câncer. Apesar de serem desproporcionalmente responsáveis por nossa crise ambiental, os ricos serão os últimos e os que menos sofrerão com o desastre planetário, enquanto os pobres serão os primeiros e os mais prejudicados. Quanto mais ricos, sugere a pesquisa, menos o conhecimento das mudanças climáticas os perturba.\n\nOutro problema é que a riqueza limita as perspectivas até das pessoas com as melhores intenções. Na semana passada, Bill Gates argumentou, em uma entrevista ao jornal Financial Times, que desinvestir em combustíveis fósseis é uma perda de tempo. Seria melhor, segundo ele, despejar dinheiro em novas tecnologias disruptivas com emissões mais baixas. É claro que precisamos de novas tecnologias. Mas ele não entendeu o ponto crucial: para prevenir a catástrofe climática, o que conta não é o que você faz, mas o que você para de fazer. Não importa quantos painéis de energia solar você instala, se não fechar, simultaneamente, usinas de carvão e gás. A menos que usinas de combustível fóssil sejam retiradas antes do fim de suas vidas úteis, e toda exploração e desenvolvimento de novas reservas de combustível fóssil sejam interrompidas, há pouca chance de impedir que a Terra aqueça 1,5ºC.\n\nMas isso requer mudanças estruturais, o que envolve intervenção política tanto quanto inovação tecnológica: uma abominação para os bilionários do Vale do Silício. Exige o reconhecimento de que dinheiro não é uma varinha mágica que faz todo o mal desaparecer.\n\nNa semana passada, me uni à Greve Global pelo Clima, na qual nos levantamos junto aos jovens, cujo grito ressoou pelo mundo. Como sou um trabalhador autônomo, me pergunto contra quem será minha greve. Contra mim mesmo? Sim: contra um aspecto meu, pelo menos. Talvez, a coisa mais radical que possamos fazer agora seja limitar nossas aspirações materiais. A hipótese com a qual governos e economistas operam é que todos nós lutamos para maximizar nossas riquezas. Se formos bem sucedidos nessa tarefa, inevitavelmente demoliremos o sistema em que nossa vida se apoia. Se os pobres viverem como ricos e os ricos viverem como oligarcas, destruiremos tudo. A busca contínua por riqueza, em um mundo que já possui o bastante (apesar de muito mal distribuído) é a fórmula para destruição em massa.\n\nUma greve significativa em defesa do mundo vivo é, em parte, uma guerra contra o desejo de aumentar nossa renda e de acumular riqueza: desejo moldado, mais do que possivelmente nos damos conta, pelas narrativas sociais e econômicas dominantes. Eu vejo que minha greve é em apoio a um conceito radical e perturbador: já basta. Individual e coletivamente, é hora de decidir o que “basta” significa, e como saber em que momento alcançamos esse ponto.\n\nHá um nome para essa abordagem, cunhado pela filósofa belga Ingrid Robeyns: limitismo. Robeyns argumenta que deveria haver um limite para a quantidade de renda e riqueza que uma pessoa pode acumular. Da mesma forma como reconhecemos a linha da pobreza, abaixo da qual ninguém pode estar, deveríamos reconhecer a linha da riqueza, acima da qual ninguém poderia subir. Esse chamado a um nivelamento talvez seja a maior blasfêmia para o discurso contemporâneo.\n\nMas seus argumentos são sólidos. Excedente de dinheiro permite que algumas pessoas exerçam poder desordenado sobre outras: no trabalho; na política; e sobretudo na captura, uso e destruição da riqueza natural do planeta. Se todos quiserem florescer, não podemos pagar pelos ricos. Tampouco podemos bancar nossas próprias aspirações, que a cultura da maximização da riqueza encoraja.\n\nA triste verdade é que os ricos conseguem viver como vivem simplesmente porque outros são pobres: não há espaço nem físico, nem ecológico, para todos buscarem o luxo privado. Ao invés disso, deveríamos lutar por c frugalidade privada e luxo público. A vida na Terra depende da moderação.\n\n- Fonte: https://outraspalavras.net/crise-civilizatoria/o-luxo-arrasador-dos-super-ricos/",
			"added": 1577837167
		},
		{
			"topic_id": 11,
			"title": "PIB é ilusão perversa, diz Nobel de Economia",
			"body": "#O mal-estar social alastra-se, o colapso da Natureza avança e a democracia declina. Se ainda assim o termômetro que afere o “sucesso” das sociedades nos diz que tudo vai bem — então, é preciso trocá-lo por outro. Já há como fazê-lo\n\nO mundo enfrenta três crises existenciais: uma crise climática, uma crise de desigualdade e a crise da democracia. Seremos capazes de avançar sem ultrapassar os limites do planeta? A economia moderna poderá oferecer prosperidade compartilhada? As democracias resistirão, caso as economias fracassem? São questões críticas, e mesmo assim as medidas hoje aceitas para aferir o desempenho econômico não dão absolutamente nenhum sinal de que podemos estar enfrentando problemas. Cada uma dessas crises reforça o fato de que precisamos de ferramentas melhores para avaliar o desempenho econômico e o progresso social\n\nO índice padrão de desempenho econômico é o Produto Interno Bruto (PIB), a soma dos valores de bens e serviços produzidos em uma região durante um período determinado. O PIB vinha crescendo ano após ano, até que veio a crise financeira global de 2008. Ela foi a ilustração categórica da deficiência das métricas comumente utilizadas. Nenhuma destas métricas ofereceu aos políticos ou aos mercados uma advertência de que algo estava errado. Ainda que alguns economistas astutos tenham se alarmado, as medidas padrão sugeriam que tudo estava bem.\n\nDesde então, de acordo com a métrica do PIB, os EUA vêm crescendo um pouco mais devagar do que em anos anteriores, mas não há nada com o que se preocupar. Os políticos, olhando para os números, sugerem pequenas reformas ao sistema econômico e prometem que tudo dará certo.\n\n\nNa Europa, o impacto de 2008 foi mais severo, especialmente nos países mais afetados pela crise do euro. Mesmo assim, tirando os altos índices de desemprego, as métricas convencionais não refletem plenamente os impactos adversos das medidas de “austeridade”, nem a magnitude do sofrimento da população ou os impactos de longo-prazo em seus padrões de vida.\n\nAs medições do PIB também não nos amparam com a orientação necessária para atender a crise de desigualdade. De que vale o PIB estar crescendo, se a maior parte dos cidadãos está pior? Nos primeiros três anos da suposta recuperação da crise financeira, cerca de 91% dos ganhos foi para o 1% mais rico. Não é surpresa que muitos tenham duvidado quando os políticos afirmaram que a economia estava a caminho de uma recuperação vigorosa.\n\nHá muito que me preocupo com este problema – o abismo entre o que os índices mostram e o que precisam mostrar. Durante o governo de Bill Clinton, nos EUA, quando fui membro, e depois presidente, do Conselho de Assessores Econômicos, eu me preocupava cada vez mais com como os principais índices econômicos falham em levar em conta a degradação ambiental e o esgotamento de recursos. Se a economia parece estar crescendo, mas esse crescimento não é sustentável porque estamos destruindo o ambiente e usando nossos escassos recursos naturais, as estatísticas deveriam nos alertar. Mas, como o PIB não inclui o esgotamento de recursos e a degradação ambiental, nós enxergamos um cenário excessivamente otimista.\n\nEssas preocupações foram trazidas à tona com a crise climática. Há três décadas, a ameaça da mudança climática foi amplamente reconhecida, e a questão piorou muito mais rápido que inicialmente esperado. Houve mais eventos extremos, maior derretimento de geleiras e maior destruição de habitats naturais.\n\nEstá claro que há algo fundamentalmente errado com a forma pela qual avaliamos o desempenho econômico e progresso social. E, pior, nossos índices frequentemente nos dão a ilusória impressão de que é preciso fazer uma escolha perversa; de que mudanças que melhoram a segurança econômica da sociedade – seja por meio de um sistema mais avançado de aposentadorias, ou de um melhor Estado de Bem-estar Social — afetam o desempenho econômico dos países.\n\nCorrigir a métrica – ou pelo menos melhorá-la – é crucialmente importante, em especial em nossas sociedades orientadas por índices e desempenhos. Se medirmos a coisa errada, teremos a resposta errada. Se nossas medições nos disserem que tudo está bem, quando na verdade não está, seremos complacentes.\n\nE deve estar claro que, apesar do aumento no PIB, apesar da crise de 2008 ter ficado para trás, as coisas não vão bem. Enxergamos isso no crescente descontentamento político em tantos países desenvolvidos; no crescente apoio a demagogos, cujo sucesso depende da exploração do descontentamento econômico; e no meio ambiente que nos cerca, onde alastram-se incêndios e ocorrem inundações e secas em intervalos cada vez menores.\n\nFelizmente, uma série de avanços metodológicos e tecnológicos nos forneceu melhores ferramentas de medição. A comunidade internacional começou a abraçá-las. O que conseguimos realizar até agora convenceu a mim e a muitos outros economistas de duas coisas: primeiro, é possível desenvolver índices muito melhores da vitalidade da economia. Os governos podem e devem ir muito além do PIB. Segundo, há muito trabalho pela frente.\n\nComo Angel Gurría, secretária geral da Organização para Cooperação e Desenvolvimento Econômico, escreveu: “Somente tendo melhores medidas, que realmente reflitam a vida e as aspirações das pessoas, seremos capazes de desenvolver e implementar ‘políticas melhores para vidas melhores’.”\n\n- Fonte: https://outraspalavras.net/mercadovsdemocracia/pib-e-ilusao-perversa-diz-nobel-de-economia/",
			"added": 1577837925
		},
		{
			"topic_id": 12,
			"title": "Uberização do trabalho: subsunção real da viração",
			"body": "O Uber evidencia a tendência de transformação do trabalhador em microempreendedor e em trabalhador amador produtivo.\n\n- https://web.archive.org/web/20190628063739/https://passapalavra.info/2017/02/110685/",
			"added": 1577839478
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"3_1CRBWHy3yPiavkJiSey48SQsMW3vtvCVhE": [
			{
				"comment_id": 1,
				"body": "#Cryptolab\nO Cryptolab oferece um conjunto de ferramentas relacionadas à criptografia, usando as quais os professores podem demonstrar e os alunos podem praticar várias técnicas, desde o césar clássico aos modernos RC4, DES e RSA.\n- https://gateway.pinata.cloud/ipfs/QmbDeXnG4EV6hjpmHGLzeNJoKbgPVihqy7Wrdi4U1NmBqE\n- https://github.com/mananSingh/Cryptolab-Offline.git",
				"added": 1577807238
			},
			{
				"comment_id": 6,
				"body": "#Compartilhamento Secreto de Shamir\nO Compartilhamento Secreto de Shamir é um algoritmo em criptografia criado por Adi Shamir. É uma forma de compartilhamento secreto, onde um segredo é dividido em partes, dando a cada participante sua parte única. Para reconstruir o segredo original, é necessário um número mínimo de peças. No esquema de limite, esse número é menor que o número total de partes. Caso contrário, todos os participantes são necessários para reconstruir o segredo original.\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Shamir's_Secret_Sharing.html\n- https://sci-hub.tw/10.1145/359168.359176\n- https://sci-hub.tw/10.1016/0167-4048(94)90097-3",
				"added": 1577819059
			}
		],
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 2,
				"body": "#Rojava, revolução ameaçada no Oriente Médio\n\"É urgente que a esquerda não permita que a maior Revolução do século 21 caia no esquecimento. Ela é a prova de que Socialismo e Democracia podem conviver, fora das experiências autoritárias stalinistas e do reformismo socialdemocrata, conciliando anticapitalismo, ecologia e libertação nacional e da mulher.\"\n- http://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:1_1EEj7HkE59AB2rExqQgD5TXsipqHvbtnnP/Rojava+revolu+o+amea+ada+no+Oriente+M+dio",
				"added": 1577809464
			},
			{
				"comment_id": 3,
				"body": "#Pós-capitalismo na era do algoritmo (1)\nDado como morto após a queda da União Soviética, o planejamento está em cena de novo, impulsionado pelo Big Data. As corporações usam-no para turbinar o consumismo. Mas ele pode impulsionar um socialismo radicalmente democrático\n- https://web.archive.org/web/20191226091110/https://outraspalavras.net/pos-capitalismo/pos-capitalismo-na-era-do-algoritmo-1/\n\n#Pós-capitalismo na era do algoritmo (2)\nSalvador Allende queria a informática em favor do planejamento estatal. As corporações empregam-na para o lucro e a desigualdade. Um socialismo renovado seria desafiado a utilizá-la para superar o mercado e a alienação\n- https://web.archive.org/web/20191227203006/https://outraspalavras.net/pos-capitalismo/pos-capitalismo-na-era-do-algoritimo-2/\n\n#Pós-capitalismo na era do algoritmo (final)\nAs mesmas tecnologias que permitiram a manipulação da política podem abrir espaço para democracia radical, novas relações com a natureza e superação do mercado. Desta contradição se darão disputas cruciais no século XXI\n- https://web.archive.org/web/20191208154833/https://outraspalavras.net/crise-civilizatoria/pos-capitalismo-na-era-do-algoritmo-final/",
				"added": 1577809758
			},
			{
				"comment_id": 5,
				"body": "#O Socialismo Não Termina Sempre em Ditadura?\nO Socialismo é muitas vezes misturado com autoritarismo. Mas historicamente, Socialistas tem estado entre os defensores mais convictos da Democracia.\n- http://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:5_1EEj7HkE59AB2rExqQgD5TXsipqHvbtnnP/O+Socialismo+N+o+Termina+Sempre+em+Ditadura",
				"added": 1577812781
			}
		],
		"4_1EEj7HkE59AB2rExqQgD5TXsipqHvbtnnP": [
			{
				"comment_id": 4,
				"body": "#As Origens do Totalitarismo - Hannah Arendt \nO estudo clássico de Hannah Arendt sobre os regimes totalitários\n- https://ipfs.io/ipfs/QmbDJonR6HW8sfcZrQcJzLmTk1FpWFgXESaR81bqkZtWk4",
				"added": 1577811411
			}
		],
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": [
			{
				"comment_id": 7,
				"body": "#Dlive e BitTorrent se unem contra o Youtube\n\nO Dlive, serviço de streaming que usa blockchain, se uniu ao ecossistema do BitTorrent Token da criptomoeda Tron.\n\nA partir de agora a plataforma Dlive irá utilizar o protocolo distribuído BitTorrent File-Sharing System para compartilhamento de arquivos e armazenamento de dados. O que dificultará a censura de vídeos, que tem acontecido constantemente no Youtube.\n\n-  Fonte: https://cointimes.com.br/dlive-e-bittorrent-se-unem-contra-o-youtube/",
				"added": 1577840756
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 8,
				"body": "#Cálculo 1\n\n\"Pessoal, nessa seção você encontrará videoaulas voltadas ao ensino de Cálculo. Essa disciplina exige muito dos alunos nas fases iniciais de cursos universitários, principalmente nas engenharias. Aqui as aulas seguem a sequência da maioria dos programas de Cálculo e ajudarão muito você na aprovação. Siga a sequência apresentada e aprenda de forma sólida esse assunto. Bons estudos!\"\n\n- https://invidio.us/playlist?list=PLTPg64KdGgYhACfQUtMf3CuhWOfLoTf_a",
				"added": 1577849712
			},
			{
				"comment_id": 9,
				"body": "#Curso Rápido de Integrais. Cálculo Integral detalhadamente explicado\n\n- https://invidio.us/playlist?list=PLE6qFDd4x9w-OeOgr2vL_HZygXVX_pd8Q",
				"added": 1577850145
			}
		]
	},
	"comment_vote": {
		"1_1EEj7HkE59AB2rExqQgD5TXsipqHvbtnnP": 1
	}
}