{
	"posts": [
		{
			"id": "1957705b-f2aa-45df-9840-f52977950b08",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "dc16d74e-4981-4a06-8b19-fd965624e443",
			"body": "How much cash are you willing to burn?",
			"time": 1567769409647,
			"files": "[]"
		},
		{
			"id": "0094d5ad-4427-4edd-9fa5-3f497ad6b876",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "b",
			"thread": "368c23f8-6738-4aab-b671-eae34e28f895",
			"body": "Entertain me, mortal.",
			"time": 1567931414091,
			"files": "[]"
		},
		{
			"id": "de20bcb2-0287-4b8d-9f8d-dde53d860638",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "dc16d74e-4981-4a06-8b19-fd965624e443",
			"body": "Cumbrains pay more for prostitutes and online thots than they ever pay towards anything cultural.\n\nDon't think it can be done except for some wealth billionaire appearing from nowhere.",
			"time": 1568140652737,
			"files": "[]"
		},
		{
			"id": "8467436d-aeca-4523-a1b5-5fdaa43b1fc5",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "dc16d74e-4981-4a06-8b19-fd965624e443",
			"body": "Milo Yiannopoulos Says He's Broke\n\nSilicon Valley appears to have blown up Milo Yiannopoulos's business model.\nThe disgraced right-wing troll is complaining that the major social media companies have effectively cut off his alt-right audience — and crushed his ability to make a decent living.\n\nThe former Breitbart tech writer shared the complaints on Telegram, a messaging app where some alt-right allies have set up shop after getting the boot by larger tech platforms. Yiannopoulos was banned from Twitter in 2016 for directing racist abuse at the comedian Leslie Jones, losing nearly 400,000 followers. He was banned from Facebook in May.\n\n\"I spent years growing and developing and investing in my fan base, and they just took it away in a flash,\" wrote Yiannopoulos, who's previously rubbed shoulders with neo-Nazis and white nationalists. \"It's nice to have a little private chat with my gold star homies but I can't make a career out of a handful of people like that. I can't put food on the table this way.\"\n\nhttps://kiwifarms.is/threads/milo-yiannopoulos-says-hes-broke.60794/",
			"time": 1568213972261,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}