{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1535798357,
			"title": "青岛老兵，堵截中央督导组",
			"body": "Yesterday there has been a film about this topic in big.kopykate.bit - today I cant find it anymore together with some more interesting political films from China?\n\nCould you please upload again?",
			"added": 1535798356,
			"parent_topic_uri": "10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		},
		{
			"topic_id": 1535809392,
			"title": "Increase storrage limit",
			"body": "While trying to increase the limit on http://127.0.0.1:7660/14qzPjqXiZV5PokSbX1EnkKZtpUASNxnfZ i do get notice \"This function is disabled on this proxy!\" -what does this mean and how can i solve this please?\nIts is independent whether i do it on the sidebar left or right..",
			"added": 1535809390
		}
	],
	"topic_vote": {},
	"next_comment_id": 14,
	"comment": {
		"1528382232_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [],
		"1535798357_13hSQgvTK6DKhaibEh2nRAposTN4wGQckW": [
			{
				"comment_id": 4,
				"body": "> [kai0](#comment_665_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): 来这里吧，很多很多http://127.0.0.1:43110/14qzPjqXiZV5PokSbX1EnkKZtpUASNxnfZ/\n\nI cant read Chines -But whenever I click on the left side of http://127.0.0.1:7660/1F1AHWYc7Mt3GBV9ZgphyyG2Go7uodmBtL/ I do get  \"Unable to connect\" :-(\n\nA English side would be a big help",
				"added": 1535803086
			},
			{
				"comment_id": 5,
				"body": "Sorry it was http://127.0.0.1:43110/big.kopykate.bit/?Channel=kai0@zeroid.bit which brings \"This site cant be reached\" \n7660 was just out of a port-forwarding",
				"added": 1535804215
			},
			{
				"comment_id": 6,
				"body": "this works - I saw that already...\n\nBut what is wrong with your channel on kopykate then?",
				"added": 1535804807
			},
			{
				"comment_id": 7,
				"body": "I am sorry - even that comes not up \"Not Found\nvideo/laobingwq/laobingwq.html\"",
				"added": 1535806083
			},
			{
				"comment_id": 8,
				"body": "Which files exactly do you mean - i rather new to TeroNet?\nMy files on KopyKate are fine apart from just one \n\n On 零网使用方法 i am asked to increase the limit - but when I like to do it says \"This function is disabled on this proxy!\" ?",
				"added": 1535807489
			},
			{
				"comment_id": 9,
				"body": "Even on the sidebar it says \"This function is disabled on this proxy!\"\n\nHow to best contact @nofish - here with a new topic on talk or sending mail?",
				"added": 1535808294
			}
		],
		"1535809392_13hSQgvTK6DKhaibEh2nRAposTN4wGQckW": [
			{
				"comment_id": 10,
				"body": "Additional when doing it on the left side it says \"You don't have permission to run siteSetLimit\" even when locked in before..",
				"added": 1535813276
			},
			{
				"comment_id": 11,
				"body": "> [d14na](#comment_14_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4): Most proxies, including ours https://0net.io DO NOT allow this, as it could be easily abused by malicious actors. I regularly check the proxy to see if anything needs to be increased and almost always double the recommended increase.\n\nThe point is that I dont use a proxy when i get this message - i am direct within ZN\n\nI assume it is somehow dependent on the username one had when heu first logged into that specific topic (for example mail)?\n\nSo how can i increase the storage limit with a different username?",
				"added": 1537353919
			},
			{
				"comment_id": 12,
				"body": "> [thunder33345](#comment_221_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): how do you start zeronet?start it with  --multiuser_local\n\nThat made the difference - thanks very much thunder33345 !\n\nCould you please explain what it really does change (  Enable unsafe Ui functions and write users to disk) ?",
				"added": 1537549087
			},
			{
				"comment_id": 13,
				"body": "> [d14na](#comment_55_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4): @garlic i honestly don't know why you would get the message, \"This function is disabled on this proxy!\", if you're NOT using a proxy. Also, why is your port 7660 and not the standard 43110? that might be a clue as to the issue you're having.\n\nI have a different port because I am forwarding from a remote machine....",
				"added": 1537549184
			}
		]
	},
	"comment_vote": {}
}