{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1589742530,
			"title": "Pub owner banned on Facebook for saying lockdown is like Holocaust",
			"body": "The man had a nerve enough to say orders to give up social life in this pandemic are not much different from promises of safety in Auschwitz to Jews in Warsaw Ghetto.\n\nHe got banned and is now apologizing, seeking forgiveness.\n\nGo figure! HAha haha ..> Pushed THE SPOT!!!!\n\nTRIGGER EVENT",
			"added": 1589742529
		}
	],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1588796526_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 1,
				"body": "@nesselon you are such a great example of what western brainwashing does to intelligence. You missed the whole point here which is that FBI uses tax money to raid a clinic for using a vitamin C for patients. \n\n“The evidence will further demonstrate that MOK used the COVID-19 pandemic as an opportunity to bill insurers for Vitamin-C infusions fraudulently represented as COVID-19 treatments and preventative measures,” a portion of the unsealed criminal complaint reads. Nowhere in the article the word CANCER comes up. It is not mentioned that the clinic used it on anybody to try to cure cancer. There is only one theme here > FBI _ RAID _ VITAMIN C _ VIRAL INFECTION\n\nAnd also you are by no means kind. You are bastard who calls people here mentally ill for not having the right views. Getting back to thread: There is absolutely nothing improper about the clinic using vitamin C for potential viral infection. Scientific fact is VITAMIN C IS AN ANTIOXIDANT HELPING TO REGROW TISSUE. It is therefore good as means of helping to recover from viral infection as IT REDUCES FREE RADICALS. Your bloated post involing cancer as if its an issue here and double blind study and a story of a person who took vit c but died is nothing but a distraction.\n\nIndians on average are simple people with little education. When their women got vaccinated and became infertile they took guns and went after the doctors who injected them. They have a healthy ancient human trait: ability to indentify cause and effect. They might not even know the politics of Gates, Rockefeller and never seen windows or linux. They might even not understand the great control trick 'the doctors only follow the protocol'. Naturally they knew doctors did the act of injecting and first blamed THEM for the effect. Natural behaviour. Western people are nothing like that especially after they go through state education. EVERYTHING IS RATIONALIZED 'they are only employees' and 'this is all legal' and 'they have to follow a protocol'. Perfect brainwashed slaves. Ah, and my favourite, fucking socialist liberal democracy and........ FUCKING INSURANCE.           \n\nYou distracted from the main issue here with your 'cancer peer reviewed study' rant but it is known that there is no single cure for cancer which logically corresponds to the fact that there are many causes for cancer. Toxins, all kinds of EMF and radiations and most importantly mental state and consciousness that is belief of individual to determine their own health condition. It is illegal to call anything a cure for cancer and thats shocking. Noakes who run a clinic curing thousands of patients of cancer in UK had to learn it the hardway - now his partner will be in prison for 25 years like for murder and he might end there soon. Their methods were very scientific and had lots of official research behind it. The politics doesn't care. They also cured some patient for free. Being noble is not appreciated here, you see.\n\nWestern culture has been infested with crap and it needs cleansing, a reset!\nhttps://www.youtube.com/watch?v=56Y5VUqzdcM",
				"added": 1588836757
			},
			{
				"comment_id": 2,
				"body": "> [nesselon](#comment_11_15wHfknPYGm91ZDyofsrYnhHzW4zH6xpXU): While you cannot change our culture, you can change your life. [...]\n\nLet me guess. Not breastfed. Go figure.",
				"added": 1588851716
			}
		],
		"1585234073_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 3,
				"body": "> [zaron](#comment_92_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): idk if bitchute is doing some funk tracking now or someones watching people on there now.nothing loads thru tor even with everything temp trusted with noscript\n\nFUCKING INCREDIBLE! I have been told that it's top priority to identify people who are rebels. It all makes sense. Bitchute is a decoy and a trap. This video was loading longer for me, probably needed extra time for calculations......",
				"added": 1589744783
			},
			{
				"comment_id": 5,
				"body": "> [zaron](#comment_92_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): idk if bitchute is doing some funk tracking \n\nWhat realistically bitchute connection can extract and what is causing TOR failure?",
				"added": 1589745794
			}
		],
		"1590079338_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 6,
				"body": "> [styromaniac](#comment_2208_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): We've coordinated with Interpol to arrest Tamas Kocsis  (..) as evidenced by him not taking bug reports from (...) ZeroTalk  [...]\n\nYou deflective FUCKER! This is just getting richer and richer. Ok, fuck that! TAMAS MADE NO VIDEO OR AUDIO SPEECH IN A VERY LONG TIME. That's the entire issue here. I heard that being pointed out to me and I couldn't make my mind if it's a big deal. After this crap and glitches people here complain about more and more all over the zeronet - I think it's a pretty big fucking deal?\n\nAnd how @Draugrdeathlord suddenly is 'with you' in anything? You are trying to pull random people into this shit!? [@Draugrdeathlord](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/12BRJSQrTETJVZzt2jHdqPywv3SdugSywC/) can post without your assistance.",
				"added": 1590085014
			}
		],
		"1611909944_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 7,
				"body": "> [orien3242](#comment_65_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP): ok\n\n> [getoutofthis](#comment_10_13UNccDwDNZx97EtsahFYrU3e5u4YGFbs7): How do you tell opinions apart from facts?\n\nUsers, it's obvious that some of your comments from the thread are gone. YOU ARE SEEDING TOO POORLY YOU ARE USING POOR OS ETC",
				"added": 1611990747
			}
		]
	},
	"comment_vote": {
		"58_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"76_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"92_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": 1,
		"86_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1
	}
}