{
	"next_topic_id": 41,
	"topic": [
		{
			"topic_id": 1610367113,
			"title": "报个到..",
			"body": "报个到.....",
			"added": 1610367112
		},
		{
			"topic_id": 1610381455,
			"title": "怎么看今天的瀑布？",
			"body": "后市如何？",
			"added": 1610381453
		},
		{
			"topic_id": 1610444805,
			"title": "古根海姆的BTC投资申请如果获得批准，将在1月31日生效...",
			"body": "经济学家Alex Krüger在推特上表示，古根海姆提交给SEC的关于通过灰度比特币信托GBTC投资比特币的申请将在1月31日生效（没有消息显示SEC是否已经批准）。似乎Minard（古根海姆的首席投资官）想要买入5亿美元的比特币，并且随着比特币价格上涨，他在鼓励人们止盈。此前消息，管理资金规模高达50亿美元的宏观机会基金Guggenheim（古根海姆）曾于2020年11月底向SEC提交关于投资比特币的申请。",
			"added": 1610444802
		},
		{
			"topic_id": 1610602858,
			"title": "从美国的乱象看比特币后市走向....",
			"body": "【文/观察者网 陈思佳】当地时间1月12日，美军参谋长联席会议的高层领导人打破了近一周的沉默，就6日的美国国会骚乱发表了联合声明。他们谴责参与骚乱的示威者违背美国法律、挑战美国宪法制定的程序，并强调拜登已赢得美国大选，即将成为新一任美军总司令。\n路透社在报道中指出，美军高层领导人通常不会发表涉及政治问题的声明，此次他们发表这样的联合声明是非常罕见的情况。\n\n从这一刻起军方的支持将是拜登的权力支柱之一，或者说得更明白，美国总统又多了个控制人，成了双线傀儡，而且这种情况必定会延续，如果美国还可以延续的话。而这无疑表明真正意义上的美国已经死了。\n更麻烦是问题在于，军方在美国政坛的崛起和介入，向原本控制美国的影子政府提出了前所未有的挑战，未来如果产生利益冲突，军事力量是资本家无法控制的，从中国历史看，王朝末期军阀只要有几乎都是主角，因此从这一刻起，华尔街要冒冷汗了..\n历时上犹太被洗劫N次，这次想例外恐怕不容易，关键现在如果想跑只怕不是一般的难，新冠疫情下全球几乎没有安全的地方，从二战的情况看瑞士银行也不靠谱，黄金更是没法藏，最终的退路搞不好恐怕还真就是比特币，只要能记住私钥就行...\n所以从这个意义上讲，比特币还要涨......",
			"added": 1610602854
		},
		{
			"topic_id": 1610712728,
			"title": "从美国的乱象看比特币后市走向（续一）....",
			"body": "纽约时报12月16日消息，今年春季时，在美国最大军事基地布拉格堡，人们对商店食品的需求增长了40%。当时，商店向AmericaServes（一个致力于为军人家属提供服务的网络）提出的食品需求达到了该组织的历史最高，退伍军人境况也差不多，普通人则更严重。（https://new.qq.com/omn/20201219/20201219A0G4YU00.html）\n锡拉丘兹大学退伍军人与军人家庭研究所最近发布的研究报告也显示，自从疫情爆发后，有近40%的现役军人家庭都出现了食品和营养帮扶需求。在这种情况下军内的不满是可想而知的。\n近来美参联会连续公开表态，对拜登进行支持，很不同寻常，与此同时还对内部公开进行警告，显然也在证明军心并不稳定，其公开表示的对拜登的支持，未必被全军上下一致认同。\n而与此同时，在相当一部分，而且越来越多的现役军人连吃饭都成问题的时候，疫情以来华尔街有钱人的财富则是大幅增加的，你没看错，是大幅增加。美国政策研究所（Institute for Policy Studies，IPS）和美国税收公平协会（Americans for Tax Fairness，ATF）的研究人员根据《福布斯》的实时数据计算了美国亿万富翁的财富增长，根据他们的分析报告，从2020年3月18日到9月15日，美国643位亿万富翁的财富总和反而增加了8450亿美元。其中，亚马逊首席执行官杰夫贝佐斯的财富增长了约345亿美元（2454.3亿人民币）；脸书创始人马克扎克伯格的财富增长了约250亿美元（约1778.45亿人民币）。埃隆马斯克（Elon Musk）自3月以来的净资产增长了48％。\n在这种情况下，手持各种武器却饿肚子的军队和腰缠万贯却赤手空拳的富豪之间，是否会发生什么，就不好说了。\n尤其要命的是，还有大量其他高度激化的矛盾，以及一大群愤怒的号称要搞事情的红脖子，一旦发生混乱甚至武装叛乱，必定要通过武装力量平乱，由此军阀就将正式走向舞台中央，从中国的历时看，王朝末期只要有军阀，那军阀就一定是各种事情的主角，所以.....\n对于华尔街富豪，尤其历史上被洗劫过多次的犹太富豪而言，现在最重要的恐怕就是预先安排退路，而如果想跑只怕不是一般的难，而且新冠疫情下全球几乎没有安全的地方，从二战的情况看瑞士银行也不靠谱，黄金更是没法藏，便捷的退路还真就只有比特币，所以，从现在起要密切关注美国的局势，越乱，比特币必定越涨...",
			"added": 1610712723
		},
		{
			"topic_id": 1610872035,
			"title": "数字货币的秘密（一、二）",
			"body": "　　（按：在2013年我创立了中国中南地区第一个矿池之后，觉得有必要从更深的理论层面对数字货币做些分析，以便让更多人了解数字货币的内涵，并对即将到来的新时代做准备，于是在在014年初，写了此文，首发在某军事论坛，随后在2014年4月初发表在天涯。这6年来的事实不但精准验证了我当初的分析和预测，而且无疑也给看懂的人带来了巨大的财富，至少100倍涨幅。可惜此贴从去年起就不能再回复，并在2021年1月初最终被天涯隐藏，故将此文再发于本坛，以便继续分析、讨论和验证，并感谢所有粉丝的支持，谢谢！）\n\n##　　一 货币的非货币价值和货币价值　\n\n　　任何一种货币都有其货币属性和非货币属性。这两个属性分别对应了这种货币的作为货币的价值和作为非货币的价值简称货币价值。比如金银，除了作为货币的价值，它们还有作为工业、艺术品原材料方面的价值。而从整个人类的发展史来看，古今中外出现的各种货币，虽然琳琅满目、数不胜数，但各种货币依次出现的规律都是：非货币价值不断递减，而作为货币的价值则不断增加，而且时间跨度越长，这个特征就越明显。\n\n　　以中国为例，从最古老的作为一般等价物的粮食，发展到后来的海贝，骨贝其非货币价值就是在递减的，而货币价值则在增加，而且人们很快发现，想要一个称心的货币，直接用自然界自然形成的东西做货币，是远远不够的，必须自己动手对其加工，才能尽可能提升其其货币价值，于是铜贝应运而生，这时真正意义上的货币就出现了。不过人类很快发现这仍然不够，于是对货币的各种精深加工不断出现，这种不间断的精深加工就是在通过人工竭力提升其货币价值。\n\n　　当发现浸透心血精心设计铸造的金币银币之类依然不能满足需要之后，人类开始明白一个道理：自然物品做为货币，其货币价值往往被其天然具备的非货币属性所束缚，无论怎么精深加工去提升都有限。要让一种货币拥有最佳的货币价值以满足应用，就必须完全脱离自然物品的窠臼，完全由人类自己来设计打造，并尽可能降低甚至舍弃其非货币价值才能最终使其货币价值最大，于是纸币诞生了。纸币是这样一种神奇的货币，其非货币价值接近于0，擦屁股都嫌太小太硬，烧火做饭就更加不适宜，而其作为货币的价值却极其巨大，运送携带、交易兑换、管理、分割、计量、均衡性等等等等都远胜于人类既往的任何一种货币。而且纸币也确实不辱使命，自诞生之后其，人类社会的经济发展一日千里，这其中，纸币的功劳是毋庸置疑的。\n\n　　而现在，人们在考虑的已经是这样一个带有哲学意味的问题：货币是否真的需要一个可以触摸的实体作为载体，是否可以完全脱离有形实体，不被任何实相所束缚，从而具备最优越的货币属性、最大的货币价值和最低的货币成本。\n\n　　为什么会这样，有观点认为，原因在于交易的发展变化，交易的模式、品种、内容、数量、交易的距离、面对的客户群体等等都在不断发展，因而必将对货币提出要求，其实何止是交易，整个人类的历史，就是一部经济发展史，而货币是经济的核心，因此随着人类社会的不断发展，不单是交易，经济的所有方面都会对货币不断提出各种苛刻的要求，而要满足这些日益繁复且极尽苛刻的要求，就只能逐步放弃对其非货币价值的追求，甚至完全放弃其非货币属性，而竭尽全力去提升其作为货币的价值，这就是人类社会发展历程中货币形式不断变化的本质。\n\n　　有病友提出这样的观点”货币和劳动有个毛关系“。现在我们可以来谈谈这个观点了。这句话原则上是正确的，但却还是没有把窗户纸点透。正确的说法是：货币的支付应和劳动基本呈正相关，而且这种正相关越明确，社会越健康，但货币本身所包含的劳动，则是生产该货币的成本，应在保证货币货币价值尽可能大的情况下，越小越好！更明白一点说，就是如果货币保证了尽可能大的货币价值，就是为经济提供了尽可能大的驱动力，而这种货币中包含的劳动则是经济在获得该驱动力时所付出的成本，这个成本当然越小越好。\n\n　　当今的社会已经进入信息时代，以互联网为代表的新技术已经影响到了社会的几乎每一个角落，这种带有明显互联网特征的经济，又怎么可能不对对处在经济核心位置的货币的方方面面提出新的要求呢？数字货币/虚拟货币就是满足这种新要求的一个探索。其无形无相但却有数有量的特点使得其很可能具有超乎想象的货币价值，因此千万不能单纯因为其看似仅仅为存在于计算机网络上的数字，就否定其价值，否则今天的我们就可能重复犯下中世纪欧洲人的笑话，据说当马可波罗将从中国（元朝）带回的纸币交给欧洲的高官，并声明在中国这种小纸片每张等于10个金币时，后者对其无不嗤之以鼻......\n\n　　接受数字货币资助，如果想支持作者发更多数字货币相关的高质量分析，请发比特币至：17Pgp33VDnL4vv6619xp5PEavGwf8nJ8QR，谢谢。",
			"added": 1610872029
		},
		{
			"topic_id": 1611059008,
			"title": "数字货币的秘密（三） 货币霸权",
			"body": "##三 货币霸权\n\n　　谈到货币，就必须谈及信用，经常有人说信用是数字货币/虚拟货币的硬伤，因为没有机构对其背书，所以其价值难以保证，而法币最大的好处就是有强大的政府做背书，因此其价值有保障，真的是这样吗？\n\n　　大家有没有想过为什么国家政权要为一个货币背书，是出于良心吗？是出于正义吗？是出于道德吗？当然不是，每一种现象后面都有利益！没有任何人会平白为一件东西背书，国家政权更不例外，之所以会为一个货币背书，只因为背后伴随着极大的经济和非经济利益，甚至是肆意掠夺的权力，对古今中外的任何国家政权概莫能外！列宁说过国家是一个阶级压迫另一个阶级的暴力工具，大家可以品一品其中的味道。\n\n　　这里有个真实的故事，http://news.sina.com.cn/s/p/2014-03-29/002729817085.shtml 说的是宝鸡的刘先生22年前在某商业银行存了100元，时隔22年，现在这笔存款到了多少呢？经过银行工作人员经核算，告知其22年活期利息总计不足8元，刘先生随即放弃取钱。问题在于，22年前的100元，基本是一个普通技术员整整一个月的工资，假设他一个月不吃不喝留到今天，现在能值多少，能支持一个人有基本尊严地过上多久，他努力工作一个月不吃不喝节省下来的财富去了哪里？\n\n　　值得一提的是，这决不是仅仅100元钱的事情，而是刘先生那时存下的所有财富，全部都被这样同比例地掠夺过，而且这也不是他一个人的事情，每一个从那时过来的人，他或她存下的财富全部都被这样同比例地掠夺过。我曾经做过一个大致的统计，中国在上世纪90年代中期退休的几乎所有工程师和高级工程师，其工作一生拿到的所有工资奖金全部加在一起总共大约只有3万元多不到4万，假定他不吃不喝不穿，把这些钱全部存下，那这些钱现在能够他活多久？财富都到哪里去了？\n\n　　不要以为那100元的事情是发生在过去，是发生在别人身上，其实现在依旧在你我身上发生着，将来还极可能永远发生下去，除非找到应对的办法。否则今天省吃俭用存下的钱，10年后还能剩下多少真的是一个很大的问题。从2000年起，我们不断听到各地有拆迁而暴富的城郊农民，尤其是北京城郊，其一夜暴富程度曾让无数人眼红，10年后，这些富豪的财富都还在吗?\n\n　　千万不要以为其他国家就会好一点，其实更糟。自从通胀的妙用被发现之后，几乎所有的政府都对其产生了浓厚的兴趣，每个政府都不遗余力地要将货币控制在自己手中，无一例外，比起稚嫩的中国政府，美欧日本等西方国家尤其擅长此道，并且其中不乏将其用到极致的。\n比如美国，如果说RMB的霸权只在中国有效，因而只能盘剥中国的P民，那么美元的霸权在全世界有效，其掠夺更加凶残和暴戾，而且其掠夺往往很不见得只是经济层面的，尤其以前苏联的崩溃为巨，具体我就不说了，自行脑补吧。\n\n　　世界其他国家呢？也都差不多，不过是有些国家或许稍微隐蔽一点而已。总之货币霸权是一个毒瘤，掌握这个霸权的人和集团甚至可以蔑视法律，既往所有的货币战争都是在谋求货币霸权，而所有的货币霸权又几乎必将用于对另外一部分人的盘剥。古今中外莫不如此。\n\n　　由此可见，法币的背书，从其诞生开始就很不见得是免费的午餐。甚至可以说，几乎所有政府对其法币的背书都是伪善的，在这伪善背书之后隐藏的，几乎都是狰狞的面容。古今中外都是如此，尤其是当社会出现动荡的时候，比如常凯申将军那会儿，和前苏联崩溃的那段日子，这种背书近乎毫无意义。\n\n　　既往人们通常用来保护自己的方法一般是买黄金，但黄金真的不靠谱，而且越来越不靠谱，首先购买不便，存储也不方便，很多时候要去银行租保险箱，携带，变现更是麻烦，土鳖国还经常有购买的金条生锈之类的事情发生，有关部门也大多睁只眼闭只眼，以至于国内一般店都只敢收自己出的货，其他店的根本不放心。而社会大动荡的时候各种问题尤其多，而偏偏这时候还最需要。以往兑换美元保值也算是一个办法，尽管同样必须面对美元的盘剥，不过随后由于中国高超的金融团队想出了一个软妹币对外升值对内贬值的超牛做法，导致靠兑换美钞保值已经变得彻底行不通了，是否黑市，是否伪钞，是否便于存储，携带、变现、交易都已经不重要。于是在某国，所有的财富由于毫无出路都被闷在了一口锅里，某些人则吃得不亦乐乎....\n\n　　毋庸置疑，货币霸权每时每刻都存在，盘剥每时每刻都发生，因此大家其实都在寻找这么一种方法，希望能对抗这种货币霸权。现在土鳖国上上下下，包括所谓体制内几乎都有一种非常明显的焦虑，都在急迫地寻找一种与其说发财或理财，不如说是保全自己财富的方法，如果说过去十年财富的唯一避风港是房产，那未来还是吗？网上随处都可见到类似“未来十年最值得关注的投资领域”之类的讨论，其根本就在于面对对货币霸权的焦虑和恐惧。美国人也一样，美国目前的人均现金存款率比中国人都低，是因为他们穷吗，实际上美国人的各种金融资产是中国人均的32倍（央行2010年公布的数据），这说明什么？仅仅说明美国的投资业发达？\n\n　　数字货币/虚拟货币正是在这样的背景下出现的（当然其为大多数人所知晓，依然是有特定的人为因素的，这一点下一章再谈。）。这种基于计算机网络，不依赖于任何有形实体的无形无相但却有数有量的货币，通过一种全新货币形式，全新的流通方式和创新的信用模式，提供了一种确实可以在一定程度上打破既有货币霸权的有力手段。\n\n　　这种货币在信用领域的创新在于，终结了以往货币必须由一个超级机构进行背书的历史，通过一种分布式背书的信用形式，在最大程度上避免了被超级机构行通过单一背书进行掌控进而行获得并行使货币霸权。\n\n　　具体来说就是：不需要有超级机构对其背书，而是每一个小店家，小公司，小企业，甚至个人，都可以凭自己的产品和服务，通过接受以数字货币进行的支付，来对该数字货币/虚拟货币进行背书，其实这样的过程早已经在世界各地开始了，只是还没有大量蔓延。一旦这样的小店面，小公司，小企业，个人达到一定的数量，就会在整个社会形成一种共识，并使得加入这个行列的普通人和普通机构越来越多，而同时因为每个机构和个人都不构成对整个体系的决定性影响，这样就可以在全社会背书的同时，避免因某个机构过于重要而产生货币霸权，并藉此对公众进行掠夺，也就是所谓的去中心化。同时其发行方式，也一改法币发行的向极少数特定主体“推”的方式（比如银行），变成由不特定主体去“拉”（即挖矿）的方式，使得货币的发行变得更加透明和公允。（实际上，如果说法币流通的方式仅仅是成本高，那法币发行的猫腻可就多了去了，如果说房子可以一房四吃，那法币发行尤其大规模放水时的吃法那就完全是流水筵席的模式了。这些很敏感，就不多说了。)\n\n　　对货币有了解的人肯定一下就会发现数字货币/虚拟货币和黄金的相似之处，是的，数字货币/虚拟货币，其实就是一种数字“黄金”，只不过它没有了黄金那有形的实体，去掉了实物黄金本来就已经不算很大的非货币价值（黄金的非货币价值大多是其货币价值衍生过来的，纯工业价值其实已经不算很大了），是一种非货币价值等于零的黄金，但其货币价值则因为没有有形实体的束缚而远远高于黄金。在涵盖设计制造，发行，兑换，存储，变现，携带，运输，可分割性，均衡程度，防伪，交易安全，隐私保护，防灾备份等的所有方面，都远远远远胜过黄金。而其信用方式则和黄金相同：黄金的信用特点是不依赖于一个核心组织为黄金强制性背书，而是几乎每个人，每个机构都不约而同认可黄金的货币价值（其实实物黄金的货币价值真心不高了，但由于某种思维定势，大家现在却都认可它。虚拟币的货币价值要高得多，但很多人却因不了解而暂时不认可它），并以自己的产品和服务直接或间接为其背书。\n\n　　在以往要几千年，才能让这么多人对一种物品的货币价值达成广泛共识，但在互联网时代，这一过程毫无疑问要快得多，尤其对数字货币/虚拟货币这样，货币价值远远高于黄金的货币而言，更是如此。以比特币为例，如果不是中国政府一直在打压，恐怕早就席卷整个世界了，而即便这样，愿意购买比特币并愿意接受其在自己的店铺或公司进行支付的机构依旧越来越多。 所以数字货币/虚拟货币目至少前阶段的真正名字和定位，应该是：数字黄金或者数字硬通货！我个人认为其在可预见的将来应该都不会取代法币，而是代替黄金，完成在金融领域黄金所有能做的事情，以及其他黄金不可能做的事情，从而对法币的健康运行起到促进作用，帮助法币完成一些以往难以胜任的工作，并帮助显著降低法流通成本，进而促进经济全方面的发展。\n\n　　尤其值得注意的是，在帮助比特币使用者找到当地接受比特币（或者莱特币）的 Coinmap.org网站，其接受比特币支付的企业列表近日达到了一个新里程碑，网站上列出的接受比特币等数字货币的企业已经达到4200家，而在去年12月只有大约1800家，历经中国的如此打压，价格跌去了一多半，但这个数字却增长了一倍多。显然，普通中小机构和个人自发为其提供信用和背书的过程已经开启，这是否是一个非常有趣并且值得有关部门特别警惕的事情呢？\n\n　　显然，如果一种货币的货币价值高超到无以复加，于此同时生产这种货币的成本还极低，那它不用担心信用的问题，迟早会有人和机构选择这种货币并为其提供的，这是人类社会发展的规律，信用，从某种意义上说信用和背书其实只是表象，是社会对货币价值及货币生产的成本综合，全方位权衡之后的结果。人类社会发展至今，各种琳琅满目的货币99%都被淘汰了，有的变成了普通商品，有的变成了文物，只剩下黄金这个奇葩，现在是否到了淘汰这个奇葩的时候呢？我不知道，你觉得呢？\n\n　　",
			"added": 1611059001
		},
		{
			"topic_id": 1611125162,
			"title": "关于ETH和比特币，我多说几句",
			"body": "说到ETH，如果有些人（比如本坛的某id），现在才意识到它的潜力，未免就有些晚了，我发现ETH的潜质可有年头，到2017年的时候我觉得有些东西只是自己一个人知道其实很无趣，于是开始在天涯进一步公开我自己的一些想法包括，包括对比特币、ETH，乃至BCH等等未来的发展状态和命运都做了明确的预判，我当时认为唯一具相关潜力可能挑战比特币的就是ETH（注意是可能），并且坚定认为ETC经典以太坊已死。这个贴是收费贴，只有几千字，但是却要支付2000元才能看。而尤其让我自豪的是所有付费看了此贴的虽然人数不多（这很好理解，毕竟是2000元一看），没有一个后悔，而且无一不在看后点赞此贴。随后这些年的事实，也确实无不精准契合该贴内容，到目前为止，暂时没有任何新情况超出当初预言。\n\n　　只是公平起见，我不能将该贴内容在这里贴出来，否则对那些付费用户就不公平了，不过有一点可以提醒一下你，这一波ETH想超过比特币是不可能的，而下一波行情则更难，从目前的一些新情况看，有一些新项目，他们和ETH都具备在未来某个时候挑战比特币的能力，而且以我个人的分析来看，他们更可能在未来对比特币发起挑战，从而争夺盟主之位，相关情况，我发在了我的收费群里，我群里的网友们可以作证。\n\n　　在此，我只能建议某些人，特别是本坛的某些ID，不要把自己的思维束缚在ETH或者某个数字货币的狭小天空里，也许在你的世界里这个币确实大得像天，但数字货币整体无疑是更广阔的，如果你在几年前就发现了ETH的潜质，那确实还值得自豪，而如果是现在才发现ETH的潜力，那就很不见得有什么了不起了，相反，如果你是现在新发现了什么更有价值，而且价值大到了可能在未来某个时候挑战比特币的程度，那就才值得激动，而唯有未来数年的事实确实证明了你的这种发现确实是正确的，那才真正值得骄傲，尤其如果未来多年的事实全部都无一例外地证明你现在的分析和判断，而且未来多年所有的事实不但都极为精准地符合你现在预言，同时也没有任何情况超出你现在的预言，就像我过去做到的那样，那才值得你如此激动和自豪.....",
			"added": 1611125154
		},
		{
			"topic_id": 1611379590,
			"title": "禹钟华：构造新型的数字货币平台",
			"body": "####构建数字货币平台的设想\n\n　　（一）对现有数字货币平台的分析\n\n　　微信、支付宝可谓现有的名副其实的数字货币平台，他们的出现本质性地使现金失去了存在必要，货币不可逆转地演化为手机上的余额。他们对数字货币平台的建设作出了十分有价值的探索。他们的不足之处有以下几点：其一，还不能全覆盖，服务功能只针对个人业务，还不能给企业提供全方位的金融服务。其二，这两个平台属于私人资本，不宜于充当关系国计民生的核心环节，如此具有极端重要战略意义的核心产业应该有政府主导。其三，其作为私人资本不能够调动全社会的资源建设一个统一的、全覆盖的超级网络。\n\n　　（二）构造新型的数字货币平台\n\n　　在理论上我们可以把一切信息活动都整合在一张信息网络上，进而构建一个信息的世界与现实世界相映衬。那么建立一个统一的、单一的、以数字货币运行为核心的金融网络平台，无论是在技术上还是机制上都不存在问题。因此，我们在设计理念上要有超前性，把目标设定在建立统一的、唯一的、全面覆盖的、整合一切金融机构与业务的金融网络平台上面。充分展示金融的整体机制属性，把金融网络平台建设成为大型的、基础性的公共设施，成为价值信息——货币的信息高铁网。\n\n　　由于其显著的公共产品属性，构建数字化金融平台同时也应是实现我国经济高质量发展的基本前提。我们还需认清金融体系的上行特征，这一超级平台的构建应该以政府为主导，才能体现整体理性、体现全社会的整体利益，才能动员全社会的资源，才能建设成为真正的、全方位的、面向全社会的公共设施网络。\n\n　　保持网络平台的开放性，准备与征信、税务、商品交易等等网络叠加整合，构建未来的、囊括一切经济信息的超级网络平台。并与既有的金融机构与金融平台实现对接，以备总体整合。而且还需在建立安全有效的防火墙的前提下，保持广泛、充分的对外的连接，为人民币的国际化准备好条件，并在国际金融领域引领数字货币的发展潮流。\n\n　　由中国人民银行发行的数字人民币（RCEP）已于2020年8月横空出世，虽然目前仍处于前期的试点阶段，不远的将来必将呈燎原之势，进而实现中国版的、公共产品式的、超大型的数字货币平台。\n\n　　（作者系中国国际金融学会理事，就职于东北财经大学，文章仅代表本人观点）",
			"added": 1611379581
		},
		{
			"topic_id": 1611912258,
			"title": "美股散户与机构上演多空大战，去中心化社区走上历史舞台",
			"body": "PAData 1月29日消息，当前，美股市场正在上演史无前例的戏剧性事件，WallStreetBets动员散户抱团对抗华尔街机构，根据《证券时报》的观察，截至28日收盘，此次双方博弈的焦点标的——游戏驿站经历了17次熔断，一度出现每间隔3分钟停牌一次，复牌1分钟后再停牌3分钟的走势，而过去5个交易日内，其涨幅已经达到788.32%。昨日，这场战火也延伸到了加密市场。WallStreetBets意见领袖WSB Chairman的模仿账号提及狗狗币，使其24小时内的涨幅超过800%。\n \n　　此次事件起源于散户与机构之间的矛盾，在成熟的美股市场中，机构长期占据主导地位，获得市场中的主要收益。但不同的是，在加密货币市场中，机构的表现却不尽如意。根据Crypto Fund Research的统计，2020年加密基金的年度收益率约为165.76%，低于BTC年度持币收益的304.784%。\n\n　　如果纵观加密基金的历年表现，可以发现，实际上过去4年终，只要2018年时加密基金年度收益率才略微高于BTC年度持币收益率，大约高出29个百分点。但要注意的是，当年处于市场“寒冬”之际，两者的收益率皆为负。而在2017年和2019年，市场行情较好时，加密基金的年度表现就不如BTC年度持币收益了，2017年加密基金的年度收益较BTC年度持币收益低了187个百分点，2019年则低了49个百分点。\n \n　　从历年月度收益表现来看，加密基金的收益率和BTC持币收益率之间的关系则更复杂。在2020年，1月、4月、5月和9月至12月期间，BTC的月度持币收益都高于加密基金。相反，在2月、3月、6月和8月期间，加密基金的收益表现更好。\n \n　　1月29日，Crypto Fund Research的CEO Josh Gnaizda在给用户的邮件中阐述了加密基金与BTC收益差距的原因。他认为，在多个市场周期中，加密货币基金与比特币的涨幅保持同步。但加密基金的波动性远低于比特币，尤其是在下跌行情中，基金可以减少投资者的损失。",
			"added": 1611912248
		},
		{
			"topic_id": 1612257384,
			"title": "从美国的乱象看比特币后市走向（续二）我认为现在的关键：米帝军方或已有人开始判断形势，并确认军方走上前台只是时间问题...",
			"body": "　　辉瑞的疫苗很可能有大问题，现在各方都在捂盖子，这当然只会让问题慢慢发酵而不可能真正让问题消失。再加上各种疫苗变异层出不穷，西医又始终没有找到有效药物和治疗手段，在这种情况下疫情很可能创奇存在并不断发展，由此导致米帝全国在可预见的数年内都无法恢复正常的生产、生活秩序，包括物流，对一个三亿人的国家而言这种情况是非常严峻的，尤其考虑到米帝国内的既有矛盾，包括党争，种族，华尔街的金融压榨（这从近期股市的拔插头等表现得尤其明显），如果没有正确，果断，行之有效的措施，并被有效执行，混乱几乎是无法避免的。\n　　问题是米帝这种情况，想要出台正确，果断，行之有效的措施，并被有效执行几乎是完全不可能的。在这种情况下，是等混乱出现后再强力制止，还是预先采取强有力的措施在混乱之前介入对军方而言是非常严肃的挑战。\n　　而无论如何，军方有一点可以明确，如果混乱注定要发生，那军方走上前台几乎是无法避免的。我相信米帝军方肯定也非常明确地看到了这一点，考虑到已经有消息报道40%的军方家属已经开始申请食品补助，军方内部的不满是可以想见的，由于时至今日仍看不到情况有改善的趋势，不排除已经有人开始在为即将到来的混乱和机会着手进行准备。\n　　相应的，其他各方也亟需为即将到来的严峻局势做充分的准备，尤其是华尔街，包括躲在华尔街背后的那些人也不例外....",
			"added": 1612257373
		},
		{
			"topic_id": 1612756376,
			"title": "迈阿密市长致力于制定 “最先进的加密货币法律”，包括考虑其城市雇员可以获得以比特币支付的工资..",
			"body": "自2017年以来一直担任迈阿密市长的Francis Suarez希望让迈阿密成为美国对加密货币和区块链行业人士最具吸引力的城市。\n\n　　在《福布斯》周日发表的一篇采访中，Suarez表示，迈阿密的立法者正在研究怀俄明州和纽约州等加密货币友好地区的政策，以促进佛罗里达州对加密货币和区块链的监管激励。\n\n　　“迈阿密正在确保我们拥有最先进的加密货币法律，”Suarez说。“我们想要确保我们相信，如果一切都是平等的，我们就会赢。所以，我们只是想要公平竞争。我们想要确保，没有人在容易改变的法律上比我们有优势。”\n\n　　Suarez市长没有把争夺监管赢家的竞争描述为其他司法管辖区立法者之间的斗争。相反，他称赞怀俄明州在吸引加密货币公司方面“采取了聪明的举措”，但补充说，“美国和世界上的每个城市都应该努力发展其技术生态系统。”，“我们正在努力确保我们的激励措施到位，确保我们的立法促进加密货币和区块链行业的发展，并具有前瞻性。”\n\n　　最近几周，这位市长已经对比特币（BTC）和加密货币发表了几份乐观的声明，包括让迈阿密考虑其城市雇员可以获得以比特币支付的工资，而不是美元。他还提议允许迈阿密居民使用加密货币支付当地费用和税收，并将部分城市财政资金投资于比特币，他称后者是三个想法中“最难实现的一个”。他已经与加密社区的一些知名人士进行了交谈，包括与Gemini联合创始人Tyler Winklevoss和Cameron Winklevoss的会面。本月早些时候，Tyler表示，这位市长“正在引领各国政府和比特币的发展”。\n\n　　Suarez市长没有提供这些措施何时对迈阿密45万居民生效的具体时间，但加密社区的一些人似乎已经注意到了。上周，主要的加密会议“比特币2021”宣布将从洛杉矶迁至迈阿密，举行其6月份的加密会议。",
			"added": 1612756364
		},
		{
			"topic_id": 1612878411,
			"title": "当年共同编写《比特币》这本书的作者。只有长铗还留在了币圈，其他作者都转行了..",
			"body": "当年共同编写《比特币》这本书的作者。只有长铗还留在了币圈，其他作者都转行了，宋欢平跑去开了饭店，他走之前跟我说了句，比特币已死……　当年他们都是币圈的大咖，骨灰级玩家，终极信仰者。可奈何扩容之争，弄得人心涣散，人走茶凉……导致现在留在币圈的老玩家也没几个了……🤣\n　　类似他们这样的，在币圈和链圈几乎比比皆是，所以很显然，无论是最初还现在，真正理解比特币，理解数字货币的都不多，绝大部分只是投机，只是为了捞一把，甚至都不愿意去了解为什么比特币这么多年始终在一直往上。\n　　不过庆幸的是，现在有某种信仰的人慢慢开始多了起来.....\n　　所以还是那句话，整个数字货币的历史，就是一部不断淘汰投机者，无信仰者的历史，同时也是一部有信仰，有梦想，真知灼见的高手们不断聚集，不断学习，不断提高的历史...",
			"added": 1612878398
		},
		{
			"topic_id": 1613031652,
			"title": "数字货币要搞人人过关？Twitter首席财务官表示正在考虑将比特币添加到其资产负债表中。",
			"body": "金融界网2月11日消息，Twitter首席财务官Ned Segal在接受CNBC采访时表示，Twitter正在考虑将比特币添加到其资产负债表中。\n\n　　NedSegal称：“我们已经做了大量的前期思考，考虑如果员工要求用比特币支付，我们将如何支付，如果供应商要求用比特币支付，我们将如何支付，以及我们是否需要在我们的资产负债表上使用比特币。”",
			"added": 1613031638
		},
		{
			"topic_id": 1613052001,
			"title": "美国纽约梅隆银行宣布将支持比特币服务",
			"body": "\n　　原作者：解密区块链\n　　美国银行纽约梅隆银行已宣布计划代表其客户持有，转让和发行#比特币#（BTC）及其他加密货币作为资产管理人。\n　　据报道，在2021年资产类别牛市期间，这一决定的推动力来自机构投资者，纽约梅隆银行客户群中的佼佼者。\n\n　　正如《华尔街日报》（Wall Street Journal ）所述，纽约梅隆银行（BNY Mellon）并不是传统金融中第一个使用数字资产的家喻户晓的公司，像富达投资（Fidelity Investments）这样的公司早就参与其中。然而，它是第一家承诺在短期内（“今年晚些时候”）为其客户引入加密货币托管的国家托管银行。\n\n　　《华尔街日报》援引该银行资产服务和数字业务首席执行官罗曼·雷格曼（Roman Regelman）的话说：“数字资产正在成为主流。”\n\n　　根据该报告，BNY Mellon计划使用现在处于原型版本的平台来管理加密货币，该平台还将用于处理诸如国债和股票的传统持股。BNY Mellon也没有对它准备托管的哪种加密货币设置任何限制。据报道，由Mike Demissie领导的专门的银行高管团队的任务是监督加密货币托管和管理到银行所有业务的集成。\n\n　　尽管纽约梅隆银行正在推进其计划，但雷格曼预计，将数字资产完全整合到传统银行基础设施中还需要三到五年的时间。\n\n　　摩根士丹利“为什么比特币投资需求并非不合理”\n　　分析师普雷斯顿·皮什：比特币（BTC）4月中旬可能达到95000美元\n　　马克斯·凯泽：比特币正在拯救投资者，避免因过多印钞而造成损失",
			"added": 1613051986
		},
		{
			"topic_id": 1613200127,
			"title": "建议体制内的某些人，尽快想辙把自己从打压比特币的事情里摘出来，把锅尽快甩出去，并为即将到来的新时代，各种新业务，新机构，新位子，做好谋划...",
			"body": "　　将来会有那么一天，一早起来各种媒体，各种电视、报纸、杂志、网站、论坛画风都陡然一变，原本一谈到数字货币特别是比特币便铺天盖地的传销，骗局，洗钱都不见了，取而代之的是创新，发展，便捷，安全甚至金融高地，未来趋势等诸多高大上的词汇，这该怎么办？\n\n　　某些人对这种大换脸是没有任何不适的，因为从很早很早起，他们就压根儿没信过自己写过的任何文字，自己说过的任何话，不仅仅是数字货币，还有许许多多其他的人，其他的事也都一样从来不信。所以180度转弯对普通人确实是高难度，但对他们则是一丁点问题都没有。\n\n　　不过，这时候作为普通人的“我们”怎么办，作为一条条晾在河滩上的白条鱼，还有什么能做的？尤其当很多普通人将必须花光自己十年的积蓄，甚至终身的积蓄，才能换得别人当初不过一顿饭钱买到的比特币，而且还不得不换，由此才能保护其资产时（就像当初财富必须换成房子才能保证安全，否则无论财富如何处置都必将减值一样，当然比特币是无法限购的，这也是其作为资产比房子更好的原因之一）。他们会怎么看待这些误导和忽悠他们的人和机构，他们会怎么评判这些误导和忽悠给他们造成的损失？\n\n　　所以，对于数字货币等敏感话题，有些人话尽量少说，动作尽量不要做，实在不得不说，不得不做，那动作不要太大，话也不要太过。\n\n　　如果有可能，现在要尽快想辙，把自己从某些事情里摘出来，把锅尽快甩出去，划清界限、切割好。并为即将到来的新时代，各种极其巨大的新业务，新机构，新位子，做好谋划...",
			"added": 1613200111
		},
		{
			"topic_id": 1613638129,
			"title": "7年前他卖房买了118个比特币，如今结果怎么样，本人回应了 ...",
			"body": "转自搜狐：2021-01-03 10:31\n　　时至今日，想必大家对比特币早已不再陌生，它的诞生，极大程度上促进了区块链产业的发展，然而将时间调回七八年前，彼时大众对比特币的认知尚且十分浅显，对其蕴含的价值也存在一定程度上的误解，很多人因此错过了一次堪称“一夜暴富”的机遇。\n　　2013年的唐宇，还是一个刚参加工作2年的小伙子，也正是这一年，他在曾经大学同学的“安利”下第一次接触了比特币，由于计算机相关的工作经验，让他对这一新鲜事物很快产生了浓厚的兴趣，于是开始深入了解，而亲眼看到同学年初花20美元单价买进的比特币到10月份以210美元的单价卖掉一下子赚了好几万后，唐宇坐不住了。作为一个年轻人，他也向往财富自由的生活，而当下不到1万元的月薪，显然无法实现这一梦想。他偷偷卖掉了父母为他购置的原本用来今后结婚用的新房，在2013年12月，以810美元的单价，买了118个比特币。\n　　唐宇开启了自己的“币圈”生涯，每天的生活，除了工作外，几乎所有空闲时间都被利用起来研究比特币的走势和市场行情，但上帝似乎跟他开了一个天大的玩笑，在经历过2013年超过50倍的暴涨之后，整个2014年，比特币的行情持续走低，业界普遍看衰，价格从年初的上千美元，到年底已经跌至仅320美元，而唐宇却始终坚信这一数字货币的前景和价值，因此并没有选择像大部分投资者一样，在价格走低时选择抛售。\n　　转眼时间过去了两年，俗话说，再好的耐心，在时间面前也会被消磨殆尽，连续两年的不温不火状态，让唐宇心中开始动摇，他不得不重新思考自己对这一事物的认知，加上瞒着家人卖房子这个大窟窿越来越瞒不住，唐宇的思想斗争已经接近了挣扎的地步。2016年12月，在苦苦坚守3年之后，唐宇选择了放弃，以750美元的价格清空了自己的账户，相比他的买进价格，亏损并不严重，不知道这算不算一种“幸运”。\n　　“有些东西，属于你的就是你的，不属于你的，强求不来”，这句话如今常用在男女之间，但套用在唐宇身上，似乎也没那么违和。因为老天爷再次跟唐宇开了一个玩笑，2017年，比特币迎来疯涨，价格一路飙升至2万美元，我们虽然不清楚唐宇当时的心情，但也能猜到个大概。再次见到唐宇，是上个月26号，他刚理完发，一头小短寸看上去很精神，当聊起比特币的话题时，明显能感受到他有话想说但又没说出口，如鲠在喉。我记得那天的比特币价格是2.7万美元，他当年卖掉的那118个比特币，价值319万美元，折合人民币2080万。\n　　这样的感受，我们作为旁观者是难以体会的，“未曾拥有，谈何失去”，而唐宇本人也感慨：“有些东西，失去了可能就再也回不来了。说不后悔那是假话，但后悔又能怎么样呢？这就是命。”\n　　无论经历过怎样的大风大浪，生活依旧要继续，我们依然要乐观，机遇不仅仅局限于某一个特定的事物，也不仅仅局限于金钱，或许多年以后，这段神奇的经历也会成为唐宇人生中最宝贵的回忆之一。",
			"added": 1613638112
		},
		{
			"topic_id": 1614138470,
			"title": "这一波下跌无非是各大机构想进场于是便打压一番，希望其他人把带血的筹码抛出来...",
			"body": "事情就是这么简单，散户们不把带血的筹码抛出来，他们怎么赚钱??\n　　这个世界上，真正美好的东西从来都是不够分的，古今中外概莫例外.....",
			"added": 1614138452
		},
		{
			"topic_id": 1614138931,
			"title": "这一波下跌应该是本次行情中，最后一次卖房买币的机会，各位抓紧吧....",
			"body": "未来当然还会有调整，但恐怕都不值得卖房了.....",
			"added": 1614138912
		},
		{
			"topic_id": 1614690243,
			"title": "花旗：比特币正处于临界点 或成为国际贸易首选货币",
			"body": "来源：新浪科技\n\n　　据报道，花旗集团今日发布报告称，随着特斯拉和PayPal等公司对比特币热情的高涨，以及各国央行也在探索发行自己的数字货币，比特币目前正处于“临界点”，有朝一日可能成为国际贸易的首选货币。\n\n　　同时，花旗集团也指出，有许多风险和障碍，可能阻碍比特币的发展。因此，比特币的未来仍不确定。但近期的一些发展，可能会是决定性的，因为比特币目前正处于“主流接受”和“投机性内爆”的临界点。\n\n　　这标志着主要金融机构在比特币问题上的基调发生了变化。之前，许多银行一直回避数字资产，称它没有内在价值，围绕它的炒作类似于17世纪的“郁金香狂热”。\n\n　　但比特币在过去几个月的疯狂上涨，迫使华尔街重新评估这种数字加密货币。美国历史最悠久的银行“纽约梅隆银行”上个月表示，将为比特币和其他数字货币提供托管服务。与此同时，摩根大通也表示，正在认真考虑比特币。\n\n　　比特币和其他数字加密货币，波动性非常强。以比特币为例，在触及逾5.8万美元的历史新高仅一周多后，其价格就下跌1万多美元。但与去年同期相比，仍上涨了60%以上。在过去的12个月里，比特币价格上涨了460%。数字加密货币的投资者表示，比特币的最新一轮牛市不同于前几轮，包括2017年的上涨。当时，比特币价格上涨至近2万美元，但次年暴跌80%，因为更多的机构投资者参与进来。\n\n　　最初，比特币是为了绕过银行和其他金融中间商，而创建的数字支付系统。后来，比特币作为一种可以对冲不断上升的通胀的“数字黄金”，在主流投资者中获得了吸引力。\n\n　　花旗集团表示，比特币在成为主流支付工具之前，必须也要克服几个障碍。花旗集团在报告中称：“市场运作方式需要升级，然后才会有机构的广泛参与。这种强化可将比特币和数字加密货币，置于传统金融监管机构的监管和规则之下。”\n\n　　“但这反过来可能导致，许多最具创新精神的开发者和企业家退出这个生态系统，因为它正远离比特币最初的‘反体制’理念。最后，宏观投资环境可能会发生变化，使得对比特币的需求变得不那么紧迫。”\n\n　　上个月，摩根大通分析师曾表示，最近热火朝天、狂涨暴跌的比特币，不过是一场看上去很热闹的“经济秀”罢了。疫情之下，金融业和科技巨头的竞争与合作，以及金融科技的发展才是真正的变革。",
			"added": 1614690223
		},
		{
			"topic_id": 1614780575,
			"title": "中环球船务接受比特币作为支付方式 盘前涨超16%",
			"body": "来源：新浪财经 发布时间: 03-03\n\n3月3日，中环球船务盘前涨超16%，此前宣布接受比特币作为其全球航运、货运和物流服务的支付方式。\n\n此前，中环球船务（SINO.US）宣布，公司将接受比特币作为其全球航运、货运和物流服务的支付方式。用比特币支付的款项将按照付款日适用的利率支付。\n\n公司首席执行官Lei Cao先生评论道：“我们很高兴开始接受比特币作为支付方式。中环球船务正在适应数字货币行业的趋势，为我们的客户提供多种支付方式的选择。接受比特币将使我们的客户和商业伙伴能够利用日益重要的支付网络。”",
			"added": 1614780554
		},
		{
			"topic_id": 1614782083,
			"title": "关于比特币的鄙视链即将形成，越早肯定，越能在鄙视链高端占据有利位置...",
			"body": "如前所述，关于数字货币尤其是比特币，人人都要过关，各个都要表态这个事情，现在很多人很多机构都已经明白过来，纷纷开始表态，与此同时关于比特币的鄙视链也即将形成。\n　　任何对数字货币尤其是比特币早表态，早肯定的机构和人员，将在鄙视链的高端占据有利位置，拥有知识、智商等方面的优越感，并具备鄙视位于鄙视链下端的其他机构很人员的权力。而越晚表态的人员和机构则将不得不呆在鄙视链的下端，接受其他位于鄙视链上端的鄙视，而最晚表态的，则将处于鄙视链的最底端，成为他人笑柄，甚至被整个社会最底层的草根鄙视和嘲笑。\n　　让人郁闷的是，对于这个游戏没有人能逃离，每个人，每个机构都必须表态，尤其是上层的有头有脸的人物，更是无一例外都必须表态，每个人都必须在这个鄙视链上给自己找一个位置，所以接下来就看所有这些人自己的表现了......",
			"added": 1614782061
		},
		{
			"topic_id": 1615986543,
			"title": "日本央行计划今年春季开始央行数字货币实验",
			"body": "3月16日消息，近期日本央行行长黑田东彦表示，日本央行计划在2021年春季开始央行数字货币（CBDC）的实验。\n\n　　据了解，随着世界各地央行研发数字货币，日本央行也开始着手准备。\n　　去年10月，日本央行称该行将在2021财年（自2021年4月始）开始对数字货币开展可行性研究。当时日本央行称暂无发行数字货币的计划，但从2021年4月开始，该行将与金融科技企业以及其他国家的央行合作开展相关试验。\n　　今年1月，有媒体报道称，日本央行表示将于今年春季进入CBDC试点计划第二阶段。据悉，该阶段主要检查CBDC预期执行功能、如何监管其资金流动，以及是否可以在离线或可能的通信中断期间使用。\n　　报道称，尽管日本央行尚未透露第二阶段将花费的时长，但该行表示将立即跟进第三阶段。第三阶段是由私营企业和消费者共同参与的试验项目，他们将积极参与实际使用测试。值得一提的是，目前有许多央行对数字货币产生浓厚的兴趣，近期印度央行表示正积极投入并将推出央行数字货币，以取代私人发行的加密货币。\n　　印度央行行长Shaktikanta Das表示，印度央行对推出数字货币“非常投入”，数字卢比项目是印度央行的主要关注点。虽然拟议的CBDC还没有确定正式的发布日期，但印度央行目前正在对主权数字货币系统的技术和程序协议进行微调。",
			"added": 1615986520
		},
		{
			"topic_id": 1615988265,
			"title": "比特币涨到大佬怀疑人生！霍华德马克斯再谈比特币：我终于知道我有多无知……",
			"body": "比特币价格再创新高不久后，霍华德·马克斯回顾几年前对加密货币的不屑态度，说道：我终于知道自己当时有多无知。\n\n　　周二发布的一段采访视频中，这位美国投资大师、橡树资本联合创始人对《韩国经济日报》承认，自己2017年对加密货币的否定，是一种没有研究支撑的“下意识反应”。当时他称加密货币没有内在价值，完全是种“毫无根据的流行”。\n\n　　但是三年过去，币价从5000美元涨到了50000美元，上周末还一度创下6万美元新高。如今马克斯表示：“我在2017年很不屑，现在还不能说我是对的……那些花5000美元买入比特币的人，至少从目前来看做了个正确的选择。”\n\n　　他指出，比特币目前的盛况是由供需关系决定的，恒定个数的供给，加上由便捷性、保密性驱动，不断增长的需求共同促成了这一局面，“很多人们很想要，并且高度重视的东西都没有内在价值，比如油画、比如钻石”，比特币也是这样一种东西。\n\n　　不过，真要说“黑转粉”，马克斯还是谨慎持保留意见。他提出疑问，需求增加是由于价格上涨，而价格上涨又是由于需求增加，这种机制似乎有点“循环”，这样的理由足够了吗？比特币还有什么独立的需求驱动因素吗？\n\n　　马克斯没有给出问题的答案。有了三年前的教训，这次他说：还是不要谈论你所不知道的事情为好。",
			"added": 1615988241
		},
		{
			"topic_id": 1616041178,
			"title": "美银：灰度持有比特币或达70万枚 价值逾400亿美元",
			"body": "新浪财经发布时间：03-1810:04新浪财经官方账号,优质创作者\n　　来源：新浪财经\n\n　　美国银行在周三的一份报告中表示，灰度比特币信托的运营者灰度投资公司持有比特币数量可能已达到70万枚之多，占全球比特币供应总量的约3.5%，按目前价格计算价值超过400亿美元，成为全球最大的比特币公开持有者。截至周二，灰度比特币信托的管理资产达到361亿美元。\n　　美银表示：“该信托基金2020年一直在稳步购买比特币，特别是在第四季度，并已成为这种加密货币的五大持有者之一。\n　　”灰度比特币信托基金成立于2013年，是希望在投资组合中增加比特币敞口而不直接购买这种加密货币的投资者的首选。多年来，灰度的信托基金一直是希望轻松投资比特币的投资者的唯一选择，因为美国证交会（SEC）一直阻止比特币ETF的推出。",
			"added": 1616041153
		},
		{
			"topic_id": 1616318443,
			"title": "杨主任这波发言不错，看着有陈毅老总当年的风范了...",
			"body": "　　王外长配合也很好，不过虽然表现很好，但这会给国家带来明确现实的收益吗？恐怕不能，原因很简单，战机已失。\n　　不久之前的某个特殊时期，中方本来是可以借助美方的党争，选举作弊，族群分裂等严重的内部结构性问题轻松从中获利，甚至一定程度上迫使拜登方面不得不至少暂时缓和中美关系的，但外交部某人对拜登的一次提前祝贺，导致战机全失，战机既失，接下来无论再怎么指挥有方，将士用命，也都白搭。\n　　而且可以明确判断的是，之前的这次讨好甚至谄媚既未让中美关系取得丝毫缓解，也未让国家获得任何利益，否则此次杨主任的痛斥就毫无理由了，相反倒是中方有严重的热脸贴了冷屁股，憋了一肚子火最后发飙的嫌疑，否则一直以温和著称的杨主任也不会如此破例发飙，如此重大的场合，如此身份的外交官，如此发飙，这在陈总之后应该都是没有先例的。\n　　而米帝方面显然也会看明白形势，知道自己已没有丝毫退路，后退哪怕半步就是万丈深渊，不但五眼联盟会散，其他小弟更难听话，内部的倾轧和内卷则更残酷。美国可不比俄罗斯这样有一定历史底蕴的国家，其实都只是因为一个美国梦而临时攒到一起的逐利者，一旦散起来会非常快，所以接下来，除了对抗没有其他的路，甚至不排除战争之外的全领域对抗。\n　　不过可以排除的是任何战争层面的对抗（当然决不是说可以不做战争准备），如我之前多次所述，中美之间的军事决战，早已经在1952年的朝鲜就已经结束了，之后中国只要不在科技层面，经济层面，金融层面，粮食安全等方面出现重大失误以至于严重落后和危机，中美之间是没有任何可能再进行军事层面的决战的。\n　　所以最终的结论是，虽然此次谈判表现上成，但由于前述原因，不会有任何实质性收益，中美的对抗必然将进一步加剧，未来必须在多个领域做好进一步对抗准备.....",
			"added": 1616318417
		},
		{
			"topic_id": 1616318673,
			"title": "巴西首支比特币 ETF 获批，成为第二个批准发行国",
			"body": "2021/3/21 16:49:17 来源：TechWeb 作者：艺艺子 责编：姜戈评论：7\n\n　　3 月 21 日消息，据国外媒体报道，巴西证券交易委员会 (CVM)本周批准了两只加密货币 ETF，成为美洲继加拿大之后第二个批准比特币交易所交易基金的国家。\n\n　　QR Capital 的比特币 ETF 已获得巴西证券交易委员会（CVM）批准，将在圣保罗的 B3 证券交易所以 QBTC11 股票代码进行交易。QR Capital 称：“CVM 刚刚批准了拉丁美洲第一个比特币 ETF QBTC11，” QR Capital Group 的经理 QR Asset Management 的 ETF 将在 B3 上市，这将成为第二个在全球范围内交易以拥有 100% 的比特币 ETF。”QBTC11 可使合格的投资者轻松安全地获得比特币敞口，而不必担心钱包或私钥。\n\n　　另一种则是巴西基金管理公司 Hashdex 的加密 ETF，由五种加密货币组成，将在圣保罗的 B3 证券交易所以代码 HASH11 进行交易。巴西两家主要银行 Itaú 和 BTG Pactual 已表示将向其客户提供该 ETF。HASH11 有望于本月开始交易，而 QBTC11 ETF 有望于 2021 年第二季度开始。据悉，Hashdex 的 ETF 将复制由纳斯达克和 Hashdex 共同开发的纳斯达克加密指数（NCI），NCI 由六种加密货币组成，包括 BTC、ETH、XLM、LTC、BCH 和 LINK，并按季度重新平衡。\n\n　　Hashdex 资产的托管权由 BitGo，Coinbase，Fidelity 和 Gemini 等公司负责，这些公司均在美国进行调解和监管。比特币 ETF 经理 QR Asset Management 称，该产品可能会加快在美国推出类似产品的速度。",
			"added": 1616318646
		},
		{
			"topic_id": 1616858562,
			"title": "3月1日刑法修正版规定欺诈上市最高15年，并处罚金，并将律师会计师一并纳入，然后抽查20家，然后这20家二话不说都终止上市了...",
			"body": "　　以下内容转自：https://weibo.com/ttarticle/p/show?id=2309404614791053574337\n　　​​中证协3月份在400多家拟上市的公司里抽查了20家，本来就是个“例行检查”年年都有的，结果这20家公司都撤回了上市材料不上市了~！\n\n　　要知道一旦公司上市老板就直接身价亿万实现财务自由了，公司老板艰苦创业一天天累死累活等的不就是这一天么~！这么大的诱惑大家不仅都顶得住，还步调出奇的一致全部终止上市，你猜为啥？\n　　以前上市公司要是上市材料造假，相关责任人也不过就是罚款2~20万了事，所以以前即便被抽查出有不符合上市条件的公司在给公司申报材料“美颜”造假，这些公司也没在怕的。被查出来就让他们罚嘛，又没多少钱，多大点事儿啊。现在不一样了，一旦发现上市材料造假，不仅拟上市企业的责任人要判刑10~15年，就连保荐券商、审计公司、法律顾问都要一并承担刑事责任~！看清楚，我说的是《刑事责任》，要坐牢的。我上面提到的协助企业上市这个产业链上的每个参与者都是拿高薪的，你让他们放弃花天酒地的生活去吃牢饭？呵呵，就算企业法人把胸脯拍得山响说老子公司没做假不怕查，其他打辅助的也会上来拖后腿让企业再考虑考虑的。\n　　这事细思极恐啊，仅仅只抽查了20个公司就100%撤回上市材料不上市了，那要是407个拟上市企业都查一遍呢？又有多少企业会撤销上市申请？要是已经上市的公司再都查一遍呢？又能查处多少问题？！\n　　国家成立股市的目的是给实体经济提供一个融资渠道，鼓励民间资金协助实体经济发展的。结果这么多企业要么钻规则空子，要么干脆造假上市，用老百姓的钱帮自己实现财务自由…但是已经有4000多家公司上市了，以往的伤疤还不能揭，因为一旦揭开就是大面积流脓~！这么大个消息都没看见一个财经官方媒体报道，既得利益群体规模过大，中证协都得罪不起。\n　　以后估计也就是加大对拟上市企业的排查力度了，已经上市的公司说不定就“平安着陆”了。所以在A股谈什么“价值投资”什么“拥抱核心资产”我觉得是个伪命题，你告诉我A股里有多少公司是真正有价值的？我有理由合理怀疑一大半的上市公司本身就不具备上市资格，还谈什么“价值”？\n　　一个例行检查的抽查就能看出这么多问题，A股的规范化建设和反腐任重道远啊…​​​​\n\n",
			"added": 1616858534
		},
		{
			"topic_id": 1616941485,
			"title": "逃不过“真香定律”：挪威商业大亨Spetalen购买5000万美元比特币",
			"body": "来源: 网易 ：https://www.163.com/dy/article/G674LN6A0539QLK6.html\n\n　　摘要：挪威商业大亨 Øystein Stray Spetalen 近期在一次会议上告诉观众，加密货币对环境的破坏太大，所以并不支持。但他却也逃不过“真香定律”，Spetalen 还加入了挪威最大加密货币交易所的董事会。\n　　大概十天前，亿万富翁投资者、挪威商业大亨 Øystein Stray Spetalen 在 DNB 投资大会上利用自己的平台谴责比特币是一种“荒谬的货币”。据挪威媒体 Finansavisen 报道，现在他不仅自己买了比特币，还投资了挪威最大的比特币交易所 MiraiEx。\n　　在 3 月 18 日 DNB 会议上的一段事先录制的视频采访中，Spetalen 表达了他对比特币碳足迹（Carbon Footprint）的担忧：“如今比特币消耗的能源相当于整个挪威。这对环境极其不利。挪威当局和欧盟应该立即禁止它。这样就能大大减少二氧化碳的排放。他还补充道：“比特币简直是胡扯。我们现有的支付系统上已经做得很好了。”\n　　然而，在接受 Finansavisen 的采访时， Spetalen 透露了自己现在部分拥有挪威加密货币交易所 MiraiEx 的重磅消息：“识时务者为俊杰。3 月初，在（此前那段）播客节目录制的第二天，我便遇到了 MiraiEx 的创始人 Thuc 和 Øyvind，那时起我就意识到自己错了。当我还得知 Kjell Inge Røkke（工业巨头、同为挪威亿万富翁）也涉足比特币时，就更无需多言了。我不能忍受看到 Røkke 赚钱，而不是我。”这是一位亿万富翁的 FOMO。\n　　注：昨日，推特网友@BTC_Archive 爆料称，Spetalen 购买了价值约 5000 万美元的比特币。Spetalen 认为，比特币可以作为新的金融架构的基础层。除此之外，Spetalen 还收购了挪威最大的比特币交易所 MiraiEx 17% 的股份。\n　　\n　　Spetalen 加入囤币大军\n　　在购买了近海渔业、工程和建筑公司 Aker ASA 足够的股份并成为其最大股东后，Kjell Inge Røkke 名声大振。今年 3 月 8 日，Aker ASA 宣布设立新公司 Seetee AS，致力于投资比特币生态系统中的项目和公司，并将其所有流动可投资资产保留在比特币中。Seetee AS 的初始资本为 5 亿挪威克朗（约合 5852.1 万美元），已经买入 1170 枚BTC。Seetee 将首先专注于：1）投资和拥有比特币，2）加入比特币和更广泛的区块链社区，并与领先的参与者建立伙伴关系，3）启动比特币验证业务，4）在比特币和区块链生态系统中建立和投资创新项目和公司。Seetee 将通过在工业软件、金融科技和绿色能源价值链方面的努力，利用 Aker 集团已经开发的能力，来寻求这些机会。\n　　Spetalen 向 Finansavisen 坦言，他也买了比特币，但持仓量不及 Røkke。此外，Spetalen 还加入了 MiraiEx 的董事会。去年 12 月，该交易所完成了由总部位于奥斯陆的风险投资公司 Skyfall Ventures 领投的一轮 500 万挪威克朗（约合 58 万美元）融资。\n　　和 Spetalen 一样，挪威当局也对比特币发出了喜忧参半的信号。周二，挪威银行行长 Oystein Olsen 重申了 Spetalen 早些时候的立场，他表示，就在这个基本上没有现金的国家取代现金而言，比特币“过于资源密集”也“过于昂贵”。\n　　与此同时，由于挪威政府的养老基金购买了特斯拉（Tesla）、MicroStrategy和Square等机构“囤币者”的股份，每位挪威公民的比特币名义持有量为 26720 聪，约合 15 美元多一点。\n　　至此，Øystein Stray Spetalen 正式击败特斯拉首席执行官埃隆·马斯克，成为加密历史上立场转变最快的一位影响力人物。",
			"added": 1616941456
		},
		{
			"topic_id": 1618196500,
			"title": "【转摘】谷燕西：市场对比特币存在哪些认知偏差",
			"body": "币圈宝爷　发布时间: 04-12　09:51\n\n　　现在市场对比特币的价值有了更多的了解。这直接体现在比特币的市值方面。比特币只用了12年就达到1万亿美元的市值，而且是在没有一分钱的推广经费的前提下。12年的时间远小于微软，苹果，谷歌和亚马逊达到一万亿美元市场的时间。但即使市场对比特币的理解比以前深刻很多，现在依然有很多的理解偏差。这样的理解偏差也同样包括对比特币的支持者在内，当然也包括用自有资金购买并持有比特币的人。这样的理解偏差直接决定了投资者在其投资组合中的比特币的比例。\n\n　　##比特币不只是数字黄金\n\n　　现在一个对比特币的理解偏差就是把比特币比喻成数字黄金。把比特币作为一个价值储存工具来理解。这种理解在比特币的发展初期或许有助于人们理解比特币的价值。但是时至今日，如果依然把比特币只认为是一个价值储存工具或者一个新的资产类型，就无法真正理解比特币的价值。作为一个价值储存工具，比特币同黄金相比，在各个基本属性方面都优于黄金。在总量有限，公平获得，永久保存，可以细小切割，便于流通和交易以及安全性方面，比特币比黄金都有数倍的优越性。更为关键的是，比特币是以公平的方式面向所有个人。现在任何个人用户都可以通过挖矿获得比特币。而且比特币是在全球范围内进行交易。全球范围内的用户以不间断的方式对其进行市场定价。因此任何一个地方的用户都可以以在全球范围内公平的价格买卖比特币。所以比特币在全球范围内的用户的接受范围方面要远远的优于黄金。而且最重要的是，比特币是21世纪的数字产品，而不是已经使用了5000多年的自然界产生的矿物质。因此它是符合时代的发展所应该具有的价值储存工具。\n\n　　##比特币同样是一个支付网络\n\n　　在结算方面，比特币是在自有网络之上运行，也就是在区块链技术支持的网络上自动运行。而这个网络正在逐渐被采用成为价值转移工具以及支付工具。换句话说，比特币的网络就是一个全球范围内的支付网络。而且这个网络是自动运行，不是由SWIFT，Visa或Mastercard这样的公司来控制。全球范围内的任何一个用户,只要他能加入比特币的网络,他就能使用这个网络同全球范围内的任何一个用户进行基于比特币的直接交易。所以对于比特币的理解，不能只是理解它是一种资产类型。而且应该是将其理解为同样是一个网络。而且这个网络正在不断增长。随着网络节点和用户数量的增长，网络的价值（也就是比特币的价值）会以平方级的方式增长。\n\n　　##比特币会成为一种货币\n\n　　另外一个对比特币的误解是认为比特币没有内在价值。它不像股票或债券一样有未来的收益。但是比特币是作为一种货币被设计出来的，所以不能用股票或债券这样的金融产品来衡量比特币。而是应该以货币的标准来看待比特币。如果我们以货币的三种基本属性来分析，比特币现在已经被接受作为一个价值储存工具。它现在也已经开始被用在交易当中。当然这样的交易并不是日常支付咖啡一类的交易，而是出现在国际贸易，购买特斯拉的电动汽车，购买美国职业棒球队贵宾室季票这样的高价值产品。作为一个历史仅12年的货币，它现在已经在全球范围内的一些局部区域开始应用于支付。这样的应用发展已经是非常快速了。现在美国的一些第三方金融终端当中，譬如Square和Strike，已经可以实现用户之间的比特币的小额转账。所以比特币作为一个支付工具正在应用进行当中。在作为记账单位方面，比特币实现这个目标还为时尚早。但是我认为，比特币作为记账单位的落地应用会远远早于普遍的预期。鉴于美元这样的增发的速度，比特币作为计价单位的发展会快于正常情况下的发展。\n\n　　##比特币的波动性\n\n　　现在对比特币的一个普遍的批评，就是认为它波动太大，因此不适合于作为支付工具。这个观点对于比特币早期是适用的。但是当比特币发展到一定程度之后，比特币的波动性并不是它本身的特点决定的。而是由同它进行交易的法币来确定的。比特币的总量一定，因此每个比特币的价值应该是恒定的，而不确定的是同它进行交易的各类法币。此外，比特币的波动性实际上已经开始下降。今年第一个季度以来，比特币的波动性已经出现下降的趋势。随着流动性的增加，特别是机构现在已经开始的买入和美国市场中基于比特币的ETF的即将推出，预计比特币的波动性会进一步下降。\n\n　　对于比特币的投资者来说，对于比特币的价值了解多少直接决定他对比特币的投资和持有策略。为了保证自己的投资组合获得长期的风险调整之后的最大收益，就需要对比特币的本质有正确的认识。",
			"added": 1618196470
		},
		{
			"topic_id": 1618300090,
			"title": "四年前那波行情，国内还是有几个还不错的项目的，包括量子链等等，这一波...",
			"body": "上一波行情里头，国人还是做了一些还不错的项目的量子链，LRC（最早一波的跨链项目）等等。而且开始有一些不错的，甚至是顶级团队进入的迹象。可惜接下来的政策非常给力，于是再也没有好的，有实力的团队进入数字货币领域了，但改领域内的骗子却一点都没减少。\n　　所以眼下这一波行情里，基本上到现在没看到国人有认真严肃的项目出来，仿盘资金盘倒是一点不少，相反海外各种可圈可点的项目层出不穷，虽然这些项目不见得个个最终都能成功，但多少都有一些闪光的点，虽然其中相当一部分仍然还是会失败，但即便如此，在它们的基础上一定能会诞生出更多更好的项目，国人大幅落后了.....",
			"added": 1618300059
		},
		{
			"topic_id": 1618390973,
			"title": "美国证券交易委员会(SEC)委员：禁止比特币是不明智的",
			"body": "美国证券交易委员会(SEC)委员Hester Peirce上周在Marketwatch的“加密投资”(Investing in Crypto)活动上接受采访时，分享了她对各国关于比特币和加密货币监管的看法。她还被问及证券监管机构今年批准比特币交易所交易基金（ETF）的可能性。\n\n　　Peirce有时被称为“加密妈妈”，几年来一直在推动美国证券交易委员会批准比特币ETF。她在接受采访时被问到，禁止加密货币是否有可能，因为有些人仍然认为政府可以随时禁止比特币，包括桥水协会创始人Ray Dalio、The Big Short的Michael Burry和Ron Paul。Peirce回答说：“我想我们很早就过了那个阶段，因为你必须断网才行。正如我过去说过的，我不明白你怎么能禁止它......我认为，试图这样做是一件不明智的事情。”\n\n　　此外，该专员强调，禁止加密货币存在“一个更大的问题”，即 “如果我们决定试图阻止它们，我们将错过围绕比特币和其他数字资产的创新”。\n\n　　SEC今年会批准比特币ETF吗？\n　　\n　　Peirce委员还被问到，今年是否如许多投资者所期待的那样，SEC将批准比特币交易所交易基金（ETF）。她回答说：“这是大家都有的大问题。” 她补充说，她的答案和过去三年的答案一样，“就是我不知道。”\n\n　　她指出，美国证券交易委员会正处于过渡期，新主席Gary Gensler可能会在未来几周内得到确认，并可能在不久后开始工作。“这将对交易所交易产品是否以及何时获得批准这个问题产生很大的影响，” 该委员认为。\n\n　　至于比特币市场，Peirce详细解释说：“在我加入委员会的三年里, 市场已经非常成熟。我们看到了很多机构对这个市场的兴趣。我们在其中看到了一定程度上可以说是准交易所交易产品的东西。”Peirce随后指出，加拿大已经批准了一些比特币ETF。她指出：“你看到更多的机构参与基础市场。” 她补充说，这些都是“可能让我们能够接受该基础市场的运作方式的类型”。\n\n　　该专员强调，“比如说，比特币市场永远不会像股票市场那样， 所以我认为试图将这种结构强加给基础市场是不合适的。这就是之前的一些失败的申请中所暗示的。”\n\n　　在谈到其他国家在创新方面如何可能领先于美国时，Peirce认为：“我认为我们肯定是落后于曲线的。我们已经看到其他国家采取了一种更有成效的方法来监管加密技术，这并不是说我们根本不应该有任何规定，他们只是一直在说让我们建立一个适用于加密技术的监管框架。”\n\n　　“我们的做法更多的是’拒绝，然后告诉大家再等等’，”她介绍说。“所以，我认为我们真的需要扭转局面，愿意努力，建立一个适合这个行业的框架。我乐观地认为，随着新主席的到来，他对这些市场、加密市场有着深刻的了解，这是我们可以一起做的事情，建立一个好的监管框架。”",
			"added": 1618390941
		},
		{
			"topic_id": 1618401215,
			"title": "比特币：你们的货币都是垃圾！",
			"body": "转自：新浪财经 发布时间: 04-14 12:16\n　　来源：路财主\n\n　　比特币的美元价格再创新高，盘中突破6.3万美元/枚。\n\n　　熟悉我的人都知道，从2019年底到2020年底，无论在什么场合，我都不遗余力地给所有熟悉的朋友鼓吹和推荐比特币，并且说过“7000美元以下的比特币随便买”这样的话。\n\n　　2020年8月，当时比特币在经历了3月份的暴跌之后（一度跌至4000美元以下），晃晃悠悠上涨至1万美元左右，这时候出现了很多关于加密货币交易所的负面新闻，很多人看空比特币。我那时特意写了一篇文章，从估值的角度分析了比特币为什么一定会大幅度上涨：\n\n　　2年之内，比特币突破5万美元？\n\n　　可惜的是，大多数人并不理解比特币的价格逻辑，他们大都认为，一个毫无价值、像郁金香一样被炒作的东西，不归零就不错了，还能涨到5万美元/枚？\n\n　　当时的文章留言中，点赞量最高的那些评论，全部都是看空比特币的。哦，对了，现在你点开这篇文章，依然可以查看这些留言。\n\n　　当时还有人问我，说你只说了买，却没有说卖，从赚钱的角度来说，总不能只买不卖吧？我答复说：从赚小钱的角度，你买了之后，只要赚钱超过你的预期就可以卖；从赚大钱的角度，你买了之后，5倍以下的收益就不要卖；从理解货币的角度，你应该把比特币当成真正的钱，当代的信用货币都是垃圾！\n\n　　到了2020年底，我又写了两篇关于比特币价格特点的文章：\n\n　　比特币的遍历性\n\n　　看空比特币，18%的无风险收益率……\n\n　　自那以后到现在，比特币几乎成为最明星的资产，其价格屡创新高并到达今天的6.3万美元。但，我却足足有4个月没怎么写关于比特币的文章。\n\n　　为什么不讨论了？怎么说呢？如果缺乏共同基础的、包容性的思想认知，有时候，解释清楚完整的比特币价格逻辑，是件极其极其耗脑细胞的事儿。更何况，赚钱这事儿，说多了都是废话，能不能赚到这个认知的钱，靠命！\n\n　　有时候，我会想起来，在世界疫情危机最严重的2020年3月份，全球股市大跌、美元爆发流动性危机、市场上的美元现金最紧缺的时候，桥水基金的总裁雷-达里奥（Ray Dalio）却公开讲了一句话：现金是垃圾（Cash is trash）！\n\n　　是的，他说的对，但还不够绝对！实际上，不仅美元现金是垃圾，包括欧元、日元、英镑等在内的当代世界各国的信用货币，全部都是垃圾，没有一个例外！\n\n　　更绝对地来总结：从2008-2009年全球金融危机最严重的时候到现在，信用货币现金，在99%的时间里，都是绝对的垃圾；从1971年布雷顿森林体系崩溃到现在，整整50年的时间里，除了爆发流动性危机的时候，98%以上的时间里，所有的信用货币都是垃圾！由此上溯到1000年前，自人类发明纸币以来，95%以上的时间里，所有的纸币都是垃圾！\n\n　　为什么信用货币的现金是垃圾？\n\n　　因为持有这种东西，随着时间的流逝，不仅不能保护我的财富，反而会让我的财富越来越少，这种东西不是垃圾，难道你还把它当成什么宝贝？\n\n　　“钱”是个什么东西？\n\n　　是衡量你的财富水平，衡量你对这个世界所拥有的信用的东西！如果，有这么一个阴险卑劣的窃贼，每天都在偷走你的财富，每天都在降低你对这个世界的信用，你内心会是什么样的感受？可当代任何一个国家的信用货币，就是每天都在干着窃贼的勾当。要我说，这样的货币，不仅是垃圾，而且是看起来无害但其实带有放射性的有毒垃圾！\n\n　　以美元为例，出于对美元世界货币地位的信任，全世界有相当一部分人，特别是诸如委内瑞拉、伊朗、土耳其这样的国家（很绝妙，这些国家都以“反美”著称），因为本国的货币太不靠谱，他们更愿意拿着美元现金，认为这是保护财富的最佳方式。包括我自己身边的朋友里，也有人会持有相当数量的美元现金。他们以为，美元现金，至少是这个世界上最好的货币……\n\n　　不要说普通人了，就连世界各国央行那些最顶级的金融精英们和决策者们，他们虽然不至于傻傻地拿着美元现金等着贬值，但他们会拿美元现金买美国国债（个别特别精明的，如瑞士央行、挪威外管局等，会把美元买成股票）。毕竟，美国国债每年都有收益，看起来这是个相当不错的主意。\n\n　　大家的选择，看起来都很“聪明”。\n\n　　可惜，在这个世界上，无论是投资还是人生，在短期内看起来最聪明、最舒服的选择，长期来看，通常都是最糟糕的选择。我们都知道，持有一种垃圾，其实有着高昂的隐性成本，而关于持有现金的真实成本，可以有很多种方式来估算。从一个社会上“钱”的总量变化来看，当中央银行印钞推动货币总量以指数方式增长的时候，你持有现金的年度成本，就是每年的货币供应量增速。\n\n　　例如，从当今的世界货币美元来看，2008年初，美联储的资产负债表规模是9000亿美元，现在是7.64万亿美元，如果你始终持有美元现金，就意味着你的财富，在美元计价的所有财富中的占比，缩水了88%，按照13年复合增长率算下来，每年的持有成本是18%。也就是说，过去13年，从财富占比上考虑，持有美元现金，你的财富每年都会缩水18%。——如果这不是垃圾，我真不知道什么东西是垃圾了。\n\n　　有人可能觉得我估算的这个持有成本过高了，人们在真实的买卖中所使用的“钱”，其实统计在广义货币的范畴。好吧，那就统计广义货币看看——从2008年初到现在，美元广义货币M2从7.5万亿变化到现在的19.7万亿，这样计算下来的话，美元现金每年的持有成本，平均在7.7%。这个数字，就是过去13年来，持有美元现金这种垃圾，最低的隐性持有成本——要知道，在这个世界上绝大多数人的眼里，美元已经是世界上最好的货币了。\n\n　　有人可能会说了，美元是可以生息的，可以买入美国国债，获取无风险利率。相比之下，如果拿着比特币，只能拿在手里，根本没有收益，这就是美元的优势。是的，可以买入美国国债，可以获取收益，比方说，从2011年到现在这10年来，美国国债的收益率平均值为2.4%。可惜的是，这个收益是假的，其实是阿拉伯数字骗局！\n\n　　前面已经说过，2008年迄今，美元的价值，按照最好的情况考虑，实际上平均每年被稀释7.7%，看似有2.4%的“无风险收益率”，本质上，是5%以上的负收益率！\n\n　　相比之下，比特币在2011年的时候，正经历其第一轮“牛市”，当时的最高价为30美元，而最低价跌至1美元，相比今天的价格，以美元计价，涨了2000-60000倍——当时的我，还在QQ日志上，为比特币写下第一篇文章：危险的货币。\n\n　　前面已经说过，美元是当今世界各国货币中信用最好的一个，而这个最好的货币，就是让你的财富每年至少损失5%，而相比之下，10年涨了6万倍的比特币，却被视为骗局……\n\n　　其实，如果你愿意把比特币借出去（我绝对不建议他人这样做），比特币同样可以生息，加密货币行业，有很多做借贷的机构，就看你愿不愿意借而已。\n\n　　更重要的是，如果你目前持有比特币，想要美元，且追求所谓的“无风险收益”，就现在，我写文章这会儿，按照现在比特币不同到期日的期货合约价差，你可以赚取年化高达50%以上的收益……\n\n　　不信，看下面的图，是我在某加密货币交易所的截图，当前市场上比特币现货价格大约是62931美元，而10天之后的4月23日，比特币期货合约的价格是64075美元，这意味着1144美元的价差（当然你用其他时间的期货合约价格也可以，时间差越久，价差越大）。\n\n　　这个价差意味着，如果不考虑手续费和买卖价差什么的，你现在买入1个比特币现货，然后卖出一个4月23日到期的比特币期货，10天的收益，是1144美元。如果按照国债收益率那种年化的方式来计算，年化收益是66%，以美元计算，同样是无风险收益……\n\n　　有人可能不太明白这里面是怎么计算的，为什么是无风险收益，具体可参见如下文章：\n\n　　看空比特币，18%的无风险收益率……\n\n　　从保护财富和储存价值的角度来看，现在的美元货币，就是再垃圾不过的东西！从1980年迄今，在各国央行们持续的成功操纵之下，人们居然都相信，40年来，货币利率本来就应该是逐渐下降的，到了现在，零利率甚至是负利率都应该是正常现象……\n\n　　但是，如果用刚才计算的比特币的无风险收益率来算，因为美联储的疯狂印钞，现在美元的真实利率，其实际年化高达66%，几乎是当代历史的最高水平。\n\n　　在过去10多年的时间里，我最大的精力，其实花在了了解各国货币史上，可以自信地说，当前世界主流国家上千年的货币史，我都非常清楚（并且总结成了文档格式），而且可以从货币史角度或者说经济角度，来解释清楚很多世界历史上的大事。\n\n　　整体而言，信用货币到底是个什么德行，我敢夸口说自己比99%的人都了解得更深。读货币史多了，有时候觉得，这个世界上，那些极其不负责任的央行和政府，居然拿着信用货币的把戏，一次又一次地玩弄民众，真是觉得非常悲哀的事情。\n\n　　而且，我曾经写文章说过，如果放宽到100年以上的期限，几乎所有信用货币的最终归宿，都是一文不值的尘土，即便是英镑、美元这两个唯二穿越百年依然存在的信用货币，其价值也都缩水到原来的1%左右。\n\n　　根据我所了解的人类信用货币的德行，当其价值缩水至原来的1%之后，接下来，很快，就会是千分之一，万分之一乃至百万分之一了。\n\n　　当所谓的“世界货币”，其价值都缩水为原来的1%，1‰，1%%乃至1ppm，其他的信用货币，又能好到哪里去呢？总结一句就是：在比特币看来，所有的信用货币都是垃圾，无一例外！",
			"added": 1618401182
		},
		{
			"topic_id": 1619144736,
			"title": "注意，注意！重要，重要！",
			"body": "　　关于这段时间doge的异军突起，以及这几天ETH的逆势走向，我以为有一些很重要的提示。\n　　首先这很可能说明，由于比特币期货等做空工具的引入，使得花街可以利用极大量的传统资本做空比特币而获利，并借此控制比特币乃至数字货币市场的走势，由此花街乐不可支，这当然可喜可贺。不过这也使得比特币很可能，逐步变得不再适合作为币圈的领头羊。\n　　目前币圈大佬们以及许多的散户都已经逐步发现比特币在这轮行情，以至于在上轮行情中自比特币期货开始后，就已经不再有之前一往无前的气势，相反还反复震荡收割币圈的忠实粉丝，并多次在关键时点拉胯，拖累整个币圈，现在已经严重影响到目前整个数字货币领域的正常发展。\n　　从近两年的情况看，币圈没有任何不利因素爆出，相反无论媒体，还是专业金融机构以及大量的专业人士。都已经开始越来越多的发现、认可数字货币的价值，并纷纷开始躬身入局，甚至大规模高调投入，媒体也开始全面转向，特别是疫情期间以美国为代表世界各国尤其是西方传统发达国家都在猛烈地，前所未有地放水。在这种情况下，市场的发展本就应该是一往无前的，甚至是势头远远超过以往的。但作为代表的比特币的走势却是迟缓犹疑压制了整个市场的走向，而且还反复震荡，不停的收割散户。在这种情况下，由于其已经无法起到正常的引领作用，因此。不排除其逐步失去作为数字货币圈起手的可能性。\n　　而且从之前doge异军突起，以及这几天eth的逆势走向看。币圈大佬和部分散户已经开始其他的尝试，以寻找更好的 B圈先锋币，从而引领B圈的牛市， Doge的这一波上涨，包括近几天ETH的，明显强过比特币D的走势，都在暗示这一趋势。\n　　可惜的是doge和eth都有自身的种种问题，暂时恐难担当大任，但如果华尔街大鳄们不停止这种利用比特币期货工具，两边震荡反复收割散户，并导致B圈的整体发展受到严重抑制的情况， B圈上上下下寻找新的先锋币种的这种趋势会日趋明显。\n\n　　对此种情况，希望本群的每一位网友都保持高度的警觉....",
			"added": 1619144702
		},
		{
			"topic_id": 1619791673,
			"title": "今天是2021年4月30日，有一些重要事情，自今日起暂停对数字货币领域的公开评论...",
			"body": "一个至两个月后再恢复。\n对本社区足够信任的希望尽快进群，尽快进群，尽快进群.....\n今天是2021年4月30日.....",
			"added": 1619791638
		},
		{
			"topic_id": 1621326345,
			"title": "央行副行长李波：正研究对比特币、稳定币的监管规则",
			"body": "　　据李迅雷金融与投资公众号今日消息，根据Coin Dance的统计，在全球257个经济体中，超半数经济体认定比特币合法。按照收入水平来划分，在认定比特币为非法或对其进行限制的经济体之中，超过70%为低收入经济体或中低收入经济体，高收入经济体中无一认定比特币为非法。而从对比特币性质的认定上来看，超过60%的经济体认为比特币具有某种程度的货币属性。\n\n　　过去中国也曾掀起过比特币热潮，而监管部门关注到了其可能带来的金融风险，对比特币的态度也逐渐转为谨慎限制。近期在博鳌亚洲论坛上，央行副行长李波表示，正在研究对比特币、稳定币监管规则。而海外发达经济体的部分现有监管措施值得我们借鉴，如不少经济体采用的特许经营牌照方式就取得了较好的监管效果。",
			"added": 1621326309
		},
		{
			"topic_id": 1621505730,
			"title": "恭喜本群会员，从2012年4月30日起，就得到最精准最坚定的提醒，完美躲过此番大跌",
			"body": "现在大家知道为什么我要在2021年4月30日暂停对数字货币领域的公开评论，并反复要大家进群了吧，\n就因为看出了异常！！！纵观整个市场，在全球范围内，能这么早确认相关情况的，只此一家！我们反复强调2021年4月30日，也就是希望大家一起见证这个时刻！\n那么现在数字货币市场是什么情况，牛还在不在，接下来该怎么办，是否加仓，或者甚至梭哈，还是洗手上岸，请务必尽快进群咨询！",
			"added": 1621505693
		},
		{
			"topic_id": 1622469835,
			"title": "周正毅高调生日宴掀风波　传6主持人最新处理结果",
			"body": "中国上海前首富周正毅出狱大办生日宴席，六名官媒主持人现身引发风波。有消息称，其中5位主持人被无限期吊销主持证，房海燕被开除。\n\n　　综合5月31日消息，网传消息称，朱桢、程雷、房海燕、陈蓉、倪琳、戴刘菲六位东方卫视的主持人，因为参加周正毅生日宴遭封杀。其中，没有编制的房海燕被开除。\n\n　　中国商业财经杂志《经理人》5月2日亦称，参与晚宴的5位主持人被无限期吊销主持人证，并将无限期禁止在上海地方台出镜，陈蓉将被解除东方卫视相关职务，房海燕将被解除合同即日起离开。\n\n　　同时，朱桢、程雷、倪琳一年内领取单位最低工资，解除未来两年内全部绩效，同时未来一年内不得在其他地方台露面。\n\n　　此前4月29日，上海广播电视台、上海文化广播影视集团有限公司内部报纸《传媒人》对东方卫视六名主持人参与周正毅生日宴会引发负面舆论后，首次发布处理通报。\n\n　　通报指，“台党委决定：停止涉事主持人参加各级重大现场活动的主持、及节目录制工作，并停播涉事主持人的主持节目、形象代言及公益宣传片，取消年度评优资格，六名涉事主持人作书面检查，并在相关单位召开的管理干部和主持人例会上作通报警示和专项教育。”\n\n　　通报还称，“现已对此事实施党纪立案和政务立案，将会在查清事实的基础上依规进行党纪政务处分。”同时，通报也澄清网络有关“每人收受10万元人民币”的传闻系谣言。\n\n　　据报道，周正毅于4月18日晚在上海外滩五星级酒店举办六十岁生日宴。宴会打出“不忘初心，回归本色”的字样，并广邀名人明星捧场，包括官方上海广播电视台的六名主持人。",
			"added": 1622469797
		},
		{
			"topic_id": 1625850007,
			"title": "对最近市场的一些重要预判和分析",
			"body": "　　以下几个事件，依次发生，主体的级别都不低，但基层金融机构却应者寥寥，这个事情非常重大....\n\n　　首先，5月21日，国务院金融稳定发展委员会（以下简称金融委）召开第五十一次会议，研究部署下一阶段金融领域重点工作。会议指出，金融系统坚决贯彻党中央、国务院决策部署，加大对实体经济的支持力度，打击比特币挖矿和交易行为，坚决防范个体风险向社会领域传递，严惩金融违法犯罪活动。\n虽然第二天币圈价格大跌，但很快便反弹企稳，而且针对这个杀气腾腾的决议，却没有看到各大金融机构积极响应。\n\n　　于是随后：\n　　6月21日，据央行官网，近日人民银行有关部门就银行和支付机构为虚拟货币交易炒作提供服务问题，约谈了工商银行、农业银行、建设银行、邮储银行、兴业银行和支付宝等部分银行和支付机构，要求切实履行客户身份识别义务，不得为相关活动提供账户开立、登记、交易、清算、结算等产品或服务。当日，被约谈的5家银行和支付宝先后发布声明，重申禁止使用其服务用于比特币等虚拟货币交易，并提出了一些应对举措。\n\n　　应该说这个国务院金融稳定发展委员会级别很高，其决议也非常明确，但接下来却并没有几家响应，这个事情本身就几乎是史无前例的。而且即使随后人民银行约谈了多家金融机构，显然这是在针对性地直接点名了，希望他们起带头作用，然而上述这些金融机构依旧没有在约谈后迅速做出反应，既没有发出正式的公告，也没有任何具体的行动。只有农行在数天后抠抠搜搜出了一个公告，而且还在发出后迅速自行删除，直到支付宝也出了一个公告之后，农行才再次发出该公告，显然农行自身并不情愿，而支付宝则无疑是因为马云的关系，不得不出声。至于其他几家则始终没有反应，既没有明确的公告更无实质性动作。\n\n　　由此可见，虽然顶层机构，反复敦促发声，但基层机构，没有任何一家真心支持，而且几乎是不约而同地开始抵制。这种顶层设计被基层联合反对并抵制的事情我以为非同小可。\n　　这不但说明，顶层已经明确脱离了具体的实际，而且其决策机制和程序也明显出现了问题，以至于出现了完全脱离实际的决议仍然能做出来，而且做出来之后依旧完全不被基础接受，甚至是被基层联合抵制的情况。\n　　虽然随后又发了一个什么风险提示，而这一次就更没人听了，在市场上基本没有引发任何价格波动。所以我个人判断，政策面不大可能再出现任何大力度的打压政策，否则非但不可能对数字货币进行打压，相反只会打自己的脸。",
			"added": 1625849968
		},
		{
			"topic_id": 1629822978,
			"title": "从现在起，所有针对新冠肺炎的中医诊疗方案，包括所有相关的药味，药方，针灸取穴，留针等等，必须绝对保密！",
			"body": "所有针对新冠肺炎的中医诊疗方案，包括所有相关的诊断方法，药味，药方，针灸取穴，留针，以及烟熏，灸法等等所有相关方案，都必须绝对保密！！！\n尤其是针对近来各种变异类型病毒导致的肺炎，特别是德尔塔以及后续变异类型的中医诊疗方案，尤其必须作为国家战略级的重要成果绝对保密！！\n同时，对所有类型中药原材料及饮片，必须严控出口数量，其中与新冠治疗相关的中药原材料和饮片，必须作为国家战略资源绝对禁止出口！！！疫苗，检测试剂，消毒液，防护服之类倒是可以无限制出口，必要时可以免费向友好国家免费提供......",
			"added": 1629822938
		}
	],
	"topic_vote": {
		"1612085833_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1,
		"1612708718_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1,
		"1612756376_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": 1,
		"1612878411_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": 1,
		"1612792394_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1,
		"1613200127_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": 1,
		"1613196669_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1,
		"1614690243_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": 1,
		"1614668960_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1,
		"1619144736_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": 1,
		"1621505730_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": 1,
		"1625670101_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1,
		"1622469835_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": 1,
		"1625850007_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": 1
	},
	"next_comment_id": 72,
	"comment": {
		"1609918564_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 1,
				"body": "呵呵..",
				"added": 1610378673
			}
		],
		"1610686589_1JagayLcgq3wK9fJ24Z3RMFepXb92fS9G7": [
			{
				"comment_id": 2,
				"body": "缺乏足够理性的分析，似乎已经钻进了某个胡同出不来了....\n既然用户已经选择了比特币，想让大家再返回去选择所谓最初最原始的比特币，就必须要有理由，单凭一个什么最初，显然是不行的。\n现在已经出现许多非常优秀的数字货币，其中不乏远比比特币技术更好，性能更优的，但即使是技术先进得多，支持智能合约，支付速度更快，Dapp更多的以太坊目前都无法撼动比特币，更不要说所谓的最初的比特币了，更何况你这个所谓的最初还是你自己主观认定的吧？呵呵...\n别太纠结了.....",
				"added": 1610692262
			},
			{
				"comment_id": 4,
				"body": "呵呵，不着急，我们慢慢看....",
				"added": 1611120949
			}
		],
		"1610872035_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 3,
				"body": "##　　二 信息时代的货币\n\n　　上一节我们说到这个时代对货币的新要求，毫无疑问，总的要求一定是利用目前掌握的技术手段，去实现最优越的货币属性、最大的货币价值和最低的货币成本，以满足经济在各个领域的要求，人类自从有经济活动以来一直都在为这个目标而努力。那么虚拟货币/数字货币通过哪些创新，实现了最优的货币属性最大的货币价值和最低的货币成本呢？\n\n　　其实虚拟货币/数字货币对经济的方方面面都是有巨大影响并且可能产生巨大改变的，其中第一个最容易理解的就是无现钞流通或简称无钞流通。无钞流通意味着，所有的交易再也不需要数钱，再也不需要找零，再也没有伪钞，再也不需要投入大量人力物力去研发高精尖的钞票防伪技术，再也不需要投入特殊的纸张油墨和专门的印刷机械和各种验钞机，再也不需要一堆的IC卡和刷卡设备，再也不需要存钞，再也不需要取现，再也不需要去银行排队，再也不需要看银行柜员的脸色（当然我知道他/她们其实也很不容易），再也不会有辛辛苦苦排队1小时，终于轮到你了，却发现一个刚进门的满脸横肉的大姐大摇大摆地坐在了你面前（VIP），甚至再也不需要银行网点，因而也不再需要各种数不清的监控探头和监视设备，再也不需要ATM机，再也不需要每天荷枪实弹精神紧绷地押运现金，同样安保严密耗费巨大的金库也不需要了，守着提款机的爆头哥更不会再有，于此同时，因为电子钱包的先天安全性，即便偷走钱包也无法使用钱包内的钱币，因此单纯形式上的偷窃钱包已经不再有任何意义，甚至街上寻常的抢夺抢劫都会大幅减少，平常治安都会好很多，猜猜看上面所有这些成本一直以来都是谁在付？\n\n　　对包括金融机构在内的企业而言，再也不需要做什么现金盘点了（尤其对金融机构而言，这实在是个劳神费力的事情），现金日记账之类也无需再花费什么心思，未来随着钱包功能的丰富，甚至可能再也无需手工清点各种原始凭证，日常的许多管理，尤其是财务方面的许多工作都会从目前的繁杂琐碎中解脱出来.....\n\n　　千万不要以为这些离我们还很遥远，此前人们大谈的余额宝，其核心秘密就在于某种程度上借鉴了虚拟币的无钞流通：随时购物、随时消费、随时选择理财产品，而无需任何银行网点操作，无需存钱取现找零，省去了所有布设网点人员等的成本，然后将剩下的钱返回用户，对单个用户而言效果就已经很明显，假如数量到达一定级别，比如多给余额宝几年时间，让其依托淘宝和阿里的用户群放手充分发展，尤其如果当越来越多的企业把工资直接发到余额宝或者支付宝时，想想那会多可怕....\n\n　　对数字货币/虚拟货币而言，类似这样的优点还有不少，不过，这些是否就是数字货币最大的好处呢，这是否就是我们需要数字货币/虚拟货币的原因？当然不是，前面这些其实几乎都不值一提，数字货币最重要的革命性贡献，在于发行和信用的创新！是的，和一般认为虚拟货币最大的硬伤在于没有信用来保证兑付相反，虚拟币最大的贡献之一就在于信用的创新，这使得它不但可以成为货币，还可以在另外的重要领域完成比无钞流通更重要更紧迫而且法币从始至终都无法完成的任务。",
				"added": 1610878168
			}
		],
		"1611125162_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 5,
				"body": "当然我这说的是对自己有些要求的人，如果只是想赚点钱，发点财，那自当别论，完全不必要，也不需要对自己要求这么高...",
				"added": 1611125321
			}
		],
		"1611379590_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 6,
				"body": "\"构建数字化金融平台同时也应是实现我国经济高质量发展的基本前提\"，这个数字金融平台，其意义远超当初的证券交易所或者期货交易所，只是绝大多数人还在梦中.....",
				"added": 1611380250
			}
		],
		"1611387493_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 7,
				"body": "从这个内容看，该申请没有任何创新技术内容，收取钱包生成指令和必要信息，以生成数字货币钱包，这个完全是本领域公知技术，所有的在线钱包都是这么做的。而在线钱包这个东西至少5-6年前就已经烂大街了，公开文献资料应该随便检索就一大把吧。\n另外，该专利申请其方案实质应该就只是在完成上述内容同时，还同时将相关用户信息发发送给了另外一个登记机构的服务器端，以进行登记和注册，这种内容在本领域可以说30年前就已经是最基本1+1技术了。\n这种东西也拿来申请专利，我确实是不理解.....",
				"added": 1611489038
			}
		],
		"1611580236_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 8,
				"body": "估计还要不少时间...",
				"added": 1611748758
			},
			{
				"comment_id": 9,
				"body": "估计还要不少时间...",
				"added": 1611748789
			},
			{
				"comment_id": 10,
				"body": "估计还要不少时间...",
				"added": 1611748831
			}
		],
		"1610712728_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 11,
				"body": "在周四彻底让GME从股票列表消失之后，今天(周五)券商罗宾汉允许散户投资者每人买入一股GME，自由的市场经济的灯塔...\n可惜不知道怎么贴图...",
				"added": 1611989547
			},
			{
				"comment_id": 13,
				"body": "> [franksky](#comment_33_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b): 股市的盘外招引发了不少事情，对抗一旦加剧，就可能引发混乱，然后军队或许就能顺利入场了，华尔街犹太富豪务必要考虑到这一点，自己的死穴不是P民，而是裹挟了民意的武装暴力集团...\n----------------------\n最新消息美国gamestop貌似空头认输离场了，空头头寸从140%有了明显下降。\n妥协是对的，现在可不比2008年，那时候根子还比较硬可以用强，现在，只要一乱，军方就可能正式走上政治舞台，历史上犹太富豪被军头洗劫可不是一次两次了，而这次如果乱了，则很有可能会是军头和暴民联合洗劫，孰轻孰重不难判断.....",
				"added": 1612242302
			}
		],
		"1611912258_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 12,
				"body": "在周四彻底让GME从股票列表消失之后，今天(周五)券商罗宾汉允许散户投资者每人买入一股GME，自由的市场经济的灯塔...\n等同于比大小的赌局，却只准散户出小，机构则可以随意出多大，只许我打你，不许你出招，这还能玩儿得下去？？",
				"added": 1611989754
			}
		],
		"1612257384_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 14,
				"body": "掌握了武装力量的强力人物利用社会的混乱和底层不满上台，采取强力措施制止混乱而获得权威，并通过挤压财团获得巨大财力，从而让社会重新恢复秩序焕发生机，并由此进一步对财团施加压力，从而获得更大的财力，权力和权威，这就是当年元首的做法...",
				"added": 1612258522
			},
			{
				"comment_id": 15,
				"body": "现在开始为期60天的军队肃反，无疑是意识到了相关危险，不过肃反从来都是浩大的工程，如此仓促上马效果不好说....",
				"added": 1612505106
			},
			{
				"comment_id": 16,
				"body": "另外拜登此次内阁如此多犹太，如此明显地到前台这很不见得是好事，如果各种矛盾处理不好，底层的指向性肯定会更明确....\n疫情、经济、党争、种族这么多问题能处理好吗？",
				"added": 1612510483
			}
		],
		"1610602858_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 17,
				"body": "顶一下...",
				"added": 1612671505
			}
		],
		"1612756376_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 18,
				"body": "越来越多的重要人物开始关注，越来越多的人开始改变态度，慢慢等着量变逐步积累，直到产生质变......",
				"added": 1612756664
			}
		],
		"1612413970_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 19,
				"body": "如果犹太富豪对后续局势有基本判断，那肯定会做相应的安排，至少会将一部分资产转入比特币，这是目前看来最便捷、最隐匿、最稳妥，也最安全的资产转移和保全途径。\n要将其一部分资产转入比特币，那我们可以初步估算一下需要涨到多少才能容纳，为了确保转入资产的安全，还必须通过媒体对比特币的价值进行大幅度确认和普及，相信这些慢慢都会看到....",
				"added": 1612849917
			}
		],
		"1612678756_14D72Zz5EhGScdaomBP2fR6bfdk4Bc8v9u": [
			{
				"comment_id": 20,
				"body": "趋势肯定是涨，对能涨多高暂不做判断，目前情况也不适合过早对趋势顶部做判断，不过我认为不把黄金拉下马，不能给天量的犹太资本至少一部分避难，这一波涨幅意义就不大...",
				"added": 1612852469
			}
		],
		"1612792394_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 21,
				"body": "美国共同基金经理、特斯拉主要股东之一Ronald Stephen Baron表示，特斯拉最近购买比特币对他来说并不意外，“我敢肯定，特斯拉收购比特币的过程经过了很多思考，我期待了解其中的原理。”Baron还指出，这些大型机构投资者的举动显然是比特币大规模普及的先兆。 ​\n　　老实说，作为资深的金融专业人士，基金经历，时至今日对比特币还不了解，到现在还需要再去学习其原理，是不太应该的。",
				"added": 1612878653
			},
			{
				"comment_id": 22,
				"body": "> [winder](#comment_21_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv): 美国共同基金经理、特斯拉主要股东之一Ronald Stephen Baron表示，特斯拉最近购买比特币对他来说并不意外，“我敢肯定，特斯拉收购比特币的过程经过了很多思考，我期待了解其中的原理。”Baron还指出，这些大型机构投资者的举动显然是比特币大规模普及的先兆。 ​　　老实说，作为资深的金融专业人士，基金经历，时至今日对比特币还不了解，到现在还需要再去学习其原理，是不太应该的。\n\n不过这大概说明对比特币，恐怕真要搞人人过关，个个表态，金融圈更不例外....",
				"added": 1612880530
			}
		],
		"1613030525_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 23,
				"body": "有消息说，特朗普打算搞自己的APP，自己的媒体平台.....",
				"added": 1613032453
			}
		],
		"1613031652_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 24,
				"body": "苹果、推特、亚马逊、谷歌、微软、英特尔......人人都要过关。\n下面看谁先交卷....",
				"added": 1613032774
			},
			{
				"comment_id": 28,
				"body": "这波调整就是为这些机构进场过关创造条件....",
				"added": 1614174320
			}
		],
		"1613196669_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 25,
				"body": "人人都要过关，个个都得表态，越是有头有脸的，越是必须表态，否则就显得low....",
				"added": 1613200918
			}
		],
		"1613638129_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 26,
				"body": "去年夏天如果真的卖房买币了，只要不碰杠杆，合约，抓住主流币，财富自由是必然的，当然这些在主流媒体肯定看不到....",
				"added": 1613640225
			}
		],
		"1614138470_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 27,
				"body": "总体而言，任何一个普通人，如果这一波调整还没有进入，那BTC基本上就和BTC无缘了，在这个世界上，真正美好的东西，从来是不够分的....",
				"added": 1614145549
			}
		],
		"1614690243_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 29,
				"body": "都在表态了，有些话说晚了，就代表不够聪明，不够专业，将来必定会处在鄙视链的底层....",
				"added": 1614690297
			}
		],
		"1614138931_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 30,
				"body": "这应该也是普通人最后一次能拥有比特币的机会了，之后，比特币就与普通人没有关系了....",
				"added": 1614783445
			}
		],
		"1615988265_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 31,
				"body": "早表态，早解脱，早获利...",
				"added": 1615988322
			},
			{
				"comment_id": 32,
				"body": "有了这个表态，他在鄙视链上的位置肯定不会低，其他人，尤其是当初曾经对比特币表达过负面观点或情绪的，恐怕要早做决断....",
				"added": 1615989332
			},
			{
				"comment_id": 33,
				"body": "有了这个表态，他在鄙视链上的位置肯定不会低，其他人，尤其是当初曾经对比特币表达过负面观点或情绪的，恐怕要早做决断....",
				"added": 1615989351
			}
		],
		"1616041178_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 34,
				"body": "毫无疑问，灰度是是位于数字货币鄙视链最顶端的机构，其他机构要小心了，位于鄙视链中下部位的人和机构将在不远的将来遭遇到重大挫折。\n特别是那些其中位于鄙视链下部和底部的所有的人和机构，无论其在哪个行业，人们都将避免与之为伍，否则自己也将被别人看成Low，业务下滑倒在其次，关键是将被边缘化。\n某些几百年的商界、金融界领袖，将由此逐步告别舞台，并被无数后来者引以为戒.....",
				"added": 1616041480
			}
		],
		"1616039832_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 35,
				"body": "其他机构，尤其是混金融的，必须立刻跟上，很快，在数字货币鄙视链上的排位，将决定这些机构未来的业务量和客户级别，一旦在数字货币鄙视链上排位稍稍靠后，高端客户就与之无缘了，如果再靠后一点，任何稍有品质的客户都将刻意避免与这样的机构有瓜葛...",
				"added": 1616042789
			}
		],
		"1614782083_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 36,
				"body": "摩根斯坦利都已经跳船了，其他机构，尤其是混金融的，必须立刻跟上！\n很快，在数字货币鄙视链上的排位，将决定所有这些机构（甚至包括非金融的绝大多数其他领域）不远的将来的业务量和客户级别，因为在鄙视链上的位置实际上明确代表了智商、认知和本领域的专业能力。因此一旦在数字货币鄙视链上排位稍稍靠后，高端客户就与这些机构无缘了，如果再靠后一点，任何稍有品质的客户都将刻意避免与这样的机构有瓜葛。\n而所有这些机构的专业人员，也同样面临类似的挑战，所以早做决断才是最重要的，危机来临你不必真的跑过危机，但一定要比你身边的人快...",
				"added": 1616044737
			}
		],
		"1616318673_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 37,
				"body": "呵呵，各国的监管部门也都开始在数字货币鄙视链上排队抢位子了.....",
				"added": 1616318876
			}
		],
		"1616475728_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 38,
				"body": "古今中外，所有富豪们被军头洗劫，基本都是因为对乱世，特别是对乱了之后的秩序抱有某种一厢情愿的主观幻想，所以早做准备，特别是早做最坏的准备，最后的损伤才会小，当然，如果认为做好准备就可以不遭受任何损失，这个就更是傻逼在梦中才会实现的幻想....",
				"added": 1616562939
			},
			{
				"comment_id": 39,
				"body": "事情好像确实在迅速蔓延，各种洋品牌都被波及，民族品牌合不拢嘴倒也罢了，关键是普通民众作为消费者，一个个兴高采烈，奔走相告....",
				"added": 1616731049
			}
		],
		"1616736271_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 40,
				"body": "这个当口还拿人权说事，而且挑的还是棉花，当年贩卖黑人不就是为了让他们在种植园的棉花地里当奴隶吗，现在不绞尽脑汁让别人忘了，还主动拿这个说事，sigh...",
				"added": 1616737562
			},
			{
				"comment_id": 41,
				"body": "本坛不是已经反复强调了吗，陷入泥潭不要胡乱挣扎，只会越陷越深的，正确的路也早已经指明了。实在不行你们出点血，让本坛一众高手给你们出个详细方案...",
				"added": 1616737735
			}
		],
		"1616858562_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 42,
				"body": "这么多年的证券市场建设，那么多人，忙活那么多年，出台那么多政策，投入那么多钱，最后搞出来的就这些.....",
				"added": 1616858653
			}
		],
		"1616318443_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 43,
				"body": "　　总体来说，拜登比特朗普更难对付，让其轻松上位，实在实在是战略级别的重大失误。之前某个时间段的应对，以中国的整体战略而言，大致有以下种可能，按顺序排列分别是：\n　　最好的结果是：米帝因为选举作弊，党争，种族歧视，疫情等等造成混乱，并进一步发展，甚至产生内乱，这当然很难，但至少应促成局面向这个方向发展，这种情况哪怕只是持续一段时间对中国都是极为有利的.\n　　比较好的结果：米帝因为选举作弊，党争，种族歧视，疫情等等造成混乱，但最终特朗普连任，特朗普还是比较好应对的，他专注在经济，米帝工业重建等领域，这对美国对中国都是有利的，一方面有助于从根本上缓解美国内部矛盾，另一方面对中国的攻击性不强。\n　　特朗普在台上数年虽然咋咋呼呼，但从始至终没有对中国的软肋真正发力，我不知道是他没有发现中国的软肋还是知道，但就是不发力。\n　　比较差的结果是：米帝因为选举作弊，党争，种族歧视，疫情等等造成混乱，但最终拜登赢得大选，如前所述，拜登比特朗普难对付，我的感觉是他明确知道中国的软肋。从其政策走向看，他的着力点在加强对中国的攻击性，尤其是某些软肋的攻击性，对美国国内的各种问题，没有任何建设性构想，甚至在促使某些问题继续发酵。因此这其实是对中美两国都比较糟糕的结果，显见的可能是中美走向新的更高强度的，乃至多领域对抗。\n　　更差的结果是：中国毫无作为，以至于拜登轻松获得大选，如前所述，拜登比特朗普难对付，中美走向更全面的对抗，而不仅仅是经贸领域。\n　　更差更糟糕的结果是：中国主动作为，帮助拜登轻松获得大选。拜登政府没有经历任何混乱，顺利掌控政权并迅速开始针对中国的计划....\n　　最差最糟糕的结果是：中国不管不顾全力作为，全心全意帮助拜登轻松获得大选，甚至让特朗普团队心生怨恨，没顾忌肆无忌惮地挑衅，并迫使中国不得不付出代价，而拜登方面则对中国的帮助和主动示好丝毫不领情....\n\n　　最终的结果是什么，显然是明确的.\n　　另外，由于前述不管不顾，特朗普最后确实没了顾忌，以至于有政府高层出面直访台湾的计划，这可以说是史无前例的。美国常驻联合国代表克拉夫特原定于１月12日从华盛顿出发直飞台湾，结果其乘坐的客机在空中硬是盘旋了近4个小时，最终取消了访问台湾。对此网上有说法是什么中国最后放了狠话，迫使美方放弃访台等等等等。不过我倒是注意到另外一个情况，就是在那天，paypal全资控股了某个中国的支付公司。消息来源是每日经济新闻，发布时间: 1月11日晚21:0，随后多家媒体纷纷报道：PayPal 全资控股国付宝，有望成为首家外资全资控股支付机构。\n　　希望所有这些都是我想多了....",
				"added": 1616996298
			},
			{
				"comment_id": 45,
				"body": "悲催的事情是，从特朗普政府最后几天的表现看，他其实很可能一直都知道中国软肋是什么....\n他好像最后还放过了抖音，各位琢磨出什么味道没有...",
				"added": 1616998265
			}
		],
		"1616941485_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 44,
				"body": "可以肯定，数字货币鄙视链上他的位置肯定不低，我相信未来不久之后，是否拥有一定数量的比特币将会是所有比较高端圈子的身份标识，同时还要看数字货币鄙视链上的排名，而要进某些更高端的圈子，这个排名甚至比比特币的数量更重要...",
				"added": 1616997843
			}
		],
		"1618063871_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 46,
				"body": "国人确实是厌恶而且是高度厌恶战争的，千百年都是如此，或许是时候让国人知道战争的好处了.....",
				"added": 1618068984
			},
			{
				"comment_id": 47,
				"body": "　　从理智上说不希望中国卷入战争，但是从心情上说呢，其实是很希望能进入战争，我现在心里比以往任何时候都充满戾气，呵呵......\n　　不过显然只能靠其他国家帮忙，印度现在是学乖了，打死都不肯开第一枪，下面就看小日本（估计也不敢），其他国家估计借个胆子看敢不敢，美国更不例外。如果开核战，那就真的最好不过了....",
				"added": 1618127450
			},
			{
				"comment_id": 48,
				"body": "　　打常规战争中国未必能平推世界，但打核战，尤其是新冠疫情条件下的核大战，中国是绝对能平推世界的，所以我现在越来越希望打核战。\n　　以前对毛主席说的早打大打打核战争总是不太能理解，总觉得核战这种事能够不打当然还是不打的好。通过和平的方式我们同样能完成民族的复兴，何必一定要打打早打核战争。\n　　通过这些年对中国、世界的了解，特别是藉由新冠疫情，对海外一些国家一些政治人物一些上上下下各种人物的观察，我感觉毛主席这个论断是非常有高度的。论极端条件下的生存能力，和极艰苦情况下的工作能力、战斗能力，其他国家真是完全不够看的，这早在美国西部大修铁路时代就足够清楚了，自抗美援朝，抗美援越以后就更不用提了。因此，相对常规战争，核战条件下更能体现中国文化优势和国民素质优势，而且由于国人的心性，常规战争很容易打到一定程度就不愿再打，甚至沽名学霸王，遗留祸端，而核战就不一样，一旦开始，除了进行到最后，没有其他的选项。\n　　而且从现在总体的情况看，无论是从国内自毛主席时代以来各种三防建设，还是现在的经济发展情况以及近年来国际环境的情况，特别是疫情以来世界上其他国家的情况综合来看，现在打大规模核弹比当初毛主席那个时候对中国有利太多太多了。\n　　奈何核战的开关不在国人手中，而是在一群胆小鬼手里，所以希望希望他们鼓起勇气，这至少比搞病毒要man一点，哦不，是man很多....",
				"added": 1618199172
			}
		],
		"1618401215_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 49,
				"body": "这大概是近年来看到的最好的一篇文章了．．．．",
				"added": 1618401434
			},
			{
				"comment_id": 51,
				"body": "此文论调与过去所有主流媒体的论调都不一样，甚至截然相反，其他人我不想多说什么，但P民要注意。\n主流媒体的腔调很可能要大变，甚至不排除其中一些会180度大转弯，以往谈到比特币，总是一堆代表性词语：“庞氏骗局、传销、洗钱、郁金香”等等等等，说不定明天一早起来，所有主流媒体就都改口了，谈到比特币，都跟上另一堆代表词语：“创新、发展、开拓、变革、未来”等等等等......",
				"added": 1618472152
			},
			{
				"comment_id": 52,
				"body": "对这些媒体，以及文章作者而言，这并没有什么不对头的地方，因为这些文章的作者们对自己以往写的东西，说的话，从来就没有信过，所以过去说“庞氏骗局、传销、洗钱”是正确的，现在说“创新、发展、开拓、变革”也同样是正确的，这并没有什么不合适的地方。但普通P民怎么办？特别是那些笃信主流媒体，每天盯着新闻联播的人怎么办？\n所以P民最基本的修养就是要能迅速调整心态，快速跟随主流媒体，千万别强着，以免像鱼干一样，被晾在河岸上。",
				"added": 1618472336
			}
		],
		"1618390973_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 50,
				"body": "可以确认，该委员在数字货币鄙视链上的位置非常高.......",
				"added": 1618401651
			}
		],
		"1617105823_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 53,
				"body": "很多大机构显然早都在偷偷布局。还有王姓大佬暴出，13年就已经买了比特币之类的传奇，也不知道真假。\n不过，显而易见的是，比特币或许真成为一种时尚了，台面上混的，基本都要表个态，但凡沾点边，哪怕是之前被人送过一两个的，都要拿出来显摆一下.......",
				"added": 1618478653
			}
		],
		"1618818030_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 54,
				"body": "　　确实是要为实体经济服务。单纯纠缠数字货币、数字资产等字眼和纯概念其实并没有什么大的意义，主要还是看对实体经济的支持。\n　　目前中国经济的一个大问题就是，无论怎么放水，资金就是进不了一些实体经济，尤其是一些新兴的，小众一点的实体经济领域，因为风险大，而且没有现成的，成熟的风险和收益评估模式，甚至都没有积累到足够的数据，因此无论如何资金就是进不去，银行打死也不肯贷款。\n　　于是资金只会进一些成熟的行业，一些大企业，或者是进入一些表面上光光亮亮的影子银行，然后这些影子银行把资金价格加高一倍再提供给那些新兴的小企业。有时候甚至即使这样，仍不肯提供资金，而是宁愿再把资金给一些二级影子银行，然后这些二级影子再把资金价格提高，再提供给那些新兴的小企业，而这些小企业根本没办法，因为几乎没有其他的融资渠道....\n　　而经济未来的希望，经济体的活力，单单靠大企业是肯定不行的，更要看这些新兴的小企业，所以类似这样的情况，如何通过数字货币来破局或许是个很好的课题.....\n　　等这些新兴的新领域的小企业逐步成长，有了相应的数据和业绩积累，行业也逐步成长，大银行能看清了，然后接下来，相关业务再由大银行接手，数字货币和数字资产再去寻找新的，更新的领域，新的，更新的企业，我想这样或许就能形成法币和数字货币的某种协同，形成整个社会资源在时间上、空间上、以及不同行业领域和企业层级方面的梯次配置了.....",
				"added": 1618821024
			},
			{
				"comment_id": 55,
				"body": "　　这些新兴领域，新兴企业肯定风险是肯定不小的，所以会有相当一部分最终失败，投入其中的数字货币或者数字资产也会被消耗掉。但又不能因此放弃对这些新兴领域和新兴企业的支持，所以目前来看这个风险只能是由数字货币领域的人、机构和资金来承担，其他人、其他机构通常都是无论如何不肯的，包括绝大部分所谓的风险投资人和风险投资机构。\n　　对等地，国家对数字货币领域适当给予一些宽松，也合情合理.....",
				"added": 1618822595
			}
		],
		"1619144736_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 56,
				"body": "如此一来，通过比特币拉爆黄金收割全球从而摆脱困局的整体方案就会出现变数。\n特别是万一比特币不再是币圈大旗，或者哪怕出现有力的挑战者，其他人想入局就不得不面对各种选择，不得不做各种考量，出现各种犹疑，这些都是变数。希望花街方面对“困局”一词有足够深刻的理解，切勿因小失大。\n\n贪小利而忘大事，临国难而惜财帛，此亡国毁家之道也.......",
				"added": 1619147734
			}
		],
		"1617985305_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 57,
				"body": "数字货币可不是只有比特币一种，而且目前数字货币领域，如果单单就性能、技术、创新，甚至盈利能力等而言，比特币都已经与前沿币种有差距。\n所以切勿滥用比特币已经所剩不多的优势，切勿贻误战机，否则恐万劫不复！！！",
				"added": 1619148747
			}
		],
		"1610959805_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 58,
				"body": "顶一下这个贴，深刻体会一下拉爆黄金，收割全球的含义。",
				"added": 1619149385
			}
		],
		"1619791673_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 59,
				"body": "重复，对本社区足够信任的希望尽快进群，尽快进群，尽快进群....",
				"added": 1620279970
			},
			{
				"comment_id": 60,
				"body": "有些观点如果在这里说，对群内的用户不公平，因此，希望大家尽快进群！！！",
				"added": 1620280658
			},
			{
				"comment_id": 62,
				"body": "现在大家知道为什么我要在2021年4月30日暂停对数字货币领域的公开评论，并反复要大家进群了吧，\n就因为看出了异常！！！纵观整个市场，在全球范围内，能这么早确认相关情况的，只此一家！我们反复强调2021年4月30日，也就是希望大家一起见证这个时刻！\n那么现在数字货币市场是什么情况，牛还在不在，接下来该怎么办，是否加仓，或者甚至梭哈，还是洗手上岸，请务必尽快进群咨询！",
				"added": 1621505200
			}
		],
		"1621325172_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 61,
				"body": "马后炮！",
				"added": 1621326356
			}
		],
		"1621672453_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 63,
				"body": "呵呵，我也很想看看有关部门到底是不是三头六臂，看看这次又能玩儿出些什么花样，整出些什么花活....",
				"added": 1621916012
			}
		],
		"1625850007_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 64,
				"body": "　　还有，这个金融什么委，将来的日子恐怕会非常难过，因为基础金融机构已经在私底下一致认定其决议完全不符合实际，甚至完全不专业的程度，今后说话恐怕不会太好使....\n　　另一方面，基本上可以认定，这几年，全球范围内已经有越来越多的人和专业机构，开始不断认识并了解数字货币，相当一部分人和机构对其的认识已经到了一个相当深入的程度，尤其海外的许多机构，而某大国的高层这么多年下来，几乎毫无长进，其对数字货币的了解仍然停留在7、8年前的状态。而且各大金融机构对于这种情况看得清清楚楚，以至于不约而同地有了某种共识，否则不会如此共同抵制......",
				"added": 1625850410
			},
			{
				"comment_id": 65,
				"body": "　　这个情况反应的是否仅仅是币圈的情况？在其他领域是否也同样与实际脱节，是否也同样存在着没有与时俱进的情况，是否也同样存在着决策机制方面的问题，也存在这不被基层认可，只是没有如此明确地暴露出来？",
				"added": 1625850662
			},
			{
				"comment_id": 66,
				"body": "基本可以明确的是，接下来相当一段时间肯定不会有针对币圈的打击政策了，那么币价是否会因此大涨呢？请大家尽快进群，请尽快进群！",
				"added": 1625850797
			},
			{
				"comment_id": 68,
				"body": "比较有意思的是农行，由于宣布对进行数字货币交易的账户可以进行冻结等处理（实际上这种行为显然是违法的），必将导致大笔资金从该行逃离，去其他银行，而且一定是去那些不对数字货币交易账户进行处理的金融机构，包括支付宝，都必定将面对资金出逃到微信的情况......",
				"added": 1625891225
			}
		],
		"1622469835_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 67,
				"body": "呵呵呵呵，拿一个已经服完刑的人说事可不算本事。去看看国知局，专利局、知识产权法院是怎么瞪着眼睛瞎扯的吧，看看他们是怎么把连篇的病句，连初中水平都不到的文字写进判决书的吧。\n　　看看他们怎么把明确违法的无法完成任何交易，并且完全违法，而且是明确违反合同法，乃至刑法等多项法律法规的东西，作为合法合规的标准内容，而且还堂而皇之地拿到法庭，来评判标准的吧。",
				"added": 1625890857
			}
		],
		"1626686044_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 69,
				"body": "我什么都没有看到，也不想看到什么，如果是以前我一定会努力去看，去寻找，去分析，但现在，我只想站在一边冷笑....",
				"added": 1626694963
			}
		],
		"1627975446_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 70,
				"body": "我现在只想站在一旁冷笑，当然我笑的只能是我自己，呵呵......",
				"added": 1627983557
			}
		],
		"1629644367_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 71,
				"body": "> [franksky](#comment_93_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b): 看来这个世界上，傻逼的三次方都不少，好吧，我错了....\n\n呵呵，看他们说货币金融，尤其说比特币，那才真是群口相声......",
				"added": 1635089310
			}
		]
	},
	"comment_vote": {
		"2_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": 1,
		"17_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1,
		"15_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": 1,
		"22_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": 1,
		"26_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": 1,
		"45_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": 1,
		"56_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": 1,
		"63_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": 1
	}
}