{
	"title": "\tDeepstrelok\t",
	"description": "My blog on english",
	"links": "*   [My RU blog](http://127.0.0.1:43110/16iQBM3knDTDuNeLdAexKAUNLbE1nYeAc9/)\n\n*   [Joe Talks](http://127.0.0.1:43110/1DCApr9WK3oQjfgg5zs4nK2RqB4PGtwbqA)\n\n*   [Mail](http://127.0.0.1:43110/Mail.ZeroNetwork.bit/?to=deepstrelok)\n\n*   [ZeroMe](http://127.0.0.1:43110/me.zeronetwork.bit/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh/deepstrelok@zeroid.bit)\n\n**Donate :**\n\n_BTC_ - `1J3d3tJYCHGApQGpBZPtQEXpkz6yXuqsUj`",
	"next_post_id": 10,
	"demo": false,
	"modified": 1528452269,
	"post": [
		{
			"post_id": 9,
			"title": "Minimum level of your Paranoia",
			"date_published": 1528451555.185,
			"body": "Some thoughts about how to understand what anonimity you needed in the different cases.\n\n* * *\n\nI always hear from other people that they don't needed my advices about online and another kind of their privacy.\nTheir position - dont speak about anything of criminal or political or some else danger. And so their life will be happy!?\n\nMay you use different ranges of privacy for each other? May you say that in that situation it's enough for you? I say no.\n\n\"Now i enough safe because for this anybody not seek for me.\" \"Now i use this private method but only one because i did not sufficient criminal for big brother wathing.\" And another bullshit.\n\nI think that if you really don't give up your private information, your privacy and anonimity in some cases must be at maximum. Because only when you feel safe, your identity in Internet may be really freedom and powerfull.\nWhen you not fear to say anything and do anything, you can be yourself.\n\nAnd if you want to be free in the Internet, you must do full separation of your identies from your real life and your really dangerous information.\n\nSome advices i will give you in next posts of my blog."
		},
		{
			"post_id": 8,
			"title": "Deep enter",
			"date_published": 1527599027.759,
			"body": "Loneliness is the guarantee of freedom"
		}
	]
}