{
	"next_topic_id": 12,
	"topic": [
		{
			"topic_id": 1,
			"title": "狗、习近平与中国人的耻辱！港澳台和大陆联合起来！— 郭文贵维权展望",
			"body": "狗、习近平与中国人的耻辱！港澳台和大陆联合起来！\n— 郭文贵维权展望，港澳台和大陆联合起来，突破封锁！零网 — 零封锁、广传播\n\n雾霾天朝为了逼迫亿万网民们就范，竟然逼迫伟大的习核心把推特页面都煞斯崩掉了( https://twitter.com/xijinpingchn is Suspended )。\n\n在雾霾天朝掌控的网络柏林墙上，赫然刻着几个大字：\n狗、习近平与大陆的中国人不配进入文明世界！\n\n雾霾天朝还企图用这种方式进一步奴役香港、威胁台湾、渗透美国之音、玷污文明世界！\n\n为了维护香港法治、拯救大陆、维护文明世界，更重要的是，为了帮助伟大的习核心废除辱习反华的法西斯围墙，港澳台和大陆团结起来，公开准备发起非暴力爱国运动。请墙内外的同胞们广泛传播习氏翻墙救国正能量，力挺习核心，翻墙不要龟缩！\n习核心雄起、习核心不龟缩！中国梦不是狗的梦！\n废除辱习法规、洗雪当代国耻！\n\n\n2017，郭文贵爆料掀起了群情激愤的怒潮，可以预见的是，运动一旦发起，必然是摧枯拉朽、势不可挡！鉴于香港的人员组织比较自由，请更多香港同胞加入零网，公开探讨非暴力爱国运动。\n\n\n[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)\n[转：洗雪当代国耻、废除辱习法规！ 零网 — 零封锁，广传播 ](http://127.0.0.1:43110/NewGFWTalk.bit/?Topic:1_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)\n\n把公网页面转换为http://127.0.0.1:43110/ ......  开头的零网本机页面，是零封锁的网络创举！零网本机页面，需要零网软件浏览。\nhttps://zeronet.io/",
			"added": 1494073963
		},
		{
			"topic_id": 2,
			"title": "共同呼吁习近平不要造孽！",
			"body": "共同呼吁习近平不要造孽！\n— 释放释大成、维权律师暨全民维权运动\n\n致雄安大梦千年罕见的圣人领袖习近平先生：\n\n文革五十周年刚过不久，在伟大领袖习近平先生的英明统治下，佛教高僧释大成法师即因言获罪，于公元2017年5月14日被邵阳市警察及网监部门联手抓捕，成为首名因转发郭文贵讯息而被抓的人士。\n中国大陆当局在2016年曾公开信誓旦旦地宣传不搞文革，但一系列事件却表明，所谓的“依法治国”是披着“法治”外衣的文革瞎折腾。作为泱泱大国高度自信的领袖，习近平先生各种自相矛盾的治国思维让网民们很费解，很有必要对于民众的质疑予以公开回应。\n崇尚法治可能是习近平父亲习仲勋先生曾经有过的梦想，如果要制造大规模的言论罪，建议习近平先生不必玷污习仲勋曾有过的光环，直接向广大军民宣称：这不是依法治国，而是试图模仿毛氏“文革“的习氏“文革”。\n郭文贵远在美国，竟然都可以给郭文贵发出“红色通告”，制造罪名，那么既然是要效仿毛氏“文革”，为了让又红又专的“习氏文革”更加无法无天地到处横行，直接给支持文贵维权的亿万草根百姓贴上“反革命”、“黑五类”之类的罪名，公开大肆抓捕就得了，何必挂着“法治”的牌坊呢？\n挂着“法治”的牌坊，又不依据任何法律程序，在高瑜事件之后持续制造各种言论罪，在709律师大抓捕之后，如今又抓捕佛门高僧，这种比满清专政余孽更野蛮的思维，怎么能称得上是“法治”呢？\n如果是要大规模地复辟文革，建议习伟人更改姓氏，改为毛近平。这样，世人就没理由因为崇尚习仲勋先生曾经有过的光环，而以这种光环期待、督促习伟人的法治走上正轨。\n如果习伟人仍然要披着习仲勋的光环搞依法治国，那么，对于抓捕佛门高僧的事情，就不能藏藏掖掖，而是以正大光明的方式给广大群众一个清楚的解释！\n\n+ 满清高压专政能够维持近三百年，有一个前提，就是信息文明不发达，而且数亿民众多数是文盲，只懂得高呼“万岁”，没有“维权”概念。 毛氏文革当年能够得逞的部分因素也是因为多数人是文盲。 军队高层将领刘源的父亲刘少奇当年被人间蒸发，此后伟大的林副统帅被“坠机”。尽管毛氏文革的各种丰功伟绩罄竹难书，但是在九一三坠机事件后，文盲群众也不愿意为毛万岁鼓掌了，导致毛万岁很快撒手西去。\n大历史的轨迹清楚地告诉世人，即使毛万岁复活，也无法制造大规模的毛氏文革了。披着习仲勋光环的习伟人，何必一定要变成毛近平呢？如果习伟人真的具备毛近平那样的自信，可以公开尝试，把俄罗斯人民不想要的列宁遗体搬到天安门广场来，让列宁亲自为一群“粪坑党”“蛆虫帮”的自信助威，看看有多少人会认同？\n尽管腐败遍地都是，但是广大军民中，有很多人是不愿意被卷入“蛆虫帮”式的粪坑反腐的派系斗争中，那些连财产都不敢公布的“共产党”官僚实际上是“匿产帮”，“粪坑党”“匿产帮”试图让数千万没有特权腐败的党员群众与蛆虫一起跌入粪坑的图谋，是不可能得逞的！\n\n伟大领袖习核心在过去几年的各种丰功伟绩可能争议很大，其中最没争议、最伟光正的事迹应当属于翻越网络柏林墙，不经意间似乎有点要统一虚拟主权的意思。但是法西斯重庆居然冒天下之大不韪，把习核心的翻墙救国精神污蔑为犯罪。\n\n+ 面对法西斯重庆反华辱习的恐怖主义信息政策，习伟人吓得把推特页面都隐藏龟缩起来(https://twitter.com/xijinpingchn is Suspended这个推特页面被煞斯崩掉了)，不但没有展示出比前苏联男儿更勇敢的品质，而且连世人所期待的习仲勋后代该秉持的风范都丢掉了。如果习近平真得具备比苏联男儿更刚烈的品质，面对此等辱习反华的发动围墙，无法突破却反被逼迫得龟缩后退，就该剖腹自杀，向天下谢罪了。鉴于习近平连习仲勋的风范都丢掉了，网民们也不必要求过高，但是，作为法治工程的总负责人，对于各种侮辱法治、破坏党国形象的事情，总该负起责任，给天下一个最基本的缘由解释吧？\n\n虽然翻墙而后被龟缩的事情令人遗憾， 但网友见过那个页面在2012年就开立了，这说明伟大领袖习核心的法治可能不怎么接地气，但是翻墙举动很接地气，持续翻墙近五年之久，堪称居功至伟！这个伟大的光辉，必将载入史册，请习伟人放心吧。\n\n综观上下五千年的“文明史”，没有一位伟大的帝王领袖敢于一方面高高地筑起围墙，在雾霾遮天、暗无天日的围墙内干尽各种丧尽天良的伟业，同时又公开地翻过围墙，在隐约的翻墙光辉举动中，带有鄙视雾霾围墙的胆略。虽然这种胆略很快就被法西斯恐怖主义吓得龟缩隐身起来，但这种敢于自我否定的尝试，毕竟曾经存在过。请精通历史的教授专家们仔细研究一下，五千年的“文明史”中，有哪一位帝王具有敢于自我否定的勇气？\n\n所以郭文贵称赞习伟人是千年罕见的伟人圣人，其实这种赞誉还不够，以习氏敢于翻墙的英勇表现来看，这是五千年来罕见的伟人！\n\n最后，请伟大的习近平伟人放心，习氏文革可能很难成功，但习氏翻墙梦的光辉事迹必将载入史册，将有亿万百姓觉醒，跟着习核心，跨越网络柏林墙，统一虚拟主权！\n\n顺祝雄安千年伟业像秦始皇的光辉一样普照习仲勋无比廉洁、规模宏大的共产主义壮丽陵寝！\n\n                                                                  推特党暨全球维权同盟\n                                                                   公元2017年5月18日\n\n备注：\n郭文贵维权，一再强调，反对以贪反贪、以黑反腐、以警治国、以警反腐的四个乱象，同时，坚持三不原则，不反习主席，不反中华民族，不反国家。实际上这种努力是一直在尝试帮助习核心，看看他是否能恢复党国在49年前曾有过的一点点辉煌能量—能够包容民主法治的能量。\n\n在世风浮躁的环境里，夏业良教授一直坚持着教授般的严谨逻辑，强调必须反对“一党专政”的共产党。顺着夏业良的严谨逻辑，可以进一步推导出，实际上“共产党”已经不存在了，至少在中南海是不存在了，一个很简单的逻辑 —“共产党”的干部不可能是一群连官僚财产都不敢公布的“匿产帮”！\n\n中南海曾有过的真正的“共产党”之灵魂，实际上部分是在习仲勋的陵寝里，部分是在彭德怀、刘少奇等革命先辈的亡灵里才有。现实中的中南海已经蜕变为不敢公布财产、而且大肆掠夺百姓财富、转移财富、侵蚀财富的“蛆虫帮”、“粪坑党”。\n\n从策略上而言，郭七条可能没有教授级别的清高，但属于很灵活、务实的策略。一方面公开谴责腐败的贪官污吏如同蛆虫、粪坑党，一方面强调习近平伟人是千年罕见的圣人，这等于是在强烈地提醒习伟人与粪坑蛆虫党切割开来。\n\n一些伟大的领袖可能热衷于特权腐败，热衷于在粪坑里跟蛆虫为伍，不代表广大党员、广大军民群众热衷于在粪坑里当蛆虫，所以即使习伟人一时糊涂，当很多人看到网民们使用“千年圣人”、“五千年罕见的伟人”这些光环都不足以唤醒雄安大梦的时候，自然都会纷纷与蛆虫帮、粪坑党切割开来。\n\n这方面的详细探讨，请见网友另外发布的信息：\nhttp://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:3_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/ \n\n**[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)**\n**[转：洗雪当代国耻、废除辱习法规！ 零网 — 零封锁，广传播 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)**",
			"added": 1495100510
		},
		{
			"topic_id": 3,
			"title": "郭文贵为何怒怼章立凡、胡平、姜维平等人？ 法轮功是真善美吗？",
			"body": "郭文贵在6月份怒怼章立凡、胡平，让很多网民觉得解气的同时，却引来了另外一些公知大V的忌恨，伟大的记者同志姜维平先生也跳出来指手划脚。\n\n对于这种乱象，只要采取一个简单的分析，就知道很多所谓的公知大V已经被支那专政病毒污染了，他们的灵魂或多或少存在着一些支那专政病毒的糟粕。对于郭文贵的现象，一个很简单的解读就是，只要郭文贵没有做出背叛民族、出卖香港、出卖中国的事情，郭文贵的各种爆料都应该大力支持。伟大的特色党国蛆虫帮们绑架了国家机器，不只是迫害体制内类似薄熙来那样稍微有点作为、有点理想主义的政治家，而且对于体制外非常优秀的情报特工郭文贵也无法容忍。特色邪党一直试图绑架整个国家机器在对付郭文贵，郭文贵目前的处境是一直处于弱势。既然爆料是正义的，而维护正义的人士又处于相对弱势，自称是公知大V的人们，自然要有正义感、同情心。可是章立凡、胡平、姜维平等人，他们的正义感、同情心到哪里去了呢？ 他们的良心是被狗吃了吗？\n\n法轮功高层的某些人物一直在操纵阿波罗媒体之类的平台试图扭曲郭文贵的形象，把郭文贵往习江派系斗争的箩筐里装，这显然也不大符合法轮功所宣称的“真善美”形象。有一个很简单的逻辑，在只认权势、不讲道理的蛆虫帮体系里，郭文贵如果真的跟伟大的三块表伟人江泽民或者曾庆红有密切关系，特色邪党就不大可能那么疯狂地试图把郭文贵的整个家族都往死里整，这简直是比林彪事件更疯狂的、企图把文贵整个家族都灭门的邪恶专政！\n\n+ 一直揭露人性之恶，让部分五毛党和法轮功信徒可能觉得难以接受。那就调整思维，往人性之善的方面努力吧。假如李洪志先生所强调的真善美，是比特色邪党的伟光正更加真诚，那么假如李洪志先生非常真诚地认为“法轮功”确实是代表着地球上的真理，甚至是宇宙中最伟大的“真善美”，那么既然这种“真善美”是这么伟大、如此崇高，为了维护“真善美”的法轮功信仰，就必须推行持枪权来维护这么伟大的“法轮功”文化。\n\n李洪志先生和一些法轮功高层高智商的人士，应该难以否认这么简单的逻辑吧。与此同时，假如章立凡、胡平、姜维平等人都认为自己没有奴颜媚骨，都代表着宇宙真理，那么为了维护伟大的章立凡、胡平、姜维平等人的宇宙真理，也应该推行尊重持枪权、尊重生命的文化制度来维护他们每一个人的真理逻辑和崇高教条！\n\n顺着这个最简单的逻辑，由此可以延伸至每一个人的灵魂的最深处，可以清晰而简单地看到，在每一个人性的灵魂的深处，都带有追求光明、希望自己是代表真理的光明一面；与此同时， 当这种希望个人是真理化身的欲望试图强加给别人时，往往就会因为人性之恶的过于贪婪、而带来人性之邪恶的阴暗一面。人类追求真理的光明努力、与偏执于真理化身的贪婪邪恶， 本身就是一个既相互矛盾、又相互融合的矛盾统一体。这个矛盾统一体，在每一个人的灵魂深处，或多或少地都以各种不同的形式、不同的比例存在于每个人的个性之中！\n\n顺着这个最简单的逻辑，揭露人性之恶，可以促进文明进步；而歌颂人性之善，也一样可以促进文明进步。 政治的逻辑是，无论是任何一种口号，在公开场合，必须以光明正大的方式向世人展示。伪共内部派系林立，五毛党和七毛党们也是派系林立，无论他们拥护的是哪一个长尾级别的官僚，无论他们主张的是哪一种理论，包括共产主义乌托邦、法轮功、以及未来可能出现的银河系霸权、太阳系专政、甚至宇宙真理全能神等等，这些真理有一个共同的特点，就是这种真理是很伟大的，是值得人们为之努力奋斗，奉献一切，包括财富和生命。 那么，在各种花哨的理论背后，不需要费太多口舌与他们争论，只需顺着他们的“伟大”逻辑，这么反问一句，既然这种高超的学说这么伟大、理论这么精深，可以普渡众生，让亿万百姓受益无穷，可以让子孙万代都受益于这门伟大的旷世真理，那么，为了维护这一门伟大的新真理学说，为了维护伟光正的真善美，就应该推行持枪权制度来捍卫这种美妙的真理吧。 如果他们是不敢推行尊重持枪权、尊重生命的制度来捍卫他们所宣扬的“神圣”的、“至高无上”的真理教条，那么他们所谓的“真理”，很可能就是有疑问的、掺水的、包装华丽的伪劣产品。\n\n雾霾支那专政区的中国大陆目前的状况是文革局部复辟，一些蛆虫帮匪徒们还企图把文革复辟的糟粕蔓延香港，威胁台湾，甚至让支那专政病毒渗透美国，玷污了美国之音。 五毛党的背后实际上有类似王岐山伟人、习近平舵手那样的政治集团在操纵媒体，既然他们动用了庞大的人力、物力，把特色邪党的文革吹捧得那么崇高、伟大。他们的口号可能是虚假的，或者说至少是效忠党国的真假诚意是说不清的，但很难说清哪一个五毛党是真爱国，哪一个五毛党是假爱国。鉴于情况特殊，那就应该顺着五毛党和七毛党们的伟大努力，把人性至善的光辉融合到他们所宣扬的每一种口号里，他们的任何一种口号都可以是伟大的。但最重要的是，既然这么伟大，就应该推行尊重持枪权、尊重生命的文化制度来捍卫他们的伟大。 即使他们的口号是如同郭文贵所说的、纯粹就是胡扯的骗子主义、乌托邦，但是在公共媒体平台，他们再无耻，也不敢公开宣称“骗子主义”就是伟光正，而必须有个华丽的术语，比如共产主义、社会主义之类的名词概念。\n\n鉴于政治的特点是公开亮出的口号基本上都不太丑陋，既然口号是华丽而动听的，因此任何一种美丽的口号，都可以顺着美丽的思维予以彻底地赞美和歌颂，但必须坚持一个根本原则 — 既然理想这么美丽，就必须推行持枪权，以便拥护美好的理想。比如说，三个代表的理论确实很高尚，既然这么高尚，就必须推行持枪权，以便拥护高尚的理想；和谐社会很美妙，既然这么美妙，就必须推行持枪权；法治正义很伟大、爱国教育很崇高、安全稳定很重要，既然那么伟大、崇高、重要、光荣而美妙，就必须推行持枪权去维护那么美丽的理想。\n\n法律、政治、哲学、宗教、艺术等是紧密关联的。很多人都知道，在艺术领域，在一千个人的眼里，就会有一千个不同的哈姆雷特。同样的，在宗教领域，在一亿个人的眼里，就会有一亿个不同的毛泽东、孔子、耶稣、佛祖、穆罕默德等诸神。在网络柏林墙拆除后，就会有比较流畅的信息环境和法治环境，为了促进法治完善，到时可以明文规定，信仰没有最高级别，但无论公民的信仰如何不同，无论公民的信仰在人生不同阶段如何变化，尊重生命本来就是最基本的神圣信仰，这是世俗法律所要求的最低级别的神圣信仰。 尊重生命、尊重持枪权本身也是一个矛盾统一体。在一个稳健的文化体系里，尊重生命、尊重持枪权的文化属于最底层的规范，在这个底层规范的基础之上，才会有真正的信仰自由、言论自由。\n\n事实说明，没有一个伟大的党国、或者伟大的宗教派系愿意去当“东亚懦夫”。枪支的火药本来就是来自于中华文明，这个事实本身也说明，汉族文明的智慧本身也值得与尊重持枪权、尊重生命的尚武精神相匹配。因此，华夏同胞应当共同努力，废除网络柏林墙障碍，促进法治流畅，重建社会诚信，摆脱东亚懦夫的懦弱形象， 树立尚武精神，逐步建立尊重持枪权、尊重生命的文化制度。\n\n+ 伪共蛆虫帮到处安插特务，连香港都有9,000多个国安的特务，这说明特务领域也是如同五毛党一样，是派系林立，互相倾轧。表面上来看，到处都是伪共蛆虫帮的特务，特色邪党显得非常庞大、有力量，但是到处安插特务的事实，本身说明，特色邪党无论是对内，还是对外，都没有最基本的信任。郭文贵爆料，一些被安排到香港的国安干警们也意识到了，参与太多恐怖主义的邪党活动，自己也会随时遭遇类似徐明、李明那样被灭口的危险，因为一流的情报特工，多次为特色邪党立过功劳的郭文贵都难以幸免，让普通国安干警随时消失，将如同捏死一只蚂蚁一样。上海、北京等大城市的警察，为了劳财伤民的维稳而疲于奔命，也是怨声载道。 王岐山伟人早就看到了危局，因此王岐山伟人早就安排好了在美国和欧洲的多处退路，这说明王岐山伟人根本就没有把国安、中纪委同僚当成志同道合的所谓“同志”来看待，而是企图在信息蒙蔽的情况下，充分利用不知内情的国安、警察为他扩张权力，大捞一把，随时准备开溜。 很多之前被误导去助纣为虐的国安、警察们，正在不断觉醒。\n\n没有信息流畅，就不会有法治的流畅，就不会有公平正义。废除网络柏林墙，技术上的突破实际上只是信息传播范围的一个重要考量，最终需要的还是一场大规模的行动。 很多五毛党、七毛党们其实如同在一线工作的国安、警察一样，没有特务头目那样的特权，某些做法只是身不由己的选择而已。 \n\n要以行动抗争，当然需要冲动和勇气。但是冲动和勇气不应变成毫无理性的疯狂，郭文贵号召网民们行动起来，但又不要过于冲动，实际上是指行动的口号不要过于疯狂，不要提及暴力推翻“共产党”之类的口号，因为“匿产帮”匪徒们无资格代表数千万支持过“共和”“共产”的党员。所以，比较务实的策略是，号召广大军民们拥护“千古圣君”习近平，让习近平伟人与“匿产帮”切割开来，清除反华辱习的网络柏林墙，促进法治公正。\n\n支持推特党的港澳台同胞和全球华人携手努力吧，共同号召广大军民们行动起来，紧密团结起来， 环绕在以习近平伟人为核心的党中央周围，力挺习伟人翻墙，跨越网络柏林墙，统一虚拟主权。能去北京的人们，去北京抗议。不能去北京的，就地奋起抗争。洗雪当代国耻、废除辱习反华的法西斯法规！\n\n请墙内外的同胞们广泛传播习氏翻墙救国正能量，力挺习核心，翻墙不要龟缩！睁开眼吧，放声吼吧：\n习核心雄起、习核心不龟缩！中国梦不是狗的梦！\n废除法西斯围墙、洗雪当代国耻！\n\n**[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)**\n**[转：洗雪当代国耻、废除辱习法规！ 零网 — 零封锁，广传播 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)**",
			"added": 1497517596
		},
		{
			"topic_id": 4,
			"title": "中南海日夜研究郭文贵，蛆虫批判和“圣君”歌颂大有来头",
			"body": "郭文贵也在蛆虫帮的大粪坑里游了很多年，对于蛆虫帮的派系斗争手法的认识，远远超过普通人，而且郭文贵对中华传统文化也深刻理解。\n\n西方文明是在批判人性之恶的过程中取得某些文明进展的。笛卡尔说，一切皆可质疑，只有我的质疑不可质疑。批判精神本身是值得歌颂的。但中国人历来强调人性之善，在当前，大力批判历史缺陷可能导致某些人担忧的历史虚无主义和现实逃避主义。那不如顺着人性之善的文明轨迹，把所有的美丽事物都歌颂到万岁不朽的级别，包括某些看起来似是而非、真假难辨的口号。比如有人歌颂文革很伟大，那就一起歌颂文革万岁不朽吧；既然都伟大到万岁不朽的程度，那当然需要持枪权制度来捍卫— 需要完善尊重持枪权、尊重生命的法治规范。\n\n雾霾支那专政区的中国大陆目前的状况是文革局部复辟，一些蛆虫帮匪徒们还企图把文革复辟的糟粕蔓延香港，威胁台湾，甚至让支那专政病毒渗透美国，玷污了美国之音。 五毛党的背后实际上有类似王岐山伟人、习近平舵手那样的政治集团在操纵媒体，既然他们动用了庞大的人力、物力，把特色邪党的文革吹捧得那么崇高、伟大。他们的口号可能是虚假的，或者说至少是效忠党国的真假诚意是说不清的，但很难说清哪一个五毛党是真爱国，哪一个五毛党是假爱国。鉴于情况特殊，那就应该顺着五毛党和七毛党们的伟大努力，把人性至善的光辉融合到他们所宣扬的每一种口号里，他们的任何一种口号都可以是伟大的。但最重要的是，既然这么伟大，就应该推行尊重持枪权、尊重生命的文化制度来捍卫他们的伟大。 即使他们的口号是如同郭文贵所说的、纯粹就是胡扯的骗子主义、乌托邦，但是在公共媒体平台，他们再无耻，也不敢公开宣称“骗子主义”就是伟光正，而必须有个华丽的术语，比如共产主义、社会主义之类的名词概念。\n\n鉴于政治的特点是公开亮出的口号基本上都不太丑陋，既然口号是华丽而动听的，因此任何一种美丽的口号，都可以顺着美丽的思维予以彻底地赞美和歌颂，但必须坚持一个根本原则 — 既然理想这么美丽，就必须推行持枪权，以便拥护美好的理想。比如说，三个代表的理论确实很高尚，既然这么高尚，就必须推行持枪权，以便拥护高尚的理想；和谐社会很美妙，既然这么美妙，就必须推行持枪权；法治正义很伟大、爱国教育很崇高、安全稳定很重要，既然那么伟大、崇高、重要、光荣而美妙，就必须推行持枪权去维护那么美丽的理想。\n\n法律、政治、哲学、宗教、艺术等是紧密关联的。很多人都知道，在艺术领域，在一千个人的眼里，就会有一千个不同的哈姆雷特。同样的，在宗教领域，在一亿个人的眼里，就会有一亿个不同的毛泽东、孔子、耶稣、佛祖、穆罕默德等诸神。在网络柏林墙拆除后，就会有比较流畅的信息环境和法治环境，为了促进法治完善，到时可以明文规定，信仰没有最高级别，但无论公民的信仰如何不同，无论公民的信仰在人生不同阶段如何变化，尊重生命本来就是最基本的神圣信仰，这是世俗法律所要求的最低级别的神圣信仰。 尊重生命、尊重持枪权本身也是一个矛盾统一体。在一个稳健的文化体系里，尊重生命、尊重持枪权的文化属于最底层的规范，在这个底层规范的基础之上，才会有真正的信仰自由、言论自由。\n\n事实说明，没有一个伟大的党国、或者伟大的宗教派系愿意去当“东亚懦夫”。枪支的火药本来就是来自于中华文明，这个事实本身也说明，汉族文明的智慧本身也值得与尊重持枪权、尊重生命的尚武精神相匹配。因此，华夏同胞应当共同努力，废除网络柏林墙障碍，促进法治流畅，重建社会诚信，摆脱东亚懦夫的懦弱形象， 树立尚武精神，逐步建立尊重持枪权、尊重生命的文化制度。\n\n伪共蛆虫帮到处安插特务，连香港都有9,000多个国安的特务，这说明特务领域也是如同五毛党一样，是派系林立，互相倾轧。表面上来看，到处都是伪共蛆虫帮的特务，特色邪党显得非常庞大、有力量，但是到处安插特务的事实，本身说明，特色邪党无论是对内，还是对外，都没有最基本的信任。郭文贵爆料，一些被安排到香港的国安干警们也意识到了，参与太多恐怖主义的邪党活动，自己也会随时遭遇类似徐明、李明那样被灭口的危险，因为一流的情报特工，多次为特色邪党立过功劳的郭文贵都难以幸免，让普通国安干警随时消失，将如同捏死一只蚂蚁一样。上海、北京等大城市的警察，为了劳财伤民的维稳而疲于奔命，也是怨声载道。 王岐山伟人早就看到了危局，因此王岐山伟人早就安排好了在美国和欧洲的多处退路，这说明王岐山伟人根本就没有把国安、中纪委同僚当成志同道合的所谓“同志”来看待，而是企图在信息蒙蔽的情况下，充分利用不知内情的国安、警察为他扩张权力，大捞一把，随时准备开溜。 很多之前被误导去助纣为虐的国安、警察们，正在不断觉醒。\n\n没有信息流畅，就不会有法治的流畅，就不会有公平正义。废除网络柏林墙，技术上的突破实际上只是信息传播范围的一个重要考量，最终需要的还是一场大规模的行动。 很多五毛党、七毛党们其实如同在一线工作的国安、警察一样，没有特务头目那样的特权，某些做法只是身不由己的选择而已。 \n\n当前的情况非常特殊。习近平伟人领导的特色党国，实际上是一群连官员财产都不敢公布的“匿产帮”，而不是曾经支持过“共产主义”、把人民当人看的人民的“共和国”。此外，伟大领袖习近平伟人在2012年曾开立过推特页面，但是在2017年3月底重庆出台网络恐怖主义政策后，把习近平吓得立即在4月份就把推特页面都隐身龟缩起来。这个事实说明，习近平伟人根本就不具备前苏联男儿那样的勇气，更不能跟普京相提并论。 一些激进的网友甚至认为习近平可能只是东亚懦夫而已，而不是千古圣君。但由于习近平目前仍然是国家机器名义上的法人代表，为了避免被绑架习近平国家机器的盗国贼们利用特务权术，复制类似“六四”镇压那样的阴谋手法，在大规模的行动中，网友们应当尽量避免公开斥责习近平伟人是东亚懦夫。\n\n要以行动抗争，当然需要冲动和勇气。但是冲动和勇气不应变成毫无理性的疯狂，郭文贵号召网民们行动起来，但又不要过于冲动，实际上是指行动的口号不要过于疯狂，不要提及暴力推翻“共产党”之类的口号，因为“匿产帮”匪徒们无资格代表数千万支持过“共和”“共产”的党员。所以，比较务实的策略是，号召广大军民们拥护“千古圣君”习近平，让习近平伟人与“匿产帮”切割开来，清除反华辱习的网络柏林墙，促进法治公正。\n\n简单的归纳，一方面公开斥责伪共“匿产帮”匪徒们是在大粪坑里进行“蛆虫”式的派系反腐败，越反越腐败，越搅越臭；但是另一方面，非常给力地称赞伟大的习近平伟人是千古罕见的圣君。稍有常识的网民们都容易看出来，“粪坑党”的领袖怎么会是“圣君”呢？ 但既然已经是达到千古“圣君”的境界了，自然就必须与“粪坑党”切割开来。 因为或明或暗的五毛党、七毛党人数众多，甚至章立凡、胡平、姜维平等人也是说不清是什么身份的民运分子，以拥护千古“圣君”的说法，推动一场大规模的爱国运动，只是为了尽量减少大规模的摩擦冲突。这种策略，既是务实的，也是对历史负责的。\n\n为了最大程度地发起一场爱国运动，同时又避免陷进“六四”、或者“陈胜吴广”那样的循环怪圈，其他网友们如果有更好的、灵活的、建设性的方案策略，请在网络上面公开探讨，可以使用零网—零封锁的网络进行探讨。\n\n在Youtube页面看到这个信息的人们，在视频的附加说明文字里，请点击“展开”，会看到更多关于零网的细节信息。\n\n支持推特党的港澳台同胞和全球华人携手努力吧，共同号召广大军民们行动起来，紧密团结起来， 环绕在以习近平伟人为核心的党中央周围，力挺习伟人翻墙，跨越网络柏林墙，统一虚拟主权。能去北京的人们，去北京抗议。不能去北京的，就地奋起抗争。洗雪当代国耻、废除辱习反华的法西斯法规！\n\n请墙内外的同胞们广泛传播习氏翻墙救国正能量，力挺习核心，翻墙不要龟缩！睁开眼吧，放声吼吧：\n习核心雄起、习核心不龟缩！中国梦不是狗的梦！\n废除法西斯围墙、洗雪当代国耻！ \n\n**[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)**\n**[转：洗雪当代国耻、废除辱习法规！ 零网 — 零封锁，广传播 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)**\n",
			"added": 1497517732
		},
		{
			"topic_id": 5,
			"title": "郭文贵掀起怒潮，王岐山被吓死在医院",
			"body": "郭文贵掀起怒潮，王岐山被吓死在医院\n\n郭文贵刮起旋风，反蛆除孽，飓风袭来、摧枯拉朽!  全世界的华人不断觉醒。香港和大陆的同胞在水深火热的蛆虫党专政下，苦难尤其深重。各地群众纷纷醒悟，热烈探讨，公开准备发起一场反蛆除孽的文明运动。大规模的反蛆除孽运动正在酝酿之中，运动还没发起，已经传来小进展：伟大的王岐山伟人已经被吓瘫了，已经倒在医院，随时都可能寿终正寝。\n\n但是，形势还是很严峻。鉴于整个中南海都被一群不敢公开官员财产的“匿产帮”、“蛆虫党”霸占，还有不少长尾巴级别的长尾蛆虫隐藏在大粪坑的深处。反蛆除孽，需要一场大规模的运动，才可以拆除暗无天日的法西斯围墙，让阳光穿透雾霾支那蛆虫党一手遮天的邪恶专政大粪坑，让那一小撮披着“共产党”的外衣，干着“粪坑党”邪恶勾当的蛆虫帮匪徒们暴露在阳光下，接受正义的审判。 \n \n目前的情况非常特殊。习近平伟人领导的特色党国，实际上是一群连官员财产都不敢公布的“匿产帮”，而不是曾经支持过“共产主义”、把人民当人看的人民的“共和国”。此外，伟大领袖习近平伟人在2012年曾开立过推特页面，但是在2017年3月底重庆出台网络恐怖主义政策后，把习近平吓得立即在4月份就把推特页面都隐身龟缩起来。这个事实说明，习近平伟人根本就不具备前苏联男儿那样的勇气，更不能跟普京相提并论。 一些激进的网友甚至认为习近平可能只是东亚懦夫而已，而不是千古圣君。但由于习近平目前仍然是国家机器名义上的法人代表，为了避免被绑架习近平国家机器的盗国贼们利用特务权术，复制类似“六四”镇压那样的阴谋手法，在大规模的行动中，网友们应当尽量避免公开斥责习近平伟人是东亚懦夫。\n\n反复强调“千古圣君”，以拥护千古“圣君”的说法，推动一场大规模的爱国运动，只是为了尽量减少大规模的摩擦冲突。这种策略，既是务实的，也是对历史负责的。这就是郭文贵反复强调郭七条的缘故。不反习主席这一条，可以理解为不反对习主席翻墙救国、支持习近平统一虚拟主权，支持文化统一和国家统一。\n\n零网、零封锁，自由无国界！在Youtube页面看到这个信息的人们，在视频的附加说明文字里，请点击“展开”，会看到更多关于零网的细节信息。\n\n在这个特殊的历史阶段，香港人斥责伪共“匿产帮”“粪坑党”为支那人和支那国，实际上是抬举他们了。为了避免特务们混淆是非，制造大规模的摩擦冲突，大家一起明确地将反对的目标界定为不敢公开官僚财产的伪共“匿产帮”，而不是有数千万党员的“中共”，可以公开痛斥伪共“匿产帮”匪徒们是支那蛆虫、支那孽障。扫帚不到，灰尘不去；全民行动，反蛆除孽。反蛆除孽和反华反共没有一点关系。 港澳台信息和人员组织更自由，可以在香港公开发起爱国运动，以拥护千古“圣君”的名义，公开敦促香港政府支持习近平翻墙救国，公开要求废除辱习反华的网络柏林墙。香港小圈子选举出来的伪特首林郑月娥刚好要不断地展示效忠党国的诚意，经常强调爱党爱国，这种方式，将让林郑月娥、五毛党和七毛党们也找不到反对的理由。被欺骗去维稳的警察们也在不断觉醒，运动一旦发起，大陆军民都会积极响应。\n\n零网、零封锁，自由无国界！ 零网比Twitter/Facebook等更自由，不需要绑定邮箱或手机。请港澳台同胞多使用零网，探讨交流非暴力爱国运动。\n华夏同胞，行动起来！睁开眼吧，放声吼吧：习核心雄起、习核心不龟缩！中国梦不是狗的梦！废除法西斯围墙、洗雪当代国耻！\n\n**[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)**\n** [转：洗雪当代国耻、废除辱习法规！ 零网 — 零封锁，广传播 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)**",
			"added": 1498063157
		},
		{
			"topic_id": 6,
			"title": "郭文贵爆料：王岐山装死不成功，中南海陷入最后的疯狂",
			"body": "郭文贵猛烈爆料迅速发酵，唤醒了亿万百姓，也惊醒了成千上万的六四冤魂。普通百姓无法靠近中南海长尾巴级别的长尾蛆虫，但是天安门广场上六四英雄的鬼魂却直接冲到中南海， 向王岐山索命复仇。\n\n这个王岐山伟人自称是目空一切的“无神论”蛆虫大王，一直以来都非常嚣张，凡是他看不顺眼的人，他都想整死。蛆虫帮的总设计师邓小平当年听信王岐山的谗言，以为杀几十万人，就可以让邪恶的蛆虫妖孽专制像秦始皇梦想的专政那样，专政到千秋万世。邓小平的心腹王瑞林等人都是一群软骨头、没有原则的蛆虫爪牙。蛆虫爪牙们的共同特点就是可以为一些充满铜臭味的金钱利益冲突在中南海的大粪坑里激烈争斗，但是没有人在乎他们的子孙后代是否也会像赵鑫那样被活活打死，然后又被蛆虫帮官僚宣称为是被跳楼了。王瑞林因为汽车仓库的利益纠纷和王岐山闹翻了，王岐山邪性爆发，企图将王瑞林整死，并且威胁那些为求自保而团结起来的蛆虫爪牙们不得搞团团伙伙，否则就是违背了蛆虫党的组织原则。\n\n在王岐山伟人的眼里，他根本不相信雾霾天朝的老百姓能够醒来抗争。几年前他提醒蛆虫党员们要警惕“法国大革命”，掩盖冲突的办法就是加剧网络封锁，在暗无天日的法西斯围墙内制造比朱江时代更加野蛮的恐怖气氛，企图复辟类似古拉格群岛、纳粹大屠杀、粮食浮夸风等穷凶极恶的人间灾难。\n\n蛆虫帮的党魁习近平其实就是一个超级平庸的阿Q。阿Q的最大好处就是能力平庸，无法给其它长尾巴的老蛆虫们造成威胁。因此，习近平深得江泽民、曾庆红等老蛆王的赏识，不断地从大粪坑的边缘提拔到中南海的粪坑中央。\n\n习阿Q虽然智商不高，但也知道要在邪恶的大粪坑里保住核心宝座，单打独斗，力不从心，于是找到王岐山伟人，打造出习王团伙联盟的气势，不但在中南海的大粪坑内到处整死不听话的小蛆虫，还经常对大粪坑外的普通老百姓炫耀武力，制造恐怖气氛，企图在暗无天日的法西斯围墙内像魔鬼撒旦那样长久专政。\n\n蛆虫党魁习近平有个掌上明珠习明泽。习明泽曾在文明世界的哈佛大学受过教育，在习近平伟人刚登基时，习明泽协助党魁习近平在推特网络上面开立推特页面，努力模仿文明世界的元首们那样进行个人形象的公关宣传，在最初也获得过一些积极的影响。但是，这习明泽的见识也比骂街泼妇的智商高不了多少，在2017年3月底重庆出台网络恐怖主义政策后，习氏父女吓得把推特页面都隐身龟缩起来了。\n\n王岐山伟人看到习近平父女居然比东亚懦夫还懦弱，在郭文贵爆出猛料之后，看到习氏父女靠不住，王岐山自己年老体衰，也被吓坏了，一直以来高度嚣张的气焰也维持不住，倒在医院。中南海大粪坑的激烈内斗已经失控，六四冤魂厉鬼纷纷冲到中南海索命复仇，中国各地的老百姓也在不断觉醒，反蛆除孽。 曾经目空一切、无法无天的无神论狂徒王岐山伟人也开始疑神疑鬼，怀疑中南海工作人员的正常交谈也是在搞团团伙伙。这种比曹操更加变态的多疑症让装腔作势的习王联盟随时都可能崩塌。 \n\n看到习王联盟随时可能崩塌的危机，王岐山伟人本来就想装死，不再醒来，以便把多年来与蛆虫沙皇朱镕基一起贪污的几十万亿金银珠宝全部搬到海外，让王朱两家的后代在海外发起反攻，复辟王氏蛆虫帝国。\n\n但是，习近平已经找不到可用之人。习近平的用人原则是，凡是贪污没有大幅超过薄熙来的人，都不能重用；凡是比较廉洁、有点理想的官二代都不能重用。因为那样的人，不利于蛆虫帮所需要的污秽环境。类似刘源、刘亚洲等人，他们贪得太少了，都应该下岗。\n\n既然找不到可用之人，习近平只好强烈要求王岐山不要装死，再度出马。习近平的最大担心是，万一习近平去见马克思了，习家那些如花似玉的女人如同彭丽媛、习明泽等人随时都可能成为贺国强家族的猎物。贺国强家族连普通人家的老少四代女性都敢强暴，自然对中南海的美女也是虎视眈眈。习近平辗转反侧，权衡利弊，最终做出重大决策，王岐山虽然玩过蛆虫大会堂的服务员，但是没有接连玩弄四代女性，在政治上还是更可靠一些，于是设法搞了一些特供的人血馒头，暂时治好了王岐山的痨病，让他复出，让智商高超的老蛆虫曾庆红与王岐山在中南海的大粪坑舞台激烈较量。\n\n王岐山智商比习近平高，但是比曾庆红还是略逊一筹，这也是郭文贵对曾庆红还保持敬畏的原因。但是老蛆虫毕竟已不在位了。王岐山占据高位的时间虽然比曾庆红短些，但是在短期内吃过大量人血馒头。此次复出，王岐山吃了中南海顶级厨师特地制作的混血馒头，其中的斑斑血迹，混合了六四冤魂、蛆虫党服务员、法轮功受骗者、7-0-9律师以及众多冤民访民的血汗。\n\n世界上最腐朽的海—中南海大粪坑的长尾蛆虫都是通过不断地吃人血馒头才能生存的。郭文贵就是看到太多内幕了，所有长尾级别的蛆虫派系都不会放过郭文贵。但是郭文贵爆料的最大意义在于，那些被蛆虫妖孽骗去维稳的警察们也在不断觉醒。武警司令王建平也是因为贪图功利，被欺骗去参与黑暗的六四大屠杀，知道太多，已经被灭口了。王建平的蹊跷死亡，也像赵鑫那样，被自杀。被骗去泸州维稳的武警官兵们看到郭文贵爆料后，个个都非常后悔，要是爆料来得早一些，武警们也都加入了维权队伍。 \n\n目前的情况非常特殊。习近平伟人领导的特色党国，实际上是一群连官员财产都不敢公布的“匿产帮”，而不是曾经支持过“共产主义”、把人民当人看的人民的“共和国”。此外，伟大领袖习近平伟人在2012年曾开立过推特页面，但是在2017年3月底重庆出台网络恐怖主义政策后，把习近平吓得立即在4月份就把推特页面都隐身龟缩起来。这个事实说明，习近平伟人根本就不具备前苏联男儿那样的勇气，更不能跟普京相提并论。 一些激进的网友甚至认为习近平可能只是东亚懦夫而已，而不是千古圣君。但由于习近平目前仍然是国家机器名义上的法人代表，为了避免被绑架习近平国家机器的盗国贼们利用特务权术，复制类似“六四”镇压那样的阴谋手法，在大规模的行动中，网友们应当尽量避免公开斥责习近平伟人是东亚懦夫。\n\n反复强调“千古圣君”，以拥护千古“圣君”的说法，推动一场大规模的爱国运动，只是为了尽量减少大规模的摩擦冲突。这种策略，既是务实的，也是对历史负责的。这就是郭文贵反复强调郭七条的缘故。不反习主席这一条，可以理解为不反对习主席翻墙救国、支持习近平统一虚拟主权，支持文化统一和国家统一。\n\n零网、零封锁，自由无国界！在Youtube页面看到这个信息的人们，在视频的附加说明文字里，请点击“展开”，会看到更多关于零网的细节信息。\n\n+ 在这个特殊的历史阶段，香港人斥责伪共“匿产帮”“粪坑党”为支那人和支那国，实际上是抬举他们了。为了避免特务们混淆是非，制造大规模的摩擦冲突，大家一起明确地将反对的目标界定为不敢公开官僚财产的伪共“匿产帮”，而不是有数千万党员的“中共”，可以公开痛斥伪共“匿产帮”匪徒们是支那蛆虫、支那孽障。扫帚不到，灰尘不去；全民行动，反蛆除孽。反蛆除孽和反华反共没有一点关系。 港澳台信息和人员组织更自由，可以在香港公开发起爱国运动，以拥护千古“圣君”的名义，公开敦促香港政府支持习近平翻墙救国，公开要求废除辱习反华的网络柏林墙。香港小圈子选举出来的伪特首林郑月娥刚好要不断地展示效忠党国的诚意，经常强调爱党爱国，这种方式，将让林郑月娥、五毛党和七毛党们也找不到反对的理由。被欺骗去维稳的警察们也在不断觉醒，运动一旦发起，大陆军民都会积极响应。\n\n零网、零封锁，自由无国界！零网比推特或者/Facebook等更自由，不需要绑定邮箱或手机。请港澳台同胞多使用零网，探讨交流非暴力爱国运动。\n华夏同胞，行动起来！睁开眼吧，放声吼吧：习核心雄起、习核心不龟缩！中国梦不是狗的梦！废除法西斯围墙、洗雪当代国耻！全民行动，反蛆除孽；清除伪共匿产帮，恢复宪政共和；清除蛆虫党，恢复中华。\n\n**[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)**\n** [转：洗雪当代国耻、废除辱习法规！ 零网 — 零封锁，广传播 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)**",
			"added": 1498290529
		},
		{
			"topic_id": 7,
			"title": "郭文贵爆料：泸州事件的秘密—夏业良也是特务？",
			"body": "人的嘴巴的功能就是吃饭和说话。当说话的权利都遭到压制、剥夺时，意味着打饥荒、古拉格群岛等灾难也就不远了。\n\n就人类的本性而言，人类既有追求真理的光明一面，也有试图垄断真理权力的阴暗一面； 既有理性务实的一面，也有激情乃至于疯狂的一面。 从光明和阴暗的不同角度去分析历史，可以看到，崖山之后无中华，阴暗的支那专政病毒持续了近千年左右，很多基层百姓已经开始自发地产生摆脱支那专政病毒的意识，其中最明显的现象是，在泸州发生赵鑫案件之后，泸州百姓是自发地上街对抗“匿产帮”、“蛆虫党”的邪恶专政，这是在没有外部势力引导的情况之下，老百姓自发地上街抗争的大规模行动。 \n \n+ 在唐宋时期，欧洲处于中世纪，美洲大陆处于印第安人的朴素原始社会状态，中华文化则达到一个相对文明的历史高峰。 宋太祖赵匡胤把一句非常有名的话语“尔俸尔禄,民脂民膏,下民易虐,上天难欺”，放在各个衙门，其本意旨在告诫伟大、光荣、正确的大宋王朝赵家党成员时刻记住，不是赵家党养活了亿万苍生，而是亿万百姓的民脂民膏一直在供奉着赵家党。 但遗憾的是，赵匡胤仍然局限于家天下的狭隘帝制专政，并且还过于排斥尚武精神。虽然火药最早起源于中华文明，但是枪支没有大规模出现，而宋太祖也没有机会升级大宋王朝的法治规范，缔造尊重持枪权、尊重生命的文化制度。\n \n过于排斥尚武精神的赵家党终于因为秦桧陷害忠良而走向颓废，最终灭亡，而多数赵家人也被蛮夷异邦消灭。从那时起，优秀的中华文明遭到蹂躏，曾经有过尚武精神的汉唐雄风被破坏、掩埋，偶尔在改朝换代的波浪中有过一定的发挥，但是优秀的中华文明一直都难以全面恢复，让邪恶的支那专政病毒经常泛滥成灾，荼毒天下、生灵涂炭。\n \n传承数千年的儒家文化，其核心原则是“己所不欲，勿施于人”。要让整个社会、整个国家都遵守“己所不欲，勿施于人”的道德规范，这个国家的人民必然需要有尚武精神，因为国家懦弱，必然遭到他国的欺凌，甚至灭亡；而人民懦弱，必然遭到专政邪党的凌辱，甚至灭亡。 \n \n正是基于这个最简单的逻辑，美国的开国元勋华盛顿、杰弗逊等人坚持把“持枪权”法案写入宪法，而民主论道的选票表决机制只是维持公共权力的表面形式而已。 只要有尊重持枪权、尊重生命的底层规范在维持运转，任何一个政府部门随时被关闭，或者任何一个类似赵家党那样的机构被更换，也不会天下大乱。 无论什么样的领袖登上舞台，这种方式都让广大人民拥有了最基本的武力保障，因此尊重持枪权、尊重生命的文化规范是捍卫言论权利、选举权利、和生命权利的最基本的规范，在此基础上，才能够避免类似支那专政病毒、纳粹大屠杀、古拉格群岛、粮食浮夸风、地产浮夸风等各种各样在不同时期以不同形式表现出来的邪恶专政病毒，即使万一出现了类似麦卡锡借“反共”宣传搞意识形态专政的、伟大而疯狂的领袖；这种“伟大”的领袖也难以持久地欺骗，因为只要人民的持枪权没有丧失，政客们基于人类最基本的生存本能，他会不由自主地在他的灵魂深处自发地保持着对枪支的敬畏；而即使他们对权力的贪婪、对权术的高超运作能够超过列宁、斯大林、毛泽东等伟大领袖，他们仍然无可奈何地必须懂得克制个人的贪婪。 \n \n伟大领袖毛泽东伟人说过，安全第一、生产第二。伟大的儒家圣贤孔夫子强调，“己所不欲，勿施于人”。跟普通公民一样谦卑的政治家杰佛逊强调，正当的自由，是“不侵犯别人的同等权利”。安全第一、生产第二；“己所不欲，勿施于人”；“不侵犯别人的同等权利”，这些伟大的名人名言道理类似，但要付诸于实践，并且在实践中不会被彻底遗忘、背叛，则需要最基本的原则和规范，也就是尊重生命、尊重持枪权的文化规范。 尊重生命、尊重持枪权应该是最低级别的世俗规范，同时，这个文化规范本身也是世俗法律所应当确立的、最低级别的“神圣信仰”。因此，信仰没有最高级别，但是有最低级别的要求。尊重生命、尊重持枪权既是最底层的文明社会法律规范，也是最低级别的、与世俗生活密切关联的信仰文化。 \n \n尊重生命、尊重持枪权这个最低级别的法律规范和信仰规范处理好了，才会有真正的“百家争鸣、百花齐放”。有了这个最基本的规范，在每一个时代的历史时空里生存的人们，就不会因为对于具体事物的某些具体看法意见差异较大而发生大规模的冲突和悲剧 ，导致群体性地侵犯他人本该具有的、同等的生存权利的群体灾难。中国历史上发生过的大规模的人间灾难，其本质大都是因为缺乏最底层的社会规范去维持最基本的文明演变轨道， 以致于导致人类社会一直在丛林争斗和文明重建的恶性循环中，在极左和极右两个非常疯狂的深渊之间，左右徘徊，一直都无法真正地走出丛林，迈向可持续的人类文明轨道。宋太祖赵匡胤其实已经一只脚迈出了丛林，但是因为历史局限性，没有机会创建尊重生命、尊重持枪权的文化制度，最终留下历史遗憾。\n \n+ 泸州发生的数十万百姓自发上街抗议，是个很鼓舞人心的事情。这说明，即使没有外部势力引导，强烈的维权意识已经在亿万百姓中生根发芽，老百姓的思想里即使没有清晰地认识到支那专政病毒的变态专政之邪恶，但是在大家的潜意识里，已经是非常强烈地要求摆脱“蛆虫帮”、“粪坑党”的变态专政。\n \n从这个层面而言，“反共”的说法已经过时了。逻辑很简单，一群连官员财产都不敢公布的“匿产帮”、“粪坑党”、“蛆虫帮”匪徒们，根本没资格代表伟光正的中国“共产党”。从“共产主义”的严谨概念来看，连官员财产都不敢公布的“匿产帮”占据着中南海，本身说明“共产党”已经灭亡了，或者说曾经信仰“共产主义”的共产党高级干部、高级精英已经在腐朽的大粪坑里消失了，至少在中南海是已经消失了。 \n \n腐朽的支那蛆虫帮、“匿产帮”、“粪坑党”既然没资格代表伟光正的中国“共产党”，当然也没资格代表把人民当人看的“人民”的“共和国”，更没资格代表中华文明了。支那“粪坑党”不代表文明，而是侵蚀汉族文化的“汉蛆”、“汉孽”；是破坏华夏文明的腐朽蛆虫，是阻碍中华文化统一的支那“孽障”。\n \n+ 既然“反共”已经过时，与时俱进的历史任务是反对支那蛆虫帮、“匿产帮”、“粪坑党”，消除支那专政病毒、清除破坏华夏文明的支那孽障，简单来说，不是“反共”，而是“反蛆除孽”。 \n \n亿万同胞们正在携手努力，“反蛆除孽”、恢复中华！ \n伪共“匿产帮”“粪坑党”的统治模式，其最大特点是到处安插特务。表面上来看，到处都是伪共蛆虫帮的特务，特色邪党显得非常庞大、有力量，但是到处安插特务的事实，本身说明，特色邪党无论是对内，还是对外，都没有最基本的信任。香港也有9,000多个国安的特务，和类似大陆五毛党那样规模庞大的七毛党。这说明特务领域也是派系林立、互相倾轧。 \n \n近期网络上流传民运人士夏业良和唐柏桥的争论。不久前其他民运老人诸如胡平、章立凡、姜维平等人和部分法轮功高层人士企图抹黑郭文贵，遭到网友们的抵制。一些网友们甚至怀疑夏业良也是伪共安排的特务。即使夏业良是特务，鉴于伪共“匿产帮”内部派系林立，外界也无法知道夏业良是属于哪一个派系的特务。为了更好地凝聚起推墙的力量，如果没有确切的证据证明某人是蛆虫帮的特务，建议网友们少凑热闹；对于无事生非、捕风捉影地制造特务的人士，尽量少理会。\n \n目前的情况非常特殊。习近平伟人领导的特色党国，实际上是一群连官员财产都不敢公布的“匿产帮”，而不是曾经支持过“共产主义”、把人民当人看的人民的“共和国”。此外，伟大领袖习近平伟人在2012年曾开立过推特页面，但是在2017年3月底重庆出台网络恐怖主义政策后，把习近平吓得立即在4月份就把推特页面都隐身龟缩起来。这个事实说明，习近平伟人根本就不具备前苏联男儿那样的勇气，更不能跟普京相提并论。 一些激进的网友甚至认为习近平可能只是东亚懦夫而已，而不是千古圣君。但由于习近平目前仍然是国家机器名义上的法人代表，为了避免被绑架习近平国家机器的盗国贼们利用特务权术，复制类似“六四”镇压那样的阴谋手法，在大规模的行动中，网友们应当尽量避免公开斥责习近平伟人是东亚懦夫。\n \n反复强调“千古圣君”，以拥护千古“圣君”的说法，推动一场大规模的爱国运动，只是为了尽量减少大规模的摩擦冲突。这种策略，既是务实的，也是对历史负责的。这就是郭文贵反复强调郭七条的缘故。不反习主席这一条，可以理解为不反对习主席翻墙救国、支持习近平统一虚拟主权，支持文化统一和国家统一。\n \n零网、零封锁，自由无国界！在Youtube页面看到这个信息的人们，在视频的附加说明文字里，请点击“展开”，会看到更多关于零网的细节信息。\n \n反对支那蛆虫帮、“匿产帮”、“粪坑党”，而不是反对“共产党”，更不是反对中华民族。反蛆除孽，与反共反华没有任何关系。全球华人携手努力，行动起来。睁开眼吧，放声吼吧：习核心雄起、习核心不龟缩！中国梦不是狗的梦！废除法西斯围墙、洗雪当代国耻！\n\n\n**[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)**\n** [转：洗雪当代国耻、废除辱习法规！ 零网 — 零封锁，广传播 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)**",
			"added": 1498293257
		},
		{
			"topic_id": 8,
			"title": "彭丽媛的淫乱黑幕",
			"body": "\n郭文贵掀起爆料旋风，有网友爆料：彭丽媛和芮成钢也有不正常的关系。 彭丽媛是否像黄艳那样，为了攫取最大利益，经常和其他新老常委发生非正常的关系，仍然是一个谜。\n\n中南海官僚混乱的私生活，无论是周永康、令计划，还是黄艳或其它女人，最多也只能是跟美国前总统克林顿类似。从文明世界的角度看，如果政府高官没有滥用权力，贪污受贿、以权谋私，私生活作风与公权力的运作是可以切割开来的。蛆虫帮经过刻意的文化污染，让网民们对高官的淫乱更感兴趣，对于流畅信息、流畅法治的严肃思考却还不够，因此网友们也只好从高官淫乱的角度去探讨开启新篇章的文明征程。这些结果不一定是彭丽媛、习明泽等戏子村妇能够预测得到的，但确实是中南海大粪坑里那一群蛆虫党们不断推动的客观效应。\n\n如果没有滥用特权，不断地攫取专政特权；打压言论自由，复辟文革暴政，彭丽媛即使如同黄艳一样到处淫乱，她们的淫乱仍然只是属于私生活的范畴，与公权力的运作是可以切割开来的。 \n\n从严苛的作风纪律来看，如果习仲勋的私生活特别严谨，没有出轨，那么就不会在第一任妻子的婚姻关系仍然维持的情况下，与习仲勋的第二任妻子齐心发生非正常的激情关系，结果不小心导致习近平来到人间，如今进一步导致习近平居然携手彭丽媛，企图复辟文革暴政。  \n\n也就是说，如果以习近平对付薄熙来的那一套标准来严格要求习仲勋的话，那么习近平就不应该有机会来到人间，现在他居然在雾霾支那专政国倒行逆施，借反腐的名义，行“文革复辟”的伎俩。\n\n习近平刚上台时，因为习仲勋曾经有过的历史光环，不少人对习近平寄予厚望。但“文革局部复辟”的事实惊醒了很多人，越来越多的草根阶层也丢掉了幻想，加入维权抗争队伍。\n\n早前，某些失败的宣传策划可以是认为是经验不足，比如：既然是在专制国度，连官僚财产都不敢公布的“匿产帮”匪徒们，自然跟亿万百姓之间也就不存在什么“亲切的”亲和力，但是习近平伟人的智囊团队居然邯郸学步，效法民主国度的奥巴马总统和安倍首相，搞过一幕在民间吃“包子”的大戏，由此没有增加亲和力，反而赢得了“习包子”的光辉荣誉。\n\n但是，公开抓捕7-0-9律师，以及为一些书籍出版而公然跨境逮捕香港书商，则显然不是一时疏忽的行为，而是故意策划，复辟文革，并且企图让支那蛆虫帮的文革覆盖香港。这种倒行逆施，显然比毛泽东愚蠢得多，也更加野蛮残暴，因为毛泽东清醒地知道，蛆虫帮的文革无法成功覆盖香港，因为大英法治的环境根本容不下罪恶滔天的大饥荒、粮食浮夸风、以及野蛮谋杀国家主席刘少奇等各种罄竹难书的罪孽。\n\n彭丽媛接手文艺工作后，打压言论的高压专政更加疯狂，逼迫香港和大陆的百姓不断地反抗。 香港该以何种方式应对文革复辟的蔓延呢？ \n\n网络柏林墙虽然没有直接封锁香港，但是9000多个特务进入香港，已经给香港造成法西斯的气氛。包括五毛党、七毛党在内的各种职业特务和业余特务们很多也是身不由己，只是把工作当成饭碗而已，而进入香港的国安特务们被迫去为蛆虫帮效力，是因为他们在大陆的家属受到蛆虫帮的控制。武警司令王建平因为贪图功利，被欺骗去参与黑暗的六四大屠杀，知道太多，已经被灭口了。王建平的蹊跷死亡，也像赵鑫那样，被自杀。被骗去泸州维稳的武警官兵们看到郭文贵爆料后，个个都非常后悔，而被迫去香港的国安特务们更加清楚，他们的命运也像王建平那样，随时都可能因为参与太多的犯罪，而被灭口。\n\n目前的情况非常特殊。习近平伟人领导的特色党国，实际上是一群连官员财产都不敢公布的“匿产帮”，而不是曾经支持过“共产主义”、把人民当人看的人民的“共和国”。此外，伟大领袖习近平伟人在2012年曾开立过推特页面，但是在2017年3月底重庆出台网络恐怖主义政策后，把习近平吓得立即在4月份就把推特页面都隐身龟缩起来。这个事实说明，习近平伟人根本就不具备前苏联男儿那样的勇气，更不能跟普京相提并论。 一些激进的网友甚至认为习近平可能只是东亚懦夫而已，而不是千古圣君。但由于习近平目前仍然是国家机器名义上的法人代表，为了避免被绑架习近平国家机器的盗国贼们利用特务权术，复制类似“六四”镇压那样的阴谋手法，在大规模的行动中，网友们应当尽量避免公开斥责习近平伟人是东亚懦夫。\n\n反复强调“千古圣君”，以拥护千古“圣君”的说法，推动一场大规模的爱国运动，只是为了尽量减少大规模的摩擦冲突。这种策略，既是务实的，也是对历史负责的。这就是郭文贵反复强调郭七条的缘故。不反习主席这一条，可以理解为不反对习主席翻墙救国、支持习近平统一虚拟主权，支持文化统一和国家统一。\n\n在这个特殊的历史阶段，香港人斥责伪共“匿产帮”“粪坑党”为支那人和支那国，实际上是抬举他们了。为了避免特务们混淆是非，制造大规模的摩擦冲突，大家一起明确地将反对的目标界定为不敢公开官僚财产的伪共“匿产帮”，而不是有数千万党员的“中共”，可以公开痛斥伪共“匿产帮”匪徒们是支那蛆虫、支那孽障。扫帚不到，灰尘不去；全民行动，反蛆除孽。反蛆除孽和反华反共没有一点关系。 港澳台信息和人员组织更自由，可以在香港公开发起爱国运动，以拥护千古“圣君”的名义，公开敦促香港政府支持习近平翻墙救国，公开要求废除辱习反华的网络柏林墙。香港小圈子选举出来的伪特首林郑月娥刚好要不断地展示效忠党国的诚意，经常强调爱党爱国，这种方式，将让林郑月娥、五毛党和七毛党们也找不到反对的理由。被欺骗去维稳的警察们也在不断觉醒，运动一旦发起，大陆军民都会积极响应。\n\n零网、零封锁，自由无国界！零网比推特或者/Facebook等更自由，不需要绑定邮箱或手机。请港澳台同胞多使用零网，探讨交流非暴力爱国运动。\n华夏同胞，行动起来！睁开眼吧，放声吼吧：习核心雄起、习核心不龟缩！中国梦不是狗的梦！废除法西斯围墙、洗雪当代国耻！全民行动，反蛆除孽；清除伪共匿产帮，恢复宪政共和；清除蛆虫党，恢复中华。\n\n\n**[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)**\n** [转：洗雪当代国耻、废除辱习法规！ 零网 — 零封锁，广传播 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)**\n",
			"added": 1498749267
		},
		{
			"topic_id": 9,
			"title": "彭丽媛的淫乱黑幕—郭文贵爆料刮起蝴蝶效应 （二）",
			"body": "以“淫乱”为话题，借题发挥，展开一场统一虚拟主权的新文明运动，显得有点可笑，但在唯物主义过渡泛滥的时代，似乎也是顺应历史潮流的务实策略。 请不明真相的网友仔细看完内容，再做评价。完整的信息资料，放在零网—零封锁的网站—自由论坛。有网友说彭丽媛也和芮成钢淫乱，且不说这是真是假，说彭丽媛淫乱，实际上是抬举他们了，因为历史上的武则天虽然淫乱，但治国很有条理，而马克思本人虽然不是非常强烈地主张共产共妻，但他确实也没有反对在共享财产的“共产主义”基础上搞类似原始社会的共妻。\n\n探讨、传播这些信息的网友们并不是性学问方面的专家，也不是特别热衷于“淫乱”秘史研究的教授，只是看到“淫乱”话题那么吸引人，足以说明唯物主义过渡泛滥的“匿产帮”“蛆虫”专政文化，已经严重破坏了古中华文明所重视的“心物本为一体”的优秀文化传统。马克思辩证唯物主义的矛盾论学说本身也非常精辟，类似古中华的周易哲理。无论是运用周易哲理，还是马克思的矛盾论学说，都可以清晰地看到唯物主义和唯心主义本身也是既相互对立、又相互统一的一个矛盾统一体。简单地说，“心物一体”既符合古中华的周易哲理，也符合马克思的唯物辩证法智慧。\n\n当然，这里主要不是传播哲学。而是从“淫乱”的唯物主义话题，借题发挥，展开文明探讨，掀起一场新文明运动。 废话少说，言归正传。\n\n这里也不是说马克思的共产共妻理想有多么伟大，但作为意识形态的奇谈怪论，共产共妻理想的学术观点在言论自由的领域是应当得到适当的尊重。这里也不想批判共产共妻是否合理，而是顺着共产共妻的逻辑，推动信息共享的新文明运动，促进虚拟主权统一，恢复宪政共和，恢复中华。\n\n+ 要想让“共产主义”的思维得到推广，必须推动“信息共享”，逻辑很简单，既然财富都可以共享了，为什么信息还不能共享呢？ 如果最基本的信息自由权利都不让普通百姓共享，哪里还有什么“共产主义”？\n\n从“共产共妻”的角度来看，黄艳最大的问题不是“共产共妻”，而是“匿产共妻”，黄艳每次与中南海的长尾蛆虫开展“共妻”活动的时候，实际上都带着霸占社会财富、侵蚀公共权力的目的，那些新老常委们也都知道，黄艳的“共妻”活动带有掠夺财富的“匿产”、“夺权”企图。从“共产共妻”的角度来看，黄艳是个虚伪的“共产党”，如果用大粪坑、蛆虫来形容显得不雅观的话，那么从“共产共妻”的高尚逻辑来看，黄艳是个局部的“共产主义者”，在“共妻”领域非常积极，比彭丽媛积极得多，甚至超过了历史上的武则天。\n\n但无论是黄艳，还是彭丽媛，都无法和武则天相提并论，因为武则天具有高超的政治智慧，曾经把大唐王朝治理得井井有条，而不是印钞撒币式的阿Q草包水平—只懂得对外大撒币、对内大印钞；掠夺百姓，巴结友邦。\n\n被某些人誉为过去一千年来最有影响力的思想家之一“马克思”，自称是无神论者，其实并不是无神论者，或者更确切地说，马克思只是一个自欺欺人的无神论者。\n\n支撑共产主义学说的辩证唯物主义看起来充满雄辩，很有说服力，有点类似古中华文明提到的万物相生相克的周易哲理，但是，马克思在“共产主义宣言”中，开篇就提到“共产主义”是一个“幽灵”。一个无神论者，把他的“共产主义”概念当成类似鬼神的“幽灵”看待，这本身就说明在这个无神论者的心中，即使没有“神圣”信仰之类的概念，还是有鬼神“幽灵”之类的概念。\n\n不懂得马克思主义的人不必花多大功夫去研究它那些条分缕析的庞大文字系统，只须从这个最简单的表面现象就可以看出，马克思主义与共产主义无神论学说本身就是自相矛盾的“学术”术语。也正是这个核心问题导致马克思主义在灵魂层面存在伪劣缺陷的致命问题。这个伪劣缺陷的致命问题很容易被一些无法无天的政客利用，制造各种人间悲剧，比如模仿马克思那样，在“无神论”和神圣信仰之间制造矛盾，把民主和专政混淆在一起，炮制出类似某某阶级民主专政之类的混沌洗脑术语，完全是为了混淆是非、颠倒黑白。\n\n对于“共产主义”这个介于科学和神学之间、带有浓厚宗教色彩的意识形态术语，如能像维多利亚女王那样，把它看成一种学术创新，和人文领域、科技领域的其它学术创新一样，一视同仁地予以该有的尊重和敬畏，则华夏文明有希望摒弃已到穷途末路的伪劣支那专政体系，重启朱彭红军民主，开启大唐时代曾经有过的、比较开明的文明风范。\n\n恢复宪政共和、恢复中华，靠那一小撮绑架了习近平国家机器的伪共“匿产帮”匪徒，根本行不通，只会导致灾难。 有各种迹象表明，包子已经露馅了，习近平的智商如何阿Q草包一样。 公开的迹象已经展示了很多证据，具体包括： \n+ 习近平既然是公开推出“依法治国”的口号，习近平就没有理由安排傅政华去大肆抓捕人权律师，公开制造7-0-9事件的邪恶罪孽。或者退一万步说，即使习近平无法完全阻挡政法委派系的蛆虫帮党徒去随意抓捕部分人权律师，但是已经军权在握的习近平是有能力阻止大规模地抓捕人权律师的邪恶暴政。习近平一边打着“依法治国”的幌子，一边却故意纵容，制造7-0-9事件，给习氏的法治中国抹黑，已经把习氏法治拖到腐朽的支那蛆虫大粪坑里面去了，完全玷污了习仲勋的历史光环曾经给习家后代留下的某些良好形象。\n\n习近平说前后两个三十年不互相否定，作为一种混淆是非的权宜之计，还说得过去，因为地产泡沫浮夸风，其本质与粮食浮夸风类似，前后两个三十年都是背弃1949年前的宪政共和的“伪共”暴政。既然都要在社会财富领域施行“共产”，自然公共权力也是与百姓“共享”。在1949年前，毛泽东在与蒋介石竞争时，对这个简单的逻辑，是很清楚的。但是毛泽东在夺取政权后，因为工农百姓中文盲比例很高，类似朱德、彭德怀等红军先辈对民主权利的意识也不够清晰，毛泽东利用大众觉悟低的漏洞，通过一系列的权术运作，让尊重“共产”、践行“共和”的共产党蜕变为篡夺了人民选举权利的“篡权党”。但是毛泽东也明白，像袁世凯那样公开复辟“韶山”帝王的帝制暴政行不通，因此毛泽东在经济层面，还是要努力地严苛要求毛家人不要贪污腐败。虽然毛泽东个人的经济特权无人能够制约，在政治上拥有比秦始皇更加集权的权威，但毛泽东还是一直在经济层面以高压专政的手法威慑各级党员干部，让他们不敢大肆掠夺社会财富，勉强维持经济层面的公平气氛。 \n\n因受制于革命先辈朴素作风的约束，毛泽东无论多么贪婪，也只能是局部背叛了“共产主义”。 而邓小平在篡党夺权后，不但是政治上剥夺了人民的基本权利，而且在经济上也开启了腐败的阀门，为“共产党”的蛆虫化打开了通往“粪坑”的道路。\n\n+ 习近平可以说“文革”是老路，行不通，但不能说宪政共和是邪路，因为“共产党”在1949年前支持过宪政共和的光辉事迹一直都是这个党引以为傲的残余光辉。把民主宪政称为邪路，不但是在骂特色蛆虫帮是“邪党”，而且也是在骂习家祖宗，甚至也在辱骂很多红军先辈，因为很多优秀的红军先辈们，包括刘少奇、朱德、彭德怀等十大元帅和众多将领们，如同习近平的父亲习仲勋一样，跟随过毛泽东，他们都是因为坚定地支持民主宪政而加入了曾经是进步的“共产党”。 \n\n民主和集权并不一定矛盾。民主制度本身也可以促进高效的集权运作。当多数人都同意社会资源的重新分配由社会公认的英明领导人进行统一规划时，就是高效的集权运作。美国在20世纪的大萧条时期的罗斯福新政，本身就是在民主制度下进行高效集权运作的典范。显然，说民主制度不高效，是一种混淆是非、颠倒黑白的逻辑混乱。\n\n+ 美国法治的最底层规范是尊重持枪权、尊重生命的宪法精神。在尊重持枪权、尊重生命的文化体系里，当多数人都非常强烈地意识到社会秩序需要由公认的英明领导人进行统一规划时，自然就能够促进民主机制的高效集权运作。因此，民主机制的高效集权，实际上是民意的强烈诉求，是客观环境使然。主观能动性的法治规范，主要是尊重持枪权、尊重生命的底层规范；这个底层规范在天然地遏制着人类的贪婪。每个公民有一张选票，还是一万张选票，那是次要的逻辑规范。1949年前的延安没有发生粮食浮夸风、大饥荒之类的灾难，主要也是因为很多军民持有枪支，虽然持枪权没有写入宪法，但是众多民兵持枪的事实客观上天然地遏制着毛泽东对权力的贪婪，让他很自然地不敢极端过分地无法无天。枪支的火药本来就来自于中华文明，恢复尚武精神，创建尊重持枪权、尊重生命的文化有利于长久地延续中华文明，这个细节在“薄熙来为何失败”的篇章中有所论述。\n\n因此，习近平可以说“文革”是老路、邪路，但不能说支持宪政共和的无数红军先辈在1949年前就走上了邪路，并且把红军先辈都称为是“邪党”。 \n\n习近平和彭丽媛就一无是处吗？当然也不是，细节稍后探讨。 \n\n**[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)**\n**[转：洗雪当代国耻、废除辱习法规！ 零网 — 零封锁，广传播 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)**",
			"added": 1498986051
		},
		{
			"topic_id": 10,
			"title": "彭丽媛的淫乱黑幕—郭文贵爆料刮起蝴蝶效应 （三）",
			"body": "北京有一批红二代们曾经自发地联合起来，支持习近平的反腐败。但是习近平才获得了部分集权，就洋洋自得宣称“反腐败”已经取得“压倒性”的胜利，比蒋介石还更无耻、更无能，还没过完河，就开始拆桥了，把一些支持过习近平的、贪腐比较少的红二代比如刘亚洲、刘源等统统下岗，这样，反而很快就让习近平自己陷入了孤立无援的境地。\n\n毛泽东当年虽然与周恩来、朱德有不愉快，但是深谙权术的毛泽东，其手段虽然毒辣，但胸怀气量和智慧都远比习近平高超，无论有多么大的矛盾和不愉快，毛泽东都懂得，不可让有威望的周恩来、朱德随意下岗，或者随意打入牢房。 刘源协助习近平反腐败，打老虎，立下汗马功劳；刘亚洲虽然被抓出贪腐把柄，但不一定比其他人严重，而最重要的是，刘亚洲是很鲜明地支持宪政法治的人士，即使有一定的腐败，只要没有叛国，至少需要予以包容， 才能凝聚人气。如果是真的要一碗水端平，像刘源、刘亚洲这些觉悟比较高的人士，习近平完全可以采取类似规劝习家亲戚放弃经商的方式，规劝红二代们放弃经商，回吐来源不明的财富。只要没有叛国，红二代们的才干都应该得到积极的发挥，而不是以习包子一人之力，到处兼任组长，显得气量太小了！\n\n退一万步说，如果是真的要端平一碗水，彻底反腐败，起码也是在更严重的大老虎落马后，才能让比较有才干的红二代们下岗。而且这种方式，如果要让全国人民心服，那么就必须把习近平兼任的各个组长职位公开向社会开放招聘，无论党内，还是党外的人士，只要是有才干的公民，都可以竞选应聘公共职位。 \n\n各种迹象表明，习近平一方面梦想着毛泽东那样至高无上的专政特权，但又过于多疑，根本不具备毛泽东那样的胸怀、气量和智慧，很多事情已经展示了习近平的懦弱无能、逻辑混乱。 \n\n这些信息是在努力突破网络封锁，自然不怕五毛党和七毛党们的信息轰炸。欢迎五毛党、七毛党们到零网拍砖，更欢迎普通网民们到零网争吵、争议，百花齐放，百家争鸣。\n\n这里只是说：郭文贵爆料掀起了网友们的爆料热情，看到其他网友跟着爆料，彭丽媛和芮成钢也有不正常的关系。他们的某些信息可能是江湖传闻，有待网络柏林墙拆除后才能看到真相。更重要的是，从克林顿混乱的私生活来探讨，私生活的淫乱，与公权力的运作是可以切割开来的，但需要公权力的信息透明，信息流畅才能促进法治流畅。\n\n这些信息不是在抹黑习近平、彭丽媛，而是在提醒他们，如果毛泽东也像习近平那样专门使用下三滥的手段抓通奸，习仲勋就没机会与齐心结合，生产习近平伟人出来，如今竟然把文革复辟闹到香港去了，注定要失败。\n\n淫乱不一定是罪过。如果是像武则天、克林顿那样把国家治理得很好，淫乱的私生活和公共权力的运作是可以切割开来的。 但像伪共“匿产帮”匪徒那样的邪恶暴政，与武则天、克林顿的治国政绩根本无法相提并论。伪共“匿产帮”“粪坑党”们，披着“共产党”的外衣，对外大撒币、对内大印钞，制造地产浮夸风，到处掠夺欺压百姓，大肆抓捕7-0-9人权律师，居然还披着“法治”的外衣，公开跨境逮捕香港书商，破坏香港的大英法治环境，威胁台湾，污染美国之音，渗透文明世界，已经引起全人类的公愤。伪共“匿产帮”匪徒们不只是“共产党”的敌人，也是中华民族的毒瘤，是全人类的垃圾。\n\n如果彭丽媛能够做到类似武则天、克林顿那样的治理国家的水平，私生活淫乱根本不是罪过。 在现代社会，这也意味着武则天如果是在现代社会，她应该懂得尊重公共权力的透明运作，而不会热衷于以私生活为借口，到处去抓其它官僚，对于中南海的巨贪却装聋作哑。国家元首个人的私生活癖好是喜欢“共妻共夫”，还是比习仲勋更加严谨、更加规范，不搞类似习仲勋那样的婚外情，随意生产新的小习近平，那是元首的私生活问题，就如同美国前总统克林顿的问题类似，混乱的私生活，只要没有破坏公共权力，还是可以与公共权力切割开来。 \n\n如果公共权力运作透明，信息流畅，法治流畅，某些人即使比武则天更加热衷于“共妻共夫”，也至少会赢得类似武则天那样的荣誉，甚至可能获得类似沙俄女皇大帝叶卡捷琳娜女王那样的美誉。从“共产主义”的逻辑来看，某些热衷于“共妻共夫”的官员实际上是在践行马克思的局部“共产主义”。但是，当他们连官僚财产都不敢公开时，那就是披着“共产党”外衣的匿产帮蛆虫的“匿产共妻”孽障而已，而不再代表伟光正的“共产党”。 \n\n从“共产主义”的逻辑看，如果他们真的信仰“共产主义”乌托邦，如果习近平和彭丽媛真的是能够“不忘宪政初心，推动法治前进”，网友们强烈建议彭丽媛效仿黄艳那样，与中南海的新老常委广泛地开展“共妻”的英明活动，但不能搞比黄艳更无耻的活动，一边公开地宣称是要“依法治国”了，一边暗中搞文革复辟，而且搞文革复辟也搞得比毛泽东更差劲，丢掉了红二代的支持，还想让文革覆盖香港，公然跨境逮捕香港书商，制造法西斯暴政气氛的同时，已经在严重威胁台湾，让台湾部分即使盼望着两岸统一的华裔也被吓跑了！\n\n习近平在民间吃包子的宣传策划，很失败，可以是认为是经验不足。但是，公开抓捕7-0-9律师，以及为一些书籍出版而公然跨境逮捕香港书商，则显然不是一时疏忽的行为，而是故意策划，复辟文革，并且企图让支那蛆虫帮的文革覆盖香港。这种倒行逆施，显然比毛泽东愚蠢得多，也更加野蛮残暴，因为毛泽东清醒地知道，蛆虫帮的文革无法成功覆盖香港，因为大英法治的环境根本容不下罪恶滔天的大饥荒、粮食浮夸风、以及野蛮谋杀国家主席刘少奇等各种罄竹难书的罪孽。\n\n彭丽媛接手文艺工作后，打压言论的高压专政更加疯狂，逼迫香港和大陆的百姓不断地反抗。 香港该以何种方式应对文革复辟的蔓延呢？ \n\n古中华文明的周易哲理和马克思的唯物辩证法告诉世人，任何事物都有其两面性。习近平和彭丽媛就一无是处吗？当然也不是。细节稍后探讨。\n\n**[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)**\n** [转：洗雪当代国耻、废除辱习法规！ 零网 — 零封锁，广传播 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)**",
			"added": 1498986229
		},
		{
			"topic_id": 11,
			"title": "彭丽媛的淫乱黑幕—郭文贵爆料刮起蝴蝶效应 （四）",
			"body": "以“淫乱”为话题，借题发挥，展开一场统一虚拟主权的新文明运动，显得有点可笑，但在唯物主义过渡泛滥的时代，似乎也是顺应历史潮流的务实策略。 请不明真相的网友仔细看完内容，再做评价。完整的信息资料，放在零网—零封锁的网站—自由论坛。\n\n接前篇话题，习近平和彭丽媛表面上看起来比黄艳在经济层面没有那么严重的腐败，彭丽媛可能没有像黄艳那么积极地从事伟大的“匿产共妻”的光辉事业，但是习近平和彭丽媛在获得小部分集权后，就洋洋自得地认为“反腐败”已经取得“压倒性”的胜利，比蒋介石还更无耻、更无能，还没过完河，就开始拆桥了，把一些支持过习近平的、贪腐比较少的红二代比如刘亚洲、刘源等统统下岗，这样，反而很快就让习近平自己陷入了孤立无援的境地。\n\n毛泽东当年的手段虽然比习近平更加毒辣，但胸怀气量和智慧都远比习近平高超，无论有多么大的矛盾和不愉快，毛泽东都懂得，不可让有威望的周恩来、朱德随意下岗，或者随意打入牢房。 刘源协助习近平反腐败，打老虎，立下汗马功劳；刘亚洲虽然被抓出贪腐把柄，但不一定比其他人严重，而最重要的是，刘亚洲是很鲜明地支持宪政法治的人士，即使有一定的腐败，只要没有叛国，至少需要予以包容， 才能凝聚人气。如果是真的要一碗水端平，像刘源、刘亚洲这些觉悟比较高的人士，习近平完全可以采取类似规劝习家亲戚放弃经商的方式，规劝红二代们放弃经商，回吐来源不明的财富。只要没有叛国，红二代们的才干都应该得到积极的发挥，而不是以习包子一人之力，到处兼任组长，显得气量太小了！\n\n古中华文明的周易哲理和马克思的唯物辩证法告诉世人，任何事物都有其两面性。习近平和彭丽媛就一无是处吗？当然也不是。\n\n伟大的习核心连续几年依法治国，各种丰功伟绩可能争议很大。但最没争议、最伟光正的事迹应当属于翻越网络柏林墙，不经意间似乎有点要统一虚拟主权的意思。但是法西斯重庆居然冒天下之大不韪，把习核心的翻墙救国精神污蔑为犯罪。 伪共“匿产帮”蛆虫党的法西斯暴政已经造成了类似领土分裂那样严重的文化分裂、网络主权分裂、虚拟主权分裂。在这个特殊的时代，各地军民应当紧密团结起来，围绕在以习近平为核心的党中央周围，跨越网络柏林墙，统一虚拟主权。能去北京的人们，去北京抗议。不能去北京的，就地奋起抗争。\n\n这些信息是在努力突破网络封锁，自然不怕五毛党和七毛党们的信息轰炸。欢迎五毛党、七毛党们到零网拍砖，更欢迎普通网民们到零网争吵、争议，百花齐放，百家争鸣。\n\n网络柏林墙虽然没有直接封锁香港，但是9000多个特务进入香港，已经给香港造成法西斯的气氛。包括五毛党、七毛党在内的各种职业特务和业余特务们很多也是身不由己，只是把工作当成饭碗而已，而进入香港的国安特务们被迫去为蛆虫帮效力，是因为他们在大陆的家属受到蛆虫帮的控制。武警司令王建平因为贪图功利，被欺骗去参与黑暗的六四大屠杀，知道太多，已经被灭口了。王建平的蹊跷死亡，也像赵鑫那样，被自杀。被骗去泸州维稳的武警官兵们看到郭文贵爆料后，个个都非常后悔，而被迫去香港的国安特务们更加清楚，他们的命运也像王建平那样，随时都可能因为参与太多的犯罪，而被灭口。\n\n目前的情况非常特殊。习近平伟人领导的特色党国，实际上是一群连官员财产都不敢公布的“匿产帮”，而不是曾经支持过“共产主义”、把人民当人看的人民的“共和国”。此外，伟大领袖习近平伟人在2012年曾开立过推特页面，但是在2017年3月底重庆出台网络恐怖主义政策后，把习近平吓得立即在4月份就把推特页面都隐身龟缩起来。这个事实说明，习近平伟人根本就不具备前苏联男儿那样的勇气，更不能跟普京相提并论。 一些激进的网友甚至认为习近平可能只是东亚懦夫而已，而不是千古圣君。但由于习近平目前仍然是国家机器名义上的法人代表，为了避免被绑架习近平国家机器的盗国贼们利用特务权术，复制类似“六四”镇压那样的阴谋手法，在大规模的行动中，网友们应当尽量避免公开斥责习近平伟人是东亚懦夫。\n\n反复强调“千古圣君”，以拥护千古“圣君”的说法，推动一场大规模的爱国运动，只是为了尽量减少大规模的摩擦冲突。这种策略，既是务实的，也是对历史负责的。这就是郭文贵反复强调郭七条的缘故。不反习主席这一条，可以理解为不反对习主席翻墙救国、支持习近平统一虚拟主权，支持文化统一和国家统一。\n\n这些信息不是什么缺德话，只是解题发挥，让更多人突破网络封锁，目标是促进虚拟主权的统一。如果传播这些目标正当的内容也是违法的，那么，那些披着“共产党”外衣，却连官僚财产都不敢公布的“匿产帮”伪共早该下地狱了。伪共“匿产帮”蛆虫党还企图把文革覆盖香港，必然失败！！\n这些信息不是在抹黑习近平、彭丽媛，而是在提醒他们，如果毛泽东也像习近平那样专门使用下三滥的手段抓通奸，习仲勋就没机会与齐心结合，生产习近平伟人出来，如今竟然把文革复辟闹到香港去了，注定要失败。\n\n在这个特殊的历史阶段，香港人斥责伪共“匿产帮”“粪坑党”为支那人和支那国，实际上是抬举他们了。为了避免特务们混淆是非，制造大规模的摩擦冲突，大家一起明确地将反对的目标界定为不敢公开官僚财产的伪共“匿产帮”，而不是有数千万党员的“中共”，可以公开痛斥伪共“匿产帮”匪徒们是支那蛆虫、支那孽障。扫帚不到，灰尘不去；全民行动，反蛆除孽。反蛆除孽和反华反共没有一点关系。 港澳台信息和人员组织更自由，可以在香港公开发起爱国运动，以拥护千古“圣君”的名义，公开敦促香港政府支持习近平翻墙救国，公开要求废除辱习反华的网络柏林墙。香港小圈子选举出来的伪特首林郑月娥刚好要不断地展示效忠党国的诚意，经常强调爱党爱国，这种方式，将让林郑月娥、五毛党和七毛党们也找不到反对的理由。被欺骗去维稳的警察们也在不断觉醒，运动一旦发起，大陆军民都会积极响应。\n\n零网、零封锁，自由无国界！零网比推特或者/Facebook等更自由，不需要绑定邮箱或手机。请港澳台同胞多使用零网，探讨交流非暴力爱国运动。\n华夏同胞，行动起来！睁开眼吧，放声吼吧：习核心雄起、习核心不龟缩！中国梦不是狗的梦！废除法西斯围墙、洗雪当代国耻！全民行动，反蛆除孽；清除伪共匿产帮，恢复宪政共和；清除蛆虫党，恢复中华。\n\n\n**[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)**\n** [转：洗雪当代国耻、废除辱习法规！ 零网 — 零封锁，广传播 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)**",
			"added": 1498986339
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1_1END5A3waFfWMTk2DkPDx83CXaYzpnj788": [
			{
				"comment_id": 1,
				"body": "狗、习近平与中国人的耻辱！港澳台和大陆团结起来！— 郭文贵维权展望 \nhttp://127.0.0.1:43110/zybbs.bit/?Topic:1_19DbcsQyB2YM8zQJCiyB8jPB7JxvuwnxYh/\n\n把公网页面转换为http://127.0.0.1:43110/ ...... 开头的零网本机页面，是零封锁的网络创举！\nhttp://127.0.0.1:43110/NewGFWTalk.bit/?Topic:1_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/\nhttp://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13\n零网本机页面，需要零网软件浏览。\nhttps://zeronet.io/\n\n有疑问的网友们，应该这么反问：为何在重庆出台信息恐怖主义法规之后，习核心的推特就隐身了呢？这是偶然吗？\nhttp://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:7",
				"added": 1494075255
			}
		],
		"1_1Fv1xGsCxVzHNkCyCMLkJsXaqHSqc5VS45": [
			{
				"comment_id": 2,
				"body": "打倒/推翻/铲除....等激烈的方式一般都需要枪支武力配合。那就不属于非暴力的街头运动了，暴力革命的方式不适合在网络上面讨论。\n但是激烈抗争的思维还是要点赞的。\n这种激烈抗争的思维，转化为行动时，就会成为类似刘兵那样的勇士。\n关注勇士、齐心协力！\nhttp://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:8 \n勇士的精神绝对应该是点赞。刘兵上街时，强调他只是“街头抗议”，“很温和”，只是提出的口号是“铲除.... ”，这种激烈的口号很容易被专政土匪利用，扩大暴力冲突。\n\n郭文贵强调的郭七条，支持街头运动，但是不主张采取暴力。不采用暴力思维，自然要避免采用“铲除”、“推翻”之类的激烈口号。\n通过零网—零封锁的网络传播，希望更多人在思想认识上形成一致。一致的思想认识将激发方向一致的行动。从全局逻辑看，香港是可以公开组织游行的。运动无论是在大陆还是香港首先发动起来，结合零封锁的网络传播，会很快让很多地方跟进，产生连锁效应。\nhttp://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:3_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/ \n非暴力爱国运动大讨论，广泛地探讨传播，开展广泛的行动。\n",
				"added": 1494841915
			}
		],
		"1_1L3UBHScbiP33svDmiNfNnFLZzebNECgqC": [
			{
				"comment_id": 3,
				"body": "这个说法用来对付雾霾沦陷区里那些偏执于野蛮专政的五毛党，比较有说服力。\n伟光正的毛主席支持过宪政民主，极端反华反毛者试图污蔑毛主席为带路党，意味着也在污蔑伟大的习总书记为带路党同僚，这是很多人绝对无法接受的，包括毛左、五毛党们！！！\n伟大领袖毛主席和伟大领袖习核心都是不可以侮辱的，他们都不是带路党！更不是猪狗！\n\n狗、香港与中国的耻辱！\nhttp://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:1_19DbcsQyB2YM8zQJCiyB8jPB7JxvuwnxYh/ \n非暴力爱国运动大讨论，广泛地探讨传播，开展广泛的行动。",
				"added": 1494907001
			}
		]
	},
	"comment_vote": {}
}