{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1,
			"title": "Código-fonte do Windows XP e Server 2003 vazam na web",
			"body": "http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:2_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/C+digo+fonte+do+Windows+XP+e+Server+2003+vazam+na+web",
			"added": 1601736339
		},
		{
			"topic_id": 2,
			"title": "Informática",
			"body": "[Informática](https://pt.wikipedia.org/wiki/Inform%C3%A1tica) é um termo usado para descrever o conjunto das ciências relacionadas à coleta, armazenamento, transmissão e processamento de informações em meios digitais, estando incluídas neste grupo: a ciência da computação, os sistemas de informação, a teoria da informação, o processo de cálculo, a análise numérica e os métodos teóricos da representação dos conhecimentos e da modelagem dos problemas.",
			"added": 1601866129
		},
		{
			"topic_id": 3,
			"title": "TorrentGalaxy",
			"body": "TorrentGalaxy fornece torrents verificados. No TGx você pode baixar filmes, séries de TV, músicas, jogos, software, livros e muito mais.\n\n- https://torrentgalaxy.to/\n- Tor proxy: http://galaxy2gchufcb3z.onion/\n\n- TorrentGalaxy proxies: https://proxygalaxy.pw/ | http://pgx22lhr3wt7qmas.onion/",
			"added": 1602033131
		},
		{
			"topic_id": 4,
			"title": "Sepia Search: um mecanismo de busca de vídeos e canais do PeerTube",
			"body": "Site: https://sepiasearch.org/\nSource code: https://framagit.org/framasoft/peertube/search-index.git\n\n[PeerTube](https://joinpeertube.org/) aspira ser uma alternativa descentralizada e gratuita para o serviço de difusão de vídeos.",
			"added": 1602035799
		},
		{
			"topic_id": 5,
			"title": "A CIÊNCIA PRECISA DE PIRATARIA",
			"body": "A publicação de um artigo científico pode envolver uma rede de \"atravessadores\" que lucram com o conhecimento e limitam o acesso a ele. Nos últimos anos, alguns heróis têm tentado desarticular esse esquema. Infelizmente, desafiar o sistema tem um preço.\n- https://invidious.snopyta.org/A-6QrupOm1I\n- https://ipfs.io/ipfs/QmY1QkE98qTkbpw9fB3YmsSeyxVxvxFSfLyosRJbCBcwGZ\n\nReferências: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn_13",
			"added": 1602383949
		},
		{
			"topic_id": 6,
			"title": "GitHub remove o popular downloader de vídeos do YouTube ‘Youtube-dl’",
			"body": "O GitHub, de propriedade da Microsoft, removeu o [YouTube-dl](https://github.com/ytdl-org/youtube-dl/), um dos mais populares downloaders de vídeos gratuitos do YouTube, após receber um aviso legal de remoção da [Recording Industry Association of America](https://en.wikipedia.org/wiki/Recording_Industry_Association_of_America) (RIAA).\n\n[YouTube-dl](https://yt-dl.org/) é uma ferramenta popular para baixar áudio e vídeos do YouTube. No entanto, não está restrito ao YouTube e permite extrair vídeos de várias fontes, como Vimeo, DailyMotion, VEVO, CNN, etc.\n\nMais de 18 repositórios de código de downloaders do YouTube foram removidos do Github, todos relacionados ao YouTube-dl. Curiosamente, o projeto teve mais de 72.000 estrelas no GitHub.\n\nEm uma [carta enviada](https://github.com/github/dmca/blob/master/2020/10/2020-10-23-RIAA.md) ao GitHub, RIAA argumenta que o \"código-fonte do projeto foi desenvolvido e é comercializado com o objetivo de contornar as medidas tecnológicas do YouTube para permitir o acesso não autorizado às obras protegidas por direitos autorais de nossos membros e para fazer cópias e distribuições não autorizadas\".\n\n- Fonte: https://fossbytes.com/github-removes-popular-youtube-video-downloader-youtube-dl/\n\n#Espelho:\n- https://youtube-dl-sources.org/git/youtube-dl.git\n\n#[Espelhos](https://en.wikipedia.org/wiki/Mirror_site) alternativos:\n- [Torrent](magnet:?xt=urn:btih:062ac712832883089bcedd4f93c9ebb8903fe5e1&dn=youtube-dl.git&tr=udp%3a%2f%2ftracker.coppersurfer.tk%3a6969%2fannounce&tr=udp%3a%2f%2f9.rarbg.me%3a2850%2fannounce&tr=udp%3a%2f%2f9.rarbg.to%3a2920%2fannounce&tr=udp%3a%2f%2ftracker.opentrackr.org%3a1337%2fannounce&tr=udp%3a%2f%2ftracker.leechers-paradise.org%3a6969%2fannounce)\n\n- [IPFS](https://ipfs.io/ipfs/QmRiK1mVeQPdgob9oiNBY4fWVdTDiXnp6BSi5YT4ugTms9)\n\n#Mais espelhos aqui: https://youtube-dl-sources.org/",
			"added": 1603636670
		}
	],
	"topic_vote": {
		"5_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1
	},
	"next_comment_id": 149,
	"comment": {
		"1_1DJf8DgxdWYpZ1GMguWfX6mPGybGtjA5Sv": [
			{
				"comment_id": 1,
				"body": "#Torrent(Torrents na ZeroNet, Lista de Proxy do The Pirate Bay, etc)\n- http://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:3_1JENLe77ZY3BqSQEDkQ4iVNh5o21ipdXH9/The+Proxy+Bay\n\nTorrent é a extensão dos arquivos compatíveis com o protocolo de compartilhamento [BitTorrent](https://en.wikipedia.org/wiki/BitTorrent), uma tecnologia criada pela empresa também chamada BitTorrent, introduzida em 2001. Ela funciona criando uma rede [P2P](https://en.wikipedia.org/wiki/Peer-to-peer) entre todos os usuários do protocolo, com o intuito de distribuir arquivos entre todos os nós (os usuários) da rede.\n\nFunciona assim: em um modelo de rede [cliente-servidor](https://en.wikipedia.org/wiki/Client%E2%80%93server_model), um computador ou servidor fica responsável por armazenar e distribuir os dados em uma rede, enquanto os usuários, ou clientes, o acessam para utilizar as informações que procuram.\n\nA [computação em nuvem](https://en.wikipedia.org/wiki/Cloud_computing) nada mais é do que o modelo cliente-servidor aplicado à [internet](https://en.wikipedia.org/wiki/Internet), onde o fornecedor do armazenamento atua como o repositório dos dados.\n\nNo modelo P2P (de peer-to-peer, ou ponto-a-ponto), não existe um servidor dedicado, porque todos os usuários são também servidores. Cada um deles detêm os dados dos arquivos compartilhados, e ao mesmo tempo estão baixando e mantendo os arquivos disponíveis para outros na rede.\n\n- Fonte: https://web.archive.org/web/20200426075802/https://tecnoblog.net/285777/o-que-e-torrent/",
				"added": 1601734085
			},
			{
				"comment_id": 5,
				"body": "#magnetico: Suíte de mecanismo de pesquisa DHT Autônomo (auto-hospedado) do BitTorrent\n- https://labs.boramalper.org/magnetico/\n- https://github.com/boramalper/magnetico.git\n\nO BitTorrent, sendo um protocolo de compartilhamento de arquivos P2P distribuído, há muito sofre por causa das entidades centralizadas das quais as pessoas dependiam para pesquisar torrents (sites) e descobrir outros pares (trackers). A introdução de DHT (tabela hash distribuída) eliminou a necessidade de rastreadores, permitindo que os pares descobrissem uns aos outros por meio de outros pares e busquem metadados dos leechers e seeders na rede. magnetico é o movimento final que permite aos usuários pesquisar por torrents na rede, eliminando assim a necessidade de sites de torrent centralizados.",
				"added": 1601841855
			},
			{
				"comment_id": 143,
				"body": "#Um script para hospedar novamente seus repos [git](https://git-scm.com/) em [ipfs](https://ipfs.io/)\nhttps://github.com/whyrusleeping/git-ipfs-rehost.git",
				"added": 1603814550
			},
			{
				"comment_id": 144,
				"body": "#Yggdrasil - Rede IPv6 criptografada de ponta a ponta para conectar mundos\nhttp://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:1_17ZpHZGw3D1VZQN14QJFgK2zW41bQzAQ5R/Yggdrasil+Rede+IPv6+criptografada+de+ponta+a+ponta+para+conectar+mundos",
				"added": 1603814575
			},
			{
				"comment_id": 145,
				"body": "#FilePizza - Transferências de arquivos [ponto a ponto](https://en.wikipedia.org/wiki/Peer-to-peer) em seu navegador\n- https://file.pizza/\n- https://github.com/kern/filepizza.git",
				"added": 1603815098
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 2,
				"body": "#Kingdom\nNa China antiga, um menino sonha em se tornar o maior general do reino de Qin.\n- https://siasky.net/CACxv1gC6eJznFWMsq0qFymQulLniICafPx37IIyMKUgDQ\n\nMais informações: https://en.wikipedia.org/wiki/Kingdom_(film)#Plot",
				"added": 1601745969
			},
			{
				"comment_id": 3,
				"body": "#O Guarda-Costas em Ação (1994)\n- https://siasky.net/CABoocAmgvGgmmUmXy5KWLJfbxshXhNbzOp9INi5XdJMog\n\nHui Ching, é um guarda-costas contratado para proteger a linda, porém mimada Michelle, uma testemunha chave em um julgamento envolvendo um poderoso gangster. Hui, instala um verdadeiro arsenal de equipamentos eletrônicos, desde câmeras de segurança até detectores de bombas. Porém, ela não concorda com essas precauções, mas sabe de todo o real perigo em que se encontra. Hui, terá que enfrentar Wong Kin-Kwan, que está obcecado pelo desejo de vingança, em um explosivo ataque final.",
				"added": 1601751990
			},
			{
				"comment_id": 63,
				"body": "#Um Laço de Amor\n- https://siasky.net/AACAgNK4ZeyLnBOPJxjmiQyUdP_3mEic33kT4tcIZ6wiIg\n\nFrank Adler (Chris Evans) é um homem solteiro que cria sua jovem sobrinha Mary (Mckenna Grace), uma menina prodígio. Frank planeja oferecer uma vida escolar normal para a jovem de sete anos, mas os planos são frustrados quando as habilidades de matemática de Mary chama a atenção da mãe de Frank, Evelyn (Lindsay Duncan). Ela possui outros planos para a neta, que podem separar Frank e Mary.",
				"added": 1602186156
			},
			{
				"comment_id": 70,
				"body": "#Descartes (1974)\n\nA máxima “[cogito, ergo sum](https://en.wikipedia.org/wiki/Cogito,_ergo_sum)” (penso, logo, existo) foi o axioma sobre o qual [René Descartes](https://pt.wikipedia.org/wiki/Ren%C3%A9_Descartes) (1596 – 1650) fundamentou sua filosofia. Utilizando-se do método da análise matemática, procurou construir um sistema que impossibilitasse o erro, adotando a dúvida como método. Rejeitou, assim, tudo aquilo que pudesse ser considerado duvidoso para, no fim, advertir que a única verdade irrefutável era o ato de duvidar.\n\nO método de Descartes, denominado “cartesiano”, influenciou diversos pensadores. Sua obra mais conhecida é [Discurso do Método](https://ipfs.infura.io/ipfs/QmfQUTHkVby7SRJw3GB8QQjLGgSVMn8Y8uvfX2TR8Fvzmz).\n\nO filme [Descartes](https://www.imdb.com/title/tt0161382/), produzido por [Roberto Rossellini](https://en.wikipedia.org/wiki/Roberto_Rossellini), em 1974, procura abordar a vida e o pensamento do filósofo, fazendo recortes importantes sobre biografia de Descartes: https://siasky.net/AADny4tgJrEccDF6pu_Yjq6SM-4juGa7DqEL2nxvPYl_Kw",
				"added": 1602290148
			},
			{
				"comment_id": 71,
				"body": "#Guerra Mundial Z\n- https://siasky.net/CADyKqpxY33mn6Opt4cUlpu8wpCNsUpTDAAicaQfc4c2_A\n\nUma terrível e misteriosa doença se espalha pelo mundo, transformando as pessoas em uma espécie de zumbis. A velocidade do contágio é impressionante e logo o Governo americano recruta um ex-investigador da ONU (Organização das Nações Unidas) para investigar o que pode estar acontecendo e assim salvar a humanidade, tendo em vista que as previsões são as mais catastróficas possíveis. Gerry Lane (Brad Pitt) tinha optado por dedicar mais tempo a sua esposa Karen (Mireille Enos) e as filhas, mas seu amor a pátria e o desejo de salvar sua família acabam contribuindo para que ele tope a missão. Agora, ele precisa percorrer o caminho inverso da contaminação para tentar entender as causas ou, ao menos, indentificar uma maneira de conter o contágio até que se descubra uma cura antes do  apocalipse. Começa uma verdadeira corrida contra o tempo, que mostra-se cada vez mais curto, na medida que a população de humanos não para de diminuir.\n\n#Guerra Mundial Z | A Mãe Natureza é uma assassina em série\n- https://invidious.snopyta.org/QeVsBMcYj8U\n- https://siasky.net/AADkx8_PqAGdgkeN4c53flKSoNcLXiLYvcD4WSdW08KOXw",
				"added": 1602297959
			},
			{
				"comment_id": 76,
				"body": "#Parasita (2019)\n- http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:33_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/Parasita+2019+Dublado\n\n#Quem é o verdadeiro Parasita do filme?\n- https://invidious.snopyta.org/QgNkeF3b7QM\n- https://siasky.net/AABwszXcU79MAeV7H8J3_kRhhJtrMo6uN8sR__5ae0teCQ",
				"added": 1602437271
			},
			{
				"comment_id": 79,
				"body": "#Estrelas Além do Tempo\nhttp://127.0.0.1:43110/ZeroTorrent.bit/?Topic:53_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/Estrelas+Al+m+do+Tempo",
				"added": 1602458050
			},
			{
				"comment_id": 80,
				"body": "#Até o Último Homem\nhttp://127.0.0.1:43110/ZeroTorrent.bit/?Topic:54_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/At+o+ltimo+Homem",
				"added": 1602458894
			},
			{
				"comment_id": 81,
				"body": "> [theablet](#comment_80_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn): Até o Último Homem\n> http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:54_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/At+o+ltimo+Homem\n\n#ATÉ O ÚLTIMO HOMEM é historicamente preciso?\n- https://invidious.snopyta.org/_IevoLSFOuE\n- https://siasky.net/AABQhQxyZmRToYweYsbrGRkDM-jo_EF689Ch8qVqEl1HLA\n\nFONTES E BIBLIOGRAFIA: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn_15",
				"added": 1602461109
			},
			{
				"comment_id": 87,
				"body": "#O Túnel Transatlântico – Discovery Channel\n- https://invidious.snopyta.org/Ruaa8HGws6w\n- https://siasky.net/AAAKtisyfio6rA-P-_cEiOhZLgnFpBmFn4YDZu9trNgcXw\n\nTrens movidos à levitação magnética e com velocidade de aproximadamente 8000 km/h viajarão através de três túneis interconectados que ligarão a cidade de Nova Iorque até Paris. Estes túneis flutuaram a quase 200 m de profundidade, abaixo de icebergs e serão presos ao solo do oceano por cabos, pilares e hastes de aço. Os passageiros poderão comer, dormir e assistir aos seus filmes prediletos enquanto baleias e submarinos nucleares se movem silenciosamente ao redor do túnel.",
				"added": 1602553565
			},
			{
				"comment_id": 92,
				"body": "#Sansão e Dalila (1996)\n- https://swarm-gateways.net/bzz:/35ebfcc912fecbe956238e03f4286322e581719050a91085f6f17d1e142e3e6a/Sansao.e.Dalila.DVDRip.XViD.DualAudio.avi\n- SHA256: 093041D125B6F22C552E6765933CAB88896960F98CEAA9D1FCC6B87D6D74E1BE\n\n#Enredo: \n- https://www.imdb.com/title/tt0117547/\n- https://en.wikipedia.org/wiki/Samson_and_Delilah_(1996_film)#Plot",
				"added": 1602630580
			},
			{
				"comment_id": 94,
				"body": "#Matrix (1999)\n- https://siasky.net/CAAUXVxzx757FtfFtWm3VQqMYZ1eKnKM4xo5fZYMoR2y2g\n\nEm um futuro próximo, Thomas Anderson (Keanu Reeves), um jovem programador de computador que mora em um cubículo escuro, é atormentado por estranhos pesadelos nos quais encontra-se conectado por cabos e contra sua vontade, em um imenso sistema de computadores do futuro. Em todas essas ocasiões, acorda gritando no exato momento em que os eletrodos estão para penetrar em seu cérebro. À medida que o sonho se repete, Anderson começa a ter dúvidas sobre a realidade. Por meio do encontro com os misteriosos Morpheus (Laurence Fishburne) e Trinity (Carrie-Anne Moss), Thomas descobre que é, assim como outras pessoas, vítima do Matrix, um sistema inteligente e artificial que manipula a mente das pessoas, criando a ilusão de um mundo real enquanto usa os cérebros e corpos dos indivíduos para produzir energia. Morpheus, entretanto, está convencido de que Thomas é Neo, o aguardado messias capaz de enfrentar o Matrix e conduzir as pessoas de volta à realidade e à liberdade.",
				"added": 1602728453
			},
			{
				"comment_id": 96,
				"body": "#A Corrente do Bem (2000)\n- https://siasky.net/CACYqTlx8AzlTk52cEsirH3DBIgv78CZ6F5B6-3L6CGG8g\n\nEugene Simonet (Kevin Spacey), um professor de Estudos Sociais, faz um desafio aos seus alunos em uma de suas aulas: que eles criem algo que possa mudar o mundo. Trevor McKinney (Haley Joel Osment), um de seus alunos e incentivado pelo desafio do professor, cria um novo jogo, chamado \"pay it forward\", em que a cada favor que recebe você retribui a três outras pessoas. Surpreendentemente, a idéia funciona, ajudando o próprio Eugene a se desvencilhar de segredos do passado e também a mãe de Trevor, Arlene (Helen Hunt), a encontrar um novo sentido em sua vida.",
				"added": 1602781749
			},
			{
				"comment_id": 102,
				"body": "#O Evangelho de Mateus (1993)\n- https://invidious.snopyta.org/QEevYjGX_NY\n- https://siasky.net/CACH-Mv1XNFcVexBKOt7sXhcNlR6MM5LTyGitGrzdPol2A",
				"added": 1602967553
			},
			{
				"comment_id": 103,
				"body": "#A Cabana (2017) \n- https://siasky.net/EADC0zLGLEJYd-O34e-13yYUVUnMH1-YeLZWdKZYFPkB4Q\n\nMack Phillips (Sam Worthington) vive em luto após sua filha desaparecer. Evidências sugerem que ela foi violentada e brutalmente assassinada dentro de uma cabana. Anos após o crime, uma misteriosa carta o convoca para voltar ao suposto local do crime para um encontro. Lá, ele vai vivenciar experiências que mudarão sua vida.",
				"added": 1602970225
			},
			{
				"comment_id": 104,
				"body": "#Entrevista Com Deus\n- https://invidious.snopyta.org/2lUgkPlVwFw\n- https://siasky.net/AADwCuOOmig0cOaBk-tlgxm200tR4l5HGP4gByVaVGXZ8g\n\nO jornalista Paul Asher (Brenton Thwaites) atua cobrindo religião para o jornal \"Herald'. Após passar um tempo trabalhando no Afeganistão, ele está em busca de algo grandioso mais uma vez. É quando ele se depara com um intrigante senhor (David Strathairn) que diz ser Deus e que está pronto para lhe conceder a entrevista de sua vida.",
				"added": 1602978939
			},
			{
				"comment_id": 105,
				"body": "#Todo Poderoso\n- https://siasky.net/CACLStLH-RuxVyrtkC-XcXOTOmsgtxelI5pm0RTeBihz6Q\n\nA vida do jornalista Bruce Nolan (Jim Carrey) começa a desmoronar pouco a pouco. Infeliz com os recentes acontecimentos, ele passa a questionar e descontar a frustração em Deus. Em um encontro inesperado, o próprio todo-poderoso decide dar seus poderes a Bruce para mostrar as dificuldades de comandar a Terra.",
				"added": 1602980815
			},
			{
				"comment_id": 108,
				"body": "#Pânico no Metrô (2013)\n- https://invidious.snopyta.org/0OFJEffx1Ok\n- https://siasky.net/AAB_FbKL4eO4NgWDkmGLxWAhCJadXra9YPjR1KIpXHmq-Q\n\nO terror atinge o sistema de trem subterrâneo em Moscou na forma de uma inundação de um túnel destruído.",
				"added": 1602993540
			},
			{
				"comment_id": 123,
				"body": "#O Lança-Fogo (2010)\n[Firebreather](https://www.imdb.com/title/tt1782440/) conta a história de um estudante chamado Duncan Rosenblatt, filho de pais separados cuja mãe, jogadora de futebol, deseja que ele entre numa boa faculdade. Já o seu pai, um dragão gigante, quer que ele siga os negócios da família, que se baseiam em conquistar a Terra e herdar o trono de Rei dos Monstros. Duncan deve conciliar a sua vida familiar com a escolar, sustentadas por seus incríveis poderes de dragão.\n- https://ok.ru/video/38904728178\n- https://siasky.net/AAB_8Rxd9MUeHidsHEom8_QJWYTJ-CFQBuoKaj1OfFl15A",
				"added": 1603319862
			},
			{
				"comment_id": 133,
				"body": "#Um príncipe em Nova York\n- https://siasky.net/CADdq5DnzHwTxra3ql258-ueCv6Rqwz8YAyVTgXJWVHOew\n\nQuerendo mais da vida do que somente uma bela noiva, um príncipe africano vai para os EUA para encontrar alguém que se apaixone por ele, não pelo seu dinheiro.",
				"added": 1603588891
			},
			{
				"comment_id": 141,
				"body": "#Max: Fidelidade Assassina (1993)\n- https://invidious.snopyta.org/bSU7RQpIKm0\n- https://siasky.net/AAAi-fXPqRIIvTiRHVUNu3pXQhZ9-9PV1MtASYUHcG7sQw\n\nUm cão geneticamente modificado escapa da instalação científica onde foi criado. Uma família o acolhe sem saber de seus instintos mortais que logo emergem. O cientista que criou o cão tenta encontrá-lo antes que seja tarde demais.",
				"added": 1603745662
			},
			{
				"comment_id": 142,
				"body": "#Tempestade: Planeta em Fúria (2017)\n- https://siasky.net/CABafeY1AQ4vi-jNX_7iykkRx6yOyNuODdXiVSHXWygybg\n\nQuando a rede de satélites projetada para controlar o clima global começa a atacar a Terra, é uma corrida contra o relógio para seu criador descobrir a ameaça real antes que um Geostorm global destrua tudo e todos.",
				"added": 1603806845
			},
			{
				"comment_id": 146,
				"body": "#Construções Indestrutíveis Tornado vs Arranha céu HD Documentário Dublado National Geographic\n- https://yewtu.be/QIuY8Sb4Rmg\n- https://siasky.net/AADCCIORQz8WrIQnogWkq50xyqpkzglhqcYsP4UzPwfbbQ\n\n#Gigante da Engenharia - Túneis\n- https://yewtu.be/wY1yL_ywSMA\n- https://siasky.net/AAAvRBs8DuIAN3oybejzmpx6iORicu3sTMKU2NqKVKfapg\n\n#Engenharia Extrema: Cidade Subterrânea (Dublado) - Documentário Discovery Channel\n- https://yewtu.be/i3BjBtLdtJk\n- https://siasky.net/AABZgnQpTqvN-SeWPRAmSGgmb5_KfvLPyLWuZDU6J0pEyg\n\n#Engenharia Extrema: Cidade Flutuante (Dublado) - Documentário Discovery Channel\n- https://yewtu.be/5AQNKqCp2gg\n- https://siasky.net/AAD9-CO9OkWVkgbax8gScvu3C8Q-RQ3DuWtSbAGpWE6q2Q\n\n#Engenharia Extrema: O Céu É O Limite\n- https://yewtu.be/poj1Gfi1bAk\n- https://siasky.net/AAAxdkt0zk7SJDYBHrUnAm1K_smdM2sVbQZuie5SGSX-SQ\n\n#Megaconstruções - Barreira Contra o Mar\n- https://yewtu.be/hNpXQyhsEBw\n- https://siasky.net/CAAknczdGZaWs2XSmSTaioY3ht2DJjTsJO6m8V55sqYLIg",
				"added": 1603855116
			},
			{
				"comment_id": 147,
				"body": "#Brightburn: Filho das Trevas (2019)\n- https://siasky.net/CACBGOuSVlasiUeTKGcs4H4mVOT_zfkwxHSMQN3QDcgtoA\n\nUma criança de outro mundo cai na Terra, mas em vez de se tornar um herói para a humanidade, ele provou ser algo mais sinistro.",
				"added": 1603898215
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 4,
				"body": "> [flamethrower](#comment_8_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ): Inuyasha\n> A história se introduz com o jovem Inuyasha, que segundo a história desenvolvida por Rumiko Takahashi, é um hanyou (um meio-yōkai), por ser filho de um yōkai com uma humana, e vive no Japão feudal. Kagome, é uma colegial comum e reencarnação da sacerdotisa Kikyou, e que mora no Japão atual, e é puxada por um poço misterioso, perseguida por um monstro, e vai parar no Japão na época feudal (Sengoku Jidai), em um vilarejo. Lá encontra Kaede, e enquanto conversam, o monstro volta e tenta matar Kagome, e pegar a Joia de Quatro Almas (Shikon no Tama em japonês) que está em seu corpo, então ela foge para a floresta. Durante a perseguição, ela encontra Inuyasha (um meio-yōkai) que estava selado em uma árvore por uma flecha que foi lançada por Kikyou (falecida irmã mais velha de Kaede e encarnação de Kagome). Ele acorda e a chama de Kikyou, mas quando percebe que não é ela (depois Kaede revela que Kagome é a reencarnação de sua irmã), pede a Kagome para soltá-lo para salvá-la do monstro que a perseguia. Ela o solta, e ele destrói o monstro. Logo tenta matar Kagome também, para pegar a Joia de Quatro Almas, mas Kaede aparece e joga no pescoço de Inuyasha um rosário, pedindo para que Kagome fale uma palavra espiritual (qualquer palavra), que ela seria a chave para acalmar Inuyasha. Ela fala \"Senta\" (osuwari em japonês) inspirada nas orelhas do yōkai, e ele cai no chão. No outro dia, um yōkai corvo engole a Joia de Quatro Almas, e na tentativa de resgata-la, Kagome atira uma flecha nele, mas que acaba acertando a Joia de Quatro Almas também, que é despedaçada em centenas de pedaços e espalhados por todo Japão Feudal. Inuyasha, mesmo não gostando de Kagome (por ela ser muito parecida com Kikyou) é obrigado a se juntar a ela para juntar os fragmentos da Joia de Quatro Almas. Eles passam a depender um do outro pois Kagome sente a presença dos pedaços da Joia de Quatro Almas, e Inuyasha a protege contra os monstros que aparecem no caminho. Inuyasha quer a joia para se transformar em um yōkai completo e mais poderoso, e Kagome porque a despedaçou e tem essa obrigação. No começo os dois se odeiam, mas depois começam a se apaixonarem e futuramente se casam.\n> \n> https://www.superanimes.site/anime/inuyasha\n\n#InuYasha\n- http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:6_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/InuYasha\n\n#InuYasha: Kanketsu-hen\n- http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:7_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/InuYasha+Kanketsu+hen",
				"added": 1601774919
			}
		],
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 6,
				"body": "#Desec Security - Novo Pentest Profissional\nhttp://127.0.0.1:43110/ZeroTorrent.bit/?Topic:18_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/Desec+Security+Novo+Pentest+Profissional",
				"added": 1601853737
			},
			{
				"comment_id": 7,
				"body": "#Curso Pentest Profissional v2020\nhttp://127.0.0.1:43110/ZeroTorrent.bit/?Topic:19_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/Curso+Pentest+Profissional+v2020",
				"added": 1601854750
			},
			{
				"comment_id": 8,
				"body": "#Desec Security - Criptografia 0x65\nhttp://127.0.0.1:43110/ZeroTorrent.bit/?Topic:20_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/Desec+Security+Criptografia+0x65",
				"added": 1601856084
			},
			{
				"comment_id": 9,
				"body": "#Desec Security - Pentest Mobile\nhttp://127.0.0.1:43110/ZeroTorrent.bit/?Topic:21_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/Desec+Security+Pentest+Mobile",
				"added": 1601856118
			},
			{
				"comment_id": 25,
				"body": "#Sandboxie - software Sandbox para isolamento de aplicativos e navegação segura na Web\n\n[Sandboxie](https://www.sandboxie.com/) é um programa de sandbox de código aberto para Microsoft Windows. Sandboxie cria um ambiente operacional isolado no qual os aplicativos podem ser executados ou instalados sem modificar permanentemente o sistema local. Este ambiente virtual permite testes controlados de programas não confiáveis e navegação na web.\n\nA versão mais recente do Sandboxie (Win 7, 8.1 e 10 apenas) está disponível [aqui](https://siasky.net/AABc3j5Ka7rzfviszww2r4uznWGNFdJF2NTDNuwc1KNqyQ). (SHA256: 7080249BCDA91135ECE69FC9962B2E342B2EA5C73AB55C9D89B4A4D9749D01B5)\n\n-  GitHub: https://github.com/sandboxie/sandboxie.git",
				"added": 1601999768
			}
		],
		"2_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn": [
			{
				"comment_id": 10,
				"body": "#Curso [Hiren's Boot](https://www.hirensbootcd.org/)\n- [Como criar pendrive bootavel com o Hiren’s Boot](https://siasky.net/AAD4I9MMAf5sTCbHH_wkLDReaoy-MgivA1HkpeMhSYUPww)\n- [Como resolver o problema do windows reinicia toda hora (tela azul)](https://siasky.net/AABw3vWTskC2DvMdFz7GZAIuUjHv-Vm1Eyj0-XS6TMu8sA)\n- [Removendo ou quebrando senha do Windows Xp, 7, 8 e 10](https://siasky.net/AABdmscwuZ9gzJdSeFp0H10bYXQv0zzJc2H7S4bj8TIpcg)\n\nHiren’s BootCD (Download): http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:12_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/Hiren+s+BootCD\n\n[YUMI](https://www.pendrivelinux.com/) – Multiboot USB Creator (Download): https://siasky.net/_ABDERggi7gsJ8-_HJZ_4JREdLni6nkEaQPIIXm60m97Rw | SHA256: 5803B107B93ED2FFDF70AE4CB8C08131F217D8E4DEE04E5CC18B695FB933DD02\n",
				"added": 1601866407
			},
			{
				"comment_id": 11,
				"body": "#Como Descobrir/Burlar Senha da [BIOS](https://en.wikipedia.org/wiki/BIOS)\n- https://invidious.snopyta.org/-Yb_SR5oZ3o\n- https://siasky.net/AAD_HCsMuHDHWjfcuMr-85GAZz5dn1MuJjWyW9pb4AW71g\n\nSite: https://bios-pw.org/\nGitHub: https://github.com/bacher09/pwgen-for-bios.git",
				"added": 1601867481
			},
			{
				"comment_id": 47,
				"body": "#Lista de problemas não resolvidos em ciência da computação\n- https://en.wikipedia.org/wiki/List_of_unsolved_problems_in_computer_science\n- https://everipedia.org/wiki/lang_en/List_of_unsolved_problems_in_computer_science\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/List_of_unsolved_problems_in_computer_science.html",
				"added": 1602170670
			},
			{
				"comment_id": 69,
				"body": "#Segurança da informação\nhttp://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV/Seguran+a+da+informa+o",
				"added": 1602214209
			},
			{
				"comment_id": 118,
				"body": "#Linguagem de Programação Neon\nNeon é uma linguagem de programação de alto nível, estaticamente digitado, coletado, imperativo para ensinar e aprender o ofício da programação. Seu design empresta recursos de muitas [linguagens populares](https://neon-lang.dev/motivation.html), mas evita cuidadosamente [erros comuns](https://neon-lang.dev/common-errors.html) encontrados por programadores iniciantes em outras linguagens.\n- https://neon-lang.dev/\n- https://github.com/ghewgill/neon-lang.git",
				"added": 1603317478
			},
			{
				"comment_id": 119,
				"body": "#A linguagem de programação V - Simples, rápido, seguro, compilado. Para o desenvolvimento de software sustentável.\n- https://vlang.io/ \n- https://github.com/vlang/v.git\n\nVocê pode aprender a linguagem inteira examinando a [documentação](https://github.com/vlang/v/blob/master/doc/docs.md) em meia hora e, na maioria dos casos, há apenas uma maneira de fazer algo.\n\nIsso resulta em um código simples, legível e sustentável.\n\nApesar de ser simples, V dá muito poder ao desenvolvedor e pode ser usado em praticamente todos os campos, incluindo programação de sistemas, webdev, gamedev, GUI, mobile (wip), science, embedded, tooling, etc.\n\nV é muito semelhante a [Go](https://golang.org/). Se você conhece Go, já conhece ≈80% de V. Things V melhora com Go: https://vlang.io/compare#go",
				"added": 1603317835
			},
			{
				"comment_id": 120,
				"body": "#Programação de computadores\nhttp://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9/Programa+o+de+computadores",
				"added": 1603317949
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 12,
				"body": "#Matemáticos abrem uma nova frente para um antigo problema de números\n\nPor milênios, os matemáticos se perguntaram se existem [números perfeitos](https://en.wikipedia.org/wiki/Perfect_number) ímpares, estabelecendo uma lista extraordinária de restrições para os objetos hipotéticos no processo. O insight sobre essa questão pode vir do estudo das próximas melhores coisas.\n\n- Clearnet: https://web.archive.org/web/20200917083619/https://www.quantamagazine.org/mathematicians-open-a-new-front-on-an-ancient-number-problem-20200910/\n- Onion: http://web.archivebyd3rzt3ehjpm4c3bjkyxv3hjleiytnvxcn7x32psn2kxcuid.onion/web/20200917083619/https://www.quantamagazine.org/mathematicians-open-a-new-front-on-an-ancient-number-problem-20200910/",
				"added": 1601921409
			},
			{
				"comment_id": 13,
				"body": "#O problema de Lang e uma generalização dos Teoremas de Stäckel\n- https://ipfs.infura.io/ipfs/QmV2p9kdL8sxemjaSYHNwU4oMxiqNKBf1hHkbRRYcr8G68\n\nConsidere o corpo E obtido de Q, adjuntando valores da função exponencial, tomando fecho algébrico, e iterando essas duas operações e o corpo L obtido da mesma maneira com a aplicação de logaritmo, ao invés de exponenciação. Provamos que se a Conjectura de Schanuel é verdadeira, então E e L são linearmente disjuntos sobre Q, generalizando um problema sugerido por Lang. Sejam P(x),Q(x) 2Q(x) funções racionais não constantes. Usando o Teorema de Gelfond-Schneider, mostraremos a existência de números algébricos que podem ser escritos da forma P(T)Q(T), para algum T transcendente. Como aplicação explicitamos uma classe infinita de números transcendentes T, tais que TT é algébrico. Por fim, supondo a veracidade da conjectura de Schanuel, provamos a existência de números algébricos da forma TT, com T transcendente. Seja ƒ uma função inteira, e seja Sf o conjunto de todos os pontos algébricos α Є C, para os quais ƒ(α) é também algébrico. Em 1886, Weierstrass levantou uma questão sobre os possíveis Sf, conhecido como o conjunto excepcional de ƒ. Provaremos um resultado sobre valores complexos de funções inteiras, que em particular mostra que para todo A С Q, a “equação” Sf = A, possui incontáveis soluções ƒ no espaço das funções inteiras hipertranscendentes.",
				"added": 1601921827
			},
			{
				"comment_id": 14,
				"body": "#Minicurso de [Irracionalidade](https://en.wikipedia.org/wiki/Irrational_number) e [Transcendência](https://en.wikipedia.org/wiki/Transcendental_number) - [Diego Marques](http://diego.mat.unb.br/index.html)\n- [Irracionalidade de √2 = 1.41421... (05/11/2012)](https://siasky.net/AAD-y26iqSIhTzJ7bfC6kqAgwqaa0KiT-mvS74mwaD8IRw)\n- [Irracionalidade da Constante de Euler e = 2.71828... (06/11/2012)](https://siasky.net/AACvAI-oi3SmOZPibKu9hVC7lH1tBe581OJ46StW8rdfMw)\n- [Irracionalidade de π = 3.14159... (07/11/2012)](https://siasky.net/AAAmzrpSfZzVC7V53lW6CMIBeoer8ivU9ctoOPLuuh4X5Q)\n- [Irracionalidade de ζ(3) = 1.20205... (08/11/2012)](https://siasky.net/AADzzEaD5XmY-O-FC-q7Rkmg79qqVHuuBCmAjnNO7TZuLQ)\n- [Números Algébricos e Transcendentes (09/11/2012)](https://siasky.net/AACec9DBqNF0lvxIrgf-0xaoFjeF5YtsgO2TwsN81yeCFg)",
				"added": 1601925307
			},
			{
				"comment_id": 15,
				"body": "#A Função W de Lambert\n- https://invidious.snopyta.org/FUjpLp3wEac\n- https://siasky.net/AAAD5ZwyXQCKKwVP5Zkak7V5cBj1HpiRbXEXVKjClnIJwQ\n\nDois desafios de exponenciação e a salvação chamada [Função W de Lambert](https://en.wikipedia.org/wiki/Lambert_W_function). \n\nResolução dos problemas propostos no final do vídeo:\n- [Problema 1](https://ipfs.infura.io/ipfs/QmUNfmAmqjB1jpL9amrWPafuQiZSfreWE9vXw8SsdCNono)\n- [Problema 2 e 3](https://ipfs.infura.io/ipfs/QmVS36qEMvSzbX1HMsgyyGffsSsZ7R2fZKwgTydfiJRvV8)\n- [Problema 4](https://ipfs.infura.io/ipfs/QmYfK6EdsVkiQVHsaBud3JYA2q2uhthzBpZx5wXpEGFBAb)\n\nPara aplicações na matemática, física e química, confira o link abaixo:\n- https://ipfs.infura.io/ipfs/QmZUbQTookZGSDss4mrwEeUbeJsnQSF4SKCxk63SzE4ech\n\nPré-requisitos:\n- [Função Inversa](https://en.wikipedia.org/wiki/Inverse_function)\n- [Função Composta](https://en.wikipedia.org/wiki/Function_composition)\n- [Logaritmos](https://en.wikipedia.org/wiki/Logarithm)",
				"added": 1601926344
			},
			{
				"comment_id": 16,
				"body": "#Como resolver uma equação do 3º grau?\n- https://invidious.snopyta.org/Yv04zf8dJ3w\n- https://siasky.net/AADxf9X7Woupll5kIkCZmoM4hN-cS_OhQDEAa15imr2WzQ",
				"added": 1601931245
			},
			{
				"comment_id": 17,
				"body": "#Como Calcular π (pi) Com Uma Enquete do Instagram?\n- https://invidious.snopyta.org/8jTBabq24pA\n- https://siasky.net/AACFQGWifz3v1eavgEOx4rGgX1KTxoqJYy9TUsNvLMSvcg\n\nNesse vídeo você vai aprender como uma enquete do Instagram pode servir para calcular o valor de [pi](https://en.wikipedia.org/wiki/Pi).\n\nProva geométrica do problema de Basel (Soma dos inversos dos quadrados dos naturais igual a π²/6): https://siasky.net/AACLr1ZfQbBSDukyNtNn7OfL9mehqDALJ1lJ70ItUXmC-Q\n\nPré-requisitos:\n- [Probabilidade](https://en.wikipedia.org/wiki/Probability)\n- [Problema da Basileia](https://en.wikipedia.org/wiki/Basel_problem) (Basel)\n- [Números Primos](https://en.wikipedia.org/wiki/Prime_number) e [Números Primos entre si](https://en.wikipedia.org/wiki/Coprime_integers)",
				"added": 1601931517
			},
			{
				"comment_id": 18,
				"body": "#A Solução Matemática Para Acabar com o Coronavírus ([COVID-19](https://pt.wikipedia.org/wiki/COVID-19))\n- https://invidious.snopyta.org/UtSkobe2qSI\n- https://siasky.net/AACa5lSKTfgtOCd9IADvptoERctVCzcywqBuzxIZM_bneQ\n\nBrincadeiras a parte, se colocássemos todas as pessoas do mundo igualmente distribuídas pela face da [Terra](https://pt.wikipedia.org/wiki/Terra), qual seria a distância entre elas?\nTeses utilizadas como base para grande parte do vídeo:\n- https://ipfs.infura.io/ipfs/QmYm9CJqxAbmk7gvM4ptb2WSTVp9RCCGJATfErDq3Sv5v6\n- https://ipfs.infura.io/ipfs/QmSfS7v2x643EfHmSKPqwx3Ryg1S2tG3SqhXLwoK8EYKUy\n\nPré-requisitos:\n- [Poliedros](https://en.wikipedia.org/wiki/Polyhedron) e [Relação de Euler](https://web.archive.org/web/20200509160227/https://brasilescola.uol.com.br/matematica/relacao-euler.htm)\n- Volume de [Esferas](https://en.wikipedia.org/wiki/Sphere)",
				"added": 1601933165
			},
			{
				"comment_id": 19,
				"body": "#Todas as pessoas do mundo de mãos dadas são capazes de darem uma volta na Terra?\n- https://invidious.snopyta.org/UtSkobe2qSI\n- https://siasky.net/AAAP7c3u0prWUI6NJGNMeHCagB2YkncOeCCdb04zUoWsPA\n\nPré-requisito:\n- [Comprimento de Circunferências](https://web.archive.org/web/20180218131826/https://brasilescola.uol.com.br/matematica/comprimento-Area-circunferencia.htm)",
				"added": 1601933803
			},
			{
				"comment_id": 20,
				"body": "#O Método MAIS RÁPIDO de Decomposição em Frações Parciais\n- https://invidious.snopyta.org/ynMRQIpooAc\n- https://siasky.net/AABfYUd0qUamwPJPAHZDnxJs5wYN_Pm5tp3eMsaAuWxpPA\n\nComo funciona o [método Heaviside](https://en.wikipedia.org/wiki/Heaviside_cover-up_method) para [decompor em frações parciais](https://en.wikipedia.org/wiki/Partial_fraction_decomposition)? Perfeito para frações com raízes simples e raiz dupla! \n\nTem como generalizar para fatores irredutíveis, você pode decompor normalmente em fatores cujas raízes são complexas aplicando o método normalmente e depois juntando as frações complexas. A ideia geral está no link abaixo:\n- https://ipfs.infura.io/ipfs/Qme29WM3jSKSxfURBzFk7nALsPB6H19uGpNsgJ5DqJS2Tx",
				"added": 1601935882
			},
			{
				"comment_id": 21,
				"body": "#Você conhece o Paradoxo de Simpson em estatística? | Minuto da Física\n- https://invidious.snopyta.org/FBsVRJVA0ro\n- https://siasky.net/AAB7god_wwDy0p9z1sIWERlYUxx7hhRgQyGEKqHnNS7JCA\n\n \nEste vídeo é sobre o [paradoxo de Simpson](https://en.wikipedia.org/wiki/Simpson%27s_paradox), um paradoxo estatístico e uma falácia ecológica em que resultados aparentemente contraditórios são implicados por um único conjunto de dados dependendo de como ele é agrupado. O paradoxo pode surgir nos estudos médicos, nos resultados dos testes dos alunos e assim por diante.",
				"added": 1601936577
			},
			{
				"comment_id": 22,
				"body": "#O Método MAIS RÁPIDO de Resolver Inequações\n- https://invidious.snopyta.org/yO5IW07je8s\n- https://siasky.net/AABa1pP7lNhwToVHg4yNxPW_mR1QlhS20_L6wS09-FV0EA\n\nPré-Requisitos:\n- Função: https://en.wikipedia.org/wiki/Function_(mathematics)#Definition\n- Inequações: https://web.archive.org/web/20200806125408/https://cursoenemgratuito.com.br/inequacoes/",
				"added": 1601937006
			},
			{
				"comment_id": 24,
				"body": "#Como entender de onde vem as funções e fórmulas da [trigonometria](https://en.wikipedia.org/wiki/Trigonometry)\n- https://invidious.snopyta.org/inQdvutmF58\n- https://siasky.net/AAA4eVJiwtUYRNfM-1SMyjFEKO52AvkhRsDiL3huToXk6A\n\n#Uma maneira simples de entender de onde vem o cálculo da [Integral](https://en.wikipedia.org/wiki/Integral)\n- https://invidious.snopyta.org/HLg_UKffY5o\n- https://siasky.net/AAA-OgWWI9IZ5SiAAMjlgdGcheAUjJpkL9wZrx5GFcdG1w\n\n#Um pouco da origem do [Método dos Mínimos Quadrados](https://en.wikipedia.org/wiki/Least_squares)\n- https://invidious.snopyta.org/7c9-p8WYZto\n- https://siasky.net/AAACnbrFmsHxGewPYdrv2K0WquHESYgqrdgcMLHU3Bualw\n\n#Já parou pra pensar de onde vem as equações das [Cônicas](https://en.wikipedia.org/wiki/Conic_section) em matemática? Vamos descobrir.\n- https://invidious.snopyta.org/djGLWQC2hk0\n- https://siasky.net/AAB2rZn3HM9NKdipaZqv0SG_FFESjAarNao2v_bohxYGuQ",
				"added": 1601952285
			},
			{
				"comment_id": 32,
				"body": "> [kieroche](#comment_8_166bg3kY3NQeuDm3zbQmYab6RwJGcw53Nr): A Hora da Matemática: Problemas em aberto envolvendo matemática elementar\n> https://invidio.us/gqjFLvMi8XY\n> Matemática - Problemas de (quase) um milhão de dólares\n> https://invidio.us/2-9PbEh8cFw\n> Palestra: \"Conjecturas e problemas em aberto\"\n> https://invidio.us/sE7V7F8GOgM\n> 2018 - Problemas em Aberto em Teoria dos Grafos\n> https://invidio.us/bQtd1YQXEOo\n> A Hora da Matemática - Palestra: “A Conjectura 3x + 1”\n> https://invidio.us/G-nQAPm9TlQ\n> A Hora da Matemática: Conjectura Jacobiana – Uma conjectura aberta\n> https://invidio.us/kHIjWHFr628\n\n#A Hora da Matemática - Problemas em aberto envolvendo matemática elementar\n- https://siasky.net/AABCdXfs047DSZ2SlNBUj34V4u4F3AUfE77Xa1horwTPSg\n\n#Problemas de (quase) um milhão de dólares\n- https://siasky.net/AACFYBhr6KwzRRUFv_il3f9cX7X5Ibr65Iyhxl00i6hRQw\n\n#Palestra - 'Conjecturas e problemas em aberto'\n- https://siasky.net/AADPZo--nwz0dIU06Fa-bJ2Uo99Nm64OA_tq4KeBQie5-Q\n\n#2018 - Problemas em Aberto em Teoria dos Grafos\n- https://siasky.net/AAByi4e9qkajX2o0z3fbnayM1iu7AqCEOGJBRm7KBqnosw\n\n#A Hora da Matemática - Palestra - “A Conjectura 3x + 1”\n- https://siasky.net/AAA7dnTa96ZvcZagxhZJ-y85piiVbyPoZSbkbpDBIhosXA\n\n#A Hora da Matemática - Conjectura Jacobiana – Uma conjectura aberta\n- https://siasky.net/CACRBI-PS-fbfURb3riHzpey7ZIx5Cbt9rI_bBypoAw4Dw",
				"added": 1602125604
			},
			{
				"comment_id": 33,
				"body": "#Problemas Matemáticos para o Século XXI\n- https://web.archive.org/web/20180513032505/http://www.ifba.edu.br/dca/Corpo_Docente/MAT/EJS/PROBLEMAS_MATEMATICOS_DO_SECULO_XXI.pdf\n\nA [conjectura de Poincaré](https://en.wikipedia.org/wiki/Poincar%C3%A9_conjecture) foi resolvida pelo matemático russo [Grigori Perelman](https://en.wikipedia.org/wiki/Grigori_Perelman).",
				"added": 1602126729
			},
			{
				"comment_id": 37,
				"body": "#Lista de problemas não resolvidos em matemática\n- https://en.wikipedia.org/wiki/List_of_unsolved_problems_in_mathematics\n- https://everipedia.org/wiki/lang_en/List_of_unsolved_problems_in_mathematics\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/List_of_unsolved_problems_in_mathematics.html",
				"added": 1602169390
			},
			{
				"comment_id": 41,
				"body": "#Lista de problemas não resolvidos nas estatísticas\n- https://en.wikipedia.org/wiki/List_of_unsolved_problems_in_statistics\n- https://everipedia.org/wiki/lang_en/List_of_unsolved_problems_in_statistics\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/List_of_unsolved_problems_in_statistics.html",
				"added": 1602169901
			},
			{
				"comment_id": 43,
				"body": "#Lista de problemas não resolvidos na teoria da informação\n- https://en.wikipedia.org/wiki/List_of_unsolved_problems_in_information_theory\n- https://everipedia.org/wiki/lang_en/List_of_unsolved_problems_in_information_theory\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/List_of_unsolved_problems_in_information_theory.html",
				"added": 1602170184
			},
			{
				"comment_id": 72,
				"body": "#Fundamentos da Geometria - [David Hilbert](https://en.wikipedia.org/wiki/David_Hilbert)\nhttps://ipfs.infura.io/ipfs/QmPo381KGFWhGvyUq2maK151Q8Pp1JM79KM57SdnNKDnBJ",
				"added": 1602298301
			},
			{
				"comment_id": 73,
				"body": "#Os Elementos\n- https://ipfs.infura.io/ipfs/QmW49xh3aKkBhuZ1DnuHvhpkdUfcnGpzRaMVuUHF8LPHy5\n\nOs Elementos de Euclides é um tratado matemático e geométrico consistindo de 13 livros escrito pelo matemático grego [Euclides](https://en.wikipedia.org/wiki/Euclid) em Alexandria por volta de 300 a.C.. Ele engloba uma coleção de definições, postulados, proposições e provas matemáticas das proposições.",
				"added": 1602298555
			},
			{
				"comment_id": 88,
				"body": "#O teorema de Green-Tao: progressões aritméticas de tamanho arbitrariamente grande formadas por primos\n- https://ipfs.infura.io/ipfs/QmbY5W4Nbc2E7dtjVzb418VUjGba3drtsSvbWiSZ9iWMLA\n\nEncontrar subestruturas aditivas que revelam um certo grau de organização em certos conjuntos contidos nos números naturais é o foco do estudo da combinatória aditiva. Desta área, resultados como os famosos Teorema de Van der Waerden e o Teorema de Szemerédi se destacam, revelando através de métodos combinatoriais que certas propriedades referentes ao tamanho de subconjuntos de inteiros implicam a existência de progressões aritméticas de tamanho arbitrariamente grande. Em meados de 1970, Furstenberg causou certa comoção no meio matemático ao publicar provas para ambos os teoremas usando métodos e ferramentas da teoria ergódica. Apesar de tal abordagem ter apresentado uma nova e profunda ligação entre as áreas, houve certa crítica pelo fato de não gerar resultados originais e por suas limitações (por exemplo, seus resultados costumam ser de caráter assintótico, sem lidar com limitantes e cotas, amplamente conhecidos pelos métodos combinatórios). Tais críticas foram silenciadas quando Ben Green e Terence Tao, usando tais métodos de teoria ergódica, demonstraram a incrível e bela afirmação de que os primos possuem progressões aritméticas de tamanho arbitrariamente grande, dando uma resposta definitiva para um enunciado conjecturado há muito tempo. Certamente, este foi um grande passo na matemática do século XXI. Deste então, novas abordagens foram amplamente estudadas e analisadas, de modo a aumentar ainda mais nossa compreensão sobre estes impressionantes conceitos.",
				"added": 1602610213
			},
			{
				"comment_id": 89,
				"body": "#Os teoremas de Ramsey e Freiman e suas aplicações envolvendo conjuntos com progressões aritméticas\n- https://ipfs.infura.io/ipfs/QmbD5LQyXxf3j4sE2ixw75YhS3cBGQ4CbGk7tM1K5As7ZZ\n\nEssa dissertação trata da teoria combinatória dos números em conjuntos finitos de inteiros contendo progressões aritméticas, bem como da teoria de Ramsey, do teorema de Szemerédi e de alguns resultados adjacentes importantes. Além de apresentar o teorema de Freiman e exibir uma demonstração de uma generalização do teorema de Freiman, dada por Ruzsa, nós daremos duas importantes aplicações deste teorema, sendo que uma delas prova a versão quantitativa de uma conjectura de Erdös.",
				"added": 1602610346
			},
			{
				"comment_id": 90,
				"body": "#Teoria ergódica: uma introdução e aplicações à teoria dos números.\n- https://ipfs.infura.io/ipfs/QmSTfoVCTpj5PwYktT6AvRmpaaHjZd4senc5iZrqtHfHNu\n\nEm 2006, Ben Green e Terence Tao provaram que existem progressões aritméticas de tamanho arbitrário formadas somente por primos. As idéias aplicadas na prova não foram da Teoria dos Números e sim adaptações de idéias da Teoria Ergódica e Análise Harmônica. Consequentemente, a Teoria Ergódica voltou a chamar a atenção da comunidade científica, devido à sua grande interação com outras áreas. Esse trabalho desenvolve essa perspectiva, partindo de ferramentas básicas da Teoria Ergódica a aplicações à Teoria dos Números. O Capítulo 1 trata da Teoria da Medida e fixa notações para o que segue, além de discutir exemplos. No Capítulo 2, provamos a principal ferramenta para o que segue, que é o Teorema Ergódica de Birkhoff. Ele possibilita obtermos várias propriedades interessantes da expansão decimal e da representação em frações contínuas dos números reais. O Capítulo 3 trata da interação da Teoria Ergódica com a Teoria dos Números, cujo principal teorema aqui demonstrado é o de Van der Waerden. Esse é um resultado puramente combinatório. Aqui, ele será obtido por intermédio do Teorema Múltiplo de Birkhoff. Por ﬁm, fazemos um “sketch” dos principais resultados da área.",
				"added": 1602610510
			},
			{
				"comment_id": 93,
				"body": "#O GRANDE PODER da MATEMÁTICA - Observatório do Mundo - Documentário\n- https://invidious.snopyta.org/nwVAUG67PFY\n- https://siasky.net/CAC9hWh0dhLqK3QHjOzukd5LydR0v8Yt5PcP1To5Pgp0wg",
				"added": 1602643401
			},
			{
				"comment_id": 130,
				"body": "#A Evolução da Confiança\nUm guia interativo sobre a cooperação segundo a [teoria dos jogos](https://en.wikipedia.org/wiki/Game_theory)\n- JOGUE AQUI: https://siasky.net/KABmJ1NS_6cUzFHTire09b-fcWKBRRn9hgVbwZxmvh-j4A\n- GitHub: https://github.com/rogeraraujo/trust.git",
				"added": 1603458019
			},
			{
				"comment_id": 131,
				"body": "#Probabilidade Bayesiana: Conjecturas, lógica e aplicações\n- https://ipfs.infura.io/ipfs/QmZiSxi3qapfTpHxZbXn61ammjjuD6VddrSk9Ds7YJMpgn\n\nO Teorema de Bayes descreve a probabilidade de um evento em termos de informações a priori, comumente estudada como Probabilidade Condicional. Porém, essa relação permite que a probabilidade seja interpretada como uma medida da plausibilidade de uma expectativa ou de uma crença pessoal. Dessa forma, a Probabilidade Bayesiana pode ser usada para validar estatisticamente se uma teoria científica está correta frente aos resultados experimentais ou se um acusado ́e culpado frente às provas apresentadas. Nesse projeto, será explorado o conceito de Probabilidade Bayesiana, apresentado sua fundamentação teórica e serão propostas formas de trabalhar o uso da lógica, probabilidade e estatística com os alunos do ensino médio. Serão propostas sugestões de aplicação do Teorema de Bayes em sala de aula de forma contextualizada em duas frentes: Utilizando a Probabilidade Condicional e a linguagem Inferência de Parâmetros. Em ambos os casos as sugestões conterão dicas para a aplicação do conteúdo no ensino médio, como introdução atividade, desenvolvimento, questionamentos, suporte pedagógico, além das resoluções com detalhes.",
				"added": 1603465575
			},
			{
				"comment_id": 132,
				"body": "#Padrões, Conjecturas e algumas Curiosidades sobre Determinantes\n- https://ipfs.infura.io/ipfs/QmR75LKPv4evwKeuUZGfRsrX7oZAmuYpFDjKdy8Dq2HYRH\n\nA presente pesquisa nasceu da necessidade de ofertar novas abordagens pedagógicas que venha desenvolver o pensamento matemático no estudo de [determinantes](https://en.wikipedia.org/wiki/Determinant) no Ensino Médio, visando o protagonismo estudantil na aprendizagem da Matemática. Diante disso, a investigação matemática, com o auxílio do Maxima, permitiu criar atividades por meio da análise de padrões com determinantes de matrizes, formulação de conjecturas, generalizações e demonstrações de algumas proposições matemáticas utilizando apenas as propriedades deste objeto de estudo. Neste trabalho também é apresentado a demonstração do Teorema Elementar de Laplace e o Teorema de Laplace Generalizado para determinantes. Com base nessas propriedades, construímos algoritmos alternativos, por meio de fórmulas recursivas, para o cálculo de determinantes de matrizes tridiagonais e comparamos sua performance em função do número de operações aritméticas.",
				"added": 1603465892
			},
			{
				"comment_id": 139,
				"body": "#Intuicionismo matemático\n- https://ipfs.infura.io/ipfs/QmQ8Y72n2bGcYcGMikcWw2g1g35eLjx2RnZ8yJLBCRHZs2\n\n[L. E. J. Brouwer](https://en.wikipedia.org/wiki/L._E._J._Brouwer), o fundador do intuicionismo matemático, acreditava que a matemática e seus objetos deveriam ser humanamente compreensíveis. Ele iniciou um programa reconstruindo a matemática moderna de acordo com esse princípio. Este livro apresenta o leitor ao núcleo matemático do intuicionismo - da teoria dos números elementares ao teorema da continuidade uniforme de Brouwer - e aos dois tópicos centrais do 'intuicionismo formalizado': lógica intuicionista formal e sistemas formais para análise intuicionista. Com base nisso, o livro propõe uma base filosófica sistemática para o intuicionismo que tece doutrinas sobre compreensão humana, objetos matemáticos e verdade matemática.",
				"added": 1603695401
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 23,
				"body": "A sabedoria está clamando, o discernimento ergue a sua voz;\nnos lugares altos, junto ao caminho, nos cruzamentos ela se coloca;\nao lado das portas, à entrada da cidade, portas adentro, ela clama em alta voz:\n\"A vocês, homens, eu clamo; a todos levanto a minha voz.\nVocês, inexperientes, adquiram a prudência; e vocês, tolos, tenham bom senso.\nOuçam, pois tenho coisas importantes para dizer; os meus lábios falarão do que é certo.\nMinha boca fala a verdade, pois a maldade causa repulsa aos meus lábios.\nTodas as minhas palavras são justas; nenhuma delas é distorcida ou perversa.\nPara os que têm discernimento, são todas claras, e retas para os que têm conhecimento.\nPrefiram a minha instrução à prata, e o conhecimento ao ouro puro,\npois a sabedoria é mais preciosa do que rubis; nada do que vocês possam desejar compara-se a ela.\n\"Eu, a sabedoria, moro com a prudência, e tenho o conhecimento que vem do bom senso.\nTemer ao Senhor é odiar o mal; odeio o orgulho e a arrogância, o mau comportamento e o falar perverso.\nMeu é o conselho sensato; a mim pertencem o entendimento e o poder.\nPor meu intermédio os reis governam, e as autoridades exercem a justiça;\ntambém por meu intermédio governam os nobres, todos os juízes da terra.\nAmo os que me amam, e quem me procura me encontra.\nComigo estão riquezas e honra, prosperidade e justiça duradouras.\nMeu fruto é melhor do que o ouro, do que o ouro puro; o que ofereço é superior à prata escolhida.\nAndo pelo caminho da retidão, pelas veredas da justiça,\nconcedendo riqueza aos que me amam e enchendo os seus tesouros.\n\"O Senhor me criou como o princípio de seu caminho, antes das suas obras mais antigas;\nfui formada desde a eternidade, desde o princípio, antes de existir a terra.\nNasci quando ainda não havia abismos, quando não existiam fontes de águas;\nantes de serem estabelecidos os montes e de existirem colinas eu nasci.\nEle ainda não havia feito a terra, nem os campos, nem o pó com o qual formou o mundo.\nQuando ele estabeleceu os céus, lá estava eu, quando traçou o horizonte sobre a superfície do abismo,\nquando colocou as nuvens em cima e estabeleceu as fontes do abismo,\nquando determinou as fronteiras do mar para que as águas não violassem a sua ordem, quando marcou os limites dos alicerces da terra,\neu estava ao seu lado, e era o seu arquiteto; dia a dia eu era o seu prazer e me alegrava continuamente com a sua presença.\nEu me alegrava com o mundo que ele criou, e a humanidade me dava alegria.\n\"Ouçam-me agora, meus filhos: Como são felizes os que guardam os meus caminhos!\nOuçam a minha instrução, e serão sábios. Não a desprezem.\nComo é feliz o homem que me ouve, vigiando diariamente à minha porta, esperando junto às portas da minha casa.\nPois todo aquele que me encontra, encontra a vida e recebe o favor do Senhor.\nMas aquele que de mim se afasta, a si mesmo se agride; todos os que me odeiam amam a morte\".\n\n- Provérbios 8:1-36",
				"added": 1601941563
			},
			{
				"comment_id": 124,
				"body": "#VEJAM SÓ! - O que significa: \"Muitos são chamados, mas poucos, escolhidos\"? (Mt 22.14)\n- https://invidious.snopyta.org/d1vUo884cro\n- https://siasky.net/AACyCaHSiLVytt7Do1xWejopptiiBqmml5UsxSv4ubEWpQ",
				"added": 1603389591
			},
			{
				"comment_id": 125,
				"body": "#Vejam Só! - Os salvos são eleitos soberanamente, ou baseados na presciência de Deus? IPe 1.1-2 \n- https://invidious.snopyta.org/i-moEoooQNw\n- https://siasky.net/AADdGAdJ9nr4WmUvqCr4s3BZkNoKwIVF2flElJEXcbzgwA",
				"added": 1603389671
			},
			{
				"comment_id": 126,
				"body": "#Vejam Só! - A Bíblia tem vários tipos de graça divina, ou isso é coisa de teólogos?\n- https://invidious.snopyta.org/xrsLko6p1P0\n- https://siasky.net/AABImVGKiCnZTwtrqmt_FBe8w8xX6e0IFX0Dow6EVrgMng",
				"added": 1603389746
			},
			{
				"comment_id": 127,
				"body": "#Vejam Só! - Jesus morreu por todos, ou apenas pelo eleitos de Deus?\n- https://invidious.snopyta.org/bEO_SM9CaYk\n- https://siasky.net/AADl4u8Z8k4N0OEvL4vi16PwciGs2mxr9lKptSt91OfySQ",
				"added": 1603389815
			},
			{
				"comment_id": 128,
				"body": "#Vejam Só! - Se o eleito não perde a salvação, como explicar Êxodo 32. 32-33?\n- https://invidious.snopyta.org/uTWu-SUp4sU\n- https://siasky.net/AAApomZgFYfbXYbfTe4gH6TP36Nlv45pW-cRUsEkC-q_qg",
				"added": 1603398418
			}
		],
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": [
			{
				"comment_id": 26,
				"body": "#Economia brasileira: da era Lula ao governo Bolsonaro, 2003-2020\n- https://siasky.net/AAAZAGwbqN7ZdyBnIu0wRIVrXQYx0fuqrkjDd4YwwVDFVQ\n\nA economia brasileira no século XXI, especialmente a partir da eleição de Luiz Inácio Lula da Silva, tem sido uma verdadeira montanha russa. Antes de chegar a uma das maiores recessões de sua história, o Brasil passou por altos e baixos que, a despeito de impactarem a vida de todos os brasileiros, nem sempre são tão bem compreendidos sem os devidos conhecimentos técnicos sobre economia. Para explicar quais políticas econômicas foram adotadas pelos quatro presidentes do Brasil, de Lula a Bolsonaro, convidamos a professora Laura Carvalho (USP), autora de Valsa Brasileira: do boom ao caos econômico e Curto-circuito: o vírus e a volta do Estado, para explicar tudo isso aos nossos ouvintes.\n\nPara ouvir o podcast da Prof. Laura Carvalho, o Entretanto, [clique aqui](https://open.spotify.com/show/5JHiZT46LGwu6LbMx6be7B).\n\n#LEITURAS RECOMENDADAS:\nLaura Carvalho – [Valsa Brasileira](https://ipfs.infura.io/ipfs/Qmcg62qj82dZxnaiRZBgKEQf7dsZXZbgcA5fYjkiMNs4c8)\nLaura Carvalho – [Curto circuito](https://ipfs.infura.io/ipfs/QmTmpwQ9qSYxsrm3dYXoKSK3dMoQYXrRBo22ydYTycNRwW)\nPedro de Souza – [Uma história da desigualdade no Brasil](https://www.amazon.com.br/gp/product/8584041737/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=8584041737&linkCode=as2&tag=obrigahisto0d-20&linkId=18e73c63031f88f5068e07308671679a)\nBranko Milanović – [Capitalismo sem rivais](https://ipfs.infura.io/ipfs/QmaewutVnjLwaEjm9c8LBZrwvv9mxQFTtByQ7eXXsxVpbZ)\n\n- Fonte: https://leituraobrigahistoria.com/2020/10/05/economia-brasileira-da-era-lula-ao-governo-bolsonaro-2003-2020/",
				"added": 1602032838
			},
			{
				"comment_id": 27,
				"body": "#A desigualdade vista do topo: a concentração de renda entre os ricos no Brasil, 1926-2013\n- https://ipfs.infura.io/ipfs/QmappDKq9T8bP6Kd8YLuTLH9pdAkAhBqNVTh968Gswf7LN\n\nEsta tese usa tabulações do imposto de renda para construir novas séries históricas para a concentração de renda no topo no Brasil. Entre 1926 e 2013, as frações recebidas pelos mais ricos combinaram estabilidade e mudança em um padrão distinto do observado nos países ricos no mesmo período. Ao contrário do previsto por teorias da industrialização e modernização, não houve nenhuma tendência secular clara. A fatia do centésimo mais rico da população adulta, em particular, oscilou frequentemente entre 20% e 25%, inclusive nos anos recentes. A concentração no topo teve idas e vindas que, mesmo temporárias, foram significativas, coincidindo com os grandes ciclos políticos do país. A fração apropriada para o 1% mais rico aumentou durante o Estado Novo e a 2a Guerra e caiu no imediato pós-guerra e, mais ainda, na segunda metade da década de 1950, tendência revertida depois do golpe militar de 1964, com uma volta ao patamar de duas décadas antes. Os anos 1970 foram marcados por instabilidade, mas a desigualdade cresceu novamente na década seguinte. Em seguida, houve alguma desconcentração até o fim da década de 1990 ou, talvez, meados dos anos 2000, e estabilidade desde então. Além disso, a análise empírica explora a repartição da renda entre os ricos, a comparação do Brasil com outros países e o contraste dos dados tributários com as PNADs e os Censos. Nesse último caso, as séries produzidas são usadas também para corrigir os coeficientes de Gini, levando em conta a subestimação dos rendimentos dos mais ricos nas pesquisas domiciliares. A discussão é estruturada por três perguntas de cunho histórico-comparativo, e os resultados são interpretados do ponto de vista institucional. As origens, implicações e justificativas para isso são apresentadas nos capítulos teóricos que precedem a análise empírica. Esses capítulos oferecem uma reconstrução da história das ideias sobre estratificação social no último século e colocam em destaque a longa e heterogênea tradição de estudos sobre os ricos. Seu argumento central é que o interesse acadêmico e político pela questão distributiva aflora quando ela é concebida em termos dicotômicos, com foco sobre os mais ricos.",
				"added": 1602034018
			}
		],
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": [
			{
				"comment_id": 28,
				"body": "#A Saga do Prêmio Nobel\n- https://view.axel.org/item/5697189b9d6dfc05\n\nEm todos os anos de existência do [Prêmio Nobel](https://en.wikipedia.org/wiki/Nobel_Prize), diversos grandes nomes fizeram história e se tornaram figuras legendárias para a humanidade. Einstein, Pierre e Marie Currie, Marconi, Palov, Monod, Lorenz e Fleming, Camus ou Martin Luther King, todos vencedores do maior prêmio dado a cientistas, escritores e líderes humanistas no mundo. São figuras que não só participaram dos grandes eventos da modernidade, como, às vezes, descobriram e anteciparam estes eventos. Cada episódio introduz dois vencedores do prêmio que, em tempos diferentes, desenvolveram um trabalho similar sobre um mesmo assunto. A série explora diferentes áreas do conhecimento, como a comunicação, a relatividade, o comportamento, o humanitarismo e as diferenças entre as culturas orientais e ocidentais.",
				"added": 1602040529
			},
			{
				"comment_id": 29,
				"body": "O [Chaves](https://pt.wikipedia.org/wiki/El_Chavo_del_Ocho) é uma comédia que mostra as interações dos moradores de uma vila. Chaves é um menino órfão de oito anos que vive criando atrapalhadas com alguns moradores, como o Seu Madruga, a Dona Florinda, a Dona Clotilde e até com o dono da vila, o Senhor Barriga. Ele também apronta com seus amigos, também da vila, Quico e Chiquinha. Chaves e seus amigos estudam juntos na escola, e tem aulas com o Professor Girafales, que é namorado da mãe de Quico, a Dona Florinda, e está sempre indo à vila para visitá-la e caindo nas encrencas de Chaves e seus amigos. O seu Madruga, pai de Chiquinha, é um homem descansado que vive fugindo do Senhor Barriga para não ter que pagar o aluguel. Dona Clotilde, apelidada de A Bruxa do 71, coloca medo nas crianças pelas histórias inventadas por eles de que ela seria uma bruxa, e também é apaixonada por Seu Madruga.  Chaves mora num barril, mas segundo ele é apenas um esconderijo.\n- [Volume 1 - Completo](https://siasky.net/AADVG-LDDerfkIf4Or1nmyzWTr-IAX7c_0VKkvHE4xYzlA)\n- [Volume 2 - Completo](https://siasky.net/AAC3fJN7oV2utnrCCqjtshIMRKvJPwZ661mbWsBykDVdcQ)\n- [Volume 3 - Completo](https://siasky.net/AAC4EKYxMhark1EbCRrwmPcTeW04Dabvx4cY8WWoamsnuQ)\n- [Volume 6 - Completo](https://siasky.net/AACVca7AiQD1R5GNgaJ82kTj5WCRmzph4iXDqOjW3qnP8Q)",
				"added": 1602079269
			},
			{
				"comment_id": 30,
				"body": "> [theablet](#comment_29_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn): O Chaves é uma comédia que mostra as interações dos moradores de uma vila. Chaves é um menino órfão de oito anos que vive criando atrapalhadas com alguns moradores, como o Seu Madruga, a Dona Florinda, a Dona Clotilde e até com o dono da vila, o Senhor Barriga. Ele também apronta com seus amigos, também da vila, Quico e Chiquinha. Chaves e seus amigos estudam juntos na escola, e tem aulas com o Professor Girafales, que é namorado da mãe de Quico, a Dona Florinda, e está sempre indo à vila para visitá-la e caindo nas encrencas de Chaves e seus amigos. O seu Madruga, pai de Chiquinha, é um homem descansado que vive fugindo do Senhor Barriga para não ter que pagar o aluguel. Dona Clotilde, apelidada de A Bruxa do 71, coloca medo nas crianças pelas histórias inventadas por eles de que ela seria uma bruxa, e também é apaixonada por Seu Madruga.  Chaves mora num barril, mas segundo ele é apenas um esconderijo.\n> \n> Volume 1 - Completo\n> Volume 2 - Completo\n> Volume 3 - Completo\n> Volume 6 - Completo\n\n#Os Mistérios POR TRÁS de Chaves - Todas as Teorias Assustadoras\n- https://invidious.snopyta.org/lZOlTjiWBfI\n- https://siasky.net/AADjCilJnt_JSwhEdkQOJyp3Ur1mBXJc8LMgJuP3QgFL5Q\n\nOBS.: o único objetivo desse vídeo é entretenimento, não deve ser utilizado como fonte de artigos científicos ou trabalhos escolares.",
				"added": 1602081479
			},
			{
				"comment_id": 77,
				"body": "#Smallville\nBaseada no personagem Superman da DC Comics, criado por Jerry Siegel e Joe Shuster, a série conta a história de Clark Kent (Tom Welling), um adolescente quase comum, se não fosse por seus poderes especiais. A série mostra como seria a vida do Super Homem se ele tivesse caído na Terra nos tempos atuais, fazendo uma mistura da modernidade do século XXI e elementos antigos já conhecidos pela história do homem de aço.\n\n#Temporadas:\n- [1ª Temporada: 2001—2002](http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:34_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/Smallville+As+Aventuras+do+Superboy+1+Temporada+Completa+Torrent+Dublada)\n- [2ª Temporada: 2002—2003](http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:35_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/Smallville+As+Aventuras+do+Superboy+2+Temporada+Completa+Torrent+Dublada)\n- [3ª Temporada: 2003—2004](http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:36_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/Smallville+As+Aventuras+do+Superboy+3+Temporada+Completa+Torrent+Dublada)\n- [4ª Temporada: 2004—2005](http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:37_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/Smallville+As+Aventuras+do+Superboy+4+Temporada+Completa+Torrent+Dublada)\n- [5ª Temporada: 2005—2006](http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:38_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/Smallville+As+Aventuras+do+Superboy+5+Temporada+Completa+Torrent+Dublada)\n- [6ª Temporada: 2006—2007](http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:39_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/Smallville+As+Aventuras+do+Superboy+6+Temporada+Completa+Torrent+Dublada)\n- [7ª Temporada: 2007—2008](http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:40_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/Smallville+As+Aventuras+do+Superboy+7+Temporada+Completa+Torrent+Dublada)\n- [8ª Temporada: 2008—2009](http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:41_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/Smallville+As+Aventuras+do+Superboy+8+Temporada+Completa+Torrent+Dublada)\n- [9ª Temporada: 2009—2010](http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:42_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/Smallville+As+Aventuras+do+Superboy+9+Temporada+Completa+Torrent+Dublada)\n- [10ª Temporada: 2010—2011](http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:43_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/Smallville+As+Aventuras+do+Superboy+10+Temporada+Completa+Torrent+Dublada)",
				"added": 1602441915
			},
			{
				"comment_id": 78,
				"body": "#MacGyver - Profissão: Perigo\nAngus MacGyver (Richard Dean Anderson) é um agente secreto com um diferencial. Quieto, bem educado, e se recusa a levar uma arma em suas missões. Felizmente, esse último detalhe não é muito importante quando comparado a seu incrível poder da mente. Conhecedor da ciência, MacGyver consegue usar qualquer material ao seu redor para criar uma solução - às vezes pouco ortodoxa - para os problemas que enfrenta.\n\n#Temporadas:\n- [01](http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:46_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/MacGyver+Profiss+o+Perigo+1+Temporada+Completa+Torrent+Dublada)\n- [02](http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:47_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/MacGyver+Profiss+o+Perigo+2+Temporada+Completa+Torrent+Dublada)\n- [03](http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:48_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/MacGyver+Profiss+o+Perigo+3+Temporada+Completa+Torrent+Dublada)\n- [04](http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:49_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/MacGyver+Profiss+o+Perigo+4+Temporada+Completa+Torrent+Dublada)\n- [05](http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:50_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/MacGyver+Profiss+o+Perigo+5+Temporada+Completa+Torrent+Dublada)\n- [06](http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:51_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/MacGyver+Profiss+o+Perigo+6+Temporada+Completa+Torrent+Dublada)\n- [07](http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:52_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn/MacGyver+Profiss+o+Perigo+7+Temporada+Completa+Torrent+Dublada)",
				"added": 1602450595
			}
		],
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": [
			{
				"comment_id": 31,
				"body": "#John Lennox analisa o livro de Stephen Hawking\n- https://invidious.snopyta.org/Djj4XKE7uwc\n- https://siasky.net/AAANwZtGOPbH4iKH_ZuX7yuaNfVl3H_9RQCk7Ox0HB1JWQ\n\n[John Lennox](https://en.wikipedia.org/wiki/John_Lennox), matemático da [Universidade de Oxford](https://www.ox.ac.uk/), demonstra em linguagem clara e objetiva as auto-contradições inerentes aos argumentos ateístas em favor de um universo sem Criador, sobretudo as ideias filosoficamente pueris apresentadas no livro \"[O Grande Projeto](https://ipfs.infura.io/ipfs/QmTD7ysoZAkdybnAKz7htnVCS7iyk1XUuKk1xMUtzDogX7)\", de [Stephen Hawking](https://en.wikipedia.org/wiki/Stephen_Hawking) e [Leonard Mlodinow](https://en.wikipedia.org/wiki/Leonard_Mlodinow).",
				"added": 1602098248
			},
			{
				"comment_id": 42,
				"body": "#Lista de problemas não resolvidos em filosofia\n- https://en.wikipedia.org/wiki/List_of_unsolved_problems_in_philosophy\n- https://everipedia.org/wiki/lang_en/List_of_unsolved_problems_in_philosophy\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/List_of_unsolved_problems_in_philosophy.html",
				"added": 1602170039
			},
			{
				"comment_id": 56,
				"body": "#Reflexão ontológica das definições de “vácuo”, “vazio”, “nada” e considerações sobre tempo e espaço\n\nHá muita confusão quanto aos conceitos das palavras “vácuo”, “vazio” e “nada”. É muito comum se deparar com documentários ou certos artigos sobre física que abordam o “vácuo” sendo o espaço vazio ou até mesmo, as vezes, “o nada”. Pretendo esclarecer e distinguir essas três definições nesse artigo e mostrar que na verdade a distinção é muito mais simples que se pode imaginar e trata-se de uma mera constatação e reflexão do significado das próprias palavras.\n\nPrimeiramente, devemos entender que espaço e tempo não são elementos apriorísticos do universo. Em verdade, só existem em função do conteúdo substancial (e refiro-me ao significado filosófico e não químico de “substância”) do universo, que são matéria, radiação e os campos (estes os mais básicos). Espaço vem a ser o conjunto de todas as localizações possíveis que alguma coisa pode “estar”. Já o tempo vem a ser o conjunto de todos os momentos que uma coisa também pode “estar”. As alterações no estado do conteúdo do universo (ocorrências) se dão com as entidades substanciais do universo ao longo do tempo e do espaço.\n\nA existência do tempo decorre justamente da modificação do estado do conteúdo substancial do universo. Se tudo permanecer estacionário, sem haver nenhum tipo de movimento e interação de espécie alguma, não há como se fazer o cômputo do “tempo”, uma vez que nem sequer há momentos distintos que caracterizam um “antes” e um “depois”. Isso inclusive pode ter acontecido várias vezes enquanto eu teclei para redigir esse artigo. Mas isso é algo que é impossível de ser sabido. Entretanto não há nada que impeça de ocorrer. O interessante é que há um ordenamento nessa passagem temporal que é o que se conhece por “flecha do tempo” ou ainda “seta do tempo”. Isso tem a ver com a segunda lei da termodinâmica que estatui que em um sistema isolado (e portanto, fechado), a entropia nunca pode decair (pode permanecer constante nos processos reversíveis). Nos processos irreversíveis a entropia tende a aumentar. Como há transformações irreversíveis no universo (o seu próprio envelhecimento), a entropia global tende a aumentar. Esse aumento de entropia é que indica o sentido do tempo, isto é, o fato de sempre irmos para o futuro e nunca voltarmos para o passado.\n\nQuanto ao espaço, de fato, não existe sem haver algum conteúdo que o ocupe. Oras, se o espaço é a coleção de todos os lugares que algo pode estar ocupando, se não haver algo, não há espaço. E as entidades mais fundamentais são os campos. No big bang, o que existia na época de Planck era somente campo puro indiferenciado ocupando espaço. Somente com as posteriores quebras de simetria é que o universo evolveu e os quanta de matéria e radiação passaram a existir. Não se sabe ainda, contudo, como esse conteúdo primordial com seu continente veio a existir. Notem que se o universo estava em uma configuração sem haver passagem de tempo, antes mesmo de começar a expandir, não se pode falar que existiu “sempre”, pois sem tempo não há como se estabelecer as relações de “passado”, “presente” e “futuro”. Logo, não se pode dizer que o universo permaneceu existindo indefinidamente para o passado. Aliás, nem “antes” havia. Se o universo surgiu e logo que surgiu começou a expandir, também não faz sentido cogitar sobre o que havia “antes” desse início da expansão. A não ser que o universo seja eterno e então de fato, pode-se conceber o passado do universo como se estendendo ao infinito negativo na linha temporal e desse modo, sempre há um “antes”. Notem que se o universo for mesmo eterno, não quer dizer que começou a existir em um tempo atrás muito longo. Dizer que é eterno quer dizer exatamente que nunca começou a existir! Havendo um “começo” já não se pode mais cogitar sobre “eternidade” (em relação ao pretérito).\n\nPois bem, interpretando-se bem o que foi dito acima, podemos partir para as definições de “vácuo”, “vazio” e “nada”. Vácuo é qualquer região do espaço em que não há matéria (com exceção aos neutrinos). Todavia, nem toda região que denominamos “espaço sideral” é vácuo. Há 5 prótons por centímetro cúbico no espaço interplanetário, 1 próton por centímetro cúbico no espaço interestelar (desconsiderando as nebulosas) e 1 próton por metro cúbico dentro do espaço intergalático. No entanto, há regiões em que existem apenas campos e radiação, sem haver átomos, prótons ou qualquer tipo de partícula constituinte da matéria ou até mesmo qualquer aglomerado delas (como um gás) que se possa conceber. Vácuo vem a ser justamente essas regiões. A radiação cósmica de fundo, a radiação advinda das estrelas de todas as galáxias e os campos gravitacionais, de Higgs e dos campos da matéria, de fato, também ocupam o vácuo (ou podem ocupar). Isso tudo ainda incluindo neutrinos (neutrinos cósmicos de fundo do big bang e todos os neutrinos emitidos pelas reações nucleares de decaimento nas estrelas, planetas e outros corpos celestes) e os campos elétricos e magnéticos que ali podem permear. Mas não áxions, neutralinos, WIMP’s e as outras supostas partículas exóticas que compõem a matéria escura, que não fazem parte do “vácuo”.\n\nVácuo quântico é uma região do vácuo onde há campos leptônicos e bariônicos que dão azo ao surgimento de partículas e antipartículas (mar de Dirac), por flutuações aleatórias. Vale frisar que além desse conteúdo substancial, há o receptáculo no qual esse conteúdo evolve, que é o espaço-tempo.\n\nEspaço vazio é uma região hipotética onde só haveria espaço, sem haver as entidades substanciais (campos, matéria e radiação) ocupando e por conseguinte, nem tempo. Isso nunca existiu e não existe no universo. Como já mencionei acima, espaço e os constituintes substanciais do universo são indissociáveis. Pode haver espaço sem tempo mas não pode haver tempo sem espaço (não existe comutatividade nesse caso).\n\nPor fim, “nada” (e não “o nada”) é um pronome indefinido que designa exatamente, a ausência de tudo que se possa imaginar (campos, matéria, radiação, tempo, espaço (até mesmo espaço vazio), ocorrências e até a escuridão, bem como abstrações, conceitos e qualquer entidade de qualquer categoria da realidade que se possa imaginar). “O nada” seria a hipotética entidade que não contém coisa alguma (e nem espaço e tempo). Ora, não existe “o nada”. Pensar “no nada” como tendo uma existência objetiva (fora das mentes) é uma contradição filosófica, pois “nada” não pode ser relacionado a um substantivo, uma vez que pela sua própria definição é ausência até das próprias entidades (como mencionei acima) e das “coisas” que a representação linguística dos “substantivos” pode fazer alusão.\n\nMuitos físicos quando dizem que o universo veio do nada referem-se na verdade ao vácuo quântico, que não é “o nada” e muito menos nada! Trata-se um jargão bem comum porém, impreciso, atribuir o surgimento do universo ao “nada”. Tais físicos que cometem esse tipo de gafe ontológica são [Stephen Hawking](https://en.wikipedia.org/wiki/Stephen_Hawking), [Leonard Mlodinow](https://en.wikipedia.org/wiki/Leonard_Mlodinow) e [Lawrence Krauss](https://en.wikipedia.org/wiki/Lawrence_Krauss). Uma leitura atenta e reflexiva de suas obras revela um desentendimento colossal de filosofia e de sua interseção com a física por parte desses cientistas. Acho que um físico deve ser antes de tudo, um filósofo.\n\nA física é a ciência mais fundamental da natureza. Vai descrever os aspectos mais gerais e primordiais da realidade natural, algo que a filosofia também pretende abordar. Trata-se de uma questão metafísica e portanto, filosófica, investigar a existência do que a física aborda (que fundamentalmente são os campos), bem como categorizá-lo, conceitualizá-lo e relaciona-lo com as demais entidades do universo. Portanto, em absoluto, não há nenhum motivo para banir a filosofia e nem de promover uma incompatibilidade da mesma com as demais ciências.\n\n- Fonte: https://archive.is/LQLUP",
				"added": 1602174200
			},
			{
				"comment_id": 57,
				"body": "#Trilema de Münchhausen\nO trilema de Münchhausen, também chamado de trilema de Agripa, afirma que é impossível provar qualquer verdade mesmo em campos como a lógica e a matemática. De acordo com esse argumento, a prova de qualquer teoria repousa ou no raciocínio circular, na regressão infinita ou em axiomas não comprovados.\n- https://web.archive.org/web/20200718131939/https://criticanarede.com/anunesoproblemadoceticismo.html\n- https://en.wikipedia.org/wiki/M%C3%BCnchhausen_trilemma\n- https://everipedia.org/wiki/lang_en/M%C3%BCnchhausen_trilemma\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/M%C3%BCnchhausen_trilemma.html",
				"added": 1602177260
			},
			{
				"comment_id": 58,
				"body": "#Debate sobre a origem e a causa da existência do universo\nExiste uma razão para a existência do universo? Por que existe algo e não nada? Deus existe?\n- https://invidious.snopyta.org/5a1q_q11pYw\n- https://siasky.net/AAA_SndYyz1bkscFBHur98lbfy4MbYa8ZoQrC6myCVAnxw",
				"added": 1602177821
			},
			{
				"comment_id": 61,
				"body": "#Tempo (Enciclopédia de Filosofia de Stanford)\n Discussões sobre a natureza do tempo, e de várias questões relacionadas ao tempo, sempre tiveram destaque na filosofia, mas têm sido especialmente importantes desde o início do século XX. Este artigo contém uma breve visão geral de alguns dos principais tópicos da filosofia do tempo — Fatalismo; Reducionismo e platonismo em relação ao tempo; a topologia do tempo; Os argumentos de McTaggart; A Teoria A e a Teoria B; Presentismo, Eternismo e Teoria do Universo Em Crescimento; viagem no tempo; e a controvérsia 3D/4D — juntamente com algumas sugestões para mais leitura sobre cada tópico, e uma bibliografia.\n\n- https://plato.stanford.edu/entries/time/\n- https://siasky.net/fAYXN1yyACDOhvndgLLfpkWS8iBXJ7F1MVJhnSwRthBZIA",
				"added": 1602184596
			},
			{
				"comment_id": 62,
				"body": "#A visão de Newton sobre espaço, tempo e movimento\n- https://plato.stanford.edu/entries/newton-stm/\n- https://siasky.net/HAC64NkHpC8HyLhc5IZkIvZvRhTtbYKWTK7sdSrfmRizKg\n\nIsaac Newton fundou a mecânica clássica na visão de que o espaço é distinto do corpo e que o tempo passa uniformemente, independentemente de algo acontecer no mundo. Por esta razão, ele falou de espaço absoluto e tempo absoluto, para distinguir essas entidades das várias maneiras pelas quais as medimos (que ele chamou de espaços relativos e tempos relativos). Da antiguidade ao século XVIII, visões contrárias que negavam que o espaço e o tempo são entidades reais sustentavam que o mundo é necessariamente um plenum material. Com relação ao espaço, eles sustentaram que a ideia de espaço vazio é uma impossibilidade conceitual. O espaço nada mais é do que uma abstração que usamos para comparar diferentes arranjos dos corpos que constituem o plenum. Com relação ao tempo, eles insistiram, não pode haver lapso de tempo sem que uma mudança ocorra em algum lugar. O tempo é apenas uma medida dos ciclos de mudança no mundo.\nAssociada a essas questões sobre o status ontológico do espaço e do tempo estava a questão da natureza do movimento verdadeiro. Newton definiu o verdadeiro movimento de um corpo como sendo seu movimento através do espaço absoluto. Aqueles que, antes ou logo depois de Newton, rejeitaram a realidade do espaço, não negaram necessariamente que existe um fato relevante quanto ao estado de movimento verdadeiro de qualquer corpo. Eles pensaram antes que o conceito de movimento verdadeiro poderia ser analisado em termos das especificidades dos movimentos relativos ou de suas causas. A dificuldade (ou, como Newton alegou, a impossibilidade) de fazê-lo constituiu para Newton um forte argumento para a existência do espaço absoluto.\nNa literatura recente, as teses de Newton sobre a ontologia do espaço e do tempo passaram a ser chamadas de substantivalismo em contraste com o relacionismo. Deve ser enfatizado, porém, que Newton não considerava o espaço e o tempo como substâncias genuínas (como são, paradigmaticamente, corpos e mentes), mas sim como entidades reais com sua própria maneira de existência, conforme exigido pela existência de Deus (mais especificamente, sua onipresença e eternidade).",
				"added": 1602185235
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 35,
				"body": "#Agora você pode ler a tese de doutorado de Stephen Hawking de graça\n\nTalvez você não queira que ninguém leia o trabalho que você fez como estudante universitário. Eu com certeza não quero. Mas nós não somos [Stephen Hawking](https://en.wikipedia.org/wiki/Stephen_Hawking), físico renomado mundialmente, cuja tese de doutorado agora pode ser lida de graça [online](https://web.archive.org/web/20180424145512/https://www.repository.cam.ac.uk/bitstream/handle/1810/251038/PR-PHD-05437.pdf?sequence=7&isAllowed=y).\n\nA [Universidade de Cambridge](http://www.cam.ac.uk/) disponibilizou gratuitamente para qualquer um o trabalho de Hawking, “[Propriedades dos Universos em Expansão](https://ipfs.infura.io/ipfs/QmbnzV6RxkbJJLYEgfT4ZFjG3qf55jQwLTTivWCusJtURY)”, diante de uma demanda extraordinária. Afinal de contas, esse era o link mais pedido em seu repositório de Acesso Aberto online, de acordo com um [comunicado de imprensa](https://web.archive.org/web/20180513064011/https://www.cam.ac.uk/research/news/step-inside-the-mind-of-the-young-stephen-hawking-as-his-phd-thesis-goes-online-for-first-time). Hawking contou à Cambridge que havia tomado a decisão esperando “inspirar pessoas ao redor do mundo a olhar para as estrelas e não para baixo, para seus pés”.\n\nA tese discute alguns dos pontos mais falados na física, especificamente as “implicações e consequências da expansão do universo”. Essa expansão causa dificuldades a uma teoria da gravitação e tem implicações em como a gravidade irradia através do universo, movendo sua energia como ondas. Ela também descreve a inevitabilidade das singularidades, regiões de densidade infinita e volume zero encontradas nos centros de buracos negros ou no começo do universo.\n\n- Fonte: https://web.archive.org/web/20180513170251/http://gizmodo.uol.com.br/leia-tese-doutorado-stephen-hawking-de-graca/",
				"added": 1602163251
			},
			{
				"comment_id": 36,
				"body": "#A origem histórica da relatividade\nPalestra proferida pelo prof. [Roberto de Andrade Matins](http://lattes.cnpq.br/1303182900555819) ([FESB](http://www.fesb.br/)) no VII Encontro Estadual de Ensino de Física.\n- https://invidious.snopyta.org/pfSpHypCU_o\n- https://siasky.net/AAB3wkFyFB5gH6ocQ-HdoozN9aBpeM71qj5SiLu8286owA",
				"added": 1602164605
			},
			{
				"comment_id": 38,
				"body": "#Lista de problemas não resolvidos em física\n- https://en.wikipedia.org/wiki/List_of_unsolved_problems_in_physics\n- https://everipedia.org/wiki/lang_en/List_of_unsolved_problems_in_physics\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/List_of_unsolved_problems_in_physics.html",
				"added": 1602169544
			},
			{
				"comment_id": 45,
				"body": "#Lista de problemas não resolvidos em astronomia\nhttps://en.wikipedia.org/wiki/List_of_unsolved_problems_in_astronomy",
				"added": 1602170441
			},
			{
				"comment_id": 50,
				"body": "#Teoria do Big Bang\n\nAo longo da história, a nossa espécie tentou entender a natureza em seu nível mais fundamental, questionando sobre a nossa origem e o nosso destino. Questões como “de onde viemos?”, “para onde vamos?”, “quem somos?”, estiveram sempre presente no espírito inquiridor da nossa espécie, que buscou incessantemente pelas respostas dessas perguntas, a fim de dar algum sentido à vida e de se relacionar com a natureza. Várias crenças e mitos surgiram como explicações para essas indagações, mas, na medida que avançamos intelectualmente (com o advento da matemática e das ciências naturais como a astronomia e física), percebemos que para várias perguntas que antes tínhamos uma resposta puramente especulativa e muitas vezes relacionada com o sobrenatural, na verdade, havia uma resposta totalmente natural, sem haver necessidade de apelar para crendice alguma para responder. Um exemplo disso, é a questão sobre a evolução do universo, bem como a origem de toda a matéria (desde partículas elementares (que abordarei mais a frente) até pessoas e corpos astronômicos gigantescos). Diferentemente do passado longínquo, hoje sabemos (e não meramente acreditamos) a resposta dessas perguntas, de modo que podemos traçar uma linha do tempo cósmica, até chegarmos a infinitesimalmente perto do momento zero. Talvez a teoria científica mais mal interpretada de todos os tempos (ainda tenho as minhas dúvidas em relação à teoria da evolução de Darwin, mas isso já são outros quinhentos) é a teoria do Big Bang, que aborda, justamente, a questão de como o cosmo evoluiu e como toda a matéria que podemos ver (inclusive nós mesmos) surgiu. A teoria do big bang, basicamente, é um modelo que remonta ao início do decurso do tempo em decorrência da expansão do espaço do universo. É sustentada por miríades evidências empíricas (quer experimental, quer observacional) que nos permitem concluir que foi desse modo mesmo que chegamos até aqui. O termo “Big Bang” é um nome impróprio para esse evento que marcou a evolução do universo, pois não foi explosão nenhuma, mas sim, um súbito inchamento do espaço, carregando todo o conteúdo existente, sem que o mesmo saísse do lugar, de modo que as distâncias entre os pontos aumentou a medida que esse espaço se esticou (assim como em um bolo de passas que está no forno, onde as passas vão se distanciando uma das outras, sem sair do lugar, a medida que a massa do bolo vai inchando). Explosão é o lançamento de um conteúdo que se distancia cinematicamente do centro da explosão em um espaço circundante preexistente. Não há um ponto em comum onde todo o conteúdo do universo se distanciou, pois, todo o espaço existente se expandiu, de modo que o “big bang” ocorreu em todo o universo. E o universo não se expandiu e não se expande para o “vazio”, pois “vazio” nem sequer existe. Todo o espaço cósmico é permeado pela radiação cósmica de fundo e pela radiação advinda de todas as galáxias existentes, além dos campos existentes que também ocupam espaço, como por exemplo, o campo gravitacional. Não existe espaço sem conteúdo e conteúdo sem espaço. Ambas entidades são indissociáveis. Portanto, é incorreto dizer que o universo surgiu de uma explosão. Além disso, a teoria do big bang não é uma teoria sobre a origem do universo, mas sim, apenas da evolução do mesmo (por mais que trate da origem da matéria). A teoria, por exemplo, não explica como o conteúdo primordial, que era um campo indiferenciado (abordarei mais adiante), surgiu, muito menos explica o “porquê” de ter surgido. A expansão do universo foi observada por Edwin Hubble, em 1929, quando ele percebeu que o que se especulava que eram “nebulosas galáticas distantes”, na verdade, eram outros “universos-ilhas”, assim como a Via Láctea, que estavam se distanciando um dos outros, devido à expansão cósmica. Oras, se o universo está se expandindo, é razoável supor que no passado, todo o universo observável estava concentrado em um ponto infimamente pequeno. Os cosmologistas Georges Lemaître e Alexander Friedmann resolveram as equações da Relatividade Geral de Einstein e deduziram que o universo deveria estar se expandindo ou contraindo (devido aos efeitos gravitacionais e da maleabilidade do espaço-tempo). Lemaître chamou de “átomo primordial” o pequeno ponto cósmico, onde todo o universo estava concentrado no passado. George Gamow se interessou pela proposta de Lemaître e inferiu que nos momentos iniciais do universo, a temperatura era tão alta, que o calor concentrado naquele “átomo primordial” deveria ser detectado nos dias de hoje. Inferiu também que, elementos leves como Hidrogênio e Hélio, foram criados nas situações iniciais do universo primitivo quente e denso. O calor residual desses momentos caóticos foi detectado por Arno Penzias e Robert Wilson, exatamente como Gamow e Alpher previram (redigi um texto que aborda especificamente sobre a radiação cósmica de fundo aqui na página, vale a pena lê-lo antes de continuar essa leitura. O texto pode ser acessado por este link: https://archive.is/LDGE1\n\nProssigamos então, com o que ocorreu nos primeiros momentos de existência do universo, antes mesmo dele completar 1 segundo de vida. Na menor fatia de tempo que conseguimos conceber, que é o chamado tempo de Planck (10^-43 segundos ou quase um milionésimo de trilionésimo de trilionésimo de trilionésimo de segundo), o conteúdo do universo se restringia apenas a um campo indistinguível não quantizado (não concentrado) em matéria e radiação. Indistinguível, pois a temperatura era tão alta (10^32K),que as forças fundamentais da natureza (gravidade, força forte, fraca e eletromagnetismo) eram uma única super-força. O tamanho do universo observável era de 10^-35 metros (comprimento de Planck). Quando a expansão do universo iniciou (por razões ainda desconhecidas) e a temperatura diminuiu, o campo indiferenciado se decompôs em seus componentes distintos, a começar pelo campo gravitacional e de Higgs, e posteriormente no campo forte, fraco e eletromagnético. Também se distinguiu o campo da matéria ou campo fermiônico, também chamado campo do vácuo, cujas flutuações dão azo ao surgimento de partículas de matéria (como quarks e elétrons). A densidade do universo, bem como sua temperatura, ainda eram altíssimas, impossibilitando haver a existência de qualquer átomo, bem como de qualquer próton e nêutron. Quando o universo completou 10^-36 segundos de idade (ou um trilionésimo de trilionésimo de trilionésimo de segundo), ele se expandiu de forma inflacionada (como previu Alan Guth em 1980), como se fosse um balão que fosse inflado muito rapidamente. Essa expansão célere durou até 10^-32 segundos, em que o universo aumentou seu tamanho em um fator de 10^26! Uma sopa de partículas elementares surgiu quando o universo não tinha nem 10^-6 segundos de idade (ou um milionésimo de segundo) e logo que surgiam, se aniquilavam com suas respectivas antipartículas, como um elétron e um pósitron, um quark e um antiquark. Dessa aniquilação resultaram fótons (partículas que compõem a radiação, os quanta do campo eletromagnético) que continham energia equivalente a massa de repouso dessas partículas aniquiladas. Esses fótons mal surgiam e já se aniquilavam com outros fótons, formando novamente os pares de partícula e antipartícula. Isso tudo perdurou até o universo chegar a um segundo de idade. Um pouco antes disso, quando o cosmo tinha 10^-6 segundos de idade, os quarks já haviam sido ligados (pela interação forte mediada pelos quanta do campo forte, os glúons), formando os hádrons, como prótons, nêutrons e mésons. Os elétrons ainda se aniquilavam com os pósitrons, mas por razões desconhecidas, no processo de aniquilação da matéria com antimatéria, sobrou matéria, na ordem de uma partícula fermiônica para cada bilhão de pares de partícula e antipartícula formados. Logo após o universo completar um segundo de vida, a temperatura já havia caído o suficiente para os núcleons (prótons e nêutrons) se ligarem para formar os primeiros núcleos atômicos, como o dos isótopos do Hidrogênio (Deutério e Trítio), bem como Hélio e seus isótopos. Os prótons restantes acabaram formando os núcleos de Hidrogênio (pois o núcleo do hidrogênio contém apenas um próton) e os nêutrons decaíram em prótons, elétrons e antineutrinos. Essa era do Big Bang recebeu o nome de Nucleossíntese. Esporadicamente, através das flutuações de densidade do campo do vácuo, surgiam partículas e antipartículas fermiônicas (como elétrons e antielétrons, múons e antimúons) que rapidamente se aniquilavam, liberando mais fótons. Esses fótons advindo das aniquilações de matéria com antimatéria forma hoje a radiação cósmica de fundo em microondas. Passou-se 380.000 anos, até o universo resfriar o suficiente para que os primeiros elétrons fossem combinados com os núcleos atômicos resultantes da Nucleossíntese primordial, para formar os primeiros átomos (era do Desacoplamento). Esses átomos se aglutinaram posteriormente para formar nuvens de gases (como nebulosas), das quais estrelas e planetas surgiram. Os elementos mais pesados que o Hidrogênio, Hélio e seus isótopos foram criados nos núcleos incandescentes das estrelas. É importante frisar que antes da era do Desacoplamento, o universo era opaco, isto é, não era transparente, como se fosse o núcleo de uma única estrela. Os fótons colidiam a todo o momento com os íons e não podiam vagar livremente. Foi só na Era do Desacoplamento que o universo tornou-se transparente e os fótons puderam viajar livremente. Tais fótons podem ser detectados hoje, até mesmo em televisores ([vide o texto que eu já escrevi sobre a radiação cósmica de fundo nessa página](https://archive.is/vq9kZ)).\n\n- Fonte: https://archive.is/fGvP3",
				"added": 1602172088
			},
			{
				"comment_id": 51,
				"body": "#Houve mesmo uma singularidade?\n\nUma pessoa que tenha um razoável conhecimento sobre astronomia e física, em algum momento, já deve ter ouvido falar sobre a “singularidade”, da qual, supostamente, o nosso universo emergiu para a existência há cerca de 13,8 bilhões de anos atrás. Mas é impossível falar dessa tal “singularidade” sem tangermos à teoria do big bang, uma vez que essa teoria descreve a evolução do universo a partir dos primeiros instantes de existência cósmica, marcada pelo início da expansão do universo. Discorri um texto sobre o “big bang” na nossa página e acho que para poder acompanhar esse artigo, deve-se primeiramente ler o texto que eu discorri. Para acessá-lo, basta entrar neste link: Nesse texto foi mencionado e distinguido várias coisas importantes que muitas pessoas leigas em física (e infelizmente, algumas pessoas versadas em física também) saem espalhando por aí erroneamente sobre a teoria do big bang. Um desses erros fatais, é a noção de que a teoria do big bang é a teoria da origem do universo e que descreve o surgimento do universo como uma gigantesca explosão de energia. Ora, como já foi mencionado, a teoria do big bang não é uma teoria da origem do universo e sim da evolução do mesmo. Falar que a teoria do big bang retrata o surgimento do universo é o mesmo que falar que a teoria quântica retrata as órbitas dos planetas (que certamente é errado, uma vez que as órbitas dos planetas são descritas pela gravitação e pelas leis de Kepler). Enfim, são pontos bem importantes que devem ser esclarecidos a priori para falarmos sobre singularidade. Quando o universo tinha 10^-43 segundos de existência (ou 0,0000000000000000000000000000000000000000001 segundos) o tamanho do universo observável se reduzia a 10^-35 metros (comprimento de Planck). O que havia era um campo puro indiferenciado e a densidade bem como a temperatura, eram estupidamente grandes. Quando os físicos falam que a densidade era altíssima, eles referem-se a densidade de energia desse campo que havia no início da existência do universo. Campo aliás, é a entidade mais fundamental do universo. Tudo é feito dele (até ele mesmo) e nada é mais primitivo que campo. As partículas fermiônicas (matéria) e as bosônicas (mediadoras de interações) são quantizações de campo. O tempo só pôde surgir com a existência de um campo e o espaço também. Espaço só existe se existir algo para se caber, uma vez que é a coleção de lugares em que o conteúdo pode “estar”. Campo possui extensão, logo, ocupa espaço. O tempo por sua vez, é a coleção de momentos e só existe se o estado do universo se alterar. Ou seja, se tudo permanecer estacionário, o tempo não passa, pois não há como distinguir um momento do outro (uma vez que não há mais eventos). Pode haver espaço sem tempo mas não pode haver tempo sem espaço (a comutatividade não é válida nesse caso).\nNa era de Planck, todas as forças fundamentais da natureza estavam integradas em uma única super-força. Não sabemos ainda como descrever precisamente essa unificação, pois a gravidade não é descrita pela teoria quântica (essa que pretende quantizar a gravidade e abordá-la como uma interação) mas sim, descrita pela teoria da relatividade geral de Einstein (que aborda a gravidade como sendo a geometria do espaço). A ideia da singularidade surge quando a relatividade geral de Einstein prevê uma contração do espaço do universo até um volume nulo e com isso, a densidade teria que ser infinita (bem como a temperatura). Só que essa ideia se quebra com a teoria quântica, pois é impossível haver campo em um volume nulo (como já falei, campos possuem extensão).Uma das formas de elucidar essa questão então, é unificar a gravidade com as demais interações do universo e tratá-la em termos de física quântica, ou seja, quantizá-la. É o que tenta a hipótese M (que incluir as supercordas e a hipótese das branas), sugerindo a existência da partícula gráviton (que por sinal, nem sequer foi detectada). Pode que um dia essa hipótese venha a ser chamada de “teoria”, mas penso que terá que trilhar um extenso caminho para ganhar foros de teoria científica (se é que é um modelo correspondente à realidade). Outra forma de elucidar essa questão é simplesmente descartar a singularidade. Oras, se é impossível haver temperatura e densidade infinitas em volume nulo, então o universo deve ter surgido já com um certo volume (mesmo que infinitesimalmente pequeno) não nulo. Dessa forma, há descrição tanto quântica quanto relativística e temos um universo que se expande de um volume muito pequeno e de uma situação espumosa (espaço extremamente curvado pela densidade de energia do campo). As posteriores quebras de simetria também se aplicam (com a gravidade se separando das interações eletromagnéticas e nucleares fortes e fraca) e o universo pode se expandir de forma inflacionada como sugerido por Guth e outros cientistas.\n \nResumindo, com a navalha de Occam empregada, livramos-nos de vários problemas. Claro que a questão da descrição da unificação da gravidade com força nuclear forte, fraca e com a força eletromagnética não é resolvida através dessa explicação, mas penso que é isso que está trilhando a hipótese M. Outra coisa que deve ser mencionada aqui, é que o universo inteiro não estava reduzido ao tamanho de um átomo no big bang. Era apenas o universo observável (porção do universo que podemos ver pois houve tempo suficiente para a luz emitida de galáxias distantes chegar até nós). O universo inteiro, como apontam as observações mais recentes, é infinito. Isso quer dizer que ou ele é plano ou hiperbólico (nesse caso não segue a geometria euclidiana). Se ele é infinito, sempre será e sempre foi. Isso é perfeitamente possível. Claro que é, pois o universo de fato é infinito. Expansão do universo não significa aumento de tamanho do universo (pois o mesmo é infinito e infinito mais qualquer coisa, é infinito), mas sim, aumento da distância entre os pontos (pois o espaço incha e carrega o conteúdo). Quanto a hipótese do universo cíclico ou rebotante (defendida por Mário Novello e outros cientistas), como o próprio nome diz, é uma hipótese e terá que passar pelo mesmo caminho que (antes hipóteses) da relatividade, dos quanta e do big bang passaram. As evidências que temos atualmente indicam que o universo não é cíclico (e que não terminará em um big crunch), mas que começou há 13,8 bilhões de anos atrás. O cosmólogo Mário Novello pretende se livrar dessa situação (também descartando a singularidade) com a proposta de que o universo passar por ciclos infinitos de contração e expansão sendo, portanto, eterno. Mas isso é apenas uma das hipóteses existentes para se explicar a origem do universo, que é uma questão em aberto.\n\n- Fonte: https://archive.is/zNN7A",
				"added": 1602172172
			},
			{
				"comment_id": 52,
				"body": "#Os possíveis destinos do Universo\n\nAo longo da história da humanidade, vários modelos escatológicos surgiram para explicar como o mundo poderia acabar. Antes de surgirem ciências como física, astronomia e a posterior cosmologia (que advém das duas ciências supracitadas), havia apenas mitos para explicar o apocalipse. Várias religiões e crenças acabaram fazendo parte da história por preverem diferentes cenários apocalípticos, embasados em crendices, porém, sugerindo cenários aterradores. As versões científicas a respeito do fim do mundo surgiram quando começamos a se debruçar na física e suas derivadas, em que com o acúmulo de conhecimento a respeito da natureza, descobrimos que o Sol já está com o seus dias contados e a matéria provavelmente não existirá para sempre. De fato, nem a própria luz, como a conhecemos. A resposta que conseguimos arrancar da natureza por experimentação e observação parece não ser menos aterradora que as sugeridas pelas religiões e crenças criadas pela nossa espécie. Além disso, trata-se de algo que podemos prever que vai acontecer, embasando-se em evidências empíricas e conhecimentos anteriormente já confirmados. Cosmologia é o estudo da origem, da evolução e das estruturas do universo. O que nos interessa hoje, é a parte da evolução, uma vez que quando abordamos acerca dos possíveis destinos do universo, estamos falando sobre a evolução do mesmo. Aliás, há que ficar bem claro a distinção entre “mundo” e “universo”. O que chamarei de “mundo” aqui é o planeta em que vivemos, ou seja, o planeta Terra. Universo é o conjunto de tudo o que existiu, existe e existirá (portanto, engloba o “mundo”). É importante frisar que o que eu falarei aqui não é, em absoluto, crença individual nenhuma. Trata-se do que sabemos a respeito do universo baseado nos dados cosmológicos mais recentes e precisos. Como um fisicalista reducionista, considero que podemos descrever absolutamente tudo baseando-se na física. Não consigo pensar em nada que não seja físico. Não digo que as outras áreas da ciência não são importantes e não são necessárias, só digo que elas se reduzem à física. Há várias razões para considerar que a física seja a ciência mais fundamental. Uma delas é que a física é quem descreve os constituintes fundamentais do universo, que são campo, matéria e radiação (mas não energia, pois energia não é uma entidade e sim um atributo das entidades). Tudo é formado de campo e matéria (e interage através da radiação), além de ocupar um certo espaço e “estar” em um certo momento no tempo. Tempo e espaço também são entidades e também descritas pela física. Logo, tudo é, em seu âmago, físico. Desde a queda de um objeto até a expansão do universo. Enfim, podemos agora, abordar os possíveis destinos do cosmo.\n \nHá quatro cenários físicos-cosmológicos que retratam o possível destino do universo. Começarei falando sobre a hipótese do big crunch (grande trituração). O big crunch seria exatamente o oposto do big bang, isto é, ao invés de haver expansão do espaço (galáxias se distanciam uma das outras, entretanto, sem saírem do lugar), o espaço contrai e a distância entre os pontos diminui, de modo que na medida que o tempo passa, tudo passa a ficar mais perto e por consequência, a temperatura aumenta. Então, após um certo tempo, galáxias colidiriam e estrelas seriam jogadas umas contras as outras. Tudo ficaria cada vez mais compacto, e a densidade do universo seria cada vez mais estupidamente grande. Então, a distância entre as estrelas ficaria cada vez menor e buracos negros ficariam cada vez maiores (pois engoliriam cada vez mais matéria). Planetas se chocariam um com os outros e estrelas engoliriam planetas. Chegaria a um ponto em que tudo seria engolido por um buraco negro que na medida que o tempo passasse, ficaria cada vez menor, pois o espaço contrairia cada vez mais, chegando ao tamanho do sistema solar, depois no tamanho do Sol, depois no tamanho da Terra, depois caberia na palma da sua mão e depois ficaria menor que um átomo. Então, tudo voltaria a ser campo não quantizado (sem haver matéria e radiação, apenas campo puro) inconcebivelmente denso. Nem mesmo as partículas elementares sobreviveriam. O que aconteceria depois desse fim catastrófico? O universo poderia voltar a se expandir! Como se ricocheteasse e a energia interna contida no campo, fosse liberada para formar a massa das partículas elementares. Então a descrição do modelo inflacionário do big bang se aplicaria novamente. O interessante é que se isso for verdade, o universo pode ser eterno, uma vez que esse ciclo pode ser interminável. Pode ter acontecido, mas não é o que as evidências empíricas sugerem. Constatou-se em 2011 (o que rendeu prêmio nobel de física), que a expansão do universo é acelerada. Para um possível big crunch ocorrer, a expansão deveria estar desacelerando. Além do mais, a sonda Planck revelou padrões na imagem da radiação cósmica de fundo (imagem de quando o universo tinha 380.000 anos) de que o universo não possui geometria esférica ou é curvado positivamente (assim como o planeta Terra). Na verdade, o universo parece ser plano (quer dizer que segue a geometria euclidiana). A densidade do universo também parece não exceder o valor crítico, isso quer dizer que não há conteúdo massivo-energético que impeça ou retarde a expansão. Tudo isso nos leva a apontar a teoria do big rip (grande rompimento) como a teoria que está de acordo com os dados mais recentes e descreve a evolução do universo. Aliás, é por isso que a chamamos de “teoria”.\n\nA teoria do big rip descreve o destino final do universo como um grande esgarçamento do tecido espacial-temporal, provocado por um campo impropriamente chamado de “energia escura”. Esse campo atua no espaço fazendo com que se expanda e a energia que contém acelera a expansão. Não se sabe praticamente nada ainda a respeito desse campo. A proposta do big rip foi publicada primeiramente em 2003 e de acordo com os cálculos, não demoraria mais que bilhões de anos para que a matéria se esgarçasse. Na verdade, isso depende da constante de Hubble e do valor Ω da densidade do universo. Essa “quintessência” então que desconhecemos e que é responsável pelo expansão do cosmo, dominaria a matéria e não haveria nenhum campo gravitacional suficiente para sobrepujar essa expansão. Sendo o big rip uma tendência assintótica, na medida que o tempo passar, o espaço entre as galáxias se expandirá significativamente, bem como o espaço entre as estrelas e também o próprio espaço entre os átomos! Os planetas se despedaçarão, as estrelas se esgarçarão, as moléculas se romperão. Os átomos do nosso corpo deixarão de existir e tudo o que restará será um campo puro extremamente rarefeito. Isso decorre do fato das partículas elementares do universo serem excitações quânticas de seus respectivos campos. Então, com a expansão, a densificação (que formou a partícula quantizada) se desfará e as partículas retornarão ao estado de campo. O universo continuará a se expandir cada vez mais rápido para sempre. O tempo parará assintoticamente (isto é, chegará cada vez mais perto de cessar) e a radiação também deixará de existir. As ondas terão comprimentos de trilhões de anos luz e esse comprimento tenderá ao infinito. Com isso, a frequências das ondas tenderão a zero, ou seja, deixarão de existir assintoticamente. A temperatura decairá assintoticamente bem como a densidade de energia dos campos que restarem. A observação de uma expansão acelerada indica esse destino fatal do universo. A densidade de massa-energia também parece estar de acordo. Porém, ainda há outras hipóteses sobre o destino do universo, as quais descreverei logo a seguir.\n\nO próximo cenário do qual falarei é o chamado “big freeze” (também conhecido como big chill, que significa “grande congelamento”) que seria a morte térmica do universo. Antes de falarmos sobre essa hipótese, devemos entender que o universo é o conjunto de tudo o que existe (como já foi mencionado). Não existe lado de “fora” do universo. Se existirem outros universos, eles são incomunicáveis. Cada universo abrange sua totalidade. Portanto, o universo é um sistema isolado (não troca energia com a vizinhança, pois nem sequer existe) e fechado (não troca matéria). Sendo assim, de acordo com a segunda lei da termodinâmica, a entropia nunca pode decair. A entropia mede a desordem de um sistema. Mas, para bagunçar um sistema, é preciso que calor seja fornecido. Então, as moléculas começam a transladar em torno de um centro de massa (portanto, possuindo energia cinética) e a medida disso é a temperatura. A entropia é definida pela razão do calor cedido ou recebido por unidade de temperatura absoluta. Ou seja, a entropia em um sistema aumenta mais se a temperatura for menor que outro sistema, fornecendo-se a mesma quantidade de calor. Isso decorre do fato do sistema de menor temperatura estar menos “bagunçado” que o outro sistema. No caso do universo, como nunca cede calor (lembre-se, é um sistema isolado), a entropia global sempre aumentará. Nesse modelo, o universo também se expande, mas a matéria não é esgarçada. O que acontece, é que na medida que o tempo passa, o universo se arrefece cada vez mais e não há mais trabalho para ser realizado. As estrelas queimam por fusão nuclear por trilhões de anos e acabam exaurindo seu combustível, acabando em anãs negras. Buracos negros serão cada vez mais frequentes e engolirão as estrelas mortas. As ondas eletromagnéticas que vagarão pelo cosmo tenderão a deixar de existir (uma vez que com a expansão, a frequência tenderá a zero, como eu falei no cenário do big rip). O universo então, ficará cada vez mais escuro, rarefeito e frio. A entropia continua a aumentar cada vez mais até que se maximize. Assintoticamente à essa tendência, o tempo também deixará de passar, tornando-se cada vez mais “lento” a passagem dos momentos do universo. O universo continua a se expandir, indefinidamente. Mas nada se esgarçará. Talvez quando essa hipótese foi cunhada, eles não levaram em consideração a aceleração da expansão do universo. Por isso, talvez, foi aceita como a melhor para explicar o destino do cosmo. Sobre a questão da vida, chega a ser até ingênuo perguntar o que vai acontecer. O simples fato de não haver mais nenhuma fonte de energia, não poderá haver nenhum tipo de organismo vivo. Pior… Os buracos negros engolirão tudo e os prótons não existirão mais. Até mesmo os buracos negros morrerão, pois evaporarão por radiação hawking. Mas ainda é cedo para isso acontecer, estamos na década cosmológica que compreende 10 bilhões a 100 bilhões de anos do universo. As décadas cosmológicas são definidas pelo logaritmo da idade do universo. Portanto, estamos na décima década cosmológica.\n\nO último cenário é talvez o mais surpreendente e bizarro dentre todos os citados. Chama-se transição de estado de falso vácuo para vácuo verdadeiro. Primeiramente, precisamos entender o que os físicos chamam de “vácuo”. Vácuo não é apenas uma região sem ar, mas também, sem qualquer tipo de matéria. As únicas exceções são os neutrinos, que apesar de serem férmions, eles interagem apenas fracamente (pela força nuclear fraca) e atuam mais semelhantemente à radiação. Vazio seria um espaço do universo sem conteúdo nenhum. Isso não existe e nunca existiu. Todo o espaço do universo é ocupado por campos e radiação, seja de estrelas ou da radiação advinda da era do desacoplamento posterior ao big bang. O vácuo é uma região de potencialidade, ou seja, algo pode surgir de lá espontaneamente. É o que ocorria a todo o momento segundos após o big bang. Como falei, campos ocupam o vácuo. Um desses campos, é o campo fermiônico (ou campo da matéria), que pode se quantizar por flutuações quânticas aleatórias, formando férmions (como os quarks e os elétrons) e anti-férmions, sempre aos pares. É isso que provavelmente ocorre nas adjacências do horizonte de eventos do buraco negro. Pares de partícula e antipartículas surgem e uma cai e outra escapa. Isso que é a radiação hawking. A massa das partículas advém da energia que a flutuação quântica englobou no volume infinitesimal que depois são identificadas como “quanta”. Pois bem, sabendo-se disso, podemos abordar o conceito de “falso vácuo”. Falso vácuo seria um estado metaestável do universo (isto é, não totalmente instável e nem estável) que representa um mínimo local na função de energia dos campos x valor dos campos φ. Por mais que seja um mínimo local, não é o estado de vácuo com menor energia. Esse estado contém mais energia que o estado de “vácuo verdadeiro” apesar de ser metaestável. A mensuração de valores da massa do bóson de higgs bem como do quark top parecem indicar que vivemos em um falso vácuo. Isso quer dizer que se conseguirmos energia suficiente para excitar o campo de higgs, de modo que ele se adense, o falso vácuo poderia decair para um verdadeiro vácuo e liberar a energia que continha. O produto disso seria uma expansão cósmica sem precedentes, que se fosse comparada a uma velocidade (apesar da expansão ser uma taxa do quão rápido o universo se expande), seria na velocidade da luz. Isso quer dizer que antes mesmo de vermos algo, o horizonte já teria se afastado e nós provavelmente já teríamos virado uma sopa de partículas elementares. Quem sabe isso não aconteceu já em algum lugar do universo observável e essa “onda” não nos alcançará um dia… Certamente que irá demorar, mas pode ter acontecido. Uma analogia a isso seria de uma bola presa a uma saliência de uma determinada superfície, contendo energia potencial gravitacional (pois está a uma certa altura do solo). Um toque que seja nessa bola, ela pode cair e liberar a energia potencial em cinética. É mais ou menos isso que pode ocorrer na transição de vácuo. Isso pode ocorrer a qualquer momento. Aliás, é o que se teme que aconteça no LHC, com os bombardeamentos de partículas. Mas muita coisa ainda não foi confirmada. Se comparado aos outros cenários previamente discutidos, diria que é o mais improvável de acontecer. Mas improvável não significa impossível de acontecer. As pessoas que ganham na loteria tinham baixa probabilidade de ganhar (assim como os outros) e mesmo assim ganharam.\n\nEnfim, há outras hipóteses que sugerem diferentes destinos do cosmo, mas eu citei as mais plausíveis. Quanto ao fim da vida na Terra, certamente que acontecerá antes de qualquer evento desses. Penso que o fim inevitável para nossa espécie será quando o Sol expandir e virar uma gigante vermelha, não necessariamente engolindo a Terra (provavelmente chegará até a órbita de Vênus), mas secando todos os oceanos e liquefazendo o planeta. Se tivermos tecnologia para migrarmos para outro lugar, talvez para a lua Europa de Júpiter, teremos que vencer outros desafios, como a baixíssima temperatura. De qualquer jeito, não podemos evitar o nosso fim. Uma hipotética solução para isso seria a de migrar para outros universos, mas isso é só ficção científica. Não existe nenhuma evidência de que universos paralelos existem, tanto a versão cosmológica como a da hipótese das cordas. Nossa extinção é inexorável e não há nada que possamos fazer.\n\n- Fonte: https://archive.is/IS19t",
				"added": 1602172338
			},
			{
				"comment_id": 53,
				"body": "#Matéria e energia\n\nA matéria é um constituinte substancial do universo (mas não é o único constituinte) que forma praticamente tudo que podemos “tocar” no nosso dia a dia. Em verdade, não apenas “tocar”, mas ver, cheirar e até “sentir”. É razoável pensarmos que a matéria é a pedra angular do universo, isto é, o constituinte que forma todas as coisas que existem. Essa noção, apesar de ter sido considerada válida por muitos e muitos anos (e que os materialistas acreditavam), está errada. O universo não é formado apenas de matéria, mas é também de campos e radiação. Em verdade, a matéria não é o constituinte que forma tudo o que existe. Se formos reduzir o universo em sua entidade mais primordial, chegaremos aos campos (ou apenas “campo”), uma vez que matéria e radiação são quantizações de campo, isto é, porções de campo que assumem apenas propriedades específicas que possuem valores fixos e determinados (valores ditos “quantizados”), e que sem essas porções exibirem esses determinados valores, o campo não se condensa (ou não se quantiza) para formar as entidades independentes individualizadas que chamamos de matéria e radiação. Matéria e radiação são entidades substancias do cosmo, isto é, são “coisas”. O fato de há muito tempo atrás ter considerado-se que a matéria é a entidade formadora de tudo deu-se por duas razões principais: A primeira é que a matéria é a entidade do universo que pode ser percebida sensorialmente e facilmente pelos animais (como falei, através do “cheiro”, “toque” e “visão”) e também possui outras propriedades que fazem com que seja uma entidade simplesmente perceptível para nós, como a impenetrabilidade e indestrutibilidade. A segunda é que não havia tecnologia e nem conhecimento científico (mais especificamente, físico) para que se pudesse saber que existe outros entes no universo. A “luz” era algo que ainda não era entendido e nem era considerada uma entidade cósmica, apesar de ser algo intrínseco a natureza. Somente com os estudos de óptica de Sir Isaac Newton e de posteriores físicos que a luz passou a ser cada vez mais compreendida. Sabemos hoje também, que a “luz visível” é uma das modalidades da radiação, entidade que interage com a matéria que faz com que hajam formações e transformações nas estruturas do universo. A “luz visível” é a fatia do espectro eletromagnético que conseguimos ver, pois possui as frequências específicas que o olho humano pode “perceber”. Mas o espectro também é formado pelo restante das modalidades radiantes que não podemos “perceber”, que são os raios gama, raios x, raios ultravioleta, raios infravermelhos, microondas e ondas de rádio. Quando a radiação se propaga (que é, aliás, uma das características da radiação, pois ela inexiste em repouso) ela se comporta como onda e quando é emitida e absorvida se comporta como “corpúsculo”. Só pode ser absorvida e emitida quanticamente, isto é, de forma quantizada (ou ainda discreta), que corresponde a valores inteiros do fator da constante de Planck e frequência, que é a energia dos fótons. Os fótons são essas entidades “corpusculares” e são os quanta do campo eletromagnético. Em verdade, a radiação eletromagnética nada mais é que campos elétricos e magnéticos auto-propelentes. Os mais variados experimentos realizados nos permitiram concluir que radiação e campos são também entidades do universo. Os experimentos nos aceleradores de partículas reforçaram a ideia de campos existirem fisicamente (e não apenas serem uma entidade abstrata, isto é, uma região abstrata do espaço que se encontra sob influência de alguma interação e que contém valores de intensidade dessa interação ao longo do espaço).\n\nDepois dessas considerações, dedicarei esse parágrafo para explicar as diferenças entre os constituintes do universo, bem como defini-los mais fundamentalmente e apontar alguns erros triviais e fatais quando se aborda esse tema. Podemos definir “matéria” como uma união de férmions. Estes são partículas que obedecem as estatísticas de Fermi-Dirac e ao princípio de exclusão de Pauli, bem como conservação de números quânticos. Como consequência, os valores de seus spins (momento angular intrínseco de uma partícula) são semi-inteiros. Além disso, apresentam a característica de indestrutibilidade e impenetrabilidade. A indestrutibilidade pode ser explicada pelo fato de seus números quânticos serem conservados. Desse modo, eles não podem ser aniquilados “a vontade”, pois esses números tem que se conservar, assim como momentum se conserva. Destroem-se apenas na aniquilação com o seu respectivo anti-férmion. Aliás, a antimatéria possui as mesmas propriedades da matéria, mas com valores diferentes. Quarks e léptons (elétrons, muons e táons) são férmions. A antipartícula do elétron por exemplo, é o pósitron. Elétron possui carga negativa enquanto que pósitron possui carga positiva. Outros atributos também diferem se comparamos essas partículas e antipartículas. Quanto a radiação, pode ser definida como uma união de bósons, em sua definição mais estendida. Os bósons são as partículas mensageiras de força entre os férmions e, diferente destes, obedecem as estatísticas de Bose-Einstein, não possuem conservação de número (o que significa que podem ser destruídos e criados a vontade) e nem exibem propriedades de impenetrabilidade e indestrutibilidade. Não obedecem ao princípio de exclusão de Pauli e possuem spin inteiro.Assim, podem passar uns em cima dos outros. Todos os férmions, sem exceção, possuem massa. Até mesmo o neutrino, mesmo possuindo uma massa débil. Os bósons podem ou não possuir massa. Os fótons por exemplo, não possuem massa de repouso. Os glúons e os supostos grávitons também não. Mas os bósons mediadores da interação fraca possuem massa de repouso, milhares de vezes maior que a massa do elétron. Os bósons de Higgs também possuem. Então, a noção de que “tudo que possui massa é matéria”, está errada. O modelo padrão de física de partículas inclui todos os férmions e bósons descobertos até hoje, que formam praticamente tudo o que existe no universo. Desde átomos até galáxias inteiras. Inclusive, a imagem que eu deixei no início do artigo, que representa uma foto de mais de 5000 galáxias longínquas, foi para dar uma noção do que esses pequenos constituintes do universo podem resultar. Há mais partículas elementares no corpo de uma pessoa do que estrelas no universo observável. O número de átomos do universo é cerca de 10^80 (o número 1 seguido de 80 zeros). Enfim, gostaria de terminar esse parágrafo falando das diferenças de “energia” e “matéria”, aliás, da diferença de energia e de qualquer ente do universo. Pode parecer estranho para você que está lendo que em nenhum momento eu falei que “energia” é uma entidade do universo. Mas de fato, não falei e nem falarei. Como muitas pessoas disseminam erroneamente (incluindo alguns físicos), “energia” não é uma entidade, isto é, não é uma “coisa”, não é “algo”. Energia é um atributo das entidades, assim como carga, volume, números quânticos, spin, corrente elétrica, estranheza, helicidade, entre outros. Falar que o universo é feito de energia é tão errôneo quanto falar que o universo é feito de spins. O universo é feito de partículas que possuem spin, assim como de conteúdo que contém energia, mas não “é” energia. Isso só para ver o quão absurdo é considerar que energia seja uma entidade. Não havia “energia” pura no início dos tempos, da qual supostamente tudo brotou (inclusive o próprio universo). Havia campo (indistinguível na era de Planck), que continha muita energia, que se transformou na massa das partículas elementares.  Nem sequer faz sentido comparar matéria, campos e radiação com energia. Pertencem a categorias diferentes. Esta é uma grandeza física escalar mensurável e quantificável que permite que os sistemas ajam, seja realizando trabalho ou por calor e também, irradiando. Trabalho é, pois, uma das modalidades de transferência de energia, como transferência de energia cinética ou potencial. Gosto de uma analogia cunhada pelo graduando em engenharia ambiental Marcelo Carsten, que percebeu muito bem a diferença entre “energia” e qualquer outra entidade substancial do universo. A analogia dele consiste mais ou menos na ideia de ir até uma loja, buscar por camisas, calças e bolsas, que seriam “campo”, “matéria” e “radiação”. Dentre as características desses utensílios, encontra-se o preço. Não se vai até uma loja comprar os “preços”, mas sim, as peças de roupa. O preço nesse exemplo, seria a “energia”. Do mesmo modo que nada “é” energia, mas há coisas que contém energia. Resumidamente, há quatro tipos de energia. A energia cinética (relacionada ao movimento de um corpo ou partícula), potencial (relacionada a configuração do sistema bem como às interações), radiante (energia que a radiação contém, como os fótons) e a energia térmica (relacionada a energia interna de um sistema que contenha um número muito grande de partículas, na ordem do número de Avogadro). A energia interna não inclui somente, as energias cinéticas translacionais, rotacionais e vibracionais, mas também, a energia dos campos que hajam por ali, bem como as potenciais e as energias das massas de repouso do sistema, tendo como referencial, o centro de massa do sistema. A temperatura é uma grandeza que se aplica ao macroscópico e mede apenas a energia cinética translacional. Logo, energia térmica nada mais que é energia cinética caótica. Também existe a energia das massas de repouso das partículas, que nada mais é que a equivalência das massas das partículas em questão em energia. É um tipo de energia potencial, que o campo fermiônico (cujas flutuações condicionam a existência de partículas e antipartículas) englobou na quantização. A equação da relatividade “E=mc²” não diz que energia é equivalente a matéria mas sim, que energia é equivalente a massa. Nas explosões das bombas em Hiroshima e Nagasaki, essa equivalência fez-se presente, quando a massa dos nuclídeos radioativos se transformou em energia sonora (na devastação mecânica), radiante e posteriormente na térmica também, bem como cinética dos produtos da fissão nuclear. Notem que “energia” e “massa” podem ser comparadas tranquilamente, pois pertencem a mesma categoria. Na aniquilação de partículas e antipartículas, o produto não é energia, mas sim, radiação, que depois colidem e voltam a formar os pares. A massa de repouso das partículas e antipartículas em questão é que se transmuta em energia. Quanto ao espaço e tempo, também são entidades do universo, mas não substanciais. O universo é formado por campos, matéria e radiação (em verdade, fundamentalmente, tudo advém de um único campo ondulante, mas isso já é tema para outro artigo), estruturas, ocorrências, espaço e tempo. Dentre as propriedades das entidades, encontra-se a energia, junto com spin, carga, duração, intensidade e outras. Quanto a matéria e energia escura, abordarei em outro artigo.\n\n- Fonte: https://archive.is/C4gXi",
				"added": 1602172505
			},
			{
				"comment_id": 54,
				"body": "#Vivemos dentro de um buraco negro?\n\nBuracos negros se formam quando estrelas hipermassivas (com massas superiores a 30 sóis) colapsam pela própria gravidade, não havendo mais nenhuma pressão térmica e radiante para contrabalancear com a gravidade. Quando a fusão nuclear fabrica núcleos de Ferro por exemplo, a reação nuclear passa a ser endotérmica, isto é, precisa absorver energia ao invés de liberar como em uma reação exotérmica após o choque entre os núcleos atômicos. Assim, não há mais fótons como produtos e consequentemente, não há mais pressão nas camadas externas da estrela para suportar seu próprio peso. Então, as camadas externas ao núcleo desabam sobre o próprio núcleo, provocando um ricochete e então, ocorre a explosão. A energia liberada advém da potencial gravitacional liberada na contração das camadas externas. A energia sonora está presente na onda de choque material (que é o que é expelido na explosão). Esse evento cataclísmico é conhecido como “supernova” e pode ser uma “hipernova” quando a massa da estrela é muito grande, superior a de uns 40 sóis. Como 90% do conteúdo material da estrela é arremessada literalmente para fora, sobra apenas 10% de sua massa que pertence ao caroço, que posteriormente virará um buraco negro, se a massa for superior ao limite de Tolman-Oppenheimer-Volkoff (cerca de 3 vezes a massa do Sol). Se for entre esse limite e o limite de Chandrasekhar, o caroço será uma estrela de nêutrons. O limite de Chandrasekhar é o quanto de massa o caroço resultante da estrela precisa ter para virar uma anã branca. Esse limite é de cerca 1,5 vezes a massa do Sol. Uma anã branca é uma estrela de gás fermi de elétrons degenerados, isto é, o caroço resultante da explosão é contraído até o limite máximo possível em que não se pode mais contrair, pois há uma pressão quântica dos elétrons que impossibilita estes ocuparem o mesmo estado quântico. Essa pressão advém do princípio de exclusão de Pauli e não depende da temperatura da estrela mas sim, da densidade. Em uma estrela de nêutrons, os prótons se combinam com os elétrons em um processo chamado captura eletrônica, e se transformam em nêutrons. A pressão gravitacional é tão gigantesca que os elétrons são jogados contra os prótons, ocorrendo assim, pois, a transmutação. Então, restam nêutrons e agora existe um gás fermi de nêutrons degenerados. Nêutrons assim como elétrons são férmions, o que quer dizer que também não podem ocupar o mesmo estado quântico. Então ficam nos seus níveis de energia mais baixos possíveis. Pulsares e Magnetares são em verdade estrelas de nêutrons. Mas quando a massa ultrapassar o limite de TOV, então nem mesmo a pressão quântica dos gás fermi dos nêutrons é capaz de estabilizar a estrela, que já se contraiu em um volume menor que o da Lua! Então, os próprios nêutrons, que antes estavam empacotados na estrela, como se esta fosse um único núcleo atômico, são exprimidos e o núcleo continua a se contrair até chegar no que o teorema de Hawking-Penrose propõe, que é uma singularidade. Já escrevi sobre singularidade e vale todas as penas ler: [Houve mesmo uma singularidade?](https://archive.is/zNN7A)\n\nAcontece que o produto disso é uma curvatura gigantesca no tecido espacial-temporal provocada por uma grande densidade de massa-energia. O raio para qualquer corpo virar um buraco negro é chamado de raio de Schwarzschild, que é a distância entre o caroço do buraco negro e o horizonte de eventos, que é a região que limita o que entra no buraco negro e nunca mais sai, isto é, o que pertence a seu interior à área de fora do buraco negro. Em verdade, os buracos negros causam uma curvatura tão gigantesca no tecido espacial-temporal que nem mesmo a luz pode escapar. Se a luz ultrapassar o horizonte de eventos, percorrerá as geodésicas e será relegada ao limbo. A equação que determina o raio de Schwarzschild é diretamente proporcional à massa da estrela. O raio de Schwarzschild pode ser obtido através da equação R=2GM/c², em que M é a massa da estrela, G é a constante gravitacional de Newton e c a velocidade da luz no vácuo. O interessante é que se pode calcular o raio de Schwarzschild necessário para uma pessoa virar um buraco negro. Mas é um número infinitesimal, menor que o tamanho de um átomo. Podemos concluir que o fato do universo estar imerso no interior de um buraco negro vai depender diretamente de sua massa (e não densidade). Como a massa da matéria luminífera do universo é cerca de 2×10^52kg e isso é apenas um vigésimo do conteúdo massivo-energético do universo, considerando a energia e matéria escuras, esse valor é 4×10^53kg. Se multiplicarmos isso duas vezes pela constante gravitacional de Newton ( que é cerca de 6,67×10^-11 m^3 kg^-1 s^-2) e somarmos os valores, bem como dividirmos pelo quadrado da velocidade da luz no vácuo, obteremos um raio de cerca de 6×10^26 metros. O raio de hubble cósmico é cerca de 46,5 bilhões de anos luz, ou seja, 4,4×10^24 metros. Portanto, é menor que o raio de Schwarzwild do cosmo. Isso quer dizer que vivemos no interior de um buraco negro desde que o universo surgiu. Não há nenhuma inconsistência fenomenológica nesse fato, uma vez que a densidade de um buraco negro é inversamente proporcional a sua massa e esse é compatível com o que se observa no universo observável. De fato, sempre viveremos em um buraco negro, que é todo o universo! O universo é por definição, um sistema isolado e fechado. Dessa forma, não há “lado de fora” do universo. Vivemos no interior de um buraco negro (que é o próprio universo), em que só deixará de existir quando o valor raio do universo ultrapassar o valor do raio de Schwarzschild.\n\n- Fonte: https://archive.is/lMeDu",
				"added": 1602172619
			},
			{
				"comment_id": 55,
				"body": "#Considerações sobre o big bang\n\nNumerei as principais considerações a respeito dos principais equívocos (e os mais graves também) que observo que há em relação ao big bang e à teoria explicativa. Ad cautelam!\n\n- 1- O big bang não foi uma explosão. Explosão é o arremesso de um conteúdo que se mova propriamente e em relação ao centro da explosão, em um espaço circundante preexistente. Após o big bang, o conteúdo não se distanciou, mas houve afastamento pois o espaço em si se expandiu, carregando tudo que estava nele, sem, no entanto, o conteúdo ocupante sair do lugar. O que aconteceu é que cada vez mais lugares foram surgindo entre o espaço que separava os conteúdos, isto é, o espaço inchou. Pode haver movimento relativo e próprio das galáxias sim, detectados pelos “blue shifts”, mas isso se dá em regiões em que a expansão não é notável. Em escalas de distâncias até as galáxias mais próximas, a expansão pode ser considerada desprezível, pois a taxa de variação de separação entre os sistemas é diretamente e linearmente proporcional a distância em que se encontram os sistemas que se afastam (lei de Hubble). Somente em escalas de distâncias cosmológicas é que se tem expansão do espaço notável. E essas distâncias são da ordem de centenas de milhões ou até bilhões de anos luz.\n\n- 2- Não havia energia pura no início dos tempos. Há que se separar bem o que cada elemento é, bem como classificá-lo em alguma categoria da realidade. Energia assim, é uma propriedade e não uma entidade. Matéria é uma entidade, isto é, uma coisa, algo que se pode conceber existindo substancialmente (filosoficamente falando). Energia então é uma qualidade, um atributo, algo que se pode conceber como caracterizando alguma coisa. Outros exemplos de atributos de coisas são comprimento, volume, massa, spin, paridade, helicidade, carga, intensidade, posição e afins. Atributos de interação são força, impulso, torque, trabalho e calor. Atributos do movimento são momentum linear, momentum angular, velocidade, aceleração, inércia e outros. Grandezas são mensurações quantificadas dos atributos ou propriedades. Assim, existe uma grandeza que quantifica cada atributo desses que eu falei, geralmente do mesmo nome que o atributo em si, como o é “energia”. Energia é uma grandeza que mede a capacidade que algo contém de agir, isto é, executar ações que encadeiam em modificações no estado do conteúdo do universo. Matéria é uma das substâncias do universo e portanto é uma entidade. Mas também é um “ser” porque é uma entidade que de fato existe, e não é mera abstração. Dentre os atributos da matéria, encontra-se energia. Mas o que havia no início dos tempos não era nem matéria! Era campos, que se encontravam desquantizados, porém indiferenciados e eram uniformes. Esses campos continham uma grande quantidade de energia, que depois se transformou em massa e outros tipos de energia, valendo a lei de conservação (depois volto nas leis). Portanto, o big bang não foi uma explosão energética (esse para mim, é o maior equívoco que se pode cometer a respeito, e eu acabei de mostrar que são mesmo, por mera questão de definição).\n\n- 3- O big bang não foi o surgimento do universo. O big bang foi um evento que marcou o início da expansão e da passagem do tempo. Isso se deu já com o espaço existente e o conteúdo nele imbricado. Isto é, a teoria do big bang nem mesmo explica o que originou o conteúdo primordial acoplado no continente espacial. Assim, a teoria do big bang é uma teoria da expansão e evolução do universo partindo de momentos infinitesimais não nulos. A teoria (que é um modelo explicativo da realidade devidamente confirmado, verificado, justificado e revisado) do big bang descreve as ocorrências, as entidades, as propriedades das entidades e das ocorrências e como isso tudo evoluiu na medida que o tempo passou. É correto falar que o big bang é a origem do tempo e da expansão, mas não o é falar que é a origem do universo. Quanto a dizer que é a origem da matéria, digo que não. Digo que a matéria foi consequência dos eventos que se sucederam “a posteriori”, assim como a radiação. Já a origem dos campos (que é o que se tem de mais básico na natureza), não se sabe como se deu, em que se pese as propostas de Roger Penrose, Sean Carroll, Steven Weinberg, Alex Vilenkin, Mário Novello, Alan Guth e outros.\n\n- 4- O big bang não originou as “leis da física”. Primeiro que, as leis da física não são algo apriorístico no universo. Com um simples exame de lógica, pode-se mostrar que não. O que quer que tenha acontecido que fez com que o universo surgisse, não pode ter “seguido” nenhuma lei, pois leis são descrições empíricas do comportamento natural. Sem haver espaço, tempo, campos, radiação, matéria, estruturas e ocorrências, não se tem nada físico existente. Logo, nada natural. Portanto, não há como descrever nada, uma vez que nada existe. Então as leis não tem aplicabilidade. Isto é, o próprio surgimento do universo pode não ter seguido nenhuma lei! As leis se aplicam ao universo já existindo. E as leis da física são descrições e não prescrições. Descrever é dizer como acontece, prescrever é determinar que algo aconteça. Isso é muito diferente. O comportamento da natureza se dá por conta própria. Não existem “leis da física” como entidades. Elas são construtos humanos. Acontece que se observa e experimenta-se certos comportamentos da natureza, em que se observa uma certa regularidade e certas propriedades, como por exemplo, a conservação da energia, o movimento inercial, a invariância da velocidade da luz, a permanência do conteúdo substancial material, o comportamento probabilístico e o indeterminismo em escala atômica e subatômica, etc. Isso tudo pode ser descrito. Mas a natureza não evolve “seguindo” essas leis. As leis não são necessidade nenhuma. O universo poderia existir com leis totalmente diferentes. Inclusive, nem se garante que o próprio comportamento não pode mudar.\n\n- 5- O big bang absolutamente não implica que o universo foi criado (nem que teve uma causa)! Por mais que a ideia tenha sido desenvolvida primordialmente por Georges Lemaître, que era uma padre belga, ela se baseia na relatividade geral, e outros cientistas também entraram na disquisição, como George Gamow, Ralph Alpher, Hans Bethe, Robert Dicke, Edwin Hubble, Alexander Friedmann e o próprio Albert Einstein. Como foi explicado acima, o modelo explicativo chamado de “big bang” (impropriamente, foi cunhado por Fred Hoyle em uma transmissão de rádio demonstrando desdém a teoria) não aborda a origem do universo. Então é um grande absurdo falar que implica que o universo foi criado. Deus (ou qualquer outra entidade supernatural transcendental), existindo ou não, não interfere em nada na validação da teoria, esta que, em última instância, deve ser validada e confirmada acessoriamente pela razão e pela verificação das evidências empíricas, bem como com o cotejo sistematizado de tudo isso e as tentativas de se refutar a própria teoria. Se o universo for eterno, então não houve big bang, pois o big bang implica também no início da passagem do tempo e sendo eterno, por definição, sempre houve decurso do tempo. Então o que poderia haver seria um “big bounce” e não um “big bang”. Finalmente, queria comentar que causalidade não é necessidade nenhuma. Como Werner Heisenberg já bem percebia há quase um século atrás: “A física quântica forneceu a refutação definitiva do princípio da causalidade”. Já escrevi um texto sobre isso, vejam: https://archive.is/6yyHB\n\n- 6- No big bang, não era o universo inteiro que estava contido em uma região menor que um elétron e sim o universo observável. Universo observável é a porção do universo que se consegue ter acesso a observação pois houve tempo da luz chegar até nós. Nós somos o centro do universo observável, pois somos os observadores dessa determinada porção do universo. Universo inteiro não engloba somente os lugares que se pode ver pois houve tempo da luz chegar até nós, mas todos os lugares e todos os momentos. Universo é o conjunto de tudo o que existe em todos os lugares e momentos. No entanto, se o universo for infinito, ele assim o foi desde que surgiu. Isso quer dizer que mesmo no big bang, ele já surgiu infinito. Infinito não é um número, nem um lugar. É um símbolo de indeterminação. É um limite. Quer dizer um valor que é maior que qualquer outro que se possa conceber. O universo pode ser tanto finito ou infinito, mas é ilimitado, por definição. Sendo finito ou infinito, o big bang também se aplica.\n\n- 7- O big bang não foi uma singularidade (nem adveio de uma). Em verdade, a singularidade apenas é uma situação em que se não tem conciliação das explicações dadas pelas teorias mais fundamentais da natureza: relatividade e quântica. Ainda não se sabe como resolver o “problema da singularidade”, pois se fato existiu mesmo uma singularidade, as leis da física não se aplicam. Mas nada impede que o próprio universo já tenha surgido em um volume infinitesimal, mas não nulo, com as ocorrências então, descritas pela teoria do big bang. Portanto, o big bang não “foi” uma singularidade e nem dela adveio.\n\nAlguns comentários extras: Além da possibilidade do universo ter surgido, há a de que é eterno e de que nem surgiu e nem é eterno, mas apenas passou por uma transição, de uma configuração estática, embora seja difícil admitir essa hipótese. A teoria do big bang em verdade já foi corrigida, pela teoria inflacionária de Guth, Linde, Steinhardt e outros. A teoria parece resolver alguns problemas que a teoria do big bang quente ou convencional não resolve, como o problema da planaridade, da estrutura em larga escala, problema do horizonte e dos monopólos magnéticos. Juntamente com a teoria quântica de campos e relatividade geral, tem-se uma boa descrição do que ocorreu momentos depois que o universo existiu. Quanto a época de Planck, sabe-se muito pouco. A relatividade geral prevê algo que não é consistente com a teoria quântica. A época de Planck marca justamente esse limite de compreensão fenomenológica, uma vez que para tempos menores que o de Planck, aparentemente não há como se descrever. A teoria do big bang está longe de ser a melhor teoria da evolução e expansão do universo (como eu disse, foi até complementada pela teoria inflacionária). Muitos problemas ainda não estão resolvidos. Nem mesmo a teoria da inflação resolve. No entanto, muitos erros (principalmente conceituais) cometidos a respeito, obstruem uma compreensão mais clara e correta dos fatos.\n\n- Fonte: https://archive.is/4btfk",
				"added": 1602172988
			},
			{
				"comment_id": 59,
				"body": "#Conferência - Origem e evolução do universo e suas derivadas\n- https://invidious.snopyta.org/chiFrw1w4R4\n- https://siasky.net/CACbZrhgda2XYK4uibdIRe8cjN_e3QXVPe7WBoxvJhLDqg\n\nPassos: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn_2",
				"added": 1602181851
			},
			{
				"comment_id": 60,
				"body": "#Debate sobre a origem e a causa da existência do universo\nExiste uma razão para a existência do universo? Por que existe algo e não nada? Deus existe?\n- https://invidious.snopyta.org/5a1q_q11pYw\n- https://siasky.net/AAA_SndYyz1bkscFBHur98lbfy4MbYa8ZoQrC6myCVAnxw",
				"added": 1602181896
			},
			{
				"comment_id": 64,
				"body": "#Desvendando a radiação Hawking\n- https://ipfs.infura.io/ipfs/QmVmqnMuCeazB2GNp7Xnye3t8sfd7kTkiz54XUNy8XfNaC\n\nBuracos negros clássicos, descritos pela relatividade geral, podem absorver partículas, mas não podem emiti-las. Entretanto efeitos quânticos fazem com que buracos negros passem a emitir partículas e comportem-se como um corpo com temperatura diretamente proporcional a κ, a gravidade superficial do buraco negro em questão. Este artigo tem o objetivo de desvendar a radiação Hawking, para o colapso esfericamente simétrico, servindo de motivação e apoio para estudos introdutórios em teoria quântica de campos em espaços curvos.",
				"added": 1602187391
			},
			{
				"comment_id": 65,
				"body": "#O que exatamente é o Paradoxo da Informação?\n- https://ipfs.infura.io/ipfs/Qmb4QZX8mvFxdd2zKfwCNscDgYHYdjCG7ANeoZwAgY79PC\n\nO [paradoxo da informação do buraco negro](https://en.wikipedia.org/wiki/Black_hole_information_paradox) nos diz algo importante sobre a forma como a mecânica quântica e a gravidade se encaixam. Nessas palestras tento fazer uma revisão pedagógica da física essencial que leva ao paradoxo, utilizando principalmente imagens. O argumento de Hawking é reformulado como um \"teorema\": se os efeitos da gravidade quântica estão confinados a uma determinada escala de comprimento e o vácuo é considerado único, então haverá perda de informações. Concluímos com um breve resumo de como os efeitos quânticos na teoria das cordas violam a primeira condição e fazem do interior do buraco uma \"bola de fuzzball\".",
				"added": 1602188228
			},
			{
				"comment_id": 75,
				"body": "#Do Big Bang ao Universo Eterno\n- https://invidious.snopyta.org/W21s-blOskY\n- https://siasky.net/AACVacAEBesYUQt4oEVAbeu81W_fdyIvKCDsZBuELZzhYw\n\nDescrição: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn_14",
				"added": 1602436172
			},
			{
				"comment_id": 84,
				"body": "#Probabilidade de uma xícara de chá quente sair “voando” por aí (funny statistical physics)\n\nO calor sensível é definido como: Q=mcΔT. O calor latente é definido como Q=mL, em que L e c são constantes, a primeira é do calor latente e a segunda é o calor específico. O calor latente é a quantidade de energia térmica que se transfere para uma substância mudar de estado . O calor sensível é a quantidade de energia térmica envolvida para alterar a temperatura de um sistema. A entropia boltzmanniana, isto é, a entropia definida em termos de microestados compatíveis com macroestado de um sistema é: S=klnW, em que k é a constante de Boltzmann (1,38×10^-23 J/K) e W é a quantidade de microestados compatíveis com dado macroestado. A entropia, em uma transformação isobárica é: ΔS= mcln(T/T0), em que m é a massa da substância, c o calor específico e T e T0 a temperatura final e inicial. Em uma transformação isotérmica (mudança de estado), ela vale: ΔS=mL/T, em que T é a temperatura que se dá essa transformação. Mas a entropia também é definida, em termos de derivadas pfaffianas: dS=dQ/dT. Uma xícara de chá, de 100g de conteúdo, a 80°C (353K), tem uma energia interna de (considerando calor específico de 0,5cal/g°C): Q=mcΔT (zero absoluto até o ponto de fusão do gelo) -> Q=100.0,5.273= 13650cal. Vamos chamar essa quantidade de Q1. Na transformação de sólido para líquido, tem-se que (considerando o calor latente de fusão da água 80cal/g): Q=mL -> 100.80=8000cal. Vamos chamar essa quantidade de Q2. Finalmente, na mudança de temperatura desde 273K até 353K, tem-se que (considerando o calor específico como 1cal/g°C: Q=100.1.80=8000. Dessa forma, tem-se que: Q1+Q2+Q3=29650cal, que para joules, tem-se que é aproximadamente 124.000J, que é a energia necessária para fazer com que a substância chegue até esse estado. A velocidade média das moléculas é: mv²/2=124000 -> v~1575m/s -> 1575×3,6=5670km/h.\nA entropia então, vem a ser, considerando as equações já apresentadas. ΔS=100.0,5.ln(273/1)= 280,5cal/K (eu considerei T0 como sendo 1K, uma vez que diverge em 0K). Na fusão: ΔS=100.80/273=29,3cal/K. Finalmente, de 0°C ou 273K até 80°C ou 353K: ΔS= 100.1.ln(353/273)=25,7cal/K. Assim: ΣΔS= 335.5cal/K, o que dá 1403J/K. Da definição já apresentada. S=klnW. Aplicando a exponencial em ambos os lados da equação da entropia boltzmanniana: W=e^(S/k) -> W=e^(1403/1,38×10^-23)=1,016×10^26. Isso é o número de microestados totais, correspondentes a todos os macroestados. Mas o microestado que se quer, que é o peso estatístico, é o das moléculas se movendo com a velocidade acima na mesma direção (xícara de chá quente “voando”). Logo, a probabilidade é o inverso desse resultado. p=1/1,016×10^26=1,016×10^-26. Ou seja, algo ridiculamente pequeno. Mas isso não é impossível. Só que é sumamente provável que se passe o tempo de existência do universo inteiro, mesmo você tendo a xícara, que ela jamais saíra voando por aí. Mas pode sair. Isso porque a constante de Boltzmann é pequena.\n\n- Fonte: https://archive.is/p5mtT",
				"added": 1602467728
			},
			{
				"comment_id": 85,
				"body": "#6º Hangout Ciência e Astronomia: Teoria das Cordas\n- https://invidious.snopyta.org/QDOogU8rAP4\n- https://siasky.net/CADwCqqzPe9sGhXPVoF7CzKCDxLG43ifvrtrD5rhMpzatA",
				"added": 1602473477
			},
			{
				"comment_id": 86,
				"body": "#Teoria das Cordas\n- https://invidious.snopyta.org/YiFWfrF7_uk\n- https://siasky.net/AAC0Bk4fe59FrK-DdbqMcpNoIcpmxqz6iykIe-LjfflSkQ\n\n4ª palestra da I Semana da Física online do IFPR campus Ivaiporã.\nProfº Drº Daniel Vieira - IFG",
				"added": 1602473575
			},
			{
				"comment_id": 91,
				"body": "#Livros\n- https://web.archive.org/web/20201013171612/http://www.todasasconfiguracoes.com/livros/\n\n\"Então você quer aprender física, pois bem. No começo de meu treinamento, cacei duramente os melhores livros de cada matéria para poder ter sucesso em minha empreitada, dedico este espaço a poupar este trabalho de quem pensa em começar essa jornada, listando o melhor material que conheço de cada área da física. Com o apoio de algum amigo matemático, logo amplio essa lista para os livros dessa disciplina.\"",
				"added": 1602610596
			},
			{
				"comment_id": 97,
				"body": "#GravBR \nA iniciativa [GravBR](https://sites.google.com/view/antoniodpj/gravbr) tem como objetivo principal organizar seminários online periódicos nas áreas de astrofísica, gravitação e cosmologia com ampla participação de pesquisadores atuando no Brasil. O objetivo inicial é a organização de seminários quinzenais. A principal meta da iniciativa é promover um ambiente de discussão entre grupos e pesquisadores, mantendo os resultados da pesquisa nas referidas áreas devidamente disseminada por todo o país. Evidentemente, a iniciativa será aberta para pesquisadores que atuam fora do país também e pode haver a necessidade de alguns seminários serem ministrados em inglês.\n- https://invidious.snopyta.org/channel/UCGtr7zu_1ZecuO3iVMJWxsA",
				"added": 1602790056
			},
			{
				"comment_id": 98,
				"body": "#TQCBR\nO projeto [TQCBR](https://tqcbr.wordpress.com/) tem por objetivo promover as atividades desenvolvidas por pesquisadores em solo brasileiro, mas não somente, sobre a física de partículas e interações fundamentais, com a finalidade de reunir a comunidade brasileira de [teoria quântica de campos (TQC)](https://en.wikipedia.org/wiki/Quantum_field_theory) em torno de debates a respeito do cenário atual e de perspectivas de futuro das pesquisas na área.\n- https://invidious.snopyta.org/channel/UCiTJZ6vAAgCavo0k-zETkJw",
				"added": 1602790381
			},
			{
				"comment_id": 99,
				"body": "#A HIPÓTESE DOS GRANDES NÚMEROS E A MECÂNICA QUÂNTICA\nA [hipótese dos grandes números de Dirac (LNH)](https://en.wikipedia.org/wiki/Dirac_large_numbers_hypothesis) é uma observação feita por [Paul Dirac](https://en.wikipedia.org/wiki/Paul_Dirac) em 1937 relacionando as proporções das escalas de tamanho no Universo às escalas de força. As proporções constituem números adimensionais muito grandes: cerca de 40 ordens de magnitude na época cosmológica atual.\n- https://web.archive.org/web/20200211131050/http://dfisweb.uefs.br/caderno/vol3n1/Carneiro_OK.pdf",
				"added": 1602806406
			},
			{
				"comment_id": 100,
				"body": "#Astrofísica e a Hipótese dos Grandes Números\n- https://invidious.snopyta.org/LWD2KRYghms\n- https://siasky.net/AAClzi9FLp23HprbArh1Yf0KI4t-Z0dcffOuY3WUM8gOuQ",
				"added": 1602808468
			},
			{
				"comment_id": 106,
				"body": "#Teoria quântica da gravitação: Cordas e teoria M\nhttps://ipfs.infura.io/ipfs/Qmdqzf7rDbzXjGVvenGhjHzLtjWKyBH1w51BGZWWCQ3rDK",
				"added": 1602992500
			},
			{
				"comment_id": 107,
				"body": "#Introdução ao teorema de Nash e às Branas-mundo\n- https://ipfs.infura.io/ipfs/QmSc8SY77VRkcMa2AmSHZNCob5qVLqzoVw87F7YaRctsmm\n\nApesar dos modelos de Branas-mundo terem recebido atenção considerável nos últimos anos por fornecerem várias opções à física contemporânea, seus mecanismos não são completamente entendidos ou apropriadamente justificados. Tendo em vista tal dificuldade, neste trabalho fornecemos uma contribuição pedagógica dirigida especialmente aos alunos de pós-graduação em física, fazendo uma abordagem introdutória a um dos temas importantes em física e geometria no que diz respeito aos fundamentos da teoria de imersão de variedades. Apresentamos uma descrição do teorema de imersão de Nash de 1956 que mostra como fazer uma imersão local entre variedades Riemaniannas mantendo a regularidade e diferenciabilidade das funções de imersão, e de como isso é aplicado à física sob o ponto de vista das Branas-mundo.",
				"added": 1602993016
			},
			{
				"comment_id": 109,
				"body": "> [kieroche](#comment_22_166bg3kY3NQeuDm3zbQmYab6RwJGcw53Nr): Nova Teoria da Gravidade dispensa Matéria Escura\n> Gravidade Emergente\n> Uma nova teoria da gravidade consegue explicar os curiosos movimentos das estrelas nas galáxias sem precisar apelar para a matéria escura.\n> Batizada de \"gravidade emergente\" por seu autor, a nova teoria prediz exatamente o mesmo desvio de movimentos que o modelo cosmológico padrão explica inserindo a elusiva e nunca detectada matéria escura.\n> O professor Erik Verlinde, da Universidade de Amsterdã, na Holanda, um especialista renomado em Teoria das Cordas, acaba de publicar um artigo no qual ele expande suas visões inovadoras sobre a natureza da gravidade, que ele começou a esboçar em um artigo publicado em 2010.\n> Segundo Verlinde, a gravidade não é uma força fundamental da natureza, mas um fenômeno emergente. Da mesma forma que a temperatura surge do movimento de partículas microscópicas, a gravidade emerge das mudanças de unidades fundamentais de informação, armazenados na própria estrutura do espaço-tempo.\n> Lei de Newton da informação\n> Em seu artigo de 2010, Verlinde mostrou como a famosa Segunda Lei de Newton - que descreve como as maçãs caem das árvores e os satélites artificiais permanecem em órbita - pode ser derivada desses blocos fundamentais microscópicos. Estendendo seu trabalho anterior, e incorporando melhorias publicadas por outros físicos desde então, Verlinde agora mostra como entender o comportamento das estrelas nas galáxias, que parecem girar rápido demais.\n> A velocidade das estrelas é tão grande que é necessário haver uma força gravitacional extra para explicar porque elas não são arremessadas para fora das galáxias - a matéria escura é o componente teórico que foi adicionado à teoria para responder por essa \"gravidade faltante\". Contudo, até agora, as supostas partículas de matéria escura nunca foram observadas, apesar de esforços e experimentos milionários para detectá-las.\n> \"Não há necessidade de matéria escura\"\n> De acordo com o professor Verlinde, não há necessidade de adicionar uma misteriosa partícula de matéria escura à teoria. Sua teoria da gravidade emergente prediz com precisão as velocidades com que as estrelas giram em torno do centro da Via Láctea, bem como o movimento das estrelas dentro de outras galáxias. \"Temos evidências de que esta nova visão da gravidade realmente concorda com as observações,\" defende ele. \"Em grandes escalas, ao que parece, a gravidade simplesmente não se comporta da maneira que a teoria de Einstein prevê\".\n> À primeira vista, a teoria de Verlinde tem características semelhantes a outras teorias modificadas da gravidade, como a MOND (Modified Newtonian Dynamics, ou Dinâmica Newtoniana Modificada). No entanto, onde a MOND ajusta a teoria para coincidir com as observações, a teoria de Verlinde começa a partir dos chamados primeiros princípios, sem qualquer necessidade de ajuste.\n> E seus cálculos batem com as observações mais recentes, publicadas no mês passado, e que também parecem dispensar a necessidade da matéria escura: https://web.archive.org/web/20170914201335/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=dados-dispensam-materia-escura-explicar-universo&id=010130161021\n> Princípio holográfico\n> Um dos ingredientes da teoria de Verlinde é uma adaptação do Princípio Holográfico, introduzido por seu professor Gerard Hooft (Nobel de Física de 1999, Universidade de Utrecht) e Leonard Susskind (Universidade de Stanford). De acordo com o Princípio Holográfico, toda a informação em todo o Universo pode ser descrita sobre uma esfera imaginária gigante ao seu redor.\n> O professor Verlinde afirma que essa ideia não está totalmente correta: parte da informação em nosso Universo está contida no próprio espaço. Essa informação extra é necessária para descrever aquele outro componente escuro do Universo: a Energia Escura, que é considerada responsável pela expansão acelerada do Universo - outra hipótese que está sob fogo cerrado.\n> Ao estudar os efeitos dessa informação adicional sobre a matéria ordinária, Verlinde chegou a uma conclusão impressionante: Enquanto a gravidade ordinária pode ser codificada usando a informação na esfera imaginária ao redor do Universo, o resultado da informação adicional no volume do espaço é uma força que bate perfeitamente com aquela hoje atribuída à matéria escura.\n> À beira de uma revolução científica\n> A gravidade está mesmo precisando urgentemente de novas abordagens como a de Verlinde, uma vez que ela não combina com a bem-sucedida física quântica. Ambas as teorias, as joias da coroa da Física, não podem ser verdadeiras ao mesmo tempo, com os problemas emergindo vigorosos em condições extremas: perto de buracos negros, ou durante o Big Bang.\n> \"Muitos físicos teóricos como eu estão trabalhando em uma revisão da teoria, e alguns grandes avanços vêm sendo feitos. Podemos estar à beira de uma nova revolução científica, que mudará radicalmente nossa visão sobre a própria natureza do espaço, do tempo e da gravidade,\" concluiu Erik Verlinde.\n> Artigos: https://gateway.pinata.cloud/ipfs/QmUeEvZR5vbFwmMEtDEuNuFZwQzchbYLzPYdmTyGdkqG7a\n> \n> Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=teoria-gravidade-emergente&id=010130161118\n\n#Sobre os efeitos da não-comutatividade na gravidade entrópica\n- https://ipfs.infura.io/ipfs/QmRqBcDL4fE5dF76gzeaYJXXTzA3vzCDJ7mLGwgLzteP4C\n\nNeste trabalho, analisamos a questão de possíveis correções quânticas no cenário entrópico da gravidade emergente. A geometria não-comutativa tem sido frequentemente usada para simular efeitos da gravidade quântica nas últimas décadas. Usamos aqui uma esfera fuzzy como uma aproximação clássica para uma superfície holográfica esférica e então analisamos se há, a princípio, uma chance de observarmos correções quânticas para a lei da gravitação de Newton. Nosso método leva em consideração o cálculo do espectro do operador de Dirac associado à esfera não comutativa e, utilizando técnicas de geometria espectral, nós obtemos a área da esfera fuzzy. Dada a área dessa superfície, deveria ser possível relacioná-la com a entropia do sistema e comparar esse resultado a outros obtidos utilizando diferentes técnicas. O maior resultado de nossa análise é que, sem ter completo conhecimento sobre a dinâmica quântica e sobre os graus de liberdade microscópicos do sistema, qualquer correção entrópica encontrada na escala de Planck será completamente mascarada por nossa ignorância sobre os processos de medida. Por outro lado, nos parece possível que as correções obtidas através das teorias de perturbação sejam confiáveis em escalas bem abaixo da escala de Planck.",
				"added": 1602994254
			},
			{
				"comment_id": 110,
				"body": "#Variação da constante de estrutura fina devido a um escalar cosmológico\n- https://ipfs.infura.io/ipfs/QmapgLCvF1r1wRFCiQgnE4iHJzFY3cWrznJt44rbMDnup4\n\nNeste trabalho, apresentamos a evolução e a consequente variação da constante de estrutura fina a devido a um escalar cosmológico, que no nosso caso se acopla ao campo eletromagnético. Para tanto, usamos um modelo cosmológico de quintessência para demonstrar a evolução cósmica de a através de um sistema dinâmico. Em seguida, comparamos a evolução encontrada com os limites observacionais atuais sobre a variação de a. Concluímos que é valioso considerar interações entre a energia escura e outros campos, pois podemos utilizar mais dados observacionais (limites sobre a variação de a) para vincular a natureza da energia escura.",
				"added": 1602996367
			},
			{
				"comment_id": 111,
				"body": "#Origem e evolução dos campos magnéticos cosmológicos\nhttps://ipfs.infura.io/ipfs/QmRb8X4oreLQ8r3f8bPcfU1Z3bgbMU7WB7bLo2mEurpoEG",
				"added": 1602997176
			},
			{
				"comment_id": 112,
				"body": "> [theablet](#comment_91_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn): Livros\n> \n> https://web.archive.org/web/20201013171612/http://www.todasasconfiguracoes.com/livros/\n> \n> \"Então você quer aprender física, pois bem. No começo de meu treinamento, cacei duramente os melhores livros de cada matéria para poder ter sucesso em minha empreitada, dedico este espaço a poupar este trabalho de quem pensa em começar essa jornada, listando o melhor material que conheço de cada área da física. Com o apoio de algum amigo matemático, logo amplio essa lista para os livros dessa disciplina.\"\n\n#[Mecânica Clássica](https://en.wikipedia.org/wiki/Classical_mechanics):\n- [Curso de Física Básica vol. 1, Moysés Nussenzveig](https://ipfs.io/ipfs/QmbXY76ynjwDESmeZkfiHap5vJ661gMCWVRTRPk1HSrzXL)\n- [The Feynman Lectures on Physics, vol 1, Richard Feynman](https://ipfs.io/ipfs/QmXZh38uSS8yhMkNkcQF1Tyo5ymosyQEX7h6KzBNYRR8ZU)\n- [Mecânica Analítica, Nivaldo Lemos](https://ipfs.infura.io/ipfs/QmcHK3sHTvwN2EBPxwFFwRCGU6cxyXA6TvTcohdcRfVtLF)\n- [Mathematical Methods of Classical Mechanics, V. I. Arnold](https://ipfs.io/ipfs/QmeU5tccSTk7eyG6e2EJTE38E54kBmioE2QZwDBhSX2W8t)\n\n#[Termodinâmica](https://en.wikipedia.org/wiki/Thermodynamics):\n- [Thermodynamics and an Introduction to Themostatistics, Herbert Callen](https://ipfs.infura.io/ipfs/QmQBFUdgjkqxvNDS8a3XDgEmTCoqRsHK9bFnDkNhipXc2x)\n\n#[Eletromagnetismo](https://en.wikipedia.org/wiki/Electromagnetism):\n- [Introduction to electrodynamics, David Griffiths](https://ipfs.io/ipfs/QmYiu8txMsrFZprrDSYapayUx18Zbu4VhcnUF78MpzRdrR)\n- [Classical Electrodynamics, J. D. Jackson](https://siasky.net/AADBl68zeaGJPUCI8DL7ZqV3UCBCdycIYHi9sJFdRmUiFg). Algumas soluções de seus exercícios podem ser encontradas [aqui](https://web.archive.org/web/20150912004622/http://samizdat.mines.edu/jackson/main.pdf).\n\n#[Mecânica Quântica](https://en.wikipedia.org/wiki/Quantum_mechanics):\n- [Introduction to Quantum Mechanics, David Griffiths](https://ipfs.io/ipfs/QmfVXWi6PEn3YTrqEkxmFVFbxZTwARzgT4PMhJAaKr5jk1)\n- [Modern Quantum Mechanics, Sakurai](https://ipfs.io/ipfs/Qmf1YPrhQpCDpyAtzCAeVJ2P4CfBHQnqfvXg58hRqQm8to)\n- [The Feynman Lectures on Physics, vol III, Richard Feynman](https://ipfs.io/ipfs/QmURwokkwbpYZhPodJVifECCGjqA4vipn7acUYDnQNHxek)\n\n#[Física Estatística](https://en.wikipedia.org/wiki/Statistical_physics):\n- [Introdução à física estatística, Sílvio Salinas](https://ipfs.io/ipfs/QmVEHTPt8aNT8LHX9W8Ao54wovyLVtE9ZYTA5FuhQjDtSP)\n- [Fundamentals of statistical and thermal physics, F. Reif](https://siasky.net/AADO3aGFaY3sgyI_WSANpaBE0HR3WDZPU65cQ4_XnJNHoA)\n\n#[Física-Matemática](https://en.wikipedia.org/wiki/Mathematical_physics):\n- [Curso de Física-Matemática, João Carlos Barata](https://web.archive.org/web/*/http://denebola.if.usp.br/~jbarata/Notas_de_aula/capitulos.html)",
				"added": 1603160269
			},
			{
				"comment_id": 113,
				"body": "#Monopolos magnéticos existem?\n- https://ipfs.infura.io/ipfs/QmWTxoaLxppxdSuWw5CtdDmL2jcr732p61vd9Hn5BHA7KB\n\nEste trabalho descreve como é abordada na literatura científica e na eletrodinâmica clássica a questão da existência de [monopolos magnéticos](https://en.wikipedia.org/wiki/Magnetic_monopole) e se existissem quais seriam suas implicações.",
				"added": 1603165617
			},
			{
				"comment_id": 114,
				"body": "#Monopolos magnéticos Z2 em teorias de Yang-Mills-Higgs com simetria de gauge SU(n)\n- https://ipfs.infura.io/ipfs/Qma3rQkPjabTtRuWx6aHYxLK2XsBMTm3k3UZKUBhikxPhQ\n\nMonopolos magnéticos têm sido objetos de grande interesse nos últimos anos, principalmente por serem previstos em algumas teorias de grande unificação e por, possivelmente, serem relevantes no fenômeno do confinamento em QCD. Consideramos uma teoria de Yang-Mills-Higgs com simetria de gauge SU(n) quebrada espontaneamente em SO(n) que apresenta condições topológicas necessárias para a existência de monopolos Z2. Construímos as formas assintóticas desses monopolos, considerando duas quebras distintas do SU(n) em SO(n), e verificamos que os monopolos fundamentais estão associados aos pesos da representação definidora da álgebra so(n)v.",
				"added": 1603165909
			},
			{
				"comment_id": 115,
				"body": "#Discretização da energia no universo primordial\n- https://ipfs.infura.io/ipfs/QmdxtZEzAswGS8b7xPWFcYtd68Msj7GMTp5hbDkLwyQyjj\n\nA cosmologia quântica na gravidade teleparalela é modelo construído sob a régia do Teleparalelismo equivalente à Relatividade Geral (TERG) e da aplicação do processo de quantização de Weyl. O TERG é uma teoria alternativa à descrição do campo gravitacional baseado em termos de um campo de tétradas. Ele permite escrever adequadamente as definições de energia-momento do campo gravitacional. Já a quantização apresentada por Weyl tem um formalismo claro e sem ambiguidades para o tratamento da correspondência entre operadores clássicos e quânticos. A cosmologia de Wheeler-DeWitt, formada pelo formalismo hamiltoniano da Relatividade Geral (RG), tem vários problemas que são citados neste trabalho. Tomando a TERG, aplicando na métrica de Friedman-Lemaître-Robertson-Walker do Modelo Cosmológico Padrão (MCP) a cosmologia quântica é revisitada mas com aplicação em solução de vácuo e em um universo pequeno, resultando em relação de incerteza para o parâmetro de Hubble e induzindo um mecanismo de inflação.",
				"added": 1603166530
			},
			{
				"comment_id": 116,
				"body": "#Cosmologia quântica na gravidade teleparalela\n- https://ipfs.infura.io/ipfs/QmSc6quEP1E1kqLy5Rb8gZerv5rWU16SAK9EXKhqutk5DJ\n\nA cosmologia quântica na gravidade teleparalela é uma teoria construída à partir do Teleparalelismo equivalente à Relatividade Geral (TERG) e da quantização de Weyl. O TERG é uma descrição alternativa à proposta de Einstein. Ela demonstra que o campo gravitacional em termos de campo de tétradas, permitindo a obtenção, dentre outras soluções, da densidade de energia gravitacional. Já o procedimento de Weyl mostra um formalismo mais sólido para tratamento da correspondência entre operadores clássicos e quânticos. Através de um formalismo hamiltoniano da Relatividade Geral (RG), Wheeler e DeWitt construíram uma teoria quântica para a cosmologia mas que tem vários problemas, alguns deles relatados nesse trabalho. Partindo das ferramentas da TERG, do Modelo Cosmológico Padrão (MCP) e da quantização de Weyl, é obtido a equação de cosmologia quântica a partir da energia gravitacional e contrastada com a de Wheeler-DeWitt, a equação da cosmologia quântica teleparalela completa e sua equivalente em primeira aproximação. A discussão final é um panorama do que se tem em gravitação, os problemas e as possíveis soluções com a cosmologia quântica na gravidade teleparalela. Palavras chaves: Relatividade Geral. Cosmologia. Teleparalelismo Equivalente à Relatividade Geral. Gravidade teleparalela. Cosmologia quântica.",
				"added": 1603166738
			},
			{
				"comment_id": 117,
				"body": "#[Teoria M](https://en.wikipedia.org/wiki/M-theory): uma possibilidade de unificação das leis da Física\nhttps://ipfs.infura.io/ipfs/QmT5E2ksgVwg1SPMKvKH5cF8HaWJ5Q3WsKnD8HP8ikhCda",
				"added": 1603167269
			},
			{
				"comment_id": 121,
				"body": "#Diagramas de Carter-Penrose em Relatividade Geral: buracos negros e outros exemplos explícitos\n- https://ipfs.infura.io/ipfs/QmejYi8fsHqZqQKgnyHFVcn3zsQaRj6tWPyzTEA5F4KUUL\n\nNo presente artigo é introduzido, de forma didática e simplificada, evitando-se grandes perdas de conteúdo, um dos formalismos mais utilizados de representação geométrica de horizontes de eventos e singularidades, conhecido como ‘diagrama de Carter-Penrose’. São diagramas que simplificam e agilizam a percepção do espaço-tempo ao redor e no interior de horizontes de evento. Para chegar à descrição físico-geométrica desses diagramas, inicialmente se explicará o formalismo de remoção de singularidades de coordenada em horizontes de eventos para uma determinada métrica e, em seguida, as coordenadas de Finkelstein e de Kruskal-Szekeres. Exemplos de diagramas de Penrose para alguns tipos de buracos negros serão apresentados (Schwarzschild, Reissner-Nordström e Kerr-Newman), além das possibilidades referentes a buracos brancos e buracos de minhoca.",
				"added": 1603318260
			},
			{
				"comment_id": 122,
				"body": "#Processos semi-clássicos em buracos negros e buracos de minhoca quase-extremos\n- https://ipfs.infura.io/ipfs/Qmf8AdfCpWpZz8jgzcuChpUWdGCXJHiXcp2YK7xrKTNa1P\n\nNesta dissertação são explorados efeitos clássicos e semi-clássicos em espaços-tempos quase-extremos. Na classe de geometrias tratadas aqui, uma região estática entre dois horizontes é considerada, de forma que estes horizontes estão muito próximos e as suas gravidades superficiais são muito pequenas. Este limite quase-extremo surge em vários contextos de interesse, envolvendo buracos negros assintoticamente de Sitter, buracos de minhoca e buracos negros em universos com seção espacial compacta. No trabalho desenvolvido, buracos de minhoca ligando duas regiões com horizontes cosmológicos são estudados em detalhes. Uma vez caracterizada, algumas das propriedades clássicas destas estruturas e efeitos semi-clássicos são explorados. O tratamento quântico proposto leva naturalmente a uma caracterização termodinâmica associada aos horizontes atrapantes presentes na geometria. Consideramos especificamente propriedades térmicas associadas a um campo escalar nos espaços-tempos de interesse. Uma revisão do formalismo de Hayward é feito, com a sua adaptação para espaços-tempos importantes. Buracos de minhoca no regime quase-extremo são discutidos em detalhes.",
				"added": 1603318610
			},
			{
				"comment_id": 129,
				"body": "#Colóquio: O Prêmio Nobel de Física de 2020 e a história da busca pelos Buracos Negros Supermassivos\n- https://invidious.snopyta.org/R2BIdkiwY8Y\n- https://siasky.net/AAD8_6DUOLF3oLAIx9v6a8ktsaX_WlLfbx7NbCMM3N8leQ\n\n[Thaisa Storchi Bergmann](http://www.if.ufrgs.br/~thaisa/) (IF-UFRGS)",
				"added": 1603419811
			},
			{
				"comment_id": 148,
				"body": "#Suspensão eletromagnética: o futuro da suspensão?\nEssa suspensão eletromagnética apresentada em 2005 deixava o carro totalmente estável. Por que não deu certo?\n- https://yewtu.be/F4tNs7b7Cz8\n- http://ipfs.io/ipfs/QmXfVStQZC7qT5evTZvGvhzXBXyTJztNihNsuPbM2vUQ2S",
				"added": 1603911451
			}
		],
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": [
			{
				"comment_id": 39,
				"body": "#Lista de problemas não resolvidos na medicina\n- https://en.wikipedia.org/wiki/List_of_unsolved_problems_in_medicine\n- https://everipedia.org/wiki/lang_en/List_of_unsolved_problems_in_medicine\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/List_of_unsolved_problems_in_medicine.html",
				"added": 1602169654
			},
			{
				"comment_id": 40,
				"body": "#Lista de problemas não resolvidos em biologia\n- https://en.wikipedia.org/wiki/List_of_unsolved_problems_in_biology\n- https://everipedia.org/wiki/lang_en/List_of_unsolved_problems_in_biology\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/List_of_unsolved_problems_in_biology.html",
				"added": 1602169732
			},
			{
				"comment_id": 44,
				"body": "#Lista de problemas não resolvidos em neurociência\n- https://en.wikipedia.org/wiki/List_of_unsolved_problems_in_neuroscience\n- https://everipedia.org/wiki/lang_en/List_of_unsolved_problems_in_neuroscience\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/List_of_unsolved_problems_in_neuroscience.html",
				"added": 1602170366
			},
			{
				"comment_id": 136,
				"body": "#Sintomas de depressão: 11 sinais de que esse mal está dominando você\n- https://web.archive.org/web/20191214/https://hypescience.com/sintomas-de-depressao/\n- http://archivecaslytosk.onion/l0u8f\n\n#5 dicas de como curar depressão\n- https://web.archive.org/web/20170526/https://hypescience.com/cura-depressao-curar-depressao/\n- http://archivecaslytosk.onion/zy6hg\n\n#Como ajudar um amigo com depressão?\n- https://web.archive.org/web/20200526162431/https://hypescience.com/como-ajudar-um-amigo-com-depressao/\n- http://archivecaslytosk.onion/24lE2",
				"added": 1603637906
			}
		],
		"2_1JWzeTyK26d4RAYsyHethugMvfKfQJQSCt": [
			{
				"comment_id": 46,
				"body": "#Lista de problemas não resolvidos em química\n- https://en.wikipedia.org/wiki/List_of_unsolved_problems_in_chemistry\n- https://everipedia.org/wiki/lang_en/List_of_unsolved_problems_in_chemistry\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/List_of_unsolved_problems_in_chemistry.html",
				"added": 1602170543
			}
		],
		"1_142x9Nc3cD5zBCsNd2i8vNLTUGHipwCNo4": [
			{
				"comment_id": 48,
				"body": "# Afinal, do que se trata a Astronomia? - Parte II \n\n Como foi visto no texto anterior, a Astronomia se vale das leis da Física para descrever os comportamentos dos sistemas celestes. Na segunda parte dessa sequência de textos, visarei apresentar uma concepção mais geral acerca do que seja a Astronomia e compará-la com outras ciências, que são a Física, Astrofísica e a Cosmologia. Por fim, tentarei dar alguns exemplos de estudos feitos nessas áreas e de um exemplo discutível a respeito de uma lei formulada para se descrever um comportamento associado aos astros, que se trata da Lei de Hubble, que descreve como ocorre a expansão do universo.\n\nA Física é a ciência mais fundamental de todas as ciências naturais pois é a ciência que aborda a natureza do modo mais geral possível. Há algumas escolas de pensamento que defendem que tudo se resume às “leis físicas” e às entidades que tais leis se reportam, mas isso não será discutido aqui. A questão é que a Física estuda o movimento e a interação que se dão com todos os sistemas existentes no universo, desde partículas elementares como quarks e elétrons, até o universo como um todo (sistema total). Tais sistemas possuem uma série de propriedades, além de se comportarem de formas bastante específicas e preditivamente regulares. Os movimentos e as interações também apresentam propriedades. Por exemplo, ao se equacionar (expressar alguma relação entre elementos com o sinal de igualdade) um conjunto de grandezas, está se restringindo os valores que cada grandeza pode apresentar em função da outra. Como grandezas são propriedades físicas quantificadas, como massa, carga, spin, força, torque, energia, trabalho e outras, isso estará restringindo as possibilidades de um sistema se comportar, pois como são propriedades dos próprios sistemas e do movimento e das interações e os sistemas interagem e se movem, ao longo do espaço-tempo, isso estará descrevendo simbolicamente, como esses sistemas se comportam. O exemplo é da segunda lei de Newton, cuja expressão matemática corresponde a uma igualdade entre o somatório vetorial das forças e do produto da massa pela aceleração (ΣF=ma). Em palavras, essa expressão matemática diz que quanto maior for o valor da força resultante correspondentes às interações atuantes num sistema, maior será a aceleração exibida por ele. Como é uma relação vetorial, decorre-se (devido a considerações geométricas) que a força e a aceleração terão a mesma direção e o mesmo sentido. Fisicamente isso corresponde a vários casos observados no cotidiano, como empurrar uma cadeira inicialmente em repouso em relação ao seu próprio referencial. Pode-se exprimir também de tal relação, a descrição do que ocorre ao se considerar um aumento da massa desse sistema ou sistemas com massas maiores, para se tentar acelerá-lo, que como mostra a relação de igualdade e proporcionalidade, precisa haver um maior valor da intensidade das interações resultantes. É preciso esclarecer que a força resultante não é uma propriedade de uma interação fisicamente real, mas meramente um artifício matemático que corresponde a um somatório das intensidades das interações mecânicas fisicamente reais (como por exemplo, peso, atrito, interação elétrica) no limite de intensidades não muito grandes. Seu valor coincide com o valor desse somatório vetorial, de modo bem aproximado. A força resultante é definida como sendo uma força que, atuando sozinha em um sistema ao invés das interações em que um sistema está submetido, ela produziria o mesmo movimento translacional (com a mesma aceleração), como se houvesse apenas uma interação real, que correspondesse a uma compensação líquida de todas as interações físicas no sistema. Isso advém do princípio da superposição linear que é a essência da segunda lei de Newton. Um sistema pode não exibir aceleração nenhuma, mesmo que hajam interações fisicamente reais atuando neles, pois tais interações podem se compensar de modo a se anularem numericamente. A partir dessa relação, pode-se esboçar valores num gráfico, colocando a força em função da aceleração, considerando uma massa m constante. O gráfico será representado por uma reta, em que a massa será o coeficiente angular dessa reta. Os gráficos também são uma forma de se visualizar o que acontece nas ocorrências físicas em que se tem a variação de uma grandeza relacionada com a variação de outra. As grandezas também são associadas a unidades de medida, pois pode-se mensurar tais valores, como por exemplo, medir a massa de um sistema em uma balança, cuja unidade no sistema internacional é kg.\n\nEm todos os modelos descritíveis da realidade física, existirão equações que mostrarão vários casos de simetrias comportamentais, relacionando vários tipos de grandezas, indo desde o comportamento de partículas elementares, passando por átomos, moléculas e redes cristalinas, chegando em estruturas macroscópicas como pessoas, engrenagens, molas, veículos, o próprio ar e também, considerando a própria Terra, além das demais estruturas macroscópicas, como estrelas, planetas e até, o próprio universo. A Física contemporânea trata de casos que vão mais além disso, centrando-se em entidades físicas que não podem ser detectadas diretamente e em ocorrências que fogem completamente das noções do senso comum, sendo extremamente contra-intuitivas, como por exemplo, a energia escura e a expansão do universo, o comportamento dual das partículas, a curvatura do espaço-tempo e vários outros casos. Como a Física também aborda o movimento e a interação que ocorrem com os astros, descrevendo as propriedades por meio de diversas relações físicas, fazendo-se uso de requintados e avançados recursos matemáticos, a Astronomia é uma ciência que é visivelmente ligada a Física, como já exposto no texto anterior. Mas a Astronomia ainda é uma ciência a parte. Realizar observações a respeito do movimento dos astros, descobrir novos planetas, bem como montar um catálogo de sistemas celestes, convenientemente formulado a partir de suas características posicionais e de movimento, são estudos típicos da Astronomia. Já o que corresponde a investigação de como os astros podem ser vistos aqui na Terra, como se movem em órbitas elípticas e como se movem em órbita do outro, são estudos que pertencem à Física. Para se ter uma ideia, os astros emitem radiação eletromagnética e a radiação eletromagnética só é detectada aqui na Terra pois interage com os observadores. As ondas eletromagnéticas tratam-se de campos elétricos e magnéticos auto-propelentes  e os campos magnéticos e elétricos são estudados pela Física, em Eletromagnetismo. Os planetas orbitam em torno do Sol e suas órbitas podem ser descritas em termos da força gravitacional associada a interação desses astros e a interação gravitacional é estudada em Física na parte de Mecânica, mas a gravitação também pode ser entendida na parte de Relatividade Geral. Esses exemplos devem ser capazes de deixar claro a distinção entre Física e a Astronomia. A Física é dividida em quatro áreas principais, que são: Mecânica Clássica, Eletromagnetismo, Termodinâmica-Estatística e Mecânica Quântica (entendendo aqui que Relatividade Geral e Restrita são casos especiais da Mecânica Clássica).\n\nAlém das áreas já consideradas, existem duas outras áreas que se ocupam do estudo de ocorrências e estruturas que se situam além da atmosfera terrestre. A Astrofísica pode ser entendida como uma área específica da Física, que estuda a natureza, as propriedades, a evolução e a composição dos astros. Vale-se das quatro áreas da Física supracitadas para descrever os aspectos físicos dos astros. Um dos tópicos estudados pela Astrofísica é a evolução estelar, bem como o processo de formação das estrelas e como se dá a geração de radiação que é emitida no espaço, nos processos que se dão no núcleo estelar. Para isso, vale-se de estudos realizados nas áreas da Física e então, aplica-se a casos específicos. O exemplo é o estudo da estatística quântica, em Física, que pode ser aplicado para se descrever o comportamento das estrelas de nêutrons e das anãs brancas, onde existem um gás degenerado de férmions. O próprio processo de colapso das estrelas, bem como a formação de buracos negros, também é objeto de estudo da Astrofísica. A Cosmologia também é uma área específica da Física, que se trata do estudo da evolução a da estrutura do universo como um todo. Essa área não está interessada em estudar o comportamento dos astros isoladamente, mas considera distâncias intergaláticas (e não mais interplanetárias e interestelares) e até, entre aglomerados e superaglomerados de galáxias, que são da ordem de milhões e bilhões de anos luz. São nessas distâncias que os efeitos da expansão se tornam relevantes e pode-se descrever o universo como um todo através de vários modelos cosmológicos, como por exemplo, as equações de Friedmann e a Lei de Hubble. A lei de Hubble é uma lei que descreve a expansão do universo, que pode ser expressa matematicamente relacionando a taxa de expansão (que não pode ser confundida com velocidade) dos sistemas em questão e da distância que eles estão separados, tendo como referência o observador. A constante de Hubble aparece como uma constante de proporcionalidade nessa equação e corresponde ao inverso do tempo de existência do universo. Esse tempo de existência do universo é considerado como 13,8 bilhões de anos, a partir de mensurações mais recentes da constante de Hubble. A própria evolução do universo é descrita pela teoria do big bang, que descreve como o universo evoluiu a partir de um volume tendendo a zero. É exatamente nessa situação que existem demarcações entre a Física e outras áreas do conhecimento, já que nem a Cosmologia, que se reduz a Física (pois até mesmo depois do momento zero, existem considerações quânticas e relativísticas), provê uma explicação e nem uma descrição a respeito da origem do universo.\n\nFinalmente, quero apresentar uma concepção da Astronomia que a trata como uma ciência mais geral. A Astronomia pode ser vista como uma ciência em que a Astrofísica e a Cosmologia são ramos e dessa forma, a Astronomia se ocuparia do estudo de tudo que esteja fora da atmosfera e superfície terrestre. Nessa concepção, abordaria também, além do movimento e a posição dos astros, as suas propriedades físicas, além da composição, bem como a estrutura e a evolução do universo como um todo. No entanto, como discutido anteriormente, as propriedades dos astros, os seus comportamentos, bem como a própria evolução do universo, são descritas por sub-áreas da Mecânica Clássica, Termodinâmica, Eletromagnetismo e Mecânica Quântica, que são áreas da Física. Portanto, apesar da Astrofísica e da Cosmologia estarem de certa forma relacionadas com a Astronomia, ainda não fazem parte dela. Física e Astronomia são ciências naturais distintas, assim como Química e a Biologia, que também possuem áreas específicas, como a Astroquímica e a Astrobiologia. No entanto, todas essas áreas físicas tratam de sistemas em nível de complexidade baixo (mesmo que possam descrever o comportamento de milhões de átomos num gás, por exemplo), em que não se considera o nível biológico de funcionamento (o funcionamento do sistema nervoso humano, por exemplo) e nem sequer os níveis políticos, econômicos e sociais, que são imensamente mais complexos. Não existe uma lei física por exemplo, que descreva como se dá o processo da formação da consciência ou que seja capaz de prever mudanças sociais e culturais da sociedade.\n\n- Fonte: https://archive.is/Eo186",
				"added": 1602170910
			}
		],
		"1_1FvmEeafb1mjKoeZajJooyEyVZ9A5rPjPU": [
			{
				"comment_id": 66,
				"body": "#O melhor de [Bach](https://en.wikipedia.org/wiki/Johann_Sebastian_Bach)\n- https://invidious.snopyta.org/6JQm5aSjX6g\n- https://siasky.net/AAADTye9539_BILqsc4dcDuTKRteoD-UCIqfwBAlppOMKw\n- TRACKLIST: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn_12\n\n#O melhor de [Mozart](https://pt.wikipedia.org/wiki/Wolfgang_Amadeus_Mozart)\n- https://invidious.snopyta.org/Rb0UmrCXxVA\n- https://siasky.net/AACCYoooMsQlL_EIi2zSZPooRAex1oocEPyqvvIr6w_9AA\n- TRACKLIST: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn_11\n\n#O melhor de [Beethoven](https://en.wikipedia.org/wiki/Ludwig_van_Beethoven)\n- https://invidious.snopyta.org/W-fFHeTX70Q\n- https://siasky.net/AADhMHjOHy7_JHmYXJLTnqBwsU9HtodstZqn5vifH7YBFA\n- TRACKLIST: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn_10\n\n#O melhor de [Wagner](https://en.wikipedia.org/wiki/Richard_Wagner)\n- https://invidious.snopyta.org/4i0TnNI6U-w\n- https://siasky.net/AABUYvbhUcUzrgPaFOf5S02kJXJb4jplIwEHz8DbcmE4sw\n- TRACKLIST: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn_9\n\n#O melhor de [Schubert](https://en.wikipedia.org/wiki/Franz_Schubert)\n- https://invidious.snopyta.org/iiChxN0T2kA\n- https://siasky.net/AADJmJa_T22W1tF3Ui0jKr0sdVUAYnHIlDMfP3wo9t8-Fw\n- TRACKLIST: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn_8\n\n#O melhor de [Schumann](https://en.wikipedia.org/wiki/Robert_Schumann)\n- https://invidious.snopyta.org/QqEWbOzL_GQ\n- https://siasky.net/AACRVt1VASGONENyLWHWvaVA3cvlP4ajmdaUvpwCVoGFug\n- TRACKLIST: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn_7\n\n#O melhor de [Chopin](https://en.wikipedia.org/wiki/Fr%C3%A9d%C3%A9ric_Chopin)\n- https://invidious.snopyta.org/wygy721nzRc\n- https://siasky.net/AABN3NYQpSNrY83W654q2cxYqZc1r1HaBqDwj7SpBuj7rA\n- TRACKLIST: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn_6\n\n#O melhor de [Liszt](https://en.wikipedia.org/wiki/Franz_Liszt)\n- https://invidious.snopyta.org/salrwSVWpC4\n- https://siasky.net/AAAanYZQBpgb0wUkizMyzYE1RiKx0zKMfuXth-wIfH_Jpw\n- TRACKLIST: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn_5\n\n#O melhor de [Brahms](https://en.wikipedia.org/wiki/Johannes_Brahms)\n- https://invidious.snopyta.org/zKrxesI3ziE\n- https://siasky.net/AABBHG0wU_7qGHRQmQjKL0KvOZSKmYrEyCDu0j1p7U-Nsw\n- TRACKLIST: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn_4\n\n#O melhor de [Verdi](https://en.wikipedia.org/wiki/Giuseppe_Verdi)\n- https://invidious.snopyta.org/P6sz5b2w9Zc\n- https://siasky.net/AACPDt4xjozDMx4h9tIY0vp8AZsSQUWSIXhVi7qdHkiL2w\n- TRACKLIST: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn_3",
				"added": 1602212734
			},
			{
				"comment_id": 67,
				"body": "#O melhor da [música clássica](https://pt.wikipedia.org/wiki/M%C3%BAsica_cl%C3%A1ssica)\nhttps://invidious.snopyta.org/playlist?list=PLc87N-d3x2Cp6r9xS3CO3SRjzon8qWiOJ",
				"added": 1602212972
			},
			{
				"comment_id": 82,
				"body": "#Tá Escrito - Grupo Revelação\n- https://ipfs.io/ipfs/Qme3W92bf1zcNDC2vLvucxPctTUs9dkK8DeKQuVMDUUdwF\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn_16",
				"added": 1602464351
			},
			{
				"comment_id": 83,
				"body": "#É Só Acreditar - Jamily\n- https://ipfs.io/ipfs/QmSYHqTC9E4x6wuQZ9FsjeLnhAdxpEme8SMeqC1ETdA1Py\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn_17",
				"added": 1602464580
			},
			{
				"comment_id": 101,
				"body": "#1 Hour Beautiful Piano & Instrument - Sad [Inuyasha](https://en.wikipedia.org/wiki/Inuyasha) OST\n- https://invidious.snopyta.org/RL977y-0Dyk\n- https://siasky.net/AACW6Qe0JqXr1glu0LROR-VOLll_rpkN-qFH4xbs0zH2Hw\n\nTRACKLIST: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn_18",
				"added": 1602897876
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 95,
				"body": "#Harry Potter – A Coleção Completa – J. K. Rowling\n- https://ipfs.infura.io/ipfs/QmZrLwTLGFtgebvZDSVmWYWg2Dw2teACaMShK1tL7vieAi\n\nTodos os sete e-books da premiadíssima série [Harry Potter](https://pt.wikipedia.org/wiki/Harry_Potter), fenômeno de vendas em todo o mundo, disponíveis em um único download com maravilhosas capas ilustradas por Olly Moss. Desfrute das histórias que cativaram a imaginação de milhões ao redor do mundo.",
				"added": 1602735103
			}
		],
		"6_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn": [],
		"1_1MSKqEXc23pTAEEvmwZS4qdDTuT8iGBL46": [
			{
				"comment_id": 137,
				"body": "Será um site estático?",
				"added": 1603639592
			},
			{
				"comment_id": 138,
				"body": "> [cellnova1](#comment_2_1MSKqEXc23pTAEEvmwZS4qdDTuT8iGBL46): sim, o Abismo não irá mais ser modificado\n\nOk",
				"added": 1603639809
			}
		],
		"1_17ZpHZGw3D1VZQN14QJFgK2zW41bQzAQ5R": [
			{
				"comment_id": 140,
				"body": "#O aplicativo para se conectar à rede Yggdrasil no Android\nhttps://github.com/yggdrasil-network/yggdrasil-android.git",
				"added": 1603722846
			}
		]
	},
	"comment_vote": {
		"22_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn": 1,
		"127_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn": 1
	}
}