{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1608089850,
			"title": "Wu Hsin",
			"body": "“If man spent as much\n\nTime and energy\n\nDemolishing his prison\n\nAs was spent in building it,\n\nAll would be free.”\n\nMan wanders aimlessly, blindly, building his prison and calling it freedom. What will it take for man to actually become free? Will it not take pure Awareness of the fact? The fact of what we are? The fact that we are imprisoned.\n\nWe are shackled to beliefs, toxic world-views and ideologies. To images, to conditioned thought patterns. No one can free us of these shackles. No one can shake us awake here. Just in the trying to do so reveals ones ignorance. Pointing to the key is all one can do to help another.\n\nThe one who attempts to shake another awake is drained, is dead. You can see it in their face. It is sunken in, drawn out, pale, drained. They forgot what it has taken for them to see.\n\nPoint to the key, which lies inside the prisoner. Lead the horse to water. You cannot force its head into the water hole…it will drink when it is ready. Shouting at the tree to grow faster does nothing but hurt the one who shouts. The tree will grow at its own pace.\n\nThe All flows through us in each part of our life, if one allows it and does not attempt to shut it out. Nature moves All to Be – to Being. One simply must remove what is not natural to come back to What Is. There is no achieving, no gaining, no adding, no “self-help.” There is only a coming back to What Is. Everything that is not What Is is simply an abstraction, a fiction.\n\nHuman beings suffer, for they have blinded themselves. Humanity is in the center of a dark tunnel with no way out but through. If we spent as much time uncovering our eyes as we do covering them, All would be free. All would be free, because All is free, naturally.\n\nRemoving what does not belong leads one to What Is. There is no trying to Be. There is no effort to Be. There is simply Being, and non-Being. Remove what constitutes the “non” in “non-Being” and see what is left.\n\nThe energy we put into building and maintaining walls we have placed between us and What Is is the energy we must spend tearing these walls down. It is a simple redirection of energy. Everything seems to change in the process of dissolution, yet this change is merely an illusion. What Is was there all along, behind the wall of fear and beliefs. We are always looking in the right direction but are blinded by prison walls, self-made.\n\nOne cannot throw away the key. One cannot lose the key. One cannot throw away or lose something which they are. It may appear as if one could discard oneself for the sake of beliefs, possessions, attachments, and all the rest of it, but this appearance is yet another trick of physicality, of this reality. How can you lose something which is eternally present, everywhere and always? How can you throw away the unthrowable? The answer is simple: you cannot.\n\nWe are the prison and the key. Who knows this prison made by your own hand better than you? For every prison cell there is forged a key. Clear the dirt from your eyes and behold. This is the light we have been painstakingly seeking. The cessation of all seeking is when we finally see.",
			"added": 1608089849
		}
	],
	"topic_vote": {
		"1608089850_1HHtTxCDaPLDHA6FDtr4vSpSB9FVHkFtrR": 1
	},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}