{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1
	},
	"next_comment_id": 17,
	"comment": {
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "#O BLOQUEIO: A GUERRA CONTRA CUBA\n- https://swarm-gateways.net/bzz:/3efe210dcb66a174c30df8f484d8ae3e62a7bbef60d01f487c2137a1fd494a55/O+BLOQUEIO_+A+GUERRA+CONTRA+CUBA-uFuWvC1LYEw.mp4\n\nDocumentário que detalha historicamente os impactos do Bloqueio Econômico dos EUA contra Cuba, bem como outras questões relacionadas ao país, como a emigração, os problemas advindos do Período Especial após o fim da URSS, entre outros.",
				"added": 1588295520
			}
		],
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 2,
				"body": "#Curso básico de Marxismo-Leninismo-Maoismo — Partido Comunista da Índia (Maoista)\n- https://gateway.pinata.cloud/ipfs/QmYkucaBytaBY3Qa1RyfwzkW7RWBRkTdosKFFTbKuQhdYu\n\nA tradução do curso para língua portuguesa, é fruto de um trabalho e esforço coletivo de companheiras e companheiros de luta que compõem o Núcleo de Traduções do Povo. Um material com uma riqueza teórica como esse deve ser espalhado aos quatro cantos do mundo, nas mais variadas línguas, para contribuir no desenvolvimento ideológico daqueles que lutam dia-a-dia pela transformação do mundo e pela libertação das mais amplas massas trabalhadoras sob direção do proletariado. O presente material foi feito pelo Partido Comunista da Índia – Marxista-leninista-maoista, que está dirigindo a guerra popular em seu país, sob o guia da ideologia do proletariado: o marxismo-leninismo-maoismo. E conforme o debate e a luta de linhas se acirra no Movimento Comunista Internacional pela completa e total assimilação do maoismo como terceira e superior etapa do marxismo, materiais como esses servem de ferramentas para compreensão das mais variadas questões que envolvem a ideologia do proletariado. Em breve outras edições do material serão publicadas, pois, mesmo com a tradução e revisão sempre sobram alguns erros que vão ser corrigidos e também por acreditarmos que dá para incluir mais conteúdo para ajudar a completar o material aqui exposto. Por fim, nós do Núcleo de Traduções do Povo, esperamos que esse material seja espalhado e difundido, que sejam feitos estudos e debates sobre o mesmo e que a leitura e o conteúdo assimilado não sirva apenas como um “conteúdo adicional” e sim como uma ferramenta para impulsionar a atuação na prática. Afinal como dizia Karl Marx: “Os filósofos limitaram–se a interpretar o mundo de diversas maneiras; o que importa é modificá-lo”.",
				"added": 1588295611
			},
			{
				"comment_id": 3,
				"body": "#As Revoluções Africanas: Angola, Moçambique e Etiópia\n\nPaulo Fagundes Visentini\n\n- https://gateway.pinata.cloud/ipfs/QmRdXAaD7Hc1J7F8y5FQWrTrAYkJ6QohzQPUYFCJKB433E\n\nDiversas revoluções ocorreram nos anos 1970 no Terceiro Mundo. A descolonização tardia dos territórios portugueses no continente africano permitiu que movimentos de libertação abrissem caminho para revoluções nacionais democráticas e até socializantes, de forte impacto internacional. A esses eventos somou-se a derrubada do milenar império etíope, o que ocasionou a implantação de um regime socialista que provocou profundas mudanças sociais naquele país. Diversas outras ex-colônias também viveram experiências semelhantes no mesmo período.\nEste livro analisa as revoluções africanas mais marcantes dessa época – angolana, moçambicana e etíope –, que, do ponto de vista histórico, fazem parte de uma conjuntura única e possuem características políticas comuns, e examina as árduas lutas decorrentes desses processos revolucionários, os quais tiveram de enfrentar poderosas forças conservadoras, nacionais e estrangeiras, para se manter.",
				"added": 1588295677
			},
			{
				"comment_id": 4,
				"body": "#A Revolução Vietnamita: Da libertação nacional ao socialismo\n\nPaulo Fagundes Visentini\n\n- https://gateway.pinata.cloud/ipfs/QmbQrg7ebBmy9xVd9n36SVimyQJ1k8VbjrK5UTJNoPjoY1\n\n\"O pequeno país heroico que derrotou a maior das potências militares\" – este título transformou-se em lugar comum e, embora honroso, tende a reduzir o Vietnã a mero coadjuvante em uma peça em que os verdadeiros protagonistas são os titãs da Guerra Fria. A trajetória vietnamita, entretanto, é muito mais ampla, seja em sua extensão temporal, seja em seus significados político e histórico. A revolução vivida no Sudeste asiático espelha as tensões e anseios de uma nação que desde sua origem milenar adquiriu com sangue o direito de existir e ainda busca um futuro justo para seus filhos.",
				"added": 1588295704
			},
			{
				"comment_id": 5,
				"body": "#A Revolução Coreana: o Desconhecido Socialismo Zuche\n\nPaulo Fagundes Visentini , Analúcia Danilevicz Pereira , Helena Hoppen Melchionna\n\n- https://gateway.pinata.cloud/ipfs/QmTLHfdSqXzdiUZrcZ67tY9A3rjZ7ekX6SzHEiJTS7Sk4P\n\nA Coreia do Norte é comumente retratada no Ocidente de forma caricatural. Difunde-se a imagem de um regime fechado, à beira do colapso, irracional, que oprime um povo faminto enquanto investe fortunas em um projeto nuclear megalomaníaco. Perdem-se, nessas representações caricatas e eivadas de objetivos políticos, tanto o contato com a real configuração do regime norte-coreano, de impressionantes conquistas socioeconômicas, quanto as complexidades que caracterizaram todo o processo revolucionário e continuam a tensionar o sudeste asiático.",
				"added": 1588295722
			},
			{
				"comment_id": 6,
				"body": "#[Socialista de iPhone?](https://invidio.us/watch?v=CL2matYOY1A)\n- https://gateway.pinata.cloud/ipfs/QmXiBgQs2hBNuNzr9XMQiLbSkb5oUu49sQ636cxRV1usA2\n\n#[Consumismo x Socialismo](https://invidio.us/watch?v=b4driJ-lrBI)\n- https://gateway.pinata.cloud/ipfs/QmU8mrSWL5Do4GtR7UGULtUVSaeTMHaMzZgk98cSzH2wZY",
				"added": 1588296906
			},
			{
				"comment_id": 7,
				"body": "#[Mídia, poder e hegemonia: contra a esquerda ingênua](https://invidio.us/watch?v=LOmctTu03UU)\n- https://gateway.pinata.cloud/ipfs/QmXtCxd9r3Jen8QpHzDDayeFGUJZ6JbsHnAFyYSMy4qivV",
				"added": 1588297230
			},
			{
				"comment_id": 8,
				"body": "#[Cuba, Venezuela e as polêmicas feat. Fabio Luis](https://invidio.us/watch?v=ipvxUMlMaBI)\n- https://gateway.pinata.cloud/ipfs/Qmdqjb1tDPMgbJVVHru61QXECfMCpeFSYfrYzaWgXT73aP\n\nO livro é [Uma história da onda progressista sul-americana](https://gateway.pinata.cloud/ipfs/QmXxP4nFpqJuEctdkGr67QaV911EvjANSRDwBKQQdpiPNa), de Fabio Luis Barbosa dos Santos, publicado pela Editora Elefante em 2018.",
				"added": 1588298935
			},
			{
				"comment_id": 9,
				"body": "#A construção do Estado norte-coreano [Parte 1]\n\nhttps://web.archive.org/web/20200430185605/https://revistaopera.com.br/2019/09/25/a-construcao-do-estado-norte-coreano-parte-1/ \n\n#A construção do Estado norte-coreano [Parte 2]\nhttps://web.archive.org/web/20191127144452/https://revistaopera.com.br/2019/10/07/a-construcao-do-estado-norte-coreano-parte-2/\n\n#O boom da construção em Pyongyang: A Coreia do Norte está superando as sanções? \nhttps://web.archive.org/web/20200430190036/https://revistaopera.com.br/2020/01/23/o-boom-da-construcao-em-pyongyang-a-coreia-do-norte-esta-superando-as-sancoes/\n\n#Direitos humanos: Quando a Coreia do Norte fala\nhttps://web.archive.org/web/20191127144452/https://revistaopera.com.br/2019/11/16/direitos-humanos-quando-a-coreia-do-norte-fala/\n\n#Por uma Coreia pacífica e unida\nhttps://web.archive.org/web/20200430190635/https://revistaopera.com.br/2019/08/12/por-uma-coreia-pacifica-e-unida/\n\n#Norte ou Sul: Que Coreia enfrenta uma “crise alimentar”?\n- https://web.archive.org/web/20200422215129/https://revistaopera.com.br/2019/07/11/norte-ou-sul-que-coreia-enfrenta-uma-crise-alimentar/\n\n\nPara sua referência, a população do Norte, em dezembro de 2013, era de 24,8 milhões. A população do Sul, a partir de julho de 2013, era de 51,06 milhões. Se pensarmos em imagens de pessoas norte-coreanas morrendo de fome ou sofrendo de desnutrição, como já foram divulgadas pela mídia e por funcionários dos governos sul-coreano e americano, a resposta pode parecer simples. Com base nessas imagens, você pode dizer que a produção agrícola, a autossuficiência de grãos e o consumo per capita de alimentos da Coreia do Sul certamente devem exceder em muito os do Norte.\n\nPorém, se sua resposta é essa, bem, você provavelmente foi enganado pela propaganda manipuladora. A realidade é exatamente o oposto.\n\nNa verdade, o Norte tem uma produção agrícola superior à do Sul, embora o Sul tenha o dobro da população. O rendimento anual estimado da colheita da Coreia do Norte é de 5.030.000 toneladas. O rendimento da safra de 2013 da safra do Sul foi de 4.833.148 toneladas. A autossuficiência de grãos do Norte é de 93,67%, enquanto a do Sul é de apenas 23,1%. O consumo de alimentos per capita é de 174 kg no Norte e 126,7 kg no Sul. A média per capita diária é de 476g no Norte e 347g no Sul.\n\n#Para a mídia ocidental, zumbis e unicórnios são comuns na Coreia do Norte\n- https://web.archive.org/web/20191127150154/https://revistaopera.com.br/2019/06/16/para-a-midia-ocidental-zumbis-e-unicornios-sao-comuns-na-coreia-do-norte/\n\nSe a grande mídia serve para ser acreditada, a Coreia do Norte é uma terra repleta de campos prisionais, zumbis e unicórnios.\n\n#A mentira da foto noturna: Desenvolvimento econômico na Península Coreana \n- https://web.archive.org/web/20200430191335/https://revistaopera.com.br/2019/06/03/a-mentira-da-foto-noturna-desenvolvimento-economico-na-peninsula-coreana/ \n\nDefensores do capitalismo global desregulado frequentemente comparam as condições econômicas na Coreia do Norte com as da Coreia do Sul para estabelecer um argumento para defender suas políticas. Isto é completamente falacioso, ignorando a história real de como a Península Coreana se desenvolveu desde 1945.\n\n#Coreia do Norte: conquistas em saúde e educação\n- https://web.archive.org/web/20191127132443/https://revistaopera.com.br/2019/04/11/coreia-do-norte-conquistas-em-saude-e-educacao/\n\nO governo norte-coreano, segundo a imprensa ocidental, segue oprimindo e empobrecendo sua população. De acordo com a U.S. News & World Report, “a Coreia do Norte é um dos lugares mais miseráveis ​​do mundo. O padrão de vida se deteriorou a níveis extremos de privação, em que o direito à segurança alimentar, à saúde e a outras necessidades mínimas de sobrevivência humana é negado”.\n\n“Aqui nos EUA contamos com o Medicare, todos os nossos filhos são educados, todos somos alfabetizados e todos queremos viver na América. E na RPDC, o sistema de saúde é péssimo, eles não têm escolas e leitos hospitalares e são todos um monte de analfabetos. Você não gostaria de morar lá!” (paráfrase do autor).\n\nSob a montanha de desinformação da mídia, há mais do que se aparenta. Apesar das sanções e ameaças militares, sem mencionar a intenção fracassada de organizações “respeitáveis” de direitos humanos (incluindo a Anistia Internacional) de distorcer os fatos, o “sistema de saúde da Coreia do Norte é invejado pelo mundo em desenvolvimento”, segundo a ex-diretora-geral da Organização Mundial da Saúde: “Diretora-geral da OMS, Margaret Chan, disse que o país não enfrenta ‘falta de médicos e enfermeiras’.\n\n#As seis maiores mentiras da mídia sobre a Coreia do Norte no encontro em Hanói\nhttps://web.archive.org/web/20200430192256/https://revistaopera.com.br/2019/03/22/as-seis-maiores-mentiras-da-midia-sobre-a-coreia-do-norte-no-encontro-em-hanoi/\n\n#O soldado fugitivo norte-coreano e a mídia como instrumento da guerra\nhttps://web.archive.org/web/20180114013058/https://revistaopera.com.br/2017/12/06/o-soldado-fugitivo-norte-coreano-a-midia-como-instrumento-da-guerra/\n\n#Cantora norte-coreana “executada” é negociadora de delegação da Coreia do Norte\n- https://web.archive.org/web/20190629230110/https://revistaopera.com.br/2018/01/25/cantora-norte-coreana-executada-e-negociadora-de-delegacao-da-coreia-norte/\n\n\"\"Há alguns anos os meios de notícia internacionais informaram que ela havia sido executada por um pelotão de fuzilamento. Hyon Song Wol, uma dirigente sênior do Partido do Trabalho da Coreia, agora reaparece como uma das faces da delegação norte-coreana que foi para a Coreia do Sul negociar a formação de uma equipe única nas Olimpiadas de Inverno.\"\n\n#Hipocrisia, a narrativa da mídia para a Coreia do Norte\n- https://web.archive.org/web/20171031070707/https://revistaopera.com.br/2017/08/17/hipocrisia-narrativa-da-midia-para-coreia-norte/\n\n\"Como disse Ésquilo, o pai da tragédia, a primeira vítima da guerra é a verdade – contra a Coreia do Norte, a imprensa já prepara o campo de batalha há anos.\"\n\n#Coreia do Norte e a hipocrisia nuclear\nhttps://web.archive.org/web/20200430210009/https://revistaopera.com.br/2016/09/11/coreia-do-norte-e-a-hipocrisia-nuclear/\n\n#Na ONU, Coreia do Norte defende direito a ter armas nucleares\nhttps://web.archive.org/web/20200430210120/https://revistaopera.com.br/2016/09/23/na-onu-coreia-norte-defende-direito-ter-armas-nucleares/",
				"added": 1588299325
			},
			{
				"comment_id": 10,
				"body": "#Juche TV é um canal no Youtube em língua portuguesa que combate a manipulação midiática contra a Coreia do Norte, divulgando a verdade sobre o país. Foi ao ar pela primeira vez em 20 de setembro de 2017.\n\n- https://invidio.us/channel/UCDL1vd54UFeyKiqeyIRI6xQ",
				"added": 1588299377
			},
			{
				"comment_id": 16,
				"body": "#[Mitos e verdades sobre o desenvolvimento chinês](https://invidio.us/watch?v=0DJUM4zQt0A)\n- https://swarm-gateways.net/bzz:/5d333cb6feb46bdb0560b3ffc4e7bc323fbea03f17276a5e3ff5dd449891c3f3/Mitos+e+verdades+sobre+o+desenvolvimento+chinês+-+Ep.+IV+Ajuda,+professor-0DJUM4zQt0A.mp4",
				"added": 1588305552
			}
		],
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": [
			{
				"comment_id": 11,
				"body": "#O Golpe de 1964: como morre uma democracia\n\nO passo-a-passo do golpe que levou o Brasil a uma Ditadura Militar.\n\n- https://ia801501.us.archive.org/27/items/estacaobrasil_golpede64/estacaobrasil_golpede64.mp3\n- https://swarm-gateways.net/bzz:/ef3e4e24442366100b4a52290ab0d8cdf6c4862bdcef25a42afed575a6e23ec0/estacaobrasil_golpede64.mp3\n",
				"added": 1588302109
			},
			{
				"comment_id": 12,
				"body": "#A abolição da Escravatura: as disputas e o legado\nA escravidão no Brasil, seu fim e seu legado\n\n- https://ia601403.us.archive.org/19/items/estacaobrasil003_abolicao/estacaobrasil003_abolicao.mp3\n- https://swarm-gateways.net/bzz:/07a25f2a723889ce09ce90667ec0635366416f20d34cb319c76aeee56f72dc05/estacaobrasil003_abolicao.mp3\n",
				"added": 1588302838
			},
			{
				"comment_id": 13,
				"body": "#História do feminismo: história, vertentes e objetivos de um movimento\nQuais significados são atribuídos ao conceito de feminismo e qual sua história?\n\n- https://ia801409.us.archive.org/20/items/historiafm_historiadofeminismo/historiafm_historiadofeminismo.mp3\n\n- https://swarm-gateways.net/bzz:/353088b7edd7cecb05a2f878c3b38d807056309db51dcf6498a3873cc7761ca4/historiafm_historiadofeminismo.mp3\n\n#LEITURAS RECOMENDADAS:\n- Joana Maria Pedro e Carla B. Pinsky (org) – Nova historia das mulheres no Brasil\n- Cinzia Arruza, Heci R. Candiani, Nancy Fraser – Feminismo para os 99%\n- Mary Beard – Mulheres e poder: um manifesto",
				"added": 1588303655
			},
			{
				"comment_id": 15,
				"body": "#Revisionismo histórico: pesquisa e ideologia na historiografia\nQual a diferença de revisionismo e negacionismo? E quais são alguns dos exemplos mais famosos?\n\n- https://ia801406.us.archive.org/12/items/historiafm_revisionismohistorico/historiafm_revisionismohistorico.mp3\n\n- https://swarm-gateways.net/bzz:/8372dd0ccecef928e63d9035154ebade5379e29102ff71126ff85e9e9123380a/historiafm_revisionismohistorico.mp3\n\n#LEITURAS RECOMENDADAS:\n- Demian Melo (org) – A miséria da historiografia\n- Carlos Z. de Sena Jr; Demian Melo; Gilberto Calil (orgs) – Contribuição à crítica da historiografia revisionista\n- Josep Fontana – História dos homens\n- Josep Fontana – Historia: Analise Do Passado E Projeto Social\n- Eric Hobsbawm – Ecos da Marselhesa\n- Domênico Losurdo – Guerra e revolução",
				"added": 1588305270
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 14,
				"body": "#Vejam Só!\n\nPrograma de entrevistas e debates apresentado pelo Pastor Eber Cocareli que utiliza a Bíblia como base da discussão teológica. Os temas são relevantes, atuais e polêmicos, abordados de maneira coerente e séria, buscando respostas para a pergunta do dia com a ajuda do repórter Eliezer Pereira. Se você gosta de teologia, o seu lugar é aqui!\n- http://www.rittv.com.br/programas/15\n- https://invidio.us/channel/producaovejamso\n- https://invidio.us/playlist?list=PLDunIvj38g72gyBrY28PnRCXTkH32NDsw",
				"added": 1588303859
			}
		]
	},
	"comment_vote": {}
}