{
	"next_comment_id": 4,
	"comment": [
		{
			"comment_id": 1,
			"body": "Que anda constando en Namecoins el .bit?? ¿Se puede pagar minando un poquito o lleva más trabajo? A mi me interesa mucho ZeroNet y si se puede ayudar comprando los dominios .bit lo haría. Estoy hasta los huevos de pagar 9€ anuales por un dominio que a veces ni voy a usar :V y me interesa probar esto. A modo alternativa, he sustituido por uno nuevo en hg-pages de github, usando Jekyll. Te dan 1Gb y puedes subir ficheros de al menos 50Mb, para un blog es genial y no hay que comprar un dominio ni nada, tienes una como por ejemplo erm3nda.github.io ;)",
			"post_id": 16,
			"date_added": 1463178466
		},
		{
			"comment_id": 2,
			"body": "A pesar de lo bien pensado que está el asunto, yo creo que en primer lugar hay formas más fáciles de hacer que nuestro navegador no acceda fuera de localhost ( es decir, solo a conexiones ZeroNet u Tor, etc con servidores locales ) y listo. Con especifiar en el proxy un proxy que no exista o un puerto a boleo es suficiente para que falle, aunque supongo que será más bonito que falle dentro del  Zeronet en vez del Navegador. Otra opción es lanzar el browser a través de Selenium con un par de ajustes para auto-setear el proxy y tal :)\n\nMe gustan mucho estos artículos y todo lo que tenga que ver con seguridad, privacidad y proxys... muchos proxys :)",
			"post_id": 89,
			"date_added": 1463179085
		},
		{
			"comment_id": 3,
			"body": "La conversacion se habia concentrado en un punto: Es necesario realmente usar cualquier forma de proteger lo anonimo y de pasada cifrar todo?\n\nEsto no es una cuestión trivial. Es grandísimo punto de inflexión para la gente, los usuarios, las personas. \n\nDado el alto nivel de hackeo y la triste capacidad de los usuarios para entender como funcionan y como les pueden afectar las conexiones digitales es casi imprescindible pensar que todo debe ir cifrado excepto que sea material público, es la unica manera de proteger la privacidad de forma pasiva.\n\nRespecto a que sea malo seguir luchando es falso, la seguridad es como la felicidad, no se alcanza, es una busqueda constante, una dirección en la que ir. Cuando sale un virus el antivirus se actualiza, y después el virus mejora, y así siempre. Respecto a la fuerza de hasheo, cuando una fuerza superior se cree para romper la seguridad, con la misma fuerza superior se creará la nueva seguridad. Yo a veces me alegro de que haya gente tan hábil creando protocolos seguros.\n\nConectarse debería ser un proceso guiado, que te deje conocer y elegir tus posibilidades. La informática y los SO actuales están un poco lejos de otorgar al cliente final potencia y facilidad de uso a la vez. La gente no sabe ni que pollas es un firewall en algunos casos, así que tiene que haber un gestor que te diga \"¿Deseas que los demas usuarios puedan conectarse a tu ordenador? Si, No, Elegir, Preguntar, etc. Una especia de startup pero que sea también informativo. No lo he visto esto jamás en ningún SO ni rede ni nada.\n\nUna de esas cosas que tanto me gusta de Zeronet es que cualquier usuario puede hacer doble click en el python y continuar con el UI tan majo que han hecho. La tecnología tiene que estar disponible y explicada en el idioma del cliente final, asi que lo primero que tiene que tener un SO, programa o cualquier otra cosa, igual que un manual, una presentacion digna y fácil.\n\nUn saludo y lo siento por tanto tocho ;)",
			"post_id": 111,
			"date_added": 1463180402
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}