{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Продолжение про проверку недвижимости.",
			"body": "Это вторая часть чек-листа, на что обращать внимание при поиске дома с участком. Эта информация будет полезна всем, кто ищет недвижимость для покупки или аренды. Смотрите и фото, на них даны примеры возможных проблем.\n\nВ первой части (ссылка внизу поста) были рассмотрены технические моменты, теперь перейдем к документам и юридическим вопросам.\n\n1. Кто собственник и нет ли обременений. Недвижимость может быть в залоге у банка или являться наследством. Есть ли право использования земли третьими лицами (služnost). Например, общая с соседями подъездная дорога, трассы коммуникаций, проходящие по участку и пр.\n\n2. Срок освобождения недвижимости от жильцов, вписан ли этот срок в договор. Например, если в доме живет бабушка, которая хочет купить квартиру взамен дома, то срок поиска подходящей для нее квартиры может затянуться надолго. И все это время она будет жить в доме.\n\n3. Кто соседи, по возможности познакомиться. Узнать про фермы и производства рядом (шум и запах), особенно если это окрестности Врхники.\n\n4. Есть ли разрешение на строительство (gradbeno dovoljenje) и эксплуатацию (uporabno dovoljenje). Наличие проектной документации. Построен ли дом в соответствии с документацией и разрешением на строительство. Наличие различных пристроек и построек на участке, документы на них. Если дом построен до 1967 года и с тех пор не перестраивался, то разрешения не требуются.\n\n5. Сколько участков продается, какое назначение у земли. Возможность дополнительного строительства, если это планируется. Часто продаются большие участки земли, состоящие из нескольких. Одна часть может быть под застройку, а другая для сельского хозяйства.\n\n6. Не вылезает ли часть дома или хозпостроек на чужой участок. Или что-то от соседей на ваш будущий участок - дорога, угол дома или сарай. Такая проблема встречается регулярно.\n\n7. Не находится ли недвижимость в зоне возможного подтопления, охраны культурного наследия или археологических раскопок, не является ли она памятником архитектуры (kulturna dediščina), не протекает ли под участком ручей (и такое было).\n\nВопросы связанные с собственностью, обременениями и проводимой сделкой может проверить риэлтор или юрист.\n\nДля проверки документации, строительных разрешений, нахождения объекта в различных охраняемых зонах и возможности реконструкции понадобится архитектор или инженер.\n\nДля детальной проверки возможности реконструкции или нового строительства возможно придётся сделать идейный проект и запросить технические условия. Глубокая проверка может затянуться и на несколько месяцев. В таком случае, можно быстро проверить основные моменты, заключить предварительный договор и внести аванс. Но в договоре обговорить возможность его расторжения с вашей стороны, если влезут проблемы, мешающие дальнейшей реализации проекта.\n\nПервая часть про техническую проверку объекта - \nhttps://www.facebook.com/indreamhouse/posts/813030175701825\n\nПоделитесь вашим опытом поиска подходящей недвижимости. С чем приходилось сталкиваться, какие проблемы обнаруживались?",
			"added": 1553723290
		},
		{
			"topic_id": 2,
			"title": "Какая нужна документация для строительства дома или отеля в Словении. Часть 2 - Idejna zasnova.",
			"body": "В предыдущем посте написали в общем, какая нужна документация для строительства - #IDH_документация, сейчас углубимся в детали.\n\nНачнем с первой части - идейного проекта IZP (idejna zasnova, раньше был IDZ). Он включает в себя пояснительную записку с описанием и характеристиками дома, чертежи с его габаритами, размещением на участке и планом подключения коммуникаций. Делается только архитектором, привлечение других специалистов не требуется. Средний срок разработки - несколько недель, стоимость около 300-500 евро. Получение техусловий занимает еще порядка месяца.\n\nЖелательно сразу вызвать геодезистов и сделать геодезическую съемку. На стадии IZP без нее сложно, но можно обойтись. Для следующей фазы она потребуется обязательно. Цена в районе 300-600 евро в зависимости от площади и рельефа участка.\n\nНа основании IZP выдаются технические условия (projektne pogoji) на подключения к коммуникациям, по организации подъезда и парковки. А также с требованиями по охране культурного наследия, защиты почв от эрозии и другими, в чью охранную зону попадает участок. Уже на этом этапе желательно определиться с планируемым домом, чтобы техусловия выдавались на объект, который планируется построить, а не на некий абстрактный дом.\n\nИмеет смысл сделать IZP и получить техусловия до окончательной покупки участка, чтобы максимально обезопасить себя в дальнейшем. Только после получения техусловий можно точно понять, что на участке построить возможно, а что - нет. Как это делается мы писали в посте про проверку участка #IDH_земля. Например, в нашей практике был случай, когда по общинскому территориальному плану высотность зданий была одна, а местные органы охраны культурного наследия срезали ее вдвое.\n\nПосле получения всех техусловий можно приступать к DGD (раньше назывался PGD) - проекту для получения разрешения на строительство. Об этом будет в следующем посте.\n\nЕсли нет необходимости в проверке земли и концепция проекта уже ясна, то можно сразу делать DGD и получать технические условия на его основе. Это позволит немного сэкономить на документации.\n\nВсе посты про документацию для строительства в Словении можно найти по тегу - #IDH_документация\n\nВ предыдущем посте мы начали говорить про строительную документацию и рассмотрели первый ее этап - идейный проект IZP ( idejna zasnova) и получение технических условий.\n\nТеперь рассмотрим проект для получения разрешения на строительство DGD (projektna dokumentacija za pridobitev mnenj in gradbenega dovoljenja, раньше назывался PGD). Это аналог стадии \"П\" в России.\n\nТакой проект включает в себя текстовую часть, планы этажей и кровли, фасады, разрезы, план участка и подключения коммуникаций и пр. Делается архитектором, привлечение других специалистов не требуется. Стоимость около 4-6 тысяч евро для небольшого дома. Средний срок разработки - несколько месяцев, но получения мнений, корректировки и дополнения могут занять еще от нескольких месяцев до полугода. А в особо запущенных случаях еще дольше. Например, если есть защита культурного наследия, природоохранные зоны и пр. Или просто не повезло с кем-то из референтов в общине или органе, выдающим мнение.\n\nПроект рассылается по почте всем организациям, выдавшим свои техусловия. Они в ответ дают свои мнения (раньше они назывались согласия).\n\n// Мнение - это заключение от органа, выдавшего технические условия. Оно подтверждает, что проект выполнен с соблюдением технических условий, которые этот орган выдавал. Например, местный водопровод подтвердит, что в проекте учтены их требования к диаметру трубы, точке подключения и месту размещения колодца с счётчиком.\n\nЕсли пришло мнение позитивное, то оно подшивается в проект. Если негативное - вносятся соответствующие изменения в документацию и она отправляется на досогласование. Может потребоваться несколько таких итераций для получения позитивного мнения. А каждая из них занимает от пары недель до месяца.\n\nДля получения некоторых мнений могут потребоваться дополнительные изыскания. Например, наши дома попадают в зону эрозии почв, и для соответствующего мнения пришлось заказывать геомеханическое исследование участков.\n\nКогда получены все нужные позитивные мнения, можно подавать документацию в управну еноту. Она рассмотрит ее и выдаст разрешения на строительство. Не сразу, не быстро, но может быть выдаст. Наболело...\n\nВ следующем посте поговорим о процессе рассмотрения проектов в управной еноте и что еще нужно будет сделать для его получения.\n\nПредыдущий пост про документацию (IDZ) ",
			"added": 1554753823
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1_1KDowLVWPX3uVoksFQ1e9Pw1ZA6xcLTfSX": [
			{
				"comment_id": 1,
				"body": "немного померял ZeroNet vs I2P . у второго показатели выше. но 0Net сейчас интересуются много в калифорнии )",
				"added": 1552931882
			}
		],
		"1_1MhiMP1PsbfA5VATp5RBz5bxmttVssCAYK": [
			{
				"comment_id": 2,
				"body": "Подготовили чек-лист, на что обращать внимание при поиске дома с участком. Эта информация будет полезна всем, кто ищет недвижимость для покупки или аренды. Смотрите фото, там тоже много полезного. \n⠀ \n– Состояние несущих конструкций. Из чего построен, какие перекрытия, нет ли трещин. \n⠀ \n– Пригодность дома для возможной перепланировки. Какие стены несущие, где проходят стояки, дополнительные входы и пр. Можно ли отделить лестницу и сделать отдельные квартиры на этажах и пр. \n⠀ \n– Отопление. Какой котел, на чем он работает, как он управляется, где центральный термостат. Какие трубы, радиаторы, есть ли термоголовки, есть ли теплые полы. \n⠀ \n– Водоснабжение. Где находится счетчик, какие трубы, как нагревается горячая вода. Общее состояние сантехники. \n⠀ \n– Канализация. Подключен ли дом к центральной канализации, используется локальная система очистки (čistilna naprava) или накопительная емкость (greznica). Cрок подключения к центральной канализации. \n⠀ \n– Ливневая канализация и дренаж. Как сделано, куда отводится вода.\n⠀ \n– Утепление дома (фасад и кровля). Какие установлены окна. Какой энергетический класс у здания. \n⠀ \n– Гидроизоляция. Самые проблемные места - углы в подвале, кладовая под лестницей, помещения под террасами, балконы. \n⠀ \n– Вентиляция. Есть ли вентиляция в санузлах, кухне, кладовых. Есть ли рекуператор. \n⠀ \n– Кровля. Какое покрытие, когда ремонтировалось. Состояние обрешетки и несущих конструкций. Возможность обустройства мансарды. \n⠀ \n– Электрика. Когда делалась, была ли замена. Где электрощит, какие предохранители. Какие провода, состояние розеток и выключателей. Где счетчик, какая выделенная мощность. К дому подходит подземная или воздушная линия. \n⠀ \n– Интернет и телефон. Есть ли оптика в доме или у соседей. \n⠀ \n– Наличие парковочных мест и удобство подъезда к дому. В чьей собственности подъездная дорога. \n⠀ \n– Состояние внутренней отделки. Покрытия полов, стен и потолков. Наличие плесени. \n⠀ \n– Состояние мебели и бытовой техники, если она остается. \n⠀ \n– Благоустройство территории. Возможность организации дополнительных парковочных мест. \n⠀ \nПро каждый из пунктов можно написать отдельный пост. Напишите, что вызывает больше вопросов, постараюсь это осветить в дальнейших публикациях.",
				"added": 1553723329
			},
			{
				"comment_id": 3,
				"body": "просто оставлю это здесь. недвижимость выбирать надо. а вот описание хранить на форумах не хочу. буду сюда заглядывать.",
				"added": 1553723369
			}
		],
		"1_1BRQVZ4JEHjbNx3vyA5FyFjvM3GYSw7c7U": [
			{
				"comment_id": 4,
				"body": "> [5hu](#comment_2_15WHgxwvEvJ8nmsSFLciwcnMoPPpn7S1XV): их нет и не будет любой контроль это цензура а зеронет расчитан на борбу с ней\n\nвсе погрязнет в спаме",
				"added": 1554036493
			}
		]
	},
	"comment_vote": {}
}