{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1612007867_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "Actual journalism doesn't exist in any mainstream media outlet. The job of the media is to form a public opinion, which can be exploited by the same corporations who fund the press. What comes to the \"scientific method\" This method assumes that we already have the full knowledge of the absolute and objective truth. It relies on the fact, that all of our former conclusions are undeniable facts. If any of these so called facts would be proven false in the future, then the whole house of cards would fall, and now according to the \"scientific theory\" everything that we have ever observed, is to be considered false. This doesn't make any sense and basically confirms that nothing can be claimed to be absolute, since everything can always be proven false and if this isn't the case, then how do we know that it can't be?",
				"added": 1612116964
			}
		],
		"1611909944_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 2,
				"body": "I will do your mom and we will never take the Gates vaccine.",
				"added": 1612117328
			},
			{
				"comment_id": 8,
				"body": "> [mfs](#comment_107_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W): My mom is dead and buried. You'd literally be pounding sand. [...]\n\nEven better.",
				"added": 1612267715
			}
		],
		"1610754180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 3,
				"body": "Servers hosted in USA. If you want to host your own server, you have to use Google Services. Easier to just take your friends to the CIA HQ and chat about your future drug deals.",
				"added": 1612117440
			},
			{
				"comment_id": 4,
				"body": "> [goldsmith](#comment_3_1KNLne2PbRUL1WrWuN7u71DgBRhwvK5dxu): Servers hosted in USA. If you want to host your own server, you have to use Google Services. Easier to just take your friends to the CIA HQ and chat about your future drug deals.\n\nUse P2P. Like tox, Briar or JAMI.",
				"added": 1612117609
			}
		],
		"1611445407_1PqZH7rna6K4Ea76MnFgyHqRCa4fTst2cC": [
			{
				"comment_id": 5,
				"body": "Bunch of black people rob, rape and kill people: \"Y'all we have a white president who did this. Don't blame the black guys for just doing what the white man told them to do. We lack the capability to resist this white man, who says that we have to loot these stores and burn these shops\". Fuck off, retard.",
				"added": 1612118256
			}
		],
		"1612099044_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 6,
				"body": "Read \"A History Of Central Banking & The Enslavement Of Mankind\" and tell me how jewish involvement in central banking and usury is just a conspiracy theory by the fascists.",
				"added": 1612172441
			}
		],
		"1612173389_1P99tURa4T43muCjSejqPrYHsi9km7g2X6": [
			{
				"comment_id": 7,
				"body": "Throw out your TV, wipe your ass with the diaper and realize that a disease with a survival rate of 99.9% is a fucking joke.",
				"added": 1612267513
			}
		]
	},
	"comment_vote": {
		"4_1C7fo8jvyBgd1Xwb3wfKbXrZu3TEK7YHmL": 1,
		"66_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"10_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": 1,
		"15_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK": 1
	}
}