{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "СЕКСОФОБИЯ: ГЛАВНАЯ ЧУМА ЧЕЛОВЕЧЕСТВА",
			"body": "Статьи о сексофобии (а также лжерелигиях): http://127.0.0.1:43110/1DorNZKRs4s7kKhfzC11wkWEc6EvrMunUH/\nhttp://127.0.0.1:43110/1kFLTtbWKEyo4hpYMQjXCArQfa7VGpk8E/?Home\n\nУважаемые пользователи, автор статей предлагает вам прочитать представленные здесь работы, и, если они покажутся вам правильными и интересными — бесплатно скопировать хотя бы одну из них (а лучше несколько) в любой удобный для вас форум, блог и т.п. Спрашивается — зачем? Я надеюсь, что вы и сами это поймёте, когда ознакомитесь с материалами. Но всё же поясню на всякий случай: пропагандируемая у нас в стране сексофобия постепенно приобретает характер национального бедствия. Вернее — уже практически приобрела: ежегодно от рук маньяков-сексофобов гибнут как минимум тысячи людей, по меньшей мере десятки тысяч страдающих сексофобией граждан становятся преступниками, насильниками, заболевают психическими и соматическими болезнями... \n\nА власть предержащие упорно продолжают проповедовать нам идеи о необходимости «нравственного» поведения, СМИ запугивают нас байками о «мерзких развратниках» и «грязных извращенцах», одновременно обучая наших детей уголовно-гомофобским понятиям и основам лжерелигиозного некросадизма. Нет так давно, но зато массово и активно азы некрофилии начали преподавать уже и в школах — так что, надо думать, скоро мы получим новое поколение «талантливых» джеков-потрошителей, чикатил, сталиных и гитлеров. \n\nВсё это - осознанная политика наших высокопоставленных светских и псевдорелигиозных руководителей. Насаждая сексофобские взгляды, они пытаются превратить всех граждан в отупевшее от воздержания закомплексованное быдло, которое будет голосовать за того, за кого \"надо\", одобрять все без исключения \"гениальные\" решения партии, и регулярно башлять псевдорелигиозным лжесвященникам - тем, которые, как говорится, \"в законе\". \n\nВ газетах и по телевидению об этом, естественно, не рассказывают — поэтому нам остаётся только одно: распространять объективную информацию о сексе и сексофобии через интернет. Практика показывает, что бояться делать это не следует — администратор форума занимается распространением подобных текстов уже не первый год (хотя времена, конечно, меняются - так что думайте сами...). А что касается возможных виртуальных наездов недовольных сексофобствующих пользователей — избавиться от них проще простого, достаточно просто не обращать внимания на неадекватные выпады (не читать, не отвечать на них, банить интернет-хулиганов и т.д.). \n\nНекоторые наверняка могут подумать: мол, «А стоит ли напрягаться? Всё равно, даже если я скопирую одну-две статьи — это ничего не изменит, по ящику не перестанут пугать сексофобскими страшилками, а по улицам точно так же будут бегать обезумевшие пенсионеры и маньяки...». Но я бы хотел обратить внимание таких читателей на то, что даже если им удастся помочь хотя бы одному человеку — это уже можно будет считать большим достижением. Только представьте: вы поможете одному, кто-то — ещё двум, а какой-нибудь прочитавший скопированную вами статью пользователь не поленится, и спасёт от чудовищных неприятностей десятки или даже сотни людей! \n\nТак что читайте, анализируйте, думайте. \n\nИ приглашайте сюда своих друзей/знакомых, а также незнакомых пользователей! \n\nПри копировании желательно давать ссылку на данный форум. \n\n\nСкачать работы можно по этой ссылке: https://cloud.mail.ru/public/6AVF/3x5uzP6jo . \n\nМатериалы периодически правятся и дополняются, так что если вы захотите иметь у себя наиболее правильные и свежие тексты - скачивайте папку примерно раз в три месяца. \n\n\n_____________________________________________________________________ \n\nP.S.: Публикуя данные тексты, желательно дополнять их пометками \"18+\" и пояснениями вроде \"Автор не пытается никого оскорбить, не призывает к экстремизму, разжиганию розни, иным противозаконным действиям, и не утверждает, что все без исключения представители упомянутых социальных и прочих групп являются неполноценными, опасными для общества и т.д.\" - возможно, таким образом вы сможете себя обезопасить.",
			"added": 1481751758
		},
		{
			"topic_id": 2,
			"title": "СЕКСОФОБИЯ: ГЛАВНАЯ ЧУМА ЧЕЛОВЕЧЕСТВА",
			"body": "Статьи о сексофобии (а также лжерелигиях): http://127.0.0.1:43110/1DorNZKRs4s7kKhfzC11wkWEc6EvrMunUH/\nhttp://127.0.0.1:43110/1kFLTtbWKEyo4hpYMQjXCArQfa7VGpk8E/?Home",
			"added": 1481924746
		},
		{
			"topic_id": 3,
			"title": "Статьи и сексофобии, гомофобии и лжерелигиях",
			"body": "http://127.0.0.1:43110/1DorNZKRs4s7kKhfzC11wkWEc6EvrMunUH/\nhttp://127.0.0.1:43110/1kFLTtbWKEyo4hpYMQjXCArQfa7VGpk8E/?Home",
			"added": 1481972569
		},
		{
			"topic_id": 4,
			"title": "Советую прочитать статьи из этого блога",
			"body": "http://127.0.0.1:43110/1DorNZKRs4s7kKhfzC11wkWEc6EvrMunUH/",
			"added": 1482663752
		}
	],
	"topic_vote": {
		"1_13zWkqwCxJ9i7bbgBEW2D2HEoovzmgoivR": 1,
		"2_13zWkqwCxJ9i7bbgBEW2D2HEoovzmgoivR": 1,
		"3_13zWkqwCxJ9i7bbgBEW2D2HEoovzmgoivR": 1,
		"4_13zWkqwCxJ9i7bbgBEW2D2HEoovzmgoivR": 1
	},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}