{
	"next_comment_id": 4,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [grimsdottir](#comment_1_1Q3DcejYbdNFDSDdjpznMmgg1ZCzn1SUsn): Super interesting, specially about the tor part which seems surprisingly easy actually. For what it's worth, FreeBSD has a binary package of ZeroNet available via pkg(8)\n\nThank you for your comment... glad you like it. I will publish another quick article on how to configure pf to push the ZeroNet + Tor through a VPN with dnscrypt_proxy (not much left to leak...) #parano #chasingtheperfectsetup #openforcomments ",
			"post_id": 4,
			"date_added": 1498158840
		},
		{
			"comment_id": 2,
			"body": "> [rythyrix](#comment_1_18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y): The reason ZeroMail's received messages keep reappearing is that the content on disk doesn't change; instead, the browser's local storage (clearnet) stores a list of messages to not display. Naturally, if you use the Tor browser or wipe your local storage somehow, those messages will reappear. Haven't tested deleting sent messages, but as you are the one with the private key of the json those messages are stored under, it is possible to actually delete them.\n\nUnderstood. Thank you for the explanation. ",
			"post_id": 7,
			"date_added": 1498461476
		},
		{
			"comment_id": 3,
			"body": "> [shinrateda](#comment_1_1GPoNiDg6zbDmY5wF5hVwzd5e3UWexkuo1): hello, do you have the link for Zites please?\n\nHello mate, not sure I've got this right. \n\nIf you're asking about the Zero sites (Zites) I've done, well, it's the two mirrors you can find linked from this page: \n[The OpenBSD.org mirror](http://127.0.0.1:43110/1Phf391WQfhtDaXfnYeugz8Dhn7zqtGszw)  and the NetBSD one that still seems to be broken (got some peers but keep failing to publish... need to find a way to get more verbose logs but didn't have time to check this). \n\nIf you want some more links [here is](http://127.0.0.1:43110/Sites.ZeroNetwork.bit/) a good place to start.\n",
			"post_id": 7,
			"date_added": 1498727502
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"10": 1,
		"11": 1
	}
}