{
	"title": "Cudam´s blog\t-_-",
	"description": "Siempre me ha gustado la idea de tener un blog. Tantas ideas sobre que escribir... Hasta que creo el blog. \nEl contenido que aquí se va a tratar es diverso, viene a ser basicamente lo que a mi me venga en gana. ",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 12,
	"demo": false,
	"modified": 1456261031,
	"post": [
		{
			"post_id": 11,
			"title": "New blog post",
			"date_published": 1456261031.704,
			"body": "Blog post body"
		},
		{
			"post_id": 10,
			"title": "Actualizar el código fuente del blog\t",
			"date_published": 1456256914,
			"body": "El código fuente del blog ha sido modificado en GitHub sin embargo nuestro blog permanecerá con el código que lo creamos. Lo bonito es personalizarlo, pero escasos de tiempo, porque te gusta como está o no sabes de programar,  puede venirnos bien actualizar el código y añadir novedades.\nEn este caso lo que más destaca es \"Follow Newsfeed\"\n\nPara llevar actualizar el código (no he mirado si hay otra forma), simplemente he descargado el código de ZeroBlog (https://github.com/HelloZeroNet/ZeroBlog/)  y sobrescrito los datos en la carpeta de mi blog. Eso sí copia hecha de antemano y sin olvidar que no podemos reemplazar data si queremos conservar nuestras publicaciones.\n\nTen en cuenta que perderás cualquier modificación realizada al código.\n "
		},
		{
			"post_id": 9,
			"title": "Torrenttunes",
			"date_published": 1453646265.379,
			"body": "Hace ya tiempo que descubri torrenttunes un servicio para escuchar música en streaming via torrent, ha mejorado mucho desde entonces y esta completamente funcional, os recomiendo probarlo http://torrenttunes.ml/ es open-source asi que esta aqui para quedarse ;) podemos colaborar sembrando las canciones o añadiendo las nuestras. Para ello debemos descargar desde la página de github del proyecto la aplicación java.\n\nPara funcionar necesita java 8, lo que nos lleva al siguiente punto, en debian por defecto se usa java  7 y para poder instalarlo sin problemas deberemos decirle que use la nueva versión. Para ello debemos tener --obviamente--  la versión 8 de java, lo que haremos con \n\"sudo apt-get install openjdk-8-jdk\"\nDespués debemos decirle que use por defecto la versión 8:\nsudo update-alternatives --config java\ndeberemos introducir el número que se corresponda con la versión necesaria....\n\nYa podemos ejecutar torrenttunes --> java -jar torrenttunes.jar"
		},
		{
			"post_id": 8,
			"title": "Cambiando el color del blog...",
			"date_published": 1452538981.014,
			"body": "Ayer en un momento que tuve libre decidí intentar cambiar el color del blog para intentar darle un toque algo más personal y, para  principalmente cambiar el fondo blanco,  que no me gusta mucho para leer, tiene mucho brillo y a veces molesta. \nEl caso pense que no  sería muy complicado, y no lo es en sí, el problema es que no puedo ajustar el color como me gustaria. Para  cambiar el color hay que editar \"all.css\" en data/vuestroblog/css/ nos hemos de desplazar a la línea 63. Encontraremos lo siguiente:\n#############################\n/* Design based on medium */\n\nbody { background-color: blue; color: #FF8000; margin: 10px; padding: 0px; font-family: 'Roboto', sans-serif; height: 15000p$\nbody.loaded { height: auto; overflow: auto }\nh1, h2, h3, h4 { font-family: 'Roboto', sans-serif; font-weight: normal; margin: 0px; padding: 0px }\nh1 { font-size: 34px; line-height: 1.2em; font-weight: bold; letter-spacing: -0.5px; margin-bottom: 5px }\nh2 { margin-top: 2em }\nh3 { font-size: 26px; margin-top: 2em }\nh1 + h2, h2 + h3 { margin-top: inherit }\n################################\n\ndonde background-color  es el color de fondo de la página (en mi caso blue) y color es el color de las letras, según el código de colores html.\n\nLo que me resulto raro en un principio es que poniendo el nombre del color cambias el color para el fondo (pero no acepta todos los colores), aunque con las letras  tienes que poner el código. Nunca he tocado css y supongo que funciona así por esto (Una cosa que mirar, aunque si alguien me aclara...).\n\nTerminando si alguien me da alguna sugerencia para los colores que poner,  mejor, como habreís notado dan un poquito de \"miedo\" los actuales. Por otro lado más como nota personal, tiene que haber una forma de cambiar los tamaños de letra, poner cursiva, negrita... al editar el blog. Debo mirarlo pero si alguien me deja un link a donde este explicado le lloveran bitcoins (no, va a ser que no -_-''). \n\n\n"
		},
		{
			"post_id": 6,
			"title": "Charlatan estoy...",
			"date_published": 1452008236.517,
			"body": "Nose si alguién acabará leyendose esto con lo pesado que soy pero... Tratando de mi vida, otra vez, me gustaría que alguien me respondiera por qué estoy haciendo la PAU. Que sí, que yo sabré... Pues no, la verdad que estoy aquí porque me han dicho que para ir a la uni, ser algo en la vida  y demás. Pero lo que yo realmente pienso es que no necesito ir a la uni para aprender de verdad (generalicemos) informática. De hecho este año me parece en cierto modo una pérdida de tiempo, mientras estoy  a \"matacaballo\" estudiando y haciendo exámenes, de cosas que no me gustan en gran parte o de las que muy probablemente me habré olvidado para el año próximo (por la forma de meterlas a presión), no se lo estoy dedicando a este apasionante y competitico mundo.\nAunque con la motivación más bien escasa terminaré este año y ya decidire. No rechazare que alguién ma de un buen motivo para seguir por aquí -_-"
		},
		{
			"post_id": 5,
			"title": "Mi odisea para jugar en linux...",
			"date_published": 1452006180.559,
			"body": "Llevo tiempo amando los odenadores, y este \"amor\" no hace más que crecer, pero esto no viene al caso, lo que quería tratar hoy es algo tan trillado como es jugar en linux, he montado varios ordenadores con piezas recicladas, es increible la cantidad de ordenadores (aunque no son lo único) que son deshechados supuestamente por ser obsoletos,  cuando una actualización de software los dejaría como nuevos y completamente funcionales para usos tales como la ofimática (para lo que son usados la gran mayoría).\n\nA lo que iba hace tiempo empezo a \"bailarnos\" en la cabeza (a mi hermano y a mi) la idea de montar un ordenador decente con el que poder jugar. De acuerdo entonces y tras seleccionar el hardware, había que encargarse del software, desde el principio yo tenía claro que me negaba a instalar Windows, hace años que no lo uso si pudo evitarlo. Total había que elegir el sistema, nunca me he llevado demasiado bien con Ubuntu (aunque me inicie en este mundo gracias a él).\n\nRecientemente me enamoré de Arch Linux y quise probar con él. Problemas a destacar serían para mí, que nunca había usado UEFI ni un  SSD,  costo bastante alinear las particiones. Luego esta Steam si quieres jugar en linux juegos comerciales lo vas a necesitar, en Arch algunas librerias dan problemas bastante a menudo. Hubo algún juego (Unturned por ejemplo) que no conseguí hacer funcionar bien, pero la mayoría van sin problemas y con gran rendimiento.\n\nEl caso es que me gusta toquetear el sistema bastante y bueno sabeis eso de si funciona no lo arregles¿? yo nunca lo recuerdo \n\nAcabe cargandome el sistema. Con exámenes la siguiente semana y mi hermano queriendo jugar acabe por instalar mi amante en secreto: Debian. Sin embargo le exigi demasiado con testing (y un poquito más quizá :P, esa mala costumbre de estar siempre  a la última) más los drivers propietarios (un castigo necesario para jugar). No tenía la velocidad y estabilidad que debía. Total, tras trastear un poco los exámenes allí y mi hermano aquí, claudique y me quede con Jessie tal y como era.\n\nAunque tengo alguna cosilla más que me gustaría poner, creo que ya me he extendido bastante. Al final acabaré editando y añadiendo algo"
		},
		{
			"post_id": 4,
			"title": "Viajes extraordinarios",
			"date_published": 1452005364.542,
			"body": "Ayer términe otra aventura más que comenzo sino recuerdo mal hace tres años. Estoy hablando de una saga de libros. \nCada vez que comienzo un libro siento una gran emoción, en muchos casos una vez empezado el libro me cuesta mucho no parar hasta terminarlo. Me sumerjo en un mundo \"conecto\" con los personajes, vivo, es apasionante, viajo a lugares, épocas o culturas que, de otro modo no habría conocido. Acompañamos a protagonistas por un mundo que nos gustaría poder pisar, los vemos \"evolucionar\" o aprendemos a entenderlos. Pero si hay algo que odio es el final, llegar al final, me hace sentir vacio, como si perdiera una parte de mi, ellos se quedan, mientras yo sigo mi camino... Comprendo que es necesario, mejor llegar al final de la aventura  que caer en un vacío de sucesos repetitivos, sin embargo durante días siento una gran nostalgia.\n\nSiempre habrá un lugar en mi corazón para esos libros especiales que me hacen \"vibrar\" todo mi ser. \n¿Soy el único?"
		},
		{
			"post_id": 3,
			"title": "Home en arch....",
			"date_published": 1450901454.761,
			"body": "Tratando de crear un nuevo usuario en arch linux, me di cuenta de que la home del nuevo usuario no se crea por si sola, asi qur tuve que hacerlo manualmente con un mkdir usuario y la concesion de permisos correspondientes...."
		},
		{
			"post_id": 2,
			"title": "Hi everyone!!",
			"date_published": 1450283535.256,
			"body": "Aquí llega un geek empezando, con ganas de hacer algo -_-"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}