{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Uber всего, как находить друг друга для сотрудничества.",
			"body": "В бешенном ритме информационного общества - Современный человек - в лучшем случае немного растерян. В худшем находится в депресии.\n\n   Нам сложно уловить тенденции в развитии современных техонологий, которые действительны важны для нас, и которые на самом деле могут сделать общество лучше.\n\n    Самая главная и важная тенденция которая, не очевидна и заметна пока далеко не всем - это децентрализация.\n\n Сейчас закладывается потэнциал для развития горизонтальных связей общества. Как ни странно, но несмотря на долгую история человечества, общество всегда равивалось только вертикальные связи, то есть иерархично. И связи одного человека с другим таким же как он всегда были ограничены, разными причинами. Прежде всего отсутствием доверия.\n\nТехнологии не стояли на месте, самый понятным инструментом, для выстраивания связей друг с другом стал телефон, Но номер человека не содержит информацию, о том чем человек занимается и что он предлагает другим.\n\n Пример человек (предприниматель) желает чтобы о нем узнали, а точнее узнали о его услугах. Проблема в том, что распространяя информацию о себе, предпринимателю по сути приходится стать спамером. Распространяя информацию о себе всем, \n\nРешение проблемы - Подписки, целевые группы.\n\nНо все равно нет универсального инструмента - котором можно было бы ясно и понятно и ненавязчиво показать всем свой статус, без надоедливого спама.\n\nКак быть видимым ? Как Стать видимым ? Это зависит от такие - чем пользуется твой потэнциальный клиент. (телефоном, е-мэйл, социальные сети.. месенджер,  группы, подписки, каналы.. )  Как попасть в канал информации только нужному клиенту ? Без надоедливого спама ?  Все забито на 99,9% ненужной информацией, \nОбычный человек просто тонет в этом потоке информационного шума....\n\n Чтобы решить этоу проблему - человеку нужно дать удобный инструмент поиска.\n А тот кто желает, что его нашли, должен дать критерии поиска, чтобы все понимали \"чьи это уши торчат\" (и каналы  связи с ним).\n \nПринцип торент треккеров. (мне к примеру очень понравилось идея парсеров, когда можно быстро найти то, что тебе нужно) Инструменты для per-to-pear взаимодействия обмена информации есть торент хороший пример. Но используются только для обмена файлами.\n\nПринцип хэштегов,  хештег #долженстатьпривычкой всех кто пишет и желает быть услышанным в информационном хаосе. Для этого в любом тексте нужно #выделитьсуть и отметить хэштегом.\n\nДецентрализованный поисковые системы?? (провобовал yacy.net/)\nтоже не то, совсем не очевидно, как попасть в результат поиска ??\n\nСчитаю идеально в этом смысле реализована localbitcoin.com в котором покупатель и продавец находят друг друга по территориальному или иному критерую.\n\nХотелось бы иметь подобный инструмент, но для всех сфер сфех взаимодействия людей.\n\nКто что думает по этому поводу , как нам находить друг друга?",
			"added": 1542888921
		}
	],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1_18iNiFsd2V5Xkzf9B1QoAgvqsnHe8EGBam": [
			{
				"comment_id": 1,
				"body": "https://www.bestchange.ru/",
				"added": 1543049283
			}
		]
	},
	"comment_vote": {}
}