{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": 1,
		"3_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": 1,
		"4_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": [
			{
				"comment_id": 1,
				"body": "Presente. Ormai le poche persone italiane che conoscono Zeronet sono tutte disperse, io mi sono \"iscritto\" da poco ma dobbiamo creare un centro di ritrovo per tutti e publicizzarlo!!! Il mio sogno sarebbe quello di creare, insieme a tante altre persone, un forum o una chat room. Un punto di riferimento, ma niente di illegale o troppo illegale :)",
				"added": 1579635967
			},
			{
				"comment_id": 2,
				"body": "su questa piattaforma/rete/forum cercherò di essere il più possibile online! Saluti a tutti da un ragazzino di 16 anni :)",
				"added": 1579636088
			}
		],
		"1_19cF2jauCgNoSaFGxMhHMMYm33wyTVZojC": [
			{
				"comment_id": 3,
				"body": "Mi sono già fatto sentire su un altro \"argomento\" di ZeroTalk, mi sono connesso da poco ma non riesco ad aprire le porte del router perchè è \"bloccato\" dal mio gestore internet. Ad averne la possibilità userei un portatile vecchio per fare da seed a molti siti su questa rete fantastica!\n\nCercherò di rimanere online il più possibile, saluti a tutti da un ragazzino di 16 anni :)",
				"added": 1579636479
			}
		],
		"3_1NDdp5wQYRqdq2CeRVASnskd1EHkqS6RCQ": [
			{
				"comment_id": 4,
				"body": "\"Errore di sistema\" di Edward Snowden l'ho acquistato per natale, è bellissimo",
				"added": 1579637417
			}
		],
		"1_17438DhdJ7LHQgQBVTfHmajp8dZXLH2Tiw": [
			{
				"comment_id": 5,
				"body": "> [kensan](#comment_10_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4): Non so che potenzialità abbia ma noto che ogni tanto ci faccio un salto, quindi vale qualche cosa.\n\nFreenet l'ho provato di recente ma in italiano e anche in inglese sono riuscito a trovare poca roba e vecchia, ma potrebbe andare meglio se supportato!",
				"added": 1579637986
			},
			{
				"comment_id": 7,
				"body": "> [provacell](#comment_1_164g47hoiodZmCBFBxBU7t1xBUHSsFWtKf): In primo luogo su zeronet decidi tu cosa vedere e come moderare i contenuti, nessuno è nessuna IA può censurare ciò che vedi online tramite bolle di filtraggio. Poi sinceramente la gente che c'è qui mi piace!  (ed i fasciopedofili posso bannarli in 5 secondi tramite zeroid) vedo molta meno competizione e più collaborazione che nella clearnet.  Poi mi piace il fatto che qui posso creare un sito gratuitamente ed il fatto che tutti possano vederlo quando lo pubblico (ho più interazioni qui che nei siti che gestisco sulla clearnet...)... E poi in futuro vorrei creare delle app in javascript che si interfaccia ai db distribuiti di zeronet... Non credo che me ne andrò facilmente!\n\nIo non sono molto esperto nel creare siti o altro, ma potresti provare a creare un sito in cui tutti gli utenti (possibilmente italiani o che lo parlano) parlano in un gruppo tra di loro. Oppure uno in cui ci si scambia file ma in modo abbastanza sicuro e che funzioni bene! A me ZeroUpload non funziona :(",
				"added": 1580071967
			}
		],
		"3_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 6,
				"body": "Io andandoci ancora posso dire una cosa, sicuramente molti alunni non sanno che cos'è l'educazione ecc... , ma in molti casi (la maggior parte delle volte) i professori sono i primi a grattarsi i coglioni e a non tenere minimamente a bada gli alunni, poi alle udienze però si lamentano XD, mi fanno ridere.",
				"added": 1579987818
			},
			{
				"comment_id": 8,
				"body": "> [peppefail](#comment_12_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ): Pure io ancora vado a scuola e non posso che darti ragione. Il bello è che se cerchi di far stare zitti i compagni perché magari sei l'unico che vuole fare lezione vieni pure preso per il culo! Comunque spesso i prof. non è che non gliene frega, proprio non riescono a contenerli gli alunni che, più passa il tempo, più diventano rumorosi e irrispettosi rendendo impossibile agli insegnanti di fare lezione (lo si vede soprattutto tra la 1 e la 3 media e dal primo al 3 superiore, dato che il biennio di superiori è un periodo di \"scrematura\")\n\nConcordo pienamente!!!",
				"added": 1580232198
			}
		],
		"4_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 9,
				"body": "Di sicuro non ascoltate audio di Whatsapp o notizie a cazzo da Facebook, le cose non stanno magari migliorando tantissimo ma neanche peggiorando all'invero simile! Ricordatevi che solo perchè il corona virus viene dalla China, non tutti i cinesi sono infetti, quindi anche se ne vedete uno non dovete aver paura!!!",
				"added": 1580759800
			}
		]
	},
	"comment_vote": {
		"12_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": 1,
		"14_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": 1
	}
}