{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Порт что это и с чем его едят?",
			"body": "Я рядовой пользователь и новичок зеронета. Хочу заполнить её контентом. Оказывается мне нужен какой-то порт с роутера. Зачем? И что мне делать с этим портом?",
			"added": 1559325214
		},
		{
			"topic_id": 2,
			"title": "Пытаюсь создать сайт",
			"body": "Читаю доки.\nCreate new ZeroNet site¶\nEasy way: Using the web interface¶\nClick on ⋮ > \"Create new, empty site\" menu item on the site ZeroHello.\nYou will be redirected to a completely new site that is only modifiable by you!\nYou can find and modify your site's content in data/[yoursiteaddress] directory\nAfter the modifications open your site, drag the topright \"0\" button to left, then press sign and publish buttons on the bottom\nТак вот. Нету там никакого Create new, empty site. А скрипт на убунте 16.04 почему-то не работает. Так почему же?",
			"added": 1559361288
		}
	],
	"topic_vote": {
		"1_14F7aQfZ8Vq1cbnVrj7HybMy8MtWhwP7o2": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1_14F7aQfZ8Vq1cbnVrj7HybMy8MtWhwP7o2": [
			{
				"comment_id": 1,
				"body": "> [satoxyn1](#comment_20_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): Для эффективной работы любой P2P-сети и распространения контента в ней, каждый клиент в сети должен иметь возможность подключаться к другим клиентам сети. Если у вас «серый» (не «белый», не «реальный») IP-адрес или «закрытый» порт, клиенты не могут к вам подключиться, но вы можете подключаться к другим клиентам. Это снижает эффективность распространения контента: ZeroNet всё ещё будет корректно работать, но могут быть проблемы, например, с раздачей файлов в ZeroUp.\n> Если вы родились в 80-х, вы должны были застать звонки через коммутатора. Представьте, что ваш компьютер находится за коммутатором, и не имеет прямого номера телефона: вы можете звонить на прямые номера телефонов любому человеку, но вам обратно, с определившегося номера телефона, дозвониться без дополнительных действий не могут.\n\nТак что мне делать в этой ситуации?",
				"added": 1559361121
			}
		],
		"2_14F7aQfZ8Vq1cbnVrj7HybMy8MtWhwP7o2": [
			{
				"comment_id": 2,
				"body": "> [caryoscelus](#comment_60_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): А как вообще меню выглядит? Скрин можно?\n\nздесь нет возможности скрина",
				"added": 1559361755
			},
			{
				"comment_id": 3,
				"body": "Виноват. Нашёл где оно находится.",
				"added": 1559362010
			}
		]
	},
	"comment_vote": {
		"59_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1
	}
}