{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 19,
	"comment": {
		"1_1KKxs8n3eiPFEMmXBADVhJS5BZoPUey94z": [
			{
				"comment_id": 1,
				"body": "我觉得B相对理性。对于民众来说，一味追求推翻是不正确的。我们需要的是实质生活上的改善，以及阶级的相对公平。有些事情不是说推翻一个政权就可以改善生活的，推翻了也许会更加混乱，就好像是一个土匪山大王被另外一个土匪山大王赶下了台，当政的还是土匪。我们需要想办法改进生活，而不是推翻一个生活基础。",
				"added": 1511410979
			}
		],
		"1_1Pq3Pb5gFUmgjcZQEkUdTSSe4ZdrK1mNiL": [
			{
				"comment_id": 2,
				"body": "扯淡，这也就是你才刚刚悟出的道理",
				"added": 1514876038
			}
		],
		"6_147h7GviraDDnjn4QpkUeKm9oQKJyb5zHt": [
			{
				"comment_id": 3,
				"body": "鸡汤不毒能喝么",
				"added": 1515087141
			}
		],
		"13_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 4,
				"body": "哪座城？什么新闻？你把新闻链接或者事件贴出来，否则我都不知道你在说的哪件事情。",
				"added": 1515172767
			}
		],
		"30_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 5,
				"body": "我觉得这篇文章就从议论文而言是一篇范文，文章就应该这样敢说，敢写。先不说写的东西对不对，能够这么引章论据地讨论，就值得所有Zeronet上发帖地用户学习。\nP.S. 希望作者能添加一些展望的东西",
				"added": 1515447332
			}
		],
		"4_14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF": [
			{
				"comment_id": 6,
				"body": "这个样子的“叛国者”，手上确实是有点东西的，但是有的东西他都不致命，而且也能人为的掩盖其所谓的“真相”。这样的东西和没有其实是一样的。这种叛国者寻求一种政治庇护，如果手上没东西，或者有，但是一下子就拿出来了，就失去了生存的砝码，没人会庇护你。",
				"added": 1517805900
			}
		],
		"14_145kg9WZryLeefr2FuGERptM7frEf7ySGH": [
			{
				"comment_id": 7,
				"body": "这些都是扯淡，所有的端口都被屏蔽了你还拿什么上网？Zeronet，Tox都是建立在非常规端口进行联网的。",
				"added": 1520953614
			}
		],
		"175_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 8,
				"body": "> [zeronetimwulv](#comment_32_1CZg1ExEqw1DqjFD7ssKKHEXt4oY1ne8qJ): 傻逼玩意...人类的追求的自由永远都是不用工作就有钱...放在全世界都是一样...还鸡巴没有自由,人生下来就有自由，只是你承担不起这个自由的成本而已。。\n\n赞同。古人云，没有规矩，不成方圆。自由永远是相对的。完全的自由会导致混乱，适当的规则能让人类社会有秩序。即使是国外，也没有你想象的自由。如果觉得国外的民主国家就很自由的话，你会发现这其中的弊端也有很多。对于国家而言，只有适合的制度，没有最好的制度。生活的压力永远是阻止你想要自由的一个理由。",
				"added": 1522213649
			},
			{
				"comment_id": 9,
				"body": "> [360breakingwall](#comment_177_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV): 不要歪曲自由的含义，自由本身就是秩序，完全的自由就是完美的秩序。\n\n试问哪个国家拥有完美的自由？如果有这种类型的国家，请列举出来。",
				"added": 1522285136
			},
			{
				"comment_id": 10,
				"body": "> [mrc](#comment_98_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC): 五毛狗的见识的确只配做五毛狗，连自由是什么都不知道，还以为是不用工作就有钱。它们也不知道什么是伴随自由而来的做为人类的尊严。建议给五毛狗们看一下我零网站点里的德国宪法中保障的自由有哪些，如果不愿意看，那谁也救不了它脱离蒙昧的状态了。\n\n我尊重你的见解，也尊重你的观点，但是对话是建立在平等的基础上的。你一开始从心里就认为我是五毛狗，那我也没有办法。并且，任何一个国家的宪章存在的意义都是为了保障一些人类社会能够运行下去的规则，光是从这一点上，所谓“自由”已经是有所枷锁了。再者，宪法的保护并不意味着在现实中就能实现。任何一个国家机器在运作其自己创作的宪章时哪一个不是睁一只眼闭一只眼。一味的追求国外的所谓“幸福”也是一种愚昧的表现，这是不可取的行为。现实和生活在现代是相对高于主义和理想的。抛开现实的理想只不过是美丽的乌托邦而已。你可以选择自由的活，自由的死；世间的其他物种也可以，豺狼会去吃绵羊，鲜有动物会去可以保护孱弱的绵羊。人类世界的进步使人有能力去保护弱者，或者是伤害弱者。规则就是为了界定大部分的强者不去伤害弱者而诞生的，这种规矩的诞生不会一路顺风，也许会有很多牺牲，但也演化出了当前人类社会的规则。这样的演化虽然不一定正确，但也一定不会是无意义的。",
				"added": 1522285927
			},
			{
				"comment_id": 11,
				"body": "> [cdxjskhluey](#comment_88_1Ceg5F9KEWkCyTu3r1QBSuiU8C1PYsd8PJ): 人权宣言\n\n回应你之前，我必须声明，我并不认为专制国家好，也不认为明主国家差。我仅仅对于你所说的观点有些不一样的意见。\n1.《人权宣言》确实定义了自由，然而在“自由即有权做一切无害于他人的任何事情”之后（同一条内），还有一句“因此,各人的自然权利的行使,只以保证社会上其他成员能享有同样权利为限制。此等限制仅得由法律规定之。”这是不能遗忘的，也是不争的事实。\n2.“自由即有权做一切无害于他人的任何事情”，倘若不存在之后的那一句，这个无害于他人的事情如何界定？是由个人界定，还是有一套标准法来界定？不同的地域环境有不同的规则，每个人也有每个人的脾气。两个人发生冲突，一个人说自己没有做害人的事，另一个人说做了，标准是什么？谁来衡量正确与否？\n3.中国那些古人，确实不知道《人权宣言》。然而国外即使知道了又如何呢？《人权宣言》是在1789颁布的，之后的24年，英国奴隶贩卖才被定义为非法，即使如此，贩卖行为依旧猖獗。50年后，奴隶的拥有才被定义为不合法。如果你说英国不知道《人权宣言》也没关系。《人权宣言》的发源地法国在人权宣言诞生后的两年确实废除了奴隶制度，宣言诞生后5年，奴隶制又被重新设回，直到宣言诞生后的59年，奴隶制度才被彻底废除。即使是象征“自由”的美国，奴隶制的废除也在1861年之后才开始，之后依然对于黑人有很强烈的歧视。\n4.在相对狭隘的雅各宾派的《人权宣言》（全称《人权和公民权宣言》）之外，还有一部《世界人权宣言》是1948年12月10日在法国巴黎夏乐宫由联合国通过的，离中华人民共和国成立大约9个月。在此之前，发生过二战，一战。更久远些，在一战开始前的40年，法国还未脱离帝制，神圣罗马帝国也还未瓦解，仅仅用人权宣言去批判不同于一个时代的制度，是否过于偏颇？\n5.“世界上只有民主国家和专制国家，正常国家是民主的，保障自由的”，同样我可以说你是怎么认为正常的国家是民主的，不正常的国家是专制的呢？“但制度一定要保障自由，否则就是奴役老百姓的制度”这个自由的度又在那里呢？每个人对于自由的定义还是不一样的。说的狠一些，如果一个孩子生而被教育为“饿了找吃的是自由的”，在未经允许挖了农家种的食物被抓后，难道能用自由来进行辩护么？\n6.“ 国内国外本身是地域概念”这一点我同意，没什么好辩驳的。本身就只是地域不同，文化不同。\n7.没什么可以多说的了，对于你的观点，只有这一些可以提出辩驳。再次声明，我的回应只是观点之间的碰撞，并没有攻击的意思，如果你有不同的观点，也欢迎你提出来，但是还是那么一句，对话是建立在平等的基础上的，我尊重你的发言，因此我严肃认真地在查阅很多资料后回应了你的观点，如果你想回应我，也希望是建立在尊重我的基础上。谢谢。",
				"added": 1522288351
			},
			{
				"comment_id": 12,
				"body": "> [qinaa](#comment_9_1MN9ajexS6VndZdKszKhCrV7uzmWbigfE7): 我也说两句： [...]\n\n四大文明古国在历史的进程中，没有一国是诞生过人权宣言的。人权宣言的诞生是历史的偶然。之后的人听说了这个，觉得这个东西好，于是搬来借鉴，以作规矩。\n\n至于其他的，我赞同你的观点。",
				"added": 1522293426
			},
			{
				"comment_id": 13,
				"body": "> [360breakingwall](#comment_180_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV): 欧洲中世纪，近代英国诸殖民地，爱沙尼亚\n\n欧洲中世纪从来没有过你说的自由。君主立宪，和中国差不多。\n英国殖民地就更加不用谈了。印度至今还留有宗教等级制度，曾经的英国殖民地香港在那个时代也是黑帮横行，社会动荡。当时的秩序也并不由自由产生。\n爱沙尼亚是一个在历史上被反复占领的国家。且不说弹丸之地，易于管理。就今天而言，你可以说他先进，可以说它幸福指数高，但并不代表着就是个完全自由的国家。你依然是在少数人制定的法立法规制下生活。",
				"added": 1522334626
			}
		],
		"84_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 14,
				"body": "不知道，感觉很扯淡。政府不去管真正辣眼睛的娱乐节目，反而去取缔小众的娱乐网站。",
				"added": 1523373126
			}
		],
		"311_157kFKiaEbRUds2HCBUpv33t4Unezi6dR6": [
			{
				"comment_id": 15,
				"body": "应该是监管问题，国外似乎很流畅",
				"added": 1523373320
			}
		],
		"206_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 16,
				"body": "建议把标题改成德国法律课程",
				"added": 1523949541
			}
		],
		"366_157kFKiaEbRUds2HCBUpv33t4Unezi6dR6": [
			{
				"comment_id": 17,
				"body": "...恭喜你学到了一个新的知识点",
				"added": 1539182871
			}
		],
		"7_159WoHVCiWnZNsoAoP5y7SxCnXgAd29ANC": [
			{
				"comment_id": 18,
				"body": "当然不能，如果物理断网，就没有用。不过那一天可能来的不会特别快。",
				"added": 1542336508
			}
		]
	},
	"comment_vote": {
		"32_1CZg1ExEqw1DqjFD7ssKKHEXt4oY1ne8qJ": 1
	}
}