{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1522601837_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1542861175_1PkVAeJswTgCVG4MN6BZG7YdWpzgmek5WZ": 1,
		"1548974921_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7": 1,
		"1565330250_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U": 1
	},
	"next_comment_id": 30,
	"comment": {
		"1523080841_1467X2hmPQP5gAKnh9uhQX6M1DWCHqLbCG": [
			{
				"comment_id": 1,
				"body": "> [brc256](#comment_1_15kDcPDETQzCiW4hK6JoKcetzTFnMasmou): RT (Russia Today) is Russian troll fabric. Do not waist your time for promoting its shit here. Putin is a Leningrad gang. Nobody cares what gang thinks about his civilized opponents. I would prefer to find other sources if I wanted to now about US government, not RT, North Korea, Asad, or other pieces of shit. Don't talk about Russian government. There is no election in Russia therefore there's no legitimate government. The only interest of this 'government' is to steel more money and share them with there gang leader Putin. They do not love any country that respects law and justice. They can't. They will search for reason for conflict with them. If there were justice, not 'lack of democracy' in Russia, all your RT, 'government', and Mr. Putin would be in jail. Russia is aggressive, rotten country, trying to impose its illness to all world.\n\nGo back to bed Pelosi, you're fucking drunk.",
				"added": 1523130790
			}
		],
		"1541565435_15TSdTU5ZrAHXXiMQvMUEEUm17GFt5WqWp": [
			{
				"comment_id": 2,
				"body": "Hillary lost too but you idiots haven't been able to shut the fuck up about that for two years.",
				"added": 1541734133
			}
		],
		"1542861175_1PkVAeJswTgCVG4MN6BZG7YdWpzgmek5WZ": [
			{
				"comment_id": 3,
				"body": "Gab could've been good, but Andrew Torba is a fucking sperg who does nothing but pick fights with everyone like he has something to prove. Plus he's made it his mission to constantly antagonize silicon valley while using silicon valley platforms like Azure cloud because he's too cheap or too retarded to build his own server farm, then he acts surprised when they kick him off.\n\nNow he's aggressively posturing against a DA from Pennsylvania. The moron's going to end up in jail soon.",
				"added": 1542909653
			},
			{
				"comment_id": 4,
				"body": "> [dragonloli](#comment_2_1LKvJWu95ZQcLSBxRgf7cVuBnHyfrdgv7m): Decentralized social media can't be cucked the way gab was\n\nDecentralized social media like Zeronet have to be careful, though. Depending on how a zite is programmed it can be way too easy for an attacker to spam CP to it, and then the glow-in-the-darks have their excuse to track down and arrest everyone who's seeding it. Any decentralized social media site would have to be designed under the assumption that someone somewhere will want it destroyed and try to prevent this ahead of time.",
				"added": 1543298414
			},
			{
				"comment_id": 5,
				"body": "> [vorticalbox](#comment_9_13Dnn8CFKa8NJLf4gxnJTp8sXqYqrA9U7L): To me to seems like the bigger networks were trying to force out the competition.\n\nBecause it is. Not too long ago all these big tech companies were fined out the ass because it was discovered that they all collude on employee salaries so that they won't be forced to pay higher wages to get better engineers. They're the 21st century version of Standard Oil and US Steel, robber barons that need to be broken up.",
				"added": 1543638287
			}
		],
		"1544016906_14My3JH8xrxE1JPzECQZM6cCp4cEMx2WZX": [
			{
				"comment_id": 6,
				"body": "> [adotham](#comment_6_1P8TFEmsFJruqWErsBLpTxmpczHFW3raWF): Your religious bullshit isn't important, if Pakistan wants to kill her because of their backwards rules so be it\n\n*tips fedora*",
				"added": 1544073015
			}
		],
		"1557931740_1CVLeFVQw2wWbBdpM5PtQhtzd7wjKzB24b": [
			{
				"comment_id": 7,
				"body": "What was her name and how hard did she dump you?",
				"added": 1557978384
			}
		],
		"1564798399_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 8,
				"body": "Then get off your ass and do something yourself, you useless, blackpilling sack of shit.",
				"added": 1565054834
			}
		],
		"1565107716_152fY68b7kM9nj4ErMRzbP64dVtj21dngk": [
			{
				"comment_id": 9,
				"body": "> [styromaniac](#comment_838_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Make her blush with generalized compliments. Point out her pearly whites if they're super white, dimples, cute smile, etc.\n\nAll of those things are considered rape now.",
				"added": 1565138507
			}
		],
		"1565077480_1N86m5tuMjDQoXoocDpPVzY9dcRPC7MnuU": [
			{
				"comment_id": 10,
				"body": "> [qzvb](#comment_1_112qygFRivJWmQ4d9hfWf2Ns5yk2Jh1zDZ): Where's the place to go on Zeronet for anons? I see a couple different places but where's the main spot?\n\nThere is no main spot. Zeronet is like mid-2000s pre-social media internet, there's a bunch of smaller communities and people pick the ones they like and hang out there.",
				"added": 1565138711
			}
		],
		"1565142084_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": [
			{
				"comment_id": 11,
				"body": "Australian parliament voted no on a bill that just said it's ok to be white, fyi.",
				"added": 1565142749
			},
			{
				"comment_id": 12,
				"body": "> [chinkalinka](#comment_16_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP): every parliament in the western world is cucked, doesn't reflect the people however\n\nIrrelevant, they're the ones who set the laws. At least half (probably even more) of the people in the US aren't ok with trannies or faggots, but now everyone is forced to put up with them because the High Council of Nine said so.",
				"added": 1565142986
			},
			{
				"comment_id": 13,
				"body": "> [chinkalinka](#comment_19_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP): What's the solution brah?\n\nStay and fight for your homeland, whatever that may be. Running away to somewhere else makes you no better than the \"refugees\" shitting up your country.",
				"added": 1565143350
			}
		],
		"1565144688_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 14,
				"body": "> [styromaniac](#comment_852_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): but users leave themselves exposed to illegal content like child pornography\n\nHow's that any different from Instagram?",
				"added": 1565145908
			},
			{
				"comment_id": 16,
				"body": "> [nickwa](#comment_192_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): I don't think ZeroNet is \"underground\" anymore. Its all over the internet right now.\n\nWhat's the over/under on the creator (forgot his handle) making a virtue-signal announcement about Zeronet \"not being a place for hate\" in the next day or two?",
				"added": 1565146967
			},
			{
				"comment_id": 17,
				"body": "> [nickwa](#comment_194_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): It wont even matter if he says it or not.\n\nI know it won't matter, I'm just curious how cringy it'll be. Megacucked or just supercucked?",
				"added": 1565147116
			}
		],
		"1565145631_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": [
			{
				"comment_id": 15,
				"body": "He flat out said that he didn't about a year ago. When Zeronet started taking off people volunteered to help but he said he didn't need any because he got a bunch of funding from some unnamed source.",
				"added": 1565146341
			}
		],
		"1565148747_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": [
			{
				"comment_id": 18,
				"body": "Works on my machine, faggot.",
				"added": 1565149069
			},
			{
				"comment_id": 21,
				"body": "> [shy](#comment_7_1E6tCCUJTK8L9c6mQygDB74yzmBrmvxLVq): I cant get 08chan to work at all just see a logo but millchan works fine check out /rs/ runescape gamers\n\n08chan was cloned from an earlier and much buggier version of Millchan. Millchan works great after months of bug fixes, but the 8chan refugees chose the other site so w/e.",
				"added": 1565149740
			}
		],
		"1565148429_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 19,
				"body": "The others were just that era's version of clickbait. 8chan is different, the powers that be are systematically wiping out every site that helped get Trump elected. It's not a coincidence that the closer we get to 2020 the more these takedowns are ramping up and getting fiercer. They only want approved messages getting out once the dem nominee is chosen and the campaign goes into full swing.",
				"added": 1565149275
			},
			{
				"comment_id": 20,
				"body": "> [nickwa](#comment_203_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Honestly, they are going to get Trump elected themselves. I am not joking when they are even bashing Obama now.\n\nIn a fair race Trump would win easily, but it's obviously anything but. The republitards already proved in 2018 that they won't stand up to obvious vote fraud, so in 2020 get ready for the counting in swing states to last three days while they keep \"finding\" more ballot boxes that go 99% dem.",
				"added": 1565149664
			}
		],
		"1565095300_1PnHUGmQkYq4NKZBxFp8o1Wb1ZZijeeYvF": [
			{
				"comment_id": 22,
				"body": "> [bober](#comment_4_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6): disobeying the law is illegal. nuff said\n\nWhat an absolute 20IQ post.",
				"added": 1565150022
			}
		],
		"1565292753_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": [
			{
				"comment_id": 23,
				"body": "\"do you think that it will also get non-8chan users to join as well?\"\n\nI doubt it. The only reason to use Zeronet over the clearnet is if you're into decentralization, and shit like Walmart, Amazon, Facebook, Reddit and 4chan prove that most people don't give a shit about that.",
				"added": 1565305232
			},
			{
				"comment_id": 24,
				"body": "> [aspidochelone](#comment_17_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z):  The problem with \"Chans\" is they have only a few topics and they disappear in no time\n\nThat really only applies to 4chan because it's been flooded by retards that just want to spam wojack images. Threads on smaller chans tend to stay up for a long time.",
				"added": 1565323282
			}
		],
		"1565330250_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U": [
			{
				"comment_id": 25,
				"body": "I had that problem yesterday. I had to delete the entire user folder and start over.",
				"added": 1565330828
			},
			{
				"comment_id": 26,
				"body": "What version of Zeronet are you guys running? I had nothing but problems when I updated to 0.7 (first version to use python 3) from the Zeronet site for a few hours. I downgraded back to 0.6.5 (uses python 2) and everything's been working smoothly since. I even had a clean transition to a ZeroID. Downgrading might be worth trying if you've exhausted all other options.",
				"added": 1565397247
			},
			{
				"comment_id": 27,
				"body": "> [saythenword](#comment_13_1PK8e7ccdA28Xi8mDbmZd6SLQSgZaxDAzg): Could someone who CAN post echo this post into the sticky for me so the BO sees it?\n\nI posted the error in the /v/ sticky as well as the thread on Millchan where people were helping with the spam issue last night. Hopefully someone can help.",
				"added": 1565413559
			},
			{
				"comment_id": 28,
				"body": "> [kaffie](#comment_962_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Why would you use 08chan when it's so clearly inferior?\n\nThe only reason I use 08chan is because that's where everyone went. I'd much rather be using Millchan Merger, but most people aren't going to bother migrating a second time unless the 08 admin does what the 0chan admin did and just shut the whole site down with a link to Millchan Merger in its place.",
				"added": 1565457251
			}
		],
		"1565457997_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1": [
			{
				"comment_id": 29,
				"body": "Millchan Merger:  http://127.0.0.1:43110/17gCoQDCAAoQkzKRiajFNUAhnVD2gSNmuC/\nExample board:  http://127.0.0.1:43110/13kifcv8J8noDEXdztXY4qkPPPKLK2PiAe/\n/a/ - http://127.0.0.1:43110/1D23TdnwuQUwNcz5at3m6kyc6Wp1BC4dei/\n/b/ - http://127.0.0.1:43110/17wWFMe7AyJx4qvFLfoepvQnGHTfcPG8N9/\nZeronet board:  http://127.0.0.1:43110/1N5WZ2QNXBKfhyhpktRZr2DE91QBJf7QDB/\n\nVisit the main Millchan Merger site in the first link. It will be empty at first because you haven't visited any other board hubs. Then visit each of the other links. You'll see a blank page with an error saying to visit the board in Millchan Merger. That board will now be populated in the main Millchan Merger site if you go back to it (the first link). This is how you populate your Merger site. Every board on Millchan Merger is actually an entirely separate site, and the Main Millchan Merger site just aggregates them for you. Using this engine you can, for example, seed all of /a/ without seeding anything in /b/ if you don't want to.\n\nVisiting boards on the normal Millchan site will NOT add them to your Millchan Merger site, only boards that were created from the merger engine.\n\nHere's how to crate your own board on the Millchan Merger site:\n\n1. go to ZeroHello or reload (F5) your already opened ZeroHello\n2. into the site list filtering field, type: 13kifcv\n3. move the mouse cursor over the Millchan Hub menu item and on the right, click the three dots. Then click \"Clone\"\n4. copy the newly opened address of your hub to the safe place (possibly good to find your site address in zeronet/data/users.json and backup also related entries like private key)\n5. open site menu (swipe the button in the top right corner to the left) and scroll down and set SITE TITLE, SITE DESCRIPTION (possibly do not use diacritics, special characters)\n6. in the same site menu scroll up and click OPEN SITE DIRECTORY kind of option. You may backup all your site files here and then modify index.html to customize your site text.\n7. then open file data\\users\\content.json and you can add other file types support here and raise \"max_size\" value to give your users more disk space. Default 5000000 (5 million bytes) is 5MB\n8. if you made any modifications to the data/users/content.json, go to your site menu again, scroll down, click data/users/content.json link and \"Sign and publish\" button. (\"Content publish failed.\" should not be a problem as the hub may have no peers yet)\nDo the same signing and publish for the content.json if you modified index.html.",
				"added": 1565458481
			}
		]
	},
	"comment_vote": {
		"1_1GQEGSbb1piX5SihGbnVj7t6ypArWjaFDM": 1,
		"26_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"14_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": 1,
		"1_1LKvJWu95ZQcLSBxRgf7cVuBnHyfrdgv7m": 1,
		"309_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"496_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"9_13Dnn8CFKa8NJLf4gxnJTp8sXqYqrA9U7L": 1,
		"9_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"4_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"1_1HeGQCWuYPAEhP1CreARjJkHpGTwSoKjee": 1,
		"2_172eadN1HangnEjrnwbCgmcuCQA78KuhQr": 1,
		"2_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx": 1,
		"8_1E6tCCUJTK8L9c6mQygDB74yzmBrmvxLVq": 1,
		"2_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH": 1,
		"3_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH": 1,
		"957_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"966_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"967_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"969_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"976_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"886_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"18_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": 1
	}
}