{
    "issues": [
        {
            "title": "Search functionality",
            "body": "Hello,\n\ni just wanted to express what i am looking for in ZeroBlog.\n\na search field (or a button that will show the search field) that will search all blog post titles and content",
            "date_added": 1518004610430,
            "open": 1,
            "reopened": 0,
            "tags": "feature",
            "id": 0
        },
        {
            "title": "Import / export",
            "body": "Hello,\n\ni have some wordpress based blogs and a vbulletin, phpbb based forum on clearnet\n\ni was always thinking to export it into zeronet, but not yet started because it is not easy for me build script that will shape the dynamically (PHP) built pages into some clean text output. There is no zeronet full-text search engine yet, so the zerotalk or zeroblog may be used to store my content, but these do not yet have [search functionality](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/view/?1M5dciFFSWt4wKs9Nnxa34BgGnt7os7h3v/0@1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS) and i see no noob friendly way to import my content.\n\nSo i was thinking if ZeroBlog can have some form where it will guide noob user with importing.\n\nTwo possible ways\n\n**METHOD 1**: user will be able to upload file (or archive of a files) and it will process it and according to mine defined rules import it.\n\nBy rules i mean i example define leading and ending string that appears in all files, the string that defines post title. Then string from/to which the post content will be extracted from files.\n\nAnother side of the import would be to convert html tags (a, strong, underline, img) into zeroblog supported syntax:\n\n< a href = \" http://domain.com \"> domain < / a> -> [ domain ] ( http://domain.com ) - html and wordpress\n\n[url=http://domain.com]domain[/url] ->  [ domain ] ( http://domain.com )  - phpbb\n\n[url=\"http://domain.com\"]domain[/url] ->  [ domain ] ( http://domain.com )  - vbulletin\n\n**METHOD 2**: (more compatible and universal): system will guide user thru importing MySQL database. Every database is different. System will ask which table contains data to import, which column is new post title, which column should be post text. Then it will ask what is the syntax of mysql data (does it contain html or a forum/bulletin board syntax like ([url=http://...]text[/url]) ?)\n\nThe zeroblog should then contain functions to bulk search and replace if anything go wrong or function to bulk delete posts from some date range/from recent import..\n\nWordpress (clearnet blogging CMS) also has built-in export feature: https://wordpress.stackexchange.com/questions/82399/what-is-the-required-format-for-importing-posts-into-wordpress",
            "date_added": 1518006521636,
            "open": false,
            "reopened": 0,
            "tags": "feature",
            "id": 1
        }
    ],
    "next_issue_id": 2
}