{
	"title": "OceansToBlue\n",
	"description": ".",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 6,
	"demo": false,
	"modified": 1457743909,
	"post": [
		{
			"post_id": 5,
			"title": "\"All My Demons Greeting Me as a Friend\" de AURORA",
			"date_published": 1457742897.65,
			"body": "![image alt](img/entradas/aurora.jpg)\n\nAurora es una cantante de Bergen, Noruega, tiene 18 años y este es su primer disco.\n\n> Aurora Aksnes is a 18 year old girl from Bergen, Norway. She strives to write music that can inspire people, through idiosyncratic tales of struggle, love, and all that lies in between.\n\n**Setlist:**\n1. Runaway\n2. Conqueror\n3. Running With The Wolves\n4. Lucky\n5. Winter Bird\n6. I Went Too Far\n7. Through The Eyes Of A Child\n8. Warrior\n9. Murder Song (5, 4, 3, 2, 1)\n10. Home\n11. Under The Water\n12. Black Water Lilies\n13. Half The World Away\n14. Murder Song (5, 4, 3, 2, 1) (Acoustic)\n15. Nature Boy (Acoustic)\n16. Wisdom Cries\n17. Running With The Wolves (Pablo Nouvelle Remix)\n\n**iTunes:** [Links](https://itunes.apple.com/us/album/all-my-demons-greeting-me/id1065985699)\n**Escuchar en Spotify:** [Links](https://play.spotify.com/album/6YMSXPIHkA2jPIlFHuejXW)\n\n\n\n\n"
		},
		{
			"post_id": 4,
			"title": "\"El hombre en el Castillo\" de Philip K. Dick",
			"date_published": 1457737872.977,
			"body": "Un novela ucrónica, en donde los Nazis ganaron la Segunda Guerra Mundial . El mundo esta bajo una Guerra Fria entre el Imperio Japonés y el Imperio Nazi.\n\nLa novela transcurre en los Estados Unidos, 15 años después de que las fuerzas del Eje (Alemania, Italia y Japón y sus aliados) hayan derrotado a los aliados en la Segunda Guerra Mundial. En este mundo alternativo, el antiguo territorio de los Estados Unidos ha sido dividido en tres partes, ocupando su costa este fuerzas alemanas y la costa oeste fuerzas japonesas, ubicándose en medio una franja de estados neutros.\n\n![image alt](img/entradas/hombrecastillo2.jpg)\n\nVale la pena leerla, el mundo alternativo creado es inmersivo y entretenido.\n"
		},
		{
			"post_id": 3,
			"title": "\"¡Oh Capitán! ¡Mi Capitán!\" de Walt Whitman",
			"date_published": 1457736244.143,
			"body": "¡Oh, capitán!, ¡mi capitán!, nuestro espantoso viaje ha terminado,\nla nave ha salvado todos los escollos,\nhemos ganado el premio que anhelábamos,\nel puerto está cerca, oigo las campanas, el pueblo entero regocijado,\nmientras sus ojos siguen firme la quilla, la audaz y soberbia nave.\nMas, ¡oh corazón!, ¡corazón!, ¡corazón!\n¡oh rojas gotas que caen,\nallí donde mi capitán yace, frío y muerto!\n\n¡Oh, capitán!, ¡mi capitán!, levántate y escucha las campanas,\nlevántate, por ti se ha izado la bandera, por ti vibra el clarín,\npara ti ramilletes y guirnaldas con cintas,\npara ti multitudes en las playas,\npor ti clama la muchedumbre, a ti se vuelven los rostros ansiosos:\n¡Ven, capitán! ¡Querido padre!\n¡Que mi brazo pase por debajo de tu cabeza!\nDebe ser un sueño que yazcas sobre el puente,\nderribado, frío y muerto.\n\nMi capitán no contesta, sus labios están pálidos y no se mueven,\nmi padre no siente mi brazo, no tiene pulso ni voluntad,\nla nave, sana y salva, ha anclado, su viaje ha concluido,\nde vuelta de su espantoso viaje, la victoriosa nave entra en el puerto.\n¡Oh playas, alegraos! ¡Sonad campanas!\nMas yo, con tristes pasos,\nrecorro el puente donde mi capitán yace,\nfrío y muerto."
		},
		{
			"post_id": 1,
			"title": "¿El ser humano tiene una misión que cumplir en su vida?",
			"date_published": 1433033779.604,
			"body": "Definimos ser humano como un ser vivo que adquiere a lo largo de su vida la razón, prejuicios, convicciones, valores y una concepción de mundo variable.\n \nMisión como objetivos que tiene un medio que son los momentos para poder llegar a la plenitud. Vida como periodo de existencia que abarca desde la concepción hasta la muerte de un ser vivo. Plenitud es la cúspide del desarrollo en la vida de un ser humano. Momentos son situaciones que se presentan en la vida de cada ser humano, para producir cambios deben ser significativos.\n\nSí, el ser humano tiene  una misión que cumplir en su vida, porque esa misión le permite al ser humano llegar a la plenitud. Los momentos que experimentamos y de cómo los abordamos podemos sacar cosas positivas, negativas o neutras, estas las sumamos a las bases que ya teníamos formadas o derribando algunas. Estas bases son donde nos sustentamos para todo, es nuestra concepción del mundo que es reformable, nos lleva a cambiar de punto de vista y cambiar de sentido. \n\nLos momentos que se experimentan deben ser significativos para poder producir un cambio en el ser humano, en sus bases. Los momentos son el medio que nos permite llegar a la plenitud, pero no todos los seres humanos logran la plenitud en su vida, ya que en los momentos que abordan no extraen elementos, los dejan pasar por alto, lo que no les permite avanzar en su misión y quedarse estancados, por este motivo lo ideal es detenerse y analizar lo sucedido, tener la voluntad de hacerlo.\n\nEl ser humano cuando nace tiene carencias en comparación con los animales o plantas ya que estos últimos son seres que cuando nacen ya están terminados bilógicamente. En el caso del ser humano este se va formando en lo que avanza en su vida, se hace así mismo, tiene que cubrir sus carencias, superar su inadaptación al ambiente. Por eso es realmente importante aprovechar los momentos que se presentan en la vida de cada ser humano.\n\nLa vida es el periodo de tiempo en donde no está definida su duración, esta vida presenta momentos que están compuestos de elementos positivos, negativos y neutros. Lo momentos deben ser analizados para extraer dichos elementos que los podemos añadir a nuestras bases o intercambiarlos por otros para seguir formándonos nosotros mismos, cuando este se logra podemos establecer que hemos llegado a la plenitud. \n"
		}
	]
}