{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1567443013_1GXk4TA4QQHcusYZYYVsEASvirkhnYa8Vh": [],
		"1567424767_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx": [
			{
				"comment_id": 2,
				"body": "katian\n\nIt's simple after uploading the video you have to get SEED from my file, otherwise it may not be available for other people to download, they will click on the video, but it will not appear.\n\nUnless you had enough time for other people to download the full file from you and THEN they will be seeds from the file as well.\n\nBut remembering that the system of zeronet, works almost the same or better in this part is equal to torrent, the file will only be available while you have someone with it online, keeping it alive.\n\n======================================================================\n\nÉ simples depois de enviar o video tu tem que fica de SEED do eu arquivo, se não ele pode não estar disponivel para outras pessoas baixarem,  ela vão clicar no video , mas o mesmo não vai aparecer.\n\nA não se que tu tenha ficado TEMPO SUFICIENTE para outras pessoas baixarem o arquivo completo de ti e dai ELAS vão ser seeds do arquivo também.\n\nMas lembrando que o sistema da zeronet, funciona quase igual ou melhor nesta parte é igual ao torrent,  o arquivo só estará disponivel enquanto tiver alguém com o mesmo online , mantendo-o vivo.",
				"added": 1567458456
			},
			{
				"comment_id": 3,
				"body": "there is of course to be seed / allowing others to download the file from you, just leave zeronet open, no need to leave the browser or tab on the site.\n\nOf course this after sending the file right.\n\n=========================================================================\n\nhá e claro para ficar de seed  / permintindo que os outros baixem o arquivo de ti, BASTA deixar a zeronet aberta, não precisa deixar o navegador ou aba no site.\n\nClaro isto depois de enviar o arquivo né.",
				"added": 1567458654
			}
		]
	},
	"comment_vote": {}
}