{
	"posts": [
		{
			"id": "0188815e-c312-4638-b2ff-549c1c9c83fa",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Hong Kong",
			"body": "https://archive.is/Xjbgx\nhttps://archive.is/hpRFP\n\nChinks move troops into Hong Kong, Tiananmen square incoming.\n\n>quoted an army major as telling the newly stationed troops: “This time the task has a glorious mission. The responsibility is great. The job is difficult. The time for a true test has arrived\"",
			"time": 1567148471215,
			"files": "[{\"name\":\"hong-kong-china.jpg\",\"thumb\":\"be8cb48e41b67c7bbd48463766a181a2a403d9b8-thumb.jpg\",\"size\":65747,\"type\":\"image/jpeg\",\"original\":\"be8cb48e41b67c7bbd48463766a181a2a403d9b8.jpg\",\"directory\":\"15uXDCC8pjPpGGMz8DZiNC2mPyqBWN2wuj\"}]"
		},
		{
			"id": "05143814-5809-4ad9-b7a9-85692d91b8a6",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "0188815e-c312-4638-b2ff-549c1c9c83fa",
			"body": ">>3af8094f-af8b-4349-9488-8aab21ddfd74\nThe very existence of communists is abominable in and of itself, the US doesn't need to help that.",
			"time": 1567195521886,
			"files": "[]"
		},
		{
			"id": "012cf026-194f-4bfe-ba06-822a3fcb90fd",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "ae61f59d-75fc-4817-a75c-dbfcf857e904",
			"body": ">>d50364c3-a168-4b29-b33a-21c500192355\nOf course they don't care. They're in Mark's bunker in the first place. Nobody but an uncaring little sheep would willingly subject himself to a site where he's not just a BO, he's the admin.  \n\n>>ae61f59d-75fc-4817-a75c-dbfcf857e904\n>Worst BO (possibly bar the /leftypol/ one) is secretly wageslave of site owners\nI'm not particularly surprised. Assuming 8chan ever comes back, it's just a matter of time until such a constellation produces a new GG-like exodus.",
			"time": 1567575178400,
			"files": "[]"
		},
		{
			"id": "7786b4d5-501c-4dc3-a0e0-e81d4da8f14b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "8fd34724-1136-4992-8b39-45434706b9bc",
			"body": ">>8fd34724-1136-4992-8b39-45434706b9bc\n>>Creating an \"emergency mode\" for the site in which boards will be made read-only in the event of a happening, stifling actual discussion during critical moments with TOR users being blocked from even viewing the site\nThe eternal boomer strikes again. Never trust them. \nThis utterly and completely fucks 8chan. Whenever something happens that people will want to talk about, the site will be shut down. This is literally the same response as m00t showed to GG back before anyone with any brains left halfchan and it became the new reddit, reddit became the new tumblr, and tumblr became a cosmic horror.",
			"time": 1567706317655,
			"files": "[]"
		},
		{
			"id": "7679ba7c-0543-40c1-ac89-bc93a403dc6d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "b24efb34-fa0a-4ca3-a05a-1ab8f16f3b2a",
			"body": "Here's the archboomer's testimony.  \nTL;DR: 8chan's fucked.  \nIt's only going back online after there's tools to shut down discussion in case of a happening by locking entire boards. Jim also (((looks forward to working with the federal government))). Better get comfortable here, we're in for the long haul.",
			"time": 1567707171492,
			"files": "[{\"name\":\"Jimbo's Testimony.pdf\",\"size\":138188,\"type\":\"application/pdf\",\"original\":\"386fb767c8749ff9f77e533981bd283129026153.pdf\",\"directory\":\"15uXDCC8pjPpGGMz8DZiNC2mPyqBWN2wuj\"}]"
		},
		{
			"id": "de16bf26-61c7-47e3-9b63-98d4d1653a78",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "b24efb34-fa0a-4ca3-a05a-1ab8f16f3b2a",
			"body": ">>cfbf6afc-b832-4494-bc45-ca9604bdfc12\nSo at the time when we want to post the most, we won't be able to. They've killed the most interesting threads of all, which weren't even illegal to start with.  \nIf it was illegal to laugh at mass shootings, or to be fans of mass shooters, then half of Tumblr would be in prison right now. Fuck boomers with their blind obedience to what law enforcement tells them.",
			"time": 1567751153961,
			"files": "[]"
		},
		{
			"id": "d0e46b32-896c-436e-8f5b-63a4844e650a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "3adecd8e-42ce-45b5-b939-16130d6f2453",
			"body": ">>3adecd8e-42ce-45b5-b939-16130d6f2453\nCooperation with legitimate law enforcement requests if pretty much a necessity to keep a site up on the clearnet. The question is if Jim actually required the anal attention to detail in the proceedings he should have, and if he minimized the logs he kept as he should have. I don't quite trust him on either, he's too eager about the government.  \nAnyway, we've got a better, more free option here, so I suggest we try to recruit more people to here instead of going back to an even more fed-riddled site than before.",
			"time": 1567764824407,
			"files": "[]"
		},
		{
			"id": "e837e687-99ef-4b73-b5e6-3a885fc992ee",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "3adecd8e-42ce-45b5-b939-16130d6f2453",
			"body": ">>3541ec26-689f-48cc-818f-1b8da548b2b8\n>Correlation between multiple posts, combined with internet traffic data? Would it be prudent to occasionally delete your ZeroNet and do fresh install?\nAssuming you aren't stupid enough to let slip anything about your RL anywhere, it's probably overkill to do it regularly.\nThe state isn't going to try and find a random shitposter by trying to correlate posts and data sent through TOR. Only really necessary if you're Assange, Bradley Trannings, somebody of that caliber. To go through all that work, they must really want you, specifically.",
			"time": 1567767002107,
			"files": "[]",
			"last_edited": 1567767796807,
			"subject": null,
			"capcode": null
		},
		{
			"id": "024ba1ec-9fea-45b5-80d7-8eb9373576d4",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "58e4cd84-8fd5-4ccf-8569-1e5ef7c3a22e",
			"body": ">>58e4cd84-8fd5-4ccf-8569-1e5ef7c3a22e\nFunny how the first thing that comes to the mind of congress when they see people going on rampages because they have niggers and spics and mudslimes forced into their society, have the social contract of their society effectively disbanded because muh feminism and muh multiculturalism is that it must've been Russia.  \nNah, the US managed to fuck itself well enough on its own. Well, maybe with a little help from our (((greatest ally))).",
			"time": 1567849793158,
			"files": "[]"
		},
		{
			"id": "87a54ec0-9ec8-4d7f-a782-8c096bfb5c18",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "688a2cf7-fbe8-4f0a-81e9-dc7932008334",
			"body": ">>688a2cf7-fbe8-4f0a-81e9-dc7932008334\nZeroNet's design is kinda meh. Too much reliance on Javascript, and its anonymization option of Tor isn't designed for P2P.  \nIf they'd gone with something based on pure html and I2P, it'd probably be more popular on /tech/. I'm also just here because it's the least shit option currently because all the others aren't quite there yet.",
			"time": 1567985476621,
			"files": "[]"
		},
		{
			"id": "5b46eac2-2b65-4ce0-a000-14a1f21e6cbe",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "8f37924f-e148-4a26-8bfc-3591fc5f5343",
			"body": ">>539e171c-6d4c-4c43-be61-69f846ef4a5c\n>Where I am from, that is considered an especially savage way of thinking, if not a front for evil designs.\nYou do have noticed that you're on /pol/, right? The average view here is that any demographic which is inferior shouldn't just be enslaved, it should be exterminated.  \nThe law of nature is that the strong (read: capable) rule the weak (incapable). The idea that slavery is somehow evil is in itself evil because it perverts nature and weakens everyone as it allows those that should never be near anything close to power, women, negroes, muslims, etc., to infiltrate proper civilization instead of being where they're supposed to be: Below the lowest of the low, with no self-determination, their every action guided by their betters. In short: Property.",
			"time": 1568111447505,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}