{
	"title": "Alotaplot's Hentai Talk",
	"description": "Hentai manga reviews.\nLinks to manga galleries will only work if you've added [Alotaplot](/1G8VWDQc5fXLkRiijJB4EZerDLmDVY75MZ) to your ZeroNet zites.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 5,
	"demo": false,
	"modified": 1619218581,
	"post": [
		{
			"post_id": 4,
			"title": "11 Ongoing Pornhwa To Check Out",
			"date_published": 1619217069.601,
			"body": "I thought I'd post a short list of the pornhwa whose new chapters I anticipate most.\n\n## Theme 1: MC And His Bully\n\n### Learning The Hard Way\n\nMC becomes the home tutor of his bully, but she thinks studying is boring and would rather have sex.\n\n### The Ark Is Me (aka Excuse Me, This Is My Room)\n\nMC is an errand boy for his bully, one day he spends her college funds on a cryptocurrency investment and she's forced to move into his apartment.\n\n### My High School Bully\n\nMC has a gigantic dick and although many try no girl can fit his dick inside. A girl from his high school who used to bully him over his big dick got into the same college and she's warming up to the idea of giving it a try as well.\n\n### Repeater (aka Unlucky Girl)\n\nMC trades his university place for sex, but he gets conned. One year later he gets into the same university and he's looking for revenge.\n\n### Queen Bee\n\nMC\n\n## Theme 2: Comedic Nonsense\n\n### The Girlfriend Dice\n\nMC\n\n### Collapse & Rewind\n\n### Touch On (aka Touch To Unlock)\n\n## Theme 3: Comedic Nonsense\n\n### My First Time Is With ... My Little Sister?\n\n### Committee Chairman, Didn't You Just Masturbate In The Bathroom? I Can See The Number Of Times People Orgasm\n\n### Fucking My Niece At The Girls' Pajama Party"
		},
		{
			"post_id": 3,
			"title": "Top 20 \"Best\" Pornhwa",
			"date_published": 1618866942.677,
			"body": "For fun I'll be going through these 20 pornhwa that were deemed to be the best by Hanumanth Reddy at AnimeUkiyo. Whenever I finish one I will add a short review together with a verdict to this post.\n\n* * *\n\n# 1\\. Drug Candy\n\n![drug-candy.jpg (1140x570)](data/img/post_3_drug-candy.jpg)\n\n> There are no words to define how this manhwa affects you emotionally. It sure is an adult manhwa, but besides being an erotic story, the ending is truly amazing, or I should say, the **author conveyed the reality** rather than making it another regular finish.\n> \n> **Seung-gu** is a hardworking person with a beautiful wife and a good job. But his personal life gets affected as he receives a demotion at work. The distance between both wife and husband grows continuously.\n> \n> At this point, **he meets a young woman named Han Yura** as he gets to know her a little and somehow ends up addicted to her.\n> \n> Soon he realizes that his mistakes cannot be corrected so easily. It is one of the best adult manhwa/adult webtoons of all time.\n\nStatus: **Complete**\n\n[➔ Read _**Drug Candy**_ on ZeroNet](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/wasm/?!/g/126Temra5S4SmEpt1DVcxy1nhEJBhyUPvr/yihyeonmin_drug-candy_EN)\n\n# 2\\. Lust Awakening\n\n![lust-awakening.jpg (1140x570)](data/img/post_3_lust-awakening.jpg)\n\n> **Emma** leaves his hometown and girlfriend to work as a caretaker in another city. His girlfriend worries that he might change after moving there.\n> \n> Here comes the plot twist as the hirer distrusts men and unfortunately hired Emma as his name sounded feminine.\n> \n> She gives him a week to prove his worth, or he will get fired. And there is also another condition: not to make any move on her two precious daughters.\n> \n> But both girls have lived their life without seeing men, and what if their Lust awakens now? And **can Emma resist these hot chicks so easily?**\n\n*   Status: **Complete**​​​​​​​\n*   Artwork: 9/10\n*   Story: 7/10\n\n[➔ Read _**Lust Awakening**_ on ZeroNet](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/wasm/?!/g/126Temra5S4SmEpt1DVcxy1nhEJBhyUPvr/dokuhaku-heung-keon-kim_lust-awakening_EN)\n\n# 3\\. Lady Garden\n\n![lady-garden-1.jpg (1140x570)](data/img/post_3_lady-garden-1.jpg)\n\n> Just imagine yourself surrounded by **a bunch of hot women who depend on you** all the time and also takes care of you by helping you with your desires.\n> \n> When **Kang Doo** gets banned from a UFO competition, he joins as the security guard in a Luxurious mansion known as **Lady Garden**. As the name suggests, the mansion only permits hot and beautiful women.\n> \n> But these women face many problems in their daily life, and Kang Doo has to protect them. Of Course, these women are grateful to him and rewards him regularly for his bravery.\n\nStatus: **Complete**\n\n[➔ Read _**Lady Garden**_ on ZeroNet](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/wasm/?!/g/126Temra5S4SmEpt1DVcxy1nhEJBhyUPvr/zilpung-studio_lady-garden_EN)\n\n# 4\\. Brawling Go!\n\n![brawling-go.jpg (1144x574)](data/img/post_3_brawling-go.jpg)\n\n> **Brawling Go!** is one hell of a funny adult manhwa in this list. It describes the life of a person with abnormal erection defects and presents it hilariously.\n> \n> **Jaejin** can’t keep his erection for a long time, and in an accident, he somehow undergoes a significant transformation.\n> \n> But the real challenge is, once he goes under erection, he struggles to make it go down.\n> \n> With his **constant erection**, he has to deal with his life, and especially when his life fills with women.\n\nStatus: **Complete**\n\n[➔ Read _**Brawling Go!**_ on ZeroNet](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/wasm/?!/g/126Temra5S4SmEpt1DVcxy1nhEJBhyUPvr/worin_brawling-go_EN)\n\n# 5\\. Perfect Half\n\n![perfect-half.jpg (1144x574)](data/img/post_3_perfect-half.jpg)​​​​​​​\n\n> **Perfect Half** is an excellent manhwa to start with if you’re willing to get into adult manhwa fandom. You’ll find yourself in a world where wolves and foxes rule the world.\n> \n> In this world, both wolves (men) and foxes (females) are equal, and the only way they can win over the other one is through expressing their **domination through intercourse**.\n> \n> Most importantly, they fight to protect their freedom. In this battle of intercourses, who’ll win? Is there salvation for it?\n> \n> We’ll leave it to your imagination, but it is one of the best adult manhwa/adult webtoons out there. Make sure you read it at least once.\n\nStatus: **Ongoing**\n\n[➔ Read _**Perfect Half**_ on ZeroNet](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/wasm/?!/g/126Temra5S4SmEpt1DVcxy1nhEJBhyUPvr/luv-p_perfect-half_EN)\n\n# 6\\. Wet Women\n\n![wetwoman.jpg (1144x574)](data/img/post_3_wetwoman.jpg)\n\n> Just as the title implies its eroticism, **this manhwa is incredibly erotic** and filled with adult content. The art style makes it even more exciting because it is on point.\n> \n> **Hye Juri** works as a delivery girl for a sales company. It’s not just for her living, but there is another reason.\n> \n> She tends to find a man who can satisfy her desires. But **can she find the perfect man for her?**\n\nStatus: **Complete**\n\n[➔ Read _**Wet Women**_ on ZeroNet](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/wasm/?!/g/126Temra5S4SmEpt1DVcxy1nhEJBhyUPvr/sperm-king_wet-women_EN)\n\n# 7\\. H-Mate\n\n![hmate.jpg (1144x574)](data/img/post_3_hmate.jpg)\n\n> **H-Mate** is an adult manhwa that refers to the concept of friends with benefits. The romance played throughout the story is simply astonishing.\n> \n> **Tae** and **Miro** have been best friends for over 15 years. Unfortunately (or fortunately), **they end up sleeping together one night**.\n> \n> As a result, things get complicated between them as they seek different relationships.\n> \n> Do they love each other, or are they merely friends with benefits? Read this romantic adult manhwa to find out the answer.\n\nStatus: **Complete**\n\n[➔ Read _**H-Mate**_ on ZeroNet](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/wasm/?!/g/126Temra5S4SmEpt1DVcxy1nhEJBhyUPvr/turtle-feet_h-mate_EN)\n\n# 8\\. He Does a Body Good (aka Sweet Guy)\n\n![he-does-a-boad-good.jpg (1144x574)](data/img/post_3_he-does-a-boad-good.jpg)\n\n> This manhwa probably resembles many people’s lives and also many people’s dreams as well. Some people often relate to the story.\n> \n> The story follows **Hosang**, who doesn’t have any luck with women in his life. It’s almost as if he is invisible to them until he gets electrocuted.\n> \n> Instead of getting hurt, he finds an abnormal power in his body. Soon, his bad days in his life are near to the climax.\n\nStatus: **Complete**\n\n[➔ Read _**Sweet Guy**_ on ZeroNet](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/wasm/?!/g/126Temra5S4SmEpt1DVcxy1nhEJBhyUPvr/i-wonsik_sweet-guy_EN)\n\n# 9\\. Household Affairs\n\n![household-affairs.jpg (1144x574)](data/img/post_3_household-affairs.jpg)\n\n> **Household Affairs** is a clean and pure erotic manhwa with exciting characters and pace. What’s more erotic than a woman cheating on her husband?\n> \n> **Si-Yeon Hong** is the wife of **Ha-jin**, who never shows much interest in her. As a result, she ends up having intercourse with a **delivery boy** **named Yeon-Woo Ha**.\n> \n> Unfortunately, her husband is an assassin, and even she doesn’t know it. Despite making her wife cover his job, he ends up desiring her and realizes it is affecting his professional life.\n> \n> In this **confused lust triangle**, what fate awaits the individuals? The artwork is certainly surprising in this adult manhwa, and you’ll enjoy it to the fullest.\n\nStatus: **Complete**\n\n[➔ Read _**Household Affairs**_ on ZeroNet](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/wasm/?!/g/126Temra5S4SmEpt1DVcxy1nhEJBhyUPvr/butcherboy_household-affairs_EN)\n\n# 10\\. A Pervert's Daily Life\n\n![a-pervert-daily.jpg (1144x574)](data/img/post_3_a-pervert-daily.jpg)\n\n> What happens when **two perverts** of opposite genders end up together? Admittedly, it gets either messy or weird.\n> \n> **Seyoung** doesn’t know that she will be sharing a room with another person in her company’s dorm.\n> \n> When she gets into her new room, to her surprise, she finds **Jinwoo having the pleasure of his own**.\n> \n> Embarrassed, Jinwoo gets flustered, but the one thing he doesn’t know is, she has her dirty little secrets.\n\nStatus: **Ongoing**\n\n[➔ Read _**A Pervert's Daily Life**_ on ZeroNet](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/wasm/?!/g/126Temra5S4SmEpt1DVcxy1nhEJBhyUPvr/alice-crazy_a-perverts-daily-life_EN)\n\n# 11\\. Lilith\n\n![lilith.jpg (1144x574)](data/img/post_3_lilith.jpg)\n\n> Though **Lilith** is a GL (girls love) manhwa, it has a pretty interesting premise and the scenes shown were fire.\n> \n> Even though you’re not into yuri or GL-type comics, this might be a good change of pace for you. After all, it has **marvelous artwork** and some good scenarios that’ll grab your attention.\n> \n> **Jahee** is a hard-working high school teacher with a shy personality. But once she gets to her room, she closes the door and **kneels at the end of the whip**. Her childhood friend Huilin is the one to hold the whip and she enjoys it more than anyone else.\n> \n> But when **Sulhwa** starts to study at the high school where Jahee is teaching, Jahee begins to show her long-buried feelings. Her life is about to teach her just how much pleasure she can get from the pain.\n\nStatus: **Complete**\n\n[➔ Read _**Lilith**_ on ZeroNet](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/wasm/?!/g/126Temra5S4SmEpt1DVcxy1nhEJBhyUPvr/chesire-sirius_lilith_EN)\n\n# 12\\. An Innocent Sin\n\n![inncent-sein.jpg (1144x574)](data/img/post_3_inncent-sein.jpg)\n\n> An **Innocent Sin** is a Romantic Adult manhwa where the story gets more and more lustful. It doesn’t take much time to hook you up.\n> \n> You get both the main characters’ introduction in the beginning and then, all you can do is **enjoy the beautiful art.**\n> \n> Thinking that **Nayeon** is all alone herself on the last train, she tries to please herself and discovers a person from another door.\n> \n> The man approaches her and gives her a business card, and since he’s handsome, she accepts it. Soon she finds that he’s the man who can perfectly please her.\n\nStatus: **Complete**\n\n[➔ Read _**An Innocent Sin**_ on ZeroNet](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/wasm/?!/g/126Temra5S4SmEpt1DVcxy1nhEJBhyUPvr/oh-gye_an-innocent-sin_EN)\n\n# 13\\. Redemption Camp\n\n![redemption-camp.jpg (1144x574)](data/img/post_3_redemption-camp.jpg)\n\n> As the name suggests, the manhwa is precisely like the one you suspect. Isn’t there a saying “**What you reap, what you sow,**” which suits perfectly this adult manhwa?\n> \n> The story follows **Da-ae**, who commits dirty acts and has many secrets. However, when Gitae, the minister’s son, notices her acts, he decides to teach her a lesson.\n> \n> As a result, he forms a Redemption Camp and gathers the victims of her to fulfill the purpose.\n> \n> It contains explicit content, and adult manhwa lovers are sure to enjoy it to the fullest.\n\nStatus: **Complete**\n\n[➔ Read _**Redemption Camp**_ on ZeroNet](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/wasm/?!/g/126Temra5S4SmEpt1DVcxy1nhEJBhyUPvr/ramjak_redemption-camp_EN)\n\n# 14\\. Club Sodom\n\n![club-sodom.jpg (1144x574)](data/img/post_3_club-sodom.jpg)\n\n> **Club Sodom** is an entertaining manhwa full of adultery scenes. Each chapter keeps your anxiety at the maximum and delivers you a considerable amount of reading pleasure.\n> \n> The tale of Club Sodom revolves around a **female journalist and her assistant**. Here the female journalist is cheeky and beautiful where her assistant is a little weirdo.\n> \n> Enjoy the romantic drama between these two that brings ultimate pleasure along with the thrill. It is one of the best adult webtoons out there.\n\nStatus: **Complete**\n\n[➔ Read _**Club Sodom**_ on ZeroNet](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/wasm/?!/g/126Temra5S4SmEpt1DVcxy1nhEJBhyUPvr/heo-yiwon-kurenai_club-sodom_EN)\n\n# 15\\. Secret X Folder\n\n![secret-folder.jpg (1144x574)](data/img/post_3_secret-folder.jpg)\n\n> This manhwa is the work of the creator of “**Drug Candy.**” Since Drug Candy is one of the best adult webtoons in the industry, you can’t expect any less from this one either.\n> \n> This time you have more matured graphics, humor, and improved art work. In other words, you get a package of content in a secret folder.\n> \n> It is a desire-themed manhwa with hot stories of different couples. All of these couples encounter themselves in intercourse and have pleasure without any regrets.\n\nStatus: **Complete**\n\n[➔ Read _**Secret X Folder**_ on ZeroNet](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/wasm/?!/g/126Temra5S4SmEpt1DVcxy1nhEJBhyUPvr/lee-hyun-min_secret-x-folder_EN)\n\n# 16\\. My Stepmom (aka This Doesn't Feel Like Me)\n\n![stepmom.jpg (1144x574)](data/img/post_3_stepmom.jpg)\n\n> The plot revolves around **Jin-woo**, who finds his **stepmom Ha-Yeon** attractive. His stepmom is ten years older than him, and that gives him even more reason to grow his feelings towards her.\n> \n> Where does this inappropriate relationship lead them? I guess you can find the answer to it once you finish reading it.\n> \n> It has a decent artwork and a good storyline which can hook you up. After all, it is one of the best adult manhwa/ adult webtoons.\n\nStatus: **Complete**\n\n[➔ Read _**My Stepmom**_ on ZeroNet](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/wasm/?!/g/126Temra5S4SmEpt1DVcxy1nhEJBhyUPvr/andromeda11_this-doesnt-feel-like-me_EN)\n\n# 17\\. Love Shuttle\n\n![love-shuttle.jpg (1144x574)](data/img/post_3_love-shuttle.jpg)\n\n> A list is like a curry where you get a flavor if you add different types of ingredients. In the same way, adding a yaoi manhwa to our list brightens it.\n> \n> **Love Shuttle**'s author is famous for his work on ‘**An Easy Target**.’ With this manhwa, he received even more recognition than he has before.\n> \n> **Doyon** is a handsome and beautiful person. Even though he has an attractive personality, he is not in a relationship.\n> \n> His body never experienced the “**Heat**.” Being a late bloomer, he finds his work rival Taehan attractive. **Taehan** is more than happy to make a move on him.\n\nStatus: **Unknown**\n\nNot available on ZeroNet right now.\n\n# 18\\. Talk to Me\n\n![talk-to-me-manhwa.jpg (1144x574)](data/img/post_3_talk-to-me-manhwa.jpg)\n\n> **Talk to Me** is a manhwa that is specially made for girls who enjoy reading adult manhwa. Even though its story takes the same path as other ones, it has a deep meaning to it.\n> \n> A woman’s desires are beautiful, and more importantly, if she feels them, then her life will become delightful.\n> \n> The manhwa is about a **Raeyim**, a girl who has everything, including a good career and a handsome boyfriend. **But her desires can’t be fulfilled just by them**.\n> \n> She spends most of her time making her desires come true. In other words, she is the purest girl in the world. Make sure you read this fantastic adult manhwa.\n\nStatus: **Complete**\n\n[➔ Read _**Talk to Me**_ on ZeroNet](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/wasm/?!/g/126Temra5S4SmEpt1DVcxy1nhEJBhyUPvr/eunbyul_talk-to-me_EN)\n\n# 19\\. Wife Training\n\n![wife-training.jpg (1144x574)](data/img/post_3_wife-training.jpg)\n\n> The story alone makes you go nuts while the pace and scenes keep you entertained. It definitely has a place among the best adult manhwa.\n> \n> The story is about a **Virgin** who becomes a **god of sex through the internet**. Due to an incident, most of the people request him to tame their wife.\n> \n> Is it a golden opportunity for him or a tough situation? Find it out while reading this fantastic adult manhwa.\n\nStatus: **Complete**\n\n[➔ Read _**Wife Training**_ on ZeroNet](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/wasm/?!/g/126Temra5S4SmEpt1DVcxy1nhEJBhyUPvr/dalchun-mc-halo_wife-training_EN)\n\n# 20\\. Sports Girl\n\n![sports-girl.jpg (1144x574)](data/img/post_3_sports-girl.jpg)​​​​​​​\n\n> A woman who sweats while doing a workout is far hotter than a normal hot woman. These women have a healthy physique and a hot body too.\n> \n> There isn’t much about the plot because it **splits into six subplots**. And with each one of them, the main girl of the manhwa involves in the intercourse with various sportspeople.\n> \n> If you give it a shot, who knows it might become one of your favorite adult manhwa/adult webtoons.\n\nStatus: **Complete**\n\n[➔ Read _**Sports Girl**_ on ZeroNet](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/wasm/?!/g/126Temra5S4SmEpt1DVcxy1nhEJBhyUPvr/gamang_sports-girl_EN)"
		},
		{
			"post_id": 2,
			"title": "Petit-Roid 3 (Petit−ろいど３)",
			"date_published": 1550544433.389,
			"body": "![017b.jpg (703x214)](data/img/post_2_017b.jpg)\n\nAnd who can honestly say they would not agree with that statement? Well, the protagonist of our three-volume manga here is not too stoked about the prospects of robo-girls, which is a real shame because only three pages into the story we find out his grandfather dropped off three cute loli-bots at his house.\n\nOh, and by the way: unless he has sex with them once every three days, their self-destruction protocol will trigger. So, yeah ... there's that.\n\nThis is all a good setup for some great sex scenes, but luckily there's also more plot than that: turns out his grandfather isn't the only pervert designing robo-girls, and the other ones are just as horny, possibly more. They're certainly more aggressive while looking to satisfy their desires.\n\n* * *\n\n## The Potential of Robo-Girl Transformation as a Means to Broaden the Target Demographic of a Manga\n\nMark my word: someone somewhere is crazy enough to publish a scientific paper with a title like that (and if you come across it, send me a link).\n\nThe three robo-girls in the manga can combine together into one of their adult forms. Alternatively two of them can transform into a teenage form as well. I've included three gifs in this post that show the different forms for each of the droids.\n\n![mitsuki.gif (260x260)](data/img/post_2_mitsuki.gif) ![karin.gif (260x260)](data/img/post_2_karin.gif) ![kirara.gif (260x260)](data/img/post_2_kirara.gif)\n\nOne of the most obvious advantages of the transformative capabilities of the main cast is that it significantly increases the potential market for this manga. Not only do the robo-girls offer something to the loli, teen and adult fans, but they also broaden the variety of sex scenes without increasing the number of characters. This last point is one that a lot of other multi-volume manga struggle with: recurring sex scenes with the same character can get stale (Cheers handles this fairly well, I will probably write about those in more detail some day), but introducing a constant stream of new cast-members in turn hinders the character development that some people are looking for in these serialized works."
		},
		{
			"post_id": 1,
			"title": "Hana's Holiday (Hana-san No Kyuujitsu)",
			"date_published": 1550195779,
			"body": "![000.jpg (561x786)](data/img/post_1_000.jpg)\n\n# ハナさんの休日\n\n**Hana's Holiday** (Read at [1+Gallery](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/?!/g/1G8VWDQc5fXLkRiijJB4EZerDLmDVY75MZ/saigado-hanasan-no-kyuujitsu-vol1)) is the story of an ordinary office lady who leads a secret life of indecency and carnal pleasures on her days off. This generally consists of showing her body in public and having intercourse with one or multiple strangers, often followed by her running into last nights partner in her professional life. This makes for a very episodic story where every chapter is the adventure of another one of her days off, starting and ending with a quick flyby view of her normal everyday life at the company. Because of this rhythm it's very easy to jump back into the story at any point when re-reading it.\n\n* * *\n\n![037b.jpg (923x900)](data/img/post_1_037b.jpg)\n\nAs someone with a thing for girls with glasses, the obvious let-down in this manga is that nearly every time things get lewd ... she's not wearing the glasses. But that's a small price to pay for what is an otherwise excellent read, and the last chapter of the first volume seems to be there to make up for this lack of glasses in the other sex scenes.\n\n![244.jpg (942x472)](data/img/post_1_244.gif)\n\nThere is a scene in the third chapter that really caught my attention. Showing very little of what is happening and explaining nothing at all, Saigado still manages to convey the story to the reader very clearly with only a few “key frames”. I also think this scene captures the spirit and atmosphere of the story, and it does so playfully. Hana the huntress has cornered her prey in a public toilet.\n\n![hanasan.jpg (669x900)](data/img/post_1_hanasan.jpg)\n\nTo be continued! Check back later :-)"
		}
	]
}