{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "我想在零网上弄一个交易网站",
			"body": "属于小白一个，下载了网站源码正在修改，一些地方还不太会，例如替换图片。\n我打算在零网上面卖气枪，之前在微信上卖，感觉不太安全。\n大家有什么好的建议没有，例如易操作而且保密性强的付款方式。\n总而言之就是如何确保一桩交易在零网上，从线上到线下，交易完成。\n因为零网不支持PHP，做动态网页有些困难，所以限于做HTML类型的网页。\n希望大家可以多提一些可行的方案。\n我希望推动中国的APSC运动，GBB不是武器，玩具就是玩具。只要有完善的法律，和一些必要的监管措施，我觉得大陆开放GBB不是问题。\n也是希望可以有更多的爱好者，可以拥有属于自己的一支气枪。",
			"added": 1533394162,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 2,
			"title": "中国大陆气枪专卖网站开始建设",
			"body": "http://127.0.0.1:43110/113ZAho4X2PvLdqW3CW92g1WhU263BGQcV/\n网站还在建设之中，敬请期待。\n我们的理念就是。气枪不是武器。让更多的爱好者拥有属于自己的气枪，是我们的宗旨。\n推动中国APSC、IPSC、IDPA、WarGame运动的发展。\n希望大家能够支持。\n另外招募合作伙伴。例如会网页设计，或者懂气枪安全射击知识，以及安全射击运动知识的人才。\n一同建设GBB在中国大陆的净土。\n对网站或者交易有好的建议的朋友，请留下你们的想法。\n你们的支持是我们前进的动力。。",
			"added": 1533457143,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 3,
			"title": "关于中国禁止气枪的一些思考",
			"body": "中国人口众多，并且很多政治领域比较敏感，包括一些地区还不稳定。中国禁止人民拥有以火药为动力的枪支的政策，我个人认为还是非常必要的。\n但是，对于以压缩气体为动力的枪支进行禁止，我觉得是十分愚蠢的。中国人现在对于武器的知识掌握少之又少，所以出现个别基因突变的人拿着仿真枪就可以去抢劫，因为被抢劫者多为女性，对于武器知识掌握极少，无法通过细枝末节区别枪支，导致犯罪成功。\n并且中国各个民族自古以来都是尚武的民族，尤其是汉族，蒙族，维族，满族，苗族等等，历史上宋朝禁止百姓拥有兵刃，重文轻武，导致宋朝孱弱。而汉朝，民风剽悍，尚武精神，造就了一批英名远播的武将和儒将，更是喊出了“明犯强汉者虽远必诛”的磅礴之言。\n中国政府的懒政，导致了这一禁令的产生，为什么不能出台专门的法律和政策，来区分火药枪支和气体枪支呢，为什么不能出台完善的监管体制来监管气体枪支的运营呢。\n中国提出要以实战化的标准训练军队，但是中国最庞大的人群需要训练，他们需要在战争来临的时候，守护自己的土地。\n并且推动气枪射击运动，有利于中国人民的身体素质的提高。射击可以培养人的专注力，运动射击可以让人在奔跑中思考迅速的做出判断。\n美国允许公民合法持有半自动步枪。以及出台了一系列的相关法律来监管枪支。美国有两亿人口，每年枪击案有2万起，算多吗？\n中国有14亿人口，每年枪击案5万起。算少吗？这是2010年的数据，当然在中国政府严令禁止下，每年的枪击案逐步减少。但是，中国是禁枪的啊。\n中国为什么不能学习美国，建立一套完善的监管体系呢？\n我们不要跟美国一样，在必要时刻利用私权利暴力对抗公权力暴力。我们只是想要合法的射击权。\n可以通过限制威力，限制材质，枪口扳机标红来区别于真枪。",
			"added": 1533458417,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"13_1FJCJm9PPaL2Lcfv64fSCuXXBHQcE4JdGY": [
			{
				"comment_id": 1,
				"body": "比较在意匿名性，所以用的tor",
				"added": 1533440035
			}
		],
		"93_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 2,
				"body": "因为，那几年，中国人民对于网络信息的辨识度不高，容易被一些言论左右，这是不利于政府的。为什么说辨识度不高？就像你父母玩微信转发那些朋友圈一样，公众号说什么就信什么，也不进行调查取证。人均知识水平限制了政府对网络的开放。\n中国现在有很多反对势力，例如轮子，他就非常具有煽动性。中国政府不会再允许一个“白莲教”的出现。所以要对他们的生存空间进行封锁。\n互联网现在越来越趋于低龄化，一些初中生，高中生，处于叛逆期，而且一腔热血，考虑事情不会很周全，他们容易受到煽动和蛊惑。容易成为反华势力的工具，例如89事件。\n不要说初中生，高中生，就连大学生如果在网络上听到一个政府黑料，根本都不去细细追究，立刻认为就是真的，而且不遗余力的宣传给同学，以显示自己的“博学”和独特。\n这就是现实。\n确实是政府不敢公开网络。\n但是中国现在实力越来越强，所以也就越来越自信。\n当有一天，国外反华势力不再具有威胁，人均知识水平得以提高，人们可以理智的对待网络上的信息，人们遵纪守法不在网络上犯罪。\n中国的网络会开放的。",
				"added": 1533868337
			}
		],
		"246_157kFKiaEbRUds2HCBUpv33t4Unezi6dR6": [
			{
				"comment_id": 3,
				"body": "单就问题而言，平民对军队没有胜算。\n且不说非常规武器。\n仅常规武器来讲，双方差距是巨大的。\n甚至不需要动用坦克，飞机。只需要使用装甲车。\n且民用合法武器大多都是半自动武器。\n更没有可以穿甲的重火力武器。\n军队碾压。",
				"added": 1534779808
			}
		],
		"349_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 4,
				"body": "别动不动就完蛋了怎么样。美国枪击案，死几百人，谁上去施救了？美国也完蛋了？印度长时间强奸女性，印度也完蛋了？日本还发生过沙林毒气袭击，无人施救，也完蛋了？世界上每天杀人案件那么多，世界完蛋了？",
				"added": 1534779982
			}
		]
	},
	"comment_vote": {}
}