{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Governo Bolsonaro sabia 10 dias antes de colapso em Manaus e necessidade de transferir pacientes",
			"body": "“Há possibilidade iminente de colapso do sistema de saúde, em 10 dias”, afirma um documento do ministro [Eduardo Pazuello](https://pt.wikipedia.org/wiki/Eduardo_Pazuello) sobre o sistema de saúde de Manaus. O diagnóstico foi a principal conclusão de uma comitiva do Ministério da Saúde que visitou a capital do Amazonas mais de uma semana antes do colapso no sistema de saúde local. Exatos 10 dias depois, hospitais de Manaus esgotaram suas reservas de oxigênio com pacientes morrendo por asfixia.\nAlém de prever com exatidão a data do colapso no sistema de saúde, o Ministério da Saúde diagnosticou com 10 dias de antecedência dificuldades na compra de materiais para consumo hospitalar, como medicamentos e equipamentos, problemas na contratação de profissionais de saúde habilitados para trabalhar nas UTIs e a necessidade de estruturar novos leitos rapidamente para os pacientes que já precisavam de internação no início de janeiro.\nO governo também já sabia da possibilidade de transferência de pacientes para hospitais universitários federais de todo o Brasil e para a rede de saúde no Rio de Janeiro. \nAs informações estão em [documentos produzidos pelo próprio Ministério da Saúde](https://ipfs.infura.io/ipfs/QmPBh3virHtTwPs8JosM4MphVFj36RkY6SfpJBu4mwxgg8) e foram enviadas pela Advocacia Geral da União (AGU) ao Supremo Tribunal Federal no último domingo, dia 17.\n\n- Fonte: https://web.archive.org/web/20210118181252/https://apublica.org/2021/01/governo-bolsonaro-sabia-10-dias-antes-de-colapso-em-manaus-e-necessidade-de-transferir-pacientes/",
			"added": 1611053381
		},
		{
			"topic_id": 2,
			"title": "Humanidade pode levar uma década para se recuperar da pandemia — exceto os bilionários",
			"body": "De acordo com um [novo estudo da Oxfam](https://ipfs.infura.io/ipfs/QmYX4uyiYr29AMKJN2NmMP975mTmDNXY54jGWDHEFpCF9x), o que os dez maiores bilionários do mundo ganharam desde março de 2020 seria “mais do que suficiente para garantir que ninguém na Terra caia na pobreza por causa do vírus”.\n- https://web.archive.org/web/20210126230153/https://gizmodo.uol.com.br/pandemia-bilionarios-mais-ricos-humanidade-decada-recuperacao/",
			"added": 1611702814
		}
	],
	"topic_vote": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"2_1KMu2u9wo1DCsc27Qt28qwLxVAjcvHZhtj": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1
	},
	"next_comment_id": 240,
	"comment": {
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 1,
				"body": "#STEPHEN KANITZ: Marx administrador de empresas | REAGINDO\n- https://invidious.snopyta.org/watch?v=hYPCLececyA\n- https://siasky.net/AABPYeOQ3X0w0_hcj6AhzJbbG56beoOwabInJR0r_rhvIw\n\nENTRETENIMENTO | Um tal de [Stephen Kanitz](https://pt.wikipedia.org/wiki/Stephen_Kanitz) explica que o problema de Marx é não ter estudado administração de empresa e não ter acesso a [Excel](https://www.microsoft.com/pt-br/microsoft-365/excel). Apenas para o divertimento geral. Link da pérola: https://web.archive.org/web/20200220013036/https://blog.kanitz.com.br/karl-administracao/\n\nANUÁRIO ESTATÍSTICO DO ILAESE 2019: “[Trabalho e Exploração: o mapa da exploração dos trabalhadores no Brasil](https://ipfs.infura.io/ipfs/QmRH8zC3yNGahzrckxMuPsENNYpK5Cp8yUNfbgQNtAfoVC)”",
				"added": 1608215630
			},
			{
				"comment_id": 29,
				"body": "#Banco de tempo e economia solidária feat. Nádia Nádila\n- https://invidious.snopyta.org/XrEW0sNpBzY\n- http://ipfs.io/ipfs/QmfXHjsH8p4TZt8BYucb9g1M372QjGDrpyMwp5UT2W4734",
				"added": 1608512445
			},
			{
				"comment_id": 130,
				"body": "#Por que falar de neoliberalismo em plena pandemia?\n- https://web.archive.org/web/20201124195412/https://www.brasildefatope.com.br/2020/08/28/por-que-falar-de-neoliberalismo-em-plena-pandemia\n- http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1KMu2u9wo1DCsc27Qt28qwLxVAjcvHZhtj_3\n\n\"O coronavírus adoece e mata. O neoliberalismo é um vírus que destrói toda e qualquer forma de vida.\"",
				"added": 1610030919
			},
			{
				"comment_id": 189,
				"body": "#Ecossocialismo é mais que ambientalismo\n\"É hora de lidar com uma suposição que fazem sobre ecossocialismo, quando simplesmente se confunde com iniciativas de preocupação ambiental por aí. Hoje em dia, como a coisa tá muito feia, qualquer coisa melhor que um [Ricardo Salles](https://pt.wikipedia.org/wiki/Ricardo_de_Aquino_Salles) pode parecer avançada, mas nem mesmo um ambientalismo de esquerda é suficiente. A gente precisa é de ecossocialismo mesmo.\"\n- https://invidious.snopyta.org/N-riXUzjC5c\n- https://siasky.net/AAA6jF448TBMU9Y0sqEIltCVSVU8xUZ0xdeT4Tu8Xr1mwA\n\nReferências: https://web.archive.org/web/20210115154544/https://teseonze.com.br/referencias/ep080/",
				"added": 1611279204
			},
			{
				"comment_id": 190,
				"body": "#Capitalismo: um sistema de lixo\n\"Hoje a gente vai falar de obsolescência programada, das coisas quebrando antes da hora, de como as empresas raciocinam o lixo como um mera problema técnico e como isso se relaciona com consumismo e produtivismo. Cabe tanto lixo assim no nosso planeta?\"\n- https://invidious.snopyta.org/dxbD0pUzjP0\n- https://siasky.net/AAB52ncAVM_mUAxxCL1mLQmgKkfnP-wCtn1FIq_HFRQNcQ\n\nReferências: https://web.archive.org/web/20210121224219/https://teseonze.com.br/referencias/ep081/",
				"added": 1611279305
			},
			{
				"comment_id": 191,
				"body": "#[O papel da história no modo de exposição de 'O capital' de Marx](https://ipfs.infura.io/ipfs/QmNry1Wuzdc1wGp2YSong8CRwAfgbtLpnBsArSWr7cxrov)\nNo presente artigo procuramos evidenciar que as categorias da obra principal de Marx possuem uma dimensão histórica que está intimamente relacionada com as incursões nas formas sociais que antecederam o capitalismo. Tais incursões históricas não seriam, como comumente se interpreta, meros recursos literários ou ilustrativos. Ao contrário, são um momento necessário para a apreensão e crítica da forma específica por meio da qual a riqueza é apropriada no modo de produção capitalista, revelando a impossibilidade de uma derivação meramente lógica das categorias. Nessa direção, acreditamos que este artigo auxilia na compreensão das radicais diferenças entre a dialética de Marx e a de Hegel.",
				"added": 1611326040
			},
			{
				"comment_id": 192,
				"body": "#A CHINA É UMA DITADURA CAPITALISTA E NÓS PODEMOS PROVAR!\n- https://invidious.snopyta.org/PlTU1qOnPF8\n- https://siasky.net/AAB1KxXmwcc1CMfL5O7FFtOKlOwNOihxJj8uChlZt3twNA\n\n#Textos recomendados:\n- [O que são os Conselhos Populares?](https://web.archive.org/web/20170207083732/https://litci.org/pt/mundo/america-latina/brasil/o-que-sao-os-conselhos-populares/)\n- [Mulheres na Revolução Chinesa](https://web.archive.org/web/20210122144610/https://litci.org/pt/mulheres-na-revolucao-chinesa/)\n- [A China é uma ditadura capitalista disfarçada de “vermelha”](https://web.archive.org/web/20201215220947/https://www.pstu.org.br/a-china-e-uma-ditadura-capitalista-disfarcada-de-vermelha/)\n- [China e Coronavírus: O mundo não será o mesmo!](https://web.archive.org/web/20201215170301/https://www.pstu.org.br/china-e-coronavirus-o-mundo-nao-sera-o-mesmo/)",
				"added": 1611331280
			},
			{
				"comment_id": 193,
				"body": "#O CAPITAL DE MARX: Valor NÃO é tempo de trabalho\n- https://invidious.snopyta.org/PlTU1qOnPF8\n- https://siasky.net/AADhARU4KGUt7REtwx4JhQIW3zlRF0-YxoLrjM_5GzAzBA",
				"added": 1611331318
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 2,
				"body": "#Serpentes a Bordo (2006)\n- https://siasky.net/CAB7RPc2uXyHdfLfGXWRdAy3c1KNdr0URCpsjSTWyXXG5w\n\nUm agente do FBI embarca em um avião cheio de cobras venenosas, deliberadamente liberadas para matar uma testemunha que está sendo transportada de Honolulu para Los Angeles para testemunhar contra um chefe da máfia.",
				"added": 1608227264
			},
			{
				"comment_id": 3,
				"body": "#Diamante de Sangue (2006)\n- https://siasky.net/CABkjHzFor3N42bIeCduIr_Un3RcKvX2kGXQ3nbRA8Z7Wg\n\nQuando a [Guerra Civil](https://en.wikipedia.org/wiki/Sierra_Leone_Civil_War) se enfurece na década de 1990 em Serra Leoa, dois homens, um branco sul-africano mercenário e um pescador negro, se juntam em uma busca para recuperar uma joia rara que tem o poder de transformar suas vidas. Com a ajuda de uma jornalista norte-americana, os homens embarcam em uma jornada perigosa através do território rebelde para conseguir seu objetivo.",
				"added": 1608239791
			},
			{
				"comment_id": 8,
				"body": "#Titanic (1997)\n- https://siasky.net/CAAHVpyElpla2wWUYwUG09Ix8lDRSLq6pMm_q9pCBkd0wQ\n\nA bordo do [luxuoso transatlântico](https://en.wikipedia.org/wiki/Titanic), Rose (Kate Winslet), uma jovem da alta sociedade, se sente pressionada com a vida que leva. Ao conhecer Jack (Leonardo DiCaprio), um artista pobre e aventureiro, os dois se apaixonam. Mas eles terão que enfrentar um desafio ainda maior que o preconceito social com o destino trágico do navio.",
				"added": 1608313936
			},
			{
				"comment_id": 9,
				"body": "#O Resgate do Soldado Ryan (1998)\n- https://siasky.net/CAC-XN1OmgMWUtzupnYzdGA3xF9KsMHqqcbi0Stz-L1PbA\n\nNa Segunda Guerra Mundial, durante o \"[Dia D](https://en.wikipedia.org/wiki/Normandy_landings)\", o capitão Miller (Tom Hanks) recebe uma missão quase impossível. Acompanhado de Adrian (Vin Diesel) e mais seis soldados, ele precisa encontrar Ryan (Matt Damon), um dos homens de seu exército que está desaparecido, se quiser garantir sua volta para casa. Vencedor de 5 Oscars, incluindo o de Melhor Direção.",
				"added": 1608320889
			},
			{
				"comment_id": 13,
				"body": "#Hércules (1997)\n- https://siasky.net/CADhNfYPyxedjilZZA9_vw9G40dTeWES7rrxLOjDlYlTfQ\n\nO filho de Zeus e Hera é despojado de sua imortalidade quando criança e deve se tornar um verdadeiro herói para recuperá-la.",
				"added": 1608338350
			},
			{
				"comment_id": 14,
				"body": "#Hancock (2008)\n- https://siasky.net/AAChNOI5fM3__cAFWu6NByXyqE5VNj7yHLOu0p7MREjg2Q\n\nHancock, um super-herói desajeitado, protege os cidadãos de Los Angeles mas causa danos colaterais a cada ato heroico que realiza. Hancock não se importa com o que as pessoas pensam. Entretanto, após salvar a vida de um executivo, ele conhece a bela esposa dele e descobre que, apesar de tudo, é um homem sensível.",
				"added": 1608352370
			},
			{
				"comment_id": 15,
				"body": "#Bloodshot (2020)\n- https://siasky.net/AADpDo8JDkpOuMr6l1LI0C0pFofortYo9k1D3kyFDI8Ltg\n\nBloodshot é um ex-soldado com poderes especiais: o de regeneração e a capacidade de se metamorfosear. Assassinado ao lado da esposa, ele é ressuscitado e aprimorado com nanotecnologia, desenvolvendo tais habilidades. Ao apagarem sua memória várias vezes, ele finalmente descobre quem realmente é e parte em um busca de vingança daqueles que mataram sua família.",
				"added": 1608352559
			},
			{
				"comment_id": 19,
				"body": "#K-911: Um Policial Bom Pra Cachorro 2 (1999)\n- https://siasky.net/AABMrD_zQ8Uoa98bvkfxavy9SHbJMIwE1XaZZwQP0P_jHA\n\nDooley (James Belushi) e o pastor alemão Jerry Lee já não têm a agilidade e o fôlego de outrora e por isso recebem o apoio de outra dupla: Welles (Christine Tucci) e o dobermann Zeus. O primeiro contato não é nada bom e os novos parceiros se estranham, mas logo colocam o descontentamento de lado e partem para a ação.",
				"added": 1608383363
			},
			{
				"comment_id": 20,
				"body": "#A-X-L: O Cão Robô (2018)\n- https://siasky.net/AADxpPnkL3-Xn63ewKSHE7k5uPoVlIvRvl4ZucpZyNEduw\n\nA.X.L. é um cão-robô extremamente habilidoso criado a mando do governo para dar suporte aos soldados norte-americanos. Quando um teste dá errado, A.X.L. fica perdido, mas o jovem Miles (Alex Neustaedter) o encontra e um forte laço acaba nascendo entre a dupla. Em contrapartida, o cientista que deu vida ao cão inicia uma violenta caçada para tê-lo de volta e, para isso, terá que lidar com o garoto que não está disposto a abrir mão de seu novo amigo.",
				"added": 1608383507
			},
			{
				"comment_id": 21,
				"body": "#K-9: D.P.: Um Policial Bom pra Cachorro (2002)\n- https://siasky.net/AACrXzPWCEMa2UA2nHQ41Wj7o6bYCJP6tx4jZb-r-VKHUQ\n\nThomas Dooley (James Belushi) e o seu parceiro de quatro patas, Jerry Lee, regressam para combater o crime, nesta nova comédia recheada de acção. Faltam apenas algumas horas para uma afortunada reforma, quando Dooley se vê envolvido num assalto à mão armada a uma empresa de tecnologia informática. Subitamente ele passa a ser um suspeito, e a sua pensão é suspensa até que os verdadeiros criminosos sejam apanhados! Agora, Dooley e Jerry Lee vêem-se obrigados a tornarem-se detectives privados e a descobrir os verdadeiros criminosos. Trata-se de um caso desconcertante que envolve microprocessadores roubados, impostores e beldades perigosas.",
				"added": 1608395960
			},
			{
				"comment_id": 22,
				"body": "#Sansão (2018)\n- https://siasky.net/CADSAjYVBnhZRFKLbCZJTElvI8_Wlphi-dF6OxgH9_z_IQ\n\nSansão, empoderado por Deus com força sobrenatural, põe em risco seu destino com decisões impulsivas que levam à traição de um príncipe perverso e uma bela tentação. Quando Sansão chama seu Deus mais uma vez, ele transforma a prisão e a cegueira em vitória final.",
				"added": 1608409400
			},
			{
				"comment_id": 23,
				"body": "#Kiseijuu: Sei No Kakuritsu (Live Action) filme 1\n- https://siasky.net/AADBgm5ud8DPLrvBodiYL8z6HOMvyYoicRKAFHhzVHgszA\n\nUm dia, alienígenas chamados Parasitas, que se hospedam em seres vivos e tomam seus corpos, invadem a Terra. Eles atacam os homens entrando por seus narizes e orelhas. Izumi Shinichi é um jovem de 17 anos que mora com os pais num pacato bairro de Tóquio e acaba sendo alvo de um desses alienígenas, mas o indivíduo falha ao tentar dominar seu corpo. Tendo de coexistirem, como serão seus destinos?",
				"added": 1608431039
			},
			{
				"comment_id": 24,
				"body": "#O Reino Proibido (2008)\n- https://invidious.snopyta.org/watch?v=Maurba_Puvw\n- https://siasky.net/AAB7v_64VXfR_F-SM8D8htlGPyp5jissCT3OUbWm5O-exQ\n\nJason Tripitikas é um garoto de 17 anos que é fanático por artes marciais. Ele regularmente sonha com o Rei Macaco, um mestre na arte do kung fu, e frequenta uma loja de penhores em Chinatown, gerenciada por Old Hop, à procura de filmes de luta baratos. Um dia ele encontra, no fundo da loja, um cajado-bo com mais de um metro e um macaco gravado, exatamente igual ao usado pelo Rei Macaco em seus sonhos. Old Hop lhe diz que o cajado está na loja desde que seu avô a abriu e que um homem deveria vir comprá-lo para devolvê-lo ao seu dono.",
				"added": 1608468038
			},
			{
				"comment_id": 25,
				"body": "#O Guarda-Costas (1992)\n- https://siasky.net/CAAzE-1pwaLMua9yZULAOABqalrfthHhYzJ6RJjestH3Mg\n\nFrank Farmer (Kevin Costner), um guarda-costas altamente eficiente e caro, é contratado para proteger Rachel Marron (Whitney Houston), uma grande cantora e atriz, que está recebendo cartas anônimas e ameaçadoras. Frank é um ex-agente do Serviço Secreto que ainda não se perdoou do sentimento de culpa em relação à sua inabilidade de proteger o presidente Reagan, que quase foi assassinado por John Hinckley. Frank e Rachel se apaixonam mas ele não deixa este amor evoluir, pois quando estão juntos Rachel fica vulnerável. Paralelamente, novos atentados acontecem.",
				"added": 1608480228
			},
			{
				"comment_id": 26,
				"body": "#O Exterminador do Futuro (1984)\n- https://siasky.net/AACPr3HlnEOtTnm4TDNyAWD7UN0n9khDISNNJViIcEuD2w\n\nNum futuro próximo, a guerra entre humanos e máquinas foi deflagrada. Com a tecnologia a seu dispor, um plano inusitado é arquitetado pelas máquinas ao enviar para o passado um andróide com a missão de matar a mãe daquele que viria a se transformar num líder e seu pior inimigo. Contudo, os humanos também conseguem enviar um representante para proteger a mulher e tentar garantir o futuro da humanidade.\n\n#O Exterminador do Futuro 2: O Dia do Julgamento (1991)\n- https://view.axel.org/item/af6e3fa1720fdc09\n\nO jovem John Connor é a chave para a vitória da civilização sobre uma rebelião de robôs do futuro. No entanto, ele torna-se alvo de T-1000, um exterminador que pode assumir a forma que desejar e que foi enviado do futuro para matá-lo. Outro exterminador, o renovado T-800, também é enviado de volta ao passado para proteger o menino. Quando John e sua mãe embarcam na fuga com T-800, o menino cria um vínculo forte e inesperado com o robô.\n\n#O Exterminador do Futuro 3 - A Rebelião das Máquinas (2003)\n- https://siasky.net/AADz9OIXjm0hhXIoiF4UDha2Ty5HlHXpXYpQhc8SDOP8uQ\n\nNa intenção de concluir a missão ainda inacabada, a bela e perigosa máquina mortífera T-X é enviada para matar John Connor, líder da resistência humana contra as máquinas da Skynet. Para protegê-lo mais uma vez o ciborgue T-800 volta à cena.",
				"added": 1608483430
			},
			{
				"comment_id": 28,
				"body": "#Meu Nome é Jeeg Robot (2016)\n- http://ipfs.io/ipfs/QmfPk5iuvD3x5MKHwZv4TCko7NewjgKfhuU7Ke8hF7z1La\n\nEnzo Ceccoti (Claudio Santamaria) entra em contato com uma substância radioativa e ganha poderes, se tornando praticamente invencível. Ele considera usar suas habilidades para o mal, mas muda de ideia quando encontra Alessia (Ilenia Pastorelli), uma garota que tem certeza de que ele é Jeeg Robot, o super herói de um desenho animado japonês.",
				"added": 1608486347
			},
			{
				"comment_id": 30,
				"body": "#O Preço do Amanhã (2011)\n- http://ipfs.io/ipfs/QmWfbpaNGGS6z61Wu2q6iSX2gQwF2kg1nYg4RGAvDEdSNY\n\nAcusado de assassinato, um homem deve descobrir como derrubar um sistema onde tempo é dinheiro e que permite que os ricos vivam para sempre, enquanto os pobres devem implorar por cada minuto de suas vidas.",
				"added": 1608514230
			},
			{
				"comment_id": 34,
				"body": "#Até o Último Homem (2016)\n- https://siasky.net/CADQ-etu7TYPigrZeGU4-u2YMjuswQZMlYTxll5pLzyWkg\n\nO Médico do Exército Americano da Segunda Guerra Mundial [Desmond T. Doss](https://en.wikipedia.org/wiki/Desmond_Doss), que serviu durante a [Batalha de Okinawa](https://en.wikipedia.org/wiki/Battle_of_Okinawa), se recusa a matar pessoas e se torna o primeiro homem na história americana a receber a [Medalha de Honra](https://en.wikipedia.org/wiki/Medal_of_Honor) sem disparar um tiro.",
				"added": 1608521101
			},
			{
				"comment_id": 42,
				"body": "#Tropa de Elite (2007)\n- https://siasky.net/AAAV0MnidLDGCER_t1U16aTe7Z7RBTvsiz6Udv51kMtvrA\n\nO capitão do Bope Roberto Nascimento (Wagner Moura) lida diariamente com a violência. Pressionado pela esposa a sair da linha de frente, já que eles esperam um filho, ele procura um substituto. Ao mesmo tempo, Neto (Caio Junqueira) e Mathias (André Ramiro), dois amigos e policiais, se candidatam ao curso de formação da Tropa de Elite. Vencedor do Urso de Ouro no Festival de Berlim.\n\n#Tropa de Elite 2: O Inimigo Agora é Outro (2010)\n- https://siasky.net/AACoYNL7-8gGLFKfZY8BxAKtAE_CTh_GRXc6U956fkkKdA\n\nO agora Subsecretário de Inteligência Nascimento já conseguiu desmontar o tráfico no Rio de Janeiro. Mas agora, atuando na política, ele terá que combater inimigos mais perigosos do que ele imaginava: as milícias e os políticos corruptos com interesses eleitoreiros que se aproveitam do sistema.",
				"added": 1608606222
			},
			{
				"comment_id": 43,
				"body": "#Na Natureza Selvagem (2007)\n- http://ipfs.io/ipfs/QmdbG8MaB2bpQR8AWdHWJoKRad7qhrwKqZp3ova7Jtmyy9\n\nInício da década de 90. Christopher McCandless (Emile Hirsch) é um jovem recém-formado, que decide viajar sem rumo pelos Estados Unidos em busca da liberdade. Durante sua jornada pela Dakota do Sul, Arizona e Califórnia ele conhece pessoas que mudam sua vida, assim como sua presença também modifica as delas. Até que, após dois anos na estrada, Christopher decide fazer a maior das viagens e partir rumo ao Alasca.",
				"added": 1608648075
			},
			{
				"comment_id": 44,
				"body": "#Bacurau (2019)\n- https://siasky.net/CAA18Z1IkS1_y_D9upz6j1eFHc18VEWXtOhQI9b9rR5Icw\n\nNo sertão brasileiro, a comunidade de Bacurau acaba de perder dona Carmelita, uma moradora respeitada por todos. Na cidade para o velório, Teresa (Bárbara Colen) encontra Domingas (Sônia Braga), Acácio (Thomas Aquino) e outros moradores de quem é próxima. Logo, estranhos episódios começam a acontecer e o povoado desaparece dos mapas online. O fora da lei Lunga (Silvero Pereira) então é chamado para ajudar seus conterrâneos a protegerem sua terra. Indicado à Palma de Ouro no Festival de Cannes.",
				"added": 1608649379
			},
			{
				"comment_id": 46,
				"body": "#O Gigante de Ferro (1999)\n- https://siasky.net/CACkYjR_ROQWbS7EncpW-HuZ-EXn0gFIdooOaw3vjoE_Hw\n\nEm plenos anos 50, vive no Maine o jovem Hogarth. Quando ele repentinamente encontra um gigantesco robô de origem desconhecida, logo um forte laço de amizade se forma entre os dois. Porém, assim que a existência do robô é revelada, um agente do governo logo parte em seu encalço, no intuito de destruí-lo.",
				"added": 1608654789
			},
			{
				"comment_id": 48,
				"body": "#A Lagoa Azul (1980)\n- https://siasky.net/AACqWL4n9ntN7CUahjuhPgbUFBqMXfYIsvKMYgyr_iV79g\n\nEmmeline (Brooke Shields) e Richard (Christopher Atkins), duas crianças, juntamente com Paddy Button (Leo McKern), um velho marinheiro, são os únicos sobreviventes de um naufrágio numa época em que navegar era a única forma de viajar. Após ficarem à deriva por várias horas eles vão parar em uma ilha tropical que é um verdadeiro paraíso. O lugar não oferece perigo, pois não há animais selvagens, mas após algum tempo Paddy morre. Com o tempo Emmeline e Richard se tornam adolescentes e vivem em uma cabana que eles mesmos construíram. Neste período novas emoções influenciam o relacionamento deles, os dois descobrem o amor e logo Emmeline está grávida. Na noite em que o filho deles nasce Richard descobre a origem dos tambores que eles ouvem de vez em quando no \"lado proibido\" da ilha.",
				"added": 1608675740
			},
			{
				"comment_id": 49,
				"body": "#Van Helsing: O Caçador de Monstros (2004)\n- https://siasky.net/CAC3OgssDulaqLQj3D94YJz4rTYjVvxjuKsFAnIu904LzQ\n\nNo século 19, um especialista em monstros, o dr. Van Helsing (Hugh Jackman), é contratado pela Igreja Católica para eliminar o Conde Drácula (Richard Roxburgh), o mais temido de todos os vampiros. Para isso, ele vai ao Leste Europeu e, durante sua jornada, com a ajuda de Anna Valerious (Kate Beckinsale) enfenta outros monstros, como o lobisomem (Will Kemp) e o Frankenstein (Shuler Hensley).",
				"added": 1608690895
			},
			{
				"comment_id": 50,
				"body": "#Drácula: A História Nunca Contada (2014)\n- https://siasky.net/AACgZR_HoLvAsV4p0B53ErXfxlkwHxshNBDT3vDMH7DKww\n\nNesta nova versão das origens de [Drácula](https://en.wikipedia.org/wiki/Count_Dracula), um guerreiro medieval precisa se transformar em vampiro para expulsar os invasores otomanos de seu país.",
				"added": 1608690994
			},
			{
				"comment_id": 51,
				"body": "#Na Terra de Amor e Ódio (2011)\n- https://siasky.net/AADpuPqi2hFMuI9Yt8F3XayNxeauf-VAsCxUA2JziACf7A\n\nDurante a [Guerra da Bósnia](https://en.wikipedia.org/wiki/Bosnian_War), Danijel, um soldado que lutava pelos sérvios, reencontra Ajla, uma bósnia que agora é prisioneira em seu acampamento que supervisiona. Sua conexão, antes promissora, tornou-se ambígua à medida que seus motivos mudaram.",
				"added": 1608732431
			},
			{
				"comment_id": 54,
				"body": "#Gladiador (2000)\n- https://siasky.net/CABeWj_GeMxWExmWungvwFZCIfOBNNDr5N_5IoAIPSr0QQ\n\nNos dias finais do reinado de Marcus Aurelius (Richard Harris), o imperador desperta a ira de seu filho Commodus (Joaquin Phoenix) ao tornar pública sua predileção em deixar o trono para Maximus (Russell Crowe), o comandante do exército romano. Sedento pelo poder, Commodus mata seu pai, assume a coroa e ordena a morte de Maximus, que consegue fugir antes de ser pego e passa a se esconder sob a identidade de um escravo e gladiador do Império Romano.",
				"added": 1608755205
			},
			{
				"comment_id": 55,
				"body": "#Clube da Luta (1999)\n- https://siasky.net/CADKYuOPx5lw35tq-WxzwJqRFjSY1fOYhXGkX8sL2ULNVw\n\nUm homem deprimido que sofre de insônia conhece um estranho vendedor chamado Tyler Durden e se vê morando em uma casa suja depois que seu perfeito apartamento é destruído. A dupla forma um clube com regras rígidas onde homens lutam. A parceria perfeita é comprometida quando uma mulher, Marla, atrai a atenção de Tyler.",
				"added": 1608761600
			},
			{
				"comment_id": 56,
				"body": "#Coringa (2019)\n- https://siasky.net/CAA0kZBl6O6boE1UN-s7v6wkHA9IpCOt7LMhE3FcnemKIQ\n\nJoaquin Phoenix interpreta o icônico Coringa nesta versão original e totalmente independente do emblemático arqui-inimigo, que lhe rendeu um Oscar® de Melhor Ator. Arthur Fleck (Phoenix), um comediante deficiente, ignorado e maltratado pela sociedade, é atraído pelo turbilhão de violência em uma Gotham marcada pelo crime e diferenças sociais.",
				"added": 1608768255
			},
			{
				"comment_id": 58,
				"body": "#Batman Begins (2005)\n- https://siasky.net/CAD7kT5geoeRwFDfoP3cIjY-MtBZtZvZWGxoz-1EvrjKXA\n\nDepois do assassinato de seus pais, Bruce Wayne vai treinar em uma organização suspeita e volta a Gotham City para combater o crime com uma nova identidade.\n\n#Batman: O Cavaleiro das Trevas (2008)\n- https://siasky.net/CAC-vfXglGcwXPpsdD5ukTd8stsVVlTfqeOZVybX53Ykjg\n\nBatman, tenente Gordon e o promotor público continuam a desmantelar o submundo do crime de Gotham, mas um novo vilão ameaça destruir o trabalho deles.\n\n#Batman: O Cavaleiro das Trevas Ressurge (2012)\n- http://ipfs.io/ipfs/QmPkrcg4n2h8rQdSkx8wE7h3tKVaMkGm51uWeBanKHJfZX\n\nQuando novos inimigos como a Mulher-Gato e Bane ameaçam Gotham, o bilionário Bruce Wayne volta à ativa como seu alter ego, Batman.",
				"added": 1608829390
			},
			{
				"comment_id": 63,
				"body": "#Amigos Para Sempre (1995)\n- https://ok.ru/video/37225958132\n- https://siasky.net/AADb4xzkAE11Pb0ywo0yono4EOtT0SK0che-MtvV6fGq2Q\n\nO barco de John Mccormick enfrenta um mar turbulento e vira. Seu filho de 14 anos, Angus, e o labrador recém-adotado pela família são carregados pelo mar até uma área remota. Infelizmente, os esforços de John para resgatar o filho são em vão. Agora o menino e o cachorro lutam para sobreviver em terras selvagens, criando um laço de amizade profundo e verdadeiro.",
				"added": 1608917877
			},
			{
				"comment_id": 64,
				"body": "#Sempre ao Seu Lado (2009)\n- https://siasky.net/CADGyxtlNPpv33EUItMnjRHu7hnp_1e_AEwQOs6P6x_V4w\n\nParker Wilson (Richard Gere) é um professor universitário que, ao retornar do trabalho, encontra na estação de trem um filhote de cachorro da raça [akita](http://127.0.0.1:43110/0sh.bit/?LsVL), conhecido por sua lealdade. Sem ter como deixá-lo na estação, Parker o leva para casa mesmo sabendo que Cate (Joan Allen), sua esposa, é contra a presença de um cachorro. Aos poucos Parker se afeiçoa ao filhote, que tem o nome Hachi escrito na coleira, em japonês. Cate cede e aceita sua permanência. Hachi cresce e passa a acompanhar Parker até a estação de trem, retornando ao local no horário em que o professor está de volta. Até que um acontecimento inesperado altera sua vida.",
				"added": 1608917944
			},
			{
				"comment_id": 65,
				"body": "#Jogo da Vida (2012)\n- https://siasky.net/AABElvaOBkqfKNJi1i9f7MBJ1HJ2_x2334oLjx4WiYIOCQ\n\nAkkie, menina do tipo durona, é a craque do time de futebol da escola e, ainda muito jovem, não se deu conta de que tem atração por um garoto de sua turma com quem vive em atrito. Ao ser diagnosticada com [leucemia](https://en.wikipedia.org/wiki/Leukemia) ela precisa lutar por sua vida ao lado dos pais, dos amigos e abrir seu coração para o amor.",
				"added": 1608918193
			},
			{
				"comment_id": 66,
				"body": "#Sempre Amigos (1998)\n- https://siasky.net/AAC4wiiNOLAJL1_OYRQelyCPX3X2mI5GIU8JiQvglqi3Kg\n\nUm garoto impossibilitado de andar faz uma grande amizade com outro garoto, com problemas de aprendizado e um grande trauma no passado. Com Sharon Stone, Kieran Culkin, Gena Rowlands e Gillian Anderson.",
				"added": 1608918338
			},
			{
				"comment_id": 67,
				"body": "#Ponte para Terabítia (2007)\n- https://siasky.net/EADfZnEtJlLU6nEjaHvIUx9TVtgpmeM36GUEqsMOWK_88w\n\nJess sente-se um estranho na escola e até mesmo em sua família. Durante todo o verão ele treinou para ser o garoto mais rápido da escola, mas seus planos são ameaçados por Leslie, que vence uma corrida que deveria ser apenas para garotos.",
				"added": 1608918566
			},
			{
				"comment_id": 68,
				"body": "#Instinto Selvagem (1992)\n- https://siasky.net/CAD7mexf5QlpvmxDFH4zk9Y4sgHKz46xOfVMINS2TcFyDA\n\nUm detetive investiga um assassinato brutal e tenta resistir ao charme da principal suspeita: a escritora de um livro que descreve o crime.",
				"added": 1608922134
			},
			{
				"comment_id": 69,
				"body": "#Kung-Fusão (2004)\n- https://ok.ru/video/925267725048\n- Torrent: http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:1_1KMu2u9wo1DCsc27Qt28qwLxVAjcvHZhtj/Kung+Fus+o+Dublado\n\nChina, anos 40. Sing é um delinquente que sonha fazer parte do perigoso Bando do Machado. E para isso planeja extorquir alguns vizinhos de um bloco de apartamentos. Mas será surpreendido ao descobrir que eles não são quem parecem.",
				"added": 1608926087
			},
			{
				"comment_id": 70,
				"body": "#Paixão Sem Limites (2010)\n- https://siasky.net/AACNAP_L07bPMuNl5ira8IuiY-Z3qCctoSOfQzX8iWlbpQ\n\nEm [Paixão Sem Limites](https://www.themoviedb.org/movie/61979-tres-metros-sobre-el-cielo), dois jovens de mundos completamente diferentes se apaixonam descobrem o primeiro grande amor. Babi é a garota da classe média alta, bondosa e inocente, que desperta o interesse de Hache, o garoto impulsivo e rebelde, que parece ter ímã para brigas.\n\n#Sou Louco por Você (2012)\n- https://siasky.net/AADoQjPV7wkNmtzcP-HM4ziOy0atmT9q2QGe1h40T_u17g\n\nDepois de passar dois anos em Londres, Hache está de volta à Espanha. Sabendo que chegará o fatídico momento de reencontrar o amor que deixou para trás, Babi.",
				"added": 1608936030
			},
			{
				"comment_id": 71,
				"body": "#Esporte Sangrento (1993)\n- https://siasky.net/AAADE21mAu1mSbrZbBAElG9rQkRuwxZ_B5hzYOJIS5lH-Q\n\nO ex-soldado das Forças Especiais Louis Stevens retorna a Miami para encontrar seu antigo colégio dominado por drogas e violência. Um mestre da arte marcial brasileira, capoeira, Stevens se compromete a endireitar uma dúzia dos piores alunos da escola, ensinando-lhes este estilo de luta exigente e altamente disciplinado. Lentamente, seu programa começa a funcionar, dando aos alunos uma nova esperança e propósito. Mas o traficante local, ele próprio um especialista em artes marciais, promete impedir a influência positiva de Stevens. Agora Stevens deve lutar para salvar sua própria vida, bem como a vida de seus jovens estudantes rebeldes.",
				"added": 1608945153
			},
			{
				"comment_id": 72,
				"body": "#Ela Dança, Eu Danço (2006)\n- https://siasky.net/AAAShLH3DHFdpwVU0b-f96aLrFfxns6S6MtY7CcRbW-Isg\n\nTyler (Channing Tatum) é enviado para fazer serviços comunitários em uma escola de artes após depredar um colégio. Lá, ele conhece uma aluna de dança que precisa de um novo parceiro. Ele reluta a ideia de ser esse parceiro, mas acaba concordando e aos poucos eles se apaixonam.",
				"added": 1608981995
			},
			{
				"comment_id": 73,
				"body": "#Mulher-Maravilha (2017)\n- https://siasky.net/CADcgtcqklf9XtSXD8bTmwO0RQquhP6_sq_fxoeGzJYJMQ\n\nUma princesa guerreira abre mão da segurança de sua ilha para tentar pôr fim a uma guerra que está devastando o mundo.\n\n#Mulher-Maravilha 1984 (2020)\n- http://ipfs.io/ipfs/QmU919GaA4s4Y7kARxhPTEAoXTMnvgQQimoR7bgQzUBdzb\n\n[Mulher-Maravilha 1984](https://www.themoviedb.org/movie/464052-wonder-woman-1984) acompanha Diana Prince/Mulher-Maravilha (Gal Gadot) em 1984, durante a Guerra Fria, entrando em conflito com dois grande inimigos - o empresário de mídia Maxwell Lord (Pedro Pascal) e a amiga que virou inimiga Barbara Minerva/Cheetah (Kristen Wiig) - enquanto se reúne com seu interesse amoroso Steve Trevor (Chris Pine).",
				"added": 1609015556
			},
			{
				"comment_id": 78,
				"body": "#Transcendence: A Revolução (2014)\n- http://ipfs.io/ipfs/QmeJCi4BB2pah6hvG2Xph8E6qiHQUAS4QdvPYMgXPVc5G7\n\nO Dr. Caster é o mais notável pesquisador no campo da Inteligência Artificial. Ele trabalha no projeto de criação de uma máquina capaz de combinar a inteligência coletiva de tudo o que existe com todas as emoções humanas. Os experimentos trouxeram fama ao cientista, mas o transformaram no alvo principal dos extremistas anti-tecnologia, que farão o que for necessário para destruí-lo.",
				"added": 1609043261
			},
			{
				"comment_id": 81,
				"body": "#Como Cães e Gatos (2001)\n- https://ipfs.io/ipfs/QmRwQBH7W7Ln7XgkNhVU7WSSwxWKPyVgx5FLTLQfhGkeoZ\n\nTudo o que o Prof. Brody (Jeff Goldblum) quer é descobrir uma fórmula para eliminar de vez a alergia dos homens pelos cães. Mas é exatamente essa arma que o doce gatinho, de lacinhos na cabeça e louco pelo poder, Sr. Tinkles, deseja para conquistar o mundo. - A guerra entre cães e gatos está apenas começando e o filhote de beagle, Lu, cai de paraquedas no meio dela, pois sem esperar é transformado em agente secreto, por uma organização ultrassecreta canina.\n\n#Como Cães e Gatos 2 - A Vingança de Kitty Galore (2010)\n- https://ipfs.io/ipfs/QmTKFSMEwPneFWGS8gUERQXXbC2nLDuMb9XHbNmqQLcaG1\n\nKitty Galore, ex-agente da organização de espionagem gatuna MEOWS, bola um diabólico plano para derrotar não só seus inimigos caninos, mas seus ex-colegas e fazer do mundo sua raspadeira. Com esta ameaça sem precedentes, gatos e cachorros serão obrigados a unir forças por primeira vez na história, formando uma aliança para salvarem a si mesmos... e os humanos.\n\n#Como Cães e Gatos 3: Peludos Unidos! (2020)\n- https://ipfs.io/ipfs/QmT8Xp8YP7XAcVKcbcK45E1zNJbKw2qVtFBaPbEeYQkNf8\n\nJá se passaram 10 anos desde a criação da Grande Trégua, um sistema elaborado e unificado de vigilância desenvolvido e monitorado por cães e gatos para manter a paz quando um conflito se inicia. Mas quando um vilão ciberinteligente invade as redes sem fio para usar frequências somente ouvidas por gatos e cães, ele os manipula para brigarem e a batalha mundial entre as espécies retorna. Agora, uma equipe de agentes inexperientes que nunca foi a campo usará seu instinto animal das antigas para restaurar a ordem e a paz entre cães e gatos do mundo todo.",
				"added": 1609253284
			},
			{
				"comment_id": 82,
				"body": "#Arranha-Céu: Coragem Sem Limite (2018)\n- https://siasky.net/AAB8MvL2c9NBRaUO3oF2pd_xHjA7Oq7ii4RxcPlznqKS_w\n\nQuando terroristas atacam o prédio mais alto do mundo, um consultor de segurança faz de tudo para salvar a família da carnificina.",
				"added": 1609255427
			},
			{
				"comment_id": 83,
				"body": "#Bem-vindo à Selva (2003)\n- https://siasky.net/AACoMLQ-9dp1TgEO3ZYX9A7hvavorGOftTLNmJC18Zo1eA\n\nTravis (Seann William Scott) é um jovem de família rica que foi para a Amazônia em busca de uma mina de ouro perdida, popularmente chamada de Helldorado. Para encontrá-lo sua família contrata Beck (The Rock), que parte para o Brasil à sua busca. Após alguns desentendimentos iniciais, Travis convence Beck a ajudá-lo em sua busca. Porém eles precisarão enfrentar Hatcher (Christopher Walken), o chefe de uma mineradora, que também está em busca de Helldorado.",
				"added": 1609256798
			},
			{
				"comment_id": 84,
				"body": "#Aquaman (2018)\n- https://siasky.net/CACrlLnNDEfS_R8J5evF7H_bd816GWSB2bruAXJBaYbgIA\n\nFilho da Rainha Atlanna (Nicole Kidman), Arthur (Jason Momoa) cresceu em terra apesar de sempre se sentir conectado à sua outra origem: o mar. Quando Mera (Amber Heard) anuncia que seu meio-irmão, o Rei Orm (Patrick Wilson), ameaça destruir a superfície, Aquaman assume de vez a posição de rei dos mares para proteger aqueles que ama.",
				"added": 1609264150
			},
			{
				"comment_id": 89,
				"body": "#Viagem ao Centro da Terra: O Filme (2008)\n- https://siasky.net/CACiZtM7Z8vm4T-V0dPtBzsLQ_qiyjdzl7YlXoCKxkOH-w\n\nUma intuição e a falta de fundos do laboratório de um professor de geologia o fazem partir para a Islândia em busca de um portal para o centro da Terra.",
				"added": 1609277884
			},
			{
				"comment_id": 90,
				"body": "#Viagem 2: A Ilha Misteriosa (2012)\n- https://siasky.net/EAAt6-kKQaAI9CLEXdbykoy2JpQvyIMZw8UrEPVI1vHcfw\n\nQuando seu avô envia um pedido de socorro de uma ilha exótica, o adolescente Sean Anderson conta com um aliado improvável para salvá-lo: seu próprio padrasto.",
				"added": 1609283500
			},
			{
				"comment_id": 94,
				"body": "#Superman: O Filme (1978)\n- http://ipfs.io/ipfs/QmbhE51bKArkpaLFTWQmfi1JjuQFjS2WQc1F6axtgzzssJ\n\nIncapaz de convencer o conselho dirigente de Krypton que o seu mundo vai se autodestruir em breve, o cientista Jor-El toma medidas drásticas para preservar a raça kryptoniana: Ele envia Kal-El, seu filho ainda bebê, à Terra. Lá, adquirindo superpoderes sob o sol amarelo da Terra, ele se tornará um campeão da verdade e da justiça. Criado pelos Kent, um casal de fazendeiros idosos, Clark Kent descobre que suas habilidades devem ser usadas para o bem. Já adulto, Clark viaja para Metrópolis, onde se torna um repórter de maneiras suaves para o Planeta Diário...e um assombro com uma capa, cujas proezas chocam a cidade: Superman! Enquanto isso, Lex Luthor, a maior mente criminosa do mundo, está tramando a maior fraude imobiliária de todos os tempos. Conseguirá o Homem de Aço pôr um fim a essa trama nefasta?\n\n#Superman II: A Aventura Continua (1980)\n- https://siasky.net/CADPVc2ClLF1D2IMlavxtu120NUT1iwB4p5UXcWV8E9Tbw\n\nChristopher Reeve, Gene Hackman e Margot Kidder voltam nesta sequência de sucesso de um dos filmes de super heróis mais amados já realizados. Prestes a desistir de seus poderes por amor, Superman (Reeve) é confrontado por três super criminosos de seu planeta natal, que fugiram da prisão e vieram à Terra com as mesmas habilidades do homem de aço. O insurgente imperial General Zod (Terence Stamp), a sedutora, mas sádica Ursa (Sarah Douglas) e o bruto mudo Non (Jack O'Halloran) desafiam o Superman a uma batalha cósmica pela supremacia do mundo - justo quando Superman e Lois Lane (Kidder) finalmente se envolvem romanticamente.\n\n#Superman III (1983)\n- https://siasky.net/CADWyBwoSRoZNiENIgltWQRp4kMtD1IwJG3Yw8qBL0czGg\n\nO Superman enfrenta um computador diabólico programado por um gênio da informática que pretende dominar o mundo.\n\n#Superman IV: Em Busca da Paz (1987)\n- http://ipfs.io/ipfs/QmTbmngcwG3VhcTffysiZjKJeC6BPbjZqNn1rSKrmoVcfJ\n\nLex Luthor (Gene Hackman) fabrica um homem (Mark Pillow) com a mesma estrutura molecular de Superman (Christopher Reeve), portanto, com os mesmos poderes. A criatura está programada para destruir o Homem de Aço e, quando o duelo tem início, o confronto se torna uma grande ameaça à paz mundial.\n\n#Superman - O Retorno (2006)\n- https://siasky.net/CABqaTNyo8wAArbrJ1kWjBJqGkTYK7tHhRJHmiUjS_942Q\n\nDe volta à Terra, o Super-Homem descobre que Lois Lane seguiu em frente e Lex Luthor está bolando um novo plano para dominar o mundo.",
				"added": 1609346934
			},
			{
				"comment_id": 96,
				"body": "#Shazam! (2019)\n- https://siasky.net/CABYpTrPaCGOqs-8CqjivPJJf-guAYUEFXnja9YaMHY1aQ\n\nO maior sonho de toda criança - e não tão criança assim - é ter superpoderes. O universo cinematográfico da DC nos apresenta Billy Batson, um jovem órfão que, graças a um misterioso feiticeiro, se torna um super-herói dizendo \"Shazam!\" Em um corpo adulto e com o coração de menino, Billy precisa aprender a usar seus novos poderes para combater as forças do mal.",
				"added": 1609385957
			},
			{
				"comment_id": 99,
				"body": "#Ender's Game: O Jogo do Exterminador (2013)\n- https://siasky.net/AAB44r3IJEe5T3QUVRDmoXQ27becqd2gkOkqGQQM2PnK6g\n\nPara prevenir um novo ataque alienígena, a força militar treina jovens com habilidades em videogames. Ender Wiggin é o melhor deles.",
				"added": 1609471567
			},
			{
				"comment_id": 102,
				"body": "#King Kong (1976)\n- https://siasky.net/CADItehzGdRWjfXfeDKBdwjTpcDQy8C9zWdqR174tvI-KA\n\nEm Surabaya, Indonésia, parte uma navio da companhia Petrox, que tem como objetivo procurar novos lençóis petrolíferos. No meio da viagem um fotógrafo clandestino avista um bote e nele estava Dwan, uma bela mulher que tinha sido a única sobrevivente de um naufrágio, ao chegarem a uma ilha desconhecida os tripulantes se deparam com uma cerimônia tribal, na qual ofereciam uma jovem da aldeia e o feiticeiro caracterizado como um macaco representava o \"noivo\", mas quando vêem Dwan propõem trocar seis mulheres por ela e, como nada conseguem de imediato, os nativos esperam anoitecer e a sequestram, dando-a em sacrifício para um gigantesco gorila.\n\n#King Kong 2 (1986)\n- https://ok.ru/video/800074959602\n\nO filme começa onde parou a versão de 1976, com King Kong morto sendo levado a um laboratório onde cientistas implantam um coração mecânico, mas para ressuscitar o monstro seria necessário encontrar sangue de outra criatura da mesma espécie. Uma expedição encontra uma fêmea na floresta amazônica e a leva para os EUA, desta vez criando uma história de amor entre os dois gorilas, que inclusive terão um filhote.",
				"added": 1609511194
			},
			{
				"comment_id": 103,
				"body": "#Jogador N° 1 (2018)\n- https://siasky.net/CADu_8C08_OzSlvgHovKiO6DU-XZv_XfZ_JgOssLJfiSLw\n\nEm 2045, a população mundial vive para jogar OASIS, um game de realidade virtual onde você pode ser quem quiser. Quando seu criador (Mark Rylance) morre, ele deixa um desafio: quem encontrar um easter egg se tornará o novo dono do jogo e receberá meio trilhão de dólares. Jogador do OASIS, o órfão Wade (Tye Sheridan) vai em busca do prêmio, mas acaba liderando uma revolução que irá definir o futuro da humanidade. Dirigido por Steven Spielberg e indicado ao Oscar de Melhores Efeitos Visuais.",
				"added": 1609530809
			},
			{
				"comment_id": 110,
				"body": "#Wolverine: Imortal (2013)\n- https://siasky.net/CAATVhFCwSdB6pMTFXdn_RSjWt_VDlqaq3-VQmFHjPB_ZA\n\nWolverine vai ao Japão para encontrar um velho amigo cuja vida ele salvou anos atrás, e se envolve em uma conspiração envolvendo [yakuza](https://en.wikipedia.org/wiki/Yakuza) e mutantes.",
				"added": 1609565202
			},
			{
				"comment_id": 112,
				"body": "#O Diabo de Cada Dia (2020)\n- http://ipfs.io/ipfs/QmUGZKEY9GPJqmZdxrY5PKmjox4WztJEMe7VepLCwE6VUx\n\nEm um lugar tomado por corrupção e violência, um jovem enfrenta figuras sinistras para proteger quem mais ama.",
				"added": 1609610045
			},
			{
				"comment_id": 114,
				"body": "#Super Escola de Heróis (2005)\n- https://view.axel.org/item/c3df1ad8e78add00\n\nO filho de heróis lendários, Will Stronghold carrega enormes expectativas quando ele entra em uma escola conhecida por moldar os heróis de amanhã. No entanto, sua busca para emergir das sombras de seus pais torna-se ainda mais difícil uma vez que a escola o rotula como \"ajudante de herói\". Ele vai aprender que é preciso lealdade e trabalho em equipe para realmente se tornar um herói.",
				"added": 1609620101
			},
			{
				"comment_id": 123,
				"body": "#Estrelas Além do Tempo (2016)\n- https://view.axel.org/item/689e503dc209dc0a\n\nDurante a corrida espacial, três matemáticas negras [Katherine Johnson](https://en.wikipedia.org/wiki/Katherine_Johnson) (Taraji P. Henson), [Dorothy Vaughn](https://en.wikipedia.org/wiki/Dorothy_Vaughan) (Octavia Spencer) e [Mary Jackson](http://127.0.0.1:43110/0sh.bit/?BAwf) (Janelle Monáe) tentam se autoafirmar dentro da [NASA](https://en.wikipedia.org/wiki/NASA), ainda muito racista e sexista. Enquanto lidam com o chefe (Kevin Costner) e o funcionário Paul (Jim Parsons), que tenta sabotá-las. Baseado em uma história real, o longa foi indicado a três Oscars, incluindo o de Melhor Filme.",
				"added": 1609792798
			},
			{
				"comment_id": 125,
				"body": "#Lucy (2014)\n- https://siasky.net/AACex-4b87DnOXLb5D-q7qrR4xb9PO5vGSczpeRTju6E-w\n\nQuando uma jovem americana em [Taiwan](https://en.wikipedia.org/wiki/Taiwan) é forçada a servir de [mula](https://web.archive.org/web/20200810121055/https://mundoeducacao.uol.com.br/drogas/trafico-droga-mulas.htm), uma droga de alta tecnologia se espalha pelo seu corpo e a transforma em uma poderosa super-humana.",
				"added": 1609814376
			},
			{
				"comment_id": 147,
				"body": "#O Incrível Hulk (2008)\n- https://siasky.net/AAB3m5_JtzsDbOBmGF5E2yjrJQbk7xd8KHVuc2_q6fWiuQ\n\nVivendo escondido e longe de Betty Ross (Liv Tyler), a mulher que ama, o cientista Bruce Banner (Edward Norton) busca um meio de retirar a radiação gama que está em seu sangue. Ao mesmo tempo ele precisa fugir da perseguição do general Ross (William Hurt), seu grande inimigo, e da máquina militar que tenta capturá-lo, na intenção de explorar o poder que faz com que Banner se transforme no Hulk.",
				"added": 1610326543
			},
			{
				"comment_id": 148,
				"body": "#O Lobisomem (2010)\n- https://siasky.net/CAB9t3TetV46Qqmuiq9BAaXFl_FoRWtt9RczgnzuLXqSZA\n\nO ator Lawrence Talbot (Benicio Del Toro), quando criança, sofreu com a morte de sua mãe e nunca mais voltou a morar com o pai (Anthony Hopkins). Mais de duas décadas depois do ocorrido, ele é chamado por sua futura cunhada Gwen Conliffe (Emily Blunt) para ajudá-la a encontrar o noivo desaparecido. Ao retornar para a casa do pai, Talbot acaba se envolvendo numa investigação sobre violentas mortes que acontecem nas noites de lua cheia, entrando em contato com o seu passado e descobrindo um segredo que mudará para sempre a sua vida.",
				"added": 1610330999
			},
			{
				"comment_id": 150,
				"body": "#Legião (2010)\n- https://siasky.net/AACXfg2fb7LQJbYTicraOVN_SadA_kgs_-U0mEAG05puXw\n\nSinopse: https://www.themoviedb.org/movie/22894-legion",
				"added": 1610331359
			},
			{
				"comment_id": 152,
				"body": "#Filho de Caim (2013)\n- https://ok.ru/video/1893820205703\n- https://siasky.net/CACSTt2UNwI0wzj7gRH1gRoBSJnqPA9Mnrb7PU7asjVdng\n\nNico (David Solans) é um adolescente problemático e peculiar cuja maior obsessão na vida é jogar xadrez. Preocupado com os problemas de sociabilidade do filho, seu pai contrata um psicólogo que também joga xadrez para que a comunicação seja facilitada. No entanto, o que aparentava ser um pequeno problema de família, logo revela-se como algo muito mais sombrio e complexo.",
				"added": 1610381679
			},
			{
				"comment_id": 155,
				"body": "#O Homem Bicentenário (1999)\n- https://ok.ru/video/1475521874651\n- https://siasky.net/CAAd2IzAtKXsaZlspz6-2J5Ea2lzcT8O-S-fP0ZvTClNTg\n\nQuem disse que os robôs e os computadores nunca desenvolveriam a capacidade de sentir, criar e amar? Esse filme relata a busca inesgotável de um androide chamado Andrew adotado por Richard Martin e sua família.\n\n#O Homem Bicentenário | Deveria um ser humano viver para sempre?\n- https://invidious.snopyta.org/_d_RIl8G-SA\n- https://siasky.net/AACsVSFYNBbKaB9CfFtY4QVb9HvKDYWRNUui1eyy-zNNiw",
				"added": 1610499019
			},
			{
				"comment_id": 156,
				"body": "#O Vidente (2007)\n- https://siasky.net/CACFZaWAIpe7XxpgX88fuJ-lJMvWg_8MZLn8bYWClnd26A\n\nCris Johnson ganha a vida fazendo mágicas em Las Vegas, mas sua capacidade de ver alguns minutos no futuro é real. A agente Callie Ferris sabe disso e o recruta para ajudá-la a impedir um grupo terrorista de detonar uma bomba nuclear.",
				"added": 1610550106
			},
			{
				"comment_id": 159,
				"body": "#Cidade das Sombras (2008)\n- https://ok.ru/video/381470509584\n- https://siasky.net/AACNYdGZWv4Iy0gHGQgz1QmybjC3kML_rvkmYCBQ_aYHEw\n\nUm grupo de pesquisadores constrói uma cidade subterrânea e superprotegida em decorrência do fim do mundo. A cidade se chama Embers e foi planejada para durar 200 anos. Porém, com o passar do tempo, os recursos do lugar vão chegando ao fim. E agora os moradores buscam ma saída até a superfície. Dois jovens encontram um mapa que pode solucionar o problema da população de Embers.",
				"added": 1610666922
			},
			{
				"comment_id": 162,
				"body": "#Palavras nas Paredes do Banheiro (2020)\n- https://siasky.net/AAACynhd8E11V4qJVCCr5yOTBLmvYxuicmYbRvbRPns9PQ\n\nUm adolescente que sofre de [esquizofrenia paranoica](https://web.archive.org/web/20201129200717/https://www.tuasaude.com/esquizofrenia-paranoide/) espera que seu novo tratamento com uma droga experimental lhe permita levar uma vida normal tanto na escola como fora dela.",
				"added": 1610808768
			},
			{
				"comment_id": 163,
				"body": "#A Lenda do Guerreiro do Fogo (2007)\n- https://ok.ru/video/41078164082\n- https://siasky.net/CADYYGKJwIml3VSZ-d8OiAmPNShV7WufIf5uf5c1MspZkA\n\nÉ baseado em um acontecimento real e que retrata a vida de [um grande rei que governou o Sião entre os anos de 1590 a 1605](https://en.wikipedia.org/wiki/Naresuan). Ali, ele comandou as suas tropas com valentia e inteligência, e ainda libertou um reino que estava invadido pelas tropas da birmanesas. O homem que é retratado nesse filme é considerado um dos grandes estrategistas militares de sua época, e sua lenda é tão forte na Tailândia que a força de seus atos resistem e são lembrados até os dias de hoje.\n\n#Parte 02:\n- https://ok.ru/video/623137721087\n\n#Parte 03:\n- https://ok.ru/video/623444888319\n\n#Parte 04:\n- https://ok.ru/video/623671905023\n\n#Parte 05:\n- https://ok.ru/video/623901739775\n\n#Parte 06:\n- https://ok.ru/video/1789740190441\n\n#Legendas:\n- https://www.opensubtitles.com/pt-BR/movies/2007-naresuan",
				"added": 1610831533
			},
			{
				"comment_id": 168,
				"body": "#Venom (2018)\n- https://siasky.net/AACh_brwbU_rcUAl1iba2EshoMVaDWCTK3mjG2vKMX0kWg\n\nEddie Brock (Tom Hardy) é um jornalista investigativo frustrado que, acidentalmente, tem seu corpo fundido a um alien simbionte. Resultado de um experimento secreto na fundação de um milionário (Riz Ahmed), a entidade dá ao jornalista um maléfico alter ego: o bizarro [Venom](http://127.0.0.1:43110/0sh.bit/?qAZx). Ao passo que investiga o que está acontecendo, o anti-herói luta contra uma sensação de poder que acaba mexendo com a sua cabeça.",
				"added": 1610986760
			},
			{
				"comment_id": 169,
				"body": "#Expresso do Amanhã (2013)\n- https://siasky.net/CABv1kJeHWhuDMhNxAuDphm4jvIVQw4XAi4UwWNp_263Lg\n\nOs únicos sobreviventes de uma fracassada tentativa de conter o aquecimento global são obrigados a viver em um trem separados em vagões que determinam sua condição social.\n\n#Expresso do Amanhã | Quando o mundo sai dos trilhos\n- https://invidious.snopyta.org/JdWQVH1qh9o\n- https://siasky.net/AAB_e4-RYS6hMAw01WVfd2Fg-M-laG6Dddde63vvZQxIAg",
				"added": 1611082366
			},
			{
				"comment_id": 171,
				"body": "#A Sombra e a Escuridão (1996)\nNo final do século XIX, um engenheiro (Val Kilmer) vai para a África construir uma ponte, mas acaba se deparando com dois leões assassinos que aterrorizam os operários, pois várias vítimas são feitas e mesmo com a chegada de um experiente caçador (Michael Douglas), as mortes continuam.\n- https://ok.ru/video/2412368235143\n- https://siasky.net/AAD2pj8yv_ZkQsVwXkEaAsx186vnOBXc_9Oh1B8oa7JXtg",
				"added": 1611173466
			},
			{
				"comment_id": 195,
				"body": "#Sexta-Feira 13\n\"[Sexta-Feira 13](https://www.themoviedb.org/collection/9735-friday-the-13th-collection)\" é uma franquia de terror americana que conta com doze filmes slasher, um programa de televisão, romances, histórias em quadrinhos, jogos eletrônicos e produtos tie-in. A franquia concentra-se principalmente no personagem fictício Jason Voorhees, o qual se afogou, quando garoto, em Camp Crystal Lake devido à negligência da equipe do acampamento. Décadas depois, surgem boatos de que o lago está \"amaldiçoado\" e este, consequentemente, torna-se o cenário de uma série de assassinatos em massa. Jason é destaque em todos os filmes, seja como matador ou como motivação para os assassinatos.\n- [Sexta-Feira 13 (1980)](https://siasky.net/AAA-3PVFEuF6NJL3W-K1S7cDBhEMhbjiduQbM62-4L4gOw)\n- [Sexta-Feira 13 - Parte 2 (1981)](https://view.axel.org/item/b24c3f59fe0fdc09)\n- [Sexta-Feira 13 - Parte 3 (1982)](https://siasky.net/AAAL0FC-y32syY_p8oe2bzpTWDOjWidTxrZwQ9HCrisDEg)\n- [Sexta-Feira 13: Capítulo Final (1984)](https://siasky.net/AAB9WNdqj8AKjfv3kj2CDN16SyRuxD7_4lOZnncdTs-87g)\n- [Sexta-Feira 13 - Parte V: Um Novo Começo (1985)](https://siasky.net/AAAZliEA0GeN_vZb5KWAONsCqxSHCtLrn61wZFBHWnOCxA)\n- [Sexta-Feira 13 - Parte VI: Jason Vive (1986)](https://siasky.net/AABfKeeGLB7pwGT1QFSvLcPiuKzW41n6yNYpuDXPc7T31Q)\n- [Sexta-Feira 13 - Parte VII: A Matança Continua (1988)](https://siasky.net/AADYl2JZB0mCWs_f3f9wz5gL1FmIueIXvjcyQ3Qbc8cUdA)\n- [Sexta-Feira 13 - Parte VIII: Jason Ataca Nova York (1989)](https://siasky.net/AACh-lnboSs6R-hiUqs7Tl7qDLEmU1kIbor4rab2ELg4mQ)\n- [Jason Vai para o Inferno: A Última Sexta-Feira (1993)](https://siasky.net/AADML3ayM-dJRUqHbWb7D2g5zQSR_2c3mHiYZ-Sr07rCqA)\n- [Jason X (2001)](https://siasky.net/AACUsFj_HLnLayFGJXVyeut8R3fXf198p_nPCsdl-zjJXA)\n- [Freddy X Jason (2003)](https://siasky.net/AADbZsYZ_ggLe5Je6HnziwcD-5NNRNEth6tMZ4bCXTFtFg)\n- [Sexta-Feira 13 (2009)](https://siasky.net/AAD74NG8m6HEjzwtVjK2BeceTkjR2X902Ebp6VzGf-pFig)",
				"added": 1611417675
			},
			{
				"comment_id": 196,
				"body": "#A propriedade intelectual é um roubo: Nintendo e a pirataria\n- https://invidious.snopyta.org/QnRWSv1po6g\n- https://siasky.net/AAAf39bc-haKgiYDteBy9dah-serX8zUeuu_AlBHiEaaVg\n\nA [Nintendo](https://en.wikipedia.org/wiki/Nintendo) e a [pirataria](https://en.wikipedia.org/wiki/Copyright_infringement) têm uma longa história - a empresa já há anos é famosa por processar sites de emuladores e roms, ir atrás de programadores que fazem fan games, tentar tirar do mercado periféricos para seus consoles... Mas será que a relação que a Nintendo tem com a sua propriedade intelectual em relação à pirataria é justificável? E será que o problema é só a Nintendo?\nVamos dar uma olhada na história da propriedade intelectual e tentar desnudar o que está por trás das políticas de patente, dos processos por pirataria e dos discursos que tentam convencer a gente de que pirataria é roubo.\nNesse vídeo, vamos partir do exemplo da Nintendo para olhar para a indústria dos games em geral, e da indústria dos games para olhar para a indústria do software, e da indústria do software para tentar entender por que a propriedade intelectual foi inventada, tudo isso para oferecer uma tese: que pirataria não é roubo. Roubo, mesmo, é a propriedade intelectual.",
				"added": 1611418039
			},
			{
				"comment_id": 216,
				"body": "#A Chegada (2016)\n- https://siasky.net/AABnES_1E7BypxDekI36aTP5KwfZtL2v07-lBgP6prcFNA\n\nUma linguista encarregada de encontrar uma forma de se comunicar com aliens que chegaram à Terra descobre uma conexão que pode mudar sua vida e a do mundo.\n\n#A língua alienígena de A Chegada | Nerdologia\n- https://invidious.snopyta.org/V4GEKqI25EU\n- https://ipfs.io/ipfs/QmXZ8NXQgUQUWkgvT9owhLhAwWBsjCWkjP3QPxgTWuwFi1",
				"added": 1611844909
			},
			{
				"comment_id": 221,
				"body": "#O Curioso Caso de Benjamin Button (2008) \n- https://siasky.net/CABd8pS0GmFMjkdNTRTdxphOTfzKhHxdv816CBdhA-mCRg\n\nNova Orleans, 1918. Benjamin Button (Brad Pitt) nasceu de forma incomum, com a aparência e doenças de uma pessoa em torno dos oitenta anos mesmo sendo um bebê. Ao invés de envelhecer com o passar do tempo, Button rejuvenesce. Quando ainda criança ele conhece Daisy (Cate Blanchett), da mesma idade que ele, por quem se apaixona. É preciso esperar que Daisy cresça, tornando-se uma mulher, e que Benjamin rejuvenesça para que, quando tiverem idades parecidas, possam enfim se envolver.",
				"added": 1611864745
			},
			{
				"comment_id": 223,
				"body": "#O Lobo de Wall Street (2013)\n- https://siasky.net/CABbLej-en4bLrTVim_OtdfBtYJee4d3StfLsX7sCsfbmA\n\nJordan Belfort é um ambicioso corretor da bolsa de valores que chega a níveis incríveis de riqueza, mas seus métodos não são totalmente legais. Isto o levará a enfrentar problemas com a lei, enquanto ele e seus amigos caem em um abismo de excessos. Filme baseado em fatos reais, estrelado por Leonardo DiCaprio, Jonah Hill e Mathew McConaughey, sob direção de Martin Scorsese.",
				"added": 1611945244
			},
			{
				"comment_id": 227,
				"body": "#O Milagre em Cokeville (2015)\n- https://siasky.net/AADC2nhmnkm56VsUmE5erx2d8UuDilRdUgb1YpVG6fhNrA\n\nAs crianças insistem em tentar provar que o que aconteceu em sua escola primária foi um milagre, mas os adultos torcem o nariz para esta versão. [Baseado em fatos reais](https://en.wikipedia.org/wiki/Cokeville_Elementary_School_hostage_crisis), o filme conta a história das crianças que, em 1986, foram mantidas reféns em sua escola, na pequena cidade de Cokeville, e afirmam que coisas mirabolantes aconteceram no local.",
				"added": 1612023172
			},
			{
				"comment_id": 230,
				"body": "#Wanda Nevada (1979)\n- https://ok.ru/video/561378298555\n- https://view.axel.org/item/f08d3f531c0fdc09\n\nBeaudray Demerille (Peter Fonda) é um trapaceiro que ganha uma jovem órfã chamada Wanda Nevada (Brooke Shields) em um jogo de [pôquer](https://en.wikipedia.org/wiki/Poker). Após uma confusão, onde o jogador adversário é baleado, ele e a garota fogem da cidade. Eles acabam conhecendo um velho garimpeiro, que garante ter encontrado ouro em uma mina no [Grand Canyon](https://en.wikipedia.org/wiki/Grand_Canyon). Mas o velho é assassinado por uma dupla de gângsteres, crime que é testemunhado pela garota. Beaudray e Wanda decidem ir então à procura da mina, sendo seguidos pela dupla de marginais.",
				"added": 1612053399
			},
			{
				"comment_id": 235,
				"body": "#Besouro (2009)\n- https://siasky.net/CAAO3fUYDOzhYiIshVXaM9ew67o6EnGMxHaYtzZXHnGTAw\n\nBaseado na vida de um [lendário lutador de capoeira baiano](https://pt.wikipedia.org/wiki/Besouro_Mangang%C3%A1), \"[Besouro](https://www.themoviedb.org/movie/23854-besouro)\" conta a fantástica história de um jovem brasileiro de ascendência africana em busca de sua missão.",
				"added": 1612105617
			},
			{
				"comment_id": 236,
				"body": "#As Aventuras de Peabody e Sherman (2014)\n- https://ok.ru/video/87937059349\n- https://siasky.net/AABon6sngbIt8JMcpFmSg7B8xvCvc1N3Gv7QM6b4915BgQ\n\nMr. Peabody é um cientista, chef, medalhista olímpico e um verdadeiro gênio. E um detalhe: é um cão. Ele e seu filho adotivo Sherman planejam viajar no tempo para conhecer grandes figuras da história, mas estão prestes a mudar o futuro!",
				"added": 1612110612
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 4,
				"body": "Jesus, cheio do Espírito Santo, voltou do Jordão e foi levado pelo Espírito ao deserto,\nonde, durante quarenta dias, foi tentado pelo diabo. Não comeu nada durante esses dias e, ao fim deles, teve fome.\nO diabo lhe disse: \"Se você é o Filho de Deus, mande a esta pedra que se transforme em pão\".\nJesus respondeu: \"Está escrito: ‘Nem só de pão viverá o homem’ \".\nO diabo o levou a um lugar alto e mostrou-lhe num relance todos os reinos do mundo.\nE lhe disse: \"Eu lhe darei toda a autoridade sobre eles e todo o seu esplendor, porque me foram dados e posso dá-los a quem eu quiser.\nEntão, se você me adorar, tudo será seu\".\nJesus respondeu: \"Está escrito: ‘Adore o Senhor, o seu Deus e só a ele preste culto’\".\nO diabo o levou a Jerusalém, colocou-o na parte mais alta do templo e lhe disse: \"Se você é o Filho de Deus, jogue-se daqui para baixo.\nPois está escrito: ‘Ele dará ordens a seus anjos a seu respeito, para lhe guardarem;\ncom as mãos eles os segurarão, para que você não tropece em alguma pedra’\".\nJesus respondeu: \"Dito está: ‘Não ponha à prova o Senhor, o seu Deus’\".\nTendo terminado todas essas tentações, o diabo o deixou até ocasião oportuna.\nJesus voltou para a Galiléia no poder do Espírito, e por toda aquela região se espalhou a sua fama.\nEnsinava nas sinagogas, e todos o elogiavam.\nEle foi a Nazaré, onde havia sido criado, e no dia de sábado entrou na sinagoga, como era seu costume. E levantou-se para ler.\nFoi-lhe entregue o livro do profeta Isaías. Abriu-o e encontrou o lugar onde está escrito:\n\"O Espírito do Senhor está sobre mim, porque ele me ungiu para pregar boas novas aos pobres. Ele me enviou para proclamar liberdade aos presos e recuperação da vista aos cegos, para libertar os oprimidos\ne proclamar o ano da graça do Senhor\".\nEntão ele fechou o livro, devolveu-o ao assistente e assentou-se. Na sinagoga todos tinham os olhos fitos nele;\ne ele começou a dizer-lhes: \"Hoje se cumpriu a Escritura que vocês acabaram de ouvir\".\nTodos falavam bem dele, e estavam admirados com as palavras de graça que saíam de seus lábios. Mas perguntavam: \"Não é este o filho de José? \"\nJesus lhes disse: \"É claro que vocês me citarão este provérbio: ‘Médico, cura-te a ti mesmo! ’ Faze aqui em tua terra o que ouvimos que fizeste em Cafarnaum\".\nContinuou ele: \"Digo-lhes a verdade: Nenhum profeta é aceito em sua terra.\nAsseguro-lhes que havia muitas viúvas em Israel no tempo de Elias, quando o céu foi fechado por três anos e meio, e houve uma grande fome em toda a terra.\nContudo, Elias não foi enviado a nenhuma delas, senão a uma viúva de Sarepta, na região de Sidom.\nTambém havia muitos leprosos em Israel no tempo de Eliseu, o profeta; todavia, nenhum deles foi purificado: somente Naamã, o sírio\".\nTodos os que estavam na sinagoga ficaram furiosos quando ouviram isso.\nLevantaram-se, expulsaram-no da cidade e o levaram até ao topo da colina sobre a qual fora construída a cidade, a fim de atirá-lo precipício abaixo.\nMas Jesus passou por entre eles e retirou-se.\nEntão ele desceu a Cafarnaum, cidade da Galiléia, e, no sábado, começou a ensinar o povo.\nTodos ficavam maravilhados com o seu ensino, porque falava com autoridade.\nNa sinagoga havia um homem possesso de um demônio, de um espírito imundo. Ele gritou com toda a força:\n\"Ah! que queres conosco, Jesus de Nazaré? Vieste para nos destruir? Sei quem tu és: o Santo de Deus! \"\nJesus o repreendeu, e disse: \"Cale-se e saia dele! \" Então o demônio jogou o homem no chão diante de todos, e saiu dele sem o ferir.\nTodos ficaram admirados, e diziam uns aos outros: \"Que palavra é esta? Até aos espíritos imundos ele dá ordens com autoridade e poder, e eles saem! \"\nE a sua fama se espalhava por toda a região circunvizinha.\nJesus saiu da sinagoga e foi à casa de Simão. A sogra de Simão estava com febre alta, e pediram a Jesus que fizesse algo por ela.\nEstando ele em pé junto dela, inclinou-se e repreendeu a febre, que a deixou. Ela se levantou imediatamente e passou a servi-los.\nAo pôr-do-sol, o povo trouxe a Jesus todos os que tinham vários tipos de doenças; e ele os curou, impondo as mãos sobre cada um deles.\nAlém disso, de muitas pessoas saíam demônios gritando: \"Tu és o Filho de Deus! \" Ele, porém, os repreendia e não permitia que falassem, porque sabiam que ele era o Cristo.\nAo romper do dia, Jesus foi para um lugar solitário. As multidões o procuravam, e, quando chegaram até onde ele estava, insistiam que não as deixasse.\nMas ele disse: \"É necessário que eu pregue as boas novas do Reino de Deus noutras cidades também, porque para isso fui enviado\".\nE continuava pregando nas sinagogas da Judéia.\n\n- Lucas 4:1-44",
				"added": 1608255218
			},
			{
				"comment_id": 7,
				"body": "O vinho é zombadore a bebida fermentada provoca brigas; não é sábio deixar-se dominar por eles.\nO medo que o rei provoca é como o do rugido de um leão; quem o irrita põe em risco a própria vida.\nÉ uma honra dar fim a contendas, mas todos insensatos envolvem-se nelas.\nO preguiçoso não ara a terra na estação própria; mas na época da colheita procura, e não acha nada.\nOs propósitos do coração do homem são águas profundas, mas quem tem discernimento os traz à tona.\nMuitos se dizem amigos leais, mas um homem fiel, quem poderá achar?\nO homem justo leva uma vida íntegra; como são felizes os seus filhos!\nQuando o rei se assenta no trono para julgar, com o olhar esmiúça todo o mal.\nQuem poderá dizer: \"Purifiquei o coração; estou livre do meu pecado? \"\nPesos adulterados e medidas falsificadas, são coisas que o Senhor detesta.\nAté a criança mostra o que é por suas ações; o seu procedimento revelará se ela é pura e justa.\nOs ouvidos que ouvem e os olhos que vêem foram feitos pelo Senhor.\nNão ame o sono, ou você acabará ficando pobre; fique desperto, e terá alimento de sobra.\n\"Não vale isso! Não vale isso! \", diz o comprador, mas, quando se vai, gaba-se do bom negócio.\nMesmo onde há ouro e rubis em grande quantidade, os lábios que transmitem conhecimento são uma rara preciosidade.\nTome-se a veste de quem serve de fiador ao estranho; sirva ela de penhor de quem dá garantia a uma mulher leviana.\nSaborosa é a comida que se obtém com mentiras, mas depois dá areia na boca.\nOs conselhos são importantes para quem quiser fazer planos, e quem sai à guerra precisa de orientação.\nQuem vive contando casos não guarda segredo; por isso, evite quem fala demais.\nSe alguém amaldiçoar seu pai ou sua mãe, a luz de sua vida se extinguirá na mais profunda escuridão.\nA herança que se obtém com ganância no princípio, no final não será abençoada.\nNão diga: \"Eu o farei pagar pelo mal que me fez! \" Espere pelo Senhor, e ele dará a vitória a você.\nO Senhor detesta pesos adulterados, e balanças falsificadas não o agradam.\nOs passos do homem são dirigidos pelo Senhor. Como poderia alguém discernir o seu próprio caminho?\nÉ uma armadilha consagrar algo precipitadamente, e só pensar nas conseqüências depois que se fez o voto.\nO rei sábio abana os ímpios, e passa sobre eles a roda de debulhar.\nO espírito do homem é a lâmpada do Senhor, e vasculha cada parte do seu ser.\nA bondade e a fidelidade preservam o rei; por sua bondade ele dá firmeza ao seu trono.\nA beleza dos jovens está na sua força; a glória dos idosos, nos seus cabelos brancos.\nOs golpes e os ferimentos eliminam o mal; os açoites limpam as profundezas do ser.\n\n- Provérbios 20:1-30",
				"added": 1608304475
			},
			{
				"comment_id": 12,
				"body": "Deus é o nosso refúgio e a nossa fortaleza, auxílio sempre presente na adversidade.\nPor isso não temeremos, embora a terra trema e os montes afundem no coração do mar,\nembora estrondem as suas águas turbulentas e os montes sejam sacudidos pela sua fúria. Pausa\nHá um rio cujos canais alegram a cidade de Deus, o Santo Lugar onde habita o Altíssimo.\nDeus nela está! Não será abalada! Deus vem em seu auxílio desde o romper da manhã.\nNações se agitam, reinos se abalam; ele ergue a voz, e a terra se derrete.\nO Senhor dos Exércitos está conosco; o Deus de Jacó é a nossa torre segura. Pausa\nVenham! Vejam as obras do Senhor, seus feitos estarrecedores na terra.\nEle dá fim às guerras até os confins da terra; quebra o arco e despedaça a lança, destrói os escudos com fogo.\n\"Parem de lutar! Saibam que eu sou Deus! Serei exaltado entre as nações, serei exaltado na terra. \"\nO Senhor dos Exércitos está conosco; o Deus de Jacó é a nossa torre segura. Pausa\n\n- Salmos 46:1-11",
				"added": 1608331859
			},
			{
				"comment_id": 16,
				"body": "Bendito seja o Senhor, a minha Rocha, que treina as minhas mãos para a guerra e os meus dedos para a batalha.\nEle é o meu aliado fiel, a minha fortaleza, a minha torre de proteção e o meu libertador, é o meu escudo, aquele em quem me refugio. Ele subjuga a mim os povos.\nSenhor, que é o homem para que te importes com ele, ou o filho do homem para que por ele te interesses?\nO homem é como um sopro; seus dias são como uma sombra passageira.\nEstende, Senhor, os teus céus e desce; toca os montes para que fumeguem.\nEnvia relâmpagos e dispersa os inimigos; atira as tuas flechas e faze-os debandar.\nDas alturas, estende a tua mão e liberta-me; salva-me da imensidão das águas, das mãos desses estrangeiros,\nque têm lábios mentirosos e com a mão direita erguida juram falsamente.\nCantarei uma nova canção a ti, ó Deus; tocarei para ti a lira de dez cordas,\npara aquele que dá vitória aos reis, que livra o seu servo Davi da espada mortal.\nDá-me libertação; salva-me das mãos dos estrangeiros, que têm lábios mentirosos e que, com a mão direita erguida, juram falsamente.\nEntão, na juventude, os nossos filhos serão como plantas viçosas, e as nossas filhas, como colunas esculpidas para ornar um palácio.\nOs nossos celeiros estarão cheios das mais variadas provisões. Os nossos rebanhos se multiplicarão aos milhares, às dezenas de milhares em nossos campos;\no nosso gado dará suas crias; não haverá praga alguma nem aborto. Não haverá gritos de aflição em nossas ruas.\nComo é feliz o povo assim abençoado! Como é feliz o povo cujo Deus é o Senhor!\n\n- Salmos 144:1-15",
				"added": 1608378127
			},
			{
				"comment_id": 17,
				"body": "A ti eu clamo, Senhor, minha Rocha; não fiques indiferente para comigo. Se permaneceres calado, serei como os que descem à cova.\nOuve as minhas súplicas quando clamo a ti por socorro, quando ergo as mãos para o teu Lugar Santíssimo.\nNão me dês o castigo reservado para os ímpios e para os malfeitores, que falam como amigos com o próximo, mas abrigam maldade no coração.\nRetribui-lhes conforme os seus atos, conforme as suas más obras; retribui-lhes pelo que as suas mãos têm feito e dá-lhes o que merecem.\nVisto que não consideram os feitos do Senhor, nem as obras de suas mãos, ele os arrasará e jamais os deixará reerguer-se.\nBendito seja o Senhor, pois ouviu as minhas súplicas.\nO Senhor é a minha força e o meu escudo; nele o meu coração confia, e dele recebo ajuda. Meu coração exulta de alegria, e com o meu cântico lhe darei graças.\nO Senhor é a força do seu povo, a fortaleza que salva o seu ungido.\nSalva o teu povo e abençoa a tua herança! Cuida deles como o seu pastor e conduze-os para sempre.\n\n- Salmos 28:1-9",
				"added": 1608378258
			},
			{
				"comment_id": 18,
				"body": "Ditados de Agur, filho de Jaque; oráculo: Este homem declarou a Itiel; a Itiel e a Ucal:\n\"Sou o mais tolo dos homens; não tenho o entendimento de um ser humano.\nNão aprendi sabedoria, nem tenho conhecimento do Santo.\nQuem subiu aos céus e desceu? Quem ajuntou nas mãos os ventos? Quem embrulhou as águas em sua capa? Quem fixou todos os limites da terra? Qual é o seu nome, e o nome do seu filho? Conte-me, se você sabe!\n\"Cada palavra de Deus é comprovadamente pura; ele é um escudo para quem nele se refugia.\nNada acrescente às palavras dele, do contrário, ele o repreenderá e mostrará que você é mentiroso.\n\"Duas coisas peço que me dês antes que eu morra:\nMantém longe de mim a falsidade e a mentira; Não me dês nem pobreza nem riqueza; dá-me apenas o alimento necessário.\nSe não, tendo demais, eu te negaria e te deixaria, e diria: ‘Quem é o Senhor? ’ Se eu ficasse pobre, poderia vir a roubar, desonrando assim o nome do meu Deus.\n\n- Provérbios 30:1-9",
				"added": 1608378569
			},
			{
				"comment_id": 27,
				"body": "Aceitem o que é fraco na fé, sem discutir assuntos controvertidos.\nUm crê que pode comer de tudo; já outro, cuja fé é fraca, come apenas alimentos vegetais.\nAquele que come de tudo não deve desprezar o que não come, e aquele que não come de tudo não deve condenar aquele que come, pois Deus o aceitou.\nQuem é você para julgar o servo alheio? É para o seu senhor que ele está de pé ou cai. E ficará de pé, pois o Senhor é capaz de o sustentar.\nHá quem considere um dia mais sagrado que outro; há quem considere iguais todos os dias. Cada um deve estar plenamente convicto em sua própria mente.\nAquele que considera um dia como especial, para o Senhor assim o faz. Aquele que come carne, come para o Senhor, pois dá graças a Deus; e aquele que se abstém, para o Senhor se abstém, e dá graças a Deus.\nPois nenhum de nós vive apenas para si, e nenhum de nós morre apenas para si.\nSe vivemos, vivemos para o Senhor; e, se morremos, morremos para o Senhor. Assim, quer vivamos, quer morramos, pertencemos ao Senhor.\nPor esta razão Cristo morreu e voltou a viver, para ser Senhor de vivos e de mortos.\nPortanto, você, por que julga seu irmão? E por que despreza seu irmão? Pois todos compareceremos diante do tribunal de Deus.\nPorque está escrito: \" ‘Por mim mesmo jurei’, diz o Senhor, ‘diante de mim todo joelho se dobrará e toda língua confessará que sou Deus’ \".\nAssim, cada um de nós prestará contas de si mesmo a Deus.\nPortanto, deixemos de julgar uns aos outros. Em vez disso, façamos o propósito de não colocar pedra de tropeço ou obstáculo no caminho do irmão.\nComo alguém que está no Senhor Jesus, tenho plena convicção de que nenhum alimento é por si mesmo impuro, a não ser para quem assim o considere; para ele é impuro.\nSe o seu irmão se entristece devido ao que você come, você já não está agindo por amor. Por causa da sua comida, não destrua seu irmão, por quem Cristo morreu.\nAquilo que é bom para vocês não se torne objeto de maledicência.\nPois o Reino de Deus não é comida nem bebida, mas justiça, paz e alegria no Espírito Santo;\naquele que assim serve a Cristo é agradável a Deus e aprovado pelos homens.\nPor isso, esforcemo-nos em promover tudo quanto conduz à paz e à edificação mútua.\nNão destrua a obra de Deus por causa da comida. Todo alimento é puro, mas é errado comer qualquer coisa que faça os outros tropeçarem.\nÉ melhor não comer carne nem beber vinho, nem fazer qualquer outra coisa que leve seu irmão a cair.\nAssim, seja qual for o seu modo de crer a respeito destas coisas, que isso permaneça entre você e Deus. Feliz é o homem que não se condena naquilo que aprova.\nMas aquele que tem dúvida é condenado se comer, porque não come com fé; e tudo o que não provém da fé é pecado.\n\n- Romanos 14:1-23",
				"added": 1608483674
			},
			{
				"comment_id": 31,
				"body": "Salva-nos, Senhor! Já não há quem seja fiel; já não se confia em ninguém entre os homens.\nCada um mente ao seu próximo; seus lábios bajuladores falam com segundas intenções.\nQue o Senhor corte todos os lábios bajuladores e toda língua arrogante\ndos que dizem: \"Venceremos graças à nossa língua; somos donos dos nossos lábios! Quem é senhor sobre nós? \"\n\"Por causa da opressão do necessitado e do gemido do pobre, agora me levantarei\", diz o Senhor. \"Eu lhes darei a segurança que tanto anseiam. \"\nAs palavras do Senhor são puras, são como prata purificada num forno, sete vezes refinada.\nSenhor, tu nos guardarás seguros, e dessa gente nos protegerás para sempre.\nOs ímpios andam altivos por toda parte, quando a corrupção é exaltada entre os homens.\n\n- Salmos 12:1-8",
				"added": 1608517555
			},
			{
				"comment_id": 32,
				"body": "Como é feliz aquele que se interessa pelo pobre! O Senhor o livra em tempos de adversidade.\nO Senhor o protegerá e preservará a sua vida; ele o fará feliz na terra e não o entregará ao desejo dos seus inimigos.\nO Senhor o susterá em seu leito de enfermidade, e da doença o restaurará.\nEu disse: Misericórdia, Senhor, cura-me, pois pequei contra ti.\nOs meus inimigos dizem maldosamente a meu respeito: \"Quando ele vai morrer? Quando vai desaparecer o seu nome? \"\nSempre que alguém vem visitar-me, fala com falsidade, enche o coração de calúnias e depois sai espalhando-as.\nTodos os que me odeiam juntam-se e cochicham contra mim, imaginando que o pior me acontecerá:\n\"Uma praga terrível o derrubou; está de cama, e jamais se levantará\".\nAté o meu melhor amigo, em quem eu confiava e que partilhava do meu pão, voltou-se contra mim.\nMas, tu, Senhor, tem misericórdia de mim; levanta-me, para que eu lhes retribua.\nSei que me queres bem, pois o meu inimigo não triunfa sobre mim.\nPor causa da minha integridade me susténs e me pões na tua presença para sempre.\nLouvado seja o Senhor, o Deus de Israel, de eternidade a eternidade! Amém e amém!\n\n- Salmos 41:1-13",
				"added": 1608517731
			},
			{
				"comment_id": 33,
				"body": "A mulher sábia edifica a sua casa, mas com as próprias mãos a insensata derruba a sua.\nQuem anda direito teme o Senhor, mas quem segue caminhos enganosos o despreza.\nA conversa do insensato traz a vara para as suas costas, mas os lábios dos sábios os protegem.\nOnde não há bois o celeiro fica vazio, mas da força do boi vem a grande colheita.\nA testemunha sincera não engana, mas a falsa transborda em mentiras.\nO zombador busca sabedoria e nada encontra, mas o conhecimento vem facilmente ao que tem discernimento.\nMantenha-se longe do tolo, pois você não achará conhecimento no que ele falar.\nA sabedoria do homem prudente é discernir o seu caminho, mas a insensatez dos tolos é enganosa.\nOs insensatos zombam da idéia de reparar o pecado cometido, mas a boa vontade está entre os justos.\nCada coração conhece a sua própria amargura, e não há quem possa partilhar sua alegria.\nA casa dos ímpios será destruída, mas a tenda dos justos florescerá.\nHá caminho que parece certo ao homem, mas no final conduz à morte.\nMesmo no riso o coração pode sofrer, e a alegria pode terminar em tristeza.\nOs infiéis receberão a retribuição de sua conduta, mas o homem bom será recompensado.\nO inexperiente acredita em qualquer coisa, mas o homem prudente vê bem onde pisa.\nO sábio é cauteloso e evita o mal, mas o tolo é impetuoso e irresponsável.\nQuem é irritadiço faz tolices, e o homem cheio de astúcias é odiado.\nOs inexperientes herdam a insensatez, mas o conhecimento é a coroa dos prudentes.\nOs maus se inclinarão diante dos homens de bem, e os ímpios, às portas da justiça.\nOs pobres são evitados até por seus vizinhos, mas os amigos dos ricos são muitos.\nQuem despreza o próximo comete pecado, mas como é feliz quem trata com bondade os necessitados!\nNão é certo que se perdem os que só pensam no mal? Mas os que planejam o bem encontram amor e fidelidade.\nTodo trabalho árduo traz proveito, mas o só falar leva à pobreza.\nA riqueza dos sábios é a sua coroa, mas a insensatez dos tolos produz apenas insensatez.\nA testemunha que fala a verdade salva vidas, mas a testemunha falsa é enganosa.\nAquele que teme ao Senhor possui uma fortaleza segura, refúgio para os seus filhos.\nO temor do Senhor é fonte de vida, e afasta das armadilhas da morte.\nUma grande população é a glória do rei, mas, sem súditos, o príncipe está arruinado.\nO homem paciente dá prova de grande entendimento, mas o precipitado revela insensatez.\nO coração em paz dá vida ao corpo, mas a inveja apodrece os ossos.\nAquele que oprime o pobre com isso despreza o seu Criador, mas quem ao necessitado trata com bondade honra a Deus.\nQuando chega a calamidade, os ímpios são derrubados; os justos, porém, até em face da morte encontram refúgio.\nA sabedoria repousa no coração dos que têm discernimento e mesmo entre os tolos ela se deixa conhecer.\nA justiça engrandece a nação, mas o pecado é uma vergonha para qualquer povo.\nO servo sábio agrada o rei, mas o que procede vergonhosamente incorre em sua ira.\n\n- Provérbios 14:1-35",
				"added": 1608518043
			},
			{
				"comment_id": 36,
				"body": "Todo aquele que crê que Jesus é o Cristo é nascido de Deus, e todo aquele que ama o Pai ama também ao que dele foi gerado.\nAssim sabemos que amamos os filhos de Deus: amando a Deus e obedecendo aos seus mandamentos.\nPorque nisto consiste o amor a Deus: obedecer aos seus mandamentos. E os seus mandamentos não são pesados.\nO que é nascido de Deus vence o mundo; e esta é a vitória que vence o mundo: a nossa fé.\nQuem é que vence o mundo? Somente aquele que crê que Jesus é o Filho de Deus.\nEste é aquele que veio por meio de água e sangue, Jesus Cristo: não somente por água, mas por água e sangue. E o Espírito é quem dá testemunho, porque o Espírito é a verdade.\nHá três que dão testemunho:\no Espírito, a água e o sangue; e os três são unânimes.\nNós aceitamos o testemunho dos homens, mas o testemunho de Deus tem maior valor, pois é o testemunho de Deus, que ele dá acerca de seu Filho.\nQuem crê no Filho de Deus tem em si mesmo esse testemunho. Quem não crê em Deus o faz mentiroso, porque não crê no testemunho que Deus dá acerca de seu Filho.\nE este é o testemunho: Deus nos deu a vida eterna, e essa vida está em seu Filho.\nQuem tem o Filho, tem a vida; quem não tem o Filho de Deus, não tem a vida.\nEscrevi-lhes estas coisas, a vocês que crêem no nome do Filho de Deus, para que vocês saibam que têm a vida eterna.\nEsta é a confiança que temos ao nos aproximarmos de Deus: se pedirmos alguma coisa de acordo com a sua vontade, ele nos ouve.\nE se sabemos que ele nos ouve em tudo o que pedimos, sabemos que temos o que dele pedimos.\nSe alguém vir seu irmão cometer pecado que não leva à morte, ore, e Deus lhe dará vida. Refiro-me àqueles cujo pecado não leva à morte. Há pecado que leva à morte; não estou dizendo que se deva orar por este.\nToda injustiça é pecado, mas há pecado que não leva à morte.\nSabemos que todo aquele que é nascido de Deus não está no pecado; aquele que nasceu de Deus o protege, e o Maligno não o atinge.\nSabemos que somos de Deus e que o mundo todo está sob o poder do Maligno.\nSabemos também que o Filho de Deus veio e nos deu entendimento, para que conheçamos aquele que é o Verdadeiro. E nós estamos naquele que é o Verdadeiro, em seu Filho Jesus Cristo. Este é o verdadeiro Deus e a vida eterna.\nFilhinhos, guardem-se dos ídolos.\n\n- 1 João 5:1-21",
				"added": 1608549585
			},
			{
				"comment_id": 61,
				"body": "Que vantagem há então em ser judeu, ou que utilidade há na circuncisão?\nMuita, em todos os sentidos! Principalmente porque aos judeus foram confiadas as palavras de Deus.\nQue importa se alguns deles foram infiéis? A sua infidelidade anulará a fidelidade de Deus?\nDe maneira nenhuma! Seja Deus verdadeiro, e todo homem mentiroso. Como está escrito: \"De modo que são justas as tuas palavras e prevaleces quando julgas\".\nMas, se a nossa injustiça ressalta de maneira ainda mais clara a justiça de Deus, que diremos? Que Deus é injusto por aplicar a sua ira? ( Estou usando um argumento humano. )\nClaro que não! Se fosse assim, como Deus iria julgar o mundo?\nAlguém pode alegar ainda: \"Se a minha mentira ressalta a veracidade de Deus, aumentando assim a sua glória, por que sou condenado como pecador? \"\nPor que não dizer como alguns caluniosamente afirmam que dizemos: \"Façamos o mal, para que nos venha o bem\"? A condenação dos tais é merecida.\nQue concluiremos então? Estamos em posição de vantagem? Não! Já demonstramos que tanto judeus quanto gentios estão debaixo do pecado.\nComo está escrito: \"Não há nenhum justo, nem um sequer;\nnão há ninguém que entenda, ninguém que busque a Deus.\nTodos se desviaram, tornaram-se juntamente inúteis; não há ninguém que faça o bem, não há nem um sequer\".\n\"Suas gargantas são um túmulo aberto; com suas línguas enganam\". \"Veneno de serpentes está em seus lábios\".\n\"Suas bocas estão cheias de maldição e amargura\".\n\"Seus pés são ágeis para derramar sangue;\nruína e desgraça marcam os seus caminhos,\ne não conhecem o caminho da paz\".\n\"Aos seus olhos é inútil temer a Deus\".\nSabemos que tudo o que a lei diz, o diz àqueles que estão debaixo dela, para que toda boca se cale e todo o mundo esteja sob o juízo de Deus.\nPortanto, ninguém será declarado justo diante dele baseando-se na obediência à lei, pois é mediante a lei que nos tornamos plenamente conscientes do pecado.\nMas agora se manifestou uma justiça que provém de Deus, independente da lei, da qual testemunham a Lei e os Profetas,\njustiça de Deus mediante a fé em Jesus Cristo para todos os que crêem. Não há distinção,\npois todos pecaram e estão destituídos da glória de Deus,\nsendo justificados gratuitamente por sua graça, por meio da redenção que há em Cristo Jesus.\nDeus o ofereceu como sacrifício para propiciação mediante a fé, pelo seu sangue, demonstrando a sua justiça. Em sua tolerância, havia deixado impunes os pecados anteriormente cometidos;\nmas, no presente, demonstrou a sua justiça, a fim de ser justo e justificador daquele que tem fé em Jesus.\nOnde está, então, o motivo de vanglória? É excluído. Baseado em que princípio? No da obediência à lei? Não, mas no princípio da fé.\nPois sustentamos que o homem é justificado pela fé, independente da obediência à lei.\nDeus é Deus apenas dos judeus? Ele não é também o Deus dos gentios? Sim, dos gentios também,\nvisto que existe um só Deus, que pela fé justificará os circuncisos e os incircuncisos.\nAnulamos então a lei pela fé? De maneira nenhuma! Pelo contrário, confirmamos a lei.\n\n- Romanos 3:1-31",
				"added": 1608844567
			},
			{
				"comment_id": 92,
				"body": "#Por que orar? Qual o sentido em orar se Deus conhece o futuro e já está no controle de todas as coisas? Se não podemos mudar a opinião de Deus, por que devemos orar?\n- https://web.archive.org/web/20200926234904/https://www.gotquestions.org/Portugues/por-que-orar.html\n- http://ipfs.io/ipfs/QmVfjM7YAxbyqNHYH3V3zfUFKR9BFmgdU1MXzkCW5Xqw4e",
				"added": 1609328688
			},
			{
				"comment_id": 93,
				"body": "#O Que é Fé? O Que Significa a Fé Segundo a Bíblia?\n- https://web.archive.org/web/20201023045336/https://estiloadoracao.com/o-que-e-fe/\n- https://ipfs.io/ipfs/Qmf6Y3rXadCC9BueSQq43EE8i6pdzfjzLX4zB5eCfqe4jf/",
				"added": 1609329471
			},
			{
				"comment_id": 97,
				"body": "Como é bom e agradável quando os irmãos convivem em união!\nÉ como óleo precioso derramado sobre a cabeça, que desce pela barba, a barba de Arão, até a gola das suas vestes.\nÉ como o orvalho do Hermom quando desce sobre os montes de Sião. Ali o Senhor concede a bênção da vida para sempre.\n\n- Salmos 133:1-3",
				"added": 1609448985
			},
			{
				"comment_id": 98,
				"body": "> [ileubrie](#comment_97_1KMu2u9wo1DCsc27Qt28qwLxVAjcvHZhtj): Como é bom e agradável quando os irmãos convivem em união!É como óleo precioso derramado sobre a cabeça, que desce pela barba, a barba de Arão, até a gola das suas vestes.É como o orvalho do Hermom quando desce sobre os montes de Sião. Ali o Senhor concede a bênção da vida para sempre.\n> \n> Salmos 133:1-3\n\n#Análise e mensagem do Salmo 133\n- http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1KMu2u9wo1DCsc27Qt28qwLxVAjcvHZhtj_1",
				"added": 1609449340
			},
			{
				"comment_id": 104,
				"body": "Inclina os teus ouvidos, ó Senhor, e responde-me, pois sou pobre e necessitado.\nGuarda a minha vida, pois sou fiel a ti. Tu és o meu Deus; salva o teu servo que em ti confia!\nMisericórdia, Senhor, pois clamo a ti sem cessar.\nAlegra o coração do teu servo, pois a ti, Senhor, elevo a minha alma.\nTu és bondoso e perdoador, Senhor, rico em graça para com todos os que te invocam.\nEscuta a minha oração, Senhor; atenta para a minha súplica!\nNo dia da minha angústia clamarei a ti, pois tu me responderás.\nNenhum dos deuses é comparável a ti, Senhor, nenhum deles pode fazer o que tu fazes.\nTodas as nações que tu formaste virão e te adorarão, Senhor, glorificarão o teu nome.\nPois tu és grande e realizas feitos maravilhosos; só tu és Deus!\nEnsina-me o teu caminho, Senhor, para que eu ande na tua verdade; dá-me um coração inteiramente fiel, para que eu tema o teu nome.\nDe todo o meu coração te louvarei, Senhor, meu Deus; glorificarei o teu nome para sempre.\nPois grande é o teu amor para comigo; tu me livraste das profundezas do Sheol.\nOs arrogantes estão me atacando, ó Deus; um bando de homens cruéis, gente que não faz caso de ti procura tirar-me a vida.\nMas tu, Senhor, és Deus compassivo e misericordioso, muito paciente, rico em amor e em fidelidade.\nVolta-te para mim! Tem misericórdia de mim! Concede a tua força a teu servo e salva o filho da tua serva.\nDá-me um sinal da tua bondade, para que os meus inimigos vejam e sejam humilhados, pois tu, Senhor, me ajudaste e me consolaste.\n\n- Salmos 86:1-17",
				"added": 1609538046
			},
			{
				"comment_id": 124,
				"body": "#Pista de dança onde João Batista foi condenado à morte foi descoberta, diz arqueólogo\n- https://web.archive.org/web/20210104222917/https://www.livescience.com/dance-floor-john-the-baptist-execution.html\n\n\"Os arqueólogos afirmam ter identificado a pista de dança mortal onde [João Batista](https://en.wikipedia.org/wiki/John_the_Baptist) - um pregador que predisse a vinda de [Jesus](https://en.wikipedia.org/wiki/Jesus) - foi sentenciado à morte por volta de 29 [d.C.](https://en.wikipedia.org/wiki/Anno_Domini)\"",
				"added": 1609808216
			},
			{
				"comment_id": 198,
				"body": "Naquela ocasião Jesus passou pelas lavouras de cereal no sábado. Seus discípulos estavam com fome e começaram a colher espigas para comê-las.\nOs fariseus, vendo aquilo, lhe disseram: \"Olha, os teus discípulos estão fazendo o que não é permitido no sábado\".\nEle respondeu: \"Vocês não leram o que fez Davi quando ele e seus companheiros estavam com fome?\nEle entrou na casa de Deus, e juntamente com os seus companheiros comeu os pães da Presença, o que não lhes era permitido fazer, mas apenas aos sacerdotes.\nOu vocês não leram na Lei que, no sábado, os sacerdotes no templo profanam esse dia e, contudo, ficam sem culpa?\nEu lhes digo que aqui está o que é maior do que o templo.\nSe vocês soubessem o que significam estas palavras: ‘Desejo misericórdia, não sacrifícios’, não teriam condenado inocentes.\nPois o Filho do homem é Senhor do sábado\".\nSaindo daquele lugar, dirigiu-se à sinagoga deles,\ne estava ali um homem com uma das mãos atrofiada. Procurando um motivo para acusar Jesus, eles lhe perguntaram: \"É permitido curar no sábado? \"\nEle lhes respondeu: \"Qual de vocês, se tiver uma ovelha e ela cair num buraco no sábado, não irá pegá-la e tirá-la de lá?\nQuanto mais vale um homem do que uma ovelha! Portanto, é permitido fazer o bem no sábado\".\nEntão ele disse ao homem: \"Estenda a mão\". Ele a estendeu, e ela foi restaurada, e ficou boa como a outra.\nEntão os fariseus saíram e começaram a conspirar sobre como poderiam matar Jesus.\nSabendo disso, Jesus retirou-se daquele lugar. Muitos o seguiram, e ele curou a todos os doentes que havia entre eles,\nadvertindo-os que não dissessem quem ele era.\nIsso aconteceu para se cumprir o que fora dito pelo do profeta Isaías:\n\"Eis o meu servo, a quem escolhi, o meu amado, em quem tenho prazer. Porei sobre ele o meu Espírito, e ele anunciará justiça às nações.\nNão discutirá nem gritará; ninguém ouvirá sua voz nas ruas.\nNão quebrará o caniço rachado, não apagará o pavio fumegante, até que leve à vitória a justiça.\nEm seu nome as nações porão sua esperança\".\nEntão levaram-lhe um endemoninhado que era cego e mudo, e Jesus o curou, de modo que ele pôde falar e ver.\nTodo o povo ficou atônito e disse: \"Não será este o Filho de Davi? \"\nMas quando os fariseus ouviram isso, disseram: \"É somente por Belzebu, o príncipe dos demônios, que ele expulsa demônios\".\nJesus, conhecendo os seus pensamentos, disse-lhes: \"Todo reino dividido contra si mesmo será arruinado, e toda cidade ou casa dividida contra si mesma não subsistirá.\nSe Satanás expulsa Satanás, está dividido contra si mesmo. Como, então, subsistirá seu reino?\nE se eu expulso demônios por Belzebu, por quem os expulsam os filhos de vocês? Por isso, eles mesmos serão juízes sobre vocês.\nMas se é pelo Espírito de Deus que eu expulso demônios, então chegou a vocês o Reino de Deus.\n\"Ou como alguém pode entrar na casa do homem forte e levar dali seus bens, sem antes amarrá-lo? Só então poderá roubar a casa dele.\n\"Aquele que não está comigo, está contra mim; e aquele que comigo não ajunta, espalha.\nPor esse motivo eu lhes digo: todo pecado e blasfêmia serão perdoados aos homens, mas a blasfêmia contra o Espírito não será perdoada.\nTodo aquele que disser uma palavra contra o Filho do homem será perdoado, mas quem falar contra o Espírito Santo não será perdoado, nem nesta era nem na era que há de vir.\n\"Considerem: uma árvore boa dá bom fruto; uma árvore ruim, dá fruto ruim, pois uma árvore é conhecida por seu fruto.\nRaça de víboras, como podem vocês, que são maus, dizer coisas boas? Pois a boca fala do que está cheio o coração.\nO homem bom, do seu bom tesouro, tira coisas boas, e o homem mau, do seu mau tesouro, tira coisas más.\nMas eu lhes digo que, no dia do juízo, os homens haverão de dar conta de toda palavra inútil que tiverem falado.\nPois por suas palavras você será absolvido, e por suas palavras será condenado\".\nEntão alguns dos fariseus e mestres da lei lhe disseram: \"Mestre, queremos ver um sinal miraculoso feito por ti\".\nEle respondeu: \"Uma geração perversa e adúltera pede um sinal miraculoso! Mas nenhum sinal lhe será dado, exceto o sinal do profeta Jonas.\nPois assim como Jonas esteve três dias e três noites no ventre de um grande peixe, assim o Filho do homem ficará três dias e três noites no coração da terra.\nOs homens de Nínive se levantarão no juízo com esta geração e a condenarão; pois eles se arrependeram com a pregação de Jonas, e agora está aqui o que é maior do que Jonas.\nA rainha do Sul se levantará no juízo com esta geração e a condenará, pois ela veio dos confins da terra para ouvir a sabedoria de Salomão, e agora está aqui o que é maior do que Salomão.\n\"Quando um espírito imundo sai de um homem, passa por lugares áridos procurando descanso e não encontra,\ne diz: ‘Voltarei para a casa de onde saí’. Chegando, encontra a casa desocupada, varrida e em ordem.\nEntão vai e traz consigo outros sete espíritos piores do que ele, e entrando passam a viver ali. E o estado final daquele homem torna-se pior do que o primeiro. Assim acontecerá a esta geração perversa\".\nFalava ainda Jesus à multidão quando sua mãe e seus irmãos chegaram do lado de fora, querendo falar com ele.\nAlguém lhe disse: \"Tua mãe e teus irmãos estão lá fora e querem falar contigo\".\n\"Quem é minha mãe, e quem são meus irmãos? \", perguntou ele.\nE, estendendo a mão para os discípulos, disse: \"Aqui estão minha mãe e meus irmãos!\nPois quem faz a vontade de meu Pai que está nos céus, este é meu irmão, minha irmã e minha mãe\".\n\n- Mateus 12:1-50",
				"added": 1611511197
			},
			{
				"comment_id": 199,
				"body": "Meus irmãos, não sejam muitos de vocês mestres, pois vocês sabem que nós, os que ensinamos, seremos julgados com maior rigor.\nTodos tropeçamos de muitas maneiras. Se alguém não tropeça no falar, tal homem é perfeito, sendo também capaz de dominar todo o seu corpo.\nQuando colocamos freios na boca dos cavalos para que eles nos obedeçam, podemos controlar o animal todo.\nTomem também como exemplo os navios; embora sejam tão grandes e impelidos por fortes ventos, são dirigidos por um leme muito pequeno, conforme a vontade do piloto.\nSemelhantemente, a língua é um pequeno órgão do corpo, mas se vangloria de grandes coisas. Vejam como um grande bosque é incendiado por uma simples fagulha.\nAssim também, a língua é um fogo; é um mundo de iniqüidade. Colocada entre os membros do nosso corpo, contamina a pessoa por inteiro, incendeia todo o curso de sua vida, sendo ela mesma incendiada pelo inferno.\nToda espécie de animais, aves, répteis e criaturas do mar doma-se e é domada pela espécie humana;\na língua, porém, ninguém consegue domar. É um mal incontrolável, cheio de veneno mortífero.\nCom a língua bendizemos ao Senhor e Pai, e com ela amaldiçoamos os homens, feitos à semelhança de Deus.\nDa mesma boca procedem bênção e maldição. Meus irmãos, não pode ser assim!\nAcaso pode sair água doce e água amarga da mesma fonte?\nMeus irmãos, pode uma figueira produzir azeitonas ou uma videira, figos? Da mesma forma, uma fonte de água salgada não pode produzir água doce.\nQuem é sábio e tem entendimento entre vocês? Que o demonstre por seu bom procedimento, mediante obras praticadas com a humildade que provém da sabedoria.\nContudo, se vocês abrigam no coração inveja amarga e ambição egoísta, não se gloriem disso, nem neguem a verdade.\nEsse tipo de \"sabedoria\" não vem do céu, mas é terrena, não é espiritual e é demoníaca.\nPois onde há inveja e ambição egoísta, aí há confusão e toda espécie de males.\nMas a sabedoria que vem do alto é antes de tudo pura; depois, pacífica, amável, compreensiva, cheia de misericórdia e de bons frutos, imparcial e sincera.\nO fruto da justiça semeia-se em paz para os pacificadores.\n\n- Tiago 3:1-18",
				"added": 1611511367
			},
			{
				"comment_id": 213,
				"body": "#Ezequiel 33\n- http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1KMu2u9wo1DCsc27Qt28qwLxVAjcvHZhtj_5",
				"added": 1611798989
			},
			{
				"comment_id": 225,
				"body": "#Provérbios 21\n- http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1KMu2u9wo1DCsc27Qt28qwLxVAjcvHZhtj_6",
				"added": 1612019578
			},
			{
				"comment_id": 226,
				"body": "#5 COISAS IMPORTANTES QUE DEUS PEDE PARA VOCÊ HOJE - Pastor Antonio Junior\nVocê gostaria de saber o que Deus espera de você? Neste vídeo você descobrirá 5 coisas que o Senhor deseja que você faça. Assista até o fim e compartilhe!\n- https://invidious.snopyta.org/6ktX4aTW6-c\n- https://ipfs.io/ipfs/QmeucPiHvoBbVymeYyc71KbDPcZEZ5Au5x7EWAHUr6i6iM",
				"added": 1612019910
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 5,
				"body": "#Big Order\n- https://ipfs.io/ipfs/QmcPQYRGsod4uMW1ohDdLmbBpm9p6H4rHgyJd1XGk1EsfY\n\nDez anos atrás, uma criança desejou a destruição do mundo. Hoje, um grupo de pessoas tem a habilidade de realizar seus desejos a partir de seus poderes. Eles são chamados de Usuários de Order. Antes dessas pessoas incríveis que tem o poder do Order, uma pessoa se destacou com a habilidade de governar e dominar o mundo, transformando as pessoas em marionetes com seu poder. Esse poder é de Hoshiyama Eiji, que também é responsável pelo fenômeno destrutivo de dez anos atrás.",
				"added": 1608261651
			},
			{
				"comment_id": 53,
				"body": "#Kôdo Giasu: Hangyaku no Rurûshu I - Kôdô (2017)\nUm remake dos primeiros 17 episódios de [Code Geass](https://en.wikipedia.org/wiki/Code_Geass) R1.\n- https://siasky.net/CADWKPaoVVadGAJ2BdQCN0ospCxmWku0JOHtDWoikegzpA\n\n#Code Geass: Lelouch of the Rebellion Episode II (2018)\nUm remake dos últimos 8 episódios de [Code Geass R1](https://www.superanimes.org/anime/code-geass) e dos primeiros 16 episódios de [Code Geass R2](https://www.superanimes.org/anime/code-geass-r2).\n- https://siasky.net/CAC5cvEQxHGNu291FFa0MBsowlkfbDA_XLsetbU4Bkknwg\n\n#Code Geass: Lelouch of the Rebellion Episode III (2018)\nUm remake dos últimos 9 episódios em Code Geass R2, que é uma [prequela](https://en.wikipedia.org/wiki/Prequel) de [Lelouch of the Resurrection](https://en.wikipedia.org/wiki/Code_Geass:_Lelouch_of_the_Re;surrection).\n- https://siasky.net/CABwCR41Y-UhR08w5bJI8kWsVavEWNPGa7s0i8bGzb0yKQ\n\n#Code Geass: Fukkatsu No Lelouch (2019)\nA história se passa um ano após o plano \"[Zero Requiem](https://web.archive.org/web/20201111202349/https://codegeass.fandom.com/wiki/Zero_Requiem)\" de Lelouch.\n- https://siasky.net/CABEsM4HrcY3lWWeQWGijNu4PsykOPpuRVEzO2UsFi3zbg",
				"added": 1608750978
			},
			{
				"comment_id": 172,
				"body": "#[Inuyasha](https://en.wikipedia.org/wiki/Inuyasha) - Filmes legendados\n- [Filme 01](https://siasky.net/AADE2fKJKdAOhXtcOwXzK_an2aYqLIx3uBWE5N2Gauqu6Q)\n- [Filme 02](https://siasky.net/AAB1uOwNK4l1THJRVC_gsSE2J0Ie1Zdf1mVAxclc9fLDqQ)\n- [Filme 03](https://siasky.net/AACVnTA3AXiZMLnfC2IZHE5YF88OisrhjsSBWHDkF8hCVQ)\n- [Filme 04](https://siasky.net/AADmiNMbAEn-y25r2To6wqxZVPihHo2nhy7NCUjHYY-3qA)",
				"added": 1611173794
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 6,
				"body": "#Gravidade modificada confirmada em galáxias coloca matéria escura em xeque\n- https://web.archive.org/web/20201218124604/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=gravidade-modificada-confirmada-galaxias-coloca-materia-escura-xeque&id=010130201218\n- Artigo: [Testing the Strong Equivalence Principle: Detection of the External Field Effect in Rotationally Supported Galaxies](https://web.archive.org/web/20200926001237/https://arxiv.org/pdf/2009.11525v1.pdf)",
				"added": 1608296689
			},
			{
				"comment_id": 37,
				"body": "#Tecido com nanotecnologia detém 99,9% da interferência eletromagnética\nBasta recobrir um tecido qualquer com um material bidimensional, chamado MXeno, para criar um escudo contra radiações eletromagnéticas e até mesmo contra outras radiações perigosas.\nSimge Uzun e seus colegas da Universidade Drexel, nos EUA, acreditam que sua inovação poderá ser usada como escudo de proteção em virtualmente todos os aparelhos eletrônicos sensíveis, como máquinas de cartão de crédito e notebooks, para bloquear equipamentos da interferência eletromagnética em ambientes industriais e até mesmo para bloquear sinais de telefonia celular em áreas críticas, como prisões.\nMelhor ainda, o tecido pode servir para proteger as pessoas que vivem em áreas sujeitas a muita radiação eletromagnética, como as que vivem nas proximidades de antenas de telefonia celular de grande potência.\n- https://web.archive.org/web/20201221113902/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=tecido-nanotecnologia-detem-99-9-interferencia-eletromagnetica&id=010160201221\n- Artigo: [Highly Conductive and Scalable Ti3C2Tx-Coated Fabrics for Efficient Electromagnetic Interference Shielding](https://ipfs.infura.io/ipfs/QmQn8m29V8xVAKQxu9rkFZMaj6D6ystFkPny32RJWqZTf3)",
				"added": 1608551846
			},
			{
				"comment_id": 38,
				"body": "#Novo tipo de relógio atômico garante precisão durante vida do Universo\nOs [relógios atômicos](https://en.wikipedia.org/wiki/Atomic_clock) são os cronometristas mais precisos do mundo, usando lasers para medir as vibrações dos átomos, que oscilam em uma frequência constante, como se fossem muitos pêndulos microscópicos balançando em sincronia.\nOs melhores relógios atômicos do mundo marcam o tempo com tanta precisão que, se estivessem funcionando desde o início do Universo, hoje estariam atrasados ou adiantados apenas cerca de meio segundo.\nEntão por que alguém se preocuparia em melhorar sua precisão ainda mais? É que, quanto menores forem os seus tiquetaques, ou seja, quanto menor for a menor duração de tempo que eles conseguem medir, maior será a precisão com que será possível medir fenômenos como ondas gravitacionais, interações entre matéria e antimatéria, partículas de matéria escura e todos as estranhas interações entre partículas quânticas.\nE, quando atingirmos uma precisão ainda maior, será possível detectar eventuais efeitos que a força da gravidade pode ter na passagem do tempo e até se o próprio tempo muda à medida que o Universo envelhece.\n- https://web.archive.org/web/20201221114039/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=novo-tipo-relogio-atomico-garante-precisao-durante-vida-universo&id=010165201221\n- Artigo: [Entanglement on an optical atomic-clock transition](https://ipfs.infura.io/ipfs/QmTnQeojK1EhayU9wmr9jTuZqGvbygPK4hmkmeZTTofE5r)",
				"added": 1608552139
			},
			{
				"comment_id": 45,
				"body": "#Simetria desconhecida supera última fronteira para computadores quânticos\nUma das maiores dificuldades para se construir um processador quântico com um número suficiente de [qubits](https://en.wikipedia.org/wiki/Qubit) é proteger os qubits do ambiente, uma vez que qualquer radiação mínima - um fóton, um elétron ou um átomo são suficientes - faz com que eles percam os dados.\nShovan Dutta e Nigel Cooper, da Universidade de Cambridge, no Reino Unido, acreditam ter solucionado esse problema.\nOs dois descobriram uma simetria nunca detectada antes em partículas quânticas e, mais importante, encontraram uma maneira de tirar proveito dela: Usando a simetria, as partículas microscópicas - ou qubits - podem permanecer intrinsecamente ligadas, ou entrelaçadas, a longas distâncias, mesmo que haja perturbações aleatórias acontecendo entre elas.\nUsando a matemática da teoria quântica, eles descobriram uma configuração simples, onde partículas entrelaçadas podem ser preparadas e estabilizadas mesmo na presença de ruído, porque a simetria conserva o número de pares de qubits entrelaçados.\n\"Não esperávamos esse tipo de emaranhamento estabilizado,\" disse Dutta. \"Nós tropeçamos nessa simetria oculta, o que é muito raro nesses sistemas ruidosos.\"\n- https://web.archive.org/web/20201222145350/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=simetria-desconhecida-supera-ultima-fronteira-computadores-quanticos&id=010110201222\n- Artigo: [Long-Range Coherence and Multiple Steady States in a Lossy Qubit Array](https://ipfs.infura.io/ipfs/QmZ1Y77e19wPGoQe9TDS8pQFk6GLVYU4YS7QTxNpeuJkT2)",
				"added": 1608652867
			},
			{
				"comment_id": 59,
				"body": "#Experimento para testar gravidade quântica é simplificado\nHá cerca de três meses, físicos alemães apresentaram o projeto de um [sensor de diamante capaz de verificar se a força da gravidade é quântica ou não](https://web.archive.org/web/20200926140446/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=sensor-diamante-dira-se-gravidade-quantica-ou-nao&id=010130200904), além de detectar [ondas gravitacionais](https://en.wikipedia.org/wiki/Gravitational_wave) em um equipamento de mesa.\nUm aluno da equipe leu o projeto e descobriu que dá para tornar tudo mais simples, trazendo para muito perto da realização um experimento que seus próprios autores estimaram levar décadas para ser construído.\n- https://web.archive.org/web/20201224121330/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=experimento-testar-gravidade-quantica-simplificado&id=010130201224\n- Artigo: [Quantum gravity witness via entanglement of masses: Casimir screening](https://ipfs.infura.io/ipfs/QmbdLPTZDzYZj9715nGaukEpSv3PDDaEcWPgQC4GHiJNRe)",
				"added": 1608843825
			},
			{
				"comment_id": 85,
				"body": "#Raios X estão com dias contados. Vêm aí os raios T\nImagine que você tenha uma suspeita de fratura e precise fazer um exame. Em vez de se submeter a um [raio X](https://en.wikipedia.org/wiki/X-ray), contudo, você faz um \"raio T\", um exame que dá ao médico uma imagem muito melhor e que não lhe coloca sob os efeitos danosos da radiação.\nEste é um sonho longamente perseguido por pesquisadores do mundo todo, que vêem na [radiação terahertz](https://en.wikipedia.org/wiki/Terahertz_radiation) - os raios T - uma categoria de exames médicos de nova geração, sem efeitos colaterais, além de inúmeras outras aplicações industriais.\n- https://web.archive.org/web/20170223/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=raios-x-estao-com-dias-contados--vem-ai-os-raios-t&id=010110081120\n- Artigo: [An on-chip near-field terahertz probe and detector](https://ipfs.infura.io/ipfs/Qmc7XSb6fqnhkzo14b1WR4jcUh8dx6cdFuqGh5a2XP4551)",
				"added": 1609275311
			},
			{
				"comment_id": 121,
				"body": "#Ilha de estabilidade\n- https://en.wikipedia.org/wiki/Island_of_stability\n\nNa física nuclear, a [ilha de estabilidade](https://everipedia.org/wiki/lang_en/Island_of_stability) é um conjunto previsto de isótopos de elementos superpesados que podem ter meias-vidas consideravelmente mais longas do que os isótopos conhecidos desses elementos. Prevê-se que apareça como uma \"ilha\" no gráfico de nuclídeos, separada de radionuclídeos primordiais conhecidos estáveis e de vida longa.",
				"added": 1609780212
			},
			{
				"comment_id": 126,
				"body": "#Estudo sugere a existência de buracos negros ‘estupendamente grandes’\nO maior [buraco negro](https://en.wikipedia.org/wiki/Black_hole) que conhecemos é [TON 618](https://en.wikipedia.org/wiki/TON_618), um [quasar](https://en.wikipedia.org/wiki/Quasar) a 10,4 bilhões de [anos-luz](https://en.wikipedia.org/wiki/Light-year), com 66 bilhões de vezes a [massa do Sol](https://en.wikipedia.org/wiki/Solar_mass). Mas um trio de cientistas está propondo que esses corpos celestes podem atingir tamanhos ainda maiores, os chamados “buracos negros estupendamente grandes” (“stupendously large black holes”, ou SLABs) com a massa de 100 bilhões de sóis ou mais.\n- https://web.archive.org/web/20210106024453/https://olhardigital.com.br/2020/09/21/ciencia-e-espaco/estudo-sugere-a-existencia-de-buracos-negros-estupendamente-grandes/\n- Artigo: [Constraints on Stupendously Large Black Holes](https://ipfs.infura.io/ipfs/QmZbr23WjAdCDZRuUnxzWz2TU5yPy28nEAHEy51EXP5q87)",
				"added": 1609901997
			},
			{
				"comment_id": 127,
				"body": "#Anyon\n- https://en.wikipedia.org/wiki/Anyon\n\nNa física, um [anyon](https://everipedia.org/wiki/lang_en/Anyon) é um tipo de [quasipartícula](https://en.wikipedia.org/wiki/Quasiparticle) que ocorre apenas em sistemas bidimensionais, com propriedades muito menos restritas do que [férmions](https://en.wikipedia.org/wiki/Fermion) e [bósons](https://en.wikipedia.org/wiki/Boson). Em geral, a operação de troca de duas [partículas idênticas](https://en.wikipedia.org/wiki/Identical_particles) pode causar uma mudança de fase global, mas não pode afetar os [observáveis](https://en.wikipedia.org/wiki/Observable).\n\n#Físicos provam que Anyons existem, um terceiro tipo de partícula no universo\n- https://web.archive.org/web/20201230071524/https://www.discovermagazine.com/the-sciences/physicists-prove-anyons-exist-a-third-type-of-particle-in-the-universe",
				"added": 1609903174
			},
			{
				"comment_id": 128,
				"body": "#Neutrinos realmente ajudaram a dar forma ao Universo\n- https://web.archive.org/web/20210106124239/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=neutrinos-realmente-ajudaram-dar-forma-universo&id=010130210106\n- Artigo: [Cosmological Vlasov-Poisson Simulations of Structure Formation with Relic Neutrinos: Nonlinear Clustering and the Neutrino Mass](https://ipfs.infura.io/ipfs/QmZWrCJxt6fdS8Nz1Dre7vMcoz1CibqDUPfSLZz7oJmtq3)",
				"added": 1609937660
			},
			{
				"comment_id": 129,
				"body": "#Formulações de Poison para sistemas dinâmicos\n- http://hdl.handle.net/10183/149900\n- https://ipfs.io/ipfs/QmbEtMKVwTTaSLMZwuASbFMVgi9J2BKVM5agRS7eS7UVF1",
				"added": 1609937864
			},
			{
				"comment_id": 137,
				"body": "#Como um silêncio resolveu os estranhos problemas matemáticos dos buracos negros\n- https://web.archive.org/web/20210105193411/https://www.bbc.com/portuguese/vert-fut-54904726",
				"added": 1610123978
			},
			{
				"comment_id": 140,
				"body": "#Pesquisa sugere que “matéria escura” não existe no universo\nConseguir determinar a composição da [matéria escura](https://en.wikipedia.org/wiki/Dark_matter) é um dos maiores desafios da física. Há décadas, astrônomos, astrofísicos e cosmólogos buscam uma explicação para o estranho comportamento gravitacional das galáxias e aglomerados de galáxias, que pode ser afetado por um material que não conseguimos enxergar, e que comporia três quartos de toda a matéria do universo.\nMas um grupo de cientistas publicou uma pesquisa afirmando que encontrou um modelo que com mais precisão o fenômeno que explica esse comportamento galáctico – e que exclui a matéria escura dessa equação. A hipótese da [dinâmica newtoniana modificada](https://en.wikipedia.org/wiki/Modified_Newtonian_dynamics) (Modified Newtonian Dynamics, ou Mond), também chamada “gravidade modificada”, seria uma explicação viável para esse dilema cosmológico.\n- https://web.archive.org/web/20210109032913/https://olhardigital.com.br/2021/01/07/noticias/pesquisa-sugere-que-materia-escura-nao-existe-no-universo/\n- Artigo: [Testing the Strong Equivalence Principle: Detection of the External Field Effect in Rotationally Supported Galaxies](https://ipfs.infura.io/ipfs/QmXmYUi6YEr6MqSQSUtDG66aghYWFudbXfEtUx1cgfAFjw)",
				"added": 1610214703
			},
			{
				"comment_id": 141,
				"body": "#Estudo coloca em dúvida modelos teóricos sobre a matéria escura\nCom ajuda do [telescópio Hubble](https://en.wikipedia.org/wiki/Hubble_Space_Telescope), astrônomos de universidades norte-americanas e europeias observaram concentrações de [matéria escura](https://en.wikipedia.org/wiki/Dark_matter) em galáxias acima do previsto por modelos teóricos. Para os pesquisadores, os resultados indicam que ainda pode haver lacunas conceituais em simulações computacionais que se propõem a estudar o componente espacial.\n- https://web.archive.org/web/20210104042006/https://olhardigital.com.br/2020/09/11/ciencia-e-espaco/estudo-coloca-em-duvida-modelos-teoricos-sobre-a-materia-escura/\n- Artigo: [An excess of small-scale gravitational lenses observed in galaxy clusters](https://ipfs.infura.io/ipfs/QmeSEdvsHV9Dfqag28efxSCbfaBQdeG3VZDERwRtsThuiW)",
				"added": 1610215078
			},
			{
				"comment_id": 142,
				"body": "#Cientistas descobrem o que pode ter gerado matéria escura no espaço\nUm estudo realizado por pesquisadores do Instituto Kavli de Física e Matemática do Universo indica que os chamados [buracos negros primordiais](https://en.wikipedia.org/wiki/Primordial_black_hole) podem ter originado parte ou até mesmo toda a [matéria escura](https://en.wikipedia.org/wiki/Dark_matter) presente no espaço.\n- https://web.archive.org/web/20201231082130/https://olhardigital.com.br/2020/12/30/noticias/cientistas-descobrem-o-que-pode-ter-gerado-materia-escura-no-espaco/\n- Artigo: [Exploring Primordial Black Holes from the Multiverse with Optical Telescopes](https://ipfs.infura.io/ipfs/QmcnLCTMCZKTmnY6Ycgd9Vpyng7UCMNHQj5C49ndHvB2zD)",
				"added": 1610215349
			},
			{
				"comment_id": 143,
				"body": "#Matéria escura ‘perdida’ pode resolver mistério da astrofísica\nUm novo estudo publicado por físicos da Universidade de Chicago, em Illinois (EUA), pode ajudar a ciência a resolver contradições sobre o ritmo de expansão do universo, segundo reportagem da revista Live Science.\nOs pesquisadores apontam que uma forma antiga de [matéria escura](https://en.wikipedia.org/wiki/Dark_matter) foi formada nos primeiro momentos após o [Big Bang](https://en.wikipedia.org/wiki/Big_Bang). A matéria, no entanto, teria se esgotado com o passar do tempo, de forma a reduzir a massa total do universo e, consequentemente, as forças gravitacionais que o mantém o unido. O resultado disso, então, teria impactado na velocidade com que o universo se expande atualmente.\nA teoria remete a uma discussão acadêmica denominada ‘tensão de Hubble’. É consenso que o [universo está em expansão acelerada](https://en.wikipedia.org/wiki/Accelerating_expansion_of_the_universe), mas diversas métricas aplicadas por cientistas produzem diferentes resultados sobre o ritmo desse processo.\n- https://web.archive.org/web/20201218151752/https://olhardigital.com.br/2020/04/30/ciencia-e-espaco/materia-escura-perdida-pode-resolver-misterio-da-astrofisica/\n- Artigo: [Warm decaying dark matter and the hubble tension](https://ipfs.infura.io/ipfs/QmahdPdPACaQ2XLfYu4iPeQxrqPHMBf6Rtne1N7CJehqqw)",
				"added": 1610216402
			},
			{
				"comment_id": 144,
				"body": "#[Claudia de Rham](https://www.imperial.ac.uk/people/c.de-rham) mostrou como as teorias da “gravidade massiva” poderiam potencialmente eliminar a necessidade de [energia escura](https://en.wikipedia.org/wiki/Dark_energy).\n- https://web.archive.org/web/20201101013527/https://www.quantamagazine.org/claudia-de-rham-slayed-gravitys-ghosts-20200818/\n- Artigo: [Resummation of Massive Gravity](https://ipfs.infura.io/ipfs/QmNwZhPRdtugWN65y1GgDffBHPhhafUKVqnmLwTPTkeZXK)",
				"added": 1610223423
			},
			{
				"comment_id": 158,
				"body": "#Humanidade poderá extrair energia de buracos negros no futuro\n\"Daqui a milhares ou milhões de anos, a humanidade poderá sobreviver ao redor de um [buraco negro](https://en.wikipedia.org/wiki/Black_hole), sem precisar da energia das [estrelas](https://en.wikipedia.org/wiki/Star). É um problema essencialmente tecnológico. Se olharmos para a física, não há nada que impeça isso.\"\n- https://web.archive.org/web/20210114102104/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=humanidade-podera-extrair-energia-buracos-negros-futuro&id=010130210114\n- Artigo: [Magnetic reconnection as a mechanism for energy extraction from rotating black holes](https://ipfs.infura.io/ipfs/QmanDECUDUhi4thuta5Vw9VN2rW5kuApwa8sMzu9Ph7Fjs)",
				"added": 1610625103
			},
			{
				"comment_id": 176,
				"body": "#Fenômeno inusitado em isolantes sugere existência de nova partícula\n- https://web.archive.org/web/20210120120126/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=fenomeno-inusitado-isolantes-sugere-existencia-nova-particula&id=010110210120\n- Artigo: [Landau quantization and highly mobile fermions in an insulator](https://ipfs.infura.io/ipfs/QmPGrksknjeYC2tXSi9WKPML3PVoHKQ8oH9ozhyRZKsVEh)",
				"added": 1611193428
			},
			{
				"comment_id": 179,
				"body": "#Bóson de Higgs é encontrado em supercondutores\nVocê ainda deve se lembrar do [bóson de Higgs](https://en.wikipedia.org/wiki/Higgs_boson), também conhecido como \"partícula Deus\", descoberto em 2012 no [LHC](https://en.wikipedia.org/wiki/Large_Hadron_Collider) (Grande Colisor de Hádrons), rendendo aos seus idealizadores o [Prêmio Nobel de Física](https://web.archive.org/web/20200424155333/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=nobel-fisica-vai-boson-higgs-englert&id=010175131008) no ano seguinte.\nAgora, Chirag Vaswani e uma equipe de físicos de várias universidades norte-americanas descobriram uma forma da famosa partícula dentro de um material [supercondutor](https://en.wikipedia.org/wiki/Superconductivity), um material capaz de conduzir eletricidade sem resistência, geralmente em temperaturas muito baixas.\n- https://web.archive.org/web/20210121131642/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=boson-higgs-encontrado-supercondutores&id=010115210121\n- Artigo: [Light quantum control of persisting Higgs modes in iron-based superconductors](https://ipfs.infura.io/ipfs/QmUoasDMBRxb5koLjGTDeERLxJSMh25xz79yfngtNPsZKX)",
				"added": 1611235990
			},
			{
				"comment_id": 180,
				"body": "#Você é um Cérebro de Boltzmann?\n- https://invidious.snopyta.org/efDjXFBga5A\n- https://siasky.net/AACZSVR_et0sKEjQDY-NX6_vorEkWDoAhRY9xLK7fjyIRQ\n\nVocê é um cérebro que brotou espontaneamente nesse exato instante? Provavelmente você vai dizer que não, embora a probabilidade seja de que sim, você é um chamado [cérebro de Boltzmann](https://en.wikipedia.org/wiki/Boltzmann_brain). Mas como a termodinâmica e entropia são capazes de criar uma situação tão bizarra e misteriosa no Universo?",
				"added": 1611245846
			},
			{
				"comment_id": 182,
				"body": "#As doze mentes mais brilhantes da história da física\n- https://web.archive.org/web/20201125104029/https://universoracionalista.org/as-doze-mentes-mais-brilhantes-da-historia-da-fisica/",
				"added": 1611248535
			},
			{
				"comment_id": 200,
				"body": "#ESTRELAS IMPOSSÍVEIS\n- https://invidious.snopyta.org/_vzEKXOI3BY\n- https://siasky.net/AAAFXnj7XNJgKg2I-UFXGIOH5Elk4nNhgd02NncxZDU2Lg\n\nVocê já ouviu falar de [estrelas de nêutrons](https://en.wikipedia.org/wiki/Neutron_star), [pulsares](https://en.wikipedia.org/wiki/Pulsar) e, é claro, do nosso [Sol](https://en.wikipedia.org/wiki/Sun). Mas você já ouviu falar das estrelas mais bizarras do nosso Universo, como as [estrelas de quarks](https://en.wikipedia.org/wiki/Quark_star) ou [estrelas de Planck](https://en.wikipedia.org/wiki/Planck_star)? Esse vídeo fala um pouco mais sobre essas estrelas hipotéticas e (quem sabe) impossíveis.",
				"added": 1611544996
			},
			{
				"comment_id": 202,
				"body": "#Modelos de buraco negro não singular\nUm [modelo de buraco negro não singular](https://everipedia.org/wiki/lang_en/Nonsingular_black_hole_models) é uma teoria matemática de [buracos negros](https://en.wikipedia.org/wiki/Black_hole) que evita certos problemas teóricos com o modelo de buraco negro padrão, incluindo [perda de informação](https://en.wikipedia.org/wiki/Black_hole_information_paradox) e a natureza inobservável do [horizonte de eventos](https://en.wikipedia.org/wiki/Event_horizon) do buraco negro.\n- https://en.wikipedia.org/wiki/Nonsingular_black_hole_models\n\n#Gravastar\nUm [gravastar](https://everipedia.org/wiki/lang_en/Gravastar) é um objeto hipotetizado na astrofísica por Pawel O. Mazur e Emil Mottola como uma alternativa à teoria do buraco negro. Ele tem a métrica usual do buraco negro fora do horizonte, mas a [métrica de Sitter](https://en.wikipedia.org/wiki/De_Sitter_space) dentro. No horizonte, há uma fina casca de matéria. O termo \"gravastar\" é um [portmanteau](https://en.wikipedia.org/wiki/Portmanteau) de viagem das palavras \"estrela do vácuo gravitacional\".\n- https://en.wikipedia.org/wiki/Gravastar\n\n#Estrela de energia escura\nUma [estrela de energia escura](https://everipedia.org/wiki/lang_en/Dark-energy_star) é um objeto astrofísico compacto hipotético, que uma minoria de físicos pensa que pode constituir uma explicação alternativa para observações de candidatos a buracos negros astronômicos.\nO conceito foi proposto pelo físico [George Chapline](https://en.wikipedia.org/wiki/George_Chapline_Jr.). A teoria afirma que a matéria em queda é convertida em energia do vácuo ou energia escura, conforme a matéria cai no horizonte de eventos. O espaço dentro do horizonte de eventos terminaria com um grande valor para a [constante cosmológica](https://en.wikipedia.org/wiki/Cosmological_constant) e teria pressão negativa para exercer contra a [gravidade](https://en.wikipedia.org/wiki/Gravity). Não haveria [singularidade](https://en.wikipedia.org/wiki/Gravitational_singularity) destruidora de informações.\n- https://en.wikipedia.org/wiki/Dark-energy_star\n\n#Estrela negra (gravidade semiclássica)\nUma [estrela negra](http://127.0.0.1:43110/0sh.bit/?7MIs) é um objeto gravitacional composto de matéria. É uma alternativa teórica ao conceito de buraco negro da relatividade geral. O construto teórico foi criado por meio do uso da teoria da [gravidade semiclássica](https://en.wikipedia.org/wiki/Semiclassical_gravity). Uma estrutura semelhante também deve existir para o sistema de [equações de Einstein-Maxwell-Dirac](https://en.wikipedia.org/wiki/Einstein%E2%80%93Maxwell%E2%80%93Dirac_equations), que é o limite (super) clássico da [eletrodinâmica quântica](https://en.wikipedia.org/wiki/Quantum_electrodynamics), e para o sistema de Einstein-Yang-Mills-Dirac, que é o limite (super) clássico do modelo padrão.\n- http://127.0.0.1:43110/0sh.bit/?qUHp",
				"added": 1611578054
			},
			{
				"comment_id": 203,
				"body": "#[Perturbações de sistemas gravitacionais: a métrica de vaidya, mini buracos negros e gravastares](https://ipfs.infura.io/ipfs/QmSabrvTNEDDPfsZZ9VFkRhDBudc7VC9wQBiGLJt9S2crW)\nEstudos de perturbações em sistemas gravitacionais no âmbito da Relatividade Geral vêm sofrendo grandes desenvolvimentos nos últimos anos, especialmente em face da evolução dos modernos detectores de ondas gravitacionais. Abordamos neste trabalho as perturbações de diferentes cenários. Principiamos com a métrica de Vaidya, utilizada para descrever espaços-tempos esfericamente simétricos e dependentes do tempo. Nossas simulações mostraram que as freqüências dos modos quasi-normais (MQN's) apresentam um novo efeito inercial para variações rápidas da função de massa, retornando depois ao comportamento adiabático. Em seguida, apresentamos um modelo para a evaporação de mini buracos negros por radiação de Hawking inspirado no cenário de criação destes objetos em aceleradores de partículas, previsto pelas novas teorias com dimensões extras. Nosso modelo, baseado na métrica de Vaidya n-dimensional, tornou possível a análise de MQN's resultando na possibilidade de se obter os parâmetros relevantes do buraco negro, como a sua massa inicial e o número de dimensões extras, a partir de medições experimentais. Finalmente, realizamos um estudo sobre uma nova solução denominada gravastar, proposta como um modelo alternativo para o estágio final de estrelas com grande massa. Obtivemos limites para os parâmetros da solução e verificamos a sua estabilidade frente a perturbações axiais, concluindo positivamente a respeito da possibilidade de se distinguir entre buracos negros e gravastares com base no seu espectro de MQN's.",
				"added": 1611594568
			},
			{
				"comment_id": 204,
				"body": "#[Michell, Laplace e as estrelas negras: uma abordagem para professores do Ensino Médio](https://ipfs.infura.io/ipfs/QmT2M85Pu3VTwpmb7qmhnmQPDsEicXD7SKAqaC5hq3EE2Q)\nO conceito moderno de buraco negro como uma região do espaço-tempo da qual a luz não pode escapar tem suas origens no século 18 com John Michell e Pierre Simon Laplace. Neste trabalho apresentamos as abordagens destes dois cientistas buscando dar ao professor do ensino médio subsídios para a compreensão das idéias precursoras do buraco negro moderno da teoria de Einstein da gravitação.",
				"added": 1611596284
			},
			{
				"comment_id": 208,
				"body": "#A Gravidade NÃO é uma Força\n- https://invidious.snopyta.org/opqXAInbAaU\n- https://ipfs.io/ipfs/Qmd9znmTWkFcbKxUKnMnWpZ5uVy6RGsJHHcBwY5NLNFtxc\n\nA [Gravitação Universal](https://en.wikipedia.org/wiki/Newton%27s_law_of_universal_gravitation) foi por muito tempo o melhor modelo da física para explicar e modelar o Universo. Só que isso mudou com o surgimento da relatividade de Einstein. Por causa da relatividade, entendemos que a gravidade não é uma força.",
				"added": 1611598238
			},
			{
				"comment_id": 211,
				"body": "#Existe um universo paralelo que está retrocedendo no tempo?\nO tempo, como o entendemos, se move do passado para o futuro irreversivelmente. Mas agora, um trio internacional de físicos teóricos está sugerindo que há mais de um futuro. Dois universos paralelos foram produzidos pelo [Big Bang](https://en.wikipedia.org/wiki/Big_Bang): o nosso, que avança no tempo ([foto](https://ipfs.infura.io/ipfs/QmUJW7mqWX9dCey7iJPqpMgifkVSiBWRi3hZjWdGMJXgmn)), e outro onde o tempo se move para trás.\n- https://web.archive.org/web/20201201073352/http://www.iflscience.com/physics/there-parallel-universe-thats-moving-backwards-time\n- Artigo: [Identification of a Gravitational Arrow of Time](https://ipfs.infura.io/ipfs/QmTUEcRMHY4rery2q3Vxn6dQxJmAokGUH1h2JBVwnb2eiP)",
				"added": 1611797066
			},
			{
				"comment_id": 212,
				"body": "#Sem Big Bang? Equação quântica prevê que universo não tem começo\nO universo pode ter existido para sempre, de acordo com um novo modelo que aplica termos de correção quântica para complementar a teoria da relatividade geral de Einstein. O modelo também pode explicar a matéria escura e a energia escura, resolvendo vários problemas ao mesmo tempo. \n- https://web.archive.org/web/20201220223112/https://phys.org/news/2015-02-big-quantum-equation-universe.html\n\n#Bibliografia:\n- [Cosmology from quantum potential](https://ipfs.infura.io/ipfs/Qmc7w8bUYxiEuJoDwM16qBdr6LKCgfF8ukNnz8B8yURKan)\n- [Dark matter and dark energy from a Bose–Einstein condensate](https://ipfs.infura.io/ipfs/QmPs8EaT1vy2mgXzcmgRb86o8yFzQRQTJrym7eE7GsoEqA)",
				"added": 1611797848
			},
			{
				"comment_id": 219,
				"body": "#O status da supersimetria\nOutrora a estrutura mais popular para a física além do [Modelo Padrão](https://en.wikipedia.org/wiki/Standard_Model), a [supersimetria](https://en.wikipedia.org/wiki/Supersymmetry) está enfrentando um acerto de contas - mas muitos pesquisadores ainda não estão desistindo dela.\n- https://web.archive.org/web/20210126041143/https://www.symmetrymagazine.org/article/the-status-of-supersymmetry",
				"added": 1611863997
			},
			{
				"comment_id": 220,
				"body": "#Unificação supersimétrica sem supersimetria de baixa energia e assinaturas para ajuste fino no LHC\n- https://doi.org/10.1088/1126-6708/2005/06/073\n- https://ipfs.infura.io/ipfs/QmZJWXsaWWNpJX2kSvcjo8SrrdTFEXDK6CofM4cTHL46sc",
				"added": 1611864439
			},
			{
				"comment_id": 222,
				"body": "#Pela primeira vez, físicos delimitam a possível massa da matéria escura\nPodemos não saber o que é [matéria escura](https://en.wikipedia.org/wiki/Dark_matter), mas os cientistas agora têm uma ideia melhor do que procurar.\nCom base na [gravidade quântica](https://en.wikipedia.org/wiki/Quantum_gravity), os físicos desenvolveram novos e muito mais rígidos limites de massa superior e inferior das partículas de matéria escura. E eles descobriram que a faixa de massa é muito mais estreita do que se pensava anteriormente.\nIsso significa que os candidatos à matéria escura que são extremamente leves ou pesados provavelmente não serão a resposta, com base em nossa compreensão atual do Universo.\n- https://web.archive.org/web/20210128202210/https://www.sciencealert.com/in-a-world-first-physicists-have-steeply-narrowed-down-the-mass-range-of-dark-matter\n- Artigo: [Theoretical bounds on dark matter masses](https://ipfs.infura.io/ipfs/QmaC2QBQs651QreyqKFxebLaddwxST6Cmrhdhg5tssKCeo)",
				"added": 1611866001
			},
			{
				"comment_id": 224,
				"body": "#Teorias de Campo e as Interações Fundamentais da Natureza\nNesta palestra veremos como as partículas elementares e as interações fundamentais que observamos na natureza são descritas pelas Teorias de Campo. Veremos como o conceito de simetria é de fundamental importância nestas Teorias. Examinaremos também alguns dos problemas em aberto desta área e possíveis soluções. Discutiremos em particular como algumas destas Teorias de Campo preveem a existência de Defeitos Topológicos.\n- https://invidious.snopyta.org/NLhFavvC7G8\n- https://ipfs.io/ipfs/QmaoCHgqWfsNK4A5mjvkdM9ced6LPiR3W6sMep3EvA7Qk2",
				"added": 1612017221
			}
		],
		"2_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn": [
			{
				"comment_id": 10,
				"body": "#Computadores sem Wi-Fi invadidos podem transmitir dados… usando Wi-Fi\nVocê já ouviu falar de [air-gap](http://127.0.0.1:43110/0sh.bit/?a1yT)? Trata-se de um termo utilizado para se referir a computadores que não estão conectados à internet — melhor dizendo: que não podem se conectar à internet –, seja por não terem compatibilidade com redes a cabo ou [Wi-Fi](https://en.wikipedia.org/wiki/Wi-Fi), seja como método de proteção. Esse tipo de máquina se provou uma alternativa eficaz para manter dados sensíveis mais seguros, uma vez que fica completamente desconectada da internet e só poderia ser acessada localmente.\nPois é, poderia.\nNesta semana, o pesquisador Mordechai Guri, chefe de Pesquisa e Desenvolvimento do Centro de Pesquisas em Segurança Cibernética da Universidade Ben-Gurion do Neguev, em Israel, [divulgou](https://ipfs.infura.io/ipfs/QmasjQ8JLEmGBzogVy51yTqnpo1ic3jZ2HkQA5oArW5AZ7) ter descoberto uma nova brecha que permite se conectar a um computador air-gap por meio da memória [RAM](https://en.wikipedia.org/wiki/Random-access_memory) do dispositivo. Guri até já tem um nome para a vulnerabilidade: Air-Fi.\n- Fonte: https://web.archive.org/web/20201218153040/https://gizmodo.uol.com.br/memoria-ram-roubo-dados-wi-fi-air-gap/",
				"added": 1608322764
			},
			{
				"comment_id": 60,
				"body": "#Memória resistiva protege computadores contra ataques\n- https://web.archive.org/web/20201224121207/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=memoria-resistiva-protege-computadores-contra-ataques&id=010150201224\n- Artigo: [MoS2/Polymer Heterostructures Enabling Stable Resistive Switching and Multistate Randomness](https://ipfs.infura.io/ipfs/QmewAMiQiMSFBYQaRrZmdw44rsyF5nYzVHsT2ak34qPpMn)",
				"added": 1608844038
			},
			{
				"comment_id": 74,
				"body": "#Chip quântico 1.000 vezes menor promete segurança em aparelhos portáteis\nPesquisadores de Cingapura desenvolveram um chip de comunicação quântica 1.000 vezes menor do que os dispositivos atuais, mas oferecendo a mesma segurança aprimorada que é marca registrada da [criptografia quântica](https://en.wikipedia.org/wiki/Quantum_cryptography).\nMedindo cerca de três milímetros, o pequeno chip usa algoritmos de comunicação quântica para fornecer segurança aprimorada em comparação com os padrões existentes, baseados na criptografia clássica.\n- https://web.archive.org/web/20200925224004/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=chip-quantico-1-000-vezes-menor&id=010150191226\n- Artigo: [An integrated silicon photonic chip platform for continuous-variable quantum key distribution](https://ipfs.infura.io/ipfs/QmV2tYPh4CQmUmBcxZgXh1z2mb2umLYiZd5kG2YEzScsDz)",
				"added": 1609031957
			},
			{
				"comment_id": 75,
				"body": "#Cartões de crédito ganham proteção quântica contra fraudes\nA [mecânica quântica](https://en.wikipedia.org/wiki/Quantum_mechanics) é a mais nova ferramenta na luta contra a clonagem e a falsificação de cartões de crédito e débito.\nSebastianus Goorden e seus colegas da Universidade de Twente, na Holanda, usaram uma técnica de [criptografia quântica](https://en.wikipedia.org/wiki/Quantum_cryptography) para autenticar uma chave física que é virtualmente impossível de ser fraudada.\n- https://web.archive.org/web/20171105164750/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=cartoes-credito-protecao-quantica-contra-fraudes&id=010150141217\n- Artigo: [Quantum-secure authentication of a physical unclonable key](https://ipfs.infura.io/ipfs/QmTCtfyi7seKZGBpGGengunkJFD5wUoFxsxPL8PCb8iR51)",
				"added": 1609032335
			},
			{
				"comment_id": 95,
				"body": "#A Maior Invenção da Humanidade\n- https://invidious.snopyta.org/watch?v=vYIVtOB-4xQ\n- https://siasky.net/AACIOJeltELwAXPDQ9lnRkjJS1a11F5-4G0DmkiZInUx4w\n\n[Computadores](https://en.wikipedia.org/wiki/Computer) mudaram o mundo. Hoje somos extremamente dependente deles! Mas curiosamente, eles NÃO são a maior invenção da humanidade, como muitos argumentariam. Os computadores modernos que temos hoje só são possíveis por causa de outra tecnologia: os [transistores](https://en.wikipedia.org/wiki/Transistor). Esse vídeo é uma tentativa de explicar como transistores funcionam, como eles podem armazenar bits e eu até me arrisco a tentar explicar como computadores calculam 1 + 1 usando binário.",
				"added": 1609354437
			},
			{
				"comment_id": 145,
				"body": "#Inteligência Artificial descobre novo material tecnológico\nPela primeira vez, um sistema de inteligência artificial fez uma descoberta científica - um novo material - sem qualquer auxílio humano.\n\"[O sistema de] IA não é supervisionado. Muitos tipos de IA precisam ser treinados ou supervisionados. Em vez de pedir que aprendam as leis físicas, nós as codificamos na IA. Você não precisa de um humano para treinar a IA,\" ressaltou o professor Aaron Kusne, do Instituto Nacional de Padronização e Tecnologia dos EUA.\nOs pesquisadores incluíram no programa o conhecimento dos princípios-chave do experimento, incluindo dados de simulações e experimentos de laboratório, como o equipamento funciona e os conceitos físicos básicos necessários - para este primeiro teste, eles incluíram particularmente o conhecimento sobre o mapeamento de fase, que descreve como o arranjo dos átomos em um material muda com sua composição química e a temperatura.\n- https://web.archive.org/web/20210108201600/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=inteligencia-artificial-descobre-novo-material-tecnologico&id=010160210108\n- Artigo: [On-the-fly closed-loop materials discovery via Bayesian active learning](https://ipfs.infura.io/ipfs/QmUktG1AQudrZV9jzzEDSBGwncrQ6BeicA5GxEe98hCDUQ)",
				"added": 1610233481
			},
			{
				"comment_id": 170,
				"body": "#HTTrack Website Copier\nHTTrack é um navegador offline que copia e armazena páginas web para ser consultadas mais tarde. Com ele, você pode baixar websites da Internet para um diretório local. Assim, ele reconstrói todos os diretórios, links em HTML, imagens e outros arquivos que constituem um site, por meio do servidor do computador.\nHTTrack organiza os diversos links do site para criar uma relação coerente com os sites correspondentes. Para navegar no site \"espelho\", basta abrir uma de suas páginas e seguir os links como num site online. Ele também pode atualizar um site espelho e retomar downloads interrompidos.\n- Site: https://www.httrack.com/page/1/en/index.html\n\n#Source code:\n- https://github.com/xroche/httrack.git\n- https://siasky.net/_A6blt1BBxAAH28O8hIoVEE4JRHqwj6YFbB37JXip_fMHg",
				"added": 1611173195
			},
			{
				"comment_id": 177,
				"body": "#Inteligência Artificial ganha de nós no xadrez, mas não na memória\nÉ natural pensar que nossas memórias não conseguem competir com as memórias dos computadores porque, salvo algum defeito inesperado, \"um computador nunca esquece\" - no disco rígido ou na nuvem, ele sempre \"se lembra\" do que você mandou ele gravar.\nOcorre que a [inteligência artificial](https://en.wikipedia.org/wiki/Artificial_intelligence) não se sai tão bem quanto o nosso cérebro quando se trata da eficiência no armazenamento de memórias.\nEmbora tenha-se mostrado superior aos humanos em jogos como [xadrez](https://en.wikipedia.org/wiki/Chess) e [Go](http://127.0.0.1:43110/0sh.bit/?dahS), a inteligência artificial não conseguiu superar a estratégia de armazenamento de memórias do cérebro, que guarda mais dados e de maneira mais simples.\nEsta foi a conclusão de Francesca Schönsberg e colegas da Escola Internacional de Estudos Avançados (SISSA), na Itália.\nFrancesca descobriu que o que parece ser a grande deficiência da memória do cérebro, em comparação com a inteligência artificial, é na verdade seu maior trunfo: o esquecimento entra como um elemento que torna todo o processo mais eficiente.\n- https://web.archive.org/web/20210121131303/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=inteligencia-artificial-ganha-xadrez-mas-nao-memoria&id=010150210121\n- Artigo: [Efficiency of Local Learning Rules in Threshold-Linear Associative Networks](https://ipfs.infura.io/ipfs/Qmf6cdxREoSF8yq9MKFjc286NV3rhGgycyj6bRcv6sLVNB)",
				"added": 1611235508
			},
			{
				"comment_id": 183,
				"body": "#As doze mentes mais brilhantes da história da computação\n- https://web.archive.org/web/20201124153229/http://universoracionalista.org/as-doze-mentes-mais-brilhantes-da-historia-da-computacao/",
				"added": 1611248623
			}
		],
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": [
			{
				"comment_id": 11,
				"body": "#Economia e História: por que essas áreas precisam dialogar?\nA importância de uma área para a outra\n- https://leituraobrigahistoria.com/2020/10/07/economia-e-historia-por-que-essas-areas-precisam-dialogar/\n- https://siasky.net/AADbznhraTsKvfVpsqdKQGXyYHJXCKYNVH_Ctlp3yTgZcQ\n\n#Mercado e concorrência: como eles se definem?\nComo se define o mercado e quais os diferentes tipos de concorrência?\n- https://leituraobrigahistoria.com/2020/10/14/mercado-e-concorrencia-como-eles-se-definem/\n- https://siasky.net/AAB2DyJvU6nlrnRhKiTjexYbaQVUYncUbkdvgYkObpeDXA\n\n#Empreendedorismo e o engodo da meritocracia\nEntendendo a noção de empreendedorismo sem romantismos\n- https://leituraobrigahistoria.com/2020/10/21/empreendedorismo-e-o-engodo-da-meritocracia/\n- https://siasky.net/AABsjR7CbnrYpmFrx-Pnig8ZiQ_-ldY9FMXZSfSUX2rv3A\n\n#História do Mercado Financeiro\nO que é mercado financeiro e como ele surgiu?\n- https://leituraobrigahistoria.com/2020/10/28/historia-do-mercado-financeiro/\n- https://siasky.net/AACepd_9FLp9UVEaYylcKEZon8XRfL2SjKjrXgQA5tW8kg\n\n#Financeirização e Mercado Financeiro à partir do século XX\nOs impactos do Mercado Financeiro e da financeirização da vida\n- https://leituraobrigahistoria.com/2020/11/04/financeirizacao-e-mercado-financeiro-a-partir-do-seculo-xx/\n- https://siasky.net/AACMtgD84AEV0Ua2rfTkqj9ANCWO4svmAVX-912jrKr_fA\n\n#Emprego e desemprego: pensando em escala global\nUma análise crítica sobre emprego, desemprego e precarização em perspectiva global\n- https://leituraobrigahistoria.com/2020/11/11/emprego-e-desemprego-pensando-em-escala-global/\n- https://siasky.net/AABTuTPTvDJDh2CHIX6oB9D4P2axp6wYkcSTZMf04nWLSQ\n\n#Reforma agrária: quem ganha e quem sai perdendo?\nA quem interessa dizer que reforma agrária é \"coisa de comunista\"?\n- https://leituraobrigahistoria.com/2020/11/18/reforma-agraria-quem-ganha-e-quem-sai-perdendo/\n- https://siasky.net/AAA-OIwcjW37R_4qK3RSGNy9fzFaRz7Cf4lARr9QLk5Pew",
				"added": 1608324161
			},
			{
				"comment_id": 131,
				"body": "#Prostituição controlada pela ditadura deixou legião de filhos sem pai\n- https://invidious.snopyta.org/d2dG1G_IMMc\n- http://ipfs.io/ipfs/QmNbX7HdZkQww1nkQNpi6Fi3wDrEFkJv25p31c9uisS3gk\n\nA [ditadura militar](https://pt.wikipedia.org/wiki/Ditadura_militar_brasileira) dizia defender a moral e os bons costumes – mas, em [Foz do Iguaçu](https://pt.wikipedia.org/wiki/Foz_do_Igua%C3%A7u), não era bem assim. Na época das obras da [Usina de Itaipu](https://pt.wikipedia.org/wiki/Usina_Hidrel%C3%A9trica_de_Itaipu), uma zona de prostituição controlada pelo estado fervia nos dias de pagamento das obras. Documentos inéditos levantados pelo [Intercept](https://theintercept.com/brasil/) mostram que, durante as obras, o número de crianças sem pai quintuplicou na cidade.",
				"added": 1610037718
			},
			{
				"comment_id": 209,
				"body": "#Crise de 1929: causas e consequências de um desastre\nPor que a crise ocorreu e quais foram suas consequências?\n- https://web.archive.org/web/20210125222017/https://leituraobrigahistoria.com/2021/01/25/crise-de-1929-causas-e-consequencias-de-um-desastre/\n- https://ipfs.io/ipfs/QmbYj4RttsjT84cTH5XvCNhk5DuAYhT7xLxp6J87Qhq5Sp\n\n#LEITURAS RECOMENDADAS:\n- John M. Keynes – [Teoria geral do emprego, do juro e da moeda](https://ipfs.infura.io/ipfs/QmV9R9KE92jY29WBQE85sVrUrewrXfAjUQk335A1FbNGDz)\n- Eric J. Hobsbawm – [Era dos Extremos](https://ipfs.infura.io/ipfs/QmX3bT3Kg8E1xCewcJJA27Zt5psm5RNuDz6CvUL3rv85VG)\n- Giovanni Arrighi – [O longo século XX](https://ipfs.infura.io/ipfs/QmX2bqpi1bYtv1Nh9yQfrYaWVpA9nXRbPjhZuLXXnNyB3e)",
				"added": 1611614009
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 35,
				"body": "#Como resolvemos um mistério do código Da Vinci sobre a origem da vida\nhttps://web.archive.org/web/20201219233931/https://soccermatics.medium.com/how-we-solved-a-da-vinci-code-mystery-about-the-origin-of-life-5d269640c7d4",
				"added": 1608523772
			},
			{
				"comment_id": 76,
				"body": "#A [hipótese de Riemann](https://en.wikipedia.org/wiki/Riemann_hypothesis) é verdadeira até 3.10^12\n- https://arxiv.org/abs/2004.09765\n- https://ipfs.infura.io/ipfs/QmScqSCM3AgPQNQR4YbC8x3aj6hwfQyJdWWeuadU8fqv9D",
				"added": 1609039094
			},
			{
				"comment_id": 77,
				"body": "#Estimativa explícita de densidade zero para a [função zeta de Riemann](https://en.wikipedia.org/wiki/Riemann_zeta_function) perto da linha crítica\n- https://arxiv.org/abs/1910.08274\n- https://ipfs.infura.io/ipfs/QmcNoCgK2hcPUv5yGuhPUWdysuwphTgRDAoyiuasuMhCio",
				"added": 1609039669
			},
			{
				"comment_id": 134,
				"body": "#Como redigir matemática : dicas, cuidados, técnicas, sugestões... 1º dia\n- https://invidious.snopyta.org/tJUtefTCiuY\n- https://siasky.net/AAANJq2hOzwYoAUNKehlYydRO3rxMSunC4_Do5wOh7z4lQ\n\nAulas, pesquisas de iniciação científica, trabalhos de conclusão de curso ou até mesmo estágios, fazem parte do processo de construção de conhecimento, e é importante que esse conhecimento seja divulgado de forma adequada para que realmente faça diferença.\n\n#Como redigir Matemática: dicas, técnicas, sugestões... 2º dia\n- https://invidious.snopyta.org/watch?v=QYIqQookb80\n- https://siasky.net/AADGWgHjLpWIDjxUOKgxsHgue8qgj9BNMMWu8YlnsFURQw",
				"added": 1610122682
			},
			{
				"comment_id": 135,
				"body": "24º CBM - Palestra de Divulgação - Aloisio Araujo, [IMPA](https://impa.br/)\nEconomia Matemática: A Revolução de Nash na Teoria de Jogos\n- https://invidious.snopyta.org/0cwuxnmPRbY\n- https://siasky.net/AACAX3HtuJKRHC7cXBTZOFHL4xoe3edRVCe9wBrXKtQFWg",
				"added": 1610123622
			},
			{
				"comment_id": 136,
				"body": "#Como um silêncio resolveu os estranhos problemas matemáticos dos buracos negros\n- https://web.archive.org/web/20210105193411/https://www.bbc.com/portuguese/vert-fut-54904726",
				"added": 1610123963
			},
			{
				"comment_id": 138,
				"body": "#Matemático prova um grande resultado no problema \"perigoso\"\n[Terence Tao](https://en.wikipedia.org/wiki/Terence_Tao) postou uma prova mostrando que - no mínimo - a [conjectura de Collatz](https://en.wikipedia.org/wiki/Collatz_conjecture) é “quase” verdadeira para “quase” todos os números. Embora o resultado de Tao não seja uma prova completa da conjectura, é um grande avanço em um problema que não revela seus segredos facilmente.\n- https://web.archive.org/web/20210101040615/https://www.quantamagazine.org/mathematician-terence-tao-and-the-collatz-conjecture-20191211/\n- Artigo: [Almost all orbits of the Collatz map attain almost bounded values](https://ipfs.infura.io/ipfs/QmbsenMLPRQTkEsJ39LqMGD9JqmJPDW6Q1LRnmixfrm2jc)",
				"added": 1610136718
			},
			{
				"comment_id": 174,
				"body": "#A acolhida do Teorema da Incompletude de Gödel pelos matemáticos\n\"Neste artigo apresentamos nosso entendimento sobre como alguns matemáticos acolheram os resultados estabelecidos pelo Teorema da Incompletude de Gödel. Compreendemos que a postura assumida por Bourbaki e revelada em suas obras diz desse modo de como os matemáticos recepcionaram este importante teorema bem como suas implicações. A atitude é de seguir fazendo Matemática com o mesmo ideal de formalização completa, mesmo ante a prova da existência de um conjunto não vazio de proposições verdadeiras e indecidíveis e consequentemente da incompletude de toda teoria que contenha a aritmética de Peano em sua formalização. Apresentamos também a perspectiva de Wittgenstein em relação ao TIG. Por fim, entendemos que esse teorema é compreendido pela comunidade como mensageiro da incompletude como uma característica da Matemática, não como um impedimento para o prosseguimento da atividade com sistemas formais e sim como um resultado revigorante para a Matemática.\"\n- https://doi.org/10.46312/pem.v13i31.6737\n- https://ipfs.infura.io/ipfs/QmNdwAgymHpWhSUpRjZUPBKdk1kpTcrrr9y6fdaAUSoMnH",
				"added": 1611179988
			},
			{
				"comment_id": 175,
				"body": "#Teoremas de Incompletude de Gödel\n- https://web.archive.org/web/20201213013923/https://plato.stanford.edu/entries/goedel-incompleteness/\n\nOs [dois teoremas de incompletude de Gödel](https://en.wikipedia.org/wiki/G%C3%B6del%27s_incompleteness_theorems) estão entre os resultados mais importantes da lógica moderna, e têm profundas implicações para várias questões. Eles dizem respeito aos limites da provabilidade em teorias axiomáticas formais. O primeiro teorema da incompletude afirma que em qualquer sistema formal consistente F dentro do qual uma certa quantidade de aritmética pode ser realizada, há declarações da linguagem de F que não podem ser provadas nem refutadas em F. De acordo com o segundo teorema da incompletude, tal sistema formal não pode provar que o sistema em si é consistente (assumindo que é de fato consistente). Esses resultados tiveram um grande impacto na [filosofia da matemática](https://web.archive.org/web/20201111090500/https://plato.stanford.edu/entries/philosophy-mathematics/) e [da lógica](https://en.wikipedia.org/wiki/Philosophy_of_logic). Houve tentativas de aplicar os resultados também em outras áreas da filosofia, como a [filosofia da mente](https://en.wikipedia.org/wiki/Philosophy_of_mind), mas essas tentativas de aplicação são mais controversas.",
				"added": 1611192939
			},
			{
				"comment_id": 181,
				"body": "#As doze mentes mais brilhantes da história da matemática\n- https://web.archive.org/web/20210110234333/https://universoracionalista.org/as-doze-mentes-mais-brilhantes-da-historia-da-matematica/",
				"added": 1611248289
			},
			{
				"comment_id": 186,
				"body": "#Games dão sentido prático à matemática e motivam alunos a aprender\nAlém de apoiar ensino da matemática, jogos digitais podem ajudar a trabalhar aspectos sociais e ambientais e até reduzir “bullying”\n- https://web.archive.org/web/20190812144349/https://jornal.usp.br/ciencias/ciencias-exatas-e-da-terra/games-dao-sentido-pratico-a-matematica-e-motivam-alunos-a-aprender/",
				"added": 1611249249
			},
			{
				"comment_id": 187,
				"body": "#Os cérebros são bayesianos?\nSó porque algoritmos inspirados no [teorema de Bayes](https://en.wikipedia.org/wiki/Bayes%27_theorem) podem imitar a cognição humana, não significa que nossos cérebros empregam algoritmos semelhantes.\n- https://web.archive.org/web/20201112030804/https://blogs.scientificamerican.com/cross-check/are-brains-bayesian/\n- https://siasky.net/_A65xZ9oeTQSeHyeIsMJJ3YKdjW8xJ2Rsq4pQmCqFDo0AA",
				"added": 1611249848
			},
			{
				"comment_id": 201,
				"body": "#Uma prova de que e é irracional - Numberphile\nO professor Ed Copeland mostra uma prova de [Joseph \"Voldemort\" Fourier](https://en.wikipedia.org/wiki/Joseph_Fourier) de que [e](http://127.0.0.1:43110/0sh.bit/?5AQ2) é [irracional](https://en.wikipedia.org/wiki/Irrational_number).\n- https://invidious.snopyta.org/xOXsDfMMTjs\n- https://siasky.net/AACmgz-QNRIG9C26Bsh1SmxUjUDMyaP4ZaeFpuZdG0ZICg",
				"added": 1611576220
			},
			{
				"comment_id": 205,
				"body": "#O significado de uma potência com expoente irracional\n- http://repositorio.ufersa.edu.br/handle/prefix/5802\n- https://ipfs.infura.io/ipfs/QmRJ8aCSgaBkn38TyA7jCaQqrW9JF5fQvKEtauqDe5VJ4o",
				"added": 1611596592
			},
			{
				"comment_id": 206,
				"body": "#[A Teoria dos Conjuntos de Cantor](https://ipfs.infura.io/ipfs/QmS4s85iu9Y257z8h1poxrAkg7fJgZpkQfS1MCQjBWyBog)\nNo final dos anos 50 e começo dos anos 60, houve uma reformulação significativa da Matemática no Brasil. Sob a bandeira do modernismo, seus defensores buscaram inovações no ensino da Matemática. Dessa forma, os reformistas se concentraram essencialmente na linguagem abusiva e no formalismo da Teoria dos Conjuntos, o que trouxe mais danos do que benefícios do ensino da Matemática de 1º e 2º graus. A linguagem formal da Teoria dos Conjuntos é porém sua parte menos importante.\nA teoria criada por Cantor tão logo revelou-se como o fundamento de toda a Matemática, possibilitando o desenvolvimento de novas disciplinas, como a Topologia, a Álgebra Abstrata, a Teoria da Medida e Integração, a Teoria da Probabilidade e a Análise Funcional.\nO objetivo deste trabalho é um relato sucinto de como surgiu essa teoria, apresentando o \"Conjunto de Cantor\" como um dos mais ricos exemplos de \"Conjunto perfeito\" encontrados na literatura matemática.",
				"added": 1611597071
			},
			{
				"comment_id": 207,
				"body": "#O Paradoxo do Hotel Infinito\n- https://invidious.snopyta.org/WK47hxmVdv4\n- https://ipfs.io/ipfs/QmRRhrzvjWRX9rbaQAHCAsdtT1UcbztmGTKDodFwU6CQv8\n\nExistem infinitos maiores do que outros? Ou será que todos os infinitos tem o mesmo tamanho? Esse vídeo fala sobre o [Paradoxo do Hotel Infinito](https://en.wikipedia.org/wiki/Hilbert%27s_paradox_of_the_Grand_Hotel), proposto por [David Hilbert](https://en.wikipedia.org/wiki/David_Hilbert).",
				"added": 1611597796
			},
			{
				"comment_id": 210,
				"body": "#[PAPMEM - Janeiro de 2021](https://impa.br/ensino/programas-de-formacao/linha-do-tempo-dos-cursos/papmem-janeiro-de-2021) - De onde vêm as “raízes estranhas” de equações irracionais como evitá-la\n- https://invidious.snopyta.org/OmcgFAhcieU\n- https://siasky.net/AADxb-lTlESXFHqf1Wj2sKdb2IokZzpYtM4U6taN_M2hQQ\n\nPrograma de Aperfeiçoamento para Professores de Matemática do Ensino Médio\nIMPA, Rio de Janeiro, 25 a 29 de janeiro de 2021\nProfessor: Luciano Castro\n\n#Material didático: https://ipfs.infura.io/ipfs/QmQdhqkv9CEF3Vunw6x5eDbpTQDmcDeLsBVa69JesG85DP",
				"added": 1611625576
			},
			{
				"comment_id": 215,
				"body": "#A Teoria dos Jogos: Conflito e Colaboração\nEste artigo objetivou apresentar a importância da teoria dos jogos como instrumento matemático de compreensão dos fenômenos sociais do mundo moderno.  A teoria dos jogos apresenta para as ciências, em geral, uma nova filosofia de cooperação. Dois verbos têm um sentido bastante usual na linguagem dos jogos: desertar e cooperar. Quando jogamos uma partida de [gamão](https://pt.wikipedia.org/wiki/Gam%C3%A3o) esperamos um vencedor, em contra partida, quando um novo empresário quer entrar em um mercado bastante competitivo, é necessário que ele avalie todas as possíveis estratégias de sucesso e fracasso, de sua entrada, numa área já dominada por outros empresários (jogadores). E neste caso, o simples fato de cooperação entre os jogadores nos leva a possibilidade de resultados mais otimistas.\n- https://revistas.cesmac.edu.br/index.php/administracao/article/view/797\n- https://ipfs.infura.io/ipfs/QmfJr56SxDHzhXB7zPTZTg6WXFRuS1swZyS9LVTYXAAH43",
				"added": 1611844893
			},
			{
				"comment_id": 217,
				"body": "#Jogo de soma zero\nNa teoria dos jogos e na teoria econômica, um [jogo de soma zero](https://everipedia.org/wiki/lang_en/Zero-sum_game) é uma representação matemática de uma situação na qual o ganho ou perda de utilidade de cada participante é exatamente equilibrado pelas perdas ou ganhos de utilidade dos outros participantes.\n- https://en.wikipedia.org/wiki/Zero-sum_game",
				"added": 1611845409
			},
			{
				"comment_id": 218,
				"body": "#Problemas de soma zero com peso sobre grupos abelianos finitos\nEstudamos uma variação de um clássico problema em Teoria Aditiva dos Números: o problema de soma zero com peso. Apresentamos vários resultados para os invariantes ηA(G), gA(G) e sA(G), quando G é um grupo abeliano finito específico e A = {−1, 1}.\n-  https://repositorio.unb.br/handle/10482/7228\n- https://ipfs.infura.io/ipfs/QmRhLKysWBzi2qHFdzyCEK16egfSrco66vtgFdgHRRP7nC",
				"added": 1611845638
			},
			{
				"comment_id": 228,
				"body": "#Biblioteca - Licenciatura em Matemática\n- https://web.archive.org/web/20210130224812/http://www.mat.ufmg.br/ead/biblioteca/\n- https://ipfs.io/ipfs/QmaVWc7HevBdV66LHTi58TGbqGGykHzYLmPFqyRXUpzLYn",
				"added": 1612047684
			}
		],
		"1_1ExYhecdNveJBbZnjsxEyjs6FWq7XDv9dr": [
			{
				"comment_id": 40,
				"body": "#As verdadeiras razões pelas quais todos os melhores jogadores de xadrez são homens\nhttps://web.archive.org/web/20201220224654/https://slate.com/technology/2020/12/why-are-the-best-chess-players-men.html",
				"added": 1608568379
			}
		],
		"2_1JWzeTyK26d4RAYsyHethugMvfKfQJQSCt": [
			{
				"comment_id": 41,
				"body": "#Músculo artificial fica mais forte a cada uso\nQuando você treina, realizando atividades físicas repetidamente, seus músculos tornam-se cada vez mais fortes.\nMas submeta um material feito pelo homem ao mesmo processo e ele vai sofrer fadiga - não o cansaço que você sente após treinar, mas um desgaste com rápida diminuição da resistência, que finalmente fará com que o material se quebre.\nAgora, pesquisadores japoneses desenvolveram uma técnica que permite fabricar materiais que, assim como os músculos humanos, ficam mais fortes em resposta ao estresse mecânico.\nAlém de músculos artificiais para robôs e automação industrial, a técnica abre caminho para materiais duradouros que podem não apenas se adaptar, mas também se fortalecer com base nas condições de uso.\n- https://web.archive.org/web/20190214161750/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=musculo-artificial-fica-mais-forte-cada-uso&id=010180190213\n- Artigo: [Mechanoresponsive self-growing hydrogels inspired by muscle training](https://ipfs.infura.io/ipfs/QmTpmKNa32RTR4EyREo2cLE5rWL5DreyUYYkct4ssLXZ63)",
				"added": 1608583513
			},
			{
				"comment_id": 118,
				"body": "#Kriptonita existe e se chama jadarita, diz pesquisador britânico\nA [kriptonita](https://en.wikipedia.org/wiki/Kryptonite), pedra fictícia utilizada pelos inimigos do [Super-Homem](https://en.wikipedia.org/wiki/Superman) para debilitá-lo, existe sob a forma de um mineral muito parecido, declarou um mineralogista do [Museu de História Natural de Londres](https://en.wikipedia.org/wiki/Natural_History_Museum,_London).\nChris Stanley afirma que esse mineral --batizado como [jadarita](https://en.wikipedia.org/wiki/Jadarite) devido à região sérvia em que foi encontrado pela companhia mineradora [Rio Tinto](http://127.0.0.1:43110/0sh.bit/?KOLw)-- contém os mesmos elementos que os célebres cristais que despojam o super-herói de seus poderes.\nO único componente que falta é a fluorita. \"Mas todos os demais elementos respeitam a composição química da kriptonita\", afirma Stanley.\nAo buscar na internet os nomes dos componentes do mineral que estava analisando, Chris Stanley foi parar no site do filme \"Superman Returns\" (2006) e então se deu conta de que o inimigo do herói, Lex Luthor, havia roubado de um museu um fragmento de kriptonita guardado num cofre no qual estava escrita sua composição: sódio, lítio, boro, silicato, hidróxido e fluorita.\n- Fonte: https://web.archive.org/web/20200925083034/http://www1.folha.uol.com.br/folha/ciencia/ult306u16341.shtml",
				"added": 1609778838
			},
			{
				"comment_id": 120,
				"body": "#O Escudo do Capitão América | Nerdologia\n- https://invidious.snopyta.org/watch?v=dYKa5cgRMkg\n- https://siasky.net/AACNKWuGbffpycRIdzgqMYiF8jqeGn7-MBVy2hYYva96dg\n\n#Como fazer o martelo do Thor e o escudo do Capitão América | Nerdologia\n- https://invidious.snopyta.org/watch?v=ip95eNLd7u4\n- https://siasky.net/AABaPaHs-WNqoAy_HAClp5eLMrBNjbTJxXT7NGwNQnl94w",
				"added": 1609779506
			},
			{
				"comment_id": 139,
				"body": "#O Que Acontece se Você TOCAR em URÂNIO?\nO que aconteceria se você tocasse em [Urânio](https://en.wikipedia.org/wiki/Uranium)? Você provavelmente já viu vídeos ou fotos de pessoas vestindo trajes especiais em reatores nucleares, mas por que exatamente eles usam essa proteção? Quais seriam os efeitos no corpo humano da radiação do Urânio?\n- https://invidious.snopyta.org/lOVeFSwPagY\n- https://siasky.net/AADx3nZnr3_M7G2MOjAdmZJv8ptHM1fc49SaTmh1LDVKxg",
				"added": 1610139761
			},
			{
				"comment_id": 184,
				"body": "#As doze mentes mais brilhantes da história da química\n- https://web.archive.org/web/20210110234221/https://universoracionalista.org/as-doze-mentes-mais-brilhantes-da-historia-da-quimica/",
				"added": 1611248678
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 47,
				"body": "#Na Natureza Selvagem – Jon Krakauer\n- https://ipfs.infura.io/ipfs/QmbSzfDr72Qrz4e9vjc1nX3yMStojgEWZC1UCNhWVCFQk3\n\n[Na natureza selvagem](http://127.0.0.1:43110/0sh.bit/?Ui6C), de [Jon Krakauer](https://en.wikipedia.org/wiki/Jon_Krakauer), autor do best-seller [No ar rarefeito](https://ipfs.infura.io/ipfs/QmW56wvht3swEhmjbJXQjxZfjwMYGsSxVaTD76jDqnLK2V), traz uma história real. O corpo em decomposição de um jovem é encontrado no Alasca. A polícia descobre que se trata de um rapaz de família rica do Leste americano que largou tudo, se internou sozinho na aridez gelada e morreu de inanição. Quem era o garoto? Por que foi para o Alasca? Por que morreu? Para responder a essas e outras perguntas, Jon Krakauer refaz a trajetória de [Chris McCandless](https://en.wikipedia.org/wiki/Chris_McCandless), revelando a América dos que vivem à margem, pegando carona ou circulando em carros velhos, vivendo em acampamentos e cidades-fantasmas. Mergulha no mundo da cidadezinha rural, onde homens rudes bebem e conversam sobre o tempo e a colheita. Compara a história do jovem com a de outros aventureiros solitários que tiveram fim trágico. O resultado é uma narrativa envolvente, por vezes amarga, em que os sonhos da juventude se transformam em pesadelo.",
				"added": 1608672418
			},
			{
				"comment_id": 52,
				"body": "#Drácula – Bram Stoker\n- https://ipfs.infura.io/ipfs/QmR1RPxQPbC51ogs4bsYHySZXntNf8b4CfcNQCBdMmjh5b\n\n[Bram Stoker](https://en.wikipedia.org/wiki/Bram_Stoker) é o criador genial de uma das mais famosas e horripilantes histórias de terror de todos os tempos. Drácula é uma história de vampiros e lobisomens, de criaturas que estando mortas permanecem vivas. Baseado no folclore da [Transilvânia](https://en.wikipedia.org/wiki/Transylvania) e num personagem real (o rei [Vlad, o Empalador](https://en.wikipedia.org/wiki/Vlad_the_Impaler)), redigiu um relato que tem assombrado gerações consecutivas de leitores, transformando-se num mito adaptado para o cinema, quadrinhos e TV, talvez o mais significativo destes últimos dois séculos. Na história, um jovem inglês é mantido em cativeiro, à espera de um destino terrível. Longe dele, sua noiva bela e jovem é atacada por uma doença misteriosa que parece extrair o sangue de suas veias. Por trás de tudo, a força sinistra que ameaça suas vidas: [Conde Drácula](https://en.wikipedia.org/wiki/Count_Dracula), o vampiro vindo do fundo dos séculos.",
				"added": 1608743412
			},
			{
				"comment_id": 86,
				"body": "#Viagem ao Centro da Terra – Júlio Verne\n- https://ipfs.infura.io/ipfs/QmQz6bKZWhkBQWY8hFE9p9ruLchF7tdZgSEf6dyp5gCkZt\n\nAxel é um jovem órfão que mora em Hamburgo com seu tio Otto Lindenbrock, um renomado cientista da área de geologia e mineralogia. Um dia, o cientista encontra um pergaminho escrito em linguagem misteriosa. Ao desvendarem o enigma, tio e sobrinho descobrem algo inacreditável: a possibilidade de chegar ao centra da terra. com a ajuda de Hans, um intrigante caçador islandês, eles iniciarão a maior aventura de suas vidas e conhecerão cenários deslumbrantes, criaturas fantásticas e perigos de arrepiar. Prepara-se para essa expedição inesquecível.",
				"added": 1609276682
			},
			{
				"comment_id": 87,
				"body": "#A ilha misteriosa – Júlio Verne\n- https://ipfs.infura.io/ipfs/QmUXPVNsZpKrXSPaUj5tj7Ykurg2czqzpDMrcmTszAC9VX\n\nO livro conta a história de cinco abolicionistas que fogem num balão. Após vários dias de tempestade, um deles cai ao mar e desaparece enquanto os demais despencam sobre um rochedo no meio do oceano. Os quatro sobreviventes buscam a todo custo encontrar o amigo desaparecido, organizando suas vidas na ilha desconhecida localizada perto do rochedo. Acontecimentos estranhos, porém, põem em risco suas integridades físicas e emocionais, levando-os a acreditar na existência de uma força secreta - que segredos, afinal, guarda essa ilha misteriosa?",
				"added": 1609277011
			},
			{
				"comment_id": 88,
				"body": "#Vinte Mil Léguas Submarinas – Julio Verne\n- https://ipfs.infura.io/ipfs/QmZJCzT1Y5ptwfL3BuvfH4vTM36Ux7e1z2xooKPTSRLFPj\n\nO aparecimento de uma criatura desconhecida nos mares provoca preocupação e curiosidade. Uma expedição parte em busca de respostas mas é atacada pela criatura e três homens são lançados ao mar. Aronnax, Conselho e Ned Land são resgatados pelo suposto monstro, que descobrem se tratar de um submarino, comandado pelo capitão Nemo. Ele os salva da morte, mas pede um preço alto: serão prisioneiros para sempre.",
				"added": 1609277172
			},
			{
				"comment_id": 91,
				"body": "#Da Terra à Lua – Júlio Verne\n- https://ipfs.infura.io/ipfs/QmYrp7tzH2EK1Xr5eeSrUbjGQqbbEroFfXTcRRobkJA59W\n\nDa Terra à Lua é um romance de ficção científica do escritor francês [Júlio Verne](https://en.wikipedia.org/wiki/Jules_Verne), publicado em 1865. Conta a saga do Gun Club, uma organização americana especializada em armas de fogo, canhões e balística em geral, e da ideia de seus membros em construir um enorme canhão para arremessar um projétil de forma cilindro-cônica à Lua.",
				"added": 1609283816
			},
			{
				"comment_id": 111,
				"body": "#Livros - Dr. Enéas Ferreira Carneiro\n- https://ipfs.io/ipfs/QmQpMQHC9kijYpiDGeCbr2DvZnB7strntaotoUfJTcPafX\n\n[Enéas Carneiro](https://pt.wikipedia.org/wiki/En%C3%A9as_Carneiro) (1938-2007) foi um político, médico cardiologista, físico, matemático, professor e escritor brasileiro. Ficou conhecido com o bordão \"Meu nome é Enéas\". Enéas Ferreiro Carneiro nasceu em Rio Branco, no [Acre](https://pt.wikipedia.org/wiki/Acre), no dia 5 de novembro de 1938.\n\n- Fonte: [EneasTV](https://invidious.snopyta.org/channel/UCyEWTDUXtabkFXb0TJLxs0A)",
				"added": 1609605112
			},
			{
				"comment_id": 151,
				"body": "#Negocie Como Se Sua Vida Dependesse Disso – Chris Voss\n- https://ipfs.infura.io/ipfs/QmZLT3mBNY2ire6xBwgari4A3NjcVJBKYj9qRpHmB1Cr38\n\nEste livro leva você para o mundo das negociações de alto risco e para dentro da mente de [Chris Voss](https://en.wikipedia.org/wiki/Christopher_Voss), que em sua carreira no [FBI](https://en.wikipedia.org/wiki/Federal_Bureau_of_Investigation) se tornou o principal negociador internacional em situações de sequestro.\nUm dos mais bem-sucedidos guias de negociação dos últimos tempos, ele ensina nove princípios contra intuitivos para se tornar mais persuasivo na vida pessoal e profissional. Tudo isso combinado a histórias reais e emocionantes da atuação de Voss no FBI.\nA vida é uma sucessão de negociações para as quais você deve estar preparado: comprar um carro, pedir um aumento, renegociar o aluguel, debater decisões com a família.\n[Negocie como se sua vida dependesse disso](https://www.amazon.com.br/Negocie-como-vida-dependesse-disso/dp/8543108055) levará sua inteligência emocional e intuição a outro patamar, lhe dando uma vantagem competitiva em qualquer discussão.",
				"added": 1610332973
			},
			{
				"comment_id": 153,
				"body": "#A Origem das Espécies – Charles Darwin\n- https://ipfs.infura.io/ipfs/QmP3rPmkfwfeYMpPD1j42EMqtZubxydM65LrYrbRAcXKoH\n\nConhecido como ‘O livro que abalou o Mundo’, ‘[A Origem das Espécies](https://en.wikipedia.org/wiki/On_the_Origin_of_Species)’, foi lançado em 1859 e as cópias da obra do biólogo e naturalista [Charles Darwin](https://en.wikipedia.org/wiki/Charles_Darwin) se esgotaram logo no primeiro dia de lançamento – e o mesmo aconteceu com as seis impressões seguintes. Darwin lançou para o mundo as bases da ‘Teoria da Evolução Natural’, com o conceito do desenvolvimento de todas as formas de vida por meio de um processo lento de seleção, no qual apenas os mais fortes sobrevivem. Este livro reúne o relato dessa pesquisa.",
				"added": 1610396306
			},
			{
				"comment_id": 154,
				"body": "#Viagem de um Naturalista ao Redor do Mundo – Charles Darwin\n- https://ipfs.infura.io/ipfs/QmWaigXVqf4DTMZJFQaXMamxgRbccNzVKDvnbH2agnyZB7\n\nEm 1831, o naturalista britânico [Charles Darwin](https://en.wikipedia.org/wiki/Charles_Darwin) (1809-1882), com apenas 22 anos, embarcou no navio Beagle para participar de uma expedição que duraria até 1833. A jornada acabou estendendo-se por cinco anos e, conforme as palavras do próprio Darwin, “determinou toda a minha carreira”. Foi enquanto colecionava espécimes em terras pouco exploradas que ele começou a formular as ideias que culminariam em [A origem das espécies](https://en.wikipedia.org/wiki/On_the_Origin_of_Species), seu principal livro e divisor de águas no modo do ser humano considerar a própria existência. Viagem de um naturalista ao redor do mundo traz os diários mantidos durante essa jornada pelo cientista, que passou pela África, pelas infindáveis costas da América do Sul (inclusive do Brasil), Terra do Fogo, Andes, ilhas Galápagos e Austrália. Acompanhamos Darwin na coleta diária de materiais, graças à qual acumularia um volume único de informações; a partir desses dados seriam formuladas as teorias de evolução e seleção natural – trabalho que pode ser adivinhado, subjacente e em gestação, a cada página de suas apaixonantes observações. Publicado primeiramente em 1839, com o título de Journal and Remarks (Diário e observações), este livro é um misto de relato de viagem, livro de memórias e bloco de apontamentos. E é, sobretudo, uma deliciosa e acessível introdução à mente de um dos pensadores mais influentes da história.",
				"added": 1610396550
			},
			{
				"comment_id": 188,
				"body": "#Ideias Para Adiar o Fim do Mundo – Ailton Krenak\n- https://ipfs.infura.io/ipfs/QmfArmihVjwv1oYDQhi3t6xTyRLBNXmZM6bND6c7Ga3iWw\n\nAilton Krenak nasceu na região do vale do rio Doce, um lugar cuja ecologia se encontra profundamente afetada pela atividade de extração mineira. Neste livro, o líder indígena critica a ideia de humanidade como algo separado da natureza, uma “humanidade que não reconhece que aquele rio que está em coma é também o nosso avô”.\nEssa premissa estaria na origem do desastre socioambiental de nossa era, o chamado Antropoceno. Daí que a resistência indígena se dê pela não aceitação da ideia de que somos todos iguais. Somente o reconhecimento da diversidade e a recusa da ideia do humano como superior aos demais seres podem ressignificar nossas existências e refrear nossa marcha insensata em direção ao abismo.\n“Nosso tempo é especialista em produzir ausências: do sentido de viver em sociedade, do próprio sentido da experiência da vida. Isso gera uma intolerância muito grande com relação a quem ainda é capaz de experimentar o prazer de estar vivo, de dançar e de cantar. E está cheio de pequenas constelações de gente espalhada pelo mundo que dança, canta e faz chover. […] Minha provocação sobre adiar o fim do mundo é exatamente sempre poder contar mais uma história.”\nDesde seu inesquecível discurso na Assembleia Constituinte, em 1987, quando pintou o rosto com a tinta preta do jenipapo para protestar contra o retrocesso na luta pelos direitos indígenas, Krenak se destaca como um dos mais originais e importantes pensadores brasileiros. Ouvi-lo é mais urgente do que nunca. Ideias para adiar o fim do mundo é uma adaptação de duas conferências e uma entrevista realizadas em Portugal, entre 2017 e 2019.",
				"added": 1611279133
			},
			{
				"comment_id": 214,
				"body": "#Cooperação e Conflito: Instituições e Desenvolvimento Econômico\n- Autor: Ronaldo Fiani\n\nEste livro tem por objetivo apresentar a relação entre as instituições e o desenvolvimento econômico. Analisando as diversas teorias existentes sobre o papel das instituições, sempre respeitando o contexto histórico, o autor mostra a evolução da análise econômica das instituições. O debate acadêmico é apresentado de forma acessível ao estudante de economia e aos leitores interessados em desenvolvimento econômico, buscando trazer as contribuições mais recentes sobre o tema. Nessa discussão, as instituições são entendidas como mecanismos que regulam a cooperação e o conflito nas relações econômicas. O objetivo fundamental desse debate é compreender como as instituições afetam o sistema econômico e, desse modo, como podem favorecer ou prejudicar o desenvolvimento.\n- https://ipfs.infura.io/ipfs/QmSqYSsmPeZ3Z9riZBJ6qx9m8UkUteGrpH6YhbQ5pHcrCb",
				"added": 1611844651
			},
			{
				"comment_id": 234,
				"body": "#Why We Get Sick: The New Science of Darwinian Medicine\n- Autores: Randolph M. Nesse, George C. Williams\n\nNa próxima vez que você ficar doente, considere isso antes de pegar a [aspirina](https://en.wikipedia.org/wiki/Aspirin): seu corpo pode estar fazendo exatamente o que deveria. Neste livro inovador, dois pioneiros da ciência da medicina darwiniana argumentam que a doença, bem como os fatores que nos predispõem a ela, estão sujeitos às mesmas leis da seleção natural que, de outra forma, tornam nossos corpos esses milagres de design.\n- https://ipfs.infura.io/ipfs/QmZtcMjdx1zTvcoSon19D7dTnEAChaGzJ3wTY7YCssFjUL",
				"added": 1612097544
			}
		],
		"1_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": [
			{
				"comment_id": 57,
				"body": "#Como o Exército da Índia enganou os satélites da CIA e detonou cinco bombas nucleares?\nConheça a operação de “Maskirovka” hindu que fez os serviços secretos dos EUA e Paquistão de tolos!\n- https://invidious.snopyta.org/watch?v=EgWPYY8BKEs\n- http://ipfs.io/ipfs/QmWvhB9n2a58Ah1DLFv4Ho7o1aKMFtrKEwDEGpHLAjECpX",
				"added": 1608829276
			},
			{
				"comment_id": 62,
				"body": "#[GAU-8 Avenger](https://en.wikipedia.org/wiki/GAU-8_Avenger), o canhão rotativo mais poderoso do mundo\n- https://invidious.snopyta.org/watch?v=lPR670pDI-k\n- http://ipfs.io/ipfs/QmS53VUrAkEAzsUfKD1Pgz9PaoiFsn9FBW5bn4WVKPNPFx",
				"added": 1608905119
			},
			{
				"comment_id": 100,
				"body": "#Submarino porta-aviões - Ficção ou uma possibilidade real?\n- https://invidious.snopyta.org/watch?v=PsJ6FiQuDGs\n- https://siasky.net/AADtWb9NSpiSaXJDZTMx4JL1K9wjEyALMQKv5IyX7bwrRQ",
				"added": 1609480005
			},
			{
				"comment_id": 101,
				"body": "#VANT, veículos aéreos não tripulados\n- https://invidious.snopyta.org/watch?v=1gwN7rfGmFc\n- https://siasky.net/AADlWJQmtiN_BDMayiOTvi7fiMhBwpqYvWa5JW9HLFWNzQ",
				"added": 1609480721
			},
			{
				"comment_id": 105,
				"body": "#Táticas de guerra e guerrilha vietnamitas: determinar o dia, hora e local para a batalha\n- https://invidious.snopyta.org/watch?v=Nh_6gETdHH4\n- https://siasky.net/AADRbWgJN0M9fIsAZ1NZUWqLol_bOMF_a6WQ8ruC1bYiCQ\n\n#Como os vietnamitas destruíam blindados [M-113](https://en.wikipedia.org/wiki/M113_armored_personnel_carrier) e enganavam os jatos [Phantom II](https://en.wikipedia.org/wiki/McDonnell_Douglas_F-4_Phantom_II)?\n- https://invidious.snopyta.org/watch?v=KWx6sM3dIVI\n- https://siasky.net/AABqW2XfB0to6Ylin_i4VN1sRD0CRV5BjIWSdq85tPERfA",
				"added": 1609551656
			},
			{
				"comment_id": 106,
				"body": "#EXÉRCITO CHINÊS: como era mantida a disciplina militar na guerra civil\n- https://invidious.snopyta.org/kfee-UEQNGE\n- https://siasky.net/AACFaW8iuDOHoUGHVa2I1yZn1Ytx8suB414Ewm3VRvfwUw\n\nAs três regras e os oito princípios que norteavam o Exército Revolucionário de Trabalhadores e Camponeses Chineses foram cruciais para o seu sucesso militar contra os japoneses e os nacionalistas de [Chiang Kai-shek](https://en.wikipedia.org/wiki/Chiang_Kai-shek).\n\n#O EXÉRCITO CHINÊS na Guerra Revolucionária: segunda parte\n- https://invidious.snopyta.org/4uccBzLlcJw\n- https://siasky.net/AACHgxq7IgBCfr_bKLTxKDIr3jkgjHFNRlTKbzlZ1hC-LA\n\nO exército comunista compensou sua inferioridade material investindo no moral e na disciplina das tropas.",
				"added": 1609552513
			},
			{
				"comment_id": 107,
				"body": "#POR QUE OS ESTADOS UNIDOS PERDERAM A GUERRA DO VIETNÃ?\n- https://invidious.snopyta.org/bX-FRCdZ8f0\n- https://siasky.net/AAA3RqVX0-nWVk7Wu3nZiBZH6rXkU9aDHuKr37y6NYHHkw\n\nErros de avaliação e objetivos incoerentes arrastaram os EUA para um dos maiores traumas de sua história recente.",
				"added": 1609553175
			},
			{
				"comment_id": 108,
				"body": "#Dr. Enéas - A Verdade sobre a Bomba - A Garantia da Paz\n- https://invidious.snopyta.org/watch?v=ka-B0KIBVMU\n- http://ipfs.io/ipfs/QmPYzV8w7BXGyPn9cgw7U8ZaxeFnCjqkWYYZjunyqS3upr\n\n\"Quando se constrói a bomba atômica o que se está dizendo é: eu sou adulto, eu deixei de ser criança.\"\n[Enéas Carneiro](https://pt.wikipedia.org/wiki/En%C3%A9as_Carneiro), 23/12/98",
				"added": 1609554331
			},
			{
				"comment_id": 109,
				"body": "#Bomba atômica e armas nucleares | Nerdologia\n- https://invidious.snopyta.org/watch?v=J9SAZ314yNg\n- https://siasky.net/AAAawwTA5UgC-ZCxuKB2OgrIxEI2jIOXIR4YVekHXF0L6w\n\n#Fontes:\n- Mekik, Cetin, and Murat Arslanoglu. \"Investigation on accuracies of real time kinematic GPS for GIS applications.\" Remote Sensing 1, no. 1 (2009): 22-35.\n- Davis, Abe, Justin G. Chen, and Frédo Durand. \"Image-space modal bases for plausible manipulation of objects in video.\" ACM Transactions on Graphics (TOG) 34, no. 6 (2015): 239.",
				"added": 1609555248
			},
			{
				"comment_id": 115,
				"body": "#DISSUASÃO NUCLEAR: o que o Brasil precisa para ter a sua?\nEntenda o passo a passo para a construção de nossa Defesa Estratégica baseada em bombas atômicas. \n- https://invidious.snopyta.org/-cXOTAmWkj0\n- https://siasky.net/AAArbFYlIy9wV_sRdNoP9ly8jsGvXuTk6yW7ZaDjXF31CA\n\n#Ideia legislativa propõe bomba atômica brasileira\n- https://www12.senado.leg.br/noticias/materias/2020/12/03/ideia-legislativa-propoe-bomba-atomica-brasileira\n- https://web.archive.org/web/20201203164106/https://www12.senado.leg.br/noticias/materias/2020/12/03/ideia-legislativa-propoe-bomba-atomica-brasileira",
				"added": 1609621643
			},
			{
				"comment_id": 116,
				"body": "# MrdominioPublico001\n- https://invidious.snopyta.org/channel/UCDls1VHZhPtCYBE5xcxbnag\n\nA [SEGUNDA GUERRA MUNDIAL](https://en.wikipedia.org/wiki/World_War_II) MOSTRADA EM VÁRIOS ÂNGULOS.\nSÃO MUITAS HORAS DE FILMES E RAROS DOCUMENTÁRIOS EM LÍNGUA PORTUGUESA.",
				"added": 1609622010
			},
			{
				"comment_id": 117,
				"body": "#Um trilhão de dólares, duas décadas, 100.000 mortos e resultado ZERO\nA [guerra do Afeganistão](http://127.0.0.1:43110/0sh.bit/?OtV4) já é a mais longa da história dos Estados Unidos. E a mais inútil.\n- https://invidious.snopyta.org/KG2lcDNPKBc\n- https://siasky.net/AADimIsqivlXeeBEEgrhSHyZ-UcUBgkyOD3OwoDSzXBmgA",
				"added": 1609626108
			},
			{
				"comment_id": 122,
				"body": "#O aeroporta-aviões da SHIELD | Nerdologia\n- https://invidious.snopyta.org/watch?v=GVCKPbTXtDM\n- https://siasky.net/AAD7nQ6wftCHYNrm4yD_TCPELoUX41QmpUST-DzUgxWCiA",
				"added": 1609780962
			},
			{
				"comment_id": 164,
				"body": "#Satélites militares: Compendium\n- https://ipfs.infura.io/ipfs/QmPMoKQePv2pjkrpUnN5Xi241rETTXhcrhmb9YzPZ9z2eg\n\nO reconhecimento por satélites afetou profundamente a [Guerra Fria](https://en.wikipedia.org/wiki/Cold_War), mas era uma atividade realizada sob tanto sigilo que suas contribuições para a estabilidade internacional durante esse período não foram amplamente divulgadas. A compilação [Satélites militares: Compendium](https://velhogeneral.com.br/2021/01/18/satelites-militares-compendium/), de autoria de Junior Miranda, procura fornecer um painel geral sobre os projetos espaciais militares de alguns países nas últimas décadas.",
				"added": 1610975047
			},
			{
				"comment_id": 165,
				"body": "#Serve para todos: a mente estratégica de um Comandante\n- https://web.archive.org/web/20210103113704/https://velhogeneral.com.br/2021/01/03/serve-para-todos-a-mente-estrategica-de-um-comandante/\n- https://ipfs.infura.io/ipfs/QmPHMT3FLjU6Q5kXSU6u6dgamXZRw4zRzPtKY8eyPjbgjg\n\nAs decisões importantes que levam à vitória muitas vezes passam por iniciativas que evitam possíveis erros, aquelas que poderiam causar uma derrota antes mesmo de iniciar o combate. Frequentemente são coisas simples e óbvias, mas nem sempre as enxergamos. Este é um dos fatores que diferenciam aqueles que aprendem a pensar estrategicamente.",
				"added": 1610975483
			},
			{
				"comment_id": 166,
				"body": "#Bases Americanas no Oriente Médio\nEste material traz uma visão geral aproximada das bases e instalações militares dos EUA no Oriente Médio. Compilada pelo American Security Project a partir de informações publicamente disponíveis, esta lista traz uma variedade de instalações às quais os EUA tem acesso na região. \n- https://velhogeneral2018.files.wordpress.com/2019/06/ref-0213-us-military-bases-and-facilities-middle-east.pdf\n- https://ipfs.infura.io/ipfs/QmbpYfiCLzDWCuuSXbA5G44S9q4w3cYZeBz8RJy52TcYaQ",
				"added": 1610975608
			},
			{
				"comment_id": 167,
				"body": "#Boa informação ganha batalhas e alavanca negócios\n- https://web.archive.org/web/20201013004126/https://velhogeneral.com.br/2020/10/12/boa-informacao-ganha-batalhas-e-alavanca-negocios/\n- https://ipfs.infura.io/ipfs/Qma8VgYbhsb19AfBD9bK5kqkuGsZUQRz7DQjTknP3mMUjG\n\nA informação de qualidade é essencial para a tomada de decisões seja na política, na guerra ou no mundo dos negócios. Para ser considerada de qualidade, a informação deve ser verificada, cruzada e validada. Sua fonte deve ser confiável. Seu preço poderá ser caro – mas quanto custa a recuperação de um desastre causado por uma decisão tomada com base em informações incorretas, falsas ou equivocadas?",
				"added": 1610977557
			},
			{
				"comment_id": 197,
				"body": "#Segredos brasileiros são bisbilhotados há décadas por outros países\n- https://web.archive.org/web/20201127194455/https://www1.folha.uol.com.br/mundo/2013/08/1321139-brasil-e-espionado-ha-decadas-por-diversos-paises.shtml\n- https://web.archive.org/web/20201104224551mp_/https://www.fab.mil.br/notimp/mostra/03-08-2013#n62699\n- https://siasky.net/_Ay9H67c6d3GP7bVEPMlhH4SuBUBc1ygu9DChvPmOeeE1A\n- http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1KMu2u9wo1DCsc27Qt28qwLxVAjcvHZhtj_4",
				"added": 1611440077
			}
		],
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": [
			{
				"comment_id": 79,
				"body": "#O Incrível Hulk (Série 1977) DUBLADO\n- https://invidious.snopyta.org/playlist?list=PLFUhhEnLdkg0psfXbxZ4_UE79LLpCgjVW\n\nO Dr. David Banner (Bill Bixby) é um brilhante cientista. Certo dia, um experimento em que ele está trabalhando sai terrivelmente errado, e o deixa com sérias consequências: sempre que ele está sob muito estresse, seu corpo se modifica e ele se transforma n'O Incrível Hulk (Lou Ferrigno), um monstro alto, musculoso e de pele verde. Ele se transforma no monstro sempre que alguém ou alguma coisa ameaça o Dr. Banner e a população.",
				"added": 1609199405
			},
			{
				"comment_id": 80,
				"body": "#Manimal (1983)\nManimal conta a história de um transmorfo que pode se transformar em qualquer animal. O Dr. Jonathan Chase (Simon MacCorkindale) é um jovem, belo e saudável profissional, com um futuro promissor e um passado negro. Dos recantos mais obscuros da África aos maiores picos do Tibet, Jonathan Chase é o mestre dos segredos que dividem o homem do animal.\n#Temporada 1:\n- https://view.axel.org/item/04121317baa1ddc0c\n- https://mega.nz/folder/yc5H1A6L#-pj9CcJ1u07QBMiDLgAqOA/folder/GBgR1RAK",
				"added": 1609203489
			}
		],
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": [
			{
				"comment_id": 113,
				"body": "#Quantos anos seu cachorro teria se fosse humano? Cientistas estudam química do genoma para criar fórmula\nQuase todo mundo que tem cachorro já parou para pensar em que idade ele teria se fosse humano. Uma das regras mais usadas é multiplicar a idade do animal por 7. Uma nova pesquisa, porém, demonstrou que essa aproximação não corresponde à realidade e desenvolveu uma fórmula bem mais apurada. Usando uma análise química do material genético de cães e humanos, o estudo descobriu que os animais envelhecem muito rápido no começo da vida.\n- https://web.archive.org/web/20201021233830/https://gizmodo.uol.com.br/quantos-anos-cachorro-humano-genoma/\n- Artigo: [Quantitative Translation of Dog-to-Human Aging by Conserved Remodeling of the DNA Methylome](https://ipfs.infura.io/ipfs/QmWSjP12gMC4z7wxjNNnTxWu1UCUZnJp2reWZ9beLDQEoG)",
				"added": 1609617607
			},
			{
				"comment_id": 132,
				"body": "#Quando a vacina nos livrará da máscara e do distanciamento social?\n- https://invidious.snopyta.org/1HB9s2fhHDo\n- https://siasky.net/AAA1mPqHcV5u8Pjaq6q7JsFYKfkuiXYDO7JgZ_MUR-fm-Q\n\nA jornalista Leticia Mori conversou com especialistas para entender quando, de fato, poderemos parar de usar a máscara e de fazer distanciamento social sem colocar vidas em risco.\nNeste vídeo, ela explica os motivos para continuarmos adotando medidas de proteção contra a covid-19, mesmo depois de sermos vacinados.\nAinda no vídeo, a microbiologista Natália Pasternak detalha o conceito de imunidade de rebanho e as razões para a vacinação em duas doses.\nLeia mais na reportagem: https://web.archive.org/web/20210108021332/https://www.bbc.com/portuguese/brasil-55253284",
				"added": 1610115789
			},
			{
				"comment_id": 133,
				"body": "#Bactérias mais resistentes: o perigoso efeito colateral da pandemia de coronavírus\n- https://invidious.snopyta.org/KpiAQIrJuOE\n- https://siasky.net/AAD3xE7wvQF6JLBxIZ7foc475xGKnQBC-XRXUgavjojdyw\n\nEm uma pandemia causada por um vírus, os antibióticos — medicamentos que têm como alvo bactérias e fungos — foram amplamente usados no tratamento da covid-19, em alguns casos sem necessidade.\nCom isso, pesquisadores e instituições como a Organização Mundial da Saúde (OMS) acreditam que o problema da resistência microbiana, em que germes se mostram cada vez mais fortes e hábeis em driblar os antibióticos, ficará ainda pior.\nJá antes da pandemia, a OMS estimava que a resistência microbiana poderia estar ligada a 10 milhões de mortes anuais até 2050.\nNeste vídeo, a repórter da BBC News Brasil Mariana Alvim explica por que remédios normalmente usados contra bactérias e fungos foram usados na luta contra um vírus e quais serão as possíveis consequências disto no tratamento de doenças no futuro.\nLeia a reportagem completa em: https://web.archive.org/web/20210107040257/https://www.bbc.com/portuguese/geral-54532598",
				"added": 1610116354
			},
			{
				"comment_id": 146,
				"body": "#Drogas psicodélicas são aposta da ciência contra doenças | Fantástico (03/01/2021)\n- https://invidious.snopyta.org/a-KY5eI4tQg\n- https://ipfs.infura.io/ipfs/QmcKVzMZ9NxqmC13EcPGE69JWgFyuZNcFkuMNjgXAPJjbW\n\nReportagem especial do [Fantástico](http://g1.globo.com/fantastico/) investiga o futuro que pode estar na associação da consagrada terapia com drogas que já foram proibidas em pesquisas, um movimento chamado de ‘Renascença Psicodélica’.",
				"added": 1610307388
			},
			{
				"comment_id": 157,
				"body": "#Eva mitocondrial\n- https://en.wikipedia.org/wiki/Mitochondrial_Eve\n\nNa genética humana, a [Eva mitocondrial](https://everipedia.org/wiki/lang_en/Mitochondrial_Eve) (também mt-Eve, mt-MRCA) é o ancestral comum [matrilinear](https://en.wikipedia.org/wiki/Matrilineality) mais recente (MRCA) de todos os humanos vivos. Em outras palavras, ela é definida como a mulher mais recente de quem todos os humanos vivos descendem em uma linha ininterrupta puramente por meio de suas mães e das mães dessas mães, até que todas as linhas convergem para uma mulher.\n\n#Adão cromossomial-Y\n- https://en.wikipedia.org/wiki/Y-chromosomal_Adam\n- https://everipedia.org/wiki/lang_en/Y-chromosomal_Adam\n\nNa genética humana, o ancestral comum mais recente do cromossomo Y é o [ancestral comum mais recente](https://en.wikipedia.org/wiki/Most_recent_common_ancestor) de quem todos os homens vivos atualmente descendem [patrilinearmente](https://en.wikipedia.org/wiki/Patrilineality). O termo Y-MRCA reflete o fato de que os cromossomos Y de todos os homens que vivem atualmente são derivados diretamente do cromossomo Y desse ancestral remoto.",
				"added": 1610578894
			},
			{
				"comment_id": 160,
				"body": "#O que significa a eficácia de 50,4% da vacina do Butantan?\n- https://invidious.snopyta.org/lU6LCAuUUpo\n- https://siasky.net/AAAYiOeWbSZ42AP6o8gEAgJt3iBhdQB6Otr5J_FNxyRnfQ\n\nApós semanas de especulação, enfim saíram os números preliminares da [CoronaVac](https://en.wikipedia.org/wiki/CoronaVac), vacina contra a [covid-19](https://en.wikipedia.org/wiki/Coronavirus_disease_2019) desenvolvida numa parceria entre a farmacêutica chinesa [Sinovac](http://www.sinovac.com/) e o [Instituto Butantan](https://butantan.gov.br/), em São Paulo.\nA taxa de eficácia é de 50,4%, o que decepcionou muitos, mas superou por pouco o limite de 50% estabelecido pela Organização Mundial da Saúde.\nAntes disso, outros números, como 78% de proteção em alguns casos e até supostos 100% em outros tinham sido divulgados, o que confundiu muita gente.\nNeste vídeo, o repórter André Biernath, da BBC News Brasil, explica o que todos esses números significam e os pontos fortes e fracos da CoronaVac na luta contra a pandemia de coronavírus.\nLeia também a reportagem: https://web.archive.org/web/20210115020014/https://www.bbc.com/portuguese/geral-55639265",
				"added": 1610677625
			},
			{
				"comment_id": 161,
				"body": "#Criado primeiro modelo computacional completo do vírus da covid-19\nPesquisadores da [Universidade de Chicago](https://en.wikipedia.org/wiki/University_of_Chicago) (EUA) criaram o primeiro modelo computacional completo do vírus [SARS-CoV-2](https://en.wikipedia.org/wiki/Severe_acute_respiratory_syndrome_coronavirus_2), responsável pela [covid-19](https://en.wikipedia.org/wiki/Coronavirus_disease_2019).\nEles esperam que este modelo esteja amplamente disponível para ajudar no avanço das pesquisas em todo o mundo.\n\"Se você puder entender como um vírus funciona, este é o primeiro passo para detê-lo. Cada coisa que você sabe sobre o ciclo de vida e a composição do vírus é um ponto de vulnerabilidade onde você pode atingi-lo,\" disse o professor Gregory Voth, coordenador do trabalho.\nVoth e sua equipe reuniram as características mais importantes de cada componente individual do vírus e selecionaram as informações \"menos importantes\", que pudessem ser deixadas de lado, de modo a fazer um modelo computacional que seja abrangente, mas ainda viável para ser executado no computador.\n- https://web.archive.org/web/20210108184431/https://www.diariodasaude.com.br/news.php?article=criado-primeiro-modelo-computacional-completo-virus-covid-19&id=14507\n- Artigo: [A Multiscale Coarse-Grained Model of the SARS-CoV-2 Virion](https://ipfs.infura.io/ipfs/QmcERke7Mfx9srwW7aWVYd1f4LsEam1XJwWXX4nxbbJT2W)",
				"added": 1610804784
			},
			{
				"comment_id": 185,
				"body": "#As doze mentes mais brilhantes da história da biologia\n- https://web.archive.org/web/20210121170703/https://universoracionalista.org/as-doze-mentes-mais-brilhantes-da-historia-da-biologia/\n\n#As doze mentes mais brilhantes da história da genética\n- https://web.archive.org/web/20201127164938/http://universoracionalista.org/as-doze-mentes-mais-brilhantes-da-historia-da-genetica\n\n#As doze mentes mais brilhantes da história da medicina\n- https://web.archive.org/web/20201127170559/https://universoracionalista.org/as-doze-mentes-mais-brilhantes-da-historia-da-medicina/",
				"added": 1611248778
			},
			{
				"comment_id": 194,
				"body": "#Simulações matemáticas mostram por que idosos devem ser os primeiros a receber vacina\nA partir de simulações matemáticas, pesquisadores descobriram que vacinar pessoas acima de 60 anos é a melhor estratégia para diminuir mortes\n- https://web.archive.org/web/20210122155828/https://gizmodo.uol.com.br/simulacao-matematica-vacina-idosos-covid-19/\n- Artigo: [Model-informed COVID-19 vaccine prioritization strategies by age and serostatus](https://ipfs.infura.io/ipfs/Qmavxs8sGSdD7BWrppJ2c73qGLCai7fWQNvkQHJVJgRX3D)",
				"added": 1611331801
			},
			{
				"comment_id": 231,
				"body": "#Médicos soviéticos curavam infecções com vírus e a técnica pode voltar\nNa União Soviética, os antibióticos ocidentais não podiam passar pela chamada Cortina de Ferro — nome que designava a separação da Europa em Oriental e Ocidental durante a Guerra Fria. Com isso, os médicos da parte Oriental descobriram como usar vírus para matar as bactérias infecciosas e essa antiga técnica pode retornar aos tratamentos em breve.\nA técnica, na verdade, remonta a milhares de anos, e foi descoberta de uma forma muito rudimentar: as pessoas observaram que a água de certos rios poderia curar doenças infecciosas, como a lepra e a cólera. No início do século 20, os cientistas descobriram que, na verdade, estas águas continham tipos muito específicos de vírus, que matavam as bactérias que causavam certa infecção.\n- https://web.archive.org/web/20160331062946/https://www.megacurioso.com.br/virus-bacterias-e-protozoarios/44547-medicos-sovieticos-curavam-infeccoes-com-virus-e-a-tecnica-pode-voltar.htm",
				"added": 1612095149
			},
			{
				"comment_id": 232,
				"body": "#A Crise das Superbactérias Explicada\nBactérias estão pouco a pouco se tornando resistentes a todos os nossos antibióticos, e isso é um problema imenso. Mas por que exatamente isso acontece e o que podemos fazer para impedir que isso ocorra?\n- https://invidious.snopyta.org/0YaC6yGJbmY\n- https://ipfs.io/ipfs/QmdS9oCNduByyRQWnz3Xo1cKPXKCfM6ZakPis9dWDPviEf\n\n#Resposta de um médico ao Ciência Todo Dia - [A Crise das Superbactérias Explicada](https://invidious.snopyta.org/0YaC6yGJbmY)\n- https://invidious.snopyta.org/XaYHBrht4QE\n- https://siasky.net/AACmKitB3PFdboQqiCvqAHcEDYlOynA_0QyxxtX7pqJgow",
				"added": 1612095841
			},
			{
				"comment_id": 233,
				"body": "#Como matar uma superbactéria usando vírus?\n- https://invidious.snopyta.org/x3lw9CftDi4\n- https://ipfs.io/ipfs/QmS4xFiHEHxFo6BEBwMQPZPbL7gM1MdYUmEKR5T9sqx8Xn",
				"added": 1612096177
			}
		],
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": [
			{
				"comment_id": 237,
				"body": "#O formal e o transcendental na matemática - [Gilles-Gaston Granger](https://en.wikipedia.org/wiki/Gilles-Gaston_Granger)\nO problema filosófico clássico que nos propomos abordar aqui permanece um dos mais gerais e do mais significativos que se pode colocar ainda hoje o matemático interessado na extraordinária perenidade de sua ciência e no prodigioso sucesso de suas aplicações ao universo dos fenômenos. Questão que concerne seguramente muito especialmente às geometrias, em razão de sua relação aparentemente privilegiada com o sensível, mas bem como à matemática em geral. Qual é a natureza e o alcance da objetividade da matemática? Objetividade se entende naturalmente aqui num sentido inteiramente radical de validade enquanto conhecimento - ou talvez criação - de objetos. E nessa perspectiva que empregamos aqui a oposição de origem kantiana de dois termos: \"lógico\" e \"transcendental\". Começaremos então por justificar o sentido dado a essa palavra transcendental. Depois, proporemos uma ideia do estatuto do lógico e de sua função na matemática, e terminaremos examinando, a partir dos pontos de vista anteriormente esboçados, uma concepção dos objetos matemáticos e de sua relação com os outros tipos de \"objetalidade\".\n- https://web.archive.org/web/20200220113033/https://www.scielo.br/pdf/ea/v4n10/v4n10a07.pdf\n- https://ipfs.infura.io/ipfs/QmSm2dJ8hYChrzgpjfQbXrmJTJZCntBqLYwVUYdA6vejaK",
				"added": 1612140666
			},
			{
				"comment_id": 238,
				"body": "#As Formas da Razão\n- https://invidious.snopyta.org/playlist?list=PLMwn2J5eCtP4yL4_mAXupDL_TVKI8yvJd\n\nColóquio \"As formas da Razão\", 10-11 de Maio 2018, na UnB, em homenagem aos epistemólogos franceses [Gilles-Gaston Granger](https://en.wikipedia.org/wiki/Gilles-Gaston_Granger) e [Jules Vuillemin](https://en.wikipedia.org/wiki/Jules_Vuillemin).",
				"added": 1612141192
			},
			{
				"comment_id": 239,
				"body": "#Filosofia Aberta - \"Filosofar sobre a Filosofia\" - com o prof. Evandro Luís Gomes\n- https://invidious.snopyta.org/UjEsVWehr9c\n- https://siasky.net/CAAy5fN9Zsx4FXNLZf4DKe_5FcbrdaBqL57Ywb7CXaHLYQ\n\nQue qualidades são indissociáveis e típicas do filosofar? Como a filosofia se distingue da ciência? Como estas se opõem à ideologia? A fim de responder a essas questões, revisitamos as proposições defendidas por Gilles-Gaston Granger (1920-2016) no livro \"Por um conhecimento filosófico\" (Campinas: Papirus, 1989). Granger, filósofo francês que contribuiu para o estabelecimento dos estudos filosóficos na Universidade de São Paulo nos anos 1950, exerceu desde então influência sobre o desenvolvimento da filosofia no Brasil. Seus inúmeros trabalhos e livros constituem um empolgante roteiro na busca pelo conhecimento, seja filosófico, seja científico.",
				"added": 1612143042
			}
		]
	},
	"comment_vote": {
		"20_1KMu2u9wo1DCsc27Qt28qwLxVAjcvHZhtj": 1,
		"29_1KMu2u9wo1DCsc27Qt28qwLxVAjcvHZhtj": 1,
		"91_1KMu2u9wo1DCsc27Qt28qwLxVAjcvHZhtj": 1
	}
}