{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"38_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [],
		"1_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": [
			{
				"comment_id": 2,
				"body": "O Partido Pirata não se parece em nada com a instituição “Partido” ao qual estamos acostumados: hierárquicos e verticalizados. Atuamos de forma distribuída e não-hierárquica. Essa forma de agir, compartilhando e construindo conjuntamente as propostas, se associa diretamente a nossa própria identidade e ao modelo de sociedade que queremos construir. Àqueles que buscam modos abertos e transparentes de se fazer política, fica o convite para o ingresso no Partido Pirata.\n\nO PIRATAS entende que políticas públicas devem ser construídas de forma efetivamente participativa e colaborativa. Que o pleno exercício da democracia depende da mais completa transparência pública e do aprimoramento de ferramentas de consulta direta que garantam o efetivo empoderamento dos cidadãos. Que a defesa dos direitos humanos perpassa a luta pela diversidade social, a garantia de liberdade de crença e descrença, a proteção dos direitos civis, o respeito à privacidade dos indivíduos e à liberdade de expressão.\n\nAcreditamos que pode existir um ponto de equilíbrio entre o produtor e o consumidor de cultura; modelos de produção cultural que evitem os atravessadores – como a indústria fonográfica tradicional – e a incidência de imensa carga tributária sobre material cultural, que encarecem preços e dificultam o acesso a cultura.\n\nEntendemos que serviços públicos essenciais devem ser universais e de qualidade, que todo cidadão precisa de livre acesso a conhecimento, educação e cultura. Que o acesso à rede mundial de computadores é um direito fundamental, inclusão digital uma necessidade, o compartilhamento de conhecimento uma obrigação e uso de padrões abertos e software livre uma solução.\n\nhttps://partidopirata.org",
				"added": 1486177339
			},
			{
				"comment_id": 3,
				"body": "> [lunovox](#comment_1_19eLvN36Q8eyQuMBwbER3BZEDUsFAgjSRB): Na verdade quem é corrupto não é socialista. Pois, os verdadeiros socialistas pensão no bem estar da sociedade. O que ocorrer é que existem corruptos que se aproveitão da boa fama que os filósofos socialista tentam construir para enganar o povo e conseguir dinheiro fácil. Por isso, que os mais leigos acabam achando que o Socialismo (ou a Democracia) é de Gente Corrupta.\n> \n> O Partido Pirata é uma associação politica internacional, que também existe no braZil.Para saber mais: https://partidopirata.org/\n\n> [lunovox](#comment_1_19eLvN36Q8eyQuMBwbER3BZEDUsFAgjSRB): Na verdade quem é corrupto não é socialista. Pois, os verdadeiros socialistas pensão no bem estar da sociedade. O que ocorrer é que existem corruptos que se aproveitão da boa fama que os filósofos socialista tentam construir para enganar o povo e conseguir dinheiro fácil. Por isso, que os mais leigos acabam achando que o Socialismo (ou a Democracia) é de Gente Corrupta.\n> \n> O Partido Pirata é uma associação politica internacional, que também existe no braZil.Para saber mais: https://partidopirata.org/\n\nVocê é membro do partido pirata brasileiro?",
				"added": 1486658711
			}
		]
	},
	"comment_vote": {
		"1_1KWWaNw3CB6CRxTpzFj97iCuByn1J4W9ha": 1
	}
}