{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1527108234_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "I started with p2p filesharing back in 2001 with the fantastic [Audiogalaxy](https://en.wikipedia.org/wiki/Audiogalaxy), then moved on to\n* [FastTrack](https://en.wikipedia.org/wiki/FastTrack) p2p clients (MusicCity Morpheus, [KaZaA](https://en.wikipedia.org/wiki/Kazaa), Grokster)\n* ed2k/Kad clients (eDonkey2000, [eMule](https://en.wikipedia.org/wiki/EMule) and its many mods, Overnet, MLDonkey)\n* [Gnutella](https://en.wikipedia.org/wiki/Gnutella) clients (like LimeWire, Bearshare and [Phex](https://en.wikipedia.org/wiki/Phex) which apparently still lives on i2p)\n* then mainly BitTorrent.\n\nOver the course of the 00s, I also experimented with others like [WinMX](https://en.wikipedia.org/wiki/WinMX), Soulseek, [Manolito](https://en.wikipedia.org/wiki/Pablo_Soto_(software_developer)) clients like Blubster and Piolet, [Shareaza](https://en.wikipedia.org/wiki/Shareaza), iMesh, Direct Connect, Ares Galaxy, Frost (on Freenet), [BeShare](https://github.com/HaikuArchives/BeShare), [MUTE](https://en.wikipedia.org/wiki/MUTE), [Ants P2P](https://sourceforge.net/projects/antsp2p/) and many more. So much innovation and competition in p2p in the 00s!\n\nI also dabbled with getting stuff from non-P2P sources, like IRC / XDCC bots (but not music I think, usually ebooks and .torrent files for videos) and browsing FTP folders. There may have been other ways too that I've forgotten (I'm pretty sure I never used Usenet to get music.) I think I occasionally got music by browsing music blogs that had direct download links from services like MediaFire, which is still a thing for some people, I believe.\n\nI've still got an external hard drive with gigabytes of music I downloaded in the late 00s from eMule, BitTorrent and Soulseek. But I noticed that quite a few of the files I got on Soulseek were damaged / sabotaged (I think some Soulseek sharers were 'vigilantes' who wanted to punish people downloading their favourite artists' music for free). On the plus side of Soulseek (and a few others like Shareaza) is the option to see what other files a source is sharing: it can be an interesting way to discover new music.\n\nBut for the last 8-9 years I've barely downloaded music: I just use streaming. Previously Jango, 8Tracks, Shoutcast and Grooveshark (and before that Pandora and Last.fm when they were still available in my location), but for the last couple of years, Spotify. (I'm having a problem accessing my Spotify account the last few days so I've been retrying those and also ZeroLSTN and ZeroMusic, which are unsatisfactory/useless so far). I like the discovery of music I haven't heard before that is often provided by streaming/\"radio\"-style services.\n\nA few years back I was trying to get a copy of a rare bilingual English/Spanish music film featuring salsa music. I couldn't find it on anywhere until I tried [Ares Galaxy](https://en.wikipedia.org/wiki/Ares_Galaxy), which is still going and is used a lot by Spanish speakers. Every now and then I'll try a non-BitTorrent form of file acquisition again, be amazed it still exists (FastTrack & Manolito are dead but ed2k, Gnutella, IRC etc live on) but then be disappointed by some aspect of it (lack of content/sources, need for port forwarding etc) and come back to torrents and streaming.",
				"added": 1547593942
			}
		]
	},
	"comment_vote": {}
}