{
  "next_topic_id": 1000,
  "topic": [],
  "topic_vote": {
    "1526322975_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
    "1526512288_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
    "1523848521_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF": 1,
    "1526664429_1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQ": 1,
    "1526683349_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
    "1_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C": 1,
    "1522654235_15ck5G6e7dPAutz2cfqsKSkXCDMrkuJKw8": 1,
    "1513235917_17Rdzwwv6BpXjyZeCQNRFUbMQ3uTPNhZHX": 1,
    "1523096150_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
    "1522601837_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
    "2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
    "1523176273_1467X2hmPQP5gAKnh9uhQX6M1DWCHqLbCG": 1,
    "1523439578_1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQ": 1,
    "1523469811_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
    "1523679343_1NxjTRDz1jS8d8NxSuK2RDUKGsuPhs6Evb": 1,
    "1523689892_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
    "1523697103_1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr": 1,
    "1523817966_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
    "1524266225_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": 1,
    "1524712925_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h": 1,
    "1524765490_1D2E7WbvtaBxyunA2P3M1rFzsWBaZhDUCW": 1,
    "1524935803_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo": 1,
    "1521392984_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": 1,
    "1525597646_1CT7RxDQNPEE8X78bDkUPhuaaUUixTmDhC": 1,
    "7_15ATNsS6aHGvBg5xoMP94sXpNaLX4fSHjN": 1,
    "1522279439_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": 1,
    "1525916915_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
    "1526764711_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
    "1526885161_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
    "1526895582_12uaobyUhg6H9rh88Ryu1x8xrJWBn6PuyK": 1,
    "1527003512_13mmQytg34syftQYB5eFFMA9ATsGGmjk46": 1,
    "1527119679_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h": 1
  },
  "next_comment_id": 1000,
  "comment": {
		"1526211589_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 50,
				"body": "how do you even manage to post sooo many",
				"added": 1526221726
			},
			{
				"comment_id": 51,
				"body": "> [kai0](#comment_596_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): å†…å®¹ä¸å¤Ÿå¤šï¼Œæ— æ³•å¸å¼•äººã€‚\n\n(translation of quoted text åŽæ–‡->è‹±æ–‡ç¿»è¯‘: not enough content, cant attract more people)\næˆ‘æƒ³ä½ åº”è¯¥ç”¨ç¬¬äºŒä¸ªZeroID, æ ¹æœ¬ä¸çŸ¥é“è¿™ä¸ªSite Adminè¿˜åœ¨æ²¡æœ‰åœ¨è¿™é‡Œ\nI think you should use a second zeroid, i dont even know if the site admin is still here",
				"added": 1526227184
			}
		],
    "1526319410_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
      {
        "comment_id": 62,
        "body": "I retort, the bug itself cant lie in PGP, PGP just unencrypt things you passed through it and return it, that's all it is or should ever be responsible for in this context\nI suspect the fault lies in the mail client\nso a better advice is to DISABLE PGP mail and use PGP command line, there's no way you can go wrong with that",
        "added": 1526320023
      }
    ],
    "1526455814_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": [
      {
        "comment_id": 68,
        "body": "> [quantumkitty](#comment_30_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): But now that we have soooo many video zites, we should probably focus on something other than videos\n\nso much video sites, none have the feature needed to facilitate youtube like features(youtubers feeds, subscriptions box, subscriptions, playlist etc)\n\npersonally i feel like we should have a real reddit clone(that feels homely for reddit users), think of how much subs on reddit get banned and what if we can provide a censor free place for them?\ni think something like a zerome inspired structure, a sub is just another user controlled site rather then developer controlled site so there's absolutely no easy way for me to interfere, and also allows people to create front ends of their own if they wish to do so\nYes, we can just clone zerotalk indefinitely wich dont get me wrong, it works but not ideal\n\nand i also lack motivation, while i do have reasonable skills but i dont really know if i am capable of achieving any of these, still i do feel like i want to contribute something... at least something...",
        "added": 1526461977
      },
      {
        "comment_id": 70,
        "body": "> [krixano](#comment_414_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): I think there's ZeroVoat, but not sure if that's still being worked on. [...]\n\nzerovoat is a voat clone, not reddit clone i guess it works if you are outta options(until someone make a real reddit clone) /shrug/\ndocumentations on what doe? maybe i can give that a shot",
        "added": 1526462249
      },
      {
        "comment_id": 73,
        "body": "i think our game plan is just to advertise more on clearweb, ultimately we need exposure\n\n> [quantumkitty](#comment_31_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Reddit is currently suffering from a cycle of downward spiraling negativity...[...]\n\nre reddit [The Reddit Filter](https://www.youtube.com/watch?v=-mnSNvadQo0) (clearnet), it's like an fliter, like the bubble, it keeps out things the community dont want, and using self motivation of keeping a \"positive\" karma everyone will begin to self censor according to the community's consensus, and yes downvotes arent necessarily good sometimes\nBut i still think we should give them a home /shrug/\n\n> [cane27](#comment_1_1MvfJt4w7iUCEsraP8C8gqNHp5ZQiAKhaN): create something. fe http://217.70.197.95:43110/13VDeMgRgGf73mHsMrrorXkq4fhUKfBvPz/\n\nlooks like an interesting website but with no way to understood of it's contents",
        "added": 1526465912
      },
      {
        "comment_id": 75,
        "body": "we should also support mobile, android and iOS\nWITHOUT a proxy is ideal since that will be more easier to bring around\nas much as how developed the desktop client there should be one for mobile\n(reminded by this thread on [zerome](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K/1526464220)(content in chinese))",
        "added": 1526489991
      },
      {
        "comment_id": 77,
        "body": "> [quantumkitty](#comment_55_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): I'm pretty sure the one thing putting people off from ZeroNet is .. the ZeroID system.Â Then again, my own personal view is that, if you aren't willing to learn, you probably don't belong here.\n\nsoon, we will have self signed IDs for all that matters so?",
        "added": 1526671950
      }
    ],
    "1527003512_13mmQytg34syftQYB5eFFMA9ATsGGmjk46": [
      {
        "comment_id": 87,
        "body": ">So how does one now call up the uncensored version of this site on this censorship-resistant network, or even fork the whole site?\napparently the owner censored it themself(according to the website which we cant confirm), we cant really stop owners from censoring their own sites\njust like how giving me the rights to edit this post, also gives me the right to edit, or delete this post thus censoring it\nif anyone gain access to the owner's PC/site private key, they can also do that, which again is out of our control if you slipped up",
        "added": 1527005598
      },
      {
        "comment_id": 88,
        "body": "> [vychlop](#comment_1_13mmQytg34syftQYB5eFFMA9ATsGGmjk46): I get that the owner has control over what appears under a certain identifier. [...]\n\nyou cant, that's only possible if someone archived or saved an older version as of now\ntho i dont really get why the owner in this case want to remove said sites, since there no way of things begin taken down, unless you leaked something confidential by accident i dont think there should be an issue\ninfact, if your site will be more secure/reliable by having more peers",
        "added": 1527016295
      },
      {
        "comment_id": 89,
        "body": "> [vychlop](#comment_2_13mmQytg34syftQYB5eFFMA9ATsGGmjk46): Wow. That's sounds like a giant oversight. Enables the most obvious methods people always have censored content with and it also makes it opaque that censorship is happening when it is happening. [...]\n\nyou can \"fork\" by saving the current site as a zip, afaik in the bleeding edge built rn\n\nwhile i agree but again not a lot of people like it that their site will have snapshots of it\nand there's also a thing about you can only snapshot something you know of(we cant expect owner to allow the snapshot in worst circumstances)\nalso even daily snapshots could means wasting shit ton of data just for one possible chance of an act of censoring\n\ntho maybe something about githistory, where peers will keep something like a gitlog of each changes, to prevent repeat saving unnecessary data, and easy reverts shall anything happen, but this relies on peers to be bothered to save the history\n\nto start we can make a plugin that will enable snapshot for sites, like logging change every 7days to 1hr to every change detected(depending on risk factor and disk space to spare), when a peer needs it, peer can revert to last know good state\nit cant be tampered since signatures are saved and verified\n\nfor second step, we can develop a protocol to share/seed snapshots just like how we are already seeding sites\nsay i do 1 snapshot every day, if i need a finer timings, i can ask for it between all knows peers, and slowly downloading the git history piece from them, once completed i can revert to it\n\nthen we can also have customizable schedules, say all normal sites = snapshot once every 4-7 days(varied random to allow each peers by chance to have a different dated copy)by default but still allowing specific highrisk pages to be monitored for all detected changes etc\n\nbut again this all assume people care enough to spend more disk space to store history, but i agree this is an interesting case and we definitely have more work to do(random note you cant archive tor because source code is behind a server, you can archive everything with zeronet because all code and data client sided)",
        "added": 1527018808
      },
      {
        "comment_id": 90,
        "body": "what great of this community is we can discover flaws and discuss fixes together\n\n> [vychlop](#comment_3_13mmQytg34syftQYB5eFFMA9ATsGGmjk46): I honestly thought that would happen automatically. People who just visit store up to the site storage limit, and people who mirror store the whole thing. I didn't think you can affect the mirrored copies.\n> [vychlop](#comment_3_13mmQytg34syftQYB5eFFMA9ATsGGmjk46): Yea, and I personally think that should be a feature.\ntbh this network is kinda new so it can help with improvements and challenges to be thrown at it\nthe backups wont be affected in theory as it's set to not copy the latest changes\n\n> [vychlop](#comment_3_13mmQytg34syftQYB5eFFMA9ATsGGmjk46): Oh, I wasn't even aware I was talking to a dev before\nnot really a python dev but i like to speak as if what i can, to theorize possible fixes\n\nalso maybe someone can suggest a better ideas for ways to prevent censorship/sizing by owner\n\nif it's implemented even if a site is somehow sized like it always happen in tor, anyone can fetch the latest know good copy and spin up a new site, since the backup have all the new site needs, previous data, source code, and all the things",
        "added": 1527021142
      },
      {
        "comment_id": 91,
        "body": "> [krixano](#comment_449_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): We can clone and fork zites. It's just not automatic. You have to do it manually. And some zite owners allow the clone button, which you can find by clicking the 3 dots next to the zite name in ZeroHello.\n\nno, that cloning does not store userdata, the idea of the backup is to stand against censorship by owner,\nsay for example, owner starts to mass delete things on example zerotalk, we can REVERT to last known GOOD STATE in history of zerotalk, and FORK it by cloning EVERYTHING, including userdata to another site which we CONTROL, to restore user freedom\nwhat's empowering in this example is, anyone can do it, if a group of community dont like that, they can fork off into their own community\nand yes i agree optional files might be a problem\n\n> [blazar](#comment_24_1P1baCe1LLjror4CZjChWFy7D7cVWyPL83): If you want to access an older version of a zite you have to make a lot of backups. When someone dont do some work for you it is not censorship.\n\nThere's a difference, here we keep a LOG CHANGES, for example data deleted, data added, data edited, site html edited etc,\nsince now we have a log of changes, we can easily REVERT to when the log of changes is made,\nusing cronjob kinda works but like you said it create tons of unnecessary data, we dont need to know if a file was there untouched for years, we only care when it's touched\nand i agree, user shouldnt be FORCED to make backup/log of history, for whatever or no reason, say lack of disk space, just like how uploading/seeding is done by merit not by force or economical incentive\n\n> [blazar](#comment_25_1P1baCe1LLjror4CZjChWFy7D7cVWyPL83): The greatest idea keeping ZeroNet alive is transferring censorship rights from corporations and governments to every user.\n\nthen what's bad about the collective users also have a say in reverting owners change, isnt that more power to user?\nYes you will never get control of the owner's zite, but you have control to fork off owner site into a zite you have control, and pulling people who are against whatever owner's action together,\nsay a minority group getting harassed/banned by OWNERS of twitter wrongly, wouldnt the ability to fork everything including user data to another site of your own with 0 technical and coding skills, while rallying people who are banned to join that site?",
        "added": 1527062638
      },
      {
        "comment_id": 92,
        "body": "> [krixano](#comment_450_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): I'm not sure what you are agreeing to about optional files\nahh there's no git history yet because we are here to implement it, what i say is problematic is cant really make a git history of something you dont know(like you can only have a git history of optional files you STORED)\n\nfor future reference, when i say \"backup\" i meant it in a git manner, where only changes are store, and can be reverted(dont really know what others means when they use \"clone\" with(like backup then) or without userdata)\nand when i say \"fork\" i meant it as in restore to a backup state by undoing what changes that are logged/stored",
        "added": 1527064186
      },
      {
        "comment_id": 93,
        "body": "> [krixano](#comment_452_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): This isn't quite true. Changes to zites do not propogate to forks/clones of those zites unless the owner manually clicks \"update\" to update the code from the zite they cloned from. Data is not copied over to other zite when using the ZeroNet clone feature. But you can still download the zites as zips periodically, which includes user data. The changes don't propogate to downloaded zips - that doesn't make any sense.\n\nthat's why we need another \"clone\" feature that logs changes and allow you to revert owner change + rehost\nsince data is not copied over using the current \"clone\" feature, tho i want to assume this is the same for the zip one",
        "added": 1527102390
      },
      {
        "comment_id": 94,
        "body": "> [krixano](#comment_453_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): The zip download downloads all user data I'm pretty sure. So that should work. If not, then you can literally just have a program copy all of the files yourself. It's all manual right now, so a feature like patches or dvcs commits, etc., or even one to do automatic backups, would be good, perhaps.\n\nsomething like a crontab that do `git add .&&git commit -am \"$date\"` in each zite every hour\nnot as streamlined but kinda workableish, but ideally a plugin will do it seamlessly that anyone without any technical knowledge can restore or create a zite from a set time period",
        "added": 1527106893
      }
    ],
    "1526523255_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
      {
        "comment_id": 95,
        "body": "> [samp](#comment_32_1BrWfc2d3PZKCUr6mg3brj9GvqVJpsRVw5): we have reached the point where i cannot tell whether anyone is joking\n\nor begin crazy or begin legit",
        "added": 1527164610
      }
    ],
    "1525797672_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
      {
        "comment_id": 29,
        "body": "> [hydragene](#comment_4_1Bz3UqKY3RHF4ZyMqatwTBUGwDNahmU5SS): Please don't commercialize this platform. Haven't you seen what businesses did to \"Social Media\"? They've made it \"Business Media\" with all their monetized promotions and ads.\n\nby that i just meant simply allowing people to sell and buy stuff, which personally i find zeronet is lacking/not possible, not really thinking zeronet should be some network that everything requires money\nbut personally i believe it will just be one of these things that wont be possible due to how zeronet work\ntho if one really want it's not really impossible to have say promoted ads in zerome or promoted posts in zerotalk if the site admins really want that(or just run coinhive at your sites already), i would argue it isnt really needed due to how the site hosting itself is already free",
        "added": 1525802616
      },
      {
        "comment_id": 30,
        "body": "yeah i totally agree, the idea of begin openness dont sit well with money \nblame greed, case in point - youtube: original it was just a hobby, there's no money to be made, soon it became a getrichquick and now this fallout(there's nothing wrong with wanting money for you work, i am just pointing how things turn out)\nstill to the original bitcoin's creator they managed to built a system regulated by human greed which i still found interesting, using the worst of us against ourself \nalso interesting offtopic thought: as of right now, zeronet is actually built ontop of selfless, there's no reward to seed something, yet we all did it anyways\n",
        "added": 1525807712
      }
    ],
    "1525808694_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
      {
        "comment_id": 31,
        "body": "> [ssdifnskdjfnsdjk](#comment_258_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I have uploaded couple of videos to KopyKate and found several others that i think are not on YT, you can do it too.\n\nyeah i did reupload some stuff too dont really know what to repost, and i doubt i have skills to produce anything\n\n> [zombut](#comment_1_1Fdpc6r3Rdy7kkSMhcYtgbzxZaEDgTrERF): peertube ?\n\nmind if i ask for a link?",
        "added": 1525811061
      },
      {
        "comment_id": 32,
        "body": "ahhh i thought you meant like a zite...\ni guess i could check that out some time latter",
        "added": 1525811354
      }
    ],
    "1525943428_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
      {
        "comment_id": 34,
        "body": "but now we have headless chrome, i believe it's better and easier to work with then having js resolver\nalso wow so many topics lost to time",
        "added": 1525945538
      },
      {
        "comment_id": 35,
        "body": "> [htgozn](#comment_158_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2): There is Zirch Automated Search è‡ªåŠ¨æœç´¢ 1.0http://127.0.0.1:43110/1SearchPd3khzLtsxTxKYhYUohk7c1QYd/ [...]\n\nimportant zites is just important, it's goal isnt to map the whole zeronet using crawler\nthe zirch seems to only query off 0list only, while it says it is automated but the crawler is centralized only by site operator",
        "added": 1525964397
      },
      {
        "comment_id": 37,
        "body": "i just wanna get a reason/reason to play with chrome headless :P\nmaybe if i am feeling like i want to code\ntho it stills need crowdsource to label sites\ngreat here goes another over ambitious idea to be added to the list of ideas that wont be accomplished!!!",
        "added": 1526048418
      }
    ],
    "1525979103_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
      {
        "comment_id": 36,
        "body": "> [sylviecloud](#comment_37_14RJhs7d84srMhP3Su4ErpZ5NfpXPRV3Ac): thanks nofish. It's better to have multiple categories on ZeroTalk, than multiple clones of ZeroTalk.\ntotally second that\nonly problem, we dont have a list of categories, which means things get lost to time",
        "added": 1525980344
      }
    ],
    "1526051818_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB": [
      {
        "comment_id": 38,
        "body": "Chill guys!\nWe all may have different opinions, but cant we respect each other?\nAt the very least if we are here we all agree on decentralization of control, and a place for freedom,\nYou may not agree, but you dont have to agree.\nAnd if this shit is still on zerotalk it just shows how much the admins value freedom over just banning said user,\nIf this shit cant be taken off zeronet, I can sleep well knowing neither will any of my site be taken down, to me it's kinda a proof that our network is REALLY that resilient as it claims to be.\nI think our unfriendly behaviour turns people away more than anything..",
        "added": 1526068079
      },
      {
        "comment_id": 40,
        "body": "> [theanswerer0](#comment_40_1F2ZbgkHvpknveTB6wFa5xNEQBb8yxQnCR): You believe pedophiles that are distributing and attempting to profit off of images of their victims deserve respect? What if he was attempting to sell pictures of dead kittens, would you still feel the same way? In what universe would respect be an appropriate response? [...]\nMy bad, further clarification what I mean is that telling people to \"Drink bleach, you sex obsessed jackass.\" wont change anything, there's nothing wrong to have a rational civil debate of anything, but hurling insult wont be the way to resolve anything.\n\n> [0hd](#comment_21_14myhdHusLxmeHYieWEZfs221Q2or2iSbJ): Freedom is cool.  [...]\nSure, I will get it done if you can give me 10 BTC first, shipping on me!!",
        "added": 1526110607
      },
      {
        "comment_id": 46,
        "body": "> [coincloudguy](#comment_5_1GkmeCNuarifRQooJ8P5xawoXCweDdLrUJ): What do you expect to gain from it, because selling CP for $0.01 is hardly even worth the 'work' of selecting and sending them.\nThat's really a good point, suprise how no one even considered it, even if i have a huge archive of anything selling it for 0.01$ wouldnt even be enough to pay for my internet bills, nor my time to have to \"upload\" it or dealing with humans(they are the worst)\n\n> [sylviecloud](#comment_46_14RJhs7d84srMhP3Su4ErpZ5NfpXPRV3Ac): I already told you guys. Law enforcement has infiltrated ZeroNet. They'll keep making threads like these to try to bait people using the network.Â  [...]\noh shit queue more theories, but given the history of what they did with tor i cant really dismiss that one...",
        "added": 1526153392
      }
    ],
    "1526069766_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
      {
        "comment_id": 39,
        "body": "some theories about mtgox https://www.ccn.com/8200-btc-moved-from-mt-gox-wallet-possible-sell-off-affects-bitcoin-price/\ndunno if it's trustworthy",
        "added": 1526073597
      },
      {
        "comment_id": 41,
        "body": "> [piloth](#comment_16_1FKuNsExQML7APuNmkCV8uzB5pKupcmnck): Ahhh ok. Yeah I knew about this. He was moving coins around last week to a consolidation wallet. I was wondering when he was going to dump again. I wish the fucker would sell those BTC over the counter. He either doesn't realize the affect he's having or he just doesn't give a fuck. [...]\n\nif i have to i would move it slowly and shuffle it along the way\nenough shuffling so that it isnt traceable, then once market stable sell it off SLOWLY maybe using some script\nunless you need some instant cash which just meant you trade for less",
        "added": 1526110947
      },
      {
        "comment_id": 47,
        "body": "> [tomsawyer](#comment_1_1NkRbczBVD8gsCG5PMsS1b2gN63srsqYvp): I think the guy has just so much BTC and really does not care if he sells it at 12.000 or 7.000 hence the profit he makes anyways.Good times for shopping. If I wouldn't have shopped so much already when it tanked in spring I would buy more ðŸ˜‰\n\nwhish i actually trade cryptocurrencies, most times i just speculate since trading fiat to crypto most times need id and i am not really willing to provide that",
        "added": 1526153674
      },
      {
        "comment_id": 61,
        "body": "> [tomsawyer](#comment_3_1NkRbczBVD8gsCG5PMsS1b2gN63srsqYvp): Yeah, earning or mining straight crypto ftw. You need good offline trading possibilities, my friend ðŸ˜‰\n\nmaybe i should earn some since i can code decent enough, most people dont even know or have crypto tho",
        "added": 1526305487
      }
    ],
    "1526116721_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
      {
        "comment_id": 45,
        "body": "> [gitcenter](#comment_305_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): It is shown because you know your own IP. Others don't.\n\nOhhhhhhh make sooo much sense",
        "added": 1526128397
      }
    ],
    "1526160236_1NkRbczBVD8gsCG5PMsS1b2gN63srsqYvp": [
      {
        "comment_id": 48,
        "body": "> [quantumkitty](#comment_3_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Then again.. Crypto got owned by regulation. :(\n\nhow does that happen? stored in an exchange wallet?",
        "added": 1526194350
      }
    ],
    "1525624122_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
      {
        "comment_id": 22,
        "body": "ill start,\ni would really like a chat site, but it have different #channels that anyone can create/post/join in rather then only having one chat\nalso something like discord where a site act as frontend joined with mergers of \"servers\" which contain text channels categories etc admins can manage create delete etc with categories channel, access permissions(locked limited sending channels) etc, i doubt chat is possible, also the broadcast delay MIGHT get in the way of things like realtime chatting",
        "added": 1525624148
      },
      {
        "comment_id": 23,
        "body": "> [gitcenter](#comment_322_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Runtime chatting is possible\n\nwhat about the \"content publishing queued for X second\" isnt that meant as delay?\n\n> [shitchell](#comment_45_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo): I use the internet mostly for: [...]\n> [shitchell](#comment_46_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo): I'd also like to see desktop alerts become a thing for mail and your newsfeed (with options for which items in your newsfeed you get notifications about)\n\nwe kinda lack a good reddit clone zerovoat is voat not reddit,\nand yes i would like to be notified of certain replies rather than watching the homepage 24/7\nand the mail site always lack some love, due to lack of newsfeed it always is the last thing of my mind to check it but for security sake you cant really be notified\n\nfor documents i guess that would be nice too, maybe realtime code collab but i dont think zeronet is meant for that",
        "added": 1525626910
      },
      {
        "comment_id": 24,
        "body": "> [gitcenter](#comment_323_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): But 30 seconds aren't that much.\n\ni guess i will live with what i can do with, but do you know why is the delay in place? ever since i saw the delay it always got me thinking why was it put in place",
        "added": 1525628645
      },
      {
        "comment_id": 25,
        "body": "> [shitchell](#comment_47_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo): I'm not sure that it's put in place purposefully as a delay? Sometimes it's 5 seconds, sometimes it's 30... My guess is that it has to do with finding peers and how busy the network is. But I'm not totally certain; you'd have to ask one of the ZeroNet devs. [...]\n\nthe inline has some advantage and tbh i kinda like it, more then reddit at least, like threads gets too deep, you dont get notified for child threads etc which is why i still like inline more, maybe an option to reply as a thread, if you think your post is too offtopic\nwhen i say reddit i assume something like milchan where people can create their \"subs\"(merger sites) and be listed and they can also view it inline on ONE frontend page or a merger client of their own choice\nalso for P2P wont that give away your anonymity unless tor is used? does zeronet even supports a site to access the underlying p2p control?\n> [z1pi](#comment_4_1GSRaRPZCcWUiQxz2cKYDd8s9WL5zCMJ83): http://127.0.0.1:43110/udemy.acabin.bit/This Zite have magnet links to some courses of Udemy, may be help you\n\nshould have been a dedicate zeroup or something TBH also lacks pluralsight",
        "added": 1525634083
      },
      {
        "comment_id": 26,
        "body": "> [ssdifnskdjfnsdjk](#comment_252_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Hi, there already is topic with many ideas. I think ZeroTalk & ZeroBlog have to be improved, there are several feature requests in its Github repo.But i think one of the most important features may be this: https://github.com/HelloZeroNet/ZeroNet/issues/354\n\nat this rate someone should just create something like uservoice where people can submit ideas for core features or sites to be made and people could upvote it \ni am kinda new here so i guess i should really keep in mind before endless reposting and making this topic boring and stale",
        "added": 1525635660
      }
    ],
    "1525698971_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB": [
      {
        "comment_id": 27,
        "body": "> [ssdifnskdjfnsdjk](#comment_255_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): a good idea, one can create new torrent inside his/her Torrent client and then copy magnet link into zeromail. Though, [...]\n\nmaybe just encrypt the content for good measure",
        "added": 1525714513
      }
    ],
    "1525777374_1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQ": [
      {
        "comment_id": 28,
        "body": "Version 0.6.2 rev3465\nWhy dosent the hello page show the latest version?",
        "added": 1525791910
      },
      {
        "comment_id": 33,
        "body": "> [ppload3](#comment_35_1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQ): just use the update function, it will get you a more recent rev version.\n\nyou meant the one on the zerohello?\nyep it dosent... it still say rev 3465 as up to date",
        "added": 1525860730
      }
    ],
    "1524919462_1GWuBys3FxxUX3iRfuEqdRtNgbawiHJ6mu": [
      {
        "comment_id": 16,
        "body": "What?",
        "added": 1524920321
      }
    ],
    "1524935803_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo": [
      {
        "comment_id": 17,
        "body": ">So how do you create a website that stays online and always reachable while still being decentralized? \n\nMy personal answer is to share it with everyone, people who liked it will seed it for you, and your site is decentralized within your community\n\n>leave their zeronet server constantly running on their home computer [...] relying on the person's home computer to host the site the majority of the time\n\nnot really true, you are relying on your peers/community that at any given moment there should be at least 1 peer existing thus the website will always be online; the more peers you have lower chance your site will go offline at any given timeframe, you are not exactly hoping for one peer who are always online(that's dangerous), but enough peer that any peer within the swarm can freely go off without taking the site along with it",
        "added": 1524936677
      }
    ],
    "1525030360_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
      {
        "comment_id": 18,
        "body": "> [nofish](#comment_1161_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): There is no such feature yet, but it could be possible. [...]\n\ninteresting to see how it could be done, maybe someday it will be a feature\nbut what about the user registry? sure it cant remove contents but wouldnt it render you invisible to others?\nfor me i believe it's in the right hands, i am not really paranoid but just wondering the possibilities",
        "added": 1525073134
      }
    ],
    "1525203779_1KCJ86Jg3LNBpHxcaRojsHTg9Qme9vuV1j": [
      {
        "comment_id": 19,
        "body": "failed to load the game for me\n```\nUncaught TypeError: Cannot read property 'buffer' of undefined\n    at processDataJob (UnityLoader.js:1)\n    at i.callback (UnityLoader.js:1)\nprocessDataJob @ UnityLoader.js:1\ni.callback @ UnityLoader.js:1\nsetTimeout (async)\ni.complete @ UnityLoader.js:1\n(anonymous) @ UnityLoader.js:1\nr.worker.onmessage @ UnityLoader.js:4\nall.js?rev=3407&lang=en:2578 ```\n```\nWebGL error TypeError: Cannot read property 'find' of null\n    at Object.<anonymous> (all.js?rev=3407&lang=en:2567)\n    at Wrapper.onMessageWebsocket (all.js?rev=3407&lang=en:913)\n    at WebSocket.<anonymous> (all.js?rev=3407&lang=en:830) ```",
        "added": 1525204295
      }
    ],
    "1525521049_1KY1YYCNH5sDor7yu19jEr5yMtiZ5QyWwu": [
      {
        "comment_id": 20,
        "body": "> [shitchell](#comment_44_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo): More people need to know about this: https://medium.com/@johnblocke/a-brief-and-incomplete-history-of-censorship-in-r-bitcoin-c85a290fe43\n\nand down goes the rabbit hole [(Link to Youtube) How Bitcoin Lightning Channels Work](https://www.youtube.com/watch?v=pOZaLbUUZUs) again...",
        "added": 1525523728
      }
    ],
    "7_15ATNsS6aHGvBg5xoMP94sXpNaLX4fSHjN": [
      {
        "comment_id": 21,
        "body": "personally i dont see anything wrong with a blocklist of any sort even automated, so long as user is AWARE and OPTED-IN\nlike say on first install user will be prompted with a SUGGESTION to subscribe to a recommended community blocklist(but what to block is beyond me), users still have a right to reject/accept and if they visited a blocklisted site they can whitelist it anyways if they wish\nas long as it's not forced/hardcoded i dont see a problem in it\nsay if i visited a blocked site i just get a warning of why it's blocked, and i can move away or just whitelist it(temp or permanent)\nsay if a list has updated i have an OPTION to stay as current or update to new one while begin able to view pardons/bans added and reasoning of it(or i can enable auto update which is where it's dangerous)\nit dosent hurt the freedom of zeronet if user visited the site they will still delete it anyways if they dont like to be seeding said contents so a blocklist is just made to help user to avoid said content in the first place\n\nto avoid giving attention we could just block by hash() of site address but i dont think this is a good call as we are suppose to be open rather then be closed and hidden\n\nwe also have the problem of what to block?, say we passed all this hurdles and have a system in place, now what do we block??\npersonally i suggest we can have multiple blocklist like list of categories that is community moderated, people who dislike/dont want to view said type of content can subscribe, other who dont care, wont care\nregarding antibot we COULD use POW system so each vote is backed by POW of some sort \n\nthe problem with deleting site/not seeding a site is a problem arises due to how zeronet works one can really argue the ability to delete a site is an act of censorship and that zeronet shouldnt even allow it to happen(block site deletes)\nit's a balance between power to user or to the sites",
        "added": 1525597709
      }
    ],
    "2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
      {
        "comment_id": 7,
        "body": "> [nidhogg](#comment_1_1C14Ry79vQ1BXrp7LfRmkHyPdoCq3ej85t): How the Zeronet work?\n\nofficial clearnet presentation: https://docs.google.com/presentation/d/1_2qK1IuOKJ51pgBvllZ9Yu7Au2l551t3XBgyTSvilew/pub?start=false&loop=false&delayms=3000&slide=id.g9a1cce9ee_0_4",
        "added": 1523713994
      },
      {
        "comment_id": 69,
        "body": "> [dotnetspec](#comment_2_18VvaNX572kjoKKhq2iLJCkPZKVjUMbjDh): Valimero: Thanks. I received an initial ''registration successful' email in zeromail but now don't appear to be able to receive emails. I tried the bot but it only sends out. Nothing comes back to my inbox. Any ideas? Thx.\n\nsend something on your email!\nthe echo bot is dead, someone need to remove that please",
        "added": 1526462076
      }
    ],
    "1523888661_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
      {
        "comment_id": 11,
        "body": "> [glightstar](#comment_74_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): The data won't get deleted when it's stored in localstorage, though of course, browsers aiming at anonymity or browsers that delete site's data, aren't included in that.. [...]\n\nwouldnt that meant it gets shared to the network? i dont know why but i have an irrational fear of sharing that kind of data despite i know how it will be secured\n\nalso my initial plans was to make the seeds always persist on the device regardless of current user, maybe i can add an userdata.json and ignore it in the contents.json and we would just read and write off it instead of localstorage which is not shared with all users",
        "added": 1523981019
      },
      {
        "comment_id": 12,
        "body": "> [glightstar](#comment_75_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): Yeah, I mean that's what I said xDYou should definitely use the filesystem-API to read and write to a file, but it's pretty much your decision, on which of the two encryption methods you want to use (or you use a completely different one) and if you want that users can see their masterseeds everywhere for comfort, which, indeed, requires that other users are able to seed the file (so definitely encrypt in this case!!)\n\nthanks i guess this is a good concept but have a ton of rough edges, maybe i will sand it all over in the future or someone will be happy to make it into something grander",
        "added": 1524337246
      }
    ],
    "1524765490_1D2E7WbvtaBxyunA2P3M1rFzsWBaZhDUCW": [
      {
        "comment_id": 13,
        "body": "Lets make a CNC structure based off how zeronet would function!\nWe could effectively hide who actually control the botnet, or its just another victim propagating commands throughout the network\nand ideally it would be impossible to be shut down(unless the controller's keys get destroyed or self destruct command initiated via a compromised key if it's implemented)\nproblem arise when you want to send something back to the botmaster, essentially it's kinda a one way channel which is not very ideal for certain use cases",
        "added": 1524766483
      },
      {
        "comment_id": 14,
        "body": "> [marcusbrix](#comment_3_1D2E7WbvtaBxyunA2P3M1rFzsWBaZhDUCW): That sounds like a really cool idea. Does ZeroNet have an API? But another problem, we would have to add the zeronet files to the payload, if it were to be done :(That would make deployment more difficult as the file would take up more space and use more resources running. [...]\n\nIdea is to built another system up from ground but only possesses the necessary parts(bulky malware makes easy spotting) with barebone(we are suppose to just use mirror how zeronet works without using it)\n\nFor sake of example, say we managed to embed zeronet into your malware and\nuses different ports etc so if by odds the user also have zeronet it wouldnt clash with it,\nnow we just need to call 127.0.0.1:ourport/(CNC's address)/ (we will open it on a hidden web browser because javascript is needed), but it will probably only be needed for the first time so zeronet knows we need it to seed that site,\nnow the malware can access zeronet'sroot/data/(cnc address)/commands.json or whatever it needed\nall that left is for the botmaster to edit the site's commands.json and sign+publish it\n\nBut lets step back and think what this can be used for, all i can think of is just to use it for something like ddosing or flooding where a respond is not necessarily needed\nYou cant even do anything like the ransomware or just extract any data from infected host without doing something crazy(which only works if you alter the protocol grately) like each malware makes it's own site and propagate all malware peers to host it, the site itself will have the response, assuming the botmaster will be in the peer, they will automatically get the response that way without exposing themself since they could just be seen as just another infected machine doing what it was commanded to do(you could encrypt the response with owner's public key doe which means the response itself is actually secret)\n\n**TLDR**: ideally you dont have to use zeronet but just use their concept, also doing it using zeronet which will only yield a one way connection is complicated, and the possibilities of altering the protocol and making it a two way connection thus making it more useful",
        "added": 1524770017
      },
      {
        "comment_id": 15,
        "body": "> [marcusbrix](#comment_4_1D2E7WbvtaBxyunA2P3M1rFzsWBaZhDUCW): Well, it's an interesting idea, but pretty much just an idea for me as this is waayyyy above my level. It would be cool if it someone created it, though.\n\nsame here, i just like to think of all the cools way things could be done\nmaybe minus the someone created it part thought(or maybe not)",
        "added": 1524770545
      }
    ]
  },
  "comment_vote": {
    "64_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
    "447_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
    "279_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
    "23_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": 1,
    "25_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
    "2_13mmQytg34syftQYB5eFFMA9ATsGGmjk46": 1,
    "4_13mmQytg34syftQYB5eFFMA9ATsGGmjk46": 1,
    "1_1rYi49f3DNfJntyt2EV3H1xjpVobJMoLz": 1,
    "5_1FLQiXhoa56vb91aiVxyAiC8L5YJy4W3Hi": 1,
    "52_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": 1,
    "68_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo": 1,
    "26_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
    "409_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
    "412_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
    "415_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
    "422_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
    "70_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo": 1,
    "3_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
    "423_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
    "41_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
    "3_19E8HuXMVLLNoU1zWjgqgwGGKxS64vjLka": 1,
    "5_1LJMKSLPgM8fqQSMRrLzWB2DhVm1zoEVfZ": 1,
    "247_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
    "1_1Ah2crgMozDQ1qX9FeeqUbDMH52KcutHBM": 1,
    "215_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
    "13_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB": 1,
    "2_14RJhs7d84srMhP3Su4ErpZ5NfpXPRV3Ac": 1,
    "8_1467X2hmPQP5gAKnh9uhQX6M1DWCHqLbCG": 1,
    "14_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB": 1,
    "62_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": 1,
    "153_168qV1Xxp2EyszrzdECLUwXrn9wGYjDdar": 1,
    "154_168qV1Xxp2EyszrzdECLUwXrn9wGYjDdar": 1,
    "39_1Lh89nAb4YeizEER15JUcpscy37mZwDUer": 1,
    "10_14myhdHusLxmeHYieWEZfs221Q2or2iSbJ": 1,
    "5_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD": 1,
    "195_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
    "2_1PctriJ155UjQV4HrXw9qr7rznf8MNBkaj": 1,
    "15_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo": 1,
    "82_1GgNo3CmxPd7n2pMSF3uyqf1XHvgtTUqCe": 1,
    "1_13A49qGkX6Sp1tQM8nN86gEPGSM1V1MMZS": 1,
    "2_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh": 1,
    "11_1F2ZbgkHvpknveTB6wFa5xNEQBb8yxQnCR": 1,
    "1_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": 1,
    "1_1Fwz4gHCJMZNXvMkZQK7qRPqBXshFdBoZB": 1,
    "44_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo": 1,
    "46_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": 1,
    "45_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo": 1,
    "46_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo": 1,
    "5_14AqVUuAqS3HsxsPzNgheYJEYWSQnUk7NW": 1,
    "20_1BGWexcsjvPpnPZVmmioZvwBBQ3WoZsWuQ": 1,
    "32_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": 1,
    "2_1PdAWkEHsyXJZ3corovrztbyQQSkBtepcc": 1,
    "149_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
    "15_1KY1YYCNH5sDor7yu19jEr5yMtiZ5QyWwu": 1,
    "5_1Bz3UqKY3RHF4ZyMqatwTBUGwDNahmU5SS": 1,
    "55_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo": 1,
    "56_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo": 1,
    "37_14RJhs7d84srMhP3Su4ErpZ5NfpXPRV3Ac": 1,
    "10_16KZw5gzYyBdfuW9HSUZiGHmayCEXunYZU": 1
  }
}