{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1587001335,
			"title": "吞噬进化",
			"body": "末日之中，当人们抱怨没有觉醒异能的时候。伊森已经为自己拼来了吞噬异能。也正是从那一刻起，每一位异能者都成为了伊森购物清单上的选项。丧尸，恶犬，强大的异纬度凶兽。诡异小镇，破碎城区，神秘的异纬度世界。传奇的脚步，从死亡镇开始。",
			"added": 1587001350,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		}
	],
	"topic_vote": {
		"1586971479_1Fx7dGsWLjf1Up9S2oiy7uKMyFjHTDrbZc": 1
	},
	"next_comment_id": 19,
	"comment": {
		"1586943643_12JKXCV2YAHbka71zTmK7zRGSEuBu5H8P7": [
			{
				"comment_id": 1,
				"body": "应该是被欧美的皿煮洗脑的人，不是港独就是台独。\n直接拉黑屏蔽就好了",
				"added": 1586943931
			},
			{
				"comment_id": 2,
				"body": "平时都被保护在墙内，能正面刚他们也挺好的！\n台独 去死 ！",
				"added": 1586943993
			}
		],
		"1587001335_1N16MiCzsNzfRczxCdK7sWWhbiCvdXjacE": [
			{
				"comment_id": 3,
				"body": "001 活着\n\n公元2062年，末日降临的第二年。\n        这是一个光怪陆离的世界，更是一个疯狂到让人们难以接受的世界。\n        一个阴暗潮湿的仓房中，打斗声不断传来，虽然声音听起来很是激烈，但事实上，这是一场一边倒的战斗。\n        这是一个黄种人男性与一名白种人女性的战斗，场内的黄种人青年被蹂躏的不轻，身上随处可见块块淤青。\n        让人感到惊讶的是，淤青只能算是最低级别的伤痕，青年的身上还有着各种各样、纵横交错的疤痕，刀痕、箭痕、甚至是枪伤。看得出来，那些痕迹并不是这次战斗落下的，应该已经有些历史了。\n        “呵...呵...呵......”男青年努力的挣脱了束缚，猛地将头从水槽中挣脱出来，大口大口的喘着粗气，几近窒息的他，因为大脑缺氧，所以神智有些不清，支撑着浑浑噩噩的身体，转过头的一刹那，却看到了一片寒芒划过。\n        呲......\n        冰凉的匕首从青年的左侧腰腹部位划过，一瞬间，青年那本就惨不忍睹的身体又增添了新的伤口。\n        “这世界本就不公平，上帝没有垂青你。”清冷的声线从女人口中传来，让人听着有些背脊发寒，那一双美目如炬，宛若夏日里灼热的炎阳，肆意的焚烧着周遭的一切，与那清冷的声线格格不入。\n        女人话音未落，那紧绷的身体猛地窜了上来，速度极快，青年本就有些浑噩的大脑来不及做出反应，但是身体却已经自己动了，换句话说，此时此刻，青年的意识完全跟不上自己身体的本能反应了。\n        险而又险的，青年侧身歪头躲过了一记鞭腿，却又被女人后续凌厉的攻势弄的捉襟见肘，不到两秒钟，便被一脚踹在了胸膛上，身子像是断了线的风筝一样，摇摇欲坠，在空中划出了一道完美的弧线，身体重重的砸在了墙壁上。\n        “呵...呵...呵......”青年胸膛剧烈的起伏着，微微摇晃了下脑袋，试图让自己清醒一些。\n        发懵的脑袋让他很难接收到周围的信息，却听到了那断断续续、宛若天际传来的清冷声线：“你没有那些人强大的基因，你没有被选择成为一名异能者，你没有办法和他们比较。”\n        腰部传来那火辣辣的疼痛感让他清醒了一些，而视线中那匕首的锋芒却在无限的放大。\n        “我们都一样，是下等的贱民，天生就该去送死的炮灰。”话语落下，匕首也落了下来。\n        青年却背脊用力，借着冰冷的墙壁，以命搏命的姿态冲了出去，任由那匕首深深刺入自己的左臂膀，右手在腿侧一抹，同样一柄锋利的匕首出现在他的右手中，迅速向女人脖颈抹了过去，怒声吼道：“我们不一样！”\n        女人挑了挑眉，在短短的一瞬间，用几乎作弊般的方式，超乎人类的极限反应能力，避身闪躲，轻描淡写的躲过了这致命一击，看着与自己擦身而过的青年，女人伸出那纤长的臂膀，直接从后方勒住了青年的脖子，左臂勒紧，右臂迅速“上扣”。\n        兔起鹘落，一个瞬间，一个类似于柔术中裸绞的技巧，青年已经被制伏。\n        青年疯狂的挣扎着，用尽一切能想到的方法试图摆脱，右手中握着匕首，反手就向身后刺去，但手腕却被女人的右手牢牢握住。\n        她松开了“锁扣”，单手握住了青年的手腕，仅凭另一只手臂的纯力量，轻松的将青年制伏。\n        青年的左手试图将女人勒住自己脖颈的手臂拉下，但是女人那强大的力量让他感觉到了实实在在的绝望滋味，很难想象，如此纤细修长身材的女子，会有如此远超常人的力量。\n        慢慢的，天旋地转，慢慢的，眼前漆黑，慢慢的，青年壮硕的身子一头栽倒在冰凉的水泥地面上。\n        女人缓缓松开了手臂，来到水槽面前，一头扎进了冰凉的水中，似乎是要让自己清醒一些。\n        “呼......”女人慢慢平复着自己稍稍紊乱的气息，一手抓了抓自己清爽的短寸发，回身看着昏迷到底的青年，女人不由得苦恼的敲了敲自己的脑门。\n        她打开了左侧的破旧柜子，拿出了一个急救包。\n        ......\n        ......\n        “呃......”不知道过了多久，青年慢慢清醒过来，发现自己依旧在这间阴暗潮湿的仓房里。\n        身上无处不在的疼痛感让他觉得自己人都要散架了，他看到了缠绕在自己腰腹处的绷带，臂膀上的匕首也不知所踪，取而代之的也是绷带。\n        “醒了？”\n        “嗯。”青年躺在冰冷的顺着声音望去，却看到自己的恶魔教官正对着墙壁迅速出拳，似乎是在发泄她旺盛的精力，那一身流线型的肌肉真的很美，但那修长窈窕美丽的躯壳却掩盖不了她的罪恶行径。\n        青年闻着空气中发霉的气息，又听到女人说出一句话：“你得感谢我挑选的匕首没有背齿，它更像是一把水果刀。”\n        “明天继续吧，我得回去了。”青年挣扎着坐起身子，面色一阵变幻，却硬生生的没有因疼痛而叫出声。\n        “这几天在家休养吧，我听说你在7天后要出行任务，你得保持好状态。”女人停下了动作，转过身，看向了不远处的青年，青年的话语中没有一丝一毫的退缩，这让她愈发的欣赏这个青年了。\n        “听说死亡率很高，不过这样也好，反正回到你这里也是地狱，死了倒也算是解脱。”青年随意的说着，慢慢的起身下床，尽可能的控制自己龇牙咧嘴的模样。\n        “呵呵，伊森，我从未怀疑你对生存的渴望，也从未怀疑过你那坚定的意志，毕竟它们都是我为你培养出来的，不是么？”女人挑了挑眉，天蓝色的美眸中带着淡淡的笑意。\n        被称为伊森的青年没好气的看了女人一眼，嘟囔道：“随便吧。”\n        肤白貌美大长腿，这也许应该是女神的标配。这位“女神”有着这样的配置，但是却并没有女人应有的温柔妩媚，尽管她的五官精致，但是那金色的短寸发彰显了她的独特，甚至透露着丝丝野性的气息，湛蓝色的美目如炬，英姿飒爽，英气逼人。\n        但也就是这样一个魅力惊人的女性，在伊森的眼中却是一个实打实的恶魔。自从他被强行带入这里训练开始，哪一次训练不是以昏迷而告终的？\n        她叫米兰达，一个让伊森又爱又恨的女人。\n        “呵呵，生气了？”米兰达嘴角微微扬起，“因为你又一次失败而气恼？还是对几年前球场上的事情耿耿于怀？”\n        “咳咳...咳咳......”伊森一时间没忍住，突如其来的转折的确出乎他的预料，“撞翻了一个书呆子，你有什么好骄傲的。”\n        伊森语气有些无奈，但是却罕见的露出了一丝笑容。\n        回忆总是美好的，尤其是末日之前的回忆，它总能让人暂时逃离这片炼狱。伊森的确和米兰达认识，在伊森9年级（高一）的时候，米兰达12年级（高四）。\n        正常情况下，两人不应该会有什么交集，一切的一切都因为一个该死的赌约。\n        直至今日，伊森都有些后悔当初自己出现在橄榄球场上，如果不是自己的好友想要追求那个同年级的貌美拉拉队员，伊森也不会被一个女球员撞得四脚朝天，而这个女球员便是米兰达。\n        “有你朋友的消息了么？”米兰达走了过来，一屁股坐在了病床上。\n        伊森收敛了一下情绪，轻轻的摇了摇头。\n        “我们一样，朋友们死走逃亡，没有音讯。庆幸的是，我们学会了坚强，不是么？”米兰达一手拿着毛巾，胡乱的擦着自己的短寸头。\n        “我们不一样。”伊森哼了一声。\n        这是他第二次说这样的话了，但事实的确如此，他和她的确不一样。\n        尽管米兰达以“贱民”自称，但是她却比伊森强很多。起码相对于普通人的伊森来说，米兰达吃过一颗由异兽头颅中出产的晶核。\n        那枚晶核给了她常人无法想象的能量，虽然她并不是一个异能者，但是那远超常人的身体素质，是寻常战士很难逾越的。\n        “你已经做得很好了，你有着常人所不具备的勇气和毅力，而且......”米兰达屈起一根手指，敲了敲她自己的脑袋，示意了一下自己的短寸发，“你给我带来了不少麻烦。”\n        伊森耸了耸肩膀，并没有接话。\n        米兰达曾有着一头迷人的长发，在战斗的时候也会绑成马尾，而那头发却让她在与伊森对练的时候苦恼不已，在这真刀真枪的魔鬼训练中，两人的动作是没有任何规则限制的，伊森不仅一次抓着她的长马尾扭转战局，直到有一天......\n        顶着一头短寸发的米兰达出现在了这间仓房中，那飘逸迷人的长发彻底成为了历史，而伊森的投机取巧也成为了历史。\n        “撑过这一次任务，我正在尽力运作，把你调入我的队伍中。”米兰达伸手摸了摸伊森的脑袋，纤长手指微微屈起，抓了抓他漆黑的短发。\n        “希望你能如愿。”伊森说道。\n        “任何一支队伍都渴望着你这样一个士兵，你不知道你有多优秀，伊森。”米兰达深深的舒了口气，轻声道，“他们因为你优异的考核成绩而关注你，我却能在这几个月的训练中了解的更深，我知道你那些可贵的品质，那才是真正让一支队伍活下去的东西。”\n        伊森转头看向了米兰达，神色微微有些复杂，他并不确定，米兰达是否是因为曾经的朋友身份才要求特训自己，毕竟在这兵荒马乱的末日里，亲友离散、自走逃亡，数不胜数。能够碰到一个熟人，那该是有多幸运。\n        但是伊森能够确定的是，米兰达的训练的确让他脱胎换骨、重获新生。将他变成了一个比之前更专注、执着的人，一个充满了斗志与信仰的人。\n        这种信仰，叫“活着”。",
				"added": 1587001389
			},
			{
				"comment_id": 4,
				"body": "002 临别\n一间略显阴暗的房间中，昏黄的灯光忽明忽暗，潮湿的环境让这里弥漫着少许发霉的气息，一个身高大概在178cm，黄皮肤、黑头发的青年看着桌子上冒着热气的肉排，青年向前走了两步，动作缓慢的坐在了椅子上，显然，他的身上有伤。\n        鼻间弥漫的肉香可以取代空气中发霉的气息，伊森知道这肉排是由什么“动物”制作而成的，在这一年多的训练成长生涯中，他亲眼见过几次这样的生物，从第一次见时的恶心反胃，到现在忍不住大快朵颐，他显然成长了很多。\n        这不是一个美好的世界，它不会照顾任何人的自尊。\n        “回来了，伊森，快吃吧。”一道略显忧愁的中年女性声音响起，青年抬起头，看向了坐在一旁的“母亲”。\n        却发现自己的“母亲”正用一种担忧心疼的眼神看着自己，也许是自己那破破烂烂的衣物，又或者......伊森每次特训之后都会遍体鳞伤的回来，这已经是家中公开的秘密了。\n        她虽然也有着黑色的头发，但是却并非黄种人，而是一个白人女性，高高的鼻梁和微微凹陷的眼眶让她的面容看起来非常有立体感，棕色的眼睛很美，但是那粗糙的皮肤和脸部淡淡的皱纹给她减了不少分。她的原名是卡莉*布莱恩，在末日之前的那个文明社会中，她在嫁给伊森的父亲之后便自行更改了姓氏。所以，她现在的名字叫卡莉*伊，是伊森的继母。\n        在伊家居住的人数不足三万的美国南方小镇上，任何一点风吹草动都会搞得众人皆知，更何况伊森的父亲在教堂中举办了一个简单的小型的婚礼，为此，青少年时期的伊森没少被学校里一些嘴贱的同学们奚落。\n        然而故事的发展却让学校里的那群看伊森笑话的孩子们失望了，这个继母并不恶毒，不仅对伊森关爱有加，更让伊家的小产业蒸蒸日上。\n        这也许就是伊森父亲娶了卡莉的原因，这个女人的相貌平平，但是她善良而富有责任感，勤奋而又踏实。\n        “不要弄得像生离死别一样。”一个中年男子手中拿着一个巴掌大的小酒瓶，微笑着坐在了桌子对面。\n        “有酒有肉。”伊森看着父亲手中的小酒瓶，耸了耸肩膀，“的确很像最后的晚餐。”\n        父亲伊成功愣了一下，将小酒瓶放在桌子上，挤出了一丝苦涩的笑容，转移话题道：“孩子，说英语，我跟你强调过很多次了，尤其是在这样的时刻，你得照顾卡莉的感受。”\n        “好吧。”伊森随意的说着，将中文切换成了英语，示意了一下桌上的小酒瓶，“我好几次都看到你偷偷摸摸的喝，而且只喝一瓶盖。”\n        “他还是个孩子。”卡莉嗔怪的说道，眼眸中略过一丝担忧之色。\n        “他已经十七了，我在他这个年纪的时候，偷喝了不知道多少酒了。”伊成功拿过两个小杯子，拧开了小酒瓶盖，清澈的酒水注满了那透明的小酒杯。\n        听到这里，卡莉瞪了一眼伊成功。\n        伊森转过头，看向了卡莉，脑中想道：你不是土生土长的德克萨斯人么，你知道，我以为你是那种8、9岁的时候就左手拿着左轮手枪，右手拎着酒袋的女牛仔。\n        “噗嗤...”卡莉紧绷的脸终于解冻了，忍不住笑出声来，紧接着，白了伊森一眼，伸手使劲儿揉了揉伊森的脑袋，便不再开口。显然，她不会在这个问题上再纠结了，她默许了这对儿父子喝酒的行为。\n        “你对她说了什么？”伊成功皱了皱眉，嘴里又忍不住细碎念叨，“那些该死的花朵。”\n        “是啊，该死的花朵。”卡莉抿了抿嘴，脸上的笑容减缓，深深的叹了口气。\n        事实证明，卡莉是一名异能者，卡莉能够听到人们心中的想法。\n        值得一提的是，卡莉并不能人们的记忆，只能通过异能倾听到此时此刻对方脑海中的想法，而且还是断断续续、似有似无的。这样的能力并不能算得上多高级，但是只要运用得当，便有着极为重要的作用。\n        言归正传，让夫妻两人咒骂、感叹的“该死的花朵”到底是什么呢？\n        没有人知道那些神秘而又妖艳的花朵是从何而来，可以推测的是，应该是由异维度的生物带来地球上的。\n        在两年前的一个普通日子里，全球各地突然涌现出了很多奇怪生物，它们从诡异的空间门里涌入地球，千奇百怪，物种不一，其中最普遍的，是一种类似于大型犬的生物，它们没有毛发，眼眸猩红，撕咬着一切它们视线中的东西。\n        在最开始的2天时间里，尽管全球陷入了慌乱之中，但是世界各地也在尽可能的应对这样的突发状况，纷纷组织力量消灭这些大批涌入地球的疯狂生物，安抚人民。\n        至于居民们死走逃亡，各式各样的选择不一。\n        伊成功作为一名老老实实的守法者，当然听从了政府的建议，紧缩门窗，和家人们呆在家里，等待着官方的救援。\n        然而不幸的是，他们并没有等到救援，而是等来了一个更加光怪陆离的世界。\n        在第二天的夜晚中，不知名的花朵绽放在了深夜之中，伴随着微风吹送，散发起了幽幽的毒香。当时，哈维小镇上的人们都没有意识到这是真真正正的灾难降临的前兆，直到原本温顺的宠物体型慢慢转变，变得暴躁不安，瞪着猩红色的眼睛，将人们撕咬死亡。\n        直到惊慌失措的人们同样变得疯魔，皮肤慢慢变得惨白，眼中冒出了猩红色的光芒......\n        这一夜，哈维小镇彻底沸腾了，守候在家中苦苦等待救援的人们，终于等来了末日。\n        如果说那群异维度涌入的生物带给了人们末日的开端，那么这些妖艳古怪的花朵却开启了一个新的纪元。随着时间的推移，世界各地也纷纷涌入了异维度的植物，那妖艳的花朵不仅仅会让牲畜变得暴躁，也影响到了正常人类。\n        那神秘的花朵似乎是上帝给人们开的一个玩笑，它区分对待了人类。\n        一部分人失了智，变成了行尸走肉，毫无预兆的攻击周围的同伴。\n        一部分人依旧是原本模样，在发疯的人们和牲畜的攻击下，他们或者惨叫逃亡，或者苦苦抵抗，等待支援。\n        也有一小部分人，变成了天选之子，他们的身体和那些牲畜一样，发生了奇异的转化，似乎是被花香激发了体内的某种基因，这让他们拥有了特殊的能力。\n        这光怪陆离的世界的确悲惨的让人咋舌，甚至不加任何掩饰，便将所有的“不公”都赤luoluo的展现在了人们的面前。当世界各地无数花开的一刹那，有人被泯灭了意识，变成了行尸走肉；有的人依旧平庸，死走逃亡；而有人却得到了上天的眷顾，拥有了神奇的能力。\n        而伊森就是生活在这样的一个家庭之中，父子俩一脉相承，没有发疯，同样没有成为异能者，但是卡莉却觉醒了特殊的能力。\n        至于为何母亲卡莉唉声叹气，而父亲伊成功也眉头紧缩......因为，伊森作为一名士兵，已经完成了最终考核，过几天就是伊森启程去执行任务的时候了，也许是搜寻物资，抓捕猎物，也许是救援任务，也许是调查奇异物种，这些都不是他们能够左右的，唯一能够确定的是，士兵们的死亡率很高。\n        “唉......”卡莉深深的叹了口气。\n        伊森默默的看着卡莉，他知道，卡莉有些自责，她凭借着特殊的能力，在基地混上了不错的位置，却依旧无法保护好这个家，起码他无法左右伊森的命运。\n        仅从基地给出的反馈来看，从概率上来讲，10个人中，大概有5名人类会变成行尸走肉，4名依旧是平庸的普通人，1名会成为异能者。这样的概率说高不高、说低不低，她是多么希望伊森也是一名异能者，这样出行任务生存几率起码高一些。",
				"added": 1587001411
			},
			{
				"comment_id": 5,
				"body": "003 晶核\n无论在什么样的时期，信仰总是最可怕的东西。\n        而在这末日降临之后，各种各样的古怪言论更加有了孳生的土壤，在这片疮痍的大地上肆意横行。\n        有人说，这些花朵根本就不是异维度生物带来的，而是地球自己的产物，是一种自我保护机制，过载的人口数量、极度匮乏的自然资源，以及人类无休止的战争与破坏，让这颗地球岌岌可危，所以地球不愿意在包容和忍让罪恶的源泉，当然，这“罪恶的源泉”也就是所谓的人类。\n        所以，那些花朵便是地球用来清洗人类的工具。当然，这其中也包括着清洗外来的异维度生物。\n        在无数古怪的理论之中，这个理论最为盛行，无论抛出这一理论的人内心里最真实的想法如何，不可否认的是，这样的理论让他迅速拉起了一支团队，拥有了很多忠实的簇拥。\n        与正常的社会一样，末日，同样是一个人心复杂的世界。“活着”并不是所有人的目的，各种各样的势力与团体，就像那些忽然绽放的花朵一样在世界各地开花结果。\n        疯狂的世界总有疯狂的人，所以信仰才可怕。\n        不幸的是，信奉这一理论的教徒们，已经渗透进入了伊森所在的卢灵基地之中，而伊森的母亲卡莉，便是众多审讯人员其中的一个，她的天赋让她在询问犯人的时候如鱼得水。\n        从一个中式餐厅的老板娘，变成一个干练而富有能力的探员，并不需要多长时间，起码在这人吃人的社会里，卡莉想要让自己的家庭更好的生存下去，所以她选择了加倍的努力与加倍的坚强。\n        伊森的确可以被称之为幸运儿，因为他的父母双全，并且他的继母竟然是异能者。\n        末日的开端，异维度生物的涌入、发疯的人群、变异的动物与植物就已经夺走了太多太多人的生命，破碎的家庭随处可见。父母双全？这也许成为了绝大多数孩子们的梦想。\n        更别提卡莉是异能者了，异能者千奇百怪的能力在末日初期体现出了极为重要的作用，无论他们在正常社会中的职业如何，在末日初期，他们的异能都让他们迅速成为了救世主一般的存在，极为强势。\n        当然，严格意义上来讲，伊森的家庭也是破碎的。\n        亲生母亲死后，父子俩漂洋过海，来到德克萨斯州，来到了哈维小镇。父亲伊成功不仅仅是给伊森找到了一个继母，在伊森10岁的时候，父亲与卡莉同样有了爱情的结晶。\n        也许当时的小伊森对不断示好的卡莉不假辞色，但是对待自己的妹妹，伊森没有表现出一丝一毫的混蛋模样。\n        在父母的劝说与教导之下，伊森渐渐的明白自己又多了一份责任与义务，事实也的确如此，在妹妹5岁之前，伊森与她和平共处。她的小名叫莉莉，显而易见，是一个混血的小孩，那粉嘟嘟的可爱模样真的很招人喜欢。\n        而莉莉5岁之后，嗯......末日降临了，伊森再也没见过莉莉。\n        在家中大门紧锁之后，伊森曾试图破门而出，喊叫着莉莉还没有回来，但却被伊成功一把拉了进来，卡莉哀嚎痛哭的声音和表情悲怆的伊成功，让伊森意识到可能发生的事情。自那以后，伊森便再也没询问过莉莉的情况，当然，伊森也知道，那个小天使来到这里匆匆的走了一遭，便又返回天堂了。\n        想到这里，伊森放下了小酒杯，又辣又呛的苦涩酒水让他真的很难适应，身上有伤，不应该喝酒，但此时此刻，伊森却也忽略了这样的顾虑，伊森又叉起一块肉，扔进了嘴里。\n        “是的，她的确是一个小天使，带给了我希望。也许上帝不忍心看她在这个黑暗的世界里受苦，便把她带走了。”卡莉眼眶中布满了雾气，声音有些颤抖，伸出手，揉了揉伊森的脑袋。\n        伊森低头吃肉的动作微微一滞，自己不该想这些的，毕竟，卡莉能听到自己的想法。他不知道那天门外发生了什么，但是自己的父母也许是眼睁睁的看着莉莉离开人世的。\n        父亲伊成功同样愣了一下，看着母子俩的模样，便大概猜到发生了什么，举起小酒杯将白酒一仰而尽。\n        “我们做个约定。”卡莉拉着伊森的手，看着伊森漆黑的眸子，颤声道，“你不要这么急着去往天堂，你是个男孩，你很坚强，可以适应这个该死的世界，答应我，一定要安全归来，好不好？”\n        “当然，我保证。”伊森沉默良久，轻轻的点了点头。\n        卡莉担忧的眼神慢慢变了模样，职业习惯让她下意识的做出了职业反应，几秒钟之后，卡莉安心的点了点头，因为她感觉到了伊森内心中那满满的坚定。伊森并非言不由衷，也不是在欺瞒哄骗，伊森的脑海里只有这一个坚定的想法，而且无比的强烈。\n        “我们只有你了。”卡莉轻声说道，有些懊恼，“可惜，我没有办法给你弄到一枚晶核。”\n        “晶核么......”伊森笑着摇了摇头。\n        想要得到晶核谈何容易？那些闪烁着淡淡光芒的小东西绝对所有人争抢的至宝。\n        变异的动物与人群，随着变异的程度不断加深，不断的进化成长，最终脑部会形成一块精美的晶核，对于任何人来说，这就是大补，晶核会全方面提升一个人的身体素质，只可惜，它的数量极为稀少，极为珍贵，毕竟，只有在那些极为凶恶、极为强大的异维度生物又或者是极为强大的变异生物中才会产出这样的晶核。\n        卡莉作为异能者的一员，独特的异能者身份加上特殊人才的身份，让她在基地中有一定的地位，这让她获得的消息更多，手中的资源和人脉也就更多。但是，即便如此，她依旧弄不到哪怕一枚小小的晶核，可见晶核的珍贵程度。\n        伊成功组织了一下语言，苦苦劝道：“我们不是什么天选之人，不是强大的异能者，但是，伊森，你同样不是人们口中的下等贱民，你的努力我们都看在眼里，晶核也许是你的出路，但是，孩子，这次出行任务一定要小心再小心，千万不要因诱惑而丧失生命。”\n        “关于这一点，我比你更清楚。”伊森点了点头，并没有半点气馁，他在这个基地里受训、在米兰达的魔掌下每日每夜在生死线上徘徊，他不仅仅是一个17岁的青年，同样，也是一个经验十足的优秀士兵。\n        有关于身体和意志上的训练，可以让伊森与正常世界普通的青年区分开来。\n        伊森的确没有强大的血脉，并不是什么天选之子，他认清了这个事实，但却并不认命。晶核给了伊森无限的可能，足够他在这末日里走的更远，又或者，这也是他唯一的出路。\n        在刚开始的时候，只有异维度生物的脑袋里有晶核，而在末日降临的第二年里，就连被花朵感染的地球动物脑袋里都出现了晶核，这证明了什么？证明了那些动物在进化，随着时间的推移，想要跟上时代的脚步，伊森必须走上吞食晶核这条道路。\n        伊森理解父母的担忧，所以，如何获取晶核这种东西，方式方法便显得尤为重要。",
				"added": 1587001429
			},
			{
				"comment_id": 6,
				"body": "004 异能者\n一周的日子转瞬即逝。\n        基地中一个偌大的房间里，7个士兵三三两两的聚在一起聊天，或站或坐，大多都压抑不住内心中复杂的情绪，能够看得出来，无论这些士兵们心理素质如何过硬，这样的“审判日”依旧会给他们带来困扰。\n        就在他们闲聊的时候，一个年轻人走了进来，这引起了他们的注意。\n        黄种人？这也许是大多数士兵的第一反应，在这基地中，黄种人的数量并不多。\n        只见这个陌生的年轻人大概17、8岁的样子，一米八左右的身高，身形挺拔，身材虽然与“壮硕”不搭边，但是绝对不瘦弱。\n        他黑色的短寸发干净利落，下方是一张略显青涩的面庞，但是那一身颇为英武的战斗军服给他加了不少分。年轻人在众人的关注之下，并没有任何的尴尬或者腼腆情绪，他只是默默的走到墙角，漆黑的眼眸同样在打量着在场的每一人，显现着与年龄不符的沉稳。\n        这样的对比很有趣，他的脸蛋还有些青涩之气，任何人都看得出来他的年龄并不大。但是他的行为表现却很沉稳，且气场十足。\n        “这小子是谁？”\n        “不会是护送咱们的异能者吧？”\n        “不，咱们基地两组异能者的基本资料我们都掌握，这小子显然不是其中之一。”\n        “通讯士兵？”一众士兵们窃窃私语着，纷纷好奇的看着这个陌生的小鬼。\n        多了不说，起码伊森是全副武装进来的，那么这个年轻的小伙子很有可能与他们一起出行。\n        “哈哈，伊森，我就知道你可以的！”其中一个士兵不顾周围士兵的窃窃私语，一脸的兴奋和喜悦，大步来到伊森面前，伸手狠狠的怼了伊森胸口一拳，然后直接给了伊森一个大大的拥抱。\n        与伊森一同训练并且考核的同期学员们足有20人，而在这个小队伍中，伊森只看到了一个曾经的战友，在这个制度森严的基地中，伊森并不能获得更多同伴的消息，也许剩余的战友们死了，也许没通过考核被派往了普通作战部队，又或者，他们通过了考核，被编入了其他特战队伍中。\n        “里皮。”伊森眉宇间同样带着一丝重逢的喜悦，轻轻的敲打着里皮的背部，这家伙是拉美裔，深棕色的皮肤，有着一头浓密的天然卷发，说着一口怪异腔调的英语，有着一双明亮的大眼睛，身高一米八左右，和伊森身材相仿。\n        这家伙是个乐天派，在过去沉闷的训练考核日子中，里皮受到了绝大多数同期学员们的欢迎，生在这个时代本就很残酷了，没有人会拒绝一个带给他们快乐和正能量的年轻人。\n        里皮咧着嘴，露出了一口白牙，笑容非常的阳光，随即嘴里细细碎碎的念叨着：“我就知道，哈哈，我就知道，就算我们都通不过，你这家伙一定会通过的，你这个天天自残自虐的疯子......”\n        “原来是新的战友么？”士兵们听着里皮的话语，更加好奇的看向了伊森。\n        “你知道吗，这个破基地太不人道了，我的考核项目竟然是2头异种恶犬，卧槽，那血盆大口看得我一愣一愣的......”\n        伊森顿时感觉一堆苍蝇在自己的耳边环绕，重逢的喜悦是如此的短暂，伊森不得不容忍里皮话痨般的碎碎念。\n        “我刚进去，它一嗓子就吼了过来，你知道我的第一反应是什么吗？老子手上什么武器都没有，但我本人就是最棒的武器，我一嗓子也吼了回去，给它们也吓得一愣......”\n        伊森：“......”\n        “你手无寸铁？周围应该有冷、热武器吧？陷阱，诱饵那些东西？”伊森忍不住开口询问道。\n        “诶？”里皮习惯性的挠了挠头，尴尬的笑道，“我就趁它们愣神的时候，跑到桌前拿起了一把步枪，连跑带颠的把它们射烂了......最后考核成绩是C-，我说我的成绩怎么这么低，现在想想，房间里好像还有很多道具......”\n        伊森嘴角微微抽了抽，这种过关的方式也是奇葩，恐怕考官也想不到那变异恶犬会被里皮一嗓子吓到。\n        “不说我了，你的成绩是多少？有没有达到B？你的考核项目是什么？”里皮嘿嘿的笑问道。\n        伊森的成绩岂止是B，如果仅仅是B的话，他也不会引起基地中所有队伍的注意。\n        伊森摇了摇头，里皮还没等继续询问，就听到门口处传来了士兵的声音：“他们来了，异能特战组的人。”\n        “集合。”门口处的士兵急忙跑回来喊道，短短几秒钟的时间里，8名士兵便列队完毕，房中落针可闻。\n        “咚咚咚。”伴随着手指敲打铁门的声音，一个身高两米一开外的黑人男子走了进来，目光扫过整齐排列的士兵过后，在伊森的身上驻留了一会儿，一步步的走到了队列前方，他还未等说什么，就听到身后传来了自己异战组队友的声音......\n        “呦呵，这不是那天的那个小鬼吗？”这是一个白人青年，有着一头飘逸的金发，颇为英俊的脸蛋，但是他的眼神却并不友好，脸上带着一丝鄙夷之色，道，“亲爱的，你可真不幸，竟然被分进了这支队伍。”\n        虽然金发青年嘴里说着“亲爱的”，但是任何人都能听出来他语气中的嘲讽，更何况他那鄙夷的眼神已经将他的态度表明的很清楚了。\n        这样的态度，让一众士兵们纷纷心中诧异，所有人都能看得出来，这个白人异能者在针对伊森。这个陌生的年轻人多大的胆子，怎么会去惹异战组的人？\n        最后走进来的，是一个身材凸凹有致的亚裔女性，一头俏丽的黑色短发散落耳际，眼眸稍显柔和，道：“约翰，少说两句。”\n        “哼。”被称作约翰的青年冷哼了一声，“小子，我告诉你，那天只是我疏忽大意了，你最好......”\n        “约翰！”前方如铁塔般的黑人男子厉声喝道，终于制止了约翰的话语。\n        异能者约翰也悻悻的离开，走到了高大黑人男子的身后。\n        伊森默默的伫立在队伍后方，自始至终，伊森都没有回话，甚至没有半点的反应。\n        “你认识他？”身旁的里皮悄声询问道。\n        “你不是问我考核项目是什么吗？”伊森默默的说道。\n        里皮：“嗯？”\n        伊森：“就是刚才那个异能者。”\n        里皮：“哇！？你...你......（你竟然比我还皮？）”\n        “好，列队，报名！”足以称之为“黑熊”的高大黑人男子开口呵道。\n        “1！”\n        “2！”\n        “3！”\n        ......\n        ......\n        “7！”\n        “8！”\n        “无论你们之前的代号是什么，无论你的姓名是什么，在我的团队里，你刚才报出来的数字就是你的名字。”黑人壮汉大声道，“我叫威尔逊，旁边是我的异能组队员约翰和凯特，我相信你们都清楚的知晓我们的能力，我对你们的教官很有信心，他一定教导过你们所有应该具备的情报。”\n        “你们只需要记住我们的名字就可以，至于你们自己，那些都无关紧要。”威尔逊冷笑一声，“培训过后你们并没有被打回普通部队，这证明了你们还是有点价值的，不过，这次任务过后你们依旧可能所剩无几，所以你们的名字没必要被我们记住。”\n        “你们以为通过单人考核就算是进入了特战队了是吗？我告诉你们，这次的任务，是团队考核，在你们活着回到基地之前，千万别说你们是特战组的一员。”黑熊般的威尔逊不怒自威，目光扫视着众人。\n        士兵们神情肃穆，现场鸦雀无声。没有人会质疑黑人威尔逊的话，也没有人愿意行为跳脱，引起异能者的反感，毕竟有了这三名异能者带队，这无疑提高了他们的成功率和生存几率。\n        “很好。”威尔逊特目光巡视众人，道，“我们这次的任务目标，是前往萨尔镇调查一个特殊的家伙，根据2支队伍上报的信息，他们在萨尔小镇发现了一头进化后的丧尸。”\n        进化后的丧尸？听到这个消息，士兵们心中微微惊讶。\n        物种进化已经不是什么稀奇古怪的事情了，包括异维度生物在内，地球上的家畜、野兽也会随着时间的推移，实力不断强大，最终在脑部形成一枚晶核。\n        但是在末日降临的两年之中，被花朵感染的发疯的人，却从未进化过，原因当然是因为那些被称之为丧尸的家伙们行动缓慢，智商低下，他们只是发疯了，保留了动物的本能，吞食一些能够扔进嘴里的食物。\n        相比于那些地球上的家畜、野兽来说，丧尸是低等级生物，毕竟他们的身体素质很差，这种低级别生物也进化了？\n        “不出意外的话，这头进化后的丧尸脑部会有一枚晶核，我要提醒你们，千万别被这样的诱惑蒙蔽了双眼，这枚晶核要上交给基地，如果谁在狩猎的过程中有小动作，我不会心慈手软的。”威尔逊的面容刚毅，话语愈发的冰冷了起来，“你们都清楚，食用了晶核之后会变得无比强大，但是与此同时，你们的脑部也会形成晶核......”\n        “所以......你们最好都小心点，我的任务是获得这枚晶核，从丧尸的脑袋里拿也好，从你们的脑袋里拿也可以！”威尔逊阴测测的眼神来来回回的在众人身上巡视着。",
				"added": 1587001454
			},
			{
				"comment_id": 7,
				"body": "005 恶魔邀请\n威尔逊虽然眼神阴冷，但是风格却是开门见山，颇有点明人不说暗话的意思，没有多余的弯弯绕绕。\n        “在这支团队里，只允许有我一个人的声音，你们只需要做到令行禁止！然后让我带着你们这群软弱的婊子完成任务，平安归来，听明白没有！？”威尔逊的声音突然提高了不少，甚至有些震耳朵。\n        “明白！”\n        “明白！”\n        威尔逊继续喝道，声音洪亮：“大声点，小婊子们，听明白没有！？”\n        “明白！！”\n        “明白！！”\n        威尔逊满意的点了点头，道：“很好，10分钟准备时间，D1起降机处集合。”\n        威尔逊说着，带着两名异能者离开了房间。\n        “哇，这大黑熊气势很足啊，很凶悍哦，你说他一嗓子能不能吼退异种恶犬？”里皮轻轻撞了撞伊森的肩膀，嘴里嘟囔道。\n        伊森：“......”\n        三名异能者刚离去不久，门口处，一道口哨声传了过来：“嘘~”\n        一众检查装备的士兵们纷纷转过头去，却看到了一个身材极为高挑、曲线极为傲人的短发女性。\n        “特战三组组长米兰达？”里皮咽了口唾沫，眼睁睁的看着传说中的人物出现在自己这个新兵面前，女人那双明亮的美眸让里皮的心脏剧烈的跳动了起来，急忙低下头，躲过了那肆意的目光，嘴里悄声嘀咕着，“别选我，别选我，我不要去三组，我不要去三组，哇...上帝，耶稣，我为什么要通过考核，我装装样子，被打回普通部队多好啊，哇...妈妈......救我......”\n        “她在向我招手，完了，完了。”里皮看到门口处那个基地中有着赫赫威名的恶魔组长正在向自己招手，里皮的心都凉了。\n        在这基地中，分为几种部队，有普通的士兵团队，以及特战组和异战组。\n        普通士兵团队不用过多的解释，他们算是末日里各大基地、城市中最为基础、最为庞大的守备力量，是一个基地存亡的基石。\n        特战组，便是伊森这类从普通士兵队伍中精挑细选出来的人，经过地狱般的特殊培训，通过考核顺利毕业后，所组建的特殊战斗小队。\n        异战组，便是那些具有战斗异能的异能者，再经过严格训练，具备强大的战斗技巧、素养的人。\n        如果里皮能够从团队考核项目中活着回来，他的归宿一定是特战组，但是在这个二级基地中有7个特战组，每个组都有着自己的特点。\n        特战第三组，无疑是基地中最具盛名的队伍，甚至能够直逼异战组团队，它的队员们都是精英中的精英，他们接的都是最难的任务，与此同时，死亡率也是高的出奇。\n        所以，三组的人才总是稀缺。\n        有信仰的士兵们将三组视为毕生的追求目标，而想要生活的好一点，给家庭、亲人提供好一点生活条件的特战士兵们，却不想要进入三组。\n        他们只需要进入特战序列就已经足够了，他们会有着更优渥的条件养家糊口，同时能够尽可能的保证自己的生存几率。\n        “里皮。”伊森颇为无奈的看着身旁疯狂祈祷的里皮，开口打断了他的自言自语。\n        “Huh？”里皮又咽了口唾沫，即便是一个简单的回应，都能听到他的声音有些颤抖。\n        “你真的认为C-的成绩能够入的了她的法眼？”伊森颇为无奈的看着里皮。\n        “诶？也对哦。”里皮紧张的心情放松了不少，随即，他意识到了什么，伸手急忙抓住了伊森的肩膀，脸上带着一丝担忧，开口道，“别去。”\n        一时间，伊森的动作也僵滞了下来。\n        “嘘~”门口处，米兰达再次吹了个口哨，对着伊森勾了勾手。\n        伊森看向了门口处的米兰达，又转头看向了身后的里皮。\n        里皮稍显尴尬，却没有松开握紧伊森肩膀的手，有些讪讪的说道：“我就知道，你的考核项目是刚才那个叫约翰的异能者，而且你现在站在这里，证明了你通过了考核，所以......那个恶魔一定是来找你的。”\n        “嗯。”伊森点了点头。\n        “别答应她，那里的死亡率很高。”里皮的声音越来越小，却足够让伊森听的清楚，“单项考核过后整整7天，我们20人的团队，我只看到了你，伊森......”\n        伊森张了张嘴，却半天没有说出话来。\n        其余的士兵们同样看到了这样的景象，三组组长在这基地中威名赫赫，起码这群特战预备役的士兵们是无人不知、无人不晓的，这样的一幕意味着什么，所有人都清楚。\n        士兵们的心态不一，有的神情复杂，有的眼含羡慕，但是不出意外的是，更多的人是庆幸的松了口气。\n        “抱歉，我不该这样左右你的意志，我应该尊重你的选择。”里皮深深的吸了口气，还是悻悻的松开了手掌，有些担忧的脸上再次挂起了阳光般的笑容，露出了一口洁白的牙齿，“毕竟，你和我们不是一类人，对吗，自残自虐者。”\n        说着，里皮松开了紧握在伊森肩膀上的手掌。\n        伊森堪堪的说不出话来，犹豫半晌，还是没有回应，迈步走向了米兰达。\n        “你的战友？”米兰达看着伊森走近，她天蓝色的眼眸微微移动，跃过伊森的肩膀，落在了远处里皮的身上。\n        里皮意识到了米兰达那灼灼的眼神，一瞬间，里皮不自然的转过身去，步伐僵硬的走向房屋内部，试图离开米兰达的视线范围。\n        “同期学员。”伊森点了点头，在曾经出生入死的战斗任务中，战友之间留下的情谊是很难表述清楚的。\n        如果非要表述一下的话，那么可以这样说，里皮是一个可靠的战友，伊森愿意在生死战中，将背后的视野盲区留给他。这句话就足以表明一切了。\n        米兰达向前迈步，目光锁定着里皮，低下头，红唇凑在伊森耳旁轻轻吐出一句话语：“那小子跟你说了什么？”\n        “让我小心点，这基地里谁都知道你的恶名。”伊森的回应倒也属实，米兰达的名声可以有两种理解，威名赫赫，亦或者是臭名昭著。\n        “呵呵。”米兰达笑着摇了摇头，伸手夺过了伊森手中的突击步枪，动作迅捷的检查着枪械，随意道，“上面答应了我的请求，这次任务回来，你就算通过了团队考核项目，从那以后，你就是我的人了。”\n        “嗯。”伊森看着米兰达检查枪械时那让人眼花缭乱的动作，轻轻的点了点头。\n        米兰达随手将枪械按在伊森的怀里，顺势将伊森身上的装备检查了一圈，最终满意的点了点头。\n        在伊森诧异的眼神注视下，米兰达将自己腿侧的战术匕首拿了出来，送到了伊森的面前。\n        伊森下意识的接住了这款双刃半尺格斗刃，这通体漆黑的半尺格斗刃锋利异常，刀刃处闪烁着冰冷的锋芒。\n        “活着回来。”米兰达轻声说道，伸手轻轻的拍了拍伊森的脸蛋，迈着长腿转身离去。\n        伊森听着那渐行渐远的沉重军靴声，深深的叹了口气。\n        活着回来。\n        这样的要求，又有多少人敢信誓旦旦的说自己能做到呢？",
				"added": 1587001479
			},
			{
				"comment_id": 8,
				"body": "006 希望如此\n“这样的行为很幼稚。”异能组成员，亚裔女性凯特背靠在升降机旁，一边调试着手中的枪械，一边开口说道。\n        “huh？”约翰捋了捋金色的中长发，转头看了一眼凯特。\n        “你听到了我在说什么。”凯特冷哼了一声。\n        “我只是不愿意和这样的杂种当队友。”约翰冷哼了一声，眼中满满的都是愠怒之色。\n        约翰有这样的反应，恐怕在所谓的考核之中，他吃了大亏。\n        “你让一个手无寸铁的普通士兵在面对一个异能者的时候怎么做？你认为他们该有什么样的反应？跪地求饶？”凯特的笑容中带着一丝调侃。\n        “闭嘴。”约翰皱了皱眉，实话总是很伤人。\n        “你已经是幸运儿了，那该死的花给予了你特殊的天赋，光明正大的情况下，面对着手无寸铁的他们，我们几乎是不可能被战胜的。”凯特的话语里似乎还带着一丝淡淡的嘲讽，“下次注意就好了。”\n        “你凭什么教训我？”约翰随手一招，凯特手中的枪械突然飞出，被约翰拿在了手里，“你怎么不注意？”\n        “呯！”\n        让人意想不到的是，凯特的速度惊人的快，在枪械脱手的一瞬间，右手从右腿外侧一抹，一柄手枪对准了约翰，并且在所有人反应过来之前，凯特毫不犹豫的扣响了扳机。\n        子弹擦着约翰的头皮飞了过去，一缕金色的中长发飘散下来，还带着丝丝血迹。\n        “永！远！不！要！拿！走！我！的！枪！”凯特一字一句的说道，心中怒火中烧。\n        约翰同样眼眸阴冷，随手将凯特的枪械扔在地上，一手揉了揉自己的脑袋，放到眼前，看到了丝丝血迹。\n        “你找死！？”约翰阴声问道，抬眼看向了凯特。\n        “我可以容忍你平日里的臭脾气，因为你是我的队友，但是在执行任务的时候，请你头脑清醒点，这关乎到所有人的性命。”凯特眼眸冰冷，同样毫不退让，身子紧绷，怒声说道，“如果你想，我可以提前消除不稳定因素。怎么？试试？”\n        出乎所有人预料，这个看起来颇为文静且冷静的女人，竟然有着如此强势的态度，而且从她的表现上来看，她似乎是一个说到做到的人。\n        好吧，拥有异能，并且能够进入异战组的人，哪一个不是心高气傲的？谁都有自己的脾气，都有自己的骄傲。\n        “你们两个，闭嘴。”威尔逊的声音异常严厉，“立刻！”\n        话语落下，一众队员瞬间便没了声音。\n        看的出来，这个威尔逊在队伍中威信十足，与此同时，这支异战小队并没有想象中的那么融洽。\n        休息时间转瞬即逝，一众士兵已然整装待发，来到了约定的地点。伊森明显感觉到了三位异能者之间的气氛不对，但是这并不是他能够左右的了的，随着威尔逊一声令下，队伍开拔。\n        伴随着平台升起，众人下意识的遮住了双眼，长时间在阴暗环境下生存的他们，显然无法在第一时间适应太阳光。\n        是的，整个卢灵基地都是在地下建立的。\n        一旁，一个士兵深深的吸了口气，如此新鲜的空气是地下基地远远无法相比的。\n        刺眼的阳光，沁人心脾的空气，在这荒郊野岭之中，绿树成荫，时而的鸟语伴随着诱人的花香，让所有人都有一种梦幻般的感觉。\n        也许，对于人类来说，这的确是末日。但是对于地球来说，却是天堂。\n        如果地球真的能开口说话，或许它会表示，它宁愿让异维度生物涌入地球，也不愿意让罪恶的人类继续统治这里。\n        8个特战预备役士兵，3名异战组成员，3辆军车缓缓开拔。\n        “嘿，伊森，那火辣的妞儿是不是要你加入特战三组？”里皮坐在伊森的身旁，开口询问道，身形随着车辆的行驶而不断的摇晃着。\n        而伊森正在看着地图暗暗发呆。\n        萨尔小镇，这个城镇的名字伊森并不陌生，距离卢灵基地100多公里，很快便能达到。\n        但这并不是让伊森发呆的原因，因为......萨尔小镇距离哈维镇很近，特殊的历史条件造就了特殊的城镇文化，哈维镇距离萨尔镇不到30公里。\n        而哈维镇，就是伊森的家乡，那里有伊森的童年，有他曾经生活过的家，读过的学校，以及那个活在他记忆中的妹妹。\n        “伊森？伊森？”里皮的话痨属性让他的脸皮特别厚，不断的摇晃着伊森的肩膀，不断好奇的询问着。\n        “嗯，是这样的。”伊森从记忆中清醒过来，收敛了一下情绪，转头看向了身旁深棕色皮肤的里皮。\n        “这可真不幸。”里皮嘟嘟囔囔着，“再见到你就不知道是什么时候了。”\n        “先想好怎么从这次考核中平安归来吧。”伊森示意里皮集中注意力。\n        “哈，不用担心我，我一直受幸运女神的眷顾，告诉你一个秘密，这是我的......”里皮伸手摸了摸脑门上绑着的战术目镜，又开始说起了他全世界都公开的“秘密”。\n        “是的，你的祖父留给你的，我知道，我知道......”伊森无奈的说着，坐在无棚军车中的他，看向了天空，车辆很快进入了公路，路面也平整了许多。\n        伊森伸出手，挡在眼前，微微眯着双眼，阳光透过指缝洒在他的脸上，伊森深深的吸了口气，清新的空气让人精神一振，沁人心脾。\n        初秋这幅天高云淡的景观的确让人心旷神怡。\n        这样的团队考核，说简单不简单，但说难也不难。\n        事实上，在这末世之中，人们宁愿去面对行动缓慢的行尸走肉，也不愿意去面对那些变异的动物和植物。这是末日的准则之一，在这一点上，基本上所有人都能达成共识。\n        在危险度排名上，异维度生物危险程度最高，其次就是变异植物，它们的危险程度要远远高于变异动物和行尸走肉。\n        甚至有些古怪植物能够长到数米乃至数十米之高，更让人感到惊悚的是，有些稀奇古怪的变异植物甚至可以杀人于无形之中，正如同那些妖艳的花朵一样，那些古怪的植物飘散出来的香气也许就能将一个人毒死。\n        再次就是变异动物，作为一个普通人，即便是面对着普通的家畜，比如牛马羊等动物，一旦它们发起疯来，人们极有可能凶多吉少，更别提那些被花朵改造之后的“凶兽”了，它们不仅疯癫力大，速度也快的令人发指。\n        威胁程度最低的，反而是那些由人类感染而成的行尸走肉团队，他们并没有多少智商，而且行动缓慢，普通的枪支弹药便能够解决。\n        整个地球就是一个大的环境，而在这自然界中，当然存在着“领地”这一说，被丧尸们割据了的城镇，当然会有凶兽出没，但不同种族也会向对方发起进攻，显然，丧尸的人海战术能够起到作用，他们渴望着血与肉。智商不高、无所畏惧的他们，会付出任何代价，去分食变异牲畜的血肉。\n        就目前情况来看，末日降临的第二年，城镇依旧被那些丧尸们牢牢占据着。\n        不出意外的话，伊森所在的这只团队，依靠着交通工具和武器，完全可以做到无伤通行，毕竟他们都是训练有素的战士，而且还有几名异能者为他们掠阵。\n        仅从任务的角度来讲，既然任务地点在萨尔小镇之中，那么他们面对的可能仅仅只有发疯的丧尸群，以及一头进化后的丧尸。\n        希望那些误入城镇的凶兽们已经在尸潮之中尸骨无存了吧......\n        希望，\n        希望如此。",
				"added": 1587001495
			},
			{
				"comment_id": 9,
				"body": "007 自取其辱\n“哒！”\n        伴随着一声枪响，一头行动缓慢的丧尸栽倒在地。\n        殷红的血肉洒了一地，融入了这座破旧小镇的背景之中，是的，在这里，血迹和碎肉随处可见，散发着令人作呕的气息。本就破败的小镇在经历了末日的洗礼之后，更是满目疮痍。\n        嗡嗡不断的苍蝇缭绕在片人间炼狱，让人们不由得掩住口鼻。也许智商低下的丧尸不会咬碎那些普通平民，但是瘟疫却可以夺走人们的性命。\n        透过那支离破碎的披萨店，士兵们也许还能联想到末日之前正常世界的模样，也许那个世界同样险恶，但却没有表现的如此赤.裸。\n        “这里...这里也太干净了？”里皮望着窗外，眼神在这破旧的小镇上来回巡视着，有些躁动不安。\n        不仅是里皮有这样的反应，几乎所有的士兵们都有些躁动，他们纷纷惊讶的看着这个破败的小镇，不知道这里到底发生了什么。\n        是的，这里过于干净了。\n        如果按照常理来讲，那么这种被攻陷的小镇会是一片血海尸山，而此时映入众人眼帘的，却是那些洗刷不掉的血迹和零零星星的残肢碎肉，竟然连一具尸体都没有？这是什么情况？\n        前方驾驶位置的士兵突然眉头一皱，他感觉自己眼花了，从后视镜中，士兵看到了刚才己方射杀的丧尸尸体，竟然被一个人形生物拖拽着离去了，而且那个人形生物的速度极快，转眼间就消失在了街道中，身影没入了深巷里。\n        人类？是人类吗？毕竟丧尸的移动速度再怎么快，那也是属于“走步”的范畴。如果是人类的话，那个神秘人为什么要拖走丧尸的尸体？\n        “车辆6点钟方向，发现进化丧尸。”通讯器中，适时的传来了一道女性嗓音，来自异能者的凯特！\n        本方军车中，握着方向盘的士兵心中微微一震，自己看到的那个神秘人，就是己方的任务目标？那头进化后的丧尸？\n        “进入街道南侧建筑，它在奔跑...西南方向，它手中应该拖着一具尸体，它的目的地一定在西南方向。”凯特言之凿凿的说道，“快跟上去，再远我就听不到了。”\n        听不到？什么意思？这是这个女人的特殊能力吗？\n        如果有士兵在异能组军车上的话，一定会记住这样特殊的一幕，因为这个女人真的没有看过所谓的任务目标，她的确是在闭着眼睛倾听。\n        “走。”威尔逊的声音干净利落，领头的军车一个潇洒的漂移，飞快的跟了上去，连带着，身后两辆军车也改变了行进方向。\n        驾驶位置上，约翰不屑的嘀咕道：“装神弄鬼。”\n        凯特猛地睁开眼，却被一个巨大的身影挡住了视线，队长威尔逊半截身子已经露出了车棚之外，巨大的手掌支起了重机枪，大声吼道：“位置，凯特，执行任务！每一秒都要告诉我它的位置！”\n        “车队正前方，任务目标三百米。”凯特再次闭上了眼睛，微微歪着头，“它要出......”\n        凯特的话语未落，重机枪的轮盘已经开始转动，一连串沉重激烈的枪响声打断了一切，威尔逊对着飞快奔跑的丧尸疯狂的扫射着。\n        所有人都能感觉到事情的不对劲儿，这古怪的城镇诡异至极，威尔逊的思路非常的清晰，不管那进化丧尸拖着尸体去哪里，只要它被自己的重机枪轰烂，那么己方就算是完成任务。\n        威尔逊是经历过大场面的人，执行过各种各样的任务，他敏锐的感觉到了这件事背后的蹊跷，所以，无论如何，如果能在这空荡荡的城镇中将变异丧尸击杀，夺取晶核后直接返回卢灵基地，那就是最好的结果。\n        让威尔逊意想不到的是，那头进化后的丧尸身手敏捷，速度奇快，在这片死寂的小镇里，它就是最显眼的异类，它拖拽着一具尸体，身体却闪转腾挪，速度丝毫不减，而且它似乎也具备了一定的智商，不仅学会用手中的尸体充当挡箭牌，而且还尽可能的向建筑后躲去，移动向众人的视野盲区。\n        但是在激烈的火力压制之下，进化丧尸最终一个翻滚冲进了一个半坍塌的建筑之中。\n        呲！呲！呲！\n        三道急刹车的声音瞬间传来，军车上的士兵们迅速下车，严阵以待。\n        失去了重机枪的枪炮声，整个城镇再次陷入了一片寂静，如此诡异的气氛让人感觉有些心慌。\n        “呃......”细细碎碎的声音从不远处的街角传来，众士兵精神紧绷，做出了标准的战斗姿势。\n        呯！\n        刚刚走下军车的凯特连头都没转，目光一直紧盯着眼前的建筑，抬起右手，随手就是一枪，远处街角一头普通丧尸轰然倒地。\n        是一头被声音引来的普通丧尸吗？正常来说，它们才应该是末日里的主力大军，但是看看这周围的环境，它们反而成了稀有生物。\n        凯特深深的吸了口气，面对着建筑，闭上了眼睛，随即打了个手势。\n        威尔逊指了指第二军车上的四名士兵，做出了几个手势，呈突击队形，慢慢的摸向了废弃建筑。\n        “哒！”\n        就在这时，传来一声枪响，让所有人都愣住了。\n        凯特猛地睁开双眼，转过头，却看到伊森以标准的姿势端着手中的M4A1，枪械上的镭射红外线指示器光点落在对面高楼墙壁之上。\n        “你在干什么？”凯特声音愠怒，却没有得到伊森的任何回应。\n        正常情况下，凯特是不会恼怒的，毕竟未被选入突击队的伊森本就是担任戒备的角色，如果周围出现丧尸，伊森就该开枪消除隐患。\n        但是，凯特是一名异能者，她除了倾听到废弃工厂中的那头进化丧尸之外，她并未感觉到周围有任何其他生物！\n        所以，这一声枪响，只可能是某个菜鸟失误造成的！\n        她的眼眸顺着伊森枪口方向望去，最终落在了街对面高楼楼顶，如此突如其来的一幕也打断了突击小队的行动进程。\n        “菜鸟，难道你手抖吗？你的心理素质都喂了狗吗？”约翰的手狠狠一挥，下一刻，伊森手中的枪械脱手而出。\n        接下来的一幕，却让异能者凯特惊讶不已，因为伊森接下来的动作让她有种似曾相识的感觉。\n        只见伊森在突击步枪脱手的一瞬间，左手从腿侧一抹，黑洞洞的手枪口一定对准了约翰的脑门，只不过，相对于凯特来说，伊森并没有叩响扳机。\n        一连串的动作行云流水，这应该是下意识的动作，而非有意为之。真正有意为之的，反而可能是伊森克制住了自己，未叩响扳机。\n        “嘶...吼......”一道尖利的吼声从高处传来，那个方向，正是伊森刚刚射击的方向。\n        什么情况？\n        众人顺眼望去，只见一个银色皮肤的人形怪物微微冒出了头，皮肤上还流淌着如岩浆般橙黄色的血液，血盆大口向下滴着口水，猩红色的眼眸望着众人，微微一个翻身，从高楼上栽了下去。\n        它的身子飞快下滑，而那双利爪插进了高楼侧壁中，减缓着冲势。这一切众人都看不到，毕竟被大楼遮挡了视线，众人却听到了“扑通”一声！\n        紧接着，那个刚刚出现在街角被击毙的普通丧尸，被一个银色的利爪抓住了脚踝，慢慢的向后拖拽，消失在众人的视线中。\n        周围的一切再度陷入了一片死寂。\n        “咕嘟。”面对着如此诡异惊悚的一幕，里皮咽了口唾沫，道，“那个，那个...女士，你没听到还有一头进化丧尸？”\n        凯特表情凝重，制止了团队一切行动，道：“现在可以了，它太轻盈了，只有当它拖拽尸体之后，我才能听的清楚，现在......”\n        凯特瞳孔微微一缩，因为她也失去了隐匿在身旁的废弃工厂中那头进化丧尸的消息，显然，对方放弃了拖拽尸体，选择了潜伏。\n        “任务目标与情报不符，他们只说有一头进化丧尸，从现在的情况来看，起码2头，甚至可能更多，这该死的萨尔镇。”约翰皱着眉头说道。\n        一众训练有素的士兵们早就摆出了防御阵型，紧盯四周，等待着队长威尔逊的下一步命令。\n        “凯特都听不到，见鬼，我们失去了优势！如果几个进化丧尸的目标是我们，我们现在都不一定活着了！”约翰继续说道，“甚至，我们现在就有可能被那些怪物包围了！一切都因为凯特的能力失灵了！”\n        “我的能力从未失灵，它们进化了，它们更加迅捷、灵活，身形更加轻盈！你看不到吗！？”凯特怒声喝到。\n        “现在不是争论的时候，先离开这里！这是命令！”威尔逊当机立断。\n        伊森快走两步，拾起了自己的枪械，与此同时，一道阴冷的目光落在了伊森的身上。\n        伊森起身返回军车，转头默默的瞟了一眼约翰，对方的眼神中尽是阴厉之色。约翰整个人都要被气炸了，两人的梁子早在毕业日考核那天就结下了，刚刚约翰想要羞辱伊森，却不想，那边真的有进化丧尸逃脱了凯特的超级听力，所以约翰的举动反而变成了自取其辱。\n        更让约翰恼火的是，伊森面无表情，毫无反应，沉闷的像一块石头。\n        约翰冷哼一声，转头开门进入了军车。\n        也就在这一瞬间，伊森整个人似乎活了过来，那眼眸中流露出来的情绪，与刚刚的约翰如出一辙。",
				"added": 1587001511
			},
			{
				"comment_id": 10,
				"body": "008 死亡倒计时\n 一众士兵急忙上车，谁都不想在这死气沉沉的阴森小镇里多驻留哪怕一秒钟。\n        “它走了。”凯特突然开口说道。\n        “嗯？”\n        “它拖着尸体离开了。”凯特非常确定的说道。\n        “嗯，那样也好，我们先回基地。这个城镇的情况太过诡异，新出现的进化丧尸实力出乎我们预料，想要调查清楚这件事，不是我们一支团队能够完成的了的。”威尔逊的决定让士兵们松了口气。\n        在一片沉默中，三辆军车立即开拔，原路返回。\n        车辆行驶过半个废弃的城镇，副驾驶的约翰终于忍受不住，恶狠狠的说道：“妈的，见鬼。”\n        “闭嘴！”凯特突然开口打断了约翰。\n        “怎么？”约翰的脾气真就是一点火就着，刚刚他的反应所有士兵都看在眼里，本来是羞辱伊森，结果反而自取其辱，更恶心的是，他还让伊森用枪口对准了脑门，这要不是伊森控制住了，那后果不堪设想。\n        这样的一幕让约翰恼羞成怒，异能者的身份让他在基地中作威作福，平日里敢跟他对着干的也就是组里的几个异能者，现在连个普通士兵都能让他脸面无光，约翰何时受过这样的屈辱？\n        约翰还想说什么，就听到凯特惊声喝道：“它们来了！追来了！”\n        “什么？”约翰眼眸放大，暂时放下了心中怒火，从凯特略显慌乱的声音中能够听出来这事情的严重性。\n        “凯特？”威尔逊表情凝重，开口询问道。\n        “很多，异种恶犬！16、7头，还有...还有进化后的丧尸！起码两头！它们在包抄我们！”凯特惊声说道。\n        “你他-妈-的不是听不到进化丧尸的脚步吗？你-他-妈-的在逗我？”约翰怒声吼道，“另外你疯了吗？它们是不同的物种！它们不会共同捕猎的，它们甚至不会和谐共处！”\n        “它们在全力奔跑，它们...哦，我的上帝。”凯特根本就没有理会约翰，她的话音刚刚落下，通讯设备中就传来了其余军车的汇报声：\n        “队长，发现情况，是异种恶犬的身影！”\n        “队长......它们的速度太快了！”\n        威尔逊大声命令道：“加大马力，冲出这个镇子！”\n        威尔逊一边说着，半截身子露出了军车之外，双手握紧了重机枪。\n        “凯特，告诉我它们的位置！”威尔逊的声音从车上方传来。\n        “它们...它们在...”一向沉稳的凯特彻底慌了，嘴里吐出了一个让人无法相信的事实，“它们...无处不在。”\n        “妈！的！你这没用的婊子。”约翰握紧了双拳，在死亡降临的前一刻，人们会做出什么样的反应都不为过。\n        “左边的路，左边，快，顺着镇边缘，顺着丛林公路冲出去。”凯特惊声尖叫道，“那里没有！”\n        军车上唯一的普通士兵面无血色，抓着方向盘的手都有些颤抖，车辆急忙向左侧驶去。\n        身后，是两辆飞驰的军车，一副绝地求生的画面就这样徐徐展开。\n        在如此慌乱的情形之下，凯特倾听的很对，给出了绝对正确的信息，但是，他们毕竟是第一次面对进化丧尸，与其他进化后的生物有所不同的是，进化后的丧尸，是具有一定智慧的......\n        三辆飞驰的军车贴着城镇边缘的道路一路狂奔，而在右侧的森林中，3个有着银色皮肤的进化丧尸，安安静静的贴伏着地面，静静的等待猎物入网。\n        唰......\n        领头的军车刚刚飞驰而过，在第二辆军车路过一颗中型树木的一刹那，路旁森林的树木后，闪过数道银色的闪电。\n        “嘶......”\n        “吼......”\n        一瞬间，通讯器中传来了士兵们的叫骂声：“我操！”\n        “妈-的，这是什么！？”\n        “哦，耶稣，别这样...仁慈的主......”\n        约翰脑门上冷汗直流，坐在副驾驶的他，透过后视镜，看到了第三辆军车右侧后方车轮上，竟然趴着一头进化丧尸！\n        猩红色的目光，银色的皮肤，上面还流淌着橙黄色的血液。\n        “桀...桀......”进化丧尸大声嘶吼着，带着长长指甲如利爪般的手掌狠狠的抓向了右后方的车轮，张开血盆大口咬向了车体。\n        呯！\n        又一道银色闪电划过，迅捷却又沉重的身体狠狠的撞在了车辆右侧，趴伏在驾驶座外侧车门上，尖利的爪节竟然抓向了驾驶座的士兵！士兵慌乱的挣扎反击，彻底失去了对车辆的控制权，歪歪晃晃的撞向了左侧山林。\n        “基地他妈的为什么给我们派送的是敞篷军车？”\n        呯！\n        士兵们的呼喊声，枪声不绝于耳，短短的数十秒过后，一群嘶吼着的异种恶犬扑了上来......\n        “哦！我的天！哦！我的天！”坐在中部军车上的里皮嘴里细细碎碎的念着，他想过自己会死，但他绝对没有想过会是这种死法。被一群恶心的怪物分食？\n        里皮眼睁睁的看着后方的军车被异种恶犬湮没，战友们凄厉的惨叫声让人毛骨悚然。\n        “嘿！嘿！看着我！”伊森双手抓住了里皮的脑袋，强行将他的脑袋搬了过来，双目直视着里皮，“嘿！清醒点！”\n        “好，好的，我不想死，我还不能......”\n        “里皮！”伊森狠狠晃了晃里皮的脑袋，道，“我们能逃出去，我们一定能逃出去，你现在唯一能做的就是保持冷静！”\n        “保持冷静，吃屎去吧，我怎么保持冷静，呜哇哇！”\n        “有我在，起码在你被怪物撕咬吞噬之前，我会帮你解决掉你的生命，不过是一颗子弹的事情。”伊森狠狠的将里皮的脑袋撞在军车后座靠椅上，“我保证，我的子弹比他们的尖牙利爪更快。”\n        “咕嘟。”里皮咽了口唾沫，傻傻的点了点头。\n        这样的安抚方式，还真是特别呢......\n        前方第一辆军车中，约翰还惊魂未定，就听到了凯特在后面喃喃自语：\n        “对，就是这样，对......”\n        “什么？你大声点，凯特，大声点！”约翰现在就是惊弓之鸟，再也受不了任何打击了。他只是希望，第三辆军车中的四名士兵，能够让怪物们分食一会儿，让怪物们别再追来了，这样的话，起码那些低贱的士兵们还算有些价值。\n        “快走，按着这条路开出去，这里就是突破口......”凯特紧闭着双眼，语气愈发的坚定了起来。\n        “哼，最好是这样。”约翰恨恨的咒骂了一声。\n        威尔逊半截身子还在车外，手中的枪械击打着森林里试不试窜出来的奇异生物们。\n        前方开车的士兵更加坚定了信念，脚踩油门，心无旁骛。\n        短短的一百米转瞬即逝，当车辆行驶到公路转弯处过后的十几秒后，驾驶座的士兵猛地一个刹车。\n        公路上的弯道和城市里的弯道是不同的，公路上的弯道弧线长度更长，鲜少出现90度的垂直折角，所以，伴随着车辆慢慢转弯，远远的，士兵看到了让他永生不忘的景象。\n        就在距离公路不到50米的森林中，一株妖艳的花朵轻轻的摇曳着，绚烂无比的绽放着......\n        而它的周围，是十数头异种恶犬......他们安安静静的蹲伏在那里，没有一丝一毫的异动，无声无息。\n        直至军车出现的一刹那，所有的“雕像”活了过来！",
				"added": 1587001529
			},
			{
				"comment_id": 11,
				"body": "009 花中异种\n这是一朵超出士兵们认知范围的花朵。\n        经历过末日的人，相当一部分人都亲眼见过那些古怪妖艳的花，它们都是白色的八瓣花，花瓣长度大概在10厘米左右，自花蕊的位置向花瓣边缘部延伸，有一条蓝色的条纹。\n        它们出现在2年前的深夜里，造就了这个光怪陆离的新末日。\n        有相当一部分人见过这样的花朵，更别提这些士兵们了。在理论知识培养中，这样的花朵是士兵们的必修课。\n        但是，出现在远处的花朵却并非是白色的，它的体型比正常的异花大很多，这大型号的花朵竟然是四瓣的，不仅如此，它通体漆黑如墨，花瓣长度起码在30厘米开外，花蕊呈星星点点的血红色，自花蕊处向外延伸直至花瓣末端，是一条条血红色的条纹。\n        妖艳异常！\n        诡异异常！\n        白色的异花本就算是奇特植物了，但是在这黑底红纹的大型花朵面前，那白色异花反而显得正常的许多，起码在人们的认知里，让世界翻天覆地的花朵就是长那幅模样的。\n        所以这里才会有如此多的异兽吗？所以这里才会有如此多的进化丧尸吗？统统都是因为这珠奇异花朵？\n        “那是...什么花？”驾驶座上的士兵哆哆嗦嗦的询问道。\n        “问个屁，给我开车！别停下！给我开车！”威尔逊怒声喝到，移动重机枪，面对那些扑上来的恶犬们疯狂的开火。此时此刻，已无退路了。身后以及两侧都包抄上来了凶兽，所以，唯一留给他们的路，就是一往无前。\n        在领头军车耽误些许的这段时间里，伊森乘坐的2号军车也赶了上来，同样，他们也看到了这样诡异的一幕。\n        伊森一边用突击步枪点射着异种恶犬，时不时打量着不远处的花朵，那粗长的根茎通体漆黑，将这团巨大的花朵高高支起，伊森敏锐的发现，在变异黑红花朵方圆十数米之内，没有任何生物。\n        它的周围有十几头异种恶犬，但是却没有敢接近花朵的，不仅如此，它周围十数米范围内也没有任何的植被。\n        咣当！\n        伴随着一声巨响，飞驰的军车再度被撞得一歪，2头巨型异种恶犬以远远超出同类的速度，仿佛感觉不到疼痛似的，从右侧的森林中窜了出来，一头扎在军车之上。\n        本应该瞬息万变的战场，却仿佛早就被下了结论。\n        而这一群士兵的性命，似乎也已经被注定。\n        面对着汹涌咆哮着冲上来的异兽，面对着身手迅敏的进化丧尸，当军车停下的那一刹那，一切似乎都已经被注定了。\n        不断缩小的包围圈让人感到绝望，沉重的军车像是在惊涛骇浪中飘摇的小船，随时随刻都有可能被倾覆。\n        “啊啊啊啊啊啊啊！”里皮放肆大吼着，疯狂的扫射着窗外张牙舞爪的异兽。\n        嘶......\n        2号军车上方操作重机枪开火的士兵，被一头进化丧尸一把抓了出来，血盆大口咬在了他的脖颈之上。\n        看得出来，普通型号的异种恶犬更像是壮声势的，真正能对众人产生威胁的，就是这几头进化丧尸，它们速度奇快、尖牙利爪、力量很大，并且具有一定的智慧，懂得攻击重点火力，也懂得先杀死驾驶座士兵，让军车停下这样的简单策略。\n        “吼！！！”进化丧尸疯狂的咆哮着，喷洒着血液，让人感到惊愕的是，在下一刻，进化丧尸竟然忍受住了对鲜血和嫩肉的渴望，将手中几近断气的士兵扔向了远处的黑红花朵。\n        几近死亡的士兵，在一阵天旋地转过后，一头栽倒在异种花朵10米处，下一刻......\n        花朵周围那平整而又安静的土地突然沸腾起来，无数藤条从土地中窜了出来，将士兵的尸体牢牢捆绑，短短的半分钟，士兵的尸体就硬生生的被拉进了松软的土地之中，再无声息。\n        而那黑底红纹的异种花朵，依旧在风中静静地摇曳着。\n        “呜...”\n        “呜...”几声犬类的呜咽声引起了伊森的注意，百忙之中，伊森看到两头异种恶犬被约翰使用异能扔向了花朵周围，不出意外的是，它们的命运和刚刚士兵的尸体一样，被土地里窜出来的藤条捆绑。\n        异种恶犬垂死挣扎，疯狂的撕咬着身上的藤条，却最终无功而返，被藤条拽入了地底。\n        “伊森！”\n        伊森耳旁突然传来了里皮的惊吼声，伊森下意识的转头望去，紧接着，下意识的伸手抓向里皮的脚踝。\n        右侧的军车门不知何时已经被卸了下去，里皮正被一头体型很大的异种恶犬拖拽了出去。\n        在力量上，伊森根本不是异种恶犬的对手，所以伊森下意识的动作所造成的结果就是......伊森和里皮一同被拽出了军车！\n        “你们，通通给我滚开！”伴随着不远处的一声怒吼，异能组的约翰终于发威了，整个场地中，除了他之外，所有的生物都纷纷向后退开了十数米。\n        这其中，当然包括了士兵、以及军车。\n        原本一只一只向外扔异兽的约翰，终于愤怒了，因为他发现，自己将敌人扔出去的速度根本赶不上对面大部队扑上来的速度。\n        “呵...呵......”约翰脑门上汗水之流，似乎这样的大绝招让他耗费了不少精力。\n        只见约翰手掌狠狠一挥，更加疯狂的嘶吼着：“啊啊啊啊啊！”\n        下一刻，伊森只感觉自己的身子腾云驾雾。\n        伊森，里皮以及那头大型异种恶犬，统统飞向了花朵的方向。\n        “就算是死，你也必须死在我前面！”约翰微小的声音断断续续，眼中的阴厉之色让人看着心中发寒。\n        而在此时，伊森的下一个动作却是一枪射爆了异种恶犬的头颅，左手努力抓着里皮的脚踝，狠狠的甩了出去。\n        “伊森！”里皮伸手想要抓住伊森，却发现自己的身体只能和伊森越来越远，“不，伊森！”\n        里皮的瞳孔一阵剧烈的收缩，耳边传来了伊森一句话：“抱歉，我没能完成对你的承诺，但我宁愿相信你能活下去。”\n        “别，别这样......”相反方向飞去的里皮，眼睁睁的看着伊森一头栽进了异种花朵伫立的范围内。\n        与刚刚的士兵尸体不同，与企图逃窜的异种恶犬不同，伊森在落地的一刹那，拎着突击步枪对异种花朵疯狂的扫射起来。\n        那妖艳的花瓣被打出了一个又一个窟窿，转瞬之间，其中一叶花瓣就被打碎在风中。\n        “嘶！！！”\n        “吼！！！”\n        “啊啊啊啊！”几乎在同一瞬间，所有进攻两辆军车的恶犬与进化丧尸们，统统调转了方向，冲向了伊森。\n        约翰脸上满是惊喜，紧接着，眼中闪过一丝舒爽，大吼道：“快，趁现在，我们跑！”\n        还真是意外的惊喜！如此简单明了的阴人行为，看似举手之劳，反而受到了这样的奇效，如此一来，新仇旧恨，便一次性解决了！\n        约翰回想着当初的考核，回想着伊森在基地高层眼前将自己打败的那一幕，又想起了刚刚伊森让自己受尽屈辱的一幕，心中升起一丝舒爽。\n        “伊森！伊森！”栽倒在地的里皮嘴里不断的念叨着，虽然脑袋晕眩，有些浑噩，但是脑海里却只有一个念头，嘴里也只有一个名字。\n        里皮手忙脚乱的爬起身子，连滚带爬的寻找伊森的方位，几秒钟之后，军车的轰鸣声却在耳旁响起。\n        “走，快走！”一个士兵猛地抓住了里皮的胳膊，二话不说架住了里皮的肩膀，连滚带爬的进入了早已无门的破烂军车中。\n        “放开我，放开我！”里皮疯狂的挣扎着，爬起身子向外看去，却看到一群恶犬与进化丧尸将伊森团团围住，而伊森的身体上，已经缠绕满了藤条。\n        伊森的面前，正是一株破烂的异种花朵。\n        在一群张牙舞爪、凶神恶煞的异兽浪潮中，伊森反而成为了一个异类。\n        “呜呼~”一号军车上，约翰取代了威尔逊的位置，半截身体搂在车外，看着远处那无助而又绝望的身影，约翰兴奋的怪叫了一声。\n        有劫后余生的喜悦，也有报复的快感：“老子再送你一程！”\n        约翰双手摊开，狠狠一推，伊森那被藤条牢牢包裹无法移动的身体，竟然窜了出去，一头扎向那黑底红纹的花朵。\n        “嘿嘿！”约翰阴笑着，伴随着军车的飞驰声音，落荒而逃。\n        原本身体四肢被藤条固定住，完全无法移动的伊森，却因为约翰突然施加的诡异力量，再次一头扎进了大型花朵的花蕊之中。\n        伊森有很多特质被女魔头米兰达所看重，比如说他对团队的忠诚，对战友的情谊，以及......对生存的渴望。\n        就算在这样十死无生的情况之下，伊森从未放弃过反抗，即便是双手双脚被束缚的无法移动，伊森依旧用出了可以伤害对方的方式，一口从花瓣根部撕下了一瓣破碎的花朵，一口又咬向了那血红色的花蕊。",
				"added": 1587001545
			},
			{
				"comment_id": 12,
				"body": "010 我吃了一朵花\n“嘶嘶......”\n        “呜吼吼！”花朵半径15米之内，除了伊森再无活物。\n        而在15米这个界限边缘，一圈异种恶犬和数头进化丧尸来回踱步，不断的嘶吼着，无比焦急的围绕着花朵，但是它们却不敢越雷池一步。\n        而伊森身上的藤条缠绕的更紧了，不仅如此，土地里涌现出了无数根藤条，仿佛因为疼痛一样，在疯狂的胡乱拍打着。\n        伊森身上的藤条猛地将其撕扯开来，拍打在地，然而在下一刻，所有胡乱拍打的藤条统统都偃旗息鼓，无力的散落下来。\n        被藤条狠狠砸在地上的伊森，似乎有些晕眩，他慢慢的转过身，仰望着湛蓝色的天空，嘴里除了那花蕊、花瓣，还有着那漆黑如墨的植物根茎。\n        藤条无比的努力将伊森从花朵上拽走，而在这样的巨力之下，伊森紧咬着花朵，竟然将其根茎也拔了出来。\n        它们的能力很诡异、很强大，但同时本体也很脆弱。\n        预想中的死亡并没有出现，周围的恶犬与丧尸依旧在15米范围外来回踱步，而无数藤条却已经偃旗息鼓，软趴趴的耷在地上，只剩下了伊森咀嚼花朵的声音。\n        这样的姿态，完完全全就是恨不得咬碎敌人骨头的模样。\n        做好了所有准备的伊森，并没有等来死亡，等来的却是......身体里汹涌翻腾的古怪能量，仅仅十数秒之后，伊森眼前一黑，彻底失去了意识。\n        花开两朵，各表一枝。\n        目光呆滞的里皮坐在军车上，无声无息，身影无比的落寞。不知道过了多久，军车终于回到了卢灵基地。\n        面对着伤亡惨重、衣衫破烂、灰头土脸的士兵们，基地中的所有人都知道了这次出行的结果。\n        浑浑噩噩的里皮被架下了军车，脑海里尽是伊森临死前拯救自己的画面，还有耳旁缭绕的那一句话：“希望你能活下去。”\n        突然间，里皮浑身一震，仿佛听到了清晨的闹铃一般，因为，他听到了一道让他恨到骨子里的男性嗓音。\n        “妈-的，这他-妈-的是什么任务，老子......”约翰对着基地接待自己的士兵们大声抱怨着。\n        里皮一手推开了身旁架着自己的士兵，右手隐蔽的背在腰后。\n        “嗯？”一旁，也有些惊魂未定的凯特正看着自己带领的特战预备役，目光所及之处，却突然看到了里皮，那种眼神，那姿态......\n        “你干什么？”凯特的速度无比迅捷，在里皮抬手握枪的一刹那，凯特毫不犹豫的开枪，一发子弹打在了里皮的手臂上。\n        凯特甚至不知道里皮的目标是谁，但是在本能驱使下，凯特并不想要让这基地陷入战火之中。\n        哒！血花飞溅！\n        一颗子弹打在里皮的手臂上，里皮的身子被打的一歪，下一刻，基地守备士兵们一拥而上，将里皮狠狠的压在了地上。\n        “你他-妈-疯了？”约翰这时也回过神来，看着被压在地上不断反抗的里皮，约翰怒不可遏的尖叫道。\n        “你杀了我的兄弟！你杀了我的兄弟！”里皮愤怒的嘶吼着，那歇斯底里的模样，让参与任务的特战预备役成员都沉默了。\n        “你本可以在最后把他拽回来，你本可以！你却将他扔进了危险圈的最中央！你这个婊！子！养！的！”里皮被死死的按在地上，那一头柔软的天然卷里尽是泥土，深棕色的脸蛋被压的变形，却无法阻止他愤怒的嚎叫，“你这个小人，贪生怕死的背叛者！你这个背叛者！”\n        “你这个背叛者！就因为伊森在考核中赢了你，就因为一个普通士兵能赢你一个异能者，你就一直记恨至今，甚至不惜害死他！你这个垃圾、杂种！”里皮的嘶吼声不断缭绕在房间之内。\n        约翰面色铁青，气急败坏的说道：“狗屎，我和他没有任何私人恩怨！我救他，我怎么救他？如果他离开了那该死的花朵，所有的恶犬和丧尸都会冲我们来！”\n        约翰看着周围面色不善的士兵们，大声喝道：“我他-妈-的救了你们！别用这样的眼神看我，你们除了感激就不应该有别的情绪！牺牲一个人，让一整支队伍活下来，这就是我做的一切！”\n        约翰看着被按在地上的里皮，寒声说道：“你的兄弟本是英雄，别让他因为你的举动而受唾骂。”\n        “你这种垃圾竟然还有脸说这种话，你这个小人，你......”\n        里皮很快就被士兵们带了下去，不出意外的话，里皮的行为会受到基地的审判，因为他企图射杀一名异能组成员。\n        毕竟，约翰是一名异能者。\n        “放开我，放开我，我要见首领，我要见我的长官！我要......”里皮不断的挣扎着，却看到走廊拐角处，一道修长高挑的身影正背靠着墙壁，双手环胸，目光冷漠的看着地面。\n        显然，闻讯赶来的米兰达，听到了一切。\n        女人那一头干净利落的寸发，再无法让她显得意气风发，那迷人的脸蛋面无表情，低垂着头，身影稍显落寞。\n        “米兰达...米兰达......”里皮癫狂的模样渐渐平复，喊叫的声音也慢慢小了下来，被士兵架着的身体，也缓缓放弃了挣扎，“对不起，对不起......我对不起伊森......”\n        伴随着里皮被士兵们架着渐行渐远的身影，米兰达隐隐约约的，听到了里皮痛哭流涕的声音。\n        “呵呵，这么说，你是为了战友而死的么。”米兰达深深的吸了口气，语气淡淡的，“也算死得其所。”\n        说着，米兰达迈步离开了长廊。\n        在走廊拐角的一刹那，米兰达猛地停住脚步，远远的，看到了异能者三名成员在士兵的护送下走出了大厅。\n        湛蓝色的美目与三位异能者灼灼相视，不，确切的说她那如炬的目光定格在了约翰的身上。\n        约翰冷冷的瞥了米兰达一眼，没有任何表示，也没有言语。\n        在士兵的簇拥之下，与米兰达擦肩而过。\n        地点：萨尔镇十五公里外。\n        “呵......”伊森猛地睁开双眼，大口大口呼吸着新鲜空气，一阵咳嗽过后，伊森努力挣扎了一下。\n        发现曾经牢牢捆绑自己的藤条已经软趴趴的毫无力气，轻易的便让伊森挣脱开了。\n        伊森迅速半跪起身子，眼眸巡视四周，发现不远处依旧有一群异种恶犬和进化丧尸在伺机猎杀自己。\n        但是，不知道什么原因，它们依旧不敢踏入距离花朵15米的范围之内，它们只能在外面张牙舞爪，等待着伊森出来。\n        伊森回过头，发现了少许零碎的花瓣小块，大部分似乎都让自己吃了？伊森挠了挠头，当初如此惊险的生死时刻，肾上腺素飙升的伊森，为了生存，做出了一些人类无法想象的事情。\n        那么......\n        伊森蹲伏着走到自己散落的枪械面前，心中暗问道：“我为什么昏迷过去？那种古怪的能量是什么？我觉醒了异能吗？不应该啊，除了接触花朵可以觉醒异能之外，没有后天觉醒异能的例子。”\n        伊森一边整理着思绪，冷静的观察着四周，以花朵为中心，半径15米之外尽是异种恶犬和进化丧尸的身影，想要逃出去可不容易。\n        而且，更加可怕的是，如果这些怪物发现这里并非“死亡区”了呢？\n        那些进化后的丧尸，似乎还是有点智商的，毕竟从这次伏击战中就能看得出来。\n        伊森迅速的检查了一下身上的装备，却是眉头一皱，自己这破破烂烂的衣服上哪找装备去？\n        伊森发现除了腿侧有一把米兰达赠与的漆黑半尺格斗刃之外，也只有手中刚刚捡起来的突击步枪了，没有多余弹夹，子弹也不多了。\n        这样的话......\n        伊森深深的吸了口气，不断设想着各种各样的方法。\n        在这里等待救援显然不是明智之举，自己昏迷了几个小时了，看天上的太阳，已经是下午时分了。\n        这些异兽就像是从小到大被驯养出来的象，小时候被一鞭子一鞭子抽打，让它内心里恐惧，并且不敢踏出圆圈半部，当小象成长为大象过后，它依旧温顺，依旧任由鞭打，不敢踏出圆圈半部。\n        这是无形的恐惧，也是习惯使然。\n        但是现在，成年大象可以轻易的踩死曾经蹂躏它的驯兽师。这些异兽也一样，它们可以肆意的进入花朵周围的死亡区，倒不是因为异兽长大了，而是因为花朵死了！\n        伊森握紧了手中的枪械，这局，怎么看都是死局啊。\n        自己因体内莫名其妙的能量而昏迷，是不是意味着？伊森仔仔细细的感受了半天，却怎么也发现不了自己有什么奇特能力。\n        等等，既然丧尸进化了，那么脑中应该有晶核。\n        伊森目光扫去，发现了5头银色的进化丧尸，恐怕全世界的进化丧尸都集中在这里了吧，因为这古怪的花朵让它们进化的。\n        它们应该是极为特殊的产物，如果全世界范围内都是这种进化丧尸，那估计人类也该灭亡了。\n        这些进化丧尸在蹲守自己，那么它们就是活靶子。\n        伊森握紧了手中的枪械，心中一阵激烈的交战。\n        这打出去的子弹，会给自己带回来晶核，还是......惹怒它们，让自己死期提前？\n        不，不对！自己的想法有错误，伊森敲了敲脑门，在一片猩红色眼眸的注视下，极为冷静的思考着：我就在花朵半径15米的范围之内，却安然无恙，这已经客观表明了死亡区已经变成了安全区。\n        所以，它们到底在怕什么？又或者是......这花朵曾经的威严实在太盛？它们根本没有半点勇气进入这里？\n        想到这里，伊森迅速的端起了枪械。",
				"added": 1587001571
			},
			{
				"comment_id": 13,
				"body": "011 乖巧\n“哒！”\n        伴随着异种恶犬的一声呜咽，恶犬腹部被开出了一个血洞。\n        伊森的目光与对面的进化丧尸灼灼对视。与此同时，进化丧尸长着尖锐利爪的手掌微微下移，手中还拎着异种恶犬不断挣扎的残破躯体。\n        进化丧尸用异种恶犬挡子弹，伊森再度抬枪瞄准，进化丧尸的手部也在同一时间移动，将异种恶犬挡在它和伊森中间。\n        伊森皱着眉头，24头异种恶犬，5头进化丧尸，自己却只有18发子弹，这......\n        就在这时，伊森脚下的土地突然开始震动起来，仿佛小型地震一样，而且震动幅度越来越大，中心点的位置，土地竟然凹陷了下去。\n        即便是伊森再怎么冷静，面对着接二连三的突发状况，他的心都有点凉了，时时刻刻都是死局，这已经不算是考验伊森的心理素质了，这就是要把伊森逼疯的节奏！\n        “嘶......”\n        “嘶......”\n        一只银色的大手破土而出，牢牢的扒着地面，接二连三的，周围凹陷下去的土地中，纷纷窜出了几只银色的大手，那漆黑的长指甲让人毛骨悚然。\n        “我他-妈终于知道你们为什么不敢进来了！”伊森非常罕见的爆了一句粗口，似乎这个世界的每一次变化都在加速他的死亡，都在把他往绝路上逼！\n        “呜呜呜......”\n        “桀桀！”半径15米外的进化丧尸和异种恶犬，焦急的来回踱步，不断的呜咽着，紧接着飞快的转身跑开了。\n        伊森愣了一下神，立刻反应了过来，急忙也跑了出去，无论这地底下要爬出来什么样的生物，伊森都不愿意去面对，连那些智商低下的恶犬都逃跑了，自己还犹豫什么？\n        智商低下，只有动物本能的恶犬即便是面对着枪林弹雨都敢冒死冲杀，在什么样的情况下它们才会跑？这题还用想？跑就完了！\n        伊森闷头向前冲！\n        听说......秋高气爽的午后，和逃亡更配哦！\n        “啊啊啊啊啊啊！”尖利的叫声响彻云霄，地底的生物终于爬了出来。\n        伊森微微转头，向后看去，却看到了数头2米高左右的巨型银色生物，它们的体型和人类很相似，有四肢有脑袋，但似乎没有脸？\n        “咿咿咿咿！”仿佛听到了伊森心中的问话，其中一头巨大的银色人形怪兽的头颅突然裂开，脑袋犹如花瓣一样绽放开来了四瓣，对着伊森的身影一阵狂吼。\n        “狗！屎！”伊森今天算是打破自己爆粗口的记录了，他脚下不停，飞快的向前冲刺，一边跑一边努力瞄准着前方同样逃亡的进化丧尸，甚至在这一刻，伊森都在努力的转动大脑，给自己谋求多一条生路，如果，自己能留下一头进化丧尸，那些巨型生物会不会先吃丧尸，给自己多一点逃亡的时间？\n        见鬼，刚才围着自己的恶犬那么多，现在都跑哪去了？\n        都跑哪去了？漫山遍野的落水狗们给了伊森完美的答案，如果它们的脑袋里有“爹娘”的概念的话，恐怕都在骂爹娘为什么不多给它们生两条腿。\n        咚！咚！咚！\n        沉重的脚步声频率极快，伊森心跳骤然加速，因为那声音距离自己越来越近，作为一个普通人，伊森的速度怎么和那些异维度的强大怪物比较？\n        短短的几秒钟，伊森真真正正的嗅到了死亡的气息，脑海中闪过了无数人生的画面。\n        无处可逃！\n        伊森猛地翻身倒下，手拿枪械对准了斜后方，身体向后滑着，背脊与地面摩擦，感受着背脊处传来的一阵火辣辣的疼痛。\n        子弹，留着也没用了吧，万一，万一还有奇迹呢？\n        而伊森的眼神慢慢的浮现出一丝绝望的神色，这次恐怕真的是要凉了。\n        视线中，那银色巨型人形生物的身影不断放大，健壮修长的大腿飞速奔跑，硕大的头颅如花朵般绽放开来，露出了血盆大口，无数细密的尖牙一圈圈盘绕其中。\n        “啊啊啊啊啊！”伊森一边倒滑着，一边扣响了扳机，但是，对方的速度远远超出了伊森的反应速度。\n        唰！\n        巨大的银色身影从伊森身上急速略过，犹如铺天盖地的乌云，遮挡了伊森的全部视野，却又在瞬间消失的无影无踪。\n        那一刻，伊森的世界仿佛都缓慢了下来，他看到了那血盆大口流淌着的涎水在半空中低落，他看到了它那修长的四肢上细密的奇怪纹路，他看到了......\n        咚！\n        人形生物“呯”的一声落地，伊森目光呆滞，耳边的脚步声却越来越远。\n        伊森倒滑的身体戛然而止，入目的却是那湛蓝色的天空，那洁白的云朵，微风拂过，仿佛这个世界是如此的虚幻。\n        “咕嘟。”伊森似乎被里皮传染了，他咽了口唾沫，翻转过身，趴伏在地面上，却看到了前方那2米高的人形生物已经抓住了一头进化丧尸，锋利的爪节直接穿透了进化丧尸的胸膛，在进化丧尸的哀嚎之下，人形生物的脑袋敞开，血盆大口猛地包裹住了丧尸的头颅。\n        噗嗤。\n        那血盆大口就像是吃豆腐一样，当人形生物抬头的一刹那，进化丧尸的脑袋已经消失了。\n        “嘶！！！”\n        人形生物仰天长啸，一手拎着进化丧尸的胳膊，转过身，拖拽着它的无头尸体，慢慢的走了回来。\n        伊森小心翼翼的趴伏在地上，不敢有一丝一毫的异动。\n        此时此刻，伊森只想当一个安安静静的伏地魔。\n        “咚！咚！咚！”2米高的人形生物一步步走来，那沉重的脚步踩在地面上，激起阵阵尘土，每一步，都仿佛踏进了伊森的心里。\n        伊森凝神屏息，尽量不发出一丝一毫的声音。\n        咚！\n        一只巨大的脚掌踩在伊森的耳侧，震得伊森耳朵发麻，更多的，恐怕是心理作用。\n        老大！能不能给条活路？我的脑袋里没有晶核，我太弱小了，不够你塞牙缝的，你看我趴在地上，一动都不敢动，多乖巧。\n        咚！咚！咚！\n        人形生物的脚步声越来越远，伊森微微张大了嘴巴，这是上天听到了自己的祈祷吗？\n        伊森都快被感动哭了，但是身体依旧不敢动......",
				"added": 1587001591
			},
			{
				"comment_id": 14,
				"body": "012 火爆\n“嘶！”\n        “嘶！”\n        远处传来接二连三的嘶吼声，伊森小心翼翼的转过身，侧躺在公路旁的泛黄的草丛里，目光放远，看向声音传来的方向。\n        而这样的一幕，却让伊森的心中泛起了轩然大波。\n        那些巨型人形生物，手中拎着各式各样的尸体，几乎都朝向自己的方向，大声嘶吼着，然后身体跳进了土地凹陷的地方。\n        它们......在和自己说话？\n        伊森彻底愣住了，所以刚才的一切都不是运气，并不是上苍听到了自己的祈祷？那人形怪物根本就知道自己在哪里，只是并没有攻击自己？\n        对啊！\n        现在想想，它怎么可能不知道自己在哪？多了不说，在猎捕进化丧尸的前一刻，伊森的位置是在进化丧尸的后方的。\n        而那个巨大的人形怪物略过了自己，继续去追捕进化丧尸......\n        如果它是一切生物的捕食者，它没道理放过自己。难道这一切不是巧合，不是奇迹，而且另有原因？\n        伊森就一动不动，眼睁睁的看着一头头人形巨怪跳进了土地凹槽中，消失在了这个世界里。\n        伊森爬起身子，怀揣着十万个为什么，迅速打量四周，却也看到了极远处公路尽头那撞在树的军车，无论怎样，此地不宜久留。\n        那是三号军车，也是第一批遇难的，伊森急忙小跑过去。\n        但结果却让伊森的心情有些沉重，他在这军车中只找到了一截截残破的尸体，甚至拼凑不出一个完整的人形，恐怕，大部分都在当时被拖出去喂了花朵吧？军车的车体也被破坏的不成样子，可想而知当时进化丧尸在撕扯驾驶座士兵的时候，那激烈而又残忍的景象。\n        伊森深深的叹了口气，探身而入，翻看着后备箱，看到了散落的枪支弹药。\n        “好吧，这倒是有些帮助。”伊森闻着浓郁的血腥味，飞快的捡起枪支弹药，身上的装备也配置一新。\n        “噜...噜...噜......”\n        “嗯？”伊森猛地转过头，这是恶犬伺机进攻时本能发出的声音？\n        入目的，却是一头异种恶犬，身高大概在60cm左右，体长一米，浑身上下毫无毛发，身上道道伤口还流淌着血液，猩红色的眼睛和血液的颜色很是般配。\n        伊森二话不说，开枪点射。\n        “呜呜~”异种恶犬呜咽着，身中数弹，却身残志坚，和刚才那些落荒而逃的同类们完全不一样，面对着伊森，它的动物本能让它没有一丝一毫的惧怕。\n        看着张牙舞爪向自己扑来的异种恶犬，伊森冷静异常，终将恶犬的头颅打爆。\n        体型较大的恶犬也终于栽倒在地，再无声息。\n        所以，一个人，在这荒郊野外里该怎么生存？\n        “噜噜噜......”\n        “噜噜噜......”\n        “起码不会孤独。”伊森喃喃自语着，看着森林中亮起的数道猩红色眼神，刚刚经历过一个又一个艰难绝境的他，似乎底气更足了一些。\n        “来，朋友，给我点希望，我现在最需要这个。”伊森一屁股坐在驾驶座上，迅速启动军车。\n        “嗡...嗡.........”\n        “成了！”伊森心中一喜，急忙挂挡踩下油门，残破的军车后方，是数头追杀而来的异种恶犬。只要没有进化丧尸，一切都还能接受。\n        恐怕，那样恐怖的进化丧尸就是这个地方的特产吧，一切的一切都因为那奇异的花朵。\n        伊森驾车飞快的行驶在公路上，脑海中回想着刚刚的景象，萨尔小镇是不能去了，毕竟他们在萨尔小镇上遇见过起码2头进化丧尸，谁知道它们被地底爬出来的人形怪物消灭了，还是依旧在城镇中浪荡？\n        伊森很冷静，并不认为自己能够对付一头恐怖的进化丧尸。\n        伊森抿了抿嘴，他想着那巨型人形怪物的模样，再对比进化后的丧尸，发现二者有很多相似的地方，都是银色的皮肤，都有着那样的利爪，模样极为相似，体型上来看，那地底爬出来的生物更加高大强壮，而进化丧尸的本体因为是人类，所以在个头上普遍不如那些人形怪兽。\n        猎食者，就叫猎食者吧。伊森心中暗暗的给那些巨大的人形怪物起了个名号，毕竟它们算是救了自己一命。\n        虽然这听起来很可笑，但是事实就是如此。\n        猎食者与进化丧尸的区别，恐怕就是猎食者是没有脸的，它们的脑袋能如同花朵一样绽放开，里面一圈圈细密的尖牙非常的惊悚。\n        所以那古怪的花朵到底是什么类型的异维度植物啊，是它制造了这一切么？\n        伊森甚至认为，哪怕是真的有丧尸进化了，也不会进化成他现在所看到的银色皮肤丧尸模样，伊森总觉得这样的银色进化丧尸是特殊的产物，是特殊花朵培育下出产的特殊例子。\n        那些巨大的猎食者为什么要救自己？它们应该是在捕食，这一点倒是可以肯定的，它们去了哪里？地底？难道地底下还有一个人们未知的环境？猎食者生存的地方是地球的地底？还是异维度？\n        还有，自己因为吃了一朵花而感觉到体内能量汹涌，伊森无比确定自己并不是因为受到重击又或者是疲劳而晕倒的，他就是因为能量的涌动而晕死过去的，自己的身体到底有了什么样的变化？\n        伊森眉头一皱，发现事情并不简单。\n        就在伊森驾车带着一群咆哮的异种恶犬一路狂奔时，他眼睁睁的看着前方天空中飞来了数枚椭圆形物体，后面还拉出了长长的火焰。\n        那是？\n        伊森眼眸一凝，猛踩油门，轰隆隆！\n        一瞬间，伊森所处的位置彻底成为了枪林“弹”雨，导弹的弹。\n        轰！轰！轰！\n        一连串的轰炸声震耳欲聋，甚至有一枚导弹在伊森车右后方数十米外爆炸开来，那汹涌的气浪直接震碎了车窗，险些将军车掀翻。\n        细碎的玻璃渣划过伊森的皮肤，留下了道道血痕，伊森却顾不了那么多了，他的大脑一阵阵晕眩，整个人在惊涛骇浪中风雨飘摇。\n        调查部队已经回到基地了吗？通报了这里的情况？因为异兽的实力实在太过强大，所以他们启用了导弹轰炸？\n        原本只想要拿到进化丧尸晶核的卢灵基地，这次终于认清了现实，要玩点大的，要一劳永逸吗？将危机扼杀在萌芽之中？\n        这样的选择伊森可以理解，但是让伊森无法容忍的是，耳边、身后那震耳欲聋的爆炸声似乎是死神的咆哮，在向伊森索要生命！\n        我躲过了恶犬的撕咬，躲过了进化丧尸的追捕，侥幸逃脱了约翰的出卖，不惜一切吃了一朵诡异的花，挣脱了藤条，甚至祈祷过后猎食者都放了我一命。\n        我他-妈-的能逃脱这一切，在最后，却是你卢灵基地不放过我！？\n        呯！呯！呯！\n        伊森弯着腰开车，努力的看着前方，震耳欲聋的爆炸声险些让伊森失聪，破旧的车辆在一片火光热浪中急速飞驰......",
				"added": 1587001615
			},
			{
				"comment_id": 15,
				"body": "013 你已经死了\n不行，这样不行。伊森，冷静，用脑袋想......”伊森心中暗暗的想着，自己如果继续这么任由车辆飞驰下去，那就是对生命的不负责任。在如此威力强劲、细密的炮火轰炸之下，无脑的冲出去死亡率实在是太高了。\n        伊森猛地一拉手刹，方向盘向右打舵，车辆与地面发出了不算刺耳的摩擦响声，伊森还不等车辆停稳，打开车门，一个鱼跃纵身跃了出去。\n        眼前，正是刚刚那诡异花朵生长的地方，同样，也是那些银色猎食者爬出来的地方。\n        伊森飞快的扑了上去，脚踩着松软的土地，寻找着洞穴。\n        毫无疑问，那洞穴就是天然的防空洞，在空荡荡的荒郊野外中，伊森没有任何建筑作为掩体，在这种情况之下，那深坑也许就能拯救伊森一命！\n        空袭之下，荒野之中，洞挖的越深口越小，存活几率越大。\n        这是几代人总结出来的经验，想当年，漫山遍野的红色军团在面对即将到来的空袭的时候，用的就是这样的方法。\n        更何况，刚才银色猎食者已经表明了它们对自己毫无恶意，起码它们发现了伊森，而且还未抓捕猎食伊森。换一个角度来考虑，它们甚至救了伊森一命，毕竟它们抓走了大量的进化丧尸与异种恶犬，算是帮伊森突围了。\n        “洞穴呢？深坑呢？”伊森脚踩着松软的土地，跪伏在地面，不断的寻找着，漫山遍野的轰隆响声似乎像是死亡倒计时，让伊森的速度不由得更快。\n        这就是在与时间赛跑......\n        坑，给我一个坑！\n        伊森飞快的用手扒着地面，不断的深挖着，下一刻，手掌似乎透过一层土壤，穿到了空荡荡的空间。\n        伊森眼眸一凝，甚至连继续挖的动作都不敢有了，他没有时间耽搁了，双手扒着土壤，一头扎了进去。\n        轰隆隆！\n        在伊森身旁不远处，那刚被废弃的军车，与炸弹亲密接触，轰隆作响。\n        “嘿！”伊森双手扒着坑的边缘，双手用力，努力的爬了进去，翻身仰躺在了地面上。\n        伊森大口大口的喘着粗气，即便是再怎么冷静，他依旧也有些惊魂未定，当伊森回过神来的时候，愕然发现，周围的环境怎么这么眼熟？\n        等等？\n        伊森这才反应过来，他刚才是向下扒着土壤，身体钻进坑中的，那么，按照道理来讲，穿过土壤之后，此时的他，身体应该是在下落的。\n        但是......\n        伊森不仅没有下落，他发现自己的身体穿过土壤之后，手扒着坑的边缘，再度形成了向上爬的姿势。\n        头顶依旧是...天空？\n        这是异维度吗？以坑口为分界点，以坑口为地平面的异维度大陆？\n        周围的环境越看越熟悉，这怎么像是......不，这里的环境与刚刚伊森来时的环境一模一样。\n        森林、公路，简直就是一个模子刻出来的！\n        这算什么？镜像世界吗？\n        区别在于，这里的天空是阴霾的，四周环境有些昏暗，天空中没有太阳，空气中那阴冷发霉的气味让人暗暗作呕。\n        伊森半跪起身子，有些不可置信的看着周围熟悉的景象，这一切在伊森眼中看来都显得如此虚幻。\n        “嘶......”远处的深林里，一道银色的巨大身影发出了无疑是的嘶吼声，沉重的身体漫无目的的行走着。\n        伊森身体紧绷，急忙趴了下来，来到这里真的是无奈之举，伊森面对着导弹轰炸，只能来到这里求生，虽然伊森想的是刚刚这些猎食者对自己打招呼，而且并未伤害自己，所以这里相对安全。\n        但是哪还没有点意外啊？万一自己哪些行为惹恼了这些猎食者呢？所以伊森连蹲着都不敢，他又回到了第一次遇见猎食者时候的姿势，迅速趴了下来，脸上写满了“乖巧”......\n        毕竟，在种族上的天差地别，让伊森没有半点获胜的可能性，逃跑也是无稽之谈，在猎食者面前，伊森就相当于一个刚入学的小学生，而猎食者是职业UFC格斗选手。\n        大佬们，我就躲一会儿，就一会儿，一会儿我就走，绝对不打扰你们，别生气，你看我多乖巧。\n        与此同时，地球维度。\n        “对，就该这样，妈-的，这群该死的杂种，我们早该这样。”在轰炸区范围外，一队人马赶到，领头的便是异能者约翰。\n        约翰听着远处天边轰隆作响的声音，脸上写满了舒爽：“炸死这群婊-子养的。全都给我准备好，只要轰炸停止，我要在第一时间出现在那里！”\n        约翰脑袋里幻想着刚才那些异种恶犬以及进化丧尸，异种恶犬倒不算什么，但是那些进化丧尸的脑袋里，一定会有晶核！\n        所以约翰才会拼命请求，用声泪俱下的方式讨要到了这次任务行动的名额。\n        不过威尔逊和凯特没有来，他们在处理伤势，不过这样也好，这正和了约翰的心意。\n        脑袋里想着晶核，想着自己的身体和能力会有进一步的提升，约翰的身体都有些细微的颤抖，在得到指挥部的命令过后，约翰直接一声令下。\n        “队长，他越权了，这是你的队伍。”特战组士兵开口说道。\n        一个身材瘦小的白人男子面无表情，没有任何的反应。\n        “你们还在等什么？迅速完成任务！长官们还在等着那些进化丧尸的尸体！”约翰转身对着特战七组的组长吼道。\n        “开拔！”瘦小男子眼眸微微闪烁着，最终开口说道。\n        得到了自己想要的结果，约翰便不再开口，事实上，他的心早就不在这里了。\n        此时此刻，异维度中。\n        伊森正面临着一次生死考验，因为，刚才山林中的那一头银色猎食者竟然向他的方向走了过来。\n        伊森凝神屏息，不敢发出丝毫的声音，就这样，巨大的猎食者走到了伊森的身旁，蹲下了身子，变成四肢伏地，大脸像是花瓣一样张开些许，在伊森的头顶微微摇晃着。\n        你明明没有鼻子，那你还在乱闻什么？\n        伊森就像是装死一样，一动都不敢动。\n        “嘶...嘶......”浓郁的血腥味充斥鼻间，取代了空气中潮湿发霉的气味，伊森一手紧握着双持格斗刃。\n        “咿咿咿！！！”\n        极远处传来了一道尖利刺耳的吼声，还在伊森身上乱嗅乱闻的猎食者猛地站起身子，转身对着声音传来的方向大吼一声，飞快的跑了过去。\n        霎时间，各种各样的嘶吼声从四面八方传来，伊森冷汗直流，因为他起码看到3个银色身影从自己身旁掠过，多亏自己刚才顶住了压力，否则后果不堪设想。\n        “呼......”伊森大松了一口气，它们是被叫走了？它们去干什么了？难道它们也有执行任务这一说？这个强大的种族还真是神秘。\n        无论怎样，伊森不愿意在这里多驻留了，他急忙用双手扒着地面，在那再次被抹平的松软土地上，伊森一手狠狠的砸出了一个洞。\n        伊森刚将半薄的土壤扒开，就听到下面传来了一道熟悉的嗓音：\n        “见鬼，那些进化丧尸呢？它们的尸体呢？我该怎么交差？”\n        约翰！？\n        伊森愣了一下，继而听到了争执的声音。\n        “异能者先生，就算是未带回进化丧尸的尸体，就算是任务失败了，那也是我们的责任，不需要您去交差。”这是一道陌生的嗓音，伊森并不知道是什么人。\n        “狗屎。”约翰恶狠狠的咒骂一声，四处寻找着，“不仅是进化丧尸，就连那些异种恶犬，也消失了，那么多数量的恶犬，就算是身体被轰炸的细碎，也会留有痕迹的，它们不可能...啊......”\n        约翰正向四周看着，咒骂的话语还未说完，就感觉脚踝处传来一股巨力，紧接着，他被硬生生的向下拽去。\n        偷袭之下，当众人反应过来的时候，约翰已经半截身子被拉进了土地中，众人也并未看到伊森的手。\n        “那是什么？流沙？快抓住他的手！”七组组长大声喊道。\n        而刚刚心高气傲，与约翰有些争执的特战士兵，却向后退开一步，再三确认了自己的安全，再三确认了所谓的“流沙”范围之后，才拿着步枪向约翰伸了过去。\n        “F**k!你在等什么？你在......”约翰慌乱的大叫着，双手扒着土地边缘，但是周围的土壤却都是那样的松软，真的很难借力。\n        “你！给！我！进！来！”伊森蹲伏着身子，心中怒吼着，腰部用力，恶狠狠的将约翰的身体从土地里拉了出来。\n        “后退！后退！所有人后退！”七组组长急忙喊道，事实上，就算他不喊，脚踩着松软土地的士兵们，都已经纷纷后退了。\n        他们都非常清楚这里的古怪，这项任务的危险程度远超寻常，从回到基地的异能组长威尔逊以及那些预备役成员的口中就能得知。\n        这本该是特战三组的任务！该死的三组上次任务死伤太多了，否则基地首领也不会让七组来。\n        约翰慌乱的大叫着，预想中狠狠摔在地上的情况并未出现，他从在地球土地上趴伏的状态变成了在异维度大陆上趴伏的状态。\n        换句话说，伊森和土壤外面的士兵们都伫立在同一片土地上，只不过，他们是脚底相对的。\n        下一刻，约翰只感觉背脊一凉，一柄锋利的半尺格斗刃狠狠的刺进了约翰的后心！\n        呲！\n        “第一刀，先通知你的死亡！”伊森身形瞬间欺上，飞快的拔出半尺格斗刃，膝盖狠狠顶着约翰的后脑，那重重的一击不仅让约翰陷入了晕眩状态，甚至将约翰的脑袋都压进了松软的土地里。\n        锋利的刃身带着血槽，拔出来的时候，还连带着块块碎肉，汩汩的鲜血流淌而出。\n        伊森眼眸阴冷，与当初约翰的眼神如出一辙：“第二刀，我本以为你是个男人，再不济也是个合格的士兵，结果你就是个阴险自私的杂种。”\n        面对着一名异能者，伊森不打算给约翰任何反抗的机会，所以，当他口中说着“第二刀”的时候，真实的情况是......他已经捅到了第四刀了......\n        “第三刀，无论你的身份多么高贵，请务必小心，千万不要给我哪怕一丝一毫的机会。”伊森阴冷的轻声呢喃，在约翰耳际缭绕着。\n        “别急着死，还有第七刀，第八刀......”",
				"added": 1587001656
			},
			{
				"comment_id": 16,
				"body": "014 我一路向北\n 呲！\n        “第九刀，大家都是天天徘徊在生死一线的人，谦逊点，总归是有好处的。”\n        伊森猛地拔出漆黑的半尺格斗刃，拎着约翰的脖子将其的脑袋从松软土地中拽了出来，再度狠狠呲下。\n        “第十刀，给我个晶核，咱俩新仇旧恨一笔勾销。”伊森飞快的在约翰头颅中寻找着晶核，但结果却让伊森大失所望。\n        这个异能者，竟然从未吃过哪怕一枚晶核？他的实力没有强大到足够的程度，未在脑袋里进化出一枚晶核？\n        这异能给你还真是浪费了，不会利用不说，连条异种恶犬都杀不了，只会阴人么？\n        想想也是，在当初生死大逃亡的时候，约翰的异能就没有表现出应有的水准，那些进化丧尸太过强大，阻止不了也有情可原，但是那群异种恶犬都阻止不了？\n        每一次被约翰扔飞，异种恶犬就会迅速的追上来。而现在，异能者约翰死的更是憋屈，突如其来的偷袭再加上伊森决绝的心，让他连半点反应的余地都没有。\n        当然，就算是其他异能者，在这样的情况下，也难免会被伊森得手。\n        正因为没有强大的超能力，所以伊森才更努力锻炼的自己的身体、技巧，对战局、时机的把握，对地形因素的判断。\n        也正是因为没有异能，不是天之骄子，所以伊森才更加的小心翼翼，更加的谦逊谨慎，心也更狠、更冷、更决绝。\n        这并不是一个美好的世界，想要活下去，每个人都要付出点什么。\n        伊森浑身上下遍体鳞伤的模样已经是最好的证明了。\n        “嘶......吼！”\n        极远处传来了银色捕猎者巨大的吼声，是被血腥味引来的吗？它们没有鼻子啊？当然，也没有眼睛，那它们用什么来感知世界的？\n        伊森顾不得许多了，停止了无意义的猜想，无论如何，他都不该在这里多驻留了，伊森迅速收起匕首，嘴里说着第十刀，但是从约翰死透了的身体上来看，这样的伤口远不止十刀。\n        伊森急忙向前跪爬了几步，双手扒着土壤，一头扎了进去，嘴里大喊着：“别开枪，别开枪。”\n        异维度入口之外，一群士兵神经紧绷，看着一双人类的手从土地里伸了出来。紧接着，冒出了一个面部带着丝丝鲜血、灰头土脸的人。\n        啊哈？变身了？\n        进去的是一个金发白种人，出来了一个黑发黄种人？\n        “特战预备役，8号士兵，伊森。”伊森大声喊着，飞快的爬出土地，“快走，我们快走。”\n        “你是伊森？是那个为了团队孤身冲向异花的士兵？”其中一个特战组的士兵面色惊愕，满是惊讶的询问道，“你竟然没死？”\n        “对，是我，快走，快走，那些猎食者赶过来了！”伊森连滚带爬的出了土壤，飞快的站起身子，面对着一圈黑洞洞的枪口，伊森焦急的说道，“我们没时间了，那些异种生物一旦爬出来，我们都得死！”\n        一众特战组士兵纷纷看向自己的组长。\n        伊森顺着眼神望去，道：“我看到了异能者约翰被猎食者拉了进来，趁着它们分食约翰的时候，我偷偷爬了出来，我没有能力解救他！路上再解释，快走。”\n        七组组长点了点头，身份应该是正确的，事实上，在伊森单项考核过后，便进入了所有特战组组长的视线之中，他那优异的单项考核成绩是让人无法忽视的。\n        其中三组组长米兰达更是极为强硬的宣布了伊森的归属，虽然现在伊森灰头土脸，衣衫破烂，但是七组组长还是能认得出这个小伙子的。\n        就在七组组长企图再询问的时候，一只银色的大手破土而出。\n        伊森急忙向一旁跃开，下一刻，噼里啪啦，噼里啪啦......\n        那巨大的手掌显然不是人类的手掌，所以士兵们开火的动作非常的果决。\n        “这并不是只有一个出口，我们堵不住的，只能尽快逃跑，相信我，它们比我们目前所知的任何一种异种生物都要强大。”伊森大吼着，没办法，子弹的声音太大了，伊森只能扯着嗓子喊。\n        “走！路上给我解释一切！”七组组长当机立断，目露精光，留下几个士兵延缓猎食者的爬出土地的速度，带着伊森飞快跑向军车。\n        卢灵基地似乎对这次任务特别重视，七组来了大概有20余名士兵，起码开了6辆军车，位置是足够的，当然，就算是缩减几辆，位置也是够得，因为......\n        “啊啊啊啊！”\n        “这是什么鬼东西！？”背后留下的3名士兵边打边退，但是刚刚还会被子弹打退的巨大手掌，似乎有些不耐烦了，虽然被开出了一个个血洞，但是它仿佛感觉不到疼痛似的，手掌用力扒着地面，硬生生的顶着枪林弹雨爬了出来。\n        一时间，所有人都看清楚了伊森口中的“猎食者”到底是什么样的生物。\n        身高两米开外，体型巨大，四肢纤长，虽然是人类模样，但是这样的体型却显得有些畸形，而且，那一身银色的皮肤在阳光的照射下闪耀着光鲜色泽，甚至有些刺眼。\n        那猎食者的面部是如此的光洁，没有五官的脸让人看着很是难受，等等......\n        “嘶！”吃痛的银色猎食者愤怒的咆哮着，脸部突然绽放开来，如同四瓣花一样，却和花朵走向了两个极端，花朵是无比的美丽，它绽放的脸颊却是如此的丑陋，内部那一圈圈、一排排细密的牙齿也许会让密恐患者浑身酥麻。\n        “啊啊啊啊！下地狱吧！”士兵的血性也上来了，不顾一切的对着那张开的血盆大口射击，视线中，那血盆大口却越来越大，越来越近。\n        一个瞬间，一头巨大的银色猎食者已经将一个士兵扑倒在地，绽放的头颅将士兵的脑袋包裹住，疯狂的来回摇摆着。\n        而未死透的士兵在剧烈的疼痛之下，疯狂的叩响着扳机，霎时间，一片枪林弹雨。\n        “上车，快上车！”七组组长这下终于意识到了问题的严重性，急忙呼喊着，弯着腰小跑着上了军车。\n        伊森躲避着枪林弹雨，身旁是子弹飞过的声音，真是让人心惊肉跳，伊森急忙趴在地面上，向前攀爬着，好不容易来到了最近的一辆军车，伊森一咬牙，飞快起身上了驾驶座位，启动车辆，而前方，4辆车竟然已经开拔了，伊森竟然是最后一个！？\n        “嗯，我已经习惯了这样的设定。”伊森是最后开车逃亡的，这也表明，追杀上来的猎食者很有可能第一目标就是他。\n        伊森心中一横，猛地一个拐弯，并未沿着公路行驶，直接拐下了荒地中。\n        如果这世界真要如此，那么让所有的猎食者追杀自己也是个不错的选择，起码能给七组更多的逃亡时间。\n        说到底，七组落难就是因为伊森，如果伊森老老实实的爬出来，也许不会引来猎食者。但是面对着天时地利的条件，伊森还是对约翰下手了。\n        伊森并不后悔自己做的决定，约翰是一个异能者，是基地中的至宝，其身份地位不是伊森这样的普通士兵能媲美的。即便是伊森将前因后果、一切的一切都告知基地，等待约翰的也可能只是不痛不痒的惩罚或者教训。\n        约翰已经仇恨伊森到这种程度，他能阴伊森第一次，就会有第二次，日后的日子里，伊森本人，甚至伊森的家庭，恐怕也会受到牵连，伊森绝对不会允许这样的事情再度发生，所以伊森把握住了这次天赐良机，没有选择忍气吞声。\n        大仇得报，却也连累了七组士兵们，伊森重重的叹了口气，既然这样，就把所有的猎食者都引到自己这里来吧。\n        这次，猎食者不放过自己，也是应该的，伊森心意已决。\n        从空中俯瞰，这仿佛是电影结局的最后一幕。\n        一人，一辆军车，慢慢脱离了车队大部队，逐渐驶离了平整的公路，孤独的飞驰在这片泛黄的荒野之中，背后，是飞快跟来的5头巨大猎食者......",
				"added": 1587001677
			},
			{
				"comment_id": 17,
				"body": "015 回到有你的季节\n当一切已成定局的时候，伊森这个如黑白旧照片中死气沉沉的人似乎也变得鲜活了起来，从后视镜中看着急速奔跑的猎食者们，伊森双手紧握方向盘，伴随着阵阵颠簸。\n        “明明跟我打过招呼的，怎么忘了我呢，如果有眼睛的话，估计会认出我来吧。”伊森心中暗暗想着，“难道是被士兵们的子弹打疼了？惹怒了？失了智了？”\n        伊森回身寻找着装备，从备用包中拿出了一枚手雷。\n        伊森打开了驾驶座旁的玻璃，一嘴咬下了手雷拉环，手伸到窗外，心中读着秒......\n        唰。\n        手雷滑落在地，军车驶过，后方追逐的猎食者速度依然。\n        轰隆隆！\n        “嘶！！！”\n        “咿咿吚！”数道愤怒的吼声让伊森精神一振，被炸疼了么？证明有作用。\n        伊森急忙在包裹中乱翻着，发现还剩下三枚高爆手雷，后备箱中应该还有吧？可惜，伊森得开车，手伸不到那么远，如果有个队友该有多好。\n        如果，里皮在这里......\n        还是算了，一个人死就够了，为什么还要拉一个呢？\n        伊森看向后视镜中，与自己微微拉开一段距离的2头猎食者，心中的求生欲望从未熄灭过。\n        嗯？\n        伊森微微一愣，左侧后视镜中为什么只看到2头？另外那3头呢？\n        伊森急忙向右侧后视镜看去，也是两头？他们改变了进攻阵型？\n        伊森微微抬头，从车顶正面的后视镜中，看到了一头猎食者张牙舞爪的跟在自己车辆的正后方。\n        意不意外？\n        惊不惊喜？\n        刺不刺激？\n        “那是？”伊森正在思索对策，怎么将手边的资源最大化的利用，却看到了极远处的牧场。\n        它仅仅是个普通的牧场，但是伊森却无比熟悉，一连串的回忆浮现在伊森的脑海之中，那个牧场，属于哈维小镇，也就是曾经伊森生活的地方。\n        前文提过，伊森执行任务的地点是萨尔小镇，距离他生活的家乡只有三十公里的路程，而此时此刻的伊森才发现，自己在逃亡中选择的路线，竟然是自己家乡的方向。\n        牧场3公里之外，便是小镇的生活区，哪里，早已经荒无人烟，恐怕已经被丧尸群占领了吧。\n        丧尸群......那么多鲜血和嫩肉够不够猎食者消消气呢？萨尔小镇是个死城，但自己的家乡哈维镇可不是。\n        伊森再度咬下了手雷保险，心中读着秒，轻轻的松开手掌。\n        行尸走肉们，我给你们带来了五个大家伙，你们可要顶住啊。\n        伊森狠踩油门，发现油门早就踩到底了。\n        车旁的风景飞快的倒退着，急速飞驰的军车直接开出了一条直线，不顾及任何道路，只要前方没有建筑，军车就要直行。\n        但是，当军车真正驶入小镇的一刹那，伊森的心却凉了。\n        丧尸呢？行尸走肉呢？\n        伊森内心里满满的期待却慢慢落空。满腔热血被一瓢凉水从头浇到了脚......\n        死城？鬼城？空城？\n        和萨尔小镇一样！这里依旧是空空荡荡的！\n        “这？”人生的大起大落真的是太快了，伊森真的快被“命运女神”给玩死了。\n        进入镇中的伊森愕然发现，这里空无一人，不，是空无一“尸”。\n        不仅如此，伊森所面临的形式更加严峻了，他在镇里需要躲开建筑行驶车辆，而猎食者们却如履平地，飞檐走壁，无所不能，这大大的缩减了它们追捕的路途。\n        这里也是空城，那证明这里也会有进化丧尸，你们人吶，出来接客啊！？～\n        呯！\n        便利店房顶突兀窜出来一道银色闪电，狠狠的撞在了军车之上。\n        相比于进化丧尸来说，猎食者无疑更具优势。\n        进化丧尸只能攀附在军车侧门，通过干扰驾驶者来达成让军车停下来的目的。但是身体素质爆表的银色猎食者却不需要这样做，它们沉重庞大的身躯，狂暴无比的力量直接将军车撞歪了！\n        一瞬间发生的事情，让伊森完全无法反应过来，军车直接装在了建筑之上，直接撞碎了道路对面的店面，以斜角度冲刺的态势，撞开了本就碎了一块的玻璃门，大半截军车都扎进了店中。\n        而伊森，也一头撞在自己扒着方向盘的双臂上。\n        咔嚓！咔嚓！\n        伊森浑浑噩噩的趴伏在方向盘上，感受到了沉重的军车在向后方移动。\n        咖啡店外，一头巨大的猎食者双手扒着军车后部，放声嚎叫，向后不断的撕扯着。\n        兴奋中带着浓郁的嗜血气息。\n        唰唰唰......\n        剩余四头猎食者一次出现在街头巷尾，它们明明没有眼睛，看不到任何东西，却仿佛能够感知到发生的一切，同样兴奋的张开脑袋大叫了起来。\n        呼......\n        沉重的军车终于在巨力之下被拉扯了出来，浑浑噩噩中的伊森用不上任何的力气，在车辆左右摇摆之际，他的身体也因为惯性，栽倒在了半开的车门之上，随即一头扎在了地上。\n        模糊的视线里出现了一个遮天蔽日的巨大身影，伊森努力的眨了眨眼睛，却根本看不清楚任何东西，头脑一阵阵的晕眩让伊森无法在控制得了，只能安安静静的软躺在地面上。\n        沉重的脚步声、巨大的嘶吼声在这一刻都仿佛淡了下去，隐隐绰绰，宛若天际传来。\n        “Oops......”最后的最后，伊森吐出了一个单词。\n        “吼！”猎食者张开脑袋，展现着细密的牙齿和血盆大口，一手抓向伊森。\n        “呯！”\n        仿佛两台重型卡车相撞一样，一声巨响过后，一个相同吨位的庞然大物取代了刚才猎食者的位置。\n        迷迷糊糊之间，伊森并不能看清那是什么，心中那执着的信念，翻腾的欲望让他企图移动身体，远远的爬走，但是身体却并不怎么听从使唤。\n        接二连三的，数个巨大的身影突兀出现，狠狠的冲击着五头猎食者，而那五头猎食者不断的反抗着，但是出乎预料的是，双方都没有下死手的意思。\n        意识模糊的伊森并不知道拯救自己的是谁，但是那五头猎食者却知道他们的对手是谁，他们的对手，同样也是一批强大彪悍的猎食者们。\n        一场残忍的猎杀捕食游戏瞬间变了味道，仿佛异种族的流氓地痞街头斗殴一样，双方不断的推搡着，拉扯着，冲撞着。\n        不知道过了多久，伊森的双眸渐渐恢复了些焦距，大脑晕眩的感觉依旧存在，而现场却已经再没有任何猎食者的身影了，只留下了那一片狼藉的场地。\n        破烂的军车，破碎的建筑，满地的碎石土屑，以及淋漓的鲜血。\n        伊森努力的爬起来，身体却仿佛被卡车碾压过去一样，浑身上下都快要散架了，他艰难的行走着，脚步踉跄，一手扶着墙壁，又或者是任何可以支撑他的东西，被撕裂的肌肤向下流淌着鲜血，殷红的血滴不小心滑落在眼眶中，让本就不太清明的视线更加模糊了，伊森就这样一瘸一拐的走向了记忆中的方向。\n        这或许就是人的本能吧，即便是意识模糊，他们的内心总会带着身体去到一个地方，一个他们心里认为安全而又温暖的地方。\n        那个地方，叫做家。",
				"added": 1587001700
			}
		],
		"1586240297_16X9h7ik2RKWnJ3ZMacutgSe7ZevyVraLN": [
			{
				"comment_id": 18,
				"body": "> [nmitz@zeroid.bit](#comment_9_16X9h7ik2RKWnJ3ZMacutgSe7ZevyVraLN): 不，公共代理太危险了。是用自己私用的， [...]\n\n你开multiuser插件 就可以变成安全的小范围公用zeronet了。",
				"added": 1587172229
			}
		]
	},
	"comment_vote": {}
}