{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1537880954,
			"title": "Do ZeroNet devs have a chat going on somewhere?",
			"body": "I enjoy communicating via ZeroTalk and ZeroMe posts, but I feel it would be rather efficient to get a real-time chat going on with ZeroNet devs and users.\n\nThe IRC channel is somewhat active but I never see @krixano or @GitCenter or others in there.\n\nDo we already have an established chat somewhere? I remember the PeerMessage chat experiments, did those continue?\n\nIdeally we'd use something p2p, but I'm down for using a federated solution such as [Matrix](https://matrix.org)/[Riot](https://riot.im/app).",
			"added": 1537880953
		}
	],
	"topic_vote": {
		"1536836748_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1
	},
	"next_comment_id": 12,
	"comment": {
		"1536836748_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 1,
				"body": "> [blurhy](#comment_161_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): @d14na Site address changedPlease use https://0net.io/1HoRiznsHbJAqs2bmrVcSd79NTGVFp4Ju2/I deleted the private key of the old zite address.So i generated new address with a meaningful prefix\n\nYou should update the site link on your github repos.",
				"added": 1537822816
			},
			{
				"comment_id": 2,
				"body": "@blurhy Could you also write a little bit about the implementation of Horizon and how it works on the [ZeroWiki Page](http://127.0.0.1:43110/zerowiki.bit/?Page:horizon) please? :)",
				"added": 1537871816
			},
			{
				"comment_id": 3,
				"body": "> [blurhy](#comment_169_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): @mrbetter [...]\n\nThanks! Have done so and thanks for explaining.",
				"added": 1537880795
			}
		],
		"1537880768_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 4,
				"body": "Hi, ZeroLSTN in mobile form with a temp username here.\n\nI've thought about this. ZeroLSTN (and most sites) would be trivial to port to something like Electron. It would then be simple to have the Electron app use the ZeroNet daemon running on your computer.\n\nAs far as mobile devices go, Android/iOS now let you save a webpage to your homescreen and have it work like a website (Progress Web Apps I believe they're called). Not sure if those have any special OS level functionality though, I assume not.\n\nBut yes, wouldn't be too hard, and anyone could do it.\n\n(P.S. I know ZeroLSTN really needs some love, but while I'm back on ZeroNet this time I've decided to focus on the pain points of ZeroNet, such as search engine ([Horizon](http://127.0.0.1:43110/1HoRiznsHbJAqs2bmrVcSd79NTGVFp4Ju2/) is great btw), developer documentation and notifications).",
				"added": 1537881206
			},
			{
				"comment_id": 5,
				"body": "> [thunder33345](#comment_230_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): yes i think that could work but the idea that it would be more then just an iframementioning zerolstn since it is the only thing i could think of to get the MOST benefit from this, next to zerome and zeromail [...]\n\nYes one can easily just make a ZeroLSTN Android app and just load in the data from ZeroLSTN's merger sites.\n\nThis is of course a lot of extra work for someone, but if they're willing to go the extra distance then that's awesome.\n\nBeing able to port the app to Electron with as you say, removing the zero button and everything, would be nice though. I bet we could just create another URL prefix (such as the current raw one) for \"single-site mode\", which removes the floating button and sidebar. Then your electron app would point to:\n\nhttp://localhost:43110/single/ZeroLSTN.bit\n\nBtw, notifications can be done through web notifications. We could send a message through the ZeroFrame API to tell ZeroNet to send a notification that would be OS level (would appear at the side/corner in Windows/Mac/Linux, in notification bar on mobile, etc). I'm hoping to have ZeroHello do this actually.",
				"added": 1537882552
			}
		],
		"1537880954_1PBLyfpS2m3DFJpz4p4An3ko99oF5BQrgt": [
			{
				"comment_id": 6,
				"body": "> [gitcenter](#comment_364_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): There's a realtime chat on 0Play Game Center (you need the PeerMessage plugin to use it). I made 0Play Game Center and also the chat, but I've lost the private keys for the site. I'm also going to make a better mail service for ZeroNet. It'll support something like chat. [...]\n\nAlright, well I look forward to your new developments :) Supporting group chats (not just 1-1s) would be great as well!",
				"added": 1537890342
			}
		],
		"1537916011_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [
			{
				"comment_id": 7,
				"body": "Might want to stick this on a proxy, as I currently can't load this on my client (port closed).\n\nNever mind, have done so myself and now it works.\n\nYou may want to explain what this forum is for (what is FrameworkJS exactly?)",
				"added": 1537917968
			}
		],
		"1538087340_1HrQ48VceWqeGu9qmC2Y8VxUsGNSJwbNiV": [
			{
				"comment_id": 8,
				"body": "Hi @lordnet. I'm not able to see that image file (http://127.0.0.1:43110/raw/1E3x1bMj78DVgX5QoAYHc8ofEJbjX6LZ4o/fondo.jpg is blank), are you sure you added it to the site directory, and then sign/published the site?\n\nAdditionally, make sure you disable Chrome/Firefox's HTTP cache (settings in devtools), so changes appear to your site after you make it.",
				"added": 1538088577
			},
			{
				"comment_id": 9,
				"body": "> [styromaniac](#comment_133_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd):\n\nInteresting, never knew that!",
				"added": 1538092197
			}
		],
		"1538081577_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": [
			{
				"comment_id": 10,
				"body": "> [thunder33345](#comment_243_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): If anyone dare to say otherwise they are either trolls, liers or intentionally spreading misinformation!We need to get the truth out!!\n\nYeah, get the truth out of here, we don't need it!",
				"added": 1538092399
			}
		],
		"1538092400_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 11,
				"body": "> 4Kave\n\nFirst time I'm hearing of this site. As far as I can tell it's just for game trailers? Or will this feature more content in the future?\n\nThe player you've used is really nice too! Though it could use an indicator on how much of the video stream has currently been downloaded.",
				"added": 1538112923
			}
		]
	},
	"comment_vote": {
		"135_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}