{
	"next_comment_id": 8,
	"user_name": "Mybowknot1",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "净空及其所属组织净宗学会已被政府列为邪教组织，而且净空本人还有台独言论。",
			"post_uri": "1FCUxdEX5AU1HWZnph7spBmsgFeeWMzXTz_1521536785",
			"date_added": 1521542393
		},
		{
			"comment_id": 2,
			"body": "@Halo9527: 净空的问题比李洪志还严重，净空居然出书了，还是国家正规的书号，一个邪教头子居然能在正规出版社出书，中国的佛教真的完了。呆湾的星云法师居然和这种邪教头子会晤，大家要警惕星云，听说星云在1959年的时候还支持了达赖的西藏叛乱。",
			"post_uri": "1FCUxdEX5AU1HWZnph7spBmsgFeeWMzXTz_1521536785",
			"date_added": 1521545376
		},
		{
			"comment_id": 4,
			"body": "@Faith: 星云的百度百科：\n1959，支援西藏佛教“抗暴”及佛诞节，首创花车游行。任宜兰县佛教支会理事长。三重埔佛教文化服务处正式开幕。出版《十大弟子传》。\n1984，于美国洛杉矶与达赖喇嘛四次会谈。\n----------------------------\n台湾的支援是大陆支持的意思，佛教抗暴这个词和鬼子的大东亚共荣圈一样是忽悠人的，真正的名称叫做西藏叛乱，达赖正是在这一年叛乱杀死数万的西藏人民群众，最后藏独失败逃往国外。另外告诉大家一点，西藏的那个是附佛外道喇嘛教，不是佛教，也不是什么藏传佛教。而且喇嘛教还有类似苗族巫蛊之术那样的邪术，我从来不推荐别人去西藏旅游，大家千万不要接近喇嘛庙，也不要接近喇嘛，如果喇嘛问你的生辰八字还有姓名，千万不要给，喇嘛给你东西结缘，千万不要要，中了蛊你的身体就不受控制了，以前发生过这样的事。",
			"post_uri": "1FCUxdEX5AU1HWZnph7spBmsgFeeWMzXTz_1521536785",
			"date_added": 1521546165
		},
		{
			"comment_id": 5,
			"body": "@Youcanwork: 中国迟早绿化全国，当年玄奘大师在印度生活学习的那烂陀寺最后就是被伊斯兰军烧毁的。",
			"post_uri": "1FCUxdEX5AU1HWZnph7spBmsgFeeWMzXTz_1521536785",
			"date_added": 1521546986
		},
		{
			"comment_id": 6,
			"body": "@Youcanwork: 现在也就日本暂时没什么绿绿，不过几十年以后也不好说。",
			"post_uri": "1FCUxdEX5AU1HWZnph7spBmsgFeeWMzXTz_1521536785",
			"date_added": 1521547162
		},
		{
			"comment_id": 7,
			"body": "密勒日巴与五位女人搞邪淫双身法之事实证据\n\n法振\n（以下内容有括号中，有标明『法振注：』者为法振之批注说明，其余为原著中之译者张澄基之括号说明）\n\n密勒日巴大师歌集上\n\n第三十一篇长寿女神与空乐瑜伽      译者张澄基\n\n于火酉月之初八日深夜将过之时，在溪水之畔化身（佛陀密勒尊者）的寂静茅蓬中，忽然出现一片广大的殊胜光明，然后尊者就听见有众人交谈的声音，心中忖道：【是什么人来了呢？】立刻就嗅到过去从来未闻嗅过的一种特殊香气。\n吉祥长寿女珠宝严饰（带着她的姐妹们前来朝谒尊者）。其中一位手持各种杂香；一位捧着丰富的各种饮食；一位拿着许多乐器；另一位拿着许多绸缎的衣服；还有一个手捧着各种鲜花。五姊妹先向尊者顶礼，绕行多次.，变化出各种适意供品奉献尊者后，五人齐声唱道：\n\n【至尊具相上师宝，生赋宿根具暇满，上师诸佛为立名；喜笑金刚是尊讳；\n生身父母为立名，密勒闻喜是尊称；天下众生齐歌颂，呼君成就大惹巴！\n具此三名稀有士，于此王母峰左侧，溪河罗搭汗之畔，龙王海螺出妙音，\n能满众愿之胜地，稀有药谷溪流傍，专心一意习禅观；舍弃一切世八法，\n解脱三有之系绊，如是修士甚稀奇！吾侪具相五姊妹，以神通力今来此，\n出妙乐音悦意语，为君娱耳作供养。莲花、海螺、具图纹，以及象形（※法振注：请参考附录之注１： 萨迦派(花教) 说明具象女及诸明妃女之差别）\n\n四相母（※法振注：请参考附录之注２：莲花生大士于《亥母甚深引导》之「观察手印母相」中，明妃分为外相、内相、密相、真实相之四种相）\n\n，吾等姊妹各具足，求赐事印之加持。未识尊能赐允否？降、旋、提、散四要道（法振注：于射精前后，控制精液明点的四种方法。）\n\n尊亦熟稔能行耶？如识此法速赐予！此为决定空行道。无上密续曾有训，（已得堪能瑜伽士），应行召摄『众』明妃，或天，或龙，或罗叉。\n一切承事供养中，事业手印最殊胜。是故吾等今来此，尊身赤裸发威光，祈君明鉴赐加持。】\n\n五姊妹唱毕此祈请歌后，尊者答道：\n\n【今夜『月至』上方时，耳闻美歌传妙羲。\n雪山鹫峰晶髻畔，紫色祥云作宝幢，\n众星闪烁似花丛，彼处有汝古郎居。\n汝寿经劫命长远，具大成德『世罕见』， 此乃断杀果报也。\n\n汝福洪大似闻天，此乃断悭果报也。\n汝之眷属咸听命， 此乃忍辱果报也，\n汝心向往于善业，此乃精进果报也。\n如今与我相遇者， 昔日善愿果报也。\n\n以上甚深缘起歌，应与义合作交谈。\n依胜那诺传承故， 我于气脉得自在。\n万千一切供养中，如法事印最殊胜，\n是故应知四手印，各各性相『及证量』。\n莲花具彩能增乐，海螺速生大喜乐，\n画纹深幽得无漏，象形促证诸法空。（※法振注：莲花、海螺、画纹、象形为女明妃之性器特征，详请看注１）　\n\n美艳吉祥长寿女，身离过失无缺陷，\n智慧密处莲花中，有『诶』形之『榜』亨，\n方便之宝蓝色『吽』，呸字能阻二明点，\n方便智慧交合已，双融大乐供养成。\n四喜以及四剎那，既是四身之体性。\n降时应如龟行降，旋时应于中脉旋，\n逆提如野兽转变，散时行解脱手印。】\n\n（※法振注：藏密将智慧与方便，当作为男喇嘛与女明妃之暗语；\n\n男女二根性器互相交合，双方达到高潮射精时称之为双融，则此双身法事业供养算是完成了；\n\n其中『降』是指观想种子字于梵穴之白明点下降乃至射精时，要如龟行一样慢慢下降而射出；\n\n『旋』乃观想精液明点从中脉引导至脐下盘旋合鼓二脉相会之处；\n\n『逆提』是将于欲泄精时，将精液明点收缩而延长射精时间；\n\n『散时』是射精时观想精气回流，而散入脉轮中）\n\n『明』者涅盘之道也；『点』者大乐一味也。\n『事』者各种作为也；『业』者空乐交融也。\n『手』者此彼相会也；『印』者轮涅双成也。\n『事』者作此作彼也；『业』者为彼作伴也;\n『手』者空乐无别也；『印』者不越于外也。\n\n等持疾道承事路，依此贪道而行持（※法振注：行男女双身法），汝亦决定得解脱，我亦持住无生地。\n噫戏！具相宿善女！善根具足『甚稀有』！】\n\n歌毕即行事业手印。五女又献上丰盛的上妙饮食，以身口意三门供养，使尊者心悦满足。\n（※法振注：双方唱完了前戏调情之歌后，五位明妃女即献身供养，密勒日巴与明妃即进行了６P之杂交双身法）\n\n五姊妹中为首的是吉祥长寿女，其它是：拉息雪山的着曼宿来女；领巴崖的满母.，尼泊尔的错漫母，和玉磨雪山的山神女。其中以吉祥长寿女与尊者之事业手印最为殊胜。\n\n这是那堪能勾摄非人事业女之大惹巴喜笑金刚酬答琼境的山神吉祥长寿女时所唱的歌曲，其名为空乐智慧云鬘。经二惹巴向尊者供献曼达，祈请开示后，尊者笑而许之，『乃笔之于书』。\n\n三味耶！.密！密！密！\n\n以上『四个』有关长寿女求法的故事中，包括：说法者尊者喜笑金刚之『训诲印』；请法者空行五姊妹之『秘密印』；和撰述者法师菩提惹咱及寂光惹巴之『三昧耶印』。以上三印次第合成之传法故事，实甚难稀有，极为殊胜焉。\n\n（法振评：古代帝王虽后宫三千佳丽，但也顶多是一次搞一两个女人，但是白教祖师密勒日巴却可以同时与五位女人搞6P杂交性爱，这在世间法上实甚难稀有～～！\n\n但是这又与黄教祖师宗喀巴同时与九位女人搞10P杂交比较起来，密勒还是略逊四筹，『淫』不过宗喀巴！所以这就是为什么藏密四大教派，黄教的地位较为崇高的原因之一吧？",
			"post_uri": "1jfm62A9TyY7qv8WiQhFgbehXaqDKcpFS_1534407597",
			"date_added": 1534489767
		}
	]
}