{
	"next_comment_id": 7,
	"comment": [
		{
			"comment_id": 1,
			"body": "Dell did not refund your money? \n\nBTW, I heard that Dell's non consumer series like Latitude have much better support than consumer series.\n\n> I asked around if I could have my order delivered to somebody in the US, and he would forward it to me.\n> the order might be canceled because of some obscure export regulations?\n\nI think it is not necessary to tell Dell that you are outside US since you do not require Dell to ship to you directly. Registering a new account at us.dell (if needed) and fill the shipping address with your ex-coworker. How your ex-coworker deliveries the laptop to you has nothing to do with Dell.\n\n> This week I could finally chat with a support representative. \n> He couldn't find my order in the system neither ...\n\nSo there is a bug in their system dealing orders paid with bitcoin?\nMaybe you can ask your friend to contact pre-order sales,\nsaying something like \"I am considering to buy a laptop. I can only pay bitcoins. But one of my friend ordered a laptop one month before, and his order has not been delivered yet (and cannot find his order in the system).\" Pre-order sales might be more motivated to contact internal technical department to fix the issue (and solved your order not shown in the system issue).",
			"post_id": 10,
			"date_added": 1472905454
		},
		{
			"comment_id": 2,
			"body": "\"diver support for linux kernels\" s/diver/driver/",
			"post_id": 13,
			"date_added": 1475486075
		},
		{
			"comment_id": 3,
			"body": "> Thus I stay with mainstream clothing products, sometimes even vanity brands. I imagine that is also the reason most people buy closed source software or trade their privacy for using flashy services.\n\nSociety has some kind of structure. That effect of that structure (gravity) drives people to mainstream clothing and software.",
			"post_id": 44,
			"date_added": 1574582122
		},
		{
			"comment_id": 4,
			"body": "Cannot understand why Purism shipped this phone when it is barely usable.",
			"post_id": 45,
			"date_added": 1575702578
		},
		{
			"comment_id": 5,
			"body": "> [caryoscelus](#comment_1_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): I find Riot/matrix a good combination of having encryption (though it's only optional), ease of use and convenience features (e.g. unlike Tox: offline messages (because federation), easy multidevice, groups, web client)\n\nMozilla recently decided to switch to Riot/matrix from IRC.",
			"post_id": 48,
			"date_added": 1577529977
		},
		{
			"comment_id": 6,
			"body": "AFAIK, Mattermost does not have end-to-end encryption. Slack and Zulip also do not have end-to-end encryption.",
			"post_id": 48,
			"date_added": 1577530847
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"2": 1,
		"4": 1,
		"12": 1,
		"13": 1,
		"18": 1,
		"45": 1,
		"49": 1,
		"55": 1,
		"56": 1
	}
}