{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1517520332_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1562369938_1Q8XUnyrMaL3M7y6UWUMgLNMmiE7nsr53R": 1,
		"1524692872_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1561847289_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1546086964_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1527007067_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1568410746_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1521970229_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1517256960_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1518945446_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1556558677_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1552755084_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1551542405_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1527410242_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1528386725_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1571325180_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1528234320_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1560773982_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "> [xcape2net](#comment_11_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): As far as anyone knows the FBI has compromised ALL publicly-available encryption and messaging programs.  The justified speculation is that is why the truecrypt people closed their company and gave their code to Veracrypt.  The only code that you can be sure doesn't have a backdoor is the code you write yourself.  I tried that myself , but  no one wants to use it, because it isn't zero knowledge.  I created a very simple message board that is encrypted with openssl, where the person who sends a message and the person who receives it are totally disconnected from each other, because there are no accounts.  Seems like this is what a lot of people would like to use, but they won't use it, because they don't trust me.  So, the only code you can trust to be uncompromised by the FBI or the programmer is code you write yourself.\n\nThis is not only about the crypt self.\n\n1) it must by asynchronous. Code by public key of friend so only friend with his secret key can read.\nAnd signed with own secret to show the friend own identity. Not any central signing !!! Just exchance between friends communicating together. Every has other secret/public key fror different communications!\n2) komplicated alrgorythm on primary numbers.\n3) Multichannel mix of meny crypted communications in a wide network area with meny routing points.\n4) Nobody knows who write to who.\n\npractical example\n\na mailing list\nover this can every mail to the list\nand every get every messages\nso does nobody know, who write to who\nonly the right receiver can read a message for him\nand nobody can know it who was it",
				"added": 1567371872
			},
			{
				"comment_id": 2,
				"body": "> [xcape2net](#comment_13_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I'm not exactly sure what you're asking, so I'll just describe the way my https (TLS 1.2)  message board website works.  First, there is no logging of anything except that the message itself is recorded along with a message number (randomly generated and unique to each message) and a password chosen by the user (must be > 11 characters, etc.).  The person who writes the message transmits the message number and password to the message receiver through any other method that he wants, which depends on how secure he wants his message to be.  The person who wants to read the message goes to the website and enters the message number and password to see the message.  So, there is no way for a third party to know who the message sender or receiver are or how to tie the two together.  The message is automatically deleted two weeks after is is recorded, whether it is read or not.  People, didn't like my system for a number of reasons which just come down to them not trusting me.\n\nI can just tell\na little bit of security - do not write a message\na better security - crypt the message\nbest security - do not think what do you want to write\n\nthis is the same like\na little bit of security - do not connect a system to any network\na better security - do not start a system\nbest security - do not construct a system\n\nmy idea or the idea is in the absolution of anonymity\nthe really best anonymity is the hidden, non-visible, or better not exist one\n\nthe problem is not in the anonymity self\nbut in the character of the anonymity\nvisible to all others\n\nI think about metadata versus anonym id",
				"added": 1567637321
			}
		],
		"1568410746_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 3,
				"body": "https://www.freemake.com/ convert of meny codecs\nif any not in freemake, add it from\nhttps://codecguide.com\nhttps://codecguide.com/windows_media_codecs.htm\n\nhm hm hm\n\nhttps://www.microsoft.com/en-us/p/vp9-video-extensions/9n4d0msmp0pt?activetab=pivot:overviewtab",
				"added": 1568412296
			}
		],
		"1568628122_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 4,
				"body": "OpenVPN as PtP/tun (point to point) or as tap (network layer 2) [ethernet]? \nwhen it runs in PtP mode then needed Ethernet to Ethernet bridge over PtP",
				"added": 1568632676
			}
		]
	},
	"comment_vote": {
		"11_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"2_1EgzWjmHScPyRx64GHH2bNXpGsbbshKjPA": 1,
		"13_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1_1DJEfWgdJ3rGnqCrKwLrBdQGodRaEBkAry": 1,
		"3_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"4_1CiFGk8MdmQAYacFejYdjUkQcN5jYmoDYh": 1,
		"6_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"14_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"93_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1_1LJMKSLPgM8fqQSMRrLzWB2DhVm1zoEVfZ": 1,
		"2_1FCr9fd6iAqPa7AWfbNcQm9AWVJZhkG53N": 1,
		"2_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1_1ErxHxUEptPABYktaSbc93xGXnCLfsLaWo": 1,
		"1_15bXfYrgn11ULbJ71nHqDrERcxNotpYsqP": 1,
		"1_12Yr2XxxBj7UKPFc6rJUKYJesfVVujHSRc": 1
	}
}