{
	"message": [
		{
			"body": "Bien le bonjour",
			"date_added": 1457884143400
		},
		{
			"body": "Comment vous êtes tombé sur ZeroNet?",
			"date_added": 1457884293763
		},
		{
			"body": "J'ai découvert ça via Numérama, et je suis épaté de voir à quel point ça fonctionne bien.",
			"date_added": 1457885175834
		},
		{
			"body": "Qu'est-ce que zeroverse?",
			"date_added": 1457885754708
		},
		{
			"body": "Y'a pas vraiment de différence entre 0net://zeroverse.bit/ et 0net://zeroid.bit/ non?",
			"date_added": 1457886050778
		},
		{
			"body": "Juste un site peu accepter l'un est pas l'autre c'est ça?",
			"date_added": 1457886090148
		},
		{
			"body": "@zarka d'accord c'est bien ce que je supposais, merci de la confirmation",
			"date_added": 1457886640266
		},
		{
			"body": "Juste après avoir fait un tour sur 0net://zeroverse.bit/ j'ai voulu m'enregistrer mais pour ça faut envoyer un BitMessage ou un mail, mais à qui?",
			"date_added": 1457887083261
		},
		{
			"body": "Merci bien, si j'avais su que BitMessage était une app hors ZeroNet ça aurai été plus facile ^^ merci beaucoup @zarka",
			"date_added": 1457887639523
		},
		{
			"body": "Des évolutions sont prévu pour ZeroChat FR?",
			"date_added": 1457888438096
		},
		{
			"body": "@zarka Ok je vois, parce que je trouve qu'une notification sonore quand on est mentionné manque, ce genre de chose.",
			"date_added": 1457888890383
		},
		{
			"body": "Re, jme pose une grosse question, comment sont stockés les messages? Parce que y'a pas de BDD non?",
			"date_added": 1457916513945
		},
		{
			"body": "Parce que sur IRC si je ferme mon onglet, je perd tous les messages... Mais là non.",
			"date_added": 1457916573885
		},
		{
			"body": "Bien le bonsoir les gens",
			"date_added": 1457998080849
		},
		{
			"body": "T'as parlé de Namecoin tout à l'heure, t'as un lien pour en miner?",
			"date_added": 1457998211710
		},
		{
			"body": "Je comprend pas un truc là, pour miner du Namecoin faut miner du Bitcoin et on chope du Namecoin en rab?",
			"date_added": 1457998690232
		},
		{
			"body": "Je trouvais ça chelou aussi, même si mon pc fait le café je vais pas lui demander de miner du Bitcoin, il se contentera de faire du Namecoin",
			"date_added": 1457998932283
		},
		{
			"body": "La difficulté du réseau est moins élevé ^^",
			"date_added": 1457998946665
		},
		{
			"body": "Je veux juste assez de Namecoin pour acheter un ndd sur ZeroNet",
			"date_added": 1457999067139
		},
		{
			"body": "Mais c'est pas drôle ça ^^ moi je veux faire comme quand le dogecoin avais débarqué",
			"date_added": 1457999167202
		},
		{
			"body": "J'avais miné 1M de Dogecoin en 48h",
			"date_added": 1457999199374
		},
		{
			"body": "Et ensuite la difficulté avais augmenté",
			"date_added": 1457999209408
		},
		{
			"body": "Environs 500€, vu que c'était les débuts du Dogecoin y'a eu beaucoup de scammer avant d'avoir un système de transaction fiable. Donc j'ai perdu 1/3 de mes Doge bêtement",
			"date_added": 1457999325699
		},
		{
			"body": "Et après les rapports Doge/€ était faible donc ça vallait plus rien",
			"date_added": 1457999364163
		},
		{
			"body": "Donc juste si la je pouvais avoir un peu de Namecoin d'avance avant que ça soit hard à miner et que ça coute une blinde je serai content ^^",
			"date_added": 1457999439614
		},
		{
			"body": "C'est pas mal en effet mais j'ai été con, les erreurs de jeunesse, j'ai tout flambé dans des jeux steam --'",
			"date_added": 1457999490440
		},
		{
			"body": "Le probleme de ce chat, c'est la latence je trouve. Après ça vient de ZeroNet mais c'est chiant quand même",
			"date_added": 1457999739654
		},
		{
			"body": "Nan mais genre ton message sur la connexion pas stable est apparu après que j'ai enoyé mon message, mais tu l'avais envoyé avant.",
			"date_added": 1457999882593
		},
		{
			"body": "ça y'est le minage à commencé, je regarderais demain si ça donne quelque chose autre que le bruit de mes ventilateurs de pc ^^",
			"date_added": 1458000158431
		},
		{
			"body": "35Mh/s ça va pour un pc pas dédié au minage ^^",
			"date_added": 1458000265342
		},
		{
			"body": "En fait quelque chose à l'air de déconner --' le pc hurle pas à la mort alors qu'il devrait --'",
			"date_added": 1458001461722
		},
		{
			"body": "/me abandonne le minage",
			"date_added": 1458001756855
		},
		{
			"body": "C'est trop chiant j'arrive pas à selectionner ma 980m pour miner",
			"date_added": 1458001793350
		},
		{
			"body": "Et miner sur le CPU ça va pas être pratique",
			"date_added": 1458001826293
		},
		{
			"body": "J'ai vu vite fait les regex en cours l'année dernière, c'était chiant --'",
			"date_added": 1458001990154
		},
		{
			"body": "Et t'as vidéo de tout à l'heure fonctionne pas chez moi",
			"date_added": 1458002155977
		},
		{
			"body": "En fait c'est firefox qui merde avec, elle charge à l'infini, mais c'est passé dans un autre navigarteur.",
			"date_added": 1458002293581
		},
		{
			"body": "Pour les regex, on les a vu dans des scripts shell mais à peine, genre 3 tp de 3h",
			"date_added": 1458002367790
		}
	]
}