{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1542174163_1Hw7w7Swdeexw86XmyfMHLbsSpzzH4yk5z": [
			{
				"comment_id": 1,
				"body": "Well, since this is a p2p network, all kinds of user scores should be relative. Simply because if you create a \"global\" karma score based on majority of votes/cpu time/money spent, the minorities will become discriminated by the majorities in various ways. The golden example is pedophilia - do you consider it spam? If no, can you promise that 51% of users will not abuse the \"report as spam\" button to simply make the unwanted content go away? Surprisingly, the network like ZeroNet is only free, if other can share the content YOU don't like.\n\nThe Freenet Project brings some interesting examples of relative trust models with prime one being Web Of Trust (https://github.com/freenet/wiki/wiki/Web-of-Trust). In simple terms, you share the content with a group of interests and based on that group members' opinions the new content is either visible to you or not. You control how much you trust each identity's capability to evaluate content and set the thresholds of the filtering system. So, if there are Windows and Linux fans hating each other, they will form two circles in which they will \"like\" the content of own circle and \"hate\" the content from the other one (except of course the maniacs who like both systems), thus presenting to them only the content they like but also not blocking the other content from existence.\n\nTo adapt it on ZeroNet ground, first of all it would probably be required that content becomes encrypted in general and only decrypted while using the trust-aware interface. So, imagine a bulletin board zite with one small public registration page and lots of encrypted content in the background. The registration of your ZeroID nickname in the board costs you solving 5 captchas or spending 0.000001 BTC (which would mean some changes in the ZeroNet client) and needs you to generate a key (or set of keys) for submitting and retrieving content from the vortex. The key is then published together with a small description of what your preferences are (just a hint) and available for anyone to collect if they feel like having mutual interests with you. The question remains on how to scale it to all zites with one list of keys.\n\nI suggest a solid research based on the existing solutions to the distributed trust problem followed by a thorough discussion of different approaches possible in ZeroNet. I would gladly participate in such discussion but have not really enough time to do all the research myself. For what I know, Steem's model is currently flawed in a few ways and they are going to tweak it by protocol changes in the near future (which I'm not so sure to solve their issues after all). Curators seem as an easy temporary solution - anyone publishes their list of yes/no opinions on content and users can subscribe to it, just like in AdBlock.",
				"added": 1542203820
			}
		]
	},
	"comment_vote": {}
}