{"next_paste_id":1,"next_comment_id":0,"paste":[{"paste_id":0,"description":"The Russian IQ Topic","body":"> [caryoscelus](#comment_12_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Lol, 0net must be getting popular if pro-putin trolls have already appeared\n\nKreml literally hires them.\nhttps://www.youtube.com/watch?v=L5w3Ib1cyJM\n\nYou may want to first read \nhttps://en.wikipedia.org/wiki/Margarita_Simonyan\nand then remind Yourself that the \"Russia Today\" is the Russian version of the \nBritish BBC, Finnish YLE, Qatar's Al Jazeera and then take a look at the OFFICIAL VIDEO that she put out as a joke to counter the various kinds of accusations towards her Russia Today:\nhttps://www.youtube.com/watch?v=SQQwBfux9i0\n\nThe Russia Today propaganda hub operates, rents its office, from a very prominent journalist's hub in London that is physically very close to various political offices in London: The original link:\n https://www.facebook.com/pages/Russia-Today-Millbank-Tower/238449969642135\narchival copy:\nhttps://archive.is/P1Qcq\n\nA \"fun fact\":\nhttps://www.youtube.com/watch?v=XK1QGmLJclw\n\n\nI find the Putin's version of the Hitler's \nhttps://en.wikipedia.org/wiki/Joseph_Goebbels\nthe Margarita Simonyan to be VERY TALENTED. Very talented.\n\n> [missesrobot](#comment_106_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB): I was born in Russia. ..And while I am against Putin, it's probably safe to assume that you hate him for different reasons ... so I don't think I agree with this thread. Russia will not bow to the will of other superpowers.\n\nI have born in Estonia, where about 30% of the local population speaks Russian natively. My Russian is so bad that I can't even converse in Russian, but I do know that much that indeed, regardless of whether the missesrobot is a government troll or not, the Russian CULTURE is such that they will not bow to any superpowers, no matter how bad things get for them. At least the culturally higher class, educated, PROPER, Russians do hold their ground and they will crumble before they will give in. \n\nAn average Russian Jill/Joe, however, is another matter. A thing to keep in mind with Russians, specially the culturally lower ranks of the Russian population, not the ones with the \"Petersburg aristrocratic mentality\", is that due to the strict adherence to HIERARCHY they do not feel responsible for their actions the same way a western person feels responsible for its actions. In the case of the dumber part of the Russian population the lack of personal responsibility for one's actions gets transferred to actions that they do carry out on their own initiative and that leads to much greater LACK OF PERSONALLY PERCEIVED GUILT for things like murder, stealing, robbing, endangering others due to sloppiness, etc. But, I emphasize that the smarter bunch of Russians that have the \"Petersburg aristocratic mentality\", which may also include some lowly educated Russians, at least I have seen some exceptions, are very responsible, very hard-working, principled people, who, indeed, WILL STAND THEIR GROUND, NO MATTER WHAT.\n\nSo, is it true that Russians will bow to Europe or U.S. or China? My summary is that certainly not the \"culturally upper\" class, regardless of how poor or rich they are, but I do believe that the majority of Russians, specially at the Moscow area, will bow to anybody to get some short term gains. Putin is from Saint Petersburg, a hard liner, so official policy wise expect no concessions. \n\nHowever, what regards to the \"low IQ\" of Russians, then that's kind of relative. The Russian rich are certainly stupider than the American rich, the American \"1%\", because the American rich spend their money for buying off politicians, financing lobbying groups, MAKING SURE THAT WHOEVER IS IN WASHINGTON and in control of the U.S. gigantic army and intelligence apparatus, WILL NOT TELL the American rich, how the American rich have to live their lives. The Russian rich, on the other hand, DRINK VODKA in stead of organizing assassinations of KGB/FSB officials. Like in any battle/war, there is the concept of smart retreat, taking cover, so moving from Russia to the West is understandable, but the problem with the Russian rich is that once they have \"taken cover\" in the West, they stop working and just drink and enjoy beautiful women. So, from that point of view, its 1:0 in favor of American rich, the Russian rich lost the IQ round for sure. With the exception of \"patents\" and copyright law, which in my view should be totally abolished, the following video explains, why the Russia will never be economically as successful as the west, NO MATTER WHAT THE KREMLIN DOES and NO MATTER WHO IS IN KREMLIN, except, when the Russians decide to CHANGE THEIR CULTURE:\nhttps://www.youtube.com/watch?v=HFSDVrnAXZI\n\n\nBasically, the current Russian culture is that in Russia\nNOBODY OWNS ANYTHING, except the Czar.\nFor everyone below the Czar \nEVERYTHING IS ON THE LOAN FROM THE ONES, WHO ARE HIGHER IN THE HIERARCHY. \nIt's like a pack of dogs, where a dog with a \"higher rank\" can take anything from a dog with a \"lower rank\", a lot like a human master can just reach out and take a bone literally from its dog's mouth and the dog just stays quiet, looks up with sad eyes and wipes its saliva off of its dog lips with its dog paw. Obviously that kind of social arrangement does not encourage private investment, including investment in the form of one's own labor. \n\nThat explains, why Russia is economically such a dump and why the main form of business that is CAPABLE OF GETTING ANYTHING DONE AT ALL there is either a \"state enterprise\" or a \"state enterprise loaned to an oligarh to operate\". If the workers at the Oligarh's factories suffer \"too much\", then Putin tells the oligarh that the oligarh has 3 options: get shot, rot in jail and get beaten to death or  pack its bags and move to the West, so that someone else can try to get those \"state enterprise\" factories in order so that the workers get paid. And then the cycle continues: the new oligarh gets the factories to some stable level, gets \"too comfortable\", the sales of the produced goods descends and the Putin replaces the 2. oligarh with the 3. oligarh. Obviously none of those oligarhs are intellectuals. They're white collar crooks and political operatives AT BEST, so they do not find any personal urge to spend any of the factory's moeny on research and development, which is almost the same in the West with western megacorporations, except that, unline the CEO of a western megacorporation, the Russian oligarh does not have any start-up companies to buy, because all smart people, who do technical innovation, flee from Russia.\n\nhttps://archive.is/Q6A3t\n(As of 2018_02 the commercial can be closed from the x button.)\nhttp://foreignpolicy.com/2015/05/06/the-short-life-and-speedy-death-of-russias-silicon-valley-medvedev-go-russia-skolkovo/\n\nThe worst thing for Putin or whoever the Czar is in Kremlin in 2018 is that in that kind of an environment the Russian \"substitute products\" project will not succeed, because to start start production at Russian territories investment is needed, but only a small handful of western and Chinese FOOLS dare to invest into Russia and even the Russian oligarhs take their foreign currency (euros, dollars) to western banks, but to import the goods that Russia does not produce itself, Russia needs to export. The main Russian export articles are gas and oil\nhttps://www.youtube.com/watch?v=EucLgHzuZaw\nbut the old oil fields start to become DEPLETED. To pump oil from new, non-depleted, oil fields, pumps and other infrastructure has to be built to those new oil fields. That requires investment and if the Kremlin gets most of its money from oil and gas exports, the oil price decreases and even the oil production volume decreases, because the old oil fields become depleted, then the Kremlin does not have the money to make the investments. The Russian rich flee to the west, the west does not dare to invest to Russia and the tech savvy start-up builders, who might come up with cheaper, technically new solutions for drilling, also flee to the west, then it's only economic downfall for ordinary Russians. \n\nhttps://www.youtube.com/watch?v=__UAUgPKhXM\n\nSomewhere at the Wild-Wild-Web there's even a dark joke that at some point the ordinary Russians will believe the emptiness of their refrigerator more than the propaganda from Russian TV channels, but how long will it take to reach that point, is an open question. What is sure from the past is that the shoddier the Russian economy is, the more intense and more patriotic the Kremlin's propaganda is. At least that has been the trend so far. Putin can, of course, surprise here, he can change his strategy. From the western perspective, the Putin is actually a good thing, a nice, rational, actor, because if Putin were not the Czar, then the Czar would probably be Chechen president, \nhttps://en.wikipedia.org/wiki/Ramzan_Kadyrov\nwho is known to be a total violent thug. The Putin is a kind of slick, high class, Petersburg style guy, who is also a thug and a murderer\nhttps://www.youtube.com/watch?v=iBH_9qZnS2Y\n but the Putin is relatively civilized murderer, if compared to the Ramzan Kadyrov. The only way, how to deal with the Russian hardliners(the word \"hardliner\" is actually a compliment and does not, in itself, include accusations of murder or other abusive behaviour), Russian thugs and the slick murderer Putin is to communicate with them from a position of strength.  \n\nA \"fun fact\": 2016_06 Russian labour is cheaper than Chinese labour.\nhttps://www.youtube.com/watch?time_continue=300&v=2sBYzJTTQJA\nAs of now, at least about 2018-2016=2 years have passed from that statement, where they told that the low labor costs allow to \"build new industry\". I guess people in Russia can now evaluate, how that has failed or succeeded.\n\n> [kai0](#comment_447_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): Russia   only have one person can be president that  is Mr. Putin. no other person has ability to be a president, just like China only have Xi one person know everything and go everywhere tell people how to do. that is why I consider as low IQ nation. not like USA, so many smart people can be president.\n\nI gues that my previous sections in this comment give an answer to that. Honestly, I wish that the Petersburg hardliners would separate from Moscow and create a proper European state. If Belarus can be separate from Moscow, then why can't Saint Petersburg with all of the northern areas, including Murmansk form a brand new European state. They could finance themselves from the gas revenue from the \nhttps://en.wikipedia.org/wiki/Nord_Stream\nand if Europe can contain the Moscow mess by helping Saint Petersburg to gain independence, then the European Union will probably offer the Saint Petersburg any loan and unreturnable \"European aid\" that the Saint Petersburg needs for breaking loose from the Moscow. There is absolutely no monetary reasons, why Saint Petersburg can not form its own state and later join the European Union. It's not even an original idea:\n\nhttps://youtu.be/D2X3XmmGzt0?t=1m39s\n\nSo, there are, obviously smart people in Russia, but unless the Russian CULTURE changes, the Russia WILL ALWAYS BE A DUMP. The last time, when Russia was able to compete with the West was, when it occupied a lot of slave nations, who did all of the real work, but as those slave nations got too adopted to the Russian way of doing things, they became more like the original Russia and that, of course, ended with the economic collapse of the militarily most powerful power on Earth, the Soviet Union. \n\n--stidenote--start---\nThe Americans had more nukes, but as of 2018_02 I believe that the Russian space technology made the Soviet Union militarily far more powerful than the U.S. was. For example, back in the day the Americans, with all of their great space programs, moon landings, etc. were not CAPABLE of achieving the kind of fully autonomous space flight that the Soviet knockoff of the American space shuttle achieved. With the Concorde the Soviets were also the second, but they improved on the French design by adding the \"front wings\" to their \nhttps://en.wikipedia.org/wiki/Tupolev_Tu-144#/media/File:Aeroflot_Tupolev_Tu-144_1977_Volpati-1.jpg\nThe Ekranoplan \nhttps://en.wikipedia.org/wiki/Ground_effect_vehicle\nis a 100% Soviet invention. Back in the day the Americans were not capable of creating the kind of moon rovers that the Soviets were able to do:\nhttps://en.wikipedia.org/wiki/Lunar_rover\n--stidenote--end----\n\nThank You for reading my comment.\nI hope that it was helpful for understanding the \"Russian situation\".\n","language":"text/plain","encrypted":false,"added":1518174181}],"comment":[]}