{
	"title": "China Suning page home 2017-12",
	"description": "My Blog.",
	"links": "- [Starnet](http://127.0.0.1:43110/1Fc6zxe5FSJkUFsH2qmJ2eZcFwCa3Yr7yD)",
	"next_post_id": 6,
	"demo": false,
	"modified": 1514104675,
	"post": [
		{
			"post_id": 5,
			"title": "hide - that could be a joint development choice between Suning and Rapp",
			"date_published": 1514091439.264,
			"body": "Blog post body"
		},
		{
			"post_id": 4,
			"title": "China Suning",
			"date_published": 1514091328.976,
			"body": "http://www.suning.gov.cn"
		},
		{
			"post_id": 3,
			"title": "joint development opportunities contact",
			"date_published": 1514090930.75,
			"body": "tianfuedu@163.com\n\nsend me an email if you are interested in joint development opportunities. \n\nSuning can be reached at its official site:\n\nhttp://www.suning.gov.cn"
		},
		{
			"post_id": 2,
			"title": "New blog post",
			"date_published": 1514090844.091,
			"body": "作为肃宁传统主导产业，已形成珍稀毛皮动物养殖、市场集散、原皮硝染、裘皮服装加工、研发设计、内外贸易完整的产业链条，2005年被中国轻工业联合会和中国皮革协会授予“中国裘皮之都”荣誉称号。拥有全国最大的裘皮原料交易市场——中国尚村皮毛交易市场；华北地区最大的裘皮服装商城——裘都商城和华斯国际裘皮城；建成了国家毛皮质检中心、毛皮信息发布中心；华斯公司2010年在深交所成功上市，被誉为“中国裘皮第一股”。目前毛皮产业拥有中国驰名商标2个、中国名牌产品1个、省著名商标5个、省名牌产品5个，“肃宁裘皮”被国家质检总局批准为“国家地理标志保护产品”。2015年，裘皮服装产业产值达到150亿元。\n\n针织服装产业：现有企业800多家，从业人员近3万人，文化衫、保暖内衣国内市场占有率分别达到70%和40%，成为华北地区乃至全国文化衫和保暖内衣的重要生产基地；“凯帝斯”被认定为中国驰名商标；卓尔公司生产的高档内衣达到国际先进水平，并在全国22个省建立了营销网络，“雨诗桐”被认定为省著名商标；中原纺织成为解放军总装备部承制单位；万里舞台幕布成为全国规模最大、最专业的舞台幕布生产企业，产品成功打入北京人民大会堂、国家会议中心和国家大剧院；靖宁邮政帆布公司成为全国最大的邮袋生产厂家，年产各种邮袋近600万条，占全国生产总量的50%。为加快针织服装产业发展，投资8000万元，规划建设了占地50亩的万里镇针织服装展示销售中心，力争200家小微企业入驻，不断提升产业规模和档次。\n\n电力装备产业：现有企业74家，从业人员8000多人，主要产品有电工工具、电力金具、安全工具、开关保护四大类、3000多个品种，产品占据国内32%的市场份额。石兰公司750千伏输变电产品通过国家电网公司鉴定，成为国内唯一一家通过鉴定的民营企业。为促进产业集群发展，我们规划了千亩电力装备产业园，力争打造成承接京津冀电力装备需求的大型生产基地。今年完成北京唯众集团整体搬迁项目建设，加快推进沧能铁塔扩建项目，开工建设河北宇洋、肃北、信亚等3个电力设备生产项目，抓好北京送变电公司整体搬迁等在谈项目，吸引京津及周边相关企业入驻。\n\n乐器文化产业：目前全县拥有民乐加工企业60多家，从业人员7000余人，年产各类民族乐器50余万件。主要产品有二胡、京胡、琵琶、古筝、扬琴、阮等100多种民族乐器，产品销往全国各大中城市及美、日、英、港澳台等二十多个国家和地区。其中，河北乐海乐器公司成功入选“国家文化产业示范基地”，生产的扬琴、琵琶产销量居全国首位，扬琴全国市场占有率达70%，“乐海”商标被认定为中国驰名商标。该公司与北京星海集团合资建设总投资25亿元的乐器文化产业园项目，近期开工建设。建成后可年产钢琴4万架、民族乐器100万件、西管乐器10万支，年销售额可达27亿元。项目建成后，集生产、销售、展示、教学培训、乐器表演、文化交流于一体，成为华北地区重要的文化基地。\n\n鱼竿渔具产业：现有企业摊点1000多家，从业人员1万多人，渔竿渔具加工生产线达230余条，主要产品涉及五大品系100多个规格品种，产品占到国内中低端市场份额的60%以上，涌现出四海渔具、凯发渔具、永胜宁威等一批网上销售额超过千万元的龙头企业，产品远销韩国、日本等20余个国家。各类鱼竿渔具网店1000多家，网店销售额占总销售额的50%以上。为加快产业发展，投资1亿元，规划建设占地50亩的河北乡渔具产业园区，力争220家小微企业入驻，不断壮大产业规模。\n\n出版印刷产业:该产业是肃宁县的特色文化主导产业之一，河北乡素有“教辅之乡”美誉，图书发行业已有四十多年历史。全县具有批发资质的发行企业共9家，其中河北考源书业有限公司获得了国家一级批发资质；河北文欣朗悦文化传播有限公司、河北万卷文化有限公司、河北三品图书有限公司、河北智跃图书有限公司、河北华冠图书有限公司、河北涛琪图书有限公司、河北华翰书业有限公司等获得了国家二级批发资质。肃宁从事图书销售的人员遍布大江南北，已形成了完善而稳固的销售网络。目前，全县书刊印刷企业8家，图书经营企业30家。全县拥有熟练技术工人6000余人，从事教辅用书推销人员达8000多人，发行的教辅用书共计25个系列，400多种，年发行量6000万册，发行范围遍及全国30个省、市、自治区的近万所学校，年销售额达5亿元左右。2014年成功引进了投资2亿元，占地面积150亩的北京鹏润伟业印刷项目，目前该项目已建成投产，书刊印刷、包装印刷年销售收入可达1亿元。为加大千亩出版印刷产业园的招商力度，肃宁县人民政府聘用鹏润伟业印刷何伟先生为招商总代理，并成立了肃宁县鹏润印刷产业园投资管理公司，负责产业园的招商、投资等事宜。千亩出版印刷产业园建成后可形成包括设计、出版、印刷、发行、原材料供应、仓储物流为一体的完整产业链条，同时，也涉及到创意策划、网络营销等相关产业门类，打造京南地区最大的出版印刷基地。目前已有出版发行、原材料供应。\n\n  肃宁县紧紧围绕“十三五”总体要求，按照“打造千亿园区、建设产业新城”的目标，坚持“同城化”和“产城教融合”的发展理念，抢抓京津冀协同发展机遇，以省级经济开发区、省级物流产业聚集区和相关乡镇为载体，大力实施“区中园”战略，全力建设“六大千亩产业园”，将千亩华斯产业园打造成引领国际国内裘皮产业发展的行业龙头，千亩乐器文化产业园打造成中国北方最大的乐器生产基地，千亩出版印刷产业园打造成北京印刷产业承接基地，千亩裘皮服装加工园打造成面向国内外市场的裘皮服装加工基地，千亩保税物流园打造成区域性综合保税物流中心，千亩电力装备产业园打造成承接京津冀电力装备需求的大型生产基地，力争到2020年开发区跻身省级科技示范园区行列。"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your blog has been successfully created!"
		}
	]
}