{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Partido Pirata - http://partidopirata.org/",
			"body": "Apoio Partido Pirata: https://apoio.partidopirata.org/\nPiratas - Coleta de assinaturas\nFaça download da Ficha de Apoio e ajude a fundar o PIRATAS. \nhttp://partidopirata.org/wp-content/uploads/2014/06/apoiamento.pdf\n\nTelegram :Pranchas de Boas Vindas > https://telegram.me/joinchat/AIIj3j7N8luFAxw8aMRTVw\n\nMumble Partido Pirata: https://mumble.partidopirata.org/\nServidor: mumble.partidopirata.org\nPorta: 64738\n\n\nPIRATAS\n\nO que é o Partido Pirata?\n\nSomos um partido político em formação, com a sigla \"PIRATAS\", que se pauta pela democracia plena, pela transparência pública e pelo empoderamento das pessoas, com o objetivo de defender institucionalmente os direitos humanos fundamentais por meio do respeito à diversidade social, à liberdade de crença (e descrença), aos direitos civis e políticos, à privacidade individual e à liberdade de expressão.\nO que Piratas fazem?\n\nTrabalhamos em prol de em um ponto de equilíbrio entre o produtor e o consumidor de cultura; em modelos de produção e acesso à cultura sem intermediários atravessadores e sem o peso de uma carga tributária desproporcional; em serviços públicos essenciais universais e de qualidade; no livre acesso ao conhecimento, educação e cultura; no acesso à rede mundial de computadores como direito fundamental; na inclusão digital como uma necessidade; no compartilhamento de conhecimento como uma obrigação; e no uso de padrões abertos e software livre como soluções.\nPor que não somos apenas mais um partido?\n\nPrimamos por uma atuação distribuída, horizontalizada, participativa e colaborativa, de modo que o compartilhamento, abertura e transparência nos permitam construir conjuntamente as propostas do coletivo, superando a lógica fisiologista e personalizada da política partidária tradicional.\nPor que confiar em piratas?\n\nAcreditamos em um ponto de equilíbrio entre o produtor e o consumidor de cultura; em modelos de produção da e acesso à cultura sem intermediários atravessadores e sem o peso de uma carga tributária desproporcional; e serviços públicos essenciais universais e de qualidade; em livre acesso a conhecimento, educação e cultura; no acesso à rede mundial de computadores como direito fundamental; na inclusão digital como uma necessidade; no compartilhamento de conhecimento como uma obrigação; e no uso de padrões abertos e software livre como soluções.\nComo dar seu apoio?\n\nEstamos organizando uma operacão em massa para coletas de assinaturas. Por enquanto você pode nos ajudar coletando assinaturas e guardando as fichas. Baixe a ficha de apoiamento, siga as instruções de preenchimento e aguarde - Em somente algumas semanas iremos atualizar este site com instruções de como proceder para enviar as fichas. Contamos com você!",
			"added": 1463679046
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}