{
	"messages": [
		{
			"body": "Ja mam strach już wychodzić, a może być niebezpiecznej gdy bezrobocie wzrośnie.",
			"date_added": 1586104152337,
			"key": "ea73542c-723d-23f6-7b01-2f5119bdad2d"
		},
		{
			"body": "Nie jestem fanem teorii spiskowych, zastanawia mnie jednak coś innego związanego z 5G. Dlaczego firmy wespół z rządami tak bardzo nalegają na budowę sieci bez żadnych konsultacji ze społeczeństwem? A priori uznali, że trzeba tą sieć zbudować, a dopiero później zastanowią się do czego ją wykorzystają. Ktoś w ogóle przedstawił kiedyś jakieś argumenty, w jaki sposób społeczeństwo skorzysta na budowie tej sieci? Nie wydaje mi się, aby przyniosło to jakąś radykalną zmianę, wszak wszystkie technologie wynalezione do tej pory skupiają się na coraz sprawniejszej kontroli obywateli. Na pewno budowa sieci 5G nie przyczyni się do zmniejszenia ubóstwa, czy nierówności społecznych, a to rzeczywiście byłaby korzystna zmiana. W niektórych miastach niszczone są maszty i nie są to pojedyncze przypadki, coś co bardziej zaczyna przypominać społeczny opór i żadne polityk ani dziennikarz nie zada pytania: \"Może ludzie nie chcą tej sieci?\".",
			"date_added": 1587824949737,
			"key": "14472f64-b94f-6deb-820c-8851cdb96d81"
		}
	],
	"images": [],
	"pversion": 2,
	"private_messages": [],
	"group_messages": [],
	"settings": [
		{
			"feed_notifications": 0,
			"bot_welcomemsg": true,
			"parse_profile_links": true,
			"parse_quotes": true,
			"user_mention_badge": true,
			"show_timestamps": true,
			"avatar_type": 1,
			"avatar_size": 64,
			"message_design_type": 2,
			"theme_body_light": false,
			"theme_message_dark": false,
			"theme_navbar_light": false,
			"disable_emojis": false,
			"seed_all_emojis": false,
			"delete_all_emojis": "Delete",
			"reset_options_to_default": "Reset"
		},
		{
			"optsV": 29
		}
	],
	"extra_data": [
		{
			"last_seen": 1587824949804,
			"avatar_file_name": "",
			"auth_address": "1PP4Upn97Ah4VxNvWFnzb3QQSoSvqar8T9",
			"avatar_type": 0,
			"public_key": "At/GS6euqyl1Wg271IgRPGab/pXiDLmEpEn43fQQvsIO"
		}
	]
}