{
	"next_topic_id": 12,
	"topic": [
		{
			"topic_id": 1593004202,
			"title": "Tribler",
			"body": "is it really safe ?  will it replace the two step search/download torrenting process ?",
			"added": 1593004201
		},
		{
			"topic_id": 1594119047,
			"title": "Cardano & Sia",
			"body": "buy Cardano. Use !1b on Sia",
			"added": 1594119045
		},
		{
			"topic_id": 1602495392,
			"title": "ERC20 Desktop open source wallet ?",
			"body": "I can not find any descent ERC20  token wallet open source for Linux. I checked Myetherwallet but I'm quite reluctant as I'm still need a browser to open it. Any help ? Thanks",
			"added": 1602495389
		},
		{
			"topic_id": 1604659936,
			"title": "Population control - Total world sterilization through the Covid19-21 vaccination",
			"body": "The destruction of the human DNA. Vaccines takes years to make not because lack of money but as the result of the observation of adverse synonyms with animal test, money can not accelerate that, no way to shortcut this process. If you think, the labs and governments are here to help, you are wrong, you are on your own. MAy be this is your last chance to make a plan before the total reset that is coming.\nThe following links are videos from an expert, unfortunately in the shadows cause the Spanish and the country where this guy lives, but don't look at him, don't use the subtitle, just look for someone friend or family who can translate this for you as this is very important and noone in the English world is saying it.\nhttps://youtu.be/OZIMqzxTc6I\nhttps://halturnerradioshow.com/index.php/en/news-page/world/canada-going-tyrannical-2nd-total-lockdown-isolation-camps-for-refusers\nhttps://www.bitchute.com/embed/4oT6ORjGAfqg/\n\nGoogle for this guy\nDr Luis Marcelo Martínez \nMédico genetista MN 107982\nPresidente de la Sociedad Argentina de genética médica.\nCon Maestría en Ingeniería genética y biología molecular (Univerdidad de Favaloro).",
			"added": 1604659932
		},
		{
			"topic_id": 1606099517,
			"title": "The Great Reset - Prepare yourself and your family for what is coming",
			"body": "https://www.weforum.org/agenda/2020/06/now-is-the-time-for-a-great-reset/",
			"added": 1606099512
		},
		{
			"topic_id": 1608992596,
			"title": "Bill Gates real story",
			"body": "https://odysee.com/@corbettreport:0/whoisbillgates:3",
			"added": 1608992590
		},
		{
			"topic_id": 1611277411,
			"title": "The Great Reset & the transfer of wealth",
			"body": "you can watch all the video if you like trading but the bet educational part is in minute 43:06\nhttps://www.youtube.com/watch?v=dtzxINkjMuA",
			"added": 1611277404
		},
		{
			"topic_id": 1633740636,
			"title": "is I2P usefull ? what for ?",
			"body": "",
			"added": 1633740628
		},
		{
			"topic_id": 1635185231,
			"title": "Wim Hof. Have you heard about this guy ?",
			"body": "was this method hidden from us ? did someone else know this before him ?",
			"added": 1635185222
		},
		{
			"topic_id": 1636969808,
			"title": "is BTC going to collapse because quantum computers ?",
			"body": "https://www.rt.com/business/540274-ibm-quantum-computer-chips/",
			"added": 1636969798
		},
		{
			"topic_id": 1637424236,
			"title": "Qbits vs Bitcoin",
			"body": "How many Qbits are needed to get all aleatory numbers to solve the next block before the in the BTC ?",
			"added": 1637424225
		}
	],
	"topic_vote": {},
	"next_comment_id": 76,
	"comment": {
		"1594119047_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 1,
				"body": "Cardano is in the best historic moment and with a lot of potential. Sia project is getting better and better, the Tb is les than 2Eur/month and you can mount it as a drive and export it as NFS ! Both projects are very nice. Filecoin will make Sia price go down so make your contracts now !",
				"added": 1594136289
			}
		],
		"1601932131_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": [
			{
				"comment_id": 2,
				"body": "Just a continuation of the book Secrets of Amenti.  Forget about the Jews, there is a much higher Plan and older than the Jews. http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f1_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA_item_1+type:book",
				"added": 1601942043
			}
		],
		"1602495392_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 3,
				"body": "I have already stake my ADA with this walllet but I can not store ERC20 with it. Thanks for you answer.",
				"added": 1602659649
			}
		],
		"1604659936_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 4,
				"body": "> [swashbuckler](#comment_58_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): Probably no one is saying that because it can't hold the criticism? xDHow can we test it? [...]\n\nThis is coming from someone who knows more than you and me what is this is about. if you think governments and labs are good guys and they are making all the efforts to save you, I recommend u to watch \"The Century of the Self\" may be you get the idea.\n\nConspiracy theories, jajaja. don't question anything, just belive he TV, you are free! you are free to vote ! this is democracy ! BS . poor Bill Hicks, George Carlin....",
				"added": 1604677555
			},
			{
				"comment_id": 5,
				"body": "> [rolouzis](#comment_2_16sZ53MFsJNXQGth1LUAPgbsR9K2ZtYNW2): They intend to destroy spirituality and connection with Lord God!\n\nCorrect, and in that process to reduce population and make the rest obedient workers.",
				"added": 1604677943
			},
			{
				"comment_id": 6,
				"body": "> [driud](#comment_165_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): These are not vaccines.This is an injection that has the \"DNA\" alternator hidden in it.There is a change in human DNA.A human-like mutant arises.That is the purpose of these vaccines.\n\nCorrect this are not vaccines, he refers to them as \"compunds\" just watch it and find somene to translate and watch with you.",
				"added": 1604678022
			},
			{
				"comment_id": 10,
				"body": "> [apolly](#comment_1_13Vz54JPp7uho5FaMyyi9hv7yi8zJHVhkv): Total bs\n\nGood, you get vaccinated, if you do not think you should better get it asap, please.",
				"added": 1604679948
			},
			{
				"comment_id": 11,
				"body": "> [sauron](#comment_2_1DMAiK5GgQzieWiy24LKz6NDkHJo8m5CLU): bs\n\nplease get vaccinated, we need more like you. enroll ! test it ! we need you.",
				"added": 1604680071
			},
			{
				"comment_id": 15,
				"body": "> [praid4](#comment_4_14qehPmJvdCxmQ3Dfs5gEHovBXxPhTgzcQ): What the fuck is this?\n\nSomething to understand, but if you think government is protecting the people, forget about this post and carry on.",
				"added": 1605083010
			},
			{
				"comment_id": 18,
				"body": "> [ksnde](#comment_45_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji): Wikileaks declassify everythinghttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1605111093_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji/WIKILEAKS+WAS+DECLASSIFY+EVERYTHING\n\nthanks for the link to a lots of things that makes to miss the point here and now.",
				"added": 1605321752
			},
			{
				"comment_id": 19,
				"body": "> [1snwargdtitor](#comment_9_1KpxpDPkuqhKBbeXNb4v2pnEoPXTTSnYgh): Is there a transcript for this? Unfortunately I don't know any fluent Spanish speakers. I have my doubts about this and would like to see it for myself.\n\nwell, this guy is an expert in the matter and he explains the risks of this compounds made by RNA etc (wronlgy called covid vaccine). just google for him, there are some articles you can cut and paste in translate. he is not alone bwt, lots of doctors and other experts explain same in many other languages, do you homework check all opinions. This is not against or in favor war, this is to understand the human race will be for first time in history rat labs. as he explains before you put this in humans you have to test with animals, and wait and observe. there is no money can accelerate this process, then after some years of observation and successful results in animals switch to humans, that is the only way not to extinguish the human population in the planet by mistake, for example.",
				"added": 1605752245
			},
			{
				"comment_id": 20,
				"body": "> [ksnde](#comment_53_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji): Laitman (Judas, Kabbalah) says about world order.http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji/1605703828-laitman.mp42 (RUS)http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji/1605704445--8r9XnItPK7g.mp4\n\nI do suggest to estudy the book \"secrets of amenti\", forget about the author, just check how the book links the nodes.",
				"added": 1605752339
			},
			{
				"comment_id": 24,
				"body": "> [mxh69420](#comment_10_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx): what if that apple you ate yesterday, is not an apple, but it has dna mutators on it too? sounds crazy, right? thats because i made it up. anyway, do you have any proof that they are making dna mutators instead of vaccines? or was it something you made up? [...]\n\nKeep Calm, get vaccinated and Carry On, do not question anything, just enjoy life, TV , work and family. talk about sport, believe in god, you are safe. And remember, US reach the moon in 1969 !",
				"added": 1605862531
			},
			{
				"comment_id": 25,
				"body": "> [mxh69420](#comment_16_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx): oh, now youre the one telling me not to question anything?\n\nthis is called sarcasm, google for it.",
				"added": 1605977925
			},
			{
				"comment_id": 26,
				"body": "Now I found another expert in UK. Watch it before it goes.\nhttps://www.youtube.com/watch?v=D1onx7LaNio",
				"added": 1606013859
			},
			{
				"comment_id": 27,
				"body": "> [dv1](#comment_26_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA): Now I found another expert in UK. Watch it before it goes.https://www.youtube.com/watch?v=D1onx7LaNio\n\nLook for it here if it's gone.\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f5_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA_item_116+type:video",
				"added": 1606017298
			},
			{
				"comment_id": 53,
				"body": "read this, then get your conclusions. https://en.wikipedia.org/wiki/Eugenics",
				"added": 1609031642
			},
			{
				"comment_id": 54,
				"body": "> [betaathe](#comment_1_19yGjJuztHvDMQprqT7cxPjzbjfthnf3nQ): lolWhat a bs article\n\nThis is wikipedia, I don't think you are able to read and get any conclusion rather than repeat whatever the shit you watch on TV. Get the vaccine urgently the world needs you to take it.",
				"added": 1609102168
			},
			{
				"comment_id": 55,
				"body": "> [betaathe](#comment_3_19yGjJuztHvDMQprqT7cxPjzbjfthnf3nQ): What's in Wikipedia? No one ever said that the covid vaccine could sterilize anyone. [...]\n\nCompletely connected, eugenics and the population control via vaccination. And yes, Eugenics is in Wikipedia.",
				"added": 1610057935
			},
			{
				"comment_id": 57,
				"body": "> [wotansboy](#comment_4_1CtNr38ULvYNaBZfApLSCpJZiMaxzKZeUW): I still don't get how one can believe that the Covid vaccine will sterilize anyone.Do you even understand the basic concept of RNA and DNA?\n\nDo you ? watch the video. Good luck.",
				"added": 1610238136
			},
			{
				"comment_id": 58,
				"body": "> [wotansboy](#comment_14_1CtNr38ULvYNaBZfApLSCpJZiMaxzKZeUW): I cant. Seems like the video was removed because the youtube account was terminated\n\nit does not surprise me, try others look for this guy \"Dr Luis Marcelo Martínez genetista\"",
				"added": 1610289227
			},
			{
				"comment_id": 59,
				"body": "> [wotansboy](#comment_15_1CtNr38ULvYNaBZfApLSCpJZiMaxzKZeUW): the first thing i found lolhttps://chequeado.com/el-explicador/son-falsas-varias-afirmaciones-del-medico-luis-martinez-que-circulan-en-videos-virales/\n\nsure, just believe in a faceless site. This guy is risking while whoever is saying that is false is just anonymous. Obey and watch TV.",
				"added": 1610311437
			},
			{
				"comment_id": 60,
				"body": "> [dv1](#comment_58_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA): it does not surprise me, try others look for this guy \"Dr Luis Marcelo Martínez genetista\"\n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f5_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA_item_118+type:video",
				"added": 1610311732
			},
			{
				"comment_id": 67,
				"body": "> [jager](#comment_8_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX): I mean forget sterilization conspiracies. Based on serology and not MSM fear tactics, you have <1% chance of even experiencing any symptoms if you come into contact with COVID. According to Pfizer, you have a 9.7% chance of \"serious\" side-effects. You are essentially guaranteed to get SOME cold/flu symptoms on your second dose. All for up to a 95% effectiveness. NO THANKS. Imagine willingly giving yourself a cold.\n\nConspiracies ? 9.7% serious side-efects ? you get the jab, I will wait let's say 110-15 years to think about it.\nhttps://www.rt.com/news/514450-covid19-reduce-male-fertility/",
				"added": 1612353997
			}
		],
		"1603297511_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": [
			{
				"comment_id": 7,
				"body": "holly shit. this is like Hitler and the fluorine in the water supply.",
				"added": 1604678138
			},
			{
				"comment_id": 8,
				"body": "> [qarmy](#comment_17_1V2NizfDpQK4UxTp54zsm9AtkWeSv2BXe): Cannot connect to the video, but it sort of makes sense to an extent. [...]\n\nbecause making it with the virus does not confirm that everyone will get it. with a compulsory \"vaccine\" against this virus, not only ensures everyone will get but also who ever is not getting it will be a criminal.",
				"added": 1604678288
			}
		],
		"1604435439_1KSMTkAKXzbiXa7d2HWy3rNVSUJDXExpXg": [
			{
				"comment_id": 9,
				"body": "yep, David Icke was saying this from the last 30 years, this is where the world is going unfortunately.  this is not only Canada. The whole system is slavery by debt, here is how the Capitalims is replaced by a totalitarian new system, but first, pay the debt.",
				"added": 1604678503
			}
		],
		"1604792929_1ETarTu7fyokpgRoBMiGZc8L3FwnDTGstL": [
			{
				"comment_id": 12,
				"body": "it would help a lot in transparency but the problem is the \"democracy\" and the \"Freedom\" those are just words, they do not really exist, just in some minds. We just given options, generally two, we choose the less bad, four years pass and we will be in the same situation of election but now with more debt. again and again, now COVID so who knows...may be something worse is coming.",
				"added": 1604806907
			},
			{
				"comment_id": 13,
				"body": "Technology can not solve it alone. other things must change :\nmaximum age to start presidency = 60, minimum age to start presidency = 35\nreelection indefinite with possibility to be removed by new election every 3 years\nadministration and/or president accountable for corruption with life sentence after presidency\neverything tracked via blockchain, votes, budget, expenses, public polls\nindividuals get one ID can operate in the citizen blockchain when they get 18, before that they can play in the testnet same rules.\nPolitical parties can only make publicity over internet via their web page, no TV, no adds in movies, no social media crap, no fake news crap, citizens must go an READ the proposal, mission, etc. which is also stored in blockchain as a promise.",
				"added": 1604854146
			},
			{
				"comment_id": 14,
				"body": "we can't, we were made to follow the \"one\". it is in our DNA, that the human race pyramid. But transparency, justice and vote power will make the difference, today none of this is happening nowhere.",
				"added": 1604856247
			},
			{
				"comment_id": 22,
				"body": "I checked this https://www.youtube.com/watch?v=T8LiGZhK-bg and realized the voting process of the \"land of the free\", the country that takes democracy to the oppressed countries. I'm not against or in favor to any party. I'm talking about the voting democracy illusion we live in.\nNot only democracy does not exist because candidate \"A\" or \"B\" are set up but also the result of the election of \"A\" or \"B\" id rigged. This is happening in every country in the world. Meanwhile we do not ensure one person one vote and also making the process and the technology used OPEN SOURCE, voting does not matter. If this two essential things are not achieved it does not matter what you think what you vote.",
				"added": 1605828590
			},
			{
				"comment_id": 23,
				"body": "> [mxh69420](#comment_8_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx): im no blockchain expert but what would happen if somebody just generated like millions of keys and voted with them?\n\nPublic-key cryptography and hashing combination should ensure one person one vote, what you are saying is that I can create bitcoin from my arse.",
				"added": 1605862102
			}
		],
		"1605027510_15BPbETpjWmZoVdS4YGMg4qWiguXi1ASGz": [
			{
				"comment_id": 16,
				"body": "Watch TV, the TV is the truth. god bless Bill Gates. we need to wake up an THINK, we are on our own. I do not care if believers gets vaccinated and can not have child or die, may be this is the vaccine for, to \"clean\" the rif raf.",
				"added": 1605083305
			}
		],
		"1605036890_1HtCCTkHppfVtiHtQ9ef2QXeopTP9wSMyt": [
			{
				"comment_id": 17,
				"body": "just wait another 4 year of stupidity, democracy is sick and will never work with very old people in power.",
				"added": 1605083445
			},
			{
				"comment_id": 21,
				"body": "> [jesuschrist](#comment_15_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW): The typical American is covered in the blood of innocents from foreign wars. Many of you will be judged by the father.\n\nTrump is the first president in 40 years not signing a war document in the US. Wait and you will see what Kamala gonna do.",
				"added": 1605785402
			}
		],
		"1606099517_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 28,
				"body": "> [reichama](#comment_44_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe): What are good steps to take to prepare oneself?\n\nDo you homework, think, read every opinion (David Icke, Klaus Schwab, etc..) and formulate your own, make a plan and execute it. this is going to impact life as we know it, it won't be quick but gradual. Focus on being healthy, review your diet, do exercise.\n\nStop gaming, doing porn, watching TV & MSM, crap movies and focus, time is very important, use it properly.\nCheck your debt make a plan to get rid of it or at least most of it, inflation will make life harder, if you have money saved in the bank, well, it is time to use, as this is an Emergency. Buy some crypto, research first !!\n\nLiving in the city in a flat does not looks good for the new scenario, start looking to move to a flatter area not too far and not to close to a city. If you are intrepid enough countryside is the best.\n\nStock pile some food and water for at least 4 months, SARS-COV-2 will still be used to drive our lives in the process.\nChange your car, look for PHEV, at least you will be able to move without petrol.\n\nIf you are using mac, sell it now, buy \"T Series\" Lenovo kinda and install linux, force yourself to learn it. Sell everything you are not using.as well. also luxury stuff and clothes, these may worth cero under hipper-inflation.\n\nInvest in the dentist (and everyone in your family), get reviewed and fixed, I do not recommend being in home arrest with a dental problem, that will kill your brain quickly, pay for it do not use the dental insurance or you will end up worse. This is and investment.\n\nCollect educational material for home schooling, your kids may no be able to go to school or you will have to decide to give them better education instead.\n\nThink \"what if\" internet is down? no google maps, etc..Switch to Telegram, sounds stupid but having a backup communication with yours and your people network could be helpful if WhatsApp goes down. Also think \"what if\" no electricity, no water, no gas, yep, it may happen, may be short period week or two, so careful filling your freezer as no light bye-bye food.\n \nMake a packing list with the essentials just in case you have one hour to run out, put some IP cameras and home security so you can monitor everything OK to come back.\n\nThis is not the apocalypse, they need us, they need our taxes and work, check WEF partners page and see if your job (or your partner) is somehow related to any partner, if not, look to start something on your own and also look to change your job, unfortunately we will need to ensure some income to stay in the grid.",
				"added": 1606141110
			},
			{
				"comment_id": 29,
				"body": "> [claude](#comment_45_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1): Telegram isn't going to work if the internet is down...\n\nwhatsapp went down I remember, not the internet. but good point, also let me add if you don have electricity you may be not be able to browse the internet, same problem if you are dead.",
				"added": 1606158445
			},
			{
				"comment_id": 30,
				"body": "> [edgelordofdecent](#comment_689_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): It is best to have to data you want downloaded.\n\nYou will end up with ton of stuff, use Calibre, Docfetcher and Recoll to browse your data afterwards.",
				"added": 1606161077
			},
			{
				"comment_id": 31,
				"body": "Lot's of thoughts going on here, from computer software to survival skills in the woods and also China.\n\nI would go back to the focus topic which is, COVID  is the beginning of the Great Reset, and prepare yourself for this change, which BTW is going to happen. Some people and MSM think it will take some time recover to what we were before MAR 2020, forget it, that is an illusion, as Klaus Schwab mention many times in his speeches. \n\nThere is always the question of democracy controlled by the few with rigged elections, political propaganda budgets, controlled MSM, restricted reelection period, impeachment  etc OR less democracy and a quasi totalitarian model, like liders appointed by blood lines, 1984 kind of (https://www.imdb.com/title/tt0087803/), etc. as Noam Chomsky shows in this video , http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f1_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA_item_117+type:video\n\nThe bottom line is, there will be a moment, possibly short, that you will not be able to have essential services like electricity or food supply, or gas, or water. who knows, but that moment will happen, it will be forced or as a consequence of street fights who knows.\n\nAlso once we are reset, there will be new rules, like for example school, travel and work only if you get the shot like Bill wants, among man others.\n\nThe point is, you can be in favor or not about this , but you should never say to your children or grand-children (if you have) I didn't know it was coming. So stop porn, stop TV, stop gaming, stop tik-tok and use internet to make you think and question stuff, talk to friends and family about this, debate, respect others opinion even if they do not research.",
				"added": 1606299715
			},
			{
				"comment_id": 32,
				"body": "> [radiator](#comment_4_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE): hi - how do I \"follow\" you in netzero? have some very similar thoughts.  [...]\n\nFollow yourself, don't follow anyone.",
				"added": 1606300156
			},
			{
				"comment_id": 39,
				"body": "> [test123a](#comment_31_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ): Althea\n\nNice info. Do you know any mesh net we can build at home and does not use internet as a path ? LORAwan ?",
				"added": 1607005769
			},
			{
				"comment_id": 41,
				"body": "> [sqmnf3ixy2lgfpz7](#comment_3_19ZkyYnsyNaf8RoMf7ZCJWTD6zEqHnTKjq): Always a disaster coming - then it never happens. Next real disaster? NO ONE will be prepared for it......\n\nWell, we are , we are talking about it.",
				"added": 1607393814
			},
			{
				"comment_id": 42,
				"body": "> [userofzeronet](#comment_2_1MBqetKY7oWBPVBEJwuppDWkCteFmPSxZJ): Do you think martial law will be enforced in some countries?\n\nI do not think \"by force\" prove to work. I think it will be gradual and induced by propaganda by any means, the masses will ask for the reset instead not the other way. However, there will be already some pilots in development countries out of the scope of the MSM. The power is in the information, people should build a new internet, it is very interesting , take a look how  https://roarmag.org/essays/win-back-the-internet/?source=techstories.org",
				"added": 1607458116
			},
			{
				"comment_id": 43,
				"body": "> [edgelordofdecent](#comment_714_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Die great rezet ist gut for du\n\nSicher, hol dir zuerst den Impfstoff, du Idiot",
				"added": 1607458543
			},
			{
				"comment_id": 50,
				"body": "Do not forget about this !",
				"added": 1607978560
			}
		],
		"1606601124_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": [
			{
				"comment_id": 33,
				"body": "Deep Web is not for making money.",
				"added": 1606695998
			},
			{
				"comment_id": 34,
				"body": "> [claude](#comment_48_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1): tell that to the seven gazillion market ads I see every time I try to browse a Tor links list\n\nwell , you are not browsing the \"dark web\", gazillion adds are not .onion adds. You are surfing normal clearnet but hiding your IP through Tor (theoretically as everyone in the darkweb knows Tor is a CIA/NSA honeypot). Therefore, the adds you see are the adds triggered by the IP you are out to the internet. Darkweb sites are .i2p, .onion, zeronet, and freenet sites among others, I do not see money on adds coming from visiting those sites.",
				"added": 1606768711
			},
			{
				"comment_id": 35,
				"body": "> [sturmwaffle](#comment_13_16fvyFvBWz9rDSRtHF54mMqTwVqhUpj5eE): I absolutely agree. A lot of people still believe Tor to be a viable anonymity solution when it is literally sponsored by the federal government of the United States...  [...]\n\nI can not remember very well its name, but I came across a plugin for the browser which browse in the background random pages generating a hell of crap for the guys taping your IP for analysis.\nVPNs for sure are shit, all of them, I'm checking Orchid, a kind of VPN based on Crypto so decentralized, may be this is the answer for walking internet without anyone following you.\nIf you need private communication between two or more parties I recommend to take a look at I2P and Freenet.",
				"added": 1606855807
			},
			{
				"comment_id": 36,
				"body": "> [claude](#comment_49_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1): http://submarhglcl66nz6.onion/http://gdarku42fzpyrfra.onion/gdark/search.phphttp://3bbaaaccczcbdddz.onion/http://visitorfi5kl7q7i.onion/search/http://xmh57jrknzkhv6y3ls3ubitzfqnkrwxhopf5aygthi7d6rplyvk3noyd.onion/cgi-bin/omega/omega [...]\n\nwhen you use internet from your computer IP the web page you are visiting tracks the IP of the visitor, this is required because it has to replay to that IP the requests. inside the Tor network, your computer encrypts and encapsulates the request in an envelope which is sent to the first Tor router, this router does the same with the envelope, only the last router (gateway) to the web page you are requesting opens the envelope and sends it to the web page, the web will track and respond to this tor gateway IP which will encapsulate and encrypt inside a new envelope sending the response back in the same way router to router till the last router which will open the envelope and sends it to your computer browser. Cutting short, the IP you are showing to the web page is the last tor router IP. However, end router can see total or partially you request/response therefore not too much privacy if someone (NSA/CIA??) control the routers.",
				"added": 1607003885
			}
		],
		"1606985120_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": [
			{
				"comment_id": 37,
				"body": "people, privacy is dead. It does not exist. the question is the value of the information vs the effort to get it. we have our devices and routers are tapped, linux is a meme. I use this place because the people using Zeronet feels something is wrong with the system, you want a change, you think different, otherwise use 4chan. certainly high secret military may not use internet at all.",
				"added": 1607004766
			},
			{
				"comment_id": 38,
				"body": "> [geck4bee](#comment_1_1JRReFAonxccQRM3AbrGFEEc2VqckGzo56): I'm here because the coverage of the presidential election has revealed the censorship of  major SNS.As far as I know, Zeronet is the most useful decentralized network right now.\n\nRigged elections are a factin every (US democracy like) country since Kennedy assassination.",
				"added": 1607004985
			},
			{
				"comment_id": 40,
				"body": "> [kapec](#comment_86_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): Coz I have bunch of hard drives and no idea what to do with them.Ultimately I want to run it on non-internet-dependant meshnetwork. But It needs to get more popular first.\n\ncheck a storage coin and offer the space cheap. Sia, Storj, Filecoin",
				"added": 1607013326
			}
		],
		"1607283206_1GmSP4jfJEvcrTYaDmsfocWCXETGPghSDH": [
			{
				"comment_id": 44,
				"body": "> [sj29msn5kz0ldmn](#comment_25_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4): of course they have a cure for their own manufactured controlled epidemic virus since its start, but they dont care about their slave citizens so they wont give it to them soon probably\n\nhttps://www.youtube.com/watch?v=ELP2EFVOOYc",
				"added": 1607459244
			}
		],
		"1607500928_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": [
			{
				"comment_id": 45,
				"body": "how easy are I2P and IPFS ? What does it make the difference ?",
				"added": 1607514660
			}
		],
		"1607699045_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": [
			{
				"comment_id": 46,
				"body": "Actually, Covid19 is HIV-2.0 version, same lab.",
				"added": 1607718567
			}
		],
		"1607744205_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 47,
				"body": "Sounds interesting, please explain the requirement and this solution, may be someone pick it up !",
				"added": 1607787391
			}
		],
		"1607730992_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 48,
				"body": "shutdown the TV stations, all of them, everywhere. Free internet to let the people think and share.",
				"added": 1607787550
			},
			{
				"comment_id": 49,
				"body": "> [rfd9vcye7ghqtv6t](#comment_6_14H5KfL4SR2RkpxjdQAvqzKBTaA1q4dKf3): nobody watches tv anymore... youtube, netflix has full control\n\nAt least you have to go  for it. TV instead is to be 24/7 \"ON\" in every house, that is what I call a weapon of mass destruction. I do not have Netflix, I use youtube to watch some DYI, where is the control then ? Everyone, obviously not the people using Zeronet for sure, but everyone talks whatever the shit that comes from the TV. Unfortunately, the Mass still stick to the TV and the TV is worse than ever in the human history.",
				"added": 1607820208
			}
		],
		"1608023788_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 51,
				"body": "Read this, it takes time to digest. You are welcome.\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f1_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA_item_1+type:book",
				"added": 1608032432
			}
		],
		"1608149924_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 52,
				"body": "It is called supply and demand, this is the jungle. I leave you with a very old video but very accurate.\nhttps://www.youtube.com/watch?v=hcwWOwPQvwA",
				"added": 1608173782
			}
		],
		"1609976542_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 56,
				"body": "Typical false flag attack against trump and his crusade to show the rigged voting system driving the future of the world for years. I do not like Trump but this is a force he can not fight against to.",
				"added": 1610058143
			}
		],
		"1610391633_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": [
			{
				"comment_id": 61,
				"body": "time to move to I2P + Orchid ?",
				"added": 1610397774
			}
		],
		"1610924622_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 62,
				"body": "COVID vaccine is not a vaccine, never tested before in history. Tested right now in humans. Doctors are pharma soldiers. etc... I'm not antivaxx, I'm anti-stupidity.",
				"added": 1610926786
			},
			{
				"comment_id": 63,
				"body": "here you go, https://www.rt.com/usa/512830-griner-mother-pfizer-vaccine-video/",
				"added": 1611027176
			}
		],
		"1611845039_1MW2ZSiMdJJTdhHUbV3ddi7NMdsiqKghX3": [
			{
				"comment_id": 64,
				"body": "we call those types Hoodrobins :-)",
				"added": 1611855522
			},
			{
				"comment_id": 66,
				"body": "WB wants someone to pay, they never loose. https://www.rt.com/usa/513935-robinhood-market-manipulation-gamestop/",
				"added": 1611855972
			}
		],
		"1611793272_19izFP2dRYRZNMHhACisV1HC1mNAPi8Koz": [
			{
				"comment_id": 65,
				"body": "Loud and clear ! Welcome, Teach us. Congrats.",
				"added": 1611855752
			}
		],
		"1612762070_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 68,
				"body": "This is a great initiative but I could not find the incentive to enter to make critical mass, make I2P the new \"internet\", get rid of the exchangers. we need some kind of token here, the idea is great but will die soon if it does not make critical mass. look, TOR is much more known then I2P, why ? because it could make quicker the transition from early adopter to follower, the need was privacy in that case. the need in this case is the \"kill the middle man\" which for the moment is not a need till all exchangers forbidden coins, give KYC info to 3rd parties and also disapear with all the money and coins, we still not there , (yet).",
				"added": 1612898695
			}
		],
		"1630314029_1Avop7FK7FLVvKV3jyxwyR57ib9d4NSZbF": [
			{
				"comment_id": 69,
				"body": "will never die, this is era is \"war on covid\" and \"space travel\" and will take years or decades.\nhttps://archive.org/stream/BeholdAPaleHorse_267/BillCooper-BeholdAPaleHorse.txt",
				"added": 1630568093
			}
		],
		"1620620160_1FmrBebnM1t99pE6rz9amgdgFSfKagU9Nr": [
			{
				"comment_id": 70,
				"body": "> [deuxzaron](#comment_154_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): It doesn't matter if either exist. When you die it returns to the Earth. whether you like that or not.\n\nvery true , read this, you will understand the shot will make you return for sure. Those ones with high D N A or helped cause they deserve will transition , the rest back to earth in another form. Read it.\nhttp://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA/Voyagers%20I%20%20II%20Secrets%20of%20Amenti%20-%20the%20true%20history%20of%20the%20human%20race.zip",
				"added": 1633289547
			}
		],
		"1633740636_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 71,
				"body": "How difficult is to join I2P and Zeronet ?",
				"added": 1633768789
			},
			{
				"comment_id": 72,
				"body": "if more users install i2p , is it going to be faster ? Does Tor and I2P the same ? I dont think so as Tor seams to browse anonymouly the internet while i2p is for p2p communication. right ?",
				"added": 1633807721
			}
		],
		"1634264493_19RBy1R77se3kYGB4ZLXCVowdKrcqL1h4A": [
			{
				"comment_id": 73,
				"body": "the Fact  checker checker checker checker checker checker checker",
				"added": 1634297686
			}
		],
		"1637322366_172aTiZARYuYxYznMn42L36cZGuUjv11dr": [
			{
				"comment_id": 74,
				"body": "I think they will never let the dollar fall, everything is on the table, EVERYTHING.",
				"added": 1637353561
			}
		],
		"1637424236_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 75,
				"body": "https://www.reddit.com/r/Bitcoin/comments/24zwsr/how_many_qubits_would_it_take_to_break_bitcoins/",
				"added": 1637425041
			}
		]
	},
	"comment_vote": {
		"1195_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"3_1N51mAhuByPNmLdzzyaYXN1G4XUkQyCc4F": 1
	}
}