{
	"next_topic_id": 20,
	"topic": [
		{
			"topic_id": 1633918143,
			"title": "为什么市面上基本没有用于windows台式机的触控板?",
			"body": "",
			"added": 1633918142,
			"parent_topic_uri": "1631184058_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1633919902,
			"title": "用户运营：如何让你的短信/Push更高效？",
			"body": "运营作为连接用户和产品的桥梁，在推广拉新、活动促销、提升活跃/留存、流失用户召回各个环节都需要进行用户触达。更高效、精准的触达不仅能提高转化，降低成本，同时也是运营能力的体现。\n\n\n本文从营销角度，重点分析2种用户触达工具：SMS短信和App Push消息推送。\n\n一、前期策划\n\n1、选择触达方式\n\n首先，我们对比2种常用的用户触达工具：短信和消息推送（Push），结合场景进行选择。\n\n\nSMS短信\n\n短信凭借着优秀的触达效果，成为最受欢迎的营销工具之一。\n\n优点：触达率高，若非闲置号码，收到手机短信的人基本都会看一眼。\n\n注意：单条3分-5分，注意成本控制。易招致投诉。\n\n使用场景：高频应用与推广拉新、促销活动和流失用户召回。\n\nApp Push消息推送\n\n\n消息推送，即指在手机的通知栏上会显示的一条通知信息。可以有效激活用户，提升用户活跃。\n\n优点：量大，精准，免费。\n\n注意：未安装App用户无法触达。高频发送会对用户造成打扰，招致卸载。\n\n使用场景：促销活动、提升活跃/留存等多种场景。\n\n2、触达时间\n\n\n网易两款新游的短信推广，均选择在游戏高峰期周六晚，用户最为活跃度的时间进行触达。\n\n不同产品类型，解决不同用户需求。外卖，约车，新闻，和游戏等等都有很清晰的使用场景。\n\n在用户即将使用此类型产品前进行营销触达，可以覆盖更多的目标用户。\n\n\n如图中的用户活跃情况，可在9点开始，通过几轮不同时间段对比，即可选出点击率最高的间段作为最优触达时间。\n\n3、进行用户分组\n\n根据不同目的，通过控制变量，分设不同用户组别进行精准营销，提高转化率。\n\n空白对比：设定营销组与空白组，通过营销与自然转化的数据对比，来判断营销事件对用户行为是否有影响，有多少相对影响。\n\n用户属性：地理位置，活跃用户，系统版本，性别、年龄段、星座，生命周期和业务属性对用户进行精准营销。\n\n优惠力度对比：通过不同的优惠力度对比，判断用户对价格的敏感度，控制最佳投入产出比。\n\n文案对比：通过不同文案的对比，来选出用户最容易接受，转化效果最优的文案。\n\n4、优化营销内容\n\n方式、时间、分组都是触达的辅助工作，转化率的高低是直接和文案能力挂钩的，优秀的文案会大幅度提高打开率。\n\n无论是短信还是push，高转化的营销文案都有这么几个特征：相关、数字、简洁。\n\n相关：让用户觉得这条短信与自己有关，例如结合利益点奖励或重要事项提醒。数字：用数字能把事情说得更精准，更直观。简洁：善用标点符号分割句子，信息点别超过2个。\n\nSMS短信结构：【签名】+（文案）+（短链）+退订。\n\n切记不要把你所有的想法都怼给用户\n\n\n我们分析一下上面这条短信的触达目的：\n\n促新用户观影；促用户充值（话费，加油卡，游戏）；促购买（旅行箱）；下载APP；关注微信服务号；\n\n一口气给了用户5个动作，结果就是用户什么都不想做。我们的短信，只是发给用户一个邀请：来我们的活动页看看，打开App瞧瞧。\n\n少即是多，给文案定1个可行的小目标，让用户进行1-2个动作，例如促使用户打开APP，参加活动。\n\n短链接：把产品或活动制作成短连接，在文案中引导用户点击。注意埋点，监控短信发出后的点击量。\n\n短链对提升转化有着很重要的作用。例如这条的流失用户召回短信，虽然很走心，若能加上App下载短链，引导用户直接点击下载App，效果会更好。\n\n最后，总字数控制在70个字符以内为一条短信，简洁且降低营销成本。\n\nPush结构：通知标题+推送内容\n\n通知标题：默认为APP名称，支持自定义内容。\n\n由于安卓的通知中心能展示的字数较少，自定义通知标题的使用率较高，能让用户立即看到推送内容。例如电商直接用活动主题作推送标题。\n\n推送内容：首先，要做到精准，让推送的用户看到自己想要的东西。\n\n其次，在用户看到推送的1~2秒，也就是第一行字内吸引住用户，毕竟我们的目的就是让用户点击这条推送。\n\n最后，设置好转跳至APP落地页，从细节提升用户体验。\n\n二、成效分析\n\n若不能有效的衡量营销成效，就不能有效的去提升。\n\n营销后，通过成效记录表对比分析营销效果。\n\n\n进行用户触达后，我们要通过数据来检验营销的成效如何。先看下营销成效分析的几个关键指标：\n\n到达率=（用户接收 / 推送数量）*100%\n\n到达率是做成效评估的基础指标，影响到达率低有两个主要原因：技术通道，即从自身网关传输到服务商之间有流失；服务商通道：用户退订了短信。清楚这次营销的到达情况后，作为基数再去看其他的指标。\n\n点击率= （点击人数/ 用户接收数）＊100%\n\n在到达数据准确的基础上，点击率是重要过程指标，验证此次触达是否吸引人。\n\n点击率低可以具体看是哪一组的点击率低，对比用户类型，发送时间和内容分析原因。\n\n转化率=（目标行为人数 / 用户点击数）＊100%\n\n转化率是重要的结果指标，直接影响这次触达的产出情况。\n\n转化率低主要看吸引来的用户到底在哪个环节流失率最高，找到最高流失的环节进行优化。\n\nROI = （新增收入／投入费用）＊100%\n\n投资回报率即促销活动投入1元，能产生多少倍的收入增量。ROI衡量这次营销值不值得，并不决定着这次营销的好坏，只要过了盈亏平衡点，投入得越多，活动成效越好。\n\n三、总结\n\n工欲善其事，必先利其器。基于营销角度进行的用户触达，前期要做好准备工作，后期的成效分析重点关注数据。根据对比成效对各个环节不断优化，才能让触达效果最大化。\n\n对于用户运营笔者仍在学习阶段，以上是最近工作中的心得分享，希望能给大家带来一些思路！",
			"added": 1633919900,
			"parent_topic_uri": "1631184058_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1633919979,
			"title": "作为一个普通人，是什么动力让我们进行信息传播?",
			"body": "当我看到某一篇文章或者内容，符合我的价值观，并且想输出这种价值观给某些人看的时候，就会传播。",
			"added": 1633920136,
			"parent_topic_uri": "1631184058_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1633923430,
			"title": "如何下载电视节目？",
			"body": "",
			"added": 1633923426,
			"parent_topic_uri": "1631184058_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1633930116,
			"title": "rss （简易信息聚合）",
			"body": "简易信息聚合（也叫聚合内容）是一种基于XML的标准，在互联网上被广泛采用的内容包装和投递协议。RSS(Really Simple Syndication)是一种描述和同步网站内容的格式，是使用最广泛的XML应用。RSS搭建了信息迅速传播的一个技术平台，使得每个人都成为潜在的信息提供者。发布一个RSS文件后，这个RSS Feed中包含的信息就能直接被其他站点调用，而且由于这些数据都是标准的XML格式，所以也能在其他的终端和服务中使用，是一种描述和同步网站内容的格式。 [1]  RSS可以是以下三个解释的其中一个： Really Simple Syndication；RDF (Resource Description Framework) Site Summary； Rich Site Summary。但其实这三个解释都是指同一种Syndication的技术。\nRSS广泛用于网上新闻频道，blog和wiki，主要的版本有0.91, 1.0, 2.0。使用RSS订阅能更快地获取信息，网站提供RSS输出，有利于让用户获取网站内容的最新更新。网络用户可以在客户端借助于支持RSS的聚合工具软件，在不打开网站内容页面的情况下阅读支持RSS输出的网站内容。",
			"added": 1633930111,
			"parent_topic_uri": "1631184058_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1633953610,
			"title": "百度贴吧的人分流去哪了？",
			"body": "我记得12-15年间的百度贴吧人数都比较多，16年后百度想挣贴吧的钱，贴吧活跃度开始下降，我也是那个时代跟着开始减少贴吧，目前还在贴吧，但范围小了很多。肉眼可见，很多贴吧吗，特别是中小贴吧人数少了，那他们去哪了呢？我讲两个我遇到的贴吧。\n\n\n\n当年的数码类贴吧，各种教程搬运，贴吧精品贴各种资源。不过数码类资源还是好找的。\n\n当年的地级城市贴吧，我关注过我省内两个，气氛都可以，之后百度一顿骚操作吧主权力被砍，城市贴吧变成求职吧和求职被骗的吐水吧，城市的生活，文化帖子都极少看见。当年还有老前辈讲城市文化城市历史，现在他们去哪了？",
			"added": 1633953604,
			"parent_topic_uri": "1630722132_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1633956658,
			"title": "2021年互联网巨头第一仗：飞书开撕微信，阿里华为百度全都入局",
			"body": "比社区买菜圈地战更凶！\n\n1月7日下午，字节跳动副总裁谢欣在其头条号发文喊话腾讯，要求停止无理由封杀飞书，引起各界关注。谢欣称：“由于微信开放平台的不开放，‘飞书文档’微信小程序已经在审核流程上被卡将近两个月。”\n\n一时间，关于平台垄断的讨论声不断，而从更底层的商业逻辑来看，这场时间微妙的炮轰背后——一场互联网巨头的协同办公平台之战已经愈演愈烈！\n\n近日，企业微信秀出用户达4亿的好成绩，腾讯会议也超百倍完成一年前成立时的目标，微信飞书过节的背后无疑是两家协同办公产品的暗暗较劲。\n\n而除了字节和腾讯，在2020年疫情的催促下，包括华为、阿里、百度、美团、京东等中国头部互联网及通讯巨头都悉数奔赴这场热战。\n\n\n\n由2020底最火北京大爷李诚儒代言的华为”办公宝“广告轰炸铺天盖地；钉钉前脚宣布用户突破3亿、企业微信亮出用户4亿的成绩；稍晚入局的百度如流也在近日发布上慷慨激昂地喊出”变革人类工作方式“的壮志……\n\n号角已经吹响，协同办公领域的战争虽然不如巨头的社区买菜、外卖和共享单车之战看起来热火朝天，但这场与中国商业数字化升级交相辉映的抢滩大战的激烈程度、惊险程度、影响力却远非前者可比拟！\n\n谁会成为这一To B新蓝海中的最大嬴家？这场技术赋能企业数字化之战将会持续多久？我们对阿里、腾讯、华为、百度、字节跳动五大核心玩家的排兵布局进行了深入挖掘，试图探索这场作为2021年互联网巨头第一仗的产业互联网布局之争将如何影响巨头的走向。\n\n01.字节VP控诉微信背后：协同办公大战白热化\n就在2020年11月18日，已经对外开放21个月的飞书迎来第一场正式发布会。在扬言其它办公工具都“跟不上时代”后，字节跳动请上罗永浩及华润集团、泰康保险集团、南开大学等合作伙伴为飞书站台助威。\n\n而2021年元旦刚过，字节跳动副总裁谢欣就喊话腾讯，要求停止无理由封杀飞书。谢欣话中带刺：“微信开放平台的审核，一直是一个未解之谜。即使审核状态变成“已通过”，微信也可以无理由将产品封禁。我们的另外两款微信小程序‘飞书会议’和‘飞书’，就是遭受到了这样的待遇。”\n\n谢欣提到，从2020年初，飞书宣布为中小企业提供三年免费服务以来，腾讯微信就开始无理由地全面封杀飞书。截至目前，微信方未作回应。\n\n\n\n飞书控诉微信背后，并不是单纯的平台开放性问题，商场如战场，在背后我们更看到一场协同办公平台大战发展到白热化的缩影。\n\n我们来看看这次被字节跳动VP炮轰的腾讯这边的协同办公布局，一边，企业微信在12月23日年度发布会上亮出“用户四亿”、“企业和组织550万”的成绩；另一边，腾讯会议在成立仅仅八个月，摇身一变为用户过亿的商业圈家喻户晓的视频会议软件。无论是企业微信还是腾讯会议，都是腾讯云To B生意中的重中之重。\n\n而我们把视野放宽到整个狼烟四起的协同办公平台市场，发现包括华为、百度、阿里等在内的互联网及通讯巨头都已经摩拳擦掌。\n\n比如，华为这边，近期在网上网下砸重金推广其企业智慧屏“办公宝”。“如愿以偿，如虎添翼，如获至宝”，2020最火老艺人李诚儒老师一脸正气地拿出其“如学”为华为Welink协同办公生态的企业智慧屏打广告，电视上撒贝宁、刘德华在央视上教学操作，可见华为团队年底冲业绩的力道凶猛。\n\n\n\n入局稍晚一些地百度如流也不甘示弱。2020年12月23日，在百度“AI在手，工作如流——百度如流智会2020”的发布会上，百度集团副总裁、首席信息官李莹宣布百度如流升级为新一代智能工作平台，慷慨激昂地描绘”变革人类工作方式“的蓝图壮志。\n\n>而“老炮”钉钉这边，早在2020年5月就亮出了“用户超三亿”、“单日在线会议超过1亿人次”的数据。更进一步，阿里在9月在集团战略层面对钉钉大升级，阿里云总裁张建锋称，要基于“云钉一体”将钉钉打造成“Windows”一样的系统，可见雄心。\n\n在“赢者通吃”互联网世界，新兴的移动互联网新秀与老牌互联网巨头明争暗斗由来已久。而当下体现在协同办公这块互联网新战场上，谁也没有手软的迹象，2021年互联网巨头的第一场激烈热战的号角已经吹响。\n\n02.疫情激活协同办公市场BAT、华为、字节你追我赶\n随着2020年疫情促进云课堂、云会议、线上医疗等应用发展，更广泛的协同办公需求被激活。\n\n以2014年成立的钉钉为例，第一个 1 亿用户用了 3 年，第二个 1 亿用户用了 1 年半，而第三个 1 亿用户只用了半年多一些的时间。\n\n而对于2019年12月25日成立的腾讯会议，和12月26日前后脚成立的华为Welink智能工作平台来说，一场疫情危机带来的迅猛转机和红利是他们始料未及的。\n\n在2020年12月19日在腾讯2020 Techo Park开发者大会上，腾讯云副总裁、腾讯会议负责人吴祖榕表示，腾讯会议成立时的目标只是2020年底DAU（日活量）可以达到5万，而仅仅2个月后由于疫情腾讯会议就达到1000万的日活量，比原来的目标翻了几百倍！背后更是8天扩容10万台云主机的惊险故事。\n\n\n\n▲腾讯云副总裁、腾讯会议负责人 吴祖榕\n\n2020年下半年，随着国内疫情稳定，常态化的协同办公需求热度不减。\n\n根据移动互联网研究公司QuestMobile近期发布的数据显示，尽管疫情过后有所回落，但2020年9月的效率办公用户数同比增长依旧超过了100%。\n\n而从国际资本市场来看，协作及视频会议市场也是奇迹频出，也令国内科技巨头怎能不眼红。比如，美国云视频会议商Zoom的市值已从2019年4月上市后的160亿美元飙升到980亿美元，好像坐上了火箭，且毛利率也高达80%。\n\n\n\n市场调研公司IDC的数据显示，2019年中国协同软件市场大约为4.9亿美元，预计到2023年，市场规模将超过10亿美元，五年间的年均复合增长率超过16%。\n\n进入2021年，协同办公市场的玩家已经各就各位，玩家们一边大力布局产品生态，一边是用户、市场争夺，其中的蛋糕和附加价值的想象空间远非社区卖菜和当年巨头厮杀惨烈的外卖、共享单车可比拟。\n\n03.智能办公战场狼烟四起五大玩家谁主沉浮？\n在这场狼烟四起的企业数字化转型大战中，各家的的实力对比如何呢？\n\n我们打开钉钉、企业微信、华为Welink、飞书、如流几家的APP平台，几乎看不出太大区别，界面截图放在一起甚至分不出彼此。\n\n\n\n▲从左至右依次为企业微信、钉钉、飞书、华为Welink的应用界面\n\n当然，大同之下也会有一些特色，比如飞书的子弹笔记样式，支持缩进、无限层级、可一键切换成思维导图的形式更创新；如流的界面更简洁，智能转写记录的功能用起来更顺手等。使用惯钉钉、企业微信的人可能觉得这两款更稳定、成熟……\n\n\n\n▲飞书的子弹笔记样式\n\n但大体上，各家平台的功能应用都比较趋同，都主要以即时通信、文档协作、任务/人员管理、知识管理为主，其中穿插智能会议纪要、语音助手等各种智能应用。\n\n\n\n▲部分协同办公应用平台的功能布局（图源东吴证券分析报告）\n\n那么我们要如何更深层次地看到各家地打法特色呢？还要从他们的排兵布局来看。\n\n\n\n1、钉钉——换人、改组，云钉一体\n“老炮”钉钉的打法经历了钉钉时期和云钉一体两大阶段，划出一条相对完整的发展脉络。\n\n钉钉创始人陈航治下的钉钉无疑是一款优秀的产品。2020年5月钉钉春夏新品发布会上，陈航宣布钉钉用户超过3亿，并一口气发布视频会议一体机F1等产品，发力智能硬件领域。在陈航看来，钉钉定位企业SaaS服务商，他十分强调钉钉的独立发展。\n\n但是，令陈航没想到的是，此时大体完成原始积累的钉钉将面临更重大的使命，迎接他本人的是黯然转场。2020年9月，阿里宣布钉钉与阿里云合并成立钉钉大事业部，阿里云智能总裁张建锋接替陈航来管理钉钉，进入“云钉一体”新阶段。\n\n\n\n▲今年的云栖大会，陈航最后一次以钉钉CEO身份接受采访（左：张建锋；右：陈航）\n\n>张建锋的宏图是将阿里云+钉钉比作新时代的操作系统，两者的组合类似于当年的 Windows+英特尔。\n\n>早在2019年底阿里就开始强调云钉一体概念，张建锋表示，将云基础设施用起来，上面需要更容易应用的平台。而面对移动化需求，钉钉就是这样一个新型操作系统`\n\n基于这样的理念，张建锋表示阿里云在数字经济时代的出发点和落脚点是做深基础、做厚平台、做强生态。\n\n这一抉择对钉钉的命运可以说是意味深长。从阿里2020年11月公布的2021财年Q2财报来看，集团收入同比增长 30%至 1,550.59 亿元，其中，云计算业务收入强劲同比增长60%至148.99 亿元。\n\n阿里很清楚要想成为一家百年常青的老字号需要做深的基础是什么，做厚的平台为了什么，至于智能硬件等这些就留给生态伙伴去做吧。\n\n2、腾讯——聚焦组织传播，做企业的内外连接器\n不同于一站式的钉钉，腾讯的企业微信和腾讯视频还是两款相对独立的产品。\n\n一边，企业微信在2016年阿里钉钉成立一年后诞生，主打腾讯擅长的轻量级 OA，目前已从2019 年底日活 6000 万发展到2020年底企业微信连接用户达到4亿。\n\n另一边，腾讯会议则是一款生于云上、长于云上的产品。发布245天（8个月）用户数突破1亿。与此同时，国际版VooV Meeting在全球超过100个国家和地区上线。9月，腾讯会议企业版也正式上线，寻求付费。\n\n\n\n没有内部赛马，腾讯云与智慧产业事业群总裁汤道生表示，事实上企业微信的视频会议的底层功能，正来自腾讯会议的助力。\n\n企业微信的独特性在于其社交媒体基因。腾讯微信事业群副总裁黄铁鸣认为，腾讯企业微信定位不同于钉钉、飞书等平台。\n\n他认为，企业微信最明显的竞争优势所在，是同类企业内部IM产品难以替代的商业工具。微信如今并不能单被看做企业服务工具，企业微信对自身“企业内外连接器”的定位是更为准确的说法。\n\n腾讯的媒体打法一定程度上与钉钉展开了错位竞争。\n\n一位来自国内知名运动品牌的零售负责人告诉智东西，公司用企业微信多年了，钉钉只用了一阵子。她解释，对于零售行业来说，全国各个门店的所有员工、外部的客户都能通过企业微信快速找到，疫情后还增加了与外部客户组群沟通、直播交流、发红包互动的功能，都用的非常多。可见，基于QQ、微信原始积累的腾讯在做组织传播上自有其难以被超越的基因特色。\n\n在腾讯2020年中财报中，金融科技及企业服务继续增长，同比增长30%，收入298.6亿占比26%。其中，云服务与支付、消费金融、理财共同增长。\n\n3、华为——硬件打市场，一块屏背后是全栈技术\n华为云WeLink源自于华为公司自身的数字化办公转型实践，最早于2017年1月1日在华为内部推出WeLink 1.0，而2019年12月华为正式开放WeLink时，华为表示WeLink全球联接团队52万个，联接知识21亿次/年，使全球华为员工整体协作效率提升30%。\n\nIdeaHub智能协同是华为基于WeLink生态推出的一款主打产品，其能力输出的主要载体是一款企业智慧屏。2020年6月，华为中国区总裁鲁勇，与马东、金靖同台带货华为企业智慧屏，金靖给产品起了个接地气名字——办公宝。\n\n\n\n华为本就是硬件视屏会议市场里的头部玩家，Welink智能工作平台中的视屏会议功能，也正是团队将能力输出给了“后浪”。华为数据存储与机器视觉中国区总裁康晓宇说：“将华为自研的音视频编解码技术从上百万元的视频通话设备，浓缩到几万块一个的屏幕，正是要实现AI的普惠。”\n\n参考消费电子领域的智能手机、智能安防领域的软件定义摄像机，不怕苦不怕累的华为习惯用智能硬件叩开一个新市场。面对智能办公领域也不例外。\n\n但硬件并不是华为发力智能办公的最终目的，在华为的战略布局中，办公宝是华为发力数字新基建的重要一子。\n\n用华为自己的话来说，OceanStor数据存储、HoloSens机器视觉、IdeaHub智能协同三者联合起来，完成数据的采、存、用，就是华为为政企数字化转型提供的“使能数据的底座”。\n\n4、百度——立足百度大脑，发挥AI能力和知识管理能力\n在APP Store百度如流有这样一条评论：百度一直都是等别人把市场瓜分差不多了才进来……钉钉、腾讯会议这一波都火了，还有如流的位置吗？\n\n百度在2020年初疫情发生后迅速把百度Hi开放给疫情使用，4月推出升级为新品牌“百度如流”，前身百度Hi是为百度几万名员工提供即时通讯等服务的办公工具。作为做知识搜索起家的互联网企业，百度的市值只有腾讯、阿里的十分之一，其在智能办公领域的布局力道也相对没有那么迅猛。\n\n\n\n但百度很清楚自身的体量及根基所在，也明白自身可以打出差异化的地方。\n\n在百度认为，自身最大的竞争力在于基于百度大脑的AI能力和知识管理能力。\n\n一方面，百度借力百度大脑，实现多场景智能工作；另一方面，基于多年做搜索引擎的经验，围绕知识图谱，赋能提效与创新。\n\n2020年12月23日，在“AI在手，工作如流——百度如流智会2020”的发布会上，百度宣布旗下智能办公品牌“如流”升级为新一代智能工作平台。\n\n\n\n百度强调AI时代实现流式工作所必须的通讯流、工作流和知识流，也体现了百度“如流”的底层理念。而来为百度站台的浦发银行，也表示最终敲定百度合作的原因也是看重了“如流”底层的AI中台和知识管理中台实力。\n\n5、飞书——不从工作流出发，从信息流出发\n不同于百度关注工作流，飞书恰恰是“反工作流”派。\n\n2020年11月18日，对外部客户开放后 21 个月之后，飞书最新版本 π 发布，它被正式定义为 “一站式企业协作平台”。这表明，飞书要解决的是企业作为组织的 “协作” 问题。\n\n\n\n在设计的底层逻辑上，飞书没有过多从工作流出发，而是从信息流出发。谢欣认为，知识型的工作成果很难通过计件衡量，本质上是因为企业的运作，不再基于工作流，而是基于信息流。那么信息流动的效率，就成为业务发展的核心。\n\n“工具其实跟不上这个时代”，这是谢欣对当下办公工具的感受，“与手机中每天使用的C端产品相比，B端产品的用户体验远远达不到它应该达到的水平。我们希望，从飞书开始，有更多的产品能够改变这一点。”目前，小米、物美等企业已经用上飞书。\n\n作为移动互联网时代的举行独角兽，字节跳动也是AI技术和年轻人才的汇聚地，因此成为协同办公领域的搅局者和创新者的潜力也不容小觑。\n\n04.结语：产业时代变革下，互联网科技巨头开辟新战场\n2021年元旦刚过，字节跳动选择在当下科技领域反垄断潮汹涌的节点上控诉微信平台对飞书的“不公待遇”，侧面也显示着互联网巨头之间的明争暗斗，在协同办公这一新战场的白热化体现。\n\n走进2021年“十四五”开局之年，新基建及产业数字化转型的步伐又进，处于百年之未有大变局中的中国企业将进一步意识到”上云用数赋智“的可行性和必要性。更多企业自身办公模式的数字化、智能化转型也将被提上日程。\n\n按照互联网产业赢者通吃的历史，我们能想象一年之后在产业互联网变革浪潮中，获得企业办公平台市场用户和市场生态话语权的玩家将又积累一大波新的资源资本。",
			"added": 1633956891,
			"parent_topic_uri": "1577692112_13KwoYsPQsMpKL27znfVicYa9FSPnEX73F"
		},
		{
			"topic_id": 1633963004,
			"title": "你有常逛的网络论坛或垂直社区吗？",
			"body": "",
			"added": 1633962996,
			"parent_topic_uri": "1630722132_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1633963400,
			"title": "坚持做一件事不易",
			"body": "坚持不做一件事同样很难\n列出你的stopc list doing\n一起加油吧",
			"added": 1633963391,
			"parent_topic_uri": "1577692112_13KwoYsPQsMpKL27znfVicYa9FSPnEX73F"
		},
		{
			"topic_id": 1634004792,
			"title": "利用飞书进行网课学习（完全免费）",
			"body": "一、准备工作\n1.下载安装飞书软件（之前以为飞书只能企业用，原来个人也可以，而且是免费的，格局小了，请飞书给我打钱）\n\n飞书-字节跳动旗下企业协作平台，集视频会议、在线文档、移动办公、协同软件的一站式企业沟通协作平台\n​www.feishu.cn/\n2.准备好本地视频文件\n\n二、操作步骤\n1.打开飞书，找到「飞书妙记」\n\n\n\n\n2.点击「上传」，按提示把视频文件拖到上传区域\n\n\n\n\n3.可点击「添加」，上传多个视频\n\n\n\n\n4.上传完毕后，选择视频语言，然后点击「转写」\n重点来了！转写功能居然是完全免费的！\n\n\n\n\n5.转写完成后，会有弹窗提示（90分钟的视频，转写只用了3分钟，感慨下AI时代的强大）\n\n\n\n\n6.打开转写后的链接，会跳转到网页\n网页界面结构如下，左侧是视频，右侧是文字稿，下面是播放进度条。\n\n\n\n\n\n\n7.亿些细节操作\n\n第一，可拖动网页中间的细线，调节视频和文字区域的比例，我喜欢视频的区域大点，毕竟核心是看视频。\n第二，视频可倍速播放，最高是3倍速，我一般是用1.5倍速，碰到比较难理解的内容，就降到正常速度。\n第三，视频讲到哪，右侧的文字稿色块也会跟到哪，在听不清或者不能开太大声的情况下很好用，当然最重要的是用于记笔记。\n第四，点击右下角的大拇指图标，可以在播放进度条上打标签，目前有两个使用场景：一是看到比较精彩的内容，先Mark下，回头可以精确定位回来记笔记。这对沉浸式学习非常有帮助，以前听到精彩的内容，都会纠结到底要不要停下来记笔记，但停下来又担心打破内容的连贯性；二是如果中途有事，打个标签后就可以关掉视频，下次打开时，知道上次看到哪。\n\n\n\n\n\n8.重点彩蛋\n当你上传的是英文视频，而你英文又不是很好的时候，点击右上角的「源语言」，切换到「简体中文」\n\n\n\n奇迹出现！妈妈问我为啥一直跪着看视频……",
			"added": 1634004782,
			"parent_topic_uri": "1577692112_13KwoYsPQsMpKL27znfVicYa9FSPnEX73F"
		},
		{
			"topic_id": 1634004928,
			"title": "你们在钉钉上网课都产生了什么神操作？",
			"body": "",
			"added": 1634004917,
			"parent_topic_uri": "1577692112_13KwoYsPQsMpKL27znfVicYa9FSPnEX73F"
		},
		{
			"topic_id": 1634005267,
			"title": "网课直播太麻烦？腾讯会议轻松解决设置难题",
			"body": "这几天离开学是越来越近了，帮爸妈天天捣鼓怎么进行网络授课，使用了钉钉、超星学习通、慕课、课堂派、雨课堂等各种。各有千秋，但都存在一个问题，麻烦。\n\n我妈每次刚学会，过了没多久又忘记了，拿个本子在旁边记操作步骤的认真度堪比我们平时听专业课。\n\n直到发掘到腾讯会议，突然觉得这太简单了，太方便了。\n\n废话不多说，使用说明已经安排好啦\n\n\n\n\n\n\n具体步骤跟图片的顺序是一致的，可以放心阅读本文\n\n\n\n\n\n\n第一步，安装软件\n\n- 电脑端安装——利用百度一下\n\n\n\n\n\n\n\n\n\n\n- 手机、平板端安装——App store 或者应用商店搜索，下载安装\n\n\n\n\n\n\n安装软件比较简单，就不过多说明啦，如果有不会的小伙伴，可以后台给我留言。\n\n第二步，注册登陆\n\n无论是电脑、平板还是手机打开软件，显示的界面都是一样的，如图：\n\n\n\n\n此时便是注册和登录，推荐使用微信登录，点击微信小图标，打开后扫描二维码，验证手机号（仅第一次使用时需要）就完成啦。\n\n第三步 软件使用\n\n3.1 软件主页\n\n\n\n\n还是那句话，无论是哪个平台打开，显示的界面都是一样的，仅仅只有三个选项，<加入会议>、<快速会议>、<预定会议>。\n\n\n\n3.2 发起会议\n\n先点击快速会议\n\n\n\n\n电脑端需要选择音频接入方式，简单的说，就是这个平台通过什么方法获取你的声音，其他的功能仍旧保留。\n\n有两个选项：\n\n一个是电话输入，意思就是你用手机拨打提供的号码，系统会让你输入会议号并输入#号结束，再会让你输入一次参会者ID,同样按#号结束。\n\n本人亲测，电话输入相对稳定，同时仍可以进行后续介绍的各个步骤。\n\n\n\n\n注意，每次会议和每个人的会议号和ID都是变化的，请勿使用上图会议号和参会者ID尝试。\n\n第二种音频接收的方法是使用电脑音频，也就是用你电脑的话筒（听筒、麦克风）进行会议的传声。\n\n\n\n\n\n\n音频选择完毕，会议就正式搭建好了。此时界面如下图\n\n\n\n\n\n\n3.3 邀请他人加入会议\n\n方法如下：\n\n一\n\n在界面上方有会议号，将会议号告诉需要加入会议的同学，同学自行输入会议号加入会议。\n\n\n\n\n\n\n二\n\n下方邀请按钮，点击邀请\n\n\n\n\n出现弹窗后复制，发送给同学，同学输入会议号加入即可。\n\n\n\n第四步，使用会议功能\n\n进入后即可开启语音会议，在下方的语音、视频、共享屏幕，可以解锁更多会议形式\n\n再此，介绍共享屏幕功能\n\n\n\n\n\n\n\n\n点击共享屏幕，电脑端需要再选择一次共享的屏幕，点击确认共享，即可展示自己的屏幕给其他共享者\n\n\n\n\n\n\n效果展示\n\n电脑（共享者）\n\n\n\n\n\n\n参会其他成员\n\n\n此时老师可以一边在电脑上进行播放幻灯片等各项操作，此时屏幕会被学生看见，语音依旧有效，可以边操作电脑边进行讲课。\n\n\n\n第五步，更多功能\n\n可以使用聊天界面实时接收学生发送的信息\n\n\n\n\n\n\n点击屏幕下方的聊天即可\n\n为什么使用聊天功能来接收学生发送的文字而不是直接语音呢？\n\n理由在于，人数多的会议，大家进入会议后都在讲话，则会使整个会议通道嘈杂，不便于交流。对于不需要使用语音的内容，可以让学生们直接使用打字功能，将文字发送至聊天窗口即可。\n\n\n\n结束屏幕共享的方法\n\n\n\n\n\n\n把鼠标移动到屏幕顶端，点击结束共享，此后屏幕内容不再被学生看见\n\n最后一步，结束会议\n\n直接点击腾讯会议界面右下角的结束会议，确认结束即可\n\n\n\n\n\n\n最后，更多功能还需要大家自己挖掘，就不一一说明，不然一个简单的教程就变复杂了，有任何问题，欢迎与我留言呀～",
			"added": 1634005255,
			"parent_topic_uri": "1577692112_13KwoYsPQsMpKL27znfVicYa9FSPnEX73F"
		},
		{
			"topic_id": 1634005504,
			"title": "QQ远程协助",
			"body": "腾讯QQ推出的一项方便用户进行远程协助帮助好友处理电脑问题。功能与远程桌面连接、网络人远程控制软件、TEAMVIEWER、PCANYWHERE等相似。但由于网速管理，信息传输，系统整合性等并不十分完善，导致这一功能成为“鸡肋”",
			"added": 1634005491,
			"parent_topic_uri": "1577692112_13KwoYsPQsMpKL27znfVicYa9FSPnEX73F"
		},
		{
			"topic_id": 1634005710,
			"title": "除了用qq，还有什么办法用远程协助？",
			"body": "本人mac，对方win\n装了虚拟机的win再上qq麻烦，而且win8.1 的qq奇卡无比，换了几个版本都完全无法用。\n难道适合大众的远程控制真的只有qq一家了吗？",
			"added": 1634005696,
			"parent_topic_uri": "1577692112_13KwoYsPQsMpKL27znfVicYa9FSPnEX73F"
		},
		{
			"topic_id": 1634006611,
			"title": "腾讯TIM怎么把聊天框独立出来",
			"body": "最近腾讯TIM非常热门，它作为腾讯QQ的轻聊版，是专为办公设计的，该软件不会出现各类弹窗广告，还支持在线文件共享以及传输，设计简单，受到许多用户的喜爱，但仍有许多用户不清楚不习惯它的功能，其中包括聊天框的独立，以下给大家带来TIM聊天框分开合并教程。\n \n\n \n\nTIM聊天是QQ聊天的简洁版，自然是具备独立聊天框的能力的，事实上很多时候为了避免搞错聊天对象，这个功能还是必不可少的，独立出来的聊天框保留了基本的一些功能，用户能使用远程桌面操控，文件发送，聊天记录查看以及基本的聊天编辑功能，同时还能使用发红包功能哦！\n \n\n>**1 TIM怎么把聊天框独立出来？**\n\n点击界面中的聊天功能，打开上次的聊天界面。\n\nTIM聊天界面\n\n \n\n选择需要独立出来的聊天框，点击不懂并向外拖移，拖移出的聊天框会呈黄色。\n\nTIM聊天框拖拽\n \n\n拖移出后聊天框就能独立出来了。\n\nTIM聊天框分开\n \n\n>**2 TIM独立聊天框能合并回去吗？**\n\nTIM独立出来的聊天框没有合并功能，需要再次合并的用户可以先叉掉当前独立的聊天框。\n\nTIM聊天框关闭\n \n\n自好友列表中找到该好友双击就能弹出合并的聊天框了。\n\nTIM聊天框\n \n\n要让该聊天框更显眼方便回消息，可以右击该聊天框选择置顶绘画，在聊天界面中该聊天框会自始至终在最上方。\n\nTIM聊天框置顶\n \n\n以上就是TIM聊天框独立的方法了，希望对各位用户有所帮助。",
			"added": 1634006765,
			"parent_topic_uri": "1577692112_13KwoYsPQsMpKL27znfVicYa9FSPnEX73F"
		},
		{
			"topic_id": 1634007235,
			"title": "「钉钉小技巧」如何打开聊天独立窗口（电脑端）",
			"body": "前言\n\n随着钉钉使用时间越来越长，钉钉好友及各种各样的聊天群也越来越多。有时，刚在这个群里聊天，那边就有钉钉好友发来消息，只好先退出这个群聊天窗口，点击好友聊天对话框，不断地切换聊天窗口，非常不方便。那么钉钉电脑端有没有办法可以同时打开多个聊天对话框呢？\n\n答案是肯定的，下面就和我一起来设置吧！\n\n步骤一：打开系统设置\n\n在任意聊天窗口上方点击自己的头像，就会跳出对话框，从中选择“系统设置。\n\n\n\n步骤二：打开”双击打开聊天独立窗口“的开关\n\n在通用里，找到”双击打开聊天独立窗口“，并将开关打开。\n\n\n设置好后，只要双击群或个人就能单独打开聊天窗口，是不是很简单？对于原本知道并已使用的人来说，确实是太简单了。但对我自己来说这是一个困扰自己那么久的问题，原来一个开关就解决了，这就是小技巧。",
			"added": 1634007219,
			"parent_topic_uri": "1577692112_13KwoYsPQsMpKL27znfVicYa9FSPnEX73F"
		},
		{
			"topic_id": 1634190049,
			"title": "白菜价 - 谐音笑话大全",
			"body": "如果菜价再这样继续飙涨下去，那房子真的就要跟白菜一个价了。",
			"added": 1634190032,
			"parent_topic_uri": "1577692112_13KwoYsPQsMpKL27znfVicYa9FSPnEX73F"
		},
		{
			"topic_id": 1634207821,
			"title": "千人千面技术",
			"body": "同一个地址，不同的内容",
			"added": 1634207803,
			"parent_topic_uri": "1577692112_13KwoYsPQsMpKL27znfVicYa9FSPnEX73F"
		},
		{
			"topic_id": 1636548343,
			"title": "有微博替代品吗？",
			"body": "支持全平台",
			"added": 1636548324,
			"parent_topic_uri": "1577692112_13KwoYsPQsMpKL27znfVicYa9FSPnEX73F"
		}
	],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"1633919979_1EH56kHtjRm7izKqd3JK71Xea1f63zBuUZ": [
			{
				"comment_id": 1,
				"body": "传播分为两种需求\n\n知识需求:通过传播一个不能肯定的知识，来获得他人知识的补充。\n心理需求:获得认同感。",
				"added": 1633920048
			},
			{
				"comment_id": 2,
				"body": "信息的传播，能够帮助每一个社会人，表达需求，并获得反馈和协助。信息的功能是帮助人们解决不确定性。婴儿从降生的那一刻起，就通过哭声对外传递信息。生存和社会交往的本能，让人们要进行信息传播。有时候是获知外界的变动，有时候是表达自我，有时候是获得支持，有时候是一种心理的需要摆脱孤单，有时候又是一种娱乐和文化生活等。信息的传播是人生存的最基础的表达方式。即便是聋哑人也需要依靠视觉和触觉等与外界交换信息，通过行为获反馈和表达。\n\n真实信息的获取和传播，需要经过严谨规范的表达和及时准确的多方反馈与验证。从日常使用媒体的角度来说，就要选择更多有公信力的媒体，此外，通过不同信息源的相互验证，通过实地考察，通过熟人经验验证等，通过科学常识和知识技能的判断，或权威机构的认证，也能鉴别更多信息的真伪。",
				"added": 1633920211
			}
		],
		"1633953610_1EH56kHtjRm7izKqd3JK71Xea1f63zBuUZ": [
			{
				"comment_id": 3,
				"body": "贴吧真是越来越不像样了，感觉服务器比跳跃的还水，就在刚才，我发的贴子还易主了。有没有类似贴吧的东西啊，比如腾讯的部落，不过那里人好少，除了部落，还有没有类似于贴吧的东西，我想去逛逛。这几年用贴吧的人也在变少，他们都去了哪里呢？\n\n（腾讯不够稳定，经常停服）",
				"added": 1633953817
			},
			{
				"comment_id": 6,
				"body": "你在哪个坑里？\n微博，今日头条，抖音",
				"added": 1633954143
			}
		],
		"1632742134_1NRuZ1tqBzQRPV845nGkkKTizswHB6CfxD": [
			{
				"comment_id": 4,
				"body": "是谁在给贴吧续命？\n百度捞够了，贴吧应该去死了",
				"added": 1633954061
			}
		],
		"1633654138_1NvJAxwds4o5FpbubqQY1BNWutGCeK7vdA": [
			{
				"comment_id": 7,
				"body": "QQ 139M\n微信 211M\n微博 109M\n钉钉 156M\n飞书 152M",
				"added": 1633956394
			}
		],
		"1634004928_1EH56kHtjRm7izKqd3JK71Xea1f63zBuUZ": [
			{
				"comment_id": 8,
				"body": "钉钉又在强推看看功能了，每天都会弹出通知，让强迫症不得不点击下，一看就是模仿朋友圈的圈子功能，有意思没？好好把握企业办公市场不行么，非搞天怒人怨的社交！捏着鼻子用钉钉罢了，你觉得大家还会把你当成社交工具使用吗？ ​",
				"added": 1634005002
			},
			{
				"comment_id": 9,
				"body": "钉钉版本升级后越发活跃而聒噪，每次听见它“叮咚”的声音，心惊胆战地打开手机发现是“钉钉小秘书”或者“圈子小助手”，这种大起大落的体验感并不十分美好。 ​",
				"added": 1634005126
			}
		],
		"1634005710_1EH56kHtjRm7izKqd3JK71Xea1f63zBuUZ": [
			{
				"comment_id": 10,
				"body": "钉钉也可以啊，今天用QQ的远程协助一直没反应，最后朋友推荐用钉钉解决了e问题",
				"added": 1634005717
			}
		]
	},
	"comment_vote": {}
}