{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 15,
	"comment": {
		"1_13esZg8pXRhUWy9TdPz93TKVf7U2U36em3": [
			{
				"comment_id": 1,
				"body": "Buenas shurs, otro que se ha pasado a zeronet. Hay que darle visibilidad a esto, aquí hay muchísimo potencial. Por fin un lugar incensurable.",
				"added": 1525617291
			},
			{
				"comment_id": 2,
				"body": "También sería bueno que se explicara con claridad como combinar zeronet con tor. Yo lo he hecho fácilmente pero en el otro post parece que hay gente con problemas. También es cierto que yo uso linux, que siempre es una ventaja.",
				"added": 1525619306
			},
			{
				"comment_id": 3,
				"body": "Lo importante es que ya estamos lejos de la dictadura del pensamiento único y las feminazis, aquí no nos alcanzan.",
				"added": 1525619356
			},
			{
				"comment_id": 6,
				"body": "Señores, que corra la voz!!",
				"added": 1525621874
			}
		],
		"1_12TyaKw4g16ddPsGsSzoHXHSRLXCEEQ6UH": [
			{
				"comment_id": 4,
				"body": "Es otra denuncia falsa en toda regla, y el único juez que ha tenido cojones a decirlo claramente lo han sacado en las manifestaciones de hordas feminazis con su foto y una diana. La dictadura del pensamiento único avanza imparable.",
				"added": 1525619447
			},
			{
				"comment_id": 5,
				"body": "Y ser retrasado no es delito, lo digo por los de la manada.",
				"added": 1525619540
			}
		],
		"2_13esZg8pXRhUWy9TdPz93TKVf7U2U36em3": [
			{
				"comment_id": 7,
				"body": "Una zorra feminazi con falta de rabo escupiendo en un blog porque no le hacen caso. Nada nuevo.",
				"added": 1525671435
			}
		],
		"1_1Q2MDUJ54Qon73LRsrTovcweNsnRhpBcb8": [
			{
				"comment_id": 8,
				"body": "Tenía cuenta en forocoches pero la verdad que nunca la usaba. Siempre que quería buscar algo usaba el buscador y muchas veces me aparecía un hilo de forocoches. A raíz de lo de la gorda asquerosa de san fermines y la reacción de las feminazis y el pensamiento único me he lanzado a zeronet como todos vosotros para poder opinar libremente.  Un lugar libre de censura y de la manipulación de los medios de comunicación tradicionales. Esto promete, nos veremos por aquí para hablar sin pelos en la lengua.",
				"added": 1525716988
			}
		],
		"3_1Jw2LsFMZ2tTJWc3ecjrHGdXpMscmxM1MP": [
			{
				"comment_id": 9,
				"body": "Ilitri vive de los anunciantes, y además bastante bien por lo que parece. Si los anunciantes se retiran a él se le encogen los huevos. Normal. Como también es normal que nosotros nos busquemos otro lugar donde escupir verdades sin dar cuentas a nadie. Cada uno barre pa' su casa.",
				"added": 1525717185
			}
		],
		"1_1LN2SJuN2XMLjCZttsXLdsyq3kwiFnS7yj": [
			{
				"comment_id": 10,
				"body": "Id aportando ideas. Siempre hay que tener un plan B. Quedan 2 siestas para campos de concentración masculinos. Al tiempo.",
				"added": 1525717254
			}
		],
		"1_18neEHgfy4dyCSY4tJzUi3AwjHds4U6bw9": [
			{
				"comment_id": 11,
				"body": "Que asco",
				"added": 1525717698
			}
		],
		"4_13esZg8pXRhUWy9TdPz93TKVf7U2U36em3": [
			{
				"comment_id": 12,
				"body": "Con lo único en que estoy de acuerdo con VOX es que están en contra del feminazismo. Por lo demás me parece falange española renovada.",
				"added": 1525898927
			}
		],
		"1_1DiV63jkL4C9uqTAJ7kfuk465ifcrvBbeR": [
			{
				"comment_id": 13,
				"body": "mientras no seas tan retrasado como el que ha puesto el email en otro hilo puedes estar tranquilo. Lo de Tor también es conveniente, por si quieres organizar un atentado terrorista y no quieres que te cojan la ip, si no está bien así.",
				"added": 1525899145
			}
		],
		"1_1PrGqYS76NH78qs54gS2c4ddjpk5VRK2bA": [
			{
				"comment_id": 14,
				"body": "Acaba de salir una carta de uno de los de la manada poniendo a caldo a la ¿víctima? y la sociedad borreguil. El tio ha hablado de puta madre y soltando toda la artillería. Cada vez se ve más el plumero a la gorda comepollas. Cuestión de tiempo que se destape la denuncia falsa.",
				"added": 1526242873
			}
		]
	},
	"comment_vote": {}
}