{
	"posts": [
		{
			"id": "9e72408d-603b-430d-aa9e-1b6f08ff0c6c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Possible solution for ZeroID's privacy leak: shared ids?",
			"body": "What if we just shared our ID's or just made \"burners\" that everyone can use?\n\nHere is this id's relevant entries in users.json:\n\n \"certs\": {\n   \"zeroid.bit\": {\n    \"auth_address\": \"1ErmMGiAYrYZ6Un2ydqR63uwesooBRGgU1\",\n    \"auth_privatekey\": \"5KApzrHcZC1RqEDFQapFgWtdTCPSYQqwxDwfm44M9x6zvDsJW2n\",\n    \"auth_type\": \"web\",\n    \"auth_user_name\": \"sharedanon\",\n    \"cert_sign\": \"HJJs0OeJW0/1x30LcHInIbL2fI3lT/YR8x8Aw2vNT0JTX4uzcKgT6RSx7+2VqBuA6b46yMla6RY9KUOCt0Etdo0=\"\n}",
			"time": 1568722126647,
			"files": "[]"
		},
		{
			"id": "8ab2d58a-8cbc-47d1-aa15-5f98b3333c50",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5311feb9-80b8-482c-b2b1-37d87e1bc224",
			"body": ">>b6ccfa2a-5a03-45c5-9498-b71180ce0f9c\n>How do you moderate or shut down a ZeroNet zite?\n\nDon't think you can. Glowniggers will probably just bust a few innocent 08channers who weren't running ZN Tor-only, or not running TOR browser and leaking IP information.\n\nIf one person posts something illegal, whether MT is active or now, it's easy to say \"08chan has illegal content!\" and harass normal users. Or at least try and keep normal users afraid of it.\n\nMaybe a moderation company could come up with a \"forced moderation\" version of the millchan engine that downloads block lists automatically from a central moderation team.\n\nIf MT are capitalists or glowniggers they could do something like that. Make a \"safe\" ZN chan site and fear people into using it to stay legal.",
			"time": 1568724110863,
			"files": "[]"
		},
		{
			"id": "c4476d57-ac16-4362-8396-731e18c51b17",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "9e72408d-603b-430d-aa9e-1b6f08ff0c6c",
			"body": ">>9e72408d-603b-430d-aa9e-1b6f08ff0c6c\nWell crap, thanks for the input anons. Thought I might have been on to something.\n\nWhat was the reasoning that they aren't using millchan's \"temp id\" thing?\n\nThe only way I've found to make ZeroIDs maybe securely (without a VPN) is cycling through some of the open proxies on https://www.proxynova.com/proxy-server-list/ until one works for ZeroID. Then returning to regular Tor browser for normal use.",
			"time": 1568724615063,
			"files": "[]"
		},
		{
			"id": "e21b5d28-511c-4860-ac1b-0caa167c2775",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "9e72408d-603b-430d-aa9e-1b6f08ff0c6c",
			"body": ">>8558919f-26ea-40b8-883c-2c5eb3b6ff95\nI was able to make it work (or looks like it). Deleted everything that wasn't a directory in ZN and let it create those files as default. Pasted in the above key info into users.json. 08chan let me choose that key and post under it. Deletion is a problem which sucks.",
			"time": 1568726432273,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}