{
	"posts": [
		{
			"id": "83f1c882-78c7-4ad2-8cbf-390b64a8b2f9",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "7fae6bba-7d04-4440-8090-75b369c7ed1a",
			"body": "I am perfectly fine with a community of a hundred people who know their shit and are active. 08chan felt really nice before those ID issues started.\n\nIf getting popular means to be full of shills and bots and everybody accusing each other of being one, then no, thank you.\nThose few days really reminded me why i initially started using imageboards and now i don't even want 8pol back. The only good thing were the niche boards of 8chan.\n>>ffe8ab2a-aecd-44fc-8670-9d3e83fb2746\n>Many don't even know what happened and they just could not post or see any new activity any more\nThat was a really shitty situations, feeling like you are shadow banned, not getting new posts, not knowing if others can see your post.\nBut tbh, the people who couldn't wait it out and left because of that wouldn't have stayed in the long-term anyway.",
			"time": 1565833103056,
			"files": "[]"
		},
		{
			"id": "94f9dacc-6a3f-427d-ab97-59cc6d93224f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "2a10387e-f7ba-4ffa-b938-07a42698737d",
			"body": ">>2a10387e-f7ba-4ffa-b938-07a42698737d\nsounds like him, hes an accereationist fag, he wouldn't give a fuck about the media going full \"Muh, Russia\" again.",
			"time": 1565833609056,
			"files": "[]"
		},
		{
			"id": "3b81abcf-bf46-4ca1-98a9-db88bb124359",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "0286960d-c13f-4088-9c8a-6e2adce0eb27",
			"body": ">>0286960d-c13f-4088-9c8a-6e2adce0eb27\nI doubt that other peers could realistically get relevant data by checking which files you don't have, because everybody has just a random subset.. you could have just not clicked at the thread.\nSo for being sure that you muted that user it would have to test if you have other stuff of a threat where you don't have stuff from that one ID... and so on... doing that for all peers... for the little benefit of harvesting different IDs that have the same user muted. So it has to check for other mutes, and with lots of luck its able to connect two IDs that you used with each other.... and what information could they possibly gain from that? As long as you don't dox yourself with one...",
			"time": 1565834431356,
			"files": "[]"
		},
		{
			"id": "a709e205-5e3b-46af-93b5-5ae0223a47d5",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f372c3ca-5dd0-462b-a5ba-adf29ef11ce7",
			"body": ">>93e9bd2b-1652-4e7d-82a7-8072e33ba01c\nSo you tell us zeronet is shit and your solution is something that has the very same \"problem\" of connecting post histories to users and hosting content (anonet) AND bridges to the clearnet, meaning that you have the full combination of all issues of p2p and centralized hosting at once?\nWhat happens if the server behind 2hu-ch is compromissed? You whole chan is fucked, right, and the one with access to that server can fuck over all other plattforms, even the once on i2p and anonet?\nIf you go decentralized, you go full decentralized or not at all. Bridging just gives you all issues at once, you get a combination of the worst out of both worlds.\n\nI like the concept of I2P, but there is sadly nothing good there.",
			"time": 1565838097854,
			"files": "[]"
		},
		{
			"id": "ef8342d9-060f-41d2-b836-dc4c1e361273",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "cde265dd-2400-4f12-97e1-073005b8e799",
			"body": "well, if they would have just fucked each other in the ass instead of fucking children, it would have been better.",
			"time": 1565838630874,
			"files": "[]"
		},
		{
			"id": "b5c96032-e569-44b0-8c90-74e335afa990",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "cfd398be-770c-4eb7-8d19-8984c4053d0b",
			"body": "Trump recently prepared an executive order to make those companies responsible for their political propaganda they spread... and of course CNN got a leaked summary of it.\nHe could do something for a change, but the chances are very low.\n\nMost likely it will end up dead in the water with great exceptions, like:\n>Tech platforms also qualify for broad legal immunity when they take down objectionable content, at least when they are acting “in good faith.”",
			"time": 1565839494274,
			"files": "[]"
		},
		{
			"id": "e8f6e759-343e-497a-a552-3db9ff61841e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "9a7bb255-9eaf-4814-a8ed-159296cc53b3",
			"body": ">>9a7bb255-9eaf-4814-a8ed-159296cc53b3\nI don't have any hashes of people posting cp, because i never saw anybody posting cp.\nEven in the cp board there is just one fag who posted 10 pics of child models and then left.",
			"time": 1565851561723,
			"files": "[]"
		},
		{
			"id": "68cb4cbe-7bdf-4bf0-94a2-ae3aaf48c0a9",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "7fae6bba-7d04-4440-8090-75b369c7ed1a",
			"body": ">>43dd201d-6292-4cc8-86c3-4c90913b443e\nmake a small note that you have to start Tor Browser before starting zeronet somewhere.\n\nAnd idk if its neccessary to mention the site update thing... the admin is responsible for it really",
			"time": 1565886482509,
			"files": "[]"
		},
		{
			"id": "cc0b9ff2-fe7d-473c-9e50-a97198e7b50d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "425586cf-3f0e-4c6d-beed-9a36783ea81e",
			"body": ">>aac1f093-7c63-4f17-94a8-c40033691e02\nchances are that the low-effort cuckchan spamers aren't dedicated enough to follow the instructions anway, or buy into the >muh honeypot meme.",
			"time": 1565930584408,
			"files": "[]"
		},
		{
			"id": "5d2dd504-a329-470d-b5a7-6b6016c3d87e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6c2b5c63-8899-4733-9dfa-f399882dbae8",
			"body": "Someone got the original german version of Mein Kampf?",
			"time": 1565955287965,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}