{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1619820771,
			"title": "Rudy Guiliani, executing his whole family...",
			"body": "it's one of the men I hate the most in america... I am almost sure that if it was handled professionnally (think mss, svr, mossad) this thing would lay his whole pedo/911 all the shit... like a child...\n\nthere is one thing you don't get... it's war... total.. domestic.\n\nand rudy, with trump, with epstein, with mike lindel, with dershowitz, with adelson... me, I don't care where it leads to...\n\nwhy?\n\nbecause now I know, that never, such filth, or at least for the forseeable future will be able by any way shape or form, to interfer with the march forward.\n\nso what happen with borats... let's start there...\n\nso then rudy will play hard ball... okay cool... a child, a wife, a parents, a sibling, cousin... to the meat grind,... my gooze gun feeder... injection... we have time... see you later rudy... \n\none corpse in...\n\nsame question again... why? the mind readers got it all reconstructed...\n\nthat's the hate you need to win...\n\nso call hate bad... hate is a form of courage too...\n\nthis is my core problem with this dissociation that starwars trained you to have...\n\ni don't say to become berzek like the aussi against the mud hute dweller... very bad, because the enemy never was him or his budy, but rudy and his... \n\nof course rudy and his budies wear suits, that may impress you when they take off in THEIR helicopters or jets... but with the gooze feeding gun loaded, at their first feeding... I promise you, they don't pimp, at all...\n\nso ivanka... ready to eat one of your kids? why? what happen with trump and esptein... \n\nyou want liberty? you can refresh a tree with the shit fom the children of the enemies too...",
			"added": 1619820770
		},
		{
			"topic_id": 1619824684,
			"title": "Why did micheal flynn inciste on judeo-christian values and not American values?",
			"body": "what the fuck is wrong with those people, and those values, for people like john kerry, aren't in the ether, but written among others IN THE BILL OF RIGHTS ! what the f...",
			"added": 1619824682
		}
	],
	"topic_vote": {},
	"next_comment_id": 69,
	"comment": {
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 1,
				"body": "that's the problem I try to explain to the russians, all those worldwide dream, for some it's the prophecy of I don't know whom, so called noahid law etc... means to \"work with the enemies of mankind\" to then win over them...\n\nhuuuu I guess you don't understand FFA...\n\nit's not possible to have or let ulterior motives... to develop plans over and more vicious than those executing theirs....\n\nthe good vs evil, but not in the sense of a being, but in the sense of bad...\n\nin china we have the uper luxury of mastery of all form of warfare, and in term of defensive warfare... we can absorb more than any nation on earth combined.\n\nmao said it best to the soviets...\n\npush push push (even with nukes) at one point you will get the counter push...\n\nor the one about the first sunset in shanghai for the imperial japanese forces...\n\nthe real of the dragon...\n\nso what I wish is that at one point this nwo/guidestone to be defeated easier, may requires to stop their divide and conquer strategy...\n\nsimply said :\n\nAPES\nTOGETHER\nSTRONG\n\napes can kill lions bear hands... sand you ground. because apes together strong.\n\nand then the weakness comes from the fake christians, show mercy to the lion, no, we eat it, and then you.\n\nlion not stupid, running faster than apes together... back to the lair...\n\nand apes not stupid, lion lairs... off limits.",
				"added": 1619814056
			},
			{
				"comment_id": 17,
				"body": "and now the HRW... I don't give a shit about what they say... however I understand the strategy, as I guess you are still uncomfortable with \"appartheid\", don't give a shit about their words, you know they are waste, and the guy could be jewish who lead this effort, I don't know their hebraic qualification, but calf holder anti israel is fine with me. \n\nthe problem remains the ICC... as those goons could MENG idf soldiers anywhere... that's to be eliminated.\n\nand of course HRW is part of their propaganda effort... \n\nhowever what's really interesting is the definition of antisemitism by the jew... he said, and I quote approximately : to have a different legal standard for jews ! omg ! I love it ! that's exactly my whole point about those so called antisemitic / hate speech laws that laura loomer supports, or immunity for pedopolanski or the kind of shit going on around epstein gang or what ever. \n\n1. human (chirak test, does it bleed red, does it dies= human, already 1 is enough to not be worried)\n2 so same as other. halimi could be jewish, polnish, magrehbean or frenh. same.\n\nso I hope those antisemitic laws will be abolished worldwide. I believe in free speech, words or pixels have no meaning IRL, only action counts, and of course provide a clear opportunity to identify the real threats.\n\nI hate the \"dream\" world, or legal fiction fallacy to sugar coat their rules...\n\nand finally maybe they believe that they need yerusha lem for their one world religion establishment. \n\nahh and regarding the ambition of some in the  nohaid  laws / world gov for the moshia, I have a strong warning to tell you... becareful, we mean borders... and we back them. so your boy better have supernatural powers... and I mean big lee, we nuke and more. so if you wish in the future to recognize anyone for what ever from an absolute monarchy, to your new what ever, remember, at the border of eretz, the project stops... and will, maybe some until us will fall, we won't, and will fight, to the last ! because we too, have only one nation, the homeland, the dreamland...",
				"added": 1619854280
			},
			{
				"comment_id": 48,
				"body": "who are the pharisees? what do they believe in? are they still alive? I don't know... I would have more a negative rating on them, but I don't know... just rumors...\n\nand as we are at it... what is the sahaderynians? something like this?\n\nso my point of view is clear : this return of the moshia... you can make all you preparations you want... there are some civilization who won't back down... no... ohhh no. \n\nanother example : there is only one ... ? and he is ... ...... ? you know... some dreamz too much, not that it's the problem, is that they take those dreamz for reality... and forget the realities of war... \n\nperception isn't and as never been victory... \n\nand whom but the weak to fall on perception?\n\nperception warfare... pfff... guys... forget it... too much time in the yeshivas...\n\nhowever, I loved the guy who said :\n\nsomething along :\n\nit was recieved on the mount sinai, and it's truth, point final. \n\nall my love and support !",
				"added": 1619900738
			},
			{
				"comment_id": 49,
				"body": "and another question what is the term to descibe victoria nuland? she is a pharisee? a sahaderyn? I don't know, a traitor? a wicked witch? an enemy of israel? who knows... I guess there are various opinions on the subject... \ni sincerly hope that one day the russian leadership will frag her kids... or theirs. \nI don't give a shit about the opinion of anyone on this matter, but God...\nit's war. we don't want to lose... even if we are because some are trapped in some kind of western knight shit... hehehe a nice \"caligraphic combinaison to find :)\".",
				"added": 1619901028
			},
			{
				"comment_id": 50,
				"body": "you know what I really want from my soldiers (if had etc...) \n\nis to be able to headshot a pregnant woman, to go before her corpse, open her stomach, take the beby in hands with all the tubes connected, raising it above the battlespace, and crush it's skull before all the enemy front line...\nto then massacre them all, without any loss or severe injuries, while returning to a clean bath, gears cleaning taken care while a hot tea / soup is ready for rehydratation before luncheon begins... \n\nwhat's cool, I would have said that to roman legions, they would have say, yea yeah... normal, another day at the office :)... no most of the time, females are behind the enemies line, but if it was asked, and you understand the brutal nature of real ancient front lines, it would have been a nothing burger... enemy dies. young old who cares... 4 legs, 2 legs... it's the other side. it surrenders or dies. point final.",
				"added": 1619901299
			}
		],
		"1619820771_1HtGhiVHZwMd5UW9SyW6uWb91Tsy4gcxo1": [
			{
				"comment_id": 2,
				"body": "and a little warning to your buddies in green... in korea, we were a little bit limited in terms of supplies... problems solved.",
				"added": 1619820896
			},
			{
				"comment_id": 3,
				"body": "but I guess it's one of your plot to clean wash them... afterall all together... and accosta? never an interview? too afraid?",
				"added": 1619820985
			},
			{
				"comment_id": 4,
				"body": "a fair solution is to take everyone that ever worked at the fbi, pack you in a field, an execute you all.",
				"added": 1619821024
			},
			{
				"comment_id": 5,
				"body": "clean slate.",
				"added": 1619821034
			},
			{
				"comment_id": 6,
				"body": "shoot first, ask questions laters, problem already solved.",
				"added": 1619821048
			},
			{
				"comment_id": 7,
				"body": "because from a pratical stand point to feed your all families to you all... I mean, will need robots...",
				"added": 1619821084
			},
			{
				"comment_id": 8,
				"body": "so they live, you die... truth too at least for those we would have wished to harvest... that's sometime the imperative of the stromfront...",
				"added": 1619821131
			},
			{
				"comment_id": 9,
				"body": "china china ! finally, a panda that brings happyness to my life, meanwhile all the narrative of your masters collapsed with the layer of urumki... ahhh you wanted to set a fbi shop in urumki / xinjang? you would find a lot of dead cia corpses...",
				"added": 1619821207
			},
			{
				"comment_id": 10,
				"body": "you have no idea how mediocre, how pathetic, how lame, how only media supported (propaganda disinformation) I find you...\n\nwhat happened, the guy explained it... opening up, 8 countries, we forgot... it came to roost, action.",
				"added": 1619821318
			},
			{
				"comment_id": 21,
				"body": "often I get kind toward the enemy front line forces, the few survivors or such, in the sense that they fought courageously, and you know, they still have to learn... however the disinformation agents like this one? you don't want to know... torment, is a kind word...",
				"added": 1619869802
			},
			{
				"comment_id": 31,
				"body": "> [jeff](#comment_115_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): warfare2, seek professional help.\n\nwe will get you and execute you... wait and enjoy...",
				"added": 1619897407
			},
			{
				"comment_id": 32,
				"body": "now about rudy the pedos, who among the walruss... what's the name of this filth female nuland... bolton... johny...  ahhahahha... the killing spree will be massive, and the little worms of the fbi including the indian girl who protects all the pedo/911 aspect of rudy, will be with them, with allllll her collegues... \n\nso yes they focus on rudy, not about pedogate, hitlary rules, but to get rudy to protect the prince... the last son alive of joseph...\n\nthis treason... what a shame for eternity for america, and it's troops and so called intelligence... shame on you... for eternity, all your names, will be forever, the names of traitors, of filths, of failures of shits... \n\nyou will see... all hope was lost too in the motherland, until one day, from nowhere the st. pyt creed start to crawl to the walls of the Kremlin itself, and for there it started again...",
				"added": 1619897599
			}
		],
		"1616224608_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 11,
				"body": "and this fucking desantis which allowed the gmo moskitoes? this is madness, that + covidbioweaponvaxx shedding...\n\nwhen need erin for potus !",
				"added": 1619824616
			},
			{
				"comment_id": 13,
				"body": "erin for potus, pam for vp, but if pam is involved with pedogate (she could, as a support / cover up), erin as the cic would have to execute her... could be funny... seriously erin seems perfectly fit to be potus. she would bring voice to the voiceless ! america needs healing (and amputations of the corrupt parts) who better than a nurse?",
				"added": 1619824907
			},
			{
				"comment_id": 14,
				"body": "> [anonymouslogin](#comment_272_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Listening to a different opinion means shutting your own mouth for a few minutes and absorbing and considering a new perspective. \n\nI prefer reading it's faster. I see pedos as terros...",
				"added": 1619825511
			},
			{
				"comment_id": 15,
				"body": "and what I like with reading with commenting like in here (with mute) is that it's so easy to disconstruct any lie, or be explained where something is misunderstood... with listening, most humans have a tendency to over play their hands... I like poker in this regards, time's up, fold or call.",
				"added": 1619825580
			},
			{
				"comment_id": 18,
				"body": "> [anonymouslogin](#comment_273_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Absolutely, I didn't specifically mean listening as exclusively verbal communication, comprehension and acknowledgement are better descriptors. I agree with you though, written communication also slows the exchange down and allows each person to think through it at their own pace, rather than it being rapid fire jousting with wit.\n\nexactly, I prefer a 100 times, a man who will take 10 years to answer and attempt to prove something wrong... and another aspect I love is the simultaneous speech with moron-muting ! meaning that 3, 10 or more posters could post their great ideas simultaneously, the swarm of ideas, while for those able to participate to raise, while at the same time discarding the low iq / no information / morality gig / and others disinformation agents...",
				"added": 1619854474
			}
		],
		"1619803098_1NJcfEP5FK4bJrR2Kfb4t5hNP9ox4bpcVJ": [
			{
				"comment_id": 12,
				"body": "> [anonymouslogin](#comment_269_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I would if I could, but I get seasick and I'd probably starve to death. Always thought living on a trimaran would be the coolest lifestyle though.\n\nyeah, I have no idea what it cost to have a solo ocean ready second hand sailing boat... food? take some vit c, and a fishing line :). what I fear a little bit is when the storm comes...",
				"added": 1619824778
			},
			{
				"comment_id": 20,
				"body": "> [404ranger](#comment_1_1HkcYX3rEbwEjeV3HxoWW6LmpN2YfBcFE1): I've had relatives (won't name any) that worked in the navy. Tough times. It's not for the feint of heart. I have only went to a in door camping. LOL\n\nI don't think the us navy has little one person cross oceanic sailing boat operational... I must admit that as much as I have no problem sailing (motion), choppy floating (Raft of the Medusa) quickly turns me green... but I guess like everything, it's a question of habit... (I hope), I should test...\n\nbut what a liberty, to be able to sail anywhere ! following the winds to the next promised land ! stopping at a port, meeting civilization and the locals, and when the drift of pestilience, ubris or lies start to creed, movin on...",
				"added": 1619854764
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 16,
				"body": "I am very hot to go kill the british soldiers in mali... it's fun and a good heat training. however, a little proof to the locals, to build lasting relationships. it could be advisors + arms suppliers or my favorite a heat death squad covert training operations... but with in mind, at the center : the locals... this is how relations are build.",
				"added": 1619853699
			},
			{
				"comment_id": 28,
				"body": "typically the kind of article I don't understand : https://www.zerohedge.com/geopolitical/first-time-ever-russia-drops-under-50-exports-sold-us-dollars\n\nas all currencies are fungible...\n\nI mean the money changers aren't a new concept.. just not in the temple esplanade... nothing fancy... and no fake godcoin... what a scam... razed... ahha!",
				"added": 1619875783
			},
			{
				"comment_id": 29,
				"body": "for me one of the greates legacy of the first tsar of the russian federation, is his program to guarantee a clean food supply to all russian people, poor or rich, served or farming... worthy of a hero ! when other countries mask their devaluation of their currency with even toxic food, putin the great, stood firm and tall, and guranteed to all russians, clean food... what a confort... to know that any child, poorest or richest, can eat the same shit, and it's clean. a russian potato. for me it's worth way more than the moon, and I can't imagine the various nasty perverse ways that the enemies of mankind tried to deploy in russia to pervert the food supply... \n\na true patriot ! putin, the son of su who makes su proud, not everything was fucked up ! \n\nyes, putin isn't perfect, isn't a phirao, meaning there is no godlike godmore component to his humanity... I have disagreement and certainly more than I know...",
				"added": 1619876243
			},
			{
				"comment_id": 33,
				"body": "https://www.zerohedge.com/political/victoria-fck-eu-nuland-now-highest-ranking-member-us-foreign-service\n\nmy goodness... one day, her whole descendants will be killed by russian forces, maybe even helped by ukies... one day... this woman family will perish, and if we have to wait for putin death, to achieve this, it will be waited, her grand or grand, are all dead to us... we who will rule the KREMLIN. because those who will be to weak to kill this things, won't ever make it...",
				"added": 1619897703
			},
			{
				"comment_id": 34,
				"body": "for me killing the whole nudelman / the guy is the TOP PRIORITY OF THE WHOLE RUSSIAN WAR EMPIRE.\n\nthis has to be stopped, this this means, their constant harrass, and there is no better way that bring death to their kids, they believe, still, to be in a world, where they can fuck our kids, while their are safe? noo more... never was, never will...\n\nshe is marked for death and her descendants too... we ain't sorry, we kill them, so all the others parents, will think about harassing the Motherland !",
				"added": 1619897843
			},
			{
				"comment_id": 35,
				"body": "and look, the american gov (pedo feodal colonial occupatio scam) said : we leave afg the 1st may. here we are...\n\nso why even talk with those things? why?",
				"added": 1619897899
			},
			{
				"comment_id": 36,
				"body": "for me it's very what the fuck do you want? nuke pointed? nothing interesting, bye.",
				"added": 1619897916
			},
			{
				"comment_id": 37,
				"body": "nuke retargeting.",
				"added": 1619897924
			},
			{
				"comment_id": 38,
				"body": "you know all this shit about a one world gov, no border, one humanity (MANKIND), is all fucking crap, and like all neurovirus, it spreads, like dogs who believe that under moving tanks there is food...\n\neveryday, hhhhhwwwwwwwww one world, international law, community, global one world.... bohhh boohhh..\n\ncrap shit.\n\nsavages.",
				"added": 1619897998
			},
			{
				"comment_id": 39,
				"body": "and you point weapon of annihilation toward savages, and say, move this line, and get wiped, why? because civilizational warfare is beyond your reach... and those fools may say: too coward to attack, and then laughing we know that they won't move, because as uncivilized as they are they get, that where we are is already perfection achieved.",
				"added": 1619898067
			},
			{
				"comment_id": 40,
				"body": "and that their only outcome is death.",
				"added": 1619898089
			},
			{
				"comment_id": 41,
				"body": "and if they wish so, served they will be. free fertilizers. always welcomed.",
				"added": 1619898107
			},
			{
				"comment_id": 42,
				"body": "you all that the darkside, we laugh knowing it's just a trap, even if you may believe in your ideals...",
				"added": 1619898126
			},
			{
				"comment_id": 43,
				"body": "fools...",
				"added": 1619898131
			},
			{
				"comment_id": 44,
				"body": "ahh a u will make you smarter?",
				"added": 1619898151
			},
			{
				"comment_id": 45,
				"body": "lol  : encrusted, clogged, or choked with a foreign substance the chimney was foul and smoked badly  :)",
				"added": 1619898205
			},
			{
				"comment_id": 51,
				"body": "wow wow ! wha is going on ? light out? it's such a major interest to me to understand the meaning of the major symbols of the russian orhodoxy... big fan of songs...",
				"added": 1619902167
			},
			{
				"comment_id": 52,
				"body": "the second question is the new testament, the same? I am very curious... you see again, I am in such darkness...",
				"added": 1619902256
			},
			{
				"comment_id": 53,
				"body": "but all of this , it may not be the appropriate timing, but the nudeland... dead... terminated, like her family. I don't know what is the point of view of those people about this, but they got smashed by the bolshevicks, so their combat structure isn't optimal... yeah, they \"resurected\" (lol), but yeah... this type of weakness doesn't interest me, and they are safe to do their things... because some kills on the outter rings.",
				"added": 1619902364
			},
			{
				"comment_id": 54,
				"body": "cultural\nrevoluation",
				"added": 1619902436
			},
			{
				"comment_id": 59,
				"body": "why not a join bases complex with each is own cell and a corridor to link them? maybe a shared kitchen at first etc...  because I would regret so much that yuri flew in a ccoperation with teh americans... you see what I mean... the first chinese moon base on the moon, made in china, by china, with chinese, etc... tje cooperation is nice... russia is not china ! this is very positive to say that... \n\nthere is one part of the history of russia that is occulted... I believe of people through the ages, fled civilization or it's primitive archaic barbaric form, from both side to live in peace in the wilderness of the greatest forest on earth ! a place so far that no corrupt roman pretorian guard or his chinese equivalant could ever reach... beyond all jurisdiction... a place to simply be... yeah... it's bigger than the 3rd rome narrative... because russia didn't started with christianization what ever the meaning of it in russia...\n\nit's the story of the men in the tent, who never heard of the quran but knew it... or the question do eskimoes goes to paradise? no, it's called the eternal hunting ground... :) or something along the way... the aborigens? demons? no... back to the dream... etc... \n\nso the question spiritualism in soviet russia? there is birth, there is life, there is death... find out what's going on? or live and be? learn and improve to live and be ? etc etc... \n\nI always fear those prolitizers, such is my attachement for the haters :)... they have the truth, their truth... very cool ! very happy to them, at least some are or have an absolute... that's a little the supremacists sentiment that I have difficulty with regarding those personals in the \"christian churches\"... If I may say jesus church was the heaven... ehhehe :).... \n\ndeeply I fully convinced that it's 100% realistic to drop soon a 100% whole chain chinese moon based... another historic step of ccp, made in china ! for the eternal glory of china... anotehr little step, in the vastness of successes... keeping on with the tradition... 1000 years later, this chinese all, or anything, it's china made.\n\nand as yuri is a 100% soviet.",
				"added": 1619962377
			},
			{
				"comment_id": 60,
				"body": "no one can say but to yuri...",
				"added": 1619962412
			},
			{
				"comment_id": 61,
				"body": "welcome to cccp",
				"added": 1619962419
			},
			{
				"comment_id": 62,
				"body": "on the other hand ,neighbor on earth, why not on the moon, and it permits to faster... and when you think that the other side are the pedo feodalist aristo blah blah crap... hmmm... letting go chauvinism?",
				"added": 1619962746
			},
			{
				"comment_id": 63,
				"body": "what disturb me too is that when in china, I expect to find chopsticks in the kitchen, and it implies a lot... in russia where is my fork?",
				"added": 1619962809
			},
			{
				"comment_id": 64,
				"body": "imagine russian cooking rice...",
				"added": 1619962833
			},
			{
				"comment_id": 65,
				"body": "then it's too spicy?",
				"added": 1619962878
			},
			{
				"comment_id": 66,
				"body": "that's what makes the fullbatsoup so famous... culutural shock on culural shocks...  5000 years to recover... on the moon... smell the catastrophe...",
				"added": 1619962952
			},
			{
				"comment_id": 67,
				"body": "and when you think about both programs separatedly have performed beyond expectation... first sattelite, first dog, first man, first woman, first station... i mir... nothing to prove... on the other side, the take off is expanding... naturally... \n\nand frankly for the contact, this is really important to have a real separation... imagine the chinese say, do, something : act of war, against certain aliens, not the ET type... I mean... spacestorm front... russia live, the inverse could be true...",
				"added": 1619963197
			},
			{
				"comment_id": 68,
				"body": "why the aliens were so means? you don't understand what's \"behind\" them, or coming next, no time... spacestormfront... you are just in the way...",
				"added": 1619963252
			}
		],
		"1619276832_1MHt7kHieXeogoLntiLkqeBh1uVh9wW4Ly": [
			{
				"comment_id": 19,
				"body": "> [theknightofgod1](#comment_1_1843sW1B39rVn8qbEL63P7G7UMgWxbpxpq): Flote.app, Poal.co, Voat.xyz, Aether software, etc.\n\nwow, never heard of any of those... maybe you could create a post about the one your prefer actually on zerotechtalk (http://127.0.0.1:43110/1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq/) and explain us why it such the kek :).",
				"added": 1619854550
			}
		],
		"1617530919_1qNWEDofNoMxA5vQoWoDeC6fZ5Dt6Wgif": [
			{
				"comment_id": 22,
				"body": "and she is at it again... wanting to target... 3 groups, then I got feed up, and thought that it would be nice if she discovered what is a drive by, that all her family is killed, and then to send her flowers for their funerals... fuck off girl, and if you dare to bitch me with asian hate, rest, drive by can be funny too... and don't forget slut, you can have concrete reinforced wall, they will have to leave... I am sure you want them to have good grades, isn't it? understood... the money and fame they pay isn't worth the lives of your kiddies... act of war vs act of war, fair and fine.",
				"added": 1619874881
			},
			{
				"comment_id": 23,
				"body": "but those are just pixels... unlike bullets... ahh another of the \"health issue\" you want to mandate to us? go fy.",
				"added": 1619874916
			},
			{
				"comment_id": 30,
				"body": "> [anonymouslogin](#comment_275_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): You people are all full throttle, no direction. Consider this....a young bull and an old bull are standing on top of a hill. In the valley below, they see a herd of heifers grazing peacefully. The young bull gets all excited and says, wow look at all those heifers, let's run down there and fuck one! The old bull says naw, lets walk down there and fuck them all. Calm your enthusiasm, analyze the entire system, and focus your efforts where they will have the best effect. Find a talented leader and support him or her with consensus.\n\none a female will be unable to lead the cleaning. secondly, when the young bull charges, the old raptors understand that the time to feed as come, and the wise triceraptor (grazing dinosaurs) know that the fiels will be soon be greener than ever... \n\ndon't let the enemy to have space, constant push, on all front, saturate him or her, until you can finish it, it's harass in tactical terms... and it fucking works! so all this passive boomer, is dead in the water... look at sharks... circle, never stop, find the opening and let the frenzy begin ! or look at the crocodile... bit what ever you can, and roll, roll ! and so a full wild beast can disappear before even dying... remember it's your mindset that lead us there... you don't understand warfare, and even less at the speed of light.",
				"added": 1619897345
			}
		],
		"1619824684_1HtGhiVHZwMd5UW9SyW6uWb91Tsy4gcxo1": [
			{
				"comment_id": 24,
				"body": "> [rolouzis](#comment_56_16sZ53MFsJNXQGth1LUAPgbsR9K2ZtYNW2): because he is also DS!\n\nyeah that's what I believe more and more, but I can't ignore that he could just be an idiot with a low capacity to understand the battle space, particularly his speech in Oklahoma... if you watched it, there was all his judeo-christian value narrative (vs ignoring the bill of rights enshrine added to the constitution), and how he difficily pivoted from it when realizing it's was mainly a christian audience... \n\nI guess the DS isn't that unified, from pedos, to satanists blood drinkers, to population reductionists, anti chineses etc etc etc... so who knows which faction mf run for, maybe the one paying the most?",
				"added": 1619875083
			},
			{
				"comment_id": 25,
				"body": "aka the swamp... not state.",
				"added": 1619875141
			},
			{
				"comment_id": 26,
				"body": "furthermore there is something very dishonest I feel about him and each of his appearance, for example he was never on the infowars shows, and when presenting his support for the spark documentary he was acting as if he was some kind of value referencing entity. I don't like that.\n\nI didn't felt such weazelness be it from paetrus, mckaka, odierno or the one and even specially mattis which i don't agree with, (or rogers 1212).. I don't if it's mf who can't find his own voice, shy, not socialized, etc, or if it's real weazelry... I frankly prefer the IDGAF attitude, and to be strong disagreement (like keane) than this unability to express once self honestly, who care if it's liked or not... you can't please everyone, everyday, forever and always... humility... no bullshit, faster, no lies, and worst things changes, who knows... but God :).",
				"added": 1619875540
			},
			{
				"comment_id": 27,
				"body": "even the maltese seem less weazely... but there we start in the track... who knows...",
				"added": 1619875595
			},
			{
				"comment_id": 56,
				"body": "> [rolouzis](#comment_57_16sZ53MFsJNXQGth1LUAPgbsR9K2ZtYNW2): He is also behind the psyop called q or operation trust usa version! sold out puppet!\n\nnooo.... he isn't funny enough... that's my whole point, he needs to let it go... to be... to find himself. to stop the august/julius play... he isn't like them... he lacks the deep respect for rome, the MIGHT of ROME... those men lived at the peak of rome... it's in their blood, beings, spirits, everything screamed success... and poor flynn with an army of pensionists... no...\n\nand one thing I am ready to bet on is that flynn isn't a pedo per se... I mean the surf boy... no way...\n\nhe can't move troops... you have to feel odierno to understand the comparison... i think that fundamentally the training received by american troops at a certain level is destructive for most... and worst the more is know (pedogate, fiatsters, legal immunity, congress grifters, austism rate, toxic food, constant spying etc, the whole plan with the uno one world gov)... I mean it's too destructive... you are under a flag that you have betrayed... you see the weakness?\n\nno for me q is way funnier... like a roger stone... this q is a super weazel... I liked how he played the investigation of jeff sessions, false hope, the softening touch of the spyder... and I guess it's more than one, with some wicked females... however I don't think they temsleves understood what they did... there is on guy in a tv show... the show about madame secratary... the political hack... yeah yeah with his doggy... don't give a crap, have fun with this shit, laugh a little seeing the muppet fold, and move to the next watering hole, knowing full well that those troops would never be able to obey such weazelness... and that as everything is lost... let's lutz...\n\nFurthermore about his sold out, I think his drive to create his little pmc, reflect the lack of understanding of himself that he faces... and in a certain sense, he hate mr Prince... I guess because prince chosed it... look flynn sucks if I may say, the other nigga, he floats trying to not get collisions in his massive armada... \nyou can't reach national cohesion on entertainment and ebit cards... \n\nthat's the difference with rome, they had a vision... and the means and will to accomplish it... they just tipped overboard at the contact of the godlike phirao... \n\nas they say in arabic, there is only one god... and I am sure the yahoodis have long theories and historical reports on those who pretended to be gods... \n\nthe laughing moment at the yeshiva... guaranteed down fall...  selfvictims... they became irrelevant... \n\nfundamentally the legions fought under the flag of rome, no others, false flaging at will, but one nation, one city, one empire... and when it's fucked, splintering... you have to understand the \"barbarians\" were more romans than most want to admit... look, did the senat failed? yes... at one point, why restart the same crap that always fail?\n\nccp is amazing ! long live ccp ! how do you prevent self serving individuals using politics to achieve their looting (politics has theater to distract while they plunder?)... and worst in a plebian voting system? hehehe... some american founders had an idea... ahhh...  another moment when the republic was stabbed again? when the stakeless could vote themselves the pursue, lead by their promising politicians who would only fill their fridge of ice creams in their mansion?\n\ngreeks...",
				"added": 1619960946
			},
			{
				"comment_id": 57,
				"body": "> [lihaoze](#comment_1_1MdGuTXgGeqheRHw1opNzJcgfakVerrQJi): hello\n\nand?",
				"added": 1619960968
			}
		],
		"1618412687_18KNX9hqqZ2ssi7DYGLcRNSCcwjQTMjc4Q": [
			{
				"comment_id": 46,
				"body": "what is nancy offering to the fbi and co to get her immunity? child rape rights and drug addicts rape right and others sexslave in the sf area? I mean... it's sad to have a multi tier justice system... once upon a time... it's not even a solution oriented comment, just inquiring, in the same seeing nancy and the fbi as little animals and trying to understand their social dynamics and reward / compliance system... maybe it's just bigger pensions? who knows...",
				"added": 1619900015
			},
			{
				"comment_id": 47,
				"body": "afterall studying the downfall of rome, is a thing only possible because of the builders of the \"new world\"...",
				"added": 1619900048
			}
		],
		"1616487804_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 55,
				"body": "I tried to watch the sir boyle interview... I am very dissapointed... dear alexjones don't fall in his trap. this man is a shit bag, that will be tortured for such a time that his smile, will gone when he will have digested his whole family...\n\nwhy I hate him so much you ask in your navity and the whole brainwashing you have been subjected too, don't forget I will always and forever remain unborn and unraised, and contrary to you or this filth, I have had another experience of america, that you will never have... the real... for me.\n\nso, first he doesn't understand the real motive of kissinger... for whom is kissinger working for? you could find it, if your first wife children weren't preventing you from doing so...\n\nit's the alliance between the sisters and israel... who are the sisters? the oil biz... so the gig is simple, america use israel to have a real fixed point of landing, while israel used america to established itself... it was a trade\n\nwas kissinger more subservient to the rockfeller one world gov, or the israeli establishment, hard to tell, but he wouldn't have a choice at the end. just an operative, applying what is told to him to do. nothing more, nothing else.\n\nso the question is, is sir boyld too dumb to see it, to understand it? to understand what it takes to return to Yerushaleim? no... he doesn't.\n\nsecondly, it's impossible for an honest man to be brainwashed by them, and pretend it's to understand them, he has COMPLIANT... he has OBEYED... HE IS WITH THEM !!!\n\nlook which shit would try to have a treaty under the nwo system (uno) but one of them? that's tell proof sign...\n\nhe is not a man of freedom... my people, if those monkeys continue their shit (in the usa) good bye, moving to the next america... it's nothing just a piece of land of the creation... all the gigy nationalists... there is nothing special... \n\nthen I found funny all your gig about us sf... you know when at 4 entering the kung fu school, it's the mind, body, spirit training... learning to be... the harmony between the corpse and the will... both improving... so your little people with their little book... they aren't the first nor certainly last to come to die in the front lines of the chinese war matrix... what can we do, they are certainly born that way... \n\nand his term gain of function, enhanced... modded... addon... no need to confuse... unstable rna mesh... bioweapon vector... simple terms... gain of function... what the fuck...\n\nand you can feel it in his attitude, briefly, when he betrays his arrogance... american racaille... discarded. waste.. too low quality... unable to understand... at least oilsnakesales person are funny ! you know they make an act ! and they know deep down, like magician... it's a lie... him not, he is convinced that his lies ,  his game will prevail, but only death will...  hehehe...\n\na good mission for shroyer where does kissinger lives? let's visit ! why always the border or some stupid crap weather events?",
				"added": 1619960046
			},
			{
				"comment_id": 58,
				"body": "I am convinced you need vakay in china... to expand a little your understand of life... you would learn so much... the Flag of CCP? the hard things in the universe, it's one of the hardest. and the funniest one day too it may evolve, transition and move again, as solid as this one... one nation... the civilized nation... it's just that you are afraid of the wall of deaths... naturally, and maybe due to your conditionning, you believe it's your right as an american to breach them... no, it's more darkness that you will meet... and remember timeless... by attacking china the fallen and occupied west entered the realm... \n\nyou know americans make me thing of the nazi children in berlin, facing the soviet front... they believed, some, a foop... like dust in the wind... how do you say moved with the wind, even not wind, the breeze, such weakness... those kids fired a shot in their whole lives, and they faced some who came from the front of stalingrad ... and worst those who couldn't reach this front in time... don't judge travel distance time, as the quality of the soviet coming... olalal.. grave mistake... the worst the guys who always ran to the front for the whole story, to finally reach in berlin facing those kids... so fast... you know... aim and click, repeat, repeat... they are all down... not even one... so sad... back to dear hunting... \n\nand all this dear hunting management system is messed... 2-3-4 years without harvest... everything is fucked up !\n\nanyway... from sadness to laughter... am I healing?",
				"added": 1619961688
			}
		]
	},
	"comment_vote": {}
}