{
    "article": [
        {
            "title": "Dogecoin",
            "text": "Dogecoin (/ˈdoʊʒkɔɪn/ DOHZH-koyn,[1] code: DOGE, symbol: Ð[2] and D) is a cryptocurrency featuring a likeness of the Shiba Inu dog from the \"Doge\" Internet meme as its logo.[3][4][5][6] Introduced as a \"joke currency\" on 8 December 2013, Dogecoin quickly developed its own online community and reached a capitalization of US$60 million in January 2014;[7] as of June 2017, it has a capitalization of US$440 million.\n\nCompared with other cryptocurrencies, Dogecoin has a fast initial coin production schedule: 100 billion coins have been in circulation by mid 2015 with an additional 5.256 billion coins every year thereafter. As of 30 June 2015, the 100 billionth Dogecoin has been mined.[8] While there are few mainstream commercial applications, the currency has gained traction as an Internet tipping system, in which social media users grant Dogecoin tips to other users for providing interesting or noteworthy content.[9] Many members of the Dogecoin community, as well as members of other cryptocurrency communities, use the phrase \"To the moon!\" to describe the overall sentiment of the coin's rising value. Thanks to crowdfunding efforts, a gold coin representing the cryptocurrency is scheduled to reach the Moon's surface in 2019.\n\nOverview and history[edit]\n\nA Dogecoin paper wallet\nDogecoin was created by programmer Billy Markus from Portland, Oregon, who hoped to create a fun cryptocurrency that could reach a broader demographic than bitcoin. In addition, he wanted to distance it from the controversial history behind bitcoin, mainly its association with the Silk Road online drug marketplace.[16] At the same time, Jackson Palmer, a member of Adobe Systems' marketing department in Sydney, was encouraged on Twitter by a student at Front Range Community College to make the idea a reality.[17]\n\nAfter receiving several mentions on Twitter, Palmer purchased the domain dogecoin.com and added a splash screen, which featured the coin's logo and scattered Comic Sans text. Markus saw the site linked in an IRC chat room, and started efforts to create the currency after reaching out to Palmer. Markus based Dogecoin on the existing cryptocurrency, Luckycoin,[18] which features a randomized reward that is received for mining a block, although this behavior was later changed to a static block reward in March 2014.[19] In turn, Luckycoin is based on Litecoin,[20] which also uses scrypt technology in its proof-of-work algorithm. The use of scrypt means that miners cannot use SHA-256 bitcoin mining equipment, and that dedicated FPGA and ASIC devices used for mining are complicated to create. Dogecoin was officially launched on December 8, 2013.[21] The Dogecoin network was originally intended to produce 100 billion Dogecoins, but later, it was announced that the Dogecoin network would produce infinite Dogecoins.[22][23][24]\n\nOn December 19, 2013, Dogecoin jumped nearly 300 percent in value in 72 hours, rising from US$0.00026 to $0.00095,[25] with a volume of billions of Dogecoins per day.[26] This growth occurred during a time when bitcoin and many other cryptocurrencies were reeling from China's decision to forbid Chinese banks from investing Chinese Yuan into the bitcoin economy.[20] Three days later, Dogecoin experienced its first major crash by dropping by 80\\<tt> due to large mining pools seizing opportunity in exploiting the very little computing power required at the time to mine the coin.[27]\n\nOn December 24, 2013, The Reserve Bank of India cautioned users of Dogecoin and other cryptocurrencies on the risks associated with them.[28] On December 25, 2013, the first major theft attempt of Dogecoin occurred when millions of coins were stolen during a hacking attempt on the online wallet platform Dogewallet.[29] The hacker gained access to the platform's filesystem and modified its send/receive page to send any and all coins to a static address.[30][31] This incident spiked Tweets about Dogecoin making it the most mentioned altcoin on Twitter.[32] To help those who lost funds on Dogewallet after its breach, the Dogecoin community started an initiative named \"SaveDogemas\" to help donate coins to those who lost them. Approximately one month later, enough money was donated to cover all of the coins that were lost.[33] By January 2014, the trading volume of Dogecoin briefly surpassed that of bitcoin and all other crypto-currencies combined.[34] As of 25 January 2015, Dogecoin has a market capitalization of USD 13.5 million.[35] April 2015 Jackson Palmer announced he is taking an \"extended leave of absence\" from the cryptocurrency community.[36]\n\nFundraising[edit]\n2014 Winter Olympics[edit]\nThe Dogecoin community and foundation have encouraged fundraising for charities and other notable causes. On January 19, 2014, a fundraiser was established by the Dogecoin community to raise $50,000 for the Jamaican Bobsled Team, which had qualified for, but could not afford to go to, the Sochi Winter Olympics. By the second day, $30,000 worth of Dogecoin was donated,[37] and the Dogecoin to bitcoin exchange rate rose by 50\\</tt>.[38][39][40][41][42][43] The Dogecoin community also raised funds for a second Sochi athlete Shiva Keshavan.[44]\n\nDoge4Water[edit]\nInspired by the Winter Olympics fundraiser and smaller charity fundraising successes, the Dogecoin Foundation, led by Eric Nakagawa, began collecting donations to build a well in the Tana river basin in Kenya in cooperation with Charity: Water. They set out to raise a total of 40,000,000 ($30,000 at the time) Dogecoin before World Water Day (March 22). The campaign succeeded, collecting donations from more than 4,000 donors, including one anonymous benefactor who donated 14,000,000 Dogecoin (\\~ $11,000) in what news media dubbed \"the most valuable tweet in history\".[45]\n\nNASCAR[edit]\nOn March 25, 2014, the Dogecoin community successfully raised 67.8 million Dogecoins (around $55,000 at the time) in an effort to sponsor NASCAR driver Josh Wise. Wise ran with a Dogecoin/Reddit-sponsored paint scheme at the Aaron's 499 at Talladega Superspeedway.[46] On May 4, 2014, Wise and his car were featured for nearly a minute, during which the race commentators discussed Dogecoin and the crowdfunding effort, while finishing twentieth and narrowly avoiding multiple wrecks.[47] On May 16, 2014, Wise won a spot at the Sprint All-Star Race through an online fan vote beating household name Danica Patrick, largely due to the efforts of the Dogecoin Reddit community. He finished the race in fifteenth, the last car running.[48][49] The following race in the Coca-Cola 600, Wise debuted a Dogecoin/Reddit.com helmet.[50] Wise later announced he would run the car again at the Toyota/Save Mart 350[51] as a thank-you gift to the community and the GEICO 500. He finished twenty-eighth in the race due in part to a refueling issue; he was in twelfth place after a gas-and-go pit stop, but the gas can did not engage long enough, resulting in a second pit stop that took him towards the back of the pack.[52] The developer of the NASCAR '14 video game announced that they are looking into adding the Dogecoin car as a drivable car in an upcoming DLC.[49][53]\n\nUse and exchanges[edit]\nSeveral online exchanges offer DOGE/BTC [54] and DOGE/LTC [55] trading. Three exchanges, Mengmengbi, Bter and BTC38, offer DOGE/CNY trading.[56][57] On January 8, 2014, AltQuick.co was the first exchange to launch DOGE/USD exchange.[58] On January 30, 2014, Canada-based exchange Vault of Satoshi also announced DOGE/USD and DOGE/CAD trading.[59][60] On February 2014, Hong Kong-based exchange Asia Nexgen announced that they would support the trading of Dogecoins in all major currencies. China-based exchange BTC38 also added their support on the Dogecoin exchange, boosting the market capitalization over 24 hours.[61][62] In the first day of trading, Dogecoin was the second-most traded currency on the platform, after BTC.[63] On September 2014, UK-based exchange Yacuna began offering DOGE/EUR and DOGE/GBP trading.[64]\n\nOn January 31, 2014, trading volume across the major exchanges was valued at $1.05 million USD. The market cap was USD$60 million. Three exchanges accounted for the majority of volume: Bter (60\\<tt>), Cryptsy (23\\</tt>), and Vircurex (10\\<tt>). The most traded currency pairs were DOGE/BTC (50\\</tt>), DOGE/CNY (44\\<tt>) and DOGE/LTC (6\\</tt>).[65]\n\nTrading physical, tangible items in exchange for DOGE takes place on online communities such as Reddit and Twitter, where users frequently share currency-related information.[66][67] On December 23, 2013, Tristan Winters of the online journal Bitcoin Magazine discussed what was needed for Dogecoin to replace bitcoin.[68]\n\nThe first Dogecoin ATM was demoed at Coinfest in Vancouver in February 2014.[69] Two bitcoin ATMs supporting Dogecoins and other altcoins opened in Tijuana, Mexico on March 17, 2014.[70]\n\nDogecoin has also been used to try sell a house,[71] and has been used in the pornography[72] and poker[73] industries.\n\nWeather forecasting mobile app, web application, and website Doge Weather's creators Katia Eirin and Bennett Wong request tips in Dogecoin to maintain their website.[74]\n\nDogetipbot is a cryptocurrency transaction service used on popular sites like Reddit and Twitch.tv.[75] It allows users to send Dogecoins to other users through commands via Reddit comments;[76] support for Twitch.tv and Twitter has been discontinued.[77] The service was launched in 2013 on Reddit.[78] The trademark \"dogetipbot\" was officially registered on August 19, 2014.[79] In November 2014, the developer team behind dogetipbot raised $445,000 in venture capital funding.[80]\n\nTransactions[edit]\n\nThis article needs additional or better citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. (November 2014) (Learn how and when to remove this template message)\nSee also: Bitcoin network\nLike bitcoin and Litecoin, Dogecoin functions using public-key cryptography, in which a user generates a pair of cryptographic keys: one public and one private. Only the private key can decode information encrypted with the public key; therefore the keys' owner can distribute the public key openly without fear that anyone will be able to use it to gain access to the encrypted information. All Dogecoin addresses are public key hashes. Unlike bitcoin addresses, which are 27 to 33 characters long, Dogecoin addresses are a string of 34 numbers and letters (both upper and lower case), starting with the letter D. A public key is the Dogecoin address to which other users can send Dogecoins. A private key, however, allows full access to the Dogecoin wallet; it must be kept secret and secure. Dogecoin holds the record for most transactions per day for any cryptocurrency, peaking at 2.5 times more transactions than all other cryptocurrencies combined in December 2013.[81]\n\nMining parameters[edit]\nDogecoin's implementation differs from Litecoin by several parameters. Dogecoin's block time is 1 minute as opposed to Litecoin's 2.5 minutes. The difficulty retarget time is once per block and the reward is fixed based on the block schedule listed below. However, when Dogecoin was first introduced, the difficulty retargeting was once every four hours, and the reward was a random number between 0 and a maximum defined by the block schedule. Under the system in which a random number of coins were distributed, rewards were calculated using a Mersenne Twister pseudo-random number generator.[82] While the original implementation of Dogecoin meant for there to be a fixed number of coins per block from block 600,001 onwards only (providing 10,000 coins per block), the algorithms in Dogecoin were changed beginning from the 145,000th block so that a fixed reward was always given (providing 250,000 coins per block until block 200,001).[83]\n\nOn March 12, 2014, version 1.6 of the Dogecoin client was announced. Along with allowing for there to be a fixed reward per block, the new client update also introduced a new difficulty algorithm called DigiShield. The main goal of the new difficulty algorithm, adopted from DigiByte, was to prevent multipools from being able to mine (and thereby profit) off the coin, reducing the price of the coin drastically, along with forcing single-coin miners to deal with the rise in difficulty the pools left in their wake. Thanks to the algorithm's near-instant change in difficulty, any multipool entering the Dogecoin network will immediately leave, as the difficulty of mining will spike upwards severely, causing a drop in profitability and, ultimately, an absence of multipools.[83]\n\nSeveral cases of using employer or university computers to mine Dogecoin have been discovered.[84][85]\n\nBlock schedule[edit]\nBlock numbers    Per-block reward    First block Expected coins produced (approx.)   Expected total circulation (approx.)\n1--100,000    0-1,000,000 (random)    December 8, 2013[86]    50,000,000,000  50,000,000,000\n100,001--144,999    0-500,000 (random)  February 14, 2014[87]   11,250,000,000  61,250,000,000\n145,000--200,000    250,000 (fixed) March 17, 2014[88]  13,750,000,000  75,000,000,000\n200,001--300,000    125,000 (fixed) April 28, 2014[89]  12,500,000,000  87,500,000,000\n300,001--400,000    62,500 (fixed)  July 15, 2014[90]   6,250,000,000   93,750,000,000\n400,001--500,000    31,250 (fixed)  October 2, 2014[91] 3,125,000,000   96,875,000,000\n500,001--600,000    15,625 (fixed)  December 14, 2014[92]   1,562,000,000   98,437,500,000\n600,001+    10,000 (fixed)  February 25, 2015[93]   5,200,000,000 per year  No limit",
            "slug": "dogecoin",
            "date_updated": 1533695128436,
            "imported": "zerowiki://dogecoin"
        }
    ]
}