{
    "article": [
        {
            "title": "Wireless mesh network",
            "text": "[[File:Wireless mesh network diagram.jpg|thumb|300px|Diagram showing a possible configuration for a wired-wireless mesh network, connected upstream via a VSAT link (click to enlarge)]]\n\nA '''wireless mesh network''' ('''WMN''') is a [[Telecommunications network|communications network]] made up of [[radio]] [[Node (networking)|nodes]] organized in a [[Mesh networking|mesh]] [[Network topology|topology]]. It is also a form of [[wireless ad hoc network]].<ref name=\"auto\">[[Chai Keong Toh]]  Ad Hoc Mobile Wireless Networks, Prentice Hall Publishers, 2002. {{ISBN|978-0-13-007817-9}}</ref>\n\nA '''mesh''' refers to rich interconnection among devices or nodes. Wireless mesh networks often consist of mesh clients, mesh routers and gateways. Mobility of nodes is less frequent. If nodes were to constantly or frequently move, the mesh will spend more time updating routes than delivering data. In a wireless mesh network, topology tends to be more static, so that routes\ncomputation can converge and delivery of data to their destinations can occur. Hence, this is \na low-mobility centralized form of [[wireless ad hoc network]]. Also, because it sometimes \nrelies on static nodes to act as gateways, it is not a truly all-wireless ad hoc network.\n\nThe mesh clients are often laptops, cell phones and other wireless devices while the mesh routers forward traffic to and from the gateways which may, but need not, be connected to the Internet. The coverage area of the radio nodes working as a single network is sometimes called a mesh cloud. Access to this mesh cloud is dependent on the radio nodes working in harmony with each other to create a radio network. A mesh network is reliable and offers redundancy. When one [[Mesh node|node]] can no longer operate, the rest of the nodes can still communicate with each other, directly or through one or more intermediate nodes. Wireless mesh networks can self form and self heal. Wireless mesh networks work with different wireless technologies including [[IEEE 802.11|802.11]], [[IEEE 802.15|802.15]], [[IEEE 802.16|802.16]], cellular technologies and need not be restricted to any one technology or protocol. See also [[mesh networking]].\n\n==History==\n\n===Architecture===\nWireless mesh architecture is a first step towards providing cost effective and low mobility over a specific coverage area. Wireless mesh infrastructure is, in effect, a network of routers minus the cabling between nodes. It's built of peer radio devices that don't have to be cabled to a wired port like traditional [[Wireless LAN|WLAN]] [[Wireless access point|access points (AP)]] do. Mesh infrastructure carries data over large distances by splitting the distance into a series of short hops. Intermediate nodes not only boost the signal, but cooperatively pass data from point A to point B by making forwarding decisions based on their knowledge of the network, i.e. perform routing by first deriving the topology of the network.\n\nWireless mesh networks is a relatively \"stable-topology\" network except for the occasional failure of nodes or addition of new nodes. The path of traffic, being aggregated from a large number of end users, changes infrequently. Practically all the traffic in an infrastructure mesh network is either forwarded to or from a gateway, while in [[wireless ad hoc networks]] or client mesh networks the traffic flows between arbitrary pairs of nodes.<ref name=\"jun\">J. Jun, M.L. Sichitiu, [http://networking.ncsu.edu/capacityWCM.pdf \"The nominal capacity of wireless mesh networks\"], in IEEE Wireless Communications, vol 10, 5 pp 8-14. October 2003</ref>\n\nIf rate of mobility among nodes are high, i.e., link breaks happen frequently, wireless mesh\nnetworks will start to break down and have low communication performance.<ref>{{cite web|title=Wireless Communications, Networking and Applications: Proceedings of WCNA 2014}}</ref>\n\n===Management===\nThis type of infrastructure can be decentralized (with no central server) or centrally managed (with a central server).<ref name=\"chen\">S.M. Chen, P, Lin, D-W Huang, S-R Yang, \"A study on distributed/centralized scheduling for wireless mesh network\" in Proceedings of the 2006 International Conference on Wireless Communications and Mobile Computing, pp 599 - 604. Vancouver, British Columbia, Canada. 2006</ref> Both are relatively inexpensive, and can be very reliable and resilient, as each [[node (networking)|node]] needs only transmit as far as the next node. Nodes act as [[Router (computing)|router]]s to transmit data from nearby nodes to [[peer-to-peer|peers]] that are too far away to reach in a single hop, resulting in a network that can span larger distances. The topology of a mesh network has to be relatively stable, i.e., not too much mobility. If one node drops out of the network, due to hardware failure or any other reason, its neighbors can quickly find another route using a routing protocol.\n\n===Applications===\nMesh networks may involve either fixed or mobile devices. The solutions are as diverse as communication needs, for example in difficult environments such as emergency situations, tunnels, oil rigs, battlefield surveillance, high-speed mobile-video applications on board public transport, real-time racing-car telemetry, or self-organizing Internet access for communities.<ref>{{Cite book|url=https://books.google.com/books?id=tO3dDYYXrpwC&pg=PA75#v=onepage&q&f=false|title=The First 100 Feet|last=Beyer|first=Dave|last2=Vestrich|first2=Mark|last3=Garcia-Luna-Aceves|first3=Jose|publisher=MIT Press|year=1999|isbn=0-262-58160-4|editor-last=Hurley|editor-first=D.|location=|pages=75-91|chapter=The Rooftop Community Network: Free High-Speed Network Access for Communities|editor-last2=Keller|editor-first2=J.}}</ref>  An important possible application for wireless mesh networks is VoIP. By using a Quality of Service scheme, the wireless mesh may support local telephone calls to be routed through the mesh. Most applications in wireless mesh networks are similar to those in [[wireless ad hoc networks]]. \n\nSome current applications:\n* U.S. military forces are now using wireless [[mesh networking]] to connect their computers, mainly ruggedized laptops, in field operations.{{Citation needed|date=June 2018}}\n* '''Electric smart meters''' now being deployed on residences, transfer their readings from one to another and eventually to the central office for billing, without the need for human meter readers or the need to connect the meters with cables.<ref>{{cite web|url=http://zigbee.org/Standards/ZigBeeSmartEnergy/Overview.aspx|title= ZigBee.org Smart Energy Overview.|publisher=}}</ref>\n* The laptops in the [[One Laptop per Child]] program use wireless mesh networking to enable students to exchange files and get on the Internet even though they lack wired or cell phone or other physical connections in their area.\n* '''Google Home''', Google Wi-Fi, and Google OnHub all support '''Wi-Fi mesh (i.e., Wi-Fi ad hoc) networking'''.<ref>{{cite web|url=http://www.androidcentral.com/how-wifi-mesh-networks-work?_ga=2.118951497.1982325821.1494489061-1333092243.1494489050 |title=\"Everyone is a node: How Wi-Fi Mesh Networking work by Jerry Hildenbrand, 2016}}</ref>\n* The 66-satellite [[Iridium satellite constellation|Iridium constellation]] operates as a mesh network, with wireless links between adjacent satellites. Calls between two satellite phones are routed through the mesh, from one satellite to another across the constellation, without having to go through an [[earth station]]. This makes for a smaller travel distance for the signal, reducing latency, and also allows for the constellation to operate with far fewer earth stations than would be required for 66 traditional communications satellites.\n\n===Operation===\nThe principle is similar to the way [[Packet (information technology)|packet]]s travel around the wired [[Internet]] – data will hop from one device to another until it eventually reaches its destination. Dynamic [[routing]] algorithms implemented in each device allow this to happen. To implement such dynamic routing protocols, each device needs to communicate routing information to other devices in the network. Each device then determines what to do with the data it receives – either pass it on to the next device or keep it, depending on the protocol. The routing [[algorithm]] used should attempt to always ensure that the data takes the most appropriate (fastest) route to its destination.\n\n===Multi-radio mesh===\nMulti-radio mesh refers to having different radios operating at different frequencies to interconnect nodes in a mesh. This means there is a unique frequency used for each wireless \nhop and thus a dedicated [[Carrier sense multiple access|CSMA]] [[collision domain]]. With\nmore radio bands, communication throughput is likely to increase as a result of more available\ncommunication channels. This is similar to providing dual or multiple radio paths to transmit\nand receive data.\n\n===Research topics===\nOne of the more often cited papers on Wireless Mesh Networks identified the following areas as open research problems in 2005\n\n* New modulation scheme\n** In order to achieve higher transmission rate, new wideband transmission schemes other than [[Orthogonal frequency-division multiplexing|OFDM]] and [[Ultra-wideband|UWB]] are needed.\n* Advanced antenna processing\n** Advanced antenna processing including [[Directional antenna|directional]], [[smart antenna|smart]] and [[multiple antenna research|multiple antenna]] technologies is further investigated, since their complexity and cost are still too high for wide commercialization.\n* Flexible [[spectrum management]]\n** Tremendous efforts on research of frequency-agile techniques are being performed for increased efficiency.\n* [[Cross-layer optimization]]\n** Cross-layer research is a popular current research topic where information is shared between different communications layers in order to increase the knowledge and current state of the network. This could enable new and more efficient protocols to be developed. A joint protocol which combines various design problems like routing, scheduling, channel assignment etc. can achieve higher performance since it is proven that these problems are strongly co-related.<ref name=\"Pathak\">{{cite journal |first=P. H. |last=Pathak |first2=R. |last2=Dutta |title=A Survey of Network Design Problems and Joint Design Approaches in Wireless Mesh Networks |journal=IEEE Communications Surveys & Tutorials |volume=13 |issue=3 |pages=396–428 |doi=10.1109/SURV.2011.060710.00062 |year=2011 }}</ref> It is important to note that careless cross-layer design could lead to code which is difficult to maintain and extend.<ref name=\"kawadia\">{{cite book |author=V. Kawadia, P. R. Kumar |title=A Cautionary Perspective on Cross-Layer Design in IEEE Wireless Communications |pages=3–11 |date=February 2005}}</ref>\n* Software-defined wireless networking\n** Centralized, distributed, or hybrid? - In <ref>M. Abolhasan, J. Lipman, W. Ni and B. Hagelstein, \"Software-defined wireless networking: centralized, distributed, or hybrid?,\" in IEEE Network, vol. 29, no. 4, pp. 32-38, July–August 2015. doi:10.1109/MNET.2015.7166188 http://ieeexplore.ieee.org/xpl/abstractCitations.jsp?arnumber=7166188</ref> a new SDN architecture for WDNs is explored that eliminates the need for multi-hop flooding of route information and therefore enables WDNs to easily expand. The key idea is to split network control and data forwarding by using two separate frequency bands. The forwarding nodes and the SDN controller exchange link-state information and other network control signaling in one of the bands, while actual data forwarding takes place in the other band.\n* Security\n** A WMN can be seen as a group of nodes (clients or routers) that cooperate to provide connectivity. Such an [[open architecture]], where clients serve as routers to forward data packets, is exposed to many types of attacks that can interrupt the whole network and cause denial of service (DoS) or Distributed Denial of Service (DDoS).<ref>Shaker Alanazi, Kashif Saleem, Jalal Al-Muhtadi, and Abdelouahid Derhab, “Analysis of Denial of Service Impact on Data Routing in Mobile eHealth Wireless Mesh Network,” Mobile Information Systems, vol. 2016, Article ID 4853924, 19 pages, 2016. doi:10.1155/2016/4853924 [https://www.hindawi.com/journals/misy/2016/4853924/abs/]</ref>\n\n==Protocols==\n\n===Routing protocols===\n\nThere are more than 70 competing schemes for routing packets across mesh networks. Some of these include:\n*[[Associativity-Based Routing]] (ABR)<ref name=\"auto\"/> \n*[[Ad hoc On-demand Distance Vector|AODV]] (Ad hoc On-Demand Distance Vector)\n*[[B.A.T.M.A.N.]] (Better Approach To Mobile Adhoc Networking)\n*[[Babel (protocol)]] (a distance-vector routing protocol for IPv6 and IPv4 with fast convergence properties)\n*Dynamic NIx-Vector Routing|DNVR<ref>http://ieeexplore.ieee.org/abstract/document/1424825 (Dynamic NIx-Vector Routing)</ref>\n*[[DSDV]] (Destination-Sequenced Distance-Vector Routing)\n*[[Dynamic Source Routing|DSR]] (Dynamic Source Routing)\n*[[Hazy Sighted Link State Routing Protocol|HSLS]] (Hazy-Sighted Link State)\n*[[Hybrid Wireless Mesh Protocol|HWMP]] (Hybrid Wireless Mesh Protocol, the default mandatory routing protocol of [[IEEE 802.11s]])\n*''Infrastructure Wireless Mesh Protocol'' (IWMP) for Infrastructure Mesh Networks by GRECO UFPB-Brazil<ref name=\"Porto\">{{cite journal|last1=Porto|first1=D. C. F.|last2=Cavalcanti|first2=G.|last3=Elias|first3=G.|title=A Layered Routing Architecture for Infrastructure Wireless Mesh Networks|journal=Fifth International Conference on Networking and Services, 2009. ICNS '09|date=1 April 2009|pages=366–369|doi=10.1109/ICNS.2009.91|url=http://ieeexplore.ieee.org/document/4976787/|accessdate=14 November 2016}}</ref>\n*[[Optimized link state routing protocol|OLSR]] (Optimized Link State Routing protocol)\n*[[Order One Network Protocol|OORP]] (OrderOne Routing Protocol) (OrderOne Networks Routing Protocol)\n*[[Open Shortest Path First|OSPF]] (Open Shortest Path First Routing)\n*Routing Protocol for Low-Power and Lossy Networks (IETF ROLL RPL protocol, {{IETF RFC|6550}})\n*PWRP (Predictive Wireless Routing Protocol)<ref>http://new.abb.com/network-management/communication-networks/wireless-networks/technology/scalability PWRP</ref>\n*[[Temporally-ordered routing algorithm|TORA]] (Temporally-Ordered Routing Algorithm)\n*[[Zone Routing Protocol|ZRP]] (Zone Routing Protocol)\n\nThe [[IEEE]] has developed a set of standards under the title [[IEEE 802.11s|802.11s]].\n\nA less thorough list can be found at [[Ad hoc routing protocol list]].\n\n===Autoconfiguration protocols===\n{{Commons category|Mesh network}}\nStandard autoconfiguration protocols, such as [[DHCP]] or [[IPv6#Stateless address autoconfiguration (SLAAC)|IPv6 stateless autoconfiguration]] may be used over mesh networks.\n\nMesh network specific autoconfiguration protocols include:\n* Ad Hoc Configuration Protocol (AHCP)\n* Proactive Autoconfiguration ([[Proactive Autoconfiguration Protocol]])\n* Dynamic WMN Configuration Protocol (DWCP)\n\n==Communities and providers==\n*[[Anyfi]]\n*[[AWMN]]\n*[[CUWiN]]\n*[[Freifunk]] (DE) / FunkFeuer (AT) / OpenWireless (CH)\n*[[Firechat]]\n*[[Firetide]]\n*[[Guifi.net]]\n*[[Netsukuku]]\n*[[Ninux]] (IT)\n\n==Products==\n*[[Aruba Networks|Aruba]] AirMesh- multiservice wireless mesh networks for outdoors <ref>{{cite web|url=http://www.arubanetworks.com/products/networking/outdoor-mesh/ |title=Multiservices mesh networks for the great outdoors}}</ref>\n*[[Ruckus Wireless|Ruckus]] Mesh - Smart Mesh<ref>{{cite web|url=https://www.ruckuswireless.com/rucktionary/mesh-networking-and-smartmesh |title=Rukus Wireless Smart Mesh Networks}}</ref>\n*[[Cisco]] [[Meraki]] - Mesh networking - access points as gateways and repeaters<ref>{{cite web|url=https://documentation.meraki.com/MR/WiFi_Basics_and_Best_Practices/Mesh_Networking |title=Mesh Networking from Meraki}}</ref>\n*[[Juniper Networks|Juniper]] Wireless Mesh - Wireless mesh and bridging<ref>{{cite web|url=http://www.juniper.net/documentation/en_US/junos-space-apps/network-director2.0/topics/task/configuration/wireless-mesh-creating.html |title=Configuring Wireless Mesh and Bridging}}</ref>\n*[[TP-Link]] - Wireless mesh networking - access points <ref>{{cite web|url=https://www.tp-link.com/us/business-networking/wireless/ceiling-mount-access-points|title=Mesh Networking from TP-Link}}</ref>\n*Others - list of venture backed mesh networking companies.<ref>{{cite web|url=https://www.ventureradar.com/keyword/%20Mesh%20Networks |title=List of venture-backed wireless mesh networks companies}}</ref>\n\n==See also==\n{{div col|colwidth=22em}}\n*[[Mesh networking]]\n*[[Comparison of wireless data standards]]\n*[[IEEE 802.11s]]\n*[[Mobile ad hoc network]]\n*[[Peer-to-peer]]\n*[[Roofnet]]\n*[[Wireless ad hoc network]]\n*[[ZigBee]]\n*[[Bluetooth mesh networking]]\n{{div col end}}\n\n==References==\n{{Reflist|30em}}\n\n==External links==\n* [https://web.archive.org/web/20130811032810/http://airberry.com/downloads/airberry_Whitepaper_EN_02_Wireless_Mesh.pdf Wireless LAN Mesh Whitepaper]\n* {{HowStuffWorks|how-wireless-mesh-networks-work|How Wireless Mesh Networks Work}}\n* [http://www.meshdynamics.com/documents/MDThirdGenerationMesh.pdf First, Second and Third Generation Mesh Architectures] History and evolution of Mesh Networking Architectures\n* [http://www.meshdynamics.com/documents/Mesh_Mining_July08.pdf Miners Give a Nod to Nodes] Article reprint from Mission Critical Magazine on Mesh in underground mining\n* [http://www.iee.org/OnComms/sector/communications/Articles/Object/DE74F2B9-9D80-A065-DA7411A533B3EA5D IET] From hotspots to blankets\n* {{cite journal | first1 = Ian. F. | last1 = Akyildiz | author2 = Xudong Wang | title = A Survey on Wireless Mesh Networks | citeseerx = 10.1.1.133.5446 | journal = IEEE Communications Magazine | volume = 43 | issue = 9 | pages = s23–s30 | date = September 2005 | doi = 10.1109/MCOM.2005.1509968}}\n* [https://web.archive.org/web/20150316140922/http://www.mesh-networks.org/ Mesh Networks Research Group] Projects and tutorials' compilation related to the Wireless Mesh Networks\n* [https://www.linuxfoundation.org/collaborate/workgroups/networking/linux-wireless-subsystem-80211-rami-rosen Linux Wireless Subsystem (80211) by Rami Rosen ]\n* [http://www.iwtwireless.com/mining/communications-tracking/overview IWT Wireless Communications and Tracking in Underground Mines]\n\n<!-- see \"Research topics\" section -->\n\n[[Category:Wireless networking|Mesh]]\n[[Category:Open problems]]\n[[Category:Radio technology]]\n[[Category:Mesh networking]]\n\n[[da:Selvkonfigurerende radionet]]\n[[de:Ad-hoc-Netz]]",
            "slug": "wireless-mesh-network",
            "date_updated": 1535680729372,
            "imported": "https://en.wikipedia.org/wiki/Wireless_mesh_network"
        }
    ]
}