{
	"next_comment_id": 182,
	"user_name": "Kaffie",
	"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
	"post_like": {
		"1CR3B1Bwx6umZqL7H6hrbyPdXKJR7j8Mfn_1483209435": 1483230641,
		"18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y_1490285129": 1490327596,
		"15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1490917894": 1490920145,
		"15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1491614163": 1491653650,
		"15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1491775670": 1491815079,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1494119123": 1494165248,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1495631246": 1495687277,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1496639545": 1496829105,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1498886961": 1499124223,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1500038671": 1500079693,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1500363955": 1500375500,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1500167922": 1500375531,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1500362338": 1500377027,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1500394391": 1500415154,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1500420663": 1500427520,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1500515306": 1500518672,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1500778017": 1500946516,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1501115753": 1501118180,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1501433679": 1501588407,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1501941144": 1502159342,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1502162545": 1502447679,
		"1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1503009697": 1503028853,
		"1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1512943708": 1512981342,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1513853183": 1513884080,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1513909756": 1513932049,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1515213401": 1515227768,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1515272285": 1515301718,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1515564134": 1515567994,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1516582571": 1516601483,
		"16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1516702373": 1516708339,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1516845142": 1516861110,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1517124330": 1517211765,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1517979848": 1517986791,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1518233777": 1518257103,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1519646718": 1519646639,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1519802922": 1519875090,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1529726353": 1530881525,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535294971": 1535479669,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535426667": 1535479961,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535338264": 1535516141,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535772774": 1535774752,
		"1NVpW6BGgWn3oPYAjvsVjyHoBqApQpsJaP_1535688819": 1535777384,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535792525": 1535809076,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535910692": 1535945697,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1536267912": 1536283991,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1536375856": 1536456306,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1536350869": 1536456596,
		"1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1538254175": 1538274622,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1547588122": 1548032091,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548419456": 1548472902,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548527983": 1548592502,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548657813": 1548663874,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548977213": 1549005445,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1549033752": 1549101655,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1549590231": 1549595192,
		"1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1549673135": 1549674595,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550141105": 1550163183,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550098740": 1550163578,
		"1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi_1550184890": 1550208171,
		"1PXuHJpV6j4R9cfD9uHjKwoUtvFN3z3cd7_1550417166": 1550452983,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550536184": 1550540269,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1551030317": 1551062732,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1551844078": 1551935012,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553689532": 1553734930,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553737868": 1553736508,
		"1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1557289846": 1557295149,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1558237601": 1558259651,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1564366338": 1564408167,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1565144359": 1565168041,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1566785166": 1566812003,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1582516714": 1582531834,
		"18UukzxVzEwd9ugyvKWYe2vud77GyL72Px_1599165161": 1599484368,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1601955018": 1601987235,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1624085006": 1624162110,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1624524714": 1624609000,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1625206345": 1625271915,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1625870222": 1625885626,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1626480293": 1626475279,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1628762378": 1628750811,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1629194825": 1629184033,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1629588103": 1629631528,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1630353043": 1630477117,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1630749218": 1630742366,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1631232111": 1631234298,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1632732570": 1633146657
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "I leave it running, but my laptop isn't always on. There's been a few times where I killed it for whatever reason (to save internet bandwidth, reduce ram usage, etc). But 9 times out of 10, if I'm on my laptop, zeronet is running.",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1483466772",
			"date_added": 1483511033
		},
		{
			"comment_id": 2,
			"body": "I'm an anarchist.",
			"post_uri": "1PyJKf7erAPW5akUQsMSxQxRzkZNWZreFw_1485297633",
			"date_added": 1485329147
		},
		{
			"comment_id": 3,
			"body": "@Jjg: ZeroNet is pretty appealing to anarchists. That's probably why.",
			"post_uri": "1PyJKf7erAPW5akUQsMSxQxRzkZNWZreFw_1485297633",
			"date_added": 1485516029
		},
		{
			"comment_id": 4,
			"body": "As mentioned, [KaffieID](/id.kaffie.bit) was built for this purpose. Just clone and follow the instructions. The way ID providing works in ZeroNet is that if you want unique usernames, you need a backend, which ZeroNet does not provide. Nanasi solved this problem by just not having unique names, and relied on the user's unique ID to distinguish. This is also how ZeroNet determines users (not by username). So KaffieID was a solution to both. You can freely choose your name (non-unique) and works off Nanasi's decentralized/anonymous system.\n\nThe code is also very simple in case you want to customize it or remix it however you'd like.",
			"post_uri": "127xneP1vvFJyc6SQZNzh2hyrkBuezpcvr_1489334065",
			"date_added": 1489370950
		},
		{
			"comment_id": 5,
			"body": "@Jro: What we need is a way for ZeroNet sites to just accept *every* ID provider. A blacklist instead of a whitelist. Right now you have to manually approve every provider for your site. It should be the other way around.",
			"post_uri": "127xneP1vvFJyc6SQZNzh2hyrkBuezpcvr_1489334065",
			"date_added": 1489371029
		},
		{
			"comment_id": 6,
			"body": "You can't. You need a back-end server for a proxy, which ZeroNet does not provide. Some similar things you can do to get the same 'feel' would be something like just use an iframe to bring up an external website in a zeronet address/zite, this still accesses clearnet on the user's device, and doesn't work as a proxy. There's also the option of just mirroring sites. Take a page, rip it, and upload a static version. This will give the site the benefits of ZeroNet, but given that it's not the actual clearnet site, will lack continuous updates or user-interaction.\n\nLastly, if you're the owner of the clearnet site, you can simply port the site. Have your CMS upload to both the zeronet site, as well as the clearnet site. I can't think of how to fix comments and such, but perhaps you can have a bot sync them? Or just have ZN comments for the ZN site, and clearnet comments for the clearnet site?\n\nIf you want something like Facebook, you'll just have to remake it from the ground up for ZeroNet. For something like google.... it's impossible to put on ZeroNet, given how much back-end server requirements there are, and how much HDD it takes up. One way to do this would be to have your own private back end *anyway*, and just call to it from the ZN site. One ZN search engine did this, and a few early ZN sites did this method as well, but it was poorly received, as people like to sandbox their experience, and not let *any* data escape out into the clearnet and sometimes even just block it on a browser or OS level.",
			"post_uri": "12WBFnwNrtKtQD67GudLfZhwTPwehE2Cw9_1489579724",
			"date_added": 1489622973
		},
		{
			"comment_id": 7,
			"body": "Yeah, it's basically a decentralized twitter clone.",
			"post_uri": "17wvV3ETVFUjZex3NDRTsbwYtz8xPNUUsa_1489920598",
			"date_added": 1489982719
		},
		{
			"comment_id": 8,
			"body": "KaffieID (as linked earlier) is freely cloneable and entirely P2P. However, like all alternative ID/cert systems, it requires each site to accept it. So as it stands, only KaffieHub accepts KaffieIDs, meaning that you'd be locked out from commenting on other hubs.\n\nThis is an ongoing problem with ZeroNet that enforces monopolization of the ID service. But if you mean to just have an ID you can use for your own sites that's not ZeroID-based, then KaffieID (or clones) works fine.\n\n@Rythyrix: has a good explanation of why it's an issue. We really need a way to accept all ID providers, and move over to a blacklist rather than a whitelist.",
			"post_uri": "1Ea3RG4YuLnifynBxvuWAA3Y2nLcTWfrjQ_1490400723",
			"date_added": 1490408612
		},
		{
			"comment_id": 9,
			"body": "@Rythyrix: Perhaps. Right now we have to blacklist users anyway. And so far there has only been a couple that I've actually had to ban. As it stands, banning userID systems isn't something that needs to be done.",
			"post_uri": "1Ea3RG4YuLnifynBxvuWAA3Y2nLcTWfrjQ_1490400723",
			"date_added": 1490409813
		},
		{
			"comment_id": 10,
			"body": "It doesn't work because several of those videos are just magnet links to non-webtorrent torrents. You need a peer capable of webrtc in order to benefit. AFAIK there's no index of popular webtorrents to stream/download.\n\nThe one you directly copy+pasted from KopyKate fails to work because of an issue with webseeding. You need to load the torrent from the direct .torrent file hosted on the server in order to benefit from a webseed on that same server. Otherwise you'll only get the peers of something.\n\nHopefully that helps solve your issues :3",
			"post_uri": "1L8waPPVatA855bU6SjqWs2K1DbwnUZbEp_1490686850",
			"date_added": 1490691442
		},
		{
			"comment_id": 11,
			"body": "@GhostWriter: Yeah, that's generally how it works. You need the mp4 and torrent file on the same server, like how KopyKate's webseeded stuff works. Dropbox used to be able to do this, but no more.",
			"post_uri": "1L8waPPVatA855bU6SjqWs2K1DbwnUZbEp_1490686850",
			"date_added": 1490699394
		},
		{
			"comment_id": 12,
			"body": "@GhostWriter: Well even regular torrents have webseeds. It's just that with normal torrents, there's a lot more people, so people are more eager to leave their computer seeding. With webtorrent that's not really the case. People don't use it like a torrent and instead use it like youtube. Pretty much *every* p2p video sharing service at the moment suffers this same problem. They require a dedicated host in order to prevent the torrent from running out of seeders.",
			"post_uri": "1L8waPPVatA855bU6SjqWs2K1DbwnUZbEp_1490686850",
			"date_added": 1490727676
		},
		{
			"comment_id": 13,
			"body": "I'm an anarchist in California. I haven't really done any active protests or anything though. Unfortunately I'm not quite in the position to do much IRL.",
			"post_uri": "1DvzV85GE9oz9YyT7ZsLCA52tWAqD4kkDN_1490837917",
			"date_added": 1490843979
		},
		{
			"comment_id": 14,
			"body": "Lol. That's kinda sad, but also hilarious. Why can't people just be rational and support a good thing when they see it?",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1490918993",
			"date_added": 1490919214
		},
		{
			"comment_id": 15,
			"body": "The big issue with video sharing/streaming right now is figuring out decentralized storage. It's the big issue in P2P stuff right now, and there's quite a few different solutions being worked on. Nothing really works well yet because of bandwidth and hard drive limits. As well as the inability for users to keep 24/7 up-time. Webtorrent can get around this with webseeds, which is what is currently being done. And ZeroMux just does it the same way ZeroNet does, but that can end up taking up a lot of space on viewers' computers.",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1490908393",
			"date_added": 1490920454
		},
		{
			"comment_id": 16,
			"body": "Just edit data.txt. The format is: `name[tags, separated, by, commas:address rank`. Just refer to the data.txt in Kaffiene's files for a reference. See [here.](/kaffiene.bit/data.txt)",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1491016627",
			"date_added": 1491119641
		},
		{
			"comment_id": 17,
			"body": "Thanks?",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1491125400",
			"date_added": 1491133872
		},
		{
			"comment_id": 18,
			"body": "@Plasmmer: I'll look into it. I'm not sure how easy that'll be to do. My initial thought was just to scrape the page, but then I remembered that that won't work. An iframe maybe, but then cleanup might be difficult. Alternatively I could try to query the sql database manually. Something like how sqeek does. Either way, dev for Kaffiene is really slow going at the moment. But I think this might be a way to add a bit more usage to it while I'm being slow with the index, haha.",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1491016627",
			"date_added": 1491134361
		},
		{
			"comment_id": 19,
			"body": "@Plasmmer: No github just yet. And yes, I understand a reworked database would be nice. As I mentioned, my dev work has kinda grinded to a halt and I'm not sure when I'll be able to resume. I have some personal issues and I'm not sure how long it'll take me to work through them. Sorry >_<",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1491016627",
			"date_added": 1491301335
		},
		{
			"comment_id": 20,
			"body": "Yeah, it's pretty clear a lot of the hate is just projection. Look at all the anti-gay republicans who end up being gay.\n\nBut please, don't accuse people of being a rapist or child molester if there's no actual proof they've done anything. Random blind accusations not only wreck lives, but weaken the word of *actual* victims. I can't speak for the people who've mentioned in your life, but AFAIK people like Milo and Trump *technically* haven't done anything wrong, despite being despicable people (well Trump maybe).\n\n>I'm a transwoman\n\nNice. We've got quite a bit of LGBT folk on here, but do be aware there *are* transphobes here. My network of sites will *always* be transphobe free, and I'll ban anyone who attempts it. Can't really say the same for other sites/people though.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1491367755",
			"date_added": 1491396161
		},
		{
			"comment_id": 21,
			"body": "Lol. This isn't happening. Sorry. I'd love to see it, but even top of the line translation services like google translate still have issues. No way is a lazy unemployed girl working on a new platform using only javascript is going to manage to make something even remotely usable.",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1491444511",
			"date_added": 1491446384
		},
		{
			"comment_id": 22,
			"body": "Lazy, mostly. I hardly ever check it, and when I do I just put off responding. Sorry. I'm kinda shitty like that.",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1491614121",
			"date_added": 1491632482
		},
		{
			"comment_id": 23,
			"body": "@Plasmmer: I believe I answered that one already ;). Like the previous answer, mostly it's just because I haven't gotten around to it. I really don't have an answer besides that. That's literally the entire reason you haven't seen much of my development lately. I'd rather not go into the personal details of my life, but I've got some issues I need to work through before I can resume ZN development.\n\nAny sort of dev question almost certainly has the same answer; to save you some time. I haven't done much dev work in general, off and on ZN. And likely before that I need to get my actual income and living situations fixed.\n\nGithub is honestly on the to-do, but not for a while. The original plan was to get Kaffiene more or less automated and then move the code to github. But neither has happened yet.",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1491614121",
			"date_added": 1491653637
		},
		{
			"comment_id": 24,
			"body": "Pretty much? Ever since the developer changed the site to try and detect peers and then not list unseeded videos, it's basically been unusable for me. It just gets stuck at the homepage trying to load videos. [KopyKate](/kopykate.bit) is much better and is likely what you're looking for.",
			"post_uri": "1165u6pt5mQNFjyhMVwy6azB7bZuQGLA9b_1491654783",
			"date_added": 1491697113
		},
		{
			"comment_id": 25,
			"body": "Pretty cool site but file uploads seem to be really broken.\nEdit: content signing error or something.",
			"post_uri": "14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy_1491940364",
			"date_added": 1491970260
		},
		{
			"comment_id": 26,
			"body": "@Glightstar: Yeah it's been working great. Firefox seems to lag though, so I've been using chrome with it and it works fine.",
			"post_uri": "14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy_1491940364",
			"date_added": 1492071896
		},
		{
			"comment_id": 27,
			"body": "How does ZeroMail do it? You can certainly see your sent messages there.",
			"post_uri": "14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy_1492183929",
			"date_added": 1492224123
		},
		{
			"comment_id": 28,
			"body": "@Thegillies: No one's here because it's new, and the users who *were* here have all kind of left because nothing was happening and it was pretty dead. We have a small community of people but we're all kinda lazy or busy. We really just need an influx of people who stick around. And for that we need a killer app that you don't really find elsewhere. No one will come for ZeroMe when they can just use twitter or facebook. But we *need* an active ZeroMe if we want people to stick around on zeronet.",
			"post_uri": "1NTgaYjK2bh1axvruth8HqtGt6Pw5ab13x_1493000410",
			"date_added": 1493018231
		},
		{
			"comment_id": 29,
			"body": "@Thegillies: Yeah all the stuff here is pretty solid. The problem is users and content. Users don't come if there's a lack of content, and without users content isn't posted. Chicken and egg problem. A killer app of some sort that's unique to zeronet will get people to use the platform, and hopefully adopt the network of sites in general.",
			"post_uri": "1NTgaYjK2bh1axvruth8HqtGt6Pw5ab13x_1493000410",
			"date_added": 1493018644
		},
		{
			"comment_id": 30,
			"body": "Haha, it's a very new feature. No live updates yet. I wanted to, but I can't figure out how to access the merged db from javascript.",
			"post_uri": "1QEfmMwKVxgR4rkREbdJYjgUmF3Zy8pwHt_1493481909",
			"date_added": 1493510592
		},
		{
			"comment_id": 31,
			"body": "~~One of the two problems bitcoin has is now solved. Grats. Now just do something about the ridiculously large blockchain.~~\n\n>We want to be clear that this is an example of how fast it can be to get through the checkout process within the application, not the time it takes the transaction to clear on Bitcoin. That will still be dependent on the bitcoin network itself.\n\nSo.... still broken. Hype extinguished.",
			"post_uri": "1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1498886961",
			"date_added": 1499124256
		},
		{
			"comment_id": 32,
			"body": "@Elspru: Yeah. I don't mean to hate on bitcoin. It's pretty revolutionary. It just has some big problems.",
			"post_uri": "1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1498886961",
			"date_added": 1499134347
		},
		{
			"comment_id": 33,
			"body": "@Styromaniac: Are those a real issue though? I mean theoretically sure, but certainly all that needs to be done is to fix how people mine, right? Problems, but not on the user's end.",
			"post_uri": "1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1498886961",
			"date_added": 1499142472
		},
		{
			"comment_id": 34,
			"body": "@Styromaniac: If you're gonna hold my views in high regard *do* be aware I'm politically biased against ownership/currency/economics to begin with. I personally think bitcoin is pretty revolutionary for what it does, which is why I try to avoid shitting on it (even if it *does* have it's problems). The rest of the lot, the whole blockchain fad, etc. haven't convinced me yet. I see a lot of scams, lots of people running on hype without clearly thinking what they're doing, etc. Which is literally the exact opposite of why bitcoin is so interesting in the first place.\n\nBitcoin is good at what it does: decentralizing currency and creating a decentralized verification of ownership of tokens. This means it works great for things like money, domain names, etc. Not so great for other stuff.\n\nIn my ideal world, cryptocurrency wouldn't exist. But I at least try to give it a fair shot.",
			"post_uri": "1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1498886961",
			"date_added": 1499207019
		},
		{
			"comment_id": 35,
			"body": "Openbazaar is pretty legit tho",
			"post_uri": "1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1498886961",
			"date_added": 1499207234
		},
		{
			"comment_id": 36,
			"body": "How are you keeping track of who uses it? That's kind of concerning.",
			"post_uri": "1EbCmWB1LcB6NdJhRBhu6krKCs3gZhePzp_1500098749",
			"date_added": 1500101989
		},
		{
			"comment_id": 37,
			"body": "@Peeper: Ah, thanks for the clarification. Just keep in mind you might not be connected with every peer who has the site.",
			"post_uri": "1EbCmWB1LcB6NdJhRBhu6krKCs3gZhePzp_1500098749",
			"date_added": 1500104137
		},
		{
			"comment_id": 38,
			"body": "@Peeper: Not only that. Even if they're seeding/sharing, and have the site. You as an individual may not be peered with them. Check the proxies to see. For me I usually have a few hundred peers show on my downloaded sites. However proxies reveal thousands.",
			"post_uri": "1EbCmWB1LcB6NdJhRBhu6krKCs3gZhePzp_1500098749",
			"date_added": 1500109540
		},
		{
			"comment_id": 39,
			"body": "@Peeper: No. No one can show 'the real peer number'. The peer count is *only* how many peers you're connected to. Not how many exist.",
			"post_uri": "1EbCmWB1LcB6NdJhRBhu6krKCs3gZhePzp_1500098749",
			"date_added": 1500158724
		},
		{
			"comment_id": 40,
			"body": "@Peeper: \n@Nofish: \nI'm unhappy due to merger sites not being feature-complete. It's a great system, and I don't mind it at all. But for regular cross-site content (rather than a specifically created data-store), it doesn't work at all. And now with the CORS 'fix', there's no way to fetch content from other sites. It's a shame, because automatically grabbing and embedding content from other sites is a huge part of what made the web successful. It's such a shame to not have any way to do it in ZeroNet.\n\nAs I wrote elsewhere, I think the proper fix would be to have a cross-site fileget that requires permission from the user. That way no trickery is going on, no way to maliciously use other sites, and ultimately you just fetch the content you need.\n\nIt's not *cors* that people are upset about. It's that functionality has been killed, making zeronet objectively worse.",
			"post_uri": "1EbCmWB1LcB6NdJhRBhu6krKCs3gZhePzp_1500060035",
			"date_added": 1500246887
		},
		{
			"comment_id": 41,
			"body": "@Nofish: Awesome :). It's just a bit frustrating to wake up and see all your sites broken haha. Glad to see you're open to it at least. Just give some way of getting raw file access from requested sites. As it stands, if we control the site, we can just throw a merger permission on it and be good to go. However, for sites without, it's a poor solution (see: fetching zerowiki entries).",
			"post_uri": "1EbCmWB1LcB6NdJhRBhu6krKCs3gZhePzp_1500060035",
			"date_added": 1500280097
		},
		{
			"comment_id": 42,
			"body": "@Binchan: That doesn't sound so great if you change up the site haha.\n\n@Glightstar: Because that's the only time you'd ever use it. To update your own site to the latest version of whatever it was cloned from.",
			"post_uri": "14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy_1500303841",
			"date_added": 1500332774
		},
		{
			"comment_id": 43,
			"body": "I think so. We just need more users :)",
			"post_uri": "1d6oFadKcBXxEZHvmvAiZCoyrBeAmmLdi_1500319184",
			"date_added": 1500332807
		},
		{
			"comment_id": 44,
			"body": "There's an active community here. Please stick around and help contribute. It's a great little corner of the internet.",
			"post_uri": "1d6oFadKcBXxEZHvmvAiZCoyrBeAmmLdi_1500319293",
			"date_added": 1500332840
		},
		{
			"comment_id": 45,
			"body": "To clone KaffieID, just click 'clone', and follow the instructions in the comments. It just has you uncomment a line to generate a key, and then put the key into the proper place on the document. Easy. Be sure to re-comment the generator again after you're done.\n\nZeroID: you need to clone the site, have a backend server where you host the server script, need to generate new keys/site, changeup the code to point to your own server, etc. Kinda difficult, and not very zeronet-friendly.\n\nThe big difference is how the two handle usernames. KaffieID, due to having the private signer key public, does not guarantee unique names (multiple auth_addresses can share the same name@kaffie.bit). ZeroID does it's uniqueness checking on the backend server, guaranteeing names are unique. It also hides it's private key, and relies on the server. Meaning that if that server ever goes down (much like the one for ZeroVerse IDs did), then you can no longer register ZeroIDs. However, KaffieIDs can be registered, even while offline due to it all being local.\n\nThe big appeal, though, of ZeroID is that it's the 'official' cert signer, and thus the go-to for any site that wants to add user interaction. People rarely add KaffieID, ZeroVerseIDs, etc. And, from what I've seen, there's no way to change permissions to accept *any* signer. I've been constantly talking about it, and hopefully @nofish: will change how cert signer lookups are handled (to being given by the cert, rather than given by the site). That way we can have an 'accept all signers' feature, that matches the API which already has the option.\n\nRight now there's not much appeal to a third signer. No way to use it on existing sites, no userbase, no new features/design, etc. Even KaffieID struggles, due to lacking support in official zeronet sites, and other sites that may not be aware of it's existence.\n\nHopefully that covers everything. If not, feel free to ask more questions :)",
			"post_uri": "1EbCmWB1LcB6NdJhRBhu6krKCs3gZhePzp_1500334371",
			"date_added": 1500337667
		},
		{
			"comment_id": 46,
			"body": "@Peeper: You can find all the code for ZeroID [here.](https://github.com/HelloZeroNet/ZeroID) As well as the scripts for running the signer through bitmessage or regular http. You can arguably do any way you want to sign certs. Even do them by hand if you want. Personally, I'm fond of the 'only zeronet' solutions like kaffieid, since it doesn't rely on any external servers, and people know exactly what's going on.\n\nKeep in mind, the username on the cert *DOES NOT* dictate anything in terms of functionality. It's *only* a display name. On the backend of things, all users are identified through their auth_address, which is always unique.",
			"post_uri": "1EbCmWB1LcB6NdJhRBhu6krKCs3gZhePzp_1500334371",
			"date_added": 1500345019
		},
		{
			"comment_id": 47,
			"body": "@Peeper: \"Then, site creators should simply add a function to associate the username with the auth_address.\"\n\nThat's what ZeroID does. You can't do this without a backend server or a blockchain.\n\n\"But blockchain is better to solve it.\"\n\nIt's decentralized, but also not free. Whether it's 'better' is subjective. Personally, I don't see the need for unique names, given everything works fine without it. Domain names can be nice though. But usernames? Why not just let people share a name?\n\n\"Then I'll clone KaffieID, that doesn't relies in a centralized server.\"\n\nThat's why I prefer KaffieID. It doesn't rely on any servers or blockchains, you can register one completely offline, etc.\n\n\"Soon Peeper will accept only CryptoID signups, and unique names/respectable users will have a verified badge. \"\n\nYou cannot do this as long as Peeper relies on hubs outside of your control for data. The permissions check is on the hub, which is why KaffieID struggles on ZeroMe. Some hubs accept it and some don't. Which is different from ZeroID which basically every hub accepts. CryptoID would be accepted nowhere, and thus you'd need your own hub. At which point you're basically an isolated social network.\n\n\"I don't want users of ZeroID needing to signup in another provider just for use Peeper, its a \"marketing\" error.\"\n\nPersonally I could see peeper splitting off and using it's own type of hubs, and have the initial ones and cloneable ones only accept cryptoID. But you'd need something to really stand apart from ZeroMe.",
			"post_uri": "1EbCmWB1LcB6NdJhRBhu6krKCs3gZhePzp_1500334371",
			"date_added": 1500375124
		},
		{
			"comment_id": 48,
			"body": "@Glightstar: That's probably it. When you create a site using the button on ZeroHello, it's \"cloned from\" zerohello. That 'upgrade code' button will just fetch from whatever is listed as the cloned site. Not necessarily what you cloned it from (if anything).",
			"post_uri": "14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy_1500303841",
			"date_added": 1500375208
		},
		{
			"comment_id": 49,
			"body": "I hate the politics around it. Too much ignorance and hate. But trans/cis are good terms to help describe things.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1500394391",
			"date_added": 1500415210
		},
		{
			"comment_id": 50,
			"body": "@Spawn: I'm getting the same thing. The user linked doesn't exist on the hub.",
			"post_uri": "1EbCmWB1LcB6NdJhRBhu6krKCs3gZhePzp_1500373062",
			"date_added": 1500415496
		},
		{
			"comment_id": 51,
			"body": "I can see data from users just fine on the hub. Just not the one you linked to. You need to properly sign/publish your new account's content.json.",
			"post_uri": "1EbCmWB1LcB6NdJhRBhu6krKCs3gZhePzp_1500403614",
			"date_added": 1500427483
		},
		{
			"comment_id": 52,
			"body": "@Spawn: There is no difference between KaffieID and the various 'anonymous' IDs from other services. They all originate and stem from the original code provided by [Nanasi.](http://127.0.0.1:43110/16KzwuSAjFnivNimSHuRdPrYd1pNPhuHqN) I think the only difference is that KaffieID lets you choose your username, while the other services provide a random one.\n\nIn general, there's not really any difference between cert providers. There's only a difference between ZeroID and KaffieID due to the private key being stored on a backend private server vs being hosted directly on ZeroNet. Any new provider will almost certainly copy one of these two models.",
			"post_uri": "1EbCmWB1LcB6NdJhRBhu6krKCs3gZhePzp_1500334371",
			"date_added": 1500464765
		},
		{
			"comment_id": 53,
			"body": "Is there a different ZeroMe Reloaded? This one is clearly made by @Mkg20001: http://127.0.0.1:43110/Me.Mkg20001.bit/\n\n@Plasmmer no offense, but i haven't really seen anything new in Peeper. Drop shadows? A rebranding? I saw some sort of badge feature, but investigation reveals it's just donations.\n\nI'm not hating on peeper (the opposite, I think it's important to have multiple variations of a site). But it honestly sounds like you're taking credit for work you didn't do.",
			"post_uri": "1EbCmWB1LcB6NdJhRBhu6krKCs3gZhePzp_1499545092",
			"date_added": 1500503422
		},
		{
			"comment_id": 54,
			"body": "Top python project, android version is easily installable, mobile sites started appearing, cross-site file requests have become official, user settings can be saved in users.json. Getting hyped.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1500515306",
			"date_added": 1500518719
		},
		{
			"comment_id": 55,
			"body": "How do ports for cellular data even work? That whole side of things is kinda a mystery to me.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1500612071",
			"date_added": 1500613755
		},
		{
			"comment_id": 56,
			"body": "Wait... wasn't that already a thing?",
			"post_uri": "14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy_1500743194",
			"date_added": 1500806505
		},
		{
			"comment_id": 57,
			"body": "Those things are definitely real. They just aren't nearly as widespread.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1501001739",
			"date_added": 1501031630
		},
		{
			"comment_id": 58,
			"body": "@Styromaniac: Yeah, I've experienced all of the listed in some form or another. Kinda shitty regardless of which way it goes.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1501001739",
			"date_added": 1501032609
		},
		{
			"comment_id": 59,
			"body": "Spam? Could you link some examples please? I find it's rare to find actual spam. Mostly just chinese users, and maybe some irrelevant adverts.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1501115753",
			"date_added": 1501118167
		},
		{
			"comment_id": 60,
			"body": ">Thunderwave in the newsfeed\nThat's.... actually kinda smart. I don't know why I didn't think of that.",
			"post_uri": "14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy_1501167032",
			"date_added": 1501196662
		},
		{
			"comment_id": 61,
			"body": "@Musickiller: you can just clone the whole repo (including the wiki) with: `git clone https://github.com/AnarchoTechNYC/meta.git` or you can just clone the wiki itself using `git clone https://github.com/AnarchoTechNYC/meta.wiki.git`. Both are fairly small (though the general repo has large video and images included) and it's all just simple md files. Though the images on *that* particular page are hosted elsewhere, so obviously the cloned repo would lack them (not a huge loss though since it's not relied upon).",
			"post_uri": "1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1502162545",
			"date_added": 1502447644
		},
		{
			"comment_id": 62,
			"body": "@ZAlex: Say what you want but Discord is pretty legit. Probably the only not-shit proprietary software tbh. It kills me that it's all closed off. Best chat app in a long time.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1502500549",
			"date_added": 1502532518
		},
		{
			"comment_id": 63,
			"body": "@ZAlex: \"despises\". Looks like just a comment to me. You can easily write off something for being proprietary, yet still use proprietary software. It's the proper attitude to have when you want to move towards a better way of living. That doesn't mean you have to completely trash all your habits/communities/etc. just for the sake of ideology.\n\nThe way I see it is, yeah, I use discord which is proprietary. But that doesn't mean I'm about to go hop on skype because of some perceived benefit.\n\nPersonally, I'd love to see discord go open source and free. It's great software with a great dev team.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1502500549",
			"date_added": 1502546155
		},
		{
			"comment_id": 64,
			"body": "@ZAlex: Again, where's the outrage?",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1502500549",
			"date_added": 1502546592
		},
		{
			"comment_id": 65,
			"body": "Girl but not cute reporting in. Not sure why you're hitting up ZN for girls tho. People into tech and decentralized software aren't attractive. That's just how it goes. We're nerds.",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1504055505",
			"date_added": 1504267869
		},
		{
			"comment_id": 66,
			"body": "@weakish: Is nerdy moe tho? IRL? In anime girls sure.\n\n@Nekololi: Good luck. Seems like there's very few girls here. I know maybe 3 or 4.",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1504055505",
			"date_added": 1504318726
		},
		{
			"comment_id": 67,
			"body": "@Nekololi: Jokes on you, I'm already in a relationship *despite* how unattractive I am :P",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1504055505",
			"date_added": 1504321199
		},
		{
			"comment_id": 68,
			"body": "@Nekololi: I think it's really possible for anyone to find love. But you gotta set your standards lower. I felt the same way that you do for a long time.",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1504055505",
			"date_added": 1504321719
		},
		{
			"comment_id": 69,
			"body": "News sites and the ability to run on a meshnet (say over cjdns). Perhaps a better private messaging system than zeromail. Once those happen, there's no real reason to say on the clearweb/internet except for the amount of users.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1513853183",
			"date_added": 1513884062
		},
		{
			"comment_id": 70,
			"body": "@Glightstar: That's pretty awesome, actually. It's come a lot farther than from what I remember. How does creating groups work? Are they entirely private? Who exactly can see the messages?",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1513853183",
			"date_added": 1513923446
		},
		{
			"comment_id": 71,
			"body": "Honestly? That's my favorite thing about the P2P community. Nowhere else do I see people having the 'hacker' mindset of just setting out to build what they think is needed/wanted. It's a great little community to be a part of. 😄",
			"post_uri": "1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1515213401",
			"date_added": 1515227843
		},
		{
			"comment_id": 72,
			"body": "I support the Millchan admin running the site however they want, but hosting CP means insta delete+blacklist for me. I'll support from afar, thanks.",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1515376080",
			"date_added": 1515407279
		},
		{
			"comment_id": 73,
			"body": "Beautiful site. Works perfectly. Just need album art, being able to actually sort music by genre, etc.",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1515489900",
			"date_added": 1515552804
		},
		{
			"comment_id": 74,
			"body": "From what I saw it mostly just looked like porn.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1516582571",
			"date_added": 1516601501
		},
		{
			"comment_id": 75,
			"body": "Cloned front-end? If so I just ask for an option to disable the \"unknown template\" boxes that flood the pages, so that it's actually clean and readable.",
			"post_uri": "1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1517668656",
			"date_added": 1517806725
		},
		{
			"comment_id": 76,
			"body": "@Binchan: Doesn't seem to work. I'm on the latest firefox nightly with the latest version of stylus.",
			"post_uri": "1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1517668656",
			"date_added": 1517895313
		},
		{
			"comment_id": 77,
			"body": "@Binchan: So the solution is to just stop using firefox? :\\ seems like a shit solution.",
			"post_uri": "1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1517668656",
			"date_added": 1517905267
		},
		{
			"comment_id": 78,
			"body": "@Polar: \n@Binchan: Eh, I'll just wait I guess.",
			"post_uri": "1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1517668656",
			"date_added": 1517917854
		},
		{
			"comment_id": 79,
			"body": "I'm pretty sure most people are just used to my snail pace of a development speed. I'm probably the laziest dev ever lmao @.@",
			"post_uri": "1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1517979848",
			"date_added": 1517986817
		},
		{
			"comment_id": 80,
			"body": ">blockchain blockchain blockchain blockchain blockchain blockchain blockchain\n\nThere, now y'all don't have to bother with the article. No one wants to pay to do the same things they're already doing. blockchains are trash, sorry not sorry. They're slow, clunky, inefficient, and just make things overall worse.\n\nAll of the actual practical stuff people want (social media, video/music streaming/sharing, filesharing, etc) is already available in a decentralized/distributed manner here on ZeroNet, entirely for free. Why bother with a blockchain?",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535378076",
			"date_added": 1535479473
		},
		{
			"comment_id": 81,
			"body": "@Daniell Mesquita: Could you provide a real world use that shouldn't just be abolished entirely, and can't be done better with some other method? Literally the only \"real\" application I can think of is restrictive access to tokens, which is something that should be abolished, not supported.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535378076",
			"date_added": 1535516002
		},
		{
			"comment_id": 82,
			"body": "Kaffiene had a default black/white design, but I was provided with a more colorful/clean google-style design. Once I start working on it again I'll probably end up giving it a good make-over in terms of look.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535502786",
			"date_added": 1535516092
		},
		{
			"comment_id": 83,
			"body": "@Styromaniac: \n@Daniell Mesquita: \nIs DHT actually required? We have peer and tracker exchange already. We have bootstrapping nodes. cjdns works with any IPv6 software. So certainly all that's needed is to add IPv6 support to ZN, and then bootstrap some nodes? On ZN's side it will do as it does, using the cjdns IPv6 addresses as it normally would. And then cjdns handles the routing.\n\nDHT was part of the original suggestion as a way of ensuring peers/content were able to be found even without an ipv6 tracker. But is it even required now? \n\n1. Add IPv6 support to ZN.\n2. Launch cjdns.\n3. Launch ZN as a bootstrap node.\n4. Have other ZN clients launch after cjdns on other machines, and connect to the boostrap node.\n5. Success!\n\nWould this not work?",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535338264",
			"date_added": 1535516375
		},
		{
			"comment_id": 84,
			"body": "@Daniell Mesquita: I don't know much about setting up networks like that. I imagine you could make the captive portal be pointed towards a ZN multiuser instance. No idea how to do that though.\n\n@Geekless: Tor still relies on having a normal internet connection. The point of going onto cjdns would be to remove any reliance of centralized authorities (no ip allocation, no dns, no need for centralized routing or isps)",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535338264",
			"date_added": 1535527073
		},
		{
			"comment_id": 85,
			"body": "@Daniell Mesquita: Sounds neat. So basically like a blockchain but without the tokens/currencies? I still don't see what real need there is for an indefinitely growing static block of information that gets more unwieldy as time goes on though. What can merkle trees do that we can't do without?",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535378076",
			"date_added": 1535527170
		},
		{
			"comment_id": 86,
			"body": "@Daniell Mesquita: As I said, I don't know shit about setting up a captive portal, but if it's like making a lan-accessible site, then ZN should absolutely work. Just need to either have a download for ZN (so the user can run it themselves), or have the page itself be a multi-user version of ZN (something you can set while launching it).",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535338264",
			"date_added": 1535601231
		},
		{
			"comment_id": 87,
			"body": "@Daniell Mesquita: Right. Which is why I figure having a captive portal and then provide a download would be best.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535338264",
			"date_added": 1535681079
		},
		{
			"comment_id": 88,
			"body": "We need a good news site that isn't just a proxy link to a clearnet site.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535655759",
			"date_added": 1535681120
		},
		{
			"comment_id": 89,
			"body": "@Krixano: Run a bot that just fetches text from popular news sites' recent articles, and then have it post them onto a ZN site. Copy article images as well. Do this for a variety of site and just have it automated. Something like \"river of news\" or w/e, but with the article content as well.\n\nThat'd be a good first step I think.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535655759",
			"date_added": 1535711800
		},
		{
			"comment_id": 90,
			"body": "Some people like gender norms, but fuck them right? 🤷‍♀️",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535775752",
			"date_added": 1535777170
		},
		{
			"comment_id": 91,
			"body": "I don't work on the ZeroNet software itself, so my views have no influence on that. I'm sure they'll stick around for a while at least.",
			"post_uri": "19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S_1535721901",
			"date_added": 1535777299
		},
		{
			"comment_id": 92,
			"body": "@Styromaniac: Yeah that's kinda shitty. Gotta stop bullying.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535775752",
			"date_added": 1535783546
		},
		{
			"comment_id": 93,
			"body": "Girl bike, obvs.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535788746",
			"date_added": 1535809141
		},
		{
			"comment_id": 94,
			"body": "@Styromaniac: Now now, genitals don't determine gender/sex.\n\n@Krixano: It's not so much \"dumb\" as it is just a basic evolutionary trait. We have social norms/roles because socially men and women are seen as distinct groups (which makes sense). And each have their own norms and ways of participating in society. This had an evolutionary advantage, and arguably still does (albeit modern society is trying to erase that).\n\nI think it's ridiculously silly that people want to try and abolish something that arises naturally. Who cares if the bike is socially meant for girls or guys? You wanna reject the norms, then go for it. But why drag everyone else with you? I'm happy to conform with \"girl stuff\". And I know plenty of guys who are chill with \"guy stuff\". Why take that away?",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535788746",
			"date_added": 1535860588
		},
		{
			"comment_id": 95,
			"body": "@Krixano: The roles themselves aren't always biological. Which is why they differ per culture. But the *idea* of norms/roles themselves absolutely are. Which is why such a concept is shared in every single culture. As for people being bullied... yeah, that's what needs to stop. Not the norms, but just harassing people who don't fall in line.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535788746",
			"date_added": 1535860939
		},
		{
			"comment_id": 96,
			"body": "@Krixano: Realistically only a few people would go out of the norms, because the idea of norms is biological. Mostly only LGBT people fall out of line.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535788746",
			"date_added": 1535861329
		},
		{
			"comment_id": 97,
			"body": "@Krixano: Yeah but do you wear dresses/skirts/feminine clothes? Do you act femme or masc? What kinda hobbies you got? I'm guessing it lines up more with men than with women.\n\nJust because you don't watch sports doesn't mean you don't follow male rather than female norms.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535788746",
			"date_added": 1535861830
		},
		{
			"comment_id": 98,
			"body": "@Krixano: You've still got it backwards. It's not \"men are supposed to be this way\" it's \"men naturally conform with other men\". The norms innately \"make sense\" because people naturally conform with and construct them. Yes, some people fall outside in some way or another. Which is why norms tend to change overtime.\n\nAnd you're still thinking of the norms/roles as very niche and specific things, when that's not really the case. Sure there are the stereotypes, but there's more than that. Personally, I don't know any non-LGBT guy who would be caught dead in a dress unless it was being done as a joke.\n\nAs for sex... the brain is a sexed organ. Which is why sexed norms and cultures are innate. You're coming at this with a modern neoliberal political viewpoint, while I'm just discussing factual biological reality. The biological reality is that men conform with men, and women conform with women. And their specific sexed norms are then socially constructed.\n\nWe should do more to help those who fall outside of those groups, but it's ridiculous to say such groups should be abolished. As they'll just pop right back up.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535788746",
			"date_added": 1535862465
		},
		{
			"comment_id": 99,
			"body": "@Krixano: Most men and women willingly conform with the norms. And do it instinctively.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535788746",
			"date_added": 1535862492
		},
		{
			"comment_id": 100,
			"body": "@Krixano: Source? I've yet to see anything of the sort. Where did the norms come from if not in the manner I described? Assigned by god?\n\n@Styromaniac: Ask a silly question, get a silly answer.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535788746",
			"date_added": 1535862621
		},
		{
			"comment_id": 101,
			"body": "@Krixano: Abolish harassing people who don't conform. Just ignore the norms themselves :P",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535788746",
			"date_added": 1535862757
		},
		{
			"comment_id": 102,
			"body": "@Krixano: Yet again you've entirely failed to read what I wrote. Odd how everyone who seems to oppose my views has that exact same  problem. Yes, the *norms themselves* are not gendered/sexed. But having sexed norms *at all* is something innate. They conform with peers of the same sex. This is an innate biological function of the brain. These form male and female social groups, which then socially develop their own norms. And indeed, things like pink=girl have been different in the past (pink=boy).",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535788746",
			"date_added": 1535862997
		},
		{
			"comment_id": 103,
			"body": "@Krixano: You keep using exceptions rather than the norm. Personally speaking, I don't know of any non-LGBT people that incorrectly engage with social norms. It's actually a pretty reliable indicator as to who's gay or trans. But yes, disordered people will fall out of line.\n\n@Styromaniac: Agreed.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535788746",
			"date_added": 1535863333
		},
		{
			"comment_id": 104,
			"body": "@Krixano: okay? Most men I know aren't into sports. Not sure why you keep pushing that. No idea why you keep pointing out that men cry. Yes, it's a biological function. Same for geeks. Most people aren't geeks. You seem to be confusing stereotypes with gender norms.\n\nWhich yes, if we're talking only about stereotypes, then sure. I see your point.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535788746",
			"date_added": 1535863836
		},
		{
			"comment_id": 105,
			"body": "@Krixano: No. Stereotypes of norms and actual norms are different.\n\n@Styromaniac: They *can* be harmful, but aren't innately harmful. It starts becoming an issue when people are forced into it, or a particularly harmful norm is adopted (the very stereotypical macho \"men never cry\" norm is one such example). Most norms people conform with without ever thinking twice about it.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535788746",
			"date_added": 1535867173
		},
		{
			"comment_id": 106,
			"body": "I've been considering making videos. Not sure what they'd be about though...",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535910692",
			"date_added": 1535945734
		},
		{
			"comment_id": 107,
			"body": "@Styromaniac: I probably wouldn't show my face, but maybe speak. I don't have the best voice or the cutest face lol.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535910692",
			"date_added": 1536116101
		},
		{
			"comment_id": 108,
			"body": "@Daniell Mesquita: Lol nah. I've considered using text to speech or something like that. But I realistically wouldn't.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535910692",
			"date_added": 1536378900
		},
		{
			"comment_id": 109,
			"body": "@Daniell Mesquita: Have you actually heard my voice? And yeah I'd probably just do screencapture or show slides/video/etc.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535910692",
			"date_added": 1536379341
		},
		{
			"comment_id": 110,
			"body": "@Daniell Mesquita: lol k.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535910692",
			"date_added": 1536380867
		},
		{
			"comment_id": 111,
			"body": "@Daniell Mesquita: I wasn't even planning anything lol. I said I was thinking about it.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535910692",
			"date_added": 1536382959
		},
		{
			"comment_id": 112,
			"body": "@Daniell Mesquita: your voice is fine lol.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535910692",
			"date_added": 1536387106
		},
		{
			"comment_id": 113,
			"body": "@ZeroLSTN: >coins\nIs this a blockchain? If so, we are already using a blockchain dns and it's trash.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1536350869",
			"date_added": 1536456674
		},
		{
			"comment_id": 114,
			"body": "@ZeroLSTN: So that's even less useful then.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1536350869",
			"date_added": 1536501601
		},
		{
			"comment_id": 115,
			"body": "@Daniell Mesquita: Thanks <3",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535910692",
			"date_added": 1537013363
		},
		{
			"comment_id": 116,
			"body": "Can this happen already so people stop using chrome and chrome-derivatives and instead focus on making actual new browsers?",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548206600",
			"date_added": 1548285097
		},
		{
			"comment_id": 117,
			"body": "IPFS and ZeroNet have opposing philosophies. ZN is opt-out, IPFS is opt-in. This makes ZN more reliable.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548263936",
			"date_added": 1548285198
		},
		{
			"comment_id": 118,
			"body": "@Styromaniac: They ace at different things because they're philosophically opposed. ZN is about decentralized hosting of websites. IPFS tries to create universal links for content that never updates. With ZN updatability of the site is in mind when building. In IPFS the opposite is true.\n\nAmusingly, despite ZN being mutable and IPFS being immutable, we end up with ZN having more redundancy due to it's opt-out nature rather than IPFS's opt-in nature.\n\nTo me the clear winner appears to be ZN. IPFS can barely function half the time.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548263936",
			"date_added": 1548296409
		},
		{
			"comment_id": 119,
			"body": "@Eightyfour: TERFs regularly deny science. tf you on?",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548310861",
			"date_added": 1548384027
		},
		{
			"comment_id": 120,
			"body": "@Styromaniac: I understand sex chromosomes fine. They are just entirely unrelated to one's biological sex. They're often indicative, but lots of reproductive/sexual disorders deviate from that norm.\n\nWhat I find instead is that most people fail to properly understand transsexualism, and often conflate it with the more popular transvestic disorder (GID/Gender incongruence/etc). Leads to all sorts of confusion unfortunately.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548310861",
			"date_added": 1548390663
		},
		{
			"comment_id": 121,
			"body": "@Eightyfour: Question: do you believe women with CAIS (complete androgen insensitivity syndrome) are male? Due to having XY chromosomes? Seems odd since they're physiologically female.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548310861",
			"date_added": 1548480676
		},
		{
			"comment_id": 122,
			"body": "@Styromaniac: If he wanted to try to declare that women with transsexualism are somehow men, he probably shouldn't have started with chromosomes. Instead what I'd do is point out how we can't actually transplant reproductive organs, nor reconstruct them. Meaning a full proper transition isn't technically possible. And then go from there.\n\nBut of course transphobes are kinda retarded so it is what it is.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548310861",
			"date_added": 1548506839
		},
		{
			"comment_id": 123,
			"body": "@Eightyfour: You do realize you disagree with scientists and biologists, right? Along with medical doctors? All for the sake pushing your 5th grade education of how sexed development works, at which point you admit it is faulty? At this point it's some sort of delusion you're pushing just so you aren't wrong lmao.\n\nYou umm.... do realize that when we say sex we're referring to reproductive roles and the associated biology, right? Not chromosomes? We labeled XX as female because it usually correlated with those organs and that role. But in cases like CAIS that's no longer true. But you'd rather reject science entirely to push an agenda namely focused on bigotry, rather than biological facts. Suit yourself I guess?\n\n\n@Styromaniac: \n>He prefers to gender people by chromosomes, even though that means he'll have to call a few people born with vaginas and having grown breasts men, \n\nIt's not even about gendering. He's just straight up incorrect. He's trying to declare that someone born with a uterus, ovaries, vagina, etc. is somehow male because she has XY chromosomes. He's just straight up incorrect.\n\nBut yes, he'll definitely run into confusion when he finds out about stuff like XO, XXY, etc.\n\n@Eightyfour:\n>\"Look at this chromosomal exception, therefore cutting my dick off and inserting silicone in my chest makes me a woman now!\"\n\nAaand here we go. More uneducated bigotry without understanding science. For a start, no one \"cuts their dick off\". Most transitioners don't even get SRS.\n\nAs for \"inserting silicone in your chest\" that's not at all what happens. Breasts grow naturally as a result of estrogen exposure. But I get you aren't a man of science and prefer to reject it in favor of your bigoted misinformation.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548310861",
			"date_added": 1548592366
		},
		{
			"comment_id": 124,
			"body": "If your \"app\" is reliant on centralized things, it's not decentralized. I've been saying this for a long time. This is why I'm a firm believer in ZeroNet's future, along with things like cjdns, patchwork/ssb, etc. Things that don't rely on centralized solutions.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548527983",
			"date_added": 1548592576
		},
		{
			"comment_id": 125,
			"body": "We need cjdns trackers :)",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548657813",
			"date_added": 1548663898
		},
		{
			"comment_id": 126,
			"body": "I only have two hard-coded trackers on my ZN: one ipv4, and one cjdns/ipv6. Both are ZeroNet bootstrap nodes. Everything else is shared. All ZN bootstrap nodes. Once more people hop on the cjdns train we can finally have a web that's immune to middleman bullshit.\n\nEdit: all we need now tbh is automatic cjdns peer info sharing.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548974382",
			"date_added": 1549005570
		},
		{
			"comment_id": 127,
			"body": "I'm not opposed. Is the only difference between that and cjdns just the routing? What benefits are here that we don't get from cjdns?\n\nUltimately my goal is to get to a point where we don't rely on any centralized hardware or software for basic web/internet usage. CJDNS seems to be the most active project in that field, hence the best option IMO. Real mesh networks are actually using cjnds right now.\n\nAFAIK yggdrasil doesn't really have a network of users.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1549037060",
			"date_added": 1549101636
		},
		{
			"comment_id": 128,
			"body": "@Styromaniac: Agreed. The more options the better tbh. Whatever gets things going the fastest is probably the best. I'm not sure how much longer we'll have a free and open internet.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1549037060",
			"date_added": 1549102185
		},
		{
			"comment_id": 129,
			"body": "@Styromaniac: Indeed. It's already starting. Which is why things need to go a bit faster than they have been. I went ahead and installed yggdrasil, but I'm not sure I'm connected properly. I think I'm lacking a proper peer to connect to.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1549037060",
			"date_added": 1549103239
		},
		{
			"comment_id": 130,
			"body": "aww heck. Honestly I just copied code from the template blog I was sourcing from. Seems something went horribly wrong for mobile. I'll probably need to recode the site from scratch.\n\nJust uhh.... use your PC for the time being lol. I'll see what I can do about it.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1549514312",
			"date_added": 1549515139
		},
		{
			"comment_id": 131,
			"body": "Should be fixed now. Please refresh the page+css and let me know if it's working for you.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1549514312",
			"date_added": 1549516630
		},
		{
			"comment_id": 132,
			"body": "Yeah I had taken a long break. It's hard to stay active here sometimes just due to the low activity.",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1549673135",
			"date_added": 1549674614
		},
		{
			"comment_id": 133,
			"body": "@Quantumworld: Yeah. ZeroNet is still really new. There's definitely a lot of growing to do.",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1549673135",
			"date_added": 1549697295
		},
		{
			"comment_id": 134,
			"body": "millchan ain't really my thing, and from the sounds of it the board is for porn. So I added them without checking, but if others could confirm that'd be great.",
			"post_uri": "1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC_1550170390",
			"date_added": 1550203743
		},
		{
			"comment_id": 135,
			"body": "@Pexo: Your edit mentions something about removing users from the list. Can you clarify what happened? Do I need to adjust my mutes/bans?\n\nEdit: I saw the address 1NocE9YvQkcNe9J5nUnPJUzWBQtA81nwfA spamming on the board in question. I didn't bother waiting for the full site to load (I have no intent on downloading/seeding that site).  Yet you removed this address from the list. Why? Now I'm wondering if I should just remove the entire \"millchan spammer\" list you provided.\n\nFor the time being I updated the list to only contain the 5 users currently listed here. If there's spam issues, please let me know.",
			"post_uri": "1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC_1550170390",
			"date_added": 1550283896
		},
		{
			"comment_id": 136,
			"body": "Doesn't seem to work.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550319865",
			"date_added": 1550456274
		},
		{
			"comment_id": 137,
			"body": "The amount of privilege in that article is insane. So let me, a poor white girl with some medical disorders, share my experiences and response.\n\n> the white privilege in this situation is being able to move into a “nice” neighborhood and be accepted not harassed, made to feel unwelcome, or prone to acts of vandalism and hostility.\n\nA pool in the backyard sounds fucking grand. Nice neighborhood? Fucking wonderful. Wish I had that. Instead I live in a rural area, with dirt, and had my house broken into by my ghetto black neighbors. I *wish* rocks thrown into the backyard were the least of my worries. If I move into an upper class area, I must worry about transphobia and other similar hate. Yet I'm privileged?\n\n>is if you’ve never had a defining moment in your childhood or your life where you realize your skin color alone makes other people hate you, you have white privilege.\n\n> if you’ve never been ‘the only one’ of your race in a class, at a party, on a job, etc. and/or it’s been pointed out in a “playful” fashion by the authority figure in said situation, you have white privilege. \n\nMost of my classes were mexicans, black kids, and  asians. I've had every aspect of me pointed out and mocked. Posts like these end up hating me because of my skin color. I was denied scholarships due to my skin color and sex. Yet, I'm privileged?\n\n> if you’ve never been on the receiving end of the assumption that when you’ve achieved something it’s only because it was taken away from a white person who “deserved it,” you have white privilege.\n\nSee above. I'm someone who worked hard. Graduated early. Perfect grades (above perfect). Yet I was denied scholarships because of my skin color, my sex, and my age. I did not get valedictorian because I had \"overachieved\". My middle school closed down after I left it, due to lack of funds. I had won every trophy for academic achievement. But I was denied many of them due to my sex. Yet in that school my grades were unfairly lowered because of my disabilities and sex. Yet I'm privileged?\n\n>if no one has ever questioned your intellectual capabilities or attendance at an elite institution based solely on your skin color, you have white privilege.\n\nMy university I went to is mostly asian. My skin color was pointed out constantly, and people were often in surprise. People didn't believe where I came from. They thought I was too young. I did, however, have to constantly petition for classes because they believed I couldn't handle the work. Not due to my skin color, but due to my age. Yet I have privilege? Have you ever had to petition to take a class because they thought you weren't smart enough?\n\n>if you have never experienced or considered how damaging it is/was/could be to grow up without myriad role models and images in school that reflect you in your required reading material or in the mainstream media, you have white privilege.\n\nI have no role models who are like me. Not one. I can't even find regular folks with the same disorders I have. Yet I have privilege?\n\n> if you’ve never been blindsided when you are just trying to enjoy a meal by a well-paid faculty member’s patronizing and racist assumptions about how grateful black people must feel to be in their presence, you have white privilege.\n\nI've gotten remarks like these often due to my age, sex, disorders, etc. I get panic attacks at restaurants due to the comments people make when I eat. Yet I'm privileged? I'd kill to go eat dinner with some hoity toity harvard folk.\n\n> if you’ve never been on the receiving end of a boss’s prejudiced, uninformed “how dare she question my ideas” badmouthing based on solely on his ego and your race, you have white privilege. \n\nThis one really irks me. Like holy shit imagine being so privileged people actually hire you, rather than say you aren't a good \"cultural fit\". Yet I'm privileged?\n\n> if you’ve never had to mask the fruits of your success with a floppy-eared, stuffed bunny rabbit so you won’t get harassed by the cops on the way home from your gainful employment (or never had a first date start this way), you have white privilege. \n\nImagine having a luxury car and a nice job to afford it. I struggle to get employed, and I can't manage to pay my medical bills. Yet I'm the privileged one and he lacks privilege? I'd kill to have my biggest problem be \"I need to buy a stuffed bunny so I don't get stopped by police\". Like please, trade places with me.\n\n>if you’ve never had to rewrite stories and headlines or swap photos while being trolled by racists when all you’re trying to do on a daily basis is promote positivity and share stories of hope and achievement and justice, you have white privilege.\n\nI get this a lot. Problems with my skin color, with my sex, with my age, with my medical disorders, etc. Yet I'm privileged? Again, having a job sounds awful nice.\n\nSo tell me, you honestly think my place in life is \"privileged\"? I worked my ass off to get where I'm at, and have constantly faced struggles and people intentionally trying to set me back because they don't like the way I look, or the way my body is, or the medical problems I have. They don't like that I'm an overachiever.\n\nBut tell me again how a rich black man in a luxury car with a nice job that pays well is somehow worse off than me. I'll wait and listen. Because that's what people like me are expected to do. Shut up, be quiet, and just accept my place and quietly struggle while I let others take the spotlight and get the fame and pity. That's \"privilege\".\n\nEverything mentioned in that list are things I'd *love* to have. And yet you're complaining about them? Are you fucking kidding me? Talk about privileged. Imagine complaining about being wealthy.\n\nSo without further ado, here's all I have to say to you people: https://www.youtube.com/watch?v=mGrufrND1m0\n\nSincerely,\nA \"privileged\" person who has had lifelong struggles.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550548328",
			"date_added": 1550550675
		},
		{
			"comment_id": 138,
			"body": "@Styromaniac: How is that trans? I transitioned after all of that mess. I didn't transition in school whatsoever. So the discrimination towards my sex was due to me being male, not female. Not trans. In terms of the trans stuff, the worst I got was being called a faggot, shunned pretty much entirely by almost everyone. That's about it.\n\nI've gotten both misandry when I was male, and now misogyny that I'm female.\n\n>But white privilege does happen. These may be terrible examples from the article.\n\nIt sounds a whole lot like \"white privilege\" is just being normal. Or rather, being wealthy.\n\n>My half Mexican niece being \"randomly\" searched at the airport, I see racial bias.\n\nNot being \"randomly selected\" isn't privilege. It's racism towards minorities, sure. But that isn't some sort of benefit to me. To pretend it is is absurd. Racism exists, but I don't magically get any sort of benefit due to that.\n\n>My own grandmother was initially unapproving of my sister's Mexican husband.\n\nThis is pretty much expected in my family. I came out to my grandma. A bit later I got a transphobic phonecall by my uncle. Wonderful, ain't it? I hear racist remarks towards asians in my house all the time. My bf is asian. My family was transphobic before I came out.\n\nHaving grandma not approve is honestly not a huge deal. I've learned to not really listen to my grandma. If I did, I wouldn't be receiving medical treatment right now.\n\n>I've seen on the local news a toddler black boy being shot by a cop point blank for holding a stick.\n\nHappens to pretty much everyone but wealthy white men.\n\nUltimately, none of these things are a \"benefit\" or \"privilege\". But rather just plain old racism. To deny racism exists is silly. but to say it's the fault of people like myself who just have our own struggles and don't say a bad word to these people at all is just silly.\n\nName one thing that *I* have *benefitted* from. Not things that have caused problems for others. A lack of problems is the norm. Constant problems is *not* the norm. Lacking problems isn't privilege, it's what the standard should be.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550548328",
			"date_added": 1550552243
		},
		{
			"comment_id": 139,
			"body": "@Styromaniac: Except that's not how privilege is used. People claim it's some magic benefit, rather than being a normal life without X-type of harassment. I'd say the wealthy folk in the article have privilege. Sure, they experience racism, but to say that I'm somehow more privileged is ridiculous.\n\nThe only *true* privilege is that of wealth.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550548328",
			"date_added": 1550552914
		},
		{
			"comment_id": 140,
			"body": "@Styromaniac: Feel free to tag me at any time. Team common sense!",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550548328",
			"date_added": 1550553885
		},
		{
			"comment_id": 141,
			"body": "@Quantumworld: Obama was the best president in recent years so I'm a bit lost where you're coming from. The rest are horribly idiotic and incompetent. Obama at least was competent and fairly rational, even if his views were awful.\n\nAlso: you do realize that there's more than just democrat and republican, right? Democrats are bad, but republicans are worse.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550548328",
			"date_added": 1550605577
		},
		{
			"comment_id": 142,
			"body": "@Quantumworld: yes. Democrats are the scum of the earth, and yet somehow the republicans manage to be worse.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550548328",
			"date_added": 1550617818
		},
		{
			"comment_id": 143,
			"body": "You'll have to tl;dr it for me, I can't sit through it. Usually those guys have good content, but oof.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1551031318",
			"date_added": 1551062710
		},
		{
			"comment_id": 144,
			"body": "@Quantumworld: omfg i'm laughing so hard. you think that all of the new incoming traffic is solely your doing? hahahahahahaha",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1551021462",
			"date_added": 1551064878
		},
		{
			"comment_id": 145,
			"body": "@nekololi: The irony here is that he doesn't want free speech. He wants *his* speech.",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1551127430",
			"date_added": 1551156659
		},
		{
			"comment_id": 146,
			"body": "@Realjohndoe: or you could start your own node for people with those views? That's kinda the point. But yeah, federation is pretty bad.",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1551127430",
			"date_added": 1551419721
		},
		{
			"comment_id": 147,
			"body": "I just want to clarify that I don't have any *life-threatening* illnesses. I do have a place to stay currently (though it's far from ideal) but not really a solution long-term.\n\nIn terms of healthcare, as it stands I have regular medication I take which I'm a bit worried about (though I have enough to keep me going for now), and the more expensive aspect of doctor visits/tests/etc.\n\nGenerally speaking, as mentioned I have issues which make it difficult to work, and they're currently undiagnosed (no idea what's wrong). Which generally makes it difficult to actually earn an income and be able to see better doctors.\n\nI certainly hope I don't have a life-threatening issue, and hopefully I'll find out more when I see my neurologist again. I don't think it's the case.\n\nMy current healthcare is about to expire at the end of this month (just a few more days) and I'm hoping that medi-cal (state healthcare) will cover things, but I've been struggling to get the \"authorization\" for the meds/treatments/etc.\n\nThe tl;dr is: my work with zeronet is being delayed due to undiagnosed/unknown brain problems, along with a lack of funding for diagnosis/treatment/a stable living environment. Finding work is a priority over my ZN stuff unfortunately (as much as I'd just love to work on ZN full time). So that's my situation, hopefully it clarifies what's going on.\n\nNo need to rush at the moment, but I definitely need to figure out a long-term solution. Thanks for all the support <3\n\nEdit: See my latest status about bitcoin. I can accept it though I'm not quite sure how to use it on the things I need atm.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553689532",
			"date_added": 1553735349
		},
		{
			"comment_id": 149,
			"body": "I have no idea what accusations were made against me, I've been a bit afk from zeronet for the past few days. I'm guessing this was about the latest entry in my spamlist? The user in question was going around spamming on posts, with the content containing variations of \"kill yourself\" and other harmful things. I did not put them on the list due to disagreement nor of controversial opinions. It was completely and entirely due to the spam nature of the posts.\n\nThat being said, had they not spammed, I'd have still banned from kaffiehub and put on my own blocklist.\n\nPeople are free to use or not use my spamlist, which is only for spam. Kaffiehub is my own personal site, and if you are uncomfortable with my moderation you can migrate elsewhere. Generally I allow pretty much any sort of commentary (including things that are normally quite disagreeable), provided it's not CP and not spam (my two personal limits). I always try to ensure that my network of sites are clean, without spam, and open forums of discussion.\n\nI'm no enemy of right-wingers, nor of left. As I find my views are a mix of both. Despite my own situation, slurs and hateful comments towards me *in the context of a conversation* are things I *won't* remove. Even if I personally find them upsetting. Free speech is something I hold very dearly, which is why I'm here on ZeroNet in the first place. But I won't tolerate spam, and I certainly won't tolerate spam written to drive harm to people.\n\nSo TL;DR:\n\nSpam will get you put on my spamlist, regardless of the content of the spam. That's what the list is for.\n\nSpam and directly antagonistic/off-topic comments meant to antagonize and drive hate will likely be banned off my network of sites. That's my own personal choice as a site owner and it's a policy I make clear.\n\nDisagreeable opinions and views contradicting my own, and even hateful comments inside the context of a discussion are entirely allowed and something I *won't* remove. Opinions are something people are free to have, even if I find them hurtful or disagreeable. People should be free to have opinions and speak their mind. But if your purpose is to harm people and cause problems then kindly gtfo.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1557004279",
			"date_added": 1557211668
		},
		{
			"comment_id": 150,
			"body": "Personally I'd rather censor my view than prevent people from using the platform to speak. And realistically feeds and forums need to be cleaned up *somehow.* Otherwise you get spam, trolls, people looking to cause problems, etc. Rather than actual legitimate discussion of things that might be controversial.",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1557289846",
			"date_added": 1557295321
		},
		{
			"comment_id": 151,
			"body": "I've been starting to use ZeroMe as my primary social networking site. Which is why a lot of my posts are a lot more personal now. I think it's a good idea to use ZeroNet how you would use the regular clearnet, rather than using it in a special different way.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1558237601",
			"date_added": 1558259700
		},
		{
			"comment_id": 152,
			"body": "nofish is surprisingly lenient on bans.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1558823392",
			"date_added": 1559073603
		},
		{
			"comment_id": 153,
			"body": "Trans women are naturally seen as attractive by heterosexual men, but *also* have an increased attractiveness factor for men with GAMP (trans fetish). It's a give/take. Personally I haven't had any issues with dating men.\n\nI hear GID mtfs who try to date women have much worse luck though, both due to their greater difficulty in passing, but also because women are \"harder to get\" in general. Men are hoes lmao.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1559271434",
			"date_added": 1559353099
		},
		{
			"comment_id": 154,
			"body": "Doesn't seem that useful. Since you can very easily just create a new address.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1564282714",
			"date_added": 1564301902
		},
		{
			"comment_id": 155,
			"body": "My therapy appts are usually every 2 weeks or so, sometimes every week. I need to schedule a psychiatrist+psychologist, have them check back with my therapist, and then possibly be good to go for antipsychotics or something else.\n\nI'm on california's medi-cal so prescriptions are free when I get them. The big roadblock right now for this isn't money, but scheduling and time.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1564325327",
			"date_added": 1564404715
		},
		{
			"comment_id": 156,
			"body": "@Styromaniac: The duration of my sleep is more than long enough, but the quality is arguably poor. I'm a deep sleeper, but lack any dreams, and wake up tired. I'm mostly nocturnal and end up staying up most of the night and sleeping most of the day.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1564325327",
			"date_added": 1564406393
		},
		{
			"comment_id": 157,
			"body": "@Styromaniac: Yeah I learned about that from experience haha. Seems all of my breaks happened at night. And yes, I'll be doing a lot of research into the various medications available.\n\nAs for recreational drugs.... my therapist advised to stay away from it, and I have no plans of using any. I'm pretty strict when it comes to that stuff (no drinking, smoking, recreational drugs, etc.)",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1564325327",
			"date_added": 1564406715
		},
		{
			"comment_id": 158,
			"body": "ugh, hate people like that.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1565045938",
			"date_added": 1565045812
		},
		{
			"comment_id": 159,
			"body": "I looked into it. It's basically nonsense.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1564724921",
			"date_added": 1565045951
		},
		{
			"comment_id": 160,
			"body": "@Styromaniac: #NoEarthSociety",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1564724921",
			"date_added": 1565047723
		},
		{
			"comment_id": 161,
			"body": "@Styromaniac: I mean my comment was kinda serious. I'm seriously skeptical of the earth existing. Or anything physical for that matter.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1564724921",
			"date_added": 1565049559
		},
		{
			"comment_id": 162,
			"body": "Fork it and add it yourself :)",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1565303592",
			"date_added": 1565313885
		},
		{
			"comment_id": 163,
			"body": "Being a minority doesn't make you immune *unless* you also agree with the narrative and are in a place of privilege. Double points if you're in the majority of your particular minority.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1576416460",
			"date_added": 1576676029
		},
		{
			"comment_id": 164,
			"body": "He's an idiot but AFAIK he's a legitimate user, even if his thoughts are dumb af. No bot posting, not spamming anything, just posting and using zn like anyone else would.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1581025290",
			"date_added": 1581063277
		},
		{
			"comment_id": 165,
			"body": "20-something year old left-wing trans woman who somehow has surprisingly right-wing viewpoints/rhetoric. That's how you come across to me.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1581038796",
			"date_added": 1581144022
		},
		{
			"comment_id": 166,
			"body": "@Styromaniac: That's my stance, yeah. Provided he's not just copy+paste spamming stuff, then he's using the platform as intended. Regardless of how much of a social cancer he might be.\n\nI try to separate \"spam\" from \"undesirables\". The former is a clear technical problem: pointless posts that don't use the system as intended that make a platform unusable or inefficient. Whereas an undesirable user may just be someone who's disliked or hated for whatever reason; despite using the software as intended.\n\nA good communication platform, IMO, will block spam but allow undesirables to communicate, but also allow people to not listen to people who they may dislike. This is why I don't put Realjohndoe on my spamlist, even though I dislike him.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1581025290",
			"date_added": 1581163103
		},
		{
			"comment_id": 167,
			"body": "You seem a bit confused. It's not about belief, it's about relevancy. If you spam something you believe it's still spam. But if it's relevant to a post and not copy+pasted then it doesn't matter if you believe it or not.\n\nIf the post is about democrat poll %s, then pointing out likes/dislikes about candidates is entirely on topic. However \"epstein didn't kill himself\" has nothing to do with poll %s and thus would be off topic and if copy+pasted to many posts that are all unrelated, then that would be spam.\n\nSaying something disagreeable and having disagreeable views isn't spam; spamming the same exact copy+paste onto multiple posts that are entirely unrelated to your paste is.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1581163295",
			"date_added": 1581238527
		},
		{
			"comment_id": 168,
			"body": "Wow that's pretty great.",
			"post_uri": "18UukzxVzEwd9ugyvKWYe2vud77GyL72Px_1599165161",
			"date_added": 1599484365
		},
		{
			"comment_id": 169,
			"body": "Link doesn't work 👀",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1600917424",
			"date_added": 1600935650
		},
		{
			"comment_id": 170,
			"body": "Given they're talking about LGBTQ and not LGBT, I wonder how many of those politicians are pro-LGBT but anti-LGBTQ?",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1624085006",
			"date_added": 1624162323
		},
		{
			"comment_id": 171,
			"body": "@Styromaniac: LGBTQ is an acronym used by people who often work against LGBT rights, due to holding a different ideological framework. A particular group of people believe that LGBT related things are \"chosen identities\". Such as \"gender identity\" or \"sexual preference\". They believe you 'identify as' lgbt, and that there isn't anything inherently biological about it. Such people often push legislation that removes protections for transsexuals (who these people deny exist) in favor of rights and protections for transvestites who \"choose to identify as the opposite sex\". For example with the equality act, which would remove sex-based protections for women, and would remove transsexual rights entirely, erasing them and putting in place protections for an ideology that denies biological transsexuals even exist. As a result, being pro-lgbt means you are anti-lgbtq. To assert that biological transsexuals exist, requires rejecting the model of gender identity and the idea that gender identity feelings, or chosen identities are valid. These ideologies are opposed to one another.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1624085006",
			"date_added": 1624503625
		},
		{
			"comment_id": 172,
			"body": "I'm not exactly the best at \"making things nicer looking\" lol. Nor is offlinebay my project. It's pretty cozy though...",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1624524714",
			"date_added": 1624609074
		},
		{
			"comment_id": 173,
			"body": "In terms of biology we evolved to eat continuously throughout the day, just in small amounts.The concept of 3 meals a day is entirely arbitrary. I usually eat twice a day, with snacks throughout the day.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1624668632",
			"date_added": 1624666510
		},
		{
			"comment_id": 174,
			"body": "Cool for people into that kinda thing, but I hardly play steam games as it is.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1626480293",
			"date_added": 1626475323
		},
		{
			"comment_id": 175,
			"body": "Wait you can collect disability for having slight autism? I might look into that.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1628762378",
			"date_added": 1628750853
		},
		{
			"comment_id": 176,
			"body": "@ssdifnskdjfnsdjk@zeroid.bit: direct link is [here.](http://127.0.0.1:43110/14mWGcvXXpmTYpodYPyVrh6nZnQ6f7QgNC)",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1630353043",
			"date_added": 1630634649
		},
		{
			"comment_id": 177,
			"body": "It should just be a matter of adding lines to the users/content.json. Not difficult.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1631041692",
			"date_added": 1631052716
		},
		{
			"comment_id": 178,
			"body": "@Styromaniac: afaik the lines in the js only effect whether the option pops up when you click the login button. Not whether the signer is actually accepted. And iirc you can just have it highlight everything by being empty.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1631041692",
			"date_added": 1631053205
		},
		{
			"comment_id": 179,
			"body": "@Styromaniac: Yup. Just the data/users/content.json, and a few lines in the js. The content.json file is what sets the permissions, and the js file dictates what options pop up when you click \"login\". That's all that's needed to get the other ID providers working. idk why everyone has a hard time with it. Perhaps they aren't signing it? Apparently you have to manually sign it separate from the regular content.json file (can be done via the sidebar).",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1631041692",
			"date_added": 1631174061
		},
		{
			"comment_id": 180,
			"body": "Perhaps try making a clone of [kxovid](http://127.0.0.1:43110/16KrKKRNHUc8WnRNuV9PgNqZQ8zqGteT4p/?/)? I kinda prefer kxovid as it has proper channels, hubs, etc. Idk how well deleting works though. KopyKate is just more popular for whatever reason.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1631232111",
			"date_added": 1631234388
		},
		{
			"comment_id": 181,
			"body": "seems so",
			"post_uri": "1RkMN2MuY7DSijeukcTdPNf2MRTVBChx7_1633087674",
			"date_added": 1633146799
		}
	]
}