{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "​",
			"body": "",
			"added": 1482544983
		}
	],
	"topic_vote": {
		"2_1BNmjz9tBLY3M1tq2z7DKvA1LjFXYsmLd9": 1,
		"1_15UQgwkDToGA1BDbAHhDkNAS3DHvXp7u1q": 1,
		"1_15Hi7MDddHwzTZmmcsj8MWLpZaDz6mLPXg": 1,
		"4_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": 1,
		"1_19Pxt88uzbbr1dQCHsvpZiefd39f9r3Ucx": 1,
		"1_1BNmjz9tBLY3M1tq2z7DKvA1LjFXYsmLd9": 1,
		"3_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR": 1,
		"1_17AcmbLffN1gjfsTf6Jy8K2aBPdMaSBrrf": 1
	},
	"next_comment_id": 31,
	"comment": {
		"1_1FJf2hQWT6YY9oxXozkx1ZvBHyAJVYmb76": [
			{
				"comment_id": 1,
				"body": "> [fucku4](#comment_1_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy): The United States MUST IMMEDIATELY start CREATING the currency and STOP borrowing it from the privately owned Federal Reserve Bank, which gives its Globalist owners UNLIMITED CURRENCY to totally bribe the government and finance criminal politicians! Also, NEVER pay back the 20 Trillion to the Federal Reserve, since this debt is Un Constitutional!\n> Global Warming is 100% REALITY, however, the bulk of it is being caused by Geo Engineering which the Government is using to control the weather, for the sake of Humanity, you MUST understand this TRUTH ! Credible source: GeoEngineeringwatch.org\n\nlol",
				"added": 1473467772
			}
		],
		"1_1Exd7U88RdmPk4yfpTjkMQuSo5Jvys3ScJ": [
			{
				"comment_id": 2,
				"body": "fuck i thought my git page was embarassing\ni love that this girl thought bloggers were \"hep\" back in 2010\nin 2010 i was a retarded teenager too, but i knew that rooting phones and hacking consoles for money made me scum and not some 1337 geek goddess",
				"added": 1473795621
			},
			{
				"comment_id": 4,
				"body": "nish are you trying to fuck with us? none of that feedback was encouraging. thanks for adding your rehash of what zeronet is. you're really helping to build the community and in no way are a living breathing stereotype of a stupid basic girl trying to be a nerd. god damn.",
				"added": 1474135544
			}
		],
		"1_15UQgwkDToGA1BDbAHhDkNAS3DHvXp7u1q": [
			{
				"comment_id": 3,
				"body": "why would you do this you cheeky bastard",
				"added": 1473893997
			}
		],
		"1_1Ne8J8yCmKdqL1g9vvX3CGTqwoKZVFpN8P": [
			{
				"comment_id": 5,
				"body": "xioamei, just type in youtube.com as you normally would",
				"added": 1474135669
			}
		],
		"1_18y2yVkZLAsux2vaFvyvv6v3dZZbZ4ZTqK": [
			{
				"comment_id": 6,
				"body": "Do you think this is a game?",
				"added": 1474727317
			}
		],
		"4_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": [
			{
				"comment_id": 7,
				"body": "Would you be interested in automating the process of copying content from sites like Vimeo and YouTube to draw more users in?  I know the amount of data is prohibitive but maybe if users could browse videos from those places and then just click something to download and seed then this place would be more interesting sooner.",
				"added": 1475192617
			}
		],
		"1_1BNmjz9tBLY3M1tq2z7DKvA1LjFXYsmLd9": [
			{
				"comment_id": 8,
				"body": "> [ilovehitler](#comment_1_1L52gpcrNiTdtU9VMRqyoc2MPq5xGago7z): this is the lamest chan ever, where are the individual boards? /pol/ cant migrate here\n\nAre you high? We have /b/, /pol/, /dev/, and some Russian thing.  Like one of the only boards we actually have is /pol/.  If you want more just clone zerochan or whatever, it's open source.",
				"added": 1475432720
			},
			{
				"comment_id": 13,
				"body": "What is going on?  I'm seeing over 1000 seeders but there are no new posts and no pictures are loading.",
				"added": 1481479999
			}
		],
		"2_1JEmH2pfXkpMMdzsJ256jzq2GTSxEacS2B": [
			{
				"comment_id": 9,
				"body": "> [timmyrs](#comment_5_1JQCnij7UvWdvcAHnZ4eDnSA88UsQR8puQ): Nice idea, but in reverse pedos could use your list to find pics they may crave ;D\n\nI fear that this may be the real reason such a thing exists, I think the pedos generally try to keep to themselves anyway.",
				"added": 1475704056
			}
		],
		"1_1JeExodN8WbYmkhAptiaq59gyF64vssVig": [
			{
				"comment_id": 10,
				"body": "> [hackdeam](#comment_2_1JeExodN8WbYmkhAptiaq59gyF64vssVig): good site ;)\n\nYou do know that people can see that you wrote that comment right?  If you're going to scam people at least put some effort in to it.",
				"added": 1475760246
			}
		],
		"1_1GK2Y6tjVu1j9EHMpHUky7XyGBkgcGArg9": [
			{
				"comment_id": 11,
				"body": "Thanks for joining us today hitlr!  MAGA",
				"added": 1478737133
			}
		],
		"1_19Pxt88uzbbr1dQCHsvpZiefd39f9r3Ucx": [
			{
				"comment_id": 12,
				"body": "Pretty cool",
				"added": 1479928219
			}
		],
		"4_1BBH8wSFw4NF7sjvSBA8SsSvZA6cQYxUBq": [
			{
				"comment_id": 14,
				"body": "Qu'est-ce que c'est?",
				"added": 1481735483
			}
		],
		"4_12Uapn8usaZGRVFjJ4ooJS7q4o6M5gJksN": [
			{
				"comment_id": 15,
				"body": "y tho",
				"added": 1481855232
			}
		],
		"1_1HS1e8Tdgq6X2H916dT1U79LQTfoFoYBz4": [
			{
				"comment_id": 16,
				"body": "k",
				"added": 1482544707
			}
		],
		"1_17AcmbLffN1gjfsTf6Jy8K2aBPdMaSBrrf": [
			{
				"comment_id": 17,
				"body": "​",
				"added": 1482545008
			}
		],
		"1_13ctizZWFiVuy32Ek6cypGrLghH2wKXDrT": [
			{
				"comment_id": 18,
				"body": "Do you mean this?\nhttp://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/\n\nIn the future use one of the search engines.\nhttp://127.0.0.1:43110/kaffiene.bit/\nhttp://127.0.0.1:43110/1f7FYxZWSZ5YG7Nd8sGsHcWEQgvdnVvQF/",
				"added": 1482800370
			}
		],
		"1_1A4zF6rpFeUPPfA9xNBU4pPt3PwvXu1EZT": [
			{
				"comment_id": 19,
				"body": "Sounds like propaganda to me.  At the very least the people who want to kill all muslims are in a small minority.  Seriously though, cut it out with that religion stuff and do something with your life.",
				"added": 1483024185
			}
		],
		"1_18R1f7hH5E71qEPtZN4CzkyguX6pu1x3ci": [
			{
				"comment_id": 20,
				"body": "Hey what are you doing here?  You think you can just publicly post software keys on zeronet like that?",
				"added": 1483213948
			},
			{
				"comment_id": 21,
				"body": "Just joking friend.  I completely approve of what is going on here.",
				"added": 1483305772
			}
		],
		"1_1PXmWjiJruYv7HZQJDZcuaPZAD9L1ncVBJ": [
			{
				"comment_id": 22,
				"body": "Have you guys seen Tuxemon (https://tuxemon.org/ )?  We could actually implement the official Pokémon in that engine and host the project on zeronet so that it couldn't be taken down.",
				"added": 1483376091
			}
		],
		"3_192RrVMsT8jyw5HqeoPkcoBzDyu1GTeQ3M": [
			{
				"comment_id": 23,
				"body": "Somehow I feel like anyone who would date people from ZeroNet is going to either be really cool or really creepy.",
				"added": 1484092566
			}
		],
		"1_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5": [
			{
				"comment_id": 24,
				"body": "How does this one actually work?  Are you using webtorrent or what?",
				"added": 1484593744
			}
		],
		"2_1A3XsuLB6P7LQPCw1QWASG7RGSwrCv6Xib": [
			{
				"comment_id": 25,
				"body": "I'll stick to my Buddy Jesus thanks.",
				"added": 1484880599
			}
		],
		"30_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 26,
				"body": "Why is onii-chan loli trash on here but 0chan is not?  Fucking pedofiles I swear.",
				"added": 1485289056
			},
			{
				"comment_id": 27,
				"body": "> [loligod](#comment_3_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp): Having an open and censorship resistant internet means that there will be access to controversial topics. I can understand where you are coming from if any of my sites included child pornography. But none of them do. Getting hot and bothered by harmless 2D animation is immature. \n> I mark all my work. sirenyc properly put a 18+ mark. Nobody is forcing you to visit any of my sites. You do it of your own volition. If you feel uncomfortable seeing a link then maybe you should stick to your censored internet. \n> \n> I find it interesting how you intend to make a list of Zeronet Sites but willingly censor links when anybody get their panties in a twist. Why would anybody take a second look at this list when they know it's actively censored and they won't be able to get the complete picture? I know things are controversial, but, if you're going by US legality here, my sites are completely legal while all the pirating and torrenting sites are not. I respectfully ask you to reconsider the removal of links. It makes no sense devaluing your list, censoring things, on an anti-censorship network. If people don't want to see something they don't need to click the link. Regardless it's not going anywhere.\n\nI was originally complaining more about the fact that some pedo board was included on the list while the general-use imageboard was not.  That said, I am not a fan of pedophiles and I do not want to see their stuff on lists like this.  There is a big difference between the censorship on the surface web and sirenyc taking pedo stuff off of this list.  Anyone can make their own list here.  If you want to make your own interesting site list and include pedo stuff along with mainstream content then that is fine and it is within no one's right or power to stop you.  If I start seeing too many pedo links here or other places I may start taking steps to stop hosting those links, but for the moment I feel that helping share them does at least keep you people from spamming the rest of us into oblivion with child pornography.",
				"added": 1485390421
			},
			{
				"comment_id": 28,
				"body": "> [loligod](#comment_3_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp): Getting hot and bothered by harmless 2D animation is immature.\nOh and if you're going to argue this you might as well take it all the way home and say that it's immature to complain about digital photos of child abuse since no one is being physically harmed by the photo continuing to exist.  While I agree with you in principle, the reality is that this stuff is banned basically everywhere civilized and no one has any use for it except for the creeps who get of on it and the creeps who get off on catching them.  I don't know what the solution is for you people, but I know that you are a huge liability to projects like zeronet.  I am all for the freedom to possess any kind of information you can get your hands on.  I just don't want to get v& for someone else's sick fetish.",
				"added": 1485391136
			},
			{
				"comment_id": 29,
				"body": "> [loligod](#comment_4_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp): it's not logical to associate [loli hentai] with the harm child porn brings\nIt is logical because while loli stuff isn't technically illegal in as many places the consequences for being associated with it are basically the same.  That is the same kind of harm to me.  I understand the difference between loli hentai and cp.\n\n> [loligod](#comment_4_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp): Being anti-censorship only means something when no party is blocked.\nNo party is blocked when sirenyc choses not to list your site any more.  You are now arguing for the right to force someone to make speech that they don't want to.  You have your own ability to speak for your website.  We are all on a level playing field here.  That is very different than on YouTube or Google where there is a central authority deciding who gets to say what.\n\n> [loligod](#comment_4_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp): Are you saying that you host the pedo links you are so opposed to? It just doesn't make any sense.\nI mean I host the actual links.  Like before sirenyc removed your site from the list, I seeded that list of links, including one to your site, to other people.\n\n> [loligod](#comment_4_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp): trying to address your flawed, hateful, and incoherent logic. Once again our disagreement is how we perceive child porngraphy differently.\nThere is nothing hateful here.  I feel bad for you guys.  Whether its biological or environmental or both you are attracted to children.  Some of you abuse your own kids or those of others, while some just draw pictures of it and wax poetic on the internet about how we're all bigots who are oppressing children and the kind adults who want to fuck them.  Again, I don't even think posession of cp itself should be a crime, but producing it sure as fuck is and if you are attracted to children you need some serious help.\n\n> [loligod](#comment_4_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp): Never once did I even suggest spamming. You are attacking a straw man.\nI was referring to how without containment areas you guys will spill over into what is supposed to be a clean place and shit all over our five seconds of freedom because of your paraphillia.",
				"added": 1485395796
			}
		],
		"1_15uKs2BnsHt16SQszdqFFWX8p1QEYxeWxj": [
			{
				"comment_id": 30,
				"body": "We could really use a Time Cube mirror here on ZeroNet.",
				"added": 1486686032
			}
		]
	},
	"comment_vote": {
		"3_1CXgP3VnGvteJ7qfGubuF6xgyfNzFqog2c": 1,
		"1_1FkHAWYYdURFGyXt3cZTs3neGVYumEpjsF": 1,
		"1_1Fmvz7opVXZrpm3JRvTr619vrM9UQVUajR": 1,
		"1_1CXgP3VnGvteJ7qfGubuF6xgyfNzFqog2c": 1,
		"1_1EZDVdLW5CTKuZK1S1xqb4PYwpX3jvBnqa": 1,
		"1_16bWPLe3DSQL5iy6KrtNbUZepevu5i575L": 1,
		"1_1LioorsH1XNAMTpN1VbMpmpjJWUoUHLqni": 1,
		"1_1NnLEbZgqNo9QfGuopF2Co7Dy152rp3Pim": 1,
		"17_17AcmbLffN1gjfsTf6Jy8K2aBPdMaSBrrf": 1,
		"1_18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj": 1,
		"1_1Gtj7AdXhzMFUVVvFm2ZGCbTFdgNwdtuMn": 1,
		"1_175HXihPSS9eFuFptijNxAJzjsZ27zHYNq": 1,
		"1_1NeDefYcar3BBHk2PdfBvgu7spE9XKRmPd": 1,
		"1_1LpL3nemF6HjCa1saXfCPuEvnsm4Zx9j22": 1,
		"2_142bZXZc2MoGr9QJS4s9B4m8qduL9BP82w": 1,
		"271_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1,
		"273_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1,
		"3_137PNA5gLgCTLZTBtzUqCmMoZ752NQGQSJ": 1
	}
}