{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"2_12HSLurcaibJh4A44LGHoXm6cv6jA5qaPP": [
			{
				"comment_id": 1,
				"body": "Все было понятно пять лет назад:\nhttps://pora-valit.livejournal.com/1738285.html\nЪ: Маленькое поколение рожденных в 90-е в принципе не способно прокормить большое поколение, рожденное после войны. \n\nДаже если царь случайно произнесет волшебное слово \"Навальный\" и тут же сдохнет, деньги на пенсии все равно не появятся.",
				"added": 1529866471
			},
			{
				"comment_id": 2,
				"body": "> [gluckman](#comment_5_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy): Реальная разница между численности поколений не та.\nА какая? Мы можем исходить из данных госкомстата?\n\n> Кроме того огромные ресурсы банально присваиваются олигорхатом или тратятся на политические авантюры\nРазумеется, но я не об этом, а о том, что арифметически невозможно заплатить пенсии из пенсионных взносов работников, причем такая ситуация не только в России. Необходим дополнительный приток денег, причем огромный.\n\nА где же его взять?  Допустим, если самодержец устанет и уйдет, все вдруг перестанут воровать, армия добровольно разойдется, а американцы отберут у олигархов украденный триллион и вернут россиянам, то денег хватит.  А если не все так поступят? Какой-то профсоюз их всех, что ли, напугает?",
				"added": 1531552465
			}
		],
		"2_16LkVPwKk9BRw1dzV241FPrPCcmw7effZo": [
			{
				"comment_id": 3,
				"body": "> [balancer73](#comment_399_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): но всё это на уровне единиц процентов, а не \"повального воровства\".\n\nТолько еще государство докидывает из федерального бюджета в ПФ больше половины суммы, которую платят работники (не считая межбюджетных трансфертов). А если на выходе получаем только то, что платили работники, значит, все остальное куда-то делось.",
				"added": 1533724166
			},
			{
				"comment_id": 4,
				"body": "> [balancer73](#comment_400_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Ибо ПФ -- это не только пенсии старикам, но и инвалидность, материнский капитал, пособия по безработице, всякая социальная помощь...\n\nВот тут:\nhttp://www.pfrf.ru/opendata~7706016118-budget\nсам ПФР дает такую CSV-шку:\n\n    Наименование показателя,Значение показателя,Период\n    \"Доходы бюджета, всего\",\"8 260,1 млрд\",2017 год\n    Поступление страховых взносов  на обязательное пенсионное страхование,\"4 481,9 млрд\",2017 год\n    \"Расходы бюджета, всего\",\"8 319,5 млрд\",2017 год\n    Расходы на выплату пенсий,\"7 167,2 млрд\",2017 год\n    Расходы на социальные выплаты,488 млрд,2017 год\n    Расходы ПФР по Программе материнского (семейного) капитала,\"311,8 млрд\",2017 год\n\nПо той грубой прикидке, по которой баш на баш получается, поступающие страховые взносы (4481,9 млрд) должны быть в пределах нескольких процентов от расходов на выплату пенсий (7167,2 млрд). Но что-то тут не так...",
				"added": 1533812599
			}
		]
	},
	"comment_vote": {}
}