{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1523133465,
			"title": "Separate ZeroMe hubs by language?",
			"body": "The \"Everyone\" tab in ZeroMe has been quite uninteresting for me to read the latest months as most posts are in Chinese these days. Would there be any interest to create separate hubs for the most common languages spoken on ZeroMe? I think such change would make it much easier to discover new people on the network, as you can just scroll through the \"Everyone\" tab and be able to see posts written in a language that you are able to understand.\n\nWhat do you think of this idea?",
			"added": 1523133464
		},
		{
			"topic_id": 1529242468,
			"title": "Let's upload some TV series to KopyKate",
			"body": "There has been a long time since a TV show was uploaded to KopyKate the last time. I have watched all episodes of [**How To Start Your Own Country**](/big.kopykate.bit/?Video=1514943624_164x9q7LJPLX4SMbhqLPraKAGZRPa2gTFe), and also some episodes of [**iZombie**](/big.kopykate.bit/?Video=1521552502_1CU7CerG5vMJdGpHJ8fKoeY1cg8upxoX5q) that were uploaded here. And let's not forget about the episodes of [**Rick and Morty**](/big.kopykate.bit/?Video=1508150935_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE), [**Mr. Robot**](/big.kopykate.bit/?Video=1511178601_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE), etc. that were uploaded last year.\n\nWhat TV series would you like to see uploaded to ZeroNet and KopyKate? Summertime seems to be quite quiet, not any of the TV shows I use to follow are currently running.",
			"added": 1529242466
		}
	],
	"topic_vote": {},
	"next_comment_id": 33,
	"comment": {
		"1516127143_1KY1YYCNH5sDor7yu19jEr5yMtiZ5QyWwu": [
			{
				"comment_id": 1,
				"body": "It appears Scuttlebot is more of a Friend-to-Friend network, ie you have to exchange keys with the people you want to communicate with, am I right? You can't just open the application and start participating in conversations immediayely like you can do here.",
				"added": 1516134190
			}
		],
		"1511856741_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE": [
			{
				"comment_id": 2,
				"body": "Strange, I uploaded one video today. It asked me to select my identity with 3 separate dialogs (possibly because I use the Multiuser plugin), and as a result it uploaded 3 versions of my video. Two of them were visible in VideoBox, so I deleted one, and gave the other a proper title and thumbnail, but there's still the third duplicate left, that I can neither seed, nor delete because it's not visible in my VideoBox.",
				"added": 1516563390
			}
		],
		"1516934759_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": [
			{
				"comment_id": 3,
				"body": "From my experience people skilled in software are quite sought after by employers, at least in my region. I think you could very well succeed with landing some job in software/IT, especially if you have completed some university studies already and can put together a portfolio of some open source project you've been working on (KopyKate should be a good start). \n\nActually, I think it's mostly your environment that is treating you a bit harshly. I'm also currently studying for a software engineering degree at a university in Europe, my 4:th year, but I'm still struggling with some freshman courses. Only difference is that here it is no big deal, when I fail I can try the same course again next semester.\n\nPersonally I have found that after a stressful semester with university, working a few months with something totally different (e.g. delivery rider) can be really relaxing, but then again some other people really hate doing physical work... But I really think you can allow yourself to have a little higher ambitions than working at UberEats. If you want to try something different I have heard about people having success with doing a Working Holiday at some restaurant/bar/tourist resort in AU, NZ, and Thailand for 3-6 months. Try to figure out what makes you happy.",
				"added": 1517013969
			}
		],
		"1517193644_1NGfyDWZU2Y6czRKmXuCTntsf5sbf7pX2P": [
			{
				"comment_id": 4,
				"body": "For me the biggest issue is that people these days expect you to have a smartphone with an always-on mobile data connection. I use Telegram for communicating with most of my friends, and without a smartphone I'd of course keep my Telegram account to use from a computer. But people will write to you on the app, and if you do not write back right away they'll just think that you are ignoring them, instead of considering that I'll see their message first when I get to a computer.\n\nBasically, if people need to reach me, they'll first try Telegram or Whatsapp, and if it's urgent they might try a Whatsapp-call or something. If I don't answer they'll consider me unreacable, without thinking of trying a voice call or sms.",
				"added": 1517248313
			},
			{
				"comment_id": 5,
				"body": "Banks everywhere in Europe seem to start requiring a mobile app to do banking these days. You can log in to your account from a computer, but in order to generate the two factor authentication code required to log in you have to use their mobile-only app. It sucks, because if you lose your phone you can't do online payments anymore, therefore you can't pay for a new phone online. It sucks, because if you replace your phone you have to contact customer support to get the app activated on your new phone. It sucks, because the app won't run on a rooted phone. \n\nFortunately, my bank still use lists of one-time passwords printed on paper, but who knows when that system will be replaced with an app.",
				"added": 1517756554
			},
			{
				"comment_id": 6,
				"body": "> [anonymouslogin](#comment_87_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Rooted users can try installing the Xposed framework and one of the (many) root-hiding modules. [...]\nSure, however with banks you can never be cautious enough. If you get hacked and have your bank account emptied, the bank will try everything in their power to argue that it is the customer who have neglected securing their account, so that they do not have to take any responsibility for reimbursing the lost money.",
				"added": 1517941019
			},
			{
				"comment_id": 8,
				"body": "> [bodqhrohro](#comment_2_1EPZvJuUmcnL1Grz7mos34Qs3fXqMrKVck): Sounds terrible. We in Ukraine still have 2FA by SMS, is this already abandoned by western banks?\n\nIt probably varies a lot by country. For example, even though Sweden and Finland are pretty close neighbors, they traditionally have had very different approaces. Sweden have used their \"BankID\" system, basically a USB Smartcard reader that works with the web browser through some extension/Java applet. Finland on the other hand have single-use codes printed on a piece of paper. Most banks in Finland still use the old system with codes on paper, but some have transitioned to the mobile-only app for 2FA and it is expected this will be the new standard with all banks pretty soon.",
				"added": 1521671514
			}
		],
		"1520135278_18YsrRv5LsoqhKgirUbKNy8tXCRN1HqnDw": [
			{
				"comment_id": 7,
				"body": "I'm using FrootVPN. Only because it's the cheapest one I found. They have some serious issues with MTU where large packets get silently dropped...which is a very bad thing. For example most Bittorrent connections will fail if I use the µTP protocol which is over UDP, so I have to disable that option in my torrent client to get a reliable connection.",
				"added": 1520291347
			}
		],
		"1521750958_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 9,
				"body": "First milestone of bitcoin was in 2013 when the price reached 100 USD, then crashed. In 2014 it reached 1 000 USD then crashed. Now it has reached 10 000 USD and then crashed. I think the pattern will repeat and bitcoin will reach 100 000 USD eventually. I was stupid and got rid of my bitcoins in 2015, and was left with an amount that was too small for me to bother exchanging for euros.. That amount actually have some real value today.\n\nHowever, artificial intelligence is a quickly evolving technology: you can buy some hardware or write some software, but at the first time you put your hands on it, it's already obsolete and replaced with the next generation. I wouldn't call that an investment.",
				"added": 1521759566
			}
		],
		"1522596763_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 10,
				"body": "People are already complaining that browsers are large, bulky, and consume too much RAM as they include more and more features every day. I don't think Mozilla will consider it worthwhile to include a complete zeronet client in their browser, because of the impact it will have on installer size and RAM consumption. However, there have been discussions to add support for a zero:// URI handler that can be used by extensions, see http://127.0.0.1:43110/1EiMAqhd6sMjPG2tznkkGXxhdwFBDdeqT9/?Post:71:zero://",
				"added": 1522608415
			}
		],
		"1522607453_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q": [
			{
				"comment_id": 11,
				"body": "Here is explained the basic concepts of a multi-user site. Scroll down to **_Setting user content permissions_**, there is explained how you can change the size limit of your own site: [Blog.ZeroNetwork.bit/?Post:99:ZeroChat+tutorial](/Blog.ZeroNetwork.bit/?Post:99:ZeroChat+tutorial)",
				"added": 1522619261
			}
		],
		"1522585373_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 12,
				"body": "Check this for a list of VPS providers that allows anonymous registration over Tor, if you do not want to reveal your IP address: http://127.0.0.1:43110/1LfvE91ZF18jdG3wW62Dw7NtfTZh737KPL/?Topic:1521024646_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/Where+to+rent+Linux+server+anonymously",
				"added": 1522681259
			}
		],
		"1523025428_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 13,
				"body": "Relax, my roommate also forgets to turn the stove off all the time but our apartment hasn't burned down yet. Get a smoke detector for the kitchen if you are worried.",
				"added": 1523103463
			}
		],
		"1523133465_195oGGXB8AhwWSoXFHpbVT4TL4wLi1Af5e": [
			{
				"comment_id": 14,
				"body": "As the [Create Profile page](/Me.ZeroNetwork.bit/?Create+profile) already displays a description of each hub, it would be quite easy to simply present new users with a selection of a few different hubs. Then change the description of some generic hub to attract Chinese speaking users, and English speaking users will pick something else because they do not understand the description written in Chinese.\nWas not the main reason ZeroMe decided to use multiple hubs, that users only would need to download the hubs they are personally interested in. This would allow the network to grow much larger without making file sizes insurmountably large.",
				"added": 1523145990
			}
		],
		"1523451391_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 15,
				"body": "I'd be careful about disclosing information about your plant operations, if you have both picture, country, name(?), and a video of your univerity and neighborhood area uploaded here. Hopefully police have not yet infiltrated Zeronet, but you newer know if some anti-cannabis fanatic sees your posts and decides to make your life hell.\n\nNevertheless, I wish you the best of luck with all your operations!",
				"added": 1523463802
			}
		],
		"1524592326_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 16,
				"body": "While I generally support your idea of a basic income, it most likely won't lead to cheaper prices on housing, but housing prices may actually rise as people can afford to pay a more expensive rent.\n\nIn many countries in Europe we can already see that the influx of refugees and asylum seekers have caused a huge stress on the public finances; unemployment rates among refugees are very large and there are limits to the amount of unemployment benefits the tax money can buy. I assume this problem you kiwis do not have to worry about.",
				"added": 1524599830
			}
		],
		"1525120316_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 17,
				"body": "I have not been able to load it either since the end of March. It only works on a different computer where I have had the site already downloaded since previously. Even made a thread about it here: [/Talk.ZeroLSTN.bit/?Topic:1523130188_195oGGXB8AhwWSoXFHpbVT4TL4wLi1Af5e/Site+fails+to+download](/Talk.ZeroLSTN.bit/?Topic:1523130188_195oGGXB8AhwWSoXFHpbVT4TL4wLi1Af5e/Site+fails+to+download)\n\nThe [ZeroLSTN account on ZeroMe](/Me.ZeroNetwork.bit/?Profile/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj/) was active only a few days ago, so I still hope it will be resolved.",
				"added": 1525288477
			}
		],
		"1526368251_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 18,
				"body": "You can still try to complain, or even ask the landlord nicely to enable UPnP Port Forwarding in the router. Assuming they don't want to give away the admin password.",
				"added": 1526412242
			}
		],
		"1527279034_1NkRbczBVD8gsCG5PMsS1b2gN63srsqYvp": [
			{
				"comment_id": 19,
				"body": "The think I got the most triggered by an embedded Instagram picture on a news site, that could not be displayed because I was logged in with my Instagram account and it refused to display any pictures before I accepted their new privacy agreement. In Private Browsing mode it of course worked fine, because I was not logged in so there was no privacy agreement to accept, but I was unable to log out from Instagram because I would have had to accept their agreement before I could do anything.\n\nApparently, without accepting Instagram's new privacy agreement, all you can do is terminate your account (they actually made a button for that). But you can't log out from the site or access your account in any other way. THAT'S TOTALLY RETARDED!!!",
				"added": 1527279400
			}
		],
		"1527243612_1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQ": [
			{
				"comment_id": 20,
				"body": "First link is a zite called *Tranzit*. Second link is a Merger zite with CDN (IFS Cluster), which will be added automatically by the first zite. To me it seems the site is storing HTML files, with the purpose of archiving or mirroring websites from Clearnet. Currently contains some copies of Google searches and a thread on Stackoverflow.\n\nBut seriously OP, @ppload3, it really seems this could be a interesting project, how in your right mind can you be unable to provide any description whatsoever of the project you are linking to???",
				"added": 1527280181
			},
			{
				"comment_id": 21,
				"body": "@ppload3: oh, sorry. I assumed it was your own site at first.",
				"added": 1527288106
			}
		],
		"1528558109_1JqrogiDCFGRVVrCdxwP93wurKDSgUCk4E": [
			{
				"comment_id": 22,
				"body": "Nowadays I use my mail server primarily for the purpose of receiving mail. Previously I used to forward mail sent to my personal domain to a Gmail or Outlook address, but at some point particularly Outlook started to apply very strict spam filtering, which caused important mail (for example a notice about termination of my housing benefit) to end up in the Spam folder in Outlook, or in some cases it was even discarded completely. With my own mail server however I can be sure that I receive every piece of mail that is sent to me.\n\nAll outgoing mail has to pass through my ISP's SMTP forwarder. When sending mail to most destinations, Gmail included, it usually works just fine and the mail ends up in the recipients Inbox. However, Outlook seems to be the exception, as I'd say 60 % of the mail end up in Spam, or is discarded completely. This is one of the things I hate the most with Outlook; you can not be sure the email will even end up in the Spam folder, because it can be discarded completely and the sender won't be notified of this. Gmail also occasionally seems to reject some mail without even putting it in the Spam folder, but in Gmail's case the email is rejected (so the sender will get a bounce notification that the email was not delivered), while Outlook silently discards it.\n\nI have a friend who is also running his own mail server. He usually complains particularly about Gmail being too strict with what mail they accept, while I think Gmail usually works quite OK while Outlook is the big problem. However, he has a business internet connection, which means his server can send outgoing email directly as his port 25 is not blocked. However, as I have my server on a residential internet connection, port 25 is blocked so I have to send all mail through my ISP's SMTP forwarder, which means any of the ISP's customers could be sending spam and have the SMTP server on a blacklist.\n\nWhether you should send mail from your own dedicated IP address, or use your ISP's SMTP server, might depend on what mail you will be sending. If you'll only be sending verified mail you know is not spam, it might be a good idea to use a dedicated IP address as it is unlikely it will end up in a blacklist as long as you do not send any spam. If however you'll be forwarding mail to a Gmail/Outlook account, which will include forwarding of any spam emails as well, it might be better to use your ISP's server as that server is likely used for sending other legitimate mail other than yours, which might increase it's reputation and not cause it to end up on a blacklist even if you forward a few spam emails.\n\nPlease note that these opinions are solely based on my own observations of running an email server, so they are not necessarily that accurate. The volumes I have on my server is about 10-15 incoming mails/week and 0-2 outgoing mails/week.\n\nIn conclusion, you will learn a lot by setting up your own mail server, and if you ask me, it's also great fun. As long as your recipients does not use Outlook, it might also work quite well.",
				"added": 1528572469
			}
		],
		"1526254848_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 23,
				"body": "Hmm, that guy's data.json file is 7,6 MB at the moment, while the total size of KopyKate is 18 MB. Which means 42 % of the total size of KopyKate is content from a single user.",
				"added": 1528648461
			}
		],
		"1528582989_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 24,
				"body": "Finally someone came up with a reasonable design for air born parcel delivery. Using a fixed wing airplane is much more efficient than the drones Amazon etc is using. A drone wastes a lot of energy to keep itself hovering in the air, requiring large batteries, etc, while an airplane is very efficient and can stay up in the air for a long time without recharging.",
				"added": 1528649348
			}
		],
		"1529186253_1C9xLtM7PisNizDUt1R93vgYHaRN54sKi1": [
			{
				"comment_id": 25,
				"body": "I would assume the battery manufacturer just made a typo/error when specifying the capacity, so they wrote Amps on the battery but actually meant to say Ampere-hours. 1.5 Ah @ 20 V sounds as a perfectly reasonable capacity for a grass trimmer battery.\n\nLet's assume they did not make a typo, but actually meant 1.5 A, then according to your calculations the battery would be able to supply a maximum of 30 W to the motor. This seems way too small to me, the motor in a grass trimmer probably needs closer to 100 W to be able to operate.\n\nYou can convert between Ah and mAh by just multiplying by x1000: 1.5 Ah = 1500 mAh.\n\nIf you want to measure the actual capacity, you can for example use this: https://hobbyking.com/en_us/imax-b6-50w-5a-charger-discharger-1-6-cells-genuine.html",
				"added": 1529235416
			},
			{
				"comment_id": 26,
				"body": "@ssdifnskdjfnsdjk: now you are talking about AA (alkaline/NiMH) batteries, they have a quite different chemistry than the (I'd assume) Li-ion batteries found in a rechargeable grass trimmer battery. With Li-ion batteries, you can only measure the current charge - not their condition - by measuring open circuit voltage. A fully charged Li-ion battery will have 4.2 V when fully charged, regardless of its condition. Only when you start loading the battery will you be able to know what condition it is.\n\n@sirius17: I browsed through some specifications on different grass trimmers, I found one from Makita with a 1.3 Ah 18 V battery where they specified a 20 minute runtime. So I don't think you can assume at least one hour runtime.",
				"added": 1529236341
			}
		],
		"1529242468_195oGGXB8AhwWSoXFHpbVT4TL4wLi1Af5e": [
			{
				"comment_id": 27,
				"body": "I see your point, but for me ZeroNet is very effortless. You can just click on the link and it will start streaming within <10 seconds. While if you use public torrents, you have to first connect to a VPN, and if you use a private tracker you also have to reserve time for seeding back. While on ZeroNet, a video might have 5 seeders, then I consider the possibility that one of them will be a copyright troll that monitors illegal file sharing so small, that I without problem can watch the video without thinking about a VPN.",
				"added": 1529243715
			},
			{
				"comment_id": 28,
				"body": "> [quantumkitty](#comment_148_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Once I add categories and a featured video page, I'll do some encoding of my own.\nIf ZeroMe proved you can resize images and do JPEG compression in Javascript, it must be possible to do the same with video files!\n\nAlternatively process the videos on a centralized encoding server maybe, which is probably a more efficient way.",
				"added": 1529350462
			}
		],
		"1532864513_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 29,
				"body": "Check that your testscript2.sh is executable: `chmod +x testscript2.sh`",
				"added": 1532873472
			}
		],
		"1533957797_1Bcm7BpVuYsQaE8wGB8CrLWzef32rrMy1r": [
			{
				"comment_id": 30,
				"body": "My guess is because of the **lighting network** that have recently became supported by more vendors, which makes it possible to make Bitcoin transactions without using the blockchain and paying the fees of its use.",
				"added": 1534035245
			}
		],
		"1571457668_1EDsNLHRwPW8Ajp4dScjJaBxXK1bLqHx3Z": [
			{
				"comment_id": 31,
				"body": "If you need access to some proper tracker, I have few invites on Torrentday.com. Just send me a PM.",
				"added": 1572393307
			}
		],
		"1572813299_1GJahzjcad43Dq8GUGwqN5xBZX5GqhN5Yn": [
			{
				"comment_id": 32,
				"body": "Check https://digitalrivermirror.com/\n\nThe one you want is most likely en_windows_7_ultimate_with_sp1_x64_dvd_u_677332.iso\n\nDigitalriver was a service provided by Microsoft that used to host ISO images for Windows 7. They took it down at the time of the release of Windows 10, but for example the mirror above is still available.",
				"added": 1572815721
			}
		]
	},
	"comment_vote": {
		"179_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1
	}
}