{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "бэкдоры закладки в процессорах intel amd",
			"body": "https://www.youtube.com/watch?v=23-bb_qda-g",
			"added": 1559233270
		},
		{
			"topic_id": 2,
			"title": "Илон маск конкурент роскосмоса запустил спутниковый интернет",
			"body": "https://www.youtube.com/watch?v=inP8ESkuCU4",
			"added": 1559568903
		},
		{
			"topic_id": 3,
			"title": "Чурки охуели где скинхеды ? неужели путятишна всех пересажала",
			"body": "Каково быть чуркой в России? (Часть 1)\nhttps://www.youtube.com/watch?v=k9Q_sV0LTI8&t=5s",
			"added": 1559998579
		},
		{
			"topic_id": 4,
			"title": "вскрытие замков эльбор,mottura,CISA,гардиан,меттэм,CRIT,бордер,керберос",
			"body": "вскрытие методом самоимпрессии он же самонаборный ключ хочу привлечь внимание общественности\n\nhttps://www.youtube.com/watch?v=ps0Xugob0wY\n\nhttps://www.youtube.com/watch?v=pK9Bgls6FS8\n\nhttps://www.youtube.com/watch?v=hIwx5MeV4QI\n\nhttps://www.youtube.com/watch?v=7kzysrJx1B0\n\nhttps://www.youtube.com/watch?v=IOKvjKPQZhc\n\nhttps://www.youtube.com/watch?v=HBuBdxspeVk",
			"added": 1560623644
		}
	],
	"topic_vote": {
		"3_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"1_1KkWh8XZMKs3dYGuc7XXYncfCvsY2NUPg1": 1,
		"4_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": 1,
		"2_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5": 1,
		"1_1DESK8jcspe5Vm7YzVunRWbirYNLBtVPWF": 1
	},
	"next_comment_id": 12,
	"comment": {
		"1_1PR4t74Qa3uWZuAUyPs6yPZm2kzuQdN3q7": [
			{
				"comment_id": 1,
				"body": "их много но все они дермовые пока что",
				"added": 1558269623
			}
		],
		"1_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs": [
			{
				"comment_id": 2,
				"body": "Вот сайт на нем много файлообменных программ http://127.0.0.1:43110/1P5Sybb44xTi6T6o5e2buZ8SR1zdsbX3Ae/?Home",
				"added": 1558269887
			}
		],
		"2_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 3,
				"body": "в zeronet практически нет поиска так что ваши блоги все равно мало кто надет вот и вся разница заткнуть рот",
				"added": 1558270035
			}
		],
		"1_1Kgy2CdXdjNQSjK6pkLasWjmza9KQ1uZE4": [
			{
				"comment_id": 4,
				"body": "при грамотном использовании да есть поддержка шифрования трафика и его рандомизация",
				"added": 1558270152
			}
		],
		"1_1KzPxuhxTzgwGJozhLkZqXXcJYuZ6WiXSi": [
			{
				"comment_id": 5,
				"body": "jami идеально работает в offline https://jami.net/",
				"added": 1558270311
			}
		],
		"1_1CjXSjhpi742HFZts17YvN1U1v9CfrWHsq": [
			{
				"comment_id": 6,
				"body": "> [if0](#comment_22_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Сам факт использования Питона в неком проекте способен сказать слишком многое о нем. Как минимум, что он никогда не будет доведен до своего финала и в нем постоянно будут вылазить \"совершенно неожиданные\" баги в изрядном количестве.\n> Почему? Подсказка: проект так и останется работающим прототипом, созданным в спешке ради как можно более быстрого демонстрирования базовых возможностей. Тесты? Нет времени на написание тестов, у нас еще не все обещанные в роадмапе фитчи зарелижены и критческие баги не пофикшены...\n\n+5 tribler который на питоне уже 15 лет в разработке а толку нет",
				"added": 1558502721
			}
		],
		"8_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 7,
				"body": "нихрена он не безопасен эльбрус тоже вроде как в таиланде делают вернее сам кристал так что в нем из российского только название",
				"added": 1559530757
			}
		],
		"1_14F7aQfZ8Vq1cbnVrj7HybMy8MtWhwP7o2": [
			{
				"comment_id": 8,
				"body": "И ТАК что такое Протокол - это совокупность правил, в соответствии с которыми\nкомпьютеры общаются между собой в сети ( локальной и глобальной )\nДля каждого из протоколов TCP и UDP, стандарт определяет возможность одновременного выделения на хосте\nдо 65536 уникальных портов, идентифицирующихся номерами от 0 до 65535.\nПри передаче по сети номер порта в заголовке пакета используется (вместе с IP-адресом хоста)\nдля адресации конкретного приложения (и конкретного, принадлежащего ему, сетевого соединения)\nобъясняю проще то есть есть один ip адрес 7.7.7.7 а сетевых программ на компьютере может быть много\nкак же сделать так чтоб на одном ip адресе 7.7.7.7 смогли работать сразу несколько программ одновременно\nответ прост каждая программа должна иметь свой уникальный порт\nпо стандарту есть диапазон портов от 0 до 65535\nили так\nсетевой порт - условное число от 1 до 65535, указывающее, какому приложению предназначается пакет\nто есть каждая программа написана таким образом чтоб выходить в интернет через определенный порт\nпорты могут блокировать три вещи 1-брандмауэр windows,2-фаервол антивируса, 3-ваш роутер, 4-ваш провайдер\nесли отключение всех возможных фаерволов и проброс портов в роутере\nне помогают то звоните вашему провайдеру или меняйте его.\n\nс открытыми портами вы сможете хостить у себя на домашнем компьютере любые игровые сервера,\nраздавать торренты, размещать сайты на домашнем ПК, поднимать почтовые сервера, управлять своим ПК\nиз любой точки мира посредством RDP или SSH, ДО И МНОГО ЧЕГО ЕЩЕ\n\nи так демонстрация на провайдере дом. ру брандмауэр я отключил антивирусом я давно уже не пользуюсь в\nроутере я порт открыл можно и открыть весь диапазон портов от 0 до 65535",
				"added": 1559546813
			}
		],
		"2_1532gmVR6nUwMS85i4JTgiqQY1rn44pkd3": [
			{
				"comment_id": 9,
				"body": "телеграмм не безопасен вот хорошая альтернатива https://jami.net/",
				"added": 1559619093
			}
		],
		"1_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N": [
			{
				"comment_id": 10,
				"body": "зади в зеро блог там все обновления по датам раписаны",
				"added": 1559749450
			}
		],
		"3_1Gi18HRMzqfWFmZU3D1wBjESbFxAkmSnEF": [
			{
				"comment_id": 11,
				"body": "> [x418synth](#comment_2_1EFhXfFwH97coL14ZYb1WCUPaHemXJby2y): Неонацисты в пынинской эрефовке это среднеазиаты, кавказцы и закавказцы. \"Чурки\" теперь и есть скинхеды, чувак.\n\nвозможно вы правы",
				"added": 1560420538
			}
		]
	},
	"comment_vote": {}
}