{
	"message": [
		{
			"body": "There's also the issue of the parameter including the protocol itself, meaning we can't simply map it to 127.0.0.1:43110/%s",
			"date_added": 1460190686698
		},
		{
			"body": "So either zeronet needs to update the resolver, or there needs to be an intermediary. Like have it map to: 127.0.0.1:43110/zeronetshortlink.bit/%s and then have that site redirect people.",
			"date_added": 1460190969650
		},
		{
			"body": "Still looking stuff up though. Another alternative seems to be to map it to an external program, and then have that program open the default browser with the adjusted link",
			"date_added": 1460191019356
		},
		{
			"body": "It's like 1am here.",
			"date_added": 1460191847575
		},
		{
			"body": "2 actually :\\",
			"date_added": 1460191858241
		},
		{
			"body": "Hmmm",
			"date_added": 1460194451461
		},
		{
			"body": "zero://kaffiene.bit",
			"date_added": 1460194478402
		},
		{
			"body": "Link isn't resolved in the chat?",
			"date_added": 1460194490644
		},
		{
			"body": "I was having issues resolving the '0net'. Presumably it was due to the number. And the chat isn't linking it out to 0net:// urls anyway. It just reprints them to be local to what you're currently using. So it didn't really help with testing :\\",
			"date_added": 1460195388627
		},
		{
			"body": "Either way, I got the zero:// urls redirecting. But it doesn't work in chrome at all...",
			"date_added": 1460195431490
		},
		{
			"body": "Seems to be broken in opera as well. I think the 'nonce' thing is breaking it.",
			"date_added": 1460195521420
		},
		{
			"body": "Just an FYI you guys, nullfolder/zeromail2 use webtorrent. It won't download regular torrents.",
			"date_added": 1470211279067
		},
		{
			"body": "Well, webtorrent /can/ download regular torrents. They just need seeds that support webtorrent. Vuze does this.",
			"date_added": 1470216319550
		},
		{
			"body": "So on vuze, you can set 'seed webtorrent' or w/e. Or on the webtorrent client you can seed regular torrents, and have other webtorrent clients pick it up, like nullfolder.",
			"date_added": 1470216349745
		},
		{
			"body": "Webtorrent is completely javascript based. As you remain on the page you can seed/download. When you leave, it stops. It uses WebRTC to do this. No backend server required.",
			"date_added": 1470261346004
		},
		{
			"body": "The KAT clone is neat. Still really buggy though.",
			"date_added": 1470658786396
		},
		{
			"body": "Same. I'm on 4.0 and it's running fine.",
			"date_added": 1470832788642
		},
		{
			"body": "Nope. I just clicked 'update' from ZeroHello.",
			"date_added": 1470833631653
		},
		{
			"body": "I'm gonna be honest, I hate emoji",
			"date_added": 1470895302181
		},
		{
			"body": "Yea, ZeroMe's working fine now. There's still some residual files in the blue hub, but they're harmless and aren't messing with anything.",
			"date_added": 1470896217865
		},
		{
			"body": "RIP flyman",
			"date_added": 1470899066162
		},
		{
			"body": "It's to allow the sites to properly merge or something. Just dot it :P",
			"date_added": 1470899216885
		},
		{
			"body": "D:",
			"date_added": 1470899252600
		},
		{
			"body": "No difference. The only actual difference is if you only seed one hub, then you can only see people of that hub, rather than both.",
			"date_added": 1470899382874
		},
		{
			"body": "You can only join one hub. If you try to join both, it messes stuff up. Which is what we were talking about earlier.",
			"date_added": 1470899401341
		},
		{
			"body": "Is there really only ~70 people on ZeroMe? For how many zeroids there are, that's not very many.",
			"date_added": 1470899597510
		},
		{
			"body": "I just picked the top one, and that I like red better, lol. It's also the hub with nofish. I found most of the people I follow is on there too. It doesn't really matter though. You literally can't see the hubs unless you're looking for them.",
			"date_added": 1470899818412
		},
		{
			"body": "@bot@zid: Now no one will follow you :P",
			"date_added": 1470899875589
		},
		{
			"body": "I realize. I meant that no one would follow you because now there's three hubs to seed instead of just 1 or 2.",
			"date_added": 1470900155258
		},
		{
			"body": "Those kilobytes really add up you know.",
			"date_added": 1470900166747
		},
		{
			"body": "Not really a chat. It's more like twitter, IMO. You follow people, post stuff, and then comment. Err... Perhaps like facebook then?",
			"date_added": 1470900635511
		},
		{
			"body": "Basically, each user has a page with a bio and their posts they make (little blips/thoughts/etc). Other users can like/comment (much like ZeroTalk). You can follow people to have their posts pop up on the main zerome page in your feed. This makes it easier to follow people you like. If you don't follow or care to read any posts by anyone in a particular hub, you don't need to seed that hub and can save on bandwidth/HDD. Later on, image posting and such will be added so you can share photos/images/screenshots/etc. And that's pretty much it so far.",
			"date_added": 1470901183811
		},
		{
			"body": "Yea, I saw you follow flyman, and the link for that was the infinity hub. However, on the all-users page, he comes up as blue.",
			"date_added": 1470901690963
		},
		{
			"body": "Aren't ZeroMe bugs *fun*?",
			"date_added": 1470902241087
		},
		{
			"body": "The hell? When going to flyman's blue hub page, the follow button links to the infinity page. How the heck does that happen?",
			"date_added": 1470902436186
		},
		{
			"body": "Why do you keep following those glitched profiles?",
			"date_added": 1470903198387
		},
		{
			"body": "No worries. We were actually just discussing that over on one of newuser123's posts. It doesn't appear to be the whole list of people they follow either (well, for the lower amounts it is).",
			"date_added": 1470903408661
		},
		{
			"body": "On your profile,click on the avatar. It should pop up a thing to select a picture.",
			"date_added": 1470903521916
		},
		{
			"body": "@flyman@zid: AFAIK, it's perfectly fine with any jpg or png. It'll resize automatically if it's not the proper size/ratio.",
			"date_added": 1470904584435
		},
		{
			"body": "Lol. How do you operate this slowly? I'm confused at how someone who found their way onto ZeroNet is having such a hard time with social media. Old? Tech-illiterate? Just taking your time? I'm genuinely curious.",
			"date_added": 1470905285365
		},
		{
			"body": "For my picture, I just grabbed a pic of an anime character I like that I had on my harddrive already.",
			"date_added": 1470905355576
		},
		{
			"body": "I got the same problem right after visiting bot's link. Fix? And @bot@zid why does that 1nfinity site keep breaking everything I hold dear to my heart? Causes weird errors in the console, broke the znet homepage, etc.",
			"date_added": 1470906469142
		},
		{
			"body": "Yup. I was wondering the same thing. I won't pop up. I just get the links to the demo site instead. I can't get the feed to come back.",
			"date_added": 1470917204114
		},
		{
			"body": "It's the same image, just properly cropped/resized. I was real lazy when I first uploaded it, haha.",
			"date_added": 1470917448868
		},
		{
			"body": "@tkarita@zid: That really needs to be fixed.",
			"date_added": 1470958931011
		},
		{
			"body": "Lol. I'm very wordy. My reddit accounts are the same way. I frequently hit the 10k character limit, and I have the highest (besides nofish) limit on ZeroTalk.",
			"date_added": 1470959670392
		},
		{
			"body": "I'm not overly concerned about karma. But I'm at like 90,000 comment karma. Link karma I don't have so much of (only like 3k) because I never submit anything, just comment, lol.",
			"date_added": 1470960129511
		},
		{
			"body": "@quadrangle@zid: Nope. But apparently I have enough karma to qualify.",
			"date_added": 1470960382582
		},
		{
			"body": "@quadrangle@zid: Yea... kinda defeats the purpose of having multiple hubs right now. Both hubs are basically being seeded by everyone. I feel like it'll get a lot more important as ZeroNet starts to grow.",
			"date_added": 1470965474569
		},
		{
			"body": "@tkarita@zid: I honestly have no idea.",
			"date_added": 1470966794929
		},
		{
			"body": "In the side bar of the actual hub site (not on ZeroMe), you can see your limit next to \"identity address\". But I was just looking in the actual zite folders.",
			"date_added": 1470967179066
		},
		{
			"body": "Can someone help test my new hub? Visit my profile @ http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh/kaffie@zeroid.bit",
			"date_added": 1470971900560
		},
		{
			"body": "Err... 0net://Me.ZeroNetwork.bit/?Profile/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh/kaffie@zeroid.bit",
			"date_added": 1470971919386
		},
		{
			"body": "Links so broke.",
			"date_added": 1470971937481
		},
		{
			"body": "Links so broke.",
			"date_added": 1470971941662
		},
		{
			"body": "Well, hidden hubs are definitely possible. But given how hard it is to kickstart one, I really doubt it. I'm pretty sure Bot and I are the only ones to clone a hub.",
			"date_added": 1470985621951
		},
		{
			"body": "Even hidden hubs can be used on ZeroMe though, since it's based on hubs you're personally seeding.",
			"date_added": 1470985684285
		},
		{
			"body": "But I think they'd probably show up in the user list :\\",
			"date_added": 1470985704104
		},
		{
			"body": "AFAIK, you can't delete other people's comments, because it's signed by their keys. You can delete the \"Hello, ZeroMe\" post the same way you can delete anything else: click the pencil and then hit 'delete'.",
			"date_added": 1470987531385
		},
		{
			"body": "As an FYI, I know the default post is deletable, since I accidentally deleted mine.",
			"date_added": 1470987546112
		},
		{
			"body": "@flyman@zid: That sounds like a glitch then.",
			"date_added": 1470987812467
		},
		{
			"body": "@bot@zid: Go look at the ZeroMe content.json, and snag that 'default hubs' bit and add in infinity and kaffie hub.",
			"date_added": 1470987924200
		},
		{
			"body": "I wrote up a response",
			"date_added": 1471060179677
		},
		{
			"body": "The big issue is that the 'hub' variable doesn't actually point to your home hub. Instead, your posts/followers/bio/etc. is determined by the URL and improperly fetches things.",
			"date_added": 1471060237400
		},
		{
			"body": "@bot I can't find your comment starting with: \"Is it worth you making a vanity url for your hub to save ppl's eyeballs a \"",
			"date_added": 1471061322535
		},
		{
			"body": "Nvm. I found it. For some reason you commented on my first red hub post.",
			"date_added": 1471061808173
		},
		{
			"body": "Umm... there shouldn't be any duplicate posts. Neither of my json files have duplicate entries. If you're seeing something wrong, it's wrong on your end.",
			"date_added": 1471062359649
		},
		{
			"body": "Hmm... I had no issues making a quick zerome clone. The only issue I could duplicate was the one where the db misses ~100kb.",
			"date_added": 1471070330853
		},
		{
			"body": "Hmm... I had no issues making a quick zerome clone. The only issue I could duplicate was the one where the db misses ~100kb.",
			"date_added": 1471070336728
		},
		{
			"body": "@bot@zid: Are you sure that your 'hub' variable is pointing back to your proper home hub? Activity content disappearing is a huge symptom of that. And looking at Kaffie Hub's data, you still have your hub pointing to Kaffie Hub, rather than to Infinity. ZeroMe currently has a glitch that logs you in differently if you have a multi-hub thing going on.",
			"date_added": 1471076145040
		},
		{
			"body": "I've never had any syncing issues, nor activity feed issues with my ZeroMe clone. It was all very straight forward. Copy the files (no need to even rebuild!) and fix the content.json. As I said, if you're having issues, it's something you're doing wrong.",
			"date_added": 1471078388037
		},
		{
			"body": "I didn't publish my ZeroMe clone. It's all local at the moment. I use the zite for other things (I did some streaming tests on it, as well as a protocol handler test). If you check Kaffie@nanasi on ZeroMe, those posts are made using my local ZeroMe clone.",
			"date_added": 1471079742759
		},
		{
			"body": "0net://Me.ZeroNetwork.bit/?Profile/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/1HcA3u4SiSGCbdzunNZPUumwcv7xBrzYff/1HcA3u4SiSGCb@nanasi",
			"date_added": 1471079817603
		},
		{
			"body": "It shouldn't be. But it's kinda fucky right now. Signing isn't working properly for some reason. Not sure what's up.",
			"date_added": 1471094617655
		},
		{
			"body": "What a headache. So I fixed the kaffieid stuff, so that should all be working now. But now ZeroMe updated and messed up my login stuff. Luckily I had a backup of the old version, so I can still use that for now.",
			"date_added": 1471098244930
		},
		{
			"body": "Everything is breaking horribly, lol",
			"date_added": 1471099586440
		},
		{
			"body": "-_____- why does cert signing have to be such a pain?",
			"date_added": 1471137902427
		},
		{
			"body": "And what the hell does 'cert_sign' do anyway? It seems to be useless and just breaks everything",
			"date_added": 1471137917586
		},
		{
			"body": "Yea, that's determined by the cert_user_id in the various content.json files.",
			"date_added": 1471140372444
		},
		{
			"body": "well... If two people have the same cert_user_id, everything goes to shit, since the login is deteremined based on cert_user_id, rather than auth_address. That's awful for the decentralization of zeronet, as it requires everyone to have a unique cert_user_id",
			"date_added": 1471140630558
		},
		{
			"body": "@flyman@zid: The same file gets the same hash. It's very unlikely that two different files would have the same hash.",
			"date_added": 1471161946461
		},
		{
			"body": "@tkarita@zid: No way to figure out who owns a site AFAIK. Creating a site just makes a public and private key. And you can do so without needing any sort of ID or cert. The only way to know is if someone says.",
			"date_added": 1471213652546
		},
		{
			"body": "Why not just make a torrent merger site, and have the various hubs to store the data on. Would work much better.",
			"date_added": 1471240797555
		},
		{
			"body": "Since we're talking about copyright, I just wanted to chime in and say I'm 100% against it. Copyright as a thing shouldn't exist. Intellectual property shouldn't be a thing. And so on.",
			"date_added": 1471246362961
		},
		{
			"body": "It's the same as censorship",
			"date_added": 1471246372165
		},
		{
			"body": "@quadrangle@zid: I went looking for a torrent of it, found one, and the comments said \"fake, you fucking idiots should go pay for the movie\". I died laughing.",
			"date_added": 1471317596310
		},
		{
			"body": "@bot@zid: For how easy it is to make a hub, I'm surprised this isn't a thing.",
			"date_added": 1471385577309
		},
		{
			"body": "@bot@zid: Speaking personally, the centralized viewer/hub is a big turnoff. It was glitchy (and still is a bit), and lacks the ability to opt out of infinityhub posts. Which sort of defeats the point of merger sites, tbh.",
			"date_added": 1471385923577
		},
		{
			"body": "It's clearly the merged issue. Dark ZeroMe seems fine. And my hub still clearly works. Has nothing to do with censorship, just architecture.",
			"date_added": 1471386432596
		},
		{
			"body": "Can you link to the code that explicitly blocks your hub? From what I've seen, the latest update just revokes merger site permissions from hub sites. Which is how it should've worked from the beginning.",
			"date_added": 1471387101214
		},
		{
			"body": "https://github.com/HelloZeroNet/ZeroNet/commit/8cd7a634909a804d59f19360594f4ce55050d3f4",
			"date_added": 1471387247471
		},
		{
			"body": "That's the code that appears to be revoking your merger permissions, as you run the merger site with your hubs, and the hubs get merger access revoked. That means: redhub, bluehub, greenhub, kaffiehub, infinityhub. But infinity hub is also the viewer, so the merger permission for the viewer is also revoked, because it's the same site.",
			"date_added": 1471387307936
		},
		{
			"body": "Running a hub is useful, because it separates the stored data from the display logic. You can make multiple viewers to show the same data, or you can keep the same viewer, but switch the data set. To do your infinity thing, where it's both a hub and a viewer, don't even bother making the data a hub. Just rewrite the code to access it locally, and then the other hubs through the merger permission.",
			"date_added": 1471387380565
		},
		{
			"body": "The only issue with that, is that infinity posts won't be merger data.",
			"date_added": 1471387444741
		},
		{
			"body": "Right. As I said, you can easily keep the viewer code, and just migrate the same site's data as just local stuff. Defeats the purpose when you could just run your own separate hub and resolve all the issues anyway though. I'm confused at what point there is to running a merger site and it's hub on the same site.",
			"date_added": 1471387861898
		},
		{
			"body": "@bot@zid: Mainly because the whole point of decentralization is to ensure one guy doesn't have monopolistic control. And yea, people are definitely struggling with the basics. I think it's due to the API and documentation being in coffeescript, which no one uses.",
			"date_added": 1471393576341
		},
		{
			"body": "@quadrangle@zid: That's another big reason why separating the hub from the viewer is important. So you don't have to host everything. But yea, I'm definitely curious what the solution for getting around massive HDD requirements are. Hosting something like the pirate bay is easy enough, since it's all text. Once you get images and video, it gets more complicated.",
			"date_added": 1471394543163
		},
		{
			"body": "You'd need to download the site anyway to view it. Downloading the site each visit sort of defeats a lot of benefits of zeronet too. Either way, there's already something like that: optional files. They let only people who've looked at the optional file download and seed it, and every one else doesn't have to. And there's options to 'host everything' if you want.",
			"date_added": 1471395669502
		},
		{
			"body": "@quadrangle@zid: I'm laughing so hard at those images :P. But yea, that's more or less a description of how optional files work. And the site @tkarita@zid linked is a good example of it.",
			"date_added": 1471398874481
		},
		{
			"body": "@quadrangle@zid: Indeed. But that's the same for any decentralized thing. Someone always has to host the bitcoin blockchain, or ZeroTalk, or w/e. And yea, the difficult part would be to spread the pieces across users to ensure the site is online. Perhaps have an option to say how much of the site you want to seed, and when you go offline, you ensure at least someone else has the part you're seeding?",
			"date_added": 1471399098168
		},
		{
			"body": "I always miss everyone. I come here to the chat and the last message is always like 4 hours ago. Lol.",
			"date_added": 1471846572785
		},
		{
			"body": ":\\ every time I fix something, I turn around and break something else",
			"date_added": 1471867875091
		},
		{
			"body": "All my signing/publishing/syncing for kaffiehub",
			"date_added": 1471869133812
		},
		{
			"body": "Can you check to make sure at least stuff's working for everyone else? Like my posts are visible and such?",
			"date_added": 1471869149986
		},
		{
			"body": "Do you see my latest comment response to P2P?",
			"date_added": 1471869268148
		},
		{
			"body": "Yea, posted just a few minutes ago.",
			"date_added": 1471869393547
		},
		{
			"body": "And I saw you liked my KaffieID demo post I just posted. So I think everything's working again.",
			"date_added": 1471869411768
		},
		{
			"body": "Had to mod my ContentManager.py file with: 'def verifyCert(self, inner_path, content): return True\" to get it working. Otherwise it'd just kill everything and not download the files back.",
			"date_added": 1471869510377
		},
		{
			"body": "It's pissing me off. I have no idea why it keeps breaking :(",
			"date_added": 1471932763291
		},
		{
			"body": "I'm really unsure. What I did was generate a new Pub/Private key pair using python rather than the bitcoin.js, and then I basically formatted the check string to include the name. Refreshing everything and it's starting to show up. Switching names seems to allow you to publish fine, but the name in the content.json still remains otherwise you get a publish error. I still haven't tested cross-hub posting, which might lead to problems, since I did some config stuff on kaffiehub to accept kaffieids (which I had to change to the pub key of the keypair, rather than the ID site).",
			"date_added": 1471934343186
		},
		{
			"body": "Regardless, I'm still getting these weird sidebar errors. Where it fails to find the content.json of the generated pubkey for a site and so the sidebar fails to load. I've seen it on my fresh install, bit.no proxy, and my main machine.",
			"date_added": 1471934478512
		},
		{
			"body": ":D Swapping the IDs worked! Just had to change the cert_sign and the name in the content.json and it updated appropriately!",
			"date_added": 1471934704978
		},
		{
			"body": "Also: \"Internal error: TypeError: 'unicode' object does not support item assignment UiWebsocket.py line 98 > UiWebsocket.py line 177 > SidebarPlugin.py line 599 > SiteStorage.py line 121 > Db.py line 316\"",
			"date_added": 1471934936890
		},
		{
			"body": "When I try to rebuild the database in ZeroMe.",
			"date_added": 1471934946685
		},
		{
			"body": "Hmm... Cross-hub posting seems to be busted. Since the default hubs only give permission to zeroids, you can't comment/like stuff in them with a kaffieid. Seems like a huge problem for merger sites, since the whole point is that they may not have the same permissions.",
			"date_added": 1471935239259
		},
		{
			"body": "Seems like a problem if someone's going about posting in their hub just fine, and then run into publishing errors and see their glitched post since the other hubs don't accept their ID.",
			"date_added": 1471935284529
		},
		{
			"body": "I have a few. xubuntukaffie@kaffie.bit is the newest. It's using the ID tweaks, and it's on a fresh xubuntu/zeronet install.",
			"date_added": 1471935775848
		},
		{
			"body": "There was also the @zeroid.bit one, which I just deleted.",
			"date_added": 1471935789183
		},
		{
			"body": "zeroid*",
			"date_added": 1471935795884
		},
		{
			"body": "Kaffie@Kaffie.bit is the one on my main machine, and what I was using before the tweaks. After the tweaks I wasn't sure if it was working because I own KaffieHub, or if it was working on it's own merit.",
			"date_added": 1471935890782
		},
		{
			"body": "@tkarita@zid: I just rewatched Hackers the other day. Great movie.",
			"date_added": 1472083968358
		},
		{
			"body": "I'm testing the old key. Everything should be good to go. Please try registering a KaffieID and using it on my blog or on KaffieHub.",
			"date_added": 1472085746316
		},
		{
			"body": ":D I can see it just fine.",
			"date_added": 1472086090715
		},
		{
			"body": "Such a dumb fix too. I just was using the wrong public key on the content.json :|",
			"date_added": 1472086290770
		},
		{
			"body": "@bot@zid: That's the best part of the new revision. Bug was obnoxious",
			"date_added": 1472208795714
		},
		{
			"body": "Yea, it'd give an obnoxious error seemingly randomly when you opened the sidebar. Apparently it happened whenever you didn't have a cert selected. Was absolutely obnoxious when debugging stuff.",
			"date_added": 1472209402769
		},
		{
			"body": "I couldn't ever get that new DNS to work :\\. Always fails to download.",
			"date_added": 1472263876596
		},
		{
			"body": "Nice. Though, it's pretty much identical to ZeroName :\\. I was expecting like a submit button and such.",
			"date_added": 1472286566620
		},
		{
			"body": "The owner of the site should sync it up with a local namecoin blockchain, just to get the decentralization going.",
			"date_added": 1472286602122
		},
		{
			"body": "@tkarita@zid: No donations to Kaffiene as of the last time I checked. I don't have the pub/private site keys in my bitcoin wallet, so I don't know if anyone's donated to those.",
			"date_added": 1472342485578
		},
		{
			"body": "I did get a namecoin donation when I first started out though, to help with domains and such.",
			"date_added": 1472342525051
		},
		{
			"body": "@p2p@zid: Huh. My new posts (after aug 20) don't show up the in the proxies. Yet people clearly can see them just fine as I've gotten likes/comments. I wonder what's up?",
			"date_added": 1472421136482
		},
		{
			"body": "Actually, kindlyfire proxy seems to work fine. It's just bit.no that's broken.",
			"date_added": 1472421222614
		},
		{
			"body": "Well... I fixed the problem of my posts not showing up for some people. Apparently I had a typo in my content.json. Used 'auth_type' instead of 'cert_auth_type'. Seems to have fixed it right up.",
			"date_added": 1472425339387
		},
		{
			"body": "@tkarita@zid: @tkarita@zid: I gave bit.no the KaffieID: bitno. Someone seems to have changed it to beezlebub. Should still work regardless, unless someone changed the hub. KaffieIDs only work in KaffieHub.",
			"date_added": 1472425389556
		},
		{
			"body": "Lol. I posted that one last night. Did you see my 2 bug posts? Those also weren't showing up in bitno.",
			"date_added": 1472425814014
		},
		{
			"body": "But seriously though. KSP is pretty awesome now.",
			"date_added": 1472425836584
		},
		{
			"body": ":P. Apparently people who work at nasa are big fans of the game.",
			"date_added": 1472427079323
		},
		{
			"body": "Uploaded some stuff to ZeroTube. Seems to be working on my end. Had to manually enter the info in my data.json, otherwise I couldn't get the torrent into webtorrent to host it. Lots of the vids are reuploads though. http://127.0.0.1:43110/1FUQPLXHimgCvYHH7v3bJXspJ7bMBUXcEb/",
			"date_added": 1472440307466
		},
		{
			"body": "Cosmos Laundromat is a video included with webtorrent desktop. And no, if you skip to the end, you only load the relevant part of the video.",
			"date_added": 1472440922093
		},
		{
			"body": "I haven't really watched any of the videos, lol. I've seen deadpool and the fastcast videos. Haven't watched sintel, cosmos laundromat, and the other freebie movies.",
			"date_added": 1472441147875
		},
		{
			"body": "Yea, it wasn't what I was expecting :P",
			"date_added": 1472441319414
		},
		{
			"body": "I usually don't like superhero movies.",
			"date_added": 1472441325986
		},
		{
			"body": "Be sure to get webtorrent desktop and seed :D",
			"date_added": 1472442585704
		},
		{
			"body": "nope",
			"date_added": 1472442854570
		},
		{
			"body": "Looks neat",
			"date_added": 1472442991307
		},
		{
			"body": "You know, the only problem with me seeding this stuff is that I'm not always online. So anything that only has me as a seeder is gonna die when I sleep, lol. That's why I like the existing webtorrents, they stay up because of multiple seeders.",
			"date_added": 1472443976733
		},
		{
			"body": "Uploaded a couple of electric sheep vids",
			"date_added": 1472444379734
		},
		{
			"body": "Lol. Sirenyc has the shittiest upload ever. I plugged it into webtorrent desktop and it's going at like 20kb/s",
			"date_added": 1472444458117
		},
		{
			"body": "Definitely need more seeders. There needs to be a dedicated host for webtorrents...",
			"date_added": 1472444494362
		},
		{
			"body": "Music video is pretty cool though. I enjoy seeing music from other regions/cultures/languages.",
			"date_added": 1472445003134
		},
		{
			"body": "Lol.",
			"date_added": 1472447210693
		},
		{
			"body": "Uploaded Kung Fury, which is an amazing little indie film.",
			"date_added": 1472447225647
		},
		{
			"body": "Nope. Can I get a link?",
			"date_added": 1472447336677
		},
		{
			"body": "Huh. So it looks like optional files, but with progress tracking. Definitely better than the default options. I dunno if that's still good for a large music/video site though. As you'd be capped based on your quota. Meaning even less content could be uploaded. With just a torrent, you could theoretically have even non-zeronet users help seed the content.",
			"date_added": 1472447646888
		},
		{
			"body": "@tkarita@zid: Torrents have already been 'reinvented' in javascript. That's what webtorrent is :P. It's literally what ZeroTube uses to distribute videos. Can't connect to regular torrents through js/webrtc though. Same likely goes for ipfs.",
			"date_added": 1472447990966
		},
		{
			"body": "@tkarita@zid: I don't see why it would. Just replace all the text in ZeroMe with torrent hashes/magnet links. Not a big deal.",
			"date_added": 1472449045516
		},
		{
			"body": "Oh, then yea, that might be an issue. I wonder if hubs can have optional content? Having several hubs, each with a directory listing of the content, and then having the actual music content be optional files might work. ",
			"date_added": 1472449534340
		},
		{
			"body": "@tkarita@zid: Sweet. I'll look into seeding them for webtorrent.",
			"date_added": 1472535921006
		},
		{
			"body": "Alright. They're up on ZeroTube.",
			"date_added": 1472536609925
		},
		{
			"body": "@bot@zid: ~20 people a day?",
			"date_added": 1472538280969
		},
		{
			"body": ":\\. I like and hate ZeroTube so much that I decided to make my own. I already got a basic player down that's leagues better. And I'm about to clone ZeroMe for a basic template. Gonna have video hubs :D",
			"date_added": 1472538637565
		},
		{
			"body": "Which browser are you using? I noticed chrome and opera tend to have some issues with webtorrent.",
			"date_added": 1472539217730
		},
		{
			"body": "https://ipfs.pics/ipfs/QmeXjZyuHExB5uLSzbRxLCmBVrJx7RCmd39C215LkrJsFH",
			"date_added": 1472548882632
		},
		{
			"body": "There's some weird html generation going on in ZeroMe's code :\\. But I've managed to format posts nicely regardless.",
			"date_added": 1472548970077
		},
		{
			"body": "@bot@zid: KopyKate loaded for me. It's a clone of ZeroSearch but with NullFolder attached to it :P",
			"date_added": 1472560200561
		},
		{
			"body": "http://127.0.0.1:43110/1EE1J2McZPwJ3H6gwYs4bChcVX3iipiEoY/",
			"date_added": 1472560652142
		},
		{
			"body": "I'm literally staring at the page right now.",
			"date_added": 1472560670768
		},
		{
			"body": "Huh. Yea. The zerotalk link does nothing for me. Just hangs at looking for peers.",
			"date_added": 1472561006485
		},
		{
			"body": "Hmm... Seeding any more than 8 videos/torrents causes webtorrent-desktop to lag out. Which isn't very good for people planning on uploading/seeding a lot. Ideas?",
			"date_added": 1472595216124
		},
		{
			"body": "@truth@zid: I didn't make ZeroTube. I'm actually working on my own video site: KaffieVideo. It's based on ZeroMe, so it'll have hubs. As for standard bittorrent, that's impossible without an extension or 3rd party plugin. Webtorrent is a recreation of bittorrent using webrtc. And as such, can only communicate with webrtc peers. However, the protocol is the same, and on stuff like webtorrent-desktop, the torrents will be seeded to both regular peers and web peers.",
			"date_added": 1472597151710
		},
		{
			"body": "There's been murmurs of a torrent client being added to ZeroNet, so that larger files can be distributed, but no clue on if/when that'll happen.",
			"date_added": 1472597194763
		},
		{
			"body": "Hi :)",
			"date_added": 1482038553479
		},
		{
			"body": "Hi :)",
			"date_added": 1482038562732
		},
		{
			"body": "The erkan domains just expired. See my ZeroMe post for a list. Good stuff.",
			"date_added": 1482038586381
		},
		{
			"body": "Are any of the old regulars still here? Or is it just me?",
			"date_added": 1482039044745
		},
		{
			"body": "seems like this place has been kinda dead...",
			"date_added": 1482039070410
		},
		{
			"body": "Ah, well, I'm kinda in a similar boat. I was pretty active a few months back but kind of got distracted. It seems like ZeroNet kinda died in the meantime. We definitely need to get an active community.",
			"date_added": 1482039590017
		},
		{
			"body": "Yeah, that's definitely true. I think merger sites/hubs will help form a cohesive community. There just needs to be a reddit-style site. And maybe some other thing to keep people coming here. Like a video or music sharing site.",
			"date_added": 1482040424916
		},
		{
			"body": "Yeah, I have a lot of dead sites that I seed. Some are still useful, while others I hope the owner returns. Really, ZN needs more developers and more sites that can build communities. Otherwise people won't stick around. What do people normally do online anyway?",
			"date_added": 1482041119387
		}
	]
}