{
	"title": "Бложик без ножек\t",
	"description": "Тестируем ZeroNet",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 9,
	"demo": false,
	"modified": 1487103425,
	"post": [
		{
			"post_id": 8,
			"title": "Как распространяется контент",
			"date_published": 1487086925.934,
			"body": "В заметке \"Добавляем запись\" мы создали и опубликовали первую заметку. Как она доберется до читателей? Какие есть подводные камни?\n\n* * *\n\nИтак, мы создали блог с первой заметкой и нажали \"**Подписать и опубликовать**\". Поздравляю!\n\nЧтобы первые читатели вас нашли, надо им передать ссылку на ваш блог и затем дождаться, пока несколько человек его скачают с вашего компьютера.\n\nПередавайте им полный url, который выглядит примерно так: `http://127.0.0.1:43110/1EA78W4sAgrJxVVcNR9UFF2CBiiWFfPcQQ/`\n\nНачало `http://127.0.0.1:43110/` у всех будет одинаковым - это служебный адрес программы ZeroNet на локальном компьютере. Различаться будет только имя сайта - длинная абракадабра.\n\nВы можете отправить ссылку по почте, опубликовать в своем ЖЖ или на форуме в ZeroNet.\n\nПри обращении читателя, ваш сайт автоматически закачается на его компьютер и станет доступен для просмотра.\n\nА дальше начинается настоящая магия, ради которой и создан ZeroNet:\n\n> Как только вас прочитало несколько пользователей, вы можете спокойно выключать свой компьютер: ваш сайт может быть получен у любого вашего читателя, который в момент запроса будет он-лайн.\n> \n> Чем больше у вас читателей, тем больше копий вашего сайта находится в сети!\n\nКоличество читателей видно в панели ZeroHome:\n\n![zeronet-spread.png (0x0)](data/img/post_8_zeronet-spread.png)\n\nЭто напоминает закачку фильмов через Bit-Torrent. И неудивительно, ведь именно Bit-Torrent тут и используется!\n\nВсе ваши читатели становятся вашими сидерами (раздатчиками). Если вы или кто-то из них сейчас в сети, значит ваш сайт будет доступен всем желающим.\n\n## Несколько тонких моментов\n\n### При первой публикации сайта ZN будет ругаться, что не смог его доставить ни одному получателю.\n\nЭто нормально - просто ваш сайт еще никто не заказывал, а принудительно его протолкнуть никому в кэш невозможно. Просто подождите, пока его кто-нибудь скачает и увидите, что эти люди будут получать ваши дальнейшие обновления.\n\n### Нужно ли находиться он-лайн при подготовке заметки?\n\nНет! Так же как и для того, чтобы читать однажды загруженный материал.\n\nСпокойно создавайте, редактируйте и изменяйте ваш контент офф-лайн.\n\nВы должны быть он-лайн только для его раздачи.\n\n### Как ваш компьютер найдут другие пользователи, чтобы забрать сайт?\n\nЭто происходит двумя путями:\n\n*   Программа ZN пытается открыть порт на Интернет-маршрутизаторе, используя возможность uPnP.\n*   Если это не удается, ZN подключает вас к анонимной сети Tor. Она не шибко быстрая, но позволяет запросить ваш сайт извне.\n\nВ любом случае, все это делается автоматически.\n\nДиагностика соединения отображается на странице ZeroHome.\n\n![zeronet-connection.png (0x0)](data/img/post_8_zeronet-connection.png)\n\nКак ни странно, сообщения об ошибках по обоим каналам не препятствуют работе :)\n\n### Если используется Tor, будет ли ваше присутствие в сети анонимно?\n\nЕсли вы находитесь в РФ, то, в общем случае, ответ - нет. Ваше обнаружение может быть затруднено, но если вы начнете обсуждать темы, которые, из соображений здравого смысла, обсуждать совсем не нужно, то рассчитывать на какие-либо технические гарантии будет глупо.\n\nZeroNet - это средство для непотопляемого хранения информации, которая интересна сообществу, но не стоит её рассматривать как способ спрятаться."
		},
		{
			"post_id": 7,
			"title": "Добавляем запись",
			"date_published": 1487074325.113,
			"body": "Начинаем творить нетленку!\n\n* * *\n\nПеред публикацией блога в него нужно что-то написать.\n\nУ нас уже есть автоматически созданная тестовая заметка. Давайте просто ее отредактируем. Нажимаем на серый карандаш и меняем заголовок:\n\n![zeronet-edit-cap.png (0x0)](data/img/post_7_zeronet-edit-cap.png)\n\nЗатем, уже привычным методом сохраняем результат:\n\n![zeronet-save.png (483x95)](data/img/post_7_zeronet-save.png)\n\nПотом аналогично нажимаем на карандаш напротив текста заметки и начинаем творить.\n\nЧтобы поменять стиль текста, выделите его. Появится меню:\n\n![zeronet-textstyle.png (0x0)](data/img/post_7_zeronet-textstyle.png)\n\nЧтобы вставить полезный элемент. Например картинку, цитату, таблицу, начните новую строку. Напротив нее появится плюс в синем кружочке:\n\n![zeronet-addelement.png (0x0)](data/img/post_7_zeronet-addelement.png)\n\nНажмите на него и затем выберите нужный элемент:\n\n![zeronet-choseelement.png (0x0)](data/img/post_7_zeronet-choseelement.png)\n\nСлева направо:\n\n*   цитата\n\n*   программный код\n\n*   тизер (черта, текст после которой показывается только при заходе внутр заметки)\n\n*   таблица (вау!)\n\n*   картинка\n\nПривычным образом сохраняем изменения. Обратите внимание, что они еще никому не отправлены и находятся только на вашем компьютере.\n\n## Публикуем!\n\n![zeronet-publish.png (0x0)](data/img/post_7_zeronet-publish.png)\n\n> Эта кнопка появляется только после сохранения. Если вы от нее отказались - либо пересохраните, либо воспользуйтесь кнопками \"Подписать\" (\"Sign\") и \"Опубликовать\" (\"Publish\") в нижней части панели управления сайтом (потяните влево серый \"0\").\n\nО том, что присходит при публикации и как распространяется информация по сети - читайте в следующей заметке.\n\nА пока - небольшое дополнение:\n\n## Как создать новую заметку?\n\nНажимаем на кнопку добавления записи (\"Add new post\") вверху экрана:\n\n![zeronet-newpost.png (0x0)](data/img/post_7_zeronet-newpost.png)​​​​​​​"
		},
		{
			"post_id": 6,
			"title": "Русский язык в интерфейсе",
			"date_published": 1487071768.117,
			"body": "По умолчанию интерфейс ZeroHome запускается на английском языке, если хотите видеть подсказки и элементы управления на русском, его нужно выбрать в настройках:\n\n* * *\n\nВверху слева, рядом с логотипом ZeroNet нажмите три вертикальных точки меню и в палитре языков выберите RU.\n\n![zeronet-ru.png (0x0)](data/img/post_6_zeronet-ru.png)"
		},
		{
			"post_id": 4,
			"title": "Создаем свой блог",
			"date_published": 1487071285.262,
			"body": "В первом посте мы научились копировать себе движок понравившегося сайта. Давайте теперь его настроим.\n\n* * *\n\nДля начала капельку теории: как так выходит, что можно взять и скопировать себе в один клик целый сайт со сложным поведением? (вроде принято говорить \"зайты\" (zite, \"**Z**eroNet s**ite**\"), но я при этом чувствую себя Мозаем :)\nГде он хранится?\n\nВсе очень просто: все сайты в ZN логически состоят из программы и полезного контента, которые распространяются вместе, в одном \"транспортном пакете\". Когда вы получаете себе копию чьего-то сайта, вместе с ним вы получаете и копию его движка. ZN спроектирован так, что движок не занимает много места и ощутимой нагрузки не создает.\n\nФункция клонирования позволяет создать скопировать чужой движок в ваш новый сайт.\n\nВ итоге получается новый блог с первым постом:\n\n![zeronet-newblog.png (0x0)](data/img/post_4_zeronet-newblog.png)\n\nНаводя мышкой на разные элементы блога или записи вы будете видеть серый карандашик. Чтобы отредактировать элемент - нажмите на него.\n\nЧтобы закончить или отменить редактирование - нажмите на одну из кнопок в правом нижнем углу экрана:\n\n![zeronet-save.png (0x0)](data/img/post_4_zeronet-save.png)\n\nПодсказка: редактировать запись блога можно прямо в ленте записей, но лучше кликнуть по заголовку и зайти в саму запись.\n\nВ довершение экзерсиса вам нужно отредактировать служебные параметры блога. Зацепите \"0\" в кружочке в правом верхнем углу и протяните его влево. Откроется служебная панель сайта. Промотайте ее в самый низ:\n\n![zeronet-blogcontrol.png (0x0)](data/img/post_4_zeronet-blogcontrol.png)\n\nИзмените название и описание сайта (они не связаны с теми, которые вы редактировали до этого и используются для отображения сайта в различных списках).\n\nНажмите \"Сохранить настройки сайта\" (\"Save site settings\").\n\nСохраненный сайт вы увидите в панели ZeroHome (возможно, это произойдет с небольшой задержкой).\n\nО том, как переключить интерфейс на русский язык читайте в следующей заметке."
		},
		{
			"post_id": 3,
			"title": "ZeroNet: разбираемся с вопросами",
			"date_published": 1486936720.127,
			"body": "Итак, если вы читаете это, значит вы уже успешно установили клиента ZeroNet.\n\n* * *\n\nКстати, видите \"0\" в кружочке справа сверху? Нажатие на него откроет \"приборную панель\", но это не самое интересное.\n\nНажмите и потяните его вправо. Откроется панель свойств сайта, который вы смотрите. _Попробуйте!_ Симпатично?\n\nТут проверю, что с оформлением, картинками и комментариями. Полный отчет в следующей статье.\n\nЧтобы сделать себе такой же бложек, откройте ZeroHome (приборную панель), в списке сайтов нажмите на контекстное меню справа от записи (вертикальные точки) и выберите \"Копировать\":\n\n![zero-clone.png (0x0)](data/img/post_3_zero-clone.png)\n\nЕсли хотите просто закрыть меню - снова нажмите на вертикальные точки."
		}
	]
}