{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1565079726_1G18NbD6PndW29n1QkuFzo1dDpF7xcDBku": 1,
		"1565403228_13v3xsu1y5pTbf3ZydiKYCZUhCFqdAs2NY": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1565403228_13v3xsu1y5pTbf3ZydiKYCZUhCFqdAs2NY": [
			{
				"comment_id": 1,
				"body": "> [kaffie](#comment_10_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Christianity follows the teachings of paul more than the teachings of Jesus, retard.\n\nKaffie, You deceive yourself... (Retard). \n\nPaul gives direction as to how we can spread the gospel and fulfill the Great Commission, how to conduct ourselves publicly and privately when submitting to Christ and spreading His message to the world. He in no way usurps authority from Christ, and does not alter in anyway the teachings of the Messiah. Paul's work in no way directs us away from Christ, and can in no way provide salvation. You could say this is ironic in the sense that Jesus Himself did not even come in HIS own name, He came in the name of The Father. He directed all who heard Him to Our Father, every single time. He is quoted in Mark 10:18, \"Why callest thou me good? there is none good but one, that is, God.\" There are several other examples. If you actually read the bible, you'll see what I mean.\n\nYou see this will be very important when the Antichrist comes to deceive the entire world along with you sodomites. He will come in his OWN name. He will be Super Jesus on Crack, and allow all your heart desires. He will most likely be a big proponent of the Transsexual Sodomite Community. He will be what everyone wants.\n\nThe entirety of The Bible encompasses Christianity. Christ Himself said, \"Think not that I am come to destroy the law, or the prophets: I am not come to destroy, but to fulfil.\" Matthew 5:7",
				"added": 1572123271
			}
		],
		"1565079726_1G18NbD6PndW29n1QkuFzo1dDpF7xcDBku": [
			{
				"comment_id": 2,
				"body": "> [bodqhrohro](#comment_2_1EPZvJuUmcnL1Grz7mos34Qs3fXqMrKVck): What makes you think so? [...]\n\nSo explain to us why the majority of you regret mutilating your genitalia and want to go back, which often can't be done and often ends in suicide.\n\nIt's because you can't fix mental illness by camouflaging your body. Hormones will not change your DNA, it will not change the physical structure of your male brain. It will not ever allow you to perceive the world as a woman. That's a gift only women can have. You will always be a man no matter how far you to try to run away from it. The best solution is to get help from God, get help from male role models, and/or strong male archetypes who can help you to embrace who you are and throw off the lies and deceptions you've been taught your shitty or abusive parents, single moms, or precious \"Utopia\" loving commies who think they can make a perfect world with imperfect people.\n\nYou'd be surprised how many men out here, myself included, would love the opportunity to take you under our wing and help you grow a pair outside the negative influences in your life. You have to flush the toilet. You have to get rid of the people who hold you back, hold you down, try to make you a girl, try to defy your male power. You have to fight through that shit. There is help, it's just not going to come from the opposite sex. The only people who can help men are men. You want a girl? Don't fucking BECOME one, fight for your chance to have one!",
				"added": 1572124046
			}
		]
	},
	"comment_vote": {}
}