{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1564311007,
			"title": "Can you make your own ZeroID without a .bit domain?",
			"body": "Pretty much what the title says, is it possible to make your own ZeroID website without a .bit domain? If not then that's a huge point of failure as if the domain somehow stops responding then the site would fail? No?",
			"added": 1564311006
		},
		{
			"topic_id": 1564315854,
			"title": "So ZeroNet single point of failur is ZeroID as it uses php in the backend",
			"body": "Therefore not being decentralized as it requires a central server for registering ID's lol...",
			"added": 1564315852
		},
		{
			"topic_id": 1564319237,
			"title": "ZeroNet is useless without ZeroID",
			"body": "And ZeroID is useless if a hacker gets into your config.php file where your sites private key exists.\n\nAs decentralized as ZeroNet is it is also quite the opposite and very centralized due to the nature of how ZeroID works and without ZeroID ZeroNet is pretty much useless.",
			"added": 1564319234
		}
	],
	"topic_vote": {
		"1564311007_1K2yxrbNgfo8ZtuGfvvUiPVueUrZEAbfJe": 1,
		"1564315854_1K2yxrbNgfo8ZtuGfvvUiPVueUrZEAbfJe": 1,
		"1564319237_1K2yxrbNgfo8ZtuGfvvUiPVueUrZEAbfJe": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1564311007_1K2yxrbNgfo8ZtuGfvvUiPVueUrZEAbfJe": [
			{
				"comment_id": 1,
				"body": "is it not possible to not use a domain at all and instead have a username connected to a bitcoin address?",
				"added": 1564366772
			}
		],
		"1564315854_1K2yxrbNgfo8ZtuGfvvUiPVueUrZEAbfJe": [
			{
				"comment_id": 2,
				"body": "Kxold is probably the gayest ID provider I've seen, with their rules and other bullshit I can see how they would simply remove / block any users who they may not like. The best way is to be your own ID provider but I can't seem to wrap my head around how this would be possible without a central server?",
				"added": 1564367968
			},
			{
				"comment_id": 3,
				"body": "but the thing about bittorrent trackers is that if they do get blocked a hundred new ones can pop up, so that's not really the problem",
				"added": 1564373559
			}
		]
	},
	"comment_vote": {
		"684_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}