{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1565321266_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"1565933359_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1
	},
	"next_comment_id": 26,
	"comment": {
		"1565163816_1JwnMobAn82kxrY5FXnjwMBFbLyziYijwa": [
			{
				"comment_id": 1,
				"body": "Qboomers think they are part of some spy movie. Don't fret normalfags, 8chan ain't nearly that gay overall.",
				"added": 1565165716
			},
			{
				"comment_id": 2,
				"body": "> [sadloli](#comment_2_1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT): Pedos aren't even that bad, the ones I've seen here(and most I've came in contact with in general) seem to be pretty alright guys.Honestly, I would let my daughter go out with 10 pedos before I would even consider letting one of those retards anywhere within a 100 foot radius of her. Because even the most vile pedo in this universe wouldn't be able to make her as fucked as these guys would!\n\nWeirdest virtue signal I've seen yet",
				"added": 1565168335
			},
			{
				"comment_id": 4,
				"body": "> [blackwatch88](#comment_11_1HFmAHXvHgkwfXcGZH9hMqj9TbgXDZNwGc): If you can't handle political incorrectness then fuck off to your PC shithole called plebbit, faggot.\n\nYeah seriously. Why would people that never say anything radical even use censorship protection? Facebook, reddit, twitter and all other internet platforms bans people they disagree with, seems to fit some people on zeronet much better than a truly open platform.",
				"added": 1565231747
			},
			{
				"comment_id": 5,
				"body": "> [bigbadbob](#comment_54_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): there are no arguments.  only misunderstandings.  Its what happens when people with a hive mentality quickly jump to conclusions with out pausing long enough to comprehend what i actually said:)\n\nWhatever you say champ. It's not 8chan, 4chan, voat or any internet forum that's radicalizing people. Its retards telling a population facing ethnic replacement to \"cope\". By not even entertaining the idea that people might be going crazy for a reason, you've completely destroyed any possibility of deescalation. Keep going at it. At these early stages it will only be the extreme outliers that react like a cornered animal, but as things get closer and closer to south African levels of fuck whitey its gonna get ugly real fast.",
				"added": 1565236080
			},
			{
				"comment_id": 6,
				"body": "> [bigbadbob](#comment_59_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): seriously.. listen to this crazy,    personally blames me for destroying any possibility of deescalation for the worlds problems...  damn.   i can blatantly see people are going crazy,  i get it,   but when has that ever been helpful? cmon.   It was a good day when i realized im not nearly as crazy as the world around me.\n\nI was specifically talking about the problems we have in the west. Its easy to write of as senseless and hateful violence, its possible when we're talking isolated cases. But people are reacting with violence since there is no way for them to speak. Deplatforming, censoring and attacking people for telling the truth doesn't create the healthiest mind. \nThe entire argument for freedom of speech is that it creates peace and stability. When a society starts aggressively attacking its dissidents, their numbers will grow and we get violence and destruction instead of debate and agreement.",
				"added": 1565248181
			}
		],
		"1565175754_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": [
			{
				"comment_id": 3,
				"body": "Who would've thunk that speech banned literally anywhere else would end up on a censorship resistant platform.",
				"added": 1565176586
			}
		],
		"1565321266_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": [
			{
				"comment_id": 7,
				"body": "A user suggested something along the lines of \"we need a problem that's easy to solve for humans, hard to solve for computers, and easily verified by computers.\". Though the decentralized nature of it makes it pretty difficult. \nThe fact that no one has solved the issue yet tells us that zeronets small userbase has insulated it from large spam issues. I saw the admin of 08chan talk time limiting ID creation, that would do the trick for now at least.",
				"added": 1565321578
			},
			{
				"comment_id": 8,
				"body": "Is the spammer a schizo? Who would have thunk. \nCan you automatically generate zeroid ID's? If not then enforcing usage of those might be an idea until we can get smarter on filtering and blocking.",
				"added": 1565322777
			},
			{
				"comment_id": 9,
				"body": "> [kaffie](#comment_927_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Technically yes. Though ZeroID could ban your ip from creating new ones. But you can get around that with stuff like KaffieID (which does cert generation locally/decentralized). [...]\n\nInteresting, but isn't KaffieID a different authority from ZeroID? I thought that an enforcement of ID's would ensure that they come from the right authority.\nPretty sad that we are forced to use centralized services, but until the decentralized tech gets some kind of user protection from spam and abuse it's gonna be a hard sell to the general public. \nPOW for ID generation might be a possibility, and make any bad actors life really annoying.",
				"added": 1565323972
			},
			{
				"comment_id": 10,
				"body": "For now, the best solution is limited and centralized ID providers, or a centralized captcha system.",
				"added": 1565324940
			},
			{
				"comment_id": 11,
				"body": "> [tinktinktink](#comment_1_15QMtSMe3Ckgr3m3bajRgDbNsChibX6sK4): Hello there faggots. Thanks for not hating me so much.The antifa shit was kinda just a LARP, I don't really care about nazi autists, I just wanted to have some fun shitting things up because that's what I do. Breaking things is fun.The spam will probably stop when I get too bored, or my script breaks, or someone implements a security measure, or my computer gets too slow from multiple instances eating up the RAM.Either way, decentralized shit almost never works, I will be really impressed if this network survives without using any centralized service like the ID providers.btw, the ID provider idea is pretty good, I don't think I can generate IDs fast enough to do any real harm, but using them is kinda against the decentralization thing right? :^)\n\nNo solution exists yet, but problems like you forces it to exist. I would rather have some shitposter fuck everything up before some more powerful actors get the same idea.",
				"added": 1565325600
			},
			{
				"comment_id": 12,
				"body": "> [zeronetanon4](#comment_33_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v): Nah, you're doing us a favor even if it isn't your intention.  Its better seriously disruptive stuff such as this is confronted and fixed now than later down the road.  Decentralized technology is without a doubt the way of the future, and to make it work while still holding onto our ideas of information being freely transmitted is a great engineering challenge.  I don't know what the later iterations of this technology will become, but it will require some ingenious ways of functioning.  Thanks man, I'm enjoying solving this problem.\n\nExactly, things like diffie hellmann would never have existed without the need for secure key sharing. Or even just onion routing which is simple in theory, but pretty hard to get right.",
				"added": 1565325710
			},
			{
				"comment_id": 13,
				"body": "> [tinktinktink](#comment_3_15QMtSMe3Ckgr3m3bajRgDbNsChibX6sK4): So hard to get it right that it's still pretty broken. The feds are there to prove it.It's still the best we have right now, though.btw, your username inspired me to keep spamming QResearch even if I stop spamming the other boards, Q is some fucking retarded shit\n\nIt's not like decentralization itself is a bad idea and it's probably going to be in high demand very soon, it's just really immature and up until a few years ago it was really obscure technology. There is a lot of room for improvement for zeronet (ahem browser python turbo bloat), but that doesn't mean a robust solution can't exist. \nWe're currently on the first iteration of this technology, and with how crazy internet censorship is getting there is an increasing demand for censorship resistance.",
				"added": 1565326346
			},
			{
				"comment_id": 16,
				"body": "until someone solves the need for inherent trust in certificates and captcha systems, it seems we are forced to centralize the captcha under a hidden service to provide load balance and DoS protection, courtesy of the Tor guard nodes. \nMany 8chan boards use 24 hour captchas. System would work like this:\nUser asks hidden service for a captcha.\nHidden service sends captcha challenge.\nIf the response is correct, send a certificate to the client and add it to a database with a timestamp tacked on.\nWhen the current time is certificate creation +24 hours blacklist(08chan has blacklists the admin can add ID's to) the certificate, inform the user and ask them to enter a new captcha for a new certificate.\n\nIf something like this could be decentralized it would basically solve the issues of certificate authorities and trust. Only solution would be some dedicated cryptography hardware with a unique ID built in and some private keys that enable it to certify the ID's generated, users would then ban this private key instead of a software generated ID. Spammers would need massive amounts of hardware that would get banned really quickly. You could even use the same blacklist method from before, where the blacklist is distributed with timestamps from the site owners machine, signed with his keys. Then every client could individually chose to follow the blacklist or ignore it.",
				"added": 1565383013
			}
		],
		"1565329400_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": [
			{
				"comment_id": 14,
				"body": "Oy vey",
				"added": 1565329544
			}
		],
		"1565338450_1Hbt9rJ8U9kpEFaxHAfLWzxWtKRYiEDb2G": [
			{
				"comment_id": 15,
				"body": ":^(",
				"added": 1565338773
			}
		],
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 17,
				"body": "> [xcape2net](#comment_230_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Are you sure it's a bug?  Because I'm thinking it's more likely that I have some setting wrong.\n\n> [styromaniac](#comment_919_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It might be related to https://github.com/HelloZeroNet/ZeroNet/issues/2121#issuecomment-519681664 [...]\n\nIts Tor guard notes banning you for p2p traffic/high connection counts.",
				"added": 1565388997
			}
		],
		"1565386361_1CJWxKsqGiQ6So16CWtrGugaMS3PRwkrM2": [
			{
				"comment_id": 18,
				"body": "Works on my machine :^)",
				"added": 1565389032
			}
		],
		"1565557785_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 19,
				"body": "Thanks fren",
				"added": 1565557861
			}
		],
		"1565678144_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": [
			{
				"comment_id": 20,
				"body": "They are chimpanziod animals and they act like niggers",
				"added": 1565681993
			},
			{
				"comment_id": 22,
				"body": "> [mentaldiarrhea](#comment_2_1NpBKuyaBfogcHY7Whe1YM59brNqLHmGBn): Morgan Freeman, Samuel L. Jackson, Denzel Washington are waaaay smarter than you :)\nTranslated\n>you thought you knew it all, but look here at my extreme cherry picking! Checkmate racists.\nThey're definitely smarter than you fam.",
				"added": 1565696924
			},
			{
				"comment_id": 24,
				"body": "gannarchism no one is being serious, we're just superficially discussing the traits a nigger posesses. I could give you the whole shebang, but we're just having fun so calm down anarkiddie",
				"added": 1565867360
			}
		],
		"1565689652_1NpBKuyaBfogcHY7Whe1YM59brNqLHmGBn": [
			{
				"comment_id": 21,
				"body": "Hate is as natural as love you faggot",
				"added": 1565696772
			}
		],
		"1565706281_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": [
			{
				"comment_id": 23,
				"body": "1337 hacker journos looking at peer lists lel",
				"added": 1565708243
			}
		],
		"1565874585_17zkACeRCDqPEswrUFFZxJf3NuwtskPrzR": [
			{
				"comment_id": 25,
				"body": "I love when niggers beat each other up. I love it when niggers play Russian roulette with their feet and a revolver, still continuing the game, even though one nigger just came back from the hospital with a gunshot wound to his foot. I love it when they burn their own neighborhoods down and shout incoherent noises at the news reporters. But my very favorite thing, is when they really display their savage nature and execute local niggers with gasoline and rubber tires, the look of awe in their faces when the magic liquid they got from the white man starts burning.",
				"added": 1565877146
			}
		]
	},
	"comment_vote": {
		"12_1HFmAHXvHgkwfXcGZH9hMqj9TbgXDZNwGc": 1,
		"13_1HFmAHXvHgkwfXcGZH9hMqj9TbgXDZNwGc": 1,
		"24_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"45_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": 1,
		"14_1LW31sbmLZebhhgTx2bhzeUNYbZ5cYnBfe": 1,
		"19_1KZKeEyDG87Yz9dVn9q4GVaPp78YWtRxxn": 1,
		"14_13CzgwZUSqr5FsFwgwjes7i6JY1TskoTbw": 1
	}
}