{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1588757239,
			"title": "Corona virus spy-drones. Privacy attack.",
			"body": "US city abandons CV Drones, Apple tells Germany to change its contract tracing plans, and Bill Gates plays politician and scientist in a single interview. Also online education has forced people to sign up for creepy online proctoring services.\n\nWatch: [#OnlineProctor #Drones #BillGates Your Creepy Online Proctor](https://www.youtube.com/watch?v=ZJJOfFjyoG8)",
			"added": 1588757238
		}
	],
	"topic_vote": {
		"1588540421_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": 1,
		"1588531231_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": 1,
		"1588077237_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1596096685_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"1598711364_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"1608693974_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1
	},
	"next_comment_id": 25,
	"comment": {
		"1588519592_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 1,
				"body": "COVID-19 is a hoax. The tests are not testing for covid-19. Get it through your head. The designer of the test stated that it is not testing for covid-19 therefore all this shit is low IQ waste of time.",
				"added": 1588664394
			},
			{
				"comment_id": 7,
				"body": "> [anonops7](#comment_3_1JcwRQXC7dv2FhRNr44Kzm3tEAJjLiPde4): How are you so sure arione?\n\nWhen I will have more time I will go over the material and give you more details.",
				"added": 1588684639
			},
			{
				"comment_id": 9,
				"body": "> [amvu](#comment_1_17gKzzC9Sdp9sKsmxuferJqQXcwAYPpmd6): There is a lot of evidence showing otherwise, a huge number of geneticists working to find a reliable vaccine and a huge number of deaths. Please, provide sources for your statement.\n\nAbsolutely everything relies on the fact that people assume COVID-19 tests are testing for covid. Start by explaining why almost no healthy person died of covid but always those with serious health issues. How come covid solved all those other health issues because people don't die from other diseases like cancer, hiv, heart attacks? \n\nWhy EU chief scientist stepped down recently saying 'he doesn't believe in the system anymore'? those scientists you mention - who is paying their salaries? \n\nYour top google news suggestions might not be the best. Dig dipper and you might just see why they salivate now over getting people to use mobile apps like 'contact'. Why there was so much talk for years about dollar soon collapsing and why the stock markets blame covid-19 already. You can go further and ask why American army is stationed in eastern europe for so long now and why US NATO try so hard to provoke Russia in to war in europe? They failed as Russians didn't want to fall for the provocation yet us army has no reason to stay there.\n\nWhy 80's computer geek Bill Gates now owns patent now for a virus and why he has so much in WHO, a man with no medical education who wants to make billions on vaccinating the world?\n\nWhy YouTube Wojcicki said she will censor everybody who questions official story on the pandemic? Why so many political and Silicon Valley people are related through families or close connections to each other? And it goes on and on and on.\n\nWhy the very creator of the COVID-19 test said himself that his test cannot be used for covid-19? \nExample: [US doctors virologists question current situation](https://www.bitchute.com/video/bU8XWFlo8cNN/)",
				"added": 1588746872
			}
		],
		"1588406337_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 2,
				"body": "Incredible. It's time to research the shit out of this. Tough times coming. Lot's of desperate attempts to shut down.",
				"added": 1588664929
			}
		],
		"1588494290_1LsxokXjHhAjgc7eh1eYPEBXzvyv5EYVwJ": [
			{
				"comment_id": 3,
				"body": "@zerosas thank you",
				"added": 1588664996
			}
		],
		"1588077237_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 4,
				"body": "Any news on that since last?",
				"added": 1588665090
			}
		],
		"1588376339_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 5,
				"body": "> [blahblah69](#comment_66_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q): ould have changed, the shooter still would have went on h\n\nTHERE HAS BEEN A MISUNDERSTANDING: I was directing that statement to 'tnyt...' guy below saying some bizarre bullshit calling your titling bullshit.\n\nLet me make it clear! I just thought about the word SIEGE. And a mixture of lockdown (covid-19 is a sure hoax) and a coming disarming attempt is EXACTLY WHAT A SIEGE IS ABOUT - destroying or disarming your enemy, is it not!?  \n\nAnd Fuck Zuckerberg, fuck facebook, fuck this stupid fascist Susane Wojcicki bitch with her fake slavic name making open declarations of full blown merciless censorship plans. They are vermin! And guys and gals, let me draw your attention to the professions of her two other sisters - it might give you some ideas as to what their whole family is about. \n\nAs to guns. NO ONE can ever guaranty that no individual will get their hands on a gun. Individual does a shooting, millions are to give up their guns. What else is there left to be said?",
				"added": 1588674409
			}
		],
		"1588684126_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 6,
				"body": "Could you provide a link to it?",
				"added": 1588684319
			},
			{
				"comment_id": 8,
				"body": "> [zeroseed](#comment_65_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g): this is a proposal for devs. this thing for now don't exist\n\nThere so many people who are salivating over this idea.",
				"added": 1588684756
			}
		],
		"1596096685_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 10,
				"body": "Widzę że się pojawiają pozycje.",
				"added": 1596748781
			}
		],
		"1598711364_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": [
			{
				"comment_id": 11,
				"body": "thumbs up",
				"added": 1598713328
			}
		],
		"1598703400_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": [
			{
				"comment_id": 12,
				"body": "Great!",
				"added": 1598713465
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 13,
				"body": "> [topnet](#comment_34_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd): topnet\n\nAny idea why your links not work?",
				"added": 1611910561
			},
			{
				"comment_id": 20,
				"body": ";)",
				"added": 1612444652
			},
			{
				"comment_id": 21,
				"body": "> [littlecaprice](#comment_1_1A8j1Jz4qcRpSRwJeBFUWfDCBrp2txC5fd): test 1 2 3\n\nFEEDBACK!!!!!!!!!!!!!!!!!!!!!!!!1",
				"added": 1612592277
			}
		],
		"1611909944_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 14,
				"body": "> [zeroseed4](#comment_39_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N): Your liberty finish where the liberty of others begins...if you are infected other could be infected by you and die because of this\n\nLet them take the liberty then to stay away from unvaccinated. @cexy haha",
				"added": 1611923003
			},
			{
				"comment_id": 15,
				"body": "> [orien3242](#comment_64_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP): I thought it was astrozenica and moderna that had a bad batch.\n\nIt is all total chaos at this point.",
				"added": 1611927242
			}
		],
		"1612371468_1AimmuFnBKDmQaYHzZerAJEHwsyBUddhMY": [],
		"1612090755_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": [
			{
				"comment_id": 19,
				"body": "> [baduser](#comment_20_1KTDVd4rtqErz3FcxPx2nTmr4CSR9Q7hcr): That's not a good idea, Python 2 is really deprecated: https://www.python.org/doc/sunset-python-2/\n\nDid you find some security issues with it? Do you know how many linux programs depricated for years still ships in distros? They all work and might work for another decade. Trendy bullshit.",
				"added": 1612384091
			}
		],
		"1612717482_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 22,
				"body": "Pfitzer is extremely desparate HAHAHA\nAnything just to get the jabs out.",
				"added": 1612865665
			},
			{
				"comment_id": 23,
				"body": "It was always 'a joke' regardless. Their top serious is a low street joke actually.",
				"added": 1612875003
			}
		],
		"1624835115_129GZPA7VpPa3YaRRW2ani34CaowY5hYB8": [
			{
				"comment_id": 24,
				"body": "> [xcape2net](#comment_874_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz):  in order for something as complicated as ZeroNet and all of its zites to continue working correctly.  But they are not static.  They are constantly being modified.\n\nListen. TCP was invented in 80's and is still used today as is. Zeronet uses oldest and newest things like js. Any serious system made today can still talk to an old one using old protocols. You want a new feature get a new version of software and old features should work across. Forking for what, how many apps can serve email?",
				"added": 1625158575
			}
		]
	},
	"comment_vote": {
		"1_1LhtGmRwMAF6uCWerkiHBbmSpThFZNa4Cg": 1,
		"3_1LhtGmRwMAF6uCWerkiHBbmSpThFZNa4Cg": 1,
		"2_1LhtGmRwMAF6uCWerkiHBbmSpThFZNa4Cg": 1,
		"29_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": 1,
		"37_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": 1
	}
}