{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1621555984_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1623356651_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1623735445_1NWMPpwxp9EJJZFrhDybeZdmg48zwx5urf": 1,
		"1623654807_15brvpgJ5PFKGLF6976wR5gMd2ryzcg2wz": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1623215470_1Jp2TR8an7SBQ9mydr3CtCyCznrYGeWMj9": [
			{
				"comment_id": 1,
				"body": "That's fucked up",
				"added": 1623327256
			}
		],
		"1623356651_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 2,
				"body": "it's not dying I've been here only for 3 or 4 days,  it's fast and reliable but we need a better solution without all the java script crap, this have so much potential",
				"added": 1623443088
			},
			{
				"comment_id": 3,
				"body": "> [inis](#comment_1_16zLpbqTz9hpy6E2oH3y7tHNiTyVsB4RiQ): As a non-tech person, ZeroNet is the easiest darknet I managed to install and run -- uncompress the archive, copy its content into a USB key, double click the executable -- but in my opinion it is still a bit too difficult for normal people. In particular, too many things about its inner workings are unknown to an average person, and and can't be known without a specific culture. For instance:I run ZeroNet under Windows and continuously received messages about Tor errors, use meek bridges... Uh? And why? Sometimes it worked, sometimes didn't.I run it under a Linux live distribution and it works flawlessly, although without Tor that isn't included in the distro.I tried it under Tails and it doesn't work. What does Tails have, or lack, compared to the another live distro?I created this user. What data have I to backup to be able to write as the same user under another Zeronet install, or recover it in case of failure? I created it without Tor, therefore I must remember this is a public user and to never use it for evil doings :D. This is fine, I'm looking at ZeroNet as a way to host an online community without server costs, and I don't need anonymity. But those who need it?Assuming that the public and private key couple has been generated on my machine by my local copy of the ZeroNet script, and the public key communicated to ZeroId, what prevents a modified version of the script to communicate the private key too? Can this happen, or there is some security by design?These are the questions that come to mind to someone who doesn't know how ZeroNet works in details. An average non-technical activist who looks at Zeronet as a tool for anonymous freedom of expression, may ask himself questions like these, and wonder what other issues may exist that he can't even imagine. FUD will discourage him. [...]\n\nin GNU/Linux you can configure /etc/zeronet.conf and change the data_dir , log_dir, for example\n\n[global]\ndata_dir = /mnt/drive1/zeronet/data\nlog_dir = /mnt/drive1/zeronet/log\n\nso it saves all data to a external drive, you can take it anywhere you want , btw make sure to encrypt the whole drive",
				"added": 1623563345
			},
			{
				"comment_id": 4,
				"body": "> [orien3242](#comment_77_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP): Its called freenet or gnunet but enjoy dealing with the child porn shit there. Also there is retroshare with is C based but enjoy the dead scene there. There is no pleasing you guys.\n\nwell cp is here too",
				"added": 1623564338
			}
		],
		"1623654807_15brvpgJ5PFKGLF6976wR5gMd2ryzcg2wz": [
			{
				"comment_id": 5,
				"body": "> [shiruka](#comment_1_1MHdmQEW2HS6sZNgfi3VmtegHc6fUEyVkW): I couldn't find the youtube series 'Wayne' => https://www.youtube.com/channel/UCp4a8s794oJ25AY1XVvJOfw\n\nhttps://1337x.to/torrent/3530251/Wayne-S01-COMPLETE-720p-WEB-x264-MARXSPAWN-TGx/",
				"added": 1623747026
			},
			{
				"comment_id": 6,
				"body": "> [piracy](#comment_2_15brvpgJ5PFKGLF6976wR5gMd2ryzcg2wz): why the next time don't copy the magnet directly in zerotorrent? (to contribute to the zite and make zeronet more attractive and useful? :) ) also in my country 1337x is blocked :(  [...]\n\nsorry my bad",
				"added": 1623906489
			},
			{
				"comment_id": 7,
				"body": "> [piracy](#comment_3_15brvpgJ5PFKGLF6976wR5gMd2ryzcg2wz): all added to zerotorrent! :)\n\nwhere",
				"added": 1623906500
			}
		]
	},
	"comment_vote": {
		"2_1QArHQfn2ikmHDuqvBPcDPpomSrJtKqiZB": 1,
		"4_1QArHQfn2ikmHDuqvBPcDPpomSrJtKqiZB": 1,
		"3_1QArHQfn2ikmHDuqvBPcDPpomSrJtKqiZB": 1,
		"3_15brvpgJ5PFKGLF6976wR5gMd2ryzcg2wz": 1
	}
}