{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": 1,
		"4_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"5_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"1_1AhmLuxijDXzgywnHv2W3u8T251msd8G3n": 1,
		"1_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"6_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"2_1JSZ49XF58HCNGRpvHHs75DmRAcJUbzf4r": 1,
		"1_1JSZ49XF58HCNGRpvHHs75DmRAcJUbzf4r": 1,
		"1_1DjxkUHNWyzVrESngih4CZy9D844FvrKwM": 1,
		"1_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2": 1,
		"2_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"1_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"9_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"7_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"1_14kxkh1pLNYuCwCZ161HCQkSjvWW29ybNz": 1,
		"4_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"5_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"3_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"3_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"2_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1
	},
	"next_comment_id": 33,
	"comment": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 1,
				"body": "ИНФОРМАЦИЮ О ВЫЧИСЛЕНИИ ПРОТЕИНОВ БЛОКИРУЮТ ВЕЗДЕ! НА ВСЕХ БОРДАХ! И РЕСУРАХ\n\nФЕОДАЛИСТЫ МОНОПОЛИСТЫ ХОТЯТ ЧТО БЫ СДОХЛИ ОТ СМЕРТИ И НЕ ВЫЧИСЛЯЛИ ПРОТЕИНЫ В BOINC ROSETTA HOME\nСЕБЕ ОНИ НА СЧЕТА МИЛЛИАРДЫ НАЧИСЛЯЮТ ПРОСТО ТАК, А ВЫ РАБОТАЕТЕ ЗА ДЕНЬГИ! И ПОЛУЧАЙТЕ ХУЙ! \nКОПИТЕ НА ЖИЛЬЕ 20 ЛЕТ! ВАС ОБНУЛЯТ!  \n\n ДЕБИЛОИДЫ, ДЕНЬГИ ЭТО ЦИФРЫ В ПЛАТЕЖНЫХ СИСТЕМАХ - ВЛАДЕЛЕЦ ПЛАТЕЖНЫХ СИСТЕМ МОЖЕТ ВБИТЬ СЕБЕ МИЛЛИАРД, \nА ТЕБЕ ОБНУЛИТЬ СЧЕТ. ЧИТЕРЫ, В РЕАЛЬНОСТИ. ПРОСТО ЦИФРЫ. И УРОВЕНЬ ДОСТУПА\n\n ЧЕЛОВЕК СОСТОИТ ИЗ ОРГАНОВ, ОРГАНЫ СОСТОЯТ ИЗ ТКАНЕЙ, ТКАНИ СОСТОЯТ \nИЗ КЛЕТОК, КЛЕТКИ СОСТОЯТ ИЗ ПРОТЕИНОВ, ПРОТЕИНЫ СОСТОЯТ ИЗ ВЕЩЕСТВ\nВЕЩЕСТВА СОСТОЯТ ИЗ АТОМОВ.\nВЫЧИСЛЯЯ ПРОТЕИНВ В ROSETTA HOME МОЖНО ПОБЕДИТЬ БОЛЕЗНИ И СМЕРТЬ",
				"added": 1457282189
			},
			{
				"comment_id": 2,
				"body": "> [authhh](#comment_1_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg): ИНФОРМАЦИЮ О ВЫЧИСЛЕНИИ ПРОТЕИНОВ БЛОКИРУЮТ ВЕЗДЕ! НА ВСЕХ БОРДАХ! И РЕСУРАХ\n> ФЕОДАЛИСТЫ МОНОПОЛИСТЫ ХОТЯТ ЧТО БЫ СДОХЛИ ОТ СМЕРТИ И НЕ ВЫЧИСЛЯЛИ ПРОТЕИНЫ В BOINC ROSETTA HOMEСЕБЕ ОНИ НА СЧЕТА МИЛЛИАРДЫ НАЧИСЛЯЮТ ПРОСТО ТАК, А ВЫ РАБОТАЕТЕ ЗА ДЕНЬГИ! И ПОЛУЧАЙТЕ ХУЙ!КОПИТЕ НА ЖИЛЬЕ 20 ЛЕТ! ВАС ОБНУЛЯТ!  \n>  ДЕБИЛОИДЫ, ДЕНЬГИ ЭТО ЦИФРЫ В ПЛАТЕЖНЫХ СИСТЕМАХ - ВЛАДЕЛЕЦ ПЛАТЕЖНЫХ СИСТЕМ МОЖЕТ ВБИТЬ СЕБЕ МИЛЛИАРД,А ТЕБЕ ОБНУЛИТЬ СЧЕТ. ЧИТЕРЫ, В РЕАЛЬНОСТИ. ПРОСТО ЦИФРЫ. И УРОВЕНЬ ДОСТУПА\n>  ЧЕЛОВЕК СОСТОИТ ИЗ ОРГАНОВ, ОРГАНЫ СОСТОЯТ ИЗ ТКАНЕЙ, ТКАНИ СОСТОЯТИЗ КЛЕТОК, КЛЕТКИ СОСТОЯТ ИЗ ПРОТЕИНОВ, ПРОТЕИНЫ СОСТОЯТ ИЗ ВЕЩЕСТВВЕЩЕСТВА СОСТОЯТ ИЗ АТОМОВ.ВЫЧИСЛЯЯ ПРОТЕИНВ В ROSETTA HOME МОЖНО ПОБЕДИТЬ БОЛЕЗНИ И СМЕРТЬ\n\nContent publish failed.\nContent publish failed.\nContent publish failed.\nContent publish failed.",
				"added": 1457282255
			},
			{
				"comment_id": 3,
				"body": "ФЕОДАЛЫ МОНОПОЛИСТЫ БЛОКИРУЮТ ЗНАНИЯ И ИНФОРМАЦИЮ!",
				"added": 1457282649
			},
			{
				"comment_id": 4,
				"body": "> [leinariys](#comment_6_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg): да-да мы уже развиваем нулевой уровень сети\n\nСпасибо за поддержку, если хотите продвинуть тему говорите везде  https://2ch.hk/",
				"added": 1457283235
			},
			{
				"comment_id": 5,
				"body": "> [splitfire](#comment_35_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): сам то много протеинов насчитал? :)\n\nМНОГО, МЫ СОЗДАЛИ ВСЕ РЕСПРЕДЕЛЕННЫЕ СЕТИ И ZERO NET, НАС НЕ УПОМИНАЮТ НАС БОЯТСЯ\nФЕОДАЛЫ ОХУЕЛИ ВКОНЕЦ, КОГДА ЗА ЖИЛЬЕ НУЖНО БРАТЬ ИПОТЕК КОГДА ЗА ЕДУ НУЖНО ПЛАТИТЬ\n\nВСЕ ПРОБЛЕМЫ СОЗДАЛИ ФЕОДАЛЫ МОНОПОЛИСТЫ - ЧЕЛОВЕЧЕСТВО НЕ ИМЕЕТ НИКАКИХ ПРОБЛЕМ ИЛИ ДЕФИЦИТА РЕСУРСОВ, ВЕСЬ ДЕФИЦИТ СОЗДАН ФЕОДАЛАМИ МОНОЛИСТАМИ  ДЛЯ ПРИБЫЛИ",
				"added": 1457283658
			},
			{
				"comment_id": 6,
				"body": "> [splitfire](#comment_40_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): Результаты вычислений Rosetta@Home не доступны напрямую. Так же, нельзя использовать результаты вычислений собственного компьютера.[3] Однако они используются для большого количества научных публикаций.[4] \n> Прекрасно, я считаю\n\nНАУЧНЫЕ ПУБЛИКАЦИИ ПРИНАДЛЕЖАТ МОНОПОЛЬНЫМ ФЕОДАЛЬНЫМ  АВТОРСКИМ ИЗДАТЕЛЬСТВАМ МЫ ПРОДВИНУЛИ СКАЙХАБ   https://geektimes.ru/post/271856/\n\nДОЛЛОЙ МАССОВОЕ АВТОРСКОЕ ПРАВО! МИЛЛИАРДЕРЫ ЖИРУЮТ ВЫ БОМЖУЕТЕ !",
				"added": 1457284175
			},
			{
				"comment_id": 7,
				"body": "> [esteban](#comment_57_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): БОИНК РАБОТАЕТ, ВСЁ ТОРМОЗИТ НЕ МОГУ НИЧЕГО ПИСАТЬ В ЗЕРОНЕТ, ЧТО ДЕЛАТЬ?\n\nСДЕЛАЙ НАГРУЗКУ НА ПРОЦЕССОР 30% ИЛИ 40% МОЖНО ВЫСТАВЛЯТЬ \n\n> [leinariys](#comment_7_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg): если нашёл это в FAQ кинь ссыльда когда ты просматриваешь он к себе качается , но по запросу, а что бы была возможность скачать всё сразу  = клонируй , думаю так\n\nЕСЛИ МОНОПОЛИСТЫ ФЕОДАЛЫ ОПЯТЬ ЗАХОТЯТ СДЕЛАТЬ ИХ ZERONET НОВЫЙ ЗАГОН ДЛЯ СКОТА ПО ТИПУ TOR ТО БЛИЗОК ТОТ ДЕНЬ КОГДА ВСЕ УЗНАЮТ! ТО ЧТО ОНИ СКРЫВАЮТ!",
				"added": 1457285002
			},
			{
				"comment_id": 8,
				"body": "> [splitfire](#comment_36_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): а че SETI@HOME не упоминаешь? много пришельцев нашли с его помощью\n\nСОТНИ ДОКЛАДОВ, ВКЛЮЧАЯ ГРАВИТАЦИОННЫЕ ВОЛНЫ ОТ ЧЕРНЫХ ДЫР \n\n> [splitfire](#comment_39_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): | Rosetta@home Free for academic and non-profit use, proprietary license available for commercial useи тут проприерасты :(\n\nНА ЗАПАДЕ, СВОБОДНАЯ ИНФОРМАЦИЯ БЫСТРО ПАТЕНТУЕТСЯ ЛОББИСТАМИ И АВТОРСКИМИ АГЕНСТВАМИ, ВЕДЬ У НИХ ЖЕ ЧАСТНОЕ ПРАВО - ЕСЛИ НИКОМУ НЕ ПРИНАДЛЕЖИТ ТО МОЖНО ЗАБРАТЬ ПРАВО СЕБЕ, ФЕОДАЛЫ МОНОПОЛЬНЫЕ ЧТО ВЗЯТЬ",
				"added": 1457285955
			},
			{
				"comment_id": 11,
				"body": "ШТУРМОВАТЬ ЦЕНТРОБАНКИ ТАМ ПЕЧАТАЮТ ДЕНЬГИ ТАМ ХРАНЯТСЯ ДЕНЬГИ В ВИДЕ ЦИФР, ЕСЛИ ВЫДАТЬ ДЕНЬГИ ЦИФРЫ ВСЕМ ТО НЕ БУДЕТ НИ ФЕОДАЛОВ НИ МОНОПОЛИСТОВ НИ ЛОББИСТОВ ВСЕ ПРОБЛЕМЫ ОБЩЕСТВА И СОЦИУМА СОЗДАНЫ СПЕЦИАЛЬНО КАК И ДЕФИЦИТ ТОВАРОВ",
				"added": 1457287133
			},
			{
				"comment_id": 12,
				"body": "> [killenstein](#comment_1_1NMerKYwUayNpEZ35FxkzZch6kgoeFTWk): Я 5 лет ждал такой интернет\n\nТЫ В НЕМ ДОБРО ПОЖАЛОВАТЬ",
				"added": 1457287151
			},
			{
				"comment_id": 13,
				"body": "> [authhh](#comment_12_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg): ТЫ В НЕМ ДОБРО ПОЖАЛОВАТЬ\n\nIn Fear And Faith – Pursuit",
				"added": 1457287608
			},
			{
				"comment_id": 14,
				"body": "> [leinariys](#comment_13_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg): http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:6_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf\n\nДЕБИЛОИД, ФЕОДАЛИСТЫ МОНОПОЛИСТЫ ОБЯВИЛИ ВОЙНУ ВСЕМУ ЧЕЛОВЕЧЕСТВУ КИНУВ ВЕСЬ МИР НА КУРС ДОЛЛАРА В ДВА РАЗА! ТЕБЯ ФЕОДАЛЫ МОНОПОЛИСТЫ ПОСЛАЛИ НАХУЙ, ТЫ ИМ НЕ НУЖЕН А ЭТО ЗНАЧИТ ЧТО С СОЗДАНИЕМ ZERONET МЫ ВСТАЕМ НА ПУТЬ БОРЬБЫ ЗА ОТКРЫТЫЕ ЗНАНИЯ, ЗА ОТКРЫТЫЕ СИСТЕМУ, И НОВУЮ ФОРМУ ПРАВЛЕНИЯ ГДЕ НЕТУ ФЕОДАЛОВ МОНОПОЛИСТОВ, ГДЕ ЗНАНИЯ ПОЛУЧАЕТ КАЖДЫЙ ВНЕ ЗАВИСИМОСТИ ОТ СОСЛОВИЯ ИЛИ ЗВАНИЯ \nМИР БЕЗ ИЕРАРХИЙ НАСИЛИЯ И УГНЕТЕНИЯ, БЕЗ ДЕСКРИМИНАЦИЙ, ВСЕ ПРОБЛЕМЫ СОЗДАНЫ ФЕОДАЛАМИ И ОРУЖЕЙНЫМИ БАРОНАМИ",
				"added": 1457288448
			},
			{
				"comment_id": 15,
				"body": "ЕБАТЬ ДЕНЬГИ - ЕБАТЬ ЕДУ - ЕБАТЬ СМЕРТЬ ЕБАТЬ БОГОВ, И ПРИДУРКОВ ДЕБИЛОВ КОТОРЫЕ НЕ ПОНИМАЮТ КАК РАБОТАЕТ МИР\n https://mega.nz/#F!7kIHTDxT!HQ2Oh9IJdWxfIfSLKAmxsw!6tQlXLYL\n( ТУТ ТОЛЬКО КАРТИНКИ В БРАУЗЕРЕ ) \nДАЕШЬ ВЕЧНУЮ ГАРАНТИЮ НА ТОВАР, ДАЕШЬ СВОБОДНЫЕ ТЕХНОЛОГИИ ОТ МОНОПОЛИСТОВ ФЕОДАЛОВ, ДАЕШЬ БЕСПЛАТНУЮ ЕДУ!",
				"added": 1457289100
			},
			{
				"comment_id": 16,
				"body": "> [gomzik](#comment_219_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Офигеть вы тут нафлудили\n> Многобукавнеосилил!\n\nСУТЬ В ТОМ ЧТО СВОБОДНОМУ ЧЕЛОВЕЧЕСТВУ ОБЯВИЛИ ВОЙНУ ФЕОДАЛИСТЫ МОНОПОЛИСТЫ КОЛОНИЗАТОРЫ, ИМПЕРИАЛ МОНОПОЛЬНОЙ ФЕОДАЛЬНОЙ СИСТЕМЫ ГДЕ ЗА ВСЕ НУЖНО ПЛАТИТЬ!",
				"added": 1457289342
			},
			{
				"comment_id": 17,
				"body": "> [zeroatom](#comment_47_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): Приветствую тебя :) Можно тебя попросить скинуть твои источники информации, хочется спокойно разобраться в этой  теме. Если нормальные источники ? Спокойно объясняющие что и почему,как,зачем и кто? Для ронимого ума, который опирается на 4 закона логики...А то вот читаешь тебя и ощущение что ты орешь с горящего коробля,а по факту надо просто отказаться от денег каждому человеку на планете земля и всё решится :)\n\nМОНОПОЛИСТЫ ФЕОДАЛЫ БЛОКИРУЮТ ЭТУ ИНФОРМАЦИЮ\nhttps://mega.nz/#F!7kIHTDxT!HQ2Oh9IJdWxfIfSLKAmxsw!6tQlXLYL\nМЫ ПЫТАЕМСЯ НО НАС ВЕЗДЕ БЛОКИРУЮТ МЫ ЧЕЛОВЕЧЕСКОЕ СОПРОТИВЛЕНИЕ ОТ ОККУПАЦИИ ВСЕХ ВИДОВ И ВСЕХ ИНОРОДНЫХ ФОРМ МЫ ПРОТЕИНОВЫЕ ИНСАЙДЕРЫ \nhttp://127.0.0.1:43110/0chan.bit/?/rus/thread/0883888b9d8d86eb84043b125d219c17",
				"added": 1457289529
			},
			{
				"comment_id": 18,
				"body": "> [authhh](#comment_17_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg): МОНОПОЛИСТЫ ФЕОДАЛЫ БЛОКИРУЮТ ЭТУ ИНФОРМАЦИЮhttps://mega.nz/#F!7kIHTDxT!HQ2Oh9IJdWxfIfSLKAmxsw!6tQlXLYLМЫ ПЫТАЕМСЯ НО НАС ВЕЗДЕ БЛОКИРУЮТ МЫ ЧЕЛОВЕЧЕСКОЕ СОПРОТИВЛЕНИЕ ОТ ОККУПАЦИИ ВСЕХ ВИДОВ И ВСЕХ ИНОРОДНЫХ ФОРМ МЫ ПРОТЕИНОВЫЕ ИНСАЙДЕРЫhttp://127.0.0.1:43110/0chan.bit/?/rus/thread/0883888b9d8d86eb84043b125d219c17\n\n\nА ТЕПЕРЬ ВНИМАНИЕ ИНТЕЛ ДЕБИЛАМ, ЭТА КОМПАНИЯ МОНОПОЛИСТ КУПИЛА БЕСПЛАТНЫЙ АНТИВИРУС MC FEE за 7 миллиардов ДООЛЛАРОВ а это 490 МИЛЛИАРДОВ РУБЛЕЙ\n\nДеньги тупорылого анчоуса ОСЕЛИ У ДОЛБОЕБА МАК ФИ.\nhttp://www.gazeta.ru/business/2010/08/20/3409310.shtml\nМы публиковали новость 4 ЧИСЛА. \n\n-ЛЮДИ ДОХНУТ С ГОЛОДА А ПРИДУРКИ ПОКУПАЮТ АНТИВИРУСЫ ЗА 490 МИЛЛИАРДОВ РУБЛЕЙ\n-ТЕХНОЛОГИИ СКРЫВАЮТСЯ А ПРИДУРКИ ПОКУПАЮТ АНТИВИРУСЫ ЗА 490 МИЛЛИАРДОВ РУБЛЕЙ\n\nФЕОДАЛЫ ОБЯВИЛИ ВОЙНУ СВОБОДНОМУ ЧЕЛОВЕЧЕСВВУ! НА ЧЬЕЙ ВЫ СТОРОНЕ? \nЭТО ПОСЛЕДНЕЕ СООБЩЕНИЕ. ВСЕ ПОДРОБНИСТИ НА ЗЕРО ПОЧТУ ZERONETMAIL\n\nZERONET НАШ ПРОЕКТ, И МЫ СТОИМ ЗА НИМ. МЫ ПРОТИВ ОКУПАЦИИ И ЕБУЧИХ ИПОТЕК НА 20ЛЕТ\nПЛАТИ И СДОХНИ, ЕБАТЬ ЕДУ, ЕБАТЬ СМЕРТЬ, ЕБАТЬ БОГОВ, ПРОТЕИНОВ НЕ ВЫЧИСЛЯЮЩИХ",
				"added": 1457289703
			},
			{
				"comment_id": 19,
				"body": "«Они полагают, что система — это Путин. Или Обама. А если очень уверены, будто система — это ФРС и Йеллен-шмелен. \n\nА система — это светящийся экран на расстоянии шестидесяти сантиметров от глаз. С которым мы трахаемся, советуемся и интересуемся, какие для нас сегодня будут новости. Путин, Обама, Йеллен — это на нём просто разные картинки. А экран один и тот же… Мы думаем, что экраном управляем наполовину мы, а на другую половину спецслужбы, но на самом деле сам экран уже давно управляет и нами, и спецслужбами. Вот что такое система. И как, спрашивается, с ней бороться, если про борьбу с ней мы читаем на том же экране?»\n\nЗогач, поясни по хардкору, что имеет ввиду современный классик в этом отрывке?\n\nВариант, что просто для замудренности спизданул, не предлагать — во-первых, все таки Витя не хуй простой, а во-вторых минимум с конца 90-х интересуется устройством глобального управления человечеством (тема наиболее полно вскрывается (и очень годно, хоть и в основном метафорически) в Generation P, Empire V, Бэтман Апполо)",
				"added": 1457290340
			},
			{
				"comment_id": 20,
				"body": "МОНОПОЛИСТЫ ФЕОДАЛЫ БЛОКИРУЮТ ЭТУ ИНФОРМАЦИЮhttps://mega.nz/#F!7kIHTDxT!HQ2Oh9IJdWxfIfSLKAmxsw!6tQlXLYLМЫ ПЫТАЕМСЯ НО НАС ВЕЗДЕ БЛОКИРУЮТ МЫ ЧЕЛОВЕЧЕСКОЕ СОПРОТИВЛЕНИЕ ОТ ОККУПАЦИИ ВСЕХ ВИДОВ И ВСЕХ ИНОРОДНЫХ ФОРМ МЫ ПРОТЕИНОВЫЕ ИНСАЙДЕРЫhttp://127.0.0.1:43110/0chan.bit/?/rus/thread/0883888b9d8d86eb84043b125d219c17\nА ТЕПЕРЬ ВНИМАНИЕ ИНТЕЛ ДЕБИЛАМ, ЭТА КОМПАНИЯ МОНОПОЛИСТ КУПИЛА БЕСПЛАТНЫЙ АНТИВИРУС MC FEE за 7 миллиардов ДООЛЛАРОВ а это 490 МИЛЛИАРДОВ РУБЛЕЙ\nДеньги тупорылого анчоуса ОСЕЛИ У ДОЛБОЕБА МАК ФИ.\nhttp://www.gazeta.ru/business/2010/08/20/3409310.shtml\nМы публиковали новость 4 ЧИСЛА.\n-ЛЮДИ ДОХНУТ С ГОЛОДА А ПРИДУРКИ ПОКУПАЮТ АНТИВИРУСЫ ЗА 490 МИЛЛИАРДОВ РУБЛЕЙ\n-ТЕХНОЛОГИИ СКРЫВАЮТСЯ А ПРИДУРКИ ПОКУПАЮТ АНТИВИРУСЫ ЗА 490 МИЛЛИАРДОВ РУБЛЕЙ\nФЕОДАЛЫ ОБЯВИЛИ ВОЙНУ СВОБОДНОМУ ЧЕЛОВЕЧЕСВВУ! НА ЧЬЕЙ ВЫ СТОРОНЕ?\nЭТО ПОСЛЕДНЕЕ СООБЩЕНИЕ. ВСЕ ПОДРОБНИСТИ НА ЗЕРО ПОЧТУ ZERONETMAIL\nZERONET НАШ ПРОЕКТ, И МЫ СТОИМ ЗА НИМ. МЫ ПРОТИВ ОКУПАЦИИ И ЕБУЧИХ ИПОТЕК НА 20ЛЕТ\nПЛАТИ И СДОХНИ, ЕБАТЬ ЕДУ, ЕБАТЬ СМЕРТЬ, ЕБАТЬ БОГОВ, ПРОТЕИНОВ НЕ ВЫЧИСЛЯЮЩИХ",
				"added": 1457292992
			},
			{
				"comment_id": 21,
				"body": "> [leinariys](#comment_22_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg): Как ты заебал\n\nДЕБИЛОИД ИНФОРМАЦИЮ СКРЫВАЮТ ЛЮДИ ДОХНУТ, ОБСУЖДАЙТЕ ХУЙНЮ А ВАЖНЫЕ СОЦИАЛЬНЫЕ ТЕМЫ",
				"added": 1457293282
			},
			{
				"comment_id": 23,
				"body": "> [zeroatom](#comment_51_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): Даешь ссылки (пруфы,факты,видеообъяснения) и название книг, где обоснованно вся информация преподносится, а не отрывками как ты ее ОРЕШЬ.\n\nПРУФЫ КАК БАНКИРЫ ОБАНКРОТИЛИ ЕВРОПУ И ЗАГНАЛИ В ВЕЧНЫЕ ДОЛГИ ВЕСЬ ЕВРО СОЮЗ\nДОКУМЕНТАЛЬНЫЙ ФИЛЬМ https://www.youtube.com/watch?v=9dealORlFcY",
				"added": 1457293921
			},
			{
				"comment_id": 24,
				"body": "> [nippletwister](#comment_271_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Уж если на то пошло, \"Хозяева денег\" по прикольней фильмец будет.\n\nДЕНЬГИ ЭТО ХУЙНЯ ПОЛНАЯ, Я ДАЛ ТЕБЕ ФИЛЬМ, ТАМ СУТЬ ТАКАЯ ЧТО СЫРЬЕВЫЕ, МОНОПОЛИСТЫ КАК БЫ КОРМУШКИ НЕ ДАЮТ СМЕРТНЫМ, И ЗАГОНЯЮТ СМЕРТНЫХ В ВЕЧНЫЕ ДОЛГИ ГДЕ УЖЕ ЭТИ ДОЛГИ ОТРАБАТЫВАЮТ В ТЮРЬМАХ ТО ЕСТЬ СТРАНЫ И ЧЕЛОВЕК НЕ ДОЛЖЕН ИМЕН ИМЕТЬ СУВЕРНИТЕТ  И ИНСТРУМЕНТЫ ЛИЧНОЙ ЗАЩИТЫ - ЦЕЛЬ ФЕОДАЛОРАБО СИСТЕМЫ ЭТО СОКРАЩЕНИЕ НАСЕЛЕНИЯ И ТЮРЬМА.  ДЕНЬГИ БЕЗ ТОВАРА И УСЛУГ НЕ ИМЕЮТ ЦЕННОСТИ",
				"added": 1457294314
			},
			{
				"comment_id": 25,
				"body": "> [nippletwister](#comment_272_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Ну ОК, зачем писать-то это 10й раз и большими буквами?!Я понял, что в этой жизни главное не попасть под сокращение населения.Кстати, стал бы ты продолжать это писать, если бы с тебя за каждое сообщение по 10 рублей брали?\n\nНАС НА ДВАЧЕ И ВК, ЗАБЛОКИРОВАЛИ, БЛОКНУЛИ УДАЛИЛИ1 МОНПОЛЬНЫЕ ФЕОДАЛЬНЫЕ ПИДОРЫ!",
				"added": 1457294621
			},
			{
				"comment_id": 26,
				"body": "> [nippletwister](#comment_274_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): А все дело в том, что Зеронет - это не обычный интернет ;)То, что не работает там может легко взлететь здесь, и наоборот (например, сайты вообще без модератов).Идее свободного интернета это не противоречит. Наряду с платными сайтами могут быть и бесплатные, правда, с кучей спама.\n\nМЫ РАЗРАБОТАЛИ ZERONET ДЛЯ БОРЬБЫ С ФЕОДАЛАМИ МОНОПОЛИСТАМИ. ДОБРО ПОЖАЛОВАТЬ\n\nhttp://127.0.0.1:43110/0chan.bit/data/users/1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg/4b88c3fe914ce2e92cb30617e6f93753.jpg\n\nВОТ ИЗОБРАЖЕНИЕ НАШЕГО МАНИФЕСТА",
				"added": 1457295866
			},
			{
				"comment_id": 27,
				"body": "> [nippletwister](#comment_273_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Ну ответь на вопрос прямо. Сколько тебе за одно сообщение недорого будет? Мы тут бизнес-идею выращиваем. С одной стороны нужно тебя не спугнуть (как источник прибыли), а с другой стороны не продешевить, иначе наша тема не окупится.\n> UPD: Кстати, можно же плавающий курс установить! Эврика!\n\nТЫ ХОТЬ ЗНАЕШЬ КТО МЫ?",
				"added": 1457295987
			},
			{
				"comment_id": 28,
				"body": "> [nippletwister](#comment_275_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): ВЫЧЕСЛИТЕЛИ ПРОТЕИНОВ?)\n> Почитайте FAQ по созданию ЗероСайтов для начала, изображение вашего манифеста не грузится ни у кого))http://127.0.0.1:43110/0chan.bit/data/users/1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg/1d87a3d6e8ec0c7e50974bfb222b8e73.jpg\n\nКОПАЙ ГЛУБЖЕ МЫ ТЕ КТО МОЖЕМ ОБАНКРОТИТЬ ФЕОДАЛОВ ЗА ОДНУ НЕДЕЛЮ, НО НЕТУ ОСНОВЫ ДЛЯ СЛИВА ИНФОРМАЦИИ, ТАК КАК НЕТУ СВОБОДНОГО ИНТЕРНЕТА И ТЕХНОЛОГИЙ -ТАК КАК ВЕСЬ ТРАФИК ГОНИТСЯ ЧЕРЕЗ ФЕОДАЛЬНЫЕ ПРОВАЙДЕРЫ ДА И САМ TOR ВЫДУМКА ФЕОДАЛОВ МОНОПОЛИСТОВ ВОЕННЫХ ДОМОВ - ИНТЕРНЕТ ЗАКРЫТАЯ ТЕХНОЛОГИЯ, ПАТЕНТНЫМ ЛОББИ\n\nЕСЛИ НЕ ПОКАЗЫВАЕТ ТО ВОТ ТРЕД http://127.0.0.1:43110/0chan.bit/?/rus/thread/7299d256f97063a86c4e0106613a39a9\nИ ЕЩЕ http://127.0.0.1:43110/0chan.bit/?/rus/thread/0883888b9d8d86eb84043b125d219c17\n\nМЫ НЕ ВЛАСТЬ, МЫ ТЕ КТО СТАВЯТ НА МЕСТО ОЗВЕРЕВШИХ ПРИДУРКОВ ФЕОДАЛОВ МОНОПОЛИСТОВ БАНКОВСКИХ МОШЕННИКОВ, ПОТРОШИТЕЛЕЙ ЛЮДСКИХ ЖИЗНЕЙ",
				"added": 1457296722
			},
			{
				"comment_id": 29,
				"body": "И НЕ ЗАБЫВАЙТЕ, ДУША В ЗУБАХ, ЗУБЫ ГНИЮТ - ЛЮДИ ДОХНУТ. \nПРИДУРКОВАТЫЙ ФЕОДАЛИСТ GOOGLE НЕ ОТКРЫВАЕТ ИСХОДНЫЕ КОДЫ, ПРИДУРКОВАТЫЕ ФЕОДАЛИСТЫ ЗАЖАЛИ ТЕХНОЛОГИИ ВСЕОБЩЕГО БЛАГА И ПРОЦВЕТАНИЯ, ПРИДУРКОВАТЫЕ ФЕОДАЛИСТЫ ЗАПАТЕНТОВАЛИ ПОЛЕЗНЫЕ МИКРОБЫ КОТОРЫЕ ЕДЯТ ТОКСИНЫ И ОПАСНУЮ ПЛЕСЕНЬ, ПРИДУРКИ, ЛОББИ,  УГНЕТАТЕЛИ РОДА ЛЮДСКОГО - ДЕНЕЖНЫЕ ПРИДУРКИ, В ЦЕНТРОБАНКАХ, ФЕОДАЛЬНО МОНОПОЛИСТИЧЕСКИЙ СТРОЙ ВО ВСЕМ МИРЕ",
				"added": 1457296969
			},
			{
				"comment_id": 30,
				"body": "> [leinariys](#comment_25_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg): Подскажите, движок который поможет формировать странички и JS Сайта из БД или других таблиц\n> Какhttp://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp\n\nПРОТЕИНЫ НЕ ВЫЧИСЛЯЮЩИЙ",
				"added": 1457297316
			},
			{
				"comment_id": 31,
				"body": "█████████████████████████████████████████████████████████\nЯ бы привел полные детальные пруфы по этой теме, с полными фактами и подробным описаниями с ФИО, адресами и списками,кто в чем замешан,кто где и когда украл ваши деньги, которые были для вас.  но меня забанят как протеиношизиков . борда под внешнем управлением, и под пятой колонной\n\nЯ бы полностью рассказал по порядку и привел пруфы и дал бы детальный инсайд, но меня забанят как протеинодебилов \n\n\nКак я и обещал я готов приложить пруфы и факты, с доказательствами всего этого - рискуя быть забаненым как протеин шизоиды.\n\nСлова в черном списке - мне не дают опубликовать сообщение, эта информация даже в дата базах антивирусников по этим словам. не знаю даже что и сказать.",
				"added": 1457297370
			},
			{
				"comment_id": 32,
				"body": "ПРОВЕРКА",
				"added": 1457447584
			}
		],
		"4_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 9,
				"body": "> [shift](#comment_122_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Всегда есть кнопка delete у сайта\n\n> [esteban](#comment_55_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Отфлудил своё уже.\n\nЖДЕМ КОГДА НУЛЬЧАН МОЖНО БУДЕТ КОПИРОВАТЬ",
				"added": 1457286619
			},
			{
				"comment_id": 22,
				"body": "Повысте лимит добрым адекватным людям а то протеины не вычисляються*((",
				"added": 1457293400
			}
		],
		"1_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 10,
				"body": "ПРИЛОЖЕНИЕ КЕШИРУЮЩИЕ ВСЕ САЙТЫ ЧЕРЕЗ LIST BIT",
				"added": 1457287002
			}
		]
	},
	"comment_vote": {
		"1_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"2_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"6_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg": 1,
		"4_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"5_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"41_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f": 1,
		"40_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f": 1,
		"6_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"7_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg": 1,
		"38_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f": 1,
		"267_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"37_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f": 1,
		"36_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f": 1,
		"57_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi": 1,
		"7_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"8_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"9_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"10_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"11_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"12_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"15_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"17_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"18_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"19_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"20_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"21_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"22_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"22_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg": 1,
		"21_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg": 1,
		"269_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"23_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"24_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"26_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"27_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"28_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"275_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"29_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg": 1,
		"276_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1
	}
}