{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"3_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz": 1
	},
	"next_comment_id": 15,
	"comment": {
		"1_1CNF4WYCP9372VLNWNR7RaeGZyvXvcSMaU": [
			{
				"comment_id": 1,
				"body": "Le fait que ce soit long et dur est la base du travail de Adam back sur le hashcash. l'algorithme s’appelle la preuve du travail (par ce que c'est dur) proof of work, POW en anglais.\nCet algorithme est utilisé pour sécuriser la blockchain bitcoin.\nEt c'est parce qu'il n'y a pas d'optimisation connue pour générer un tel type d'adresse facilement que les crypto monnaies sont solides.\n\nDonc non, pas moyen de faire ça plus vite.\nEt ta méthode force brute est la seule connue (le minage bitcoin, c'est cette recherche en force brute)",
				"added": 1463183900
			},
			{
				"comment_id": 5,
				"body": "> [djmemo](#comment_7_1CNF4WYCP9372VLNWNR7RaeGZyvXvcSMaU): Merci pour cette confirmation. Le seule moyen de donner un nom c'est namecoin.\n\nde nada :) go namecoin!",
				"added": 1463245878
			}
		],
		"2_14yeJduXkemL1WVGqk9kJ1Wrn3UgBD175y": [
			{
				"comment_id": 2,
				"body": "sur 0net la doc est là : http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:3:How+to+have+a+blog+like+this",
				"added": 1463184021
			}
		],
		"1_1QESmp3qVTC4wekwXp8yzeScpLGsLhMgHM": [
			{
				"comment_id": 3,
				"body": "> [vixa](#comment_6_1QESmp3qVTC4wekwXp8yzeScpLGsLhMgHM): Faudrait faire un github dans zeronet, comme ça le réseau serait beaucoup plus indé à mon goût, vu qu'on ferait les mises à jour à partir de lui même\n\nbeau projet!",
				"added": 1463184915
			},
			{
				"comment_id": 4,
				"body": "weedcoder : cyhperpunk, cryptoanarchiste.",
				"added": 1463184979
			}
		],
		"1_1GnAPT8ioRWpyqDkKrjLp1woEG3TBQgt87": [
			{
				"comment_id": 6,
				"body": "J'ai été dans la peur, puis la colère aussi.\nMais j'ai confiance.\nIl n'y aura pas de révolution, simplement une évolution.\nNos technologies nous permettent de nous passer des intermédiaires et des hiérarchies.\nEt c'est ce qu'il va se passer.\nLa majorité imposera son choix au pouvoir qui est par consensus cryptographique.\nEn fait, on va juste fuir cette civilisation parce que non, le nombre de personne s'étant aperçu qu'elle arrive a sa fin n'est pas petit. De plus, Il s’accroît.\nLa prochaine civilisation, celle vers laquelle nous allons, se trouve ici même.\nBienvenue! :) (prends tes outils et participe à sa construction, il y a du boulot!)\n\nJe prépare un article plus détaillé que ça sur la fameuse \"fin de la civilisation\". Je posterais ça dans le coin.",
				"added": 1463590479
			},
			{
				"comment_id": 11,
				"body": "J'ai toujours refusé de travailler dans la banquassurance parce que je déteste ce système.\nJe commence un nouveau travail le 1 août chez une très grosse banquassurance , mon but c'est de leur mettre la blockchain bitcoin dans leur système.\nLe meilleur endroit pour les faire plier, c'est de l’intérieur.\n",
				"added": 1464354192
			},
			{
				"comment_id": 13,
				"body": "ha! enfin un sujet de polémique :)\n@elnormand \"on sera mieux fliqué\", c'est très juste de dire ça. \"on sera plus fliqué\", j'aurais réagis. Je suis anarchiste, ça ne veut pas dire que je suis contre le travail de police. le protocole valide la chaîne. le protocole tu peux l'étudier et savoir que l'anonymat est permis sur une chaîne (voire plusieurs).\nAndreas Antonopoulos aborde la question du KYC (http://observer.com/2016/05/andreas-antonopoulos-kyc-bitcoin/)\n@up4 j'ai trahi mes principes? je déteste ce système, autant que toi apparemment ;) Je renonce pas à mes principes, je vais mettre les mains dans la merde pour déboucher les toilettes. J'y suis peut-être allé un peu fort en disant \"les faire plier\". De mon point de vue, ce système n'a que deux choix : ne plus rien avoir ou n'avoir qu'une toute petite partie. Je vais les accompagner techniquement sur la voie de ce choix qui n'en est pas un. (et ça c'est du presque politiquement correct, je m’entraîne déjà à faire passer la pilule... :) )",
				"added": 1464625429
			}
		],
		"1_12pnvfwuwBJJ3cFfbMEhZTQUod2qYUCKfb": [
			{
				"comment_id": 7,
				"body": "On va fusionner zeronet et openbazaar. twister va aussi faire partie de l'écosystème\ntor, c'est l'anonymisation, zeronet c'est le chiffrement et la décentralisation.\nle micropaiment en cryptomonnaie (voire nano paiment) va arriver pour remplacer le \"business model\" de la pub.\nil y a des cas d'usage pour l'internet des objets.\nintégrer le logiciel git à zeronet, ça va accélérer l'adoption.\nCe n'est pas exhaustif. Il y a tellement à faire...\n:)",
				"added": 1463591203
			}
		],
		"2_12pnvfwuwBJJ3cFfbMEhZTQUod2qYUCKfb": [
			{
				"comment_id": 8,
				"body": "Envoie le premier, on verra si ça débat ou si ça troll ;)",
				"added": 1463663763
			}
		],
		"2_1FMfUTXxZUWSFeW5LEXkSd4spVTtcq6TZS": [
			{
				"comment_id": 9,
				"body": "mega.nz c'est kim dotcom ça?\nle lien marche pas vraiment.\nessaie de poster ça ici :)",
				"added": 1463738423
			}
		],
		"1_1DeV6mYFwyYhQSrFbXgjFD2WX6pzUwLYdJ": [
			{
				"comment_id": 10,
				"body": "pour bitcoin, une solution supplémentaire, c'est https://www.bitwage.com/\nbitwage, ça appartient à Orange...",
				"added": 1464082053
			}
		],
		"3_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz": [
			{
				"comment_id": 12,
				"body": "\"Les milieux qui ont un impact durable sur la culture et le progrès humain carburent à un certain type de comportement social s'apparentant fortement à l'homosexualité masculine.\"\nTu parlais de Michel Foucault, je ne connais pas très bien son travail.\nA-t-il fabriqué une théorie explicative de ce phénomène?\nEst-ce la résultante d'une civilisation qui détruit l'hétérosexualité?\nQue penses-tu des femmes?",
				"added": 1464438711
			}
		],
		"12_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w": [
			{
				"comment_id": 14,
				"body": "un pull request sur le github, comme beaucoup de projets open source, pour démarrer la discussion.",
				"added": 1464625645
			}
		]
	},
	"comment_vote": {}
}