{
	"next_comment_id": 146,
	"user_name": "Quantumworld",
	"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
	"post_like": {
		"16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1540051619": 1543529859,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1546463665": 1546477564,
		"1NVpW6BGgWn3oPYAjvsVjyHoBqApQpsJaP_1547420080": 1547457456,
		"1NVpW6BGgWn3oPYAjvsVjyHoBqApQpsJaP_1547335131": 1547457458,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1547708984": 1547711321,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1547874527": 1547874568,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1547880644": 1547881996,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548873223": 1548902460,
		"1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1548985056": 1549003791,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548977213": 1549003854,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1549053113": 1549056377,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1549989173": 1549993955,
		"18UukzxVzEwd9ugyvKWYe2vud77GyL72Px_1550318918": 1550545882,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550668464": 1550669342,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550950223": 1550959737,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1551030317": 1551040826,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553464014": 1553462648,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553347359": 1553483969,
		"16NoJiiFLiV2Djs2dt97myjTNaWWj7CpyA_1553902716": 1553903111
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "You need some good white hat guys to test zeronet. I have been having problems today on this network that may be related to a communist country that does not want there citizens to have access to the us web. This is my 3rd user acct in 24 hours.",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1540051619",
			"date_added": 1543530050
		},
		{
			"comment_id": 2,
			"body": "That's it I am moving to China to report porn.. ",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1543097061",
			"date_added": 1543783222
		},
		{
			"comment_id": 3,
			"body": "I am new to zeronet. Can you explain what a tracker is and where to get more information about it?  ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1544796688",
			"date_added": 1544839331
		},
		{
			"comment_id": 4,
			"body": "Sorry, The day that Microsoft Gets it is the day the earth is burned by a massive fireball and the universe has been wiped out. No mater what MS does it is a predatory corporation out to steal data and use what it collects against there own user base. Until the day they fully release all closed source code for there Operating System's to open source, I will never let that run on my hardware. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1545977122",
			"date_added": 1545976916
		},
		{
			"comment_id": 5,
			"body": "@Tusiko: You just left out that all hardware has backdoor's in them. This includes every micro chip. So if you are delusional enough to trust any kind of data on your computer right now you probably need to go visit a medical doctor. Right now there is NO Security on any computer or satellite or power grid. Zero. Just Not Gonna Happen. \nSearch Vault 7 and it is just about .00001 % of what is really out there has been published.\nThey are stealing your information and using it against you. This is happening to everyone. Welcome to Electronic Communism. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1545420894",
			"date_added": 1545980015
		},
		{
			"comment_id": 6,
			"body": "That is a new user log in auto post for zeronet. I remember reading about it. However more documentation about it would be nice as well.\nMaybe change it to an alert message rather than a post? \nJust a thought. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1546183533",
			"date_added": 1546229023
		},
		{
			"comment_id": 7,
			"body": "Its Called Democrat's With Cars! \nYou should see the ones trying to plug in there gas cars into a charger. Dead serous.  ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1546376240",
			"date_added": 1546388021
		},
		{
			"comment_id": 8,
			"body": "I carry what I need to carry to get the job done if ever attacked. As being a reporter I have has over 126 attempts at my life so far. I became a master at energy physics. I cant explain how it all works but it does work all the time every time. If what you are doing is more important to everyone.  You will then have the protection you need. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1546325791",
			"date_added": 1546478446
		},
		{
			"comment_id": 9,
			"body": "Dont hesitate to post links to the other p2p sites. I am still new here.  The p2p is the future.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548505926",
			"date_added": 1548509043
		},
		{
			"comment_id": 10,
			"body": "@caryoscelus: Cryptocurrencies are fiat currencies that are all based on nothing and pure speculation. Eventually we will all wake up and understand that the all money we use is a form of slavery to the masters who created the currency. Until that day mankind will continue to make the same mistakes over and over again. \nHowever keep developing alternative platforms of p2p systems. Eventually we will get it right in the design.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548505926",
			"date_added": 1548553586
		},
		{
			"comment_id": 11,
			"body": "@caryoscelus: All of this Crypto currency is cutting edge computer science problems. I can see it now. An operating system that demands that you write code for it or give it /creators money or it will kill programs that you like to use. Sorry I just had another Microsoft flashback just now.  You know some evil Corp/gov is thinking about that now. Just imagine what it will be like with smart dust chips that can self destruct the user.   Oh technology!  I LOVE IT!!! (NOTE: Extreme Sarcasm included in this post!)",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548505926",
			"date_added": 1548562051
		},
		{
			"comment_id": 12,
			"body": "@Leftside: Careful Muker is watching.. Oh sorry it's Muller the Super communist spy from Russia's communist party. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548701481",
			"date_added": 1548789868
		},
		{
			"comment_id": 13,
			"body": "I have read the Koran 3 times so far. It is a book of pure SHIT! Basically it boils down to this. Muslims can do anything to anyone who is not a Muslim as long as it kills them. Even if they become a Muslim they can be killed. Its not a religion it is an act of war against all humanity. It is something that human beings must all wipe off the face of the earth. If we fail this task we will all die in ignorance and stupidity. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548873223",
			"date_added": 1548902727
		},
		{
			"comment_id": 14,
			"body": "I am 100% dual usage. 50% command line and 50% Gui. One without the other is only half a computer. \n((And Emacs as a Gui. ) (LOL!)) ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548826814",
			"date_added": 1548903289
		},
		{
			"comment_id": 15,
			"body": "@Zboy: You obviously don't know the koran.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548873223",
			"date_added": 1548956971
		},
		{
			"comment_id": 16,
			"body": "That is a really good idea. ",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1548985056",
			"date_added": 1549003813
		},
		{
			"comment_id": 17,
			"body": "I like the idea of it but I don't think it will be used that much. \n",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1548906186",
			"date_added": 1549004362
		},
		{
			"comment_id": 18,
			"body": "Mohamid would be so proud!  ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1549053113",
			"date_added": 1549062408
		},
		{
			"comment_id": 19,
			"body": "I would send you an annoying cat pic but its not allowed with comments.(Grrrr!)\nAnd I had a really good one to. This needs to be changed. \n@nofish \n\n\n",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1549079837",
			"date_added": 1549081251
		},
		{
			"comment_id": 20,
			"body": "I have not tried the android app yet. Looks a little buggy still.\n",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1549514312",
			"date_added": 1549514157
		},
		{
			"comment_id": 21,
			"body": "Why not?\n",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1549673135",
			"date_added": 1549673584
		},
		{
			"comment_id": 22,
			"body": "@Kaffie: I think that low activity will be soon changing. Zeronet is only 2 years old and still in alpha? Please correct me if I am wrong. The design of it is really good even though it is a work in progress.  ",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1549673135",
			"date_added": 1549691963
		},
		{
			"comment_id": 23,
			"body": "@Kaffie: Been reading the Zeronet wiki. Amazing design. Now to figure out a way to create a site counter on a Zite that would be accurate. ",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1549673135",
			"date_added": 1549701163
		},
		{
			"comment_id": 24,
			"body": "Stop talking about robot Mark Zukaberg like that... lol",
			"post_uri": "155V1pDJWxxohR8eNgocGarkipstcSEARJ_1549701533",
			"date_added": 1549709581
		},
		{
			"comment_id": 25,
			"body": "@Oncatcoaster: Eventually the code will turn on real users like it has on twitter spam bots. What program lang are you using to write this? ",
			"post_uri": "155V1pDJWxxohR8eNgocGarkipstcSEARJ_1549701533",
			"date_added": 1549724535
		},
		{
			"comment_id": 26,
			"body": "@Leftside: I can see a slowlorus type of code hitting the ai spam robot that would put it into a continuous loop that would crash it or worse.",
			"post_uri": "155V1pDJWxxohR8eNgocGarkipstcSEARJ_1549701533",
			"date_added": 1549729476
		},
		{
			"comment_id": 27,
			"body": "@Oncatcoaster: Hey if it works go for it! So far I have only seen light spamming of zeronet compared to other networks like twitter and facebook. For now zeronet has low traffic and that will change. Enjoy it..  ",
			"post_uri": "155V1pDJWxxohR8eNgocGarkipstcSEARJ_1549701533",
			"date_added": 1549742275
		},
		{
			"comment_id": 28,
			"body": "@Oncatcoaster: If you were using Lisp you would have allot more flexibility with ai. You are probably using python?",
			"post_uri": "155V1pDJWxxohR8eNgocGarkipstcSEARJ_1549701533",
			"date_added": 1549743728
		},
		{
			"comment_id": 29,
			"body": "Please make sure that the user has full control of the ai bot. And that way anyone could slip in say government censored words into the ai system that would cause harm to the users identity or privacy, or to the p2p network itself in a malicious manner.",
			"post_uri": "155V1pDJWxxohR8eNgocGarkipstcSEARJ_1549760404",
			"date_added": 1549762674
		},
		{
			"comment_id": 30,
			"body": "@nekololi: That would be several thousand across the world. Still a significant amount based on the age of this network. ",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1549673135",
			"date_added": 1549788564
		},
		{
			"comment_id": 31,
			"body": "You know they will come after you if you did that. Mark is pissed at how many people are leaving like you are. You know he will put out a hit on all the people leaving. He is totally insane. There are rumors that say he also eats lithium ion batteries. And some white paper says he was just a proto type from a D.U.B. research facility. I would keep a close eye on your smartphone. Charge it up in only fireprof spaces. ",
			"post_uri": "1NVpW6BGgWn3oPYAjvsVjyHoBqApQpsJaP_1549834104",
			"date_added": 1549835386
		},
		{
			"comment_id": 32,
			"body": "@Pigpog: Mark has super powers. He can read all the sites you go to with his super cookies. lol",
			"post_uri": "1NVpW6BGgWn3oPYAjvsVjyHoBqApQpsJaP_1549834104",
			"date_added": 1549840096
		},
		{
			"comment_id": 33,
			"body": "@Somename666: The earth is really a donut. lol  ",
			"post_uri": "1NVpW6BGgWn3oPYAjvsVjyHoBqApQpsJaP_1549834104",
			"date_added": 1549896434
		},
		{
			"comment_id": 34,
			"body": "@Somename666: Why is Zeronet so dam quiet.. This network needs users bad. All the social network tools are here.  All the dev's rock.. I think we need Zeronet spam outside of Zeronet. ",
			"post_uri": "1NVpW6BGgWn3oPYAjvsVjyHoBqApQpsJaP_1549834104",
			"date_added": 1549898026
		},
		{
			"comment_id": 35,
			"body": "Every time I go there no one is there. ",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1549907808",
			"date_added": 1549908994
		},
		{
			"comment_id": 36,
			"body": "@nekololi: I just saw that. Do you run that Zite?",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1549907808",
			"date_added": 1549909542
		},
		{
			"comment_id": 37,
			"body": "@Pigpog: So far cookie wins over doughnut. ",
			"post_uri": "1NVpW6BGgWn3oPYAjvsVjyHoBqApQpsJaP_1549834104",
			"date_added": 1549916210
		},
		{
			"comment_id": 38,
			"body": "I notice that the other day. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1549989173",
			"date_added": 1549993973
		},
		{
			"comment_id": 39,
			"body": "You can also add .gif support as well. In fact there is no Zites that support gif. Why?  Is there a security problem with .gif?",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550089835",
			"date_added": 1550093492
		},
		{
			"comment_id": 40,
			"body": "Question.. Is this a gif file? ",
			"post_uri": "1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp_1550054011",
			"date_added": 1550095389
		},
		{
			"comment_id": 41,
			"body": "@Piloth The Mack: That site is actually converted to video file format. R-click it and try to save it and it will say it is a video file format. \n",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550089835",
			"date_added": 1550095618
		},
		{
			"comment_id": 42,
			"body": "@Leftside: I just saw that.. Maybe they have gif support now.???",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550089835",
			"date_added": 1550095642
		},
		{
			"comment_id": 43,
			"body": "@Piloth The Mack: Not sure why there is a problem with adding gif support. Its just a file format not yet supported. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550089835",
			"date_added": 1550096458
		},
		{
			"comment_id": 44,
			"body": "What is your secret of posting an animated picture? Please tell..",
			"post_uri": "1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp_1550077454",
			"date_added": 1550096578
		},
		{
			"comment_id": 45,
			"body": "@Leftside: You must be from China.. lol",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550089835",
			"date_added": 1550096960
		},
		{
			"comment_id": 46,
			"body": "@loligod@zeroid.bit: What a Pain in the ASS to do.. Thanks for the work around and I doubt I will bother taking that many steps to publish a .gif image. I bet they are doing that to put that image click mask thing.  I bet it does not work on gif pics.  Some one has some open source code that will do it I am sure..",
			"post_uri": "1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp_1550077454",
			"date_added": 1550100512
		},
		{
			"comment_id": 47,
			"body": "Zeronet learning curve is about 3 days. One day of WTF and the other two days saying OMG!",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550141105",
			"date_added": 1550170915
		},
		{
			"comment_id": 48,
			"body": "Expect Zeronet to double over night. It wont take that much to do it either. I have noticed a 90% increase in traffic on my end. Outgoing and more nodes in the U.S. This is all good sign. I would give it another 3 weeks and Zeronet will be slammed with new users. My estimations is that it will double in 2/3 weeks. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550540053",
			"date_added": 1550544498
		},
		{
			"comment_id": 49,
			"body": "I want Zeronet to be a major source for News and information from all over the world.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550536184",
			"date_added": 1550545033
		},
		{
			"comment_id": 50,
			"body": "@Styromaniac: Renting? Just use a new computer.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550540053",
			"date_added": 1550551059
		},
		{
			"comment_id": 51,
			"body": "Mint or Ubuntu. Mint is the easiest to install and uses very little ram. Linux is very easy to learn. Search out how to install kde apps and you are good to go. The kde desktop is usually a bug fest nest of oddities. But you can use there apps on other desktop's without any problem.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550549673",
			"date_added": 1550551198
		},
		{
			"comment_id": 52,
			"body": "Wow you are on android? Btw how is the app for android I have never used it.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550549673",
			"date_added": 1550555092
		},
		{
			"comment_id": 53,
			"body": "You wont get allot of traffic after the fist major grab from your node to get the zite from you. I don't think that having a super killer connection will help allot unless you are serving video files. Then that would help for the first time seeding. Over all zeronet bandwidth is very low. And I am really surprised at how much little it needs. Zeronet should scale nicely as user grow and we wont need any special servers. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550540053",
			"date_added": 1550555383
		},
		{
			"comment_id": 54,
			"body": "The Democrats are Racist Nazi biggest that want a race war. Everything they are doing models the Nazi party in the 1930's. Every attempt to resurrect this Nazi ideology will fail even if they are currently cloaked right now posing off as little snow flakes of hatred and bigotry.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550548328",
			"date_added": 1550555660
		},
		{
			"comment_id": 55,
			"body": "@Styromaniac: noooooooo! No enterprise hard drives!!!\nPeople make the mistake of buying enterprise hard drives.  One data bit off and the drive will auto die on you. Unless you have a nice raid array don't do it.  Home drives do not do that. You can do a search of all the people who lost everything that had on an enterprise hard drive that was not hooked up on a raid system. This mainly effects ssd drives.\nJust make a system that has 16 gig + ram and lots of drive space. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550540053",
			"date_added": 1550556113
		},
		{
			"comment_id": 56,
			"body": "@Styromaniac: Hopefully you mean ram and not enterprise equipment. :)",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550540053",
			"date_added": 1550556329
		},
		{
			"comment_id": 57,
			"body": "@Styromaniac: You are fine then. I need a system upgrade here bad.  8 gig of ram just is not enough. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550540053",
			"date_added": 1550556651
		},
		{
			"comment_id": 58,
			"body": "@Styromaniac: Some time I will half to try it out. My spyphone sorry smartphone is disabled currently. I have had to many issues with the Chinese government inside the usa. I only will use it if I want to meet the MSS for another direct confrontation over there last operation they tried. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550549673",
			"date_added": 1550557130
		},
		{
			"comment_id": 59,
			"body": "@Styromaniac: Some day I will do a blog post on what they pulled with me. You wont have the same amount of attention like they gave me. I hit back infinite levels back at anyone who pulled what they pulled with me. Lets just say that we are 100% at war with China and with any left wing agents working for them.  I even got a dos attack about 18 min ago. lol Oh the evil scum they are.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550549673",
			"date_added": 1550558677
		},
		{
			"comment_id": 60,
			"body": "@Styromaniac: I have a bunch ready to go now but I have not published them yet.  Nothing spectacular. I have a bunch of computer stuff I need to get finished. Computers suck.  Oh ya when you move to linux don't feel bad if you need to re install the os for some tweek or another. Its normal to do that when you get to know it better. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550549673",
			"date_added": 1550564132
		},
		{
			"comment_id": 61,
			"body": "@Styromaniac: I cant get over the fact that I was once a Democrat. If I knew then they would be like this now I would have never joined them. I got out after 4 years of Obama. It was the best thing I ever done. I like Trump but I think he is also a possible globalist. Not sure yet.. Time will tell.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550548328",
			"date_added": 1550564475
		},
		{
			"comment_id": 62,
			"body": "@Styromaniac: Join the club on Distro hopping. I am still looking for the perfect Linux distribution. I like Mint now but I dont like some things about it. Fadora will be my next hop. I am from the Red hat Mandrake fork development days. Mint is one of the easiest ones to install but PC Linux installer kicks everyone's ass on an easy install with all the advanced technical stuff shoved behind a button. Other Linux distro's need to borrow there install programs.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550549673",
			"date_added": 1550597152
		},
		{
			"comment_id": 63,
			"body": "@Kaffie: Sorry the Democrats are the scum of the earth right now.  I walked away from the Nazi Socialist Democratic Party after I found out that they were indeed the Nazi fascists that they say Republicans are. Democrats are the Party of Total Lying Shit. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550548328",
			"date_added": 1550615786
		},
		{
			"comment_id": 64,
			"body": "Most if not all of our current leaders are all Satanic Child Molesters. They survive by blackmailing each other and killing those who are not a part of there satanic sex cult. I am looking for the full video of Hillary Clinton eating the face off of a 9 year old girl.  I think the video needs lots more views to promote the Democratic party. (Evil Grin!)",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550942595",
			"date_added": 1550958049
		},
		{
			"comment_id": 65,
			"body": "@Styromaniac: One of many. Monsanto was one of the worst but there are hundreds more like them. That is why I am here. I got tired of getting my News sites being wiped off the web because of some hot story. And allot of other things went on to. P2P is the only way to get the info out and away from censors. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550942595",
			"date_added": 1550959445
		},
		{
			"comment_id": 66,
			"body": "We need to get the Satanists and child killers. The elite  have used sex blackmail going back before the Bible was written.  Ever noticed that all European castles have a dungeon. This was not for slavery. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1550950223",
			"date_added": 1550960136
		},
		{
			"comment_id": 67,
			"body": "Thats like trying to make a Linux distribution without users and without developers and hoping it gets better. So far my marketing on zeronet has increased zeronet new users by 45%. I am basing this on U.S. Peers over the past 7 days. So people are looking for a de-centralized network now. We need to market the hell out of Zeronet and have a user base that actually is engaged on social media. Why is zeronet going after the 1% user base and it should be going after the 99% user-base. Sorry I see any more Plushie Fuckie sites on Zero-net I am going to Vomit.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1551021462",
			"date_added": 1551020768
		},
		{
			"comment_id": 68,
			"body": "@Styromaniac: We need to market the hell out of Zeronet. I have already noticed that all world governments hate Zeronet. This is a really good sign. We just need more marketing push to get past the 10% communist/cia social controllers out there. Also zeronet is on a .io and for what ever reason .io sites get un noticed. We need a .com site to promote zeronet. A working p2p network scares the Fuck out of control freaks. And it should because they will loose there power to algorithmicly control people. We need to increase the marketing volume level of Zeronet to 150%. If we don't there is a good chance we will loose the entire Internet to a global technology dictatorship and only approved words will be allowed to be spoken. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1551021462",
			"date_added": 1551021799
		},
		{
			"comment_id": 69,
			"body": ":)",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1551039031",
			"date_added": 1551038528
		},
		{
			"comment_id": 70,
			"body": "@Kaffie: It never was. I am only a node. One of many.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1551021462",
			"date_added": 1551067563
		},
		{
			"comment_id": 71,
			"body": "Jack Dorcey is Twitter and everyone else needs to leave twitter so that Jack Dorcey is popular. This is how he thinks and this is how he works. The universe revolves around Jack Dorcey. Just ask jack he will tell you this. And he doesn't give a dam what anyone else thinks cause he is Jack. The lesson of Twitter is don't play in Jack Dorceys sand box or you get sand thrown in your face. And remember all ideas come from Jack. That is after he steals them and makes them his own.",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1551127430",
			"date_added": 1551162937
		},
		{
			"comment_id": 72,
			"body": "Reddit would never censor.. lol",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1551635802",
			"date_added": 1551642667
		},
		{
			"comment_id": 73,
			"body": "Tencent Buys Stake In Another U.S. Social Network -- Reddit\nhttps://www.fool.com/investing/2019/02/08/tencent-invests-social-platform-reddit.aspx\n\nI never liked Reddit and still don't like it. However selling it to China is a very bad move.  If they sell it to China they need to force only Chinese characters only and remove the English side of it completely. Most Reddit users are regressive zombies anyway.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1551635802",
			"date_added": 1551718762
		},
		{
			"comment_id": 74,
			"body": "How ironic. The United Nations are the main ones trafficking children. ",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1552186111",
			"date_added": 1552196859
		},
		{
			"comment_id": 75,
			"body": "I have 495 peers U.S. and 363 China. You have much more Zeronet to discover.  ",
			"post_uri": "14Jt9sxL6kaXBqgKppfZC9KiFV6JsZeNSx_1552324963",
			"date_added": 1552330366
		},
		{
			"comment_id": 76,
			"body": "All smartphones have this. Unless you can jail break them and even then it is still in hardware.  If you want to get off the spy grid turn off your Android and Apple devices. You will notice a difference in 30 to 60 days.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1552262114",
			"date_added": 1552330527
		},
		{
			"comment_id": 77,
			"body": "Zeronet is perfect for News sites. It will change soon. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1552246201",
			"date_added": 1552330598
		},
		{
			"comment_id": 78,
			"body": "Zeronet just needs active users that post new content. Sometimes I feel like Zeronet is an abandoned Theme park. Lots of rides but no one is there. Yet! ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1552246201",
			"date_added": 1552330785
		},
		{
			"comment_id": 79,
			"body": "@klu9@zeroid.bit:  He is probably sleeping on python 3 code. Lots of big changes with python 3. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553471401",
			"date_added": 1553476468
		},
		{
			"comment_id": 80,
			"body": "How is the zeronet phone app? I don't use a smart phone.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553487490",
			"date_added": 1553488460
		},
		{
			"comment_id": 81,
			"body": "Problem is with data speed communication between chip sets. They are all different clock speeds. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553511274",
			"date_added": 1553510220
		},
		{
			"comment_id": 82,
			"body": "It will flop because it is Google. No one trusts them for anything now. Once they loose the consumers trust companies like Google tank fast. I can tell you horror stories about google's censorship and data selling.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553511555",
			"date_added": 1553510355
		},
		{
			"comment_id": 83,
			"body": "@Styromaniac: The worst hit I had was when every LCD screen died for 2 minutes here at the same time. They can kill computer chips from cell towers now. Believe it or not. I got a leak from some one who told me the name of the equipment they used. I use a mechanical typewriter now for anything important that I am working on. We live in a very sick world now.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553511555",
			"date_added": 1553511371
		},
		{
			"comment_id": 84,
			"body": "Finally some interesting hardware. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553623312",
			"date_added": 1553695370
		},
		{
			"comment_id": 85,
			"body": "Don't worry. Soon posting on twitter will be a copy right violation because twitter is copy righted. I feel a global revolution will happen very soon. Those in charge will have no where to hide. ",
			"post_uri": "14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy_1553609901",
			"date_added": 1553695585
		},
		{
			"comment_id": 86,
			"body": "That is the down side to having a cat. I want a windows cat. That way I know it will crash all the time. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553609300",
			"date_added": 1553696026
		},
		{
			"comment_id": 87,
			"body": "Let me guess you just quit smoking? lol",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553700621",
			"date_added": 1553699846
		},
		{
			"comment_id": 88,
			"body": "An Open Source search engine needs to replace google. We need a decentralized way to run a search engine on all computers on clearnet. I bet this is already being done now. Google is just a giant spider bot. How the rest of it works internally would be very interesting to know about. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553755424",
			"date_added": 1553757575
		},
		{
			"comment_id": 89,
			"body": "There is a lot more out there. And we are not alone in the universe. And remember if you are out at night or in the daylight and you see something like a light in the sky. Do not approach it. They may be taking samples. \n(Dead Serous!) The rest you don't need to know about.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553755182",
			"date_added": 1553757864
		},
		{
			"comment_id": 90,
			"body": "@Styromaniac: Exactly..\n",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553755182",
			"date_added": 1553763962
		},
		{
			"comment_id": 91,
			"body": "@Moor: Maybe some one has hacked Google and can leak some info. That would be priceless info..",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553755424",
			"date_added": 1553764055
		},
		{
			"comment_id": 92,
			"body": "@Styromaniac: So its true that Google back engineered the 8088 processor and are working on a break away civilization of 8 bit computers using reverse logic. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553755424",
			"date_added": 1553768754
		},
		{
			"comment_id": 93,
			"body": "It just means you don't have the stomach for it. That's all.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553769998",
			"date_added": 1553768880
		},
		{
			"comment_id": 94,
			"body": "@leftside: I was vegan for about a year.  I hated it. Felt like I was starving all the time. Now I only eat meat with some veggies. I will never go vegan. And everyone I know that was a life long vegan has died of cancer. Probably related to the pesticides they were using.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553769998",
			"date_added": 1553770861
		},
		{
			"comment_id": 95,
			"body": "I like pie.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553769998",
			"date_added": 1553771707
		},
		{
			"comment_id": 96,
			"body": "@Styromaniac: Nothing. Diet is an individual thing. Everyone is different. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553769998",
			"date_added": 1553771951
		},
		{
			"comment_id": 97,
			"body": "Bison meat is the best meat. Very expensive but worth the price. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553769998",
			"date_added": 1553772081
		},
		{
			"comment_id": 98,
			"body": "Burner phones are awesome.  I got a 9 dollar phone a couple of years ago and it had all kinds of stuff on it. I was shocked actually.  At lease with a burner phone they cant track you if you pay cash.  However voice print is another issue. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553769998",
			"date_added": 1553772455
		},
		{
			"comment_id": 99,
			"body": "The only way to do it right is to grow your own food. And kill your own meat. Maybe then I may become a vegetarian again if I had to do that. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553769998",
			"date_added": 1553772590
		},
		{
			"comment_id": 100,
			"body": "I have a juicer. 5 lbs of veggies = 8 oz of juice. I stopped using it because it was just to expensive. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553769998",
			"date_added": 1553772752
		},
		{
			"comment_id": 101,
			"body": "I have actually. I am a very good cook. My diet is ok not the best not the worst. I got into micro volting at high voltage to kill off viruses. It actually works very well. I read a bunch of stuff from Royal Rife and built a circuit out of his information. It will kill a cold in a day. Down side is you get a bit of a rash from the electricity. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553769998",
			"date_added": 1553773150
		},
		{
			"comment_id": 102,
			"body": "@Quantumworld: https://en.wikipedia.org/wiki/Royal_Rife\n\nThis is the guy. It really works. I understand electronics like the back of my hand and I read up on what he made and just knew it would work. But I was a skeptic until I tested it. I think it saved my life more than on one occasion. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553769998",
			"date_added": 1553773415
		},
		{
			"comment_id": 103,
			"body": "Another link to the frequencies http://www.rifevideos.com/dr_rifes_true_original_frequencies.html\nThis is the stuff they don't want you to know about. It will cure most cancer since it is a virus. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553769998",
			"date_added": 1553773558
		},
		{
			"comment_id": 104,
			"body": "@Styromaniac: LOL.. No dont do that.. I came to close on many occasions not worth it.  I missed a direct hit by 6 feet from a tree. Every dam filling in my mouth turned into a battery. For 2 weeks it felt like I was eating metal. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553769998",
			"date_added": 1553773714
		},
		{
			"comment_id": 105,
			"body": "@Styromaniac: yes actually they do make some. Sota interments makes one that is a blood purifier.  There are several other companies out there as well. You got to do some serous research to make sure they are legit or not. For me it was easy. I looked at the schematic and and checked if it would work. \n\nhttps://www.sota.com/default.aspx?page=Silver-Pulser",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553769998",
			"date_added": 1553773977
		},
		{
			"comment_id": 106,
			"body": "@Styromaniac: You can build the circuit yourself and it will cost about $60 to do it. You can download the schematic and parts list. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553769998",
			"date_added": 1553774393
		},
		{
			"comment_id": 107,
			"body": "Minimum you will need to run the unit for about a hour to notice an effect. I have gone as long as 8 hours when I was really sick. I changed arms after about 4 hours. I use mine about once ever 30 days for 3 day and 3 hours each time. You will need to build up to that level of usage. (tolerance to the voltage.) It has even cured a real bad bronchitis I had. The more voltage you feel the better it is working. Its only about 2 million volts from a 9 volt at 1000 micro amps. It wont kill you. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553769998",
			"date_added": 1553774961
		},
		{
			"comment_id": 109,
			"body": "@leftside: It was a horrible 8 bit joke. I tried my best to keep it funny but I failed in the binary coding. Must be an irq problem. lol,, Ok that just went over everyone's head there.. \nI am going to stop.. lol\n",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553755424",
			"date_added": 1553824304
		},
		{
			"comment_id": 110,
			"body": "Just Fork it! \nCreate a selection option to display feed styles. \nBoth have advantages and disadvantages. Maybe even make another option to display. Goal is user choice. A win win for everyone.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553777248",
			"date_added": 1553903060
		},
		{
			"comment_id": 111,
			"body": "Welcome to Zeronet. I love everything about it. And it is nothing to what it will be in the future. ",
			"post_uri": "16NoJiiFLiV2Djs2dt97myjTNaWWj7CpyA_1553902716",
			"date_added": 1553903186
		},
		{
			"comment_id": 112,
			"body": "I am so angry every day I know I could destroy solar systems in a thought. Its a small miracle it has not happened yet.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553920186",
			"date_added": 1553922390
		},
		{
			"comment_id": 113,
			"body": "This post was so offensive. O.M.G! \n(I suffer from twitter ptsd)",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553939402",
			"date_added": 1553939890
		},
		{
			"comment_id": 114,
			"body": "@Styromaniac: Get out of my head! lol",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553920186",
			"date_added": 1553943123
		},
		{
			"comment_id": 115,
			"body": "@Styromaniac: No.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553920186",
			"date_added": 1553943368
		},
		{
			"comment_id": 116,
			"body": "@Styromaniac: Are you?\n",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553920186",
			"date_added": 1553943398
		},
		{
			"comment_id": 117,
			"body": "I do suffer from twitter ptsd",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553920186",
			"date_added": 1553943562
		},
		{
			"comment_id": 118,
			"body": "I keep having nightmares of Jack Dorcey following me on twitter and I cant block him and everyone's attention span turned into 128 characters.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553920186",
			"date_added": 1553943753
		},
		{
			"comment_id": 119,
			"body": "My life is satire. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553920186",
			"date_added": 1553943941
		},
		{
			"comment_id": 120,
			"body": "@Styromaniac: I agree. The article is very good other than a typo.  (Always Do Your Bes-) Should have a t at the end. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553939402",
			"date_added": 1553945225
		},
		{
			"comment_id": 121,
			"body": "@Eightyfour: I think that Mark Zukaberg is really an advanced Boston dynamics robot. And that there are millions of exact duplicates of him that will be replacing humans once twitter, facebook and google bans all there user base for being a racist skin color.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553920186",
			"date_added": 1553951102
		},
		{
			"comment_id": 122,
			"body": "That is a Hitler dog. Just look at that reincarnated Nazi.. lol",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553941562",
			"date_added": 1553954391
		},
		{
			"comment_id": 123,
			"body": "@Styromaniac: That is exactly what I thought.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1553920186",
			"date_added": 1553954826
		},
		{
			"comment_id": 124,
			"body": "Sounds interesting tell us more. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1554081391",
			"date_added": 1554159366
		},
		{
			"comment_id": 125,
			"body": "You manually take snapshot of a frame in the video and upload it. A total pain in the ass to do. This is the price we pay for p2p until some one codes ffmpeg to randomly read the video being uploaded (copied over to zeronet for distribution) and takes a snapshot of the video.  A small script hack here will fix the problem.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1554030226",
			"date_added": 1554159937
		},
		{
			"comment_id": 126,
			"body": "@Styromaniac: I stopped gaming years ago. Huge waste of time doing nothing. Even though I was very good at it. I now prefer beating my brains out learning Emacs and writing code, and fixing Emacs after writing code. (Repeat cycle to infinity) And it is true that Emacs is the only real operating system that all computers use. lol",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1554021223",
			"date_added": 1554160319
		},
		{
			"comment_id": 127,
			"body": "I use the block feature on Zeronet. It has to be one of the best block systems I have ever used. 99% of the Nazi posing right wingers are Democrats working for the splc. They all will get a block when they are discovered.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1557004279",
			"date_added": 1557011606
		},
		{
			"comment_id": 128,
			"body": "@Styromaniac: No, I missed all of that stuff. I have been off zeronet for about 3 weeks doing a major system upgrade here. If they are doing that stuff it is spam. I try not to use other peoples block lists. However where do you go to find your blocks? And where a block list is located at.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1557004279",
			"date_added": 1557012767
		},
		{
			"comment_id": 129,
			"body": "@Styromaniac: I am using kaffies block list so I cant see anything if this person is on that list. I probably should turn that block list off even though it is handy.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1557004279",
			"date_added": 1557013229
		},
		{
			"comment_id": 130,
			"body": "@Styromaniac: I just turned off kaffies block list just to see the spammers on zeronet once again. Zeronet needs more users online. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1557004279",
			"date_added": 1557014038
		},
		{
			"comment_id": 131,
			"body": "@KxoBot: He was just making death threats and saying that everyone needs to commit suicide on the comment section. Very juvenile behavior for a wannabe text troll. Personally I think he was constipated and the shit was rolling out of his fingers. I get banned everywhere for being very direct, crude and offensive. I just don't understand why.\n(Individual user sarcasm implied.)",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1557004279",
			"date_added": 1557088711
		},
		{
			"comment_id": 132,
			"body": "Spammers are the problem. The only people I will block are the ones that fit the Intel psyop group mo. I have several that I have blocked already. Like the real racist posters from the splc. ",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1557289846",
			"date_added": 1557305684
		},
		{
			"comment_id": 133,
			"body": "Its a good idea to just set the admin password for them. That way you can help them out as a favor. :)",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1557725429",
			"date_added": 1557786490
		},
		{
			"comment_id": 134,
			"body": "@Styromaniac: Just set the password to keep all the bad people out. Later on you can hack there devices out and leave them a message. \"I Own You!\" Just to let them know that all there devices are secure. lol",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1557725429",
			"date_added": 1557792636
		},
		{
			"comment_id": 135,
			"body": "@Styromaniac: I knew about it 35 years ago. Good its public now. It may have been classified before. I don't know. I never signed anything so fk it. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1557725429",
			"date_added": 1557799314
		},
		{
			"comment_id": 136,
			"body": "@Styromaniac: I did lots of computer consulting for some big RD places years ago. The stuff that we have that is not public is totally mind blowing. And that was 30 years ago. They still wont talk about the gravaton. Oh well we will all die before we get really green energy. Greedy Oil companies wont let us have the good stuff. Then they bitch about Climate change. They are all hypocritical scum of the earth. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1557725429",
			"date_added": 1557806283
		},
		{
			"comment_id": 137,
			"body": "He had a MAGA moment. It's in the Frog.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1558367354",
			"date_added": 1558634312
		},
		{
			"comment_id": 138,
			"body": "Good vid. And a really good data stream. I think zeronet is ready for allot more users.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1558319875",
			"date_added": 1558634569
		},
		{
			"comment_id": 139,
			"body": "What did you do?\n",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1558829921",
			"date_added": 1558834917
		},
		{
			"comment_id": 140,
			"body": "lol",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1558868355",
			"date_added": 1558867257
		},
		{
			"comment_id": 141,
			"body": "They are sucking data from your phone and the company is probably from China. Root your device and run a sniffer on the data activity going out from your device and do a trace route. In my view China needs to be turned into Glass by multiple nuclear devices to save the universe from xi jinping.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1558883835",
			"date_added": 1558903957
		},
		{
			"comment_id": 142,
			"body": "@leftside: Wireshark is one. I think there are several ones on android. Sniffing that I am talking about is on the wifi. Testing it on the cell network I have not yet done. Something I plan on doing in the future. I do not trust any smart phone for anything you would want secure. It is a spyphone. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1558883835",
			"date_added": 1558937478
		},
		{
			"comment_id": 143,
			"body": "@Styromaniac: \n@Quantumworld: \nI have an android tablet and I only connect to the internet about twice a year with it. I found log files that were recording audio voice data and sending it back to some place in China. I could not trace down the app that was doing it. After disconnecting it from the web I no longer got targeted adds on my computer and cable. Smart phones are nothing but a spy. Its in the hardware and the only way out is to not use them. You cant flash the bios because it is embedded in the chipset. They even have bio metric wave systems that can trace you down to about 3 inches no matter where you are at in the world. These are the same devices that thy use to track unknown arial vehicles and there occupants. I cant tell you what it is called because I really dont want another mib encounter. Although they are rather fun when they do show up. If you want to know more dig into seamans  (misspelled on purpose) and what they make.  Make sure you are on tor and everything else you can think of to keep anyone from knowing who you are. Dig into the ic master data sheets. You will need a strong electronics background to decode there schematics. Its rather interesting the things you can find out about electronic hardware. Welcome to the rabbit hole. And dont forget Dayton Ohio. We did not just create this tek from nothing it was a tek trade. ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1558883835",
			"date_added": 1558963038
		},
		{
			"comment_id": 144,
			"body": "You obviously are not on the same level that he is then.\nYou have no idea what is out there. And if you did you would shit yourself.\n\nGreat video. I love it.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1559014224",
			"date_added": 1559013675
		},
		{
			"comment_id": 145,
			"body": "@Styromaniac: You are in it regardless your what your perception is now. Its all quantum physics. \nLike I told this CIA telekinetic psychic opp punk that was trying to get me to join there team by blackmail and bribery.\n\nThe day you can do what I can do is the day I will take orders from you. Until that day you will be taking orders from me. He suddenly lost control of his bladder and bowels.  (True Story)",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1559014224",
			"date_added": 1559014508
		}
	],
	"flags": {},
	"comment_like": {}
}