{
	"next_comment_id": 9,
	"user_name": "Maycontainnuts",
	"hub": "1H51ZJ118ubwYAceszZ6CRMp4MPaSwcMh1",
	"post_like": {
		"1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1632584039": 1632895050
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "Just set up my identity, please reply to me instead of the anonymous ID below.",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1592081395",
			"date_added": 1592101285
		},
		{
			"comment_id": 2,
			"body": "Nevermind, I'm an idiot it didn't send in the first place. Here is the comment I left.\n\nDisclaimer, I'm a complete noob.\nShortly after reading this post I came across something called a seedbox, I've never used one and don't know anything about them but they sound like what you're after.\nHere is a link to wikipedia and a list of some cheap options.\n\nen.wikipedia.org/wiki/Seedbox\n\nhttps://cheapseedboxes.com/top-10-seedbox-best-providers-cheap/\n\nSome of these go up to 10Gbs with unlimited transfer.\n",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1592081395",
			"date_added": 1592101405
		},
		{
			"comment_id": 3,
			"body": "Really appreciate what you're doing BTW, it's so easy to forget what goes where after you've spent some time troubleshooting equipment. (cars/tools in my case)\nIf it's only going to be a small number of people accessing files at any one time, you could probably get away with hosting the files yourself. A 10Mb/s upload speed will give you, theoretically, 1.25MB/s. That is enough to upload a 15MB file in 12 seconds, seems like a good place to start. If you decide that isn't enough for $3/month with SeedFast you can get a seedbox with:\n50GB HDD (over 3 thousand 15MB files)\n1TB monthly (66.5 thousand 15MB files)\n1GB/s (66 15MB files per second)\nNote, I'm skeptical about the network speed as many other services with that speed cost significantly more but even if it only delivers 100MB/s that is still 6.6 files per second.\nPS. if you have any pictures of an EliteBook 6930p let me know, nothing wrong with it at the moment but you never know when that information will be useful.\nPPS. Have you ever heard of Louis Rossman? He is a big right to repair advocate who produces tutorial videos on YouTube. He will almost certainly be interested in your project, and tell his viewers about it, link to his YouTube channel below.\nhttps://www.youtube.com/user/rossmanngroup\n",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1592081395",
			"date_added": 1592105602
		},
		{
			"comment_id": 4,
			"body": "@Lajos Nagy: Right to repair/modify/upgrade is vital to actually owning your product, John Dere customers found that out the hard way and now 30-60 year old tractors are going up in price rapidly. Similar shady crap is apparently going on in the car world with certain components assigned unique ID codes. If you take an identical part from one vehicle and put it in another, the car's computers will refuse to communicate until an \"unlock code\" is transmitted to the computers. Now this code is, of course, included for free if you get the part fitted at a dealership. If however you decide to do the work yourself or via an independent mechanic, be prepared to open your wallet.\nApple Macbooks have the SSD storage soldered to the board and use a custom controller chip with a similar ID code system, so in the event of controller failure you can't de-solder the SSD and connect it to a donor Macbook to recover data. Please note I read that about Macbooks a while ago and can't find the source now, so I advise you do your own research instead of taking my word for it.\n|\nOh BTW I have my own seedbox now, with SeedBox IO, €5.00 a month with 12.5MB/s upload and unlimited data transfer. I looked at a lot of options and this one fits my use case, though if you are looking at under 1TB/month throughput, you can get much higher speeds for the same price. I chose mine because it can do 33TB/month even though it's not that fast, but I don't think you will go above 1TB so you should go with a 125MB/s(1Gb/s) as that will allow you to be the sole seed for 10 users and still deliver good performance. I get the feeling that each files is going to be accessed sporadically potentially downloaded less than once a month, this means you will probably be the only seeder at any given time. While an FTP server running on a VPS might be a better choice, with similar performance and price. Torrenting is more user-friendly for people unfamiliar with FileZilla as all you need to do is click a link in a browser and your BitTorrent client does the rest and if someone wants to share your files to their own community they can just copy that link.\n|\nIf you decide to go with torrenting send me a link and I'll host your files on my seedbox set to high priority, though I recommend you also torrent them yourself in case I stop paying for the service, even just using your home internet will provide reasonable redundancy.\nAlso if you do get a seedbox, regardless of your stance on piracy, please consider seeding popular movies and TV shows. There are currently a lot of people all over the world in really shitty financial situations, particularly in the third-world where benefits/welfare systems are almost non-existant. It is in the interest of any compassionate person to encourage these people to remain at home and avoid social interaction. It will be much easier to convince people to stay at home if they have access to entertainment, even if they can't afford to buy it. The media companies are already making a killing off this pandemic, so I don't feel bad about sharing the files. In fact I wish I discovered this service when lockdown began, by now I could have provided over 50TB of entertainment to disadvantaged people all over the world, who couldn't pay for it anyway.\n|\nOn the topic of Louis Rossmann I really think you should reach out to him about your project, he readily jumps on anything that helps his viewers repair their machines, if these pictures are of modern (around £1000 second-hand value) laptops he may want to use the pictures as teaching material. \n|\n30MP, that sounds like a nice camera, I have a Nikon D90, with a mere 12MP APSC sensor. Still it produces good results, especialy with the 35mm 1.8G prime. I have always been more technical than artistic so I'd like to try a similar project myself, I just need to find a good subject.\n|\nPS. any advice for a ZeroNet newbie, any good zerosites you think I would like?",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1592081395",
			"date_added": 1592270861
		},
		{
			"comment_id": 5,
			"body": "@Lajos Nagy: Also you could publish the files on Freenet, I have never published there myself so I don't know whether you will run into some technical limitation, If you ask on their forums I'm sure someone will advise you. Freenet is a decentralized network, similar to ZeroNet but with an emphasis on censorship-resistant file sharing and a UI that looks like it's from the mid 90s. Members of the network give up some of their HDD space to store files and upload them to other members.\n| \nAs far as I am aware, ZeroNet offers similar functionality, though I don't really understand it quite as well as Freenet but I think it can store your files on other peoples computers in a similar way.\n|\nObviously this isn't a Mass-Market solution but it would be nice to use this awesome service we have in tandem with FTP or BitTorrent. Because, lets face it, the more people that use networks like this for positive and legal reasons the less ammunition legislators will have against us.",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1592081395",
			"date_added": 1592273858
		},
		{
			"comment_id": 6,
			"body": "@Lajos Nagy: I'll have to look into ThinkPads, they sound like a good option for running Linux servers. I already have a VPS running Ubuntu 20.04 LTS for my i2p router, but I would like to have some physical servers at home.\n|\nServers are pretty cheap on eBay, however most of them are 1U servers like this. \nhttp://www.norcotek.com/wp-content/uploads/2015/05/rpc-150_2.jpg\nThese things are LOUD and often have far higher performance than is necessary for any home project.\n|\nI think I should look for some laptops with broken screens, for the sake of price/performance, and convert them into basic servers.\nThere are a lot of advantages in doing so, like the fact you have a built in UPS, hot-swappable PSU and potentially 4G automatic fail-over if your internet goes down.\nThe laptops can be stored in a rack much smaller than what is used for servers, if you want to manage the server just remove it from the rack and plug in a HDMI monitor.\nI could even set up custom commands for certain functions, that I can use without connecting a monitor.\nObviously though I would do most management with SSH as I am lazy, I could even buy a thin-client, install Linux and use that as my OpenSSH portal.\n|\nOr maybe I'll just buy a server with 2 processors with 8 cores each, 64GB RAM and 6 3TB SAS drives in RAID6.\nI have a shed so space and noise aren't a problem, a system like that could run 10 Kubernetes containers no problem.\n|\nOn the topic of backups I'm thinking about getting an LTO4 tape drive for backing up my RAW files. The drives go for £50 and the tapes cost £8-15 depending on whether you buy new or used, each tape holds 800GB of data, that's about 80,000 10MB RAW files. Then I can down-res and compress the images to less than a megabyte to store on my HDD. Because of the cheap storage I can make 2 copies of the files and keep one of them at my grandmother's house, so if my house burns down I just have to buy a new drive and collect the tapes. I would store the tapes in zip-lock bags, filled with argon gas from a disposable welding bottle, which costs about £10 and will fill a few hundred bags.\nIs this overkill? YES but if I want to recover something 50 years from now I will have extreme confidence.\nAssuming the drive is constantly running it could be a powerful protection against ransomware, if I can prevent the drive from being able to overwrite data and disable encryption until the files have been written by the tape drive. I have heard of ransomware that can install itself and encrypt files as they are created, some time later it deletes the private key and the infamous pop-up appears, this can defeat cloud backups as the files there will be copies of the encrypted files.",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1592081395",
			"date_added": 1592347971
		},
		{
			"comment_id": 7,
			"body": "I looked at UltraSeedbox, that sounds like a beastly plan, still if you post the link here I'll host it on my box as well.",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1592081395",
			"date_added": 1592358027
		},
		{
			"comment_id": 8,
			"body": "It's probably best to upload the URL to Legit Torrents as well as the other more popular torrenting sites.\n|\nhttp://www.legittorrents.info/\n|\nThese files will most likely be passed around in forums, and links to KickAssTorrents or The Pirate Bay will likely make admins a bit twitchy.\nArchive.org has a similar torrenting service you should check out, I think they will host the files for free too and provide HTTP download links.\n|\nwww.archive.org\n|\nhttps://archive.org/details/bittorrent%26tab=forum?tab=about",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1592081395",
			"date_added": 1592360904
		}
	]
}