{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1554997177,
			"title": "Request for financial help",
			"body": "My scream for help",
			"added": 1554997176
		},
		{
			"topic_id": 1555419112,
			"title": "Notre Dame",
			"body": "Be careful",
			"added": 1555419110
		},
		{
			"topic_id": 1557931740,
			"title": "I will help bad people",
			"body": "From now on, I will help bad people. I will help criminals, murderers, pedophiles, thieves. That's how Your law works. You created a monster. I was a really good person.",
			"added": 1557931737
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1554997177_1CVLeFVQw2wWbBdpM5PtQhtzd7wjKzB24b": [
			{
				"comment_id": 1,
				"body": "Hi, I won't lie, You don't know me, I will not try to convince You about my case. I just need money for an attorney. I took a loan, pretty big one, to pay for a lawyer. I have to pay it back. If You happen to have more money than you need, here are my wallet addresses:\nBITCOIN: 17uv6oRPFwWpgy3tfH5pYFiVAbWBAxW9h5\nLITECOIN: LgoEqZmnoBRbE4Nr2iDZgU5oMFFhCpKAwK\nCARDANO: DdzFFzCqrhspw25kPuZTrXpWas9Z7g4HQY2oJ6KTgSnkrLJ8X3BVH38KnfyeXuz1y2PBG5UZcQUPDGJ47zhE3ASd6K3o9UEDP9v8uiXw\nETH: 0x98a7743812671c30777F58a86249024f56F12E3C\n\nI'm trying to live after a very very big loss, so every penny matters. I have a job, but it's just not enough.\nThank You.",
				"added": 1554997644
			},
			{
				"comment_id": 2,
				"body": "> [accumonkey](#comment_1_1JVUxDzQdXwM9ZBxqFVRqCdYJGBTiHo4Hs): Have you considered that they can't bleed a stone? If you have no assets, then they cannot take from you. It's that simple. What you have to consider is can you live a very, very simple life until the debt is forsaken legally by the owner?  [...]\n\nI want to pay this back. It's not about not paying. I can \"disappear\" almost anyone I'd like to. I'm just not a bad person. Many people ask for money in much more simple cases, so why shouldn't I?",
				"added": 1555418923
			},
			{
				"comment_id": 4,
				"body": "> [itcouldbebetter](#comment_7_1Bq5MFcXziGbE4maPUuDBWZ4LRcmDnYqfK): Clearly, you having access to a laptop, internet connection, and browsing ZeroNet makes me think you're not in financial trouble. Maybe ask somewhere else, people aren't gonna spent money on some stranger who could be lying (and probably is).\n\nYes, I can lie, like everyone. You just can't check that.",
				"added": 1555420733
			}
		],
		"1555419112_1CVLeFVQw2wWbBdpM5PtQhtzd7wjKzB24b": [
			{
				"comment_id": 3,
				"body": "This is why You never, ever attack people You don't know. Not even once. Please, don't harm each other. Don't attack someone if You can't be sure how is he/she gonna retaliate. Think before You harm someone. Does not matter if you are an electrician, a judge, or a policeman. Doesn't matter if You go by the law. Doesn't matter if You are the law. Just don't.",
				"added": 1555419449
			}
		]
	},
	"comment_vote": {}
}