{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "区分对待中共、“伪共”，血腥红极权暴政和支持宪政的早期红军",
			"body": "文贵说，海外6千万华人，有两千多万关注文贵爆料，中国大陆十几亿人，即使是在伪共支那蛆施行的比蒋介石伟人更加残酷野蛮的白色恐怖、丛林暴政、支那粪坑级别的大封锁、大扫荡、大洗脑、大腐蚀之支那专政—— 数万年以来都极其罕见的、严重背离红军革命初衷的血腥红极权暴政，仍然有超过三分之一的人长期关注文贵爆料，而且随着危机加剧，会有越来越多人加入挺郭维权，清除伪共，反蛆除孽，恢复中华！\n一些网友自称是来自大陆的“人”，如果这个所谓的“人”不是伪共支那蛆的爪牙，竟然还企图消灭地球各地千千万万的志愿者，怀抱“共产主义”解放全人类的“高尚情怀”，最终统治整个地球的所有人类，那么，既然有这么“伟光正”的支那理想，那么，首先最低级别的门槛是无法回避的 —— 伪共支那蛆施行“菜刀实名制”，说明他们连大陆百姓手握菜刀， 都感到恐惧惊慌，如此无能懦弱的“支那”特色高度自信，继续在支那国维持支那血腥红极权暴政，都已经是困难重重。这么一群废物，怎么能够实现它们“伟光正”的、解放全人类的“共产主义”理想？！！\n\n中南海那些“匿产帮”连官僚财产都不敢公开，怎么能够代表“伟光正”的中共？连百姓手握菜刀都感到惊慌失措，怎么能够维持有支那特色的高度自信？伪共“支那蛆”连信息都不让人们共享，哪里会有财富共享的“共产主义”？！！ \n\n不过话又说回来，如果某些来自大陆的网友不是伪共支那蛆派来捣乱的爪牙，那么以上这些讨论属于半误解，请当作耳边风，一笑了之。袁红冰说过，只要是真正挺郭的人们，无论是什么种族，什么派系，即便曾经和大陆贪官一起腐败过，只要觉醒起来，加入文明变革，推翻支那丛林暴政，所有的误解，各地志愿者都予以承受！\n  \n川普嘲笑支那人愚昧残忍！！\nhttp://127.0.0.1:43110/NewGFWTalk.bit/?Topic:2_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/  \n这里的“支那人”，特指那些被支那血腥红暴政洗脑，但是没有接受“五毛”级别的“伟光正”的“共产主义”级别贿赂，有待觉醒的、人性尚未泯灭的“人”。至于刻意当“伪共”支那蛆的“五毛蛆”爪牙，它们已经不是人了。跟蛆喊话是没用的。所以“支那人”不包括“伟光正”的五毛党们。不过，如果五毛党们觉得“支那”的音调显得不够“中南海”级别的“高大上”，那么为了摆脱“东亚懦夫”级别的“支那特色”懦弱，为了维护支那太监思维特别崇尚的“伟光正”，希望越来越多人看到最基本的逻辑，敢战方能言和，尚武才有人权！持枪权是摆脱“支那”丛林、走向人类文明的最基本门槛！\n\n从这个层面看，支那暴政完全是丛林级别的野蛮，台湾仍然只是半民主、半丛林的文明。 蒋经国比普通政客更有人性，但是蒋经国当年的变革，也是客观形势所逼，而不是主观上非常主动的、深思熟虑的积极追求。一个最简单的逻辑是，对人性的复杂特点认识达到一定程度，应该很清楚，持枪权是捍卫人类文明的最基本底线。以蒋家父子的智商，他们都很清楚这一点。蒋介石是刻意回避三民主义的宪政民主，但是既然投靠美国，就不能施行支那蛆级别的血腥红极权暴政；蒋经国比蒋介石更文明一些，但是仍然不敢推行持枪权捍卫真理的文明规范，这是台湾华人面临“支那猪”耻辱的根本原因！ \n\n希望整个地球村的所有人们，只要还是个“人”，包括那些曾经被支那血腥红暴政洗脑的“支那人”， 只要人性没有泯灭，只要还想拥有人类文明的基本尊严，就要共同努力，推翻支那丛林暴政，建立中华联邦；确立持枪权捍卫真理的基本规范，树立尚武精神，恢复中华文明！！\n\n**“亿差万别”的中华联邦\nhttp://127.0.0.1:43110/zybbs.bit/?Topic:4_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/ ** \n\n链接分享：\nhttps://iteoedugr0-my.sharepoint.com/personal/0_xxxo_ga/_layouts/15/guestaccess.aspx?folderid=1a9ac9411acbd40d6be0541eb927a90fa&authkey=AapYrABjsLc5PkF9nj8WDVc \n**[传播“习氏”真理、全民上街、分房分钱!!!](http://127.0.0.1:43110/zybbs.bit/?Topic:1_1GvFma4ejwEgao2GjFZ8SjwZw4YzPHuFg9/)**",
			"added": 1510367171
		},
		{
			"topic_id": 2,
			"title": "郭文贵刻意保留“太监”糟粕，高喊习近平“万岁”！",
			"body": "——如何对待既要反对郭文贵、又要反对习近平的“支那伪类”？\n\n那些既要反对郭文贵，又要反对习近平的人们，大体有那么几种：他们也许信仰的是子虚乌有的“共产主义”乌托邦，企图以无产阶级专政为名义，剥夺多数人的财富；也许信仰类似“共产主义”的可兰经，是比本拉登更激进的极端分子，企图以可兰经为名义，剥夺非可兰经信徒的生命；甚至还有部分是信仰“圣经”的伪类，一方面宣扬神灵耶稣，另一方面却反对持枪权捍卫人权的基本规范，企图复辟中世纪时期的教皇专政， 随意制造火烧布鲁诺的惨案，披着“神”的外衣，却纵容亵渎神灵的罪恶。\n对于这几种观点，只须一个最简单的逻辑：信仰的“术语”外衣不是最重要的，最重要的核心规范是，只要他们真心地相信他们的信仰抉择，那么就应该坚决支持“持枪权捍卫真理”的基本规范；而他们所选择的“真理的外衣包装”不是最重要，最重要的是他们不会故意回避“持枪权捍卫真理”的逻辑规范！\n美国也有部分群体，包括大公司的总裁，因为对金钱过于贪婪，不够清醒，被蓝金黄了，说明“支那太监”思维不只是到处都有，而且在蓝金黄的掩盖下，“支那太监”病毒很容易到处传播。\n简单地说，“共产主义”、“大同世界”、“大一统”之类的真理术语很难在现实中推行，但无论真理的“外衣”差别多大，“持枪权捍卫真理”的最底层规范基本相同。“持枪权捍卫真理”的小一统规范，远比“大一统”之类的浮夸风专政，务实可行！\n\n郭文贵一方面强调民主自由，另一方面却刻意保留“太监”糟粕，高喊习近平为“千年圣君”，几乎就是带头高喊“习近平万岁”，就是因为深知支那蓝金黄病毒刻意传播的“支那太监”思维已经影响了很多人，短期内无法迅速清除支那太监病毒，只能顺着支那太监病毒，在“持枪权捍卫真理”的美利坚国土向全世界发出21世纪的最强呐喊！ \n\n美利坚国土之所以令人尊敬，是因为美利坚比支那国更好地传承了创造出“火药”的中华文明，其中最基本的事实，就是把创造“火药”的中华文明融入到“持枪权捍卫真理”的普世价值之中。\n“持枪权捍卫真理”，是普世价值最底层、最基本、最核心的灵魂规范，也是弘扬中华文明不可回避的话题！\n假如中国的戴旭、罗援之类的军人不是伪共“支那蛆”的鹰爪的话，那么可以顺着一些军界精英的话语，“持枪权捍卫真理”既符合国际关系，也符合人际关系。运用尚武军人的简单表述，就是“敢战方能言和、尚武才有人权”！\n但是回到现实中，对于“菜刀实名制”的荒唐，支那国的那些军队上层精英视若无睹、麻木不仁，说明支那国的顶层精英没有一点尚武精神。他们中有不少人是害怕老百姓手持菜刀的“东亚懦夫”而已。\n鉴于“支那国”的核武库比金正恩人渣的威胁更大，郭文贵刻意保留一些支那太监糟粕，反复强调不反对习近平的“郭七条”，只是希望在大规模的群体维权运动中，尽量减少大规模的冲突。“郭七条”在现实中的群体运动操作，就是顺着大规模的蓝金黄刻意制造出来的支那太监病毒和太监欺诈文化，把各种真假难辨的、支那太监级别的“假忠诚”， 全部升级到“持枪权捍卫真理”的“真信仰”。 \n要恢复宪政，恢复中华文明，弘扬“持枪权捍卫真理”的尚武精神，首先需要协助习仲勋后代废除辱习反华的网络柏林墙。网络柏林墙是否是习近平刻意纵容的？ 这不是最重要的，最重要的是，既然支那人喜欢把领导歌颂到“万岁”级别，那么为了维护神圣的“万岁”不朽，可以顺着支那太监思维，以拥护“千年太祖”习仲勋，或者“千年圣君”习近平的名义，公开发起类似泸州抗暴的群体运动，各个地方的运动口号可以是一致的，就是协助习近平统一网络、统一虚拟主权，废除辱习反华的网络柏林墙，清除“伪共”支那蛆，恢复党国、恢复宪政、恢复中华！\n\n**[汉族和穆斯林联合起来，推翻支那暴政!!](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:12_14DohZaXnmVFKeqjygMwh9KfygmhzXFa8e/ )** \n链接分享：\nhttps://iteoedugr0-my.sharepoint.com/personal/0_xxxo_ga/_layouts/15/guestaccess.aspx?folderid=1a9ac9411acbd40d6be0541eb927a90fa&authkey=AapYrABjsLc5PkF9nj8WDVc \n**[传播“习氏”真理、全民上街、分房分钱!!!](http://127.0.0.1:43110/zybbs.bit/?Topic:1_1GvFma4ejwEgao2GjFZ8SjwZw4YzPHuFg9/)**",
			"added": 1510549440
		},
		{
			"topic_id": 3,
			"title": "新草根郭文贵爆料习近平家族巨贪！真文贵也看得泪奔！",
			"body": "https://www.youtube.com/watch?v=0-oaVhTo76E \n郭文贵爆料不断激励着很多人奋起抗争。蒋介石总统的搭档——陈诚副总统的侍卫官吴德仁的后代，浙江华侨吴东海公开爆料习近平家族巨贪！\n吴东海父亲吴德仁在文革中的遭遇，比当代支那国的雷洋有过之而无不及！请网友们一起关注。\n事实说明：\n 蒋介石和蒋经国当年明知伪共支那蛆专政会导致整个大陆陷入十八层地狱，但是在1949年前还是过度刻意回避宪政，酿成今日后果。蒋经国在台湾只是被动地放开党禁报禁，而不敢推行普世价值的核心原则——持枪权捍卫真理的基本宪法，才导致台湾华人面临“支那猪滚回支那”的耻辱！重建中华联邦，创建尊重持枪权、尊重生命的中华文明，不只是大陆人的需要，是全球华人共同面临的历史使命！\n另有网友认为：郭文贵刻意保留不反习的“太监”糟粕，是一种高明策略，因为大陆人有部分群体还是有浓重的“太监”思维。正好习近平的推特页面( https://twitter.com/xijinpingchn )\n 在2017年也被停掉，导致很多五毛党无法看到“伟光正”的习近平推特，可以把郭七条当成策略，将错就错，以协助习近平废除辱习反华的网络柏林墙为名义，在很多地方同时发起类似泸州抗暴的群体运动，各个地方的运动口号可以是一致的，就是协助习近平统一网络、统一虚拟主权，废除辱习反华的网络柏林墙，清除“伪共”支那蛆，恢复党国、恢复宪政、恢复中华！ \n郭七条在现实的群体运动中最大的意义在于，可以爱国的名义尽量减少大规模的冲突，避免被居心叵测的五毛党特务复制六四血腥冲突的借口。\n\n**[汉族和穆斯林联合起来，推翻支那暴政!!](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:12_14DohZaXnmVFKeqjygMwh9KfygmhzXFa8e/ )** \n链接分享：\nhttps://iteoedugr0-my.sharepoint.com/personal/0_xxxo_ga/_layouts/15/guestaccess.aspx?folderid=1a9ac9411acbd40d6be0541eb927a90fa&authkey=AapYrABjsLc5PkF9nj8WDVc \n**[传播“习氏”真理、全民上街、分房分钱!!!](http://127.0.0.1:43110/zybbs.bit/?Topic:1_1GvFma4ejwEgao2GjFZ8SjwZw4YzPHuFg9/)**",
			"added": 1510585083
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"6_14DohZaXnmVFKeqjygMwh9KfygmhzXFa8e": [
			{
				"comment_id": 1,
				"body": "称“中国大陆”为“支那人和支那国”，是抬举他们了。在“伪共”“匿产帮”“支那蛆”的眼里，普通百姓不只是连猪狗都不如，而是随时都可以捏死的“支那蝼蚁”，这方面有文贵爆料视频为佐证——天上宫殿与地上蝼蚁。\n** https://iteoedugr0-my.sharepoint.com/personal/0_xxxo_ga/_layouts/15/guestaccess.aspx?folderid=1a9ac9411acbd40d6be0541eb927a90fa&authkey=AapYrABjsLc5PkF9nj8WDVc ** \n面对这种十九层地狱级别的人间灾难，想一步登天般地回到人间，直接恢复人类文明的正常秩序，是违背逻辑的，所以必须采取类似”郭七条“那样迂回曲折的策略。泸州群体抗争说明，被“伪共”“支那蛆”洗脑多年的支那人——大陆的普通老百姓不想再当支那蝼蚁了，但要想推翻遍地是“五毛”蛆虫爪牙的支那丛林暴政，需要跨种族、跨地区的群体抗争同时爆发；与此同时，为了尽量避免大规模的冲突， 尽量以捍卫“千年太祖”习仲勋的名义，发起和平变革。\n\n网友还有更简洁的论述：\n在这个特殊的历史阶段， 香港人斥责伪共“匿产帮”“粪坑党”为支那人和支那国，实际上是抬举他们了。为了避免特务们混淆是非，制造大规模的摩擦冲突，大家一起明确地将反对的目标界定为不敢公开官僚财产的伪共“匿产帮”，而不是有数千万党员的“中共”，可以公开痛斥伪共“匿产帮”匪徒们是支那蛆虫、支那孽障。扫帚不到，灰尘不去；全民行动，反蛆除孽。反蛆除孽和反华反共没有一点关系。\nhttp://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13",
				"added": 1509675776
			}
		],
		"1_18jxjC7hsQmopuMiK7GmxECXEdT5eu6C6q": [
			{
				"comment_id": 2,
				"body": "这个说法很有新意，只要是敢于跟“伪共”“支那蛆”对着干的人士，无论是来自体制内的叛逆者，还是体制外的维权人士，或者是类似文贵那样曾经被迫在体制粪坑内游泳的草根阶层，都要坚决支持！\n\n事实说明，“伪共”“支那蛆”不只是中华民族的公敌，也是全人类的公敌。\n泸州群体抗争说明，被“伪共”“支那蛆”洗脑多年的支那人——大陆的普通老百姓不想再当支那蝼蚁了，但要想推翻遍地是“五毛”蛆虫爪牙的支那丛林暴政，需要跨种族、跨地区的群体抗争同时爆发；与此同时，为了尽量避免大规模的冲突， 尽量以捍卫“千年太祖”习仲勋的名义，发起和平变革。\n\n**[汉族和穆斯林联合起来，推翻支那暴政!!](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:12_14DohZaXnmVFKeqjygMwh9KfygmhzXFa8e/ )** \n链接分享：\nhttps://iteoedugr0-my.sharepoint.com/personal/0_xxxo_ga/_layouts/15/guestaccess.aspx?folderid=1a9ac9411acbd40d6be0541eb927a90fa&authkey=AapYrABjsLc5PkF9nj8WDVc \n**[传播“习氏”真理、全民上街、分房分钱!!!](http://127.0.0.1:43110/zybbs.bit/?Topic:1_1GvFma4ejwEgao2GjFZ8SjwZw4YzPHuFg9/)**",
				"added": 1509676111
			}
		],
		"2_19iT2hvxE2hqh87ywgpuqKSy42T9tuX2TP": [
			{
				"comment_id": 3,
				"body": "燃教的信息好像有点重复灌水的迹象，予以提醒。\n\n最近的零网，不像五毛党的好信息多起来了，希望整个站点越做越好。\n允许言论自由，但是言论自由是有规范的。没有规范的乱灌水的信息，那就不是言论自由，而是言论层面的自相残杀，与支那式的丛林内斗没有太大区别。\n站点管理员如果纵容乱灌水的帖子，那就是在糟蹋自己的站点，无法聚集人气。\n应该珍惜零网，不该乱灌水，对于乱灌水的ID，予以封禁，是对的。建议各个零网的管理员都学习新零网中文站的管理风格。\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topics:10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj/  \n\n链接分享：\nhttps://iteoedugr0-my.sharepoint.com/personal/0_xxxo_ga/_layouts/15/guestaccess.aspx?folderid=1a9ac9411acbd40d6be0541eb927a90fa&authkey=AapYrABjsLc5PkF9nj8WDVc \n**[传播“习氏”真理、全民上街、分房分钱!!!](http://127.0.0.1:43110/zybbs.bit/?Topic:1_1GvFma4ejwEgao2GjFZ8SjwZw4YzPHuFg9/)**",
				"added": 1520745571
			},
			{
				"comment_id": 4,
				"body": "燃教的信息，该网友对于零网的热情予以鼓励，但是燃教的信息好像有点灌水重复的迹象，需要予以提醒。",
				"added": 1520745647
			}
		]
	},
	"comment_vote": {}
}