{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1565396178,
			"title": "1000+ pages of Epstein documents dumped",
			"body": "\"Minimal\" redaction as promised.  Start digging lads.\nhttps://gofile.io/?c=GqjNcB\nhttps://gofile.io/?c=lyoJKI",
			"added": 1565396177
		},
		{
			"topic_id": 1565757835,
			"title": "Quantum penguin sees cosmic frog?",
			"body": "Bright flash of infrared light coming from the black hole at the center of the galaxy observed by the Keck II telescope in Hawaii.  Shadilay!\n\nhttps://twitter.com/quantumpenguin/status/1160368687590727680",
			"added": 1565757833
		}
	],
	"topic_vote": {
		"1565330250_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U": 1,
		"1579726611_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1582356450_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"1583880411_1FfVZsqx8Bo1zvBHSen2Z2SYg8UCFPgsoE": 1,
		"1585747916_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": 1,
		"1588376863_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": 1
	},
	"next_comment_id": 91,
	"comment": {
		"1565330250_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U": [
			{
				"comment_id": 1,
				"body": "> [saythenword](#comment_4_1PK8e7ccdA28Xi8mDbmZd6SLQSgZaxDAzg): I can actually see less posts on 08chan tonight, than I could last night on the same install for some reason. [...]\n\nI'm beginning to think that BO made some error in response to the spamming.  I have two directories on a removable drive.  The first one will bring up the complete 08chan, and update.  However, no peers will take my posts.  The second one was a fresh install, after the implementation of ZeroIDs.  That's the one which is now stuck updating like you and others have noted.",
				"added": 1565350664
			},
			{
				"comment_id": 2,
				"body": "> [aim64c](#comment_9_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): Even before the update, mine would hang at like 20k files left to download - but at least it was keeping up with activity on the site.It could be a problem with the update, but it could also be a combined problem in zeronet, especially if seeding has become centralized and what another noted down below is indeed the case, and we have a situation where it's a needle in a haystack in terms of finding someone who is actually seeding the site.  I also saw connected peers take a nosedive.  I was up over 8k before the update, then I got hammered right back down to 100 and it's risen back up to around 1000, now.  It could be that we're seeing an artifact of a site change propagating across a network of thousands as opposed to dozens/hundreds.  Since it's not a central server pushing the updates to everyone, everyone needs to check with everyone else to see if they are the most up to date file(s).  So long as everyone you poll for an update has the old file, you will think you're up to date - until the authoritative change takes place.\n\nI thought that was the case at first too, propagation issues.  However I can load the whole package with my first instantiation, and see new post activity there.  It's only the genericID disabled version that's hanging now.",
				"added": 1565351374
			},
			{
				"comment_id": 3,
				"body": "> [aim64c](#comment_10_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): kek... we've got a fork in the zite.  Or ... something.  So, when they get the propagated site code dished out to them, they'll get squelched?  Alas, even on ZeroNet, auto-update should be turned off.  The more things change, the more they stay the same.\n\nNever was enamored with the forking idea, and BO has not been fully transparent with the reasoning.  At the very least could have documented the changes and / or additions.  That's legitimately got anons almonds activated, as it would be expected from a glow nigger.  I'm not lurking two more years, so I would expect Acidman to check this thread and at minimum keep the communication flowing.",
				"added": 1565351985
			},
			{
				"comment_id": 4,
				"body": "> [aim64c](#comment_11_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): I think people are on edge, and it's understandable.  I also think that this is exactly what you would see in the instance where someone was a little too trusting of technology and/or inexperienced in a development role.By a fork, though - I meant just in terms of site revision.I think AcidMan is genuine in that he created the board long ago during the gamer gate fiasco, mainly thinking of it as a place where he and his friends could meet if things went south.  ZeroNet was a means to an end for him in terms of it just got the job done, and the name popularity of 8chan served to keep it rather popular on ZN, which was, itself, virtually unknown or only commented on. [...]\n\nI also think Acidman is genuine, just a bit overwhelmed at this stage.  I'm not poking him, other than the documentation aspect.  Maybe as you allude, he doesn't have the resources.  Did say he was going to work on it this weekend, so you're right that slack should be given.  I'll leave this broken instantiation seeding all overnight, whatever that might do while stuck on 2742.",
				"added": 1565354762
			},
			{
				"comment_id": 8,
				"body": "> [bustooni](#comment_2_13v3xsu1y5pTbf3ZydiKYCZUhCFqdAs2NY): try clicking on \"Check files\" on the right hand side of 08chan's listing in the Sites section of your ZeroHello sidebar.  Seems to have forced an update for me - 'updating' number refreshed, reduced greatly and went down to 0 over a couple of mins.\n\nTest posting is only showing \"Processing post... Please wait.\"  It does appear functioning for some anons though.  Catalog seems way to minimal with seven threads and a total of 36 replies.  That would be over the past 20+ hours now.  Suppose there are only a fraction of legitimate peers, out of a large number induced during the spam attack?  If I can only connect with five at a time, how can I tell with each attempt if these are changing?",
				"added": 1565402815
			},
			{
				"comment_id": 9,
				"body": "> [ayylmaolol](#comment_4_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14): It worked fine for me in the past day.If nothing works for you, just consider starting with a fresh zeronet.\n\nHave you tried your own advice?  I did this yesterday, and have two different directories on a removable drive.  One loads 08chan after BO implemented ZeroIDs but won't let me post.  The other is the fresh ZeroNet and that's the one currently stuck.  Not that I can post in either one, atm.",
				"added": 1565403978
			},
			{
				"comment_id": 11,
				"body": "> [autist](#comment_3_1PxkuTN6oZst8Q7inUZb6xqGJrtkHTGkDq): exact same situation here\n\nAlso tried your fix, but ZeroID is spazzing out too.\nError while during request: Forbidden\nPlease try again later.\n\nI'm tinkering with the users.json file now.  If I can get anything to upload on any 08chan board, I'll post here.",
				"added": 1565415587
			},
			{
				"comment_id": 12,
				"body": "I have two zeroid.bit to work with.  Either one is selectable for ZeroTalk, but I'll stick with \"undisclosed\" for this discussion.  Either one partially works with 08chan, no perceivable difference.  Both get stuck updating files, although slightly different file counts.  Deleting the board from the left side bar and reloading from 127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/ had no effect on the files refusing to update.  It also makes no difference if I modify users.json manually or through the gui.  Creating a new thread or replying get stuck \"Processing post... Please wait.\"  File attachments do get processed, however I only tried images.  It was going a bit further yesterday, before hitting an endless while loop \"Content published to 0/5 peers\".  Since 0chan works for me with anonymous certs, I'll just have to be patient and wait for the next board update.",
				"added": 1565418997
			},
			{
				"comment_id": 13,
				"body": "> [autist](#comment_4_1PxkuTN6oZst8Q7inUZb6xqGJrtkHTGkDq): 0chan has a bunch of cp on it be careful\n\nI needed to retest posting with anonymous cert.  I'm not using an interface with no catalog.  It was deleted an hour ago.  I'm not seeding, and checked for file residue.  They won't be sending any v& this way due to 0chan.",
				"added": 1565423621
			},
			{
				"comment_id": 15,
				"body": "I'm in again, and all I did was have a nice medium rare rib eye steak.  When I got done eating, so was the file update.  However this got unstuck, it was the problem.  I left my users.json with my original ZeroID tied to 08chan.  Only one remaining problem; not enough peers.  The technical issue went away, perhaps due to BO fixing.  All threads that weren't bumped from the attack are back, and post count is normal at 6507 now.",
				"added": 1565428843
			},
			{
				"comment_id": 16,
				"body": "> [08admin](#comment_2_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH): I've been tinkering with the site trying to get a fix for all files to show under the new cert.  If it seems to be especially wonky, look for posts my be talking about progress because I might be just fucking with it at the time you're trying to do something. [...]\n\nDoing the lord's work anon.  Now if only I could get more than 0/5 peers with 08chan.  It looks like about 30 posts right now (two are mine), aren't getting seeded.  I mention this because it was the early symptom when you initially locked the zite down.",
				"added": 1565431242
			},
			{
				"comment_id": 17,
				"body": "> [kaffie](#comment_962_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Why would you use 08chan when it's so clearly inferior?\n\nYou need to understand that 08chan was implemented as a fall back option during the time of Gamergate.  There's a trust factor involved with respect to the anon doing the development work.  This is of understated importance.  Migrating to milchan may happen, yet we've been here only a few days now.  When I tested one of your milchan boards, my post wasn't anonymous (just an example).  I'm not a fan of forking at all, and the result with 08chan is no longer open source.  However, this concern is mitigated by knowledge regarding credibility of the zite owner.",
				"added": 1565437366
			},
			{
				"comment_id": 18,
				"body": "> [kaffie](#comment_966_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I didn't make the site, I'm just linking it. This is the announcement post. Pretty sure it's made by the original guy who made millchan.\n\nOkay, I get it - not your site.  I'm not really as concerned with anonymity, so I gave a bad example.  Obviously TOR + VPN or why bother m8.  To answer your question though, \"Why do you trust them?\", I give benefit of doubt to other National Socialists.  He has already said he's not the end all developer, and neither would I be if I got up to speed.  White people have a faster learning curve though, so I'll ride with my own.  Regarding CP, I'm not afraid of the wild-west frontier.  If I get v& it will be for something much different.",
				"added": 1565439224
			},
			{
				"comment_id": 19,
				"body": "> [kaffie](#comment_967_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): True anonymity, which is what chans try to provide, isn't possible here on zn. Pseudoanonymity is fine though (account post history, but no connection between account and real person). [...]\n\nYou got an upvote for understanding.  Give it time, since it's also a matter of where other anons will end up too.  I don't need to be persuaded one way or another really.  If I can shitpost, promote memes in peace, dox, dig and help secure the existence of our people and a future for white children, that's all I'm asking of ZeroNet.",
				"added": 1565440403
			},
			{
				"comment_id": 20,
				"body": "> [domhnall](#comment_1_1NEU47WbD2zt9N1FpD1fmmZzqNr5Ypk1vc): Same here. I deleted the site from ZeroNet in an attempt to get image posting through the Tor Browser working, and now I can't post anything at all, even just a simple \"test\" text post. Don't know what the fuck happened but here I am, I guess.\n\n> [5464633464343435](#comment_1_1PVeAVH8LnpmqkaAW2RMm2Tx5LFD6wteng): been trying to post on there even while missing all the old posts and it just gets stuck on Processing post... Please wait.\n\n> [ssdifnskdjfnsdjk](#comment_892_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): the site contains multiple topics that can point you to an explanation on how to fix it. Example topic here [...]\n\nHad the same problem for most of yesterday, until updates got unstuck.  Once you get past this, the next issue is that for some reason it's showing 0/5 peers.  This eventually times out to a failed post.  Is there some way to clear out peers for 08chan, restart, and have new ones connect?  If I'm reading sites.json file correctly, 08chan had 2517 peers when I just tried to test post.  I'd like to flush this and reconnect with live peers, as I suspect many of these 2517 are dysfunctional residue from the spam attack.  So I'll have a look at the link from ssdifnskdjfnsdjk next, but expect it's already something I've tried.",
				"added": 1565483169
			},
			{
				"comment_id": 28,
				"body": "> [08admin](#comment_6_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH): We got it fixed a couple hours ago.  Based partly on the idea from this discussion and help from several users. [...]\n\nWell at least I'm getting a new error \"Content signing failed\".",
				"added": 1565605931
			},
			{
				"comment_id": 29,
				"body": "> [08admin](#comment_6_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH): We got it fixed a couple hours ago.  Based partly on the idea from this discussion and help from several users. [...]\n\nOnly stuck once, looks good now.  Thank you!",
				"added": 1565606198
			},
			{
				"comment_id": 30,
				"body": "> [ssdifnskdjfnsdjk](#comment_900_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Try to open the 08chan site menu (move corner button to the left) and scroll down to the IDENTITY ADDRESS field where you can try to change to zeroid and reload page? You made sure the option \"This is my site\" is not active and you \"Check files\" of the 08chan on the ZeroHello site (three dots menu next to site name)? may take some time to download the content.\n\nI'm fine now, that was a once off problem.",
				"added": 1565607772
			},
			{
				"comment_id": 32,
				"body": "> [prologic](#comment_8_12fWKDf6FpQhpQua3g1UkA1z6AxHSF1d2p): The lack anonymity is troubling because it literally syncs everything and I don't really appreciate that. I would like for websites to offer options to sync certain parts and completely nuke others... 8ch seems to do that for now, so that's good.\n\nI'd want the board listing's Pin/Unpin function to work like the filter was apparently intended.  In other words, don't pin a board, and nothing there is seeded.  I can understand if that sort of function was disabled by intent, since it would take extra effort to get new boards properly seeded.  Yet as it stands right now, I have to act as [M]oderator for all of it, which won't stop pollution if I seed while asleep.",
				"added": 1565650657
			}
		],
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 5,
				"body": "> [aspidochelone](#comment_37_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): It might be 4chan, it might be ZeroNet.  But one thing is clear:  the plot to shut down 8chan and companies serving it was not hatched in a day.  There was a whole contingency plan laid out in a manila folder labeled \"Contingency C - Mass Shooting 20 Casualties\" or some such, and the second the news report came it was put into action.  That probably included law enforcement finding the shooter's manifesto and immediately uploading it to 8chan. [...]\n\n> [cryptonrefuse](#comment_2_13Qv7muvCuG3BqEDzwYAdGtBzoD47Ls7K8): This will work in theory, however, they don't understand the culture of the people they're importing and that will result in unforeseen consequences. [...]\n\nI have an infographic saved in the last hour of 8ch which convincingly shows initial /pol/ posting of the P. Crusius manifesto occurred twelve minutes AFTER the El Paso Police Dept. twitter feed announced an active shooter.  That's with Mountain Time converted to Coordinated Universal Time.  I don't keep or want any social media footprint.  The last time I had to use a burner phone for Twitter to get their voice confirmation code.  That account lasted all of four hours, so maybe some journo will want to Tweet this instead.  I'm not buying another phone.  It really needs no accompanying message.  I'll just leave it here.\n\nhttps://imgur.com/a/R3lasja",
				"added": 1565395354
			},
			{
				"comment_id": 10,
				"body": "> [cryptonrefuse](#comment_3_13Qv7muvCuG3BqEDzwYAdGtBzoD47Ls7K8): No Journo would post this. (((Journalists)) are tools of the state, and I'm not talking about Congress or the White House.\n\nI know, just drawing attention.",
				"added": 1565412317
			},
			{
				"comment_id": 37,
				"body": "> [xcape2net](#comment_292_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): They can ask your ISP who you are.\n\nGlow niggers have already got all they need to v& anyone.  They don't need to ask your VPN services who you are.  Hiding behind 6 million proxies or VPNs is just begging to be flagged.  One VPN + TOR works because it's the status quo, and you're not exposing youself to 99.9% of the other fuckers.  If you have to ask, you're probably already on multiple lists.",
				"added": 1565783527
			}
		],
		"1565396178_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK": [
			{
				"comment_id": 6,
				"body": "> [orangemanbad](#comment_5_1Nx6vvREj1AagLQUp1grfbUbrhHV3Ug2vW): I'm only slightly autistic, not nearly enough for this! ;)\n\nSearchable PDF makes it less autistic.  Example - only reference to a \"hammock photo\" from Menninger's cross-examination of Virginia Giuffre:\n\n8 Q Okay. What's the first one you've put a\n9 check by?\n10 A \"The hammock photo was all over the\n11 houses,\" in parentheses. And Bill Clinton and -- I'm\n12 sorry, \"Bill Clinton and Andrew,\" in parentheses,\n13 \"had to have seen it.\"\n14 \"All over the houses\" is not my statement\n15 and an exaggeration. They did have that picture in\n16 the houses. And I believe, if I remember the\n17 conversation correctly, she asked, Could have Bill\n18 Clinton and Andrew seen the picture? And I said,\n19 Yes, it's possible that they could have seen it.\n\ncombinedpdf.pdf p. 103",
				"added": 1565397553
			},
			{
				"comment_id": 7,
				"body": "> [styromaniac](#comment_925_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Y U no share it on ZeroUp? I'll beat you to it.\n\nBecause I'm a newfag here, and didn't know this.  I'm getting dirty with the digging instead.",
				"added": 1565398642
			}
		],
		"1565424353_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 14,
				"body": "Thumnails and text are seeded by default.  You can blacklist indivdual boards so you aren't seeding them, however that's going to require diligent monitoring.  /cp/ is not what you expect, however I blacklist it anyway.  I'd be more concerned with unidentifiable webm content.",
				"added": 1565424950
			}
		],
		"1565463652_15SUXePqGofTgevJbv9FAJequ5TxKkBMMM": [
			{
				"comment_id": 21,
				"body": "> [hdidnothingwrong](#comment_9_1LW31sbmLZebhhgTx2bhzeUNYbZ5cYnBfe): He didn't kill himself.  He is receiving plastic surgery and relocating to a country in the middle east.\n\nIf jews run the city morgue at Bellevue Medical Center, this is how it would be accomplished.",
				"added": 1565484549
			},
			{
				"comment_id": 22,
				"body": "> [bigbadbob](#comment_166_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): To be honest... i dont actually know shit:)   There is very little an individual cant state as absolute fact.  I can say we are subjected to many lies.  Too many lies to blindly jump on any bandwagon with 100 percent conviction.  Greedy rich powerful people suck... the details dont mean much.\n\nI'll know more details when I see how many former israeli heads of state attend funeral services in tel aviv.",
				"added": 1565488242
			},
			{
				"comment_id": 23,
				"body": "Let some of the victims into the morgue to examine.  Don't even have to take the sheet off, just cut a hole.  All they'd need to identify is that egg shaped pecker.",
				"added": 1565504865
			},
			{
				"comment_id": 25,
				"body": "> [n00dle](#comment_4_1C5WofUXvg54BgL9AiS2Mqdq3erQBGogXB): I'm betting on around 2025 for the REAL fireworks personally, with a steady ramp-up of intermittent actions in the meantime - the effects of continued degradation of the global economy & innumerable more overt slaps in the face to make \"muh comfortable paycheck\" stop being enough of a reason to NOT just simply go clean house.\n\nI have what's referred to as a \"novelty bet\" on the U.S. Presidential Election 2020, to win outright.  I don't like or dislike orangeman; however, about nine months ago he was 3:1 and it appeared to be an overlay.  Considering the same service provider has 1.9:1 as I checked right now, I like my significant bet.  Biden is 6.5:1, Warren 7:1, Harris or Sanders 12:1.  The rest of the field is > 25:1 individually.\n\nI'm thinking 2021 for the \"REAL fireworks\" would attract an equal amount of wager before or after, excluding that year from collecting.  What you wrote has to happen, yet being a proponent of accelerationism, I'd expect sooner.  I don't take positions on incoming action any more like my younger years, even though that's a successful method.  Yet no one gets out of the business either, so I can't help thinking in this manner even if it seems peculiar.  In b4 nice larp faggot.\n\n> [hdidnothingwrong](#comment_10_1LW31sbmLZebhhgTx2bhzeUNYbZ5cYnBfe): Epstein didn't kill himself. They swapped him out with a corpse they obtained somewhere.  Epstein is receiving plastic surgery as he enters something similar to the witness protection program.\n\nFTFY - Tel Aviv (((protection program))).\n\n> [toxictootsie](#comment_1_15xDkfTojXrEu5xip2XzRRFsFoCgU9yNDg): It will be a breaking story for a week or two. After that, the sheeple of the world will just be following the next breaking story.\n\nThis is where accelerationism comes into play.  When no one can keep up with \"breaking stories\" it's a different paradigm.",
				"added": 1565519153
			}
		],
		"1565507663_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 24,
				"body": "> [kaffie](#comment_991_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I use DuckDuckGo. But \"google it\" is just engrained in my speech. \"duck it\" isn't really as clear and \"search it online\" is a mouthful.\n\nSince reddit is not a primary source, I went and tracked down what appears to be the origin of the prediction back on September 12, 2018.  I don't limit myself to \"search engines\".  It's Gematria related and timed to coincide with Tisha B'Av & Islamic Festival of Sacrifice.  Yawn.\n\nhttps://web.archive.org/web/20180914062628/http://freetofindtruth.blogspot.com/2018/09/august-11-2019-watch-thread-tisha-bav.html?m=1",
				"added": 1565513937
			},
			{
				"comment_id": 27,
				"body": "> [kaffie](#comment_1010_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I don't mean I'm afraid, it's just a particular phrasing. ahhh this alwawys happens when i speak people misunderstand the intent of my words no matter how verbose i am.\n\nI thought you had a decent longshot toward becoming the next single letter anon, though I wouldn't wish for such an outcome.  I like that you have subtlety of intent, and wry humor.",
				"added": 1565602795
			},
			{
				"comment_id": 31,
				"body": "> [edgelordofdecent](#comment_49_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Want to pick another date?\n\nAn obvious one would be November 8th.  Since Gematria was emphasized with the original prediction, that would probably reduce to the same value.  Of course when one starts playing number games, many other dates could be manipulated to fit.",
				"added": 1565649932
			}
		],
		"1565523603_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 26,
				"body": "If someone can send Tarrant money on account, then let him decide what he wants to convert into items.  Why don't you post more specific details how this is accomplished in NZ?  I expect he can navigate the internal ecomomy.",
				"added": 1565526186
			}
		],
		"1565661379_13Gu27WksygoMQzLpktTGzZTHumTN5pce1": [
			{
				"comment_id": 33,
				"body": "Acidman worked all weekend on getting ZeroID properly implemented to return the boards basic functionality, and add a layer of insulation from spam attacks.  He has a day job, so important fixes such as TOR image posting might not get addressed until his next two days off.  The problem is still there, it's just that some anons are willing to run through another browser.  TOR + VPN with ZeroNet on a removable drive using say FireFox as the interface is about the best anyone has right now.  I haven't seen any workaround that wouldn't involve migration to Millchan Engine, or exposing html canvas in TOR.",
				"added": 1565662433
			}
		],
		"1565649984_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 34,
				"body": "> [theecollector](#comment_2_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU): so in stupid person words is zeronet safe or what??\n\nThat's a loaded question, so I'll answer within the framework of OPs observation.  Avast has trouble keeping up with false positives, and IDP:Generic is a default position.  OP should try another flavor of ice cream by running a newer and better free anti-virus package like Panda Dome instead.  ZeroNet is frontier, but safer than Texas was in the 1840s.",
				"added": 1565689794
			}
		],
		"1565724346_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": [
			{
				"comment_id": 35,
				"body": "> [bigbadbob](#comment_264_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): That will do it.   Blocking 14 eyes countries sounds very interesting.  Does that make tor really slow?   Not that it would bother me\n\nI had success when I needed to have a specific TOR exit code repeatable for any circuit.  Applications like Twitter for example, expect new accounts to come from the same IP (at least for awhile).  It's another layer they started using awhile back to mitigate sockpuppet accounts.  There is also an exclude function, although the documentation suggests it isn't failsafe.  I haven't tried this, however the idea of blocking countries is appealing and this should do the job:\n\n\"If StrictNodes is set to 0, Tor will still try to avoid nodes in the ExcludeNodes list, but it will err on the side of avoiding unexpected errors. Specifically, StrictNodes 0 tells Tor that it is okay to use an excluded node when it is necessary to perform relay reachability self-tests, connect to a hidden service, provide a hidden service to a client, fulfill a .exit request, upload directory information, or download directory information.\"\n\nhttps://tor.stackexchange.com/questions/733/can-i-exit-from-a-specific-country-or-node",
				"added": 1565740973
			}
		],
		"1565706281_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": [
			{
				"comment_id": 36,
				"body": "> [allballsnobrawn](#comment_6_1Kz61HMH26hFwXwRzJoMbHePywcgLCG9fD): This seems to me to be a place worth infiltrating for Project Veritas or some such initiative.\n\nIronically, you're very close to how the whole Q thing began.  There was a small group of board owners which included M00t.  One of them had hacked a way into the White House press pool feed, which was about 15 minutes in advance.  So, you'd get some shit which could be Q leaked and quickly confirmed.  The group had a plan to cash in eventually, but one left and wrote about it.  There's a pastebin of her \"confession\" with all the details, but fuck me for not saving this after finding the link in /baphomet/.  Anyhow, this was the first few weeks of Q.  It's psyop value was obviously parlayed into what it is now by others.  The journos you'd want PV to infiltrate have sold out for shekels, and their bosses are not the low hanging fruit PV has gone after before.  Capiche?",
				"added": 1565779412
			}
		],
		"1565805956_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": [
			{
				"comment_id": 38,
				"body": "> [mfs](#comment_25_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W): Hmm, I don't know how to get this  file to seed. I am prompted to download the zip file to my local machine (like on the clearnet).\n\nI'm seeing 19 peers, 4 seeders and 4 leechers.  That's more peers for a single file than anything else on ZeroUp Unlimited.  I'm close to the full 300 Mb., and hope it isn't corrupted like the version at PV now is.  That DLs complete, and then errors out.\n\n> [512](#comment_11_18JjtihTHzagQ7Ut2j4w9x6aB159JKCRu3): Veritas has some strange download system, which requires app install, and many people don't want that. So, here is the magnet link to all leaked documents in one zip file (not my upload):magnet:?xt=urn:btih:4dbbd7421dc85e631e09c10c190760cf03e7a78a&dn=Don%27t+Be+Evil.zip\n\nMy bittorrent client hasn't seen anything yet either:\n\nDownloading:Don't Be Evil.zip\nDownloading From:magnet:?xt=urn:btih:4dbbd7421dc85e631e09c10c190760cf03e7a78a&&&&...\nWaiting for DDB initialization...\nSearching...\nMetadata download created\nTrying secondary lookup service\nSecondary lookup failed: no sources found\nFound 0\nError: no sources found for torrent\nRetrying...\nSearching...\nMetadata download created\nTrying secondary lookup service\nSecondary lookup failed: no sources found\nFound 0\nError: no sources found for torrent",
				"added": 1565848265
			},
			{
				"comment_id": 39,
				"body": "> [memesadler](#comment_64_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): I figured out what was wrong. Not only does Tor upload blank images if you tried to upload those, but also files and videos and just about anything that's not text. I uploaded and now yeah, it all works.\n\nI've been seeding, and the overall size is correct.  Having skimmed through most of it now, I'm getting the impression we've been given a sanitized version.  I can not believe for example that the Election Tampering directory is so sparse.",
				"added": 1565853650
			},
			{
				"comment_id": 40,
				"body": "> [memesadler](#comment_67_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): I uploaded a documentary which, among other things, includes tech censorship and monitoring as part of its coverage.\n\nThis one is corrupted, and I have no idea what's the cause:\nTracker connection error detected.\nUse Tor meek bridges for tracker connections.\nContent.json download failed.",
				"added": 1565856390
			}
		],
		"1565852058_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 41,
				"body": "> [0to1](#comment_2_1E6urUsC76nE9riYrAUQVdsPydfDgaZTiD): vvv\n\nTest editing again to see if quoting you also changes in my reply.",
				"added": 1565856704
			},
			{
				"comment_id": 42,
				"body": "> [kaffie](#comment_1029_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): It doesn't change your reply because your reply is written on your own data file.\n\nI'm fine with the status quo.  I wouldn't want edits to propagate.",
				"added": 1565857408
			},
			{
				"comment_id": 43,
				"body": "> [223556](#comment_121_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): It has hilarious potential [...]\n\nI didn't spew, but kek m8.",
				"added": 1565866913
			}
		],
		"1565678144_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": [
			{
				"comment_id": 44,
				"body": "> [spiegel](#comment_5_1DgsQGyxp1NPfxDHSUs3Efj8jPvfrGsYyd): jews rape kids. Non-jewish kids, YOUR kids if they could.\n\nThis, even if derailing a bit.  I'm here with a ZeroID of undisclosed, when I also have private keys for katehikes and chadthundercock; only because it's tied to 08chan.",
				"added": 1565867782
			},
			{
				"comment_id": 45,
				"body": "> [xlk](#comment_30_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp): In-fact, northern Africa is the birth-place of Western civilization.\n\nThere is no \"fact\" regarding northern Africa as the birthplace of White western civilization.  It's a (((theory))) that has been promoted for too long.  If you are haplogroup R1, you are white.  If you are R1a then you are Aryan, otherwise R1b.  The Solutrean hypothesis adequately answers the question of R1b origins.",
				"added": 1565868599
			}
		],
		"1565868212_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 46,
				"body": "> [eighty4](#comment_19_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX): Id love to know how many people have muted this dude at this point\n\nDude has a logical argument, dispute it with reasoning or gtfo.",
				"added": 1565869945
			}
		],
		"1565915969_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 47,
				"body": "It's already being done.  You might want to have a look at Dr. Rick Bright's Novavax, Inc.  archive.fo/kqTZd",
				"added": 1565917246
			}
		],
		"1566034184_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F": [
			{
				"comment_id": 48,
				"body": "(((Who))) runs the conversion business between crypto and cash?",
				"added": 1566034625
			},
			{
				"comment_id": 49,
				"body": "> [90w8fuiosrhui](#comment_1_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F): there was BitPay [...]\n\nYou might have misunderstood my sarcasm.  How much spread (juice, vigorish, cut, charge, etc.) do you forfeit when cashing out of crypto into the form of money the local food store will accept?",
				"added": 1566035615
			},
			{
				"comment_id": 50,
				"body": "> [90w8fuiosrhui](#comment_2_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F): idk 2 % - 3 %\n\nIt's a much larger spread where I am.  Anyhow, my point was which ethnic group primarily owns the currency conversion process, and why currency conversion for profit in the first place?",
				"added": 1566038393
			}
		],
		"1566037008_1PxkuTN6oZst8Q7inUZb6xqGJrtkHTGkDq": [
			{
				"comment_id": 51,
				"body": "It actually works, yes.  The problem is your active trackers aren't connecting with peers which have the earlier content.json files.  Lack of peers which have most of the stuff, is due to complications of tink's spambot.  Not enough initial anons have returned yet.  I suppose we need a major habbening, so some anons with the earlier stuff will check back and automatically reseed.",
				"added": 1566038965
			}
		],
		"1566153558_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX": [
			{
				"comment_id": 52,
				"body": "http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1565396178_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK/1000+pages+of+Epstein+documents+dumped",
				"added": 1566166651
			},
			{
				"comment_id": 54,
				"body": "> [0nullz](#comment_4_12XcKUGvjkDZ5ufLFESyYLYXgELagrHyxz): That link to that zip seems dead\n\nTake it up with styromaniac, I didn't make that zip.  You could also grab from where I did on the clearweb day one.",
				"added": 1566205244
			}
		],
		"1566178230_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 53,
				"body": "> [nyanasi](#comment_6_1GCX671SdfGDqwXhgjySi8RRALoB4vwHCD): 8chan users had lots of motivation to come here. 8chan itself become popular due to the need to find a new place after 4chan kicked them out. An event where people are being deplatformed is the best time to try to attract new users.\n\nNo one was \"kicked out\".  4chan decided to censor GamerGate to the extent that made staying undesireable.  Blame for the split can be pointed at SJWs.\n\nToo much trouble, actual or perceived, is what will keep people away.  There are still so many flavors of hardware setups, a fair percentage of new users are going to have problems.  Sticking around to work through them, is only motivated by having been deplatformed.",
				"added": 1566184266
			}
		],
		"1566152917_1Azwyo4W2zSSRbHECg7DBQEt19iwyPwcxf": [
			{
				"comment_id": 55,
				"body": "> [kidcourageous](#comment_25_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): that's what Uncle Fester's Home Workshop Explosives book is for\n\nBe sure to add some magnesium powder (not the vitamin supplement) to your ingredient mix, unless you just want flash and smoke.",
				"added": 1566207410
			},
			{
				"comment_id": 56,
				"body": "> [kidcourageous](#comment_45_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): Uncle Fester's Home Workshop Explosives\n\nHa, I thought you were joking - just checked now, and see that's an actual book.  My comment was in reference to the ingredients for gunpowder.  Magnesium powder is convieniently left out of instructions.  It wasn't directed at any particular Fester recipe.",
				"added": 1566252886
			}
		],
		"1566939301_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 57,
				"body": "> [nickwa](#comment_413_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): You can break driver installs from windows updates in the registry.\n\nWindows 10 Registry hack to stop automatic driver updates:\n\n1) Open HKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Microsoft\\Windows\n2) Create a new key named WindowsUpdate\n3) Select WindowsUpdate in the left pane and right-click on a blank spot in the right pane to select a new DWORD (32-bit) Value to be named ExcludeWUDriversInQualityUpdate\n4) Now that ExcludeWUDriversInQualityUpdate has been created, double-click on it to change the value data from 0 (allow) to 1 (turn off)",
				"added": 1567067507
			}
		],
		"1567245416_14NPJsBAyjwarWkM3n84oXFSrgSD9nw2Jh": [
			{
				"comment_id": 58,
				"body": "Be like those in Newtown, CT.",
				"added": 1567250360
			}
		],
		"1567252307_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 59,
				"body": "Assam termites; elaborate on why should a fuck be given.",
				"added": 1567253143
			}
		],
		"1567498932_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1": [
			{
				"comment_id": 60,
				"body": "Interesting observation, and nice to know.  Thanks anon.",
				"added": 1567506598
			}
		],
		"1567674511_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 61,
				"body": "There's some internal debate on the reason for the cause.  Workaround by creating another ZeroID without using TOR.  Assuming a decent VPN as opposed to freeware crap.  You should already know how to make this your active users.json and of course save every flavor until you're certain.",
				"added": 1567679817
			}
		],
		"1567657210_1LMHSz6pwoimKuAr4MC57yhRLAQYFzRVwD": [
			{
				"comment_id": 62,
				"body": "> [schwifty](#comment_2_1AnyDvAnog1HqXEA4T8VARmoEcvLkjANEb): Piracy and extreme digital freedom are the future whether anyone likes it or not.\n\n[Piracy and extreme digital freedom](http://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/)",
				"added": 1567686321
			}
		],
		"1567904814_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": [
			{
				"comment_id": 63,
				"body": "> [funman](#comment_6_12nYWrJ4WfemBx1sC1w3wTUJsX7iSkTv4c): I think he is in south america now\n\nOr home again?  [Video of Jeffrey possibly back on pedo island](https://invidio.us/watch?v=aCvF37hLG60)",
				"added": 1567929571
			}
		],
		"1568199205_16mvSmVfE3vjFTWzAd9hZFBoHE62TbtE8g": [
			{
				"comment_id": 64,
				"body": "But trolls bring a certain vivacity to a thread.  They signal by their very presence, worthiness of the topic at hand.  Honestly, how long ago was it that you couldn't recognize who's trolling?",
				"added": 1568201341
			}
		],
		"1569269870_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 65,
				"body": "> [trustedleanings](#comment_41_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX):  You may be able to mount a legal case in your favor, but if you're fighting the town or city you're unlikely to win.\n\nWhat styromaniac is probably missing, that in theory allows an owner to say fuck off to all the municipal bullshit, is the original patent for the land.  Chances are, the previous owner of the property didn't have this either.  So at some point in the chain of title, a bank held the patent.  Do you think when China for example buys land in the U.S. that they're paying for anything less than the property with patent?  What happens is that somewhere in the chain of title, a buyer needs to mortgage, and that's when the bank required the patent for collateral.  Then the propery may get subdivided, in which case the ownership also gets spread out, so no individual has complete claim on the original patent.  The solution is not inexpensive, and will require a full title search to begin with.  A surveyor will need to obtain new measurements of your boundaries, and a new plat drawn up.  Then you must have a notarized copy of the original patent, and prove your subdivision with the results of the title search.  Don't even think about suing unless you have more than just the title to the property.  If you live in a city, you may not have anything better than title to a \"lot\"; subdivision of an original patent.  In this case, the city will be holding the patent, and you won't ever.",
				"added": 1569312387
			}
		],
		"1569779844_1PGmSveoNhGqd42DQt9emDzpnR4zdjKbnv": [
			{
				"comment_id": 66,
				"body": "Is that the complete 1914 obituary at the top OP?",
				"added": 1569800841
			}
		],
		"1571981535_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 67,
				"body": "1. Police will already have probable cause and a warrant.  They will confiscate your computer, not search it on site.\n2. Having confiscated your computer, and not placed you under arrest, you would be certifiably autistic to go attending any 0Net forum from another PC at your site.\n3. If your scenario then does come about, the \"law\" is what the courts say.  Your attorney may have to fight this after a wrongful conviction.\n4. Your actions after inadvertently viewing CP here, are important.  You needed to be proactive, mute and get rid of it.  If you simply ignored your responsibility, good luck claiming you didn't know what to do.",
				"added": 1571986802
			}
		],
		"1574367198_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 68,
				"body": "There was an idea on /pol/ shortly before 8chan was deplatformed.  That was to create a generic manifesto, such that a few details could be adjusted in the breaking moments of an event.  This would be (or may still be) released to half chan or leddit, for the lulz.  The idea was to write something more realistic than what a team of glowniggers could do, and see how far it got accepted.  Of course pranking at this level could easily get an anon v&, opsec notwithstanding.  Why do you think anyone cares if a manifesto is genuine or not OP?  It's all theater anyway.",
				"added": 1574374002
			}
		],
		"1574633190_1KVSDgKaZjjDE5cNq9AEbrFr9oBTm3DHkR": [
			{
				"comment_id": 69,
				"body": "[See this seven year old paper on Base B23 compression.](https://www.researchgate.net/publication/48171089_A_New_Technique_for_Text_Data_Compression)",
				"added": 1574635686
			}
		],
		"1576527921_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 70,
				"body": "The seventh seal has already been broken with remote viewing.  It succinctly and unironically says, \"God lied\".",
				"added": 1576531791
			}
		],
		"1576862108_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 71,
				"body": "Solutrean a/k/a R1b haplotype.  I'll let you research the suppressed theory.",
				"added": 1576924802
			}
		],
		"1577908716_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 72,
				"body": "Western Digital 3Tb My Passport Ultra - best SSD I could get four years or so ago, now at Best Buy for $99.99",
				"added": 1577917450
			}
		],
		"1578007868_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 73,
				"body": "> [aspidochelone](#comment_302_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): I remember years ago you could legally pick up UV lasers for a few hundred dollars that were dangerous powerful, could blind a person permanently with light they couldn't even see.\n\nA legal use is for testing fiber optic cabling.  Took a course two years ago to see if I could become a tech.  Was told confidentially that when ordering professional quality UV lasers, it's a good idea to buy three or more and have them sent to different addresses.  It all depends on what makes it through import customs, unless you settle for something on the used marketplace.  $50 can get you a high quality tool, with a minimum 200mW/cm power output.",
				"added": 1578094594
			}
		],
		"1578171577_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 74,
				"body": "I'll take this obvious bait and look for Jared Kushner to have a sudden death.",
				"added": 1578177387
			},
			{
				"comment_id": 75,
				"body": "I'll take etymology for $400 Alex.  \"Shia Muslim Persian sect member during the Crusades sent on a suicidal murder mission\".  Jared Kushner is only perceived as beyond reach, when itâ€™s presumed assassins will want to survive.  This is a martyrdom culture that invented political murder, and under those conditions there's really no one off limits.",
				"added": 1578182643
			},
			{
				"comment_id": 76,
				"body": "If I see a promo code offering 80% discount for staying at a certain hotel on North Wabash Avenue in Chicago, I'm going to decline.",
				"added": 1578191682
			}
		],
		"1578444583_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 77,
				"body": "Daylight now in the ME; should be some visual evidence of what was done.  Iraqi photo ops forthcoming?  In all seriousness, what does the apparent total lack of attempt to shoot down any incoming missiles say?  Does Iran have sophisticated electronic warfare capability to deliver these unannounced, or is it more likely this double salvo was an attempt to save face for everyone?",
				"added": 1578463009
			},
			{
				"comment_id": 78,
				"body": "Those who imagined bringing and supporting requisite troop strength on the ground to this battlefield, being a logistical impossibility, were given a clue in Trump's speech.  When he stated he'll get NATO involved, that seems to mean Erdogan's men could be deployed in Iraq for the role of cannon fodder.  Erdogan gets to say he must satisfy their NATO obligations, yet can also claim to be needed to represent Putin's interests.  What if PS752 was the false flag, and by twist of fate Khamenei's missile salvo pre-empted the narrative?  It would not have been so difficult, or beyond the means of mossad to have sabotaged the plane before it left Ukraine.",
				"added": 1578533853
			},
			{
				"comment_id": 79,
				"body": "Considering what Erdogan's troops might imply with respect to altering the mindset that only use of tactical nuclear weaponry can make such a war winnable for the U.S., was the observation I took away from Trump's speech.  Weapons will beat cannon fodder, but only in an all-out scenario.  Skirmishes and salvos are preferrable to mutually assured destruction.  So the purpose of having Turkish troops deployed, or the potential thereof in the Iraqi theater, is as a limiting effect on the perception that nuclear weapons would be required.\n\n> [sfs9](#comment_10_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD): They probably lack the capacity to take on the U.S.\n\nWhile I understand and concur with most of what you said, history would tend to disagree that Iraq lacks capacity.  The empire can rapidly obliterate infrastructure quite well, and can now seemingly drone anyone anywhere anytime.  That doesn't mean achieving victory over the minds of those oppressed.  Neither Russia or the U.S. could do much when faced with the Afghani Taliban, so why expect less from a people who were basically gifted a martyr?",
				"added": 1578538517
			}
		],
		"1578677811_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 80,
				"body": "Connect the dots instead of debating how the plane came down.  \ntwitter.com/Kerryactivism/status/1215413680281718785?s=09\narchive.ph/a3lzu",
				"added": 1578700154
			}
		],
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 81,
				"body": "Below is from Jim Stone 82.221.129.208\ntldr - If the vaccine becomes mandatory, expect to be among the dead\n\n1. In 2015, Bill Gates filed a patent on a GMO modified coronavirus.\n\n2. Three months ago, during a conference where he was preaching the virtues of population reduction via vaccines, Gates did a hypothetical model where the coronavirus kills 65 million people. That's a stretch for coronavirus, which is simply the common cold, But then again, there is that patent. And at that conference, he preached the virtues of using vaccines to reduce the population.\n\n3. It appears there was an outbreak of sorts in China, but the Chinese government is quoting very low numbers and only a few dead, while obvious hoaxers on Twitter are posting videos from all times of the year claiming they just happened and saying thousands are dying because there are dead people laying everywhere. However, every major city has that many people laying in the streets daily due to either bike accidents or car accidents or passing out from strokes - Wuhan has a population of 11 million, there would therefore, by statistic, be multiple videos of people laying in the streets for various reasons daily. You'll get that many from gunshots alone in Chicago in one day. So there's plenty of hoax fodder, quite well proven by the fact the hoaxers did not get the time of year right, they just used whatever looked good.\n\n4. BIG PROBLEM - Britain is running with this, and doing quarantines. And if they are taking it that far there's little doubt it is going to be done in the U.S. also.\n\n5. BIGGER PROBLEM: Gates has the vaccine ready to go already.\n\nHere is the end game, as I see it:\n\nThere is a strong possibility that this virus, hoax or real, is going to be used for a martial law style crack down in various nations, including the United States. If this happens in the United States, it could be used as a pretext for even heavier crack downs, complete with gun grabs and forced \"vaccinations\" - For a virus Bill Gates has patents on, PLUS the vaccine for, while he babbled all about how vaccines should be used for population reduction.\n\nBill Gates probably contracted out to China for his virus bullshit, why hire Americans to do it? Americans cost more, may have loyalties get in the way, and might speak up. They might speak up in China also, but there's that language barrier, and the guns and Trump problem is in the U.S. There's no doubt China's government hates Trump, and that's definitely playing into this scenario as it unfolds as well.",
				"added": 1579905193
			},
			{
				"comment_id": 82,
				"body": "> [mariage](#comment_4_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY): China made a hospital in 5 days ! Is this true?\n\nThey made a parking lot, complete with painted spaces.",
				"added": 1580334006
			},
			{
				"comment_id": 86,
				"body": "> [aspidochelone](#comment_355_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): I wonder if anyone could think up some alternative hypotheses? [...]\n\nI'd rather take my chances with an immune system well developed through public transportation for many years, than trust any jewish solution.",
				"added": 1583049139
			}
		],
		"1582173702_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 83,
				"body": "Okay, tips.  Seriously consider doing a wee bit of volunteer work, even four hours twice a week.  Salvation Army for example doesn't turn down help, and having a reputable organization behind you works wonders for greasing the system.  Think about what you're going to say; where you've been living all this time with no history.  You're going to have to be able to talk convincingly face to face with a bureaucratic moron, because it isn't just completing forms.  Having no history doesn't need to be a handicap, but in your case filling in the gaps will be a return to faking it.  Can you convince someone you're gay, or another minority group to identify with?  That might be a good angle to cover for the lack of history, because you'll score needier in their eyes.  Perhaps you had a long term relationship that went sour and got kicked out?  Have you got any decent plastic ID with your preferred identity?  Your primary goal is to qualify for TANF as that's where the cash is.  SNAP, Medicare and subsidized housing come with this, but won't make up for the lack of dollars every month in your pocket.  I'm assuming you have a U.S. birth certificate, and an address, though you seem woefully underprepared for this scheme.  Maybe with determination you might pull it off.",
				"added": 1582330037
			}
		],
		"1582356450_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": [
			{
				"comment_id": 84,
				"body": "Kanade, pictures can upload to imgur, with a link in your post.",
				"added": 1582407996
			},
			{
				"comment_id": 85,
				"body": "> [kanade](#comment_82_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP): Here it is;https://imgur.com/a/81PmoHf\n\n\"Only\" 370 in Florida!?  Double that number for Orlando alone.  Try this search term \"disney world abductions\".  [Disney World is a sovereign nation and a child abduction center, secured by the CIA, and complete with cages underground.](https://www.silverdoctors.com/headlines/world-news/jim-willie-alskdfalksdjflkasdjf/)",
				"added": 1583047477
			}
		],
		"1585525602_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 87,
				"body": "Ben Fulford writes of a massive EM pulse that's supposed to go through the whole planet next week.  Title: â€œProject Blue Beam is full steam ahead, so sit back and enjoy the fake Armageddon showâ€  More Qrap.",
				"added": 1585545690
			},
			{
				"comment_id": 88,
				"body": "> [robione](#comment_511_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Yeah that's not likely. It'd fry too much stuff.\nAs a cover story it's more plausible than Arabs with boxcutters.",
				"added": 1585558047
			}
		],
		"1586741722_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 89,
				"body": "> [thorburn](#comment_49_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): 500 mg of Vitamin C is nothing like enough to be effective unless that amount is being consumed every hour.\n\nStart with at least 4 x 500 mg twice daily with meals.  Increase this until your body indicates it can't process more.  That's around 6 to 10 grams daily.  You will know when your body has enough, as your shit goes soft.  This is what's needed when you're healthy.  When your immune system is working overtime, it will need more.",
				"added": 1586765521
			}
		],
		"1586824584_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 90,
				"body": "My experience showed me that Brave has time-delayed malware.  Avoid this browser.",
				"added": 1586938605
			}
		]
	},
	"comment_vote": {
		"3_1EJorU3nHcCViXXzD7BkmyJzwgqxqC2Zuv": 1,
		"8_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn": 1,
		"967_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"9_1LW31sbmLZebhhgTx2bhzeUNYbZ5cYnBfe": 1,
		"11_1MvfJt4w7iUCEsraP8C8gqNHp5ZQiAKhaN": 1,
		"12_1LW31sbmLZebhhgTx2bhzeUNYbZ5cYnBfe": 1,
		"20_1HFmAHXvHgkwfXcGZH9hMqj9TbgXDZNwGc": 1,
		"6_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH": 1,
		"3_1Gvs3AKBY5YjUMPchHuoQuAYnWApBm1myY": 1,
		"25_17SvvdtU1CMTXxiX6zNNsfmcreKmDvzswq": 1,
		"58_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": 1,
		"105_17SvvdtU1CMTXxiX6zNNsfmcreKmDvzswq": 1,
		"107_17SvvdtU1CMTXxiX6zNNsfmcreKmDvzswq": 1,
		"429_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"88_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12": 1,
		"9_1ATpyKRza3N49rrjJFPznrUG9BN1i6e6Uq": 1,
		"41_1NdJyMSqnWWim7ibxBvaNsMgQvqkkTXVnz": 1,
		"675_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"39_1NdJyMSqnWWim7ibxBvaNsMgQvqkkTXVnz": 1,
		"15_1e6paNoDoqwCZGNa4o4uX43GrawvJuVB5": 1,
		"87_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK": 1
	}
}