{
	"next_post_id": 468,
	"next_comment_id": 88,
	"next_follow_id": 12,
	"avatar": "png",
	"user_name": "数字崇拜",
	"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
	"intro": "沉迷古代史的程序员",
	"post": [
		{
			"post_id": 1,
			"date_added": 1528460975,
			"body": "你好 ZeroMe!"
		},
		{
			"post_id": 1529416800,
			"body": "2千亿，太刺激了。",
			"date_added": 1529416798
		},
		{
			"post_id": 1530714923,
			"body": "殷墟，邺城，邯郸，邢台都紧靠太行山，因为它们都建在古黄河的西边。",
			"date_added": 1530714920
		},
		{
			"post_id": 1530798024,
			"body": "禹贡冀州包括整个黄河以北，差不多就是晋国。比山西多了河南黄河以北的部分以及河北北京靠近太行山的地方。",
			"date_added": 1530798020
		},
		{
			"post_id": 1530798360,
			"body": "考古网去年底到今年初发了几篇文章，承认中国的青铜技术是从西伯利亚中亚方向传入，应该代表中国考古界主流态度的转变。",
			"date_added": 1530798355
		},
		{
			"post_id": 1530889503,
			"body": "在所有的九州十二州分法里，都有兖州，兖州都在黄河和济河之间，也就是在冀州和青州之间，面积很小，是唯一四面环水的州，也没什么山，在先秦应该地势很低，很潮湿，环境不好。一个小州却是一个通行的州，隐藏了不少信息。",
			"date_added": 1530889497
		},
		{
			"post_id": 1530891533,
			"body": "尔雅的九州实际上和吕氏春秋一样，只是州的名字略有不同。所以九州划分方法应该是三种。尔雅和吕氏春秋是中间派，有幽州无并州，也无梁州。禹贡是大冀州派。设定党周礼是小冀州派，为了分出并州合并了青徐二州。",
			"date_added": 1530891526
		},
		{
			"post_id": 1530892992,
			"body": "禹贡应该成书于先秦，或者底稿在先秦产生，肯定代表了在禹贡冀州某种势力。可能的有以下几个，陶寺文化，殷墟商，春秋晋国，战国初期魏国，战国赵国。其中陶寺太久远，而且势力范围太小，似乎也没有大一统野心，更重要的是把河内划入冀州对它无益，魏国中心在冀州比例太低，可能性最小。其次赵国虽然中心一直在冀州，但是冀州在赵国的比例不太高。晋国是最符合的，但是除了yy似乎也没有啥很大的利益。我觉得最可能的就是殷墟的商朝（很多人认为二里岗文化也是商朝，所以要这么区分），主要是很可能这里有利益。",
			"date_added": 1530892984
		},
		{
			"post_id": 1530961275,
			"body": "殷墟在河内东部，二里岗偃师二里头都在黄河之南，暗示冀州正统就可以排除那三者，尤其是二里岗，二里岗占优势时期东到泰山南北，西到西安，南到长江，都使用二里岗统一制式的陶器，到殷墟为中心时，远处的文明虽还受殷墟风格的影响，单都有了自己的特色，很多地方甚至已不再收中原中心风格的影响。同时二里岗和殷墟风格有较大延续性，一般认为都属商朝，如果殷墟是支属篡位，造成王国崩溃，那么会承受比较大的内部舆论压力，那么鼓吹河内正统贬低河南就成为一种可用的方式。",
			"date_added": 1530961266
		},
		{
			"post_id": 1530968005,
			"body": "如果古陶寺的遗民散布了对陶寺的崇拜，殷墟将自己和陶寺捆绑，显然会增加自己的正当性。考虑到殷墟甲骨文中有禹的内容，而且禹贡里面没有提及夏朝。另外殷墟离黄河不远，过了黄河就是兖州，兖州大部在殷墟时期被殷墟严密控制，可以算是远郊区。同时以冀州统治兖州，兖州也没有能力反抗。同时对于二里岗时期能严密控制山东丘陵附近，山东丘陵北麓的青州还有些控制力，南麓的徐州完全失控，这也是纣王要全力征东夷的原因。由于对西部控制力下降更多，汾河下游聚落减少，城市消失，陶寺已经不成为竞争对手，以此宣传已经没有后顾之忧。",
			"date_added": 1530967995
		},
		{
			"post_id": 1530969406,
			"body": "禹贡的草稿被殷墟人或殷墟遗民写成几百年以后，估计是晋人，往里添加了梁州和扬州。而禹贡写成之后不久，周朝人也在发掘陶寺遗民和二里头遗民，建立了夏朝的历史，并把禹和夏朝联系起来。故事就越发有意思了。",
			"date_added": 1530969395
		},
		{
			"post_id": 1531402482,
			"body": "其实前几天想的也有问题，梁州和扬州不一定是很晚添加。因为蜀国当然和殷墟交通不畅，但是汉中也属于梁州，联系可能比较多。商纣征东夷很可能是打徐州，那么扬州的信息是知道一些的。荆州是中原传统的铜矿石来源，所以我上次没说荆州。",
			"date_added": 1531402470
		},
		{
			"post_id": 1531491114,
			"body": "商朝经常迁都显然是不可能的，而商丘更不是商朝的核心地带，关于商朝起源于东夷更没有考古学证据。毕竟郑州很可能是商朝前期中心城市。商朝曾迁都东边可能是被迁到宋国的商人编造的传说。",
			"date_added": 1531491101
		},
		{
			"post_id": 1531491387,
			"body": "三代即使不是城邦（如果非要把城邦定义得很狭义），城邦色彩也很浓厚，统治一个地域的与其说是国君不如说是国人。迁都很困难，需要连原来的城市人口一起迁移，而国人很可能不愿意。同时一个城市一旦失去其原有的政治地位，很快就会衰落。",
			"date_added": 1531491373
		},
		{
			"post_id": 1531491949,
			"body": "陶寺被石峁占领后很快就衰落了，二里头失去权力之后也衰落了，二里头衰落以后，偃师商城也失去了战略意义开始衰落，殷墟兴起之后郑州的二里岗也开始衰落。殷墟原来兴建于洹北，那时二里岗还有统治地位，后来突然放弃洹北而兴建洹南，可能是殷墟统治者是二里岗的一个支系，后来通过某种手段夺取统治权，所以从二里岗迁出一部分人口到殷墟，洹北太狭小，或者有什么其他忌讳，就在洹河南岸兴建殷墟。",
			"date_added": 1531491934
		},
		{
			"post_id": 1531547129,
			"body": "说实话，中国的工业创新有三种：抄板、抄板没抄好做个壳、买来打磨商标。",
			"date_added": 1531547113
		},
		{
			"post_id": 1531571230,
			"body": "我不知道那些工业党啥的是怎么回事，估计要不然不在工业研发第一线，要不然在某些落后得不得了的行业，又或者是赚昧心五毛。我做工业相关的软件那么多年，换了几个行业，都有美国企业在上面压着，放开了山寨也只能山寨部分发明出n年的二三线产品。",
			"date_added": 1531571213
		},
		{
			"post_id": 1531832422,
			"body": "中国人很多特征真是自古以来。比如说是面包，大概就是小麦磨成面粉做成面团，加盐发酵以后烤熟了吃。几千年前就传到新疆了，中国北方人直接学就可以了，结果到汉代只学了种小麦，种出来粒食，不好吃，过了几百年学了磨面粉，煮大面疙瘩吃，又过几百年学会发酵，终于会蒸馒头，估计几百年后会彻底变面包。其实学一整套做面包应该不难，可就是不肯全盘西化，非要取其精华去其糟粕，其实一整套才是真的精华。",
			"date_added": 1531832404
		},
		{
			"post_id": 1532094764,
			"body": "老蛮最近的教育经费之争，显示了老蛮对于数据的很多漏洞。不过说回来，以前老蛮找政府麻烦也有这些漏洞，不过这回五毛了，漏洞就被救出来了，包括我也是这样。不过用政府的数据，这个玩意可以任意变换统计口径，甚至可以造假，用它的数据要想打它的脸是不太可能，强行打脸只能像老蛮一样留下很多漏洞。不过在说回来，隔三差五的改变统计口径，本身就说明数据出了大问题，为啥还要强行打脸呢？",
			"date_added": 1532094745
		},
		{
			"post_id": 1532095748,
			"body": "西方最优解有很多，有些甚至是唯一解（其他解决方案和这个比起来都成了扯淡）。比如医学，原来古希腊的医学完全无法统一喜马拉雅山帕米尔高原以西，说明肯定不是最优解。现代西医几乎统一了，说明至少是最优解。如果你知道现在的民族唱法是改开以后用西方的唱法加几个民族花腔弄出来的，你会对最优解有更多了解。近现代日本作曲家很多，有很多搞民族风，是指作其他民族的风格曲子，而不少似乎很传统的日本曲子，刚出现时是西方风格，是在二十世纪改成了日本风格。因为西方音乐体系是唯一解，日本人接触西方时才学到这些，开始学的不深，只能做些西方风格的曲子，后来更深入，变几个音就成了日本风格，变另几个音就成了其他民族风格。",
			"date_added": 1532095728
		},
		{
			"post_id": 1532145501,
			"body": "冷兵器吧那伙人转夏尔谢夫工程师的帖子，五毛化又前进了一步，所谓反华就不会被统战就是瞎扯，反对大汉族主义更是共党传统美德。",
			"date_added": 1532145480
		},
		{
			"post_id": 1532589398,
			"body": "何新及其徒子徒孙还是很有趣，全世界其他国家人都联合起来编造历史来欺骗中国人，那么多国家那么多民族那么多人能够步调一致的行动，真以为世界上只有两个国家一个叫中国一个叫外国。另外就是中国人一听外国历史比中国长就萎了是个什么原理我也不知道。我觉得他们不如说外国只是一个小国，完全靠编造才那么大不是更好。",
			"date_added": 1532589376
		},
		{
			"post_id": 1532702044,
			"body": "不少现在公知气的大V，几年前还是相当自五的，比如刘夙，几年前老说美国页岩气要完蛋，好像是说14年或15年，后来有一次在十五言发文章说出那么说的原因，是他认为美国人不可能有有意的创新。到现在刘夙还和王小东眉来眼去，自称工业党。",
			"date_added": 1532702021
		},
		{
			"post_id": 1533647603,
			"body": "知乎都何新化了，哈哈哈。",
			"date_added": 1533647579
		},
		{
			"post_id": 1533649752,
			"body": "九州名字里面n和ng结尾的比例比较高。说实话我是支持原始汉语是屈折语的。我的解释可能是某种后缀的遗存。比如青州，就是齐屈折变化加一个后缀，于是成了青音，借用青字。齐字加一个表示水名的前缀，就成了济水。",
			"date_added": 1533649727
		},
		{
			"post_id": 1533653100,
			"body": "南方三个州名：梁荆扬都是ng结尾，还有西边的雍州。连后来产生的营州凉州也是。显然在边缘用ng生成州名比较多。",
			"date_added": 1533653074
		},
		{
			"post_id": 1533816976,
			"body": "最近看社科院考古所的微信文章，有几个很有意思，其中一个讲先秦渭水下游丰镐一带定居点密度比周原一带高地低，文章分析认为是当时关中盆地的低地比较潮湿，不适合当时人居住，是郑国渠等水利工程使那里适合居住。\n\n这一点说明了当时北方居民对低地适应很差，主要生活在高地上。",
			"date_added": 1533816949
		},
		{
			"post_id": 1533824692,
			"body": "第二个是谈汉河和禹河是一致的，不过谈到考古钻探发现那时黄河北流是三条支流，一条是比较靠西直接向北的，有些像禹河，不过是从汉河分叉的，主要那条就是汉河，东面那个从濮阳走漯河。\n\n当然我最感兴趣的是文章提到当时黄河下游有几公里到几十公里宽。可以想见黄河下游低地是非常潮湿，不太适合当时生产居住（文中提到也有很多定居点，但是等级应该不太高）。\n\n这也是为什么河北很多地级市都紧贴太行山，因为那里地势高，尤其是一些从太行山西侧发源的河流的冲积平原。邢台邯郸都是前秦形成的古城附近。石家庄附近一直有个地方政治中心，只是到近代落到了石家庄。北京也是先秦就发展成为一个地区政治中心。只有保定历史渊源比较近。\n\n在近两千年地势抬高，以及北方人在低地生存能力的提高，河北东部增加了大片土地和县城，距离太行山东麓的州郡行政中心太远，所以东部设立了一系列州郡级城市。\n\n这也是河北东部的地级市一般位置接近辖区中心，而西部地级市在辖区西部。东部地级市辖区南北长的比较多，西部地级市东西长的比较多。这里不把关外的张家口和承德计算在内。",
			"date_added": 1533824664
		},
		{
			"post_id": 1533825874,
			"body": "第三个讲西周时期殷墟附近的形势的。提到殷墟范围内西周有五个很小的居民点，其中两个有武装，一个驻扎在商王陵墓，另一个驻扎在殷墟王宫附近，这五个居民点都是典型的周文化。殷墟附近有几十个居民点，沿洹河分布，和殷墟时期分布密度差不多，都是典型的殷墟文化。\n\n显然，商周时期是城邦制的，周人把大邑商的居民全部迁走，把非村子里的商人留下，并在殷墟驻扎自己人防止原来的居民回来。\n\n附带说一下，殷墟在太行山东麓，是漳河冲击扇上，但不在漳河边，在洹河边，选址很有意思。在太行山东麓漳河冲积扇上，地势才能较高，但是不能在漳河边，因为漳河洪水很厉害，才有那么大冲积扇，但是城市需要水源，所以找条较小河流洹河附近建城。这也是安阳市正好在差不多地方的原因。\n\n很多古城多次毁灭多次在同一地点建城都是有原因的。",
			"date_added": 1533825845
		},
		{
			"post_id": 1534060025,
			"body": "现代山东肯定不是一个地理文化单元，只是被大一统的行政机关划出的行政区划。\n但在很古的年代山东确实曾经是一个地理文化单元，那时山东南北两方都是河流沼泽，山东的“东夷”也是种小米的族群，所以只能生活在丘陵附近由山洪冲击而成的高地上。\n不过似乎在殷墟时代这一情况开始解体，殷墟的商人比郑州的商人实力弱，已经失去了对丘陵之南的控制，却牢牢控制丘陵以北。\n在西周，齐国基本上接管了济水以南到山东丘陵的地区，鲁国却没有进入丘陵之南，在禹贡徐豫两州之间的地方，徐州仍然是由东夷控制。\n到了春秋战国时期，鲁国进入徐州，控制徐州北部，徐州地势最高的地方，徐州一众小国很多都受鲁国领导。当时齐鲁两国交战，虽然齐国有优势，但是无法对鲁国伤筋动骨，因为绕过丘陵很麻烦。\n当时扬州的吴国应该无法跨过淮河威胁鲁国，越国灭吴以后更不可能。豫州的国家规模都小等于鲁国，不可能威胁鲁国，冀州的晋国太远，分晋之后更不可能。最后意外发生了，楚国灭了越国，然后被秦国赶出长江中游，挤到了合肥，稍稍拓宽一点，就在齐国眼皮底下灭了鲁国。这说明淮河的阻隔作用都远远小于山东丘陵了。",
			"date_added": 1534059995
		},
		{
			"post_id": 1534061222,
			"body": "到春秋战国以后，丘陵南北就彻底分开了。比如丘陵以北流行刀币，丘陵以南流行铜贝，鲁国也是铜贝，看来和楚国的经济交流早就超过了和齐国周国三晋。",
			"date_added": 1534061191
		},
		{
			"post_id": 1534062095,
			"body": "通过战国铜币，可以分出经济文化的分区，山东丘陵向北齐燕及赵国是刀币主要流行区域，中原三晋周是布币主要流行区域，偏西的魏国和秦国是圜钱主要区域，南边都是铜贝流行。可以看出有四个区域，西边可以叫泛秦国，东边可以叫泛齐国，南边可以叫泛楚国，中间叫泛晋国。还可以看出，中间泛晋国区域里有泛秦国和泛齐国成分。",
			"date_added": 1534062063
		},
		{
			"post_id": 1534062923,
			"body": "然后看看历史，秦国的兴起就是先占泛秦国，然后占领摇摆的泛晋国，最后攻灭其他两个地区。而秦末的反抗者主要也集中在最后被秦征服的两个区域。项羽分封后，最先反抗的不是刘邦而是齐人，实际上楚汉争霸本来是三国演义，不幸的是齐国比较弱。这也是早期很多史书说齐人反复的原因，因为齐人要独立，但是主要叙事者立场都是站在关中和楚两方的。然后泛秦国又建立了汉朝，泛楚和泛齐联合起来发动七国之乱，泛晋则在这些事情发生时一直摇摆。",
			"date_added": 1534062890
		},
		{
			"post_id": 1534063466,
			"body": "到了西汉末年，起于泛楚的绿林和起于泛齐的赤眉又反了。结果这些人都在占领关中后出了问题，最后是起于泛楚北缘的刘秀在泛晋和泛齐边缘地带称帝，拉了一支联合战队打了天下，建都在一个各方的交界地带洛阳建都。",
			"date_added": 1534063432
		},
		{
			"post_id": 1534063792,
			"body": "当然这种解决方案是西汉时统一教开始深入人心的结果，也是关中开始衰落的结果。",
			"date_added": 1534063757
		},
		{
			"post_id": 1534064747,
			"body": "附带说一下，项羽封建性不强，从他建都彭城就可以看出，他本来起于吴地，当时分给自己徐州和扬州的土地，却建都在徐州的正中间。徐州是个较大的平原地区，估计居民更容易编户齐民化，可以提供更多骑兵步兵。这也是项羽两次被端老窝的原因，因为徐州适合骑兵作战，但是徐州骑兵肯定很难对抗关中骑兵，于是他就完了。",
			"date_added": 1534064711
		},
		{
			"post_id": 1534069288,
			"body": "到三国时，泛楚向南进到长江流域为主，北边的徐州和豫州南部荆州北部都成了中间地带。\n先开始泛齐泛晋对泛秦的董卓，大部分泛楚观望。然后泛晋泛齐泛楚的混战。实际上最早最残酷的混战是孙坚争夺豫州的战斗，史书提及不多，演义更是不提，总之豫州空了，孙坚也离开豫州了。然后控制扬州的袁术，联合控制幽州的公孙瓒向各地派刺史，控制冀州的袁绍也这么做。混战第一期是，袁绍击败了公孙瓒，控制河北，泛晋板块成为他的核心区，袁绍方的兖州牧曹操占领了兖州并渗透徐州豫州，徐州袁术方的陶谦刘备遭到反复攻击，已经立足不稳，荆州刘表加入袁绍方。第二期曹操迎了汉献帝，豫州等地很快解决，徐州袁术方刘备也倒戈，接着消灭了袁术。扬州长江流域兴起了孙策。第三期曹操在击败袁绍，一统泛齐泛晋两个板块。\n赤壁之战前后，曹操虽然消灭了刘表，但是在泛楚的同盟下不得不退出长江流域。曹操的政治中心也迁到邺城，泛齐泛晋的交界处附近。\n曹操后来虽然攻占关中，但是益州在较早的时代也属于泛秦，泛秦的人显然不喜欢一个泛齐的政权，所以曹操在汉中的争夺很莫明其妙的失败，而弱小的蜀汉莫明其妙的能够有力量反复攻击强大的曹魏所属的关中。",
			"date_added": 1534069251
		},
		{
			"post_id": 1534070609,
			"body": "在东晋十六国时期，慕容氏的各种燕以泛齐为根据地和以泛秦为根据地的各种秦反复争夺。南方则是占领泛楚的东晋。直到拓跋氏从泛晋攻入中原一统北方。然后泛秦泛齐再度分裂东西魏和北周北齐。双方争夺的是泛晋，然后又是泛秦统一天下。这种模式到唐朝中后期就结束了，因为关中经济地位快速下降。实际上到南北朝后期可能就有问题了，但是泛秦更容易补充西域雇佣兵和工匠。",
			"date_added": 1534070571
		},
		{
			"post_id": 1534163813,
			"body": "夏粮小麦收购减少，似乎早稻没减少。肯定有啥问题。\n猜想一，小麦进口美国是大头，估计除了合法进口还有走私，而大米则是从南方几个邻国进口的。中国收储的粮食很多可能不是自产而是用进口粮冒充，现在贸易战，于是小麦收储大幅降低。\n猜想二，有很多粮食根本没有收储，中央又要查，放火太多也不合适，于是直接借机今年收购量大幅降低，把以前缺口补上一些。\n猜想三，中央想大涨价了。",
			"date_added": 1534163774
		},
		{
			"post_id": 1534172816,
			"body": "上古有几大个姓，都带女字偏旁，有些马列史学家说这是母系社会的遗迹，被反复打脸。\n后来研究甲骨文，发现商王周边的女人一般被叫做“妇某”，那个“妇”字一般写作“帚”，就是不带女旁，某就是各种名字，被考古学家叫做妇名，比如妇好。妇名一般带女字偏旁，另外的部分往往和方国的名字一样，一般认为就是这个妇所来自的方国，妇好就来自子国。\n于是有些考古学家和历史学家提出上古女字偏旁的姓来源可能是同样的，是最初周人模仿商人称呼来自不同地方妇女的称呼。这个主张我是很同意的。\n",
			"date_added": 1534172776
		},
		{
			"post_id": 1534431338,
			"body": "韩信被擒也是吃了和项羽一样的亏，徐州是个大平原，适合骑兵作战，却不可能像农牧交界地带一样产出那么多那么好的骑兵，而且西面和豫州之间没有天险可守。项羽也是在早期拥有较多非徐州来源军队，所以彭城之战能击败刘邦，把刘邦堵在荥阳一带有山的地方，到后期一旦东归，立刻崩溃。",
			"date_added": 1534431297
		},
		{
			"post_id": 1534606078,
			"body": "上古女字偏旁的姓里面，比较出名的九个姬姜嬴姚妫姒姞妘妊 现在发音声母y的有姚嬴妘，声母为j的有姬姜姞，按照广韵声母为见母的姬姜妫，以母的有嬴姚，姞是群母和见母分别主要是清浊之分，姬有一个意向是以母，妘是云母接近以母，见母以母应该有联系。\n韵母方面姬妫姒都是止摄，姞妘是臻摄，而且这九个全是三等开口的。应该有内在联系。",
			"date_added": 1534606036
		},
		{
			"post_id": 1534685494,
			"body": "实际上从徐州发迹的全国性政权很少。朱元璋是淮河以南的人，给自己选择的根据地都到了长江流域。而徐州也远离政治中心，最终成了大运河的牺牲品。",
			"date_added": 1534685451
		},
		{
			"post_id": 1534685841,
			"body": "姜在这几个姓里很特殊，它在甲骨文里就出现了，但似乎不是指姓，而是指女性羌人。甲骨文中羌是羊下面有个人形，姜下面是女人形（跪坐人形）。而羊羌姜都是同韵的，羊是以母，羌是溪母，姜是见母，似乎羌和姜的发音也是在羊之前有附加成分。",
			"date_added": 1534685797
		},
		{
			"post_id": 1534688417,
			"body": "殷墟甲骨文里羌人被作为人牲很多，似乎羌人很惨，任人宰割，被殷人从老家抓去做人牲。但我看了一些考古的文章后觉得可能不一定是这样。\n早期的中原中心大城有三个，二里头二里岗殷墟，一般认为前一个是夏朝，后两个是商朝，不过二里岗和殷墟作为中原中心时代差异也不小，一般也把这个时代的中原及周边分成三个时期，分别对应三个大城统治时期。\n在这个中原统一的时期以前比较接近中原后来文明的最大城就是陶寺，在山西西南汾河下游谷地。这片地方在二里头二里岗时期也很繁荣，以东下冯为中心，其文化属性和陶寺继承性不强，在二里头时期很接近二里头，在二里岗时期很接近二里岗，显然是作为一个靠近中心的地区。在殷墟时期却空了，只有几个很小的村落遗址。直到西周在这里分封晋国。\n这一大片适合农耕的地方荒芜几百年，很可能就是这里是殷墟政权面对强大的压力无法防守这片区域，只能将自己人撤出。那么是谁？其实很可能就是羌人，羌人分成很多小群体，虽然不可能通过大会战击败对手，却很容易渗透过封锁线。羌人人口众多，后来周朝灭商，封的诸侯就有很多姜姓，应该是羌人家族。\n所以当时形势可能不是殷商进攻，而是羌人因为人口增加而成为进攻方。殷人在汾河无人区攻击渗透进入羌人小群体，企图通过残酷的人祭来恐吓羌人，结果就是羌人为了报复支持周人灭了殷商。",
			"date_added": 1534688372
		},
		{
			"post_id": 1534864494,
			"body": "二里岗统治时期统治范围大，殷墟统治时期统治范围小很多，但是殷墟遗址范围却比二里岗大了一截，感觉是商人大部分都退到首都附近居住，有些像阿兹特克了。",
			"date_added": 1534864448
		},
		{
			"post_id": 1534939401,
			"body": "真正的四大发明之一：\n地方债风险权重有望调降至零，或迎来大利好。\n\n",
			"date_added": 1534939354
		},
		{
			"post_id": 1535034267,
			"body": "二里岗漳河型的成分比较多，显然殷墟一带就是商朝起家的地方。\n商朝并非起于什么东夷，只是起于安阳邯郸一带，东边地势低洼的地区受到先商人统治而随同先商人一起行动的。至于东南起源说法可能是周朝或者宋人编出来的。",
			"date_added": 1535034219
		},
		{
			"post_id": 1535036853,
			"body": "二里岗末期的白家庄期，商王搬到了十几公里外的小双桥，把国人留在了二里岗，这一时期铜器质量数量下降，但是统治范围在扩大。",
			"date_added": 1535036804
		},
		{
			"post_id": 1535121693,
			"body": "许宏的“大都无城”其实是“大都无郭”，宫城还是有的，就是百姓外面没城墙。宫城是防着百姓的，郭是保护百姓的。而且这里的百姓还有点百姓的原始意义，就是统治族群，都是君主的同宗姻亲时代老臣啥的，类似于各个部委的人。",
			"date_added": 1535121643
		},
		{
			"post_id": 1535259656,
			"body": "城墙在现代之前，基本就是政治地位的分界线，城里的人可以轻松攻击城外的人，城外的人很难攻击城里的人。没有郭那么首都就成了大村子。欧洲中世纪贵族地位高的一个原因就是贵族在城堡里，而平民最多可以去城堡临时避难。城市一兴起，拥有了城墙，就拥有了政治特权。",
			"date_added": 1535259605
		},
		{
			"post_id": 1535261392,
			"body": "以前的城市城邦啥的，城里人也大部分是农民，因为农民聚居，才产生了手工业。",
			"date_added": 1535261340
		},
		{
			"post_id": 1535294386,
			"body": "从百姓或者叫国人的角度来说，城郭并立的时候地位最高，比较自由，一定程度上是君主感到不安，却无可奈何，只能另建一座城自己住。",
			"date_added": 1535294333
		},
		{
			"post_id": 1535466120,
			"body": "一会儿公知一会儿五毛的基本上就是五毛，一直是公知的绝大部分也是五毛。毕竟能在舆论场呼风唤雨还不被封。",
			"date_added": 1535466066
		},
		{
			"post_id": 1535777456,
			"body": "现在在中文网络上塑造所谓东林党形象的，就是七字狗那帮人，按七字狗的话往下说的，称记者公知学者富商为东林党的，都是吃七字狗屎下贱狗。\n七字狗贬东林吹阉党，无非是黄鼠狼下耗子一窝不如一窝，知道包子无法比崇祯，只好把包子比魏忠贤。\n东林党核心是没事瞎扯淡的“理论家”，除了维护一个没有大用的理论体系外就只剩一死了，外围是大量的党争爱好者，这部分成分和其他党没有什么太大区别。阉党核心比普通司礼监太监文化水平差太多，完全是出来瞎折腾的。至于明朝的富商，基本上在朝廷上缺乏代理人。",
			"date_added": 1535777401
		},
		{
			"post_id": 1535792301,
			"body": "其实某国各派的好恶歧视链啥的往往是党国塑造的结果。\n像黄金神棍刘仲敬的话你都能发现这些。\n但党国的话要注意，党国说反动会道门，因为当年起家没少搞会道门，说某某依靠境外势力，因为共党就是依靠这些起家的。\n共党一直推崇中华民族的民族主义，压制汉族的民族主义，刘仲敬也在这两个环节歧视链方向也是相同。其实是因为大汉族主义太土，比中华民族更不符合知识分子游士的审美。",
			"date_added": 1535792245
		},
		{
			"post_id": 1535817222,
			"body": "对于原始语言的假设，应该是很多拟声词，主要是动物名字和一些有特殊声音效果的动词，然后产生很多派生词，自然是介于屈折语和黏着语之间的形式，而且当时没有语序，区别成分词性肯定要有屈折。",
			"date_added": 1535817165
		},
		{
			"post_id": 1535888523,
			"body": "原始的文字就是象形，一个字只能是一个词，肯定是多音节。同时，很多语音成分没法表现出来，只剩少量可以用字表示的成分。\n由于文字比语言更稳定，文字最终影响了语言，语言变成孤立语，用语序代表成分，同时字变成了单音节。",
			"date_added": 1535888465
		},
		{
			"post_id": 1535983781,
			"body": "拼音文字的形成是因为附近有个象形文字的文化，双方词汇相差很大，开始时直接借用象形文字写自己的语言，但是词汇无法一一对应，于是使用同音或近音的象形文字代替本族词汇（实际上使用象形文字的一方也很早开始了这个进程，用同音字假借），最终形成了拼写规范，就成了拼音字母。典型的例子就是日文，有个万叶假名的阶段。",
			"date_added": 1535983722
		},
		{
			"post_id": 1536147951,
			"body": "才发现，南美干旱，今年南美大豆要欠收。这贸易战打的，不怕美国的攻击措施，就怕中国报复措施。",
			"date_added": 1536147891
		},
		{
			"post_id": 1536395154,
			"body": "上古黄河流进大陆泽，大陆泽又叫巨鹿泽，旁边的地名就叫巨鹿，中原还有个湖叫大野泽，又叫巨野泽，附近地名叫巨野。",
			"date_added": 1536395093
		},
		{
			"post_id": 1536396577,
			"body": "虽然跟现有拟音不合，但是还是有可能上古巨和大音近。",
			"date_added": 1536396515
		},
		{
			"post_id": 1536484796,
			"body": "如果单以得益的阴谋论来说，刘强东的事是党国得益。刘强东多少也会狡兔三窟，几亿美金安排在国外，如果国内的钱出事就又多了个郭文贵，这次如果弄成刘强东被美国通缉，他就跑不掉了。而且一些事情比如报案时间点，证据什么的都是报案人掌握。",
			"date_added": 1536484733
		},
		{
			"post_id": 1536761295,
			"body": "上古人口十分稀少，大的，城市级别的居民点基本上绕着大河在山坡上几乎按照等高线分布，小的村级居民点沿着较小的河流分布，其他大部分地方几乎没有人。",
			"date_added": 1536761231
		},
		{
			"post_id": 1536762611,
			"body": "看了张弛的文章，在龙山文化中后期，先是繁荣的良渚文化迅速衰落，接着山东和关中也迅速衰落，最后只有洛阳盆地附近比较繁荣，于是有了二里头一枝独秀。我又想到，当时二里岗的人也是从邯郸安阳附近迁到郑州附近，似乎最开始也像是因为什么要集中到洛阳盆地附近，不知是为了要得到什么还是要逃避什么。",
			"date_added": 1536762546
		},
		{
			"post_id": 1536763786,
			"body": "其实当时还有个例外，就是二里头同时代内蒙东部突然冒出夏家店下层文化，很繁荣。",
			"date_added": 1536763720
		},
		{
			"post_id": 1536849352,
			"body": "根据许宏的先秦城邑的一些资料，仰韶之前东亚大陆是相当荒凉，仰韶开始繁荣，经过龙山时期，到二里头时期突然萎缩，如果不计入夏家店下层，基本上就是二里头一个中心。然后下七垣漳河型的人在郑州建立二里岗在偃师建立偃师商城，取代了二里头，把二里头的据点都换成二里岗类型的据点，并在衰落的地区新建据点，但是似乎仍然比较局限在洛阳郑州一带，到殷墟时期就是换了个中心，到西周稍稍增加一点，真正繁荣并超过龙山时期还是春秋。长达千余年中原之外都很荒凉，只剩下中原一个中心，似乎是一个大的灾难成就了单一的中华源头。",
			"date_added": 1536849285
		},
		{
			"post_id": 1536851494,
			"body": "红山文化基本上龙山时代就灭绝了，良渚文化突然衰败，石峁古城在灭了陶寺以后也突然人间蒸发，整个老虎山文化都衰落了，长江流域的屈家岭—石家河文化也没有城市了，山东龙山文化也几乎消失，突然空降了一个二里头，可能是以中原为主以其他一些周边残余逃难的难民为辅建立的。最后文化差异较大的夏家店下层和三星堆也在西周时被取代了。完全是一场不明的灾难把原来异质的文明抹掉只剩一个，再往后不同文明的来源只有中亚的输入了。",
			"date_added": 1536851426
		},
		{
			"post_id": 1536985770,
			"body": "谈谈刘仲敬的政治正确，有一天我上午在网易云音乐听刘仲敬说内亚是石头建筑，中原是半地穴建筑，下午看到讲考古发现的文章是在新疆发现好几千年前石头建的半地穴建筑。其实中国境内的内亚部分，新疆和东北都是喜欢地穴式半地穴式建筑的地方，新疆是雨水少，东北是冬天下雪不下雨，冬天又冷夏天又热，地穴式半地穴式房屋冬暖夏凉。到了内地，反倒是半地穴式并不适合，最多是在西北还能勉强住，仰韶恰恰是西北为主，后来又被其他房屋形式取代，很可能地穴半地穴式房屋是内亚输入。最开始人们还保持内亚风格地穴半地穴式房屋，后来开始建筑地面房屋。殷墟考古就发现殷墟绝大部分半地穴式建筑是窖藏，住房绝大部分是地面建筑。",
			"date_added": 1536985701
		},
		{
			"post_id": 1536997507,
			"body": "项立刚不是一直是人渣吗？为啥有人才刚刚觉得他不对？这么晚才认识到而且还以为他以前对，说明这些人起码也是大半人渣对不对。",
			"date_added": 1536997437
		},
		{
			"post_id": 1537009877,
			"body": "瑞典那事一般来说就是等反转了，因为太离奇了。而且据说那个所谓的几十公里的坟地，查了一下，是著名的世界遗产林地公墓，似乎离市中心也不太远，估计不超过五公里，四周都是市区。附带看一下照片四周大马路石头围墙路灯，鬼才信那里能离市中心几十公里。而且警察抬人出来，你要肯自己走警察哪里那么勤快，夜里一两点钟，又是女警察，估计是满地打滚来着。",
			"date_added": 1537009806
		},
		{
			"post_id": 1537066868,
			"body": "还得说体制内有高人，比如说同样是碰瓷，外交部王和华虽然在国外臭了，可在国内香呀，号称外交天团（其实只在国内香应该叫内交天团才对），可这家人在国内也臭了，只能说水平太差。",
			"date_added": 1537066796
		},
		{
			"post_id": 1537070917,
			"body": "弄不好那个旅馆就没订，专程碰瓷，也算外交战狼的一种吧。这次外交部门全线压上，胡锡进坚守阵地一步不退，就是网警不配合行动，弄得境外视频满网都是。当然外交部弄得瑞典电视台都播视频，网警也管不了。",
			"date_added": 1537070844
		},
		{
			"post_id": 1537090551,
			"body": "事情正在起变化，著名副局级温和派官五王志安出来等于唱环时和外交的温和反调了，连坚定的工业党自干五天翔宋瑞都发表对那家人的反面看法，在考虑到这次网监不努力，也有近似公知的人骂那家人同时说外交干的对，估计党国两头下注了，两头带节奏的头头估计都是五毛。这个是党国老办法了，传统五毛拌红军，非传统五毛和招安公知拌蓝军，其他人就封了。一有问题，你不论选A还是选B都是五毛给你的选项。",
			"date_added": 1537090477
		},
		{
			"post_id": 1537092007,
			"body": "看看一帮人骂巨婴的，这事跟巨婴一家关系不太大，不过是个引子，最多影响十几个几十个瑞典人的观感，而且他们还都没看全，最多一笑而过，产生这么严重后果，还不是外交部的人对内网上发帖，对外搞抽疯式要求的外交交涉引起的，连最开始的几个巨婴一家拍的视频十有八九也是外交部的人放出的（巨婴一家好像在荷兰疯玩呢），最后瑞典电视台开始放出一堆瑞典人拍的视频，西方媒体也纷纷报道，影响的是十几亿几十亿人的观感。",
			"date_added": 1537091932
		},
		{
			"post_id": 1537278046,
			"body": "怎么说，党员再怎么开明也是扯淡的人。",
			"date_added": 1537277970
		},
		{
			"post_id": 1537278353,
			"body": "前几天去过国博看展览，看了那个焦家遗址的展览，老的房子是半地穴，后期就是地面房屋了。",
			"date_added": 1537278276
		},
		{
			"post_id": 1537604480,
			"body": "说起来那个GK同人于野，几年前吹什么热核聚变效果比理论值还好，给政治局报告了，还有一个月就公布了，他妈的人类搞工业搞科学这么多年了，比理论值好的事情估计一只手都能数过来。",
			"date_added": 1537604402
		},
		{
			"post_id": 1537605131,
			"body": "中国山寨和代工工业基本上是微机和单片机时代起来的，和苏联工业衰落是同一进程。",
			"date_added": 1537605052
		},
		{
			"post_id": 1537675325,
			"body": "说起中国工业，有一个很强的证据佐证，就是户口。\n如果迅速工业化，那就不可能严格限制户口，昨天的农民明天就可能成为工人了，而机器生产机器，再加上高积累，政府努力的工业化，应该每年工业增长一两成，就需要每年增加一两成的工人，根本不可能有严格的户口限制。但是实际情况是，六七十年代户口严格限制，而且让城里人的子女下乡，说明当时工业是倒退的，总不会当时兴建了一批无人工厂吧。\n要说七十年代有些乡镇企业，但是机器很差，其实就是中国工业城市的近代化机器生产不了同等级的机器，只能生产乡镇企业的机器，使用这种机器的工人是不配享受工业城市的近代化生活的。中国的近代化工业基本上就是建国前西方留下的机器和五十年代的俄国机器，老人的常识是上海货好，就是说西方三四十年代的机器比五十年代俄国机器好。\n中国到八十年代后半期开始放松户口制度，说明那时候才又开始工业化，基本上是个接收西方甚至是港台东南亚废旧机器的过程。\n如果中国现在开始将现有的职业固化为户口再加强户口控制，比如给北漂北京户口后加强户口控制，说明中国工业停滞；如果不给新户口直接加强户口控制，比如把北漂赶回家，说明中国工业将大幅倒退。",
			"date_added": 1537675245
		},
		{
			"post_id": 1537676193,
			"body": "还有两件事上条忘了说了：\n一是中共一建国就搞严格的户口制度，说明本来就没想真搞工业化。\n二是六七十年代都把工人子弟送去当农民，说明根本没有啥稍微健全的工业体系，更甭提世界上最完整的工业体系了。",
			"date_added": 1537676112
		},
		{
			"post_id": 1537962651,
			"body": "----------------------------------------------------------------------------------------\n据法新社9月25日报道，在华盛顿开始对2000亿美元中国商品加征关税一天后，中国商务部副部长兼国际贸易谈判副代表王受文说，中国愿意进行谈判，但必须要平等对待、相互尊重。\n\n王受文在新闻发布会上说：“现在美方采取了如此大规模的贸易限制措施，把刀架在别人的脖子上，这种情况下谈判怎么进行？”\n-----------------------------------------------------------------------------------------\n“把刀架在别人的脖子上”就是说川普再一使劲就了结了，不用谈了。",
			"date_added": 1537962569
		},
		{
			"post_id": 1537970151,
			"body": "实际上分裂的春秋比相对统一的西周人口要多得多。甚至两百年的春秋发展的幅度也比四百年的西周要大。",
			"date_added": 1537970068
		},
		{
			"post_id": 1538312802,
			"body": "浙江海宁那个打老人的事情，果然老人是本地人，打人的青年是外地人。劝告人不破坏自己财产这是一般是亲近长辈干的事，关系疏远的一般不愿管这种事，南方小共同体比较强，老人在社区里基本上是共同的长辈，87岁社区里的人一般都是她的晚辈，可能她也认不全，如果外地老太太大概就不会劝了。本地青年碰上长辈劝说，就算不同意也不会反应强烈，而远距离迁徙的年轻人由于丧失了自己原有的共同体，有没有融入当地人的共同体，容易偏离正常反应。",
			"date_added": 1538312718
		},
		{
			"post_id": 1538624122,
			"body": "在旧大陆古代，喜马拉雅山和帕米尔高原是仅次于撒哈拉沙漠的天然障碍物，旧大陆的主要文明里东亚是最隔绝的一个。这造成了中国古代技术经常走在奇怪的道路上，也就是说点错了科技树，也在一定程度上造成了中国的“统一”。",
			"date_added": 1538624037
		},
		{
			"post_id": 1538651282,
			"body": "山妨碍征服也妨碍交流，水却妨碍征服妨碍短途交流方便长途交流。",
			"date_added": 1538651196
		},
		{
			"post_id": 1538668037,
			"body": "其实朱镕基扮演的角色和专门裁员前上台裁员后下野的那种公司高管没啥区别，当然他还负责答应美国人条件，答应完就下了。",
			"date_added": 1538667950
		},
		{
			"post_id": 1538736559,
			"body": "1941年，日本老百姓里面开始觉得不应该扩大战争，后来又觉得只能支持军部要打嬴的人，和招核青年有多大区别。",
			"date_added": 1538736471
		},
		{
			"post_id": 1538745216,
			"body": "中国的偏僻造成了中国的统一和中国的自大，而中国的统一和中国的自大又相互促进，这构成了中国的历史（本来想说古代史）。",
			"date_added": 1538745127
		},
		{
			"post_id": 1538811745,
			"body": "情报和内宣两个业务在现在中国也很常见，比如另一个部门新华社。",
			"date_added": 1538811655
		},
		{
			"post_id": 1538840209,
			"body": "似乎以前谈面包有点问题，最东边的面包是馕，因为最东部的印欧族群是游牧民族，新疆的印欧人游牧性也比较强，甚至波斯人都是游牧性比较强的民族，所以他们的馕比其他面包更需要长时间保存便于携带，馕在汉地的直系后代是烧饼，出于汉族喜欢点奇怪科技树的习惯，汉族人并没有将烧饼变成松软型，而是升级了以前不发酵的蒸面团升级为发酵松软型的馒头。",
			"date_added": 1538840118
		},
		{
			"post_id": 1539266099,
			"body": "似乎世界上大部分国家都是几千万人的。",
			"date_added": 1539266007
		},
		{
			"post_id": 1539267155,
			"body": "两个超过十亿人的国家都是旧世界比较偏避的文明的主要部分。",
			"date_added": 1539267062
		},
		{
			"post_id": 1539355777,
			"body": "偏僻的文明相对容易统一，而比较中心的的地方从欧洲北非一直到波斯，除非都占领了，不然很难建立一个边界比较稳定的大帝国，但是那是不可能的。做的最好的是罗马帝国，占领了整个地中海世界，但和日耳曼人在莱茵河拉锯，在两河流域和波斯拉锯。罗马人都知道罗马帝国没有控制整个世界，而中国人却以为自己是整个天下。",
			"date_added": 1539355683
		},
		{
			"post_id": 1539489437,
			"body": "新疆就是共产党给当地汉人埋雷，以此手段将他们绑在自己的战车上，不过当地汉人最好的解决方案不是逃到内地吗？其实整个中国的治理方式也是埋雷，最后宣称共产党在糟，不在更糟，当然埋雷以后会这样，但是共产党在一天就会多埋一天的雷。",
			"date_added": 1539489342
		},
		{
			"post_id": 1539700150,
			"body": "实际上没有任何考古证据证明商朝起于东夷，所有证据都说明商人起于古代的漳河流域，在河内地区，虽然位置偏东，但是山东丘陵地区的文化成分很低，根据古书几句话就认定商人属于东夷明显是错了。",
			"date_added": 1539700054
		},
		{
			"post_id": 1539791011,
			"body": "今天看了篇文章，说商起源于东夷是常识，这几十年在商丘打了无数个洞，来找先商文化和商中期都城，结果找到一个东周的城，还有岳石文化和龙山文化的遗址，就是没有先商和商朝都城，结论是找的还不够细，要继续找。你说接受现实不迷信古书和近现代拿古书搞推理的大师就那么难吗？从现在考古来看商丘一直远离商朝统治中心地区，而且那时候中原人生活方式都偏爱比较地势高的地方，商丘也不符合。",
			"date_added": 1539790914
		},
		{
			"post_id": 1539869636,
			"body": "今天忽然想到，中国古代的农业形式也许和大豆有关。大豆可以提供大量比较优质的植物蛋白，部分替代肉蛋奶，所以中国减少了畜牧业，减少牧地，增加了耕地，增加了人口，增加了人口密度，小农也更贫困化，而且肉蛋奶里面受冲击最大的是奶类，造成的乳糖不耐受。",
			"date_added": 1539869538
		},
		{
			"post_id": 1539870431,
			"body": "说起中共埋雷，其实也给美国埋雷。这种埋雷就是赌对方惰性，得过且过，为了短期放弃长期。当然给美国人埋雷的也不止中共一家，但是埋这么勤快就一家。",
			"date_added": 1539870332
		},
		{
			"post_id": 1539962640,
			"body": "智人刚到东亚大陆时土地根本不是问题，到几千年前农业刚开始出现时，土地也不是问题。直到龙山后期人口最密集的时候，那时农业在中国已经出现几千年了，在最密集的地区，也是五公里十公里才有一个小居民点，就是一个小村子，周围会有几十平方公里土地。在这之后是人口减少的时期，大概在西周才恢复到龙山后期水平。\n另外一个地方人口自然增加，必然说明当地资源在当时生产水平下要超过人类生存的需求。如果人口减少也不能说明资源不足，因为很可能是战乱和瘟疫引起的。\n中国古代的人口，更早不好考证，大概汉唐鼎盛时期，一千万户五六千万人口，南北宋大概上亿人，晚明大概两亿人，清朝中期四亿人。另外怎么说呢，肯定是越到后来底层农民生存质量越差，因为引入了低质量的替代，比如用豆制品替代肉类，用红薯替代谷物。你最熟悉的古代社会肯定是最晚近的。\n谷物可以提供人类所需的热量，大概一半蛋白质，但这些蛋白质质量不太好，部分维生素，一般蔬菜提过极少的热量，很多纤维素，不少维生素。如果成人没有摄入肉蛋奶及豆类，只靠谷物和普通的蔬菜过活，肯定会因蛋白质摄入不足而营养不良，可能会浮肿，多数还不太致命，但是对于长身体儿童来说，谷物中的蛋白质是无法满足身体需求，是致命的。大概补足蛋白质摄入量只需一日半两大豆或肉类，如果仅仅需要保证生存可能只要一两钱。如果既不要牲畜也不要大豆，就不会有人存活下来了。附带说一下，人口密集的印度蛋白质靠的是牛奶，这是印度人崇拜牛的深层次原因。\n大豆自古是五谷之一，种植面积不会太少。至于菜肴，有种豆制品叫豆腐，可能绝大多数中国人都听说过吧。\n冬天牛在中原不必担心，因为它们在更北方的蒙古高原都被游牧民养殖。",
			"date_added": 1539962540
		},
		{
			"post_id": 1540130527,
			"body": "中国通过操纵汇率免除了汇率操纵国的名号。",
			"date_added": 1540130426
		},
		{
			"post_id": 1540738596,
			"body": "原始的儒家几乎是东亚这片偏僻的土地上自己产生的最有价值的思想了，发展到最后也变成了专制暴君的跟班，但也是唯一能稍微制约一下专制暴君的东西了，儒家里面那些反对专制暴君的残余成分，也是中国人对于国学最痛恨的地方，无论西学国学，中国人最喜欢的就是专制暴君可用的部分，最讨厌的是反对专制暴君的部分，似乎越到后来越如此。",
			"date_added": 1540738494
		},
		{
			"post_id": 1540908388,
			"body": "其实金庸成名和49年以后海峡两岸一起封杀武侠小说有关，恰巧那些写武侠的在大陆和台湾。以金庸的作为来说比很多国人强，但大侠称不上。",
			"date_added": 1540908285
		},
		{
			"post_id": 1541086009,
			"body": "实际上很多报复社会的人并不是底层，而是刁民，底层基本上是顺民，中国自古以来各个朝廷多多少少都执行对刁民有利的政策来瓦解基层共同体，以共产党最为成功。刁民在利益受损的时候，因为好处是党给的，不敢对党发泄，于是杀比自己穷的人。底层的顺民一无所有，死了也悄无声息。\n当然共党也是不是的出台政策削弱刁民，比如文革黑五类中的坏就是主要针对刁民，毕竟刁民比顺民多就要翻天了。",
			"date_added": 1541085905
		},
		{
			"post_id": 1541171039,
			"body": "一般来说，欧亚大陆古时候，西边相对喜欢肉搏，东边喜欢火力投射。直到清末，英国人虽然在火器上占优，但仍经常需要刺刀冲锋才能击溃清军。\n实际上一战绞肉机战法也说明当时除了机枪，其他投射武器仍无法完全阻止白刃的敌人。这也是祖鲁人交换比比清军好看的原因。\n不过当时的中国人甚至现代的中国人不知道这个，还在yy西方打胜仗是靠投射火力强，编造了冯婉贞之类的故事。\n到抗战初期，看到姜克实翻译的日军记录，仍是八路军大部队包围日军后远程发挥火力，直到日军一个分队或一个小队刺刀冲锋将八路军赶出阵地。日军因为学习西方而重视刺刀。\n直到三年内战和朝鲜战争时期，共军的刺刀才使得比较好，还附带那种小部队穿插等几个让人想起二战时日军的战术。",
			"date_added": 1541170934
		},
		{
			"post_id": 1541212486,
			"body": "一般来说，对金庸的评价取决于开始看金庸的年龄，这是我在大学时候发现的，我是大学时看的，虽然一口气看了好几本，但是评价没有高中看的同学高，高中看的同学评价没有初中看的高。",
			"date_added": 1541212380
		},
		{
			"post_id": 1541218142,
			"body": "中国现在主流就是刁民和顺民，在小共同体内能为他人担当的人都是政权首要的打击目标，已经灭绝的差不多了。连合作社或者人民公社里面会努力干活的老实人，基本上都在建国后历次饥荒饿死了（建国前历次饥荒饿死各类型人是均等的，甚至老实人会饿死少一些，因为他们粮食会多一些，建国后因为共产了会优先饿死老实人，因为他们劳动量大，消耗大）。",
			"date_added": 1541218035
		},
		{
			"post_id": 1541428039,
			"body": "共产主义其实是普鲁士总参谋部的儿子而不是第二国际的，普鲁士总参谋部展示了一种可能性：一个庞大机关掌控很多细节。",
			"date_added": 1541427931
		},
		{
			"post_id": 1541430294,
			"body": "苏联解体后，证明这种可能性是虚假的。至于中国鼓捣的那玩意儿，谁知道是啥，大概是克苏鲁体系的一部分。",
			"date_added": 1541430185
		},
		{
			"post_id": 1541515584,
			"body": "中国喜欢用高楼评价发展水平，有其历史原因。中国古代老百姓基本上是平房，有钱人才住楼，很有钱才能住高楼。而西方自罗马帝国就是底层住高层公寓，富人住平房和低层小楼。",
			"date_added": 1541515474
		},
		{
			"post_id": 1541600622,
			"body": "最近考古公众号都没啥很有意思的东西，稍微有点意思的是在新疆发掘了个城址，从唐朝到高昌回鹘到蒙元，估计是唐朝的一个县城，沿用下来，其中有个澡堂，从唐朝用到高昌回鹘，罗马风格的。",
			"date_added": 1541600511
		},
		{
			"post_id": 1541688108,
			"body": "中国自古以来，似乎上层都偏爱外国的东西，让老百姓用土产的。",
			"date_added": 1541687996
		},
		{
			"post_id": 1541777180,
			"body": "鸦片战争前，道光把林则徐发到广州禁烟，琦善还跟林则徐说只要不卖茶叶大黄英国就要完蛋。然后林则徐就兴冲冲的去了，战争一爆发，林则徐就被发出去了，琦善接任，然后琦善割让香港把事情了了。考虑到清朝朝廷对英国一直很关注，甚至是惧怕，很可能是道光和琦善把林则徐给耍了，毕竟林则徐是汉人。",
			"date_added": 1541777067
		},
		{
			"post_id": 1542034548,
			"body": "似乎中国古代经济中心转移到南方以后，北方维持庞大的人口就很困难，维持北方上层的地位更困难，所以北方唯一的希望是当政治中心，从南方搞到资源和特权养活北方，如果做不到，北方很容易放弃民族属性，引外族进来统治，把首都放在北方。",
			"date_added": 1542034434
		},
		{
			"post_id": 1542037282,
			"body": "因为这几天看了《坂上之云》，就又找了找秋山家两兄弟的东西，结果找到了戴季陶的《日本论》里面的《秋山真之》。看完了想起了莱蒙托夫《当代英雄》里面的《宿命论者》。",
			"date_added": 1542037167
		},
		{
			"post_id": 1542293985,
			"body": "清朝中前期统治的一个方法就是对传教士的垄断，让传教士学满语，不学汉语，住在宫中，屠杀汉族天主教徒，尤其是钦天监的。由于耶稣会不配合，所以被清洗，只允许配合的法国宫廷派来的传教士，直到乾隆末期的法国大革命。\n这种方法现代也有使用，比如金正恩就在外国留学。\n根据观察，很可能中共也会用这种祖传的统治技术，毕竟二代三代不少留学生，而对民众的对位交流正在慢慢封锁。",
			"date_added": 1542293869
		},
		{
			"post_id": 1542296528,
			"body": "马噶尔尼使团来华是在法国大革命刚发生时，似乎很早就有人提出乾隆的拒绝态度可能和法国大革命有关，所谓下跪的纠纷可能是清廷有意为之。据记载，福康安了解西方脱帽礼，却拒绝了观看英国新式步枪的演示，可能是有尽量减少和英国接触的整体方针。据有些人查资料，好像乾隆在拒绝英国通商要求之后，下令加强全国防御，减少对英国的关税，要求不得敲诈英国商人，显得很惧怕英国。\n从使团的记载来看，乾隆身边有一批对外国比较熟悉的核心团队，他们中不少人名字现代人也很熟悉：和绅和福康安就是，显然都是满人，可能工作语言是满语，这样可以使外国的信息对汉人和普通满人保密。\n可以猜测，清廷这个核心团队可能很早就建立了，而能够接班的皇子往往和这个团队关系密切。\n在马噶尔尼使团之后，因为波旁王朝的覆灭和清朝封锁的加强，信息获取渠道减少，清廷的信息越来越陈旧，而且和绅的覆灭很可能影响了这个团队。\n但是道光在鸦片战争前后的奇怪行为可能就是一个退化了的核心团队仍在道光身边发挥作用，他们对于英国的强大将信将疑，需要试验，因为实验很危险，他们派出了不知情的汉人大臣林则徐进行双盲实验。\n道光之后咸丰的疯狂举动和恭亲王对于外交的熟悉，很可能是因为团队被恭亲王继承了。\n到慈禧清洗恭亲王之后，这个团队彻底覆灭。",
			"date_added": 1542296411
		},
		{
			"post_id": 1542637757,
			"body": "忽然想起按照中华民国和中华人民共和国简称中国这个逻辑，大韩民国就要简称大国了。",
			"date_added": 1542637639
		},
		{
			"post_id": 1542638457,
			"body": "中国这个称呼大概也是对中国人的麻醉之一吧，假装中国在世界上拥有特殊地位。",
			"date_added": 1542638338
		},
		{
			"post_id": 1542899621,
			"body": "现在才想到，日俄战争日本真疯狂。海战和陆战，只要有一个输了，日本都会输战争了。尤其是陆上不管输赢还是平，如果海军输了，日本陆军基本都会覆灭。\n另外，八甲田山事件说明日本陆军在低温积雪的条件下作战能力很差，如果俄军能在冬季最冷的时候全力决战，应该能击败日军。\n结果日俄战争俄国输了，只能说明日本走了狗屎运，俄国上层烂透了，但是日本把国运押在这个上也是疯了。",
			"date_added": 1542899501
		},
		{
			"post_id": 1543069580,
			"body": "这次撞小学生的应该就是刁民。顺民陷入绝境一般就是饿死了事，脾气大一点就自杀，极少杀人，敢杀人就不是顺民了。而且一般只有顺民才会陷入绝境，因为在现行体制下刁民比顺民有优势。当然刁民标准比较高，当吃亏了，或者觉得自己吃亏了，就要玩命，但是不敢对官，自然优先幼儿园。这次那个村支书的儿子大概就是这样。村支书基本上是比较得势的刁民，有遗传。",
			"date_added": 1543069459
		},
		{
			"post_id": 1544277803,
			"body": "好多连不上了。",
			"date_added": 1544277681
		},
		{
			"post_id": 1544334497,
			"body": "为啥这次自干五会辟谣那个12月1日连环阴谋论？为啥不继续装可怜？因为小粉红为代表的编户齐民并没有是非观，也没有立场，只崇拜强权，不然也不会崇拜共党。如果他们真的相信这些阴谋论，他们就会像当年弃父母而管习叫大大一样，弃习管川叫大大。",
			"date_added": 1544334374
		},
		{
			"post_id": 1545752220,
			"body": "看到有篇文章提到，直到清末洋务运动，清廷都要求官办外文学校里学习外文的学生里面旗人要占绝大多数，有的甚至不招汉民，部分命令是恭亲王直接下令。\n这就是满清的秘传心法。",
			"date_added": 1545752096
		},
		{
			"post_id": 1546747169,
			"body": "说实话，“白专”基本上是49年以后培养的，拥有大量给共党舔屁眼技能和热情的人，他们被用来替代他们的老师那批49年留下来的亲共教授。不过共党并不满足，在培养出来下一批“红专”以后，就把“白专”打倒了，本来还需要“红不专”来打倒“红专”，可惜“白专”“红专”的专业技能太差，社会都转不下去了，最后连亲共教授都平反了，甚至不亲共的教授也要收买为其所用。\n根据历史，早晚要重来一遍，留学回来的粉红海豚大概也就是亲共教授的待遇。",
			"date_added": 1546747044
		},
		{
			"post_id": 1546870107,
			"body": "华为很可能没有多少自主技术，不然不会开了老员工，还招新员工。我不信资料管理和代码管理能够让新员工发挥出老员工的作用，除非是不需要经验的重复劳动。中国程序员普遍年轻也是因为不需要太多经验，只需要重复劳动加班。",
			"date_added": 1546869981
		},
		{
			"post_id": 1546870744,
			"body": "中国人老龄化最可怕的一点是中国大部分工作都是各种青春饭。",
			"date_added": 1546870617
		},
		{
			"post_id": 1546959562,
			"body": "刁民的事，再说一点，就是不是官府说是刁民就是刁民。比如带一个村闹事的一般都不是刁民，一个村一起闹事的，刁民比例也不会高。一个人玩碰瓷的，基本刁民没跑了。刁民都是借助官府或者法律，来敲诈顺民的，比如《水浒传》里的牛二，官府反对他，却也拿他没办法，只要他不闹出人命不怕被打板子他就借着法律所向无敌，直到杨志罔顾国法把他杀了。\n从具体事例来说，官府可能反对刁民，但从整体上来看刁民是官府培养出来的，一部分是副产品，一部分是有意的。副产品就是在彻底消灭了那种可能带头闹事的人之后，瓦解社会基层共同体，社会就自然会产生刁民。有意是刁民比例增加有助于进一步瓦解社会基层共同体，使不完全的顺民更加不易参加群体性事件，成为完全的顺民。",
			"date_added": 1546959434
		},
		{
			"post_id": 1547567672,
			"body": "现代典型的民族国家都是几千万人口的，在一两百年前形成时人口要少一些，但也有一两千万人口。人口更多的往往是多民族的帝国，更少的是民族国家夹缝中的缓冲国。",
			"date_added": 1547567543
		},
		{
			"post_id": 1547649711,
			"body": "中共搞那么多互联网+，一定程度上是增强中央集权。比如出租车，中央几乎无法参与捞钱，但嘀嘀打车却必然给中央分钱，地方却很难参与分成。",
			"date_added": 1547649581
		},
		{
			"post_id": 1547967489,
			"body": "中国大概是恨官员之外所有国民的“爱国者”比例最高的国家。当然好消息是他们大部分也痛恨所有外国人。有的人不承认，但从行为模式看明显也是这样的人。毕竟在这国爱国又爱民的小清新生存要困难得多。",
			"date_added": 1547967358
		},
		{
			"post_id": 1548345618,
			"body": "美国作为一个资本家掌握的国家，基本上对各种独裁者很少采取实际措施，只是讨一点口头民主便宜。不过美国毕竟世界第一大国，又常口头鼓吹民主，就成为各路独裁者碰民族主义瓷的对象，不过总是有人掌握不好限度碰瓷碰的过了，最后混丢了脑袋。",
			"date_added": 1548345486
		},
		{
			"post_id": 1548516872,
			"body": "bing的事就是中共一贯的做法，小动作不断，非常牛二。而且说明微软不断自我阉割也不可能达到要求。",
			"date_added": 1548516739
		},
		{
			"post_id": 1548517545,
			"body": "原来户口制度是58年建立的，正是中苏论战的前夜。我以前说过，中国现行的户口制度就是为了妨碍工业化而建立的，而中共是喜欢烟囱林立的工业化的，所以如果实行户口制度，只能说明中共认为无力工业化，只能尽量把人口圈禁在农村，免得城市有大量失业人口。58年的户口制度正是为了和苏联分裂，工业化停止并倒退而预先准备的。中国近年工业化城镇化水平很高，却保留户口制度，正是预期未来将去工业化。",
			"date_added": 1548517411
		},
		{
			"post_id": 1550587351,
			"body": "没节点了，还打不开端口。",
			"date_added": 1550587216
		},
		{
			"post_id": 1550932232,
			"body": "哈哈哈，没想到这帮玩游戏的不止爱中国，还爱中共，不止爱中共，还爱习，不止爱习，还爱江。不过如果哪天江被打倒，因为爱江言论都被连坐咋办？",
			"date_added": 1550932096
		},
		{
			"post_id": 1551006468,
			"body": "说实话，那游戏最经典的就是那张符了，没想到效果这么好。需要以这个故事做一个恐怖游戏了。附带看到有人说，20日上线，21日那张符被改，正版游戏会自动升级，所以21日以后正版用户见不到那张符，显然是盗版用户见到了那张符。",
			"date_added": 1551006331
		},
		{
			"post_id": 1551363243,
			"body": "委内瑞拉的事，我看了那么多文章，似乎只有秦晖说的靠点谱。",
			"date_added": 1551363105
		},
		{
			"post_id": 1551364557,
			"body": "委内瑞拉是产油国，什么福利那点开支算什么？美国又没有大的制裁，委内瑞拉卖油从来没有阻碍。委内瑞拉最大的问题是有油出不来。",
			"date_added": 1551364418
		},
		{
			"post_id": 1551618060,
			"body": "感觉hub连不上了。",
			"date_added": 1551617920
		},
		{
			"post_id": 1551622329,
			"body": "突然连上hub了，就继续说委内瑞拉，有人说委内瑞拉油质差，难打，采油亏钱，其实如果真亏钱早就停产了，而且几十年都不亏钱，查韦斯一上台就亏钱，呵呵。\n委内瑞拉油质比较重是真的，但中国油质也差，平均起来比委内瑞拉还差，委内瑞拉采油是比较困难，但也比中国强，中国到处都是油井，基本都赚钱。\n采油成本最高基本上就是墨西哥湾，平均七十刀，所以油价一降就停工，最低是中东产油国，往往几刀，怎么也不会停工，中国十几二十刀到五六十刀都有，油价降的时候停工很厉害。委内瑞拉平均应该比中国低一些，毕竟油层很厚，井很好打，就是深度比中东深。",
			"date_added": 1551622188
		},
		{
			"post_id": 1551622675,
			"body": "有个人跟我说，委内瑞拉一口井产量顶中国一个区块，中东一口井顶中国一个油田。",
			"date_added": 1551622533
		},
		{
			"post_id": 1551709754,
			"body": "委内瑞拉现在的问题源于查韦斯的立场民族主义和社会主义，在拉美这就等同于反美，委内瑞拉又是产油国，而石油技术几乎都是美国开发出的，较先进的技术都掌握在美国手里，同时石油工人因为技术原因难免亲美，当然石油工人收入较高，也容易成为革命对象。",
			"date_added": 1551709611
		},
		{
			"post_id": 1552059545,
			"body": "刚刚连上hub。",
			"date_added": 1552059401
		},
		{
			"post_id": 1552061526,
			"body": "好像还是发不出去。",
			"date_added": 1552061381
		},
		{
			"post_id": 1552098123,
			"body": "感觉弄不好3月底就25%的贸易战了。最近东方时空的委内瑞拉节目应该是预先准备，暗示通胀百分之一万不影响人民生活。",
			"date_added": 1552097977
		},
		{
			"post_id": 1552098216,
			"body": "又内容发布失败了。",
			"date_added": 1552098069
		},
		{
			"post_id": 1552574948,
			"body": "说起维权，我想起一件事，当年一个朋友参加一个小区业主对房地产开发商的维权行动，曾乐观地对我说，小区业主有很多有背景的，有的本身就是开发商，还有开发商的老婆及开发商的二奶。然后维权失败了。\n在中国，即使你有侵犯别人某项权利的能力，你也无法保证自己同一权利不受侵犯。",
			"date_added": 1552574800
		},
		{
			"post_id": 1552801307,
			"body": "唐朝时吐蕃的强大可能是因为当时吐蕃是羌人的共主。后来西夏强大应该也是同一原因。",
			"date_added": 1552801158
		},
		{
			"post_id": 1552808926,
			"body": "如果算广义羌人，早期的周朝应该是，周朝可能就是作为羌人的共主压制商人和东夷。但周朝建立后就不断拉拢商人，并将不少姜姓国家分封到东部，自己脱离了羌人以后也使羌人一段时间没有共主。当时的戎狄不少和华夏诸国同姓，似乎语言也相通，可能不是北亚血统而是羌人。姜姓的申国又被叫做申戎，因为女儿被废后而杀死了周幽王。秦可能也吸纳了羌人力量。到汉朝双方基本上没有认同了，汉人成为了汉藏语系汉语族，当时的羌人成为了汉藏语系藏缅语族诸民族祖先。",
			"date_added": 1552808776
		},
		{
			"post_id": 1552809934,
			"body": "根据藏缅语族的树状图，最先分化的支系是包括萨尔语群在内的很多语言，主要分布在印度东部缅甸北部和云南边界，景颇族几乎就是最靠近中原的了。显然这一族群应该是汉朝到唐朝之间被排挤经过横断山脉在向西进入喜马拉雅山南麓的。",
			"date_added": 1552809783
		},
		{
			"post_id": 1552810376,
			"body": "剩下的支系又分为两支，一支包括藏族和一些喜马拉雅山附近的民族，另一支包括缅族及中国境内其他羌系民族。显然这一分化的来源是吐蕃王朝的建立，在吐蕃境内的羌人就是藏系各民族的祖先，不在就是其他支系，当时这些支系虽然分布广泛但还联系紧密。",
			"date_added": 1552810224
		},
		{
			"post_id": 1552811591,
			"body": "剩下的部分有三个关系清楚的语支：缅语支，包括缅族和一些其他缅甸中国的民族部落；彝语支，包括彝族和纳西族等小民族；羌语支，包括羌族普米族等，还有唐古特就是西夏。三者的关系是缅语支和彝语支关系比较紧密，在外国算作同一语支，两者聚合后在和羌语支聚合。\n西夏可以作为一个时间节点，显然在这之前，彝缅系和羌系已经分离，可能彝缅系和南诏政权有继承关系。\n在西夏灭亡后不久，羌系民族就在西北几乎绝迹。可能有不少融入汉族和北方游牧民族，另外似乎西北养羊区回族比例高，可能也是一个重要去向。",
			"date_added": 1552811438
		},
		{
			"post_id": 1552813451,
			"body": "真正有意思的是：\n一，在唐朝，存在一个北起陕北，南到缅北翻越无数大山的大网络，语言尚未分化。\n二，在汉朝，羌人最多进入四川西部，而到九世纪缅族人就控制了伊洛瓦底江流域。\n三，似乎没有建立大的政权时人群很少会分化，一旦建立政权，往往直接控制区和非直接控制区的同族就分化成两个支系。",
			"date_added": 1552813297
		},
		{
			"post_id": 1552917853,
			"body": "zeroboard打不开了。",
			"date_added": 1552917698
		},
		{
			"post_id": 1553005813,
			"body": "kaffiehub最近经常没有节点。",
			"date_added": 1553005657
		},
		{
			"post_id": 1553182673,
			"body": "今天是春分，按照西方，就是东亚以外欧亚大陆的文化，这是冬春的分界线，但是按照东亚的文化，这是春天的中心点。\n类似的东西还有几个，比如中国古代时辰，地支子对应的时间点是半夜0时，12地支对应时辰每个2小时，所以子时对应前一天夜里23点到后一天夜里凌晨1点。\n中国象棋和国际象棋同源，中国象棋的棋子摆在交叉点，而国际象棋棋子摆在格子中间。其他同源的中东和印度等地的象棋棋子也摆在格子中间。\n感觉比较特异的点，东亚更倾向于当作中心点，西方（包括中东和印度）更倾向于当作分界。",
			"date_added": 1553182516
		},
		{
			"post_id": 1553412939,
			"body": "五一国内游价格各种飞涨。",
			"date_added": 1553412781
		},
		{
			"post_id": 1553413403,
			"body": "看来中产还有好多剩余钱好榨。",
			"date_added": 1553413244
		},
		{
			"post_id": 1553413853,
			"body": "盐城那事，就是中国高效率的证明，节省安全部分，啥都敢大干快上，当然效率高。",
			"date_added": 1553413693
		},
		{
			"post_id": 1553418731,
			"body": "当然这都不是最节省最高效的地方，最高效的是节省了你的孩子后又节省了你得养老金。反正这不是第一波，90年代末就节省了一波了。",
			"date_added": 1553418570
		},
		{
			"post_id": 1553424347,
			"body": "很多中国人有一项传统艺能，就是根据宣传部的宣传更改自己的记忆。",
			"date_added": 1553424185
		},
		{
			"post_id": 1553783585,
			"body": "共党确实会维稳，失独老人还没上访，就知道早晚会成黑恶势力。哪天要裁员公务员估计会直接拉出去枪毙吧。",
			"date_added": 1553783422
		},
		{
			"post_id": 1553783612,
			"body": "共党确实会维稳，失独老人还没上访，就知道早晚会成黑恶势力。哪天要裁员公务员估计会直接拉出去枪毙吧。",
			"date_added": 1553783448
		},
		{
			"post_id": 1553921995,
			"body": "还有件事，就是有人说某人比某人好，某人只要钱，某人不仅要钱还要命。这是错误的，一般来说，如果有权既要钱又要命，那么理性的选择当然是既要钱又要命，要是只要钱不要命，那么要不然是没有要命权，要么是非理性，一般来说大的团体都是理性的。当然对于旺盛产奶的奶牛和旺盛产蛋的蛋鸡来说，饲料还是供应的，但是一旦产蛋产奶量下降到不经济，或者蛋价奶价下降到不经济，就会宰杀奶牛和蛋鸡，过程是先杀后要肉，就是先要命后要钱。",
			"date_added": 1553921830
		},
		{
			"post_id": 1554130306,
			"body": "继续说藏缅语族。前几天没有节点停下来了。",
			"date_added": 1554130140
		},
		{
			"post_id": 1554133269,
			"body": "看到一篇论文，分析藏缅语同源词，把古汉语也加入对比。然后估算了分离时间。古汉语与藏缅语分离在2500-3000年之间，景颇和其他藏缅在1400-2000之间，然后藏语与其余部分在1500-1700之间，然后就是羌和彝缅两支，之间差距1200年，内部差距大部分几百年，少数一千出头。",
			"date_added": 1554133102
		},
		{
			"post_id": 1554134006,
			"body": "这个年代和我之前估计的历史时期比较接近。\n不过还有个问题，就是我以前认为商周说同一种或者很接近的语言，才能保持文字一致，周人如果说原始羌语，那么商人也只能是说原始羌语了，那么商人只能是西来。",
			"date_added": 1554133838
		},
		{
			"post_id": 1554218140,
			"body": "缅族虽然是藏缅语族，但是血统更接近于孟族，缅族血统大部分来自于被缅族统治同化的孟族。",
			"date_added": 1554217971
		},
		{
			"post_id": 1554219125,
			"body": "也可能原始汉藏是包括东夷在内的龙山文化通用语言。",
			"date_added": 1554218955
		},
		{
			"post_id": 1554220578,
			"body": "“弃法律，逐功臣，杀太子，以妾为妻，则火不炎上。”",
			"date_added": 1554220407
		},
		{
			"post_id": 1554436873,
			"body": "美学不需要教育，对好东西的喜好是天生的，就像对美食的喜好，对丑的喜好才需要训练。",
			"date_added": 1554436701
		},
		{
			"post_id": 1554626497,
			"body": "关于做题家，其实不止做题，搞什么都是，就是一样东西，你往往需要某个指标做验收，那么按照这个指标必然有个成本最低指标最高的最优方案，能够自动找到这个方案并执行的就是做题家。",
			"date_added": 1554626324
		},
		{
			"post_id": 1554821908,
			"body": "现在中国各种妖人越来越多了，原来的不少公知岁静婊理客中不少都跳自干五了，大概是分给马屁精的利益越来越大，而其他空间原来越小。",
			"date_added": 1554821734
		},
		{
			"post_id": 1555080353,
			"body": "看了一篇文章，迷信的人更愿意寻找模式，更容易在没有模式的地方寻找出模式，好像我就是比较迷信的。",
			"date_added": 1555080178
		},
		{
			"post_id": 1555165042,
			"body": "阿桑奇和斯诺登都是赤匪。",
			"date_added": 1555164866
		},
		{
			"post_id": 1555218832,
			"body": "996比正常上班就多不到六成工作时间，减少非工作时间的二成左右，减少通勤之外的非工作时间约四分之一，减少非睡眠和通勤之外的业余时间约三分之二，如果考虑到家庭生活必然支出时间，就是可以用来学习提高自己或者增广人脉的全部时间。\n考虑到996会降低工作效率，所以996对工作量增加将不足五成，即使不支付加班工资利益也不会太大，老板们推行996主要目的是便于控制员工，使其不能提高自己并脱离正常的社会生活。\n共产党允许并暗中鼓励996的主要目的也是如此。",
			"date_added": 1555218655
		},
		{
			"post_id": 1555831358,
			"body": "东亚文化圈几乎只有汉族是汉藏语系的，其他汉藏语系民族都是藏缅语族，似乎大多是对汉族生活方式有抵触的民族。",
			"date_added": 1555831180
		},
		{
			"post_id": 1555852579,
			"body": "才发现，三十年前的今天学潮已经起来了。",
			"date_added": 1555852400
		},
		{
			"post_id": 1555943727,
			"body": "我记得当年是四二六社论以后闹大的，二十七号大游行。",
			"date_added": 1555943547
		},
		{
			"post_id": 1555944281,
			"body": "看了《夏商新考》，那里边提出来商朝时间比历史书里短一些，就是在殷墟，洹北时间比通常认为的长一些。",
			"date_added": 1555944100
		},
		{
			"post_id": 1555946020,
			"body": "附带说一下，就是洹河的洹，发音是huan，甲骨文就是左边一个水旁，右边是内卷的曲线。洹河就是安阳河，自西向东流过殷墟，在后期洹南宫殿区附近时，先向北流，然后向东，然后向南，正好三面包住宫殿区。所以洹字肯定有环绕的意思，那么读音就很有意思了。我下了一个讲圆词族的论文，还没看。",
			"date_added": 1555945838
		},
		{
			"post_id": 1556026906,
			"body": "英文维基百科上不去了，听说法文也上不去了。日文很早就上不去了，中文更早。",
			"date_added": 1556026723
		},
		{
			"post_id": 1556031362,
			"body": "那个《如何把鹤岗房产卖给外国人》真的很愚蠢，透着一股新闻联播味。如果这能成功，新闻联播在世界上的收视率不得百分之九十？",
			"date_added": 1556031178
		},
		{
			"post_id": 1556034027,
			"body": "华为的月亮模式告诉你什么是做题家。",
			"date_added": 1556033842
		},
		{
			"post_id": 1556290566,
			"body": "节点很少，估计发不出去。",
			"date_added": 1556290380
		},
		{
			"post_id": 1556291176,
			"body": "今天看了张梦翰严实潘悟云金力发的论文的一些介绍，下了图。对这篇的观点，有些赞同，有些怀疑。北方起源大概是对的，但是分化的时间太早了。汉语分化出来快六千年，藏语及相关小语言快四千年，这也太久了，打个七至五折还差不多。",
			"date_added": 1556290989
		},
		{
			"post_id": 1556291463,
			"body": "另外喜马拉雅山南的早期分支都被分在藏彝缅支系之外，而且层层叠叠，这样只能解释为史前三四次翻越喜马拉雅山，肯定不对。",
			"date_added": 1556291275
		},
		{
			"post_id": 1556349117,
			"body": "可能包括山东大汶口都是讲汉藏语的。",
			"date_added": 1556348928
		},
		{
			"post_id": 1556352809,
			"body": "这个论文的意义，其实就是一个步骤脱离了人的主观瞎分析，当然同源词多多少少还是有主观瞎分析的成分。但是对变化率什么的估计比较主观。",
			"date_added": 1556352619
		},
		{
			"post_id": 1556354575,
			"body": "还有些民科很激动，主要是反对汉藏语系的人。当然还有都不懂文章的人，论文中的5900年是汉和藏缅分化时间，不是汉藏产生时间，实际上并没有什么汉藏产生时间。还有人暗示课题组有民族主义倾向，但是当年课题组发证明非洲起源说的时候咋是相反的说法呢？",
			"date_added": 1556354384
		},
		{
			"post_id": 1556354863,
			"body": "良渚当然不会是汉藏语系，良渚那一系的文明在龙山后期就因某种原因突然消失了，只剩下很少的小村子，连续衰败小一千年，然后新兴城市已经和中原更接近。把良渚算七千年中国文明史才是民族主义煽动。",
			"date_added": 1556354671
		},
		{
			"post_id": 1556355608,
			"body": "不过北方起源并不能通过那篇论文证明，毕竟如果说6千年前在四川分化还没发否定，另外什么马家窑庙底沟生套也很扯淡。",
			"date_added": 1556355415
		},
		{
			"post_id": 1556356027,
			"body": "喜马拉雅山以南的假说很容易否定，其一是那样时间需要更久远，其二是山南的语言都是藏缅，可如果一个人群穿过喜马拉雅山或横断山脉，那么山两边就会产生分化，可是最大的分化在汉和藏缅之间。",
			"date_added": 1556355833
		},
		{
			"post_id": 1556357529,
			"body": "看不了论文，看论文的图，论文里算出的原始汉藏居住地最大概率点在四川西南部。那么北方的结论是咋出来的？",
			"date_added": 1556357334
		},
		{
			"post_id": 1557232764,
			"body": "哈哈哈，原来川普又发推特了。\n打贸易战，优势大的一方不是应该把所有的牌一次打出，直接摧垮对手信心以求迅速解决损失最小吗？添油战术都打成持久战了。",
			"date_added": 1557232568
		},
		{
			"post_id": 1557565710,
			"body": "开始点粮食库存了，如果一两个月内粮库狼烟四起，大概就没啥贸易战了。",
			"date_added": 1557565513
		},
		{
			"post_id": 1557577146,
			"body": "民间的奇异风俗还是不少，比如很多人在北京生活工作，父母在村里生活，因为买不起一线房子，为了结婚，就在县城买，然后空着，还买车，老家父母不会开，儿子没有京牌。还听说好多地方农村时兴上私立学校，因为公立太差。",
			"date_added": 1557576948
		},
		{
			"post_id": 1558188482,
			"body": "总算上hub有点节点，不知道能不能发出。\n昨天在网上看了向柏霖的讲座视频，他们也搞了一个跟复旦团队差不多的论文，某些结果不同。",
			"date_added": 1558188283
		},
		{
			"post_id": 1558190096,
			"body": "刚才那条没发出去。\n向柏霖就提到复旦团队论文里有张图，画的分化中心大概率在四川西部，却没有说明。新闻里却说复旦团队的结论是黄河流域，只是因为拿来做参照四川说是9000年前，而复旦推测分离年代是5900年前，更接近北方说。我也看到了那张图，一个没发出去的贴里提到了。",
			"date_added": 1558189896
		},
		{
			"post_id": 1558246964,
			"body": "昨天的都发失败了，主要是没找到hub的节点。\n主要是说复旦团队根据地理分布数据认为汉藏分离地点在四川，根据时间认为分离地点在北方。",
			"date_added": 1558246763
		},
		{
			"post_id": 1558248630,
			"body": "向柏霖的团队也认为汉藏语系是北方起源，分离在7千年前。我觉得北方概率大，不过时间不会那么久，因为语言的同源很可能超过五六千年就很难辨认了。\n喜马拉雅山以南起源必须穿越喜马拉雅山和横断山脉的次数太多。四川西部起源，就会有大量和汉语接近的语言分布在四川，喜马拉雅山西南会有分离最早的语言。",
			"date_added": 1558248428
		},
		{
			"post_id": 1558280395,
			"body": "如果一个国家编程的靠开源代码，搞电子的靠抄板，搞机械靠测绘，那还有啥研发力量？",
			"date_added": 1558280192
		},
		{
			"post_id": 1558280603,
			"body": "华为的芯片就不用指望了，高技术研发是需要工作经验的，不是25岁的人996一下就能出来的，可华为35岁以上就赶到非洲去了，说明华为也不指望能自己真正的研发什么。",
			"date_added": 1558280399
		},
		{
			"post_id": 1558360959,
			"body": "习近平真喜欢开国际大会，估计北京今年交通管制不会停了，各种普通人没听说过国名的国家领导人天天往北京跑。明年把币都撒完，加上贸易战的后果，估计就没啥会好开了。",
			"date_added": 1558360754
		},
		{
			"post_id": 1558361644,
			"body": "为啥腾讯翻拍的韩剧剧名不是《相约八九》？",
			"date_added": 1558361438
		},
		{
			"post_id": 1558361833,
			"body": "三十年前的今天是不是戒严令发布了？我记得一本日记记载，当时广场上人越来越少，人已经疲惫了，突然发布戒严令，造成群情激愤，人多了起来。",
			"date_added": 1558361626
		},
		{
			"post_id": 1558450271,
			"body": "任正非自己好话说尽，下面一层都是表忠心打鸡血吹牛皮，竟然能够让某些人以为任正非冷静客观不煽动情绪。嘿嘿嘿。",
			"date_added": 1558450063
		},
		{
			"post_id": 1558797924,
			"body": "我以为中共会用降低民生来应对贸易战，没想到中共会用伪科学上阵，服了。",
			"date_added": 1558797715
		},
		{
			"post_id": 1559134429,
			"body": "中国已经把贸易战算长征了，看看长征活下来百分之多少，也许能让世界上开开眼，见识一下死亡上亿的单次饥荒，或者上十亿。",
			"date_added": 1559134219
		},
		{
			"post_id": 1559141843,
			"body": "华为可以算是温和派中国人的鉴定神器了吧，平常不满中共的公知大部分都支持华为，还称华为为私企。",
			"date_added": 1559141632
		},
		{
			"post_id": 1559651239,
			"body": "那么严的盘查，大概很害怕吧。",
			"date_added": 1559651027
		},
		{
			"post_id": 1560065085,
			"body": "六四发生在北京，发生在八八年大涨价之后，参加者很大比例是大学生。而当时的大学生不仅不需要交学费，还能从学校拿到补助，而大学生毕业后一般分配工作，大部分成为拿固定工资的干部。在大涨价发生时，他们利益受损很大，支持他们的主要就是拿固定工资的干部，他们预期将成为的人，利益受损最大的那部分。所以六四的诉求往往很混乱，而且很多是反对市场经济的，对于体制大多数人也不可能坚决反对。他们的对手，体制的核心则敢于用最血腥的手段来对付他们，他们中的绝大多数即使遭到最血腥的攻击也不敢通过稍微激烈的手段报复。这是六四必然失败的原因。",
			"date_added": 1560064872
		},
		{
			"post_id": 1560066273,
			"body": "所以六四之后共产党的一个改革就是上大学收学费，这样物价上涨就够不成对大学生利益的冲击了。",
			"date_added": 1560066059
		},
		{
			"post_id": 1560075486,
			"body": "当然参加的个体户代表了另一种力量，工人则介于两者之间，他们比干部身份者更坚定更反体制，在流血时更坚决地采取暴力反抗。",
			"date_added": 1560075271
		},
		{
			"post_id": 1560076551,
			"body": "运动的领导者也是一方面，大部分领导者都是高干子女，他们的立场常常只是利用运动帮助父辈在体制内争取更好的位置，就像他们在文革中的前辈一样。",
			"date_added": 1560076335
		},
		{
			"post_id": 1560442631,
			"body": "习近平可能不知道中共依靠美国活着，也不知道从美国流入资源的相当关键一部分需要从香港白手套转手，当然也可能知道装作不知道。反正从当前措施来看很可能想用血腥手段重演六四，进而毁掉香港也毁掉白手套。",
			"date_added": 1560442414
		},
		{
			"post_id": 1560520006,
			"body": "大陆不少人平常自己都不信中共的司法，但现在香港人表现出不信中共的司法，要抗拒中共的司法，他们却愤愤不平，反对香港人的抗拒。其实就是自己倒霉，也盼着别人跟着倒霉，并称这种倒霉叫主权。",
			"date_added": 1560519788
		},
		{
			"post_id": 1560678039,
			"body": "香港共党支部退缩了，估计是中共核心也发怵了。这次大概算确认香港人部分外国人的属性，如果都当作全部中国人，估计车马炮全出了。",
			"date_added": 1560677820
		},
		{
			"post_id": 1561046583,
			"body": "中共已经以港独的名义封杀了《皇后大道东》，可中共不是刚刚和这帮人妥协了？和港独妥协不是说明中共承认香港人多多少少不是中国人了吗？这就是中共的高明之处，通过这种方式明确的告诉大家，中国人上街中共还是会出车的，香港不出车是因为那已经是半外国人。\n",
			"date_added": 1561046363
		},
		{
			"post_id": 1561476188,
			"body": "这几天网上出的各种新闻，清楚地说明你看不见黑暗是没有立案。别说凌晨两点去撸串，就是下午两点和教导主任打牌也能给你埋了。",
			"date_added": 1561475967
		},
		{
			"post_id": 1561557927,
			"body": "以前说过维稳的事，很重要就是维稳受害人。一个严重犯罪的案子，不立案，然后维稳受害人比立案抓罪犯要轻松的多，就是罪犯和官府没关系也是如此。如果你无法对官府有所制约，你肯定就会迎来这样的官府。制约官府有两种方式，一种是选票，你没有，另一种是造反，你不敢。",
			"date_added": 1561557705
		},
		{
			"post_id": 1562247530,
			"body": "网易云音乐app下架了，喜马拉雅等也下了，哈哈哈，早就考虑到这一点，不过中共更在乎手机app，这一点没想到。",
			"date_added": 1562247307
		},
		{
			"post_id": 1562854551,
			"body": "仔细想了一下，中共对学术审查比小说还松。某些党史研究多多少少可以写一些共党真面目的，文艺作品则几乎不可能出现这些研究成果。历史研究也是这样，前两天在微博看见有人说中国对“鄂尔多斯文化”隐瞒，其实一搜一大堆，不过都是出现在偏学术的地方，不学术的地方都在宣传“五千年文明”。",
			"date_added": 1562854327
		},
		{
			"post_id": 1562945795,
			"body": "网上中国籍外宾真多，你没枪，没选票，胆子又小，又做中国梦听话，你的一切就都是共党寄存在你这里的了，包括生命，共党没啥有求于你的，可是共党有求于洋人，所以直接从你那里取走东西给洋人来收买洋人，这不很正常嘛。",
			"date_added": 1562945570
		},
		{
			"post_id": 1563096350,
			"body": "养兵千日用兵一时，这回田园女权发挥作用了，在共党发声打黑包括极端女权的同时，留着这么多极端的田园女权不打，也算一种养了，对于山东大学拉皮条的事也能洗成中华田园女权模范也是很神奇的一件事。",
			"date_added": 1563096124
		},
		{
			"post_id": 1563096710,
			"body": "不过共党最终要面对男屌丝群体，不给他们足够的交配权肯定会出大乱子，多少大词都没用。",
			"date_added": 1563096483
		},
		{
			"post_id": 1563291170,
			"body": "三山国王对应三座山竟然是在揭西县城的三个方向，但揭西县是49年以后才从揭阳分出来的，就是揭西县城在49年以前不过是个大点的镇子，叫河婆镇，而且河婆镇是客家人的镇子。\n客家人和潮汕人之间基本上以莲花山脉分隔，南边大部分是潮汕人，北边大部是客家人。相对来说三山国王信仰以潮汕人为主，客家人只有梅州人比较信，而福建漳州也有部分三山国王信仰，说明三山国王信仰是以潮汕为中心的，扩散到周围人群。\n另外客家人的宣传机器很厉害，把三山国王说成是客家中心的，当然还有自称中华正统，自称反清之类的。实际上客家人在清朝大多站在清朝一方镇压天地会，只有洪秀全一次是以客家人为主的反清。\n再回头说三山国王信仰，这种信仰是山神崇拜，但那三座山在潮汕地区并不算高山，也远离潮汕地区的中心潮州，甚至远离揭阳这个小中心，所以我感到奇怪。\n河婆镇的特点是处在莲花山脉的一个缺口边，有条穿过莲花山脉的大路经过河婆镇，而河婆镇及旁边几个小的客家镇子处在一个被四周较高山脉包围的小盆地内，小盆地中间有几座较低矮的山把几个镇子分开。那三座山就是四周较高的山中较近的三座。可以猜测三山国王最早就是河婆附近的地方神。\n一个解释就是很可能潮汕人祖先的重要源头人群之一以前曾经长期住在现在河婆镇附近，信仰三个山神，然后在某个时机，这个人群扩散到了整个潮汕地区，并多多少少拥有支配地位，把自己的山神带给整个潮汕。\n一个进一步的猜测是这个人群是从莲花山脉另一边被人赶过来的，通过河婆镇西北的大路穿过莲花山脉，逃到河婆盆地。在修养生息几代人后，向东征服潮汕地区的。\n还有一个猜测是原来河婆盆地是潮汕人地区，由于客家人取代了潮汕人，所以带来现在当地人对河婆镇的解释是姓何的老婆婆之类比较牵强的解释，同时三山里面的明山被叫作银山，巾山被叫做金山。\n最后一个猜测是那个人群的三神山信仰有可能是从其他地方带过来的，可能有三座曾经同名的更高的山在更远的地方，比如说莲花山脉另一侧。",
			"date_added": 1563290942
		},
		{
			"post_id": 1563604522,
			"body": "关于水灾的报道，当然是在每天半小时的习近平的胖脸，常委的胖脸，共产党官僚的胖脸之间加上半分钟一分钟，你要能看到，必然得认真看了半小时胖脸。网络这种可以跳过胖脸的媒体，当然会对这种关键词屏蔽。",
			"date_added": 1563604293
		},
		{
			"post_id": 1563701132,
			"body": "看了《权力的游戏》最后一集，当丹妮莉丝在红场阅兵时发表了将苏维埃扩展到全世界的演讲之后，琼恩和提里昂终于发现他们的女王是苏联领导人，这也解释了为啥她要在杀绑匪之前先杀人质。于是琼恩火线加入社会革命党，成功以后就流放西伯利亚了。",
			"date_added": 1563700902
		},
		{
			"post_id": 1563702925,
			"body": "说起西伯利亚，现在似乎和中国境内史前联系紧密。Y染色体单倍群N是和单倍群O最接近的，主要分布在西伯利亚和北欧靠近西伯利亚的地方，被认为最接近汉藏语系的是叶尼塞语系，也在西伯利亚，二里头和商的青铜器以及商和周的战车，也被认为是西伯利亚传入的。",
			"date_added": 1563702694
		},
		{
			"post_id": 1563801379,
			"body": "这几天有人谈到国内某些中产如何舔共，甚至某个私营企业主坚决否认国进民退。其实只要想明白，中共治下没有真正的私营企业，所有私产其实都是共产，这些企业主如果不是白手套，就是多多少少是依靠官僚发家，如果共倒了，以他们的才干，吃屎大概都吃不到热乎的。",
			"date_added": 1563801147
		},
		{
			"post_id": 1563974551,
			"body": "另外这些假冒的私营企业，也是借着市场经济名义从美国获取顺差的幌子。实际上从美国获得超高好处的国家，往往是企业多多少少是政府分支的国家。二战前的德日，二战后的韩日，整个苏联，近几十年的中国。",
			"date_added": 1563974318
		},
		{
			"post_id": 1564063696,
			"body": "低人一等到多等，是大一统帝国臣民的特权，同时相比被大一统帝国统战的外国人自己的臣民价值更低，这就使大一统帝国的臣民地位更低了。大一统帝国里面，共产党搞的大一统帝国这种特征更明显。",
			"date_added": 1564063462
		},
		{
			"post_id": 1564064275,
			"body": "香港的事就是这样，美国的意思就是如果中共彻底把香港人当中国人，香港当中国的地，他也要把香港人当中国人，香港当作中国的地方来对待，这就把中共吓坏了。而中共的臣民再愤愤不平也没用，在中共心目中这些臣民价值要比香港市民低很多。",
			"date_added": 1564064040
		},
		{
			"post_id": 1564064699,
			"body": "另外一个就是验证了中共是靠美国的残渣剩饭过活，在经济上和技术上都是如此，香港这个假装不是中国的地方对中共的重要性主要也集中在此，联系前几天说的，香港企业其实也是中共的企业。",
			"date_added": 1564064463
		},
		{
			"post_id": 1564065400,
			"body": "对于香港人来说，看清楚这一点，尽量限制中共在香港势力，打击中共在香港的走狗很重要，一来可以争取更多的利益，二来免得中共及其走狗做的太过分而使香港白手套的真面目暴露。",
			"date_added": 1564065163
		},
		{
			"post_id": 1564312191,
			"body": "以美国的利益来说，直接给香港一个中国普通城市的待遇是最解决问题并快刀斩乱麻的。以中共的利益来说，在香港收缩以维持香港现有地位更有利。以现在香港土共来说，不管结局怎样，总有一款夹边沟适合他们。以中国老百姓来说，他们根本没有任何选择的权力，也没有任何人在乎他们。",
			"date_added": 1564311953
		},
		{
			"post_id": 1564408953,
			"body": "美国的所有热战冷战贸易战都终将胜利，因为美国的所有敌人都是美国一把屎一把尿喂大的。有个问题是上帝能不能造出自己举不动的石头，这个问题结论我不知道，不过美国肯定造不出自己打不败的敌人。比如说70年代，苏联强美国显得弱，苏联强苏联的花销就更大，美国弱则美国的喂养能力就弱，于是80年代苏联迅速衰落了。",
			"date_added": 1564408714
		},
		{
			"post_id": 1564494164,
			"body": "中共伟大之处就是只用6%的耕地养活了99%的人肉复读机，并生产了100%认为欧美用不起空调只有他们用的起空调的强国人。",
			"date_added": 1564493924
		},
		{
			"post_id": 1564906212,
			"body": "感觉现在日韩之间的事就是川普默许日本通过自己的力量成为东亚协调人。基本上就是日本在英日同盟里的地位。解决韩国后，下一步是在中共的帮助下实现协防台湾，然后协防菲律宾。我们要相信中共的能力，一个牛二可以使各式各样的邻居们都倒向杨志。",
			"date_added": 1564905971
		},
		{
			"post_id": 1564907914,
			"body": "海南还真可能承接香港金融中心地位，当然不是你想的那样，我说的是海南独立，同样的外援条件下，海南独立比香港独立容易得多。\n当然另一个问题是，台北也没取代香港地位，海南最多成为一个小台湾。所以现在最有希望能够取代香港的是新加坡，就是距离太远。",
			"date_added": 1564907672
		},
		{
			"post_id": 1564910884,
			"body": "今年是猪肉，明年是所有肉类加再加上粮食。",
			"date_added": 1564910641
		},
		{
			"post_id": 1565013885,
			"body": "徐州的事都知道吧，又证实了维稳首先维稳受害人的理论，在神州大地，也许你几十年顺风顺水，突然脚下稍微一滑，你就滑到以前从没见过的无底深渊里了。",
			"date_added": 1565013641
		},
		{
			"post_id": 1565013997,
			"body": "我猜文在寅可能是第一个卸任后被判死刑的韩国总统。",
			"date_added": 1565013752
		},
		{
			"post_id": 1565094398,
			"body": "这几天消息真多，再过几天估计会出更大的事。",
			"date_added": 1565094152
		},
		{
			"post_id": 1565102221,
			"body": "哈哈哈，你们看这次深圳的特警演练，假想敌“示威者身着黑色服装，头戴黄色安全帽，用口罩遮住面部”，你以为是假想香港人吗？“示威者高举“还我血汗钱”“违法欠农民工工资，良心何在”等标语，高喊“还钱”口号”，实际上看图片安全帽的颜色不一，你想想，农民工可不是头戴安全帽吗？你以为他们会真的演练对付香港人吗？\n川普说香港是中国的，不是在示好，而是在威胁中共，中共怕西方将香港当成中国一部分。",
			"date_added": 1565101974
		},
		{
			"post_id": 1565270651,
			"body": "大陆的朋友都要小心，主要是大陆的街头活动，我判断中共不会在香港动武，这会使他们很窝火，也会使大陆百姓轻视，所以他们可能在大陆通过流血镇压来挽回面子。",
			"date_added": 1565270403
		},
		{
			"post_id": 1565412412,
			"body": "大陆老百姓反对香港，主要是认为香港人是中国人，中国多数人就是见不得别人好，尤其是见不得中国人好。中国的统治者往往具有一些外国属性，中共尤其如此，所以往往可以享受老百姓的爱戴。",
			"date_added": 1565412163
		},
		{
			"post_id": 1565620998,
			"body": "没想到中共敢把贸易战搞到农产品进口上，而且做得这么绝，真的准备明年开始新三年自然灾害？还是中共不希望刘仲敬的大洪水迟到太久？",
			"date_added": 1565620748
		},
		{
			"post_id": 1565791355,
			"body": "打环球时报的记者算打人吗？打没动手的辅警有可能过于暴力，打环球时报的记者居然没有当场打死，只能说是太和平主义了。",
			"date_added": 1565791104
		},
		{
			"post_id": 1565964765,
			"body": "在香港的问题上，李嘉诚等人和香港建制派中国共产党算是共犯，当然李嘉诚算是从犯。",
			"date_added": 1565964513
		},
		{
			"post_id": 1566135337,
			"body": "共产党是最擅长利用民主国家的民主，自由国家的自由，资本主义国家的资本家和市场经济国家的市场经济的团伙，而且擅长把自己用主权的名义伪装起来，但是对外渗透却从不停止。",
			"date_added": 1566135084
		},
		{
			"post_id": 1566135773,
			"body": "虽然美国前些年提出“人权高于主权”，但是美国称霸之前，并没谁把主权当回事。人权外交是美国搞出来的，主权外交也是。其实要是没有美国鼓捣主权，苏联一生下来就给灭了。",
			"date_added": 1566135519
		},
		{
			"post_id": 1566136553,
			"body": "当年列宁说资本家会卖绞死自己的绳子给共产党。从那时就已经明白这个路线。这也是香港富豪和中共合作愉快的原因。",
			"date_added": 1566136298
		},
		{
			"post_id": 1566219410,
			"body": "李嘉诚就是那种卖绞索的，不过他没卖绞死他自己那根。李嘉诚对香港危害主要还不是和共党做买卖，也不是在香港的垄断经营，你想想共党为啥给他那么多好处？他在香港替共党和建制派维稳才是最大的危害。",
			"date_added": 1566219154
		},
		{
			"post_id": 1566219810,
			"body": "在深圳建社会主义示范区为啥是利好？深圳商人还不赶紧跑？难道对社会主义有什么误解吗？",
			"date_added": 1566219553
		},
		{
			"post_id": 1566309154,
			"body": "一般来说，当温和中国人说要革命，要不择手段，残酷斗争时，对象都是中共的敌人，说要温和改良，不能暴力时，对象是中共。不过中共挺喜欢对温和中国人使用暴力的，突突突完了还给温和中国人扣个暴力的帽子，这时幸存的温和中国人出来说那些被突突突的温和中国人太激进太暴力太不知进退了。",
			"date_added": 1566308896
		},
		{
			"post_id": 1566310385,
			"body": "继续说香港，香港的位置离往往封闭的中国很近，又是个自由港，所以最适合走私各种东西。如果当时统治中国的是明朝或清朝，走私多半对洋人和中国百姓有利对朝廷不利。如果是中共，有共产党祖传的勾搭资本家走私的绝活，主要是对中共有利，对于中国人和外国人长远和整体上是有害的。",
			"date_added": 1566310126
		},
		{
			"post_id": 1566311813,
			"body": "所以如果出于美国的利益，尤其是贸易战时，香港不管是什么状态，都多多少少对于美国的利益有害，即使是英国人直接统治的香港也是如此，而否认香港地位对于美国最有利，只是因为历史的原因美国还在维持旧的政策。\n实际上川普一派似乎想简单取消香港独立关税区地位，而美国建制派还想维持香港地位。而中共为短期利益不断在香港加强控制，试探底线，使得美国建制派的维持理由越来越不充分。可以看出现在的中共比周恩来掌控下的中共短视得多。\n一旦越过底线很可能香港将变成中共治下的一个普通港口，香港市民将堕入和大陆居民一样的深渊，同时中共也会遭到重创甚至在若干年后比原来可能早得多倒台。\n这就是各方采取现在态度的原因，中共的短视把自己和香港市民都推到悬崖边缘，香港市民的反抗其实对双方都有利，而真正决定性的则是在美国的两派的斗争。\n如果美国最终否认了香港的独立关税区，则中共可能撕破脸采取相当血腥的方式镇压香港的运动。",
			"date_added": 1566311553
		},
		{
			"post_id": 1566312839,
			"body": "其实对中共最有利的方案是让香港独立，如果香港独立，自由港和独立关税区都可以保住，而香港又有那么多大大小小的飞碟以及卖绞索的资本家。当然邓小平当年不谈收回香港对中共更有利，免得那么多年中共控制不住自己的欲望。不过中共现在让香港独立无法对小粉红们解释，现在中共有没有魄力枪毙全部小粉红。",
			"date_added": 1566312578
		},
		{
			"post_id": 1566315152,
			"body": "想一想让香港独立问题不在于民族主义，而在于一两千年来，专制暴君不能显示出弱像，中国文化是真狼性文化，专制暴君一旦让臣民看出软弱，就会被群狼撕咬，所以中国的改革家往往是更高压统治。而开疆拓土和四方来朝是显示专制强大的方式（在吸引四方来朝时一个人配几个学伴都是可以理解的枝节问题），在边疆放任自治和独立是容易让人误会软弱。那时温和中国人，理客中，小粉红，自干五，地方实力派，科举做题家都会像狼一样扑向中共。",
			"date_added": 1566314890
		},
		{
			"post_id": 1566481392,
			"body": "今天举报老师的学生，可能明天就会被更革命的下一代举报。文革时被打倒的白专反动学术权威很多都是在文革前打到他们的老师上位的，而他们的老师可能是在49年以后批判他们的外国老师而上位的。",
			"date_added": 1566481129
		},
		{
			"post_id": 1566482872,
			"body": "感觉习近平就是照着剧本演，虽然经常念错字，但是戏竟然演的和剧本差不多。",
			"date_added": 1566482608
		},
		{
			"post_id": 1566570305,
			"body": "人脸识别和步态识别估计主要是共党宣传口在夸张，精确性根本上不去，尤其是步态识别，人的步态一来更不稳定，而且缺乏相互独立的特征，一个步态很可能符合的达到总人口的百分之一或千分之一量级。人脸精度高些，但上海依照人脸处罚行人闯红灯的就被曝出冤案。共党主要是在恐吓人民。",
			"date_added": 1566570040
		},
		{
			"post_id": 1566617921,
			"body": "我下巴掉地上了，习近平操作太猛了。开始九月一日加关税的时候，静悄悄，延后到十二月十五就突然抖起来要反制，这周五宣布加关税，结果川普作为对这波的回应，延后似乎取消了，而且多加了，十月一日以前加的也要加关税了。",
			"date_added": 1566617655
		},
		{
			"post_id": 1566906475,
			"body": "共产党是不是对自由和贸易有什么误解？还是对自由贸易有误解？还是对自贸区有误解？有一两个骗傻子就成了，搞到每个省有几个就相当搞笑了，以后要不要每个地市每个县每个乡每个村都有自贸区？",
			"date_added": 1566906208
		},
		{
			"post_id": 1567001263,
			"body": "深圳人太实诚了，不搞社会主义示范区不塌楼，一搞就塌楼，还在离深圳河不远的地方塌，塌楼还塌一砸一。",
			"date_added": 1567000995
		},
		{
			"post_id": 1567001658,
			"body": "深圳人还把塌楼当成利好，当然现在还成，毕竟塌的少，深圳市还有钱，十有八九会比市场价略高一点补偿，不过等以后塌楼成新常态就没这么好事了，再加上那时深圳也社会主义示范了。",
			"date_added": 1567001389
		},
		{
			"post_id": 1567089963,
			"body": "忽然想到，号称2020年消灭贫困，估计各个地方要把时间提前到今年九月国庆献礼吧？然后赤贫人口没有补助了，贸易战又到了“最舒服”的阶段，储备粮储备肉有吃光了。",
			"date_added": 1567089693
		},
		{
			"post_id": 1567090385,
			"body": "刚才电视里有个“专家”谈大湾区，说到最后说：“这是我的一点学习体会。”太搞笑了。专家都成了小学生，比扒马褂都不如。",
			"date_added": 1567090114
		},
		{
			"post_id": 1567175645,
			"body": "台湾人见识了国民党接收大员开始台独，香港人见识了共产党接收大员开始港独，这个世界还是很对称的。",
			"date_added": 1567175373
		},
		{
			"post_id": 1567263444,
			"body": "黄俄在中国的成功，大概是因为黄俄在中国最洋气的群体了。虽然西方比俄国洋气，但是西方相对自由，也没有强制要求崇拜者完全照搬本方，再加上因为自由西方文化并不统一，使西方崇拜者无所适从，如果再有西方的东方崇拜者出来吹捧中国，大部分中国的西方崇拜者会本能的被这种思想吸引。但是苏联当时一统，至少公开思想统一，并强令各儿子当照搬苏联，这样黄俄就是最西化的人群了。黄俄击败了真正的民族主义者蒋介石，也击败了不知道啥主义者毛泽东，最终派出当时代表邓小平出访美国，完成联美反俄这一历史性的变局，附带说一下，开始这一进程的主要联络也是做了五十年黄俄总代表的周恩来，历史也是很有幽默感的。",
			"date_added": 1567263171
		},
		{
			"post_id": 1567264739,
			"body": "很有意思的是：虽然中国没啥自由，但大部分中国田园自由派都在舔共；虽然中国没啥民主，但大部分中国田园民主派都在舔共；虽然共产党从根上说是反市场，而且经常有反市场行为，但大部分中国田园市场派都在舔共；虽然共产党从根上说是反对资本家的，但大部分中国田园资本家都在舔共；虽然共产党从政策上压榨工人，但大部分中国田园工人运动家都在舔共；虽然共产党从事实上压榨农民，但大部分中国田园农民运动家都在舔共；虽然共产党一直是保守主义的死敌，但大部分中国田园保守派都在舔共；虽然共产党从事实上妨碍了中国工业发展，但几乎所有中国田园工业爱好者--工业党都在舔共；虽然中共曾反复消灭中国传统文化，但绝大多数中国的传统文化爱好者都在舔共。\n我觉得可能大多数中国人的爱好就是舔共，但不好意直接舔，绕个圈子找个主义舔。",
			"date_added": 1567264465
		},
		{
			"post_id": 1567314498,
			"body": "华为这次方舟编译器的开源很符合我对这家公司的预期，确实是整天加班缺少睡眠头脑不清的平庸程序员搞出来的东西。",
			"date_added": 1567314223
		},
		{
			"post_id": 1567347027,
			"body": "现在猪肉价格上涨也不可能增加多少供给，所以猪肉涨价的终点是价格高到足以抑制需求。如果牛羊肉能无限供给，当然猪肉涨价的终点是牛羊肉价格，但是中国的牛羊肉产量远远低于猪肉，最终是牛羊肉价格一起上涨。今年上涨幅度估计会低于明年上涨的幅度。",
			"date_added": 1567346751
		},
		{
			"post_id": 1567437979,
			"body": "斯洛伐克和斯洛文尼亚的词根都是斯拉夫吧。",
			"date_added": 1567437702
		},
		{
			"post_id": 1567522770,
			"body": "看微博上人谈到美国农民培养孩子养小家畜，然后一年后把小家畜送去屠宰，让孩子和小家畜分别的教育方式。其实类似的培养方式应该是全世界农民里多多少少有一些。比如小时候就发现有几次出身农村的同学养的小动物被农村的家人杀了吃肉的事，当时觉得那些人才残忍，而且肉又不多，长大了才发觉可能是农民一种简单粗暴的教育方式，让孩子和家畜划清界限，不能把家畜当宠物养。当然中国农村没有拍卖之类操作，宗教没那么强，也更穷，所以会更简单粗暴。我参与养的兔子听说是在我同学面前被剥了皮，这个同学的父母都是在城市里的知识分子，杀兔子的是他祖父母，大概预期他还会当农民？现在这个同学应该是在美国写程序。",
			"date_added": 1567522492
		},
		{
			"post_id": 1567526514,
			"body": "看了央视关于《亚长墓》的节目。\n先吐槽一下节目标题的“铁血”，亚长本人是青铜时代的，哪有什么铁，铜血还差不多。\n另外就是那些专家相当不通，亚长的伤大部分在左侧，包括明显愈合的伤，这帮专家竟然没明白代表什么，还模拟一个武侠片的武林高手打斗，还有的是模拟死前左侧朝上倒地，还有个人说他可能右手有问题，所以左边靠前，说得商王像是惨到已经需要残疾替他冲锋陷阵一样。左侧朝上倒地只能解释死前的左侧伤，不能解释愈合的左侧伤。\n左侧是盾牌所在，应该伤少，左侧伤多说明他没有盾牌，头顶和胸腹部没伤，说明他很可能有头盔和胴甲，我猜是青铜的。作为一个地位很高的武官，不带盾牌，左侧伤多，最可能的就是他是车左，或者是商王车上的御（在左侧），这也解释了他腿部受伤多的原因。",
			"date_added": 1567526235
		},
		{
			"post_id": 1567607125,
			"body": "大陆不少人对五大诉求里的双普选最痛恨，主要就是来自于典型中国人痛恨中国人这一习性，不能容忍中国人拥有普选权。任何被认为中国人的非典型中国人，如果想拥有普选权在内的各项正常权利，有两种方法：一是暴打全部典型中国人，迫使他们承认这些权利；二是想办法是洋人承认自己不是中国人，并用武力证明给典型中国人看。显然第二种更可行。",
			"date_added": 1567606845
		},
		{
			"post_id": 1567607585,
			"body": "在典型中国人里面，利己主义者是道德最高尚的，他们不在乎别人是否倒霉，只想着利己，是不太典型的典型中国人；大部分典型中国人处在中等的道德水平上，就是别人倒霉和自己走运一样开心，别人走运和自己倒霉一样难过，他们会在夜里面破坏邻居瓜田的西瓜；比较极端的典型中国人是毫不利己专门害人的。",
			"date_added": 1567607304
		},
		{
			"post_id": 1567693915,
			"body": "产生我昨天说的典型中国人的温床就是一种被逼不断进行小范围零和博弈的环境，一个人得到的，就是旁人失去的，一个人失去的，就是旁人得到的，经过长期积累，自然会产生大量典型中国人，因为这是较为适合这种环境的生存策略。\n这种环境在秦以前还不太突出，两千年秦政成了一个初级的温床，而七十年共产党统治，则是一个极端的温床。",
			"date_added": 1567693633
		},
		{
			"post_id": 1567828460,
			"body": "关于中国工人的勤奋，前一两年有个中石油的小领导从美国回来对我说，美国工人很敬业，上班不乱晃，不聊天，不迟到不早退。",
			"date_added": 1567828177
		},
		{
			"post_id": 1567832864,
			"body": "你要说现在都快到白露了北京还那么热，冬天不会来了，一定会被中国人鄙视。但是如果你说西方经济学家说了那么久中国经济会衰退，到现在还在增长，中国经济不会衰退，你就会被中国人赞同。",
			"date_added": 1567832580
		},
		{
			"post_id": 1567915007,
			"body": "其实除了“亚长”墓专家成问题，在这之前央视播出的“芈加”墓也成问题，主要在“芈加”这个称呼上。墓中出土的有主人名铭文主要就两种“楚王媵随仲芈加”和“加芈行匕”。后一种的称呼很明显是称呼墓主人为“加芈”而非“芈加”，也符合文献上一般先秦称呼的顺序。前一个专家肯定是断成“随仲芈加”做名字，并将简短的名字断成“芈加”，取并“芈加”舍“加芈”作为墓主人主要的名字，但是似乎不太符合先秦的习惯。\n“随仲芈加”的断句有几种，比如：1“随”“仲”“芈”“加”作为同等紧密联系的字组成人名，但这样不会有比较简短的称呼，而且太奇葩了；2“随”“仲”“芈加”三部分作为同等紧密联系的字组成人名，这样简称就是“芈加”，但是也不太好解释，估计不是专家的断法；3“随”“仲芈”“加”三部分作为同等紧密联系的字组成人名，这样这个名字的中心部分是“仲芈”，是春秋常用的贵族妇女称呼形式，但是同等紧密不断句很怪；4“随仲”“芈”“加”三部分作为同等紧密联系的字组成人名，这个也太怪；5“随仲”“芈加”，如果假设曾侯是老二，表示嫁给曾家老二的“芈加”，有可能，但是很奇怪；6“随仲芈”“加”，假设“随仲芈”是头衔，有可能，但是比较怪，细分的话分为：a“随”“仲”“芈”,b“随仲”“芈”，c“随”“仲芈”，三种形式；7“随”“仲芈加”，“随”是国名及氏名，后面是名字，细分也是三种形式：a“仲”“芈”“加”，太怪就不说了，b“仲芈”“加”，我比较赞同这种，c“仲”“芈加”，估计专家是这么分的。\n排行加姓名是种诡异的组合，在春秋姓加名这种名字组合也极少见，典型的应该是氏加名。当时贵族妇女正式名字往往是一个限定的称呼加姓，限定的有的是排行比如“伯姬”“孟姜”，有的是某种谥号或封号如“穆嬴”，显然“仲芈”和“加芈”都符合这种规范。但是这种尤其是前一种可能容易重名，所以使用排行的官方名字和私名同时使用即正式又排除重名，私名肯定加在最后。\n名从主人，由于“仲芈”区分度不高，“加芈”就比较恰当。这个墓不应该叫“芈加”墓，而应该叫“加芈”墓。",
			"date_added": 1567914722
		},
		{
			"post_id": 1568129273,
			"body": "北京在西周早期（可能从商末开始就是）就是一个很重要的地区，发现了国内少数几个西周甲骨文之一，另外就是商遗民的影响很大，青铜器常见族徽，墓葬常见腰坑。",
			"date_added": 1568128987
		},
		{
			"post_id": 1568519879,
			"body": "5G感觉太扯了，基站范围小，耗电量大，穿墙效果差，实际上瓶颈可能还不是和基站和手机之间，所以速率可能只比4G高一点甚至更低（因为基站密度达不到）。",
			"date_added": 1568519592
		},
		{
			"post_id": 1568520447,
			"body": "另外有时感觉4G信号不太好的时候我老关了4G，感觉也还成。",
			"date_added": 1568520159
		},
		{
			"post_id": 1568521282,
			"body": "另外国内4G信号越来越差，原来在家里躺在床上4G满格，现在就不成了。",
			"date_added": 1568520993
		},
		{
			"post_id": 1568815326,
			"body": "现在各种献祥瑞，种种马屁吹捧，很多时候都瞪着眼睛说瞎话。难不成习近平准备70大庆以后就不过了？",
			"date_added": 1568815036
		},
		{
			"post_id": 1568905929,
			"body": "现在感觉那个社科院考古所的微信号内容越来越少了，似乎考古所现在归属什么中国历史研究院了，而这个中国历史研究院的微博号在微博上搞五毛式辟谣。估计以后黄鼠狼下耗子了。",
			"date_added": 1568905638
		},
		{
			"post_id": 1569064842,
			"body": "大多数人到对某样东西很激烈的相信，就是说有些怀疑了，甚至有些否定了，但是怕失去沉没成本，也怕面子挂不住，所以会表现出比较激烈的相信。",
			"date_added": 1569064550
		},
		{
			"post_id": 1570446313,
			"body": "印欧人似乎自带种姓制度，印度人就不说了，波斯人也有，西欧基督教等级制度顺序正好是教士贵族和平民，只是因为教士不能结婚，不然就真的种姓制度了，但说明有以前的文化在内。",
			"date_added": 1570446020
		},
		{
			"post_id": 1570459717,
			"body": "犹太人在较早的时期也是在欧洲扮演一个金融商人种姓的地位。",
			"date_added": 1570459423
		},
		{
			"post_id": 1570546100,
			"body": "十一过后中国好多人亢奋了起来。",
			"date_added": 1570545805
		},
		{
			"post_id": 1570720070,
			"body": "中华田园右和小粉红一条战线，也在指责美国没有言论自由。仿佛美国的左派是比中共更大的敌人。当然他们几乎不把中共当敌人，但是中共绝不会忘记这帮人是异己分子，而且是很好的两脚羊排原料。",
			"date_added": 1570719774
		},
		{
			"post_id": 1570803881,
			"body": "种姓制度的一个好处是一生下来就处在职业所对应的气氛里，不容易被带偏，尤其是战士职业，和平久了往往丧失“武德”，而有战士种姓会好一些。不过问题是如果战术体系改变了就麻烦了。",
			"date_added": 1570803584
		},
		{
			"post_id": 1570973828,
			"body": "中国高速发展基本上就是靠低成本，低成本就是靠低工资和超载之类的，这不应该是常识吗？外卖和大货车横冲直撞就在于低成本，成本一部分被送外卖的和大货司机用被自己忽视低估的生命承担下来，一部分被其他交通参与者用生命承担下来了。",
			"date_added": 1570973530
		},
		{
			"post_id": 1571061011,
			"body": "这次协议其实连休战都算不上，只是不再扩大而已。",
			"date_added": 1571060712
		},
		{
			"post_id": 1571931353,
			"body": "社科院没有和那个“思想火炬”切割，大概那种活宝是习近平心爱的思想宠物吧，就像周小平一样。",
			"date_added": 1571931053
		},
		{
			"post_id": 1572176422,
			"body": "这周肉价涨得真快，猪肉鸡肉都飞涨。",
			"date_added": 1572176121
		},
		{
			"post_id": 1572178994,
			"body": "为啥突然涨价？莫非储备肉见底？那储备粮什么时候见底？估计以后x年贸易战就是“x年自然灾害”了。",
			"date_added": 1572178692
		},
		{
			"post_id": 1572181641,
			"body": "找来看了一些巴尔干西北部，就是前南斯拉夫范围的资料，感觉我原来被忽悠的比我想象的更多。比如说穆族是信伊斯兰教的塞族，其实包括相当大比例的信伊斯兰教的克族，而且从二战的立场来说，穆族是被塞族屠杀的，更倾向克族。很奇怪存在波斯尼亚人的认同却不是被当作一个民族。而克罗地亚族更复杂，来源应该很多，有多种差别很大的方言，但是占统治地位的方言却是和塞尔维亚人一样的。马其顿人从语言来说是保加利亚人。所谓铁托为了削弱塞族把马其顿和穆斯林从塞族划出来的说法明显是塞族的忽悠。科索沃和马其顿当然在古代是塞尔维亚的领土，但是贝尔格莱德那时候还是匈牙利的领土。伏伊伏丁那更是匈牙利用来收容塞尔维亚难民的区域。",
			"date_added": 1572181338
		},
		{
			"post_id": 1572267333,
			"body": "所有中国人常听的的关于东欧民族的故事，都是偏向俄国一方的，是俄国对华宣传有力，还是黄俄给力我就不太清楚了。",
			"date_added": 1572267029
		},
		{
			"post_id": 1572270883,
			"body": "所谓的克罗地亚语很复杂，有几大方言。最主要的方言是舒特方言，实际上波斯尼亚语塞尔维亚语黑山语都属于舒特方言。其次是卡伊方言，克罗地亚从来源上分四大区：克罗地亚本部，斯拉沃尼亚，达尔马提亚，伊斯特拉。其中克罗地亚本部主要是讲卡伊方言，萨格勒布原来也是讲卡伊方言的，现在是卡伊方言和舒特方言混合的方言，卡伊方言相比于舒特方言更接近于斯洛文尼亚语，还有些语言现象接近于斯洛伐克语（出现了好几个以斯拉夫为词根的地名）。查方言主要分布在达尔马提亚和伊斯特拉，就是亚得里亚海边上，几百年前在达尔马提亚占主导，现在达尔马提亚地区大部分地区主要是舒特方言。斯拉沃尼亚自古以来主要是舒特方言。斯拉沃尼亚和达尔马提亚都是随着奥地利击败奥斯曼以后被奥地利归到克罗地亚的。",
			"date_added": 1572270578
		},
		{
			"post_id": 1572360205,
			"body": "克罗地亚人感觉就是以天主教划分出的民族，有不同成分组成，而同一区域里的东正教徒都被划分为塞尔维亚人。穆斯林后来正式划分为穆族。塞族穆族和一部分克族可能是同一源头，或者是经过深度混合。达尔马提亚的居民应该是收意大利影响的天主教徒，而克罗地亚本部可能是原来和斯洛文尼亚接近的民族，斯洛文尼亚是北部较早附属于匈牙利和奥地利的小民族。塞族被奥斯曼向北驱赶过程中，一部分可能改信天主教和伊斯兰教，但是由于人数优势在语言上同化的穆族和部分克族。",
			"date_added": 1572359899
		},
		{
			"post_id": 1572361304,
			"body": "塞尔维亚人原来分布在波斯尼亚人南边，从黑山到科索沃马其顿以及塞尔维亚南部的山地，是山民，被奥斯曼人驱赶后，放弃山地进入平原，成为平原民族。",
			"date_added": 1572360997
		},
		{
			"post_id": 1572533161,
			"body": "这次被抓的几个小孩都是上恶俗维基的，那个15岁的还只是浏览，恶俗维基对共党干了什么？让共党这么不舒服总是好事。",
			"date_added": 1572532853
		},
		{
			"post_id": 1572790634,
			"body": "华为的事，和我以前看到一个知乎的帖子有些对应。那个帖子认为华为为了所用的人都是可替换的，排斥最优秀的人才，所以用大量一般优秀的技术人员人海战术来开发，造成研发成本畸高。而最近的事，hr是控制技术人员的，少量HR控制大量技术人员，HR更接近领导，所以HR待遇高，也可以任意排布技术人员。",
			"date_added": 1572790325
		},
		{
			"post_id": 1573225528,
			"body": "薅羊毛事件，显示出中国人之间深刻的仇恨。很多支持薅羊毛的人理由是自己被商家骗过，但是被一个商家骗过，就要报复另一个商家，这种理由感觉好像很奇怪，其实可以从一种社会之内的霍布斯战争中寻求一种统一战线的角度来看，如果这些人没有找到一条敌我界限，他们就要仇恨一切中国人甚至一切人类了，真正进入到所有人对所有人的战争了。",
			"date_added": 1573225218
		},
		{
			"post_id": 1573312103,
			"body": "根据最近那篇二里头聚落考古总结的文章，龙山末期的大灭绝其实可能包括洛阳盆地，只是二里头恢复的比较快，二里头一期的聚落只有几个，到三四期有上百，龙山末期也是上百。但是也有可能不是，比如一期二期的小聚落碳测年比二里头早，也有可能龙山末期突然几个小聚落转成二里头一期文化，然后突然变到二期，然后蹦出个二里头当时还是一期文化。但龙山末期的聚落和二里头时期聚落似乎不重合，应该还是发生大灭绝了。",
			"date_added": 1573311792
		},
		{
			"post_id": 1573570101,
			"body": "罗马尼亚人的起源是瓦拉几（弗拉赫）人，瓦拉几和瓦拉几亚两词同源，瓦拉几亚应该是瓦拉几派生出来的。瓦拉几人是中世纪在巴尔干放羊的游牧人，基本上巴尔干说罗曼语族的人就是瓦拉几人，他们自称罗马人（罗马尼亚），不过巴尔干南部的斯拉夫人（保加利亚人和马其顿人）希腊人（甚至包括小亚细亚的希腊人）阿尔巴尼亚人也会自称罗马人。瓦拉几人现在的后裔还包括巴尔干西部从克罗地亚到希腊的山地分布的一些小民族，这些人是古代巴尔干西部的瓦拉几人的后裔，古代这些瓦拉几人大部分同化于斯拉夫人，少部分还在坚持说罗曼语，自称罗马尼亚人。还有少数瓦拉几人在巴尔干北边。巴尔干半岛似乎是纵向分东西两部分，东部罗曼语族的人在北边，斯拉夫语族东南斯拉夫语支在中间，南边原来是希腊语后来同化成突厥语族，西边从北到南分布是西南斯拉夫语支、阿尔巴尼亚语，东南斯拉夫语支，罗曼语族，希腊语。",
			"date_added": 1573569789
		},
		{
			"post_id": 1573570848,
			"body": "斯拉夫人应该主要是农民，瓦拉几人是放羊的，希腊人大比例是商人水手知识分子，似乎是种以语言区分的类种姓。",
			"date_added": 1573570535
		},
		{
			"post_id": 1573743154,
			"body": "这次肺鼠疫估计在北京没啥危险，主要是锡林郭勒那边，会不会流行，是不是已经流行消息被压下来都不好说。",
			"date_added": 1573742840
		},
		{
			"post_id": 1574266774,
			"body": "“不忘初心”近期的源头是AKB！当然中共粉丝会找到远期源头佛经，不过如果不是日本人使用，中共及其粉丝会从佛经里面翻出这个不常用词才是见了活鬼。考虑到“供给侧”的“侧”也用的日语用法，近些年中共从日本人那里又得到了一波先父遗传（中共建立时曾在日本留学的人是第一波，日本投降后得到第二波，文革时暗通款曲第三波，改开初勾搭成奸第四波，现在应该是第五波了）。",
			"date_added": 1574266459
		},
		{
			"post_id": 1574347325,
			"body": "中国出生率下降很快，今年出生可能只有1100万，可能再过两年就会在1000万之下了。",
			"date_added": 1574347009
		},
		{
			"post_id": 1574686694,
			"body": "泛民选票不到七成，还没有达到我原来估计的极其彻底的大胜，需要在下一次选举前促使建制派支持者尽快移民大陆。",
			"date_added": 1574686377
		},
		{
			"post_id": 1574777205,
			"body": "哈哈哈，看新闻，有人教唆炼胆伤人，你说炼胆炼出来能干嘛？当然是炼出小张献忠。",
			"date_added": 1574776887
		},
		{
			"post_id": 1574778306,
			"body": "今天似乎网不好，几个软件端口都没有映射上。这里发的贴也没发成功。",
			"date_added": 1574777987
		},
		{
			"post_id": 1574778717,
			"body": "任何时候都不能忘记，被检出大肠杆菌的饭和屎中的米粒是有本质的区别的。",
			"date_added": 1574778397
		},
		{
			"post_id": 1574861936,
			"body": "深圳又有楼房倾斜了。",
			"date_added": 1574861615
		},
		{
			"post_id": 1574954606,
			"body": "香港的事，其实还是和中美关系最相关，因为如果中美完全脱钩，中国、中共啥的就都虾米了。中美事实上没有过完全脱钩，即使是文革前和文革中，就在于香港的存在，美国资本家会把假装中共在香港的白手套是个正常的香港资本家来相互做生意，这些生意对于美国资本家不过是多赚一些钱，对于中共来说是生死攸关的。美国的那个法案最主要的部分就是关于美国资本家还能不能假装。",
			"date_added": 1574954284
		},
		{
			"post_id": 1575385641,
			"body": "看了报道，原来华为还有专用的监狱，这点倒是超出想象，华为公安局检察院真是三位一体。",
			"date_added": 1575385318
		},
		{
			"post_id": 1575470045,
			"body": "华为的事最可笑的是税务局的操作，为了证明华为打钱是个人行为，竟然把华为交的税退回去了，你说他们是要脸呢还是不要脸呢？说他们不要脸，可还要费力圆谎；说他们要脸，就算退回去以前华为交税的动作也还存在。",
			"date_added": 1575469721
		},
		{
			"post_id": 1575797789,
			"body": "共产党果然想象力丰富，还有为了打击电信诈骗封了到过云南靠近缅甸边境若干地方的手机QQ微信这种操作，原来10月份就干了，我才刚听说。",
			"date_added": 1575797464
		},
		{
			"post_id": 1576246481,
			"body": "忽然想到，美国应该取消澳门的独立关税区地位，让澳门的党委书记享受珠海党委书记的待遇。中共在香港折腾到头也就是把香港折腾成澳门，如果美国还承认澳门的独立关税区又怎能以此为由取消香港独立关税区地位？而且香港关上门后还留个澳门小口子也达不到效果。关上澳门，让各方见识到没有独立关税区的共产党自由港是什么效果很有教育意义。",
			"date_added": 1576246155
		},
		{
			"post_id": 1576403002,
			"body": "是每年增加进口1000亿？",
			"date_added": 1576402675
		},
		{
			"post_id": 1576403647,
			"body": "似乎真是几乎不可能完成的任务了，弄不好半年达不到，就要闹翻了。",
			"date_added": 1576403319
		},
		{
			"post_id": 1576942167,
			"body": "美国的经济很奇怪，竟然还是很繁荣，一大帮经济学家都预测要开始衰退，大概从一年前好像也从繁荣的顶峰往下降，结果，一年都没降下来。为啥出现这样反常的结果，估计不是美联储降点息的作用。我猜可能是贸易战的结果，虽然很多经济学家认为贸易战对美国经济不好，但是可能他们并不了解贸易战的全部作用，比如贸易战可能真的使工作回流了。",
			"date_added": 1576941838
		},
		{
			"post_id": 1576942678,
			"body": "还有就是可能中共以前对美贸易带有对美的恶意，比如很多出口包含倾销冲垮某些产业的意图之类的，这些贸易在贸易战中一旦萎缩，对美的不利影响消除，对美国经济有一定促进作用。\n其实我一直怀疑中共对世界怀有恶意，除了要牟利，还有破坏的意图。",
			"date_added": 1576942348
		},
		{
			"post_id": 1576943015,
			"body": "另外就是宣传领域能看出，中共对于美日港台都有恨意，但是中共的经济靠对美维持，不能从美国直接输入的往往通过日本输入，港台是输入口岸，外资利用中国的劳动力也需要港台人中介，总之从这四者获利极大，但是却鼓足力气在国内宣传对这四者的仇恨，中共的一个策略就是你对它越好，它对你越恨。",
			"date_added": 1576942684
		},
		{
			"post_id": 1577459203,
			"body": "那个负离子粉的事情太恐怖了，尤其是中共的态度，在知道这事后几年了，都没有大的动作，很让人生疑，中共以前曾为一两个丢失的放射源大张旗鼓。",
			"date_added": 1577458871
		},
		{
			"post_id": 1577542314,
			"body": "这次民航总医院杀医的处理结果也很奇怪，竟然是全免医疗费用！",
			"date_added": 1577541981
		},
		{
			"post_id": 1577606107,
			"body": "那些医生自己都不敢反抗领导的决定，还好意思怪现场病人无动于衷？",
			"date_added": 1577605773
		},
		{
			"post_id": 1577607316,
			"body": "中共这几年集中力量对付中产，不过中产最怕乱，最喜欢中共维稳，所以应该是最容易杀的猪。",
			"date_added": 1577606981
		},
		{
			"post_id": 1578062190,
			"body": "川普终于在军事上强硬了一把，干掉了圣城旅的头头。大概也是离大选近了，而且也被强硬派慢慢驯化了，知道不能光靠经济制裁解决问题。",
			"date_added": 1578061854
		},
		{
			"post_id": 1578063997,
			"body": "年初几天中共治下就出了那么多事，砍人的砍人，着火的着火，还把那个院士判了12年。最后一个基本上感觉是中共的司法（那玩意儿是不是能叫司法）系统在发泄愤怒。本来这种情况于法有罪，但是事出有因，有法不责众，判个几年意思意思就完了。好消息是我又不在体制内搞科研，中共把自己的科研团队搞得越乱越好。",
			"date_added": 1578063660
		},
		{
			"post_id": 1578201411,
			"body": "西安砍老师这事，你想想被砍的是五十多岁女的政治老师，就应该明白咋回事了，要不到手机还没完没了的被训，控制力差的就有可能出事，没收手机的女老师二十多岁，又是历史老师，反倒被砍概率极小。",
			"date_added": 1578201073
		},
		{
			"post_id": 1578208342,
			"body": "关于主权国家官员不能被杀这条国际法从来不曾存在，否则战争也不存在。在非战时，主权国家领导人特权摧毁最彻底应该就是纽伦堡审判和东京审判，如果想恢复这条特权先要给纳粹和东条英机翻案才成。",
			"date_added": 1578208003
		},
		{
			"post_id": 1578407835,
			"body": "又砍了个老师，这次是初中老师，官方通报叫徐某壮，应该是男老师，是已经毕业的学生干得。上回说年轻女老师被砍概率较小，因为砍人的大多是男生，老师一般平均长相会比普通人平均长相好一点，所以因为你懂的原因，年轻女老师除了真跟学生有感情纠葛，否则很难让青春期男学生想砍。这次说一下，青春期男学生可能比较想砍男老师（是说概率比女老师高），不过男老师是成年人，男学生是少年，少年和成年男性体格力量差距不小，要是初中就更明显了。这就是我对海南这次砍老师的部分解释。",
			"date_added": 1578407495
		},
		{
			"post_id": 1578409008,
			"body": "另外几天就发生两起，不能不让人怀疑有国内形势的原因，教师和医生算是中国中产的两大波人，表现得非常中国中产，强调应该立法禁止杀老师杀医生，让人以为现在中国杀老师杀医生合法。其实相反，上次有人打以前的老师，结果判几年，这种判决你如果不傻都知道虽然会减少打老师的概率，但是会显著增加杀老师的概率。当然中国中产就像我说的，非常喜欢中共维稳，很多事也是德匹下。",
			"date_added": 1578408667
		},
		{
			"post_id": 1578495270,
			"body": "怎么说呢，那个伊拉克总理基本上是满嘴跑火车，如果他说的是真的，起码有个伊拉克次长陪着苏莱曼尼死，除非苏莱曼尼的死是他设计的，那他就是在自爆。\n这就证明苏莱曼尼的行程美国无法提前很多掌握，估计最多一两天，甚至几个小时，这种临时机会五角大楼不可能把这个和其他选项一起提交，只能是五角大楼对苏莱曼尼有杀意，发现机会以后紧急制定计划，然后提交川普杀还是不杀，所以所谓川普选择不可能选项是假新闻。\n那就是苏莱曼尼的死不仅仅是针对美国大使馆的事的报复，还包括更早的一系列事件，比如几个月前的无人机事件。\n这说明川普的性格有可能推迟报复，而等待较好的时机，而且喜欢斩首行动进行报复。\n所以这次有可能短期内美国不进行报复，但是几天几周几个月内等待时机用斩首行动来报复伊朗。",
			"date_added": 1578494928
		},
		{
			"post_id": 1578724510,
			"body": "伊朗神棍竟然比俄罗斯普京还要脸，真是没想到。当然中共最不要脸是肯定的了。",
			"date_added": 1578724167
		},
		{
			"post_id": 1578726149,
			"body": "那几个匿名的“西方专家”是谁？公布一下，说起来搞笑，专家就是靠名声吃饭的，不是靠只为吃饭的，否则你就该按照李大霄的预测炒股（说起来媒体以后发李大霄言论时也可以写“匿名证券专家”）。",
			"date_added": 1578725805
		},
		{
			"post_id": 1578735047,
			"body": "这张中产确实成问题，有个新闻是医院安检一天没收一把管制刀具十几把水果刀，底下一堆人说不安全啥的，用脚趾头想想也知道不是管制刀具的水果刀杀伤力很小，几乎只适合削果皮，当然是看病人带的。甚至管制刀具有时也就是切西瓜的（不是管制刀具很难切大西瓜）。这种安检主要作用是增加医患矛盾，不是刚刚有个人用拳头把医生打骨折的。",
			"date_added": 1578734702
		},
		{
			"post_id": 1578838500,
			"body": "韩国瑜的得票数不少了，我还以为他会比宋楚瑜更少。",
			"date_added": 1578838154
		},
		{
			"post_id": 1578926711,
			"body": "今天怎么那么多人为“奶奶个腿”抱不平？不就是这帮人拥护得警权无限扩大吗？还是中共上面有什么想法，下面紧跟？",
			"date_added": 1578926364
		},
		{
			"post_id": 1579184124,
			"body": "这个协议的条款还是挺吓人的，真是两年两千亿美金，还是增加量，而且有分项的详细金额。而对应的减税就很少。",
			"date_added": 1579183776
		},
		{
			"post_id": 1579594022,
			"body": "到现在为止，所有已发现的感染病例似乎都是在武汉感染的，所以会不会是和上次兰州布鲁氏症一样，因为公共设施造成的污染传染的？兰州是制药厂烟囱散播病菌，这次也有可能是烟囱或者自来水被污染。如果是市政设施或者国企污染造成的，对于中共来说还真是可防，不过更需要掩盖了。",
			"date_added": 1579593673
		},
		{
			"post_id": 1579597170,
			"body": "另一个可能就是检查太针对到过武汉的人了，可能有很多人已经感染但没有到过武汉，那就更可怕了。",
			"date_added": 1579596820
		},
		{
			"post_id": 1579677455,
			"body": "确诊的很多人是短期去武汉出差，昨晚公布的甚至有前一天去后一天回的人都感染了，还有境外的武汉人被确诊的也不少，说明在武汉被感染的人比例很高，比如菲律宾一人，这几天武汉到菲律宾不可能有上万人，在考虑其他国家数据，感染人数远超到访人数万分之一甚至明显超过千分之一，那么估算武汉上万人（武汉上千万人口）感染应该还算是相当保守的估计。另外似乎不少人提到有相当多感染者发烧温度不高。可能感染者要多很多，最后甚至可能无法彻底控制，成为一种更烈性一些的流感，隔一段时间发一次。",
			"date_added": 1579677104
		},
		{
			"post_id": 1579678544,
			"body": "看了一些研究者的文章和资料，似乎所谓武汉肺炎基因其实是分布在一些被研究者命名为SARS病毒的蝙蝠冠状病毒基因中间的，当然和2003年人感染的SARS病毒还有些距离，说明并不是那次的SARS病毒的直系后代。在命名上其实可以命名为SARS的，当然也可以不命名为SARS。\n中共一开始强调不是SARS，并以此抓人关人，自然只能是新型冠状病毒了。\n上次叫非典也是，因为SARS从理论上确实是以肺炎症状为主，也不是典型肺炎，但是医学实践中一般管那种偶发性没有传染性的肺炎叫做非典，传统的非典象中美这种人口大国每年都有几千几万患者，几乎不传染，可以被用来混淆因中共无能且邪恶引起的SARS大爆发（实际上也起到扩大传染的作用，某些医疗工作者可能误按照以前非典方式，几乎不需要防止传染）。\n中共对语言尤其是名词的污染很厉害，中文使用者不得不防。",
			"date_added": 1579678192
		},
		{
			"post_id": 1579710470,
			"body": "山东的是在舟山染上的。武汉尤其是汉口应该是完全失控了。以这个样子，帝国理工的应该还是太保守（我是说新的4000人的估计）。考虑到低烧人群，感染数量更大。",
			"date_added": 1579710117
		},
		{
			"post_id": 1579763202,
			"body": "世卫组织早被中共渗透了，当然比中共的卫生组织强些，但是强得有限。",
			"date_added": 1579762848
		},
		{
			"post_id": 1579856477,
			"body": "几百人里面有个副厅长。副厅长在武汉市绝对占不到千分之一，连万分之一都不会到（厅级巡视员染病是不会上新闻的）。",
			"date_added": 1579856122
		},
		{
			"post_id": 1579926185,
			"body": "我有个猜想，以现在丧事喜办的套路，武汉市和湖北省的领导可能不会被追责反而有功，估计要升官。现在中共控制下的舆论都在说什么现在不要追责影响防疫，但是SARS在结束后也没有追责（过程中有少量）。而这次宣传的感动总要有人承受，一线大夫太多，估计就是湖北省省委书记省长武汉市市委书记市长勉为其难的作为领导代表承受奖励，升官发财。",
			"date_added": 1579925829
		},
		{
			"post_id": 1580483921,
			"body": "中共这次组织能力保障能力可真够瞧得，除了所谓“辟谣”和抓人比较有力外，也就是养的蛆比较多这一条了。",
			"date_added": 1580483564
		},
		{
			"post_id": 1580486205,
			"body": "现在象北京这样的地方危险并不太大，各种限制很严格，但是其他地方仍然不好说，尤其是湖北。",
			"date_added": 1580485847
		},
		{
			"post_id": 1580570912,
			"body": "微博现在似乎不太会因为骂湖北官员炸号，会因为疫情相关的事情炸号。看起来疫情吃紧，湖北的官员还是有可能事后放弃。",
			"date_added": 1580570553
		},
		{
			"post_id": 1580650429,
			"body": "现在感觉中共在赌两周内解决疫情，如果两周内解决不了，大陆今年经济可能是毁灭性的。",
			"date_added": 1580650069
		},
		{
			"post_id": 1580974474,
			"body": "按照1%的感染率算，武汉有十万人感染，按1%死亡率算，有一千人染病死亡。以10%重症算，重症一万人，仅重症需要的医护人员就要上万。轻症医护也应有上万。湖北省其他重疫区大概又是两三个武汉。\n其他地方死亡率低有可能是因为输入性病例为主，感染率低，医疗力量充足，同时输入性病例重症比例低。\n而武汉已经医疗系统基本上崩溃了，只是在隔离，几乎没有治病和救护。\n有说武汉前期确诊的都是重症，死亡率高，这不准确，举个例子专家组王广发就是比较轻，也很早确诊了，在试剂盒不足时可能偏向的重症，但是更偏向社会地位，所以现在武汉确诊病例增加很多并没有明显拉低死亡率很多。\n当然还有一个因素是如果病毒的一个变异是症状较轻的话，更容易感染跑向外地的武汉人，因为轻症变异在轻症或无症状感染者中比例会比较高。",
			"date_added": 1580974113
		},
		{
			"post_id": 1580974843,
			"body": "附带一个猜想，任何地方感染人数超过一定比例（1%或2%），医疗系统会崩，防疫基本上倒退到1910年伍连德防鼠疫的水平上了（没有治疗手段，只能靠隔离），如果感染比例更高（10%），可能连封城隔离都不能维持。",
			"date_added": 1580974481
		},
		{
			"post_id": 1580997043,
			"body": "如果这次2019conv控制不住，在全世界大规模流行，大概就是西班牙流感那样。",
			"date_added": 1580996680
		},
		{
			"post_id": 1581002836,
			"body": "李文亮医生去世了，34岁，你们可以估计一下武汉现在的死亡率。如果现代医疗体系崩溃，绝不是1%的死亡率。",
			"date_added": 1581002472
		},
		{
			"post_id": 1581149105,
			"body": "我为什么要去核对五毛的发言？真是闲得蛋疼，明明不管他们谈什么都会掺假，甚至不搀真的。",
			"date_added": 1581148740
		},
		{
			"post_id": 1581151436,
			"body": "经过撤侨，武汉还剩多少日本人和美国人？这是关系到死亡率估算的问题。",
			"date_added": 1581151070
		},
		{
			"post_id": 1581153463,
			"body": "我说的死亡率是指待在武汉不管感染没感染的总数，平常大概在每年1%左右，一个月是0.1%上下，如果一个月或者一周到了1%上下，就很恐怖了，可能不仅仅是医疗系统崩溃了。",
			"date_added": 1581153096
		},
		{
			"post_id": 1581156235,
			"body": "特定人物的死亡有统计学上的重大意义，因为没有名字的数字随便造，一天三五个成三五万也也成，任何要公开名字的死亡数字都比较准确。就像姜克实谈抗战初期日军的死亡一样，要在联队所在地方报纸上登阵亡通知，要发抚恤金，没法造假，二战后期一死一大帮，不可能有详细名单登报时数据就不准了。现在武汉的肺炎死亡病例就是很难反应实际情况，地方政府也有造假的动机。而特定无法掩盖的人员死亡，如名人，高官，外国人就是用来倒推真实死亡率的唯一渠道。另外现在这种情况无论是中共中央，湖北省或者是武汉市，都不可能真实的数据了，因为下级肯定要欺骗上级，上级也情愿让下级欺骗。",
			"date_added": 1581155867
		},
		{
			"post_id": 1581223546,
			"body": "中共估计很快的会在词典上把“吹哨人”的定义改成“斯塔西”，周佩仪的事情就是少年斯塔西在行动。",
			"date_added": 1581223177
		},
		{
			"post_id": 1581224416,
			"body": "秋后算账不会对着政府官僚的，只会对着民间质疑官府的人，甚至不能秋后，春天夏天农忙时节就开始算账，就像红会仍然握有掌控所有物资的大权，网上发声的医院会被减少物资一样。",
			"date_added": 1581224046
		},
		{
			"post_id": 1582039645,
			"body": "西班牙流感如果没有那么高的比例感染，估计死亡率也不会那么高。感染率高肯定会引起医疗和护理缺乏，增加很多死亡率。",
			"date_added": 1582039274
		},
		{
			"post_id": 1582434418,
			"body": "希望北京不要爆发吧，感觉北京信息不透明，有可能掩盖疫情，当年SARS1就是这么让北京成为比广东还严重的疫区。",
			"date_added": 1582434046
		},
		{
			"post_id": 1582461670,
			"body": "复工的效果大概需要一周以后，考虑到不可避免的习惯性捂盖子，大概要两周以后才能看到结果。",
			"date_added": 1582461297
		},
		{
			"post_id": 1582462561,
			"body": "维基百科里面说ACE2比较多表达在心脏和肾脏的血管皮肤上，那是不是心脏和肾脏更容易受损？",
			"date_added": 1582462187
		},
		{
			"post_id": 1582519203,
			"body": "好像很多文章认为ACE2表达最多的在消化道。心脏表达不算很多，呼吸系统表达很少，也就是肺泡里有一些表达。但是某些部位某些情况的话会增加表达，以减少局部的血紧张素作用，改善局部供血，可能心血管疾病会增加心血管内壁的表达，吸烟和肺部疾病可能引起肺部表达增加。",
			"date_added": 1582518828
		},
		{
			"post_id": 1582817289,
			"body": "伊朗要完，估计疫情比一个月前的湖北还严重。",
			"date_added": 1582816913
		},
		{
			"post_id": 1582967268,
			"body": "有些焦虑，因为分析了一下，如果北京严控网络封锁疫情，那么如果即使有千分之一人感染，我很可能还不能从日常生活中发现。",
			"date_added": 1582966891
		},
		{
			"post_id": 1583160092,
			"body": "共产党在国内采用极端的方式封锁人员往来来遏制疫情，却不封锁对外通道，输出的病毒导致不少国家疫情比国内非湖北地区还严重。等着大量病毒回流吧。",
			"date_added": 1583159714
		},
		{
			"post_id": 1583160336,
			"body": "等着伊朗疫情导致叙利亚疫情大爆发然后俄罗斯疫情大爆发吧，很可能土耳其也跑不掉。",
			"date_added": 1583159957
		},
		{
			"post_id": 1583161270,
			"body": "温度高冠状病毒传播弱可能跟户外活动有关，病人产生的病毒气溶胶在开放空间稍远距离就没有传播能力，而飞沫除了命中粘膜外在室外就很难传播。室内可以聚集气溶胶，飞沫在桌面也容易被摸到，甚至粘膜因为室内回旋空间小也更容易被飞沫命中。\n如果真的靠高温减少物体表面飞沫中病毒生存时间，那应该得有35度，那样很多人对待在有空调的房子里，环境温度就没有35度了。反而因为密闭环境有利于病毒传播。\n我不是医生，以上全是在推理。",
			"date_added": 1583160890
		},
		{
			"post_id": 1583247032,
			"body": "别的国家不好说，至少我知道美国俄国新加坡的一个月时间不是中国的功劳，是这些国家关闭关口限制中国人入境切断航线争取来的。",
			"date_added": 1583246651
		},
		{
			"post_id": 1583335051,
			"body": "不应该要求在室外普通情况下佩戴口罩，一般情况下非医务人员佩戴个普通口罩（甚至是卫生纸临时做一个）应该就能防住面对面谈话时飞沫直击口鼻粘膜了，防住气溶胶应该很难，普通人应该不需要N95口罩。\n测量体温没有多大意义，最多是测量是否有38度以上的，现在这种测量37.3度的完全是神经病，建议当时出这个主意的可以直接安乐死了。\n非疫区的各地封村封小区都应该取消，基本上应该全部复工，情况比较好的地方应该复课，因为如果我估计的不错，后面会有疫情变严重的时候。\n在没有大过错时不应该因为少数增加病例而撤职官员，那样只会促进瞒报。",
			"date_added": 1583334669
		},
		{
			"post_id": 1583508984,
			"body": "那个sars2分两个型那个文章应该有问题，草率的得出了两个分型毒性强弱不同的结论，而后又看见另一个算专业的人从那论文引申出武汉传播时间长变异大的结论。\n可实际上，那个被认为毒性和传播性强的后出现分型L型，大量被检测出来是12月武汉的数据，那时候检测的应该主要是华南海鲜市场病例，显然是L型传入海鲜市场并迅速传播，在早期生成了大量新的小变异，从图谱上说这个就是大量的小分型，可是这些小分型在未来自然大部分灭绝，只留下少数传播开去。\n而当时S型，应该已经在市场之外的武汉流传开了，所以流传到境外的S型比较多。\n而武汉的数据不可能是传播时间较长的表现，因为武汉大半的数据是12月底的，剩下的大半是1月初的，所有数据都是2月15以前的，甚至2月23日以后也没有大陆的数据了，实际上是传播比较短。\n这些专家真成问题。",
			"date_added": 1583508601
		},
		{
			"post_id": 1583511293,
			"body": "换了昵称，自己画了个头像。",
			"date_added": 1583510909
		},
		{
			"post_id": 1584196776,
			"body": "台湾因为被WHO排斥在外，没有被WHO骗，防疫搞得很好。",
			"date_added": 1584196391
		},
		{
			"post_id": 1584342499,
			"body": "泰国和马来西亚好像也有一定量社区传染了，看来高温的作用并不显著。",
			"date_added": 1584342113
		},
		{
			"post_id": 1584346257,
			"body": "建议大家现在可以松懈一把了，可能这半个月将是疫情爆发以来到年底最可以松懈的日子了。到四五月份，御敌于武汉和境外的方针，将被每天成百上千的输入病例击溃。国内会再次紧绷。",
			"date_added": 1584345870
		},
		{
			"post_id": 1584514688,
			"body": "突然觉得，这个瘟疫是老天降下来惩罚爱开会的人的，尤其是爱开会的老年人。",
			"date_added": 1584514300
		},
		{
			"post_id": 1584537433,
			"body": "我是坚决反对叫中国病毒的，如果叫中国病毒，要是过两年中国再传出去好几种病毒该怎么区分呢？",
			"date_added": 1584537044
		},
		{
			"post_id": 1584540384,
			"body": "当然最傻的是叫“新型冠状病毒肺炎”，你下一种打算叫啥名字？当然这么叫的可能不只是傻，也有坏的。正常的话名字应该带“sars”，因为和SARS相当相似，不少方面可以参考SARS。sars-cov-2这个病毒名字不错，对应的疾病名字如果叫SARS2就好了。",
			"date_added": 1584539994
		},
		{
			"post_id": 1584541009,
			"body": "才发现世界上绝大部分人都生活在上亿人口的国家，而大部分国家人口少于一千万。",
			"date_added": 1584540618
		},
		{
			"post_id": 1584541651,
			"body": "如果温度无效，那么很多穷国可能真的会群体免疫，那么就有数亿感染者，比现在高三四个数量级，而富国的国门恐怕要彻底守不住，也只能跟着群体免疫，可能最高峰有上十亿感染者，甚至每天全球增加上亿感染者，现在基本上就算没有疫情了。",
			"date_added": 1584541259
		},
		{
			"post_id": 1584542319,
			"body": "韩日港台新各国的不同模式能经受高几个数量级的冲击还得再看看，中国的归零模式应该是最容易受不住冲击的。个人猜测，韩日应该再大一两个数量级没问题，港台新估计也能承受大一个数量级的冲击。",
			"date_added": 1584541926
		},
		{
			"post_id": 1584633619,
			"body": "各地疫情从开始社区感染，到发现，一般最少一个月（三天增加一倍，三周增加到一百多，然后发病一周），多的暂时估计为三个月（一周翻番，十周增加一千例，发病两周后发现），但也可能会突破。",
			"date_added": 1584633225
		},
		{
			"post_id": 1584693450,
			"body": "伊朗如果真的到百万级，那么可以说前期几千几万几十万都不算疫情了，很快要进入几百万几千万甚至上亿感染者的阶段了。任何国境线都无法防住病毒了。",
			"date_added": 1584693055
		},
		{
			"post_id": 1584709919,
			"body": "伊朗的病例越报越少，可能是检测能力不足，同理，某些没有病例和很少病例的地方，可能是真的可怕。",
			"date_added": 1584709523
		},
		{
			"post_id": 1584711000,
			"body": "如果伊朗真有一百五十万人因sars2发烧，则5天前应该有一百五十万人感染，以三天翻番估计，应该在二月十三号就有一千五百人感染。感觉略多，当然也有可能，再加上舔墙壁的举动，传染速度有可能比预计的高。",
			"date_added": 1584710603
		},
		{
			"post_id": 1584711746,
			"body": "当然，从伊朗包机回国的三百一十一个人中三十七个阳性来说，伊朗有百万级的感染人数也很有可能。然后是伊拉克叙利亚土耳其黎巴嫩，如果伊朗有上百万，这些地方是不是也会有十万以上的病例？中亚和北非会不会也有十万以上的病例？哪里会不会藏着百万以上没检测的病例？这些上百万的感染者会不会在月底之前翻两三番造成上千万的感染者？",
			"date_added": 1584711348
		},
		{
			"post_id": 1584712059,
			"body": "今天是春分，不知道夏至的时候我们会不会把这时候当作疫情的开始。尤其是中国人（大陆人），很可能现在才是真正疫情的开始，万分之几的感染率（大陆），千分之几的感染率（湖北），百分之几的感染率（武汉），可能对于未来的疫情都不算什么。",
			"date_added": 1584711660
		},
		{
			"post_id": 1584712446,
			"body": "我们对于当前疫情的恐惧，在于我们有核酸检测，有病床，有呼吸机，有ICU，有ECMO，这些东西对于总人口其实是很少的，极容易击穿的。我们的祖先没有这些，所以在百分之一感染时才发现有瘟疫，十分之一感染时才恐惧，大瘟疫往往都是以干掉几分之一人口才结束。",
			"date_added": 1584712046
		},
		{
			"post_id": 1584712797,
			"body": "用核酸检测来确诊是一个很坏的东西，这使疫情估计在核酸检测不足的地方完全失效。这个好像是中共开的头。",
			"date_added": 1584712396
		},
		{
			"post_id": 1584714232,
			"body": "你们猜，部级领导在国外留学的儿子回国，北京市敢不敢让他自费集中隔离？局一级呢？",
			"date_added": 1584713830
		},
		{
			"post_id": 1584858513,
			"body": "现在中国人已经不接受中国政府瞒报疫情的说法了，甚至开始向着不接受sars2病毒中国起源的说法进发，我估计是中国有一种感染大脑的病毒在大流行。",
			"date_added": 1584858110
		},
		{
			"post_id": 1584948995,
			"body": "上海每天入关7千，全国大概几万，每天输入病例几十，可以假设全球6百万人感染，当然也可能没那么多，只有跟中国联系比较紧密的地方和人群感染率高。",
			"date_added": 1584948591
		},
		{
			"post_id": 1585021608,
			"body": "74?咋一天就翻番了？而且多地都是境外输入关联，从概率上说，大概可能多地有不关联境外的传播了。比较安全的时间可能都等不到4月了。也许这次是群体免疫的开始。",
			"date_added": 1585021203
		},
		{
			"post_id": 1585291293,
			"body": "今天报的少了点，五十多例，不过有一例本地传播的。",
			"date_added": 1585290887
		},
		{
			"post_id": 1585402594,
			"body": "耿爽的爷爷是耿飙？那确实爽。",
			"date_added": 1585402187
		},
		{
			"post_id": 1585478710,
			"body": "今天境外输入44例，减少可能跟前几天开始的封国措施有关，中共在疫情之初反对别国的国境防疫，最终引起全世界不可收拾的大流行，所以后来迟迟未开始封国（当然也跟有些有权势的人还未回国有关），现在输入病例过于汹涌，终于不要脸了。不过这种封国措施可能减少合法途径入境，但也可能造成非法途径入境的增加，造成更加不可控形式的可能性。\n另外就是河南的本土传播，根据网上信息其实是有好几例了，只是找各种理由认为无症状，所以不确诊，这一例是郏县传漯河，漯河可以甩锅才爆出来的。有一例从数学上推论，这一条传播链上估计十例或更多，同时应该在多个地方有类似情况未曝出，以全国三十多省，三四百市，三四千县来说，估计有十处算是很低的估计了，估计这一例公开以后会有一部分爆出来。",
			"date_added": 1585478302
		},
		{
			"post_id": 1585583927,
			"body": "口罩能够防住一部分传染路径，但既不是控制疫情的充分条件，也不是必要条件。在口罩供应充足时，鼓励民众戴口罩是对防疫比较方便的有效措施之一。",
			"date_added": 1585583518
		},
		{
			"post_id": 1585807997,
			"body": "从昨天起开始计算无症状起，报告时间就都推迟很久，今天到了14点还没见到全国数据。",
			"date_added": 1585807587
		},
		{
			"post_id": 1585817335,
			"body": "湖北每天减少300无症状，增加只有几十，看起来再有几天就会先于其他省份无症状清零了。",
			"date_added": 1585816924
		},
		{
			"post_id": 1586067899,
			"body": "前几天我发完贴的第二天，报告时间就提前到了上午这几天都是了，而且武汉无症状清零趋势也戛然而止。",
			"date_added": 1586067487
		},
		{
			"post_id": 1586091397,
			"body": "今天广东增加了五例本土，竟然没有攒到和其他省份一起发布。",
			"date_added": 1586090984
		},
		{
			"post_id": 1586157833,
			"body": "本土传播的病例应该以后会经常有了。",
			"date_added": 1586157419
		},
		{
			"post_id": 1586597293,
			"body": "现在广东每天都在新增本地传播病例，估计有多个来源的社区传播，很可能大半在广州。广州可能是大陆下一波最先爆的地方。我估计现在广州有传染能力的未掌握病人应该还不到一百。现在毕竟人们还比较小心，大概翻番应该在五天以上，但是肯定有其他地方比如广东其他地方，其他省份或境外继续输入。估计一条线到一百人怎么也会爆了，如果警惕点甚至会在一条线10人的情况下爆出来。另外就是广州如果到了上百人，应该会隔几天就有感染者去外地。",
			"date_added": 1586596878
		},
		{
			"post_id": 1586681799,
			"body": "九十七例可以甩全锅的和两例可以甩半锅的。",
			"date_added": 1586681383
		},
		{
			"post_id": 1586787451,
			"body": "感觉塞尔维亚的病例增加速度超过克罗地亚，克罗地亚超过斯洛文尼亚，不过斯洛文尼亚在病例占人口比例超过克罗地亚和塞尔维亚，应该是斯洛文尼亚离意大利太近，而且有部分领土原属于意大利，所以意大利人多的缘故，克罗地亚的达尔马提亚和伊斯特里亚半岛也和意大利联系较紧密，所以早期病人较多。",
			"date_added": 1586787034
		},
		{
			"post_id": 1586790511,
			"body": "塞尔维亚的增速快大概和贝尔格莱德人口密度高造成传染快有关，贝尔格莱德的居住密度感觉像中国城市，塞尔维亚的农村也住的比邻国密，山区也少。斯洛文尼亚主要是个山国，人口密度较低。",
			"date_added": 1586790093
		},
		{
			"post_id": 1586790565,
			"body": "看了下所谓的“入关学”，大概就是老赤匪生了小赤佬。",
			"date_added": 1586790146
		},
		{
			"post_id": 1586790779,
			"body": "方舱医院真神奇，第一不是方的，第二没舱，第三不算医院。",
			"date_added": 1586790359
		},
		{
			"post_id": 1587104811,
			"body": "武汉那个改数字，病亡核增上千，其中大部分对应治愈出院核减，将近一千。是说很多病人没了就当出院，没发现是被殡仪馆拉走吗？而且这个数字好巧呀。",
			"date_added": 1587104390
		},
		{
			"post_id": 1587195145,
			"body": "入关学可能其实是加速主义的一个流派，或者会最终被当作加速主义的流派。虽然现在还是观察者网的宠儿，过两天在墙内外臭了也许也会像nmslese一样被指责为加速主义者伪装，毕竟当年出征观察者网一直是当作正面典型的（当年马前卒（托派工业党兼共党甜菊达人（这几个能兼容很不容易，毕竟工业党是国家社会主义倾向，中共是斯大林的私生子，跟托洛斯基不太兼容）观察者网的重要头目之一）还曾说委内瑞拉大搞教育很快就工业化，过了一年委内瑞拉去工业化了，删帖删博转头说委内瑞拉搞选举搞福利搞垮了，民主有害）。确实加速主义者和极端派中国人不好分清，不过以极端派中国人的产量之高，加速主义者之罕见，绝大多数多数类似活动的参与者应该是极端派中国人。",
			"date_added": 1587194723
		},
		{
			"post_id": 1587223854,
			"body": "长期佩戴口罩可能对心肺功能又不太好的影响，应该控制佩戴口罩的总时长和一次连续佩戴的时长。",
			"date_added": 1587223431
		},
		{
			"post_id": 1587395607,
			"body": "原来很可能良渚石家河龙山老虎山等文化都是因为4.2千年事件衰落灭亡的，同时洛阳盆地最先恢复，同时稳定的掌握了青铜器制造技术（也可能是稳定掌握了青铜矿），填补了空白，也造成了中国文化相对单一。",
			"date_added": 1587395183
		},
		{
			"post_id": 1587564581,
			"body": "创造负原油价格的竟然是中国银行？",
			"date_added": 1587564156
		},
		{
			"post_id": 1587565224,
			"body": "4.2千年事件时，中国南涝北旱，可能也是二里头崛起的原因，因为洛阳盆地在中间。",
			"date_added": 1587564798
		},
		{
			"post_id": 1587649417,
			"body": "一些年以前，医学主流就说，感冒和寒冷无关，冬天感冒多是因为人们因为天冷而更多的待在室内，造成传染机会增加。\n但是现在同样是呼吸道疾病sars2传播，医学主流竟然赞同政府将民众关在室内，而不是放出到室外尤其是野外，又是为什么？",
			"date_added": 1587648990
		},
		{
			"post_id": 1587711161,
			"body": "广州的数字证明肯定有不少跳出密切接触者圈子的感染者。如果这些是孤立的单一轻症感染者，那么如果一周翻番的话，大概一个半月后病例到几十例，有几例群聚有较重症状，引起医疗系统警觉。",
			"date_added": 1587710733
		},
		{
			"post_id": 1588690612,
			"body": "SARS2死亡对于个体来说主要是免疫系统过度反应造成的，我估计SARS2对于社会造成的死亡应该主要是防疫部门过度反应造成的，次生灾害死亡可能会比病死的多不少。",
			"date_added": 1588690183
		},
		{
			"post_id": 1588692473,
			"body": "大部分官僚（包括所有国家的），都喜欢把人关在家里的防疫政策，虽然这个政策造成社会巨大的损失，也可能对防疫反而有害（就是我说过的在室内更容易传染），但是官僚们会坚持，因为官僚的最擅长工作方式把人当作囚犯来管理（另外，监狱是最适合SARS2大流行的场所）。",
			"date_added": 1588692043
		},
		{
			"post_id": 1588930017,
			"body": "后清没入关就蓄发剪辫子了，中共卫健委通知低风险地区校园不需要戴口罩，已经发生几起学生猝死的案例了。",
			"date_added": 1588929586
		},
		{
			"post_id": 1589618979,
			"body": "清华北大对外籍入学取消笔试，女拳师开始从冠性权转战全面喷婚驴，肖战粉丝的强势活动，各地农村开始大规模合村并居，中文网络上文革已经神圣不可侵犯，中美脱钩在中共的外交和宣传努力下迅速推进，同时中共要把多收的关税退回，加上各种稀奇古怪的防疫措施，感觉最大的加速主义者应该就是习近平了。",
			"date_added": 1589618547
		},
		{
			"post_id": 1589621217,
			"body": "说实在的，估计中国人能指望的也只剩下加速主义了，前一阵家里老人看《天涯热土》，我说那剧太假了，到六十年代还没有粮票，竟然得到回应是认为粮票更晚出现，那可是经历过那个时代的人，记忆完全被中共重塑一遍，至于小屁孩更是容易解决了，所以冒出这么多热爱文革的小屁孩。",
			"date_added": 1589620784
		},
		{
			"post_id": 1590763134,
			"body": "李克强穷则减税说实话，达则互联网金融。",
			"date_added": 1590762700
		},
		{
			"post_id": 1590764783,
			"body": "以前在中国能更容易说真话的时候，有些中共退休的老部长经常对媒体对他以前分管的部委应该怎么做提出一些很好的方向，不过他们在职的时候既没有这样说也没有这么做。就像真有两头牛那个笑话一样。",
			"date_added": 1590764348
		},
		{
			"post_id": 1591284365,
			"body": "现在放开摆摊很奇怪，如果原因不奇怪就很可怕了。让人想起“三自一包”了。",
			"date_added": 1591283929
		},
		{
			"post_id": 1592026239,
			"body": "三文鱼传播SARS2？中共是想拿诺贝尔生物奖？明显就是已经广泛传播了，部分是症状轻了，部分是有瞒报。",
			"date_added": 1592025802
		},
		{
			"post_id": 1592110204,
			"body": "这次明显是某个向北京供应蔬菜或肉的地方已经疫情泛滥，新发地的商贩往往要每天往返北京和供应地，而且往往是供应地出身的，所以感染SARS2，然后在市场传播，因为运货卖货工作重，病情严重的商贩就被留在老家，在北京的商贩往往病情不重，而被传染的北京人比如那两个研究所的人感染以后病情重就去北京的医院就诊，于是疫情被发现。",
			"date_added": 1592109766
		},
		{
			"post_id": 1592233367,
			"body": "突然想到，如果三文鱼被污染，那么被感染者主要应该是爱吃生鱼片的北京白领而不是批发三文鱼的商户（批发商户总不会舔生鱼吧，也不会舔案板，可是吃生鱼片的人不可能不咀嚼三文鱼），这些人一定像肉类研究中心的工作人员一样，发烧了就去发烧门诊看病，而不是像新发地商户一样数十人发烧一周以上都没人去医院。现在北京应该有几百上千甚至上万人发病挤满各种发热门诊。\n这种事没发生，说明几乎不可能是三文鱼被污染。\n当然需要做熟的肉类比如猪牛羊可能性更大（因为这可以解释为什么没有大量食客被感染），但和新发地外地商户输入一样，不能甩锅国外。",
			"date_added": 1592232928
		},
		{
			"post_id": 1592579346,
			"body": "北京公布三个病例基因序列虽然都属同一支，但是各不相同，应该是流传了一定时间，可能在一个月以上。",
			"date_added": 1592578906
		},
		{
			"post_id": 1593442137,
			"body": "看到了新闻：\n\"#动画片因人物染发被举报# 有观众近日反映 在播动画《菲梦少女2》“价值导向有问题，不应提倡头发染成五颜六色，穿得花里胡哨的还在舞台上表演换装”。湖南广电表示，该片传递正能量，制作公司为帮助观众快速分辨角色，而将人物头发设计不同颜色，并非提倡染发，在播频道第一时间停播该片，整改问题。\"\n感觉现在加速主义在中国处于主导地位，我很高兴，加速加速不要停！",
			"date_added": 1593441696
		},
		{
			"post_id": 1593443022,
			"body": "中国人都很懂什么是中共喜欢的，站在中共一边的，而不会管纸面上的逻辑。比如中共公布了禁止诽谤烈士的法律，又封李文亮为烈士，按理说李文亮中共党员，所作所为仔细看下来应该也符合中共的“红专”标准，可是粉红七字党什么的就是敢骂李文亮，中共到现在为止也没抓一个七字党粉红啥的。你从正常逻辑想不通，从中国逻辑一想就通了。举报动画片那事和官方反应也是这么回事。",
			"date_added": 1593442580
		},
		{
			"post_id": 1593445331,
			"body": "最近武汉金凰的事也很刺激，不过武汉洪峰一般七月才开始，那才真的刺激。",
			"date_added": 1593444888
		},
		{
			"post_id": 1593860412,
			"body": "印度是俄罗斯的小弟，中国是俄罗斯的干儿子，差着辈分，中国对叔叔不敬，俄罗斯恼了，出来执行家法，用统治东方来羞辱干儿子。",
			"date_added": 1593859968
		},
		{
			"post_id": 1594130588,
			"body": "难道又是公共汽车司机故意把车开到水里？",
			"date_added": 1594130143
		},
		{
			"post_id": 1594390246,
			"body": "七月这几天是比较暴力血腥的，五号凤翔无差别砍死两个，六号淮安砍死两个警察，九号赤峰老年公寓八十一老头砍死三个人，再加上七号把车开到水库淹死好几十口子的。可能还有没怎么报道的，而且大部分明显和失业无关的，估计主要是被防疫政策憋坏的。",
			"date_added": 1594389800
		},
		{
			"post_id": 1595144824,
			"body": "好像不少hub节点不足，经常出问题。",
			"date_added": 1595144377
		},
		{
			"post_id": 1595145186,
			"body": "这些天的新闻天天都很刺激，都评论不过来了。",
			"date_added": 1595144738
		},
		{
			"post_id": 1595146754,
			"body": "只要美国豁得出去中美关系，总有办法打击中国——暴锤中国人；只要中国豁得出去中美关系，总有办法反制美国——暴锤中国人。",
			"date_added": 1595146305
		},
		{
			"post_id": 1595424358,
			"body": "保定的事竟然是曾外祖父带着舅爷爷为了表舅去打曾外孙女一家。",
			"date_added": 1595423908
		},
		{
			"post_id": 1596343262,
			"body": "《海南自贸港国际互联网数据专用通道获批》《发展劳动密集型产业 拓展就业机会》，怎么说呢，体制内负责决策的人危机感要比自干五强多了，虽然作死不断，死到临头还是有感觉的。",
			"date_added": 1596342811
		},
		{
			"post_id": 1596344856,
			"body": "在近未来，中共肯定会给海南很多政策，所以在实行之后，海南独立是个对海南很好的选择，不然等收回后比香港会惨很多。",
			"date_added": 1596344404
		},
		{
			"post_id": 1597469154,
			"body": "委内瑞拉靠伊朗原油快成长期操作了，虽然我仍然不信计划经济能使撒哈拉短缺沙子，但是社会主义确实能使产油国短缺原油。",
			"date_added": 1597468701
		},
		{
			"post_id": 1598704851,
			"body": "以后中共的数字货币就是粮票布票啥的，每一分钱都被规定好用途，规定买粮的买不了布。",
			"date_added": 1598704397
		},
		{
			"post_id": 1601898127,
			"body": "阿塞拜疆的无人机可能只是起到侦察引导炮击并检验战果的作用，因为不少视频能看出炸弹是从侧面攻击的。\n亚美尼亚的苏氏战法过时了，从碾压一方变成了被碾压一方。\n从阿塞拜疆的优势和提出的高要求来看，阿塞拜疆是有备而来，应该是主动开战的一方。",
			"date_added": 1601897672
		},
		{
			"post_id": 1601901054,
			"body": "苏式战法基本上就是二战主流战法加上部分中东战争经验，主要问题是被各种新的战法所针对，比如著名的伊拉克人把坦克埋沙子里的传闻其实就是指苏式的坦克掩体（但是中国人当时都没认出来，可想而知中国连苏式战法都没学好），这种掩体很容易被拥有热成像设备的空中侦察发现，尤其容易被空中火力摧毁。",
			"date_added": 1601900598
		},
		{
			"post_id": 1608438431,
			"body": "最近中共宣传机器似乎减少了对spacex的报道，少量报道中贬低的意味更浓了，而各种新闻评论中，吹捧中共的技术水平，贬低其他地方技术水平（尤其是美国（我又想起刘夙当年贬低页岩油时主要论据是美国没有创新能了，这些年后，老深红小粉红冲上来了，刘夙却放弃了几年前的立场反而去嘲笑小粉红了）），可能时间节点快到了。",
			"date_added": 1608437974
		},
		{
			"post_id": 1608439029,
			"body": "关于SpaceX有一点是以前来自中共航天部门的贬低声几乎不见了，借SpaceX要求中共增加拨款的呼声增加了不少，大概专业人员总是拉不下脸皮是太离谱的胡话。附带说一下，考虑到中国今年的发射次数之大，而且没有像starlink这样的纯商业发射，中共对航天拨款应该是非常巨大的。",
			"date_added": 1608438571
		},
		{
			"post_id": 1608447998,
			"body": "另外关于美国登月，欧阳自远被骂也是这个原因。作为航天专业人员，说美国登月假就太丢脸，同时也不利于向上要钱。当然自媒体的五毛和自干五之类就没有这种顾虑，他们是不接受中共控制下工业实际上仍然只是一个跟随者，一个美国工业主导下的配合者的事实，因为接受了的话中共的一切倒行逆施就都只能解释成中共的刮地皮了，他们的一生只能是可笑的。",
			"date_added": 1608447539
		},
		{
			"post_id": 1610778582,
			"body": "新谢泼德估计也蹦踏不了多久了，就算starship再推迟，三五年后也能载人了，估计票价不会比新谢泼德贵太多，甚至有可能更便宜，100公里高自由落体和到达第一宇宙速度入轨绕几圈之间区别可太大了。",
			"date_added": 1610778122
		},
		{
			"post_id": 1613131050,
			"body": "最近大陆的人如果能打疫苗就要争取打。我算了一下，以灭活疫苗的产量，估计一年也未必够给一半大陆人打两针的，弄不好一针都不到，灭活疫苗效果不很强烈，很难说是否够半年有效的。这么算下来，只够少数人打，那打了绝对就是赚到了。",
			"date_added": 1613130589
		},
		{
			"post_id": 1620561565,
			"body": "胡锡进和环球时报这事真好玩。",
			"date_added": 1620561103
		},
		{
			"post_id": 1630337526,
			"body": "现在中共全力攻击美国，感觉误解了世界局势，可能世界秩序搭便车的如果拒绝承认搭便车，可能就是这个样子吧。\n比如阿富汗，拿到了很多大单，还拿下了矿山，还自诩建设阿富汗，接着暗中支持塔利班，可实际上只有阿富汗原政府会承认那些，不要指望塔利班和伊斯兰国会承认那些合同。",
			"date_added": 1630337063
		},
		{
			"post_id": 1630338567,
			"body": "阿富汗的局势未来会很疯狂，伊斯兰国和塔利班之间会发生混战，俄国和伊朗可能会缓过神来开始支持代理人，巴基斯坦有可能会自食恶果。",
			"date_added": 1630338103
		},
		{
			"post_id": 1630340763,
			"body": "阿富汗四面都是国家。\n东边是中国，但是只有瓦罕走廊，偏远狭窄，初期乱局对中国影响小。\n西边是伊朗，边界比较长，也不算太荒凉，初期对伊朗影响较大，但是伊朗是什叶派占多数，而且阿富汗到伊朗的难民移民应该以达利语为主，可能北方哈扎拉塔吉克和喀布尔中产为主，长期来看也容易控制。伊朗如果重新支持赫拉特的波斯人军阀就可以建立缓冲区。\n北面三个中亚斯坦国，如果塔利班或伊斯兰国得手，早晚被渗透，俄罗斯南部也会被影响，解决之道就是在兴都库什山以北扶植北方联盟建立缓冲区，只要堵住萨朗山口，问题解决一大半。但是西面需要伊朗代理人控制赫拉特堵死绕过兴都库什山的道路。长期来看如果没有建立缓冲区可能会比伊朗惨。\n南面巴基斯坦，虽然现在塔利班是其代理人，但是极端主义者如果得势，很难不向外输出革命，如果发生三面被堵，南面是唯一的方向。而且边境是普什图族聚居区，说普什图语的南部普什图人如果流亡多在此区域，时间长了必然引发普什图斯坦问题。如果伊斯兰国得势则巴基斯坦更危险。\n中国和阿富汗直接国境线虽短，但是和中亚斯坦国边界长，而且两边都是同一民族，如果俄国北线失守，情况比较严重。和巴基斯坦国界也不短，但是多山地，如果南线巴基斯坦失守，对中国直接影响不大，不过中国联巴制印的如意算盘就会全盘落空。",
			"date_added": 1630340298
		},
		{
			"post_id": 1632063792,
			"body": "感觉现在决断的能力很重要，普京这次在阿富汗的时间窗口内没有反应，以后再也没机会了，而巴基斯坦三军情报局则很果断，迅速的结束了这个时间窗口。\n拜登虽然撤军搞得不好，但是撤军后坚决不管也很决绝，这一点对美国未来战略有利，而且撤军的失败对于美国彻底放弃阿富汗也更有效果。",
			"date_added": 1632063326
		},
		{
			"post_id": 1632064328,
			"body": "维基百科这次也算是决断了，而且在时间窗口内。",
			"date_added": 1632063861
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "那个香蕉以前都叫黄金神棍，后来被封转世也主要叫各种神棍，所以应该简称神棍。",
			"post_uri": "14ytAKDfNjArMTqGecTi7ginG3aZTsRAum_1529072766",
			"date_added": 1529121892
		},
		{
			"comment_id": 2,
			"body": "@Nzg: 是说川普的两千亿美金加税。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1529416800",
			"date_added": 1529672440
		},
		{
			"comment_id": 3,
			"body": "@Nzg: 可能打掉你两千亿的出口。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1529416800",
			"date_added": 1529672482
		},
		{
			"comment_id": 4,
			"body": "让老挝人替代美国人养活中国人。",
			"post_uri": "1BphMmzmrPc3zawVj6ES9va18a6PxJqb47_1530177844",
			"date_added": 1530326718
		},
		{
			"comment_id": 5,
			"body": "根据阿姨理论，中国大一统都是内亚外力输入的结果，如果没有外力输入，想大一统的人也有心无力，会有好几个想统一的势力割据一方，时间长了就分开了。",
			"post_uri": "14ytAKDfNjArMTqGecTi7ginG3aZTsRAum_1530163364",
			"date_added": 1530452262
		},
		{
			"comment_id": 6,
			"body": "但是南方的宗族势力还在，是他们三十年都不愿意彻底消灭吗？不是，是他们三十年都消灭不掉。",
			"post_uri": "14ytAKDfNjArMTqGecTi7ginG3aZTsRAum_1530158973",
			"date_added": 1530453299
		},
		{
			"comment_id": 7,
			"body": "毕竟华老栓华小栓甚至红眼睛阿义都不会攻击夏瑜的家属“吃人血馒头”。",
			"post_uri": "14ytAKDfNjArMTqGecTi7ginG3aZTsRAum_1530620758",
			"date_added": 1530714750
		},
		{
			"comment_id": 8,
			"body": "@Polar🍀☘️🌿🌾🌴: 是游戏二周目还是看视频二周目？",
			"post_uri": "14ytAKDfNjArMTqGecTi7ginG3aZTsRAum_1531334029",
			"date_added": 1531395822
		},
		{
			"comment_id": 9,
			"body": "这个太悲观，小粉红没那么大危害，因为它们都非常卑鄙自私下流懒惰怯懦，真正要干大坏事，必须无私高尚勇敢坚强。小粉红的身体会比脑子诚实，脑子会比嘴巴诚实。小粉红是再怎么洗脑，也是幸存者的后代，行为模式会让党大吃一惊手足无措。",
			"post_uri": "14ytAKDfNjArMTqGecTi7ginG3aZTsRAum_1531753898",
			"date_added": 1531831247
		},
		{
			"comment_id": 10,
			"body": "一个重要的漏洞是，最先引入苏联势力的是陈炯明，孙中山勾结苏联最初是为了对抗陈炯明，苏联在两人之中选了孙中山，陈炯明搬起石头砸自己的脚。",
			"post_uri": "14ytAKDfNjArMTqGecTi7ginG3aZTsRAum_1531761103",
			"date_added": 1531831503
		},
		{
			"comment_id": 11,
			"body": "@Wuyun: 这是一个整体的解决方案，西方不是一个个体，实际上西方是一些容易相互交流却不容易统一的地区，会产生多种解决方案，而且不会因政治原因产生唯一解决方案，如果在新疆农人主要吃面包，说明从撒哈拉到新疆的西方人都发现这一整套方案是最优解，这一最优解在中国北方（中国南方的最优解和印度一样是米饭）也是成立的。另外，有糟粕但是要去糟粕显然需要能分辨糟粕，能分辨糟粕的前提深入的实践那一套，如果你已经深入实践了，你就不需要学了。用微博上老刘在德克萨斯的类似说法（记不清他详细的语言了）学生是不可能分辨老师和课本的精华和糟粕的，只能全盘接受，等到学习实践层次够了，才谈得到精华糟粕问题。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1531832422",
			"date_added": 1531915739
		},
		{
			"comment_id": 12,
			"body": "@Eaglex: 个人认为是的。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1531832422",
			"date_added": 1532002309
		},
		{
			"comment_id": 13,
			"body": "@Polar🍀☘️🌿🌾🌴: 我对于恐怖游戏一般也是看视频。",
			"post_uri": "14ytAKDfNjArMTqGecTi7ginG3aZTsRAum_1531334029",
			"date_added": 1532695800
		},
		{
			"comment_id": 14,
			"body": "@猫叉酱（小号）: 产量那么高，完啥蛋，你干脆说美国亡了得了。你还是去医院看看吧。刘夙症状就比你轻，把那些当年鬼话都不提起，我在微博每年@他一回他都装死。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1532702044",
			"date_added": 1532760565
		},
		{
			"comment_id": 15,
			"body": "@Wuyun: 准确的说地方在水下，土壤还在山上。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1533816976",
			"date_added": 1533901251
		},
		{
			"comment_id": 16,
			"body": "@Mylifewaiting: 骑术好，骑兵总量大。燕代两地也有大量骑术好的骑兵，两次彭城被攻陷时这两地也恰好也在刘邦一方。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1534064747",
			"date_added": 1534077755
		},
		{
			"comment_id": 17,
			"body": "哪有中国国民这种东西，被外人当作中国国民的那若干群人也从来不会普遍一致性。",
			"post_uri": "14ytAKDfNjArMTqGecTi7ginG3aZTsRAum_1534152296",
			"date_added": 1534163123
		},
		{
			"comment_id": 18,
			"body": "@Wuyun: 妇字的甲骨文是枝节，主要说的是妇后面跟的字。另外妇字在甲骨文时代可能和帚字同音，在中古汉语里两字还是同韵的。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1534172816",
			"date_added": 1534336092
		},
		{
			"comment_id": 19,
			"body": "@Walllling: 不一定，比如甲骨文“来”本来是“麦”字，因为同音，被借为来，然后在旧的字下面加了一个手表示麦。这类还有很多，比如北原来表示背，莫本来表示暮等等。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1535888523",
			"date_added": 1535897240
		},
		{
			"comment_id": 20,
			"body": "@Ukeki: 就是被媒体称赞的报复措施，对中国自己的伤害可能更大。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1536147951",
			"date_added": 1536420206
		},
		{
			"comment_id": 21,
			"body": "@Hellome: 就阴谋论来说，谁搞都可能出纰漏。对于阴谋打击刘强东来说，不管腾讯和阿里，让刘强东逃回国内都是失策，而这个事情可以通过提前报案防止。我个人认为强奸或仙人跳最可能。阴谋论最符合的是党国，但是党国无法保证美国一个市里警察会不会放人。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1536484796",
			"date_added": 1536501753
		},
		{
			"comment_id": 22,
			"body": "@Mv00🐰🐶💡: 不只是地下水，更要命的是雨水，焦家遗址在济南附近。所以西北延续时间比较长，周朝都有相当的量，山东在焦家遗址（大汶口）就开始转变了。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1537278353",
			"date_added": 1537279339
		},
		{
			"comment_id": 23,
			"body": "@Mv00🐰🐶💡: 其实西北的窑洞不错，到现在当地人都很喜欢，到处都是。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1537278353",
			"date_added": 1537279504
		},
		{
			"comment_id": 24,
			"body": "@Mv00🐰🐶💡: 石器时代的屋顶就是草，到商朝宫殿的房顶也还是茅草。导水也只能解决很小的雨，就是到当代地铁站地下室防汛都是大问题。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1537278353",
			"date_added": 1537280586
		},
		{
			"comment_id": 25,
			"body": "@Mv00🐰🐶💡: 这点我知道的。不过中国大陆的工业如果不是投诚的恰逢其时，大陆工业不是恰好很落后，是不可能在投诚后获得这么大发展的。而且投诚不止一回，邓那次投诚才建交并真的得到大量技术，邓的南巡讲话也是一次假装投诚，江朱也装作投诚才混入WTO的。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1537605131",
			"date_added": 1537622683
		},
		{
			"comment_id": 26,
			"body": "可是粉红海豚还是粉红里面一支重要力量。想想也有道理，粉红海豚觉得有个强大的祖国才能对外国人有面子，同时只有国内老百姓过不好他们才能对中国人有面子，中共恰好能满足他们这两方面的需求。如果中共暗示他们可以回国成为非老百姓，就更可以满足他们的需求了。",
			"post_uri": "1BphMmzmrPc3zawVj6ES9va18a6PxJqb47_1537615162",
			"date_added": 1537623364
		},
		{
			"comment_id": 27,
			"body": "@Mv00🐰🐶💡: 自古以来酷吏都是后面一波杀前面一波，总是不断绝的。以前和一个好朋友感叹前三十年一个运动接一个运动，前一个运动打别人的后一个运动被人打，现在这个朋友瑞典的事蹦得挺欢，大概觉得要紧跟党中央搞运动。",
			"post_uri": "1BphMmzmrPc3zawVj6ES9va18a6PxJqb47_1537615162",
			"date_added": 1537669137
		},
		{
			"comment_id": 28,
			"body": "@Mv00🐰🐶💡: 我是说大多数人就这个样子，至少多数中国人就这个样子，不会接受啥历史教训的，见到好处就上，不会管背后危险的。",
			"post_uri": "1BphMmzmrPc3zawVj6ES9va18a6PxJqb47_1537615162",
			"date_added": 1537672937
		},
		{
			"comment_id": 29,
			"body": "@Mv00🐰🐶💡: 可能可以算，中国内部几个部分差异还是很大的，最大的一致性就是经常被同一统治者统治。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1538745216",
			"date_added": 1538810279
		},
		{
			"comment_id": 30,
			"body": "中国外交部主要职能是情报吧，这也是周恩来当年管外交的主要原因。另一个工作是对内宣传，是由部长发言人大使来干的（他们太外围干不了情报） 和胡锡进是同行，就是现在的外交天团使劲折腾的原因。",
			"post_uri": "1BphMmzmrPc3zawVj6ES9va18a6PxJqb47_1538803055",
			"date_added": 1538810528
		},
		{
			"comment_id": 31,
			"body": "@Mv00🐰🐶💡: 有个相当庞大的部门是外交部和情报部门双重领导，他们是周恩来的铁杆。",
			"post_uri": "1BphMmzmrPc3zawVj6ES9va18a6PxJqb47_1538803055",
			"date_added": 1538811595
		},
		{
			"comment_id": 32,
			"body": "@猫叉酱（小号）: 新疆只有数百万汉人，内地有十几亿汉人，容纳的下。中国内地有十几亿人，世界其他地方只有几十亿人，而且文化不同，很难容纳这么多难民。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1539489437",
			"date_added": 1539533214
		},
		{
			"comment_id": 33,
			"body": "@Mv00🐰🐶💡: 开始畜牧比例高，人口密度低，牧地很多，会有很多猎物和家畜提供肉类蛋白质。耕作和畜牧对于家庭来说没有出产高低之分，差距是需要的土地多少不同。实际上是人口增加才耕地不足，而且能在耕地不足情况下继续人口增加。人如果只吃主食和蔬菜，会缺乏蛋白质死人的，通过大豆可以补充蛋白质，至少不会死人。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1539869636",
			"date_added": 1539874669
		},
		{
			"comment_id": 34,
			"body": "简单的说，大豆不是当饭吃的，是当肉吃的。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1539869636",
			"date_added": 1539874713
		},
		{
			"comment_id": 35,
			"body": "原来在长庆干的。估计是长庆时犯了事，也不知道自己跳的还是推的。",
			"post_uri": "1BphMmzmrPc3zawVj6ES9va18a6PxJqb47_1541243726",
			"date_added": 1541246792
		},
		{
			"comment_id": 36,
			"body": "@Yuzu: 有钱人买高楼，但是基本上租给别人住，自己住矮的小楼。高楼住着有很多不方便。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1541515584",
			"date_added": 1541679904
		},
		{
			"comment_id": 37,
			"body": "@Eaglex: 天子本身就是来自北方的威胁。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1542034548",
			"date_added": 1542036106
		},
		{
			"comment_id": 38,
			"body": "@Eaglex: 用来指代洛阳一带。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1542637757",
			"date_added": 1542639789
		},
		{
			"comment_id": 39,
			"body": "@Mv00🐰🐶💡: 民国含义是和帝国王国对应的，主权在帝就是帝国，在王就是王国，主权在民就是民国。共和国是和君主国含义对应的。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1542637757",
			"date_added": 1542641917
		},
		{
			"comment_id": 40,
			"body": "@Solaire: 谢谢。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1544277803",
			"date_added": 1544342950
		},
		{
			"comment_id": 41,
			"body": "沉痛悼念Delphi",
			"post_uri": "14ytAKDfNjArMTqGecTi7ginG3aZTsRAum_1545979358",
			"date_added": 1545998813
		},
		{
			"comment_id": 42,
			"body": "当时我听了莫斯科广播电台的中文广播，是那个灰暗的日子里的一抹亮色。",
			"post_uri": "1BphMmzmrPc3zawVj6ES9va18a6PxJqb47_1546107460",
			"date_added": 1546236163
		},
		{
			"comment_id": 43,
			"body": "@Ihoi: 那就是没有觉醒。",
			"post_uri": "1BphMmzmrPc3zawVj6ES9va18a6PxJqb47_1547033171",
			"date_added": 1547038921
		},
		{
			"comment_id": 44,
			"body": "@Ihoi: 所以要反对统一，如果只反对中共那就是为反共而反共了。中共是大一统主义的果，就像专制是中共的果。你想要大一统，就会限制各地人民，就会有人反抗，你就觉得需要强有力的政府政党军队强人来统治才能镇压反抗，于是就有了残暴的专制政府和贪婪的独裁者，他们可以统一为借口压迫你。",
			"post_uri": "1BphMmzmrPc3zawVj6ES9va18a6PxJqb47_1547033171",
			"date_added": 1547046066
		},
		{
			"comment_id": 45,
			"body": "@虚无之主: 韩国有几个仇视所有韩国人的？且不说那几个都是反对韩国的。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1547967489",
			"date_added": 1547989651
		},
		{
			"comment_id": 46,
			"body": "@Mytesd: http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1KLQ5p24RZxxuSXJqG6FSGzMYy4rXSa8Bi/1551099480\n这个有图。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1551006468",
			"date_added": 1551100253
		},
		{
			"comment_id": 47,
			"body": "@Mytesd: 新浪微博上有人转。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1552098123",
			"date_added": 1552146945
		},
		{
			"comment_id": 48,
			"body": "@Tommykakashi: 生活用品工业原料紧缺价格飞涨和工业产品滞销降价同时发生。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1552098123",
			"date_added": 1552398563
		},
		{
			"comment_id": 49,
			"body": "不会的，匪和费拉共同的观念里，不讲信用就是机智，残暴就是勇敢，维尼熊的形象还是太正直，会让小匪和费拉有快要亡国的感觉。",
			"post_uri": "14ytAKDfNjArMTqGecTi7ginG3aZTsRAum_1553072743",
			"date_added": 1553084308
		},
		{
			"comment_id": 50,
			"body": "发送失败。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1553182673",
			"date_added": 1553182832
		},
		{
			"comment_id": 51,
			"body": "@Mytesd: 还有养老项目被骗然后上黑名单的例子，似乎是一同被骗的有人上访。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1553783612",
			"date_added": 1553872638
		},
		{
			"comment_id": 52,
			"body": "@猫叉酱（小号）: 郭平也吹过吧，海思最近蹦跶的也欢。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1558450271",
			"date_added": 1558617158
		},
		{
			"comment_id": 53,
			"body": "@公共: 以前发现电视剧审查最严，电影次之，小说审查很松。网络版比纸质版松，现在发现移动端可能更严，说明约通俗的审查越严。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1562247530",
			"date_added": 1562336659
		},
		{
			"comment_id": 54,
			"body": "所以毛片反党可能可行。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1562247530",
			"date_added": 1562337159
		},
		{
			"comment_id": 55,
			"body": "@猫叉酱（小号）: 三和大神只是同龄人中的一小撮，连富士康打工的也只是一小撮，多数都在期待着有地位少干活多挣钱的职位。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1563096710",
			"date_added": 1563194597
		},
		{
			"comment_id": 56,
			"body": "@瓶子: 你觉得香港没向内地开放？",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1564312191",
			"date_added": 1564407218
		},
		{
			"comment_id": 57,
			"body": "@Lidong: 不只是吸引资本，搞到外汇，搞到禁运物资，对外进行渗透。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1564312191",
			"date_added": 1564407440
		},
		{
			"comment_id": 58,
			"body": "@瓶子: 那就只有东京了。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1564907914",
			"date_added": 1565010535
		},
		{
			"comment_id": 59,
			"body": "@瓶子: 地震比当抄家灭门好太多了，毕竟金融家也没长富裕脑袋。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1564907914",
			"date_added": 1565012144
		},
		{
			"comment_id": 60,
			"body": "@Mylifewaiting: 川普一般不那么表述，他一点也不白左。我觉得他就是觉得把香港这个口子封上贸易战就好打了。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1565102221",
			"date_added": 1565268508
		},
		{
			"comment_id": 61,
			"body": "发送失败了。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1570720070",
			"date_added": 1570720522
		},
		{
			"comment_id": 62,
			"body": "@Unicom: 中外媒体对这次口头协议有一点共识，就是没有谈及华为。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1571061011",
			"date_added": 1571147766
		},
		{
			"comment_id": 63,
			"body": "@猫叉酱（小号）: 可能是毛派？",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1572267333",
			"date_added": 1572532710
		},
		{
			"comment_id": 64,
			"body": "@猫叉酱（小号）: 那是很早的了，主要是我说的第一波。最近这一波可是主要发生在习近平上台后，不知道为什么，也没有发现习近平特别喜欢日本。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1574266774",
			"date_added": 1574431723
		},
		{
			"comment_id": 65,
			"body": "@编号0527: 有呀，如果占了九成其实现在就可以直接全民勇武派。占了八成大概特首立法会拿下的概率很大，占七成还有机会，六成选票就很困难了。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1574686694",
			"date_added": 1574776519
		},
		{
			"comment_id": 66,
			"body": "这个没发成功。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1574777205",
			"date_added": 1574778028
		},
		{
			"comment_id": 67,
			"body": "@编号0527: 用tor了，zeronet的端口早就映射不上了。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1574778306",
			"date_added": 1574856970
		},
		{
			"comment_id": 68,
			"body": "@编号0527: 其实我对zerome的细节还不太了解，不过我猜回复发送时也会把主贴再发送一次，也可能是发新帖时会把所有贴都发送一次。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1574777205",
			"date_added": 1574857385
		},
		{
			"comment_id": 69,
			"body": "@编号0527: 以后估计是日常消息？",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1574861936",
			"date_added": 1574862769
		},
		{
			"comment_id": 70,
			"body": "@猫叉酱（小号）: 那就让习近平和川普到深圳来谈贸易战，席上摔杯为号将两人拿下，然后给任正非黄袍加身，拥立为地球皇帝。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1575385641",
			"date_added": 1575465417
		},
		{
			"comment_id": 71,
			"body": "@Unicom: 如果盈利水平大幅下降，股市应该会大跌吧。如果经济衰退，上市企业盈利水平应该会下降。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1576942167",
			"date_added": 1577017287
		},
		{
			"comment_id": 72,
			"body": "@Falconixx: 我觉得热战概率不大，因为各方都豁不出去。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1576943015",
			"date_added": 1577017367
		},
		{
			"comment_id": 73,
			"body": "hub节点有很少了。没发出去。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1578726149",
			"date_added": 1578732548
		},
		{
			"comment_id": 74,
			"body": "@猫叉酱: 对p民警权其实还算有限，虽然比盖世太保或特高课大一些，但是比契卡小多了。对于权贵几乎是全无警权，在规则上，县委书记县警动不了，市委书记市警动不了，在实际上，地位较高的官员或者官太太打执法的警察已经是项惯例了。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1578926711",
			"date_added": 1579013826
		},
		{
			"comment_id": 75,
			"body": "@Unicom: A股好操作。经济就不好操作了。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1580650429",
			"date_added": 1580972957
		},
		{
			"comment_id": 76,
			"body": "@猫叉酱（小号）: 实际上中共近期处理很多问题都采取拖的方式。而且当年sars也是使用同一方式应对。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1580974843",
			"date_added": 1580996481
		},
		{
			"comment_id": 77,
			"body": "@Weowk: 实际上虽然喊老龄化，但老人比例还是低，大部分是中青年，所以中国年死亡率低于1%，官方公布的一年死亡人数不到1000万，就是0.7%。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1581153463",
			"date_added": 1581222049
		},
		{
			"comment_id": 78,
			"body": "@Hnk: 如果日本能到百万级，中国每天输入病例至少得上百。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1584693450",
			"date_added": 1584694934
		},
		{
			"comment_id": 79,
			"body": "@龍龖龘: 有可能。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1585021608",
			"date_added": 1585115780
		},
		{
			"comment_id": 80,
			"body": "@猫叉酱（小号）: 带久了受潮容易滋生细菌真菌。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1585583927",
			"date_added": 1585807493
		},
		{
			"comment_id": 81,
			"body": "@柒月落雪: 你好",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1586157833",
			"date_added": 1586781488
		},
		{
			"comment_id": 82,
			"body": "@龍龖龘: 瞒报没啥，病死的不算病人很正常瞒报，病死的算治愈出院就很那啥的瞒报操作了，当然可能是病人已经上报，结果死亡，人数太多，想瞒报，又没有住院病人（可能有部分死在家里，但是后期病人都要入院），结果就上报出院。想一想医院终于有床位了，要把以前的重症接入院，结果发现病人已经火化，于是就上报治愈出院的场景。另外就是正好50.02%，可以猜想一下是少报了还是多报了。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1587104811",
			"date_added": 1587186930
		},
		{
			"comment_id": 83,
			"body": "有人认为是在北京流传一两个月，但是还有一种可能，就是在其他地方流传，这个地方对新发地的输入较大。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1592579346",
			"date_added": 1592579520
		},
		{
			"comment_id": 84,
			"body": "错了，可能也和失业有关，公共汽车司机据报道当地公共汽车司机私营时五千一月，国营了三千一月，疫情来了以后一两千一月，等于是大半失业。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1594390246",
			"date_added": 1594447921
		},
		{
			"comment_id": 85,
			"body": "@猫叉酱（小号）: 不比中国的油差，这次的油不是用来勾兑的，是用来发电的。有些说法你们外行都知道，但是在委内瑞拉干活的中石油的人从没听说，这些说法是外行特供。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1597469154",
			"date_added": 1598704855
		},
		{
			"comment_id": 86,
			"body": "@猫叉酱（小号）: 美国登月当然是真的，我是谈中国航天人的心态，如果你注意，你会发现他们主流态度和小粉红自干五类似，但是在登月态度上却不同于小粉红自干五主流，主要的两个原因，一是专业脸面二是利益。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1608447998",
			"date_added": 1609651581
		},
		{
			"comment_id": 87,
			"body": "@森本三郎: 对于智障马上拉黑。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1630340763",
			"date_added": 1635916409
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "14ytAKDfNjArMTqGecTi7ginG3aZTsRAum",
			"user_name": "Polar🍀☘️🌿🌾🌴",
			"date_added": 1528461032
		},
		{
			"follow_id": 2,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "13aB79mzuRLgDYzQthn9wzycjw77WyDXh6",
			"user_name": "Polar",
			"date_added": 1528461039
		},
		{
			"follow_id": 4,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj",
			"user_name": "Nofish",
			"date_added": 1528461446
		},
		{
			"follow_id": 5,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ",
			"user_name": "P2P",
			"date_added": 1528461555
		},
		{
			"follow_id": 6,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "16bpvKnuiVmHqmLGZKke2Rf4XWaZ5e7ZhB",
			"user_name": "🐲J🐰a🐒d🐍",
			"date_added": 1530795926
		},
		{
			"follow_id": 7,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1BphMmzmrPc3zawVj6ES9va18a6PxJqb47",
			"user_name": "Mv00🐰🐶💡",
			"date_added": 1536420351
		},
		{
			"follow_id": 8,
			"hub": "1ABFCaadiEa3bFNzN3RcCZSsviqMNTbz3m",
			"auth_address": "14hDHtMYjJfvyTk9uaMWeFmvLjSEZRgGYG",
			"user_name": "Numberworship",
			"date_added": 1545387252
		},
		{
			"follow_id": 9,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj",
			"user_name": "ZeroLSTN",
			"date_added": 1545387497
		},
		{
			"follow_id": 10,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh",
			"user_name": "Kaffie",
			"date_added": 1546234789
		},
		{
			"follow_id": 11,
			"hub": "1White24UrrwQrD86o6Vrc1apgZ1x1o51",
			"auth_address": "1NNH8kJywadat5cvjhUvoPtL6PxVJXLGrH",
			"user_name": "Chenjia404",
			"date_added": 1546235284
		}
	]
}