{
	"title": "Noticias Libres (Free News) ",
	"description": "Información libre para un mundo libre",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 15,
	"demo": false,
	"modified": 1474490721,
	"post": [
		{
			"post_id": 14,
			"title": "Esto es todo lo que Edward Snowden reveló en un año de filtraciones de alto secreto",
			"date_published": 1474489754.377,
			"body": "<img src=\"http://i0.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot108.jpg?resize=1024%2C577\">\n\nEn junio de 2013, The Guardian informó de la primera filtración de documentos de alto secreto que Edward Snowden, entonces de 29 años de edad, robó de la Agencia de Seguridad Nacional (NSA). En ese momento, Snowden trabajaba como contratista de inteligencia para Booz Allen Hamilton en Hawaii.\n\nEsa filtración ciertamente no sería la última. En los años siguientes, los periodistas han lanzado más de 7,000 documentos de alto secreto que Snowden les confió, los cuales algunos creen son menos del 1% de todo el archivo.\n\n---\n\nSnowden descargó hasta 1.5 millones de archivos, de acuerdo con funcionarios de inteligencia nacional, antes de volar desde Hawai a Hong Kong para reunirse con los periodistas GlennGreenwald y Laura Poitras. Después de que él entregó su tesoro de documentos, voló de Hong Kong y más tarde se quedó varado en Moscú. Su futuro estaba lejos de ser cierto, ya que los periodistas de su confianza comenzaron a revelar sus secretos.\n\nAquí está todo lo que las filtraciones de Snowden revelaron entre 2013 y 2014:\n\nCon una orden judicial de alto secreto, la NSA recoge los registros telefónicos de millones de clientes de Verizon. – 6 de junio 2013\n\nLa NSA accedió y recolectó datos a través de puertas traseras en las empresas estadounidenses de Internet como Google y Facebook con un programa llamado **“Prism”**. – 7 de junio 2013\n\n<img src=\"http://i2.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot077.jpg?w=626\">\n\nUn memorando presidencial de 18 páginas muestra que Obama ordenó a funcionarios de inteligencia que elaboraran una lista de destinos en el extranjero para ataques cibernéticos. – 7 de junio 2013\n\nDocumentos revelan el programa “Boundless Informant” de la NSA que da a la agencia la capacidad casi en tiempo real para entender la cantidad de cobertura de inteligencia que existe en ciertas áreas a través del uso de un “mapa de calor“. – 8 junio 2013\n\n<img src=\"http://i0.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot078.jpg?w=602\">\n\nLa NSA estaba hackeando computadoras en Hong Kong y China continental, algunos de los cuales eran sistemas militares. – 13 de junio 2013\n\nEl GCHQ británico (que es la agencia de inteligencia) interceptó comunicaciones telefónicas y de internet de los políticos extranjeros que asistieron a dos reuniones del G-20 en Londres en 2009. – 16 de junio 2013\n\nProcedimientos de alto secreto muestran los pasos que la NSA debe tomar para localizar y recoger datos de “personas no estadounidenses” y cómo se debe reducir al mínimo los datos recogidos de los ciudadanos estadounidenses. – 20 de junio 2013\n\nEl GCHQ británico escuchó en cables de fibra óptica (Mastering The Internet) para recoger y almacenar los mensajes globales de correo electrónico, mensajes de Facebook, historiales de internet y llamadas, y luego compartió los datos con la NSA. – 21 de junio de 2013\n\n<img src=\"http://i1.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot079.jpg?w=514\">\n\nLa NSA tiene un programa con nombre en código EvilOlive que recoge y almacena grandes cantidades de metadatos de Internet en EE.UU., los cuales contienen solamente cierta información sobre el contenido en línea. Los metadatos de correo electrónico, por ejemplo, revelan las direcciones del remitente y del destinatario y el tiempo, pero no el contenido o el asunto. – 27 de junio 2013\n\n<img src=\"http://i2.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot080.jpg?w=409\">\n\nHasta el año 2011, el gobierno de Obama permitió continuar con la recolección de grandes cantidades de metadatos de correo electrónico e Internet de los estadounidenses bajo un programa de la NSA de la era Bush llamado Stellar Wind. – 27 de junio 2013\n<img src=\"http://i1.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot081.jpg?w=645\">\n\nEl gobierno de Estados Unidos colocó micrófonos ocultos en las oficinas de la Unión Europea en Nueva York, Washington y Bruselas. – 29 junio 2013\nEl gobierno de Estados Unidos espió al menos a 38 embajadas y misiones en el exterior, usando una variedad de métodos de vigilancia electrónica (incluído uno llamado DROPMIRE). – Junio 30,2013\n\n<img src=\"http://i1.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot082.jpg?w=460\">\n\nLa NSA espió en millones de llamadas telefónicas, correos electrónicos y mensajes de texto de ciudadanos alemanes ordinarios. – Junio 30, 2013\nUsando un programa llamado Fairview, la NSA intercepta Internet, las llamadas telefónicas y los datos de los ciudadanos brasileños. – 6 julio 2013\n\n<img src=\"http://i0.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot083.jpg?w=444\">\n\nEstaciones de monitoreo establecidas en Australia y Nueva Zelanda ayudan a alimentar la base de datos del programa Xkeyscore de la NSA. – 6 julio 2013\n\n<img src=\"http://i0.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot084.jpg?w=490\">\n\nLa NSA conduce vigilancia de ciudadanos en varios países latinoamericanos, entre ellosVenezuela, Colombia, Argentina, Panamá, Ecuador, Perú, y otros. La agencia también solicitó información sobre el petróleo, la energía y el comercio. – 9 de julio de, 2013\n\nEl Washington Post publicó una nueva diapositiva que detalla “Upstream” el programa de la NSA para la recolección de comunicaciones de las empresas de tecnología a través de cables de fibra óptica para alimentar también el contenido de su base de datos Prism. – 10 de julio 2013\n<img src=\"http://i0.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot085.jpg?w=560\">\n\nEl Servicio Federal de Inteligencia de Alemania, BND, ayuda a contribuir a los datos del programaXkeyscore de la NSA. – 20 de julio, 2013\n\nLos analistas de la NSA, utilizando el programa Xkeyscore, pueden buscar a través de enormesbases de datos de correos electrónicos, chats en línea, y los historiales de navegación de losobjetivos. – 31 de julio 2013\n<img src=\"http://i0.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot086.jpg?w=460\">\n\nEl gobierno de Estados Unidos pagó al GCHQ británico más o menos $ 155 millones en tres años para obtener acceso e influencia sobre sus programas de espionaje. – Agosto 1 2013\n\nSiete de las empresas de telecomunicaciones más importantes del mundo (Vodafone Cable[Gerontic], Verizon Business [Dracon], BT [Remedy], Level 3 [Little], Global Crossing[Pinnage], Viatel [Vitreous]) proporcionan al GCHQ acceso secreto, ilimitado a su red de cables submarinos. – 2 de agosto 2013\nLa NSA proporcionaba vigilancia a diplomáticos de Estados Unidos con el fin de darles ventaja en las negociaciones en la Cumbre de las Américas de la ONU. – 2 de agosto 2013\n\n<img src=\"http://i0.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot087.jpg?w=476\">\n\nLa NSA examina cuidadosamente enormes cantidades de comunicaciones por correo electrónico y de texto a los estadounidenses que entran y salen del país. – 8 de agosto de, 2013\n\nUn documento interno de la NSA revela un “vacío legal” que permite una puerta trasera secretapara la agencia a buscar sus bases de datos de mensajes de correo electrónico de ciudadanos de Estados Unidos y llamadas telefónicas sin orden judicial. – 9 de agosto de, 2013\n\nSegún los informes, la colección de la NSA en Japón se mantiene en la misma prioridad queFrancia y Alemania. – 12 de agosto de, 2013\n\nLa NSA rompió las reglas de privacidad miles de veces al año, de acuerdo con una auditoría interna. – 15 de agosto 2013\n\nSe reveló que los analistas de la NSA habían a veces espiado por intereses de amor, haciéndolo tan comúnmente como para haber acuñado el término LOVEINT o interceptar el amor. (No está claro si este informe provino de documentos de Snowden.) – 23 de de agosto de, 2013\n\nEl Reino Unido opera una estación secreta en Internet de monitoreo en Oriente Medio para interceptar mensajes de correo electrónico, llamadas telefónicas, y el tráfico de Internet,reporta The Independent, citando documentos de Snowden. Snowden niega haber dado a The Independent cualquier documento, alegando que el gobierno del Reino Unido los filtró en un intento de desacreditarlo. – 23 de de agosto de, 2013\n\nEl “presupuesto negro” ultra secreto de la inteligencia de EE.UU. es revelado para 2013, con 16 agencias de espionaje que tiene un presupuesto de $ 52.6 millones. – 29 de agosto 2013\n\n<img src=\"http://i0.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot088.jpg?w=632\">\n\nAmpliando los datos recogidos del “presupuesto negro”, la NSA es encontrada de estar pagandocientos de millones de dólares cada año a las empresas estadounidenses por el acceso a sus redes. – 29 de agosto 2013\nLos EE.UU. llevó a cabo 231 ataques cibernéticos ofensivos en 2011. – 30 agosto 2013\n\nLa NSA hackeó el sistema de comunicaciones interno de la red de medios con sede en Qatar, Al Jazeera. – 31 de agosto 2013\n\nLa NSA espió a la ex presidente de Brasil, Dilma Rousseff, y al presidente de México, Enrique Peña Nieto (entonces candidato). – 1 septiembre 2013\nUsando un ataque de “hombre en el medio”, la NSA espió a Google, al Ministerio de Asuntos Exteriores francés, a la Sociedad para las Telecomunicaciones Financieras Interbancarias Mundiales, y a la petrolera brasileña Petrobras. – 2 septiembre 2013\n\nUn “presupuesto negro” de la inteligencia de Estados Unidos , reveló el esfuerzo de Al Qaeda porinterferir, hackear, y / o derribar aviones no tripulados de vigilancia de Estados Unidos. – 3 de septiembre de, 2013\nUna investigación conjunta de ProPublica, The New York Times y The Guardian encuentra que la NSA está ganando la guerra contra el cifrado de Internet con superordenadores, conocimientos técnicos, y órdenes judiciales. – 5 septiembre 2013\n\nLa NSA tiene la capacidad de acceder a los datos de usuario de la mayoría de los teléfonos inteligentes más importantes en el mercado, incluyendo Apple iPhones, BlackBerrys y teléfonos Google Android. – 7 de septiembre de, 2013\nLa NSA comparte datos de inteligencia (con información sobre los ciudadanos estadounidenses)con Israel por un acuerdo de intercambio de información. – 11 de septiembre de 2013\n\nLa NSA vigila a bancos y entidades de crédito para una amplia base de datos que puede rastrearel flujo global de dinero. – 16 septiembre 2013\nEl GCHQ británico lanzó un ataque cibernético contra Belgacom (con las herramientas NOCTURNAL SURGE, PENTAHO y HACIENDA), una empresa belga de telecomunicaciones en parte propiedad del Estado. – 20 septiembre 2013\n\n<img src=\"http://i2.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot089.jpg?w=578\">\n\nLa NSA espió sobre diplomáticos indios y otros funcionarios, en un esfuerzo para comprender mejor los programas nucleares y espaciales del país. – 23 septiembre, 2013\n\nLa página web interna “wiki” de la NSA caracteriza a la oposición política y jurídica a los ataques con aviones no tripulados como parte de “campañas de propaganda” de los “adversarios” de Estados Unidos. – 25 septiembre 2013\nDesde 2010, la NSA ha utilizado metadatos incrementados con otros datos de fuentes públicas, comerciales y de otro tipo para crear gráficos sofisticados que se asignan a las conexiones sociales de los estadounidenses. – 28 de septiembre 2013\n\n<img src=\"http://i2.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot090.jpg?w=541\">\n\nLa NSA almacena una enorme cantidad de metadatos de los usuarios de Internet,independientemente de si están en la mira, durante un máximo de un año en una base de datos llamada Marina. – 30 de septiembre 2013\n<img src=\"http://i1.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot091.jpg?w=619\">\n\nVEROEFFENTLICHUNG NUR NACH RUECKSPRACHE MIT CHEFREDAKTION\n\nLa NSA y GCHQ trabajaron juntos para poner en peligro la red de navegación web anónima TOR. – 4 octubre 2013\n<img src=\"http://i1.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot092.jpg?w=449\">\n\nLa agencia de inteligencia de señales de Canadá, CESC, espió las redes de telefonía e informática del Ministerio de Minas y Energía de Brasil y compartió la información con los “Cinco Ojos” los servicios de inteligencia de los EE.UU., Canadá, Gran Bretaña, Australia y Nueva Zelanda. – 7 de octubre, 2013\n\n<img src=\"http://i0.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot093.jpg?w=503\">\n\nLa NSA recogió más de 250 millones de listas de contactos de correo electrónico de servicios como Yahoo y Gmail. – 14 octubre 2013\n\nLa vigilancia de la NSA fue revelada por desempeñar un papel clave en la selección de aviones no tripulados en el extranjero. – 16 de octubre 2013\n\nLa NSA espió a ciudadanos franceses, empresas y diplomáticos, y monitoreó las comunicaciones de la embajada de Francia en Washington y su oficina de la ONU en Nueva York. – 21 de Octubre del 2013\n\nLa NSA pinchó el teléfono móvil de la canciller alemana, Angela Merkel. – 23 de octubre 2013\n\nLa NSA espió a los ciudadanos italianos, empresas y funcionarios del gobierno. – 24 octubre 2013\n\nLa NSA vigiló las llamadas telefónicas de 35 líderes mundiales y animó a otras agencias gubernamentales a compartir las “agendas electrónicas” de los políticos extranjeros con las cuales podría vigilarlos. – 25 de octubre 2013\n\nLa NSA espió a líderes y ciudadanos españoles. – 25 de octubre 2013\n\nLa NSA estaciona equipos de vigilancia en 80 lugares de todo el mundo. – 27 de octubre 2013\n\nUn programa conjunto entre la NSA y el GCHQ británico llamado Muscular infiltra y copia el flujo de datos fuera de los centros de datos en el extranjero de Yahoo y de Google. Una diapositiva alardeaba de “SSL agregado y eliminado aquí!” con una cara sonriente. – 30 octubre 2013\n\n<img src=\"http://i2.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot094.jpg?w=590\">\n\nLa NSA espió al Vaticano. (El sitio web Panorama no citó Snowden como la fuente.) – 30 octubre2013\nEl servicio de inteligencia de Australia cuenta con equipos de vigilancia colocados en las embajadas australianas alrededor de Asia y el Pacífico. – 31 de octubre 2013\n\nUn documento revela que las empresas de tecnología juegan un papel clave en los informes de inteligencia de la NSA y la recopilación de datos. – Noviembre 1,2013\n\nGCHQ de Gran Bretaña y otras agencias de espionaje europeas trabajan juntas para llevar a cabola vigilancia de masas. – Noviembre 1,2013\n <img src=\"http://i2.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot095-1.jpg?w=460\">\n\nLas misiones estratégicas de la NSA son reveladas, las cuales incluyen la lucha contra el terrorismo y la proliferación nuclear, así como la búsqueda estadounidense de ventaja diplomática y económica. – 2 noviembre 2013\nLa Dirección General de Defensa de Señales de Australia y la NSA trabajaron juntos para espiar aIndonesia durante una conferencia de cambio climático de la ONU en 2007. – 2 noviembre 2013\n\nLa NSA espió a la OPEP. – 11 de noviembre de 2013\nEl GCHQ vigila los sistemas de reserva de 350 hoteles de alta gama con un programa llamadoRoyal Concierge, el cuál husmeó para confirmar las reservas enviadas a direcciones de correo electrónico diplomáticas que serían marcadas para una vigilancia adicional. – 17 de noviembre2013\n<img src=\"http://i2.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot096.jpg?w=627\">\n\nLa DSD de Australia espió los teléfonos celulares de los altos funcionarios de Indonesia, incluido el presidente, la primera dama, y varios ministros del gabinete. – 18 de noviembre 2013\n\nLa NSA espió millones de llamadas de teléfonos celulares en Noruega en un período de 30 días. –19 de noviembre, 2013\n\nEl gobierno británico llegó a un acuerdo secreto con la NSA para compartir los registros de teléfonos, de Internet y de correo electrónico de los ciudadanos del Reino Unido. – 20 de noviembre, 2013\n<img src=\"http://i2.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot097.jpg?w=494\">\n\nUn documento de la estrategia de la NSA revela el objetivo de la agencia para adquirir datos de“cualquier persona, en cualquier momento y en cualquier lugar” y ampliar sus ya amplios poderes legales. – 22 de noviembre 2013\n\nLa NSA infectó a más de 50,000 redes de ordenadores en todo el mundo con un malware diseñado para robar información sensible. – 23 de noviembre 2013\n\nLa NSA recoge evidencia de visitas a sitios web pornográficos como parte de un plan para desacreditar a los yihadistas musulmanes. – 26 de noviembre 2013\n\nTrabajando con la inteligencia canadiense, la NSA espió a diplomáticos extranjeros en las cumbres en Toronto G-8 y G-20 en 2010. – 28 de noviembre 2013\n\nEl servicio de inteligencia de los Países Bajos recopila datos sobre los usuarios de los foros web ylos comparte con la NSA. – 30 noviembre 2013\n\nUn proyecto de documento revela que Australia se ofreció a compartir la información recogida delos ciudadanos australianos ordinarios con la NSA y otros socios de los “cinco ojos”. – Diciembre 1, 2013\n\nLa NSA desvía miles de millones de registros de localización de teléfonos celulares extranjera a su base de datos. – 4 de diciembre 2013\nEl espionaje generalizado es revelado en Italia, con el espionaje de la NSA sobre los italianos ordinarios, así como diplomáticos y líderes políticos. – 5 diciembre 2013\n\nSe reveló que la inteligencia sueca espiaba a los líderes rusos, y luego pasaba la información a la NSA. – 5 diciembre 2013\nUn documento revela el alcance de la relación entre la NSA y sus contrapartes de Canadá, que incluye el intercambio de información y a Canadá permitiendo a los analistas de la NSA acceso a sitios encubiertos. – 9 diciembre 2013\nAgentes de inteligencia con la NSA y GCHQ se infiltran en los videojuegos en línea, tales como “World of Warcraft” en un esfuerzo para coger y detener tramas terroristas. – 9 diciembre 2013\n\nGracias a “cookies” en línea adquiridas por Google que los anunciantes utilizan para realizar un seguimiento de las preferencias del consumidor, la NSA es capaz de localizar nuevos objetivos para el hacking. – 10 de diciembre 2013\nLa NSA tiene la capacidad de descifrar el cifrado A5/1 común de teléfono celular. – 13 de diciembre 2013\nLa NSA pagó en secreto a la firma de seguridad informática RSA $ 10 millones para implementar una “puerta trasera” en su cifrado. – 20 diciembre 2013\nUn documento revela cómo el GCHQ británico espió a Alemania, Israel, la Unión Europea y varias organizaciones no gubernamentales. – 20 diciembre 2013\n\nCon un programa de investigación de $ 79.7 millones de dólares, la NSA está trabajando en un ordenador cuántico que sería capaz de romper la mayoría de los tipos de cifrado. – Enero 2, 2014\nUsando transmisores de radio en pequeñas placas de circuito o unidades USB, la NSA puede obtener acceso a los ordenadores que no están conectados a Internet. – 14 enero 2014\nLa NSA recoge “casi todo lo que puede” en la recolección no selectiva de mensajes de texto para su base de datos externa “Dishfire”. – 16 de enero 2014\n<img src=\"http://i0.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot098.jpg?w=563\">\n\nLa NSA recoge los datos personales extraídos de aplicaciones para teléfonos inteligentes, como Angry Birds. – El 27 de de enero de, 2014\nUn programa del GCHQ llamado “Squeaky Dolphin” vigila YouTube, Facebook y Blogger para “elmonitoreo extendido en tiempo real de la actividad en línea.” – 27 de enero de, 2014\n<img src=\"http://i2.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot099.jpg?w=402\">\n\nLa NSA espió a los negociadores durante la conferencia sobre el cambio climático de la ONU 2009 en Copenhague, Dinamarca. – 29 de enero 2014\nCESC, la Agencia de Criptología Nacional de Canadá, puso a prueba un programa piloto con la NSA que capturó los metadatos de los usuarios que habían iniciado sesión en el aeropuerto a través de la conexión Wi-Fi gratuita. – 30 de enero 2014\n\nEl GCHQ británico le declaró la guerra a los grupos de hackers como Anonymous y Lulzsec,montando ataques distribuidos de denegación de servicio e infiltrándose en sus salas de chat. – 5 febrero 2014\n\nSe reportó que la NSA vigiló al ex canciller alemán Gerhard Schröder en el período previo a la guerra de Irak. – 5 febrero 2014\nEl GCHQ británico utiliza “trucos sucios“, tales como virus informáticos y “honey traps” sexuales para apuntar adversarios. – 7 febrero 2014\n\nEl programa de “asesinato selectivo” estadounidense de aviones no tripulados se basa principalmente en los metadatos del teléfono móvil y la geolocalización, no en la inteligencia humana sobre el terreno. – 10 de febrero 2014\n\nUn bufete de abogados estadounidense fue vigilado por la Dirección de Señales de Australia, mientras representaba al gobierno de Indonesia durante una disputa comercial. – 15 febrero 2014\n\nLa NSA y el GCHQ británico según los informes vigilaron el tráfico al sitio web WikiLeaks yconsideraron una medida para controlar las comunicaciones que van desde o hacia WikiLeaks y The Pirate Bay. – 18 de febrero 2014\nGCHQ lleva a cabo operaciones encubiertas para interrumpir y dar forma al discurso en línea. –24 de febrero de, 2014\nEl GCHQ utilizando un programa llamado “Optic Nerve“, intercepta y almacena imágenes de webcam de millones de usuarios de Yahoo, luego, las hace llegar a la base de datos Xkeyscore de la NSA. – 28 de de febrero 2014\n<img src=\"http://i1.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot100.jpg?w=484\">\n\nLa NSA compartió inteligencia que ayudó a la marina holandesa a capturar un barco secuestrado por piratas en aguas de Somalia, y los Países Bajos regularmente comparte información con la NSA relacionada con Somalia y Afganistán. – 5 marzo 2014\nLa NSA tiene una columnista similar a “Dear Abby” quien escribe una columna “Ask Zelda”distribuida en la red interna de la agencia. – 7 marzo 2014\n<img src=\"http://i2.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot101.jpg?w=414\">\n\nLa NSA desarrolló sofisticados “implantes” de malware para infectar millones de ordenadores en todo el mundo. En un ejemplo, la NSA se hizo pasar por un servidor Facebook para infectar el ordenador de un objetivo y robar archivos. – 12 de marzo 2014\n\n<img src=\"http://i0.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot102.jpg?w=602\">\n\nUn documento revela que, si bien muchos gobiernos extranjeros comparten información con la NSA, algunos altos funcionarios fuera de la esfera de inteligencia o defensa tienen algún conocimiento de ello. – 13 de marzo 2014\nLa NSA construyó un sistema capaz de grabar el “100%” de las llamadas telefónicas de un país extranjero con un programa de intercepción de voz llamado “Mystic”. El Washington Post no nombró a los países en los que se utilizó el programa. – 18 de marzo 2014\n\n<img src=\"http://i2.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot103.jpg?w=496\">\n\n<img src=\"http://i1.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot104.jpg?w=590\">\n\n La NSA apunta específicamente a los administradores de sistemas extranjeros para obtener acceso a sus redes. – Marzo 20, 2014\n\n<img src=\"http://i1.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot105.jpg?resize=338%2C225\">\n\nLa NSA supervisó de cerca a la firma de tecnología china Huawei en un intento de revelar las relaciones entre la empresa y el ejército chino. La agencia también espió a los bancos chinos y otras empresas, así como al ex presidente Hu Jintao. – 22 marzo 2014\n\nLa dirección política de Malasia es un objetivo de inteligencia de alta prioridad para los EE.UU. y Australia – 30 de marzo 2014\n\nLa NSA y el GCHQ discutieron diversos métodos de engaño, el uso de propaganda de masas, mensajería, y lanzar historias en sitios de medios sociales – 4 de abril 2014\n\nEl Servicio de Inteligencia de Noruega está desarrollando un superordenador, llamado Steel Winter, para descifrar y analizar los datos de Afganistán, Rusia, y otros lugares. – 26 de abril2013\n\n<img src=\"http://i1.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot106.jpg?w=540\">\n\nGCHQ pidió a la NSA “acceso no supervisado” a grandes bases de datos de la NSA. No está claro sila petición fue concedida. – 30 de abril, 2014\nLa NSA intercepta físicamente enrutadores, servidores y otros equipos de red de computadora antes de que sean exportados fuera de los EE.UU., implanta “puertas traseras“, herramientas de vigilancia, y luego los reempaca con un sello de la fábrica y los envía fuera. – 12 de mayo, 2014\n\nLa NSA está interceptando, grabando y archivando prácticamente todas las llamadas del teléfono móvil en las Bahamas y otro país, el cual The Intercept redactó. También revela la recolección de metadatos en México, Kenia y Filipinas. – 19 mayo 2014\n<img src=\"http://i1.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot107.jpg?w=520\">\n\nDespués de dar al periodista Glenn Greenwald una advertencia de 72 horas para revelar la naciónredactada de su informe anterior sobre la vigilancia masiva de todo un país, WikLeaks reveló queel país en cuestión es Afganistán. – 23 de mayo, 2014\n\nLa NSA cosecha millones de rostros de imágenes de la web para su uso en una base de datos de reconocimiento facial previamente no divulgada. – 31 de mayo 2014\n\nFuente: http://www.businessinsider.com/snowden-leaks-timeline-2016-9"
		},
		{
			"post_id": 13,
			"title": "Analistas advierten que ataque de EEUU en Siria “Pone el mundo al borde de la Tercera Guerra Mundial”",
			"date_published": 1474427269.787,
			"body": "<img src=\"http://i1.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot052.jpg?resize=1024%2C606\">\n\nAlexéi Martinov, director del Instituto Internacional de Estados Nuevos ruso, ha declarado que “detrás del bombardeo en Siria puede estar un ‘partido bélico’, que de forma activa opera en EEUU” y que presuntamente, no obedecería al presidente sino solo a sus propios intereses.\n\n---\n\n“El sentido común, que triunfó entre las relaciones de Moscú y Washington, claramente no le va bien a ese ‘partido’”, ha señalado Martinov, explicando que “por eso todos los esfuerzos están dirigidos a hacer fracasar el diálogo a alto nivel” entre las dos naciones. Esa situación “lleva al mundo al borde de la Tercera Guerra Mundial”, concluye el experto.\n\nRecordemos que el 17 de septiembre, la coalición liderada por EEUU atacó una posición del Ejército sirio y provocó al menos 80 muertos y 100 heridos.\n\n<img src=\"http://i0.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot051.jpg?w=598\">\n\nLos aviones de la coalición penetraron en el espacio aéreo de Siria desde la frontera con Irak y calificaron el ataque sobre el ejército sirio de “error”, afirmando que creían que atacaban las posiciones de Estado Islámico.\n\nEl incidente ha provocado una agria polémica entre los diplomáticos rusos y estadounidenses ante la Organización de Naciones Unidas.\n\nSospechosamente, el ataque norteamericano vino seguido de una ofensiva de Estado Islámico sobre dicha posición, lo que ha provocado que el gobierno ruso acuse directamente a EEUU de colaborar con los terroristas.\n\nAl respecto de los hechos, la consejera del presidente sirio, Bouthaina Shaaban, reveló los detalles sobre el ataque estadounidense contra las tropas sirias del pasado sábado y no descartó la posibilidad de que los bombardeos fueran coordinados con el Estado Islámico (EI).\n\n“Los islamistas empezaron una ofensiva inmediatamente después del ataque estadounidense contra el Ejército sirio cerca de la ciudad de Deir Ezzor, y Washington dejó de atacar después de que los terroristas tomaran las posiciones de las tropas gubernamentales”, dijo Shaaban en una entrevista a RT.\n\n“Las tropas sirias estaban en las colinas cuando EE.UU. las bombardeó con varios aviones. Después de que Washington atacara, los terroristas lanzaron la ofensiva. EE.UU. atacó exactamente el territorio ocupado por el Ejército sirio. Para todas las personas que se encontraban en el campo de batalla fue evidente que todo estuvo muy bien coordinado entre la aviación y los terroristas”, señaló.\n\n“¿Por qué cuando el EI tomó las posiciones previamente ocupadas por las fuerzas gubernamentales EE.UU. dejó de bombardearlos? ¿Por qué no continuaron bombardeando al EI? Realizaron bombarderos solo contra el Ejército sirio”, apuntó Shaaban.\n\n<img src=\"http://i2.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot053.jpg?w=686\">\n\nSegún el editor de la revista ‘Defense & Foreign Affairs’, Gregory R. Copley, es probable que la información sobre los bombardeos estadounidenses contra el Ejército sirio fuera filtrada a los terroristas antes del ataque norteamericano para que pudieran lanzar una ofensiva contra las fuerzas de Bashar al Assad.\n\n“¿Es una coincidencia que los militantes del Estado Islámico estuvieran dispuestos a lanzar una ofensiva justo después de un ataque de EE.UU. contra las fuerzas sirias?”, se preguntó Copley.\n\n“Probablemente tuviera lugar una filtración a las fuerzas del EI u otros grupos yihadistas que les permitió aprovechar el llamado ataque ‘erróneo’ por parte de la Aviación estadounidense”.\n\n<img src=\"http://i2.wp.com/elmicrolector.files.wordpress.com/2016/09/breu-12-a.jpg?resize=560%2C315&ssl=1\">\n\nOtra explicación propuesta por el analista es que el presidente estadounidense quiere involucrarse más en Siria de manera personal antes de la terminación de su mandato.\n\n“El saliente presidente, Barack Obama, quería en realidad que EE.UU. participara directamente en las operaciones militares en Siria”, aclara Copley.\n\nAl respecto, el presidente sirio Bashar al Assad, ha declarado que “El ataque de la coalición contra el Ejército sirio es un acto de agresión”.\n\nEl grave incidente podría provocar una rotura de la tregua actual, que provocara una grave escalada del conflicto, coincidiendo además con una escalada de las confrontaciones entre el ejército sirio de Al Assad y el ejército de Israel en los Altos del Golán, que podría acabar desembocando en una guerra entre ambos países.\n\nFuente: https://actualidad.rt.com/actualidad/219082-tercera-guerra-mundial-ataque-coalicion-siria\nhttps://actualidad.rt.com/actualidad/219110-ofensiva-estado-islamico-ataque-eeuu-coincidencia\nhttps://actualidad.rt.com/actualidad/219142-ataque-coalicion-ejercito-sirio-estado-islamico\nhttps://actualidad.rt.com/actualidad/219099-eeuu-coordinar-acciones-estado-islamico\n\n"
		},
		{
			"post_id": 12,
			"title": "Experto en seguridad afirma que un país desconocido se está preparando para una ciberguerra mundial",
			"date_published": 1474089108.648,
			"body": "<img src=\"http://i0.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot019.jpg?resize=1024%2C563\">\n\nEl experto en seguridad digital Bruce Schneier, afirma que “en los últimos dos años alguien ha estado probando las defensas de las compañías que gestionan las piezas clave de Internet. Se trata de ataques precisamente calibrados diseñados a determinar hasta qué medida dichas compañías son capaces de defenderse y qué es lo que hace falta para superar las defensas”\n\n---\n\nEn su columna del blog Lawfare, el experto escribe que las empresas que proporcionan la infraestructura básica de Internet han visto recientemente un aumento de los ataques de negación del servicio (DDoS), que comienzan a cierto nivel, luego se intensifican antes de detenerse. Una semana después renuevan el nivel alcanzado y continúan.\n\n“Y así, de manera similar a si el atacante estuviera buscando un punto débil exacto”, precisó.\n\nLos ataques están configurados de manera que le muestren todas las defensas de la empresa atacada. Cuánto más vectores de ataque se emplean simultáneamente, más defensas diversas se deben usar.\n\n<img src=\"http://i0.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot018.jpg?w=996\">\n\n“Esto significa que las compañías tienen que utilizar todo lo que tienen para defenderse y no pueden guardarse nada como reserva. Se ven obligadas a mostrarle todas sus capacidades al atacante”, explicó Schneier.\n\nEl experto no revela los nombres de las compañías bajo ataque, diciendo que le pidieron anonimato, pero citó un informe semejante al de la empresa estadounidense Verisign, que opera una gran variedad de infraestructuras de red que incluye dos de los trece servidores de nombre raíz de Internet, además del registro autoritativo para los dominios de nivel superior genéricos .com, .net y .name.\n\nSchneier cree que tales ataques parecen operaciones de espionaje o de recogida de datos de inteligencia de escala más propia de un Estado que de algún grupo activista o criminal.\n\n“Parece un cibercomando militar tratando de calibrar su arsenal por si estalla una ciberguerra. Esto me recuerda a un programa estadounidense de la época de Guerra Fría para sobrevolar con aviones a gran altitud la URSS para obligarla a poner en alerta sus defensas aéreas con el fin de probar sus capacidades”, comentó.\n\nEl experto no está seguro sobre la fuente de los ataques. Aunque “los datos que veo señalan a China, por otro lado, es posible disfrazar al país de origen en este tipo de ataques”, señaló.\n\n<img src=\"http://i1.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot020.jpg?w=1004\">\n\nFuente: https://www.lawfareblog.com/someone-learning-how-take-down-internet\nhttps://actualidad.rt.com/actualidad/218890-experto-alguien-aprender-desactivar-internet"
		},
		{
			"post_id": 11,
			"title": "Se confirma el horror: Bayer compra Monsanto por 66.000 millones de dólares",
			"date_published": 1473904144.47,
			"body": "<img src=\"http://i0.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot355.jpg?w=947\">\n\nSe confirma el peor de los temores para la salud mundial: Los ejecutivos de Monsanto han aceptado finalmente la oferta de compra de Bayer por 66.000 millones de dólares.\n\n---\n\nAl aceptar la oferta de Bayer, la mayor propuesta de adquisición en efectivo de la que se tenga registro, Monsanto dará a la alemana la posibilidad de convertirse en la mayor compañía de la industria de suministros agrícolas, de rápida consolidación, al combinar su negocio de ciencias de la cosecha con la fortaleza de la estadounidense en semillas.\n\nTambién despeja el camino para que el acuerdo sea revisado de cerca por los reguladores antimonopolios.\n\nEl avance en las negociaciones, que se han prolongado por más de cuatro meses, ocurrió luego de que Bayer mejoró la oferta de 127.50 dólares por acción en efectivo que reveló la semana pasada, dijeron las fuentes.\n\nCOMENTARIO:\nSi Monsanto, por sí sola ya representaba un monstruo enorme cuyas políticas agresivas de envenenamiento sobre la población parecían difíciles de detener, ahora, con la compra del gigante químico Bayer, las consecuencias para la población mundial pueden ser inimaginables.\n\nAcaba de nacer el peor de los monstruos…\n\nFuente: http://www.elfinanciero.com.mx/empresas/bayer-anunciaria-compra-de-monsanto-el-miercoles-reuters.html\nhttps://actualidad.rt.com/actualidad/218687-filtracion-bayer-comprara-monsanto-66\nhttp://es.reuters.com/article/businessNews/idESKCN11K0GF"
		},
		{
			"post_id": 10,
			"title": "La industria azucarera “compró” científicos para exculpar al azúcar de problemas de salud",
			"date_published": 1473902886.33,
			"body": "<img src=\"http://i0.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot344.jpg?resize=1024%2C569\">\n\nPor [Miguel Jara](http://www.migueljara.com/2016/09/14/la-industria-azucarera-compro-cientificos-para-exculpar-al-azucar-de-problemas-de-salud/)\n\nNo hay duda de que el aumento de enfermedades cardiovasculares, el cáncer, la diabetes o la obesidad están relacionadas con determinados hábitos alimenticios insanos. La ingesta de azúcar es capital. Ahora sabemos que la industria azucarera “compró” científicos para exculpar al azúcar de esos problemas de salud.\n\nEl libro Adictos a la comida basura. Cómo la industria alimentaria manipula los alimentos para que nos convirtamos en adictos a sus productos, del ganador del Premio Pulitzer,Michael Moss, se divide en tres partes: sal, azúcar y grasa.\n\n---\n\nEn ellas, el periodista documenta la imparable carrera de las compañías alimentarias por añadir a sus productos cantidades ingentes de esos elementos con el fin de que nos gusten tanto tanto que no podamos parar de comerlos.\n<img  src=\"http://i2.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot348.jpg?resize=192%2C297\" aling=\"center\" >\nTambién narra la ultracompetencia entre esas empresas hasta el punto que han llegado a desvirtuar sus alimentos con tal de que las compañías competidoras no vendan más que ellos.\n\nSabemos que multinacionales como Coca-Cola han desarrollado campañas para desviar la atención sobre los daños a la salud que provoca el excesivo consumo de azúcar.\n\nDicha asociación nadie la discute hoy pero el mayor productor de bebidas azucaradas está moldeando la ciencia a su gusto para desinformar a la población en interés propio.\n\nSe generan dudas de manera calculada para que los consumidores no reaccionen de manera crítica.\n\nAhora sabemos que la industria azucarera pagó durante años a científicos para que le echaran la culpa al colesterol y la grasa de las enfermedades del corazón. Lo ha publicado JAMA, la revista de la Asociación Americana de Medicina.\n\nLos autores han trabajado con documentos internos de la industria alimentaria de los años sesenta del siglo pasado. En ellos figura la Sugar Research Foundation (SRF, Fundación para la Investigación sobre el Azúcar) que pagó a tres nutricionistas de Harvard alrededor de 50.000 dólares actuales para publicar una investigación que dejase en buen lugar al azúcar y señalase a las grasas saturadas como la principal causa de las enfermedades cardíacas.\n\nEse estudio fue publicado en una de las revistas médicas más influyentes del mundo, el New England Journal of Medicine y durante décadas lo que expuso el citado lobby industrial influyó mucho en las recomendaciones nutricionales de las décadas siguientes.\n\nLas enfermedades del corazón son la principal causa de muerte en el mundo occidental. ¿Qué parte de responsabilidad tienen quienes confundieron de manera premeditada a la sociedad con funestas consecuencias?\n\nPero esa desconfianza fabricada tiene un precio. Como concluye el trabajo publicado en JAMA:\n\nLos comités de formulación de políticas deberían considerar dar menos peso a los estudios financiados por la industria de alimentos”.\n\nLos trabajos corruptos de la industria llegaron, como suele ocurrir en tantos casos similares, en el momento justo. Al comienzo de la década de 1960 los primeros análisis científicos ya responsabilizaban tanto a los azúcares añadidos como a las grasas saturadas de las elevadas tasas de infartos y otras enfermedades cardíacas. El estudio que incrustaba la mentira en la comunidad científica se publicó en 1965.\n\nPero la mayor parte de las guías dietéticas se han centrado solo en la limitación de las grasas y el colesterol, restando importancia al elevado consumo de hidratos de carbono y azúcares añadidos, que puede haber contribuido a la epidemia de obesidad y diabetes que se vive en varios países occidentales.\n\n<img src=\"http://i0.wp.com/buscandolaverdad.es/wp-content/uploads/2016/09/ScreenShot349.jpg?resize=296%2C219\">\n\nTodo esto me recuerda a cuando los científicos negacionistas del lobby de Coca-Cola dicen que no hay “evidencia científica” sobre la relación entre comer mucho, alimentarse de comida “rápida” y bebidas azucaradas y la obesidad o la diabetes tipo 2.\n\nLa autora principal del trabajo crítico que ahora conocemos, Cristin E. Kearns, examinó los archivos secretos citados entre los que figuraban varias cartas de la SRF, el profesor del Departamento de Nutrición de la Escuela de Salud Pública de Harvard, Marcos Hegsted y el presidente de la Asociación Americana para el Avance de la Ciencia, Roger Adams, ya fallecidos.\n\nAl parecer, Hegsted había publicado con anterioridad varios estudios que señalaban que el nivel de glucosa en sangre era mejor indicador de aterosclerosis que el de colesterol y que, por tanto, relacionaban de manera directa el azúcar con las enfermedades del corazón.\n\nCuriosa manera de entender el “avance de la ciencia” que tenía el presi: si me pagas publico lo que me digas aunque sea contrario a lo que ya he documentado con mi trabajo. Los documentos que se han publicado no dejan lugar a las dudas, los científicos contratados sabían a la perfección lo que hacían y así se lo comunicaron a sus pagadores.\n\nPara saber más, como siempre, os recomiendo leer los enlaces que aporto en este post. ¿Mis conclusiones?:\n\n-La ciencia sufre el acoso de las industrias. Las primeras que desarrollaron estas estrategias de cooptación del ámbito académico fueron las tabacaleras y luego la maestra es la farmacéutica sin desdeñar, claro, a petroleras y eléctricas, operadoras de telecomunicaciones, de productos químicos y en general cualquier sector que quiera mantenerse en posiciones de privilegio en el actual modelo económico.\n\n-Las publicaciones médicas son el canal por el que los lobbies cuelan sus falacias. En los últimos años han reforzado los mecanismos de control pero hay que potenciarlos.\n\n-Esto nos ha de llevar a exigir que la ciencia sea independiente; más y mejor Ciencia (con mayúsculas) y menos marketing vestido de ciencia.\n\nQue los conflictos de interés de los investigadores y quienes publican sean declarados con exhaustividad.\n\n-Que, como dicen en JAMA, los políticos que han de hacer normas tengan en cuenta todo esto y no sobreestimen los riesgos sociales de “creer” (pues tratamos de creencias más que de Ciencia) en un conocimiento manipulado.\n\nLa salud pública está en juego.\n\n-Y la ciudadanía ¿qué puede hacer? Pues estar mejor informada y ser más crítica. Analizar mejor lo que compramos; la cesta de la compra también es una “herramienta política”."
		},
		{
			"post_id": 9,
			"title": "Zika: una obra maestra de control mental ",
			"date_published": 1473817282.747,
			"body": "<img src=\"https://mgtvwbtw.files.wordpress.com/2016/02/zika-again.jpg?w=650\">\nPor John P. Thomas / Health Impact News\n\nYa son casi nueve meses desde que la palabra “Zika” hizo su aparición en los titulares de los principales medios de comunicación. Antes de enero de 2016, el Zika era solamente uno de los muchos virus sometidos a vigilancia por los responsables de la salud pública. Pero de repente, este año todo cambió, y un virus casi inofensivo se transformó en una amenaza para todo el mundo.\n\n---\n\nComo veremos más adelante, la maquina de propaganda del Zika se puso en marcha en octubre de 2015, y ha estado haciendo de las suyas desde entonces. Se trata del clásico programa de control mental, un proyecto de lavado del cerebro, o una campaña de marketing de altos vuelos.\n\nIndependiente de quien sea, los medios de comunicación dominantes, la Organización Mundial de la Salud (OMS), la Organización Panamericana de la Salud (OPS), los Centros de Control y Prevención de Enfermedades (CDC), las Grandes Empresas Farmacéuticas, y tanto los republicanos como los demócratas todos ellos se han unido para vendernos un programa de erradicación del Zika en los Estados Unidos y al resto del mundo.\n\nEste ha sido unos de los programas de propaganda mejor orquestados en tiempos recientes. En este artículos hablaremos de cómo se inició el programa, cómo se ha desarrollado y hacia dónde se dirige.\n\n**El Zika no supone ninguna amenaza para los bebés**\n\nHay que dejar claro desde el principio que no hay evidencias sólidas de que el Zika suponga una amenaza para la humanidad. Se trata de una infección poco peligrosa, que no causa microcefalia.\n\nHace casi 70 años que el virus Zika fue patentado por la Fundación Rockefeller (1), y nunca se estableció una asociación entre la infección por Zika de las mujeres embarazadas y que sus bebés naciesen con una cabeza anormalmente pequeña o con defectos en el desarrollo del cerebro. Pero en el año 2015, repentinamente se habla de este supuesto problema. Esta afirmación, que se basa en pruebas circunstanciales, fue el inicio de una campaña de propaganda. Una campaña de propaganda no necesita basarse en pruebas, sólo hay que repetir una y otra vez lo mismo para que la gente crea que se trata de una verdad.\n\nDespués de medio año de miedos e histeria en los medios de comunicación, hasta las autoridades de Brasil han admitido que es poco probable que el Zika cause microcefalia.\n\nComo se informó en la revista Nature News & Comment en julio de 2016, un funcionario del Ministerio de Salud plantea dudas sobre si el Zika es el único factor de aumento de las microcefalias. El artículo decía:\n\n“El virus del Zika se ha extendido por todo Brasil, pero las tasas más altas de microcefalia se han encontrado en el noreste del país. Aunque hay pruebas de que el Zika puede provocar microcefalia, el patrón de agrupamiento sugiere que otros factores ambientales, socieconómicos o biológicos podrían estar en juego.\n\nTenemos la sospecha de que algo más que el virus del Zika está causando tan graves y alto número de casos, dijo Fátima Marinho, Directora de Análisis de la Información y la Salud del Ministerio de Salud de Brasil. Si esto fuera cierto, se podría modificar la evaluación del riesgo que el Zika representa para las mujeres embarazadas y sus hijos, dijeron los investigadores” (2).\n\nA pesar de admitir esto por parte de las autoridades brasileñas, la campaña de propaganda del Zika sigue avanzando sin interrupción. Y este campaña no cesará incluso si se descubren pruebas contrarias entre la relación del Zika y las microcefalias.\n\n**El Zika es una infección viral leve**\n\nLa mayor parte de las personas que se infectan por Zika apenas son conscientes de dicha infección. Es algo similar en muchos aspectos a tener un resfriado o una gripe ligera. Hay personas que experimentan fiebre, erupción cutánea, dolor en las articulaciones y conjuntivitis. Los síntomas de la enfermedad suelen durar de varios días a una semana. Se piensa que la enfermedad proporciona una inmunidad de por vida. Los casos que requieren de hospitalización severa son poco comunes. Las muertes son raras (3).\n\nEl hecho de que casi nadie muera por la infección del virus Zika lo convirtió en un candidato poco probable para el desarrollo de una vacuna. Los que experimentan mayores molestias por la infección pueden recibir cuidados y guardar descanso mientras que sus sistemas inmunes superan la infección viral.\n\n**Los titulares de la prensa prepararon el escenario para una campaña de propaganda**\n\nSin embargo, si se pudiera establecer una conexión entre las microcefalias o algún tipo de parálisis ( como el síndrome de Guillain-Barré), por ejemplo, entonces se empezaría a insistir en la necesidad de una vacuna contra el Zika y se insistiría en que cada persona se vacunase. Estaríamos dispuestos a renunciar a nuestros derechos individuales básicos en beneficio de la sociedad, que es siempre el objetivo de los programas de control mental.\n\nEn 2015, una serie de comunicados de prensa y artículos fueron publicados por la Organización Panamericana de la Salud, la Organización Mundial de la Salud y los CDC, para así establecer el escenario de despliegue de la gran campaña de propaganda y control mental.\n\nLos documentos publicados que levantaron la bandera roja de alarma hablaban de una epidemia de Zika que se desarrollaba en toda América del Sur y en  México. Los medios de comunicación se entusiasmaron enseguida con la epidemia en cuanto vieron la palabra microcefalia. La perspectiva de una gran cantidad de nacimientos de bebés con la cabeza y el cerebro anormalmente pequeños era una historia capaz de atraer la atención de su audiencia.\n\nEn los medios de comunicación empezaron a aparecer imágenes de bebés con deformaciones para así meter miedo a la gente y crear así la percepción de que era mejor tener cuidado porque si no el Zika podía producir algo parecido a nuestros bebés. Fue un trabajo duro para infundir pánico sobre el Zika, allá por los meses de enero y febrero de 2016.\n\nDespués empezaron a utilizar la palabra autóctona. Se utilizó esta palabra para referirse a una infección que se genera localmente. Un caso autóctono de Zika es cuando uno se infecta en el área donde vive, en contraste con una infección que se adquiere durante la visita a otra región o país.\n\nVoy a enumerar algunos de los puntos clave de ciertas notas de prensa para mostrar cómo se fue construyendo la campaña de propaganda y cómo se dio un impulso para proyectar la campaña en los medios de comunicación.\n\n→ Mayo de 2015: Brasil confirma los primeros casos autóctonos de Zika (4).\n\n→ Octubre de 2015: Colombia confirma los primeros casos autóctonos de Zika (5).\n\n→ Octubre de 2015: Brasil informa de un número inusualmente alto de bebés con microcefalia (6).\n\n→ Noviembre de 2015: El Salvador, Guatemala, México, Paraguay, Surinam y Venezuela informan de infecciones autóctonas de Zika (7).\n\n→ 17 de noviembre de 2015: La OMS pide a los estados miembros que vigilen la aparición de los casos de microcefalia (8).\n\n→ 1 de diciembre de 2015: La OMS informa de la aparición de infecciones autóctonas de Zika en Honduras (11).\n\n→ 22 de diciembre de 2015: La OMS informa de infecciones autóctonas en Panamá (12).\n\n→ 31 de diciembre de 2015: El Centro de Control y Prevención de Enfermedades de los Estados Unidos informa de infecciones autóctona por Zika en Puerto Rico, y recalca los casos de microcefalia en Brasil (13).\n\n**El recuento de los bebés con microcefalia**\n\nPero de repente los medios de comunicación empiezan a hablar en enero de 2016 de la relación entre el Zika y la microcefalia, comenzando las noticias sensacionalistas. La preocupación general se transformó enseguida en alarma al informar las autoridades brasileñas del aumento constante del número de casos de microcefalia. A fecha de 30 de enero de 2016 se habían contabilizado 4.783 casos de microcefalia o del sistema nervioso central (SNC), malformaciones que sugieren una infección congénita. Compararon estos casos con los datos de 2001 a 2004, en los que hubo un promedio de 163 casos de microcefalia (14).\n\nLos datos de Brasil sobre los bebés eran muy pobres. No se sabía lo que se consideraba microcefalia. No sabíamos tampoco si muchas madres habían dado positivo en las pruebas de infección por Zika. No sabíamos cómo se habían recogido los datos. Ni tampoco sabíamos del porqué de tanta insistencia en que lo único que podía causar defectos de nacimiento era una infección por el virus Zika. Las campañas de propaganda siempre rechazan otros puntos de vista distintos al que están promoviendo. No quieren una investigación sería o un debate sobre los hechos, lo que quieren es que la gente crea y se muestre sumisa.\n\n**La maquinaria de propaganda estadounidense se muestra públicamente en enero de 2016**\n\nLos responsables de los CDC empiezan a reflexionar sobre la situación. Primero dicen que puede haber una asociación entre el Zika y la microcefalia, pero están lejos de afirmar una relación causal (15).\n\n“Bien”, pensé cuando leí este informe. Sin embargo, mis esperanzas cayeron enseguida en picado cuando un minuto más tarde el mismo responsable de los CDC lanzaba la advertencia de que las mujeres evitasen viajar a Brasil y otros países de América del Sur si estaban embarazadas, si creían que podían estar embarazadas o que estuviesen pensado en quedarse embarazadas en los dos años siguientes.\n\n“¿Qué acababan de decir los CDC?”. Que no hay evidencias causales, y que ni siquiera sabían si había tal problema, pero que las mujeres debían quedarse en casa de cualquier manera.“Extraño”, pensé, cuando empecé a recordar cómo los medios de comunicación, los CDC y la OMS habrían promocionado la epidemia de Ébola, en una especie de campaña de propaganda similar sólo 18 meses antes. La amenaza mundial del Ébola acabó antes de que pudiese desarrollarse la vacuna, lo que debió suponer una enorme decepción para las grandes farmacéuticas.\n\nPero esta vez habían agarrado un virus que no iba a desaparecer así como así. Esta vez su campaña de propaganda sería mucho más sofisticada, y supondría el dar grandes pasos en la aceptación de la vacuna para enfermedades como el Zika.\n\n**Sobre el autor:**\n\nJohn P. Thomas escribe sobre temas de salud. Está licenciado en Psicología por la Universidad de Michigan y posee un Máster en Ciencias de la Salud Pública por la Universidad de Carolina del Norte, en Chapel Hill.\n\n**Referencias:**\n\n[1] “Zika Virus is property of Rockefeller Foundation,” Retrieved 2/7/2016.http://www.anonews.co/zika-virus-is-property-of-rockefeller-foundation/\n\n[2] “Brazil asks whether Zika acts alone to cause birth defects,” Declan Butler, Nature News & Comment, 7/25/2016. http://www.nature.com/news/brazil-asks-whether-zika-acts-alone-to-cause-birth-defects-1.20309\n\n[3] “First case of Zika virus reported in Puerto Rico,” CDC Online Newsroom, 12/31/2015.http://www.cdc.gov/media/releases/2015/s1231-zika.html\n\n[4] “Epidemiological Alert – Neurological syndrome, congenital malformations, and Zika virus infection – Implications for Public Health in the Americas,” Pan American Health Organization / World Health Organization, December 1, 2015. http://www.paho.org/hq/index.php?option=com_docman&task=doc_view&Itemid=270&gid=32405&lang=en\n\n[5] IBID.\n\n[6] IBID.\n\n[7] IBID.\n\n[8] “Epidemiological Alert Increase of microcephaly in the northeast of Brazil,” November 17, 2015. http://www.paho.org/hq/index.php?option=com_docman&task=doc_view&Itemid=270&gid=32285&lang=en\n\n[9] “Epidemiological Alert – Neurological syndrome, congenital malformations, and Zika virus infection – Implications for Public Health in the Americas,” Pan American Health Organization / World Health Organization, December 1, 2015. http://www.paho.org/hq/index.php?option=com_docman&task=doc_view&Itemid=270&gid=32405&lang=e\n\n[10] “Archive by Disease – Zika virus infection,” PAHO WHO.http://www.paho.org/hq/index.php?option=com_content&view=article&id=10898&Itemid=41443&lang=en\n\n[11] “Zika virus infection – Honduras,” WHO, 12/21/2015. http://www.who.int/csr/don/21-december-2015-zika-honduras/en/\n\n[12] “Zika virus infection – Panama,” WHO, 12/22/2015. http://www.who.int/csr/don/22-december-2015-zika-panama/en/\n\n[13] “First case of Zika virus reported in Puerto Rico,” CDC Online Newsroom | CDC, 12/31/2015. http://www.cdc.gov/media/releases/2015/s1231-zika.html\n\n[14] “PAHO WHO Reported increase of congenital microcephaly and other central nervous system symptoms,” February 10, 2016. http://www.paho.org/hq/index.php?option=com_content&view=article&id=11675&Itemid=41711&lang=en\n\n[15] “Why is Zika virus spreading so quickly?” Judy Woodruff talks to Dr. Anthony Fauci of the National Institutes of Health, 1/28/2016. https://www.youtube.com/watch?v=bHjjK-Gz3Ic\n\n<p>\n<p>\n\n**<h1>Zika: una obra maestra de control mental (II)</h1>**\n<img src=\"http://instituciones.sld.cu/hslscu/files/2016/04/945e1ff0b1f06ab3dd27a560206233eb.jpg\">\nPor John P. Thomas/ Health Impact News\n\nUna falsa crisis internacional en la que el recurso a bebés con malformaciones sirve de pretexto\n\nDurante el mes de enero y a principios de 2016, los medios de comunicación recogieron una letanía sin fin de historias sobre el Zika y bebés con deformaciones. En un artículo anterior ya he examinado algunos de los titulares de la campaña de propaganda:\n\n“¿Todos estamos siendo obligados a viajar en el mismo tren del Zika?\n\nCuando los CDC todavía utilizaban la palabra “posible asociación”, los medios de comunicación insistían en el uso de la palabra causa. A pesar de las reservas iniciales de los CDC, los medios de comunicación empezaron a lanzar su mensaje por toda América: “El Zika causa deformaciones en las cabezas de nuestros bebés cuando se encuentran en el útero, y no hay vacuna para protegerlos”.\n\nEn cada artículo sobre el Zika se incluía al menos una foto de un bebé con microcefalia y siempre se incidía en la carencia de una vacuna. Se nos recordó una y otra vez que el Zika era el causante de que los bebés naciesen con una cabeza anormalmente pequeña, con retraso mental y ceguera. Nos advertían de que algunos bebés habían muerto debido a la gravedad de sus deformaciones cerebrales. También nos recordaban que por cada bebé nacido con microcefalia los costes de tratamiento del niño durante toda su vida alcanzarían unos diez millones de dólares o más en gastos médicos (16). Estas historias fueron creando paulatinamente un clima de mayor aprensión y miedo, que era su pretensión.\n\nA medida que los medios de comunicación se esforzaban por mantener los niveles de temor y que el interés por esta cuestión no decayera, comenzaron a centrarse en los esfuerzos de los Gobiernos para salvarnos del Zika. No pasó mucho tiempo antes de que encontraran a las personas adecuadas realizando las preguntas oportunas: “¿Qué va a hacer el Gobierno para proteger a nuestros bebés?”.\n\nEsta pregunta se hizo una y otra vez, a pesar de que no había pruebas de que estuviesen relacionados los casos de microcefalia con la infección por Zika. La pregunta se hizo tantas veces por los medios de comunicación que ningún político se atrevería a decir: “No vamos a hacer nada, porque por lo que sabemos el Zika no causa microcefalia”.\n\n**El Presidente Obama responde a la pregunta**\n\nEl 22 de febrero de de 2016, el Presidente Obama solicitó 1,9 mil millones de dólares para investigar y desarrollar una vacuna contra el Zika (17).\n\nVeamos esto con más cuidado. Es decir, que se van a gastar 1,9 mil millones de dólares en el desarrollo de una vacuna contra un virus que pocas veces ha sido mortal y del que no se ha demostrado que cause defectos de nacimiento, sólo para estar seguros. ¿O es que hay algo más en juego?\n\nTal vez lo que ande en juego sea la fuente de ingresos que las grandes empresas farmacéuticas quieren abrir a costa del Zika, que se ha promocionado de tal modo que la gente va a insistir en que esas Grandes Empresas desarrollen una vacuna contra el Zika. De repente, las grandes compañías farmacéuticas serán capaces de ponerse sus gorros blancos y rescatar a todos los bebés del mundo. Sería un dulce engaño si lo pudieran llevar a cabo.\n\nDeclaración de los CDC: el Zika causa microcefalia\n\n\"Los CDC anunciaron en abril de 2016 que el Zika es la causa de las microcefalias (18).\"\n\n<img src=\"http://issuespost.com/wp-content/uploads/2016/05/Zika-bebes-negligencia-issuespost.jpg\">\n\nEsta decisión se basó en el análisis de los datos disponibles por los CDC. No realizaron ninguna investigación exhaustiva. Utilizaron algo parecido a un análisis de un pato graznando: si grazna como un pato y camina como pato, entonces debe de tratarse de un pato. No pudieron decir si tenía plumas de pato como un pato o una propuesta de pato, pero aún así han insistido en llamar a ese pato, Zika. Al hacer esto, han olvidado algunos importantes criterios en su análisis.\n\nLos investigadores de los CDC dijeron:\n\n“Según el séptimo criterio (de Shepard), la prueba realizada en un sistema experimental en la que el agente actúa en el mismo estado, está pensado para medicamentos o la exposición a sustancias químicas y no se aplica a agentes infecciosos. Por lo tanto, teniendo en cuanta los criterios de Shepard como referencia, los criterios 1, 3 y 4 se han satisfecho, pruebas que se consideran suficientes para identificar un agente como teratógeno” (19).\n\nEn otras palabras, se utiliza un conjunto de siete criterios para determinar si el Zika podría ser considerado como una causa de la microcefalia. Determinaron que la asociación entre la infección por Zika y la microcefalia se comprobó en 3 de los 7 criterios. Sugirieron que se necesitarían estudios adicionales antes de que se pudieran comprobar otros criterios. Se excluyó completamente el séptimo criterio, ya que hace referencia a medicamentos o productos químicos, que podrían haber causado la microcefalia.\n\nNo me podía creer que se excluyera el séptimo criterio, cuando puede ser que la microcefalia esté causada por la exposición a pesticidas, o por una vacuna administrada durante el embarazo, ateniéndose únicamente a la posibilidad de que la causa sea la infección por Zika.\n\nEstos científicos de los CDC sólo buscaban la causalidad en los agentes infecciosos. Nada más les parecía importar. Esta mentalidad excluyente estuvo ya presente desde el inicio de la campaña de propaganda del Zika.\n\nIgnoraron por ejemplo la vacuna del tétanos, difteria y tos ferina (tdap) que se administró a las mujeres de Brasil en el año 2015. Tampoco atendieron a los efectos secundarios de los medicamentos. Ignoraron el consumo de alimentos transgénicos, la presencia del glifosato o del piriproxifeno, que han sido muy utilizados en Brasil. Hicieron caso omiso de la exposición a sustancias químicas procedentes de grandes instalaciones de la Industria Química, del alcohol o el consumo de drogas. Se obviaron por completo las deficiencias nutricionales y la pobreza extrema. Tampoco se consideró la introducción de mosquitos modificados genéticamente en Brasil, ni de la exposición a la rubéola, a la toxoplasmosis o a los citomegalovirus. Y no hablemos del efecto combinado de todos estos factores, así como de la modificaciones multigeneracionales del acervo genético local debido a todas estas causas potenciales.\n\nTodas estas posibles causas las repasé en mi primer artículo sobre el Zika publicado en enero de 2016:\n\n**Zika: ¿una amenaza real u otro engaño para promover la tiranía médica?**\n\nHay una cuestión que considero importante, que ya traté en el artículo anterior, y se refiere al número de bebés que nacieron con microcefalia. Las primeras noticias hablaron de 4.783 casos de microcefalia en Brasil. Después de la impresión inicial y el pánico creado, supimos que una investigación más pormenorizada confirmó solamente 483 casos.\n\nLos medios de comunicación tampoco hacen mención del número de bebés nacidos en los Estados Unidos con microcefalia, que por término medio es de unos 25.000 al año. Al realizar un ajuste entre la diferencia de población de los Estados Unidos y Brasil, nos encontramos con que la tasa de microcefalia en los Estados Unidos es en realidad 40 veces mayor que la tasa en Brasil.\n\nEn otras palabras, la incidencia de microcefalia en los Estados Unidos es mucho mayor que la de Brasil, y nuestros bebés no han padecido una infección por el Zika. Tal vez, algunos de los factores anteriormente expuestos puede ser la causa potencial, como ya dije en mi anterior artículo.\n\nTambién hay que señalar que todos los investigadores que firman este Informe son empleados de los CDC (20). Cabe preguntarse si su análisis ha sido objetivo o si sus resultados se han visto influidos por los vínculos de los CDC con las grandes empresas farmacéuticas (21).\n\n**La vacuna contra el Zika está en cartera**\n\nEn base a este pésimo análisis, se está intentando desarrollar una vacuna contra el Zika a toda prisa. Son por los menos cuatro empresas, más los CDC, las que están trabajando en una vacuna contra el Zika. Nos han dicho que costará varios años antes de que dispongamos de dicha vacuna, que debe ser debidamente probada y luego puesta a disposición de un buen número de personas de todo el mundo.\n\nYa han comenzado los ensayos de la vacuna del Zika y se está reclutando a voluntarios en los Estados Unidos. Los Institutos Nacionales de Salud de los Estados Unidos esperan comenzar la fase II de los ensayos a principios de 2017 (22).\n\n**El Congreso trata de proteger a los bebés financiando la vacuna contra el Zika**\n\nAhora que los CDC ya han resuelto la relación entre el Zika y la microcefalia, era el momento para que el Congreso aprobase la solicitud del Presidente de financiación del programa de desarrollo de la vacuna contra el Zika. Sin embargo, no han alcanzado un acuerdo sobre la cantidad de dinero destinado a la financiación y de dónde saldrán esos fondos. El proceso de financiación se estancó a finales de junio, momento en el que el Senado y el Congreso no pudieron resolver sus diferencias (23).\n\nEl Congreso estuvo de vacaciones durante 7 semanas y no estaba disponible para resolver esas diferencias. Esto ha creado problemas a la campaña de propaganda sobre el Zika, ya que eso podía suponer que no apareciesen noticias sobre el Zika durante el verano.\n\n**Continuando la campaña de propaganda matando mosquitos**\n\nLos principales medios de comunicación cambiaron su enfoque sobre el desarrollo de la vacuna para la erradicación del mosquito Aedes aegypti, del que se sabe que es portador del virus del Zika. Si un mosquito infectado pica a una persona, entonces esa persona puede desarrollar la infección. Esto es algo que nadie discute.\n\n**A la caza del mosquito en 2016**\n\nLos CDC continuaron llevando un registro de los casos de Zika en los Estados Unidos y en Puerto Rico. El número siguió aumentando durante la primavera y a principios de verano. Estaban buscando casos autóctonos de Zika en los Estados Unidos, pero sólo pudieron encontrar personas que habían viajado a países infectados por el Zika, o que habían mantenido relaciones sexuales con personas que habían viajado a esos países.\n\nFinalmente, a finales del mes de julio, encontraron a 4 personas de Wynnewood en Miami, Florida, que tenían la enfermedad del Zika a pesar de no haber viajado a un país infectado ni habían tenido relaciones sexuales con personas infectadas de Zika (24).\n\nLas autoridades de salud pública, tanto a nivel estatal como federal, interpretaron estos casos de Zika en el sentido de que el virus del Zika se transmitió a las personas por las picaduras de mosquitos. No atendieron a la posibilidad de que las personas infectadas hubiesen mentido sobre su posible exposición, por ejemplo, haber tenido contacto sexual con una persona infectada. Sin embargo, las autoridades sanitarias llegaron a la conclusión de que se debían de poner en práctica programas de control de los mosquitos para evitar la propagación del Zika.\n\nAhora que la epidemia del Zika había alcanzado el territorio de los Estados Unidos, los medios de comunicación siguieron azuzando su campaña del miedo: “Hay mosquitos que están tratando de hacernos daños y a nuestros bebés”.\n\nEl Gobernador de Florida fue de puerta en puerta en busca de más personas infectadas por el Zika\n\nEl 1 de agosto, el Gobernador de Florida se puso en contacto con el Sistema Público de Salud de los Estados Unidos y les pidió que enviaran un equipo especialmente entrenado de agentes federales de salud pública para apoyar la emergencia sanitaria provocada por el Zika en Miami. Estos agentes y responsables de Florida fueron de puerta en puerta en el barrio de Wynwood, Miami, y recogieron muestras de orina para identificar casos adicionales de Zika.\n\nSe encontraron 10 casos más, pero todos ellos asintomáticos: las personas ni siquiera sabían que estaban infectadas (25).\n\n**Problema: no pueden encontrar mosquitos infectados por el virus del Zika**\n\nSe recogieron 5000 mosquitos para determinar la presencia del virus del Zika, pero todo ellos el resultado fue negativo (26).\n\nLos responsables dijeron que estos resultados negativos en la búsqueda de mosquitos infectados por el Zika se debía a que era tan difícil como encontrar una aguja en un pajar (27).\n\nSobre el autor:\nJohn P. Thomas escribe sobre temas de salud. Está licenciado en Psicología por la Universidad de Michigan y posee un Máster en Ciencias de la Salud Pública por la Universidad de Carolina del Norte, en Chapel Hill\nReferencias\n\n[15] “Why is Zika virus spreading so quickly?” Judy Woodruff talks to Dr. Anthony Fauci of the National Institutes of Health, 1/28/2016. https://www.youtube.com/watch?v=bHjjK-Gz3Ic\n\n[16] “Zika virus: Miami outbreak sparks concern, demand for tests among pregnant women,” Emily Cochrane and Daniel Chang, Miami Herald, 8/3/2016.http://www.miamiherald.com/news/health-care/article93631267.html\n\n[17] “Letter From The President — Zika Virus,” whitehouse.gov, 2/22/2016.https://www.whitehouse.gov/the-press-office/2016/02/22/letter-president-zika-virus\n\n[18] “Zika Virus Causes Birth Defects, Health Officials Confirm,” – The New York Times, Pam Delluck and Donald G. McNeil, jr., 4/13/2016.http://www.nytimes.com/2016/04/14/health/zika-virus-causes-birth-defects-cdc.html?_r=0\n\n[19] Sonja A. Rasmussen, M.D., Denise J. Jamieson, M.D., M.P.H., Margaret A. Honein, Ph.D., M.P.H., and Lyle R. Petersen, M.D., M.P.H; “Zika Virus and Birth Defects — Reviewing the Evidence for Causality,” New England Journal of Medicine, 5/19/2016.http://www.nejm.org/doi/full/10.1056/NEJMsr1604338\n\n[20] “So What Became of the $1.9 Billion for Zika?” Marco Cáceres, National Vaccine Information Center, 8/17/2016. http://www.thevaccinereaction.org/2016/08/so-what-became-of-the-1-9-billion-for-zika/\n\n[21] “How Conflict of Interest has Corrupted the CDC,” Joseph Mercola, 6/30/2015.http://articles.mercola.com/sites/articles/archive/2015/06/30/cdc-receives-funding-from-industry.aspx\n\n[22] “NIH kicks off Phi trial for Zika vax as caseload rises in U.S,” Emily Wasserman, FiercePharma, 8/3/2016. http://www.fiercepharma.com/vaccines/nih-kicks-off-phi-trial-for-zika-vax-as-case-load-rises-u-s\n\n[23] “Zika Deal In Congress Likely To Be Delayed Until After Recess,” David M. Herszenhorn, The New York Times, 6/23/2016. http://www.nytimes.com/2016/06/23/us/politics/zika-congress-emergency-funding.html?_r=0\n\n[24] “Florida health officials confirm local Zika transmission,” Debra Goldschmidt, CNN, July 29, 2016. http://www.cnn.com/2016/07/29/health/florida-health-officials-confirm-local-zika-transmission/\n\n[25] “Gov. Scott: Florida Calls on CDC to Activate Emergency Response Team Following Confirmed Mosquito-Borne Transmissions,” 8/1/2016. http://www.flgov.com/2016/08/01/gov-scott-florida-calls-on-cdc-to-activate-emergency-response-team-following-confirmed-mosquito-borne-transmissions/\n\n[26] “Florida’s Mosquito Control Forces Mobilize Against Zika Threat,” Kaiser Health News, Phil Galewitz, 6/2016. http://khn.org/news/floridas-mosquito-control-forces-mobilize-against-zika-threat/"
		},
		{
			"post_id": 8,
			"title": "10 estrategias de inteligencia emocional utilizadas para manipular",
			"date_published": 1473816908.432,
			"body": "<IMG SRC=\"http://www.logicaecologica.es/wp-content/uploads/2014/05/20140524-214851.jpg\">\n\nLOS LÍDERES NARCISISTAS SUELEN APELAR A LAS EMOCIONES Y MIEDOS PARA CONSEGUIR PODER POLÍTICO, CON CATASTRÓFICOS RESULTADOS.\n\nEl psicólogo organizacional Adam Grant identificó de manera elocuente la inteligencia emocional con una serie de rasgos de los líderes más carismáticos de la historia, una siniestra alianza que consiste en “reconocer el poder de las emociones”. Según Grant, “uno de los líderes más influyentes del siglo XX pasó años estudiando los efectos emocionales de su lenguaje corporal. Practicar la gesticulación de sus manos y analizar imágenes de sus movimientos le permitieron transformarse en ‘un hechizante orador público’, a decir del historiador Roger Moorhouse. (…) Su nombre fue Adolf Hitler”.\n\n---\n\nA diferencia de la inteligencia intelectual, que se basa en encontrar la mejor manera de resolver un problema, la premisa de la inteligencia emocional es encontrar el punto de convergencia entre uno mismo y las emociones de los demás. El problema es que esta inteligencia puede usarse con fines perversos si se trata de un narcisista patológico o un político (¿será que existe diferencia en la actualidad?). Por eso aquí presentamos un resumen de 10 estrategias de manipulación utilizando la inteligencia emocional.\n\n**1. Uso político del miedo**\nPueden hablar de amenazas raciales de manera grandilocuente para fomentar el nacionalismo (o en una empresa, la amenaza de la competencia) basado en el miedo.\n\n**2. Mienten con facilidad**\nVista emocionalmente, la verdad tiene muchas caras. El valor de la transparencia y la honestidad, para un manipulador, radica en ofrecer lo que el auditorio quiere escuchar.\n\n**3. Se “cuelgan” de la felicidad ajena**\nNo importa si se trata de un éxito deportivo o artístico, lo que quieren es salir en la foto y ser asociados consciente o inconscientemente con los símbolos positivos de la identidad de sus víctimas.\n\n**4. Cobran caro sus favores**\nSu generosidad siempre viene con una cláusula oculta de sumisión. Cualquiera de sus regalos debe mirarse como una perversión de la reciprocidad, que comienza pidiendo pequeños favores y ofreciendo pequeños presentes.\n\n**5. Saben controlar la cancha**\nEl lugar que ocupan en la mesa, la forma en que caminan en público, cómo se comportan frente a la prensa o la elección misma del lugar de encuentro, todo juega en favor de ellos para darles ventaja estratégica y tomarte por sorpresa. Busca terreno neutral.\n\n**6. Te inundan con preguntas**\nGeneralmente se trata de argumentos disfrazados de preguntas retóricas. Este procedimiento tiene la finalidad de hacerte creer que llegaste por ti mism@ a las conclusiones que ellos necesitan que creas.\n\n**7. Hablan con velocidad**\nCuando los escuches piensa que no estás frente a una persona hablando por sí misma, sino que estás oyendo un fino discurso de ventas, o un ejercicio de reprogramación lingüística. Escucha más allá de sus palabras, pregúntate qué es lo que están ofreciendo mediante la estrategia de los largos discursos, o de los cortos donde sólo hablan ellos.\n\n**8. Saben amedrentar con emociones negativas**\nTe miran fijamente a los ojos, hacen aspavientos teatrales, enrojecen o respiran con enojo: confunden las emociones con argumentos, y te convencen si logran que caigas en la misma confusión. La racionalidad debe ser el camino a seguir frente a los despliegues absurdos de poder (que sólo buscan compensar su impotencia).\n\n**9. Plazos cortos, ultimátums**\nPara los manipuladores, las decisiones deben tomarse de inmediato y de manera irreversible para demostrar decisión y fuerza, sin pensar en las consecuencias futuras. Por lo mismo te presionan a que tomes decisiones que no te convienen a largo plazo con el pretexto de un impulso presente y probablemente efímero.\n\n**10. Ignora la confrontación**\nTambién puede hacer como que no está disponible. Nada te hace más vulnerable frente a ellos que buscarlos desesperadamente, pues eso les da el poder de “regresarte la llamada”. En estos casos sí puede funcionar ponerles un ultimátum."
		},
		{
			"post_id": 7,
			"title": "La Medicina Rockefeller (Documental)",
			"date_published": 1473815626.251,
			"body": "<img src = \"https://i.ytimg.com/vi/0OaG_7eTadc/hqdefault.jpg\">\n\n“La crisis en el sistema de salud moderno está profundamente arraigada en la historia entrelazada de la medicina moderna y el capitalismo corporativo. Los principales grupos y fuerzas que dieron forma al sistema médico sembraron las semillas de la crisis que ahora enfrentamos. La profesión médica y otros grupos de interés médico cada uno trató de hacer que la medicina sirviera sus estrechos intereses económicos y sociales. Fundaciones y otras instituciones de clase corporativa insistieron en que la medicina sirviera a las necesidades de ‘su’ sociedad capitalista corporativa. La dialéctica de sus esfuerzos comunes y sus enfrentamientos, y las fuerzas económicas y políticas puestas en marcha por sus acciones, dieron forma al sistema a medida que crecía. De esta historia surgió un sistema médico que sirve pobremente las necesidades de salud de la sociedad”. (Extracto del libro ‘Rockefeller Medicine Men’ de E. Richard Brown publicado en 1979).\n\n---\n\nLos Rockefeller fueron absolutamente esenciales en la formación de la medicina moderna de Estados Unidos y esto podría ser desechado como una mera teoría de la conspiración por aquellos que no están tan familiarizados con los Rockefeller o su influencia. Pero esto se ha documentado muchas veces, de muchas maneras, y en muchos lugares por muchas personas.\n\nUn libro publicado a través de los auspicios de la Normal de Guangxi University Press, publicado por un académico chino, titulado, “To Change China: The Rockefeller Foundation’s Century Long Journey in China”, toma nota de eso, de nuevo, la Fundación Rockefeller fue absolutamente esencial en la formación de la medicina moderna de China, así como del sistema médico estadounidense.\n\nEn el siguiente documental podrán ver todo esto y mucho mas: \n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/0OaG_7eTadc\" frameborder=\"0\" allowfullscreen></iframe>"
		},
		{
			"post_id": 5,
			"title": "EL FRACTAL FUNDAMENTAL ",
			"date_published": 1473690985.117,
			"body": "Kryon por Lee Carroll \nHot Springs, Arkansas - 11 de Junio de 2016 \n\nSaludos, queridos, Yo Soy Kryon del Servicio Magnético. \n\nDeseamos tomarnos un momento para honrar la ciencia presentada en este lugar ayer y hoy. (Se refiere a las presentaciones de la conferencia). \n\nDurante 26 años les he dado mensajes, una y otra vez, que tal vez les hayan sonado raros. Cuando les di verdades que no estaban confirmadas aún, o les conté cosas que no estaban en el pensamiento tradicional, eran solamente cosas que no tenían fundamento. Año tras año, algunas de estas cosas han llegado lentamente a fructificar, pero recién ahora empiezan a ver el mensaje de Kryon convalidado de esta manera. Quiero llenar solo un poco los espacios vacíos en este mensaje al final del día. \n\n---\n\nLa ciencia, según se la enseñó este fin de semana, está completa y es exacta. Para quienes no están aquí y están escuchando esto, suena como una página arrancada de los muchos mensajes de Kryon a lo largo del tiempo. Hace años les contamos cuánto tiempo tenía realmente la humanidad aquí. Les dimos la línea de tiempo de la humanidad desde lo que llamamos la siembra: 200.000 años atrás. Les contamos historias que tal vez no creyeron en ese momento. Les dimos números para considerar, incluso les dimos a considerar la historia desconocida. Ahora está aquí, confirmándose frente a sus ojos: las tablas, los gráficos, la investigación. \n\nLos científicos llegan solo hasta el borde de la verdad, les dan lo que les pueden dar, y por una buena razón. Las verdades de las que hablan deben ser confirmadas, probadas e investigadas. Ellos todavía no pueden hacerlo, pero pueden llevarlos hasta el borde de esa confirmación mostrándoles la evidencia. Las pruebas son más elusivas, y la ciencia requiere pruebas. Entonces ellos presentan la investigación que se acumula llegando a conclusiones por sentido común y conectando los puntos. \n\nCiertamente se ha demostrado una y otra vez que la investigación indicaría que ustedes pueden no haber descendido biológicamente de nada que esté aquí en la Tierra. El eslabón perdido sigue estando perdido, lo dijimos hace años. Les dijimos que siempre estaría faltando porque ustedes no descendían de nada de aquí, y ahora esas palabras encuentran eco en las enseñanzas de estos dos últimos días. Estos maestros en ciencia los llevan hasta el borde, pero no les dicen \"quiénes\" podrían haber estado implicados en su comienzo. Mi trabajo es lo esotérico de todo esto, y comenzaré a completar el cuadro, que entonces se combinará con la ciencia. \n\nLos científicos les hablan sobre fractales. Los fractales son parte de toda la Física, de toda la Biología. Si le preguntan a un físico sobre los fractales, les da toda la matemática - de lo grande a lo pequeño, más grande, más pequeño – y todo eso representa fractales de lo mismo. Los biólogos saben que todo va desde lo pequeño a lo grande en forma de fractales. Simplemente así son las cosas. El maestro Gregg (Gregg Braden) aporta una investigación que es absolutamente exacta, 100%, cuando empieza a discutir el potencial del tiempo que se repite a sí mismo; algo que ustedes han oído en conversaciones toda su vida. Es evidente que parece realmente repetirse, pero ¿podría ser, que lo haga de modos que no se han descubierto? Él tiene razón. \n\n<IMG SRC=\"http://costarica2050.cr/wp-content/uploads/2015/06/gregg-braden.jpg\" ALING=\"LEFT\">\n\nQuiero llevar esto a otro nivel. Estuve en Turquía y les di un mensaje sobre la historia desconocida. Es un buen lugar para haber dado ese mensaje. Les dijimos que descubrirían civilizaciones de las que no tenían registro y que no creen que haya sucedido. Incluso les dijimos que este planeta ha tenido numerosas civilizaciones anteriores a la suya, y que se auto eliminaron de diversas maneras. Ahora bien, aquí llega la ciencia, según se presentó hoy, con el mismo mensaje. Está empezando a desenvolverse por sí mismo, ¿verdad, queridos? Están viendo las enseñanzas esotéricas, las cosas raras que les di durante años, y ahora las oyen de otros que empiezan a confirmarlas. Ahora se discuten, se descubren e investigan - y el cuadro empieza a volverse más nítido. \n\nQuiero hablar por un momento sobre los fractales de tiempo. Si no estuvieran aquí en la conferencia, sería difícil dar el paso siguiente, Sin embargo, es muy importante que sepan qué se dijo, porque hemos hablado de estas mismas cosas en el pasado. Nuestras palabras no incluían los fractales pero hablamos de un patrón y un sistema involucrados en lo que está pasando. \n\nEl maestro Gregg ha investigado bien, y ha postulado que las ondulaciones del tiempo se vuelven sobre sí mismas.* Se presentan de un modo que permitiría predecir y calcular cuándo podrían suceder otra vez. Vienen de tal manera que se refuerzan entre sí y tal vez incluso podrían ser más fuertes que la vez anterior. Ustedes ven claramente la matemática de los fractales, mostrando que están en el final del ciclo del que les hemos hablado. Él tiene razón y ustedes lo están. \n\nLos mayas les dijeron lo mismo, y otros que tenían calendarios como el Calendario Maya de la Cuenta Larga dijeron la misma cosa. Los aztecas y los toltecas tenían un calendario similar. ¡La profecía estaba en todos lados! Entonces esta es la gran pregunta: ¿Qué impide que ustedes repitan ahora la vieja historia? Llega a ustedes una vez más y los fractales están allí y la historia es clara. Los patrones están allí y son los mismos, una y otra vez. ¿Por qué no los repetirían? ¿Por qué no van a una guerra final y terminan con la humanidad otra vez más? Yo voy a contestar eso para ustedes, esotéricamente, ahora mismo. \n\nQueridos, existe un fractal que llamaré el fractal fundamental. No necesariamente se ha hablado de este fractal ayer, pero estoy seguro de que el maestro Gregg lo conoce. A veces, cuando se discuten los patrones y la repetición, tienen algo que parecería invisible porque no lo percibe la consciencia humana normal. El fractal de tiempo inicial fundamental es el que origina a los otros. Es el inicio, la onda fundamental, y se los demostraré. Todo ha resonado en múltiplos del fundamental. Incluso les daré algunos números para considerar. \n\n<IMG SRC=\"http://i2.wp.com/www.ungeekencolombia.com/wp-content/uploads/2014/06/Fractal-Mobius-Dragon-IFS-10.jpg\">\n\nEl fractal fundamental de su tiempo terrestre es la precesión de los equinoccios del planeta. Todas las ondulaciones de los potenciales se construyen a partir de él. Esta precesión se debe a un bamboleo físico del planeta que toma 25.630 años. Tanto tiempo requiere para que un ciclo, o movimiento de bamboleo, vuelva a su punto inicial. Como es tan prolongado, puede variar hasta en 1%, pero no mucho más. Los 25.630 años son la medida del bamboleo del planeta. \n\nSi consideran el Calendario Maya de la Cuenta Larga, en esos 25.630 años caben exactamente cinco calendarios mayas. Los mayas describen la cuenta larga como 5.125 años.** Este también resulta ser el tiempo que duraron sus civilizaciones anteriores desconocidas, de las que hablamos, antes de aniquilarse unas a otras. Todo empieza a tener sentido. Queridos, el fractal fundamental es la razón por la que este ciclo actual es diferente. Lo es porque ustedes están ubicados en el punto del final y del comienzo - el punto central de la precesión de los equinoccios. Es el primero para la humanidad moderna. El tiempo no está sencillamente volviendo como lo hizo antes. Este es el centro. Esta es la predicción de los antiguos y de los mayas; es por eso que el viejo calendario se detiene ahora, y vuelve a comenzar con otra cuenta larga. \n\nEste centro fundamental, la precesión de los equinoccios, brinda una energía que ninguno de los otros ciclos tuvo antes. Existe una autorización, en este ciclo fractal del centro, para que ustedes lo cambien y transformen. La prueba de esto son las situaciones inesperadas que ven a su alrededor. ¡Ustedes ya comenzaron! La caída de la Unión Soviética es un buen ejemplo de una situación inesperada. Es un cambio en la naturaleza humana para empezar un proceso armonioso de unir las cosas en lugar de separarlas. Esto es especialmente profundo cuando ustedes ven lo hecho con las naciones del planeta que solían ser enemigas durante siglos. ¡Esto es diferente! ¡Es nuevo! No va a repetirse como lo hizo en el pasado. \n\nAlgunos dicen: \"Bueno, Kryon, se aproximan algunas ondulaciones y fractales peligrosos. De hecho, en 2017 se inicia un ciclo mayor que luce amenazador.\" Queridos, les daré la razón principal por la que ahora es distinto de las otras cuentas largas repetitivas. Hay una ventana de 36 años de la precesión de los equinoccios. La ventana tiene 18 años hasta el centro (21 de diciembre de 2012) y 18 años después, saliendo. Ustedes todavía están dentro de los últimos 18 años. Todavía están en la energía residual de la última cuenta larga. Los fractales de tiempo todavía están allí, y existen aún potenciales importantes que se sienten. Ciertamente todavía podrían suceder, pero hay más en esto, y es lo que quiero contarles. Es solo una de las muchas cosas que harán que esta época sea diferente. Hagamos otra vez la pregunta principal: ¿Qué hace que esta vez sea tan distinta? \n\nUstedes están centrados en la predicción de los antiguos y en el final del ciclo fundamental de 25.630 años. Esto de por sí le brinda una energía especial a este momento, pero eso no es todo. Hace mucho les conté quiénes los sembraron y hablamos acerca de la evolución de la consciencia humana que ahora se inicia después de haber estado estancada durante tanto tiempo. Les conté que los pleyadianos fueron la fuente de su ADN actual (y del eslabón perdido). Les dimos un mensaje titulado \"El Factor de Compasión\", para que ustedes sepan cuál es realmente la diferencia y qué es lo que realmente va a cambiar a la humanidad: la compasión. Sin embargo, ustedes son tan lineales, tan 3D, que dicen: \"¿Va a cambiar la química del ADN? ¿Podremos ver el cambio?\" La respuesta es que por supuesto va a cambiar, pero no como ustedes piensan. \n\nAhora una metáfora: El campesino tiene su campo que ha trabajado durante años. Viene a casa y anuncia \"Hay una nueva clase de cosecha. Hay una cosecha de un tipo maravilloso, que va a crecer pronto. Entonces, ¿van afuera a ver si cambió el suelo? No. Cambiaron las semillas. El ADN no es lo que creen ustedes, y esta información se les dio ayer (se refiere a la información del Dr. Bruce Lipton). El ADN no es un grupo estático, inamovible de sustancias químicas. En cambio es el marco del plano de diseño del cuerpo humano; es el suelo en el que crecerán las semillas de la evolución, y las semillas representan su consciencia; no la química. De modo que no estudien la química buscando la evolución humana. Más bien, estudien el cambio de consciencia del planeta. Pero eso no es todo. \n\nQuiero que empiecen a usar la lógica espiritual; algo que con el tiempo será más evidente. Los pleyadianos son sus padres creadores por semilla espiritual. Es simple. La mayoría de la Tierra no quiere creer eso. La historia aceptada de la creación suena como eso e incluso la cronología es la misma, pero para que lo crea la mayoría, no puede implicar algo extraterrestre. La idea misma de los extraterrestres siempre involucra a quienes vienen a conquistarlos o dañarlos. Ese es un prejuicio suyo y es un reflejo de su propia consciencia humana y lo que ha sido su breve historia. Ustedes lo hacen, así que esperan que todas las formas de vida lo hagan. \n\nHemos dicho esto antes. Los pleyadianos tienen una civilización que comenzó hace millones de años antes que la suya, queridos. ¿Cómo creen que son ellos? Es una civilización muy adelantada que ha pasado por lo que ustedes han pasado. Tienen una consciencia muy elevada y sabia que incluso puede controlar la física mediante el pensamiento, y vinieron aquí con una plan divino a darles el conocimiento de la oscuridad y la luz y el libre albedrío de la dualidad para que ustedes pudieran resolver el acertijo. Su Dios es el de ustedes: la Fuente Creadora. Eso es lo que ellos hicieron aquí, y son como sus padres por semilla biológica, y les importan. Ellos no pueden intervenir, pero les importa. \n\nLos mismos pleyadianos pusieron un límite de tiempo para su crecimiento, y es allí donde ustedes están ahora mismo. Es el comienzo y final de la precesión de los equinoccios, el punto medio del ciclo fundamental, 25.630 años. Ustedes tuvieron varias civilizaciones que empezaron y se detuvieron durante ese tiempo y si ustedes no lo hubieran logrado ahora, ya no lo hubieran logrado en absoluto. Esta era la última oportunidad. \n\nUstedes empezaron a cambiar en las últimas décadas, y a fines de los 80 era evidente que iban a cambiar. La Convergencia Armónica de 1987 fue un punto de inflexión. Y entonces yo llegué en 1989. Al comienzo de 1992, ustedes disolvieron la Guerra Fría. ¡Empezaba a suceder! \n\nCuando los pleyadianos los sembraron, ellos establecieron un sistema en caso de que ustedes lo lograran y nosotros ya les dimos la información antes. Se llama los nodos y las zonas nulas del planeta. Los nodos y las zonas nulas estaban allí latentes como cápsulas de tiempo, esperando el momento correcto para activarse. Ese momento ha llegado y nosotros los hemos identificado a todos, y están comenzando a abrirse. \n\n\"Kryon, nunca oímos sobre esto antes. Esto es muy esotérico; no conocemos nada de eso. Tampoco hay escritos antiguos que lo indiquen.\" Queridos, usen su lógica. ¡Por supuesto que no sabían nada de ello, porque no habían llegado a la línea final del 21 de diciembre de 2012! Esta era información para quienes lo lograran, no para una Tierra que siempre estaba al borde de la autodestrucción. Nosotros vimos lo que estaba pasando, cuando desactivaron una tercera Guerra Mundial en su civilización. ¡La prueba de que era la oportunidad de último momento es que todos la esperan todavía! Es casi como esperar a que “caiga el otro zapato,” ¿no? \n\nQuiero hacerles una pregunta lógica. Cuando tienen hijos, y es hora de que aprendan a andar en bicicleta, ¿cuál es el proceso? Primero le consiguen una bici, ¿y qué hacen en seguida? ¿Le dan la bici y le dicen: \"Buena suerte, hijo, sé que te puedes caer y hacerte daño, pero así es como funcionan la bicicletas.\"? ¡No! Los padres amorosos no hacen eso. En cambio, le ponen rueditas de entrenamiento y le enseñan. Sostienen la bicicleta hasta que se acostumbra, corren al lado de la bici con las rueditas hasta que le sale bien. Sonríen y se regocijan cuando consigue el equilibrio, como todos los niños lo hacen eventualmente, y luego sale pedaleando sin ustedes mientras lo alientas. \n\nBien, queridos, el fractal fundamental está aquí, y las rueditas de entrenamiento son los nodos y las zonas nulas. Se abren, se activan, se emparejan y comienzan a borrar parte de la negatividad y oscuridad de este planeta para darles una vía acelerada hacia una consciencia más elevada. Durante años les hemos estado diciendo cómo funcionan, cómo eliminan la vieja energía por la Rejilla Cristalina, la Rejilla de Gaia. Toda esta conferencia tiene que ver con recordar, y sin embargo muchos dicen \"¿Recordar qué?\" Yo les diré qué recordar. ¡Quiero que recuerden la información original que les dieron los pleyadianos cuando ustedes llegaron aquí! Eso es lo que estás recordando, alma antigua, y eso es lo que este nodo está a punto de derramar hacia la Rejilla Cristalina. Empieza a borrar la recordación de la guerra y el sufrimiento de este planeta. Va a cambiar los mismos fractales de tiempo, casi un reinicio para la Rejilla Cristalina. \n\nLo que deben saber es que la Rejilla Cristalina es parcialmente responsable de recordar los viejos fractales de tiempo. Estos son los fractales que dicen que la historia se repetirá, aun cuando ustedes están creando un nuevo futuro y cancelándolos. Cuando empiezan a borrarse y cambiar de marco, es como un reinicio de la energía de la humanidad. \n\nQuiero preguntarles: ¿no harían eso por sus hijos? ¿No tiene sentido que los pleyadianos, que les trajeron la bella energía del amor de Dios, también les brinden ayuda para pasar por esta nueva y desconocida evolución de consciencia? ¿No les parece que ellos les darían rueditas de entrenamiento? ¿No empieza a tener sentido esotérico que este nuevo inicio del ciclo fundamental les trajera algo hermoso si ustedes lo lograban? Bueno, aquí está, ha llegado, ¡y este ciclo que comienza es diferente! \n\nNo permitan que nadie les diga \"Aquí viene otra vez. ¡Estamos pasados de fecha para una guerra, de modo que ya viene!\" Solo porque lo hicieron antes no garantiza que suceda otra vez. ¡Este ciclo es diferente!\n\nEse ha sido el mensaje durante 26 años, no necesariamente presentado en esos términos, pero es el mensaje desde mi primera publicación, en el Capítulo 1 del Libro Uno de Kryon: “No habrá Tercera Guerra Mundial. No habrá un Armagedón. Las viejas profecías no tendrán lugar.\" Hace 26 años veíamos venir el cambio. El fractal fundamental se está recalibrando, preparándose para reiniciarse con una configuración de energía diferente, y esa es la razón por la que no repetirán el pasado. \n\nEl tiempo de entrenamiento con rueditas depende de ustedes. Tienen libre albedrío y lo pueden hacer tan difícil o tan fácil como quieran. Aun con rueditas de entrenamiento pueden caerse, pero con la ayuda que les trae esta nueva energía, se subirán de nuevo y seguirán adelante. Iniciar un nuevo sistema de consciencia puede ser un largo viaje para una humanidad más vieja. Lo digo otra vez: dos pasos hacia adelante, uno hacia atrás. Esto es parte de un nuevo humano y están en el lugar correcto en el momento oportuno. \n\n¿No lo sienten? Lo que han oído hoy y lo que oyeron ayer, es el paradigma de la verdad. ¿No les suena como cierto que esté pasando algo especial y diferente? Y les diré qué es: ¡Están en marcha! Tienen una consciencia más alta, porque están aquí preguntándose: \"¿Qué es lo que siento que es tan diferente?\" Las dificultades que han atravesado con respecto a las recalibraciones de las que hemos hablado son todas parte de esta lenta transformación hacia una nueva consciencia. ¡Van a navegar directamente a través de los viejos fractales y potenciales! \n\nFelicitaciones, querida alma antigua, por venir al planeta en esta época, sabiendo que serían tiempos difíciles. Pero no te ibas a perder la fiesta, ¿verdad? \n\nY así es. \n\nKryon \n\n* Fractal Time by Gregg Braden (Tiempo Fractal, por Gregg Braden) \n\n** [www.maya.nmai.si.edu] © Lee Carroll\n\nhttp://www.kryon.com/\nCHAN2016/\nk_channel16_arkansas.html \n\nTítulo en inglés: The fundamental fractal \n\nTraducción: M. Cristina Cáffaro \nwww.traduccionesparaelcamino.\nblogspot.com.ar \n\nEdición: Susana Peralta Sitio autorizado de Kryon por Lee Carroll \nwww.manantialcaduceo.com.ar\n/libros.htm"
		},
		{
			"post_id": 4,
			"title": "Estamos en al año 1719, la teoría del falso pasado y el tiempo fantasma",
			"date_published": 1473483057.66,
			"body": "Hay quienes creen que la cultura de la conspiración es una característica infantil de Internet. Otros lo ven como una forma de antisistema, o incluso de rebelión. Pero, en verdad, es que la cultura de la conspiración es una parte muy real de la sociedad humana. Y todo el mundo participa… todo el mundo, desde el nacimiento de la sociedad humana. Puede que no todos asumamos el papel de teórico de la conspiración, pero todos hemos oído hablar y leído muchas de las teorías que circulan hoy en día, y todos tenemos una opinión personal.\n\n---\n\nEl apodo de “teórico de la conspiración” trae consigo un cierto estigma, pero en verdad, todos y cada uno de nosotros merece ese título de alguna u otra manera. Por supuesto, algunas teorías son un poco más complejas que otras. Una cosa es dudar de la versión oficial del asesinato de Kennedy, y otra cosa distinta es cuestionar los conocimientos académicos de los reinos de la física, la biología, o la mismísima historia. Hay toda una comunidad conspirativa que se centra en lo que se conoce comúnmente como “historia alternativa de la humanidad”.\n\nEsta historia alternativa engloba muchos temas, desde los antiguos astronautas, la Atlántida, la historia bíblica, la ciencia planetaria o ciertas épocas. Son muchos los teóricos de la conspiración que creen que hay momentos de nuestro pasado que ocurrieron de manera diferente a como nos la han explicado, o simplemente no ocurrió. Y es aquí donde empieza esta teoría de la conspiración. Para aquellos que vivieron durante los años de 614 a 911 d.C., un período de 297 años, nunca ocurrió. Esto se debe, a que según los historiadores alemanes Heribert Illig y Hans-Ulrich Niemitz, este periodo de tiempo nunca existió.\n\n**Un poco de historia (¿manipulada?)**\n\nVamos a empezar por el principio … el principio del tiempo que conocemos o que nos han enseñado. Se cree que el calendario más antiguo del mundo data del año 10.000 a.C., según la Comisión Real de Monumentos Antiguos e Históricos de Escocia. El uso de las fases lunares, los cazadores y recolectores desarrolló un calendario rudimentario en los campos de Escocia para realizar un seguimiento de los meses lunares y los cambios de estación. A medida que las civilizaciones del mundo fueron evolucionando, cada uno de ellos desarrollaron sus propios calendarios individuales a base de fases lunares y temporadas de cosecha. El calendario babilónico comenzaba con un nuevo mes, cuando una luna creciente aparecía por primera vez bajo el horizonte en el cielo occidental. El calendario maya, muy estudiado y considerado uno de los más complejos, disponía de tres diferentes cuentas de tiempo que transcurren simultáneamente: el Cholq´ij (sagrado) de 13 meses con 20 días cada uno, haciendo un total de 260 días; el Haab (civil) de 365 días; y la Cuenta Larga. El calendario maya es cíclico, cada 52 años significaba un nuevo comienzo.\n\n**Teoría falso pasado tiempo fantasma**\n\nPero a medida que el Imperio Romano florecía en los últimos siglos antes de Cristo, trajeron su propio calendario que imponían a todos sus enemigos vencidos. Con la ayuda de Sosígenes, un renombrado astrónomo de Alejandría, Julio César contribuyó al desarrollo de un nuevo calendario en el año 46 a.C., basado en el calendario romano. El calendario juliano, sucesor del calendario romano y antecesor del calendario gregoriano, se basaba en 365 días al año (con un día bisiesto cada cuatro años), dividido en doce meses.\n\nA partir del 1 de enero de año 45 a.C., el calendario juliano fue el calendario predominante en gran parte del mundo durante los próximos 1600 años, hasta que el papa Gregorio XIII instituyó el calendario gregoriano en 1582. Había tres razones para hacer esto (además de poder e influencia): hacer coincidir la celebración de la Pascua con el equinoccio de primavera; para borrar el error de los diez días acumulado durante los últimos 1600 años debido a cada año en el calendario juliano, que tenía 11 minutos y 14 segundos más que el año real; y para cambiar el año bisiesto de cada cuatro años cada 400 años (cada 4.124 años) a fin de que la acumulación de días no volviera a ocurrir. Las revisiones del papa Gregorio y el calendario gregoriano se encuentra todavía hoy en día en uso.\n\n**Una de las más grandes teorías de la conspiración**\n\nEl historiador alemán Heribert Illig publicó por primera vez en 1991 que sobran 297 años en la línea temporal, por lo que no vivimos en el año 2016, más bien vivimos en el año 1719. Estos años que faltan son un simple accidente, una mala interpretación de documentos o una manipulación deliberada. Según Heribert, “el tiempo que falta” podría ser explicado debido al intercambio de los calendarios con el paso de los siglos que dieron lugar a errores de cálculo y errores humanos. Incluso después de siglos, el tiempo faltante sólo debería haber ascendido a días o meses, no a 297 años. De hecho, un simple cálculo revela que el papa Gregorio cometió un error, se acumularon trece semanas y no diez días en el calendario juliano. Esto fue claramente un error humano, pero ahora la pregunta sigue siendo, ¿y dónde se fue todo ese tiempo?\n\n**Teoría del falso pasado**\n\nPor su parte, Hans-Ulrich Niemitz, colega de Heribert, dijo que había varias pruebas que demostraban que desde el año 614 al 917 d.C. nunca ocurrió. La Catedral de Aquisgrán en Alemania, supuestamente construida en el año 800 d.C., tenía ciertas similitudes con la arquitectura de otras catedrales construidas 200 años después. Durante este período de tiempo, el Imperio bizantino se sometió a una reforma masiva del gobierno, sin embargo, no existen fuentes históricas de la supuesta reforma en este periodo.\n\nNeimitz también utiliza la falta de documentación de la amplia expansión de la religión del islam por toda Persia y Europa, y la inactividad del pueblo judío durante una época de gran agitación como evidencia. Mediante la conexión de todos los puntos, Niemitz explicó que se hace evidente que 297 años no se encuentra en las historias de muchas culturas y diferentes civilizaciones. Al final de su investigación, Niemitz se hizo la siguiente pregunta: ¿Quién, cuándo, cómo y porqué 300 años de historia fue manipulada?\n\nPues la respuesta a esta pregunta la podemos encontrar en el emperador Otón III y su deseo de asegurarse de que su reinado ocurrió en el año 1000 para mostrar que entendía el “milenarismo cristiano”. Con el fin de hacer esto, tuvo que manipular los años para llenar el tiempo que faltaba, por lo que inventó a Carlomagno, que supuestamente vivió del año 742 al 814 d.C.\n\nNiemitz también planteó la hipótesis, con la ayuda del famoso teólogo Peter Schreiner, que el emperador Constantino VII reescribió toda la historia bizantina y dijo a sus transcriptores que destruyeran los escritos originales. Por desgracia, y aún con todas estas evidencias, la mayoría de historiadores se niegan (o no quieren) creer en la teoría del tiempo fantasma, y para ellos todas las evidencias presentadas por Neimitz y Heribert son circunstanciales.\n\n**1719 teoría del falso pasado**\n\nAdemás, que, si realmente nunca ocurrieron estos 297 años, entonces habría significado que muchas figuras históricas como Carlomagno, nunca existieron y habría requerido reescribir la historia de la humanidad. Por ejemplo, la dinastía Tang, que supuestamente gobernó China desde el 618 al 907 d.C., también se encontraría en la línea de tiempo fantasma.\n\nTodos estos datos históricos parecen demostrar que no estamos en el 2016, más bien vivimos en el año 1719. Y parece ser que los historiadores son conscientes de esto, pero no quieren revelar la verdad. Además, la conspiración va mucho más allá de lo que podemos comprender ya que si por alguna razón esta teoría fuera cierta, a saber, que más datos históricos han sido manipulados. Por lo que todo parecen indicar que la historia de la humanidad, o gran parte de ella, no tiene nada que ver con la que explican en las escuelas o universidades.\n\nFuente: http://www.mundoesotericoparanormal.com/estamos-ano-1719-teoria-falso-pasado-tiempo-fantasma/\n\n"
		},
		{
			"post_id": 3,
			"title": "Científicos descubren que el cuerpo humano es una proyección de la consciencia",
			"date_published": 1473430495.581,
			"body": "<img src=\"https://2.bp.blogspot.com/-mQ4y5R2X6vc/VMSxF8ERQmI/AAAAAAAABtM/JzBdXAKA5vw/s1600/IMG-20130324-WA0013.jpg\">\n\nEn este artículo, vamos a explorar la posibilidad de que su cuerpo sea una proyección holográfica de su conciencia a medida que influye directamente en  el holograma y, por tanto, tener un control total sobre la salud física de su cuerpo. También exploraremos específicamente el mecanismo exacto detrás de este principio.\n\n---\n \nEl pensamiento humano determina la realidad, este es uno de los principios fundamentales de la física cuántica.\n\nA principios de 1900 demostraron que sin lugar a dudas, con un experimento llamado la doble rendija. Encontraron que el factor determinante del comportamiento energético (“partículas”) a nivel cuántico es la conciencia del espectador. Por ejemplo, los electrones en la misma condición a veces actúan como partículas, y luego en otras ocasiones se cambiarían a actuar como onda (energía) sin forma.\n\n\n**Conciencia infinita**\n\nEl mundo cuántico nos está esperando para tomar una decisión para él saber cómo comportarse. Es por eso que los físicos cuánticos tienen tales dificultades para explicar y definir el mundo cuántico. Somos verdaderamente, en todo el sentido de la palabra, maestros de la creación porque decidimos lo que se manifiesta.\n\nLa cosa es que el nivel cuántico de la realidad no es un aspecto local e insignificante de la creación. Lo que nos rodea es el nivel más fundamental de la creación, además del campo unificado. El campo energético humano está interactuando e influye en el campo cuántico que nos rodea en todo momento y el poder de nuestras creencias e intenciones se infunde en nuestro campo de energía, debido a que son fijados por la energía de nuestros pensamientos y emociones.\n\nPor lo tanto, la fusión de nuestros pensamientos, emociones, creencias e intenciones, que llamaré el campo energético humano para simplificar, es la realidad cuántica perpetuamente dentro de nosotros y alrededor de nosotros, en cada momento de nuestra existencia.\n\nTenemos el control y la responsabilidad total y completa sobre lo que elegimos con nuestra atención a manifestarse fuera del campo en el momento siguiente, nuestro poder y capacidad de hacer esto depende totalmente de lo que creemos, y la forma en que lo estamos sintiendo.\n\n**El caso Vittorio Michelli**\n\nEn 1962, fue admitido en el Hospital Militar de Verona, Italia, con un gran tumor en su cadera izquierda. Los médicos sabían que no podían ayudarle porque su caso era considerado imposible y fue enviado a casa sin tratamiento, y después de unos 10 meses, el hueso de la cadera izquierda lo tenía completamente desintegrado.\n\nComo último recurso, viajó a Lourdes, Francia, y bañado en la primavera de allí (que es un famoso lugar sagrado cristiano para producir milagros). Inmediatamente comenzó a sentirse mejor, recuperó su apetito, y se bañó en la primavera unas cuantas veces.\n\nDespués de unos meses de estar en casa, sintió un fuerte sentido de bienestar por lo que le pidió a los médicos que le hicieran radiografías de nuevo, y se sorprendieron al encontrar que su tumor se había reducido. En los próximos meses se mantuvo una estrecha vigilancia sobre él, y sus rayos X mostraron que su tumor continuó disminuyendo, hasta que con el tiempo el tumor ¡había desaparecido!\n\nPuesto que su tumor había desaparecido, su cadera comenzó a regenerarse. Después de dos meses, estaba caminando de nuevo, y unos años más tarde, su hueso de la cadera se regeneró completamente.\n\nLa Comisión Médica del Vaticano, en su informe oficial, dijo: “Una notable reconstrucción del hueso pélvico” se hizo rayos X en 1964, 1965, 1968 y 1969 confirman categóricamente que una reconstrucción ósea imprevista e incluso misteriosa a sorprendió al mundo de la medicina “.\n\nNormalmente este caso sería considerado milagroso y, de hecho, realmente lo es. Pero parece milagroso en el sentido de la verdadera fuerza de la intención humana y la creencia que muestra. Además, este es una poderosa evidencia que sugiere que hay una estructura energética que está más allá de nuestros “cuerpos materiales ”, ya que es uno de las únicas explicaciones lógicas para el hueso de la cadera de Vittorio Michelli, a menos que hubiera algún tipo de modelo energético que estaba instruyendo a su crecimiento, que, al igual que la comisión médica del Vaticano claramente, era “desconocido en los anales de la medicina mundial”.\n\nEn la medicina, tal vez este caso era desconocido, pero lo mismo no puede decirse de la física. A nivel atómico, los átomos que unen se unen entre sí para formar moléculas que tienen estructuras geométricas específicas como si no hubiera un modelo energético que diga que se adhieran a las formas que las mantienen unidas.\n\nSi nuestros cuerpos son una proyección de la conciencia, entonces nuestra conciencia crearía un modelo energético para que nuestros átomos y moléculas se alineen para crear nuestros cuerpos. Hay evidencia que sugiere fuertemente la existencia de este modelo energético (o campo de energía humana) en la nueva investigación sobre el ADN que demuestra que transmite, recibe, y por lo tanto lee la energía directamente del campo.\n\nEl caso de Michelli es un ejemplo perfecto de nuestra capacidad humana para volver a organizar esta estructura de vacío con nuestra energía y así manifestar lo que queremos, de manera que lo que ocurre verdaderamente parecen resultados milagrosos.\n\nEl hecho de que él comenzó a sentirse mejor y empezó a creer que fue sanado sugiere que fue la clave de su cura. Algunos pueden querer seguir con la creencia de que Dios ha sanado a este hombre, y estoy de acuerdo con ellos. Pero nosotros probablemente discordaremos sobre la naturaleza de Dios.\n\nLa fuerza que llamamos Dios es el poder y la conciencia infinita detrás de la creación y por lo tanto, cuando se estableció contacto con nuestra conciencia, es decir, sin pensar y a través de la meditación, nos abrimos a la infinidad de nuestra propia conciencia.\n\nCuando nos abrimos a esta energía, nos permitimos sentir “una poderosa sensación de bienestar” y saber que este poder tiene el asombroso poder para crear la realidad, y directamente afectan a nuestra biología.\n\nEl cuerpo como una proyección de la conciencia.\nEsto es absolutamente crucial para la comprensión de nuestra capacidad de curación. Nuestros cuerpos son una proyección holográfica de nuestra conciencia y que son la suma total de nuestras creencias sobre nosotros mismos.\n\n**La consciencia del cuerpo**\n\nSi podemos cambiar nuestras creencias sobre nosotros mismos, podemos cambiar la energía que define nuestro campo energético humano, entonces podemos cambiar el modelo energético con el que nuestro cuerpo está alineado.\n\nDeepak Chopra contó una historia que ilustra esto a la perfección en su libro, cómo conocer a Dios. Un amigo suyo se lesionó el pie mientras que entrenaba en un gimnasio porque no estaba acostumbrado a utilizar una de las máquinas. El dolor en la pierna creció durante los días, y cada vez era más difícil caminar, y luego en el “examen médico se descubrió que tenía una condición común conocida como fascitis plantar, se produce cuando el tejido conectivo entre el talón y la parte delantera del pie se estira o se rompe.\n\nSu amigo decidido no hacerse cirugía y en su lugar aguantar un poco más, pero con el tiempo se encontró con mucho dolor y dificultad para caminar. Buscó un sanador chino en tiempos de desesperación. Este hombre chino fue la aparición común, y no dio “ninguna evidencia de ser místico o espiritual, o de otra manera dotado con la curación.”\n\nEl amigo herido Deepak Chopra sigue: “Después de tocar mi pie suavemente, se levantó e hizo algunas señales en el aire detrás de mi espalda, nunca realmente me tocó, y cuando le pregunté qué estaba haciendo, dijo que simplemente estaba activando algunos interruptores en mi campo de energía, lo hizo por un minuto y luego me pidió que me levantara, ya no había ninguna sensación de dolor”\n\n“Para mi sorpresa le pregunté qué había hecho. Me dijo que el cuerpo era una imagen proyectada por la mente, y un estado saludable de mente sigue esta imagen intacta y equilibrada. Sin embargo, las lesiones y el dolor pueden causarnos a retirar nuestra atención de la zona afectada.\n\nEn este caso, la imagen del cuerpo comienza a deteriorarse; sus patrones de energía se dañan, poco saludable. Así que el sanador restauró el estándar correcto­. Después la propia mente del paciente asume la responsabilidad de que sigue siendo así”\n\nEsta historia me ha fascinado y me inspiró desde entonces. Como hemos visto, la realidad parpadea dentro y fuera numerosas veces por segundo, oscilantes entre la forma y lo informe, y la física cuántica sabe que nuestros pensamientos y creencias influyen en la realidad cuántica que es el origen del mundo material. Por lo tanto, es natural suponer que hay una fuente de energía.\n\nCreo que está absolutamente claro que debemos comenzar a considerarnos a nosotros mismos como algo más que un cuerpo físico. De hecho, es mucho más coherente de pensar en nosotros mismos como un campo de energía luminosa organizarnos en un cuerpo, o la conciencia como manifiesto y experiencia temporalmente de este nivel de realidad a través de nuestros cuerpos.\n\nSomos mucho más de lo que pensamos que somos, e infinitamente más de lo que hemos hecho creer. El siguiente paso que tiene que tomar nuestra evolución humana implica que nosotros aprendemos cómo utilizar y mejorar este poder que tenemos para influir en la realidad. Todo lo que necesitamos hacer es purificar nuestra energía a la proyección de energía de nuestro cuerpo.\n\nEntonces nuestros átomos y moléculas se alinean perfectamente con esta estructura, porque no hay interferencias energía para romper la imagen de nuestro cuerpo como fue diseñado por nuestra conciencia. Y al hacerlo nos estamos alineando con los principios universales. Nuestro campo de energía luminosa es, por supuesto, vibrante y nuestra energía fluye naturalmente sin obstáculos como una poderosa corriente de la conciencia, pero los niveles inferiores de la conciencia por los que hemos sido condicionados para vivir como parte de nuestro adoctrinamiento social interrumpe este flujo y obstaculiza su perfección en todas partes.\n\nOtro concepto clave para entender es que su cuerpo siempre se regenera. En una conferencia de Deepak Chopra señaló que los átomos no envejecen. Ellos no mueren, y existen los mismos átomos que existían en el Big Bang hace unos 14 mil millones años aún hoy, algunos de los cuales todavía están en ti.\n\nCada año, el 98% de los átomos en su cuerpo se sustituyen por “nuevos” átomos. Estás constantemente muriendo y renaciendo.\n\nCada tres días tienes un nuevo revestimiento del estómago y cada mes tienes la piel nueva, cada tres meses tiene un nuevo esqueleto y cada año hay casi un organismo completamente nuevo.\n\nDeepak Chopra lo describe muy bien, diciendo que nuestros átomos “son como las aves migratorias.” Ellos no son permanentes, son completamente independientes, y están a la deriva en el espacio y tiempo y sólo se organizan en estructuras como nuestros cuerpos por nada menos que nuestro campo de energía que organiza cómo un campo magnético organiza presentaciones, sólo un poco más complejo. Tu cuerpo no es el verdadero tú. Tu cuerpo es sólo una proyección de lo que tú crees sobre ti mismo.\n\nTú eres conciencia pura, y lo que realmente eres es una conciencia creativa infinita que se manifiesta en la realidad y la realidad de la co­creación con otros aspectos de ti mismo (ya que cada ser es una conciencia universal infinita de expresión que lleva la etiqueta de Dios), entonces puedes comenzar a tomar el control total sobre tu cuerpo, tu salud y tu vida.\n\nEl dolor crónico, enfermedad o lesiones antiguas que tienes en tu cuerpo no es realmente en tu cuerpo, es tu mente. Más específicamente, son una función de su percepción. Así que tú estás sosteniendo la enfermedad y el dolor dentro de su conciencia, y por lo tanto está impreso en su campo de energía, y sólo entonces comienzan a manifestarse en su fisiología.\n\nEntonces no es sólo nuestra salud la que está completamente fuera de nuestro control intencional, la velocidad a la que envejecemos, incluso puede estar bajo nuestro control también. No estoy sugiriendo que puedas ser inmortal, porque ya somos seres de conciencia infinita. Lo que estoy sugiriendo es que, en un tiempo olvidado, y en un futuro próximo, los seres humanos se darán cuenta de nuevo y tenendrás la capacidad de vivir de este campo, y vivir conscientes de su naturaleza como energía pura de seres luminosos.\n\nEn ese momento los seres humanos se darán cuenta de que el cuerpo es una manifestación más alta. Y un día vamos a llegar a un punto en que podamos regenerar continuamente nuestros cuerpos a voluntad porque vivimos en el campo de la energía infinita, y por lo tanto nuestros cuerpos simplemente operarán a una frecuencia más alta para que podamos vivir en ellas hasta que nuestro trabajo esté completo y decidamos seguir adelante.\n\n¿Fantástico? Sí. El único obstáculo para llegar a esta naturaleza del universo es su propia conciencia, su nivel de atención, y sus creencias. Nuestra capacidad de curar está directamente relacionado con nuestro nivel de atención y nuestro nivel de creencias. Por ejemplo, podemos sanar de cualquier afección, enfermedad o lesión, ya que tenemos la certeza absoluta, la comprensión, de que vamos a ser sanados.\n\nEsto se consigue directamente mediante el acceso al nivel más fundamental de la realidad a través de la meditación profunda. Esto se debe a que el nivel fundamental de la realidad, todo es posible, y la reestructuración de la realidad se basa únicamente en nuestras creencias y expectativas.\n\nSomos pura energía, y hay un potencial infinito en nuestra energía. Tú no tienes limitaciones, y nada es imposible. Sólo son tus creencias que dictan lo que puedes y no puedes hacer. “Los milagros suceden, no en oposición a la naturaleza, pero a diferencia de lo que sabemos de la naturaleza.” ­\n \nEn el siguiente artículo “La consciencia crea la realidad” (http://despiertavivimosenunamentira.com/consciencia-crea-la-realidad/) aportamos más datos y fuentes de científicos y físicos de renombre que aportan más luz al tema."
		},
		{
			"post_id": 1,
			"title": "Propósito del blog",
			"date_published": 1433033779.604,
			"body": "El potencial de ZeroNet es increíble, depende de lo aceptación entre los usuarios, y la disponibilidad de contenido. Por este motivo e decido iniciar este pequeño espacio virtual. Para compartir contenido relevante y pensamientos propios que bien podrían aportar algo a su búsqueda personal. \n\nEn este blog encontrará noticias y análisis que jamas va a encontrar en los medios masivos, pero gracias a la actual revolución tecnológica, el acceso a la información alternativa a sido democratizado. Es momento de que cada uno tome las riendas e inicie la recolección de información necesaria, para formar su propio criterio. La época de los seguidores ha muerto, llego la época de los actores. "
		}
	]
}