{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1577400583,
			"title": "دوستان راهکارهای مبارزات فردی و گروهی کم جمعیت رو برای مقابله غافلگیرانه حکومت بیان اینجا بیان کنند تا استفاده بشه",
			"body": "به نظرم مبارزات نباید تاریخ و ساعت مشخصی داشته باشه ... اما باید استراتژیک عمل کرد....",
			"added": 1577400582
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1576014271_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": [
			{
				"comment_id": 1,
				"body": "ببین میتونی راست چین کنی",
				"added": 1576015049
			}
		],
		"1576185412_16VNPV97D22nLggFssEwQXScnyUGX2cHjq": [
			{
				"comment_id": 2,
				"body": "اینکه بخوای اینجوری فکر کنیم که ممکنه رژیم بعدی بدتر از این رژیم میشه کار اشتباه هست ... این طرز فکر فقط به ما ضربه میزنه.... در انقلاب قبلی مردم گول حرفایی رو خوردن از روی سادگی و نا آگاهی .... وعده هایی چون آب و برق مجانی و اتوبوس رایگان و مسکن میسازیم  پول نفت رو بین مردم تقسیم میکنیم .... و به مردم گفتن شما فقط به معنویت احتیاج دارید ... باید دنبال باید برید دنبال معنویات بقیه امور باما.... و اینجوری مردم رو با وعده بهشت هم در این دنیا و هم در آخرت گول زدن....اما پس از ۴۰ سال ما کارنامه سیاهی رو میبینیم که نیاز به انقلاب داره ونه اصلاح ...مردم امروز ما آگاه تر شدن و به سادگی مردم ۴۰ سال قبل نیستن و کاملا آگاه شدن به مسائل سیاسی و دینی ... ما نیاز به انقلاب داریم و رژیم بعدی هم اگر قرار باشه منابع ملی رو برای مردم استفاده نکنه بازهم انقلاب میکنیم .....",
				"added": 1576827742
			},
			{
				"comment_id": 3,
				"body": "> [mmtech](#comment_6_1K8NrwqEfy49zAMWzHgywnToZib7PRaQMP): به لوپ بی نهایت خوش آمدید. \n\nشما نگاهی به تاریخ انقلاب های تاریخ جهان بنداز \nانقلاب فرانسه.. انقلاب چین... انقلاب آمریکا.... شما میتونی دست روی دست بزاری کاری نکنی و بشین انرژی منفی بیای و مثل یک پیشگو بگی اوضاع از این بدتر بشه...\nاما کسایی هستن که از این وضعیت خسته شدن و جونشون  به لب اومده و میخوان انقلاب کنن ....\nاین لوپ که شما میگی  همه کشورها دارن ...  هر لوپ بهتر از لوپ قبلی . چرا؟؟؟؟ چون با گذشت زمان  مردم با دانش و آگاه بیشتری  وارد لوپ بعدی میشن... مثلا انقلاب کبیر فرانسه بعد از چند انقلاب پی در پی بالاخره جایگاه خودشو پیدا کرد . \nخلاصه نمیشه بشین دست دست کنی از عالم غیب یکی بیاد لنگ کنه....",
				"added": 1576914865
			},
			{
				"comment_id": 4,
				"body": "تخممرغ هارو خالی کنید توشون رنگ روغن بریزید بعد درش با چسب ببندید ...... بزنید رو شیشه ماشین سرکوب گرا تا نتوان به مسیر ادامه بدن....",
				"added": 1577310473
			},
			{
				"comment_id": 5,
				"body": "مبارزه ادامه داره با رای ندادن و شعار نویسی و حمله مخفیانه به پایگاه های بسیج به صورت کاملا نامحسوس   . تک تک سرکوبگرایی که از این راه معیشت میکنن..... به سزای اعمالش میرسونیم جوری که حتی از سایه خودشونم بترسن.... وقتی آرامشی برای مردم نیست آرامشی هم نباید برای حکومت باشه",
				"added": 1577399554
			}
		],
		"1577400583_15xJB7FfbvRoSjdoKbCoBytdAUu3qYpYyG": [
			{
				"comment_id": 6,
				"body": "وقتی تاریخ دقیقی اعلام میکنیم و فراخوان میدیم خیلی راحت سرکوب میشیم... پس از امشب بع بعد با ایده جالب دوستان ایدهایی  که کاملا استراتژیک هست در گروه های کم جمعیت و یا تک نفره و کاملا چریکی و مخفی دهن این حکومت رو  سرویس کنیم ... پس هرکس ایده ای داره بیاد به اشتراک بزار...",
				"added": 1577401025
			}
		]
	},
	"comment_vote": {}
}