{
	"next_comment_id": 40,
	"user_name": "Nekololi",
	"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
	"post_like": {
		"1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC_1486543754": 1486865109,
		"1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC_1488615563": 1488839563,
		"1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC_1488761532": 1488926802,
		"1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC_1488504214": 1488927665,
		"1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC_1491188502": 1491257913,
		"15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1503965212": 1503970994,
		"15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1505003055": 1505003436,
		"15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1506446109": 1506459500,
		"1NjxV6oekXaTre7p6CjTEoqrpSfkD1Dpgh_1514008398": 1514010278,
		"15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1533398284": 1533418673,
		"13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ_1541604946": 1541617630,
		"1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde_1552061009": 1552076516
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "someone probably tried to exercise their free speech rights again",
			"post_uri": "1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC_1482293590",
			"date_added": 1482352341
		},
		{
			"comment_id": 2,
			"body": "i'll peer with u when there's official support, bb",
			"post_uri": "1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC_1486543754",
			"date_added": 1486865208
		},
		{
			"comment_id": 3,
			"body": "Peers found: 2\nI'll try again in a bit.",
			"post_uri": "1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV_1487028399",
			"date_added": 1487029187
		},
		{
			"comment_id": 4,
			"body": "it loaded. congratulations!",
			"post_uri": "1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV_1487028399",
			"date_added": 1487029746
		},
		{
			"comment_id": 5,
			"body": "It doesn't work! \n^ Is what I said before I realized I use a really out of date browser for ZeroNet browsing. Anyway, it's really cool, will help seed!",
			"post_uri": "1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC_1488615563",
			"date_added": 1488839413
		},
		{
			"comment_id": 6,
			"body": "neat! i dont know if im smart enough to test it, but if it solves the problems experienced in tor-always-mode then it's definitely a valuable contribution indeed!",
			"post_uri": "1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC_1488761532",
			"date_added": 1488926800
		},
		{
			"comment_id": 7,
			"body": "Seems like a very specific problem he was having with a very specific piece of software that would have been quickly resolved by using the format painter. Also I'm trying very hard but I can not make it say April 31st as a date no matter what I do, at least in a current version of LibreOffice's spreadsheet.\nPerhaps Vlad should stop drinking the wodka while he is at work.",
			"post_uri": "1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS_1492511206",
			"date_added": 1492645947
		},
		{
			"comment_id": 8,
			"body": "@Nekololi: LibreOffice does have some deficiencies from the Microsoft Office Suite. I don't mean to say that it does not. However, it is far more beneficial to talk about these actual deficiencies in a way that will make the development community aware of them so they may get resolved in one of their next updates (oh yeah MS products don't receive regular updates from a development community that can quickly address strange issues drunk slavs uncover at work)",
			"post_uri": "1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS_1492511206",
			"date_added": 1492646183
		},
		{
			"comment_id": 9,
			"body": "when i told my child psychologist i wanted to be an eagle because they're cool and soar above everything he said that it was a sign i was a disturbed child. i WAS a deeply disturbed child but i dont see how its unreasonable to want to be a badass fucking eagle.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1504252123",
			"date_added": 1504316674
		},
		{
			"comment_id": 10,
			"body": "having a job is nice but it really isn't a substitute for being happy",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1504520590",
			"date_added": 1504561590
		},
		{
			"comment_id": 11,
			"body": "would you prefer gentoo?\nin seriousness though, Debian was very easy to install (historically I am told Debian used to be a nightmare to install) and makes it simple to install the desktop environment you like. i would not advocate using Debian for your main desktop, but if Debian is easy I imagine other distros are easy to set up with a DE as well.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1504774083",
			"date_added": 1504817057
		},
		{
			"comment_id": 12,
			"body": "Laugh all you want. One full moon when you've least expect it, you will hear shrieks and howling. There will be no more dwarves. Only your fortress. Full of wereraccoons. Now you know why you fear the night.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1505003055",
			"date_added": 1505003428
		},
		{
			"comment_id": 13,
			"body": "@Musickiller: I was actually able to quickly contain the wereraccoon plague. As soon as the attack occured I established a hospital zone and furnished it with enough beds for the wounded. Everyone who recieved a wound, whether they contracted wereraccoonism or not, flocked to the hospital to receive treatement. The moment my chief medical dwarf slipped outside of the room, I sealed the doors shut. I lost a couple of peasants who only went inside to deliver water. It felt a little bad tricking everyone into quarantine with the promise of medical treatment. But it was in the greater good of the fort...",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1505003055",
			"date_added": 1505017915
		},
		{
			"comment_id": 14,
			"body": "@Musickiller: check the battle logs and see if he was bitten. if the bite penetrates his skin any deeper than the surface (i think its fat damage or worse) then he has been infected and will turn on the next full moon.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1505003055",
			"date_added": 1505056588
		},
		{
			"comment_id": 15,
			"body": "@Musickiller: Both of my last two forts ended after a dragon rampaged and burnt the entire embark site down. The dragons weren't particularly difficult to slay, but the tedium of unpausing the game every tick for 1 million ticks until the fire is finished was too much. Then you have to survive on the scorched earth.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1505003055",
			"date_added": 1505085097
		},
		{
			"comment_id": 16,
			"body": "@Musickiller: yeah, it wasn't nearly as bad as the time a fire broke out in my booze stockpiles. although it did put a temporary halt to my iron economy.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1505003055",
			"date_added": 1505166838
		},
		{
			"comment_id": 17,
			"body": "ST had a message and got it across in one go. So yeah it makes sense any sequel would flop, especially considering the movie was not a box office darling to begin with.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1505509178",
			"date_added": 1505509016
		},
		{
			"comment_id": 18,
			"body": "http://getgreenshot.org/",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1505514437",
			"date_added": 1505527683
		},
		{
			"comment_id": 19,
			"body": "@Musickiller: i mean it was financially unsuccessful (i think it was, unless i am wrong?) and not well regarded by critics when it came out. so making a sequel was pretty silly to do.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1505509178",
			"date_added": 1505527793
		},
		{
			"comment_id": 20,
			"body": "I don't think I know of anything cyberpunk that isn't common knowledge. If you haven't played the original Deus Ex, play that. If you haven't played Uplink, play that. You've probably already watched Akira. Hackers is a great movie but too goofy to get immersed in. You might try Cloud Atlas? It covers many different sci-fi subgenres, so it isn't entirely cyberpunk, but I recall there being some good cyberpunk scenes within it (but I could be wrong...). I know some good sci-fi, but I have a hard time finding anything cyberpunk.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1506446109",
			"date_added": 1506459448
		},
		{
			"comment_id": 21,
			"body": "@Musickiller: what I can tell you is that Deux Ex is the single most cyberpunk game I have ever played, so you are only hurting yourself by not playing it, whatever your reason is... But I don't really know any good cyberpunk movies. I'm either blind and ignorant, or cyberpunk was never well explored in western media.\n\nI couldn't really get into Else.Heartbreak() for some reason. It looks like a really good game but something about it is difficult for me to keep interested in it.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1506446109",
			"date_added": 1506460734
		},
		{
			"comment_id": 22,
			"body": "welcome! it won't be hard to find people who are fluent in chinese, so don't worry!",
			"post_uri": "1NjxV6oekXaTre7p6CjTEoqrpSfkD1Dpgh_1514008398",
			"date_added": 1514008966
		},
		{
			"comment_id": 23,
			"body": "meow",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1517938928",
			"date_added": 1517952628
		},
		{
			"comment_id": 24,
			"body": "i would say this place is never empty. just slow.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1517938928",
			"date_added": 1518041563
		},
		{
			"comment_id": 25,
			"body": "the nice thing is if you suspect they'll start observing zeronet users you can always go back and edit your old posts so nothing negative is being said by you.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1532638139",
			"date_added": 1532638887
		},
		{
			"comment_id": 26,
			"body": "i don't really dream of ever having as many as 10 people who care about me that much. right now there are probably 4, and of them 2 are the people who spawned me into existence. the thought of there being 100 people who cared about me actually fills me with a sense of dread. it makes me uncomfortable.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1533387249",
			"date_added": 1533419184
		},
		{
			"comment_id": 27,
			"body": "her face is very young looking and it caused me momentary confusion and distress",
			"post_uri": "1HSJXS26WAFxab3etLidavpj5zki3bC1Pm_1537634777",
			"date_added": 1537659944
		},
		{
			"comment_id": 28,
			"body": "@Tumbleweed: im unable to see beauty in things like this unfortunately. anyway, i dont doubt her age.",
			"post_uri": "1HSJXS26WAFxab3etLidavpj5zki3bC1Pm_1537634777",
			"date_added": 1537663788
		},
		{
			"comment_id": 29,
			"body": "there's no need to shut down zeronet to publish a site. you don't have to open the terminal either, signing and publishing changes can be done in the gui. are you having problems publishing your site without shutting down zeronet?",
			"post_uri": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1543711074",
			"date_added": 1543714786
		},
		{
			"comment_id": 30,
			"body": "my answer to your question is that zeronet has not been coded to make automated backups of your users.json file because having your users.json file mysteriously disappear is not a recurring problem. it is completely unheard of. if this is a bug, the best solution would be to resolve the bug, rather than to devise some automatic users.json backup built into the program. however, as of yet, there has been no information produced regarding this bug. the only person who has been able to reproduce it (yourself) has as of yet been unable to produce any useful data that would allow anyone to determine the cause of the problem and correct it.",
			"post_uri": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1543741280",
			"date_added": 1543766019
		},
		{
			"comment_id": 31,
			"body": "@ssdifnskdjfnsdjk@zeroid.bit: tor is bundled with the zeronet bundle. tor is automatically handled for you without having to configure anything. so this is already being done and has been for over a year.",
			"post_uri": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1543729715",
			"date_added": 1543766426
		},
		{
			"comment_id": 32,
			"body": "@Pexo: on the bundle i have on linux, it has tor bundled with it. in fact, this was NOT desired for me because i wanted to use tor that was already installed and running on the system. i have to invoke zeronet.py and explicitly state the --tor_controller ip:port and --tor_proxy ip:port to make it run with the tor i already had running.",
			"post_uri": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1543729715",
			"date_added": 1543767567
		},
		{
			"comment_id": 33,
			"body": "@Pexo: the date the tor subfolder was created was in the beginning of 2017. it was a while ago so maybe tor didn't work out of the box? i didn't want it to, so if it failed to use the provided tor i might not have noticed.",
			"post_uri": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1543729715",
			"date_added": 1543770012
		},
		{
			"comment_id": 34,
			"body": "@Pexo: oh i looked again at ZeroNet/tools/tor and you're right. there's not a binary there. on the windows bundle that is where tor.exe would be located, but it seems there is no tor binary provided for the linux bundle.",
			"post_uri": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1543729715",
			"date_added": 1543770949
		},
		{
			"comment_id": 35,
			"body": "@Quantumworld: i don't really understand your grievance. it is packaged with tor usage on windows, complete with a tor binary. on linux you might need to configure tor. if you need help configuring the tor software, zeronet has graciously provided instructions how to do it here: [https://zeronet.readthedocs.io/en/latest/faq/](https://zeronet.readthedocs.io/en/latest/faq/)",
			"post_uri": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1543729715",
			"date_added": 1543773825
		},
		{
			"comment_id": 36,
			"body": "@Quantumworld: adding users on zerome does not write anything to <ZeroNet directory>/data/users.json, which is where your ID information is saved. if you delete zeronet's data directory, that is where your IDs are stored. deleting those files will cause you to lose your IDs.",
			"post_uri": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1543741280",
			"date_added": 1543774220
		},
		{
			"comment_id": 37,
			"body": "@Quantumworld: i believe logs are saved in the root of the zeronet directory in a folder called \"log\"",
			"post_uri": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1543741280",
			"date_added": 1543774268
		},
		{
			"comment_id": 38,
			"body": "@Quantumworld: i'm not sure why you would assume i'm on an older version. i'm on 0.6.4, which i am led to believe is the latest version. what version are YOU on? what platform are you on?",
			"post_uri": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1543741280",
			"date_added": 1543775139
		},
		{
			"comment_id": 39,
			"body": "i never go to the clothing stores so i can neither confirm nor deny this outrageous claim",
			"post_uri": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1552155668",
			"date_added": 1552232664
		}
	]
}