{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1613773096,
			"title": "Can you implement the homesteading principle for namecoin domain names?",
			"body": "I see that zeroblog.bit worries about squatters who could overtake all the names: http://127.0.0.1:43110/0address.bit And the solution is to go private: \"Contact me, I'm one of the nicer guys.\" Which is absolutely fine with me, as long as anybody can duplicate the naming system.\n\nBut I wonder, in principle we have a good idea how ownership for projects/names/etc should be recognized on internets and in software in general: it is the homesteading principle, as described in \"The Cathedral and Bazaar\" by Eric Raymond. So, is there some way to implement it in the namecoin system?\n\nBecause, if things scale, zeroblog.bit will have to scale the \"contact me\" system too. So one way would be to setup some forum for name claims and disputes... and then you need a solution how to avoid spammers and resolve disputes.\n\nAnyhow.. just wondering.",
			"added": 1613773095
		},
		{
			"topic_id": 1613822778,
			"title": "A good Firefox plugin that automatically adds \"http://127.0.0.1:43110/\" to the URL?",
			"body": "There is ZeroNet Loader: https://addons.mozilla.org/en-US/firefox/addon/zeronet-loader/?utm_source=addons.mozilla.org&utm_medium=referral&utm_content=search\nbut it requires accessing all data on .bit and other domains. Not sure if that's safe.\n\nAny other options?",
			"added": 1613822776
		},
		{
			"topic_id": 1614206367,
			"title": "Just in case, here is the recent Trump's interview that YouTube took down",
			"body": "The over-the-phone interview for Newsmax:\nbig.kopykate.bit/?Video=1614205375_1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6\n\ngot it on Rumble https://rumble.com/user/BonginoReport",
			"added": 1614206364
		},
		{
			"topic_id": 1614725482,
			"title": "Media Says Economy Is Booming Because Of Government Spending!!",
			"body": "From George Gammon's \"Rebel Capitalist\" channel: https://www.youtube.com/watch?v=EYMdkvwhHiI\n\n> The economy is \"booming\" but for some reason they need to spend $1.9 trillion more and \"employment remains the main weak spot\"\n> Manufacturing is at its highest since 2018, with prices rising and inventories choked.\n\nXDDD These journalists truly can cover up and twist any info.\n\nOn Galactichan:\n19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/?:users/1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6:economy_and_finance:e0b422dd-9768-492c-a8ba-4cb77bfd8f73:50\n\nAnd KopyKate:\nbig.kopykate.bit/?Video=1614724267_1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6",
			"added": 1614725478
		},
		{
			"topic_id": 1617127820,
			"title": "Sue the Fed gofundme campaign!",
			"body": "Help to #EndTheFed before it ends your dollar:\n\nhttps://www.gofundme.com/f/sue-the-fed\n\nIt is always good to see some accountability from the government overlords.",
			"added": 1617127815
		},
		{
			"topic_id": 1618878945,
			"title": "Bitcoin taxes",
			"body": "https://www.youtube.com/watch?v=0OK3YV9VCms\n\n> Bitcoin Billionaires Beware - Tom Wheelwright and Robert Kiyosaki on Bitcoin taxes\n>\n> If you sold, mined, or traded cryptocurrencies in 2020, then this episode is for you! Tom Wheelwright, Rich Dad Advisor on Taxes, warns listeners as they prepare for filing taxes this year, “Anytime you use or trade your virtual currency, that’s a taxable event.”\n>\n> But what does trade mean, exactly? According to Tom, if you did anything other than just buy it, then you have to declare it—if you don’t it’s a felony.\n\nWell, well. They almost made private money.\n\nOr it is not too bad? With taxes they don't need to outlaw bitcoin. But it looses the concept of being a money, a vehicle for transactions. Will they eventually make some fedcoin-govcoin and tax bitcoin out of existence? Maybe it can still be an asset, and, like Tom & Robert say, you have to juggle assets and debts, and \"shift with the government\" to avoid taxes and profit from the statist idiocy. What do you think?",
			"added": 1618878939
		}
	],
	"topic_vote": {
		"1613257982_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"1613397635_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": 1,
		"1613761105_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": 1,
		"1613773096_1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6": 1,
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1613799897_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": 1,
		"1613831892_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1613919312_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1614059150_16rxab891cbjircKRgX7FafERcSn8BPdkd": 1,
		"1613969481_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1613921466_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt": 1,
		"1611909944_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": 1,
		"1614262972_1BsALUkhotDeqP9x5KLNLAn7Hepw3KRa3Z": 1,
		"1617039004_1EDgrafDZQ8H6WLq6jHin6NKfQ8qZKzA1C": 1,
		"1617049867_14yMvcYduUdrbFWW5taEgW1HgaFJgoSxZT": 1,
		"1618547913_1Gg1sTkqAaXfMmVVG6yghf3FF8D3RJuChf": 1
	},
	"next_comment_id": 18,
	"comment": {
		"1613397635_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 1,
				"body": "but why not post it on kopykate?",
				"added": 1613411113
			}
		],
		"1613761105_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": [
			{
				"comment_id": 2,
				"body": "> [ihaphleas](#comment_7_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A): ... but I'm trying to point out the utility that crypto has over gold ... while also being resistant to central bank manipulation.\n\nSome pros for crypto VS physical gold: it is not physical. It must be easier to store, transport & exchange. Therefore the commissions for crypto transactions must be lower than for gold, and there is no royalty to store it.\n\nOn the other hand, the physicality has strong aspects against other situations. Crypto requires the publicity of the record of who owns how many coins. So, in principle your transactions are publicly visible. (And also the network that maintains this record must be really powerful to withstand any subversion attempts.) Gold and any other physical means of exchange provide privacy. They can really be off the grid.\n\nAlso, metals have actual economic value: gold, silver, copper and other metals are used in various high-tech processes. (Like in making solar panels, electric batteries and cars.) So, metals cannot be completely abandoned, and in principle crypto can be. Though, I guess you can argue from economic perspective that crypto can only be really abandoned if we abandon computers and internet, which is not likely. But probably there are other ways to make people abandon crypto.\n\nBut probably right now the biggest difference is in timing. Crypto showed up very recently, it is early in its evolution. The market is still small, and 21 million bitcoins is very few for the population of Earth. So if people do use it, then the price can go very high. On contrary, gold has been around for long time, it is well established. Its supply is also limited (amount of gold mined per year VS the growth of Earth population). But it is not concentrated in a small market of early adopters, it is already spread around the planet. So, it cannot go as high as crypto.\n\nFinally, probably the largest threat to crypto is central banks & governments. They will not just stand aside, if it becomes really successful. And it is becoming successful exactly because of their projects and failures. So you could speculate that in long run they will inevitably drag crypto down together with themselves.",
				"added": 1613772038
			},
			{
				"comment_id": 3,
				"body": "> [aim64c](#comment_99_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): This, specifically, is why I am more a fan of Monero over Bitcoin.  Monero has some better overall features and has a baseline mining production to it (so it will, over the long term, be inflationary, but the new coins added to the system will be at a flat rate once the initial seeding has completed).  One of the better features of Monero is that it uses an encrypted ledger system and breaks the chain of transactions.  So it is a far more private currency which prevents situations of 'dirty coins' - which Bitcoin already has a bit of an issue with.\n\nYes, I also like Monero features. And the mining production is a good thing. I kind of think that the phenomenon of loosing bitcoin wallets is a serious problem. It is life, you know. Things happen. And if we compare bitcoin to gold, then bitcoin must live for some centuries. How many wallets will be lost over that time for some random accidental reasons?\n\nBut, unfortunately, stronger features put crypto currency more in the focus of the threat from central banks/governments...\n\nRight, the point that crypto cannot be easily seized -- I forgot to mention that! There has already been a case with some German guy : \"A German man is keeping $60 million in bitcoin from police by never revealing his password\" https://www.theverge.com/tldr/2021/2/5/22268646/german-police-bitcoin-digital-wallet-missing-password\n\nThe guy went to jail for a year or two because of allegedly some bitcoin scam (I do not remember the story, but I remember it did not sound like a real scam. Though, maybe he ran a virus to mine bitcoin on random people's PCs. Not sure.) They could not get the wallet out of him and when he came out bitcoin was significantly more expensive :D\n\nYeah, I think governments won't buy crypto, they will look for legal ways to either get it or ban it. By \"sending hunting dogs\" as you said. And yeah, probably at that point they will have economy ruined so much that there won't be stuff to support the army and so on. That is a gloomy but somehow positive outcome, in an ironic way :)\n\nBtw, do you know George Gammon's YouTube channel \"Rebel Capitalist\"? From time to time he speculates how this can play out. Recently there was a good point: since economy slows down, people do not have a lot of (real, not printed) income. So the government will not get enough tax revenue from income and other taxes on economic operations. And at the same time, people convert money into assets, including stock shares and bitcoin. So, the government will have to invent some scheme how to tax ownership of assets, not the income. They push the incentives to stop the money from moving and turn it into assets, as the result the money will indeed stop moving and they will not get enough tax from the money that spins the economy. It sounds a little backwards, but hey! Can anyone be surprised anymore?\n\nI cannot find the video with this speculation. But for example, here is one about the crazy financial and economic data from the last year: https://www.youtube.com/watch?v=m6KkRdZRC_I",
				"added": 1613775879
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 4,
				"body": "> [thewhispering](#comment_22_1JorDyDxuLrircDbzzmn4B1ndcbSJahXLH): Do you have a link to this ZeroMusic? I have just returned to this platform and cannot remember how to find Zites like I would on the regular internet.\n\ndid you try the zeromusic.bit domain name? http://127.0.0.1:43110/ZeroMusic.bit/",
				"added": 1613777664
			}
		],
		"1613773096_1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6": [
			{
				"comment_id": 5,
				"body": "actually, there should be a way to claim a lost/abandoned name, right?",
				"added": 1613777771
			}
		],
		"1613822778_1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6": [
			{
				"comment_id": 6,
				"body": "> [higgsbozon](#comment_3_193YCP9moB9iMgASvyoy89d8J4YHr51xS1): Why? In About:Config make this: \"keyword.enabled - false\", \"browser.fixup.alternate.enabled = false\" - Don`t add \"www\"\n\nthe prefix does not seem to work for `ip:port/` kind of thing... it seems like it works only to add domain names",
				"added": 1613916266
			}
		],
		"1614076622_1JZUqZCoYgeS1STseW5nQPN2Pfh19F7Vuf": [
			{
				"comment_id": 7,
				"body": "ok, but no peers now!",
				"added": 1614114939
			},
			{
				"comment_id": 8,
				"body": "> [xealits](#comment_7_1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6): ok, but no peers now!\n\nand I turned on \"help to distribute new files\"...hmm it did not work somehow?",
				"added": 1614114990
			},
			{
				"comment_id": 10,
				"body": "> [melodysheepfan](#comment_1_1JZUqZCoYgeS1STseW5nQPN2Pfh19F7Vuf): now i turned on my peer. you should download all files from now when my node or any other node with the files go online with you. this should avoid the dead share of my files\n\nyep, that's the plan. But right now there are no peers again. I guess I missed you again.",
				"added": 1614206471
			},
			{
				"comment_id": 11,
				"body": "> [melodysheepfan](#comment_1_1JZUqZCoYgeS1STseW5nQPN2Pfh19F7Vuf): now i turned on my peer. you should download all files from now when my node or any other node with the files go online with you. this should avoid the dead share of my files\n\nMy Zeronet's File statistics shows these files! I got about half of each. But Galaxychan shows like I have 0% for some reason... :\\",
				"added": 1614207148
			}
		],
		"1611968483_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 9,
				"body": "asking for UBI is like asking to make yourself a serf. You could go further and just ask to be inserted into a Matrix.",
				"added": 1614115377
			}
		],
		"1614206367_1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6": [
			{
				"comment_id": 12,
				"body": "Or a smaller 360p file:\nbig.kopykate.bit/?Video=1614207582_1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6",
				"added": 1614208027
			},
			{
				"comment_id": 13,
				"body": "And on IFS:\n12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f1_1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6_item_1+type:video",
				"added": 1614210005
			}
		],
		"1614725482_1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6": [
			{
				"comment_id": 14,
				"body": "> [deuxzaron](#comment_103_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): It seems giving people their tax money back allows them to spend it themselves..\n\nis it tax money or printed money?",
				"added": 1614764504
			},
			{
				"comment_id": 15,
				"body": "> [styromaniac](#comment_2996_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Learn to create hyperlinks. What you're doing is inconvenient for others.\n\nthe YouTube hyperlink is there for you. It is also the original. If anybody is interested in economics/finance, I recommend to subscribe there.",
				"added": 1614764937
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 16,
				"body": "the greatest and most muscular, of course",
				"added": 1619203298
			}
		],
		"1619820771_1HtGhiVHZwMd5UW9SyW6uWb91Tsy4gcxo1": [
			{
				"comment_id": 17,
				"body": "breathe! in - out - in - out - just breathe",
				"added": 1619910897
			}
		]
	},
	"comment_vote": {
		"99_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"2_1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6": 1,
		"5_1LqdvKDPZkkuq472J2ZdANDSd1JNK7CrHW": 1,
		"6_1LqdvKDPZkkuq472J2ZdANDSd1JNK7CrHW": 1,
		"3_1MW2ZSiMdJJTdhHUbV3ddi7NMdsiqKghX3": 1,
		"791_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"71_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"5_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"58_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": 1,
		"1_1JZUqZCoYgeS1STseW5nQPN2Pfh19F7Vuf": 1,
		"12_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": 1,
		"100_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"63_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": 1,
		"3_1BsALUkhotDeqP9x5KLNLAn7Hepw3KRa3Z": 1,
		"7_1CL3T1Xn3FtyyfhFhfjCiEiaVzhmQoYCmc": 1,
		"23_1LQt9gDDNMnknHDQ43S4WYaXxocLyFzpVd": 1,
		"34_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": 1
	}
}