{
	"title": "CryptoTomis",
	"description": "Discussing cryptocurrencies, dApps, and the blockchain.",
	"links": "ZeroNet ID(s):\n**tomascw@kaffie.bit**\n**tomascw@cryptoid.bit**\n\nEthereum ID(s):\n**tomiscw.gitcoin.eth**\n\n* * *\n\n![](img/monero-44xZ.png)\n![](img/ethereum-0x341.png)\n\n* * *\n\nTo the extent possible under law, the person who associated CC0 with CryptoTomis has waived all copyright and related or neighboring rights.",
	"next_post_id": 83,
	"demo": false,
	"modified": 1532421533,
	"post": [
		{
			"post_id": 81,
			"title": "\"One true Bitcoin\"",
			"date_published": 1532324673.98,
			"body": "![uJ9XE06.png (1165x129)](data/img/post_81_uJ9XE06.png)\n\nI follow Bitcoin.com News. Despite it's name, it actually promotes Bitcoin Cash. They consider it to be, in many ways, the \"one true Bitcoin.\" By that, it follows Satoshi Nakamoto's vision to a T. The problem is they're two halves of the same coin - quite literally if you take their name into account. It solves one problem but overlooks another.\n\nI praise Bitcoin Cash's vision of treating the cryptocurrency as a money, rather than an investment. Cash's goals was to increase the block size limit in order to allow for more transactions, as oppose to moving microtransactions to another chain. Both methods have their pros and cons but I kinda like Cash's approach. That being said, Cash still has a limited supply so it may wind up becoming just like Bitcoin in the long run.\n\nOpposing factions sparked in the wake of the fork that go on within either community daily. I see it a lot on Bitcoin.com. This sometimes leads to amusing childish banter. I find it all rather silly, though I can understand why both sides would be so protective since both make legit arguments.\n\nBut all of this stuff that will likely subside in the near future or continue until one or both networks collapse. I feel as the latter is inevitable, due to the constant increase in difficulty requiring even more power. It isn't sustainable. Both sides would disagree with my argument. Saying that benefits of the system being secure by mining outweighs the power consumption. But then this leads us right back to profits over people and gets at the heart of why Bitcoin was created in the first place: to get away from the big banks.\n\nNow, I wouldn't be surprised if anyone here comes out and points at me for my affinity towards Monero. It's true that I side with it over Bitcoin and many of it's derivatives. I'll admit I don't know where it's future will head but the fact remains that it's network, although not perfect, is far more greener than Bitcoin's."
		},
		{
			"post_id": 77,
			"title": "Four pools",
			"date_published": 1528209772.155,
			"body": "I was hoping to not do this but alas. Forgive my rant.\n\n![36551112634_65de2597c6_k.jpg (1200x362)](data/img/post_77_36551112634_65de2597c6_k.jpg)\n\nYou might remember my two posts regarding a freind who wanted to [gamble on shitcoins](/1NKKKZ5gzyHEAR31Jg7JrMi2PxjBYcg2dH/?Post:62:I+didn%27t+get+into+cryptocurrency+to+gamble) in order to make an extra buck. This is an update to that. He decided not to and also quit mining Monero today. Normally I wouldn't care if it weren't for his reason behind it. He wasn't making the money, oh so claimed. My issue with that statement is because it doesn't take into account why he wasn't making so much and that Monero's current drop in value was the reason, despite my repeated claims that it has rarely drops under $100.\n\nThe problem is this reason does not reflect reality. The reality is that he had jumped through three pools prior before settling on that gave out a bigger hash rate then the I had initially suggested. Which is the reason he has such low payout. He barely gave it a chance because impatient at having to wait, despite ideal and conservative estimates both giving good long term result.\n\nThis, all while he is supposed to be teaching me Free Pascal even though he is as ignorant at the recent changes as I am of the language as a whole. This was profoundly made clear in one of his examples with pointers that blew up in his face. He spent so much time trying to get that one example to work that I just did my own real world experiments with the language I'm already at the stage where I feel like I could use it in real world settings. It's just have to research into it's ecosystem.\n\nLook, I don't want to sound like I'm better then him. I'm not. I have my own faults as well that have bitten in the ass one too many times. But for fucks sake."
		},
		{
			"post_id": 76,
			"title": "DTube, decentralized video sharing",
			"date_published": 1528018002.117,
			"body": "![vimn_master-core-lockup-10-blue-grey.png (1000x267)](data/img/post_76_vimn_master-core-lockup-10-blue-grey.png)\n\nWe are all aware of YouTube's humble beginnings before Google brought it. It's gradually fallen in recent times due to censorship from varies corners. I don't see this all Google's fault but they are definitely contributing to it. I see Viacom as the original sin. Viacom sued YouTube for users uploading their content. Google has since taken great measures to make it easier to file DMCA complaints but this has since been abused in censoring reviewers and journalists. Then politics slowly creeped in and further forced the company into a difficult position. Obviously, they're somethings that is Google's fault, such as their crumbling business model of forcing advertisements down our throats.\n\nThey're plenty of alternatives to YouTube that exist. Some are alternative services, like DailyMotion, while others allow you to spin your own, like ClipBucket. But these are all still centralized in nature and are not very good when compared to YouTube. It's kinda one of those scenarios.\n\n![dtube_banner.png (1024x150)](data/img/post_76_dtube_banner.png)\n\nThen they're two decentralized alternatives based on the blockchain that exist: BitTube and DTube. Both rely on IPFS for storage but have radically different business models. BitTube uses it's own Cryptonote-based currency, known as Tube, while DTube uses the existing Steem blockchain and currency. BitTube is partially open source, it's front-end is closed, while DTube is fully open source. So my attention is focus on DTube because, even though they don't have live streaming like BitTube, I consider fully open source software more trust worthy.\n\nDTube is based on Steem. Steem, or STEEM, is a blockchain platform that I've questioned in the questioned due to the [criticism](https://en.wikipedia.org/wiki/Steemit#Criticism) (clearnet) it got when it launched. But it's meant for content creators. Steem is mined through \"likes.\" This is somewhat of an ingenious business model since money is literally based on your effort. I don't know what the long term implications but the intentions here are good. So DTube is essentially this from a monetary perspective. Likes earn you SMT. You can earn money without ever getting a like. As of this writing, SMT is worth $2, so uploading a video alone grabs you $0.078\\. Meanwhile, 240 likes grants you $280.\n\nThe decentralization itself is also becoming more robust. They recently added a WebTorrent as a backup just in case IPFS suffers a bug that effects video performance. Improvements like this ensure it'll be impossible to censor.\n\nSo how to pan out personally? From a consumer perspective looking in without an account I can tell you the experience is seamless, almost akin to YouTube itself. They're only two video quality options, atm: source and 480p. They'll be rolling out HD soon. Steem is also used for identification. There is a free and pay option. Free takes 2-3 weeks, in order to counter spam bots, where as pay is instant. I choose free and I'm now just waiting.\n\nFinally, DTube is open source. That means anyone can run their own instance of the dApp. It's split into varies repositories under a single organization because it grew so big. The main app is further split into two versions: uncompressed, developer version, and the compressed, production version. I downloaded the production version because I wanted to see how it would run without anything. And it just worked flawlessly. So it's possible to have many different DTube instances under many different brands that all present the same thing uniformly."
		},
		{
			"post_id": 74,
			"title": "Ethereum Name Service",
			"date_published": 1528003016.912,
			"body": "In the past I had mentioned that blockchain could be used for decentralized identification. [Blockstack](https://blockstack.org/) (clearnet) is the most popular standalone method. It uses the addresses normally reserved for sending and receiving cryptocurrency as a way of identification. It's possible to get a more human readable name using OneName. The problem with OneName is that you're pretty much stuck with said name the rest of your life which isn't good when the first name you choose happens to be your failed attempt at a company.\n\n![a1e.png (500x205)](data/img/post_74_a1e.png)\n\nI've kinda avoided the two since then but I'm still curious about decentralized identification in general. Which is why when I searched for ENS. I was surprised to realize that it's purpose was somewhat similar to Namecoin. ENS was something I kinda glanced over because I thought standalone solutions of the former mentioned were good enough. As with everything Ethereum, I was wrong.\n\nWith ENS you own a .eth or .test (for testnets) domain which is tied to a Ethereum address - this can either be your account or a contract. What do you with it is up to you. One of the most common use cases is memorable account addresses. Second common use case is websites but this is still under development. Domains are a bit tricky and costly to setup but subdomains are designed easy and only cost Gas. So wallet identification is often reserved for the latter.\n\n![2018-06-03_02-19-42.png (357x197)](data/img/post_74_2018-06-03_02-19-42.png)\n\nI tried and got my first ENS address for my Ethereum account from [Gitcoin](https://gitcoin.co/) (clearnet). They mine the gas on your behalf, all you have to do verify the transaction and the name is yours. Now my ID across the mainnet is, for the first time, [tomiscw.gitcoin.eth](https://etherscan.io/address/tomiscw.gitcoin.eth) (clearnet) points to my account address, 0x341A3A994A150962F3e82b195873B736dAEb4bB3\\. Much, much, much simpler. Metamask and MyEtherWallet, to name a few, all point to my address when you enter it now.\n\nIt isn't Blockstack, Namecoin, or Onename but this is definitely a practical way to solve the online identification problem with plenty of applications but without too much overhead you would get out of a full node. Although I'd definitely go with Gitcoin's approach for anyone who doesn't have the Ether to spare."
		},
		{
			"post_id": 71,
			"title": "Opening Blockchain's Box",
			"date_published": 1527941998.755,
			"body": "_This was originally written on Medium._\n\n![Blockchain_Illustration.jpg (1024x302)](data/img/post_71_Blockchain_Illustration.jpg)​​​​​​​\n\nBitcoin was nothing more then a working proof-of-concept when it first came out. A “what if” to see if those who developed it could get back at the financial industry after the 2008 recession by removing the middle man altogether. At it’s core is the blockchain, a continuously growing list of records, called blocks, which are linked and secured using cryptography. This is how it’s able to remove the middle man. Bitcoin’s network is secured by mining said blocks based on an mathematical problem that must be solved. It then rewards said miner with money, adds that block to the chain, and moves on to the next problem. I’ve dealt with the pros and cons of varies mining methods in the past. So the focus is on the blockchain, Pandora's box.\n\n> Blockchain is becoming not just about bringing money back to the people but information in general.\n\nWhether the initial Bitcoin developers had the foresight to see what would become of the technology we will never know. But the people who would eventually create Ethereum did. They knew that blockchain had the chance to change the world beyond the financial industry. They coined Ethereum as “The World Computer” because their’s is nothing more than a blank slate that anyone can write to — tokens, voting, identity, event tracking, governance, you name it! And it worked. Ethereum is even being used to [decode live video](https://livepeer.org/) (clearnet) and [register domain names](https://ens.domains/) (clearnet). Blockchain is becoming not just about bringing money back to the people but information in general. Removing the need for a single point of failure and becoming censorship-resistant as well.\n\nThe last one is important because there is a lot going on in the world right now. A lot of it is good and bad. Both are equally subjective and objective. But some people want more subjectivity in order to seed doubt, cause chaos and make it easier to censor. Decentralization eliminates that last one. I don’t know what will happen but I know it will be profound."
		},
		{
			"post_id": 64,
			"title": "Tendermint, Cosmos & Ethermint",
			"date_published": 1527291759.135,
			"body": "Talking about [Ethereum](/1NKKKZ5gzyHEAR31Jg7JrMi2PxjBYcg2dH/?Post:63:Ethereum+Ethermint) (clearnet) brings me to my next blockchain-as-a-platform subject. [Tendermint](https://tendermint.com/) (clearnet). Tendermint is designed to make the production of cryptocurrencies or dApps just like Ethereum but the goal is allow for custom blockchains, not just tokens, while still abstracting enough the boilerplate you would if you were to normally if you forked Bitcoin. It's an evolution of blockchain technology as a whole and illustrates how far we've come.\n\n![ethermint-header.png (1280x400)](data/img/post_64_ethermint-header.png)\n\n[Ethermint](https://github.com/tendermint/ethermint) (clearnet) was created to see if Tendermint could be used to port the EVM over to Tendermint platform, and sure enough, it worked. That laid the foundation for [Cosmos](https://cosmos.network/) (clearnet), a way of having all the Tendermint blockchains interact with each other by using Ethereum's principles, with Atom being the equivalent to ETH. However, Cosmos is 89% complete, as of this writing so it has a little ways to go.\n\nThis bring me back to Ethermint. Cosmos is their baby but Ethermint exists as another option for Solidity developers for whatever reason you want. Personally, I'd use it to just get away from the drama normally associated with the primary chain, e.g. The DAO. Livepeer have also taken an interest in Ethermint until Cosmos is completed.\n\nThe Cosmos team have also created a [peg](https://github.com/cosmos/peggy) (clearnet) to interact with Ethereum. They created a smart contract for both ends that allow for transferring of Eth between both platforms, despite the radially different architecture.\n\nThe evolution of the blockchain technology has evolved rapidly since the introduction of Bitcoin. It has transformed from a currency, to an application with a possible currency, to a platform for building the former two. And all this without ever relying on a middle man.\n\nWords can't begin to describe how profound this is."
		},
		{
			"post_id": 63,
			"title": "I have underestimated Ethereum",
			"date_published": 1527288605.104,
			"body": "![ethereum-header.png (1280x261)](data/img/post_63_ethereum-header.png)\n\nEthereum has been dubbed as the \"world computer,\" if I'm not mistaken, which uses blockchain as a platform, not just a currency. And it has fulfilled that goal, even though it's still rough around the edges. This is a topic I meant to touch on earlier before I wind up [ranting](/1NKKKZ5gzyHEAR31Jg7JrMi2PxjBYcg2dH/?Post:60:Mining+Monreo.+Aren%27t+you+glad+he+thought+of+it+) about a freind of mine where I alluded to it a couple times there and in the [follow up](/1NKKKZ5gzyHEAR31Jg7JrMi2PxjBYcg2dH/?Post:62:I+didn%27t+get+into+cryptocurrency+to+gamble).\n\nI have followed the news regarding and even witnessed the fall out that lead to Ethereum Classic but I never really paid attention beyond using Eth as possibly another currency. I wasn't that interested in the dApps because there was none that suited my interests until I tripped upon [Livepeer](https://livepeer.org/) (clearnet), something I had also been meaning to touch on. It was here that I realized the obvious: it's not just a platform for dApps but it's an entire ecosystem of dApps that all share a common currency. Eth is literally a universal currency for all dApps.\n\nThis profound realization made realize how much I've just been scratching the surface of this technology. I mean, I always knew Eth was used to write and distribute dApps but I didn't really consider that those same apps could then accept both the custom token and Eth simultaneously. I didn't figure this out until I started fiddling with Livepeer to try test broadcasting interface through it's testnet. No wonder it's valued as high as it is.\n\nI mean, here I am reminiscing over a dead MMO that got revived in a similar fashion to OpenTTD that I was kicked out just as it hit it's beta release. When I could I easily recreate the MMO's mini-games in Ethereum.\n\nPeople who want to get Ether just for the money are welcome to do that but they'd be profoundly missing the bigger picture, in my opinion. Sadly, my freind seems to done just that. He seems only focused on weather he can make a buck with the damn thing through mining no matter how many times I've shown what else blockchains are truly capable of."
		},
		{
			"post_id": 62,
			"title": "I didn't get into cryptocurrency to gamble",
			"date_published": 1527030023.12,
			"body": "![Gambling_chips.jpg (750x240)](data/img/post_62_Gambling_chips.jpg)\n\nA follow up to [Mining Monreo. Aren't you glad he thought of it?](/1NKKKZ5gzyHEAR31Jg7JrMi2PxjBYcg2dH/?Post:60:Mining+Monreo.+Aren%27t+you+glad+he+thought+of+it+)\n\nAs I said, I got my freind into mining Monero. I just wanted him to make a little extra. I told him the cryptocurrency was stable. It hovers $100 to $200 daily. I consider that stable. But he refuses to listen to me, treats the smallest percentage as if it was the end of the cryptocurrency and has completely reverse engineered the situation so even though I get the credit sparking his interest again, he is now calling the shots, despite the fact I'm the one who has been involved far, far, longer. All because he found a better pool. None of this was enough is for him. His interest in Monero and cryptocurrency as a whole is not as a currency but as casino tokens.\n\n![Bitcoin-Casino.jpg (670x295)](data/img/post_62_Bitcoin-Casino.jpg)\n\nHe thinks it's better to mine the shitcoins on the assumption he can just payout the moment the value skyrockets. However, my experience in cryptocurrency over the years tells me that will never happen. Furthermore, the lack of tail emissions in the majority of these coins means that once the last coin has been mined that's it. You'll be hopping from currency to currency once the because the network is non-existent outside of the miners because no one will be there to pay for the fees.\n\nThose concerns aside I think it's a bad idea altogether. The point of this exercise was not gamble on shitcoins. It was to provide a stable cryptocurrency for him to mine on in order to make a little extra money since he already gets money off of disability.\n\nHe repeatedly tries to stress to me that this all for the greater good for the both of us but I honestly feel like this is all about him. I only found out his true feelings about Monero because he was discussing everything I just described with another old freind of his as I'm sitting there.\n\nMy input on the situation has been shoved to the wayside. The only time I've ever had any room to breath is when we discuss programming. We've known each other for a long time, had many laughs, shared many secrets, he considers my actions as an leader commendable, but he treats me like an acquaintance. As I've said before, all I can do is watch him crash and burn."
		},
		{
			"post_id": 60,
			"title": "Mining Monreo. Aren't you glad he thought of it?",
			"date_published": 1526951880,
			"body": "![zencash.jpg (800x263)](data/img/post_60_zencash.jpg)\n\nHow one values cryptocurrency is different for everyone. I value it base on weather I can mine it, I can trade it for another, and it's usefulness. I've stuck with Monero all this time because I was happy just knowing that there was a coin out there that an average person like me could mine. I knew full well I wasn't making a decent profit but I was happy knowing that I was at least making _something_ after Bitcoin failed to meet my expectations in regards to mining. That's what makes it useful.\n\nMy freind was originally turned off by cryptocurrency due to Bitcoin being impossible to mine. So he stayed away, doubting the whole thing, while I continued to remain hopeful but realistic. I told my freind about Monero and how he could mine it since his computer was custom gaming-like rig that was more then capable to anything I could ever make. And I was right, it was, he would get $300/yr to $900/yr based on conservative and ideal estimates, respectfully. He gave the impression that this was all for shits but it has since became more then just that. But my freind wants us to be competitive in the mining by looking for other cryptocurrencies that my computer could possibly mine. Even though I've expressed no interest in any another cryptocurrency beyond Ethereum.\n\nThe reason I have an interest in Ethereum should be pretty obvious: it's abilities for creating decentralized platforms makes it useful beyond a currency. [Livepeer](https://livepeer.org/) (clearnet), a decentralized streaming platform built on it, is something I've taken interest in this because I enjoy making and editing films. Despite that, he glossed over it, educated me why exchange rates, and has taken interest in becoming an investor.\n\n![just_shut_up_-_scan.jpg (1031x900)](data/img/post_60_just_shut_up_-_scan.jpg)\n\nAnd I'm just thinking to myself, \"when did this stop becoming 'just for shits'?\" That was all this was about. He continuously ignored a freind of mine who told him that I was more experienced in this field, having not given up when he did, and said to give it a week - to which I agreed with on both. Nope!\n\nInstead he wanted to mine cryptocurrencies worth less $100, such as **ZenCash** (as of this writing), cheat the system and play the \"stock game,\" as he calls it, i.e. capitalize on early coins. I've already switched pools twice because of him. The last thing I need right now is to mine another cryptocurrency that isn't even useful to me. _\"[If we're gonna make this work,] we gotta hope these coins go up in value.\"_ I shit you not. Now, after trying ZenCash for less then 10 minutes, he wants to take look back at Monero, see it's market cap and long term worth. Shocker. It's value is stable, as I've stated over and over and over and over and over to him.\n\nThen the entire time I just want to yell at him and say, \"WHY DO YOU THINK I CHOOSE THIS CURRENCY?!\" But apparently he knowingly or not reverse engineered this entire scenario so mining Monero is now _his_ idea. Because heaven forbid someone with experience be right about anything.\n\nAnd who knows? Maybe this is karma for what happened with me and the guy who reverse engineered The Sims Online. I highly doubt that, though, since he has been an ass to another freind I alluded to earlier before and has been nice to me in the past as well as admitting I'm good at problem solving. So god knows what's wrong with him."
		},
		{
			"post_id": 57,
			"title": "Decentralized identification",
			"date_published": 1520160304.747,
			"body": "Enough doom and gloom. Let's focus on a more lighter side for once. Blockchain as a service. It's something I experimented with throughout most of February. Now let's set the stage...\n\nOnline identification is becoming tedious and more risky venture to take. This has to do with the recent rise in hacking of networks on networks like Yahoo! Decentralized identification is one way to combat this by removing the middle man altogether.\n\nFormer popular methods involved a federated setup under a common protocol. OpenID was one solution before the OAuth took off. It provided a way to sign up to multiple providers then link those providers to a single account on a website. This provided redundancy and some level privacy but proved to be vulnerable since it still relied on the provider to exist in the first place. So generally speaking this does not have to rely on the blockchain.\n\nHowever, OpenID's biggest problem was the very fault I described. Providers kept disappearing, and now they're pretty much non-existent since the rise of OpenID. Once they were gone, you couldn't recover your account and had to fallback to whatever provider was still around or go with your username + password.\n\n![blockstack.png (800x148)](data/img/post_57_blockstack.png)\n\nBlockchain or blockchain-like methods is one way to combat this since the service is distributed by individuals through nodes, making it more fault-tolerant. So far one notable solution to this exists: Blockstack. Blockstack takes the idea of seed generation found in modern cryptocurrency wallets uses that as the biases for a recoverable identification service that can be used on any computer. It's basically Electrum but for web authentication and registration. Right now it's built on top of the Bitcoin blockchain, though it is possible to extend it to others, using a namespace in the future. So, technically speaking you could use the identification service on a Monero blockchain - which I would prefer, tbh.\n\nThe platform is live and ready today. They're even eating their own dog food on with this one too by having their forums optionally use Blockstack as a way of authentication. By default, the client uses Blockstack's own as an external node in order to bootstrap the service. In the future, you'll be able to connect to your own node. The source for both is open for anyone to look at. So none of it is behind closed, it's just not ready yet.\n\nThis is a great solution that is very similar to how ZeroNet does identification but for the open/clearnet. Now obviously they're other solutions out there but this one is the one I remember the most and have an account on today."
		},
		{
			"post_id": 56,
			"title": "Bitcoin is dead. Long live cryptocurrencies.",
			"date_published": 1520142383.157,
			"body": "![800px-Bitcoin_logo.png (800x167)](data/img/post_56_800px-Bitcoin_logo.png)\n\nWith Gates taunting all crypto as bad, Fast Company just [wrote an article](https://www.fastcompany.com/40537404/how-bitcoin-ends) singing the end of Bitcoin. It showed up on my Firefox Pocket feed. Singing the end of Bitcoin is nothing new but Fast Company sung a different tune: _\"is the cryptocurrency just going to end up reenforcing the financial system it was supposed to disrupt?_\" But, here's the thing, that's just Bitcoin.\n\nThe fact it was open source from the start is why we got an industry full of cryptocurrencies and not a monopoly of one. Even if Bitcoin ends, others, who are more efficient, will gladly fill in the gap. Thus, long live cryptocurrencies.\n\n![Gold_Ingots_on_white_background.jpg (1200x388)](data/img/post_56_Gold_Ingots_on_white_background.jpg)\n\nAnd maybe this what has to happen - I dunno. Something has to give in order for the market to mature and cryptocurrencies to be recognized as currencies, and not just as an asset. But maybe Bitcoin should be an asset.\n\nBitcoin is fundamentally based on idea of gold - that's why the logo is gold coloured to begin with. Mining is also a concept that goes back to the gold rush. Further more both have a finite amount. The problem with gold, as I've been studying economics, is the very fact that it's finite. America had the most of the gold by the end of WWII so every other currency in the world pegged to the US dollar but this [caused more trouble then it was worth](https://www.theatlantic.com/business/archive/2012/08/why-the-gold-standard-is-the-worlds-worst-economic-idea-in-2-charts/261552/). So Nixon scrapped it.\n\nIronically, having an infinite amount of money in the system is more economical because it can better scale to meet an ever growing demand because there will always be money in circulation. They'll always be those people who want hoard their stash so new money needs to be printed in order to keep things balanced. Of course, this can easily be undone if too much is printed, and create hyperinflation. Bitcoin, however, may be experiencing the opposite - [hyperdeflation](https://medium.com/@netcashfx/bitcoin-an-experience-of-hyperdeflation-5f7ac369b721).\n\nMoney is a very tricky science and, I'll be honest, I never expected to grow up become an somewhat literate in economics. I still consider myself an artist first. However, Satoshi laid the foundation for a new way of digital commerce but we should not limit ourselves to his vision word-for-word or we'll never evolve."
		},
		{
			"post_id": 55,
			"title": "The scaling problem",
			"date_published": 1520060857.818,
			"body": "Ever since Bitcoin Cash, the biggest reason behind forks is as a result of the \"scaling problem.\" My issues of scaling stem more from the hardware infrastructure but a lot of my topics due to fall under this issue as well. The scaling problem mostly falls under:\n\n*   Fees\n\n*   Blockchain\n\n*   Supply\n\nFees and blockchain is easy to solve, supply not so much. The problem with supply is we don't know which solution will work: limited or emission-based. Those familiar with the subject say that the former makes it more liable to become a speculative currency where as the latter doesn't seem to have."
		},
		{
			"post_id": 53,
			"title": "Bitcoin's future (cont.)",
			"date_published": 1519991809.562,
			"body": "I remember when I first got into Bitcoin. It was around the time GPUs were used to mine it. It was still small with very little market capitalization and value. At the time, faucets gave out a lot more Bitcoin then they do today. Technically I shoulda be rich but this was an era before seed generation and recovery. I supported it so early on because, well, ever since we moved down south we've been at a financial disadvantage. Bitcoin seemed like the only logical conclusion for me due to the low entry barrier in owning a wallet and chance to finally earn a possible living after my bad experience with debt cards.\n\nThat was the past. This is the present. I have very little to no Bitcoin to my name. I have made a few trades which earned some but it was not enough to break even at it's high value. Nor do I have no reoccurring means of payment of Bitcoin because mining has been walled off to anyone who can afford an ASIC. Theoretically, I could buy Bitcoin with a credit card from Shapeshift but the minimum payment is $50!\n\nYet I have made more in Monero then I've ever had in Bitcoin without ever touching a faucet. I was planning on scaling back Monero mining in favor of proof of capacity with Burst and later Chia but I realized how silly that was since neither have market capitalization and some value to justify - they should. While I wait for those two, Blender, an open source 3D modeling and animation program I use, added support for Monero by means of donations. It gave me a reason to mine it beyond my own personal gain! And I don't have to worry about ever running out because the tail emissions ensures that the economy can scale.\n\nAnd while I am only speaking from my own experience, this experience is telling. So what does this have to do with Bitcoin's future? I got what I wanted out of cryptocurrency. **It just wasn't Bitcoin.** That combined with the fact it requires as much power as a town to keep the network alive should raise red flags. I have a feeling there will be a new flagship to take Bitcoin's place.\n\nBut I'm still just a peasant."
		},
		{
			"post_id": 52,
			"title": "Gates' comment on crypto, and future of Bitcoin",
			"date_published": 1519986222.435,
			"body": "![Bill_Gates.jpg (955x500)](data/img/post_52_Bill_Gates.jpg)\n\nIt seems wise to weigh in [the topic](https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&uact=8&ved=0ahUKEwjUmaGcvM3ZAhUD5mMKHeE3BDMQqUMIKzAA&url=http%3A%2F%2Fwww.bbc.com%2Fnews%2Ftechnology-43239781&usg=AOvVaw0UzpI63QojSscfqsLfZfk2) (clearnet) given the nature of my blog and the gravity of Bill Gates' words given his role in the late 20th century computing era.\n\nBill Gates is wrong. TL;DR, it's true that cryptocurrencies tend to be used for criminal use but this is simply a side effect of how they are designed. Ironically, Bitcoin's transparency is weeding out the criminals because the network broadcasts every address publicly. Yet this very transparency also makes it liable to governments cracking down on legitimate users of the cryptocurrency. This immediately goes back to the whole \"nothing to hide\" fallacy.\n\nFurther more fiat is also subject to criminal use by the people but more importantly governments. As the rich people in power can be bribed by lobbies, willingly tax whoever they want, and threaten others by means of higher taxes just so they can spend more money fancy jet trips to baseball games.\n\nIt's selfish. Crypto is designed to be automated and not play favors. Once the system is out there, it's very difficult to change it. The only way for the developers to take advantage of the system is to hard fork it and create a new coin from scratch. But this action is often discouraged even if the reasons are noble. The only exception is if it has the potential to change the game but even that carries it's risks.\n\nBut there is one major flaw with Bitcoin and all Bitcoin-derived cryptocurrencies. The mining algorithm. It is _not_ efficient. It requires an ever increasing amount of power to mine because the difficulty was not made to adapt. **This is not the fault anyone.** Bitcoin was just an experiment at the time before it became popular. It could never have foreseen the future. Monero at least has a fighting chance because it is efficient, even if it still relies on processing power.\n\nThat is why I feel the Bitcoin will not last. Only the ASIC resistant currencies will survive. Organizations like Blender, [who just recently started accepting a bunch of crypto](https://www.blender.org/donate/) (clearnet), have to see that or they would not have choosen Monero too.\n\nSo that is just my two cents."
		},
		{
			"post_id": 50,
			"title": "Back to ZERO",
			"date_published": 1519616009.085,
			"body": "I have been all over the place lately. Trying to recoup myself after a long year. Trying out new crypto and scaling back a lot of projects. I have tried the [Beaker](https://beakerbrowser.com/) browser and [SAFE](https://safenetwork.org/) network - both hold promise but ZeroNet is still well established, even though it's young compared to Freenet.\n\nI'm also pulling back from mining Monero full time to part-time as I migrate to to [proof of capacity](https://en.wikipedia.org/wiki/Proof-of-space)-based (PoC) cryptocurrencies, such as [Burst](https://www.burst-coin.org/) and later [Chia](https://chia.net/), in the future. The hardware is cheap and algorithms are more energy efficient, but Burst has less value then Monero, at the moment. So I can't switch just yet. It does have a lot of potential, though.\n\nI was going for a Core i5 rig in the past in order to continue my Monero mining operations. I decided to move towards a Atom-based mini computer with a additional 1 TB SSD for PoC mining - far more cheaper. Although Burst is here now, I'm putting my bets more on Chia since it's being developed and backed by the person who created BitTorrent.\n\nSo we'll see what happens."
		},
		{
			"post_id": 45,
			"title": "Taxing cryptocurrencies",
			"date_published": 1513620501.221,
			"body": "![5856698715_d322e57299_b.jpg (1024x338)](data/img/post_45_5856698715_d322e57299_b.jpg)\n\nThe US government feels the need to tax Bitcoin for [trading to another cryptocurrency](https://news.bitcoin.com/trading-bitcoin-for-an-altcoin-wont-shield-you-from-the-irs-anymore/) (clearnet). On one hand, it makes sense: Bitcoin is worth a thousands, and that money is worth millions now. That can go to the government, and help everyone in the long run. On other hand, it is stupid: because Bitcoin and all other cryptocurrencies tax you as is, and that money goes to the miners, regardless of what your trading.\n\nAnd there is no short of hypocrisy here. The GOP's own tax plan gives tax breaks to the [top 1%](http://thehill.com/homenews/media/365409-scarborough-the-gop-tax-plan-steals-15-trillion-from-millennials) (clearnet). Surely owning any amount of Bitcoin now puts you in the 1% bracket. So this is more of an attempt at train robbery then of anything legit.\n\nP.S.\nI have no idea how they are going to tax you, given the way the system is setup. That's another article on it's own in just me scratching my head."
		},
		{
			"post_id": 43,
			"title": "Mining, UBI and Jobs",
			"date_published": 1513393811.863,
			"body": "![monero-magnified-banner.jpg (1024x309)](data/img/post_43_monero-magnified-banner.jpg)\n\nMining is often overlooked with Monero. It is a privacy-centric currency. And it doesn't need to worry about mining as much Bitcoin and it's directives to in large part due it's ASIC-resistant algorithm. ASIC to Cryptonote-based currency, such as Monero, is basically a GPU.\n\nBut this also a reason why it shouldn't be overlooked. Yes, privacy of your wallet matters, but this is also a monetary system too. You're gonna want to get paid somehow. Mining provides a cryptocurrency-based [Universal Basic Income](https://www.youtube.com/watch?v=kl39KHS07Xc) (clearnet), and it secures the network! However, everyone's computer is different, so everyone's income will be different, and this is where new jobs based on those with higher income from more powerful computers can supply wages for people with a lower UBI, or don't have any at all but still want to earn some.\n\n![cryptocurrency-banner.jpg (950x279)](data/img/post_43_cryptocurrency-banner.jpg)\n\nTo be fair, this isn't limited to Cryptonote-based currencies, but the entry level is low enough with these currencies that it's good for startups and small businesses. While Bitcoin and it's directives is basically home of the conglomerates and governments now due to ASICs and high fees. This is an idea I've considered for TPaw but, at the moment, I don't have an extra computer laying around to provide the cash.\n\nI'll admit this is all hypothetical and possibly wondering into trickle-down economics territory. But, unlike Reagan, I admit I'm no economic expert. So, please, tell me if I'm wrong."
		},
		{
			"post_id": 40,
			"title": "CryptoToɱis",
			"date_published": 1513194911.745,
			"body": "So far my blog has mostly been focused on my projects and other ramblings. Since I didn't really know what to actually focus on. In fairness, this is my blog and I can say whatever I want - especially under ZeroNet. But they're are certain topics I feel eager to share more than others. Which helps provide variety in between when I'm not talking about my projects. And this brings me to cryptocurrcnies. Something I've been interested in for a very long time and what I'll start to focus this blog on more. I'll begin with how I got here, where I stand now, and my future.\n\n![bitcoin-2007912_1024.jpg (1024x300)](data/img/post_40_bitcoin-2007912_1024.jpg)\n\nWe moved to the south in 2005 in order to be with my aunt and cousin while also possibly finding a better school for me. But reality did not match our dreams. They moved, school was shit, each job my Mom took left us with less and less cash to work with, while the loss of losing friends and a life that looked so good back up north almost pushed my mental stability to the brink.\n\nI have invested a great deal into cryptocurrences since the early days of Bitcoin, roughly around 2010 or 2011\\. I have never stopped believing in them because of the low entry barrier into owning a wallet even when my own friends still doubted their potential. But I didn't blame their doubts. Bitcoin had suffered several crashes while I had nothing but my gut to go on all because life decided to treat us unfairly. Yet here we are today with Bitcoin holding steady at around quintuple digits. Weather they'll be a crash that'll put it under that remains to be seen but the most recent crashes still have it holding in the quintuple digits.\n\nBut, as much as I love Bitcoin and everything it has done, it has one serious flaw. It's algorithm. Being the first to the scene means you are the natural flagship of it's type - all others follows. However, this also has a huge caveat. This means you are the most inefficient as rivals learn to be better and get better with every new incarnation. You only need to look at Android to see this.\n\n![monero-coin6-1024x281.jpg (1024x281)](data/img/post_40_monero-coin6-1024x281.jpg)\n\nSome who doubted Bitcoin also criticized it's high entry level into mining. The algorithm wasn't able to adapt so it grew more difficult, leading to higher fees, and eventually you get the creation of ASIC miners. Power consumption has also skyrocketed as a consequence. The latter has caused public concern within the community. I have known about these issues for a long time and decided to use Bitcoin only as a means for exchange but not gain money by what was meant to be it's easiest of ways. However, this left me between rock and a hard place. Because it's easier to get money by mining - if you have an ASIC - then it is any other form. It was easier to get Bitcoin in the early days through faucets because difficultly and fees wern't that high. Now you're lucky to get paid a $1 within a year without sacrificing huge portions of your time staring at ads every hour - literately. And this bring me to Monero.\n\nMonero is based on the crpytonote algorithm. Crytponote addressed Bitcoin's criticisms by not being based on Bitcoin. It put in extra layer of privacy above all else, but is also ASIC-resistant. I have tested it myself by mining on a Core i3 and got more back in return, despite not reaching the threshold _yet_, then I would with Bitcoin or any of it's derivatives.\n\nAnd this is where my blog will get a little biased. I had initially intended to use Monero only as a way to earn Bitcoin. But I began to realize that I should and could promote this. It started out with XMR Tomes on Twitter but I quickly changed it to to CryptoToɱis because I'm not _that_ biased but I do feel Monero has potential. It has already been in the triple digits again, holding steady at $287 as of this writing, since the latter half of this year, after being in the $40s since 2016 or early 2015, on top of additional merchants starting to pick it up or rumor to.\n\nI don't know where the future lies but I do have hope."
		},
		{
			"post_id": 39,
			"title": "\"he/she dreams\"",
			"date_published": 1512851642.441,
			"body": "![universe-logo.png (500x94)](data/img/post_39_universe-logo.png)\n\nMy learning of Swedish has evolved into a study of linguists in order to better create my own language. I have never created my own spoken language before but it is something I've wanted to do, will continue to do. but it won't be lenj won't be that project that fulfills that goal.\n\nI went into Lenj blind. I had only the slightest clue of what I was doing. I didn't have a proper understanding of the IPA. Then I realized I also needed a dictionary. Things had gotten out of hand by the time I did understand _mostly_ everything.\n\nhantoro [hantoɾo] for \"he/she who dreams,\" or kitotoro [kitotoɾo] for \"a fox who dreams,\" in subtle homage of my first serious attempts at a fictional character, Zack, who would later spawn something much bigger that I also walked in quite blindly into, will be the next phase in creating my own spoken language. Esperanto will serve in the place of lenj in the meantime.\n\nThere is one thing I will note about hantoro that was actually hinted upon in the translation. The language is gender natural. _Han_ in _han_toro can mean he, she, or they. The reason for this is because my fursona/persona is bit of a both - he is male everywhere but between his legs - but also addressing the criticisms of Esperanto. Still working on the pregnancy part. So he neither one or the other. Han solves this by not siding with either."
		},
		{
			"post_id": 38,
			"title": "An operating system named Pup",
			"date_published": 1512544467.247,
			"body": "![screenshot.png (720x400)](data/img/post_38_screenshot.png)\n\nPupOS finally has some sorta logo to it, in this case a word mark. In earlier versions it was just an ASCII version of the TPaw logo when you typed in _about_. Which, as much as I like it, felt rather lazy. Now it has some sorta identity thanks to the IBM font I first used with TPaw DOC. The ASCII conversation of it came out quite nice - it kinda reminds me of dot matrix printers."
		},
		{
			"post_id": 36,
			"title": "TPaw Core 4.0",
			"date_published": 1512449723.338,
			"body": "![tpaw-2018.png (1723x357)](data/img/post_36_tpaw-2018.png)\n\nCore is the name of my website layout and design that I've used roughly since it's inception. The purpose of Core is be reusable. Every element is simple in it's design and may be easily changed from a single CSS.\n\nIt started out as being a theme for a CMS, known as GetSimple. It's literal simplicity in theme development meant I could also detach it from GetSimple and, in the past, has been something I've been trying to do. My biggest problem was keeping the header and footer consistent outside of a CMS. In the past, the only way around to do this was to use a complex service-side application frameworks, such as ASP.NET, but that was too much when I'm not asking for much, older solutions such as Frontpage, which did the work for you, or PHP.\n\n![ea-tpaw-footer.png (1324x461)](data/img/post_36_ea-tpaw-footer.png)\n\nI knew I'd be making more sites for other purposes but I wanted to keep them all within a single network. I already knew how I wanted to do this by taking a page out of the early to mid-2000s EA - or Maxis anyway. Who put their game's logos on the footer. Those logos would then link to that game's website. It's ingenious, really, because it doesn't sacrifice on the design of all websites, allowing for all them to be unique, but still feel like they're apart of one big group.\n\nI had tried this in the past, but as the websites grew, so did the repetitiveness constantly copying, pasting, or modifying the header and footer. It was just one HTML file after another. The workflow never changed even though the design of the website did.\n\nThen I searched into single page design when I looked into how to make DIVs disappear and reappear. And lord and behold, [I found my answer](https://stackoverflow.com/questions/18341968/display-one-div-at-a-time) (clearnet). My only adjustment to this code was outright showed the element instead of toggling it. Additionally, this requires all other \"pages\" to have `display:none` set in it's style attribute with the exception for what is considered the home page. The last major change that needs to make saving the last displayed state. Because right now it resets on every refresh.\n\nObviously, something like this isn't new. I'm sure all web applications function like this all the time. However, it is new to me, because I had never thought of it until I put single page designs + disappearing/reappearing DIVs together in a single thought. Yet it's a simple solution that it's amazing I didn't realize it before."
		},
		{
			"post_id": 35,
			"title": "lanj",
			"date_published": 1512364580.911,
			"body": "![tomiscw-atlantean.png (1024x130)](data/img/post_35_tomiscw-atlantean.png)\n\nI've always wanted to create my own spoken language for a long time. Atlantis: The Lost Empire gave some early inspiration to do just that. Sims followed by Esperanto provided some later motivation. **lanj**, as it's currently known, for \"Language\" is it's language is that. It borrows concepts from North Germanic languages, Toki Pona, Atlantean and Simlish.\n\nLanj began development with the book with all the information on how to properly understand and use it. It's completely open source in the public domain - under the Unlicense and CC0, respectfully.\n\nAside from being created just because I wanted to, it also serves a secondary purpose as being an integral part of my fictional universe, the TPaw Universe. As it is the characters primary language that'll be seen throughout their world.\n\nThe pronunciation and letters are _almost_ finalized. Meanwhile, they'll be two sets of alphabets: Latin and it's own. The latter will be used throughout the TPaw Universe. The lanj dictionary is built-in into both PupOS and PupOS Terminal Emulator."
		},
		{
			"post_id": 34,
			"title": "Another war?",
			"date_published": 1512363245.338,
			"body": "![north-korea-obama-trump.jpg (1024x504)](data/img/post_34_north-korea-obama-trump.jpg)\n\nObama warned Trump of North Korea during the transition to the Trump administration. The possibility of war has been looming over my head ever since that fact broke. Trump already ignored Obama's warning about Fylnn. Meanwhile, all the Republican congress just cares about is getting their tax breaks through because they know Trump will sign anything.\n\nI've been told the risk of war with North Korea is \"not likely to happen\" or \"they'll never let that happen.\" And while part of me wants to believe this is the case, I can't help but notice recent events. Just this past weekend alone military exercises in South Korea have escalated. North Korea has warned that Trump \"begging for war.\" Meanwhile, Trump himself has been silent for 14 hours on Saturday. Maybe it's because of it's health. But something feels off.\n\nI don't know what will happen, but I can't deny the \"what if?\""
		},
		{
			"post_id": 32,
			"title": "PupOS Orion",
			"date_published": 1512123853.575,
			"body": "![vmplayer_2017-12-01_05-48-56.png (720x400)](data/img/post_32_vmplayer_2017-12-01_05-48-56.png)\n\nI have used the [COSMOS](https://github.com/CosmosOS/Cosmos) framework in the past to try and create an operating system in C#. But this was during the long transition period between Visual Studio 2013 to what what is now 2017 while the source code was moving from CodePlex to Github. So any serious attempt at a hobby operating system remained in limbo but I did try out what I could during that time.\n\nPupOS Orion is my first and somewhat successful functional operating system written in C# using the COSMOS framework. .NET and COSMOS are powerful when combined but the latter is still limited because the APIs need to be refined, not there yet, or the tutorials are outdated. But what is there is enough.\n\nAs I hinted upon in my first post, I had considered calling PupOS \"Orion\" because COSMOS reminded me of Cosmos: A Spacetime Odyssey. I decided to keep that name only as an initial code name for this alpha software. Future code names are already set and are just System One, Two, Three, ect... I don't feel the need to get any fancier since this is a public domain project, but these names do remind me of MacOS Classic - so it's all good. PupOS will remain on the Orion code base for quite a while. Work on System One will begin once the I/O APIs are [secured](https://github.com/CosmosOS/Cosmos/wiki/FAT-FileSystem).\n\nI feel like Apple and Microsoft when they were in their garage. It's so exciting!"
		},
		{
			"post_id": 31,
			"title": "PupOS, an experiment in C# OS development",
			"date_published": 1512083549.301,
			"body": "Along with writing a game, making my own constructed language, and a bunch of other things, writing an operating system is something I've always wanted to do. Even if it's just a hobby. In fact, I think those are the best kinds of operating systems.\n\nHowever, my refusal to touch C/C++, unless required, puts me in an interesting in an position if I wanted to write an operating system. You would think C/C++ would one of those cases were it is required but not with [COSMOS](https://github.com/CosmosOS/Cosmos) (clearnet), C# Open Source Managed Operating System. COSMOS isn't an operating system in it's own right, it is a building block for rapidly deploying your own operating system for any purpose weather it be in C#, VB.NET, F# and even Managed C++, although I refuse to touch C++ in managed form, and is itself written in C#. C# is my most ideal programming language with Kotlin in second.\n\nAnd this bring me to PupOS. A hobby operating system written in C# using the COSMOS framework. I choose the name Pup because it's intended to be a small - although, I had considered calling it \"Orion\" because COSMOS reminded me of Cosmos: A Spacetime Odyssey. Now I had intended to put PupOS on Github but I decided to move it to [Git Center](/17vnQapvrq5LNSFVXMmyXZoMtip38864AP) instead, due to the lack of any central point of failure."
		},
		{
			"post_id": 29,
			"title": "The Golden Age of Radio",
			"date_published": 1511950044.586,
			"body": "I was introduced to the Golden Age of Radio at a young age. Those two things are kind wried to say because the real golden age ended decades, if not a century ago, and yet, growing up as a child, listening to old time radio.\n\nIt was Gunsmoke. A western drama that aired on CBS Radio. We would tune in on our way to visit my grandparents on father's second wife's side who live in the DC area - long story. Where we would tune between 7 to 11 PM to NPR's WAMU [The Big Broadcast](https://wamu.org/show/the-big-broadcast/) block which continues to air the show. It has given me a fascination in radio, and why I still have an interest in hosting my own interest radio station.\n\nGunsmoke and plenty of other Golden Age radio dramas can be found on Archive.org. You can download them there now, and hopefully they'll remain there after this current administration. But, Archive.org also provides torrents for 99% of their content, including these radio programs. So, as I like the play the long game, I think it makes sense to put it on Torrent Share as well.\n\nYou can search for Golden Age Radio by typing in **OTR** or **OTRR**. The former stands for Old Time Radio while the latter means the Old Time Radio Research Group. The difference between the two is how the files are distributed within the torrent itself.\n\n*   OTR torrents were uploaded by number of individuals from Archive.org. Their may distributed in bulks of MP3, or OGG files. These files may be compressed in a ZIP. Do not expect all OTR torrents to be equal. The only thing these torrents have in common on Torrent Share is the \"OTR\" title to make searching more easier.\n\n*   OTRR torrents are commonly distribute MP3s in bulks of ZIP files.\n    Occasionally their MP3s will not zipped.\n\nThere is just one incy tincy little catch. Golden Age CBS Radio programs are royalty free, under the Creative Commons, _but_ they may not be used commercially."
		},
		{
			"post_id": 28,
			"title": "Legal, decentralized torrent sharing",
			"date_published": 1511932071.239,
			"body": "<div class=\"body\">There really is a need for a decentralized, DMCA proof, torrent search engine ever since TPB's original shutdown. Torrent Share is a blessing, if there is a god. It answers that need and means I save myself from going to yet another risky torrent search engine.\n\nAnd that's the problem. Torrents themselves may decentralized but their search engines are not. The invaluableness of Torrent Share on ZeroNet can't be underestimated. So I'll be uploading Linux/Unix distros, game patches, public domain and royalty free media to that site. To further perverse what could easily be lost.\n\n</div>"
		},
		{
			"post_id": 5,
			"title": "Point & Call (or Think)",
			"date_published": 1499391282.093,
			"body": "[Point and call](http://www.atlasobscura.com/articles/pointing-and-calling-japan-trains) (clearnet) is a method in occupational safety for avoiding mistakes by pointing at important indicators and calling out the status. Making large gestures and speaking out the status helps keeping focus and attention. The method was first used by train drivers and is now commonly used in Japanese industry. It's a method I've mistakenly called \"point & speak\"; however, this is the name of something totally unrelated but also found in Japan.\n\nSince my teen years I've spent a lot of my time teaching myself. This is not without hurdles and I've spent more time reading and less time doing. This is more or less due to the lack resources given to us by our state. Point and calling is something I'd slowly started to take notice with each successive JR video or Japanese railway-related series I've watched over the years.\n\nThis method is ingenious and it's something I've applied to learning Japanese itself in the form of point & thinking. I will use in my self teachings of Swedish too. It's reasons like this why I can't stress enough why we need to break free from our cultures and expand into others. There is a reason \"level Asian\" is called \"level Asian\" and this does have something to do with it in terms of Japanese culture."
		}
	]
}