{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "KopyKate v1.3.2 BETA - uncensored YouTube/Netflix alternative!",
			"body": "http://127.0.0.1:43110/1aCq7GiJfUfGZ4GftjYaYbsEngPFzcxvN/\n\nAn uncensored YouTube alternative, allows you to watch and upload copyrighted content. Works by storing WebTorrent magnetlinks on a decentralized database on a ZeroNet site, and then playing the torrents using a javascript and WebRTC-based torrent client so you don't have to download any extra software!\n&nbsp;\nThat means the site is impossible to shutdown as the magnet link database is hosted by thousands of users all across the world.\n&nbsp;\nYou can seed torrents using WebTorrent.Desktop (tutorials available) or you can create webseeds, too. Webseeds are recommended for videos that may not get a lot of views, especially during the early stage of the site.\n&nbsp;\nChanges:\n- Improved site layout\n- The site now warns you if your browser is incompatible, generates a link for alternate video player.\n- More movies and TV shows coming... stay tuned!",
			"added": 1502604303
		}
	],
	"topic_vote": {
		"1_14QD2BAZenH8vwW6JrFsFj337KL2KERH3v": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1_16UYTd5pL9rt4hhxQAmfX89QqmjJB58xDx": [
			{
				"comment_id": 1,
				"body": "> [micks](#comment_1_1Q6QRh4jgYdYcC91NCgUk74nT9BGuYjajZ): oh how incredibly random, slightly odd but mainly awesome (!) to have stumbled across this.  I truly marvel at what the odds/the mathematical probability of me finding this, given that not only have I found zeronet itself within the past 48 hours - but then to have clicked on a link for 0list out of the massive crapshoot of randomness linked to on the zeroname page (whomever admins that needs to work on at least implementing an alphabetically-based group sort function) - but, all of this is made ever more strange given that for the past few weeks i've myself been hard at work developing a platform so similar it sounds like this exact (!!!) same thing.\n> I'm about 2/3rds of the way complete - I've got the overwhelming majority of the UI/design elements finished and need to just make some further decisions based on the backend and security aspects of it.  Like you I'm heavily reliant on a lot of the same stuff - mainly that it's also utilizing webRTC - incorporating elements of bitchute/the webtorrent framework and i'm implementing the use of something to act as an automated altnerative - essentially what you mention with the webseed option, on a dedicated cloud cluster specifically used to spread around the hashes/seed info...and mostly because I wish to implement a livestreaming functionality because I see this as crucial to drawing any real traffic and gaining the userbase necessary to draw in other developers.\n> Anyway, I don't intend to bore you with a book but I would obviously love to chat with you and collaborate if you are interested, I think a lot of good can come from this especially with the orwellian tactics being increasingly employed by youtube/google/facebook etc to de-platform anything remotely controversial giving a spotlight to this issue.  I've noticed many more people mentioning the need to develop alternative platforms dedicated to anonymity/decentralization/free speech lately, would love to potentially play a part in helping move things along as it looks like you've got a very good start going.  I'm still getting a handle on this whole zeronet thing, but I can be reached at n e t l u x e@protonmail(.)com  \n> Cheers :)\n\nHi there. :)\n\nWill get in touch with you shortly. As you can see.. a lot of projects here end up half-baked and abandoned.. but KopyKate will fight to the bitter end. \n\nWe need programmers, especially those fluent in javascript.. but more than anything, we also need seeders for our videos.. and tons more 'uploads'.. which in itself is time consuming, and requires decent encoding skills at times. Every time you watch a video, it's automatically being seeded at the same time - so really, even getting as many viewers as possible will do the trick.\n\nAs you can see in my github repositories, no amount of work will go uncredited.. and if you have something better, well then, we're in business!",
				"added": 1502655484
			},
			{
				"comment_id": 2,
				"body": "Been gaining confidence in my javascript.. so I'm gonna be working on an improved uploader .. one which instantly webseeds your video and generates a torrent file on a webserver which you can then share with other people. WebTorrent will then only use the HTTP link if no other peers are available. Once my webserver has reached about 5gb-10gb worth of videos, I will then start applying a 7 day limit for all uploads.. which means they get automatically deleted from the server after 7 days using automated scripts.. and hopefully the user would have taken responsibility for seeding their own videos if they really care about them, by then.\n\nWe will have to rely on this hybrid HTTP / torrent system until we get enough viewers on the site, because torrents rely on popularity to survive, obviously. HTTP is not a good way to serve pirated content, but if we're only just small and starting out, it's not a problem.. and by the time we get big, we won't need to rely on webseeds as much either way.. \n\nA lot of people here have expressed concern over using the external links outside of ZeroNet, but if that's your worry.. then you may as well not even use torrent clients to begin with - because it's exactly the same thing. The external links provided by KopyKate are necessary only because video streaming doesn't work very well inside of iframes.\n\nAlso - WebRTC won't leak your IP address, at least not if you're behind a VPN. The safety level is exactly the same as using the standard BitTorrent client, anyway. So have fun and stream away!",
				"added": 1502867270
			},
			{
				"comment_id": 3,
				"body": "You can now upload automatic webseeds under 50mb using http://www.kittyseedbox.tk:3000\nThe link you retrieve can be copied and pasted into the Magnet Link input form when uploading torrents.\nenjoy!",
				"added": 1502964299
			}
		]
	},
	"comment_vote": {
		"1_1Q6QRh4jgYdYcC91NCgUk74nT9BGuYjajZ": 1,
		"1_14QD2BAZenH8vwW6JrFsFj337KL2KERH3v": 1
	}
}