{"next_paste_id":10,"next_comment_id":0,"paste":[{"paste_id":1,"description":"Hailstone sequence","body":"fn hailstone(start : u32) -> Vec<u32> {\n    let mut res = Vec::new();\n    let mut next = start;\n \n    res.push(start);\n \n    while next != 1  {\n        next = if next % 2 == 0 { next/2 } else { 3*next+1 };\n        res.push(next);\n    }\n    res\n}\n \n \nfn main() {\n    let test_num = 27;\n    let test_hailseq = hailstone(test_num);\n \n    println!(\"For {} number of elements is {} \", test_num, test_hailseq.len());\n \n    let fst_slice = test_hailseq[0..4].iter()\n                        .fold(\"\".to_owned(), |acc, i| { acc + &*(i.to_string()).to_owned() + \", \" });\n    let last_slice = test_hailseq[test_hailseq.len()-4..].iter()\n                        .fold(\"\".to_owned(), |acc, i| { acc + &*(i.to_string()).to_owned() + \", \" });\n \n    println!(\"  hailstone starting with {} ending with {} \", fst_slice, last_slice);\n \n    let max_range = 100000;\n    let mut max_len = 0;\n    let mut max_seed = 0;\n    for i_seed in 1..max_range {\n        let i_len = hailstone(i_seed).len();\n \n        if i_len > max_len {\n            max_len = i_len;\n            max_seed = i_seed;\n        }\n    }\n    println!(\"Longest sequence is {} element long for seed {}\", max_len, max_seed);\n}","language":"text/x-rustsrc","encrypted":false,"added":1630535407},{"paste_id":2,"description":"","body":"x≈1660.96404744368117393515971474469508793241569651229030602737819790796738830431260792506987167968507754982868585512512591341204849213176344413765138649932769692597567632875278432150880459501244583347071668700595156209368755485793323377008959482790336791538984421636294163749626122445119177998820869706896400488637834317773895074337252892294239013552112728048611732897847770768509578820585889623582567501196056357366968072036169860578742550354749394582944041566109740339664911616296559753356997539185016836712403533176375042034588131931267734400768431080920943042949741769066074994651352208960393296130091148268578768361983034755824341842331192925424303149527134973463955813660306700322335242381703521867616837110641544835182289546083860954510710981071228722329262267974224407741729625714770468676953274724316389649212145795590565581649062884725099078751896092769243910177580098689138644440879937166433036356196912601106666402627562441371722442122658273253062074459114339662633214640582996142581367254093003572341977940231656063963200181560072886844395202413552643260167974076623903537416356295168141488499551440840520209875186779311902462749836043108387740505441728994902107242922099869106032656305762648143541420178963951747902045061043230813916962485826881999660498166622692994392856625675727987605018471979223863691587179734865765468925813292324783293844820607355033175723790395034488592714842575209178947261197185672031461107455953517508421011736373354005772937842005379102183637928765633435631832451193392083856381001164159383584291121988466378706367586065964614562628417226342485451321586122272648445686567136657161542938608213692501138336555500366596679620272154255127064706993084916346007397837224699766029081076614066372822663762115793577484975065981821500471031159350214520613695841850472428863749647262377453019385277474871808589966339623739351589267194888842413622283511911160673199439618523527770659582095621699657481576584473113530024973761458473068182036064646235287408751609050534351900196824316369438288760270715424222419157744830228721364304655656875495087212130404631127295661686350639427272463292716979969835871924904616715817972451803454597861615879326459754757290780125399570811131640027602875463059127335105763826267092822101509323426633010342135999740249120622724915474758094532612661681037168226642990354399885750985672808136920874212457215595949443101829329515950614601360302030334205346103613652061987714861401490195283427498329854693398747717429516578508638951572449482646164936820554269186829380473280472614060654380906021817258461671288345192022599677568914275347838580836130364409483508203053256096054460769916624213741050869243316176608038950151082493561","language":"text/plain","encrypted":false,"added":1631122058},{"paste_id":4,"description":"Com Ou Sem Mim - Gustavo Mioto","body":"Se você não me disser a verdade\nNão tem como eu ajudar, minha metade\nSe tem outro em meu lugar\nSe você quer colocar\nTe deixo livre pra viver\n\nNão prometo te esperar\nCoração vai cicatrizar\nE uma hora eu sei que vou te esquecer\nSe era medo de me machucar\nJá tem o meu perdão\nTá esperando o que?\n\nSó quero que você seja feliz\nCom ou sem mim\nE quando der saudade e for dormir\nCom ou sem mim\nE quando perceber que eu não tô\nE que não vai achar um novo amor\nVai ter que aceitar que é assim\nCom ou sem mim\n\nSe tem outro em meu lugar\nOu se você quer colocar\nTe deixo livre, livre pra viver\nNão prometo te esperar\nCoração vai cicatrizar\nE uma hora eu sei que vou te esquecer\nSe era medo de me machucar\nTá esperando o que?\n\nSó quero que você seja feliz\nCom ou sem mim\nE quando der saudade e for dormir\nCom ou sem mim\nE quando perceber que eu não tô\nE que não vai achar um outro amor\nVai ter que aceitar que é assim\nCom ou sem mim\n\nCom ou sem mim\nCom ou sem mim","language":"text/plain","encrypted":false,"added":1631377548},{"paste_id":5,"description":"Loituma - Ievan Polkka","body":"Nuapurista kuulu se polokan tahti\nJalakani pohjii kutkutti\nIevan äiti se tyttöösä vahti\nVaan kyllähän ieva sen jutkutti\nSillä ei meitä silloin kiellot haittaa\nKun myö tanssimme laiasta laitaan\nSalivili hipput tupput täppyt\nÄppyt tipput hilijalleen\n\nIevan suu oli vehnäsellä\nKo immeiset onnee toevotti\nPeä oli märkänä jokaisella\nJa viulu se vinku ja voevotti\nEi tätä poikoo märkyys haittaa\nSillon ko laskoo laiasta laitaan\nSalilivi hipput tupput täppyt\nÄppyt tipput hilijalleen\n\nIevan äiti se kammarissa\nVirsiä veisata huijjuutti\nKun tämä poika naapurissa\nÄmmän tyttöä nuijjuutti\nEikä tätä poikoo ämmät haittaa\nSillon ko laskoo laiasta laitaan\nSalivili hipput tupput täppyt\nÄppyt tipput hilijalleen\n\nHilipati hilipati hilipati hillaa\nHilipati hilipati hilipampaa\nJalituli jallaa talituli jallaa\nTilitali tilitali tilitantaa\nHalituli jallaa tilituli tallaa\nTilitili tilitili tilitili tallaa\nHalituli tilitali jallati jallan\nTilitali talitali helevantaa\nRimpatirallaa ripirapirallaa\nRumpatiruppa ripiranpuu\nJakkarittaa dippari lapalan\nTulituli lallan tipirantuu\n\nJatsu tsappari dikkali dallan\nTittali tillan titstan dullaa\nDipidapi dallaa ruppati rupiran\nKurikan kukka ja kirikan kuu\nRätsätsää ja ribidabi dilla\nBeritstan dillan dillan doo\nA baribbattaa baribariiba\nDibi dibidibi disten dillan doo\nJa barilla stillan deijadoo\nA daba daba daba daba daba dybjabuu\nBaristal dillan stillan duubadäg\nDägädägä duu duu deijadoo\n\nSiellä oli lystiä soiton jäläkeen\nSain minä kerran sytkyyttee\nKottiin ko mäntii ni ämmä se riitelj\nJa ieva jo alako nyyhkyytteek\nMinä sanon ievalle mitäpä se haittaa\nLaskemma vielähi laiasta laitaa\nSalivili hipput tupput täppyt\nÄppyt tipput hilijalleen\n\nMuorille sanon jotta tukkee suusi\nEn ruppee sun terveyttäs takkoomaa\nTerveenä peäset ku korjoot luusi\nJa määt siitä murjuus makkoomaa\nEi tätä poikoo hellyys haittaa\nKo akkoja huhkii laiasta laitaan\nSalivili hipput tupput täppyt\nÄppyt tipput hilijalleen\n\nSen minä sanon jotta purra pittää\nEi mua niin voan nielasta\nSuat männä ite vaikka lännestä ittään\nVaan minä en luovu ievasta\nSillä ei tätä poikoo kainous haittaa\nSillon ko tanssii laiasta laitaan\nSalivili hipput tupput täppyt\nÄppyt tipput hilijalleen","language":"text/plain","encrypted":false,"added":1632103945},{"paste_id":6,"description":"Libertação - Sérgio Lopes","body":"Quando tudo parecia ter chegado ao fim\nE eu não tinha a menor esperança de ser feliz\nTempestades de dor e tristeza que eu enfrentei\nDestruíram os sonhos e planos que eu construí\n\nQuantas noites me ajoelhava sem poder falar\nEu não tinha coragem nem forças pra falar com Deus\nMas um dia ouvi sua voz me falando: Não temas\nNão há dor que na cruz eu não tenha vencido por ti\n\nO sangue de Cristo liberta de todo o pecado\nA cruz do calvário é o começo da nossa vitória\nA palavra de Deus é a nossa arma de guerra\nE o poder de Deus nos garante a vitória final","language":"text/plain","encrypted":false,"added":1634240530},{"paste_id":7,"description":"João 5","body":"Algum tempo depois, Jesus subiu a Jerusalém para uma festa dos judeus.\nHá em Jerusalém, perto da porta das Ovelhas, um tanque que, em aramaico, é chamado Betesda, tendo cinco entradas em volta.\nAli costumava ficar grande número de pessoas doentes e inválidas: cegos, mancos e paralíticos. Eles esperavam um movimento nas águas.\nDe vez em quando descia um anjo do Senhor e agitava as águas. O primeiro que entrasse no tanque, depois de agitada as águas, era curado de qualquer doença que tivesse.\nUm dos que estavam ali era paralítico fazia trinta e oito anos.\nQuando o viu deitado e soube que ele vivia naquele estado durante tanto tempo, Jesus lhe perguntou: \"Você quer ser curado? \"\nDisse o paralítico: \"Senhor, não tenho ninguém que me ajude a entrar no tanque quando a água é agitada. Enquanto estou tentando entrar, outro chega antes de mim\".\nEntão Jesus lhe disse: \"Levante-se! Pegue a sua maca e ande\".\nImediatamente o homem ficou curado, pegou a maca e começou a andar. Isso aconteceu num sábado,\ne, por essa razão, os judeus disseram ao homem que havia sido curado: \"Hoje é sábado, não lhe é permitido carregar a maca\".\nMas ele respondeu: \"O homem que me curou me disse: ‘Pegue a sua maca e ande’ \".\nEntão lhe perguntaram: \"Quem é esse homem que lhe mandar pegar a maca e andar? \"\nO homem que fora curado não tinha idéia de quem era ele, pois Jesus havia desaparecido no meio da multidão.\nMais tarde Jesus o encontrou no templo e lhe disse: \"Olhe, você está curado. Não volte a pecar, para que algo pior não lhe aconteça\".\nO homem foi contar aos judeus que fora Jesus quem o tinha curado.\nEntão os judeus passaram a perseguir Jesus, porque ele estava fazendo essas coisas no sábado.\nDisse-lhes Jesus: \"Meu Pai continua trabalhando até hoje, e eu também estou trabalhando\".\nPor essa razão, os judeus mais ainda queriam matá-lo, pois não somente estava violando o sábado, mas também estava até mesmo dizendo que Deus era seu próprio Pai, igualando-se a Deus.\nJesus lhes deu esta resposta: \"Eu lhes digo verdadeiramente que o Filho não pode fazer nada de si mesmo; só pode fazer o que vê o Pai fazer, porque o que o Pai faz o Filho também faz.\nPois o Pai ama ao Filho e lhe mostra tudo o que faz. Sim, para admiração de vocês, ele lhe mostrará obras ainda maiores do que estas.\nPois, da mesma forma que o Pai ressuscita os mortos e lhes dá vida, o Filho também dá vida a quem ele quer dá-la.\nAlém disso, o Pai a ninguém julga, mas confiou todo julgamento ao Filho,\npara que todos honrem o Filho como honram o Pai. Aquele que não honra o Filho, também não honra o Pai que o enviou.\n\"Eu lhes asseguro: Quem ouve a minha palavra e crê naquele que me enviou, tem a vida eterna e não será condenado, mas já passou da morte para a vida.\nEu lhes afirmo que está chegando a hora, e já chegou, em que os mortos ouvirão a voz do Filho de Deus, e aqueles que a ouvirem, viverão.\nPois, da mesma forma como o Pai tem vida em si mesmo, ele concedeu ao Filho ter vida em si mesmo.\nE deu-lhe autoridade para julgar, porque é o Filho do homem.\n\"Não fiquem admirados com isto, pois está chegando a hora em que todos os que estiverem nos túmulos ouvirão a sua voz\ne sairão; os que fizeram o bem ressuscitarão para a vida, e os que fizeram o mal ressuscitarão para serem condenados.\nPor mim mesmo, nada posso fazer; eu julgo apenas conforme ouço, e o meu julgamento é justo, pois não procuro agradar a mim mesmo, mas àquele que me enviou\".\n\"Se testifico acerca de mim mesmo, o meu testemunho não é válido.\nHá outro que testemunha em meu favor, e sei que o seu testemunho a meu respeito é válido.\n\"Vocês enviaram representantes a João, e ele testemunhou da verdade.\nNão que eu busque testemunho humano, mas menciono isso para que vocês sejam salvos.\nJoão era uma candeia que queimava e irradiava luz, e durante certo tempo vocês quiseram alegrar-se com a sua luz.\n\"Eu tenho um testemunho maior que o de João; a própria obra que o Pai me deu para concluir, e que estou realizando, testemunha que o Pai me enviou.\nE o Pai que me enviou, ele mesmo testemunhou a meu respeito. Vocês nunca ouviram a sua voz, nem viram a sua forma,\nnem a sua palavra habita em vocês, pois não crêem naquele que ele enviou.\nVocês estudam cuidadosamente as Escrituras, porque pensam que nelas vocês têm a vida eterna. E são as Escrituras que testemunham a meu respeito;\ncontudo, vocês não querem vir a mim para terem vida.\n\"Eu não aceito glória dos homens,\nmas conheço vocês. Sei que vocês não têm o amor de Deus.\nEu vim em nome de meu Pai, e vocês não me aceitaram; mas, se outro vier em seu próprio nome, vocês o aceitarão.\nComo vocês podem crer, se aceitam glória uns dos outros, mas não procuram a glória que vem do Deus único?\n\"Contudo, não pensem que eu os acusarei perante o Pai. Quem os acusa é Moisés, em quem estão as suas esperanças.\nSe vocês cressem em Moisés, creriam em mim, pois ele escreveu a meu respeito.\nVisto, porém, que não crêem no que ele escreveu, como crerão no que eu digo? \"\n\nJoão 5:1-47","language":"text/plain","encrypted":false,"added":1635884611},{"paste_id":9,"description":"2 Coríntios 10","body":"Eu, Paulo, pela mansidão e pela bondade de Cristo, apelo para vocês; eu, que sou \"humilde\" quando estou face a face com vocês, mas \"audaz\" quando ausente!\nRogo-lhes que, quando estiver presente, não me obriguem a agir com audácia, tal como penso que ousarei fazer, para com alguns que acham que procedemos segundo os padrões humanos.\nPois, embora vivamos como homens, não lutamos segundo os padrões humanos.\nAs armas com as quais lutamos não são humanas; pelo contrário, são poderosas em Deus para destruir fortalezas.\nDestruímos argumentos e toda pretensão que se levanta contra o conhecimento de Deus, e levamos cativo todo pensamento, para torná-lo obediente a Cristo.\nE estaremos prontos para punir todo ato de desobediência, uma vez completa a obediência de vocês.\nVocês observam apenas a aparência das coisas. Se alguém está convencido de que pertence a Cristo, deveria considerar novamente consigo mesmo que, assim como ele, nós também pertencemos a Cristo.\nPois mesmo que eu tenha me orgulhado um pouco mais da autoridade que o Senhor nos deu, não me envergonho disso, pois essa autoridade é para edificá-los, e não para destruí-los.\nNão quero que pareça que estou tentando amedrontá-los com as minhas cartas.\nPois alguns dizem: \"As cartas dele são duras e fortes, mas ele pessoalmente não impressiona, e a sua palavra é desprezível\".\nSaibam tais pessoas que aquilo que somos em cartas, quando estamos ausentes, seremos em atos, quando estivermos presentes.\nNão temos a pretensão de nos igualar ou de nos comparar com alguns que se recomendam a si mesmos. Quando eles se medem e se comparam consigo mesmos, agem sem entendimento.\nNós, porém, não nos gloriaremos além do limite adequado, mas limitaremos nosso orgulho à esfera de ação que Deus nos confiou, a qual alcança vocês inclusive.\nNão estamos indo longe demais em nosso orgulho, como seria o caso se não tivéssemos chegado até vocês, pois chegamos a vocês com o evangelho de Cristo.\nDa mesma forma, não vamos além de nossos limites, gloriando-nos de trabalhos que outros fizeram. Nossa esperança é que, à medida que for crescendo a fé que vocês têm, nossa atuação entre vocês aumente ainda mais,\npara que possamos pregar o evangelho nas regiões que estão além de vocês, sem nos vangloriarmos de trabalho já realizado em território de outro.\nContudo, \"quem se gloriar, glorie-se no Senhor\",\npois não é aprovado quem a si mesmo se recomenda, mas aquele a quem o Senhor recomenda.\n\n2 Coríntios 10:1-18","language":"text/plain","encrypted":false,"added":1636419027}],"comment":[]}