{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1578325176,
			"title": "Getting rid of facebook",
			"body": "Getting rid of facebook and pretty much all clearnet sites, with a few exceptions. I think i'll stick to perusing some clearnet imageboards; bunkerchan,xyz, 7chan, maybe 420chan, but, I think I am starting to use less and less of the clearnet. To many normies and to much trouble.\n\nI mainly use sites through tor, i2p, Zeronet and freenet these days.\n\nMay you join me on the otherside; Live long and prosper, anon.",
			"added": 1578325175
		}
	],
	"topic_vote": {
		"1566357785_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV": 1,
		"1570845988_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1578888717_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1
	},
	"next_comment_id": 32,
	"comment": {
		"1566177396_18oN5jkSiB1SLb4Jywb4ZnKiwXqtQN5Fau": [
			{
				"comment_id": 1,
				"body": "What are you running on? Give me a little more information.\nIt sounds like you're having connection issues with tor. Are you able to connect to any hidden services?",
				"added": 1566178771
			}
		],
		"1566171789_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 2,
				"body": "> [223556](#comment_168_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): They're inspiring tbh [...]\n\nTfw they got their asses handed to them by a bunch of gommunists.",
				"added": 1566178874
			},
			{
				"comment_id": 3,
				"body": "YPJ/YPG > ISIS",
				"added": 1566178896
			}
		],
		"1566357785_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV": [
			{
				"comment_id": 4,
				"body": "I'm ok, man. I inherited some money from a relative who passed away. I finally got some nice clothing and furniture, lol. But it's bitter sweet, still. Wbu op?",
				"added": 1566364623
			}
		],
		"1566241934_13ifSHXbs2RtyHF4qkn4GrJ3krWEAAGmka": [
			{
				"comment_id": 5,
				"body": "> [ratsmack](#comment_22_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): It's funny how Security Concerned people willingly trust a VPN service: https://gist.github.com/joepie91/5a9909939e6ce7d09e29 [...]\n\nWow, not an argument.",
				"added": 1566367177
			},
			{
				"comment_id": 6,
				"body": "> [ratsmack](#comment_22_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): It's funny how Security Concerned people willingly trust a VPN service: https://gist.github.com/joepie91/5a9909939e6ce7d09e29 [...]\n\nWow, not an argument.",
				"added": 1566367241
			},
			{
				"comment_id": 7,
				"body": "> [aspidochelone](#comment_108_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Don't ignore risks outside the transmission channel.  If something you're accessing is more serious than government censors wanting to block it to virtue signal -- say, if you had Epstein's financial client list and holdings -- then if you read that file it is on your computer.  And, well, in the past week I saw Avast twice decide to up and transfer pieces of ZeroNet into the \"virus chest\" on account of \"IDP:Generic\" unspecified behavior, and that (like all anti-virus programs) has terms and conditions that inspire less than zero confidence.  So what do you think would happen if you had a file that somebody with a lot of cash or power was really, REALLY looking for?  (Yeah, you could turn off the virus checker, except the one in Windows, and Windows has terms and conditions that look like they might have been written by the same people). [...]\n\nUsing windows is about as insecure as you can get.",
				"added": 1566367414
			},
			{
				"comment_id": 8,
				"body": "> [gitcenter](#comment_632_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Eh, why?\n\nBecause you are just turning things around on him; you aren't actually addressing his question. Javascript is notoriously insecure.",
				"added": 1566367686
			},
			{
				"comment_id": 9,
				"body": "> [gitcenter](#comment_633_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Sure, but: [...]\n\nOk, my bad.\nAnd that still doesn't matter because OP using a VPN is irreverent to the actual security of Zeronet.",
				"added": 1566368231
			}
		],
		"1568417535_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 10,
				"body": "Hurrr, hurr, muh liberals.",
				"added": 1568428749
			}
		],
		"1570980089_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 11,
				"body": "> [harpyproductions](#comment_1_13kCqkdmy1yvF6mafYjGwnGhvJZnDiHJhj): do you think the feds wont know the difference from who actually browses that page and people who just passing by and get away as soon as they notice what CP actually stands for? i already got in at least 2 cp pages without knowing what it was about only 1 had cp in the name one of them at 08chan.bit. i run away as soon as i noticed and so far i have no problems with authorities\n\nDo you think they will care? If you have it on your drive then they have grounds to prosecute you. The state just cares about making money. Practice good opsec. Practice full disk encryption. Wipe constantly; programs like bleach bit are your friend (Ir just straight up microwaving old memory units and getting new ones constantly.) and, yeah, like the other dude said. Just black list anything that looks even remotely suspicious.",
				"added": 1571052571
			},
			{
				"comment_id": 14,
				"body": "> [harpyproductions](#comment_2_13kCqkdmy1yvF6mafYjGwnGhvJZnDiHJhj): i forgot to mention that i imediately deleted from my driver later. so what i was saying is that he can enter the page just to check if it is CP then he leave and if he deletes it , it is all ok.\n\n> [harpyproductions](#comment_3_13kCqkdmy1yvF6mafYjGwnGhvJZnDiHJhj): also he probably has to never come back again. this will tell the feds that you came there by mistake and want nothing to do with it. they have more things to do than to investigate a guy who probably already deleted all the files and even overwrite the free space just to be sure\n\nBro, read my lips, they don't give a singular fuck about you. The state is the coldest of all cold monsters.\nIt has its maxim that it must follow to the T at all costs.\nThe law is the law; owning child pornography is illegal. Weather you ment to jack off to it or not.\nThat is justice. \n\nMaybe Zeronet isn't the place for you if you think you are at risk right now for stumbling on CP.\nPlay with fire and you will get burned.",
				"added": 1571137097
			}
		],
		"1570845988_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 12,
				"body": "Some of these cats literally are just incapable of talking to women.\nA lot of it is the expectation of having sex with them; Like women owe them sex.\nYou have to learn to loose, my dudes.",
				"added": 1571052727
			},
			{
				"comment_id": 13,
				"body": "> [side](#comment_20_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3): Yeah thats even worse. I didnt have a chance then so i sure as fuck dont have one now.  [...]\n\nI mean, I used to say the same thing and, I guarantee, chances are you aren't as ugly as me. I at least have been getting laid regularly twice every few months from some bitches I picked up along the way.",
				"added": 1571052799
			}
		],
		"1570756155_1PY5FP1G6QNSCsA8nM1SjuXiPWZnQhQj9P": [
			{
				"comment_id": 15,
				"body": "> [anonymouslogin](#comment_40_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I agree that atheism has too much dogma, and becomes it's own wolf pack hating on the religious wolf pack. What's wrong with being agnostic?\n\nWell being agnostic is dumb, first of all.",
				"added": 1571137285
			},
			{
				"comment_id": 16,
				"body": "Yeah, i'm an atheist.\nAt this point in my life I see absolutely zero possibility of the existence of god.",
				"added": 1571137329
			},
			{
				"comment_id": 17,
				"body": "> [tnode](#comment_2_1BzjyXdmfFoTuAcb7VkRwxAR1vNah5fWt3): Work in a hospital or kill in the military. We may not have the proper word or name for \"God\" but.. there is something beyond this life.\n\nFeels < Reals my dude.",
				"added": 1571246884
			},
			{
				"comment_id": 18,
				"body": "> [wizardking](#comment_12_1A2qMS9kj8yHsZzuS621ttaMp8PJqT5YyU): I know atheists don't believe in god, but do you believe in other spirit stuff?\n\nno",
				"added": 1571246984
			}
		],
		"1571190639_15mJzWiShxgyYjrp6uAgRBbme4wWPUjwZn": [
			{
				"comment_id": 19,
				"body": "You fucking boomers couldn't get off your god damn rascles in the first place.\nStop larping.",
				"added": 1571247048
			}
		],
		"1571174452_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 20,
				"body": "It's about class divisions with in society and how alienation through the mechanisms of capitalism create mentally ill people with no hope and no way out.",
				"added": 1571247386
			}
		],
		"1572299410_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 21,
				"body": "Tor being built by the us navy doesn't stop tor from doing what tor does.\nWhat should really bother you is that they still use it.",
				"added": 1572438172
			},
			{
				"comment_id": 22,
				"body": "> [laracroft](#comment_6_1LvCmKVRHi59Sa5wfK4yyjR4hijrabpbm5): The military stopped using it, it's slow and insecure, didn't help Dread Pirate Roberts, did it?Case and point.How robust zeronet turns out to be remains to be seen, so far so good, only downside is there aren't too many people using it. A lot of very smart people, not a lot of common ground.\n\nDread pirate got caught because he was lazy and niave. Not because of the failures of tor.",
				"added": 1572438532
			}
		],
		"1571722926_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 23,
				"body": "This is nothing but insane propaganda.",
				"added": 1572438694
			},
			{
				"comment_id": 24,
				"body": "> [gaviscon](#comment_9_1koSUG26DkPTFK23zE8JNnpeVQsCuPJhr): bad things happen all over the world. why the sudden interest on what happens in china?\n\nCuz muh hong kong.",
				"added": 1572438705
			}
		],
		"1578318465_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 25,
				"body": "Lol, sanders is gonna win.\nI wish we had a real communist running, though.",
				"added": 1578324295
			},
			{
				"comment_id": 26,
				"body": "> [duck0](#comment_176_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): Communism is playing Russian Roulette with two fucking fully loaded revolvers pointed at both temples.\n\nWOW SUPER FUKIN SPOOKY BRUH GREAT ANALYSIS HOW FUCKING DEEP BRUH, SO DEEP, BRUH, BRUH BRUH.",
				"added": 1578414282
			},
			{
				"comment_id": 27,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1553_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): why don't we bring Mao back to life?\n\nCause science is a lie, anon.",
				"added": 1578414321
			},
			{
				"comment_id": 28,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1559_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Whole world is communist.  [...]\n\nGod this is so fucking retarded and ahistorical it hurts my brain. I can tell you are under 18",
				"added": 1578414367
			},
			{
				"comment_id": 29,
				"body": "> [z0z0z0z0z0z0z0z0](#comment_36_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA): Every societies with taxes distributed by \"government\" (communist) to others are socialistic societies.  [...]\n\nlmfao, being taxed under capitalism is not communism you stupid fucking neo nazi.",
				"added": 1578414446
			}
		],
		"1578888717_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 30,
				"body": "That's awesome. I love when racist faggots get robbed by the people they think they are superior too.",
				"added": 1578892253
			}
		],
		"1578875146_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 31,
				"body": "Selfie",
				"added": 1578892285
			}
		]
	},
	"comment_vote": {
		"634_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"394_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"56_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"1553_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	}
}