{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1565925178,
			"title": "Is there any good music sharing platform on ZeroNet?",
			"body": "",
			"added": 1565925177
		},
		{
			"topic_id": 1582469629,
			"title": "Ĉu ne estas esperantaj retpaĝoj en 0Net? [Aren't there esperanto webpages on 0Net?]",
			"body": "Se vi scias iun bonvolu ligi ilin en la rimarkoj. [If you know some please link them in the comments.]",
			"added": 1582469627
		},
		{
			"topic_id": 1583786953,
			"title": "ZeroTalk Esperanto is about to born but _seeders needed_!",
			"body": "“Ultimately Zamenhof's language, Esperanto, was and is more than a proposed solution to the language problem: it is an attempt to confront the spirit of inequality, of intolerance, of hatred that is tearing apart our beautiful world.” —Humphrey Tonkin [source: https://en.wikibooks.org/wiki/Esperanto]\n\nEven if you are not an Esperatnist yet, chances are that you already share the vision behind it.  \nSo please help seeding the [ZeroTalk Esperanto site ](http://127.0.0.1:43110/1YwB6u3f9TUfre8H9scXkbPyeuMaJSJio). See this [ZeroTalk thread](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1582469629_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA/+u+ne+estas+esperantaj+retpa+oj+en+0Net+Aren+t+there+esperanto+webpages+on+0Net).\n\nDankon!!!",
			"added": 1583786950
		},
		{
			"topic_id": 1588883431,
			"title": "When does a ZeroTalk clone qualifies to be listed in the header of this one?",
			"body": "For example, how much should [ZeroTalk Esperanto](http://127.0.0.1:43110/1YwB6u3f9TUfre8H9scXkbPyeuMaJSJio/) grow to get listed there?",
			"added": 1588883427
		}
	],
	"topic_vote": {
		"1582469629_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": 1,
		"1583786953_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1562445173_1CubdeDePywZpDx99J81tZSjJDNDGCzfzS": [
			{
				"comment_id": 1,
				"body": "How about using Respects Your Freedom certified hardwers instead?\nhttps://www.fsf.org/resources/hw/endorsement/respects-your-freedom",
				"added": 1562494689
			}
		],
		"1565908709_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 2,
				"body": "> [fodase](#comment_31_16cMkqz45EzZSjYqk37UTVXaYqLLtrXf3r): Zeronet is a honeypot, just like TOR.\n\nExactly: Just. Like. Tor.\nThat is why, it is recommended to use them together. To get more honey. Obviously.",
				"added": 1565925897
			},
			{
				"comment_id": 3,
				"body": "> [rusnoob1](#comment_15_1CyoFuqywpEgKYPHjQUui3TJQuEDqNqThN): It';s like you said he invented Android. Android uses as much Linux as Gnu. Or like you said that windows is ntldr.exe\n\nIndeed. In 1983 Richard Stallman started the GNU Project aiming to replace the proprietary operating system Unix with one that is free (as in freedom). GNU = \"GNU's not Unix!\" is the name of this liberated version of the Unix operating system. In 1991 the kernel Linux was added to this GNU operating system to complete it. So the correct naming is clearly GNU because that is the original name, but for popcultural reasons lots of people call it Linux or GNU/Linux. \n\nAll in all: ___\"There is no system but GNU and Linux is one of its kernels.\"___",
				"added": 1565984258
			}
		],
		"1565927048_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [],
		"1576494373_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 5,
				"body": "[Why Open Source misses the point of Free Software](https://www.gnu.org/philosophy/open-source-misses-the-point.en.html) by Richard Stallman",
				"added": 1576538015
			}
		],
		"1579155770_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 6,
				"body": "Use https://invidio.us/ or some other proxy to close this window and defend your soul from Google.",
				"added": 1579161158
			}
		],
		"1580289800_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 7,
				"body": "> [kanade](#comment_64_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP): Biological weapons are meant to act and kill fast, then die off quickly. What we're seeing doesn't match that at all.\n\nI agree, if it is a biological weapon, it is a really crappy one.",
				"added": 1581685368
			}
		],
		"1582469629_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": [
			{
				"comment_id": 8,
				"body": "> [jft](#comment_1_1GK9oMGVJgBXnn8XmX9Jn98jnWn5jQgwUc): mi ne scias esperantajn retpaĝojn.\nDomaĝe. :-( Iu devus krei. \nĈu iu bonvole povus forki ZeroTalk kaj ligili ĉi tie?",
				"added": 1582786061
			},
			{
				"comment_id": 9,
				"body": "> [jft](#comment_2_1GK9oMGVJgBXnn8XmX9Jn98jnWn5jQgwUc): ĝi estas eksperimentohttp://127.0.0.1:43110/1AgogHwQ4uqRshee5ZvhAEWKEDBSp4VzAn/?Home\n\nDankegon! \nNun ni devus anonci ĝin... por ekzemple en [0list](http://127.0.0.1:43110/186THqMWuptrZxq1rxzpguAivK3Bs6z84o/). \nKaj kiel aliaj lokoj? \n\nDevas esti kelkaj esperantistoj en ZeroNet... por ekzemple en [ĉi tiu blogo](http://127.0.0.1:43110/16exauHuGYMYnZosskjcuLU5bnSuLZPDGR/?Post:4:Vi+devus+lerni+Esperanto+//+You+should+learn+Esperanto).",
				"added": 1583502889
			},
			{
				"comment_id": 10,
				"body": "> [zelenazvezda](#comment_8_1G8B8kPwDH69FMuSPEvNkG8JJy5PxTpQtc): ĉi tiu retpaĝo ne funkcias por mi\n\nNi devus havi pli fontoj. Mi pensas ke nun nur jft havas la plenan retpaĝon. Mi havas la plej multo el ĝi, sed mi ne havas la dosiero all.js.",
				"added": 1583593238
			},
			{
				"comment_id": 12,
				"body": "jft & zelenazvezda: geekless kreis alian ZeroTalk Esperanto retpaĝon: http://127.0.0.1:43110/1YwB6u3f9TUfre8H9scXkbPyeuMaJSJio/ \nĈi tiu ŝajnas havi pli fontoj kaj funkicas pli bona. Bonvolu alŝutu ĉi tiun.",
				"added": 1583830801
			}
		],
		"1583786953_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": [
			{
				"comment_id": 11,
				"body": "> [zelenazvezda](#comment_9_1G8B8kPwDH69FMuSPEvNkG8JJy5PxTpQtc): i cant seed it, no peers found :(\n\nThat's strange. I'm constantly seeding it.",
				"added": 1583823469
			},
			{
				"comment_id": 13,
				"body": "> [kanade](#comment_86_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP): Who the fuck even speaks this dead language\n\nIt has about one or two million speakers and it even has thousands of _native_ speakers, which is really impressive especially if you take into account that it is less than 150 years old and that it was persecuted by both  Nazi Germany and the Soviet Union under Stalin.\n\nIn lots of online communities it is one of the top languages:\n- https://en.wikipedia.org/wiki/List_of_Wikipedias#Detailed_list\n- https://tatoeba.org/epo/stats/users_languages\n\nOn [lernu.net](https://lernu.net/) it has over 300,000 registered learners and about the same on [duolingo](https://www.duolingo.com/courses/all), and these numbers are constantly increasing. \n\n___So if you think Esperanto is a dead language, then think again.___\n\nSince it has only 16 grammatical rules and a very regular easy-to-learn vocabulary.  \nIt way easier to learn it than any other natural language. \n\nFor example, the Institute of Cybernetic Pedagogy at Paderborn University (Germany) has a study comparing the learning times of French-speaking high-school students. They got the following result: \n-   2,000 hours studying German\n-   1,500 hours studying English\n-   1,000 hours studying Italian \n-   150 hours studying Esperanto.\n\nSo it has a great potential to replace auxiliary languages Mandarin and English. Actually, if we were rational, we would have already switched to Esperanto as an auxiliary language because it is way more cost-efficient. Unfortunately, we are not rational. Still Esperanto has a good chance on the long run.",
				"added": 1583845625
			},
			{
				"comment_id": 14,
				"body": "> [edgelordofdecent](#comment_441_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): They took that from French students. Give me a study from a non-romantic language and tell me how long it takes to learn.\n\nIndeed, it would be nice to see such study. Unfortunately, I don't know such. \nNevertheless, the numbers in that \"French\" study are really impressive. \n\nEven though studying Esperanto from a non-romantic language is probably significantly harder than from a romantic one, I'm pretty sure that learning Esperanto from a non-romantic language is still way easier than learning any other language. I have good reasons to think that:\n- there are only 16 simple grammatical rules\n- all words are pronounced as spelt\n- there are no irregular verbs\n- verbs do not vary with person and number \n- etc.\n\nAll of thees are tremendous advantage for anyone who would like to learn Esperanto. \n\nBut you don't have to believe me. You can try it yourself how easy is to learn Esperanto. There are  plenty of learning materials online: https://lernu.net/ https://learn.esperanto.com/ etc.",
				"added": 1584014699
			},
			{
				"comment_id": 15,
				"body": "> [geekless](#comment_114_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): \n\nI did meant to advertise Esperanto because I think it is an amazing language that everyone should learn, but I didn't meant my comment as pure propaganda. \n\nMaybe I'm not good at putting my fingers on why was/is learning Esperanto so easy for me. Of course, it requires some work and effort to learn it but not that much. Compared to the struggle I had with other languages, learning Esperanto is indeed child's play.\n\nI think the simple grammar should be a key factor. Maybe the low number of rules is not that crucial as I thik but I don't even know how many rules English or my native language has. \n\nI maybe wrong but I think learning a language requires two things: learning the grammar and learning the vocabulary. I think learning the grammar of Esperanto is easy because it is simple and highly regular and learning the vocabulary is easy because everything is pronounced as spelled and because of the possibility to compose, transform and alter the meaning of word in a regular way (so one learns Esperanto words in bundles).\n\nTherefore, I don't really see why \"there are only 16 simple grammatical rules\" is bullshit because that is a measure of simplicity and simplicity should be a key factor here. \n\nAlso \"verbs do not vary with person and number\" seems to be another key factor to me. I have been learning English over decades and I still often make mistakes because of the lack of this even tough in English verbs only vary slightly with person and number. \n\nWhat I miss most in Esperanto (which is also missing from English) is a distinction between pronoun you in the \"singular you\" sense and in the sense \"singular you and they\".",
				"added": 1584179524
			}
		],
		"1586788363_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 16,
				"body": "Another layman's question: Why can't peers also be trackers (do the tasks of trackers)?",
				"added": 1586898447
			}
		],
		"1588883431_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": [
			{
				"comment_id": 17,
				"body": "> [styromaniac](#comment_2127_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Just ask and I think it'll be up there.\n\nWhom should I ask?",
				"added": 1588927674
			},
			{
				"comment_id": 18,
				"body": "@Nofish please add [ZeroTalk Esperanto](http://127.0.0.1:43110/1YwB6u3f9TUfre8H9scXkbPyeuMaJSJio/) to the list at the top of ZeroTalk if you agree that it is worthy of being added.",
				"added": 1588963096
			}
		],
		"1575162021_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 19,
				"body": "Respects Your Freedom certified laptops: https://ryf.fsf.org/categories/laptops",
				"added": 1589551322
			}
		]
	},
	"comment_vote": {
		"2_1GK9oMGVJgBXnn8XmX9Jn98jnWn5jQgwUc": 1,
		"6_1G8B8kPwDH69FMuSPEvNkG8JJy5PxTpQtc": 1,
		"110_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"23_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1
	}
}