{
	"title": "Zero-Net",
	"description": "Blog on Zero-Net, Crypto and Permissionless Innovation",
	"links": "- [Liberty.Me](https://liberty.me/)",
	"next_post_id": 22,
	"demo": false,
	"modified": 1465415473,
	"post": [
		{
			"post_id": 21,
			"title": "MaidSafe started dumping counterfeit MAID before public announcement",
			"date_published": 1465412205.56,
			"body": "I kind of missed the importance of this gem, which wasn't hard because there are hundreds of comments on that page. \n\nForum member MrAnderson [noticed](https://forum.safenetwork.io/t/maidsafe-and-project-safe-moving-forward/9558/67) that some of the counterfeit MAID were sent to Poloniex (obviously with the intent to sell them) *before* the community learned of MaidSafe's plan.\n\n> Wow this has my brain going a thousand different ways. One of the first things that popped into my head was this above thread started at the end of last year. It appears you already sent 1M to Poloniex over a month ago (http://omnichest.info/lookupadd.aspx?address=1JXEMejykPeq41qkAKNEtPzSDCKaohHndA) What can you tell us about this?\n\nOn the same page, MaidSafe's Dr. Irvine replied:\n\n> Well first it was not 1 million :smiley: it was 900,000 unsold coins form the crowdsale. We said the conclusion of the sale was completely horrendous, the mastercoin network was out of consensus. So the stop token was late and meant the extra Maid were already created. The sale also stopped short before the coins were all sold. It was 900,000 short. So these were simply the undersell amount, not any created in error. These should have been sold and will be.\n\nNo, those shouldn't have been issued, but since that was done by incompetent Mastercoin people, MaidSafe Foundation was authorized to issue only a specific amount of MAID, and the overissued coins were supposed to be destroyed. \n\nInstead MaidSafe Inc. borrowed them and sold them and thereby turned them into counterfeit MAID tokens.\n\nTo recap:\n\n* November 2015: MaidSafe CEO [explains](https://forum.safenetwork.io/t/extra-maid-generated-from-the-crowdsale/5766/59) that the overissued MAID may be given away to \"bootstrap the network\", but that won't be done without very careful consideration. (If you like humor, scroll down below this comment and notice MrAnderson's comment from that time - \"It has been an honour to be a part of this community and I only have positive thoughts towards the future.\")\n* March 2016: MaidSafe's Dr. Irivine wants to keep the community in the loop ([here](https://forum.safenetwork.io/t/extra-maid-generated-from-the-crowdsale/5766/63)) so he informs the community the overissued MAID were moved to another address for \"security reasons\".\n* May 2016: This time around MaidSafe \"forgets\" to keep the community in the loop. They send 900,000 MAID to Poloniex with the intent to sell them. Good timing!\n* June 2016: MaidSafe unilaterally announces that 20+ million overissued (counterfeit) MAID will be sold. \n\nWhat a mess!"
		},
		{
			"post_id": 20,
			"title": "MAID slides to four month low",
			"date_published": 1465280745.597,
			"body": "Today MAID briefly dropped to below 0.0001 which is the lowest price since the beginning of the last pump (and dump) that started in early February. Currently it is trading at 0.000108 BTC.\n\nI have no doubt this is only the beginning. I expect MAID to soon drop 60-70% to the level from late last year (0.00003-0.00004) and after that crash to a pre-IPO level. \n\nThe first drop could happen in June as it becomes clear the project is going nowhere. The second could happen when their selling start having a visible effect on net demand for the doomed coin.\n\n##Risk of new pump and dump\n\nSince MaidSafe must sell (dump) around 20 million coins for which there simply isn't enough demand, they will simply have to keep coming with optimistic news to counter their own dumping. \n\nBecause of that all positive news should be heavily discounted (and serve as an opportunity to sell).\n\nEarlier posts on this blog explain why MAID is worthless and why it won't and can't work.\n\n##Where to buy and sell?\n\n* [https://poloniex.com/exchange#btc_maid](https://poloniex.com/exchange#btc_maid)"
		},
		{
			"post_id": 19,
			"title": "Another shock to MaidSafe fanboys: no plan for Safecoin in MVP",
			"date_published": 1465185696.103,
			"body": "As this project entered a downward spiral, it has been slightly more open with regard to informing \"investors\" about their failures.\n\nIn a [topic](https://forum.safenetwork.io/t/release-terminology-clarified-mvp/9681) very representative of just how clueless the MaidSafe community is, forum member fergish (John Ferguson of http://www.safecrossroads.net/) said this:\n\n> In looking at a bunch of posts and reviewing my own history of how I've thought about it, I've seen some confusion about how we talk about the release cycle, MVP, etc., that I think we should clarify.\n\nUsing his podcast this simpleton has been cheerleading for MaidSafe and dragging \"investors\" into MaidSafe Inc.'s failed venture for over a year, all without understanding what MaidSafe wants to release.\n\nIn his understanding, minimum viable product that MaidSafe committed itself to releasing before they run out of crowdsourced funds is:\n\n> MVP ==> store data forever + messaging + safecoin = true/false\n\nGuess what? FALSE! Here's what Dr. Irivine [replied](https://forum.safenetwork.io/t/release-terminology-clarified-mvp/9681/11).\n\n> Yes at min a product would be a network that stored and retrieved data. However, until messaging / safecoin this network is still a test network. It will drop data until it's paid for. There is an option obviously, but we should consider it, until full product, as a minimum viable product. It will need to still prove itself secure etc. and that will require safecoin.\n\n> MVP != the released product with safecoin and messaging\n\n(As usual, forum fools such as happybeing \"liked\" to find out their MAID won't be convertible to anything except bitcoin and until such time that MAID goes down to zero).\n\nOkay, fanboys, are we clear now? **No Safecoin in MVP**.\n\nMaidSafe now plans to release a difficult-to-use version of ZeroNet with ZeroMail and on top of that network there is another \"DAO\" which raised > $1 million and which plans to do social networking (which ZeroNet will have by July). \n\nIf you go back to my earlier posts on MaidSafe, I've always said that Safecoin won't ever work. Soon that will become clear even to MaidSafe simpletons such as fergish and happybeing. \n"
		},
		{
			"post_id": 18,
			"title": "Proposal to sell MaidSafe domain aliases gains support of desperate MAID bag holders",
			"date_published": 1465121349.439,
			"body": "To summarize the current state of this miserable project: \n\n* After years of mismanagement and delays, they're out of money\n* MaidSafe Inc. now wants to sell counterfeit MAID coins that amount to 10% of total MAID supply\n\nThis and other proposals that have been [put forward](https://forum.safenetwork.io/t/maidsafe-and-project-safe-moving-forward/9558/) on the forum are either criminal or stupid. \n\nI wrote about legal issues in previous posts. Among stupid proposals, the proposal to sell domain name aliases on the SAFE network is the stupidest and therefore most popular.\n\n##Community of Fools: Before & After\n\nBut before we consider them, we should not forget that the issue of domain name registration has been discussed in better times (2014 and later) and it's interesting to compare community feedback from then vs. now.\n\nIn 2014 and 2015, almost everyone who matters was looking for ways to prevent SAFE domain squatting.\n\nFor example, here's what member 19eddyjohn75 [said](https://forum.safenetwork.io/t/ideas-for-dns-on-maidsafe/1599/35) before:\n\n>  I **totally agree with you that project Safe doesn't need DNS. But in it's current state DNS is a billion dollar industry and a total scam/rip off**. I'm just a simple consumer, but if I had the money, I would so totally disrupt DNS right now.\n> * If we can add Brand protection\n> * Register for unlimited time\n> * Lower costs to run a website\n> * A Safe environment to run your website\n\nUnsurprisingly, the same fool now [says this](https://forum.safenetwork.io/t/maidsafe-and-project-safe-moving-forward/9558/583):\n\n> Good point, Maidsafe should just charge these prices\n> http://mostexpensivedomain.name/9\n> Could get fun\n\nYou get the idea...\n\nHe's far from being the only one who's realized that lucrative \"scammy\" behavior could delay the inevitable collapse of MAID.\n\nAnother example is a former moderator happybeing. Here's what he said [before](https://forum.safenetwork.io/t/rfc-decentralised-naming-system-iii-prevent-domain-transfer-dirvine/5074/4):\n\n> I think squatting is not that bad, its a not very efficient or egalitarian way of ensuring that the people who badly want a domain can get it.\n\nAnd [this](https://forum.safenetwork.io/t/i-plan-to-attack-the-name-service/6388/9):\n\n> The other, is a technical choice to ensure elements of the network (in this case the human controlled elements that we know can't be trusted!) will find it harder to engage in centralisation of network capital (scooping up identities into their own privatised ICANN to do with what they wish).\n\nBut guess what: this does not apply to the superhumans from MaidSafe Inc. This week happybeing [claimed](https://forum.safenetwork.io/t/maidsafe-and-project-safe-moving-forward/9558/219) these particular humans can be trusted.\n\n> There is no basis for that distrust IMO - it is what it is, but not much MaidSafe can do when they are already so open about these issues, and also respond so fully and directly when asked about them.\n\nThis comment got 14 likes from like-minded fools, despite the fact that MaidSafe Inc. has been very poorly run and violated their commitments on multiple occasions.\n\nBut now more and more members think this is a wonderful idea. Here's what another flip-flopper [Traktion](https://forum.safenetwork.io/t/maidsafe-and-project-safe-moving-forward/9558/592) said today:\n\n> Pre-selling digital property which will be created at launch seems like a great/simple business plan to me. If anything, it would only add to the potential value of maidsafecoin too - both will be assets on the network, just with different properties. \n\nHe also said this:\n\n> Tbh, I am surprised selling DNS names hasn't been included in the business model and used as an asset to aid funding.\n\nMaybe they didn't because investors would wonder what other crazy revenue collection mechanisms this black hole will come up with next? \n\nAnd here's what the founder had in mind [not so long ago](https://forum.safenetwork.io/t/i-plan-to-attack-the-name-service/6388/):\n\n> Watching this thread and just wanted to throw in a left field idea here. For discussion purposes, what if you cannot sign a name over, so squat and you keep it ?\n\n[Here](https://github.com/maidsafe/rfcs/pull/19#discussion_r33794284) he said no account should be able to register more than 3 SAFE domains.\n\n> Personally I think we should restrict to 3 at a time (so require a delete of an old one to create a new one after that)\n\nNow we need to find out whether he really meant \"no one except MaidSafe\".\n\nDr. Irvine and Nick Lambert haven't voiced their opinion on the proposed DNS auctions yet, but I wouldn't be surprised if these two take a small 180 degree turn once they consider the potential to squeeze out some extra blood from their community.\n\n##It's worse than you think\n\nThe change of attitude isn't the biggest problem. It merely shows the low standards of the MaidSafe community (and maybe the management as well, we'll find out soon).\n\nReal problems:\n\n* **Deanonymization:** If SAFE domain names can be bought for fiat or BTC, they won't be anonymous. While you may think \"who cares, I'll register a free name later\", that is true, but that would represent effective *denial of anonymity* to anyone who wants a decent domain and would be a major breach of trust. **S**afe **A**ccess **F**or **A**nyone who wants a crappy domain name. \n* **Monopolistic behavior:** all potential users had the same chance at securing good domain names. Now MaidSafe Inc. may take over. \n* **Cost:** centrally-planned cost of domain names was never in the cards. Everyone was supposed to get one (or more) names by paying the same fee. If they go ahead, it'll cost you dearly because thousands of names will be auctioned so that each fetches the maximum price prossibe.\n* **Distraction:** instead of trying to do what they're supposed to (finish the damn software), MaidSafe will now work against MAID holders, and on their dime, to maximize their revenue from the sale.\n\nIf this proposal gets adopted by MaidSafe, it will only add to a growing list of highly questionable (if not outright illegal) moves by the desperate management and community. \n\nBut extraordinary circumstances require extraordinary measures. For now (see my previous post) we know the management is committed to selling the counterfeit coins, so nothing can surprise me.\n\n\n"
		},
		{
			"post_id": 17,
			"title": "Best of MaidSafe Counterfeit Coin Debate",
			"date_published": 1465070097.343,
			"body": "I picked some cool quotes from the ongoing discussion about the sale of counterfeit MAID tokens that MaidSafe is preparing, in order to give you a better idea of what that community (and moderators) are like.\n\nAll quotes are from [https://forum.safenetwork.io/t/maidsafe-and-project-safe-moving-forward/9558](https://forum.safenetwork.io/t/maidsafe-and-project-safe-moving-forward/9558). Commenter name (from the MaidSafe Community Forum) is provided at the end of each quote.\n\n##Best of MaidSafe Counterfeit Token Sale Discussion\n\n* Wanna sell 24 million counterfeit coins? Great!\n\n> (The proposal) Sounds very sensible. (Traktion)\n\n* Fix the Ponzi scam by inventing another one on top of it\n\n> In order to get more funds for Maidsafe, could treating the newly uncovered SAFE datachain as a SAFE network app, be used as a funding vehicle by way of an ICO? \n> Additionally, it could draw attention to SAFE as a proof that \"blockchain like\" tech can live on SAFE, something that had been speculated to be possible that now exists with a proof of concept. And peoples looove throwing money if you use that \"blockchain\" word in the mix! (bitybit)\n\n* Fix the Ponzi by finding a greater fool\n\n> @nicklambert Will you consider approaching VC investors to buy in? (ArtiScience)\n\n* Helicopter MAID: the more you print it, the more they love it!\n\n> Right on sprks; the market makers are here. It would be awesome to give them cheap MAID. Win/Win for the dev team and Maid investors. (MAID_SandM)\n\n* I don't care what you do, as long as I can get the hell out of MAID before you!\n\n> To protect the markets you must sell them to someone that will hold them til you at least release a final product. Dumping on the market NOW wil (sic) only further degrade all your positions and RUIN the fund. (HelpMe)\n\n* Screw the loan, make it a give-away! And that way they can't default on the loan!\n\n> It's more realistic to say the $25 million is theirs to do with as they wish. This sounds like a miscalculation, but from a PR standpoint, this is better than saying they will pay it back but never paying the advance back later down the line. (gonefarmin)\n\n* Celebrities to rescue!\n\n> Jeez can't one of those rich celebrities (Bono types) just send a million or two to MaidSafe to save the world? (whiteoutmashups)\n\n* Rare Crypto Coin Memorabilia\n\n> Please don't settle for the measly 7¢ each from the exchanges!! These SafeCoins are very interesting \"misprints\" etc and collector memorabilia and have inherent value to anyone who follows Project SAFE! (whiteoutmashups)\n\n* Two words: incredible honesty!\n\n> If it was up to me I'd say consider them a donation, no need to pay back :smile: I vote for whatever makes the team comfortable but it is sad to see an instant loss on a loan they have the keys to. This just goes to show how honest these folks are. (Nigel)\n\n* MaidSafe Proof of Work with community decision-making based on \"likes\"\n\n> The community should decide how they should be used. It would be more productive to consult the community. There are several options on the table that don't harm momentum. If you guys handle this appropriately, both you and investors win. (MAID_SandM)\n\n* Hey greedy shareholders, we gotta keep printing!\n\n> So you're mad your pie slice just got thinner? How's no pie at all? (Nigel)\n\n* Clueless (about the concept of property) but loud \n\n> Realised this is sort of like Satoshi coming back to say they were going to slowly sell their coins into the market to fund core devs (which wouldn't be a bad idea imo). (ioptio)\n\n* Centrally planned dilution\n\n> David stated that these coins, although erroneously created, have always been counted in the total MAID count, so they are not diluting existing MAID, they are simply selling existing MAID as a sort of bridge loan against revenue generated by the devs (employees of Maidsafe) from future products they produce (mvanzyl)\n\n* Sell it to the rich & stupid\n\n> Those MAIDs are worth a little more than 1M USD, which is a small amount to many rich guys. Just pitch to a few of them and sell to them directly.  (Xinxi_Wang)\n\n* Printing cures insomnia\n\n> What is people there problem? If Maidsafe is selling coins? Doesn't that mean that you buy more? The Maidsafe devs need money to further develop the platform, these people hardly sleep because they're coding up a better internet. (19eddyjohn75)\n\n* Founder: We could have screwed you even more, but we didn't. That's how nice we are!\n\n> With all the confusion we could have taken an advance at the $ price and that would have went almost unnoticed, but it would not have been right. (dirvine)\n\n* Founder: It's crazy not to sell the counterfeit coins!\n\n> The insanity would be not doing this and burn out, run out of cash and kill the project (dirvine)\n\n* Wall Street material: sell the counterfeit coins to someone who can promise they won't sell them - that won't hurt the price! \n\n> Offering like some other people have suggested a small discount , sell privately to people, have the coins time locked so they remain in the address and are not distributed, will be distributed over time in the next how ever many months or as release happens , slowly over time would be better for coin price. (gohan00760)\n\n* You've invested for short term (only 2 years) personal gain? Bad boy!\n\n> You've been given the opportunity to make an investment that has a growth curve stretching out at least 10 years. What exactly do you have to complain about, that is not directly related to your short term personal gain? (chrisfostertv)\n\n* This team has excelled at selling ideas that can't be executed. That makes you uniquely qualified for another crowdsale.\n\n> I wish you guys would do another alt-safecoin crowdsale based around structured data ala Decorum. You must have some killer ideas that could be monetized instead of risk having them gazumped by others down the track. (chrisfostertv)\n\n* Pitch the project to the NSA before they read this comment!\n\n> Suggest to the intelligence agencies that SAFE would be great for them, and they might kick in a few quid. Pitch it differently to each side (the US gov would be interested in something that breaks the GFC); and they all would like somewhere to hide their communications. Tor has always been funded by the US gov all along for that latter reason. (bluebird)\n\n* Central planner with overclocked brain: failure is not an option\n\n> This project is everything and it must go on at all costs. (cl0ck3d)\n\n* Conspiring to defraud is wise\n\n> This was very wise - to have a plan B when trying to make a deal with someone whose only interest is to get as much from you as possible, and who you know is likely cut you off the moment they see a better option elsewhere. (happybeing)\n\n* Big underwater investor: screw it, I'm doubling down!\n\n> If you wish to discuss further details of me buying a batch amount, just private message me (if it's activated on my account) or email me. I would prefer to see these coins sold in batches to private investors rather than adding downward pressure on the exchange price for months. (iammystery)\n\n* Look, this thing is the same as that other, different thing\n\n> Ethereum is mining 30% new coins this year. That's 2,5% new coins each month due to mining. 19 million MAID is 4,19% of the total available coins. If they bring these to market spread over 6 months that 0,7% \"new coins\" per month, still way below the monthly 2,5% ETH that get mined and brought in existence, and only for 6 months. And I even believe they will take more time than 6 months. (polpolrene)\n\n* Warning: selling the coins means the buyer would own them!\n\n> Selling that amount to a single unknown individual who could decide to dump them with no discretion would be very dangerous and equivalent to throwing money away. (Savage)\n\n* MAID crowdsale buyers should be grateful that MaidSafe didn't do their job and sue Mastercoin \n\n> I certainly think they acted swiftly to respond to and stave off a potentially disastrous situation incredibly well, and saved the company and the project by how they handled it. All crowdsale investors should be grateful for that, including those who took advantage, and dumped MSC (in fact especially them). (happybeing)\n\n* MAID holders, all hope is lost: leave your votes behind!\n\n> It's fair enough for us to have opinions on everything, but we can't and shouldn't expect to be involved in the decision making processes of the privately owned company or the charitable foundation. (happybeing)\n\n* Screw VCs and new investors - my friend can help us get good taxpayer money!\n\n> You guys should really apply for that EU grant. Actually one of my closest friend is a coach for EU and we talked just a couple of days ago that you guys should apply and that you would get approved for sure. (Panda)\n\n* The next big crowdsourcing idea: Dinner with Warren\n\n> +1 the donation idea. Seriously worth some thought, I think. Maybe with some appropriate, fun incentives. Such as donate 10K (USD), get dinner with the dev team in Troon. (dlux)\n\n* I wasted my entire crypto-savings on MAID and all I got was this lousy T-Shirt\n\n> Some crazy idea, but what about having some limited edition stuff in a shop for donations/payments. (iJRN)\n\n* Ignorant and impressable\n\n> I continue to be deeply impressed by the integrity of the people at Maid. (MerkleTree)\n\n* Screw shareholder vote - Proof of Post rocks!\n\n> wow, 286 posts.. well all the info and answers to any questions must be coverd by now. Maidsafe team, back to work  (sprks)\n\n* Epic fail\n\n> Sell this 28M maid and close this too long conversation haha... We just need to focus in test 4 and mvp. (epic)\n\n* If you hold MAID, you know what abuse is\n\n> I  think the SAFEnetwork attracts those who have reason to value restoring power to those who have suffered or witnessed abuse, and it is bound to make us worry that may happen here one way or another. (happybeing)\n\n* The DAO of Ponzi: Second Derivative of a Failed Project\n\n> I think the best course of action is:\n> Plan A) Make an proposal to theDAO. (piluso)\n\n* MaidSafe Community Moderator: The DAO is not the Way (because their shareholders can vote, while here MaidSafe Inc. can do as they please)\n\n> It's their company and vision, they shouldn't give away any part of that. The DAO would mean extra crowdfunding using ETH and people voting on proposals using DAO-Tokens. (polporene)\n\n* MaidSafe Community Moderator: Premined coin is Proof of Resource\n\n> Don't think we really need or want safecoin to do everything. It has value because it's tied into the Proof of Resource function of the network, and otherwise is a liquid currency.  (Fergish)\n\n* Modern Day Slaveowner\n\n> Wealth isn't about exploiting financial markets. The key to wealth is INVESTING IN OTHER PEOPLE. I never invested in \"maidsafecoin\" I invested in Dirvine, Neo, Frabrunelle, Paige, rossmuir, Fraser etc.. (cl0ck3d)\n\n* Make that phone ring, with confidence\n\n> Anybody know Manoj Bhargava (Billions in Change)? Still think he'd see how much this network is going to change things for the better and would be very willing to help out with funding. (upstate)\n\n* Everything seems all right to me!\n\n> On a more serious note, I'm surprised how much drama is rising from a normal, understable, well thought business decision of the type that is made in every company from time to time.  (MyLegacyKit) \n\n* If they are stupid enough to hold MAID, they'll buy anything\n\n> But why not enable people to buy specific Safenet urls, as a preorder type of thing, over a few days. (Panda)\n\n* Ponzi Resurrection\n\n> what about maidsafe creating another cryptotoken backed by their future development? NOT maidsafecoins, actual MAIDSAFE STOCK (well, their crypto equivalent term). MAIDSAFE CRYPTO stock. it could be a token that has a built in contract with whatever properties suit all parties. (bitybit)\n\n* Money is not the most important thing in this world\n\n> Taking funds from private investors would have to be further defined, who can invest, because they become partners tied at the hip. This of course takes time and employee resources to define, meet with investors and sign agreements as well, so there's that. (gonefarmin)\n\n* MaidSafe Community Moderator: there could be investors who want to pay more than the market price\n\n> But if they sold at a higher price, to attract those who wish to support MAIDSAFE rather than the traders. Wouldn't this stop that effect. (neo)\n\n* Pump To Dump: Positive News Channel\n\n> I realize selling 25 million maidsafecoins on an open exchange would sink the value/asking price, but that's not what I'm proposing. Sell only in intervals of what's needed, coinciding with dev/FIN updates. (gonefarmin)\n\n* From TED talk to World Peace\n\n> maybe David should have a Ted talk, about:\n> How Maidsafe will make the internet SAFE\n> How SAFEcoin will end the talk about helping the poor (19eddyjohn75)\n\n* Robbed while typing \n\n> I don't think the UK govt will try to take maidsafe to court overt the 24M lol :wink: Maybe over other things in future, but that's a whole different kettle of fish and they have always behaved morally and legally as far as I can see (Jabba)\n\n* MaidSafe Community Moderator: maybe illegal, but certainly not theft. But let's do it anyway\n\n> Maybe a breach of some sort of contract which is not theft. (neo)\n\n* The man who ID-ed the skeptics\n\n> As ProjectSAFE becomes more widely known, have no doubt that .Gov types will be on here trying to disrupt us. (chrisfostertv)\n\n* Mission-creeper: if you can't do one thing, do two\n\n> I propose another solution. Start a decentralized ISP company (maidISP) that build a meshnet boxes. (grizmoblust)\n\n* You need (more) money to make money\n\n> The meshbox cannot be made from scratch:\n> Lead time would be a lot longer than two months.\n> You need to manufacture such a thing in large numbers to make it economic, which means payment up front. (bluebird)\n\n* MaidSafe version of \"Grant me chastity and continence, but not yet.\"\n\n> I'm all for decentralising everything under the sun, but decentralisation requires proper coordination solutions. (Jabba)\n\n* The Project needs a sacrifice. And you're it!\n\n>  Safenet needs you bro, the world needs safeexchange and you could do something that affects millions of lives. (Jabba)\n\n"
		},
		{
			"post_id": 16,
			"title": "CEO of MaidSafe says counterfeit MAID to be borrowed from MaidSafe Foundation and sold",
			"date_published": 1465068902.565,
			"body": "Minutes ago the CEO of MaidSafe, Nick Lambert, told us that the counterfeit MAID will be sold.\n\n> Regards Patreon funding, we haven't made any at this point. As per other communication we are taking it all on board but not rushing to any decisions. **With the use of MaidSafeCoin we now have a longer runway than only a few months**.\n\nSource: https://forum.safenetwork.io/t/maidsafe-and-project-safe-moving-forward/9558/561\n\nNo approval by majority of MAID holders has been obtained. The entire discussion is contained on that long page and there is no way to know how many MAID tokens are held by those who \"liked\" the scandalous idea."
		},
		{
			"post_id": 15,
			"title": "MaidSafe: Will the first big profile crypto IPO become the first big profile crypto IPO case in court?",
			"date_published": 1465038299.007,
			"body": "First off, those who aren't aware of MaidSafe and recent developments can refer to my previous posts on the topic of MaidSafe (MAID):\n\n* [The Unsound Economics of MaidSafe](http://127.0.0.1:43110/12Q63F1Nh2hVoYkBEfvKcoTWihsrUvvuLu/?Post:13:The+Unsound+Economics+of+Safecoin)\n* MaidSafe (MAID) Over-Issuance: Technicalities and the Truth\n\nIn this post I will touch upon the likelihood of MaidSafe (the company and/or the foundation) getting sued once MAID collapses.\n\nHere's why they could (and should) get sued:\n\n* In the \"IPO whitepaper\" cited in previous posts, the total issuance of MAID was supposed to be close to 10% less. For some reason (mistakenly or deliberately, it doesn't matter), 10% more MAID tokens was issued than promised. This means the contract was broken. \n\n* Mastercoin people who assisted with the crowdsale screwed up MaidSafe. The MaidSafe management should have sued or asked for a compensation because that would have been in the interest of investors. They didn't.\n\n* Because the crowdsourcing contract was broken due to \"over-issuance\", the MaidSafe Foundation was supposed to remedy the issue by burning the counterfeit (\"over-issued\") MAID coins immediately. Instead they decided to hang on to them. \n\n* This week they decided to sell the counterfeit tokens. In previous posts I explained why that is a problem. \n\n* MaidSafe Inc and MaidSafe foundation keep ignoring their duty to get a valid approval (by way of voting) from MAID holders for the significant changes to the IPO contract. They are aiming to decide this by getting enough likes from pseudoanonymous forum members, which is completely invalid and totally bizarre. \n\n##Will MaidSafe get sued?\n\nIt depends on whether MAID (and/or Safecoin, if they ever get to v1.0) collapses or not.\n\nIf it collapses, at least some MAID speculators will be mightily pissed off.\n\nA small token that makes speculators lose money usually doesn't invite much ire because most speculators are small and amounts lost can't justify legal action. Secondly, there's no one to sue (unless you think some loser with a laptop would be able to compensate anyone or go to jail). \n\nIn this case it's different. \n\n* Market capitalization of MAID is over $20 million. Big part of it is probably still held by Mastercoin guys who screwed everyone up and I don't think they give a crap (they probably made 10x if not more on their initial investment in the crooked crowdsale), but there's probably 50-100 \"investors\" who will have lost few million dollars.\n\n* MaidSafe is a legal entity in a regulated jurisdiction. In fact there are two  legal entities (the company and the foundation) with potential conflict of interest and other issues, so even if the crypto-token part is ambiguous, they still can get in trouble. They're low on funds so I doubt they can pay any damages, but speculators could certainly derive some satisfaction from seeing them in court.\n\n##Useless Community Forums\n\nI am posting here because on the \"official\" community forum the atmosphere is very hostile and the socialist groupthink fanatics who moderate the forum have sided with MaidSafe Inc. [Here](https://forum.safenetwork.io/t/maidsafe-and-project-safe-moving-forward/9558/465) is how one poster put it today:\n\n> I didn't speak up because I find this entire forum hostile.\n\n> The proposition to liquidate the mistakenly issued coins is theft, at least in the US. That many vocal members of the community do not mind the theft, that the theft will go to an undeniably noble cause, is irrelevant to what it is: theft. That theft creates a liability that would preclude soliciting investments for projects that utilize the Safe network.\n\nPredictably, the poor guy was attacked and compared to Goebbels, and an expert moderator \"explained\" why the sale of counterfeit issuance can't possibly be theft.\n\n> You don't set a jurisdiction if it was just theft in terms of determent\n\nJust as an aside, theft is theft and they can be sued anywhere.  Mastercoin individuals who helped with the crowdsale are mostly located in the US and the \"IPO\" was jointly (by Mastercoin and MaidSafe) advertised to US persons, so although I am not a lawyer I can't see why MaidSafe couldn't be sued in the US as well as in the EU. \n\nBefore anything happens, MAID has to collapse. That can happen anytime: \n\n* If they can't sell the counterfeit tokens without crashing the price\n* If they can't sell enough of the counterfeit tokens to pay the devs\n* If they finish the product and it becomes clear that Safecoin can't work (see my previous post on Safecoin economics)\n\nSeeing how badly MaidSafe has done, one can only imagine disasters we'll soon start seeing on **The DAO** platform.\n"
		},
		{
			"post_id": 13,
			"title": "The Unsound Economics of Safecoin",
			"date_published": 1464847065.267,
			"body": "In this post I will highlight main economic reasons why SAFEnet (MaidSafe's network) cannot succeed in the long term. I may expand and update this post as time permits.\n\n* Safecoin is a highly inflationary currency\n* Safecoin isn't backed by anything\n* SAFEnet is inefficient\n* The rewards system is unworkable\n\n##Highly Inflationary Currency\n\nSafecoin will be a highly inflationary currency. At the moment, there's over 430 million Maidcoins in existence. Once the network goes live (which may or may not happen) owners of MAID will be able to convert their holdings to Safecoin.\n\nFrom that point on, the price of Safecoin will supposedly automatically adjust based on supply of coins and demand for storage space (more on that later). \n\nThe growth of Safecoin monetary supply is described in one of the MaidSafe official documents which I don't want to waste time on because it's based on simplistic guessing. It is 99.999% certain that real life won't be anything like they expect in that document. Hell even the currency itself may not work like they expected.\n\nBut in the highly unlikely case that Safecoin and its network work as expected, the supply will grow to many billions (42,949,672,900). Why anyone expects that MAID will appreciate from the current overbloated level is one of greatest crypto investment mysteries of all time!\n\nYou may ask \"but where are your arguments?\" to which I say I don't have any and I *don't need to have any*. The burden of proof is on MaidSafe (or you, if you agree with their economics). The coin is not backed by anything!\n\nYou can read their unsound money fantasies in [this](https://github.com/maidsafe/Whitepapers/blob/master/Project-Safe.md) document, but let me give you a hint: 10% of MAID (one day Safecoin) already exist. Where's the network disk space that's backing those coins? \n\nThe coin is already inflationary! Which brings me to the second point: an unbacked currency. \n\nBut to round up this point: \n\n* From the very beginning farmers will not be paid the lowest market price for storage capacity\n* Farmers make money only when data is downloaded, so farmers need to make a significant investment in bandwidth and capacity before they can start reaping small rewards\n* The rate of issuance (inflation) is significant\n\nA revenue-seeking farmer would never run SAFE as long as there's a way to sell their space for bitcoin. It's that simple. Even if they could get paid the same (and below we will see they won't) the cost of crypto-exchange would make Safecoin slightly less attractive.\n\n##Safecoin is Unbacked Currency\n\nThe founders are probably not aware of it (because they don't understand Austrian economics), but Safecoin is **not backed by anything**. \n\nThis statement would get you moderated away at their forum, so you won't find much on this there.\n\nThe MaidSafe project claims Safecoin is (will be) backed by Proof of Resource: initially storage (capacity) resources and later other (maybe compute or network). But is that really so?\n\nAs I mentioned above, 10% of the maximum monetary mass is already in circulation, and yet 0 bytes of network space has been paid for with the (equivalent) of millions of US$ spent.\n\nIf that's not enough of a hint, you're hopeless.\n\nBut just for fun, let's also consider there's a concept of recycling of Safecoins, but there's no recycling of disk space. That is, a Safecoin spent to upload data to the network is \"recycled\" (passed on to farmers, app creator, etc.), but the space on the farmers' disks never gets released. Think about that: spent money is recycled, but space is not returned. In the long run, one and the same coin can buy an unlimited amount of space. If that doesn't sound weird to you, you must be a fan of Bernie Sanders.\n\nThose who understand the economics and math may also want to take a look at another can of SAFE worms which is related to the way the network autonomously adjusts its \"reward rate\". That whole area is a complete economic joke hidden behind a think veil of mathematics, so it's impenetrable to most readers. But it's very easy to understand - without having to know the math or anything else - once you think of it this way: **at any given moment, the supply of unused disk space is smaller than the amount of space all outstanding Safecoins can buy at the current advertised price**. \n\nIt's a Ponzi. The network may have 10 TB of unused space and despite that all Safecoins out there may be worth $10,000,000. So how much does one need to pay for 1 TB (or even less - see further below)? One million bucks. Clearly, this doesn't make any sense. \n\nThe Safe Socialists claim this kind of situation would motivate farmers to buy more disk space, but even if they did (say, they put an extra 10TB on line), there would  be no demand ($500K/TB doesn't sound much better, does it?). If we continue like this, we will realize in order for the coin to be worth something, it has to be fully or nearly completely backed by disk space, and Safecoin isn't (won't be). \n\nBut this - Economics 101 - is too complex and repelling for the socialists on the MaidSafe forum so my attempt to explain how Safe Ponzi works probably won't end up in the MaidSafe Community Wiki. \n\n##SAFEnet is Inefficient\n\nMultiple copies of all large files are made. I think currently the replication factor is 4x which means if you upload 1MB of data you'll occupy 4MB of storage capacity on the production (mainnet) SAFEnet. \n\nThat means a \"farmer\" (the person who provides storage space) can charge for 25% of the capacity. Or put differently, you need to pay 400% more to store your data on the SAFE network. \n\nOverhead on other networks and professional hosting companies is far smaller (usually 50-200%), so clearly either SAFEnet space will be very expensive, or no farmer will be able to make money (or the both).\n\nI suspect the second is more likely to be true: no professional farming will be possible. Hobbyists will salvage/dump some unused disk space and that will be it. But even that is unlikely when they can't actually get paid (meaning, in BTC or some local currency) unless they get rid of Safecoins first.\n\n##The rewards system is unworkable\n\nIt should suffice to say that the rewards system is completely unworkable. You don't need to believe me on this. Just go to forum.safenetwork.io and search for \"rewards\".\n\nAs it stands now, the system should reward \"farmers\" (storage providers), \"content producers\", and application providers. But since there's no way to know the identity of people on the network, it's entirely possible to upload random garbage and hire 1,000 bots that download it all day long. But that's not all. \n\nThere is no agreement on this, and neither there is agreement of how the system should work in the first place. Floated ideas range from pure socialist nonsense (that everything should be free and Safecoin given away) to that only farmers (storage providers) should be rewarded (which of course is exploitable using the same bot army mentioned above; the only inconvenience is whereas with the content you upload you can target your content with a 100% success rate, while farmers can't choose what they store so one would have to find cheaper bots and hit all network content to get a small share of rewards, but exploitable it is - it's just a matter of how cheaply one can acquire the bots).\n\n#Bonus Material on MaidSafe Over-Issuance\n\nI just spotted this in the MaidSafe \"IPO white paper\":\n\n> A quantity of 429,496,729 coins will be available for purchase, this equates to 10% of all safecoins\n\nWell, now that it's likely (see my previous posts) that a quantity of 450 million coins will be made available for purchase, we know they lied. Of course, they can claim they proposed a change and \"the community\" (meaning 20 socialist fanboys on the community forum who may not own a single Safecoin) agreed.  Problem solved!\n\nSecond, since 450 mil MAIDs will be made available, would the total supply be 45 or 42 billion? You see, the socialist fanboys on the MaidSafe community forum aren't asking this question because it doesn't really matter. Fourty two, 52, whatever. To them these are just numbers that mean nothing. Which is exactly my point.\n\n"
		},
		{
			"post_id": 12,
			"title": "MaidSafe (MAID) Over-Issuance: Technicalities and the Truth",
			"date_published": 1464764492.036,
			"body": "> \"The coins that are already in existence are doing nothing. Nothing at all\".\n> **~ David Irvine, MaidSafe** (LetsTalkBitcoin.com [interview](https://letstalkbitcoin.com/blog/post/safe-crossroads-podcast-33-david-irvine-speaks), 1:36:45 mark)\n\nI want to point out some perhaps less obvious problems related to the shocking proposal by MaidSafe Inc (see my [previous blog post](http://127.0.0.1:43110/12Q63F1Nh2hVoYkBEfvKcoTWihsrUvvuLu/?Post:10:MaidSafe%27s+Captive+Lenders)).\n\nFirst, I am not sure that *over-issuance* is an appropriate name. The Mastercoin (now Omni) issued 452,552,412 MAID on behalf of the MaidSafe Foundation and *sold* some 24 million less. They \"over-issued\", yes. But the concept of over-issuance isn't really clear (I've never heard of it until now), so I don't think we should just accept it. What does that even mean?\n\nAnd what happened with the counterfeit 24 million MAID coins? What did they do with them? Mastercoin gave them to the issuer, the MaidSafe Foundation. \n\nThe Foundation had plenty of time to send those coins to a burn (unspendable) Bitcoin address and put an end to this nonsense. No harm - except to the lousy reputation of Omni - would have been done. \n \nThis issue came up several times on the MaidSafe forums since then. Last year (see the MaidSafe Community forum) it was suggested that these overissued tokens be burned, but most forum members (and especially moderators there who tend to act as an quasi-independent extend arm of the MaidSafe project) were against the idea. No surprise there - it's enough to read few contentious topics to realize most members are socialists and/or crony capitalists. I remember one of the amusing \"justifications\" why the over-issued tokens shouldn't be destroyed was that we should trust the Foundation that they'd act in the best interest of the community (screw the token owners, of course). \n\nPersonally I would say around last summer MaidSafe Inc realized they may need those coins so they were more than happy to have seen \"the community\" felt the same way. A win-win situation!\n\nSecond, MaidSafe leadership are still trying to justify their poor decision making. For [example](https://forum.safenetwork.io/t/maidsafecoin-price-and-trading-topic/5869/688) here's what Dr. Irvine said about their choice of Mastercoin and the approach (to accept the Mastercoin token, MSC, in addition to Bitcoin):\n\n> When we did the crowd sale that facility was not available. It was the crowd sale repercussions that pushed that through. Nobody will ever get caught like we did, at least we hope so. It was a particularly horrible time as we discovered not only was that not available but we in fact had to write a lot of the scripts ourselves to transfer msafe to people who paid in bitcoin (most of us).\n\n> Now omni is controllable from an asset owners perspective, for us unfortunately it was not. We depended on the advice we got from the best \"experts\" in the field. They (well some of them, not all) got rich and we got screwed to a great extent. We still suffer the ramifications of that sale, even today.\n\nAt the time of MaidSafe IPO [Counterparty](https://counterparty.io) offered the same \"issuer is in control\" functionality at almost *no cost*: the cost of Counterparty token issuance was (and still is) around $1 plus a bitcoin transaction fee (0.0002 BTC). (For example, a Counterparty token humorously named \"MASTERCOIN\" was [issued](http://blockscan.com/assetInfo/MASTERCOIN) months before the MaidSafe IPO.)  \n\nThird, as I explained in the previous posts, it is MaidSafe Inc. that wants to borrow 24 million MAID from The MaidSafe Foundation. And guess what: the same people lead the both organizations - something like the relationship between Wall Street and the US Federal Reserve System. I imagine MaidSafe Inc and MaidSafe Foundation will lead exhausting negotiations over this idea!\n\nMaidSafe Inc. can borrow 24 million tokens from MAID holders and pay the market interest rate (which we know from the Poloniex' MAID lending market) after a grace period of 6 or 12 months. But they won't do that.\n\n##The Truth (as I see it)\n\n* MaidSafe management showed terribly poor judgment. Better choices for crypto-investors existed at the time of the IPO and MaidSafe Inc were aware of them at the time. *They choose experts they trusted*. And when they and investors got ripped off they didn't sue Mastercoin which is something they had fiduciary *duty* to do. Since they failed at all that, they should **step down**. Instead they want to sell the over-issued tokens!\n\n* Anarchocapitalists (see [https://wiki.mises.org/wiki/Inflation#Unbacked_money](https://wiki.mises.org/wiki/Inflation#Unbacked_money)) see this as \"unbacked money\" and hold that **inflation** occurs when additional supply of currency comes into existence (not when it starts circulating). Socialists and crony capitalists (including Keynesians) claim otherwise. A true capitalist would have burned the 24 million over-issued tokens right away. The socialists at MaidSafe Foundation didn't, and look what happened. \n\n It could be argued that this isn't a case of over-issuance. When 452,552,412 MAID were issued, buyers and later traders assumed that the \"real\" number is 24 million less. MaidSafe now claims all 452 million are included in the current capitalization. That's untrue and completely nonsensical. Soon they probably will be, but until now the assumption was that they don't \"really\" exist. \n\n And no BTC was received for the 24 million MAID, so what is the \"capitalization\" of the 24 million over-issued MAID? It is zero. They are worthless (unbacked money) and must be destroyed. Instead MaidSafe is on way to make all 452 million MAID equally worthless.\n\n* Because it is the founders who control the \"over-issued\" tokens, this is the easiest, worst and laziest way out of the present troubles. Last year they could admit they were clueless and come up with a rescue plan. Now it's too late. \n \n---\n\nI am not at all surprised by these developments. Any anarchocapitalist could have seen where this was going. But even some real capitalists fell prey to the ongoing [crypto-bubble](http://127.0.0.1:43110/12Q63F1Nh2hVoYkBEfvKcoTWihsrUvvuLu/?Post:8:Crypto+Bubble+of+2016), let alone socialists and crony capitalists from the MaidSafe community. \n\nAnd the MaidSafe Community moderators (see who responds as moderator at [https://forum.safenetwork.io/c/meta](https://forum.safenetwork.io/c/meta)) have been helping maintain the illusion and consistently support \"stupid, but positive\" forum members. \n\nSince my previous post two hours ago in which I repeated my sell call on MAID, MAID dropped 50% more. It was 13% down, now it's over 20% down today. And no, this isn't a buying opportunity.\n\nBuy some popcorn and head over to [https://forum.safenetwork.io/t/maidsafe-and-project-safe-moving-forward/9558/121](https://forum.safenetwork.io/t/maidsafe-and-project-safe-moving-forward/9558/121)!\n"
		},
		{
			"post_id": 10,
			"title": "MaidSafe's Captive Lenders",
			"date_published": 1464755638.157,
			"body": "In [this](https://forum.safenetwork.io/t/maidsafe-and-project-safe-moving-forward/9558) post published today the MaidSafe founder outlines \"next steps\" for the project. There's only one key point, really: it's about money. What money, you ask?\n\n> To enable us to grow SAFE as aggressively as possible the decision has been made to make best use of the 24 million MaidSafeCoins that the MaidSafe Foundation currently holds. The Foundation has these MaidSafeCoins as a result of a technical issue with the Master Protocol (now Omni protocol) that resulted in an over issuance during the crowdsale. These coins are, and have been, calculated as part of the safecoin market capitalisation, though they have not been put into circulation. The existence of these MaidSafeCoins has been known about since the crowdsale, and what to do with them has been discussed amongst the broader community on the SAFE Network forum.\n\nOne disaster (the worst-executed major crypto-crowdsourcing in history) is now followed by another: they'll sell the 24,000,000 MAID and spend them on development. \n\nIt's pretty much a finished act at this point as \"community\" feedback on that page is overwhelmingly positive. Except [this one post](https://forum.safenetwork.io/t/maidsafe-and-project-safe-moving-forward/9558/67) noone is seriously challenging *numerous* issues with this idea. Most of them should be perfectly obvious, but clearly dozens of other posters didn't see anything wrong with the plan - in fact many have suggested that the money (tokens) be simply used and not returned!\n\nNeedless to say, this is a total disaster. Those coins should have been sent to a burn address the moment they were discovered. But instead, like a trashy politician or some character from The Lord of The Rings, MaidSafers gave in and decided to put this \"unused resource\" (\"savings glut\") to work.\n\nBy putting these wrongly minted tokens in circulation - and it looks like it will be approved (or else the project goes down) - MaidSafe Inc. will be able to borrow money from the MAID holders by effectively diluting them until the SAFE network goes live. The owners of MAID are not being asked - and have no real way to say no - whether they agree to lend money to MaidSafe Inc. and from the founder's post it seems they don't plan to pay any interest on that loan. Before you dismiss this latter point: Poloniex has a lending market and MAID can be borrowed so the interest rate is known. It just won't be paid by MaidSafe Inc.\n\nIf everything goes according to their plan, the coins would be sold for fiat to speed up the development and marketing. Later (when the network goes live) MaidSafe Inc. would return the funds to the MaidSafe Foundation by taking a smaller cut from farmed coins (developer rewards which amount to a few percent of newly generated Safecoins).\n\nWhat did I say in in the previous two posts? That MAID (the coin) is going nowhere and that people should get the hell out of this project while they still can. As of now, MAID is 13.66% down (coinmarketcap.com) and it's still not too late to avoid serious losses.\n\nI fully expect \"the community\" to get less supportive of the MaidSafe's new plan now that everyone is 13.66% less rich. But there's no way out. The project is running out of money (another thing I mentioned in earlier posts) and there is no other *practical* way they can pay their developers.\n\nOnce again, get the hell out of MAID! And The DAO, too, which is another joke I commented about in a previous post and which has since been discovered to contain numerous [technical security issues](https://docs.google.com/document/d/10kTyCmGPhvZy94F7VWyS-dQ4lsBacR2dUgGTtV98C40/preview#) which only add to other serious issues I have blogged about.\n\n"
		},
		{
			"post_id": 9,
			"title": "Coinless MaidSafe Network?",
			"date_published": 1464016834.054,
			"body": "In the previous post I wrote about my reservations about MadiSafe's network coin (now MAID, later Safecoin). \n\nShortly after I published my post some Safenet beta tester [wrote this](https://forum.safenetwork.io/t/community1-test-network-is-alive-join-us/9337):\n\n> I have started a new community network, called \"community1\", using the named-network and \"first\" features of the most recent versions of safe_vault that Maidsafe have provided for this purpose. It is for ongoing testing and experimentation until the next official test, and not a rogue network of any sort. It is not my network, I merely put up a config file (see below), and configured my cloud server, to get it started. At present there are anywhere from 12-20 vaults active on it.\n\nSo some dude started his own instance of Safenet and he did that because MaidSafe took the \"official\" testnet down (which they did because they collected enough data for this Beta release). \n\nEvery MAID \"investor\" should ask themselves: if anyone can start a free, coinless Safenet that's open to public, why would those who want to use the network want to buy Safecoin in order to be able to participate in the official Safenet?\n\nBetter security, faster? Maybe. But not cheaper. If you want to host your content on the network and a free instance works more or less the same, you're likely to at least try one of free community-run instances. \n\nI would also argue that security won't be a big deal for free users. It's a free instance so there's no money/coin to be lost and if one can verify integrity (hash or signature) of files there's little extra in terms of security that a non-paying user may desire. \n\nThis is but one example that shows why Safecoin (not necessarily Safenet) is doomed. Once you realize it's easy to set up your own SAFE network and the coin isn't necessary, it's easy to realize that several other Safenet use cases won't work as well. \n\nAnd that's if they manage to finish the software before they run out of funds."
		},
		{
			"post_id": 8,
			"title": "Crypto Bubble of 2016",
			"date_published": 1463831779.988,
			"body": "In recent days number of bloggers wrote critically about the ongoing crypto-crowdsourcing craze.\n\nIsn't it great that ZeroNet doesn't have its own coin or - god forbid - DAO?\nWhile that makes development move at a slower pace, it also makes it much better because I would argue that many crypto projects are worse off because they've raised funds or released their coin.\n\nFirst, most of them (including the totally ludicrous Slock) are very unlikely to be profitable and therefore more likely to fail. An unprofitable community project simply can't die, but a for-profit community project can. \n\nNext, on top of that money-losing proposal, such projects attract all sorts of fools and scammers and from that point on the project members who would otherwise do something useful (such as code or write documentation) have to spend their (actually now the investors', because they're paying for it) time and money on activities such as \"investor relations\" and so on. Even \"community management\" becomes a taxing, mission-critical job because the fools and scammers constantly bitch and moan which impacts the coin price and so it has to be professionally managed.\n\nThat would be great if the project was non-profit, or if there was a reasonable plan to make profit. Unfortunately, there are barely any. For example, [Slock FAQs](https://slock.it/faq.md#a3) say this: \n\n> A DAO is a new type of organization that lives on the blockchain, best comparable to a digital company, but without an attached legal entity. \n\nMy translation: if anything goes wrong, as an investor, you're screwed. Uber *is* a legal entity (at least in the US and some other jurisdictions) and *still can't do business in the US* (for example in Austin). Slock wants to be *illegal* Uber and people buy that? Oh - sorry - Slock themselves are legal - they only want *you* to invest *your money* in illegal (or at least unlicensed) DAO business and make some profit while helping you with that. From the same page with FAQs:\n\n> Slock.it UG is a Blockchain + IoT solutions company. However Slock.it UG (future GmbH) is not a DAO itself  —  **we are a for-profit company registered in Germany**. \n\nIs anyone *that* stupid? If I wanted to run or invest in unlicensed or illegal business, why would I need Slock and the publicity in the first place?\n\nThen there's another thing: there is no good way to crowdsource funds for development when one builds free (and open source) software. There are all sorts of reasons why crypto-crowdsourcing can work. Generally speaking it can, but it's much less likely to work with free and open source software. \n\nFor Slock (and \"The DAO\") to be accepted by users, there has to be no lock in and the software has to be open source. If it's open source, it will be copied according to the license (and otherwise). There is _no_ secret sauce here. This isn't software for self-driving trucks that you can't recompile to work with your scooter. \n\nAlso there's nothing in those DAO's (contracts) that can't run anywhere else (including on plain old Web sites). Imagine you rented property. Would you use only a Slock DAO or every means possible? Of course you'll use whatever works and we know that because that's what most property owners do! They advertise on all platforms and use the most cost-effective one. \n\nThe idea that users will pay a Slock DAO extra for (illegal, remember?) services that are available cheaper (open source software, remember?) or legally (DAO's aren't exactly legal, remember?) is completely insane! \n\n## Going Down\n\nThis DAO bubble will surely burst. Too bad, it may take a while.  Slock isn't the only mega sized crowdsourced project that is very likely to fail. Slock will only take longer to go bust because now they have a lot of money to burn, so I say let's watch MaidSAFE instead. \n\nMaidSAFE is another multi-million ($) crypto-project which is going nowhere (in terms of rewarding its investors in sustainable way) fast and it won't fail because the software is nowhere near complete, but because the whole idea is *completely unworkable* and they're going to run out of money. \n\nLast year they had enough funds to survive well into the second half of this year and at the same time they were working on applications for government handouts (their Plan B, I guess, because nothing else about MaidSAFE is fixable). \n\nTheir software isn't ready, but even if it were, I can't see why any private company would be interested in it. On the other hand, if they get government (or EU) funding I doubt they'll be able to distribute unused monies to \"investors\" in the form of dividends. Which means there's no way out for the investors. MaidSafe Inc. may get rescued with good old taxpayer money, but MAID investors won't. \n\nThe only way MAID \"investors\" can make money is from MAID (later Safecoin) appreciation and that window is closing. Paradoxically, the constant delays in MaidSAFE development that resemble Obamacare are the only reason why the project hasn't yet collapsed. \n\nIf (or when) they release anything that kind of works that will be the last call to get the hell out of MAID before the poor economics (and probably technology) and unworkable nature of of the project become obvious to all. \n\nI believe that time is now: their alpha-quality software barely works. It's complete enough to look very promising and it's *in*complete enough to hide the obvious from those who don't know how unworkable is the economics of MaidSAFE. \n\nStay away from Slock and similar projects. Sell your MAID if you have any. Donate some change to ZeroNet and similar free projects that accept donations.\n"
		},
		{
			"post_id": 7,
			"title": "ZeroNet at Decentralized Web Summit",
			"date_published": 1463584890.209,
			"body": "We just [learned](http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:84:ZeroNet+talk+@+Decentralized+Web+Summit) that ZeroNet will present at DWS (http://www.decentralizedweb.net/).\n\nIf you look at the DWS link above you'll see that MaidSafe will present as well. Although these two projects aren't direct competitors, some overlap does exist and it will be interesting to see which of these two projects will be better received. \n\nI believe ZeroNet will do better because it is simpler. I plan to write another post about ZeroNet and MaidSafe, but for now I'll just say the main advantage of ZeroNet is its simplicity."
		},
		{
			"post_id": 6,
			"title": "sitePublish --tor always?",
			"date_published": 1463356037.144,
			"body": "\nObviously there's no `zeronet.py sitePublish <SITE> --tor always`, so what happens is this:\n\n```\n- Starting ZeroNet...\n- OpenSSL loaded, version: 01000208F\n- Loading site...\n- Creating FileServer....\nFileServer Checking port 15441 using portchecker.co...\nFileServer [OK :)] Port open: Port 15441 is open.\n- Gathering peers from tracker\nSite:1......z Publishing content.json to 4/2 peers (connected: 0) diffs: [] (0.00k)...\n```\n\nIn other words, although normally you may run your ZeroNet instance with `--tor always`, if your have a ZeroNet site and *your ZeroNet system is indirectly exposed to the Internet* you may want to take another look at this command. \n\nI haven't done additional checking, but it seems clear that trackers are contacted over clearnet and Tor isn't employed. \n\nIf I'm right, this is another reason why `--tor always` isn't enough. Direct all your traffic through a Tor SOCKS proxy.\n\n**Edit**: it turns out `./zeronetpy --tor always sitePublish <SITE>` (different order of options) does work, but at the moment that is not documented in online help.\n\n```\n./zeronet.py --tor always sitePublish 1..............................Z\n- Starting ZeroNet...\n- OpenSSL loaded, version: 01000208F\n- Patching sockets to tor socks proxy: 127.0.0.1:9050\n- Loading site...\n- Creating FileServer....\nFileServer Checking port 15441 using portchecker.co...\n- Gathering peers from tracker\nSite:1..........Z Publishing content.json to X/Y peers (connected: 0) diffs: [] (0.00k)..\n```"
		},
		{
			"post_id": 5,
			"title": "Where are Extremist, Spam and Porn Sites on ZeroNet?",
			"date_published": 1463235760.553,
			"body": "I have to say I haven't seen any yet. There's a weird comment here and there, but the extremists and spammers have basically stayed away so far. Why is that?\n\nFirst, ZeroNet is still too small. Although the cost of creating and seeding a ZeroNet site is next to nothing, even if all ZeroNet users visited the site, it'd probably be impossible to profit from that. Even compared to Tor, ZeroNet user base is small (say, 500-1,000 users).\n\nSecond, ZeroNet can't handle large files. So no video and high resolution photos. Not yet anyway.\n\nThird, although ZeroNet is fairly private, it's less private than Tor. So while it may be easier to set up a ZeroNet site, it is less safe and private to post *and visit* sensitive content using ZeroNet than Tor.\n\nFour, compared to Tor it's harder to mix clearnet content in ZeroNet sites.\n\nThere may be other reasons, but I think these are among the important ones.\n\n##Near-Term Future\n\nOne big advantage of ZeroNet is the ease of use. As the developers make ZeroNet more private, secure, powerful and attract more users, I'm sure we'll gradually start noticing the so-called illegal content. \n\nBy then we'll probably have first designs for ZeroNet reputation systems and be able to whitelist or blacklist (or both) users and sites that espouse values not compatible with ours (by this I mean each individual user's). \n\n##Conclusion\n\nThe imperfect security and privacy of ZeroNet are currently a feature. Partially thanks to this feature darknet-style content hasn't yet taken off here.\n\nI've no doubt that the voluntary nature of ZeroNet will work well for us when spammers and extremists discover a larger and better ZeroNet few months from now. "
		},
		{
			"post_id": 4,
			"title": "Make your Bitcoin Core and Namecoin use Tor",
			"date_published": 1462637459.161,
			"body": "In previous posts I suggested that ZeroNet should be accessed using Tor Browser. If you run Tor as service (separate from Tor Browser) and happen to run Bitcoin or Namecoin (which you may need from time to time because `.bit` domains must be registered on the Namecoin blockchain), there's no reason to let those daemons use clearnet.\n\nAssuming your Tor instance is at 192.168.0.2 and your Bitcoin or Namecoin instance is on another host on this network, you have to tell Tor to listen on its internal LAN so that other services can use its SOCKS proxy.\n\nAdd this to your Tor configuration file and restart Tor service:\n```\nSocksBindAddress 192.168.0.2\nSocksPolicy accept 192.168.0.0/24\nSocksPolicy reject *\n```\n\nIf this system has firewall that's enabled you need to let your Namecoin or Bitcoin server get in. Assuming your Bitcoin Server is at 192.168.0.3 and your Tor server as above (192.168.0.2), on Ubuntu you'd do something like this:\n\n`sudo ufw allow from 192.168.0.3 to 192.168.0.2 port 9050 proto tcp`\n\nDo this for every SOCKS client's IP that needs to use Tor's SOCKS proxy.  If you want to use Tor in a more advanced way see \"Automatically listen on Tor\" at the link below. In such case you'd have to run the ufw command above one more time for port 9051 (Tor control port).\n\n## References\n\n* [Tor instructions for Bitcoin Core](https://github.com/bitcoin/bitcoin/blob/master/doc/tor.md) (clearnet)\n\nNamecoin uses the same configuration options for Tor integration."
		},
		{
			"post_id": 3,
			"title": "Tor Browser Add-Ons for Better ZeroNet Experience",
			"date_published": 1462527616.5,
			"body": "In previous posts I wrote about using ZeroNet with Tor and about some underestimated risks for ZeroNet-Tor users (in short, `--tor always` is not enough if you don't use Tor Browser). \n\nWhat to do? Well, a lot could be done to get enterprise-grade security, but I'm no security expert so I'll mention just few basic tools to get you started.\n\n## Use Tor Browser\n\nAlthough Chrome is my preferred browser, there's no Chrome-based Tor Browser. Messing around with various Chrome settings is not a good idea because it can turn out to be not enough (see my earlier blog post) and besides it's best to separate your ZeroNet browsing from other browsing. And if you set insane security measures in your main Chrome browser, your non-ZeroNet browsing experience will suck.\n\nTor Browser has some advantages over Firefox, so even if you like Firefox it's best to stick with Tor Browser for ZeroNet surfing as all non-ZeroNet traffic is forced to go through Tor to clearnet.\n\nIn [this post](http://127.0.0.1:43110/12Q63F1Nh2hVoYkBEfvKcoTWihsrUvvuLu/?Post:2:ZeroNet+Anonymity+and+Privacy+Tips) based on a recent real-life example from ZeroNet I mentioned how it's not enough to rely on ZeroNet alone to prevent your IP from leaking to clearnet, so if you're not using Tor Browser don't forget to configure a (Tor) SOCKS proxy for all traffic except to `http://127.0.0.1` and maybe few other trusted IP addresses or hostnames.\n\nWhether you're using Tor Browser or Firefox, you probably want to use some privacy and security-related add-ons. I recommend these two.\n\n## Add-On #1: NoScript Security Suite\n\nAs the name says, this add-on globally disallows scripts and optionally similar shenanigans (Flash and so on). You can temporarily or permanently whitelist selected sites. The first ones you want to whitelist are `127.0.0.1:43110` (assuming you use the default port) and `127.0.0.1`.\n\nFeel free to go to NoScript Options and enable or disable some options. For example, in the XSS tab you can whitelist or blacklist some sites from cross-site scripting protection. By default Google, Yahoo, Wikipedia and Wikimedia are added. You may want to delete some or all of those.\n\nIn another place (Embeddings) you can also forbid the loading of fonts (Forbid @font-face) as well as prevent Java, Flash, and Silverlight from running. (If you forbid @font-face, you'll get the default fonts and sites will look less appealing; to partially work around that, go to Tor Browser Settings and under Content, pick a default font you like. Stuff that should be using specific font still won't display properly, but there's no way around that.)\n\nGet the add-on here: https://addons.mozilla.org/en-US/firefox/addon/noscript/?src=search\n\n## Add-On #2: Whitelist Ninja\n\nThis add-on annoys you into specifically whitelisting every single site you visit. With it, you cannot visit a site you haven't approved. It's annoying, but it works well: if you say \"when I use ZeroNet, I'll enable Whitelist Ninja to block myself from visiting any unapproved non-ZeroNet sites\" and do it, that's what will happen.\n\nGet it here: https://addons.mozilla.org/en-US/firefox/addon/white-list-ninja/\n\n "
		},
		{
			"post_id": 2,
			"title": "ZeroNet Anonymity and Privacy Tips",
			"date_published": 1462452607.279,
			"body": "Very quickly, here are some tips for better anonymity and privacy on ZeroNet.\n\n## Tor\n\nThis is the first task one should accomplish **before** accessing the network - configure Tor and don't go on ZeroNet without it. If you want better anonimity and privacy, that is.\n\nZoroNet with Tor is quite well documented and you should be okay after reading the official Tor-related FAQs (one for Windows, another for Linux). Additionally, you can check Tor-related tips I put together in this post here.\n\nIf you just started to use ZeroNet and aren't using Tor, stop right now and:\n\n* Save content of Web pages you'll need to configure ZeroNet with Tor\n* Stop ZeroNet and delete it (backup any valuable data, but if you just started using ZeroNet you shouldn't have any valuable data)\n* Configure Tor, make sure it works well on its own, then install and start a clean ZeroNet instance with `--tor always` (and always start it this way). Then come back here if you want. Preferably using Tor Browser.\n\nWhen Tor is not enabled, or when it's used alongside (together) clearnet, your IP, identity and security can be exposed.\n\n### Vulnerability: Escaped Frame\n\nSite http://127.0.0.1:43110/181aQJMXV5fTSMFVVWoLwmVSLSb6UZSp1J/ demonstrates how even when `--tor always` is enabled, visitor's real IP can be determined. \n\n```\n<script>\n// If we are inside iframe escape from it\nif (window.self !== window.top) window.open(window.location.toString(), \"_top\");\nif (window.self !== window.top) window.stop();\nif (window.self !== window.top && document.execCommand) document.execCommand(\"Stop\", false)\n\n// Dont allow site to load in a popup\n/*\nif (window.opener) document.write(\"Opener not allowed\")\nif (window.opener && document.execCommand) document.execCommand(\"Stop\", false)\nif (window.opener && window.stop) window.stop()\n*/\n</script>\n```\n\nA workaround for this risk is to set your browser to use your Tor SOCKS5 proxy for everything. Example for Firefox (not Tor Browser):\n\n* Options > Advanced > Settings > Manual Proxy Configuration > HTTP Proxy `127.0.0.1` and Port `9050`\n* Check \"Use this proxy server for all protocols\"\n* In \"No Proxy for:\" enter `127.0.0.1:43110` (your ZeroNet IP address and port) and possibly other LAN and Web IP's that you want to access directly (e.g. 192.168.0.*, *.google.com, *.gmail.com, etc.)\n\n### Additional Browser Precautions\n\nAs we can see from the example above, one can't assume that ZeroNet can disallow tricks such as the one above. \n\nA good practice, therefore, is to use a dedicated browser profile, or even a dedicated browser instance, for ZeroNet access. In that profile (instance), make all traffic except 127.0.0.1:43110 and other LAN traffic, go through Tor SOCKS proxy. \n\nYou can also use your Tor Browser for that. I prefer to not use Tor Browser, so I use the above approach (separate Firefox profile with a Tor SOCKS proxy for everything except the ZeroNet IP).\n\n## User ID Schemas\n\nYou have these three options:\n\n* None - the best option, but doesn't allow you to participate in sites which require authentication for commenting (many do require it)\n* ZeroID (zeroid.bit) - official, \"native\" and default choice for ZeroNet (accepted by most sites that require authentication)\n* ZeroVerse ID - better identity configuration (recommended, but not all sites accept this scheme)\n\nYou can read more about differences between the two ID schemes on ZeroVerse pages.\n\nLinks:\n\n* [ZeroID](http://127.0.0.1:43110/zeroid.bit/)\n* [ZeroVerseID](http://127.0.0.1:43110/zeroverse.bit/)\n\n## .bit Domains\n\nThis is similar to User IDs. The best is not to have one. But of course most of us want one and let's be honest - site.bit is easier to remember and spot than a bitcoin address.\n\nSo the question becomes how to protect your privacy as a Namecoin user. I won't go into this (and I'm trying to keep this short), but you can refer to clearnet guides on anonimity and privacy for Bitcoin (I doubt there are many or any privacy guides for Namecoin). Some items of interest:\n\n* Where you acquire NMC and BTC required to buy that NMC\n* Where (Web site or IP) you register your domain name\n* Whether you ever published your `.bit` site without Tor\n\nNamechain-related instructions can be found in The Official ZeroNet FAQs.\n\n\n## Mail & Messaging\n\nYou probably don't want to disclose your clearnet email or other identity. If you need to PM in private, use BitMessage or Mail on [ZeroNetwork.bit](http://127.0.0.1:43110/Mail.ZeroNetwork.bit/). Of course Tor should be used at all times.\n\n### Updates and Revisions\n\nv0.1 - 2016-05-06 - initial release\n"
		},
		{
			"post_id": 1,
			"title": "Tips for ZeroNet and Tor",
			"date_published": 1433033779.604,
			"body": "It appears on Windows it is not hard to use ZeroNet with Tor. On Linux, it can be.\n\nBecause everyone's system is different - and even if everyone had the same system, their requirements would probably slightly differ - I'm not going to make this into a how-to that rehashes the official Tor and ZeroNet docs and how-to's. Instead I'll just write down some tips from a wasted Sunday afternoon.\n\nHere we go:\n\n## ZeroNet Tips for Tor\n\n* It is best to use a distro-supplied Tor package (this advice you'll get on the Tor Project Web site as well), just make sure you use a newer distro (Ubuntu 15.04 or newer, for example), so that you don't end up with a Tor package that's too old and not supported - you want 0.2.7.5 or newer because of the `ADD_ONION` feature that was added in that version).\n\n* Use `tor --verify-config` if you dick around with Tor configuration options and you've no clue what you're doing. That can help you find permissions-related issues (which you may very well run into if you use `CookieAuthFile`). If you use `CookieAuthFile /path/to/file`, first try the default (see Tor docs), but if you're having problems with permissions (I did) you can create a new subdirectory for this file in your (you = user who runs zeronet.py) home directory and give it proper permissions (e.g. 770 and own it by the group (Debian/Ubuntu default: `debian-tor`) and restart Tor to see whether you can now list the cookie file.\n\n* As you fiddle around with group memberships (which you likely will - see the Official FAQs), you need to **log out and log in again** for new group membership to take effect. The other day I (again) wasted 45 mins on this crap. (I ran into the same problem last year, but I had forgotten about the problem and solution).\n\n* Pay attention to port numbers. In some docs you may see `ControlPort 9151` and such. That's also fine, but use the same port everywhere.\n\n* Run `python2 zeronet.py --help` (or `./zeronet.py --help`; from within the directory where this file lives) to see your options for logging and shit, because you'll need them. For Tor-related stuff there's `--tor enable|disable|always`. `--tor enable` is easier to test with (as clearnet will work even if Tor doesn't), but `--tor always` is the real test as ZeroNet doesn't use clearnet in that case (so even if port TCP/15441 or other is already open, it won't be accessible to ZeroNet). There's another way to connect (see the Official FAQs), but I haven't tried it.\n\n* Read The Fucking [Manual](https://www.torproject.org/docs/tor-manual.html.en). Also the [Official ZeroNet FAQs](https://zeronet.readthedocs.io/en/latest/faq/#how-to-use-zeronet-with-tor).\n\n* Tor is quite flakey and there may be bugs. I certainly saw one or two (with 0.2.8.2-alpha). It's better to use a stable version from your distro and verify it works (see below) before you come to Github and scream \"ZeroNet doesn't work!!!\". If Tor doesn't work, ZeroNet with Tor won't work either, so solve your Tor issues first.\n\n### Successful Test from CLI when Tor is Running\n\nYou should run this as the user who runs `zeronet.py`. Hopefully you executed `tor --verify-config` before you started Tor.\n\n```\n$ echo 'PROTOCOLINFO' | nc 127.0.0.1 9051\n250-PROTOCOLINFO 1\n250-AUTH METHODS=COOKIE,SAFECOOKIE,HASHEDPASSWORD COOKIEFILE=\"/home/user/tor-cookie/file\"\n250-VERSION Tor=\"0.2.8.2-alpha\"\n250 OK\n```\n### Tor Control and SOCKS Ports\n\nThis is my Tor log. Notice how SOCKS5 listener is running on 9050. I have `SOCKSPort 9050` and `ControlPort 9051` in my `torrc`. ZeroNet should use the same ports.\n\n```\nMay 03 13:12:55.142 [notice] Tor v0.2.7.6 (git-605ae665009853bd) running on Linux with Libevent 2.0.21-stable, OpenSSL 1.0.2g and Zlib 1.2.8.\nMay 03 13:12:55.142 [notice] Tor can't help you if you use it wrong! Learn how to be safe at https://www.torproject.org/download/download#warning\nMay 03 13:12:55.142 [notice] Read configuration file \"/etc/tor/torrc\".\nMay 03 13:12:55.163 [notice] Opening Socks listener on 127.0.0.1:9050\nMay 03 13:12:55.164 [notice] Opening Control listener on 127.0.0.1:9051\n```\n\n### Tor Browser or Regular Browser?\n\nYou should not assume `--tor always` protects your IP address. It is probably best to use Tor Browser and set it to use Tor SOCKS proxy for everything except ZeroNet (127.0.0.1:43110).\n\n[More here](http://127.0.0.1:43110/12Q63F1Nh2hVoYkBEfvKcoTWihsrUvvuLu/?Post:2:ZeroNet+Anonymity+and+Privacy+Tips).\n\n### ZeroNet Options / Online Help (v0.3.7 r1278)\n\nThe current ZeroNet options can be obtained like this:\n\n```\n$ python2 ./zeronet.py --help\n```\n\n#### Changelog\n\n* 0.2 (2016-05-05) - Added note on browser security \n* 0.1 (2016-05-03) - initial release"
		}
	]
}