{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "DHT порт",
			"body": "Как всегда, когда речь идет о скрытосетях и иже с ними, никто не удосуживается толком описать их работу с портами. Приходится выяснять с помощью Wireshark и методом научного тыка. Так в случае Zeronet было установлено, что порта 15441 ему, мягко говоря, недостаточно. Еще должен быть открыт верхний диапазон TCP портов для исходящих соединений, иначе вообще ничего не работает. Однако возник  вопрос: какой в Zeronet используется DHT порт? И как он может использоваться при работе с Tor, где UDP вообще не поддерживается?",
			"added": 1487507218
		},
		{
			"topic_id": 2,
			"title": "Погоду делают зомбированные?",
			"body": "Я сам не из России, но хотел со временем туда перебраться. Но вызывают тревогу вот такие вот статьи: https://meduza.io/news/2017/05/06/gendirektora-krasnoyarskogo-telekanala-vyzvali-v-sk-iz-za-reposta-zapisi-artemiya-lebedeva-pyatiletney-davnosti . Вопрос к россиянам: у вас там сейчас действительно столь откровенное религиозное мракобесие царит, или это в основном газетные утки?",
			"added": 1494091497
		}
	],
	"topic_vote": {},
	"next_comment_id": 30,
	"comment": {
		"1_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu": [
			{
				"comment_id": 1,
				"body": "> [vlad20012](#comment_254_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): DHT в ZN нет вообще - используются только трекеры\nПросто иногда можно прочитать, что свежесозданные сайты анонсируются через DHT сеть. Получается врут? Или информация устарела? Или я просто чего-то не понимаю?",
				"added": 1487508788
			},
			{
				"comment_id": 5,
				"body": "> [vlad20012](#comment_256_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Порывшись по исходникам ничего о DHT не нашел. \nПонял, спасибо!",
				"added": 1487516828
			},
			{
				"comment_id": 13,
				"body": "> [avoiddowntime](#comment_17_1M3Cd4ukoi5yU564r4azCetBEGscFnRRtE): При полном заворачивании в Тор поднимается скрытая нода, а где посмотреть ее адрес? Что-то не найду никак о_О\nТо есть, Tor начинает работать как сервер (по умолчанию работает как клиент для сети)?",
				"added": 1487527494
			},
			{
				"comment_id": 14,
				"body": "> [vlad20012](#comment_265_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Tor всегда работает как hidden service, через exit-ноды тут не проксируется\nПо умолчанию, Tor работает только как клиент, то есть не выполняет никаких серверных функций. Если \"поднимается скрытая нода\", то вероятно Tor переходит в режим сервера. Что может представлять собой уязвимость. Отсюда и вопрос.",
				"added": 1487530695
			},
			{
				"comment_id": 15,
				"body": "> [vlad20012](#comment_266_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF):  Но я хз как оно там настраивается, наверняка разрешается только 1 порт или типа того\nВот поэтому я и боюсь подключать Zeronet через Tor, так как в отличии от того же браузера, требующего только Socks прокси, Zeronet требует доступ к управляющему порту Tor и без этого доступа через Tor работать не хочет. Что само по себе уже небезопасно, так как если кто-то взломает клиент Zeronet, то он с большой долей вероятности может получить доступ к управляющему порту Tor и наделать серьезных проблем. А еще, до кучи, непонятно какие вообще настройки Zeronet делает для Tor.\nА прочитавши в официальном мануале еще и вот это:\n\n>usermod -a -G debian-tor [yourlinuxuser]\n\nПонимаешь, что \"косячат\" они серьезно, так как эта команда заменяет все текущие вторичные группы. Наверняка уже нашлись \"благодарные\" пользователи, у которых невесть с чего в Linux перестало что-то работать. :)",
				"added": 1487531663
			},
			{
				"comment_id": 16,
				"body": "> [balancer73](#comment_78_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): А в инструкции сказано:\nСпасибо! Я о таком способе не знал.",
				"added": 1487532669
			},
			{
				"comment_id": 17,
				"body": "Настроил Zeronet с Tor, в соотвествии с постом ниже, это проверочное сообщение. Нужда в нем возникла потому, что я пытался что-то написать на http://127.0.0.1:43110/Board.ZeroNetwork.bit/ . И не смог! :)  Думал что-то с Tor неправильно. Оказалось, что для того, чтобы там что-то написать, для того ресурса надо обычный 443 порт разрешить. Шутники. :)",
				"added": 1487540097
			},
			{
				"comment_id": 19,
				"body": "> [avoiddowntime](#comment_18_1M3Cd4ukoi5yU564r4azCetBEGscFnRRtE): Так где увидеть адрес ноды? И является ли она выходной?\n\nВозможно в /var/log/tor/notices.log какая-то информация окажется.",
				"added": 1487592494
			}
		],
		"1_1CDkheadGbhxVvNCHn2nvH7GBDnwm5V8oi": [
			{
				"comment_id": 2,
				"body": "Аффтар ты думаешь, что с Путиным борешься? Ты просто гадишь сети, в которой пишешь, обращая на нее внимание разнообразных спецслужб. Ты часом не из казаков?",
				"added": 1487512996
			},
			{
				"comment_id": 3,
				"body": "> [avoiddowntime](#comment_14_1M3Cd4ukoi5yU564r4azCetBEGscFnRRtE): Товарищ, брат-в-zero, коллега... Верь, спецслужбы обратят или не обратят свое внимание на ZN вне зависимости от того что и кто тут напишет, абсолютно.\nДовольно наивно ожидать, что на каждом форуме будет сидеть специальный проверяющий. :) А вот поисковые роботы или уже здесь есть, или скоро появятся. И чем больше такие поисковые роботы будут находить заданных ключевых слов, тем больше будет внимание к самой сети. По моему, это очевидно. Я все это к тому, что спецслужбы несомненно обратят внимание на эту сеть, но благодаря подобным бессмысленным темам просто сделают это быстрее.",
				"added": 1487514165
			},
			{
				"comment_id": 4,
				"body": "> [avoiddowntime](#comment_16_1M3Cd4ukoi5yU564r4azCetBEGscFnRRtE): Ну правда :)\nКакой-же нормальный человек станет уделять избыток внимания вещам, которые такого внимания не требуют и не входят в круг его интересов? \nИм что там, своей работы мало, чтобы заниматься той, для которой нет мотивов? :)",
				"added": 1487514737
			}
		],
		"1_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F": [
			{
				"comment_id": 6,
				"body": "Это результат воздействия конкурентной экономики. Конкурентная экономика побеждает не за счет лучшего качества товаров (как когда то о ней говорилось), а за счет маркетинга. Иными словами тот, кто эффективнее обманет потребителя, тот и побеждает. И отсюда следует несколько грубоватый, но отражающий реальное положение дел, ответ на твой вопрос: какие нахрен беседы, когда тебя на каждом шагу наебать норовят. Говорить сейчас можно только в интернете, и желательно настолько анонимно, насколько до информации о тебе не могут дотянуться маркетологи. А в реальном мире - нет доверия, соответственно нет и бесед не по делу. Это мир торгашей...",
				"added": 1487517688
			},
			{
				"comment_id": 7,
				"body": "> [vlad20012](#comment_257_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Но это возведение в абсолют какое-то. Я например, ничего не продаю. И никого небать не пытаюсь. И что-то у меня есть смутное подозрение, что я не один такой.\nДа эта сама система такая, в ней категории доверия не заложено изначально. Не веришь, почитай любую, или почти любую рекламу. :) И сколько там правды на самом деле окажется? :)",
				"added": 1487519386
			},
			{
				"comment_id": 8,
				"body": "> [vlad20012](#comment_258_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): А зачем читать рекламу? кто ее читает вообще?\nЗаметь, что ты даже не возмутился наличием в рекламе обмана. А отреагировав, предложив способ борьбы с этим обманом. :) Разумеется я не читаю рекламу специально, и разновсячески ее блокирую. Но общество, от которого ждут социальности, вообще не должно заниматься борьбой с обманом. Это дело государств, которые сейчас наоборот обман поощряют. :)",
				"added": 1487520081
			},
			{
				"comment_id": 9,
				"body": "> [vlad20012](#comment_259_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Цензуру предлагаешь?\nВообще-то я говорил о борьбе с ложью.\n> Ну и все-таки я не могу понять связь между ложью в рекламе и обозначенной выше проблемой.\nЛожь в рекламе - это был самый простой и ближайший пример. \nЕсли один человек не доверяет другому, то он будет стараться говорить как можно меньше, чтобы не показывать оппоненту собственные уязвимости. Тут связь самая что ни на есть прямая - нет доверия, есть только самый необходимый уровень взаимодействия.",
				"added": 1487520736
			},
			{
				"comment_id": 10,
				"body": "> [vlad20012](#comment_261_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Твоя мысль в том, что конкуренция окружает нас повсюду, поэтому каждый человек воспринимается как конкурент? \nЗа исключением нескольких человек, которых знаешь по много лет, которых можно назвать друзьями, и которым можно доверять (хотя бы до некоторой степени). Но таких всегда немного. В остальном именно так.",
				"added": 1487521933
			},
			{
				"comment_id": 11,
				"body": "> [vlad20012](#comment_262_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Но я тут наверное должен был оговориться, что я как раз из тех, к кому бесполезно подходить на улице.\nАналогично. Потому что \"привет, как дела\" от незнакомого человека выглядят фальшиво. Какое ему дело до того, какие у меня дела? :) Подобный подход - это попытка получить больше доверия, чем этот человек на данный момент заслуживает. То есть, попытка обмана. :) Отсюда и стремление проявить грубость.  \nНо если к тебе подойдет человек и спросит показать дорогу, ты наверняка ответишь вежливо, потому что человек не стремится втесаться в доверие, а подошел по делу.",
				"added": 1487524487
			},
			{
				"comment_id": 12,
				"body": "> [vlad20012](#comment_263_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Ну так да. Если кто по делу обращается, то другое дело. Но что это объясняет?\nТолько то, что ты тоже не стремишься к излишнему доверию, хотя и хочешь видеть мир другим. Я же говорю, сама система такая.",
				"added": 1487525454
			},
			{
				"comment_id": 18,
				"body": "> [mist](#comment_15_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA): Конкуренция всегда присутствует. Разница лишь в том, открытая ли это конкуренция, или же она имитируеть нечто иное.\nКонкуренция присутствует всегда, но разница в том, насколько естественная конкуренция стимулируется со стороны. И какие формы эта конкуренция принимает (что не является имитацией).\n\n> Возможно потому, что обман есть понятная человеку форма взаимодействия. Люди этого ждут. Если совсем нет никакого обмана, то это воспринимается как что-то непонятное, и этого избегают. Потому часто даже приходится обманывать. Как бы парадоксально это не звучало.\nА вот это слова человека, воспитанного современной извращенной системой. Обман - это обман. Его ждут люди, которые уже сталкивались с обманом. Кроме того, атмосфера всеобщего обмана порождает недостаток доверия и как результат - недостаток творчества, то есть дорогу к регрессу. А недостаток творчества уже заметили даже в российском правительстве.\n\n> Извини, но в любом случае, каждое твое слово несет слишком много информации конкурентам. Так что, на твоем месте стоило бы вообще исключить какое-либо общение.\nБеседа приняла несколько иной оборот. В первом посте я писал о том, что стимулирует избыточную конкуренцию, то есть о конкурентной экономике и ее отвратительных порождениях, вроде маркетинга. Так вот от маркетологов я стараюсь защищаться с максимальной эффективностью. То есть, связать ник \"gnome\" с настоящим человеком они никак не смогут, в этом я уверен. Если кому-то потребуется создать психопрофиль на основании нескольких моих постов, то он теоретически сможет его сделать для ника \"gnome\". А ник несложно и поменять, в случае чего.\n\n> Единственный действенный способ борьбы с ложью — это научиться видеть. Видеть, воспринимать, понимать, учиться и рассуждать. Если у человека с этим проблемы, то ничто его от лжи не защитит.\nВообще-то единственный способ борьбы с ложью - это иметь информацию о конкретном предмете. А так как знать обо всем невозможно в принципе, то любой человек всегда будет уязвим. Поэтому с ложью должно бороться государство.\n\n> И последнее. В каждом твоем посте есть ложь. И я уверен, что ты это понимаешь.\nЯ понимаю. А ты запутался. Неточное выражение своих мыслей (когда оно присутствует) - это не ложь, здесь нет намерения солгать. Вот если бы оно было, тогда можно было бы говорить о лжи.",
				"added": 1487589690
			},
			{
				"comment_id": 20,
				"body": "> [hau](#comment_2_1NdDkmpoMKxhczSpHKhArZDMqZfNDhNZSf): Министерство Правды?\nСоответствующие статьи в уголовном кодексе, как это было при союзе. Мошенники были и тогда, но тогда они хоть берега знали. Иными словами, наебал - изволь получить не только прибыль, но и реальный уголовный срок. Или только последнее. :) А сейчас они получают, увы, только первое, причем совершенно легально.",
				"added": 1487595121
			},
			{
				"comment_id": 21,
				"body": "> [hau](#comment_3_1NdDkmpoMKxhczSpHKhArZDMqZfNDhNZSf): Раньше было лучше?\nЭто ты пытаешься так сместить тему разговора в сторону либеральной пропаганды? :) Она мне неинтересна.",
				"added": 1487683387
			}
		],
		"1_1DXxyNnRKTvzUcuvQhTu8uWSXSNYL4oVc6": [
			{
				"comment_id": 22,
				"body": "> [mist](#comment_13_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA): Сам интернет появился по ошибке. \nОткуда столь дивная информация? Интернет - сеть сетей - результат развития Arpanet. Чем больше сетей он включает, тем более он надежен, то есть выполняется первая задача, которую ставили американские военные - в случае ядерной войны связь остается надежной, или по крайней мере сохраняется. Кроме того, в любом случае он обеспечивает очень быструю доставку информации почти из любой точки мира. Где же здесь ошибка? Что американские военные хотели, то они и добились.",
				"added": 1487693185
			}
		],
		"3_1DXxyNnRKTvzUcuvQhTu8uWSXSNYL4oVc6": [
			{
				"comment_id": 23,
				"body": "> [downfal8](#comment_1_15uiW79ekBQb1p8vKhfKWZscZxQbVJ4Fqe): Ялта приветствует вас , чем вам Путин не нравится? не было митингов у нас и не будет, митинги для долбоёбов причем все, кроме 9 мая.\nВы бы головой иногда думали. В 90-х был бандитизм? Был. Олигархи могли разбогатеть в 90-е без связи с криминалом? Очевидно нет. Ельцин и его клика знались с олигархами или нет? И еще как. А теперь немножко вспоминаем, что Путин тогда не выживал, как основная часть людей на постсоветском пространстве, а был шефом одной из самых могущественных спецслужб мира. Мог ли Путин не знать об отношениях Ельцина и олигархов? Он не только не мог не знать, он не мог даже на задних ролях в этом быть. Уже просто в силу специфики своей работы.  А если до кучи вспомнить, что некогда он был советским офицером и вероятно давал присягу... про которую со временем вероятно забыл. Так за что он должен нравиться?",
				"added": 1492973475
			}
		],
		"2_15M1vyCVTK2Tcrs9jxTLZ9PLGWmmNr1vJx": [
			{
				"comment_id": 24,
				"body": "> [devl547](#comment_2_198HAqccKTyRjZpPxPRTum3MAuDAbLxm8C): Драйвера и поддержка железа\n> Потому что винду пилят в сторону относительной легковесности, а к десктопному пингвину прикручивают очередной красношляпый энтерпрайзный зонд.\n\nВы это серьезно? Windows никогда и ни под каким предлогом не \"пилили\" в сторону легковесности. Как раз наоборот, с каждым крупным обновлением Windows намеренно \"утяжелялась\", чтобы пользователи бежали в магазин за новым \"железом\".  Это даже не говоря уже о выходе новых версий Windows. Вы в этом легко можете убедиться, даже просто почитав о системных требованиях к каждому новому SP.",
				"added": 1493424621
			}
		],
		"2_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu": [
			{
				"comment_id": 25,
				"body": "> [balancer73](#comment_98_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Это дебильные законы. Которые потом всякие больные люди заставляют срабатывать.\n\nДа даже по этой статье получается, что больных слишком много. Сексот, нажаловавшийся без особой на то причины. Но даже не это самое отвратительное. Стукачей во все времена хватало. Самое отвратительное в статье - это то, что следовательша берегов уже не знает. Она интересуется тем, как часто подозреваемый ходит в церковь. То есть, подразумевается, что он туда как бы должен ходить. То есть, либо ты религиозен, либо по отношению к тебе можно беспредел творить. Вот это тревожно.",
				"added": 1494096321
			},
			{
				"comment_id": 27,
				"body": "> nick003\n> мне даже в голову не пришло такую трактовку этой ситуации давать\nВообще-то подобная трактовка логически следует прямо из ситуации.  Инцидент возник не в церкви, а в социальной сети.  То есть, никакого отношения какие-то посещения церкви к ситуации попросту не имеют. ",
				"added": 1495713683
			}
		],
		"1_1AmvBauncC7rZyisrSf4a56tbJCNtdrxN5": [
			{
				"comment_id": 26,
				"body": "А оно кому-то надо - ваши файлы хранить?",
				"added": 1495200429
			}
		],
		"1_1HvraQzSVUU6TKffYzvCzEXYYjXPAZ3nkW": [
			{
				"comment_id": 28,
				"body": ">Допустим, Вы идёте домой, в любое время дня и ночи, Вам на встречу выходит мужчина, на голове кепка, спортивные штаны, кроссовки, спортивная куртка, всё это фирмы Adidas, в зубах сигарета, в руке бутылка пива, парень не брит, физической формой хорошей не обладает, ещё до разговора с ним Вы в своей голове сделали вывод, что он гопник?\n\nВообще-то, это не вывод, это стереотип человека, живущего в тепличных условиях. Если такой человек сумеет пересилить свой страх и поговорить с описанным вами типом, то вдруг окажется, что вышеописанный тип - это в большинстве случаев самый обычный мирный мужик, вышедший из дома за пивом. :)\nА гопники, кстати, ничем особенным от других людей не отличаются, за исключением количества (обычно их не меньше троих - они вовсе не гераклы и меньшим числом цепляться к людям банально боятся) и особенностей речи.",
				"added": 1495718954
			}
		],
		"4_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": [
			{
				"comment_id": 29,
				"body": "Справедливости ради, тут вообще кроме этого форума пока ничего нет. Конечно, можно зайти в ZeroName и удивиться изобилию. Но на самом деле, кроме пары блогов, на раз прочитать, среди этого \"изобилия\" ничего не найдешь. Тут делать особо нечего, поэтому только одни энтузиасты и сидят. Положительная сторона в том, что тут пока нет или мало маркетологов, которые буквально засрали верхний интернет.",
				"added": 1495805521
			}
		]
	},
	"comment_vote": {
		"6_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": 1
	}
}