{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1603526248_1AyJkc3Yv7gRoY2w1VR3Q7UgxFvwYhVLLh": 1,
		"1595165517_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1603526248_1AyJkc3Yv7gRoY2w1VR3Q7UgxFvwYhVLLh": [
			{
				"comment_id": 1,
				"body": "The lengths to which a tyrant will go in order to \"protect us\" has always been disturbing. Great article. Thanks for sharing that.",
				"added": 1603572885
			}
		],
		"1595165517_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 2,
				"body": "Being new to the platform, just a couple of days, I always find it interesting to read the perspectives of those who have been involved for a while. I would have to assume Zero appeals to those who are truly interested in decentralization, safety, and anonymity. Hopefully the trolls who are just here to cause trouble will lose interest and move on to greener pastures. For me, the whole thing is fascinating and I plan to create content as often as I can.",
				"added": 1603641599
			}
		],
		"1604792929_1ETarTu7fyokpgRoBMiGZc8L3FwnDTGstL": [
			{
				"comment_id": 3,
				"body": "Do a search and read up on the Cicada project, decentralized, distributed direct democracy. Experts have been working on this project for several years. Viability? Who knows? It could possibly work in small nations but I doubt it could be as effective in large countries like the US, RU, or India. It is still fascinating to read about their goal and progress. It involves every person being issued a blockchain human ID. With it, they can directly participate in the political process.",
				"added": 1604847494
			},
			{
				"comment_id": 4,
				"body": "> [a0066](#comment_3_1HQedZKCLnU1C5XjNAV1no34wSZWcAeWUU): Do a search and read up on the Cicada project, decentralized, distributed direct democracy. Experts have been working on this project for several years. Viability? Who knows? It could possibly work in small nations but I doubt it could be as effective in large countries like the US, RU, or India. It is still fascinating to read about their goal and progress. It involves every person being issued a blockchain human ID. With it, they can directly participate in the political process.\n\nSo, in many ways, a blockchain HumanID system satisfies some of the favorite issues of both sides of the political spectrum in the US, for example. Progressive democrats want a more pure democracy, majority rule sort of thing as opposed to a representative republic as they have now. Cicada, or something like it, would effectively eliminate the need for congressmen and senators. Each voter would be able to directly vote on issues placed before the people. \n\nFor republican conservatives, securing the vote, requiring identification in order to vote so they can prevent illegal voting by non-citizens, would be satisfied with such a system as well. Each person has a unique ID, they can vote on an issue, once that vote is cast, they can no longer vote on it. So vote integrity would be much greater than it is under the current system of paper ballots and humans tallying votes. \n\nEase of voting would also improve. You wouldn't have to go to your local polling station on election day and wait in line to cast your vote. You could be lounging on a beach with half-naked women wandering around, sipping a tropical adult beverage and still cast your vote through the DDD system.\n\nSo there are many positives that may come out of such research projects in the future but I have to assume it is a distant future. Technology use and trust has a long way to go before everyone will be on board. The infrastructure also has to be capable of supporting it. An entire nation voting at once would create a huge strain on whatever system was in use. There are also data privacy concerns. There would have to be a profile in a system assigning you to that ID and keeping everything straight. It would need massive infrastructure that simply doesn't exist currently. I would imagine it would get some trial runs in small areas. Perhaps a city or county. Then a region. Then a state, long before it was viable for a nation.",
				"added": 1604848253
			}
		]
	},
	"comment_vote": {
		"3_1EUxRrUu6DfuFtYfeuGJUc4GdTLGj4dunH": 1,
		"4_1N2VV3mbu9KLbSxTpedj9JvaQ51v9vNEN3": 1
	}
}