{
	"next_comment_id": 26,
	"user_name": "If0",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "Эх... Только успел о нем узнать, а он уже закрывается...",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1557842221",
			"date_added": 1557845248
		},
		{
			"comment_id": 2,
			"body": "Со своего домашнего компа у своего же провайдера. Очень смелый поступок.",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1557935041",
			"date_added": 1557940777
		},
		{
			"comment_id": 3,
			"body": "Особенно если сделать одновременно 20К запросов, которых обычно бывает пара десятков за день :)",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1557935041",
			"date_added": 1557945163
		},
		{
			"comment_id": 4,
			"body": "> Опоздавший-пятничный пост\nОчередной эпизод из серии: \"мыши продолжают грызть кактус\"... Чем крупнее контора, предоставляющая сервис, тем сильнее ей плевать на своих пользователей. Куда они денутся! Сделаем необходимость ходить задом наперед на руках для пользования аккаунтом и сервисами - все дружно встанут и пойдут. Да, многие будут роптать и высказывать недовольство, но никто даже не допустит мысли отказаться, потому что слишком многое \"внезапно\" оказывается завязанным на разные сервисы данной конторы.",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1558132037",
			"date_added": 1558160914
		},
		{
			"comment_id": 5,
			"body": "@Kids : \n> Если можно отказаться - отлично, но например zeroid требует...\n\nИзначальный смысл создания этих сервисов не желание \"сделать этот мир лучше\", а найти способ завлечь в свой бизнес как можно больше людей. Да, с виду это удобно и просто, только расплачиваться за их использование все равно придется. И совсем не факт, что конечная выгода окажется в пользу клиента, а не конторы.\n\n\"Если ты не платишь за товар, то ты и есть товар\".",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1558132037",
			"date_added": 1558203275
		},
		{
			"comment_id": 6,
			"body": "@Kids : \n> активно склоняют к таким сервисам. А точнее, \"прибивают гвоздями\" без возможности выбора.\n\nМеня это тоже удивляет.\n\nКасаемо ZeroNet, лично меня сильно настораживает концепция \"зайтов\" со своей явно излишней направленностью на \"социальные взаимодействия\",  которая так же является вендорлоком.",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1558132037",
			"date_added": 1558259142
		},
		{
			"comment_id": 7,
			"body": "Обсуждать стало нечего - все уже обсудили. Можно расходиться :)",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1558539619",
			"date_added": 1558560920
		},
		{
			"comment_id": 8,
			"body": "Да чего здесь обсуждать :)\nСудя по всему, практически все в ZN и его сервисах слишком сырое. Далеко не надо ходить. Например, здесь - в ZeroMe, не все фоловеры отобраются в списке, но посты \"невидимок\" тем не менее включаются в ленту \"Followed users\", и при при просмотре постов в их ленте активна кнопка: \"Unfollow\"...",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1558673232",
			"date_added": 1558723938
		},
		{
			"comment_id": 9,
			"body": "@Kids : \n> Питонисты халявят? =)\n\nПраво, ну что вы хотите от демонстрационного прототипа? Скажите спасибо, что хоть как-то хоть чего-то работает :)",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1558673232",
			"date_added": 1558771971
		},
		{
			"comment_id": 10,
			"body": "Вся эта регистрация - чистый развод и плата за воздух. Реальная цена\"подержки\" домена составляет доли цента.",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1558749918",
			"date_added": 1558774897
		},
		{
			"comment_id": 11,
			"body": "@Kids : \n> Ну что-то нет зон с ценой в \"доли цента\", значит не всё так просто.\n\nЕсли считать по потреблению ресурсов сервера в пересчете на домен, а не цену за некую \"услугу его регистрации и поддержания\". Почему тогда домены в разных зонах отличаются по цене? Наверное для дорогих доменов используется особое элитное железо - в золотых корпусах :) ",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1558749918",
			"date_added": 1558826107
		},
		{
			"comment_id": 12,
			"body": "@Kids : \n> Детки хотят всё и сразу\n\nТогда придется самостоятельно баги фиксить. Как говориться: \"все в ваших руках\" :)",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1558673232",
			"date_added": 1558826476
		},
		{
			"comment_id": 13,
			"body": "@Kids : \n> А почему зарплата в условной МСК ниже условной СЕЛОНОУНЕЙМ\n\nДа различается, но не в 3-4 раза за одну и ту же работу.",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1558749918",
			"date_added": 1558992537
		},
		{
			"comment_id": 14,
			"body": "@Kids : \n> Согласны, что цена состоит не только из фактических расходов, т.к. они - давно отошли на второй план... Но \"доли цента\", это вы загнули =)\n\nСоглашусь :) Единицы центов или десятки - более ближе к реальности.",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1558749918",
			"date_added": 1559049866
		},
		{
			"comment_id": 15,
			"body": ">летнее обострение у журналистов ru сегмента, невозможно читать rss\n\nМожет вообще не стоит тратить на них свое время, использовав его для более полезных занятий? Если только их чтение не связано с профессиональной деятельностью.\n\nБросив их читать, я для себя обнаружил, что времени стало куда больше, да и настроение немного улучшилось.",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1559380151",
			"date_added": 1559394140
		},
		{
			"comment_id": 16,
			"body": "* В стационарном варианте, обязательно - проводная.\n* Подсветки никакой не надо - раздражает.\n* Дополнительные кнопки используются (редко) только в играх, в случаях, когда одна рука всегда на мыше, при обычной работе за компом их использовать неудобно - не будешь же каждый раз тянуться к мыши?\n* Покрытие - нескользящее, шероховатое.\n* Самое главное - четкие клики, и точное перемещение указателя, ради этого собственно мышь и используется :-)",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1560739497",
			"date_added": 1560800566
		},
		{
			"comment_id": 17,
			"body": "@caryoscelus:\n>что вы такое с мышкой собрались делать\n\nБоюсь даже предположить...",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1560739497",
			"date_added": 1560800654
		},
		{
			"comment_id": 18,
			"body": "@caryoscelus:\n>Живу несколько лет без мыши, из проблем — разве что мышко-ориентированные игры. А так тач/трек-пад удобнее\n\nДо момента когда придется сделать что-то не совсем тривиальное в растровом графическом редакторе.",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1560739497",
			"date_added": 1560800980
		},
		{
			"comment_id": 19,
			"body": "Все \"веб разработчики\", использующие iframe на своих сайтах в 2019 году - должны страдать.\n\nКасаемо ZN, он просто перестанет поддерживать отображение любого статического контента, после отказа от iframe.",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1562430013",
			"date_added": 1562499144
		},
		{
			"comment_id": 20,
			"body": "@Geekless:\n>будем гонять через SOCK5 прокси с разбивкой по доменам\n\nО правах я и не подумал... \n\nЕще больше костылей - всяких и разных.\n\nНе понимаю: зачем пихать в одну страницу то, что требует разных прав? Нельзя было для пользовательского приложения использовать отдельную страницу, а для админки - свою?",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1562430013",
			"date_added": 1562654988
		},
		{
			"comment_id": 21,
			"body": "@Kids : \n>Хмм, ну почему, статика по прямым URL`ам останется.\n\nДа. Если просматривать браузером напрямую содержимое директроии.",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1562430013",
			"date_added": 1562655255
		},
		{
			"comment_id": 22,
			"body": "@Geekless: \n>Разграничение прав работает на по доменам, а ZeroNet отображает все сайты на одном домене.\n\nЗапустить локальный DNS, и добавлять в него адреса загруженных зайтов, которые будут через него резолвиться, например: `http://Me.ZeroNetwork.bit/?Post/12h51 ...` или `http://1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Home`",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1562430013",
			"date_added": 1562659012
		},
		{
			"comment_id": 23,
			"body": "@Geekless:\n>Нужен не просто DNS, а полноценная обработка доменов на стороне узла ZeroNet.\n\nИ здесь все плохо... :-)",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1562430013",
			"date_added": 1562659941
		},
		{
			"comment_id": 24,
			"body": ">Невозможно же\n\nТак работает markdown...\n\nМожно было эмулировать пустые строки двумя последовательными br.",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1564267880",
			"date_added": 1564326946
		},
		{
			"comment_id": 25,
			"body": "Так он же еще не допиленный до конца...\n\nК тому же, по моему скромному мнению, не стоит все подряд в кернел тащить, если это с железом не связано. Секюрности это не добавит, (а проблем - сколько угодно, в том числе с общей стабильностью системы) по тому, что конечный софт, для которого собственно организуется мегасекюрный туннель силами такой причуды, все равно в юзерспейсе исполняется.",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1566901551",
			"date_added": 1566930672
		}
	]
}