{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"3_1BGWexcsjvPpnPZVmmioZvwBBQ3WoZsWuQ": 1
	},
	"next_comment_id": 3,
	"comment": {
		"3_12wH9Vw9gydwdHWQVRP1iZFpy9YyidBoHP": [
			{
				"comment_id": 1,
				"body": "+1",
				"added": 1560822150
			}
		],
		"4_12wH9Vw9gydwdHWQVRP1iZFpy9YyidBoHP": [
			{
				"comment_id": 2,
				"body": "Si (((youtube))) no lo ha censurado su canal, o alguno de sus videos, y ademas tiene muchas visitas y es recomendado por youtube, UTBH es un tonto util para despistar, desinformar, confundir, desviar la atencion o distraer a los subscriptores sobre la verdadera naturaleza judeomasonica del feminismo desde sus origenes (fue y es promovido por mujeres judias para destruir a la familia blanca tradicional cristiana para luego hacer el plan Kalergi); o es disidencia controlada para recanalizar el descontento popular a partidos cortafuegos, controlados por el sistema como VOX y evitar que vaya a disidencia real contra R78 como democracia nacional (dn) o La Falange cuyos canales, colaboradores y simpatizantes Sí son censurados en youtube.\nNunca existio el verdadero feminismo; su objetivo siempre fue la destruccion de la familia blanca tradicional para hundir su natalidad para su posterior sustitucion etnica (y asi controlar mejor a las masas). UTBH, Alonso dm y otros que creen en el \"verdadero femismo\" son promovidos en youtube para que no se sepa toda la verdad mientras que los que si la dicen, son censurados como Alerta Judiada del dailystormer en español (los mismos que publicaron el video y los datos de la gorda de la manada) y muchos otros.\n\nPor cierto podeis seguir todos los episodios  de Aqui la Voz de Europa de dn en \nhttps://www.ivoox.com/podcast-aqui-la-voz-de-europa_sq_f1271488_1.html\nhttp://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2/14JNJcjJNfFc78fvfB4D3HExPZqDBnd7hj/cosmoteista@zeroid.bit",
				"added": 1560824176
			}
		]
	},
	"comment_vote": {
		"14_1BGWexcsjvPpnPZVmmioZvwBBQ3WoZsWuQ": 1,
		"2_14JNJcjJNfFc78fvfB4D3HExPZqDBnd7hj": 1
	}
}