{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1608156151_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "Good to hear it worked, and you fid exactly correct thing in setting border. BE prepared to defend the borders too, you well being and their depend on it. And start preparing your plans to move offgrid/you dream so that you are ready to do it when time is ripe. Good luck",
				"added": 1608468688
			}
		],
		"1606832263_1CrmAngYJFsq57QkHf2gC1deKeye8crBAv": [
			{
				"comment_id": 2,
				"body": "> [mxh69420](#comment_23_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx): i kinda wrote this as i went along, i havent watched all the way through. i mostly disagree with it but it brings up good points. some stuff i have already written, and he cleared up further, making most of these thoughts worthless, but somebody might find it valuable, or find a valuable idea that springs up new ideas in this trash dump of stupid ones. [...]\n\nGood stuff, but when it comes to cacinez you are talking about only about 1 type classical vaccine, there is tons of different types whit pris and cons, and now we are introducing new types like RNA and DNA vacines, retrovirus based vacines and plenty of others. While they are cool tech with tons of potential good uses they are mostly only tested in animals. Ecample of this european rna technology vacine is tested with animals and some thousand recent test user in Europe and some other patches, now they want to run it to common populus. And whit some other weird behaviors/coicidents related vacines, PPL become suspicious. Personally I think poisoning vaccines is stupid strategy, because it is easy to backtrack, but I am not going to take this one before waiting 1,5 year to see what happens.\n\nLinks, sources.\nVaccine types:\nhttps://www.nytimes.com/interactive/2020/05/20/science/coronavirus-vaccine-development.html\n\nCovid vaccine development database / tracker:\nhttps://vac-lshtm.shinyapps.io/ncov_vaccine_landscape/\n\nPfizer rna corona vaccine:\nhttps://www.pfizer.com/science/coronavirus",
				"added": 1608475868
			}
		]
	},
	"comment_vote": {}
}