{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1608025556_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "why are we talking about nazis? They lost in the war 80 years ago , isn't it time to move on?",
				"added": 1608049083
			}
		],
		"1606080511_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": [
			{
				"comment_id": 2,
				"body": "congratulations and you just bumped this garbage to the top.",
				"added": 1608049209
			}
		],
		"1606503160_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 3,
				"body": "> [edgelordofdecent](#comment_724_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): It isn't. There are many ways you can kill yourself all around you everyday. It is just that you actually don't want to and you are desperate for help or attention.\n\nare you speaking form experience? You'll wish you had a manual when your cornered and want to die.",
				"added": 1608049361
			},
			{
				"comment_id": 5,
				"body": "Not everyone can get a gun or find a cliff nearby. Suicide with substances has a very low mortality rate unless its done right. Lots of people fail to do it, dont now how to do it and end up in the hospital as a vegetable. So yes I think it would be a real good idea to have a suicide forum discussing methods but probably not on zeronet.",
				"added": 1608050606
			}
		],
		"1603385950_129Djo6fqb7fviR6j7SC25e1m5fE4MbCQU": [
			{
				"comment_id": 4,
				"body": "The zeronet interface looks like a toy or a video game, it makes you doubt if this is even a legit program and not just some scam to make you believe its really a decentralized web. It uses javascript and runs through the browser which I think is a terrible design flaw (how hard is it really to use traditional GUI interface?) so it probably has tons of exploits. The userbase is full of dumb normies consisting of redditors and other dumb children who know nothing about reality. it is definely not anoymous as anyone can literally open up the files downloaded to see the origin IP address so you better be using TOR + VPN when you post. TOR is also not safe to use as police are able to figure out something from exit nodes. I dont even trust the developers , theres no guarantee they won't sell out and screw us all over.",
				"added": 1608050340
			},
			{
				"comment_id": 7,
				"body": "> [sword000000](#comment_53_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie): What does Open Source mean? \na great way for hackers to sift through the source code to find exploits and use them. I've done it a few times in the past and only report them after im done using them.\n\nand about javascript, it  is essentially letting the browser run arbitrary code when opening a web page, anyone can program exploit, its a disaster waiting to happen. Zites should have been limited to html 1.0 and no scripts allowed. Using a Web Browser to view pages is also security risk because it can share so much of your information. Why couldn't they have just a simple viewer for plain text? Not attractive and colorful enough for the kiddies?",
				"added": 1608140100
			}
		],
		"1607948770_19rSc8YfLc5CKq528uKnDuerT2PZoKiegm": [
			{
				"comment_id": 6,
				"body": "> [robione](#comment_627_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): this is good news.. meaning they no longer have the power to do physical operations [...]\nif only that were true, but with wall street elites back in control they will wreck havoc in the middle east and other parts of the world as they always do while sucking both Americans and the people of the countries they plan to undermine dry. I doubt the USA government is under attack it seems like another CIA subversion operation to confuse the lemmings.",
				"added": 1608051337
			}
		]
	},
	"comment_vote": {}
}