{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1KDxmwZyfs7yomVvdubJgawnJfnoDv8uWs": 1,
		"1_12QRosf2mPWtPPaBCw7YWkiN1MHDEzUSRp": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1_1KDxmwZyfs7yomVvdubJgawnJfnoDv8uWs": [
			{
				"comment_id": 1,
				"body": "The only borders the state should worry about is the borders to its own welfare programs (which includes welfare of political power, aka democracy). They should then leave the borders of private individuals alone as there are already laws and courts to enforce violation of their property.",
				"added": 1458068259
			}
		],
		"1_1BKxbbov3d8NaYpuFB4HTftAHKz9VVXi8Y": [
			{
				"comment_id": 2,
				"body": "Capitalism actually allows for some socialism in it, but socialism doesn't allow for any capitalism in it.\n\nWith capitalism for example factor workers can own the factory they work in! But in socialism ownership is limited to only certain kinds of ownership, either as the workers, or as some other more encompassing collective (a nation, or state).\n\nThe problem with capitalism is when it is mixed with government. Politicians for example tend to favor factories they can invest in and profit on, over ones they cannot. If a bunch of factory workers own the factory they work in, then outside investors like politicians can't invest, and so in passing laws they will pass laws that favor ones they can invest in to the detriment of those they cannot, manipulating the market creating a place where socialist factories can't survive. This is why you see big businesses (laws intended to reduce competition), why you see governments give bail outs and subsidies to big businesses (corporate welfare), as politicians try to grow and protect their own investments. You might also note for example that in the US it is not illegal for politicians to trade stocks on insider knowledge while it is illegal for everyone else to do so.\n\nTo have a better mix of both you would need a capitalist system where the market isn't manipulated by a state, this would allow for socialist organizations to survive and thrive.",
				"added": 1458882375
			}
		]
	},
	"comment_vote": {}
}