{
	"title": "锑星",
	"description": "我们都在阴沟里\n但仍有人仰望星空",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 6,
	"demo": false,
	"modified": 1514180893,
	"post": [
		{
			"post_id": 5,
			"title": "李笑来，有时候是个骗子",
			"date_published": 1514180743.202,
			"body": "![WechatIMG111.jpeg (640x356)](data/img/post_5_WechatIMG111.jpeg)\n最近骂李笑来是骗子的声音好像少了点。\n\n当然也不是没有人骂，比如说前阵子李笑来搞比特币分叉，弄出个**SBTC**，又被人骂的很惨。只不过后来各种分叉币都纷纷蹦出来，大家也就释然了：\n\n> 原来你们搞区块链都是一个德性，都是骗子啊！\n\n* * *\n\n一千个读者眼中有一千个哈姆雷特，今年9月，**一千个韭菜心中九百九十九个李笑来都是大骗子**。也难怪，李笑来投资、站台、背书的项目不少，在那个暴跌的九月，大家把怒气都转到李笑来身上，责骂是他搞臭了 ICO 的风气，是他导致政府不得不对交易所进行监管封杀。\n\n比如说 EOS 这个项目，怎么看都是骗人的。当时如果你在网上搜索，会发现很多人都指出，这个项目空有一个概念，而且在国外根本就不火，都没有多少外国人谈论，纯粹是李笑来拉着 BM 来中国圈傻子钱的。\n\n当时 EOS 众筹拿到了1.85亿美元，并且在二级市场市值达到50亿美元。不少媒体报道，称之为**50亿美元的空气**。对此，李笑来很委屈：“空气是没有代码的...”。然而，解释无力，当 EOS 的价格跌到3元的时候，李笑来是骗子的传闻已经坐实。李老师的信徒们转而变成敌人，抛掉手中已经贬值的 EOS，加入讨伐李笑来的队伍。在李笑来关掉微博评论前，你能看到留言里都是各种恶毒的咒骂问候他的祖宗十八代。\n\n李笑来，在这个九月，肯定是骗子。\n\n> 分别总是在九月 ~\n> 回忆是思念的愁 ~ ~\n\n时间过得很快，一眨眼来到了十二月（是的，才过了三个月而已）。现在 EOS 的价格已经上了50元。短短三个月时间，翻了20倍。这个时候你再去网上搜索一下关于 EOS 这个项目的新闻，突然会发现这个项目变的特别靠谱了。而且，关键是，有许多老外也开始了解这个项目，看好这个项目。EOS 绝对是这轮牛市里最耀眼的明星之一。\n\n众人猛然间发现，当初外国人还不知道 EOS 的时候，其实是李笑来老师靠他的个人影响力，率先让国人获得了财富自由的机会！只不过大家太没有耐心，太早丢掉了手里的筹码！\n\n但是奇怪的是，EOS 还是那个项目。EOS 的主导者还是那个圈内有名的 BM 大神，李笑来还是那个李笑来。为什么短短三个月时间，EOS 怎么就从一个骗人的项目变成了一个非常有前景的项目了呢？\n\n也许，在大家眼里，当币价不断上升的时候，就代表靠谱，币价不断下跌的时候，就代表骗人。\n\n所以，EOS 到底是不是骗人的不重要，重要的是它的币价值多少，重要的是大家炒币是赚了还是亏了。\n\n**所以说，李笑来，有时候是个骗子。**\n\n**李笑来，如同薛定谔的猫，不确定是不是骗子。**\n\n当大家跟着李笑来炒币赚了，李笑来就是神，是信仰，带领大家通往财富自由之路。\n\n当大家跟着李笑来炒币亏了，李笑来肯定就是大骗子了。\n\n那么我眼中的李笑来是不是骗子呢？\n\n我在 EOS 是五块钱的时候就抛掉了。我错失了几个亿，EOS 让我亏惨了。所以，我会坚定的认为李笑来是个大骗子，坚定的认为 EOS 就是个骗子项目，坚定的认为现在这个币价绝对是个大泡沫，坚定的认为这个泡沫迟早会破裂。\n\n我必须这么坚信，不然晚上就睡不踏实。\n\n**这就是我做为韭菜的基本修养。**"
		},
		{
			"post_id": 4,
			"title": "“热闹是他们的，我们什么也没有”",
			"date_published": 1512737687.398,
			"body": "前阵子国内A股大跌，这两天美国科技股大跌，结果今天港股也大跌，真可谓放眼望去，满世界疮痍。\n\n可是对于参与区块链投资的人来说，简直是活在另一个世界里。\n\n因为今天比特币已经涨到9万人民币了。\n\n不仅是比特币，各种区块链资产都涨势喜人。和惨烈的股市形成鲜明对比。\n\n我所在的一个微信群里，群友都是在国外的华人，从早到晚一个个都打了鸡血般兴奋：也难怪，他们所投资的iota这两天已经涨了5倍。\n\n看到那边国外朋友们的热闹劲儿，再看国内如今安安静静，我的脑海里突然冒出一句话，那是初中语文课本里，朱自清的《荷塘月色》上的一句话：\n\n> “热闹是他们的，我什么也没有”\n\n* * *\n\n原本中国是区块链世界里最热闹的国家，我们拥有最多的区块链货币，拥有最多的矿机资源，也拥有最丰富的交易平台和最狂热的投机群众。而这热闹的一切，在九月份监管出台之后，一夜之间灰飞烟灭。\n\n热闹散去，投机分子砸盘，区块链货币全线暴跌。\n\n城门失火，殃及池鱼。区块链货币无国界，国外的投资者和我们一起痛哭流涕。比特币一下子跌到两万元以下。\n\n之后，一切都重归平静，似乎这个九月前的疯狂都不曾来过。渴望一夜暴富的人们接受了美梦破灭的现实，纷纷抛掉已经贬值的区块链资产，回去继续安安心心上班。从此区块链和我们无关。\n\n然而，外头又慢慢热闹起来了。区块链的世界从失去中国的阵痛中恢复过来，历史的车轮重新启动。\n\n没有了中国监管的风险，区块链们这一次来的更凶猛了。短短两个月，比特币已经翻了八倍。\n\n一直以来有人怀疑比特币价格是中国人推上去的。如今事实证明，没有了中国的参与，比特币价格涨的更是肆无忌惮。\n\n一直以来还有一种阴谋论，说比特币是美国政府发明，用来搞垮中国经济的。这种说法简直笑话。比特币原本可以是中国搞垮美国经济的强力武器，结果我们自己关上门，把比特币以低价格拱手送人，却留着一堆毫无价值的美债。如今芝加哥要上比特币期货，美国人真的要收割全世界人民了，我们只能干瞪眼。\n\n我们能做什么呢？\n\n我们只能一起乖巧端坐，安静的干瞪眼，心里默念：\n\n> “热闹都是他们的，我们什么都没有”"
		},
		{
			"post_id": 3,
			"title": "枪炮一响，比特币万两",
			"date_published": 1512735752.126,
			"body": "![KimJongun.jpeg (694x392)](data/img/post_3_KimJongun.jpeg)\n\n有这么一句老话，叫：\n\n> 枪炮一响，黄金万两\n\n啥意思？\n\n如果你读过之前我写的那篇文章[《为什么政府必须封杀比特币?》](https://mp.weixin.qq.com/s?__biz=MzA5MDUxNTU3OQ==&mid=2647622973&idx=1&sn=811ea9a9e898e957024804f1c0df648d&chksm=88315429bf46dd3f2420cc31bdb6b45bcdd1fdaaee9bf08a6d7a533d4919c7243a4f45c315c9&scene=21#wechat_redirect)，你就会明白，所谓法币，不过就是政府印刷的一张张纸。在和平年代，政治经济稳定的时候，这些纸可以很好的担当货币的作用，但是一旦局势混乱特别是战争来临，这些纸极有可能变得一文不值。到时候人们会纷纷抛售纸币，换取黄金等其他更有价值的资产。\n\n然而，“枪炮一响黄金万两”这句话放到今天可能就要变了。因为有个东西，比黄金更受欢迎。\n\n什么东西比黄金还受欢迎？那就是比特币。\n\n* * *\n\n**今天，比特币价格涨到了10万元人民币。**\n\n为啥？\n\n因为这几天韩国人日子不好过。\n\n想必大家都从新闻中获知，朝鲜与韩国美国的关系越来越紧张，关于战争的传言让韩国人处于恐慌之中。\n\n一旦战争真的打响，韩元必定贬值。韩国人民为了保护自己的财富，这几天抓紧时间进行财富转移。只是这一次，他们没有选择黄金，而是选择了比特币。于是我们看到韩国的区块链交易所这几天陷入疯狂，比特币价格不断被推高。\n\n为什么选择比特币而不是黄金？其实我举个简单的例子你就明白了。\n\n比如说你是韩国人，想要逃到国外，如何以最快最便捷的方式带走自己的财富？\n\n很简单。\n\n> 第一步：用韩元去交易所买比特币\n> \n> 第二步：在手机上装上比特币钱包，把比特币转到手机上\n> \n> 第三步：带着手机出国，到海外，再把比特币转为当地货币。\n\n**搞定，就这么简单。你不需要携带一捆捆现金，不需要背着几公斤的黄金，不需要在海外银行先开户通过繁琐的审核，不需要在任何传统投资市场接受重重监管来将财富进行转移。你只需要一部手机就可以。**\n\n还嫌麻烦？不想带手机？\n\n没事，还有更简单的。\n\n> 第一步：用韩元去交易所买比特币\n> \n> 第二步：把比特币转到手机上的比特币钱包\n> \n> 第三步：把钱包密钥抄在一张纸上，然后，把手机砸了\n> \n> 第四步：带着这张纸出国\n> \n> 第五步：到了国外，买一部手机，下载比特币钱包，输入纸上的密钥，然后，你的钱就回来了！\n\n啥？还想更简单？不想带纸？\n\n没事，只要你记性好，可以记住那串密钥数字，**那么无论你去哪里，那串数字背后的比特币就永远属于你，没有谁可以拿走它**！\n\n这回你明白了吧，为啥比特币是比黄金更加方便的避险工具。\n\n所以这句老话如今该改成：\n\n> **“枪炮一响，比特币万两！”**\n\n然而比特币并没有重量，比特币不过是一串数字。按照大多数人的想法，比特币是“虚拟的”。\n\n正是这种肤浅的认知，导致在这剧变的时代，无数人在不知不觉中失去了财富。\n\n那么我们该怎么做？聪明人早已杀入比特币市场，发韩国的国难财。我们普通人又能做点什么呢？\n\n也许对于大多数普通老百姓来说，能做的就是像我昨天文章里写的那样，在一旁安静观看，[热闹都是他们的，我们什么都没有](https://mp.weixin.qq.com/s?__biz=MzA5MDUxNTU3OQ==&mid=2647622997&idx=1&sn=2f830524266770995652587cb5a94ecf&chksm=88315441bf46dd572d886f9b3713ed030eec714a55b47915b5045152c1721ca59a1e1b28cd5f&scene=21#wechat_redirect)。\n\n然后，让我们在内心祈祷，祈祷这场战争不要发生。\n\n我相信，如果有机会可以选择交换，韩国人肯定愿意放弃比特币来换取和平。\n\n**因为，和平安稳的生活才是最珍贵的，是多少比特币都买不来的。**"
		},
		{
			"post_id": 2,
			"title": "为何政府公关总是如此失败？",
			"date_published": 1512179400.829,
			"body": "幼儿园事件，我一直没发声。\n\n在调查结果出来前，分不清哪些是真相，哪些是谣言。跟着大伙一起情绪激动，盲目转发网上的消息，可能一不小心就戴上造谣传谣的帽子。\n\n现在调查结果出来了，广大人民群众又都不满意，一个个说话阴阳怪气冷嘲热讽。其实也不怪大家不能好好说话，因为直言不讳的许多都被禁言了。\n\n事实真相到底怎样，我肯定也不知道。我还是愿意相信这个结果，相信之前那些传言都是造谣。只可惜现在的局面就是政府无论说啥大家都不信。\n\n和以往一样，政府再一次给我们展示了什么叫**灾难级别的失败公关**。\n\n* * *\n\n这次事件给网友印象最深的就是大量公众号文章被删，采访家长视频被删。\n\n也许有人会说，这些公众号文章都是造谣，那些家长也是造谣。可是问题在于，调查结果还没出来，删的这么迅速，你说网友们会怎么想？\n\n我想大多数人第一反应必然是：\n\n> 肯定是真的！肯定是要掩盖不可告人的真相！\n\n相比之下，之前的江歌案件也有不少公众号报道，其中也有不少谣言，可是我也没看到有谣言文章被删除啊。\n\n真要说谣言，那么现在互联网上谣言简直不要太多。各种养生骗局，各种传销骗局，我就从来没见过一发出来就被删的。\n\n为了应对层出不穷的谣言，微信官方甚至还专门做了辟谣小程序，号召大家一起辟谣，并且会写相关辟谣文章明确指出哪些信息是不真实的。\n\n那么为什么这次幼儿园事件的相关文章，删的如此迅速，不能多停留一会儿？即使是谣言，为什么不给大家一个分辨的机会？\n\n直接粗暴的下架别人的发言视频，不希望让大家看到，最后官方发声明称家长已承认自己造谣，怎么说都让人觉得有点屈打成招的感觉吧？\n\n再说了，那些被删的公众号文章中，除了有造谣嫌疑的，还有许多都是很理性的问责，也都不分青红皂白一屡被删除。\n\n可见，删除不删除的关键点不在于发表的是不是谣言。关键点在于这些内容是否有损政府的声誉。\n\n按照这个标准，养生谣言没必要删，传销骗局没必要删，各种热点新闻里的不实信息都不需要删。\n\n但是只要新闻里有一点有损政府形象的，不管是不是谣言，先删了再说。\n\n**这就是我们政府一贯的公关应对措施，这就是为什么政府一步步失去了公信力。**\n\n因为质疑的文章被删除，对于有着丰富想象力的网友来说就相当于消息做实。\n\n那么为什么政府会采取这种仔细想想明显很愚蠢的公关方式？为什么不能保留那些文章，之后再好好开一个新闻发布会，来直面网友的质疑，来好好和大家解释一下真相呢？\n\n因为解释很累啊。网友想象力这么丰富，安抚他们多费劲，把他们当**小孩**看待就好了。\n\n于是我们经常看到一些官员面对记者提问的时候都如同家长面对无理取闹的小孩，一脸不耐烦，语焉不详，摆摆手，发表简短申明：\n\n> “真相就是这样！不管你们信不信，反正我是信了！”\n\n而且万一网友刨根问底，真的问出什么来了该怎么办？所以不管有没有不可告人的真相，始终摆出统一的暧昧态度是最安全的。\n\n那么政府就不担心自己失去公信力吗？为什么不愿意因此改变一下公关策略呢？\n\n原因很简单：**没必要**。\n\n试想一下，如果政府是一家企业，这次的失败公关该有多严重。\n\n携程公关失败，网友号召不用携程订机票。\n\n聚美公关失败，网友号召不再上聚美买化妆品。\n\n小蓝单车公关失败，直接导致小蓝融不到钱倒闭。\n\n不谈企业，换做国外某个政党公关失败，直接会导致失去政权。比如美国这次大选就是因为希拉里公关没能挽回她的邮件丑闻，直接导致她把总统宝座拱手让给特朗普。\n\n那么我们政府需要好的公关吗？需要。但是没有那么必要。\n\n这次结果网友很不满意，但是又能怎么样？\n\n你们不相信这就是真相，但是又能怎么样？\n\n你们用各种隐晦的词语来表达自己的不满，但结果又能怎样？\n\n结果就是一篇篇被删的文章以及新的被收编录入的**和谐词汇**。\n\n政府已经进行了努力调查，硬盘数据能够还原的都已经还原，虐童的老师已经被抓，该罚的罚，该监管的监管，你们网友还想要啥结果？\n\n三原色公司CEO在调查结果出来前就和董事会说，这将是对公司来说最坏的结果。\n\n而这个结果对于广大关心这件事的群众来说不幸是最好的结果。\n\n**不能再坏，不能再好**。\n\n我们还想要啥结果？\n\n我们还是尽快忘记这些不愉快的事情，继续将关注点放回综艺娱乐明星八卦吧。\n\n一年之后，我们都会忘记这些事件，一如我们忘记一年前那些没有后续报道的新闻事件。\n\n你若光明，中国就不再黑暗。\n\n把注意力放回综艺娱乐，少跟着网上造谣的人瞎起劲，没事多自拍，多网购，多下馆子撸串吹牛逼，多玩王者荣耀多吃鸡，你会发现，我们生活还是依然美好。\n\n哦对了，今天看到一个段子：中产调整目标，**不要让孩子死在起跑线上**。\n\n![dianzan.jpeg (1080x1144)](data/img/post_2_dianzan.jpeg)"
		},
		{
			"post_id": 1,
			"title": "写一篇永远不会被删除的文章",
			"date_published": 1433033779.604,
			"body": "之前有很多人说我愤青，说我偏激。\n\n我不服。你看最近这么多公众号的文章都被删了，仔细回想一下，我好像从来都没有被删过文章。\n\n因为我很温和。很理性。遵纪守法。不造谣。\n\n不，其实是因为我很怂。\n\n平时耍耍嘴炮，真有什么热点大事件，大家都义愤填膺口伐笔诛的时候，我连个屁都不敢放。\n\n这个叫**自我审查**。\n\nShame on me☹️☹️☹️\n\n* * *\n\nAnyway，回到题目，那么，如何：\n\n> 写一篇永远不会被删除的文章？\n\n我想这是那些经常被举报的写作者们关心的事情。毕竟我还是不希望大家都来进行自我审查，这样社会就没法进步了，是不是？\n\n我们无法控制自己文章的命运，主要是因为现在互联网过于**中心化**。\n\n什么意思？\n\n十年前，互联网上的写作者们都喜欢自己开博客，在自己的网站上写文章。如今，大家都在平台上写作：微信公众号、微博、百度百家号、今日头条等等等。\n\n在别人平台上写作好处是可以获得更多流量，坏处就是文章的生死不由作者自己说了算。\n\n其实很多时候发表的内容被和谐被举报，也不一定是真有人来举报。可能就是这些平台进行自我审查，把一些敏感关键词列入黑名单，我们发表的内容不幸中枪罢了。\n\n当然，要是不在这些平台上写作，打算自己花钱搭建网站写独立博客，也不一定是百分百安全的。比如说万一写的内容过于敏感了，就会导致整个网站被封杀。\n\n那么到底怎样写一篇永远不会被删的文章呢？\n\n答案就是**去中心化**。\n\n说到去中心化大家想到什么了？\n\n没错，就是最近很火的**区块链技术**。\n\n别不信，现在还真有不少人在用区块链技术搞去中心化的互联网。\n\n受够了日渐中心化的互联网，受够了言论审查，任性的程序员们撸起袖子抄起键盘，再次用代码改变世界。\n\n这些项目中比较著名的有两个，分别叫 **ZeroNet（零网）** 和 **IPFS（星际文件系统）**。\n\nZeroNet 官网这么介绍其特点：\n\n> 1.  无法被审查\n> 2.  没有服务器托管费用\n> 3.  永远可以被访问到\n\n就像比特币无法被封杀一样，发布在 ZeroNet 上的文章也无法被删除。因为你的文章并不存在与一个单一的服务器上，而是存在整个网络的各个节点上，可谓无处不在。\n\n怎么上零网? 很简单，去它们官网 **zeronet.io**，下载客户端，双击打开 ── 恭喜你，进入零网了。\n\n自己建一个网站也很简单，我直接克隆了零网的官方博客，一秒钟建了一个自己的博客。\n\n在这里贴一下我的网站地址：\n\n> 1QLEgUdxDXnCAYkYaQz8dUnxke9wtzSbiE\n\n如果你进入零网，把上面这串数字粘贴到 [http://127.0.0.1:43110/](http://127.0.0.1:43110/) 后面就可以访问我的网站了。\n\n当然我可以搞到一个简短易记的域名，只不过需要花钱去买，就暂时不折腾了。\n\n目前的体验就是，如果网站访问量大的话，速度挺快。访问量小的话，因为节点数目不多，速度比较慢。比如我的网站，刚刚建立，可能得等很久才能加载出来。\n\n现在零网比较小众，但上面已经有不少中文站台了。\n\n相比与公众平台，零网最大的缺点就是太小众了，在上面写文章没多少人会看。\n\n但是我建议有兴趣的写作者可以把零网作为自己文章的备份平台。\n\n毕竟，这里的文章是永远不会被删除的。\n\n最后，你没猜错，本文就是：\n\n**一篇永远不会被删除的文章！**\n\n记住我的文章地址：\n\n> 1QLEgUdxDXnCAYkYaQz8dUnxke9wtzSbiE"
		}
	]
}