{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1546788039,
			"title": "Updating ZeroNet does not update Tor",
			"body": "Just a heads up: If you just use the built-in update functionality to update ZeroNet the bundled version of Tor won't get updated. Replacing the bundled version with the version from the Tor browser (or the expert bundle if you prefer) works just fine though.",
			"added": 1546788038
		}
	],
	"topic_vote": {
		"1534997008_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1517743836_1HsgZpHaZ5BRUK5qr2YMWnubgKyNuSqokH": [
			{
				"comment_id": 1,
				"body": "I don't love my country - I don't hate it either - but I want it to be the best place it can be. In that sense, I agree with you: there are good sides to nationalism, and if people spend more time trying to emigrate than making their *own* country a better place to live, things are never going to get better for the people they leave behind.\n\nHaving said that, I think *loving* your country is kind of silly, like loving people who share your skin color. But hey, I'm not going to tell you what you can and can't feel, just so long as you don't let it blind you to reality.",
				"added": 1517770327
			}
		],
		"1521009385_1Cz286mxKa8Ujy6nj222YKegBkz1Aqo4ks": [
			{
				"comment_id": 2,
				"body": "Legacy addons were supported with multiple processes for a while, through a complicated system called \"addon interposition\" which forwarded some data from the main process to the content processes - but it didn't really scale with multiple content processes and all the synchronous IPC was very bad for performance.\n\nWebExtension APIs are asynchronous and message-based so they work *much* better with multiple processes. In addition they have an actual security model unlike legacy addons, so installing an addon should no longer compromise the security of the browser. WebExtensions APIs also replicate most APIs from Chrome's extension model, so a lot of extensions that work on Chrome now also work on Firefox (check out the Chrome Store Foxified addon for Firefox). While it's true that WebExtensions are more limited than legacy extensions, they also go beyond Chrome's APIs in various ways to make it possible to continue to have addons like NoScript.\n\nAs I see it, this was a risky change but also a necessary one. Firefox simply couldn't offer the performance and security people have come to expect from a browser while still continuing to support legacy addons.",
				"added": 1521059227
			}
		],
		"1523827546_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 3,
				"body": "I think a universal basic income is probably inevitable as AI and robots become more and more ubiquitous in society. I know we've always found new jobs for people to do, but what happens if AI becomes good enough to handle customer service, robots do a better job at nursing the sick or elderly than humans and so on? We're going to reach a point where a larger and larger percentage of humans simply cannot reasonably be expected to find a job. At that point I think a universal basic income will become necessary as a stepping stone toward a less capitalistic society.\n\nOf course there's the question of how much this will cost.. but I think that's ultimately an incorrect question to ask. If you see a country's economy as a black box, it doesn't really matter what happens *inside* the black box, what matters is how much money flows in and out of the box. If more money flows in (through export or by creating money through speculation) then you have a growing economy, if more money flows out (through import) then you have a shrinking economy. If people spend their universal basic income by buying domestic products, then the money simply circulates as the government slowly reclaims it through taxation. It effectively costs nothing *unless* it's used to import goods.",
				"added": 1523835015
			}
		],
		"1530451214_12rREqqdMUPsAPuMR1p87Zj8TS4YocoUCX": [
			{
				"comment_id": 4,
				"body": "I think it's likely developmental - either in the womb or during the formative years.\n\nWhile that may mean that it's preventable, I think it's also worth pointing out that a) homosexuality exists in nature, despite the obvious ramifications for reproductive success, so it may increase the fitness of the species somehow, b) sexual deviance is more prevalent among high IQ individuals, and c) bisexuality seems more prevalent among women.\n\nWhile heterosexuality and homosexuality are the two extremes, it may be that the lines between them become more blurred (on average) for brainier people, and more feminine men might be more frequently bicurious or even gay because they experience sexual attraction differently from more masculine men.\n\nAs for religion, control of sex and sexuality is one of its most potent tools for keeping people in line, and (unknown to the founders) there were likely health advantages to say, not engaging in sodomy. To some extent there still are (e.g. HIV transmission rates through anal sex are very high). But I don't think the feelings of pre-medieval epileptic conmen should govern how we structure our lives. Take the useful elements of religion if you want (like e.g. Jordan Peterson suggests), but discard the mumbo jumbo.\n\nUltimately then I don't think it *should* matter whether there's a \"gay gene\" - but bad science, especially politically motivated bad science, should always be called out.",
				"added": 1530523933
			},
			{
				"comment_id": 5,
				"body": "If it *is* chimerism, that would imply that chimerism is very common indeed. If so, I wonder what that means for trans people - maybe they really were \"born in the wrong body\".",
				"added": 1530635832
			}
		],
		"1533632541_16LdT3GLYKemm8EWbR5BYXKMmMoZrSoet5": [
			{
				"comment_id": 6,
				"body": "Jared Holt of Right Wing Watch coordinated it: https://twitter.com/nickmon1112/status/1027307798919618560",
				"added": 1533766088
			},
			{
				"comment_id": 7,
				"body": "> if two sides - at the same time! - feel that the platform is being captured by the Other Side, what is really happening and who's crazy?\n\nWell, we can just look at the facts: How many conservatives have been shadowbanned, deverified or banned altogether, and how many far left activists have been treated the same way? Candace Owens had her account suspended because she tweeted out *one* of Sarah Jeong's old tweets but with the word \"white\" replaced with \"black\".\n\nI think it's pretty clear who's crazy here. The social justice activists simply won't be happy until they have full control over the platform, so they start to lose their shit at any sign of resistance.",
				"added": 1533825136
			},
			{
				"comment_id": 8,
				"body": "> [marketforce](#comment_46_1ENvPHLeuUKJAWsup9tL9C1mdZeb1ycjp8): You were probably asking in a you-know-the-answer-very-well tone, but I actually don't know. Did anybody count? [...]\n\nI don't know what #Cult45 is, but Trump has special status as a world leader and what they say about Alex Jones is a case of [citation needed]. You really think a company based in San Francisco and staffed almost exclusively by leftists doesn't want to ban Alex Jones? Jack Dorsey might actually believe in free speech but his employees don't, check out http://dailycaller.com/2018/08/08/twitter-jack-dorsey-hate-speech-policy/\n\nIn any case, pretty much any time I see conservatives complaining about shadow banning and all the rest of it, they give examples. Whenever I see a leftist complaining, they just seem to pull claims out of their ass without doing anything to back it up. Yes, Twitter will enforce their rules if enough people report a Tweet, so leftists saying hateful things can get in trouble. But unless enough people make a stink, nothing happens - just take a look at Sarah Jeong's tweets again. A solid two years with hundreds of racist tweets, most of which aren't replying to anyone, and Twitter did nothing, has *still* done nothing. They may have apologized to Candace but that's just because of the shitstorm that resulted.\n\nNo, this isn't just a case of both sides living in equally insular bubbles. When the left gets their own rules applied to them, we *hear* about it. Youtube's restricted mode hides all videos from various conservative channels? Crickets. LGBT channels get hit too? The world is ending! People get suspended on Facebook for expressing anger about grooming gangs? No one cares. Women get suspended on Facebook for saying men are scum? Oh the humanity! Roseanne Barr makes a bad joke and claims she didn't know the target was black? Off with her head! James Gunn makes dozens of creepy jokes about pedophilia? He didn't really *mean* it guyz, he's *grown* since then. It's one set of rules for me and another for thee.",
				"added": 1533860494
			},
			{
				"comment_id": 9,
				"body": "> [leftside](#comment_196_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Alex Jones is like simply being kicked out by a site (Youtube or Facebook) creator (or administrator) since he produces too many fake news. [...]\n\nHe wasn't though, they all cited hate speech as the reason. Not harassment, not libel, not fake news. They simply decided (all within 12 hours, which suggests some level of collaboration) that he was violating their nebulous and selectively enforced hate speech rules.\n\nThis is very much a free speech issue (not a *first amendment* issue, but a *principle of free speech* issue). It's about corporations having the power to pretty much eliminate someone's presence online, when people's livelihoods rely on said presence. Even his *e-mail provider* banned him. What's next, payment processors? Grocery stores? How far do we allow a group of unelected businessmen to go before we say enough is enough? We're already seeing calls to ban other controversial figures like Lauren Southern. It isn't going to stop at Alex Jones; it'll probably end with all of us.",
				"added": 1533912913
			}
		],
		"1537537878_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 10,
				"body": "I'm pretty sure a lot of techniques already assume the Riemann hypothesis as a heuristic anyway.",
				"added": 1537627345
			}
		],
		"1537652215_1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg": [
			{
				"comment_id": 11,
				"body": "Incidentally, most of these points also apply to Communism. I'm not sure about point 9 - while I'm sure corruption tends to be rampant in fascist regimes, fascism is also a form of *socialism* (Mussolini was raised by communists and wrote his manifesto as a reporter working for a socialist newspaper) - just a nationalist form of it.\n\nIn Hitler's Germany it was common for companies to be bought by the government at extortionist prices and if he had remained in power, there would likely have been very little privately owned industry left. Maybe there would have been a few big corporations - but if they're functionally indistinguishable from the government, can you really say they're protecting *corporate* power?\n\nOf course, Hitler's philosophy wasn't so much fascist as *inspired* by fascism. He replaced the socialist concept of a class war with his idea of a race war, creating an ethno-nationalist form of socialism. Still, he admired Mussolini's philosophy so it wasn't far off.",
				"added": 1537702977
			},
			{
				"comment_id": 12,
				"body": "Socialism doesn't look upon social groups as aggregates of living individuals, it's a fundamentally collectivist ideology that regards groups as classes in conflict and looks only at statistical outcomes (rather than the choices of individuals within said groups). So I'm sorry, it simply doesn't belong in that paragraph alongside Liberalism and Democracy.\n\nDon't get me wrong though, I'm not saying there's no difference between Fascism and Communism. Fascism's \"everything for the state, everything in service of the state\" was definitely a new element, that I would argue arose from its conception as a nationalist ideology (where communism is a globalist ideology).",
				"added": 1537786311
			}
		],
		"1538081577_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": [
			{
				"comment_id": 13,
				"body": "Fun thing about that meme, there's a core of truth to it. There really are studies showing that certain chemicals in the water affect some kinds of frogs (and other marine animals), making them more feminine. They're actually turning the frogs trans! Of course, there's no evidence of it being a globalist conspiracy - it's just companies dumping toxic waste because there's no regulation preventing them from doing so.",
				"added": 1538227223
			}
		],
		"1540133695_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": [
			{
				"comment_id": 14,
				"body": "On Windows, Isotoxin is the client that's closest to what I want in terms of looks and functionality. Unfortunately it's a small team and development on it seems to have stalled.",
				"added": 1540210292
			}
		],
		"1542967986_1MHdmQEW2HS6sZNgfi3VmtegHc6fUEyVkW": [
			{
				"comment_id": 15,
				"body": "I don't know about article 13, but IIRC article 11 (the \"link tax\") has an exemption for microenterprises and small enterprises (as defined on page 4 of https://eur-lex.europa.eu/LexUriServ/LexUriServ.do?uri=OJ:L:2003:124:0036:0041:EN:PDF ). Since we're all hosting these sites ourselves, there's no way article 11 could apply to ZeroNet.\n\nArticle 11 might lead to social media networks like Twitter having to remove the summary text for links, which would make links much less appealing to click on. Since ZeroNet-based sites would be exempt, we could get a competitive advantage.",
				"added": 1542997069
			},
			{
				"comment_id": 16,
				"body": "> [eightyfour](#comment_29_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): I'm still puzzled as to why Youtube is siding against Art. 13, as it would solidify their monopoly on a legal level.\n\nIt would be a PR nightmare for them to stay silent or publicly side with it. We'll see what they *actually* believe once the copyright directive is formally approved and member states start introducing laws based on it. Will they pull out of the EU - causing a panic and (probably) a swift amendment of the directive - or will they comply? They have most of the systems in place already so I suspect they'll make a show of complaining about it while secretly rubbing their hands in glee.",
				"added": 1543071069
			}
		],
		"1546788039_13SeW8Gn6YsZFqUaQp5JWSGvzjHWfKHqBY": [
			{
				"comment_id": 17,
				"body": "> [robione](#comment_140_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): It would be useful to explain how exactly, if someone installed the ZeroBundle, one upgrades Tor. [...]\n\nAssuming you're on Windows, replace the files in \"[ZeroNet directory]\\core\\tools\\tor\" with the files in \"%UserProfile%\\Tor Browser\\Browser\\TorBrowser\\Tor\".",
				"added": 1546930838
			},
			{
				"comment_id": 18,
				"body": "Yeah, I doubt Tor will stop working unless they introduce some new API and ZeroNet starts using it - but if there are known vulnerabilities in older versions of Tor or its dependencies, not updating is a security risk.",
				"added": 1547054226
			}
		],
		"1552662484_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": [
			{
				"comment_id": 19,
				"body": "From what I understand, the manifesto indicates that he was an alt-right accelerationist - someone who wants to give the left as much power as possible to bring on a major backlash. That's why he mentions people like PewDiePie - to bolster the media narrative that everyone who isn't progressive is alt-right. I expect that the mainstream media will eat it up uncritically.",
				"added": 1552671435
			}
		]
	},
	"comment_vote": {
		"391_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"208_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"179_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"89_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"3_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg": 1,
		"14_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": 1,
		"335_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1
	}
}