{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1608854281_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "I really wanted to like I2P, and intended to support it 24/7. Constructed a purpose built machine for their network....\n\nLess interested now given I2P's poor performance. \"It's gotta work\".",
				"added": 1609307675
			},
			{
				"comment_id": 3,
				"body": "> [sword000000](#comment_69_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie): Really great, and thanks for all the sites and tips. Unfortunately, now I understand all the complaints. Even after modifying my settings, and using your \"tested and confirmed\" site list, only about half of them load. Even ramble.i2p would not load after several attempts. [...]\n\nIf you leave I2P running for a week....it WILL accumulate more good paths. But even then - a significant number will be unreachable.\n\nWhy a step back with an eye toward making fundamental changes to that design is long overdue.\n\nNuther observation....if all you ever did on the internet was copyrighted material theft, and if I2P's library was more sizable....I2P would have a purpose. Otherwise - not much else. I2P is the PERFECT system for avoiding the  DMC ghouls. Don't believe they could ever stop it. \n\nHence my suspicion that I2P is and was always just a \"secure bittorrent\" scheme.",
				"added": 1609374246
			},
			{
				"comment_id": 4,
				"body": "> [nxm9c2wjbjlhjsrc](#comment_26_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt): Jesus, I just did a stock/vanilla install of I2P on a device that didn't have it and you're right. Out of the box, it does kind of suck. [...]\n\nNone of this matters for I2P's real purpose...which is providing absolutely secure media piracy. I'd wager 90% of the users on that system do nothing else. So it does work - just not for the tasks you need it to perform.",
				"added": 1609374473
			}
		],
		"1607663597_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 2,
				"body": "It's really difficult to trust any \"study\" now - since lying and cheating is so rampant. That's the curse of lies. Once individuals give in - they cannot stop.  And after they are caught - no one will trust them again.\n\nSo much of this research is bullshit money grabbing. With poor or non existent controls, inadequate sampling, or fraudulent recording. All before the honest experiment construction mistakes are ever taken into account.\n\nEspecially in politics, I suspect you should only believe what you have actually witnessed. Your \"sources\" other than your own eyes just aren't trustworthy.",
				"added": 1609308108
			}
		],
		"1609275892_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 5,
				"body": "I really worry where this leads, and fear that these habits will continue to spiral beyond control until they destroy all of us.\n\nBluntly, if you didn't lose your job or take a pay cut - you really lost nothing economically to Covid. The politicos are just buying you off so they can grant even bigger goodies to their elite friends.\n\nThe devastation these polices will cause is beyond our imagination.",
				"added": 1609374738
			}
		]
	},
	"comment_vote": {}
}