{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1585207808,
			"title": "Tor and Internet shut downs",
			"body": "Would Tor still work after a fragmentation of the Internet? (say, countries decide to shut down all international communications)\nIs there any anonymization alternative that would?",
			"added": 1585207807
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1585207808_1KtNz7B6oMUBcPKCTZuSTbphZ2s7RTYCk1": [
			{
				"comment_id": 1,
				"body": "> [reflection](#comment_1_1B3YDm2AkrqwnXweEkq26T1MWV8Emvga9H): ①about:config②network.proxy.no_proxies_on③127.0.0.1 [...]\n\nDidn't read the question?",
				"added": 1585251816
			},
			{
				"comment_id": 2,
				"body": "> [sfs9](#comment_77_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD): Tor is just an overlay network, a protocol that depends on the IPv4/IPv6. If there is no IPv4 and no IPv6 network in place, Tor will become useless. In theory after the sea cables are cut between continents, satellite phones and satellite phone based IPv4 connections might still work, but given the price of such connections it is unlikely that someone is willing to pay for it just to let some guy stream YouTube music over it. Operators of various chat systems like thehttps://telegram.org/or some hactivists runninghttps://bitmessage.org/might use their own custom software to convey only some of the traffic of those chat applications over their own financed satellite links and may be at some point some messages might be transmitted from the Western side to extra censored areas by using thehttps://othernet.is/and then there is also the option of radio amateur relay stations, but it is a very low-volume traffic and it requires special software at the service operator side. All-in-all, forget Tor in those scenarios, but You may build Your own link, at Your own expense, to transfer some small-olume ZeroNet orhttps://beakerbrowser.com/pages from one region to another and help to keep information spreading that way. The ultra-rich in China are probably using western satellite telephones and their modems for daily business operations anyway, as do probably Russian oligarchs and the various Arab business people. If You're working on some university cube-sat project, then You might want to create Your own relay satellite that picks data up at one side of the globe and dispatches it at the other side of the globe. It would make an awesome ZeroNet zite distribution link. The Chinese and Russians and alike have the capability to shoot down satellites, but they try to do it with a laser, so You may want to design some mirrors to protect the side that points to Earth. The other side is for solar panels. Make sure that the mirrors disperse the beam so that You won't inadvertently hit a passenger plane or someone on the ground with the high intensity reflected beam. The dispersing of the beam makes Your satellite easily visible, but it's visible anyway due to the downlink signal. May be a huge \"satellite dish\" can be 2 in one: a dispersing mirror that protects the satellite and a reflector for the directed antenna. The frequencies of the shooting laser and the radio waves differ and that difference might be leveraged.\n\nThere would still be IPv4, it's just that now certain IP ranges will be unreachable. But regional connections would still work.",
				"added": 1585252082
			},
			{
				"comment_id": 4,
				"body": "Bump.With all the talk of Internet shutdowns and ncov we need to sort this off.",
				"added": 1585709233
			}
		],
		"1585616438_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 3,
				"body": "Lame. This has nothing to do with pirate radio.",
				"added": 1585708997
			}
		]
	},
	"comment_vote": {}
}