{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "C'è qualcuno?",
			"body": "ZeroTalk italiano è più inattivo di Dio durante l'olocausto",
			"added": 1574966926
		},
		{
			"topic_id": 2,
			"title": "Cosa vi manca di internet di 10, 20, 30 anni fa?",
			"body": "(Sto copiando dallo zerotalk principale XD)\nCosa vi manca del vecchio internet? Per quale motivo?",
			"added": 1577561265
		},
		{
			"topic_id": 3,
			"title": "Come migliorare la scuola pubblica",
			"body": "Come si potrebbe migliorare la scuola pubblica? Sbizzarritevi",
			"added": 1579599305
		},
		{
			"topic_id": 4,
			"title": "CORONAVIRUS",
			"body": "Qualche notizia seria e non speculativa?",
			"added": 1580666602
		}
	],
	"topic_vote": {
		"1_1Vy5x8HrbwRc2GM32GfZtpxdgoB5f34fd": 1,
		"3_1NDdp5wQYRqdq2CeRVASnskd1EHkqS6RCQ": 1,
		"1_16CxgRUbD8jwDd6F1xg1qUNAUjfrRiTK7E": 1,
		"1_1MfKWCXoRDe1yAqBzTcqi6mqgpYqzg8Va9": 1,
		"4_1NDdp5wQYRqdq2CeRVASnskd1EHkqS6RCQ": 1,
		"3_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": 1,
		"5_1NDdp5wQYRqdq2CeRVASnskd1EHkqS6RCQ": 1,
		"7_1NDdp5wQYRqdq2CeRVASnskd1EHkqS6RCQ": 1
	},
	"next_comment_id": 22,
	"comment": {
		"1_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 1,
				"body": "> [anark666](#comment_19_1NDdp5wQYRqdq2CeRVASnskd1EHkqS6RCQ): Io ci sono... e sono uno dei pochissimi.... :-(Ho un blog in fase di costruzione......\"ANARCHIA UNICA VIA. Anarchia - Consumismo - Decrescita - Contro-Informazione.\"Contro il consumismo e il capitalismo, contro la \"crescita\" e questo schifo di economia.http://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/\n\nQuando provo a collegarmi non trova peers",
				"added": 1575286710
			},
			{
				"comment_id": 2,
				"body": "> [gabrix27](#comment_1_14Wp2K6q5qzFthtEedPcytDmiDE7ZqrnEs): Ciao,\n\nSalve salvino",
				"added": 1575286744
			}
		],
		"1_1BwpEuQZAvCqQaPqrPB4fS6PTfLRtx2PA6": [
			{
				"comment_id": 3,
				"body": "> [mymage](#comment_1_1BwpEuQZAvCqQaPqrPB4fS6PTfLRtx2PA6): Ho completato la traduzione della documentazione che trovate qui: https://github.com/mymage/Documentation/tree/master-it-documentationPrima di fare la PR me la riguardo e mi farebbe piacere che qualcun'altro ci desse un occhio.Potete dal punto di partenza passare atteaverso i commit e vedere le traduzioni che ho fatto per riga (in modo d'avere sotto mano l'originale e la traduzione, oppure entrare in docs->it e leggere le pagine tradotte.\n> Le segnalazioni fatele direttamente su GitHub indicando se possibile file e numero riga.\n\nerror 404",
				"added": 1575286877
			}
		],
		"1_1JLS4cJM8Nd37BHpBC6arN8hTrzvdTmzdp": [
			{
				"comment_id": 4,
				"body": "nessun peer trovato",
				"added": 1575287032
			}
		],
		"3_1NDdp5wQYRqdq2CeRVASnskd1EHkqS6RCQ": [
			{
				"comment_id": 5,
				"body": "Nessun peer trovato. Mi piacerebbe andare sul tuo sito",
				"added": 1575833149
			}
		],
		"1_16CxgRUbD8jwDd6F1xg1qUNAUjfrRiTK7E": [
			{
				"comment_id": 6,
				"body": "In che senso una \"libreria\"? Intendi una raccolta di libri o qualcos'altro?",
				"added": 1577561166
			}
		],
		"1_1MfKWCXoRDe1yAqBzTcqi6mqgpYqzg8Va9": [
			{
				"comment_id": 7,
				"body": "Per buttare giù una pagina su zeronet (o in generale nelle reti p2p) dovrebbero far disconnettere contemporaneamente dalla rete tutti i dispositivi che hanno effettuato l'accesso a quella determinata pagina per almeno una volta (o far cancellare il sito dal disco di chi ci ha navigato, creatore compreso). \n\nNavigando su zeronet tutti i siti a cui accedi vengono automaticamente scaricati e salvati nel tuo dispositivo di archiviazione su cui hai installato zeronet, iniziando pure a distribuirlo (diventando di fatto un nodo della rete).\n---\nThe Onion Routing (TOR) non è soltanto un browser, ma anche una tecnica di anonimizzazione, difatti, è consigliato usare Tor per accedere a Zeronet per mascherare il proprio indirizzo IP. Addirittura su windows Tor è incluso nell'installazione di zeronet. \n\nIn risposta alle tue domande:\nSi, essendo p2p viene difficile tracciare chi ha postato qualcosa proprio per il fatto che manca un server centrale, se poi ci aggiungiamo che usando Tor il tuo indirizzo IP viene pure mascherato, la vedo dura per le forze dell'ordine controllare qualcosa del genere.\n\nCorreggimi se sbaglio in qualche passaggio dato che non sono un esperto di telecomunicazioni, cybersecurity e quant'altro, ma volevo dare un quadro generale della situazione\n\nTi lascio qui la documentazione ufficiale di zeronet\nhttp://127.0.0.1:43110/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/",
				"added": 1577815481
			},
			{
				"comment_id": 8,
				"body": "Ho dimenticato di dire che gli Hentai li puoi trovare pure sul clear web",
				"added": 1577815598
			},
			{
				"comment_id": 10,
				"body": "> [zeroseed](#comment_1_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g): I siti illegali ci sono qui come sul clearweb (anzi forse nella rete \"in chiaro\" sono anche più diffusi, ti basta metter su un server su un paradiso fiscale o nell'est europa per fare praticamente quello che vuoi) dove è anche più semplice raggiungere eventuali acquirenti\n> Il fatto che i contenuti siano P2P non li rende più difficilmente bloccabili che su sistemi server based per la semplice ragione che anche con i sistemi classici io posso copiarmi qualcosa di illegale in locale e poi ridiffonderlo in altri canali. Internet è nato per resistere alla censura! (una cosa sparisce dalla clearnet solo se non interessa a nessuno...come su zeronet!)\n> E' poi anche vero che se nei sistemi server based il gestore del server risponde per prima dei contenuti illegali con l'obbligo di rimozione, qui è l'utente che li crea o li condivide a risponderne direttamente! (a mio parere cosa molto più giusta, non sempre un admin è online h24 ed omniscente...)\n> Zeronet non è anonimo di default (se lo usi senza TOR il tuo indirizzo IP è pubblico, quindi sei molto vulnerabile). Accedere alla clearnet via TOR rende altrettanto complicato risalire a chi crea o diffonde un contenuto.\n> Su zeronet se tu non accedi a contenuti illegali non li scarichi sul tuo PC e non li diffondi, quindi la questione della responsabilità permane come sulla clearnet.\n> D'altro canto i sistemi P2P presentano enormi vantaggi in termini di prestazioni e soprattutto di MODERAZIONE DEI CONTENUTI! (se io non voglio più comunicare con qualcuno lo banno e basta, non devo chiedere nulla a nessun admin) oltre a rendere impossibile creare bolle di filtraggio che limitano la libertà di informazione degli utenti! Questo è il vero vantaggio di zeronet! Di modi per commettere attività illecite più efficaci, fra clearnet ed hidden service, il mondo è già pieno...\n\nPensa a siti come bestgore che viene buttato giù spesso, o banalmente i siti di crack (che spesso diffondono trojan e malware di vario tipo)",
				"added": 1578125247
			},
			{
				"comment_id": 11,
				"body": "> [zeroseed](#comment_1_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g): I siti illegali ci sono qui come sul clearweb (anzi forse nella rete \"in chiaro\" sono anche più diffusi, ti basta metter su un server su un paradiso fiscale o nell'est europa per fare praticamente quello che vuoi) dove è anche più semplice raggiungere eventuali acquirenti\n> Il fatto che i contenuti siano P2P non li rende più difficilmente bloccabili che su sistemi server based per la semplice ragione che anche con i sistemi classici io posso copiarmi qualcosa di illegale in locale e poi ridiffonderlo in altri canali. Internet è nato per resistere alla censura! (una cosa sparisce dalla clearnet solo se non interessa a nessuno...come su zeronet!)\n> E' poi anche vero che se nei sistemi server based il gestore del server risponde per prima dei contenuti illegali con l'obbligo di rimozione, qui è l'utente che li crea o li condivide a risponderne direttamente! (a mio parere cosa molto più giusta, non sempre un admin è online h24 ed omniscente...)\n> Zeronet non è anonimo di default (se lo usi senza TOR il tuo indirizzo IP è pubblico, quindi sei molto vulnerabile). Accedere alla clearnet via TOR rende altrettanto complicato risalire a chi crea o diffonde un contenuto.\n> Su zeronet se tu non accedi a contenuti illegali non li scarichi sul tuo PC e non li diffondi, quindi la questione della responsabilità permane come sulla clearnet.\n> D'altro canto i sistemi P2P presentano enormi vantaggi in termini di prestazioni e soprattutto di MODERAZIONE DEI CONTENUTI! (se io non voglio più comunicare con qualcuno lo banno e basta, non devo chiedere nulla a nessun admin) oltre a rendere impossibile creare bolle di filtraggio che limitano la libertà di informazione degli utenti! Questo è il vero vantaggio di zeronet! Di modi per commettere attività illecite più efficaci, fra clearnet ed hidden service, il mondo è già pieno...\n\nSe non sbaglio sulle reti p2p non puoi bannare direttamente un utente. Sono io che sbaglio?",
				"added": 1578125460
			},
			{
				"comment_id": 13,
				"body": "> [zeroseed](#comment_5_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g): Sbagliato! Il punto di forza è proprio che posso bannare chiunque senza chiedere nulla a nessuno e decidere  cosa condividere! Per bannare un utente su zeronet ad esempio ti basta inserire il suo nick su zeroid, ti comparirà un popup che ti chiederà di confermare l'azione di mute (se gli dai ok tutti i contenuti creati da questo utente verranno cancellati dal tuo pc). Puoi cancellare anche interi ziti se non ti piacciono da zerohello. In più sono disponibili diverse liste per filtrare automaticamente utenze o ziti con varie caratteristiche (ci sono blocchi per la roba illegale, spammer, troll, pornografia, ecc...) in questo modo non rischi di condividere nulla nemmeno per sbaglio cliccando su un link casuale\n\nPer ban intendo bandire l'utente dalla piattaforma, non \"mutarlo\" oscurando solo per te i contenuti",
				"added": 1581096968
			}
		],
		"2_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 9,
				"body": "> [zeroseed](#comment_3_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g): il diritto all'anonimato, quando le idee contavano di più delle persone che le esprimevano e dell'apparenza che oggi domina il web; quando si collaborava invece di competere uno contro l'altro (come anche nella vita reale); quando nascevano progetti sempre nuovi e li si vedeva crescere (oggi invece crescono solo gli iscritti ed i like, rimpiango alcuni vecchi siti del passato che ora non esistono più, uccisi quasi tutti da facebook&co.)\n> rimpiango la libertà di informazione che prima c'era senza le bolle di filtraggio, rimpiango lo spirito di collaborazione che animava le community P2P, gli artisti Creative Commons e gli sviluppatori del mondo Open Source (oggi invece conta solo il quattrino) \n> ...e spero che Zeronet possa riportarmi un giorno un po' di tutto questo! (lo sta già facendo)\n\nPer quanto riguarda l'open source: La comunity degli utenti che usufruiscono o sviluppano software open source spesso ne fa una religione rifiutando qualsiasi cosa che non sia open source, rendendo di fatto la comunity tossica.\n\nPer quanto concerne la libertà di informazione: Concordo con te, però ha senso filtrare le notizie. Ricordo il tempo in cui tutti credevano che Danilo Bertazzi (Tonio Cartonio) fosse una pornostar morta in un incidente stradale dopo essere andato in overdose di qualche sostanza astrusa. A pensarci oggi mi viene da ridere, ma prima ci credevo pure!",
				"added": 1578088984
			}
		],
		"3_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 12,
				"body": "> [mindfeed32](#comment_6_1NQU5SkvHyS1qh4vwRFZUXju5Xe97kkvXT): Io andandoci ancora posso dire una cosa, sicuramente molti alunni non sanno che cos'è l'educazione ecc... , ma in molti casi (la maggior parte delle volte) i professori sono i primi a grattarsi i coglioni e a non tenere minimamente a bada gli alunni, poi alle udienze però si lamentano XD, mi fanno ridere.\n\nPure io ancora vado a scuola e non posso che darti ragione. Il bello è che se cerchi di far stare zitti i compagni perché magari sei l'unico che vuole fare lezione vieni pure preso per il culo! Comunque spesso i prof. non è che non gliene frega, proprio non riescono a contenerli gli alunni che, più passa il tempo, più diventano rumorosi e irrispettosi rendendo impossibile agli insegnanti di fare lezione (lo si vede soprattutto tra la 1 e la 3 media e dal primo al 3 superiore, dato che il biennio di superiori è un periodo di \"scrematura\")",
				"added": 1580228401
			},
			{
				"comment_id": 16,
				"body": "Nessuno è troppo vecchio fino a quando sa di cosa sta parlando. > [zeromed](#comment_1_1Fct94e4PRpnXyWzFi679369yUL6aKrsej): Sono troppo vecchio per dire la mia? :D\n> Parlando da laureato in medicina + specializzazione + anni passati a fare ricerca, le osservazioni che faccio sono le seguenti e valgono per tutti i livelli di istruzione:\n> manca quasi ovunque un'approccio pratico alle conoscenze teoriche che vengono insegnate (io dopo la laurea in medicina quasi non sapevo fare un'iniezione endovena...ho dovuto imparare in specialità dopo essere stato buttato \"allo sbaraglio\" ad assistere i pazienti...)\n> oggigiorno si va a scuola/università/master ecc... per avere il \"pezzo di carta che serve per lavorare\" e non per imparare. questo porta ad un sacco di conseguenze negative:\n> 1)nessuno si impegna nei corsi dove basta la \"sufficienza\" per raggiungere questo obiettivo (specie nelle scuole superiori e questo porta ad una formazione in media mediocre, con problemi anche da parte del mercato del lavoro nel ricercare personale qualificato)2)nei corsi dove \"i voti contano\" la competizione invece è spietata (e fatta anche di sgambetti e scappatoie più o meno lecite..) ma a nessuno interessa davvero imparare. L'importante è prendere o un 10 o un 30 anche a costo di imparare tutto a memoria e di non essere critici con ciò che viene insegnato (mai criticare chi ti valuta... :D ).3)CHI IMPARA A MEMORIA NON IMPARA AD IMPARARE! Quindi alla minima difficoltà il neolavoratore va in crisi! (e nelle difficoltà che spesso è necessario tirare fuori le palle ed apprendere nuove nozioni AUTONOMAMENTE, ma non c'è più il professore che ti spiega tutto...)4)\"se non fai quello che c'è scritto sul tuo titolo di studio sei un fallito!\" GRANDISSIMA CAZZATA!!! A parte forse i medici e gli ingegneri quasi nessun altro laureato fa quello per cui ha studiato! Saper fare tante cose diverse (ANCHE E SOPRATTUTTO FUORI DAL PROPRIO AMBITO) è invece la carta vincente per riuscire nella vita, che tutto è tranne che predeterminata! (oltre che per evitare di farsi sfruttare...ma di questo possiamo parlare in un altro topic dedicato al mondo del lavoro) Fare questo però richiede un metodo, un carattere ed abilità pratiche che la scuola  non insegna (volutamente? chi insegna potrebbe in futuro essere in competizione con i suoi studenti..), puntando invece all'iperspecializzazione. Inoltre saper collegare fra loro competenze in ambiti molto diversi può anche aprire opportunità lavorative precluse a chi è troppo settoriale.5)come già detto l'eccessivo nozionismo, come anche il fancazzismo che da un lato imperversa in molti corsi e la competizione spietata che c'è in altri, comportano che lo studente non solo apprende solo nozioni, ma non sviluppa altre abilità poi importanti nel mondo del lavoro come quelle relazionali, caratteriali e manageriali! (questo ha come conseguenza anche una politica nazionale disastrosa,...potremmo parlare anche di questo in un altro topic! :) )\n> Se volete potrei aprire anche altri topic simili pe quanto riguarda il mondo del lavoro e la ricerca scientifica. fatemi sapere! :)\n\nAprili se ti va, il discorso si fa proprio interessante!\nNon si è mai troppo vecchi o troppo giovani per parlare di qualcosa, basta che non vai ad esprimere opinioni e giudizi su cose che non sono di tua competenza",
				"added": 1581159967
			}
		],
		"4_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 14,
				"body": "> [mindfeed32](#comment_9_1NQU5SkvHyS1qh4vwRFZUXju5Xe97kkvXT): Di sicuro non ascoltate audio di Whatsapp o notizie a cazzo da Facebook, le cose non stanno magari migliorando tantissimo ma neanche peggiorando all'invero simile! Ricordatevi che solo perchè il corona virus viene dalla China, non tutti i cinesi sono infetti, quindi anche se ne vedete uno non dovete aver paura!!!\n\nOvviamente. Non è che i cinesi sono tutti infetti, e soprattutto non credo che serva evitarli se non vanno in cina da tempo. Purtroppo i razzisti per allontanare e discriminare certe etnie senza farlo in maniera esplicitamente razzista si attaccano ad altro come scusa, in questo caso il virus",
				"added": 1581155203
			},
			{
				"comment_id": 15,
				"body": "> [sinapse](#comment_4_1NstaJyYgXr8JTfXg6c5QRU9dZfWpmDC2E): si ... era gia conosciuto nel 2006 ... vi allego il documento https://www.eurosurveillance.org/upload/site-assets/imgs/2006%204%20v06n04.pdf\n\nGrazie del documento, lo leggerò sicuramente",
				"added": 1581155230
			},
			{
				"comment_id": 21,
				"body": "> [sinapse](#comment_14_1NstaJyYgXr8JTfXg6c5QRU9dZfWpmDC2E): https://coronavirus.app/\n\nGrazie",
				"added": 1582541346
			}
		],
		"2_1NstaJyYgXr8JTfXg6c5QRU9dZfWpmDC2E": [
			{
				"comment_id": 17,
				"body": "> [sinapse](#comment_9_1NstaJyYgXr8JTfXg6c5QRU9dZfWpmDC2E): mi metto in contatto con i dev... vediamo se posso dargli una mano per ios... ps: non serve il jailbreak per le app.. hai una cultura ridotta mi sa in merito... certificati dev, o appdb o rickpactor .... forse troppo complesso per uno che da questa risposta\n\nComunque non sarebbe male zeronet su iOs",
				"added": 1581182449
			}
		],
		"1_1Vy5x8HrbwRc2GM32GfZtpxdgoB5f34fd": [
			{
				"comment_id": 18,
				"body": "Mi servirebbe aumentare lo spazio disponibile.  Sono a 19.2K/20K.",
				"added": 1581361741
			},
			{
				"comment_id": 19,
				"body": "> [sinapse](#comment_12_1NstaJyYgXr8JTfXg6c5QRU9dZfWpmDC2E): in alto a sinistra su file lo stabilisci\n\nPotresti spiegarti meglio?",
				"added": 1581591931
			},
			{
				"comment_id": 20,
				"body": "> [sinapse](#comment_13_1NstaJyYgXr8JTfXg6c5QRU9dZfWpmDC2E): nel simbolo di zeronet nella pagina web il tasto statico trascinalo verso sinistra\n\nNon posso aumentarlo io",
				"added": 1582302392
			}
		]
	},
	"comment_vote": {
		"3_142nJGYDMdmmcS3ZkikFTzG3E1sXbyRCE4": 1,
		"1_14Wp2K6q5qzFthtEedPcytDmiDE7ZqrnEs": 1,
		"1_1BzkcHirfyvzrnnx3BF7w2dseb1dMakkTe": 1,
		"19_1NDdp5wQYRqdq2CeRVASnskd1EHkqS6RCQ": 1,
		"1_1BwpEuQZAvCqQaPqrPB4fS6PTfLRtx2PA6": 1,
		"1_1NiUtnfa3CxfXoL96DmjK5tjiNHGVJAHfG": 1,
		"3_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1,
		"2_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1,
		"5_17Zks611RR4oN8USC3RxJzaw94GyPufioG": 1,
		"21_1NDdp5wQYRqdq2CeRVASnskd1EHkqS6RCQ": 1,
		"22_1NDdp5wQYRqdq2CeRVASnskd1EHkqS6RCQ": 1,
		"6_1NQU5SkvHyS1qh4vwRFZUXju5Xe97kkvXT": 1,
		"7_1NQU5SkvHyS1qh4vwRFZUXju5Xe97kkvXT": 1,
		"8_1NQU5SkvHyS1qh4vwRFZUXju5Xe97kkvXT": 1,
		"9_1NQU5SkvHyS1qh4vwRFZUXju5Xe97kkvXT": 1,
		"4_1NstaJyYgXr8JTfXg6c5QRU9dZfWpmDC2E": 1,
		"4_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1,
		"1_1Fct94e4PRpnXyWzFi679369yUL6aKrsej": 1,
		"9_1NstaJyYgXr8JTfXg6c5QRU9dZfWpmDC2E": 1,
		"1_1ERFnM9hTKi9uf9BLAb4qY5DWPKpqi7w5n": 1,
		"14_1NstaJyYgXr8JTfXg6c5QRU9dZfWpmDC2E": 1
	}
}