{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "La chasse aux nœuds centraux et super-nodes (et autres problèmes de 0net…)",
			"body": "# Bonjour à tous,\n \nQuand j'ai entendu parlé de zeronet pour la première fois j'ai cru à un n-ième projet-jouet pas en état de fonctionner et qui ne changerait pas la face du monde. Pas de quoi détrôner mon chouchou ipfs, donc.\n\nJ'ai très vite constaté l'exact contraire. Jamais un logiciel de ce type (foss, p2p, en phase de dév intensif ) n'a été aussi simple à mettre en place. Je lance le .sh et tout marche parfaitement! Absolument incroyable! Plus simple que twister et beaucoup plus simple que de lancer un pod perso sur diaspora (j'imagine que les dev ruby sont à l'aise, mais alors moi, vraiment pas). Et ça ne fait pas que marcher, il y a de vrais services et utilisations possible dès maintenant! (mail, blog, forum, chat, wiki, etc.) Et l'utilisation de chacun des aspect de zeronet est simple et très agréable à utiliser. Absolument incroyable, j'ai été complètement ébloui.\n\nEt en plus le projet avait l'air de faire les choses biens. Entièrement décentralisé, p2p, libre avec license viral (oui, j'y tiens), on réinvente pas la blockchain, etc. Tout ce qu'il faut.\n\nDu coup, j'arrêtais pas de me dire, « Où est l'arnaque ? Où est l'arnaque ? » Y'en a forcément une. Et il a fallu du temps avant de l'identifier. À force de me renseigner et d'essayer de comprendre comment zeronet fonctionne. Effectivement zeronet marche bien, ce qui est une bonne chose on veut pas des hypothèses et des projets qui n'aboutissent pas, on veut tous des trucs qui fonctionnent. Seulement le hic, c'est que malgré le principe général d'un web p2p, zeronet accumule de nombreux défaut, notament que zeronet n'est pas totalement p2p. \n\n\nJe vous propose donc ce thread, pour lister tout ce qui ne va pas avec 0net selon moi et mérite d'être amélioré. Je préfère faire un thread ici plutôt qu'un article de blog car j'attends de vous que vous complétiez cette liste. (et aussi pour une meilleur visibilité :P ), il se pourrait que je copie colle dans un zeroblog plus tard…\n\n\n\n## 1) Les trackers.\n\nL'une des technologies principales sur laquelle repose zeronet est le protocole bittorrent (largement adapté, mais quand même). Et qui dit bittorrent, dit DHT ! Et bien non… On utilise des trackers. Si les trackers sont attaqués, tout le réseau est par terre, génial.\nC'est pas pire que syncthing qui se réserve le droit exclusif d'être le seul point central à permettre la découverte de pairs, mais c'est pas top non plus.\n\nC'est un point assez remarqué, je ne pense pas être le premier à en parler. Donc je ne vais pas m’étaler dessus.\n\n## 2) La résolution des .bit\n\nNamecoin est génial, n'est-ce pas? Pouvoir créer des domaines sans l'aide d'aucune autorité centrale, pouvoir résoudre des noms soit-même sans aucune aide. À moins que la résolution soit faite par quelqu'un d'autre à qui je suis censé faire confiance. Comme zeroname par exemple.\n\nZeroname va complètement à l'encontre de l'intérêt principal de namecoin. Oui une blockchain c'est chiant. Mais quitte à faire quelque chose de centralisé, autant complètement laisser tomber namecoin au lieu de prétendre faire du décentralisé alors que non.\n\nAlors oui, il y a un plugin, le prix à payer c'est d'avoir une blockchain en local, etc. Mais peu importe, ce qui importe, c'est le comportement par défaut. Si la blockchain c'est naze, alors faut trouver autre chose (ce truc peut-être: https://blockstack.org/docs/light-clients je connais pas assez bien pour juger). En tout pas il ne faut pas cacher la blockchain derrière un proxy centralisé, ça n'a aucun intérêt. Autant faire comme zeroid dans ce cas (j'y reviens après sur zeroid).\n\n\n\n## 3) Le zeromail\n\nZeromail, le mail décentralisé! Ou… Pas tant que ça? Okay, okay. Les données sont dans une base de donnée p2p, complètement décentralisé, chiffré de bout en bout, lisible uniquement par le destinataire. Pas de problème. Le problème c'est que zeromail.bit, c'est un site web. Décentralisé certes, mais site web tout de même. Avec un diffuseur unique, possesseur d'une clé privé unique, et seul capable de modifier le site. Pour un site web, c'est normal, c'est exactement comme ça que ça devrait marcher. Pour de l'email, c'est pas terrible.\n\nLe principe d'un email c'est que alice@zeromail.bit est capable d'envoyer un mail à bob@swagmail.bit. Or c'est pas possible du tout de faire ça. On peut cloner zeromail mais jamais les deux instances pourront communiquer ensemble. zeromail est seul fournisseur exclusif et c'est fort dommage. C'est pas des emails ça, c'est du Private Message chiffré de bout en bout sur un et un seul site web.\n\nZeromail devrait fonctionner comme la newsfeed (qui est un de mes coup de cœur de zeronet), de manière complètement indépendante du zérosite à partir duquel est issue le mail.\n\nÇa parait compliqué techniquement, mais faut trouver comment faire. Quoi que pas tant que ça. Il suffit qu'Alice enregistre le message dans la bd de swagmail.bitet pas celle de zeromail  (sans avoir à réellement visiter le site swagmail.bit ni quitter la jolie interface de zeromail.bit) et que bob écoute régulièrement ce qui se passe dessus en visitant le site ou avec la newsfeed. Ça, ce serait du mail.\n\n## 4) le zeroid\n\nProbablement ma plus grande déception. Pour commencer, pourquoi un seul service d'id central ?  \nPourquoi un seul service reconnu par défaut dans les zérosites pré-à-cloner de zeronet ?  \nPourquoi il ne fournit qu'un seul id par clé? et/ou plus de facilité à gérer du multi-clé ?\n\nUn id devrait être de la forme toto@site.bit, site.bit étant littéralement n'importe quel zérosite. C'est comme ça que openid fonctionne sur le clearweb, n'importe qui peut lancer son service d'id.\n\nEt ils sont tous accepté PAR DÉFAUT, même si tu créé un service openid rien que pour un seul id, il est reconnu partout. C'est pas parce que les zérosites sont décentralisé qu'il faut laisser tomber les principe de self-hosted. Le zeroid est géré uniquement par la team de zeronet, il peut être changé à n'importe quel moment et il n'y a aucune raison de faire confiance au possesseur unique de la clé privé. Et si aucun site n'accepte zeroverse, ça ne sert strictement à rien!\n\nZeronet a vraiment décidé de rendre le multi-user compliqué pour je ne sais quelle raison. Soit on uniquement le droit à un seul zeroid, soit faut changer d'utilisateur et on passe en mode open-proxy, càd, que l'on doit rentrer sa clé privé à chaque changement d'utilisateur. Y'a pas moyen de faire plus simple que ça? Changer entre zeroid1 et zeroid2 devrait être aussi simple que de choisir entre zeroid, zeroverse et l'id unique pour le site.\n\n\nEt on a même pas encore abordé le point le plus grave de zeroid. Il y a un vrai nœud central. Écrit en PHP. Le code source est libre, mais peut importe c'est un nœud distant et central. Il ne devrait pas exister c'est contre le principe de zeronet. Ça veut dire que la gestion des id qui est un point central utilisé par pratiquement tout les zérosites est géré de manière complètement centralisé par une seul équipe. Et pas moyen d'y réchapper avec un fournisseur alternatif car pas accepté par défaut. Le zeroid est un single point of faillure sur lequel TOUT, littéralement TOUT zeronet repose. Sans le serveur php de zeroid, plus rien ne fonctionne ! C'est absolument terrible !\n\n\n## 5) p2p or not p2p?\n\nLe dernier point pose un gros problème. Si zeroid possède un nœud central. Alors comment on fait pour savoir si un site est 100% p2p ou possède un nœud central. Si on visite zeroid, même en interdisant le crossdomain avec uMatrix on utilise quand même un nœud central. Ce qui veut dire que au sein même de zeronet il y a moyen de faire un zérosite utilisant un nœud cenral.\n\nComment on fait pour savoir si c'est le cas? Comment on le bloque?\n\n\n\n\nMalgré, tout cela il n'empêche que je suis très fortement intéressé par le projet. Aucun de ces points n'est insoluble. Et zeronet représente vraiment un des projet les plus avancé dans le domaine au coude à coude avec ipfs. Je souhaite vraiment que le projet fonctionne. Maintenant si vous aussi vous avez des reproches à faire à zeronet, ou à mon analyse, vous pouvez le faire dans le présent thread.",
			"added": 1458852834
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1_18ZfPCaU1pYAeos3A7YhZVgtsmXqXeRRW7": [
			{
				"comment_id": 1,
				"body": "Ça marche très bien et il y a tout un effort de fait sur la standardisation et la compatibilité avec les techno existantes (système de fichier unix, URI, ect.) ce qui veut dire qu'il sera plus facilement pris en charge, standardisé et reconnu comme un modèle à suivre. Ils travaillent avec un navigateur web (ils refusent de dire lequel…) pour une intégration native de ipfs par exemple.\n\n\nSeulement ipfs c'est du 100% statique. Ça peut distribuer du html, des images ou du js. Pour ta base de donnée distribué soit tu l'implémente toi même en js, soit tu t'en passes. De même, pas de zéroid ou service du genre.\n\n\nÉgalement, c'est moins isolé, dans le sens ou un zérosite utilise que des ressource de zéronet à priori. Alors que mélange http et ipfs parait tout à fait envisageable. Donc faire un site web centralisé normal, avec seulement les images fournis par ipfs. Ce qui ne résout pas trop le problème actuel du web…",
				"added": 1458854081
			},
			{
				"comment_id": 3,
				"body": "> [wildtruc](#comment_5_1BUg3Eu6SdBrVKNtVJJgQptFas5XCYqEUF): Tu devrais peut être entrer directement en contact avec le DEV ou poster sur le talk global. Hélas, trad en anglais obligatoire.Tu as noté que syncthing avait un tracker central, mais tu oublies que tu peux créer ton propre tracker avec.discoserv.Peut être un concept à adapter à 0net.\n\nL'anglais, n'est pas un problème, je devrais peut-être faire ça tu as raison.\n\nPour ce qui est de syncthing, il faut placer les utilisateurs avant tout. Seul compte le comportement PAR DÉFAUT. Et PAR DÉFAUT, c'est un tracker centralisé.\n\n> [up4](#comment_3_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz): salut ! bravo pour ce post . quelques pistes:\n> 1) https://github.com/HelloZeroNet/ZeroNet/issues/572) https://github.com/HelloZeroNet/ZeroNet/issues/4073) il y a des alternatives comme mail.zeroverse.bit qui font du progrès à ce niveau-là mais ce n'est pas la responsabilité de ZeroNet en tant que plateforme de fournir un système intégré de messagerie4) ZeroNet ne repose pas sur ZeroID du tout (zeroverse.bit est un clone et mail.zeroverse.bit permet l'interaction entre les ids zeroverse et zeroid)\n\nTout d'abord, merci. J'ai écrit mon ressentie comme ça m'est venu, je suis content que des gens apprécient.\n1) Très content de voir que le problème est pris en compte\n2) Un plugin, c'est pas le comportement par défaut, donc on s'en fiche. Ce qui compte c'est l'ensemble ou du moins une grande majorité des utilisateurs, on s'en fiche que toi en particulier tu ais une solution si tout le monde dans le réseau n'en profite pas.\nEt une block-chain c'est très lourd je comprends parfaitement que ce ne soit pas le comportement par défaut, il faudrait trouver autre chose… Une solution DHT, abandonner complètement les urls simples et se contenter de longues chaines de caractère illisibles. (Tor à fait ce choix avec les services cachés en .onion.) J'ai pas la solution miracle, mais ça reste incontestablement un des points noir de zeronet.\n3) Si, c'est de la responsabilité de Zeronet. Ils fournissent déjà un système de mail \"officiel\", si cette solution n'est pas idéale et qu'ils ne proposent rien de meilleur, alors c'est complètement de leur faute. Ils ont une position dominante en temps de développeurs du réseaux et orientent la grande majorité des utilisateurs à utiliser les services qu'ils proposent, il est normal d'exiger le maximum de ces services et de les critiquer s'ils sont mauvais.\n4) Les zeroID sont acceptés par défaut, les Zeroverse non. Y'a rien à ajouter. Je pourrais toujours me connecter avec un zeroID parce que c'est l'ID \"officiel\" accepté par défaut quand on clone une des applications \"officielles\". Et ce serait absolument crétin d'interdire les zeroID sur son zeroSite. Alors qu'avec un zeroVerse je serais emmerdé en permanence. Je ne PEUX PAS utiliser zeronet sans un zeroID, j'aurais jamais accès à l'ensemble des fonctionnalités, tôt ou tard je serais amené à faire quelque chose qui requiert un zeroID. C'est un élément central de zeronet et absolument incontournable.\nDe plus il suffit pas qu'il y ait UNE alternative, il faudrait que TOUS les services d'ID soient acceptés par défaut sans discrimination. Comme OpenID. On se fiche que qui fourni l'ID, ce qui compte c'est que ce soit authentifié. Rien n'empêche de créer un nouveau service d'openId pour un seul ID. Ça devrait être pareil sur zeronet, je devrais pouvoir lancer un nouveau service d'ID, rien que pour moi et je devrais être accepté partout.\n\n> [dalboz](#comment_3_1KZ3SggfHpNWf9Z4Af9kGRm2pUZGNg7oj6): pour les courriels, lance un site implémentant ce qu'il faut et on l'utilisera =)\n\nÇa, c'est une des réactions que je déteste le plus dans l'open-source. C'est un discours de développeur à des développeurs. Qui en ont rien à foutre des simples utilisateurs.\n\"Ah, bah si c'est pas comme tu veux, t'as qu'à l'implémenter toi-même, c'est open-source.\" C'est pas parce que c'est open-source que j'ai pas le droit de me plaindre et d'exiger des choses. Et c'est pas parce que ça ne me convient pas que c'est à moi de le faire. D'autant plus que ce que je ferais ne sera jamais \"officiel\" et n'aura jamais l'impact d'un changement apporté par l'équipe de dev, officiel.\n\nJe veux pas vous faire de peine, mais votre zeroverse, c'est bien, mais concrètement personne ne va l'utiliser. Je peux implémenter bettermail.bit (bon c'est peut-être aller vite en besogne, sans vouloir minimiser mes capacités informatique…), mais tant que zeromail existe, ça sert à rien. Les gens continueront d'utiliser les zeromail et les deux ne seront même pas compatibles entre eux. Il suffit pas de faire une alternative, il faut que ce soit bien implémenté, dès le début.",
				"added": 1459718658
			},
			{
				"comment_id": 4,
				"body": "> [up4](#comment_4_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz): [...]\n\nÉvidement qu'ils font ce qu'ils veulent mais c'est dans leur intérêt d'écouter le critiques. \nCe qui m'agace c'est la réaction reflex de \"t'as qu'à le faire toi-même\" alors que tu n'as aucune idée de si j'en ai la capacité et que même si j'en avais la capacité, mon alternative n'aura que très peu d'impact par rapport au comportement par défaut de zéronet.\n\n\n> [erkan](#comment_1_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): [...]\n\nJe viens de traduire le thread sur le zerotalk international. Dis-moi comment j'aurais pu faire ça sans zeroid.\n\nJ'apprécie vraiment l'initiative. Sincèrement. Bravo pour avoir lancer ça.\n\nMais si l'équipe de zeronet décide de favoriser zeroid, alors le zeroid sera quasi-obligatoire. Et actuellement avoir un zeroid est quasi-obligatoire pour utiliser zeronet. \n\nC'est en effet très facile d'accepter zeroverse sur son blog perso (je l'ai fait déjà sur un blog que je n'ai pas publié). Mais en revanche c'est très difficile de poster des commentaires sur les blogs des autres sans zeroid. Parce que les autres ont juste cloné un zeroblog et en ont juste rien à faire de comment ça marche*. \n\nEt c'est normal comme ça, c'est pas à nous de faire campagne d'éducation pour dire à tout le monde \"oui, mais ce serait mieux que tu accepte les id zeroverse parce que zeroid c'est pas top\". Il faudrait que par défaut, quand on clone un zeroblog, zeroverse soit accepté (et pas seulement zeroverse, mais n'importe quel fournisseur d'id). Comme ça à la fois on est accepté, et à la fois le mec qui s'est fait son blog n'a pas besoin de se poser la question de comment ça marche. On ne construira jamais d'alternative viable s'il faut que les utilisateurs ait quoi que ce soit de technique à faire. Lancer un .sh et cliquer sur \"cloner\" c'est le maximum que tu peux exiger d'un utilisateur si tu veux que ton réseau devienne mainstream.\n\nLe fait que zeroverse soit accepté sur 7 sites, c'est très très bien. Félicitation. Mais je suis encore refusé sur beaucoup beaucoup plus que 7 sites. Alors qu'avec zeroid je suis accepté partout. Littéralement partout. Personne ne bloque zeroid, parce que ce serait la chose la plus stupide du monde.\n\n\n*: Moi y compris, je m'interesse aux grandes lignes de zeronet pour savoir s'ils font les choses comme il faut. Mais je m'en fiche des détail, j'ai pas l'intention de contribuer au projet.",
				"added": 1459782549
			},
			{
				"comment_id": 5,
				"body": "Oui très jeune. Et aucun des ces défauts n'est un énorme handicap. Zeronet reste un excellent projet.",
				"added": 1459903055
			}
		],
		"1_1KbaV4qD9rF6rXuT2aenytf2jhhD8UWqSR": [
			{
				"comment_id": 2,
				"body": "Le plus gros problème avec Play, c'est que l'on peut pas ajouter soit même des torrent. C'est géré par probablement une seule personne (est-ce qu'on a la moindre information sur l'admin de Play?) ou en tout cas de manière très centralisé et en plus les torrent sont copié collé d'un autre site de torrent (rarbg.to). Si on fait la même chose en Français. Copier coller les torrents de t411 avec un seul mainteneur pour le site, ça n'a pas un grand intérêt. L'intérêt serait qu'à terme on ait plus de torrent que t411 pour privilégier le service décentralisé à celui centralisé. Et surtout… qu'il soit vraiment décentralisé.\n\nLe bon point de Play en revanche, c'est de trier les torrent par film et d'en proposer un nombre très limité par film. À-là popcorn. Au lieu de faire une liste par torrent avec 350 version différentes du même film… Ce qui est génial. Mais en revanche c'est très compliqué à atteindre avec une communauté. Faut s'entendre sur le format vidéo, sur les résolutions et la qualité d'image, etc.\n\n\nDernier point: Aucun site n'est in-clonable sur zeronet. Il manquera toute la partie back-end. Mais Play, on l'a tous téléchargé, il est sur chacun de nos disque dur.",
				"added": 1459030815
			}
		]
	},
	"comment_vote": {
		"6_1BUg3Eu6SdBrVKNtVJJgQptFas5XCYqEUF": 1
	}
}