{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1597871943,
			"title": "How to set no proxy for value TOR 9.5.x",
			"body": "Hello,\n\nCan someone please explain how to set the 'no proxy for' value in TOR v9.5.3 or offer instructions to enable access to ZeroNet via the TOR browser please?\n\nClean install of ZeroNet 0.7.1 and TOR 9.5.3 32bit running on WIN10 Pro 64bit.\n\nFor anyone else looking for the answer in the TOR address bar type 'about:config' then search for 'network.proxy.no_proxies_on' then enter 127.0.0.1 as the value.",
			"added": 1597871942
		},
		{
			"topic_id": 1610660211,
			"title": "Would a fusion of inrupt and ZeroNet be worth thinking about?",
			"body": "I'm not a developer/coder beyond some poking about 'n cut & paste, so I have no idea if this would be worthy of consideration or not?\n\nWould it be possible to combine something like the https://inrupt.com UI and Services with the  ZeroNet platform?\n\nThe issue with Inrupt is the cloud hosted pod and single sign-on concept. \n\nI haven't really given it much thought, but Inrupt seems like a pretty useful with some good features. Having a cloud based pod with a single sign-on has obvious drawbacks, with respect to privacy/anonymity etc. It is also reliant on clearnet service such as dns etc.\n\nInrupt on the ZeroNet platform seems like an appealing concept to me from a user/content creator perspective.\n\nCrazy idea or worthy of more thought?",
			"added": 1610660209
		},
		{
			"topic_id": 1612718054,
			"title": "The Fourth Industrial Revolution and the Global Technocratic Takeover w/ Alison McDowell",
			"body": "**Alison McDowell** is a mother and dedicated researcher studying the working parts of the World Economic Forum's declared \"Fourth Industrial Revolution\" and the global takeover of industries and public policies by the central banks, multinational corporations, big tech technocrats and billionaire funded foundations.\n\n[The 4th Industrial Revolution and the Global Technocratic Takeover w Alison McDowell, Part 1](https://www.bitchute.com/video/9vAAyyDSCV1Y/)\n\n[Play list 1 to 5](https://www.bitchute.com/search/?query=the%204th%20industrial%20revolution%20and%20the%20global%20technocratic%20takeover%20w/%20alison%20mcdowell%20part&kind=video)",
			"added": 1612718051
		},
		{
			"topic_id": 1613921466,
			"title": "Possibly one of the most important books you will ever read",
			"body": "brain-washing-a-synthesis-of-the-russian-text-book-on-psychopolitics-charles-stickley-1959.pdf\n\nOriginal Scan version - IPFS: [brain-washing-a-synthesis-of-the-russian-text-book-on-psychopolitics-charles-stickley-1959.pdf](https://ipfs.io/ipfs/QmXAsVT9v2hAPENFsnHztf81vTWTrYgFWqLgMtmwv8jhLd?filename=brain-washing-a-synthesis-of-the-russian-text-book-on-psychopolitics-charles-stickley-1959.pdf)\n\nArchive.org: [Brain Washing A Synthesis Of The Russian Text Book On Psychopolitics Charles Stickley 63pgs 1959 EDU.sml : Free Download, Borrow, and Streaming : Internet Archive](https://archive.org/details/BrainWashingASynthesisOfTheRussianTextBookOnPsychopoliticsCharlesStickley63pgs1959EDU.sml)\n\nFormatted PDF version - IPFS: [brain-washing.pdf](https://ipfs.io/ipfs/QmeQU3RtdZxRkSFQ4fvD7JH3Ux9iE7YJmLP7q6YJ8RPWcV?filename=brain-washing.pdf)\n\nFormatted PDF - Clearnet: [Brainwashing](https://resist.com/Onlinebooks/Brainwashing.pdf)",
			"added": 1613921462
		}
	],
	"topic_vote": {
		"1598113485_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1610636215_1NmKMF3LcKAxo5mCnGY1pctz343nW5Sxb3": 1,
		"1611260804_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"1612546234_1Phd1v4EgBWqCeAjGD7gtspkpFL8Z6GbkP": 1,
		"1612720158_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"1612927209_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1
	},
	"next_comment_id": 43,
	"comment": {
		"1597871943_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt": [
			{
				"comment_id": 1,
				"body": "Never mind I found it in the end.\n\nFor anyone else looking for the answer in the TOR address bar type 'about:config' then search for 'network.proxy.no_proxies_on' then enter 127.0.0.1 as the value.",
				"added": 1597872882
			},
			{
				"comment_id": 4,
				"body": "> [uguser](#comment_1_19uVurrULGprDqivWTWDQZykLKmnHNzXwy): network.proxy.allow_hijacking_localhost to false\n\nCare to explain? Thanks in advance.",
				"added": 1597893809
			},
			{
				"comment_id": 5,
				"body": "Thank you both for your input.\n\nThe 'network.proxy.no_proxies_on' seems to be working for me so far at least.",
				"added": 1597930346
			}
		],
		"1597510687_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": [
			{
				"comment_id": 2,
				"body": "> [stopjoggersnow](#comment_4_1JR6zGbCYKJZhN7tvc5qZqnFDgG7wAt8nC): Imagine being this retarded.\n\nHow is getting it out there to millions of people retarded? YT is a steaming pile if shit but that's where the eyeballs are. I pulled my local copy from YT from the originating channel, as did many others. It had in excess of a million views before it was taken down, and the people who pulled it re-uploaded it on multiple platforms as well as YT, including translations. YT served a purpose by initially seeding the file and millions of views which is hardly retarded!",
				"added": 1597883999
			},
			{
				"comment_id": 3,
				"body": "> [itspecialist876](#comment_12_1NyRWK8Lnvfh58CyJhq1tAXpSr9XXhdLwG): Plandemic II is what you guys should be watching. It gives insight into what is going on now. Fake news can be used to discredit people who are \"woke\" or to confuse the masses so that they no longer care and just do their own thing.\n\nPlandemic is something that needs attention, but it's just part of a much bigger picture. ShadowGate is important because it's a core component used to manage the narrative of the Plandemic and much more besides.",
				"added": 1597888547
			}
		],
		"1601932131_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": [
			{
				"comment_id": 6,
				"body": "Communism is Catholic Doctrine - Walter Veith\n\nhttps://www.hooktube.com/watch?v=oBwCbplYcP8\n\nWalter Veith is a Seven Day Adventist, but don't let that get in the way of the message and evidence he is presenting. After watching this presentation current events should make a bit more sense.",
				"added": 1602492747
			}
		],
		"1602257402_1abBjBW8axFAtcZN11jv527Wi2noBZurv": [
			{
				"comment_id": 7,
				"body": "There is nowhere to escape to, and if it seems you have found somewhere it will eventually be consumed. There is no point trying to run and hide, we all need to draw a line in the sand and fight together against tyranny. All it takes for evil to thrive is for good men to do nothing.",
				"added": 1602493301
			}
		],
		"1602918342_1BKJiQF8pvdQw99D1XpTG2UJ6eno1zFPCK": [
			{
				"comment_id": 8,
				"body": "binary makes some good points but neglected to mention some major factors such as the markets are rigged and manipulated. No matter how smart you are unless you're an insider or top man in a major fund you will never have the edge.\n\nStay well clear of any derivatives markets because that is nothing short of a Ponzi scheme the likes of which has never been seen before. When that bubble finally bursts the markets will crash 'n burn imho. No one even knows the real value of the derivatives exposure. \n\nIt would probably be a much smarter move to invest in tangible physical assets which have a real world value. Physical precious metals are an option, but you can think outside the box and go for commodities like high end Whisky for example. The problem is the cost/access to secure storage, especially for a container load of Whisky etc. If property is affordable then buying commercial property or a domestic property with a secure barn or two wculd also be an investment.\n\nBuying a property with a few acres that can sustain basic crop and livestock production should be first on the list, as an investment, as a home and a means to sustain ones self and family.\n\nInvestments in expanding your personal knowledge and piratical skills would also be a wise decision imho.\n\nInvesting in your local community is also something to consider. If your neighbors and community are strong everyone benefits in the long term.\n\nPick investments which have as little interaction with authorities and governments as possible. Much easier said than done unfortunately.\n\nInvest in your health and wellbeing; spiritually, mentally and physically. Spiritually doesn't mean following an organised region,  bible or faith. Imho it means establishing your own understanding of the reality you live in, based on knowledge from as many different sources as you can find. It can be very time consuming, but knowing where and who you are allows you to make much better life choices in all asespects of your life.\n\nI doubt that much of that is anything like the advice you're looking for or expecting. Hopefully you will give some of it some thought, and you manage to find a nougat of wisdom buried in there somewhere, that benefits you.\n\nThe world is in turmoil right now under the direction of the insiders. There will be massive transfers of wealth, market collapses, food shortages and much more over the coming months/years. The world will be a very different place going forward. ",
				"added": 1602974703
			}
		],
		"1610501785_12BSeHrHaz9gyid4AFkYdFYRcmFsSQkGAN": [
			{
				"comment_id": 9,
				"body": "Maybe it has something to do with the level of retarded posts? Nofish not increasing data limits may also be a factor? Once people hit the limit they are done and move on killing any chance of meaningful engagement. Sure they can delet older posts or create a new account but who is going to bother with that nonsense.",
				"added": 1610609255
			},
			{
				"comment_id": 11,
				"body": "Unfortunately global search as in an indexed  search engine isn't an option which sucks big time. There are a few directory sites but most are poorly maintained, if they are maintained at all. None worthy of note spring to mind right now.  No doubt someone will post a link for you shortly. \n\nThe best approach would be to create your own content and encourage people to visit your zite.\n\nYou will find ZeroNet is somewhat limited by comparison to the clearnet, but it does have it's strengths which the clearnet cant offer. At the very least it offers a relatively robust fallback position for when the shtf.",
				"added": 1610612284
			},
			{
				"comment_id": 17,
				"body": "3) ZeroNet is a great platform to archive content which will potentially be memory holed on the clear net.\n\nZN could function reasonably well as a reddit alternative, although scaling would probably be the biggest issue if it attracted significant numbers of users. \n\nGAB can be a bit patchy at peek times for sure. As you say the GAB team are doing a great job under the circumstances.",
				"added": 1610645956
			}
		],
		"1610601117_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 10,
				"body": "Instead of posting all this shit that shows your ignorance why not read up on some real history? Not the shit history and bs they indoctrinated you with as part of your implied privileged education and intellectual superiority! Maybe then you could understand why the people in NZ don't see it as a left right issue. The situation we face has nothing to do with Trump as a character, it's about the fall of America, and the implications that has on western civilisation as we knew it. Wake the fuck up!\n\nAs for that shit about being scared of walking the earth on our own blar fucking blar...I doubt you will be prepared for what is coming. Good fucking luck with that.\n\nAnd for the record I'm more than happy to go it alone, and the main reason for that is to avoid being dragged down by ignorant retards.",
				"added": 1610610506
			}
		],
		"1610394057_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 12,
				"body": "> [nq8](#comment_1_1BfSkii33q8CigGRGQaae1kG3CgeJBd8NN): I always wondered where this mysterious \"Antifa Network\" was... Not even on most the socialists or anarchists boards... Sophisticated terrorists to be sure. I guess all through Signal? Gimme a break.  [...]\n\nMaybe this will give you a clue about how they organise https://www.millennialmillie.com/?wix-vod-video-id=a4ba9026c185447d96c6af6c1581e029&wix-vod-comp-id=comp-jx9p57yh Zoom seems to be their preferred communication system. You can watch them discuss tactics in that documentary.  ",
				"added": 1610613048
			},
			{
				"comment_id": 13,
				"body": "> [jager](#comment_12_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX): Antifa had a network? Where are researchers analyzing the data?\n\nThis might help answer your question https://www.millennialmillie.com/?wix-vod-video-id=a4ba9026c185447d96c6af6c1581e029&wix-vod-comp-id=comp-jx9p57yh they are being monitored but as you will see government employees are actively involved. It should be obvious by now that the FBI and LEO aren't interested in rounding up useful idiots, while they are serving the agenda. Independent researchers have to infiltrate their networks to do any meaningful research and expose them. None of the major tech platforms or MSM will allow the content to reach the wider public awareness.",
				"added": 1610614717
			},
			{
				"comment_id": 16,
				"body": "> [nq8](#comment_5_1BfSkii33q8CigGRGQaae1kG3CgeJBd8NN): interesting. thanks for the link, ill check it out. Do you feel a purposeful leeway granted via chinese run tech COs for socialist leaning organizations?\n\nIt's a good video because it gives an insight into the world of the extremists directly from their own mouths. Slam dunk.\n\nWith respect to your question, the answer should be obvious to anyone with the ability to think rationally. It's hard to argue against observable reality. Although the current Orwellian system would have the unwitting believe otherwise.",
				"added": 1610645051
			}
		],
		"1610487411_1Etm6vDz6ED5oGHsXGFpCDb3PNw8shgdx": [
			{
				"comment_id": 14,
				"body": "Why is oil running out? It's Abiotic ffs! Do some proper research on the subject - as in don't swallow the bs from the top google results and wiki fucking pedia. Of course you can suck up the bs about oil being a product of compressed forests and dinosaur bones if you like being deceived. Why do dry well'a get brought back into production? Maybe the Russians figured out the answer to that one?",
				"added": 1610616821
			}
		],
		"1610527542_1NmKMF3LcKAxo5mCnGY1pctz343nW5Sxb3": [
			{
				"comment_id": 15,
				"body": "> [quantumkitty](#comment_534_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): It should go without saying.. we don't live in the 20th century anymore.\n\nWow, in that other thread you were implying that you are some sort of well educated intellectual genius or some shit, while everything you post seems to suggest that's not in fact the case. Iirc you were ridiculing New Zealanders in that thread also. \n\nMaybe English isn't your first language? In which case you maybe excused for making such a retarded comment, due to your failure to read and comprehend that which you mistakenly deride...\"The 20th Century gave us the right-wing totalitarianism...\" Here's a clue 'gave' sets the past tense of that sentence. Further contextual and tense clues can be found here  \"But the 21st Century has given us a new, centrist form of totalitarianism...\" Pay attention to the use of 'has' 'given' and 'new' all of which help the reader establish the correct tense being conveyed in the overall text.\n\nClearly the opening sets the narrative of past events which occurred in the 20th century, while the later brings us to the present in the 21st century. Nowhere does the text suggest the reader should assume the 20th century is the present.",
				"added": 1610644132
			}
		],
		"1610655097_13M48m7JiB46SYQ2HHe6E4MHELZ5YUN7hr": [
			{
				"comment_id": 18,
				"body": "Go to configuration and paste this line  \"zero://trackd5xiih3z7xyvvkyz2n65lehqziayjpxzsau3mwccwlelxrdrgid.onion:15442\" at the end of the list in Trackers\nDiscover new peers using these addresses.\n\nThen paste this line \"{datadir}/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/cache/1/_h.html\" into the Trackers files\nLoad additional list of torrent trackers dynamically, from a file field.\n\nWithout the quotes and restart ZeroNet.",
				"added": 1610657419
			}
		],
		"1610656322_1Mn2C722jSxg6Fj7bf6oDYGZMnYdJy31tZ": [
			{
				"comment_id": 19,
				"body": "Germany needs to restore the Weimar Republic, and charge those treasonous politicians serving the current government of occupation for the crimes they have committed against the German people for the past 75 years.",
				"added": 1610661372
			},
			{
				"comment_id": 20,
				"body": "You need to restore your Republic and it's common law principles. Democracy is a dead end and brings you to where you are now. That's why they removed your Republic and introduced a more codified legal system, when they established the unlawful government of occupation.",
				"added": 1610662246
			}
		],
		"1611277411_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 21,
				"body": "> [qzm](#comment_9_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX): Too late to stop it\n\nOnly if you choose to stay on your knees. And if that's the case get the fuck out of the way, because you are part of the problem!",
				"added": 1611279403
			},
			{
				"comment_id": 22,
				"body": "> [bangdingow](#comment_6_1EwabPQmNENzxMLaZY3Kh956Rpoa8QY6n6): So whats the plan amigo?\n\nDo whatever you can, and if you cant do anything constructive get the fuck out of the way of those trying to make a difference. If your in the US there is an army of 80 million like minded folk to join and be proactive with. Restore the American republic as it was intended to be ... by the people for the people. For Europeans tear the EU down and establish republics in your nation. Above all never bend the knee to tyranny, because that never ends well for anyone, as history has proven time and time again.",
				"added": 1611284756
			},
			{
				"comment_id": 23,
				"body": "Here's a big picture view of what's coming and some of the traps that are being set after the Biden nonsense https://seed307.bitchute.com/bP3dpZbbNrzw/nIP0XKNCJNdf.mp4\n\nThey need the US divided and they have set that up over the past couple of years. The red States shouldn't go the secession route, because that's what they want them to do. Red States need to turn the blue states red again! That's why they went all out to overturn the 2020 election. America can never be allowed to become great again, it's simply not part of the plan. \n\nhttps://www.timesofisrael.com/intel-reportedly-delaying-massive-new-chip-plant-in-israel/\n\nBoycott Israel. Why are they creating laws to prevent anyone calling boycotts against Israel? What did international Jewry do to Germany in 1933?  http://entityart.co.uk/wp-content/uploads/2018/05/judea-declares-war-1933-ww2-international-jewry-germany-jews-shpn.png",
				"added": 1611304470
			},
			{
				"comment_id": 25,
				"body": "> [quantumkitty](#comment_572_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): https://www.youtube.com/watch?v=SR3jyhIK_kE [...]\n\nYou clearly didn't watch the video in the first link did you? (Rhetorical)\n\nYou really should stop and think before posting.",
				"added": 1611309279
			},
			{
				"comment_id": 26,
				"body": "> [quantumkitty](#comment_573_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): You didn't watch mine, either! [...]\n\nIf you had watched the video you would understand why your comment was superfluous. I'm fully aware of the Trump Israel connections, which includes the influence of his son-in-law. Trump also received a Jesuit education and Rome has interests in Israel as does the City of London. If you had watched the video you might have joined some dots. You keep spamming the board with pointless nonsense. You are making yourself appear foolish!\n\n> [zeronova](#comment_2_1GhJcGjryaQ8s6CL5vraeUd15TiXCvY9m2): I haven't watched the video but the earth could do with a few million people being taken away to help with global warming\n\nDon't believe the bs. Please explain how an anthropogenic contribution of Co2 of 0.04% is in the least bit significant (assuming you have a rudimentary understanding of percentages)? Co2 is a primary element and the building block of life. Anthropogenic climate narrative is flawed and based on corrupt science, and you don't need to be a fucking scientist to grasp that simple fact.\n\nAs for your genocidal demographics argument, you have been deceived in order to establish genocide/democide as an acceptable solution in your mind (it worked). Watch this and digest what is being stated, and then apply that information to the world around. you. Bear in mind that this documentary was made in 2008  https://www.youtube.com/watch?v=lZeyYIsGdAA \n\n> [bangdingow](#comment_8_1EwabPQmNENzxMLaZY3Kh956Rpoa8QY6n6): Interesting. Not sure how we would turn blue states red with the demographic change in the US but I get where you are coming from. I think a lot of people who are pro balkinization think that once they secede all of the issues will be over, which is ridiculous. They will not stop hating you or wanting you dead just because you are not technically part of the country. I know black pills are not helpful but neither is not recognizing the situation we are in. IDK Glad someone is fired up tho...\n\nThere isn't another viable solution if American's want to regain their republic and freedoms. Secession/balkanization   is playing directly into the hands of the communists. As you say the divisions will remain under balkanization...divide a rule is the tool of tyrants. The video explains that secession is to all intents and purposes a trap. \n\n> [qzm](#comment_11_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX): And it’s funny how Trump was always willing to acknowledge the Jews that helped get him elected, but he was never interested in explicitly acknowledge in the single largest demographic base in America that actually got him elected.\n\nYou obviously never listened to any of the speeches he gave at his rallies. If you had you wouldn't make such a blatantly false statement.\n\n> [qzm](#comment_10_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX): At this point I am as prepared as I possibly can be given everything that is going on. Mainly, I’m just concerned about all these conservative right wing types that think that they are somehow going to avert what is coming. The fact is that the great reset is set in stone at this point, and it’s totally irreversible. I liken it to a more technocratic version of what the Soviets did in Russia, it came, it destroyed, eventually it fizzled out. But these cycles are inevitable. The Trump crowd, and the Q people Thought that they could throw a wrench in it and maybe stop it, but that’s clearly unrealistic given the sheer amount of money and control behind it.People need to stop thinking that they are going to revolt, or the that is even a possibility. Rather, they should be thinking about how they’re going to survive the next 20 years at least. As sad as it is most reasonable, brave, individualistic people are going to be either snuffed out or else ideologically broken within the next couple of decades in America. Moreover, the plan should be to survive, escape if possible, and do not be fooled into believing you can revolt.\n\nNothing is set in stone unless you're a powerless defeatist. If the technology we have today existed seventy years ago  the soviet state would have used it to create the technocratic form of communism we see manifesting today. Not sure what gives you the impression it fizzled out? It hasn't fizzled out it has evolved. No the cycles aren't inevitable they are engineered - it's by design.\n\nI don't trust Trump or anyone else in positions of power and influence. Having said that it is a matter of record that Trump signed executive orders which facilitate the reformation of the Republic as it was intended. Those EO's empower the people if they understand how to use them. He also established EO's which allow the seizure of assets from individuals and corporations engaged in crimes of sedition and treason against America. They have all the evidence they need against all the players involved, both domestic and foreign. Money isn't the issue when the money was obtained and used in criminal activity. The wealth was originally stolen from the people, regardless of their political leaning. \n\nWho are you to tell people that they should stop thinking of revolt? Just because you're a snivelling coward doesn't mean everyone else should be cowardly rats. If you think revolt isn't even possible then you clearly have zero knowledge of history. Revolt can take many forms and generally governments are the ones who resort to violence first, not the people. The American constitution and lawful process gives the people the means to revolt peacefully. The problem is the criminals do not respect the constitution or due process of law. And they will use violence to prevent the people from using peaceful means of change, once the people have exhausted all lawful avenues.\n\nYou should study the soviet system in order to understand that surviving under tyranny isn't a sustainable or healthy way to live. We all have a choice whether or not to aspire to living a meaningful life or a life of meaningless conformity and submission. Out of eighty million American Trump supporters there will be a significant number which will not bend the knee. They are the people who understand what is at stake for the future of their families and neighbors. They are the ones who understand that self preservation isn't the answer to the problem. That's why those people become the primary target of an oppressive tyrannical regime, as they present a real threat to the system. The rats and cowards are passive and weak, which means they can be eliminated over time with little or  no resistance. In this technocratic age there will be nowhere for self preserving cowards to hide from what's planned for them. Do you really expect a tyrannical regime to respect low life scum who aren't even willing to stand and defend themselves? Look at history!\n\nYou are only fooling yourself if you think hiding and capitulating is a viable long term survival stratify. Not only will the system hate you, your family and neighbours will despise you. Worst of all you will despise yourself!\n\nTalk to folk from the old soviet countries, and see what they have to say about living under those conditions, and how it effects the lives of families and communities.\n\nIf you want to live and die on your knees that's your choice. Quite frankly you're not the type strong communities need in order to prosper and thrive. I hear they have some nice new vaccines for your type.\n\nHere's an ex-KGB defector explaining how things work under communism https://www.bitchute.com/video/MPPq2RvF0bkw/",
				"added": 1611349602
			}
		],
		"1611289983_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH": [
			{
				"comment_id": 24,
				"body": "I think Obummer fag would beg to differ https://rumble.com/vbwp2h-obama-puppet-master-.html",
				"added": 1611307796
			}
		],
		"1611909944_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 27,
				"body": "It's not a vaccine by any medical science definition, it's a science experiment to weed out the weak minded and feeble elements of society. Hopefully they have enough to go around for all those who want to be lab rats. Any sane healthy individual would take their chances given the 98.5% survival rate!\n\nhttps://www.bitchute.com/video/eastUGIO7EgY/",
				"added": 1611912088
			},
			{
				"comment_id": 30,
				"body": "> [zeroseed4](#comment_36_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N): The only way to integrate RNA in the human genome Is to use and enzyme called reverse transcriptase that convert It in dna.  You can find these enzyme only in retrovirus Like HIV . There Is no possibility that mRNA can integrate in the genome without this Enzyme that Lacks in humans. Nornally mRNA Is degraded After proteine syntesys when the and poly a final chain Is dedtroyed\n\nIt is not a vaccine by any scientific medical definition period! https://www.bitchute.com/video/2blwwQAz9rFo/",
				"added": 1611961514
			},
			{
				"comment_id": 31,
				"body": "If you need to ask who set the definitions you clearly haven't check the definitions yourself. Rather than me reinventing the wheel why don't you watch this and then validate the claims for yourself, or do you need to be spoon feed? https://www.bitchute.com/video/2blwwQAz9rFo/\n\nI don't follow any leaders and I sure as hell don't buy into false dialectics such as a false two party system. I prefer the Socratic method to weed out the bullshit/fact from fiction.\n\nI'm also not stupid enough to accept an experimental DNA altering drug! There is no detoxing that shit - it's with you for the rest of whatever remains of your life.\n\nI'm quite content with the choices I make thanks...I hope you can say the same for the choices you make. \n\nI really don't care if you or others are happy to be lab rats, as it's you that will have to live with the consequences of your own actions.\n\nThe point is people should be able to make an informed decision based on all the information available to them, and of their own free will. Instead alternative information is being censored which prevents people from making an informed derision. Furthermore governments are actively preventing people from accessing alternative information, while trying to force individuals into compliance, with actions which are false as well as provably harmful, such as the wearing of masks.\n\nI'm not trying to tell you or anyone else not to take it. Hell I'm more than happy for you to receive the mRNA, if that's your choice based on all the information available. We really don't need people who make shit choices, because they will only drag everyone else down with them eventually.",
				"added": 1611966011
			},
			{
				"comment_id": 32,
				"body": "> [quantumkitty](#comment_3_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Well, a lot of the times it's just basic common sense. [...]\n\nCommon sense? That analogy doesn't make sense, unless everyone involved in car accidents is insignificant and represents no threat to any other interested party. There are plenty of examples which demonstrate that death resulting from car accidents have been instigated by governments or third-parties. Dianna Spencer and Dodi Al-fayed would be but one of many examples, which contradict your analogy. \n\nIf you're applying your analogy simply to yourself it may hold water - assuming that you're insignificant and present no risk.",
				"added": 1611968028
			},
			{
				"comment_id": 33,
				"body": "> @grouch0 \"I don't follow any leaders and I sure as hell don't buy into false dialectics such as a false two party system.\"\n> \n> Sure you follow leaders.Everybody does. At least you follow the rules these leaders make.Otherwise you were in jail right now.\n>\n\nThat's a presumption on your part as you have no idea what I do or do not comply with. You would need to be caught and convicted of a crime in order to be in jail. You can challenge rules based on lawful/legal arguments, at least that's the case where I reside. It maybe different for folk who do not live in a common law jurisdiction.  \n \n> \"I prefer the Socratic method to weed out the bullshit/fact from fiction.\"\n> There is no time for this really, really ineffective method. You have to make decisions right now. Only time can tell if your decision was right or wrong.\n> \n\nWhat do you mean there is no time for this really? If you don't have time then you're reacting not thinking. With respect to the matter at hand there has been more than enough time for most people to research and think things through!\n\nDo you understand the Socratic method? Have you ever studied the Trivium method (I mean the real classic Trivium, not some bastardised variant)?\n\n> \"I'm not trying to tell you or anyone else not to take it.\"\n> Why are you even here? Of course you are trying to influence people in a certain direction.\n> \n\nI'm here to share ideas and information. If something I say or information I present influences another then that is okay by me, it's not my express purpose however. Therefore I disagree with your premise. I'm interested in encouraging people to think for themselves, and I'm interested in the views of people who think for themselves. My reason for being here is to keep an eye on ZeroNet's development as a viable alternative platform.  \n\n> To make it clear:\n> I would choose leader #2. Because I would rather die or see many people die than I have to live a life like that.\n> And I forgot to say that leader #2 would also not force you to take any vaccine against your will.\n> \n\nJust because you would choose a leader doesn't mean everyone else has to make a choice, when neither aligns with their perspective. Of course you chose option two, because you created a character that conformed to your world view, to serves a purpose. My choice was not to be manipulated, by not play your game.\n\n> And yes, personally I'm trying to tell people not to tell the vaccine, because of many reasons:\n> -Big pharma should not get more money\n> -Big pharma should not make the people more dependent on their medicine\n> -I think that the vaccine does not do what everybody claims\n> -It might be harmful\n> -I don't trust big pharma\n> -People with a weak immune system should simply die if there is no other solution than taking away all rights from 99% of population\n\nThere's the fundamental difference between us! While I agree with you with respect to the dangers, and I can support my position with information and arguments, I don't wish to impose my views upon others. The long term results are better for everyone if people take actions based on their understanding, and of their own free will. If it were someone close to me I would be more persistent, and I would elaborate more out of concern. At the end of the day it's their life and their choice, provided they have had the opportunity to consider all the evidence.\n\nYou use lots of I think and I don't think which is fine, but what matters is what they think based on their understanding. Telling people what to think doesn't help anyone! That's why the education systems tell people what to think, as opposed to teaching them how to think. People who know how to think are far more dangerous to a system that wishes to control them. \n\n> -Yes, I would say that I would sacrifice them, or even me if I was old and weak.\n> -Their sacrifice can then be hold in memory by monuments telling people, that these people have died for you to enable you a normal life (No that is actually a joke, monuments are for brave warriors only)\n> \n\nThere you go with lots of 'I's' again, just because that's what you think you will do doesn't make it so for everyone else. It's easy to make bold claims on the internet, it's totally different when a gun is pointed at your head in reality. While I may share your sentiments, I can't say with any degree of certainty what I would do when tested in reality. I guess that could be a situation I may face in the not too distant future. I suspect on this issue the odds are I would see it through, because either choice is unacceptable to me, and I have no intention of dying on my knees. \n\nMemorials/Epitaph's are erected for many reasons and the meaning is a matter of perspective. For the most part public memorials are erected by members of the establishment for a reason. Someone who lost a family member may view it as a mark of respect. That memorial also effects society by creating expectations, and emotional responses, which justify participation in events such as war. Wars which are engineered for political purposes! Memorials are a recruitment tool for the state, and a sign of respect to general society. If wider society could think they would realise that they are being played, and dying or willing to sacrifice others for political causes, which often do not serve societies best interests. War memorials could be viewed as symbols of well meaning, misinformed, individuals who sacrificed life for a political deception, and benefit of their so called rulers. Call them brave warriors and the cycle continues...call them misguided fools and maybe society would actually benefit from their loss. \n\nUnderstanding the difference between emotions, reactions and a thoughtful responses is crucial. The system want's people to react based on emotive responses and conditioning, and they are highly effective at creating the reactions they require.",
				"added": 1612024362
			},
			{
				"comment_id": 34,
				"body": "> [quantumkitty](#comment_4_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Yes, because -> [...]\n\nWell it seems that you have confirmed that you are in fact insignificant and offer no threat.\n\nIt seems safe to say that you can be officially declared ZeroNet's number one retard, which is pretty impressive. Well done you!",
				"added": 1612024563
			},
			{
				"comment_id": 35,
				"body": "> [megalodon](#comment_6_19a2pUJoCuyjWucc83VoUXjNLHoYNZf2Ey): So choices: [...]\n\nAs of who's 'current knowledge'? There's plenty of information that states the recovery rate from the so called Sars-Cov-19 virus is 98% for the average person in good health. The WHO have stated that there is no evidence that the vaccines prevent contracting Covid19. https://www.businessinsider.com/who-says-no-evidence-coronavirus-vaccine-prevent-transmissions-2020-12\n\nThere is plenty of information which establishes the fact that the mRNA 'vaccines' do not meet the definition of a vaccine. They are experimental DNA altering concoctions.",
				"added": 1612068810
			}
		],
		"1611929920_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 28,
				"body": "@ sword00000\n\nOkay if you say so. Bill Gates seems to have a different opinion, as he says...one of these numbers has to get close to zero! The anthropogenic contribution to Co2 levels is 0.04% i.e. insignificant. Not that Co2 levels actually equates to the cause of natural shifts in climate change in the first place, unless you accept the narrative presented by flawed scientific arguments biased towards anthropogenic climate change. Where is the open debate which allows both sides of the scientific argument? Humm, there isn't an open debate because the Co2 argument cant stand up to honest scientific investigations. It's not settled science it is a controlled political narrative without any basis in reality.\n\nHere's Bill selling the bs, I'll leave it for you to decide which number he thinks needs to reach something close to zero. https://www.youtube.com/watch?v=JaF-fq2Zn7I \n\nIf you want the vaccine knock yourself out, no one who doesn't want it will be stopping you. Just bare in mind that it is not a vaccine by virtue of the fact that it doesn't meet the scientific definition of a vaccine. Furthermore virus and vaccination science is nothing more than theoretical...it's not established fact.",
				"added": 1611956156
			},
			{
				"comment_id": 29,
				"body": "> [rnb](#comment_9_1F57R2GNQqq1McDDceeEekBpYwdWizAX7E): lmfao how are vaccines supposed to track you? XD\n\nI guess it depends on how you define 'track you' a cow can be tracked it's entire life by the tags in it ears. In this case it's far more complex https://www.bitchute.com/video/aFTiEJySlvBj/",
				"added": 1611960600
			}
		],
		"1612516347_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 36,
				"body": "@quantumkitty in your case maybe a nanochip would be a better fit.",
				"added": 1612548825
			}
		],
		"1612534044_1Phd1v4EgBWqCeAjGD7gtspkpFL8Z6GbkP": [
			{
				"comment_id": 37,
				"body": "Lies? They absolutely did run a shadow campaign and there is plenty of evidence demonstrating that. What do you think all the groups like Antifa, BLM and the Sunrise Movement were doing? There were government employees in conference calls discussing the tactics and forming the timeline of events. They discussed how the voting would unfold months in advance, and they also discussed how the courts and house etc. would play out. \n\nhttps://www.sunriseexposed.com/\n\nThe lie is that they saved the 2020 election when they actually subverted it! They seem to think that they have managed to beat the American people and destroyed their Republic. It's not over yet - in fact it's only just begun. Eighty million and rising wont be stand idle, in the face of one of the greatest and most blatant crimes in American history.",
				"added": 1612550016
			}
		],
		"1612720158_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": [
			{
				"comment_id": 38,
				"body": "> [sword00000](#comment_32_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S): This is a problem with the right-wing. They think that 20th century technology (guns) will help them win a 21st century technology war. The right-wing has grown weak, complacent, and stupid. Most on the right know that Social Media stole the election, yet they still stay on Social Media. Feeding the beast that will destroy them. It's unfortunate\n\nOnly a moron would think that guns are no longer effective because the timeline has moved on twenty years. The 'right-wing' understand the value of having a means of self defense, against a corrupt tyrannical regime. What the 'right-wing' need to understand is that they will need to make use of their guns, before remote, and robotic weapons technology and surveillance systems are beyond the point of mounting an effective defensive strategy against them. That window of opportunity is closing rapidly right now.\n\nLmfao, the right-wing'' has grown weak, complacent and stupid, says the 'left-wing' soy boy. The right has never been stronger, and it's gaining strength by the day. As for complacency do you actually understand the meaning of the word? Obviously not, as the 'right-wing' have demonstrated that they are highly motivated and aware of the dangers Amrica and world at large face. They have also become pro active in their efforts to prevent the rot from deepening. Stupid you say? The 'right-wing' present solid arguments based on reality backed by evidence. They are also highly skilled at researching, and effectively conveying knowledge, which is why the 'left-wing' controllers have no option other than to ban them, as there is no substance to leftist ideologies. Unlike the 'left-wing' the 'right' are transitioning to and creating new platforms which respect free-speech, both on the clearnet and decentralised platforms.   \n\nNo social media didn't steal the election you moron...social media was an element used to prevent the evidence being presented in the public square, and stifle debate, because the 'left-wing' lacks the capacity for meaningful debate. The election was stolen because the entire system is corrupt to the core. All the protection mechanisms of the American constitution have failed. Ultimately a totally corrupt judiciary is what allowed for the election to be stolen initially, but that will be tested again on the 19th. Not only that but the 'right-wing' will be coming for the State legislators and state wide political positions. There are a whole lot more red counties and states than there are blue.  \n\nThe problem with 'left-wing' retards is that they fail to understand the real consequences of allowing an election to be stolen, with respect to the future of the American republic and the freedoms it represents. The system doesn't give a fucking shit whether you are a retarded lefty or a right-wing threat. The system wants total control over everyone and everything, and if you try to defend against it it will cheat and steal to keep you down on your knees. \n\nThe enemy both the left and right face is the establishment of a core technocratic plutocracy, and unless you are a multi-billionaire at the very least you ain't in the club, and you will never be.\n\nAll you will be is a bio-unit of digitally monitored and inventoried human meat, to be tracked and traced from cradle to grave as a production and consumption unit. if you're lucky. If you fail to comply or meet the demands of the system you will be totally dispensable. Your lefty rhetoric and retardation won't offer you any defense or special privileges once you're under the boot of tyranny.",
				"added": 1612744024
			},
			{
				"comment_id": 39,
				"body": "> [jager](#comment_68_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX): We just lost.[...]\n\nI think you will find that we have just got started and we wont lose.",
				"added": 1612744277
			}
		],
		"1612927209_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 40,
				"body": "> [boot13](#comment_15_1PxMvud9KvbqaSZnV4piygA6dFTASwapHY): Please stop posting this fact-free garbage. You have been muted.\n\nYou are the one posting fact-free garbage you low life piece of shit.\n\nDon't believe any fucking bullshit on any subject until you have done your own due diligence from a totally neutral point of reference. The real information is out there even though they are doing everything they can to hide it. Often they disclose the facts in their own documentation. Look at the patents look at the corporate structures, their connections and financials, as well as the lobbyists and the laws passed in their favor.\n\nThere is no live virus or active protein in an mRNA non-vaccine period. It doesn't function in the way a regular vaccine theory alleges they work. The mRNA theoretically provokes an immune response when your DNA comes in contact with a sars-cov-x virus strain. The reality is that once that trigger is activated there is no way of knowing how an individuals immune system will respond. In effect the mRNA is designed to cause an unknown DNA altering autoimmune response with unpredictable short or long term results.\n\nThe reason it's being miss described (a crime) as a vacinne is to allow the pharma companies to cause untold damage without facing liability, under the immunity of vaccine liability legislation.\n\nScience has been corrupted to its core and can't be trusted at face value.",
				"added": 1612989211
			}
		],
		"1612976844_16E25Tu9jf8GTS2S1W5mZs6Ayc9vQkC8SN": [
			{
				"comment_id": 41,
				"body": "I wonder if he has switched his attention towards Republicans, Christians and those radicals with traditional values of freedom and patriotism?",
				"added": 1612989578
			}
		],
		"1613921466_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt": [
			{
				"comment_id": 42,
				"body": "> [focaut](#comment_13_1BudWvimweYZjs7PghDjpd8nbuHH4dR84u): where low book\n\nTry the clearnet links I have just added.",
				"added": 1613926025
			}
		]
	},
	"comment_vote": {
		"83_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1,
		"85_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"2_1BfSkii33q8CigGRGQaae1kG3CgeJBd8NN": 1,
		"13_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": 1,
		"7_19XzssAaDbJ1rbCNCYxDioen1gxGxqiNyh": 1,
		"81_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"10_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": 1,
		"49_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"1_18qiRCPPp2agguoC3nc7mL21hLZrfTjPWY": 1,
		"5_1Dsw1CpgZiPYkVWLiqrgMJDTyXWEggCg2m": 1,
		"71_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"86_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"3_13UNccDwDNZx97EtsahFYrU3e5u4YGFbs7": 1,
		"68_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"32_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": 1,
		"88_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"2_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"73_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1
	}
}