{
	"next_comment_id": 5,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [tsubame](#comment_2_1AnHAaYBr8QjiCxL3ZYnYHKxL9Wd18zgdH): Наверняка там есть пункт в договоре. Сами то они не могут так беспредельничать.\n\nНу и в продолжение темы... Эта задолженность появилась на портале госуслуг, я ее уже почти погасил, но Сбербанк видимо не хочет об этом знать и по прежнему жаждит снять с меня первоначальную сумму задолженности сам. :( Придется идти туда, проталкиваться между бабушек/дедушек и рассказывать им где они не правы... Хотя наверно идти придется к каким-нибудь приставам, чтобы они там все отзывали. Короче цирк да и только.",
			"post_id": 5,
			"date_added": 1514077942
		},
		{
			"comment_id": 2,
			"body": "> [balancer73](#comment_1_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Как обычно, нужно яйца держать в разных корзинках :) С другими банками тоже свои заморочки бывают.\n\nКонечно, но Сбер я так понял на вершине трешака для клиентов.",
			"post_id": 5,
			"date_added": 1514078020
		},
		{
			"comment_id": 3,
			"body": "> [tsubame](#comment_1_1AnHAaYBr8QjiCxL3ZYnYHKxL9Wd18zgdH): А в ESR этой фигни нет. Вот прям как чувствовал, во время этого нытья про сломанные экстеншены, что не они главная проблема.\n\nСкоро завезут ;)",
			"post_id": 4,
			"date_added": 1514078071
		},
		{
			"comment_id": 4,
			"body": "> [numberedpwnz2](#comment_1_1483jDvDG4NBbDT3ACg9cHXfFJyUEuUGJT): Тут вы не тратите деньги в пустую, как по мне, да, вы пользуетесь банком, ложите на него деньги, и какой тогда плюс от этого банку?Тут вы платите за то что пользуетесь.Это же логично.\n\nНичего не логично. Мои деньги лежат в банке, банк их инвестирует и вообще пользуется моими деньгами. По сути я даю банку кредит! Вот пусть мне платит по 20-40% годовых или хотя бы бесплатно оказывает мне услуги, как это делает тот же Tinkoff. У других тоже есть интересные тарифы, но у последнего даже в очередях стоять не нужно, а обслуживание получше чем у персональных менеджеров некоторых банков.\n",
			"post_id": 9,
			"date_added": 1519731756
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}