{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1566667015,
			"title": "py3 version of ZeroNet loading JSON problem hangs process",
			"body": "I've tried switching to py3. I copied the data folder from my ZN installation complete to the py3 I downloaded from Github and it's been several times now that it hangs and I can't load pages. With --debug I can see that when it happens it's logging this kind of lines, incrementing the number by 100 each time:\n`[2019-08-19 00:39:31,625] DEBUG    Site:1ChByY..wGeX Loaded json: 5000 (latest: galleries/xxx/content.json)`\nI thought once it had loaded all json files it would stop and this was a one time thing. But it's happened at least three times now! Takes a really long time as well because I have a very large library of galleries. Have looked at the code and seen it is Content/ContentDbDict.py that generates the error, but I don't understand enough how it works to know if it problem that I have to solve because of migration to py3 or a bug in the new code.\n\nHope this get's solved soon because I'd like to upgrade to the new py3 version.",
			"added": 1566667014
		},
		{
			"topic_id": 1568826985,
			"title": "Editing and saving content.json slow on large zites, and other big zite problems",
			"body": "I really appreciate all of the work you've put into this project, it has inspired me to share my collection of hentai manga with the internet in a way I felt the internet lacked: meticulously organized, easily downloadable and free.\n\nAlong the way I encountered a couple of issues that I want to bring to your attention:\n- **Editing and saving content.json for a large site is slow.** This is why I've stopped using GalleryHubPlus to sign my new galleries and instead use a shell script (blazingly fast!)\n- **ZeroNet does not prioritize content.json downloads based on their hierarchy.** This means that when I publish a large new set of galleries, it is possible for peers to keep downloading content.json includes before they download the updated parent content.json in which they are included, and this can take days until ZeroNet downloads the correct content.json.\n- **ZeroNet does not like files it doesn't know what to do with.** If a file is not either ignored or listed in a content.json file, ZeroNet will rescan **ALL** json files in the zite because it thinks it must have missed something. For both of my gallery hubs this takes about half an hour.\n- **ZeroNet does not remove included content.json files when they are no longer included in the parent content.json** I noticed doubles on some 3D galleries and one of each pair weren't included in the content.json, so these were probably renamed and resigned, but not deleted on my end. This is not a big problem for me, and it may have been fixed already.\n\nCan you fix these please?",
			"added": 1568826983
		},
		{
			"topic_id": 1613730379,
			"title": "Hentai and Pornhwa collection on ZeroNet (11k+ manga)",
			"body": "I've been uploading my hentai collection to ZeroNet and it's been a while since I've advertised my sites. They all use the ZeroGallery format, so I recommend using [1+Gallery](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/) or the beta version that Ansho is working on [G4Z Beta](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/wasm/). I've been using the beta for a while now and it's not missing many features compared to the original (thanks for the bookmarks, please implement preloading and settings next @anshorei), but it looks a lot better.\n\nUnlike most manga sites on the clearnet these come completely free of advertisements!\n\nDownloading these sites will download the metadata of all manga in them, when this is more than 10MB you'll have to allow the site to download more than that when it asks. It can also take a while to download all of the metadata so be patient and reload if 1+Gallery appears empty.\n[Alotaplot (English Hentai)](/1G8VWDQc5fXLkRiijJB4EZerDLmDVY75MZ/) 3k+ \n[ManhwaHub (English Pornhwa)](/126Temra5S4SmEpt1DVcxy1nhEJBhyUPvr/) ~600\n[AlotaplotJA (Japanese Hentai)](/1Ar1JLs2EJyqoFuF7zzR2zsYCxMDcxBXM8/) 2k+\n[Anthology (Japanese Hentai Magazines)](/1ChByYBAm9S5pT7F3pckjSTb2wxTaYwGeX/) 5k+\n[AlotaplotZH (Chinese Hentai)](/136euwHQt2Gm1Aj6yCsQYpyJ9NULcFTqQu/) 34\n\nIf you're into H you might also want to check out:\n[Let's Talk Hentai](/1J9CAuKdCxFAAgqmc1s72kpF8T1mW1SaG3) (defunct)\n[Lolis](/1LoLisb8RqNfTbQXp5dAFasmUJ9mAxwetX/) (don't ask me why it's called Lolis, it's a list of H sites on ZeroNet not specific to lolicon)",
			"added": 1613730376
		}
	],
	"topic_vote": {
		"1550689032_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"1566159714_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": 1,
		"1572293998_1GGZUdrWYgPgvqiA1mo4TxHFKvCw4g99rK": 1,
		"1587407952_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1,
		"1589899830_18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF": 1,
		"1592777145_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": 1,
		"1598113485_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1598537511_15QhKCBKHERPhEpR1DCXx4Ue8VAEiVWXwf": 1,
		"1598683262_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": 1,
		"1599847995_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": 1,
		"1566679861_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1611693126_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": 1,
		"1612926129_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1613138654_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": 1,
		"1614508770_19u7DWM98mRFefK626S4M9HU8iAgW6z7B": 1
	},
	"next_comment_id": 49,
	"comment": {
		"1550597342_16TToFo5raRSGVEXVccktskzV6oU6RWid1": [
			{
				"comment_id": 1,
				"body": "Some of us just make everything we have available for free. I also seriously doubt you're gonna give anyone anything after they send you the first 50% in good faith. But to each their own.",
				"added": 1550619312
			}
		],
		"1566165386_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 2,
				"body": "There is a small amount of manga on ZN. Go to 1+Gallery and you'll find most of it.\n\nIf you're looking for 18+ stuff I'm probably the person you'll want to talk to around here :-D",
				"added": 1566170190
			},
			{
				"comment_id": 6,
				"body": "Yeah, since potato went down mangadex is the place to be.",
				"added": 1566646203
			}
		],
		"1566051166_17dcwh1uMFnDMZK8X5XHciXFggdxVXqfSD": [
			{
				"comment_id": 3,
				"body": "Use Millchan instead? It's run by the dev himself so it's always up to date...",
				"added": 1566173306
			}
		],
		"1566174527_18HYVwCAgri1SgiYZcEZMehKoXZo6Eg7im": [
			{
				"comment_id": 4,
				"body": "Red wine, the proper drink for a knight in cum-stained armor.",
				"added": 1566175201
			}
		],
		"1566191569_17EbpUZgWWK4fHVsp4fPuTphiBkSZ16cZu": [
			{
				"comment_id": 5,
				"body": "Depends on what you're looking for, but in general I'd recommend KopyKate (video), 1+Gallery (manga) and ZeroMe (twitter). They're the places I hang out most, as well as Millchan.",
				"added": 1566261811
			}
		],
		"1566667015_18UukzxVzEwd9ugyvKWYe2vud77GyL72Px": [
			{
				"comment_id": 7,
				"body": "I've been able to find out some more about what the problem is:\nThe hang happens when the galleryhub tries to load a gallery that hasn't been signed yet.\n`[19:17:19] Site:1ChByY..wGeX No info for galleries/xxx/manifest.json, waiting for all content.json` is the first error then. The content.json doesn't exist yet in an unsigned gallery, so ZN reloads all json for the whole site including ones that are not content.json files. This bevior should maybe not happen when you are owner of the site, because often you have files not included yet like new galleries you are still working on.\n\n1. Why is is loading all json? Site only has about half as many galleries as 5000. So it is loading manifest.json and data.json files too?\n2. Why does it reload json for owned site where there could be files you are still working on?",
				"added": 1566672601
			},
			{
				"comment_id": 8,
				"body": "> [gitcenter](#comment_758_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): [...] Well, usually the files you're working on have a content.json.\n\nThen it's a problem with the GalleryHub code? I think it only creates the content.json when you sign them.",
				"added": 1566680524
			}
		],
		"1566919824_1NTzrNqTPmBWChMJhhiPNZFh3FR1Yo7tx5": [
			{
				"comment_id": 9,
				"body": "> [bigbadbob](#comment_427_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): penispenispenis [...]\nProbably best not to do that, might get blocked by people mistaking you for a troll like OP",
				"added": 1566933385
			}
		],
		"1566892977_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 10,
				"body": "What happen?",
				"added": 1566933496
			}
		],
		"1571549623_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 11,
				"body": "I don't think it's embarrassing, but sex while doing something else is a big one for me. This can be fucking someone who's cooking, getting a blowjob while reading, fingering someone who's playing piano, etc. There's something about trying to focus while getting distracted by sex that appeals to me, both doing it and having it done to me.\n\n> [styromaniac](#comment_1142_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Excessively large breasts. It had been with me my whole life. Becoming normal seems impossible. There's no point in feeling shame if you can't change yourself.\n\nI don't think that's abnormal, it's one of the biggest fetishes out there.\n[Anthology.jp](/1ChByYBAm9S5pT7F3pckjSTb2wxTaYwGeX/) [Huge Breasts](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/?!/f/female:huge_breasts) for your daily dose",
				"added": 1571589760
			}
		],
		"1572813783_1KcVfZRokJtJUZC43KicAQDaZ2ExQSsSn9": [
			{
				"comment_id": 12,
				"body": "What do you mean by XXX?\n- [Fetish Central](/1FCtRjQtyE4Es9XbS2WCzweyvnaehKfLG6/) is a good one if you're into any of those featured.\n- Millchan has a lot of e-thot material.\n- If hentai counts I'd recommend you check out my collections [Alotaplot](/1G8VWDQc5fXLkRiijJB4EZerDLmDVY75MZ) (english translated) and [Anthology.jp](/1ChByYBAm9S5pT7F3pckjSTb2wxTaYwGeX/) (japanese magazines)",
				"added": 1572824704
			}
		],
		"1587033694_1Lsg22jpeHArEaaXRVrdzpvfgPgg5xnSXb": [
			{
				"comment_id": 13,
				"body": "You mean Tor Browser, guide for Tor still works.\n\nGo to [about:config](about:config) and search `no_proxies_on`, add set to `localhost,127.0.0.1`",
				"added": 1587037880
			}
		],
		"1586928602_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": [
			{
				"comment_id": 14,
				"body": "> [caropc1v15](#comment_5_1B55EXo5rx3r9XtRd8rgcpFn8BJ4tWuYBC): I am use http://127.0.0.1:43110/cryptoid.bit/\n\nWhat is cryptoid?",
				"added": 1587038085
			}
		],
		"1588017450_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": [
			{
				"comment_id": 15,
				"body": "1+Gallery has that in the javascript of the site, maybe you could do that too?\n\nIt's still painful. I've got a zite with ~2.500.000 files, including 5000 content.json's and there's a couple of problems you get with those numbers.\n\nFor one ZeroNet likes to rescan all content.json files when it doesn't find a file, and for some reason this takes a lot longer than you'd expect for 5000 files. Whenever that happens I shut ZeroNet down and restart it. Could be because it's also checking the files in the content.json?\n\nI haven't looked at the code yet. It takes like 30 minutes at least.",
				"added": 1588020471
			}
		],
		"1589795008_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": [
			{
				"comment_id": 16,
				"body": "You have to visit them on each device, ZeroNet does not sync your list of downloaded zites and files.",
				"added": 1589851619
			},
			{
				"comment_id": 17,
				"body": "> [schiz0](#comment_115_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k): Yes, I know, but even if I have all my synced devices connected and I visit my merget zites they remain unsynced\n\nYou need to visit the individual hubs, not just the merger.\n\nOtherwise it could be that your devices cannot connect if they are not both Tor or have an open port. And make sure they find trackers, Syncronite can help if that is the problem.",
				"added": 1589892960
			}
		],
		"1589899830_18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF": [
			{
				"comment_id": 18,
				"body": "Downloaded and pinned.\n\nSo rape in movies: OK\nRape in video games: OH NO WE CAN'T ALLOW THIS\nKilling in video games: OK",
				"added": 1590246267
			}
		],
		"1592362442_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": [
			{
				"comment_id": 19,
				"body": "Sounds like the plot of [A World That I Rule (_18+_)](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/?!/g/126Temra5S4SmEpt1DVcxy1nhEJBhyUPvr/rozer-tank-guy_a-world-that-i-rule_EN).",
				"added": 1592438174
			}
		],
		"1595256735_1CpcxT1xWtqTRZTRR1KnH8gGsY2i4rJ7du": [
			{
				"comment_id": 20,
				"body": "Clicked link, it's safe. It's a magnet sharing site with categories for music, adult porn, software, etc.",
				"added": 1595374334
			}
		],
		"1596498847_12kkzRK2n9vRvQLcycbGZNsD3vqzWe1Jeh": [],
		"1596498919_12kkzRK2n9vRvQLcycbGZNsD3vqzWe1Jeh": [
			{
				"comment_id": 22,
				"body": "What entertainment you looking for? There's a collection of adult manga sites [linked on my ZeroMe profile](/Me.ZeroNetwork.bit/?Profile/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/18UukzxVzEwd9ugyvKWYe2vud77GyL72Px/sirlotaplot@zeroid.bit) there's dedicated ones for English, Japanese and Chinese.\n\nFor  non-adult stuff Play is good, which is movie torrenting.",
				"added": 1596664952
			}
		],
		"1597502109_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 23,
				"body": "The reason Torrent surpassed other filesharing applications was speed. There were plenty of p2p networks before then and they are still around. Surprisingly you'll find stuff there you can't even find a torrent for, particularly old music.",
				"added": 1597777643
			}
		],
		"1597851898_17viT3RZEU8RDUTwGFy2fo3CE3krdJYB4e": [
			{
				"comment_id": 24,
				"body": "torrents:\nbt4g.org\n1337x.to \nbteye.org\n\nJAV torrents:\nprojectjav.com\nonejav.com\nmyjavbay.com",
				"added": 1597860245
			}
		],
		"1595165517_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 25,
				"body": "> [falken](#comment_2_15Eji3MdHu8BZaF2a9yTLJmKrUVTuHuumM): I wish the people who got banned for being terrible were a lot less vocal about it.\n\nDon't ban them, won't have anything to talk about then ¯\\\\\\_(ツ)\\_/¯",
				"added": 1598614711
			}
		],
		"1599583363_1HWmMKD3nNGY9bRJq5yZ8sRVcvPbtgzbRw": [
			{
				"comment_id": 26,
				"body": "get a job",
				"added": 1599587600
			}
		],
		"1600031682_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": [
			{
				"comment_id": 27,
				"body": "If you're interested in Hentai, you should check out my collections\n\n**Alotaplot** [EN](/1G8VWDQc5fXLkRiijJB4EZerDLmDVY75MZ) [JA](/1Ar1JLs2EJyqoFuF7zzR2zsYCxMDcxBXM8) [ZH](/136euwHQt2Gm1Aj6yCsQYpyJ9NULcFTqQu) Hentai Mangas (230+GB, 2800+). Mostly translated into English\n\n**ManhwaHub** [EN](/126Temra5S4SmEpt1DVcxy1nhEJBhyUPvr/) Hentai Webcomics (50GB, 250+). All translated into English\n\n**Anthology.jp** [JA](/1ChByYBAm9S5pT7F3pckjSTb2wxTaYwGeX), my entire digital collection of Hentai magazines, neatly sorted with an all new interface! (500+GB, 5000+). Nearly all in Japanese",
				"added": 1600112082
			}
		],
		"1610154957_1HesgY39DUQrf3M1WCn6q66f69VRRJc57E": [
			{
				"comment_id": 28,
				"body": "ZeroNet's ideal use-case is splintered communities and personal blogs. Many of the big community style sites like MillChan, 08Chan, 0chan, nullchan, zerovoat etc. run into performance problems when there's plenty of users.\n\nAlso don't forget to run ZeroNet in Tor-only mode if you want anonymity.",
				"added": 1610156497
			},
			{
				"comment_id": 29,
				"body": "ZeroNet itself scales, sites with limited user interaction also scale, but I 8chan on ZeroNet at the scale 8chan was will never be a thing. ZeroNet offer site owners the option of cleaning stale content, but most site owners disable it. With that enabled you wouldn't be able to browse old threads intact, but it would scale much better with user interaction.",
				"added": 1610156833
			},
			{
				"comment_id": 30,
				"body": "4chan style with threads being gone after a while is a much better format for ZeroNet, but the chan devs on here used the 8chan style instead, probably because of the user influx from there",
				"added": 1610157025
			},
			{
				"comment_id": 32,
				"body": "zerotalk only has text so it's a lot simpler, I think it has a cleanup cycle of a year or two for removal but I don't know where to check,  I'll leave it to someone else to answer",
				"added": 1610157542
			},
			{
				"comment_id": 33,
				"body": "> [userneonshine](#comment_4_1HesgY39DUQrf3M1WCn6q66f69VRRJc57E): http://bit.no.com:43110/0chan.bit\n\nwatcha doing there, glowie? \nhttp://localhost:43110/0chan.bit is the real link, don't trust any exit links (links going to other addresses than http://localhost:43110 or http://127.0.0.1:43110)",
				"added": 1610158097
			},
			{
				"comment_id": 34,
				"body": "@styromaniac: I read somewhere that nofish enabled expiration on ZeroTalk but I can't remember where",
				"added": 1610158292
			},
			{
				"comment_id": 35,
				"body": "no problem mate, just trying to protect people from honey pots, back during the 8chan influx some journos deanonymized a bunch of people because they either didn't use Tor or clicked exit links to honey pots\n\nYes, 4Chan is still up for now, but ZeroNet is a good place to reorganize because it can't be shut down, even if you don't make it a permanent home, this is a good place to ask what the new address is and shit like that",
				"added": 1610160980
			},
			{
				"comment_id": 36,
				"body": "Millchan: http://localhost:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA",
				"added": 1610164402
			},
			{
				"comment_id": 37,
				"body": "> \">\"\">\"\">\"\n\n\\>\\>\\> learn to tri-quote scrub",
				"added": 1610350192
			}
		],
		"1610152196_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 31,
				"body": "ZeroNet isn't ready for such an influx of users :-/\n\nlet's just hope some good ones come and stay",
				"added": 1610157203
			}
		],
		"1610356743_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [],
		"1610475632_1JUV6t4NFxuUQztyUWTNvyDhGz3bqWENmr": [
			{
				"comment_id": 39,
				"body": "there could be some characters ZeroNet doesn't like in filenames?",
				"added": 1610530029
			}
		],
		"1611199036_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": [
			{
				"comment_id": 40,
				"body": "You can also delete your posts to get more",
				"added": 1611214241
			}
		],
		"1611507255_1PFNFDTCBgFcXV87E4oP5gBund9igbHB7Q": [
			{
				"comment_id": 41,
				"body": "Could be the owner of Play died, could be he doesn't realize his site no longer updates, could be he stopped updating the site at all? I saw no traffic spike that would indicate an attack.",
				"added": 1611530241
			}
		],
		"1613138654_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": [
			{
				"comment_id": 42,
				"body": "> [2due7](#comment_6_1Knfo3Xr91jYnAA1idYY9Ce8TDk41LgaH8): Good post, but I do not know if the devs are active anymore.\n\nLatest revision is from last month, so they're still active even if it's less than last year.",
				"added": 1613149250
			}
		],
		"1614508770_19u7DWM98mRFefK626S4M9HU8iAgW6z7B": [
			{
				"comment_id": 43,
				"body": "With just Italians as target demographic it's going to be hard to find active users. Good luck though! If you need any help with something get into contact with me. I run the largest hentai collections on ZeroNet and want more active hentai community in all languages.",
				"added": 1614558149
			},
			{
				"comment_id": 44,
				"body": "You can find the links in [this thread here on ZeroTalk](/Talk.ZeroNetwork.bit/?Topic:1613730379_18UukzxVzEwd9ugyvKWYe2vud77GyL72Px)",
				"added": 1614778812
			}
		],
		"1614774386_1DwZPxVycEyeuvYDJFjAZfF3A8SGtHiRBn": [
			{
				"comment_id": 45,
				"body": "why not use Tor to hide your ip?",
				"added": 1614786179
			}
		],
		"1604751153_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": [
			{
				"comment_id": 46,
				"body": "I have noticed the 0/x trackers problem as well, but I'm not sure what the cause is. Usually I just restart Tor followed by ZeroNet and it fixes itself then, but not always.\n\n> what is Yggdrasil?\n\nit's an ipv6 overlay network: https://yggdrasil-network.github.io/",
				"added": 1616452831
			}
		],
		"1617149531_16badkisTTGDcQf3YmZ9ra8b9PnhaJTynx": [
			{
				"comment_id": 47,
				"body": "Freedom from corporation and state",
				"added": 1617232660
			}
		],
		"1617745493_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 48,
				"body": "In other news: water is wet and also on the No Fly List.",
				"added": 1617750582
			}
		]
	},
	"comment_vote": {
		"607_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"378_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"16_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"419_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"2174_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"522_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"2_15wyZrQv2HaQQD7usbZ6iXTxY7DKAChnGP": 1,
		"1_15wyZrQv2HaQQD7usbZ6iXTxY7DKAChnGP": 1,
		"2167_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"21_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"1_15QhKCBKHERPhEpR1DCXx4Ue8VAEiVWXwf": 1
	}
}