{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1576760636,
			"title": "حمله به زیرساخت های شبکه داخل کشور",
			"body": "مثل این  که قطعی های اخیر تست و مانور نبوده\nخودشون اعلام کردن شبکه جهانی مشکل داشته یه سری شواهد هست که خلافشو نشون میده \nحالا یا واقعا حمله شده بهشون یا خودشون سوتی دارن سوتی میدن",
			"added": 1576760635
		},
		{
			"topic_id": 1577371283,
			"title": "نشت شماره های توییتر",
			"body": "۱۷ میلیون شماره تلفن توییتر نشت پیدا کرده\nتعداد زیادی احضار شدن توسط اطلاعات",
			"added": 1577371281
		}
	],
	"topic_vote": {
		"1577287203_1H1VjVyTYc6EJykyRTrWv7c19cBx7Jpev9": 1,
		"1577400583_15xJB7FfbvRoSjdoKbCoBytdAUu3qYpYyG": 1
	},
	"next_comment_id": 9,
	"comment": {
		"1576747291_1GDRsCVa9W6MNaMoBt4t9dmrJ7D3MNhMRV": [
			{
				"comment_id": 1,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_2_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): so what's where you are all morons\n\nWe're not annoyed by your messages here and I'm not offended by the way you talk to us\nbecause you're right and actually Everyone MUST  post English in main zerotalk forum\nThe reason is not that we want to mess with this site\nIt's because there are many people coming in this community and  they are all new to this\nand sadly it's going to happen for a while \nI suggest that if  anyone made a None-English topic in main zero-talk page redirect him/her to this forum by providing its link\nThanks in advance",
				"added": 1576751628
			}
		],
		"1576760636_1KZCoVfrjE2zbgBdTrzowgebHrLEgc9gPB": [
			{
				"comment_id": 2,
				"body": "dns  های داخلی داون بودن\nدر حالی که خارجی در دسترس بودن\nخیلی از سایت های اینترانت ملی حتی باز نمیشد\nولی با فیلترشکن همه چی باز میشد",
				"added": 1576760768
			},
			{
				"comment_id": 3,
				"body": "اگه فرض سوتی و کنار بذاریم\nاحتمالا خیلی تلاش کردن شبکه رو آپ نگه دارن\nهنوزم قطع و وصل میشه",
				"added": 1576760822
			}
		],
		"1577259049_1NjWwiAPbhgfpbP1E5LNBs76cS3Er1MrLk": [
			{
				"comment_id": 4,
				"body": "البته جای شعار وسط خیابونه نه اینجا",
				"added": 1577264449
			}
		],
		"1577319533_155BV946eTzEPHqom9YUH5DxyEqPWuM51V": [
			{
				"comment_id": 5,
				"body": "عملا به طور امن نمیشه نقش ترکر و ایفا کرد \nیک پلاگین هست به نام  bootstraper که اگه فعال کنی کلاینتت نقش ترکر و ایفا میکنه ولی بقیه باید آدرس آی پی شما رو تو ترکر لیست وارد کنن پس ینی آدرس آی پیت لو میره و ...\nاگه میخای پیام رسان که صددر صد تو اون شرایط کار کنه داشته باشی باید بری سراغ toxchat\nاگه نه اصرارت بر اینجاست و فنی هستی میتونی با meek و  tor به ترکر ها و اینترنت خارجی حتی دست پیدا کنی",
				"added": 1577347019
			},
			{
				"comment_id": 6,
				"body": "toxchat ‌\nهم آی پی شما برای دوستانتون که ادشون میکنید قابل ردیابی هست ( و این یک باگ نیست بخشی از معماری سیستمه ) \nپس برادر های دوست نداشتنی رو اد نکنید :)",
				"added": 1577347091
			},
			{
				"comment_id": 8,
				"body": "> [gandalfthewhite](#comment_1_1DYQWc7zUzVjSywLty4sWWbotxYcFZr9mi): والا با اینترنت داخلی الان تاکس هم کار نکرد\n\nتاکس مخصوصا اتصال اولیش بعضی وقتا بیشتر طول میکشه اگه وقتی اینترنت وصل باشه وصلش نکرده باشی\nولی میشه \nدلیلشم اینه که باید پیدا کنه و فرایند پیدا کردن اگه به  DHT  وصل باشه سریعه و میتونه با تکنیک هایی مثل hole punching  به peer ‌ها وصل شه \nولی وقتی   به  dht وصل نباشه اتصال اولش یکم طول میکشه ( یا حتی در مواردی غیر ممکنه مثلا داخل nat ‌هیچ peer حاضر نباشه )\nاگه وصل هم نگهش داری که عالی تره\n\nخلاصه اینکه وقتی نت وصله وصلش کن و مطمین باش رو نت داخلی تست شده و کار میکنه \n----\nحالا یه مثال میزنم درک کنی قضیه چه \nفرض کن توتاکست کار میکنه ولی خاموشش میکنی\nنت قطع میشه \nدوستت همین مشکل تو رو داره و نمیتونه با تاکس وصل شه \nجفتتون به یه وای فای وصل میشید تو به  dht  کانکت میشی و چون جفتتنون تو یه  nat  هستید دوستت از طریق تو به  dht  وصل میشه و بعدشم مستقل میشه\n-----\nدر واقع لازمه مثل ترکر های اینجا لیست یوزر های آنلاین و اخیرا آنلاین و بگیری\n--\nاگه مدام وصل باشی این لیست همیشه به روزه و تو همیشه به  dht  وصلی",
				"added": 1577392564
			}
		],
		"1577371283_1KZCoVfrjE2zbgBdTrzowgebHrLEgc9gPB": [
			{
				"comment_id": 7,
				"body": "> [schahien](#comment_1_1BRMFWA6XnZ1miFjRwATWotA6rUEvSUj3b): خب یه منبعی یه چیزی :/\n\n> [dboy](#comment_2_19DiPjAH7KYdNegym1GRWjyAkoLCJLiSjX): منبعش از کجاس !!!\n\n\nاگه گوگل کنید همه خبر گذاری ها کار کردن\nhttps://thedigitalweekly.com/2019/12/26/17-million-phone-numbers-of-twitter-users-is-reported-to-be-leaked/\n\nhttps://www.dailymail.co.uk/sciencetech/article-7825481/Flaw-Twitter-Android-app-lets-researcher-match-17-MILLION-phone-numbers-user-accounts.html",
				"added": 1577384788
			}
		]
	},
	"comment_vote": {
		"2_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1_1KZCoVfrjE2zbgBdTrzowgebHrLEgc9gPB": 1
	}
}