{
	"next_topic_id": 3,
	"topics": [
		{
			"topic_id": 2,
			"title": "The Corsair - Our torrent index",
			"body": "I'll post updates to the site in this topic.\n\nI started to integrate Libgen torrents. Their DB is huge so it will take some time to integrate everything.\nThe json size is ~2.7MB to each ~25000 torrents. We can work on this later when ZeroNet supports some kind of compression.\nLibgen supports direct download of the ebooks, which is pretty cool. There is a direct download button on The Corsair so you can grab the ebook from libgen servers.\nTheir index starts in 2009. Since libgen torrents are all seeded it makes sense to index everything.\n\nFor KAT we are up to date until 2014. I won't get ebooks earlier then that because seeds are very low.\n\nFeedback is welcome.\n\nhttp://127.0.0.1:43110/15rm8ew4pamdiFmpyYwzmEqJVx6Etnv8pP",
			"added": 1431818215
		}
	],
	"next_message_id": 6,
	"comments": {
		"14@2": [
			{
				"comment_id": 1,
				"body": "Some newbie questions (from the point of view of someone who wants to create a site instead of a developer):\n\n- A tutorial on how working with the built in sqlite DB is like would be great. Things like: How to execute basic sql queries, how to display them on a page (I can get my head around doing this with python or php but I have no idea on how to interact with a DB without using any of these languages).\n- When I do an insert to the DB, how do I push that to zeronet (is this the correct way to put it? to 'push it' into zeronet?) Do I have to sign the new .db file and push it? Or I just need to push the create json?\n- On the current docs you added some how-to's snippets, which is great, but I think some technical details would be helpful too, things like: How the propagation of the updates happens, what's a good trade off if my site works with DBs - ie: should I push every small change or should I push the changes every 5min to not overload the network? how do new nodes bootstrap, how nodes find which other nodes have a particular site (is there a zeronet tracker to do this?), what happens when you push a site into the network, on sites like ZeroTalk what happens when people upvote something (how can people change the content of the site and what control the administrator have and how can he exert his control - ie: run a delete query on the DB vs just remove a created file)\n- Maybe what I'm missing is how ZeroNet compares, in technical terms, with the other decentralized networks (ie: freenet, tor, etc)\n\nthanks.",
				"added": 1429732220
			}
		],
		"2@2": [
			{
				"comment_id": 3,
				"body": "http://127.0.0.1:43110/15rm8ew4pamdiFmpyYwzmEqJVx6Etnv8pP\n\nOur torrent index.\nCurrently indexing ebooks from KAT (2014-2015).\nI'll be adding torrents from other sites (TPB, libgen, etc) as ZeroNet improves the handling of big sites (ie: [compression](https://github.com/HelloZeroNet/ZeroNet/issues/98)).\nThe site is open-source, feel free to improve it!",
				"added": 1431612470
			}
		],
		"4@6": [
			{
				"comment_id": 4,
				"body": "http://127.0.0.1:43110/15rm8ew4pamdiFmpyYwzmEqJVx6Etnv8pP",
				"added": 1431634229
			}
		],
		"2@129": [
			{
				"comment_id": 5,
				"body": "Thanks for the link.\nThere are some good indexes we could add, the problem will be the site size.\nZeroNet is not yet handling big sites well. I can't add more indexes if this will break the site for current users or will reflect in a bad user experience for new users.\nFor now I guess we have to stay with KAT only.",
				"added": 1432846610
			}
		]
	},
	"topic_votes": {
		"1@129": 1,
		"14@2": 1,
		"2@2": 1
	},
	"comment_votes": {
		"18@131": 1
	}
}