{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "普丁会见安培 拿走日本北方四岛 安培吓的腿软 不敢吭一声",
			"body": "普丁会见安培 拿走日本北方四岛 安培 吓的腿软 不敢吭一声 为什么中国与日本 小小问题 都可以用嘴炮吵半天 厉害了 中国的软弱无能被小日本吃定了",
			"added": 1485004452,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 2,
			"title": "淫泆抱铜柱 大火相烧燃 南无阿弥陀佛",
			"body": "【淫泆抱铜柱。大火相烧燃。】\n\n这是邪淫的果报。“抱铜柱”，形状就像邪淫，感应变现出来的。所以我们晓得地狱是不是真的有？不能说真有，也不能说没有。为什么？业力变现的，就像我们人作梦一样。你说梦有没有？不能说有，也不能说没有。地狱里头的炮烙，这个抱铜柱是炮烙，炮烙的刑罚太残酷，铜柱烧得通红，人抱上去，这个太残酷 地狱种种这些刑罚，是你自己业力变现出来的。我们要明白这个道理，恶的习气不能不改，你要不改，将来就变这个境界，有得你受的了，真的自作自受，不是阎罗王给你受的，地狱不是阎罗王造的。人间的牢狱，人间种种体罚，不错是人造的，地狱里头不是人造的，不是阎罗王造的。由此可知，天上的福报，我们在佛经上读到的欲界天、忉利天的福报，兜率天的福报，化乐天的福报，这佛经上讲得很多，是不是上帝在那里建好了让我们去享受？不是，善业所感的善果，不是人为的。由此可知，善恶的力量不可思议，佛在经上常讲“心佛众生三无差别”，这三个力量一样大。佛陀对我们的恩德没有别的，就是把这些事实真相统统告诉我们，觉悟的人、明白的人，要知道自求多福。这两句偈就是一个小科、就是一段，为我们说明苦报的状况。这部经里面讲得简单，细说是我们一般常常读诵的《地藏菩萨本愿经》，这是大家念得最多的。",
			"added": 1485005602,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 3,
			"title": "一辈子行善做好事，死后为什么还会下地狱呢？",
			"body": "当时谛闲老法师说，上海这位程姓的官宦人家，他在上海死掉了，他有一个太太，另外有一个儿子，后来也死掉，跟一个媳妇。因为这个程老爷的太太，程老夫人很想念她先生，刚好上海那个地方有一个法国人，这个法国人他会通鬼学。我们现在讲叫什么?台湾有一个名称叫什么?叫观落阴，观照的观，落是落下的落，阴就是阴间的阴。其实我们学佛，我们不太喜欢讲这个东西，为什么?因为六道是真实存在的，但是因为怕众生执着这些东西，有罣碍，所以佛陀在的时候，他严禁弟子讲神通。但是你说神通存不存在?我们本来就具足六通：天眼通、天耳通、他心通、宿命通、神足通、漏尽通，这本有的性德。\n\n　　结果这个法国会鬼学的这个人，程老太太就拜托他说，你既然通了，你去把我先生的魂召回来。就跟他们谈好价钱，一次要一千块，那时候的钱。程老太太因为想念丈夫心切，她就给一千块，一、两千块无所谓。那天晚上这个法国人就到她家的客厅摆一个祭坛，再把电灯关掉。法国人就在里面捏诀念咒，大概一刻钟的功夫，电灯打开，但是没有见到鬼来。洋人说，哼!这个人真难找，在阴间找了半天也没找到，后来见到他在地狱，无论怎么叫他，就是叫不出来。\n\n　　各位为什么他叫不出来呢?因为业力不可思议。地狱是怎么样?《地藏经》里面讲说，地狱谁可以到?「若非威神」，要不然就是业力。「威神」就是诸佛菩萨到地狱去教化众生，「若非威神，即须业力」，要嘛就是业力，怎么可能让你一个法国通灵的，说给你叫出来就叫出来，如入无人之境，怎么可能呢?很简单嘛，你打个比方，你说你现在关系很好，给你到监狱去走一回，到监狱去，人间的监狱就好了，你不要说是民众了，就算你是法务部长，你是总统，你是部长，你到监狱去，你可以把一个犯人放出来吗?很简单的比喻嘛。不可能放出来，对不对?\n\n　　那要怎么样才可以有办法见到亲人?就是你要有超拔的功德、超荐的功德。你有超荐的功德，就像梁武帝超荐他的夫人一样，《梁皇宝忏》就把他的夫人从地狱超升到天界，所以只有福报、福力、功德力才有办法超拔，否则是不可能离开地狱的。\n\n　　程老太太她听到法国人这么一说，喔，她就火冒三丈了。她说你这个洋鬼子玩意儿，真会骗人。程老太太就恼羞成怒，因为什么?听到他先生下地狱，她恼羞成怒。我丈夫一辈子乐善好施，盖庙修桥，不升天就已经够寃枉了，为什么反而下地狱呢?这不是故意污辱我们吗?这个法国人被她训了一顿以后，因为没有证据，他也拿不出证据出来，也没有办法辩驳，白受了一顿气。然后那个法国人就说了，好啦，好啦，假如妳不信的话，如果妳另外有家人刚死不久，我可以给妳们再来做个证明。\n\n　　刚好程老太太有个儿子在娼寮，娼寮就是去嫖妓，比如像我们台北这公娼寮。在这个娼寮里面死掉没几天。有人就想起来程老太太的大儿子的媳妇，她说，大少爷不是刚死了吗?妳现在叫她来召魂哪，可以藉这个机会，叫少奶奶花几个钱把大少爷的魂召出来。洋人就插嘴说了，如果妳愿意的话，我减价一半，五百块就好了。大少奶奶很年轻，少奶奶也很想念她丈夫，心想这也好吧，找来见一见也好，安慰自己的心。就花了五六百块给他，然后把生辰八字跟死去的日子开好，给这个洋人，重新再登坛作法。这一次就不像上次一样，登坛不到一会儿功夫，鬼就来了。\n\n　　所以这个程老爷，他的程老夫人这个儿子马上就出来了，法国人就在桌子底下哭了一顿，他又说话了。那个女的就问道了，她说，你是某某人吗?祂说，对，一点都没错。她说，你现在在阴间过得怎么样呢?因为我刚死不久，还在疏散鬼之列，未受拘禁，过几天恐怕一点名就要受拘禁了，我在世的时候整天花街柳巷，吃喝嫖赌，不做正经事，造下种种孽，觉得很对不起妳，现在我走到这个地步了，也没有办法，除非妳们能够做功德，念经超度我，我柜子里面那件衣服里面有一张支票。你看祂太太也不知道。祂说，妳把那张支票拿出来，去银行把钱提出来，家里的事就请妳多费心了，好好照顾小孩，帮我去做善事，超度我。\n\n　　祂太太到衣柜里面去找，真的找到支票。这时候旁边的人就把小孩抱过来给祂。他说，你是我父亲吗?当然就哭了，哭了以后，乖孩子，你要好好听妈妈的话。这个时候，这个鬼也哭了，家里的人也哭了，客厅就一片哭声。后来又想起来说，对啊，那老爷呢?那你爸爸呢?老爷到哪儿去了呢?她的儿子就说了，听说祂到地狱去了。祂说这话的时候，鬼的哭声更大声了。程太太旁边听了，也沉不住气，忽然间就也哭了，就插嘴说了，她说你父亲一辈子行善做好事，重修某佛寺，舍茶施药，广作布施，印送经典，祂有什么孽还下地狱呢?然后她一边说一边急得不得了。\n\n　　那鬼对程老太太说，听说我父亲以前在北京做官的时候，因为那时候很穷，刚好山西发生饥馑，可能那个时候刚好是水灾或者旱灾，闹饥馑，皇上就派他程老爷到山西去赈灾，总共朝廷给他多少钱呢?给他六十万两银子。这六十万两银子他也敢污，这人命关天的钱，他也敢要，结果他把这些钱完全中饱私囊，因此饿死了成千上万的人。当时朝廷派人去调查，他父亲又行了几万两银子贿赂这些官员。他儿子就说了，因为这个事情掩饰过去，实在罪孽太大，所以到阴间没有几天就转到地狱里去了。\n\n　　然后程老夫人就说了，你父亲一辈子做的善事也不少，就算是有罪的话，将功折罪，也不致于下地狱啊。她儿子就说了，祂说，功固然有，但究竟抵不过祂的罪这么重，害死几千几万人，有功德、有善事，将来可以上天去享福，这又是另外一回事情，现在所欠的这些成千上万的命债，那得先偿还啊。程老太太听了就更火了，既然做善事没有好处，那还行善干什么呢?赶快派个人去到佛寺去，去把它拆了，把那些僧人赶跑了。\n\n【拟将修福欲灭罪。后世得福罪还在。但向心中除罪缘。各自性中真忏悔。】\n\n　　这一首偈是教给我们灭罪，怎么个灭罪法？如果说我多做好事、多做善事，将功折过，将福灭罪，能不能灭得了？灭不了，罪业还在。这在佛门里面确实有这一类的人。要如何来灭罪？这个人说老实话，他没有遇到真正善知识，他也不是真正的在学佛。他遇到真善知识，这个罪不是不能灭的，五逆十恶临命终时十念、一念都可以往生，都称之为善人，哪有不能灭的道理？他之所以灭不掉，他心没放下，没有放下。所以祖师在此地教给我们，『但向心中除罪缘』，这一点很重要。什么是「罪缘」？就是不正的知见与见思烦恼，就这个东西。我在这个境界里面，顺自己的意思，起了贪心，这是罪缘。不管你有没有做这个事情，你只要动这一念，这个念头就是罪缘。你有这个念头，你修什么福，灭不了罪，罪还在。所以人家念佛真正成就的，他是什么境界里，决定不起心动念，他把这个罪缘断尽了。所以这个才是多善根、多福德、多因缘。这些我们念佛同修一定要注意到，要留意。最好的办法就是二六时中只有一句佛号，除一句佛号之外什么都不想，什么念头都不起，起念就是阿弥陀佛。对於世间一切事，事情来了，我们就做；做完了，心里头不牵挂，还是一句阿弥陀佛，这样就是『各自性中真忏悔』。",
			"added": 1485006409,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"3_1GXrcH9qpXopc7qqy2Hb8xjSqrV93CQVqt": [
			{
				"comment_id": 1,
				"body": "民国初年很多的军阀，一生当中做了很多的恶业，到晚年的时候他自己也觉悟了，也晓得这一生造业太多，冤枉杀了很多好人，於是念佛忏悔。也不晓得是刮了多少地皮，有了钱，拿这些钱来修桥、铺路，来建庙、斋僧，做这些好事；灭不了罪。像朱镜宙老居士他就讲了个故事，这个故事是真实的。也是清朝末年，官大概也做得很大，那个时候山西一带发生旱灾，饿死很多人，那时候清朝政府就派他去做救灾，他带了不少钱到那边去救灾，结果大概是自己也贪污了很多，真正救灾的那个钱用得很少，自己独吞掉了。所以因为这桩事情，饿死了很多人，他这个因果背大了。以后清朝亡国了，清朝亡国到民国年间，他就逃到法国人租界，上海法租界，在那里住，也学佛了。很慷慨、喜欢布施，所以人家都称他大善人。\n\n　堕地狱去了。他家里人不服气，他一生是好人，修桥铺路，天天念经拜佛，还堕地狱？他儿子就把这个事情说出来，他说这个事情没有人知道，他平常也不告诉人，家里人都不晓得。他说，他有一个老朋友，现在还在上海，你们去问问他，他可能晓得。结果，果然他们就拜访这位老先生，老先生说是有这么一桩事情，听说他是吞了一些钱，但是究竟多少我们也不晓得，是发了一笔财就是，横财。你看看念佛诵经、做好事还是要堕地狱，这福没有法子。所以修福灭罪不容易，『后世得福罪还在』。",
				"added": 1485006645
			}
		]
	},
	"comment_vote": {}
}