{
	"title": "ghost study",
	"description": "My Blog.",
	"links": "- [内参](http://127.0.0.1:43110/gfwtalk.bit/)",
	"next_post_id": 13,
	"demo": false,
	"modified": 1468511168,
	"post": [
		{
			"post_id": 12,
			"title": "快鹿",
			"date_published": 1468511117.145,
			"body": "快鹿集团上演连环宫斗剧，最新的消息以现任快鹿董事局主席徐琪为首的集团出面把矛头直指前快鹿高管及相关人士，不仅在官网上大肆公布私密个人信息，扮演”人民执法机构“的角色，希望千万投资者人肉搜索高管，共同把投资者”激情燃烧的兑付火焰“移向这些所谓的债务方。\n\n　　\n\n这份《追讨名单》的发布意味着快鹿集团摇身一变从负债百亿的债务方变成和投资人“统一战线”的债权方，不过此举被投资人认为又是一招龌龊的障眼大法，求得金蝉脱壳，所谓“赴美看病“半年之久的故事主角施建祥不仅依然未归，且作为快鹿集团实际控制人，和疑似目前整个兑付事件与徐琪扮演双簧的幕后操纵者，多次利用大批投资人的善良，并利用涉黑手段威胁一些被迫牵连但秉承职业良知的高管，挑战人性底线，而施至今并未被追究任何责任，逍遥法外。\n\n　　\n\n而据施身边人的可靠消息，兑付危机爆发之后，因为担心政府立案，施拿着香港身份证以及第三国护照第一时间出逃美加，在海外过着奢侈糜烂的生活，并录视频利舆论拖延时间转移资金。\n\n　　\n\n另据施建祥身边人爆料，“施天生自认自己是现代皇帝，生活奢靡腐败，身边共有4个情人10年来为其陆续生了10个私生子，并还有为他端茶倒水按摩的小妹，只要在身边服侍，都鸡犬升天购置豪宅，跑车。而四个女人各自在施身边扮演着不同的角色，内宫相斗的戏一点不亚于甄嬛，而她们唯一的共性就是在快鹿集团鼎盛及危机来临时照样购置数亿的巨额房产及过着极度奢侈的生活，她们之间错综复杂的关系，小编带你来扒一扒施建祥身边的女人：\n\n　　\n\n女一号：快鹿集团副总裁沈燕（与施育有一儿一女）\n\n\n\n\n \n\n　　\n\n沈燕现担任东虹桥担保公司以及长宁东虹桥小贷公司法人，并同时负责快鹿企业政府关系，与多位政府高管私交甚好，也是陪同施建祥经常出入公开场合的第一人选。\n\n　　\n\n沈燕是施建祥既原配后唯一一个带到场面上的女人，据快鹿内部人士透露，快鹿鼎盛期上万员工早以“大老婆身份”对沈燕毕恭毕敬，沈燕如此受宠，源于她是唯一一个和施出生入死的女人。沈燕对施的感情很难用海枯石烂来形容，在多年前轰动一时的镇江房地产事件时施建祥就因为欺诈，涉黑和快鹿高管韦焱平被公安追捕通缉，沈燕毫无反顾第一时间愿意替施顶罪坐牢。多年来不求名份，安心做好身边女人，帮助施打点各种人脉”。\n\n　　\n\n这位内部人士透露，施建祥长期包租于两栋虹桥迎宾馆别墅，并在去年又豪掷2千万装修西郊别墅。在快鹿鼎盛时期，施夜夜笙歌，经常请所有高管，明星在别墅聚会，并放下豪言旗下融资平台每日进账上亿，花出去的钱才是钱。施喜欢玩喝酒送钱游戏，只要谁在规定时间内最快喝完一瓶茅台，奖励现金20万，所以包括施身边的多位少林寺聘请的贴身保镖，只要喝一个晚上的酒就能轻松进账几十万，这样的事情不要说对普通山村里出来的穷孩子，就是对见惯大场面的明星都是极大的诱惑，所以时间一长，施的身边少了真正做事的得力干将，多了一大批贪恋声色的蛀虫。”\n\n　　\n\n据悉，施也对待沈燕不薄，在上海为其购置多套中心地段豪宅，根据调查，仅其中一套上海淮海路别墅（美美百货对面），价值就近2亿人民币。\n\n\n\n\n \n\n　　\n\n另外，沈燕为施早年生下一个儿子，但知道施思女心切，不顾高龄风险，在前年又特意在施的生日为其生下一个女儿，营造父女同日的家庭温馨场面，希望赢得施更多的陪伴时间。去年女儿周岁，施在上海虹桥迎宾馆设宴百多席，众多上海名流，包括上海电视台著名主持人组成联合阵容，海派清口夫妇以及娱乐圈众多明星登门道贺，架势不亚于地方台春晚。\n\n　　\n\n女二号：侯茜（与施育有两儿）\n\n\n\n\n \n\n　　\n\n侯茜主要帮施建祥运作香港境外资金往来以及替施维护香港明星关系。侯茜来自于辽宁抚顺，在上海某发廊偶然与施相识。因为长相乖巧，听话，火速成为施的女人。从2014年开始，施逐步开始关注香港资本市场，侯茜就开始成为施在香港资金部署的管家。\n\n　　\n\n据快鹿消息人士透露，侯茜是唯一一个能调动快鹿集团资金出境，几年经手超过几十亿现金。“老板非常信任侯茜，不仅在境外资金部署，包括施多次乘坐私人飞机，私密行程制定一定不假别人。”所以在兑付事件刚爆出之时，施就已经秘密转移到香港。去年春节后，施一直在谋划香港业务落地，并每年耗资数千万港币租住香港顶级别墅供其使用。此别墅保安严密，内部及其奢华，据施身边亲信透露，侯茜接手别墅后，对其装修风格还不满意，重新大肆装修，每款家具由侯茜亲自挑选，从意大利定制空运到港，并购买了大量名画。\n\n　　\n\n\n\n\n\n另外，快鹿消息人士表示，施经常在别墅宴客，包括香港一二线明星是别墅常客，施作风豪爽，别墅管家透露光直接从法国购置空运到港的82年拉菲，PEtrus等超级红酒几十箱地备货。施还对侯茜出手购买了香港中环黄金地段的半山麦当劳道君铂期房，与在当时香港普遍低迷的气氛下，此交易一度成为香港主流报纸的重大地产交易新闻。据2016最新的评估报告，香港半山麦当劳道君铂价值已过亿港币。\n\n\n\n\n　　\n\n香港物业购置记录，目前估值达7600-8000万\n\n\n\n\n除此之外，侯茜在香港主要负责应对香港本土明星及海外明星关系。电影行业分析师描述，“施进军电影圈的必杀计谋不是靠日积月累的行业作品积累，而是靠洋洋洒洒的现金重赏牢牢绑实和明星的关系。”在2012年8月30日，香港娱乐杂志重磅刊登的一条标题新闻就是：“钟镇涛三女儿拜上海富豪施建祥为干爹，收百万现金” （插图六）。施用这种方式聚拢人心，但也被娱乐圈一些所谓资源人士蒙骗，叶问3的票房发行结局就是最好的例证。\n\n\n\n\n \n\n　　\n\n女三号：上海东虹桥小额贷款总经理及快鹿集团总裁张蕾（与施育有一儿）\n\n　　\n\n作为施的又一个隐形女人，张蕾这个名字对大多数投资人来说并不陌生。自施建祥第一时间出逃后，与徐琪联手登台的就是这位“职业女性”。张蕾的简历显示，张蕾每次登场及其强势，貌似雷厉风行的作风赢得投资人的信赖，实则阳奉阴违的作风天天在为施通风报信。\n\n　　\n\n据悉，张蕾在施内宫斗争中曾经不算得意，在快鹿几年前发生的被媒体曝光出做假账，欠税等几乎压垮施建祥的那次危机中，张蕾当时作为快鹿集团一把手，不听施的指挥，擅作主张。此后很长一段时间，张蕾被施打入冷宫，可在此时张蕾已经怀孕，施就顺势送上上海古北御翠豪庭，价值近4000万人民币。去年施再次任命张蕾出任东虹桥金融在线董事长， 据消息人士说兑付风波最剧烈的时候张蕾我行我素，继续在北京置业过千万豪宅。\n\n\n\n\n \n \n\n　　\n\n另据施多年的管家爆料， 与施有染的演艺影视界明星杨某，艾某等不乏其人，而施身边的女人还有女四号。。。五号。。只要和他粘上一点关系，甚至每晚的一桌麻将，一顿饭局就有可能鸡犬升天，这样歌舞升平的日子在快鹿危机爆发之前每天都在上演，涉及巨额资金。我们不禁试问，这场闹剧的主人公作为实际控制人，是否该真的接受不仅是金钱上的审计，更是道德上的审判？贼喊捉贼的闹剧难道政府还不该马上出面收场？\n\n\n\n\n"
		},
		{
			"post_id": 11,
			"title": "田小姐的商业逻辑到底是什么？",
			"date_published": 1468119053.329,
			"body": "首先，田朴珺旗下的公司注册资本都不高，也没有什么实业。公司类型分两种，一种是以影视文化为主的。这个好理解，随着近几年，田朴珺的知名度越来越高，她一方面有经营自己形象和自我IP价值的需求，另一方面，影视明星出身的田小姐也有经营影视行业的野心，想想看，一个之前一直不火的配角，变身为制片人、投资人，可以和导演商议剧本，指点拍摄，想想都让人激动啊。\n\n　　田小姐通过北京玖阳晟禾科技有限公司参与制作出品了《中国合伙人》，对于这种翻身做主人的心态，田小姐在那篇著名的《陈可辛：我的男闺密》中有淋漓尽致的展现，“……我想参入《中国合伙人》的投资，我们认识10年，关系这么好，我又是第一次开口，想他对我的加镑投资欣然接受，不料他觉得说服不了别的投资人，拒绝。我一气之下三个月没理他。后来不知道什么原因他又回头找到我。”“再后来，他请我看预告片，我提意见，争论一条片子剪得好不好，他很生气，摔门就走。可过两天，他又拿着新剪的片子给我看。”呵呵，时代君不知道金像奖大导演陈可辛怎么想，反正站在田小姐这边看，心里肯定是痛快至极的。要知道，在10年前，在陈可辛监制的电影里面，田小姐还是那个需要出演激情戏博出位的小配角“焯匀”啊！！！\n\n　　田小姐另一部分公司的商业逻辑就很简单了，更多的接触各界大佬，然后充分利用个人交际圈和人脉资源，因此举行文化艺术交流活动，也包括资产管理和投资管理等。可以染指房地产项目的运营、管理、投资咨询等。如果看看田朴珺母女此前注销的几家公司，可以发现这一经营思路早在遇见王石之前就已经形成，只不过方向建立在艺术品和房地产上罢了。而现在，田小姐还学会了跟紧风口，深入健康产业，其建立的圣朴骏辉健康管理，商业逻辑无非还是运用手中掌握的高端人群资源在健康产业变现的套路。\n\n　　这一商业模式，成本小，收益大，活儿不累，又有面儿。\n"
		},
		{
			"post_id": 10,
			"title": "田朴珺此前在接受腾讯娱乐采访时谈及烂尾楼生意曾透露，“我的第一个项目是2006年底开始，一直做到2011年，前后五年把它完成。那时候刚好有个香港上市公司给了我机会，让我去学习房地产。”但这个香港上市公司并不一定是万科，要知道，尽管2006年田小姐上了长江商学院，但当时和王石应该还不熟，另外，时代君同样注意到，网上有传言称，香港上市公司汤臣集团的董事长汤子嘉曾是上海姑娘田朴珺的前男友，汤臣集团在上海的房地产生意也做的很大。所以，在没有确切证据的情况下，说田小姐挖了谁的墙角都不合适。",
			"date_published": 1468119009.38,
			"body": "Blog post body"
		},
		{
			"post_id": 9,
			"title": "泰国新闻报道，在2011年10月发生的泰国水灾期间，田朴珺曾经向泰国皇室捐款120万泰铢（约23万元人民币）。当时的新闻是这样写的：“中国著名房地产商人，影视明星田朴珺小姐以及令慈郝秀华女士为泰国水灾捐赠价值120万泰铢的药物，诗琳通公主私人秘书阿拉雅诰命夫人代表公主基金接收。” 新闻说明郝秀华正是田小姐的母亲。",
			"date_published": 1468118633.739,
			"body": "Blog post body"
		},
		{
			"post_id": 8,
			"title": "一旦宝能进入，万科20多年的账务黑幕就会揭开",
			"date_published": 1467901584.32,
			"body": "Blog post body"
		},
		{
			"post_id": 7,
			"title": "万科全天继续跌停",
			"date_published": 1467714127.829,
			"body": "今天另一个值得关注的事件就是万科全天继续跌停，但最后一刻钟成交量1.83亿股，成交金额达到了36.1亿！虽然没能将万科跌停板冲开，但万科尾盘集中式的成交还是说明了“宝万之争”愈演愈烈。现在，全国股民几乎都在想“宝能系何时爆仓”，但“不差钱”的宝能系肯定不会坐以待毙，更激烈的交锋将很快到来。因此，万科距离打开跌停已经不远了。"
		},
		{
			"post_id": 6,
			"title": "“命令”！",
			"date_published": 1467642432.881,
			"body": "啥叫资本主义？就是资本说了算；啥叫社会主义市场经济？就是政府说了算。两边一平衡，谁说了也不算！最终说了算的不是王石、不是华润、更不是宝能，而是能让所有万科股东都能不敢再开口的最高层——星期一万科开盘应该是来自“命令”！"
		},
		{
			"post_id": 5,
			"title": "刘元生的举报信",
			"date_published": 1467641035.889,
			"body": "刘元生的举报信：\n\n　　致中国证监会、中国银监会、中国保监会、国务院国资委、深圳证券交易所、香港联交所、深圳证监局 ：\n\n　　自华润宝能一致声明反对重组预案，宝能提议罢免全部董事监事后，万科 H 股股价连续下跌，创一年以来新低，因此作为中小股东极为担心万科 A 股复牌的走势，以及万科的长期发展。我们非常欣慰地看到， 6 月 27 日深交所致华润、宝能的关注函，但据传，这两家公司均已回复深交所不存在一致行动人关系，没有违法违规行为。我们认为事情不能到此为止。为帮助监管部门督促华润、宝能披露真相，保护中小投资者权益，我们在此提出以下几个亟待澄清和调查处理的重大问题：\n\n　　1 、宝能系与华润到底有多少合作项目？双方到底有多少重大利益关联？ 双方在哪些事项上达成了一致行动的交易？\n\n　　从公开信息看，宝能和华润过去和现在均有很多项目存在重大利益关联。正在建设的华润置地前海项目由华润置地于2013年公开竞标以 109 亿获取土地，之后分宗三块土地，并由华润吴向东引入宝能合作开发。具体为，2015年7月，华润置地将其中二块土地权益（合计15万平米建筑面积）全部转让予宝能系，另一块商住用地（合计35万平方米建筑面积），则由宝能系与华润共同开发。宝能系合计出资59亿，占有了华润置地前海项目约60%权益。股权出让后 3 个月，华润信托提供 36 亿资金用于宝能地产的增资和房地产项目开发。如此优质的项目，央企华润居然出让一半股权给民企宝能，甚至让宝能系人员担任华润置地前海有限公司的董事长和法定代表。更据香港资本市场的消息称，连这 59 亿都不是姚老板自掏腰包，均由华润提供融资。请问以上情况否属实？\n\n　　2014年底开始，深圳的房地产价格不断攀升，同一地段卓越前海项目卖出10万每平米高价的情况下，华润仅是在该块土地取得成本基础上略微溢价后，就将60%多的土地权益转让予宝能系，华润的这等种法是否涉及国有资产流失，以及向民企输送利益？2015年7月24日宝能系增持万科股份至5%以上，2015年7月28日华润置地将华润置地前海项目合资公司50%的权益转让予宝能系（合计35万平方米建筑面积）。2015年9月30日，华润置地前海项目合资公司的董事长变更为宝能系张保文，2015年10月起，宝能系开始第二波疯狂增持万科的举动。以上时点高度重合。特别要提醒注意的是，在宝能系正疯狂增持股票，向华润作为第一大股东做出重大挑战的情况下，华润与宝能系就华润置地前海这一重大项目进行如此紧密的合作，请华润和宝能解释动机？华润和宝能有没有秘密协商，一致行动？\n\n　　另外，请宝能系和华润说明，华润今年 4-5 月增持东阿阿胶(000423,股吧)4.66% ，但华润增持之前，前海人寿也从一季度开始买入东阿阿胶 2.44% 。为何前海人寿如此巧合在央企增持前出手，双方是否存在内幕交易和一致行动？ 双方究竟是哪一年就开始合作的？除了以上合作事项外，是否存在其他合作项目？具体的合作条件、合作形式、合作金额和总规模？\n\n　　在3月17日的股东大会上，华润对引入深圳地铁、推进重组、继续停牌投赞成票，举牌企图控股万科的宝能的态度竟然也来个180度的大转弯，与华润协调一致投赞成票，在6 月 23 日深夜，宝能、华润双方先后发表相差约 10 分钟书面声明，一致反对 6 月 17 日董事会通过的重组预案， 时间间隔如此之短、内容连内部控制人的指控用词都高度一致，双方是否事先协调过立场？ 6 月 27 日万科年度股东大会上，华润与宝能协调一致，共同投票反对万科董事会、监事会报告，其中华润甚至为此做出前后矛盾的投票，双方还都声明将在未来的股东大会对重组预案联手投反对票。宝能要罢免万科全部董事，华润方面长时间不吭一声，是否是双方已有默契和协调？现在被迫发声表示意见与宝能并不完全一致是否因华生教授指出双方涉嫌一致行动人关系不敢再明言支持？双方还有哪些协调一致的行动或计划？\n\n　　2、宝能与华润是何时在万科第一大股东地位问题上开始谈判交易？先后达成过哪些默契与协议？\n\n　　根据万科独立董事华生教授的文章，宝能举牌万科后，万科多次向华润请求增持，华润均推诿或否决，待宝能坐稳第一大股东宝座之后，华润开始劝万科管理层接受现实。\n\n　　华润是什么时候决定放弃第一大股东地位的？华润要求万科接受宝能作为大股东的初衷是什么？另请宝能和华润分别说明，在宝能举牌前，双方有没有就此进行过接触和共同策划？双方有那么多项目合作，在宝能举牌之前和举牌之后双方能没有接触和谈判乃至交易吗？宝能现在对华润亦步亦趋，当初没有华润默许或承诺敢举牌抢夺控股权吗？请和宝能合作密切的华润置地吴向东说明，其是否就宝能举牌万科计划和姚振华接触并共同策划过？是否计划被宝能推举为万科董事长？\n\n　　再据华生教授文章披露，在6月17日 董事会上，华润代表发言表示“华润已经与宝能接触，宝能不反对华润成为第一大股东”。请问，宝能又是什么时候以何种形式和华润达成默契或协议，同意把第一大股东地位让回给华润的？ 华润的董事、监事事先同意了万科年度董事会、监事会报告，却在 6 月 28 日万科年度股东大会上与宝能一道否决了相关议案， 事先是否协商过 ？ 据传， 在6月18日董事会召开之前，宝能和华润已签署了正式秘密协议。请华润和宝能分别说明，是否签署了秘密协议，是否未来有股权转让计划？\n\n　　3、双方对深铁重组联手出尔反尔，背后有何阴谋？\n\n　　华润和宝能在3月17日的股东大会上，共同赞成推进与深圳地铁的重大重组事宜，主张股票继续停牌。而当又停牌3个多月后，又双双反对深圳地铁重组预案。这被华生教授批评为出尔反尔后，又辩解说他们当初同意的是与深圳地铁合作这个方向，现在反对的是对深圳地铁发行股份的预案，因为这会摊薄伤害现有股东利益。这我们就不明白了，如果不给深圳地铁发新股，按华润的方案只是花钱买土地，这根本不是什么重大重组，也根本不必停牌，自己花钱买了就是了。华润涉事人和宝能都是资本市场上的老手，连这点常识也没有吗？如果你们一开始就反对向深圳地铁发新股，那赞成停牌推进重组、让股票无故多停牌3个多月不是坑人吗？到底是什么使你们从开始一起赞成到后来联手反对？这背后有什么阴谋和交易？这与你们之间关于万科第一大股东位置的交易是否有关？\n\n　　4、隐瞒双方达成第一大股东易主的秘密协议，是否已明白无误涉嫌内幕信息、内幕交易和市场操纵？\n\n　　华润方面在6月18日董事会上公开承认宝能已同意华润当第一大股东，外面传言华润方面敢说这个话因是双方已有书面协议或承诺函。在这种情况下，华润方面如果在6月18日成功否决重组预案，股票因重组失败必须在周一即6月21日复牌。这样就会完全如华生教授分析的那样，我们这些中小股东一定以为王石的股权保卫战已宣告失败，宝能系可以无阻碍的增持上位全面控盘，故而肯定持股待涨。市场上也会有一大批投资者冲进来以待宝能进一步增持举牌获利。这时去年追随宝能系杀入万科的各路资金的内幕知情者，必然高位出货。等到真相大白，宝能让华润重做第一大股东的消息传出，市场势必狂跌，从而坑死我们这些等着宝能增持而持股不卖的老股东和高位新杀进来的市场投资者。按华润方面在董事会上的提议，在股价落定后，再对华润定向增发。\n\n　　更新的市场传闻是，这些内幕操刀者更阴险的计划是，若此时市场跌得太狠，华润的股票没问题，但宝能手上股票已被锁定还有半年期，为防止自己的股票爆仓，宝能已筹集大量资金，准备在底部建仓（有消息说，3月份时由于深圳地铁的消息出来得太突然，宝能没资金准备怕爆仓，故与华润方面的内部人商定要先支持重组，再停牌几个月。这恐怕是他们当初在股东大会上支持重组停牌的真正原因）。宝能建好仓然后举牌，推涨股价，给市场以宝能可能还想控股万科的幻想。这样在二级市场上反复赚足了之后，待今年年底宝能所持股票解除锁定，宝能再按秘密协议将自己的股票转一部分给华润，恢复华润的第一大股东地位。因此，华润的涉事内部人与宝能秘而不宣的达成转让股权协议或承诺，已构成内幕交易。其目的是利用内幕信息操纵市场，谋取非法巨额暴利。华润主刀此事的当事人与宝能已明显涉嫌内幕信息、内幕交易和意图操纵市场罪。这即便从已经公开的信息看，也已经铁证如山，建议监管部门立即立案调查，严肃查处这批证券市场上的害群之马和国企内部的蛀虫，也挽回华润这家有着光荣历史的央企的市场信誉，以避免给党和国家造成进一步更大的负面影响。\n\n　　5、多个迹象表明宝能用于收购的资金来自不合规的银行资金，用于收购的主体故意规避法律法规的明确要求，请问宝能是不是利用违法资金和不合规主体收购并控制上市公司？\n\n　　据报道，宝能系用 26 倍杠杆，引入浙商银行等资金购买万科股票。请宝能系说明是否在用银行理财资金购买股票？是否符合银监会的规定？是否符合证监会关于场外融资、去杠杆的政策规定？ 这些银行资管计划的投资人，是否知道自己的资金正在暴露于巨大的风险之下？\n\n　　前海人寿最终股东是宝能系和四位自然人。四位自然人的股权都是从宝能系购买。请前海人寿说明该四名自然人与宝能有没有关联和一致行动关系？符不符合保监会的规定？四个自然人出额 40 亿元，资金来源是否合法？是不是代持？\n\n　　我们看到基金业协会法律部主任公开质疑了万能险投资的股票投票权问题，而保监会表示保险资金入市不违规。但是，请保监会明确：用保险资金投入不同股票以实现保值增值是合法的，但利用巨额保险资金为其实际控制人的公司去抬轿子、担风险，图谋控股与自己有利益冲突的实体公司，这也合法合规吗？\n\n　　鉴于万科A股复牌在即，强烈建议相关监管部门包括相关纪监委部门，立即行动，保证市场的公开透明公正。\n\n　　刘元生等股东\n\n"
		},
		{
			"post_id": 4,
			"title": "a note - this thing is getting interesting, as expected",
			"date_published": 1467640695.214,
			"body": "7月4日晚间，华润官方微信公众号发布声明称，6月17日万科第17届董事会第11次会议审议万科重组预案是否通过出现了严重的争议。7月3日，北京市竞天公诚律师事务所会同北京大学企业与公司法研究中心邀请国内13位权威法学专家召开了“万科股权争议论证会”，就董事会决议效力、一致行动人等相关法律问题进行了研讨。"
		},
		{
			"post_id": 3,
			"title": "长期的变相MBO（管理层收购）",
			"date_published": 1467629659.603,
			"body": "关于“万科王石”大战“宝能姚振华”的文章有无数，但我发现，多数文章都没写到点上。本文将回答你如下几个看似奇怪，其实说穿了又很简单的问题：\n\n \n\n1，为什么姚振华要花如此大的代价收购万科？\n\n2，为什么万科的股票长期不涨？\n\n3，为什么说好的100亿回购就只花掉一亿多？\n\n4，面对宝能系的收购，为什么王石的表现如此激动？\n\n5，万科的管理层真的不想要股权吗？\n\n6，万科的股票，现在还能买吗？\n\n \n\n在继续下面的文章之前，我还想告诉你一个简单的道理，明白了这个道理，你就能看清很多事情。这个简单的道理是：我们每个人最关心的都是自己的利益，但是在维护自身利益的时候，我们会用一套冠冕堂皇的话来包装，这样就可以让自己看起来很有情怀，就可以装逼。所以，你不要把时间浪费在这些废话上面，而是搞清楚他们的利益点在哪里。\n\n \n\n万科是不是一个优秀的企业？当然是！但是这个企业的管理层只拥有很小一部分股权，你以为他们不着急吗？但由于大股东华润是个甩手掌柜，因此万科管理层并不太担心自己的位置会被替代。于是，他们就设计了一个长期的变相MBO（管理层收购）方案。\n\n \n\n这个方案的要点是：压低股价（比如隐藏利润），多多给自己发奖金发工资。拿了奖金就可以参与两个资管计划（金鹏计划和德赢计划），用来购买自家低估的股票。等买的差不多了，就把隐藏的利润拿出来，股价一涨大家都爽歪歪。\n\n \n\n现在你就明白了为啥万科不愿意大力回购自家股票了吧，因为人家还没买够啊，他还要想办法压低股价呢。用公司赚的钱给自己发高额奖金，用奖金买公司股票，这样一来就可以空手套白狼，不需要付出什么代价即可实现管理层控股。\n\n \n\n截至2015年12月15日，“金鹏计划”与“德赢计划”合计持有万科股票860,668,839股，占万科总股本比例为7.79%。这个数量按理说已经不小了。这距离“万科事业合伙人计划”推出才仅仅过了一年多的时间。如果再给几年时间，买到第一大股东的位置也不奇怪。\n\n \n\n本来这一切都是那么的完美，可是野蛮人姚振华的到来打破了他们的美梦。野蛮人一来就大手笔狂买万科A，一下就变成了万科第一大股东。这样一来，他们的变相MBO计划还能进行吗？万一大股东要求对财务报表进行重新审计，那些被隐藏的利润怎么处理？现在你就明白为啥王石会那么激动了吧，一会儿说人家是卖菜的不够格，一会儿说人家信用不够，其实这些都是借口，真正的原因是姚振华直接触动了他们的核心利益！其实要论出身的话，王石真的没法跟人比，姚老板好歹是正牌大学的双学士，王石你只是个文革推荐的工农兵大学生。\n\n \n\n对于小股民来说，姚老板一来就猛拉股票，股票涨了大家都高兴，姚老板简直是大善人。但对万科管理层来说，你现在猛拉股票，可是我们还没买够啊，我们这么长时间压低股价，竟然是给你做嫁衣。你已经变成了第一大股东，我们的小算盘还怎么玩下去？王石不希望姚振华继续买股票，就随便找了个借口停牌半年，然后再找人来重组。最好是找一个像华润一样的甩手掌柜来当第一大股东。不求他能帮上多大忙，只求别管我们就行了。\n\n \n\n让王石没想到的是，他引入深圳地铁的行为触怒了华润。华润心想：我这么多年来一直不说话，你还真把我当吉祥物了。王石硬把华润赶到了宝能的战线。如果华润和宝能联手，就有接近40%的股份，深圳地铁肯定是进不来的。这下王石是真的慌了，所以才在股东大会上服软认怂，说要跟姚振华道歉，还说“恶意收购”是个中性词。但是现在才认怂，真的是太晚了。\n\n \n\n现在我们就可以回答本文开头的6个问题了：\n\n \n\n1，为什么姚振华要花如此大的代价收购万科？\n\n答：姚振华认准了万科被低估，因此才敢用高杠杆狂买万科股票。\n\n \n\n2，为什么万科的股票长期不涨？\n\n答：管理层故意压制，在他们买够数量之前就上涨，不符合他们的利益。\n\n \n\n3，为什么说好的100亿回购就只花掉一亿多？\n\n答：因为不想股价涨太快呗。\n\n \n\n4，面对宝能系的收购，为什么王石的表现如此激动？\n\n答：野蛮人触动了你的核心利益，你能不着急嘛？\n"
		},
		{
			"post_id": 2,
			"title": "王石",
			"date_published": 1467541389.942,
			"body": "什么鬼？\n\n宝万股权之争如火如荼，你方唱罢我登场，好不热闹。整个事件，就是赵家人--既得利益集团内部争斗，18次华山论剑后，权力的重新洗牌，利益的二次分配。不论谁胜了，都没有屁民半分好处。神仙打架，股民遭殃。大清洗后的华润，花落谁家？资金来源可疑、神秘的宝能系姚振华，又一个红色权贵的白手套。失去特权庇佑的王石，就是一条人人喊打的落水狗。\n可耻的是一些舔菊犬儒，跳出来故意混淆是非，令人作呕。感情代替理智，奴颜谄媚权贵，不守真理底线，中国腐儒的通病，1949的错误选择，1958被整的死去活来，斯文扫地，还是不长记性。没有规矩，不成方圆。人治永远不如法治。为了守住规矩，别说一个渺小的王石，即使元首也要废除。向伟大的英国公民学习吧，邱吉尔何等功勋贡献，二战胜利后，在伟大的英国公民选票决定下，老老实实地退休。英国公民的睿智在于：不惯坏公仆，不培训养暴君，不为自己编绞索。\n\n1.老色鬼\n2012年10月年逾六十的爱登山的地产大鳄王石与王江惠离婚，和三流演员田朴珺同居。王石生于1951年，50后。而田朴珺生于1981年，80后。两人整整相差30岁!名副其实的父女恋!不惑之年的王石，老牛回头吃嫩草，社会观感极差。有钱的王石，就是如此任性，全国屌丝只能是羡慕嫉妒恨。但是，王石的此次婚变，犯了赵家家规，为3年后宝万股权之争埋下导火索。\n2.红小鬼  \n王石是正儿八经的红二代，父亲是老红军叫王辉，早年参加红四方面军，是王震三五九旅的老下属，当年曾随王震到新疆组建新疆生产建设兵团，担任过兵团副司令员，王震后来率工程兵团到深圳开发特区，王石父亲也南下，全家都迁到了广州。王辉后来担任柳州铁路局局长职务。王石的前岳父叫王宁，是20世纪80-90年代的广东省委副书记、政法委书记。王石初中毕业后，他没有去农村插队，而是依照父母的意愿去参军5年，复员到郑州铁路局做锅炉大修车间的工人。当铁路局拿到2个推荐上大学的名额时，据王石的说法是“老师傅们因为王石吃苦耐劳受人喜欢而一致推荐了他上兰州铁道学院”。那时，王石父亲是柳州铁路局的副局长。1977年毕业，分配到广州铁路局工程段工作。在此期间与王江惠结婚，1977年下海经商，通过倒卖玉米赚了300万元，挣得第一桶金。1988年，创办“万科”，发行股票集资2800万元，开始涉足房地产业。王石在深圳的事业越做越红火，用他的话说，“一直粗放式地赚着钱”。\n3.胆小鬼           \n2008年5月12日，在为四川地震灾区捐款200万元之后，万科董事长王石表示，“万科捐出200万是合适的”，并规定“普通员工限捐10元，不要让慈善成为负担”。王石的正确言行，被遭受高房价折磨的仇富民众舆论炮轰，让他好不容易积累起来的市场口碑顷刻倒塌。王石本没有错，救灾应当是政府职责，但迫于舆论压力屈服了，对公司“捐款门”事件公开道歉，补捐1亿重建灾区资金了事。此事充分暴露了王石懦弱胆小的一面，不敢坚持原则，受舆论绑架，低头违心认错，随波逐流。\n2013年7月15日，王石公开在微博上“检讨重庆事件”，并为自己曾经的懦弱表示忏悔：“检讨重庆事件：在唱红打黑期间，一大批重庆工商业者被强制关进牢房、没收财产，生命尊严也失去了法律保护，甚至为被告辩护律师亦被冤屈判刑入狱。我采取了不吭气的态度。反思：是懦弱错误的行为。对违反法律，侵犯财产、侵犯生命的权力部门应该明确态度：不！”\n4.吝啬鬼 \n王石干的好坏，大小股东最有发言权。毕竟利益相关，外人都是看热闹的。王石把持的万科，给投资者带来多少真金白银的回报呢？\n作为地产龙头企业，万科的股价长期被压低，在2015年以前一直采取低现金分红，站在投资者的角度来看，假如2007年投资者以31.53元买入万科的增发股，到2015年“宝能系”增持之前万科A的股价不到14元，复权不超过22元，加上累计分红1.4元，一共23.4元，亏损30%左右。近十年里，万科股价一直在低位徘徊，通过调节财报项目下的“盈余公积”，使得股东的现金分红基数变小。2015股灾后，万科高调推出的100亿元股权回购计划也成了“空头支票”，几乎没有执行，未起到稳定和提升股价的作用。而与此相反的是，万科管理层掌控的资管计划却耗巨资购买了大量万科股票。直到“宝能系”大量购买万科股票后，万科股价才出现大幅上涨。王石这个董事长现在既不代表中小股东们的利益，又不代表大股东的利益，你代表谁的利益呢？\n宝能提请公司董事会召集2016年第二次临时股东大会，审议如下议案：提请罢免王石等公司董事、独立董事、监事职务。王石先生于2011年~2014年担任公司第十六届董事期间，前往美国、英国游学，长期脱离工作岗位，却依然在未经股东大会事先批准的情况下从万科获得现金报酬共计5000余万元。万科缺少股东层面实际控制人、有效监管手段缺位的情况下，王石先生利用董事（长）地位获取巨额报酬，损害公司和广大投资者利益，严重违反《公司法》等法律法规规定的董事勤勉、忠实义务。万科从2008年宣布无实际控制人开始，已经偏离上市公司规范运作的要求，万科管理层控制董事会、监事会、越过公司股东大会自行其事，王石先生作为董事长，对此负有直接主要责任。\n5.孤魂野鬼\n万科是一个什么样的企业呢？万科的总经理郁亮一次向当时华润的老总宋林汇报工作，谈万科的远大规划，宋林问：“那股东的利益在哪呢？”诚如第一大股东央企华润尚且如此无奈，可见王石背后的力量和王石有多大的权利和自由，但是，这种混合制当时并没有阻碍万科的发展，相反万科得以高速发展。经过近三十年的发展，王石及管理团队现在都成了既得利益者，为确保既得利益，管理层明着一个盈安合伙人金鹏资管计划，背后一个德盈资管计划，被曝已购买万科7.79%股权，涉及资金60亿元，资金来源成谜。这是想把自己的利益固化，而宝能的突然闯入令王石们惊慌失措，一下子打乱了他们的计划，这才是王石不顾一切反对的原因。“这么多年来，（万科）一直是国有股占第一大股东，我过去设计是这样的，现在是这样的，将来也会是这样的。所以民营企业，不管我喜欢你，不喜欢你，你要想成为万科的第一大股东，我就告诉你，我不欢迎你。”这是王石的真情表露，万科本是国企，王石故意混淆视听，把万科说成混合制，实质上万科永远是王石的私人禁脔，不容任何人觊觎。他是想一直这样模糊身份，游走于公私之间，两边叨食和不受约束，王石虽然没有压倒性的股份，但是牢牢控制了万科的一切。所以，王石既不敬原第一股东华润，也看不起现第一大股东宝能。万科2015年度股东大会上王石说：“我的去留已经不是很重要了，重要是万科的文化能延续下去。从某种角度来讲，我们是万科文化的守望者。如果郁亮能够取代我成为万科的董事长，我愿意辞职。”是恋棧，还是想垂帘听政？\n一个60多岁的老头，没有了权力和金钱，如何吹牛撩妹"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your blog has been successfully created!"
		}
	]
}