{
	"next_post_id": 4,
	"next_comment_id": 1,
	"next_follow_id": 2,
	"avatar": "jpg",
	"user_name": "Freebaby",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"intro": "变法完成，中国虽然能再保持10年的稳定，但同时也失去了一次真正崛起的机会。",
	"post": [
		{
			"post_id": 1,
			"date_added": 1520498101,
			"body": "你好 ZeroMe!"
		},
		{
			"post_id": 1520498202,
			"body": "一旦自由，反而手足无策了",
			"date_added": 1520498200
		},
		{
			"post_id": 1520498655,
			"body": "【虽然是假的，但说得不错】\n\n我，蔡英文，自由台灣的女兒，秉持天道，受主權者托付，就職“中華民國總統”，榮膺台灣“國家元首”之位——在民主之邦，民意即天道，民心即主權者的意誌。\n二〇一六年，台灣人民又一次以主權者的意誌，透過自由而公正的選舉，做出重大的命運抉擇。\n此刻，佇立於時代之巔，站在自由台灣命運的轉折點，接受生命之源太陽的祝福，我向蒼天和大地誓言：“必以大公無私之心，鞠躬盡瘁之意，忠誠履行總統天職；為讓自由台灣成為壯麗的國家，為讓台灣公民成為令人尊敬的世界公民，而殫精竭慮，竭盡所能。”\n是的，請曆史記住我的總統誓言——「讓自由台灣成為壯麗的國家，讓台灣公民成為受尊敬的世界公民。」\n我以此為誓，隻因為這句誓言是回響在當代台灣人民心底裏的對國格和尊嚴的呼喚。\n台灣翠青，物華天寶，人傑地靈；處四麵通衢，八方來風之要。雖為海島，在精神價值上卻有煌煌大國之浩蕩雄風，燁燁宏邦之朝日神韻——十五億人的華文世界裏，自由台灣是唯一的民主聖地；全球範圍內，民主台灣屬於最自由的國家之列。\n做為自由台灣的總統，榮耀和責任同樣沉重。我願把台灣人民賜與的榮耀，虔誠地供奉在心靈間，並用我的意誌、智慧、勇氣和辛勞，承擔起重如東亞第一高峰玉山的國家責任。\n台灣 的民主轉型通過「寧靜革命」式的曆史進程已經基本實現，但是，台灣的正義轉型卻遠未完成。\n如果說民主轉型意味著政治體製的變革，正義轉型就意味著重建社會價值觀念，即重建國魂的變革。得不到正義轉型的祝福，政治體製變革的民主成果，將逐步淪為無源之水，無本之木，無魂之形；威權專製借屍還魂就具有現實的可能性。\n我願申明，自由台灣不相信仇恨；轉型正義在任何意義上都不是以複仇為目的。通過對威權專製時期反人類罪行的深刻反思，分清曆史是非，自由民主理念和製度才會找到堅實的價值基石；通過對白色恐怖下鐵窗冷月的苦痛、被迫流亡的悲愁和血濺刑場的慘劇，作真誠的思想祭奠，才可能永遠拒絕罪惡的輪回。\n我相信寬恕是一種美德。不過，以正義轉型之名，對威權專製下的罪錯實施正義的法律和道德審判，然後再進行寬恕，才可能實現台灣社會的曆史性和解；未經正義的審判就事先寬恕，不僅不表述美德，而且隻意味著放縱犯罪。\n我心中深藏著一個願望：以正義轉型為契機，撫平曆史的傷痕，用自由民主的精神價值，融化台灣族群間政治觀念和意識形態的堅冰，進而形成屬於全體台灣住民的「台灣命運共同體」意識。\n無論你的宗教信仰和政治觀念如何，無論你何時以何種方式來到美麗之島，也無論你屬於藍營還是綠營，隻要你忠誠於自由台灣，台灣就是你的心靈可以依偎的祖國；世界遼闊，四海蒼茫，台灣是你唯一能夠以自由人的尊嚴和權利安身立命的故鄉；或許你也可能在別的國度找到屬於異國他鄉的幸福，但是，自由台灣能醉倒蒼天大地的泥土芬芳，永遠是你魂牽夢縈的記憶。\n——這就是「台灣命運共同體」的意識和情感的內涵。\n古先哲亞裏士多德有論，強大的中產階級是社會穩定的基石。我相信，充分發育的中產階級是社會普遍幸福的標誌。我將以社會的穩定和普遍幸福為基點，確定引導社會財富分配的國家政策，遏止兩極分化擴大的趨勢，預防資本異化為政治、社會特權，創建老有所養、幼有所怙，強不淩弱，眾不暴寡的公義社會。\n先賢培根有箴言傳世：「知識就是力量。」受時代啟示，我相信「科技即經濟能量。」據此信念，我將引導下屆政府製定下述經濟發展基本國策——兼顧傳統產業的同時，全力支持先進科技企業優先發展，使先進科技成為台灣經濟再次騰飛的強大動力。\n國際政治經濟的現實告訴我，對外經濟貿易關係的多元化，是國家經濟安全的基石；讓經濟依附於某一個經濟強權，則意味著作繭自縛，授人以柄之舉，勢將自戕國家的經濟甚至政治安全。基於這一認知，下述內容將成為經濟發展基本國策不可或缺的部分：\n徹底破除台灣經濟必須依附某一個經濟強權才能生存的神話，做出一切應當做出的努力，開拓多元的對外經濟貿易關係，讓台灣經濟大步走向廣闊的國際市場，也吸引世界的經濟能量沛然湧進台灣。\n窮兵黷武違悖自由台灣的國家意誌。同時我們也了解，強權即公理的黑暗叢林規則仍然存在。因此，基於保障國格尊嚴和國家安全的需要，台灣應當建立對潛在入侵者具備強大嚇阻能力的有效國防——台灣可能被毀滅，但是，必定會給任何入侵者以絕不可承受的重創。\n法治是自由民主體製的靈魂。經由社會正義轉型的進程，實現廉能政府、司法公正，讓政治淨化為最純潔的社會領域——這是我們實現法治之國理想必須完成的使命。\n社會自由，文化多元，構成台灣最亮麗的精神價值的風景線。我們將做出持續努力，保持台灣做為當代人類精神自由聖地的榮耀。\n自然環境和自然生態係統的惡性變化，已經構成對人類生存的威脅。做為地球村的一個負責的成員，我們將逐步使台灣成為綠能之國，成為人類與自然和諧相處的典範之國。\n美國約翰 . 甘迺迪總統曾發表標題為「火炬已經傳給新一代美國人」的就職演講。現在，我願說，台灣命運的火炬也已經傳給新一代台灣人——新台灣人屬於自由的世代，他們定將給翠青台灣帶來屬於自由人的光榮和尊嚴。\n台灣年青世代的朋友們，在此，我願以甘迺迪總統就職演講中的一句傳世箴言與你們共勉：「不要問國家能為你做什麼，要問你們能為國家做出怎樣的貢獻。」— —我確信，得到青年世代國家責任感祝福的自由台灣，必將成為生機盎然、活力蓬勃的邦國。\n台灣公民們，「讓自由台灣成為壯麗的“國家”」，是我們心底裏的共同願望。為實現願望，我們還需要作更多。與此同時，我們也無法回避嚴峻的現實：自由台灣麵臨的國家危機，多元而沉重。\n台灣的經濟、科技、教育、文化、社會發育程度等各項“國家”發展指數，在全球二百多個國家中，均名列前茅。就是這樣一個自由民主的明星國家，卻被聯合國拒於門外；參加諸多國際活動時，不被允許使用自己的國家稱謂和國格標誌。\n上述現象是曆史遺留的腐朽遺產，荒謬而不公正。這種現象可比作濺在國際社會胸襟上的一片汙漬，它表述聯合國在強權前的怯懦和當代國際政治的羞恥。\n不過，自由台灣仍然將以心胸寬廣到泱泱大國風範，以對人類的真誠善意，直麵國際社會。我們將積極參與各類各種國際活動，開拓國際生存空間，為維護世界和平，促進地球村的文化和經濟發展，做出不可取代的貢獻——自由台灣願竭盡所能，去感動世界。\n因為，我們相信人類的良知尚未完全泯滅；精誠所至，金石為開，我們會用真誠的善意和對人類文明的卓越貢獻，融化當代國際政治那顆冷酷的心；我們會以堅韌不拔的耐心和努力，給聯合國提供足夠的時間和機會，去證明他們還有知恥而後勇的美德，能夠回歸正義與良知，糾正對待自由台灣的錯誤態度。\n「得道多助」，台灣得自由民主之天道，朋友遍天下乃必然之勢。自由台灣不是任何人的棋子，而是一個有尊嚴的國際法主體。我們將同所有以自由民主理念為立國之基的“國家”，以及所有願意以自由台灣為友的“國家”，展開務實外交，從而另辟蹊徑，為自由台灣的生存和發展，構建切實有效的經濟、文化和政治等諸方麵國際關係框架。\n做為主權者，人民有權知道有關國運的事實真相。總統故意向人民隱瞞真相是不可原諒的欺騙和瀆職行為；讓人民了解真相則是國家元首政治道德倫理的底線。\n基於以上理念，我必須向台灣公民說出一個有關國運的事實真相：海峽對岸執政者否定台灣人民決定自己命運和台灣前途的權利，並運用經濟、政治、外交、文化各方麵的國家能量，壓縮自由台灣國際生存空間，進而摧毀自由台灣主權事實獨立的現狀，使自由台灣香港化——這是當前台灣國家危機的焦點之所在；海峽兩岸關係陷於政治困境的根本原因，就在於對岸執政者試圖改變現狀。\n此前，台灣的政治人物很少有人願意或者敢於說出這個真相。此刻，我在就職典禮上講出關於國家危機的真相，在任何意義上都不意味著挑釁——為履行總統的天職，為堅守國家元首的政治道德倫理底線，為尊重台灣人民作為主權者的知情權，我必須講出真相，並團結人民，一起麵對國家危機。\n自由台灣，民風淳樸，民意良善，民心悲憫，願人類和諧相處，世界祥和安寧。我秉承民心民意，以真誠、善良的願望，對海峽兩岸關係做出下述承諾：\n以民主製度和普遍民意為依歸，在台灣憲政體製之下，維持現狀，全心全意推動兩岸關係和平發展，爭取建立具有可預測性和持續性的兩岸關係框架。\n自由台灣堂堂立於天地間，不屑於隱瞞自己的“國家意誌”。在做出關於海峽兩岸關係承諾的同時，我也願昭告天下：「自由台灣絕不會為換取經濟利益，而出賣台灣人民決定自己命運的權利；也絕不會為在屈辱中苟安而背叛自由民主的國格。」\n自由台灣從不試圖把自己的意誌強加給別人。我隻是出於大悲憫之情，向海峽對岸的執政者和人民提出兩項善意充盈的建議：\n一願對岸執政者專注於思考，何時將決定中國命運的權利交還給主權者中國人民，而不是日思夜想要否定台灣人民決定自己命運的權利——自由的台灣人民是自己命運的上帝；\n二願對岸的中國人民意識到，決定自己命運的權利是你們天賦的人權，你們應當把獲得決定自己命運的權利做為首要政治訴求，而不是試圖決定台灣的命運——連決定自己命運的權利尚在未定之天的政治奴隸，卻想要決定自由人的命運，不免有受到曆史嘲笑之虞。\n自由台灣渴望有尊嚴的和平，也不吝用海雨天風般的善意化解誤解和敵意，但是，我必須重申，我們不會以背叛自由的價值來換取苟安和屈辱的和平。如果曆史一定要把一場命運的決戰強加於自由台灣，我們將義無反顧，迎接決戰，並最終贏得決戰。\n對人類萬年曆史作縱橫觀，還從沒有任何強權強大到可以為所欲為。在命運的決戰中，自由台灣無須祈求國際同情和支持，就自然會得到天佑人助。因為，自由台灣獨立的政治存在，符合人類自由事業的利益，符合一切以自由民主為立國理念的國家的利益；同情支持自由台灣就是在維護人類的自由事業，就是在維護國際社會和這些國家自己的根本政治利益。\n我相信，自由台灣被迫進行的命運決戰，也定將得到東亞大陸各民族、各地區人民的同情和支持。原因就在於，自由和民主是所有人心底裏的向往；越是遠離自由民主的族群，這種心底裏的向往便越熾烈，台灣則是在為維護自由民主的生活方式而戰。\n我願再次向世界宣示自由台灣的善意——我們將做出一切必須做出的努力，付出一切必須付出的代價，爭取海峽兩岸保持現狀，和平相處，以收互惠互利之效。\n我願再次向世界宣示自由台灣的鐵血之誌——自由台灣有刻在自己額骨上的政治底線；如果曆史一定要逼迫台灣走向一次命運決戰，我們將付出一切必須付出的犧牲，衝決一切必須衝決的險阻，在天佑人助之下，去贏得決戰的盛大凱旋。\n寧肯玉石俱焚，也絕不屈膝；寧肯粉身碎骨，也要堅守國格尊嚴。我堅信，命運的逼迫隻會激發出自由台灣救亡圖存的強大潛能；台灣人民隻要不自我放棄，世界上就沒有任何強權能戰勝自由台灣。\n踏平萬裏艱難的凱旋之日，自由台灣將昂視闊步，走上時代之巔，摘取「壯麗之國」的璀璨金冠。\n高貴的藝術，就是美而真實的人生和曆史。台灣本土電影《塞德克. 巴萊》的主人公，莫那. 魯道，麵對強權的逼迫，以鐵血英雄之一語，驚豔天下，為台灣贏得史詩般的榮耀——「如果文明是要我們卑躬屈膝，我就叫你們看見野蠻的驕傲。」\n今天，我，蔡英文，願步莫那. 魯道英雄之韻，麵對嚴峻的國家危機，代自由台灣以一言宣示“國家意誌”：「如果和平是要我們卑躬屈膝，我就叫你們看見自由人的驕傲。」\n",
			"date_added": 1520498652
		}
	],
	"post_like": {},
	"comment": [],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1KKxZxUNP7oQTtUgkbDvUtiCyCZPQkcExB",
			"user_name": "Freebaby",
			"date_added": 1520498421
		}
	]
}