{
	"next_comment_id": 2,
	"comment": [
		{
			"comment_id": 1,
			"body": "Heute Vormittag debattierte der Deutsche Bundestag über einen Entschließungsantrag der AfD gegen den Islam.\n\nIn dem Antrag mit dem Titel „Unvereinbarkeit von Islam, Scharia und Rechtsstaat – Der Radikalisierung den Boden entziehen, keine Verbreitung gesetzwidriger Lehren“ fordert die Partei unter anderem, die Bundesregierung solle „geeignete Maßnahmen (…) ergreifen, die Verbreitung von im Koran enthaltenen gesetzwidrigen Inhalten und Aufrufen zu unterbinden“.\n\nDr. Gottfried Curio, der innenpolitische Sprecher der AfD-Bundestagsfraktion, betonte in seiner Rede, dass dem Islam eine „niedrige Schwelle zur Gewalt“ eigen ist und zitierte dazu immer wieder einzelne Koransuren, die Muslime schon von Kindesbeinen an radikalisieren.\n\nCurio griff zum Schluss Bundeskanzlerin Angela Merkel frontal an: „Merkels Einladungspolitik hat hunderttausendfach Judenhass nach Deutschland importiert. Nach Holocaust- und allen Nie wieder-Schwüren ist solche Hofierung von Antisemitismus eine Schande, Frau Merkel.“\n\nUnd weiter: „Ist das also Merkels Motto: Nach mir die Scharia? Alltägliche Messergerwalt, Angsträume für Frauen, für Juden, Mobbing deutscher Schüler, wachsende Nogo-Areas – all das gab es vor Merkel nicht. Wenn Merkel meint: Der Islam gehöre zu Deutschland, gehöre zu unserem Rechtsstaat Deutschland. Dann sagen wir: Der Islam gehört zu Merkel – aber Merkel gehört nicht länger zu Deutschland!“\nHier die Rede im Wortlaut:\n\nSehr geehrter Herr Präsident, geehrte Abgeordnete, wir sehen: religiös motiviertes Mobbing andersgläubiger Schüler durch muslimische Mitschüler; wir sehen die herabsetzende Behandlung von Frauen (bis hin zu Eifersuchts- und Ehrenmorden, Zwangs- und Kinderehen); wir sehen muslimische Attentäter, die „Allahu akbar“ rufen; wir sehen Verfolgung und Todesbedrohung liberaler Muslime (Ates, Abdel-Samad, Rushdie), begründet von höchsten islamischen Autoritäten. Was ist der gemeinsame Hintergrund all dessen? Liegt eine quasi natürliche Gewaltneigung vor? Mitnichten. Dieser Hass, diese Respektlosigkeit, diese niedrige Schwelle zur Gewalt ist erlernt, diese Kriminalität ist ideologisch legitimiert, kulturell eingeübt, durch Anweisungen, Gebote, Aufrufe; Aufrufe aus dem Gründungsdokument einer Religion.\n\nWer den Islam aber allein als Religion versteht, der missversteht ihn. Er ist auch Gesellschaftsordnung und eine gewaltaffine Ideologie, die die Welt einteilt in höherwertige Gläubige und minderwertige Ungläubige (die zu bekämpfen sind). Etliche Weisungen im Koran rufen zu Straftaten auf; wir hören da: Kriegsaufrufe („Kämpft bis sämtliche Verehrung auf Allah allein gerichtet ist“, „er hat seinen Gesandten mit der wahren Religion geschickt, damit er sie über alle anderen Religionen siegen lasse“, „tötet sie, wo immer ihr sie findet“); Gewalt gegen Frauen („Wenn Frauen sich auflehnen, schlagt sie“, bis hin zu ehelicher Vergewaltigung: „Eure Frauen sind für euch ein Saatfeld; geht zu diesem eurem Saatfeld, wann und wie ihr wollt“); wir hören religiöse Diskriminierung („Allah hat die Ungläubigen verflucht und für sie die Flamme bereitet“) bis hin zur Volksverhetzung („Die Ungläubigen sind die schlechtesten der Geschöpfe“, „schlimmer als das Vieh“). Soweit solche Gebote GG und StGB widersprechen, sind sie nicht einfach durch Freiheit der Religionsausübung geschützt; diese hebt mitnichten andere Rechts-Pflichten einfach auf, etwa die der Rechts-Treue. Auf die Strafbarkeit solcher Textstellen hinzuweisen, wäre ein erster Schritt. Oder soll solche Hetze jetzt Schulfach werden? So würden vor unseren Augen neue Gefährder produziert! Erleben wir jetzt: eine Vollverschleierung für unser GG?\n\nBei Millionen von Muslimen in Deutschland, bei Zigtausenden von Salafisten, islamistischen Gefährdern und schon im Kindesalter radikalisierten Muslimen, gefährden diese Texte den inneren Frieden, den vielberufenen ‚Zusammenhalt‘. Zwei Drittel der europäischen Muslime finden die Vorschriften des Koran wichtiger als die Landesgesetze. Unsere Forderung, die Verbreitung solcher gesetzwidrigen Inhalte zu unterbinden, gibt der Bevölkerung die Rechts-Sicherheit, die für ein Zusammenleben unabdingbar ist. In seiner uneingeschränkten Gestalt gehört der Islam (und die mit ihm untrennbar verbundene Scharia) nicht zum Rechtsstaat Deutschland.\n\nDer Gedanke der Religionsfreiheit steht unserer Forderung nicht entgegen. Die Freiheit der Ausübung der Religion ist nicht Lizenz zum Bruch sonstiger Gesetze. Polygamie, Kinderehe, Zwangsheirat, Ehrenmord, Homophobie, Minderberechtigung und Züchtigung der Frau, Antisemitismus, Christenverfolgung, Steinigung, Enthauptung, heiliger Krieg finden ihre Rechtfertigung, ja, ihren Grund in Weisungen des Islam. Wer solche gesetzwidrigen Aufrufe aktuell propagiert, macht sich strafbar – ihre religiöse Herkunft ändert daran nichts. Ganz nebenbei: Polygamie ist nicht nur ungesetzlich, sie ist auch unsozial: der Neubürger holt seine Zweit- und Drittfrau nach, der Altbürger darf sich zur Finanzierung ‘nen zweiten und dritten Job suchen.\n\nDer einzelne Moslem mag sich von einem verfassungsfeindlichen Korsett emanzipieren können. Der Islam selbst aber, als gesellschaftliche Ordnung, steht in wesentlichen Inhalten unserer Verfassung wie auch der Menschenrechts-Charta entgegen; er ist in unsere Werteordnung nicht integrierbar. Etwa die Kairoer Erklärung muslimischer Staaten sagt: „Es gibt keine Verbrechen und Strafen außer den in der Scharia festgelegten“. Und das Demokratie-Defizit islamischer Staaten ist kein Zufall, sondern zwingend angelegt: die Türkei war eine Demokratie, solange sie nicht islamisch gesteuert wurde; seit sie unter Erdogan re-islamisiert wird, hört sie nicht zufällig auf, eine Demokratie zu sein.\n\nOder muss man das alles nur anders deuten? Nein, die Aufrufe im Koran sind unmittelbare Gottesworte, deshalb allgültig und im Wortlaut unveränderbar, nicht durch Interpretation relativierbar (Koran: „Es gibt keinen, der die Worte Allahs zu ändern vermag“; und: der einfache Moslem ‚interpretiert‘ nicht, er hört die Worte). Betrifft es vielleicht nur einen ‚Islamismus‘? Nein (wie auch Erdogan sagt), es gibt keinen Unterschied zwischen Islam und ‚Islamismus‘: Islamismus ist schlicht angewandter Islam. Der Islam gehört nicht zu Deutschland, weil er nicht zu unserem Rechts-Staat gehören kann. Ein toleranter Islam ist westliches Wunschdenken. Euro-Islam, deutscher Islam, demokratischer Islam sind leere Phantastereien von runden Quadraten und eckigen Kreisen.\n\nEine Studie unter muslimischen Schülern in Niedersachsen zeigt: 27 Prozent halten die Scharia für besser als deutsche Gesetze, 19 Prozent halten es für die Pflicht jedes Moslems, Ungläubige zu bekämpfen und den Islam auf der ganzen Welt zu verbreiten, acht Prozent sind für Ausbreitung des IS, vier Prozent für Terroranschläge. Die Verachtung Andersgläubiger ist genau die Einstellung, aus der Terrorismus entsteht: denn wer den Lebensstil einer Gesellschaft radikal ablehnt, sie als sündig empfindet, geht leichter gewalttätig gegen sie vor. Anis Amri handelte im Vollgefühl seiner Legitimation durch den Koran. Der in der Schule gelehrte Koran und der von den Salafisten verteilte ist derselbe! Wäre etwa das jugendgefährdendste Medium heute dasjenige, wo ein reales Killerspiel geboten wird? Kein Moslem sollte sich mehr radikalisieren und für Gewaltverbrechen legitimiert fühlen können durch gesetzwidrige Lehren – deren Verbreitung sollte deshalb im Rechtsstaat Deutschland nicht länger erlaubt sein. Das ist jetzt Ihre Verantwortung! Wer gegen diesen Antrag stimmt, stimmt nicht etwa gegen die AfD, er stimmt gegen das Grundgesetz und handelt gegen die Sicherheit unserer Bürger.\n\nEs gibt Leute, die suggerieren wollen, Gewalt im Namen dieser Religion habe nichts mit dieser Religion zu tun (aha: wer bei seinem Mord ‚Allahu akbar‘ ruft, meint dann wohl gar nicht: Allah). Die prägenden Ursachen zu verdrängen – ist denen wichtiger als die Opfer. Wichtiger als bedrängte Homosexuelle, geschlagene Juden, mit Messerstichen ermordete Frauen. Diese Texte sind eben nicht harmlos, wie auch ihre Wirkung zeigt (an ihren Früchten …). Merkels Einladungspolitik hat hunderttausendfach Judenhass nach Deutschland importiert. Nach Hólocaust und allen „Nie-wieder“-Schwüren ist solche Hofierung von Antisemitismus eine Schande, Frau Merkel!\n\nIst Merkels Motto: „Nach mir die Scharia“? Alltägliche Messergewalt, Angst-Räume für Frauen, für Juden, Mobbing deutscher Schüler, wachsende no-go-areas – all das gab es vor Merkel nicht. Wenn Merkel meinte, der Islam gehöre zu unserem Rechtsstaat Deutschland, dann sagen wir: Der Islam gehört – zu Merkel, aber Merkel gehört nicht länger zu Deutschland!\nhttps://www.youtube.com/watch?v=UPe-WikeKmc",
			"post_id": 14,
			"date_added": 1539286996
		}
	],
	"comment_vote": {},
	"post_vote": {
		"14": 1
	}
}