{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1587734994,
			"title": "Just A Shout Out To The Other Non-Conspiracy/Rationalists Out There",
			"body": "I've noticed that there is a lot of conspiracy mumbo jumbo on here as of late, and I just wanted to give a shout out to all the people that haven't used this platform for spreading nonsense.\nOh, and for those that do believe the world is coming to and end every ten years, nonstop, without any results... you can just dismiss me as a \"government illumunati-freemason-jewish-manchurian-candidate-communist-socialist-satanis-pagan-space-lizard-person-new-world-orderist-whatever\"... the same as your social worker.",
			"added": 1587734993
		},
		{
			"topic_id": 1622273887,
			"title": "I'm going to unbaptise all of you, vaccinate you, take away your guns and flags, and train you to be tolerant of Muslims and the Mainstream Media",
			"body": "I'm also going to turn your frogs gay and get rid of all your drugs and alcohol.\nAnd there's nothing you can do about it.\nHail Marx! Hail Satan!",
			"added": 1622273885
		}
	],
	"topic_vote": {},
	"next_comment_id": 43,
	"comment": {
		"1584570227_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": [
			{
				"comment_id": 1,
				"body": "I am Pierre Pierre Momphries Von Teepperpotts Diddlywinks Vandbilt the III, Esquire, beholder of the Thrask of R'oll and leader of the 16 armies of The Flowery Armageddon.\nWho ye' be?",
				"added": 1584718911
			}
		],
		"1584527258_1HeEWnYs69J1BV4P4niDN775yBVqNijhjG": [
			{
				"comment_id": 2,
				"body": "Nonsense.\n\n35713 infected cases in Italy per WHO\nhttps://experience.arcgis.com/experience/685d0ace521648f8a5beeeee1b9125cd\n\n41,035 infected cases in Italy per John Hopkins\nhttps://gisanddata.maps.arcgis.com/apps/opsdashboard/index.html#/bda7594740fd40299423467b48e9ecf6\n\nItaly has a population of 60.48 Million according to the United Nations and Eurostat.\n\nTherefore, at an absolutely worst case scenario, the infection rate is 0.06%\n\n(41,035 is 0.06% of 60.68 million)\n\nThe recovery rate is 97% and the most common cause of death is pneumonia related.\n\nWhy is it conspiracy theorists are always bad at math?\n\nDo you guys seriously not know how to perform percentage calculations?\n\nThis isn't hard.\n\nAnd where are you getting all of your numbers from? You're not showing citations or your math.",
				"added": 1584719472
			}
		],
		"1585133073_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 3,
				"body": "They all depend of the economy. Your conspiracy theory is baseless. It is true that the systems are built of bias and greed, but most of the players involved actually believe in their own biases. They have no understood the importance of prioritizing epistemology and error elimination from their thinking and actions. Stage One for improvement would be an Epistemic Revolution. Stage Two would be placing importance on accuracy and Justice. Stage Three would be maths-based delineation of sections of the economy, education and services. This is the true Trinity of The Future.",
				"added": 1585162814
			}
		],
		"1587734994_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L": [
			{
				"comment_id": 4,
				"body": "Just a clarification:\n\nI'm talking about these conspiracy theories that are peddled on here:\n- PizzaGate\n- Covid is a hoax/Covid was engineered\n- Vaccines are bad\n- Chemtrails\n- Doomsday is upon us\n- Government is planning mass exterminations/euthanasia\n- Governments and corporations are planning on enteral martial law\n...and so on.\n\nI'm not talking about:\n- People are dicks\n- People lie\n- Gov and Corps cheat, manipulate and spy on people\n- General corruption\n...that's just an axiomatic given.\n\nSome people see the latter and immediately jump to the conclusions of the former because someone had weaved some tales. Some people are more willing to play into the tales of people for various reasons; be it an ignorance of fallacies, biases or whatever. And the more people feed their confirmation bias with more tales, the more they step away from evidence based thinking and more towards narrative based thinking, pairing it with the argument from ignorance or the argument from silence.\n\nNot the healthiest of mindsets.",
				"added": 1587840666
			},
			{
				"comment_id": 5,
				"body": "> [commandantecero](#comment_13_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro): That's true, and there is no reason to make the jump to \"PizzaGate\" from \"a well-connected pedophile who owns a pizzeria was abusing children there and allowing others to do the same\" or \"Covid was an engineered bioweapon\" from \"The Chinese were screwing around with something that endangered us all.\" [...]\n\n\"PizzaGate\" has been thoroughly debunked.\nhttps://rationalwiki.org/wiki/Pizzagate\n\n\"Bioweapon Covid 19\" has also been debunked.\nhttps://rationalwiki.org/wiki/2019-20_COVID-19_outbreak#Claims_that_the_virus_was_engineered\n\n> [commandantecero](#comment_13_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro): On the other hand it is equally erroneous to take it the other way, that because these things are associated with conspiracy theories that do not withstand logical analysis none of it must be true.\n\nSomeone obviously doesn't understand how the burden of proof works or what a false dilemma fallacy is.\n\n> [commandantecero](#comment_13_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro): I am sure that\nSure, how exactly? Do you have sufficient evidence? You do realize you can have a hypothesis without being sure, right?\n\n> [commandantecero](#comment_13_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro): Likewise that there are governments and people in our government that would be OK with martial law and extermination, and I know that from history.\n\nSo, because something has happened in the past, it must be likely to occur in the present? Even though the logistics are entirely different now, as are our situations, politically, socially, technologically and education wise?\n\nHmm... doesn't past the smell test.\n\n> [commandantecero](#comment_13_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro): Cosby, Spacey, Epstein and Weinstein... dismissed as a conspiracy.\n\nCitation needed. Hollywood has been known as a festering strew of abuse for decades, which is why the \"casting couch\" cliche exists. No one denied it; it just takes actual evidence and a lack of bias in the system to persecute. That doesn't mean it makes sense to jump to conclusions based on intuition. All beliefs require evidence.\n\n> [commandantecero](#comment_13_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro): So I'm willing to wade through all of it and see how much is real.\n\nMake sense, but are you aware of epistemic differentials? Do you know of Venn's Circles of Doubt and Evidence? Venn borrowed the idea of Eulerian Circles (aka Euler Diagrams) for the purpose of differentiating Rational Implications and Irrational Implications.\nI would suggest studying this, because you seem to be lacking in an understanding of why Narrative Based Conclusions are Irrational and Evidence Based Conclusions are Rational.",
				"added": 1587848936
			}
		],
		"1622105491_1NH9evu6V4qeiyppRGkdUkTk87eM82oMdE": [
			{
				"comment_id": 6,
				"body": "> [sabretooth](#comment_18_1CQJfkvNg44WkoH6xCTj6XkuxA9zRMLYSU): Alex's problem is that he is constantly trying to maintain the pacifist routine. These people aren't going down without direct action. \"God gave his angels weapons because even the almighty knew that you can't fight evil with love and tolerance.\"\n\nWait, do you seriously believe in the Biblical god and angels?\nBwa-hahahaha.\nDo you also believe in King Arthur? Unicorns? Dragons? Faery Folk? The Loch Ness Monster? Big Foot?\nHahahahahaha.",
				"added": 1622274126
			},
			{
				"comment_id": 7,
				"body": "\"Great\" and \"Infowars\" never belong in the same sentence together.",
				"added": 1622274167
			}
		],
		"1624920099_1LgRcoq7CT8hsQKotzjx2CPWZiio2gEU5C": [
			{
				"comment_id": 8,
				"body": "Name names of people who enslave others and how they do it.\nThis cannot include any situations in which there are choices.\nGo.",
				"added": 1624957634
			}
		],
		"1624761447_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 9,
				"body": "> [qwyx](#comment_4_12sEK7ur84yYok3iWWPxZUvZd4YqjuQG9f): Zeronet can only be turned off in conjunction with the internet . :)\n\nThat's not even remotely true. Decentralized doesn't mean control-proof. First of all, people aren't obfuscated by ZeroNet by default, and secondly Tor nodes are all tapped by intelligence networks. Everyone could be identified and shut down one by one. They did it with Anom and other apps before.\n\nAdditionally, ISPs can actually restrict ports and protocols. Try as people might there is no fool proof way to set up connections that can't be traced or limited unless people are always on the move.\n\nHell, even the Government dropped TOR in the public's lap after they realized those users there were the more they were able to blend in making more difficult (but impossible) to track and identify people.\n\nThe easiest way to do this from a static location is to use a prepaid phone with HotSpot capabilities, store it in a close but separate location, and then have a separate device that is only used for obfuscated activity.\n\nEven then people can still be identified with \"Deep Metadata\" which includes everything from personal typing/language choices, time windows of use, username themes, etc.\n\nThe sad part is that you'd have to be unreasonably paranoid to live in the Western World and care that much... or otherwise you'd have to be engaged in activity you know you shouldn't be.",
				"added": 1624959812
			}
		],
		"1629402955_19BXHBD1GfYpSpvdHsuHJsJ97mYpxWjUE": [
			{
				"comment_id": 10,
				"body": "Not only that, but we can we talk about GRAVITY?!!!\nGravity was invented by \"the man\" to keep up down!\n\nAnyway, when it comes to the COVID HOAX or \"COAX\" as I like to call it, they're trying to insert little rabbit scientist nanobots into our blood stream so they can go into our brains and steal all of our raincoats and learn the location of the socks we used to jerk off into!\n\nDamn Government! If I wanted you to know the location of mister socky, I'd send it to you with my annual \"i REFUSE to pay taxes and bathe!\" letter during tax season (whenever that may be).\n\n[This was satire]",
				"added": 1629862311
			},
			{
				"comment_id": 11,
				"body": "> [sprat](#comment_6_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV): and as you can't inject PLA (china army) or India army... you die...\n\nThe Indian army is vaccinated. That took one second to google search.\nhttps://www.indiatoday.in/coronavirus-outbreak/story/covid-vaccination-india-vaccination-corona-vaccination-covid-vaccination-india-covid-19-vaccination-covid-vaccination-in-india-www-cowin-gov-in-www-cowin-gov-in-1793088-2021-04-20",
				"added": 1629862412
			},
			{
				"comment_id": 12,
				"body": "> [sprat](#comment_2_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV): the fbi can be killed, every single one of their children. don't forget it. the top is corrupt. and must be eliminated for the republic to live [...]\n\nDumb dumb, you do realize zeronet isn't anonymous, right? And that all of the TOR exit nodes are known and monitored by the NSA and 7 Eyes?\n\nI'm going to have to report your post like I did the other two wackjobs that got picked up last year.",
				"added": 1629862498
			},
			{
				"comment_id": 13,
				"body": "What tyranny? What freedoms have you lost? Not movement. Not speech. You can freely travel as long as you wear a mask. That's science not politics.",
				"added": 1629862588
			}
		],
		"1628848642_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg": [
			{
				"comment_id": 14,
				"body": "FreeNet",
				"added": 1629862708
			}
		],
		"1630084537_1BTNSTXS2TJ9kadazhS8Nb2tNRoxQZm4Pv": [
			{
				"comment_id": 15,
				"body": "Oh, look, a complete lunatic that is screaming about violence while claiming everyone else crazy because they must be part of some conspiracy.\nYou're mentally ill, you know that, right?",
				"added": 1630401989
			}
		],
		"1630241491_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 16,
				"body": "Do you seriously need someone to post a timeline?\nThe West invaded the Middle East numerous times; and the more recent bullshit started during the Cold War because the Middle East was between Russia and the West.\nSo the Russians armed them and gave them money while the West tried to supplant their leadership.\nThis is why they had until the 2000s outdated Russian rifles but American embassies and military bases.\nThe whole \"oil\" this is mostly bullshit; American Military and Arab militants capture oil fields in the Middle East in hope of supplying the American military presence in the Middle East with oil (trucks, jeeps, etc).\nDo you really think the USA has been there for 50 years sending troops American oil?\nThe USA is still there for that reason; it's a strategic point. It  has nothing to do with money, oil, resources, religion or ideology.\nAnd the Arabs want everyone out. Seeing both the West and Russia act like complete dipshits actually resulted in the Middle East dropping from it's Westernesque culture to what it is now as a result of blowback.\nBlow up enough areas while throwing your aggressive lifestyle in a local's face, they'll join a lifestyle that is the exact opposite out of (flawed) principal.\nEveryone is wrong in this. The Western terrorists, the Russia terrorists and the Middle Eastern terrorists.",
				"added": 1630402481
			},
			{
				"comment_id": 24,
				"body": "Gather around kids, here is a history lesson:\nDue to the Cold War, both The West and Russia/China wanted to take space up in Strategic Spots spots around the Globe. Since The Middle East is between The West and The East (Russia/China), it became a potential spot for destabilization and control.\nThis is why up until recently Middle East Terrorist Groups had Russian Rifles and American Jeeps.\nProxy Wars were funded so that both sides could fight for Strategic Spots.\nI know, people have heard it was all about the oil, but oil was the least of everyone's concerns.\nThis was about Nuclear War and World War III prepping.\nThe problem was that while Russia and China placated to the local extremists as a control tactic, The West tried for force Western Culture on the local extremists.\nAnd most of the money that was being used for ops came from the American and British Taxpayers.\nSo they have waged war on both the Governments and the Civilians that do not protest the ways the extremists and general local populations have been treated.\nThe Religious Aspect is just local people clinging to a local tradition to explain why they are trying to \"protect\" local lives, but then it got out of control, as religious extremism often does, and thus they start attacking their own people branding them as traitors.\nMuslims and Christians were actually not enemies at all during the Crusades; there were small wars, but generally they traded with each other.\nThe modern extremism came about after the fall of the Ottoman Empire when The West, particularly France and Britain tried to take over Northern Africa, the Middle East and India.\nThey mistreated locals, and thus there was blow back.",
				"added": 1631377219
			}
		],
		"1629910533_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 17,
				"body": "I saw that this had 304 comments so I clicked on it out of curiosity.\nThen I saw it's only 3 mentally people talking to themselves like they're preaching at a rally.\nBut no one is listening.\nTinfoil idiots.",
				"added": 1630402592
			}
		],
		"1630349248_1Avop7FK7FLVvKV3jyxwyR57ib9d4NSZbF": [
			{
				"comment_id": 18,
				"body": "With all the unhinged spamming you post it's obvious you're mentally ill.\nBut that doesn't excuse your violent tendencies.\nHow about we play a game of mess with your head.\n:)",
				"added": 1630402710
			}
		],
		"1630314029_1Avop7FK7FLVvKV3jyxwyR57ib9d4NSZbF": [
			{
				"comment_id": 19,
				"body": "Where the hell do you get all of these insane ideas?\nYou have no idea how unhinged you are, do you?",
				"added": 1630402780
			}
		],
		"1630153406_1AAwx2qPkJeAEJUpAh4VrmBqFDsRbh3a15": [
			{
				"comment_id": 20,
				"body": "You do realize that you're not anonymous on here, and that the TOR nodes are known, right?\nYou're only anonymous to ISPs that follow the law, you're not anonymous to the NSA, FBI, CIA, etc.",
				"added": 1630402858
			}
		],
		"1630148191_1AAwx2qPkJeAEJUpAh4VrmBqFDsRbh3a15": [
			{
				"comment_id": 21,
				"body": "You keep posting insane crap.",
				"added": 1630402894
			}
		],
		"1631366411_13JuGiUNQFGijiA5NWsKsgv8YWBus5NvV1": [
			{
				"comment_id": 22,
				"body": "There are already forks. There are also similar concepts that aren't forks.",
				"added": 1631376380
			}
		],
		"1630441420_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg": [
			{
				"comment_id": 23,
				"body": "> [leonarddurden](#comment_44_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD): Download the source code right now ( https://github.com/HelloZeroNet/ZeroNet/ ) and be part of the resistance and not a passive troll or back blenchers heckler. [...]\n\n\"The resistance\"... Spoken like a delusional tool that can't separate reality from fantasy.\nI bet dollars to donuts you have bug out bags and an \"in case of zombie apocalypse\" emergency plan.\nLet me guess your internet-assembled philosophy:\nThe Bible/Conspiracy Theorists are legit, and that the Illuminati/Bilderberg/Freemason/Liberals are part of some grand conspiracy that has to do with enslavement/depopulation/greed and the people that ask skeptical questions and ask for legit evidence are sheep/zombies/NPCs because you think reality is some sort of videogame/movie/book.",
				"added": 1631376670
			},
			{
				"comment_id": 26,
				"body": "> [leonarddurden](#comment_40_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD): i2p is old school and used in the right way you will be hidden but it's not for the faint of heart. The thing about Zero Net is I see it has attracted \"non technical\" people who are capable enough to install and understand the context. We need the Zero Net source code. It will survive in the hands of a 1337 human not seeking attaboys from his peers, meaning a man, not a boy. How might we get our hands on it?\n\n> faint of heart\n> non-technical\n>1337\n> attaboys\nYou are the biggest poser in the world right now.\nYou don't know a lick of code and have no idea what you're talking about.",
				"added": 1631427983
			},
			{
				"comment_id": 27,
				"body": "> [leonarddurden](#comment_46_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD): No constructive conversation ever started off with, \"Let me guess—\" [...]\n\nIt's because idiots that use stereotypical dialogue, parroting bullshit are almost exclusively batshit.\nYou didn't disappoint.\nNow tell me about \"the space aliens\" and how \"covid is a hoax\".",
				"added": 1631428079
			},
			{
				"comment_id": 28,
				"body": "> [leonarddurden](#comment_35_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD): Is there a different perspective? i2p is OG btw. [...]\n\nTell us you're a poser without telling us you're a poser.",
				"added": 1631428132
			}
		],
		"1630039559_1BTNSTXS2TJ9kadazhS8Nb2tNRoxQZm4Pv": [
			{
				"comment_id": 25,
				"body": "Jews only make up 1% of the population and People of Color only make up about 15% of the population, but most are held during in prison between the ages of 15-35 at least once for trumped up charges, leaving less than 0.1% of them even eligible for service.\nYou're looking for any reason to be prejudiced, as if anyone owes you anything.\nYou're a coward.",
				"added": 1631377526
			}
		],
		"1631527719_12ftwUykzZMAF7aq5Sd3qGh8HUNmnPh8Fn": [
			{
				"comment_id": 29,
				"body": "You are not required to have the rhinovirus in order to have COVID19.\nThat is complete and utter nonsense.\nPlease provide citations for your claims.",
				"added": 1631553728
			},
			{
				"comment_id": 31,
				"body": "> [theonlytruth](#comment_1_12ftwUykzZMAF7aq5Sd3qGh8HUNmnPh8Fn): It is simple: Covid is just a part of the viruses which leads to the common cold.There are many others.But the key is that a society should not kill freedom for something which is not really that deadly and even if it was it can't be stopped after all. Doing what they are doing is evil. No matter what reasons or arguments they have. It is just evil. [...]\n\nNone of this is true. COVID19 is a new mutation, not an old one, and this line of viruses doesn't become or cause the common cold. You're making things up out of ignorance.",
				"added": 1632179069
			},
			{
				"comment_id": 32,
				"body": "> [nullogs](#comment_2_1C16U7WJ34kMraYJsf5EwjrCQqhWiofm85): Where is the disconnect for you? Hes saying that you can have the flu without having covid. but to have covid you also need to have the flu.\n\nYou don't need to the flu to get covid. How are you this uneducated?",
				"added": 1632179108
			},
			{
				"comment_id": 37,
				"body": "The Cold and COVID are not the same class of viruses, and one did not lead to the other.\nCorona just means it is spreadable between species; not all Corona viruses are closely related.\nWhy do people just make things up? Stop pathologically lying and treating it like you're an expert.\nYou don't even get the basics right.",
				"added": 1633217349
			}
		],
		"1632073647_12ftwUykzZMAF7aq5Sd3qGh8HUNmnPh8Fn": [
			{
				"comment_id": 30,
				"body": "5'6\" here. I only ever think of my height or masculinity when nutjobs like you obsess over it.\nYou obviously are mentally ill and have hang ups built around a false sense of what you think other people think about, as well as incorrectly presuming things about history, screaming like a madmanchild that you believe in universals that never existed.\nGet over it.",
				"added": 1632178998
			}
		],
		"1623961112_1ASusrn34PQJr8ipd1LcBamudPHxQEWheA": [
			{
				"comment_id": 33,
				"body": "Anyone can write anything, and any nutjob can equate anything.\nTry scientific thinking. It's the only thing that yields results.",
				"added": 1632179172
			}
		],
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 34,
				"body": "None of that is indicative of a bioweapon.",
				"added": 1632179228
			}
		],
		"1630436341_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 35,
				"body": "It appears the minds behind ZeroNet and ZeroID have no idea what they're doing in regards to basic automation.\nThey should be able to clear, post and call via bash, but alas I believe we're not dealing with a full pack of cards here.\nIf this was entirely GUI or entirely CLI, it would make sense, so that usage was streamlines, but asking users to mess around with files while also asking them to use the app as GUI... is asking for trouble.\nThis is why all other apps that use a GUI browser interface always just have a CONFIG menu allowing for simple alterations.\nAsking people to muck about with editing, modifying, etc... while also restricting username registration to one account per ip/machine... so there is no possibility of a complete reset/restart from scratch?\nNot a smart move.",
				"added": 1632179586
			}
		],
		"1632560311_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG": [
			{
				"comment_id": 36,
				"body": "No one on zeronet is special enough to be targeted for anything other than the sickos.\nYou narcissism is showing, OP.",
				"added": 1633217212
			}
		],
		"1633971358_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG": [
			{
				"comment_id": 38,
				"body": "\"Remote Neural Monitoring Tech\".\n\"Spies on The Minds of All\".\nThis is the dumbest crackpot shit I've seen in a long while.\nThe NYPOST articles doesn't even say that. It's about the claim China has obtained internet data on enough Americans to manipulate them.\nLearn to read.",
				"added": 1634082242
			}
		],
		"1633895520_1BFxHVXHTKcnWLWPVKbTknZTAaiHz6tgcV": [
			{
				"comment_id": 39,
				"body": "ZeroNet isn't part of the Dark Web. In fact, by default it doesn't even use TOR or proxies.\nThis is a bunch of meaningless word salad.\nYou also don't need special tech to \"map\" ZeroNet. It's a decentralized system, so directories are copied to everyone in a list, and then the data is replicated from multiple sources well called to post.\nDo you not know how this works? It's exactly like torrents, just reworked for web posts.",
				"added": 1634083006
			},
			{
				"comment_id": 40,
				"body": "> [7uz8yu7gxwnhfgae](#comment_16_1CN7STVMU29Rme1tgVRRPj3ZA3H7m99Rei): (yawn) Just do your part to seed it glowie. We need the better hardware you bring to the table.\n\nYou do realize glowie is a meme, right? The federal government doesn't have people wasting time on sites that aren't about terrorism or extremism. I've reported a few knuckleheads to the FBI because they posted threats, but other than that, if you believe everyone that disagrees with you is an agent, then you're daft.\nThey don't have the time or budget to waste on people because of their \"views\" alone.",
				"added": 1634083100
			}
		],
		"1633748733_1AZiefB1ahR2XrywVEdkh5ek6eTF8qUpZT": [
			{
				"comment_id": 41,
				"body": "Pay someone on the dark web or start with a hexdump and go from there.",
				"added": 1634083142
			}
		],
		"1633268142_14NiXkEXrFAHokAohyiCv5PCAXLcEsvEUp": [
			{
				"comment_id": 42,
				"body": "Syncronite is used by pervs and people footprinting, scamming, blackmailing, etc.",
				"added": 1634083212
			}
		]
	},
	"comment_vote": {}
}