{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 20,
	"comment": {
		"1552575038_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": [
			{
				"comment_id": 1,
				"body": "> [sharer](#comment_19_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P): After considering what happens when some untrusting stranger visits this zite, I decided to put the whole script to load with the button instead of loading the .js with the zite. So there will be not even the mining script ready until the user pushes the donation button.\n\n(Had to create another user, since I hit my limit, just for this) Look im sorry if I ever attacked you in anyway, I am just iffy on any \"mining\" js file, unless its a offical company or organization. You are probably not mischievous, but what if someone else is? It is why I jumped the gun. Also, I did some assumptions on you not wanting to take criticism.",
				"added": 1554314026
			},
			{
				"comment_id": 4,
				"body": "> [sharer](#comment_21_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P): <center>![img](https://i.imgur.com/vEu0Uqp.gif)</center> [...]\n\n(That meme/gif was funny by the way) Also, alright.",
				"added": 1554315246
			},
			{
				"comment_id": 8,
				"body": "> [krixano](#comment_718_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): I'm sorry, but it should be a no-brainer to be more considerate, and imo, there's no good excuse for how you acted towards @sharer. Especially since you were repeatedly telling others not to use his zite in multiple places (basically spamming it, imo), without giving him a chance to explain himself. and if you scroll down, this topic about the miner has already come up. [...]\n\nDid I say sorry to you? No. I do not care if you block me. Also, I spammed because the public had a right to know if a zite was having a virus. Your the one being a asshole here.",
				"added": 1554324086
			},
			{
				"comment_id": 9,
				"body": "> [krixano](#comment_719_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Oh, did you think \"I'm sorry\" meant I was saying sorry? LOL. [...]\n\nIf that makes me a asshole to save people from viruses, then so be it. Viruses should be avoided at all costs at first, then see if good 2nd. You can get the virus and then its bye-bye.",
				"added": 1554324189
			},
			{
				"comment_id": 10,
				"body": "> [krixano](#comment_720_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): The problem is firstly, the spamming. Secondly, you automatically assumed there was a virus, and you didn't notify the people that this was an assumption. Instead, you made it out as if you knew there was a virus. Thirdly, you were constantly bashing his zite by spamming this around without any proof - how is that not being an asshole.\n\nEveryone makes mistakes, and I do not need my sympathy from you. I even retracted and deleted my previous comments on it even being a virus.",
				"added": 1554324361
			},
			{
				"comment_id": 11,
				"body": "> [krixano](#comment_721_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): And by assuming there was a virus, you also therefore assume he didn't take enough care about where he was getting the mining script - just saying.\n\nNo, he knew what he was doing if he was even mischievous at all, due to his site being well done.",
				"added": 1554324398
			},
			{
				"comment_id": 13,
				"body": "> [krixano](#comment_722_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Right... but you still did it in the first place - which is the problem. You weren't considerate in the first place. [...]\n\nNo, if he wanted to get money, he would of purposefully put in a mining virus. You cannot say what I am thinking, since you are not in my mind.",
				"added": 1554324843
			},
			{
				"comment_id": 14,
				"body": "> [krixano](#comment_723_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Btw, I don't give a fuck whether you want my sympathy. You were being extremely rude to a person who is putting a lot of effort into making the best possible zite he can make. You don't deserve my sympathy regarding how you acted.\n\nI have a right to do so, go back to your safe space. Guess what? It is the internet. I will not be the last who is a asshole.",
				"added": 1554324926
			},
			{
				"comment_id": 15,
				"body": "> [krixano](#comment_724_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Sure, you have a \"right\". But how you can so quickly justify actions by saying you have a \"right\" is pretty low...I also have a \"right\" to call you out for your stupid crap. [...]\n\nGo back to your safe space, where everything is all sunshine and rainbows, and people do not learn from their mistakes. People like you are why other people stay assholes. If you really think I am stupid, then you are really falling for the Dunning Kruger effect. You are not as bright as you think you are, buddy. \"If somebody is gracious enough to give me a second chance, I won't need a third.\"\n\nPete Rose",
				"added": 1554325129
			}
		],
		"1554309286_15xzQzPrA8KgEdqhVBnNvhtL6cWPaDTttG": [
			{
				"comment_id": 2,
				"body": "You can also try posting it on KopyKate, as well as ShareTube. There is also ZeroUp.",
				"added": 1554314795
			},
			{
				"comment_id": 6,
				"body": "> [guywithabrain1](#comment_2_15xzQzPrA8KgEdqhVBnNvhtL6cWPaDTttG): Already done. [...]\n\nWill seed. I am anti censorship.",
				"added": 1554315842
			},
			{
				"comment_id": 7,
				"body": "> [guywithabrain1](#comment_3_15xzQzPrA8KgEdqhVBnNvhtL6cWPaDTttG): Thanks for seeding.\n\nLooks like the seeding is taking quiet a bit. You can try uploading it on a server, then I will download then seed it, if this keeps happening. I have a beefy upload speed. Something like http://Mega.co.nz will work for me downloading the video you want. Or, you can linking me to a vid that has not been taken down yet.",
				"added": 1554316658
			},
			{
				"comment_id": 17,
				"body": "> [deafboy](#comment_70_1xf9XC4Nsa7YfQWFiK6xGsNDJA3AaCTUa): At first I was interested but then the first relevant google search result was breitbart and the article unfortunately did not pass the Soros test.\n\nWhat is this test?",
				"added": 1554326750
			},
			{
				"comment_id": 18,
				"body": "http://127.0.0.1:43110/big.kopykate.bit/?Video=1554326936_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj I found a video and am now seeding.",
				"added": 1554327061
			}
		],
		"1553953681_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 3,
				"body": "My main account rain out of memory, so I cannot post or upvote anymore content. I have this just as a throwaway ZeroID if it happens to be upped again from nofish, or else this is my new main.",
				"added": 1554315021
			},
			{
				"comment_id": 5,
				"body": "> [60](#comment_65_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1): for me, i back up my old posts into a publicly available git repo and then delete old posts and leave a link to that repo\n\nMight try that if worse comes to worse.",
				"added": 1554315489
			}
		],
		"1554322767_1MTNhSVgCJpW8uBjFhnyA5NsgyKbKnvrLG": [
			{
				"comment_id": 12,
				"body": "I think it will be hard to even do for ZeroTalk. TorrentFreak grabs news from the clearnet to then be compatible with ZeroNet. Doing the opposite, you would need to change how posts are even sent since it is not on ZeroNet. Clearnet stuff can work on ZeroNet more often than the opposite.",
				"added": 1554324701
			}
		],
		"1554143647_1Cj5g289VvLkA7tsv7ewLKLpUYSnz3Ut4C": [
			{
				"comment_id": 16,
				"body": "> [fantoski](#comment_2_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): It would be cool if there was a poll on the ZeroHello page for us to know how most people hear about ZeroNet so that we know how to let more people know about it.\n\nMaybe someone should import from ZeroPoll to ZeroHello.",
				"added": 1554325883
			}
		]
	},
	"comment_vote": {
		"20_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": 1,
		"2_1qHgDzjLBxeUFdTiNPQFuwfnW33ptNk84": 1,
		"705_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"133_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1,
		"3_1qHgDzjLBxeUFdTiNPQFuwfnW33ptNk84": 1,
		"21_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": 1,
		"5_1qHgDzjLBxeUFdTiNPQFuwfnW33ptNk84": 1,
		"4_1qHgDzjLBxeUFdTiNPQFuwfnW33ptNk84": 1,
		"3_15xzQzPrA8KgEdqhVBnNvhtL6cWPaDTttG": 1,
		"22_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": 1,
		"16_1qHgDzjLBxeUFdTiNPQFuwfnW33ptNk84": 1,
		"4_193rzuH9AAHfvHKwSFS5oq6jRpXwDJ2rEW": 1,
		"15_1qHgDzjLBxeUFdTiNPQFuwfnW33ptNk84": 1,
		"18_1qHgDzjLBxeUFdTiNPQFuwfnW33ptNk84": 1
	}
}