{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "⎝ Идеальная криптовалюта ⎠⎞",
			"body": "Идеальная криптовалюта должна иметь :\n\nБесконечную масштабируемость, например если число нод 1000, то обрабатывает 1000 транзакций в секунду (tps), если число нод стало 1 млн, то скорость сети пропорционально увеличилась до 1 млн tps\nМаленькое время подтверждения транзакции - не более 5 сек.\nБесплатные или практически бесплатные транзакции:\nЛибо в транзакции указывается какая-то комиссия (мин сумма задается в константе см п.13). Комиссия всегда сжигается, майнеры получают только вознаграждение.\nЛибо оплачена подписка на транзакции (см. пункт 14)\nЛибо в транзакции указан PoW эквивалентный работе компьютера в течении например 1 сек (управляется константой)\nБудет установлено минимально допустимое время между транзакциями предок-потомок (например 1 минута)\nПри неудовлетворении этих условий транзакция считается невалидной и сетью не принимается.\nЗащиту от атак (защита от спама через пункт 3, защита от резкого изменения мощностей майнеров - через алгоритм)\nРаспределение вознаграждения за блок: 10% за максимальный PoW хэша, 90% остальным активным участникам сети (нодам), выполняющим обмен транзакций.\nЗапускать поверх себя другие активы (по типу цветных монет в биткоине) и в том числе содержать транзакции всех популярных криптовалют (наличие точной информации по курсам этих валют позволит создать децентрализованные биржи/обменники/ломбарды и т.п.)\nРегулируемый размер эмиссии через голосование и пропорционально количеству нод (точнее логарифму их числа)\nСмарт-контракты\nПиринговый файлообмен\nПиринговые сообщения (чат)\nDApp (хостинг проектов)\nАсикостойкий алгоритм PoW\n “Управляемые” константы - константы, которые меняются через систему голосования. Например размер эмиссии, процент распределения награды, стоимость подписка на сервисы и т.п. Сама система голосования возможно будет реализована путем сжигания суммы валюты за то или иное решение. Время голосования длительное - минимум 2 недели или при наборе большинства. Подумать про отдельную систему выборщиков...\nВ сети будут реализованы встроенные сервисы (например подписка на бесплатные транзакции в течении года). Оплата осуществляется путем  сжигания определенной суммы на определенный адрес - например 0x000000001\nБезопасные кошельки - специальное свойство кошелька, показывающее возможность отмены транзакции в случае кражи пароля. Механика: перевод с таких кошельков осуществляется долго, например 1 неделя, при этом в течении этого времени есть возможность создать блокировочную транзакцию, по которой все деньги отправляются на резервный кошелек. А также опция ограничение суммы платежа в день/месяц за исключением переводов на резервный кошелек.\nПрименение: повышение безопасности брэйн-кошельков.\nСмарт контракты\nОракулы - заливка экспертных знаний реального мира внутрь блокчейна. Системно будут поддерживаться несколько финансовых показателей, например, курс данной валюты к USD, курсы других валют (Биткоина, Эфириума, фиатных валют). Алгоритм вознаграждения за правильные знания: ноды, которые максимально ближе были к среднему значению участвуют в розыгрыше монеты.\nУстановка осуществляется в момент достижения консенсуса сети (в момент лавинной отправки макс блока).\n\n\n\n\n\n\n\nСЕРВИСЫ за которые нужно платить:\nПодписка на быстрые (без PoW) транзакции без комиссии\nРасчет баланса кошелька для тонкого клиента\n\nПодписка осуществляется путем сжигания (переводы на заранее определенные нулевые адреса). Период подписки: день, месяц, год",
			"added": 1513199026
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}