{
	"next_topic_id": 18,
	"topic": [
		{
			"topic_id": 1532367158,
			"title": "Who broke the P2p news flow?",
			"body": "Who broke the P2p news flow? http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topics:1_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG/P2P+news+flow",
			"added": 1532367157
		},
		{
			"topic_id": 1535211258,
			"title": "What do you believe now that you didn't five years ago? Centralized wins. Decentralized loses.",
			"body": "http://highscalability.com/blog/2018/8/22/what-do-you-believe-now-that-you-didnt-five-years-ago-centra.html",
			"added": 1535211256
		},
		{
			"topic_id": 1535211568,
			"title": "Centralized vs Decentralized vs Distributed (ZeroNet is distributed)",
			"body": "https://medium.com/delta-exchange/centralized-vs-decentralized-vs-distributed-41d92d463868",
			"added": 1535211565
		},
		{
			"topic_id": 1540635037,
			"title": "Preservation",
			"body": "Over the last year I've been really getting into Stoicism, anyway I came across a list of Stoic philosophers [1] on Wikipedia and it is very sad to click on the majority of the pages to see the titles of books that were written followed by \"it is now lost to us\". My question is, do sites like archive.org, IPFS, ZeroNet etc go far enough to preserving texts we have an other culture if we came up against another dark age? \n\n[1] https://en.wikipedia.org/wiki/List_of_Stoic_philosophers",
			"added": 1540635032
		},
		{
			"topic_id": 1541600740,
			"title": "Where do you get your morals from?",
			"body": "One of the things I dislike about ZeroNet is that with the added anonymity it gives people a cover to be shameless and post some very base material (I'm looking at those of you uploading child abuse).\n\nAll the way through history you have those people who voluntarily take on morals and those who have to be set straight by laws. I sort of think ZeroNet offers an opportunity for people to develop their own moral character seeing as enforcement is basically impossible.\n\nWith that said, do you read moral works? Where do you get your morals from? Is it the Bible, the Quran? Æsop's fables? A philosophy or another religion? Or, in throwing out God(s) and adopting atheism or agnosticism, have you discarded morals too? Or maybe you never had them. I'm interested to know.",
			"added": 1541600734
		},
		{
			"topic_id": 1551108132,
			"title": "Can intranet users see what the rest of the world posts?",
			"body": "Russia was going to test its intranet recently, if a russian comes on here while their net is closed off from the outside world would they be able to contact the outside world on here?",
			"added": 1551108125
		},
		{
			"topic_id": 1551444946,
			"title": "Do you have to do any tricks to get on Zeronet in China or does it work out a way to bypass filters?",
			"body": "",
			"added": 1551444938
		},
		{
			"topic_id": 1552495966,
			"title": "Facebook and Google down within 24 hours",
			"body": "Last night I got a DNS error because I use Google DNS and it had some issues, using 1.1.1.1 as my secondary DNS got me back online though. Now Facebook is having trouble logging me in. So, Facebook and Google experiencing issues within 24 hours? Coincidence?",
			"added": 1552495957
		},
		{
			"topic_id": 1559590587,
			"title": "Zeronet browser",
			"body": "On wikipedia it says \"On 2018, development has been initiated on the first web browser dedicated to ZeroNet and the zero:// protocol: ZeroNet Browser.\" Can you get this web browser? where from?",
			"added": 1559590576
		},
		{
			"topic_id": 1559835007,
			"title": "Olio app for free food",
			"body": "http://127.0.0.1:43110/1QjAM7p3DXRjrTSUqM8M7iZxbE9E7GMaq/?Post:2",
			"added": 1559834995
		},
		{
			"topic_id": 1559930366,
			"title": "How do I block a specific user on kopykate?",
			"body": "",
			"added": 1559930353
		},
		{
			"topic_id": 1561216168,
			"title": "Do you run BOINC?",
			"body": "If you do, which projects are you involved in and which devices do you run it on?\n\nI'm run WCG on my Android phone and tablet, only OpenZIKA runs on Android so that's all I contribute to atm, hbu?",
			"added": 1561216154
		},
		{
			"topic_id": 1566749586,
			"title": "@ Chinese residents and nobody else",
			"body": "Have you had any experience with the new social credit score system, what is it really like? Is it as bad as the media in the west make out?",
			"added": 1566749571
		},
		{
			"topic_id": 1570379712,
			"title": "What are some cool mesh/decentralised/distributed projects you know about?",
			"body": "",
			"added": 1570379695
		}
	],
	"topic_vote": {
		"1551108132_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": 1
	},
	"next_comment_id": 71,
	"comment": {
		"1533632541_16LdT3GLYKemm8EWbR5BYXKMmMoZrSoet5": [
			{
				"comment_id": 1,
				"body": "Dunno, I'm just happy ZeroNet came along in time :P",
				"added": 1534588071
			}
		],
		"1535406484_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 2,
				"body": "Oh here's one, they're all on zeroup afaik http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1P3qFNSrNRTwY3we8g7s29JpAj8VmajcN1/1533076537-ar15_complete.zip",
				"added": 1535406886
			}
		],
		"1537592624_1CthCNo2eADyWkShCTBTVKGHy3WNXcj6Fh": [
			{
				"comment_id": 3,
				"body": "\"Activists from the feminist and LGBTQIA+ communities have been trying to force the Linux project to join the Contributor Covenant since at least 2015. The Contributor Covenant is an agreement to implement a special Code of Conduct (frequently CoC from now on) aimed at changing the predominantly white, straight, and male face of programming. CC’s Code of Conduct is controversial particularly because it allows anyone to be banned from contributing code for any reason, usually with no mechanism for oversight or accountability.\" - SJWs are fucking wet bastards.",
				"added": 1537744059
			}
		],
		"1540635037_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 4,
				"body": "> [moor](#comment_30_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): what do you mean by dark age? idk if 0Net is the most optimized way to preserve stuff but it does have many features that i would argue that are essential for such.\n\nWell in antiquity they were quite enlightened, you had people like Eratosthenes working out the circumference of the Earth quite accurately, texts from all over the known world were collected and preserved in libraries and so on. Basically by the dark ages I'm referring to the time when we lost lots of historical texts. Off the top of my head, I can say that Stobaeus' Florilegium is only available in Latin and German with bits in Ancient Greek, no English translation exists. Those two ancient languages aren't exactly prolific any more and the most popular language learning website, Duolingo, refuses to add Latin despite there being plenty eager to make a course.\n\nBasically there are tonnes of documents now, how do we stop them getting lost in future.",
				"added": 1540814942
			}
		],
		"1541565435_15TSdTU5ZrAHXXiMQvMUEEUm17GFt5WqWp": [
			{
				"comment_id": 5,
				"body": "> [nekololi](#comment_294_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): i honestly think that we should ban the ip ranges of all Minnesota ISPs to reduce the amount of low quality posts on ZeroNet. let's all bug nofish to make this happen and make this network a better place!\n\nWhat about the Minnesotans though?",
				"added": 1541596886
			},
			{
				"comment_id": 6,
				"body": "OP, if you don't like someone just mute them.",
				"added": 1541596924
			}
		],
		"1540796902_148DXj745fSuMtCnbh3uJnb3Tm4ZbdabJY": [
			{
				"comment_id": 7,
				"body": "> [thunder33345](#comment_309_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): depends, the mastodon has land itself a bit of a doggy situation from what i heardif you make an instance with no rules, expect everyone to block your instance and now no one can communicate with you and you are cut off from the rest of the worldand admins can easily kick you off their instance if they choose to do so\n\nI wondered why there were reams of rules of every instance I was looking at lol",
				"added": 1541597015
			}
		],
		"1541289967_1NcVwrBpf91ownXuSgYnHBZCWjoiNjw9FP": [
			{
				"comment_id": 8,
				"body": "Next Gen (2018//Netflix)",
				"added": 1541598105
			}
		],
		"1541600740_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 9,
				"body": "Aesop's Fables are here if you've never read them http://www.gutenberg.org/files/21/21-h/21-h.htm",
				"added": 1541601603
			},
			{
				"comment_id": 10,
				"body": "> [thunder33345](#comment_311_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): i simply believe we should uphold everything and anything, without discriminate between types of content it is,one has to ask self, is there any TRUE freedom if there's a list of things one cant do?can we even call it \"freedom\" if certain materials are prohibited to be uploaded??why dont we just call it \"Freedom\"(only content where we support)\n\nI'm not talking about what is and isn't permissible, it doesn't matter because it's next to impossible to ban stuff on here. I'm more interested in what morals people follow to help them decide between right and wrong and why apparently there are people on here who aren't ashamed about upload such content regardless of what anyone else says. It's interesting some of the ethics things I've read from antiquity discuss those \"who have forgotten how to blush\" basically those who have no shame and aren't embarrassed about things they ought to be embarrassed about.",
				"added": 1541604909
			},
			{
				"comment_id": 11,
				"body": "> [thunder33345](#comment_313_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): if you really are interested, dont be an asshole and ask them \"normally\", some may be happy to give you their point of viewwhich i doubt any of us can or will be able to do so better than they can [...]\n\nWhich part of what I just said make me an asshole? Where do you derive your morals from btw?",
				"added": 1541606566
			},
			{
				"comment_id": 12,
				"body": "> [nekololi](#comment_298_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): in answer to your question, i do not get my morals from any singular common source. i have a sense of right and wrong, and it is something that has developed organically over the course of my life, and it is something that is constantly being challenged and changed to adapt to an ever-changing world as i come to better understand it throughout the course of my life. [...]\n\nWith my preferred ethical texts, I had to relearn the word 'despise' because the 19th century meaning is a bit different from the modern meaning. I honestly don't mind where people take their ethics from but I think people ought to have a somewhat comprehensive system past the golden rule as it's pretty narrow but a good place to start from nonetheless.",
				"added": 1541608354
			},
			{
				"comment_id": 13,
				"body": "> [thunder33345](#comment_314_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): i never say you are an asshole, i just say dont be that guy,like i see most people will act hostile against anything they dont support, rather then try to be reasonable and understand the other sidethat's why i said thatalso if you ask me, probably personal philosophy\n\nOh OK, yes I get that. In one of texts I read the author is basically saying how you should act in a certain situation and then goes on to say that if someone else doesn't act that way don't be disagreeable or tell them of nor should you boast about the way act in that situation. There are other examples in this philosophy where it tells you not to talk about how you should act but that you should just do it - basically saying to be good you need to take these things on voluntarily rather than force them on people.",
				"added": 1541610972
			},
			{
				"comment_id": 14,
				"body": "> [eightyfour](#comment_16_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): Morals are gay. Nature will always prevail, and nature does not follow any moral code, only what works and what doesn't. Western morals don't work and will collapse. The Islamic morals are stronger -- not perfect, but they don't have to be. [...]\n\nPersonally I read the Stoics (Seneca, Epictetus etc) and they said human nature was to reason and to live a virtuous life (courage, justice, temperance, and wisdom). Yes we have a more animalistic side of the brain but they basically said through reason we don't have to resort to being animals.",
				"added": 1541632774
			},
			{
				"comment_id": 15,
				"body": "> [atomiserxenolith](#comment_24_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): Disliking child abuse isn't a reason to dislike ZeroNet. Child abuse is a manifestation of one person's Will being imposed without consent upon another (a foundational concept of our Society); ZeroNet is a manifestation of free speech, something that is essential to limiting the ability of the powerful to impose their Will upon the weak. You're disliking (a part of) the remedy because you dislike the symptoms of the disease, which, I suggest, is neither moral nor rational.\n\nI do like ZeroNet essentially, I don't like some people for sharing what they share though. This post was made because I'm interested to know where people get their morals from. ZeroNet offers a cover so some people think they can act with being arrested but I think a person with a decent set of morals wouldn't post that content whether there was a chance of being arrested or not; therefore, some people on here don't have a moral compass in my opinion and this is proven by the content they're posting.",
				"added": 1541674883
			},
			{
				"comment_id": 16,
				"body": "> [eightyfour](#comment_17_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): I still find it a hard pill to swallow, but it's the price to pay for free speech, and by extension truth, and I'm willing to pay that price. Take liveleaks, it's a very important sort of service for exposing horrible violence and accidents that would be wiped from almost any other site -- and some of which would be illegal to post online in certain countries! A lot of it is disgusting and I can't stomach to watch it, but I'm glad it is out there to document e.g. the horrors of ISIL, or the US army killing innocent people. [...]\n\nI'm absolutely in favour of these types of service and don't want some outside body to come filtering content, no I'm just digging a bit for what guide people use themselves for deciding right actions. I honestly think the world would be a better place if people took it upon themselves to adhere to some sort of moral code rather than have some law being enforced by someone else. Hopefully those uploading dodgy content will read this post and decide to change their own behaviour too, if not only for themselves.",
				"added": 1541675144
			},
			{
				"comment_id": 17,
				"body": "> [hitlerdindunufin](#comment_2_1GQEGSbb1piX5SihGbnVj7t6ypArWjaFDM): Morals don't exist. [...]\n\nWhy is it a big spook?",
				"added": 1541765715
			},
			{
				"comment_id": 18,
				"body": "> [ornataweaver](#comment_43_139zVkd4AsZqs9qSYk6ypPDAqDcjPCmRm4): Selfishness, understood wisely, is the best moral ground I have found in my life.If you are selfish, you avoid abusing people,If you are selfish, you build on your credibility.\n\nI think I heard a satanist say something similar",
				"added": 1542290271
			}
		],
		"1551108132_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 19,
				"body": "Answers are pretty much what I expected, ZN is awesome!",
				"added": 1551180207
			},
			{
				"comment_id": 23,
				"body": "> [leftside](#comment_650_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): You know what?I got an email account of one of the Russian portal sites a few years ago,while using that account for a while, I happened to have to send a critical private information to the pear so that I had to encrypt a file into .zip. After sending only one time they blocked my account. LoL..Russia and China are just a huge human zoo, not a normal country.Just the countries driven by a few perverts.\n\nRules don't equal human zoo lol.",
				"added": 1551444019
			}
		],
		"1551158338_15zJUjDdW3W9ppr6Voei1XHTyP8zraWAs3": [
			{
				"comment_id": 20,
				"body": "You can 3d print guns, designs are online.",
				"added": 1551181943
			},
			{
				"comment_id": 22,
				"body": "> [sheendocks](#comment_20_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU): You can 3d print guns, designs are online.\n\nin fact http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1P3qFNSrNRTwY3we8g7s29JpAj8VmajcN1/1533076537-ar15_complete.zip",
				"added": 1551185132
			}
		],
		"1550907964_19HaBBc1M3usmLxayEasbaTkeZ3Ttr25gD": [
			{
				"comment_id": 21,
				"body": "> [kaffie](#comment_796_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): It's not really possible. MMOs are such because they have huge backend servers to keep track of everything. ZeroNet doesn't have any backend servers nor any sort of decentralized processing (or really front-end processing other than what your browser does). trying to use ZN infrastructure to pass data is also a lot slower than would be realistic for a game; especially an mmo. [...]\n\nWhat do you think are the best use cases for p2p networks aside from file sharing and ZN?",
				"added": 1551182030
			}
		],
		"1554908088_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 24,
				"body": "On the zerotalk home page is a post asking for \"furry zites\". Smartphones are the least of peoples' problems lol",
				"added": 1554980911
			}
		],
		"1554985622_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 25,
				"body": "I support him but wish he'd though about the optics a bit more and walked out calmly than the struggle we saw.",
				"added": 1554988503
			}
		],
		"1555146666_188pxnB54HwLEH4bgwW5kJaKj5KCUP3GXf": [
			{
				"comment_id": 26,
				"body": "lol as if",
				"added": 1555168216
			}
		],
		"1559588912_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 27,
				"body": "test",
				"added": 1559589175
			},
			{
				"comment_id": 28,
				"body": "> [twentyneuf](#comment_2_12636tN4LXJ5f3YTuxVRFDZbYb8JY61RPJ): pam\n\nam",
				"added": 1559589213
			},
			{
				"comment_id": 29,
				"body": "iljoij",
				"added": 1559589254
			}
		],
		"1559258606_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 30,
				"body": "Good news, worldwide, according to statcounter, Mozilla Firefox, on the desktop, went back above 10% to 10.01% :)",
				"added": 1559590131
			}
		],
		"1558691316_15Gk4wzjyNbPU3JZ31UnqMM3CMrX8pxmzF": [
			{
				"comment_id": 31,
				"body": "Install the 'I don't care about cookies' addon.",
				"added": 1559600912
			}
		],
		"1557680958_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 32,
				"body": "They weren't trying to lose, they're just fucking idiots.",
				"added": 1559601064
			}
		],
		"1559590587_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 35,
				"body": "> [leftside](#comment_776_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): try this: http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u/1556750255\n\nthanks",
				"added": 1559643701
			}
		],
		"1559163351_1CZMjjnu2qd6BuoeLC35vc4o7A9LRtQZrJ": [
			{
				"comment_id": 34,
				"body": "Amoris Laetitia is worth a read https://w2.vatican.va/content/dam/francesco/pdf/apost_exhortations/documents/papa-francesco_esortazione-ap_20160319_amoris-laetitia_en.pdf",
				"added": 1559641505
			}
		],
		"1559651192_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 36,
				"body": "Isn't Android Studio just a tweaked Jetbrains IDE? I think the blame lies more with them.",
				"added": 1559652420
			}
		],
		"1559840057_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 37,
				"body": "I think you'll be fine, Python 3 isn't all that new now.",
				"added": 1559840698
			}
		],
		"1559768099_149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN": [
			{
				"comment_id": 38,
				"body": "Keep the porn and child abuse off the zite if possible.",
				"added": 1559840776
			}
		],
		"1559930366_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 39,
				"body": "> [anonymouslogin](#comment_325_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Using blocklists. You can clone this one, then click open site directory and go to filters folder. There is a users.json file. You just need to edit cert_user_id and enable the slider on the site. [...]\n\nIs that the easiest method?",
				"added": 1559938507
			}
		],
		"1560001040_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 40,
				"body": "You're an idiot lol. Go find a climate change flood map and raise the sea levels and see how much of your country sinks underwater. Then think about where all those people living there will move to... answer: your area. If you're dead at this point then lucky you, if not enjoy higher rents!",
				"added": 1560001276
			},
			{
				"comment_id": 41,
				"body": "As for air pollution, download BreezoMeter, it will tell you the pollution levels for your area. Im in a small town and its usually classified as good air but it does drop below that sometimes.",
				"added": 1560001816
			},
			{
				"comment_id": 42,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_195_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you read too much news and therefore can't think. Observe how nature works then come back in a few months.\n\nNice channel I found for you https://www.youtube.com/channel/UCXjXjzC8qcEg8-659UbAgKQ/videos",
				"added": 1560006407
			},
			{
				"comment_id": 43,
				"body": "My carbon footprint last year was 0.7 tonnes of co2. By 2050 everyone needs to be at 1 tonne, people are way above this right now. Download OneTonneFuture to check yours.",
				"added": 1560006475
			},
			{
				"comment_id": 44,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_197_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"My carbon footprint\",lol,you read too much news and tv. stay away from all this for a few decades, and then you 'will start thinking clearly'.\n\nAre you a retard? Your footprint just means the amount of carbon emitted during your life based on how you travel and the things you buy and how you get your energy (do you use renewable energy or fossil fuels etc). Seeing as you think clearly now, I assume you've actually researched man made climate change which you appear to dismiss. What is your carbon footprint, you think it's funny and irrelevant so I'm sure you won't mind finding it out and sharing :)",
				"added": 1560015543
			},
			{
				"comment_id": 45,
				"body": "> [anonlogin](#comment_13_19r2tS5GqeMQnxmyPq9ufD79LXoMVDszDU): https://www.cfact.org/pdf/CO2-TheGasOfLife.pdf [...]\n\nLol, that quote by Gorbachev doesn't means man made climate change isn't happening.",
				"added": 1560108223
			}
		],
		"1560227102_1D7aG9GPhaCuEEiGRQpUZGZkMQVEGRga9H": [
			{
				"comment_id": 46,
				"body": "Iran, DPRK, and Venezuela. Iran has IRGC, DPRK has a huge army and China on its side, what does Venezuela have except backing from Cuba? Venezuela is at the top of the hit list I'm afraid but they'll keep pushing for a peaceful overthrow first and then resort to war if that fails. Hopefully, Russia will step in if Venezuela is attacked but no guarantee.",
				"added": 1560271768
			}
		],
		"1560347482_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 47,
				"body": "Currently reading Pope Francis' Amoris Laetitia. It got a lot of hate from high horse Christians who just complain all the time but it's a very good read. He's not a liberal like the media like to point at, it comes across as a modern day ancient philosopher. I'm more familiar with the Stoics (read Rufus and Hierocles for lifestyle stuff) and he sounds a lot like them. No rabid hatred but no bend backward to accommodate modern attitudes.",
				"added": 1560437350
			},
			{
				"comment_id": 48,
				"body": "https://w2.vatican.va/content/dam/francesco/pdf/apost_exhortations/documents/papa-francesco_esortazione-ap_20160319_amoris-laetitia_en.pdf",
				"added": 1560437389
			},
			{
				"comment_id": 49,
				"body": "And, before anyone asks, I don't think the Pope is an illuminati puppet :P",
				"added": 1560437571
			},
			{
				"comment_id": 50,
				"body": "> [allelujah](#comment_4_1ErXkEqy2cnpcq7DcLYhW652yM7KHyhApR): Arturo Marcelino Sosa Abascal SJ \n\nI can't sum it up because I couldn't do it justice but paragraphs 173-178 (inclusive) are quite good. Paragraph 56 discusses gender and some good points are made there too. The book is obviously religious in nature, referring back to Christianity very frequently, but it discusses all the different relationships with our family and friends and how best to make them work. It's really cheap online if you don't want to read the PDF but even for none religious people I think it holds a lot of value. https://www.aslanchristianbooks.com/amoris-laetitia-the-joy-of-love-apostolic-exhortation-on-love-in-the-family-9781784691226/",
				"added": 1560447528
			}
		],
		"1560456511_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 51,
				"body": "If you hate the way the individualists are going today I'd seriously recommend digging out ancient philosophy books. Look up Hierocles (the Stoic), Musonius Rufus, Cicero (on duties), all of their texts are online free to read, they're the polar opposite to some of the ideas being pushed today but are absent of all the hatred spewed by these youtubers.",
				"added": 1560460165
			},
			{
				"comment_id": 52,
				"body": "> [nickwa](#comment_155_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): These people taking down these videos will not help anyways. All this censoring is doing is making them seem right. People can complain all they want about \"hateful YouTubers\"(which I think they aren't, just being propagandized by big establishment), but censoring just makes them bigger.\n\nGutenberg is having issues right now but here's a link to Cicero's on duties. It's in English and Latin all in one book http://www.gutenberg.org/ebooks/47001",
				"added": 1560463285
			}
		],
		"1566815498_1MgPQAFQwHMiHTouXfUiS98cHrnyLScEQd": [
			{
				"comment_id": 53,
				"body": "because people are idiots. We are expecting a crash though soon",
				"added": 1566842881
			}
		],
		"1568941688_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 54,
				"body": "I don't believe it.",
				"added": 1569086076
			}
		],
		"1568498469_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 55,
				"body": "Low grade \"journalists\" and internet mob attack RMS with lies. In-depth review. https://sterling-archermedes.github.io/index.html",
				"added": 1569687583
			},
			{
				"comment_id": 56,
				"body": "Guys! We gave Socrates hemlock again.",
				"added": 1569713309
			}
		],
		"1570379712_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 57,
				"body": "https://fediverse.party/",
				"added": 1570380143
			},
			{
				"comment_id": 58,
				"body": "https://briarproject.org/",
				"added": 1570380158
			},
			{
				"comment_id": 59,
				"body": "https://www.manyver.se/",
				"added": 1570380170
			},
			{
				"comment_id": 60,
				"body": "https://www.scuttlebutt.nz/",
				"added": 1570380193
			},
			{
				"comment_id": 64,
				"body": "> [kusoneko](#comment_90_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5): This is interesting but the fact you need to meet people IRL to add them to your contacts makes it very unusable: no one uses it because no one they know IRL uses it. This is the main problem with it. What's the point of this? Do people ever use that when most people you know are likely using clearnet sites or services and the people you'd use this with are all likely to be people you've met online, in other words, with whom you can't connect with this cause it requires you to meet up? [...]\n\nYeah, I have Manyverse on my phone now but won't be connecting to those public things, they're talking about releasing on iOS and I msgd the dev to ask for persistency so that the DHT connection can work in the background. Definitely has work to do but I find it super interesting and could end up being very good, it reminds me of Zeronet a bit but coming it at a self hosted network from the other end, ZN connects you to everyone right away and manyverse connects you to none.",
				"added": 1570577858
			},
			{
				"comment_id": 65,
				"body": "> [emmet](#comment_26_1N4DSSHorDvEkDGkQfUhnnryYiTdtUW8hU): I don't get it. Can you explain a bit more what's the difference?\n\nManyverse is list a social network for mobile (it's a mobile implementation of scuttlebutt which works on desktop too). Essentially, you can connect to people via bluetooth, those on the same wifi, via DHT, or via \"pubs\" which pull data from lots of users who decide to join (not really sure on how pubs work). Because Manyverse works via bluetooth and the local network it's resist to internet connections been taken offline. Andre Staltz develops it and has made some FAQ videos https://www.youtube.com/watch?v=RANVVy9oyXE",
				"added": 1570585034
			},
			{
				"comment_id": 66,
				"body": "> [kusoneko](#comment_92_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5): Basically, ZeroNet provides for websites hosted on everyone's (who uses ZeroNet) device. Manyverse provides for ScuttleButt on mobile. ScuttleButt provides a sort of micro-blogging social network where you only host the content of people you follow, and you start with exactly 0 people in your social network, and grow it progressively as you meet and add people to your list. In concept, an interesting idea, in reality, a pretty shitty one, cause, well, if you want to suppress speech, just ban someone from all public nodes (of which there are few) and ask people in those nodes to ban the person from their private node as well, and then the person disappears. This leads to a sort of system where instead of a large global hard/impossible to censor network like ZeroNet is you get essentially a bunch of closed off social networks that only accept people they agree with, an echo chamber essentially. If other people who don't follow the same ideology as the main SB devs decided to make pubs, they wouldn't be allowed on their official pub list, thereby removing the main source of potential users for such a small thing that has such a low user base. If they still managed to get adoption going for that pub in their community, you'd end up with 2 separate networks using the same protocol, because they don't politically agree with each other, and therefore refuse to host each other's content and will block anyone who attempts to link the 2 together in any way. It doesn't offer anything of value, in other words, besides being a closed-off system that is sort of decentralized. [...]\n\nFor me, I plan to use it with a small group of friends and family, I think it's perfect for this. I tried connecting to a pub and they're a bit big so I'll probably just avoid those altogether from now on.",
				"added": 1570586450
			},
			{
				"comment_id": 67,
				"body": "> [emmet](#comment_28_1N4DSSHorDvEkDGkQfUhnnryYiTdtUW8hU): So there's nothing preventing it from generating lots of new IDs and spamming with that? I guess I'm asking what's the ZeroID equivalent on there.\n\nYour ID is attached to an install so you have as many IDs as you have devices.",
				"added": 1570636606
			},
			{
				"comment_id": 68,
				"body": "> [filips](#comment_248_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): What if you switch a phone? Upgrade its system? I saw some problems with many apps which uses device ID for auth which broke after Android upgrade...\n\nAccording to this https://gitlab.com/staltz/manyverse/wikis/roadmap Manyverse will give you a seed phrase which you can enter to restore your identity. It's not here yet but within the next month apparently.",
				"added": 1570814889
			}
		],
		"1570416195_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": [
			{
				"comment_id": 61,
				"body": "Use MX Linux, it uses sysvinit with the option to reboot with systemd hack (can't think of the terms) if you need to use Snaps and the like.",
				"added": 1570455976
			}
		],
		"1570756155_1PY5FP1G6QNSCsA8nM1SjuXiPWZnQhQj9P": [
			{
				"comment_id": 69,
				"body": "I used to be an atheist and always was one but now I like the Stoic's pantheist ideas.",
				"added": 1570815033
			}
		],
		"1584777793_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 70,
				"body": "That would be a solution to Youtube or Netflix becoming burdened for sure but when we are talking about the ISPs being burdened by the traffic then zeronet, torrents etc will all be affected too.",
				"added": 1584983957
			}
		]
	},
	"comment_vote": {
		"33_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"310_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"322_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"297_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"17_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"641_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"342_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"643_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"970_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": 1,
		"579_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"104_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"29_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": 1,
		"3_1MgPE4CsgBwNtbxHUwyKDugHjp5j5emtWG": 1,
		"74_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"92_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5": 1
	}
}