{
	"next_comment_id": 10,
	"user_name": "Filip Š",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"post_like": {
		"1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1583181539": 1583352216
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@1bfqutudhtexlka: KxoID still works. But the problem is with Android version of ZeroNet which uses Python 2.7 so not all things are working.",
			"post_uri": "15Jmu7DkbxqtQ6mFhu6gLT1pbiMM55oywF_1578057953",
			"date_added": 1578068086
		},
		{
			"comment_id": 2,
			"body": "One of the other things related with Wasm is that you could create browser extension which runs ZeruNet Wasm and provides access to ZeroNet without installing it separately. And as browser extensions (at least in Firefox, probably also in Chrome) have access to TCP/UDP socket, it could actually even be fully-functional client.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1578643321",
			"date_added": 1578694242
		},
		{
			"comment_id": 3,
			"body": "@Git Center: That was old API. Now they have [libdweb](https://github.com/mozilla/libdweb) which supports new [TCPSocket API](https://github.com/mozilla/libdweb/blob/master/Readme.md#tcpsocket-api).",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1578643321",
			"date_added": 1578751969
		},
		{
			"comment_id": 4,
			"body": "@Ansho Rei:\n\n> The biggest problem is that it would not have file storage, so the plugin would always be leech-only.\n\nAre you sure? I think that there are some browser APIs for storage in extensions.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1578643321",
			"date_added": 1581160086
		},
		{
			"comment_id": 5,
			"body": "I didn't have time to check ZeruNet much, but it might also be useful to also split some other libraries. In case if ZeruNet (or original Python ZeroNet) would be enough modular, it would be easier to build custom applications with it.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1582478230",
			"date_added": 1582581702
		},
		{
			"comment_id": 6,
			"body": "@Ansho Rei:\n\n>  but a lot of it won't be useful without the rest I imagine\n\nIt isn't just this. Some things (for the future) may also be that you could be able to use \"core\" ZeroNet protocol implementation easily for your custom application and without any additional frontend implementation (so that you would basically make your own custom frontend). Similar to how IPFS and some other protocols provide more \"low-level\" access which can be used to build custom applications easily.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1582478230",
			"date_added": 1582647099
		},
		{
			"comment_id": 7,
			"body": "> Wouldn't you just have a e.g. Rust/Go/C/etc. client that communicates with any ZOS implementation? I don't like the idea of running 5 ZeroNet instances because some frontend dev \"likes doing it that way\"\n\nI already made such ZeroFrame WebSocket client for Node.js and Python. But it would be also good to have them for other langauges and also to support some more features.\n\nI also agree that usage of separate ZeroNet instance for each application is not appropriate. However, I more though about that for more \"embedded programs\" that don't have to have classic UI and don't depend on browser/HTTP. Maybe some low-level command-line programs or maybe even the OS itself.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1582478230",
			"date_added": 1582652964
		},
		{
			"comment_id": 8,
			"body": "> Good thing you say so now, I hadn't really thought about that. I might have to change my architecture somewhat to deal with that.\n\nDon't worry. It may be nice to have this in the future, but it is not so important. If you would have to change a lot of code, just don't do it. 😀",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1582478230",
			"date_added": 1582653036
		},
		{
			"comment_id": 9,
			"body": "@zeromepro: Python can also interact with Rust libraries, with projects like PyO3.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1583796988",
			"date_added": 1584050716
		}
	]
}