{"next_topic_id":1,"topic":[],"topic_vote":{},"next_comment_id":11,"comment":{"1616340894_1NrJoibEdrXzVEwJxwyMtHs79G9G29YmV4":[{"comment_id":1,"body":"1. Never heard of that one. Heard immunity isn't that complex to understand and nobody in their right mind think vaccines are the only way. The alternative way is to just let people die until only immune people remain and hope the virus doesn't mutate, which is the problem. It will mutate like the flu and will not go away unless you limit the spread to limit mutations and deaths.\n3. Bullshit. Mask do work, just look at the statistics, countris that wore mask early had to least problems.\n\nThis post is incredibly selective, like it's trying to find evidence of an already held viewpoint.","added":1616356711},{"comment_id":2,"body":"Edit: \n3) Bullshit. Mask do work, just look at the statistics, countris that wore mask early had to least problems.\n\nWhy did it change to 2.?","added":1616356789}],"1616209212_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy":[{"comment_id":3,"body":"Of course it would be plagued with all sort of conspiracies, anti-vaxxers, anti-science and other niceties. That's what happens when the big platforms kicks them out, they don't have a choice, they get pushed to places like here.","added":1616399231}],"1621790517_1BDov7xo2ezh8RNpumtUozsEv9C4yJAF9d":[{"comment_id":4,"body":"Not sure if serious or troll...","added":1621797434},{"comment_id":5,"body":"Jeff Bezos just bought a 500 millions $ yatch, by exploiting (looting) from \"we the people\", are you going to go after him? I just think it's funny people still think communism is a big threat a hundred year later, while completely ignoring the actual current problems and voting against their own interests (and not knowing what communism or marxism is, it's just anyone I disagree with). The irony of falling for propaganda while trying to fight propaganda.","added":1621829745},{"comment_id":6,"body":"> [wollet](#comment_1_1ATMPS5rPc8as7ywdMTXMHD4bkX2wfuwmE): Great Topic, wrong forum ! See Zerobiztalk for real solutions : http://127.0.0.1:43110/1KpLYGMGkVSMyHjJzBhSFvN8qXK1xXExpN/ [...]\n\nI never said I wanted to sensor you. Just pointing out the obvious: You fell for corporate conservative propaganda and all your views in the end just protect big corps, as if people like Jeff had your best interests in mind. It's what conservative media blast you with constantly: the other side is all secretly evil communists. They convince you that the source of your problems isn't the problem, the problem is the solution and we need more of the source of the problem, which lead to insane conspiracy theories because people won't admit that the plain and obvious source of the problem is the problem. Anyone who doesn't agree is secretly evil and part of some grand conspiracy and facts are all fake news. Of course, they're also good at making you feel oh so smart and so much better than everyone. Obviously if I win in a system I'm just better than everyone and it's everyone's fault that they lose. If I win the musical chair, it's because I'm so much better, circumstances be damned and it doesn't matter that there isn't enough chairs for everyone. You think you're so much better that you can kill people, think about that.","added":1621878419},{"comment_id":7,"body":"> [harbringerofdoom](#comment_1_1BDov7xo2ezh8RNpumtUozsEv9C4yJAF9d): You seem well informed on marxism. I have a few questions. [...]\n\nIt's all marxism and communism because it's the red scare going on for a hundred years. Tons of propaganda because of fear of change especially by the owner class who stand to lose. The same can be said of communists and their anti-capitalism propaganda. It's all just a game of power for those who hold it.\n\nMarxism isn't anymore hegemonic than capitalism. Either system only work if many people participate in it. Also, you can have a mix of both, you are allowed to cherry pick as long as many people agree to it.","added":1621899169},{"comment_id":8,"body":"> [harbringerofdoom](#comment_2_1BDov7xo2ezh8RNpumtUozsEv9C4yJAF9d): I think you have a transitory lack of understanding about the reality, or maybe it's me who is confused: [...]\n\nI was only responding to your question of why it's all about marxism. What it actually is doesn't even matter, it's what people think it is, and it was shaped by propaganda.\n\nI don't advocate for dictatorship, I advocate for a system that maximize freedom for everybody. So far the best is well regulated capitalism with a good safety net. A social democracy. Things are decided democratically so that a few can't trample over everybody's freedom (like the freedom of not getting infected by a dangerous disease). You can't live alone on your own island where things you do don't affect other people, it's delusional to think you could live in a pure free market along side billions of other people. You can't just have your way all the time.\n\nWe have to make a distinction: does a system offer freedom vs does a system work. A system that offer complete freedom is pointless if it doesn't work and vice versa. If most people decide by their free will that they don't want to participate in a free market, then how would a free market work?\n\nWhat bothers me the most in all this is that what people call \"marxists\" and \"communists\" actually aren't. It's like they think a large amount of people read the communist manifesto and said \"yep let's do this!\" when most people don't give a fuck, they just want a fair and just system that work for them and they get demonized and even threatened because of people who didn't take the time to understand and listen. Capital is power in our system, so when things go bad, it's because of people with power(with capital, capitalists). This idea that communism is the problem is laughable. So instead of blaming people with power, poor people get blamed, making the problem worst.","added":1621978525}],"1629402955_19BXHBD1GfYpSpvdHsuHJsJ97mYpxWjUE":[{"comment_id":9,"body":"Name a person that took the vaccine and died from the virus.","added":1629500826},{"comment_id":10,"body":"> [leonarddurden](#comment_9_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD): If your question is how do some see the truth and some are deceived it boils down to one thing and one thing only, having or not having a bull sht detector. Caveat—you will be more at peace understanding the people plugged into the Matrix who aren't disconnecting themselves aren't doing it to annoy you but they don't know they are connected.  [...]\n\nOh the irony of talking about being skeptical and questioning everything and yet believing in God and Jesus, and not just any, the christian one, not any of the thousands of other ones. By BS detector, you mean, your feelings and not facts or reality.","added":1629654947}]},"comment_vote":{}}