{
	"next_topic_id": 11,
	"topic": [
		{
			"topic_id": 1,
			"title": "中国大陆——文化大革命，三年自然灾害；美国——白色恐怖（爱因斯坦等科学家被FBI迫害...）",
			"body": "记录历史，保存资料——以供思考",
			"added": 1536428618,
			"parent_topic_uri": "3_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK"
		},
		{
			"topic_id": 2,
			"title": "中国大陆——文化大革命，三年自然灾害；美国、中国台湾——白色恐怖（爱因斯坦等科学家被FBI迫害...）",
			"body": "记录历史，保存资料",
			"added": 1536428724,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 3,
			"title": "首都三司，朱成昭，以及”帅府“公主”",
			"body": "【文化大革命】首都三司，朱成昭，以及”帅府“公主”－他山之石三十 [此博文包含图片] (2013-05-17 16:24:13)\n转载\n▼\n标签： 首都三司 凌子 五一六通知 文革 文化 \t分类： 它山之石\n\n[首都三司，朱成昭，以及”帅府“公主”](http://blog.sina.com.cn/s/blog_60c463b00101cxep.html)\n\n## 原作者：邢天行\n\n今天是5.16四十七周年。知道这个日子的人可能已经不太多了；知道这个日子而且还时不时想到它的应该更不多了。对一个被”有组织地“地遗忘自己的真实历史的国度，我们确实不能有太多的奢望。\n\n五月份还有一个日子却会被永远记住，即使你忘记了，这个国家还会提醒你：1933年5月10日。80年前的这一天，德国纳粹在攫取权力后，”自下而上“地举行了声势浩大的焚书活动，在柏林歌剧院广场和全国各大学，受纳粹思想影响的大学生（！）和教授（！），焚烧了成千上万册”非德意志思想“的书籍，由此揭开了欧洲现代史上（前苏联除外）文化专制最黑暗的一页。我虽然只能从书本上读到有关史料，但我却可以想象当时的情景，因为在中国，5.16引发的“扫四旧”中，也有大批珍稀书籍被毁之一炬，这些都是我们经历过的，由此及彼地想象并不困难。虽然这两个日子所造成的的黑暗，绝不仅止于焚书，但焚书是暴政的信号，从秦始皇开始，就没有变过。\n\n\n但是，有一点却是可以因民族而异的，那就是一个民族对自己黑暗历史的记忆。德国人对自己祖辈罪行的毫不留情，已经到了令我们很不好意思的地步。5月10日前后德国报章，电台，电视台对80年前这场闹剧”连篇累牍“的回忆，评论，分析，访谈便是证明。它和中国今天对5.16的集体失语形成了鲜明对照。\n\n因此我的良心深处便要我发出一点点声音，哪怕这声音小的只有我自己能听到。\n\n找出来朋友不久前发给我的一篇文章，是从5.16讲起的，讲的是我们这些过来人多多少少听说过，或者经历过的事，也填补了一些认知上的空白。作者是邢天行，为了节省篇幅，我做了删节，另加了小标题，但没有改动内容。题目也稍作了改动。喜欢这篇文章，是因为它是叙实的，不感情用事的，不强加于人的。\n\n\n一个民族有过发疯的时代，其实并不可怕，也非耻辱。狂热至极，也就是清醒的开始，如当年的朱成昭，叶向真，也如当年的我们。可怕的是为了一己私利，“有组织，有计划，有目的“地掩盖这种曾经的疯狂，掩盖的结果便是集体的浑噩。“抗日神剧”一类精神产品，便是现代版的“刀枪不入”。中国人今天所表现出来的某种浑噩和犬儒，其实是怪不得他们的，他们本来可以活得头脑清醒如德意志民族一样。掩盖真实，便是一个民族在精神上被阉割的开始。\n\n以下便是我向大家推荐的原文――晓 2013年5月16日\n\n首都三司，朱成昭，以及”帅府“公主”\n\n## 一 序曲\n\n1966年5月16日，中共会议通过了毛泽东主持制定《五一六通知》）。《五一六通知》为文革确定了一套理论、路线和方针；重新设立文化革命小组，陈伯达任组长，江青是副组长。此小组在文革中一跃成为实际的最高权力机构，主导了国家一切事务。\n\n随后，毛泽东派陈伯达的工作组进驻《人民日报》领导工作。6月1日，《人民日报》社论《横扫一切牛鬼蛇神》发布，它宛若一颗爆炸了的毒气弹，让神州大地都疯起来。同一天，毛泽东批示，全文广播和在全国报刊刊出北京大学聂元梓7人的造反大字报全文。中央电台立即向全国广播此大字报，《人民日报》等报纸于第二天后开始刊发。由此，文革燃烧起来，全国上下兴起造反运动。\n\n最早的红卫兵名称来自于一位清华附中学生张承志在班级所贴的大字报上的笔名，意为“毛泽东的红色卫兵”。学生所贴的大字报就纷纷书上红卫兵署名。此后局势迅速发展，全国大中学校学生纷纷造反，反对学校党委和领导，很快使得很多学校的领导和教学工作瘫痪或基本瘫痪。北大发生了6.18揪斗师生和干部的事件，几十人挨打。\n\n“6.18”事件遭到了刘少奇等的否定，刘少奇向大中学校派出工作组，站在党委一边，制止乱打乱斗。但是工作组也只会使用“反右”式定罪那一套斗争手段打击造反师生，这也激发了对方不满。毛泽东要让群众自己起来搞文革，他知道全国学生会乱起来，他要的就是先乱起来。毛回到北京后，强令撤销工作组（毛7月24日正式下令撤出工作组），指责工作组是“镇压”，“站在资产阶级方面反对无产阶级”。随后，在8月的中共中央会议中，毛进一步打压工作组。\n\n1966年8月，中共八届十一中全会召开。写大字报的第一人聂元梓，被特许列席了中央这次全会。毛泽东还在人民大会堂接见了聂元梓。毛泽东知道，党内有不少人对学生运动和工作组问题持有不同意见。要把“文化大革命”搞起来，还必须有一个大发动。于是，他采取了一个惊人之举，写了一张大字报。8月7日，毛泽东在会议上印发了《炮打司令部——我的一张大字报》。虽然没有点刘少奇等人的名，但明显定性刘少奇等人是“站在反动的资产阶级立场上，实行资产阶级专政”，“围剿革命派”，“实行白色恐怖”，“长资产阶级的威风，灭无产阶级的志气，又何其毒也!”这个大字报给会议基本定了调子，参加会议反对学生造反和主张派工作组的人再不敢说什么了。8月8日，全会通过了《中国共产党中央委员会关于无产阶级文化大革命的决定》（“十六条”）。规定，要依靠“一大批本来不出名的革命青少年”来反对所谓“走资派”即党的各级官员。此后，，“文化大革命”在全国真正全面开始搞了起来。\n\n文革始于1966年6月，真正的疯狂起于同年8月，又叫红八月，在一个月内，仅北京一地，便有1,772人被活活打死，受不了折磨而自杀的人无法统计。8月5日，北京师大附中副校长卞仲耕，被该校红卫兵活活打死，她是文革中被打死的第一人。卞仲耘的丈夫王晶尧曾明确表示邓小平的女儿邓榕有份参与行凶，邓榕当时是该校红卫兵组织的负责人之一。此后，又发生了多起红卫兵打死人的情况。北京市委的意见是“打死就打死了”。公安部长谢富治说：公安机关不要出面制止红卫兵的暴力和杀戮，打死就打死了，“如果你把打人的人扣留起来，捕起来，你们就要犯错误。”打人杀人的事情受到保护，没人敢制止，暴行就席卷开来。\n\n早期的红卫兵必须是相当级别的高干子弟。北京师大附中是北京重点中学，高级干部的子女占了一半，中央高干子女很多在这里读书。所以文革红卫兵在这类学校就有突出的表现。老红卫兵宣扬“老子英雄儿好汉，老子反动儿混蛋”的血统论，这是长期阶级斗争教育的结果。这些“红五类”子女自认根正苗红，穿上他们革命老子的绿军装，扎上腰带，以示出身的高贵和革命性，这种装扮立即风靡全国，成了红卫兵的样板着装。他们照例要革别人的命，除了已打倒在地的“黑五类”（地、富、反、坏、右）以外，加上黑帮、臭老九，统称为“牛鬼蛇神”，并大肆批斗出身不好的学生和老师。\n\n8月18日毛泽东在天安门接见红卫兵时，北师大附中红卫兵头头、东北局第一书记宋任穷的女儿宋彬彬给他献红袖章。毛问她的名字并问：“是文质彬彬的彬吗?”宋说“是”，毛说：“要武嘛。”8月20日《光明日报》发表了一篇文章，题目是《我给毛主席戴上红袖章》，署名宋要武（宋彬彬），文中对“要武嘛”三个字大做文章。接着《人民日报》转载了《光明日报》的文章。毛泽东佩戴着红卫兵袖章和“要武”的指示迅速传遍全国。文革第一波暴行也随之席卷全国。\n\n此后，红卫兵受到毛八次接见，造反派迅速被拉了起来，红卫兵运动在全国燃烧起来。大串联、语录歌、忠字舞纷纷登场。得到毛泽东“造反有理”上方宝剑的红卫兵，高唱，造所谓“牛鬼蛇神”的反，“破四旧”、抄家、揪斗、游街示众，乱打乱砸。在《人民日报》《红旗》杂志等的一再煽动下，一场旷古浩劫席卷全国。\n\n宋彬彬在回忆文章中表示，她在8.19那天就写声明退出了筹委会，不再是该校红卫兵的头。《光明日报》的文章不是她写的，她看到被人以自己名义写文章，而且名字也被改了，当时很生气。全国各地都给宋要武（宋彬彬）写信，甚至到北京见她，她就改名了，叫“宋岩”。她对“8•18”后的暴力升级、打人成风，感到不解，也没有参加以后红卫兵破四旧的事情。\n\n\n## 二 朱成昭的出现\n\n朱成昭（1942-1998），安徽人。其父在文革前是上海建工局一个副局级老干部。他1960年毕业于中国最好的中学之一——上海市上海中学。因品学兼优，一毕业就被抽到上海的计算机研究所，作为未来的专家培养。朱在那里工作了两年，已经担任了课题组组长。由于在工作中他感到了自己在科学基础知识的贫乏，决定再去读大学。受到当时在上中最为流行的《勘探队员之歌》的影响，他报考了北京地质学院。1962年入校后，正值阶级斗争之风盛行，朱和不少同学一起被两次派出参加“四清”。\n\n文革爆发，朱成昭是地质学院水文系学生，他和一些同学一起给地院工作队邹大尤提了一些意见，被队领导辱骂，并被划为“第三类学生”，在工作组整的黑材料中已经定下“送去劳改”。朱成昭和几个同学因此不满，开始“造反”，在8月8日成立了地院“东方红公社”。因为他们不搞“血统论”，只要反对工作组，不论出身谁都可以加入，很快一跃成为地院最大的造反派组织。在其示范下，同样的造反组织纷纷成立，他们与只准“红五类”参加的老红卫兵对着干。这些组织后来成为首都三司的主力。\n\n“地院东方红”成立后，组织人马、联合其他造反组织四进地质部。邹大尤是地质部副部长，文革初期任地质大学工作组组长。第一次绝食静坐逼得邹大尤不得不在第二天到地院接受批判。第二次想独占地质部，与干部子弟红卫兵造反组织“西纠”发生武斗，15天后撤走。第三次，把地质部党委书记兼副部长何长工也绑架回学校秘密关押。第四次，把地质部的领导干部全部打倒了。因此，地质东方红名声大噪。\n\n## 三 “首都三司“\n\n1966年9月6日，朱成昭牵头成立了“首都大专院校红卫兵革命造反司令部”（后来被称为“首都三司”）。当时，“首都三司”是北京近50所高校的约60多个红卫兵组织的联合体，总部设在北京市劳动人民文化宫的太庙，受到大多数人的拥护。不仅全北京市各学校都有“三司”的支持者，还在全国44个城市都设立了联络站。\n\n首都三司从来没有设立过“司令”一职。发起人朱成昭任总负责人。当时蒯大富因反对清华大学校党委而被工作组批判，藏在地质学院。毛泽东的女儿李讷（化名肖力，北大学生）找到蒯大富要他回清华成立造反组织，周恩来和中央文革小组多次要朱成昭设法支持蒯大富，以“减轻中央压力”。朱成昭派过一支地院东方红的战斗队去清华帮助蒯组织队伍。为了树立蒯大富的威信，朱成昭又让蒯担任三司的第二把手，让蒯大富在三司成立大会上代表发言，后被误传为三司“蒯司令”。\n\n毛泽东对朱成昭四进地质部的情况了如指掌。毛的女儿李讷在钓鱼台中央文革办事组工作。毛泽东自7月起便一直派他的女儿李讷任直接的联络员，到各高校活动。周恩来有一个秘密联络员“老李”；中央文革的关锋、阎长贵等都担任过观察员和联络员。因此，红卫兵的动向毛一直牢牢掌握和控制。朱成昭在地质部静坐时，李讷就在场。“地院东方红”四进地质部打倒领导干部，正符合了毛发动“文革”对付当权派的主旨，而老红卫兵一直陷在破四旧，斗知识份子和黑五类里面。于是毛与中央文革小组转而支持和利用“三司”，朱成昭、王大宾等受到了毛、林、周、康及中央文革成员的多次接见。许多他们想做又不方便做的事情就鼓动“三司”的人去做。\n\n李讷穿梭在各大学造反派组织之间，了解他们的动态，支持他们的“革命行动”。中央文革办公室也不便问她的去向。李讷经常去朱成昭那里。那时没有手机，每当毛泽东或者江青要李讷回家，电话打到钓鱼台，中央文革的人就找朱成昭。找到朱成昭就找到李讷了。首都三司成立等一系列重大活动，李讷一身学生打扮，到那里也不会引起别人注意。除了朱成昭、蒯大富、聂元梓、韩爱晶等几个人造反派领袖知道她是毛主席的联络员外，一般人不知道她的身份。\n\n\n## 四 叶向真的出现\n\n叶剑英的女儿叶向真，在文革一开始就扯旗造反，在中央戏剧学院组建了“毛泽东主义红卫兵”，当时在中戏是受打压的少数派。1966年9月，叶向真到地质学院求援，认识了朱成昭。叶向真把电影学院、音乐学院的造反派联合起来，与朱成昭一起组建了“首都红卫兵第三司令部”。两人在不少政治观点上非常一致，战线一致，不久就坠入情网。这对朱的思想有不小的影响。\n\n文革中叶向真干下的最为轰动、影响巨大的造反行动，就是“绑架”彭真，并组织公开批斗彭、罗、陆、杨等人的万人群众大会，开了文革中对中央一级“黑邦”公开批斗示众之先河。\n\n1966年12月的一天晚上，一群来路不明的红卫兵乘坐两辆汽车来到了位于正义路的彭真住宅大门前，把一封信交给了门卫。趁门卫进屋看信之机，红卫兵们强行冲进了大门，把刚刚睡下的彭真从被窝里抢走，并巧妙地摆脱了随后追来的警卫人员。\n\n叶剑英积极支持毛发动文革，获毛信任。叶剑英参预并主持66年3月会议对罗瑞卿的揭发批判。毛泽东决定他任中央书记处书记、中央军委副主席、并接任军委秘书长。66年5月，在批彭真《二月提纲》的会议上，叶剑英拍着桌子责问彭真与罗、陆、杨为一个反革命集团。第一批政治局的当权者彭罗陆杨被打倒后，毛掌握了首都控制权、军警控制权、宣传控制权。叶剑英又支持“五、一六通知”通过，支持毛泽东“炮打司令部”与通过文革“十六条”决定。他被补选为政治局委员。北京市委倒台后，叶剑英负责北京市的治安保卫工作。\n\n据报导说，彭真被劫持的消息周恩来得知后，问中央文革，中央文革的其他人谁也不知道彭真的去向。戚本禹提出：“是不是叶向真把彭真抓走了？”……\n\n叶向真文革后回忆这件事时，对这段往事如实讲述。\n\n她说：“当时我们有一种单纯的革命热情，我们一看毛主席定了性了，就认为一定就是这样了。中央文革小组把红卫兵召去开会，说应该做这件事。学生都这样，指哪儿打哪儿，在这种号召之下，我们就做了。江青为此还把我请到钓鱼台跟她一起吃饭，说：怎么能让这些反革命在家养尊处优，要让他们见群众嘛！”\n\n“我们抓了彭、罗、陆3个人，除了杨尚昆，因为找不到他住的地方。这件事马上惊动了周恩来总理。他打电话问戚本禹是谁抢走的。戚本禹说，‘可能是叶向真，我们打听打听。’不到5分钟，他说是叶向真。”\n\n“周恩来跟什么人没有谈判过，我当时是个25岁的小姑娘，哪里是他的对手。”\n\n周恩来一见面态度和蔼，微笑的对叶向真说：“你把彭真藏在哪了？”“我来帮你们批斗彭真好不好？”“彭、陆、罗、杨应当一起批判嘛。你们知道杨尚昆在哪吗？我知道。我把杨尚昆带来，咱们一起批判好吗？”\n\n“我们当然听总理的话，就老实交代藏在中央乐团的音乐大厅。后来真的开会的时候，他们4个人都到了。”\n\n叶向真主持公开批斗彭、罗、陆、杨等人的万人群众大会，周恩来和中央文革的人一起来参加大会。那是全国首次公开揪斗中央一级的“黑帮”，轰动一时。从此开创了在社会上揪斗老干部的先例。\n\n对叶向真干的这件大事，周恩来在几年后的70年1月24日的一次接见讲话中说：“冲机要局，抢档案，戚本禹与叶向真他们是合谋，后台是杨成武。街上扫四旧，叶向真靠他父亲的关系，首先冲军事科学院，他们采取的是绑架的方法。戏剧学院的叶向真，她说是造反派。她们第二件事比较严重的，六六年底她们搞突然袭击，将彭罗陆杨和文化部的一些人，让他们游街。我们打电话问戚本禹是谁抢走的。他说可能是叶向真，我们打听打听。不到五分钟，他说是叶向真。后来把叶向真叫来，她说：人在中央乐团一间大屋子里，第二天就要游行。这样全城会轰动，对我们不利，非搞过头不可。后经卫戌区把他们接过来。这样一件事，我们不允许。反动的，这样做超过了武斗，变成了绑架。后来很多地方跟着搞起来了，部队冲派也搞这一套。”\n\n周恩来讲这些话的时候，戚本禹在毛泽东卸磨杀驴的惯技中已经进了监狱。叶剑英还在靠边站，叶向真还在监狱里。周可以推卸责任装好人。\n\n\n## 五 觉醒\n\n首都三司做的最大的事情，是把彭德怀从四川抓回了北京。经过朱成昭等一些亲历者的回忆，事件的真相已经确凿无疑。\n\n1966年11月中旬的一天晚上，在人大会堂一楼南部的一个小型会议室里。中央领导人召见首都红卫兵领袖。出席会议的中央领导人有：周恩来、陈伯达、康生、江青、张春桥、姚文元、关锋、戚本禹等多人，阵容与往常的重大接见没有什么两样。被召见的红卫兵头头只有聂元梓、朱成昭、韩爱晶、蒯大富、谭厚兰、叶向贞、聂树人七人。这次会上江青说：“你们不是很能吗？你们为什么不去抓海瑞？听说他在四川经常上街看大字报，与人谈话，很消遥自在么！应该把他抓回来，要他交代问题，接受群众批判！”在场的人都知道，这“海瑞”指的是彭德怀。也都知道，江青在这场合说这话是得到了毛泽东首肯的。\n\n朱成昭曾派了三批人去成都。第一批王大来、钱信等人在12月15日进入成都彭德怀的住处，与彭就文革以及党史上的一些问题有过长谈，结果被彭感化，认为彭讲的都是“真话、实话”。最后对彭同情到了“毛主席和党中央可能现在不了解彭现在的情况，他们有责任把彭目前的情况和他们的看法向毛主席和党中央和中央文革汇报”的地步。第二批是王大宾。他随第一批抓彭成员一起回京与朱成昭商量。因为朱成昭的安徽老家“三年自然灾害”中也饿死了成千上万的人，朱成昭对彭德怀一直持同情态度。朱成昭他们把在四川时与彭的谈话记录交给了中央文革，被训斥为“严重政治错误”。\n\n中央文革的戚本禹又给韩爱晶打电话，让韩爱晶马上派北航“红旗”战斗队的人赴川抓彭。在这种情况下，朱成昭派出第三批胡乐成等100余人去成都，这时，彭德怀已经被北航红旗的人马抓走。地院东方红依仗人多势重，把北航红旗的人打得落花流水，抢走了彭德怀。\n\n12月27日，彭德怀被以火车押解到北京，到达地院后，朱成昭怕天派的韩爱晶来抢人，安排彭德怀住在自己的房间过了一夜。不过朱成昭和他没有过外面流传的“秘密预审”、“彻夜长谈”等接触，他甚至没跟彭讲过一句话。\n\n据朱成昭自己说，他很认真地看了彭随身携带的小箱子里的绝密材料，内容是彭对八届八中全会决议的逐条反驳，以及对大跃进的保留看法。朱成昭看后心里受到很大震动，认为彭讲的是大实话，他是冤枉的。他本来对大跃进以及文革中打倒越来越多的老干部等问题，有自己的思考，这些思考在彭德怀那里得到了印证，对他转变对文革的看法无疑有极大影响。朱没有对彭进行批斗。\n\n朱成昭对文革看法的变化，进而又影响到了叶向真。1966年底到1967年初，朱成昭召集三司骨干头目连续开会，谈出他对文化大革命的看法：“导演是骗子，演员是疯子，观众是傻子。”准备公开炮打中央文革。王大宾在会上持反对意见。\n\n会议内容马上被中央文革获知，陈伯达写批示给朱成昭，警告他：“不要掉到茅厕里去，成为茅厕里的石头”。朱与叶都怀疑是王大宾告的密。中央文革让朱成昭做检查。朱成昭决定以“检查”为名公开自己的政治观点。\n\n2月4日，朱成昭在地院作公开检查，因为这是“首都三司”和“地院东方红”一把手的检查，共有3万人参加。朱成昭在会上谈了他的“八大观点”：\n\n一、大串联搞乱了全国；二、整风军训实无必要；三、中央文革运动群众；四、中央文革抓人太多；五、中央文革对老干部打击面太大；六、中央文革太左；七、在军委和中央文革之间，站在军委一边；八、大联合大夺权早了。\n\n由于朱成昭借“检查”为名系统“放毒”，影响了很多对文革有怀疑的群众。2月8日，中央文革派阎长贵到地院宣布这是“炮打中央文革，反对中央文革”。朱成昭被勒令“闭门思过”。从此，朱成昭的“地院东方红”一把手之位被王大宾取代，“首都三司”一把手之位为蒯大富所取代，副手是王大宾。\n\n## 六 “叛逃“\n\n66年底67年初，当时一些“联动”的高干子弟红卫兵，因为自己的老子也被打倒而炮打中央文革，北京高校还出现炮打康生与炮打戚本禹的大字报与传单；上海出现炮打张春桥的大字报与传单。毛泽东在内部小范围对江青与中央文革的一些言行与做法提出了批评。据说是李富春将毛泽东的这些批评意见，泄露给了老帅与副总理。叶剑英对文革中红卫兵的打砸抢行为本来不满，更不希望军队被搞乱。这时候，他开始当面指责文革小组。结果，被扣上了“二月逆流”反对文革的帽子。叶剑英被解除了在党中央和军队中的实际领导职务。\n\n1967年4月，叶向真被“造反派”专政。朱成昭、叶向真都被中央文革打击并排除文革运动之外，他们有了充分的时间在一起享受爱情。1967年7月，他们离开北京，第一站到了广州。出走的消息很快被中央文革得知。戚本禹宣布他们“偷了地质部国家机密，企图偷越国境。”\n\n广东是叶剑英的老家，也是他的大本营，那里亲朋好友众多。叶向真与朱成昭去广东可以解释成去那里玩。为什么戚本禹认定他们是要叛国呢？因为从广东逃向香港已经出现过两次大的高潮，在极度贫困和政治高压下，很多人选择冒死逃港以求生。当时，从广东偷渡到香港的至少有十几万人。尤其是年初“马思聪逃港”轰动了世界。\n\n1967年1月，著名音乐家马思聪夫妇与一儿一女成功逃到香港，后由美国驻香港领事陪同飞抵美国。他抵港第二天，全港报纸和电台都报导了这一消息，从而掀起了又一轮以知识份子和知青为主体、长达10年的逃港潮。逃亡群众来自广东、湖南、福建、黑龙江等12省、62个市县的各个阶层。如果朱成昭与叶向真叛逃成功，那将比马思聪还要轰动。一则朱成昭是全国最大且威望最高的红卫兵组织的“司令”，全国各地都认为首都三司代表中央。二则叶向真不仅是首都三司的红卫兵领袖，也是军队帅爷的“公主”。尽管他们已被排挤在外，但大范围的人并不知情。他们的叛逃无法向世人交代。\n\n叛逃惊动了中央。周恩来亲自派公安部副部长于桑赶到广州，将朱成昭和叶向真抓回了北京。受株连者多人。朱叶二人与许多三司领袖被隔离审查。“地院东方红”第四把手杨雨中在审查时被逼跳楼自杀。朱成昭没有害怕，他在8月15日所写的《我的检查与交代》中，提出担心全国武斗以及两派分裂将会在文革后造成经济和人心两方面的“极大后遗症”。这不能不说是一个真知灼见。1967年8月20日，朱成昭和叶向真被公安部谢富治宣布“组织反革命集团”，正式逮捕，关进了监狱。\n\n朱成昭被关押了8年以后，1975年被送到湖北某劳改农场作为反革命分子劳动改造。在长达10多年的牢狱和劳改岁月中，他一直把叶向真当作自己心中至死不渝的恋人，还写了许多动人的情诗。其中一首诗：“何处觅向真，北京监牢中。坐牢不要紧，真理有认同。咫尺天涯远，相见在梦中。醒来望明月，牵手越秀丛。”\n\n## 七 归宿\n\n朱成昭不知道的是，1971年林彪事件后，军队重新洗牌。能被重新启用的老帅非叶剑英莫属，因为叶不是林彪一党。叶剑英重新主管军委工作后，周恩来不失时机地向毛提及叶向真还在监狱里，毛泽东让释放了叶向真。党国在用人之际，将大帅的爱女放回，以示恩德与信赖，冰释前嫌，叶家上下哪能不对主席和总理感恩戴德？文革中所遭遇的不幸自然都挂在“四人帮”头上最合适了。一会让你成煤球被撮，一会提起来委以重任，吃过苦头的孩子更听话，这是毛与周最熟知与擅长的用人之术。\n\n叶向真释放后便向朱成昭的朋友们表示，周恩来要她不要再和他们来往。叶也就从此断绝了与朱的来往，并冀望在她的一切历史呈现中抹掉这一文革之恋的存在。\n\n朱成昭的朋友说周恩来没有要求叶向真怎么做。不管周是否要求过，最终的主意还是看自己。我们不必过多去苛求一个女孩子。经历了父女都被打倒的命运，自己从小公主落到“小粪蛋”的地步，绝望中一切又失而复得，她自然会更多些成熟与谨慎。面对昔日的战友今日的被弃者和反革命，她还能不知好歹跟他们来往吗？\n\n朱成昭于1980年6月才被正式平反。据说当时中组部要将他与张志新一样树为反文革典型，但最后被叶剑英一笔勾去。一直到85年，朱成昭才被分配工作，到了江苏省第四地质水文大队。90年初到上海下海经商，一度事业上也是轰轰烈烈，但最后被三角债拖垮，退出商界，研究文革。1998年因心肌梗塞在北京猝然逝世，年仅57岁。他曾与访谈他的记者相约来年在北京再畅谈一次红卫兵运动，却成未竟心愿。\n\n有专家认为，朱成昭与张志新不同，如果朱成昭被树为反文革典型，将有力地从思想上反思文革、批判文革，那么可能文革的根源就会被挖出来，对中国的今天影响无可估量。可惜，历史并不如人愿。\n\n1941年出生的叶向真，其实在1962年就与“钢琴神童”刘诗昆结婚，64年育有儿子毛毛。1967年4月，刘诗昆与叶向真正式离婚。这之前，他一直住在叶帅府。\n\n刘诗昆说当时自己已被定性为“反革命”，为避免牵连妻子和岳父主动提出离婚。同年年底，刘被投入北京秦城监狱，一关就是五年九个月，与外界音信隔绝，直到叶向真去看他，把带出的信交给毛泽东，他不久被释放，但他们没有复婚。\n\n叶向真从监狱里出来后，变得呆傻了，不会说话，听到收音机或者别人的说话声就紧张。一年后，叶向真才逐渐恢复正常。她改了名字叫江峰，到首都医学院学医，后来在专为中央首长看病的301医院（中国人民解放军总医院）做了7年外科医生。没几个人知道这个江医生就是当年的红卫兵领袖叶向真。\n\n文革结束后，她重回文艺圈，80年代她更名“凌子”，把曹禺的名著《原野》拍摄电影。在威尼斯电影节，该片获得了“世界最优秀影片推荐”的荣誉。凌子一举成名。但是《原野》当时没被允许在国内放映，因为某领导认为那是“男盗女娼”。后来她还拍过几部电影，虽获好评，但是也受到某些限制。这对她后来放弃电影事业有一定影响。\n\n在《原野》的拍摄过程中，凌子还收获了爱情，与摄影师罗丹恋爱并结婚。1987年凌子和丈夫罗丹一起到香港定居，改名字叫“凌孜”，并开始经商。多年的惨淡经营之后，他们在香港有了自己的公司，经营各种项目，慢慢地站稳了脚跟。\n\n1987年当年三司领袖纷纷释放，韩爱晶、蒯大富、王大宾都下海经商，他们凭着当年在三司关系，个个生意兴隆。但当年三司的战友没有几个照顾叶向真的，大概因为她现在的丈夫是罗丹而不是朱成昭吧。\n\n有人说，当年红色公主叶向真逃港没成功，最后还是去了香港。她用行动回答了社会制度的好坏，投了资本主义民主社会一票。\n\n叶向真在香港不谈政治，吃斋念佛，成了虔诚的佛教徒。进入新世纪以后，叶向真对儒教产生极大兴趣，致力研究孔孟之道，致力于宣传和普及中国传统文化。",
			"added": 1536429287,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 4,
			"title": "揭秘：“文化大革命”时期的江泽民",
			"body": "2011年09月03日 09:58\n来源：凤凰网历史 作者：[美]罗伯特·劳伦斯·库恩\t\n字号:T|T\n4246人参与32条评论打印转发\n\n核心提示：江默默地承受批判。与他的同学和同事相比，他知道自己是幸运的。他没有被清洗、流放或监禁。他有两个救命的优势：他生在一个“红色”的家庭；他专注于科学研究。用“文革”的语言来说，他是属于“靠边站”，而不是被“打倒”。\n\n本文摘自：《江泽民传》，作者：[美]罗伯特·劳伦斯·库恩，出版：上海译文出版社\n\n江泽民设法在“反右”运动和“大跃进”中幸免，相对而言安然无恙。到了1962年，他所有的考虑都集中于未来。促成他的调动的又是汪道涵。两人多年来一直保持着密切的联系。江每次因公出差去北京，都会拜访汪夫妇。汪当时是第一机械工业部的副部长。随着经济开始复苏，他想让江泽民离中枢更近一些。汪把36岁的江从长春调到上海，让他担任上海电器科学研究所第一副所长，这是一个需要他的管理与技术技能的职位。\n\n“在那里工作的有700多人。”曾培炎回忆说。曾在同一年进入该研究所，几十年后，他成为江主席最重要的部长之一。“年轻人和技术人员都喜欢同江交流。他是个组织者，又是个专家。他经常到我们实验室来，了解我们的研究工作进展如何。”\n\n汪还安排江的妻子王冶坪在同一研究所担任总务秘书。此后的20年里，她的职务不断提升，直到担任研究室主任。在工作中，她非常热情并且很低调，下班后就赶紧回家照顾家庭。\n\n在当时遭受“大跃进”破坏的中国，上海算是一个相对繁荣的“孤岛”。尽管如此，生活还是很艰辛。虽然江被提拔了，他拿的工资还是很低。他和妻子每天自己带午饭，送孩子上学，坐公共汽车上班。他们要一周数次设法排上最短的队购买生活必需品。不过，江的新工作有一个好处，就是在新职工宿舍分到了一套现代化的两居室公寓房。在上海拥有自己的房子曾是他们家庭的梦想，他们将在这套公寓中住上20多年。\n\n人们充满乐观，看来，那些破坏性的政治运动似乎终于退潮了。以刘少奇和邓小平为领导的党的务实派在与激进的“左派”分子的斗争中越来越有魄力。刘在1959年接替了毛担任国家主席。（在中国，“左”和“右”的政治标签，就其在“保守派”或“自由派”方面的意义而言，跟在美国的情形正相反。“左派”是保守派，他们力图维护纯粹的社会主义制度和毛泽东推行的政治控制。右派是自由派，他们力图改变现行体制，以使其更符合西方的自由市场经济和开放的民主政府。终其一生，邓小平既与极左也与极右作斗争。继承他的事业的江泽民也将如此。）\n\n1962年2月，刘少奇在七千人大会上指出，国家的灾难局面只有三分属于天灾，另外的七分属人祸。包括毛和刘在内的很多高级领导人作了自我批评。邓将问题归咎于经验不足，他说所有人都有责任。毛继续被尊崇为新中国的缔造者。他在那次会议上表现出反常的顺从，但这些批评很可能已经激怒了他。4年以后，毛发动了对刘和邓的斗争，但当打倒这两人的时候，也几乎毁掉了整个国家。",
			"added": 1536430699,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 5,
			"title": "陈小鲁：在文化大革命中我是十恶不赦的坏人",
			"body": "2016年07月30日 15:45\n来源：凤凰卫视\n核心提要：1966年轰轰烈烈的文化大革命爆发，那是一个你完全不了解的时代，那是一个你充满好奇的时代，那是一个你想逃避和忘却的时代。陈小鲁,陈毅元帅之子，在最年轻最萌动的岁月，与那段历史相遇，成为他一生难以忘却的回忆。2013年陈小鲁为文革时的行为公开道歉，引起社会的强烈关注，出身名门已是花甲之年，陈小鲁为何选择在此时站出来，为半世纪前的行为道歉。\n\n凤凰卫视7月29日《鲁豫有约》，以下为文字实录：",
			"added": 1536432145,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 6,
			"title": "邓小平一生最痛苦的是什么：文化大革命",
			"body": "本文摘自《回首1978历史在这里转折》 ，童青林 编著，人民出版社出版\n\n日本首相中曾根康弘曾经问过邓小平：“最痛苦的是什么？”邓小平回答说，他一生当中最痛苦的是“文化大革命”的时候。邓小平一生“三起三落”，在“文化大革命”的十年里，就有两次被打倒。一次被下放到江西，一次被禁锢起来，冒着被暗害的危险。而他的复出又是同“天安门事件”联系在一起，这成了当时两个敏感的话题。\n\n　　邓小平第三次被打倒，是因为毛泽东不愿意看到他系统地纠正“文化大革命”的错误。1973年周恩来病重，邓小平从江西“牛棚”里回到北京，开始代替周恩来分管国务院的工作。他在主持中央和国务院日常工作期间，于1975年开始对各方面进行整顿。这种整顿实际上是系统地纠正“文化大革命”以来各种“左”的错误做法。用邓小平后来的话说，“这些整顿实际上是同‘文化大革命’唱反调”。这是毛泽东所不能允许的。在此期间，毛远新经常在毛泽东跟前搬弄是非。他在1975年9月曾告诉毛泽东，现在社会上有股风，就是对“文化大革命”怎么看，是肯定还是否定，成绩是七个指头还是错误是七个指头，有分歧。他还对毛泽东说，邓小平很少讲“文化大革命”的成绩。\n\n　　恰好在这个时候，清华大学党委副书记刘冰、惠宪钧等几个人通过邓小平向毛泽东转交了两封信，这使毛泽东感到不悦。他由此认为，刘冰等人写信的动机不纯，他们的意见代表了对“文化大革命”的不满。他把这件事同毛远新汇报的情况联系起来，断定有人要“算‘文化大革命’的账”。他希望邓小平主持召开中央政治局会议，通过一个肯定“文化大革命”的决议。他让邓小平主持通过这个决议，一是让邓小平这些对“文化大革命”有看法的人作这个决议，就可以堵住那些对“文化大革命”有异议的人的嘴，使他们不再唱反调；二是毛泽东想给邓小平一次机会，让他改变观点。但是，邓小平没有接受毛泽东的建议。他还说，由我主持写这个决议不适宜，我是桃花源中人，“不知有汉，何论魏晋。”随之而来的是，邓小平的大部分工作被停止了。1976年2月，华国锋代理国务院总理职务，并主持中央日常工作。这时，全国开展了“反击右倾翻案风”的运动。华国锋分批向党内高级干部传达了毛泽东的“重要指示”。在这个指示中，毛泽东点名批评了邓小平。他说，邓小平这个人是“不抓阶级斗争的，历来不提这个纲。”他甚至认为邓小平“代表资产阶级”。尽管如此，毛泽东对邓小平的批评还是留了一定的余地，说：“批是要批的，但不应一棍子打死。”\n\n　　华国锋在传达毛泽东“重要指示”时发表了一个讲话，这个讲话经毛泽东审阅过。华国锋还强调说：要在学习毛泽东“重要指示”的基础上，“深入揭发批判邓小平同志的修正主义路线错误”。他希望高级干部在这个问题上要“转过弯来”。随后，毛泽东的“重要指示”和华国锋的讲话向全党作了传达。\n\n　　毛泽东虽然对邓小平作出了不正确的处理。但是，他对邓小平“保留党籍”的意见，也反映了毛泽东对邓小平的处理仍留有余地、甚至寄予某种希望的心态。\n　　在“文化大革命”的十年中，邓小平两次被打倒，但毛泽东两次都把邓小平的问题当做内部矛盾，对邓小平的处理都留有余地。其中的原因，很重要的一点，就是毛泽东看中了邓小平的才华。而且邓小平的性格又很像毛泽东，就是在原则问题上不肯让步。所以，毛泽东很欣赏邓小平。他不只一次地在公开场合下评论过邓小平。在中共八大召开前夕，为了推选邓小平当中央书记处总书记，毛泽东在七届七中全会上当着70多名中央委员的面评价邓小平：“我看邓小平这个人比较公道，他跟我一样，不是没有缺点，但是比较公道。他比较有才干，比较能办事。你说他样样事情都办得好呀？不是，他跟我一样，有许多事情办错了，也有的话说错了；但比较起来，他会办事。他比较周到，比较公道，是个厚道人，使人不那么怕。我今天给他宣传几句。他说他不行，我看行。”\n\n在邓小平第二次复出的时候，毛泽东在中央政治局会议上又一次评价邓小平：“他呢，有人怕他，但他办事比较果断。他一生大概是三七开。”\n\n　　还有一点，就是邓小平在20世纪30年代曾作为“毛派”的头子第一次被打倒。后来，毛泽东在谈起这件事时还说，邓小平没有历史问题，即没有投降过敌人。他协助刘伯承同志打仗是得力的，有战功。他率领代表团到莫斯科谈判，没有屈服于苏修。\n\n　　从毛泽东对邓小平的多次评价中可以看出，毛泽东很赏识邓小平的才干和他的品格。毛泽东也预感到，他去世后，中国政坛上会有一场较量，这场斗争很可能是在华国锋同江青这几个人之间展开，“搞不好就得‘血雨腥风’。”他当然不愿看到这种局面的发生。华国锋的资力毕竟太浅，能否驾驭局势，这正是毛泽东所担心的问题。他临终前，两次见叶剑英，似乎想表达什么。叶剑英也在猜测，毛泽东是不是“还有什么嘱咐？”可能出于同样的考虑，毛泽东“以一种特殊方式”把邓小平保留下来了。\n\n　　邓小平的女儿邓榕在《我的父亲邓小平(“文革”岁月)》一书中这样写道：“毛泽东作出了打倒邓小平的决定。在决定打倒邓小平的同时，他再一次把邓小平保护了起来，免遭‘四人帮’的毒手，并决定再一次保留邓小平的党籍。也许，毛泽东自知，他的‘大限’已经不远，他是在最后的时刻，用一种特殊的方式刻意地保留下了邓小平。以毛泽东八十多年的人生阅历和半个多世纪的政治经验，他完全知道，他身后的中国，非但不会是一个‘太平盛世’，还必有大的政治恶斗。他也应该料到，那场斗争，将在华国锋等人和‘四人帮’之间进行。这些斗争将有如何结局，实在是世事难料……”但是，仅凭着这个也许，毛泽东作出了保留邓小平党籍的决定。在未来不可预知的岁月中，邓小平，以他极其独特的品格和极强的政治生命力，绝不会就此沉沦，也许，在某个时刻，在某种特定的条件下，历史还会赋予他以机会，重燃他那不会熄灭的政治生命之火……毛泽东保留邓小平党籍的这一决定，对于邓小平今后再次复出所起的作用，虽然不是决定性的，却是不可忽视的。”\n\n　　对邓小平来说，毛泽东保留了他的党籍，可能有些出乎他的预料。“天安门事件”发生后，邓小平已经做了最坏的打算。没想到，在最后的关头，毛泽东竟然保留了他的党籍。还指定专人和部队保护邓小平的安全，并明确交代“别人不准插手干预”，也就是不准“四人帮”干预这件事。4月8日，邓小平提笔给汪东兴写了一封信，对中央的决议表示拥护，对继续保留他的党籍表示感谢。\n\n　　在江青一伙被隔离审查的第二天，还处在“禁锢”状态的邓小平终于得知了他盼望已久的消息。传递这个消息的人是邓小平的女婿贺平。因担心家里安装了窃听器，全家人就聚集到厕所里，听贺平讲完了粉碎“四人帮”的经过。终于度过“一生最痛苦”时期的邓小平，不禁感叹道：“看来，我可以安度晚年了！”",
			"added": 1536433107,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 7,
			"title": "曾希圣是如何掩盖严重灾荒的!",
			"body": "尹曙生\n　　1960年2月19日至25日，中共中央总书记邓小平，全国人大常委会副委员长彭真，中共中央书记处候补书记、中央办公厅主任杨尚昆，中共中央书记处候补书记刘澜涛到安徽视察。省委几位领导建议省委第一书记曾希圣以省委的名义招待中央领导。曾希圣说，用公款招待不妥，周总理来安徽也没有宴请嘛（周总理于1958年2月5日至6日视察安徽）！曾希圣经不住几位领导反复劝说，只好同意。但是附带一个条件：省委七位领导自讨腰包，每人5元钱，共35元，要求食堂用这35元钱做一顿可口的饭菜来招待领导，不能动用公家一分钱。\n　　宴请开始时，曾希圣指着一桌廉价而丰盛的饭菜对邓小平等中央领导说，这是我们省委7位领导出钱宴请你们，没有用公款，你们放心吃好了。邓小平高兴地说：老曾啊！你这个办法好嘞。请了我们的客，又不花公家一分钱，就像当年在延安一样，要得啰！\n　　这则佳话，笔者虽然没有亲身经历过，但是在上个世纪80年代曾询问过当时出钱参与宴请的省委某领导，当时负责保卫、接待的省委秘书长、接待处长，省公安厅厅长、警卫处长，都是这么说的。史实确凿无误。近二十几年来这则佳话被国内报刊转载过多次。这些报刊转载的目的，是用它来对比今日用公款吃喝招待的不正之风，为党风廉政建设鼓与呼，用心良苦，值得称赞。不过也有人以此为例，借机来赞扬曾希圣是个廉洁奉公，两袖清风，一尘不染，全心全意为人民服务的楷模；为他在1962年初的七千人大会上被解除省委第一书记职务鸣不平，就有些错谬了。\n　　邓小平一行离开安徽之后，中央领导接踵而至：1960年5月9日至19日，中华人民共和国副主席、中央监察委员会第二书记董必武视察安徽；6月24日至28日，全国人大常委会委员长朱德视察安徽；10月28日至11月2日，中央政治局常委、国务院副总理陈云视察安徽。\n　　在这些中央领导同志密集到安徽视察的时候，也正是安徽人民处在极度艰难的时候，每天都有人被饿死、整死；大量饥民拖儿带女外出逃荒，流落城镇街头、交通沿线，死于中途者不在少数，整个农村呈现出的是“千村薜荔人遗矢，万户萧疏鬼唱歌”的情景。据1961年、1962年省公安厅两次反复统计，1960年安徽非正常死亡人员是210多万（详见《读曾希圣给中央的检查》，载《炎黄春秋》2013年第1期）。甚至出现大量人食人的现象（见《安徽特殊案件的原始记录》，载《炎黄春秋》2009年第9期）。由于以曾希圣为首的安徽省委的严密封锁，这些到安徽视察的中央领导都没有发现安徽问题的严重性，不能采取有效措施帮助安徽省委拯救饥民，使安徽饿死人的情况一直延续到1961年下半年。而曾希圣不仅没有丢官，反而于这一年的10月兼任了因饿死人多而被解职的山东省委第一书记舒同的职务。一人担任两省省委书记，在我党历史上没有先例。知道了这样的背景，还能对曾希圣宴请佳话高兴得起来吗？\n\n\n　　一、使中央无法了解真实情况\n　　下面让我们从公安厅档案保存的警卫工作总结报告摘要中，来看看中共安徽省委是如何不让中央领导接触群众、了解真实情况，使他们两眼一抹黑的。这些警卫报告说：“对× × 的警卫，是在省委统一领导下进行的，成立了专门办公室，下设接待、保卫等组，由省公安厅厅长、省人民检察院院长、省人民法院院长和省委统战部部长分别担任组长。省公安厅抽调相应人员，分赴沿线路段，调查情况，采取安全措施，通过基层组织，监控坏分子，沿途每5至6公里有一名县委委员，每1至2公里，有一名区、乡党委委员负责，市、县公安局则分段包干，各负其责，进行保卫工作。对住地、参观点首长可能接触到的人员事先进行政治审查，保证绝对可靠。食品、卫生等均作周密部署，确保视察期间的安全。”“对已经决定前往视察的地、市、县，事先通知，交底，提出具体要求，做到心中有数。对参观单位和晚会演出人员中有问题的人要妥善处理；对危险分子，要调整班次，或以下去劳动的办法，暂时调离；对一般复杂分子，由党、团员，积极分子夹起来的办法加以控制。”“对中央首长要参观的合肥、淮南、蚌埠、马鞍山等16个较固定的单位，从中挑选1500名积极分子，来欢迎、接待中央领导；这些单位其他职工一律不准出现在领导视察的现场。”“对首长乘车参观途径的地方，一切有碍观瞻的都要在首长到达前清除完毕”。这样严密的控制措施，中央领导怎么能了解到真实情况呢？\n　　这里特别值得一提的是董必武副主席对安徽的视察。1957年，中央为了党的建设需要，成立了高规格的中共中央监察委员会，由德高望重的朱德委员长和国家副主席董必武分别担任第一、第二书记，老革命家王从吾担任常务副书记，最高人民法院副院长、法学家王维纲担任监委委员。董老这次到安徽视察，时间长（共10天），地域广，除合肥外，重点视察安徽饿死人最多的蚌埠、阜阳一些县的公社、河网化工地。因为他从中央监委那里接到不少安徽饿死人情况的人民来信，他要亲自来看看。安徽省委竭力不让他看到真实情况。省委书记处书记、省监委书记曾庆梅亲自挂帅陪同，负责警卫接待工作，省公安厅厅长邢浩具体执行。为了对董老全面封锁，不让他看到真实情况，沿途不准有浮肿病人和披麻戴孝的人出现。不准有新的坟头出现，如有，可以绕开，绕不开非经过不可的，或平掉坟头，平不掉的，用野草或树枝盖上。为了让董老相信安徽人民生活得好，在合肥参观江淮人民公社食堂时，有意将事先焖好的米饭放在簸箕里晾晒，给董老解释说这是社员吃剩下的米饭，为预防变馊而晾晒。实际情况是从1959年下半年开始，公共食堂就没有供应过米饭，而是杂粮、大锅清汤。董老在参观蜀山人民公社一个食堂时，看见食堂案板上放着米粉肉，炊事员说这是明天给社员吃的。事实是公社临时从肉联厂买来几斤鲜肉，拌上米粉放在案板上让董老看的。董老走后，米粉肉被公社、大队、生产队干部们分了。而董老接触的那些所谓公社社员，都是从大队、生产队干部和基干民兵中临时抽调来的。\n　　尽管安徽省委采取各种措施封锁消息，不让中央知道安徽真实情况。但是百密一疏，还是有一些人民来信不断送到中央领导人手中。就在邓小平一行人来安徽视察前后，周恩来总理收到一封人民来信，反映安徽和县、无为县群众被饿死。周恩来总理将人民来信转给曾希圣，并附上自己的亲笔信：\n　　希圣同志：\n　　转上一信，请阅后派人前往两县一查，也许确有此事，也许夸大其辞，但这类个别现象各省都有，尤其是去年遭灾省份更值得注意。主席在批转山东省六级干部会议的文件上，也曾着重指出这一点。请查后复我一信。\n　　周恩来　一九六○年三月二十九日\n　　无为县在1959年因为饿死人，省委书记处书记张凯帆去调查处理，果断解散食堂，调拨救济粮，制止五风（共产风、浮夸风、瞎指挥风、强迫命令风、干部特殊化风）再刮。为此被曾希圣告上一状，受到毛泽东在庐山会议上的点名批判，为此张凯帆被打成反党集团成员，被牵连的有几十万人，一时间，安徽批判右倾机会主义的浪潮一浪高过一浪，把左倾冒险主义推向极致。1962年2月9日，曾希圣在七千人大会上第二次检讨时说，“1959年6月（张凯帆到无为纠正五风的日子），安徽农村非正常死亡已经发生。如果无为县盖子早揭开，从中吸取教训，安徽的问题就不会那样严重。”\n\n　　二、调查与反调查、封锁与反封锁的斗争\n\n　　到安徽视察的中央领导没有发现安徽问题，但是中央监委不断收到人民来信，反映安徽饿死人的问题很严重，于是决定派人调查。一场调查与反调查、封锁与反封锁的斗争在中监委与安徽省委之间开展起来了。1960年4月，中监委第一次派出审查处处长刘力生和信访科长张珉到安徽省潜山县了解群众生产、生活情况；8月派出张珉、曹思恒到饿死人比较多的宿县、萧县、全椒了解群众生产、生活情况；11月派李海到阜阳地区临泉县了解人口外流情况。由于在省委的统一部署下，各地、市、县委严密封锁，他们只能了解到局部不完全的情况，和人民群众在来信中反映的情况差距很大，中监委感到必须派出强有力的调查组到安徽调查，才能彻底弄清真相。尤其是一封署名“石求明”的人民来信引起中监委的高度重视。这封信这样写道：\n　　中央并主席：我打消了个人得失的念头，确立以党和人民的得失为重，才决心反映凤阳县去冬今春人口大量死亡的情况，据我所知的三个公社的四个庄子的人口死亡情况是相当惊人的。一个死亡占5%，一个占11%强，一个占15%，一个占20%多……在死人最严重的时候，有的村子一天死5至6人，有的村子几乎无人了，跑的跑，死的死。我亲眼看到，在我们临淮关上的招收（收容）起来的被人丢弃的儿童约三四百人，死有一百左右……\n　　石求明1960年端阳于临淮\n　　1960年端阳节是阳历5月29日。石求明真名叫张少柏，当时为凤阳县委办公室主任，是一位对人民群众怀有深厚感情、忠诚的共产党员。当时在安徽写这样的人民来信，被发现都作为反革命信件查处，写信者是要冒坐班房风险的。他为了不被查出，在书写时，不按笔画顺序，而从下往上倒着写，一共写了两封，一封派一个小公务员拿到蚌埠发出，给他几斤粮票、几块钱作为报酬。一封自己投入临淮关邮局。从蚌埠发的那封信，被公安局扣留，从临淮关邮局发的信顺利发出。省委得悉蚌埠扣留的信的内容后，曾庆梅指示公安厅派人到蚌埠领导破案。公安厅指派三处处长带领2名笔迹鉴定专家赴蚌埠，省、地（那时蚌埠市、宿县、滁县归蚌埠专区）、县三级公安机关抽调30多名干警破案。由于书写者隐蔽得好，而没有被发现。专案组也多次怀疑是张少柏作案，但关键是笔迹鉴定不符，为此，由省公安厅技侦人员对张少柏住处、办公室进行了秘密搜查，没有发现其它线索，只好作罢。\n　　张少柏的这封人民来信促使中监委派出庞大的调查组到安徽调查饿死人情况，领队的是中监委委员、最高人民法院副院长王维纲，还有中央组织部、中央政策研究室、共青团中央、农业部派出的得力干部共20多人，于11月23日到达合肥，先听省委汇报，然后参加地、市、县委书记会议，会议结束后，分几个组，分别到蚌埠、阜阳、芜湖、安庆调查。安徽省委书记处书记、省监委书记曾庆梅、蚌埠地委书记单敬之参加。王维纲在张少柏的陪同下重点检查凤阳县。张少柏向王维纲私下坦陈署名“石求明”的信是他写的，并积极配合王老了解到凤阳县骇人听闻的大量饿死人的真实案例。而曾庆梅、单敬之却处处封锁，设障碍，警告干部不得“胡说八道”。眼看盖子捂不住了，采取恶人先告状的办法，企图阻止中央调查组的深入调查。曾庆梅向中央写告状信，标题是：《王维纲到凤阳县调查非正常死亡》，送给主持安徽省委工作的常务书记桂林栖（曾希圣到山东兼任省委第一书记）审阅，桂林栖将告状信的内容报告了曾希圣，得到同意后，把标题改为《王维纲到凤阳县调查非正常死亡，居心何在？》，报中央书记处和中监委。由于安徽省委强力反弹，中监委召回调查组，听取汇报。\n　　1960年12月23日王维纲一行回到北京。12月26日，由中监委副书记、中纪委副书记书王从吾，中央监察部、内务部部长钱瑛主持召开汇报会，由王维纲等人汇报到安徽调查的情况，曾庆梅、单敬之参加，张少柏特邀参加。原来打算让张少柏和曾庆梅、单敬之当面对质，后来取消了。在张少柏抵达北京和离开北京时，王维纲亲自到火车站接送，反映了老一辈革命家对为民请命干部的重视与关怀。直到这时，曾庆梅、单敬之仍然认为，调查组反映的情况有片面性，有些情况不实。为此王从吾找曾庆梅、单敬之谈话指出，根据调查组提供的大量数据，说明安徽非正常死亡情况是严重的，而你们却不向中央报告，回去后你们一定要揭盖子，不要捂盖子；向中央封锁消息是错误的，单敬之要写出书面检查报中监委；对张少柏应给予表扬，保证对他不打击报复；安徽省委不向中央反映真实情况，是违背党章规定的。在这种情况下，曾庆梅不得不表示同意检查组意见，回去认真揭盖子；表示过去扣压人民来信是不对的，一定改正；向中央告反状是错误的。\n　　当时曾希圣还兼任山东省委第一书记，是中央信得过的干部，所以，曾庆梅的表态也是勉强的、被迫的。但是在1961年1月中旬，曾希圣兼任山东省委第一书记职务被免。这个信号说明中监委的调查起了作用，引起了安徽官场的震动。1961年2月18日至3月4日，中共安徽省委召开地、市、县委书记会议，华东局第一书记柯庆施到会讲话，以示对安徽问题的重视，轻描淡写地批评了安徽省委的错误。省委检讨了过去三年的错误，根据当时的现实，提出“吃饭第一”的口号。但是仍然不承认饿死几百万人，仍在捂盖子，对中监委的批评仍然耿耿于怀。于是1961年四、五月份中监委又派出农村处处长李坚和张珉再次到安徽进一步调查饿死人情况。这一次他们不按省监委的安排，而是自行下去调查，到第一线，共调查蚌埠专区15个县，阜阳专区8个县，以及肥东、肥西、宣城等，共28个县大量饿死人情况。由于中监委对安徽省委的批评被广泛流传，一些地、市监委也开始积极配合，向李坚、张珉如实反映了不少情况，如蚌埠监委书记邓衍汇报该地区15个县饿死100万人的材料（包括1959年）。省监委副书记、老红军翁可业向李坚提供了省监委掌握的大量有价值材料。有了确凿的事实和材料，李坚、张珉到合肥，要省监委如实向中央反映情况。省委领导对省监委施加压力，不让他们如实向李坚、张珉汇报。李坚把他们调查的饿死人情况材料送给曾希圣一份，曾希圣看后拍桌子，骂他们“在安徽搞特务活动”。调查结束后，李坚向王从吾提交了调查报告，确认安徽饿死了300多万人（调查统计饿死350万人，为留有余地，报300万人）。王从吾将这个调查报告以李坚个人名义报中央书记处。中央书记处通报曾希圣，曾希圣说他不知道，是下面的人向他封锁消息。这完全是诡辩。省监委副书记翁可业曾经把他调查蚌埠专区15个县饿死人的严重情况报告给他，他无动于衷，怎么能说是下面封锁呢。\n　　1961年2月，公安部发出通知，要求各省市公安厅、局于6月底前，上报1960年人口统计数字。安徽省公安厅要求各地、市公安处、局于4月底前上报公安厅，以便汇总报公安部。公安厅于4月中旬汇总后发现，安徽1960年人口比1959年净减少3839779人，其中非正常死亡2218280人。公安厅长邢浩将情况报告曾希圣，并说准备上报公安部。曾希圣马上表态说：1960年人口比1959年减少这么多是不可能的，要求公安厅重新统计后再报。为此，省公安厅把地、市、县公安局负责人口统计的干部召集到合肥，核实上报数据。结果没有变化。公安厅长再次请示曾希圣。曾希圣不同意，要求等省委扩大会议后再报，在省委扩大会议上，各地报的数字和公安厅一致，曾希圣仍然不相信。无奈公安厅长邢浩只好带着公安厅户籍统计人员吃住到省委，修改人口统计数字，把1960年非正常死亡人数由210多万缩减到117万人。曾希圣被免职后，李葆华接任安徽省委第一书记，要求公安厅纠正弄虚作假之风，首先从人口统计开始，于是，省公安厅专门召开户口工作会议，对大跃进期间安徽人口进行一次大清理，结果证实1960年安徽非正常死亡人口为210多万。一直到1962年的七千人大会上，曾希圣仍然在捂盖子，被毛泽东不点名批评，后在刘少奇坐镇下，被迫作了两次检查，安徽的盖子才揭开。\n\n　　三、不能把账都算在曾希圣一人头上\n　　当然，曾希圣有问题，但也不能把账都算在他一个人头上。假如没有总路线、大跃进、人民公社化运动，没有中央急于向共产主义过渡的左倾路线错误，安徽就不会饿死几百万人。在大跃进运动中，中央主要领导毛、刘、周、朱、陈、林、邓，除林彪外，都到安徽给曾希圣撑过腰、打过气。毛泽东、朱德先后来了两次。尤其是毛泽东1958年9月16日至20日视察安徽，在国防委员会副主任张治中将军和国务院副总理谭震林陪同下，乘敞篷汽车沿合肥长江路接受几十万军民夹道欢迎，这是毛泽东外出视察没有出现过的壮观场面，是对曾希圣积极推行大跃进的奖赏。毛的心情特别高兴，因为他看到了安徽大跃进的磅礴气势。在从安庆乘汽车到合肥途中，毛泽东视察了舒城县舒茶人民公社。公社书记汇报说，舒茶公社今年的农业和茶叶生产都有很大发展。今年的粮食总产量可达到7200万斤，平均亩产1600斤，比去年增加138%，每人平均有粮1900斤，比去年增加136%。公共食堂已经实现了吃饭不要钱。毛泽东马上接着说：“吃饭不要钱。既然一个公社可以办到，其他有条件的社也可能办到；既然吃饭可以不要钱，将来穿衣服也可以不要钱了。”曾希圣接着汇报说：舒茶公社8600户，已养猪32000头，现在这个公社的食堂每星期每人可以吃到四两猪肉。毛主席听了更高兴。\n　　笔者就是舒茶公社人，笔者的亲戚周其应是当年舒茶公社的秘书，退休后他多次到我家，我问他1958年你们给毛主席汇报的那些数据是怎么来的，他说：粮食产量我们是按3.5倍报的，猪的头数全公社只有2000头还不到，书记说就报32000头。汇报材料是我写的，现在想想真可笑，可那时谁不浮夸呢？\n　　紧接着，10月16日至22日，党内二把手刘少奇视察安徽，先后视察了宿县、濉溪县、蚌埠、合肥、芜湖、马鞍山的农村、工厂、学校，对安徽的大跃进形势给予充分肯定，对省、地、市、县委书记们那些浮夸的汇报给予赞扬，肯定；赞扬人民公社是“是向共产主义过渡的最好的组织形式”；说“公共食堂、幼儿院是共产主义的萌芽”；大力鼓吹组织军事化、生产战斗化、生活集体化。对夫妻分开、男女分开，组织的生产战斗队这种有违人伦的做法，也给予充分肯定。\n　　除了中央主要领导，四位副总理也都先后到安徽给曾希圣撑腰打气。其中分管农业的谭震林副总理，尤为突出。他除了陪毛泽东视察外，早在6月5日至28日到安徽视察，时间最长，共25天；跑的路程最长，3200公里；跑的地方最多，视察了4个专区，35个县，49个农业生产合作社（那时公社还没有出现），四个工厂，向干部群众作了15场报告，鼓吹大跃进。在从合肥到安庆视察时，沿途经过肥西、舒城、桐城。汽车经过肥西时，公路两边没有看见多少社员在生产劳动。可是到了舒城县，只见公路两边红旗招展，标语无数，社员一边劳动，一边唱歌，一派大跃进的景象。原来是舒城县委接到通知后，将社员集中到公路两边劳动，那些旗帜、标语都是连夜突击制作的，我二哥是生产大队书记，亲自给我讲过这件事。谭震林对陪同的省领导说：舒城县大跃进形势大好，群众充分发动起来了，县委领导得力；肥西县委主要领导人没有认真发动群众，大跃进搞得冷冷清清。就他这几句话，结果肥西县委书记被调换，另派人担任。接任的县委书记学习舒城县，在肥西县把五风刮得天昏地暗，结果肥西县三年饿死20多万人，逃荒20多万人，到1961年时，大量村庄房屋倒塌，无人居住，成了无人村。这也是曾希圣1961年初首先在肥西县山南搞责任田的缘由。\n　　谭震林的安徽之行，给安徽带来的不是福，而是祸。所以曾希圣在七千人大会上第二次检讨中抱怨说：“这次中央工作会议，我们仍然不想揭盖子，事实表现在：\n　　A……\n　　B、（我）认为（安徽）五风之所以行（刮）起来，有内在原因，也有外在原因（指的是谭震林）。虽然我讲的主要是要揭内在原因，但总想向同志们多说一说外在原因。并将×× ×（谭震林）同志的几个报告记录从合肥要来，作为讲话根据，又示意地市委同志多提×× ×（谭震林）的意见，这是想推卸自己的责任。还有另外一个情绪，是说他（谭震林）（在安徽）搞了那么多花样，接触面那么大，为何不做检讨，而只整人，不整自己。”\n　　曾希圣说的是心里话，也是有道理的话。安徽问题，曾希圣要负很大责任，但是要他一个人来负，也是不公道的。大跃进政策的制定者要负总责；那些到安徽对大跃进煽风点火的中央领导，也应负一定的责任。■\n　　（作者为安徽省公安厅常务副厅长）http://tysurl.com/mswwOj",
			"added": 1537273584,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 8,
			"title": "曾希圣：在主席和人民之间艰难选择",
			"body": "——兼谈新中国首批封疆大臣心路历程\n\n在合肥期间，与当地朋友谈及20世纪皖省历史，曾希圣是绕不开的一个人物。他主政安徽12年，给全省人民带来巨大灾难。他是毛泽东的敬仰者、崇拜者，最后迷信破灭，在主席与人民之间，选择了人民。几十年后，安徽人仍对其感情复杂、争议巨大，有痛恨，有同情，有理解，还有一丝尊敬。\n\n一\n\n1949年初淮海战役结束后，时任解放军二野副参谋长的曾希圣，随刘邓大军回到安徽。同年4月，中共中央决定成立皖北行政区，拟定彭涛任书记。彭涛说：“安徽情况我不熟。有多少山头，我怎么搞得了哇！还是曾希圣当合适，他情况熟，在皖中威望也高。”于是中央任命曾希圣为书记，黄岩、李世农为副书记。后来曾希圣发牢骚：“我连个区委书记也当不上，还是彭涛让给我的。”1952年1月，皖北和皖南两个行政区合并，恢复安徽省建制，曾希圣任省委第一书记和省政府主席。\n\n新中国成立时曾希圣45岁，其任新中国首任安徽省党政一把手，在于他对安徽情况的熟悉，也在于他的革命资历和贡献。\n\n新中国成立前后，随着国军崩溃，解放军战线向南向西迅速扩展，建立地方政权迫在眉睫。行政管理不是行军打仗，事关新生政权能否生存扎根，毛泽东亲自主管各地封疆大臣的任命。他老人家既要照顾历史上形成的各个山头以论功行赏，又要考虑具有一定的文化水平以担当重任，更要确保未来的地方大员对党中央、特别是对自己能够忠心耿耿，为此颇费了一番心思。\n\n中共中央从来没有制定过封疆大臣的任命标准。既然毛泽东重视这项工作，别人自然不能插手，顶多有一些个别的建议而已，最后的任命完全由他说了算。毛泽东虽然力求公平、公正，但最后结果或多或少仍然带有个人的感情色彩。\n\n新中国第一任封疆大臣（省、市、自治区委书记和来自中共的行政首长）具有三个显著特点：一、从部队渊源来看，红一方面军尤其是红一军团背景的人多，其他方面军和西北红军等背景的人少；与此相关联，八路军背景的人多，新四军背景的人少。二、从文化程度来看，读过几年私塾，或者小学、初中、中专的人多，接受过正规大学教育的人少；与此相关联，从事白区党的地下工作的人少。三、从地域分布来看，湖南籍的人多，其他各地的人少。\n\n曾希圣具备以上毛泽东欣赏的所有三个条件。他是湖南兴宁县（现资兴市）人，其兄曾中生是红四方面军主要领导人，也是张国焘的坚决反对者，后为张国焘所杀。曾希圣本人大革命失败后入党，长期担任中央军委二局局长，为红一方面军破译了敌军来往的大量电报。毛泽东曾经称赞他说：“没有二局，长征是很难想象的。有了二局，我们就像打着灯笼走夜路。”抗战爆发后，他从延安到重庆，再到安徽，同时具有八路军和新四军双重背景。年轻时就读湖南第三师范学校，学生时代听过毛泽东的演讲。在缺少文化的中共军队，他的中专学历，也称得上“高级知识分子”。他写得一手漂亮的蝇头小楷，虽然赶不上舒同，但在军内外也是有口皆碑的。\n\n还有两点也很重要。周恩来与曾中生有深厚的个人友情，周恩来痛惜曾中生之死，对好友的弟弟曾希圣格外怜爱。1940年，周恩来执手将曾希圣交待给叶挺，其情切切，其盼殷殷。曾希圣到新四军军部后，项英没有给这个“外来人”安排实职，他只好渡江北上。不久发生皖南事变，曾希圣在江北无为县负责接应军部突围部队，临危受命组建新四军第7师。在随后的5年时间里，7师所在的皖江抗日根据地由不到2000人的零散武装，发展成3万人的正规部队，曾希圣功不可没。曾希圣的7师富甲全军，自给有余，还大量上缴，仅1942年就上交军部749万元。其创收有方和大公无私，备受新四军政委刘少奇称赞。曾希圣以其突出的才能，先后获得了当时中共三巨头的好感，这种情况在全党、全军并不多见。\n\n新中国成立之初，有迹象表明毛泽东对自己任命的封疆大臣很满意，他不允许别人对此有任何质疑。第一任河南省委书记是年仅37岁的张玺，省主席是43岁的吴芝圃。黄麻起义领导人之一，1933年任红军军政委，1939年任新四军四支队政委的戴季英，只担任了河南省委常委、开封市委书记。就资历而言，戴在张、吴之上。就能力而言，戴不在张、吴之下。为此戴季英不服，常发牢骚，后来上书毛泽东，对河南人事安排提出异议。戴的做法，有点批评毛泽东不能“知人善任”的意思。毛泽东异常震怒，斥责其犯有“严重的无组织无纪律行为和反党的活动”、“思想意识上严重的自私自利的个人主义思想和唯我独尊的权位思想”。1952年2月，河南省委按照毛泽东指示，将戴开除出党。当时的《人民日报》刊登了这一消息，以警示全党高级干部，不要在地位和职务上说三道四。直至1984年，中共中央才为戴季英平反，恢复其党籍和省级干部待遇。\n\n毛泽东代表中央，不仅给了各位封疆大臣官职，而且帮助他们说服反对者，剪除异己，树立威信。现在轮到他们安排和任命下一级官员了。\n\n \n\n二\n\n \n\n1958年9月，曾希圣陪同毛泽东乘敞篷汽车在合肥市长江路接见20万群众。毛泽东如此“赏光”，在其外出视察时仅此一次。这一年，曾希圣风光无限、激情澎湃。\n\n与中国专制社会皇帝一竿子过问到底，直接任命府、县官员不同，毛泽东只任命省（市）一级的封疆大臣，对于地（市、州）、县一级官员的任命一般不干预。这既与毛泽东时间、精力不够有关，更与中国革命以信仰和思想为纽带，遍地开花、由点到面星火燎原的特点有关。在信仰共产主义、高举毛泽东思想旗帜的前提下，中央让出了这部分权力，并将其赋予封疆大臣。毕竟在艰苦卓绝的革命过程中，流血牺牲者众，而直接、间接支持过革命的人也多，有些情况中央未必完全掌握。充分考虑和照顾这些因素，也在情理之中。\n\n各位封疆大臣对此是满意的，甚至是感激的。他们积极搭建地（市）级领导班子，然后一级任命一级，建立起县、乡基层政权。在各地、各级政府中，安排了一些爱国民主人士、地方知名贤达和国民党起义官员，但在更具实权的党委系统，则是中共军队出身的干部一统天下。各地中共干部任命时，往往对跟随自己出生入死多年的老部下给予特别关照，将他们安排在要害岗位，并称这些职务都是“人民给的”。由鲜血建立起来的袍泽之谊和人身依附关系，毛泽东和党中央给予了相当程度的理解、体谅。\n\n对权力的追求和分配，国共两党一样，更多接受中国专制政治传统的影响。从历史角度来评价这种任命方式，有利有弊。在新中国成立初期政治生活比较正常、经济政策基本正确时，可以做到一呼百应，众志成诚，更多表现出利大于弊，即所谓制度的优越性。后来出现偏差，就带来全局性灾难。故从长期来看，实在是弊大于利。这种干部任命制度，还使得上级在下级面前，总是具有给予者的绝对权威和心理优势。下级要寻求升迁，不能“竞争上岗”或“毛遂自荐”，便有可能养成一味媚上、弄虚作假的恶俗风气。所谓腐败中之最腐败者，容易在此找到生存空间。\n\n不可否认，共和国初期的干部队伍是比较廉洁的。没有兵匪侵袭，没有战乱伤害；军人地位崇高，农民分得土地，工人收入有了保障，知识分子感到国家统一、生活稳定带来的自豪，长期游走于穷乡僻壤、对革命做出贡献的各级干部有了权力……整个社会弥漫着朝气蓬勃的乐观氛围。中国社会各阶层，尤其是各级干部，不管来自哪个山头和派系，对毛泽东的尊敬发自内心。有一次，陶铸说：“对主席就是要迷信。”柯庆施接着说：“我们相信主席要相信到迷信的程度，服从主席要服从到盲目的程度。”\n\n对毛泽东的崇拜、迷信和盲从，成为中共建政之初各级官员的普遍心态和基本特点，就连几乎所有的中央领导也不例外。正是依靠这种忠诚、信任，中共在赢得政权后推行一系列重大举措时，都能够做到政令畅通。从清匪反霸、抗美援朝、“三反”“五反”、三大改造、反右运动一路过来，乘风破浪，“凯歌”高奏。而由政经体制、发展方式和发展方向等方面产生的问题，则被严重忽略，以致积重难返，终于酿成大祸。正是有了历史上罕见的政令畅通，毛泽东才信心百倍提出“赶英超美”目标，这便有了“大跃进”和由此带来的大饥荒。\n\n曾希圣和所有高干一样紧跟毛泽东，甚至跟得更紧，忠实执行毛泽东的若干重大决策。他兼具文人学士的浪漫夸张和情报人员的细致严谨，主政安徽12年，经历了从豪气冲天到冷静思考、从盲目崇拜到理性觉醒的心路历程。\n\n治皖之初，他说服中央，修建了佛子岭、梅山、响洪甸等5座大型水库和淠史杭水利工程，极大缓解了淮河水害。反右时，将3万多人划为右派，还将不同意打击面过宽的省委书记、副省长李世农等一批党内高干也打成右派，右派的比例和级别在全国名列前茅。1958年大跃进号角吹响后，他以“端起巢湖当水瓢”的英雄气慨，滥用民力，致使全省“五风”盛行。7月，全省办起9万多个公共食堂。8月，组织240万人大炼钢铁、10万人进山砍伐森林，还提出了各种不切实际的跃进高指标。后来全省饿死500万人，占农村总人口16%。绝对数字不及饿死800万人的四川，但死人的比例超过四川，在全国名列第一。对此，曾希圣负有不可推卸的责任。\n\n尤其受人指责的是，粮荒露出苗头后，他批评如实汇报情况的省委书记、副省长张恺帆：“你不要汇报了。你为什么总看阴暗面，不看好的呢？好的是主流，我看你有点右，要注意。”江西省委书记杨尚奎的夫人水静是安徽无为人，将家乡饥荒情况反映给曾希圣，他也认为是一个指头的问题，置之不理。庐山会议上，曾希圣积极参加对彭德怀的围攻，派人将在实际工作中纠左的张恺帆的言行写成材料，连夜交给毛泽东。毛泽东立刻在材料上批示：“我怀疑这些人是混入党内的投机分子……”毛泽东要求对张恺帆等人“批判从严，处理从宽”，但会后曾希圣回到合肥，将张恺帆等人打成“反党联盟”。一批张恺帆的支持者，在“反右倾”斗争中纷纷落马。他的这些行为，对全国各地大规模的“反右倾”，起了推波助澜的作用。\n\n \n\n三\n\n \n\n曾希圣何以至此？除了对毛泽东的迷信，除了本人性格的因素，除了体制养成的一言堂作风，还有没有现实功利目的？这是一个值得分析的问题。范文澜曾经说过，“大跃进”中跟风最紧的地方，饿死的人最多。那么哪些地方跟得最紧？为什么要跟这么紧？这又必须谈到官员的任命方式。\n\n领导干部自上而下逐级任命的政治制度，最容易形成人身依附关系。决定干部好坏的标准由上级掌握，地方干部只需要对上级负责，不需要对下级负责。下级官员只有与上级搞好关系，才能留下好印象保住官位，进而得到升迁。由此派生出第二个问题，下级官员必须花费精力研究揣摩，以弄清把握自己命运的上级的真实意图，然后评估利弊，确定自己的进退取舍。“上有所好，下必甚焉”，实际是这种政治制度的必然结果。党性与人民性一旦发生冲突，人民性基本没有取胜的可能。\n\n在“大跃进”中，这两个问题得到充分体现。河南省委书记潘复生反对虚假浮夸，遭到紧跟毛泽东的省长吴芝圃攻击。1958年春吴芝圃斗垮潘复生，当上了省委第一书记。毛泽东大兴人民公社，吴芝圃立刻写作《论人民公社》，论证公社化运动是历史发展的必然，是一次生产关系的伟大变革。随后他又出版《学习毛泽东同志的著作》，同样充满阿谀奉承之词。他直截了当地拍马屁，没有任何技巧，比柯庆施差多了。后来河南省饿死200多万人。\n\n各地封疆大臣在自己管辖范围内自然八面威风，但上调进京、入阁拜相，成为党和国家领导人，仍是他们追求的终极目标。新中国成立前后，出于建立联合政府的承诺和维护统一战线的需要，中央人民政府和政务院，正职分别由毛泽东、周恩来担任，对此党内外均无异议，副主席和副总理，党外人士占了一半。在绝大多数党内高干看来，打天下理应坐天下，大量高位给了“外人”，使他们只能继续待在军队或留在地方，对此感情上难以接受。党的主席不能无视这种情绪。1952年大区撤销，各大区主要领导如高岗、饶漱石、邓小平、邓子恢等进京任职。1954年，第一届全国人大召开，宋庆龄、张澜、李济深、黄炎培、郭沫若等党外人士，全部由副主席、副总理改任副委员长。国务院将副总理职数从4个增加到12个，全部由中共要员担任，仍感僧多粥少。\n\n迫不得已时，赶上军队正规化建设，于1955年实行军衔制，这才对出生入死的军人进行大面积安抚。这次评衔，尽管中央非常慎重，仍不能做到完全满意。姿态高的让衔，想不开的哭衔，毛泽东戏言：“男儿有泪不轻弹，只是未到授衔时。”毕竟元帅等于政治局委员，大将等于副总理，上将等于中央秘书长……一一对应，等级森严，不同级别享受不同的政治、经济待遇。名和利，任何时代对任何人都有不可抗拒的吸引力。在战争年代，中共干部不管武将还是文官都穿军装。为减少授衔范围，当时在中央和地方担任党、政实职的，一律不授衔。各地封疆大臣如陶铸、曾希圣、李井泉、林铁、江渭清、舒同等，与军衔无缘。\n\n从1952年大区撤销到1956年中共“八大”，新中国第一批封疆大臣中，陆续有人调入北京，成为党和国家领导人。其中新四军背景的有：湖南省委书记黄克诚，1952年入京，先后担任解放军副总参谋长、军委秘书长，授大将衔，并在“八大”上当选中央书记处书记；湖北省委书记李先念，1954年9月担任国务院副总理兼财政部部长；福建省委书记张鼎丞，1954年9月当选最高人民检察院检察长；浙江省委书记谭震林，1954年12月入京，先是中共中央副秘书长，“八大”上当选书记处书记，接替邓子恢分管农业……1958年5月，第一任江苏省委书记、时任上海市委书记柯庆施，同时晋升为中央政治局委员。也就是说，几乎所有出自新四军系统的第一任封疆大臣都提拔了。曾希圣原地踏步，似乎仕途不畅。\n\n此间也有一些平级调入北京担任部长的，如江西省委书记陈正人任建工部长，河南省委书记张玺任国家计委副主任……1958年前后，中央多数领导年龄在60岁左右，地方官员的晋升之路似乎越来越窄，到”文化大革命”前夕，从地方晋升入京者极少。50年代担任新华社广东分社社长的杜导正，在分析陶铸主政广东期间紧跟毛泽东的心态时，就估计陶铸有进一步升迁的想法。如果以此推测曾希圣，能否得出同样的结论呢？同样在饿死人最多的几个省，李井泉、舒同、吴芝圃等人在“大跃进”期间的紧跟，也不排除他们渴望拥有更大的权力、更高的地位。\n\n不想当元帅的士兵不是好士兵。像商人希望赚更多的钱、企业家希望办更多的厂、学者希望多出几部专著、运动员希望多拿几块金牌一样，政治家想当更大的官，也无可厚非。鉴于当时中国的实际情况，基本可以肯定，他们有对领袖的迷信，也有对更大权力的渴望，两者紧紧地纠缠在一起。\n\n庐山会议后，安徽开展了声势浩大的“反右倾”运动。1959年10月底，曾希圣感到累了，肠胃也不舒服，便扔下全省人民在饥饿中继续“跃进”，自己带着妻子、儿女乘专机到广州、海南等地疗养。接连几个月，他和家人尽情享受“人民”给他的待遇。1960年3月底，他才回到合肥。\n\n \n\n四\n\n \n\n曾希圣与夫人余叔感情甚笃，育有5个子女。因曾希圣给皖省造成巨大灾难，被当地人称为“曾胖子”，夫人更被称为“余妖精”。\n\n此间的1960年春节，曾希圣回到阔别36年的老家，算是衣锦还乡。迎接他的，不是鲜花和掌声，而是过去郁郁葱葱、如今一片荒芜的田园，和乡亲们伸过来的一张张没有血色、面黄肌瘦的苦脸。\n\n叔父曾经俗告诉他：“人民公社后，社员白天干活磨洋工、晚上打着灯笼开夜工，人累死了，还吃不饱饭。”村支书熊超芝叹息道：“现在说假话成风，这是潮流啊！”父老乡亲生活的困苦和精神的麻木，给曾希圣强烈震动。曾希圣的回乡，比刘少奇的回乡早15个月，这使他成为陶铸之后觉醒较早的高级干部。他被扭曲的“党性”，终于让位于人民性，其纠“左”的速度和深度大大超过陶铸——正因如此，他也比陶铸提早迎来了晚年悲剧。\n\n回到合肥，全省饥荒蔓延、饿殍满地、人口外流严重的消息不断传来，超过了他的预计。他奔波于各地紧急扑火，但火越烧越大。长期积累的问题，岂能一时解决？体制造成的问题，岂能擅自解决？1960年9月，中央决定恢复大区分局，曾希圣被任命为华东局第二书记，同时接替舒同山东省委第一书记的职务。以大区第二书记，同时兼任两个省的第一书记，这在新中国绝无仅有。但当时危机四伏，这种信任，更多地意味着责任和风险。\n\n这一时期，曾希圣以军人的雷厉风行、情报人员的务实精细，下令两省基建工程下马，做好退赔工作，解散公共食堂。他提出责任田的设想，要求安徽省长黄岩、副省长桂林栖在偏僻山区搞试点。情况越来越严重，他感到力不从心，请求不再担任山东的职务，回到安徽，与人民同甘共苦。\n\n山东的工作、生活条件以及政治地位，比安徽要好，他如果请求留山东也顺理成章。他重回安徽，是勇于担当纠正自己造成的“烂摊子”？还是为了捂住盖子使严重问题不被发现？\n\n曾希圣乘火车回安徽。望着窗外寒风中一片荒芜的田野，他几小时不说一句话，独自深思。车到蚌埠，他立刻主持地、市委书记会议，全力布置调粮救灾，不准再死人。会议上，得知宿县一个名叫刘庆兰的老人，1959年经公社同意上山开荒16亩，第二年收获3300斤粮食，除自用外，还上缴公社1800斤粮食和60元现金，曾希圣很兴奋，肯定老人是走社会主义道路的，是有共产主义觉悟的。他提出将工业上每人负责一台机床的责任制，移植到农业，每家负责一块土地。他说：“工业上不是单干，农业上这么做，单干、复辟、倒退的帽子也不能扣到我们的头上。”回到合肥，他找来苏联集体农庄的材料和过去批判包产到户的文章，又召集几位农民劳动模范座谈，一致认为这个办法没有改变所有制，能增强社员责任心，粮食肯定能够增产。\n\n3月15日，中央在广州开会，讨论由陶铸、赵紫阳主持设计，由毛泽东修改的《农村人民公社六十条》。第一天，曾希圣就向毛泽东汇报了安徽准备推行“责任田”的想法，得到毛同意。曾希圣立刻电告省委：“现在已经通天了，可以搞。”当晚，省委将实行责任田的电报发给各地。过了几天，毛泽东口气略有变化，通过柯庆施转告曾希圣：“责任田可以在小范围试验。”但农民尝到责任田甜头后，根本无法阻止。陶铸当时评价说，曾希圣在冒险。到年底，安徽全省90%以上的地方实行了责任田，粮食总产量比上年增长40%。\n\n以省委、省政府名义推行责任田，全国只有安徽，全省农业生产迅速恢复。但全省饿死人的情况极为严重，各地不断有人写信向中央告状，曾希圣在坚决推行责任田同时，下令武力封锁消息。\n\n1961年12月，毛泽东把曾希圣召到无锡，告诉他：“生产恢复了，是否还要搞责任田？是否把这个办法变回来？”曾希圣请求道：“群众刚刚尝到甜头，是否让群众再搞一段时间？”毛泽东没有明确表态。曾希圣极不甘心，回到合肥后，仍以省委名义作出决定：1962年农村继续推行“责任田”。\n\n在七千人大会期间，即刘少奇作口头报告，指出三年困难是“三分天灾，七分人祸”的1962年1月27日，曾希圣指示将省委文件下发各地。这个时间耐人寻味！可以理解为，刘少奇的讲话，使曾希圣获得了巨大的鼓舞。\n\n3天后风云突变，刘少奇亲自到安徽组“揭盖子”，曾希圣对饿死人和封锁邮路承担了责任，但对推行“责任田”拒不认错，这在当时需要巨大勇气。2月8日晚，毛泽东带着几百部各类图书，乘专列南下。第二天，刘少奇指责曾希圣“犯了方向性的错误”，同时宣布中央决定，免去曾希圣安徽省委第一书记职务。免职的原因，究竟是因为大面积饿死人，还是因为推行“责任田”，没有说清楚。\n\n继任的李葆华主政安徽，黄岩立刻与曾希圣划清界限，得以留任省长。桂林栖及一些7师的老部下拒绝揭批曾希圣，遭到贬谪。闲居上海的曾希圣对此深感不安，但无可奈何。李葆华作风稳健，对“责任田”没有一刀切，主要采取说服方法改过来。与此同时，他积极为李世农和张恺帆等一批打成右派、右倾的同志平反，又获得广泛支持。几年后，安徽省委几个负责人到北京拜见曾希圣，他拒绝与李葆华握手，却与张恺帆热情寒喧。这是否表明，他对李葆华的不满，主要是李改正了他非常看重的责任田？\n\n曾希圣对改正“责任田”的抗旨不遵和拒不认错，是他觉醒后的思想超越，表明他在思想和行动上，开始与毛泽东分道扬镳。他以郁郁而死的沉重代价，弥补自己在反右派、“大跃进”和“反右倾”运动中的过失。他和他激烈批判过的彭德怀一样，是一个“不成熟”的政治家。\n\n \n\n五\n\n \n\n事情还没完。曾希圣在安徽推行的责任田改革，受到农民欢迎，也引起党内一些务实领导的重视。邓子恢先后两次派人到安徽调查，结论持肯定态度。刘少奇、周恩来、邓小平、陈云、李富春对此看法也基本一致，毛泽东的秘书田家英也向毛泽东表明支持包产到户的做法。1962年7月的北戴河会议，邓子恢再次面见毛泽东陈述自己的观点，引起毛的愤怒。毛泽东指责刘少奇对邓子恢的主张过于放任，刘少奇第一次正面表明他不同意毛泽东的指责，毛刘分歧继七千人大会后进一步明显。\n\n由此分析，将曾希圣免职，主要是毛的意思，而刘只不过忠实执行而已。刘少奇对包产到户和责任田，内心是赞同的，但他很可能为1月27日口头讲话的过于激烈、尖锐而感到不安，希望通过处理曾希圣与毛保持一致，以此缓和与毛的关系。由此判断，从1月27日讲“三分天灾，七分人祸”后，到30日对曾希圣下手的这几天，刘少奇一定有过激烈的思想斗争。然而，毛并未因此原谅刘少奇。\n\n七千人大会上刘少奇的口头报告，引起与会官员强烈共鸣。彭真在会上关于“毛主席哪怕有千分之一、万分之一的错误不检讨，都将给党的事业带来严重后果”的发言，也让毛泽东大感意外。他怀疑会上刘少奇、彭真等人别有用心？联想到曾希圣的“觉醒”和“不听话”，他怀疑自己亲自任命的封疆大臣，都成了刘少奇的支持者。从此以后，毛泽东的一切心思，就是计算如何将刘少奇及其支持者搞下台。毛泽东清楚，新中国成立初期省、地、县各级领导对他都是迷信的，现在他发现，经历“大跃进”、大饥荒后不再迷信了。于是他寄希望于“人民群众”，大搞个人崇拜和愚民政策，用“人民群众”的力量来达到自己的政治目的。先处理曾希圣出一口小气，再收拾刘及其支持者，才能出一口大气。\n\n20世纪50年代紧跟主席的封疆大臣，大多命运不佳。吴芝圃继舒同之后被免职，他沉痛地说：“省委和我犯的错误严重得很，罪恶也大得很……组织上无论如何严肃处理，我都没话讲的。处以极刑，我也应引颈受戮。”他多次忏悔：“我欠河南五千万人民的债一辈子也还不清。”“文化大革命”初期，他孤独地死于广州。过度外调粮食使四川死人最多，李井泉在七千人大会上痛哭流涕反复检讨，经多位重量级人物力保才艰难过关。“文化大革命”中，他遭遇也最为悲惨，弄得家破人亡。他对四川人民的伤害，超过曾希圣之于安徽、舒同之于山东、吴芝圃之于河南、陶铸之于广东……他应对粮食危机的一个创举，便是宣布四川粮票作废，致使数百万城镇居民少了口粮，也不能支持远在乡下的亲属。他知道四川人恨他，仍然在“文化大革命”后三次返回四川，佝偻着身子，向见到的人表示歉意。这些曾经的封疆大臣清楚，自己虽然有错，但主要是代人受过，只是不说出来罢了。\n\n另一位紧跟领袖的陶铸，其迷信也深，觉悟也早。1959年5月，他就在汕头开始制止“五风”，加之历来亲民，重视知识，在广东颇有政声。他小心翼翼在毛允许的范围内纠偏，主持设计的《人民公社六十条》深得毛泽东好评，并在全国范围内贯彻实施。\n\n必须看到，全国上下、全党上下都在反思“大跃进”，但深度大不一样。陶铸主持设计的“六十条”，是在人民公社体制内修修补补，治标不治本。曾希圣在1961年7月石关会议上针对“大跃进”宏观失误作出的14条总结，无论认识深度或理论高度，都超过“六十条”。而陕西农民思想家杨伟名的《一叶知秋》，对形势的判断更符合实际，开出的“处方”也更具操作性，同时将农业放在整个国民经济中考察，涉及耕作制度，产品流通，农村消费市场、生产关系调整等各方面，思想深刻。从中央到省，到基层，对同一问题的认识分析，地位越低，水平越高，也更有胆量。1962年北戴河会议上毛泽东批判《一叶知秋》时，包括刘少奇、周恩来、邓小平、陶铸等在内的所有中共要员，都保持沉默。多年以后，人们才发现，邓小平农村改革的思路和政策，都可以从《一叶知秋》中找到出处。\n\n陶铸在“文化大革命”初，被提拔为政治局常委、中宣部长兼国务院副总理。他的可贵之处在于，坚守了从政和做人双重的道德底线，从而触怒毛泽东，被列为“中国最大的保皇派”，遭到比刘邓更为猛烈的打击。\n\n1969年，陶铸在身患绝症时被迫骨肉分离，被羁押于合肥一个偏僻的所在。43天后，他无限伤感地离开人世。临死前，他对曾经的同僚曾希圣、对永远忠诚的毛泽东，有过怎样的重新认识，我们不得而知。但他刚正的品质和悲惨的命运，引人深思，催人泪下。他的独生女儿陶斯亮在他死后9年，写出《一封终于发出的信》，打动了全体国民的心。2012年陶斯亮回忆，1976年周恩来去世，她的母亲曾志——一个大革命时代加入中共、井冈山时代追随毛泽东的坚强女性——泪如雨下。几个月后毛泽东去世，她母亲没有一滴眼泪。这个革命的幸存者，似乎早已完成了对毛泽东的历史定位。\n\n其实，那些经历了崇拜、迷信、怀疑、觉醒的共和国第一代封疆大臣和千千万万的共产党人，他们的心路历程，又何尝不是如此呢？\n\n \n\n六\n\n曾希圣写的信件 \n\n1978年7月，曾希圣去世整整10年后，他的追悼会在北京举行，规格不低。李井泉主持追悼会，胡耀邦致悼词，邓小平、卓琳夫妇等参加。当年年底，安徽凤阳18个农民按下手印，对土地实行分户经营，新时期中国农村改革从此拉开帷幕。从50年代浙江永嘉的包产到户，60年代安徽的责任田，70年代末80年代初的家庭联产承包责任制，围绕如何进行农业生产这个简单的常识性问题，全党反复折腾，尸横遍野，血沃中华。\n\n70年代末，邓小平开始主持起草《关于建国以来党的若干历史问题的决议》。大大小小的讨论会上，参与者经常为毛泽东的功过评价发生激烈争执。一些革命年代九死一生、毛泽东时代家破人亡的老干部，其中不乏当初的封疆大臣，发言之激烈，反思之深刻，提出的问题之一针见血，以至于无法形成共识。最后经中央做工作，由新中国第一任湖南省委书记、因庐山会议支持彭德怀观点而受到残酷迫害的黄克诚出面讲话。这位双目失明的老者言辞恳切，希望人们超越个人得失，全面、客观、公正评价毛泽东，最终才勉强形成了《决议》。\n\n《决议》是一个高明、智慧的政治文献，虽然没有完全反映当时的认识水平，却非常适合特定历史时期的政治需要，避免了可能出现的一些负面作用，有进步意义。随着时间的推移，《决议》存在的缺点日益突显，它不应该、也不可能成为历史定论！它对历史研究，更不具有约束力！\n\n（编辑：西 月）",
			"added": 1537273864,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 9,
			"title": "原安徽公安厅长揭秘：三年大饥荒为何没有出现大规模动乱",
			"body": "“ 大跃进 ”以后，全国大 饥荒 ，饿死了几千万人。饿死这么多人，为什么没有出现大规模的动乱？这是因为，国家采取了严密而严厉的社会控制措施。\n　　1949年，中国共产党接管的是一个千疮百孔的中国。仅武装土匪（有的就是国民党残兵败将，啸聚为匪）就有200多万，还有特务、恶霸、潜伏下来的国民党军政人员、反动会道门头子，活动猖獗，社会治安混乱。经过3年的剿匪、反霸、土改、镇压反革命运动，逮捕、拘留了280多万人，其中判处死刑的有70多万，判处有期、无期徒刑的120多万，其余判处管制、戴反革命分子帽子，交群众监督改造。正如 毛泽东 在镇压反革命后所说的：“还有反革命，但是不多了”。在大规模镇压反革命的同时，进行了土地改革，农民分得了土地，劳动积极性空前高涨，农业生产得到迅速恢复，农民生活水平迅速提高。以安徽省为例，三年镇反，共逮捕各类反革命分子110164人，其中判处死刑的32876人，死缓2328人，有期徒刑49332人，其余判处管制或戴帽释放。当时安徽只有2700万人，逮捕、处死这么多人，引起的震慑作用是可想而知的。即使还有个别漏网的反革命，在强大的专政机器面前，他们也不敢轻举妄动。1950年安徽发生各类刑事案件1.6万多起，到1952年、1953年下降到5000多起。再加上禁毒、禁娼、禁赌，社会治安良好。当时，从中央到地方领导都认为，大规模的、群众性的镇压反革命运动已经结束， 公安 机关要转入经常性的侦查破案工作，维护社会治安。\n　　可是好景不长。急于向社会主义过渡，引起了社会震动。\n　　对农业、手工业和资本主义工商业的社会主义改造，不仅在党内有不同意见，农民和工商业者，更是不愿意。尤其是农民，通过土地改革分得了田地，过上了两三年的好日子，就要搞互助合作，他们是心不甘、情不愿的。于是，反抗、斗争，不断出现，治安案件、刑事案件大幅度上升，群体性事件时有发生，农村干群关系也突然紧张起来。1956年安徽省刑事案件发案数就比1954年增加2倍。\n　　针对突然出现的动荡的社会秩序，当政者们不从自己的执行的方针路线上找原因，而是从没有肃清的“残余反革命”方面找原因。1955年3月21日， 毛泽东 在中国共产党全国代表会议上说：“国内残余反革命势力的活动还很猖獗，我们必须有针对性地、有分析地、实事求是地再给他们几个打击。”1955年4月21日，国务院召开第九次全体会议，听取公安部副部长徐子荣关于《公安部1954年工作的简要总结和1955年工作要点的报告》，根据这个报告精神，随后给中共中央专门写报告说：“随着我国社会主义建设与社会主义改造的进展，镇压反革命分子的斗争，不仅没有缓和和减弱，而且是更加紧张和更加复杂了”；反革命分子“利用一些群众对农业合作化的不满和工作中出现的缺点，造谣惑众，制造骚乱和反革命暴乱；资产阶级中坚决反抗社会主义改造的分子进行报复破坏活动；一部分反动富农破坏社会主义改造和农村各项中心工作。”5月27日中共中央批转公安部的报告，在批语中指出：“为了保卫社会主义建设和社会主义事业的安全”，必须“动员全党和全体人民加强同反革命分子和各种犯罪分子的斗争，严厉镇压一切敢于破坏社会主义建设和社会主义改造事业的反革命分子和犯罪分子”，“目前要着重反对该捕不捕、该判不判、重罪轻判和该杀不杀的右倾情绪”。\n　　根据中央的指示，第二次在全国范围内的镇压反革命运动开展起来了（现在各种史书只写1950年至1953年的镇压反革命运动，而不写1955年部署开展的第二次镇压反革命运动）。于是，各省（市）向中央报告并得到批准的镇压反革命计划，包括捕人、杀人具体数据。安徽省上报中央并得到批准的反革命捕人数是：1955年2.5万人、1956年4万、1957年3万左右。由于时间紧迫，安徽1955年捕人任务很难完成，所以省公安厅10月28日发出《关于统一集中搜捕反革命分子和各种刑事犯罪分子的具体实施意见》，要求采取集中统一行动在10月底采取“摸一批捉一批的办法，逮捕人数不得低于5000名。11月份，实行全党动手，全面动员，统一行动，集中搜捕，拟逮捕1万名左右。”结果1955年全年共逮捕27611名“反革命分子”（其中有1419人没有任何批准手续），这些所谓“反革命分子”绝大多数都是抵制、反对农业合作化运动的农民和抵制工商业社会主义改造的工商界人士。\n　　用镇压反革命运动的手段推动政治运动的开展，从此就成了中国对社会进行控制的模式，尽管名称不一定叫“镇压反革命运动”，但是实质是一样的，比如“四清”运动中划分四个阶段，其中最后阶段就是对敌斗争阶段；“ 文化大革命 ”中的“清理阶级队伍”和“一打 三反 ”，也是镇压反革命。\n　　经过大规模镇压，摄于强大的政治压力，敢于公开抵制和反对社会主义改造的人少了，所以1956年3月24日安徽省公安厅向省委和公安部报告说：“原来计划逮捕反革命分子和其他犯罪分子4万名的计划，要适当减少62.5%至75%，即修订改为1万至1.5万名。”而实际上1956年逮捕了2.5万多名“反革命”，大多数是反对农业合作化和工商业社会主义改造的人。\n　　高压政策一时见效，但是并没有消除反抗和斗争。从1955年至1957年安徽省较大规模的群体性事件仍然不断发生。仅暗杀农村基层干部事件就有100多起，被害者114人，而作案者大多数是普通农民。1955年4月6日到9日，萧县发生5起大规模群体性聚众抢粮事件，哄抢粮食24万斤，打砸四个区、乡政府和粮站，被殴打干部39人，其中14人伤势严重。公安厅给省委、公安部的报告说：“发生抢粮的原因是：主要是粮食定产偏高，统购数字偏大，群众留粮过少，粮食供应先松后紧，以及干部强迫命令，激起群众不满，反革命分子乘机煽动所致。事件发生后，省、地、县委立即派出干部前去处理，调去公安干部、公安部队维持治安，运去大批粮食供应急需。本着有问题要解决，有错误要承认；对参加抢粮的‘反坏分子’要逮捕，对罪大恶极的要镇压；对参加抢粮的群众要批判的处理方针。首先解决存在的问题，至5月25日止，除原订4400万斤粮食（返还）销售计划外，再赶运粮食1050万斤，以满足供应。同时，逮捕参加抢粮的‘反坏分子’108人，对其中为首煽动闹事的4名‘反坏分子’，于5月13日分别在该县四个抢粮点公审枪决；对干部工作中的缺点、错误，实事求是地进行检查承认，事态平息。”这起大规模抢粮事件完全是地方政府的责任。先是虚报农业生产合作社粮食产量，然后实行高征购，强迫（包括打骂、捆绑、非法关押）农民卖粮，等到农民没有饭吃时，又向农民返销粮食，来回折腾；返销的粮食少，不能维持生活，有的人家一天只吃一顿饭，向干部反映，受到申斥。激起群众愤怒。被逮捕的108个“反坏分子”，包括那4个被枪决的人，原来的身份，都不是“四类分子”，而是农民。只是他们带头抢粮，并殴打干部，打砸区、乡政府，被定性为新生的“反革命”、“坏分子”。\n　　因抢粮而被枪毙，并没有阻止人们的反抗。1956年8月至1957年3月，安徽发生暴乱16起，有3000多农民参加，公开反对农业合作化，反对统购统销政策，以县、乡政府为主要攻击对象。暴乱少则十几人，多则几百人、上千人。1957年2月22日，肥西、舒城两县接壤地发生暴乱，暴乱者提出的口号是“要饭吃，要土地”，“现在的政府不是人民政府”。暴乱者打死民警2人，打伤1人，抢去手枪3支，子弹70余发，参与者400多人，99%是农民。两县 公安 干警和省 公安 厅派去的武装民警，将其包围，发生枪战，当场打死49人，抓获34人，投案自首者10人，为首的农民程千发自杀，其余的人逃跑外地。\n　　由于加入农业生产合作社后，农民收入大量减少，吃不饱饭，为了生存，不得不偷盗、哄抢，那种“农民就是饿死也不偷不抢”的说法，完全是神话。1957年4月2日，安徽省 公安 厅向省委、公安部《关于当前社会治安的情况报告》说：“本年1、2两个月，我省无为、肥西、宿县、蒙城、枞阳等县，先后发生群众性闹事89起，哄抢粮食事件271起，参与群众4.5万人，抢去粮食599654斤，柴草39.2万斤，被打干部169人。产生上述事件的直接原因，是部分地区灾情严重（托词——笔者），群众生活困难；有些乡社干部工作方法简单生硬，强迫命令，引起群众不满；有些‘反坏分子’利用群众生活困难和干部的某些错误，趁机进行煽动。”\n　　3月25日，宣城县8个农业生产合作社495户、659个农民到粮站哄抢粮食，抢走粮食38049斤，打伤粮站干部5人，公安厅长邢浩亲自带领干警前去制止处理，逮捕为首者11人，勒令参与哄抢的群众自动退回被抢粮食（退回1万多斤），同时，要求当地政府返还多征购的粮食5万斤，发放贷款8000多元，给没钱买粮的群众买粮。由于邢浩采取比较务实的政策，较好地处理了这起事件。\n　　据统计，从1955年至1961年5年多时间，发生20人以上大的群众性哄抢粮食事件就1300多起，可以用此起彼伏来形容，其中有30多人为此被判处死刑，而且都是普通农民。改革开放30年来，尤其是在农村实行家庭联产承包责任制后，安徽省没有发生一起群众性哄抢粮食事件。这就充分证明，农业集体化，公社化弄得民不聊生，群众饿得没有办法，才会哄抢粮食。\n　　1957年4月，中共中央发出《关于整风运动的指示》，不久“反右派”斗争就开展起来了。 毛泽东 对右派分子的“进攻”做出了极为严重的估计（见5月13日他写的《事情正在起变化》一文），并在一个批语中，要求公安机关，“严密注意敌情动向，尤其要注意农村敌情动向，使右派分子在工农群众中彻底孤立起来”。公安部于8月底9月初在北京召开全国公安厅、局长座谈会，认为在“整风”运动中“客观上形成了右派分子与反革命相呼应、海外敌人与国内敌人相呼应的局面”。其特点是：“反革命（右派）分子搞宣传、搞组织、搞武装活动，地主富农分子煽动农民闹事、退社，搞反攻倒算。”会议要求“进一步再给残余反革命势力一次有力打击”，坚决地“逮捕一批，管制一批，劳教一批，批斗戴帽子一批”等14项措施。 毛泽东 批准公安部计划，于是在会后不到三个月时间，又一次镇压反革命运动开始了，全国逮捕的人数大大超过1956年全年的总和，仅被判处管制的人数就有120万人之多。\n　　安徽省委在全省进行全民社会主义教育运动，从1957年10月到12月，在8277个农业生产合作社开展社会主义教育大辩论。省公安厅根据全国公安厅、局长会议精神，配合这次大辩论，挖“新、老反革命”，逮捕12274名“反革命”，管制1074名，劳教855名，戴“反坏分子”帽子1565名，斗争6518名，关押审查2338名。在大辩论中被迫自杀的845人。在这些被打击的人中，绝大多数是农民。\n　　近几年出版的一些社科类书籍，仍然把农业合作化运动当做了不起的事情记载下来，这是不符合当时的实际情况的。绝大多数农民是不愿意合作化、吃大锅饭的，因为合作化后，他们的生活水平大大下降了。他们怀恋土改后那两三年美好的日子。我家就是一个例子。解放前种地主家地，交租子，加上苛捐杂税，不得温饱。土改后分了地，从1951年到1954年，温饱没有任何问题，我也才有可能上学读书。大哥因为解放前家里穷困，小学未毕业辍学，解放后参加土改工作队，土改结束后被吸收当了干部；二哥是文盲，在家劳动，他听党的话，积极拥护互助合作，先当互助组长，后当农业生产合作社副社长。我父亲坚决反对他将家里的土地入社，父子俩经常为此吵嘴打架。我那时在舒城中学读书，一次从学校回家，看见母亲坐在床上哭泣，问为什么？母亲说，你父亲被合作社的人叫去辩论，今天肯定要挨打，被辩论的人，没有不挨打的。我说你放心，他们不会打他，二哥是副社长，这点面子他们是会给的；再说，大哥在城里工作，恐怕没有人敢对他动手；你以后要多劝劝父亲，不要拖二哥后腿，不然他的副社长怎么当？全农业生产合作社的人都在看咱们家，如果我们家退社，全社不就跨了吗？\n　　二哥当晚没敢回家，第二天回家时，父亲拿着扁担打他，追了1里多路没有追上，悻悻地回到家里。在我和母亲的劝解下，父亲的气才逐渐消了。父亲也想开了，退社已经不可能了。闯过父亲这一关，二哥一直在农村当基层干部，当大队党支部书记就有20年，是党在农村得力的依靠对象，直到上世纪80年代中期老了才退下来。\n　　关于“ 大跃进 ”时期对社会的控制，笔者在《 公安工作“大跃进” 》一文（载《炎黄春秋》2010年第1期）中已经做了详细记载，这里再作一些补充。\n　　1958年，按照经过毛泽东批准的公安工作计划要点，为了总路线、 大跃进 和人民公社“三面红旗”的发展不受干扰，要求公安机关“把应该逮捕的人逮捕起来，把应该拘留的人拘留起来”，于是从中央到地方，层层下达捕人计划指标，对那些反抗抵制人，和暂时没有反抗、抵制而将来有可能反抗、抵制的人，有可能犯罪和潜在犯罪的人，统统关进看守所、拘留所、劳教队、集训队，不让他们有反抗的机会。拘、捕人不再是政法机关一家的事，党委、政府、人民公社甚至生产大队领导人都有权决定捕人、抓人，公社也可以组织劳改队。所以1958年到1960年三年时间，安徽仅公安机关正式拘捕的人就有17万多人，集训、劳教了20多万人，比1950年到1953年大“镇反”抓的人还要多。县里、公社、生产大队自己办的劳改队抓的人，比这还要多得多。比如定远县，不仅县里私设劳改农场，公社、大队也有小劳改队；全县23个公社中，就有13个公社设了劳改队，先后劳改了2160人；县劳改队劳改了4023人，死在劳改队的就有1280人。这种无法无天的随意关押人民群众的行为，成了“大跃进”时期进行社会控制的主要手段。\n　　“ 大跃进 ”时期对社会进行控制的第二个手段，就是对那些出身好的农民，因抵制人民公社、抵制“ 大跃进 ”、抵制共产风、抵制吃食堂等等行为，给他们戴地主、富农帽子不合适，于是就给他们戴上“新生的反革命”和“坏分子”帽子。仅据萧县、砀山、五河、凤阳、无为五县在1979年摘“四类分子”帽子时统计，就有3.7万多普通农民在“ 大跃进 ”年代被戴上“坏分子”帽子的。据安徽省 公安 厅1954年统计资料，安徽省一共有地主、富农、反革命分子33.7万多人（那时还没有“坏分子”罪名。1956年3月10日，中共中央发出《关于反革命分子和其他坏分子解释及处理政策界限的暂行规定》，把“政治骗子、投敌叛变分子、流氓分子、品质极端恶劣的蜕化变质分子”定为“坏分子”范畴，从此才有“坏分子”这个罪名）。到1958年底，地、富、反、坏分子扩张到71万多人。这就意味着在合作化、“大跃进”运动中给38万人带上“四类分子”帽子。这些被打入另册的人，在农村任人宰割，也是饿死最多的群体。到1979年中央决定为全部“四类分子”摘帽时，安徽只剩下29万多“四类分子”，这就意味着死了42万“四类分子”。绝大多数是在“大跃进”时期被整死、饿死的。\n　　“四类分子”在农村是专政对象，反面教员，谁都可以任意欺辱。他们的家属子女也受到种种歧视。为了不被戴上“四类分子”帽子，成为专政对象，农民即使有满腔怨恨，也只好隐忍。但是，铤而走险者并不鲜见。1958年8月14日， 公安 厅发出《关于当前敌情和打击措施的意见》中说：“破坏农业合作化案件逐渐增多，仅5至7月，就杀死、杀伤社队干部41人。”11月5日，公安厅向省委汇报的“敌情动态”上说：“阶级敌人仍然不断进行破坏活动，主要表现在：一，造谣。利用部分群众不明政策和落后心理，大肆造谣说：人民公社化就是一切财产都要归公（一点也不造谣，完全是真实情况——笔者），以致一些地方群众把家禽家畜统统杀掉，有的砍光自留地里的农作物（这也属于敌情动态，是阶级敌人进行破坏活动，要打击——笔者）；二，凶杀。全省7至9月共发生64起，其中有对社队干部不满杀害干部的15起15人；三，纵火。全省7至9月共发生针对人民公社纵火34起；四，投毒。7至9月，针对人民公社食堂投毒的12起。”\n　　1959年、1960年这类案件继续发生。仅1960年12月到1961年2月两个月时间，全省发生哄抢、盗窃国家粮库粮食事件847起，损失粮食、山芋180万斤。据对淮南、芜湖、马鞍山三市和和南陵、六安等13个县调查，参与哄抢者5495人，都是普通农民，都是因为断炊、断粮，家里都有饿死的人。1960年12月27日一天就发生抢粮28起，在抢粮过程中杀死干部和仓库管理员26人。作案者全是农民。有个别“四类分子”被逼急了，也要反抗。1960年1月4日，霍邱县河口公社一个生产队长，到戴上“反革命分子”帽子的刘某家搜查粮食，刘一家四口一起动手，将他捆绑，然后将其杀死。刘家原有7口人，已经饿死3口。这个生产队长还要去他家搜查粮食，把他们惹急了。刘某夫妇被判死刑，另2人关押期间死在看守所。这一户人家死绝了。\n　　“大跃进”时期对社会控制的第三个手段，就是把社员死死控制起来，让他们无可逃遁。按照“组织军事化、行动战斗化、生活集体化”的原则，让他们从事农业生产、大炼钢铁、兴修水利，干部严格管理，劳动场所有民兵看守；有的地方男女分开住宿，夫妻不能过正常生活，稍有不满者，即遭到批斗，甚至戴上“反革命”、“坏分子”帽子，或送到劳改队。公社社员完全失去人身自由、行动自由。公共食堂普及后，社员家里锅碗盆勺被没收，或拿去炼铁，稍有反抗行为，动辄不给饭吃，逼得他们不得不就范。也有被逼急了铤而走险进行犯罪活动的。仅1959年8月到1960年1月，安徽省就发生食堂投毒案46起，有17人中毒死亡，公安厅为此发过3次通报，要求保卫人民公社食堂安全。另外发生9起凶杀案件，社员饿极了，到食堂抢饭吃，遭到阻拦，杀死15位公共食堂管理员、炊事员。\n　　“大跃进”时期对社会控制的第四个手段，就是广设收容审查站，把逃难的群众拦截、遣送回来，不让他们有逃生的机会。\n　　从1958年到1960年底，国务院、公安部先后发出4次通知和1次电话会议，要求全国各地，做好收容遣送工作，不要让农民盲目流入城市，尤其是北京、上海等大城市，影响国家形象。安徽省委、省政府、公安厅，发过6次通知，1次电话会议，提出严格要求，对此项工作抓得不力者要受处分。这样，安徽就在全省城乡、边沿结合部，先后设立100多个收容遣送站；全省公安派出所随时发现外流人员随时扣留，送收容审查站收容遣送。据38个县市不完全统计，三年中先后收容遣送40.8万人。有的人被收容后，没有立即遣送，而是给收容单位干活、做苦力。被收容的人吃不饱饭，还要做重体力活，加上打骂、虐待，不少人死在收容遣送站，而没能回家。仅宿县1960年在收容审查中就扣押3005名外流人员，长期不放，无偿劳动，死在收容所的237人。1960年12月，中共中央办公厅秘书室给安徽省委转来一封“探亲记”的人民来信，反映他1960年10月9日到合肥探亲，被合肥市胜利路派出所莫名其妙抓进收容所，尽管他百般说明自己是来探亲，而且提出亲戚家庭住址、门牌号码，收容所就是不放人，直到11月8日，他才趁看管人松懈，逃跑出来。接到中央转来的信，引起省委、公安厅重视，派专人到合肥收容遣送站检查，据对照花名册的24300名被收容审查的人员了解，有6527人不该收容，占总数26.8%（其实99%都是不应收容的——笔者）。其中有2314人是外出必须路过合肥的，1950人是到合肥探亲访友的，809人是到合肥看病的，554人是到合肥购物的；还有的人就是合肥市的机关、学校职工、学生，因晚上看戏、到澡堂洗澡回去较晚，被当做外流人收容审查。大蜀山收容点对不服收容、申述理由的人进行体罚，打死3人，非法没收被收容人员现金2537.53元，金戒指8个，公债券50元。\n　　除了收容审查外，安徽省对社会控制还有一条“死招”，就是不断地搜山，把人民群众为了活命的一线希望也给掐断了。安徽省西部和南部都是山区。在饥饿、死亡面前，不少人逃往山区，去找野生动、植物充饥。省委指示公安机关，要不断搜山，把逃亡的“地富反坏”抓回来接受改造。1958年5月，徽州地区8个县抽调2800人次，进行搜山行动，查出6700外流人员。1958年7月12日省公安厅向省委报告说，1月至5月全省36个山区县共查出外流人员25613名。7月19日公安厅发出简报称：据15个山区县市统计，在198个乡镇，71个（边沿）结合处，11个新建村，76个山凹，115个山洞，查处外来人员72817人，其中有地富反坏分子2914名。\n　　1960年安徽人口大量死亡，政府不是想办法救人，而是兴师动众，继续组织人员大规模搜山。4月1日，“皖南地区第一季度清山（搜山）工作总结”称：“共组织基层干部、民兵、治安积极分子等60余万人，计搜查山头448个，山洞2426个，山洼7607处，山冲447处，孤庙417处。”动用这么多人，“战果”如何呢？“扣审反坏嫌疑分子1606人，经查实有地主23人、反革命12人，盲目外流人员300余人。”\n　　出动60余万人次，搜查出所谓1000多“反坏分子”嫌疑人，结果只有23个地主，12个反革命，他们没有现行破坏活动，为了活命，为什么不能到山里找活路？而那1000多群众不是饿急了，谁愿意到深山老林去风餐露宿？\n　　“大跃进”时期安徽饿死了那么多人，同不断进行以“镇压反革命”为名而野蛮进行社会控制，密切有关。",
			"added": 1537275999,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 10,
			"title": "公安工作“大跃进”",
			"body": "笔者生来有幸，赶上解放后历次政\n治运动，能够亲身体会到半个多世纪的\n风云变幻，明白很多道理。尽管在这些\n政治运动中，我也曾险象环生，但每次\n都能安然度过。比起那些遭到灭顶之灾\n的无辜的同时代人，我是很幸运的。\n1952 年暑假，我还是一个上中学的\n少年，作为学生代表之一，参加了安徽\n省在芜湖市举办的中学教师思想改造\n运动，任务是帮助老师交代自己的政治\n历史问题，为期三个月。因为我政治觉\n悟太低，什么也不懂，对老师毕恭毕敬，\n说话有时还脸红，帮助老师更是无从谈\n起，于是当上了义务勤杂工，打扫室内\n外卫生。不过开批判斗争大会时，我们学生代表\n都参加，看到尊敬的老师被人指着鼻子羞辱、谩\n骂，真不是滋味，既同情又无奈，害怕出什么问\n题。\n把全省一千多名“有问题”的老师，集中到今\n天的安徽师范大学改造思想，是安徽教育界解放\n后的一件大事。大学建筑物围绕褚山，风景十分\n优美，站在山上，滚滚长江就在脚下流淌。只要有\n空，还是孩子的我们，到山上尽情地玩乐。可是，\n自从有几个老师过不了关，吊死在褚山的树林\n里，从此以后我们再也不敢上山了。\n思想运动改造结束后，一些老师神秘失踪\n了，后来听说，他们是反革命分子，被抓起来了。\n1955 年、1956 年的内部肃反运动中，母校舒\n城中学最好的语文、数学和历史老师，两个自杀，\n一个被逮捕判刑，死在劳改农场(1978 年后都平\n反了)，又一次震动了我。余悸未消，1957 年秋，我\n考入北京政法学院（现中国政法大学），正赶上反\n右派斗争，入校不久的一天，亲眼目睹院长钱端升从印度访问归来，学校从机场将他直接送到礼\n堂进行批斗。他在整风运动初期给院党委提了几\n条意见，一点也不尖锐，却在他出国后将他划为\n右派。在整风运动开始不久，中央派他代表中国\n法学家出国访问，他怎么也想不到会是这样的结\n局。1954 年制定中华人民共和国宪法时，毛泽东\n亲笔写信给他，聘任他为宪法总顾问，毛的亲笔\n信学校还作为校史展览过，说明他在法学界的地\n位是很高的。钱端升和学校很多老师、同学被打\n成右派的事实，使我深刻认识到“祸从口出”的道\n理，从此小心翼翼，不敢胡言乱语，安然度过一个\n又一个政治运动。1958 年，全国开展了轰轰烈烈的“大跃进”\n运动，提出短时期内在主要工业产品产量方面超\n英（国）、赶美（国），十几年内甚至几年内过渡到\n共产主义。于是“大跃进”、公社化、大炼钢铁如火\n如荼开展起来。我们学校也建了十几座小高炉，\n用木材和煤炭炼铁，我也积极参加了，炼了几个\n月，一块合格的铁也没炼出来。1959 年春天，饥\n饿在全国逐步蔓延起来，到了1960 年，由于饥\n饿，营养不良，我也得了肝炎病、浮肿病，三个多\n月不能上课，住院治疗（那时医院人满为患，住不\n上医院，学校腾出十几间房子，安置病人，医院定\n期派医生来看看）。所谓治疗，就是不上课（那时\n北京的学校体育课一律停止，有的学校上半天\n课），卧床休息，减少热量消耗，增加点营养品。三\n个月我得到2 斤鸡蛋、1 斤猪肉的营养品补助。\n到了这年年底，全国先后有几千万人因饥饿而死\n亡，其中包括我的两个在农村的叔伯堂兄和我的\n亲姐夫。可是就在1958 年，亩产几千斤、几万斤、\n十几万斤粮食的新闻报道铺天盖地，国家领导人\n还为粮食吃不完发愁呢！1961 年秋，我大学毕业，填的三个志愿都是\n当教师。可是公安部到学校挑学生，偏偏把我挑\n去，不去还不行。北京政法学院三个应届毕业生\n直接进了公安部大门。去报到后才知道，中央已\n经把公安部副部长王昭调到青海省担任省委第\n二书记兼省长，纠正左倾路线错误。王昭去了以\n后，发现那里的公、检、法机关在“大跃进”运动\n中，违法乱纪十分严重，需要彻底整顿，需要充实\n力量，于是他向公安部要人，我们三个进入公安\n部的大学生和部机关几十名干部调到青海省，充\n实政法部门，主要是公安部门。我到了青海省公\n安厅，分配的工作是接待上访群众、处理申诉案\n件，配合省委复查案件办公室，调查、处理重大冤\n假错案，使我有机会了解到，公安机关为了配合\n“大跃进”运动，自己也搞起“大跃进”，运用专政\n工具，制压广大人民群众，造成了巨大的人间悲\n剧。\n那么，公安工作“大跃进”运动是怎么搞起来\n的呢?\n1958 年1 月1 日，经过毛泽东亲自审阅、修\n改的《人民日报》元旦社论《乘风破浪》，提出了\n“鼓足干劲，力争上游”的口号，要求“在15 年左\n右的时间内，在钢铁和其它主要工业产品产量方\n面赶上或超过英国……争取1958 年农业生产大\n跃进和大丰收”。\n公安部闻风而动，于1 月22 日召集部分省\n市公安厅局长参加汇报会，讨论公安机关如何开\n展“大跃进”的问题，会上制订了《1958 年公安工\n作计划要点》，作为公安工作的“大跃进”的方向和目标。“要点”明确要求全国公安机关“努力实\n现无15 元以上的盗窃案，无10 元以上损失的火\n灾，无较大群众性迷信活动，无赌博的‘四无’农\n业生产合作社和无破坏事故、无百元以上盗窃\n案、无10 元以上火灾的机关、企业、学校”。\n这个计划要点是经过毛泽东亲自审阅、认可\n下发的。同经济建设“大跃进”一样，这是一个根\n本不可能实现的、空想的计划。同时，“要点”并没\n有提出达到这一计划目标的具体有效的办法，而\n是笼统要求各级公安机关“把应该逮捕的人坚决\n依法逮捕起来，把应该管制的人坚决依法管制起\n来；协助有关部门清查企业内部的坏分子，把其\n中的大部分人坚决清除出去；对于已经摘掉帽子\n又有违法行为的地主、富农、反革命、坏分子，一\n律戴回帽子”。什么叫“应该逮捕”？什么叫“应该管制”？“依\n法”，依什么法？没有可操作性，各人有各人的解\n释，怎么解释都有道理。这就给滥施刑罚的人提\n供了政策依据。同时这一段话也明确无误地告诉\n各级公安机关，要动用专政工具，来保卫、促进\n“大跃进”运动政治任务的完成。\n贵州省公安厅积极响应，于1958 年2 月率\n先提出在全省开展“无火灾、无积案、无土匪、无\n盗窃、无骚乱、无烟毒流行、无赌博活动”的“七\n无”运动。公安部立即发文，向全国公安机关推广\n贵州省的做法。于是，全国各级公安机关积极响\n应，在“七无”的基础上，有些省开展“十无”、“几\n十无”、“百无”运动。有些地方感到这些“无”都不\n能反映公安工作“大跃进”的现实，于是提出了\n“玻璃板”、“水晶石”的设想，就是把整个社会搞\n得像玻璃板、水晶石那样干净、明亮，没有一丝尘\n埃，不要说没有任何犯罪，就是夫妻吵架、婆媳拌\n嘴都不会有。这些提法受到了当时中央主管政法\n工作领导的赞扬。\n公安工作“大跃进”的口号有了，目标有了，\n如何实现呢？办法就是动用专政工具，把社会上\n那些被认为是坏人和可能成为坏人的人，有可能\n犯罪、潜在犯罪的人，统统抓起来，关进看守所、\n拘留所、收容审查所、集训队、监狱，让他们没有\n办法搞破坏活动。1958 年4 月9 日，青海省委书\n记高峰在公安工作座谈会上说，“有些人虽然没\n有现行破坏活动，但可能是危险分子，可以采取\n秘密逮捕的方法，把他们搞起来，要搞得很艺术，\n谁也发现不了；要采取多种多样的办法，如让他\n们打架、互相告状、扭送等等。把危险分子都搞掉\n了，社会问题也就少了”；“谁叫他们在这个时候\n（“大跃进”）捣乱，把他们抓起来，一个不放，死也\n要让他们死在监狱里。”\n于是从中央到地方，层层制订捕人计划，下\n达捕人指标。“大跃进”嘛！下级层层加码，捕人指\n标越来越大，所以从1958 年到1960 年，很多地\n方捕人数超过1949—1957 年的总和。安徽省\n1957 年逮捕犯罪嫌疑人8000 多人，而1958 年\n中央下达的捕人指标是4.5 万人，结果安徽省超\n额完成任务，全年逮捕了10.1 万多人；到1960\n年，3 年共逮捕17.3 万多人。被逮捕的人中，大多\n数是无辜的劳动群众，他们或因对“大跃进”、人\n民公社、大炼钢铁、公共食堂、刮共产风不满，说\n说牢骚话；或因为饥饿，为了活命而偷青吃青；或\n为了避免饿死，私分、偷盗生产队的粮食；或哄抢\n生产队、生产大队仓库粮食；或为了活命外流被\n当作流窜犯拘捕。被拘捕的人中约有1／3 左右\n死在关押场所，造成了巨大的人间惨案。安徽省\n3 年中死在劳改农场、看守所的已决犯和未决犯\n罪嫌疑人、劳教人员5 万多人，占这些人员总数\n31%。青海省省属劳改、劳教系统3 年死亡三类\n人员（劳改犯人、刑满就业人员、劳教人员）49\n304 人，占总数16 万人的30%。\n安徽省委书记曾希圣在“大跃进”运动中，独\n断专行，盲目蛮干，全省哀鸿遍野、饿殍载道，400\n万人被活活饿死，就这样，老百姓也是敢怒而不\n敢言，因为稍有反抗，就得坐监狱，就得被整死。\n在忍无可忍的情况下，有那么一个人忍不住了，\n于1959 年春，在省城合肥贴出一张大标语：“打\n倒曾胖子，杀死余妖精”（曾希圣妻子姓余），发泄\n心中的愤懑情绪。曾希圣下令公安机关限期破\n案，强迫机关干部（包括省委机关）人人写字，核\n对笔迹，先后共排查1.8 万人，笔迹鉴定3000\n人，秘密搜查4000 人。对一些重点对象，采取跟\n踪盯梢、秘密检查来往信件，在其住所安装窃听\n器。在受审查的人员中，有厅级干部6 人，逮捕、\n拘留、停职反省“犯罪嫌疑人”各1 人。折腾半年\n时间，花了大量人力、物力、财力，逼死了两个“犯\n罪嫌疑人”，这起所谓“反标案”最终也没有破获。",
			"added": 1537277490,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {
		"13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa": 1
	},
	"next_comment_id": 8,
	"comment": {
		"2_1A5tKMypMZW14oHJLbe3rh9Va44MsBnwz1": [
			{
				"comment_id": 1,
				"body": "magnet lost",
				"added": 1535224305
			}
		],
		"1_1C5hnD2oKKakz8954jaTdNBFN735dRuKYG": [
			{
				"comment_id": 2,
				"body": "qbittorrent 可以选择“ 匿名”\n\n[Anonymous Mode](https://github.com/qbittorrent/qBittorrent/wiki/Anonymous-Mode)\nMike Tzou edited this page on 4 Jan · 7 revisions\n\nWhen enabled, qBittorrent will take certain measures to try to mask its identity. The exact functionality of Anonymous Mode depends on the version of qBittorrent (specifically, libtorrent-rasterbar) being used.\n\nIf you're using VPN, proxy or I2P, you probably want to enable Anonymous Mode.\nqBittorrent v3.3.0+\n\n    The peer-ID will no longer include the client's fingerprint\n    The user-agent will be reset to an empty string\n    Other identifying information will not be exposed to the public directly, such as IP, listening port, etc.",
				"added": 1535224482
			}
		],
		"2_1PiVvD3GuKz7VLTNg35rjC4YxwjVKvVsvE": [
			{
				"comment_id": 3,
				"body": "“文化大革命”从1966年5月到1976年10月，在中国发生的给党、国家和人民造成建国以来最严重挫折和损失的一场内乱。这场“文化大革命”是毛泽东发动和领导的。它的“理论基础”是所谓的“无产阶级专政下继续革命的理论”。“文化大革命”名义上是直接依靠群众，实际上既脱离了党的组织和广大群众，结果给林彪、江青一伙投机分子、野心分子、阴谋分子以可乘之机，造成全面内战，天下大乱。“文化大革命”，实际是一场由领导者错误发动，被反革命集团利用，给党、国家和全国各族人民带来严重灾难的内乱。“文化大革命”的过程分为三段：\n\n    从“文化大革命”的发动到1969年4月九大是第一阶段。1966年5月中央政治局扩大会议和同年8月八届十一中全会的召开，是“文化大革命”全面发动的标志。期间对所谓的“彭、罗、陆、杨反党集团”和对所谓“刘邓司令部”进行了错误的斗争，“中央文革小组”掌握了中央的很大部分权力，林彪、江青等人煽动“打倒一切、全面内战”。1967年2月谭震林、陈毅、叶剑英、李富春、李先念、徐向前、聂荣臻等老一辈无产阶级革命家，对“文化大革命”的错误作法提出了强烈批评，但被诬为“二月逆流”而受到压制和打击。由于全国各部门各地方党政机关被夺权或改组。在各地严重混乱的情况下，人民解放军实行三支两军，对稳定局势起了积极的作用。1969年，党的九大使“文化大革命”的错误理论和实践合法化，加强了林彪、江青等人在党中央的地位。\n\n    从九大到1973年8月十大为第二阶段。1971年9月，林彪集团阴谋夺取最高权力、策动反革命武装政变，结果机毁人亡。林彪集团被粉碎后，周恩来主持中央日常工作，各方面工作有了转机。1972年周恩来提出批极“左”思潮的意见。毛泽东却错误地认为当时任务仍然是批“极右”。1973年召开的十大继续沿用“左”倾错误，王洪文成为党中央副主席。江青、张春桥、姚文元、王洪文在中央政治局内结成“四人帮”。\n\n    从十大到1976年10月为第三阶段。江青集团借所谓“批林批孔”，把矛头指向周恩来。毛泽东对江青一伙进行了严厉批评。1975年周恩来病重，邓小平在毛泽东支持下主持中央日常工作，开始全面整顿，使形势明显好转。但毛泽东又错误地发动了所谓“批邓、反击右倾翻案风”，使全国再度陷入混乱。1976年1月8日，周恩来逝世。同年4月，在全国范围内掀起了以天安门事件为代表的悼念周总理、反对“四人帮”的强大抗议运动。1976年9月9日，毛泽东逝世。江青集团加紧了夺取党和国家最高权力的阴谋活动。10月，中央政治局执行党和人民的意志，毅然粉碎了江青集团，结束了“文化大革命”。\n\n    在“文化大革命”中，党和人民同“左”倾错误、特别是同林彪、江青集团进行了艰难曲折、英勇顽强的斗争。正是由于这种斗争，使“文化大革命”的破坏受到了一定的限制。国民经济虽然遭受巨大损失，仍然取得了进展。在国家动乱的情况下，人民解放军仍然英勇地保卫着祖国的安全。对外工作也打开了新的局面。党内以老一辈无产阶级革命家为骨干的健康力量不断发展壮大，最终粉碎了林彪、江青两个反革命集团。党、人民政权、人民军队和整个社会的性质都没有改变。历史再一次表明，我们的人民是伟大的人民，我们的党和社会主义制度具有伟大而顽强的生命力。\n\n    中国网 2002年9月22日",
				"added": 1536429082
			}
		],
		"4_1PiVvD3GuKz7VLTNg35rjC4YxwjVKvVsvE": [
			{
				"comment_id": 4,
				"body": "毛则认为可以通过净化中国的意识形态加速中国的发展，但所谓的“文化大革命”却来源于他的信念，这信念产生于他动荡的一生的晚年，即他必须再次使中国革命化。“文化大革命”开始是为了阻止中国走上苏联赫鲁晓夫式的“修正主义”道路，最终却化为十年浩劫",
				"added": 1536430849
			},
			{
				"comment_id": 5,
				"body": "正像他以前所做的那样，毛又一次求助于人民，敦促他们谴责其领导人和被他称为“阎王殿”的党的中央委员会的一些部门。当年晚些时候，国家主席刘少奇和中央委员会总书记邓小平分别被打成“头号走资派”和“第二号走资派”。两人都遭到清洗。刘少奇夫妇受到了红卫兵长期的肉体和精神折磨。当监狱方面拒绝治疗刘少奇的糖尿病时，他的生命走到了尽头。邓小平也免不了承受较长时间的艰辛，但其命运要好得多。\n\n类似的惩罚也落到了全国各地的知识分子和专业人士的头上。最初，他们并不认为这种疯狂能够持久，但在狂热情绪和激进分子与投机分子的推波助澜下，“文革”迅速升级，并失去控制。毛泽东，一个真正具有超凡魅力的人，其人格却被严重扭曲了，对他的崇拜笼罩着全国。年轻的红卫兵大多数没受过多少教育，他们挥舞着记录着毛主席语录的红宝书，好像它是神灵的启示一般，对任何他们认为是反革命的人加以审判。红卫兵呼喊着制造不和的口号：“破四旧”（即破除旧思想、旧文化、旧风俗、旧习惯）、“宁要社会主义的草，不要资本主义的苗”和“永远忠于毛主席”等。\n\n大学被关闭了，教授们被流放到农场去清扫猪圈或在水稻田中劳作。当“革命委员会”接管了为数不多的仍在办公的机构以后，运动进程告一段落。人们开始相互为敌———工人对工人、朋友对朋友、孩子对父母。随着数百万人遭到清洗，文明被扫进垃圾堆，整整一代人被毁掉了。30年后，江泽民说：“贬低和破坏美好文化艺术的荒谬行为是完全错误的。”\n\n起初，江最担心的是他在上海的家人。到1966年11月，他意识到无政府状态并没有像多数人希望的那样快要过去，而是正在不断蔓延。12月，他请了一个短假去看望妻子和儿子。他决定取道北京，他这样绕道有其深意，是想亲身感受一下正在发生的一切。\n\n到达首都后，江了解到，一机部所有高层领导都已经或即将被打倒，并发配到农村去扫猪圈和种稻子。汪道涵和江的其他朋友一样都被流放。他们销声匿迹了10年或更久。",
				"added": 1536430875
			},
			{
				"comment_id": 6,
				"body": "1967年1月，江泽民回到武汉，他发现“文革”的冲击已像冬日的寒风，横扫了这座城市。江保持了低调，他穿上旧军服，与普通人装束无二。不过，作为研究所所长，他很容易成为攻击目标。批判他的“大字报”贴到了墙上，其中之一写道“江专而不红”。他被指控为走“白专”道路，是“修正主义者”和“走资派”。他自己说过的话———“我们必须热爱我们正在从事的工作”———成了他的罪证，他还因为重复陈毅将军的话———“‘专’就是红，它们是同一问题的两个方面”———而受到批判。\n\n在江泽民身上，红卫兵找到了大量的攻击点：他的知识分子背景、他成长的文化背景、他所接受的精英教育以及他在苏联的留学经历。他能说多门外语这一事实意味着他“崇拜外国生活方式”。他们还指控江过着“资产阶级的生活”。\n\n江的确非常注意自己的外表。他偶尔会在公开场合梳头并整理着装。他的朋友们有时候会以此开一些善意的玩笑，他们会说：“大脑袋小梳子。”江会微笑着回敬他们：“爱美乃人之天性。”\n\n江默默地承受批判。与他的同学和同事相比，他知道自己是幸运的。他没有被清洗、流放或监禁。他有两个救命的优势：他生在一个“红色”的家庭；他专注于科学研究。用“文革”的语言来说，他是属于“靠边站”，而不是被“打倒”。尽管如此，他还是很愤怒：毕竟他曾为建设党和国家那么努力地工作。江后来告诉他的朋友和家人：“墙上的大字报真令人难以忍受。没办法同他们理论。对我而言，这是一种折磨与考验。”\n\n红卫兵选了一个名叫刘振华的大学生来调查和审问江泽民，这可能是使江感到最为屈辱的事情。在审问中，江十分坦诚。他告诉这个神经过敏的学生：“你们年轻人必须保持清醒的头脑。在我们社会主义国家，有各种各样的人。你必须学会如何用自己的头脑分析问题并发掘真相。”当刘指责他的“资产阶级生活”时，江愤怒了。\n\n他斥责道：“无稽之谈！我住的是宿舍。我的毯子都被虫子咬破了。我的公文包破烂不堪。你可以去查我的所有财产！”\n\n刘私下里告诉一位朋友，他非常感激江的忠告。\n\n尽管如此，江被拉下了所长的位子，接受公开批斗，被迫交代自己的“错误”并写下检讨书。尽管他在心里可能有时觉得生气，有时觉得好笑，但江努力保持一个坦率正直的态度，不给那些坏蛋以任何借口对他进行变本加厉的迫害。即便如此，他拒绝为了开脱自己而牵连任何人。一段时间后，攻击他的人好像已经用尽了所有可以指控他的借口。\n\n是什么原因使江泽民遭受的迫害相对较轻呢？首先，他离北京和上海比较远———那两个地方被看成是滋生反对毛以及破坏共产主义的“走资派”的温床。另外，江的个人行为无懈可击：他没什么财产，从不追求浮华的生活方式。为了把迫害他的人搞糊涂，江强调他的父亲是共产党的烈士，而对他成长的文化背景和所接受的精英教育则轻描淡写。那时江还不知道，他的母校扬州中学是红卫兵攻击的早期目标，他们用鲜亮的大红色把这栋“封建”大楼涂抹得面目全非。\n\n江竭尽全力帮助所里的工作人员。他的办公室主任姓杨，曾经在中南海担任过10年的警卫工作，对党很忠诚，但由于曾给中央委员会写信批评“四人帮”（译注：当为江青等人，此时“四人帮”尚未完全形成）而被打成“反革命”。江对他说：“杨同志，你确实是一个好同志。你一定要相信只要我们的老一辈领导人还健在，只要人民解放军还在，天就塌不下来。最终，你会得到平反和正确评价的。”\n\n在江被停职期间，他为技术人员组织讲座和课程，考虑到当时反知识的政治气候，这真是个小小的奇迹。其中包括用英语和俄语来授课，吸引了100多名学生。他还加深了自己对核工程学及马列主义的理解。头一次有了那么充足的时间，他可以如饥似渴地读书，特别是英语书籍，非常具有反讽意味也非常聪明的是，其中包括外文版的毛泽东著作。毕竟，怎么能够批评他读毛的著作呢？江的另一项自我完善是学游泳，这一技能成为他在以后岁月中最主要的锻炼方式。\n\n1967年是“文革”的暴力活动达到高峰的一年。华明春回忆说：“有一天，我问江所长，他想不想出去看不同红卫兵派系间的武斗。他拍拍我的肩膀说：‘小华，你还年轻，你应当把时间用到学习上。如果我们没有知识，就不能建设我们的国家。’”\n\n在华搬进来之前，江把所有业余时间都用于在宿舍里学习。他的床上总是堆着高高的书。如今他有了个室友，江便在办公室里读书，直到很晚才回来，几乎总是要到华睡着以后。“他总是很小心地开门，”华说，“他从不开灯，总是摸黑作上床前的准备。”\n\n华和江在一起住了3年。他记得江从不抽烟或喝酒。不过，他的确记得江的宽边眼镜，还有那颇有意思的头发问题。华说：“我们所里有些人批评江的头发留得太长了。他们说江的发型是（解放前）30年代的。”\n\n江别无选择，只能把头发剪短，但当他回来时，听到了同样的抱怨———说他的头发还是不够短。因此他再次回去，让理发师给他理了个政治上正确的寸头。当他这次再回来的时候，他摩挲着几乎已被剃光的头问他的室友：“小华，现在我的头发怎么样？”\n\n华忍不住笑了起来。他说：“好啊，江所长，短头发能防止被人‘揪辫子’。相信我，这次没人会批评你的头发了。”\n\n江泽民在武汉的那几年里，只有很少的个人财产———一个旧皮箱、一个人造革手提包、一条蓝色碎花小棉毯、一顶旧蚊帐、一个小收音机以及一个煤油炉。研究所没有食堂，单身汉要吃饭就得到隔壁的武汉锅炉厂去。有时候，江工作或学习太忙，他会给华留一个字条，让他带碗米饭回来。其他时间，他会用煤油炉做点简单的汤面。“我们所里就有煤油，”华解释说，“但江总是到商店去买他需要的那一点煤油。”\n\n“个人的就是个人的，”江说，“所里的就是所里的。我们必须公私分明。”\n\n“在我看来，这有一点过分了。”华补充说。\n\n1968年，有更多的人进所，由于没有空房子，两个人搬进来与江和华同住。江对华说：“我们要同甘共苦。”他的室友聊天打牌，但无论屋子里有多吵，只要江在屋里而又没睡觉，他就总是在读书。有一次，一个室友的家人来访，江建议所有其他人另找地方睡几天，让那家人有些私人时间在一起。\n\n多年后（1991年），华明春惊讶地得知江泽民是江上青的儿子。“我们在一个小房间里生活了3年多，”华当时说，“但他从没对我提过他是烈士的儿子。”\n\n1967年10月9日，周恩来总理———在这个灾难性的时期几个孤独的理性的声音之一———访问了武汉。研究所的工作人员按要求夹道欢迎这位伟人，江与其他同事一样，都把这看成是一种荣誉。但是，就在周到来之前，江和另外6名靠边站的高级领导被强行关进一个空屋子里，不许出来。这让江感到苦涩和失望。他说：“今天，我最大的遗憾就是没能见到周总理。”江的同事从没见他这么沮丧过。\n\n在停职近两年后，江泽民被要求接受党的严格审查，结论是在江的个人背景或政治行为中找不到任何严重问题。结果，江被送到“五七”干校。“五七”干校的得名是因为毛泽东在这一天号召知识分子去体验农民的体力劳动。干校位于一个农场，通过身体受苦的方式来改造人，据说这是锤炼政治纯洁性的火焰。吃饭就是用粗糙的饭碗，像农民一样蹲在地上吸溜面条。几十年后，江仍记得农场那“尘土满天、泥泞崎岖的乡村小路”。\n\n江在农场住了一年多。由于性格使然，江充分利用了这段时间，并和一些人建立了友谊。除了按要求养猪和种小麦，他靠演奏乐器、练习书法和绘画来打发时间。文化兴趣又一次使他保持了良好的精神状态。转折即将来临，干校生活是江复出的第一步。\n\n对包括江泽民家族成员在内的很多其他人来说，这个年代显得更具破坏性。他父亲的弟弟———五叔———在战争年代曾冒着生命危险为一家地下印刷厂工作，却在当时一次典型的大规模集会上被迫害致死。他的妹妹江泽慧被下放农村劳动。江泽慧平静地回忆说：“我是在学校负责管理学生的一名辅导员。在造反开始的时候，学生们不知道自己要做什么，所以他们首先攻击的是他们认识的人。”\n\n她丈夫因为曾在苏联学习过，所以被认为是一个苏联间谍，受到清洗。江泽慧说：“每个人都会受到各种怀疑。他们把你划成什么，你就是什么。”\n\n1971年初，江泽慧和她的丈夫还住在下放的农村时，他们被准假去南京她公婆家过春节。江泽民那时恰好也在南京（在他哥哥江泽君家中），但他不知道他妹夫的父母住在哪儿，便焦急地到处寻找。\n\n江泽慧回忆说：“当他最终找到我们时，焦虑不安地提了一大堆问题。他想马上知道一切。‘所有帽子都摘掉了吗？’‘你们平反了吗？’‘现在生活怎么样？’”江告诉妹妹，党的调查人员已经完成了对他的审查工作，他已被证明清白。“他好像对那些徒劳无功的事很感沮丧，虽然他并没有怨天尤人。”江泽慧说。\n\n江泽民的两个儿子，江绵恒和江绵康也成了那个时代的受害者。他们的学业，同30年前江本人的学业一样，被政治动荡打断了。尽管江在武汉“靠边站”的时候两个儿子有时能来看父亲，但“文化大革命”改变了他们的生活。14岁的绵恒刚刚初中毕业就被送到农村，他同其他许许多多的知识青年一起接受农村的教育改造。绵恒在粮库工作，成天背大袋面粉。弟弟绵康在1968年初中毕业后参了军。直到1979年，两个孩子才得到了完成学业的机会。\n\n江泽民以达观的态度来面对家庭和国家遭受的创伤。“我们经历过‘文革’的人，都会对曾经在肉体和感情上折磨过自己的人深恶痛绝。”江泽慧解释说，“但三哥鼓励我要以历史的观点看问题，要与人为善，即使是对那些曾经陷害过我们的人。他说，‘如果你能够赢得他们的心，他们将与你和平相处。’”\n\n王慧炯解释说：“江主席很少跟我谈及‘文革’，我们不需要谈。我们忘不掉那些痛苦。我们忘不掉被摧残的生命和被毁掉的一代。我们忘不掉那些对中国可怕的伤害。我们忘不掉那些激进的极左分子。我们俩都是知识分子、专业人士———没有必要说更多了。”\n\n1972年，江完成在罗马尼亚的工作后，再度担任一机部外事局的副局长。他从布加勒斯特回来后不久赴长春休假，去看望他在汽车厂的老朋友。他几乎有5年没有和沈永言联系了。沈在第一汽车制造厂招待所为他安排了一个套间。\n\n“老沈，”江看着宽敞的房间说，“你这是什么意思？我不住套间。请给我一个标准间。”\n\n这不是谦虚，这是不安。经过“文化大革命”持续的指责与批判后，江拒绝住套间。“他话比以前少了，”沈回忆说，“不像我所认识的那个热情洋溢的他了。经过那些可怕的岁月，他格外地谨慎。”",
				"added": 1536431620
			}
		],
		"5_1PiVvD3GuKz7VLTNg35rjC4YxwjVKvVsvE": [
			{
				"comment_id": 7,
				"body": "解说：1966年轰轰烈烈的文化大革命爆发，那是一个你完全不了解的时代，那是一个你充满好奇的时代，那是一个你想逃避和忘却的时代；还是一个你有些怀念的时代。无论你对那个时代是否了解，无论你对那个时代有着怎样的感情，它都曾经真实的存在过。历史无法抹去，陈小鲁,陈毅元帅之子，在最年轻最萌动的岁月，与那段历史相遇，成为他一生难以忘却的回忆。2013年陈小鲁为文革时的行为公开道歉，引起社会的强烈关注，出身名门已是花甲之年，陈小鲁为何选择在此时站出来，为半世纪前的行为道歉。\n\n陈小鲁在道歉博文中这样写到，在运动初期我积极造反，组织批斗过校领导，后来作为校革委会主任，又没有勇气制止违反人道主义的迫害行为，因为迫害被人说成老保，说成反对革命，那是个令人恐惧的年代。1966年陈小鲁二十岁，是北京八中的一名高三毕业生。他的青春恰好与那场运动不期而遇，5月16日中央政治局扩大会议，发布通知指出混进党里、政府里、军队里的各种文化界的资产阶级代表人物，是一批反革命的修正主义分子。一旦时机成熟，他们就会夺取政权，由无产阶级专政，变为资产阶级专政。为了防止资本主义复辟，把所谓[被走资派篡夺了的权力]夺回来，轰轰烈烈的文化大革命，拉开帷幕。5月25日，北京大学的教师及学生七人，贴出一张大字报，对北京大学党委和北京市委进行了攻击。经中央批准，大字报被广泛公开和传播，号召人们起来造反。\n\n陈鲁豫：我们这代人就，没有经历过的人没法想象，就那个环境是，一夜之间开始变的？\n\n陈小鲁：一夜之间。\n\n陈鲁豫：变的乱起来了？\n\n陈小鲁：它是这样的，你想想，你想想我们中国共产党，执政现在六十四年了对吧，1949年到2013年，什么时候允许老百姓，随便成立自己的组织，而且是政治性的组织。就那两年，1966年8月到1968年，1968年就开始收了，那时候任何人都可以成立组织。你成立组织就可以，为了夺权。那么就说一个学生十五六岁、十七八岁，本来在学校里，有很多人管你啊，有班主任、有团党委、有党支部、有校长多少人管你啊，一夜之间，这些全没有了，公安局当时一个指令是，不进学校不管学校的事，所以学校死了人，没有人去查。你自己来找，你该做什么事情，你想做什么事情都可以的。当时是你自己，写一篇文章吧，你拿到印厂，印厂免费给你排版，给你印刷，然后你自己可以，到处张贴散发，没有人管你。\n\n陈鲁豫：嗯，不管你写的内容是不是。\n\n陈小鲁：当然你不能写反对毛主席的，你反对中央文革是不行的，那你说反对哪个部长，反对哪个副总理。\n\n陈鲁豫：或者我反对生活中，任何一个人都可以？\n\n陈小鲁：那没有问题呀，你写我的父亲的大字报，都没有问题。\n\n陈鲁豫：那我举的事例是真是假，也无从判断？\n\n陈小鲁：那不管，没人查呀。\n\n陈鲁豫：所以这个阶段，你们是完全不上课了已经？\n\n陈小鲁：那从六月十几号，十一二号就，中央宣布停止高考。\n\n陈鲁豫：人在那个时候状态包括像你们？\n\n陈小鲁：高兴得不得了啊。\n\n陈鲁豫：是种亢奋的状态是吗？\n\n陈小鲁：那当然了，你想想学生就是怕考试嘛，你想高考现在多紧张啊。\n\n陈鲁豫：但我总觉得人在一个有条条框框有规矩的地方，待时间长了突然一下子，什么条条框框都没有的话，你需要一个适应的过程，你会觉得很惶恐？\n\n陈小鲁：所以人是不一样的呀，所以我为什么我考虑，说一千多个人里头，学生里头并不是人人都造反了。那么干部子弟，大约在三分之一也就是三百到四百，不到四百人。也并不是人人都造反了，那我造反了，我带头造反了，所以我要有个反思，要有道歉。\n\n解说：听到取消高考的消息，陈小鲁和同学们欢呼雀跃，高兴地把书扔上空中，从此把青春献给了那场史无前例的运动。青春叛逆的学生们，把矛头对准了校长和老师，许多老师被挂上[黑帮分子]的牌子关押起来，进行批斗和劳改。行政和党团组织完全陷入瘫痪。而在北京八中，陈小鲁很快成为学生的造反领袖，之后他被推选为校文化革委会的主任。\n\n陈鲁豫：当时1966年，我看过一些报道几乎是全票，一千多票选您？\n\n陈小鲁：一千差了二十票吧。\n\n陈鲁豫：那在那之前您在学校担任，什么学生的什么干部吗？\n\n陈小鲁：我没有，我就是班上的，我是1964年入团，当了团支部书记，就是班上团支部书记。\n\n陈鲁豫：您应该属于从小学开始到中学，一直都是在班里面，很有学生威望的那种人？\n\n陈小鲁：不是不是，我小的时候，一二年级还行，后来我不用功，不用功成绩就很差，好在我父母对我，这个学习成绩，要求不是太高，及格就行，就是你别，因为你不及格，老师要找的呀，老师要找家长开会的。\n\n陈鲁豫：老师也不太清楚您家长是谁？老师在考中学，填志愿的时候他们才知道，因为我一直在填我母亲的名字，那人家填志愿书的时候，说你不行啊，你怎么只有母亲没有父亲吗？我就填我父亲的名字。那个班主任一看，哎呦你是陈老总的孩子，我反而对我父亲，官到底有多大，我是搞不太清楚。\n\n陈鲁豫：你有时候想过吗？为什么在那个时候，就把您推到那个位置？我就觉得肯定是跟性格有关？\n\n陈小鲁：文化革命中，曾经有人就是这么讲的，说有人找我串联，说找陈小鲁他说你看，我们几个人谁穿的最破，那就是陈小鲁，他就讲这样的话。\n\n陈鲁豫：那个年代的人，都穿的不太好？\n\n陈小鲁：但是我穿的更破，就是有补丁的，因为我是老三呢。\n\n陈鲁豫：就上面两个哥哥？\n\n陈小鲁：新老大，旧老二，缝缝补补是老三，所以呢我在老师和同学眼里呢，人家就觉得你有个反差，说你的父亲很高，天天在电视上能够见到，报纸上有登载。但是你这个人呢，非常的低调、非常的平和，而且根本就不像一个干部子弟。\n\n陈鲁豫：同学对你的印象是很好的？\n\n 陈小鲁：一下子就，这个差距一下来的时候，同学对我就很好了。我的也很有思想，所以我是带头造反的，对校领导实际上我只能说是，八中的一个精神领袖。就是人家要问问你啊，你觉得怎么样啊，校领导怎么样啊对吧，没有说说大家开个会，成立一个组织，都没有。所以八中没有红卫兵，有红卫兵都是你自己，因为文化大革命当中，你自己任何人都可以说自己是红卫兵。\n\n陈小鲁谈文革细节：曾对被抄家的人动恻隐心\n\n解说：抄家。\n\n陈鲁豫：被抄家的人看你们的，眼神跟表情是什么样的？\n\n陈小鲁：当然是。\n\n解说：批斗。\n\n陈鲁豫：那天打的厉害吗？\n\n陈小鲁：打的很厉害，而且是在舞台上打的，所有的学生在下面看着的。说不出来的感觉，就觉得好像天塌来一样啊。\n\n解说：陈毅之子陈小鲁为您细述，那个难以想象的时代。\n\n解说：1966年6月1日，人民日报社论《横扫一切牛鬼蛇神》，提出破除几千年年来，一切剥削阶级所造成的，毒害人民的旧思想、旧文化、旧风俗、旧习惯的口号，破四旧行动很快被红卫兵们付诸实践。红卫兵们最初从街道、店铺易名开始，紧接着对人们的正常生活习惯横加指责，对所谓不合[无产阶级口味]的发式、服饰、装饰等发起攻击。发展到极致是抄家狂风的刮起和肆虐。许多知识分子和民主人士，遭到惨不忍睹的批斗，无数优秀的文化典籍，被付之一炬。伴随着[阶级斗争]的思想，成长起来的陈小鲁，虽然并没有正式加入红卫兵，却响应中央号召，满腔热情与资产阶级敌人做斗争。\n\n陈小鲁：因为当时毛主席，有一个判断就是，资产阶级统治学校的现象，再也不能继续下去了，没有说是哪个学校，但是作为我们，就认为就是我们学校。\n\n陈鲁豫：那您当时看八中觉得老师校长，都像是毛主席说的？\n\n陈小鲁：没有，我们看校长像，老师没有就在我的想法里，老师同学都不是。\n\n陈鲁豫：校长是？\n\n陈小鲁：校长代表了，有点像，但是说句老实话，到后来不是到现在来看，到后来也觉得不大像，因为我们，当时我们造反，老想去能找出点什么东西，能不能找出反动电台，抓出一个国民党特务，抓出变天账。什么国民党的委任书，搞点出来什么枪支，就是这个都是这个心理，所以当时就感觉到，阶级斗争无处不在。所有的人都看着，老觉得看着别人都像个，国民党特务一样。\n\n陈鲁豫：那您。\n\n陈小鲁：所以抄家的时候，因为我只参加过一次抄家，而且也不是我抄的，就是在学校。\n\n陈鲁豫：抄的谁的家？\n\n陈小鲁：就学校附近一个人，我也不知道谁。\n\n陈鲁豫：八中附近的一个？\n\n陈小鲁：对，然后他们告诉我说，抄出反动证据来了。\n\n陈鲁豫：抄家是怎么抄？我到落这个屋子以后我就？\n\n陈小鲁：我跟你讲，抄家是这样，实际上是有人提供线索，知道这个人，比如当过国民党，那个人当过国民党兵，或者这个人的，儿子在什么地方对吧，所以我们那个地方，那个人也确实我去看了，有几个就是供那个就是供祖宗牌位的香炉，也确实有一个为委任状，我记不得了。就是有国民党党徽，估计是他过去不知道当过什么，也不是什么大官，肯定不是什么大官，要大官就是，等于抱到一个大金娃娃了。就是一个什么小官，但是那个委任状，里面有国民党党徽，这就是反动罪证。但当时我看了看，也觉得好像是，当时我们也想着是不是，有枪支、有弹药、有电台，都没有。只是他过去的一个历史。\n\n陈鲁豫：被曹家的人看你们的眼神，跟表情是什么样的呀？\n\n陈小鲁：当然是很。\n\n陈鲁豫：特别恐惧吧？\n\n陈小鲁：当然他也不敢，又是恐惧，又是有点仇恨的感觉。\n\n陈鲁豫：那您当时看他们的眼神，您又是在想什么？\n\n陈小鲁：我有点侧隐之心，我觉得好像这个人不是那么，所以我后来我就再也不参加这个抄家了。\n\n陈鲁豫：那个时候街上是什么样子，我在想是不是一般人，看到红卫兵，是很恐惧的感觉？\n\n陈小鲁：有，但是到了十月份就不一样了，八月份的时候你害怕的，他动不动就打人啊，你穿了一个喇叭裤，就把你抓起来打一顿。你像你剪这种头发，肯定是重点。\n\n陈鲁豫：我肯定被打死，我肯定被打死那时候。\n\n解说：为了控制日益严重的混乱局面，刘少奇、邓小平等领导人，派出了工作组到大中学校进行协调，然而工作组却被造反派指责为，站在资产阶级立场上，反对无产阶级革命。不久中央解决，撤销工作组。工作组撤销后，各校文革筹备小组，纷纷进行选举，正是此时，陈小鲁被推选为北京八中，校文化革命委员会主任。然而一片混乱下，陈小鲁的内心，并不知道自己应该做些什么。八月一日至十二日，党的八届十一中全会召开，全会通过关于文化大革命的十六条。\n\n视频解说：在当前我们的目的是，斗垮走资本主义道路的当权派，批判资产阶级的反动学术权威，批判资产阶级的一切剥削阶级的意识形态。\n\n解说：这为当时迷茫中的陈小鲁指明了新的方向，他联合北京四中、六中的同学，召开了一场教育界的批斗大会。\n\n陈小鲁：在文化革命特别是到八一八以后，我组织了一次批斗这个，北京市教育系统走资派的，实际上就是领导的活动。\n\n陈鲁豫：在什么地方呢？\n\n陈小鲁：在中山音乐堂，大约三千的位置，所以我们学校有一千人，我就联络了四中和六中，三个学校因为当时呢，出了个十六条，那我们当时，我们当时对毛主席是非常敬仰的，而且我们也确实像林彪讲的，学习毛主席著作，急用先学，活学活用、立竿见影。我们有学习这个十六条，十六条有一个重要的观点，就说这次运动的重点是整那些，走资本主义道路的当权派。那我们想，走资本主义的当权派是谁呢，在教育系统来讲，那肯定就是市里的领导，区里的领导，我们学校的领导觉得有点。\n\n陈鲁豫：不够格？\n\n陈小鲁：有点不太够格了嘛，所以开会的时候就是，在会上的时候，就是大家准备发言，各自准备发言。突然发生了武斗，我后来看孔丹他有一个，《回忆和反思》，他有一个回忆录，他讲就恰恰是他们派，就是让他维持秩序的那个人，最先打。他突然拿起皮带，就打这个老师，本来他的任务是。\n\n陈鲁豫：维持秩序？\n\n陈小鲁：对，那他一打不就乱了，就冲上来了。\n\n陈鲁豫：那天打的厉害吗？\n\n陈小鲁：打的很厉害，那天打的，而且是在舞台上打的，所有的学生在下面能看到的。和你在一个角落里，打他两下子不一样，所以影响比较坏。\n\n解说：一场批判会就这样，演变成了武斗的表演，这令组织者陈小鲁有些始料未及。然而面对暴力，年轻的陈小鲁选择了沉默，他无法支持更无力阻止，正如他在博文中所说，因为害怕被人说老保，说成反对文革，那是个令人恐惧的年代。然而时至今日，这样的场景和画面，也许在陈小鲁心中，回放过多次，思考过多次。多年后，当再次见到那场批判会上，被殴打的老师，陈小鲁已是另一番心境，对人性的善恶也有了更多的深思。当时我们见温校长，温校长在那次被打的，非常惨。说这个衣服，打的都连到一块了，衣服和肉连到一块了。他给我们就讲到这个回忆，说你看就是那次，打的特别厉害。我立刻就跟特讲，我说校长，这活动是我发起组织的，当时好几个同学都很吃惊，谁都不知道的事情你也讲，我说我，既然道歉就是，就是要真诚的讲这些东西。当然我反对打人，但是那个时候，我也没有办法。\n\n陈鲁豫：那当时这个校长是什么？\n\n陈小鲁：温寒江啊。\n\n陈鲁豫：他是个什么反应？\n\n陈小鲁：温寒江很好啊，他就说哎呀，说这个事情都过去了，又不是你打的。\n\n陈鲁豫：这点我就很奇怪，就是大家内心的那些，那些你说是暴力的东西，是一直都有，还是因为这样一个外力，把它给激发一下子给激发出来了？\n\n陈小鲁：我恰恰是认为就是，一直都有，就是这个人性善和人性恶，这个东西是一个千古之争，但是我讲的是什么呢。你十五岁以后，从法律上讲，你有半行为能力，或者你十八岁以后，从法律上讲你有，完全的行为能力的时候，这时候你的心，你的这个人的内心，就有善和有恶。为什么？是社会给你的、是家庭给你的、是学校给你的，但是你突然就把你放到，一个真空地带了，你可以自由的随心所欲，干自己所想干的事情，而在这种情况下，往往是恶，能够给你带来一种，愉悦的感觉。就说比如我拿，为什么有很多人，在文化革命中要打人，打人给你一种，掌控别人生命的感觉。我掌控你的生命，你得向我屈服，你不服我就打你，你行善能怎么样，你要是在这挺身而出，保护这个老师，你说不定还挨两下打，你说不定人家说你是，你是保守派、你是保皇党、所以你比较一看，所以特别在，那个十五六岁的年轻人，他又有一种叛逆的心理。他有一种冲动，有一种狂热，他跟老师又有一定的，和校领导有一些矛盾，他天天又想，搞阶级斗争。他认为这些学校领导，都是阶级敌人，所以我要有个反思，有个道歉。因为有很多人也不理解，说你，你在文化革命中，你是稳健派，你是策略派，你是很超脱的，你为什么道歉轮不到你啊。但是我说不是，因为我带头破坏了，学校的正常的秩序。所以后面那个打人啊、伤人啊，甚至自杀的现象才能够发生，那也可以这样讲，我是当了一个棋子，当了一个过河卒。不由自主，但是我们在那个时候，我是发自内心，我要干这个事。\n\n解说：虽然陈小鲁始终反对打人，但作为批判会的发起人，他富有不可推卸的责任，在麻木的狂热下，那些令人发指的暴行，以及面对暴行的沉默，都需要做出反思。批判会后的第三天，即1966年8月22日清晨，北京八中党支部书记华锦最终不忍折磨，上吊自杀。陈小鲁至今记得，自己赶到学校的教室时，华锦已是全身浮肿，一动不动地躺在地上。音乐堂的批斗会和华锦书记的自杀，给陈小鲁带来极大的震撼，此时对于这场轰轰烈烈的革命，陈小鲁的内心，越来越怀疑和不解。\n\n陈小鲁：21日、22日，我们书记自杀了，也是不堪虐待，学生批斗她的时候就打，我们在能够拉也拉不住，那么她自杀这两件事对我的刺激很大。\n\n陈鲁豫：那当您知道书记自杀之后，您的第一反应就觉得这个事情，已经过的厉害了？\n\n陈小鲁：太过了，人命关天嘛对吧。\n\n陈鲁豫：您当时会觉得害怕吗？\n\n陈小鲁：没有什么害怕，就觉得非常的，说不出来那种感觉，就觉得好像，天塌下来一样，怎么会死人呢对吧。而且你并没有，定她什么问题，确定性她反革命嘛，刚才我讲了，我们她有反动电台吗？她如果有个反动电台，死了我们也觉得，好像可以安心一点了，因为当时我们真的还没有现在这个思想，说是宪法对人身自由是保护的。\n\n陈小鲁：在文化大革命中我是十恶不赦的坏人\n\n陈鲁豫：那这时候想过，从这个运动当中能够撤出来，至少不要里面，裹的这么深？\n\n陈小鲁：还不是这样，当时就是说我们要，还是还有一种感觉，既然是这样，我们就需要来匡正一下子。那我想，红卫兵的武斗这么严重，怎么办？没人管、自己管，所以我就产品了，搞一个纠察队，所以就当时你看，二十二号她去世的，二十五号我们就成立，西城纠察队，这个实际上不是我一个人，这发起人是我，但是呢是一批人，都跟我有同样的想法。所以我一说，到哪一串联，一呼百应。三天之内就成立了，西城纠察队，我的道歉出来，很多人就说你这不够真诚，你西纠的问题你没有道歉，我就讲我说，西纠是我，对文革反思的开始。\n\n陈鲁豫：那是要制止暴力的一种做法？\n\n陈小鲁：西纠我是要制止暴力，这是第一，第二个。\n\n陈鲁豫：就出发点是好的，说我要制止暴力？\n\n解说：面对暴力，陈小鲁的西城纠察队，能否发挥作用？\n\n陈小鲁：有人就说，你们还不赶快去救，去救毛主席。\n\n解说：混乱当前，西纠又发生了怎样的转变？\n\n陈小鲁：就被捅死一个，然后就形成一个，大的报复活动。\n\n解说：从风云人物、辉煌青春。\n\n陈鲁豫：您说那天您是在，天安门城楼上？\n\n陈小鲁：我在天安门城楼上。\n\n解说：到谣言四起、危机四伏？\n\n陈小鲁：陈小鲁是杀人放火，无恶不作，携款逃跑。\n\n解说：陈毅之子陈小鲁，文革蜕变与反思，正在继续。\n\n解说：1966年8月25日，陈小鲁发起成立了，首都红卫兵西城区纠察队，这是文革期间，第一个跨校际的红卫兵组织。[西纠]最初组织了，北京西城区的31所中学，每个学校抽出十几人做纠察队员，想要制止抄家武斗。当时全国都在轰轰烈烈的大串联中，许多外地的红卫兵像潮水一样涌入北京。毛泽东先后八次，在天安门接见红卫兵。巨大的人员流动，给交通和北京的社会秩序，带来极大的压力。陈小鲁曾带领西纠的五百多人，在北京火车站日夜执勤，在天安门广场组织人员，维持秩序。\n\n陈小鲁：我和那个董良翮我们两个人，带着西纠的五百多名队员，在北京火车站维持秩序  ，因为当时毛主席接见红卫兵以后，外地的学生都要到北京来，都要见毛主席，那执勤应该是一直到，八次接见红卫兵结束。没有发生暴力事件，我们就维持秩序，另外我组织了一个，就是在首都，就在天安门广场，十月一日毛主席应该是第四次，还是第三次我记不得了，接见红卫兵。\n\n陈鲁豫：那次很混乱，是不是西纠打人了？\n\n陈小鲁：没有。\n\n陈鲁豫：没有吗？\n\n陈小鲁：那是八月三十一日，打人了八月三十一日，是个非常特殊的情况。因为就是当时，毛主席在天安门，突然毛主席决定，我要到群众中去。这一变化就不得了，临时开的路，结果开着车走的嘛对吧，走到要回到天安门的时候，在金水桥前，突然被群众围住了。不光是毛主席啊，包括什么贺老总、江青这些人，全部围在车上拥挤，大家都要冲到毛主席跟前去。我当时在天安门上我不知道，在观礼台上有我们西纠的人，那时候西纠正是怒放中天的那时候。有人就说你们还不赶快去，去救毛主席。这些人就红了眼了，就冲进去拿皮带打，就打出一条血路来，把这毛主席接过来了，那次西纠因为打人了，可能给毛主席，留下很不好的印象。\n\n陈鲁豫：那一次出发点不是为了要打人？是为了要保护毛泽东？\n\n陈小鲁：为了救毛主席，因为毛主席那时候是很危险。\n\n陈鲁豫：但是在某种程度，可能也触发了很多人内心的那种，你说是暴戾之气也好。\n\n陈小鲁：那后来没有，那次没有，之前有曾经发生过一个就是，当西纠去所谓破四旧的时候，被人捅了那人家也要反抗啊，你砸了我的家，人家家里人有血气，就被捅死一个，然后形成一个大的报复活动。红卫兵就好像，有点同仇敌忾的那个劲头。\n\n陈鲁豫：嗯，您说那天您是在天安门城楼上？\n\n陈小鲁：我在天安门城楼上。\n\n陈鲁豫：您是以什么因的身份，上天安门城楼？\n\n陈小鲁：我就是以西纠的身份啊。\n\n陈鲁豫：站在那？\n\n陈小鲁：因为你上天安门，都是经过筛选的。\n\n陈鲁豫：在那之前  你上过天安门城楼吗？\n\n陈小鲁：那是在过去过，就是在文化革命以前，那时候白天都是中央。毛主席他们检阅，到晚上看烟火的时候，是允许像我父亲。\n\n陈鲁豫：家属可以上去，现在回过头去看，那个时候站在天安门城楼上，感觉自己肯定很重要很光荣，是一个大的时代的一分子但是。\n\n陈小鲁：对，就我参与了这样一个活动，而且得到中央的肯定，要不然你怎么会上天安门呢。\n\n陈鲁豫：但您现在回过头去看，那时候的您是小孩，还是一个很成熟的人？\n\n陈小鲁：没有还是，就是青年，也不能说是小孩。\n\n陈鲁豫：但是有很多幼稚的地方在？\n\n陈小鲁：很幼稚对呀。\n\n解说：西纠最初得到了中央的支持，成为那个特殊年代，红极一时的特殊组织。二十岁的陈小鲁也因此成为，中学生里叱咤风云的人物。然而随着西纠，成员的壮大发展，暴力事件越来越难以控制，西纠渐渐偏离了陈小鲁最初的设想。有人认为西纠在当时起到了，稳定社会秩序、保护老干部的作用，但在很多人眼里，西纠成为了一个，红二代们为保护父母而成立的暴力组织。而此时，陈小鲁的内心也在发生着一些微妙的变化。\n\n陈鲁豫：这个阶段您内心会不，偶尔会有一些小的害怕，或者小的疑惑？\n\n陈小鲁：没有，疑惑是有的，害怕是没有的。\n\n陈鲁豫：疑惑是什么呢？\n\n陈小鲁：疑惑是做的对不对？含多事情发展的，和中央的就是他的，文化革命的决定，并不一致呀，那么多干部挨斗，座椅我们对文化革命，一个是从我们自身，就是红卫兵里头，我们同学里头，有些人打人，我们觉得这个要制止对吧。那么还有一个就是社会上，社会上当时大学生，在冲击这个部委，揪斗各部的部长，那么各部部长呢，就把西纠作为一个护身符，比如说是大学生造反派，冲到哪个部队，要揪斗的时候，他赶快通知西纠，西纠跑过去就，把大学生挡住，这就是使我们就觉得，这个到底怎么回事。这样我们很自然就，这个立场就由革变保了嘛。所以正因为如此，它就变成一个运动的，阻碍运动的因素。原来红卫兵是，大冲大哄大翁，起到了发动群众，这个的作用。那你现在就变成一个保守派了嘛，所以很快到了十二月份，我们就被解散了，当然它解散是抓住了，少数西纠他打人，像六中的西纠，设置了什么这个监牢。还打死了老师，那么现在我们也搞不清楚，那个是不是西纠。\n\n陈鲁豫：那在那个时候你，内心有那么多疑惑的话，只能自己消化吗？\n\n陈小鲁：只自己消化，所以这对我来讲，文化个民难以忘怀就是这样，就说文化各民是我第一次，自己做主去做，按照自己的意愿去做事情，不论是对或错，都是我的责任没有人来管你，而且我们学校，学生时候是比较单纯的，可是在文化革命中，我们参与了社会，参与了政治斗争的。所以这段经历，其实对所有的参与文化革命的人，都是难以忘怀的。不论你是做了好事也好，做了坏事也好，你是救了人也好，或者甚至杀人也好，都是不可。所以说，我认为反思这个事情，不是说你想反思，或你不想反思，人人都会反思的，实在是忘不了这件事情，至少我是这样。\n\n解说：对陈小鲁那代人来说，青春就这样与那场运动相遇，那段岁月里，无论他们是伤害、沉默还是被伤害，历史已然如此，青春被永远铭记。在后来无数个日子里，陈小鲁不断反思，他曾特意翻阅五四宪法，即1949年后的第一部宪法。他认为自己当年，违反了第八十九条，中华人民共和国公民的人身自由不受侵犯，任何公民、非经人民法院决定，或者人民检察院批准，不受逮捕。如今对于步入花甲之年的陈小鲁来说，他的道歉和坦诚不仅仅是一种，个人灵魂的净化，更希望将自己的反思，带给这个社会。\n\n陈小鲁：文革时候为什么，就是违宪因为我不懂得宪法，我们不知道这个，民主党派有它的地位。\n\n陈鲁豫：对，一切都是违宪的，那个时候。\n\n陈小鲁：我们不知道你不打老师，但是你批斗老师也是错误的，因为人格的尊严，是不能受到侮辱的。这是个很简单的道理，很多人来采访，我总有一个问题问他，我说你们是八零后、九零后、七零后，多数是八零后，我说那你们学过宪法没有，在你们中学和大学？有没有人跟你进，公民的权利和义务，都没有所以我认为，这是一个教育上的大的失误。因为在现在这样一个社会，你说什么我们应该达成什么样的共识，观念之间是很难达成共识的。我主张普世价值，你主张这个马列主义，或者他甚至是相信宗教，他们怎么达成一致啊？你只是一个法律的共识，宪法的共识，大家在维持一个社会秩序，在这个层面上，我们来解决问题。我们可以自由的讨论对吧，然后你保留自己的观点，求同存异嘛。而且有不同的思想的碰撞，才能够使社会前进。",
				"added": 1536432771
			}
		]
	},
	"comment_vote": {
		"11_1LXeK8iHk9NvuDtWcoR9MvkjnbGevuvcxa": 1,
		"1_1GhGgfVzTCn24zFDpdiNQFrRvFs7SJ6gTx": 1,
		"6_16CWdkXYYRnpct8GYS7GgD6yFcJHPXfMy8": 1
	}
}