{
	"file": {
		"Trip to Lisbon Portugal.mp4": {
			"title": "Trip to Lisbon Portugal",
			"type": "video",
			"description": "Lisbon is the capital and the largest city of Portugal, with a population of 552,700 within its administrative limits in an area of 100.05 km².\n\nIts urban area extends beyond the city's administrative limits with a population of around 2.7 million people, being the 11th-most populous urban area in the European Union.\n\nAbout 2.8 million people live in the Lisbon Metropolitan Area (which represents approximately 27% of the country's population).\n\nIt is continental Europe's westernmost capital city and the only one along the Atlantic coast. \nLisbon lies in the western Iberian Peninsula on the Atlantic Ocean and the River Tagus. \n\nThe westernmost areas of its metro area is the westernmost point of Continental Europe.\n\nWorld Travel TV (c) Copyright - This video has no third party content, We have exclusive rights to all materials, video, sound music, graphics and everything else.\n\n\n\n\nIf you like this content, Help Grow This Channel\n\nDonate...\n\nBitcoin: 14aciRMNfnKMgNpcBBzifoEGxZUbQgAJFK\n\n\n\nWorld Travel TV (c) Copyright",
			"is_featured": 0,
			"image_link": "https://i.ibb.co/ft5SKnH/snap-lisbon.png",
			"size": 115580173,
			"date_added": 1551634018
		},
		"Alvor Algarve holidays.mp4": {
			"title": "Alvor Algarve holidays",
			"type": "video",
			"description": "Alvor was founded in 436 by the Carthaginian General Aníbal Barca as a commercial port, which he named Portus Hannibalis.\n\nThe settlement grew around the sea, near the place called Vila Velha, where a Celtic castro dominated the river mouth during the Iron Age.\n\nIt is likely that it was the Roman colony of Ipses, which was authorized to mint currency, and was absorbed during the Roman era.\n\nTaken by the Moors in 716, the settlement began to be referred to as Albur, and gained an impressive castle, with only vestiges remaining.\n\n\nIf you like this content, Help Grow This Channel\n\nDonate...\n\nBitcoin: 14aciRMNfnKMgNpcBBzifoEGxZUbQgAJFK\n\n\n\nWorld Travel TV (c) Copyright",
			"is_featured": 0,
			"image_link": "https://i.ibb.co/BsfsrRY/alvor-algarve.png",
			"size": 72363896,
			"date_added": 1551624981
		},
		"Bad Sackingen Trip2C Germany.mp4": {
			"title": "Bad Sackingen Trip  to Germany",
			"type": "video",
			"description": "Bad Säckingen is located in the very southwest of Germany next to the Swiss border on the river Rhine. \n\n\nIf you like this content, Help Grow This Channel\n\nDonate...\n\nBitcoin: 14aciRMNfnKMgNpcBBzifoEGxZUbQgAJFK\n\n\n\nWorld Travel TV (c) Copyright",
			"is_featured": 0,
			"image_link": "https://i.ibb.co/pK2JCcM/snap-1.jpg",
			"size": 35731809,
			"date_added": 1551624995
		},
		"Carvoeiro 28Lagoa29 and Grottos Portugal holidays.mp4": {
			"title": "Carvoeiro  Lagoa and Grottos Portugal holidays",
			"type": "video",
			"description": "Carvoeiro (Lagoa) and Grottos holidays\n\nCarvoeiro, or more commonly Praia de Carvoeiro, is a town and a former civil parish in the municipality (concelho) of Lagoa, Algarve, Portugal. In 2013, the parish merged into the new parish Lagoa e Carvoeiro. \n\nThe population in 2011 was in an area of It is located about 5 kilometres south of Lagoa.\n\n\n\nIf you like this content, Help Grow This Channel\n\nDonate...\n\nBitcoin: 14aciRMNfnKMgNpcBBzifoEGxZUbQgAJFK\n\n\n\nWorld Travel TV (c) Copyright",
			"is_featured": 0,
			"image_link": "https://i.ibb.co/vQGPNBD/snap-2.png",
			"size": 71615629,
			"date_added": 1551625010
		},
		"Lagos2C Algarve2C Portugal Dezember.mp4": {
			"title": "Lagos Algarve Portugal Dezember",
			"type": "video",
			"description": "Lagos, Algarve Portugal Dezember\n\nDiscoveries, remains one of the most attractive tourist centers of the Algarve with beaches and heritage of exception and nightlife of great dynamism. \nCurrently, most of the population lives scattered in the territory of the county, outside the historic center of the city, working mainly in the service and tourism industry. \n\nThe historic center is almost all pedestrian, providing a wide range of shops, restaurants, bars or cafes.\n\n\n\nIf you like this content, Help Grow This Channel\n\nDonate...\n\nBitcoin: 14aciRMNfnKMgNpcBBzifoEGxZUbQgAJFK\n\n\n\nWorld Travel TV (c) Copyright",
			"is_featured": 0,
			"image_link": "https://i.ibb.co/K2n6nY6/lagos-algarve.png",
			"size": 73606551,
			"date_added": 1551625040
		},
		"Lucerne Switzerland Trip.mp4": {
			"title": "Lucerne Switzerland Trip",
			"type": "video",
			"description": "Lucerne is a city in central Switzerland, in the German-speaking portion of the country. Lucerne is the capital of the Canton of Lucerne and the capital of the district of the same name. \n\nWith a population of about 80,501 people, Lucerne is the most populous city in Central Switzerland, and a nexus of transportation, telecommunications, and government of this region. \n\nThe city's urban area consists of 17 cities and towns located in three different cantons with an overall population of about 250,000 people.\n\n\n\n\nIf you like this content, Help Grow This Channel\n\nDonate...\n\nBitcoin: 14aciRMNfnKMgNpcBBzifoEGxZUbQgAJFK\n\n\n\nWorld Travel TV (c) Copyright",
			"is_featured": 0,
			"image_link": "https://i.ibb.co/4mQV546/snap-Luzern.jpg",
			"size": 54218884,
			"date_added": 1551625117
		},
		"PORTUGAL spectacular coast of southwest Algarve.mp4": {
			"title": "PORTUGAL spectacular coast of southwest Algarve",
			"type": "video",
			"description": "PORTUGAL spectacular coast of southwest Algarve...\n \n\n\n\nIf you like this content, Help Grow This Channel\n\nDonate...\n\nBitcoin: 14aciRMNfnKMgNpcBBzifoEGxZUbQgAJFK\n\n\n\nWorld Travel TV (c) Copyright",
			"is_featured": 0,
			"image_link": "https://i.ibb.co/XZn1RrJ/Unbenannt-algarve.png",
			"size": 17301174,
			"date_added": 1551625130
		},
		"Travel Buenos Aires - Capital of Argentina.mp4": {
			"title": "Travel Buenos Aires - Capital of Argentina",
			"type": "video",
			"description": "Buenos Aires is the capital and largest city of Argentina, and the second-largest metropolitan area in South America. It is located on the western shore of the estuary of the Río de la Plata, on the continent's southeastern coast.\n\nThe Greater Buenos Aires conurbation, which also includes several Buenos Aires Province districts, constitutes the third-largest conurbation in Latin America, with a population of around fifteen and a half million.\n\n\nWorld Travel TV (c) Copyright - This video has no third party content, We have exclusive rights to all materials, video, sound music, graphics and everything else.\n\n\n\n\nIf you like this content, Help Grow This Channel\n\nDonate...\n\nBitcoin: 14aciRMNfnKMgNpcBBzifoEGxZUbQgAJFK\n\n\n\nWorld Travel TV (c) Copyright",
			"is_featured": 0,
			"image_link": "https://i.ibb.co/xFHwwnC/Argentina-buenos-aires.png",
			"size": 28113476,
			"date_added": 1551625145
		},
		"Travel Taboga Island - Panama - holiday.mp4": {
			"title": "Travel Taboga Island - Panama - holiday",
			"type": "video",
			"description": "Taboga Island , also known as the -Island of Flowers-, is a volcanic island in the Gulf of Panama. It is a tourist destination, about 20 km from Panama City, Panama.\n\nTourism is the major economic activity on the island, although fishing and agriculture are also practiced. The island has become a popular touristic attraction due to its beautiful natural areas and its proximity to Panama City.  Daily ferries link the city to the island, most of them departing from the Amador Causeway.\n\nAside from beaches, the island has trails for hiking to its highest points, including Cerro Vigía and Cerro de la Cruz. The latter is a hill located south of the town, topped with a huge cross.\n\n Boat tours for fishing, whale watching, snorkeling, and sightseeing are available, as well as walking and nature tours.\n\nTaboga Island has small hotels and restaurants Calaloo Beach Fishbar & Grill on Playa Honda just 2 minutes from the pier, Agua Sol Villa, located on the water with a private beach entry from the hotels ocean deck; Ocean Rock Cafe and bar, ocean view from their hillside-rainforest location B and B Hotel Cerrito Tropical and Restaurant; Mundi's; and Hotel Vereda Tropical.\n\n All four have restaurants. Tours for hiking, nature and village walks, whale watching, fishing, and boating can be organized through Agua Sol Villa and B and B Hotel Cerrito Tropical.\n\n There is also a private vacation house rental, Tres Terrazas, for nightly or weekly stays.\n\n\n\nIf you like this content, Help Grow This Channel\n\nDonate...\n\nBitcoin: 14aciRMNfnKMgNpcBBzifoEGxZUbQgAJFK\n\n\n\nWorld Travel TV (c) Copyright",
			"is_featured": 0,
			"image_link": "https://i.ibb.co/d6MN0Wn/snap-panama.png",
			"size": 23632952,
			"date_added": 1551625165
		},
		"Trip To Konstanz - Germany.mp4": {
			"title": "Trip To Konstanz - Germany",
			"type": "video",
			"description": "Trip To Konstanz - Germany\n\nKonstanz is situated on Lake Constance (the Bodensee in German).\n \nThe Rhine river, which starts in the Swiss Alps, passes through Lake Constance and leaves it, considerably larger, by flowing under a bridge connecting the two parts of the city. \n\nNorth of the river lies the larger part of the city with residential areas, industrial estates, and the University of Konstanz; while south of the river is the old town, which houses the administrative centre and shopping facilities in addition to the Hochschule or the University of Applied Sciences.\n\n\n\n\nIf you like this content, Help Grow This Channel\n\nDonate...\n\nBitcoin: 14aciRMNfnKMgNpcBBzifoEGxZUbQgAJFK\n\n\n\nWorld Travel TV (c) Copyright\n",
			"is_featured": 0,
			"image_link": "https://i.imgflip.com/2v3mqm.gif",
			"size": 28672194,
			"date_added": 1551625187
		},
		"Trip To Ponta da Piedade - Lagos - Algarve - Portugal.mp4": {
			"title": "Trip To Ponta da Piedade - Lagos - Algarve - Portugal",
			"type": "video",
			"description": "\nThe Ponta da Piedade  is a tourist natural monument of Lagos in the Algarve in Portugal. \n\nIt is made up of several rock formations of the cliff type, with up to 20 meters approximately, one of the sights of greatest interest photographic region. \n\nOn site, it is possible to visit the various existing caves guaranteed a pleasant and unique tourist experience.\n\nAccess by land: from the Ponta da Piedade Lighthouse and then walk through stairs carved into the slopes.\n\nAccess by sea: the Lagos marina tours are offered to the Ponta da Piedade in sailing or small fishing boats.\n\n\nWorld Travel TV (c) Copyright\n\n\n\nIf you like this content, Help Grow This Channel\n\nDonate...\n\nBitcoin: 14aciRMNfnKMgNpcBBzifoEGxZUbQgAJFK\n\n\n\nWorld Travel TV (c) Copyright",
			"is_featured": 0,
			"image_link": "https://i.ibb.co/CQDrLNr/Ponta-da-piadade-lagos.png",
			"size": 57147576,
			"date_added": 1551625201
		},
		"Trip To Praia Da Rocha - Portimao.mp4": {
			"title": "Trip To Praia Da Rocha - Portimao",
			"type": "video",
			"description": "Praia da Rocha is a beach in Portimão, Algarve (Portugal).\n\nThis beach has a large areal extent, a total area of about 146,000 square meters, over 1.5 km of coastline. Along the beach stands the Fortress of Santa Catarina, built in the seventeenth century to ensure the defense of the Arade River bar.\n\nThe beach owes its name to the rocks that lie between the sand and the sea.\n\nIt is one of the most famous in the Algarve, if not the entire country. Every year, during the summer, the beach is filled with from all over the world tourists and, despite its large size, it is rare not to be crowded with people.\n\nIn recent years, it has received Mundialito Beach Soccer, played in a stadium built for that purpose and has capacity for 3000 people.\n\nAlong the beach, there is a plurality of restaurants and bars that attracts many tourists, both during the day and night.\n\n\n\n\nIf you like this content, Help Grow This Channel\n\nDonate...\n\nBitcoin: 14aciRMNfnKMgNpcBBzifoEGxZUbQgAJFK\n\n\n\nWorld Travel TV (c) Copyright",
			"is_featured": 0,
			"image_link": "https://i.ibb.co/DgsC8Jm/snap-portimao.jpg",
			"size": 26406816,
			"date_added": 1551625214
		},
		"1551625229-Trip to Rome - Italy.mp4": {
			"title": "Trip to Rome - Italy",
			"type": "video",
			"description": "Rome is a city and special comune (named Roma Capitale) in Italy. \n\nRome is the capital of Italy and of the Lazio region. With 2.9 million residents in 1,285 km2 (496.1 sq mi), it is also the country's largest and most populated comune and fourth-most populous city in the European Union by population within city limits. The Metropolitan City of Rome has a population of 4.3 million residents.\n\n The city is located in the central-western portion of the Italian Peninsula, within Lazio, along the shores of Tiber river. \n\nThe Vatican City is an independent country geographically located within the city boundaries of Rome, the only existing example of a country within a city: for this reason Rome has been often defined as capital of two states.\n\n\n\nIf you like this content, Help Grow This Channel\n\nDonate...\n\nBitcoin: 14aciRMNfnKMgNpcBBzifoEGxZUbQgAJFK\n\n\n\nWorld Travel TV (c) Copyright",
			"is_featured": 0,
			"image_link": "https://i.ibb.co/HphrPWq/snap-Roma.jpg",
			"size": 136425194,
			"date_added": 1551625235
		},
		"Winter Albufeira - Algarve - Portugal.mp4": {
			"title": "Winter Albufeira - Algarve - Portugal",
			"type": "video",
			"description": "Albufeira (Portuguese pronunciation:( listen)) is a city, seat and municipality in the district of Faro, in the southernmost Portuguese region of the Algarve. \n\nThe municipality population in 2011 was 40,828, in an area of 140.66 km².\nThe city proper had a population of 13,646 in 2001. \nIt is 250 kilometres (160 mi) from Lisbon, and is within close proximity of Paderne Castle. \n\nLagos is located 30 kilometres (19 mi) to the west, and Faro 45 kilometres (28 mi) to the south-east. A tourist destination (due to its coastal conditions), Albufeira expands to approximately 300,000 residents during the summer and during New Year celebrations, owing to the number of hotels and lodgings in the district, that includes marina facilities, golf courses, restaurants and bar for the annual flood of visitors.\n\n\n\n\n\nIf you like this content, Help Grow This Channel\n\nDonate...\n\nBitcoin: 14aciRMNfnKMgNpcBBzifoEGxZUbQgAJFK\n\n\n\nWorld Travel TV (c) Copyright",
			"is_featured": 0,
			"image_link": "https://i.ibb.co/KVDX1y3/snap-albufeira.jpg",
			"size": 35205262,
			"date_added": 1551625248
		},
		"Winter Portimao Algarve Portugal.mp4": {
			"title": "Winter Portimao Algarve Portugal",
			"type": "video",
			"description": "Portimão is a Portuguese city in the district of Faro, the region and the Algarve sub-region, with about 40,000 inhabitants.The city center is located about 2 km from the sea and is an important center of fishing and tourism .\n\nIt is the seat of a municipality with 182.06 km ²  and 55 614 inhabitants (2011), divided into three parishes. \n\nThe city is bordered to the north by the municipality of Monchique, east by Silves and Lagoa and west of Lagos; south, it has coastline on the Atlantic Ocean.\n\n\nWorld Travel TV (c) Copyright - This video has no third party content, We have exclusive rights to all materials, video, sound music, graphics and everything else.\n\n\nIf you like this content, Help Grow This Channel\n\nDonate...\n\nBitcoin: 14aciRMNfnKMgNpcBBzifoEGxZUbQgAJFK\n\n\n\nWorld Travel TV (c) Copyright",
			"is_featured": 0,
			"image_link": "https://i.ibb.co/W5WmBL6/winter-portim-o.png",
			"size": 64379067,
			"date_added": 1551625299
		},
		"Zurich Switzerland Trip.mp4": {
			"title": "Zurich Switzerland Trip",
			"type": "video",
			"description": "Zurich Switzerland Trip\nZurich  is the largest city in Switzerland and the capital of the canton of Zürich.\n\nIt is located in north-central Switzerland at the northwestern tip of Lake Zürich. \n\n\nThe municipality has approximately inhabitants, the urban agglomeration 1.315 million, and the Zurich metropolitan area 1.83 million. \nZürich is a hub for railways, roads, and air traffic. \n\nBoth Zürich Airport and railway station are the largest and busiest in the country.\n\nhttps://www.zuerich.com/de\n\nZürich is sometimes referred to as -Downtown Switzerland- for publicity reasons...\n\n\nIf you like this content, Help Grow This Channel\n\nDonate...\n\nBitcoin: 14aciRMNfnKMgNpcBBzifoEGxZUbQgAJFK\n\n\n\nWorld Travel TV (c) Copyright",
			"is_featured": 0,
			"image_link": "https://i.ibb.co/qmfChMT/z-rich.png",
			"size": 76763327,
			"date_added": 1551625317
		},
		"Travel Quepos e Manuel Antonio - Costa Rica.mp4": {
			"title": "Travel Quepos e Manuel Antonio - Costa Rica",
			"type": "video",
			"description": "Quepos is a district and the capital of Aguirre canton in Puntarenas Province, Costa Rica.\n\nThe district has a population of about 22,000 people\n\nThe town is about 60 km. south from Costa Rica's capital, San José, but is 157 km from that city by road if going through the localities of Atenas, Orotina and Tárcoles.\n\nQuepos is the gateway to Manuel Antonio National Park. \n\nThe city is very tourism-oriented, having many bars and restaurants and a vivacious night-life.\n\nThe town is named for the native Quepo Indians who inhabited the place in the colonial era.\n\nQuepos is well known thanks to being the gateway to a popular National Park and beaches in Costa Rica. \n\nSeveral years ago the country's park service imposed limits on the number of visitors to the park (600 per day, and it's closed on Mondays).\n\n\n\n\nIf you like this content, Help Grow This Channel\n\nDonate...\n\nBitcoin: 14aciRMNfnKMgNpcBBzifoEGxZUbQgAJFK\n\n\n\nWorld Travel TV (c) Copyright",
			"is_featured": 0,
			"image_link": "https://i.ibb.co/h8PLGr5/Costa-Rica-snap.png",
			"size": 25682269,
			"date_added": 1552140086
		},
		"Das 2. Geld System - Die bisher nie gesagte Wahrheit.mp4": {
			"title": "Das 2. Geld System - Die bisher nie gesagte Wahrheit",
			"type": "video",
			"description": "Unser Geldsystem funktioniert nur durch Täuschung und Betrug - hier einfach erklärt!\n\nDownload:\n \nhttps://www.docdroid.net/k7WHyYU/einigkeit-recht-und-freiheit-download-final.pdf",
			"is_featured": 0,
			"image_link": "https://i.ibb.co/nrXqTsC/Unbenannt-geld.png",
			"size": 278251952,
			"date_added": 1552750989
		}
	},
	"comment": {
		"1551625317_1NN4hF6mNXEQmEzmvvxLyr2nWCqBhSrdww": [
			{
				"body": "Zurich Switzerland Trip Zurich  is the largest city in Switzerland and the capital of the canton of Zürich.  It is located in north-central Switzerland at the northwestern tip of Lake Zürich.   The municipality has approximately inhabitants, the urban agglomeration 1.315 million, and the Zurich metropolitan area 1.83 million. Zürich is a hub for railways, roads, and air traffic.   Both Zürich Airport and railway station are the largest and busiest in the country.  https://www.zuerich.com/de  Zürich is sometimes referred to as -Downtown Switzerland- for publicity reasons...  World Travel TV (c) Copyright ",
				"date_added": 1551625463
			},
			{
				"body": "Zurich Switzerland Trip Zurich  is the largest city in Switzerland and the capital of the canton of Zürich.  It is located in north-central Switzerland at the northwestern tip of Lake Zürich.   The municipality has approximately inhabitants, the urban agglomeration 1.315 million, and the Zurich metropolitan area 1.83 million. Zürich is a hub for railways, roads, and air traffic.   Both Zürich Airport and railway station are the largest and busiest in the country.  https://www.zuerich.com/de  Zürich is sometimes referred to as -Downtown Switzerland- for publicity reasons...  World Travel TV (c) Copyright ",
				"date_added": 1551625470
			}
		]
	}
}