{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1576309972_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	},
	"next_comment_id": 9,
	"comment": {
		"1575850577_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [
			{
				"comment_id": 1,
				"body": "Big kopy kate 2 now also supports mp3, mkv files.\nAnd upload files up to 15gb\nI still can not solve the limit of + - 2mega in the file data.json, because if I increase the limit of it, users end up not seeing the account data that have many videos, so I decided to keep it anyway.\n\nBut I'm studying to add the option to block channels, playlists and support for more than one audio and subtitles.\n\n=======================================\n\noriginal pt-br\n\nBig kopy kate 2 suporta também agora mp3, arquivos mkv.\nE envio de arquivos de até 15gb\nainda não consegui resolver o limite de +- 2mega no arquivo data.json, pois se eu aumentar o limite do mesmo, os usuários acabam não vendo os dados de contas que tenham muitos videos, dai resolvi manter ainda assim.\n\nMas estou estudando pra adicionar a opção de poder bloquear canais, playlists e suporte a mais de um audio e legendas.\n\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD",
				"added": 1575938676
			},
			{
				"comment_id": 2,
				"body": "> [styromaniac](#comment_1449_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Your site contains terrorist propaganda: ISIS_NASHEED1_Qariban.mp3\n\nYou're on thin ice.\n\nI warned that I will not censor NOTHING, NOBODY, I am seeing how to implement the block function directly on the site for EACH block the channel you find, bad, but I DIRECTLY WILL NOT remove ANYTHING.\n\nThere is no half freedom and no problem, I delete my private key to access the site administration and that's it, no one will be able to remove anyone's content or force me into it.\n\nTHERE IS NO HALF FREEDOM.\n\nFound something bad on some channel, block the person or channel.\n\n\n==================================================\n\noriginal pt-br\n\neu avisei que não vou censurar NADA , NEM NINGUÉM, estou vendo como implementar a função de block diretamente no site para CADA um bloquear o canal que achar, ruim, mas EU DIRETAMENTE , NÃO VOU remover NADA.\n\nNão existe meia liberdade e qualquer problema, eu deleto minha private key de acesso a adminstração do site e pronto, ninguém vai poder remover conteudo de ninguém e nem me forçar a isto.\n\nNÃO EXISTE MEIA LIBERDADE.\n\nAchou algo ruim em algum canal, bloquei a pessoa ou canal.",
				"added": 1576400504
			},
			{
				"comment_id": 3,
				"body": "> [styromaniac](#comment_1447_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I've seen you mention that you won't moderate content at all. I'm not sure that's good for new users and yourself. It could lead to trouble. If you still refuse and I see an illegal thumbnail or a bunch of illegal porn that could accidentally be clicked, I think that eventually it will have to be on a blocklist.\n\nyes I understand, but my policy is not to block ANYONE, zeronet already has an individual block function, each one that takes care of what it thinks bad because if I worry about every nonsense that someone posts, now would not be a problem, but more forward I would have a lot of work and do nothing else in life and or could at some point be subjectively removing some content, and I don't want it.\n\nSo I decided to follow the REAL principle of freedom, each one who takes care of their space, the site is not mine is the people who post or better each channel, it is a SEPARATE space, which I do not want and I will not interfere.\n\nThe most I will interfere is to add FUNCTIONS you think are necessary and GET on the site.\n\nFor example the next function I want to add is to allow the person to block someone, as we have in zerome and zerotalk, this is important in my opinion, because they wanted to be flooding or posting shit, I can block the user IN MY ACCOUNT, if others want to see the terrorist nonsense and so on, I don't care.\n\nOther than the police will be able to investigate and find the guy, people might think it's not possible to find it, but ALWAYS these smart-assed errs and that's how the police catch them, but it's not my problem.\n\nPeople have to take responsibility for their actions, I did nothing and anything that any authority THINK about to piss me off my access to the simple site like that, outside of the cloning function is working, just someone cloning and adding the files downloaded on other cloned site, simple.\n\nThe zeronet is made to be unstoppable and as far as I've seen it seems to work.\n\n\n=================================================\noriginal pt-br\n\nsim eu entendo, mas minha politica é não bloquear NINGUÉM, a zeronet já tem função de block INDIVIDUAL, cada um que cuide do que achar ruim pois SE eu for me preocupar com cada bobagem que alguém postar, agora não seria um problema, mas mais para frente eu teria muito trabalho e não faria mais nada da vida e ou poderia em algum momento estar removendo algum conteudo subjetivamente, e não quero isto.\n\nEntão resolvi seguir o REAL principio da liberdade, cada um que cuide do seu espaço, o site não é meu é das pessoas que postam ou melhor cada canal, é um espaço SEPARADO, que não quero e não vou interferir.\n\nO máximo que vou interferir é adicionar FUNÇÕES que achar necessárias e CONSEGUIR no site.\n\nPor exemplo a próxima função quer quero adicionar é a de permitir a pessoa bloquear alguém, como temos no zerome e no zerotalk, isto é importante na minha opinião, pois queriam ficar fazendo flood ou postando merda, eu posso bloquear o usuário NA MINHA CONTA, se os outros querem ver as bobagens de terroristas e etc, não ligo.\n\nFora que a policia vai poder investigar e achar o cara, as pessoas podem achar que não é possivel achar, mas SEMPRE estes metidos a espertos erram e é assim, que a policia pega eles, mas  não é problema meu.\n\nAs pessoas tem que se responsabilizar por seus atos, eu não fiz nada e qualquer coisa que alguma autoridade PENSAR em me encher o saco deleto meu acesso ao site simples assim, fora que a função de clonagem está funcionando,basta alguém clonar e adicionar os arquivos baixados em outros site clonado, simples.\n\nA zeronet é feita para ser imparavel e até onde vi, parece funcionar.",
				"added": 1576402368
			},
			{
				"comment_id": 4,
				"body": "> [randomshits](#comment_294_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): to be fair, you should give the same warning / consideration to the original KopyKate site. [...]\n\ngood idea to change the report button to block button, I think THIS, maybe it's easier for me to do it, I was trying these days to create a new button called block, but as I don't know javascript and etc, I was studying to understand the whole process.\n\nThanks for the idea, had thought of it, and from what I saw, this report button is basically useless, so it would be a good, modify it and leave it as a block, let's see what I can do: P\n\n==============================================\noriginal pt-br\n\nboa idéia trocar o botão report, para botão block, acho que ISTO, talvez seja mais facil de eu conseguir fazer, eu estava tentando estes dias criar um novo botão chamado block, mas como não sei javascript e etc, estava estudando para poder entender o processo todo.\n\nObrigado pela idéia, tinha pensado nela, e pelo que vi, este botão report é basicamente inutil , então seria uma boa, modificar ele e deixar como sendo block, vamos ver o que consigo fazer :P",
				"added": 1576445285
			}
		],
		"1575616298_1NHiaCL2VFiEeiQZcaR3LMnJ53tkepwY9T": [
			{
				"comment_id": 5,
				"body": "The Lord of the Rings - The Two Towers (O Senhor dos Anéis - As Duas Torres) 2002 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1576467362_1D3gPBmPyX2SbVovCxevZ1sdbFHT6M9pH3",
				"added": 1576468195
			},
			{
				"comment_id": 6,
				"body": "The Lord of the Rings - The Fellowship of the Ring (O Senhor dos Anéis - A Sociedade do Anel) 2001 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1576400617_1D3gPBmPyX2SbVovCxevZ1sdbFHT6M9pH3",
				"added": 1576468209
			},
			{
				"comment_id": 7,
				"body": "Escape from Alcatraz (Alcatraz Fuga Impossível) 1979 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1576502890_1D3gPBmPyX2SbVovCxevZ1sdbFHT6M9pH3",
				"added": 1576503073
			},
			{
				"comment_id": 8,
				"body": "02 - Aliens, o Resgate 1986 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1576534043_1D3gPBmPyX2SbVovCxevZ1sdbFHT6M9pH3",
				"added": 1576534308
			}
		]
	},
	"comment_vote": {
		"467_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"47_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": 1,
		"1451_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"294_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1
	}
}