{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1627296188,
			"title": "Zeronet compatibility with v3 tor hidden service coming soon!",
			"body": "Actually a Dev Is working with me to that project and we are almost ready for the public beta testing! A v3 tracker Is now Active and in our tests v3 connections see.s more stabile and v3 trackers find also many more v 2 peers! Stay tuned! Zeronet Will not die! 😊",
			"added": 1627296187
		},
		{
			"topic_id": 1627703143,
			"title": "Zeronet v3 tor hidden service support Is out!",
			"body": "https://git.disroot.org/anonymoose/ZeroNet_OnionV3\n\nThis patch scripts are Linux onlybbut you can apply this manually to all platforms following the manual instructions included.\n\nYou can control the patch working and v3 keys in http://127.0.0.1:43110/Stats",
			"added": 1627703141
		},
		{
			"topic_id": 1629104216,
			"title": "Styromaniac how you auto-shared your v3 tracker?",
			"body": "I see your v3 tracker in my tracker's list but i never added It before? How you shared your tracker with the other nodes in the network?",
			"added": 1629104213
		},
		{
			"topic_id": 1630381630,
			"title": "New v3 trackers!",
			"body": "Please add to your client!\nzero://k5w77dozo3hy5zualyhni6vrh73iwfkaofa64abbilwyhhd3wgenbjqd.onion:15441",
			"added": 1630381626
		}
	],
	"topic_vote": {},
	"next_comment_id": 37,
	"comment": {
		"1627296188_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj": [
			{
				"comment_id": 1,
				"body": "> [xcape2net](#comment_909_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Will nofish add your code to ZeroNet, or will it be in the form of a plugin?\n\nActually this Is a patch that change some files...anyway It Will be open source and because of this nofish can use the code in the official release",
				"added": 1627422295
			},
			{
				"comment_id": 2,
				"body": "> [xcape2net](#comment_910_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): But will he use the code in the official release?\n\nI dont know i cannot ready his mind...anyway we Will have a working zeronet post v3 update (maybevwe Will fork itvif nofish dont update)",
				"added": 1627541679
			},
			{
				"comment_id": 3,
				"body": "http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1627703143_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj/Zeronet+v3+tor+hidden+service+supporto+Is+out",
				"added": 1627703242
			}
		],
		"1627703143_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj": [
			{
				"comment_id": 4,
				"body": "> [styromaniac](#comment_3171_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I'll use it if it's pre-patched. Otherwise I might not.\n\nI Will add this patch to my zeroseed pack. Give me some time! 😊",
				"added": 1627759854
			},
			{
				"comment_id": 8,
				"body": "> [styromaniac](#comment_3178_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Is Nofish responding to a pull request for this patch? Is there even a pull request?\n\nActually no...☹️",
				"added": 1627943547
			}
		],
		"1627754943_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne": [
			{
				"comment_id": 5,
				"body": "I suggest to keep zeronet in an encrypted veracrypt volume and using tor by a live USB linux dietro or tails",
				"added": 1627759973
			}
		],
		"1627752792_1QEtdbzwqJKCF45fTsC5hUjELk3HXBihpa": [
			{
				"comment_id": 6,
				"body": "Why dont create a new zerotalk for your language? I Will add It on my pack",
				"added": 1627760051
			}
		],
		"1627915015_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg": [
			{
				"comment_id": 7,
				"body": "I'm planning a new release of my pack. I Will include by default all zerotalk languages",
				"added": 1627942566
			}
		],
		"1628310919_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 9,
				"body": "Yes. Ite a good idea of nofish Will remain offline. Se Need an urgentvsupport for v3 tor hidden services",
				"added": 1628444610
			}
		],
		"1628269401_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 10,
				"body": "V3 trackers working with v2 clients for now because they include also V2 support. From September 2021 Only v3 onion trackers Will work",
				"added": 1628444712
			},
			{
				"comment_id": 11,
				"body": "> [zeroseed6e](#comment_10_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj): V3 trackers working with v2 clients for now because they include also V2 support. From September 2021 Only v3 onion trackers Will work\n\nWe must use this temporary V2 V3 compatibility ti migrate tor Only zites to v3 nodes before its too late",
				"added": 1628444796
			},
			{
				"comment_id": 15,
				"body": "> [ssdifnskdjfnsdjk](#comment_1071_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): my562dx.....onion is found among shared trackers on my /Stats page.. so maybe it was obtained automatically by zeronet, i am unsure which role in this plays that my ZN is V3 patched and i have added Anonymoose's tracker earlier. [...]\n\nThe trackers are auto shared between nodes and v3 trackers Actually can connect to V2 nodes. You can apply the patch roba Linux installation Simply coping It in the /core folder and running the install.sh . We are working on Windows instalker and soon my zeroseed pack Will be Launched already patched",
				"added": 1628667991
			},
			{
				"comment_id": 18,
				"body": "> [styromaniac](#comment_3203_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Please get your spelling right in the installer. I see you make overlooked typos or mistakes in your comments.\n\nFortunately i dont write nothing in the installer! 😁",
				"added": 1628761291
			}
		],
		"1628411219_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 12,
				"body": "Clearnet Is actively blocking zeronet ..from big social to Little sites because of zeronet Will grow their business Will fail! ☹️",
				"added": 1628447180
			},
			{
				"comment_id": 13,
				"body": "> [driud2](#comment_14_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x): Clear net, does not block; because it is a different system. This internet has nothing to do with that internet.It can't be blocked. He's working on another level. That's why he has the advantage.\n\nWith \"block\" i mean that if you talk about zeronet on most forum or social Networks you Will be blocked in these clearnet sites for spam or others reasons",
				"added": 1628480870
			},
			{
				"comment_id": 16,
				"body": "> [ozaichirah](#comment_18_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg): Yeah, I think it is important to do something about it.\n\nTotally agree! Any idea?",
				"added": 1628716393
			}
		],
		"1628479388_14RgUjbLrwrnCSz1tbWorM5dtsY6eSAjLa": [
			{
				"comment_id": 14,
				"body": "For me Is a false positive. This a db file generated by the software to list zites content not an executable",
				"added": 1628480963
			}
		],
		"1628591661_1NV3qFKgLf7Nnx7L5txkzsg13nuj3teVqC": [
			{
				"comment_id": 17,
				"body": "> [jackzeng6666](#comment_31_1AmXimBQuPemuoTM9NFYg9Mn5YY6HomhAm): You can't. Youtube needs to store a lot videos, if you want to connect, that needs a people download all youtube then seed it. I think nobody wants to do that.\n\nOn P2P Networks Only good content Will have seeds and Will stay online...a new distributed YouTube Is possible! For example look at galactichan",
				"added": 1628716495
			}
		],
		"1628752234_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 19,
				"body": "> [gitcenter](#comment_1493_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): For me ZeroNet was, so to say, good while it lasted. [...]\n\nI disagree when you compare zeronet to a free file storage! For me keeping proxy seedboxes and trackers online cost Money! These files are on zeronet and not on gcloud or mega for a reason! (Mega offer a big file storage for free). Maybe there Is someone that consider important the decentralization for its good purposes that you illustrated and more! Lets begin from Them! 😊 When clearnet Will become a censored Place for everyone people Will have a safe Place to express themselfes! 😊 For now we are few...but dont discourage...😊",
				"added": 1628836313
			},
			{
				"comment_id": 21,
				"body": "> [seidoken](#comment_20_1Pxg9q2iUdQkbwgT459ArjQ12mpXN8cyEB): I used to advertise zeronet on various sites but I kept getting banned for it.\n\nSame",
				"added": 1628914623
			},
			{
				"comment_id": 22,
				"body": "I'm publishing zeronet in my clearnet blog\n Https://antonellogalati.com",
				"added": 1628914738
			},
			{
				"comment_id": 23,
				"body": "> [gitcenter](#comment_1511_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): 0net-preview is just a ZeroNet proxy. There are many proxies online, and it's very easy to start your own proxy. It supports everything a local ZeroNet node does, including ZeroID.\n\nI dont include zeroid in the proxy ad the ability to add zites out of my control to prevent the upload of illegal content that can pose a risk for proxy's survival",
				"added": 1628999063
			}
		],
		"1628848642_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg": [
			{
				"comment_id": 20,
				"body": "In my opinion Actually there isnt any valido alternative for decentralized hosting (Easy to use, anonymous and without big bugs)",
				"added": 1628914578
			},
			{
				"comment_id": 25,
				"body": "> [ozaichirah](#comment_21_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg): I am not saying an alternative as an other technology, I am asking for different implementations for the same core principles, something like I2P or IPFS.\n\nIn my opinion i2p and ipfs are not Easy to use and advanced ad zeronet.",
				"added": 1629095976
			},
			{
				"comment_id": 27,
				"body": "> [xanadu](#comment_22_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH): IPFS is bad. But would love to see mix of ZeroNet and I2P cause that would allow anonymus torrenting :)\n\nTotally agree! 😊 I'm not a programmer but im ready to help zeronet development! 😊",
				"added": 1629230273
			}
		],
		"1628958951_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 24,
				"body": "> [progi](#comment_21_17KQehVm2u5r4GAjqkC3jRcxepzK6ri51W): \"Not FoundAdding new sites disabled on this proxy.\" [...]\n\nI created the proxy in that way to dont allow illegal content. This Is a preview of you want the full network use the client and contribute",
				"added": 1629060570
			}
		],
		"1629104216_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj": [
			{
				"comment_id": 26,
				"body": "> [gitcenter](#comment_1523_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): zero:// trackers are shared automatically by AnnounceShare plugin\n\nI dont understand...i included every tracker in its internal tracker list but they sere not shared...i Will try with an external client with all my tracker's inside",
				"added": 1629230075
			}
		],
		"1629131195_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 28,
				"body": "> [6283823](#comment_14_1BsPbjfj4b6ab9t9gPeQiTTr9zc5fSXYJQ): Most of those bugs, will be fixed by latest beta. Play Store takes days to publish an update. It's already 3 days since update is submitted still not available for users. Once I consider beta had no issues reports by users update will be rolled to all users.\n\nThis new beta includes the v3 patch?",
				"added": 1629230414
			},
			{
				"comment_id": 30,
				"body": "Zeronet mobile update notification now appeared in my phone. I installed the update and Is working perfectly! Great work! 😊",
				"added": 1629452489
			}
		],
		"1629300170_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 29,
				"body": "Blocklist allow everyone to become a mod and trust other mods...none can do anything with potentially hundreds or thousands mods...😁 Also spam content are not shared and go dead shared Very fast",
				"added": 1629317185
			}
		],
		"1629776696_1FzpoVcMDHdrmqGuNs51dpoTmssre5yznv": [
			{
				"comment_id": 31,
				"body": "Zerohello already include a searchbar that works on any compatible zite",
				"added": 1629803581
			}
		],
		"1629748915_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK": [
			{
				"comment_id": 32,
				"body": "Zeronet Will be shut down if internet vwill be shut down...butvdoing this they Will burn billions of dollars...no Hope they Will do this",
				"added": 1629803671
			}
		],
		"1629788492_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 33,
				"body": "On galactichan you can fix this error Just waiting for full zite sync",
				"added": 1629803740
			}
		],
		"1629547543_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 34,
				"body": "Just break your Bubble. When you Will know any opinion you Will find the reality. To di this question everything as told before 🙂",
				"added": 1629803935
			}
		],
		"1630381630_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj": [
			{
				"comment_id": 35,
				"body": "zero://2kcb2fqesyaevc4lntogupa4mkdssth2ypfwczd2ov5a3zo6ytwwbayd.onion:15441",
				"added": 1630381731
			}
		],
		"1630944991_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 36,
				"body": "If a patch for v3 Will not be added in the official release soon a for for me must be done",
				"added": 1630949154
			}
		]
	},
	"comment_vote": {
		"20_1Pxg9q2iUdQkbwgT459ArjQ12mpXN8cyEB": 1
	}
}