{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 21,
	"comment": {
		"1576011374_1MpW5XoTF73ehngmhppKCjK1HTGHAA4pGS": [
			{
				"comment_id": 1,
				"body": "الو صدام میاد",
				"added": 1576336900
			},
			{
				"comment_id": 2,
				"body": "باحاله ولی من با کوبونتو وصل کردم شاید بقیه با ویندوز بیان",
				"added": 1576336932
			}
		],
		"1576185412_16VNPV97D22nLggFssEwQXScnyUGX2cHjq": [
			{
				"comment_id": 3,
				"body": "زنده باد آزادی مرگ بر خامنه ای جنایت کار",
				"added": 1576337044
			},
			{
				"comment_id": 4,
				"body": "پوفف چیه ما توی بد ترین شرایط جهان قرار داریم ثروت مند ترین کشور جهان نا مناسب ترین کشور جهانه فکری به حال خودت بکن اگه سپاهی هستی یا بسیجی باید بگم براشون مثل لاشخور میمونی مثل لاشخور فقط بهت غذا میدن کارشون باهات تموم شد تو هم مثل بقیه ای",
				"added": 1576337172
			},
			{
				"comment_id": 11,
				"body": "یه رژیم ورشکسته که حتی پول سرکوب گراشو نداره بده به نظرتون این بار دووم میاره \nاگه ورشکست نشده بودن بنزین رو گرون نمیکردن که از جیب مردم گدایی کنن برای آخوندای شکم پرست \nالان فقط نفت و افراد ترویستی تحریمه ولی مواد دارویی و غذایی تحریم نیست سپاه پاسداران جنایت کار قصد داره با انداختن مواد شیمیایی و مخدر در انواع محصولات شرکت های داخلی اونارو ورشکست کنه چرا چون میخواد خودش  محصولات غذایی از خارج بخره و به مردم ایران با قیمت گرون بفروشه یا باید تغییر کنه یا از ونزولا بد تر میشه و آخوندا هم هر روز پول دار تر ما چاره ای نداریم \nدوستان اگر این رژیم بر اساس قوانین اسلامی بود جرم خامنه ای بر اساس حکم حضرت علی سوزانده شدن بود چرا چون از دین سوء استفاده میکنن برای توجیه کار های خودشون حضرت علی به عبدالله ابن سبأ یهودی یک هفته مهلت داد توبه کنه توبه نکرد و به همراه 70 تن از یارانش سوزانده شد به دستور حضرت علی.\nتوی اسلام نگفته اگر کسی اختلاس کرد شما بگید کشش ندید تازه تموم شده توی اسلام کسی از دزدی از جیب مردم به صورت آشکار حمایت نمیکنه گرچه دستور خودش بوده و الکی میگه حمایت که مردم اعتراض نکنن توی اسلام نمیگه به ادیان دیگه توهین کنین و اونا رو جرم حساب کنین و به عقاید اونا توهین کنین به عنوان مثال (بهایی،یهودی، نوکیش ها، وهابی،اهل تسنن،شیعه ی انگلیسی و غیره... \nهمسایه ی پیامبر اسلام یهودی بود نخل پیامبر یه ذره کج شده بود داخل حیاطش پیامبر اونو قسم میداد که یا سهم خودشو بر داره یا پیامبر خودش میره براش میاره این اسلامه نه این که این ها اعتقاد داشته باشن که هیچ باکره ای نباید اعدام بشه و قبل از اعدام بسیجی های کثیف و کثافتشون رو میفرستن که به اونها تجاوز کنن بعد اعدام بشن تازه به خانواده هاشون میگن که چه قلطی کردن \nاسلام هیچ وقت حجاب رو برای همه اجبار نکرده برای مسلمانان اجبار کرده و به مسلمانان گفته که هر وقت که زنی بی حجاب دیدید سرتونو بندازید پایین و از اونجا برید و تنها یک آخوند در دو جا یک خونه اون هم وقتی تنها باشه دو نماز جماعت نصیحت بکنه میتونه از حجابش ایراد بگیره حالا ای بسیجی ای سپاهی ای خانوم آخوند ای آخوندی که به دختر و ناموس مردم گیر میدید اونم وسط خیابون شما خیلی قلط میکنید که مخالف حرف پیامبر تبلیغ میکنید انتخاب دین از نظر اسلام مجازه اما تو آخوندی که گیر میدی حتما چشم خودت خرابه حتما روزی روی یه نفر میخوابی که این حرفو میزنی \nحال بنظرتون این رژیم باید بمونه نخیر ما باید به سزای عملشون برسونیمشون هیچ دیکتاتوری از مرگ راه فرار نداره چیزی هم به نام معجون جاودانگی وجود نداره آخر باید بمیره مردم بدانید و آگاه باشید این ها هم دنیای شما و هم آخرتتون رو به باد فنا دادن ما باید برای دفاع از ناموس خودمون بجنگیم و از یک رژیم ترویست به آخر رسیده هیچ ترس و واهمه ای نداشته باشیم",
				"added": 1576680824
			},
			{
				"comment_id": 13,
				"body": "دوستان فردا احتمالا خیلی سریع اینترنت قطع میشه پس چند تا توصیه ی هوشیاری جهت مقابله با بسیجی های ساندیسی داشته باشیم \n1ـ از فیلم برداری رو به جلو ی معترضان جدا خوداری کنیم هر کس که این گونه فیلم برداری کرد گوشیشو ازش بگیرین \n2ـ هنگام اعتراضات لباس رنگی نپوشید بسیجی های ساندیسی معمولا لباس های سیاه سبز تیره و خاکستری میپوشن تا حد امکان از این نوع لباسا بپوشید تا به قول اون یارویه خر تو خر شه و به احتمال این که خودی باشید کم تر شلیک کنن\n3ـ کمپین کور کردن چشم نظام دوربین های بانک ها دوربین های کنترل ترافیک تا میتونید بشکنید و رنگ کنید که اینا نتونن کاری انجام بدن و اگر فامیلی دارید که مغازشون دوربین داره یک روز قبل از تضاهرات که امشب بود بگید کلا دوربیناشو جمع کنه \n4ـ تشخیص بسیجی های مزدور میان جمعیت بسیار سادس این افراد معمولا مثل معترضان شعار سر میدن و مثل یک لیدر رفتار میکنن که معترضان رو به داخل تله بکشونن یا با اسپری اونا رو علامت گذاری کنن معمولا این جور افراد لباس های سیاه و سبز پرنگ و خاکستری دارن جاکت هم هستن و هم چنین کاپشن اینا رو بگیرید بزنید مشت و مال حسابی جوری که بیمارستان جوابشون کنه \n5ـ از تضاهرات در یک منطقه به شدت خوداری کنید و مردم رو به صورت پراکنده پخش کنید که کار سرکوب گران سخت تر شه و نتونن از گاز اشک آور به خوبی استفاده کنن\n6ـ در صورت شکل گیری تجمعات کافی مردم رو به سوی مراکز مهم از جلمه پاسگاه ها زندان ها صدای و سیما مرکز نیروی انتظامی مراکز سپاه و بسیج راهنمایی کنید و اون ها رو کاملا تسخیر کنید یکی از ترس های شدید رژیم آزاد شدن زندانی هاست زندانی ها شاید خشن باشن اما در انقلاب مهره های کلیدی به شمار میان \n7ـ برای مقابله با موتور سواران بر روی آسفالت ها روغن سوخته بریزید خیلی کاربرد داره \n8ـ در اتوبان های بزرگ ایجاد راه بندان کنید \n9ـ افرادی که سلاح دارن توصیه میشه اگه سلاح کمریه در بین معترضان و اگه سازماندهیه و مسلسله مانند:کلاش و یوزی با موتور و اگه اسنایپر یا تک تیرانداز دارید از بالای ساختمون ها و مراتع بلند و فواصل دور معترضان رو پوشش بدین اگر فردی قصد پرتاپ گاز اشک آور یا شلیک به معترضان رو داره شما اول بزنید\n10ـ چند گروه پزشکی تشکیل بدید اعم از پرستاران و دکتران که به معترضان خدمات رسانی کنن بدون اتقال به بیمارستان در صورت انتقال یافتنشون لطفا از تحویل دادن معترضان به پلیس جلوگیری بشه معترضان اگه آسیب دیدید حداکثر کاری که میتونید انجام بدید رو انجام بدید که به بیمارستان منتقل نشید \n11ـ چند گروه سازماندهی رهبری سیاسی و نظامی اعتراضات تشکیل بدین که افراد تشخیص بدن بهترین کار چیه \n12ـ گروه های سنگ جم کن بسیار مهم هستن این گروه ها رو تشکیل بدین که برای معترضان سنگ جمع کنن \n13ـ از بازداشت معترضان جلوگیرری کنید اگر معموری قصد بازداشت داشت همگی روی سر اون بریزید\n14ـ لباس های تن افراد گارد ویژه بسیار سنگین هست مردم بدانن و آگاه باشند که اگر دور این که جمع شید نمیتونن از خودشون دفاع کنن اگه مردم دور این ها جمه شن مثل لاکپشت میمونن که به پشت افتاده پس شرایط دستتون میاد که بزنید \nاین تموم چیزایی بود که بلدم امیدوارم استفاده ببرید",
				"added": 1577205442
			},
			{
				"comment_id": 14,
				"body": "آها یادم رفت اضافه کنم که بسیجی هایی که در میان مردم هستن معمولا یه گوشیه کوچولو در یکی از گوش هاشون وجود داره که باهاش ارتباط به مرکز رو حفظ میکنن",
				"added": 1577205576
			},
			{
				"comment_id": 15,
				"body": "ما وسط جنگ میدانی هستیم پس از این چیزا گذشته حالت خوب نیست زدن باید بزنی کشتن باید بکشی خون با خون نه این که اون بزنن ما بشینیم نگا کنیم یا بگیم بی شرف بی شرف اینا دیگه بی فایدس",
				"added": 1577255430
			},
			{
				"comment_id": 16,
				"body": "بانک ها رو نزنید ولی دوربیناشو نزارید دوربین سالم بمونه",
				"added": 1577255491
			},
			{
				"comment_id": 17,
				"body": "زنده باد مردم\nکسانی که آزادی خواه هستن و در کرمانشاه هستن باید بدونن یکی از مزدور های سرکوب گر حسین اسدی کیا دانش آموز سال دوازدهم انسانی مدرسه ی بزرگمهر در تعاون هست این آقا هم بازداشت میکرد و هم سرکوب و گفته باز هم میکنم اگر بعد از انقلاب گیرش آوردین بهش رحم نکنین به شدت شخص بسیار کثیف و آلوده ای هست\nشاید بگین دانش آموز فکر کنم بخاطر این که جثه ی بسیار بزرگی داره گرفتنش",
				"added": 1577288361
			},
			{
				"comment_id": 18,
				"body": "زنده باد آزادی",
				"added": 1577288372
			},
			{
				"comment_id": 19,
				"body": "راه آزادی یعنی لو دادن همه ی مزدوران آشنا بهشون رحم نمیکنم شما هم رحم نکنید چرا که به برادران شما رحم نکردن",
				"added": 1577288443
			},
			{
				"comment_id": 20,
				"body": "لو بدید این کثافت هارو هر جا که میتونید",
				"added": 1577288518
			}
		],
		"1576332422_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": [
			{
				"comment_id": 5,
				"body": "من بزرگترین تبلیغ رو انجام دادم گذاشتمش داخل سایت رسمی انجمن اوبونتو",
				"added": 1576337456
			},
			{
				"comment_id": 6,
				"body": "اونجا فول ممبرم",
				"added": 1576337469
			}
		],
		"1576342242_19GLaMks6RC8w69H2QqkQNH4UKj95ne1Cz": [
			{
				"comment_id": 7,
				"body": "اگر الان دنبال نکنیم 5 آذر باید خماری بکشیم خخخخخ همه معتاد شدیم در ضمن برای آزادی به اینترنت نیاز داریم که اطلاع رسانی کنیم",
				"added": 1576344608
			},
			{
				"comment_id": 8,
				"body": "انقد درس خوندم نمیدونم دنیا کجاس",
				"added": 1576356410
			},
			{
				"comment_id": 9,
				"body": "خخخخ",
				"added": 1576356423
			}
		],
		"1576602638_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": [
			{
				"comment_id": 10,
				"body": "آیا فقط zero net هست اگر خواستیم به عزیزانمون موقع قطعی پیام بدیم چه مواردی رو پیشنهاد میکنید بهترین روش برای دور زدن قطعی در اندروید چیست",
				"added": 1576679108
			},
			{
				"comment_id": 12,
				"body": "> [haxxer](#comment_32_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk): اگر حتی سایت های داخلی باز نمیشداین دوتااینها دیگه کاری به اینترنت و ... ندارنمیتونید با وایفای و بلوتوث به همدیگه وصل شید و زنجیره ارتباطی تشکیل بدیدhttp://127.0.0.1:43110/1PyJqA1V8wFemvEJ2FeJ8CmVnEtR2nngNp/?Topic:1576601165_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk/\n\nبلوتوث و وای فای برد مشخصی دارن من برد استانی میخوام",
				"added": 1576695892
			}
		]
	},
	"comment_vote": {}
}