{
	"title": "1st ZeroNet Council",
	"description": "The Official Documents\nOf The First ZeroNet Council",
	"links": "*   [The Official Part](http://127.0.0.1:43110/1fzncZRMPGPBdyUBm2ATVSkRAsnvMq5VN)\n\n*   [Talks: General](http://127.0.0.1:43110/1fznctFebYHnmjmFZCmAWPd7nnamAy3Tg)\n\n*   [Talks: ZeroNet Support](http://127.0.0.1:43110/1fznc4VQbbrQAf4UzHrWS6W2mpGFqXSeD)\n\n*   [Talks: ZeroNet Development](http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD)\n\n*   [Talks: Politics](http://127.0.0.1:43110/1fzncJdLpbsT5eeeYP14EKSaStHhtn5LY)\n\n*   [Administration](http://127.0.0.1:43110/1fzncGxeyDpbCz1CkvBkooEDsXGFq1GfK)\n\n*   (TBD) ~~[ZeroUp](http://127.0.0.1:43110/1fznckmNijSqxv5TFU1o9TMNeoHMci6bu)~~\n\n*   (TBD) ~~[Wiki](http://127.0.0.1:43110/1fzncwxYwhqPCWDiycGgC3h9AkniRXeSM)~~\n\n*   (TBD) ~~[Mail](http://127.0.0.1:43110/1fznc4nzf9VsKcYeZqxB814TS41geDhnm)~~\n\n*   [More...](http://127.0.0.1:43110/1fznc4VQbbrQAf4UzHrWS6W2mpGFqXSeD/?Topic:1616662324_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/)",
	"next_post_id": 4,
	"demo": false,
	"modified": 1616662681,
	"post": [
		{
			"post_id": 2,
			"title": "Why we need the ZeroNet Council",
			"date_published": 1548929764.242,
			"body": "## Where we are\n\nThe network now has **2 major design flaws**, that can have great influence on the usability of the network in the future.\n\n**The first one** is that ZeroNet provides the low cost creating new user accounts and relatively high cost filtering them. Due to the growing popularity of ZeroNet, the probability that various destructive forces will pay attention to Zeronet increases. In the current design, ZeroNet has little or no means to protect from bots, spam, DoS attacks etc. The user blacklisting approach is not reliable against massive spam attacks in the long run.\n\nWe should take into account the worst case, when automated attacks render any zite, that provides the write access for the user (ZeroId) certificates, totally unusable. ZeroID certificate provider itself can also be easily put out of action, registerings lots of certificates and/or DDoS-ing the hoster's IP addresses.\n\n**The second issue** is what we recently faced, when balancer73, the owner of lots of ZeroNet forums and blogs died.\n\nThe current ZeroNet infrastructure is controlled by several sparse individuals and totally depends on them. If the owner dies, gets in jail, gets intimidated or just losts his/her interest in the project, the zites gets unmaintained. It is still better than the complete lost of Clearnet sites in the same case, but I believe we can do it better.\n\nThere is also **the third issue**, that is not a design flaw, but a whitespace in the organization of our community. We have a lot of various zites here, including popular ones, such as [Talk.ZeroNetwork.bit](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/) and ZeroMe, but the most of those zites are just common \"talk about everything\" zites, and none of them is dedicated to the development of the network. The discussions about zite and network development are scattered here and there, on a couple of forums, a couple of chats, ZeroMe, ZeroMedium, some blogs etc. Github is also a place for many discussion, but Github is a centralized site, that can be a point of failure.\n\nSo I guess we should run a discussion zite or a number of zites, dedicated to the network itself, where all the notable developers will probably participate.\n\n## What we can do\n\nTaking into account all the above, I offer creating a set of zites and also an informal organization that manages those zites.\n\nThe policy of accessing the zites should be such, that the zites would be reliable against spam attacks. It is the white-listing policy. We can start with the usual black-listing policy (i.e. only real spammers are blocked), so any users have the access by default. But in the case of the attack or the attack threat, we switch to the restrictive policy, so any know non-spam account are allowed to post, and all others are not. (Technically, it can be done by setting zero as the default `max_size` value, and setting some actual non-zero value for each real user individually.)\n\nThat zite or zites should be known as the place, that is ready to react to the attack as soon as possible, so in the case of troubles users can get there, discuss the situation and make some decisions.\n\nOn the zite, there should be contacts in various messaging services and media, where the zite administrators can be found, so new users can ask for adding them. There should also be some well-known ways to safely for the community to communicate outside of ZeroNet in critical situations. (Maybe Tox, BitMessage etc)\n\nThat addresses **the first issue**.\n\nTo address **the second issue**, and also to increase the readiness to react to an attack, there should be several administrators on a zite. If a zite is managed in cooperative way, the reliability is greatly increased. The life circumstances of a single individual is not a single point of failure any more. As far as I know, the current implementation allows assigning a set of keys for each content.json `include`-d from the root content.json, so we can assign different access levels for different persons. It is not only the primary private key owner who is allowed to modify the essential parts of the zite. The owner can share the write access to trusted users.\n\nAnd since the trusted users, who run the zite, are probably developers (or at least, most of them), that zite would also be a nice place for productive discussions about the network development. So it addresses **the third issue**.\n\nWe can start with the default ZeroTalk engine, and step by step, we can develop a powerful forum engine. If we start and keep addressing issues, that appears during the use of the engine, we can finally get a nice engine suitable not only for our project, but for many other zites.\n\nIn the same way, we can improve other engines, such as ZeroBlog or ZeroUp.\n\nI believe our community needs more cooperation and integration. I know there are great developers here, and if we work together, we can create wonderful tools for the better future.\n\n\n\n*Vadim Ushakov <geekless@zeroid.bit>*\n*Jan 31, 2019*"
		},
		{
			"post_id": 1,
			"title": "The Manifest of The First ZeroNet Council",
			"date_published": 1548696900,
			"body": "# The Manifest of The First ZeroNet Council. Version 0.2 2019-02-01\n\n----------------------------------\n\n## The Goals and Principles\n\n1. **The First ZeroNet Council** is a community of people who use, develop and promote ZeroNet.\n\n2. The main goal of the **Council** is to support the development and the propagation of the network with all possible means.\n\n3. The **Сouncillors** believe in the P2P technologies being able to bring the better future for the people all over the world.\n\n4. The **Сouncillors** promise to use the power of technologies for the Good, not for the Evil, according to their inner moral law.\n\n5. Being a member of the **Council** imposes no obligation on you to actually take (or not to take) any actions, but as a founder of the Council, I (geekless@zeroid.bit) hope that all the **Сouncillors** do have good intentions and share the values of the **Council**.\n\n6. The **Council** is an unofficial organization, and it is not for bureaucratic procedures. The **Council** has no goal to control and rule all the network.\n\n7. Any person who shares the goals and principles of the Сouncil, mentioned in this Manifest, may consider his/herself as a **Сouncillors**.\n\n8. The **Council** is named the **First**, since it is the first organization of this kind on ZeroNet. The **Council** is intended to keep working as long as technically possible, i.e. as long as the founder and other members of the Administration control the infrastructure, and their private keys are kept in secret.\n\n9. If the functioning of the **Council** is not possible for some reason (all the Administration is dead, the primary private keys are leaked etc), people will probably establish the **Second Council**, if necessary.\n\n----------------------------------\n\n## The Services\n\n1. In a technical sense, the **Council** is organized as a set of ZeroNet sites, providing various **Services**: discussion boards, wikies, file sharing services, mail etc.\n\n2. The **Services** is managed by the Council's **Administration**. The main goal of the **Administration** is reacting to possible attacks and vulnerabilities and maintaining the **Services**.\n\n3. The access to the **Services** may or may not require registration. The **Administration** chooses between the open and the restrictive policies of accessing the Services, depending on known vulnerabilities and other technical reasons.\n\n4. The restrictive mode may be required to protect the **Services** from being DoS-ed by creating lots of fake accounts and posting large-sized files on them. It allows us to provide a large enough size limit for each user while not being vulnerable to the DoS attack. The **Council Services** is to be available as long as possible when the network is under attack.\n\n----------------------------------\n\n## The Access to the Services\n\n1. If the **Services** is in restrictive mode, the following rules apply:\n\n2. The registration is not intended to discriminate users on any grounds such as gender, orientation, race, origin, political views and others. The registration is not intended to restrict the freedom of speech or impose the censorship. It serves as technical means in order to provide the better network services to people.\n\n3. The access to publish data on the **Services** is provided to any person who requests the access, as long as the following conditions are met:\n\n   * The person is a real human being, not a bot.\n   * The person has read this **Manifest** is aware of goals and principles of the **Council**.\n\n4. To get the registration, a person can contact to any member of the **Administration** or to the **Administration** in general using any messenger or media, where the members of the **Administration** can be found.\n\n5. The **Administration** has the right to refuse registration, if it has some evidence that the person is a bot or that the person has an intention to perform destructive actions on the **Services**.\n\n----------------------------------\n\n## The Administration\n\n1. The owner of the primary private keys is the founder of the Council: **geekless@zeroid.bit** (1GooUE19488nDwG3TdkM8seYAHct4gjkq4).\n\n2. The owner appoints other members of the **Administration** from trusted users.\n\n3. The **Administration** establishes the **Terms and Rules** of usage of the **Services**. The **Terms and Rules** cannot contradict the principles set out in this **Manifest**.\n\n4. The **Administration** is established not for being the network authorities, government etc, but for managing Services only.\n"
		}
	]
}