{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1582006484,
			"title": "Zeronet Freenet and I2P",
			"body": "Looking for some insights on whether I should use Zeronet or Freenet, and what about all the old freenet flogs and sites? How do we preserve them for the future?",
			"added": 1582006483
		}
	],
	"topic_vote": {
		"1587734994_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L": 1
	},
	"next_comment_id": 19,
	"comment": {
		"1581891315_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 1,
				"body": "The site is archived with a few screens here \nhttp://archive.is/tAy74 \n\nbut yea it's sad to see his site having been downed so fast.\n\nHad anyone elses' nudes been leaked that it wouldn't have been that swift and such a big deal.\n\nJust for the sake of the fact that noone should have more right to \"privacy\" than others I really ask anyone who has said nudes to please share them to us.\n\nAs to free speech, attemps like 4chan and 8ch have shown us that:\nA: Free speech doesn't exist here anymore because we are too lazy to implement and protect it\nB: When it kind of exists it's just for stupid crap that's divisive and doesn't produce anything useful (see curent state of /pnd/ which is a loss of time for anyone on it)",
				"added": 1581998713
			}
		],
		"1581518987_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": [
			{
				"comment_id": 2,
				"body": "Considering how women were treated before and after islam, it sure is a feminist attempt.\n\nBefore Islam: getting buried alive because no food and rapist may come\n\nAfter Islam: fair amount of rights in terms of not being repudiated in their wedding, rights to inherit their husband stuff, protection against injustice as human beings\n\nAfter westernized islam: can't drive a car anymore so will be less prone to sedentarity disease but still: not forced to work for the capitalists and can do their natural work of bearing children",
				"added": 1582000007
			}
		],
		"1581969527_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 3,
				"body": "> [edgelordofdecent](#comment_423_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): I guess we are apparently members of a Russian mafia.\n\nblyat",
				"added": 1582001784
			}
		],
		"1581067365_1FSfeha2tbwLR8Y7md6z2XfkCeYJPgdLnJ": [
			{
				"comment_id": 4,
				"body": "oh un collègue ! \n\n73 à toi",
				"added": 1582001871
			}
		],
		"1582006484_182MiECzFBoPjv3gU6tq2k9BXSboKzDVKF": [
			{
				"comment_id": 5,
				"body": "> [1bfqutudhtexlka](#comment_164_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): i think zeronet is better than freenet , but i2p is a total different use , so it's uncomparable\n\nOw, thanks for the insight. Never used I2P actually but thought it had a similar purpose than those two",
				"added": 1582078057
			},
			{
				"comment_id": 8,
				"body": "> [z0net](#comment_5_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS): http://127.0.0.1:8888/USK@jj6NdcmPiqI4TnRckgXHJTkGHAgFZVNeMTGa13E9ZPk,JkuHG5IKOYlXFidCLBj8d2cv8ENFhgkBTIfZ3AjQl~U,AQACAAE/SpaceMushies/3/\n\nI think I recognize this url, if it's the space mushroom story you have good taste gentleman, will definitely restart freenet to browse all that good stuff you sent",
				"added": 1582895416
			},
			{
				"comment_id": 9,
				"body": "> [aeldg7pg4b](#comment_29_1NdJyMSqnWWim7ibxBvaNsMgQvqkkTXVnz): Freenet seems to be dying, but Zeronet still has a pulse. [...]\n\nPardon me for the perharps stupid question, who'd Kocis? A Zeronet dev?",
				"added": 1582895493
			},
			{
				"comment_id": 10,
				"body": "> [aeldg7pg4b](#comment_29_1NdJyMSqnWWim7ibxBvaNsMgQvqkkTXVnz): Freenet seems to be dying, but Zeronet still has a pulse. [...]\n\nBut thanks for the insights, even though they're a bit grim xd about freenet",
				"added": 1582895520
			}
		],
		"1582104346_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP": [
			{
				"comment_id": 6,
				"body": "don't think they even know how to install zeronet on their mac :p",
				"added": 1582185591
			}
		],
		"1580821606_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 7,
				"body": "That's an idea, perharps to take the idea of the candelabrum, the symbolism of the tree of life/of the Holy German Empier (which is very popular within white nationalists among with other grail stuff) could suit the idea as well without being too much the like of the menorah/kinara.\n\nBut yea overall agree, if they want to be taken seriously and not as angry nolife teens they indeed need to step up their game and stop the hystery (which they denounced among the \"sjw\" a few years ago)",
				"added": 1582185792
			}
		],
		"1582649582_13EafRdDw5sZF42dTn68uDdcssTWKbdauJ": [
			{
				"comment_id": 11,
				"body": "my two cents on this issue: it's a non issue, we have more important stuff to deal with than women being shamed or the opportunity to undress everyone. Especially when violence as mentioned by nitrowing or lust corrupt the mind and stray it away for said priorities (reducing human suffering, building a more optimized society, fighting pollution or climate change or whatever)\n\nAlso shame exists because it helps bind society together, for people are afraid of being cast outside their group, if we make shame disappear, adverse consequences may occur.",
				"added": 1582895838
			}
		],
		"1582501134_1Dd72quA2dW64YYvEHo2nC6gTjSY7b65Gx": [
			{
				"comment_id": 12,
				"body": "could be interesting but isn't the bitcoin blockchain already decentralized?",
				"added": 1582896056
			}
		],
		"1582197021_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 13,
				"body": "What a surprise. Don't forget, all global issues are not issues for you, everyone \"reporting\" on said global issues and having a big audience is part of the checkboard. \n\nFocus on your life that's all that there is to say, don't even lose time reading this here message.\n\n> [broo49664](#comment_3_1BRxJEa4TJ3hk6KcGHYFTGjAb81Vxz2RW3): that's a funny way to spell 'RELIGION'\nI think he meant greed or ego, or yea religion but peerharps in the sense of dogma...\n\nPS: and yeah as someone stated. OP: before yelliong something, please add sources that prove your point, thanks",
				"added": 1582897261
			}
		],
		"1582898213_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 14,
				"body": "Well i'd put an internet killswitch if i had the control over it too. That's just called not being stupid. NOw like the author of the other post concludes, what do we do to get back that control is the question!",
				"added": 1582898840
			}
		],
		"1583479244_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid": [
			{
				"comment_id": 15,
				"body": "FBI on its way for wire fraud scam.\n\nI don't think it's a good thing that zer0net gets tainted with such people like you anyway.\n\nJoke aside, those cards are really useful on:\n-airplanes without internet connection (eg: their wifi movie store)\n- used to work on amazon but not really anymore as they now bill the cc before giving access to the media\n- will pass any offline check as they are algometrically valid",
				"added": 1583553108
			}
		],
		"1587670973_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 16,
				"body": "In the philosophical sense it's left wing as it puts everyone on the same fair place, cheating with influence, money, ... is harder here. (right wing in this sense would be about authoritarianism, which is hardly applicable here)\n\nBut yea like edgelordofdecent said it's a bullshit dichotomy, both people on the right and the left think they're promoting and acting \"the right way\" and feel justified to act on the other \"side\" not as they would people would act unto them.",
				"added": 1587712805
			}
		],
		"1587679731_1367VTupfj886Uk39iT4RjiSmrakiDYTga": [
			{
				"comment_id": 17,
				"body": "Has anyone put these combolists to good use? Any mails dumped by chance?",
				"added": 1587712981
			}
		],
		"1587573122_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": [
			{
				"comment_id": 18,
				"body": "> [bigbadbob](#comment_1076_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): bigbadbob \n\nNot for you :p",
				"added": 1587713942
			}
		]
	},
	"comment_vote": {
		"1807_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"426_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"5_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": 1,
		"29_1NdJyMSqnWWim7ibxBvaNsMgQvqkkTXVnz": 1,
		"480_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"6_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": 1,
		"1075_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"535_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1
	}
}