{
	"next_topic_id": 59,
	"topic": [
		{
			"topic_id": 1629431360,
			"title": "Is port 15441 required for a TOR v3 tracker?",
			"body": "I don't think this should be the case, but I have the most success with it. I had 50% success using port 22017, then it stopped working altogether, but 100% success with port 15441.\n\nZeroNet bug?\n\nNote that I use external TOR/Orbot to make this work and I have issues without. The onion address has to be provided by TOR/Orbot.\n\nIs port 15441 a hard-coded expectation of ZeroNet?\n\nI'm thinking of creating a tutorial using what I've learned creating these trackers.",
			"added": 1629431359
		},
		{
			"topic_id": 1630441344,
			"title": "The developer of a ZeroNet fork must remain anonymous.",
			"body": "With your identity known, you will have many enemies that may threaten, imprison, or kill you.",
			"added": 1630441342
		},
		{
			"topic_id": 1630500048,
			"title": "A simple solution to help idiot-proof your git site.",
			"body": "Make your git site only accessible through Yggdrasil. That requires some effort to get to the site. Also, this may attract the right kind of people to the network.",
			"added": 1630500045
		},
		{
			"topic_id": 1630523661,
			"title": "Why aren't you using YubiKeys?",
			"body": "Seriously, these are amazing technologies with open source applications for securing your PC and online accounts. My laptop, Google account and GitHub account are now secured with a YubiKey. I will get another to further secure my Google account. I've had one before, but it didn't feature FIDO/FIDO2. Now they're easier than ever to setup with your Google and GitHub accounts.\n\nYubiKeys are also durable as fuck with solid plastic construction.\n\nDo you hate Google? I don't blame you. You can also use a YubiKey with LastPasa and secure all your site accounts with that instead.\n\nI wish for ZeroNet to have 2FA, if that's even possible.\n\nhttps://www.yubico.com/\n\nhttps://landing.google.com/advancedprotection/\n\nhttps://github.com/settings/two_factor_authentication/configure\n\nhttps://www.lastpass.com/yubico\n\n@GitCenter",
			"added": 1630523657
		},
		{
			"topic_id": 1630572582,
			"title": "I think the Name.YO plugin crashes.",
			"body": "I sometimes get the \"Not Found\" error for sites with the domain set to a Name.YO TLD.\n\n@GitCenter",
			"added": 1630572577
		},
		{
			"topic_id": 1630592868,
			"title": "What is the maximum file size for content.json that ZeroNet can realistically handle?",
			"body": "I've exceeded the limit on my KopyKate clone. Content publishing fails. I don't get a content too large error though, because I've made the limit beyond what ZeroNet can handle.\n\nIf anyone is posting to KopyKate, remember that smaller is better for thumbnails. Exceeding what ZeroNet can handle, counting all thumbnails, will cause publishing issues.",
			"added": 1630592862
		},
		{
			"topic_id": 1630791791,
			"title": "ZeroHello needs to be forked (packaged with a ZeroNet fork) and the default ZeroTalk English needs to be replaced.",
			"body": "It's not the end of the world that ZeroID is no longer functional.",
			"added": 1630791784
		},
		{
			"topic_id": 1630944991,
			"title": "Should we still move on to a fork if Nofish is fine?",
			"body": "GitCenter says there are numerous security bugs with ZeroNet and Nofish had been mostly inactive (not active at all on GitHub).",
			"added": 1630944983
		},
		{
			"topic_id": 1631033012,
			"title": "How to setup a TOR v3 tracker on Ubuntu 20.04 and Linux Mint 20.2 using Anonymoose's patch.",
			"body": "First, go [here](/Talk.ZeroNetwork.bit/?Topic:1627703143_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj/Zeronet+v3+tor+hidden+service+support+Is+out) and install the patch.\n\nOpen Terminal.\n\n```sudo passwd```\n\nSet the superuser password.\n\nFollow the instructions linked below. Your distribution is focal. use ```sudo su``` if permission is denied.\n\nhttps://community.torproject.org/onion-services/setup/install/\n\n```sudo nano /etc/tor/torrc```\n\n[Follow these directions.](/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/faq/)\n\nInclude these lines:\n\n```\nHiddenServiceDir /var/lib/tor/ZeroNet\nHiddenServicePort 15441 127.0.0.1:15441\n```\n\nCtrl+O to write to the file.\n\nEnter to save.\n\nCtrl+X to exit.\n\n```systemctl restart tor```\n\nNow, navigate to /var/lib/tor/ZeroNet.\n\nOpen hostname.\n\nCopy the hostname and paste it to the \"File server external IP\" textarea on [this page](/Config). Also paste it to the Trackers textarea with zero:// before the hostname. Include :15441 for Trackers.\n\nExample:\n\n#File server external IP\n```\nmy562dxpjropcd5hy3nd5pemsc4aavbiptci5amwxzbelmzgkkuxpvid.onion\n```\n\n#Trackers\n```\nzero://my562dxpjropcd5hy3nd5pemsc4aavbiptci5amwxzbelmzgkkuxpvid.onion:15441\n```\nHave Tor set to Enabled or Always. Use File server port 15441.\n\nEnable Bootstrapper plugin [here](/Plugins).\n\nImportant: Only ever shutdown ZeroNet from ZeroHello or when prompted from the Config or Plugins pages. Never update+restart ZeroNet with the Py3 Updater.\n\nPlease always keep your PC running.\n\nShare your tracker(s) here. They will be included in [Syncronite](/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o) if they're working.",
			"added": 1631033003
		},
		{
			"topic_id": 1631051842,
			"title": "There needs to be ZeroNet developers who aren't vaccinated against COVID-19",
			"body": "I don't want to see you guys drop dead in three years from blood clots caused by spike proteins lining your blood vessels.\n\nhttps://newsrescue.com/vaccine-researcher-admits-big-mistake-spike-protein-in-cv-jabs-dangerous-toxin/\n\nPlease be bothered to do ***any*** research via DDG.",
			"added": 1631051832
		},
		{
			"topic_id": 1631079918,
			"title": "How do I make IceCat work with ZeroNet?",
			"body": "It doesn't load localhost.\n\nhttps://ftp.gnu.org/gnu/gnuzilla/",
			"added": 1631079907
		},
		{
			"topic_id": 1631138971,
			"title": "Can multiple dynamic sites be packaged as one?",
			"body": "Seems like a silly question since Kaffie apparently had done this, but say I had a blog, a 0-share, and a hub. How complicated is it, or is it not at all?\n\nJust curious. Seems more logical than having multiple sites per person.",
			"added": 1631138959
		},
		{
			"topic_id": 1631220839,
			"title": "Some ID providers have expired .bit domain names.",
			"body": "As you might see with [KopyKate A/V](/1GPxQe1Qd76NpKNfCB2x1KnQLdZFuWFEAo/), some links to ID providers don't work. You get a Not Found error.\n\nCan we fix this?",
			"added": 1631220826
		},
		{
			"topic_id": 1631309888,
			"title": "So I thought I'd create a ZeroNet scrollbar theme for Webkit/Blink browsers.",
			"body": "```\n@media (pointer:fine) {\n    ::-webkit-scrollbar {\n        width: 10px\n    }\n\n    ::-webkit-scrollbar-track {\n        background: 0 0;\n        border-radius: 5px\n    }\n\n    ::-webkit-scrollbar-thumb {\n        background: rgba(180,180,180,.5);\n        border-radius: 5px\n    }\n\n    ::-webkit-scrollbar-thumb:hover {\n        background: #af3bff\n    }\n}\n```",
			"added": 1631309874
		},
		{
			"topic_id": 1631505980,
			"title": "I'll just leave this here...",
			"body": "https://www.youtube.com/watch?v=S_6H6s25ums",
			"added": 1631505965
		},
		{
			"topic_id": 1632251247,
			"title": "Syncronite has a new look and html file.",
			"body": "The previous file used to insert ngosang's trackers into your ZeroNet client still exists and will remain updated, but now there is Syncronite.html, which includes anonymoose's v3 trackers list along with ngosang's list all in one file. This will also auto-update daily. This means no longer having to enter multiple sources nor texts into the Config page.\n\nOverall, Syncronite is back to being simple again and now will give you all trackers from all sites in one file for ease of use.\n\nNow, if someone would create a list for Yggdrasil trackers, that can be merged into Syncronite.html as well.\n\n#[Syncronite](/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/)",
			"added": 1632251231
		},
		{
			"topic_id": 1632719590,
			"title": "Both České fórum and the ZeroNet Mobile forum need to revert back to ZeroTalk's JS.",
			"body": "I'm unable to post on these forums. After editing a comment and saving, this bug occurs.\n\nThis is a critical bug that prevents people from communicating.\n\n@ssdifnskdjfnsdjk",
			"added": 1632719573
		},
		{
			"topic_id": 1633148426,
			"title": "VFX Artists DEBUNK Pentagon UFO Videos",
			"body": "https://www.youtube.com/watch?v=jHDlfIaBEqw\n\n_I actually did the math myself on the \"parallax\" or \"go fast\" video. There are a lot of numbers visible in the HUD in that video, and all you need is some trigonometry to figure it out. It's an object about 1,5 to 2 meters large. Which is normal albatross/pelican size. It is halfway between the ground and the airplane, which is normal albatross/pelican flying height. The speed of the fast military airplane is making the background whoosh past through parallax effect, even though the object itself is travelling at a measly 60 kmph. Which is normal albatross/pelican flying speed. It is also normal wind speed at that altitude, so it might even be travelling with the wind like a balloon does. Literally the only weird thing about it is that it looks quite cold. Way colder than I expect a bird to be. Since balloons are cold, maybe that's a better match. Though I don't know if a bird might just look really cold thanks to its insulative feathers, even though it is not cold. EDIT: As you can see in a later comment in this thread, people became annoyed at this so I actually checked this part as best I could now, aaaand it turns out even the temperature is correct for a bird._\n\n_I also analyzed the the \"gimbal\" video to similar degree. And that video is similarily mundane. The apparent rotation of the object is not the object itself rotating; it is clearly the camera gimbal rotating, because it is changing the shape of the aberrations around literally everything in the image, including the clouds in the background and small smudges on the lens. All of these things are rotated the exact same way at the exact same time. So it is clearly not the object rotating, it is the camera gimbal rotating, and the video we are seeing is an auto-rotated image-stabilized view, as the automatic tracking reaches the end of one axis and must rotate to continue the tracking motion. The odd flying saucer shape of the object is a LENS FLARE due to the camera getting blinded by the object, probably because it is reflective to infrared light, and the airplane itself is irradiating the object with an infrared tracking laser, which is bouncing back towards the airplane. OR it is simply reflecting the sun. It is reflecting something bright anyway. Since the shape is a lens flare it will rotate with the cameras aperture, and not with the object itself, which is most likely not rotating at all. This was filmed off the coast of Orlando, Florida, and that area is prone to aluminium mylar helium balloons escaping from Disney World. Those are reflective in this manner._",
			"added": 1633148408
		},
		{
			"topic_id": 1633315259,
			"title": "About the COVID-19 \"vaccine\"",
			"body": "https://odysee.com/@BNN:6/They-Lied-And-People-Died:8\n\nhttps://odysee.com/@styromaniac:5/COVID-19-vaccine-reactions_-Families-describe-adverse-responses-to-shot:7\n\nhttps://odysee.com/@stpierrs:f/Covid-Vax-Deadly-Side-Effects-are-VERY-COMMON:3\n\nhttps://odysee.com/@EricDubay#c/Terrible-Covid-Vaccine-Reactions---PLEASE-SHARE!#1\n\nhttps://odysee.com/@RADIO_BALONEY:9/ERIC-CLAPTON-BLACKLISTED-OVER-SIDE-EFFECTS-REVEAL:7\n\nhttps://www.youtube.com/watch?v=obdI7tgKLtA\n\nhttps://www.youtube.com/watch?v=4oWWcqGk1m4\n\nhttps://www.youtube.com/watch?v=hNIj83XNNeE\n\nhttps://www.youtube.com/watch?v=P4U6Lq4EBMo",
			"added": 1633315240
		},
		{
			"topic_id": 1633498111,
			"title": "See if this works for your PC.",
			"body": "Open the data directory in your ZeroNet folder.\n\nCtrl+F hello\n\nYou should find ```1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D```\n\nOpen the folder\n\nOpen the css folder\n\nOpen all.css\n\nCtrl+F ```#Dashboard .tracker-status```\n\nChange the width value from 600px to 777px.\n\nNow clear the browser cache.\n\nNavigate to ZeroHello in your browser or refresh the page.\n\nNo more TORv3 addresses overlapping the status text.",
			"added": 1633498091
		},
		{
			"topic_id": 1633989409,
			"title": "$1,000 USD down the drain.",
			"body": "So, earlier this year I bought a Samsung Galaxy S10+ 1TB. It was only available through Amazon, not the Samsung website. I thought this was fine, but four months later, the phone started randomly turning off without warning and eventually stopped turning on as the battery had a negative charge, indicated by uBreakiFix. I can buy a new battery for it from J&J International, but I can't find anyone to install the battery.\n\nMy mother and I went through all the hoops necessary: Samsung, Asurion, Amazon, uBreakiFix, and the seller Endlessitems17, back and forth. Endlessitems17 is a third party seller, so keep that in mind. The phone, it turns out, was purchased by me ten months after the factory warranty expired, thus putting me in a pickle. Nothing we tried was fruitful. My mother answered questions by potential buyers that the phone arrived out of factory warranty. Endlessitems17 said they'd replace the phone, first sending the shipping label to us, which never happened -- weeks have passed by without the label arriving. Endlessitems17 had said that we need to send EVERYTHING THAT WAS IN THE BOX back with the phone once the shipping label arrived, and, well, you already know that didn't happen.\n\nSo, long story short, don't buy an expensive gadget from a third party, nor from Amazon for that matter, as the phone was ordered through Amazon and I've received defective and used PC parts from Amazon in the past while they were supposed to be brand new and I had to pay return shipping!\n\nAmazon is not the place to buy expensive goods. Just forget about it. Save yourself the money, time and headaches and forget about getting one of the last 1TB phones left on Earth available for purchase. It's just not worth it. That's 1.5 months of my hard work down the drain.\n\nI'm warning you, because nobody deserves what happened to me.\n\nThe lesson here is to buy directly from the manufacturer as you'll get a factory warranty and the option to pay for insurance.",
			"added": 1633989388
		},
		{
			"topic_id": 1634194389,
			"title": "I can't recommend Android 11+ to ZeroNet site developers unless they root their device(s).",
			"body": "Root permission is now needed to access the Android folder.\n\nThis matters, because the file editor in ZeroNet is rubbish on mobile devices.\n\nI haven't tried Andronix nor Samsung Dex on my new phone, but this might get you around the backspacing issue with ZeroNet's file editor, but again, it's still rubbish and I recommend using Quickedit+ on Android, but that now requires root access.\n\nOn the plus side though, this means that China made apps can't fuck with your site files unless they have root permissions, which would be unwise to grant to them.",
			"added": 1634194366
		},
		{
			"topic_id": 1634240089,
			"title": "Nofish will add TORv3 support if a pull request exists at the end of the month.",
			"body": "@Anonymoose\n\n\"I will add TORv3 support if\npull request will be present at end of the month\"",
			"added": 1634240065
		},
		{
			"topic_id": 1634331858,
			"title": "Yggdrasil tracker support is broken.",
			"body": "Hopefully someone can fix this.\n\nhttps://github.com/HelloZeroNet/ZeroNet/issues/2780",
			"added": 1634331833
		},
		{
			"topic_id": 1634431467,
			"title": "Any bash gurus here?",
			"body": "[Syncronite.sh needs improvement.](/Talk.ZeroNetwork.bit/?Topic:1594083595_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd/Improving+Syncronite+sh)",
			"added": 1634431441
		},
		{
			"topic_id": 1634802535,
			"title": "What if I add IPv6-only trackers to Syncronite on top of what's already there?",
			"body": "Would it help or fragment ZeroNet? Both?\n\nNote that they have domain names, so DNS queries would be made.\n\nEdit: I notice that they still work on my laptop that is IPv4-only, thanks to my ISP. Is Yggdrasil to blame for them working or are they not IPv6-only? IPv6 tests fail. I think that newTrackon isn't correct.",
			"added": 1634802506
		},
		{
			"topic_id": 1635433479,
			"title": "newTrackon needs help.",
			"body": "https://github.com/CorralPeltzer/newTrackon/issues\n\nYou might have noticed that Syncronite had been switched to newTrackon for clearnet trackers, because it has potential to be better than ngosang's trackerslist.",
			"added": 1635433445
		},
		{
			"topic_id": 1635477887,
			"title": "Syncronite is unusable between ZeroNet Mobile restarts.",
			"body": "I figured it out. You must disable \"Additional BitTorrent Trackers.\"",
			"added": 1635477852
		},
		{
			"topic_id": 1635566142,
			"title": "I can't find where to donate to PramUkesh via Google Play",
			"body": "",
			"added": 1635566106
		},
		{
			"topic_id": 1635637273,
			"title": "ZeroNet bug: IPv6 (including Yggdrasil) trackers are only visible in TOR Always mode.",
			"body": "@geekless: I can't see IPv6 trackers via ZeroHello on any other TOR mode. They're probably not connected either.",
			"added": 1635637236
		},
		{
			"topic_id": 1635638316,
			"title": "Eyes of the Devil",
			"body": "https://lbry.tv/@stpierrs:f/KRPCFtKLaWA8.mp4:9",
			"added": 1635638278
		},
		{
			"topic_id": 1635744037,
			"title": "ZeroNet has a scroll flicker bug on Android.",
			"body": "This becomes noticeable with the sidebar and with sites having a sidebar menu using a scrollbar theme that is without a media query excluding touch input. I see this on Samsung Internet Browser.\n\nSolution: Try a different browser, even if also based on Chromium.",
			"added": 1635743997
		},
		{
			"topic_id": 1636047405,
			"title": "I really need Syncronite.sh to not sign and publish unless cURL detects updated file(s).",
			"body": "This way I could have it check every minute but only sign and publish when necessary.\n\nHere's [Syncronite.sh](/list/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/cache/1/?file=cache/1/Syncronite.sh)",
			"added": 1636047364
		},
		{
			"topic_id": 1636087754,
			"title": "user-scalable=1 really sucks when you have a shaking disorder",
			"body": "Suppose you have shaking induced by medication or Parkinson's. You'd be accidentally tapping the screen repeatedly, zooming in and out a lot.\n\nI recommend you set your viewport in content.json like so:\n\n```\n \"viewport\": \"width=device-width, initial-scale=0.8, user-scalable=0\",\n```\n\nAnd if your page is supposed to be viewed in raw/, then set the viewport in the html file(s) as well:\n\n```\n  <meta name=\"viewport\" content=\"width=device-width, initial-scale=.8, user-scalable=0\" />\n```\n\nThese viewport settings also make your page(s) look good on mobile devices.\n\nPlease, everyone, set your viewport(s).\n\nI don't have an issue with shaking anymore, because of an additional medication, but it was extremely annoying while it lasted.",
			"added": 1636087712
		},
		{
			"topic_id": 1636174431,
			"title": "Complete Malware Blockage",
			"body": "I have malware blocking on my new ASUS router (Any OS). I also block malware with [AdGuard AdBlocker](https://addons.mozilla.org/en-US/android/addon/adguard-adblocker/) (Any OS). Oh, and let's not forget [Safing Portmaster](https://safing.io/portmaster/) (Ubuntu and Windows). Lastly, I use [Quad9's anti-malware DNS](https://support.quad9.net/hc/en-us/articles/360041193212-Quad9-IPs-and-other-settings) (Any OS), so I'm blocking malware at every level: browser, OS, router, and DNS.\n\nIf you're an Apple fanatic, then try [Lockdown Privacy](https://lockdownprivacy.com/).\n\nYou can test your choice malware blocker(s) [here](https://www.wicar.org/test-malware.html).\n\nWhat do you use on desktop computers? Please mention OS support. The wider OS support, the better.",
			"added": 1636174388
		},
		{
			"topic_id": 1636264432,
			"title": "ZeroNet bug: Signing and publishing while a file of yours is downloading makes that file incomplete",
			"body": "For instance, if on ZeroUP you edit the name of your own file and it's halfway downloaded, after saving the new name, the file will now be stuck at 50%. The same goes for Kave. Make any change to your own file before a big file is fully downloaded and the file will remain incomplete.",
			"added": 1636264388
		},
		{
			"topic_id": 1636690136,
			"title": "Should I separately maintain the v3 trackers list on Syncronite?",
			"body": "Anonymoose reacts more slowly than I do. I browse ZeroNet all day, so I can react more quickly.\n\nRight now my old tracker is dead and my new one needs to be in the list. There's still no response from Anonymoose yet about it.\n\nEdit: Anonymoose also hadn't added ```zero://5vczpwawviukvd7grfhsfxp7a6huz77hlis4fstjkym5kmf4pu7i7myd.onion:15441```",
			"added": 1636690091
		},
		{
			"topic_id": 1636696143,
			"title": "I'm now using Geekless's ZeroNet fork.",
			"body": "So far, so good. Loving the new features.\n\nYou can get it here: https://codeload.github.com/zeronet-enhanced/ZeroNet/zip/refs/heads/massive-rework\n\nIf you've compiled the libraries for ZeroNet, it's just a matter of merging folders and overwriting files. Do that and you're good to go, right where you left off, save for optional files like ZeroMe images.\n\nEdit: You have to execute install-dep-packages.sh as root or else you'll have trackers issues.",
			"added": 1636696097
		},
		{
			"topic_id": 1636735738,
			"title": "19-Year-Old Boy Dies 48 Hours After Taking First Dose Of COVID-19 Vaccine",
			"body": "https://www.latintimes.com/19-year-old-boy-dies-48-hours-after-taking-first-dose-covid-19-vaccine-493881?amp=1&fr=operanews",
			"added": 1636735691
		},
		{
			"topic_id": 1636861616,
			"title": "Please revisit these threads. They have been updated.",
			"body": "http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1631033012_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3/How+to+setup+a+TOR+v3+tracker+on+Ubuntu+20+04+and+Linux+Mint+20+2+using+Anonymoose+s+patch\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1633498111_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3/See+if+this+works+for+your+PC",
			"added": 1636861567
		},
		{
			"topic_id": 1636904962,
			"title": "Who owns zero://2a03:b0c0:1:d0::f52:1 ?",
			"body": "It works on IPv4-only ISPs. What is this wizardry?",
			"added": 1636904912
		},
		{
			"topic_id": 1636999703,
			"title": "You can now donate to the ZeroNet Mobile developer via Google Play",
			"body": "It's nice not having that donate element taking up useful screen space when you're editing a topic/comment.",
			"added": 1636999652
		},
		{
			"topic_id": 1637042844,
			"title": "Don't try making a TOR v3 ZeroNet Tracker with ZeroNet Mobile and Orbot",
			"body": "I ended up with a TOR error that wouldn't go away no matter what I had done to reverse it. I had to resort to uninstalling and reinstalling ZeroNet Mobile to fix it\n\nI wish that in ZeroNet Mobile you could switch from internal TOR to external TOR (Orbot) dependency, if that would improve the performance and prevent TOR errors at all.\n\nI don't remember if I restarted the phone, but I can tell you as I already had that creating such a tracker on ZeroNet Mobile leads to problems.",
			"added": 1637042792
		},
		{
			"topic_id": 1637045178,
			"title": "Who owns a TOR-less ZeroNet tracker?",
			"body": "Could you please [upgrade to ZeroNet-Enhanced](/Talk.ZeroNetwork.bit/?Topic:1636696143_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3/I+m+now+using+Geekless+s+ZeroNet+fork) to find out if it works for ZeroNet-Enhanced users? Only four of them work at the moment, but I've found out why other kinds weren't working. Please visit the linked thread and read the last line or comment by me to get properly upgraded.",
			"added": 1637045125
		},
		{
			"topic_id": 1637049554,
			"title": "SHUT UP AND TAKE MY MONEY, GEEKLESS!",
			"body": "I want to donate to you, but I see no means to do so.\n\nWhile I have your fork working and I see all the good work you've done, I also see there's still more to do, and I want to financially support your work.\n\nNote that I do not have a debit card, but I might work on getting a prepaid one going, not a NetSpend card though, because that account got hacked when I had it active. I'll try to prevent this problem in the future.",
			"added": 1637049500
		},
		{
			"topic_id": 1637050883,
			"title": "How to have ZeroNet display the viewport of your site properly on first visit.",
			"body": "If it's a ZeroTalk-based site, this is unnecessary as it reloads the first visit, essentially doing the same as what I'll detail below.\n\nVisit [Kave](/1KN5zRytGbGqLNdemuoLC6gS44fwM9h38s), then take a look at index.html in the data folder under ```1KN5zRytGbGqLNdemuoLC6gS44fwM9h38s```\n\nThis function is used for zipped site files, but they don't have to be zipped. In fact, I believe this works only if you don't link to a zipped HTML file. You have to rename the original index.html to whatever you wish if you don't place it a folder deeper than before.\n\nGive it a go and show me your site using this.\n\nI'm gonna have all my other static sites except App 0 use this method after I get some sleep today.\n\nNote that this breaks links to posts and media.",
			"added": 1637050828
		},
		{
			"topic_id": 1637214620,
			"title": "I still think we need a team of owners for a ZeroNet fork.",
			"body": "Suppose whatever happened to Nofish or other things we've hypothesized happens to Geekless, then we'd be in the same boat as before.\n\n@Anonymoose:, @6283822:, @GitCenter: and @Geekless: all need to be owners of the same fork.\n\nIf we don't learn from the past, then it's doomed to be repeated.",
			"added": 1637214564
		},
		{
			"topic_id": 1637385216,
			"title": "It's a good time to get cowpox.",
			"body": "You'll have immunity to smallpox if you do. A doctor told me that I'm immune to smallpox because I have cowpox antibodies.",
			"added": 1637385159
		},
		{
			"topic_id": 1637391430,
			"title": "I can't sign and publish MOAB on Geekless's fork.",
			"body": "I'll stick with Nofish's ZeroNet with Anonymoose's patch.",
			"added": 1637391372
		}
	],
	"topic_vote": {
		"1629872993_13K9xAHRgqygKe8PQ7bgoNxVu6zhj7dETt": 1,
		"1630213163_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD": 1,
		"1630276094_13K9xAHRgqygKe8PQ7bgoNxVu6zhj7dETt": 1,
		"1630381630_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj": 1,
		"1630436341_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1630497564_19AuD3C3VusewLWehweVi29XupaG5TkPVC": 1,
		"1630522157_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1630544068_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": 1,
		"1630703227_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1630809883_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": 1,
		"1630865475_15fT5qViKSdrrocTyvmC9xdRQrgxeFtV9d": 1,
		"1630932576_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1631126622_1ATSif8GHYZiSgFWpQQ4dijmhV6iJyf4v7": 1,
		"1631131497_1LpWbu62NgT4wzh1k1XVDCW9qwENC7AQi1": 1,
		"1632925044_19TrKZA9ifR8bvPbL64AbNqttCDkWfErWF": 1,
		"1632948938_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1632848743_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG": 1,
		"1620620160_1FmrBebnM1t99pE6rz9amgdgFSfKagU9Nr": 1,
		"1633971358_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG": 1,
		"1634226877_1NAbpFqUHZXi4CmoA2v9pZrRrXNwvAJz8b": 1,
		"1634223386_1NAbpFqUHZXi4CmoA2v9pZrRrXNwvAJz8b": 1,
		"1634306647_1CN7STVMU29Rme1tgVRRPj3ZA3H7m99Rei": 1,
		"1634612688_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"1634704632_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"1634773410_1QJihYxdNDmN2iD5mBHVFyRtzvdtGpPfVM": 1,
		"1634772870_1QJihYxdNDmN2iD5mBHVFyRtzvdtGpPfVM": 1,
		"1634848133_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1634858411_1QJihYxdNDmN2iD5mBHVFyRtzvdtGpPfVM": 1,
		"1634928275_1QJihYxdNDmN2iD5mBHVFyRtzvdtGpPfVM": 1,
		"1634963804_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1634264493_19RBy1R77se3kYGB4ZLXCVowdKrcqL1h4A": 1,
		"1635682340_19BrLCpvj39jYmU9YZRsVhDV43k9d4ropH": 1,
		"1635824300_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD": 1,
		"1636071087_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1636121680_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"1636121010_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"1550540672_19ynt2naJSvRqWrGvAbVufPafr86Chc2Jv": 1,
		"1636467243_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": 1,
		"1636765653_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1636759226_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1636753641_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1637100321_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH": 1,
		"1637349877_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha": 1,
		"1637431016_1PB1YKkXjDp7fy4WC1bB9iw6V9Hp2thxWN": 1,
		"1637504933_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"1637266561_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha": 1
	},
	"next_comment_id": 287,
	"comment": {
		"1564701974_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "> [6283822](#comment_79_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe): i will update and try itI have to paste this link right ?\n\nYes",
				"added": 1578850461
			}
		],
		"1578244523_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "[Kave](/1KN5zRytGbGqLNdemuoLC6gS44fwM9h38s/)",
				"added": 1578963031
			}
		],
		"1592227111_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 5,
				"body": "> [1bfqutudhtexlka](#comment_184_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): users on ifs are not registered on zeroid , so i guess i can't block them ?am i right ?\n\nYou can block all users no matter the ID provider.",
				"added": 1592240663
			},
			{
				"comment_id": 9,
				"body": "> [nzogth](#comment_2_1KCaZNP1gDSMcaCJ9o5yW8antSVefNuv7a): That's very interesting, I didn't even notice IFS allowed ifs.anonymousAlso I don't believe the IDs can be blocked because the creation of them is encoded into the site without any way to block users.\n\nI wouldn't be too sure.",
				"added": 1592251695
			}
		],
		"1591821395_19ev8HmfPQ2VC8aWDA4Ck7E2vLYDYFgw9P": [],
		"1591900169_1NMBe5SUr5hbYNTzBMuvdBCAxQ81ivWzeL": [
			{
				"comment_id": 8,
				"body": "> [marcellusfagoti](#comment_7_14VqoVEkT68vis7i7gsKUqkDzKgDnVRA5Q): yo idk about moab. I mean why would anyone be concerned about someone named \"hurtthiswoman\"\n\nI removed the person from MOAB as their posts are gone now. They were spamming too if I remember right.\n\nMOAB can be critiqued and updated.",
				"added": 1592247950
			}
		],
		"1605530541_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": [
			{
				"comment_id": 11,
				"body": "> [diurpagissa](#comment_11_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK): You keep proving one thing by continuing this pointless discussion, and I bet you too know what this really means as the disease! That is, how does this translate to need to be above others in the real world... I mean a big mental instability problem! So all I can say before I will mute you forever is: bye and look for yourself as soon as possible!\n\nHow about making a redaction for crying out fucking loud?!",
				"added": 1605565921
			},
			{
				"comment_id": 12,
				"body": "https://youtu.be/U51MSK6nSQE",
				"added": 1605566105
			}
		],
		"1629174888_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 13,
				"body": "> [gitcenter](#comment_1530_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): What do you mean by 'fool-proof'?\n\nWorks in every browser regardless of supported codecs used.",
				"added": 1629220824
			},
			{
				"comment_id": 14,
				"body": "> [gitcenter](#comment_1531_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Ah, fail-proof then, probably. caniuse says that almost every browser supports webm. Except IE, but who cares about IE.\n\nEdge would support it though, so yeah... WebM-only it is.",
				"added": 1629223431
			},
			{
				"comment_id": 15,
				"body": "I'm having trouble making the dark icons white. I don't know why.",
				"added": 1629233121
			}
		],
		"1627161257_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 16,
				"body": "> [lola](#comment_139_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u): Unfortunately no. I don't have much time to spare so I will focus on the main platforms. It should be possible tho as I have seen Torrent apps on Android.\n\nYes, there's LibreTorrent. The open source library for it exists on Android.\n\nMost of us are using Android according to the ZeroNet Mobile dev.",
				"added": 1629258061
			},
			{
				"comment_id": 77,
				"body": "It's working. Now, please support Android.",
				"added": 1631027259
			},
			{
				"comment_id": 78,
				"body": "Does this also allow creation of BitTorrent trackers?",
				"added": 1631027476
			},
			{
				"comment_id": 79,
				"body": "Your plugin breaks KopyKate BIG Official and its clones.",
				"added": 1631029614
			},
			{
				"comment_id": 95,
				"body": "You didn't reply to my other comment about KKBO not working while this plugin is installed.",
				"added": 1631559664
			},
			{
				"comment_id": 160,
				"body": "> [lola](#comment_149_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u): Yes sorry. I didn't have the time to check it. I will investigate asap and let you know. Do you know who run it in case I need to contact them ?\n\n@quantumkitty",
				"added": 1635055750
			}
		],
		"1629131195_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 17,
				"body": "> [6283823](#comment_16_1BsPbjfj4b6ab9t9gPeQiTTr9zc5fSXYJQ): Try Latest beta from github releases.https://github.com/canewsin/zeronet_mobile/releases/tag/v0.8.1-beta-14\n\nI'm liking it so far.\n\nDark theme setting doesn't save though. After an app restart, it's back to white.\n\nStats page doesn't work.\n\nCan you please get rid of the Donate watermark? It's annoying and gets in the way of web UI.",
				"added": 1629298632
			}
		],
		"1629300170_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 18,
				"body": "Seems like you got it correct. Also, posts are time-spaced apart maybe 30 seconds. You see the que when you try doing multiple things in a short period of time.",
				"added": 1629301431
			},
			{
				"comment_id": 20,
				"body": "> [anonymouslogin](#comment_327_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Is the 'cool down interval' calculated per identity of per connection peer?\n\nIt doesn't appear so.",
				"added": 1629309540
			}
		],
		"1629298299_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": [
			{
				"comment_id": 19,
				"body": "I have been pondering that. It makes the most sense if any of our conspiracy hypotheses are correct.",
				"added": 1629302310
			},
			{
				"comment_id": 22,
				"body": "> [deuxzaron](#comment_168_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): I feel like this is a statement and not a question. If someone figured out who nofish is I guess it is possible\n\nHe was never anonymous. His name is Tamas Kocsis.\n\nAlso, the topic is a question.",
				"added": 1629354211
			}
		],
		"1628132492_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 21,
				"body": "> [tamilan](#comment_20_1NRVBTxrbgEFdVBNLczx4Cc6NV3H4Pykzc): Why would you do such a thing? The whole point of ZeroNet is anonymity. Why do you want to make yourselves known?\n\nRight. So we don't know who Nofish or Krixano is?\n\nAnonymity is an option, such is pseudonymity.",
				"added": 1629354049
			},
			{
				"comment_id": 23,
				"body": "> [tamilan](#comment_24_1NRVBTxrbgEFdVBNLczx4Cc6NV3H4Pykzc): I am not sure. At-least I plan to use it anonymously.\n\n> [tamilan](#comment_22_1NRVBTxrbgEFdVBNLczx4Cc6NV3H4Pykzc): If you were not aware of accessing it through Tor. That is kind of the 3 main selling points for ZN (as evidenced from SN's own website.). [...]\n\nGitCenter is a ZeroNet contributor. He knows already.",
				"added": 1629392511
			},
			{
				"comment_id": 28,
				"body": "> [gitcenter](#comment_1537_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Right. My apologies.\n\n> [tamilan](#comment_26_1NRVBTxrbgEFdVBNLczx4Cc6NV3H4Pykzc): Okay, I feel like a dumb idiot now. My sincere apologies. I can't bash about politicians, here in India, on twitter / facebook. My own relatives will come after me. I have seen a dear friend of mine got beaten up by RSS Goons (To compare, these people are like Proud Boys of USA) because he posted some shit about BJP (the current ruling party). This is sort of my safe-space where I can vent out my frustrations. I understand this will almost always be just like shouting into the void. But at-least I have got an outlet. So for me anonymity was a big selling point. I retract my previous statements.\n\nNo apologies needed. Just chill out. I've not felt like one was needed at all.",
				"added": 1629430663
			}
		],
		"1629104216_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj": [
			{
				"comment_id": 24,
				"body": "> [ssdifnskdjfnsdjk](#comment_1075_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): so in order to spread onion v3 trackers, someone just need to put such tracker to their tracker list in /Config and ZN should automatically spread it to others and others to others?Some untested ideas on how to actually setup v3 trackers are here.\n\nI imagine that he knows all of this already.",
				"added": 1629392635
			}
		],
		"1629402955_19BXHBD1GfYpSpvdHsuHJsJ97mYpxWjUE": [
			{
				"comment_id": 26,
				"body": "Where I live, we don't follow the narrative. I'm enjoying the freedom here while it lasts.",
				"added": 1629406414
			},
			{
				"comment_id": 30,
				"body": "> [hermetris](#comment_3_12stz6mJvqkxMd5EFrPB2RWa5WnEg1mo9X): Where do you live? Here it's the other way around! Here, people report each other to the police when someone doesn't do something exactly right!\n\nNewaygo County in Michigan.",
				"added": 1629467885
			},
			{
				"comment_id": 31,
				"body": "> [hermetris](#comment_4_12stz6mJvqkxMd5EFrPB2RWa5WnEg1mo9X): Oh man! You seem to have it good. I am in Germany ... and these stupid people (unfortunately you can't call it anything else) are really cruel!\n\nHow about \"stupid cunts?\"",
				"added": 1629479146
			}
		],
		"1627760364_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 27,
				"body": "> [ssdifnskdjfnsdjk](#comment_1076_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): under Tor hidden services, the assigned address to \"global\". [...]\n\nThis is why you have to manually setup TOR to provide an address itself, on top of the fact that the address provided by ZeroNet constantly changes between ZeroNet restarts.",
				"added": 1629428040
			},
			{
				"comment_id": 29,
				"body": "> [ssdifnskdjfnsdjk](#comment_1077_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Please can you kindly describe the steps to do it, i would like to run the v3 tracker too. My torrc is like this: [...]\n\nSee my first comment, second comment in this thread. Use port 15441.",
				"added": 1629467661
			},
			{
				"comment_id": 32,
				"body": "> [ssdifnskdjfnsdjk](#comment_1080_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): i have just enabled it by making sure my /etc/tor/torrc contains:HiddenServiceDir /var/lib/tor/ZeroNetHiddenServicePort 15441 127.0.0.1:15441and then restarted tor, then ZN, i see it created that directory and /var/lib/tor/ZeroNet/hostname contains v3 onion address (not want to disclose it atm), there are also files  hs_ed25519_public_key  hs_ed25519_secret_key and empty dir. authorized_clients. [...]\n\nDid you restart TOR? You need to use the address found in that folder.",
				"added": 1629479616
			},
			{
				"comment_id": 34,
				"body": "> [ssdifnskdjfnsdjk](#comment_1082_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Update: i have suspection that my habit to restart zeronet from py3 updater site causing the v3 patch be reset back to original ZN files :-/ [...]\n\nThat's very likely the case.",
				"added": 1629492073
			},
			{
				"comment_id": 36,
				"body": "> [anonymoose](#comment_38_12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq): I'm just reading now, has there been any news? or have you not found a way? [...]\n\nI've found a way before making that comment. I just had to inform you eventually.",
				"added": 1629581861
			}
		],
		"1629431360_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 37,
				"body": ">Couldn't it have been a Tor related problem?\nI think it's not.\n>Have you tried several times?15441 is the default port but can be changed, so I think there should be no problem\nBut there is a problem. I haven't tried many times on each device though.",
				"added": 1629593444
			}
		],
		"1629571045_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [],
		"1627703143_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj": [
			{
				"comment_id": 38,
				"body": "> [anonymoose](#comment_36_12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq): The current script is usable for source code : [...]\n\nThank you. I'll try using this version.",
				"added": 1629597525
			}
		],
		"1629852541_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne": [
			{
				"comment_id": 39,
				"body": "It will be banned worldwide like HCQ, wait and see. COVID-19 is a crisis the elite need to control us.",
				"added": 1630103513
			}
		],
		"1629748915_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK": [
			{
				"comment_id": 40,
				"body": "Likely the entire internet will be down, and unfortunately ZeroNet's local peer discovery is broken.",
				"added": 1630103788
			}
		],
		"1630138791_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 41,
				"body": "It loads fine for me.",
				"added": 1630150442
			}
		],
		"1630168786_1C8F8RUiVtKfuUfubu1qf2YmWCuFv5iSeV": [
			{
				"comment_id": 42,
				"body": "We know kxoid doesn't work.",
				"added": 1630168852
			},
			{
				"comment_id": 43,
				"body": "> [kxoiddoesntwork](#comment_1_1C8F8RUiVtKfuUfubu1qf2YmWCuFv5iSeV): Does anyone know how to setup a self hosted kxoid zeroid type site?\n\n@GitCenter, maybe.",
				"added": 1630171855
			}
		],
		"1630267315_19GAZbMhpKZtzLDL86SgaiHQbRNdahgoUj": [
			{
				"comment_id": 44,
				"body": "We're not hackers here. You came here with the wrong intentions.",
				"added": 1630271882
			},
			{
				"comment_id": 47,
				"body": "> [punibaelvezosarc](#comment_1_19GAZbMhpKZtzLDL86SgaiHQbRNdahgoUj): \"We're not hackers here.\" - You are not, but other are may be... I'd like to see here useFUL LINKS instead of useLESS  eggheads...  links from the darknet... anyway we are here on the darknet ... where can we find links about them if not here?\n\nTry .onion sites.",
				"added": 1630338860
			}
		],
		"1630276094_13K9xAHRgqygKe8PQ7bgoNxVu6zhj7dETt": [
			{
				"comment_id": 45,
				"body": "Set the viewport on your ZeroNet version of the site in content.json\n```\n \"viewport\": \"width=device-width, initial-scale=.8, user-scalable=0\",\n```",
				"added": 1630294594
			}
		],
		"1630296649_1Avop7FK7FLVvKV3jyxwyR57ib9d4NSZbF": [],
		"1630381630_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj": [
			{
				"comment_id": 48,
				"body": "I've listed all known and working TORv3 trackers on [Syncronite](/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o).\n\nNotice that I didn't list the tracker by @Anonymoose, because it's not working.",
				"added": 1630383187
			},
			{
				"comment_id": 49,
				"body": "> [caropc1v30](#comment_2_1648iPm6RztRAdrQX6jKxFkryJBKr5wauX): zero://k5w77dozo3hy5zualyhni6vrh73iwfkaofa64abbilwyhhd3wgenbjqd.onion2.72s (100% success)apparently working [...]\n\nIf you're replying to me, that's not the tracker I'm talking about.",
				"added": 1630394598
			},
			{
				"comment_id": 50,
				"body": "> [anonymoose](#comment_39_12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq): I've update the trackers list in ZeroNet_OnionV3 clearnet repo : [...]\n\nThe bullet points get in the way of a clean copy and paste.\n\nAlso, your tracker still isn't working.",
				"added": 1630428608
			},
			{
				"comment_id": 97,
				"body": "> [zeroseed6d](#comment_1_19TrKZA9ifR8bvPbL64AbNqttCDkWfErWF): Please add these new trackers! in next days all my V2 trackers will be converted to v3.  If you manage a tracker please consider to migrate it to V3 because within a month all v2 will be disabled and actually tor zeronet network is congested (many seeded files on galactichan can't be downloaded and also forums like zerotalk don't sync properly in tor always mode) [...]\n\nAdded to Syncronite.",
				"added": 1631903000
			},
			{
				"comment_id": 113,
				"body": "> [saqat](#comment_10_14NiXkEXrFAHokAohyiCv5PCAXLcEsvEUp): What does Syncronite do?\n\nSyncronite syncs with anonymoose's and ngosang's trackers lists, merges them together as Syncronite.html and publishes using crontab which periodically executes Syncronite.sh from my laptop.\n\nNothing is executed from your device, so there are no external calls. All you get is an hourly-updated trackers list.\n\nYou can see the trackers list [here](/raw/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/cache/1/Syncronite.html).",
				"added": 1633278845
			},
			{
				"comment_id": 124,
				"body": "> [phunpump](#comment_6_14pSxPyLcN166TsqVnVQK8ZPLwdzHTkdki): does the client need a reboot ?\n\nGenerally, yes, it's needed. Your trackers list might be shortened until you restart ZeroNet.",
				"added": 1633975687
			}
		],
		"1630436341_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 51,
				"body": "It's down for me too.\n\nAt least spammers can't create new IDs :P",
				"added": 1630439137
			},
			{
				"comment_id": 52,
				"body": "> [ozaichirah](#comment_29_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg): It just looks like ZeroNet is just slowly dying\n\nAnd here some have thought that Nofish wasn't threatened or killed. I also have yet to get a limit increase for styromaniac@zeroid.bit",
				"added": 1630440495
			},
			{
				"comment_id": 68,
				"body": "> [gy0ugwaosrzohfmf](#comment_14_15fT5qViKSdrrocTyvmC9xdRQrgxeFtV9d): I thought nofish controlled it?\n\nKaffie owns and controls it.\n\n> [gy0ugwaosrzohfmf](#comment_15_15fT5qViKSdrrocTyvmC9xdRQrgxeFtV9d): If you have an alternative to ZeroID, why did you fail to post a link to it?\n\n[Here is the link.](/1K3tM7irQqSX4Hx3JvNgkimkQzY6jPtBfz/)",
				"added": 1630813082
			},
			{
				"comment_id": 69,
				"body": "> [merithtk](#comment_120_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): Why not fork Zeronet and rebrand to KaffieNet, so while its compatible with ZeroNet, it utilizes a better base for things\n\n...or just rebrand KaffieID to ZeroID and fuck all the rest, if anything needs rebranding at all...\n\nThe very nature or spirit of ZeroNet being decentralized means we might as well forget about ZeroID by name or version.",
				"added": 1630821767
			},
			{
				"comment_id": 72,
				"body": "> [gy0ugwaosrzohfmf](#comment_16_15fT5qViKSdrrocTyvmC9xdRQrgxeFtV9d): Has anyone tried this \"tamas@zeronet.io\" address from the ZeroNet.io site?\n\nNot since ZeroID broke.",
				"added": 1630867209
			},
			{
				"comment_id": 73,
				"body": "> [xcape2net](#comment_962_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I forgot about that.  Thanks. [...]\n\nkaffieid.bit doesn't resolve. Didn't you get the memo?",
				"added": 1630896463
			},
			{
				"comment_id": 83,
				"body": "> [xcape2net](#comment_968_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Someone just told me KaffieID is not working on my zite, which is a ZeroTalk clone.  So, what is wrong with the way I included KaffieID below?\n\nI said that kaffieID.bit doesn't resolve, because the namecoin registration expired long ago.",
				"added": 1631108041
			},
			{
				"comment_id": 84,
				"body": "> [xcape2net](#comment_970_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): But, when I go to \"127.0.0.1:43110/kaffie.bit\" in my browser, I get to the right place...  Are you saying I need to change \"kaffie.bit\" to \"1A83ijw3boqTtqdLz8me7AqeK1nEK8yxeu\" in my code below?\n\nHmm. You're right that it works. I wonder if someone stepped in to rescue the domain name. Never mind what I've said.",
				"added": 1631135984
			},
			{
				"comment_id": 85,
				"body": "> [kaffie](#comment_1184_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): The proper zite for kaffie id is actually id.kaffie.bit, not kaffieid.bit. Though in the cert provider list it should read kaffie.bit, which would point to my homepage, rather than to the id zite.\n\nThanks, but I'm still having issues with all.js showing users.json kaffieID identity in the pop-up. It's now called KopyKate Audio & Video. I've sent you a ZeroMail.",
				"added": 1631138612
			},
			{
				"comment_id": 87,
				"body": "> [kaffie](#comment_1185_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Okay I made the changes that should make it work properly and put up a test comment with my kaffieid. If you don't want certain cert providers then just remove them from the content.json.\n\nIf you commented on a video or audio file, just know I already deleted those. I had to do so manually.",
				"added": 1631141089
			}
		],
		"1630522157_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 53,
				"body": "I've wanted to appoint you to be a backup admin for MOAB, because you're good at spotting spam bots by pattern.",
				"added": 1630523750
			},
			{
				"comment_id": 54,
				"body": "phoenixeagle@zeroid.bit",
				"added": 1630524919
			},
			{
				"comment_id": 55,
				"body": "> [xcape2net](#comment_939_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I'm not perfect.  Remember, I thought h3 was a robot.\n\nHe was worth a block anyway.",
				"added": 1630526643
			},
			{
				"comment_id": 56,
				"body": "> [xcape2net](#comment_940_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I agree with punibaelvezosarc@zeroid.bit and shameonyou@zeroid.bit, but I think papull@zeroid.bit is a person.  Either that, or he is a really good robot.\n\nYes, papull is a person.",
				"added": 1630527476
			},
			{
				"comment_id": 57,
				"body": "> [jeff](#comment_146_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): OK, I wasn't sure about papull. Thanks.\n\nHe's just a sheep.",
				"added": 1630529912
			}
		],
		"1630572582_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 58,
				"body": "> [gitcenter](#comment_1541_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Logs in debug mode would be great.\n\nHow do I enable debug mode again?",
				"added": 1630593911
			},
			{
				"comment_id": 161,
				"body": "> [gitcenter](#comment_1542_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): debug = True in zeronet.conf or --debug CLI option\n\nI hadn't had a problem on my new phone with LPDDR5, so it must be a DDR4 and below issue.",
				"added": 1635107796
			}
		],
		"1630592868_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 59,
				"body": "> [swashbuckler](#comment_65_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): What is the current limit you're exceeding?\n\nI've reset the limit back to where it was at 2000000. I think it was 3000000 or higher.",
				"added": 1630647426
			}
		],
		"1630778195_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 60,
				"body": "I think you're being illogical. By your logic, doxxing you to cause physical harm is free speech.",
				"added": 1630782430
			},
			{
				"comment_id": 61,
				"body": "> [xcape2net](#comment_950_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I guess so.  As I said, I'm not sure how to decide what to allow and what not to allow or even if I should be deciding at all.  What do you define as free speech?  What would you allow, and where would you draw the line?\n\nIf it's harmful, it's not free speech. Porn is not a statement in my mind, so that falls into a gray area for me, up to admins to decide. However, I feel it would be unfair if non-harmful fetishes were discriminated against. Say you like preggo porn and I don't. I don't think I should allow just some porn and not other fetishes that aren't harmful either.",
				"added": 1630789340
			},
			{
				"comment_id": 62,
				"body": "> [xcape2net](#comment_951_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Why is it not free speech if it's harmful?\n\nIt collides with life, liberty and the pursuit of happiness. I am okay with all opinions, however.",
				"added": 1630789529
			},
			{
				"comment_id": 63,
				"body": "> [xcape2net](#comment_952_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): So, if someone says something that starts a war, and a lot of people die, is that not free speech?\n\nIf it's a war defending the Constitution and Bill of Rights, it's free speech.",
				"added": 1630789760
			},
			{
				"comment_id": 64,
				"body": "> [xcape2net](#comment_953_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): So, free speech to you is whatever leads to ultimate good?\n\nNo, but the entire opposite isn't free speech. Take the Taliban, for example. They don't deserve a place on Twitter. They propagandize terrorism that is stone-age backward.",
				"added": 1630789934
			},
			{
				"comment_id": 65,
				"body": "> [xcape2net](#comment_954_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): What about anti-vaxers?  Many people may die as a result of believing false information.  Should they have free speech?\n\nPeople are injured or killed by vaccines on rare occasion. Body rights come first.",
				"added": 1630790124
			},
			{
				"comment_id": 66,
				"body": "> [xcape2net](#comment_955_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): What is a \"body right\"?  Is that the right to decide what to do with your own body?\n\nYes.",
				"added": 1630791032
			},
			{
				"comment_id": 71,
				"body": "> [xcape2net](#comment_960_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I did not know those things.  But one thing I have learned about anti-vaxer \"facts\" is that many are false, and they all need to be verified before being believed. [...]\n\nWatch Vaxxed and Vaxxed II.",
				"added": 1630852840
			}
		],
		"1630791791_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 67,
				"body": "> [gy0ugwaosrzohfmf](#comment_12_15fT5qViKSdrrocTyvmC9xdRQrgxeFtV9d): Why does ZeroID no longer work? Are there alternatives?\n\nBecause Nofish is MIA. Yes, there are alternative ID providers.",
				"added": 1630809131
			},
			{
				"comment_id": 74,
				"body": "> [6283822](#comment_119_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe): already working on this plan. due to time constraints it's taking too long.\n\nZeroID is working again.",
				"added": 1630944364
			}
		],
		"1630827774_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 70,
				"body": "In index.html, link to the CSS and JS files with **?v={site_modified}** following the file name.\n\nExamples:\n\n```\n<link rel=\"stylesheet\" href=\"css/all.css?v={site_modified}\" />\n```\n```\n<script type=\"text/javascript\" src=\"js/all.js?v={site_modified}\"></script>\n```\n\nThis will flush the browser cache for the site in question whenever the peer refreshes the page after you publish changes. Everyone should be using this feature. I didn't propose it for nothing.",
				"added": 1630828394
			}
		],
		"1630944991_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 75,
				"body": "> [bhqthpsx8q6wx7r1](#comment_2_1ATSif8GHYZiSgFWpQQ4dijmhV6iJyf4v7): I'm puzzled. Zeronet on Ubuntu really is a stand alone app without any transport. It gains Tor transport only after the Tor browser is opened (using it's proxy). So if the Tor browser is already compatible with V3 onions, why wouldn't Zeronet?\n\nhttps://community.torproject.org/onion-services/setup/install/\n\nFollow these instructions. Your distribution, I assume, is focal. That's what you need to enter.",
				"added": 1630969264
			},
			{
				"comment_id": 80,
				"body": "> [leonarddurden](#comment_43_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD): That's why unity and vision matter. Let's put our egos aside shall we and not be the \"next Zuckerberg\" but be the \"we the people\" and develop & market the way they taught us: [...]\n\nGood comment, but I'm pretty sure we're all already united towards the cause.",
				"added": 1631078397
			},
			{
				"comment_id": 90,
				"body": "> [xcape2net](#comment_972_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): So all the forks using the same blockchain?\n\nZeroNet doesn't use a blockchain.",
				"added": 1631142974
			}
		],
		"1631051842_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 81,
				"body": "> [robione](#comment_668_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): I have created energy based healing solutions for this that work. Send ZMail if needed. [...]\n\nDon't be condescending, please",
				"added": 1631106544
			}
		],
		"1631033012_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 82,
				"body": "> [anonymoose](#comment_43_12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq): Are you sure the step including \"File server external IP\" is necessary?I ask you this because it's the Tor daemon that manages the connections ( HiddenServices traffic comes from localhost to ZeroNet ) and without that setting the permanent trackers still seem to work properly.\n\nYes. I wouldn't know another way.",
				"added": 1631106967
			},
			{
				"comment_id": 96,
				"body": "> [anonymoose](#comment_46_12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq): No, for Trackers text area :zero://myv3onionhostname.onion:15441for File server external IP :myv3onionhostname.onion( without zero:// and :PORT ) [...]\n\nWith ```:PORT``` is how I entered it in both boxes.\n\nInstructions have been clarified.",
				"added": 1631902641
			},
			{
				"comment_id": 103,
				"body": "> [ssdifnskdjfnsdjk](#comment_1109_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I have question regarding \"File server external IP\" and \"Trackers\" text area on /Configboth should contain:zero://myv3onionhostname.onion:15441?Question 2: how to verify that i did the setup well and how that it is not working?\n\nYou simply have to check the trackers drop-down list on ZeroHello to verify whether or not it's working. The text overlaps, so you might need to copy and paste your tracker's line into a text editor to properly read it. If you have an error, then something might be wrong with your setup.",
				"added": 1632549704
			},
			{
				"comment_id": 221,
				"body": "I discovered that it doesn't work if you put in the port number on File server external IP. Instructions have been updated.",
				"added": 1636667309
			},
			{
				"comment_id": 225,
				"body": "> [ssdifnskdjfnsdjk](#comment_1137_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Why do you think it does not work? (i am not saying it does), i just would like to verify on my end.\n\nBecause my new tracker wasn't reachable (0% success). This was before switching to ZeroNet-Enhanced, so it's nothing to do with that.",
				"added": 1636728487
			},
			{
				"comment_id": 244,
				"body": "> [xanadu](#comment_70_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH): You can test mine zero://agufghdtniyfwty3wk55drxxwj2zxgzzo7dbrtje73gmvcpxy4ngs4ad.onion:15441\n\n> [ssdifnskdjfnsdjk](#comment_1148_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I have found your tracker in my ZN without adding it, i see it was added to Syncronite already. [...]\n\nYes. I'm running the v3 trackers list independent from Anonymoose since he isn't as active as I am. Please tag me when others post their trackers elsewhere and not in this thread. This thread is the preferred place.\n\nA warning though: I may remove trackers if they perform poorly. If performance improves, then notify me.",
				"added": 1637041967
			},
			{
				"comment_id": 268,
				"body": "> [6283822](#comment_137_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe): zerolink.ml Torv3 tracker : qn65si4gtcwdiliq7vzrwu62qrweoxb6tx2cchwslaervj6szuje66qd.onion\n\nThe port number is required. Edit it into your comment.\n\nEdit: I see the port number on ZeroLink.ml",
				"added": 1637386988
			},
			{
				"comment_id": 275,
				"body": "Additional trackers to Anonymoose's list:\n\nzero://ow7in4ftwsix5klcbdfqvfqjvimqshbm2o75rhtpdnsderrcbx74wbad.onion:15441\nzero://agufghdtniyfwty3wk55drxxwj2zxgzzo7dbrtje73gmvcpxy4ngs4ad.onion:15441\nzero://qn65si4gtcwdiliq7vzrwu62qrweoxb6tx2cchwslaervj6szuje66qd.onion:26117",
				"added": 1637471365
			}
		],
		"1631096303_1FfhKMAy1xwaRvaofCgaaMuRMa7M7iWkFx": [
			{
				"comment_id": 86,
				"body": "> [xcape2net](#comment_969_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Are you using Synchronite?\n\nIt's spelled Syncronite, because it uses crontab. No apology needed. Just sayin'.",
				"added": 1631139153
			},
			{
				"comment_id": 88,
				"body": "> [viodor](#comment_3_1FfhKMAy1xwaRvaofCgaaMuRMa7M7iWkFx): I'm testing it right now and have many trackers now (73/103). What is Synchronite? Yes, a trackerlist. Is it legit?\n\nIt has a script for crontab to automatically fetch and publish ngosang's trackers list from GitHub to ZeroNet, using my PC. Don't worry. Nothing is called from your end, just mine.",
				"added": 1631141337
			},
			{
				"comment_id": 89,
				"body": "> [swashbuckler](#comment_70_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): That's weird... So, I have 3 ISP's. While sitting on my main one, all day long I've had 0/XX trackers active, but in debug console some files of some particular zites were loading nonetheless. I've switched to another ISP, and immediately everything started to work out smoothly, and trackers appeared to be 50/XX active... I'm somewhat clueless about how this works...\n\nMaybe one ISP is blocking BitTorrent trackers. I've seen this at the library and Meijer. I don't know a way around it. Not even a VPN works at all.",
				"added": 1631141535
			}
		],
		"1622708750_1CfqeXAEhkGtTyDurpVFQA1UQMsWYi2nSR": [
			{
				"comment_id": 91,
				"body": "Americans are generally dumb. One adult told me that people don't get horny until 18 years old. He is a liberal, if that helps to make sense of it. To me, it doesn't make anymore sense of it.",
				"added": 1631152416
			}
		],
		"1631220839_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 92,
				"body": "> [kaffie](#comment_1191_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Some of the providers \"domain names\" aren't actual domain names. Such as polar.id and peak.id. Nanasi also isn't a domain name. So if you try to click \"register\" on those, it won't bring you anywhere. The popular ones, zeroid, kaffieid, kxoid, etc. should all bring you to the proper zites.\n\nNSS. I'm talking about the .bit ones.",
				"added": 1631245881
			},
			{
				"comment_id": 93,
				"body": "> [swashbuckler](#comment_73_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): I see no issues there. What providers exactly are you talking about? In my sidebar, all the providers I have (kaffie, zeroid, ifs.anon and zv.anon) are working - tested with comments, no problems spotted\n\nThe sidebar isn't having problems. It's the pop-up menu.",
				"added": 1631245943
			}
		],
		"1631309888_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 94,
				"body": "I'm thinking this should be a CSS file: ```src/Ui/media/scrollbars.css```",
				"added": 1631313852
			},
			{
				"comment_id": 133,
				"body": "@zeroseed7, can you include this file in your seedpacks?",
				"added": 1634192927
			}
		],
		"1631986324_1BxrMQR2odvohNyH3mgZo1z9fkj4qbjHLq": [
			{
				"comment_id": 98,
				"body": "Please use Syncronite's code for easy copying of text, @Anonymoose.",
				"added": 1632245030
			},
			{
				"comment_id": 99,
				"body": "I've updated Syncronite's script to merge your trackers list with ngosang's into a new file.",
				"added": 1632248043
			},
			{
				"comment_id": 218,
				"body": "Please remove the tracker starting with \"my\" as I had to reinstall Linux Mint.\n\nMy new tracker is: ```zero://ow7in4ftwsix5klcbdfqvfqjvimqshbm2o75rhtpdnsderrcbx74wbad.onion:15441```",
				"added": 1636666077
			}
		],
		"1632251247_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 100,
				"body": "> [anonymouslogin](#comment_339_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Thank you. New ID too?\n\nIDK what you mean by new ID. It's the same site but different file.",
				"added": 1632548695
			},
			{
				"comment_id": 102,
				"body": "> [poutre](#comment_10_187XJ7rohVms73dqM2XftFNLuASoeTMU4X): It looks like it's same ID, but the filename has changed.I put them both it the config form, don't know if it'll work, if i'm having trouble with trackers, i'll keep only the new one.\n\nJust use the new file path. Using both the old and new one is redundant considering they both use ngosang's list. The new one also has the v3 trackers from anonymoose's site, which the old one doesn't.",
				"added": 1632549168
			},
			{
				"comment_id": 107,
				"body": "Syncronite now updates hourly to get the latest file from Anonymoose's site as quickly as possible while hopefully not pissing off GitHub's servers.",
				"added": 1632720590
			},
			{
				"comment_id": 110,
				"body": "> [anonymouslogin](#comment_345_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Just the kxoid.bit part, is anyone else finding it impossible to create a new zeroid?\n\nI registered this ID while krixano was still around, so it's not exactly new.",
				"added": 1633212242
			}
		],
		"1632517987_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 101,
				"body": "#**DO NOT INSTALL THIS PLUGIN ON ANDROID. ZERONET WILL NOT START.**",
				"added": 1632548760
			},
			{
				"comment_id": 104,
				"body": "I'm hesitant to try this on my x86_64 Linux laptop. Does it work or does it not startup?",
				"added": 1632550041
			}
		],
		"1632662049_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": [
			{
				"comment_id": 106,
				"body": "I tell people that I use ZeroNet without embarrassment nor shame.",
				"added": 1632718527
			}
		],
		"1632925044_19TrKZA9ifR8bvPbL64AbNqttCDkWfErWF": [
			{
				"comment_id": 108,
				"body": "> [zeroseed7](#comment_1_1NAbpFqUHZXi4CmoA2v9pZrRrXNwvAJz8b): ^\n\nYour bundle is pre-configured for Syncronite? If so, that's pretty cool.",
				"added": 1632991230
			},
			{
				"comment_id": 109,
				"body": "Don't forget to mention that the latest ZeroNet Mobile beta includes this patch.\n\nhttps://github.com/canewsin/zeronet_mobile/releases",
				"added": 1632991678
			},
			{
				"comment_id": 122,
				"body": "> [zeroseed6g](#comment_13_1BxrMQR2odvohNyH3mgZo1z9fkj4qbjHLq): I dont have a Mac and i created this release but not tested It...☹️ I Will find a way\n\nI am macosquestions. I can test it for you on two different Macs.",
				"added": 1633673789
			},
			{
				"comment_id": 123,
				"body": "I didn't get to re-test the MacOS version yet.",
				"added": 1633973912
			}
		],
		"1630500048_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 111,
				"body": "> [saqat](#comment_14_14NiXkEXrFAHokAohyiCv5PCAXLcEsvEUp): What's Yggdrasil?\n\nhttps://yggdrasil-network.github.io/",
				"added": 1633278178
			}
		],
		"1633268142_14NiXkEXrFAHokAohyiCv5PCAXLcEsvEUp": [
			{
				"comment_id": 112,
				"body": "Yes, use Syncronite.",
				"added": 1633278372
			},
			{
				"comment_id": 128,
				"body": "> [epistemic](#comment_42_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L): Syncronite is used by pervs and people footprinting, scamming, blackmailing, etc.\n\nSo you're here to smear me?\n\n[This is Syncronite.sh](/list/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/cache/1/?file=cache/1/Syncronite.sh)\n\nA BitTorrent tracker is a special type of server that assists in the communication between peers using the BitTorrent protocol.\n\nIn peer-to-peer file sharing, a software client on an end-user PC requests a file, and portions of the requested file residing on peer machines are sent to the client, and then reassembled into a full copy of the requested file. The \"tracker\" server keeps track of where file copies reside on peer machines, which ones are available at time of the client request, and helps coordinate efficient transmission and reassembly of the copied file. Clients that have already begun downloading a file communicate with the tracker periodically to negotiate faster file transfer with new peers, and provide network performance statistics; however, after the initial peer-to-peer file download is started, peer-to-peer communication can continue without the connection to a tracker.\n\n",
				"added": 1634089511
			},
			{
				"comment_id": 132,
				"body": "> [deuxzaron](#comment_176_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): pretty sure he's just a troll lol\n\nThat or he assumed \"trackers\" meant something else, like assuming Scientology is about science. It's a logical leap.",
				"added": 1634187198
			},
			{
				"comment_id": 135,
				"body": "> [7uz8yu7gxwnhfgae](#comment_20_1CN7STVMU29Rme1tgVRRPj3ZA3H7m99Rei): Expertise is pretty thin here....but the force is with that Synchronite site. Clearly whoever is running it knows what they are doing. [...]\n\nI am the owner of Syncronite. I don't know enough to make it function fully.",
				"added": 1634313257
			}
		],
		"1633231545_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 114,
				"body": "I'll see you dead in three years. I tried warning people, but they won't listen. Enjoy your graphene oxide poisoning.",
				"added": 1633313399
			}
		],
		"1633268236_14NiXkEXrFAHokAohyiCv5PCAXLcEsvEUp": [
			{
				"comment_id": 115,
				"body": "Neither. We're just using regular ZeroNet patched by Anonymoose.",
				"added": 1633313553
			},
			{
				"comment_id": 116,
				"body": "> [xcape2net](#comment_987_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Link?  https://git.disroot.org/anonymoose/ZeroNet_OnionV3  ???\n\nCorrect.",
				"added": 1633371940
			},
			{
				"comment_id": 118,
				"body": "> [ssdifnskdjfnsdjk](#comment_1117_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): or by @zeroseed6d ? i have not yet tried it though: Zeroseed Pack V3-compatible fow Windows, Mac and Linux are out! [...]\n\nI thought you already applied Anonymoose's patch.",
				"added": 1633457468
			},
			{
				"comment_id": 119,
				"body": "> [saqat](#comment_20_14NiXkEXrFAHokAohyiCv5PCAXLcEsvEUp): What does the patches do?\n\nThe patch gives you TORv3 connectivity, therefore you can use TORv3 trackers.",
				"added": 1633494909
			}
		],
		"1633271108_14NiXkEXrFAHokAohyiCv5PCAXLcEsvEUp": [
			{
				"comment_id": 117,
				"body": "The text overlapping for TORv3 trackers also needs to be resolved.",
				"added": 1633419223
			},
			{
				"comment_id": 120,
				"body": "> [saqat](#comment_21_14NiXkEXrFAHokAohyiCv5PCAXLcEsvEUp): You're right!\n\nI've already fixed this on my laptop.\n\n```\n#Dashboard .tracker-status { text-align: right; width: 730px; display: inline-block; float: right; margin-top: -20px }\n```\n\nThen clear the browser cache(s).",
				"added": 1633495138
			}
		],
		"1633498111_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 121,
				"body": "> [darkasnight](#comment_9_13JuGiUNQFGijiA5NWsKsgv8YWBus5NvV1): Then you can't share all.css with others because it's checksum is different, i guess, i don't know...\n\nThat's correct. The site owner would have to modify and then publish the change themself.",
				"added": 1633673678
			},
			{
				"comment_id": 134,
				"body": "The \"Announcing\" text still overlaps. Bump it up to 777px.",
				"added": 1634280925
			},
			{
				"comment_id": 222,
				"body": "@zeroseed6g: @zeroseed7: @geekless:",
				"added": 1636668310
			},
			{
				"comment_id": 229,
				"body": "Bump",
				"added": 1636827815
			}
		],
		"1633786750_1CN7STVMU29Rme1tgVRRPj3ZA3H7m99Rei": [
			{
				"comment_id": 125,
				"body": "> [7uz8yu7gxwnhfgae](#comment_14_1CN7STVMU29Rme1tgVRRPj3ZA3H7m99Rei): I haven't added anything (the patch), yet my setup appears to be using V3 trackers. Only thing I can attribute this to might be the fact that I'm using the Tor browser proxy? So V3 may already be working for many even now? Wonder if any of this extends to the functioning of Zeronet itself? I mean, Zeronet always used V2 Hidden/Onion services to reach peers. Does anyone know for certain if that's gone now? V2 relays will soon be no more. Is it possible that the current version of ZeroNet can generate V3 onion peer links without update?\n\nIf you're on Linux, MacOS or Android, then you're likely using the latest TOR, so that explains why the newer path works better for you without requiring the patched version.",
				"added": 1633975884
			}
		],
		"1594083595_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 140,
				"body": "```while true; do inotifywait -e modify,create,delete,move -r /path/to/your/dir && \\ python3 zeronet.py siteSign address --publish done```",
				"added": 1634402411
			},
			{
				"comment_id": 152,
				"body": "```\n#! /bin/sh\nUSERNAME=\"styromaniac\"\nZERONET_ROOT_DIR=\"/home/${USERNAME}/ZeroNet\"\nSITE_ADDRESS=\"15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o\"\nSH_DIR=\"${ZERONET_ROOT_DIR}/data/${SITE_ADDRESS}/cache/1/\"\nV3_TRACKERS=\"127.0.0.1:43110/raw/13hNAdge5ntxJmcnKzAxeLCuyowJkdvFxF/trackers/v3_trackers.html\"\nCLEARNET_TRACKERS=\"https://ngosang.github.io/trackerslist/trackers_all_ip.txt\"\nOUTFILE1=\"${SH_DIR}v3_trackers.html\"\nTEMPFILE1=\"${OUTFILE1}.new\"\nOUTFILE2=\"${SH_DIR}_h_.html\"\nTEMPFILE2=\"${OUTFILE2}.new\"\n\nRESPONSE_CODE=$(curl --write-out \"%{response_code}\" \"${V3_TRACKERS}\" --output \"${TEMPFILE1}\")\n\n# If something went wrong getting v3_trackers.html\nif [[ ${RESPONSE_CODE} != 200 ]]; then\n  # Erase the temporal file and exit\n  rm -f \"${TEMPFILE1}\"\n  exit 1\nfi\n\n# Replace the old v3 trackers file with the new one\nmv \"${TEMPFILE1}\" \"${OUTFILE1}\"\n\nRESPONSE_CODE=$(curl --write-out \"%{response_code}\" \"${CLEARNET_TRACKERS}\" --output \"${TEMPFILE2}\")\n\n# If something went wrong getting trackers_all_ip.txt\nif [[ ${RESPONSE_CODE} != 200 ]]; then\n  # Erase the temporal file and exit\n  rm -f \"${TEMPFILE2}\"\n  exit 1\nfi\n\n# Replace the old clearnet trackers file with the new one\nmv \"${TEMPFILE2}\" \"${OUTFILE2}\"\n\n#Combine trackers files into Syncronite.html\ncat \"${SH_DIR}v3_trackers.html\" \"${SH_DIR}_h_.html\" > \"${SH_DIR}Syncronite.html\"\n\n# Sign and publish\n${ZERONET_ROOT_DIR}/zeronet.py siteSign \"${SITE_ADDRESS}\" --publish```",
				"added": 1634713757
			}
		],
		"1633989409_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 127,
				"body": "> [robione](#comment_679_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Your best bet is a local repair shop that isn't afraid to open the phone and replace the battery if needed. [...]\n\nThat's the tricky part.",
				"added": 1634020269
			},
			{
				"comment_id": 131,
				"body": "> [deuxzaron](#comment_178_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): If you're going to buy something from Amazon make sure it's FROM Amazon and not from someone selling on Amazon\n\nYeah, I should have mentioned that.",
				"added": 1634186563
			}
		],
		"1634089895_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [],
		"1634119367_1KVqHY2XVEyYYjmSaoH3v6qNRGLqkf5nDz": [
			{
				"comment_id": 130,
				"body": "Are you using [Syncronite](/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o)?",
				"added": 1634142294
			}
		],
		"1634306647_1CN7STVMU29Rme1tgVRRPj3ZA3H7m99Rei": [
			{
				"comment_id": 136,
				"body": "I believe sites won't have to be ported. It's just a transport layer, after all.",
				"added": 1634314521
			}
		],
		"1634306827_1CN7STVMU29Rme1tgVRRPj3ZA3H7m99Rei": [
			{
				"comment_id": 137,
				"body": "You mean to say that you only want TORv3 trackers?",
				"added": 1634331898
			}
		],
		"1620446786_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 138,
				"body": "@7uz8yu7gxwnhfgae",
				"added": 1634332904
			}
		],
		"1634240089_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 139,
				"body": "> [darkasnight](#comment_13_13JuGiUNQFGijiA5NWsKsgv8YWBus5NvV1): where he said that?\n\nIn an email.",
				"added": 1634401570
			},
			{
				"comment_id": 167,
				"body": "> [anonymoose](#comment_50_12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq): Last question, is the email exchange taking place using PGP? have you been able to verify the public key associated with him? [...]\n\nI don't use PGP nor GPG, so I can't verify that it's him cryptographically. Only way I can tell is that his English is broken.",
				"added": 1635225935
			},
			{
				"comment_id": 168,
				"body": "> [anonymoose](#comment_50_12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq): I could also do it (I was going to release it in my repo and eventually on Git Center the version of the final patch: remove inherent code v2, place correctly library and functions v3, create pack for any OS even if on windows and mac I recommend a GNU/Linux virtual machine) but I would like to clarify the situation nofish. [...]\n\nI would make pull requests to the fork by @Geekless if I were you, but you do you since I'm not in your shoes.",
				"added": 1635226334
			}
		],
		"1634431467_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 142,
				"body": "> [kvsltorier](#comment_3_1HyjxAVnACAPx356QebqX8kxQtWEZZCnpD): here\n\nAlright, so for some odd reason, v3_trackers only downloads to the proper directory when I manually run Syncronite.sh, not when Syncronite.sh is run by crontab. Same goes for the cat command.",
				"added": 1634434926
			},
			{
				"comment_id": 143,
				"body": "> [kvsltorier](#comment_4_1HyjxAVnACAPx356QebqX8kxQtWEZZCnpD): oh yeah just saying zeronet needs to fix the v3 trackers because they are ass\n\nNot what I meant. I meant the trackers list.",
				"added": 1634481490
			},
			{
				"comment_id": 144,
				"body": "> [anonymoose](#comment_51_12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq): could it be a matter of permissions? try to set the same user you use when you run it manually on sudo 20crontab 20-e.txt:*   *   *   *   * /home/styromaniac/ZeroNet/data/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/cache/1/Syncronite.shto*   *   *   *   *  <replace_with_linux_user>  /home/styromaniac/ZeroNet/data/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/cache/1/Syncronite.sh [...]\n\nNone of those worked. I'm on Linux Mint 20.2",
				"added": 1634484445
			},
			{
				"comment_id": 146,
				"body": "I've resolved all issues by using MG0's code as an example. Thanks for the effort in helping, anyway.",
				"added": 1634519015
			},
			{
				"comment_id": 147,
				"body": "Now I need the script to be modified so that trackers files aren't modified if the source file is unchanged. That way I can prevent having to sign and publish often and instead only sign and publish if there's a change.",
				"added": 1634528941
			},
			{
				"comment_id": 149,
				"body": "> [binary1173](#comment_80_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G): Does /bin/cat not have 755 perms? Owned by root. Sounds like the user is in not in /etc/cron.allow (none are by default, you have to add them and restart cron/crond.\n\nI resolved the issue. I forgot I needed quotation marks around the full paths in the sh file.",
				"added": 1634613482
			}
		],
		"1634194389_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 145,
				"body": "Turns out you just need the right file manager with a new permission \"Allow management of all files.\"",
				"added": 1634496302
			}
		],
		"1634584562_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 148,
				"body": "Set thread/core count.",
				"added": 1634584642
			}
		],
		"1634612688_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 150,
				"body": "This is one reason why I'm not on Facebook nor the rest of them. ZeroMe is my place.",
				"added": 1634621136
			}
		],
		"1634676729_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH": [
			{
				"comment_id": 151,
				"body": "Yes. Click the three vertical dots on ZeroHello.",
				"added": 1634679761
			}
		],
		"1634848133_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 153,
				"body": "For some reason I didn't see a mention on ZeroHello.",
				"added": 1634872984
			},
			{
				"comment_id": 154,
				"body": "I'll make a pull request for scrollbars.css and suggest a feature. I'm at work right now, on break. Also, the file editor needs an overhaul.",
				"added": 1634873062
			},
			{
				"comment_id": 155,
				"body": "I need a patch for the bundle you compile dependencies for, in order to use your fork.",
				"added": 1634886210
			},
			{
				"comment_id": 156,
				"body": "> [geekless](#comment_297_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Which versioning scheme should I use? [...]\n\nDeclare ZNE to be the official ZN release.",
				"added": 1634895452
			},
			{
				"comment_id": 157,
				"body": "> [geekless10](#comment_12_12PZt1S4yo8R3U46XFTnreGTjAhThDppe4): Not sure what you mean. I run ZeroNet in Docker using the docker file from the repo. I guess my code should run just as a drop in replacement for the original py3 sources.  [...]\n\nSo there's no easy way to use your fork yet?",
				"added": 1634930841
			},
			{
				"comment_id": 169,
				"body": "Not important, but I made a pull request for scrollbars.css and so far no response.",
				"added": 1635303693
			},
			{
				"comment_id": 170,
				"body": "> [geekless](#comment_303_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Hmmmm, should ZNE be renamed to ZeroNet2?\n\nZeroNet+\n\nJust like there's I2P+.",
				"added": 1635326699
			},
			{
				"comment_id": 172,
				"body": "> [geekless](#comment_305_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Designing a more informative sidebar: [...]\n\nI see your version has the file editor. It's crap on mobile devices (Android). Can you drop in a better editor?",
				"added": 1635394048
			}
		],
		"1634939571_1NZLf9ua6XqTiK2SLyJMhN9pZhUVJVPi6g": [
			{
				"comment_id": 158,
				"body": "I think that means everything's fine. IDK.",
				"added": 1634956634
			}
		],
		"1634952441_1CPMi1adhz1sh7dLTfbppPztkoH6wUUsS8": [
			{
				"comment_id": 159,
				"body": "https://patents.google.com/patent/US8066226B2/en?q=anti-gravity+drive&oq=anti-gravity+drive",
				"added": 1634973084
			}
		],
		"1635093320_17dzj9vkJR1oGT7Sp8LY17M95JR59r4zVt": [
			{
				"comment_id": 162,
				"body": "I'm just gonna sit here and watch what will obviously unfold if anyone bites.",
				"added": 1635123837
			},
			{
				"comment_id": 179,
				"body": "> [77ha01](#comment_9_19RBy1R77se3kYGB4ZLXCVowdKrcqL1h4A): private keys cannot be derived from the public address/public key\n\nExcept by quantum computers so powerful that they won't exist for a long time.",
				"added": 1635485461
			},
			{
				"comment_id": 180,
				"body": "> [musickiller](#comment_5_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): except if we have some leap in technology for some reason..\n\nI hear the US military is 30 years ahead of the technology we know.",
				"added": 1635544868
			}
		],
		"1632001629_178KvFeW5b16fZsNtWY3pDjLHj8aiLdTMK": [
			{
				"comment_id": 163,
				"body": "> [doctorforesight](#comment_2_1Hiqq5zy6pScwUbR3wzLL2MrprBEDBfK9z): I don't believe any race is genetically inferior, but at least within the US their culture is detrimental.\n\n\"I got the money, honey. I see the bitches itchin' for it. Come get sum and you'll taste gun powder. Yeah, I'm louder than a siren and disturb your wirin'. I'm a one man revolution, ready to blow these institutions open, hopin' to die for a cause. Get my brothers to write a clause to end the fuss. Yeah, I'm wheelin', dealin' and stealing drugs like true thugs do. Watch me carry a barrel and I'll see it through. I got flow like Pharrell and I can't stop 'til the last niggas drop\"\n\nThe above is typical \"gangsta\" rap. Took me about a minute to write it.\n\nYou're right that culture is the problem. Even white people get sucked into it.",
				"added": 1635133069
			},
			{
				"comment_id": 164,
				"body": "Get to know black people who aren't any part of the \"gangsta\" culture, who are proficiently literate and properly grammatical. They'll change your perspective.",
				"added": 1635133505
			}
		],
		"1634226877_1NAbpFqUHZXi4CmoA2v9pZrRrXNwvAJz8b": [
			{
				"comment_id": 165,
				"body": "> [robione](#comment_681_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Who wants to make a patcher script?\n\nAnonymoose already did.",
				"added": 1635134852
			},
			{
				"comment_id": 166,
				"body": "> [fornakter](#comment_10_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY): What is this?\n\nIt's for TORv3 support on ZeroNet.",
				"added": 1635180539
			}
		],
		"1635394573_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [],
		"1635472740_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 174,
				"body": "Always backup onto thumb drives and phones.",
				"added": 1635474367
			},
			{
				"comment_id": 175,
				"body": "> [merithtk](#comment_122_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): yeah. imma have a program setup whenever I login to my PC (before zeronet starts up) to copy it to my mega cloud...\n\nYeah, I've used the cloud before.",
				"added": 1635476745
			}
		],
		"1635477887_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 182,
				"body": "> [7uz8yu7gxwnhfgae](#comment_31_1CN7STVMU29Rme1tgVRRPj3ZA3H7m99Rei): Where is that setting?\n\nIt's pointed out on Syncronite. Please give feedback if it's still not clear.",
				"added": 1635588380
			}
		],
		"1635433479_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 178,
				"body": "> [7uz8yu7gxwnhfgae](#comment_30_1CN7STVMU29Rme1tgVRRPj3ZA3H7m99Rei): Didn't notice anything - other than ZeroNet running in a more stable fashion. If you did this - thank you.\n\nI'm glad to hear that!",
				"added": 1635481632
			},
			{
				"comment_id": 183,
				"body": "> [musickiller](#comment_7_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): This may be a wrong place to ask it, but why would someone need the Syncronite? Doesn't ZN just work as it is? [...]\n\nPeople are telling me that it improves ZeroNet's speed. I don't know if that's true or not.\n\nWe could certainly use more zero:// trackers, however, as they're dedicated to ZeroNet.",
				"added": 1635603520
			},
			{
				"comment_id": 199,
				"body": "> [musickiller](#comment_7_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): This may be a wrong place to ask it, but why would someone need the Syncronite? Doesn't ZN just work as it is? [...]\n\nZeroNet's default trackers are broken or no longer active.",
				"added": 1636140527
			}
		],
		"1635543925_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 181,
				"body": "I can see sites offline. Maybe they have CDN dependencies. Which sites are they?",
				"added": 1635545621
			}
		],
		"1635637273_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 184,
				"body": "> [geekless](#comment_312_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Do you have the IPv6 connectivity at all?\n\nYes, with Verizon Prepaid, unlimited data.",
				"added": 1635655181
			},
			{
				"comment_id": 187,
				"body": "> [musickiller](#comment_11_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): Dunno, works well on my end (example: zero://2602:ffc5::c5b2:53600.00s (100% success))\n\nMust be a ZeroNet Mobile bug.",
				"added": 1635711925
			}
		],
		"1635682514_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 185,
				"body": "I'm familiar with HTML and haven't used BBCode in a decade, but I would like to use them.\n\nI'd probably want all of the options you've listed if I knew all of them.",
				"added": 1635686284
			}
		],
		"1632719590_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 186,
				"body": "http://127.0.0.1:43110/14Zjt1CcoLXs6xu3huy5sYoK4PRMC1Qdfp/?Topic:1635395658_1GooUE19488nDwG3TdkM8seYAHct4gjkq4\n\n@ssdifnskdjfnsdjk:",
				"added": 1635692558
			}
		],
		"1635188644_1H6E7oCSjVBWLzepwc6BEtMxn4LcdtYSJ9": [
			{
				"comment_id": 188,
				"body": "> [xcape2net](#comment_990_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I believe the military is releasing a lot of photographic evidence and eyewitness anecdotal testimony that says they are here.\n\n[They're not a reliable source.](/Talk.ZeroNetwork.bit/?Topic:1633148426_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3/VFX+Artists+DEBUNK+Pentagon+UFO+Videos)",
				"added": 1635745758
			}
		],
		"1635824300_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD": [
			{
				"comment_id": 189,
				"body": "> [musickiller](#comment_15_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): I think filters work well, and I don't see any such posts. But thanks for a warning =)\n\nYeah, I've kind of changed my policy to blocking them too, except for racists still. Maybe I should say that on MOAB.",
				"added": 1635867322
			},
			{
				"comment_id": 190,
				"body": "I can see a pattern with the recent accounts making posts about \"wanting\" illegal porn.",
				"added": 1635918443
			}
		],
		"1625319270_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 191,
				"body": "> [c6wy2qr5wuyulvmg](#comment_4_1LyBdErVUSmC7QUQfYrbLYXxUaPGLEtqAw): Have you tried that new Synchronite setting? http://127.0.0.1:43110/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/ [...]\n\n*Syncronite\n\nI'm glad to hear of positive results due to the change.",
				"added": 1636002065
			}
		],
		"1636046548_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 192,
				"body": "He's a piece of shit.",
				"added": 1636086512
			}
		],
		"1636047405_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 193,
				"body": "> [smashbuckler](#comment_99_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): Not Found [...]\n\n```\n#! /bin/sh\nUSERNAME=\"styromaniac\"\nZERONET_ROOT_DIR=\"/home/${USERNAME}/ZeroNet\"\nSITE_ADDRESS=\"15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o\"\nSH_DIR=\"${ZERONET_ROOT_DIR}/data/${SITE_ADDRESS}/cache/1/\"\nV3_TRACKERS=\"127.0.0.1:43110/raw/13hNAdge5ntxJmcnKzAxeLCuyowJkdvFxF/trackers/v3_trackers.html\"\nCLEARNET_TRACKERS=\"https://newtrackon.com/api/100\"\nOUTFILE1=\"${SH_DIR}v3_trackers.html\"\nTEMPFILE1=\"${OUTFILE1}.new\"\nOUTFILE2=\"${SH_DIR}_h_.html\"\nTEMPFILE2=\"${OUTFILE2}.new\"\n\nRESPONSE_CODE=$(curl --write-out \"%{response_code}\" \"${V3_TRACKERS}\" --output \"${TEMPFILE1}\")\n\n# If something went wrong getting the TORv3 trackers list\nif [[ ${RESPONSE_CODE} != 200 ]]; then\n  # Erase the temporal file and exit\n  rm -f \"${TEMPFILE1}\"\n  exit 1\nfi\n\n# Replace the old v3 trackers file with the new one\nmv \"${TEMPFILE1}\" \"${OUTFILE1}\"\n\nRESPONSE_CODE=$(curl --write-out \"%{response_code}\" \"${CLEARNET_TRACKERS}\" --output \"${TEMPFILE2}\")\n\n# If something went wrong getting the clearnet trackers list\nif [[ ${RESPONSE_CODE} != 200 ]]; then\n  # Erase the temporal file and exit\n  rm -f \"${TEMPFILE2}\"\n  exit 1\nfi\n\n# Replace the old clearnet trackers file with the new one\nmv \"${TEMPFILE2}\" \"${OUTFILE2}\"\n\n#Combine trackers files into Syncronite.html\ncat \"${SH_DIR}v3_trackers.html\" \"${SH_DIR}_h_.html\" > \"${SH_DIR}Syncronite.html\"\n\n# Sign and publish\n${ZERONET_ROOT_DIR}/zeronet.py siteSign \"${SITE_ADDRESS}\" --publish\n```",
				"added": 1636086625
			},
			{
				"comment_id": 194,
				"body": "> [darkasnight](#comment_14_13JuGiUNQFGijiA5NWsKsgv8YWBus5NvV1): You can use another script to sign and publish when it's necessary\n\nCrontab doesn't let me for some odd reason.",
				"added": 1636125879
			},
			{
				"comment_id": 200,
				"body": "> [smashbuckler](#comment_100_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): @styromaniacOkay, I've came up with something like this: syncronite.sh [...]\n\nI don't see your kaffie account comment.\n\nThank you, BTW. I'll test this tonight.",
				"added": 1636154975
			},
			{
				"comment_id": 201,
				"body": "> [smashbuckler](#comment_100_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): @styromaniac Okay, I've came up with something like this: syncronite.sh [...]\n\nSo, I don't see anything like inotifywait in the script and I'm wondering if you expect me to change the sign and publish line to what Nofish gave me, which uses inotifywait.\n\n```\nwhile true; do inotifywait -e modify,create,delete,move -r /path/to/your/dir && \\ python3 zeronet.py siteSign address --publish done\n```",
				"added": 1636164122
			},
			{
				"comment_id": 209,
				"body": "> [smashbuckler](#comment_101_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): That method involves continuous process to be run, and if you're good with that, use that one - why not? :D But with that one piece of script you will be watching whole directory - and that will mean it will trigger if ANY file was changed inside that dir. If you want more granular control, I think that won't do (unless you will take combined trackers file into separate dir).\n\nYour script doesn't create Syncronite.html and doesn't sign and publish.",
				"added": 1636394159
			},
			{
				"comment_id": 212,
				"body": "> [smashbuckler](#comment_102_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): Ah yes, corrected a bit: syncronite.sh - tested, should work\n\nBTW, you got the tempfiles and outfiles switched around in your code and comments. 1 is for the TOR v3 trackers and 2 is for the clearnet trackers.",
				"added": 1636520734
			},
			{
				"comment_id": 217,
				"body": "> [swashbuckler](#comment_85_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): @styromaniacSuggestion: another source you can rely on? https://github.com/XIU2/TrackersListCollection\n\nDo they have 100% uptime? newTrackon's trackers do.",
				"added": 1636658985
			},
			{
				"comment_id": 219,
				"body": "> [smashbuckler](#comment_104_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): I see you've changed Syncronite sh to old version. Weird enough, I'm now getting messages about trackers unavailable on my Win10 machine >.< And it seems I can not post messages from there... (I also needed to delete my old comment since i have limit reached...)\n\nI have no issues on my end.",
				"added": 1636666128
			},
			{
				"comment_id": 220,
				"body": "> [swashbuckler](#comment_86_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): I'm not quite sure. There is a best.txt file, maybe those are with the best uptime.How do you measure an uptime of each tracker individually anyway?\n\nI use the API link: https://newtrackon.com/api/100",
				"added": 1636666854
			}
		],
		"1636087754_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 195,
				"body": "> [jeff](#comment_149_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): Sorry to hear about your condition, Styro. Parkinson's can be a bear. Glad you're doing better.\n\nIt's most likely medication-induced, not Parkinson's, if by any chance it takes a long time for the antipsychotics to cause the shaking symptom.\n\nHowever, Parkinson's runs on both sides of my family, so I'm not ruling it out yet.",
				"added": 1636139411
			},
			{
				"comment_id": 206,
				"body": "> [jeff](#comment_150_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): TD? There are recent developments and new drugs to help that.\n\nI'm not diagnosed yet for anything.",
				"added": 1636228473
			}
		],
		"1636134204_12rAw78P4EdKZWbBv2t3VYRFMiJEaf17SS": [
			{
				"comment_id": 196,
				"body": "Protonmail cannot be trusted. They'll rat you out.\n\nhttps://duckduckgo.com/?t=ffab&q=protonmail+french+authorities+ip&ia=web",
				"added": 1636139523
			},
			{
				"comment_id": 208,
				"body": "> [obrien1984](#comment_10_14a6MrpmfdWZ9543vTNP8Co6Fa4S7M9Mq9): the only information they can give is the IP and possible the two step information (SMS verification) they cannot access the email contents which lets face is where 99.9% of the incriminating information lies. [...]\n\nGood points.",
				"added": 1636393628
			}
		],
		"1636121010_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 197,
				"body": "You can bundle Syncronite with ZeroNet Mobile.",
				"added": 1636139763
			},
			{
				"comment_id": 198,
				"body": "> [0dd](#comment_1_1F1m6yXEp6ynXbP34c2n42wwXX6cNCyW97): https://github.com/ngosang/trackerslist [...]\n\nnewTrackon has the most stable trackers, so I've switched to that from ngosang's trackerslist.\n\nhttps://newtrackon.com/api/100",
				"added": 1636140222
			}
		],
		"1636174431_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 202,
				"body": "> [c6wy2qr5wuyulvmg](#comment_13_1LyBdErVUSmC7QUQfYrbLYXxUaPGLEtqAw): (shrug) Using NextDNS, blocklists, others ...along with GRSecurity patches and CPUS known immune to spectre bugs. [...]\n\nUnfortunately, I don't see a link to the NextDNS Android app source code. Still, it's an alternative to Blokada if Blokada isn't your favorite.",
				"added": 1636180433
			},
			{
				"comment_id": 204,
				"body": "Hmm... Neither Blokada nor NextDNS block the test links, so you're probably less safe using them.",
				"added": 1636185233
			},
			{
				"comment_id": 205,
				"body": "> [c6wy2qr5wuyulvmg](#comment_14_1LyBdErVUSmC7QUQfYrbLYXxUaPGLEtqAw): All of these DNS firewall schemes rely on user reports (usually delayed). They are mostly no different than antivirus products reliant on signatures... [...]\n\nThe problem is that these are old exploits. They should be on the DNS deny list already.",
				"added": 1636227143
			},
			{
				"comment_id": 210,
				"body": "> [ssdifnskdjfnsdjk](#comment_1131_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): being on Linux i do not see any big need for this malware protection. Somehow i tend to rather use public resolvers of smaller local company (check https://opennic.org )than ones ran by giants like google or cloudflare, but cloudflare i have set as secondary DNS. [...]\n\nYeah, I'm not concerned on Linux all that much, but it also depends on browsing habits. Mine are good.",
				"added": 1636408342
			},
			{
				"comment_id": 211,
				"body": "> [c6wy2qr5wuyulvmg](#comment_16_1LyBdErVUSmC7QUQfYrbLYXxUaPGLEtqAw): Yes it's hard to catch them. But when you do - making the consequences physical is mandatory. No more larping invaders.....Make it real. Heads on a pike real.\n\nThe solution is forcing them to become white hat hackers. Their skills are needed.",
				"added": 1636520471
			},
			{
				"comment_id": 231,
				"body": "I've decided to go with Quad9 instead of Cloudflare. It seems to be more secure and private.",
				"added": 1636870490
			}
		],
		"1636121680_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 203,
				"body": "I'm interested.",
				"added": 1636184156
			}
		],
		"1636264432_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 207,
				"body": "> [musickiller](#comment_17_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): how can you change the name of a big file if it's not yours? Or it's not what you are doing?\n\nMy own file.",
				"added": 1636371443
			},
			{
				"comment_id": 215,
				"body": "@geekless:",
				"added": 1636567644
			}
		],
		"1636480186_17um7PR1kBcpsubiDZi7Be7uP6HYDFjyyV": [
			{
				"comment_id": 213,
				"body": "> [smashbuckler](#comment_103_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): Attempt to connect, connection error 10/10\n\nSame here. Also, I block clearnet access from my browser that I use for ZeroNet. No ZeroNet protocol for communicating on a ZeroNet site is no bueno for me.",
				"added": 1636523054
			},
			{
				"comment_id": 214,
				"body": "> [musickiller](#comment_20_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): Keeping a separate browser for zeronet is quite hardcore xD I remember doing it back in the day... [...]\n\nOn Android, Samsung Internet Browser for ZeroNet and Chrome or Firefox for clearnet. I'm not very concerned over privacy, but about security. I needed browsers that are automatically updated, so I stick with those the most. However, I do also use DuckDuckGo's browser. On desktop, I use Firefox.",
				"added": 1636564554
			},
			{
				"comment_id": 216,
				"body": "> [musickiller](#comment_21_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): You use a separate browser on a mobile phone??! O_O whow... how did you keep standard brower from going online? [...]\n\nUse Safing Portmaster for PC and a rootless firewall for Android.\n\nI warn you though: Portmaster can be confusing and it prevents Warpinator from working.",
				"added": 1636599059
			}
		],
		"1636690136_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 223,
				"body": "> [nyzdoctn7g4obdcz](#comment_1_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha): It's working well on the unmodified zeronet . Why take the chance of breaking it?\n\nHow would I break it? I already decided to maintain it myself and the reachable trackers ratio is superb. I'm aiming for quality over quantity.",
				"added": 1636694396
			}
		],
		"1636751716_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 226,
				"body": "Firefox says, \"Connection is not secure.\"",
				"added": 1636753751
			}
		],
		"1636696143_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 227,
				"body": "> [musickiller](#comment_23_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): Can you list a few best new features? I saw github commits, but they are showing everything, so maybe I've missed something.. [...]\n\nA verify files feature, wait to shutdown until processes complete, a stats link on ZeroHello and a more informative sidebar. I don't know all of the features yet, but most likely they are useful.\n\nThere are also some bug fixes to how ZeroNet handles the network.\n\n@geekless: could fill you in.",
				"added": 1636754110
			},
			{
				"comment_id": 228,
				"body": "> [zeroseed7](#comment_8_1NAbpFqUHZXi4CmoA2v9pZrRrXNwvAJz8b): i will try it as soon as possible!\n\nBe sure to to keep a copy of your old ZeroNet install, because \"save for optional files\" means your optional files will be gone. You need to seed from the old copy to your new copy.",
				"added": 1636797534
			},
			{
				"comment_id": 230,
				"body": "> [swashbuckler](#comment_89_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): Okay, I think it works with the latest TOR bundle, meek bridge and all the stuff (this message was sent through TOR, and my Ip is changed during the launch, as console shows).The only bottleneck is that you have to runtor --service install -options ControlPort 9051 on win to run it as a service and open corresponding port.I think it somehow needs to be embedded into init script.\n\n[You can set that in torrc.](/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/faq/)",
				"added": 1636859495
			},
			{
				"comment_id": 232,
				"body": "There seems to be a bug with reaching trackers in general. My laptop using the fork is getting poor tracker connectivity and my phone without the fork is doing great.",
				"added": 1636878205
			},
			{
				"comment_id": 235,
				"body": "How many of us overwrote old ZeroNet with the new ZeroNet? Could that be the source of the problem(s)?",
				"added": 1636895397
			},
			{
				"comment_id": 236,
				"body": "> [ssdifnskdjfnsdjk](#comment_1141_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): possibly not the issue cause, because i have used blank directory for my clone, yet i have seen this issue with trackers drop to like only 3 trackers or like 17 trackers where in Tor enabled mode i see 58 trackersHere is described how i have switched from ZN to ZNE, you can do it too.\n\nOne thing to note is that the Config page doesn't work for ZNE OotB unless there's a trackers.json file present.\n\nReachable trackers is about 50%.\n\nFor some reason one IPv6 tracker works. I have an IPv4-only ISP at my apartment. Only thing I believe explains this is that I have 6to4 tunneling. I haven't enabled bootstrapper on this copy yet.",
				"added": 1636899044
			},
			{
				"comment_id": 237,
				"body": "> [ssdifnskdjfnsdjk](#comment_1142_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): that seems good, (i expect you are using Syncronite) [...]\n\nYes. Now I have ~70%.",
				"added": 1636902103
			},
			{
				"comment_id": 245,
				"body": "I just found out that there's a script in the folder that you need to execute as root: install-dep-packages.sh\n\nThis resolves the trackers issue everyone was having.",
				"added": 1637043393
			},
			{
				"comment_id": 249,
				"body": "> [ssdifnskdjfnsdjk](#comment_1150_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): i have not found such file on my HDD (ZNE cloned) nor in repo: https://github.com/zeronet-enhanced/ZeroNet/search?q=install-dep-packages.shplease be more descriptive\n\nhttps://github.com/zeronet-enhanced/ZeroNet\n\nI see the file.",
				"added": 1637124242
			},
			{
				"comment_id": 255,
				"body": "> [nyzdoctn7g4obdcz](#comment_14_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha): exits\n\nThere's an edit button.",
				"added": 1637190816
			}
		],
		"1636880911_16ukhBysrYmoN34SB4vprrDqJnsLNMVbXX": [
			{
				"comment_id": 233,
				"body": "https://duckduckgo.com/?t=lm&q=18++porn&ia=web\n\nThis is obviously a test post to see how we respond.",
				"added": 1636881643
			}
		],
		"1636904962_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 238,
				"body": "> [xanadu](#comment_68_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH): It looks more like IPv6 :)\n\nExactly. I need to know how it's set up.",
				"added": 1636924011
			},
			{
				"comment_id": 239,
				"body": "IP Address v6: \tIPv6 2a03:b0c0:1:d0::f52:1\nIP Location: \tUnited Kingdom,    England,    London\nIP Reverse DNS (Host): \t2a03:b0c0:1:d0::f52:1\nIP Owner: \tDigital Ocean, Inc Digital Ocean, Inc\nOwner IPv6 Range: \t2a03:b0c0:1:: - 2a03:b0c0:1:ffff:ffff:ffff:ffff:ffff\nNo. of IP in Range: \t1,208,925,819,614,629,174,706,176  ipv6 addresses\nOwner Address: \t270 Lafayette St, Suite 1206, New York, NY, 10012, US\nOwner Country: \tUSA\nOwner Phone: \t+1-347-985-0306\nOwner Website: \twww.digitalocean.com\nOwner CIDR: \t2a03:b0c0:1::/48\nWhois Record Created: \t11 Mar 2015",
				"added": 1636927372
			}
		],
		"1636861616_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 240,
				"body": "> [nyzdoctn7g4obdcz](#comment_5_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha): Can you provide a new thread focused on \"current best update practices\" for existing ZeroNet servers which make use of the Tor browser SOCKS  proxy?\n\nI know nothing on that topic.",
				"added": 1636998961
			}
		],
		"1636969808_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 241,
				"body": "Bitcoin developers are already prepared for quantum computers. They're waiting until quantum computers are powerful enough.",
				"added": 1636999047
			}
		],
		"1636974716_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH": [
			{
				"comment_id": 243,
				"body": "You're not using ZNE, correct?",
				"added": 1637037834
			}
		],
		"1637082772_13eFYXgRCcFkMGph4LXaYnbZP54AzzuZoY": [
			{
				"comment_id": 248,
				"body": "It works out of the box. There's nothing that you have to do but navigate to a .bit ZeroNet address.",
				"added": 1637095828
			},
			{
				"comment_id": 253,
				"body": "> [musickiller](#comment_27_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): By the way, is there some docs about how to setup it on the zites? I've updated my musickiller.bit with a blocklist, gotta update the zite too, I guess\n\nProbably, but I haven't registered a .bit domain ever, so I'm of no help here.",
				"added": 1637178069
			}
		],
		"1636765653_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [],
		"1637164951_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha": [
			{
				"comment_id": 251,
				"body": "Yes. On a proxy, I've seen nearly 6,000 seeders for Syncronite. I don't see that many on my devices.",
				"added": 1637166119
			},
			{
				"comment_id": 252,
				"body": "> [xanadu](#comment_86_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH): For me is like 3-5 trackers active and about 80-110 peers\n\nI usually have ~80% trackers working with the original ZeroNet. With ZNE, I have a lower percentage, because it's also trying to reach IPv6 trackers when that's usually not possible, because of my IPv4-only ISP, and most TOR-less zero:// trackers aren't working with ZNE, probably because (I believe) it's using a newer OpenSSL version.",
				"added": 1637177814
			}
		],
		"1637126540_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha": [
			{
				"comment_id": 254,
				"body": "> [killerwhale905](#comment_4_1PB1YKkXjDp7fy4WC1bB9iw6V9Hp2thxWN): So do people just come to 0net to be toxic and racist?😂\n\nNo. Racists come here to be lambasted.\n\nOP, I'm white and perfectly fine with PoC in entertainment. You're just a triggered retard.",
				"added": 1637190355
			},
			{
				"comment_id": 257,
				"body": "> [killerwhale905](#comment_5_1PB1YKkXjDp7fy4WC1bB9iw6V9Hp2thxWN): I am not triggered. i really dont care what people say on here. its a free-for-all. i just think theres a more educated way to express their annoyance of african americans in the media.\n\nOP as in nyzdoctn7g4obdcz. I was talking to him, not you, on the second line.",
				"added": 1637205749
			},
			{
				"comment_id": 258,
				"body": "> [nyzdoctn7g4obdcz](#comment_20_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha): Understand this. Most don't care what you think, or care to listen to your woke prattle. But when you act entitled to change the thinking of others - you've crossed a line. And this world has no mercy for manipulative punks. MANY whites WILL seek the absence of niggers. And there's nothing you can do about it. Many niggers will seek the absence of whites. And that's their prerogative too. [...]\n\nWe're not woke, we're just not ignorant. You're willing to participate in the race war that establishment democrats want.",
				"added": 1637213698
			}
		],
		"1637100321_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH": [
			{
				"comment_id": 256,
				"body": "> [nyzdoctn7g4obdcz](#comment_18_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha): As always, it depends on what is actually the truth. But when top officials get unconditionally caught doing things like this - they should be killed. The risk to do that needs to be taken. The public just has been too lax on government officials. This is why they keep using us. Only real consequences matter. [...]\n\nYou're glowing.",
				"added": 1637190902
			},
			{
				"comment_id": 259,
				"body": "> [nyzdoctn7g4obdcz](#comment_26_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha): I was always a sunshine person :)\n\nI'm guessing you don't know what I mean by \"glowing.\"",
				"added": 1637268762
			},
			{
				"comment_id": 261,
				"body": "> [nyzdoctn7g4obdcz](#comment_33_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha): Actually do. But you may have revealed yourself as humorless :)\n\nYou just didn't make me laugh.",
				"added": 1637285097
			}
		],
		"1637214620_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 260,
				"body": "> [obrien1984](#comment_17_14a6MrpmfdWZ9543vTNP8Co6Fa4S7M9Mq9): what if the 3 owners all go like nofish? same situation.\n\nThat's unlikely, IMO. Also, I've tagged a fourth person just now.",
				"added": 1637269252
			}
		],
		"1637276652_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha": [
			{
				"comment_id": 262,
				"body": "Why not share this on ZeroMe Luna?",
				"added": 1637285171
			}
		],
		"1637305080_18DQw1RXP4gQcqPcYrxZEPzc55fXAv16eQ": [
			{
				"comment_id": 263,
				"body": "That's why [MOAB](/1LgqZfbtr6dukbjHdjWBEmmthq1shEv3y1) exists. It's a blocklist for those concerns you have.",
				"added": 1637305278
			},
			{
				"comment_id": 264,
				"body": "> [ibudder](#comment_2_18DQw1RXP4gQcqPcYrxZEPzc55fXAv16eQ): also what are those \"trackers\" in the upright corner, i have my tracker blocker on, those shouldnt exist, i have legit privacy concerns here\n\nThose are BitTorrent or BitTorrent-like trackers. Have you never used BitTorrent before?",
				"added": 1637336312
			}
		],
		"1637322366_172aTiZARYuYxYznMn42L36cZGuUjv11dr": [
			{
				"comment_id": 265,
				"body": "They're trying to start pandemic 2.",
				"added": 1637351346
			},
			{
				"comment_id": 267,
				"body": "> [jeff](#comment_157_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): It was a hoax.\n\nhttps://lbry.tv/@SaltyCracker:a/smallpox-vials-accidently-found-in-big:d",
				"added": 1637384019
			}
		],
		"1637341086_1Q3bW6Z7c5Fe8Nnr9T93pEBgSrR5erPgyk": [
			{
				"comment_id": 266,
				"body": "I don't use TOR always mode. My identity is public knowledge. However, I don't blame anyone if they keep their IP address and identity hidden.",
				"added": 1637378948
			}
		],
		"1637356810_19WSeHt4WNqbUNWahvcMwfwdjE1wDxmnjt": [
			{
				"comment_id": 269,
				"body": "OP is a vegan faggot.",
				"added": 1637390146
			}
		],
		"1637391430_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 270,
				"body": "> [xanadu](#comment_92_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH): I use MOAB fine on forked ZeroNet\n\nYeah, no shit. It's an owner problem, not a user problem.",
				"added": 1637423679
			},
			{
				"comment_id": 271,
				"body": "> [xanadu](#comment_93_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH): Ah ok. Though we still not know what error is exacly.\n\nThe error is gone now. But, trackers are still more stable on Nofish's ZeroNet, so I'm sticking with it.",
				"added": 1637439911
			},
			{
				"comment_id": 273,
				"body": "> [xanadu](#comment_94_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH): Intresting I have trackers issues on both fork and patch. I use always Tor.\n\nI use TOR enabled.",
				"added": 1637452133
			}
		],
		"1637385216_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 272,
				"body": "> [jeff](#comment_158_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): Uh, what do you think is in the smallpox vaccine?\n\nProbably deactivated cowpox.",
				"added": 1637449412
			}
		],
		"1637431016_1PB1YKkXjDp7fy4WC1bB9iw6V9Hp2thxWN": [
			{
				"comment_id": 274,
				"body": "It's easy if you use Cinnamon DE.",
				"added": 1637454098
			}
		],
		"1637504933_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 276,
				"body": "I approve!",
				"added": 1637505202
			},
			{
				"comment_id": 277,
				"body": "ZeroMail needs mobile optimization.",
				"added": 1637505342
			},
			{
				"comment_id": 279,
				"body": "> [killerwhale905](#comment_18_1PB1YKkXjDp7fy4WC1bB9iw6V9Hp2thxWN): A redo for zerohello for mobile would be nice as well!\n\nI'm thinking it should be like an Android launcher.",
				"added": 1637538660
			},
			{
				"comment_id": 283,
				"body": "> [zkjfqdyi4men9zbi](#comment_2_1ASkZyuG6Jmfm7AjwGCCo7Sy4QMiBDgRkp): There was a fellow years ago who argued that moving to a Blake hash would solve many problems. That's a big jump...but long term might be worth considering. My biggest criticism of the existing ZeroNet is it's \"heaviness\". I much prefer lightweight and fast software.\n\nBlake3",
				"added": 1637621248
			},
			{
				"comment_id": 284,
				"body": "> [6283822](#comment_139_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe): Tag more users you know.\n\nThere are too many I know, so I'll just bump this thread with this comment and not make any new threads for a while, ensuring visibility.",
				"added": 1637622271
			},
			{
				"comment_id": 286,
				"body": "> [killerwhale905](#comment_24_1PB1YKkXjDp7fy4WC1bB9iw6V9Hp2thxWN): looks like this one is by geekless. the username that created this repo is geekless. it could be him.\n\nIt is.",
				"added": 1637724368
			}
		],
		"1637516974_1PB1YKkXjDp7fy4WC1bB9iw6V9Hp2thxWN": [
			{
				"comment_id": 278,
				"body": "Assume the worst, I guess.",
				"added": 1637524031
			},
			{
				"comment_id": 280,
				"body": "> [zkjfqdyi4men9zbi](#comment_3_1ASkZyuG6Jmfm7AjwGCCo7Sy4QMiBDgRkp): If I recall, Play just contained standard torrents. So could you explain the utility of that to me because I still don't get it. In contrast, I2P torrenting provides pretty complete protection.\n\nIt predated big file support in ZeroNet, and with many seeders on BitTorrent, there was an advantage to BitTorrent's bandwidth over ZeroNet's, so there wouldn't be a transition to serving movies via ZeroNet.",
				"added": 1637601489
			},
			{
				"comment_id": 281,
				"body": "> [killerwhale905](#comment_22_1PB1YKkXjDp7fy4WC1bB9iw6V9Hp2thxWN): Its just a catalog with magnet urls. for torrenting.\n\nI know.",
				"added": 1637607000
			}
		],
		"1637569184_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH": [
			{
				"comment_id": 282,
				"body": "Tor 0.4.6.8 (recommended)\n\nIs this what you have?\n\nFollowing my instructions, this is what you get.",
				"added": 1637621167
			},
			{
				"comment_id": 285,
				"body": "> [xanadu](#comment_97_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH): On Ubuntu 20.10 I got Tor 0.4.5.6On Ubuntu 20.04 I got version from September 2020\n\nThen you didn't follow the right directions.",
				"added": 1637623003
			}
		]
	},
	"comment_vote": {
		"8_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"11_13GmZWNCZqPELbMy6ujquVGqYz77wiQ5RY": 1,
		"3_1Phd1v4EgBWqCeAjGD7gtspkpFL8Z6GbkP": 1,
		"3074_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"139_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": 1,
		"15_1BsPbjfj4b6ab9t9gPeQiTTr9zc5fSXYJQ": 1,
		"16_1BsPbjfj4b6ab9t9gPeQiTTr9zc5fSXYJQ": 1,
		"118_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"117_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"1536_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"662_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"663_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"1076_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"2_12ECmMn6jBG8mXqziiAt5s9S8mbtmsL71u": 1,
		"140_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"141_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"9_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD": 1,
		"329_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"330_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"23_17KQehVm2u5r4GAjqkC3jRcxepzK6ri51W": 1,
		"64_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": 1,
		"169_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"35_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK": 1,
		"35_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj": 1,
		"39_12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq": 1,
		"29_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg": 1,
		"1176_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"7_13K9xAHRgqygKe8PQ7bgoNxVu6zhj7dETt": 1,
		"13_15fT5qViKSdrrocTyvmC9xdRQrgxeFtV9d": 1,
		"132_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"1097_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1546_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"961_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"43_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD": 1,
		"1184_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"42_12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq": 1,
		"1186_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"59_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": 1,
		"45_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD": 1,
		"1192_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1190_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"46_12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq": 1,
		"35_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L": 1,
		"80_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": 1,
		"14_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"984_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"9_1BxrMQR2odvohNyH3mgZo1z9fkj4qbjHLq": 1,
		"10_1BxrMQR2odvohNyH3mgZo1z9fkj4qbjHLq": 1,
		"343_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"3_1NAbpFqUHZXi4CmoA2v9pZrRrXNwvAJz8b": 1,
		"288_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"34_1NrJoibEdrXzVEwJxwyMtHs79G9G29YmV4": 1,
		"645_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"1_15JM5ADNgUtiyKtrkeojneyGY9DyYuFwz2": 1,
		"2_19g2CS28ASKFNJYSsP1jRbsY4uNMyiPMg1": 1,
		"2_15JM5ADNgUtiyKtrkeojneyGY9DyYuFwz2": 1,
		"1_16AJ9b5xA1cGPoWqrCQSi1TiNR3Hp8ASiE": 1,
		"2_1PqpTzD5hPkLQjPgMcgardTbCnbatWbwy4": 1,
		"11_139GxzZpmsFVAWStAGMgwWwgpSKC3qkAAG": 1,
		"154_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"2_16AJ9b5xA1cGPoWqrCQSi1TiNR3Hp8ASiE": 1,
		"2_1L4u9yoxDkhRSqkQGddh73gRg9oFWWn9y3": 1,
		"4_1NRE1HXTrFT9uH9N84FbiQ59FAffw554UP": 1,
		"323_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"4_1B4ktEg3pXXwnTrX7NfkL8AUdhy2puKes2": 1,
		"68_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": 1,
		"164_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"427_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"19_14NiXkEXrFAHokAohyiCv5PCAXLcEsvEUp": 1,
		"989_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"176_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"181_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"21_1CN7STVMU29Rme1tgVRRPj3ZA3H7m99Rei": 1,
		"3_1HyjxAVnACAPx356QebqX8kxQtWEZZCnpD": 1,
		"97_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": 1,
		"298_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"12_12PZt1S4yo8R3U46XFTnreGTjAhThDppe4": 1,
		"16_1MieUGUUVUxVmvuLNGcTXt9wVBSqpeztDT": 1,
		"1_1EBe7Vd6gbAUU4egHUGriHShgMtcx2oQKj": 1,
		"7_19RBy1R77se3kYGB4ZLXCVowdKrcqL1h4A": 1,
		"2_1Hiqq5zy6pScwUbR3wzLL2MrprBEDBfK9z": 1,
		"1121_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"3_15QcShLK8Q3sy4kJiJydfmzLue1zMoYwRC": 1,
		"179_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"1_1PhKRUSRcgdvTe1X3SLNYe7CmpaFDn92HB": 1,
		"1_1E22iXWCkyfdJiBmkP3XEuAK9hp7uj8tJ7": 1,
		"173_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"8_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": 1,
		"683_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"51_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD": 1,
		"304_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"305_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"122_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": 1,
		"5_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ": 1,
		"2_1Cpr9kX9gxHKgmfaGVoxoAdMdYZLVUt2QC": 1,
		"686_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"309_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"2_1NZLf9ua6XqTiK2SLyJMhN9pZhUVJVPi6g": 1,
		"2_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ": 1,
		"1113_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"318_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"4_1KaN3y1iWg1yktfnvm5isci2LaqubETcDd": 1,
		"14_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ": 1,
		"13_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG": 1,
		"41_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH": 1,
		"15_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ": 1,
		"2_148jFFH43GX5qkcpTXmeRiTaYJahpiWrSW": 1,
		"1_1Ej4267R8CipXfNUqkYrxrjzJ46ThsZ6e3": 1,
		"5_1LyBdErVUSmC7QUQfYrbLYXxUaPGLEtqAw": 1,
		"9_1N5YTyNeraRGksf76WNQiJ3ZB2ZMMa4pnf": 1,
		"4_1LyBdErVUSmC7QUQfYrbLYXxUaPGLEtqAw": 1,
		"7_1LyBdErVUSmC7QUQfYrbLYXxUaPGLEtqAw": 1,
		"9_1LyBdErVUSmC7QUQfYrbLYXxUaPGLEtqAw": 1,
		"1_1F1m6yXEp6ynXbP34c2n42wwXX6cNCyW97": 1,
		"15_13JuGiUNQFGijiA5NWsKsgv8YWBus5NvV1": 1,
		"1_1P52LQ4PSWFYvAUU7TPYJwLjHAdjaC3Ht": 1,
		"1129_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"322_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"12_1LyBdErVUSmC7QUQfYrbLYXxUaPGLEtqAw": 1,
		"8_1LyBdErVUSmC7QUQfYrbLYXxUaPGLEtqAw": 1,
		"4_1D7CCaZGcLek1xMaAfvDkc7pqM18orDKKr": 1,
		"14_1LyBdErVUSmC7QUQfYrbLYXxUaPGLEtqAw": 1,
		"1_1KPFf5sSyxebo8hpK1FVUu4FKDUi5ovv3e": 1,
		"65_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg": 1,
		"64_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg": 1,
		"8_1AKTv64HemAWmM762raYNn8aeDNAoojaMd": 1,
		"1130_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"10_14a6MrpmfdWZ9543vTNP8Co6Fa4S7M9Mq9": 1,
		"1131_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"102_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": 1,
		"1132_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"18_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ": 1,
		"3_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha": 1,
		"106_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": 1,
		"60_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH": 1,
		"62_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH": 1,
		"73_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH": 1,
		"151_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"6_16zLpbqTz9hpy6E2oH3y7tHNiTyVsB4RiQ": 1,
		"3_1Q3KH2eZ26Y6fUcxJmVbiQKNAoMtMGWeB5": 1,
		"6_1PB1YKkXjDp7fy4WC1bB9iw6V9Hp2thxWN": 1,
		"1154_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"87_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH": 1,
		"23_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha": 1,
		"4_1Q3KH2eZ26Y6fUcxJmVbiQKNAoMtMGWeB5": 1,
		"53_12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq": 1,
		"1_1EDZUfGPEM5Wf55JjcM3utfFxuZiD9n7AH": 1,
		"156_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"91_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH": 1,
		"6_1Q3KH2eZ26Y6fUcxJmVbiQKNAoMtMGWeB5": 1,
		"9_16zLpbqTz9hpy6E2oH3y7tHNiTyVsB4RiQ": 1,
		"1163_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1164_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"140_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"1161_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"10_16zLpbqTz9hpy6E2oH3y7tHNiTyVsB4RiQ": 1,
		"1_1ASkZyuG6Jmfm7AjwGCCo7Sy4QMiBDgRkp": 1,
		"2_1ASkZyuG6Jmfm7AjwGCCo7Sy4QMiBDgRkp": 1,
		"3_1ASkZyuG6Jmfm7AjwGCCo7Sy4QMiBDgRkp": 1,
		"8_1Q3KH2eZ26Y6fUcxJmVbiQKNAoMtMGWeB5": 1,
		"160_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"155_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"134_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1
	}
}