{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1,
			"title": "Децентрализованный репозиторий",
			"body": "Утверждают, что git и mercurial являеются децентрализироваными. И да, можно согласится с этим, учитывая, что каждый пользователь работает с независимой копией. Но они не решают проблемы хранения и согласования изменений \"под редакцией\" одного или нескольких подписчиков. А если конкретнее - я не могу получить репозиторий имея некий ID и форкнуть свой репозиторий, со своим производным ID от репозитория некой редакции.",
			"added": 1503974404
		},
		{
			"topic_id": 2,
			"title": "Анонимность источников в ZeroNet",
			"body": "Задача Tor - максимально усложнить получателю контента найти отправителя и наоборот. Но Tor не решат задачу, которую решает ZeroNet - единственность источника. Будет ли работать (и будут ли проблемы) Tor, если контент по одному и тому же onion-адресу будет распостранять несколько хостов?\nНасколько я понимаю, ZeroNet сама по себе анонимная, только пока источник не распостраняет уведомления об обновлении, из которых можно узнать IP публикующего?",
			"added": 1504029250
		},
		{
			"topic_id": 3,
			"title": "Сервисы аналитики для ZeroNet",
			"body": "Нету никаких сервисов аналитики для ZeroNet типа Google Analytics?\nПолагаю хранить в базе зайта такие данные будет накладно",
			"added": 1504075313
		},
		{
			"topic_id": 4,
			"title": "VPS для нода Ethereum",
			"body": "Какие минимальные характеристики VPS дле легкого нода Ethereum должны быть?\nКакие преимущества parity перед geth --light кроме скорости и насколько заметна эта разница в скорости? Возможно, для parity можно сервер поменьше, например только 1 ГБ ОЗУ вместо 2-х?",
			"added": 1504075847
		},
		{
			"topic_id": 5,
			"title": "Подкажите протоколы для создания инфраструктуры на подобии ZeroNET",
			"body": "Нужна распределенная база данных и нотификации. Нужна аутентичность пользователей, которые в терминологии ZeroNET будут зайтами и нужен децентрализованый поиск по каким-то свойствах (строкам в длину до 256 байт), которыми зайт владеет. Впринципе я понимаю, что для этого достаточно ZeroNET и не выдумывать. Вот только приложения должно быть расширениям к хрому и работать по WebRTC в конечном итоге. Хотя на первых этапах расширение к хрому может коннектится и к локальному клиенту ZeroNET. Главное то не это, а то, чтобы быстро получать нотификацию и обновления по некуму свойству - вот это проблема. Поэтому я и ищу какой-то другой протокол, хоть и ZeroNET удобен как хранилище статических вестраниц и базы данных, возможно и не нужно.",
			"added": 1508982427
		}
	],
	"topic_vote": {
		"7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"1_1369mox3kHxHXHNGi12QXxbtpXi78ZZqnD": 1
	},
	"next_comment_id": 32,
	"comment": {
		"7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 1,
				"body": "База данных как-то синхронизируется и может скачиваться частично? Можно ли получать из базы только те данные, которые нужно?",
				"added": 1503222106
			},
			{
				"comment_id": 5,
				"body": "Трудно ли создавать сайты, которые бы работали и в обычном инете и здесь одновременно? Конечно можно заходить с обычного инета через шлюз, но ZeroNet работает заметно медленее...",
				"added": 1503892627
			},
			{
				"comment_id": 7,
				"body": "> [balancer73](#comment_146_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Например, сейчас сделал трансляцию ZeroBlogs → HTMLy Blogs: http://www.zites.cf/\nУ тебя там Disqus не работает\n\nВообщем архитектурно такая возможность не рассматривалась",
				"added": 1503913603
			},
			{
				"comment_id": 8,
				"body": "> [balancer73](#comment_147_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Да, я в курсе. И, в общем, пока ещё не спешу чинить. Я не уверен, что нужно комменты через Disqus делать. Не получится синхронизировать\nБыли бы хотя б какие-то. А для того, чтобы синхронизировать коментарии с инета в ZeroNet надо делать регистрацию, наверно",
				"added": 1503924499
			},
			{
				"comment_id": 9,
				"body": "> [balancer73](#comment_148_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): а авторы блогов об этом и знать не будут :)\nДа комментатор вообще может думать что это один блог",
				"added": 1503931526
			},
			{
				"comment_id": 10,
				"body": "> [balancer73](#comment_149_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Никто же не будет светить свои приватные ключи на постороннем ресурсе :) Т.е. для себя я сделаю двухсторонний синк, но будут ли это делать другие...\nА нету таких возможности как генерирования многих приватных ключей на основании мастер-ключа и их разделегирования при надобности? По стандарту биткоина есть можно создавать иерархию ключей, к примеру.\nВообщем вопрос сдесь возмно ли разделегировать. И можно ли сохранять данные в нескольких базах, чтобы предоставить разные доступы разным учасникам. Хотя это и, потенциально, может нарушить целостность данных",
				"added": 1503940013
			},
			{
				"comment_id": 11,
				"body": "> [balancer73](#comment_150_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): ZeroNet построена не на блокчейне.\nНо надо же какие-то независимые источники аутентификации кроме ZeroID. Для этого и ненадо велосипед придумывать, берется любой блокчейн и там создается транзация с соотвествующими данными и подписана соответсвующим приватным ключем, к примеру",
				"added": 1503947463
			},
			{
				"comment_id": 12,
				"body": "Полагаю можно создать свой ZeroID, зарегистрировав домен в NameCoin и запустив соответсвующий сервис?",
				"added": 1503947610
			},
			{
				"comment_id": 13,
				"body": "Сделал siteSign и sitePublish, но 1JcpTgRn1Vc1A3nKqWHRYsDGcFykwGTnWd так и не появился в сети",
				"added": 1503978487
			},
			{
				"comment_id": 15,
				"body": "python zeronet.py sitePublish 1JcpTgRn1Vc1A3nKqWHRYsDGcFykwGTnWd\nработает 60 секунд, в это время я открываю на неком десктопе на Windows. Папку 1JcpTgRn1Vc1A3nKqWHRYsDGcFykwGTnWd на 3 сервера. На этом десктопе на Windows пишет, что есть несколько пиров, но всеравно, по истечении некоторого времени пишет, что невозможно загрузить content.json . Т.е. получается, что в сети информация о таком зайте есть, но загрузить содержание невозможно? Полагаю sitePublish надо делать только раз, после чего можно просто запустить python zeronet.py ?",
				"added": 1504028603
			}
		],
		"1_1EHrBqNZLu3He8t98otjqezt5jRE8euGSA": [
			{
				"comment_id": 2,
				"body": "> [zendos](#comment_1_13bZTgLqR3tG9YCa1eYJ6z52GDv1LzHZRt): для файлообмена лучше ipfs использовать\n\nПробовал публиковать в ipfs выпуски radio-t, размер которых до 100 МБ. Они вообще не передавались. Хотя с файлами до нескольких мегабайт проблем небыло",
				"added": 1503222278
			}
		],
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 3,
				"body": "Привет из Тернополя",
				"added": 1503222325
			}
		],
		"2_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": [
			{
				"comment_id": 4,
				"body": "Зачем, если Telegram прекрасно невзламывают?",
				"added": 1503222417
			},
			{
				"comment_id": 16,
				"body": "Не думаю, что есть проблема сделать зайт опенсорсный с некими топиками-чатами, каждый из которых будет шифроваться отдельным ключем для чата + в каждого пользователя будет свой приватный ключ. Т.е. получится двойное шифрования - сначала сообщения шифруются (асимместрично) пользователем, а потом (допустим, симметричным) ключем чата...\nНо почему бы и для каждого топика/чата не создавать отдельный зайт? Т.е. месседжер должен бы работать с неким форматом зайтов. И отдельно использовать некие общие зайты с множеством топиков для получении информации и идентификации зайдов-чатов. Хотя я могу просто опубликовать messegersecretprotocol://ID зайда соотвествующего формата на Ru-ZeroTalk и люди будут добавлятся, но это не для параноиков)",
				"added": 1504030840
			}
		],
		"1_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS": [
			{
				"comment_id": 6,
				"body": "Я вот запускал на несколько часов у себя выходной tor-нод. Мой IP попал в список хостов, которые принимали в этом участия. Теперь не могу на некоторых имиджбордах постить",
				"added": 1503892764
			},
			{
				"comment_id": 24,
				"body": "> [miklosh](#comment_7_1FfJqTpKxtW6jzKnHLpUswhWHwwtYTz5YK): перейди на IPv6, используй прокси, vpn, tor и всё, делов то\nДа, можно IP в провайдера поменять. Это, наверно, единственный вариант. Насколько возможно сидеть в веб по IPv6 - это еще вопрос, т.е. насколько эго хостеры поддерживают",
				"added": 1504162089
			}
		],
		"1_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5": [
			{
				"comment_id": 14,
				"body": "Нету DHT, если кратко. В качества идентификатора репозитория можно использовать и URL (в формате //hostname/pathname, без указания протокола, к примеру), но неплохо было бы, если бы репозиторий можно было получать не имея доступа к URL",
				"added": 1504028205
			}
		],
		"2_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5": [
			{
				"comment_id": 17,
				"body": "Да, но вопрос о анонимости самого ZeroNet",
				"added": 1504037673
			}
		],
		"13_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 18,
				"body": "Опять $4600\nСкоро Эстония сделает ICO и выпустит эсткоин, так что, господа, вы уже знаете что покупать",
				"added": 1504075443
			},
			{
				"comment_id": 23,
				"body": "Блядь, я сука, бедный программист. Прошлого октября четко видел, что будет расти, но денег небыло куплять",
				"added": 1504161743
			},
			{
				"comment_id": 26,
				"body": "> [bplohish](#comment_5_1369mox3kHxHXHNGi12QXxbtpXi78ZZqnD): Ходят слухи, что все модные азиаты сейчас накинулись на namecoin.\n\nИ как это в цыфрах выражается?",
				"added": 1504171244
			},
			{
				"comment_id": 27,
				"body": "Будет падать до $3000 в ближайшие месяцы",
				"added": 1505184825
			},
			{
				"comment_id": 28,
				"body": "> [miklosh](#comment_10_1FfJqTpKxtW6jzKnHLpUswhWHwwtYTz5YK): так продавай, перезакупишься на дне\n\nЭто совет для тех, у кого деньги есть. Воопщем не думаю что он будет долго ниже $3000, но к концу года еще упадет до $2600 разок",
				"added": 1505527682
			},
			{
				"comment_id": 29,
				"body": "> [miklosh](#comment_10_1FfJqTpKxtW6jzKnHLpUswhWHwwtYTz5YK): так продавай, перезакупишься на дне\n\nЭто совет для тех, у кого деньги есть. Воопщем не думаю что он будет долго ниже $3000, но к концу года еще упадет до $2600 разок",
				"added": 1505527858
			},
			{
				"comment_id": 30,
				"body": "Ладно. Я забыл то, что думал в начале года. Меня удивило, когда он перешел черту в $1200, дальше я удивляться перестал. Здоровая стоимость где-то в районе $800-$1200, что приблизительно в 4 раза больше минимальной стоимости с 2015-го года. Да и не биток должен быть первым, а Ethereum или что-то более сложное. Вообщем-то прогнозирование - штука не благодарная, но то что хайп перешел в депресию - очевидно.",
				"added": 1505575491
			}
		],
		"1_1G8pkNe3Znuc2rE4d8JbwfgHWKrvwz4vfk": [
			{
				"comment_id": 19,
				"body": "PostgreSQL (реализовую логику здесь), Node.js, PHP, Python, .NET, Java, C/C++",
				"added": 1504076724
			},
			{
				"comment_id": 25,
				"body": "> [kryonn](#comment_1_1DKmpN6itS4MfRWqY5gfzThAHQHoz1bPXE): python/go, бывает окунаюсь в js, к счастью редко\nЗвучит как \"окунаюсь в дерьмо\". Почему же JavaScript всем так ненравится? Похоже, больше чем PHP... С PHP - это понятно",
				"added": 1504162195
			}
		],
		"1_1PChmSemiXAoFbhxQDUAivb4G5Qi7jUbUz": [
			{
				"comment_id": 20,
				"body": "А зачем, собственно? Это как браузер - вспоминаешь, запускаешь. Да и я мак выключаю только когда надо клавиатуру почистить",
				"added": 1504076916
			}
		],
		"3_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5": [
			{
				"comment_id": 21,
				"body": "Вообщем-то для хранения такой информации база то и не нужна, можно сохранять активность каждого пользователя за время пребывания в статичном файле.\nЕсли бы был стандартный внешний сервис, то его можно было бы легко отключать и даже зайты могли бы предлагать это делать.\nВ любом случае бизнес здесь без аналитики не обойдется. Хотя, пока, я здесь никакой комерции не видел.",
				"added": 1504078210
			},
			{
				"comment_id": 22,
				"body": "А для того, чтобы была поисковая система надо иметь возможность получать статический контент. Насколько проблематично рендерить зайды и получать статический снапшот DOM? Поисковая система тоже должна быть внешним сервисом с открытой базой",
				"added": 1504161516
			}
		],
		"3_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL": [
			{
				"comment_id": 31,
				"body": "Знание английского будет достаточным. Не знаю перешел ли гугл-транслейт на единственное семантическое ядро, но я бы посоветовал пользоватся переводом с английского на ческий. Хотя на русский тоже должно неплохо переводится, посколько языки не совсем уж чужие",
				"added": 1508983206
			}
		]
	},
	"comment_vote": {
		"3_1CTfYHpT4BrXndZbGxvsuZUhiEgbMwiwdi": 1
	}
}