{
	"next_comment_id": 4,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [yvesrogne](#comment_1_1HN5pCyG5g1483VcFueZNvGv4MkA7yxjw1): Para los jovenes, Internet solo represente el grupo Google, Facebook, Twitter y Snapchat ^^\n\nTristemente. La mayoria lo usan para nada mas. Es triste, tanto potencial desperdiciado la mayoria del tiempo...",
			"post_id": 6,
			"date_added": 1477722404
		},
		{
			"comment_id": 2,
			"body": "> [ylavanda](#comment_1_1Q5ioFbfzY8XVdTPwhPhFzDzNaMyFiEGVR): Si realmente quieren hacer el cambio deberían tirar sus ordenadores/computadoras a la basura. Internet forma parte del problema, todo el torrente de información que no podemos asimilar es el mismo que nos idiotiza.\n\nCierto",
			"post_id": 6,
			"date_added": 1482622364
		},
		{
			"comment_id": 3,
			"body": "> [jop](#comment_1_1LuTR1QEnMJDUNLYbtsi7nzNfwcJGAyHRU): Si tomas el termino \"conspiracion\" como el peyorativo que usan los grandes medios para referirse a cualquier afirmacion hecha en contra de sus objetivos o intensiones, entonces ( y como dice @ylavanda: ) les seguiras creyendo todo y viviras en la comodidad y tranquilidad de esa realidad.\n> Por el contrario, si eres critico y no te quedas simplemente con la mascara o la superficialidad, y enfrentas las ideas entre si, y las pruebas... es probable que entres a preguntarte y a poner en duda todo... sobre todo las \"noticias\" que se exponen a diario.\n> ¿No te parece extraño que el grupo mayoritario de medios se dediquen a repetir todo lo que sus socios \"informan\" sin ponerlo en duda o hacerse mas preguntas?\n\nEntiendo tu punto. Pero estas suponiendo que me creó todo lo que los medios masivos dice, y no es cierto. Si estoy en ZeroNet, teniendo un Blog donde hice esta publicacion es por algo ¿no? \nNo me creo nada, porque se (desde pequeño, como redacte en el post) que siempre se oculta la verdad en cualquier medio y es una guerra de informacion. \nPor lo mismo, y por la tambien masiva informacion que se encuentra en internet, dudo de ambos. \nPero es cierto, la cuestion es dudar de ambos Y investigar bien la informacion que ambos. \nGracias por comentar :D",
			"post_id": 6,
			"date_added": 1484687412
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}