{
	"posts": [
		{
			"id": "68ebef0b-3752-4f3e-a608-ac7806d2ceda",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "6b6d5ec2-ea64-4724-9e2f-17d874d967e2",
			"body": "Whew lads..   So the question is... Will Q show up?   Is there some sort of trip-code thing here? \n\nI am a former qrb Bunker-anon Thanks to whoever set this up. ",
			"time": 1565135837824,
			"files": "[]"
		},
		{
			"id": "ddc75518-168a-409f-9968-64890dc69a6f",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "6b6d5ec2-ea64-4724-9e2f-17d874d967e2",
			"body": ">>6d344d58-c202-4ca4-9e30-bb6a25bcbf3e\nHit or miss for me... Sometimes I get a spinning wheel and sometimes I get a functional picture.  I have been here 5 minutes though and am using a phone as an internet connection because I am a Ruralfag so that could be my issue. ",
			"time": 1565136451880,
			"files": "[]"
		},
		{
			"id": "b40c0bd2-68e7-40ab-85d3-0638a49cbf11",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "6b6d5ec2-ea64-4724-9e2f-17d874d967e2",
			"body": ">>5a2df3fe-6295-4f4b-abe2-176c1a8eb9db\nhttps://en.savefrom.net/\n\nJewtube vid donwloader",
			"time": 1565136497704,
			"files": "[]"
		},
		{
			"id": "3a0ac640-58f9-4d3a-89a2-6a4dd79a5db1",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "6b6d5ec2-ea64-4724-9e2f-17d874d967e2",
			"body": ">>895b35ab-ab3a-49a1-baea-8c4f84665480\nAhhh beat me to it!  I was going to post this straight away.  Fucking wildshit right here. ",
			"time": 1565137415693,
			"files": "[]"
		},
		{
			"id": "9b88f701-09db-410c-904f-cbb60ffd3090",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "6b6d5ec2-ea64-4724-9e2f-17d874d967e2",
			"body": ">>89636d51-43fd-4d87-8820-9fb332bea23f\nIf you are not home, stay home and if you have to go out go armed.  Don't take your wife and kids to some theme park or something retarded like that. ",
			"time": 1565137688550,
			"files": "[]"
		},
		{
			"id": "2f9589b4-01d8-481d-8b64-184fe528907c",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "6b6d5ec2-ea64-4724-9e2f-17d874d967e2",
			"body": "Copy-pasta from v/QRV\n\nWe have everything.\n\nHow can we use what we know?\n\n————How do you ‘legally’ inject/make public/use as evidence?————\n\nWhat are you witnessing unfold?\n\nTrust the plan.\n\nQ\n\nThe [24hr Warning] was for them. Stated by an anon on QRV. Q-team was letting them know - you have 24 hours to reconsider what you are about to do ... if you decide to go ahead with it after 24 hours you are fucked.\n\n24 hrs later Wray dropped the “Q-anon followers are domestic terrorists doc.\n\nHow do you inject NSA evidence into a court case ... (mentioned by a QRV’r today) ... you make the target of your enemy a terrorist group. NSA evidence can only be used in a court of law if it is a terrorist attack.\n\nThe baddies realized they couldn’t blame the El Paso attack on Q now - because the NSA would get involved.\n\nBut, they still thought Wray was on their side. So they blamed the attack on Trump and Bernie and white nationalism. Thinking they’d be safe ... but, no, the FBI yesterday still fucking labeled it a Domestic Terror attack. They thought they still had the FBI!\n\nNow the NSA is involved and evidence can be injected.\n\nThen, yesterday (as a QRV’r said today) Trump said that AG Barr was going to assemble a “red flag” bill that would include “the Death Penalty for ‘perpetrators’ of these crimes.”\n\nThe baddies now know that the NSA is involved and they are fucked. They can’t pass the bill that will get several of their players the Death Penalty. And they sure as fuck can’t sit on their hands right now - this shit is going to unravel fast and they have no idea how to get ahead of it. Wray fucked them. He fucked them in the asshole. This is how The Awakening starts ... “you motherfuckers are killing us? Are you fucking kidding me? Wait. Wait a fucking minute ... what about our fucking kids??? The school shootings??? ... No fucking way .... no fucking way!!!!!”\n\nThey can smash their phones - they can drop their PC out of a 10-story window -it doesn’t matter this time. It was a fucking terrorist attack. You lose.\n",
			"time": 1565152417966,
			"files": "[]"
		},
		{
			"id": "0702b9c7-5a39-402a-8e5f-61cec065af7a",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "6b6d5ec2-ea64-4724-9e2f-17d874d967e2",
			"body": "I was looking at how this board works and it seems like it does not end at 751. I know a lot of people say 1000 but would it be better to just let run and then make a running notables list alongside it in the catalog?   ",
			"time": 1565153111973,
			"files": "[]"
		},
		{
			"id": "1a4a1a94-be24-4fa0-a438-b39434143dc3",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "6b6d5ec2-ea64-4724-9e2f-17d874d967e2",
			"body": ">>931493d0-790d-4e80-9ade-a7a6dbe50f17\nI am not a smart man..  That seems like a really good reason to cut it off at 1000 lol.  like 475 posts ago. ",
			"time": 1565154535563,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}