{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1593039165_14LPVXnk22dMWhxm27AvKFuD2u679rNkCq": 1,
		"1546121685_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1598474233_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1593039165_14LPVXnk22dMWhxm27AvKFuD2u679rNkCq": [
			{
				"comment_id": 1,
				"body": "privy <3 , S/O to https://thugcrows.com , https://tcp.direct , vxunderground , demonsaw.com. If you are looking for exchanging data or files, you should def join our  DemonSaw router  @ privy.ws port 1337 .",
				"added": 1597404279
			}
		],
		"1597408822_1G7AgufdSvApA47h2Y4JhFMViX1g5Q27ho": [
			{
				"comment_id": 2,
				"body": "> [otbtechnologies3](#comment_6_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc): Wouldn't be end-to-end encrypted that way, but would help with anonymity. Sure. [...]\n\nyou should try demonsaw, DPI resistant and you control your salt,ciphers, iterations. https://www.demonsaw.com/# feel free to join our router @ privy.ws port 1337",
				"added": 1597524968
			},
			{
				"comment_id": 3,
				"body": "> [otbtechnologies3](#comment_9_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc): I have several complaints: [...]\n\nwell  it was previously open and the encryption code is opensource (demoncrypt ) ,  there is an upcoming  version under another name is getting worked on which will satisfy your requests. Unfortunately mcaffee did NDA my friend eijah.\n```3.) Not compatible with any of the Beds which is what everyone is switching to now since a high level executive at Facebook took on a leadership role within The Linux Foundation this past week or so... Also, many others yet are switching to BSDs because some APTs even low level Black Hats can somewhat easily compromise many Linux Systems on the Market today... These individuals are ever increasing their level of sophistication in said attacks too due to the rapid increase in Linux users earlier this year...``` \n\nI'm a blackhat / datahoarder and I totally understand this but you could easily deploy it inside a bsd jail most of .so are also available on bsd.  I will forward this to eijah since operating system compatibility is  an important issue.\nThat's a huge misconception there is several malwares targeting openbsd and hbsd abusing their jails to remain hidden. No computer is safe from eavesdropping via sound. when ur psu can be turned into a receptor. Also a real APT will target hardware and not software, from risc chip to the bios.  Also u can reach 5 layers of sha512 AES , 2k characters salts with 30k iterations and changes it every 2 minutes  to me it sound post-quantum. Also like eijah mentioned @ defcon there is many opensource project which run privacy invasive script on their server  or simply tcpdump.  We are currently looking at NYM protocol and few others which could be implemented as alt protocol for users.",
				"added": 1597531105
			}
		]
	},
	"comment_vote": {
		"1_1NMB4YPEM1EfWsd1yUVwtLzJyZH8G8x5iv": 1,
		"1_16B2kbgd9t38JMZx3U4ADd7WQHAvR3ZEU9": 1,
		"3_1CTfEpEsVkNb5Lqs2y9zJJBmZ9kfYmCeoP": 1,
		"1_166cC3iVpxLQrFXrkoHRbJ7r6RB4ckJshz": 1,
		"30_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"10_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": 1
	}
}