{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1633786750,
			"title": "Check your Syncronite settings if ZeroNet is slowly degrading",
			"body": "http://127.0.0.1:43110/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/\n\nThe path published here has changed. If you still use the old path you won't be getting the benefits.",
			"added": 1633786749
		},
		{
			"topic_id": 1634306647,
			"title": "An idea for you \"forkers\"",
			"body": "Don't re-invent the wheel. ZeroNet might not be perfect, but it's still quite serviceable - especially if the Tor transport problem gets fixed.\n\nInstead start planning the next level of ZeroNet. One which runs ONLY through I2P and makes full use of what was learned from Zeronet. If you are real ambitious - work out ways to port existing Zeronet sites to your I2P Zeronet.\n\nSingle point failures should be eliminated within your new Zeronet.",
			"added": 1634306645
		},
		{
			"topic_id": 1634306827,
			"title": "I would like to access ALL my trackers through Tor V3 Hidden servers.",
			"body": "It's a worthy goal...even if unlikely reachable.",
			"added": 1634306824
		}
	],
	"topic_vote": {
		"1631131497_1LpWbu62NgT4wzh1k1XVDCW9qwENC7AQi1": 1
	},
	"next_comment_id": 32,
	"comment": {
		"1632343427_1NceP4NFjHrUbHM7dLUxyLtXbTCrgmgRda": [
			{
				"comment_id": 1,
				"body": "Posting is very slow now due to lack of peers. I wonder if the glowies took their ball and bat and went home? We'll miss those glowies. They always had better hardware than we did.",
				"added": 1633230690
			}
		],
		"1633231545_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 2,
				"body": "2 jabs of Pfizer here and no problems. But I've read enough to know I would never do it again. Too many inconvenient deaths, very bad record keeping (how would you know what is true), and the most corrupt corporations on the planet?\n\nI made the mistake of trusting health professionals. They are unworthy of that trust and are likely less informed than you are. Don't be me.\n\nhttp://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/?:users/1BpazHWKsD9aZ4xwg6n5hWNNLtGtkQn5zX:covid:0\n\nThere are risks with either paths, but at your age you should consider less risky alternatives. If we can believe their death counts...India made everyone look bad with their $2 Ivermectine treatment. Few deaths, and none from the vaccine.",
				"added": 1633235326
			}
		],
		"1624835115_129GZPA7VpPa3YaRRW2ani34CaowY5hYB8": [
			{
				"comment_id": 3,
				"body": "I'd be happy with a simple Tor V3 update. Would be extremely happy if I2P transport became an alternative.\n\nZeronet mostly works now. Privacy transport is the problem.",
				"added": 1633271683
			},
			{
				"comment_id": 4,
				"body": "> [sauron](#comment_2_1DMAiK5GgQzieWiy24LKz6NDkHJo8m5CLU): Fuck. I have the greatest username of zeronet. and it's dead\n\nYour name? Agreed. ZeroNet dead? Doesn't appear to be. Postings are fast this morning.\n\nBut at some point when you are using V2 Tor transport, Zeronet will simply stop. The new Tor relays no longer understand V2 - so they have no place to send you.",
				"added": 1633271842
			},
			{
				"comment_id": 5,
				"body": "> [xcape2net](#comment_880_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Where is SSL today?  Where is flash?  Are current Internet browsers still compatible with the Gopher protocol?  No.  Where are Ada and Jovial?  HTTP is being constantly updated--so fast that essentially everyone except Google has given up on trying to maintain current browsers.  And, not everything is backwards compatible.\n\nA version of gopher is actually coming back. So are many of the earlier decentralization schemes.",
				"added": 1633271934
			},
			{
				"comment_id": 6,
				"body": "> [insurgo](#comment_48_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2): More complicated then that. Protocols evolves, dependencies too. We are now stuck to specific versions, which will become obsolete and vulnerable. Forking is the solution.\n\n(meh) Zeronet would be fine if it just kept working. There are sections of Zeronet which do move lots of traffic. they don't need much help from anyone. But I'd argue that one of the things holding Zeronet back with the lesser used sites is that it lacks a single \"I want to seed everything\" button. The decision to omit that function was insane.",
				"added": 1633272242
			},
			{
				"comment_id": 7,
				"body": "ZeroNet does appear to be slowing down now. I suppose those Tor relay operators are updating. Once that update is in place - V2 Hidden service connections cannot be made.",
				"added": 1633412290
			},
			{
				"comment_id": 8,
				"body": "> [macosquestions](#comment_4_18fkVYZKgknM2YED1Te7sW1U2PNyjeJTt1): Open the right-side panel to seed all optional files.\n\nI've done that, but don't believe it globally affects seeding.",
				"added": 1633412603
			}
		],
		"1632948938_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 9,
				"body": "When war comes - I will kill these snake cult people. NO government is a trustworthy source, and no adult should ever be subject to censorship. It's the parent's responsibility to protect their kid from the real world.\n\nThe US government desperately requires a mass layoff. To many people with nothing productive to do.\n\nhttp://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/?:users/1kCmMmAkUuFRvWhU2CmjmHSUeZr3BJFFL:censorship:de66d78a-1872-414e-aa44-49f7de5b42e6",
				"added": 1633546114
			}
		],
		"1633740636_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 10,
				"body": "It's a great idea, and represents great internet invisible transport. But there's not much content on it and it lacks a killer app like Zeronet. If Zeronet ever acquired I2P transport - it would be formidable indeed.\n\nZeronet is that hydra headed monster they fear....but with no available roads - it will never reach and burn their kingdoms.",
				"added": 1633755598
			},
			{
				"comment_id": 11,
				"body": "> [dv1](#comment_72_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA): if more users install i2p , is it going to be faster ? Does Tor and I2P the same ? I dont think so as Tor seams to browse anonymouly the internet while i2p is for p2p communication. right ?\n\nThere are always exceptions (I think it to be a bad idea) but I2P is a closed system. One normally cannot access the conventional internet. Within that closed system almost any protocol can be routed. Even UDP.\n\nPersonally, I don't know if I2P will ever be faster. It seems to have plenty of fill router capacity right now - but still is slow. That's the trade. Speed for privacy. \n\nTor works on a different principle...which sometimes allows it to be very quick. Will say this...I2P probably gets more bang for buck invested than Tor or any other competitor. Just a measure of those involved with it? I worry their good luck won't last. Soooo many pissing contests flaring up within the open source world right now.  You vill submit to the tranny whines or else!\n\nMany are just leaving. Only way to bring em back would be to sponsor a tranny toss atop a tall Las Vegas hotel :)",
				"added": 1633820861
			},
			{
				"comment_id": 26,
				"body": "> [bunkeruser](#comment_1_1DeJpvgt4YmWUUVWkH7M2rvPrBxEBEHeEP): Zeronet is more intuitive than i2p.\n\nI agree. It's brilliantly simple.",
				"added": 1634606517
			},
			{
				"comment_id": 27,
				"body": "> [xanadu](#comment_33_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH): I2P is great issue is that speed is limited to slowest peer in your tunnel hops. Though I would love to see zeronet making eppsites distributed :)\n\nAnything similar to the old mixmasters will always be slower, but some of that can be compensated by having an adequate supply of fill routers online. Doesn't take much. Simple Atoms will move 1.5TB/mo.",
				"added": 1634606693
			}
		],
		"1632001629_178KvFeW5b16fZsNtWY3pDjLHj8aiLdTMK": [
			{
				"comment_id": 12,
				"body": "I'd argue it's not their fault they were born nigger. And they are only a problem when they escape their containment continent (how'd that happen?). But can understand your disgust, because niggers drag down everyone.\n\nSolution is simple. Return them to Africa. Everyone wins!",
				"added": 1633821577
			}
		],
		"1633786750_1CN7STVMU29Rme1tgVRRPj3ZA3H7m99Rei": [
			{
				"comment_id": 13,
				"body": "(shrug) New link appears to function better.",
				"added": 1633821700
			},
			{
				"comment_id": 14,
				"body": "> [styroonztephone](#comment_2_16ccgwR2q7w73azFgPQmxHtYNTUkqSvmMj): Only because it has more trackers.\n\nI haven't added anything (the patch), yet my setup appears to be using V3 trackers. Only thing I can attribute this to might be the fact that I'm using the Tor browser proxy? So V3 may already be working for many even now? Wonder if any of this extends to the functioning of Zeronet itself? I mean, Zeronet always used V2 Hidden/Onion services to reach peers. Does anyone know for certain if that's gone now? V2 relays will soon be no more. Is it possible that the current version of ZeroNet can generate V3 onion peer links without update?",
				"added": 1633835512
			},
			{
				"comment_id": 15,
				"body": "> [styroonztephone](#comment_2_16ccgwR2q7w73azFgPQmxHtYNTUkqSvmMj): Only because it has more trackers.\n\nActually appears to function much better. Thanks.",
				"added": 1634073713
			}
		],
		"1633895520_1BFxHVXHTKcnWLWPVKbTknZTAaiHz6tgcV": [
			{
				"comment_id": 16,
				"body": "(yawn) Just do your part to seed it glowie. We need the better hardware you bring to the table.",
				"added": 1634073861
			}
		],
		"1633498111_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 17,
				"body": "Thanks",
				"added": 1634074059
			}
		],
		"1634264493_19RBy1R77se3kYGB4ZLXCVowdKrcqL1h4A": [
			{
				"comment_id": 18,
				"body": "No. It's now just one of those things everyone must come to grips with....the fact that you'll often NEVER really know the truth. The media has done an excellent job of poisoning the well.\n\nGood rule of thumb? If you see it, or trust the source of a video - believe your own eyes. Don't let media spin alter your judgement.\n\nThough it's unlikely we'll ever really know the \"why\" of anything - fact should not be subject to interpretation. Unfortunately these days it is.",
				"added": 1634305431
			}
		],
		"1634240089_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 19,
				"body": "OK, that statement is meaningless to many people. And many do NOT wish to sign up with clearnet sites.\n\nSo why is nofish doing this? What possible rationale could he have?",
				"added": 1634305613
			},
			{
				"comment_id": 28,
				"body": "I don't see a pull request posted . My old signin won't work - because I used a disposable email. Now they test you every time you sign in (rolling eyes).\n\nGithub has been hacked before. Why would anyone give any site a real email?",
				"added": 1635217562
			},
			{
				"comment_id": 29,
				"body": "Tor V3 should come first, but if an I2P version was released - I'd seed it. I2P is a closed system. But any movement to that network must start somewhere.",
				"added": 1635276672
			}
		],
		"1633268142_14NiXkEXrFAHokAohyiCv5PCAXLcEsvEUp": [
			{
				"comment_id": 20,
				"body": "Expertise is pretty thin here....but the force is with that Synchronite site. Clearly whoever is running it knows what they are doing.\n\nGo with the flow for now.",
				"added": 1634305763
			},
			{
				"comment_id": 21,
				"body": "> [epistemic](#comment_42_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L): Syncronite is used by pervs and people footprinting, scamming, blackmailing, etc.\n\nYou are an idiot. KYS.",
				"added": 1634305837
			}
		],
		"1634306827_1CN7STVMU29Rme1tgVRRPj3ZA3H7m99Rei": [
			{
				"comment_id": 22,
				"body": "> [styromaniac@kxoid.bit](#comment_137_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): You mean to say that you only want TORv3 trackers?\n\nYes. privacy is under assault everywhere.",
				"added": 1634432703
			}
		],
		"1631131497_1LpWbu62NgT4wzh1k1XVDCW9qwENC7AQi1": [
			{
				"comment_id": 23,
				"body": "Maybe it's time to give up on these companies? Moving entirely to  anonymous P2P.\n\nEmail IS convenient, but is it worth the cost?",
				"added": 1634432897
			}
		],
		"1634306647_1CN7STVMU29Rme1tgVRRPj3ZA3H7m99Rei": [
			{
				"comment_id": 24,
				"body": "> [styromaniac@kxoid.bit](#comment_136_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): I believe sites won't have to be ported. It's just a transport layer, after all.\n\nBut it is closed to those not using I2P transport.",
				"added": 1634432969
			},
			{
				"comment_id": 25,
				"body": "> [7uz8yu7gxwnhfgae](#comment_24_1CN7STVMU29Rme1tgVRRPj3ZA3H7m99Rei): But it is closed to those not using I2P transport.\n\nYes. That's a feature.\n\nYou can't trust the clearnet or Tor because both are centralized.",
				"added": 1634606383
			}
		],
		"1635433479_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 30,
				"body": "Didn't notice anything - other than ZeroNet running in a more stable fashion. If you did this - thank you.",
				"added": 1635478912
			}
		],
		"1635477887_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 31,
				"body": "Where is that setting?",
				"added": 1635570714
			}
		]
	},
	"comment_vote": {}
}