{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "kIlombismo - Garveismo",
			"body": "Materiais de estudos sobre temáticas quilombistas e garveysta.",
			"added": 1609130278
		}
	],
	"topic_vote": {
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"1_1ExYhecdNveJBbZnjsxEyjs6FWq7XDv9dr": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1_1Ew86XmYg67eqxLWsQaXBhuzpcT55MhD3t": [
			{
				"comment_id": 1,
				"body": "a questão é quem em porcentagem estamos a frente no quesito segurança dos dados, vai depender muito dos usuários se atentarem com os links externos, por exemplo! Só de está fora dos domínios do GAFAM, ja modifica muita coisa!",
				"added": 1609129043
			}
		],
		"1_1BRQxSzsgNqS7nogbocSFc5i98Mv9SBChW": [
			{
				"comment_id": 2,
				"body": "TRECHOS DA INTRODUÇÃO AO LIVRO O QUILOMBISMO\n\nComo os conjuntos de políticas públicas articulados e encaminhados ao Governo pelo movimento negro em dois momentos posteriores - a Marcha Zumbi dos Palmares de 1995 e o processo da 3ª Conferência - , o quilombismo é também herdeiro de um movimento social que, já em 1945, apresentava suas propostas à Assembléia Constituinte encarregada de redemocratizar o país (Nascimento, 1982[1968]).\n\nA singularidade de O quilombismo está no fato de apresentar uma proposta sócio-política para o Brasil, elaborada desde o ponto de vista da população afrodescendente. Num momento em que não se falava ainda em ações afirmativas ou compensatórias, nem se cogitava de políticas públicas voltadas à população negra, o autor deste livro propunha a coletividade afro-brasileira como ator e autor de um elenco de ações e de uma proposta de organização nacional para o Brasil. Assim, sustentava e concretizava a afirmação de que a questão racial é eminentemente uma questão nacional.\n\nO quilombismo antecipa conceitos atuais como multiculturalismo, cujo conteúdo está previsto nos princípios de \"igualitarismo democrático (...) compreendido no tocante a sexo, sociedade, religião, política, justiça, educação, cultura, condição racial, situação econômica, enfim, todas as expressões da vida em sociedade;\" \"igual tratamento de respeito e garantias de culto\" para todas as religiões; ensino da história da África, das culturas, civilizações e artes africanas nas escolas.\n\nO ambientalismo também se faz presente, no princípio que \"favorece todas as formas de melhoramento ambiental que possam assegurar uma vida saudável para as crianças, as mulheres, os homens, os animais, as criaturas do mar, as plantas, as selvas, as pedras e todas as manifestações da natureza\".\n\nA propriedade coletiva da terra, o direito ao trabalho digno e remunerado, a prioridade para a criança, e a possibilidade da \"transformação das relações de produção e da sociedade de modo geral por meios não violentos e democráticos\" estão entre os princípios humanistas do quilombismo.\n\nO texto antecipa, também, a mais recente inovação na abordagem das relações raciais, que parte do aspecto relacional sugerido pela ótica de gênero. A categoria \"gênero\" implica relação entre homem e mulher, assim deslocando o foco da tradicional \"questão da mulher\".\n\nDa mesma forma, para compreender a questão racial é preciso focalizar tanto o privilégio desfrutado pelo branco como as desvantagens sofridas por negros. Já na década dos 1940 e 1950, Abdias e outros intelectuais negros, entre eles o sociólogo Guerreiro Ramos e o advogado Aguinaldo Camargo, vinham criticando o enfoque tradicional brasileiro sobre \"o problema do negro\".\n\nAtribuem ao escritor Fernando Góes a sugestão, feita numa atitude de fina ironia, de se realizar um Congresso dos negros para estudar o branco. Essa sugestão e suas implicações são retomadas, e dotadas de semelhante carga de ironia crítica, no texto de O quilombismo. Trata-se de mais uma afirmação do racismo como fenômeno relacional mais amplo, profundo e complexo que aquele denotado pela constatação das chamadas \"desigualdades raciais\".\n\nNesta obra, merecem um capítulo à parte, além de serem focalizadas em todos os textos, as peripécias específicas da mulher negra, que envolvem aspectos múltiplos e complementares. A questão racial e a de gênero se tecem juntos numa teia que hoje se denomina \"interseccionalidade\", conceito de certa maneira antecipado no conjunto das obras do autor ao integrar a mulher negra como prioridade temática de sua análise. Mais de uma década antes de instituir-se a reserva de vagas para mulheres nas listas de candidaturas a cargos políticos, constava entre os princípios do quilombismo o seguinte:\n\n12. Em todos os órgãos do Poder do Estado Quilombista - Legislativo, Executivo e Judiciário - a metade dos cargos de confiança, dos cargos eletivos, ou dos cargos por nomeação, deverão, por imperativo constitucional, ser ocupados por mulheres. O mesmo se aplica a todo e qualquer setor ou instituição de serviço público.\n\nO conjunto de textos deste volume vem contribuir para o registro histórico de aspectos pouco divulgados do pan-africanismo, um dos mais importantes fenômenos do século XX. Demonstra também uma continuidade e coerência com assuntos eminentemente contemporâneos, pois reconhecemos nestes ensaios, em particular no ABC e nos Princípios do Quilombismo, a formulação de idéias e polêmicas ainda hoje emergentes.\nA atualidade de O quilombismo não se esgota nos temas que apontamos. Creio que cada leitor irá vislumbrar, para além dessas questões, outras talvez mais interessantes.\n\nRio de Janeiro, outubro de 2001\nElisa Larkin Nascimento\n\nBIBLIOGRAFIA\n\n\nMOORE, Carlos (2002). Abdias do Nascimento e o surgimento de um pan-africanismo contemporâneo global. In: Nascimento, Abdias do. O Brasil na mira do pan-africanismo. Salvador: CEAO/ EDUFBA,.\n\nNASCIMENTO, Abdias do (2002). O Brasil na mira do pan-africanismo. Salvador: CEAO/ EDUFBA.\n\n__ . (1982[1968]). O negro revoltado, 2ª ed. Rio de Janeiro: Nova Fronteira. [1ª ed. Rio de Janeiro: GRD].\n__ . (1966). Carta aberta a Dacar. Tempo brasileiro, v. 4, n. 9/10, 2. Trim, 1966. [Diário do Congresso Nacional, suplemento, 20 abr., p. 15-17, lida na Câmara dos Deputados pelo então deputado Hamilton Nogueira.] In: Nascimento, Abdias do. O Brasil na mira do pan-africanismo. Salvador: CEAO/ EDUFBA, 2002.\n\n\nTrechos do Prefácio do livro O Quilombismo, 2ª ed. (Brasília/ Rio: Fundação Cultural Palmares/ OR Editora, 2002).",
				"added": 1609130394
			},
			{
				"comment_id": 3,
				"body": "ABC do Quilombismo\n\nNa trajetória histórica que esquematizamos nestas páginas, o quilombismo tem nos fornecido várias lições. Tentaremos resumi-las num ABC fundamental que nos ensina que:\n\na) Autoritarismo de quase 500 anos já é bastante. Não podemos, não\ndevemos e não queremos tolerá-lo por mais tempo. Sabemos de experiência própria que uma das práticas desse autoritarismo é o desrespeito brutal da polícia às famílias negras. Toda a sorte de arbitrariedade policial se acha fixada nas batidas que ela faz rotineiramente para manter aterrorizada e desmoralizada a comunidade afro-brasileira. Assim fica confirmada, diante dos olhos dos próprios negros, sua condição de impotência e inferioridade, já que são incapazes até mesmo de se autodefenderem ou de proteger sua família e os membros de sua respectiva comunidade. Trata-se de um estado de humilhação permanente.\n\nb) Banto denomina-se um povo ao qual pertenceram os primeiros\nafricanos escravizados que vieram para o Brasil de países que hoje se chamam Angola, Congo, Zaire, Moçambique e outros. Foram os bantos os primeiros quilombolas a enfrentar em terras brasileiras o poder militar do branco escravizador.\n\nc) Cuidar em organizar a nossa luta por nós mesmos é um imperativo\nda nossa sobrevivência como um povo. Devemos por isso ter muito cuidado ao fazer alianças com outras forças políticas, sejam as ditas revolucionárias, reformistas, radicais, progressistas ou liberais. Toda e qualquer aliança deve obedecer a um interesse tático ou estratégico, e o negro precisa obrigatoriamente ter poder de decisão, a fim de não permitir que a comunidade negra seja manipulada por interesses de causas alheias à sua própria.\n\nd) Devemos ampliar sempre a nossa frente de luta, tendo em vista: 1)\nos objetivos mais distantes da transformação radical das estruturas sócio-econômicas e culturais da sociedade brasileira; 2) os interesses táticos imediatos. Nestes últimos se inclui o voto do analfabeto e a anistia aos prisioneiros políticos negros. Os prisioneiros políticos negros são aqueles que são maliciosamente fichados pela polícia como desocupados, vadios, malandros, marginais, e cujos lares são freqüentemente invadidos.\n\ne) Ewe ou gêge, povo africano de Gana, Togo e Daomé (Benin); milhões de ewes foram escravizados no Brasil. Eles são parte do nosso povo e da nossa cultura afro-brasileira.\n\nEjetar o supremacismo branco do nosso meio é um dever de todo democrata. Devemos ter sempre presente que o racismo, isto é, supremacismo branco, preconceito de cor e discriminação racial, compõem o fator raça, a primeira contradição para a população de origem africana na sociedade brasileira. (Aviso aos intrigantes, aos maliciosos, aos apressados em julgar: o vocábulo raça, no sentido aqui empregado, se define somente em termos de história e cultura, e não em pureza biológica).\n\nf) Formar os quadros do quilombismo é tão importante quanto a mobilização e a organização da comunidade negra.\n\ng) Garantir ao povo trabalhador negro o seu lugar na hierarquia de Poder e Decisão, mantendo a sua integridade etno-cultural, é a motivação básica do quilombismo.\n\nh) Humilhados que fomos e somos todos os negro-africanos, com todos devemos manter íntimo contato. Também com organizações africanas independentes, tanto da diáspora como do continente. São importantes e necessárias as relações com órgãos e instituições internacionais de Direitos Humanos, tais como a ONU e a UNESCO, de onde poderemos receber apoio em casos de repressão. Nunca esquecer que sempre estivemos sob a violência da oligarquia latifundiária, industrial-financeira ou militar.\n\ni) Infalível como um fenômeno da natureza será a perseguição do poder branco ao quilombismo. Está na lógica inflexível do racismo brasileiro jamais permitir qualquer movimento libertário dos negros majoritários. Nossa existência física é uma realidade que jamais pôde ser obliterada, nem mesmo pelo Instituto Brasileiro de Geografia e Estatística (IBGE) ao manipular os dados censitários, nos quais erradicou o fator racial e de cor dos cômputos demográficos. E quanto a nosso peso político? Simplesmente não existe. Desde a proclamação da República, a exclusão do voto ao analfabeto significa na prática a exclusão da população negra do processo político do país.\n\nj) Jamais as organizações políticas dos afro-brasileiros deverão permitir o acesso aos brancos não-quilombistas a posições com autoridade para obstruir a ação ou influenciar as tomadas de posição teóricas e práticas em face da luta.\n\nk) Kimbundo, língua do povo banto, veio para o Brasil com os escravos procedentes da África meridional. Essa língua exerceu notável influência sobre o português falado neste país.\n\nl) Livrar o Brasil da industrialização artificial, tipo \"milagre econômico\", está nas metas do quilombismo. Neste esquema de industrialização, o negro é explorado a um tempo pelo capitalista industrial e pela classe trabalhadora classificada ou \"qualificada\". Como trabalhador \"desqualificado\" ou sem classe, ele é duplamente vítima: da raça (branca) e da classe (trabalhadora \"qualificada\" e/ou burguesia de qualquer raça). O quilombismo advoga para o Brasil um conhecimento científico e técnico que possibilite a genuína industrialização que represente um novo avanço de autonomia nacional. O quilombismo não aceita que se entregue a nossa reserva mineral e a nossa economia às corporações monopolistas internacionais, porém tampouco defende os interesses de uma burguesia nacional. O negro-africano foi o primeiro e o principal artífice da formação econômica do País e a riqueza nacional pertence a ele e a todo o povo brasileiro que a produz.\n\nm) Mancha branca é o que significa a imposição miscigenadora do branco, implícita na ideologia do branqueamento, na política imigratória, no mito da \"democracia racial\". Tudo não passa de racionalização do supremacismo branco e do estupro histórico e atual que se pratica contra a mulher negra.\n\nn) Nada de mais confusões: se no Brasil efetivamente houvesse igualdade de tratamento, de oportunidades, de respeito, de poder político e econômico; se o encontro entre pessoas de raças diferentes ocorresse espontâneo e livre da pressão do poder e prestígio sócio-econômico do branco; se não houvesse outros condicionamentos repressivos de caráter moral, estético e cultural, a miscigenação seria um acontecimento positivo, capaz de enriquecer o brasileiro, a sociedade, a cultura e a humanidade das pessoas.\n\no) Obstar o ensinamento e a prática genocidas do supremacismo branco é um fator substantivo do quilombismo.\n\np) Poder quilombista quer dizer: a Raça Negra no Poder. Os descendentes de africanos somam a maioria da nossa população. Portanto, o Poder Negro será um poder democrático. (Reitero aqui a advertência aos intrigantes, aos maliciosos, aos ignorantes, aos racistas: neste livro a palavra raça tem exclusiva acepção histórico-cultural. Raça biologicamente pura não existe e nunca existiu).\n\nq) Quebrar a eficácia de certos slogans que atravessam a nossa ação contra o racismo, como aquele da luta única de todos os trabalhadores, de todo o povo ou de todos os oprimidos, é um dever do quilombista. Os privilégios raciais do branco em detrimento do negro constituem uma ideologia que vem desde o mundo antigo. A pregação da luta \"única\" ou \"unida\" não passa de outra face do desprezo que nos votam, já que não respeitam a nossa identidade e nem a especificidade do nosso problema e do nosso esforço em resolvê-lo.\n\nr) Raça: acreditamos que todos os seres humanos pertencem à mesma espécie. Para o quilombismo, raça significa um grupo humano que possui, relativamente, idênticas características somáticas, resultantes de um complexo de fatores históricos e ambientais. Tanto a aparência física, como igualmente os traços psicológicos, de personalidade, de caráter e emotividade, sofrem a influência daquele complexo de fatores onde se somam e se complementam a genética, a sociedade, a cultura, o meio geográfico, a história. O cruzamento de diferentes grupos raciais, ou de pessoas de identidade racial diversas, está na linha dos mais legítimos interesses de sobrevivência da espécie humana.\nRacismo: é a crença na inerente superioridade de uma raça sobre outra. Tal superioridade é concebida tanto no aspecto biológico, como na dimensão psico-sócio-cultural. Esta é a dimensão usualmente negligenciada ou omitida nas definições tradicionais do racismo. A elaboração teórico-científica produzida pela cultura branco-européia justificando a escravização e a inferiorização dos povos africanos constitui o exemplo eminente do racismo sem precedentes na história da humanidade.\nRacismo é a primeira contradição social no caminho do negro. A esta se juntam outras, como a contradição de classes e de sexo.\n\ns) Swahili é uma língua de origem banta, influenciada por outros idiomas, especialmente o árabe. Atualmente, o swahili é falado por mais de 20 milhões de africanos da Tanzânia, do Quênia, de Uganda, do Burundi, do Zaire, e de outros países. Os afro-brasileiros necessitam aprendê-la com urgência.\nSlogan do poder público e da sociedade dominante, no Brasil, condenando reiterada e indignadamente o racismo, se tornou um recurso eficaz encobrindo a operação racista e discriminatória sistemática, de um lado, e de outro lado servindo como uma arma apontada contra nós com a finalidade de atemorizar-nos, amortecendo ou impedindo que um movimento coeso do povo afro-brasileiro obtenha a sua total libertação.\n\nt) Todo negro ou mulato (afro-brasileiro) que aceita a \"democracia racial\" como uma realidade, e a miscigenação na forma vigente como positiva, está traindo a si mesmo, e se considerando um ser inferior.\n\nu) Unanimidade é algo impossível no campo social e político. Não devemos perder o nosso tempo e a nossa energia com as críticas vindas de fora do movimento quilombista. Temos de nos preocupar e criticar a nós próprios e às nossas organizações, no sentido de ampliar a nossa consciência negra e quilombista rumo ao objetivo final: a ascensão do povo afro-brasileiro ao Poder.\n\nv) Vênia é o que não precisamos pedir às classes dominantes para reconquistarmos os frutos do trabalho realizado pelos nossos ancestrais africanos no Brasil. Nem devemos aceitar ou assumir certas definições, \"científicas\" ou não, que pretendem situar o comunalismo africano e o ujamaaísmo como simples formas arcaicas de organização econômica e/ou social. Esta é outra arrogância de fundo eurocentrista que implicitamente nega às instituições nascidas na realidade histórica da África a capacidade intrínseca de desenvolvimento autônomo relativo. Nega a tais instituições a possibilidade de progresso e atualização, admitindo que a ocupação colonizadora do Continente Africano pelos europeus determinasse o concomitante desaparecimento dos valores, princípios e instituições africanas. Estas corporificariam formas não-dinâmicas, exclusivamente quietistas e imobilizadas. Tal visão petrificada da África e de suas culturas é uma ficção puramente cerebral. O quilombismo pretende resgatar dessa definição negativista o sentido de organização sócio-econômica concebido para servir à existência humana; organização que existiu na África e que os africanos escravizados trouxeram e praticaram no Brasil. A sociedade brasileira contemporânea pode se beneficiar com o projeto do quilombismo, uma alternativa nacional que se oferece em substituição ao sistema desumano do capitalismo.\n\nx) Xingar não basta. Precisamos é de mobilização e de organização da gente negra, e de uma luta enérgica, sem pausa e sem descanso, contra as destituições que nos atingem. Até que ponto vamos assistir impotentes à cruel exterminação dos nossos irmãos e irmãs afro-brasileiros, principalmente das crianças negras deste país?\n\ny) Yorubás (Nagô) somos também em nossa africanidade brasileira. Os iorubás são parte integrante do nosso povo, da nossa cultura, da nossa religião, da nossa luta e do nosso futuro.\n\nz) Zumbi: fundador do quilombismo.\n\n\nPropostas de ação para o Governo Brasileiro\n\nO programa de ação quilombista incorpora, devidamente atualizadas, as seguintes propostas apresentadas por este autor ao Colóquio do 2º Festival Mundial de Artes e Culturas Negras e Africanas (Festac), realizado em Lagos, Nigéria, em 1977 (ver Nascimento, Abdias, O Brasil na Mira do Pan-Africanismo, Salvador: CEAO/ EdUFBA, 2002). Naquela ocasião, o autor propôs ao Colóquio recomendar que o Governo Brasileiro\n\n1) permita e estimule a livre e aberta discussão dos problemas dos descendentes de africanos no país; e que encoraje e financie pesquisas sobre a posição econômica, social e cultural ocupada pelos afro-brasileiros dentro da sociedade brasileira, em todos os níveis;\n2) localize e publique documentos e outros fatos e informações possivelmente existentes em arquivos privados, cartórios, arquivos de câmara municipal de velhas cidades do interior, referentes ao tráfico negreiro, à escravidão e à abolição; em resumo, qualquer dado que possa ajudar a esclarecer e aprofundar a compreensão da experiência do africano escravizado e de seus descendentes;\n3) inclua quesitos sobre raça ou etnia em todos os futuros censos demográficos; que em toda informação que dito governo divulgue, tanto para consumo doméstico como internacional a respeito da composição demográfica do país, não se omita o aspecto da origem racial / étnica;\n4) inclua um ativo e compulsório currículo sobre a história e as culturas dos povos africanos, tanto aqueles do continente como os da diáspora; tal currículo deve abranger todos os níveis do sistema educativo: elementar, médio e superior;\n5) tome medidas ativas para promover o ensino e o uso prático de línguas africanas, especialmente as línguas ki-swahili e iorubá; o mesmo em relação aos sistemas religiosos africanos e seus fundamentos artísticos; que o dito governo promova válidos programas de intercâmbio cultural com as nações africanas;\n6) estude e formule compensações aos afro-brasileiros pelos séculos de escravização criminosa e decênios de discriminação racial depois da abolição; para esse fim deverá drenar recursos financeiros e outros, compulsoriamente originados da Agricultura, do Comércio e da Indústria, setores que historicamente têm sido beneficiados com a exploração do povo negro. Tais recursos constituirão um fundo destinado à construção de moradias, que satisfaçam às exigências da condição humana, em substituição às atuais habitações segregadas onde vive a maioria dos afro-brasileiros: favelas, cortiços, mocambos, porões, cabeças-de-porco, e assim por diante. O fundo sustentaria também a distribuição de terras no interior do país para os negros engajados na produção agropecuária;\n7) remova os objetos da arte afro-brasileira assim como os de sentido ritual encontrados hoje em instituições de polícia, de psiquiatria, história e etnografia; e que o dito governo estabeleça museus de arte com finalidade dinâmica e pedagógica de valorização e respeito devidos à cultura afro-brasileira; de preferência, tais museus se localizariam nos estados com significativa população negra, tais como Bahia, Maranhão, Pernambuco, Alagoas, Minas Gerais, Rio de Janeiro, São Paulo, Sergipe, Rio Grande do Sul;\n8) conceda efetivo apoio, material e financeiro, à existentes e futuras associações afro-brasileiras com finalidade de pesquisa, informação e divulgação nos setores de educação, arte, cultura e posição sócio-econômica da população afro-brasileira.\n9) tome medidas rigorosas e apropriadas ao efetivo cumprimento da lei Afonso Arinos, fazendo cessar o papel burlesco que tem desempenhado até agora;\n10) tome ativas providências, ajuste as realidades do país, para que de nenhuma forma se permita ou possibilite a discriminação racial ou de cor no emprego, garantindo a igualdade de oportunidade que atualmente inexiste entre brancos, negros e outras nuanças étnicas.\n11) exerça seu poder através de uma justa política de redistribuição da renda, tornando impraticável que, por causa da profunda desigualdade econômica imperante, o afro-brasileiro seja discriminado, embora sutil e indiretamente, em qualquer nível do sistema educativo, seja o elementar, o médio ou o universitário.\n12) estimule ativamente o ingresso de negros no Instituto Rio Branco, órgão de formação de diplomatas pertencente ao Ministério de Relações Exteriores.\n13) nomeie negros para o cargo de embaixador e diplomata para as Nações Unidas e junto aos Governos de outros países do mundo.\n14) estimule a formação de negros como oficiais superiores das Forças Armadas (Exército, Marinha e Aeronáutica) com promoções no serviço ativo até os postos de general, almirante, brigadeiro e marechal.\n15) nomeie negros para os altos escalões do Governo Federal em seus vários ministérios e outras repartições do Executivo, incluindo órgãos superiores como o Conselho Federal de Cultura, o Conselho Federal de Educação, o Conselho de Segurança Nacional, o Tribunal de Contas.\n16) estimule e encoraja a formação e o desenvolvimento de uma liderança política negra, representando os interesses específicos da população afro-brasileira no Senado Federal, na Câmara dos Deputados, nas Assembléias Legislativas Estaduais e nas Câmaras Municipais; que o dito Governo nomeie negros para os cargos de juizes estaduais e federais, inclusive para o Supremo Tribunal Federal, Superior Tribunal Eleitoral, Superior Tribunal Militar, Superior Tribunal do Trabalho e o Tribunal Federal de Recursos.\n17) concretize sua tão proclamada \"amizade\" com a África independente e sua tão freqüentemente manifestada posição anticolonialista, dando efetivo apoio diplomático e material aos legítimos movimentos de libertação nacional de Zimbabwe, Namíbia e África do Sul.\n\nAlguns princípios e propósitos do quilombismo\n\n1. O Quilombismo é um movimento político dos negros brasileiros, objetivando a implantação de um Estado Nacional Quilombista, inspirado no modelo da República dos Palmares, no século XVI, e em outros quilombos que existiram e existem no País.\n\n2. O Estado Nacional Quilombista tem sua base numa sociedade livre, justa, igualitária e soberana. O igualitarismo democrática quilombista é compreendido no tocante a sexo, sociedade, religião, política, justiça, educação, cultura, condição racial, situação econômica, enfim, todas as expressões da vida em sociedade. O mesmo igualitarismo se aplica a todos os níveis do Poder e de instituições públicas e privadas.\n\n3. A finalidade básica do Estado Nacional Quilombista é a de promover a felicidade do ser humano. Para atingir sua finalidade, o quilombismo acredita numa economia de base comunitário-cooperativista no setor da produção, da distribuição e da divisão dos resultados do trabalho coletivo.\n\n4. O quilombismo considera a terra uma propriedade nacional de uso coletivo. As fábricas e outras instalações industriais, assim como todos os bens e instrumentos de produção, da mesma forma que a terra, são de propriedade e uso coletivo da sociedade. Os trabalhadores rurais ou camponeses trabalham a terra e são eles próprios os dirigentes das instituições agropecuárias. Os operários da indústria e os trabalhadores de modo geral são os produtores dos objetos industriais e os únicos responsáveis pela orientação e gerência de suas respectivas unidades de produção.\n\n5. No quilombismo o trabalho é um direito e uma obrigação social, e os trabalhadores, que criam a riqueza agrícola e industrial da sociedade quilombista, são os únicos donos do produto do seu trabalho.\n\n6. A criança negra tem sido a vítima predileta e indefesa da miséria material e moral imposta à comunidade afro-brasileira. Por isso, ela constitui a preocupação urgente e prioritária do quilombismo. Atendimento pré-natal, amparo à maternidade, creches, alimentação adequada, moradia higiênica e humana, são alguns dos itens relacionados à criança negra que figuram no programa de ação do movimento quilombista.\n\n7. A educação e o ensino em todos os graus - elementar, médio e superior - serão completamente gratuitos e abertos sem distinção a todos os membros da sociedade quilombista. A história da África, das culturas, das civilizações e das artes africanas terão um lugar eminente nos currículos escolares. Criar uma Universidade Afro-Brasileira é uma necessidade dentro do programa quilombista.\n\n8. Visando o quilombismo a fundação de uma sociedade criativa, ele procurará estimular todas as potencialidades do ser humano e sua plena realização. Combater o embrutecimento causado pelo hábito, pela miséria, pela mecanização da existência e pela burocratização das relações humanas e sociais, é um ponto fundamental. As artes em geral ocuparão um espaço básico no sistema educativo e no contexto das atividades sociais.\n\n9. No quilombismo não haverá religiões e religiões populares, isto é, religião da elite e religiões do povo. Todas as religiões merecem igual tratamento de respeito e de garantias de culto.\n\n10. O Estado quilombista proíbe a existência de um aparato burocrático estatal que perturbe ou interfira com a mobilidade vertical das classes trabalhadoras e marginalizadas em relação direta com os dirigentes. Na relação dialética dos membros da sociedade com as suas instituições repousa o sentido progressista e dinâmico do quilombismo.\n\n11. A revolução quilombista é fundamentalmente anti-racista, anticapitalista, antilatifundiária, antiimperialista e antineocolonialista.\n\n12. Em todos os órgãos do Poder do Estado Quilombista - Legislativo, Executivo e Judiciário - a metade dos cargos de confiança, dos cargos eletivos, ou dos cargos por nomeação, deverão, por imperativo constitucional, ser ocupados por mulheres. O mesmo se aplica a todo e qualquer setor ou instituição de serviço público.\n\n13. O quilombismo considera a transformação das relações de produção, e da sociedade de modo geral, por meios não-violentos e democráticos, uma via possível.\n\n14. É matéria urgente para o quilombismo a organização de uma instituição econômico-financeira em moldes cooperativos, capaz de assegurar a manutenção e a expansão da luta quilombista a salvo das interferências controladoras do paternalismo ou das pressões do Poder econômico.\n\n15. O quilombismo essencialmente é um defensor da existência humana e, como tal, ele se coloca contra a poluição ecológica e favorece todas as formas de melhoramento ambiental que possam assegurar uma vida saudável para as crianças, as mulheres e os homens, os animais, as criaturas do mar, as plantas, as selvas, as pedras e todas as manifestações da natureza.\n\n16. O Brasil é signatário da Convenção Internacional para a Eliminação de Todas as Formas de Discriminação Racial, adotada pela Assembléia Geral das Nações Unidas em 1965. No sentido de cooperar para a concretização de objetivos tão elevados e generosos, e tendo em vista o artigo 9, números 1 e 2 da referida Convenção, o quilombismo contribuirá para a pesquisa e a elaboração de um relatório ou dossiê bianual, abrangendo todos os fatos relativos à discriminação racial ocorridos no País, a fim de auxiliar os trabalhos do Comitê para a Eliminação da Discriminação Racial das Nações Unidas.\n\nReproduzido do livro O Quilombismo, 2ª ed. (Brasília/Rio: Fundação Cultural Palmares/ OR Editor, 2002), págs. 278-290.\n\n\n\n  \t\ntopo\n\t\n\n\n\nQUILOMBISMO:\num conceito científico emergente do processo histórico-cultural\nda população afro-brasileira\n\nUma proposta do autor aos seus irmãos afrodescendentes no Brasil e nas Américas, apresentada em trabalho apresentado ao 2º Congresso de Cultura Negra das Américas, Panamá, 1980.\n\n...uma verdadeira revolução racial democrática, em nossa era, só pode dar-se sob uma condição: o negro e o mulato precisam torna-se o antibranco, para encarnarem o mais puro radicalismo democrático e mostrar aos brancos o verdadeiro sentido da revolução democrática da personalidade, da sociedade e da cultura.\n\n- Florestan Fernandes\nO Negro no Mundo dos Brancos\n\n\nMemória: a antigüidade do saber negro-africano\n\nNuma passagem anterior do texto deste livro fizemos menção à urgente necessidade do negro brasileiro em recuperar a sua memória. Esta tem sido agredida sistematicamente pela estrutura de poder e dominação há quase 500 anos. Semelhante fato tem acontecido com a memória do negro-africano, vítima, quando não de graves distorções, da mais crassa negação do seu passado histórico.\nA memória dos afro-brasileiros, muito ao contrário do que afirmam aqueles historiadores convencionais de visão curta e superficial entendimento, não se inicia com o tráfico escravo e nem nos primórdios da escravidão dos africanos, no século XV. Em nosso país, a elite dominante sempre desenvolveu esforços para evitar ou impedir que o negro brasileiro, após a chamada abolição, pudesse assumir suas raízes étnicas, históricas e culturais, desta forma seccionando-o do seu tronco familial africano. A não ser em função do recente interesse do expansionismo industrial, o Brasil como norma tradicional ignorou o continente africano. Voltou suas costas à África logo que não conseguiu mais burlar a proibição do comércio da carne africana imposta pela Inglaterra aí por volta de 1850. A imigração maciça de europeus ocorreu daí a mais alguns anos, e as classes dominantes enfatizam sua intenção e ação no sentido de arrancar da mente e do coração dos descendentes escravos a imagem da África como um a lembrança positiva de nação, de pátria, de terra nativa; nunca em nosso sistema educativo se ensinou qualquer disciplina que revelasse algum apreço ou respeito às culturas, artes, línguas e religiões de origem africana. E o contato físico do afro-brasileiro com os seus irmãos no continente e na diáspora sempre foi impedido ou dificultado, entre outros obstáculos, pela carência de meios econômicos que permitissem ao negro se locomover e viajar fora do país. Porém, nenhum desses empecilhos teve o poder de obliterar completamente do nosso espírito e da nossa lembrança a presença viva da Mãe África.\nAs diversas estratégias e os expedientes que se utilizam contra a memória do negro-africano têm sofrido, ultimamente, profunda erosão e irreparável descrédito. Este trabalho é fruto da dedicação e competência de alguns africanos, a um tempo estudiosos, pesquisadores, cientistas, filósofos, e criadores de literatura e arte, pessoas do continente africano e da diáspora africana. Cheikh Anta Diop, do Senegal; Chancellor Williams, dos Estados Unidos; Ivan Van Sertima e George M. James, da Guiana; Yosef Ben-Jochannam, da Etiópia; Theophile Obenga, do Congo-Brazzaville; Wole Soyinka e Wande Abimbola, da Nigéria, figuram entre os muitos que estão ativos, produzindo obras fundamentais para a África contemporânea e futura. Em campos diferentes, e sob perspectivas diversas, o esforço desses eminentes irmãos africanos se canaliza rumo a exorcizar as falsidades, distorções e negações que há tanto tempo se vêm tecendo com o intuito de velar ou apagar a memória do saber, do conhecimento científico e filosófico, e das realizações dos povos de origem negro-africana. A memória do negro brasileiro é parte e partícipe nesse esforço de reconstrução de um passado ao qual todos os afro-brasileiros estão ligados. Ter um passado é ter uma conseqüente responsabilidade nos destinos e no futuro da nação negro-africana, mesmo enquanto preservando a nossa condição de edificadores deste país e de cidadãos genuínos do Brasil.\nA obra fundamental de Cheikh Anta Diop, principalmente seu livro The African Origin of Civilization (versão em inglês de seleções de Nations Nègres et Culture e Antériorité des Civilisations Nègres, originalmente publicados em francês), apresenta uma confrontação radical e um desafio irrespondível à arrogância intelectual, desonestidade científica e carência ética do mundo acadêmico ocidental ao tratar os povos, civilizações e culturas produzidas pela África. Utilizando-se dos recursos científicos euro-ocidentais - Diop é químico, diretor do laboratório de radiocarbono do IFAN, em Dacar, além de egiptólogo, historiador e lingüista - este sábio está reconstruindo a significação e os valores da antigas culturas e civilizações erigidas pelos negro-africanos, as quais por longo tempo têm permanecido obnubiladas pelas manipulações, mentiras, distorções e roubos. São os bens de cultura e civilização e de artes criados pelos nossos antepassados no Egito antigo, os quais eram negros e não um povo de origem branco (ou vermelho escuro) conforme os cientistas ocidentais do século XIX proclamavam com ênfase tão mentirosa quanto interessada. Vejamos como a esse respeito se manifesta Diop:\n\nO fruto moral da sua civilização está para ser contado entre os bens do mundo negro. Ao invés de se apresentar à história como um devedor insolvente, este mundo negro é o próprio iniciador da civilização \"ocidental\" ostentada hoje diante dos nossos olhos. Matemática pitagórica, a teoria dos quatro elementos de Thales de Mileto, materialismo epicureano, idealismo platônico, judaísmo, islamismo, e a ciência moderna, estão enraizados na cosmogonia e na ciência egípcias. Só temos que meditar sobre Osíris, o deus-redentor, que se sacrifica, morre e é ressuscitado, uma figura essencialmente identificável a Cristo (1974: XIV).\n\nAs afirmações de Diop se baseiam em rigorosa pesquisa, em rigoroso exame e rigorosa conclusão, não deixando margem para dúvidas ou discussões. E isto longe de pretender aquele dogmatismo que sempre caracteriza as certezas \"científicas\" do mundo ocidental. O que Diop fez foi simplesmente derruir as estruturas supostamente definitivas do conhecimento \"universal\" no que respeita à antigüidade egípcia e grega. Gostem ou não, os ocidentais têm de tragar verdades como esta: \"...quatro séculos antes da publicação de A mentalidade primitiva de Lévy-Bruhl, a África negra muçulmana comentava a lógica formal de Aristóteles (que ele plagiou do Egito negro) e demonstrava-se especialista em dialética\" (Diop, 1963: 212).\nE isto, não esqueçamos, acontecia quase 500 anos antes que ao menos tivessem nascido Hegel ou Karl Marx...\nDiop revolve todo o processo da mistificação de um Egito negro que se tornou branco por artes da magia européia dos egiptólogos. Após a campanha militar de Bonaparte no Egito, em 1799, e depois que os hieróglifos da pedra Rosetta foram decifrados por Champollion, o jovem, em 1822, os egiptólogos se desarticularam atônitos diante da grandiosidade das descobertas reveladas.\n\nEles geralmente a reconheceram como a mais antiga civilização, a que tinha engendrado todas as outras. Mas com o imperialismo, sendo o que é, tornou-se crescentemente \"inadmissível\" continuar aceitando a teoria evidente até então - de um Egito negro. O nascimento da egiptologia foi assim marcado pela necessidade de destruir a memória de um Egito negro, a qualquer custo, em todas as mentes. Daí em diante, o denominador comum de todas as teses dos egiptólogos, sua relação íntima e profunda afinidade, pode ser caracterizado como uma tentativa desesperada de refutar essa opinião [do Egito ser negro]. Quase todos os egiptólogos enfatizaram sua falsidade como uma questão fechada (1974: 45).\n\nDesta posição intelectual em diante, como procederam os egiptólogos? Como negar a realidade egípcia, essencialmente negra, a qual não apresentava contradições científicas realmente confiáveis ou válidas? Não possuindo argumentos ou razões para refutar a verdade, exposta pelos antigos que viram o Egito de perto, alguns egiptólogos preferiram guardar silêncio sobre a questão; outros, mais obsessivos em seu irracionalismo, optaram pelo caminho da rejeição dogmática, infundada e indignada. De um modo geral, todos \"se lamentavam que um povo tão normal como os egípcios antigos pudessem ter feito tão grave erro e desta forma criar tantas dificuldades e delicados problemas para os especialistas modernos\" (Diop, 1974: 45).\nA pretensiosidade eurocentrista nesse episódio se expõe de corpo inteiro. Lembra o exemplo de um típico escritor do \"progressismo\" brasileiro, o racista Monteiro Lobato, quando acusa o negro-africano de haver provocado graves problemas para o Brasil com a miscigenação, a tão celebrada mistura de sangues negro e branco... Mas voltemos aos egiptologistas: eles prosseguiram obstinadamente o vão esforço de provar \"cientificamente\" uma origem branca para a antiga civilização do Egito negro.\nQuanto a Diop, compassivo e humano diante do feroz dogmatismo dos egiptólogos brancos, revelou bastante paciência e gentileza explicando-lhes que não alegava superioridade racial ou qualquer gênio especificamente negro naquela constatação puramente científica de que a civilização do Egito antigo fora erigida por um povo negro. O sucesso, explicou-lhe Diop, resultou de fatores históricos, de condições mesológicas - clima, recursos naturais, e assim por diante - somados a outros elementos não-rácicos. Tanto assim foi que, mesmo tendo-se expandido por toda a África negra, do centro e do oeste do continente, a civilização egípcia, ao embate de outras influências e situação histórica diversa, entrou num processo de desintegração e franco retrocesso. O importante é sabermos alguns dos fatores que contribuíram para a edificação da civilização egípcia, entre os quais Diop enumera estes: resultado de acidente geográfico que condicionou o desenvolvimento político-social dos povos que viviam às margens do vale do Nilo; as inundações que forçavam providências coletivas de defesa e sobrevivência, situação que favorecia a unidade e excluía o egoísmo individual ou pessoal. Nesse contexto surgiu a necessidade de uma autoridade central coordenadora da vida e das atividades em comum. A invenção da geometria nasceu da necessidade da divisão geográfica, e todos os demais avanços foram obtidos no esforço de atender uma carência requerida pela sociedade.\nUm pormenor interessa particularmente à memória do negro brasileiro: aquele onde Diop menciona as relações do antigo Egito com a África negra, de modo específico com os iorubás. Parece que tais relações foram tão íntimas a ponto de se poder \"considerar como um fato histórico a possessão conjunta do mesmo habitat primitivo pelos iorubás e egípcios\". Diop levanta a hipótese de que a latinização de Horus, filhos de Osíris e Ísis, resultou no apelativo Orixá. Seguindo essa pista de estudo comparativo, ao nível da lingüística e outras disciplinas, Diop cita J. Olumide Lucas em The religion of the Yorubas, o qual traça os laços egípcios do seu povo iorubá, concluindo que tudo leva à verificação do seguinte: a) uma similaridade ou identidade de linguagem; b) uma similaridade ou identidade de crenças religiosas; c) uma similaridade ou identidade de idéias e práticas religiosas; d) uma sobrevivência de costumes, lugares, nomes de pessoas, objetos, práticas, e assim por diante (Diop, 1974: 184; Lucas, 1978: 18).\nMeu objetivo aqui é o de apenas chamar a atenção para esta significativa dimensão da antigüidade da memória afro-brasileira. Este é um assunto extenso e complexo, cuja seriedade requer e merece pesquisa e reflexão aprofundadas, no contexto de uma revisão crítica das definições e dos julgamentos pejorativos que há séculos pesam sobre os povos negro-africanos.\n\nConsciência negra e sentimento quilombista\n\nNuma perspectiva mais restrita, a memória do negro brasileiro atinge uma etapa histórica decisiva no período escravocrata que se inicia por volta de 1500, logo após a \"descoberta\" do território e os atos inaugurais dos portugueses tendo em vista a colonização do país. Excetuando os índios, o africano escravizado foi o primeiro e único trabalhador, durante três séculos e meio, a erguer as estruturas deste país chamado Brasil. Creio ser dispensável evocar neste instante o chão que o africano regou com seu suor, lembrar ainda uma vez mais os canaviais, os algodoais, o ouro, o diamante e a prata, os cafezais, e todos os demais elementos da formação brasileira que se nutriram no sangue martirizado do escravo. O negro está longe de ser um arrivista ou um corpo estranho: ele é o próprio corpo e alma deste país. Mas a despeito dessa realidade histórica inegável e incontraditável, os africanos e seus descendentes nunca foram e não são tratados como iguais pelos segmentos minoritários brancos que complementam o quadro democrático nacional. Estes têm mantido a exclusividade do poder, do bem-estar e da renda nacional.\nÉ escandaloso notar que porções significativas da população brasileira de origem européia começaram a chegar ao Brasil nos fins do século passado como imigrantes pobres e necessitados. Imediatamente passaram a desfrutar de privilégios que a sociedade convencional do país lhes concedeu como parceiros de raça e de supremacismo eurocentrista. Tais imigrantes não demonstraram nem escrúpulo e nem dificuldades em assumir os preconceitos raciais contra o negro-africano, vigentes aqui e na Europa, se beneficiando deles e preenchendo as vagas no mercado de trabalho que se negava aos ex-escravos e seus descendentes. Estes foram literalmente expulsos do sistema de trabalho e produção à medida que se aproximava a data \"abolicionista\" de 13 de maio de 1888.\nTendo-se em vista a condição atual do negro à margem do emprego ou degradado no semi-emprego e subemprego; levando-se em conta a segregação residencial que lhe é imposta pelo duplo motivo de condição racial e pobreza, destinando-lhe como áreas de moradias ghettos de várias denominações: favelas, alagados, porões, mocambos, invasões, conjuntos populares ou \"residenciais\"; considerando-se a permanente brutalidade policial e as prisões arbitrárias motivadas pela cor de sua pele, compreende-se por que todo negro consciente não tem a menor esperança de que uma mudança progressista possa ocorrer espontaneamente em benefício da comunidade afro-brasileira. As favelas pululam em todas as grandes cidades: Rio de Janeiro, São Paulo, Salvador, Recife, Brasília, podem se apontadas como exemplos. A cifra dos favelados exprime em si mesma a desgraça crescente no quociente alto que apresenta. Para ilustrar lembro os dados do Departamento de Serviço Social de São Paulo, publicados pelo O Estado de São Paulo de 16 de agosto de 1970, os quais denunciavam que mais de 60% da população paulistana vive em condições precaríssimas; se não esquecermos de que São Paulo é a cidade brasileira melhor servida de instalações de água e esgoto, poderemos fazer uma idéia mais aproximada das impossíveis condições higiênicas em que vegetam os afro-brasileiros por esse país afora. Em Brasília, segundo a revista Veja de 8 de outubro de 1969, entre os 510.000 habitantes da capital federal, 80.000 eram favelados. Enquanto no Rio de Janeiro a porcentagem de favelados oscila entre 40 a 50 por cento da população. Os racistas de qualquer cor, sob a máscara de \"apenas reacionários, dirão que os ghettos existem disfarçados em favelas em várias cidades européias, não sendo um fenômeno tipicamente brasileiro. Certo. A tipicidade está em que a maioria absoluta dos favelados brasileiros, cerca de 95%, são de origem africana. Este detalhe caracteriza uma irrefutável segregação racial de fato. Isto no que concerne à população negra urbana. Entretanto, cumpre ressaltar que a maioria dos descendentes de escravos ainda vegeta nas zonas rurais, escrava de uma existência parasitária, numa situação de desamparo total. Pode-se dizer que não vivem uma vida de seres humanos.\nE como sobrevive o segmento citadino da população afro-brasileira? Constitui uma categoria denominada pelo Anuário Estatístico do Instituto Brasileiro de Geografia e Estatística (IBGE) de \"empregados em serviços\". Uma estranha qualificação ou eufemismo para o subemprego e o semi-emprego, que rotula quase quatro milhões e meio de brasileiros. (Quartim, 1971: 152). Tal eufemismo surpreende porque nessa classificação se incluem os empregados sem ordenado fixo, isto é, biscateiros vivendo a pequena aventura diária de engraxar sapatos, lavar carros, entregar encomendas, transmitir recado, a venda ambulante de doces, frutas ou objetos, tudo à base da remuneração miserável do centavo.\nEste é um retrato imperfeito de uma situação mais grave, a qual tem sido realidade em todo o decorrer de nossa história. Desta realidade é que nasce a necessidade urgente ao negro de defender sua sobrevivência e de assegurar a sua existência de ser. Os quilombos resultaram dessa exigência vital dos africanos escravizados, no esforço de resgatar sua liberdade e dignidade através da fuga ao cativeiro e da organização de uma sociedade livre. A multiplicação dos quilombos fez deles um autêntico movimento amplo e permanente. Aparentemente um acidente esporádico no começo, rapidamente se transformou de uma improvisação de emergência em metódica e constante vivência dos descendentes de africanos que se recusavam à submissão, à exploração e à violência do sistema escravista. O quilombismo se estruturava em formas associativas que tanto podiam estar localizadas no seio de florestas de difícil acesso que facilitava sua defesa e sua organização econômico-social própria, como também assumiram modelos de organizações permitidas ou toleradas, freqüentemente com ostensivas finalidades religiosas (católicas), recreativas, beneficentes, esportivas, culturais ou de auxílio mútuo. Não importam as aparências e os objetivos declarados: fundamentalmente, todas elas preencheram uma importante função social para a comunidade negra, desempenhando um papel relevante na sustentação da comunidade africana. Genuínos focos de resistência física e cultural. Objetivamente, essa rede de associações, irmandades, confrarias, clubes, grêmios, terreiros, centros, tendas, afochés, escolas de samba, gafieiras foram e são os quilombos legalizados pela sociedade dominante; do outro lado da lei se erguem os quilombos revelados que conhecemos. Porém tanto os permitidos quanto os \"ilegais\" foram uma unidade, uma única afirmação humana, étnica e cultural, a um tempo integrando uma prática de libertação e assumindo o comando da própria história. A este complexo de significações, a esta praxis afro-brasileira, eu denomino de quilombismo.\nA constatação fácil do enorme número de organizações que se intitularam no passado e se intitulam no presente de Quilombo e/ou Palmares testemunha o quanto o exemplo quilombista significa como valor dinâmico na estratégia e na tática de sobrevivência e progresso das comunidades de origem africana. Com efeito, o quilombismo tem se revelado fator capaz de mobilizar disciplinadamente o povo afro-brasileiro por causa do profundo apelo psicossocial cujas raízes estão entranhadas na história, na cultura e na vivência dos afro-brasileiros. O Movimento Negro Unificado Contra o Racismo e a Discriminação Racial assim registra seu conceito quilombola ao definir o \"Dia da Consciência Negra\":\n\nNós, negros brasileiros, orgulhosos por descendermos de Zumbi, líder da República Negra dos Palmares, que existiu no Estado de Alagoas, de 1595 a 1695, desafiando o domínio português e até holandês, nos reunimos hoje, após 283 anos, para declarar a todo o povo brasileiro nossa verdadeira e efetiva data: 20 de novembro, Dia Nacional da Consciência Negra! Dia da morte do grande líder negro nacional, Zumbi, responsável pela primeira e única tentativa brasileira de estabelecer uma sociedade democrática, ou seja, livre, e em que todos - negros, índios e brancos - realizaram um grande avanço político, econômico e social. Tentativa esta que sempre esteve presente em todos os quilombos (1978).\n\nA continuidade dessa consciência de luta político-social se estende por todos os Estados onde existe significativa população de origem africana. O modelo quilombista vem atuando como idéia-força, energia que inspira modelos de organização dinâmica desde o século XV. Nessa dinâmica quase sempre heróica, o quilombismo está em constante reatualização, atendendo exigências do tempo histórico e situações do meio geográfico. Circunstância que impôs aos quilombos diferenças em suas formas organizativas. Porém no essencial se igualavam. Foram (e são), nas palavras da historiadora Beatriz Nascimento, \"um local onde a liberdade era praticada, onde os laços étnicos e ancestrais eram revigorados\" (1979: 17). Esta estudiosa mulher negra afirma ter o quilombo exercido \"um papel fundamental na consciência histórica dos negros\" (1979: 18).\nPercebe-se o ideal quilombista difuso, porém consistente, permeando todos os níveis da vida negra e os mais recônditos meandros e/ou refolhos da personalidade afro-brasileira. Um ideal forte e denso que via de regra permanece reprimido pelas estruturas dominantes, outras vezes é sublimado através dos vários mecanismos de defesa fornecidos pelo inconsciente individual ou coletivo. Mas também acontece às vezes o negro se apropriar dos mecanismos que a sociedade dominante concedeu ao seu protagonismo com a maliciosa intenção de controlá-lo. Nessa reversão do alvo, o negro se utiliza dos propósitos não-confessados de domesticação qual boomerang ofensivo. É o exemplo que nos deixou Candeia, compositor de sambas e negro inteligentemente dedicado à redenção do seu povo. Organizou a Escola de Samba Quilombo, nos subúrbios do Rio de Janeiro, com um profundo senso do valor político-social do samba em função do progresso da coletividade negra. Este importante membro da família quilombista faleceu recentemente, mas até o instante derradeiro ele manteve uma lúcida visão dos objetivos da entidade que fundou e presidiu no rumo dos interesses mais legítimos do povo afro-brasileiro. Basta folhear o livro de sua autoria e de Isnard, e ler trechos como este:\n\nQuilombo - Grêmio Recreativo Arte Negra (...) nasceu da necessidade de se preservar toda a influência do afro na cultura brasileira. Pretendemos chamar a atenção do povo brasileiro para as raízes da arte negra brasileira. A posição do \"Quilombo\" é principalmente contrária à importação de produtos culturais prontos e acabados produzidos no exterior (1978: 87-88).\n\nNeste último trecho, os autores tocam num ponto importante do quilombismo: o caráter nacionalista do movimento. Nacionalismo aqui não deve ser traduzido como xenofobismo. Sendo o quilombismo uma luta antiimperialista, se articula ao pan-africanismo e sustenta radical solidariedade com todos os povos em luta contra a exploração, a opressão, o racismo e as desigualdades motivadas por raça, cor, religião ou ideologia.\nNum folheto intitulado 90 anos de abolição, publicado pela Escola de Samba Quilombo, Candeia registra que \"foi através do Quilombo, e não do movimento abolicionista, que se desenvolveu a luta dos negros contra a escravatura\" (1978: 7).\nE o movimento quilombista está longe de haver esgotado seu papel histórico. Está tão vivo hoje quanto no passado, pois a situação das camadas negras continua a mesma, com pequenas alterações de superfície. Candeia prossegue:\n\nOs quilombos eram violentamente reprimidos, não só pela força do governo, mas também por indivíduos interessados no lucro que teriam devolvendo os fugitivos a seus donos. Esses especialistas em caçar escravos fugidos ganharam o nome de triste memória: capitães-do-mato (1978: 5).\n\nA citação dos capitães-do-mato é importante: via de regra eram eles mulatos, isto é, negros de pele clara assimilados pela classe dominante. Em nossos dias ainda podemos encontrar centenas, milhares, desses negros que vivem uma existência ambígua. Não pelo fato de possuírem o sangue do branco opressor, mas porque internalizando como positiva a ideologia do embranquecimento (o branco é o superior e o negro o inferior) se distanciam das realidades do seu povo e se prestam ao papel de auxiliares das forças repressivas do supremacismo branco. E tanto ontem quanto hoje, os serviços que se prestam à repressão se traduzem em lucro social e lucro pecuniário.\nNosso Brasil é tão vasto, ainda tão desconhecido e despovoado que podemos supor, sem grande margem de erro, que existem muitas comunidades negras vivendo isoladas, sem ligação ostensiva com as pequenas cidades e vilas do interior do país. Serão diminutas localidades rurais, desligadas do fluxo principal da vida do país, e mantendo estilos e hábitos de vida africana, ou quase, sob um regime de agricultura coletiva de subsistência ou sobrevivência. Podem até mesmo usar o idioma original trazido da África, estropiado, é bem verdade, porém mesmo assim linguagem africana conservada na espécie de quilombismo em que vivem. Às vezes podem até ganhar notícias extensas nas páginas da imprensa, conforme ocorreu à comunidade do Cafundó, situada nas imediações de Salto de Pirapora, no Estado de São Paulo. Os membros da comunidade herdaram uma fazenda deixada pelo antigo senhor, e não faz muito tempo as terras estavam sendo invadidas por latifúndiários das vizinhanças. Obviamente brancos, esse latifundários, com mentalidade escravocrata, não podem aceitar que um grupo de descendentes africanos possua uma propriedade imobiliária. Este não é um fato único, mas foi aquele que ganhou maior publicidade, mobilizando os negros paulistas em sua defesa. Ao visitar pela primeira vez a cidade de Conceição de Mato Dentro, em Minas Gerais, em 1975, tive oportunidade de me encontrar com um dos moradores de uma comunidade negra daquelas redondezas semelhante a Cafundó. Também herdaram a propriedade, segundo me relatou o dito morador, negro de 104 anos, ágil de inteligência e de pernas. Caminhava quase todos os dias cerca de 10 quilômetros a pé, e assim mantinha o contato do seu povo com a cidadezinha de Mato Dentro.\nO avanço de latifundiários e de especuladores de imóveis nas terras da gente negra está pedindo uma investigação ampla e funda. Este é um fenômeno que ocorre tanto nas zonas rurais como nas cidades. Vale a pena transcrever, a respeito, trechos de uma nota estampada em Veja, seção \"Cidades\", a 10 de dezembro de 1975, página 52:\n\nDesde sua remota aparição em Salvador, há quase dois séculos, os terreiros de candomblé foram sempre fustigados por severas restrições policiais. E, pelo menos nos últimos vinte anos, o cerco movido pela polícia foi sensivelmente fortalecido por um poderoso aliado - a expansão imobiliária, que se estendeu às áreas distantes do centro da cidade onde ressoavam os atabaques. Mais ainda, em nenhum momento a Prefeitura esboçou barricadas legais para proteger esses redutos da cultura afro-brasileira - embora a capital baiana arrecadasse gordas divisas com a exploração do turismo fomentado pela magia dos orixás (...) E nunca se soube da aplicação de sanções para os inescrupulosos proprietários de terrenos vizinhos às casas de culto, que se apossam impunemente de áreas dos terreiros. Foi assim que, em poucos anos, a Sociedade Beneficente São Jorge do Engenho Velho, ou terreiro da Casa Branca, acabou perdendo metade de sua antiga área de 7.500 metros quadrados. Mas infeliz ainda, a Sociedade São Bartolomeu do Engenho Velho da Federação, ou candomblé de Bogum, assiste impotente à veloz redução do terreno sagrado onde se ergue a mítica \"árvore de Azaudonor\" trazida da África há 150 anos e periodicamente agredida por um vizinho que insiste em podar seus galhos mais frondosos.\n\nEis como a sociedade dominante apertou o cerco da destituição, da fome e do genocídio dos descendentes africanos. Até os poucos, as raras exceções que por um milagre conseguiram ultrapassar a fronteira implacável da miséria, ou as instituições religiosas que ocupavam há séculos determinado espaço, se vêem de uma hora para outra invadidos em suas propriedades e usurpados em suas terras!\n\nQuilombismo: um conceito científico histórico-social\n\nPara os africanos escravizados assim como para os seus descendentes \"libertos\", tanto o Estado colonial português quanto o Brasil - colônia, império e república - têm uma única e idêntica significação: um estado de terror organizado contra eles. Um Estado por assim dizer natural em sua iniqüidade fundamental, um Estado naturalmente ilegítimo. Porque tem sido a cristalização político-social dos interesses exclusivos de um segmento elitista, cuja aspiração é atingir o status ário-européia em estética racial, em padrão de cultura e civilização. Este segmento tem sido o maior beneficiário da espoliação que em todos os sentidos tem vitimado o povo afro-brasileiro ao longo da nossa história. Conscientes da extensão e profundidade dos problemas que enfrenta, o negro sabe que sua oposição ao que aí está não se esgota na obtenção de pequenas reivindicações de caráter empregatício ou de direitos civis, no âmbito da dominante sociedade capitalista-burguesa e sua decorrente classe média organizada. O negro já compreendeu que terá de derrotar todas as componentes do sistema ou estrutura vigente, inclusive a sua intelligentsia responsável pela cobertura ideológica da opressão através da teorização \"científica\" seja de sua inferioridade biossocial, da miscigenação sutilmente compulsória ou do mito \"democracia racial\". Essa intelligentsia, aliada a mentores europeus e norte-americanos, fabricou uma \"ciência\" histórica ou humana que ajudou a desumanização dos africanos e seus descendentes para servir os interesses dos opressores eurocentristas. Uma ciência histórica que não serve à história do povo de que trata está negando-se a si mesma. Trata-se de uma presunção cientificista e não de uma ciência histórica verdadeira.\nComo poderiam as ciências humanas, históricas - etnologia, economia, história, antropologia, sociologia, psicologia, e outras - nascidas, cultivadas e definidas para povos e contextos sócio-econômicos diferentes, prestar útil e eficaz colaboração ao conhecimento do negro, sua realidade existencial, seus problemas e aspirações e projetos? Seria a ciência social elaborada na Europa ou nos Estados Unidos tão universal em sua aplicação? Os povos negros conhecem na própria carne a falaciosidade do universalismo e da isenção dessa \"ciência\". Aliás, a idéia de uma ciência histórica pura e universal está ultrapassada. O conhecimento científico que os negros necessitam é aquele que os ajude a formular teoricamente - de forma sistemática e consistente - sua experiência de quase 500 anos de opressão. Haverá erros ou equívocos inevitáveis em nossa busca de racionalidade do nosso sistema de valores, em nosso esforço de autodefinição de nós mesmos e de nosso caminho futuro. Não importa. Durante séculos temos carregado o peso dos crimes e dos erros do eurocentrismo \"científico\", os seus dogmas impostos em nossa carne como marcas ígneas da verdade definitiva. Agora devolvemos ao obstinado segmento \"branco\" da sociedade brasileira as suas mentiras, a sua ideologia de supremacismo europeu, a lavagem cerebral que pretendia tirar a nossa humanidade, a nossa identidade, a nossa dignidade, a nossa liberdade. Proclamando a falência da colonização mental eurocentrista, celebramos o advento da libertação quilombista.\nO negro tragou até à última gota os venenos da submissão imposta pelo escravismo, perpetuada pela estrutura do racismo psicossócio-cultural que mantém atuando até os dias de hoje. Os negros têm como projeto coletivo a ereção de uma sociedade fundada na justiça, na igualdade e no respeito a todos os seres humanos, na liberdade; uma sociedade cuja natureza intrínseca torne impossível a exploração econômica e o racismo. Uma democracia autêntica, fundada pelos destituídos e os deserdados deste país, aos quais não interessa a simples restauração de tipos e formas caducas de instituições políticas, sociais e econômicas as quais serviriam unicamente para procrastinar o advento de nossa emancipação total e definitiva, que somente pode vir com a transformação radical das estruturas vigentes. Cabe mais uma vez insistir: não nos interessa a proposta de uma adaptação aos moldes da sociedade capitalista e de classes. Esta não é a solução que devemos aceitar como se fora mandamento inelutável. Confiamos na idoneidade mental do negro, e acreditamos na reinvenção de nós mesmos e de nossa história. Reinvenção de um caminho afro-brasileiro de vida fundado em sua experiência histórica, na utilização do conhecimento crítico e inventivo de suas instituições golpeadas pelo colonialismo e o racismo. Enfim, reconstruir no presente uma sociedade dirigida ao futuro, mas levando em conta o que ainda for útil e positivo no acervo do passado. Um futuro melhor para o negro tanto exige uma nova realidade em termos de pão, moradia, saúde, trabalho, como requer um outro clima moral e espiritual de respeito às componentes mais sensíveis da personalidade negra expressas em sua religião, cultura, história, costumes e outras formas.\nA segurança de um futuro melhor para a população negra não se inclui nos dispositivos da chamada \"lei de segurança nacional\". Esta é a segurança das elites dominantes, dos seus lucros e compromissos com o capital interno ou estrangeiro, privado ou estatal. A segurança da \"ordem\" econômica, social e política em vigor é aquela associada e inseparável das teorias \"científicas\" e dos parâmetros culturais e ideológicos engendrados pelos opressores e exploradores tradicionais da população afro-brasileira.\nTampouco nos interessa o uso ou a adoção de slogans ou palavras de ordem de um esquerdismo ou democratismo vindos de fora. A revolução negra produz seus historiadores, sociólogos, antropólogos, pensadores, filósofos e cientistas políticos. Tal imperativo se aplica também ao movimento afro-brasileiro.\nUm instrumento conceitual operativo se coloca, pois, na pauta das necessidades imediatas da gente negra brasileira. O qual não deve e não pode ser fruto de uma maquinação cerebral arbitrária, falsa e abstrata. Nem tampouco um elenco de princípios importados, elaborados a partir de contextos e de realidades diferentes. A cristalização dos nossos conceitos, definições ou princípios deve exprimir a vivência de cultura e de praxis da coletividade negra. Incorporar nossa integridade de ser total, em nosso tempo histórico, enriquecendo e aumentando nossa capacidade de luta.\nPrecisamos e devemos codificar nossa experiência por nós mesmos, sistematizá-la, interpretá-la e tirar desse ato todas as lições teóricas e práticas conforme a perspectiva exclusiva dos interesses da população negra e de sua respectiva visão de futuro. Esta se apresenta como a tarefa da atual geração afro-brasileira: edificar a ciência histórico-humanista do quilombismo.\nQuilombo não significa escravo fugido. Quilombo quer dizer reunião fraterna e livre, solidariedade, convivência, comunhão existencial. Repetimos que a sociedade quilombola representa uma etapa no progresso humano e sócio-político em termos de igualitarismo econômico. Os precedentes históricos conhecidos confirmam esta colocação. Como sistema econômico o quilombismo tem sido a adequação ao meio brasileiro do comunitarismo ou ujamaaísmo da tradição africana. Em tal sistema as relações de produção diferem basicamente daquelas prevalecentes na economia espoliativa do trabalho, chamada capitalismo, fundada na razão do lucro a qualquer custo. Compasso e ritmo do quilombismo se conjugam aos mecanismos operativos, articulando os diversos níveis de uma vida coletiva cuja dialética interação propõe e assegura a realização completa do ser humano. Nem propriedade privada da terra, dos meios de produção e de outros elementos da natureza. Todos os fatores e elementos básicos são de propriedade e uso coletivo. Uma sociedade criativa, no seio da qual o trabalho não se define como uma forma de castigo, opressão ou exploração; o trabalho é antes uma forma de libertação humana que o cidadão desfruta como um direito e uma obrigação social. Liberto da exploração e do jugo embrutecedor da produção tecno-capitalista, a desgraça do trabalhador deixará de ser o sustentáculo de uma sociedade burguesa parasitária que se regozija no ócio de seus jogos e futilidades.\nOs quilombolas dos séculos XV, XVI, XVII, XVIII e XIX nos legaram um patrimônio de prática quilombista. Cumpre aos negros atuais manter e ampliar a cultura afro-brasileira de resistência ao genocídio e de afirmação da sua verdade. Um método de análise, compreensão e definição de uma experiência concreta, o quilombismo expressa a ciência do sangue escravo, do suor que este derramou enquanto pés e mãos edificadores da economia deste país. Um futuro de melhor qualidade para a população afro-brasileira só poderá ocorrer pelo esforço enérgico de organização e mobilização coletiva, tanto da população negra como das suas inteligências e capacidades escolarizadas, para a enorme batalha no fronte da criação teórico-científica. Uma teoria científica inextricavelmente fundida à nossa prática histórica que efetivamente contribua à salvação da comunidade negra, a qual vem sendo inexoravelmente exterminado. Seja pela matança direta da fome, seja pela miscigenação compulsória, pela assimilação do negro aos padrões e ideais ilusórios do lucro ocidental. Não permitamos que a derrocada desse mundo racista, individualista e inimigo da felicidade humana afete a existência futura daqueles que efetiva e plenamente nunca a ele pertenceram: nós, negro-africanos e afro-brasileiros.\nCondenada a sobreviver rodeada ou permeada de hostilidade, a sociedade afro-brasileira tem persistido nesses quase 500 anos sob o signo de permanente tensão. Tensão esta que consubstancia a essência e o processo do quilombismo.\nAssegurar a condição humana do povo afro-brasileiro, há tantos séculos tratado e definido de forma humilhante e opressiva, é o fundamento ético do quilombismo. Deve-se assim compreender a subordinação do quilombismo ao conceito que define o ser humano como o seu objeto e sujeito científico, dentro de uma concepção de mundo e de existência na qual a ciência constitui uma entre outras vias do conhecimento.\n\nEstudos sobre o branco\n\nDevemos impedir por todos os meios, nós os descendentes negro-africanos, que a confusão e a falência das bases do chamado mundo ocidental branco derroguem aquilo que há de mais valioso e profundo em nossa natureza, cultura e experiência. Conhecer o inimigo e/ou adversário, desde dentro, significa atuar em autodefesa. Conseqüentemente devemos nos preparar para estudar o branco e seus impulsos agressivos.\nAqui estou reatando uma idéia antiga do escritor Fernando Góes, mais tarde retomada por Guerreiro Ramos. Na mesma direção, também houve constante pregação na militância do saudoso irmão negro Aguinaldo de Oliveira Camargo; no auditório do 1º Congresso do Negro Brasileiro (Rio, 1950), ressoaram estas palavras sábias de Aguinaldo: \"Reeduquemos o branco para que ele aprenda a respeitar a criança negra, a respeitar o doutor negro, a empregada negra, para que aprenda a casar-se com a mulher negra\" apud Nascimento, 1968: 231).\nÉ na mesma linha de raciocínio que se situa mais uma observação de Cheikh Anta Diop; em vários pontos-chaves de sua obra, Diop abordou a questão, referindo-se às idiossincrasias dos branco europeus:\n\nNão há absolutamente dúvidas de que a raça branca, a qual apareceu pela primeira vez durante o Alto Paleolítico - em torno de 20.000 antes de Cristo - , era o produto de um processo de despigmentação. (...) não há dúvida de que o panorama cultural desses protobrancos era eventualmente condicionado durante a época glacial pelas condições extremamente duras do seu \"berço nórdico\", até o momento de seus movimentos migratórios rumo às regiões meridionais, em torno de 1.500 anos antes de Cristo. Moldados por seu berço ambiental, aqueles primeiros nômades brancos desenvolveram, sem dúvida, uma consciência social típica do ambiente hostil ao qual estiveram confinados por um longo período. A xenofobia se fixou como um dos traços de sua consciência social. A hierarquização patriarcal outra. (...) Penso que a Dra. Welsing identificou corretamente a origem do racismo num definitivo reflexo defensivo. Creio que o racismo seja uma reação de medo, mais freqüentemente inconfesso que não. (Diop, 1986: 34).\n\nAssim, a origem da sócio-psicopatologia do branco não se radica em sua natureza biológica. Ao contrário, trata-se de um fenômeno de caráter histórico: os brancos tinham medo porque, na época dessas migrações, se sentiam inferiores em número e em avanço cultural diante das civilizações meridionais negras, sedentárias e agrícolas. Sua válvula de segurança consistiu na ereção e no desenvolvimento da teoria do supremacismo branco.\nTive a oportunidade de formalizar a sugestão de Fernando Góes e Guerreiro Ramos quando propus em um seminário que estava ministrando na Universidade de Ifé que os africanos deveriam promover um Congresso Internacional para estudar os brancos da Europa e seu prolongamento arianóide no Brasil. A ciência negro-africana examinaria o fenômeno mental e psiquiátrico que motivou os europeus a escravizarem outros seres humanos, seus irmãos, com uma brutalidade sádica sem precedentes na história dos homens. Escrutinaria, a ciência negra, em suas origens psiconeurológicas e psicocriminológicas, a necessidade emocional que leva o branco a tentar justificar seus atos de assassínio, tortura, pilhagem, roubo e estupro com fantasias absurdas denominadas, por exemplo, de \"carga do homem branco\", \"destino manifesto\", \"civilizar os selvagens\", \"cristianizar os pagãos\", \"filantropia\", \"imperativo econômico\", \"miscigenação\", \"democracia racial\", \"assimilação\" e outras metáforas que não conseguem ocultar os sintomas que denunciam uma mórbida compulsão cultivada por uma civilização de fundamentos decididamente patológicos. Anotaria a ciência negra as dimensões e o peso da massa encefálica bem como a forma craniana dos brancos para averiguar qual a motivação que os conduz a roubar os tesouros artísticos de outros povos e depois, arrogante e obstinadamente, recusar a devolvê-los, mesmo em se tratando de uma celebração cultural e artística daqueles povos, conforme exemplifica a atitude do governo britânico se negando a ceder à Nigéria uma máscara-símbolo do Festac 1977, e mantendo-a trancada em seu museu de Londres. Trata-se, evidentemente, de uma peça de alto valor artístico e histórico, criada pelos nossos antepassados nigerianos.\nDe um ponto de vista psiquiátrico, se analisariam as atitudes formais, mecânicas, destituídas de emoção que os europeus e seus imitadores demonstram durante seus cultos religiosos. Este comportamento, sob uma perspectiva antropológica e psicológica, denuncia uma profunda ausência de identidade e vinculação com os seus deuses, além de uma carência de contato espiritual mais íntimo. Estudaria ainda, a partir de uma visão sociológica e etnológica, a natureza singularmente desumanizada e mecânica da sociedade euro-norte-americana, cuja última façanha, frio resultado de sua \"objetividade\", é a invenção de armas destrutivas capazes de obliterar toda a raça humana. Investigaria as origens da avareza mórbida que a leva a envenenar o seu próprio suprimento alimentar e o do resto do mundo com químicas, tinturas e preservativos, numa patética \"eficiência\" em busca de mais lucros. E nessa diabólica manipulação gananciosa, a destruir de forma insensível milhões de toneladas de alimentos, ou sacrificar no altar do desperdício farto outros milhões de cabeças de gado anualmente. Não são os povos da África, das Américas ou da Ásia os autores de tais absurdos. Estes alimentariam os seus filhos com aqueles produtos se isso lhes fosse possível.\nUm estudo desse porte teria de considerar cuidadosamente os mecanismos inconscientes, conscientes, e outros, que induziram os europeus a se apropriarem de todo o patrimônio da civilização negro-africana do Egito antigo, e, utilizando-se da falsificação acadêmica, tentar erradicar a identidade do povo egípcio daquela época, para em seguida negar ao Egito negro as ciências, as artes, a filosofia, a religião que ele criou, atribuindo à Grécia o seu patrimônio de saber.\nÉ imperativo compreender e reconhecer que a experiência histórica dos africanos na diáspora tem sido uma experiência de conteúdo essencialmente racista, que transcende certas simplificações segundo as quais a escravidão e as subseqüentes formas de opressão racista dos povos negros são apenas subprodutos do capitalismo. Assim, a escravização dos africanos e a desumanização dos seus descendentes nas Américas teriam ocorrido e estariam ocorrendo como um determinismo inarredável do processo econômico da humanidade, o qual teria engendrado a escravidão à base da \"necessidade\" do sistema de produção. Falam de sistema demonstrando uma devoção beata a algo supostamente sublime, etéreo e intangível. A \"necessidade\" dos europeus teria caído sobre nossas cabeças e nossos destinos qual desígnio irrecorrível de Deus ou das potências cósmicas. Não menciona, tal racionalização, que o sistema só tem existência porque está incorporado em seres humanos com as suas motivações, aspirações, interesses e projetos. Sob a perspectiva humana da sociedade ocidental, têm sido o racismo e seus derivados - o chauvinismo cultural, o preconceito e a discriminação racial e de cor - os elementos operativos no dilema existencial dos povos negros.\nEm nosso país, os interesses econômicos, a ambição, o orgulho, o medo, a arrogância se complementam e desempenham a parte respectiva que lhes cabe no sentido de complicar ainda mais a teia que emaranha e obscurece a realidade do racismo vigente. Uma pergunta então é necessária: seria o racismo apenas um orgulho do branco que se expressa nessa qualidade de sentimento racial de desdém e menosprezo para com o negro, sentimento que às vezes toma a forma abstrata do preconceito, outras vezes atua objetiva e concretamente na forma de discriminação de caráter racial? Estas são na verdade expressões ou partes do racismo. Este, contudo, é mais abrangente: o racismo do tipo praticado entre nós é a imposição de uma minoria de origem branco-européia sobre uma maioria negra de origem africana. Para atingir seus intentos, essa minoria adota as mais variadas estratégias, as quais incluem desde os instrumentos mais óbvios aos mais sofisticados e despistadores. Tanto se faz uso da violência policial direta e brutal, quanto da violência ideológica sutil, ou da violência econômica, que é uma forma de genocídio físico e espiritual. Todas as formas imagináveis de coação se praticaram e se praticam, inclusive a violência religiosa, no afã de assegurar a imposição do etnocentrismo ocidental sobre os afro-brasileiros. A elaboração da chamada \"democracia racial\" obedeceu à intenção de disfarçar os privilégios do segmento minoritário, detentor exclusivo da renda do país e do poder político nacional. Fique registrado que muitos brancos íntegros são ofuscados pela maligna fosforescência da \"democracia racial\" e se comportam diante da população negra da maneira tradicional do racista brasileiro: com postura paternalista.\n\nABC do quilombismo\n\nNa trajetória histórica que esquematizamos nestas páginas, o quilombismo tem nos fornecido várias lições. Tentaremos resumi-las num ABC fundamental que nos ensina que:\n\na) Autoritarismo de quase 500 anos já é bastante. Não podemos, não\ndevemos e não queremos tolerá-lo por mais tempo. Sabemos de experiência própria que uma das práticas desse autoritarismo é o desrespeito brutal da polícia às famílias negras. Toda a sorte de arbitrariedade policial se acha fixada nas batidas que ela faz rotineiramente para manter aterrorizada e desmoralizada a comunidade afro-brasileira. Assim fica confirmada, diante dos olhos dos próprios negros, sua condição de impotência e inferioridade, já que são incapazes até mesmo de se autodefenderem ou de proteger sua família e os membros de sua respectiva comunidade. Trata-se de um estado de humilhação permanente.\n\nb) Banto denomina-se um povo ao qual pertenceram os primeiros\nafricanos escravizados que vieram para o Brasil de países que hoje se chamam Angola, Congo, Zaire, Moçambique e outros. Foram os bantos os primeiros quilombolas a enfrentar em terras brasileiras o poder militar do branco escravizador.\n\nc) Cuidar em organizar a nossa luta por nós mesmos é um imperativo\nda nossa sobrevivência como um povo. Devemos por isso ter muito cuidado ao fazer alianças com outras forças políticas, sejam as ditas revolucionárias, reformistas, radicais, progressistas ou liberais. Toda e qualquer aliança deve obedecer a um interesse tático ou estratégico, e o negro precisa obrigatoriamente ter poder de decisão, a fim de não permitir que a comunidade negra seja manipulada por interesses de causas alheias à sua própria.\n\nd) Devemos ampliar sempre a nossa frente de luta, tendo em vista: 1)\nos objetivos mais distantes da transformação radical das estruturas sócio-econômicas e culturais da sociedade brasileira; 2) os interesses táticos imediatos. Nestes últimos se inclui o voto do analfabeto e a anistia aos prisioneiros políticos negros. Os prisioneiros políticos negros são aqueles que são maliciosamente fichados pela polícia como desocupados, vadios, malandros, marginais, e cujos lares são freqüentemente invadidos.\n\ne) Ewe ou gêge, povo africano de Gana, Togo e Daomé (Benin); milhões de ewes foram escravizados no Brasil. Eles são parte do nosso povo e da nossa cultura afro-brasileira.\n\nEjetar o supremacismo branco do nosso meio é um dever de todo democrata. Devemos ter sempre presente que o racismo, isto é, supremacismo branco, preconceito de cor e discriminação racial, compõem o fator raça, a primeira contradição para a população de origem africana na sociedade brasileira. (Aviso aos intrigantes, aos maliciosos, aos apressados em julgar: o vocábulo raça, no sentido aqui empregado, se define somente em termos de história e cultura, e não em pureza biológica).\n\nf) Formar os quadros do quilombismo é tão importante quanto a mobilização e a organização da comunidade negra.\n\ng) Garantir ao povo trabalhador negro o seu lugar na hierarquia de Poder e Decisão, mantendo a sua integridade etno-cultural, é a motivação básica do quilombismo.\n\nh) Humilhados que fomos e somos todos os negro-africanos, com todos devemos manter íntimo contato. Também com organizações africanas independentes, tanto da diáspora como do continente. São importantes e necessárias as relações com órgãos e instituições internacionais de Direitos Humanos, tais como a ONU e a UNESCO, de onde poderemos receber apoio em casos de repressão. Nunca esquecer que sempre estivemos sob a violência da oligarquia latifundiária, industrial-financeira ou militar.\n\ni) Infalível como um fenômeno da natureza será a perseguição do poder branco ao quilombismo. Está na lógica inflexível do racismo brasileiro jamais permitir qualquer movimento libertário dos negros majoritários. Nossa existência física é uma realidade que jamais pôde ser obliterada, nem mesmo pelo Instituto Brasileiro de Geografia e Estatística (IBGE) ao manipular os dados censitários, nos quais erradicou o fator racial e de cor dos cômputos demográficos. E quanto a nosso peso político? Simplesmente não existe. Desde a proclamação da República, a exclusão do voto ao analfabeto significa na prática a exclusão da população negra do processo político do país.\n\nj) Jamais as organizações políticas dos afro-brasileiros deverão permitir o acesso aos brancos não-quilombistas a posições com autoridade para obstruir a ação ou influenciar as tomadas de posição teóricas e práticas em face da luta.\n\nk) Kimbundo, língua do povo banto, veio para o Brasil com os escravos procedentes da África meridional. Essa língua exerceu notável influência sobre o português falado neste país.\n\nl) Livrar o Brasil da industrialização artificial, tipo \"milagre econômico\", está nas metas do quilombismo. Neste esquema de industrialização, o negro é explorado a um tempo pelo capitalista industrial e pela classe trabalhadora classificada ou \"qualificada\". Como trabalhador \"desqualificado\" ou sem classe, ele é duplamente vítima: da raça (branca) e da classe (trabalhadora \"qualificada\" e/ou burguesia de qualquer raça). O quilombismo advoga para o Brasil um conhecimento científico e técnico que possibilite a genuína industrialização que represente um novo avanço de autonomia nacional. O quilombismo não aceita que se entregue a nossa reserva mineral e a nossa economia às corporações monopolistas internacionais, porém tampouco defende os interesses de uma burguesia nacional. O negro-africano foi o primeiro e o principal artífice da formação econômica do País e a riqueza nacional pertence a ele e a todo o povo brasileiro que a produz.\n\nm) Mancha branca é o que significa a imposição miscigenadora do branco, implícita na ideologia do branqueamento, na política imigratória, no mito da \"democracia racial\". Tudo não passa de racionalização do supremacismo branco e do estupro histórico e atual que se pratica contra a mulher negra.\n\nn) Nada de mais confusões: se no Brasil efetivamente houvesse igualdade de tratamento, de oportunidades, de respeito, de poder político e econômico; se o encontro entre pessoas de raças diferentes ocorresse espontâneo e livre da pressão do poder e prestígio sócio-econômico do branco; se não houvesse outros condicionamentos repressivos de caráter moral, estético e cultural, a miscigenação seria um acontecimento positivo, capaz de enriquecer o brasileiro, a sociedade, a cultura e a humanidade das pessoas.\n\no) Obstar o ensinamento e a prática genocidas do supremacismo branco é um fator substantivo do quilombismo.\n\np) Poder quilombista quer dizer: a Raça Negra no Poder. Os descendentes de africanos somam a maioria da nossa população. Portanto, o Poder Negro será um poder democrático. (Reitero aqui a advertência aos intrigantes, aos maliciosos, aos ignorantes, aos racistas: neste livro a palavra raça tem exclusiva acepção histórico-cultural. Raça biologicamente pura não existe e nunca existiu).\n\nq) Quebrar a eficácia de certos slogans que atravessam a nossa ação contra o racismo, como aquele da luta única de todos os trabalhadores, de todo o povo ou de todos os oprimidos, é um dever do quilombista. Os privilégios raciais do branco em detrimento do negro constituem uma ideologia que vem desde o mundo antigo. A pregação da luta \"única\" ou \"unida\" não passa de outra face do desprezo que nos votam, já que não respeitam a nossa identidade e nem a especificidade do nosso problema e do nosso esforço em resolvê-lo.\n\nr) Raça: acreditamos que todos os seres humanos pertencem à mesma espécie. Para o quilombismo, raça significa um grupo humano que possui, relativamente, idênticas características somáticas, resultantes de um complexo de fatores históricos e ambientais. Tanto a aparência física, como igualmente os traços psicológicos, de personalidade, de caráter e emotividade, sofrem a influência daquele complexo de fatores onde se somam e se complementam a genética, a sociedade, a cultura, o meio geográfico, a história. O cruzamento de diferentes grupos raciais, ou de pessoas de identidade racial diversas, está na linha dos mais legítimos interesses de sobrevivência da espécie humana.\nRacismo: é a crença na inerente superioridade de uma raça sobre outra. Tal superioridade é concebida tanto no aspecto biológico, como na dimensão psico-sócio-cultural. Esta é a dimensão usualmente negligenciada ou omitida nas definições tradicionais do racismo. A elaboração teórico-científica produzida pela cultura branco-européia justificando a escravização e a inferiorização dos povos africanos constitui o exemplo eminente do racismo sem precedentes na história da humanidade.\nRacismo é a primeira contradição social no caminho do negro. A esta se juntam outras, como a contradição de classes e de sexo.\n\ns) Swahili é uma língua de origem banta, influenciada por outros idiomas, especialmente o árabe. Atualmente, o swahili é falado por mais de 20 milhões de africanos da Tanzânia, do Quênia, de Uganda, do Burundi, do Zaire, e de outros países. Os afro-brasileiros necessitam aprendê-la com urgência.\nSlogan do poder público e da sociedade dominante, no Brasil, condenando reiterada e indignadamente o racismo, se tornou um recurso eficaz encobrindo a operação racista e discriminatória sistemática, de um lado, e de outro lado servindo como uma arma apontada contra nós com a finalidade de atemorizar-nos, amortecendo ou impedindo que um movimento coeso do povo afro-brasileiro obtenha a sua total libertação.\n\nt) Todo negro ou mulato (afro-brasileiro) que aceita a \"democracia racial\" como uma realidade, e a miscigenação na forma vigente como positiva, está traindo a si mesmo, e se considerando um ser inferior.\n\nu) Unanimidade é algo impossível no campo social e político. Não devemos perder o nosso tempo e a nossa energia com as críticas vindas de fora do movimento quilombista. Temos de nos preocupar e criticar a nós próprios e às nossas organizações, no sentido de ampliar a nossa consciência negra e quilombista rumo ao objetivo final: a ascensão do povo afro-brasileiro ao Poder.\n\nv) Vênia é o que não precisamos pedir às classes dominantes para reconquistarmos os frutos do trabalho realizado pelos nossos ancestrais africanos no Brasil. Nem devemos aceitar ou assumir certas definições, \"científicas\" ou não, que pretendem situar o comunalismo africano e o ujamaaísmo como simples formas arcaicas de organização econômica e/ou social. Esta é outra arrogância de fundo eurocentrista que implicitamente nega às instituições nascidas na realidade histórica da África a capacidade intrínseca de desenvolvimento autônomo relativo. Nega a tais instituições a possibilidade de progresso e atualização, admitindo que a ocupação colonizadora do Continente Africano pelos europeus determinasse o concomitante desaparecimento dos valores, princípios e instituições africanas. Estas corporificariam formas não-dinâmicas, exclusivamente quietistas e imobilizadas. Tal visão petrificada da África e de suas culturas é uma ficção puramente cerebral. O quilombismo pretende resgatar dessa definição negativista o sentido de organização sócio-econômica concebido para servir à existência humana; organização que existiu na África e que os africanos escravizados trouxeram e praticaram no Brasil. A sociedade brasileira contemporânea pode se beneficiar com o projeto do quilombismo, uma alternativa nacional que se oferece em substituição ao sistema desumano do capitalismo.\n\nx) Xingar não basta. Precisamos é de mobilização e de organização da gente negra, e de uma luta enérgica, sem pausa e sem descanso, contra as destituições que nos atingem. Até que ponto vamos assistir impotentes à cruel exterminação dos nossos irmãos e irmãs afro-brasileiros, principalmente das crianças negras deste país?\n\ny) Yorubás (Nagô) somos também em nossa africanidade brasileira. Os iorubás são parte integrante do nosso povo, da nossa cultura, da nossa religião, da nossa luta e do nosso futuro.\n\nz) Zumbi: fundador do quilombismo.\n\n\nPropostas de ação para o Governo Brasileiro\n\nO programa de ação quilombista incorpora, devidamente atualizadas, as seguintes propostas apresentadas por este autor ao Colóquio do 2º Festival Mundial de Artes e Culturas Negras e Africanas (Festac), realizado em Lagos, Nigéria, em 1977 (Nascimento, 1978, 2002). Naquela ocasião, o autor propôs ao Colóquio recomendar que o Governo Brasileiro\n\n1) permita e estimule a livre e aberta discussão dos problemas dos descendentes de africanos no país; e que encoraje e financie pesquisas sobre a posição econômica, social e cultural ocupada pelos afro-brasileiros dentro da sociedade brasileira, em todos os níveis;\n2) localize e publique documentos e outros fatos e informações possivelmente existentes em arquivos privados, cartórios, arquivos de câmara municipal de velhas cidades do interior, referentes ao tráfico negreiro, à escravidão e à abolição; em resumo, qualquer dado que possa ajudar a esclarecer e aprofundar a compreensão da experiência do africano escravizado e de seus descendentes;\n3) inclua quesitos sobre raça ou etnia em todos os futuros censos demográficos; que em toda informação que dito governo divulgue, tanto para consumo doméstico como internacional a respeito da composição demográfica do país, não se omita o aspecto da origem racial / étnica;\n4) inclua um ativo e compulsório currículo sobre a história e as culturas dos povos africanos, tanto aqueles do continente como os da diáspora; tal currículo deve abranger todos os níveis do sistema educativo: elementar, médio e superior;\n5) tome medidas ativas para promover o ensino e o uso prático de línguas africanas, especialmente as línguas ki-swahili e iorubá; o mesmo em relação aos sistemas religiosos africanos e seus fundamentos artísticos; que o dito governo promova válidos programas de intercâmbio cultural com as nações africanas;\n6) estude e formule compensações aos afro-brasileiros pelos séculos de escravização criminosa e decênios de discriminação racial depois da abolição; para esse fim deverá drenar recursos financeiros e outros, compulsoriamente originados da Agricultura, do Comércio e da Indústria, setores que historicamente têm sido beneficiados com a exploração do povo negro. Tais recursos constituirão um fundo destinado à construção de moradias, que satisfaçam às exigências da condição humana, em substituição às atuais habitações segregadas onde vive a maioria dos afro-brasileiros: favelas, cortiços, mocambos, porões, cabeças-de-porco, e assim por diante. O fundo sustentaria também a distribuição de terras no interior do país para os negros engajados na produção agropecuária;\n7) remova os objetos da arte afro-brasileira assim como os de sentido ritual encontrados hoje em instituições de polícia, de psiquiatria, história e etnografia; e que o dito governo estabeleça museus de arte com finalidade dinâmica e pedagógica de valorização e respeito devidos à cultura afro-brasileira; de preferência, tais museus se localizariam nos estados com significativa população negra, tais como Bahia, Maranhão, Pernambuco, Alagoas, Minas Gerais, Rio de Janeiro, São Paulo, Sergipe, Rio Grande do Sul;\n8) conceda efetivo apoio, material e financeiro, à existentes e futuras associações afro-brasileiras com finalidade de pesquisa, informação e divulgação nos setores de educação, arte, cultura e posição sócio-econômica da população afro-brasileira.\n9) tome medidas rigorosas e apropriadas ao efetivo cumprimento da lei Afonso Arinos, fazendo cessar o papel burlesco que tem desempenhado até agora;\n10) tome ativas providências, ajuste as realidades do país, para que de nenhuma forma se permita ou possibilite a discriminação racial ou de cor no emprego, garantindo a igualdade de oportunidade que atualmente inexiste entre brancos, negros e outras nuanças étnicas.\n11) exerça seu poder através de uma justa política de redistribuição da renda, tornando impraticável que, por causa da profunda desigualdade econômica imperante, o afro-brasileiro seja discriminado, embora sutil e indiretamente, em qualquer nível do sistema educativo, seja o elementar, o médio ou o universitário.\n12) estimule ativamente o ingresso de negros no Instituto Rio Branco, órgão de formação de diplomatas pertencente ao Ministério de Relações Exteriores.\n13) nomeie negros para o cargo de embaixador e diplomata para as Nações Unidas e junto aos Governos de outros países do mundo.\n14) estimule a formação de negros como oficiais superiores das Forças Armadas (Exército, Marinha e Aeronáutica) com promoções no serviço ativo até os postos de general, almirante, brigadeiro e marechal.\n15) nomeie negros para os altos escalões do Governo Federal em seus vários ministérios e outras repartições do Executivo, incluindo órgãos superiores como o Conselho Federal de Cultura, o Conselho Federal de Educação, o Conselho de Segurança Nacional, o Tribunal de Contas.\n16) estimule e encoraja a formação e o desenvolvimento de uma liderança política negra, representando os interesses específicos da população afro-brasileira no Senado Federal, na Câmara dos Deputados, nas Assembléias Legislativas Estaduais e nas Câmaras Municipais; que o dito Governo nomeie negros para os cargos de juizes estaduais e federais, inclusive para o Supremo Tribunal Federal, Superior Tribunal Eleitoral, Superior Tribunal Militar, Superior Tribunal do Trabalho e o Tribunal Federal de Recursos.\n17) concretize sua tão proclamada \"amizade\" com a África independente e sua tão freqüentemente manifestada posição anticolonialista, dando efetivo apoio diplomático e material aos legítimos movimentos de libertação nacional de Zimbabwe, Namíbia e África do Sul.\n\nAlguns princípios e propósitos do quilombismo\n\n1. O Quilombismo é um movimento político dos negros brasileiros, objetivando a implantação de um Estado Nacional Quilombista, inspirado no modelo da República dos Palmares, no século XVI, e em outros quilombos que existiram e existem no País.\n\n2. O Estado Nacional Quilombista tem sua base numa sociedade livre, justa, igualitária e soberana. O igualitarismo democrática quilombista é compreendido no tocante a sexo, sociedade, religião, política, justiça, educação, cultura, condição racial, situação econômica, enfim, todas as expressões da vida em sociedade. O mesmo igualitarismo se aplica a todos os níveis do Poder e de instituições públicas e privadas.\n\n3. A finalidade básica do Estado Nacional Quilombista é a de promover a felicidade do ser humano. Para atingir sua finalidade, o quilombismo acredita numa economia de base comunitário-cooperativista no setor da produção, da distribuição e da divisão dos resultados do trabalho coletivo.\n\n4. O quilombismo considera a terra uma propriedade nacional de uso coletivo. As fábricas e outras instalações industriais, assim como todos os bens e instrumentos de produção, da mesma forma que a terra, são de propriedade e uso coletivo da sociedade. Os trabalhadores rurais ou camponeses trabalham a terra e são eles próprios os dirigentes das instituições agropecuárias. Os operários da indústria e os trabalhadores de modo geral são os produtores dos objetos industriais e os únicos responsáveis pela orientação e gerência de suas respectivas unidades de produção.\n\n5. No quilombismo o trabalho é um direito e uma obrigação social, e os trabalhadores, que criam a riqueza agrícola e industrial da sociedade quilombista, são os únicos donos do produto do seu trabalho.\n\n6. A criança negra tem sido a vítima predileta e indefesa da miséria material e moral imposta à comunidade afro-brasileira. Por isso, ela constitui a preocupação urgente e prioritária do quilombismo. Atendimento pré-natal, amparo à maternidade, creches, alimentação adequada, moradia higiênica e humana, são alguns dos itens relacionados à criança negra que figuram no programa de ação do movimento quilombista.\n\n7. A educação e o ensino em todos os graus - elementar, médio e superior - serão completamente gratuitos e abertos sem distinção a todos os membros da sociedade quilombista. A história da África, das culturas, das civilizações e das artes africanas terão um lugar eminente nos currículos escolares. Criar uma Universidade Afro-Brasileira é uma necessidade dentro do programa quilombista.\n\n8. Visando o quilombismo a fundação de uma sociedade criativa, ele procurará estimular todas as potencialidades do ser humano e sua plena realização. Combater o embrutecimento causado pelo hábito, pela miséria, pela mecanização da existência e pela burocratização das relações humanas e sociais, é um ponto fundamental. As artes em geral ocuparão um espaço básico no sistema educativo e no contexto das atividades sociais.\n\n9. No quilombismo não haverá religiões e religiões populares, isto é, religião da elite e religiões do povo. Todas as religiões merecem igual tratamento de respeito e de garantias de culto.\n\n10. O Estado quilombista proíbe a existência de um aparato burocrático estatal que perturbe ou interfira com a mobilidade vertical das classes trabalhadoras e marginalizadas em relação direta com os dirigentes. Na relação dialética dos membros da sociedade com as suas instituições repousa o sentido progressista e dinâmico do quilombismo.\n\n11. A revolução quilombista é fundamentalmente anti-racista, anticapitalista, antilatifundiária, antiimperialista e antineocolonialista.\n\n12. Em todos os órgãos do Poder do Estado Quilombista - Legislativo, Executivo e Judiciário - a metade dos cargos de confiança, dos cargos eletivos, ou dos cargos por nomeação, deverão, por imperativo constitucional, ser ocupados por mulheres. O mesmo se aplica a todo e qualquer setor ou instituição de serviço público.\n\n13. O quilombismo considera a transformação das relações de produção, e da sociedade de modo geral, por meios não-violentos e democráticos, uma via possível.\n\n14. É matéria urgente para o quilombismo a organização de uma instituição econômico-financeira em moldes cooperativos, capaz de assegurar a manutenção e a expansão da luta quilombista a salvo das interferências controladoras do paternalismo ou das pressões do Poder econômico.\n\n15. O quilombismo essencialmente é um defensor da existência humana e, como tal, ele se coloca contra a poluição ecológica e favorece todas as formas de melhoramento ambiental que possam assegurar uma vida saudável para as crianças, as mulheres e os homens, os animais, as criaturas do mar, as plantas, as selvas, as pedras e todas as manifestações da natureza.\n\n16. O Brasil é signatário da Convenção Internacional para a Eliminação de Todas as Formas de Discriminação Racial, adotada pela Assembléia Geral das Nações Unidas em 1965. No sentido de cooperar para a concretização de objetivos tão elevados e generosos, e tendo em vista o artigo 9, números 1 e 2 da referida Convenção, o quilombismo contribuirá para a pesquisa e a elaboração de um relatório ou dossiê bianual, abrangendo todos os fatos relativos à discriminação racial ocorridos no País, a fim de auxiliar os trabalhos do Comitê para a Eliminação da Discriminação Racial das Nações Unidas.\n\n\nSemana da memória afro-brasileira\n\nEsta Semana está sendo proposta pela necessidade do negro de recuperar a sua memória. Durante esta Semana serão focalizados e iluminados os sucessos passados nos quais foram protagonistas aqueles 300 milhões de africanos retirados, sob violência, de suas terras e trazidos acorrentados para o continente americano. Através de celebrações anuais, a comunidade negra não só honrará os antepassados, como reforçará a sua coesão e identidade. E transmitirá às novas gerações um exemplo de amor à história do nosso povo, auxiliando-as a ter uma visão mais clara e verdadeira do papel fundamental cumprido pelos escravos africanos na construção deste País. Isto só infundirá aos jovens de agora e do futuro um orgulho em lugar da vergonha que a sociedade dominante tem procurado infiltrar na consciência dos negros, como se fosse a única herança deixada por seus ancestrais.\nA Semana deve aliar aos aspectos comemorativos uma constante pesquisa, crítica e reflexão sobre o passado e o presente das condições de vida da população de origem africana no Brasil. Isto contribuirá para ampliar e fortalecer o quilombismo sem sua filosofia, teoria e prática de libertação. A Semana implica também um estímulo às organizações negras existentes, sem discriminar nenhuma delas por causa dos seus objetivos declarados. Tanto aquelas que perseguem finalidades recreativas ou beneficentes, como as outras de sentido cultural, social ou político, se encontram todas interessadas no destino e na melhoria da situação da família afro-brasileira. Portanto, se inserem na mesma perspectiva quilombista ampla que estamos tentando sistematizar.\nBasicamente, esta \"Semana da Memória\" está sendo concebida como uma ferramenta operativa no campo da ação (mobilização e organização), combinada ao setor da especulação, da teoria, da formulação de princípios, das análises, definições e outras ponderações. Enfim, a Semana deve ser um exercício de emancipação e nunca uma comemoração convencional, estática e retórica, que proponha unicamente a evocação de fatos, datas e nomes do passado. Estudar e lembrar os feitos dos antepassados deve constituir um acontecimento inspirador que estimule a ação transformadora do presente. Rumo ao futuro, ou seja, o oposto da contemplação saudosista, autoglorificadora do pretérito, ou da motivação de cenas de autoflagelação.\nResgatar nossa memória significa resgatarmos a nós mesmos do esquecimento, do nada e da negação, e reafirmarmos a nossa presença ativa na história pan-africana e na realidade universal do seres humanos.\nComo norma de procedimento, a Semana deve ser promovida, de preferência, por organizações afro-brasileiras. Entretanto, poderá também ser realizada por escolas públicas ou privadas que atualmente se interessem pelo progresso cívico da comunidade afro-brasileira. Neste caso, como de modo geral tais escolas não são dirigidas por homem negro ou mulher negra, os afro-brasileiros presentes devem estar alertas a fim de impedir que os fatos históricos e os eventos da vida negro-africana sejam manipulados ou distorcidos, seja por malícia, ignorância ou negligência. As famílias negras, onde não existir organização afro-brasileira ou escola pública ou privada interessada na vida negra, devem preencher o papel de realizadores da Semana. Reiteramos que uma Semana da Memória jamais deve esvaziar o seu conteúdo intrínseco de valores negro-africanos de história, cultura, artes, seccionando-o do contexto sócio-político e econômico onde os povos de origem africana se movimentaram, produziram, lutaram e fizeram a história que até o presente não figura, em toda a sua extensão e importância, na História convencional ou oficial do Brasil.\nA proposta que ofereço à consideração dos meus irmãos e irmãs negros de \"Semana da Memória\" tem seu encerramento a 20 de novembro de cada ano, aniversário da morte de Zumbi e Dia Nacional da Consciência Negra instituído pelo movimento negro brasileiro a partir de proposta oriunda do Rio Grande do Sul. Assim, a Semana principia a 14 de novembro e obedecerá ao seguinte calendário:\n\nDia 14 (1º dia): África: suas civilizações na antigüidade, o Egito, a Etiópia, o Sudão. Os impérios mais recentes: Songai, Asante, Iorubá, e outros. Nesta celebração se incluem referências às formas de organização africana da família (matriarcado), sociedade, economia e do Estado. As artes, as ciências, a tecnologia: as pirâmides egípcias, a matemática, a engenharia, a medicina, as pinturas rupestres e as construções urbanas em Zimbábue, as esculturas de Nok, Ifé, Benin, e assim por diante.\n\nDia 15 (2º dia): As primeiras incursões portuguesas no território africano no século XIV. Logo depois, a invasão colonial da África por Portugal, Espanha, França, Inglaterra, Holanda, Bélgica, Itália, Alemanha. A escravização dos africanos: as técnicas de captura utilizadas pelos bandidos europeus. As longas caminhadas através das florestas até à costa atlântica. A enorme taxa de mortalidade durante o trajeto. Os barracões e depósitos na costa. O batismo compulsório.\n\nDia 16 (3º dia): O embarque dos africanos nos tumbeiros: os horrores a bordo: fome, sede, epidemias, imobilidade do corpo, falta de ar; a alta taxa de mortalidade; os africanos atirados vivos ao mar; outras formas de suplício e assassínio. Os portos brasileiros de desembarque.\n\nDia 17 (4º dia): Os mercados de escravos; maneira como as \"peças\" eram oferecidas ao público comprador, e os brancos examinavam os africanos como se fossem animais. As vendas e as compras atendendo os pontos focais de concentração econômica: produção do açúcar, do algodão, da mineração, do café, do cacau, do gado, do fumo, e assim por diante.\n\nDia 18 (5º dia): Vida escrava, rural e urbana. Os castigos e os instrumentos de tortura. O estupro da mulher africana. A imposição religiosa católica. A persistência das danças, cantos, instrumentos musicais e folguedos trazidos da África pelos escravos. As religiões africanas e as línguas faladas pelos escravos. Formas de recusa à escravidão: suicídio, banzo, fuga, assassínio do senhor, e outras.\n\nDia 19 (6º dia): As revoltas e os quilombos. O papel dos valores africanos da resistência: religião, arte, folclores, conhecimentos técnicos de fundição do ferro, do bronze, de agricultura. A importância na resistência de instituições religiosas a exemplo da Casa das Minas (Maranhão), do Axé do Opô Afonjá (Bahia). Papel das instituições laicas após a abolição: Frente Negra Brasileira, Teatro Experimental do Negro, União dos Homens de Cor, Associação Cultural dos Negros, Floresta Aurora, e todas as outras organizações negras que existiram e existem.\n\nDia 20 (7º dia): O Dia da Consciência Negra deve resumir tudo aquilo que tiver ocorrido nos dias anteriores. Ênfase à figura de Zumbi, o primeiro militante do pan-africanismo e da luta por liberdade em terras brasileiras. Zumbi, consolidador da luta palmarista, selando com sua morte em plena batalha a determinação libertária do povo negro-africano escravizado, é o fundador, na prática, do conceito científico histórico-cultural do quilombismo. Quilombismo continuado por outros heróis da história negra: Luísa Mahin e seu filho Luís Gama, Chico-Rei, os enforcados da Revolta dos Alfaiates, dos levantes dos Malês, da Balaiada, o Dragão do Mar, Karocango, João Cândido, e os milhões de quilombolas assassinados em todas as partes do nosso território onde houve o infame cativeiro. Na celebração de encerramento da Semana da Memória Negra deve-se dar todo o destaque aos programas e projetos das entidades e da comunidade, tendo em vista um futuro melhor para os afro-brasileiros. O último evento da Semana deve, de preferência, acontecer ao ar livre, numa concentração da comunidade negra e das pessoas de qualquer origem interessadas em nossas atividades. Durante todo o decorrer da Semana, a retórica acadêmica deverá ser radicalmente proibida.\nAxé, Zumbi!\n\nBIBLIOGRAFIA\n\nCANDEIA (1978). 90 anos de abolição. Rio de Janeiro: G. R. A. N. Escola de Samba Quilombo.\n\nCANDEIA & Isnard (1978). Escola de samba: Árvore que esqueceu a raiz. Rio de Janeiro: Lidador/SEEC/RJ.\n\nDIOP, Cheikh Anta (1974). The African origin of civilization: Myth or reality, trad. e org. Mercer Cook. Westport: Lawrence.\n\n__ (1986). Entrevista a Black Books Bulletin, trad. do francês e coord. por Shawna Maglangbayan Moore. In: VAN SERTIMA, Ivan org. Great African Thinkers: Cheikh Anta Diop. Rutgers: Journal of African Civilizations.\n\nLUCAS, J. Olumide (1948). The religion of the Yorubas. Lagos: C. M. S.\n\nNAÇÕES UNIDAS (1966). International Convention on the Elimination of all Forms of Racial Discrimination. UN Monthly Chronicle, v. 3, n. 1, jan. OPI/213.\n\nNASCIMENTO, Maria Beatriz (1979). O Quilombo do Jabaquara. Revista de Cultura Vozes, v. 73, n. 3, abr.\n\nQUARTIM, João (1971). Dictatorship and armed struggle in Brazil, trad. David Fernbach. Nova Iorque: Monthly Review Press.\n\n\nTranscrito do livro O Quilombismo, 2ª ed. (Brasília/ Rio: Fundação Cultural Palmares/ OR Editora, 2002).",
				"added": 1609130478
			},
			{
				"comment_id": 4,
				"body": "QUILOMBISMO:\num conceito científico emergente do processo histórico-cultural\nda população afro-brasileira\n\nUma proposta do autor aos seus irmãos afrodescendentes no Brasil e nas Américas, apresentada em trabalho apresentado ao 2º Congresso de Cultura Negra das Américas, Panamá, 1980.\n\n...uma verdadeira revolução racial democrática, em nossa era, só pode dar-se sob uma condição: o negro e o mulato precisam torna-se o antibranco, para encarnarem o mais puro radicalismo democrático e mostrar aos brancos o verdadeiro sentido da revolução democrática da personalidade, da sociedade e da cultura.\n\n- Florestan Fernandes\nO Negro no Mundo dos Brancos\n\n\nMemória: a antigüidade do saber negro-africano\n\nNuma passagem anterior do texto deste livro fizemos menção à urgente necessidade do negro brasileiro em recuperar a sua memória. Esta tem sido agredida sistematicamente pela estrutura de poder e dominação há quase 500 anos. Semelhante fato tem acontecido com a memória do negro-africano, vítima, quando não de graves distorções, da mais crassa negação do seu passado histórico.\nA memória dos afro-brasileiros, muito ao contrário do que afirmam aqueles historiadores convencionais de visão curta e superficial entendimento, não se inicia com o tráfico escravo e nem nos primórdios da escravidão dos africanos, no século XV. Em nosso país, a elite dominante sempre desenvolveu esforços para evitar ou impedir que o negro brasileiro, após a chamada abolição, pudesse assumir suas raízes étnicas, históricas e culturais, desta forma seccionando-o do seu tronco familial africano. A não ser em função do recente interesse do expansionismo industrial, o Brasil como norma tradicional ignorou o continente africano. Voltou suas costas à África logo que não conseguiu mais burlar a proibição do comércio da carne africana imposta pela Inglaterra aí por volta de 1850. A imigração maciça de europeus ocorreu daí a mais alguns anos, e as classes dominantes enfatizam sua intenção e ação no sentido de arrancar da mente e do coração dos descendentes escravos a imagem da África como um a lembrança positiva de nação, de pátria, de terra nativa; nunca em nosso sistema educativo se ensinou qualquer disciplina que revelasse algum apreço ou respeito às culturas, artes, línguas e religiões de origem africana. E o contato físico do afro-brasileiro com os seus irmãos no continente e na diáspora sempre foi impedido ou dificultado, entre outros obstáculos, pela carência de meios econômicos que permitissem ao negro se locomover e viajar fora do país. Porém, nenhum desses empecilhos teve o poder de obliterar completamente do nosso espírito e da nossa lembrança a presença viva da Mãe África.\nAs diversas estratégias e os expedientes que se utilizam contra a memória do negro-africano têm sofrido, ultimamente, profunda erosão e irreparável descrédito. Este trabalho é fruto da dedicação e competência de alguns africanos, a um tempo estudiosos, pesquisadores, cientistas, filósofos, e criadores de literatura e arte, pessoas do continente africano e da diáspora africana. Cheikh Anta Diop, do Senegal; Chancellor Williams, dos Estados Unidos; Ivan Van Sertima e George M. James, da Guiana; Yosef Ben-Jochannam, da Etiópia; Theophile Obenga, do Congo-Brazzaville; Wole Soyinka e Wande Abimbola, da Nigéria, figuram entre os muitos que estão ativos, produzindo obras fundamentais para a África contemporânea e futura. Em campos diferentes, e sob perspectivas diversas, o esforço desses eminentes irmãos africanos se canaliza rumo a exorcizar as falsidades, distorções e negações que há tanto tempo se vêm tecendo com o intuito de velar ou apagar a memória do saber, do conhecimento científico e filosófico, e das realizações dos povos de origem negro-africana. A memória do negro brasileiro é parte e partícipe nesse esforço de reconstrução de um passado ao qual todos os afro-brasileiros estão ligados. Ter um passado é ter uma conseqüente responsabilidade nos destinos e no futuro da nação negro-africana, mesmo enquanto preservando a nossa condição de edificadores deste país e de cidadãos genuínos do Brasil.\nA obra fundamental de Cheikh Anta Diop, principalmente seu livro The African Origin of Civilization (versão em inglês de seleções de Nations Nègres et Culture e Antériorité des Civilisations Nègres, originalmente publicados em francês), apresenta uma confrontação radical e um desafio irrespondível à arrogância intelectual, desonestidade científica e carência ética do mundo acadêmico ocidental ao tratar os povos, civilizações e culturas produzidas pela África. Utilizando-se dos recursos científicos euro-ocidentais - Diop é químico, diretor do laboratório de radiocarbono do IFAN, em Dacar, além de egiptólogo, historiador e lingüista - este sábio está reconstruindo a significação e os valores da antigas culturas e civilizações erigidas pelos negro-africanos, as quais por longo tempo têm permanecido obnubiladas pelas manipulações, mentiras, distorções e roubos. São os bens de cultura e civilização e de artes criados pelos nossos antepassados no Egito antigo, os quais eram negros e não um povo de origem branco (ou vermelho escuro) conforme os cientistas ocidentais do século XIX proclamavam com ênfase tão mentirosa quanto interessada. Vejamos como a esse respeito se manifesta Diop:\n\nO fruto moral da sua civilização está para ser contado entre os bens do mundo negro. Ao invés de se apresentar à história como um devedor insolvente, este mundo negro é o próprio iniciador da civilização \"ocidental\" ostentada hoje diante dos nossos olhos. Matemática pitagórica, a teoria dos quatro elementos de Thales de Mileto, materialismo epicureano, idealismo platônico, judaísmo, islamismo, e a ciência moderna, estão enraizados na cosmogonia e na ciência egípcias. Só temos que meditar sobre Osíris, o deus-redentor, que se sacrifica, morre e é ressuscitado, uma figura essencialmente identificável a Cristo (1974: XIV).\n\nAs afirmações de Diop se baseiam em rigorosa pesquisa, em rigoroso exame e rigorosa conclusão, não deixando margem para dúvidas ou discussões. E isto longe de pretender aquele dogmatismo que sempre caracteriza as certezas \"científicas\" do mundo ocidental. O que Diop fez foi simplesmente derruir as estruturas supostamente definitivas do conhecimento \"universal\" no que respeita à antigüidade egípcia e grega. Gostem ou não, os ocidentais têm de tragar verdades como esta: \"...quatro séculos antes da publicação de A mentalidade primitiva de Lévy-Bruhl, a África negra muçulmana comentava a lógica formal de Aristóteles (que ele plagiou do Egito negro) e demonstrava-se especialista em dialética\" (Diop, 1963: 212).\nE isto, não esqueçamos, acontecia quase 500 anos antes que ao menos tivessem nascido Hegel ou Karl Marx...\nDiop revolve todo o processo da mistificação de um Egito negro que se tornou branco por artes da magia européia dos egiptólogos. Após a campanha militar de Bonaparte no Egito, em 1799, e depois que os hieróglifos da pedra Rosetta foram decifrados por Champollion, o jovem, em 1822, os egiptólogos se desarticularam atônitos diante da grandiosidade das descobertas reveladas.\n\nEles geralmente a reconheceram como a mais antiga civilização, a que tinha engendrado todas as outras. Mas com o imperialismo, sendo o que é, tornou-se crescentemente \"inadmissível\" continuar aceitando a teoria evidente até então - de um Egito negro. O nascimento da egiptologia foi assim marcado pela necessidade de destruir a memória de um Egito negro, a qualquer custo, em todas as mentes. Daí em diante, o denominador comum de todas as teses dos egiptólogos, sua relação íntima e profunda afinidade, pode ser caracterizado como uma tentativa desesperada de refutar essa opinião [do Egito ser negro]. Quase todos os egiptólogos enfatizaram sua falsidade como uma questão fechada (1974: 45).\n\nDesta posição intelectual em diante, como procederam os egiptólogos? Como negar a realidade egípcia, essencialmente negra, a qual não apresentava contradições científicas realmente confiáveis ou válidas? Não possuindo argumentos ou razões para refutar a verdade, exposta pelos antigos que viram o Egito de perto, alguns egiptólogos preferiram guardar silêncio sobre a questão; outros, mais obsessivos em seu irracionalismo, optaram pelo caminho da rejeição dogmática, infundada e indignada. De um modo geral, todos \"se lamentavam que um povo tão normal como os egípcios antigos pudessem ter feito tão grave erro e desta forma criar tantas dificuldades e delicados problemas para os especialistas modernos\" (Diop, 1974: 45).\nA pretensiosidade eurocentrista nesse episódio se expõe de corpo inteiro. Lembra o exemplo de um típico escritor do \"progressismo\" brasileiro, o racista Monteiro Lobato, quando acusa o negro-africano de haver provocado graves problemas para o Brasil com a miscigenação, a tão celebrada mistura de sangues negro e branco... Mas voltemos aos egiptologistas: eles prosseguiram obstinadamente o vão esforço de provar \"cientificamente\" uma origem branca para a antiga civilização do Egito negro.\nQuanto a Diop, compassivo e humano diante do feroz dogmatismo dos egiptólogos brancos, revelou bastante paciência e gentileza explicando-lhes que não alegava superioridade racial ou qualquer gênio especificamente negro naquela constatação puramente científica de que a civilização do Egito antigo fora erigida por um povo negro. O sucesso, explicou-lhe Diop, resultou de fatores históricos, de condições mesológicas - clima, recursos naturais, e assim por diante - somados a outros elementos não-rácicos. Tanto assim foi que, mesmo tendo-se expandido por toda a África negra, do centro e do oeste do continente, a civilização egípcia, ao embate de outras influências e situação histórica diversa, entrou num processo de desintegração e franco retrocesso. O importante é sabermos alguns dos fatores que contribuíram para a edificação da civilização egípcia, entre os quais Diop enumera estes: resultado de acidente geográfico que condicionou o desenvolvimento político-social dos povos que viviam às margens do vale do Nilo; as inundações que forçavam providências coletivas de defesa e sobrevivência, situação que favorecia a unidade e excluía o egoísmo individual ou pessoal. Nesse contexto surgiu a necessidade de uma autoridade central coordenadora da vida e das atividades em comum. A invenção da geometria nasceu da necessidade da divisão geográfica, e todos os demais avanços foram obtidos no esforço de atender uma carência requerida pela sociedade.\nUm pormenor interessa particularmente à memória do negro brasileiro: aquele onde Diop menciona as relações do antigo Egito com a África negra, de modo específico com os iorubás. Parece que tais relações foram tão íntimas a ponto de se poder \"considerar como um fato histórico a possessão conjunta do mesmo habitat primitivo pelos iorubás e egípcios\". Diop levanta a hipótese de que a latinização de Horus, filhos de Osíris e Ísis, resultou no apelativo Orixá. Seguindo essa pista de estudo comparativo, ao nível da lingüística e outras disciplinas, Diop cita J. Olumide Lucas em The religion of the Yorubas, o qual traça os laços egípcios do seu povo iorubá, concluindo que tudo leva à verificação do seguinte: a) uma similaridade ou identidade de linguagem; b) uma similaridade ou identidade de crenças religiosas; c) uma similaridade ou identidade de idéias e práticas religiosas; d) uma sobrevivência de costumes, lugares, nomes de pessoas, objetos, práticas, e assim por diante (Diop, 1974: 184; Lucas, 1978: 18).\nMeu objetivo aqui é o de apenas chamar a atenção para esta significativa dimensão da antigüidade da memória afro-brasileira. Este é um assunto extenso e complexo, cuja seriedade requer e merece pesquisa e reflexão aprofundadas, no contexto de uma revisão crítica das definições e dos julgamentos pejorativos que há séculos pesam sobre os povos negro-africanos.\n\nConsciência negra e sentimento quilombista\n\nNuma perspectiva mais restrita, a memória do negro brasileiro atinge uma etapa histórica decisiva no período escravocrata que se inicia por volta de 1500, logo após a \"descoberta\" do território e os atos inaugurais dos portugueses tendo em vista a colonização do país. Excetuando os índios, o africano escravizado foi o primeiro e único trabalhador, durante três séculos e meio, a erguer as estruturas deste país chamado Brasil. Creio ser dispensável evocar neste instante o chão que o africano regou com seu suor, lembrar ainda uma vez mais os canaviais, os algodoais, o ouro, o diamante e a prata, os cafezais, e todos os demais elementos da formação brasileira que se nutriram no sangue martirizado do escravo. O negro está longe de ser um arrivista ou um corpo estranho: ele é o próprio corpo e alma deste país. Mas a despeito dessa realidade histórica inegável e incontraditável, os africanos e seus descendentes nunca foram e não são tratados como iguais pelos segmentos minoritários brancos que complementam o quadro democrático nacional. Estes têm mantido a exclusividade do poder, do bem-estar e da renda nacional.\nÉ escandaloso notar que porções significativas da população brasileira de origem européia começaram a chegar ao Brasil nos fins do século passado como imigrantes pobres e necessitados. Imediatamente passaram a desfrutar de privilégios que a sociedade convencional do país lhes concedeu como parceiros de raça e de supremacismo eurocentrista. Tais imigrantes não demonstraram nem escrúpulo e nem dificuldades em assumir os preconceitos raciais contra o negro-africano, vigentes aqui e na Europa, se beneficiando deles e preenchendo as vagas no mercado de trabalho que se negava aos ex-escravos e seus descendentes. Estes foram literalmente expulsos do sistema de trabalho e produção à medida que se aproximava a data \"abolicionista\" de 13 de maio de 1888.\nTendo-se em vista a condição atual do negro à margem do emprego ou degradado no semi-emprego e subemprego; levando-se em conta a segregação residencial que lhe é imposta pelo duplo motivo de condição racial e pobreza, destinando-lhe como áreas de moradias ghettos de várias denominações: favelas, alagados, porões, mocambos, invasões, conjuntos populares ou \"residenciais\"; considerando-se a permanente brutalidade policial e as prisões arbitrárias motivadas pela cor de sua pele, compreende-se por que todo negro consciente não tem a menor esperança de que uma mudança progressista possa ocorrer espontaneamente em benefício da comunidade afro-brasileira. As favelas pululam em todas as grandes cidades: Rio de Janeiro, São Paulo, Salvador, Recife, Brasília, podem se apontadas como exemplos. A cifra dos favelados exprime em si mesma a desgraça crescente no quociente alto que apresenta. Para ilustrar lembro os dados do Departamento de Serviço Social de São Paulo, publicados pelo O Estado de São Paulo de 16 de agosto de 1970, os quais denunciavam que mais de 60% da população paulistana vive em condições precaríssimas; se não esquecermos de que São Paulo é a cidade brasileira melhor servida de instalações de água e esgoto, poderemos fazer uma idéia mais aproximada das impossíveis condições higiênicas em que vegetam os afro-brasileiros por esse país afora. Em Brasília, segundo a revista Veja de 8 de outubro de 1969, entre os 510.000 habitantes da capital federal, 80.000 eram favelados. Enquanto no Rio de Janeiro a porcentagem de favelados oscila entre 40 a 50 por cento da população. Os racistas de qualquer cor, sob a máscara de \"apenas reacionários, dirão que os ghettos existem disfarçados em favelas em várias cidades européias, não sendo um fenômeno tipicamente brasileiro. Certo. A tipicidade está em que a maioria absoluta dos favelados brasileiros, cerca de 95%, são de origem africana. Este detalhe caracteriza uma irrefutável segregação racial de fato. Isto no que concerne à população negra urbana. Entretanto, cumpre ressaltar que a maioria dos descendentes de escravos ainda vegeta nas zonas rurais, escrava de uma existência parasitária, numa situação de desamparo total. Pode-se dizer que não vivem uma vida de seres humanos.\nE como sobrevive o segmento citadino da população afro-brasileira? Constitui uma categoria denominada pelo Anuário Estatístico do Instituto Brasileiro de Geografia e Estatística (IBGE) de \"empregados em serviços\". Uma estranha qualificação ou eufemismo para o subemprego e o semi-emprego, que rotula quase quatro milhões e meio de brasileiros. (Quartim, 1971: 152). Tal eufemismo surpreende porque nessa classificação se incluem os empregados sem ordenado fixo, isto é, biscateiros vivendo a pequena aventura diária de engraxar sapatos, lavar carros, entregar encomendas, transmitir recado, a venda ambulante de doces, frutas ou objetos, tudo à base da remuneração miserável do centavo.\nEste é um retrato imperfeito de uma situação mais grave, a qual tem sido realidade em todo o decorrer de nossa história. Desta realidade é que nasce a necessidade urgente ao negro de defender sua sobrevivência e de assegurar a sua existência de ser. Os quilombos resultaram dessa exigência vital dos africanos escravizados, no esforço de resgatar sua liberdade e dignidade através da fuga ao cativeiro e da organização de uma sociedade livre. A multiplicação dos quilombos fez deles um autêntico movimento amplo e permanente. Aparentemente um acidente esporádico no começo, rapidamente se transformou de uma improvisação de emergência em metódica e constante vivência dos descendentes de africanos que se recusavam à submissão, à exploração e à violência do sistema escravista. O quilombismo se estruturava em formas associativas que tanto podiam estar localizadas no seio de florestas de difícil acesso que facilitava sua defesa e sua organização econômico-social própria, como também assumiram modelos de organizações permitidas ou toleradas, freqüentemente com ostensivas finalidades religiosas (católicas), recreativas, beneficentes, esportivas, culturais ou de auxílio mútuo. Não importam as aparências e os objetivos declarados: fundamentalmente, todas elas preencheram uma importante função social para a comunidade negra, desempenhando um papel relevante na sustentação da comunidade africana. Genuínos focos de resistência física e cultural. Objetivamente, essa rede de associações, irmandades, confrarias, clubes, grêmios, terreiros, centros, tendas, afochés, escolas de samba, gafieiras foram e são os quilombos legalizados pela sociedade dominante; do outro lado da lei se erguem os quilombos revelados que conhecemos. Porém tanto os permitidos quanto os \"ilegais\" foram uma unidade, uma única afirmação humana, étnica e cultural, a um tempo integrando uma prática de libertação e assumindo o comando da própria história. A este complexo de significações, a esta praxis afro-brasileira, eu denomino de quilombismo.\nA constatação fácil do enorme número de organizações que se intitularam no passado e se intitulam no presente de Quilombo e/ou Palmares testemunha o quanto o exemplo quilombista significa como valor dinâmico na estratégia e na tática de sobrevivência e progresso das comunidades de origem africana. Com efeito, o quilombismo tem se revelado fator capaz de mobilizar disciplinadamente o povo afro-brasileiro por causa do profundo apelo psicossocial cujas raízes estão entranhadas na história, na cultura e na vivência dos afro-brasileiros. O Movimento Negro Unificado Contra o Racismo e a Discriminação Racial assim registra seu conceito quilombola ao definir o \"Dia da Consciência Negra\":\n\nNós, negros brasileiros, orgulhosos por descendermos de Zumbi, líder da República Negra dos Palmares, que existiu no Estado de Alagoas, de 1595 a 1695, desafiando o domínio português e até holandês, nos reunimos hoje, após 283 anos, para declarar a todo o povo brasileiro nossa verdadeira e efetiva data: 20 de novembro, Dia Nacional da Consciência Negra! Dia da morte do grande líder negro nacional, Zumbi, responsável pela primeira e única tentativa brasileira de estabelecer uma sociedade democrática, ou seja, livre, e em que todos - negros, índios e brancos - realizaram um grande avanço político, econômico e social. Tentativa esta que sempre esteve presente em todos os quilombos (1978).\n\nA continuidade dessa consciência de luta político-social se estende por todos os Estados onde existe significativa população de origem africana. O modelo quilombista vem atuando como idéia-força, energia que inspira modelos de organização dinâmica desde o século XV. Nessa dinâmica quase sempre heróica, o quilombismo está em constante reatualização, atendendo exigências do tempo histórico e situações do meio geográfico. Circunstância que impôs aos quilombos diferenças em suas formas organizativas. Porém no essencial se igualavam. Foram (e são), nas palavras da historiadora Beatriz Nascimento, \"um local onde a liberdade era praticada, onde os laços étnicos e ancestrais eram revigorados\" (1979: 17). Esta estudiosa mulher negra afirma ter o quilombo exercido \"um papel fundamental na consciência histórica dos negros\" (1979: 18).\nPercebe-se o ideal quilombista difuso, porém consistente, permeando todos os níveis da vida negra e os mais recônditos meandros e/ou refolhos da personalidade afro-brasileira. Um ideal forte e denso que via de regra permanece reprimido pelas estruturas dominantes, outras vezes é sublimado através dos vários mecanismos de defesa fornecidos pelo inconsciente individual ou coletivo. Mas também acontece às vezes o negro se apropriar dos mecanismos que a sociedade dominante concedeu ao seu protagonismo com a maliciosa intenção de controlá-lo. Nessa reversão do alvo, o negro se utiliza dos propósitos não-confessados de domesticação qual boomerang ofensivo. É o exemplo que nos deixou Candeia, compositor de sambas e negro inteligentemente dedicado à redenção do seu povo. Organizou a Escola de Samba Quilombo, nos subúrbios do Rio de Janeiro, com um profundo senso do valor político-social do samba em função do progresso da coletividade negra. Este importante membro da família quilombista faleceu recentemente, mas até o instante derradeiro ele manteve uma lúcida visão dos objetivos da entidade que fundou e presidiu no rumo dos interesses mais legítimos do povo afro-brasileiro. Basta folhear o livro de sua autoria e de Isnard, e ler trechos como este:\n\nQuilombo - Grêmio Recreativo Arte Negra (...) nasceu da necessidade de se preservar toda a influência do afro na cultura brasileira. Pretendemos chamar a atenção do povo brasileiro para as raízes da arte negra brasileira. A posição do \"Quilombo\" é principalmente contrária à importação de produtos culturais prontos e acabados produzidos no exterior (1978: 87-88).\n\nNeste último trecho, os autores tocam num ponto importante do quilombismo: o caráter nacionalista do movimento. Nacionalismo aqui não deve ser traduzido como xenofobismo. Sendo o quilombismo uma luta antiimperialista, se articula ao pan-africanismo e sustenta radical solidariedade com todos os povos em luta contra a exploração, a opressão, o racismo e as desigualdades motivadas por raça, cor, religião ou ideologia.\nNum folheto intitulado 90 anos de abolição, publicado pela Escola de Samba Quilombo, Candeia registra que \"foi através do Quilombo, e não do movimento abolicionista, que se desenvolveu a luta dos negros contra a escravatura\" (1978: 7).\nE o movimento quilombista está longe de haver esgotado seu papel histórico. Está tão vivo hoje quanto no passado, pois a situação das camadas negras continua a mesma, com pequenas alterações de superfície. Candeia prossegue:\n\nOs quilombos eram violentamente reprimidos, não só pela força do governo, mas também por indivíduos interessados no lucro que teriam devolvendo os fugitivos a seus donos. Esses especialistas em caçar escravos fugidos ganharam o nome de triste memória: capitães-do-mato (1978: 5).\n\nA citação dos capitães-do-mato é importante: via de regra eram eles mulatos, isto é, negros de pele clara assimilados pela classe dominante. Em nossos dias ainda podemos encontrar centenas, milhares, desses negros que vivem uma existência ambígua. Não pelo fato de possuírem o sangue do branco opressor, mas porque internalizando como positiva a ideologia do embranquecimento (o branco é o superior e o negro o inferior) se distanciam das realidades do seu povo e se prestam ao papel de auxiliares das forças repressivas do supremacismo branco. E tanto ontem quanto hoje, os serviços que se prestam à repressão se traduzem em lucro social e lucro pecuniário.\nNosso Brasil é tão vasto, ainda tão desconhecido e despovoado que podemos supor, sem grande margem de erro, que existem muitas comunidades negras vivendo isoladas, sem ligação ostensiva com as pequenas cidades e vilas do interior do país. Serão diminutas localidades rurais, desligadas do fluxo principal da vida do país, e mantendo estilos e hábitos de vida africana, ou quase, sob um regime de agricultura coletiva de subsistência ou sobrevivência. Podem até mesmo usar o idioma original trazido da África, estropiado, é bem verdade, porém mesmo assim linguagem africana conservada na espécie de quilombismo em que vivem. Às vezes podem até ganhar notícias extensas nas páginas da imprensa, conforme ocorreu à comunidade do Cafundó, situada nas imediações de Salto de Pirapora, no Estado de São Paulo. Os membros da comunidade herdaram uma fazenda deixada pelo antigo senhor, e não faz muito tempo as terras estavam sendo invadidas por latifúndiários das vizinhanças. Obviamente brancos, esse latifundários, com mentalidade escravocrata, não podem aceitar que um grupo de descendentes africanos possua uma propriedade imobiliária. Este não é um fato único, mas foi aquele que ganhou maior publicidade, mobilizando os negros paulistas em sua defesa. Ao visitar pela primeira vez a cidade de Conceição de Mato Dentro, em Minas Gerais, em 1975, tive oportunidade de me encontrar com um dos moradores de uma comunidade negra daquelas redondezas semelhante a Cafundó. Também herdaram a propriedade, segundo me relatou o dito morador, negro de 104 anos, ágil de inteligência e de pernas. Caminhava quase todos os dias cerca de 10 quilômetros a pé, e assim mantinha o contato do seu povo com a cidadezinha de Mato Dentro.\nO avanço de latifundiários e de especuladores de imóveis nas terras da gente negra está pedindo uma investigação ampla e funda. Este é um fenômeno que ocorre tanto nas zonas rurais como nas cidades. Vale a pena transcrever, a respeito, trechos de uma nota estampada em Veja, seção \"Cidades\", a 10 de dezembro de 1975, página 52:\n\nDesde sua remota aparição em Salvador, há quase dois séculos, os terreiros de candomblé foram sempre fustigados por severas restrições policiais. E, pelo menos nos últimos vinte anos, o cerco movido pela polícia foi sensivelmente fortalecido por um poderoso aliado - a expansão imobiliária, que se estendeu às áreas distantes do centro da cidade onde ressoavam os atabaques. Mais ainda, em nenhum momento a Prefeitura esboçou barricadas legais para proteger esses redutos da cultura afro-brasileira - embora a capital baiana arrecadasse gordas divisas com a exploração do turismo fomentado pela magia dos orixás (...) E nunca se soube da aplicação de sanções para os inescrupulosos proprietários de terrenos vizinhos às casas de culto, que se apossam impunemente de áreas dos terreiros. Foi assim que, em poucos anos, a Sociedade Beneficente São Jorge do Engenho Velho, ou terreiro da Casa Branca, acabou perdendo metade de sua antiga área de 7.500 metros quadrados. Mas infeliz ainda, a Sociedade São Bartolomeu do Engenho Velho da Federação, ou candomblé de Bogum, assiste impotente à veloz redução do terreno sagrado onde se ergue a mítica \"árvore de Azaudonor\" trazida da África há 150 anos e periodicamente agredida por um vizinho que insiste em podar seus galhos mais frondosos.\n\nEis como a sociedade dominante apertou o cerco da destituição, da fome e do genocídio dos descendentes africanos. Até os poucos, as raras exceções que por um milagre conseguiram ultrapassar a fronteira implacável da miséria, ou as instituições religiosas que ocupavam há séculos determinado espaço, se vêem de uma hora para outra invadidos em suas propriedades e usurpados em suas terras!\n\nQuilombismo: um conceito científico histórico-social\n\nPara os africanos escravizados assim como para os seus descendentes \"libertos\", tanto o Estado colonial português quanto o Brasil - colônia, império e república - têm uma única e idêntica significação: um estado de terror organizado contra eles. Um Estado por assim dizer natural em sua iniqüidade fundamental, um Estado naturalmente ilegítimo. Porque tem sido a cristalização político-social dos interesses exclusivos de um segmento elitista, cuja aspiração é atingir o status ário-européia em estética racial, em padrão de cultura e civilização. Este segmento tem sido o maior beneficiário da espoliação que em todos os sentidos tem vitimado o povo afro-brasileiro ao longo da nossa história. Conscientes da extensão e profundidade dos problemas que enfrenta, o negro sabe que sua oposição ao que aí está não se esgota na obtenção de pequenas reivindicações de caráter empregatício ou de direitos civis, no âmbito da dominante sociedade capitalista-burguesa e sua decorrente classe média organizada. O negro já compreendeu que terá de derrotar todas as componentes do sistema ou estrutura vigente, inclusive a sua intelligentsia responsável pela cobertura ideológica da opressão através da teorização \"científica\" seja de sua inferioridade biossocial, da miscigenação sutilmente compulsória ou do mito \"democracia racial\". Essa intelligentsia, aliada a mentores europeus e norte-americanos, fabricou uma \"ciência\" histórica ou humana que ajudou a desumanização dos africanos e seus descendentes para servir os interesses dos opressores eurocentristas. Uma ciência histórica que não serve à história do povo de que trata está negando-se a si mesma. Trata-se de uma presunção cientificista e não de uma ciência histórica verdadeira.\nComo poderiam as ciências humanas, históricas - etnologia, economia, história, antropologia, sociologia, psicologia, e outras - nascidas, cultivadas e definidas para povos e contextos sócio-econômicos diferentes, prestar útil e eficaz colaboração ao conhecimento do negro, sua realidade existencial, seus problemas e aspirações e projetos? Seria a ciência social elaborada na Europa ou nos Estados Unidos tão universal em sua aplicação? Os povos negros conhecem na própria carne a falaciosidade do universalismo e da isenção dessa \"ciência\". Aliás, a idéia de uma ciência histórica pura e universal está ultrapassada. O conhecimento científico que os negros necessitam é aquele que os ajude a formular teoricamente - de forma sistemática e consistente - sua experiência de quase 500 anos de opressão. Haverá erros ou equívocos inevitáveis em nossa busca de racionalidade do nosso sistema de valores, em nosso esforço de autodefinição de nós mesmos e de nosso caminho futuro. Não importa. Durante séculos temos carregado o peso dos crimes e dos erros do eurocentrismo \"científico\", os seus dogmas impostos em nossa carne como marcas ígneas da verdade definitiva. Agora devolvemos ao obstinado segmento \"branco\" da sociedade brasileira as suas mentiras, a sua ideologia de supremacismo europeu, a lavagem cerebral que pretendia tirar a nossa humanidade, a nossa identidade, a nossa dignidade, a nossa liberdade. Proclamando a falência da colonização mental eurocentrista, celebramos o advento da libertação quilombista.\nO negro tragou até à última gota os venenos da submissão imposta pelo escravismo, perpetuada pela estrutura do racismo psicossócio-cultural que mantém atuando até os dias de hoje. Os negros têm como projeto coletivo a ereção de uma sociedade fundada na justiça, na igualdade e no respeito a todos os seres humanos, na liberdade; uma sociedade cuja natureza intrínseca torne impossível a exploração econômica e o racismo. Uma democracia autêntica, fundada pelos destituídos e os deserdados deste país, aos quais não interessa a simples restauração de tipos e formas caducas de instituições políticas, sociais e econômicas as quais serviriam unicamente para procrastinar o advento de nossa emancipação total e definitiva, que somente pode vir com a transformação radical das estruturas vigentes. Cabe mais uma vez insistir: não nos interessa a proposta de uma adaptação aos moldes da sociedade capitalista e de classes. Esta não é a solução que devemos aceitar como se fora mandamento inelutável. Confiamos na idoneidade mental do negro, e acreditamos na reinvenção de nós mesmos e de nossa história. Reinvenção de um caminho afro-brasileiro de vida fundado em sua experiência histórica, na utilização do conhecimento crítico e inventivo de suas instituições golpeadas pelo colonialismo e o racismo. Enfim, reconstruir no presente uma sociedade dirigida ao futuro, mas levando em conta o que ainda for útil e positivo no acervo do passado. Um futuro melhor para o negro tanto exige uma nova realidade em termos de pão, moradia, saúde, trabalho, como requer um outro clima moral e espiritual de respeito às componentes mais sensíveis da personalidade negra expressas em sua religião, cultura, história, costumes e outras formas.\nA segurança de um futuro melhor para a população negra não se inclui nos dispositivos da chamada \"lei de segurança nacional\". Esta é a segurança das elites dominantes, dos seus lucros e compromissos com o capital interno ou estrangeiro, privado ou estatal. A segurança da \"ordem\" econômica, social e política em vigor é aquela associada e inseparável das teorias \"científicas\" e dos parâmetros culturais e ideológicos engendrados pelos opressores e exploradores tradicionais da população afro-brasileira.\nTampouco nos interessa o uso ou a adoção de slogans ou palavras de ordem de um esquerdismo ou democratismo vindos de fora. A revolução negra produz seus historiadores, sociólogos, antropólogos, pensadores, filósofos e cientistas políticos. Tal imperativo se aplica também ao movimento afro-brasileiro.\nUm instrumento conceitual operativo se coloca, pois, na pauta das necessidades imediatas da gente negra brasileira. O qual não deve e não pode ser fruto de uma maquinação cerebral arbitrária, falsa e abstrata. Nem tampouco um elenco de princípios importados, elaborados a partir de contextos e de realidades diferentes. A cristalização dos nossos conceitos, definições ou princípios deve exprimir a vivência de cultura e de praxis da coletividade negra. Incorporar nossa integridade de ser total, em nosso tempo histórico, enriquecendo e aumentando nossa capacidade de luta.\nPrecisamos e devemos codificar nossa experiência por nós mesmos, sistematizá-la, interpretá-la e tirar desse ato todas as lições teóricas e práticas conforme a perspectiva exclusiva dos interesses da população negra e de sua respectiva visão de futuro. Esta se apresenta como a tarefa da atual geração afro-brasileira: edificar a ciência histórico-humanista do quilombismo.\nQuilombo não significa escravo fugido. Quilombo quer dizer reunião fraterna e livre, solidariedade, convivência, comunhão existencial. Repetimos que a sociedade quilombola representa uma etapa no progresso humano e sócio-político em termos de igualitarismo econômico. Os precedentes históricos conhecidos confirmam esta colocação. Como sistema econômico o quilombismo tem sido a adequação ao meio brasileiro do comunitarismo ou ujamaaísmo da tradição africana. Em tal sistema as relações de produção diferem basicamente daquelas prevalecentes na economia espoliativa do trabalho, chamada capitalismo, fundada na razão do lucro a qualquer custo. Compasso e ritmo do quilombismo se conjugam aos mecanismos operativos, articulando os diversos níveis de uma vida coletiva cuja dialética interação propõe e assegura a realização completa do ser humano. Nem propriedade privada da terra, dos meios de produção e de outros elementos da natureza. Todos os fatores e elementos básicos são de propriedade e uso coletivo. Uma sociedade criativa, no seio da qual o trabalho não se define como uma forma de castigo, opressão ou exploração; o trabalho é antes uma forma de libertação humana que o cidadão desfruta como um direito e uma obrigação social. Liberto da exploração e do jugo embrutecedor da produção tecno-capitalista, a desgraça do trabalhador deixará de ser o sustentáculo de uma sociedade burguesa parasitária que se regozija no ócio de seus jogos e futilidades.\nOs quilombolas dos séculos XV, XVI, XVII, XVIII e XIX nos legaram um patrimônio de prática quilombista. Cumpre aos negros atuais manter e ampliar a cultura afro-brasileira de resistência ao genocídio e de afirmação da sua verdade. Um método de análise, compreensão e definição de uma experiência concreta, o quilombismo expressa a ciência do sangue escravo, do suor que este derramou enquanto pés e mãos edificadores da economia deste país. Um futuro de melhor qualidade para a população afro-brasileira só poderá ocorrer pelo esforço enérgico de organização e mobilização coletiva, tanto da população negra como das suas inteligências e capacidades escolarizadas, para a enorme batalha no fronte da criação teórico-científica. Uma teoria científica inextricavelmente fundida à nossa prática histórica que efetivamente contribua à salvação da comunidade negra, a qual vem sendo inexoravelmente exterminado. Seja pela matança direta da fome, seja pela miscigenação compulsória, pela assimilação do negro aos padrões e ideais ilusórios do lucro ocidental. Não permitamos que a derrocada desse mundo racista, individualista e inimigo da felicidade humana afete a existência futura daqueles que efetiva e plenamente nunca a ele pertenceram: nós, negro-africanos e afro-brasileiros.\nCondenada a sobreviver rodeada ou permeada de hostilidade, a sociedade afro-brasileira tem persistido nesses quase 500 anos sob o signo de permanente tensão. Tensão esta que consubstancia a essência e o processo do quilombismo.\nAssegurar a condição humana do povo afro-brasileiro, há tantos séculos tratado e definido de forma humilhante e opressiva, é o fundamento ético do quilombismo. Deve-se assim compreender a subordinação do quilombismo ao conceito que define o ser humano como o seu objeto e sujeito científico, dentro de uma concepção de mundo e de existência na qual a ciência constitui uma entre outras vias do conhecimento.\n\nEstudos sobre o branco\n\nDevemos impedir por todos os meios, nós os descendentes negro-africanos, que a confusão e a falência das bases do chamado mundo ocidental branco derroguem aquilo que há de mais valioso e profundo em nossa natureza, cultura e experiência. Conhecer o inimigo e/ou adversário, desde dentro, significa atuar em autodefesa. Conseqüentemente devemos nos preparar para estudar o branco e seus impulsos agressivos.\nAqui estou reatando uma idéia antiga do escritor Fernando Góes, mais tarde retomada por Guerreiro Ramos. Na mesma direção, também houve constante pregação na militância do saudoso irmão negro Aguinaldo de Oliveira Camargo; no auditório do 1º Congresso do Negro Brasileiro (Rio, 1950), ressoaram estas palavras sábias de Aguinaldo: \"Reeduquemos o branco para que ele aprenda a respeitar a criança negra, a respeitar o doutor negro, a empregada negra, para que aprenda a casar-se com a mulher negra\" apud Nascimento, 1968: 231).\nÉ na mesma linha de raciocínio que se situa mais uma observação de Cheikh Anta Diop; em vários pontos-chaves de sua obra, Diop abordou a questão, referindo-se às idiossincrasias dos branco europeus:\n\nNão há absolutamente dúvidas de que a raça branca, a qual apareceu pela primeira vez durante o Alto Paleolítico - em torno de 20.000 antes de Cristo - , era o produto de um processo de despigmentação. (...) não há dúvida de que o panorama cultural desses protobrancos era eventualmente condicionado durante a época glacial pelas condições extremamente duras do seu \"berço nórdico\", até o momento de seus movimentos migratórios rumo às regiões meridionais, em torno de 1.500 anos antes de Cristo. Moldados por seu berço ambiental, aqueles primeiros nômades brancos desenvolveram, sem dúvida, uma consciência social típica do ambiente hostil ao qual estiveram confinados por um longo período. A xenofobia se fixou como um dos traços de sua consciência social. A hierarquização patriarcal outra. (...) Penso que a Dra. Welsing identificou corretamente a origem do racismo num definitivo reflexo defensivo. Creio que o racismo seja uma reação de medo, mais freqüentemente inconfesso que não. (Diop, 1986: 34).\n\nAssim, a origem da sócio-psicopatologia do branco não se radica em sua natureza biológica. Ao contrário, trata-se de um fenômeno de caráter histórico: os brancos tinham medo porque, na época dessas migrações, se sentiam inferiores em número e em avanço cultural diante das civilizações meridionais negras, sedentárias e agrícolas. Sua válvula de segurança consistiu na ereção e no desenvolvimento da teoria do supremacismo branco.\nTive a oportunidade de formalizar a sugestão de Fernando Góes e Guerreiro Ramos quando propus em um seminário que estava ministrando na Universidade de Ifé que os africanos deveriam promover um Congresso Internacional para estudar os brancos da Europa e seu prolongamento arianóide no Brasil. A ciência negro-africana examinaria o fenômeno mental e psiquiátrico que motivou os europeus a escravizarem outros seres humanos, seus irmãos, com uma brutalidade sádica sem precedentes na história dos homens. Escrutinaria, a ciência negra, em suas origens psiconeurológicas e psicocriminológicas, a necessidade emocional que leva o branco a tentar justificar seus atos de assassínio, tortura, pilhagem, roubo e estupro com fantasias absurdas denominadas, por exemplo, de \"carga do homem branco\", \"destino manifesto\", \"civilizar os selvagens\", \"cristianizar os pagãos\", \"filantropia\", \"imperativo econômico\", \"miscigenação\", \"democracia racial\", \"assimilação\" e outras metáforas que não conseguem ocultar os sintomas que denunciam uma mórbida compulsão cultivada por uma civilização de fundamentos decididamente patológicos. Anotaria a ciência negra as dimensões e o peso da massa encefálica bem como a forma craniana dos brancos para averiguar qual a motivação que os conduz a roubar os tesouros artísticos de outros povos e depois, arrogante e obstinadamente, recusar a devolvê-los, mesmo em se tratando de uma celebração cultural e artística daqueles povos, conforme exemplifica a atitude do governo britânico se negando a ceder à Nigéria uma máscara-símbolo do Festac 1977, e mantendo-a trancada em seu museu de Londres. Trata-se, evidentemente, de uma peça de alto valor artístico e histórico, criada pelos nossos antepassados nigerianos.\nDe um ponto de vista psiquiátrico, se analisariam as atitudes formais, mecânicas, destituídas de emoção que os europeus e seus imitadores demonstram durante seus cultos religiosos. Este comportamento, sob uma perspectiva antropológica e psicológica, denuncia uma profunda ausência de identidade e vinculação com os seus deuses, além de uma carência de contato espiritual mais íntimo. Estudaria ainda, a partir de uma visão sociológica e etnológica, a natureza singularmente desumanizada e mecânica da sociedade euro-norte-americana, cuja última façanha, frio resultado de sua \"objetividade\", é a invenção de armas destrutivas capazes de obliterar toda a raça humana. Investigaria as origens da avareza mórbida que a leva a envenenar o seu próprio suprimento alimentar e o do resto do mundo com químicas, tinturas e preservativos, numa patética \"eficiência\" em busca de mais lucros. E nessa diabólica manipulação gananciosa, a destruir de forma insensível milhões de toneladas de alimentos, ou sacrificar no altar do desperdício farto outros milhões de cabeças de gado anualmente. Não são os povos da África, das Américas ou da Ásia os autores de tais absurdos. Estes alimentariam os seus filhos com aqueles produtos se isso lhes fosse possível.\nUm estudo desse porte teria de considerar cuidadosamente os mecanismos inconscientes, conscientes, e outros, que induziram os europeus a se apropriarem de todo o patrimônio da civilização negro-africana do Egito antigo, e, utilizando-se da falsificação acadêmica, tentar erradicar a identidade do povo egípcio daquela época, para em seguida negar ao Egito negro as ciências, as artes, a filosofia, a religião que ele criou, atribuindo à Grécia o seu patrimônio de saber.\nÉ imperativo compreender e reconhecer que a experiência histórica dos africanos na diáspora tem sido uma experiência de conteúdo essencialmente racista, que transcende certas simplificações segundo as quais a escravidão e as subseqüentes formas de opressão racista dos povos negros são apenas subprodutos do capitalismo. Assim, a escravização dos africanos e a desumanização dos seus descendentes nas Américas teriam ocorrido e estariam ocorrendo como um determinismo inarredável do processo econômico da humanidade, o qual teria engendrado a escravidão à base da \"necessidade\" do sistema de produção. Falam de sistema demonstrando uma devoção beata a algo supostamente sublime, etéreo e intangível. A \"necessidade\" dos europeus teria caído sobre nossas cabeças e nossos destinos qual desígnio irrecorrível de Deus ou das potências cósmicas. Não menciona, tal racionalização, que o sistema só tem existência porque está incorporado em seres humanos com as suas motivações, aspirações, interesses e projetos. Sob a perspectiva humana da sociedade ocidental, têm sido o racismo e seus derivados - o chauvinismo cultural, o preconceito e a discriminação racial e de cor - os elementos operativos no dilema existencial dos povos negros.\nEm nosso país, os interesses econômicos, a ambição, o orgulho, o medo, a arrogância se complementam e desempenham a parte respectiva que lhes cabe no sentido de complicar ainda mais a teia que emaranha e obscurece a realidade do racismo vigente. Uma pergunta então é necessária: seria o racismo apenas um orgulho do branco que se expressa nessa qualidade de sentimento racial de desdém e menosprezo para com o negro, sentimento que às vezes toma a forma abstrata do preconceito, outras vezes atua objetiva e concretamente na forma de discriminação de caráter racial? Estas são na verdade expressões ou partes do racismo. Este, contudo, é mais abrangente: o racismo do tipo praticado entre nós é a imposição de uma minoria de origem branco-européia sobre uma maioria negra de origem africana. Para atingir seus intentos, essa minoria adota as mais variadas estratégias, as quais incluem desde os instrumentos mais óbvios aos mais sofisticados e despistadores. Tanto se faz uso da violência policial direta e brutal, quanto da violência ideológica sutil, ou da violência econômica, que é uma forma de genocídio físico e espiritual. Todas as formas imagináveis de coação se praticaram e se praticam, inclusive a violência religiosa, no afã de assegurar a imposição do etnocentrismo ocidental sobre os afro-brasileiros. A elaboração da chamada \"democracia racial\" obedeceu à intenção de disfarçar os privilégios do segmento minoritário, detentor exclusivo da renda do país e do poder político nacional. Fique registrado que muitos brancos íntegros são ofuscados pela maligna fosforescência da \"democracia racial\" e se comportam diante da população negra da maneira tradicional do racista brasileiro: com postura paternalista.\n\nABC do quilombismo\n\nNa trajetória histórica que esquematizamos nestas páginas, o quilombismo tem nos fornecido várias lições. Tentaremos resumi-las num ABC fundamental que nos ensina que:\n\na) Autoritarismo de quase 500 anos já é bastante. Não podemos, não\ndevemos e não queremos tolerá-lo por mais tempo. Sabemos de experiência própria que uma das práticas desse autoritarismo é o desrespeito brutal da polícia às famílias negras. Toda a sorte de arbitrariedade policial se acha fixada nas batidas que ela faz rotineiramente para manter aterrorizada e desmoralizada a comunidade afro-brasileira. Assim fica confirmada, diante dos olhos dos próprios negros, sua condição de impotência e inferioridade, já que são incapazes até mesmo de se autodefenderem ou de proteger sua família e os membros de sua respectiva comunidade. Trata-se de um estado de humilhação permanente.\n\nb) Banto denomina-se um povo ao qual pertenceram os primeiros\nafricanos escravizados que vieram para o Brasil de países que hoje se chamam Angola, Congo, Zaire, Moçambique e outros. Foram os bantos os primeiros quilombolas a enfrentar em terras brasileiras o poder militar do branco escravizador.\n\nc) Cuidar em organizar a nossa luta por nós mesmos é um imperativo\nda nossa sobrevivência como um povo. Devemos por isso ter muito cuidado ao fazer alianças com outras forças políticas, sejam as ditas revolucionárias, reformistas, radicais, progressistas ou liberais. Toda e qualquer aliança deve obedecer a um interesse tático ou estratégico, e o negro precisa obrigatoriamente ter poder de decisão, a fim de não permitir que a comunidade negra seja manipulada por interesses de causas alheias à sua própria.\n\nd) Devemos ampliar sempre a nossa frente de luta, tendo em vista: 1)\nos objetivos mais distantes da transformação radical das estruturas sócio-econômicas e culturais da sociedade brasileira; 2) os interesses táticos imediatos. Nestes últimos se inclui o voto do analfabeto e a anistia aos prisioneiros políticos negros. Os prisioneiros políticos negros são aqueles que são maliciosamente fichados pela polícia como desocupados, vadios, malandros, marginais, e cujos lares são freqüentemente invadidos.\n\ne) Ewe ou gêge, povo africano de Gana, Togo e Daomé (Benin); milhões de ewes foram escravizados no Brasil. Eles são parte do nosso povo e da nossa cultura afro-brasileira.\n\nEjetar o supremacismo branco do nosso meio é um dever de todo democrata. Devemos ter sempre presente que o racismo, isto é, supremacismo branco, preconceito de cor e discriminação racial, compõem o fator raça, a primeira contradição para a população de origem africana na sociedade brasileira. (Aviso aos intrigantes, aos maliciosos, aos apressados em julgar: o vocábulo raça, no sentido aqui empregado, se define somente em termos de história e cultura, e não em pureza biológica).\n\nf) Formar os quadros do quilombismo é tão importante quanto a mobilização e a organização da comunidade negra.\n\ng) Garantir ao povo trabalhador negro o seu lugar na hierarquia de Poder e Decisão, mantendo a sua integridade etno-cultural, é a motivação básica do quilombismo.\n\nh) Humilhados que fomos e somos todos os negro-africanos, com todos devemos manter íntimo contato. Também com organizações africanas independentes, tanto da diáspora como do continente. São importantes e necessárias as relações com órgãos e instituições internacionais de Direitos Humanos, tais como a ONU e a UNESCO, de onde poderemos receber apoio em casos de repressão. Nunca esquecer que sempre estivemos sob a violência da oligarquia latifundiária, industrial-financeira ou militar.\n\ni) Infalível como um fenômeno da natureza será a perseguição do poder branco ao quilombismo. Está na lógica inflexível do racismo brasileiro jamais permitir qualquer movimento libertário dos negros majoritários. Nossa existência física é uma realidade que jamais pôde ser obliterada, nem mesmo pelo Instituto Brasileiro de Geografia e Estatística (IBGE) ao manipular os dados censitários, nos quais erradicou o fator racial e de cor dos cômputos demográficos. E quanto a nosso peso político? Simplesmente não existe. Desde a proclamação da República, a exclusão do voto ao analfabeto significa na prática a exclusão da população negra do processo político do país.\n\nj) Jamais as organizações políticas dos afro-brasileiros deverão permitir o acesso aos brancos não-quilombistas a posições com autoridade para obstruir a ação ou influenciar as tomadas de posição teóricas e práticas em face da luta.\n\nk) Kimbundo, língua do povo banto, veio para o Brasil com os escravos procedentes da África meridional. Essa língua exerceu notável influência sobre o português falado neste país.\n\nl) Livrar o Brasil da industrialização artificial, tipo \"milagre econômico\", está nas metas do quilombismo. Neste esquema de industrialização, o negro é explorado a um tempo pelo capitalista industrial e pela classe trabalhadora classificada ou \"qualificada\". Como trabalhador \"desqualificado\" ou sem classe, ele é duplamente vítima: da raça (branca) e da classe (trabalhadora \"qualificada\" e/ou burguesia de qualquer raça). O quilombismo advoga para o Brasil um conhecimento científico e técnico que possibilite a genuína industrialização que represente um novo avanço de autonomia nacional. O quilombismo não aceita que se entregue a nossa reserva mineral e a nossa economia às corporações monopolistas internacionais, porém tampouco defende os interesses de uma burguesia nacional. O negro-africano foi o primeiro e o principal artífice da formação econômica do País e a riqueza nacional pertence a ele e a todo o povo brasileiro que a produz.\n\nm) Mancha branca é o que significa a imposição miscigenadora do branco, implícita na ideologia do branqueamento, na política imigratória, no mito da \"democracia racial\". Tudo não passa de racionalização do supremacismo branco e do estupro histórico e atual que se pratica contra a mulher negra.\n\nn) Nada de mais confusões: se no Brasil efetivamente houvesse igualdade de tratamento, de oportunidades, de respeito, de poder político e econômico; se o encontro entre pessoas de raças diferentes ocorresse espontâneo e livre da pressão do poder e prestígio sócio-econômico do branco; se não houvesse outros condicionamentos repressivos de caráter moral, estético e cultural, a miscigenação seria um acontecimento positivo, capaz de enriquecer o brasileiro, a sociedade, a cultura e a humanidade das pessoas.\n\no) Obstar o ensinamento e a prática genocidas do supremacismo branco é um fator substantivo do quilombismo.\n\np) Poder quilombista quer dizer: a Raça Negra no Poder. Os descendentes de africanos somam a maioria da nossa população. Portanto, o Poder Negro será um poder democrático. (Reitero aqui a advertência aos intrigantes, aos maliciosos, aos ignorantes, aos racistas: neste livro a palavra raça tem exclusiva acepção histórico-cultural. Raça biologicamente pura não existe e nunca existiu).\n\nq) Quebrar a eficácia de certos slogans que atravessam a nossa ação contra o racismo, como aquele da luta única de todos os trabalhadores, de todo o povo ou de todos os oprimidos, é um dever do quilombista. Os privilégios raciais do branco em detrimento do negro constituem uma ideologia que vem desde o mundo antigo. A pregação da luta \"única\" ou \"unida\" não passa de outra face do desprezo que nos votam, já que não respeitam a nossa identidade e nem a especificidade do nosso problema e do nosso esforço em resolvê-lo.\n\nr) Raça: acreditamos que todos os seres humanos pertencem à mesma espécie. Para o quilombismo, raça significa um grupo humano que possui, relativamente, idênticas características somáticas, resultantes de um complexo de fatores históricos e ambientais. Tanto a aparência física, como igualmente os traços psicológicos, de personalidade, de caráter e emotividade, sofrem a influência daquele complexo de fatores onde se somam e se complementam a genética, a sociedade, a cultura, o meio geográfico, a história. O cruzamento de diferentes grupos raciais, ou de pessoas de identidade racial diversas, está na linha dos mais legítimos interesses de sobrevivência da espécie humana.\nRacismo: é a crença na inerente superioridade de uma raça sobre outra. Tal superioridade é concebida tanto no aspecto biológico, como na dimensão psico-sócio-cultural. Esta é a dimensão usualmente negligenciada ou omitida nas definições tradicionais do racismo. A elaboração teórico-científica produzida pela cultura branco-européia justificando a escravização e a inferiorização dos povos africanos constitui o exemplo eminente do racismo sem precedentes na história da humanidade.\nRacismo é a primeira contradição social no caminho do negro. A esta se juntam outras, como a contradição de classes e de sexo.\n\ns) Swahili é uma língua de origem banta, influenciada por outros idiomas, especialmente o árabe. Atualmente, o swahili é falado por mais de 20 milhões de africanos da Tanzânia, do Quênia, de Uganda, do Burundi, do Zaire, e de outros países. Os afro-brasileiros necessitam aprendê-la com urgência.\nSlogan do poder público e da sociedade dominante, no Brasil, condenando reiterada e indignadamente o racismo, se tornou um recurso eficaz encobrindo a operação racista e discriminatória sistemática, de um lado, e de outro lado servindo como uma arma apontada contra nós com a finalidade de atemorizar-nos, amortecendo ou impedindo que um movimento coeso do povo afro-brasileiro obtenha a sua total libertação.\n\nt) Todo negro ou mulato (afro-brasileiro) que aceita a \"democracia racial\" como uma realidade, e a miscigenação na forma vigente como positiva, está traindo a si mesmo, e se considerando um ser inferior.\n\nu) Unanimidade é algo impossível no campo social e político. Não devemos perder o nosso tempo e a nossa energia com as críticas vindas de fora do movimento quilombista. Temos de nos preocupar e criticar a nós próprios e às nossas organizações, no sentido de ampliar a nossa consciência negra e quilombista rumo ao objetivo final: a ascensão do povo afro-brasileiro ao Poder.\n\nv) Vênia é o que não precisamos pedir às classes dominantes para reconquistarmos os frutos do trabalho realizado pelos nossos ancestrais africanos no Brasil. Nem devemos aceitar ou assumir certas definições, \"científicas\" ou não, que pretendem situar o comunalismo africano e o ujamaaísmo como simples formas arcaicas de organização econômica e/ou social. Esta é outra arrogância de fundo eurocentrista que implicitamente nega às instituições nascidas na realidade histórica da África a capacidade intrínseca de desenvolvimento autônomo relativo. Nega a tais instituições a possibilidade de progresso e atualização, admitindo que a ocupação colonizadora do Continente Africano pelos europeus determinasse o concomitante desaparecimento dos valores, princípios e instituições africanas. Estas corporificariam formas não-dinâmicas, exclusivamente quietistas e imobilizadas. Tal visão petrificada da África e de suas culturas é uma ficção puramente cerebral. O quilombismo pretende resgatar dessa definição negativista o sentido de organização sócio-econômica concebido para servir à existência humana; organização que existiu na África e que os africanos escravizados trouxeram e praticaram no Brasil. A sociedade brasileira contemporânea pode se beneficiar com o projeto do quilombismo, uma alternativa nacional que se oferece em substituição ao sistema desumano do capitalismo.\n\nx) Xingar não basta. Precisamos é de mobilização e de organização da gente negra, e de uma luta enérgica, sem pausa e sem descanso, contra as destituições que nos atingem. Até que ponto vamos assistir impotentes à cruel exterminação dos nossos irmãos e irmãs afro-brasileiros, principalmente das crianças negras deste país?\n\ny) Yorubás (Nagô) somos também em nossa africanidade brasileira. Os iorubás são parte integrante do nosso povo, da nossa cultura, da nossa religião, da nossa luta e do nosso futuro.\n\nz) Zumbi: fundador do quilombismo.\n\n\nPropostas de ação para o Governo Brasileiro\n\nO programa de ação quilombista incorpora, devidamente atualizadas, as seguintes propostas apresentadas por este autor ao Colóquio do 2º Festival Mundial de Artes e Culturas Negras e Africanas (Festac), realizado em Lagos, Nigéria, em 1977 (Nascimento, 1978, 2002). Naquela ocasião, o autor propôs ao Colóquio recomendar que o Governo Brasileiro\n\n1) permita e estimule a livre e aberta discussão dos problemas dos descendentes de africanos no país; e que encoraje e financie pesquisas sobre a posição econômica, social e cultural ocupada pelos afro-brasileiros dentro da sociedade brasileira, em todos os níveis;\n2) localize e publique documentos e outros fatos e informações possivelmente existentes em arquivos privados, cartórios, arquivos de câmara municipal de velhas cidades do interior, referentes ao tráfico negreiro, à escravidão e à abolição; em resumo, qualquer dado que possa ajudar a esclarecer e aprofundar a compreensão da experiência do africano escravizado e de seus descendentes;\n3) inclua quesitos sobre raça ou etnia em todos os futuros censos demográficos; que em toda informação que dito governo divulgue, tanto para consumo doméstico como internacional a respeito da composição demográfica do país, não se omita o aspecto da origem racial / étnica;\n4) inclua um ativo e compulsório currículo sobre a história e as culturas dos povos africanos, tanto aqueles do continente como os da diáspora; tal currículo deve abranger todos os níveis do sistema educativo: elementar, médio e superior;\n5) tome medidas ativas para promover o ensino e o uso prático de línguas africanas, especialmente as línguas ki-swahili e iorubá; o mesmo em relação aos sistemas religiosos africanos e seus fundamentos artísticos; que o dito governo promova válidos programas de intercâmbio cultural com as nações africanas;\n6) estude e formule compensações aos afro-brasileiros pelos séculos de escravização criminosa e decênios de discriminação racial depois da abolição; para esse fim deverá drenar recursos financeiros e outros, compulsoriamente originados da Agricultura, do Comércio e da Indústria, setores que historicamente têm sido beneficiados com a exploração do povo negro. Tais recursos constituirão um fundo destinado à construção de moradias, que satisfaçam às exigências da condição humana, em substituição às atuais habitações segregadas onde vive a maioria dos afro-brasileiros: favelas, cortiços, mocambos, porões, cabeças-de-porco, e assim por diante. O fundo sustentaria também a distribuição de terras no interior do país para os negros engajados na produção agropecuária;\n7) remova os objetos da arte afro-brasileira assim como os de sentido ritual encontrados hoje em instituições de polícia, de psiquiatria, história e etnografia; e que o dito governo estabeleça museus de arte com finalidade dinâmica e pedagógica de valorização e respeito devidos à cultura afro-brasileira; de preferência, tais museus se localizariam nos estados com significativa população negra, tais como Bahia, Maranhão, Pernambuco, Alagoas, Minas Gerais, Rio de Janeiro, São Paulo, Sergipe, Rio Grande do Sul;\n8) conceda efetivo apoio, material e financeiro, à existentes e futuras associações afro-brasileiras com finalidade de pesquisa, informação e divulgação nos setores de educação, arte, cultura e posição sócio-econômica da população afro-brasileira.\n9) tome medidas rigorosas e apropriadas ao efetivo cumprimento da lei Afonso Arinos, fazendo cessar o papel burlesco que tem desempenhado até agora;\n10) tome ativas providências, ajuste as realidades do país, para que de nenhuma forma se permita ou possibilite a discriminação racial ou de cor no emprego, garantindo a igualdade de oportunidade que atualmente inexiste entre brancos, negros e outras nuanças étnicas.\n11) exerça seu poder através de uma justa política de redistribuição da renda, tornando impraticável que, por causa da profunda desigualdade econômica imperante, o afro-brasileiro seja discriminado, embora sutil e indiretamente, em qualquer nível do sistema educativo, seja o elementar, o médio ou o universitário.\n12) estimule ativamente o ingresso de negros no Instituto Rio Branco, órgão de formação de diplomatas pertencente ao Ministério de Relações Exteriores.\n13) nomeie negros para o cargo de embaixador e diplomata para as Nações Unidas e junto aos Governos de outros países do mundo.\n14) estimule a formação de negros como oficiais superiores das Forças Armadas (Exército, Marinha e Aeronáutica) com promoções no serviço ativo até os postos de general, almirante, brigadeiro e marechal.\n15) nomeie negros para os altos escalões do Governo Federal em seus vários ministérios e outras repartições do Executivo, incluindo órgãos superiores como o Conselho Federal de Cultura, o Conselho Federal de Educação, o Conselho de Segurança Nacional, o Tribunal de Contas.\n16) estimule e encoraja a formação e o desenvolvimento de uma liderança política negra, representando os interesses específicos da população afro-brasileira no Senado Federal, na Câmara dos Deputados, nas Assembléias Legislativas Estaduais e nas Câmaras Municipais; que o dito Governo nomeie negros para os cargos de juizes estaduais e federais, inclusive para o Supremo Tribunal Federal, Superior Tribunal Eleitoral, Superior Tribunal Militar, Superior Tribunal do Trabalho e o Tribunal Federal de Recursos.\n17) concretize sua tão proclamada \"amizade\" com a África independente e sua tão freqüentemente manifestada posição anticolonialista, dando efetivo apoio diplomático e material aos legítimos movimentos de libertação nacional de Zimbabwe, Namíbia e África do Sul.\n\nAlguns princípios e propósitos do quilombismo\n\n1. O Quilombismo é um movimento político dos negros brasileiros, objetivando a implantação de um Estado Nacional Quilombista, inspirado no modelo da República dos Palmares, no século XVI, e em outros quilombos que existiram e existem no País.\n\n2. O Estado Nacional Quilombista tem sua base numa sociedade livre, justa, igualitária e soberana. O igualitarismo democrática quilombista é compreendido no tocante a sexo, sociedade, religião, política, justiça, educação, cultura, condição racial, situação econômica, enfim, todas as expressões da vida em sociedade. O mesmo igualitarismo se aplica a todos os níveis do Poder e de instituições públicas e privadas.\n\n3. A finalidade básica do Estado Nacional Quilombista é a de promover a felicidade do ser humano. Para atingir sua finalidade, o quilombismo acredita numa economia de base comunitário-cooperativista no setor da produção, da distribuição e da divisão dos resultados do trabalho coletivo.\n\n4. O quilombismo considera a terra uma propriedade nacional de uso coletivo. As fábricas e outras instalações industriais, assim como todos os bens e instrumentos de produção, da mesma forma que a terra, são de propriedade e uso coletivo da sociedade. Os trabalhadores rurais ou camponeses trabalham a terra e são eles próprios os dirigentes das instituições agropecuárias. Os operários da indústria e os trabalhadores de modo geral são os produtores dos objetos industriais e os únicos responsáveis pela orientação e gerência de suas respectivas unidades de produção.\n\n5. No quilombismo o trabalho é um direito e uma obrigação social, e os trabalhadores, que criam a riqueza agrícola e industrial da sociedade quilombista, são os únicos donos do produto do seu trabalho.\n\n6. A criança negra tem sido a vítima predileta e indefesa da miséria material e moral imposta à comunidade afro-brasileira. Por isso, ela constitui a preocupação urgente e prioritária do quilombismo. Atendimento pré-natal, amparo à maternidade, creches, alimentação adequada, moradia higiênica e humana, são alguns dos itens relacionados à criança negra que figuram no programa de ação do movimento quilombista.\n\n7. A educação e o ensino em todos os graus - elementar, médio e superior - serão completamente gratuitos e abertos sem distinção a todos os membros da sociedade quilombista. A história da África, das culturas, das civilizações e das artes africanas terão um lugar eminente nos currículos escolares. Criar uma Universidade Afro-Brasileira é uma necessidade dentro do programa quilombista.\n\n8. Visando o quilombismo a fundação de uma sociedade criativa, ele procurará estimular todas as potencialidades do ser humano e sua plena realização. Combater o embrutecimento causado pelo hábito, pela miséria, pela mecanização da existência e pela burocratização das relações humanas e sociais, é um ponto fundamental. As artes em geral ocuparão um espaço básico no sistema educativo e no contexto das atividades sociais.\n\n9. No quilombismo não haverá religiões e religiões populares, isto é, religião da elite e religiões do povo. Todas as religiões merecem igual tratamento de respeito e de garantias de culto.\n\n10. O Estado quilombista proíbe a existência de um aparato burocrático estatal que perturbe ou interfira com a mobilidade vertical das classes trabalhadoras e marginalizadas em relação direta com os dirigentes. Na relação dialética dos membros da sociedade com as suas instituições repousa o sentido progressista e dinâmico do quilombismo.\n\n11. A revolução quilombista é fundamentalmente anti-racista, anticapitalista, antilatifundiária, antiimperialista e antineocolonialista.\n\n12. Em todos os órgãos do Poder do Estado Quilombista - Legislativo, Executivo e Judiciário - a metade dos cargos de confiança, dos cargos eletivos, ou dos cargos por nomeação, deverão, por imperativo constitucional, ser ocupados por mulheres. O mesmo se aplica a todo e qualquer setor ou instituição de serviço público.\n\n13. O quilombismo considera a transformação das relações de produção, e da sociedade de modo geral, por meios não-violentos e democráticos, uma via possível.\n\n14. É matéria urgente para o quilombismo a organização de uma instituição econômico-financeira em moldes cooperativos, capaz de assegurar a manutenção e a expansão da luta quilombista a salvo das interferências controladoras do paternalismo ou das pressões do Poder econômico.\n\n15. O quilombismo essencialmente é um defensor da existência humana e, como tal, ele se coloca contra a poluição ecológica e favorece todas as formas de melhoramento ambiental que possam assegurar uma vida saudável para as crianças, as mulheres e os homens, os animais, as criaturas do mar, as plantas, as selvas, as pedras e todas as manifestações da natureza.\n\n16. O Brasil é signatário da Convenção Internacional para a Eliminação de Todas as Formas de Discriminação Racial, adotada pela Assembléia Geral das Nações Unidas em 1965. No sentido de cooperar para a concretização de objetivos tão elevados e generosos, e tendo em vista o artigo 9, números 1 e 2 da referida Convenção, o quilombismo contribuirá para a pesquisa e a elaboração de um relatório ou dossiê bianual, abrangendo todos os fatos relativos à discriminação racial ocorridos no País, a fim de auxiliar os trabalhos do Comitê para a Eliminação da Discriminação Racial das Nações Unidas.\n\n\nSemana da memória afro-brasileira\n\nEsta Semana está sendo proposta pela necessidade do negro de recuperar a sua memória. Durante esta Semana serão focalizados e iluminados os sucessos passados nos quais foram protagonistas aqueles 300 milhões de africanos retirados, sob violência, de suas terras e trazidos acorrentados para o continente americano. Através de celebrações anuais, a comunidade negra não só honrará os antepassados, como reforçará a sua coesão e identidade. E transmitirá às novas gerações um exemplo de amor à história do nosso povo, auxiliando-as a ter uma visão mais clara e verdadeira do papel fundamental cumprido pelos escravos africanos na construção deste País. Isto só infundirá aos jovens de agora e do futuro um orgulho em lugar da vergonha que a sociedade dominante tem procurado infiltrar na consciência dos negros, como se fosse a única herança deixada por seus ancestrais.\nA Semana deve aliar aos aspectos comemorativos uma constante pesquisa, crítica e reflexão sobre o passado e o presente das condições de vida da população de origem africana no Brasil. Isto contribuirá para ampliar e fortalecer o quilombismo sem sua filosofia, teoria e prática de libertação. A Semana implica também um estímulo às organizações negras existentes, sem discriminar nenhuma delas por causa dos seus objetivos declarados. Tanto aquelas que perseguem finalidades recreativas ou beneficentes, como as outras de sentido cultural, social ou político, se encontram todas interessadas no destino e na melhoria da situação da família afro-brasileira. Portanto, se inserem na mesma perspectiva quilombista ampla que estamos tentando sistematizar.\nBasicamente, esta \"Semana da Memória\" está sendo concebida como uma ferramenta operativa no campo da ação (mobilização e organização), combinada ao setor da especulação, da teoria, da formulação de princípios, das análises, definições e outras ponderações. Enfim, a Semana deve ser um exercício de emancipação e nunca uma comemoração convencional, estática e retórica, que proponha unicamente a evocação de fatos, datas e nomes do passado. Estudar e lembrar os feitos dos antepassados deve constituir um acontecimento inspirador que estimule a ação transformadora do presente. Rumo ao futuro, ou seja, o oposto da contemplação saudosista, autoglorificadora do pretérito, ou da motivação de cenas de autoflagelação.\nResgatar nossa memória significa resgatarmos a nós mesmos do esquecimento, do nada e da negação, e reafirmarmos a nossa presença ativa na história pan-africana e na realidade universal do seres humanos.\nComo norma de procedimento, a Semana deve ser promovida, de preferência, por organizações afro-brasileiras. Entretanto, poderá também ser realizada por escolas públicas ou privadas que atualmente se interessem pelo progresso cívico da comunidade afro-brasileira. Neste caso, como de modo geral tais escolas não são dirigidas por homem negro ou mulher negra, os afro-brasileiros presentes devem estar alertas a fim de impedir que os fatos históricos e os eventos da vida negro-africana sejam manipulados ou distorcidos, seja por malícia, ignorância ou negligência. As famílias negras, onde não existir organização afro-brasileira ou escola pública ou privada interessada na vida negra, devem preencher o papel de realizadores da Semana. Reiteramos que uma Semana da Memória jamais deve esvaziar o seu conteúdo intrínseco de valores negro-africanos de história, cultura, artes, seccionando-o do contexto sócio-político e econômico onde os povos de origem africana se movimentaram, produziram, lutaram e fizeram a história que até o presente não figura, em toda a sua extensão e importância, na História convencional ou oficial do Brasil.\nA proposta que ofereço à consideração dos meus irmãos e irmãs negros de \"Semana da Memória\" tem seu encerramento a 20 de novembro de cada ano, aniversário da morte de Zumbi e Dia Nacional da Consciência Negra instituído pelo movimento negro brasileiro a partir de proposta oriunda do Rio Grande do Sul. Assim, a Semana principia a 14 de novembro e obedecerá ao seguinte calendário:\n\nDia 14 (1º dia): África: suas civilizações na antigüidade, o Egito, a Etiópia, o Sudão. Os impérios mais recentes: Songai, Asante, Iorubá, e outros. Nesta celebração se incluem referências às formas de organização africana da família (matriarcado), sociedade, economia e do Estado. As artes, as ciências, a tecnologia: as pirâmides egípcias, a matemática, a engenharia, a medicina, as pinturas rupestres e as construções urbanas em Zimbábue, as esculturas de Nok, Ifé, Benin, e assim por diante.\n\nDia 15 (2º dia): As primeiras incursões portuguesas no território africano no século XIV. Logo depois, a invasão colonial da África por Portugal, Espanha, França, Inglaterra, Holanda, Bélgica, Itália, Alemanha. A escravização dos africanos: as técnicas de captura utilizadas pelos bandidos europeus. As longas caminhadas através das florestas até à costa atlântica. A enorme taxa de mortalidade durante o trajeto. Os barracões e depósitos na costa. O batismo compulsório.\n\nDia 16 (3º dia): O embarque dos africanos nos tumbeiros: os horrores a bordo: fome, sede, epidemias, imobilidade do corpo, falta de ar; a alta taxa de mortalidade; os africanos atirados vivos ao mar; outras formas de suplício e assassínio. Os portos brasileiros de desembarque.\n\nDia 17 (4º dia): Os mercados de escravos; maneira como as \"peças\" eram oferecidas ao público comprador, e os brancos examinavam os africanos como se fossem animais. As vendas e as compras atendendo os pontos focais de concentração econômica: produção do açúcar, do algodão, da mineração, do café, do cacau, do gado, do fumo, e assim por diante.\n\nDia 18 (5º dia): Vida escrava, rural e urbana. Os castigos e os instrumentos de tortura. O estupro da mulher africana. A imposição religiosa católica. A persistência das danças, cantos, instrumentos musicais e folguedos trazidos da África pelos escravos. As religiões africanas e as línguas faladas pelos escravos. Formas de recusa à escravidão: suicídio, banzo, fuga, assassínio do senhor, e outras.\n\nDia 19 (6º dia): As revoltas e os quilombos. O papel dos valores africanos da resistência: religião, arte, folclores, conhecimentos técnicos de fundição do ferro, do bronze, de agricultura. A importância na resistência de instituições religiosas a exemplo da Casa das Minas (Maranhão), do Axé do Opô Afonjá (Bahia). Papel das instituições laicas após a abolição: Frente Negra Brasileira, Teatro Experimental do Negro, União dos Homens de Cor, Associação Cultural dos Negros, Floresta Aurora, e todas as outras organizações negras que existiram e existem.\n\nDia 20 (7º dia): O Dia da Consciência Negra deve resumir tudo aquilo que tiver ocorrido nos dias anteriores. Ênfase à figura de Zumbi, o primeiro militante do pan-africanismo e da luta por liberdade em terras brasileiras. Zumbi, consolidador da luta palmarista, selando com sua morte em plena batalha a determinação libertária do povo negro-africano escravizado, é o fundador, na prática, do conceito científico histórico-cultural do quilombismo. Quilombismo continuado por outros heróis da história negra: Luísa Mahin e seu filho Luís Gama, Chico-Rei, os enforcados da Revolta dos Alfaiates, dos levantes dos Malês, da Balaiada, o Dragão do Mar, Karocango, João Cândido, e os milhões de quilombolas assassinados em todas as partes do nosso território onde houve o infame cativeiro. Na celebração de encerramento da Semana da Memória Negra deve-se dar todo o destaque aos programas e projetos das entidades e da comunidade, tendo em vista um futuro melhor para os afro-brasileiros. O último evento da Semana deve, de preferência, acontecer ao ar livre, numa concentração da comunidade negra e das pessoas de qualquer origem interessadas em nossas atividades. Durante todo o decorrer da Semana, a retórica acadêmica deverá ser radicalmente proibida.\nAxé, Zumbi!\n\nBIBLIOGRAFIA\n\nCANDEIA (1978). 90 anos de abolição. Rio de Janeiro: G. R. A. N. Escola de Samba Quilombo.\n\nCANDEIA & Isnard (1978). Escola de samba: Árvore que esqueceu a raiz. Rio de Janeiro: Lidador/SEEC/RJ.\n\nDIOP, Cheikh Anta (1974). The African origin of civilization: Myth or reality, trad. e org. Mercer Cook. Westport: Lawrence.\n\n__ (1986). Entrevista a Black Books Bulletin, trad. do francês e coord. por Shawna Maglangbayan Moore. In: VAN SERTIMA, Ivan org. Great African Thinkers: Cheikh Anta Diop. Rutgers: Journal of African Civilizations.\n\nLUCAS, J. Olumide (1948). The religion of the Yorubas. Lagos: C. M. S.\n\nNAÇÕES UNIDAS (1966). International Convention on the Elimination of all Forms of Racial Discrimination. UN Monthly Chronicle, v. 3, n. 1, jan. OPI/213.\n\nNASCIMENTO, Maria Beatriz (1979). O Quilombo do Jabaquara. Revista de Cultura Vozes, v. 73, n. 3, abr.\n\nQUARTIM, João (1971). Dictatorship and armed struggle in Brazil, trad. David Fernbach. Nova Iorque: Monthly Review Press.\n\n\nTranscrito do livro O Quilombismo, 2ª ed. (Brasília/ Rio: Fundação Cultural Palmares/ OR Editora, 2002).",
				"added": 1609130583
			}
		],
		"1_1DCLtawUE1CMCN8PcgV1YowZ46fbFJumTn": [
			{
				"comment_id": 5,
				"body": "isso é tesão reprimido nos negões! kkkkkkkk",
				"added": 1609343431
			}
		]
	},
	"comment_vote": {
		"156_1KMu2u9wo1DCsc27Qt28qwLxVAjcvHZhtj": 1
	}
}