{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1636480186,
			"title": "Encrypted Anonymous Web-Chat",
			"body": "Chat messages are encrypted using the Vision encryption, but system commands, such as the command to enter the room, are not encrypted.\nAt the same time, only hashes of connections and a list of rooms are stored on the server from the data.\n\nThe username for the chat is generated randomly, it can be changed in the future to the same random one, only the name and the name of the room are enough for authorization in the chat.\n\nBy default, when entering the chat, the \"MAIN\" room and the \"default\" encryption key are installed, you can change these data using the appropriate input forms.\nWhen you change the encryption key, you get a question from the interface \"Offer this key to the group members?\" if you refuse, then the key will be changed only by you, and if you agree, then all members of the group who currently have the same encryption key installed as you will exchange keys using the Diffie-Hellman protocol. At the same time, they will all receive your key, but whether to accept it or not remains at their discretion. It looks like a system message with a \"Accept\" button that says that a user with such and such a name offers you his encryption key. Moreover, if several users offer their encryption key, then users can accept any of them and even switch freely between them.\n\nUsers with different encryption receive unreadable text from each other.\n\nWhen the connection with the server is disconnected, the chat will try to reconnect, this is given 10 attempts, with an interval of 3 seconds.",
			"added": 1636480185
		},
		{
			"topic_id": 1636488901,
			"title": "Chan",
			"body": "New chan:\nhttp://127.0.0.1:43110/17aXbeKjJXgqnzdbtptUcLo9cNeCTqc79K/",
			"added": 1636488899
		}
	],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1636480186_17um7PR1kBcpsubiDZi7Be7uP6HYDFjyyV": [
			{
				"comment_id": 1,
				"body": "http://127.0.0.1:43110/1JgLoF6DTW7CKEgF3qewtDVsMvZ2cnf7Tb/",
				"added": 1636480488
			}
		],
		"1636149394_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 2,
				"body": "New Ochan:\nhttp://127.0.0.1:43110/17aXbeKjJXgqnzdbtptUcLo9cNeCTqc79K/",
				"added": 1636488560
			}
		]
	},
	"comment_vote": {}
}