{
	"next_comment_id": 7,
	"comment": [
		{
			"comment_id": 1,
			"body": "Thank you so much for this. It had one unexpected benefit for me. I use my smartphone tethered to my computer exclusively for internet because of where I live. My port for ZeroNet now shows open after installing and running CJDNS. I went to the Mapping Hyperboria site and I had a question. How do I find the peer info? I know this may sound silly, but I am a total noob when it comes to this. Thanks again!",
			"post_id": 51,
			"date_added": 1549500164
		},
		{
			"comment_id": 2,
			"body": "I am hoping i did this right - zero://fc66:873c:5bd5:f2e1:ee7c:08a1:7d0e:fc28:15441",
			"post_id": 51,
			"date_added": 1549503543
		},
		{
			"comment_id": 3,
			"body": "**Claps**\n\n> [kaffie](#comment_58_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): They're entirely different. Tor is an anonymization network. It runs over clearnet ipv4 and hops through randomized relay nodes to arrive at the final destination. It doesn't provide any sort of ip allocation, or routing technology and relies fully on the existing internet infrastructure.\n> cjdns is a part of mesh networking, and works to route traffic through meshes. Instead of running through clearnet ipv4, it can connect through a variety of means (including LAN connections), and provides a static/global ipv6 on top of that. So that you can use regular ipv6-enabled applications without requiring a standard ipv4/ipv6 internet connection. The routing is decentralized, as opposed to tor's reliance on centralized routing (by your isp).\n> Basically, with cjdns, your node can be completely offline, save for a lan connection with another cjdns node, and yet still connect to the entire cjdns network. This is not possible with tor.\n> For the purposes of ZeroNet it helps provide decentralization. With tor, there's nothing really different. There's two ZeroNet nodes that both use ipv4 to connect to one another using traditional internet infrastructure. It's just that tor hides the ipv4 from each user, and has relays/hops around the world to help anonymization. But the end result is still centralized routing to an IP allocated by a centralized authority.\n> With cjdns this isn't the case. You merely connect to your cjdns peers that you yourself manually chose. And they relay your traffic in a decentralized manner (among their peers, and then their peers, etc. until it reaches your destination). So that you don't have to \"phone home\" to learn where an IP address is.\n> With tor, you still have a reliance on assigned ip addresses. With cjdns, you don't. Though today with most of zeronet working through the clearnet internet, this is largely a feature that won't have a huge difference on how things work to the end user. But this is an important step to migrating zeronet to a fully decentralized internet.\n> Without cjdns, we're at the mercy of ip allocation. Want to use the internet? Better go ask the gov and an official corporate isp. With cjdns? Just hook up to your friends network and mesh/peer with them. Easy.\n> TL;DR: To the end user right now there's not much of a functional difference, as both are overlay networks/routing. Tor is designed to complement clearnet and use it to anonymize, while cjdns is designed to replace clearnet and migrate us away from using it. cjdns doesn't anonymize though. So if your goal is privacy, you'll want to use tor for the time being. If your goal is decentralization, you'll want to use cjdns. Or if you're just a fanatic about these kinds of tech, you can obviously just enable both.\n\n",
			"post_id": 51,
			"date_added": 1549586157
		},
		{
			"comment_id": 4,
			"body": "I tried thanking you again after you responded to my question but it didn't publish to peers so it didn't make it through i don't think. Our internet at work today was in and out because of bad weather.",
			"post_id": 51,
			"date_added": 1549587236
		},
		{
			"comment_id": 5,
			"body": "> [yeahyi](#comment_5_14JRUax64emMFVVxN2ikjz5J74CjqoJtFr): 哈哈\n\nYou're a scumbag",
			"post_id": 52,
			"date_added": 1550193611
		},
		{
			"comment_id": 6,
			"body": "And now they're a gone scumbag lol. That filter list is the bomb yo XD",
			"post_id": 52,
			"date_added": 1550208274
		}
	],
	"comment_vote": {},
	"post_vote": {
		"47": 1,
		"51": 1,
		"52": 1
	}
}