{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Pasen a visitar mi blog! Ire posteando lo que pueda aprender de esta nueva red!",
			"body": "http://127.0.0.1:43110/14weBe8CQHen9U1LG4gE2bxg76QMCGsQoS/?Home",
			"added": 1457391900
		},
		{
			"topic_id": 2,
			"title": "STREAMING",
			"body": "Cree una nueva pagina para probar la posibilidad de hacer STREAMING de contenido. Agradeceria que pasen y colaboren, toda ayuda suma! Necesito ayuda con javascript, css, html, videojs. Quien quiera colaborar en el proyecto es bienvenido!\nhttp://127.0.0.1:43110/14ETRYjD3XREhoCzaSfJ2fsrQHbX9kzMkh/",
			"added": 1458169726
		}
	],
	"topic_vote": {
		"1_1NzjwWNcVjsX1ndBgkgC1EM5EUzMACGm8L": 1,
		"1_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1_1NzjwWNcVjsX1ndBgkgC1EM5EUzMACGm8L": [
			{
				"comment_id": 1,
				"body": "> [mama21mama](#comment_12_1HcK5Hw1rPZeYdgTmqJGrVG2tSyR9Ke2Gt): bienvenido\n\nmuchas gracias!",
				"added": 1457393408
			},
			{
				"comment_id": 2,
				"body": "> [raito](#comment_15_12uS7AbHMQEc4YKxoPpASsmDSy6fRtEhrw): Sembrando tu blog, bienvenido\n\nMuchas gracias! Yo tambien estoy sembrando el tuyo!",
				"added": 1457396741
			},
			{
				"comment_id": 8,
				"body": "Buenas noches colegas! Ando haciendo unas pruebas sobre streaming con archivos pesados (1,2gb) por medio de IPFS. Agradeceria si ingresan y me dicen que tal se ve. Si les antoja se quedan y ven la pelicula. Saludos!",
				"added": 1457588493
			},
			{
				"comment_id": 11,
				"body": "> [yetanothertorren](#comment_3_1NgEo4Jc4cvC6ab7J834Ex6DoX9aqmXUi9): le falta los controlles para ver la peli en toda la pantalla\n\nEstoy trabajando en eso, actualmente configure un vps que tenia olvidado para que funcione como servidor IPFS. Proximo paso es cargar un buen HTML5 player, con opcion de subtitulos y full-screen.",
				"added": 1457634120
			},
			{
				"comment_id": 12,
				"body": "> [yetanothertorren](#comment_4_1NgEo4Jc4cvC6ab7J834Ex6DoX9aqmXUi9): una cosa tu has puesto esto en reddit https://www.reddit.com/r/zeronet/comments/49lf8q/zeronet_play_website_peerflixserver_online/ ?\n\nNo, pero gracias por el link. Interesante para leer.",
				"added": 1457634191
			},
			{
				"comment_id": 15,
				"body": "The Pirate Bay - AFK 720p STREAM TEST\nhttp://127.0.0.1:43110/1NXZEk3SupketTvbRxaXCERa1E9Es9hi4a",
				"added": 1457774350
			}
		],
		"9_1HcK5Hw1rPZeYdgTmqJGrVG2tSyR9Ke2Gt": [
			{
				"comment_id": 3,
				"body": "El \"Not Found\" es por un error de la red o porque eliminaste la entrada? Si fuera porque eliminaste la entrada, estaria bueno un verificador de links. Saludos",
				"added": 1457397193
			},
			{
				"comment_id": 4,
				"body": "sigo viendo el not found...",
				"added": 1457417050
			}
		],
		"11_1HcK5Hw1rPZeYdgTmqJGrVG2tSyR9Ke2Gt": [
			{
				"comment_id": 5,
				"body": "creo que google nunca podria indexar zeronet, ya que trabajan por protocolos distintos. no estoy seguro, corrijan si no es cierto.",
				"added": 1457482180
			}
		],
		"4_12uS7AbHMQEc4YKxoPpASsmDSy6fRtEhrw": [
			{
				"comment_id": 6,
				"body": "Estaria bueno poder hacer un preview de la web antes de ingresar, el link cifrado no te dice nada a la hora de entrar a buscar algo, algo como que al colocar el mouse sobre el link automaticamente en una ventanita te muestre la portada de la web.",
				"added": 1457547618
			}
		],
		"1_1PQca3MXiRpHzemfZw7PWz4wfx1P71cpNC": [
			{
				"comment_id": 7,
				"body": "> [dsk](#comment_1_1PQca3MXiRpHzemfZw7PWz4wfx1P71cpNC): Claro, la idea es poder editar la web en mi pc de casa, y en otro del trabajo, por ejemplo. ¿Y a nivel de archivos, siempre tengo que disponer de mi ancho de banda si he entendido, verdad?\n\nA nivel de archivos, si son de poco tamaño lo podes hospedar directamente en tu web sin que su rendimiento se vea afectado. Si lo que buscas son hospedar archivos de gran tamaño te recomiendo leer sobre IPSF que por lo que entiendo es un sistema distribuido de archivos. Me cuentas que averiguas del tema!",
				"added": 1457557504
			}
		],
		"15_1HcK5Hw1rPZeYdgTmqJGrVG2tSyR9Ke2Gt": [
			{
				"comment_id": 9,
				"body": "Intenta editar algo en el blog, luego fijate si te aparece en la parte inferior derecha un cartel que dice algo de firmar y publicar o algo por el estilo. pincha ahi y espera que cargue",
				"added": 1457597068
			},
			{
				"comment_id": 10,
				"body": "\"Sign and Publish new content\"",
				"added": 1457597143
			}
		],
		"6_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92": [
			{
				"comment_id": 13,
				"body": "Yo estoy por preparar una guia sobre IPFS en español. Cuando la suba te aviso, pase por el blog! http://127.0.0.1:43110/14weBe8CQHen9U1LG4gE2bxg76QMCGsQoS",
				"added": 1457679946
			},
			{
				"comment_id": 14,
				"body": "> [cer](#comment_13_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92): Tu blog es parte de mis favoritos, desde hace buen rato ;-)\n\nMe siento alagado, gracias!",
				"added": 1457712787
			},
			{
				"comment_id": 17,
				"body": "> [jza](#comment_2_1MahZJTzjoEMMCv2jBReDWhyNGRhN5tvDq): seria buena una guia de como configurarlo e instalarlo. Busque en youtube y solo vi unos demos, y si, la pagina de github tiene instrucciones tmb. Pero siempre hay uno que otro gotcha que quizas no este en la doc.\n\nPróximamente voy a escribir una guía de instalación, configuración, comandos mas importantes, etc. La verdad es que tengo a una persona escribiendo ya que lo mio no es la redacción. Cuando este lista la voy a subir al blog/web para que todos tengamos una guía de facil instalación y configuración. Capas hasta se podría hacer un script para una instalación de 2 clicks.",
				"added": 1457889458
			},
			{
				"comment_id": 18,
				"body": "> [cer](#comment_18_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92): Linux?\n\nPara los tres principales sistemas operativos!",
				"added": 1457893819
			}
		],
		"1_15M1ai1fw7SDsBtvXjbQW844KfUJXpzKxE": [
			{
				"comment_id": 16,
				"body": "me abre una web vacia, capas asi sea el archivo",
				"added": 1457821908
			}
		],
		"2_1NzjwWNcVjsX1ndBgkgC1EM5EUzMACGm8L": [
			{
				"comment_id": 19,
				"body": "> [ryuonosuke](#comment_2_1L6to22qhd6M6M4QCPydLBLJFf9GgtSvcH): Buenas me especializo en HTML5, CSS3 me gustaria ayudarte cualquier cosa dejame mail.\n\nexcelente! tus conocimientos seran apreciados! he actualizado la web, me comentas que te parece?",
				"added": 1458266489
			}
		]
	},
	"comment_vote": {}
}