{
	"title": "The MPA Blog",
	"description": "Merced Privacy Alliance\n\n[Main Site](https://mpa.today)",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 4,
	"demo": false,
	"modified": 1512099244,
	"post": [
		{
			"post_id": 3,
			"title": "The Merced Privacy Alliance becomes an official UC Merced Student Organization!",
			"date_published": 1512074564.015,
			"body": "Following a multi-week application process, we're proud to announce that we've been granted the approval of our request to become an official UC Merced student organization!\n\nThis is a huge step as it allows us not only to advertise our events on campus, but allows for fund-raising for said events, as well as helping the legitimacy of our group.\n\nWe've got some events planning for the next couple weeks, and with our new-found organization status, you should be hearing about them on Happenings soon.\n\nSee you then!"
		},
		{
			"post_id": 2,
			"title": "A Public Endorsement of the EFA's Principals",
			"date_published": 1512073934.698,
			"body": "As part of the requirements for joining the [EFA](https://www.eff.org/electronic-frontier-alliance). Our group, the Merced Privacy Alliance, is proud to state that we fully endorse the program's principals of Free Expression, Security, Privacy, Creativity and Access to Knowledge.\n\nWe hope you do too!"
		},
		{
			"post_id": 1,
			"title": "Where this Blog is hosted",
			"date_published": 1433033779.604,
			"body": "![decentralization is the future!](img/decentralization.jpg)\n\nThis blog is hosted on more than just our own server. It's hosted on a network of a limitless amount of peers (which you can view the approximate geographic location of by dragging the '0' button in the top-right corner of the page).\n\nThe technology that enables us to do this is called [ZeroNet](https://zeronet.io), and it allows for everyday people to set up awesome websites that:\n\n*   Do not require an expensive server to host\n\n*   Cannot be censored by governments or Internet Service Providers\n\n*   Cannot be shut down without a large scale attack on many different computers at once\n\nIf our website is ever shut down, you can access this blog on ZeroNet at [Blog.MercedPrivacyAlliance.bit](http://127.0.0.1:43110/blog.mercedprivacyalliance.bit)"
		}
	]
}