{
	"title": "Teslapunk",
	"description": "My ZeroBlog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 6,
	"demo": false,
	"modified": 1503634005,
	"post": [
		{
			"post_id": 5,
			"title": "The Negistor",
			"date_published": 1503633930.211,
			"body": "One of the things that powers a Teslapunk story is energy (insert groan response to pun here). Ideally, the energy source should be cheap, clean and portable. Many Teslapunkers may imagine some combination of coils and capacitors to extract energy from the aether or some motor hooked up to an alternator made from a wish alloy to produce perpetual motion. However, not all Teslapunk stories need to have an impressive energy system. Using the KISS principle one can imagine a small discrete component which can be inserted to a circuit and act like a battery. What is it? The negistor (negative resistor).\n\nA negative resistor is the opposite of the regular (positive Ohmic) resistor you will find at the local Rat Shack. Oh, wait. it went bankrupt with no surprise. O.K. Find on e-bay. Anyway, unlike conventional resistors which drop voltage by dissipating heat a negistor would converge ambient energy from its surroundings to produce a voltage increase.\n\nAccording to conventional physics a discrete negative resistor circuit component is impossible because it violates the second law of thermodynamics. However, Nikola Tesla took an opposite view and believed energy could be extracted from ambient surrounding. In his essay \"The Problem of Increasing Human Energy\" Tesla argued that energy could indeed be extracted from an ambient medium.\n\nSo, we have a cheap, clean and portable energy source and a legitimate connection to Tesla's research. Connect a small dry cell battery to enough negistors and you can get large amounts of power. From there, your Teslapunk story can explore the other possible combinations. For example, is the product of a negative resistor and a positive capacitor an absolute value? Maybe the time constant of an RC circuit can be negative. That might mean you're getting energy from the future because the capacitor is charging in negative time. That means a backward-time switch can be constructed or a filter can be made to receive negative frequencies."
		},
		{
			"post_id": 4,
			"title": "Teslapunk According to Wikipedia",
			"date_published": 1501359416.415,
			"body": "[Source:](https://en.wikipedia.org/wiki/Talk:Cyberpunk_derivatives#Teslapunk_sources)\n\nTeslapunk, named for scientist and inventor Nikola Tesla, refers to fictional narratives or visual styles inspired by 18th, 19th, and early 20th century pioneers of electricity and electrical devices. Like other steampunk derivatives, these narratives or styles commonly imagine an alternate history where, in the case of Teslapunk, widely available cheap (or free), clean, and often highly portable electrical energy replaces all previous energy sources (such as wood, coal and oil, and the steam engines that were fueled by them), but has yet to be replaced (or is never replaced) by other energy sources itself (such as diesel or atomic power). In some Teslapunk stories, free-energy technologies are largely forgotten in the present day, but only because they were kept secret by some government or other organization that used the technologies to control the masses. (Or to protect the masses, as is the case with Warehouse 13.)\n\n<div>Items common to Teslapunk include Art Deco styled ray guns, robots, and rocket ships. The \"punk\" element in Teslapunk usually emerges as a \"free energy\", \"electronically empowered masses\" ethos challenges the \"energy scarcity\" and \"fuel monopoly\" ethos that was already fairly well entrenched in the United States by 1900\\. (See Standard Oil.)</div>\n\n<div>Visually, Teslapunk shares much in common with Raygun Gothic.\n</div>"
		},
		{
			"post_id": 3,
			"title": "The Fall and Rise of Teslapunk",
			"date_published": 1501147843.136,
			"body": "Teslapunk used to be listed in Wikipedia as a cyberpunk derivative along with other subgenres as steampunk and dieselpunk. Teslapunk was later removed. Maybe the removal was due to lack of references. Maybe because of Big Oil. Yeah, I am thinking the latter also.\n\nAnyway, Teslapunk.bit is meant to revive and legitimize the subgenre. This domain will help build upon and further define what Teslapunk is.\n\nAlways remember: If you are not doing it with at least a kilovolt than you are probably not doing it right."
		},
		{
			"post_id": 1,
			"title": "Teslapunk.bit",
			"date_published": 1501138800,
			"body": "I had some trouble setting this up the first time on ZeroNet but I think everything is working now. As a bonus Teslapunk.bit is now using a \"vanity\" bitcoin address. I think the mixture of upper and lower case letters in the \"tEsLa\" part works well. A punk address for a high voltage punk site.\n\nAlso, the vanity bitcoin address allows me to accept donations. If you like this blog and wish to donate any portion of a bitcoin sent to 1tEsLa3z4UVnnfY3g4i9mPh7kwF2ZRDhZ is appreciated. Just saying."
		}
	]
}