{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "archive.today",
			"body": "archive.today é um site de arquivo que armazena instantâneos de páginas da web. Ele recupera uma página por vez semelhante ao WebCite, menor que 50 MB cada, mas com suporte para sites modernos, como Google Maps e Twitter.\n\nÉ preciso um snapshot de uma página web para ela ficar sempre on-line, mesmo que a página original desapareça. O site salva um texto e uma cópia gráfica da página para uma melhor precisão e fornece um link curto e confiável para um registro inalterável de qualquer página da web.\n\n- https://archive.today/\n- http://archivecaslytosk.onion/",
			"added": 1572095061
		},
		{
			"topic_id": 2,
			"title": "BBC dribla censura de governos e inaugura site na Deep Web",
			"body": "Alguns governos, como o da China, costumam censurar sites e serviços que consideram “irrelevantes” para o comando de suas nações — normalmente os veículos que trazem notícias pouco “lisonjeiras”. A BBC — bloqueada em solo chinês, assim como no Irã e no Vietnã — encontrou um jeitinho oferecer todo o seu conteúdo para essas localidades, com a ajuda da Deep Web.\n\n- https://www.bbcnewsv2vjtpsuy.onion/",
			"added": 1572095319
		},
		{
			"topic_id": 3,
			"title": "Propriedade Pessoal vs Propriedade Privada vs Propriedade Coletiva",
			"body": "#Se eu tivesse que responder à seguinte pergunta: O que é a escravidão? e respondesse numa palavra: É o assassinato, meu pensamento seria imediatamente compreendido. Não teria necessidade de um discurso muito longo para mostrar que o poder de espoliar o homem do pensamento, da vontade, da personalidade, é um poder de vida e morte, e que escravizar um homem é assassiná-lo. Por que, então, a esta outra pergunta: O que é a propriedade? não posso responder da mesma forma: É o roubo, sem ter a certeza de que não serei compreendido,embora essa segunda proposição não seja mais que a primeira transformada? — Pierre-Joseph Proudhon\n\nÉ comum que haja uma certa confusão em relação a que os socialistas se referem ao criticar a Propriedade Privada. É ainda mais comum conservadores acusarem os socialistas de, ao defenderem a abolição da propriedade privada, defenderem a expropriação de bens como casas, carros, celulares, etc; que seriam classificados como “propriedade privada”.\nNo pensamento socialista e anarquista, entretanto, há uma clara diferenciação entre o que constitui Propriedade Privada e Propriedade Pessoal. Esse texto tenta esclarecer essa dúvida.\n\n#Propriedade Pessoal\n\nNa concepção socialista e anarquista, Propriedade Pessoal (às vezes também chamada de Posse ou Propriedade Possessiva) é toda e qualquer propriedade de uso pessoal de um indivíduo. Isso inclui objetos como casas, carros, celulares, qualquer outro objeto de uso individual, e até mesmo pequenas porções de meios de produção (Proudhon desenvolveu um exemplo desta situação: Se um marceneiro, por exemplo, usa uma oficina para realizar seu trabalho, essa oficina, uma pequena parcela de meios de produção, estaria sob Propriedade Pessoal ou posse desse marceneiro, enquanto que ainda não caracterizaria uma propriedade privada, por ser de uso individual). Para o socialismo, a Propriedade Pessoal é totalmente justificada, pois não exige qualquer tipo de exploração para ser utilizada, e constitui as bases da vida de qualquer indivíduo.\nIronicamente, enquanto acusam os socialistas de não respeitarem a propriedade pessoal, os liberais e conservadores, ao defenderem o capitalismo, defendem um sistema que bem objetivamente desrespeita a noção de Propriedade Pessoal. Um sistema que permite que pessoas morem na rua, enquanto existem casas vazias, e que permite que pessoas tenham suas casas expropriadas por bancos, como aconteceu com milhares de americanos durante a crise de 2008, é um sistema que conduz uma completa violação do conceito de Propriedade Pessoal.\n\n#Propriedade Privada\n\nPropriedade Privada, na concepção socialista, é a propriedade individual dos meios de produção, ou seja, fábricas, plantações, escritórios, grandes porções de terra, etc. O socialismo propõe que a propriedade privada dos meios de produção seja abolida, e os locais de trabalho sejam geridos pelos próprios trabalhadores, em regime de democracia direta.\nPara os socialistas, a Propriedade Privada é injusta e injustificada, por necessariamente exigir a exploração daqueles a ela submetidos, e gerando problemas sociais como consequência disso.\nSobre o por que de a Propriedade Privada ser considerada uma instituição injusta e autoritária, pode-se ler em textos de diversos autores socialistas e anarquistas (especialmente em “O Que é A Propriedade?”, de Proudhon). Nós também tratamos brevemente sobre isso [neste texto](https://medium.com/acracia/o-que-é-anarquismo-fde08f849a49).\n\n#Propriedade coletiva\nA questão restante, então, seria: “Se, em um sistema socialista, seria abolida a propriedade privada, mas não a propriedade individual, que forma de propriedade a substituiria?” A resposta é a Propriedade Coletiva.\nÉ comum o conceito de propriedade coletiva ser confundido com o conceito de “propriedade pública”, ou seja, a propriedade coletiva ser entendida simplesmente como uma situação onde o Estado possui a propriedade.\nIsso, entretanto, não é a propriedade coletiva. A chamada “propriedade pública” ainda é uma forma de propriedade privada; a única diferença sendo que, ao invés de pertencer a um indivíduo com corporação privada, ela pertence a uma instituição: o Estado. Como Errico Malatesta escreveu em “O Estado Socialista”: “A propriedade privada e o poder estatal são dois elos de uma mesma corrente que esmaga a humanidade (…) Se abolirem a propriedade privada sem abolir o Estado, ela se reconstituirá graças aos governos.”\n#Que é a propriedade coletiva, então?\nÉ a base fundamental do socialismo. A propriedade coletiva é quando os meios de produção são controlados por aqueles que os utilizam. Os locais de trabalho sendo administrados por aqueles que lá trabalham.\nÉ dito que a abolição da propriedade privada e o uso da propriedade coletiva seriam uma violação das “liberdades individuais”, e uma propriedade coletiva seria gerida na forma de uma “ditadura da maioria”. Mas como seria a propriedade coletiva mais “ditatorial” que a propriedade privada? Na organização da propriedade priva, um indivíduo ou um pequeno grupo que está no topo da hierarquia corporativa mantém sua liberdade individual, pois controla os meios de produção, e todos os outros indivíduos que compõem a empresa precisam acatar as ordens e decisões desta minoria hierárquica, sem qualquer poder de decisão, o que é, sem sombra de dúvida, uma violação total do liberdade individual. Geralmente é usado o argumento de que, caso você não queira acatar as ordens da minoria detentora da propriedade privada, “você pode deixar a empresa e procurar outro lugar para trabalhar”. O que esse argumento ignora é que, na propriedade coletiva, você também pode deixar a organização, se desejar. Além disso, a opção de “sair e procurar outro local de trabalho” geralmente quer dizer não ter garantia nenhuma de que irá encontrar outro emprego, e podendo, dessa forma, ser privado de seus meios de sobreviver. E, mesmo que o indivíduo encontre outro local de trabalho, ele também será gerido na forma hierárquica de propriedade privada, o que faz com que ele também vá ter novamente que acatar as ordens daqueles no topo da hierarquia. A decisão que resta, portanto, é: Submeter-se àqueles que detém a propriedade privada, ou não ter como sobreviver. Que tipo de “liberdade individual” é essa?\nEntão, mesmo que a propriedade coletiva fosse gerida de forma que a maioria sempre vencesse, isso ainda seria preferível à organização totalitária que a propriedade privada possui. Um sistema em que 51% dos participantes decidem o que será feito é, com certeza, imensamente mais democrático do que um sistema aonde 10% dos membros impõem suas ordens aos outros 90%.\nMas a propriedade coletiva não é um sistema de simplesmente “51% ganha”. Como o youtuber Libertarian Socialist Rants demonstrou [em seu excelente vídeo sobre como seria organizada uma sociedade anarquista](https://youtu.be/qiq-PREk2IE), o sistema de democracia direta defendido pelos socialistas libertários é um processo de formação de consenso, ao invés de simples decisão da maioria. Dessa forma, todo indivíduo que participa da organização terá a chance de mostrar diretamente sua visão, e as decisões serão tomadas de tal forma que o maior consenso possível seja buscado. Assim, é mantida a total igualdade de poder, ao mesmo tempo em que se mantém total liberdade individual para todos os participantes.\n\n- Fonte: https://medium.com/acracia/propriedade-pessoal-vs-propriedade-privada-vs-propriedade-coletiva-60d87ef9da14",
			"added": 1572096994
		}
	],
	"topic_vote": {
		"1_17dWCCH7ERRQbnfDPoW4arpHPNYmtuMtdy": 1,
		"2_17dWCCH7ERRQbnfDPoW4arpHPNYmtuMtdy": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"3_17dWCCH7ERRQbnfDPoW4arpHPNYmtuMtdy": 1
	},
	"next_comment_id": 5,
	"comment": {
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "#Leonard Susskind - Todas as aulas de física de Stanford em ordem\n\nAqui está uma compilação de todas as incríveis palestras que o Dr. Susskind nos forneceu no campo da física da Universidade de Stanford, excluindo seus conjuntos de palestras de revisão publicadas mais recentemente, que abordaram tópicos que ele abordou nas anteriores. Eu queria organizar essas gemas em ordem cronológica e conceitual, começando com a base na Mecânica Clássica para tornar mais fácil para as pessoas estudarem esses tópicos em profundidade. Ele entra em maiores detalhes do que qualquer outra pessoa no Youtube, tornando essas palestras uma visita obrigatória para todos os apaixonados por desvendar os mistérios do nosso universo!\n\n- https://invidio.us/playlist?list=PLQrxduI9Pds1fm91Dmn8x1lo-O_kpZGk8",
				"added": 1572095629
			},
			{
				"comment_id": 2,
				"body": "O Instituto Sul-Americano de Pesquisa Fundamental do ICTP (ICTP-SAIFR) é um novo centro regional sul-americano de física teórica criado em colaboração com o Centro Internacional de Física Teórica (ICTP) com a Universidade Estadual de São Paulo (UNESP) e São Paulo Agência de Financiamento à Pesquisa (FAPESP). O ICTP-SAIFR está localizado no campus do Instituto de Física Teórica (IFT-UNESP) na cidade de São Paulo e as atividades incluem seminários, minicursos, escolas e oficinas. O centro tem financiamento para visitantes de curto e longo prazo, bem como para pesquisadores de pós-doutorado e permanentes\n\n- https://invidio.us/channel/UCHZD5-4GF1lLLUklsxyt3fw/playlists",
				"added": 1572095755
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 3,
				"body": "Chegando o dia de Pentecoste, estavam todos reunidos num só lugar.\nDe repente veio do céu um som, como de um vento muito forte, e encheu toda a casa na qual estavam assentados.\nE viram o que parecia línguas de fogo, que se separaram e pousaram sobre cada um deles.\nTodos ficaram cheios do Espírito Santo e começaram a falar noutras línguas, conforme o Espírito os capacitava.\nHavia em Jerusalém judeus, tementes a Deus, vindos de todas as nações do mundo.\nOuvindo-se este som, ajuntou-se uma multidão que ficou perplexa, pois cada um os ouvia falar em sua própria língua.\nAtônitos e maravilhados, eles perguntavam: \"Acaso não são galileus todos estes homens que estão falando?\nEntão, como os ouvimos, cada um de nós, em nossa própria língua materna?\nPartos, medos e elamitas; habitantes da Mesopotâmia, Judéia e Capadócia, Ponto e da província da Ásia,\nFrígia e Panfília, Egito e das partes da Líbia próximas a Cirene; visitantes vindos de Roma,\ntanto judeus como convertidos ao judaísmo; cretenses e árabes. Nós os ouvimos declarar as maravilhas de Deus em nossa própria língua! \"\nAtônitos e perplexos, todos perguntavam uns aos outros: \"Que significa isto? \"\nAlguns, todavia, zombavam deles e diziam: \"Eles beberam vinho demais\".\nEntão Pedro levantou-se com os Onze e, em alta voz, dirigiu-se à multidão: \"Homens da Judéia e todos os que vivem em Jerusalém, deixem-me explicar-lhes isto! Ouçam com atenção:\nestes homens não estão bêbados, como vocês supõem. Ainda são nove horas da manhã!\nPelo contrário, isto é o que foi predito pelo profeta Joel:\n‘Nos últimos dias, diz Deus, derramarei do meu Espírito sobre todos os povos. Os seus filhos e as suas filhas profetizarão, os jovens terão visões, os velhos terão sonhos.\nSobre os meus servos e as minhas servas derramarei do meu Espírito naqueles dias, e eles profetizarão.\nMostrarei maravilhas em cima no céu e sinais em baixo, na terra, sangue, fogo e nuvens de fumaça.\nO sol se tornará em trevas e a lua em sangue, antes que venha o grande e glorioso dia do Senhor.\nE todo aquele que invocar o nome do Senhor será salvo! ’\n\"Israelitas, ouçam estas palavras: Jesus de Nazaré foi aprovado por Deus diante de vocês por meio de milagres, maravilhas e sinais, que Deus fez entre vocês por intermédio dele, como vocês mesmos sabem.\nEste homem lhes foi entregue por propósito determinado e pré-conhecimento de Deus; e vocês, com a ajuda de homens perversos, o mataram, pregando-o na cruz.\nMas Deus o ressuscitou dos mortos, rompendo os laços da morte, porque era impossível que a morte o retivesse.\nA respeito dele, disse Davi: ‘Eu sempre via o Senhor diante de mim. Porque ele está à minha direita, não serei abalado.\nPor isso o meu coração está alegre e a minha língua exulta; o meu corpo também repousará em esperança,\nporque tu não me abandonarás no sepulcro, nem permitirás que o teu Santo sofra decomposição.\nTu me fizeste conhecer os caminhos da vida e me encherás de alegria na tua presença’.\n\"Irmãos, posso dizer-lhes com franqueza que o patriarca Davi morreu e foi sepultado, e o seu túmulo está entre nós até o dia de hoje.\nMas ele era profeta e sabia que Deus lhe prometera sob juramento que colocaria um dos seus descendentes em seu trono.\nPrevendo isso, falou da ressurreição do Cristo, que não foi abandonado no sepulcro e cujo corpo não sofreu decomposição.\nDeus ressuscitou este Jesus, e todos nós somos testemunhas desse fato.\nExaltado à direita de Deus, ele recebeu do Pai o Espírito Santo prometido e derramou o que vocês agora vêem e ouvem.\nPois Davi não subiu ao céu, mas ele mesmo declarou: ‘O Senhor disse ao meu Senhor: Senta-te à minha direita\naté que eu ponha os teus inimigos como estrado para os teus pés’.\n\"Portanto, que todo Israel fique certo disto: Este Jesus, a quem vocês crucificaram, Deus o fez Senhor e Cristo\".\nQuando ouviram isso, os seus corações ficaram aflitos, e eles perguntaram a Pedro e aos outros apóstolos: \"Irmãos, que faremos? \"\nPedro respondeu: \"Arrependam-se, e cada um de vocês seja batizado em nome de Jesus Cristo, para perdão dos seus pecados, e receberão o dom do Espírito Santo.\nPois a promessa é para vocês, para os seus filhos e para todos os que estão longe, para todos quantos o Senhor, o nosso Deus chamar\".\nCom muitas outras palavras os advertia e insistia com eles: \"Salvem-se desta geração corrompida! \"\nOs que aceitaram a mensagem foram batizados, e naquele dia houve um acréscimo de cerca de três mil pessoas.\nEles se dedicavam ao ensino dos apóstolos e à comunhão, ao partir do pão e às orações.\nTodos estavam cheios de temor, e muitas maravilhas e sinais eram feitos pelos apóstolos.\nTodos os que criam mantinham-se unidos e tinham tudo em comum.\nVendendo suas propriedades e bens, distribuíam a cada um conforme a sua necessidade.\nTodos os dias, continuavam a reunir-se no pátio do templo. Partiam o pão em suas casas, e juntos participavam das refeições, com alegria e sinceridade de coração,\nlouvando a Deus e tendo a simpatia de todo o povo. E o Senhor lhes acrescentava todos os dias os que iam sendo salvos.\n\n- Atos 2:1-47",
				"added": 1572096172
			},
			{
				"comment_id": 4,
				"body": "Enquanto Pedro e João falavam ao povo, chegaram os sacerdotes, o capitão da guarda do templo e os saduceus.\nEles estavam muito perturbados porque os apóstolos estavam ensinando o povo e proclamando em Jesus a ressurreição dos mortos.\nAgarraram Pedro e João e, como já estava anoitecendo, os colocaram na prisão até o dia seguinte.\nMas, muitos dos que tinham ouvido a mensagem creram, chegando o número dos homens que creram a perto de cinco mil.\nNo dia seguinte, as autoridades, os líderes religiosos e os mestres da lei reuniram-se em Jerusalém.\nEstavam ali Anás, o sumo sacerdote, bem como Caifás, João, Alexandre e todos os que eram da família do sumo sacerdote.\nMandaram trazer Pedro e João diante deles e começaram a interrogá-los: \"Com que poder ou em nome de quem vocês fizeram isso? \"\nEntão Pedro, cheio do Espírito Santo, disse-lhes: \"Autoridades e líderes do povo!\nVisto que hoje somos chamados para prestar contas de um ato de bondade em favor de um aleijado, sendo interrogados acerca de como ele foi curado,\nsaibam os senhores e todo o povo de Israel que por meio do nome de Jesus Cristo, o Nazareno, a quem os senhores crucificaram, mas a quem Deus ressuscitou dos mortos, este homem está aí curado diante dos senhores.\nEste Jesus é ‘a pedra que vocês, construtores, rejeitaram, e que se tornou a pedra angular’.\nNão há salvação em nenhum outro, pois, debaixo do céu não há nenhum outro nome dado aos homens pelo qual devamos ser salvos\".\nVendo a coragem de Pedro e de João, e percebendo que eram homens comuns e sem instrução, ficaram admirados e reconheceram que eles haviam estado com Jesus.\nE como podiam ver ali com eles o homem que fora curado, nada podiam dizer contra eles.\nAssim, ordenaram que se retirassem do Sinédrio e começaram a discutir,\nperguntando: \"Que faremos com esses homens? Todos os que moram em Jerusalém sabem que eles realizaram um milagre notório que não podemos negar.\nTodavia, para impedir que isso se espalhe ainda mais entre o povo, precisamos adverti-los de que não falem mais com ninguém sobre esse nome\".\nEntão, chamando-os novamente, ordenaram-lhes que não falassem nem ensinassem em nome de Jesus.\nMas Pedro e João responderam: \"Julguem os senhores mesmos se é justo aos olhos de Deus obedecer aos senhores e não a Deus.\nPois não podemos deixar de falar do que vimos e ouvimos\".\nDepois de mais ameaças, eles os deixaram ir. Não tinham como castigá-los, porque todo o povo estava louvando a Deus pelo que acontecera.\nPois o homem que fora curado milagrosamente tinha mais de quarenta anos de idade.\nQuando foram soltos, Pedro e João voltaram para os seus e contaram tudo o que os chefes dos sacerdotes e os líderes religiosos lhes tinham dito.\nOuvindo isso, levantaram juntos a voz a Deus, dizendo: \"Ó Soberano, tu fizeste o céu, a terra, o mar e tudo o que neles há!\nTu falaste pelo Espírito Santo por boca do teu servo, nosso pai Davi: ‘Por que se enfurecem as nações, e os povos conspiram em vão?\nOs reis da terra se levantam, e os governantes se reúnem contra o Senhor e contra o seu Ungido’.\nDe fato, Herodes e Pôncio Pilatos reuniram-se com os gentios e com os povos de Israel nesta cidade, para conspirar contra o teu santo servo Jesus, a quem ungiste.\nFizeram o que o teu poder e a tua vontade haviam decidido de antemão que acontecesse.\nAgora, Senhor, considera as ameaças deles e capacita os teus servos para anunciarem a tua palavra corajosamente.\nEstende a tua mão para curar e realizar sinais e maravilhas por meio do nome do teu santo servo Jesus\".\nDepois de orarem, tremeu o lugar em que estavam reunidos; todos ficaram cheios do Espírito Santo e anunciavam corajosamente a palavra de Deus.\nDa multidão dos que creram, uma era a mente e um o coração. Ninguém considerava unicamente sua coisa alguma que possuísse, mas compartilhavam tudo o que tinham.\nCom grande poder os apóstolos continuavam a testemunhar da ressurreição do Senhor Jesus, e grandiosa graça estava sobre todos eles.\nNão havia pessoas necessitadas entre eles, pois os que possuíam terras ou casas as vendiam, traziam o dinheiro da venda\ne o colocavam aos pés dos apóstolos, que o distribuíam segundo a necessidade de cada um.\nJosé, um levita de Chipre a quem os apóstolos deram o nome de Barnabé, que significa encorajador,\nvendeu um campo que possuía, trouxe o dinheiro e o colocou aos pés dos apóstolos.\n\n- Atos 4:1-37",
				"added": 1572096296
			}
		]
	},
	"comment_vote": {}
}