{
	"next_post_id": 20,
	"next_comment_id": 8,
	"next_follow_id": 2,
	"avatar": "jpg",
	"user_name": "ticker@zeroid.bit",
	"hub": "1PedoHubPRhuSRoVHspoeuTVvzHHxLM7Wf",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1,
			"date_added": 1550860363,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1550989821,
			"body": "...why the heck can't I see more Hubs on the Hub page? Is that all there is?",
			"date_added": 1550989819
		}
	],
	"post_like": {
		"1QL2MB3JUZRgBHwGZgjQpEewBomhFZrrxX_1550731029": 1550862099
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "'Chelsea' may be cracked in the head (and I don't know what WikiLeaks has done recently), but I don't see how you'd get ridicule for donating to someone who (at least somewhat) pulled back the curtain.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1551030317",
			"date_added": 1551029161
		},
		{
			"comment_id": 2,
			"body": "Ew, automated posts? May as well give me a default friend named 'Tom'...",
			"post_uri": "1DkFDJGJGQRA3mXaHkEZhkynzpZrkQEonM_1",
			"date_added": 1550860431
		},
		{
			"comment_id": 3,
			"body": "@Kaffie: No, Conservative right-wingers are Authoritarian (and being capitalist would actually be reason for them to be here, what with Socialism being the Authoritarian taking of their earned money to be used for people who don't [or can't] do jack shit). That's the hard right corner.\n\n.\n\nBut even they're more for free speech and open Republic on a fundamental level when compared to SocJus Socialist/Communist/Anarcs who think hate speech is a thing that should be banned but refuse to define it because definitions are tools of the patriarchy to limit their emotional spewing into the neither reaches of the universe.\n\n.\n\n@Tommykakashi 's definition is contradictory to his attempt to highlight Wolf's lack of definition as well, since \"equality\" is impossible where freedom to do what you please (within reason) exists...which is why they say they're all for \"equality\" but mean \"equity\" where they'll force one side to slow down for the rainbow-haired gimp who couldn't compete otherwise, thus not being about \"freedom\", \"progress\", or \"fraternity\" either.\n\n.\n\nThe picks in the second half are contradictory,  ill-defined, or flat our biased...: authority/hierarchy are rules of nature...you can't bop around those period and quite frankly it's not a political position. Order prevents chaos like the previous. Duty defines purpose; purpose gives goals; reaching goals gives positive feedback and continues the loop...obviously you can achieve lofty goals like, shit I dunno, building the entire world, by keeping ear to your nature and another to reason.\n\nAnd I'm going to assume \"reaction\" mean \"wait and see; think than do\".\n\n.\n\n=== ALSO ===\nBe well aware that Wiki are basically owned by the same Left Wing Idiots his post is about, to the point where if you're Republican and you do something to tick them off they'll blockade you from editing your page, restrict edits to people with over 200 edits (so YEARS of edits), de-person you (remove/bury your page from search results), and remove details from your page for personal or political reasons in violation of their own ToS and editing guidelines.\n\n.\n\nSo don't go grabbing party definitions from it...especially when they claim to be about \"freedom\" but are becoming the primary reason people create places like ZeroNet in the first place.",
			"post_uri": "1QL2MB3JUZRgBHwGZgjQpEewBomhFZrrxX_1550731029",
			"date_added": 1550862057
		},
		{
			"comment_id": 4,
			"body": "I don't thin you know what a shill is...who the fuck is being paid to voice their opinion on a sprout-ling darkweb when there are far more populous places to do it...?\n\nNot to mention no one has to pay either of those people's followers to voice their support, because neither holds back punches.\n\nIf you're looking for shills, look at the radical Left in The States who get paid by Left-wing organizations to appear at otherwise peaceful rallies and harrass people, vandalize the area, and are empowered by pussified police that won't arrest them to continue doing what they do until they go overboard...",
			"post_uri": "15A62tSppi8Gt85JGm5B5WDxWDgZA8wXh2_1550963172",
			"date_added": 1550988127
		},
		{
			"comment_id": 5,
			"body": "@Kaffie: \n\n`Where is \"competition\"? It just doesn't exist in today's society unless you force it to exist. So in anarchist groups there's no such thing. Which is why everything is collaborative.`\n\nYou don't need to force people to steal or work harder to feed themselves...it's a natural inclination. The systems of Capitalism are built on that inclination and exploit it from there. And unlike Anarchism it doesn't try and be the underlying system and not at the same time.\n\nYou'll never have collaborative societies when GREED is part of that underlying nature. Someone WILL horde resources; other people WILL not have enough to survive; someone WILL be pushed by their basic nature to survive to either STEAL (theft, greed, ANARCHY...), KILL (jealousy, envy, greed, ANARCHY), or force themselves into some level of serfdom (hierarchy, order...not anarchy) in order to continue to exist.\n\n`You umm... do realize that there's no way to make money on zeronet, right?`\n\nOne, I wasn't talking about Zeronet as a marketplace in that comment, I was talking about how a Capitalist is more likely to be in a place where free speech is the law...it's literally in my fucking paragraph.\n\n` Right-wing conservative countries like syria, saudi arabia, malaysia, etc. crack down on freedom of speech, and are highly censored.`\n\nNote that not a single country you listed there is a Democratic Capitalist Republic. Fuck, Malaysia is a Monarchy and Syria hasn't had a clean election since ever...and don't get me started on how you listed countries that are predominantly run by Muslims which is a completely different type of Conservative than a Capitalist/Free Market Conservative.\n\n`China and Russia are good examples as well (both having highly censored internets, and being highly capitalistic and authoritarian).`\n\nOnce again, China is not a Democracy. Once again, pseudo-religious teaching influence their reasons for censorship. They're also not a free-market, either, and reserve the right to take property at their will.\n\nRussia's internet is censored on a far lesser level than China, usually against anything Anti-Kremlin / Putin. Otherwise it's pretty damn close to open.\n\n'Anarchists are the breed you find here on zeronet and other decentralized platforms. '\n\nPartially. For one, there is still order enabled on this platform and others. You think you can do what you please and then you enter a site/zite that says otherwise. For all of it's Anarchistic founding, Silk Road still had to lay down the law to prevent exit scams, hacks, keep the platform running, and disallowing the sells of weapons (for a period  of time or full-stop, I can't remember which). Helping each other remain anon and able to speak at will is as Capitalist and free-market as allowing people the right to sell whatever they please within a set of guidelines is Anarchistic...but ironically, ONE of the two needs both to survive (cap) and the other tries to fake not being closely related with Left-leaning idyllic notions of complete and utter freedom (anarc).",
			"post_uri": "1QL2MB3JUZRgBHwGZgjQpEewBomhFZrrxX_1550731029",
			"date_added": 1550989742
		},
		{
			"comment_id": 6,
			"body": "Well shit, the All Hub post I was using was incomplete or something. :/",
			"post_uri": "1DkFDJGJGQRA3mXaHkEZhkynzpZrkQEonM_1550989821",
			"date_added": 1550991763
		},
		{
			"comment_id": 7,
			"body": "I could never understand why TV is taxed just for being in the home, and not just if you use their services. Not sure if they do it, but I'm willing to bet they'd go as far as to tax you for having a broken TV in the home and no aerial...",
			"post_uri": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1551027198",
			"date_added": 1551028912
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1PedoHubPRhuSRoVHspoeuTVvzHHxLM7Wf",
			"auth_address": "1F9eZJsPgqKCpTJSStQrUdk22Qe3j8onFR",
			"user_name": "Pexo",
			"date_added": 1550990727
		}
	]
}