{
	"next_comment_id": 15,
	"user_name": "Colkurtz",
	"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
	"post_like": {
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1534841687": 1534865052,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1533430011": 1534901920,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1513775403": 1534902593,
		"136g9VcaPkqGPQas6uoh58NdWS3oEcqc75_1": 1534917584,
		"1BphMmzmrPc3zawVj6ES9va18a6PxJqb47_1536588259": 1536596474,
		"1BphMmzmrPc3zawVj6ES9va18a6PxJqb47_1542313325": 1542312693,
		"1BphMmzmrPc3zawVj6ES9va18a6PxJqb47_1542314519": 1542313261,
		"1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1545981842": 1545981676,
		"1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1545982014": 1545981682,
		"14ytAKDfNjArMTqGecTi7ginG3aZTsRAum_1548487448": 1548476825,
		"131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs_1554232264": 1554234423,
		"166aJtimRCe7bN2TLv2vdRnbsVQ6u1ewPH_1556119458": 1556130145,
		"12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1577799565": 1577816020
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Kaffie: The ZeroMe/Hub thing sounds AWESOME! That's how Internet social media should work. I want/need to do that. Do tell us. Mastodon is shit..💩 It's everything you hate about Facebook Twitter Etc censorship, on steroids. Mastodon is a fraud. Created and sponsored by the Mossad and IDF. Anyone who disagrees with those motherfucking racist cocksucker's is labeled a Nazi. See, I really need my own hubs..😱👍😀🗽",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1534841687",
			"date_added": 1534864927
		},
		{
			"comment_id": 2,
			"body": "I warned them repeatedly about their outrageous, unethical and unconstitutional censorship and violations of Human Rights. So I got banned too. They don't care, they're Wall Streets bitches, like every other commercial social media. Money corrupts, and big money corrupts absolutely. #Losers..👎",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1534841687",
			"date_added": 1534865835
		},
		{
			"comment_id": 3,
			"body": "@Vaerospace: if you haven't been banned on #Facebook or #Twitter then all you're posting is pablum and slapstick comedy. They love that kind of attention getting safe shit. If it's not something interesting and fun like pussy or art, then I don't have the time. Although I will call BULLSHIT!!! when I run across it. Like the thieves and murderers in historic #Palestine aka #Jews. And the cesspools of disease, addiction, sexual deviance and pedophilia aka gay homo faggots..👎😀  See, on #Zeronet I can't get banned for speaking the truth. Well, kinda..😂",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1534841687",
			"date_added": 1534879613
		},
		{
			"comment_id": 4,
			"body": "@Vaerospace: Well I don't know what nwo means. So maybe you're using so much code no one knows what you're talking about..😂",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1534841687",
			"date_added": 1534880777
		},
		{
			"comment_id": 5,
			"body": "@Kaffie: That was a good explanation, thank you..😀 Being able to clone a site and run your own hub is brilliant. I have run this configuration back and forth through my head for years, but @Nofish actually did it. He actually got it done. I think he's found the Holy Grail, and it will change everything. The possibilities are enormous. #Zeronet will expand the internet through creative Mesh networking and other modalities. Creative distributed data storage etc..👍😀",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1534841687",
			"date_added": 1534901514
		},
		{
			"comment_id": 6,
			"body": "@Anx: Yes..😀",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1534841687",
			"date_added": 1534914542
		},
		{
			"comment_id": 7,
			"body": "I'm not a racist either. But once again the world and especially Europe has a big Jewish problem. The (((Jews))) are the ones behind the mass invasion of Europe. Many have infiltrated your governments and pushed for uncontrolled mass migration. It's a distraction. They have done this many times throughout history with catastrophic consequences. WWI and WWII that horribly killed over a 100 million was in large part caused by Jewish treachery, treason and manipulations. The Bolshevik revolution was the result of the writings and subversive influence and meddling of Jew idiots like Carl Marx, Lennon and Trotsky (mental masturbator's). As a result of their corrupt stupidity they brought Stalin to power who killed over 40 million Russians. Nazism was in large part a reaction to Nasi-sm (\"Nasi\" is a Hebrew word for Jewish Prince!). The Jews want to distract from their theft and genocide in historic Palestine. They want to turn the holy lands into the ultimate perverse giant theme park, and charge the world for access and salvation. This past disgrace was the exact thing for which God in the countenance of Jesus Christ threw the money changers out of the temple for (cleansed the Temple), and disinherited the Jews. (((Jews))) are an evil malevolent cult. Europe must push back hard. Celebrate, support and encourage their own beautiful cultures, societies and race. Europeans represent the pinnacle of the civilized world, order, civility, rationality. It's a state of being the disordered psychopathic mind of the criminal (((Jew))) hates, and wants to destroy. The deranged always seek to destroy. That's my analysis. :-)",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1539174538",
			"date_added": 1539199195
		},
		{
			"comment_id": 8,
			"body": "@Swastika: The Holocaust was the 80 to 100 million that died horrible deaths in WWII. A war precipitated and caused by the (((Jew))) The Holocaust was not the tiny percentage of (((Jews))) who died. As usual, the Jews scammed the world. But the internet is helping get the truth out, and the (((Jews))) house of cards is falling HARD! (((Jews))) are the only creatures I know of stupid enough to think they can fuck with God and get away with it..",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1539174538",
			"date_added": 1539204891
		},
		{
			"comment_id": 9,
			"body": "@公共: If true you should seek professional help. As you know pedophilia is a terrible disease of the mind and body, and very bad. If you cant or wont seek help I think you should KILL!!! yourself right now. Blow your brains out with a gun. Jump off a building or a bridge. Jump in front of a train, take a drug overdose etc.. Just do it. I would consider anonymously funding a bounty for the extrajudicial SLAUGHTER!!! and KILLING!!! of pedophiles. Including those who exploit pedophilia for personal gain of any kind (religious, social, legal etc..), including just dumb motherfuckers who attempt to exploit pedophilia for fun or profit. But I would never censor you online. #JustSaying :-)",
			"post_uri": "13BRGFtvaQ4ERHh8vtYMZC1mK4FaeSBvvw_1540240895",
			"date_added": 1540250603
		},
		{
			"comment_id": 10,
			"body": "Lol you don't have a right to exist, and you're not a human being. You're a rabid animal. Professionals might be able to salvage you, but probably not. I think the risk is too great. If you wont kill yourself, you should be euthanized. Double tap. You know I'm right. Do it. :-)",
			"post_uri": "13BRGFtvaQ4ERHh8vtYMZC1mK4FaeSBvvw_1540256837",
			"date_added": 1540258464
		},
		{
			"comment_id": 11,
			"body": "Why haven't you killed yourself yet. You must be suffering. You're such a terrible vile creature. Think of the children. Kill! yourself. Think about it. Dream about it. You can do it. Hang yourself from a door knob. Come on people. Show some character and spine. Help and encourage this vile piece of shit, this child abuser, molester, exploiter and rapist to snuff himself. #Pussies",
			"post_uri": "13BRGFtvaQ4ERHh8vtYMZC1mK4FaeSBvvw_1540240895",
			"date_added": 1540329233
		},
		{
			"comment_id": 12,
			"body": "What a Brilliant! Goddess she has been.. :-)",
			"post_uri": "1BphMmzmrPc3zawVj6ES9va18a6PxJqb47_1542313325",
			"date_added": 1542312981
		},
		{
			"comment_id": 13,
			"body": "Yes!.. :-)",
			"post_uri": "1BphMmzmrPc3zawVj6ES9va18a6PxJqb47_1542314519",
			"date_added": 1542313303
		},
		{
			"comment_id": 14,
			"body": "I'm hoping for the day when you can pay with Bitcoin, and escrow paying half now. And the other half when the work passes its warranty..😁",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1562329760",
			"date_added": 1562383964
		}
	]
}