{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1541734454,
			"title": "ZeroNet SDK for Android",
			"body": "Is it possible to use ZeroNet mechanism in android apps",
			"added": 1541734453
		},
		{
			"topic_id": 1541833193,
			"title": "Cryptocurrency wallet and payment system in ZeroNet",
			"body": "Why there is no zerowallet or something like that.\nZeroNet's own Cryptocurrency can also fund the project.",
			"added": 1541833191
		},
		{
			"topic_id": 1550907964,
			"title": "An MMORPG in ZeroNet : DeVerse",
			"body": "Is it possible to create a decentralised MMORPG in ZeroNet? If anyone has any better name, let me know",
			"added": 1550907961
		},
		{
			"topic_id": 1550937666,
			"title": "ZeroNet vs SAFE Network",
			"body": "Which one is better I was wondering?",
			"added": 1550937662
		},
		{
			"topic_id": 1550997628,
			"title": "A farm is nothing without sheeps",
			"body": "Users are crucial for a platform to succeed. If a platform has no users then good developers won't develop quality apps for the platform & users won't join the platform as there are no quality apps in it. ZeroNet is facing a similar kind of problem. I have tried to persuade my friends & family to use ZeroNet but they say that it's too complex & time consuming to use. ItsI not enough user friendly like the normal internet. The ZeroNet Android client is horrible & barely usable. I can't even understand whether ZeroNet is running or not. The platform also lacks enough quality zites.\n\nIn my opinion, the only zites that I like are ZeroTalk, IFS & Git Center. I believe ZeroNet can be something more than just a proof of concept. I can suggest some innovations here on ZeroTalk which can be helpful for normal users or sheeps",
			"added": 1550997623
		}
	],
	"topic_vote": {
		"1541648221_1DJqae3bJR9Dz7f5QryWXywv92Jqm3z9y": 1,
		"1541734454_19HaBBc1M3usmLxayEasbaTkeZ3Ttr25gD": 1,
		"1541833193_19HaBBc1M3usmLxayEasbaTkeZ3Ttr25gD": 1,
		"1550907964_19HaBBc1M3usmLxayEasbaTkeZ3Ttr25gD": 1,
		"1550937666_19HaBBc1M3usmLxayEasbaTkeZ3Ttr25gD": 1,
		"1550997628_19HaBBc1M3usmLxayEasbaTkeZ3Ttr25gD": 1,
		"1551618955_163wft59zLGW1zNA6WBsppjFEbXxAfAseY": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1550997628_19HaBBc1M3usmLxayEasbaTkeZ3Ttr25gD": [
			{
				"comment_id": 1,
				"body": "We also need some proper marketing. Hashtags in popular social media sites may work.\nMaintaining an active ZeroNet YouTube channel will help too.",
				"added": 1551024275
			},
			{
				"comment_id": 2,
				"body": "#zerofy_the_internet maybe??",
				"added": 1551024463
			},
			{
				"comment_id": 3,
				"body": "> [randomshits](#comment_11_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): To be fair, I really don't like the socially engineered idea that I need to be on some 'farm' in the first place. [...]\n\nCommunity owned farm maybe?\nOr an online democracy\nBoth need users or sheeps",
				"added": 1551024580
			},
			{
				"comment_id": 4,
				"body": "> [randomshits](#comment_12_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Marketing Zeronet will be a risky attempt. All the vulnerabilities and ugliness of the zeronet's deep network will be emphasised in the largest smear campaign ever. It would be foolish to expect the power holders to let go of their reigns of ownership, control, and censorship without a push back.\n\nEvery kingdom gets destroyed and only the best arises to power",
				"added": 1551025096
			}
		]
	},
	"comment_vote": {
		"558_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"5_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1
	}
}