{"next_paste_id":1,"next_comment_id":0,"paste":[{"paste_id":0,"description":"BIBLIOGRAFIA","body":" Allen, Robert C (2003). Farm to Factory: A Reinterpretation of the Soviet Industrial Revolution, Princeton University Press, 2003.\n\nApplebaum, Binyamin (2012). “A shrinking military budget may take neighbours with it”, The New York Times, January 6, 2012.\n\nBlock, Fred and Keller, Matthew R (2008). “Where do innovations come from? Transformations in the U.S. national innovation system, 1970-2006,” Technology and Innovation Foundation, July 2008. http://www.itif.org/files/Where_do_innovations_come_from.pdf\n\nBlum, William (1995). Killing Hope: U.S. Military Interventions since World War II, Common Courage Press, 1995.\n\nCanadian Centre for Policy Alternatives (2011). “Hennessy’s Index”, February, 2011.\n\nEnglund, Will (2011). “Gorbachev in London: Credit, no cash”, The Washington Post, July 16, 2011.\n\nGladstone, Rick (2012). “U.N. presents grim prognosis on the world economy,” The New York Times, December 18, 2012.\n\nGorbachev, Mikhail (1988). Perestroika: New Thinking for Our Country and the World, Harper & Row.\n\nGorbachev, Mikhail (2011). “Is the world really safer without the Soviet Union?” The Nation, December 21, 2011.\n\nHobsbawm, Eric (1994). Age of Extremes: The Short Twentieth Century, 1914-1991, Abacus, 1994.\n\nIzvestiya (1986). “Chance missed, search continues”, October 17, 1986, cited in Schweizer, 1994.\n\nKeeran, Roger and Kenny, Thomas (2004). Socialism Betrayed: Behind the Collapse of the Soviet Union, International Publishers, New York, 2004.\n\nKotz, David M (2000). “Socialism and Capitalism: Lessons from the Demise of State Socialism in the Soviet Union and China,” in Socialism and Radical Political Economy: Essays in Honor of Howard Sherman, edited by Robert Pollin, Cheltenham and Northampton: Edward Elgar, 2000, 300-317.\n\nKotz, David M (2003). “Socialism and Global Neoliberal Capitalism”, Paper written for the International Conference: The Works of Karl Marx and Challenges for the XXI Century, Havana, Cuba, May 5-8, 2003.\n\nKotz, David M (2008). “What Economic Structure for Socialism?” Paper written for the Fourth International Conference “Karl Marx and the Challenges of the XXI Century, Havana, May 5-8, 2008.\n\nKotz, David M (2011). “The Demise of the Soviet Union and the International Socialist Movement Today”. Paper written for the International Symposium on the 20th Anniversary of the Former Soviet Union and its Impact, Beijing, April 23, 2011.\n\nKotz, David with Fred Weir (1997). Revolution From Above: The Demise of the Soviet System, Routledge, 1997.\n\nLeffler, Melvyn P (1994). The Specter of Communism: The United States and the Origins of the Cold War, 1917-1953, Hill and Wang, 1994.\n\nLerouge, Herwig (2010). “How the October Revolution and the Soviet Union contributed to the labour movement in Western Europe, and more particularly in Belgium”, Belgium Works Party, May 05, 2010.\n\nMazzucato, Mariana (2011). The Entrepreneurial State, Demos, 2011 http://www.demos.co.uk/files/Entrepreneurial_State_-_web.pdf?1310116014\n\nMiliband, Ralph (1989). Divided Societies: Class Struggle in Contemporary Capitalism, Oxford University Press, 1989.\n\nMilne, Seumas (2012). “Budget 2012: George Osborne is stuck in a failed economic model, circa 1979,” The Guardian (UK), March 20, 2012.\n\nMurphy, Austin (2000). The Triumph of Evil: The Realities of the USA’s Cold War Victory, European Press Academic Publishing, 2000.\n\nParenti, Michael, (1997). Blackshirts & Reds: Rational Fascism and the Overthrow of Communism, City Light Books, 1997.\n\nRoberts, Geoffrey (1999). The Soviet Union in World Politics: Coexistence, Revolution and Cold War, 1945-1991, Routledge, 1999.\n\nSchweizer, Peter (1994). Victory: The Reagan Administration’s Secret Strategy that Hastened the Collapse of the Soviet Union, The Atlantic Monthly Press, New York, 1994.\n\nShanker, Thom (2012). “Study predicts future for U.S. as No. 2 economy, but energy independent”, The New York Times, December 10, 2012\n\nSherman, Howard J (1969). The Soviet Economy, Little, Brown and Company, 1969.\n\nSilber, Irwin (1994). Socialism: What Went Wrong? An Inquiry into the Theoretical and Historical Sources of the Socialist Crisis, Pluto Press, 1994\n\nStalin, J.V., Works, Foreign Languages Publishing House, 1954, vol. 9, pp. 28-29. Report delivered at the 7th enlarged Plenum, December, 1926.\n\nSzymanski, Albert (1979). Is the Red Flag Flying? The Political Economy of the Soviet Union Today, Zed Press, London, 1979.\n\nSzymanski, Albert (1984). Human Rights in the Soviet Union, Zed Books Ltd, London, 1984.\n\nWalker, Marcus and Kakaounaki, Marianna (2012). “Struggles mount for Greeks as economy faces winter,” The Wall Street Journal, December 18, 2012.\n\n\n* ''Uma agricultura primitiva, de baixa produtividade (tanto em termos de rendimentos por hectare quanto de produtividade por trabalhador), é incapaz de produzir um excedente de alimentos para atender às necessidades de uma população urbana crescente e de oferecer matérias primas agrícolas necessárias às industriais.'' (SACHS, Ignacy. Desenvolvimento: includente, sustentável, sustentado. Rio de Janeiro: Garamond, 2008, pp.77-78)\n","language":"text/plain","encrypted":false,"added":1588543579}],"comment":[]}