{"cert_user_id": "JeremyRand@github", "next_comment_id": 46, "comment": {"1604064856_mirrored_n3r0-ch_github": [{"comment_id": 1, "body": "I would highly recommend placing the `TXT` records at a designated subdomain (perhaps `_zero`), i.e. a `TXT` record at `_zero.sub.example.org` would correspond to a user-visible address of `sub.example.org`.  This makes it more feasible to control permissions for ZeroNet separately from IP address records; it's what `TLSA` records do for this reason.\r\n\r\nAlso, Namecoin supports `TXT` records, so it would be theoretically possible to unify the Namecoin and DNS support in ZeroNet, which would have benefits.  Namecoin's onion service support takes this approach (`.onion` domains are specified in a `TXT` record, so Namecoin and DNS use the same spec.)", "added": 1585825901, "modified": 1585825975, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/104#issuecomment-607870718", "source_type": "github"}], "1604065247_mirrored_up4_github": [{"comment_id": 2, "body": "Hi @HelloZeroNet,\r\n\r\nFYI the decentralized SPV client that @cassiniNMC talked to you about at GETD#4 is [released in beta](https://namecoin.org/2016/10/23/lightweight-spv-lookups-beta.html).  The mode that Cassini discussed with you is `leveldbtxcache`.\r\n\r\nThe main reason it's classified as \"beta\" is that not many people have used it in production, so we just don't have a strong basis for knowing if there are any issues -- maybe that's where you can come in?\r\n\r\nCheers!", "added": 1485654294, "modified": 1485654294, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/407#issuecomment-275893685", "source_type": "github"}], "1604065597_mirrored_iskradelta_github": [{"comment_id": 3, "body": "@iskradelta:\r\n\r\n> On another topic, in a another discussion, ZeroNet seems to be using TLS for peer-to-peer communication, which is MITMable because there is no Central Authority (of course). (Maybe wrong information?) Blockcerts and maybe storing certificates in namecoin would solve that problem, so p2p connections would be really TLS with mitm prevention?\r\n\r\nTLS with self-signed certificates is already secure against passive attackers.  CA's and Namecoin are designed to protect against active attackers in cases where you are trying to connect to a specific identity; this is not the case with most P2P networks.  Trying to protect against MITM attacks when you don't know who your TLS peer is, is AFAIK an impossible problem (and also one that Tor onion services don't attempt to solve).", "added": 1485653634, "modified": 1485653634, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/686#issuecomment-275893396", "source_type": "github"}], "1604065607_mirrored_mechnotech_github": [{"comment_id": 4, "body": "> Namecoin does suffer a bit from that, the full node is too fat, and the thin clients are not yet existent, or suffer from trusting a central server too much.\r\n\r\nThat is incorrect; Namecoin has an SPV client (based on BitcoinJ/libdohj) that does not use any central servers (unless you're referring to DNS seeds, which are only used for network bootstrapping).  @cassiniNMC talked to Tamas about this months ago.\r\n\r\nAs an aside, it is an intentional design decision of Namecoin to not process the DNS protocol in Namecoin Core, because doing so would make sandboxing substantially less effective, which would be damaging to security.  I'm curious whether Emercoin ever considered that problem when they designed their system.", "added": 1483798875, "modified": 1483798875, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/695#issuecomment-271096749", "source_type": "github"}], "1604066582_mirrored_anoadragon453_github": [{"comment_id": 5, "body": "Is this still reproducible today?  What are the values of `origin_a` and `origin_b` when this occurs?  Is it secure for two different `.bit` ZeroNet sites to be recognized as the same origin?", "added": 1585826190, "modified": 1585826303, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1452#issuecomment-607873421", "source_type": "github"}], "1604067061_mirrored_JeremyRand_github": [{"comment_id": 6, "body": "@rllola using an empty string as a map key is technically allowed in Namecoin, but has been deprecated for years and I don't see any reason for ZeroNet to support that syntax.  The preferred syntax for your example would be:\r\n\r\n~~~\r\n{\r\n    \"zeronet\":\"19rXKeKptSdQ9qt7omwN82smehzTuuq6S9\",\r\n    \"map\": {\r\n        \"staging\": {\"zeronet\":\"1MzSDy3x8cFrt3P2YkXNN7ogYDFfKX6hnP\"}\r\n    }\r\n}\r\n~~~\r\n\r\nAlso note that it's totally possible for recursive maps to be used, i.e. a subdomain's JSON object can itself include a `\"map\"` field.\r\n\r\nBesides those details, looks like you're on the right track.  Thanks for helping with this!", "added": 1546942821, "modified": 1546942821, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1843#issuecomment-452295547", "source_type": "github"}], "1604067323_mirrored_filips123_github": [{"comment_id": 7, "body": "It's not necessarily my business which naming systems you want to use, but please do reach out to me if there are deficiencies in Namecoin that you perceive as relevant to a desire to use other naming systems.  There's historically been an unfortunate lack of communication between ZeroNet and Namecoin (other than the quite-productive discussions that happen whenever we run into each other at conferences), and I'd definitely like to improve that situation.  I can't fix issues if I don't know they exist.", "added": 1585825569, "modified": 1585825644, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2049#issuecomment-607867694", "source_type": "github"}], "1604067617_mirrored_krixano_github": [{"comment_id": 8, "body": "Hello.  I hereby relicense my contributions to this repo under GPLv3+.  I'm happy to provide an OpenPGP-signed statement to that effect if you request it.", "added": 1572768554, "modified": 1572768554, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2269#issuecomment-549125963", "source_type": "github"}, {"comment_id": 9, "body": "@0x6a73 It looks like in another issue (which I won't link to since that issue is a shitshow), you said something about the patent-related provisions in GPLv3 being potentially objectionable.  Any chance you could elaborate on that point?  This is a new concern to me, and I'm curious what info you can provide.", "added": 1572769538, "modified": 1572769538, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2269#issuecomment-549127098", "source_type": "github"}, {"comment_id": 10, "body": "As an aside, not to put pressure on you guys, but we're intending to apply for funding from NLnet regarding Namecoin improvements that are targeted at improving ZeroNet integration (I haven't spoken to Tamas about this yet, but will soon), and license issues are almost definitely something that NLnet will want resolved prior to awarding funds, and probably even prior to committing funding to a project.  So, I do hope that these issues can be worked out as soon as reasonably achievable.", "added": 1572769852, "modified": 1572769852, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2269#issuecomment-549127513", "source_type": "github"}, {"comment_id": 11, "body": "> @JeremyRand As far as I know, GPLv2 doesn't allow ZeroNet to be used in patents, while GPLv3 allows that. That's why @HelloZeroNet has expressed his lack of approval for switching to GPLv3. Here's a quote from that thread addressing that issue:\r\n> \r\n> > Antifa: Upgrading to GPLv3 allows me and anyone else to use ZeroNet in patents if we wish and the current GPLv2 is a threat against me and others from Hungary.\r\n> > krixano: This is why I oppose GPLv3. Patents are aweful and disgusting. So, if there's any way we can remove this \"upgrade to v3\" ability, I'll support it.\r\n\r\n@0x6a73 I'm almost certain that this is bullshit from the troll account and that GPLv3 doesn't do what he's insinuating, but lemme look into it more closely and I'll get back to you.", "added": 1572769929, "modified": 1572769929, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2269#issuecomment-549127611", "source_type": "github"}, {"comment_id": 12, "body": "@0x6a73 AFAICT he's probably referencing this: https://www.gnu.org/licenses/gpl-faq.html#v3PatentRetaliation\r\n\r\n> Does GPLv3 have a “patent retaliation clause”?\r\n> \r\n> In effect, yes. Section 10 prohibits people who convey the software from filing patent suits against other licensees. If someone did so anyway, section 8 explains how they would lose their license and any patent licenses that accompanied it.\r\n\r\nWhich, AFAICT, means that GPLv3 is actually better than GPLv2 if you oppose software patents.", "added": 1572770254, "modified": 1572770254, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2269#issuecomment-549127941", "source_type": "github"}, {"comment_id": 13, "body": "> @JeremyRand Thanks for clarifying. Still, it might be a problem to relicense the whole project to GPLv3 due to commiters whose accounts are deleted or dead, as they have to state their will for the change to GPLv3 too. If there's a solution to that problem though, I have no problems with switching to GPLv3 then.\r\n\r\n@0x6a73 I mean, if I were you, I'd first try to contact the relevant contributors before spending too much effort on this.  There's a good chance that most of the contributors will be fine with a relicense and are reachable either via GitHub ping or via the email address in their Git commits' metadata.  Once you have a better knowledge of how much code would potentially have to be re-written in order to licence to GPLv3, then you can make much more informed and useful decisions than is possible right now.\r\n\r\nAlso, I'd recommend that if project leadership wants to switch to GPLv3 in the future, you should at least require newly contributed code to be licensed under both GPLv2 and GPLv3, so that the problem doesn't grow over time as you try to re-implement whatever code is needed.", "added": 1572770732, "modified": 1572771164, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2269#issuecomment-549128550", "source_type": "github"}, {"comment_id": 14, "body": "@0x6a73  More specifically: A GitHub account may be dead, but the email address in the Git commit metadata may still be reachable.", "added": 1572771110, "modified": 1572771110, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2269#issuecomment-549129013", "source_type": "github"}, {"comment_id": 15, "body": "For reference for anyone still wondering about patent issues in GPLv3:  (CC: @0x6a73 )\r\n\r\nhttps://www.gnu.org/licenses/quick-guide-gplv3.html says:\r\n\r\n> Stronger Protection Against Patent Threats\r\n> \r\n> In the 17 years since GPLv2 was published, the software patent landscape has changed considerably, and free software licenses have developed new strategies to address them. GPLv3 reflects these changes too. Whenever someone conveys software covered by GPLv3 that they've written or modified, they must provide every recipient with any patent licenses necessary to exercise the rights that the GPL gives them. In addition to that, if any licensee tries to use a patent suit to stop another user from exercising those rights, their license will be terminated.\r\n> \r\n> What this means for users and developers is that they'll be able to work with GPLv3-covered software without worrying that a desperate contributor will try to sue them for patent infringement later. With these changes, GPLv3 affords its users more defenses against patent aggression than any other free software license.\r\n\r\nhttps://www.gnu.org/licenses/rms-why-gplv3.html also says:\r\n\r\n>  Another threat that GPLv3 resists is that of patent deals like the Novell-Microsoft pact. Microsoft wants to use its thousands of patents to make users pay Microsoft for the privilege of running GNU/Linux, and made this pact to try to achieve that. The deal offers rather limited protection from Microsoft patents to Novell's customers.\r\n> \r\n> Microsoft made a few mistakes in the Novell-Microsoft deal, and GPLv3 is designed to turn them against Microsoft, extending that limited patent protection to the whole community. In order to take advantage of this protection, programs need to use GPLv3.\r\n> \r\n> Microsoft's lawyers are not stupid, and next time they may manage to avoid those mistakes. GPLv3 therefore says they don't get a “next time”. Releasing a program under GPL version 3 protects it from Microsoft's future attempts to make redistributors collect Microsoft royalties from the program's users.\r\n> \r\n> GPLv3 also provides users with explicit patent protection from the program's contributors and redistributors. With GPLv2, users rely on an implicit patent license to make sure that the company which provided them a copy won't sue them, or the people they redistribute copies to, for patent infringement.\r\n> \r\n> The explicit patent license in GPLv3 does not go as far as we might have liked. Ideally, we would make everyone who redistributes GPL-covered code give up all software patents, along with everyone who does not redistribute GPL-covered code, because there should be no software patents. Software patents are a vicious and absurd system that puts all software developers in danger of being sued by companies they have never heard of, as well as by all the megacorporations in the field. Large programs typically combine thousands of ideas, so it is no surprise if they implement ideas covered by hundreds of patents. Megacorporations collect thousands of patents, and use those patents to bully smaller developers. Patents already obstruct free software development.\r\n> \r\n> The only way to make software development safe is to abolish software patents, and we aim to achieve this some day. But we cannot do this through a software license. Any program, free or not, can be killed by a software patent in the hands of an unrelated party, and the program's license cannot prevent that. Only court decisions or changes in patent law can make software development safe from patents. If we tried to do this with GPLv3, it would fail.\r\n> \r\n> Therefore, GPLv3 seeks to limit and channel the danger. In particular, we have tried to save free software from a fate worse than death: to be made effectively proprietary, through patents. The explicit patent license of GPLv3 makes sure companies that use the GPL to give users the four freedoms cannot turn around and use their patents to tell some users, “That doesn't include you.” It also stops them from colluding with other patent holders to do this.\r\n\r\nThe tl;dr is that, indeed, the GPLv3 is better than GPLv2 if you oppose software patents.", "added": 1572772265, "modified": 1572772265, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2269#issuecomment-549130428", "source_type": "github"}], "1604067608_mirrored_ZeroNetTickBot_github": [{"comment_id": 16, "body": "It's not clear to me why both of the following are listed:\r\n\r\n* GPLv3+ if you accept switching to GPLv3 or later\r\n* GPLv3 if you accept switching to either GPLv3 or later or to GPLv3-only\"\r\n\r\nBoth of these are legally equivalent, because any software that is licensed under GPLv3+ (3 or later) can be re-licensed under GPLv3 (3 only) without any further authorization from the copyright holder.\r\n\r\nAre you intending to overload this poll by simultaneously asking what licenses the authors' work is under, *and* asking what licenses the author politely recommends that the ZeroNet maintainers relicense it under?  Because that seems like a bad combination of things to put into a single poll.", "added": 1573057211, "modified": 1573057211, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-550460782", "source_type": "github"}, {"comment_id": 17, "body": "> > It's not clear to me why both of the following are listed:\r\n> > GPLv3+ if you accept switching to GPLv3 or later\r\n> > GPLv3 if you accept switching to either GPLv3 or later or to GPLv3-only\"\r\n> \r\n> the difference is that when specifically voting GPLv3+, you are saying you do not want a GLPv3-only license, where the other means you'd be fine relicensing to GPLv3-only or GPLv3+\r\n> sure, a GPLv3+ repo can be relicensed later to GPLv3-only, but at the least the current version could be forked into a GPLv4 version if that happened. in a GPLv3-only repo, there's no way to go back, even using older commits, so the difference is whether being able to go to GPLv4 at all matters to you\r\n\r\n@skwerlman I think you are missing my point.  I am not asking about the difference between GPLv3-only and GPLv3+; that difference is obvious.  I am asking why you have a 3rd option, which says both GPLv3-only and GPLv3+ are fine, when that 3rd option is legally identical to GPLv3+.", "added": 1573059211, "modified": 1573059211, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-550473975", "source_type": "github"}, {"comment_id": 18, "body": "@krixano Could you please clarify why you posted the following and then deleted it?\r\n\r\n> This vote is **very clearly** only about the latter. I don't know how you thought the former was even a think... it doesn't make *any* sense.\r\n\r\n", "added": 1573059317, "modified": 1573059317, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-550474682", "source_type": "github"}, {"comment_id": 19, "body": "> How about give people the benefit of the doubt? Whether GPLv3+ is equivalent to GPLv3 is irrelevant. We wanted to make sure there was as many options as possible because we shouldn't be shoehorning people's votes - are you suggesting that we be dishonest by limiting peoples choices? That's illegal, btw.\r\n\r\n@krixano If you're trying to tell me that it's dishonest and illegal to not list duplicate options, then I honestly don't know how to respond to that claim.  If you're instead trying to say that you think there is actually a difference between the two options I asked about, I'd appreciate it if you could explain what you think that difference is instead of making vague scary references to illegality.\r\n\r\n(I get that you may be in a touchy mood because of people who aren't me, but I'd really appreciate it if you not take that out on me; I'm here to help, not get into a fight.)", "added": 1573059644, "modified": 1573059644, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-550476799", "source_type": "github"}, {"comment_id": 20, "body": "> I'm telling you it's dishonest to limit people's choices. Secondly, you're trying to claim that having duplicate options is \"overloading\" a poll and it seems to me you are alluding to bad intentions.\r\n\r\nWhat allusion to bad intentions are you referencing?  I have no idea what you mean here.\r\n\r\nAn \"overloaded poll\" has a straightforward definition; it's a single poll question that is designed to determine the answer to more than one question.  It's usually considered poor poll design.  There's nothing in what I said that's related to bad intentions.  My assumption is that there was no bad intention, just that whoever wrote the poll didn't understand how relicensing of GPLv3+ to GPLv3-only works.", "added": 1573059903, "modified": 1573059903, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-550478490", "source_type": "github"}, {"comment_id": 21, "body": "> You said \"**intending** to overload the poll\". As far as I'm aware, \"intending\" implies the person wanted to overload the poll on purpose.\r\n\r\n@krixano My wording doesn't imply any accusation of malice.  I was asking whether the poll was designed to answer 2 questions (the licenses that the author agrees to license their own work under, and what licenses the author politely recommends that the ZeroNet devs relicense it to), which would suggest that the poll author might be making a mistake by combining them into a single question, or if it was only intended to answer the former question (which would suggest that the poll author might be making a mistake about how relicensing works).  I'm sorry if you inferred that there was an accusation of malice there, but I was not suggesting that any malice was at play.", "added": 1573060208, "modified": 1573060208, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-550480247", "source_type": "github"}, {"comment_id": 22, "body": "@krixano Also, I don't know if this is the case, but I hope you're not letting the resident troll succeed at instigating tensions between us.  I assume that's his goal; I'm not interested in taking his bait.", "added": 1573060409, "modified": 1573060409, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-550481383", "source_type": "github"}, {"comment_id": 23, "body": "> Ok, fine. But you questioning me deleting part of my comment felt like an attack.\r\n\r\n@krixano I genuinely wasn't sure why it was deleted.  The part that you deleted read to me like an attack on me, but rather than reply in a hostile manner, I preferred to ask why it was deleted.  You said that you misunderstood me, and so I dropped the topic.  I'm not looking for a fight here.\r\n\r\n> Anyways, as I said previously, I think both questions _are the same_:\r\n> \r\n> > Are you saying that a person who wants an open source project to relicence to a specific license won't allow their contributions to match that license? Does that even make any sense?\r\n> > The poll is about you relicensing your contributions so that ZeroNet can be relicensed as a whole. If a person suggests a different license for ZeroNet but then doesn't release their contributions under that same license, then isn't that precisely equivalent to not wanting ZeroNet to relicense?\r\n\r\nThe questions are related but not identical.  Specifically, a user can license their own work under a superset of the licenses that they are recommending that ZeroNet choose to use.  That's the point I was trying to convey (and it empirically appears that I did not do a good job of explaining this): the overloaded interpretation of the poll question looked to me like this:\r\n\r\n* \"GPLv3\": I agree to license my own contributions under GPLv3+, but I politely recommend that ZeroNet choose to relicense them under GPLv3-only.  EDIT: Or, I don't have any preference between GPLv3+ and GPLv3-only.\r\n* \"GPLv3+\": I agree to license my own contributions under GPLv3+, and I politely recommend that ZeroNet choose to keep them under GPLv3+ in whatever work they do.\r\n\r\nBoth of these options are legally equivalent in terms of what ZeroNet's maintainers are *authorized* to do without infringing copyright.  They are different in terms of what the author is *recommending* that ZeroNet maintainers do, which is solely up to the ZeroNet maintainers.  That's why I asked about whether this was an overloaded poll question -- these are both very valid questions to be asking (what can ZeroNet legally do, and what is ZeroNet recommended to do), but it wasn't clear to me if the question was intended to cover both of them, or if there was some confusion about whether GPLv3+ code can be re-licensed to GPLv3-only.\r\n\r\nDoes that make more sense?", "added": 1573061011, "modified": 1573061121, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-550484870", "source_type": "github"}, {"comment_id": 24, "body": "> Actually, I'm not sure whether the GPLv3+ option allows us to license contributions under GPLv3-only. I thought that ZeroNet is not a work derived from contributions, _but_ contributions are a part of ZeroNet. So if contributors force us to use GPLv3+, we'll have to license ZeroNet under GPLv3+ as well so people would be able to distribute/use ZeroNet under e.g. GPLv4.\r\n\r\n@imachug Okay, so it does sound like there is some confusion here.\r\n\r\nIt is completely okay to use GPLv3+-licensed code in a GPLv3-only project.  In the same way, old Firefox code was licensed under both GPLv2 and MPLv1, but it was fine to use that code under your choice of either of the two licenses.  The end result will be that the GPLv3+-licensed contributions can be reused in GPLv4 projects, but the combined work of the GPLv3+-licensed contributions with the GPLv3-only-licensed contributions is only usable under GPLv3.  The important point here is that the contributor only has direct control over their contributions' license; the project maintainers can re-license the combined work it to any compatible license if they want to (re-licensing GPLv3+ to GPLv3-only is a compatible re-licensing), and they don't need the contributors' consent to do so (the licenses' compatibility implies consent), though they can definitely ask for their opinion.", "added": 1573061568, "modified": 1573061568, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-550488264", "source_type": "github"}, {"comment_id": 25, "body": "> > Both of these options are legally equivalent in terms of what ZeroNet's maintainers are authorized to do without infringing copyright.\r\n> \r\n> this is not exactly correct. with a GPLv3+ vote, the code can ONLY be relicensed (in the initial relicensing commit) to GPLv3+. this guarantees a checkpoint that we can use to advance to v4 if wanted. with a GPLv3 vote, that checkpoint is not guaranteed, since the initial commit can be GPLv3-only\r\n\r\n@skwerlman That is incorrect.  GPLv3+ code can be relicensed to GPLv3-only.  The converse does not hold, i.e. GPLv3-only code cannot be relicensed to GPLv3+ code.", "added": 1573061677, "modified": 1573061677, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-550488887", "source_type": "github"}, {"comment_id": 26, "body": "By the way, since it's a bad idea to trust random people on the Internet (even nice people like me), here's a citation. https://www.gnu.org/licenses/gpl-faq.html#AllCompatibility\r\n\r\nNote the 1st column, 2nd row of the table, where it says that GPLv2+ code can be copied into GPLv2-only code.  (v3 and v2 behave the same way here; it's the \"or later\" clause that's important.)", "added": 1573062243, "modified": 1573062243, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-550492430", "source_type": "github"}, {"comment_id": 27, "body": "> caryoscelus saw a problem in the other poll, but he did it early enough that I was able to restart the poll, but it's kinda hard to restart the poll now, isn't it?\r\n\r\n@krixano I don't see any reason to restart the poll over this; I simply was looking for clarification on whether my vote was implicitly answering two questions (i.e. whether it's a recommendation to what I'd like the ZeroNet maintainers to do) or a single question (in which I can just pick either of them since they're equivalent).", "added": 1573062386, "modified": 1573062386, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-550493288", "source_type": "github"}, {"comment_id": 28, "body": "> ok, i see where i was wrong. i was thinking it was the repo relicensing when actually its the individual commiters relicensing, so there's no commit tied to their choice, and therefore no checkpoint\r\n> \r\n> +1 for the link; i hadnt seen it before\r\n\r\n@skwerlman No worries man.  This shit is complicated.  Alas, law isn't easy.  One of the reasons I'm not a lawyer.  :) ", "added": 1573062510, "modified": 1573062510, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-550493995", "source_type": "github"}, {"comment_id": 29, "body": "> @JeremyRand The problem that I'm seeing now is that the way we wrote the issue suggests that we are talking about what a person would like ZeroNet maintainers to do, but the intention should really be that you are relicensing your contributions. Idk....\r\n\r\n@krixano In my totally-not-legal-advice opinion, giving permission for a 3rd  party to license your work under a given license is mostly equivalent to re-licensing that work yourself.  There is arguably a difference in the sense that I can distribute my code to 2 people under 2 different licenses, and each person is bound by a different license, and whoever they distribute it to is bound by whatever license the person whom they got it from was bound by.  But this distinction is basically meaningless in this case, so I wouldn't worry about it.\r\n\r\nBut yes, it is totally possible (and, I would argue, reasonable) for the ZeroNet maintainers to ask contributors to (1) state what licenses the ZeroNet maintainers are legally allowed to use, and (2) state a polite non-binding recommendation of which subset of (1) they'd like ZeroNet to go with.  I think combining these two questions into a single question isn't ideal.  But, since (1) is by far the most important, and (1) is the main question being asked in this poll, my opinion is that we're fine, and anyone who wants to answer (2) can do so informally in a free-form comment.  After all, since (2) is a recommendation, it may be that the ZeroNet maintainers will want to take argumentation/reasoning into account rather than just tallying votes, since it's ultimately up to the ZeroNet maintainers what to do with respect to (2).", "added": 1573062992, "modified": 1573062992, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-550496773", "source_type": "github"}, {"comment_id": 30, "body": "> Ok... I just worry that when people voted they might have misunderstood what the poll was about and I don't want to count the votes for people who didn't answer the _intended_ question but answered the question they interpreted.\r\n\r\n@krixano Well, look at it this way.  If they accidentally voted for a recommended license instead of a permitted license, then the only harm that's been done is that ZeroNet maintainers might have fewer choices about what license they can pick.  The recommended licenses are strictly a subset-or-equal set to the permitted licenses, so I don't think there's any risk of accidentally committing a license violation due to the confusion.  Unless the ZeroNet maintainers decide that they *really* want to have more freedom than the final vote tally gives them, I don't think it's worth pestering the contributors to re-cast a vote.", "added": 1573063535, "modified": 1573063535, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-550500082", "source_type": "github"}, {"comment_id": 31, "body": "Since I guess we're now on the same page about what the votes mean, I guess I'll vote now.  :) ", "added": 1573064488, "modified": 1573064488, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-550505681", "source_type": "github"}, {"comment_id": 32, "body": "GPLv3+", "added": 1573064495, "modified": 1573064495, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-550505720", "source_type": "github"}, {"comment_id": 33, "body": "And, my polite non-binding recommendation is that keeping it as GPLv3+ is better than re-licensing to GPLv3-only.", "added": 1573064611, "modified": 1573064611, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-550506404", "source_type": "github"}, {"comment_id": 34, "body": "> And, my polite non-binding recommendation is that keeping it as GPLv3+ is better than re-licensing to GPLv3-only.\r\n\r\nBut, given that GPLv3-only has a pretty large number of votes, it is entirely possible that the ZeroNet maintainers will decide that ignoring my recommendation is a desirable move since it allows them to avoid rewriting lots of code.  I wouldn't fault them for such a decision.", "added": 1573065093, "modified": 1573065093, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-550509399", "source_type": "github"}, {"comment_id": 35, "body": "As an aside, it's been a while since I looked at the Mozilla 95% decision, but my understanding is that the 95% figure means that you can relicense code whose developers are *unreachable* if it's less than 5% of the total codebase.  If a developer *is* reachable and explicitly says they don't consent to a relicense, then their code cannot be relicensed regardless of the 95% rule [1].\r\n\r\nIf it looks like the details of this topic will matter to ZeroNet, feel free to let me know and I'll try to double-check whether my understanding is accurate.\r\n\r\n[1] However, if their contribution is incredibly simple, e.g. a typofix, then it may be ineligible for copyright at all, in which case you can treat it as public-domain and you can use it in whatever code you want regardless of license.", "added": 1573074517, "modified": 1573074517, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-550558865", "source_type": "github"}, {"comment_id": 36, "body": "> Just so people are aware, this referenced issue ([HeIIoZeroNet#1](https://github.com/HeIIoZeroNet/ZeroNet/issues/1)) is NOT nofish (as you can see on the profile - this user joined an hour ago). The user tried making it look official, but it isn't.\r\n\r\n@krixano Indeed.  For anyone reading this who's curious and hasn't seen this before, the name for this kind of attack is a *homograph attack*.  It's pretty common in the DNS world.", "added": 1573155826, "modified": 1573155826, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-551300713", "source_type": "github"}, {"comment_id": 37, "body": "> > Just so people are aware, this referenced issue ([HeIIoZeroNet#1](https://github.com/HeIIoZeroNet/ZeroNet/issues/1)) is NOT nofish (as you can see on the profile - this user joined an hour ago). The user tried making it look official, but it isn't.\r\n> \r\n> Confused me. Issue #1 with ZeroNet was mine! Hey all, long time no see.\r\n\r\n@thesoftwarejedi Good to see you; I think I recognize your username from crawling a bunch of ZeroNet sites.  While you're here, I hope you'll cast a vote?  :) ", "added": 1573210446, "modified": 1573210446, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-551830276", "source_type": "github"}, {"comment_id": 38, "body": "> HAHAHA This discussion is hilarious. \"Illegal\" copies of Zeronet. Licensing... Seriously? It's Zeronet. When did all these bureaucrats join? What is there a marketing team now too? This is too much.\r\n> \r\n> You all are so far disconnected from the original software and vision. As someone who has been there from day #1, let me assure you that this license issue is completely. ridiculous. Drop it and get back to developing, or get lost. There's more drama in this thread than on a teenage cheerleading team.\r\n\r\n@thesoftwarejedi It sounds to me like you couldn't care less what license your code is under.  That's okay!  If that's accurate, could you just vote for \"I don't care\" so that your stance is unambiguous?", "added": 1573995322, "modified": 1573995322, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-554759585", "source_type": "github"}, {"comment_id": 39, "body": "As an aside for anyone unfamiliar with how this stuff works, copyright licenses are not revocable unless they say otherwise.  None of the licenses covered in this poll say they're revocable.  As a result, all votes cast in this poll are valid, not just the most recent vote.  So, if a user votes for GPLv3+, and then changes their vote to GPLv3, it's the GPLv3+ vote that takes precedence because it's a superset of their other votes.  Similarly, if someone votes for MIT and then changes their vote to GPLv3+, their code can be used under either MIT or GPLv3+.\r\n\r\n(Obviously, the above only applies for what license the user's code is available under.  If they have a polite recommendation for what the ZeroNet maintainers choose to do, then they can change that as much as they like, and the ZeroNet maintainers should hopefully be nice people who take that change into account.)", "added": 1573995633, "modified": 1573995633, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-554760039", "source_type": "github"}, {"comment_id": 40, "body": "It is extremely likely that \"binarypunk\" is an alt of antifa.  I recommend reporting the account for abuse and not engaging with the account otherwise.", "added": 1574018387, "modified": 1574018387, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-554793893", "source_type": "github"}, {"comment_id": 41, "body": "For hell's sake guys, stop feeding the troll.  You gain nothing whatsoever from trying to engage him.  If you insist on feeding him for some reason, please do it in a thread that I don't follow.  (I need to follow this thread because its outcome impacts my day job; whatever garbage the Antifa troll has to say most definitely does *not* impact my day job and I'm tired of seeing notifications about it just because you want to argue with him.)  Report the troll to GitHub for abuse (registering alt accounts to bypass bans violates GitHub ToS), and if GitHub doesn't respond fast enough, just block him from commenting on this repo.", "added": 1574218570, "modified": 1574218570, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-555851205", "source_type": "github"}, {"comment_id": 42, "body": "> You will also continue to be in violation unless the git history is also changed to reflect the legal situation. A clean git history once the new license in place will probably be a requirement.\r\n\r\n@shakna-israel I'm not a lawyer, but:\r\n\r\nA clean Git history (starting at the point of relicense) is reasonable, though I doubt it's actually necessary since it's super unlikely that any copyright holders will be interested in suing over it.  That said, the existing Git history should be preserved in a separate repo so that security audits can confirm that no backdoors were introduced in the repo switch.  I am of the opinion that the security necessity of preserving the old repo for audits will outweigh whatever copyright interests are at play, for the same reason that no one has sued the operators of CT logs [1] for illegal content that they're hosting.  I *would* however recommend that the old audit-only repo have one final commit appended to it, which removes all files and adds a readme explaining why the repo has been recreated, and explaining that the old repo is only there for security audits.  That reduces the risk that anyone will be able to argue that someone is hosting the old repo for the purpose of average users installing the noncompliant software.\r\n\r\n[1] Or the users of blockchains, some of which are (last I heard) containing legally dubious content embedded in transactions.", "added": 1574219623, "modified": 1574219651, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-555855922", "source_type": "github"}, {"comment_id": 43, "body": "> > I am afraid that 56% looks like a too small percentage\r\n> \r\n> Well I think the percentage should be based on the contributed line numbers.\r\n> \r\n> If we do a statistics based on this I think votes on GPL3+ should be 95%+ (I have commited 89% of the lines based on https://gist.github.com/HelloZeroNet/8fe032e877fe9fe7395357debd2a904e)\r\n\r\n@HelloZeroNet AFAIK the 95% rule of thumb from Mozilla only applies if the remaining 5% were unreachable.  Since some contributors were reachable and explicitly voted for GPLv3-only, I believe that means we can't re-license to GPLv3+ unless all of those contributors' code is removed from ZeroNet.  GPLv3-only should be fine though, as long as the 1 contributor marked as \"Blocking\" has their contributions removed.\r\n\r\n(If you really need more detailed info on this, let me know and I'll see if I can dig up some references.)", "added": 1574883537, "modified": 1574883537, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-559274465", "source_type": "github"}], "1604067790_mirrored_ghost_github": [{"comment_id": 44, "body": "So obviously this issue is a trolling attempt, not a serious bug report.  That said, I'll comment on my position here.  (I'll use singular first-person here because in practice, for the last couple years, liasoning with ZeroNet is my job at Namecoin, but I don't have any reason to think that any other Namecoin devs disagree with my take).\r\n\r\nAm I unhappy that ZeroNet uses unnecessarily centralized resolution by default?  Yes, without a doubt.  However, I am not in the business of shitting on projects, or refusing to work with them, just because they have shortcomings.  In order for me to shit on a project over something like this, the project would need to demonstrate that they don't care about those shortcomings and have no intention of fixing them.  That is not the case for ZeroNet; I've spoken with both Tamas and Lola extensively, and it is clear to me that they want to fix those issues.  Work is ongoing to fix the situation (and this is a collaboration between me and Tamas and Lola), so I'm satisfied and have no intention of removing mentions of ZeroNet from Namecoin.org.  Why is it taking a while to get the situation fixed?  Because it's hard for me to get funding for ZeroNet-related Namecoin work, so I usually need to find a way to justify that work as relevant to another use case, and find a way to implement those deliverables so that they meet the requirements of the other use case but happen to also make things better for ZeroNet.  This will hopefully change in early 2020.  I was hoping to meet up with Tamas and/or Lola at 36C3 to discuss our next steps in this department, but unfortunately it looks like neither of them will be there this year.  I'll probably spend some time talking with them in January to coordinate things.\r\n\r\nAnyway, yes, everyone involved knows that the current situation is not great, and everyone involved is trying to get the situation fixed.  Shitposting about it is not going to get it fixed any faster (but obviously getting the situation fixed was not ever the goal of our Antifa troll).\r\n\r\nCheers.", "added": 1576539819, "modified": 1576539819, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2361#issuecomment-566354648", "source_type": "github"}, {"comment_id": 45, "body": "> Unfortunately, that centralized resolution is not really \"unnecessary\". Currently, this is the only efficient way to query blockchain without downloading it. Because in any case, you will either have to download whole blockchain or rely on centralized resolution.\r\n\r\n@filips123 I'm not going to dignify this issue (which was started by a troll and should just die) by getting into further serious discussion, but your statement is not completely accurate.  There are a variety of approaches to authenticating name lookups that are substantially less centralized than what ZeroNet uses now [1]; I've already discussed this in significant detail with both Tamas and Lola.  This month is not a good time to rehash those discussions on GitHub (I'm busy getting ready for 36C3), but at this point most of the work remaining is an engineering/implementation effort, not design/research.  If you're curious, feel free to contact me via some channel that isn't a GitHub issue started by a troll, but don't expect me to be around until January at the earliest.\r\n\r\nCheers.  :)\r\n\r\n/me will not be replying further in this issue.  Let the shitpost die.\r\n\r\n[1] EDIT: And no, I'm not talking about multisig-signed centralized resolution.  That's generally the kind of \"solution\" proposed by clowns who have no solution.", "added": 1576553323, "modified": 1576553720, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2361#issuecomment-566401578", "source_type": "github"}]}, "next_topic_id": 5, "topic": [{"topic_id": 1604066556, "title": "Fix 403 error when listening on 127.0.0.1:80.", "body": "ZeroNet was incorrectly expecting a `:80` suffix in HTTP Host headers; most HTTP clients don't include that suffix.\r\n\r\nTo reproduce the issue, listen on 127.0.0.1:80 and try to connect to the UI in a web browser.  You'll get a 403 error without this patch; it works with this patch.\r\n\r\n(Greetings from Namecoin!)", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1527941435, "modified": 1527943807, "source_link": "https://github.com/HelloZeroNet/ZeroNet/pull/1444", "source_type": "github"}, {"topic_id": 1604066557, "title": "Support accessing ZeroNet via a transparent proxy.", "body": "Transparent proxies redirect traffic to a different IP or port without modifying the traffic.  This PR allows ZeroNet to work with transparent proxies the same way that it currently works when used as an HTTP proxy.\r\n\r\nOne highly interesting use case for this is an experimental branch of ncdns that I'm working on, which automatically assigns a DNS `A` record of `127.0.0.1` to any `.bit` domain that is available via ZeroNet.  This enables both ZeroNet and clearnet `.bit` sites to be accessed via the same browser.\r\n\r\nTo test this patch, set your OS's `hosts` file to assign `127.0.0.1` to a ZeroNet-enabled `.bit` domain of your choice, make ZeroNet listen on `127.0.0.1:80` with the `--ui_trans_proxy` flag set, and visit that `.bit` domain in a web browser.\r\n\r\nGreetings from Namecoin!", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1527941884, "modified": 1527943933, "source_link": "https://github.com/HelloZeroNet/ZeroNet/pull/1445", "source_type": "github"}, {"topic_id": 1604067061, "title": "ZeroName updater should use \"map\" field for subdomains", "body": "**Is your feature request related to a problem? Please describe.**\r\n\r\nIn [Namecoin's domain names specification](https://github.com/namecoin/proposals/blob/master/ifa-0001.md#abstract-constructs), the JSON `\"map\"` field is used to designate subdomains.  Unfortunately, ZeroNet is using a nonstandard subdomain designation via setting the `\"zeronet\"` field to a JSON object.  This mismatch makes it substantially more difficult for Namecoin-related software (such as ncdns) to properly interoperate with ZeroNet (e.g. the draft ncdns feature that interoperates with ZeroNet's transproxy feature).\r\n\r\n(Note that I discussed this subject with Tamas at Decentralized Web Summit 2018.)\r\n\r\n**Describe the solution you'd like**\r\n\r\n* The ZeroName updater should walk subdomains via the `\"map\"` JSON field.\r\n* The ZeroName updater should accept `\"zeronet\"` fields whose value is a string instead of a JSON object.\r\n* It's fine with me if the ZeroName updater continues to accept the existing nonstandard notation as a fallback, so that existing sites don't break due to the update.\r\n\r\n**Describe alternatives you've considered**\r\n\r\n* I considered requesting that the ZeroName updater discontinue support for the existing nonstandard notation, but I'm fine with pushing back that discussion for a future date, since it's higher priority for me that the standard notation work properly in ZeroNet, and breaking backwards compatibility would probably entail extra delay and work in making sure that everyone updates.\r\n* Long-term I'd suggest that ZeroNet consider the possibility of using a JSON field in Namecoin that maps to a DNS record type (e.g. a `TXT` record), but the discussion about that would probably be more involved than the simple change that I'm requesting here, so I'm fine with pushing back that discussion for a future date.\r\n", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1546594709, "modified": 1552246944, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1843", "source_type": "github"}, {"topic_id": 1604067761, "title": "32-bit OpenPGP fingerprint in README.md is insecure", "body": "### Step 1: Please describe your environment\r\n\r\n  * ZeroNet version: 224093b3dd9b7ee4f332811cddccbaf123090fa3\r\n  * Operating system: Whonix\r\n  * Web browser: Tor Browser\r\n  * Tor status: N/A\r\n  * Opened port: N/A\r\n  * Special configuration: N/A\r\n\r\n### Step 2: Describe the problem:\r\n\r\n#### Steps to reproduce:\r\n\r\n  1. Open the `README.md`.\r\n  2. Look for the OpenPGP fingerprint.\r\n\r\n#### Observed Results:\r\n\r\n> Email: hello@zeronet.io (PGP: CB9613AE)\r\n\r\nThis is a 32-bit fingerprint, which is insecure.\r\n\r\n#### Expected Results:\r\n\r\nThe full 160-bit fingerprint should be provided.\r\n\r\nAccording to https://github.com/HelloZeroNet/ZeroNet/issues/759#issuecomment-274913998 , the 160-bit fingerprint is `960F FF2D 6C14 5AA6 13E8 491B 5B63 BAE6 CB96 13AE`, but @HelloZeroNet should probably confirm that himself.", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1579409847, "modified": 1579426254, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2399", "source_type": "github"}]}