{
	"title": "SAT@34",
	"description": "My ZeroBlog.",
	"links": "- [College 34](http://127.0.0.1:43110/1Mr11twqYfgYE8DGB6USc3QqvGwiqjmzqt/)\n- [SSAT](http://127.0.0.1:43110/14L1iuZkKPFxYkAZAyieGGcifV3mNZ1uDL)",
	"next_post_id": 19,
	"demo": false,
	"modified": 1467536643,
	"post": [
		{
			"post_id": 18,
			"title": "SSAT专题",
			"date_published": 1467536579.896,
			"body": "http://127.0.0.1:43110/14L1iuZkKPFxYkAZAyieGGcifV3mNZ1uDL"
		},
		{
			"post_id": 17,
			"title": "SAT和ACT的比较",
			"date_published": 1467457466.513,
			"body": "美国高考有两种：SAT和ACT。如果高中生要申请美国前50位的顶尖大学，除了要求学生提供托福或雅思等语言成绩外，90%以上的顶尖美国名校会要求参考学生的ACT或SAT成绩，而且ACT或SAT成绩的高低已成为决定学生能读哪一所美国大学的主要因素之一。\n\n \n\n　　据统计2008年，有1,465,000人参加了SAT考试，有1,206,000人参加了ACT考试。其中越来越多的高中学生选择同时参加SAT和ACT考试。在进行两种考试的选择，或者在准备与参加两种考试时，它们的主要差别是每一个考生必须注意到的。SAT和ACT考试的差别表现在以下几个方面：\n\n \n\n差别之一：SAT和ACT的考试设计不同。SAT考的是推理和语言能力，而ACT更侧重于考一个学生在学校里学的东西。因此有这样一种说法：“好学生”善于考好ACT，而“会考试的学生”善于考好SAT。 \n\n\n \n\n差别之二：SAT和ACT的考试包含不同的部分。SAT考试包含三个部分：语言，数学，写作。ACT考试包含五个部分：英语，数学，阅读，科学，和可以选择的写作部分。SAT的写作部分是必须的。当你申请的大学并不要求写作成绩时，如果你参加ACT考试，你可以省略掉写作部分。写作部分会影响到你的SAT总成绩，而不会影响到你的ACT总成绩。\n\n \n\n差别之三：SAT和ACT的考试结构不同。SAT由十部分构成，而ACT由四部分构成。SAT包含三部分阅读，三部分数学，三部分写作和一个部分用作试验，试验部分在考试过程中是不标出来的。ACT包含一部分英语，一部分数学，一部分阅读和一部分科学。\n\n \n\n差别之四：SAT和ACT的考试对错误答案的处理方式不同。SAT考试对于答错的题目倒扣分，而ACT对错误的答案不计分，但也不扣分。\n\n \n\n差别之五：SAT和ACT的考试内容不同。SAT的数学只包含到九年级的几何和代数II，而ACT则包含到三角几何。SAT没有科学部分，而ACT包含科学，虽然ACT的科学部分也只是测验阅读图表，理解试验与科学讨论，并不是测验你的物理，化学，生物知识。就阅读来说，SAT的阅读强调完成句子，阅读理解，长段落与短段落的分析，而ACT则测试四篇短文的阅读。这四篇短文分别在散文小说，人文科学，自然科学和社会科学的四个领域。SAT考试的写作要求一篇短文，并且回答语法，用词方面的问题，而ACT考试的写作部分则侧重于语法。\n\n \n\n差别之六：SAT和ACT的考试计分方式不同。SAT考试的每部分从 200分到800分，总成绩是三部分的加总，满分是2400分。ACT考试的每部分成绩从1分到36分，总成绩是四部分的平均分，满分是36分。\n\n \n\n差别之七：SAT和ACT的考试形式不同。SAT所包含的词汇要远远多于ACT考试的词汇。ACT全部是多选题，而SAT并不全是多选题。ACT直接测试考生的英语语法，但SAT不考语法。\n\n \n\n差别之八：SAT和ACT的考试频率不同。SAT一年之内提供七次考试，分别在十月，十一月，十二月，一月，三月(或四月)，五月和六月，而ACT在一年之内只提供六次， 分别在九月，十月，十二月，二月，四月和六月。SAT需要在考试的六个星期之前报名，而ACT需要在考试的四个星期之前报名。\n\n \n\n差别之九：SAT和ACT的考试培训时间不同。SAT，学生可以在进入高一后利用周末及假期时间进行专业培训。参加ACT考试，学生要在高二会考结束后，进行九个月的全日制预科课程的学习，才有资格考试。\n\n \n\n差别之十：SAT和ACT的考试地点不同。ACT考试中国学生可以在注册相关的预科课程后在本地的ACT中心报名并参加。而SAT在中国内地没有考点，考生只能去香港和台湾考试。\n"
		},
		{
			"post_id": 16,
			"title": "SAT应试技巧：你的阅读速度有多快？",
			"date_published": 1467457246.2,
			"body": "时间紧张是考生赶考后普遍的感想之一，考试各部分时间都很紧张，寸秒寸金。学生需绷紧每一根弦，对考试的任何一部分都不能放松。\n\n \n\n●打消“跨区答题”的念头\n\n \n\n　　在SAT考试中，每部分结束考官即会要求考生停下来，翻过这一页面，继续(或休息一段时间后)开始下一部分的考试。考生若前面的题未答完，很有可能会按照国内考试的习惯，翻回去继续完成。甚至有考生早就打好了“如意算盘”，要在国内考生擅长的数学上尽可能多省下一些时间，用于阅读和写作部分的答题。但请注意，这是严重违反考试规则的。无论考生是有心还是无意，考官轻则提醒警告，重则有权直接取消你的考试资格。\n\n　　\n\n■注意一：考题不完全按照难度递增排序。考生答题时要遵循“先易后难”的原则，难题一定要跳过。在一个难题上花费过多的时间，花在其他题(很有可能是简单题)的时间就会相应减少。\n\n　　\n\n■注意二：考生可参考《SAT官方指南》这本书，在考前对可以花在每部分的时间大致心中有数。\n\n　　\n\n■注意三：不同于国内的考试，SAT考试涂在答题卡上不是个长方形，而是个圆圈。考生事先需把2B铅笔用熟，训练“涂圆圈”的速度，不要在这个上面浪费时间。并且也不要等做完某个部分所有的试题后再涂卡，时间很有可能会来不及。\n"
		},
		{
			"post_id": 15,
			"title": "SAT 真题 2016",
			"date_published": 1467453452.311,
			"body": "http://127.0.0.1:43110/16JCXVjjpf8uPaQ9HVs8fXY7xp2nw2Yo4x/"
		},
		{
			"post_id": 14,
			"title": "SAT sample exam",
			"date_published": 1465133442.624,
			"body": "here you can download an official SAT sample exam - \nhttps://collegereadiness.collegeboard.org/sat/practice/full-length-practice-tests"
		},
		{
			"post_id": 13,
			"title": "where i can ask questions regarding english and SAT exam?",
			"date_published": 1465133250.401,
			"body": "you can post your questions here - \nhttp://127.0.0.1:43110/18TvnEzyzMJ162TTzAku4zLn3btj5wJN6o/"
		},
		{
			"post_id": 12,
			"title": "drop us a tip here, we will follow up and investigate",
			"date_published": 1465111695.789,
			"body": "dropping a tip is easy, you can do one of the followings:\n\n- clone a blog and write your own blog; it is as easy as writing 123;\n- register a userID and then comment on any message of this blog;\n\nhere you can register your userID:\n\nhttp://127.0.0.1:43110/zeroid.bit/"
		},
		{
			"post_id": 11,
			"title": "why SAT has changed its exam design?",
			"date_published": 1465105405.454,
			"body": "presumably it has done a lot of research and is responding to the demand from colleges who have made claims about its past performance and relevance to students' future performances and so on.\n\nbut what i have so far noticed is - \n\n- it may have decreased the requirement on words, particularly presumably difficult words, words kids say they do not use in their life; but (i deleted two words here), waht kind of kids and waht kind of life we are talking about here?\n- essay becomes optional;\n\nso, these are the starting issues. you can be sure we have a lot to talk about it when we feel like to."
		},
		{
			"post_id": 10,
			"title": "why SAT is not just SAT?",
			"date_published": 1465104909.849,
			"body": "for the following reasons, it is not just an exam:\n\n- it is a huge business; multiply the number of students and times taking it and the fee, deduct the waived parts which we do not know, you can estimate the total income from this one exam. and there are others.\n- it is a great learning platform; much more influential than many nations' national curriculum;\n- many people live on this, including me, a SAT prep teacher;\n- so my message is, it is more than an exam. it has something called social responsibility. so it becomes of much interest. "
		},
		{
			"post_id": 9,
			"title": "why SAT is not free?",
			"date_published": 1465104697.677,
			"body": "in other parts of the world, exams, particularly exams of this significance and magnitude, are free. and should be free. who yearns for money more than chinese? well i tell you, the national exam there is free. \n\nbut not SAT.\n\nwhy?\n\noh because this and this, yes we know those.\n\nbut it is a defacto national exam. it is not free. why?\n\nit is just a question. no big deal. you just keep explain that to the crowd. fine to me."
		},
		{
			"post_id": 8,
			"title": "is it a good monopoly or bad?",
			"date_published": 1465104439.903,
			"body": "from learning perspective, we would rather see various ways of thinking and approaches, including exam taking. but again because it is a monopoly, it is enforced on the students by almost all colleges. not sure what to make out of this.\n\nbut, i am a little concerned now."
		},
		{
			"post_id": 7,
			"title": "is SAT a monopoly?",
			"date_published": 1465104368.326,
			"body": "you can name a few other exams, but in reality, students smart or stupid all take it, or its other version called CAT. basically same thing. so yes, in our eyes, it is a monopoly."
		},
		{
			"post_id": 6,
			"title": "yes i want to study it, who i should talk to ",
			"date_published": 1465104146.899,
			"body": "again we refer you to our SAT guru - \nhttp://127.0.0.1:43110/18on2beXadyCe5GvAYq6sVXD9ejwRLXShd/"
		},
		{
			"post_id": 5,
			"title": "how SAT is designed",
			"date_published": 1465104111.197,
			"body": "for this we refer you to a SAT guru -\nhttp://127.0.0.1:43110/18on2beXadyCe5GvAYq6sVXD9ejwRLXShd/"
		},
		{
			"post_id": 4,
			"title": "who we are",
			"date_published": 1465103997.627,
			"body": "really, it does not matter."
		},
		{
			"post_id": 3,
			"title": "why SAT is a great invention",
			"date_published": 1465103798.732,
			"body": "- it is not just a regular exam\n- it is a ticket leading to great colleges, yes it truly is;\n- but it is also a great ticket leading to one great human tradition and thinking, one we called western thinking of the most typical kind;\n- it teaches you something most useful to man; once you learn it you will know what i mean;\n- if you do not learn it, you tend to make some stupid mistakes all men are prone to make; \n- so, i urge you to study it seriously and score it; there is a good reason score is used that way in life;"
		},
		{
			"post_id": 2,
			"title": "what we do here",
			"date_published": 1465100061.726,
			"body": "- study SAT;\n- monitor how it is designed, used, and performed;\n- give you our voice;\n\nthe little motivation behind this can be unofficially found here - \nhttp://127.0.0.1:43110/1CpQfwShA6D8kAc4o3tu46GK1i89UtGP2o/?Post:97"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}