{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1637431016,
			"title": "Running zeronet on startup with systemd (debian based distro)",
			"body": "This has probably been put somewhere before on the clearnet, just a reminder on how easy it is to do.",
			"added": 1637431015
		},
		{
			"topic_id": 1637516974,
			"title": "Play! Movie torrents question",
			"body": "Anyone know what happened to the \"Play\" torrents site? >> 1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp <<\nnothing has been added in a while.",
			"added": 1637516972
		}
	],
	"topic_vote": {
		"1617087999_16u7ApvQbcH9sGVJV5ELBvY1AQiZLnbDKN": 1,
		"1618480349_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA": 1,
		"1618591816_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq": 1,
		"1618604090_19xhtyj7LfruJTijwdhgR7yocsLVrLgSuP": 1,
		"1619072865_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": 1,
		"1624135580_1FvnwahjrXUdDfwfKtA16WL1UoqeeZKxfH": 1,
		"1637504933_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1
	},
	"next_comment_id": 25,
	"comment": {
		"1618959746_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG": [
			{
				"comment_id": 1,
				"body": "> [houtje](#comment_61_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA): you idiots still haven't figured out that it isn't the state who fucks you? Technically, sure they do, but do you really think they  are acting sovereign? Of course not you dweep. They are Technocrat/globalist puppets.  [...]\n\nWell said!",
				"added": 1619050710
			},
			{
				"comment_id": 2,
				"body": "> [deuxzaron](#comment_137_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): All technological progress must be stopped. Humanity needs to be bombed back to the stone age immediately\n\nWell if they wanna stop the global pollution problem, yeah.",
				"added": 1619054632
			}
		],
		"1623735445_1NWMPpwxp9EJJZFrhDybeZdmg48zwx5urf": [
			{
				"comment_id": 3,
				"body": "> [query](#comment_2_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg): xss.is\n\nphreaker.pro site is down btw.",
				"added": 1624074288
			}
		],
		"1637126540_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha": [
			{
				"comment_id": 4,
				"body": "So do people just come to 0net to be toxic and racist?😂",
				"added": 1637176407
			},
			{
				"comment_id": 5,
				"body": "I am not triggered. i really dont care what people say on here. its a free-for-all. i just think theres a more educated way to express their annoyance of african americans in the media.",
				"added": 1637192201
			},
			{
				"comment_id": 6,
				"body": "Also, while we are on the subject: saying/believing that a specific race of people are worse than another race of people, is  illogical. There are bad apples in every race and country on the planet. basing a complete race off of one persons or groups actions is ridiculous.",
				"added": 1637192775
			},
			{
				"comment_id": 7,
				"body": "Im not trying to convince anyone. Everyone is entitled to think what they like.",
				"added": 1637257616
			}
		],
		"1637248722_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH": [
			{
				"comment_id": 8,
				"body": "\"Videos are made available via HTTP to download, but playback favors a peer-to-peer playback using HLS and WebTorrent. Users connected to the platform act as relay points that send pieces of video to other users,[7] lessening the bandwidth of each to the server and thus allowing smaller hardware to operate at a lower cost.\" \n\n--from wikipedia.\nyes its p2p across instances.",
				"added": 1637259629
			},
			{
				"comment_id": 9,
				"body": "> [xanadu](#comment_89_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH): I think it's that P2P is only when 2 or more people watch the video but not when you upload video to one instance. From my point of view video stay on instance you uploaded and not being distributed to other instances. So when instance X goes offline your content is gone.\n\nok i see what you are saying, ive never heard of partial p2p tho.",
				"added": 1637261029
			}
		],
		"1637341086_1Q3bW6Z7c5Fe8Nnr9T93pEBgSrR5erPgyk": [
			{
				"comment_id": 10,
				"body": "I think everyone should use tor on zeronet, even if they arent doing illegal things, just to keep their IP non-exposed.",
				"added": 1637342547
			},
			{
				"comment_id": 11,
				"body": "> [xanadu](#comment_91_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH): Most problem is lack of Tor v3 trackers that are stable :)\n\nTor v3 release has been out a long time, I wonder why it hasnt been integrated into zeronet sooner.",
				"added": 1637342619
			},
			{
				"comment_id": 12,
				"body": "> [inis](#comment_8_16zLpbqTz9hpy6E2oH3y7tHNiTyVsB4RiQ): I'm quite new and not using Tor. Can you tell me where you can read IPs?I'd feel more secure if I could run ZeroNet within Tails, where every connection is made through Tor. However, what is encrypted today may be decipherable in some future, and governments probably log every piece of traffic. Thus I wouldn't trust encryption as a means to achieve secrecy (and don't know what to trust). [...]\n\nI dont know how to specifically read a certain user's ip, but if you go to 127.0.0.1:43110/Stats or whatever your devices ip on where zeronet is running on, you will see a list of peers, sort of like when downloading torrents. Im not concerned as much about the government, as i am people in this case.",
				"added": 1637367758
			}
		],
		"1637431016_1PB1YKkXjDp7fy4WC1bB9iw6V9Hp2thxWN": [
			{
				"comment_id": 13,
				"body": "EDIT: Add \"RequiresMountsFor=/path/to/storage/mountpoint/\" below the \"TimeoutStopSec=30min\" if your zeronet folder is on an external drive. This is assuming your external drive gets automatically mounted at boot time.\n\nI got tired of running zeronet manually evertime I restarted my server. I found some articles on the clearweb, and got it working on bootup. I have a file in \"/lib/systemd/system/\" called \"zeronet.service\", which contains: \n\n[Unit]\nDescription=Zeronet daemon\nRequires=tor.service\nAfter=network.target tor.service\n\n[Service]\nEnvironmentFile=<full_path_to_zeronet.conf>\nExecStart=<full_path_to_zeronet.py>\nUser=<user_you_want_to_run_service_as>\nTimeoutStopSec=30min\n\n[Install]\nWantedBy=multi-user.target\n\nIn my \"zeronet.conf\" i have set these variables:\n\ntor = always\nopen_browser = False\n\nAlso, raspberry pi are a nice way to keep zeronet running 24/7 without bogging up your main computer.\nI am currently using a RPI4 4GB running dietpi. It works like a charm :)",
				"added": 1637431742
			},
			{
				"comment_id": 16,
				"body": "> [ssdifnskdjfnsdjk](#comment_1163_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): You can edit your post, mouse hover on your post text and on the left is gray pencil. Once editing, there is question mark button with various markdown syntax suggestions. [...]\n\nok thank you i didnt know you could edit.",
				"added": 1637436227
			},
			{
				"comment_id": 17,
				"body": "> [styromaniac@kxoid.bit](#comment_274_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): It's easy if you use Cinnamon DE.\n\nIm running on cli only through ssh.",
				"added": 1637456237
			}
		],
		"1637504933_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 18,
				"body": "> [styromaniac@kxoid.bit](#comment_277_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): ZeroMail needs mobile optimization.\n\nA redo for zerohello for mobile would be nice as well!",
				"added": 1637516273
			},
			{
				"comment_id": 19,
				"body": "> [styromaniac@kxoid.bit](#comment_279_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): I'm thinking it should be like an Android launcher.\n\nThat would be a lot of websites to put in a app format. There would most likely have to be a few folders.",
				"added": 1637541894
			},
			{
				"comment_id": 20,
				"body": "> [moriposting](#comment_6_1Gbk3oHccXf2vz6KDh8DPyZya3Kh3m2pHf): ...how exactly would you take over a domain/service that has already been transferred to someone else?\n\nyou cant modify the original site unless you have the signing key. what they are probably talking about is cloning the site.",
				"added": 1637554260
			},
			{
				"comment_id": 24,
				"body": "> [obrien1984](#comment_20_14a6MrpmfdWZ9543vTNP8Co6Fa4S7M9Mq9): there is already this one https://github.com/zeronet-enhanced/ZeroNet\n\nlooks like this one is by geekless. the username that created this repo is geekless. it could be him.",
				"added": 1637690770
			}
		],
		"1637516974_1PB1YKkXjDp7fy4WC1bB9iw6V9Hp2thxWN": [
			{
				"comment_id": 21,
				"body": "> [zkjfqdyi4men9zbi](#comment_3_1ASkZyuG6Jmfm7AjwGCCo7Sy4QMiBDgRkp): If I recall, Play just contained standard torrents. So could you explain the utility of that to me because I still don't get it. In contrast, I2P torrenting provides pretty complete protection.\n\nYes Play was just a torrent catalog of sorts. its just like the yify movies site on the clear-web. Only with no ads and a nicer website experience. Ive never tried I2P torrenting before. Only P2P over tor or some other proxy.",
				"added": 1637599626
			},
			{
				"comment_id": 22,
				"body": "> [styromaniac@kxoid.bit](#comment_280_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): 1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp \n\nIts just a catalog with magnet urls. for torrenting.",
				"added": 1637601914
			},
			{
				"comment_id": 23,
				"body": "> [zkjfqdyi4men9zbi](#comment_5_1ASkZyuG6Jmfm7AjwGCCo7Sy4QMiBDgRkp): I prefer utilities without web interfaces like transmission, but must admit that I2Snark (?) seems to work pretty well. In many ways, torrenting may be the sweet spot for I2P. Other applications struggle a bit due to the latency of that network.\n\nI have never tried I2Snark, I usually try to download files off the clear-net, mainly cause ive always got better speeds on http downloads.",
				"added": 1637607995
			}
		]
	},
	"comment_vote": {
		"17_1HVwr4J7Hd5iENz5hnBE4z4j1K3L85AAMg": 1,
		"842_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"61_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA": 1,
		"137_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"93_1LQt9gDDNMnknHDQ43S4WYaXxocLyFzpVd": 1,
		"11_1NRVBTxrbgEFdVBNLczx4Cc6NV3H4Pykzc": 1,
		"81_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH": 1,
		"90_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH": 1,
		"91_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": 1,
		"4_1Q3KH2eZ26Y6fUcxJmVbiQKNAoMtMGWeB5": 1,
		"4_1Q3bW6Z7c5Fe8Nnr9T93pEBgSrR5erPgyk": 1,
		"91_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH": 1,
		"9_16zLpbqTz9hpy6E2oH3y7tHNiTyVsB4RiQ": 1,
		"2_1Q3bW6Z7c5Fe8Nnr9T93pEBgSrR5erPgyk": 1,
		"269_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"1163_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"277_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"10_16zLpbqTz9hpy6E2oH3y7tHNiTyVsB4RiQ": 1,
		"7_1ASkZyuG6Jmfm7AjwGCCo7Sy4QMiBDgRkp": 1,
		"283_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1
	}
}