{
	"title": "Zeronymous\t\t\t",
	"description": "Zeronymous",
	"links": "[Table of Contents](http://127.0.0.1:43110/1JparfhnsrWHz3BZzFTpGDgbAayTpErGKs/?Post:2:New+blog+post)",
	"next_post_id": 21,
	"demo": false,
	"modified": 1549639412,
	"post": [
		{
			"post_id": 20,
			"title": "The Black Uplift",
			"date_published": 1549379623,
			"body": "![finger.jpg (900x1280)](data/img/post_20_finger.jpg)\n\nAt the end of the 20s, few could have imagined how the world was about to witness the advent of a second era of eugenics. Nor would it be embraced by the least IQ-equipped group from one of the poorest states in the country: black women of Louisiana.\n\nWith about 35% at the time, Louisiana was the second state in America with the highest percentage of black people. Two-thirds of black women were conceiving their first child between the ages of 18 and 22 out of wedlock. Most children born that way would not have had any personal relationship whatsoever with their biological father. In less than 50 years, a de facto black-matriarchy had rapidly established itself, with serious repercussions for the upbringing and the prospects of the coming generations.\n\nOne day, an anonymous and decidedly wealthy organization represented by a minority of left-wing intelligentsia decided not only to abandon any form of denial of IQ differences and their inheritance but, if anything, to push underlying conclusions to the extreme.\n\nA dowry of $100,000 was guaranteed to all 18-year-old black women willing to be artificially inseminated by a pool of highly selected black donors. An elite of men with the highest levels of IQ and at the same time exceptional physical and aesthetic qualities.\n\nFor different reasons, both red and blue America found themselves united in politically opposing this program. This only contributing in reinforcing conspiracy theories among black. In their eyes, the white world was finally revealing all its malice in not allowing blacks to close or even overcome any gap. The advent of an enlightened black race, was what white people had never wanted all along.\n\nThis only accelerated an ideological and cultural approval of the proposal by the black community specially and unexpectedly by its male component. If it was true that young black men were about to find themselves marginalized in the competition for reproduction, it was also true that many of them had sisters or daughters whom they would preferably have impregnated by an astounding anonymous genius rather than from the known asshole from the neighborhood. A man that by all chances would probably have abandoned the child any way.\n\nTo words like black-husbandry, systemic-cuckholdry and black matriarchy, which the media tried to affix in a derogatory way, prominent black leaders began opposing terms like nation-rebuilding, races race and black enlightenment.\n\nIn sci-fi literature the term \"Uplift\" had been conventionally used to denote an assisted leap of evolution. Specifically, the raising of nonsentient or otherwise handicapped beings to a level of intelligence comparable to or exceeding humanity's.\n\nThe term \"the Uplift\" ended up becoming the most controversial of all terms and yet the one provocatively adopted by the black community in spite of any political correctness.\n\nThe year the program was launched, 30% of the 18-year-old black teens cohort joined the program already. The second and third the figure reached 70% and 85% respectively. In the fifth year the value began to stabilize at 90%.\n\nFear of missing out the opportunity in the only available time window, played a fundamental role. Black teens were unashamedly and instead enthusiastically lining up to apply.\n\nThe country was in shock. Institutions mobilized to legally block the program on ethical grounds. But this only straightened rumors about a white conspiracy and therefore motivations among blacks. The organization went underground and began using secrecy and cryptocurrency to deliver on its promise. What no one could or wanted to predict is the fact that other women, out of the cohort, wanted to apply even willful to pay to enter the program. And not just from Louisiana but also from other states. The fund began also receiving conspicuous anonymous donations from all over the world. In some cases on condition that the program was extended to other states or even countries. A domino effect had been unleashed. The phenomenon became so fashionable that applications started coming even from white and asian women who had to pay substantially high prices therefore contributing to fund the program. The organization had now resources to launch a worldwide scouting program to further refine the pool of donors. In some cases members of this elite made their names and genetic data public thus becoming some sort high-status celebrities.\n\n​​​​​​​Another unpredictable consequence of the program was that women having their first child this way proved, by the time, to be more likely to delay their second bearings and, with few exceptions, always though the program.\n\n​​​​"
		},
		{
			"post_id": 19,
			"title": "The Expanse",
			"date_published": 1546944466,
			"body": "![tumblr_n1mutqAYtV1tq0dweo1_500.jpg (500x700)](data/img/post_19_tumblr_n1mutqAYtV1tq0dweo1_500.jpg)\n`'If you don't believe me or don't get it, I don't have time to try to convince you, sorry.’`\n\nHassan picks up the phone and sends a voice message to his group of close friends.\n\"Come to my place in an hour. Bring food and blankets.”\n\"How come?”\n\"We need to talk. Seriously. There’s little time.”\n\"I heard you had quite an encounter today.”\n\"Did you? It’s about that, yes. Bring three friends. Each one of you”\n\"I don’t care who they are or their views. Just pick somebody whose opinion matters to you. Bring food and blankets for them too.”\n\"One last thing. Nobody needs to know who brought who. Just make sure that your three invitees are there.”\n\nThe sun is getting red near the horizon. The guests, a dozen in total, are reaching the place. Given the short notice, they have drinks and food leftovers with them. As hoped, Hassan is familiar with just a few of them. Outside people have gathered. Although not invited, they may have heard about the meeting.\n\nHassan greets and invites his guests to take their places in a circle on the floor which is an expanse of sand. The house is a circular open space of about 6 meters in diameter. The walls are covered with a turtledove plaster with floating shelves and books scattered all over.\n\nSome of the guests have brought plastic bottles. They are filled with sand and they have labels with names of places. The news must have spread around that Hassan has this habit of returning from his travels with samples of sand from the places he visits. Once home, he pours his memories onto the floor and mix them with the others.\n\nHowever, before spilling the sand, Hassan filters it to obtain grains that are uniform in size and density. The process involves the use of sieves but also water and a UV lamp to clean up dust, dirt and bacteria. The final effect is a sand that is fresh to the touch and slides through the fingers like the quartz of a hourglass.\n\nAs with a Japanese Zen garden, its guests can enjoy tracing waves with small rakes. Others spend their time observing each grain closely in search of microscopic exotic sea shells from somewhere around the world. Hassan is not even keeping track of all the places anymore. Archaeologists from the future will figure it out one day.\n\nThere’s a woman. Her name is Alina. She is the youngest of a family of 6 male brothers. She’s one of the most beautiful women in the camp. And she’s notorious for her fierce and witty ways and her strong beliefs which make her as much coveted as feared. Alina has brought sand smuggled from the beaches of Daklha, in their homeland.\n\n“My friends. Welcome to my home” Hassan breaks the chattering.\n“Some of you are here by my invitation and others by someone's invitation. Let us not know who invited you. That person has chosen you to contribute in the most civil way to this meeting. What will be told here should not be a secret. In fact it will be video recorded. If that makes you uncomfortable you can aways leave.”\n\nThe guests look at a camera positioned ona shelf and then at each other amused to catch any reaction.\n\n\"Today,\"Hassan continues \"I met some pretty special people. An encounter that is changing my life. Tomorrow there will be a second meeting and I would like you to came with me but I need you to get on the same page on a few things.\nBefore I begin, I’ll make something clear: we have time until tomorrow but it may not be enough. Let's not waste it. I have no intention nor the time to convince anybody of anything today. There is no reason for you to doubt my words or think I’m spinning narratives. Because I don't have any. We don’t have to agree or disagree on anything. We just need our best attention and our minds wide open because there are concepts and facts that you have to learn and understand before making any conclusion.\n\n\"You'll hear about the BitTerrarium project, about Bitcoin, about anarchy and capitalism, about polycentric legal systems, about Universal Basic Income and few other things.\"\n\nHassan places a projector on a small coffee table in the centre and turns it on towards a wall.\n\n\"Luckily for you, you won't have to hear it from me. I have prepared a playlist of videos that might do the work.\n“If or when you have questions, don't to stop the flow. Write and post them on this web page that I have created ad hoc.” Hassan stick a piece of paper on the wall with the URL.\n\n\"It's a web page that works like a Reddit AMA. Questions will appear in real time on the screen. It's anonymous so you don't have to worry about whether your question is embarrassing or misplaced. We are also here to understand what it is that most of us don't get or want to get.”\n\nWhile Hassan is still talking, a question appears on the screen. “4x3+Hassan=13 How come we are fourteen? :P”\n\n“I guess we’ll never know” Hassan replies sparking a laugh.\n\n“One last thing. I'll give you an anticipation about what is all about: these people want to make these things a reality. With us. On our land. ”"
		},
		{
			"post_id": 18,
			"title": "Piss off spies",
			"date_published": 1544007734,
			"body": "![Hal_9000_smaller-620x329.png (620x329)](data/img/post_18_Hal_9000_smaller-620x329.png)\nVito made it clear he would only allow face-to-face meetings. The necessary background checks for recruiting agent runners could take up to six months before letting an in person meeting happen. But Vito was offering to shut down his market and the agents wanted to move fast to limit their fiasco. There was nothing they hadn’t already checked on him and nothing that Vito would add to his file. They may also have considered the possibility that a chat could lead to some incriminating mistakes on his part. They decided to cut short and listen to his proposal.\nThe next day Vito was approached by a handler. He had sat next to him at the Benita Bakery and after a small talk he had asked Vito to follow him. The man proposed Vito to suggest a massage parlor where they could talk. Vito chose a Thai parlor, where they stripped themselves of all clothes and silently stood on two adjacent beds for the time of the massage. After the massage, the man asked the women to leave them alone for a while.\n\n“Are you talking about a bounty program to unmask spies and undercover agents?” The agent asked.\n\n“No, ...and yes” Vito replied\n\n“I’m talking about a prediction market where people bet whether somebody is a spy or not”\n\nVito paused letting his statement sink.\n\n“But, yes. It’s a bit of both and it goes the same way. It’s cheaper than a bounty program and it’s more liquid than the prediction markets we have seen so far”\n\n\"We have seen so far?\"\n\n\"I mean, people have seen so far\"\n\n\"Picture this: a darknet site promises to reward with a million pounds those who help expose a spy. Some people are rewarded for making the name of the person they think is a spy. Others for bringing incriminating evidence.\n\"Incriminating?\"\n\"Alright, let's say compelling evidence\"\n\n\"But here comes the forte. There’s a third type of participants: people can bet on the outcome. Somebody can bet the man is in fact a spy. Others bet he's not.\nThere will be people who think they know better and people actually know better: a mole? an ex-wife? A disgruntled co-worker? The money dependent best friend?”\n\n“Three classes of participants: spotters, whistleblowers and investors. All three are proportionally rewarded for their contribution.\"\n\n\"Now, not only you have a prediction market that already starts with a certain liquidity, that is the bounty, but you also have a bounty program where the bounty is largely financed by betting.”\n\n\"Every body would think it’s bollocks at first. Unless and until they see there’s real money involved and the first successful cases make the news. Very few organizations could kick off something like this. You have the money, you have the knowledge to evaluate evidence. Plus, you may have some expendable names in your pockets. You could stage the first cases without loosing a penny.\"\n\n\"Why should we set up something that could turn against us? What if we are the ones who are hit first? and hard.” The agent asked.\n\n\"Someone else could start it anyway. Any day. Out of your control. And then you'll have to hunt him down. What if the guy falls in the hand of an adversary power? What if the Russians created it in the first place? You’d better do it first.\"\n\n\"If you saying that your agents would rat on each other or on themselves more and sooner than those of other countries, well, there you have a problem. And you need a serious and urgent clean up my friend. If you believe your agents are better, and more loyal and less greedy than others, well: go and disrupt lesser organisations. Cheap\"\n\n\"You guys waste a lot of money catching only a handful of spies or disloyal agents any given year. Most of the time is all about the money. If one of your men is listed among the suspects it’s safe to say he’s already compromised. Wouldn't he? He may as well know it and would consider ratting himself to grab a share of the bounty.\n\n“Would that be really backfiring? Would you guys not be doing yourself a favour? Consider it an easy way to clean up your less loyal and capable ranks. Plus, you may have found a way to offer them a disgraceful pension. I even predict that after the bootstrap phase you won’t need to inject more money as other countries or donors could line up providing additional funds for the bounties. Americans against Chinese, Russian against Americans and so on.\n\nNow this thing is illegal at best. You need a criminal who runs it for you. Somebody who appears independent and sufficiently equipped to have the final say wether the evidence brought is conclusive or not. This is the kind of market where the winner takes all. One which doesn’t disdain monopolies. After that, It will be very hard to outcompete. That’s why it should be you. You build it first so that you can administer it on your terms. I can do it for you.\n\n\"Let's say we want to move forward. What would you need from us?\"\n\"You need at least one hundred million pounds in Bitcoin\"\n\"We need?\"\n\"Or more\"\n\"Obviously\"\n\"Listen, I don't need you to give it me. I don't need to own them or be in control of them. I just need you to amass the amount on one single bitcoin address and than just sign one or few messages with the same private key. People will assume I have the resources. They must think I have the money. I am the money.\"\nSecond, I need the some names and the evidence to nail them. Russian spies on your pocket or disloyal agents you want to ditch. We'll use them to stage the first successful cases. It would be free. You would be winning back your own bounty."
		},
		{
			"post_id": 17,
			"title": "Twin Cats",
			"date_published": 1541694038.21,
			"body": "![TUXEDO-FAIRY-KITTENS-CATS-TWINS.jpg (650x457)](data/img/post_17_TUXEDO-FAIRY-KITTENS-CATS-TWINS.jpg)\n\nVito and Fabio have grown up thinking that the story of how they were born twins has something of the magic and suspense that is worth being recounted in a comic way. They always found hilarious that their mother, after having delivered one of them, had to be told by the doctor to hold on literally because there was another one. The father had not even managed to get to the hospital. The birth was unexpected, being 2 weeks premature, and everything happened in one hour since the waters broke.\n\nThe news of a twin birth spread sensationally. Their father, at the time, was directing the construction of a hydroelectric power station in the middle of the Amazon rainforest and the only way for his secretary to contact him was to broadcast a radio message with all his colleagues listening. The announcement was followed by witty congratulations and lines that only contributed to create confusion and the doubt that it was all a joke. After all, Mr. Mosca was famous among his colleagues for being a passionate and articulate prankster and now, for a kind of karmic counterweight, he was the one being made fun of by events.\n\nVito, who was born second, had to wear a pink pajama and be called \"the other\" for a few hours until their parents found him a name. They picked “Vito” in honour of a family friend who died a few days earlier.\n\nThe parents' justification for their late discovery of a twin pregnancy was that the two brothers, being premature and underweight, had hid very well in their mother's belly and that ultrasound scans were not a thing in the hospital of a small rainforest village.\n\nThe mother, who at the time was very fond of authors such as Borges or Gabriel Garcia Marquez, had a certain way of telling the facts with a South American magic-realist aura in which one renounces to question what can and cannot be real.\n\nAnd Vito and Fabio had embraced that same way with affection since they were children. All in all, it was the myth of their own birth and they enjoyed giving it a fabulist touch. Little did they know that in Italy, the country they moved to, their extravagant narration could raise more eyebrows. A father who was not present at the birth. A mother who had not bothered to find out she was having twins. In the eyes of the average Italian, socially forced to take the most advanced prenatal care, these were signs of negligence and poor consideration.\n\nThe presence of two placentas was reason enough for their doctor to rule out the possibility that they could be identical. Despite the strong and constant physical similarity over time, the brothers were not identycal, just like brothers born on the same day. The twins were called \"los mellizos\" as opposed to \"los gemelos\". The Spanish language has in fact two separate words that carry the answer to the most annoying question for twins: \"Are you identical?\n\nVito and Fabio only discovered at an advanced age that their genes were 99.8% the same when they decided to take a commercial genetic test at almost 40 years old. Faced with the verdict, they were surprised to discover that they were the only ones surprised after all. For all the others it had always been evident all a long.\n\nIdentical twins are the most creeped out by their non-uniqueness. They may push themselves to differentiate in an attempt to forge their own identities beyond one half of a duo. More than everybody, they might be anxious to prove that nurture has an edge over nature in determining who we are or who we become. This can lead them to deliberately take different paths in terms of personal development while shying away from any sign of convergence. Twins separated at birth might look a like on many aspects of their personality more than twins growing up together.\n\nFor Vito and Fabio it was the other way around. Convinced of being different, just like brothers, they felt they were at most a random remix of their parent’s genes. For them, any sign of commonness could be celebrated as the direct result of a synchronized nurture. That was to say: any similarity could be traced back to the times they had spent together experiencing the world in sync in their very first years. Every divergence could be justified as the result of a different gene pool or simply different acquired tastes that came out of separated personal episodes later in their life.\n\nOne of the reasons the twins ended up pursuing different interests and later distinct education careers was attributed to a curious dynamics. They had been finding it useful to specialize in different fields. Whenever one of the twins had come first on a certain front the other one used to let the way. It wasn’t to avoid competition but rather a form of opportunism. One knew he could rely on the other if needed. Vito, for example, was the one obsessed with music discovery. At a time where peer to peer sharing had just appeared Vito could spend hours and hours building rare Mp3 collections. Fabio couldn’t see any reason to dedicate a similar effort when he could easily harvest the fruits of his brother dedication. On the other way around Fabio was the one who first got the passion for computer programming and hardware. That made him, in time, the one in charge of becoming the geek for the benefit of both.\n\nVito was the one into photography and graphics while Fabio preferred 3d design and renderings. Vito was into rationalism and worldviews while Fabio was the one into philosophy and spirituality.\n\nWhen Vito and Fabio moved from South America to an elegant neighborhood north of Milan, it took them some time to adapt. They thought it was normal for 8 years old kids to roam the streets alone with their bicycles. Two bare-chested kids looking for trees to climb on or build wooden houses were not exactly the norm. Their stray appearance and sun-browned skin quickly earned them the reputation of street gypsies capable of who knows what. They were exactly the kind of children that mothers would prefer to keep away from their children as playmates.\n\nBut their appearance was in contrast to the fact that they were extremely polite and that their way of speaking was characterized by a crystalline Italian diction virtually devoid of any accent. Moreover, the fact that they excelled at school and were particularly gifted in sport made their exotics accepted over time.\n\nWhen asked what life was like as twins, the two used to joke about saying they couldn't tell because they didn't know what life was like otherwise. But from the beginning they realized that their relationship was something different from what they might have with their sisters and later with their companions.\n\nIt was as if they had been forced to become experts in relationships since childhood. They couldn't \"break\" when things got difficult. Living under the same roof and sharing the same family and friends, they had no choice but to learn how to fix things. When they were 1 or 2 years old, they had the same experience as an old married couple. No reason to lie or deceive the other. Needless to belittle or disrespect. No chance for one to impose itself on the other.\n\nTheir way of squabbling resembled that of cats. Sudden, violent, fierce. Their quarrels in public were known, for the horror of the spectators, for the way they slaughtered themselves with a hard and bare language. The content and trajectory of their arguments were incomprehensible to most because they had no need to end the sentences if the other had already grasped the conclusion. Just like cats fighting, anything could happen in seconds. One could swear that after episodes like these they would never speak again. Instead, in a few minutes, they could be seen playing together or licking each other's wounds. It was simply their way of cutting short and converging towards resolving the conflict as quickly as possible without fearing that the other might have a grudge or increase resentment. Their lifelong alliance had certainly not been called into question."
		},
		{
			"post_id": 16,
			"title": "Dindu Nuffin",
			"date_published": 1540394500.584,
			"body": "`Synopsis: A brother of a CELL (Chad) appears for the first time in Chat. He leaves a message where he reveals his name and talks about the terrorist attack that just wiped the British Royal Family during the coronation. But the message is a declaration of innocence sent 5 minutes before the blast. May be it’s a prank or may be Chad knew about the attack before it happened and has chosen the Cell to look for help. Incel and Beta Bucks manage to get Normie paranoid on how a vast conspiracy could be now after him because he searched for Chad online. They convince him to leave his place before a swat team catches him. It all looks like a they are following up with Chad’s prank until real police cars show up. The cell witnesses the raid streamed live from the PC of Normie. Everything could really be as they speculated. Commie, a guy from a rural town in Ohio, is now on the run with the support of his brothers.`\n\n> _\"I didn't kill Umberto. I killed the king. I killed a principle.\" Gaetano Bresci after assassinating the King of Italy._\n\n![20663688_10159169405665367_3852377276564804287_n.jpg (701x309)](data/img/post_16_20663688_10159169405665367_3852377276564804287_n.jpg)\n\nChad: my name is Vito Mosca, I dind't kill the King. I've been framed. MEET my twin brother tell him \"keyword\". Wait 24 hrs.\nNormie: …well at least Chad you are alive. It was nice never hearing from you man.\nIncel: You dindu nuffin?\nNormie: You didn't kill the King, Chad, you killed Williams... the lad didn't even get to be crowned…\nBeta: Allah Akbar\nIncel: Allah Snack Bar broh! A fucking bomb at the coronation. Have you seen the videos from the drones?\nNorma: Chad, did you srsly dox yourself? who is Vito Mosca? Linkedin says an Italian living in London.\nIncel: oh man, an Italian cuck…living in cUKistant.\nIncel: What time was the blast?\nNormie: At the right time, I would say.\nIncel: LMAO. The good time.\nInce: what was the time again?\nNormie: search on Wikipedia. It’s already history.\nIncel: It says 14.32, Chad's message is at 14:27.\nIncel: it’s 5 minutes before…\nIncel: Chad sent his message 5 minutes before the blast\n```\n\nPAUSE\n\nNormie: lol…\nIntel: Chad showed up just to troll us.\nNormie: 5 minutes before the blast and he shows up here for the first time just to write shit…?\nIncel: shall we tell it to the bobbies?…see it, say it, sort it!\nIncel: Genius. I wish I had the idea first ... I could be the one trolling you now.\nNormie: give me a fucking break\nIncel: I can give you my fucking cock, how but that?\nIncel: If you think he’s involved or something you shouldn’t have searched his name online.\nNormie: why?\nIncel: who searches for a suspect when the suspect is not a suspect yet? It’s suspicious. LOL\nIncel: and now you are appearing on who saw his linkedin profile…\nIncel: maybe it’s a huge conspiracy man.\nIncel: from the secret services.\nIncel: every thing about Chad is being monitored in real time obviously. He was involved from the start.\nIncel: You have triggered an alert in their system man.\nIncel: and now they are wondering who the fuck are you.\nIncel: You are a mosquito hindering their master plan.\nNormie: Chad just bet some shit was about to happen. It’s a well played prank.\nIncel: or may be not…\nIncel: May be we should tell Beta Bucks not to look for the guy when he reads this chat. He hasn’t been online for 10 hours.\nIncel: Beta Bucks! Don’t search for Vito Mosca on google! LMAO…\nIncel: they are coming after you in a matter of hours. If not minutes.\nThink about it. What do we know?\nIncel: Chad tells us about the attack minutes before the blast.\nIncel: he chose us (may be only us) to send the message\nIncel: he says his TrueName is Vito Mosca\nIncel: he tells to wait 24 hours before we do anything\nIncel: he says to go to his brother and tell him a key word\nNormie: Chad is innocent\nIncel: Chad SAYS he dindu nuffin. Just sayin..\nNormie: we don't know if Chad is Vito Mosca... he is pointing to a random guy, but if that name comes out... we will know.\nNormie: why meet his brother and tell \"key word\"?\nIncel: may that's the word that only the two of them know. Twins are creepy.\nNormie: Why the 24 hours?\nIncel: sounds like a dead man switch to me... if me ded speak to twin brother... intiendes?\nNormie: Why us?\nIncel: because why not putting in trouble 4 total strangers instead of friends and family. or may be we were the best target to play a prank\nNormie: or may be just to time stamp the message.\nBeta Bucks: don't search for Vito Mosca even on TOR\nIncel: BetaB! Did you search Chad online?\nNormie: Beta Bucks enters the troll game...\nBeta Bucks: I don’t know Normie, best scenario: it’s a prank and you can go back jerking off on your anime collection.\nNormie: worst case scenario?\nIncel: You are fucked. LMAO\nBeta Bucks: may be it’s true that this Vito is involved and they know it and they are monitoring every single bit that have been gravitating around him to make sure that every thing goes as planned. May be they have backdoors on LinkedIn and Google and they already noticed you.\nBetabucks: They might think Chad made on time to talk to somebody (you) and to secure a way to clear himself. And you may be that somebody holding the hot potato. They don’t know what we got is just a cryptic message…they think you have all the proofs. Now they have to come and see what you got.\nIncel: You are a problem they have to solve…or dissolve. Their Mr Wolf is already on their chopper to come and solve the problem. In minutes your home is going to be swatted because somebody called the police saying you are a pedophile or that you are threatening to kill your mom.\nIncel: and they are going to say that your were resisting the arrest or that you suicided yourself with two gunshots.\n\nPAUSE\n\nNormie: you are crazy\nNormie: How do you know I live with my mom?\nBeta Buck: where do you live Normie?\nNormie: OK, I get it… you are trying to dox me. Listen…\nBeta Bucks: I think you’d better give it a shot and get out of your place.\nBeta Bucks: You may have 30 min to leave. Take your IDs plus cash and crypto. Get in the car and go to a trusted friend or girlfriend.\nNormie: I don’t have something like that.\nIncel: what you mean?\nNormie: how don't have a car, nor a friend nearby\nNormie: I live in rural America. Not easy to reach my friends\nBeta Bucks: how far the nearest one?\nNormie. They are online\nBeta Bucks: you have a laptop?\nNormie: Yes\nBeta Bucks: Leave it untouched.\nBeta Bucks: Download and activate Prey Software (LINK)\nBeta Bucks: Set this for the server: - USER: **_*_** - Password ******\nNormie: What’s that?\nBeta Bucks: It’s a software that makes your laptop work as a remote camera. We will record the scene when they arrive.\n\nNormie: this is a joke, right?\nBeta bucks: again, Normie, where do you live?\nNormie: Kenton, OHIO\nBeta Bucks: alright, GTFO from and walk toward the first bus stop.\nBeta Bucks. Take a shaver with you. You are going to cut your shitty hair.\nIncel: he did install Prey?\nBeta Buks: yeah, I can see him from his camera.\nIncel: LMAO, show me!\nBeta Bucks: (streaming link).\nIncel: he’s really packing up!\nIncel: hurry up man! They’re gonna get you!\nNormie: I’m out. Going toward the bus stop.\nIncel: ahahaahah… I’m dying.\nNormie: guys, it's not funny. Tell me it was a prank all along… was it?\nBeta Bucks: maybe :-)\nIncel: how is his anime collection Beta Bucks?\nIncel: ehi Normie, did you shave your hair already?\n\nPAUSE\n\nIncel: ehi Normie!… cmon. You did the right thing. May be they are really coming for you. LMAO. I wish Chad was here.\nBeta Buks: Normie?\nNormie: Jesus\n\nPAUSE\n\nNormie: I hear sirens, many. Approaching.\nBeta Bucks: Police?\nNormie: At least 5 vehicles. There's a van.\nIncel: he’s playing Beta, it’s his reverse prank.\nNormie: it’s no joke\n(Normie starts a video streaming from his phone).\nIncel: shit. It’s real.\nBeta Bucks: don't hide. Keep walking. Watch them like you are genuinely curious. Keep filming.\nNormie: r u kidding?\nIncel: do it man\nNormie: They have passed me. They're gone.\nINcel: they'll be in your room in minutes. Keep walking\n\nSILENCE\n\nThey are in. They broke down the door...\nBeta Bucks: Is it a SWAT team? They look like military\nLook at their fucking faces. The fuckers can’t believe it you are not home. They are looking all around. They are nervous\nBeta Bucks: OK, they're going for your pc. Say goodbye to your collections... I'll wipe it out now.\n\nSTREAMING INTERRUPTED\n\nBeta Bucks: Your turn Normie.\nBetaBucks: Write down your private key for the CryptoNetwork except the last 5 digits. Memorize them.\nBetaBucks: Now you’ll crash your phone and throw it. Hide, shave your head, get a bus, go south for at least 2 hours, get a burner phone and some food, find a hotel. Stay put\nBetaBucks: We’ll be here when you reconnect. Understood?\nNormie: OK\nBetaBucks: Always dreamt to be a fugitive. You'll be the fucking coolest, Normie I promise.\nBetaB --->Transferred 10XMR (12.000 $) -- > to Normie\nNormie: Fuck is that?\nIncel: Whoa!\nBeta Bucks: that is cash u r going to use to save your ass. And our ass. They get to you, they get your Private Key, they get us. You get that? I'm not doing you any favor. You are doing us the favor.\n\nPAUSE\n\nNormie: my name is Dave Rager from Kenton Ohio, I dindu nuffin. Tell stacy \"Nite nite tiny bitch\". Wait 4ever\n\nNORMIE GOES OFFLINE\n\nIncel: Shall we listen to the online police scanner in Hardin County?\nBeta Bucks: Don't. I doubt this is a regular operation. Let's not make them think somebody is monitoring the police in search of a fugitive.\nBeta Bucks: It's better if they think Normie is alone for now.\nIncel: Where the fuck is Beta?\nBeta: Allah Akbar..."
		},
		{
			"post_id": 15,
			"title": "Leadership",
			"date_published": 1540306049.827,
			"body": "![maxresdefault.jpg (1280x720)](data/img/post_15_maxresdefault.jpg)\n\nThe guests stand up and start leaving the place. Hassan's father and two elders reach out to him with inquisitive looks. They need to hear from him what just happened in front of their eyes.\n\n\"I know about the BiTerrarium project\" Hassan speaks\n\n\"It's incredibly ambitious. Somebody says it's an attempt to throw mankind into the future. And these men have will and resources to make almost anything happen.\"\n\nHassan puts a serious look.\n\n\"They have 1 trillion dollars to make even the craziest idea happen. For real. Don't think we are their only option. I've heard they have alternative plans like creating floating cities in the ocean or even making new islands resurface from the water by depositing sand.\"\n\n\"They could buy pieces of land from Honduras or even buy entire countries. For what I know they may escape this world and colonise Mars.\"\n\n\"These men are here but others might be somewhere else pushing for the alternatives. Theirs is a project that keeps its value if decisions and actions are taken at fast pace.\"\n\n\"I can't believe they have considered us.\" Hassan cover his face with his palms.\n\n\"They know we have a rightful title on Western Sahara but they have no intention to buy and much less to steal our land. Those man are proposing to join us in our camp and in our struggle and than move together to reclaim our homeland. They wish they could be Saharawis like us. They are asking to become our compatriots and win our land back together with the most incredible plan. I'll be honest dad, I would rather share my land with people like this than rot in this camp for the rest of my life.\"\n\nHassan pauses\n\n\"Tomorrow they will give answers to every question we may have. And they will sound convincing because they did their homework\"\n\n\"I'm afraid we will reject them. Or worse, they might be the ones rejecting us\" Hassan's look fades.\"\n\n\"Who is 'we' son?\"\n\"Dad, this matter is bigger than me, and it's bigger than just us\"\n\"We'll have to involve the leaders\"\n\"Those men will try to show and explain their plan but our leaders will start to negotiate before they even have a clue of what is talked about\"\n\"Who is we, son?\" His dad repeats the question with a calm smile on his face.\n\"People like me that couldn't grasp any of it if it wasn't for you? I invested on your education in the hope that one day you could read for me the new words of the modern world. And so did my brothers and sisters. And friends. The day we can't read has come I'm afraid.\"\n\n\"Tomorrow is not the time to take decisions or make requests. Tomorrow is the time to study and understand what this people have to say. They came to you as your guests. You don't need permission to talk to them. And you should feel free to invite whoever you deem capable of giving a contribute at this moment.\"\n\n\"The meeting doesn't need to be secretive. The leaders will know because we will tell them and I guarantee you they'll have nothing to say about it. I'll handle this.\"\n\n\"You now take care of making the best list of people to round up in your tent tomorrow.\""
		},
		{
			"post_id": 13,
			"title": "New blog post",
			"date_published": null,
			"body": ""
		},
		{
			"post_id": 12,
			"title": "The Bust",
			"date_published": 1539800221.121,
			"body": "![a8ecf0e93a5313be1b8a7e82285bc7f7-700.jpg (1120x700)](data/img/post_12_a8ecf0e93a5313be1b8a7e82285bc7f7-700.jpg)\n\nThe day he was busted running Cactus, his psychedelics darknet market, Vito knew one thing: investigators would never reveal how they tracked him down. UK laws allowed them to keep the secret.\n\nHe could only speculate weather they had used social engineer tactics or if they had simply made the right queries to their notorious bulk personal datasets that had no equal in western democracies.\n\nHe believed that the British government could simply have an up-to-date list of residents using the secure TOR browser.\n\nIt was well-known that, when somebody launched the browser the client would connect to publicly known directory authorities and download a list of all clients. His Internet Service Provider could see those connections and be sure that that person had opened a Tor client.\n\nAnonymous secure browsing was far from being the default choice for internet users at that time. The daily number of UK residents using the secure browser TOR was less than 60.000\\. The number of these persons using TOR constantly was probably less than 5.000.\n\nDrug dealers and darknet markets administrator were probably among those frequent users. Together with pedophiles and terrorists. A bucket of people worth checking on\n\nThe government just needed to track the timings of internet users using TOR provided in real time by National ISPs (as legally granted by the “Powers Act 2016”) and then cross-check it with the timings Vito was active on his site.\n\nVito knew that the day would have come. But that day he didn't make the mistake of his illustrious predecessor Ross Ulbircht. When the creator of Silk Road was caught he was in a public library near his house connected on a public wi-fi. The agents made sure he was logged into Silk Road as Dread Pirate the administrator of the market. Then, by creating a diversion they first grabbed his laptop and than they arrested him making sure the session didn’t expire or the computer got protected by a screen saver. From there on they started dumping all the data with an interrupted flow of files and conversations that would end up indicting him for life.\n\nUnlike Ross, Vito was ready with a trick. He was running everything through Tails, a security-focus Linux distribution that he could boot with a simple USB memory. Pretty much a computer in a stick. The system, when the stick was unplugged, would shut down completely without leaving any digital footprint on the laptop. All data inside the memory would remain encrypted an unaccessible.\n\nThat day he was working in his usual place, a french bakery in the Upper Street. The gracious young waitress from Tahiti, who was probably hiding a camera in a flower she was wearing on her ear, had possibly the task to study his moves and make sure to create a diversion that would separate Vito from his laptop. The poor girl couldn’t notice that Vito had attached the USB stick to a string that was stuck to the table with a suction cup.\n\nWhile Vito was busy gathering some coins that the girl let fall on the ground, a men sitting on a near table grabbed his laptop. The string tightened to table unplugged the USB stick shutting down both the system and the agent's face.\n\n“What was that?” Vito said surprise to the man.\n\nThe man stood still staring at the blank screen on his laptop. He had the look of regret of someone wishing to come back in time and make things the right way. They had been duped. By the look he gave at the waitress his failure was probably recorded for all the team to laugh. Days and resources spent were compromised by a simple trick.\n\nAnother man from another table approached them.\n\n“Mr Mosca,” he spoke showing his badge.\n\n“I’m agent Simon Roberts from the blah blah department”\n\n“We wish we could have a chat with you”\n\n“With all due respect, agent, Roberts?” replied Vito “I have no idea as why we are having this conversation”\n\n“Is this an arrest? I mean… or shall I say am I under arrest like they say on TV?”\n\n“You are not under arrest Mr Mosca, we just would like to have a chat with you. It would be what we call a voluntary interview under caution in relation to an offense we believe you are involved with.”\n\nThe statement from the agent sounded like an already envisioned plan B from his scorned tone.\n\n“I would be happy to help you. I’m sure there was a misunderstanding that I can clarify.” Vito replied.\n\n“Brilliant, shall we go in the room downstairs?\n\n“Yes, Sure”\n\n“You do not have to say anything” the man started reciting.\n\n“But, it may harm your defence if you do not mention when questioned something which you later rely on in court. Anything you do say may be given in evidence.”\n\n“I also have to tell you that you are not under arrest and you can ask to leave at any time. You have the right to seek the advice of a solicitor present. This interview can be delayed whilst you exercise any of these. Do you wish to exercise any of these rights?\n\n“Nah, Agent,”\n\n“I don’t need a lawyer or legal advice to tell you that I'm not the person you are looking for”.\n\nThe poor agents had better plans than just interviewing Vito or even stopping him from running his site. They were after his vendors and possibly his customers. Following the example set by the Dutch police forces, when they busted Hamsa, their intent was to take over Vito’s credentials and run its operations undercover for a while. The strategy of law enforcers at the time was to undermine the public perception that those who run or visit a dark market can stay unpunished for long. A few changes in the code and some social engineer related to PGP would have allowed in their mind to gather passwords and informations like names and addresses.\n\nBut Cactus didn’t have any inbuilt PGP features that could be thwarted. Instead, it was even promoting the use of external end-to-end encryption chat applications like Telegram for conversations between customers and vendors. Vito didn’t mind to micromanage transactions or moderate disputes. Every thing could be done by perfecting the innovative reputation system that was based on ZeroKnowledge reviews.\n\nCactus allowed transactions only in Monero, the only cryptocurrency that was granting privacy by default. It didn’t have deposits or escrows. Each transaction was atomic from buyer to vendor and could happen outside of the platform. Cactus was just managing listings and Zero Knowledge reviews, that were legitimate and at the same time private. Neither Vito nor the merchant could know who was the reviewer but they could cryptographically be sure that the reviewer was authorized by the merchant to leave his review.\n\nHe had designed reviews to work independently from the platform having sort of a life on their own. In a sense they were “portable” attached to Vito’s private key. Cactus business model wasn’t based on any cut from deposits or transactions in the purchasing process. His source of revenues were coming afterwards from the mechanism of tips that were attached to the review itself.\n\nThe reviews in fact could contain three attributes: a description, a number of stars from 1 to 5 and a tip. The tip was an amount of Monero that the reviewer would offer to the merchant as a sign of appreciation if the review was positive (above 2 stars). Vendors would accumulate and keep tips in a basket as a monetary measure of their reputation. They were not only proof of their track records but they also worked as a sort of guarantee. In fact if the review was negative (below 3 stars) the amount of the tip would be subtracted from the vendor reputation basket. This is the same concepts that will inspired the creation of the reputation cryptocurrency known today as Talent.\n\nVito was certain he had been using state of the art Opsec precautions. They might have found the servers where Cactus was hosted and that was the only evidence that could lead to and indictment for him. He had 2 priorities. The first one was to gather as much information as possible as for why he was interviewed and which evidence they had. It’s a right of the defendant that was legally protected and regulated. The UK law didn’t allow lying to suspects, under any circumstances. He could use this opportunity to counter-gather information.\n\nThe second priority was not to make a voluntary interview become an arrest. Interviews under arrest can last up to 24 hours with few exceptions. Up to 14 days if the charges were under the Terrorism Act. He couldn’t afford to stay away from Cactus for that long. The community would wander about his absence and conclude Cactus was compromised.\n\nVito had a trusted solicitor ready to come running. The lawyer was already holding 100.000 pounds from Vito in case the police had tried to block his payments. He had the right to make his solicitor come within 24 hours. In alternative he could ask the service from a free independent solicitor that would be on call at the station.\n\nHe knew that he had all the right to answer ‘no comment’ to all questions even without his solicitor present. That might lead to a No Further Action If the prosecution didn’t believe there was a strong enough case to convict. This didn’t mean that a charge couldn’t be brought later if more evidence was discovered.\n\nBut Vito had a different but more riskier plan. He didn’t want the police to see he was prepared for the eventuality but most of all he wanted to personally manage the disclosure phase. That is when the police have to give up information about the case.\n\nThe men sat at table in an empty room downstairs.\n\n“I have to ask you to put your phone or any device on the table” the man started. This conversation is being recorded and one copy will be sealed in your presence and you will be given information on how to obtain it if you are charged with an offense”.\n\n“I'm cool. My friend won’t believe me this is really happening”\n\n“I’m sorry to interrupt you but I have to put few things on the record before we start”\n\n“I’m sorry agent, I was interrupting you”\n\n“Thank you. I’m XXXX YYYY, and I’m based at XXXXX. Which is the Islington Police. I work at the Drug blah blah team. What’s your full name?\n\n“Vito Mosca”\n\n“Lovely, can you confirm your date of birth?”\n\n“23/03/1979”\n\n“Brilliant, also present is agent sdjalskdjaskdjaò from asdjsahdlkjashda”\n\n“The date is xxxxx and the time by watch is XXXXX. This interview is conducted in XXXXX Bakery in XX Uppers Street, London. This interview is what we call a voluntary interview. This means that you are not under arrest Vito and you are free to leave at any time. Is that understood?”\n\n“Will I leave with the laptop you took from me? Vito asked nonchalantly.\n\nThe agents stayed silent and look at each other. Vito realized they were rolling out their plan B with a slip-up. Taking his laptop from his hands couldn’t be justified without an arrest.\n\n“You can have it back when we are finished” the office replies.\n\n“Oh thank god, all my work is there”.\n\n“You entitled to have free and independent legal advice, do you understand this?\n\n“I understand this. But no thanks”\n\n“And do you want a solicitor present?”\n\n“No, I’m fine.”\n\n“Ok, so before we make you aware of what’s alleged I’ll just read out the caution to you. So the caution is you don’t have to say anything but it may harm your defense if you do not mention when questioned something which you later rely in court. And anything you do say may be given in evidence. That means is that anything I ask you you don’t have to answer it if you don’t want to”.\n\n“I’ll say everything I can, officer”.\n\n“Ok, so for the reason for this interview, as I say I work for… You are suspected of being involved with the darkest market Cactus. It’s an online black market in which people buy, sell or broker psychedelics drugs.”\n\n“Seriously? I know what a darknet market is. What’s the name again?”\n\n“Cactus”\n\n“How would I be involved sir?\n\n“We believe you could be the or one of the managers and creators”\n\n“I’m sorry to disappoint you office, but I have no relationship with this Cactus, I don’t manage it and probably never visited it”.\n\n\"If I may officer. What lead you to believe that?\"\n\"If you may sir, I would like to proceed with the question\"\n\"Does that mean I won't have an answer to this question?\"\n\"In due time, may be, as we might also deem necessary to not disclose our findings or how we came to them if that infringes this or future investigations.\"\n\"Now, can I resume with the interview?\"\n\"Sure, go on\"\n“Alright, what is your occupation Mr Mosca?”\n“I’m writing a book and I am afraid this might be reason you reach out to me.”\nVito showed a smile of relief as if he was having an illumination.\n“I’m writing a sci-fi thriller that involves terrosists and even darknet markets. May be my online searches have triggered something on your systems? I do my best as to surf the net as privately as possible on this purpose. As you can see I’m using this”\n\nVito showed his usb stick.\n\n“And navigate the web on TOR when possible”\n“I’m very sorry if my online activity has caught your attention or mislead your investigation.”\n“Would you let us login to your laptop and go though your files?”\n\nThe agents interrupted him.\n\n“I’m afraid not, what’s here is private and I wouldn’t let anybody in if you allow me. I value my privacy very much.”\n\n\"Under Regulation of Investigatory Powers Act 2000 we have the power to demand the password to access your phone, laptop or any other electronic device. Refusal to comply with a notice served under s49 of RIPA can result in a maximum sentence of two years imprisonment, or five years in cases involving national security or child indecency. Do you sir know that?\n\n\"You guys can imprison somebody for not providing a password and not for the crime he was originally under investigation for? What if he's innocent? How many people have been jailed this way?\n\nVito was answered with silence.\n\n\"I guess if I go to jail for this very reason I'll have a very good material for my book. I shall volounteer for the thrill of it. Sure thing I'm not giving up my passwords\"\n\nThe men looked at each other and then both rolled their eyes as if they were annoyed to discover Vito’s obvious strategy. They were wasting their time. They looked nervous and frustrated. That was worse than a dead end for them as they knew they probably had to let loose their prey. They had nothing to prosecute him. Vito felt safe but also tired. He knew his life was about to change. Their strategy from there on would become to follow and harass him and make his life as miserable as theirs. He probably would have to leave London for another country. This is when Vito decided to give both parties a chance.\n\n“Sir, I really wish I could help you. This whole interview thing and your professionalism is fascinating to me. I admire your job. I can only write about those things you, instead, are living in real life. I really wish I could take a break from what I’m doing and do something for real. Through my researches I have been noticing some serious things happening in the dark web that I’m sure would be of interest for you. My dream would be to dig deeper but not just out of curiosity and certainly not out of the law. I would love to do that in a proper way and for good reasons. I'm sure I could be a better asset.\"\n\n“You want to become a runner agent?”\n“Is that the name?\"\n\"Sirs, I'm willing to stop what I’m doing if you just gave me this chance.\"\n“What serious things are you talking about?”\n“I’m sure it will be worth talking about them out of this interview. Don't you agree?”."
		},
		{
			"post_id": 11,
			"title": "The 3-Minutes-Note",
			"date_published": 1539701484.613,
			"body": "> ![giphy1.gif (500x500)](data/img/post_11_giphy1.gif)\n\n\"Dave. Switch on the radio. Let's listen to some country music\" says the Russian on an ironic tone. \"They might be talking about you\".\n\n\"Is Beta in the call?\" Dave asks while putting the radio on.\n\"No, he's not\" replies the Chinese.\n\"Did Vito showed up?\"\n\"Not yet\"\n\"What are our plans after his deadline? how much time have we left?\"\n\nThe Russian: \"We are not on rush to get his message anywhere. It might be as wells as signing our death sentence. You are our priority now.\"\n\nThe Chinese interrupts him: \"let's use every advantage we have. We know the hunt is linked with the facts in Britain. They'd better think you are alone. They don't know we are 5 heads thinking together. If you were dead it would be even better.\"\n\n\"Are you suggesting...\"\n\n\"I'm suggesting that if they believed you are dead would be great. Staging your suicide might be an option\"\n\nThe music stops playing. The speaker interrupts the music to announce a breaking news:\n\n`\"We have updates regarding the fugitive man in the Harding County. U.S. Marshals believe 33 year old Dave Rager from Kenton, might be on the run on foot after escaping arrest in his house. Rager is wanted on a variety of fugitive warrants and for threatening the lives of his ex girlfriend and several other persons before possibly attempting suicide. A federal warrant was issued for Rager's arrest after a suicide note have been found in which he threatens the life of his ex-girlfriend and several other women who, he accuses, 'have made my life miserable and deserve a restitution'. Rager is a frequent user of Incel forums where mysoginy and acts of violence against women are promoted. He is described as 5’6”, lean body, long hair and a red lousy beard. FBI officials say he may be carrying several handguns.`\n\nThe Russian breaks the silence:\n\n\"So, we have an unrequited lover? a weaponized red-piller with red pubic hair on his face? What else?\n\n\"The news is fabricated. That's not what I wrote on my note. Here is what I left:\"\n\n> Mom,\n> I'm leaving. I’m sorry. I can’t fight anymore and I feel relieved by the idea that my pains are coming to an end.\n> \n> We have faith in love like we have faith in God but I wish I knew they were lies all along. For some of us there are simply no chances and the game for me was rigged from the start.\n> \n> I never deserved to be liked. I never deserved to be loved. And I'm not prepared to live a life knowing that I may never hold the hand of somebody who truly loves me other than yours. It is too much of a black pill for me to swallow.\n> \n> I need you to know that I love you and that you have given me the greatest possible love a mother can give. If anybody could have helped me it would have been you.\n> \n> Yours Dave\n> \n> <sup>2</sup>For we were born by mere chance,\n> and hereafter we shall be as though we had never been,\n> for the breath in our nostrils is smoke,\n> and reason is a spark kindled by the beating of our hearts;\n> <sup>3</sup> when it is extinguished, the body will turn to ashes,\n> and the spirit will dissolve like empty air.\n> <sup>4</sup> Our name will be forgotten in time,\n> and no one will remember our works;\n> our life will pass away like the traces of a cloud,\n> and be scattered like mist\n> that is chased by the rays of the sun\n> and overcome by its heat.\n> <sup>5</sup> For our allotted time is the passing of a shadow,\n> and there is no return from our death,\n> because it is sealed up and no one turns back.\n\nThe music has started [playing again](https://www.youtube.com/watch?v=nsg-Ixdzupg). 'Falling feels like home' recites the song. The brothers stay in silence for the entire time.\n\n\"Well, quite a 3-minutes-suicide-note you wrote down there\" the Russian speaks. \"Can you please delay your rope for some more, bro?\"\n\n\"For what? Why not giving up now? It was my plan all along. Chinksta is right when he says it could be good for you. I could swallow my secret key. They would think I was alone and hopeless and didn't share anything with anybody. You could breath.\"\n\n\"We are breathing Dave, greatly.\" Replies the Chinese\n\"As long as we don't make mistakes we don't run any risk if they get to you and your key. They'll just know you were not alone. So what? Fuck them. We are safe.\"\n\n\"Yeah, fuck them. I just wish that, the day they get you, we had more evidence to nail them.\" The Russian adds.\n\n\"Stay on, as long as you can. Clearing your TrueName and legacy should be enough reason to. You are not that person they say. Your mother is not the mother of that person\".\n\n\"Yeah, I think you should kill yourself on your own terms. It's good if you are not fearing death Normie. Take some risk before giving up. Worse case, you die.\"\n\n\"Get real Incel. We barely know each other, apart from few small talks. We live in different worlds. We are not related and we don't owe each other anything. We've been put together here by a random algorithm.\"\n\n\"If it was an algorithm it wouldn't be random.\" The Russian interrupts. \"We are talking about the best true randomness ever achieved if we want to be specific.\"\n\n\"I don't care, Normie\"\n\n\"How about the way you were born in a family? Or in a certain year? Or in a certain city? Or even in this galaxy... it's equally random and providential for that matter. And don't tell me you didn't ask for it or it was unfair.\"\n\n\"The way this thing is designed to put us together is a thing of beauty in its nonsense. You didn't get to chose your cell and your brothers. We can ditch you but we don't get another brother. We won't have a second chance in our lifetime. Just like family.\"\n\n\"Ugh... come on Incel, the reason why real brothers helps each other out is simple: they help their genes.\"\n\n\"Brothers are also hardwired to compete to be the favourite of their parents, Normie\" \n\n\"Look, I'm not here to convince you that we are family or brothers. We are not. I'm sure, in most other cells members won't even get to talk maybe forever. We got here for the money or the FOMO or because fucking 'why not'. And we are not meant to get along or to become friends. We didn't even share a cause or an ideal to stick to. But we don't have a reason not to root to each other either.\"\n\n\"We are rooting for you and you can't do anything about it\" The Russian adds.\n\n\"You have a paper with your secret key with you. There's no hurry to give up. We trust you can swallow it the second before it's over for you. If we are careful we don't run any other risk. Instead, we can try to help you from our comfy places as much as we can. What's wrong with that? Just allow us and let's see if we sort something out of this. Let it be said that the brothers in this cell didn't let anybody down.\""
		},
		{
			"post_id": 10,
			"title": "ELI5 Terrorism",
			"date_published": 1539680029.338,
			"body": "`Fabrizio's daughter and wife are coming home from a walk in the park. They agreed on the phone they will tell the little children about the blast before the news gets to her in other ways. Fabrizio has the difficult task to explain something complex as terrorism in simple terms. The girl will ask why people are bad or do bad things and arm others. Fabrizio will answer that those people think the world should be different and find violence as the only way to foster their cause.`\n\n“It’s difficult to explain terrorism” is the embarrassed admission of [Simple English Wikipedia](https://simple.wikipedia.org/wiki/Terrorism) in its definition. A unique case in the entire Wikipedia and the proof of how complex can be to explain something in the simplest way.\n\nHe has few minutes to rehearse in his mind how to tell his daughter Carla about the blast. She and her mother are coming back from the park.\n\nHe has spoken with his wife on the phone and they agreed to talk about the event together. He doesn't want or probably won't be able to shield the little girl from the wave of commotion and images that will inevitably reach her one way or another.\n\nHe will always remember, as a child, the day his parents woke him up in the middle of the night and brought the whole family in front of the TV as if the world was about to end. His mother started talking about thousands or possibly millions of people who were about to raise up and revolt against their country that was treating them like slaves. It was the night of Tienanmen. The world wasn't about to end, it may as well restart for the better, but something horrible could happen in front of their eyes at any moment. He remembers the tension but also a sense of excitement and unity with his family rooting together for those boys on the other side of the world. He will always be grateful for how his parents involved him that night and made him feel scared and safe at the same time.\n\n“Mom and daddy are going to tell you something super important”\n“super duper important?”\n“very super duper important, Charlie. You will listen carefully, promise?\n“Promise!”\n“Something very bad happened today and It is so bad that it is making many many people sad. Every body is going to be sad today, Charlie, and mom and dad are sad too.”\n“What happened dad?”\n“Nothing bad happened to us, or granma or nonno white. Nobody that you know got hurt. Not your friends and not even uncle Vito. This bad thing happened in a place far far away to people that we never met or talked to but we know who they are because they are famous.”\n“What is famous?”\n\nHe feels the little brat knows exactly what the word famous means. It's her way to show she has being attentive but in a way she underlines his lack of simpleness.\n“famous people are those people that every body knows who they are and what they do. They can be famous because they’ve done something special like scientists or artists or because they are the ones that take very important decisions”\n“like what?”\n“they decide what every body can and cannot do”\n“why?” Fabrizio could play the why game with Charlie for hours but not this time.\n“Let me tell you the bad thing first, Charlie” he ads avoiding the glare of impatience coming from his wife. “Then you can ask me why all the times you want.”\n“Many people were in a church this morning in England, the country where uncle Vito lives. They were there to attend the coronation of their new King. During the ceremony there was an explosion. An explosion so big that the church has fallen down and all the people in the church have probably died.”\n“An explosion?”\n“Some bad people put a bomb in the church and the bomb exploded. We don’t know who are these persons but we will know soon”.\n“why are people bad?”\n“Nobody is bad Charlie. It’s what these people do that is bad and evil” Fabrizio feels in his spine the feeling of contradiction in Charlie’s eyes.\n\"These people are not like famous people. They have their own opinion on how thing should be in the world but nobody wants to hear it. They think that if they do something like that may be somebody is going to listen and they can convince many others of their opinion. They think their opinion is the right one and that is more important than the life of others. This people do bad things because they want to be heroes and that’s why they are bad”.\n\nFabrizio doesn’t need to look at his wife to know he is fucking up. He is just staring at his daughter face waiting for her to strike the final blow.\n“ok!” The girl said smiling. “So I need to become famous to tell people my opinion?”\n“well… uhm, that would help!” he feels relieved and unsettled at the same time.\nwhat is the opinion you want to tell the world, Charlie?”\n“I want to tell people to stop selling spinaches, I don’t want to eat them” by saying that a sparkle of ambition appeared in her eyes .\n\n\"Dad?\"\n\"yes?\"\n\"Uncle Vito is not famous?\"\n\"No he's not, Charlie, uncle Vito is fine, he was not in the church\"\nHe wishes he could tell her he heard that from uncle Vito himself but he doesn't have any news from his twin brother. He hasn't been hearing from him for months after his request to cut comunications for a while.\n\"are you ded?\", he texts to him on Telegram. \"If so, you should know I felt nothing\""
		},
		{
			"post_id": 9,
			"title": "The Flashbulb",
			"date_published": 1539637869.839,
			"body": "THE FLASHBULB\n\n`Fabrizio is on his phone, together with half of the world, watching the new King of England being coronated. When the Archbishop is leaving the crown over the prince’s head the screen gets white and the transmission interrupted. He rushes to Twitter to find if somebody has already an explanation. A 3 seconds looping video showing the event from 4 different points of view makes it clear that a bomb has exploded from below the ground wiping out the royal family together with big part of the British establishment. While traditional media look helpless in giving any more information Fabrizio is on Reddit where the /news community who is unravelling more and more content included a video from a private drone that is enhancing the view of the horror from the rubble.`\n\n> A flashbulb memory is a highly detailed, exceptionally vivid 'snapshot' of the moment and circumstances in which a piece of surprising and consequential (or emotionally arousing) news was heard. The term \"flashbulb memory\" suggests the surprise, indiscriminate illumination, detail, and brevity of a photograph – Wikipedia\n\n![a49f4cd51pkz.jpg (640x853)](data/img/post_9_a49f4cd51pkz.jpg)\n\nThe whole royal family was blown to the kingdom come. Right at the coronation. Half of the world was watching live. The other half was about to join the sensation in a matter of minutes or seconds.\n\nSurprise, consequentiality, emotional arousal. The world was being struck in sync by a collective flashbulb memory.\n\nWhere were you? Who were you with? What did you see? What did you say? What did you feel when you saw it happening or heard of it?\n\nFabrizio is alone in his room, watching the event streaming on his phone. It happens in an instant. The Archbishop levying the crown over the king’s head. The floor rising up like abubble and a flash of light blanking the screen. White at first and then black. Not even the time to make a sound. \"did I really see what?\" is his first thought.\n\nHe feels a sense of urgency on his spine. He tries to surgically scrub the progress bar back to replay the exact moment. Nothing, his thumb is too big and the bar too sensitive. Every time he goes too much backwards. Too much and he can't wait. The world is already aware of everything and he isn’t even sure about what he had seen.\n\nHe opens the laptop on Twitter. He lingers for few seconds trying to put the right words in the search box. People is spreading around only inconclusive WTFs. He wants a video cut of “the blast”. And yes: in less than a minute, somebody has already made a GIF in slow motion with 4 different angles. He is among the first 10 viewers. It’s the 3 seconds loop that, what would he know, is going to become the fastestand most shared content of all time: “the blast”. He retweets it, he send it to all his WhatsApp groups and then he goes back re-watching it mesmerised for hundreds of more times.\n\nThe BBC live stream shows just a cloud of dust pierced by the flashing lights of the police cars and their sirens screaming like foghorns. Speakers are intent on repeating in words what everybody already knows or have seen. And \"seriously?\" he thinks, \"are sirens really needed at this moment?\".\n\nIn few minutes r/news on Reddit has already launched a live update. The GIF is on top looping for everybody to gaze at. Other content comes. Of all different types and from all different angles. At an ever-increasing pace and level of details. A sequence of images that are going to sear forever into the psyche of the people of Reddit. The collapse of the abbey and the cloud of dust at first. Later the windows becoming red-hot before shattering like fireworks.\n\nThen, a private drone starts broadcasting on Twitch. People is chatting with the owner and persuading him to fly it right over the rubble. The internet is asking to \"Enhance!\". The camera get closer, and then again, closer, until the world can’t unsee what the world is wanting to see and the traditional media are failing to show.\n\nFabrizio is feeling numb and nauseated. He’s kind of annoyed by the fact he had other plans other than witnessing the course of history change. Probably, once again, not for the best. Little does he know that in a few days he is going to be held responsible for all that mess."
		},
		{
			"post_id": 8,
			"title": "The Tea Ceremony",
			"date_published": 1539636368,
			"body": "``**In a Sahrawi refugee camp in Algeria, next to the border of Western Sahara, Hassan is hosting a tea ceremony in his tent. His five European guests are not the usual tourists though. They are businessmen and scientists who have come a long way to meet him.`\n\n`Enzo, one of them, takes the floor and unravels a project they envisioned to transform his camp into a nomadic concentrated solar thermal power plant that, coupled with a waste incinerator, would be able to both generate energy and materials to build and serve movable adobe houses for its people. The vision is to raise a self-sustaining nomadic camp that can be moved to their homeland the day they will resolve to take it back from the Moroccans.`\n\n`When Hassan asks what these men want in exchange and how he can help, Enzo explains that there’s a movement of thousands of anarcho-capitalists (behind the BiTerrarium project) ready to join his people in the effort if they are promised they will be granted a piece of land in Western Saraha in case of success. His people have one month to embrace the endeavour and prove its commitment by upholding two conditions: hold a referendum to approve the grant to the BiTerrarium project and adopt a constitution of just one sentence: “PERPETUA ET FIRMA LIBERTAS.”`\n\n`Hassan is the man they have chosen to evangelize the project and create the necessary consensus among his people. When Enzo is about to go into the details the meeting is interrupted by many phones ringing at the same time. The news breaks about how the British royal family has been wiped out by a bomb during the coronation. Hassan receives messages from his Crypto Cell dealing with the event from a very different point of view.`\n\n![18bj463ykoyrajpg.jpg (768x398)](data/img/post_8_18bj463ykoyrajpg.jpg)\n\n**At the centre of the tent, there's a brazier with charcoal of acacia wood. There lies a metal teapot in which the water is slowly heating up. All around him, at arm's length, there's the tea tray, an array of glass tumblers, the bowls with the sugar and the green tea leaves. Once the tea is ready Hassan starts pouring it from one vessel to another before tipping it into small glass tumblers from an ever-increasing height. Then he tips it from tumbler to tumbler, until the required alchemy is deemed to have taken place, whereupon he pours is with one last grand flourish that leaves a foaming head on each glass.**\n\n**For the whole time, Hassan has been sitting with his legs crossed never changing position nor ever bending down. Wrapped under his traditional Sahrawi tunic of an intense pastel blue, his body is endowed with exceptionally wide shoulders from which he stretches two long arms. His body frame reminds the one of a long-distance swimmer. Hassan is almost two meters tall, skinny, lanky and yet elegant in his gestures. When reaching out for the tumblers and the teapot he operates his long dangly arms like cranes with the mastery of a croupier. His face is of a dark brown skin tone with Moorish traits. His cheeks are scarred by traces of teenage acne that appears burnt by the sun. The long face with slit eyes and sharp features would remind those of Lurch if it wasn't for an ever friendly expression that comes from an unavoidable smile he has plastered on his face. His receding upper lip and the over-eruption of his anterior teeth reveal, in fact, a gummy smile that makes it impossible for him to have a neutral expression.**\n\n**Hassan is often the chosen candidate for the tea preparation on occasion of important visits. The Saharawi tradition requires, for the role, what his people would define a 'good poet'. A person proficient in the Hassani dialect of Western Sahara, endowed with elegance, civility, and a well-kept appearance.**\n\n**In time Hassan has grown an uncanny sense of discomfort and unease in staging tea ceremonies. He can't help but think how pathetic and fake could have felt those Indians on reservations that found a living by rehearsing pipe ceremonies for sympathetic tourists.**\n\n**His visitors are usually people from the UN, the NGOs or simply tourists, that like concertgoers come to enjoy en exemplar execution as described in tour guides or shown in online videos. There simply cannot be the surprise and the fascination that might have accompanied historical first encounters with the Saharawi people.**\n\n**In those gatherings there where explorers, traders, emissaries or even military vanguards. They weren't there for the tea, they were there to gather information or close partnership and treaties. The tea was just a contour. Nonetheless, the wrong timing, the wrong gesture or facial expression could lead to painful or comic misunderstandings and outcomes. No doubt the first detailed recounts would have struck the imagination of people back home, but the main intent was confined to the need to learn and teach those who may follow on how not look hostile by just being rude.**\n\n**Around Hassan's tea trays there are no decision makers nor deals to negotiate. His task is to just re-enact those moments. The parties involved have no other purpose than serving and being served tea. He is just putting on a show.**\n\n**His usual guests don't want to be told that he's not different from them. That he's connected to the rest of the world just like anybody else. That most of his friends, like him, speak Spanish and English fluently as they have been studying abroad. That they probably even share the same internet memes on WhatsApp.**\n\n**There is a bit of irony in the fact that, despite the long preparation, the tea, when served, is drunk swiftly with no hesitation. And his guest are caught of guard by the sudden gobbling of the precious drink by Hassan and the other hosts. They must be not the usual visitors. They have been waiting in that kind of respectful silence and hesitation of those who don't belong and can't blend and now they are thinking that the ceremony may have come to an end before they could even join. They probably don't know that there are three rounds of tea. His guests today are naif and yet genuine.**\n\n**“The mass has ended you can go with God, fellas,” Hassan says with a smile. A liberating laughter from his guests bursts in the tent. “Nah, don't worry guys, there will be two other rounds of tea. And if we don't get along... there will be a fourth one. Just so you know.”**\n\n**A second louder laugh follows.**\n\n**Hassan’s family members in the tent are staring at him. They hadn't been watching his guests as he had.**\n\n**“The first round is bitter like life, the second smooth like death, and the third sweet like love. The fourth is a not so subtle way to tell our guest that it’s time for them to leave.”**\n\n**A murmur of aprouval can be heard in the tent. For once, Hassan can give not for granted that his guests are new to the Sahrawi traditions and possibly their story and struggles.**\n\n**“It is through trades with the British in the 18th Century, that tea was introduced to us Sahrawis. The beverage soon became popular among the people of Western Sahara for whom clean water, tea leaves, sugar started being luxuries taken in the highest esteem. It is said, that tea was so precious that we Sahrawis were reluctant to offer our guests tea initially. In contrast, reminded of our infamous generosity we made the tea ceremony an obligatory and a central aspect of our hospitality. However, being a rare indulgence in a land of extreme scarcity, the preparation is taken very seriously, and it must take its time. So much time that for somebody not accustomed to it appears kind of a social sickness. The hours spent in preparing and performing the Saharawi tea ritual is not for the sake of enjoying the custom itself but rather it is about creating the right setting for people to get acquaintance, to share in the life of the community, to discuss social issues.”**\n\n**“My name is Hassan Al Sarcaz, son of XX and YYY. I was born in 1992 and like other 173.000 Sahrawis have been living most of my life in one of the four Sahrawi refugee camps dislocated outside Tindouf in Algeria. The desert is our place and its sand is the floor of our homes. But this is not our desert.”**\n\n**His guests are five men of different ages and looks. They've been whispering among themselves in english with interest and excitement. They are possibly from various countries of Europe. They have been knowing each other at least professionally, or by fame, but they behave like it's the first time they are meeting in person. They are not colleagues or collaborators because they relate with a dynamics that doesn't show any hierarchy or deference.**\n\n**“Hassan, my name is Enzo Fiano.” A voice with a lyrical Italian accent raises from the group. It’s a man in his sixties in a pale blue open-neck linen shirt with rolled-up sleeves. He has silver combed hair receding from a high and distended forehead. His unshaven sunken cheeks are brightened by two remarkable crystalline blue eyes behind pale grey glasses. “I should like to start by saying that it's being an honour and a pleasure having tea with you and your family. I think I can speak for everybody by saying that we didn't expect such a cosy and charming reception.”**\n\n**His thanks are quickly met with nods and murmurs of approval from the others.**\n\n**“I and my... ehm... friends, are from various places and very different walks of life. These people are businessmen, entrepreneurs, and scientists who have been extremely successful in their fields. I feel a sense of privilege in joining this gathering with these men who are very important to me.” His words are igniting a spark in the eyes of his friends. “We've come a long way to meet you”**\n\n**A round of amused faces is staring at Hassan expecting a reaction from him. He is un-squinting his eyes, but his involuntary smile makes it look like he's figuring out the joke.**\n\n**“Meet me?”**\n\n**“Meet you” One of the men repeats with a satisfied grin.**\n\n**\"Let me ask you a question,\" Enzo continues. \"If you were in your thirties thirty years ago, when your people moved to this camp, what would you be doing now?\"**\n\n**“I... uhm, I probably. I probably would be telling my people to...our leaders to... I would be doing things differently”.**\n\n**“You know? I don't think so.” He’s interrupted by Enzo. “I believe you wouldn't be doing anything different. You would be the ‘crazy with bottles’ anyhow. Even then. You would have come out with your smart idea about building houses with plastic bottles with thirty years in advance. While your friends would be looking at each summer as the one that could be last one in the camp, you would be envisioning a brilliant cheap escamotage to build a home for your grandma. And then for your friends. And then for anybody who could see the value in it. You would be trying to improve the condition of your people and its cause probably in the same your way. And you know what's worse? You probably would have been sticking to your plan even today in your sixties. Only, today, your houses would be even smarter, if not buildings or infrastructures.”**\n\n**Enzo pauses for a few seconds**\n\n**“You are a builder Hassan. I know your kind. Problems for you are hooks for solutions. And you can't wait to grab them.”**\n\n**Hassan’s smile is now stuck. The man is clearly talking about him.**\n\n**“We know your story. The young Saharawi who, after becoming an expert on energy efficiency at universities in Algeria and Spain, decides to come back and help his people with a stupid idea; building adobe houses with sand and trash, the only materials that a refugee camp can offer. Plastic bottles that filled with sand can work better than bricks.**\n\n**Hassan is embarrassed. One again he’ll need to explain that what made the headlines of prominent outlets around the world as un up-lifting news celebrating his inventiveness, is an idea that, at the end of the day, is not really catching on with his people. The men can't know that, although his exploit got him the applause and the recognition from his community, in practice, he hasn't been able to really establish a business, apart from sporadic projects sponsored by NGOs. His people are not buying it: costs, workforces, priorities, the lack of clarity regarding the property rights about the land. A land that, for forty years, the Algerian government has been both offerings and at the same time taking it hostage.**\n\n**Hassan is about to tell his guests how he's failing in following up with his vision when the Italian man speaks again:**\n\n**“I come from Bergamo,” the Italian man says, “a city from Italy where everybody is a builder like you.” He smiles. “I'm not joking. Almost everyone works in the construction industry. If there's a construction site in Northern Italy, chances are the company in charge and the workforce are from Bergamo. You know which language you need to learn if you want to work as a scaffolder?**\n\n**\"The Bergamo dialect!” A laughter fills the tent.\n“You know what does a Bergamasque do at the bus stop?\n\"He will start building a wall!”**\n\n**This time, even Hassan can't contain himself and explodes in a laughter that unleashes his real smile.**\n\n**“I'm sure I'm now going to ruin my stand-up comedy with what I'm about to say.”**\n\n**The man pauses “Hassan, your people have been waiting at a bus stop for 40 years...”**\n\n**A respectful silence falls into the room. Hassan is now nodding seriously at what is a one of the best metaphor he ever heard describing his people state of mind. Then, his smile come back again.**\n\n**“You really hit home with this one Enzo.” He pauses.**\n\n**“Gentlemen. I hope you don't mind if I ask: what's the purpose of your visit? and how can I help you?”**\n\n**“We want to build something with you and push your vision further” says Enzo.**\n\n**“We have the crazy idea to build the largest concentrated solar thermal power plant ever. Thousands of mirrors pointing at a majestic solar tower. The electricity generated would be enough to serve the need of more than 400.000 households during peak hours. But this is not it. The plant will be coupled with a modern incinerator that will transform plastic waste into giant lego bricks you can fill with sand. They will be easy to move and assemble but once filled they become solid walls and homes. On top of this homes, we will put those same mirrors that will reflect the sun straight to the solar tower. During the night the plant could exchange the heat generated with those same houses that are usually left bearing the cold of the desert at night.”**\n\n**“W... what. What about the energy in excess?”**\n\n**“It would be a happy problem, don't you think? We could store it in batteries or mine bitcoins”**\n\n**“I.. I'm not sure there would be enough waste around here for...”**\n\n**“I'm sure we can buy more... the world would be happy to help.”**\n\n**“Why here?”**\n\n**“Who said here? Today here, tomorrow there” he points out toward west.**\n\n**“We have in mind a nomadic solar plant. Every part of it, the tower, the incinerator, the mirrors, the grid, the water pipes, the homes, all things are designed to be easily dismantled and reassembled like a nomad camp. It's clear that your people can't find any purpose, or energy or hope in putting the foundations of their life here. This is just a bus stop. Forget about foundations. Let's just build a modern nomad encampment here and now. Something that can be moved in the right place when the time comes.”**\n\n**“You talk like you already have a blueprint”**\n\n**“We do, the persons in this room have been working on every single detail of it.”**\n\n**“How about the funds. What's your budget?”**\n\n**“10 times more than enough. I can prove it right now.”Enzo has reached out to his phone and is typing something.“Show me your Bitcoin address”**\n\n**“Why?” Hassan replies concerned**\n\n**“Just show me your address.“ Enzo insists.**\n\n**Hassan takes his phone out of the tunic. There's a notification displayed on his scream. It's a strange message from his Crypto Network Cell. He opens up his bitcoin wallet and shows it to Enzo. The man is now pointing his camera phone at his QR code.**\n\n**“Check your balance!”**\n\n**Even the men have a curious look now, as kind of caught bit off guard. Hassan is looking at the screen. He is blinking his eyes in a gesture of incredulity.**\n\n**“There's an incoming transaction of...of th...of 2 billions euros, this can't be true“**\n\n**“Oh, It's true. True like gold. And that's just part of it.”**\n\n**The men in the tent are now frozen. Their eyes wide open. Hassan's phone is now dangling from his two fingers like he is holding a snake from the tail. In his hands there is enough money to grant the survival of the camps for a decade.**\n\n**“You know what was the real novelty of Bitcoin when they appeared? For the first time in history, digital transactions could be irreversible. That was not a bug...it was the feature.” He pauses. “Do you want to keep it? It's yours know. I trust you'll give it back.”**\n\n**Hassan is speechless. He is staring at his elders in the room with the look of somebody who needs advice or consultation. It's kind of entrenched in the Saharawi culture to always look for a collective consensus in takings decisions or positions. But his family members are looking back at him even more lost. His father, in contrast, is beaming at him encouragingly. His eyes are wet. They can’t hide the pride of the father who is seeing that his son's time has come.**\n\n**“Go on, son.” He says in a calm Hassani dialect, making a gesture with the hands.**\n\n**“W... w... why? What's in it for you?” Hassan mumbles.**\n\n**“I hope you’ll like what I'm about to say, Hassan. Because we really need you to like it. What we want, in exchange from all this, is something that our people and your people consider priceless and yet it should be costless. And that is: perpetual and secure freedom.”**\n\n**Enzo pauses.**\n\n**“Let me tell you a story that dates back to 1441 in Italy. It’s the story of the Repubblica of Cospaia, the smallest republic ever existed which lasted undisturbed for 4 centuries.**\n\n**You know, to obtain a loan, people offer guarantees. When Pope Eugene IV asked a loan from Florence of 25,000 gold florins, he pledged the little region around the city of Borgo Sansepolcro in the upper Tiber valley. At the end of the tenth year, the loan was not returned and the land became part of the Republic of Florence. It was, therefore, necessary to agree on the new borders between the two states and each appointed its own commission. Both commissions - acting independently - fixed their own border, leaving out a strip of land that was enclosed in a bifurcation of the same river. 330 hectares, between 500 and 700 meters wide and a few kilometres long, within which stood the village of Cospaia, a farming village located on top of a hill, with about 350 people in less than 100 families.**\n\n**The inhabitants of this strip found themselves living in a territory that was unclaimed by both reigns. The political situation between the papacy and Florence advised not to start a dispute for an un-strategic and economically marginal strip of land. Thus, a sort of no man's land was established. Its inhabitants didn't need to be told twice and hastened to proclaim Cospaia 'free'. A self-proclaimed independent republic was born. In 1484 its status was formally recognized.**\n\n**The micro-state resolved to base its independence on the total freedom of the inhabitants, all holders of sovereignty. Not subject to anybody or any power. The Cospaiesi were not subject to taxes nor duties. They didn't have any army or prisons. A Council of the Elders and Heads Families was just enough to resolve disputes. Engraved in the parish's bell, the only ever written rule of the tiny republic had been for 4 centuries “PERPETUA ET FIRMA LIBERTAS.” The Cospaiesi, a people of illiterates, had been smart enough not to complicate their life any further. They just minded about how to prosper by trading and maintaining excellent relationships with nearby towns. Everybody could join the republic as long as they had a trade to run or a land to settle into.\"\n\nEnzo pauses for a moment.\"Now, Imagine if that had happened to Western Sahara when Spain left!\"**\n\n**\"This story is to tell that people can be better off if left alone and that there may not be the need of a government to enforce the only natural law that really counts: nobody should initiate or threaten to initiate force on an individual and its property. There could have been hundreds if not millions of communities like Cospaia. Instead, we only had few other examples in history and they all end up being overpowered and annexed by bordering nations.**\n\n**We are told what can and cannot be said or written. Why?\nWe are told what to do with our bodies. Why?\nWe are told where we may or may not live. Why?\nWe are told how to run our business, who we have to hire or serve in our shops. Why?\nWe are told what sort of contracts we may or may not make one another. Why?\nWe are told which religious belief or practice we may have. Why?\nWe are told what goods or services we may and may not buy or sell. Why?\nWe are told to pay taxes to be told all of that. Why?\nWe are told to join the military and make wars we don't agree with. Why?\nWhy?**\n\n**If your answer is a genuine 'I don't know' then you are, like us, a rare breed of the human race. A modern descendant of those illiterate farmers from Cospaia.**\n\n**“You are talking about Anarcho-capitalists” Hassan interrupts him, receiving a wide smile from his audience**\n\n**“I am”**\n\n**“Yes, Anarcho-capitalists. And not only.**\n\n**We are idealists, but we don't gather in protests. We are not violent. We are not organized. True to our principles we don't have leaders or armies. We are sparse around the world and dedicate our lives just saving the money to shield ourselves from governments and their intrusiveness. But some of us are heroes that have contributed to the cause.**\n\n**The creator of Wikipedia is one of us\nThe creator of WikiLeaks is one of us\nThe creator of Bitcoin is one of us\nThe creator of Symptom Checker”**\n\n**“The creator of the Silk Road is one of us. I mean, one of them.”**\n\n**The words slipped from Hassan's mouth in excitement.**\n\n**“Oh yes, even Pirate Roberts was one of us!**\n\n**People like them has been proving the world that there's no need for governments to regulate, supervise or even provide fundamental things like education, information, monetary policies or markets.**\n\n**Men like them, and us, belong to a nation in exile. Sparse like in a diaspora we are disconnected. Unrelated. We've been living our entire life with the feeling that we don't belong to the countries where we are born. We are a nation whose homeland is somewhere else or yet to come. Ours is a hopeless and yet kind of a comfortable struggle.\"**\n\n**Enzo pauses.**\n\n**\"The struggle of your people, Hassan, is incredibly harsher and yet so hopeful. And here, let me get to the point: you may have heard about BiTerrarium”**\n\n**“I do, I mean, I have... yes”**\n\n**“As you may know, Giacomo Zucco has yet to decide where to establish BiTerrarium. There are various options under scrutiny. Sea steading platforms. New islands emerging from the sea. Etc.**\n\n**These men and I are leading the front that considers the option to terraform a piece of land in Western Sahara as the most spectacular and viable option.**\n\n**We would like to join your people in your dream. There are an estimated 100.000 anarcho-capitalists ready to start camping here with you in 1 month. They will bring technology, funds, energies and the will to start the march that will bring your people back home. We are willing to sacrifice anything like you, if you people will allow to share the fruit of this joint effort. We obviously need your people not just to consent but to embrace our proposal.**\n\n**You don't have to, but you can.\nBefore we kick off we need all the Saharawis to officially approve with a 'reasonable unanimity' the following conditions. The first one being: the new government will grant the BiTerrarium project a piece of land of XXXX hectares wherever you want in the territory. The second one is: a new constitution will be redacted and approved. A one sentence constitution: eternal and secure liberty”**\n\n**Hassan is now trying to look calm but inside he's overwhelmed.**\n\n**He's kind of an outsider in his people political arena. Certainly not an active member of the youth ranks of the Polisario. Nonetheless, his natural charisma and his higher education have earned him the consideration not just from his friends but also from the older generations who consider him a natural born leader.**\n\n**He could be defined a moderate for the Saharawi political standard. He's convinced that non-violence, higher education and a relentless effort to bring awareness to the world public opinion has been the best strategy forward. Nonetheless, he would be ready to take arms and go to war tomorrow if his leaders said so. With no questions asked. Like any other Saharawi.**\n\n**There's an ever-increasing generational divide that is splitting the Saharawi society. More than 75% of the population is younger than 30 but the power is held by the older generation. The divide has been going on for a while already but surprisingly it is not as conflictive as it could be.**\n\n**Each side has, in fact, a deep and genuine respect for the other. The youngsters admire and they are thankful for most of the decisions and the strategies pursued in the last 30 years. Especially in regard to how the refugee camps have been democratically organized and managed (mostly by women) and how resources have been spent on health care and education infrastructures. The elders see that the youngsters are the ones who are surprisingly sticking to the dream of taking back a land that they have never seen. When or if they go abroad to study they almost always come back to contribute to the cause.**\n\n**Hassan's attitude has won the appreciation of the elders but also suspects from the younger generations. They see in his attitude the one of somebody who will be useful to co-opt because he is domesticated enough not to make any fuss when in power. Somebody who would never take any resolutive action for the cause. Truth is Hassan has been holding, for quite some time now, a deep belief that the stall may come from the almost total dependency of his people from UN and Humanitarian Aids. They are not allowing the kickstart of a self-sustaining market economy and they are transforming their society into an aid dependent bureaucracy. And a bureaucracy is fertile ground for careerists that tend to hold tight the status quo. He's been looking for a peaceful radical solution for his people all his life.**\n\n**Hassan takes a breath and says:**\n\n**“I shall repeat my question. How can I help you, gentlemen.”**\n\n**Enzo stares at him: “in the next 2 months where will be the National Congress. It will be the right occasion for your people to reach a consensus. We need your people to uphold those conditions and we want and need your help to make it happen”**\n\n**We can even bring here up to 1.000 evangelists, take seminaries and explain in the details every single part of our plans in total transparency. We are also planning to distribute quadrants of BiTerrarium and implement a centennial UBI bitcoin scheme for up to 500.000 of those braves that will march west when the day will come.”**\n\n**Enzo is now interrupted by the ringing of a phone quickly silenced by the embarrassed owner. But some other phones in the room are starting receiving notifications. Even those of the members of Hassan's family. It's clear that something is spreading on the ether and reaching out to the tent from all places. People are now looking at each other getting more and more aware that something not ordinary is going to appear on their screen. Until one of the men breaks the silence:**\n\n**“You should all check your phones. Apparently, we are not the only one who missed the British coronation. The British royal family may have been wiped out by a bomb. The whole world missed the coronation.”**\n\n**Hassan too is now checking his phone, but his messages have a really different point of view. His brothers from the cell are getting crazy. And it seems they have a very good reason to.**\n\n**\"Sirs\" Hassan stands up and speak.**\n\n**\"I'm sure we have plenty to talk and I'm looking forward knowing all the details of your proposal. There's a time for everything and I believe this is the moment to check on our families and friends. I pray God they are all safe.**\n\n**We may adjourn this meeting for now so we may talk about this amongst ourselves. I invite us to reconvene tomorrow at the same hour. I may ask you the favour to let few other persons join. Is of utmost importance that I... we can have the full picture of... of your proposal.\"**\n\n**In sign of agreement the men stand up. Hassan feels dazed. What started as a normal tea ceremony is going to stay impressed in his mind like a flashbulb.**\n\n* * *\n\n`To the reader who went all the way to this post I ask a little favor: would you leave a comment if only to tell me how you got here?`"
		},
		{
			"post_id": 7,
			"title": "The BiTerrarium Project",
			"date_published": 1539634736.372,
			"body": "`10 years after the Bitcoin Whitepaper an anonymous developer delivers the whitepaper and the code for a project called BiTerrarium. It’s a decentralised digital land registry that also works as a fundraising mechanism to collect the necessary funds to acquire a piece of land where to apply in real life that very same ownership titles. Among the very few peoples who take it seriously, there’s Giacomo Zucco a bitcoin evangelist and developer who starts feverishly contributing to a project that most of the community considers a grandiose scam. One year after the launch, the creator of Bitcoin Satoshi Nakamoto reappears on the scene moving his entire fortune to acquire 10% of what is so far a virtual land. On the same day, Giacomo is made lead maintainer by the anonymous developer of BiTerrarium. These two moves lead the world to think that Satoshi is behind BiTerrarium giving a whole new credibility to the project. The market reacts with what is going to be called the BiTerrarium Land Run, a febrile rush to acquire quadrants of the promise land. The price of the digital plots skyrockets putting Giacomo in control of about one trillion dollars. Giacomo is an idealist that is crazy enough to put the money on use to kick-start an Anarcho-capitalist utopia in the middle of the desert in Western Sahara.`\n\n![CyeTxPA.jpg (1200x900)](data/img/post_7_CyeTxPA.jpg)\n\nOn October 24th 2019, exact 10 years after its first white paper, Satoshi Nakamoto the inventor of Bitcoin might have been again the person behind a second white paper called the BiTerrarium Paper. As for its predecessor, the paper was already accompanied by a well rounded and already functioning code.\n\n> _A decentralized land registry would allow land parcels to be traded from one party to another without going through an institution. A protocol for the issuance, the storage and the transfer of non-fungible land ownership titles provides part of the solution but the main benefits are lost if a political institution is required to legally attribute, recognize and enforce the titleship. We propose a solution to solve the political problem by establishing a fundraising mechanism to gather the resource that would allow to purchase or occupy a physical territory where the registry would apply and landowners could settle and enforce absolute property. – abstract of the second Satoshi white paper, November 2018_\n\nWith Bitcoin, Satoshi had envisioned a digital payment system that was trustless and irreversible. No financial institution or a third party were needed to assess transactions or either mediate conflicts. Everyone with a device and access to the Internet could secure fast cheap and secure transactions, regardless of geographic location or state citizenship.\n\n> _A purely peer-to-peer version of electronic cash would allow online payments to be sent directly from one party to another without going through a financial institution.’’ Satoshi Nakamoto_\n> \n> _Transactions that are computationally impractical to reverse would protect sellers from fraud’’ Satoshi Nakamoto._\n\nAt a time when the world was reeling from financial crisis after financial crisis, this unknown, unassuming man introduced a radical idea: what if we put money out of control? What if, Instead of depending on governments, and the men and women who run them, to determine our financial fate, we could find a technological solution? A solution that defies convention: a cryptographically secure digital currency that can be trusted because it is trustless, that can be stable because it is digital, and that was created by man but isn’t beholden to man’s whims.\n\nInitially, Satoshi was ignored, ridiculed, and dismissed, but that only deepens the mythology behind the man. Despite these obstacles, his solution has become a legitimate currency that was to change the world of economics and finance forever.\n\nSatoshi Nakamoto stood out from even that select crowd by being a genius at two distinct disciplines: technology and economics. An intimate understanding of both disciplines was necessary to create Bitcoin. Without technological expertise, he would never have been able to create a secure, stable, digital currency. But without economic expertise, his technological creation would have likely been worthless . Tokens shared between a few geeks until the fad dissipated. By being a genius in both fields, Satoshi succeeded in creating a unique synthesis that is both a technological and an economic marvel. One can never overstate the brilliance behind the creation of Bitcoin.\n\nThe providential intervention of this anonymous individual in the timeline of the human progress is often lumped with the one of a time traveller by the bitcoin community.\n\nBy putting together sparse technological and cryptographic pieces like PGP, P2P, Hascash, that had already been there for years, Satoshi had completed a jigsaw puzzle that could have been solved a decade earlier or, alternatively, only a century later. Who, if not a time traveller, could have such a clear picture and a resolute urge to provide the world with a solution like that? People started calling this confident foresight \"Satoshi Vision\".\n\n_\"The Times 03/Jan/2009 Chancellor on brink of second bailout for banks\"_ was the sentence Satoshi timestamped in the coinbase parameter of the genesis block. A way to prove the block was created not earlier than that date as well a comment on the state of the instability caused by fractional- reserve banking. Additionally, it suggested that Satoshi Nakamoto may have lived in the United Kingdom.\n\nOne day Satoshi vanished. \"I've moved on to other things.\" had been his last known message on Apr 23rd 2011, at 3:40 PM in a private email to Mike Hearn. Since then, the silence.\n\nSatoshi was giving up the leadership to lesser leaders until the community started shaping and solidifying the conviction that having no Jesus was exactly what Satoshi envisioned for the project to succeed further. The consensus mechanism that was determining any protocol improvement was being liberated by him being alive or dead, agreeing or not with any proposal or decision.\n\nBut Satoshi had left a wild card behind him hanging like a sword of Damocles on the entire project: the 1 million Bitcoin stash that the community believed he had accumulated in the first days when he was solo mining his own dream. it was estimated Satoshi was sitting on almost 5% of the entire amount of Bitcoin that would ever enter in circulation. A set of addresses whose contents were watched with hawk eyes. Not one of these addresses saw any movement except for some tests in the early days. Should so much as a Satoshi moved from one of those wallets it would have sparked global headlines and made the market go crazy or even capitulate.\n\nThe most popular scenarios were that he could have been prevented by force, death or that he could have run into the first capital sin in crypto: the password forgetfulness. Had Satoshi wanted to prove his determination to never cash out he could have easily burnt his stash in a cryptographic hell.\n\nBut then, a Friday morning, the 23rd February 202?, a year after the second paper was released Satoshi moved all his fortune into a single address belonging to the maintainer of that same project BiTerrarium. Although it's now called the Second Satoshi White Paper, Satoshi's paternity has never been proven. The paper was published anonymously and not signed cryptographically by anybody. For a year only a bunch of idealist coders had noticed it and started contributing on it. The most passionate among them was Giacomo Zucco an Italian Bitcoin evangelist who defined himself on his Twitter profile as a \"Bitcoin maximalist, (un)blockchain consultant, paleo-libertarian (in)activist, theoretical physicist (in theory), politically incorrigible\".\n\nThe paper and the software came to his attention as it was citing and making use of a protocol he and his Italian team had been developing. But his was only a piece of a new puzzle that, once again, appeared to Giacomo as visionary as advanced as the gift of another time traveller.\n\nFor a while, BiTerrarium remained confined to be a fantasy-land registry regulating the property rights of anonymous landowners of just a digital grid. A quadrant made of bits that few sparse fanatic nerds were rushing to acquire\nconvinced that the value of their digital estate could skyrocket one day. The protocol was designed to adjust the price of any new plot attribution in a way that would have allowed to raise a minimum 10.000 in bitcoin and complete the distribution in an exact two years time frame. Not before, not later. If the pace of the purchases was accelerating too much the protocol would have adjusted the difficulty to purchase the next plot by setting a higher price. It was impossible to buy all the plots available before the 2-year deadline because it would have required an infinite amount in Bitcoin.\n\nThe project soon appeared, to most of the crypto community, as just another modern revisitation of the infamous Million Dollar Homepage. If anything, it looked even more astute and scammy as its strategy was concocted to instill a potentially furious fear of missing out on latecomers. Giacomo, who until then had been known as one of the most vocal figures against any project in the odour of scam, was now leading the less credible and most scammy of them all. The community thought he just had lost his mind.\n\nThat, until the day Satoshi resurfaced and acquired 5% of the grid. The equivalent of 50 billion dollars was poured straight up onto the coffers of the BiTerrarium project. The price raised from 1$ per Bit Quadrant to up to 1.000 $ in the first hour. Reaching a height of 10.000 $ in the next 24 hours and skyrocketing the projected value of the entire land to up to 1 trillion. The PHX Land Run had started.\n\nOnce again, as it happened with the first Bitcoin early adopters, a bunch of fewer than 1.000 idealists that had been crazy enough to put their money where their mouth was, found themselves sitting on a digital land worth billions. \"_sooners_\" was the name that was quickly adopted to call these early movers, in remembrance of the infamous precedent that took place during the Cherokee Land Run of 1983.\n\nThe _sooners_ had already grabbed 40% of the land with Giacomo owning up to one third. If that wasn't enough the anonymous creator of the BiTerrarium code had made him, that Friday morning, the sole lead maintainer of the code repository. This put him in control of all the proceeds that were about to come from the sale of the remaining plot of lands.\n\nIn a matter of hours, the whole world rushed to study the white paper and to vivisect Giacomo character by parsing any line of code or word ever written or said by a megalomaniac who had plans to terraform a piece of desert in Western Sahara and kick-start an anarcho-capitalist utopia.\n\nInstead of burning his fortune Satoshi was doubling down true to his prophetic long-term investment attitude:\n\n> I'm sure that in 20 years there will either be very large transaction volume or no volume. Satoshi Nakamoto\n\nThe market entered in a fibrillation state. As in a standoff, the world was watching the market while the market was watching the world making its first move. Then, surprisingly, both the Bitcoin and BitQuadrant prices started to rise. The world was buying into the mania. Idealists, early adopters, speculators and gamblers were rushing to grab a piece of land before it could get too expensive. And criminals too: the rush for some liquidity produced, in 2 days in the US, more armed robberies and burglaries than in an entire year time frame.\n\nSatoshi's sword had finally fallen on Giacomo's head in an epic way. What should the now richest man in history do next? Hide and disappear.\n\n\"Fuck!\" were his last words on Twitter."
		},
		{
			"post_id": 6,
			"title": "The Crypto Network",
			"date_published": 1539628264.262,
			"body": "> \"there is something more powerful than the brute force of bayonets: it is the idea whose time has come and hour struck\" - Gustave Aimard\n\nJokes, music, ideals, innovations but also religions and Ponzi schemes share many analogies with viruses. If put in the right context at the right time they spread by design. The Crypto Network went viral by embodying in its genetics many traits of these social phenomena. Its conception originated from a [green text](https://knowyourmeme.com/memes/greentext-stories) of an [Incel](https://knowyourmeme.com/memes/involuntary-celibacy-incel) [Anon](https://knowyourmeme.com/memes/green-anon-old-anonymous) on [4chan](https://knowyourmeme.com/memes/sites/4chan).\n\n![Anon_is_an__trigger_mentionlist_4chandailytrigger_large_controls_collection_421190_6597790.jpg (432x768)](data/img/post_6_Anon_is_an__trigger_mentionlist_4chandailytrigger_large_controls_collection_421190_6597790.jpg)\n\n> > only have my laptop\n> > write a ponzi virus disguised as secret society\n> > everybody is put in micro-lodges of 5\\. I call them Cells\n> > nobody knows who is who, who is in-cell or out-cell, who is up or down\n> > everybody now wants to be in-cell\n> > You want to be in-cell you pay crypto\n> > You are a fellow Incel, you don't pay. You are the 1% Chad you pay a fuckton.\n> > you are Stacy you GTFO\n> > Crypto bucks go upstream to upper cells pockets\n> > If you want something you say it upstream\n> > super cels cells say if it's IQ or fake or gay\n> > this incel now rules the world\n\nThe green text had the effect of a call to arms for the 4chan community. It unleashed its, so called at the time, [weaponize autism](https://knowyourmeme.com/memes/weaponized-autism) defined by the urban dictionary as \"the focused application of nerdiness, computer tech avvy and social awkwardness in the cyber pursuit of justice\". One week later anon released a piece of software calling it the CryptoNetwork. The code was a fork of [Zeronet](https://en.wikipedia.org/wiki/ZeroNet). It was open source, hosted on a decentralised repository making it impossible to control or takedown. Contributors were anonymous, not even pseudonymous. It is always Anon.\n\nA decentralised peer to peer network of anonymous users was born. A digital secret society organised in cells of 5 members each. Every 7 days a cell would generate up to 5 new successor cells allowing the admission of 25 new members. Users could become members only once in their lifetime and only if they were males. To become a member, users need the unanimous approval from all members of a single cell. Approved members were put in a waiting list sorted by the amount they committed to pay once entering their cell. The waiting list was split in 5 groups (BetaBuckers, Chads, Normies, Beta, Incels). Incels were those members who had committed no amount. The other four groups were formed by calculating the entire pool of commitments and dividing it into four quartiles. Members who had committed the highest amount which at that moment, cumulated, totaled 25% of the entire pool would belong to the first quartile called Beta Buckers and so on. The network formed cells by randomly picking up one member from each group except for Incels who were picked in order of their date of admission. The randomness was (and it still is) obtained by a blind proof of work operated by nodes which are rewarded with a share of the proceeds. Obviously the waiting time in each cluster was different but that allowed the formation of cells that were diverse in terms of spending capability. The remaining part of the proceeds coming from new subscriptions is redistributed in equal parts to predecessor cells and can be spent only with the authorisation of all members of the cell.\n\nThe network, the protocol and its content are untraceable, resilient and censorship-resistant. Nothing is stored on a central server, instead, all the data and content is encrypted and cooperatively distributed and maintained by nodes which are clients run by the users. Nobody, not even its creator has the map of the cells and its members. Nobody has more knowledge than anybody else. Or put it in the words of Anon: everybody must have no less zero knowledge than anybody else. Nodes communicate through TOR to preserve privacy and are able to interact with the Bitcoin blockchain not only for the payments as wallets but also by making use of its resilience as a reliable mean for timestamping and authentication.\n\nUsers don't need to provide any personal data to the network to be admitted. They just need to convince 5 members of a single cell to approve their admission to receive their private key. If a cell is found guilty of having approved a double member (i.e somebody who was already a member of another cell) the cell is destroyed and loses its proceeds while successors cells rise up one level. The proceeds owned by the cell which was destroyed go to those cells whose members have found the culprits. In order to prove somebody is a double member, his two private keys must be found and burnt in a crypto-graphical ceremony called \"merge\". The incentive to find double members is so high that every member must be extremely careful not to share or having his private key stolen as it could be \"merged\" with others wrongly accused to belong to a double member. Put it on a specular point of view there’s a very high incentive to steal someone else keys and steal potentially a lot of money.\n\nViruses are defined as organisms at the edge of life as, while relying on the properties of DNA to replicate themselves like forms of life, yet, at the same time, they are not alive. Likewise, the CN manifested itself as an organisation at the edge of mankind. An autonomous decentralised human network without organisers, governance or rulers. Yet, it couldn't count as an organisation because it had no other intent than spreading.\nGreed and “fear of missing out” played an important role in the disruptive propagation of the Crypto Network after its initial inception. The rewarding mechanism for early members appeared to many like a typical Ponzi Scheme but to more attentive eyes it was the most honest and fairest scheme ever devised. Unlike a Ponzi, proceeds were liquid and transferred in real time without being locked by third parties. There was no risk it could collapse because nobody could exit scam. Most importantly, member had no incentive to harass friends and family to enter the network as introducing a member didn't bring any personal gain.\n\nBy generating a new cell every 7 days the CryptoNetwork could reach 2.000 members the first year, 8 millions people within 2 years and 4,2 billion people in 2,7 years. 5 Billion members in 32 generations (that means less than 3 years).\n\nA big reason behind the successful kick-start of the CryptoNetwork is often considered the fact that, with a green text, its creator chose a highly infectious patient zero for its inception: the community of Incels. Considered one of the most desperate and yet despicable online community ever existed, Incels (the word is a portmanteau of involuntary celibates) were members of an online subculture who defined themselves as unable to find a romantic or sexual partner despite desiring one. Discussions in Incel forums were easily characterized by resentment, misanthropy, self-pity, self-loathing, misogyny, racism, a sense of entitlement to sex, and the endorsement of violence against sexually active people.\n\nSome Incel ideologues went as far as championing an ideal world were, sexuality would not exist because outlawed. In a world without sex, humanity would have been pure and civilized. Men would grow up healthy, without having to worry about such barbaric acts. All men would have grown up free and equal because no one would have experienced the pleasures of sex that others are denied. To abolish sex completely, women themselves should have been abolished. In this dream of male domination, some incels were fantasising about concentration camps where women would be locked up, to be artificially inseminated for the sole purpose of procreation without any sexual act, at least until a way was found to dispense with their eggs and womb. After that, they would be left to starve to death.\n4chan, at first, didn't take Incels too seriously making them object of mocking and derision. Its members were notorious to show themselves desensitised from exposure to the worst of the internet. Not so much the rest of the world. Not women, not politicians. Incels theories and instances together with their advocates were not just untenable or indefensible but something dangerous that should have been actively persecuted.\n\nAfter an increasing succession of episodes of mass violence whose culprits were found to identify themselves as incels, the public opinion begun to assimilate Incels to terrorists. Many governments showed their eagerness to contrast the phenomenon by enacting legislation and adopting measures easily borrowed from the counter-terrorism library. It started by imposing the major platforms and internet providers to close Incel forums and ban their members. Some countries introduced laws that prohibited defending or promoting Incel theories similar to those in effect in Italy or Germany in regards to Fascism and Nazism. We now know that the US government had built a watch list of Incels and that it was planning to create a public registry similar to the one for sex offenders.\nGene lottery losers who were frustrated for not finding a companion were now also assumed to be bad and dangerous persons. They didn't even need a yellow star, their ugliness was an enough recognisable mark. Red Pillers and white supremacist were the only communities that showed some empathy for their conditions as they saw an opportunity for recruitment or, if anything because they felt they were the next on the list.\n\nIt was there and then that Anon incepted the virus. He offered a secure free speech platform for the most heinous of us so that everybody could see it worked. He wanted to launch something that was illegal from the start not just controversial. He wanted its first users being not afraid of breaking the law because they were outlaws by birth. Not afraid of jail because their life was already a jail. Not scared of death because they were already wishing for it. People for whom \"it's over\" wasn't a threat because it was already their motto.\n\nIt's not certain, although it's possible, that Anon and its early followers were Incels but for sure the jargon in the code and the naming of the features were picked by the incel glossary. At least goliardically. Nonetheless, the first release was soon recognized as a masterpiece of sophistication and elegance making extensive use of some cryptographic novelties like Zero Knowledge Proof and Smart Contracts. Kaspersky, one of the most renowned multinational cybersecurity and anti- virus provider went as far as to attribute it to the work of a powerful state actor with Russia as the prime suspect. Conspiracy theories started spreading that the CryptoNetwork could have been originated in a Russian troll factory to, once again, create disarray and division within the American society."
		},
		{
			"post_id": 5,
			"title": "The Nerd Room",
			"date_published": 1539623624.018,
			"body": "`Dave Rager is on the run from a massive manhunt. On his way to the Greyound Bus station he stops at the Nerd Room, an Elechtronics Shop where he is familiar with Tim the owner. He buys a phone and a power-bank but Tim assumes he's in trouble and offers help by giving him also a SIM card, a police scanner and the keys of his trucks. Dave starts driving south and starts having a panic attack. He decides to switch on the phone and reconnect with the members of his cell in the CryptoNetwork. A group call starts. For the first time the \"brothers\" are hearing each other's voices. While Incel speaks with the voice of a young Russian. The voice of BetaBuxxer is distorted but can't hide a southern chinese accent. They have planned for Dave to go south and later move north and cross the border with Canada where he could take an airplane to Cuba.`\n\n![7d95082c3085246b212271fb06139734.jpg (1200x895)](data/img/post_5_7d95082c3085246b212271fb06139734.jpg)\n\nHe'll shave his hair later, when he will be out of town. Doing it now, in his small city, would be a mistake. His fellow countrymen would notice that the awkward guy from TTRUYTR street has a new haircut. They feel so good when they act diligent. So excited to be the ones telling the police about it. He needs to get a burner phone first and maybe a power-bank. He can't get a sim card though, he'll have to rely on the WI-fi on the bus.\n\nNot far from the Greyound Station there's a shop that could work. It's called The Nerd Room and he's friendly with the owner. When he was a kid he use to spend afternoons playing video-games and building DIY hardware with the man.\n\n\"Ehi Dave\" he's welcomed when he opens the door.\n\"Hi Tim\"\n\"How is it going? still looking for Raspberry components?\"\n\"Not today Tim. Do you have power-banks? I, ehm, I am thinking about going for a hike\"\n\"Sure. there are many\" the owner points at a near shelf on his right and reaches out to pick one of them.\n\"This is going to be your favorite and it's just 40 dollars. The battery is already full\"\n\nDave knows that buying a phone would look suspicious from someone who should be looking forward ending it all. But he has no alternatives.\n\n\"do you also have cheap Android phones? just...just in case I break or loose mine\"\n\"I have a good deal, it's used but in very good condition.\"\nTim takes out the phone from a drawer and puts it on the counter.\n\"oh I know this model. How much is it?\"\n\"it's 150 $ if you pay in cash\"\n\"Seriously?\"\n\"Seriously.\nWhat's with the police cars outside?” Says Tim changing subject.\n\"police cars?... I... I don't know.\" Dave hesitates...\n\"They were all over. Heading east. Must be a big thing I guess. Those agents are from outside Kenton.\"\nTim is inspecting Dave's eyes like he is waiting for other requests.\n\"I think you need something else.\nI think you need a radio scanner, and a shaver”.\nTim says watching Dave in his eyes and sliding a bunch of keys under his nose.\n“Here\" he adds.\n“The SIM is the phone. The rest is in my truck. It's the red one parked outside.\nI get off at 6.00\\. I guess, if there’s something out of its place by then I'll be quite surprised. By 6.15 I'll probably be calling the police.\nI'm sorry you couldn't find the Rasperry thing your were looking for today\".\n\nDave is looking at Tim astonished. He grabs the keys clenching his fists like he has something he wants to tell.\n\n\"Thank you Tim\" is everything he can say. Then he walks fast outside towards the truck.\n\nDave is in the truck driving south. His mind is crossed by all things happening and all things he could or should do. He can’t focus on anything. Even his vision is disfigured, as if he’s looking at cars and traffic lights through a fish-eye lens. His heart is jumping in his throat making the blood pound in his ears. He’s clutching the steering wheel to stop his shoulder from shaking. The tension is causing him to cramp up.\n\n“Breath”, he whispers, exhaling air from his lungs.\n“This is fucking unreal” he’s repeating to himself.\n“Alright, so.\nSomebody blew up the Brits. An Italian in London tells me, and four other total strangers in the cell, that he’s innocent minutes before the blast. After searching him on Internet, in 2 hours, my house is swatted by a militarized police force that comes from out of town. I could already be at the center of a public manhunt. They’ll say I’m a pedo. A terrorist? A disgruntled ex-boyfriend? A dangerous armed unabomber about to commit an attack.\n\n“I could just stop, I’ve done nothing...\n“What if they want me dead? they need me dead.\nThey’ll stage a suicide by cop.\nfuck, put things in line Dave.\nput things in line.\nyou can stop everything from happening, you know it\nFuck!!, Fuck!! Fuck!” Dave is beating his hands on the wheel.\n\n“Breath, Breath” Dave feels his panic is stopping for some reason.\n\nThe image of that man, Tim, who gives him his car with no question asked, is coming to his mind. Those total strangers in the CryptoNetwork who were assisting him from somewhere else in the world. Until yesterday he was feeling so alone with none listening to his cringey screams of help on Facebook. And now, now that his life is a mess for real, he is not feeling helpless. He feels like he can count on somebody. And those somebodies are counting on him.\n\nHe grabs the phone an turns it on. He takes out the paper with his private key for the crypto cell while repeating in his mind what he recalls being the last 5 words. The phone is connected. He downloads the Crypto Messenger and insert the key. Then he digits the last five words he’s repeating loudly. Enter.\n\nHe’s live. The others are online too. They’ve been there all along, speculating on his moves and options.\n\nHe has no time to read the previous messages, he texts: “I’m driving south on a truck. Can’t read or text.”\n\nThe phone rings. The brothers are starting a group call. They are going to hear each others voices for the first time. Dave puts his earphones and accepts the call.\n\n“Who is the truck? a voice with an eastern accent creaks in his ears.\n\"What?\"\n“Whose truck is it?”\n“I borrowed, I mean I stole it. A person let me have it. He let me steal it. It doesn’t matter, man! The truck is safe, they’ll be looking for it only after 6.00 pm”\n\nDave stops for a second and says: “Who is talking?”\n\nThere’s second moment of silence.\n\n“OK, calm down. Is the phone clean?” A distorted low tune voice comes out from the BetaB account.\n\n“Yes, it’s clean. The SIM too is clean”\n\nThe distorted voice again: “Share your position. Share your video. Switch the video to the front camera and put the phone on the windshield. It will work as a dashcam and will look like a navigator.”\n\n“Are you a fucking asian? I can’t believe we have a chinksta in the family” the eastern european voice speaks again. Although BetaB is hiding his real voice the app can’t hide a south east asian accent.\n\n“And you? Are you what? I’m not taking shits from a russian troll”\n“Can you fucking stop?” Daves interrupts the conversation.\n“There should be a police scanner somewhere”\n\nWhile driving he reaches under the seat and pulls out a small handheld scanner. He switches it on, tuning it to the right frequency. Police dispatches are now crackling inside the vehicle.\n\n“Suspect is on foot in a 20 min walking radius from %Dave address%, believed to be armed and dangerous...\nI Repeat: All units. Pursuit in progress. Suspect is 33 years old Dave Rager. 5’6” caucasian, slim build, long brown hair and red bum fluff.\nSuspect is on foot in a 20 min walking radius from %Dave address%, believed to be armed and dangerous.”\n\n“Did it say bum fluff?” The Russian rubs it in with a grin.\n\nDave can’t believe they are using the term “bum fluff” to describe his beard. It sure feels strange being described by a police dispatcher but he never thought it would sound offensive.\n\nDave man has slim body frame. People wouldn’t say that those thin shoulders dangling like hangers from a scrawny neck belong to a 33 years old if it wasn’t for the thick pale pinkish skin of an Irish.\n\nA pronounced brow bone hides small eyes that, too much close to each other, give him a slightly inbred look. He has long wiry, brown-gingerish hair falling forward from a straight hairline. He parts his hair in the center over a high forehead letting it lean on his cheeks a-la Court Cobain. His nose is pronounced and ends with two wide nostrils. He has two very straight thin lips that he tends to hold together in his mouth not to reveal his sharp and small teeth. On his cheeks and his chin Dave keeps an untidy, red, sparse and whisky beard.\n\n“You are already 40 minutes walk out of their search area. We have an advantage.” says the Chinese voice and ads “what you mean you have time until 18.00 for the car?”\n“I mean that the owner will denounce a theft when he gets off of his shop.”\n“Ok, listen. You are heading south and than to Canada”\n“South to Canada doesn't sound like a plan.” Daves replies frustrated.\n“I know, I think you should go to Canada. But first you have to leave the state from the south. After 18.00 they’ll be scanning for traces of the truck. You’ll have to get rid of it. You could sink it in a river or a pond. We’ll make them believe you were heading south and stay hidden somewhere there. That is when you will be already on your way to Canada. Options are the Toronto Airport where you will get an airplane to Cuba or a port to get on a ocean freight to Asia.\n“What? You guys are you serious? This is not a movie\"\n“Chinaman is serious, man” the Russian voice says.\n“Airport? Cuba? Freight? Asia?”\n“We are working on it” the Russian replies\n“The priority is now finding the car or a bus to go east. You could pass the border from the state of New York or from the state of Vermont. Near Montreal. If we find a night bus it would be ideal for you so you can sleep and rest. Have you got experience with the Canadian boarder?”\n“No, I never left my state, nor taken an Airplane, to be honest” Dave reply with a sight.\n“You must be honest” the Chinese voice replies. “And this is good news, your face or iris have never been scanned”\nIn 33 years Dave have never left the piece of land delimited by his birth place, his home, his high-school and his jobs."
		},
		{
			"post_id": 4,
			"title": "The Russian Trolls",
			"date_published": 1539621412.807,
			"body": "`Nikita is a 28 years old ethnic Russian who fled Ukraine when he was 20 to avoid the draft after the Euromaidan events. For 7 years he's been working as a paid online troll for a Russian state sponsored Troll Factory. His Job is to influence online conversations and meddle public opinions of western countries. Nikita is a veteran in the office. He's recently discovered how the CryptoNetwork might become a threat to his job as the system doesn't allow to easily create fake accounts.`\n\n![05d1d884b04e7ed5fcc78ffc12d5b463.jpg (670x434)](data/img/post_4_05d1d884b04e7ed5fcc78ffc12d5b463.jpg)\n\nIf the Kremlin was the state actor behind the CryptoNetwrok it wouldn’t be pleased with the results as its creature has spectacularly backfired. If anything, not even the Russian government could imagine that the CryptoNetwork would have become a potent antidote against the proliferation of fake accounts and Russian trolls.\n\nBefore the advent of the Zeronymity people could create fake accounts on Facebook and Twitter or use pseudonymous user-names in sites like Reddit and newspapers. Anybody could spend their time creating hundreds of fake accounts and invade online forums, social media and newspaper comments. Russian trolls were just an industrialised exploit of it.\n\nTroll Farms were State-sponsored anonymous web brigades that employed students or highly educated professionals to coordinately engage in the posting of divisive political content on popular social media. Their action aimed at steering online conversations, confuse and polarise western audiences especially in times of elections. The tactic was to fire up controversial narratives while exhausting, silencing or haunting dissenters.\n\nThe math behind what was called the Russian troll invasion is easy and reveals a surprising truth. Just one troll was estimated to weight up to 10.000 times a normal Internet user. A factory of 400 trolls could count as much as 4 million normal users.\n\nCompared to a normal internet user, professional trolls could be online 10 times longer allowing them to manage 100 accounts who were 100 times more active in terms of posts, comments, likes, retweets, upvotes etcc. This continuous presence and activeness were highly effective in reinforcing followerships and influence of all their accounts and those of other trolls who were spinning the narrative in the same direction. But that’s not it. A troll could keep the kind of focus that would make him sound well informed if not an expert or a paladin of specific matters.\n\nWhile it is true that the Russian government, under Putin, had always deliberately and not even covertly acted to meddle with western public opinion and their democratic processes it’s fair to say that the most of the work was completed by those same governments whose reactions reached a near hysteria level.\n\nWhile it is doubtful that Russia was really determining the outcome of elections or the fall of political leaders, it surely is an an historic fact that, in some kind of a quirk of history, Russia succeeded in deliberately infecting America with the same mental disease its people had during the fall of the soviet union: the conspiracy theory that believes that your people’s values and convictions are being systematically undermined by an external enemy.\n\nIn Russia this conspiracy theory had been one of the most popular for over two decades already and was called the Dulles Doctrine. It was a plan attributed to an alledgedly leaked plan from the head of the US intelligence who, with the prose of a villain, declares how America will defeat Russia by undermining the country’s foundational values.\n\nBy changing the word “arts” with “science” and the world “Bolshevism” with “Democracies” the plan can be read as the typical manual that Putin may have distributing to his trolls in the imagination of the American public.\n\n> _The war will be over. Everything will be settled down and put in order. We shall spend everything we have (all gold, all economic power and resources) on duping and fooling people. Human brains and conscience can be changed._\n> \n> _Having wreaked havoc there, we will insensibly replace people’s values with false ones... We will find like-minded people._\n> \n> _We shall gradually exterminate the social substance in literature and science, we shall discourage scientists from portraying and, so to say, analyzing the processes happening in the depths of the masses. Science, media, the cinema everything will depict and glorify the basest human feelings. In every way we shall support so-called artists who will disseminate and implant into the conscience the cults of sex, violence, sadism and betrayal in short, all sorts of immorality._\n> \n> _We shall create chaos and confusion in state governance. We shall insensibly, but actively and constantly, promote abuse of power by state officials, bribe taking, and unscrupulousness. Honesty and moral rectitude will be ridiculed; nobody will need it, they will become old prejudices. Loutishness and_\n> \n> _impudence, lies and deceit, alcohol and drug abuse, animal fear of each other, shamelessness, treachery, nationalism and ethnic enmity_\n> \n> _All of these we shall smartly and insensibly cultivate and all of this will thrive. And only a few, a very few people will guess and understand what is happening. But we shall put those people in helpless position, make a mockery of them, find ways to belie them and declare them to be the scum of society..._\n> \n> _This way we shall shake generation after generation... We shall target people starting from a young age, making focus on the youth; we will demoralize, corrupt and deprave it. We will make cosmopolites of them._\n> \n> _We will eradicate the spiritual roots of democracy, vulgarize and destroy the foundations of people’s morality. We will undermine generation after generation, eroding this liberal fanaticism. We will take people in hand from their childhood, teenage years. We will always make the main focus on youth, we will be vitiating, corrupting, and defiling it. We’ll make them spies and cosmopolitans. That’s how we’ll do it._\n\nWhat Western governments failed to understand was that most of the times these \"troll agencies\" had been set up by private individuals without any direct connection or mandate from the Russian government. In many cases they were just wealthy businessmen or wannabe oligarchs acting on their own initiative to ingratiate themselves with the head of state. The fashion was similar to what happens with mob leaders who manage to issue orders or obtain favours without explicitly asking for them. \"[Will no one rid me of this troublesome priest?](https://en.wikipedia.org/wiki/Will_no_one_rid_me_of_this_turbulent_priest%3F)\" is what comes to mind to explain this phenomenon.\n\nNevertheless, the best way that the governments sought to counteract was to ask social media platform to embrace a “transparency doctrine” that was firstly enunciated in this way:\n\n> _European governments, the United States, and allies should establish information sharing mechanisms with private sector firms. As Google, Facebook, and Twitter stated in U.S. congressional testimonies in the fall of 2017, they do not wish to be manipulated by actors aiming to undermine democracies. As such, these tech firms should voluntarily cooperate with public sector agencies, particularly the intelligence community, to establish an early warning system when disinformation activities are detected in their systems. To that end, national governments, the European Union, and NATO should establish a designated interlocutor within the intelligence agencies to be the point of contact for receiving and distributing such information, as appropriate. A voluntary information sharing system is ideal, but such processes could also be legislatively mandated._\n\nThe doctrine was a sugar coated way to announce what would have become the imposition to private companies like Google, Reddit, Facebook or Twitter to collect and share personal information about their users among them and with the NSA.\n\nAs it often happens with regulations and controls, this measure was ending up warding off normal users who couldn't be bothered being mass surveilled, labelled or put in watch lists for their opinions. Meanwhile, professional trolls were more and more empowered as they could always find a way to create or even buy fake accounts with no fear or even care of any repercussion.\n\nNikita has been a professional troll for more than 7 years now. A record in his workplace in Saints Petersbourgh where the average turnover is 1 or 2 years.\n\nHe is a 28 years old ethnic Russian born and raised in Ukraine. He was 20 when he fled to Russia. After the Euromaidan events in 2014 he had received a draft notice from the Ukrainian government and he had no intention to join an army or a war he just didn’t care. He had better plans for his life like earning some decent easy money and wasting it in fun and travels.\n\nWhen he was interviewed he used a different version: his side of the story was that he had to leave his homeland out of fear as he had actively participated in on-line forums to counter disinformation campaigns by Ukrainian right wings movements. That’s how he started his career in the “Ukraine department”, one of the hottest front at that time. He made them believe he was truly fighting for the cause.\n\nHis presumed “aligned” background and his proficiency with the English language quickly earned him a promotion on the “Murica Department”. He become a Russian infiltrated veteran of the Great Meme War\", the Internet campaign conducted by supporters of Donald Trump and opponents of Hillary Clinton between June 2015 and November 2016 in an effort to sway the election.\n\nDuring this time period users of social media, especially Reddit and 4chan, conducted numerous \"operations\" using Internet memes, Internet posts and online media to, using their own words, shitpost Donald Trump into the White House.\n\nNikita and his colleagues were paid to meet specific quotas for online comments, blogs and other posts on social media. They were given clear instructions on what issues to write about and how to spin the news of the day.\n\nThey had strict rules regarding their working place and working hours. They had to work in a room not allowed to contact other teams or even to share any informations among them. They worked on 12 hours shifts and had never to be late or leave early.\n\nThe reason behind this rule was control. Control over their activities. Control over their accounts and IPs geographies. Control over conversations among each other. Control over their very same instructions who were only given by voice. If one of them had decided to defect and tell western media about his life at a troll factory he would have found it hard to prove.\n\nBut Nikita was treated differently. He was trusted because they believed his attitude was ideological while others were mostly indifferent and motivated only by money. Not only. He had become strategic for being able to gain the role of official moderator of r/The_donald the pro-Trump subforum on Reddit. This gave him a huge leverage on his superiors who granted him a salary that was double the one of his colleagues and also allowed him to work from remote and travel the world.\n\nNikita wasn’t moved only by greed though. He wouldn’t have last long. He had kind of a nihilist aesthetic motivation: it was about mastering the art of “thinkfluencing” audiences. It was about achieving creativity and watching the effects of his creativity having an impact on the world outside.\n\nEntering the CryptoNetwork as an early adopter had been part of his job. He was among the first ones in the organisation to understand the impact it could have on their operations. Creating fake account was soon becoming hard. The only way was to convince real people to sell their membership unaware of its value and its legal implication included the risk of being indicted by some judge in America for interfering in the United States Political System. It was getting harder to find complicit people and those same accounts he was manipulating were progressively reclaimed by their now concerned original owners. The mechanism was easy, similar to the one of a password recovery process. They just needed to go back to the cell who vouched for their admission and tell its members that they had lost their keys. If they all agree they could generate a new key. The CryptoNetwork was turning out to be increasingly effective in impeding the creation of fake accounts."
		},
		{
			"post_id": 3,
			"title": "The Cactus",
			"date_published": 1539612037.667,
			"body": "**THE CACTUS**\n\n`Vito is asking his twin brother Fabio for advice regarding a privacy feature he's looking to implement in a darknet marketplace for psychedelics he is designing. He'd like to allow buyers to leave legittimate reviews without disclosing their identities. Fabio introduces Vito to the concept of Zero Knowledge proof and suggests him to sign up and explore the potentialities of a new service called the CryptoNetwork.`\n\n![blogger-image--1340323950.jpg (304x480)](data/img/post_3_blogger-image--1340323950.jpg)\n\nVito: “Suppose you buy a cactus on Amazon. When the parcel arrives the box is empty. No cactus in it. You contact the merchant and he says you are lying. He also hints at the fact that he knows who you are and where you live and that he expects you not to leave a bad review. You not only have been scammed but you are also threatened.\n\nVito:”Would you leave a bad review?”\nFabio: “you are into cactuses now?”\nVito: “I did buy a cactus, yes”\nFabio: “on Amazon?”\nVito: “ yes, on Amazon.\nFabio: “What is this smell? bullshit?”\nVito “What’s your point?”\nFabio: “Did you leave the review?”\nVito: “Yes I did, a good one, the cactus was in the box”\nFabio: “uhm yeah, did it tasted good?”\nVito: Vito SENDS A PHOTO OF THE CACTUS ON A COFFEE TABLE IN HIS HOUSE.\nVito: “I didn’t taste it”\n\nFabio: “I’d find your case more interesting if the cactus wasn’t a cactus but a drug and the merchant was a drug dealer. I wouldn’t like to receive the visit from a disgruntled pusher”\nFabio: “you know when your finger smells? it's when your butt itches...”\nFabio: “how about you tell me why your anus is itching?”\nFabio was able to smell his brother bullshits from their very start. He new about\nVito recent attraction for psychedelics drugs. His twin brother hadn’t even been secretive about it not even with his parents. He would define himself a psyconaut and was generally open to describe his experiences as something worth trying. He had behaving like he was really into something but his family was worried. His mother in particular was feeling distraught and helpless about her son’s new course. She was holding his twin brother responsible for keeping an eye on him.\n\nVito: “alright. alright, alright”.\n\nVito: “Look, I’m not in trouble, I haven’t been scammed and I’m not writing any bad review review to any online drug dealer”.\n\nVito: “I just see a problem, and when I see problems I like to devise solutions. That’s me, you know me right?”.\n\nVito wasn’t lying. He wasn’t buying drugs on line, he was about to sell them. His passion had quickly been evolving into a business idea and he was, in fact, designing (running) at that time an illegal online market place for psychedelics. Darknet market were renowned to deliver higher quality substances thanks to their reputation system based on customer reviews. His understanding was that the review mechanics were flawed and and half as good as they could be. The number and detail of the reviews should and could be greatly increased. Customers were having little incentive to live reviews if not big incentive to not leave them at all. It was not uncommon to see deterring disclaimers on vendors’ profile written this way:\n\n* * *\n\n> Our support is awesome and fast (please be patient with your order, we attend to customers in multiple markets and have to sleep sometimes). We deliver all our products and services as described. If you buy any of our product or service, but unhappy with it; let us know and we will try to resolve issues with you amicably. If you post a negative feedback or open a dispute before consulting us, same will be reciprocated; and you will be added to our blacklist and the general buyers blacklist.\n\n* * *\n\nCustomers had two good reasons not to leave bad reviews or to not leave reviews at all.\n\nFirst, they could fear retaliation from aggressive and disappointed merchants who, by the way, were the only one to know their address.\n\nSecond, living a review both positive or negative was admitting their crime. In case the market had been busted by the police and their customers and vendors data uncovered, good luck defending themselves against a candid and enthusiastic admission like: “GREAT GUY AWESOME PRODUCT AMAZING SELLER!\n\nVito had the vision he could further the quality of the reviews not only to guarantee safer products on the market but also to methodically build and offer to the world the most comprehensive and vast “trip reports” collection. He believed that it could be a \"stored value\" not only for commercial reason but most importantly for scientific reasons. The research on potential positive effect of Psychedelics was at the time slowed down if not highly opposed by most governments.\n\nBut he had a puzzle to solve first.\nVito “is there a way to leave a legitimate review without saying who I am”\nFabio: “rephrase”\nVito “Is there a way I can prove I have the right to leave a review to a merchant, because I participated in a transaction with him, without revealing who I am and which transaction I’m referring to? Nobody, not the merchant and not even the platform can now who I am. They only know that that review was left by somebody who was entitled to leave it”.\nFabio: “rephrase again”\nVito: “oh, come on”\nIt was typical of Fabio trying to find the answer right in the question.\nFabio: “You want to prove something without revealing anything”\nVito: “yeah but...”\nFabio: “It’s called Zero Proof of Knowledge, in cryptography”\nFabio: “It is used in some privacy crypto-coins like Monero and Zcash to hide any trace (who sent what to whom) while at same time proving that the transfer was regular and no coin has been created or spent twice.\nFabio: “I don’t reckon anybody citing the case for a ZeroKnowledge Proof on reviews though”.\nFabio: “I know one project that might be approaching what you are looking for.”\n\n“Sign up though to this service -CryptoNetwork Link-.\n\nTheir technology rely on this very same concept to authenticate its members. This system is able to uniquely identify somebody without knowing any information about that very same somebody. Now, imagine if, for some reason, there was an identity system that grants that a person, a living human being, can have one and only one identity in this system. This person could interact with that system anonymously with only one identity making him at the same time anonymous and unique. Now imagine if somebody identified in the system can prove to other systems or other persons that his identity has certain attributes, let's say: that he is a 35 years old male from London without revealing who he is and, at the same time, this same somebody can't prove that his attributes are others than the one he already proved, like for example that he is a 25 years old female from Barcelona. Well this is what the CryptoNetwork is achieving. The term Zeronymity has been informally adopted to describe this condition: being anonymous and yet unique.\n\nI wouldn’t be surprised if the CryptoNetwork ended up becoming sort of a decentralized global anonymous registry that third parties can rely on to have Zero Knowledge of their users and yet at the same time be granted their uniqueness. It could be the end for fake accounts, fake reviews, bots etc. Are you following me?\n\nAs far as I know this is a complete novelty and people are still wrapping their minds around the potential implications and uses of it. I think you might be onto something on this regard. Your users could prove that they are tagged to a transaction without revealing who they are. You could allow them to leave a legitimate review without revealing themselves. Neither to you nor anyone else.\n\nIsn't it what you were looking for?"
		},
		{
			"post_id": 2,
			"title": "Table of Contents",
			"date_published": 1539610830,
			"body": "ONE SENTENCE:\n\nHow a former online drug dealer, accused of killing the British royals, subverted the world as we knew it.\n\nLOGLINE 2\n\nZeronymous is a near future (prophetic?) hard science fiction novel (a-la Black Mirror) happening in the next years but narrated by an historian from the future who reconstructs the facts that will lead to the advent of Zeronymity.\nA mosaic of distinct characters, from distinct subcultures and different parts of the world, whose stories interweave.\n\n*   a red-piller/incell from Rural America on the run from a massive manhunt trying to flee the US\n*   a former online darknet market owner (Italian living in London) who is accused of having killed the royal family.\n*   a Saharawi living in a refugee camp in Algeria who will lead his people to retake Western Sahara\n*   a professional Russian Troll willing to defects or maybe troll again media and intelligence services\n*   a wealthy secretive south East asian from Singapore who will finance the operations from his armchair\n\nA bit Sense8 a bit Crash a bit MrRobot but nothing supernatural or unfeasible.\n\nThe Author goal is to see his work become a documentary film. On this purpose he issues a crypto token that assigns to the majority of the holders the right to sign an Option Agreement.\n\nPITCH:\nA former online drug market dealer, who agreed to work undercover for the UK secret services in the Muslim community, finds himself responsible for the assassination of the royal family during the coronation. Despised by the public opinion and hunted by most secret services he will start finding increasing support from a controversial and goliardic online crypto society. The quest for the truth will lead more and more people questioning the legality of our governments and which should be the duties that a future liberated society will deem those of a \"righteous among the nations\".\n\nPLOT:\nOn february 1st 2025, during the coronation of the King of England a bomb explodes in the Westminster Cathedral decapitating almost the whole royal family and the leadership of the british political establishment. Video and DNA evidences point at Vito Mosca, an italian UK resident, as the suicide bomber responsibile for the attack. Further investigation proves Vito had recently converted to Islam embracing its most radical ideals and establishing relationship with prominent members of the Muslim UK community. Prime minister's continuity plan in his “Letter of Last Resort” assigns power to a military cabinet wich establishes martial law and starts enacting draconian emergency measures with the support of a disheartened and enraged public opinion. Controversies spark also regarding the succession to the British throne.\n\nBut Vito is not dead. Nor an islamic terrorist. He's been framed to enact an inside job by a deviated wing of the UK secret services.The same secret services he had agreed to work for as an undercover agent after been busted managing an online darknet market for psychedelics. Vito, decides not reveal himself and protest his innocence. Instead, taking advantage of his presumed death and, with the help of his twin brother, he starts building a support network through a goliardic and controversial online secret society. His objective is to counter investigate the event and find evidence of motives and parties involved in the plot. His cause will start being embraced by a wider and wider community of geeks and idealists sparse around the world who will commit resources and skills for the mission.\n\nSTRUCTURE\n\n1.  DISASTER 1\n    Vito, an Italian former online drug market dealer, who agreed to work undercover for the UK secret services, finds himself responsible for the assassination of the royal family during the coronation. Despised by the public opinion and hunted by most secret services Vito start finding support from the 4 random members of his CryptoNetwork cell, a controversial secret society which originated as a joke from 4chan.\n2.  DISASTER 2\n    The members of the cell will have their life disrupted and in turn they'll expand the network of people who join to help in gathering information and the proofs that unravel a multi secret service global ordeal. A decentralised prediction market will set a chain reaction that will lead to the doxing of secret agents, handlers and undercover assets of different countries around the world.\n\n3.  DISASTER 3\n    Governments show their true unwillingness to make amend and public opinions their unfathomable apathy to reform them. People who can't breath in the status quo start flocking from all over the world to a Saharawi refugee camp in Algeria with the promise of a peace of land in an about to start anarcho-capitalist utopia in Western Sahara. Vito and the other characters head toward the place.\n\n4.  ENDING\n    The march (or the \"run\") starts. A coalition of governments threatens to stop it with the use of military force. People will run and settle anyway unarmed. One million people gathering in the desert can't be simply bombed or deported. Tomorrow will be about terraforming their new land.\n\n[Twin Cats](http://127.0.0.1:43110/1JparfhnsrWHz3BZzFTpGDgbAayTpErGKs/?Post:17:Twin+Cats)\n\n[The Flashbulb](/1JparfhnsrWHz3BZzFTpGDgbAayTpErGKs/?Post:9:The+Flashbulb)\n\n[ELI5 Terrorism](/1JparfhnsrWHz3BZzFTpGDgbAayTpErGKs/?Post:10:ELI5)\n\n[Dindu Nuffing](http://127.0.0.1:43110/1JparfhnsrWHz3BZzFTpGDgbAayTpErGKs/?Post:16:Dindu+Nuffin)\n\n[The Cactus](/1JparfhnsrWHz3BZzFTpGDgbAayTpErGKs/?Post:3:New+blog+post)\n\n[The Bust](/1JparfhnsrWHz3BZzFTpGDgbAayTpErGKs/?Post:12:The+Bust) (S)\n\n[The Crypto Network](/1JparfhnsrWHz3BZzFTpGDgbAayTpErGKs/?Post:6:New+blog+post)\n\n[The Nerd Room](/1JparfhnsrWHz3BZzFTpGDgbAayTpErGKs/?Post:5:New+blog+post)\n\n[The 3-Minutes-Note](/1JparfhnsrWHz3BZzFTpGDgbAayTpErGKs/?Post:11:The+3-minutes-Note) (S)\n\n[The Tea Ceremony](/1JparfhnsrWHz3BZzFTpGDgbAayTpErGKs/?Post:8:New+blog+post)\n\n[Leadership](http://127.0.0.1:43110/1JparfhnsrWHz3BZzFTpGDgbAayTpErGKs/?Post:15:Leadership)\n\n[The Expanse](http://127.0.0.1:43110/1JparfhnsrWHz3BZzFTpGDgbAayTpErGKs/?Post:19:The+Expanse)\n\n[The Russian Troll](/1JparfhnsrWHz3BZzFTpGDgbAayTpErGKs/?Post:4:New+blog+post)\n\n[The BiTerrarium Project](/1JparfhnsrWHz3BZzFTpGDgbAayTpErGKs/?Post:7:The+Phoenix+Project)"
		},
		{
			"post_id": 1,
			"title": "Option Agreement",
			"date_published": 1433033779.604,
			"body": "“Zeronymous” the hereby published content, is an attempt to tell, in the form of a novel, the historical facts happening after 2018 that will lead to the advent of Zeronymity in the following years.\n\nThe licence regulating the content is “DO WHAT THE FUCK YOU WANT TO PUBLIC LICENSE Version 2” except for the exclusive right to make, adapt and produce a documentary film (the “Film”) as devised in section 1.0 of the option agreement below.\n\n[1.000.0000 Zeronymous tokens](https://etherscan.io/token/0x33fe536d62c13893ceaee5ec9b198af2057fc130#balances) (ZNS) have been issued regulating the rights of the “rights holders”.\n\n28<sup>th</sup> of march is the estimated date for the completion of the work. By that date, at any time, any majority of token holders will be able to sign the option agreement as counterpart of the “Production Company” in the option agreement.\n\nOPTION/PURCHASE AGREEMENT\n\nThis agreement is made as of the **day of **___****, 201_\n\nBETWEEN:\n\nProduction Company, ADDRESS, (“Production Company”)\n\n*   and -\n\na Majority of Zeronymous token Holders “Rights Holders”\n\nRECITALS:\n\nA. Rights Holders are holders of Zeronymous tokens (ZNS) and own all rights with respect to a screenplay entitled Zeronymous (the “Property”);\n\nB. Production Company wishes to produce a documentary film based on or inspired by all or part of the Property; and\n\nC. Production Company wishes to option certain rights in the Property as more particularly set out in this Agreement.\n\nIT IS AGREED:\n\n1.0 Option\n\n1.1 The Rights Holders hereby grants to the Production Company an irrevocable and exclusive option (the “Option”) to acquire all right, title and interest in and to the Property, including without limitation:\n\n(a) the exclusive right to make, adapt and produce by any means now known or hereafter devised, a documentary film (the “Film”) comprised of a series of moving pictures based on, adapted from, or suggested by the Property (including a fictionalization of the Property in whole or in part) and fixed on film, tape, disc (compact, computer, laser or otherwise), wire, audiovisual cartridge, cassette or by any other technical process now known or hereafter devised and to exploit the Film in all language versions and in all manner and media of communication now known or in future developed including, without limitation, by all means of theatrical, television, home video, multi-media and interactive media exploitation;\n\n(b) the exclusive right to use all or any part of the Film and/or Sequel in any other film or for any kind of promotional, advertising, or publicizing purpose, and the right to broadcast and/or transmit by means of television, radio or any process analogous thereto now know or hereafter devised, and the right to license others to do any of the foregoing; and\n\n(c) the exclusive right in perpetuity to exhibit, release, distribute, rent, lease, telecast, transmit and generally exploit, deal in and with the Film and Sequel in any place whatsoever, including homes, theatres, and elsewhere, whether or not a fee is charged directly or indirectly for viewing the Productions and in any and all media whether now known or hereafter devised. For greater certainty, it is acknowledged and agreed that the forgoing includes, without limitation, standard and non-standard television release, theatrical release, non-theatrical release, video-cassette release, Internet release, World Wide Web, CD-ROM, DVD, CD-I and other interactive media release, (collectively the “Rights”). The Film and the Sequel shall be referred to collectively as the “Productions”.\n\n1.2 For the purposes of this Agreement, the term “Property” includes all incidents, plot-lines, themes, stories, lyrics, musical works, ideas, concepts, formats, characters, names, images and titles.\n\n2.0 Option Price\n\n2.1 In consideration for the granting of the Option, the Rights Holders shall be paid a sum 600 Bitcoin distributed to each holder according to his/her shares determined in Zeronymous tokens (the “Option Price”) on the execution of this Agreement. The Option Price shall constitute an advance against the Purchase Price payable pursuant to Section 5.1 below.\n\n3.0 Term and Extension\n\n3.1 Unless extended as provided in Section 3.2, the Option shall terminate at midnight on the day that is 24 months from the date of this Agreement (the “Option Period”).\n\n3.2 The Production Company may extend the Option Period for a further 24 months (the “Renewal Period”) terminating at midnight on the day that is 48 months from the date of this Agreement upon payment to the Rights Holders of the sum of 300 Bitcoin on or before the last day of the Option Period. Such payment shall constitute an advance against the Purchase Price.\n\n4.0 Preproduction Activities\n\n4.1 During the Option Period or the Renewal Period the Rights Holders acknowledges that the Production Company may undertake preproduction activities in connection with any of the rights to be acquired under this Agreement, including, without limitation, the preparation and distribution of proposals, treatments, outlines, and/or teleplays based on the Property.\n\n4.2 If any such preproduction activities are prevented or interrupted due to epidemic, fire, action of the elements, strikes, labour disputes, governmental action or order, court order, act of God, public enemy, wars, riots or civil commotion, the Option Period, Renewal Period or Second Renewal Period, as the case may be, shall be extended for the number of days such an event existed.\n\n5.0 Exercise of Option\n\n5.1 The Production Company may exercise the Option, at any time during the Option Period, the Renewal Period or the Second Renewal Period and on or before the first day of principal photography of the Film by payment to the Rights Holders of the sum of 600 Bitcoin (the “Purchase Price”) less any amounts pursuant to Section 2.1 and Section 3.2.\n\n5.2 The Production Company agrees that the Rights Holders shall receive an amount equal to 10% of the Production Company’s share of net profits received by the Production Company.\n\n5.3 No further compensation shall be paid to the Rights Holders for any of the rights in connection with the Property.\n\n6.0 Grant of Rights\n\n6.1 Upon the exercise of the Option, Rights Holders shall irrevocably and unconditionally assign, grant, and convey to Production Company throughout the universe and in perpetuity any and all rights which Rights Holders may have with respect to all the rights granted to Production Company herein, without further formality.\n\n6.2 The Rights Holders and the Production Company agree that if the Option is exercised, this document shall constitute a valid assignment, grant and conveyance of the Rights. If, however, the Production Company in its sole discretion determines that further documents are required or desired to evidence or effect such assignment, grant and conveyance, the Rights Holders shall execute such further documents within 10 days of such request by the Production Company, failing receipt thereof the Rights Holders hereby grants to the Production Company a power, coupled with an interest, to execute and deliver such documents as the Rights Holders’s attorney in fact.\n\n7.0 Additional Rights\n\n7.1 The Rights Holders hereby grants to the Production Company the following additional Rights, effective as of the date of this Agreement:\n\n(a) the right in its sole discretion to adapt, revise, modify, rearrange, change the sequence of events, add to and/or delete any and all material in respect of the Property and all of its component elements including without limitation, the structure, format, concept, characters, and setting in adapting it for any of the uses provided for under this Agreement;\n\n(b) the right to prepare and use excerpts, synopses and summaries from the Property for the purpose of advertising, publicizing, and/or promoting the exploitation of the Film;\n\n(c) the right to select and use, in Production Company’s sole discretion, any title, including but not limited to, the title of the Property as the title or sub-title in connection with the Productions; and\n\n(d) the right to use and display the name, voice, likeness and biographical material of the Rights Holders for the purpose of promoting, publicizing and advertising the Property, provided that no commercial tie-ups, merchandising or endorsements shall be made by the Production Company using such name, voice, likeness or biographical material without the Rights Holders’s written consent.\n\n(e) the exclusive right to secure copyright registration in the Production Company’s own name or otherwise, and to renew such copyrights whenever permitted;\n\n7.2 The Rights Holders hereby waives all moral rights in the Property, including without limitation the right to prevent modifications, adaptations, additions, deletions, or any other distortions to the Property.\n\n8.0 Credit\n\n8.1 The Production Company shall provide the Rights Holders with a credit on screen in connection with the Productions (subject to standard exclusions and conditions imposed by the distributors and broadcasters of such productions) that recognizes and reflects his role as creator of the concept.\n\n8.2 The Production Company shall not be responsible for any inadvertent failure by the Production Company, or the failure of any other party to provide the specified credit.\n\n9.0 Representations and Warranties\n\n9.1 The Rights Holders represents, warrants and covenants that:\n\n(a) Rights Holders is the sole creator of the Property and the sole and exclusive owner of the Rights and has the full right and authority to enter into this Agreement and to grant the Production Company the Rights;\n\n(b) Rights Holders has not assigned or licensed to any other person, firm or corporation, or in any such manner encumbered, any of the Rights;\n\n(c) Rights Holders has not and will not at any time enter into any agreement which conflicts in any way with this Agreement or undertake or permit activities which will interfere with, diminish or compete with the exercise of any of the Rights, or attempt to sell, license, assign, dispose of or encumber any of the Rights;\n\n(d) the Property is wholly original and contains no matter which infringes the copyrights, right of privacy or publicity, or any other right of any person or which appropriates the personality of any person;\n\n(e) the Property contains no matter which is libelous, or in any other way unlawful;\n\n(f) there are no claims, litigation or other proceedings pending or threatened which could impair, limit, diminish or infringe upon the Rights;\n\n9.2 The Rights Holders will indemnify and hold harmless the Production Company, its directors, officers, employees, agents, licensees, and assigns from and against any claims, actions, losses and expenses (including legal expenses) occasioned, either directly or indirectly, by the breach or alleged breach of any of the above representations, warranties or covenants.\n\n10.0 Miscellaneous\n\n10.1 The Rights Holders may not assign this Agreement or any of its rights or obligations hereunder without the express written consent of the Production Company. The Production Company may assign this Agreement or any of its rights or obligations hereunder to a financially responsible entity that will assume in writing all obligations contained hereunder, without the consent of the Rights Holders. This Agreement shall be binding upon and enure to the benefit of the parties and their respective successors and permitted assigns.\n\n10.2 The Rights Holders shall not, by any means whatsoever, publish or otherwise disseminate (except to his legal and financial advisors) any information, statements or material regarding this Agreement or the Productions, unless the same is first approved in writing by the Production Company.\n\n10.3 The parties agree to execute and deliver such documents and perform and cause to perform such further acts as may be necessary or desirable in order to give full effect to this Agreement.\n\n10.4 This Agreement constitutes the entire agreement between the parties, supersedes all previous agreements, deal memos and negotiations between the parties and their representatives, and may not be modified except by written agreement of the parties.\n\n10.5 The sole remedy of the Rights Holders for any breach or alleged breach of this Agreement by the Production Company shall be limited to the right, if any, to the recovery of money damages at law, and the Rights Holders will have no right by reason of any such breach or alleged breach to rescind this Agreement or to any equitable or injunctive relief, and the rights and waivers granted by the Rights Holders under this Agreement shall not terminate by reason of such breach.\n\n10.6 Nothing herein contained shall be construed to create a partnership or joint venture or employment relationship by or between the parties to this Agreement or to make either of the parties the agent of the other.\n\n10.7 The failure at any time to require performance of any provision of this Agreement shall not affect the full right to require such performance at any later time. The waiver of a breach of any provision shall not constitute a waiver of the provision of any succeeding breach. Should any provision of this Agreement be held invalid, the remainder of the Agreement shall be effective as though such invalid provision has not been contained in this Agreement.\n\n10.8 This Agreement shall be construed in accordance with the laws of England and Wales applicable therein.\n\nIN WITNESS WHEREOF the parties have executed this Agreement.\n\nPRODUCTION COMPANY\n\n* * *\n\nAuthorized signing officer\n\n* * *\n\nRights Holders\n\n* * *\n\nWitness\n\n* * *"
		}
	]
}