{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Too.Much.Internets.",
			"body": "I've been on and off the net since around 1993. Most recently I have been putting my energies into Tor hidden services. Now, I am looking at Zeronet, which is fun to be honest. Love it. All these different technologies to investigate. Then, I accidentally into OpenDNS and the world of alternative TLDs. Oh my.\n\nMy mind is blown. Again.\n\nThis happened when i first got wind of Linux and switched from Windows 98. Take the top off computing and it's huge! I mean, the internet is turtles all the way down. I knew this already in some sense.  It's just crazy having that realisation a second time. Wander off the well worn clearnet path just a little and the trails and forests of the internets (I know.... \"internet\") go all over the place. \n\nI don't want this to sound all \"eternal september\" with a user being faced with the world outside AOL. but woah dude! The opportunities are incredible. Perhaps I am alone in this silliness? Or not. \n\n/random-thought\n\nApologies!",
			"added": 1505278329
		},
		{
			"topic_id": 1525112946,
			"title": "Be Truly Life-oriented",
			"body": "A significant thing that every human being has to do is to structure their psychological and emotional framework around the most fundamental fact of their life – their mortality. Only when you do this will you naturally become eligible for a spiritual process, to a dimension beyond the mundane. The nature of your logical mind is such that it would like to eliminate death completely from its scope of thought. This is why most people are structuring their psychological process around a nonsensical idea of immortality – as if they are forever. Every day, there is no reminder in their thought that this is a limited amount of time and that you are just a baton carrier from the previous generation to the next. Right now, it takes a lifetime for people to understand that they are mortal. They need a heart attack or the appearance of a malignant lump somewhere to remind them.\n\nYou need to celebrate and enjoy every moment of your life because the goddamn life does not wait for you even for a moment.\n\nIf you were immortal, you could enjoy a hundred years each of depression, anxiety, madness and misery and then on the 500th anniversary, you could become joyful. But that is not the case. You are mortal and it is ticking away. This is not a morbid message, it is a life-oriented message. You will be truly life-oriented only if you know that life is a very limited amount of time. Being unpleasant and depressed is death-oriented, isn’t it? You have time and room for all these things only because you think you are immortal. So there is no time for frustration, for depression, for anxiety or for anger. There is no time for any unpleasantness in this life.\n\nIf you think you will be here forever, you will ignore life completely, entangled in your own psychological nonsense which has nothing to do with reality. But suppose you knew you were going to die in the next one hour, you would notice every little bit of life. You would not miss anything.\n\nYou can truly enjoy and joyfully walk through this life only if you know that you are mortal. If you are constantly reminded of this, then this whole life process will unhinge itself from the psychological nonsense and the physicality and will want to experience everything. It will become super-alert. Your life will naturally look for something beyond. A spiritual process will become a natural process of growth for you, not something that you have to be kicked into.",
			"added": 1525112944
		},
		{
			"topic_id": 1554322767,
			"title": "Mirror clearnet site to Zeronet",
			"body": "Is there a guide to do this? I know torrent freak do so, but how to do from a lamp or nginx set up?",
			"added": 1554322764
		}
	],
	"topic_vote": {
		"1555194783_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1
	},
	"next_comment_id": 22,
	"comment": {
		"1_1Nx9ZGUxSaVmY3dMK9yaxcwuD9KtrK38Ra": [
			{
				"comment_id": 1,
				"body": "Red 5 standing by",
				"added": 1505345488
			}
		],
		"15113_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 2,
				"body": "\"a secret section of the online world that is accessible only by using software\"\n\nWe must ban software!! /s",
				"added": 1507504052
			}
		],
		"1516735052_1NGfyDWZU2Y6czRKmXuCTntsf5sbf7pX2P": [
			{
				"comment_id": 3,
				"body": "With language learning and teaching in the UK for immigrants you have what is called the Citizenship test. Basically, there is a multiple choice test in English. You have to pass this. You also have to have English at an approved level, certified by an approved governing body (Like Cambridge exams for example). The level is really low though (achievable). \n\nOnce you have the English at a good level, and you have done the citizenship test, you can have an extended visa/stay in the country. Though it might have changed since I taught on things like that. I doubt it though. \n\nThe thing is, the Government language tests and citizenship exams focus on getting people into shape as far as employability is concerned: Do CVs, telephone skills, job hunting. Except there are immigrant communities from cultures where the women WILL NOT leave the home or move beyond the home-maker role. The tests and materials they have to use are essentially useless for them. Okay, learn to do your CV. But neglect to give these people actual survival skills like dealing with doctors, shop workers, paying bills, querying customer service. They can't do this.",
				"added": 1516740974
			}
		],
		"13_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": [
			{
				"comment_id": 4,
				"body": "Looks interesting. Will report back on Alpha #7 running on something older like android 4.1.x",
				"added": 1523043106
			},
			{
				"comment_id": 5,
				"body": "> [reitoei](#comment_4_1MTNhSVgCJpW8uBjFhnyA5NsgyKbKnvrLG): Looks interesting. Will report back on Alpha #7 running on something older like android 4.1.x\n\nOkay. The lag on the mobile meant an enormous amount of shit posting. A content signing error shot up but didn't prevent the posts from being updated. Apologies for that. Maybe with a more contemporary mobile it would function a little smoother. But, it works and is positive in that respect.",
				"added": 1523046327
			},
			{
				"comment_id": 8,
				"body": "> [test125](#comment_6_1F1Mf5HH3uR6fYG83cyiGZ8w4aNpJBPQDE): been using for 2 months now on the samsung s8,works very well,better with every update.\n\nSpeaking of using ZeroNet on mobile. Runs well on KatKiss ROM on the TF101 tablet. BUT... putting ZeroNet through TOR is a pain. Stock installs of Orbot and Orfox and ZeroNet do not play well. Where do I find the config files? I need to allow them to speak so I can either use Orfox with ZeroNet (cannot get to localhost addresses with it), or use a standard browser and not get TOR addon errors. \n\nWhat do? The install files all assume that you are using Linux or a desktop. I can't even get Orfox About:config stuff to work!",
				"added": 1523194291
			}
		],
		"1523082496_14UupgrdnT7Y8vMES7aqUFgD1fC5RYNrh8": [
			{
				"comment_id": 6,
				"body": "I have a licence. But I am too shy to speak so I DX. SSTV is good fun to try and grab.",
				"added": 1523129391
			},
			{
				"comment_id": 9,
				"body": "> [joczo](#comment_56_14UupgrdnT7Y8vMES7aqUFgD1fC5RYNrh8): 6hbpfrls:I could only encourage you :)reitoei:digital modes a fun,I'm using them also.but I still use good old phone.today we had great conditions from central eu to middle east,so I made some Saudi stations :D it was on CB,tho I have licence also\n\nCentral EU? I might have to grab an HT, hit some repeaters and see how far I can get..... (transatlantic on 2200m has been done)",
				"added": 1523274518
			}
		],
		"1523121756_1AYaudumvgqdyrJs42jyAG9FUUmGHsoiFh": [
			{
				"comment_id": 7,
				"body": "Running. I just go find somewhere with no people and I put one foot in front of the other at a consistent speed.",
				"added": 1523129506
			}
		],
		"1523623838_1GM5NViQbp18za5zzjhvffcHehfpemech9": [
			{
				"comment_id": 10,
				"body": "> [dmio](#comment_1_1CvjHaj47ZxuXD1N8wLciYctgbnzGxARVN): What about Ring?\n\nAnd Signal?",
				"added": 1523655189
			}
		],
		"1524150545_1ErQYVi5mdM9hGb6uT4jg8iwGxcJBJYX8h": [
			{
				"comment_id": 11,
				"body": "> [styromaniac](#comment_269_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Malaria resistance developed in ancient Greece and Africa from the disease's naturally selective pressure on gene pools. The same mutation proliferated as a result. Sickle cell anemia is found in both Greek and African populations because that's what dodges malaria's fatal ability. [...]\n\nI read something similar to that.The point being that similar solutions to evolutionary problems appear across the various sub-species of man (with no one sub-species being superior than another -you may wish to argue the case with that statement!). However, just because the same solutions appear across different sub-species doesn't mean that the same set of genetic switches are triggered to enabling those solutions.  I'm paraphrasing.\n\n(A Troublesome Inheritance: Genes, Race and Human History is a 2014 book by Nicholas Wade)",
				"added": 1524161045
			},
			{
				"comment_id": 12,
				"body": "> [styromaniac](#comment_268_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Also, discrimination contributes to poverty. Poverty, drug trafficking and bad local culture can turn people of any ethnicity into a gangster. [...]\n\nSpeaking of Black Metal (this rocks): https://www.youtube.com/watch?v=uNV6yUhV7uc",
				"added": 1524161547
			}
		],
		"1523809606_1KY1YYCNH5sDor7yu19jEr5yMtiZ5QyWwu": [
			{
				"comment_id": 13,
				"body": "I'm thinking SSB is Single Side-Band for Shortwave amateur radio, but I could be wrong as the amount of data you can transmit at speed over SW is very limited.  SSTV (slow scan TV images. Bit like webcam images via radio) from the ISS is one thing, websites? Interested to know more.",
				"added": 1524256782
			}
		],
		"1526319410_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 14,
				"body": "Reasons to not send HTML emails. Isn't it \"Email 101: Send plain text so any user and any device can read it\"?",
				"added": 1526332558
			}
		],
		"1554322767_1MTNhSVgCJpW8uBjFhnyA5NsgyKbKnvrLG": [
			{
				"comment_id": 15,
				"body": "Static pages sounds doable. Cool. I will investigate. Thanks.",
				"added": 1554358776
			}
		],
		"1554266804_1KtR9NFPH7Gh9ksrWEBJ5Dq8H7DsjBBU1A": [
			{
				"comment_id": 16,
				"body": "\" There are only about 40 people using this app that speak English. \"\n\nSeriously?? That is very bad. Need a decent push to get the ball rolling. [insert sigh here]",
				"added": 1554445570
			}
		],
		"1554671734_1DYcb2gSW6jj7cW75drmGoF952kDLQWMJG": [
			{
				"comment_id": 17,
				"body": "you grabbing torrents or magnets? give an example.",
				"added": 1554702250
			}
		],
		"1555245602_166W3JhPgc183GgfmPqRdKebZbPgjsfaR4": [
			{
				"comment_id": 18,
				"body": "Been busy sorting a new VPN (went for expressvpn) so missed all the fuss. Don't use a lot of FB, Twitter etc. Even started moving away from Google for search. So no idea what is going on.",
				"added": 1555273922
			}
		],
		"1555273304_1BXdtJD8d5s813aPwKoxEjGWPaNGB8deNh": [
			{
				"comment_id": 19,
				"body": "forum for what subject?",
				"added": 1555273952
			},
			{
				"comment_id": 20,
				"body": "> [kaffie](#comment_832_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Forums are usually topic-specific, not a general thing. As for active forums I like to frequent, there's gbatemp and romhacking.net. Both are focused on romhacking and console modding. [...]\n\nLiking Arisuchan, thanks.",
				"added": 1555306890
			}
		],
		"1555521255_1ME9gwj9Exp9cBbuSxxr1mEiySEjmXNA2w": [
			{
				"comment_id": 21,
				"body": "> [klu9](#comment_153_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): Am I wrong or can .cbz extension just be changed to .zip and it still works?\n\nyeah, works. CBZs are either zip or rar renamed.",
				"added": 1555537255
			}
		]
	},
	"comment_vote": {
		"21_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"1_1CvjHaj47ZxuXD1N8wLciYctgbnzGxARVN": 1
	}
}