{
	"title": "PromusikBlog",
	"description": "My ZeroBlog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 25,
	"demo": false,
	"modified": 1580000075,
	"post": [
		{
			"post_id": 24,
			"title": "Каталог onion-ресурсов",
			"date_published": 1579999819.044,
			"body": "Как всем известно в TOR (как сосбстенно и в ZeroNet) с поиском вообще плохо. Решил завести блокнотик с onion-ресурсами на всякий пожарный.\n\nКаталог будет периодически обновляться. По другому организовывать не стал т.к. это просто моя записная книжка.\n\n**Можете добавлять комментариями ваши заначки, я их включу в каталог.**\n\nНу в общем начнём с Pornhub...\n\nPornhub - [pornhubthbh7ap3u.onion](http://pornhubthbh7ap3u.onion/)"
		},
		{
			"post_id": 23,
			"title": "Квадрокоптеро-блог",
			"date_published": 1559438763.774,
			"body": "В общем полгода назад я занялся квадрокоптеростроительством. Прошло полгода (большую часть времени я тупо ждал посылки с Aliexpress) и я наконец собрал свой FPV-квадрокоптер на 250 раме... Сталкивался со всякими трудностями во время строительства, но писать не было времени и желания т.к. + ко всему был сильно увлечён процессом сборки и оптимизации.\n\nВчера к сожалению мой квадрокоптер улетел навсегда. Я совершил целый ряд ошибок и упущений при подготовке к взлёту и во время полёта. Квадрик я так и не нашёл.\n\nЗа последние полгода я потратил много времени и сил я сборку и оптимизацию квадрокоптера. С кожалению в Интеренете много разрозненной информации по этому делу. Каждый колхозит свои грабли, а сообщество довольно разрозненно и на конкретные вопросы не сильно отвечают.\n\nДумаю будет не плохо осветить процесс сборки нового квадрика с нуля в ZeroNet и поделиться набранным за полгода скилом, ведь сегодня у меня остался лишь он.\n\nПочему именно ZeroNet? Потому что здесь лампово и приятно. Для видео попробую использовать какой-нибудь PeerTube или что-то подобное. Хотя не уверен что способен на видео. В любом случае ваши советы по выбору видеохостинга приветствуются.\n\nСобственно ссылка на блог: http://127.0.0.1:43110/1A2rh6nBbAHXT14PX46vcfybqj6JEVwkWa/?Home"
		},
		{
			"post_id": 22,
			"title": "Riot.im vs Wire",
			"date_published": 1550843544.32,
			"body": "Нет, это не тестирование двух месседжеров. Это моя маленькая история выбора.\n\nВозникла потребность в видеозвонилке без привязки к номеру телефона. Да и вообще не хочется быть инфошлюхой для всяких мордокниг и прочего... P2P не подошли из-за жора аккума телефона.\n\nВ общем наслушался хвалебных отзывов про Wire (который от создателей старого Skype)... Телефон для регистрации не требуется. Вроде бы ничего, но в уведомления приложение нормально так и не смогло. Т.е. я так и не смог добиться адекватного получения уведомлений от этого приложения - мелодия о звонке играет и всё, а какое приложение звонит - не понятно. Плюс при регистрации не загрузил аватарку, а она мне нужна (не спрашивайте зачем), но изменить (точнее установить) её после регистрации я так и не смог - просто не нашел где. Качество видео меня не удивило ничем - всё как и везде, ничем не лучше. Ну-у, и нет нормального приложения под Linux.\n\nПриятно удивил Riot.im. Не смотря на тормознутый сервер matrix.org, оно на удивление работало! Проблем с качеством связи не заметил. Уведомления настраиваются и вполне можно довести всё настройками до вменяемого уровня. В общем мой выбор пал на Riot.im. От него, если честно я не ожидал того, что он покроет мои потребности.\n\nP.S. Интерфейсы у них у обоих... как бы это сказать... не привычные."
		},
		{
			"post_id": 21,
			"title": "Riot in the Matrix: интервью с создателем мессенджера Riot.im о\nдецентрализации и вызовах, стоящих перед криптоэнтузиастами сегодня",
			"date_published": 1549963774.251,
			"body": "Многие уже слышали о Riot.im, децентрализованном (федерированном) мессенджере с открытым кодом, который поддерживает сквозное шифрование с\nиспользованием библиотеки Olm. Не волнуйтесь! Ребята не пытаются\nизобрести свою собственную крипту. По сути, Olm является версией\nпротокола Signal и обладает необходимыми современному шифрованному\nмессенджеру свойствами, такими как прямая и обратная секретность (future\nand forward secrecy), благодаря созданию эфемерных сессионных ключей по\nалгоритму Double Ratchet. Это значит, что сообщения, которые вы написали\nранее или напишите в будущем, будет невозможно прочитать, имея на руках\nтолько текущий ключ шифрования.\n\nRiot.im даёт возможность создавать открытые и закрытые чаты, не зависит от номера телефона, поддерживает видео и аудио звонки. Но\nглавная фишка Riot.im, конечно, это его совместимость с другими\nмессенджерами — от Slack и Telegram до WhatsApp и IRC. Это возможно\nблагодаря лежащему в основе него протоколу Matrix.org. Matrix\nпредставляет собой протокол обмена данными, который, согласно амбициям\nего создателей, мог бы стать открытой непроприетарной децентрализованной\nальтернативой современным протоколам телекоммуникаций PSTN (Public\nSwitched Telephone Network). На основе протокола Matrix можно\nразворачивать множество собственных проектов, а также налаживать \"мосты\" и обеспечивать связность между разными приложениями.\n\nЯ поговорила с Мэттью Ходгсоном, британским инженером, соавтором проекта Matrix.org, об истории проекта и его бизнес-модели, о проблемах\nдецентрализации, об активистской составляющей проекта (вернее, её\nотсутствии) и о вызовах, стоящих перед криптоэнтузиастами сегодня.\n\n**- Откуда у тебя появилась идея создать Matrix.org?**\n\n_Я бы сказал что Matrix в целом — очень амбициозный проект. Мы хотели\nсделать новую экосистему, которая была бы открытой и \"интероперабельной\", то есть, обеспечивала бы совместимость различных протоколов. Сейчас в\nсети всё стало очень фрагментированно. Для многих пользователей интернет\n— это фейсбук, гугл, твиттер. Все эти решения по-своему проблематичны,\nа главное, они закрыты. Это нарушает идею сетевой открытости. А мы\nхотели бы создать параллельную сеть, которая как бы существует « поверх\n» Интернета и обладает свойствами Интернета — открытостью и\nдецентрализацией. В идеале энтузиасты смогут разрабатывать свои\nприложения на основе Матрикса._\n\n**- Сколько вас сейчас в команде?**\n\n_Сейчас нас 16 человек, 11 в Лондоне, 5 в Ренне (Бретань, Франция). Мы\nосновали Матрикс вместе с Амандин, она живёт в Ренне и занимается\nорганизационной и финансовой деятельностью, а я курирую разработку.\nAmandine Le Pape, соосновательница Matrix.org_\n\n**- А как вы поддерживаете проект финансово?**\n\n<span data-cke-bookmark=\"1\" style=\"display: none;\"> </span>_Нам удалось убедить одну большую компанию профинансировать наш проект\nв долгосрочной перспективе. Эта компания называется Amdocs. Они\nзанимаются разработкой биллинговых решений и других продуктов для\nтелеком-индустрии. Но с 2017 года мы отошли от финансирования Amdocs и\nсоздали свой фонд \"New Vector\", который занимается консалтингом для\nтех, кто хочет пользоваться услугами хостинга в Matrix или хочет\nпользоваться Matrix.org с коммерческими целями. Например, мы помогаем\nналаживать « мосты » между мессенджерами. Если у меня есть предприятие,\nгде все общаются через Slack, я могу платить огромные деньги Slack за\nкорпоративные решения, а могу заплатить Matrix условные два бакса в\nмесяц за мосты. Недавно New Vector получил инвестиции от одного\nEthereum-стартапа. Ну и в апреле этого года правительство Франции\nпредложило нам помочь им в разработке решения для внутреннего\nмессенджера, который будет использоваться госслужащими и будет работать\nна основе Matrix/Riot._\n\n **- Riot.im в \"океане мессенджеров\" : в чём фишка шифрования в Matrix?  <span data-cke-bookmark=\"1\" style=\"display: none;\"></span> А ты сам лично беспокоился о цифровой безопасности до создания Matrix?**\n\n_Я не очень большой параноик. У меня есть PGP-ключ года с\nдвухтысячного, хотя я использовал его в общей сложности раз 6, наверно\nпотому что у меня нет каких-то сверхсекретных вопросов, да и контекст\nдругой. Если бы я вырос не в Оксфорде, а в России, думаю, мои привычки\nбыли бы другими._\n\n**- А какие из шифрованных мессенджеров ты используешь?**\n\n_Я стараюсь следить за всеми проектами в этой области. У меня сейчас\nустановлено около 10 разных мессенджеров. В прошлом я и сам разрабатывал\nчастные мессенджеры для телекоммуникационных компаний, например Buygues.\nЯ штук 25 таких мессенджеров написал, увы._\n\n**- Почему увы?**\n\n_Потому что в итоге всё получается фрагментированным, у каждого\nмессенджера свои проблемы, а у некоторых даже свои протоколы, как я уже\nговорил. В этом проблема не интероперабельных, не открытых,\nцентрализованных систем. Я бы сказал что с наибольшим интересом наблюдаю\nза такими проектами как Wire, Threema, WhatsApp и Signal, в_от.\n\n**- Что ты, кстати, думаешь о Signal? Их протокол сейчас является\nнегласным эталоном в области шифрования мгновенных сообщений, но многие\nжалуются на отдельные проблемы этого проекта.**\n\n_Ну, пользовательский интерфейс у них весьма ограниченный, и в целом\nприложение не очень надёжное в плане доставки сообщений. Но когда мы\nтолько начинали работать над Matrix, мне нужно было какое-то шифрование\nдля общения с командой и партнёрами. Я не мог отправлять не зашифрованные\nсообщения, так как мы обсуждали финансовые проблемы и другие важные\nвопросы, ну и все в итоге начали использовать Signal. Теперь когда мы\nвнедрили сквозное шифрование в Matrix, мы перешли на него._\n\n**- Кстати, расскажи немного о принципах шифрования в Matrix? Интересно\nкак вы нашли решение для сквозного шифрования в условиях, по сути,\nфедерированной сети.**\n\n_Архитектура Матрикса децентрализована, поэтому если мы с тобой,\nнапример, используем разные Матрикс-сервера для общения, наши сообщения\nбудут храниться на обоих серверах, то есть, нам придётся доверять\nсисадминам, которые держат эти сервера. Представь себе чат на 5000\nчеловек и, например, 1000 серверов. Если ты делишься чем-то важным, оно\nбудет скопировано на все эти тысячу серверов. В общем, это большая\nпроблема. Поэтому Матрикс изначально продумывался с возможностью\nвключения сквозного шифрования, чтобы не включать этот фактор \"доверия\" и не волноваться, что сисадмины будут читать наши сообщения._\n\n**- Я знаю что шифрование уже возможно включать в Riot.im. А что с\nостальными клиентами? Как вообще обстоят дела с разными клиентами для\nМатрикса?**\n\nУ Матрикс сейчас около 40 разных клиентов, а также много бриджей,\nпозволяющих в принципе связать Матрикс с другими приложениями и\nмессенджерами, например, IRC, Slack, Telegram, Github… Поэтому, конечно,\nввести шифрование везде по умолчанию слишком сложно. Это может\nконфликтовать с тем как разные пользователи уже настроили свои каналы\nсвязи и привести к большому количеству сбоев. Поэтому шифрование в\nRiot.im и в Матриксе в целом идёт не по умолчанию, а опт-ин (по выбору\nпользователя). Вы должны зайти в настройки чата и включить его. В\nбудущем мы планируем сделать шифрование по умолчанию когда все\nпользователи комнаты используют Riot, с возможной настройкой мостов для\nтех участников, которые захотят присоединиться к чату через другой клиент.\n\n**- Скажи, кто ваши пользователи? И много ли в Matrix политических сообществ?**\n\n_Я стараюсь следить за тем что происходит в Matrix и по моим\nнаблюдениям, с культурологической точки зрения, так сказать, это очень\nинтересно. Я уверен, в Matrix есть много потайных комнат, и вполне\nвозможно есть и тёмная сторона Matrix, о которой я не имею\nпредставления. В целом много групп взаимопомощи для людей с различными\nпсихологическими состояниями. Есть много групп разных опенсорсных\nпроектов, групп по кибербезопасности, в том числе группы по джабберу,\nпотому что люди считают что Matrix похож на XMPP, хотя на самом деле они\nрешают похожие задачи разными способами. Растёт русскоязычное\nсообщество. Ну и есть ещё такие группы как pizza gate, это альт-райты. Я\nне очень рад что они есть в Matrix, если честно. Это ребята типа тех кто\nголосует за Трампа. Ну и есть ещё всякие комнаты по децентрализации. В\nmatrix больше 5000 комнат._\n\n**- В России, да и в целом в странах, где мне довелось бывать и работать,\nмногие воспринимают Riot.im как мессенджер для активистов. Насколько\nважна эта идеологическая сторона для проекта?**\n\n_Я бы не сказал что наши разработчики политизированы, им главное что\nпроект интересный технически и полезный с точки зрения децентрализации\nинфраструктуры. Я, если честно, тоже не могу похвастаться какой-то\nчёткой политической позицией. Мне, конечно, близки проблемы прав\nчеловека, особенно право на частную жизнь, но Матрикс нельзя сравнить с\nSignal, Ricochet или Tor, которые задумывались для определённых целевых\nаудиторий близких к, так сказать, активистским кругам. Наша задача —\nделать хороший технический продукт, который будет выполнять свои функции\nс минимальными багами. Но конечно сообщество на нас давит потихоньку. Я\nнедавно спорил с Мокси Марлинспайком, автором Signal. Он считает что\nдецентрализованные проекты, такие как Matrix, в целом более уязвимы,\nпотому что ты не можешь контролировать всю сеть, все сервера, все\nимплементации и клиенты. Но я считаю что децентрализация очень важна,\nпотому что пользователь получает свободу выбора каким сервером\nпользоваться, какой клиент установить. С другой стороны, конечно,\nпарадокс децентрализованных систем в том что я не всегда уверен что могу\nтак же доверять клиенту или серверу моего собеседника._\n\n**- Сейчас многие говорят о проблемах централизованных платформ не только\nс точки зрения безопасности, но и с точки зрения распространения\nдезинформации. Как Матрикс решает такого рода вопросы?**\n\n_Действительно, сейчас интересно наблюдать за разочарованными\nпользователями, которые постепенно бегут с централизованных платформ\nиз-за такого рода проблем. И мне кажется что проблема фейк ньюз и «\nэхо-комнат », свойственная Фейсбуку и подобным платформам, может быть\nрешена с помощью умных децентрализованных репутационных систем. Мы\nсейчас много думаем над введением репутационной системы, которая\nпозволит пользователям снизить количество спама, а также курировать\nконтент, который они потребляют. Первая задача такого рода репутационной\nсистемы — фильтровать контакт-запросы от пользователей с низкой\nрепутацией. В Riot.im перед тем как начать с кем-то общаться надо\nпринять контакт-запрос. Часто бывает спам в контакт-запросах. Мы хотим\nрешать эту проблему децентрализованным путём — это значит, мы не хотим\nчтобы какая-то авторитарная инстанция решала что хорошо, а что плохо. В\nэтом смысле мы сторонники либерального плюрализма, я бы так сказал. То\nесть сами критерии по которым система будет решать спам ли это должны\nбыть децентрализованы, настраиваться пользователями, и в идеале должно\nбыть ещё и анонимным. В этом кроется противоречие — ведь чтобы понять\nкогда и почему ты отправляешь контакт в спам, надо иметь какие-то\nпредставления о том что это за человек. Поэтому сейчас мы думаем о том\nчтобы построить подобную репутационную систему на идее « веб оф траст »\n(« сеть доверия »), как это делает, например, Scuttlebut. У них там всё\nработает так, что когда к тебе « стучится » человек, система как бы\nговорит ему — привет, я доверяю тебе потому что у нас есть доказуемая\nсеть доверия. В Матриксе такого пока нет, мы ещё думаем над тем какое\nименно решение выбрать._\n\n**- А можешь немного поспойлить? Какие у вас сейчас есть идеи например?**\n\n_Ну вот например есть идея ввести голоса « за » и « против », чтобы\nоценивать сообщения. Ну, то есть, там должно быть больше параметров,\nпотому что есть не только « лайки » и « дизлайки », а есть куча других\nреакций, как в фейсбуке например. То есть, например, если я прочитал\nсообщение и мне показалось что оно « вдохновляет », я ставлю ему реакцию\n« вдохновляет », и система говорит мне — хэй, хочешь видеть\nвдохновляющие вещи ? Фейсбук так не делает, он не показывает скрытую\nчасть айсберга своего алгоритма, ты не понимаешь почему тебе показывают\nто или иное содержание, и не можешь решать по каким параметрам система\nбудет фильтровать твой контент. Мы же хотим дать людям возможность иметь\nгораздо большее влияние на курирование контента. Я считаю, это очень\nинтересный поворот с точки зрения социологии: мы делимся с тобой этой\nинформацией, потому что твои друзья считают что это круто, но возможно\nтебе будет интересно узнать что 95 процентов пользователей считает этот\nконтент ужасным. Вот, в принципе, в этом и состоит главный вызов\nрепутационной системы — сделать сам алгоритм видимым и изменяемым.\n«Мы — альтруистические кибер-хиппи»: об « утопистах » из Matrix и\nтехнических стандартах_\n\n**- Думал ли ты стандардизовать Матрикс ? Вы уже общались с IETF ?**\n\n_Мы много общаемся с W3C и чуть-чуть с IETF. Я работал с W3C достаточно\nдавно и понимаю что у них есть свои ограничения. Мы хотим сначала\nдоработать Матрикс до более зрелой и стабильной версии, а потом уже\nвыбрать подходящую регулирующую организацию. Сейчас Матрикс всё ещё\nбыстро развивается, и если бы мы пытались, например, ввести сквозное\nшифрование после стандардизации, это заняло бы года 4\\. Поэтому мы пока\nработаем так, исходя из практических соображений._\n\n**- Вообще со стандардизацией протоколов шифрования последнее время\nпроисходит интересное : например, Signal не стремятся стандардизировать\nсвой протокол, в то время как многие проекты, включая вас, так или иначе\nимплементировали ту или иную версию Axolotl (сейчас Double-Ratchet). То\nесть, фактически, это стандарт, просто неофициальный. Как думаешь, с чем\nсвязана их позиция?**\n\n_Я думаю что Open Whisper Systems решили не начинать стандардизацию по\nнескольким причинам. Во-первых, это дало им больше манёвренности в том\nсмысле что они могут изменять протокол как хотят, а во-вторых,\nотсутствие стандарта даёт протоколу фактически статус интеллектуальной\nсобственности OWS. Вообще с начала существования Axolotl была проделана\nбольшая работа — ребята написали хорошую документацию протокола, и это\nпроизошло во многом благодаря давлению со стороны сообщества, в том\nчисле, и от нас. Мы им писали в 2016 году мол, ребята, мы работали с\nвашим протоколом и написали более-менее чистую, стандардизированную\nверсию, своё математическое доказательство того как он работает. Если\nинтересно — вот оно. Но, конечно, они не приняли его, и может быть\nвообще не посмотрели._\n\n**- То есть, они вам вообще не ответили ?**\n\n_Ответили но без какого-то фидбека по нашему протоколу. Они просто\nсказали что рады что мы используем их протокол, но очень просили не\nназывать его Axolotl или Signal, и чётко прописать что наша версия\nнезависима от их. Мы так и сделали. В случае с другими проектами,\nнапример, Wire, всё прошло не так гладко. Но дело в том что мы — открыто\nнекоммерческий проект с лицензией Apache, она позволяет всем\nиспользовать наш код, будь то коммерческий или опенсорсный проект. Когда\nя говорил с Мокси про Matrix, он сказал — вы психи, но если у вас\nполучится, я буду очень рад, так что удачи, мол. В случае с Wire речь\nидёт о полукоммерческой платформе, у которой долгое время серверная\nчасть кода была закрыта, считай, до 2017 года. Для Мокси Wire были\nконкурентами, а мы, скорее, похожи на альтруистических кибер-хиппи,\nидеалистов, которые тихо делают свой Matrix в углу. По циничным\nпрогнозам Мокси мы должны были провалиться, но раз мы не провалились, от\nэтого всем только лучше, включая самого Мокси. Так почему же нас не\nподдерживать ?_\n\n**- А расскажи про purism ? Что случилось с проектом Librem 5? В\nизначальном варианте этот новый “безопасный телефон” должен был\nподдерживать Matrix по умолчанию.**\n\n_Скорей всего, CEO Purism разлюбил нас, потому что мы надеялись что его\nкоманда поможет в разработке Matrix после того как вся кампания по\nраскрутке Librem5 была построена на нас. Но в итоге они вообще ничего не\nсделали, только попросили нас бесплатно их поддерживать и разработать\nклиент для Matrix для хэндсета. В итоге они продвинули другое приложение\n— Chatty, работающее на протоколе XMPP. В самой команде Purism\nоказалось много любителей libpurple и XMPP, которые не очень любят\nMatrix. Но к счастью в Purism работает несколько разработчиков Fractal,\nэто клиент для Matrix на GNOME. Они стараются доработать Fractal и\nпродвинуть его как альтернативный мессенджер в Librem. Мы надеемся что в\nитоге телефон будет продаваться с несколькими мессенджерами, одним из\nкоторых, надеемся, будет Fractal._ \n\n**- А как Riot.im работает с так называемым « законным перехватом » ? Есть\nли у вас отчёты (transparency report) о том, что вы выдаёте властям в\nтой или иной стране и при каких обстоятельствах ?**\n\n_Если вы держите ваш собственный сервер, у вас полный контроль над ним,\nи, соответственно, ответственность за « законный перехват » тоже лежит\nна вас. Сервер Matrix.org находится в Великобритании, и нам приходится\nработать под британским законодательством. У нас ещё не было ни одного\nотчёта, потому что нас никогда не просили о сотрудничестве в области\nзаконного перехвата. Конечно, у нас нет никакого доступа к комнатам, в\nкоторых активировано сквозное шифрование, так что мы ничего не можем\nвыдать властям. Мы можем что-либо выдать только если это принудительно в\nконтексте законов Великобритании. Если вы волнуетесь — держите ваш\nсобственный сервер._\n\n**- А если например вам известно что та или иная страна регулярно нарушает\nправа человека, будете ли вы вс1 равно сотрудничать и выдавать\nинформацию о пользователях-гражданах этой страны ?**\n\n_Мы обязаны подчиняться только законам Великобритании. Я не эксперт в\nмеждународном праве, но я бы очень удивлен, если бы страна, нарушающая\nправа человека, смогла бы уговорить правительство Британии заставить нас\nвыдать им данные. У нас есть доступ только к метаданным на сервере\nmatrix.org, и если вы беспокоитесь за вашу безопасность — надо заводить\nсобственный сервер и иметь полный контроль над ним._\n\n**- В Matrix участвует множество проектов. У каждого из них по идее должна\nбыть своя политика безопасности данных ?**\n\n_У Матрикс сейчас больше 15 тысяч серверов, только один из них —\nmatrix.org, который держим мы. У нас есть политика безопасности данных\nдля нашего сервера, но другие владельцы матрикс-серверов могут и вовсе\nне иметь такого рода политики, потому что они держат сервера для себя, у\nних нет времени и средств нанимать специального юриста, который им такое\nпропишет._\n\n**- Храните ли вы какие-то данные ?**\n\n_Всё зависит от конфигурации. У нас есть опциональный Матрикс-сервер,\nкоторый собирает базовую статистику, вроде количества активных\nпользователей, количества учётных записей. Однако это не по умолчанию,\nто есть, тебе как администратору сервера надо согласиться на эту опцию.\nЯ бы сказал 70–80 процентов наших пользователей не соглашаются на сбор\nданных, и мы к этому готовы, так как Matrix рассчитан прежде всего на\nсообщества, чувствительные к вопросам безопасности данных. Пока что наша\nпублика в массе своей — так называемые power-users, то есть,\nтехно-энтузиасты, разработчики. Но у нас есть ещё разные « субкультурные\n» сообщества — много групп по криптовалюте, что в целом предсказуемо,\nязыковые сообщества — японское, эсперанто, большое русскоязычное\nсообщество, а после ввода сквозного шифрования появилось много китайских\nпользователе Фан-субкультуры, типа фьюриз, это ребята, которые\nидентифицируют себя с животными. Но среди фьюриз очень много гиков, так\nчто неудивтельно что они зависают в Matrix._\n\n**- Напоследок задам тебе более конкретные технические вопросы от\nзаинтересованных русскоязычных пользователей. Первое, наболевшее так\nсказать: в настоящей версии Riot невозможно скрывать список участников,\nприсоединившихся к тому или иному чату. Планируете ли вы изменить это ?**\n\n_Да. У нас есть открытые issues по этой проблеме, например тут. В\nцелом, исправить это должно быть достаточно легко, благодаря недавним\nусилиям по улучшению «ленивой подгрузки» участников комнаты._\n\n**- Людям очень любопытно понять выбор стека : почему вы выбрали\nHTTP-PUT/WebRTC, почему JSON? Некоторые пользователи считают что было бы\nлучше выбрать низкоуровневый бинарный формат и/или gRPC.**\n\n_Потому что HTTP+JSON очень простой, разработчикам легко его\nиспользовать. Это всего лишь базовый транспорт, и мы конечно\nподдерживаем тех кто разрабатывает более эффективные варианты,\nоснованные на COAP, MQTT, gRPC, protobufs и так далее. Но, должен\nпризнаться, я видел не много альтернатив, потому что в целом HTTP+JSON\nнормально работают._\n\n**- У вас большое русскоязычное пользовательское сообщество, в основном из\nтехнических кругов. Сейчас, в связи с проблемами вокруг Telegram,\nпользователи, не являющиеся техническими экспертами, тоже ищут\nальтернативы Telegram. Однако некоторые из важных функций,\nприсутствующие в Telegram, отсутствуют в Riot. Например, каналы.\nПланируете ли вы запустить подобную функцию в Riot.im?**\n\n_Да, мы планируем сделать Riot настолько мэйнстримным и удобным,\nнасколько возможно (вот например обзор нового дизайна Riot). Я думаю что\n« каналы » это та же функция « auditorium mode »._\n\n**- Как ты думаешь, какой сейчас главный вызов лежит перед теми, кто\nработает в сфере безопасных коммуникаций ?**\n\n_Я не буду оригинален, если скажу, что главная проблема — юзер\nэкспириенс, пользовательский опыт. Очень сложно найти какой-то\nболее-менее безопасный и одновременно удобный способ предоставить\nпользователям возможность шифровать коммуникации. Второй крупный вызов в\nэтом плане — дать пользователям возможность фильтровать контент, который\nони не хотят видеть. Как дать пользователям возможность курировать свой\nконтент так, чтобы не подавлять их с помощью невидимых, закрытых от них\nалгоритмов, как это делают централизованные проприетарные платформ_ы ?\n\n**- Как ты видишь ближайшее будущее Matrix/Riot ?**\n\n_Мы выпускаем релиз 1.0 спецификаций для Matrix, а также наконец-то\nновую стабильную версию Riot. Надеюсь что эта версия решит оставшиеся\nпроблемы в плане стабильности, масштабируемости и юзабельности. Мы также\nзапускаем решение для удобного Matrix-хостинга в ближайшие недели. Потом\nмы планируем добавить новые фичи : реакции, возможность редактировать\nсообщения, и, может быть, возможность « трединга ». Мы планируем\nдобавить больше интерактива, например, возможность оплаты услуг внутри\nкомнат. А затем, наконец-то, займёмся проблемой репутации (создавать\nфильтры для курирования контента). Я надеюсь, к этому моменту произойдут\nизменения и в остальной экосистеме, и Matrix сможет по-настоящему\nбросить вызов централизованным системам и захватить мир, как в своё\nвремя сделала сеть._"
		},
		{
			"post_id": 20,
			"title": "Месседжеропроблемы",
			"date_published": 1549886109.781,
			"body": "Последнее время меня не покидает мысль о месседжеропроблемах в которые втянут я и всё человечество... Может конечно и зря меня заботит эта проблема и можно просто потреблять, но с учётом гнёта контролирующих органов и законодателей - любое слово может стать источником проблем...\n\nБесплатный сыр бывает только в мышеловке... Все эти сказки про end-to-end в популярных месседжерах остаются в своем большинстве лишь сказками и реализуют end-to-end лишь в связке клиент-сервер. Пользователи - лишь продукт, источник для сбора информации, которую можно потом использовать для любых целей. Кто владеет информацией - владеет Миром.\n\nВ общем у меня нет особой цели общаться с тонной людей, которые кроме вацапа ничего больше не умеют. По сути у меня есть ограниченный круг людей с которыми я хотел бы иметь качественные видео/аудиозвонки, обёрнутые в реальный end-to-end с использованием или децентрализованного протокола или собственного сервера.\n\nЕсть конечно Wire... И он даже номера телефона не просит. Но сервер не мой, федерации нет. Пробовал Ring и TOX, но они мягко говоря не удобны, не стабильны и долго устанавливают соединение с определенным процентом неуспеха. Т.е. быстро взять и позвонить вряд ли получится.\n\nКак последние варианты остались: XMPP и Matrix. Первый как стюардесса, а второй думается что ещё даже не родился. Хотя конечно же родился! Вот сейчас раздумываю о поднятии своего сервера, но \"потыкав\" клиент от разработчиков протокола (Riot.im) мне как-то взгрустнулось...\n\nПочем в Riot.im всё сделано на гребанном Electron?! Ну ладно, это фигня... Но сам интерфейс мягко говоря не удобен. Ведь уже давно образовался некий прообраз интерфейса месседжера. Все популярные месседжеры довольно похожи и к ним уже все привыкли. Но у создателей Riot.im какое-то альтернативное мышление... Тонна не нужных настроек, а нужных нет. С дизайном так же какие-то проблемы. Скорость работы на их сервере убога. Говорят на своем сервере получше. Но всё это похоже на какой-то странно продуманный мирок...\n\nС альтернативными клиентами Matrix я так понимаю всё ещё хуже... Пока не понимаю куда мне идти с Telegram...\n\nP.S. если кто поведает о качестве ауди/видео звонков в Matrix - буду признателен."
		},
		{
			"post_id": 19,
			"title": "Блог 1984",
			"date_published": 1549456439.59,
			"body": "Давно хотел и всё же решился завести \"Блог 1984\".\n\nСсылка: [http://127.0.0.1:43110/1NmsmiXiAUJkrjtdh8VgJXb9FKXMzcDe4c/](http://127.0.0.1:43110/1NmsmiXiAUJkrjtdh8VgJXb9FKXMzcDe4c/)\n\nВ нём я буду публиковать материалы, напоминающие о том как близко мы к роману Джорджа Оруэлла - \"1984\"."
		},
		{
			"post_id": 18,
			"title": "Месседжер Briar",
			"date_published": 1549173739.495,
			"body": "_**Briar** - это одна из технологий децентрализованных сетей (mesh) с открытым исходным кодом, предназначенная для обеспечения надежной сети и надежной одноранговой связи без централизованных серверов и с минимальной зависимостью от внешней инфраструктуры. Соединения выполняются через Bluetooth, Wi-Fi или через Интернет через Tor, и все сообщения оконечным шифрованием. Соответствующий контент хранится в зашифрованном виде на устройствах участников. Долгосрочные планы для проекта «включая блоги, картографирование кризисов и совместное редактирование документов»._ \n\n_Briar [обеспечивает](https://code.briarproject.org/akwizgran/briar/wikis/home) шифрование всех данных на стороне пользователя (end-to-end) и также скрывает метаданные об участниках переписки. При использовании Tor программа создаёт на устройстве пользователя скрытый сервис Tor и соединяется со скрытыми сервисами Tor других людей из списка контактов. В случае отсутствие доступа к глобальной сети и Tor, программа пытается синхронизировать накопившиеся сообщения через подключение к доступным поблизости контактам через локальную сеть, WiFi Direct или Bluetooth._ \n\n_Добавление новых контактов в Briar производится через фотографирование QR-кода с другого телефона (подразумевается физическом присутствие лица, добавляемого в список контактов) или обмен контактами (уже добавленный пользователь может поделиться контактами другого лица). В дальнейшем приложение осуществляет синхронизацию сообщений с пользователями, добавленными в список контактов, применяя для этого принцип P2P-сети. В случае если пользователь недоступен программа позволяет отправлять сообщения в offline._ \n\n_На данный момент разработчики сконцентрированы на мобильном приложении под Android, но для имплементации протокола в рамках приложения для [десктопа](https://code.briarproject.org/akwizgran/briar/milestones/2) нет никаких преград, так как (цитата) «Briar был создан модульным настолько, насколько это возможно»._ \n\n_Briar можно скачать в PlayMarket и f-Droid._\n\nВроде хорошее начало. Однако он разрабатывается с начала 2017 года и сегодня не имеет хоть какого-то количества пользователей. Десктоп клиент не разработан т.к. разработчики всё ещё работают над энергопотреблением и возможностью обмена сообщениями при неустойчивой связи. Гораздо бережнее относится к батарейке нежели клиенты TOX.\n\nМне нравится идея децентрализации в месседжерах. Подход разработчиков Briar довольно хорош, однако сегодня я не могу его использовать даже в кругу семьи из-за отсутствия звонков и десктоп клиента. За то там зачем-то есть форумы и прочая не совсем нужная ерудна. С передачей файлов там так же проблемы... Ну и плюс ко всему мне не очень понравилась реализация защиты паролем программы, в отличии от того же Telegram она не удобна.\n\nС нетерпением жду появления достойного проекта для перевода на него своего окружения т.к. отдавать свои данные третьим лицам я не хочу, да и попытки госструктур контролировать всё и вся уже зашли слишком далеко.\n\nСегодня наиболее удобен Telegram. Есть ещё Signal со своими фичами, но они централизованные, что уже плохо. А концепция развития Telegram оставляет желать лучшего.\n\nХочется получить децентрализованный функционал Telegram с end-to-end по дефолту и непривязкой к номеру телефона."
		},
		{
			"post_id": 15,
			"title": "Поездка на Полюс холода - Усть-Нера",
			"date_published": 1540293532.557,
			"body": "Так случилось в жизни, что занесло меня в одно из не самых благоприятных мест в нашей стране, да и на Земле в принципе. Года на два я решил с семьей переехать в поселок Усть-Нера Республики Саха (Якутия), где зимы очень суровые, а лето очень короткое и пыльное...\n\nОб этом будет мой маленький блог. В нём я буду размещать посты о местной жизни и особенностях существования в этих не легких условиях.\n\nСсылка ниже, прошу:\n\n[http://127.0.0.1:43110/1FA7LmD5bDhfGHe4kz8x2MJKMnqvegSUEf/](http://127.0.0.1:43110/1FA7LmD5bDhfGHe4kz8x2MJKMnqvegSUEf/)"
		},
		{
			"post_id": 13,
			"title": "Установка qTox на Linux Mint 18",
			"date_published": 1528687627.428,
			"body": "**Для начала нужно установить Git:**\n\n<span style=\"color: #008000;\">sudo apt install git</span>\n\n<span id=\"result_box\" class=\"\" lang=\"ru\"><span class=\"\">После этого откройте новый терминал, перейдите в каталог по вашему выбору (можно сделать в домашнем каталоге отдельную папку для подобного софта, например) и клонируйте репозиторий:</span></span>\n\n<span style=\"color: #008000;\">cd /home/$USER/qTox</span>\n<span style=\"color: #008000;\">git clone https://github.com/qTox/qTox.git qTox</span>\n\n**Теперь установим пакеты GCC, Qt, FFmpeg, OpenAL Soft and qrencode:**\n\n<span style=\"color: #008000;\">sudo apt install \\</span>\n<span style=\"color: #008000;\">build-essential \\</span>\n<span style=\"color: #008000;\">cmake \\</span>\n<span style=\"color: #008000;\">libavcodec-dev \\</span>\n<span style=\"color: #008000;\">libavdevice-dev \\</span>\n<span style=\"color: #008000;\">libavfilter-dev \\</span>\n<span style=\"color: #008000;\">libavutil-dev \\</span>\n<span style=\"color: #008000;\">libexif-dev \\</span>\n<span style=\"color: #008000;\">libgdk-pixbuf2.0-dev \\</span>\n<span style=\"color: #008000;\">libglib2.0-dev \\</span>\n<span style=\"color: #008000;\">libgtk2.0-dev \\</span>\n<span style=\"color: #008000;\">libopenal-dev \\</span>\n<span style=\"color: #008000;\">libqrencode-dev \\</span>\n<span style=\"color: #008000;\">libqt5opengl5-dev \\</span>\n<span style=\"color: #008000;\">libqt5svg5-dev \\</span>\n<span style=\"color: #008000;\">libsqlcipher-dev \\</span>\n<span style=\"color: #008000;\">libswresample-dev \\</span>\n<span style=\"color: #008000;\">libswscale-dev \\</span>\n<span style=\"color: #008000;\">libxss-dev \\</span>\n<span style=\"color: #008000;\">qrencode \\</span>\n<span style=\"color: #008000;\">qt5-default \\</span>\n<span style=\"color: #008000;\">qttools5-dev-tools \\</span>\n<span style=\"color: #008000;\">qttools5-dev</span>\n\n**Установим необходимые зависимости для toxcore:**\n\n<span style=\"color: #008000;\">sudo apt install libtool autotools-dev automake checkinstall check \\</span>\n<span style=\"color: #008000;\">libopus-dev libvpx-dev libsodium-dev</span>\n\n**Собираем toxcore:**\n\n<span style=\"color: #008000;\">git clone https://github.com/toktok/c-toxcore.git toxcore</span>\n<span style=\"color: #008000;\">cd toxcore</span>\n<span style=\"color: #008000;\">git checkout v0.2.2</span>\n<span style=\"color: #008000;\">cmake .</span>\n<span style=\"color: #008000;\">make -j$(nproc)</span>\n<span style=\"color: #008000;\">sudo make install</span>\n<span style=\"color: #008000;\">echo ‘/usr/local/lib/’ | sudo tee -a /etc/ld.so.conf.d/locallib.conf</span>\n<span style=\"color: #008000;\">sudo ldconfig</span>\n\n**Собираем qTox:**\n\nПереходим в каталог с qTox (если вы заметили toxcore у нас собирался в подкаталоге т.е. сейчас мы в cd /home/$USER/qTox/toxcore, а нам нужно вернуться назад)\n\n<span style=\"color: #008000;\">cd /home/$USER/qTox/qTox</span>\n<span style=\"color: #008000;\">cmake .</span>\n<span style=\"color: #008000;\">make -j$(nproc)</span>\n\nДля запуска выполняем:\n\n<span style=\"color: #008000;\">./qtox</span>\n\nНу, а дальше можно и ссылку для запуска в меню создать."
		},
		{
			"post_id": 12,
			"title": "Быстрая установка Telegram MTProto Proxy на Debian 9",
			"date_published": 1528687404.247,
			"body": "Описывается установка более устойчивого и надежного, чем обычные прокси типа Dante, официального прокси для Telegram Messenger от самого Телеграма.\n\nУстановите OpenSSL, если еще не установлен.\n\n<span style=\"color: #008000;\">sudo apt install libssl-dev</span>\n\nСкачайте и скомпилируйте MTProxy.\n\n<span style=\"color: #008000;\">cd ~</span>\n<span style=\"color: #008000;\">git clone [https://github.com/TelegramMessenger/MTProxy.git](https://github.com/TelegramMessenger/MTProxy.git)</span>\n<span style=\"color: #008000;\">cd MTProxy/</span>\n<span style=\"color: #008000;\">make</span>\n\nРазместите рабочие файлы по своим местам.\n\n<span style=\"color: #008000;\">sudo cp objs/bin/mtproto-proxy /usr/bin/</span>\n<span style=\"color: #008000;\">sudo chmod 775 /usr/bin/mtproto-proxy</span>\n<span style=\"color: #008000;\">cd /etc</span>\n<span style=\"color: #008000;\">sudo mkdir mtproto-proxy</span>\n<span style=\"color: #008000;\">cd mtproto-proxy</span>\n<span style=\"color: #008000;\">sudo curl -s [https://core.telegram.org/getProxySecret](https://core.telegram.org/getProxySecret) -o proxy-secret</span>\n<span style=\"color: #008000;\">sudo curl -s [https://core.telegram.org/getProxyConfig](https://core.telegram.org/getProxyConfig) -o proxy-multi.conf</span>\n\nСгенерите секретный ключ\n\n<span style=\"color: #008000;\">head -c 16 /dev/urandom | xxd -ps</span>\n\nНастройте автозапуск и управление прокси-сервером. Создайте конфигурационный файл\n\n<span style=\"color: #008000;\">sudo nano /etc/systemd/system/mtproto-proxy.service</span>\n\nи скопируйте в него это содержимое\n\n<span style=\"color: #008000;\">[Unit]</span>\n<span style=\"color: #008000;\">Description=MTProxy</span>\n<span style=\"color: #008000;\">After=network.target</span>\n<span style=\"color: #008000;\">[Service]</span>\n<span style=\"color: #008000;\">ExecStart=/usr/bin/mtproto-proxy -u nobody -p 8888 -H 443 -S —aes-pwd /etc/mtproto-proxy/proxy-secret /etc/mtproto-proxy/proxy-multi.conf -M 1</span>\n<span style=\"color: #008000;\">[Install]</span>\n<span style=\"color: #008000;\">WantedBy=multi-user.target</span>\n\nзамените на секретный ключ из п.4\nЕсли сервер находится за NAT, нужно добавить в ExecStart параметр:\n‘—nat-info :’\n\nПоследовательно запустите команды (потребуется несколько раз ввести пароль вашей учетной записи)\n\n<span style=\"color: #008000;\">systemctl daemon-reload</span>\n<span style=\"color: #008000;\">systemctl enable mtproto-proxy</span>\n<span style=\"color: #008000;\">systemctl start mtproto-proxy</span>\n\nГотово. Отправьте будущим пользователям прокси ссылку для автоматической установки, указав адрес сервера и ключ (ссылка автоматически откроется у тех, кто установил приложение с поддержкой MTProxy и автоматически же добавит прокси в настройки приложения)\n\n<span style=\"color: #008000;\">tg://proxy?server=<span style=\"color: #008080;\"><server_name_or_ip></server_name_or_ip></span>&port=443&secret=</span>\n\nПосмотреть статистику работы прокси можно, скачав файл stats\n\nПосмотреть статистику работы прокси можно, скачав файл stats\n\n<span style=\"color: #008000;\">curl localhost:8888/stats</span>\n\nДля того чтобы наш прокси периодически получал список новых адресов серверов тележеньки:\n\n<span style=\"color: #008000;\">sudo EDITOR=nano crontab -e</span>\n\n<span style=\"color: #008000;\">0 systemctl restart mtproto-proxy</span>\n\nДля тех кому лень обновлять (когда/если будут обновления)\n\n<span style=\"color: #008000;\">sudo mkdir /opt/mtproxy</span>\n\n<span style=\"color: #008000;\">sudo nano <span class=\"crayon-title\">/opt/mtproxy/upd.sh</span></span>\n\n<span style=\"color: #008000;\">rm -rf /root/MTProxy</span>\n<span style=\"color: #008000;\">cd /root</span>\n<span style=\"color: #008000;\">git clone [https://github.com/TelegramMessenger/MTProxy.git](https://github.com/TelegramMessenger/MTProxy.git)</span>\n<span style=\"color: #008000;\">cd /root/MTProxy</span>\n<span style=\"color: #008000;\">make</span>\n<span style=\"color: #008000;\">systemctl stop mtproto-proxy</span>\n<span style=\"color: #008000;\">rm /usr/bin/mtproto-proxy</span>\n<span style=\"color: #008000;\">cp /root/MTProxy/objs/bin/mtproto-proxy /usr/bin/</span>\n<span style=\"color: #008000;\">systemctl daemon-reload</span>\n<span style=\"color: #008000;\">systemctl start mtproto-proxy</span>\n\n<span style=\"color: #008000;\">EDITOR=nano crontab -e</span>\n\n<div class=\"crayon-pre\">\n\n<div id=\"crayon-5b1df2a89374c999307768-1\" class=\"crayon-line\"><span style=\"color: #008000;\"><span class=\"crayon-cn\"></span></span>\n\n<div class=\"crayon-pre\">\n\n<div id=\"crayon-5b1df2a89374c999307768-1\" class=\"crayon-line\"><span style=\"color: #008000;\"><span class=\"crayon-cn\">0</span> <span class=\"crayon-o\">*</span> <span class=\"crayon-o\">*</span> <span class=\"crayon-o\">*</span> <span class=\"crayon-o\">*</span> <span class=\"crayon-r\">bash</span> <span class=\"crayon-o\">/</span><span class=\"crayon-v\">opt</span><span class=\"crayon-o\">/</span><span class=\"crayon-v\">mtproxy</span><span class=\"crayon-o\">/</span><span class=\"crayon-v\">upd</span><span class=\"crayon-e\">.sh</span></span>\n</div>\n\n</div>\n\n<span class=\"crayon-e\"></span>\n</div>\n\n</div>"
		},
		{
			"post_id": 11,
			"title": "Тотальная слежка: как устроен рынок торговли пользовательскими данными",
			"date_published": 1521848996.436,
			"body": "Это репост статьи с РБК. Я просто оставлю это здесь для сохранности.\n\n[Ссылка на оригинальный материал.](https://www.rbc.ru/magazine/2018/04/5aafdfc99a7947654297214d)\n\nИспользование Facebook штабом Трампа, вирусное приложение GetContact — скандалов со скрытым сбором пользовательской информации все больше. Журнал РБК разобрался, как устроен бурно растущий рынок персональных данных в России\n\nНакануне президентских выборов в России газеты The Guardian и The New York Times опубликовали расследования про деятельность британской компании Cambridge Analytica, с которой сотрудничал штаб Дональда Трампа накануне выборов 2016 года. По данным изданий, Cambridge Analytica через онлайн-тест собрала информацию о 50 млн пользователей Facebook и использовала полученные профили для политической рекламы.\n\nВ конце февраля россияне увлеклись приложением GetContact — сервисом для проверки незнакомых телефонных номеров. Чтобы получить доступ к услуге, нужно разрешить доступ к своим контактам. Приложение быстро превратилось в сетевое развлечение — посмотреть, под каким именем ты записан в телефонах друзей и знакомых, потом выложить забавный скриншот со своими именами в соцсетях.\n\nК середине марта турецкая Teknasyon, создатель GetContact и партнер сотового оператора Turkcell, собрала по всему миру более 3,5 млрд номеров с именами владельцев, указано на сайте приложения. Согласно пользовательскому соглашению эти данные разработчики могли использовать в маркетинговых целях или передавать третьим лицам (1 марта из документа исключили такую возможность).\n\nИстория с Cambridge Analytica и всплеск популярности GetContact породили множество инструкций и заметок о том, как избежать передачи посторонним личных данных. Но бурно растущий рынок торговли пользовательской информацией устроен так, что не делиться этими данными почти невозможно.\n\n«Все почему-то любят говорить о слежке, которую ведут спецслужбы, хотя им, грубо говоря, надо найти сотню террористов среди 7 млрд людей, остальные им неинтересны. Зато они интересны другим организациям, которые хотят на них заработать», — описал принцип этого рынка владелец крупной российской платформы по продаже автоматизированной рекламы.\n\nЖурнал РБК изучил российский рынок сбора и торговли личными данными, вычислил его крупнейших участников и попытался оценить его объем, пройдя по всем этапам и способам коммерческой слежки.\n\n**В интернете: сookies**\n\n«Интернет — это как зеркальный пол, а пользователи ходят по нему в ботинках и оставляют за собой следы в любом случае», — говорит сопредседатель отраслевого комитета по Big Data IAB Russia Дмитрий Егоров.\n\nВ 2017 году почти 80% всех сайтов мирового интернета были оборудованы счетчиками, виджетами и другими устройствами, собирающими информацию о действиях юзеров, на каждом десятом ресурсе их работает более десяти одновременно, следует из отчета немецкой Ghostery. Основной продукт Ghostery — расширение для браузера по обнаружению этих устройств, которые устанавливают поисковые системы, социальные сети, рекламные агентства или сервисы статистики. Россия вместе с США и Великобританией — в лидерах по числу скрытых датчиков интернет-поведения.\n\nНапример, на начало марта 2018 года на Avito.ru работали шесть уникальных трекеров, на HH.ru — семь, на Gismeteo — девять, трекеры были в личных кабинетах нескольких крупных банков, в картотеке арбитражных судов, на страницах министерств и силовых ведомств. Самым популярным «жучком», получающим информацию о поведении пользователей, в Рунете является сервис веб-аналитики «Яндекс.Метрика»: по данным Ghostery, он работает на 52% всех сайтов. На втором месте — трекеры Mail.Ru Group (42%), на третьем — счетчик посетителей Liveinternet (почти 40%).\n\nЧерез трекеры третьим лицам утекает информация о cookies — данных о поведении юзера на сайте, зашедшего через определенный браузер. Если бы каждый пользователь посещал интернет только с одного устройства, число cookies было бы равно количеству активной аудитории Всемирной паутины. В реальности один человек выходит в Сеть с телефона, планшета, ноутбука, рабочего компьютера, а иногда еще и комбинирует браузеры. В итоге к осени 2017 года в Рунете насчитывалось около 1,8 млрд cookies, следует из данных Mediascope. Столько же cookies видит «Яндекс», сказали журналу РБК в пресс-службе компании.\n\nДля создания картины, более или менее релевантной всему населению страны, необязательно быть ИT-гигантом. Российские DMP-компании (от англ. data management platform — платформы по сбору, сегментации и продаже пользовательских данных) аккумулируют не менее нескольких сотен миллионов cookies. Например, Aidata видит 1,1 млрд, а DCA через свой счетчик Openstat получает 600 млн cookies, рассказали журналу РБК собеседники в компаниях. «Мы видим весь интернет», — говорит глава DCA Александр Зверев.\n\nДо 2016 года на рынке первичных данных о пользовательском поведении в Сети был также широко представлен clickstream (буквально «поток кликов») — данные о поведении юзеров, которые продавали интернет-провайдеры. Для этого посредник устанавливал на стороне оператора оборудование, которое автоматически передавало информацию — всю, кроме конфиденциального https-трафика. Но в конце 2015 года управление Роскомнадзора по ЦФО оштрафовало МГТС, «Сумму Телеком» и принадлежащее «Ростелекому» ПАО «Центральный телеграф», усмотрев в этой практике нарушение закона «О связи» (данные арбитражных судов). После этого массовая продажа clickstream прекратилась, хотя он все еще представлен на рынке, рассказали журналу РБК два собеседника в отрасли. В МГТС сообщили, что больше не продают clickstream, в «Сумме Телеком» и «Центральном телеграфе» не ответили на запросы журнала РБК.\n\nТаким образом, игроки рынка аккумулируют колоссальную информацию о поле, возрасте, семейном статусе, профессиональных интересах, потребительских привычках и желаниях всех россиян, постоянно подчеркивая, что используют только обезличенные персональные данные. Интернет-следы служат основой для построения аудиторных сегментов — многоуровневых портретов групп населения, используемых для рекламы, скоринга или поиска сотрудников.\n\nКак из cookies создать портрет человека\n\nВ рамках работы над статьей корреспондент журнала РБК купил на одной из барахолок Москвы базу пользователей портала Freelance.ru на 2015 год. Из нее были извлечены 27, 5 тыс. e-mail сервиса «Яндекс.Почта», которые затем были загружены в рекламную платформу «Яндекс.Аудитории». Через два часа сервис выдал результат: построен портрет 70% людей из списка, 62% — мужчины, большинство — из Москвы и Санкт-Петербурга, покупки совершают в основном в интернете, любят путешествовать и заниматься спортом, только 4% пользуются планшетами.\n\nРазрозненные cookies приводятся к единому идентификатору в результате так называемого мэтчинга (от англ. matching, сопоставление), рассказывает директор компании Aidata Евгений Жданов. Проще всего гигантам вроде Google, «Яндекса» или Mail.Ru Group: если пользователь залогинен в их почтовом сервисе, все его поведение привязывается к этому общему знаменателю, рассказывает топ-менеджер одной из DMP-компаний. Гиганты объединяют cookies не только вокруг почты: рекламные площадки «Яндекс.Аудитории» и myTarget от Mail.Ru Group принимают для построения аудиторных сегментов также телефонные номера и ID мобильных устройств, следует из внутреннего интерфейса систем.\n\nНезависимым игрокам рынка для построения сегментов приходится либо мэтчить одинаковые cookies, либо использовать связки «cookies плюс e-mail» или «cookies плюс телефон», которые в основном поставляют интернет-магазины, рассказывают собеседники в DMP-компаниях. В итоге получается подробный портрет человека, основанный на его интернет-поведении. Для примера: в список примерных аудиторных сегментов (таксономию) старейшего игрока российского рынка данных DCA входят такие характеристики, как возраст и пол человека, наличие детей (нет, планирует, ждет), намерение купить автомобиль (новый или подержанный), состояние здоровья (интересуется симптомами болезней, ищет информацию о лекарствах, недавно посещал лечебное заведение), предпочтения в покупках (важны бренд, цена или качество), напитках (пиво, вино, вода, сок), досуге (театрал, ходит в кино, клубы), еде (вегетарианец, гурман, адепт здорового питания) и даже «цели»: благотворитель, карьерист, получает образование. В DCA подчеркивают, что это не максимально возможное описание человека, а лишь примеры для конкретных заказчиков.\n\nCookies дают не только возможность создать портрет человека для показа ему рекламы. С лета 2017 года московская компания Reffection оказывает услугу под названием «ретаргетинг в звонок». На сайте заказчика устанавливается невидимый код, собирающий информацию обо всех посетителях, потом Reffection через свою платформу данных мэтчит cookies с номерами телефонов реальных людей, рассказал журналу РБК исполнительный директор компании Шариф Одинаев. Затем оператор звонит «пойманному» клиенту и в случае его согласия связывает с отделом продаж заказчика, среди которых есть крупные московские застройщики и автодилеры. Поставщиками связки «cookies плюс телефон» выступают агрегаторы купонов и скидок, говорит Одинаев.\n\n«Ретаргетинг в звонок» — пример того, как онлайн-активность человека догоняет его в офлайне. Есть и обратная история: наши действия в «реальном» мире фиксируются, а затем монетизируются в интернете.\n\n**На улице, в торговом центре, в метро**\n\n«Охотный Ряд» — 734 тыс. человек, «Авиапарк» — 665 тыс., «Мега Химки» — 602 тыс., «Европейский» — 1,3 млн, «Галерея» — 900 тыс., «Мега Дыбенко» — 440 тыс. Это списки постоянных посетителей московских и петербургских торговых центров, загруженные компанией «НПО «Аналитика» в платформу myTarget для открутки рекламы в интернете. «Аналитика» — одна из нескольких компаний на рынке, которые «ловят» людей в торговых центрах, автосалонах, кафе.\n\nСенсоры компании предназначены для сбора и систематизации информации о смартфонах посетителей торговых центров, говорит директор «Аналитики» Михаил Могилевский. Сейчас они установлены примерно в 260 ТЦ по всей стране, в том числе в 135 торговых комплексах столицы. Датчики «ловят» физический адрес (mac-адрес) телефонов с включенной функцией поиска сети Wi-Fi, и этот адрес становится идентификатором владельца телефона. Для таргетированной рекламы собранные mac-адреса стали использовать в конце 2016 года, говорит Могилевский, уверяя, что передача mac идет в хэшированном (шифрованном) виде.\n\nСейчас у мобильных устройств есть защита от такой слежки: по умолчанию они выдают рандомные, то есть случайные mac-адреса. Но обойти ее несложно, объясняет топ-менеджер крупного рекламного агентства. Wi-Fi-роутер, собирающий mac, постоянно меняет названия, мимикрируя под самые распространенные — default, FreeWiFi или MT_FREE. Попадая в зону действия такой сети, телефон может «узнать» ее и отдать свой физический адрес, рассказал журналу РБК руководитель одной из компаний этого рынка.\n\nФункция поиска Wi-Fi включена примерно на 70% всех телефонов, из этой группы в 70% случаев удается установить настоящий mac-адрес, говорит директор фирмы HotWiFi Дмитрий Степаненко (портфельный стартап Фонда развития интернет-инициатив (ФРИИ). HotWiFi начинал с услуги по обеспечению доступа к Wi-Fi для малого и среднего бизнеса, компания уже оборудовала по стране более 3 тыс. точек, в основном в кафе и ресторанах, рассказывает Степаненко. Для получения доступа к Wi-Fi пользователь авторизуется через телефон и соцсети, эта информация остается у владельца точки, в том числе для дальнейшего таргетирования рекламы в интернете. Например, HotWiFi помогла сети «Додо Пицца» собрать информацию о 200 тыс. клиентов.\n\nКомпания «Максимателеком», оператор бесплатного Wi-Fi в метро Москвы и Санкт-Петербурга, в наземном транспорте столицы и нескольких аэропортах, также собирает информацию о пользователях, но в отличие от коллег по рынку не загружает их в сторонние рекламные площадки, вроде myTarget. «Уникальное богатство, которое мы сами монетизируем», — говорил об этих данных «Деловому Петербургу» совладелец компании Алеко Крихели.\n\nИногда ловля клиентов больше напоминает охоту. «Максимателеком» установила в кофейне «Капучинка» у станции метро «Автозаводская» свои сенсоры и затем поймала телефонные идентификаторы всех, кто проходил мимо, указано в презентации компании. Из них был выделен список тех, кто постоянно подключается к Wi-Fi на этой станции, то есть либо живет, либо работает рядом, и они видели рекламу «Капучинки» при заходе в сеть «Максимателеком». Отследив вместе с заказчиком их дальнейшие передвижения, оператор установил: привлеченные клиенты сразу стали постоянными, совершив три покупки в течение трех недель, указано в презентации, посвященном этому кейсу.\n\nДля того чтобы установить, дошел ли человек до магазина после просмотра таргетированной рекламы, необязательно расставлять хитрые сети из роутеров. Эффективнее продолжать слежку на кассе магазина.\n\n**На кассе**\n\nТинькофф Банк первым из банков официально предложил заработать на своих клиентах, вспоминает руководитель крупного рекламного агентства. В 2013 году была запущен сервис «Тинькофф Таргет», через который ресторан или магазин может персонализировать предложения о кешбэке на основе анкетных данных клиента (возраст, пол, наличие автомобиля и т.д.), транзакционной информации и геопозиции. С системой работают несколько сотен активных партнеров, вся аналитика происходит внутри банка, заявил журналу РБК руководитель отдела развития программ лояльности банка Максим Филигаров.\n\nПолноценные сторонние рекламные кампании на своих пользователях первым стал строить Сбербанк. В 2015-м он купил контрольный пакет Segmento, одной из старейших в России платформ по автоматизированной закупке рекламы в интернете на основе данных о пользователе. Segmento получает от Сбербанка cookies клиентов, пользовавшихся онлайн-услугами банка, затем мэтчит их с существующими аудиторными сегментами для показа таргетированных предложений. E-mail и телефоны не используются, подчеркивает директор компании Роман Нестер.\n\nСамое главное — используя данные банка, Segmento может связать онлайн-активность человека с его действиями в офлайне. По такой схеме Segmento провела рекламную кампанию «Макдональдс»: получив данные о нескольких миллионах человек, посещавших фастфуд-рестораны и плативших картой Сбербанка, Segmento прокрутила им в интернете ролики нового сэндвича CreekMac. А затем еще и проанализировала, кто из видевших рекламу попробовал новинку. Таким же образом компания использовала информацию банка в рекламной кампании сети «Снежная королева» и туши от L’Oreal, следует из презентации компании. В 2017 году у Segmento было около 300 корпоративных клиентов, рекламные кампании которых были построены на сочетании онлайн-данных с обезличенными данными банка, говорит Нестер.\n\nСбербанк может сотрудничать с Segmento на условиях, при которых аналитика происходит на стороне финансовой организации, подчеркивают в компании. Остальные банки, если и монетизируют свои данные, то делают это на «полупубличной основе», говорит топ-менеджер крупного рекламного холдинга. «Неформально на этом рынке работают многие банки и платежные системы», — подтверждает директор крупного игрока по монетизации офлайн-данных.\n\nИз ретейлеров на рынок данных официально вышла X5 Retail Group, в конце 2017 года объявив о сотрудничестве с платформой myTarget. Пользователи платформы Mail.Ru Group уже могут таргетировать рекламу на тех, кто покупал определенные продукты и, например, предъявлял карту лояльности. Среди доступных сегментов: владельцы посудомоечных машин (280 тыс. человек) или покупатели премиальных сигарет (1,4 млн). Корреспондент журнала РБК зарегистрировался в myTarget и отправил заявку на построение сегмента «покупатели кефира в Москве». Менеджер X5 Retail Group в ответе подтвердил готовность построить такую аудиторию. В самом холдинге X5 сообщили, что уже доступно более 1 тыс. сегментов, за последние полгода было проведено более 20 рекламных кампаний с их использованием.\n\nДругой способ связать онлайн-таргетирование с офлайн-покупками — работа с операторами фискальных данных, которые начали активно выходить на рынок в середине 2017 года, рассказали журналу РБК топ-менеджеры нескольких рекламных агентств. В соответствии с законом такие операторы отвечают за передачу данных о покупках в ФНС и вправе монетизировать обезличенные данные. В чистом виде они представляют собой список покупок в конкретном городе, районе, магазине без привязки к конкретному клиенту. Но связать фискальные данные с человеком можно через карту лояльности, активация которой происходит с использованием мобильного телефона, говорит топ-менеджер крупной DMP-компании.\n\nВ обозримом будущем к процессу идентификации должны подключиться посредники, отслеживающие транзакции, например банки и платежные системы, добавляет Евгений Жданов. Еще одним посредником является сотовый оператор: оплатив покупку картой, клиент получает СМС от банка — в нем есть время, сумма и место покупки, что позволяет без труда смэтчить эти данные с чеком.\n\nТелефон сам по себе является идеальным устройством для слежки: человек всегда носит его с собой, используя все чаще и для все большего количества задач.\n\n**В телефоне**\n\nСообщение было получено вне рамок рабочего времени, «отвлекло от необходимых дел, вызвало беспокойство, раздражение, привело к формированию негативных ощущений и эмоций и дискомфортному состоянию в целом». Так описал свои моральные страдания от рекламного СМС новосибирский юрист Александр Жданов, подавая в 2016 году иск в местный суд. Эмоциональные подробности и отсутствие согласия абонента впечатлили судью, и она постановила заплатить Жданову за мучения 10 тыс. руб.\n\nМобильные операторы очень осторожно выходят на рынок данных из-за жестких требований закона «О связи», рассказали журналу РБК топ-менеджеры DMP-компаний. Даже на привычном рынке СМС-рекламы они исторически работают через сторонние технологические платформы, которые в первую очередь специализируются на нейтральном СМС-информировании клиентов банков или интернет-сервисов — о снятии денег или коде для восстановления пароля. Рекламные СМС для них — второстепенная услуга, рассказал журналу РБК руководитель одной из таких компаний.\n\nНо сами платформы также не являются конечными заказчиками рассылки. В 2017 году УФАС по Москве и УФАС по Свердловской области потратили полгода, чтобы установить цепочку, по которой житель Екатеринбурга получил СМС с рекламой местного автоцентра. Схема похожа на сказку про репку: автоцентр заключил контракт с ООО «Моби-Сервис Урал», та — с компанией Instam, последняя — с родственной ей платформой «Крафт Телеком», у которой, в свою очередь, были заключены договоры с операторами связи. Из-за отсутствия согласия абонента нарушителем была признана «Крафт Телеком» (штраф — 250 тыс. руб.), следует из решения антимонопольной службы.\n\nАдресная база для рекламной рассылки формируется двумя способами, говорит управляющий директор в регионе СНГ платформы Infobip Петр Якубович. Первый — клиент сам загружает в платформу телефоны, на которые нужно отправить сообщение. В этом случае получать согласие адресата должен заказчик, предварительной проверки не ведется, добавляет Якубович. Второй способ — список получателей формируется на основании баз сотовых операторов.\n\nРассылка по базе ведется тем абонентам, у которых в договоре есть пункт о согласии получать рекламные сообщения от операторов. Сейчас таких примерно 80% от общей базы, утверждает Якубович. Список получателей рекламных сообщений формируется на основании «таргетов». К примеру, у «МегаФона» их 11, указано в коммерческом предложении оператора: возраст и пол, средний размер счета за мобильную связь, операционная система телефона, интересы в интернете, конкретные адреса. Количество клиентов этой услуги растет на 20% ежемесячно, рассказали в пресс-службе оператора.\n\nНапример, компания Infobip для рекламы фитнес-центра таргетировала сообщения на мужчин и женщин в возрасте от 25 до 44 лет, проживающих или работающих в радиусе 5 км от местоположения заказчика (презентация компании). А дочерняя структура «Ростелекома» в конце 2016 года заказала через сайт госуслуг СМС-рассылку с рекламой своих офисов продаж в нескольких городах Урала абонентам МТС. В техническом задании указано: адресаты рассылки должны жить или работать в 3 км от офисов, обозначен их пол, возраст, образование, а также приведен перечень поисковых запросов в мобильном интернете — «перевести деньги», «если у банка отозвали лицензию, что будет с кредитом», «затопили соседи, как получить деньги» и даже «укус клеща страховка».\n\nИногда вводятся дополнительные, еще более конфиденциальные таргеты. В 2015 году московская технологическая платформа Instam отправила 250 тыс. MMS с рекламой сети ювелирных салонов, один из критериев при определении выборки — исходящие звонки в загсы и компании по организации свадеб. В своей презентации Instam предлагает также выбрать такие офлайн-атрибуты, как количество «нотификаций», то есть сообщений от служб такси или спортивных организаций.\n\nВ Instam не ответили на запрос журнала РБК, идет ли речь об информационных СМС, но сразу три игрока на рынке данных рассказали, что ряд технологических платформ по рассылке коротких сообщений предоставляет услугу по аналитике платежеспособности клиента на основе получаемых им СМС. Но используются такие сервисы не в рекламе, а в скоринге — второй по популярности сфере применения пользовательских данных. На нее, по мнению руководителя удостоверяющего сервиса IDX Светланы Беловой, приходится 30% потенциальных покупателей информации о гражданах.\n\n**Не только реклама: скоринг**\n\nВ 2016 году Сбербанк провел эксперимент по использованию внешних пользовательских данных для оценки заемщиков. К пилотному проекту привлекли солидный пул поставщиков: сотовых операторов, Mail.Ru Group, технологического оператора по рассылке СМС компанию MFMS и ООО «Дабл Дата», которая специализируется на сборе информации из соцсетей и с общедоступных сайтов. Не у всех был высокий процент нахождения нужного клиента, но вместе они давали точную оценку его реального дохода, рассказывал на отраслевой конференции начальник отдела моделей оценки рисков розничных клиентов Сбербанка (репортаж с мероприятия опубликован в журнале «Директор информационной службы»).\n\nСбербанк выбрал для своего пилотного проекта все существующие на рынке варианты. Мобильные операторы выходили на рынок скоринга постепенно: «МегаФон» — примерно с 2014 года, МТС — с 2016-го, писал отраслевой портал Futurebanking.ru. Tele2 стал работать в этом сегменте в начале 2017-го и уже сотрудничает не только с банками, но и со страховщиками, рассказали журналу РБК в пресс-службе компании.\n\nВесь анализ происходит на стороне оператора путем выставления так называемых скоринговых баллов. В октябре 2017 года банк «Российский капитал» заключил с «МегаФоном» контракт на предоставление справочных услуг по проверке благонадежности заемщика, следует из материалов сайта госзакупок. Согласно техзаданию, получив от заказчика номер телефона, оператор отвечает на вопросы: количество блокировок номера и их длительность, размер ежемесячных начислений, использование роуминга, частота смены телефонного устройства, район основной нагрузки на аппарат абонента в ночное и дневное время (то есть место работы и жительства). Оператор не выдает со своей стороны конкретные данные: в техническом задании заранее прописаны числовые диапазоны или варианты ответов, каждый из которых соответствует определенному баллу. Например, ежемесячный платеж от 500 руб. до 1 тыс. — это балл 3, а более 3 тыс. — 5.\n\nИспользуется для оценки заемщиков и информация о поведении в интернете. DCA поставляла для «Хоум Кредита» и Альфа-банка поведенческую информацию о клиентах в интернете, аналогичная услуга есть и у CleverDATA, следует из презентаций компаний. Работает на этом рынке и Mail.Ru Group: в 2016 году холдинг заключил контракт с Почта Банком на «информационные услуги» по оценке платежеспособности клиентов, указано на сайте госзакупок. В 2017-м Mail.Ru Group подписала договор со Сбербанком стоимостью свыше полумиллиарда рублей, но какая-либо документация на портале госзакупок отсутствует. В Сбербанке сообщили, что холдинг «оказывает услуги по анализу данных», их результаты «используются для лучшего понимания потребностей клиента». В Mail.Ru Group добавили, что этот анализ осуществляется «с использованием математических моделей, построенных с помощью методов машинного обучения».\n\nНаконец, банки работают с компаниями, специализирующимися на сборе и систематизации информации из соцсетей без установки трекеров (data mining): у крупнейшего представителя этого сегмента, компании «Дабл Дата», — 24 партнера из числа крупнейших финансовых организаций, рассказал директор компании Максим Гинжук. Скоринг — не единственное применение технологии data mining, собранные роботами данные также используются для построения клиентских портретов и даже для надзора за детьми.\n\n**Не только реклама: HR, маркетинг, медицина**\n\nОсенью 2017-го московская компания Social Data Hub, специализирующаяся на сборе информации из соцсетей, запустила сервис «Родительская опека»: всего за 150 руб. в месяц можно получать предупреждение, не начал ли ваш ребенок писать посты экстремистского содержания или не вступил ли в группы с запрещенным контентом. Сервис вызвал бурное обсуждение в соцсетях, но по состоянию на февраль 2018-го у него уже было около 30 тыс. клиентов, рассказал журналу РБК основатель Social Data Hub Артур Хачуян.\n\nКомпании активно используют пользовательские данные в маркетинге и сфере HR, говорит директор CleverDATA Денис Афанасьев. К примеру, его DMP помогала набирать продавцов для крупного ретейлера, указано в презентации компании. Сначала заказчик, имя которого не разглашается, проставил оценки 3200 действующим сотрудникам. После этого CleverDATA через свои алгоритмы построила их портреты, используя информацию из социальных сетей, от платежных систем и операторов по рассылке СМС. Полученные портреты накладывали на соискателей, обогащая информацию о них по тем же принципам, а затем получали «прогноз успешности продавца».\n\nОколо 60% компаний приходят к «Дабл Дата» за построением портрета своей аудитории, который потом используется, например, при создании новых продуктов, рассказал журналу РБК ее директор Максим Гинжук. Результат анализа похож на отчет по итогам традиционного устного опроса, но только формируется на основе данных о миллионах реальных покупателей и содержит тысячи показателей, говорит он. Среди заказчиков услуги — ретейлеры, телекоммуникационные компании, автодилеры, фарм-компании, заключает Гинжук.\n\nОснованная выходцами из «МегаФона» компания oneFactor использует для маркетингового анализа данные мобильного трафика. Например, на основе информации о распределении нагрузки телефонов на сеть oneFactor сделала предложения для крупной фастфуд-сети по предпочтительным локациям новых торговых точек. Сейчас такие услуги занимают треть в выручке компании, говорит ее директор Роман Постников. Исторический партнер компании — «МегаФон», но oneFactor использует данные и других сотовых операторов, утверждает он.\n\nВ США пользовательские данные активно используются в медицине, в частности при составлении анамнеза, говорит Афанасьев: интернет скажет о предпочтениях и привычках пациента больше, чем он сам. В России этот сегмент рынка еще не развивается, добавляет он. «Ко мне несколько раз приходили ребята, предлагали монетизировать данные об анализах, но как?» — вспоминает топ-менеджер рекламной платформы. Страховые компании уже используют пользовательские данные для оценки реального состояния здоровья клиента: Social Data Hub готовит для них отчеты на основании информации из соцсетей, например, не увлекается ли клиент, пришедший за медстраховкой, экстремальными видами спорта.\n\nСфера применения пользовательских данных все время расширяется, но на рынке данных при этом происходит «отрицательная динамика», говорит директор Segmento Роман Нестер — рынок консолидируется вокруг площадок, которые собирают информацию, но не делятся ею. «Данные — квазивалюта XXI века», — объясняет такой подход Постников.\n\n**Кто владеет данными**\n\nНи глобальные ИT-гиганты, вроде Google или Facebook, ни «Яндекс» и Mail.Ru Group не продают свои данные. Сотовые операторы, банки, ретейлеры тоже не выставляют на рынок информацию о своих пользователях. Все заинтересованы в том, чтобы использовать одну и ту же клиентскую базу на своей стороне для решения конкретной задачи заказчика, а не продавать сырую информацию, объясняет Светлана Белова.\n\nВ итоге поставщиками данных становятся те, для кого они вторичный ресурс, говорят участники рынка: интернет-магазины, владельцы счетчиков посещений, геоинформационные сервисы, службы по установке кнопок «поделиться в соцсетях» — все, кто ведет сбор cookies. Их основные покупатели — независимые DMP-компании, которые занимаются анализом данных и передачей аудиторных сегментов клиентам для открутки рекламы, скоринга или HR.\n\nПо версии отраслевого объединения IAB Russia, выпустившего в 2016 году первый обзор рынка, в России пять основных DMP-компаний: Aidata, CleverDATA ИT-холдинга «Ланит», DCA культуролога и девелопера Александра Долгина, российское подразделение французской Weborama и AmberData, входящая в Национальную медиа группу. Но совокупная доля этих и других независимых игроков на рынке не превышает 5–10%, говорят директор по маркетинговым технологиям группы компаний OMD OM Сергей Ефимов и руководитель платформы Hybrid Дмитрий Чеклов.\n\nПри этом крупные держатели данных только наращивают свои возможности, выстраивая сотрудничество по принципу общего акционера. Так, Mail.Ru Group обменивается обезличенными данными с «МегаФоном», рассказали журналу РБК два игрока рынка и подтвердил участник последней телеконференции холдинга для инвесторов, посвященной выходу отчетности по МСФО за 2017 год. «Ничего не отдают, только обогащают свои сегменты», — пересказал он слова представителей холдинга. В «МегаФоне» и Mail.Ru Group не прокомментировали эту информацию. («МегаФон», основным акционером которого является USM Group Алишера Усманова и его партнеров, владеет 15,2% Mail.Ru Group.)\n\nДругой пример потенциально сильного конгломерата — Segmento. В конце 2016 года партнером Сбербанка в компании стал венчурный фонд АФК «Система», которая является основным владельцем МТС. Пока «Система» не монетизирует свои данные через Segmento, но такая возможность остается открытой, говорит Роман Нестер. Пилотные продукты по проектам МТС могут быть представлены уже в 2018 году, добавил президент Sistema VC Алексей Катков.\n\nОценить объем рынка пользовательских данных крайне сложно, говорят все собеседники журнала РБК — очень многие сделки по продаже и покупке такой информации не афишируются. Реклама является наиболее прозрачной сферой применения информации о людях, но опрошенные игроки считают, что в оборот этого сегмента нельзя включать рекламные доходы таких компаний, как «Яндекс», Mail.Ru Group и Google. «Через свои платформы они предоставляют бесплатный доступ к своим данным», — поясняет основатель платформы Auditorius Геннадий Нагорнов.\n\nТакого же мнения придерживаются в самих ИT-гигантах. Отдельного «рынка данных» в Mail.Ru Group не видят, «есть рынок рекламы на данных», подчеркивает первый замдиректора холдинга Дмитрий Сергеев. «Яндекс» не закладывает стоимость данных в стоимость контракта, заявили в пресс-службе компании.\n\nВ этих условиях остается только оборот маленьких независимых игроков. В 2016 году выручка поставщиков данных на рынок интернет-рекламы составила лишь 180 млн руб., подсчитали ранее в IAB Russia. По мнению Нагорнова, емкость этого рынка не превышает 200 млн руб., примерно та же оценка у Ефимова. Глава лаборатории данных Dentsu Aegis Network Russia Михаил Шкляев называет цифры в 300–400 млн руб.\n\nЕще более приблизительными получаются денежные оценки других сфер. Объем скоринговых и маркетинговых услуг в 2017 году достиг 3 млрд руб., полагает Шкляев. Отдельно скоринговый рынок мог вырасти до 1 млрд руб., говорит исполнительный директор Skolkovo Ventures Дмитрий Щиголев. Наконец, по мнению управляющего партнера «TMT Консалтинг» Константина Анкилова, операторы связи заработали в 2017 году на Big Data менее 1 млрд руб.\n\nПотенциал рынка выглядит гораздо серьезнее. В перспективе пяти-семи лет объем маркетинговых услуг на основе точных знаний о гражданах составит около $500 млн, рынок скоринга вырастет до 5 млрд руб., заказы государственного сектора в этой сфере могут составить $500 млн, подсчитали ранее в Skolkovo Ventures. В IDX потенциал рынка оценили в 30 млрд руб. — если бы у нас был правильный или хотя бы сравнимый с европейским правовой ландшафт, отметила директор компании Светлана Белова. Пока же рынок фактически работает в серой юридической зоне, заключать прозрачные сделки и делать точные подсчеты затруднительно.\n\n**Законно ли все это**\n\nВсе компании, работающие на этом рынке, при любом удобном случае подчеркивают, что работа с персональными данным ведется в «обезличенном» и «безопасном» виде. Но в Роскомнадзоре не признают термина «обезличенные персональные данные» по отношению к сookies, информации о перемещениях гражданина на основе геолокации, данных о поведении на страницах интернет-магазинов.\n\nЭту информацию следует рассматривать как «пользовательские данные», косвенно относящиеся к человеку, объяснил позицию ведомства начальник управления по защите прав субъектов персональных данных Роскомнадзора Юрий Контемиров. А хэширование — основа основ при передаче данных от поставщика к DMP-компании — не может считаться способом «обезличивания» информации, так как относится к криптографическим средствам защиты информации, добавил он.\n\nВ Роскомнадзоре подчеркивают, что согласие пользователя на обработку его данных можно получать в любой форме, в том числе просто включив такой пункт в пользовательское соглашение сайта (если иное не предусмотрено законом). Нельзя лишь нарушать принцип целеполагания, продолжает Контемиров: персональные данные должны использоваться для тех целей, для которых собраны.\n\nПравда, последний принцип не соблюдается постоянно: проданные интернет-магазинами cookies применяются, например, для скоринга. Российское законодательство в области персональных данных зачастую сложно соблюдать в том виде, в котором его трактует Роскомнадзор, замечает старший менеджер по оказанию юридических услуг Deloitte CIS Александр Тюльканов. Собрав и истолковав все законы и подзаконные акты, можно отладить систему работы компании на этом рынке, но в итоге «казуистика» может закончиться конфликтом с регулятором, уверен управляющий партнер петербургского офиса Dentons Виктор Наумов. «Все это шито белыми нитками, и Роскомнадзор может прихлопнуть кого угодно», — заключает Белова.\n\nВ Роскомнадзоре, однако, обещают не проводить широкомасштабные проверки в данной сфере. Задача ведомства — просвещать и предостерегать, и ситуация меняется: игроки рынка настроены на то, чтобы работать в существующем правовом поле, уверен Контемиров. Последнее громкое решение ведомства — запрет собирать информацию со всех соцсетей, Avito.ru и Auto.ru, полученный «Национальным бюро кредитных историй» в 2016 году.\n\nВ конце 2017 года правительство России утвердило план модернизации нормативной базы в рамках программы «Цифровая экономика». По плану к маю 2018-го должен быть готов законопроект по регулированию доступа к общедоступным данным, к августу — об уточнении порядка обезличивания данных и получения согласия пользователей. Окончательное принятие документов отнесено на декабрь 2018-го и май 2019-го соответственно.\n\nПодготовкой предложений занимаются структуры, указанные в правительственном документе в качестве соисполнителей: ФРИИ и центр компетенций фонда «Сколково». В феврале рабочие группы ФРИИ и «Сколково» даже собирались вместе, чтобы скоординировать работу. Внести изменения в закон «О персональных данных» намерен и Медико-коммуникационный союз, который разрабатывает документ под названием «Информационный кодекс».\n\nОбновление законодательства необходимо, чтобы вывести торговлю данными из серой зоны, говорит замдиректора ФРИИ Сергей Алимбеков. Сейчас не так важно, какая именно концепция будет принята, — рынку необходимо любое регулирование, отвечающее на основные вопросы его игроков, считает Евгений Жданов.\n\nПо мнению собственника компании DCA Александра Долгина, время для нормотворчества еще не наступило: «Невозможно прописать нормы по отношению к тому, что находится в динамичном изменении. Большие данные быстро меняются, и пока непонятно, от чего нужно защищаться».\n\nБольшие игроки рынка данных должны сами регулировать свою работу через СРО, говорит Дмитрий Сергеев из Mail.Ru Group. Идея создания Ассоциации больших данных обсуждается крупными компаниями с 2017 года, сейчас идут «внутренние консультации», отмечают в Mail.Ru Group. В «Яндексе», чьи представители принимают участие в рабочих группах, предлагают ввести «кодекс добросовестных практик» для компаний рынка данных и выступают за «системную просветительскую работу, которая закрепит в сознании разных людей базовые понятия безопасного поведения в новой среде».\n\nСохранить конфиденциальность уже невозможно, считает глава одной из компаний, занимающихся data mining. «Я стараюсь не оставлять лишних следов в Сети, пиццу заказываю в соседний дом, не регистрируюсь в GetContact. У меня есть телефон на случай, условно говоря, атомной войны, его знают 50 моих друзей, и на него все равно звонят спамеры».\n\n_Автор: Андрей Захаров._"
		},
		{
			"post_id": 10,
			"title": "Имбирный пряник",
			"date_published": 1518955342.672,
			"body": "Прохладной зимой у меня появляется какое-то имбирно-корицевое настроение. А к кофе имбирное печение вообще подходит лучше всего.\n\nА теперь я расскажу как не платить втридорога за тесто со специями и жидкий сахар. Давайте учиться делать Имбирный пряник самостоятельно.\n\nСразу оговорюсь, имбирный пряник (он же печенье) не должен быть нежным и мягким, как Тульский. Ему надлежит быть сухим и брутальным. Впрочем, если хранить его плотном контейнере с хлебом, он чуть размягчится.\n\n**Для имбирной магии берем:**\n\n_Мука – 300 мл (в рецепте было 175 грамм, но я делаю так)_ \n\n_Масло сливочное 82,5% – 65 г (держите в морозилке)_\n\n_Сода – 1/4 ч.л._\n\n_Молотый имбирь – 1 ч.л._\n\n_Молотая корица – 1 ч.л._\n\n_Кардамон - 0,5 ч.л._\n\n_Соль щепотка_\n\n_Сахарная пудра – 75 г_\n\n_Мед – 2 ст.л._\n\n_Желток– 1 шт. (или 2, если яйцо не большое)_\n\nПросеиваем муку. Все сухие ингредиенты лучше перетрясти. Вы избежите комочков и посторонних примесей в тесте.\n\nВ муку добавляем специи, соду, соль.\n\nУ меня по рецепту: кардамон, корица и имбирь. Но в такой пряник можно добавить гвоздику и мускатный орех. Здесь ваша душа может смело гулять. Вполне оправдано добавление апельсиновой/лимонной цедры и даже орехов.\n\nЛедяное масло режем на мелкие кубики 3-5 мм или трем на терке. Работайте быстро и не трогайте его руками.\n\nПерекладываем в миску с мукой и быстро начинаем разминать все руками.\n\nПроцесс не легкий. Кусочки не быстро поддаются размягчению, а еще их постоянно нужно смешивать с сухой смесью. Важно чтобы каждая крупинка муки и специй пропиталась маслом.\n\nДолжна получится промасленная крошка. Как-будто перемолотые сухари, только мягкие и жирные.\n\nСражу же добавляем сахарную пудру и мед.\n\nПостарайтесь отделить желток максимально от белка и тоже отправляйте его в миску.\n\nЗапаситесь терпением и силой. Месим тесто очень интенсивно, если распадается на кусочки – подбираем и запихиваем в общий ком. Вымешиваем тщательно до однородной массы без крупинок и комочков.\n\nЕсли и после 10-минутного замеса сильно крошиться (как сухое) добавьте мед, прям по четвертинке чайной ложки и опять месить.\n\nДолжен получиться колобок: \"сладкий и гладкий, жирный и ароматный, съешь меня...\"\n\nЗаматываем тесто в пленку и отправляем в холодильник минимум на час, а лучше всю ночь.\n\nДостаем наш ком и кладем на посыпанную мукой доску или стол, раскатываем толщиной 3-5 мл. В зависимости от вашего желания. Самый чистый вариант: положить имбирный колобок между двух листов пергамента. Разогреваем духовку на 170 градусов.\n\nОтправляем наши имбирные пряники в разогретую до 170 градусов духовку на 8-10 минут. Если пряники толстенькие им может понадобиться еще 2-4 минуты. **Следите чтобы не подгорали!**\n\nОставляем пряники отдыхать и остужаться.\n\nЕсли кто дружит с глазурью – можете смело украшать печенье росписью.\n\nПряники могут храниться до полугода в закрытой и плотной коробке. В домашних условиях – неделю в контейнере. На воздухе они скорее засохнут, а глазурь потрескается. А вот для смягчения вкуса – оставьте их наедине с обычном хлебом.\n\nИмбирные пряники – самый простой и невероятно ароматный зимний десерт, красивый сувенир и уютный знак внимания. Приятного аппетита."
		},
		{
			"post_id": 9,
			"title": "Бесит платить банкам не за что",
			"date_published": 1517640483.915,
			"body": "Вот смотрите, я хочу иметь пластиковую карточку, в нормальном банке и не платить за неё вообще. Я считаю что я уже оказываю приятную услугу банку, если мои деньги лежат в нем и он ими пользуется.\n\nБольше всего меня бесят неявные высасывания денег, которые есть у всех банков в большей или меньшей степени.Вот например некоторые из них:\n\n*   Комиссия за обслуживание карточки (например 600 рублей). Зачем я её буду платить? Я и так принёс деньги в этот банк — пусть скажут спасибо.\n*   Повышенная плата за карты разных типов. Платиновые, золотые и прочие… В большинстве случаев это лишь цвет карты с псевдо-услугами, которые не нужны, а стоимость обслуживания может вырасти в разы. По факту есть смысл платить за такую карту только если ты например постоянно ездишь по заграницам и не хочешь отдельно платить за страховку, которая стоит 3000, а карта к примеру 2000, тогда да — есть экономия и платить есть смысл, иначе — нет.\n*   Или например «бесплатная» банковская карточка или карточка за 350 рублей в год. Такие карточки особенно любит предлагать Сбербанк к зарплатным проектам, например, накручивая на них 60 рублей в месяч за SMS-информирование и всякие мобильные банки. Т.е. такая «бесплатная» карточка уже стоит 60_12=720 рублей в год. УЖАС!\n\nЕще очень много подобных примеров можно приводить. Ну так вот…\n\n**Платить банку смысла нет вообще!** Я никогда не плачу банку за пластиковые карточки! Как? Очень просто.\n\n[Вот здесь например, Тинькофф](http://tinkoff.ru/sl/AxgDf6a9ya3) предлагает дебетовую карту с которой вы реально сможете зарабатывать и **не платить банку НИЧЕГО!**\n\nМногие сразу же испугались [Тинькофф](http://tinkoff.ru/sl/AxgDf6a9ya3) банка. Конечно, там тоже тонна скрытых комиссий и процентов по кредиткам, но **дебетовая карта отличается своей уникальной выгодой**.\n\nЭто единственное известное мне предложение от крупного банка с удобным сервисом + мне за это платят.\n\nИтак, оформляете **дебетовую** карту… У банка **ОЧЕНЬ** хороший сервис! Дебетовая карта имеет Cash Back т.е. каждый месяц вам возвращается 1% (иногда больше) от покупок. В моем случае я не напрягаясь имею от 500 рублей в месяц такими процентами. Однако обслуживание карты стоит 99 рублей в месяц, НО: 500-99=401 рубль чистой прибыли.\n\nSMS-информирование я категорически не подключал — это дополнительные не нужные траты. Все движения по карте можно удобно отслеживать, пожалуй, в лучшем мобильном банке — достаточно просто установить их приложение на телефон.\n\nВ общем очень рекомендую. В прошлом году я заработал более 9000 рублей просто пользуясь их картой и ни копейки не заплатил. 9000 — это чистая прибыль, дополнительный пассивный доход, полученный мной от банка. Это не говоря о потрясающем и удобном сервисе и НИКАКИХ очередей в отделении банка.\n\nP.S. Ну и на последок — снимать деньги можно без процентов в ЛЮБОМ банкомате (не менее 3000 рублей). Карта так же пополняется быстро и без процентов с любой карты любого банка прямо из приложения или через партнеров (всякие Евросеть и подобные). А еще, они платят 6% на остаток по счёту ежемесячно. Зачем Вам вклады во всяких Сбербанках и ВТБ?\n\n**Не платите банкам ни копейки, есть очень много мест куда можно занести деньги, но за другие удовольствия.**"
		},
		{
			"post_id": 8,
			"title": "Любовь и криптография",
			"date_published": 1516535250.994,
			"body": "<div class=\"post-thumbnail\">![](https://blog.andreyskrypnik.com/wp-content/uploads/2017/04/lubov_i_kripto.jpg)</div>\n\n<div class=\"entry-content\">\n\n<div class=\"entry-content\">**Как безопасное программное обеспечение и шифрование помогли возникнуть старомодному роману.**</div>\n\n<div class=\"entry-content\">Если я и могу что-то рассказать о нём, так это о его мягком взгляде и удивительной улыбке. Он выше меня. Он хорошо разбирается в компьютерах. Он говорит по-английски с ужасным акцентом. Он дорожит своей частной жизнью.</div>\n\n</div>\n\nВ 2016 году, через несколько лет после того, как начался наш простой и приятный любовный роман, мы столкнулись с проблемой. Мы решили жить вместе, и решили, что я эмигрирую в Европу. Но для этого нам нужно было доказать государственным службам прочность наших отношений. Инструкция по тому, как это делается, тяготела к современным формам взаимоотношений: связи в соцсетях, электронные письма, чаты, фотографии счастливой парочки. Он прочёл эти инструкции и показал их мне. Мы засмеялись. Наши взаимоотношения практически не оставили следов в цифровом мире. У нас ничего такого не было.\n<a data-cke-saved-name=\"habracut\" name=\"habracut\"></a>\nМы встретились за несколько лет до этого на вечеринке с алкоголем после хакерской конференции. Наш общий знакомый представил нас – меня по имени, его – по псевдониму. Мне он сразу понравился. Мы немного поболтали, но мне нужно было бежать. Я договорилась с ним о встрече в конце недели, и пропустила её из-за болезни.\n\n«Ну вот, – подумала я, – и не сложилось».\n\nМы внезапно встретились через несколько недель на публичном IRC-канале, и я узнала его псевдоним. IRC – это большая система чатов, нечто вроде Slack для командной строки. В общем-то, Slack – это просто модный интерфейс для IRC со всякими новыми ништяками, но без новой приватности. IRC-сервер знает всё, о чём говорят, находясь на нём, как и Slack. Я написала, что всё ещё хочу пообщаться, но он сказал, что не бывает в IRC часто. Я дала ему свой адрес в Jabber, и предложила приватную переписку. И теперь мы уже смогли початиться.\n\nJabber отличается от большинства протоколов децентрализованностью. Нет никакой компании Jabber с серверами Jabber, как это принято у Google или WhatsApp. Это значит, что можно использовать серверы, поднятые кем угодно, в любой стране. Моим единственным способом связи с этим загадочным человеком (о котором я не могла перестать думать) был этот Jabber-адрес, и он настроил его так, чтобы отклонять все нешифрованные сообщения. Jabber сам не занимается шифрованием, но протокол OTR (Off-The-Record) создаёт слой шифрования внутри других систем общения. Всё выглядит так, будто я звоню вам, но общаемся мы на тайном языке, известном только нам двоим. Кто-нибудь может подключиться и подслушивать, но они нас не поймут. У OTR есть ещё одно свойство, Perfect Forward Secrecy. Оно обеспечивает создание новых ключей шифрования для каждой новой сессии, так что даже если расшифровать один из них, он будет расшифрован только в тот раз. Он не даст вмешивающемуся в разговор человеку доступа к прошлым или будущим сообщениям. Это выглядит так, будто когда я звоню вам, мы каждый раз выдумывали бы новый тайный язык для общения – язык, который мы с вами понимали бы сразу.\n\nМы начали нашу интимную и приватную беседу в нашем текстовом мирке на двоих. И эта беседа всё ещё продолжается. Большинство клиентов Jabber достаточно умные, чтобы сообразить – если беседа шифруется, логи вести не нужно, и в нашем случае это так и есть. Все эти ранние чаты исчезли. Некоторые помню я, некоторые – он, но большая часть пропала, будто разговоры под дождём.\n\nЯ помню, что постоянно жаловалась ему – на журналистику, источники, истории, письмо, на необходимость делать что-то важное. Он всегда вроде бы участливо слушал, что проявлялось в странном языке тела, существующем в паузах чата. Он был практичным, позитивным и вдохновляющим. Я помню, что сказала ему, как я разочарована в том, что я женщина, пытающаяся писать длинные субъективные статьи, и что я чувствую, что с социальной точки зрения мне многое недоступно. Он спросил у меня про подробности, и я выдала ему список всех тех причин, по которым, как я думаю, мой пол ограничивал мою работу. Он немного помолчал, ну а затем перепостил мне мой список, но уже в виде списка задач. Я посмотрела на экран и вздохнула. Мне хотелось заплакать, но одновременно я чувствовала, что время пришло. Я взяла этот список задач и превратила его в мой последний, самый длинный и [самый лучший материал для Wired](https://www.wired.com/2012/12/a-eulogy-for-occupy/). Но он этого не помнит и просто верит мне, когда я говорю, что это было. В наш век, когда всё общение автоматически документируется, этот эпизод остался эфемерным и живёт в подвижных песках человеческой памяти – так, как когда-то вели себя все взаимоотношения.\n\n«Мне кажется, что то, что мы храним у себя в голове, более важно», – написал он мне недавно по WhatsApp. «Ну а по поводу точности этого – пфф». Таково его пренебрежение к его цифровой точности, и оно кое-что значит. В ежесекундном ведении логов есть какая-то юридическая достоверность, но им не хватает импрессионизма, который лучше передаёт память. Я полюбила его не по конкретным его словам или предложениям. Я влюблялась в него постепенно, с течением времени, в промежутках между словами, поддерживаемых словами. Иногда нам не нравится терять слова, но забывание убирает и поддержку фиксированного прошлого – прошлого, которое всё равно не запечатлеть в лог-файле.\n\nПервые недели превращались в месяцы, он стал моим воображаемым другом, человеком, о существовании которого не знал больше никто. Мы говорили ежедневно, обычно через OTR, всегда в зашифрованном режиме. Когда мы передавали файлы через незашифрованные программы и сайты, мы всегда шифровали его при помощи утилит командной строки и передавали пароли через OTR.\n\nЭто было не очень легко и требовало длинных, эзотерических команд вроде\n\n```\n> openssl aes-256-cbc -a -salt -in for-you.mp3 -out for-you.mp3.enc\n```\n\nПолучалось, что хотя наше общение шло через открытый интернет, эти сообщения были лишь бессмысленными кусками текста без тех паролей, которыми мы делились в чате. Я начитывала ему в микрофон поэмы и отправляла ему. Я отправляла ему изображения. Точно не помню, и найти их уже не смогу, но я помню, что мне это очень нравилось.\n\nЯ хотела найти способ общения по телефону. Мы использовали [TextSecure](https://ru.wikipedia.org/wiki/TextSecure) и RedPhone (позже превратившиеся в [Signal](https://en.wikipedia.org/wiki/Signal_%28software%29)). Мы отправляли изображения друг другу – обычно я ему, и обычно это были забавные вещи, которые я встречала в течение дня.\n\nЯ очутилась в Лондоне, и в шутку (и всерьёз) попыталась добиться, чтобы он приехал в гости. Он колебался, и внёс другое предложение – встретиться чуть позже в Люксембурге. Через несколько недель я была на Gare de L’Est, [восточном вокзале Парижа](https://ru.wikipedia.org/wiki/%D0%92%D0%BE%D1%81%D1%82%D0%BE%D1%87%D0%BD%D1%8B%D0%B9_%D0%B2%D0%BE%D0%BA%D0%B7%D0%B0%D0%BB_%28%D0%9F%D0%B0%D1%80%D0%B8%D0%B6%29), с купленным за наличные билетом в руке, и садилась на экспресс до главной станции Люксембурга.\n\nЯ до сих пор не знала настоящего имени этого человека. Я даже не знала, что Люксембург – это другая страна. Мы провели чудесные выходные. Я сказала ему: «Я хочу показать тебе кино, чтобы помочь понять мою культуру и соотечественников», и показала фильм Джона Карпентера «[Большой переполох в Маленьком Китае](https://www.kinopoisk.ru/film/16116/)«. Мы сидели на диване рядом, с ноутбуком, лежавшим на наших бёдрах, и смотрели кино. В конце он сказал, что ему очень понравилось. Днём мы гуляли в городе, сидели в парках и вместе ели еду на вынос. Мы разговаривали об интернете, [активизме](https://ru.wikipedia.org/wiki/%D0%93%D1%80%D0%B0%D0%B6%D0%B4%D0%B0%D0%BD%D1%81%D0%BA%D0%B8%D0%B9_%D0%B0%D0%BA%D1%82%D0%B8%D0%B2%D0%B8%D0%B7%D0%BC), журналистике и компьютерах. К концу выходных я знала, как его зовут, но всё ещё называла его по псевдониму – привычка.\n\nОтношения до сих пор были платоническими, но я знала, что хочу большего.\n\nЧерез несколько месяцев мы вместе отправились в Берлин. Стоя на балконе (мы были в квартире моего друга), ночью, я спросила, могу ли я поцеловать его, и он ответил «да».\n\nВскоре после этого я оказалась в сердце разразившегося в СМИ шторма, случившегося в результате трагедии. Моя жизнь взорвалась, и в промежутках между трауром и дебатами в СМИ я жила в какой-то ужасной трагикомедии, которую никак невозможно было отключить. Он стал моим укрытием, его квартира стала единственным местом, где я чувствовала себя в безопасности. Он ухаживал за мной, следил, чтобы я ела, обнимал меня, гулял со мной и позволял плакать у себя на плече. Когда наша связь могла стать достоянием общественности, он сказал, что не хочет участвовать в моих разборках со СМИ. «Если мне позвонит репортёр, я ему нагрублю», – сказал мне он. Я рассмеялась и согласилась. Мне тоже не хотелось в этом участвовать. Но и когда я уезжала, он был со мной, связываясь через построенные нами зашифрованные каналы. Я мало что помню об этом ужасном времени, но я помню, что чувствовала его безмолвное присутствие, находясь в тысячах километров от него.\n\nСуществует несколько наших совместных фотографий. Мало какие из них сделали мы сами – мы не любили сэлфи. Существующие у наших друзей фотографии мы попросили не выкладывать в онлайн.\n\nМы знаем, что смутная и мягкая анонимность наших взаимоотношений не будет вечной. Сомневаюсь, что у нас будет избыток цифровых каналов связи. Наши телефоны отслеживают те пути, по которым мы ходим, и они ещё долго хранятся в базах телекоммуникационных компаний (а с недавнего времени и в логах WhatsApp). Их сотовые вышки и логи GPS похожи на пути в лабиринте без стен, и эти линии сходятся и расходятся, и снова сходятся. Но то, что мы говорили во время этих прогулок, не сохраняется, даже у нас самих. Остаются только чувства, воспоминания и пути.\n\nЭти пути уже пролегли по трём континентам, когда мы вместе путешествовали и часто наведывались к друзьям. Мы не храним отношения в секрете. Наши друзья и наши знакомые знают, что мы – пара, с небольшим уклоном в информационную безопасность. Я очень радовалась, представляя его своим друзьям и семье (сначала по псевдониму, потом по имени). Я чрезвычайно горжусь им, и у меня временами всё ещё кружится голова от того, что я провожу с ним время.\n\nМой роман научил меня, что наша эпоха цифровых данных отверждает проходящее время так, как раньше не бывало. У меня есть архив календарных записей и электронных писем, которые чётко свидетельствуют о времени и месте всего, что я делала. Я знаю, когда ко мне приезжал мой ребёнок, когда я в последний раз виделась с другом в Нью-Йорке, что я писала в последний раз, общаясь с мамой по e-mail. Но не с моим любимым. Для нас время более мягкое. Иногда мне кажется, что он всегда был со мной, иногда – что наши отношения только начались. Все остальные отношения в моей жизни гораздо более чётко зафиксированы.\n\n«Каждый раз, когда я вижу старую почту, я испытываю странное чувство – будто мне больше нравится память о событии, чем точная запись о нём», – сказал мне он.\n\nОн не имел в виду почту от меня. Мы никогда не писали друг другу e-mail.\n\nЯ расскажу вам о нём ещё кое-что. Он не терпит чуши. Он настроен на ясное и уместное общение и честность. Он редко видит смысл в намёках, особенно по важным поводам. Мы стараемся говорить друг с другом прямо. С годами через наши зашифрованные туннели мы рассказывали наши истории и объяснялись друг другу. Мы стали тихими голосами в головах друг друга. В отсутствии идеальной записи мы удовлетворились доверием.\n\nТак оно и было в 2016 году, когда нам пришлось задокументировать наши отношения к удовольствию современного правительства. В конце инструкций, согласно которым мы могли сделать такую запись, мы обнаружили один старомодный вариант – письма от друзей и родственников, подтверждающих нашу любовь. Их мы и собрали.\n\nОдин друг писал в своём письме:\n\n> «До того, как наши пути разошлись, мы вместе ели чипсы, пили слишком много кофе и много смеялись. Увидев их здесь сегодня, я понял, как счастливы они вместе и как я рад, что они стали парой».\n\nДругой писал:\n\n> «Я помню, как встретился с мистером _**_ впервые в сентябре 2013 года, когда они приехали ко мне в гости. Они произвели впечатление влюблённой парочки, и я не могу вспомнить, чтобы когда-нибудь видел её счастливее».\n\nНе знаю, читал ли кто из чиновников эти письма – сегодня они, к сожалению, предпочитают метаданные реальной информации – но мы прочли. Видеть, как ваши друзья и семья подтверждают вашу любовь – это лучше всех сэлфи мира.\n\nЯ получила своё гражданство, разрешение от правительства жить с моим любимым в Европе и переехала к нему.\n\nВ мае прошлого года мы снова были в Берлине. Я затащила его в музей [Штази](https://ru.wikipedia.org/wiki/%D0%9C%D0%B8%D0%BD%D0%B8%D1%81%D1%82%D0%B5%D1%80%D1%81%D1%82%D0%B2%D0%BE_%D0%B3%D0%BE%D1%81%D1%83%D0%B4%D0%B0%D1%80%D1%81%D1%82%D0%B2%D0%B5%D0%BD%D0%BD%D0%BE%D0%B9_%D0%B1%D0%B5%D0%B7%D0%BE%D0%BF%D0%B0%D1%81%D0%BD%D0%BE%D1%81%D1%82%D0%B8_%D0%93%D0%94%D0%A0). Когда мы попали в старый офис директора, я набрала в лёгкие воздуха и сделала ему предложение. Вместо кольца я дала ему USB-ключ (купленный за наличные; что там было, я не скажу).\n\nОн сказал «да».\n\nЗатем посмотрел на меня с удивлением, и спросил: «Ты из-за этого всю неделю была на нервах?»\n\n«Да! Это ужасно нервирует!» – сказала я, и мы отправились попить кофе. Вот так всё и случилось.\n\nНо вам придётся верить мне на слово.\n\n_![](https://habrastorage.org/getpro/geektimes/post_images/c6c/7ca/a90/c6c7caa9078186a98ee5bc6f1b5ab76b.png)Куин Нортон, 1973 г.р. – американская журналистка, фотограф и блогер, пишущая о хакерах, Anonymous, интеллектуальной собственности, авторских правах и интернете. Была замужем за журналистом Дэнни О’Брайаном__. После развода встречалась с Аароном Шварцем_, интернет-активистом и IT-визионером. Шварца обвинили в краже интеллектуальной собственности за скачивание и выкладывание в общий доступ [базы данных платных научных журналов](https://ru.wikipedia.org/wiki/JSTOR), и в 2013 году он [покончил с собой](https://geektimes.ru/post/165541/), не выдержав травли."
		},
		{
			"post_id": 6,
			"title": "#ЖИТЬ",
			"date_published": 1514689367.325,
			"body": "> _Жизнь - это непрекращающееся рождение, и себя принимаешь таким, каким становишься_\n> \n> Антуан де Сент-Экзюпери\n\nВ конце этого года я узнал о [проекте](https://жить.рф/) #ЖИТЬ . Он меня очень впечатлил.\n\nДавайте поможем ему и поучаствуем. Этот проект многим очень нужен и делает нас людьми.\n\n[С наступающим Новым годом! <=просто посмотри видео!](https://youtu.be/DKMQYKqn1cQ)"
		},
		{
			"post_id": 5,
			"title": "Почему Сбербанк последнее место где нужно хранить деньги",
			"date_published": 1513769741.267,
			"body": "Поделюсь своей печалькой. В общем я гад такой не платил коммуналку какое-то время. Ну думаю ближе к НГ получу денежку и погашу задолженность.\n\nНо грозные коммунальщики побежали по судам и приставам. В общем у меня счета в разных банках в т.ч. ВТБ, Тинькофф и прочих... Так вот. На карточке в Сбербанке лежала некая сумма... И тут мне прилетает СМС о том что мой счет арестован и все деньги снялись в погашение задолженности (ПОЛНОСТЬЮ!). Такая ситуация произошла именно со Сбербанком. С другими счетами все норм.\n\nТ.е. Сбербанк очень тесно сотрудничает с приставами и ты в одну секунду можешь потерять ВСЕ свои деньги! Другие банки я так понимаю более неторопливы и до них приставы долго добираются.\n\nВообще ситуация мне осталась не понятной, удерживали бы процент с зарплаты и все, а они все деньги снимают, а если я с голоду умру и так и не погашу остаток задолженности, или я мать-одиночка с 4-мя детьми. Странный факт, конечно - такое снятие полной суммы.\n\nРазбираться не стал. Долги есть долги и их нужно гасить, но понял что в Сбербанке больше деньги не держу."
		},
		{
			"post_id": 4,
			"title": "Отключить возможность Mozilla устанавливать дополнения в Firefox без согласия пользователя",
			"date_published": 1513767923.449,
			"body": "<div class=\"entry-content\">\n\nВ СПО-комьюнити разразился [скандал](https://sircmpwn.github.io/2017/12/16/Firefox-is-on-a-slippery-slope.html) насчет добавления в Firefox адд-она Mr. Robot — маркетинговый ход от Mozilla и NBC Studios. Адд-он скрытно добавляет хедеры когда пользователь посещает определенные сайты, выполняя функции слежки в рекламных целях, а также модифицирует посещаемые страницы.\n\nВ общем теперь к делу: как это отключить, т.е. как запретить мозиле самостоятельно ставить обновления:\n\n<div dir=\"ltr\">Все, кто не хочет подобной фигни в будущем, отключите SHIELD в **about:config**.</div>\n\n<div dir=\"ltr\">**extensions.shield-recipe-client.enabled** — в false</div>\n\n<div dir=\"ltr\">**extensions.shield-recipe-client.api_url** — оставить пустым</div>\n\n</div>"
		},
		{
			"post_id": 3,
			"title": "Как поменять user agent в Mozilla Firefox",
			"date_published": 1513248627.214,
			"body": "Как и в Хроме, не во всех версиях Firefox можно легко изменить рассматриваемый нами параметр. Приведенная инструкция действует для версий, начиная с 34\\. В адресной строке введите **about:config** и в появившейся странице создайте параметр **general.useragent.override**.\n\nВыберите тип создаваемого параметра **«Строка»** и в новом окне впишите нужное значение user agent.\n\nСписок различных user-agent'ов:\n\n*   Mozilla/5.0 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)\n*   Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible ; Googlebot/2.1 ; +http://www.google.com/bot.html)\n*   Mozilla/0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/56.0.2924.87 Safari/537.36\n*   Mozilla/5.0 (Windows NT 6.1; Win64; x86) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/55.0.2883.87 Safari/537.36\n*   Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; SLCC2; .NET CLR 2.0.50727; .NET CLR 3.5.30729; .NET CLR 3.0.30729; .NET4.0C; .NET4.0E; Media Center PC 6.0; CMNTDFJS; F9J; InfoPath.3; rv:11.0) like Gecko\n*   Opera 12.17 (Win 8 x64): Opera/9.80 (Windows NT 6.2; WOW64) Presto/2.12.388 Version/12.17\n*   Internet Explorer 11 (Win 8.1 x64): Mozilla/5.0 (Windows NT 6.3; WOW64; Trident/7.0; ASU2JS; rv:11.0) like Gecko"
		},
		{
			"post_id": 2,
			"title": "Боты для мониторинга цен на авиабилеты в популярных месседжера",
			"date_published": 1512896653.896,
			"body": "<div class=\"entry-content\">\n\nПрогресс и эра месседжеров наступили. Даже социалочки оказались не так нужны как раньше. Ну а сайтами пользуются вообще далеко не все пользователи Интернета.\n\nРаньше все делали через группы в социалочках, сейчас продвинутые месседжеры уже давно переплюнули социальные сети по функционалу. Например они могут мониторить цены на интересующие вас авиабилеты и уведомлять вас о снижении цены. По моему это божественно!\n\n<div style=\"text-align: left;\" align=\"center\">Итак, боты для популярных месседжеров:</div>\n\n<div style=\"text-align: left;\" align=\"center\">**Viber** — [Запустить бота](https://medon.aviasales.ru/integrate/viber?marker=66120)</div>\n\n<div style=\"text-align: left;\" align=\"center\">**Facebook Messenger** — [Запустить бота](https://medon.aviasales.ru/integrate/facebook?marker=66120)</div>\n\n<div style=\"text-align: left;\" align=\"center\">**Telegram** — [Запустить бота](https://medon.aviasales.ru/integrate/telegram?marker=66120)</div>\n\n<div style=\"text-align: left;\" align=\"center\">**Slack** — [Запустить бота](https://medon.aviasales.ru/integrate/slack?marker=66120)</div>\n\nЯ вот например использую бота в Telegram.\n\n</div>"
		},
		{
			"post_id": 1,
			"title": "Как пить глинтвейн",
			"date_published": 1512192420,
			"body": "Пессимисты видят в осени лишь слякоть и дефицит витамина D, в зиме – гололед и холодный ветер. Мы ассоциируем эти времена года с дружескими посиделками дома: пьем глинтвейн, который приготовили своими руками, греемся и обсуждаем последние новости.\n\nНатуральное сухое вино – кладезь полезных веществ. По привычке мы помним только об ароматической и алкогольной его составляющей. Но стоит нам простыть или промерзнуть до костей на улице, как мы вспоминаем про горячую интерпретацию вина – глинтвейн.\n\n«Пылающее вино» обладает ярко выраженной противовирусной и противомикробной активностью. Лечебные свойства глинтвейна проявляются только при умеренном потреблении. О том, как правильно пить глинтвейн и как определить грань между его пользой и вредом наш сегодняшний разговор.\n\n![kak-pravilno-pit-glintveyn-world-wine.net-1.jpg (0x0)](data/img/post_1_kak-pravilno-pit-glintveyn-world-wine.net-1.jpg)\n\n## Как правильно пить глинтвейн?\n\nЗимой мы наполняем стаканы напитками более «сильных», насыщенных вкусов: кофе с коньяком, горячим шоколадом с ромом или глинтвейном на основе горячего красного вина.\n\n## Можно ли разогревать глинтвейн?\n\nГлинтвейн пьют сразу после приготовления – повторно разогревать вино со специями нельзя. Остывший коктейль, как и тот, которому по ошибки дали закипеть, необратимо теряет свой вкус, аромат, крепость и полезные свойства.\n\n## Как пить глинтвейн – горячим, теплым или холодным?\n\nСомелье из Германии дают однозначный ответ:\n\n«Глинтвейн пьют горячим, сразу после приготовления! Когда горячий напиток разлит по чашкам, специи в вине разжигают внутренний огонь, повышают иммунитет и спасают от сезонной хандры. Дадите глинтвейну остыть – получите вместо тонизирующего, спасающего от переохлаждения алкогольного напитка, прокисшее вино».\n\n## Как пить глинтвейн – быстро или медленно?\n\nКак алкогольный, так и безалкогольный глинтвейн пьют медленно, аккуратно и небольшими глотками. Сначала вдыхают горячие пары и только потом, пригубив, наслаждаются глубиной его пряного вкуса.\n\n## Какой температуры должен быть глинтвейн?\n\nТемпература подачи – примерно 70 градусов.\n\n## Как хранить готовый глинтвейн?\n\nСохранить глинтвейн горячим до прихода гостей можно с помощью термоса. В термос напиток заливают уже процеженным от цитрусовых. Если не удалить апельсин, лимон или мандарин – глинтвейн будет неприятно горчить.\n\n## Срок хранения глинтвейна?\n\nВремя хранения белого или красного глинтвейна в термосе ограничено. Через два часа вкус вина исказится, и оно «задохнется»."
		}
	]
}