{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1631849943,
			"title": "Guide to recover zeronet keys please?",
			"body": "Do i simply back up the zeronet files and reinstall on new device or is there more??",
			"added": 1631849942
		},
		{
			"topic_id": 1632580545,
			"title": "Australian guide to overthrow tryanny",
			"body": "1. You HAVE to get guns. Since yall gave them up like fools already you now gotta get more. WE THE PEOPLE live next to those enforcers families I know what i would be doing to them when the enforcer leaves to enforce tyranny... Or you can follow them and catch them alone kill them then take their gun to kill more and take their guns to arm more people to fight back!!\n2. Gorilla warfare is the ONLY way to take down a larger force. Catch them alone, sleeping, or just weak and capture them. This is WAR for your very survival ALL IS FAIR!!! Get dirty with them. Their life dont matter anymore since they think its ok to fuck your life!!!\n3. Nighttime ops are typically the best. Use space blanket painted black to move with as it blocks your IR heat from drone cameras.\n4. If you make alot of noise solo you need to blend in with a larger crowd so they dont just predator drone you.\n5. Gasoline in water guns can be very very dangerous to those in full armor (cant get out fast enough)\n6. When protesting and the enforcers line up. Use a lasso to rope them then drag them back to you and the crowd. This is also very good for breaking up their formations.\n8. Carry flags!! The human eye naturally focuses on large moving objects. so having your flag waving with a very sharp pointy end you can use this as further reach that they dont have with their batons!!\n9. Divide and conquer. He who flanks first wins!! Take a large group of you to get the enforcers to line up. then flank with another force that hopefully is armed.\n10. Anyone and everyone can make a bow and arrow. Its basic and primitive but if done right you can easily take out a lone enforcer to get their guns\n11. There are guides on youtube how to hijack FM radio waves to block their propaganda or better yet can be used to announce your own propaganda (consider misdirection at times)\n12. There are guides on youtube on how to make a localized EMP. EMP will destroy electronics. Run this device on local comm centers, internet hubs, and towers to shut down their comms. WE THE PEOPLE will forever and always have word of mouth to keep us looped in. Its a very tactical sacrifice!\n13. Armies have to eat. Locate supply lines and destroy them\n14. Did you know primitive man use to beat their enemies to death with their bare hands 1+1\n15. Leverage the fact that 99% of the population would never hurt a child. Take a young adult teen boy like 12-14 and send him into a group of them with pepper spray. mace their ass then while they are disoriented you capture them!!\n16. Remote cars (RC-XD) can be used for many reason recon or destruction.\n17. Dont throw full glass bottles. Break the flat end to get sharp ends then throw that it will cause cuts that could be a vital vein. Far better than just concussive damage\n18. You have HAVE to start an underground movement. Speak to people freely and frankly do not fear traitors or spys its for sure going to happen nothing you can do about it. no point in wasting time vetting them either. bring them in trust them and know if they fuck up the REST of the good guys will kill them. You HAVE to build your army for bigger attacks.\n19. The metal game is what the basic ground enforcers are not trained for or able to deal with. You have to make them TERRIFIED of you!! Aka fuck up their families while they are in formation fucking up all of you. THIS will widely open their eyes!! Do it in a way that forces them to police their own cuz if just one of them does something you all take it out on THEIR very vulnerable families!! alls fair in love and war...\n20. Disorientation can be a very big issue on the battlefield. Make smoke bombs to throw at their feet when in formation. Stack the smoke up make it THICK!!! As it gets so bad they wont be able to see or know where gaps in their line is...\n21. The dark web has plenty of videos the Chinese made during a few of their recent protests. Their tactics were proven effective should find those and implement.\n\nThose are a few thoughts to get started with. Ill come back with more as i think about them. Take care Australia and FIGHT TO THE DEATH!!!",
			"added": 1632580543
		}
	],
	"topic_vote": {
		"1631109590_1SBoneRDYzA3WAjaanYkhQKWtfkY2ZxCZ": 1,
		"1631527719_12ftwUykzZMAF7aq5Sd3qGh8HUNmnPh8Fn": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1631527719_12ftwUykzZMAF7aq5Sd3qGh8HUNmnPh8Fn": [
			{
				"comment_id": 1,
				"body": "Ok flu it is got it. Now lets fuck covid since its not even an issue. HOW can we take down the government?? Im open to ideas and debate! Save your freedoms",
				"added": 1631932721
			},
			{
				"comment_id": 2,
				"body": "> [epistemic](#comment_29_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L): You are not required to have the rhinovirus in order to have COVID19.That is complete and utter nonsense.Please provide citations for your claims.\n\nWhere is the disconnect for you? Hes saying that you can have the flu without having covid. but to have covid you also need to have the flu.",
				"added": 1631932847
			},
			{
				"comment_id": 3,
				"body": "> [xcape2net](#comment_977_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Tell that to the 4 million people who have died from Covid.  Oh, wait.  You can't.  Because they are dead !\n\nI dont give to fucks about 4 million people dying. Do you know how many people are in this world! 4 million aint shit! And 90% of them are old ass boomers anyways.",
				"added": 1632175663
			},
			{
				"comment_id": 4,
				"body": "> [epistemic](#comment_31_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L): None of this is true. COVID19 is a new mutation, not an old one, and this line of viruses doesn't become or cause the common cold. You're making things up out of ignorance.\n\nyup my ignorance huh",
				"added": 1632188615
			},
			{
				"comment_id": 5,
				"body": "> [anonymouslogin](#comment_338_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): What if we just figure out how to get what we want from governance. We need clearly defined requests, and a resolute determination to obtain those requests at any cost. Governance should serve at the pleasure of the people, and for at least 50 years government serves itself and the robber barons who control it with scores of LEA minions.\n\nI agree. And i have thought on this as well. What i would like to see be used to address this. Is blockchain voting. Decentralize, immutable, and you can ensure that people only vote 1 time. There are already a few very good companies working on this.",
				"added": 1632578981
			},
			{
				"comment_id": 7,
				"body": "> [deuxzaron](#comment_174_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): We should just let this run it's course. the population needs to be about 50% less anyways\n\nagreed. Like im not down for genocide but if its natural selection then im cool with it. Im just being selfish i want less people on the roads during rush hour LOL",
				"added": 1632584566
			}
		],
		"1632420694_13JuGiUNQFGijiA5NWsKsgv8YWBus5NvV1": [
			{
				"comment_id": 6,
				"body": "> [kaffie](#comment_1205_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): It already exists. Just create a folder with the site content and visit it. Ideally you'll also want to stick your public and private key in your sites.json file. The sitecreate command just creates the keys and basic folder template for you.\n\nYeah thats what i was thinking. All the site data is located in the zeronet data folder and when you bitcoin address is generated your private key should be generated at the same time. Im still a bit new to cryptography so i might be off a little but i know im close at least",
				"added": 1632583338
			}
		]
	},
	"comment_vote": {
		"12_1MieUGUUVUxVmvuLNGcTXt9wVBSqpeztDT": 1,
		"673_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1
	}
}