{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1558362080,
			"title": "Did someone have good privacy toolbar search",
			"body": "I already try duck duck, lxquick ... but i was asking myself if there some kind of new stuff on that ? Thx for answer",
			"added": 1558362079
		},
		{
			"topic_id": 1558612556,
			"title": "How can share movies or other thing on zeronet ?",
			"body": "Hi community, sorry for my beginning, but i would to ask how i can share movie on zero play just for being part of it a little more, i don't know or maybe it's just something which have an automatically way of sharing !! good day all of you folks !!",
			"added": 1558612554
		}
	],
	"topic_vote": {},
	"next_comment_id": 22,
	"comment": {
		"1558099954_1H8YqnwyoceTwJuGpy6nh3PDkwwii5kYuV": [
			{
				"comment_id": 1,
				"body": "!!! If i can say : \"That's the best image of mystic revolution they can have ever. I'm french, and here, in the news they said that maybe ( the church was already under construction - google translate sorry !) a worker was smoking in this area and \"maybe\" a cigarette butt would cause this fire !! \n\nIn my mind, wood frame are above and you really can't switch off a cigarette in that kind of way !!! So i really don't want to come closer of conspiracy things but that's make me so laught ( and sorry for christian people for that ).  God moves in mysterious ways !!! damn weah",
				"added": 1558113652
			},
			{
				"comment_id": 3,
				"body": "Wood can't burn because of oldeness ... That's stupid whatever the kind of wood",
				"added": 1558125158
			}
		],
		"1557968684_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 2,
				"body": "Stop me if i'm wrong but this would be like bio degradation ( same as organics things) for codes ? or sort of  web sites ?",
				"added": 1558114053
			}
		],
		"1558362080_19BG5iU2A8Yyy5CVN2TMvVZPy9c5NrfuPY": [
			{
				"comment_id": 4,
				"body": "ok, je connaissais les deux premier mais pas le troisième, merci !!",
				"added": 1558367767
			},
			{
				"comment_id": 5,
				"body": "ok, thx",
				"added": 1558374539
			},
			{
				"comment_id": 6,
				"body": "gracias !!",
				"added": 1558439515
			}
		],
		"1558550634_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": [
			{
				"comment_id": 7,
				"body": "go to linux but i don't think apple can be on open way for that , apple is a \"one block thing\"  and an app is not something for opening browser i think !! good luck",
				"added": 1558612023
			}
		],
		"1558604181_134mp4igVPMDh2eWajRGUkxgBhzAWgMqN9": [
			{
				"comment_id": 8,
				"body": "Nooooo !! is that an end or a beginning !! lov u italian",
				"added": 1558612117
			}
		],
		"1558691316_15Gk4wzjyNbPU3JZ31UnqMM3CMrX8pxmzF": [
			{
				"comment_id": 9,
				"body": "Sorry, i'm french and i'm totallly agree with cookies are sucking. And i hope you will not made confusion between people who are just users and politics and firm who want to make profits on everything. I think EU is so much in trouble with there weird idea of economy against something bigger or whatever else that they use everything they can in order to increase their GDP. UK manage good on brexit and now french economics may talk abour frexit. Europe laws are so constraining that is boring for every body even if you are in EU !! Hope you'll like me even i'm french !!! xxx",
				"added": 1558703856
			},
			{
				"comment_id": 12,
				"body": "> [duende](#comment_71_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): Perfect for a coward that hides his identity, like you. Now die.\n\nlove you too, go get your cookies you're lacking sugar your mama said so get some sleep and don't stay with adult person, i don't think you can play with your dady computer",
				"added": 1558705226
			},
			{
				"comment_id": 13,
				"body": "> [1sttaz](#comment_12_19BG5iU2A8Yyy5CVN2TMvVZPy9c5NrfuPY): love you too, go get your cookies you're lacking sugar your mama said so get some sleep and don't stay with adult person, i don't think you can play with your dady computer\n i forget , come to see me in real that i can really see your childish face, i already enjoy myself to put your face down\ngo revolting in teh real world baby, you need some sun is good for vitamin C !!!! what ever you're so cute",
				"added": 1558705368
			},
			{
				"comment_id": 14,
				"body": "> [duende](#comment_72_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): Go on, show me your identity. You won't, because you are a coward, a useless coward. Die you fucking degenerate. Die, kill yourself.\n\nmememememem !!! poor little you, go take your pill now",
				"added": 1558705415
			},
			{
				"comment_id": 15,
				"body": "> [duende](#comment_72_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): Go on, show me your identity. You won't, because you are a coward, a useless coward. Die you fucking degenerate. Die, kill yourself.\n\"show me your identity ... nanana , your so funny and desperate !!!",
				"added": 1558705472
			},
			{
				"comment_id": 16,
				"body": "duende !!!! youhou , i'm gonna laught at you for thousand generation now with your little angry !!!! you make so laugh !!! \" go kill yourself !!!! hahahha !!! you're so funny little thing",
				"added": 1558705637
			},
			{
				"comment_id": 17,
				"body": "> [1sttaz](#comment_16_19BG5iU2A8Yyy5CVN2TMvVZPy9c5NrfuPY): duende !!!! youhou , i'm gonna laught at you for thousand generation now with your little angry !!!! you make so laugh !!! \" go kill yourself !!!! hahahha !!! you're so funny little thing\n\nyou made a very bad ambiance you know, tell if i wrong your in the middle of the Y generation ?? that it, that why !!!",
				"added": 1558705719
			},
			{
				"comment_id": 19,
				"body": "> [daz](#comment_16_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr): Yer but the EU is only just getting started, but who is the real power behind it all I would say never rule out the Black pope. who is backed by German Jews and for years the poor Germans had to pay a pope tax. may be he wants to tax all of Europe. Hay you need new laws so when you break them you can be fined. Our new tax system is a you will be fined system and as long as you obey obey do nothing become a good work slave. you will have a long life 45 years if you are lucky.\n\nEU comes from the 14/18 first war it was for coal agreement and they was trying to became bigger for having more possibility of global decision in special area. I don't know how yousee the rest of the world but if you are coming from US i just remember you that's only britain and spanish people who make your own state even they eliminate indigenous people if you want to be really far from your original seed try to speak a new language which doesn't come from EU. THX folks !!!",
				"added": 1558710595
			},
			{
				"comment_id": 20,
				"body": "> [fucktheeu](#comment_3_15Gk4wzjyNbPU3JZ31UnqMM3CMrX8pxmzF): YES it helps zeronet to grow\n\nmmm, sorry but there no benefits for EU cookies using us service. In france they made the GAFA for put atxes for french company on the net the they is no very benefits for one particular country or for the www. They maybe don't coding but there are very smart for reapatrier money. If u think i your kind of way the www will be more than the most richest person in the world",
				"added": 1558711441
			},
			{
				"comment_id": 21,
				"body": "technology is not a property for taxes, in that case marie curry would may pay the uranium and medical radio technology and all of the better vaccine that we have now and she's a french women. So be smart please all the technology we have come from EU and the net is not most intelligent thing that popular user can have, it was already use by military people and code by a woman who called ADA and i don't think she's from US so nobodt can't take all the profits from something because that's will be concours deloyale and that is prohibited in all the worls with the ONU so be smart again please",
				"added": 1558711821
			}
		],
		"1558612556_19BG5iU2A8Yyy5CVN2TMvVZPy9c5NrfuPY": [
			{
				"comment_id": 10,
				"body": "thx !!!",
				"added": 1558703895
			},
			{
				"comment_id": 11,
				"body": "> [duende](#comment_61_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): You are the worst piece of shit to come here in the last week.You are a fucking disgrace. Do us a favor, kill yourself, worthless scum.\n\nCome duende, there were just 2 talks a few weeks ago !! don't be selfish and do the first move, kill you first we are so disgrace to understand how to kill ourselves !!! don't be shy !!! maybe we can ask to your mother if you come to a favelas and that why you have son many mind problems so for your future, is something boàthering you try to take some xanax and shout your poor mouth or come to my real front door instead of making baby crying behind your computer.your piece of shit and don't make you like edgy person, i was in the anarchist federation and i can really tell you that you are just some kind of spotty teenage who have some virtual network issue. So go masturbate yourself in your lonely and spermy friends and don't bother me with kind of comment. You sound like an unwanted child lml fuck youuuu and lick my ass duende cause maybe your name come from spanish people who came in your contry in order to forced you to speak like my grandmother come from, that is spanish baby so go wash yourself in your water closet even my grandma fuck you in your name duende. Bye !!! xxx don't try to be an bad hacker too little miserable !!! and love also cause you looks like depressed",
				"added": 1558705082
			},
			{
				"comment_id": 18,
				"body": "i know duende, who are in Mensa, that's why !! maybe i can introduce you because i have some friend in it, maybe you will be more surrounded and fixe your social problem !!! poor dick !!! i'm so laughing right now again, you're so dumb to me so get out from this page the only thing you know is craking some porn oh and also my brother is an informaticen coding for french aviation stuff when he was younger and www was'nt exist so go put all your finger in acid thing and never bothering me in this place, i hope i'll made myself understood early ejaculator",
				"added": 1558706217
			}
		]
	},
	"comment_vote": {}
}