{
	"next_topic_id": 4,
	"topic": [],
	"topic_vote": {
		"1587888954_1EsynzasFzW2SVpMKwWaxag5u2DXcL5W1Y": 1
	},
	"next_comment_id": 225,
	"comment": {
		"1574277651_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 1,
				"body": "What happened?",
				"added": 1574277986
			}
		],
		"1574566466_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "This joke has arms and legs and sense.",
				"added": 1574583188
			}
		],
		"1574812874_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 3,
				"body": "Wszystkie religie to jest fikcja; zrobione w celu podporządkowaniu sobie niewolników. \"Dobry niewolnik to posłuszny niewolnik\". I taki jest tego cel. Wymóc bezwzględne posłuszeństwo, wobec siebie. Czytaj; zarządzających. Wszystkie przykazania, to jest fikcja. Wszystkie opowiadania to są bajki dla maluczkich, i głupiutkich. Mądrością wszystkich religii jest wykorzystać swoich wiernych. Co jest czynione od tysiąca lat, z dobrym powodzeniem. Dlatego jest ograniczana wiedza, a nauka jest sprowadzana na ślepy tor, dlatego płoną stosy, i są stawiane szubienice. Mała garstka, zarządza światem dość skutecznie. \nDla mnie jest święto, wtedy kiedy nie mam nic do zrobienia, a czas mogę poświęcić na dowolny cel; spacer z psem, rozmowę z inteligentnym człowiekiem, ( co w dzisiejszych czasach jest już rzadkością ). \nWesołych żydowskich świąt.",
				"added": 1574847985
			},
			{
				"comment_id": 5,
				"body": "Chodzi o to aby zrobić wreszcie krok na przód. I wyrwać się z tego marazmu i oszustwa. Nie można być, trochę prawdziwym, i trochę zakłamanym. To my decydujemy; kim jesteśmy, kim będziemy. Kim się staniemy.",
				"added": 1574857941
			},
			{
				"comment_id": 6,
				"body": "Tutaj nie chodzi o walkę; ale wytłumaczenie, w sensie historycznym. Wytknięcie oczywistego kłamstwa. Fałszerstwa dla zysku. Decyzja należy zawsze do petenta. My tylko mamy wytknąć ułomność tego systemu i jego zakłamanie. Przykład; taki ksiądz mówi co innego, a robi całkiem co innego. I niema obawy grzechu, dlaczego??? Bo on wie że to jest fikcja. Pismo, rzekomo święte; a zostało 300-lat potem napisane. Pytanie? Czy coś pamiętasz sprzed 100-lat? To jak można coś opisać trzysta lat potem; Kto to pamięta? To są szczegóły na które trzeba zwrócić uwagę.",
				"added": 1574859007
			},
			{
				"comment_id": 7,
				"body": "Ty Też możesz przetłumaczyć na angielski; Ja jestem wolnym człowiekiem i piszę w niezależnym języku.\nNie jestem niczyim niewolnikiem.\nJeżyk angielski to język niewolników.\nJeśli mnie coś interesuje? To ja sobie to tłumaczę.\nYou can also translate into English; I am a free man and I write in an independent language.\nI am not a slave to anyone.\nEnglish is the language of slaves.\nIf I'm interested in something? I explain it to myself.",
				"added": 1574950045
			},
			{
				"comment_id": 8,
				"body": "To nie Anglicy są niewolnikami.\nTo podbite kraje, przez usmanów, są niewolnikami.\nOni używają też języka Angielskiego. \nDlatego wymuszają tej język na wszystkich podbitych narodach.\nDlatego język Angielski jest językiem niewolników\n\nThey are not English slaves.\nThese conquered countries, by usman, are slaves.\nThey also use English.\nThat is why they force this language on all conquered nations.\nThat is why English is the language of slaves.",
				"added": 1575042212
			},
			{
				"comment_id": 9,
				"body": "Są dwie historie; Jedna pisana przez zwycięzców.\nA druga ta prawdziwa.\nRóżnica jest kolosalna.\nPoznanie obydwu, daje szanse poznania prawdy.\nWtedy niema miejsca na kłamstwo.\nPozostaje tylko prawda.\n\nThere are two stories; One written by the winners.\nAnd the other is the real one.\nThe difference is colossal.\nGetting to know both gives a chance to learn the truth.\nThen there is no place for a lie.\nOnly the truth remains.",
				"added": 1575083938
			}
		],
		"1574848015_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 4,
				"body": "Your question? is also the answer.",
				"added": 1574848132
			}
		],
		"1575180863_11xvtkLUfeD7brvyLqn93txTVbwFP85bg": [
			{
				"comment_id": 10,
				"body": "To masz duży problem.\nJeszcze wolnym narodem są Aborygeni.\nI Ameryka Południowa, - Papuasi.\nTo są jeszcze wolni ludzie.\nAle temat jest ciekawy.\n\nYou have a big problem.\nAborigines are still a free nation.\nAnd South America, - Papuan.\nThey are still free people.\nBut the topic is interes",
				"added": 1575214993
			},
			{
				"comment_id": 11,
				"body": "Z akceptacją mógłby być problem.\nTo zależy czy jest dobrym człowiekiem?\nOni potrafią to odróżnić bezbłędnie.\nZeroNet jest na cały świat, wystarczy bateria solarów do komputera.\nRozwój, to nie znaczy nauka, ale znaczy \"Wiedza\", posiadana.\nSą to dwa całkiem różne słowa. Wiedza i nauka.\n\nAcceptance could be a problem.\nDoes it depend if he is a good man?\nThey can defer it without error.\nZeroNet is worldwide, all you need is a solar battery for your computer.\nDevelopment does not mean science, but means \"Knowledge\" possessed.\nThey are two quite different words. Knowledge and science.",
				"added": 1575222699
			},
			{
				"comment_id": 12,
				"body": "Słuszna uwaga; przepraszam.\nMożna satelitarny internet; jest drogi, kosztowny.\nTo jest tylko przykładowa dyskusja.\nZawsze coś można wymyślić, i zaradzić.\n\nGood point; excuse me.\nYou can satellite internet; it's expensive, expensive.\nThis is just an example discussion.\nThere is always something you can think of and remedy.",
				"added": 1575233211
			}
		],
		"1575246757_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 13,
				"body": "Jak - Kali ukraść  krowa, to jest dobrze.\nJak - Kalemu  ukraść krowa, to jest źle.",
				"added": 1575248039
			}
		],
		"1575419519_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 14,
				"body": "Super text.",
				"added": 1575422729
			}
		],
		"1576099007_1A1JcKDgksT5pQJoSo7g1P1cC9kAKvG93m": [
			{
				"comment_id": 15,
				"body": "Why don't you go to the doctor?\nDo you have a damaged head?",
				"added": 1576107172
			}
		],
		"1576309972_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 16,
				"body": "You are not alone here.\nThere are also others who think independently.\nThere are more and more people.",
				"added": 1576332170
			}
		],
		"1576592495_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 17,
				"body": "Very wisely written;\nI support this thinking\nThis style of thinking.",
				"added": 1576616859
			},
			{
				"comment_id": 18,
				"body": "To nie tłum jest głupi.\nTo nie ludzie chcą źle.\nTemu są winne trole i booty-roboty.\nTo zło chce zapanować nad dobrem.\nChcą wszystko kontrolować.\n\nIt's not the crowd that is stupid.\nIt's not people who want it wrong.\nThey are guilty of trolls and booty robots.\nIt is evil that wants to control good.\nThey want to control everything.",
				"added": 1576772069
			}
		],
		"1577029856_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 19,
				"body": "To nie my, mamy się przystosować.\nTo oni powinni zrozumieć, i się zmienić.\nWprowadzając zależne wtyczki, sami się staniemy  uzależnieni.\n\nWe're not supposed to adapt.\nThey should understand and change.\nBy introducing dependent plugins, we will become addicted ourselves.",
				"added": 1577048368
			}
		],
		"1577184518_1LHvuxYZmnEjfamgn2jq7cRnp6MpQ5XzHt": [
			{
				"comment_id": 20,
				"body": "Wesołych i szczęśliwych świąt.\nMerry and happy holidays.",
				"added": 1577190981
			}
		],
		"1577433117_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 21,
				"body": "Co mam powiedzieć? cały czas mówię. Jak do ściany.\nWhat am I supposed to say? I talk all the time. Like to the wall.",
				"added": 1577433233
			}
		],
		"1577574820_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 22,
				"body": "Dobry pomysł, ale trochę trudny do zrealizowania. Te dzisiejsze społeczeństwo jest martwe, i nie potrafi myśleć samodzielnie.Mogę życzyć powodzenia, i trzymać kciuki.\n\nGood idea but a bit difficult to implement. Today's society is dead and can't think for itself. I can wish you luck and keep my fingers crossed.",
				"added": 1577575230
			}
		],
		"1578034470_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 23,
				"body": "To są pieniądze, dla zbrojeniówki.\nThis is money for the defense industry.",
				"added": 1578041123
			}
		],
		"1578781307_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 24,
				"body": "Po angielsku nie da się tego wytłumaczyć.\nTrzeba być, Słowianinem.\nWtedy wszystko jest proste, albo staje się proste.\nWystarczy troszkę wiedzy na ten temat.\nJak zamieszkać w lesie?\n\nIt can't be explained in English.\nYou have to be a Slav.\nThen everything is simple or it becomes simple.\nAll you need is a little knowledge on this subject.\nHow to live in a forest?",
				"added": 1578781985
			},
			{
				"comment_id": 25,
				"body": "Z daleka od \"cywilizacji\"- czyli w lesie.\nLas = Puszcza, Knieja, odludzie.\nCoś takiego, jak Brazylia.\nTakich miejsc do zamieszkania, jest mnóstwo.\nCywilizacja to tylko, 30% - globalnych terenów.\nReszta jest wolna, i nie zamieszkała.\nNiema nadzoru, banków, polityków, policji i wojska.\nJesteś wolnym człowiekiem. \nPytanie? Tylko czy chcesz być wolny???\n\n\nFar from \"civilization\" - in the woods.\nForest = Forest, Knieja, outback.\nSomething like Brazil.\nThere are plenty of such places to live.\nCivilization is only 30% of global areas.\nThe rest is free and not inhabited.\nThere is no supervision, banks, politicians, police and army.\nYou are a free man.\nQuestion? Only do you want to be free ???",
				"added": 1578824770
			}
		],
		"1579430150_14giYM2ws7rPBNTE8o9j8QSpkNTPXPUPiE": [
			{
				"comment_id": 26,
				"body": "Ciekawy artykuł, jak bardzo podobny do naszego kraju? Wystarczy zmienić tylko tytuł.\n\nAn interesting article, how similar to our country? You only need to change the title.",
				"added": 1579448204
			}
		],
		"1579444197_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": [
			{
				"comment_id": 27,
				"body": "Ciekawy układ, strony; zawiera wszystko co potrzeba. Szkoda tylko że jest, w języku niewolników.                         Brak możliwości wyboru języka, wolnego i niezależnego. \nWielka szkoda, chętnie bym ją propagował znajomym.\n.\nInteresting layout, pages; contains everything you need. It is a pity that it is in the language of slaves. No language selection, free and independent.\nIt's a pity, I'd like to propagate it to my friends",
				"added": 1579458750
			},
			{
				"comment_id": 28,
				"body": "> [aassddff](#comment_14_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): I Feel like that sometimes (Portuguese is my Main Language), but overall, it's either English or Esperanto if you want it to be accessible to other countries. Having a Real time Translator plugin for Zeronet as a whole would be nice, Or using Zerotalk's method.\n\nDobry pomysł. Ale ludzie są bardzo leniwi.\nJak nie podasz na tacy? To mają problem.\n\nA good idea. But people are very lazy.\nHow do you not serve on a tray? They have a problem.",
				"added": 1579472034
			}
		],
		"1579614061_1JYGp4onxvJxFQovjVFrxjC4hpSSDzXEzi": [
			{
				"comment_id": 29,
				"body": "Wszystkie loterie, są po to aby przegrać.\nNiema takich loerii do wygrania.\n\nAll lotteries are to lose.\nThere are no such loerie to be won.",
				"added": 1579614233
			}
		],
		"1579818870_13HeCqSo3hr5Ady7E3fv17FQ8Pyi1VeeY7": [
			{
				"comment_id": 30,
				"body": "I quote; How do I remove users from that list that shows under \"Sent\"?\nYou must open the letter again and put it in the trash.",
				"added": 1579820225
			},
			{
				"comment_id": 31,
				"body": "In Zeromail, you have three positions.\nNew Message.\nInbox.\nSent. You open it and see your letter sent.\nYou are opening this letter.\nIn the upper right corner you have a basket. You click him.\nThe letter has been deleted.",
				"added": 1579821702
			},
			{
				"comment_id": 32,
				"body": "Witam; ja piszę przy pomocy tłumacza.\nNie wszystko może być dobrze zrozumiane.\nPoczta ma pojemność,48K- jest to mała pojemność.\nDlatego trzeba ją ciągle czyścić.\nCzy o to tobie chodziło?\nCzy chodziło o usunięcie adresu nicku ze spisu adresowego.\n.\nHello; I write with the help of an interpreter.\nNot everything can be understood well.\nThe post office has a capacity of 48K - it is a small capacity.\nThat's why you need to clean it constantly.\nWas that what you meant?\nWas it about removing the nickname from the address book.",
				"added": 1579887633
			}
		],
		"1580849186_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": [
			{
				"comment_id": 33,
				"body": "PeerTube w sieci ocenzurowanej\n\nhttps://joinpeertube.org/\npróbny\nhttps://vid.lelux.fi/videos/overview\n\nZnajduje się w cenzurowanej sieci, ale jest dobrą rekomendacją dla osób, które nie korzystają z ZeroNet. Pomaga zmniejszyć znaczenie serwisów YouTube, Vimeo, Facebook i podobnych.\n.\nI to jest myśl przewodnia, separacja od dyktatu politycznego i wszechobecnej cenzury. to jest pierwszy krok do wolności osobistej.; Następny krok, to zacząć korzystać z ZeroNetu, albo podobnej aplikacji. Podstawą jest zrozumienie o co przeciwnikowi tak naprawdę chodzi? A jemu tylko chodzi, aby nas ubezwłasnowolnić. I podporządkować nowej doktrynie, \"NWO\". Co skutecznie powolutku wprowadza, a my jesteśmy jak te szczury laboratoryjne. Uśmiechnięci i szczęśliwi. Przemyślcie ten apel, i jeśli znajdziecie choć jeden punkt oparcia; dajcie wsparcie w postaci reklamowaniu ZeroNeta.",
				"added": 1580856757
			},
			{
				"comment_id": 34,
				"body": "To jest niezależna strona dostepna w zwykłej sieci.\nJestem po wstępnym sprawdzeniu.\nUważam że jest warta uwagi.\njako zastępstwo, usraelskich stron.\nJest obserwowana, ale jest wolny dostęp dla wszystkich.\nWarto się przesiąść. Warto wesprzeć.\n.\nThis is an independent site available on the regular network.\nI am after the initial check.\nI think it is worth attention.\nas a replacement, the Israeli parties.\nIt is observed, but there is free access for everyone.\nIt's worth to change. It is worth supporting.",
				"added": 1580862637
			}
		],
		"1581437300_15cApprVFcr1skAkWssq5aAXKa7pDwJJve": [
			{
				"comment_id": 35,
				"body": ".*Zajętego już drugi raz nie wybierzesz, chyba że masz kopię poprzedniego. Mleko się rozlało.Zrób nowy.\n.\nYou won't select the second one you have taken unless you have a copy of the previous one. Milk has spilled. Make a new one.",
				"added": 1581474749
			}
		],
		"1581695503_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 36,
				"body": "1%- więcej prywatności, to jest mało. Jak dojdziesz do, 95%- Prywatności, To będzie super.\n.\n1% - more privacy is not enough. When you get to 95% - Privacy, It will be great.",
				"added": 1581708372
			}
		],
		"1581744611_1NdJyMSqnWWim7ibxBvaNsMgQvqkkTXVnz": [
			{
				"comment_id": 37,
				"body": "And that's good. I haven't had such a long time.\nWho's an idiot Police or parents?",
				"added": 1581746584
			}
		],
		"1581976802_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 38,
				"body": "Question? Which one was better?\nAnd he spied less?",
				"added": 1581977705
			}
		],
		"1582577947_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 39,
				"body": "Przejść na wyższy poziom rozwoju osobistego.\n.\nGoing to a higher level of personal development.",
				"added": 1582582941
			}
		],
		"1585024413_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 40,
				"body": "This might be interesting?\nIf it is not selective and partial.",
				"added": 1585089147
			}
		],
		"1585772137_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 41,
				"body": "Very interesting what you write.\nI'm going to check and test it.\nHow do I check how it works? I'll write it.",
				"added": 1585774819
			},
			{
				"comment_id": 42,
				"body": "Only available for windows? That's what i just read on their site.\nit's a shame it's only for windows?",
				"added": 1585782117
			}
		],
		"1588557676_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 43,
				"body": "An interesting solution; Question? To what extent is it not tracked?\n  Let's not forget that it promotes the west.\nAnd this democracy always has something on its claws. (ford, lots of ford).\nShe was never disinterested.\nQuestion? How much do you lose to gain?",
				"added": 1588585280
			}
		],
		"1589714892_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 44,
				"body": "Konkurencja jest zawsze dobra;  Jaka by nie była?  Przybył konkurent,  To bardzo dobrze, Czekam kiedy Rosja, coś utworzy własnego, niezależnego od zachodu. To jest optymalne wyjście z tej patowej sytuacji. Na razie stworzyła, niezależną dystrybucję Linuxa, która zastępuje ; windowsa,  i to też jest sukces na skalę światową. Wyłamała się z szeregu, zrobiła krok do przodu. A to oznacza tylko, że Bil Gates idzie tam w odstawkę. Chwała im za to.",
				"added": 1589736879
			}
		],
		"1589734049_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": [
			{
				"comment_id": 45,
				"body": "Ciekawe rozwiązanie?  Być może zrewolucjonizuje internet? Jeśli będzie dużo chętnych. Zobaczmy jaki będzie odzew na tą informację. Powodzenia i sukcesu.",
				"added": 1589738136
			}
		],
		"1589825556_1G8B8kPwDH69FMuSPEvNkG8JJy5PxTpQtc": [
			{
				"comment_id": 46,
				"body": "Trackers announcing: 0, error: 0, done: 9\nIs something weak? No connection.\nWhy?",
				"added": 1589826304
			},
			{
				"comment_id": 47,
				"body": "Does not connect?",
				"added": 1589826471
			},
			{
				"comment_id": 48,
				"body": "Everything is ok. The second time it opened. Interesting material, Thanks.\nGreetings.",
				"added": 1589830741
			}
		],
		"1589886834_16FFktck2XiA33aQcarrqPA8XzK3coaUBD": [
			{
				"comment_id": 49,
				"body": "No, you are not wrong; everything is moving in this direction. And it is geared to taking control of THIS.\nFrom the very beginning, it's the goal, take control.",
				"added": 1589893267
			},
			{
				"comment_id": 50,
				"body": "Beginning; This is the beginning of creation. That moment when the idea was born.\nAnd as for the crypto, It's just a scam for the naive.\nAnd offer for the very rich.\nThis always happens. And history talks about it.",
				"added": 1589908517
			}
		],
		"1589945996_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [],
		"1590041703_19y1ZG2DVeRM65kYxKcLz7MLGTfTfoUWSm": [
			{
				"comment_id": 52,
				"body": "Jesteś zablokowany emocjonalnie. Masz blokadę, założoną przez watykan.  Aby zrozumieć Rosjan, którzy są wolni. I nie podlegają Watykanowi. Aby to zrozumieć, musisz tam pomieszkać z Rosjanami. Piszę tylko o Rosjanach. Tam też są inne narody, i one też są inne. Ale też są przyjaźnie nastawione do świata. \nCały czas nas się uczy, że Rosja to zły kraj. Wystarczy pojechać i samemu sprawdzić. Wbrew temu co piszesz, tam niema Cenzury na materiały naukowe i społeczne. Jest bardzo duża swoboda osobista;\nWiększa niż myślisz. Była próba zaorania Rosji, ale się nie powiodła.\nTeraz to naprawiają, to co parę koniokradów w myckach próbowało popsuć. I to  im się udaje zrobić, ( naprawić ).\n.\nPiszę w dwóch językach, bo tłumacz Fałszywie tłumaczy; \nZadaj pytanie? Dlaczego to on robi?\n.\nYou are emotionally blocked. You've got a blockade by the Vatican. To understand the Russians who are free. And they are not subject to the Vatican. To understand this, you must live with the Russians. I write only about the Russians. There are other nations there, and they are different too. But they are also friendly to the world.\nWe are constantly learning that Russia is a bad country. Just go and check it out for yourself. Contrary to what you write, there is no Censorship for scientific and social materials. There is a lot of personal freedom;\nBigger than you think. There was an attempt to plow Russia, but it failed.\nNow they fix it, what a couple of thieves' thieves tried to spoil. And they manage to do (fix).\n.\nI write in two languages because the translator translates falsely;\nAsk a question Why is he doing this?",
				"added": 1590054669
			},
			{
				"comment_id": 53,
				"body": "> [tnytuqsgqnywmecj](#comment_26_19y1ZG2DVeRM65kYxKcLz7MLGTfTfoUWSm): I have NO association with the Church or Vatican and think that the Russian people are for the most part decent! ...  I have no ill will to Russia as a country nor do I have issues with the Russian people.    I don't care much for politics as such can be very misleading and have seen what appears to be corruption and or incompetence!   ...   I live in Canada and have seen the mess within the USA in regards to politics...   Everyone comments for certain and post what is mostly propaganda and such is typical...    The western word does not like Communism, but at the other end Capitalism and the free and open market place is VERY predatory and can be very harmful. [...]\n\n.Dziekuję;  Zrozumiałem, zaszło nieporozumienie.\n.Thank you; I understood, there was a misunderstanding.",
				"added": 1590132799
			}
		],
		"1590241272_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [],
		"1591016734_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 59,
				"body": "Works with Windows, macOS and Ubuntu Linux?; What does it mean? and, Ubuntu?                                                                                         . Normally it is given  And, Linux.\n.\nDziała z systemami Windows, macOS i Ubuntu Linux; Co to znaczy? i Ubuntu?.                                                                                      Zwykle jest podawany  I Linux.",
				"added": 1591031808
			},
			{
				"comment_id": 60,
				"body": "That's the result of it; Since Ubuntu is not Linux.\n.\nTak z tego wynika; Od kiedy już Ubuntu nie jest Linuxem.",
				"added": 1591040042
			},
			{
				"comment_id": 61,
				"body": "Ubuntu is a distribution sold to Canonical. It has closed sites that are no longer available.\n.\nUbuntu to jest sprzedana dystrybucja firmie Canonical. Ma zamknięte rewiry, które są już niedostępne.",
				"added": 1591107595
			}
		],
		"1591276514_1MoiNscMBZopwz1HdWDky1kXHAb4GrTruH": [
			{
				"comment_id": 62,
				"body": ".I haven't read such nonsense in a long time?\nWhat did you base your knowledge on when writing this story?\nYou have no historical insight? and Actual state. Revise your knowledge and write everything again.\nHave a nice day.\n.\nTakich bredni dawno nie czytałem?\nNa czym opierałeś swoją wiedzę, pisząc to opowiadanie?\nKompletnie brak tobie rozeznania historycznego? jak i Faktycznego stanu. Zrewiduj swoją wiedzę, i powtórnie od nowa napisz wszystko.\nMiłego dnia.",
				"added": 1591282597
			}
		],
		"1591776814_1EisAdDMyEXWtPiKWM8t4wme5yXX1q9552": [
			{
				"comment_id": 63,
				"body": "Sure, that's a good idea;\nI support!\nOnly I have never had an account there.\nI am a conscious person.\n.\nNa Pewno, to jest dobry pomysł; \nPopieram!\nTylko ja od zawsze nie miałem tam konta.\nJestem świadomym człowiekiem.",
				"added": 1591783315
			}
		],
		"1592236427_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 64,
				"body": "Wejdź na Rosyjskie strony, to znajdziesz; Tam jest wszystko, czego tutaj nie ma.",
				"added": 1592241033
			}
		],
		"1594638525_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [],
		"1595014824_1D2AJaBfjqNkFg2Yk6btXMb1XFb8DKUdrU": [
			{
				"comment_id": 67,
				"body": "Check out YouTube-PL",
				"added": 1595019849
			}
		],
		"1595165517_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [],
		"1596076954_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 70,
				"body": "An interesting proposition that makes life easier. Worth recommending. Record the address under \"Good and Useful\".\n.\nCiekawa propozycja, ułatwiająca życie. Godne polecenia.               Zapisać Adres w pozycji \"Dobre i Pożyteczne\".",
				"added": 1596094341
			}
		],
		"1596096685_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [],
		"1596157881_1LYf3SezNPsLbMvL1pX7ZLXGJF9Yspj8Ce": [
			{
				"comment_id": 72,
				"body": "Tocaste un problema complicado; ¿Pregunta? ¿Cuáles son sus habilidades para evitar que esto suceda? Se necesita conocimiento general. Y conocimiento de psicología. La mayoría de la gente no tiene la menor idea de ello. Sin querer, puedes hacer daño; en lugar de ayudar\nLo más importante, detener, detener, este proceso de pensamiento.\nConvocar a alguien competente para obtener ayuda. Esto debe hacerse rápidamente.\nToda vida es preciosa. Hay una buena forma de salir de cualquier situación.\n.\nPoruszyłeś skomplikowany problem; Pytanie? Jakie masz umiejętności aby temu zapobiec? Potrzebna jest wiedza ogólna. I wiedza z zakresu psychologii. Większość ludzi nie posiada, nie ma, na ten temat , bladego pojęcia. Nieumiejętnie, można zaszkodzić; zamiast pomóc. \nNajważniejsze, zatrzymać, powstrzymać, ten proces myślenia.\nWezwać na pomoc kogoś kompetentnego. Trzeba to zrobić szybko.\nKażde życie jest cenne. Z każdej sytuacji, jest jakieś dobre wyjście.",
				"added": 1596184596
			}
		],
		"1596264833_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": [],
		"1596269492_1ETarTu7fyokpgRoBMiGZc8L3FwnDTGstL": [],
		"1596649883_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [],
		"1596874418_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2": [],
		"1597067285_1CpcxT1xWtqTRZTRR1KnH8gGsY2i4rJ7du": [],
		"1597367837_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": [],
		"1597484759_14ADWoY886HnM8jPeipXarxAfyQANiMTQj": [],
		"1597578463_1NgTAHQ6Ee7pWNXbmnJzfSCBNZoMhhbC4G": [],
		"1597799191_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG": [],
		"1597936978_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 101,
				"body": ".Who is? Alexei Navalny? And who is it for?\nWho was paying him?\nI am asking for some real information;\n.\nWho is? Alexei Navalny? And who is it for?\nWho was paying him?\nI am asking for some real information;",
				"added": 1597941186
			},
			{
				"comment_id": 102,
				"body": ". This is the Democracy you fight for.\nA US university has instructed students to use a nightmarish anti-COVID app. It lost location all the time, it also had a banal vulnerability that gave full access to the backend ...\nPosted: 20 Aug 2020 01:11 AM PDT\nMichigan College has decided to fight COVID with nuclear weapons. Her role was played by an app that makes probably all the dark dreams of privacy defenders come true. Firstly, the app is mandatory, secondly, it tracks the location of users 24/7: There's a catch. The app is designed to track students' real-time locations around the ...\nArticle A US university has instructed students to use a nightmarish anti-COVID app. It lost location all the time, it also had a banal vulnerability that gave full access to the backend ...\nThe app also had another serious problem - the user could refer to the backend by ID (IDs were consecutive numbers) and obtain the QR code of any user - thus learning about the student's data or his COVID-19 test result:\nIn other words, because we could see another user's QR code, we could also see the student's full name, their COVID-19 test result status and what date the student was certified or denied.\n.\nTak wygląda Demokracja, o którą walczycie.\n.Uczelnia wyższa w USA nakazała studentom korzystania z koszmarnej appki anty-COVID. Trackowała lokalizację non stop, miała też banalną podatność dającą pełen dostęp do backendu… \nPosted: 20 Aug 2020 01:11 AM PDT\nKoledż w Michigan postanowił walczyć z COVID za pomocą broni atomowej. W jej rolę wcieliła się appka, która urzeczywistnia chyba wszystkie czarne sny obrońców prywatności. Po pierwsze aplikacja jest obowiązkowa, po drugie śledzi lokalizację użytkowników w trybie 24/7: There's a catch. The app is designed to track students' real-time locations around the...\nArtykuł Uczelnia wyższa w USA nakazała studentom korzystania z koszmarnej appki anty-COVID. Trackowała lokalizację non stop, miała też banalną podatność dającą pełen dostęp do backendu… \nAppka miała też kolejny poważny problem – użytkownik mógł odwołać się do backendu po ID (ID-ki były kolejnymi liczbami) i uzyskać kod QR dowolnego użytkownika – tym samym poznawał dane studenta czy jego wynik testu na COVID-19:\nIn other words, because we could see another user’s QR code, we could also see the student’s full name, their COVID-19 test result status and what date the student was certified or denied.",
				"added": 1597998344
			}
		],
		"1598362059_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF": [
			{
				"comment_id": 104,
				"body": "It shows what kind of world we live in;\nWho can actually do whatever they want.\nEveryone else is safe from it.\nViolence dictates the terms of the entire world, with no exception.\nDemocracy is an illusion in the circus in the arena.\n.\nTo pokazuje w jakim my swiecie żyjemy;\nKto faktycznie może robić co tylko chce. \nWszystkim innym wara od tego.\nPrzemoc dyktuje warunki całemu światu, bez żadnego wyjatku.\nDemokracja to jest iluzja w Cyrku na arenie.",
				"added": 1598371091
			}
		],
		"1598551981_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 105,
				"body": "It is based on Ubuntu; Ubuntu is, it was sold a long time ago. This is no longer linux.\nThey let you in raspberries.\n.\nTo bazuje na Ubuntu; Ubuntu jest , zostało dawno temu sprzedane. To nie jest już linux. \nWpuszczają was w maliny.",
				"added": 1598555194
			},
			{
				"comment_id": 106,
				"body": "You have been controlled for a long time.\nLaughter in an empty room.\nSometimes it's hard to listen to this nonsense.\n.\nJesteście od dawna kontrolowani.\nŚmiech na pustej sali.\nCzasami trudno jest słuchać tych głupot.",
				"added": 1598606216
			},
			{
				"comment_id": 107,
				"body": "> [kapec](#comment_39_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): https://itsfoss.com/onionshare/\n\n.I do not explain this because of the distortions that arise in the glasses.\nCo skłoniło Cię do takiego wniosku? Nie ma to żadnego związku z ubuntem nie jest to dystrybucja linucha a zwykły program.\n.\n.Wyjaśniam; Został podany link do zainstalowania tego programu. Więc zajrzałem tam i sprawdziłem co i jak? Jest wyraźnie napisane, że to jest zrobione pod Ubuntu. Komendy też na to wskazują. Więc Repozytoria też są od **Ubuntu**. Więc jeśli jeśli Ubuntu sprzedano i teraz nim zarządza , Canonikal, - mikrosoft? To czego jeszcze mam szukać? Trzeba być mocno naiwnym, żeby myśleć że to jest uczciwe? Ubuntu od dawna nie jest Linuxem. Od momentu sprzedaży. Koniokrady wykorzystują nazwę od Linuxa, do swoich celów. Firma Canonikal nie jest wiarygodna. A to że reklamują dla naiwnych, że to jest Linux. To jest godne ubolewania. A ludzie łykają jak Pelikany. To jest** „Koń Trojański”**, który próbują przemycić do innych dystrybucji. **Zasada Nr.1-,** Instalujemy tylko z właściwego Repozytorium. Żadnych szemranych firm. / żadnego, łatwo i przyjemnie /. **Bezpieczeństwo w Internecie** to osobny rozdział  - WIEDZY.-\nPozdrawiam.\n.** Nie tłumaczę tego ze względu na przekłamania które powstają w okularach.** \n.\nLink do; Installing OnionShare on Linux\n\nhttps://itsfoss.com/onionshare/\n.\nInstalowanie OnionShare w systemie Linux\n\nPowinieneś znaleźć OnionShare na liście w swoim centrum oprogramowania, aby go zainstalować. Jeśli go tam nie ma, możesz dodać PPA za pomocą poniższych poleceń w dystrybucjach opartych na Ubuntu:\n\nsudo add-apt-repository ppa: micahflee / ppa\nsudo apt update\nsudo apt install -y onionshare\n\nJeśli chcesz zainstalować go w innych dystrybucjach Linuksa, możesz odwiedzić oficjalną witrynę internetową, aby uzyskać instrukcje instalacji Fedory, a także instrukcje kompilacji. \n.",
				"added": 1598695257
			},
			{
				"comment_id": 110,
				"body": "> [claude](#comment_4_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1): sir, this is an english forum\n\nThis text cannot be translated into glasses.",
				"added": 1598714499
			},
			{
				"comment_id": 111,
				"body": "> [geekless](#comment_261_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): \n\nWell, he says he read the article and he saw commands for installing OnionShare under Ubuntu there. And Ubuntu is not Linux, blablabla etc.\nUbuntu was Linux until it was sold to Canonical. This one introduced its changes. And from that moment on, it is Linux, Open Source. It has the pieces locked up and no one has access to it. Just like in windows.\n.\nUbuntu był Linuxem, dopóki nie został sprzedany firmie Canonical. Ta wprowadziła swoje zmiany. I od tego momentu to niej już Linux, Open Source. Ma kawałki zamknięte i nikt niema do tego dostępu. Tak jak w windowsie.",
				"added": 1598734388
			},
			{
				"comment_id": 112,
				"body": "> [geekless](#comment_262_1GooUE19488nDwG3TdkM8seYAHct4gjkq4):      \n\nDude, just build it from the sources under any Linux distribution you wish. Are you a Linux user independent from corporations, or just yet another snowflake blaming all over the world for your own problems?\n\nI just explain to the unaware that white is not white. It used to be linux and now it isn't, it's just a different version of windows.\n.\nWyjaśniam tylko nieuświadomionym, że białe nie jest białe. Kiedyś to był linux, a teraz już nie jest,  jest to tylko  inna wersja windowsa.",
				"added": 1598734616
			},
			{
				"comment_id": 113,
				"body": ".They're about to vaccinate people against Covid-19. And I say no such a freak. There is no such vaccine.\n.\nZaraz będą szczepić ludzi na Cowid-19. A ja mówię niema takiego świrusa. Niema takiej szczepionki.",
				"added": 1598734794
			}
		],
		"1598683262_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 173,
				"body": "It, could really be possible.",
				"added": 1605994210
			}
		],
		"1598912261_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": [],
		"1599847995_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": [],
		"1600095815_16j1WtLKAKpemCzA2suD1aaWfie2854o5T": [],
		"1600586345_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [],
		"1600774973_1Jxw16HD6aiTyRHnpwE7tupnLn8SCsKaEA": [],
		"1601486791_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": [],
		"1601562719_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": [],
		"1601719510_1DjoJoSQPYTUcaJck51X5rDxXtEBYmtUtR": [],
		"1602257402_1abBjBW8axFAtcZN11jv527Wi2noBZurv": [],
		"1603127653_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [],
		"1603135108_1EbPbm1iWibJ41UUk5ENKNHrW7pVH9ui81": [],
		"1603338108_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 158,
				"body": "I have the impression that there are problems with spying on ZeroN. That's why you want to connect, necessarily with googles. That it would be convenient for them to spy on people. Zero should stay apart and never connect with that pesky shit.",
				"added": 1603365705
			}
		],
		"1603655918_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": [
			{
				"comment_id": 167,
				"body": "Tap on these empty pots, how and what do you want to explore? Read what the virus looks like, each one. This is fake panic.",
				"added": 1604924606
			}
		],
		"1603893360_1Avzdjh9nPaxNw5XoJwQz3veJEYSxu1wfd": [],
		"1604659936_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 165,
				"body": "These are not vaccines.\nThis is an injection that has the \"DNA\" alternator hidden in it.\nThere is a change in human DNA.\nA human-like mutant arises.\nThat is the purpose of these vaccines.",
				"added": 1604673261
			},
			{
				"comment_id": 166,
				"body": "@dv1-\nThat I know what it is?\nIt doesn't change the chemical makeup of this compound.\nI'm using a name that the rest of society understands.\nFor them, these are just vaccines.\nAnd for me it's a \"DNA\" changer.",
				"added": 1604679596
			},
			{
				"comment_id": 172,
				"body": "The internet is full of references to this;Change - DNA, RNA.\nI don't drink municipal water from the tap, I have my own private water supply.\nGreenhouse gas is really, a lot of it is released by the Cow.\nIn this \"WHAT\" I'm saying; Nobody should believe me.\nFaith is good for the Vatican./ church /.He benefits from it. Everyone has brains, and should check for themselves. The internet is like an iceberg. You have to search deep. Where the Titanic lies.\nText is Translated;Sorry for the wrong translation.\nSabotage",
				"added": 1605840649
			},
			{
				"comment_id": 195,
				"body": "So far it has been a bluff. Now expect a serious attack. But seriously.\nJust don't panic? Be aware of the danger now.\nIt is not a vaccine; It's an injection, Dr. Mengele.\n.\nDo tej pory to był blef. Teraz należy się spodziewać poważnego ataku. Tak na poważnie.\nTylko nie robić paniki? Należy mieć teraz świadomość zagrożenia.\nTo nie jest szczepionka; To zastrzyk, dr.Mengele.",
				"added": 1610034857
			}
		],
		"1605027510_15BPbETpjWmZoVdS4YGMg4qWiguXi1ASGz": [],
		"1605282602_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 169,
				"body": "Only a living being feels emotions. Man, horse, dog.\nIt is only a machine to eliminate a human being.",
				"added": 1605292049
			},
			{
				"comment_id": 170,
				"body": "> [styromaniac](#comment_2689_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): https://www.youtube.com/watch?v=uuPjH0XmJYA\n\nSad picture; the abacus took control of the man. This is the goal of world domination. Remove humanity forever. Dumbest experiment the world has ever seen.\nThe last one turns off the light.",
				"added": 1605301289
			},
			{
				"comment_id": 171,
				"body": "Yes it's true.",
				"added": 1605361780
			}
		],
		"1606080511_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": [
			{
				"comment_id": 174,
				"body": "I propose to read a bit of The History of the World , and draw conclusions from it for the future.\nAnd only then talk about conspiracy theories. These are not theories but irrefutable facts. One must learn to distinguish between TRUTH and falsehood.",
				"added": 1606090274
			},
			{
				"comment_id": 177,
				"body": "> [x6](#comment_1_13s66u5mb68pEzEmnMRaQD1JWgisf5qsdN): The clearnet is not sending their best.\n\nBecause it's 100% - controlled.",
				"added": 1607260387
			}
		],
		"1607222817_14H5KfL4SR2RkpxjdQAvqzKBTaA1q4dKf3": [
			{
				"comment_id": 175,
				"body": "This is exactly what it looks like and this is the intended purpose. Limiting and controlling the human population under the guise of a vaccine. This is not a vaccine, but an injection containing a secret ingredient. Under the guise of medical assistance, people get this secret ingredient. Human trust in this injection plays a huge role here. This injection is an order depopulation of those who print money. It's not too late?",
				"added": 1607236206
			},
			{
				"comment_id": 176,
				"body": "> [lethotter](#comment_2_12TkoeBiJMGSPoetH8DhErZExjPvVE4x8B): Any proofs?\n\nRead on Polish pages.",
				"added": 1607260253
			},
			{
				"comment_id": 178,
				"body": "> [edgelordofdecent](#comment_712_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Maybe the vaccine give you ED.\nThis phenomenon must also be taken into account.",
				"added": 1607323761
			},
			{
				"comment_id": 179,
				"body": "Look at it differently\nthey will be able to fully control us.",
				"added": 1607387377
			},
			{
				"comment_id": 180,
				"body": "The nano chip is mounted in the spine between the vertebrae. Why? In order not to be able to remove it.\nYou need a special operating room and a high-class specialist.\nDismantling is very risky / paralysis /.",
				"added": 1607412086
			},
			{
				"comment_id": 181,
				"body": "You don't necessarily know you got it done. Needed, a neurosurgeon, a special syringe. One minute of time. Local anesthesia, under some pretext.",
				"added": 1607454537
			}
		],
		"1607592294_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": [
			{
				"comment_id": 182,
				"body": "Finally someone who thinks normally.\nEverything is 100% under control.",
				"added": 1607613278
			}
		],
		"1607947918_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 183,
				"body": "It's always a good time to promote and you should do it. \nEveryone expects a miracle that someone will do it for them?\nWe ourselves can work miracles.",
				"added": 1607953166
			},
			{
				"comment_id": 184,
				"body": "> [notanonymous](#comment_2_19rSc8YfLc5CKq528uKnDuerT2PZoKiegm): Is the russian government involved?\n\nUsmański nierząd jest zaangażowany.         Błąd tłumaczenia\nTranslate for yourself.\nTRANSLATION BLASTS.",
				"added": 1607953469
			}
		],
		"1608026414_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 185,
				"body": "Very interesting material",
				"added": 1608026823
			}
		],
		"1608065397_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 186,
				"body": "It is important that it is simple.",
				"added": 1608065290
			}
		],
		"1608462575_14Y5YpotfVjQyQfdrW3PFuYDQTfpPAZ4GK": [
			{
				"comment_id": 187,
				"body": "Create your website it helps.\n Because page control belongs to you only.\nSomeone else's side, someone else's control.",
				"added": 1608464950
			}
		],
		"1608830447_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 188,
				"body": "Underwear is demonstrated for someone?",
				"added": 1608834696
			}
		],
		"1608908993_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": [
			{
				"comment_id": 189,
				"body": "I support it.",
				"added": 1608911009
			}
		],
		"1609290557_19AuD3C3VusewLWehweVi29XupaG5TkPVC": [
			{
				"comment_id": 190,
				"body": "*Brazil won't do anything to stop them. Only the FBI, CIA and NSA can stop them.*\nIt's them who installed this shit.",
				"added": 1609328650
			}
		],
		"1609405437_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 191,
				"body": "It's only up to you, what will you do?\nI guess no one has changed anything.\nThere are no visitors here anyway.",
				"added": 1609416343
			}
		],
		"1609591456_17TN8kxJAPv9mDPeEbuwhBpQyiAF8zgBv7": [
			{
				"comment_id": 192,
				"body": "What group are you thinking about? \"\nDo not ask? just join.",
				"added": 1609594671
			}
		],
		"1609975971_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 193,
				"body": "Server = content control. The server can always be destroyed or disabled",
				"added": 1610000468
			},
			{
				"comment_id": 194,
				"body": "Today YouTube is Censored.\nTomorrow the server will be censored.\nThe day after tomorrow, everything will be Censored.\nThe future is an independent Internet.",
				"added": 1610023717
			}
		],
		"1610042649_139mS7MVsytiqfvLcqkb4S1VKqDMhCXs8n": [
			{
				"comment_id": 196,
				"body": "It is displayed fine.\nThe translation is only bad.\nBut who else is to blame.",
				"added": 1610047246
			}
		],
		"1610152196_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [],
		"1610272179_1BAG93hXwWmaDRyjYCGP8QLpwZ6YXVSvo4": [
			{
				"comment_id": 198,
				"body": "This is just an unsinkable aircraft carrier, censorship can't do anything to you.",
				"added": 1610274281
			}
		],
		"1610420274_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [],
		"1610501785_12BSeHrHaz9gyid4AFkYdFYRcmFsSQkGAN": [],
		"1610506203_12BSeHrHaz9gyid4AFkYdFYRcmFsSQkGAN": [
			{
				"comment_id": 202,
				"body": "what language? additional or main.",
				"added": 1610506617
			},
			{
				"comment_id": 203,
				"body": "I SUPPORT - SUPPORT - and FREEDOM OF EXPRESSION.",
				"added": 1610512298
			},
			{
				"comment_id": 204,
				"body": "I propose to split this article into two separate parts.\nTechnical first; And I would like to refer to it.\nVery nicely written; I have translated and I intend to publish it further. You're not going to have a job for that, are you?",
				"added": 1610587312
			}
		],
		"1610666851_1DWYNPAmxeKc5Brcs1Yi6oyjndj53kPeLP": [
			{
				"comment_id": 205,
				"body": "simple reliable method of learning a foreign language.\nYou take the newspaper, and you read it aloud.\nYou take the movie, turn on the subtitles, and read it aloud.\nAfter a month, you will understand half the movie and after two you will understand almost the entire movie. These are supposed to be normal movies, from everyday life.\nHow will you start to understand? Then you can try to learn to write.\nIt works 100%.\nAs for the Russian language, first you have to learn the letters, then read them.",
				"added": 1610668545
			},
			{
				"comment_id": 206,
				"body": "This is the best option. But before you go?\nIt is good to read and understand a little;\nDon't forget there are other letters there.",
				"added": 1610670523
			}
		],
		"1610682330_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 207,
				"body": "Giant disk? The only question is, What for?\nA desktop computer with ZeroNet is more important.\nTelephone; Do you know what he is doing, this phone?",
				"added": 1610693487
			},
			{
				"comment_id": 208,
				"body": "Sure thing.\nYes it can be done.",
				"added": 1610739117
			}
		],
		"1610754180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [],
		"1610874256_1f14ZYyzStz4VrDw3o8Ta6x89t27CXsNN": [
			{
				"comment_id": 212,
				"body": "EVERY BROWSER SPEEDS-\nOnly eliminating the browser will fix this Problem.",
				"added": 1610880248
			}
		],
		"1611236743_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": [
			{
				"comment_id": 213,
				"body": "What's your version of zeronet? number?",
				"added": 1611242183
			},
			{
				"comment_id": 214,
				"body": "> [mfs](#comment_98_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W): Worked for me.\nWhat's your version of zeronet? number?",
				"added": 1611242729
			},
			{
				"comment_id": 215,
				"body": "It works NEXT on the old version.\n0.6.5. (rev3870).",
				"added": 1611250038
			}
		],
		"1611430566_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": [
			{
				"comment_id": 216,
				"body": "Do you know who Navalny is? And what did he do ???\nWho is it for? Who is financing it?",
				"added": 1611452465
			},
			{
				"comment_id": 217,
				"body": "ok. I know that; was it just a rhetorical question?",
				"added": 1611457829
			}
		],
		"1611481827_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 218,
				"body": "Start using Linux first.",
				"added": 1611486026
			},
			{
				"comment_id": 219,
				"body": "Ubuntu hasn't been Linux for a long time. It's a dyed Fox. It only pretends to be Linux.",
				"added": 1611492052
			}
		],
		"1608655431_14EvrR9QiEpqhQyZDFiftdgAXzNQ1x8XH1": [],
		"1612091787_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": []
	},
	"comment_vote": {}
}