{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "EL PODER ES LA RAZÓN",
			"body": "Ragnar Redbeard ha sido un personaje enigmático desde la publicación del controversial libro El Poder es la Razón en el año 1896. Supo cómo encubrir cada pista y ocultar extraordinariamente su verdadera identidad. Este libro, durante muchos años ha sido señalado como infame y considerado como “uno de los trabajos más incendiarios jamás publicados”, lo que le ha llevado a ser censurado y prohibido en todas las bibliotecas penitenciarias en EUA, en varios países que se hacen llamar democráticos y muchos otros en la Unión Europea. Sin embargo, esto no ha impedido que haya vendido más de 150.000 copias desde su primera publicación o que se haya traducido en 4 idiomas.\n\nEl hecho de que Redbeard tuviera una mala interpretación de los estudios realizados por Charles Darwin, proponiendo así un darwinismo social extremo, no fue un obstáculo para que poderosos hombres de los siglos XIX y XX como: Theodore Roosevelt, Otto Von Bismarck, Paul Kruger, Cecil Rhodes, Neville Chamberlain, Elihu Root, Kaiser Wilhelm II, Abdul Hamid II, Herbert Kitchener y Von Phleve, influyeran en las decisiones públicas y políticas de todo el mundo. Igualmente, esta obra fue la fuente de inspiración para el taumaturgo Anton Szandor LaVey, quien basó gran parte de la Biblia Satánica en la obra de Ragnar Redbeard.\n\nEn una anotación realizada sobre El Poder es la Razón, en el año 1905, se proclamaba que este libro no estaba hecho para “personas con inmadurez mental”. Las personas que viven en una caja de arena para gatos políticamente correcta no deberían leerlo. La infamia de este libro no hará que su mente quede prisionera, por el contrario, todo lo que creían conocer como correcto, quedará hecho cenizas. Es probable que el lector tambalee, mueva la cabeza de un lado a otro, se deje confundir o se ría como loco —incluso con angustia— entre una página y otra. Es un llamado al instinto natural del hombre por la supervivencia, la lucha y el poder de la vida sobre la muerte.\n\n“Diecinueve siglos de evangelización con una Biblia hebrea como manual de instrucciones ¿en qué han resultado? En la dominación política, social, financiera y filosófica de —el hebreo. Estudiamos sus crónicas falsificadas, su literatura melancólica y sus efusiones proféticas como si no hubiera más opción —entre un nauseabundo montón de basura y hedor, podría encontrarse la Summum Bonum”.\n\nLos principios morales han sido asumidos como una apología inalterablemente ortodoxa y dudar de la divinidad de estos principios, es visto como una sacrílega traición. No carece de sentido entonces, que el ciudadano promedio tema poner en riesgo su poca fortuna, honor y vida intentando destruir los conceptos populares de lo que cree es “correcto o incorrecto”, aun sabiendo que son un fraude eternizado. Es un esclavo nacido para serlo, habituado como un perro desde su infancia para realizar trucos y toda suerte de gracias por solicitud de sus amos. Ragnar tiene la habilidad de liberar las mentes esclavizadas, el ciudadano promedio se verá desafiado a reevaluar las suposiciones y condicionamientos a los que se ha visto sometido toda su existencia. —¿Sobre qué punto de vista no deberían ser replanteados? \n\nEn el libro “El Gen Egoísta”, Richard Dawkins afirma que el único propósito del organismo humano es ser portador de ADN: es por medio del organismo que este código puede replicarse y sobrevivir. No obstante, Dawkins hace la aclaración que, de todos los organismos portadores de ADN, el humano es el único que puede razonar. Ragnar Redbeard pasa por alto el hecho que el razonamiento hace parte de nuestro condicionamiento natural, por ello se da la libertad de formular un violento darwinismo social.\n\nSi usted es de las personas que se ofenden con facilidad, teme expresar públicamente las cosas que piensa en la profunda oscuridad de su mente, disfruta vivir en estado de subjetividad, de ser dominado y sometido a las presiones externas que han sido diseñadas para forzarlo a cumplir estrictamente con las visiones preestablecidas de su deber moral, político y religioso, sin tener un momento de libertad mental, entonces, este libro no es para usted. Esta es una de esas obras que una vez han sido leídas, jamás se olvidan. Si es usted una de esas personas, no querrá leer El Poder es la Razón. Si su mente es curiosa y libertina, debe leerlo y encontrará que es un libro extraordinario, sin comparación y escandaloso. Verá que ha conocido la verdad que muchos temen conocer. Léalo y tome su propia decisión.\n\nhttps://goo.gl/L6TuZP",
			"added": 1520647514
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}