{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1616908733,
			"title": "«Сигнал для оппозиции»: почему задержали 200 участников форума депутатов",
			"body": "Столичная полиция задержала около 200 человек на форуме муниципальных депутатов. Решения о задержаниях принимали не городские власти, действия силовиков курировали в ФСБ, утверждают источники РБК в мэрии Москвы\n\nВ субботу, 13 марта, в московской гостинице «Измайлово» были задержаны около 200 участников проходившего там форума организации «Объединенные демократы».\n\n«Группа граждан — представителей общественной организации — предприняла попытку проведения публичного мероприятия с нарушением установленных санитарно-эпидемиологических требований, которые действуют в столице из-за распространения коронавируса COVID-19. Кроме этого, среди участников выявлены члены организации, деятельность которой признана нежелательной на территории Российской Федерации», — объяснили массовые задержания в МВД.\n\nРешение «разогнать форум» принимали не столичные власти, утверждает собеседник РБК, близкий к мэрии. По его словам, задержания курировала ФСБ России. Второй собеседник РБК в мэрии также утверждает, что «у Москвы ответственность за это забрали федеральные власти», и называет события «устрашающей акцией перед думской кампанией» (выборы в Госдуму пройдут в сентябре).\n\n«Объединенные демократы» — совместный проект политика Дмитрия Гудкова и председателя «Открытой России» (зарегистрированную в Великобритании одноименную организацию Генпрокуратура в 2017 году признала нежелательной) Анастасии Бураковой, декларирующих своей целью помощь независимым кандидатам на выборах.\n\nСреди задержанных оказались депутат Мосгордумы Михаил Тимонов, московские муниципальные депутаты Илья Яшин, Илья Свиридов и Юлия Галямина, депутат заксобрания Санкт-Петербурга Максим Резник, политики Владимир Кара-Мурза и Евгений Ройзман, исполнительный директор «Открытой России» Андрей Пивоваров, а также несколько журналистов — Анастасия Мельникова из Znak.com (после проверки документов ее отпустили), Никита Ступин из Avtozak Live и Эмиль Юнусов из Sota Vision.\n\nК 21:00, после составления протоколов, большинство задержанных отпустили, сообщил «ОВД-Инфо».\n\nКак думаете, это попытка власти всех запугать и закрутить гайки или власть хочет сагрить на себя максимальное количество людей?",
			"added": 1616908732
		},
		{
			"topic_id": 1616908801,
			"title": "Замедление твитеера роскомнадзором.",
			"body": "ИТТ обсуждаем попытку РКН замедить твиттер, как бороться с подобным, а так же подискутируем на тему: удастся ли РКН построить в РФ чебурнет.",
			"added": 1616908799
		},
		{
			"topic_id": 1630126633,
			"title": "Блог анонима с аноимным форумом",
			"body": "Блог анона с анонимным форумом 6zel4fxak4o5ghtb46tpzcxuwrvpimyhfu7kkgy5rjpbnu643oac6kad.onion",
			"added": 1630126630
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1616908801_13RFu1n9Bc3vCg8vWLtYhWux6WEoXvayxA": [
			{
				"comment_id": 1,
				"body": "> [zombibi](#comment_110_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): пида-сы из твиттера залочили мне аккаунт, причем я вообще ни слова не написал, только читал. письма в службу поддержки - ни ответа ни привета... никаких обяснений в т.ч. вразумительных... аккаунт жалко;) привык, давно он у меня был:)\n\nНу то, что подобные соцсети могут баны раздавать налево и направо я в курсе, просто дело в том, что РКН в теории может ополчиться на другие сервисы и скрытосети.",
				"added": 1617045961
			},
			{
				"comment_id": 2,
				"body": "> [xandanyesm](#comment_59_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY): удастся ли РКН построить в РФ чебурнет - без сомнений... немного кривое и косое и работает кое как, но уже сейчас все готово для этого - только ждут команды от карлика\n\nНу не факт. Хотели торренты (сам протокол, если не ошибаюсь) заблочить-не вышло. Заблочили телеграм - пользователи быстро научились обходить блокировки, тор в РФ без мостов работает.",
				"added": 1617543084
			}
		],
		"1584283661_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 3,
				"body": "test",
				"added": 1621843857
			},
			{
				"comment_id": 4,
				"body": "test",
				"added": 1621843927
			}
		],
		"1618776252_1A2mT6p9jADSauRTg5g3Xn1vua4xcuwn2r": [
			{
				"comment_id": 5,
				"body": "> [dgfhjfgj](#comment_1_1LxdeYQsmjMU2yneikH61uP7pAdpw8vTPr): А зачем собственно это нужно?\n\nУдваиваю вопрос.",
				"added": 1621844093
			}
		]
	},
	"comment_vote": {
		"2_14MeN6afdY8nQxnW2CzM61mVjtrSind1uY": 1,
		"5_1P72q2Lvd9BiogLZFScvQ1sU38fSY6GMsf": 1
	}
}