{
	"title": "Incivist",
	"description": "Truth is bitter",
	"links": "",
	"next_post_id": 7,
	"demo": false,
	"modified": 1442331272,
	"post": [
		{
			"post_id": 6,
			"title": "The problem is not race, it is culture",
			"date_published": 1442330471.192,
			"body": "When a baby is born, apart from any genetic inclinations and prenatal conditioning, it is pretty much a blank slate. Until it is steeped in a culture.\n\nLet me tell you about bacteria. When taking a bacterial swab, you put it on a medium. The media is the food the various bacteria consume that will make them thrive or die off. Use one type of media and you get one type of culture. Use another type of media and you get another culture.\n\nThe media we consume determines our culture which determines our behaviour.\n\nComparing myself with someone from a muslim culture for example:\n\nIn my culture, we eat pork. \n\nThat is not acceptable in your culture\n\nIn your culture, you treat women like subhumans, blow up and behead anyone disagreeing with you, wipe your ass with your hands, have a tone deaf guy shouting at the top of his lungs five times a day to call you together to do your OCD rituals to a violent demon god.\n\nThat is not acceptable in my culture.\n\nSo you see, we may have some problems cohabiting. Doesn't mean you are an evil human. No I pity you to have the misfortune to be born in such a toxic medium. \n\nBut don't pull any of that shit here or we will cut you up!\n"
		},
		{
			"post_id": 5,
			"title": "On Japanese customs",
			"date_published": 1442246979.128,
			"body": "According to Japanese custom, a girl above 25 is considered unmarriable.\n\nWomen hit a peak in beauty at about 23, so for a man to get anything for his trouble, she should be much younger than that. \n\nAfter 25 he will just keep her around from old habit.\n\nThe Japanese know what they are talking about."
		},
		{
			"post_id": 1,
			"title": "I like Zeronet",
			"date_published": 1433033779.604,
			"body": "But what's with the invisible edit buttons? Seriously?\n\nTesting Markdown\n==========\n\n* list\n* item\n\n**bolded**\n\n"
		}
	]
}