{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1566731066,
			"title": "ZeroNet update broke things for me too",
			"body": "I grabbed a fresh copy of py3 ZeroNet, set it up, then copied my data folder into it. It seems smoother but some zites don't work any more.\n\nhttp://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/ ZeroUp gives me a popup: Internal error: AttributeError: 'SiteStorage' object has no attribute 'piecefields'\nUiWebsocket.py line 85 > UiWebsocket.py line 232 > OptionalManager/UiWebsocketPlugin.py line 168 > OptionalManager/UiWebsocketPlugin.py line 66\n\nhttp://127.0.0.1:43110/17gCoQDCAAoQkzKRiajFNUAhnVD2gSNmuC/ Millchan Engine is a blank page\n\nhttp://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/ Millchan is empty except an 'if this message doesn't go away try updating ZeroNet\" message\n\nDid I break it or did it break it?",
			"added": 1566731065
		},
		{
			"topic_id": 1566746537,
			"title": "What do I do about the ZeroTalk space limit?",
			"body": "I'm not convinced that nofish is real but it says to beg for an increase. Other than that am I supposed to hunt and prune old posts?",
			"added": 1566746535
		}
	],
	"topic_vote": {
		"1543859802_1FCUfGpjdJr6wcorndFhdKhYJ5EPaXSk7u": 1,
		"1543928148_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ": 1,
		"1544106168_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1545029431_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": 1,
		"1545062532_1P4mZFiz4eZW5wdk8ZB4Gu7NUt1FxjBKi9": 1,
		"1565639606_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": 1,
		"1565639543_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": 1,
		"1565639249_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": 1,
		"1565639106_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": 1,
		"1565638982_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": 1,
		"1565638691_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": 1,
		"1565638539_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": 1,
		"1565601077_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": 1,
		"1565601152_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": 1,
		"1565584272_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": 1,
		"1565163816_1JwnMobAn82kxrY5FXnjwMBFbLyziYijwa": 1,
		"1565214030_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1565669207_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": 1,
		"1565699355_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1565777740_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": 1,
		"1565795636_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"1565855060_1CN9rdrWkKbk8EmDSQNZZrwGmd8TvVbgjM": 1,
		"1565908709_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"1565968613_16GG19wZtGAcebcKhf2hEmcf1sETig7DLA": 1,
		"1565995598_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": 1,
		"1566018895_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": 1,
		"1566019704_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": 1,
		"1566184630_13ifSHXbs2RtyHF4qkn4GrJ3krWEAAGmka": 1,
		"1566216762_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": 1,
		"1566209947_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1566240845_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1566357785_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV": 1,
		"1566375802_1C7X6AtuFz4ARoxZAj1XaEjPprGoz6o2Vn": 1,
		"1566387013_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": 1,
		"1566397383_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1565230737_1HvtaEP4h88QTu4Pv1a7SDuq1H6v7TDgsN": 1,
		"1566434182_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1566447039_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": 1,
		"1566468563_1LPwiAHM9fBUSUR5iQNVizdVMniKhC11ju": 1,
		"1566512268_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": 1,
		"1566581844_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1566570350_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": 1,
		"1566481333_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1566671185_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": 1,
		"1566679861_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1566748537_1PNw9xLFQkRXSTMDbLxFvNvve9sjAVhL3q": 1,
		"1566746537_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"1566920820_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1567159417_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1567430384_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": 1
	},
	"next_comment_id": 90,
	"comment": {
		"1543928148_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ": [
			{
				"comment_id": 1,
				"body": "Lovely. I'm sure they'll implement it with a flawless, infallible automated system like YouTube has :) :)\n\nWe really ought to be moving things over to distributing networks like ZeroNet and Freenet, where one careless flick of a corporate wrist won't as easily demolish large amounts of content unrelated to the suggested intent. Heavy centralization makes it easy for the likes of Apple to push us all around even if we have nothing to do with them ourselves. Who can bully networks like ZeroNet? Their design intentionally precludes this. In addition, the burden of content distribution being shared enables the existence of sites made by people who otherwise can't reliably host them.\n\nNot that porn in general is the most important thing around. I just think banning an otherwise acceptable category of content out of plain laziness(??) is ridiculous and we can easily get ahead of these corporate games by moving to systems less easily disrupted: let's all share where they can't stop us.\n\n...Oh, and Tumblr of all things banning porn? Do they have anything else there? Did Tumblr just ban Tumblr from Tumblr? Maybe that was a bad idea.",
				"added": 1544108370
			},
			{
				"comment_id": 3,
				"body": "> [xianc78](#comment_28_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ): Yes, but I don't think most Tumblr users would be tech-savvy enough to use them and I bet once they realize that ZeroNet is uncensored, they will call us an \"alt-right platform\" or something like that.\n\nI like to think it wouldn't be excessively difficult for people to figure out how to download and run (the daemon for) the friendliest dark/alt/whatever net around and navigate to a known URL. I hope not, anyway. I don't really know Tumblr but \"run this and paste 127.0.0.1:43110/ZeroTumbl.bit into your browser\" seems easy enough to me.\n\nSecondly, it will have to be understood that ZeroNet is a network, not a platform. There are platforms for alt-right content on the clearnet so there presumably are platforms for alt-right content here as well. The point is for people to create platforms serving their communities that coexist on the network with platforms serving others just the same as on the clearnet but without being fully at some company's mercy, not to mention typically being mined for profit as well.\n\nI guess my point is that I see moving to these sorts of networks as a necessity. There will be some growing pains but those are necessary for the networks in general as well as for any particular one playing host to a freshly displaced community. People need communities and we simply can't depend on corporations to host them, especially outside of the most banal mainstream sorts of content. Something's got to give!\n\nBesides, I'm sure the freeze peach and alt-right types will be welcoming enough to those with disparate opinions who just need a place to stay :) :)\nWorst case, different groups could technically form new networks. AltRightNet, LeftNet, JustABunchOfPornNet (the big one, naturally), whatever. I don't know if anyone would consider that optimal but I consider even that an improvement over erasing communities dozens or hundreds at a time just because some company finds they're no longer convenient to have around. If nothing else it may keep those communities alive until a more suitable solution is found.",
				"added": 1544474949
			}
		],
		"1544323909_18XCUzg18zdzeVbSNrvqRQ9cLn8Uqvmh47": [
			{
				"comment_id": 2,
				"body": "General suggestion not specific to this post:\n\nWhere possible content referenced here should be hosted or mirrored somewhere within ZeroNet.This helps keep content alive even if something happens to its clearnet hosting and may confer some protection against tracking.\n\nNote that tracking can still be done but it may require additional effort to track through ZeroNet as opposed to directly telling Google or anyone else what people are looking at.\n\nThe same goes for any other network of the sort.",
				"added": 1544356990
			}
		],
		"1544703954_1GHXQ3vMtadfHFjTwS3roqYe8LUsyDqN8f": [
			{
				"comment_id": 4,
				"body": "Just rambling/listing a few things off the top of my head. ZeroNet has/is/does:\n-No filter (JavaScript everywhere running coin miners or what have you, no warnings about downloading potentially malicious files)\n-People (this thread has seen about as much content in minutes as Freenet seems to see daily :P)\n-Quite possibly doesn't give a useful damn about your security or anonymity (partly the filter thing, partly that it doesn't seem to* reeeeally want to use Tor 100% unless(?) you're extra careful, etc.) *There's a setting for using Tor for peer connections and then another sneaking around down below for proxying tracker connections through it. Is this in addition? Does \"Tor always\" actually mean that or must both be set? Dunno. I say \"Don't trust ZeroNet unless you really know what you're doing.\" I don't think most people around here do.\n-Very much more user-friendly (ZeroHello is like \"Hi, come play with ZeroNet :)\" versus Freenet's list of years-old... stuff, as an example. Also allowing JavaScript enables some more comfortable/typical interaction with zites and there are working analogues to familiar clearnet sites)\n-Less... crusty old (Freenet and the software it's built on are aging and not at all like wine)\n-Doing things at all is much more practical (ZeroNet's Twitter thing (or whatever ZeroMe is) is two clicks from posting while Freenet's Sone requires working out how to install and set up two plugins and then waiting for potentially days or weeks to discover any of the arguably 'active' users on it. Accessing the network's forum involves downloading and running a separate piece of software and accessing that using its own server.)\n-Actually works more (remember that bit about plugins? Sone isn't installed by default because of... problems. I don't remember what the story with FMS (forum) is.)\n-It seems much faster, possibly due to having a (probably) larger user base.\n\nFreenet seems to have fewer people with their heads lodged up their backsides, though. Of course, as far as I can tell there are only about five people communicating on it at all so maybe that isn't saying so much :D\nAnother thread with some relevant bits: http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1543348094_16VrCKQQiVZpJ6S5xJASR8LCFLv24M5bfn/I+discovered+Zeronet+a+few+years+ago+but+immediately+abandoned+it+due+to+the+massive+neglect+of+user+security+Have+things+changed\n\nFreenet does distribute files across the network. https://freenetproject.org/pages/documentation.html#content There's no need to stay online once your content is on other peers who are. As for changing freesites, they're let's say 'strongly recommended' to be quite small and mostly text-based. One could claim that the purposes of zites and freesites are actually quite different.",
				"added": 1544706311
			}
		],
		"1544866769_1FCUfGpjdJr6wcorndFhdKhYJ5EPaXSk7u": [
			{
				"comment_id": 5,
				"body": "Seems there are as many explanations of what the yellow vest thing is about as there are yellow vests. Mostly based on imaginary bullshit and lies.",
				"added": 1544877851
			}
		],
		"1544911802_14cqdxte9VRXGe4WYEY49Htx1HxUqKNGrP": [
			{
				"comment_id": 6,
				"body": "Attitudes about porn on darknets are funny. Pervs and prudes side by side :) That or \"pr0n\" is code for CP and a lot of people didn't get the memo.",
				"added": 1544915595
			},
			{
				"comment_id": 7,
				"body": "Oh, it's more of that ridiculous ranting. Great.",
				"added": 1544919054
			}
		],
		"1544937960_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 8,
				"body": "Improving ease of getting to content and how much content is worth seeing are priorities. Sure, add lots of \"IP\" people want to see. Give people reasons to be here and while they're here they will probably at least have some things to say. Some guidance with regard to which sites for any specific use are any good (and still working) would also be useful. One example: we have KopyKate (two of them), YouTube (the ZeroNet one), IFS, and probably another dozen or so similar zites. Why? Tell that to every new user. Actually, tell that to me too. Why do we have so many sites all doing the same thing for every 'thing' there is to do? Which ones work and are popular enough to work well? Which ones have content I want? Anyone joining ZeroNet right now has to work their way through a mess of half-populated redundant zites, missing but listed content, and countless indices with little or no indication of zite quality or freshness. Ouch.\n\nA very important issue letting people know this thing exists at all. Tell people about it and why they want to be here on a larger scale than whispers and posts where only people who already know will see them. Throw lots of people at the problem and it will probably get better, right? Then we bring back the ones who left because it's a mess and everything is good.\n\nActually this seems to all apply to othernets in general. It's all very messy and ad-hoc, which is partly useful but makes it difficult to really expect people to join up unless they specifically enjoy digging around in mostly very old material looking for anything interesting. There's a lot of information but it's mostly wrong, old, confusing, or just spread all over the place and hard to find, collect, and comprehend.\n\nTL;DR: Spread the word much more generally and deal with the messiness.",
				"added": 1544974216
			},
			{
				"comment_id": 9,
				"body": "> [blurhy](#comment_209_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): no,it's easy\n\nThis is most of the reason for ZeroNet. Once something is on the network it's shared by everyone who wants it. You don't need 10Mbps upload speed if you've got 10 people sharing 1 each.",
				"added": 1544985569
			}
		],
		"1545029431_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": [
			{
				"comment_id": 10,
				"body": "> [anonimoose](#comment_27_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ): Zeronet is open source and there are a lot of active developers I would assume security bug would be found and fix on github.\n\nYou would be wrong. Someone imprisoned because of this assumption might recognize that carelessly making it was a very bad idea.",
				"added": 1545057314
			}
		],
		"1545219056_15TaxrtxopVTWbYVgp9fpeSv4thDgddB2Y": [
			{
				"comment_id": 11,
				"body": "http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1544937960_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK/Ways+to+popularize+zeronet\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1545106555_1NPaMdmTDg441cn76DGdUjz5ZXeVTPfWfx/How+to+maintain+ZN+s+long+term+vitality\nThese may have something of interest.",
				"added": 1545259046
			}
		],
		"1552916412_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 12,
				"body": "> [redlibertyreal](#comment_11_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw): Of course it uses IP to connect to the network, but inside the network router lease-sets (if memory serves me) are used (essentially just a pair of public keys) so you don't really know the IP of a person you are connecting to 2 hops out (average connection to an \"eepsite\" is 13 hops I believe), and 13 separate hops back. Their official website at https://geti2p.net/ has AMAZING documentation, I can read it for hours. I love I2P, I host my own hidden services with them, but I wouldn't say it's perfect. It doesn't have the same academic research, funding, and pen testing as the Tor project does to back up its claims (certainly not I2P's fault) so I wouldn't rely on it for STRONG anonymity. Theoretically it's better than Tor for darknets, but in practice who is to say? I2P though is by far my favorite \"darknet\". I steer clear of far too many things on ZeroNet because it is so decentralized, using pretty much only the main services (like ZeroTalk, ZeroMe, etc.). The pornography blacklist is a good start, but I don't think it goes far enough. I2P is decentralized, yes, but its services are centralized where they need to be, and every centralized service can be mirrored and replaced if you needed to go to the effort in a worst-case scenario. You have B32 addresses (the hostname, essentially super long public keys) and you can get a domain name free of charge to associate with the \"real\" address from people who distribute them (identiguy, meeh, zzz, etc.) Most of the domain name providers won't give you an address if you are doing bad things, and you yourself specify what DNS services your router will use. Bad people who reflect badly on the network and give it a bad rep are actively discouraged from participating. You can still do what you like, no one will stop you, but I2P is what I would consider an \"ethical darknet\", inspired by the same principles and ideas of the developers of other darknets. It's run by good people, the overwhelming majority of its users are good people. They are basically striving to avoid the mistakes made by the architectures by which information flows, to avoid the mistakes of Freenet, ZeroNet, and the culture of criminality that enveloped around Tor. It's unique in that regard. If you want to do bad stuff on I2P (other than piracy lol) I say \"fuck off\". But if you genuinely like the technology, are interested in the ideas and philosophy behind it, or want a safe place to host a decent anonymous website you'd feel comfortable showing your Grandma, I say to you, welcome!\n\nWell, that wall of mess has some issues...\n\nYou like to be protected from what people don't want you to see? Your choice, I guess, but can we call it what it is? You've started out from a position of letting other people decide what you should be interacting with. Even if the ones doing it now are trustworthy I find this idea very strange in the context of darknets. \nActually, does your/my grandmother want to see even all of what's on the clearnet? I guess you want more restrictions on darknet content than elsewhere.\n\nIt sounds like you want a whitelist to determine what's reachable or at least easy to get to? Who determines this? Who determines this after they're gone? And them? Is it really the case that the powers that be will never be trusted beyond their worthiness? \n\nWhen an eepsite goes offline, who can archive or mirror it? Sounds like dark magic to me.\n\nOkay, I've left this for ages and don't want to try reading that wall again so I'll stop here. I'm a fan of I2P, actually, and quite like its design. Just this post kinda creeps me out. What's the point in a darknet where somebody gets to tell you what you're allowed to see and say. Normally I don't give a damn about peach temperature but it seems to me deliberate control systems will push whatever politics they're put to. We should be building things to last and serve everyone, not to serve the interests of one or a few. You seem to think \"piracy lol\" is fine, but others disagree. Maybe they live by necessity (their nation outlaws their religion, maybe?) some \"criminality\" or \"bad stuff\" you don't but have good reason to. Oh well for them? Liberty enough for your grandmother, I guess.\n\nNeither other people nor (especially not!) the underlying technology should have anything to say about what's allowed or even equal on a darknet. Saying and sharing things others don't want us to is the entire point, isn't it? If not then why not use more active services like Facebook or such? More people, more content, more activity, and everything they dislike is bannable!",
				"added": 1553177782
			}
		],
		"1560623363_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 13,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_262_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"\"The freedom balance\" is my phrase that acknowledges the truism that, for everything a person gets, he has to give up something.\"Yes exactly.Freedom means Effort, everytime. All the time. [...]\n\nWhat?",
				"added": 1560878322
			}
		],
		"1560862969_1FqSXCYG7aTFqtAbtRi1qQ7ZEprgpdEd75": [
			{
				"comment_id": 14,
				"body": "It's mostly porn, \"porn,\" piracy, and a dumpster fire of brainless conspiracy bullshit and bigotry.\n\nThere are also scams! Do keep NoScript (and your brain) running.",
				"added": 1560878495
			}
		],
		"1565811747_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 15,
				"body": "So you're a Nazi and a creep. Thanks for telling us, I guess?",
				"added": 1565823427
			},
			{
				"comment_id": 16,
				"body": "> [wejehteman2](#comment_15_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P): Says the national socialists weren't socialist and accuses me of revisionism. You're a funny little man.\n\nYou're an idiot.",
				"added": 1565824596
			},
			{
				"comment_id": 18,
				"body": "> [kidcourageous](#comment_10_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): See? You're arguing over stupid shit because you are all mentally subnormal. I rest my case.\n\nK bye, galaxybrain shitheel who started it.",
				"added": 1565825657
			},
			{
				"comment_id": 22,
				"body": "> [dfgdsfgertyrety4](#comment_6_1FB7wEXbNVmiRnVw9JSCnibwrhYVK4uFaP): The real 'alt-right' are anarchists.  No government.  Only in the mind of an imbecile can you conflate a public ownership socialist with a private property capitalist.  National Socialist German Workers Party were as far left as you can get, short of Communism.  In fact, the Communists are historically and presently 10x as deadly as NAZI's ever were.  But they are both left wing.  The right wing wants the least amount of government possible aka the 'leave me the fuck alone' policy.\n\nAnother ignorant moron who knows nothing of politics or history. Or reality. ZeroNet is the best!",
				"added": 1565829346
			}
		],
		"1565820689_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 17,
				"body": "I thought ZeroNet was a darknet, not a sanitarium.",
				"added": 1565825557
			},
			{
				"comment_id": 21,
				"body": "> [styromaniac](#comment_990_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It's quite a bit cleaner than a darknet.\n\nA sanitarium or ZeroNet?",
				"added": 1565828524
			}
		],
		"1565806779_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": [
			{
				"comment_id": 19,
				"body": "The libs are censoring freeze peach with slight software glitches that only affect you!\n\nIdiots rise up!",
				"added": 1565825995
			}
		],
		"1565795636_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 20,
				"body": "Optional Tor makes ZeroNet arguably not a darknet (it still takes special software to get in but does nothing to protect the users) but that doesn't seem to be clear to everyone. Actually not many people seem to know a lot about ZeroNet at all.",
				"added": 1565826798
			}
		],
		"1565855060_1CN9rdrWkKbk8EmDSQNZZrwGmd8TvVbgjM": [
			{
				"comment_id": 23,
				"body": "GNUnet is crap for use only by god-tier GNUsers. There's way too much BS to deal with and the docs seem split between \"bring your friends and your webcam and have some fun chat :):)\" and \"now use tool#244 to get the WTFID of your ABC and set the WTF_ID of your XYX to the CRC32 of your ABC's WTFID using tool#9454, then if you didn't set up your XYZ (you didn't just set the WTF_ID of that instead of the XYX did you?) you need to start over with step #102: initializing the FML subsystem and creating a sub-host-identity-node-identifier-system-code\"\nMaybe it was #103. I don't remember.\n\nLokinet looks like a pile of \"Let's make bank off buzzwords.\"\nhttps://lokidocs.com/FAQ/#what-is-loki\nWhatever they're doing is too hip for me.\n(But I'm calling bullshit anyway)",
				"added": 1565856895
			},
			{
				"comment_id": 24,
				"body": "> [kaffie](#comment_1028_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Gnunet - Lol, doesn't even work. Just a theoretical. [...]\n\nDefinitely too vague. They know all the fancy words and have lots of pretty pictures but don't say anything clear about what Lokinet actually does. \n\nI just found https://lokidocs.com/Lokinet/LLARP/\nIt's hilarious.\nAre those pages really unpleasant to look at for anyone else?",
				"added": 1565857489
			}
		],
		"1565925178_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": [
			{
				"comment_id": 25,
				"body": "> [qspitzer](#comment_63_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX): Is there any music currently on it? I can't seem to find any\n\nA few songs work. I think this one has (some) more seeded:\nhttp://127.0.0.1:43110/ZeroLSTN.bit/?/\n\nI don't know how to add anything but there is Mixtape:\nhttp://127.0.0.1:43110/mixtape.bit/\n\nThere is also music on these though less convenient:\nhttp://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/ ZeroUp\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/ IFS",
				"added": 1565926757
			}
		],
		"1565995598_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": [
			{
				"comment_id": 26,
				"body": "> [anglosaxon](#comment_22_15eZANwRXZ5hbXJN4fAngLXrSwF7s1CJ4n): Tough call. Which POC is the bigger victim? Obviously not the capitalist. The capitalist is always the bad man and the thieving socialist is always the victim. Ghazali should have just claimed to be transgender to win the victim olympics championship and get off scott free.\n\nCould you shitters possibly be more worthless? I guess it's nice that you're wasting your lives bitching about everything rather than murdering people over cheap beer.",
				"added": 1565997101
			}
		],
		"1566468563_1LPwiAHM9fBUSUR5iQNVizdVMniKhC11ju": [
			{
				"comment_id": 27,
				"body": "The number what? You made that word up.",
				"added": 1566468885
			},
			{
				"comment_id": 28,
				"body": "Next you'll tell me we don't even have the number pwek.",
				"added": 1566468918
			},
			{
				"comment_id": 29,
				"body": "> [gitcenter](#comment_698_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): So how do computers work? IT'S ALL A LIE\n\n\"Bin\"ary?! It belongs in the bin! Fake! Don't listen to the fake twos!",
				"added": 1566471035
			},
			{
				"comment_id": 30,
				"body": "> [zhetik](#comment_1_1LPwiAHM9fBUSUR5iQNVizdVMniKhC11ju): SIX ONLY HAS ONE NON-TRIVIAL FACTOR! 3!\n\n> [kusoneko](#comment_5_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5): I knew it! There's only one gender!\n\nHow do you fit your galaxy brain into ZeroNet.",
				"added": 1566511050
			}
		],
		"1566375802_1C7X6AtuFz4ARoxZAj1XaEjPprGoz6o2Vn": [
			{
				"comment_id": 31,
				"body": "> [zhetik](#comment_12_1LPwiAHM9fBUSUR5iQNVizdVMniKhC11ju): I WIPE MY ASS WITH THE HEADS OF CENTRAL BANKS!\n\nNot well enough, obviously. You still stink and not nearly enough shit has stuck to them.",
				"added": 1566514102
			}
		],
		"1566570350_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 32,
				"body": "Capitalism is so popular because every time you read the shit they post some of your brain cells commit suicide. Eventually you lose all critical thinking ability and accept whatever is shouted loudest.",
				"added": 1566632017
			},
			{
				"comment_id": 42,
				"body": "Mute is my favorite feature of ZeroNet <3",
				"added": 1566672429
			},
			{
				"comment_id": 54,
				"body": "> [publicality](#comment_29_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo): haha, best comment I've ever seen all day :D\nIt's really great. I use it all the time :P\n\n> [publicality](#comment_30_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo): hmm if god is real, why haven't we ban people from praying and getting exam's answer from him? doesn't he suppose to be a know all sky daddy? :3 [...]\nI don't have anything worthwhile to say about this but I want to get in on the religion bashing. Fuck God! :D\n\nWell, you know. The idea of gods. Because they're not real. You get the idea.",
				"added": 1566747816
			}
		],
		"1566642594_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 33,
				"body": "It's kinda funny-odd to watch new infrastructure just pop up :D",
				"added": 1566643787
			},
			{
				"comment_id": 34,
				"body": "I'd like to know more about plugins. Where should I look? I see much mention of installing them and apparently there should be a /Plugins I can access to see which I have and what they're up to but this doesn't seem to be the case.",
				"added": 1566644573
			},
			{
				"comment_id": 35,
				"body": "> [gitcenter](#comment_722_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): http://127.0.0.1:43110/Plugins\n\nNot Found\n/Plugins",
				"added": 1566644711
			},
			{
				"comment_id": 36,
				"body": "> [gitcenter](#comment_721_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): If you're asking whether I'm going to ban something -- no I'm not, unless there is much spam.\n\nI could see automated mass registration being a problem. We did just take an influx of trolls and other trash.",
				"added": 1566644910
			},
			{
				"comment_id": 37,
				"body": "> [gitcenter](#comment_723_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): You must be using an old ZeroNet version. Please update (the latest is v0.7.0, rev notrememberwhatexactly).\n\nZeroHello says it's up to date but I can update to a development version?",
				"added": 1566644969
			},
			{
				"comment_id": 38,
				"body": "> [gitcenter](#comment_725_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): That's why there's file limit. The domains are checked every 5 seconds. You can put about 10 domains at a moment. So you get about 120 domains per minute. That's a lot (but not very a lot), but I hope I'll notice that something is wrong and stop spamming.\n\nAlright, seems reasonable enough.",
				"added": 1566645071
			},
			{
				"comment_id": 39,
				"body": "> [kaffie](#comment_1078_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): This experience has taught me one thing: if a dns is first come first serve, it's always going to die by squatters.\n\nSounds like an opportunity for some problem solving! Anyone have ideas on this? GNUnet has addresses based on who you learned them from but I feel like that wouldn't go over well here.",
				"added": 1566646122
			},
			{
				"comment_id": 40,
				"body": "> [kaffie](#comment_1079_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): In practice we should have a list where people submit a domain+address, start the vote count at zero (or 1 for the submitter), and then allow people to vote up +1 for domain suggestions. Then just use the top-voted address for the domain. That way it's not first come first serve, but rather what most people think the domain should point to. If a site dies or people find a better use for the domain, it could switch via democratic vote.\n\nThat would be good if there were a way to ensure that people are voting and that the users voting are people. Of course it could be \"surprising\" to people who use relatively unknown zites if most people don't know what is expected to be there (and some other people decide to take the domains from them).",
				"added": 1566646481
			},
			{
				"comment_id": 41,
				"body": "> [blurhy](#comment_340_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): could you join https://t.me/ipzeronet telegram discussion\n\nThis Telegram stuff is creeping me out.",
				"added": 1566656962
			},
			{
				"comment_id": 49,
				"body": "> [gitcenter](#comment_763_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): .it used to be the default TLD. After this switch, .yo became the default one. Most sites used .it and didn't use domain hacks, so I figured out that replacing .it with .yo would work good enough. [...]\n\nBut then it's about yu, not me :( Nor kaffie. Hey, you could make a .kaffie TLD! :D Better than .yo and .yu, I think.\nMaybe we can tell ICANN to give up the domains we want.\n(.kaffie would be only for kaffie and any selected kaffienated friends, of course)\n\nI don't understand what's going on with clearnet here. Does that have something to do with anything other than domain name collisions?",
				"added": 1566719203
			},
			{
				"comment_id": 50,
				"body": "> [gitcenter](#comment_766_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): This is the very reason. There were many suggestions to support clearnet DNS for ZeroNet addresses, so ZeroNet has to be compatible with Clearnet. If there was search.it in Clearnet DNSes and search.it in Name.YO, what address should be used?\n\nOkay, I assumed there was something else and people were just using a plugin or such to map domains to ZeroNet addresses. Why use clearnet DNS for ZeroNet addresses?",
				"added": 1566726421
			},
			{
				"comment_id": 58,
				"body": "> [gitcenter](#comment_773_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Because, uh, why not? We're not trying to burn WWW and replace it with ZeroNet; we're trying to integrate ZeroNet to the Internet and make it the Web 3.0.\n\nThat makes a lot more sense than using clearnet DNS to get addresses not accessible from the clearnet :P I wasn't aware there was a plan or intent for that.",
				"added": 1566771046
			}
		],
		"1566671185_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 43,
				"body": "Interesting. I'm getting a not found at that CSL link, found a copy at https://eunichx.us/c/csl-2019-05-07.txt\nI see some potential issues with your 5F, though. Definition ambiguity risks enormous gaps for someone (especially someone with a lot of lawyer power) to equivocate about what \"category of purposes\" applies or how \"far as can be permitted by circumstances.\"\n\n5F5 confuses me a little. I think it's meant to be \"for anything else, it's up to specific agreements?\" I'm not entirely sure what that means just yet. It may take some time to process this (rather un-short :P) document :3",
				"added": 1566673268
			},
			{
				"comment_id": 48,
				"body": "> [kaffie](#comment_1089_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): My opposition to the licensed FOSS model was always the centralization and reliance on copyright. But reading your post here it seems there's even another worry: having this apply to \"malicious\" software. You touched a bit upon this in terms of a malicious government, but there are malicious people as well. And tracking isn't the only malicious software use case. [...]\n\nI think there's significant benefit to pushing or coercing people into sharing. It seems like a lot of people are very selfish or ashamed of their code and will base their decision more on that than on ethics, mortality, the common good, etc.\n\nYour post reminds me of some criticisms of the PPL (http://wiki.p2pfoundation.net/Peer_Production_License#Why_it_is_dangerous_to_differentiate_between_.22good.22_and_.22bad.22_users_.28Ralf_Schlatterbeck.29) regarding left/farleft licenses turned into weapons against their intent. I'm pretty sleepy, though, so I'll have to do more reading and pondering later.",
				"added": 1566693802
			}
		],
		"1566667015_18UukzxVzEwd9ugyvKWYe2vud77GyL72Px": [
			{
				"comment_id": 44,
				"body": "I let them convince me to switch too. Now ZeroUp is broken! \n\nYet another argument to never update anything no matter what :(\n/s",
				"added": 1566678333
			},
			{
				"comment_id": 45,
				"body": "> [gitcenter](#comment_758_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): How exactly is it broken? Works fine for me. \n\nYou don't count! :P /s etc.\nInstead of a list of uploads (nav bar does show up) I get popup \"Internal error: AttributeError: 'SiteStorage' object has no attribute 'piecefields'\" spam. I should make my own post but I was hoping that making a silly joke would make the problem go away on its own.",
				"added": 1566682153
			}
		],
		"1566679861_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 46,
				"body": "Everyone gets to pick features and you have to implement them?! That's an interesting way to build things :P",
				"added": 1566687272
			},
			{
				"comment_id": 47,
				"body": "> I don't get the obsession with making reddit clones. I think the reddit format sucks for having meaningful conversations. [...]\n\nI disagree with most of this. Do all conversations have to take place on Reddit? The OP already mentions connecting with other services.\nWhat's the difference between a post with 10 points vs. a post with 5 points, and a post with 5 points (10 minus the 5 from the opposing view) vs. a post with -5? It's pure popularity producing your \"correct answer\" either way. The first way pretends every post has merit (which isn't true) while the latter lets you know immediately what kind of place you've encountered.\nWhy not use all of the above, since we have the unlimited wishlist to work with here? Show positive and negative votes and allow sorting and filtering by them.",
				"added": 1566692233
			},
			{
				"comment_id": 72,
				"body": "I want it!\nToo bad it has to be made first and getting people to use it may be easier said than done.",
				"added": 1567104696
			},
			{
				"comment_id": 79,
				"body": "> [publicality](#comment_36_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo): Best way is to get nofish to set it as a default site on ZeroHello, but doesn't seem to be happening anytime soon :x [...]\n\nI don't think nofish can do that. The main problem is that the described zite doesn't exist. We have to wait until gitcenter makes it, I guess. If that happens :P",
				"added": 1567269042
			},
			{
				"comment_id": 83,
				"body": "> [publicality](#comment_49_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo): bump? >.>\n\nNudge?",
				"added": 1567642202
			}
		],
		"1566725876_1MgPQAFQwHMiHTouXfUiS98cHrnyLScEQd": [
			{
				"comment_id": 51,
				"body": "But what if it becomes cheaper than actual toilet paper? :)",
				"added": 1566726895
			},
			{
				"comment_id": 52,
				"body": "> [fiattoiletpaper](#comment_4_1MgPQAFQwHMiHTouXfUiS98cHrnyLScEQd): thanks for enlightening me !\n\nThat person is definitely legit.\nslash ess",
				"added": 1566745448
			}
		],
		"1566731066_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": [
			{
				"comment_id": 53,
				"body": "> [moor](#comment_189_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): 'Check Files' for those zites. also update zeronet, maybe the binaries are outdated.\n\nChecked, updated (clicked the update button despite it saying I'm at the latest version, let it restart), checked again. No luck.",
				"added": 1566745796
			},
			{
				"comment_id": 56,
				"body": "Fixed it! I think it had to do with some errors way up at the top of my console output that I cleared up by installing crap through pip3.",
				"added": 1566755007
			},
			{
				"comment_id": 63,
				"body": "> [nicehat](#comment_13_1LPjWhB47YZwaWoSQH1d2tnj2E3JnMU2cw): I have the same issue. Any packages in particular?\n\nIt would complain about 'quoted' modules not being available so I used `pip3 search ??` trying to find what provides that. I think this included merkletools, bitcoin, bencode3 or bencode-python3, and maybe other stuff. I may have also used my local package manager to install some other things. Sorry I didn't keep a record of what I did.\n\nThe error messages were at the top of the console output from `python3 zeronet.py` so if you have those you may be able to work out what to do from those or ask about specific messages.",
				"added": 1566849071
			},
			{
				"comment_id": 64,
				"body": "> [xcape2net](#comment_362_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I have not started using a different version of ZeroNet in the last two days, but one day ago I started not seeing new comments appearing on the ZeroHello page.  I see them only if I open the topic up.  Two days ago, I started not being able to publish anything from my zite to peers.\n\nThe zky is falling D:",
				"added": 1566852367
			}
		],
		"1566748935_1CgQ84JRbPsRt4RCi5mkUHBj4oNoSDgWaZ": [
			{
				"comment_id": 55,
				"body": "I'm definitely going to click on that.\n\nSomeone else click it first.",
				"added": 1566749167
			}
		],
		"1566746537_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": [
			{
				"comment_id": 57,
				"body": "> [gitcenter](#comment_770_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): O_O He might not be a single person (conspiracy theories, yay), but he's real at least.\n\nOkay, I sent a mail like this thing says to. I also asked if he's real. Maybe we'll finally get some answers!",
				"added": 1566757673
			},
			{
				"comment_id": 60,
				"body": "> [gitcenter](#comment_776_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): AFAIK the limit used to be 40k before; but I see that it's 50k for everyone now. So looks like nofish increased the limit globally, and then increased it specially for you.\n\nPretty nice for not having any fish. What's the catch?\n\n(badum tssh)",
				"added": 1566812686
			},
			{
				"comment_id": 65,
				"body": "nofish halp. Limit is approaching rapidly D:\nI'll believe in you if you save me from the tyranny of the evil Space Limit\nI won't even complain that you put it there to menace us! For at least an hour.",
				"added": 1566913336
			},
			{
				"comment_id": 68,
				"body": "It worked! nofish is real! Thanks, nofish!\n\nEither that or some kind of cosmic radiation flipped some bits and gave me another 50k and sent me a zmail. Could still be a coincidence.",
				"added": 1566933766
			}
		],
		"1566796194_1PeZW92EEP6UvxaSbL3cLMRPSG4agoiFTq": [
			{
				"comment_id": 59,
				"body": "> [fiattoiletpaper](#comment_8_1MgPQAFQwHMiHTouXfUiS98cHrnyLScEQd): if there is one thing that is worthless it is your opinion\n\nBut what about all of the enlightenment :(",
				"added": 1566810228
			},
			{
				"comment_id": 61,
				"body": "> [tomasz21](#comment_77_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw): Ciekawy pomysł; wykup wszystkiego srebra. Nawet podoba się mnie. Ale o jednym zapomnieliście panowie? Te srebro trzeba od kogoś kupić. A może nie trzeba? Pierwszych paru może te srebro kupić, ale reszcie mogą zablokować. ( i na pewno to zrobią ). I co wtedy z tym zakupami? Które mają zablokować system? Druga wątpliwość; gdzie kupować to srebro? Pomysłodawca nie powiedział. Czyżby w kiosku \"RUCHU\". Pozdrawiam.\n\nWhat?",
				"added": 1566815538
			}
		],
		"1566845376_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 62,
				"body": "Instead of clearnet absorbing ZeroNet, ZeroNet will devour the clearnet!",
				"added": 1566846985
			},
			{
				"comment_id": 69,
				"body": "> [rbtree](#comment_5_1HXwSsLvnH8Bqds9R7xugdf6Br7qWyerLk): Comic #1357 makes it difficult to love XKCD, especially on ZeroNet.\n\nBoo hoo.",
				"added": 1566949820
			}
		],
		"1565095300_1PnHUGmQkYq4NKZBxFp8o1Wb1ZZijeeYvF": [
			{
				"comment_id": 66,
				"body": "> [atomiserxenolith](#comment_125_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): 'you imply that they should stop protesting as well'.No, I fully support their cause. [...]\n\n\"You're a liar!\"\n\"Yes.\" *bang*\n\nProblem solved! We're all free now :)",
				"added": 1566915651
			}
		],
		"1566919824_1NTzrNqTPmBWChMJhhiPNZFh3FR1Yo7tx5": [
			{
				"comment_id": 67,
				"body": "Did you know there's a place to put the body of your post *under* the title?\nOh, you're spamming. Sorry, everyone.",
				"added": 1566920153
			}
		],
		"1566970108_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf": [
			{
				"comment_id": 70,
				"body": "> [redneck](#comment_2_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf): Is it not obvious? Geekery. Anything pertaining to being a geek. There are no specifics as i am usin geek in the loosest and most general way possible. IF you require specifics before you want to join then that is fine. There are no specifics. Just looking for geek minded individuals.\n\nI'm impressed that you somehow make a \"geek community\" sound like you're running some kind of scam.",
				"added": 1567005847
			},
			{
				"comment_id": 71,
				"body": "> [redneck](#comment_3_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf): Haha. No definitely not a scam. I am not going to tag anyone specific here as there are quite a few posts i would like to address. Definitely no anti-communists although i do not agree with communism. This group is just something that i want to start with people who are like minded. Basically anyone with the mindset required of those that want the anonymity of Zeronet and so they go searching for it. It is just a group of geeky people who have the hobby of exploring, experimenting, and sharing the findings with others that may hep them further their own project. Definitely not a scam. I more than happy to go more in depth but i prefer to be asked specific questions. If you want to know something more specific by all means send me a Zeromail, (thought i have not figured out how to associate my ZeroID with Zeromail. Seems that they are two completely different things.) You can also post here and i would be willing to answer your questions. As for other suggestions i will look into them. Thank you all.  [...]\n\nDefinitely definitely for SURE not a scam. Rest assured! Rest your vulnerable head...\n\n>Basically anyone with the mindset required of those that want the anonymity of Zeronet and so they go searching for it.\nSo... everyone here? I guess what you want is ZeroNet. Congratulations, you've found it! It's right here!",
				"added": 1567103265
			},
			{
				"comment_id": 73,
				"body": "> [redneck](#comment_4_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf): I love how you can be nothing but sarcastic. It is very refreshing. But sometimes sarcasm is not what is always  needed. Please do not reply anymore if you are not interested in providing anything useful to the conversation. However if you are interested in joining the group sarcasm would make for a great addition to the group.:)\n\nWeirdo.",
				"added": 1567104926
			}
		],
		"1567104740_1HiD82hP36YF93PEqKcgdgfgmAq8UigrjD": [
			{
				"comment_id": 74,
				"body": "Is there moderation here?",
				"added": 1567105029
			},
			{
				"comment_id": 75,
				"body": "> [homegrown](#comment_16_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX): (blah blah blah)\nYou sound angry. Bask in the soothing calm of my mute button :)\nDickhead.",
				"added": 1567115751
			}
		],
		"1567124913_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": [
			{
				"comment_id": 76,
				"body": "ZeroHello search works on ZeroTalk :)\nI don't know if there's a general reason for features from forks not being brought to ZeroTalk, though. Everyone's busy with other things, I assume.",
				"added": 1567125104
			}
		],
		"1567159417_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 77,
				"body": "ZeroNet livestreaming? That may be an interesting idea. Hmm.",
				"added": 1567176223
			}
		],
		"1567261498_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 78,
				"body": "How do you verify a developer's nationality and ensure that enough are available at all times to keep the process flowing?\nIs nofish acting childish? Seems strange he's ghosted this place, all I know is what you tell me. And I do mean you @gitcenter because I don't see anyone else claiming to be in contact with him.\nDefinitely a group takes more effort to coerce and has potential to check itself. You may catch nofish making a mistake or a \"mistake\" but this happens after the fact. If it were only him able to see the code then who would know the flaws? Would you still be here finding holes and patching them or would it be malicious users?\n\nDid you mean to put `Variable b: \"c\"` in both parts of your Step 1 example?\nDid you put malware on that zite? :P\nShould we believe you? *hmmm*\n\nRewriting as a community effort is an exciting idea. I'd love to see *some* dark/alternate net be more than one distant individual occasionally dropping an update out of the ether.",
				"added": 1567268862
			},
			{
				"comment_id": 80,
				"body": ">Krixano and me figured out how to fix this: ZeroNet core would download and apply a change if at least one ZeroNet maintainer from at least half countries accept the fix.\n>we hope that everyone is honest in this case\nThis isn't a fix, then. I think we agree that there isn't a reliable one based on any claimed (falsifiable) trait.\n\n>Uh, what??\nSorry, I was talking about his personal behavior. I don't see him talking to anyone, saying he doesn't care or can't be assed about whatever. Obviously there's someone there but their motives and behavior are unknown to me. \n@pexo seems to agree, he's just not present around here. Not as nofish, at least.\n\n>Why not if you can verify everything yourself?\nThe zite you linked told me to never believe anyone.\nBut if I believe you about that then I should disbelieve it? What are you up to, trickster!\n\nI hope you're not seeing me as hostile when I'm not.",
				"added": 1567272867
			},
			{
				"comment_id": 81,
				"body": "> [gitcenter](#comment_860_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): What are you looking for then? A copy of my ID, lol?\n\nI didn't mean that there is a fix at all. Even that won't work: an entity powerful enough to necessitate involving unfriendly nations as a protection will be able to produce fake (or illegitimate but real) IDs if it wants to.",
				"added": 1567273502
			}
		],
		"1567536043_15yACUjRkanC9AeFyo7RQSBiZLWmmNvddW": [
			{
				"comment_id": 82,
				"body": "> You are all great people.\nZeroNet is a dumpster.",
				"added": 1567539533
			}
		],
		"1567744014_12JZvHCxC5hToab5bzTvA8pdTYJTP21QGU": [
			{
				"comment_id": 84,
				"body": "Feeble? Bite me!",
				"added": 1567745320
			}
		],
		"1567878918_114mSgWDZpRknb492fpx91DL6jSNgRRXba": [
			{
				"comment_id": 85,
				"body": "> redlibertyreal: I know what you did\nHuh?\n> redlibertyreal: I know who you are! Proof!\nOh no!\n> redlibertyreal: I'm a religious idiot so don't worry :)))\nLOLWTF K next victim",
				"added": 1567917118
			}
		],
		"1568027367_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 86,
				"body": "I think they all left for Telegram because talking here was too good for ZeroNet.\n\n> [xcape2net](#comment_372_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): That's an idea, but there are a lot of idiots to block.  And, I sort of have a problem limiting free speech on a platform that is designed not to limit free speech.  Maybe I should get over that.  I'm also afraid that I might block people like Kidcourageous for one of his many obnoxious comments and miss all of his other good comments.\n\nThat's an idiotic concept of free speech. You don't shut people up by refusing to listen to them.\nI had the same problem with Kid. People often quote good comments, so there's that. Posts will be left out but that's a choice between dealing with bullshit and thinking you're censoring people by denying them your extremely inflated self-importance.",
				"added": 1568065275
			}
		],
		"1568002955_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 87,
				"body": "I think you've had too much.",
				"added": 1568067091
			}
		],
		"1568112876_1M6Q7qRmEakfzdS5BA54WZs9Zksxo3QsvF": [
			{
				"comment_id": 88,
				"body": "Did someone really just say that anyone who doesn't like mainstream idiot media is \"dumb, lazy or poor\" and should die because they're useless to the person saying that? I think that's what I read but sometimes I think I don't know English because the shit people say doesn't make any sense.",
				"added": 1568166249
			}
		],
		"1568325376_1DfS5W4f4uaamYXGawCNnG4niUe4ue5MiC": [
			{
				"comment_id": 89,
				"body": "They probably gave up and decided there wasn't any on Earth. Evidence of intelligent life on Earth is rare and often contradicted. We can consider it another debunked hoax.",
				"added": 1568337438
			}
		]
	},
	"comment_vote": {
		"67_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD": 1,
		"28_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": 1,
		"1_1KT1yp7bYJS8rCTHPVLUSUqt57B4diyjMA": 1,
		"6_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ": 1,
		"7_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ": 1,
		"7_1P8TFEmsFJruqWErsBLpTxmpczHFW3raWF": 1,
		"544_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"21_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs": 1,
		"65_1xf9XC4Nsa7YfQWFiK6xGsNDJA3AaCTUa": 1,
		"4_15VYBx1CGRe4VfqmywRjjB5Z3XtT6pMx6k": 1,
		"3_15VYBx1CGRe4VfqmywRjjB5Z3XtT6pMx6k": 1,
		"442_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"209_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"28_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs": 1,
		"33_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs": 1,
		"14_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": 1,
		"1_1Er2hwbaQYaUVoMHQMNjtARDqJqX94rafZ": 1,
		"1_1AvPdG8fBjmpY9xYBQBNdYatfAcxuMqy3E": 1,
		"12_19QqkMzxHiqFspHtQhDpNFkD3FYDuTcGWC": 1,
		"161_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"52_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": 1,
		"1_1MjEmMyTKav528ZoB2aE9Lam6mB8LdNm3C": 1,
		"743_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"7_13Qv7muvCuG3BqEDzwYAdGtBzoD47Ls7K8": 1,
		"2_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": 1,
		"6_13Qv7muvCuG3BqEDzwYAdGtBzoD47Ls7K8": 1,
		"19_1DJDoGruBajCdDVznWRKd2MBLZZUYpM8EJ": 1,
		"70_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": 1,
		"36_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6": 1,
		"34_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6": 1,
		"8_13wBVRbx9AW7LaCUpcwgtoqN7wS7wEGR9Z": 1,
		"1_1HJJZJfGxA98pc8kVpjaiZSWH2BGjLePEE": 1,
		"65_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"2_1Jr9UCuUrj9Cohzs7BMyDUJfhDhGxLBu6E": 1,
		"373_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"374_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"979_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"8_19ouxiGbVPzjqbCeAWLx4udeggoUsfEhdV": 1,
		"1_1PaCMM1R4McRQ6Kt45YE6Aoe3ze2L1ZU1C": 1,
		"76_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": 1,
		"4_1A3LTcwaXGFQJb7KDN4rbgYzNFQdAWEXa9": 1,
		"5_1A3LTcwaXGFQJb7KDN4rbgYzNFQdAWEXa9": 1,
		"6_1A3LTcwaXGFQJb7KDN4rbgYzNFQdAWEXa9": 1,
		"16_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"15_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"982_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"7_1A3LTcwaXGFQJb7KDN4rbgYzNFQdAWEXa9": 1,
		"102_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": 1,
		"984_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"21_1A1JcKDgksT5pQJoSo7g1P1cC9kAKvG93m": 1,
		"389_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"390_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"22_1A1JcKDgksT5pQJoSo7g1P1cC9kAKvG93m": 1,
		"103_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": 1,
		"1024_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1015_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1028_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"304_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"98_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"101_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"9_13Qv7muvCuG3BqEDzwYAdGtBzoD47Ls7K8": 1,
		"107_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"9_1NxzhgT8Nm2xiA3HeT8UmWCezM2N3fyds4": 1,
		"1044_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1045_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"11_1CyoFuqywpEgKYPHjQUui3TJQuEDqNqThN": 1,
		"28_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"4_1PLAQpocjo8gqX6DmtFDij9pcrEx8RbCUr": 1,
		"9_1PLAQpocjo8gqX6DmtFDij9pcrEx8RbCUr": 1,
		"12_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F": 1,
		"21_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": 1,
		"99_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3": 1,
		"1047_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"110_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"1_1NDCbKBD5fR6tJjYq6HC3gYL1uxK2M1fPz": 1,
		"670_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"674_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"149_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": 1,
		"5_1HvtaEP4h88QTu4Pv1a7SDuq1H6v7TDgsN": 1,
		"211_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"341_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1054_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1057_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1064_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"29_1G6QESmeipZsukJX5WvDxxwSioaGnEDRk3": 1,
		"70_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": 1,
		"998_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1_1DHCkpc8NpexFPwsdsp58qXz321ZDXPqHe": 1,
		"402_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1077_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1078_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1088_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"2_14A3LXiT8D3gtRGJSMG3eMbKDtRPdLeU2S": 1,
		"121_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"761_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"762_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"2_1MgPQAFQwHMiHTouXfUiS98cHrnyLScEQd": 1,
		"30_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": 1,
		"770_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"2_19TLArZeQymSy6HKztTK2xijZCmcSNFyZf": 1,
		"1_1GD6ucMtVurG7Ttt5tXyWChvfGgqRvmaUT": 1,
		"22_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg": 1,
		"3_19UWrRNGRnkxM1JKVEK7CyPNaANKkPXqA5": 1,
		"2_1HQa2NE5CRuVJsvHKLNMNrund5qwAxud9Z": 1,
		"5_1G2nXDHaHSiL2SV5w9jy1tWddBS5EegZMw": 1,
		"51_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": 1,
		"75_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"8_14HL4TtDqn72eNpfEQE5WSYjRsYDr2pZ81": 1,
		"127_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"62_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"11_1BRQUkyDA6VNhSC3KDLfmuyVKMP3LkwpkG": 1,
		"854_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"139_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"926_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"65_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": 1,
		"75_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"147_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"63_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": 1,
		"67_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": 1,
		"14_155YW8Qn715edvfqPMrsPscUHqut4JCphb": 1,
		"9_114mSgWDZpRknb492fpx91DL6jSNgRRXba": 1,
		"11_114mSgWDZpRknb492fpx91DL6jSNgRRXba": 1,
		"30_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": 1,
		"375_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"378_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1_1HteeHwgwZRmPKFzUM5GNiLRUExCJAm6kh": 1,
		"15_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": 1,
		"2_1MTiDbYKVBHvcZRH4AikT2PbpUGBTUsCy": 1,
		"7_1F8RgqojbeyvDmM4m2U1ALv6vvMSA4LsSF": 1,
		"104_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"36_14BhfodWhzPjujQB97t8A5R4r59T7iqopJ": 1,
		"35_14BhfodWhzPjujQB97t8A5R4r59T7iqopJ": 1,
		"31_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": 1,
		"241_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"393_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"130_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1
	}
}