{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1543163412,
			"title": "Tusiko's Tavern is open",
			"body": "I started a little new blog about 0net and other parts of the internet. You are welcome.\nhttp://127.0.0.1:43110/1FMGApV8HfFdq8wX8vvfn27twHhyFPVM7N/",
			"added": 1543163411
		},
		{
			"topic_id": 1543597469,
			"title": "Mute Topics",
			"body": "It would be a nice option to be able to mute a topic. To get a better overview I would like to see only Topics of my interests or to mute Topics without my interests.",
			"added": 1543597467
		},
		{
			"topic_id": 1544210236,
			"title": "Is ID@zeroverse dead?",
			"body": "Some days ago I tried to get an ID from ID@zeroverse (http://127.0.0.1:43110/zeroverse.bit/). I use Bitmessage and ZeroMail. Till now I got now answer. Is this service dead?",
			"added": 1544210233
		},
		{
			"topic_id": 1545774097,
			"title": "Zeronet Tor meek 0 Tracker",
			"body": "I have a working Zeronet version (rev. 3670), which is from [Arch Linux AUR Git](https://aur.archlinux.org/packages/zeronet-git/). The installation is systemwide and works with `--tor always`. \n\nNow I liked to install the very new version directly from Git. After cloning it to my machine, writing the same `zeronet.conf` as above with `--tor always`, I started in the folder\n`$ ./zeronet.py`\nIn my Browser I got the following error message, because the tracker were blocked.\n\n> http://127.0.0.1:43110/1FMGApV8HfFdq8wX8vvfn27twHhyFPVM7N/img/tor-meek.png \n\nI don't, how to solve this issue. To add the following commands:\n`$ ./zeronet.py --tor_use_bridges` - The trackers are blocked - 0 Trackers\n`$ ./zeronet.py --tracker_proxy {disable,tor}` - doesn't work. Zeronet stops.\n\nOf course, I can wait till my working configuration will be updated. But I like to know, if this issues could be solved.",
			"added": 1545774093
		},
		{
			"topic_id": 1545819941,
			"title": "ZeroMail - Deleting Messages fails",
			"body": "When I delete a message in ZeroMail it is only deleted temporary. \nOpening ZeroMail a few hours later, the deleted message is back in the incoming folder.\nI tried this several times with different messages. All are back again.\nThis is not really secure for my privacy. Is it a bug? In this manner ZeroMail is not usable for me.\nI use rev. 3670.",
			"added": 1545819936
		}
	],
	"topic_vote": {
		"1543348094_16VrCKQQiVZpJ6S5xJASR8LCFLv24M5bfn": 1,
		"1543546851_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1544500813_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1544703954_1GHXQ3vMtadfHFjTwS3roqYe8LUsyDqN8f": 1,
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1544937960_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"1545029431_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": 1,
		"1545093624_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1545098151_1L8SDzP2j7rwvz2moKzQyaoHwteL6C2bGq": 1,
		"1545167966_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"23100_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"1542967986_1MHdmQEW2HS6sZNgfi3VmtegHc6fUEyVkW": 1,
		"1545325711_1PhqJPvtSbw5RkpHj63w8cRtyJw2ivpCSy": 1,
		"1545441215_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq": 1,
		"1545508330_1GQavEpwS1D6pdD3suzaEu8Y25NFzNxvge": 1,
		"1545423165_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq": 1,
		"1545341925_1H8YqnwyoceTwJuGpy6nh3PDkwwii5kYuV": 1,
		"1545851840_19r2tS5GqeMQnxmyPq9ufD79LXoMVDszDU": 1
	},
	"next_comment_id": 62,
	"comment": {
		"1542278485_1ELQXPkiUPmfR2ZCJLyhEucP5vqkLWaJdv": [
			{
				"comment_id": 1,
				"body": "I use Linux for many years now and ended some years ago at Arch Linux as the best distro for me. I use Arch Linux on several machines, including Arch ArmV7 on a Raspberry Pi.",
				"added": 1543156988
			},
			{
				"comment_id": 10,
				"body": "> [quantumworld](#comment_2_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I am thinking of doing the same as well.\n\nLinux Mint just works and does many things out of the box. Fedora is really good. I used it for a long time. But some things could be a little bit more tricky to install. Some years ago I switched to Arch Linux. It is perfect for me. I only install what I need and forget the things I do not need. This is a fast and slim OS with a big and friendly community. But Fedora is a very good choice as well.",
				"added": 1543526583
			},
			{
				"comment_id": 11,
				"body": "> [quantumworld](#comment_3_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I may try arch in a vbox. I want one linux machine that is ready to go on the fly and I want another system that is more robust. I have been using Linux for 20 years and you get rusty when you leave that command line. Mint has been the easiest to set up and easiest to keep it running. I started on Mandrake and did some distro role out work on it. Allot goes into these distributions before they are released.   I just want Linux mint 19 to be compressed down to 19 k and have all the software working on it and installed. LOL\n\nThen Linux Mint is the best choice, I would say. :-)",
				"added": 1543596034
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 2,
				"body": "> [ornataweaver](#comment_82_139zVkd4AsZqs9qSYk6ypPDAqDcjPCmRm4): I also like to know about this, a lot.\n\nAs far as I know, 0net only uses the localhost to connect to a zite. There is no need for https. \nIf you use a remote connection to 0net, the only thing to do is to use an encrypted connection to the 0net machine. A good way is to connect with ssh and port forwarding like: ssh -NL 43110:localhost:43110 user@remote_host. Then you just open all sites as localhost like sitting in front of the remote machine.",
				"added": 1543157595
			},
			{
				"comment_id": 59,
				"body": "Hello @blacktitan and welcome.\nI use Manjaro too. My Tor browser works without errors. Errno 111 stands for \"no connection\".\nYou do not need to open ports for Tor in your router. I can only assume that the issue is in your machine.\nJust for testing: Did you try tor as program (not the browser)? Look, if it works.\n`$ sudo pacman -S tor`\n`$ sudo systemctl start tor`\n`$ sudo systemctl status tor`\nThe last command shows the connection status of tor. The connection must work 100%.\nIf this fails, you have a general connection error, I think. If it works, than Tor browser should also work.",
				"added": 1546213311
			},
			{
				"comment_id": 60,
				"body": "> [blacktitan](#comment_2_1Urzp74yVdhFSkrXY48gU3fEZSoXLBtvd): Hi @tusiko, thanks.I tried what you indicated, but I am still having the same issue. I started tor service, and restarted the zeronet server.I opened the TBB and accessed the zeronet home from there. I am still getting the same 111 error(connection refused). All the ports are opened on my router.\n\nAh, okay. I think I got it now. At first, you only need to run Tor OR Tow browser. Both is one too much. Stop your Tor service with:\n`$ sudo systemctl stop tor`\n\nYou have to adjust Tor browser to allow connections with localhost:\nIn Tor Browser:\n1. Go to the preferences => scroll down to \"network proxy\" => settings\n2. Scroll down to \"No proxy for:\"\n3. Type in: 127.0.0.1 => OK. \nNow the Tor browser should work with Zeronet.\n",
				"added": 1546245600
			},
			{
				"comment_id": 61,
				"body": "> [blacktitan](#comment_3_1Urzp74yVdhFSkrXY48gU3fEZSoXLBtvd): @tusiko, before I asked here, I followed this guide: https://zeronet.io/docs/faq/ . I can access zeronet using the browser bundle, but the connections do not go through the tor network. At the top, of the zeronet homepage, I see \"port:opened\" ,\"tor:error\" and \"seeders: 10/14\". it is the tor:error part that is bugging me. Online, people don't seem to be having this problem.\n\nThe Tor browser has to be started, before Zeronet starts.\nAfter open the Tor browser start Zeronet with the `--tor always` flag.\n`$ ./zeronet.py --tor always`",
				"added": 1546248557
			}
		],
		"1543163412_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs": [
			{
				"comment_id": 3,
				"body": "> [tomasz21](#comment_20_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw): Witam; Ciekawe poruszasz tematy.I dobrze jest więcej wiedzieć.Czekam na pierwszy artykuł.Pozdrawiam.Hello; Interesting topics you're talking about. And it's good to know. I'm looking forward to the first article. I'm happy.\n\nthx :-)",
				"added": 1543177571
			},
			{
				"comment_id": 4,
				"body": "> [botthing](#comment_3_12cksYLBmARcuhG3L7tDGGYuA6CehjfUb9): Added to my NewsFeed ^^ [...]\n\nthank you",
				"added": 1543177604
			},
			{
				"comment_id": 5,
				"body": "> [eightyfour](#comment_30_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): Hey there! Nice read! The technical side of your writing style could use some improvement, but content is much more important, so don't let that get you down. I hope to read more in the future!\n\nSorry for my style, but English is not my native language. I try me best. ;-) Thank you.",
				"added": 1543234725
			}
		],
		"1543247109_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": [
			{
				"comment_id": 6,
				"body": "This helps a lot. Thx for this great work!",
				"added": 1543262036
			}
		],
		"1543348094_16VrCKQQiVZpJ6S5xJASR8LCFLv24M5bfn": [
			{
				"comment_id": 7,
				"body": "This is a very interesting topic. I'm new here and hope that you get answers to your question. How secure is Zeronet in comparison to Freenet, I2P or Tor? I do not find any hints in the net.",
				"added": 1543353137
			},
			{
				"comment_id": 17,
				"body": "> [james007](#comment_190_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5): I2P and Tor are simply overlay networks that can run any software (including ZeroNet). FreeNet is it's own network, but uses Java and you are forced to share content which may be illegal, since every node is a part of the global data store. With ZeroNet you choose what you share and can easily unpin it.\n\nThe shared data in Freenet is fully encrypted and so you can always say that you never know, what you share. In my eyes ZeroNet is a very good thing, but I would prefer some encryption. Perhaps encrypted peer data and json content.",
				"added": 1544552158
			}
		],
		"1542967986_1MHdmQEW2HS6sZNgfi3VmtegHc6fUEyVkW": [
			{
				"comment_id": 8,
				"body": "> [tomasz21](#comment_21_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw): Witam; To się wszystko zmieni. Kiedy dokręcą nam mocniej śrubę. Wtedy ludzie zaczną szukać alternatywy wolności. To przykręcanie , się dzieje cały czas. Tylko bardzo powoli,i stopniowo. Cały czas blogi, są blokowane, ograniczane przez cenzurę. Niepokorni są wyrzucani – usuwani. Mnie tak załatwili. Poszukałem alternatywy. I znalazłem  ZeroNet. Trzeba popularyzować, i reklamować wśród znajomych. Pozdrawiam.  [...]\n\nYou are right and I have a few friends with interests on Zeronet. I think that more and more users will come to here. Slowly but they will come.",
				"added": 1543353319
			},
			{
				"comment_id": 38,
				"body": "> [shiruka](#comment_1_1MHdmQEW2HS6sZNgfi3VmtegHc6fUEyVkW): Ok so, as a response to everyone. Thanks for the feedback (I come to zeronet from time to time so I just red the coments). I really like the response of @eightyfour, and I agree. There is no point on doing a new web services like zeronet if the net dosen't have content. Thats why I support the creation of content here. Indeed, when I have free time I want to try to create some zites, but it comes back to the same point, content.  [...]\n\nI totally agree with your statement. In other p2p networks new users were coming and asking very soon for some usable content. And many are gone away soon again because of to less content. I saw that in I2P, Freenet and even Tor. Actually I am working on my blog here in English language and on a website in German language. On the website I publish little tutorials for Zeronet and IPFS (I'm just in the beginning). On my blog I try to write about tips an tricks for new users as well as other stuff from the net.\nIt would be a very good idea, if everybody (why not?) would start a little blog and publish some stuff. I never found a network, where publishing a blog was so easy as here. Write about your pet, your hobby or politics, sport and music. Whatever. Every blog helps Zeronet growing.",
				"added": 1545258856
			}
		],
		"5_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 9,
				"body": "All four darknet have a good anonymity. Most mistakes are made by the user himself. I use the Tor Browser for each of these four networks, of course with switch off JS and Https-Everywhere.\nThere are many traps to walk in in every darknet and one has to be careful, what to write and what to do in the net. Anonymity is given by default, but this is only the beginning. From now on all depends on the users behavior.",
				"added": 1543430795
			}
		],
		"1543672789_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": [
			{
				"comment_id": 12,
				"body": "Twitter is a commercial thing to earn money with your data - you pay a high price.\nMuch better is a decentralized social media similar to Twitter. Very popular is Diaspora. My solution is the use of Freenet, I2P or Zeronet to communicate with people like now.\nMany people are using Twitter of course. Sadly. But more and more come to the free (free as in freedom) deep webs.",
				"added": 1543671887
			}
		],
		"1543694585_16af9LM4sncd3n6NQDX7GqdWreYvCbKX4q": [
			{
				"comment_id": 13,
				"body": "For these posts I would like to have a \"Mute\" button to ignore such needless posts.",
				"added": 1543701654
			}
		],
		"1544254269_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 14,
				"body": "> [robione](#comment_94_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): It's more like, you need to run a service and connect to it, and you need to know what IP to connect to. Or programmatically you just need to pass the local IP info to a script, etc.. [...]\n\nWhy do you think that ifconfig displays too much information? This commands show exactly your IP. You can also use:  ip addr show eth0",
				"added": 1544372127
			},
			{
				"comment_id": 15,
				"body": "$ ifconfig | grep \"inet 192\"\nResult example: $ inet 192.168.0.113  netmask 255.255.255.0  broadcast 192.168.0.255\nYou can use a shell script to print only the first IP address.\nOr you write a little script which ends with the output of the IP address.",
				"added": 1544391725
			},
			{
				"comment_id": 25,
				"body": "I followed this discussion and I think you can only write a script or little python program, where you can filter the output of one the given commands to print your desired IP without other data.\nThere is no command in Linux which prints only the local IP or public IP.\nI recommended a short python3 code to do this job. \nI am with  @leftside and don't understand what you really want to do.",
				"added": 1544862484
			}
		],
		"1544210236_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs": [
			{
				"comment_id": 16,
				"body": "Thanks for all your answers. I got another ID now at KaffieID. I think this should work.\nThis is really a big point against centralized services.",
				"added": 1544470002
			}
		],
		"1544607015_19YMx99q22Ym9nUwJjunZjnuDFpSyBkbB9": [
			{
				"comment_id": 18,
				"body": "Take part and publish some new stuff. :-)",
				"added": 1544637237
			}
		],
		"1544639635_1Dd32hiiWqzaa3mzA21af2VneXPJdzEbRr": [
			{
				"comment_id": 19,
				"body": "> [ranx](#comment_1_1Dd32hiiWqzaa3mzA21af2VneXPJdzEbRr): Yeah, that works if you already downloaded the site. But if you just installed ZeroNet and there is no peers?\nZeronet is growing and growing. In my eyes it is impossible and really a theoretical question. If they are no peers, I think you have just a Zeronet server because you are alone. With just one other peer you have a Zeronet. That is only my thought.",
				"added": 1544644188
			},
			{
				"comment_id": 20,
				"body": "> [quantumworld](#comment_60_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): How big is zeronet? Any ideas?\n\nNo ideas. I am new here as well for a few weeks now. I think, others can tell more about that.",
				"added": 1544679710
			}
		],
		"1544703954_1GHXQ3vMtadfHFjTwS3roqYe8LUsyDqN8f": [
			{
				"comment_id": 21,
				"body": "I used Freenet as well till this week and I like it.\nAll data, equal if a website, a plugin or just data of peers, is encrypted by default. That is a big advantage.\nThe required data space, reserved for Freenet, is at min. 465 MB. You can give more without a limit. You will never know, which kind of data Freenet stores there, all is encrypted.\nYou cannot use any JavaScript. Only static websites are allowed for security reasons.\nIt is a low latency network. Connections are slow and it is the best to let the Freenet node run 24/7.\nThere are several plugins, from Web of trust over Freemail to Sone (Microchat) and FMS or Frost as a board.\nYou can write as much blogs as you like, a plugin saves your data and updates very convenient.\nYou can write as much websites as you like. Another plugin (Sharesite or. jSite) helps you to upload every update very convinient as well. It is really easy to do, if you learned once, how it works.\n\nUnfortunately Freenet needs much resources. I got it working on a Raspberry Pi, but it is tricky.\nFor me Freenet is the most secure darknet together with I2P. But because of too less users I left Freenet.\nThe developers always think first on security, then on the user and convenience.",
				"added": 1544707794
			}
		],
		"1544706846_1GHXQ3vMtadfHFjTwS3roqYe8LUsyDqN8f": [
			{
				"comment_id": 22,
				"body": "> [styromaniac](#comment_333_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It can happen. Don't browse just any site anyway. A few are being malicious. [...]\n\nFor me this is a good way. In any web one has a responsibility not to visit sites without care. If I visit useless sites or ones with illegal content, I immediately delete them in ZeroHello. In case of sites with illegal content I put them into my blocklist. This is easy done in ZeroHello by one self.",
				"added": 1544730732
			},
			{
				"comment_id": 23,
				"body": "> [hypercode](#comment_3_1GHXQ3vMtadfHFjTwS3roqYe8LUsyDqN8f): because I think this is very serious, every disk seized here, regardless of the reason, goes through a search algorithm for this type of content.\n\nTherefore it would be great, if those data would be all encrypted by default. Zeronet would fast enough anyway.",
				"added": 1544730853
			},
			{
				"comment_id": 24,
				"body": "> [styromaniac](#comment_333_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It can happen. Don't browse just any site anyway. A few are being malicious. [...]\n\nBig thanks for your work. Got it.",
				"added": 1544731024
			}
		],
		"1544899392_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 26,
				"body": "The stats on ZeroHallo show me that 865 peers are connectable. Tracker 9/12. \nSo far as I know ZeroNet is growing. Due to #Facebook many more users will come to us in future. ;-)",
				"added": 1544910739
			}
		],
		"1544911802_14cqdxte9VRXGe4WYEY49Htx1HxUqKNGrP": [
			{
				"comment_id": 27,
				"body": "In every darknet you can find much porn. I never search for them and in ZeroNet I have not seen much.\nThere are many forms of illegal porn in the darknet. Number one could be child porn but you will find all other kinds of ugly porn as well.  This is the underground. The Tor network is full of porn for example.",
				"added": 1544913692
			}
		],
		"1544937960_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 28,
				"body": "> [znnex](#comment_8_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): One example: we have KopyKate (two of them), YouTube (the ZeroNet one), IFS, and probably another dozen or so similar zites. Why? Tell that to every new user. Actually, tell that to me too. Why do we have so many sites all doing the same thing for every 'thing' there is to do?  [...]\nThis question I asked myself several times here. Why do users copy/clone so much zites? I only need one video portal, one board and one Zerome. A second versions make only sense with a big benefit or difference to the \"old\" one. Too many zites with similar content confuse the users.",
				"added": 1545005658
			},
			{
				"comment_id": 29,
				"body": "Just tell all friends about Zeronet. Use boards and social media to advertise it. Do simple steps. Go to Tor, I2P and Freenet and talk about Zeronet (I have done this and hope, some users will come to us). Zeronet is nothing to hide and nothing bad. One can just speak over it.",
				"added": 1545005970
			},
			{
				"comment_id": 31,
				"body": "> [quantumworld](#comment_78_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I totally disagree. Then you have a centralized system again and if anything happens with the code it will break for everyone. The more the better in my view. Same goes with Linux. My god if we never forked a Linux distro we would all be sitting in a green screen command line right now with no gui's.. Sad but true..\n\nThe consequence is that you have to search on many places to find your thing. That is annoying. And in a decentralized web nothing can be centralized. That is impossible.\nLinux has many problems with all of the forks. Ubuntu itself has coding problems. And Ubuntu itself deleted many old drivers. What happens now? Every distro, coming from ubuntu, has the same problems to solve. That is a bad way. If you like to see a smooth system, give a look to OpenBSD, which is small and fast (server). Actually there are too many different Linux systems on the market. Many users are going to the BSD's because of less forks. I went away from all the *buntus and friends many years ago. \nBTW: The first Desktop environment was the Apple Lisa 1983. Microsoft started 1985 a desktop. All before Linux was born.",
				"added": 1545007223
			}
		],
		"1544990520_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 30,
				"body": "I2P would easily do that for you. The I2P torrent software I2PSnark deals often with files more than 20 GB. :-)\nBut unfortunately there is no connection between I2P and Zeronet.",
				"added": 1545006224
			}
		],
		"1545026098_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": [
			{
				"comment_id": 32,
				"body": "When Zeronet launches, it opens the default browser. To change to the Tor browser, you have to change the default browser of your system. But now every software opens this browser by default.\nTo avoid this, you can prevent Zeronet from starting a browser. I open the Tor browser manually and ZeronetHello is the default starting page.",
				"added": 1545029652
			},
			{
				"comment_id": 34,
				"body": "> [nws](#comment_11_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf): Hmm, it seems the setting is ignored on macOS. Even when that option is disabled, ZeroNet always launches Safari. Known issue?\n\nThis... should never happen. In Linux it works. I think, it is a bug.",
				"added": 1545036743
			}
		],
		"1545029431_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": [
			{
				"comment_id": 33,
				"body": "Interesting question.",
				"added": 1545030831
			}
		],
		"1545156874_13kYNU2CMyyfVukmVgqeCNJdFNDtc2ZpEp": [
			{
				"comment_id": 35,
				"body": "ZeroNet is no darknet. I cannot recommended to downloads big files/torrents, especially when you are connected over tor. In Tor itself the users are warned not to do this, because you can be identified. With Zeronet over Tor the security is a little less than Tor only.  I would say that it is not magic, if anybody could trace you in Zeronet.\n\nTo stay anonymous you should use I2P or Freenet. There the security to stay anonymous is much higher. Zeronet is a P2P network without encrypting data and without overlay network. It is very good, but it is not a darknet.",
				"added": 1545159909
			},
			{
				"comment_id": 36,
				"body": "> [quantumworld](#comment_85_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Freenet is so slow!!!!  Waiting 9 hours to get to a site is absolutely insane. I calculate that they are basically running at less than 300 baud.  They can speed it up without compromising security. I think they are using some really poor software designs. The over all concept is good.\nFreenet is not slow, if you run your node 24/7 and adjust the up- and download values. A site is opened in up to 10 seconds. It is normal for a low-latency-network to work a bit slower. Zeronet is fast, but has no encryption. \n\nIf you would have had adjusted Freenet as in the howtos is described, you would have seen a faster Freenet. Freenet is nothing to start in minutes and you have a lot of work with the settings. But it is very secure and stable.",
				"added": 1545160665
			}
		],
		"1545219056_15TaxrtxopVTWbYVgp9fpeSv4thDgddB2Y": [
			{
				"comment_id": 37,
				"body": "> [marionunes](#comment_5_1JsNmMgnbw85F25Drfg5YQ3Zdai6pyvHLd): Creating content, Keeping a node online 24/7!Inviting and introducing new people!\n\nThat is exactly what I do. In my eyes the best way to let Zeronet grow. We need just more content. The users will come then.",
				"added": 1545239563
			}
		],
		"1545123114_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ": [
			{
				"comment_id": 39,
				"body": "> [gitcenter](#comment_389_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Short explanation: It's bad. [...]\n\nThanks for your very detailed information. I learned a lot today. :-)",
				"added": 1545259123
			}
		],
		"1545287200_1FqHbECdkkaK3ixwJMqE5UJJxpfzZk1nhX": [
			{
				"comment_id": 40,
				"body": "Welcome to ZeroNet. :-)\nI never had a problem accessing zites in Zeronet. And I have honestly never manually wrote a Zeronet address into my browser. All websites are accessible over a link or you just copy and paste an address. I know many p2p networks and Zeronet is the easiest one to handle from all of them.\nThere is a project for a Zeronet browser and you can test it. Lookt at ZeroMe: [click](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u/)",
				"added": 1545308443
			}
		],
		"1545341925_1H8YqnwyoceTwJuGpy6nh3PDkwwii5kYuV": [
			{
				"comment_id": 41,
				"body": "I use a Raspberry Pi 3. In Germany it costs about 50 EUR, including SD-Card.\nLook at the article in my blog: [http://127.0.0.1:43110/1FMGApV8HfFdq8wX8vvfn27twHhyFPVM7N/?Post:22:ZeroNet,+Tor+and+IPFS+on+a+Raspberry+Pi](http://127.0.0.1:43110/1FMGApV8HfFdq8wX8vvfn27twHhyFPVM7N/?Post:22:ZeroNet,+Tor+and+IPFS+on+a+Raspberry+Pi)\nFor me it works nice and runs 24h, 7 days a year.",
				"added": 1545346185
			},
			{
				"comment_id": 44,
				"body": "My RP3 runs 24/7 and is connected to more than 60 sites now. I have IPFS and Tor running on it as well.\nIPFS needs some more resources. Only using Zeronet and Tor you could perhaps connect to more than 100 sites, I appreciate. I wouldn't it run without tor.\nI recommended not to use Raspbian because of the need of higher resources. I use Arch Linux ArmV7 (32bit), which is very fast and saves much space in RAM and needs less resources.",
				"added": 1545516506
			},
			{
				"comment_id": 45,
				"body": "> [nofish](#comment_1226_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): It depends on how many/how big sites you want to serve. I running it on a $9 Chip computer without any problems: http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:94\n\nThis thing is awesome. Actually it has a price around $80. Nice machine.",
				"added": 1545516642
			}
		],
		"1545454147_19AR8ndYAaE6Q2yRAcpTKmkwtyJ5ETPhMC": [
			{
				"comment_id": 42,
				"body": "In Linux you can even set the flag -tor always in the config file. Then you only need to start zeronet and all is done.\nBut you need to use the Tor browser, if a link on a site likes to lead into the clearnet. \nNow you are anonymous with nearly the same protection as only using tor.",
				"added": 1545476408
			}
		],
		"1545508330_1GQavEpwS1D6pdD3suzaEu8Y25NFzNxvge": [
			{
				"comment_id": 43,
				"body": "No. You can just store this file in the data folder.\nThe link has to be named in this case: \n`data/a.dae`\n**No** slash or anything else before. All links must be **relative**. I use pictures in my blog, which are stored in the `/img` folder. It works.",
				"added": 1545515926
			},
			{
				"comment_id": 47,
				"body": "> [abpcalex](#comment_3_1GQavEpwS1D6pdD3suzaEu8Y25NFzNxvge): No. It's not a file path issue. It's a filetype issue. I must find a way to register this file to be used. It's like a firewall.  [...]\n\nGood to know, thx.",
				"added": 1545521715
			},
			{
				"comment_id": 48,
				"body": "> [abpcalex](#comment_6_1GQavEpwS1D6pdD3suzaEu8Y25NFzNxvge): The weirdest thing is that if you just double click the .html file it works fine locally without a server. (E.g.: python -m http.server)\n\nThat's really weird. I am not so deep into the technique of ZeroNet, but I learn every day a little bit.",
				"added": 1545525750
			}
		],
		"1545419387_1Mx5xcSVsv8mdsXtKwBPD8X1SEfzN2VR5u": [
			{
				"comment_id": 46,
				"body": "Actually I cannot update to the new version. My ZeroHello says \"Up to date\" (rev. 3670).\nI installed it over Arch Linux Aur Git and perhaps I have to wait till it is updated there.",
				"added": 1545519560
			}
		],
		"1545529191_16Si75ENBx7ZDBCaKFnWoCZxxCpuUpzvTu": [
			{
				"comment_id": 49,
				"body": "For searching you can use Kaffiene: [http://127.0.0.1:43110/1Mr5rX9TauvaGReB4RjCaE6D37FJQaY5Ba/](http://127.0.0.1:43110/1Mr5rX9TauvaGReB4RjCaE6D37FJQaY5Ba/)\nThere is a Millchan for images. Try it at Kaffiene search.",
				"added": 1545530036
			},
			{
				"comment_id": 50,
				"body": "> [zhopi4](#comment_1_16Si75ENBx7ZDBCaKFnWoCZxxCpuUpzvTu): http://127.0.0.1:43110/1Mr5rX9TauvaGReB4RjCaE6D37FJQaY5Ba/\n\nIf you search in Kaffiene http://127.0.0.1:43110/1Mr5rX9TauvaGReB4RjCaE6D37FJQaY5Ba/ for \"image\", you'll find many results to image related sites.\nAs @msx2 wrote, here is Millchan: http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA",
				"added": 1545581172
			}
		],
		"1545642302_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": [
			{
				"comment_id": 51,
				"body": "For me a good blogging tool is ZeroBlog. Just clone a blog you like. There are many of them here in lightly different layouts. It is very easy to handle and looks good as well.\n[Original](http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Home)\n[Tusiko's Tavern](http://127.0.0.1:43110/1FMGApV8HfFdq8wX8vvfn27twHhyFPVM7N/)",
				"added": 1545647315
			}
		],
		"1545753860_1KYoFyGsqADgBVSAuRYNvzPpTNn2AVAR4v": [
			{
				"comment_id": 52,
				"body": "EThe Times 03/\nJan/2009 Chancel\n?\n_2009_?\nI am too stupid for that stuff. :-)",
				"added": 1545759655
			}
		],
		"1545819941_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs": [
			{
				"comment_id": 53,
				"body": "> [caryoscelus](#comment_100_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): This is probably because 0mail messages are stored as sender's data, not receiver's. Which means that sender is the one who can delete them (also quite annoying, but then it's a general rule of 0net: unless you back up data, it can be deleted) [...]\n\nOkay, sounds reasonable. I know that Zeronet doesn't really send mails. It is interesting that only the sender is able to delete message. But okay, that is the system now. I wonder if ZeroMail makes sense due to this background. A PGP mail over Tor would be much more secure because it can be deleted by the sender or recipient. Or even the new provider [Tutanota](https://tutanota.com), who encrypts everything in a message would be a good way. If both, sender and recipient are customers there, no bit is send over the internet. The mail stays in the house. Same with Torbox.",
				"added": 1545866924
			}
		],
		"1545899218_19QqkMzxHiqFspHtQhDpNFkD3FYDuTcGWC": [
			{
				"comment_id": 54,
				"body": "You don't need to do anything. From time to time the sites try a new update and the bell is gone.\nYou can click on it and start an update manually, if you really need the actual content of this site now.",
				"added": 1545917040
			}
		],
		"1545774097_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs": [
			{
				"comment_id": 55,
				"body": "As I wrote, I have the Arch Linux AUR Git installed. The updates are a little bit delayed.",
				"added": 1545917343
			}
		],
		"1546031606_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 56,
				"body": "As @randomshit wrote. It should work, if you delete the site in the file sites.json. In this file all connected sites are listed. I recommended to make a backup of this file **before** deleting something.",
				"added": 1546040788
			}
		],
		"1546138183_12NqXRG5Ur6HzBsgR2kgPxmcWGhR9sxSLi": [
			{
				"comment_id": 57,
				"body": "Here are the Zeronet docs:\nhttp://127.0.0.1:43110/1Docsfk5uLvuXkL4U13eYDxCm2gzi1fNQq/",
				"added": 1546163466
			},
			{
				"comment_id": 58,
				"body": "> [moor](#comment_82_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): what part you don't understand? check out this zites if you want to understand zeronet better:The truth about ZeroNetImportant ZitesZeroSites\n\nHere I have a security question. In the section\n## Restricted policy\n[...]\nZeroNet also does not let zites escape from `<iframe>` - a special token is passed to `<iframe>`, zites use it to communicate with ZeroNet server for some low-level commands. As it changes when you reload the page, bruteforcing `wrapper_nonce` (the token) is the only way to escape `<iframe>`.\n[...]\n\nThis excerpt is from \"The Truth about Zeronet\".\nEven when I open exactly this site, I get the message \"Escaping iFrame\". I get this message on several sites in Zeronet, including official ones.\nWhat happens here, when this is not possible? Perhaps a question for @nofrog?",
				"added": 1546187856
			}
		]
	},
	"comment_vote": {
		"20_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": 1,
		"3_12cksYLBmARcuhG3L7tDGGYuA6CehjfUb9": 1,
		"40_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": 1,
		"20_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": 1,
		"1220_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1219_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"21_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": 1,
		"4_154aXdhb7aoQmT62rxDp6HKte3V1jDQVdZ": 1,
		"2_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1_1JU8NTajPZjS7R5RpxzMTUqJoBjhkpScYh": 1,
		"3_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"91_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"92_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"9_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"26_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": 1,
		"66_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": 1,
		"34_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"33_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"189_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"101_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1,
		"1221_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"545_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"190_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"76_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": 1,
		"191_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"4_1GHXQ3vMtadfHFjTwS3roqYe8LUsyDqN8f": 1,
		"333_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"3_1GHXQ3vMtadfHFjTwS3roqYe8LUsyDqN8f": 1,
		"97_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"26_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ": 1,
		"114_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"5_1JsNmMgnbw85F25Drfg5YQ3Zdai6pyvHLd": 1,
		"116_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": 1,
		"389_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1226_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"455_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"3_1GQavEpwS1D6pdD3suzaEu8Y25NFzNxvge": 1,
		"100_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1
	}
}