{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1545344448,
			"title": "Cześć",
			"body": "Czołem, kluski z rosołem!",
			"added": 1545344447
		},
		{
			"topic_id": 1545469324,
			"title": "HORYZONT ZDARZEŃ #162 - Mozaika newsów 21 XII 2018",
			"body": "https://www.youtube.com/watch?v=XmKFFyHvDSI",
			"added": 1545469322
		}
	],
	"topic_vote": {
		"1545931437_1CcKmMy8KEvx5xebrTsNCiTRggND1MYF1G": 1,
		"1545866999_1CcKmMy8KEvx5xebrTsNCiTRggND1MYF1G": 1,
		"1555178290_17aRabPTNknRHnYR5v5gjvXcccuiGmChet": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1545344448_12Mvq5uNp3DouDNDHAvph1Uoovja7iAvz4": [
			{
				"comment_id": 1,
				"body": "https://comparic.pl/facebook-tworzy-wlasna-kryptowalute/ - wydaje się, że tonący brzytwy się chwyta. Czy może stoi za tym jakiś plan i Facebook nigdy nie straci swojej dominacji na rzecz zdecentralizowanych sieci społecznościowych?",
				"added": 1545395483
			},
			{
				"comment_id": 2,
				"body": "Pozbyłbym się FB, ale niestety większość znajomych z niego korzysta.... chociaż kiedyś wydawało się, że NK nigdy nie zginie :) W Web 3.0 mamy jednak nową jakość, zupełnie nowy paradygmat w którym molochy pośredniczące nie mają racji bytu. Taki powrót do korzeni, kiedy ludzie kontaktowali się bezpośrednio między sobą. Nawet życząc dobrze FB to nie widać dla niego sposobu na funkcjonowanie w tej rzeczywistości.\nCo do pieniądza jako narzędzia do wymiany to wg mnie nie musi on mieć zabezpieczenia w srebrze - pieniądz dłużny jest ekonomicznie poprawny: wystarczy, żeby A sprzedając coś B, mógł za ten dług otrzymać coś od C - to tylko księgowy przepływ informacji. Gromadzenie dóbr/majątku to inna funkcja - wiadomo, że na pustyni cenniejsza jest woda niż sztabka złota.",
				"added": 1545491927
			},
			{
				"comment_id": 3,
				"body": "Kiedyś majątkiem były ziemie rolne i obligacje państwowe, dzisiaj nieruchomości i akcje, za 100 lat możliwe, że będziemy łapać asteroidy ze złotem czy srebrem jak będzie nam potrzebne. Niewiadomo. Srebro ma duży potencjał w technologii i jubilerstwie, w dodatku ubywa go szybciej niż złota, ale raczej minęły czasy, gdy uzależniano gospodarkę od kruszców. Kryptowaluty są dowodem, że można osiągnąć ten sam efekt ograniczoności zasobu za pomocą matematyki i internetu. Do inwestycji najpewniejszym, najcenniejszym i praktycznie darmowym do pozyskania kapitałem jest wiedza. W dodatku nie da się go komuś zabrać, nawet pod przymusem i można go bez podatków przekazywać z pokolenia na pokolenie. Pozdrawiam.",
				"added": 1545503749
			}
		],
		"1545594088_17aRabPTNknRHnYR5v5gjvXcccuiGmChet": [
			{
				"comment_id": 4,
				"body": "Istnieje możliwość seedowania ziteów za pomocą np. Sia? (chyba jest najtańsze/gb)",
				"added": 1545642909
			},
			{
				"comment_id": 5,
				"body": "Z tego co rozumiem, zites-y seed-ują (utrzymują online) osoby, które je odwiedzają. Wydaje się, że, aby zachować dostęp do stron w przypadku, gdy nikt ich nie odwiedza, można je zwyczajnie hostować w \"chmurze\" np. AWS, jednak jest to znów powrót do scentralizowanego układu.\nMoże dałoby się hostować strony u ludzi, którzy \"kopią\" za pomocą udostępniania dysków twardych i byciu online. Ewentualnie czy ZeroNet ma jakiś inny mechanizm, który chroni przed sytuacją w której ostatni gasi światło?",
				"added": 1545654433
			}
		],
		"1552737596_1Gr9aFEWAUK46TMkEQ8diA7BmnTcWL4MXK": [
			{
				"comment_id": 6,
				"body": "Co chcesz wiedzieć? ;P",
				"added": 1553113152
			}
		]
	},
	"comment_vote": {}
}