{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"category": "movies",
			"title": "BitTorrentPortable 7.9.8 (Build 42549)",
			"torrent_imdb": "",
			"body": "BitTorrent is a peer-to-peer file sharing (P2P) communications protocol. BitTorrent is a method of distributing large amounts of data widely without the original distributor incurring the entire costs of hardware, hosting and bandwidth resources. BitTorrent identifies content by URL and is designed to integrate seamlessly with the Web. Its advantage over plain HTTP is that when multiple downloads of the same file happen concurrently, the downloaders upload to each other, making it possible for the file source to support very large numbers of downloaders with only a modest increase in its load. Serving large files creates problems of scaling, flash crowds, and reliability. The key to cheap file distribution is to tap the unutilized upload capacity of your customers. Their contribution grows at the same rate as their demand, creating limitless scalability for a fixed cost. By using software that was built by the same team that invented BitTorrent, you are guaranteed access to the latest, most efficient methods of getting downloads to your desktop.\n\n- Dynamic bandwidth management – download without disrupting other applications\n- Detailed stats on the health of media files provides a safer, more controlled experience\n- No hardware configuration – reduced hassle of fast downloads\n\nThe new BitTorrent brings together BitTorrent's proven expertise in networking protocols with µTorrentâ™s efficient implementation and compelling UI to create a better BitTorrent client. As we continue to develop this new client, we'll be focused on innovative ways to simplify and improve the BitTorrent user experience.\n\nFeatures :\n\n- Lightweight client\n- Local peer discovery\n- Multiple simultaneous downloads\n- Configurable bandwidth scheduler\n- Global and per-torrent speed limiting\n- Quick-resumes for interrupted transfers\n- RSS Downloader\n- Trackerless support (Mainline DHT)\n- Always Spyware-Free",
			"magnet": "magnet:?xt=urn:btih:2991DEABD7A79EA5C21AFD020ADE4F744074CD33&dn=BitTorrentPortable.rar&tr=udp%3a%2f%2f9.rarbg.me%3a2780%2fannounce&tr=udp%3a%2f%2ftracker.leechers-paradise.org%3a6969%2fannounce&ws=https%3a%2f%2fdl.dropboxusercontent.com%2fu%2f81053416%2fBitTorrentPortable.rar",
			"torrent_file": "data/users/16cevzTFTrMjc3Wf6n3DbkfUeuiQdXq7ju/BitTorrentPortable Pro torrent.torrent",
			"added": 1476342233
		},
		{
			"topic_id": 2,
			"category": "movies",
			"title": "CompTIA Network Plus N10-006",
			"torrent_imdb": "",
			"body": "Latest CompTIA Network Plus N10-006 Exam CBT-Nuggets Video Tutorials. Must Seed Thanks",
			"magnet": "magnet:?xt=urn:btih:ccf4fd4cda4b5625fe09da8bd6366dded357242e&dn=Sublime%20Text%20Build%203126%20x64%20Setup%20%2B%20Plugin%20%2B%20Key&tr=udp://tracker.opentrackr.org:1337/announce",
			"torrent_file": "data/users/16cevzTFTrMjc3Wf6n3DbkfUeuiQdXq7ju/",
			"added": 1477042689
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}