{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1629776696,
			"title": "How to add the Search Bar from ZeroHello to my ZeroTalk Clone?",
			"body": "Newbie here, trying to add a search bar from zerohello to his own zerotalk clone... help needed. Is it possible? and how to do it? What code should I copy paste? Ideally the search bar would only search the zerotalk clone, unless it adds another level of complexity. Thank you in advance.",
			"added": 1629776695
		}
	],
	"topic_vote": {
		"1629402955_19BXHBD1GfYpSpvdHsuHJsJ97mYpxWjUE": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1629776696_1FzpoVcMDHdrmqGuNs51dpoTmssre5yznv": [
			{
				"comment_id": 1,
				"body": "Thx, how can I extract the code and put it on my own zerotalk above the latest post? Could any one please post here what I need to copy paste?\n\nMaybe a few others questions, how to change the general background color and the text box color, which file should I mod, and which parameters?\nWhat is the most advance zerotalk site to clone? http://127.0.0.1:43110/1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq/ zerotechtalk has a lot of features that others don't have.\nHow to be certain I could be the only one able to update the zsite?\nand how can I raise the posting limit per users to 100k or 50k like here and not 20k...\n\nthanks a lot...",
				"added": 1629823196
			},
			{
				"comment_id": 2,
				"body": "we have 3 ways to do it:\n1. peacefull generous explanations... I will share what  Iearn, positive for everyone.\n2. financially, 0.005 xmr splited among those resolving my problems.\n3. brutally, I will flood so much here, that you will surrender, and I will mute you.\n\nchose fast.",
				"added": 1629824543
			}
		],
		"1622534131_17qgF4cL3wN9yvkUtEPnVBMvL1exu976uk": [
			{
				"comment_id": 3,
				"body": "Should the CJNG in alliance with all the mexicans cartels launch a full on assassinations campaign against all in mexico who support the law suit against american gun manufcaturers? It means killing politicians, judges, lawyers, press (the trigger), academics and civilians who support his law suit?\n\nof course it's a theoretical social experiment to prove to some people that a targeted usage of unrestricted violence can lead to the preservation of rights in mexico to buy arms from the usa. In this theoretical framework, I believe this lawsuit will be cancelled very fast, I am however curious what's the kill rate necessary to neutralize it. Just an idea or a very wide spread realization of the consequences to want to reduce the cartels to mere sheeps ready to be slaughtered by the UNO/marxist enslaving forces attempting to capture the west?\n\nstrong questions, big plan, peaceful protests won't work, IMHO.\n\n3.",
				"added": 1629825151
			},
			{
				"comment_id": 4,
				"body": "welcome to storm front.",
				"added": 1629825173
			}
		]
	},
	"comment_vote": {}
}