{
	"next_topic_id": 9,
	"topic": [
		{
			"topic_id": 1592307347,
			"title": "Active, but Where?",
			"body": "Where is the most active places on ZN? I've heard it's Millchan. Post links!",
			"added": 1592307346
		},
		{
			"topic_id": 1592460872,
			"title": "ZeroNet upload limit?",
			"body": "Can you use ZeroNet as a cloud storage? What is the file upload size limit on the best zites? \n\nJudging by {youtube - zeronet} it seems ZeroNet can't do big files (there are only a few videos there)...",
			"added": 1592460870
		},
		{
			"topic_id": 1592851444,
			"title": "Is Riot the Only Matrix Client that supports Calling?",
			"body": "Is Riot the Only Matrix Client that supports Calling? I would like to avoid insecure-javascript.",
			"added": 1592851441
		},
		{
			"topic_id": 1592851726,
			"title": "Does Riot have a Maximum upload of 10MB?",
			"body": "Does Riot have a Maximum upload of 10MB? That's nothing!",
			"added": 1592851722
		},
		{
			"topic_id": 1592964791,
			"title": "How to upload large videos to ZeroNet?",
			"body": "I am aware of the great site http://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/ but.. I am unable to publish even a small video there that actually plays. How to upload large videos to ZeroNet?",
			"added": 1592964786
		},
		{
			"topic_id": 1593159226,
			"title": "Any Jabber/XMPP client for Android V2?",
			"body": "Any Jabber/XMPP client for Android V2?",
			"added": 1593159220
		},
		{
			"topic_id": 1593220425,
			"title": "How to create my own torrent?",
			"body": "Provide a tutorial for how to create my own torrent file, preferably with the Tribler client. The trackers seems like the most difficult part.",
			"added": 1593220418
		},
		{
			"topic_id": 1593864721,
			"title": "Can't post on Kopy Kate?",
			"body": "Whenever I try to post on Kopy Kate my videos wont play :( http://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/",
			"added": 1593864713
		}
	],
	"topic_vote": {
		"1592460872_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji": 1
	},
	"next_comment_id": 23,
	"comment": {
		"1590579164_1G7AgufdSvApA47h2Y4JhFMViX1g5Q27ho": [
			{
				"comment_id": 1,
				"body": "Cool!",
				"added": 1592188692
			}
		],
		"1592307347_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji": [
			{
				"comment_id": 2,
				"body": "> [styromaniac](#comment_2341_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): http://127.0.0.1:43110/17gCoQDCAAoQkzKRiajFNUAhnVD2gSNmuC/?:17wWFMe7AyJx4qvFLfoepvQnGHTfcPG8N9:0\n\nThat seems like a fake. Perhaps this one is real Millchan http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/\nAnd for 08chan http://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/",
				"added": 1592326272
			},
			{
				"comment_id": 8,
				"body": "This place is pretty cool -> 127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/",
				"added": 1592649776
			}
		],
		"1592460872_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji": [
			{
				"comment_id": 3,
				"body": "> [styromaniac](#comment_2353_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): There's no limit. You might have to share without using a browser to do it though. [...]\n\nNot sure what Kave is. But what are the best zites for uploading large files. Could it be used as a cloud storage?",
				"added": 1592503333
			},
			{
				"comment_id": 5,
				"body": "> [styromaniac](#comment_2355_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Kave is a pretty but feature-lacking static site I made to demonstrate Local Peer Discovery. It has a lightbox and that's it, but because you have to drop files into its folder, it has no limits.\n\nLink to Kave?\nAnd why is it that ZeroNet-Youtube only has a few videos? Prove me wrong that ZeroNet can do large files!",
				"added": 1592505659
			},
			{
				"comment_id": 6,
				"body": "> [robione](#comment_559_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): ZeroNet is not in the cloud. So it cannot be cloud storage by default.It lives in a directory on your computer and syncs with others just like you.One CAN setup a cloud server with ZeroNet, and some have, as a supernode of sorts.\n\nI was just using the word cloud as an analogy, for something easy to explain. \"If you can't explain it simply, you don't understand it well enough.\" - Albert Einstein",
				"added": 1592537116
			},
			{
				"comment_id": 7,
				"body": "> [styromaniac](#comment_2356_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Kave [...]\n\nMaybe I wasn't clear enough. POST THE LINK!\nI would like to see the Kave zeronet website.",
				"added": 1592537272
			}
		],
		"1591821395_19ev8HmfPQ2VC8aWDA4Ck7E2vLYDYFgw9P": [
			{
				"comment_id": 4,
				"body": "> [frankwalter](#comment_17_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV): P2P doesn't work for archiving. It's basically the opposite. A library archive all, not only what people like.\n\nYou frank(ly) are the only person that gets it. Peer to peer networks are the opposite of archiving. All peer to peer networks including freenet, zeronet, and IPFS companion only keep popular content alive, and everything else gets deleted. I believe it's more important for now to backup archive.org locally, and concern with hosting later.",
				"added": 1592503893
			}
		],
		"1593004202_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 9,
				"body": "Tribler is the only convenient way to download with BitTorrent in a somewhat anonymous way. It's overall the best we have.",
				"added": 1593012997
			},
			{
				"comment_id": 10,
				"body": "There is no other BitTorrent client that hides your IP by default other than Tribler. Vuze is propitiatory. qbittorrent is so not trivial easy to hide your IP that it is not even worth mentioning. VPNs are not anonymous. Running BitTorrent over Tor is immoral. Tribler is really the best choice.",
				"added": 1593051186
			},
			{
				"comment_id": 12,
				"body": "> [styromaniac](#comment_2380_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Tribler is BitTorrent over Tor...\n\nI think they use the word tor as a marketing word. But actually they use their own network.",
				"added": 1593148529
			},
			{
				"comment_id": 13,
				"body": "> [fallfield](#comment_3_1NQ7GwEXMq5xX8FVL4hYdpycp3pomCQdUX): strongly disagree. I find quite easy and wanted to propose this alternative to the op. IDK about Tribler. However don't load too much the tor network with stupid data plz... or run node, exits specially.\n\nI2P is the least user friendly darknet I've tried. qBitTorrent through I2P tutorial link plz.",
				"added": 1593148766
			},
			{
				"comment_id": 14,
				"body": "> [randomsomething](#comment_5_1KQ9pv3yn43LLq1joonQjgBsZiJQSa4a6t): and for biglybt ? it s vuze open source\n\nLink?",
				"added": 1593148791
			},
			{
				"comment_id": 15,
				"body": "> [styromaniac](#comment_2388_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You can run it as an exit node. It's definitely using Tor, with some control over how many hops it takes. You can also chose not to proxy. Hell, ZeroNet uses Tor if you need it and it's not vastly different.\n\nTribler does not use Tor. Tribler users can opt in to be a volunteer to be a proxy in its own network. Most importantly ZeroNet has JavaScript turned ON which means your anonymity gets POPED. Not an issue with Tribler.",
				"added": 1593158580
			},
			{
				"comment_id": 18,
				"body": "> [anonymouslogin](#comment_211_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Tribler would be a good anonymous torrent client if it worked. And a internal proxy network would be much better in which everyone participates. If a proxy network is voluntary, there is too much chance of sabotage. But it is a typical example of software that constantly has such serious bugs that make the software unusable for years to come. Unfortunately, there is plenty of software that many users would need, but they struggle with so many bugs that they are unusable for this users. And these are serious mistakes that happen right away when the user try the software. These are such serious mistakes that it can be said to be shoddy work. And a lot of software if I try it years later i see the same problem. There is currently no torrent client that works without an external proxy or VPN service except Tribler. And for torrenting, these services are all paid. The I2P network offers a similar opportunity, but it cannot connect to non-I2P clients, and that way it doesn't work. Tribler can connect to anyone if it works in anonymous mode. Nowhere else has anyone been able to say a free and easy anonymous torrenting option that works for everyone. Outside Ttribler, there are only paid services for anonymous torrenting. Free VPN or Proxy services or Tor are not compatible with torrent protocoll. [...]\n\nThe reason they switched it from enabled by default to voluntary was to cover up the bad image they were getting.",
				"added": 1593219443
			}
		],
		"1592964791_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji": [
			{
				"comment_id": 11,
				"body": "> [caropc1v19](#comment_4_13MGjZN6mG4ayuhPH4y9YjycCAd539MULm): you can also download some video from the site and check the video settings, used codecs and etc.there are and I think that sometimes it doesn't send the files, if you are using the connection only via TOR. [...]\n\nWe need an investigation on whether it is possible to upload to Big-Kopy-Kate with Tor.",
				"added": 1593051312
			}
		],
		"1593159226_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji": [
			{
				"comment_id": 16,
				"body": "> [satoxyn1](#comment_126_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): Conversations should be your main choice if you don't need contact grouping and statuses. It's the leader in stability and feature-wise. It supports Jingle audio/video calls.\n\nConversations only goes back to Android 4. aTalk supports back to Android 5. I need something that supports Android version 2!",
				"added": 1593216718
			}
		],
		"1593195001_13gz7jEayVZjubcAGS16kR3Ze4RJSgVFVw": [
			{
				"comment_id": 17,
				"body": "Don't just use Linux on your computer. Also use: 1. ME-Cleaner 2. Devuan 3. Librem 5.",
				"added": 1593217811
			}
		],
		"1593220425_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji": [
			{
				"comment_id": 19,
				"body": "> [anonymouslogin](#comment_213_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Use Utorrent to do this. Tribler's create a torrent file function it works poorly. But associating existing files with torrent files can also be problematic with Tribler.\n\nUtorrent is proprietary",
				"added": 1593240136
			},
			{
				"comment_id": 20,
				"body": "> [satoxyn1](#comment_128_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): Download any common torrent client, like µTorrent, qBittorrent, Vuze etc. Get trackers from here. Choose files you want to add into torrent and generate the torrent file.\n\nDoesn't work. Just says downloading metadata forever.",
				"added": 1593487170
			}
		],
		"1593864721_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji": [
			{
				"comment_id": 21,
				"body": "> [styromaniac](#comment_2415_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It's a codec issue with the browser.\n\nSolution?",
				"added": 1593926265
			}
		],
		"1594482857_1Cd3SNBmpyQcJ1cvmMkBqn1ozbUqL9wJo7": [
			{
				"comment_id": 22,
				"body": "yes",
				"added": 1594615578
			}
		]
	},
	"comment_vote": {
		"2_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG": 1,
		"1_13MGjZN6mG4ayuhPH4y9YjycCAd539MULm": 1
	}
}