{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"3_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": 1
	},
	"next_comment_id": 6,
	"comment": {
		"3_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 1,
				"body": "И тут из леса вышел троль",
				"added": 1549633017
			},
			{
				"comment_id": 2,
				"body": "Троль с недоверием понюхал морс, помялся и достал из рюкзака грубо сделанную бутыль с тролиным самогоном",
				"added": 1549645189
			},
			{
				"comment_id": 3,
				"body": "> [mistalero](#comment_8_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Внезапно гном поморщился и чихнул. Да так смачно, что порывом ветра от его чиха у гитариста выбило кружку из рук.\n> \n> Прошу прощения, господа, - сконфуженно произнёс гном, подобрал подкатившуюся к нему посудину и принялся своей же банданой тщательно её вытирать со всех сторон, в том числе и внутри.\n\nНу раз отравление не удалось, надо спеть, а вы увважаемый гном, сполосните от яда и эту, вывалившуюся кружку и ещё парочку что у меня в рюкзаке, а я пока спою. Сказав это гитарсит перехватил свою старую гитару и от всей души, но совершенно не попадая по струнам начал распевать старую разбойничью песню,  про работников ножа и топора, романтиков с большой дороги....\n\nИ таки да самогон тролиный был весьма годен и его вонь уже не казалась всем собравшимся противной - выпить захочешь не так раскорячешься!",
				"added": 1549906256
			},
			{
				"comment_id": 4,
				"body": "Троллиный самогон понравился всем. Сначала фляжка совершила один круг, потом второй, потом третий, после четвёртого круга все перестали замечать вонь от этого прекрасного пойла.\n На пятом кругу начались чудеса - гитаристу начало казаться что вокруг костра собрался хоровод из мухаморов.  Ему чудилось что красношляпые грибы весело танцуют джигу и напевают песню \"ах эти ножки\" под мелодию из церковных латинских песнопений...",
				"added": 1550058853
			},
			{
				"comment_id": 5,
				"body": "> [mistalero](#comment_10_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Когда гном вернулся с ручья, держа в охапке посуду, все уже валялись, ни на что не реагируя.\n\nДух гитариста отделился от тела, он видел себя как бы со стороны. Гитара,  кружки, рюкзак собравшиеся вокруг костра и гном были где то внизу а вокруг был океан зелени - коллективная душа леса",
				"added": 1550137422
			}
		]
	},
	"comment_vote": {
		"5_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": 1,
		"7_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": 1,
		"1_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1,
		"6_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": 1,
		"1_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": 1,
		"2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1,
		"10_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": 1
	}
}