{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1562441425,
			"title": "Using Maltego to find Persons, Company infrastructur and alike",
			"body": "What is Maltego? https://www.paterva.com/buy/maltego-clients/maltego-ce.php\nMaltego is an interactive data mining tool that renders directed graphs for link analysis. The tool is used in online investigations for finding relationships between pieces of information from various sources located on the Internet.\n\nMaltego uses the idea of transforms to automate the process of querying different data sources. This information is then displayed on a node based graph suited for performing link analysis.\n\nCurrently there are three versions of the Maltego client namely Maltego CE, Maltego Classic and Maltego XL. This page will focus on Maltego Community Edition (CE).\n\nAll three Maltego clients come with access to a library of standard transforms for the discovery of data from a wide range of public sources that are commonly used in online investigations and digital forensics.\n\nBecause Maltego can seamlessly integrate with nearly any data source many data vendors have chosen to use Maltego as a delivery platform for their data. This also means Maltego can be adapted to your own, unique requirements. Our current data partners can be found on the Transform Hub page linked to below.\n\nWhat does Maltego do?\n\nThe focus of Maltego is analyzing real-world relationships between information that is publically accessible on the Internet. This includes footprinting Internet infrastructure as well as gathering information about the people and organisation who own it.\n\nMaltego can be used to determine the relationships between the following entities:\n\n---- People.\n--------- Names.\n--------- Email addresses.\n--------- Aliases.\n--- Groups of people (social networks).\n--- Companies.\n--- Organizations.\n--- Web sites.\n--- Internet infrastructure such as:\n------ Domains.\n------ DNS names.\n------ Netblocks.\n------ IP addresses.\n--- Affiliations.\n--- Documents and files.\n\nConnections between these pieces of information are found using open source intelligence (OSINT) techniques by querying sources such as DNS records, whois records, search engines, social networks, various online APIs and extracting meta data.\n\nMaltego provides results in a wide range of graphical layouts that allow for clustering of information which makes seeing relationships instant and accurate – this makes it possible to see hidden connections even if they are three or four degrees of separation apart.",
			"added": 1562441424
		},
		{
			"topic_id": 1562451724,
			"title": "A dark theme for ZeroMail!",
			"body": "Title says it all. I'd be pleased to use ZeroMail with a dark / night theme",
			"added": 1562451722
		}
	],
	"topic_vote": {
		"1562283050_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1562198429_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1
	},
	"next_comment_id": 17,
	"comment": {
		"1562198429_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "I can easily see from what h3bhkj5gqz4n3pjm is writing everywhere on Zero that either he is the greatest troll Zero have seen OR he is a \"know it all\" person that HAVE TO rant about it \"online\"... Cuz you know.... 127.0.0.1 xD\n\n> [filips](#comment_64_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): I want to say that Firefox has better privacy than any of Chromium based browsers. Even if some \"tracking features\" are enabled by default, you can disable them, unlike in Chrome. [...]",
				"added": 1562349975
			},
			{
				"comment_id": 2,
				"body": "> [brianhanson2nd](#comment_10_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE): I'm using Brave on Linux Mint 19.1 without any issues, just followed the instructions here: https://brave-browser.readthedocs.io/en/latest/installing-brave.html#linux\n\nI'm not sure if this is facts... because internet tells lies... But from what I know / read. I've understood that Brave Browser is spying on it's users. Like I said I might be wrong. But if i'm right.... then brave browser is nothing but a RAT...",
				"added": 1562350133
			},
			{
				"comment_id": 3,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_411_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): don't worry i don't need you. but you need me to make your life more miserable 'that it already is lol'.\n\nI assume millenials like you belive way too much in yourself. Nice of you to assume my life is misarable, hehe.",
				"added": 1562355249
			},
			{
				"comment_id": 4,
				"body": "> [brianhanson2nd](#comment_10_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE): I'm using Brave on Linux Mint 19.1 without any issues, just followed the instructions here: https://brave-browser.readthedocs.io/en/latest/installing-brave.html#linux\n\n Brave Browser is a Chromium fork with many interesting features not found elsewhere, such as built-in Adblock and other extensions, fingerprinting protection, cleaner Preferences menu than other Chrome forks, and the (opt-in) ability to automatically support (pay) the websites you visit. The developers describe it as\n\n\"A browser with your interests at heart.\"[1]\n\n, and the built-in privacy protections would seem to agree with that, but let's see how it stacks up when we take everything into account.\nSpyware Level: High\n\nAuto-updates that can be turned off only by hacky workarounds. Google as default search engine. Analytics on Brave's home page. Two other requests made at each start of Brave. Whitelisting spyware from Facebook and Twitter.[5] Has some decent privacy protections built in, but uMatrix is still better. Some privacy features are there by default, but, it's still trying to work with advertisers (same as Mozilla did with their Sponsored Tiles). Despite claiming to be \"A browser with your interests at heart.\"[1], it has Google as default search engine, as well as shitty forced updates. Anyway, despite the privacy protections, you should stay away from this browser - it seems to have a \"mission\" to switch the internet to its version of \"user-respecting\" ads, (we know how that turned out for Mozilla), and that's slimy and suspicious. Beyond that it has repeatedly shown itself to be dishonest and disingenuous about what it's mission and goals and operations are.\nWhitelisting spyware from Facebook and Twitter\n\nOn it's website, Brave claims that \"Brave fights malware and prevents tracking, keeping your information safe and secure. It’s our top priority.\"[6]. Yet despite this claim, Brave actually disables its tracking protections for Facebook and Twitter's spyware scripts that allow them to track people across the web.[5] Brave's spyware protections, and any claims that it makes to work in the interests of it's users, cannot be taken seriously. Brave is actively working against its users while lying to them about supposed privacy protections that it offers. This problem becomes even more serious when you take into account Brave's response to this situation:\n\n\"Loading a script from an edge-cache does not track a user without third-party cookies or equivalent browser-local storage, which Brave always blocks and always will block. In other words, sending requests and receiving responses without cookies or other means of identifying users does not necessarily create a tracking threat.\" [7]\n\nThis statement is just, completely wrong. Just because a website isn't able to store cookies, does not mean that it cannot uniquely identify you. Executing JavaScript spyware from Facebook and Twitter is more than enough. Blocking cookies is not going to stop them from tracking you. This isn't even information that is difficult to verify. There are many websites that you can visit, right now, to see just how much information a JavaScript program designed to track you can get. Here are a few:\nhttps://browserleaks.com/\nhttps://panopticlick.eff.org/\n\nINFO SOURCE:\nhttps://spyware.neocities.org/articles/brave.html",
				"added": 1562355567
			},
			{
				"comment_id": 5,
				"body": "Any thoughts? https://about.riot.im/",
				"added": 1562356077
			},
			{
				"comment_id": 6,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_414_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): i thought i wasn't necessary, apparently i am.because you're still asking.\n\nMore daddie",
				"added": 1562358268
			},
			{
				"comment_id": 10,
				"body": "> [styromaniac](#comment_755_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): All the more reason to dislike Mozilla, Claiming trademark over the word fox.\n\nWhat does the fox say xD",
				"added": 1562422450
			}
		],
		"1562356977_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 7,
				"body": "You are still a freshmen on Zero... With an opinion. That's all it is.. A opinion...",
				"added": 1562368039
			},
			{
				"comment_id": 9,
				"body": "> [xeorian](#comment_2_1CvZDPgKk2p8Uk1ZfJ3hcZb1DzuNJXndhn): an*\n\na",
				"added": 1562422267
			},
			{
				"comment_id": 11,
				"body": "> [przvl](#comment_1_12X6g1LP25pT2XEMNR239xgrUnEktRVb9o): why\n\nI see what you did there przvl (Ready Player One)",
				"added": 1562439834
			}
		],
		"1562104865_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 8,
				"body": "h3bhkj5gqz4n3pjm is just Zero spam... Please ignore it's exsistance.",
				"added": 1562368151
			}
		],
		"1562441425_1LTyhYhYUFzBnX3YDeemKeDnFSncCUnPRa": [
			{
				"comment_id": 12,
				"body": "As an OSINT operator 600 USD is cheap for this amazing tool",
				"added": 1562449848
			},
			{
				"comment_id": 13,
				"body": "Pricing\n\tProduct \tInitial Price \tRenewal Price\nDesktop \tMaltego Classic \t$999 \t$499\nMaltego XL \t$1999 \t$999\nServer \tCTAS \tStarting from $40,000.00 including training.\nITDS\n\nComms\n\nTerms\n\n    Initial Purchase Price effective from 1st of August 2018.\n    Renewal Price effective for renewals after 1st of September 2018.\n    For orders of more than 10 licenses please contact support@paterva.com for a discounted quotation.\n    For academic discounts, please contact support@paterva.com.\n    Prices shown are for standard agreements. For specialised contracts, pricing may vary. Please contact us.",
				"added": 1562450067
			},
			{
				"comment_id": 14,
				"body": "Soo It's not 600 usd anymore",
				"added": 1562450084
			},
			{
				"comment_id": 16,
				"body": "If anyone have a License Key to Maltego Classic or Maltego XL and want to share it. I'm reachable on ZeroMail - madroad@zeroid.bit",
				"added": 1562451633
			}
		],
		"1562446077_1HVtb9ohKcH19u1Cp3WrwTJipYdm1P6ceE": [
			{
				"comment_id": 15,
				"body": "> [filips](#comment_67_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): This are some things that I think are important: [...]\n\n+5",
				"added": 1562450359
			}
		]
	},
	"comment_vote": {
		"1_1LTyhYhYUFzBnX3YDeemKeDnFSncCUnPRa": 1,
		"2_1LTyhYhYUFzBnX3YDeemKeDnFSncCUnPRa": 1,
		"67_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1
	}
}