{
	"title": "中国毛派联合",
	"description": "全世界无产者联合起来",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 6,
	"demo": false,
	"modified": 1463391785,
	"post": [
		{
			"post_id": 5,
			"title": "活动预告",
			"date_published": 1463390920.786,
			"body": "中国毛派韶山之光 IS语音频道：1082465 《今晚八点整：辉煌发表重要演讲——隆重纪念无产阶级文化大革命全面胜利50周年的目的是，全国毛派组织起来，在马列毛主义旗帜指引下，继承文革造反有理的精神、继承文革向资产阶级夺权的原则，推翻修正主义集团的统治。使政权重新回到真正的马列毛主义者手里！》"
		},
		{
			"post_id": 4,
			"title": "中国毛派联合二次会议〈纪要〉",
			"date_published": 1463129940.637,
			"body": "      开创社会主义再革命的新阶段 \n      ____“中国毛派联合”《二次会议纪要》\n\n    近期，继洛阳会议之后，中国毛派联合再次召开会议。现将会议纪要公布如下：\n  会议主要讨论：1、总结洛阳会议以来的斗争经验；2、确定开创毛派斗争新阶段的政治任务；3、强化中国毛派联合的斗争能力。\n    会议的胜利召开，证明“中国毛派联合”反对修正主义上台、反对资本主义复辟的斗争在前进、在发展，更证明广大中国人民反对修正主义上台、反对资本主义复辟的斗争在前进、在发展。“中国毛派联合”仅仅是现在中国社会主义再革命力量中的一支先锋队。亿万人民正在觉醒，正在组织，正在行动。人民要革命，中国要进步，这是历史发展的必然，也是历史发展的方向，是任何反动势力，包括修正主义法西斯专政，都无法阻挡的。\n    会议的召开，也证明毛主席发动文化大革命，锻炼培养反对修正主义、坚持马列毛主义的革命事业接班人的伟大战略部署正在起作用。修正主义反动派，可以一时抹黑毛主席，可以一时抓捕无产阶级革命家、革命派，但是，他们推不倒毛主席留下的革命力量。相反，他们的倒行逆施，从反面再次教育了毛主席培养的革命事业接班人，使他们更加深刻地理解了毛主席关于反对修正主义的思想、理论，更加激发了他们反对修正主义的决心、勇气。修正主义统治者那样仇视“文革余孽”，也从反面证实了一切反动派对无产阶级革命派决心继续进行社会主义再革命这一事实的恐惧。\n  “中国毛派联合”就是在这样的正反两方面的教育中诞生并成长起来的政治力量。\n    会议的召开，还证明一切愿意反对修正主义上台，反对资本主义复辟的同志都是可以团结的。会议本身就是一次团结的会议。事实证明，只要我们坚持马列毛主义的指导，坚持反对修正主义上台、反对资本主义复辟的大方向，理解团结的重要意义，敞开真诚团结的胸怀，团结不仅是必要的，而且是可能的。我们正在逐步走向大联合、大团结，我们联系的革命群众的队伍越来越广大。\n    尤其令我们倍感鼓舞的是，“中国毛派联合”的斗争，受到了毛主席司令部经历了牢狱之灾而幸存下来的无产阶级革命家的亲切指导。他们虽然已经高龄，但因为都曾经接受过毛主席的直接领导和教育，尤其在文化大革命的复杂斗争中经历过磨难，所以具有很高的马列毛主义水平和非常坚定的无产阶级革命立场，在他们的亲切关怀和指导下，我们更有夺取胜利的信心。\n    同时，我们还有一部分当年接受过毛主席检阅，并在随后近五十年的严峻的阶级斗争中得到了锻炼的无产阶级革命战士。他们是毛主席亲自培养的无产阶级革命事业的接班人，是社会主义再革命的不熄火种。毛主席曾经接见过一千多万红卫兵，这些红卫兵中的大多数都不会忘记毛主席的厚望。这些同志虽然也已六、七十岁，但依然是目前这场伟大斗争的不可替代的领导力量、中坚力量。\n      正在如潮水般地涌入“中国毛派联合”的广大的中、青年革命同志，则是我们进行这场伟大斗争的主力军。他们大多来自广大工农群众（包括各阶层、各群体）和知识界、文化界的进步青年，他们都深受资本主义的残酷剥削，深受修正主义法西斯专政的压迫，社会主义再革命的愿望最迫切，斗争意志最坚定，他们大多既有文化、又有知识，并读过一定数量的马列毛著作，有初步的马列毛主义理论基础，他们是反对修正主义统治、反对资本主义复辟的牢不可破的阶级基础，在他们的身上寄托着社会主义再革命必然胜利的希望。\n      代表这些最基本最革命的阶级力量的这次会议，体现的是阶级的团结，阶级的联合，阶级的觉悟，阶级的行动，是行将到来的社会主义再革命的阶级准备，其历史意义不可低估。\n　　　会议的诸多共识有：\n　　　1、会议首先强调，我们是马列毛主义的共产主义者、共产党人。“毛派”一语不过是在中国现在特定的历史环境下，表达我们是坚持毛泽东主义，捍卫毛泽东主义，反对邓小平修正主义的阶级群体、政治群体。马列毛主义是指导我们思想的理论基础。学习马列毛主义，读马列毛著作，是我们的不可动摇的基本功。一切毛派同志必须牢记，马列毛主义是不会自发地从自己的头脑里产生的，既使来自工农的同志，既使参加过大量阶级斗争实践的同志，都是这样。要掌握马列毛主义，要改造自己的头脑，只有听毛主席的话，认真读马列毛的书，认真钻研马列毛主义的理论。永远不要忘记“我党真懂马列的不多”这个历史教训和为此付出的历史代价。越是工作忙，越是斗争复杂尖锐，越是要挤出时间读马列毛。这要作为我们“中国毛派联合”的一个政治原则为每一位同志所遵守。没有调查，就没有发言权；同样，不读马列毛，也没有发言权。\n      理论要联系实际，读书也要联系实际。会议代表一致认为，联系当前的反修斗争大业，我们特别要认真学习毛主席关于反对修正主义专制，反对资本主义复辟，坚持社会主义革命的理论、路线、方针、政策，同时，还要学习列宁领导十月革命的理论、路线、方针、政策。二者都完全符合或大体符合我们面对的现实斗争的实际需要，都对我们进行当前的斗争具有直接的现实的指导意义。\n      为了真正落实这一学习任务，保证和方便同志们学习，会议决定组织人力尽快编选毛主席和列宁的有关语录集。\n      2、会议认为，斗争实践证明，《洛阳会议纪要》对于目前中国社会基本矛盾、阶级矛盾、主要矛盾以及由此而决定的革命性质、革命动力、革命形式的诸多分析，都是基本正确的，是我们需要继续坚持和贯彻的理论、路线、方针。\n       现在，正是围绕我们究竟面对着怎样的历史任务这个最根本、最要害的问题，我们和一些同志发生分歧。他们以要“打倒”、要“推墙”等大帽子，给“中国毛派联合”，给洛阳会议罗织罪名。这是完全错误的。\n      攻击我们的人，否定在中国已经发生资本主义复辟的事实。所谓“中国还处在社会主义道路和资本主义道路的十字路口”的说法，所谓中国现在是“半民主社会主义社会”的说法，都是妄图以惯用的折中主义的手法，掩盖在中国已经发生资本主义复辟、已经发生根本的阶级关系变动、无产阶级专政已经蜕变为资产阶级专政的事实。这是历来的修正主义的世界观、方法论的特点，这正是修正主义。\n        \n      这是一个不容抹煞的根本区别，抹煞了这个根本区别，只就“中国共产党”这个名称谈问题，这是修正主义的抹煞事物本质的欺骗手法。\n      判断一个党的性质，主要要看这个党实际执行的是什么路线。不是看这个党在口头上讲什么，而是看这个党在实际上做什么。40年的历史证明，现在执政的中国共产党，实际执行的是邓小平的修正主义路线。而且，40年来一以贯之，不动摇，不改变，直至今天。\n       实践证明，这是一条彻头彻尾的资产阶级路线。 放弃“阶级斗争为纲”并不等于这条路线真的不讲阶级斗争。不是的。邓小平修正主义者放弃的只是无产阶级对资产阶级的阶级斗争，实际加强的是资产阶级对无产阶级的斗争、是资本主义和社会主义的两条道路的斗争，一句话，是复辟资本主义。\n      不是我们乱发明，不是我们搞极左，而是老老实实地按照毛主席的教导，我们不得不沉重地承认，曾经伟大的光荣的正确的中国共产党现在已经堕落为修正主义党、法西斯党、资产阶级党。这个党的领导人已经堕落成了资产阶级的代表人物，甚至是法西斯代表人物。这些领导人扮演的历史角色，绝不是代表个人，而是代表阶级。正是这样的党、这样的党的领导人，领导了在中国复辟资本主义。这部令真正的共产党人无比痛苦的历史正在继续。这个党，这个党的领导人，至今没有丝毫的改变。如果谈论是谁要打倒并且已经打倒了中国共产党，只要尊重事实，就应该承认正是邓小平修正主义路线、邓小平修正主义集团打倒了真正的革命的中国共产党。\n      在这种情况下，要我们去“挺”这个党，去“挺”这个党的领导人，难道不就是要我们去“挺”资产阶级，去“挺”资本主义复辟，去“挺”法西斯专政，去“挺”资产阶级剥削压迫工农群众吗？这是我们绝不允许的，极力反对的，更是我们绝对不会去做的。我们不愿扮演这样的历史丑角。谁愿意扮演这样的丑角是他们自己的事情，但是，请不要玷污“毛派”这个光荣的称号。\n        口头上讲阶级斗争观点，一遇实际问题，就忘记、放弃了阶级斗争观点，这正是修正主义者失足的思想上、世界观上的原因。我们千万不要忘记这个历史教训。我们必须坚持用阶级观点分析、认识修正主义。修正主义上台，这是一个阶级的现象，是阶级斗争，是阶级斗争的结果、以及由此带来的必然的阶级关系的变动。修正主义统治者的阶级本性是不会改变的。我们不能对修正主义统治者抱不切合实际的幻想。阶级斗争只能用阶级斗争的方式去处理。结束修正主义的统治只能靠革命，只有革命一条路。\n      根据毛主席的教导，在党变修、国变色的情况下，我们依然不会否定中国共产党的广大党员、广大干部是好的，是要革命的，是不赞成搞修正主义的。但是，不能否定的是，八千万共产党员至今并没有改变修正主义路线在全党占统治地位的这个历史和现实。在苏东和中国发生剧变时，可悲在于“竟无一人是男儿”。这个事实是严酷的，是我们不能不正视的。面对这样的事实，说任何空话都无济于事，唯一正确的策略只能是鼓动广大党员、广大干部觉悟起来，造修正主义的反。\n      如何正确认识和正确对待现在的中国共产党，如何正确认识和正确对待篡夺了中国共产党领导权的修正主义集团，是一个大是大非问题。从国际共产主义运动的历史经验看问题，现在在毛派内部发生的分歧，实质是毛派内部的两条思想政治路线的斗争。我们不回避这种斗争，也不畏惧这种思想政治路线的斗争，我们深知，只有清除了这种极端错误的思想政治路线的干扰，才能更好地开展反对修正主义统治的斗争。我们对于极个别的投机的机会主义头面人物不抱幻想，正如毛主席所说，机会主义路线的头子改也难。我们把开展这一思想斗争的落脚点、重点，放在帮助广大毛派同志接受马列毛主义的思想和政治路线，从而在接受正确的思想和政治路线的基础上觉悟起来、团结起来，发扬无产阶级的革命造反精神，敢于斗争，敢于胜利。\n      3、中国已经是一个资本主义社会。但是，又是一个修正主义打造的特殊的怪胎的资本主义社会。以修正主义为政治特征的这一特殊的具有极大的欺骗性的，打着红旗反红旗为其统治的基本特征的资本主义社会，为社会主义再革命带来了特殊的复杂性、艰巨性。我们要充分认识这一点。这也是近四十年来中国历史走了弯路，我们迟迟没有起来斗争的一个重要原因。\n      因此，展开对修正主义复辟资本主义罪行的事实揭露和理论批判，始终是社会主义再革命的必不可少的思想准备、思想发动。没有革命理论的普及，没有人民群众的普遍觉悟，就没有社会主义再革命。不要忘记，任何一次革命，总要先造成舆论，总要先做意识形态方面的工作，这是普遍真理。\n      多年来，我们已经做了这方面的大量的工作。但是，还不够。还要继续努力做下去。 一方面，要结合实际，从理论上说明，修正主义上台，就是资本主义上台，就会搞资本主义复辟，而且是最坏的资本主义，法西斯主义；又要结合实际，从理论上说明，必须敢于反对修正主义，必须敢于对修正主义实行造反有理，不然劳动人民就要像过去的四十年那样，在阶级压迫和阶级剥削中苦苦挣扎，永远也得不到解放。\n        另一方面，还要结合活生生的现实中正在发生的劳动人民的苦难，去揭露修正主义复辟资本主义的残酷的阶级本性，启发人民群众的阶级感情，帮助人民群众觉悟起来，主动地积极地投身到社会主义再革命运动中来。\n      阶级的觉悟是靠阶级的理论培育的。一旦马列毛主义的革命理论武装了群众，社会主义再革命就有了胜利的把握。同志们要反复体会革命导师的老话：理论的批判，不能代替物质的批判，但是，理论一经为群众所掌握，就会变成巨大的物质力量。\n      历史经验告诉我们，修正主义路线是一条资产阶级的路线。和它们的斗争，有两种情况。一种是混入革命毛派内部的投机分子和机会主义分子，从内部起破坏作用，如长期存在的保救派思潮；还有一种是来自执政的修正主义集团的破坏和干扰。\n      我们必须对内外这两种错误路线都要进行批判，并处理好其中的斗争策略。\n      阶级斗争是纲，路线斗争是纲。路线斗争是阶级斗争的集中表现，阶级斗争是路线斗争的本质和基础。我们的理论批判，要始终紧紧抓住路线斗争这个纲。坚持马列毛主义的阶级斗争的路线，批判邓小平的修正主义的取消阶级斗争的“猫论”路线。把道理讲清楚，讲彻底，讲好，才能使人民群众觉悟起来，发动起来，完成社会主义再革命、重建科学社会主义社会的伟大历史使命。\n      今年，适逢毛主席发动文化大革命50周年。我们完全可以抓住这个契机，掀起一个学习马列毛主义理论、特别是反对修正主义理论的高潮。我们要借这个机会，大力宣传毛主席关于无产阶级专政下继续革命的理论，抵制、批判修正主义的理论，并结合我们亲身经历的文化大革命的经验教训和这四十年资本主义复辟的残酷事实，认识这些理论的深刻性、正确性、重要性，弄懂、弄通这些理论，用这些理论武装广大民群众的头脑，从而为发动社会主义再革命做好思想准备、理论准备。\n     4、会议再次重申，自马克思主义创立以来，革命导师一再教导我们，“工人阶级的解放是工人阶级自己的事情”。文化大革命中，毛主席又一再告诫我们，人民群众要自己解放自己。社会主义革命运动是人民群众的革命运动。没有人民群众运动就没有社会主义革命运动。毛主席晚年一再指挥我们唱《国际歌》，说《国际歌》唱的都是马克思主义的道理，并且说，“不仅要唱，还要照着做”。\n    形势发展到今天，仅仅做网络斗争是远远不够的，也不能只在知识分子的圈子里打转，要大胆依靠工农青年一代，历来的革命都是工农为主力军的。最近我们提出，“走出网络，走进工农”，是完全正确的。我们一定要把依靠工农，深入工农，发动工农，掀起工农运动是摆在我们一切基础工作的首位。我们要把工农的经济斗争、维权斗争和争取民主、争取政治自由的斗争结合起来，要把经济斗争、维权斗争，提高到阶级斗争、政治斗争的高度。\n    会议号召，同志们要不畏高压，不怕困难，到工农中去，扩大“中国毛派联合”的政治影响，提升工农运动的阶级水平、斗争水平。\n        与这一斗争同步，在适当的时机，从组织上把中国工农群众联合起来。\n    我们要把马列毛主义、特别是毛泽东主义，关于反对修正主义、进行社会主义再革命的理论、路线、方针、政策宣传给人民群众，统一人民群众的革命思想，统一人民群众的阶级意志，展开反对修正主义、反对资本主义的伟大的社会主义再革命运动。\n    我们这样做，无非还是坚持革命导师的一贯思想：只要人民群众起来了，中国就有希望了。\n     5、在法西斯专政条件下，斗争的形式是一个绝不可忽视、绝不可掉以轻心的重要的问题。必须敢于斗争，善于斗争。不敢斗争，畏惧牺牲，是完全错误的。但是，不顾条件，不顾可能，不善于合法斗争，一味盲动，造成不必要的牺牲，也是完全错误的。斗争是一门艺术。这门艺术可以有无限的创造。工农是创造这门艺术的大师。只要我们深入工农、尊重工农，我们就会找到合适的正确的斗争形式。同时，我们还要向我们的先辈们学习，共产党人在白色恐怖下创造的斗争经验是给我们留下的宝贵法宝。我们要继承这些法宝，学会使用这些法宝，发扬光大这些法宝。\n      6、会议强调，社会主义再革命，是人民群众的革命，进行这样的革命，必须坚持毛主席的团结一切可以团结的力量，结成最广泛的人民革命统一战线的思想。\n　　　社会主义再革命，是由无产阶级领导的（经过共产党），是以工农阶级、包括站在工农阶级一边愿意投身社会主义再革命的广大干部、广大党员、广大知识分子为主体的革命。同时，为了成功进行这一革命，还要团结一切可以团结的劳动者阶级的革命群众、包括从事劳动的小资产阶级的革命群众，联合一切可以联合的反对法西斯专制统治的集团、阶层、政治力量，从而结成最广泛最有力量的社会主义再革命的统一战线，孤立打击最反动最凶恶的以修正主义、法西斯专制为其政治特征并执掌政权的官僚垄断资产阶级及其死心踏地依附于这个阶级的私营资产阶级的某些政治势力和公开或不公开支持、操纵这个阶级的外国垄断资产阶级的某些政治势力。\n      会议认为《洛阳会议纪要》对私营资产阶级的（不包括个体劳动者）分析是正确的。私营资产阶级是“改革开放”的最大受益者，是靠“权钱交易”、残酷压迫剥削工人阶级起家的暴发户，而且身上有浓厚的封建性，这和他们当中相当一部分人本身的出身以及他们扎根的中国社会的特点决定的。他们的命运是和官僚垄断资产阶级的命运紧紧连在一起的。必须看到，正是法西斯资产阶级专制给他们带来了一切，因此，一般说来，这个阶级不但不会是反对专制的民主派，而会是维护专制统治的阶级基础。不要忘记，我们进行的是社会主义再革命，这是一场革资产阶级命的革命，我们的反对专制，争取民主，争取生存是和这一革命的阶级性质相统一、相联系的。这和向封建主要民主、要政权的资产阶级民主主义革命有历史阶段、阶级属性的根本区别。我们要从私营资产阶级的实际政治表现出发，正确决定我们对这个阶级的政治策略，力求避免各种形式的“左”的或“右”的做法。\n      我们这样说，并不否认，在特定条件下，在特定的时间、地点，私营资产阶级和官僚垄断资产阶级会发生矛盾，我们并不反对在特定条件下，利用愿意反对法西斯专制的资产阶级政治力量。我们尊重事实，一切从实际出发，而绝不从本本出发，作教条的硬性的先验的规定。\n      资产阶级知识分子群体，情况更复杂得多。对于其中的社会民主主义派，我们要有符合实际的全面的正确的分析。在反对法西斯专制的斗争中，我们与这些派别有可能实行暂时的联合，但是，在未来中国的走向、道路问题上，我们与他们必然会发生不可调和的斗争。\n      我们必须坚持阶级分析的方法，坚持阶级斗争的观点。这里最重要的问题就是必须坚持无产阶级的领导权，不能作资产阶级民主派的尾巴。这是由中国革命的历史经验证明了的，也是由国际共运史的历史经验证明了的。\n      7、会议重温了马列毛革命导师关于建设无产阶级政党的思想和理论。坚信列宁的教导，无产阶级在争取政权的斗争中，唯一的武器就是组织。会议强调，在党变修、国变色的法西斯资产阶级专政的特殊历史条件下，组织工作迫切而艰难。“中国毛派联合”深刻意识到这一点，并要求自己对此有所贡献。“中国毛派联合”目前只是一支马列毛主义指导下的政治力量，只是一部分坚持马列毛主义信仰、坚持共产主义理想的同志们联系起来的政治群体。我们并不否认，我们希望能够向无产阶级革命政党过渡。这是我们坚定不移要实现的目标。我们深知，没有无产阶级的革命党，就没有无产阶级的社会主义再革命。同时，我们重视实际可行的稳妥的步骤。\n       8、最后，会议呼吁一切真正愿意革命的毛派同志，要发扬无产阶级的革命大无畏精神，鼓起社会主义再革命的勇气，果敢地发动社会主义再革命运动。\n      会议强调，我们必须牢记毛主席的教导，“马克思主义的道理千条万绪，归根结底就是一句话，造反有理”。马列毛主义的灵魂绝不是像邓小平说的是实事求是。实事求是是唯物主义认识论。正是坚持这个认识论，坚持从资本主义社会的历史实际出发，马列毛主义的灵魂必然是要革命，要造反，要进行无产阶级反对资产阶级的阶级斗争，实现无产阶级对资产阶级的专政，实现无产阶级和广大劳动人民的彻底解放。\n      四十年来我们所犯的最大的错误就是不敢造修正主义的反。毛主席当年说得很清楚，中央出了修正主义，地方就要造反，人民就要造反，而且明确说，“不造反就犯错误”，毛主席是对的。毛主席表达的是一种真正的彻底的无产阶级的立场、观点和气魄。我们辜负了毛主席的希望。我们受到了历史的惩罚：党变修，国变色，人民重新受苦受难。\n      铁的阶级斗争的事实教育了我们，错误和挫折教育了我们，使我们变得比较聪明了一点，我们终于认识到，只有革命一条路，只有革命才能救中国。我们要举起马列毛主义的造反有理的旗帜，奋起反抗，奋起斗争，奋起革命，造修正主义的反，革修正主义的命，结束修正主义在中国的统治，争取中国社会主义再革命的伟大胜利。\n        要奋斗就会有牺牲。没有危险的革命是没有的，没有牺牲的革命也是没有的。社会主义再革命和社会主义革命一样，需要付出牺牲，付出代价。我们依然要发扬毛主席提倡的那种革命豪情：成千成万的革命先烈在我们的前头英勇地牺牲了，让我们高举起他们的旗帜，踏着他们的血迹前进吧！\n\n      会议全面回顾了自洛阳会议以来，中国毛派联合在《洛阳会议纪要》指引下进行斗争的经验和教训。代表们一致认为，实践证明，《洛阳会议纪要》是基本正确的，现在，为了进一步开创社会主义再革命的新阶段，在坚持《洛阳会议纪要》的基础上，还要有新的经验、新的办法提出，以上《会议纪要》就是适应这样的需要而作出的。\n      《会议纪要》，是《洛阳会议纪要》的继续和发展。中国毛派联合的同志们必须把两个《纪要》作为一个统一整体去理解、去贯彻。\n      修正主义者总是靠欺骗过日子，他们欺骗人民，也欺骗自己，在欺骗中不可避免地陷入盲目性。他们看不到，也不愿承认，经济危机、政治危机，正一步一步朝我们走来，革命的客观形势正在逐步走向成熟。\n      我们马列毛主义者和修正主义者不同，我们不仅以科学的态度认真分析革命形势的到来，而且看到，即便在革命形势到来之时，能不能发动革命，还要取决于革命的主观力量的成熟度。正是基于这一点，“中国毛派联合”决心接受历史的考验，我们决心不辜负毛主席的期望，不辜负人民的期望，在中国历史将要发生、必将发生重大转折的关键时刻，担当起历史赋于我们的发动、推动革命的时代重任。\n      毛主席说过，无产阶级文化大革命实质上是在无产阶级专政条件下无产阶级反对资产阶级和一切剥削阶级的政治大革命，是无产阶级反对资产阶级斗争的继续，是国共两党斗争的继续。今天，我们也可以说，我们现正进行的社会主义再革命，是无产阶级文化大革命的继续，是无产阶级反对资产阶级斗争的继续，只是，那时是在无产阶级专政条件下的社会主义继续革命，现在是在无产阶级专政被颠覆为资产阶级专政条件下的社会主义再革命。无产阶级文化大革命是演习，也是实战。无产阶级文化大革命的最高形式是一月革命。一月革命的原则是，在毛主席、共产党领导下，无产阶级革命派联合起来，向一小撮走资本主义道路的当权派夺权。这个伟大原则是永存的。在五十年后的今天，这个原则并没有过时。尽管我们没有了无产阶级专政的保护，尽管因此我们要面对法西斯资产阶级专政，但是，也许正因为发生了这个根本变化，正因为有了那时没有的特殊困难，我们更要坚信这个原则，坚持这个原则，贯彻这个原则，这个原则体现了马列毛主义的最根本的道理，只要有用马列毛主义武装起来的无产阶级政党的领导，只要有无产阶级革命派的大联合，只要有广大劳动人民的革命大联合，就有能力向资产阶级夺取政权，就有能力胜利实现社会主义再革命的胜利。\n\n      面对即将到来的无产阶级和资产阶级的大决战，让我们振臂高呼：\n      中国毛派共产主义者联合起来！\n      社会主义再革命胜利万岁！\n       \n\n                                        中国毛派联合    2016年春\n\n注：本《纪要》得到戚本禹同志的指导。  "
		}
	]
}