{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Monero e ZCash - Código Fonte",
			"body": "#MONERO\n\n\n\nO grande apelo do Monero é o fato dele ser anônimo. Com ele, os detalhes de cada transação, incluindo o remetente, o destinatário e o tamanho, são gravados em um sistema público, mas são ofuscados para torná-los irrastreáveis.\n\nApesar de atrair cibercriminosos (algo que outras moedas também fazem), defensores do Monero afirmam que ele tem muitas outras utilidades. A moeda seria atrativa para empresas que desejam mover dinheiro sem que os concorrentes saibam, ou para quem simplesmente não quer que seu saldo e transações sejam divulgados, como alguém fazendo negócios em um país estrangeiro que não quer tornar-se um alvo.\n\nExistem cerca de 15,5 milhões de Moneros em circulação e não há limite para moedas criadas.\n\n\nRing Signature - em tradução livre seria \"assinatura de anel\". Nela a assinatura digital pode ser executada por qualquer membro de um grupo de usuários em que cada um tenha chaves. É por meio deste sistema que o Monero cria seu poder de anonimato. Uma das propriedades de segurança de uma \"assinatura de anel\" é que ele deve ser computacionalmente inviável para determinar qual das chaves dos membros do grupo foi usada para produzir a assinatura.\n\n\nPrivacidade - O Monero usa o protocolo CryptoNote, baseado em \"assinaturas de anel\" e endereços furtivos. O resultado final é a mistura passiva e descentralizada baseada em algoritmos muito testados.\n\nDescentralização - O recurso de mineração inteligente permite a extração de CPU transparente no computador do usuário, longe da centralização de fato de pools de mineração, buscando a visão original de Satoshi Nakamoto de uma verdadeira moeda P2P.\n\nEscalabilidade - O Monero não possui um limite, o que significa que não possui uma limitação de tamanho de bloco de 1 MB que evite sua escalabilidade.\n\n#ZCASH\n\n\n\nZcash é uma criptomoeda descentralizada e open-source que oferece privacidade e transparência seletiva das transações. Pagamentos Zcash são publicados em um blockchain público, mas o remetente, destinatário e quantia de uma transação permanecem privados.\n\nEle transpõe o esquema de pagamento transparente existente e usado pelo Bitcoin com um esquema de pagamento blindado garantido por argumentos de conhecimento não-interativos sucintos e de conhecimento zero (ou também conhecidos como zk-SNARKs). Ele tenta abordar o problema da centralização de mineração por meio do algoritmo de prova de trabalho da memória de Equihash\n\n\nUma criptomoeda descentralizada e de código aberto que fornece proteções de privacidade fortes. Se o Bitcoin é como \"http\" da internet para o dinheiro, o Zcash é o \"https\", com uma camada maior de segurança\n\n\nzk-SNARKs - é uma nova forma de criptografia de conhecimento zero. O acrônimo zk-SNARK significa \"Argumento Não-Interativo Exclusivo de Conhecimento Zero\", e refere-se a uma construção de prova onde se pode provar a posse de certas informações, ou seja, uma chave secreta, sem revelar essa informação e sem qualquer interação entre o provador e o verificador. As provas de \"conhecimento zero\" permitem que uma das partes provar a outra verificar que uma afirmação é verdadeira, sem revelar qualquer informação além da validade da declaração em si.\n\n#Código Fonte: \n- http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1635jevzJXTxnL9ACG5Ab1fN7DA1VY4hkE/Monero%20e%20ZCash%20-%20Cdigo%20Fonte.zip \n\n- https://anonfiles.com/GbLf53x0nc/Monero_e_ZCash_-_C_digo_Fonte_zip \n\n- https://gofile.io/?c=M3aFGO\n\n- https://mega.nz/#!3i52WCSL!y6cSw4RszGrIKqybh-waAhOoppDrXyLGtnfd0u6cjco\n\nSHA-1: 6b2e293c9133ec5f79a05fae71e2d2325332c617\n\nSHA-256: 901cb3d07bd141712e71c3daa12e451a76968524e41f42a90b96ad9b1df25dfb",
			"added": 1562000814
		}
	],
	"topic_vote": {
		"1_1635jevzJXTxnL9ACG5Ab1fN7DA1VY4hkE": 1,
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": 1,
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1_1635jevzJXTxnL9ACG5Ab1fN7DA1VY4hkE": [
			{
				"comment_id": 1,
				"body": "#Zcash é a Alternativa mais Interessante ao Bitcoin, Diz Edward Snowden\n    A tecnologia de privacidade da Zcash torna mais interessante como alternativa ao Bitcoin. O Bitcoin é ótimo, mas “se não é privado, não é seguro.”\n\n- https://twitter.com/Snowden/status/913544739542241282",
				"added": 1562002139
			},
			{
				"comment_id": 3,
				"body": "#Como ocorre a emissão de moedas no Monero?\n\nA grande diferença do Monero em relação ao Bitcoin é a de que ele foi planejado para ter uma oferta infinita de moedas. Ao minerar um bloco, o minerador do Monero sempre receberá uma recompensa de bloco.\n\nA emissão inicial do Monero é muito mais rápida que o Bitcoin e ocorrerá até o final de maio de 2022, quando 18,1 milhões de unidades terão sido mineradas e a recompensa por bloco será de cerca de 0,6 XMR. A partir dessa data, ocorrerá a emissão em cauda, que é uma emissão de uma quantidade fixa de moedas a cada bloco minerado. Ou seja, a partir de maio de 2022, cada vez que um bloco for minerado (o que ocorre a cada dois minutos), uma recompensa fixa de 0,6 XMR será criada para o minerador. Isso irá criar uma inflação perpétua menor do que 1% (cerca de 0,87%/ano em maio de 2022). Como o Monero sempre terá recompensa para os mineradores, isso servirá como incentivo para que eles continuem interessados em minerar a moeda.",
				"added": 1562009668
			},
			{
				"comment_id": 4,
				"body": "#Como Explicar Protocolos de Conhecimento-Zero para suas Crianças\n\nEm criptografia uma prova de conhecimento-zero ou protocolo de conhecimento-nulo é um método interativo que possibilita uma parte provar para outra que uma declaração (geralmente matemática) é verdadeira, sem contudo revelar qualquer coisa além da veracidade da declaração. \n\n- https://web.archive.org/web/20180619123106/http://pages.cs.wisc.edu/~mkowalcz/628.pdf",
				"added": 1562010838
			},
			{
				"comment_id": 5,
				"body": "Monero - https://github.com/monero-project/monero.git\n\nZcash - https://github.com/zcash/zcash.git",
				"added": 1562011350
			}
		],
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 2,
				"body": "#Teste do servidor SSL\nEste serviço on-line gratuito realiza uma análise profunda da configuração de qualquer servidor da Web SSL na Internet pública.\n- https://www.ssllabs.com/ssltest/index.html",
				"added": 1562004820
			},
			{
				"comment_id": 6,
				"body": "#Biblioteca e ferramenta de linha de comando para detectar colisões SHA-1 em arquivos\n- https://github.com/cr-marcstevens/sha1collisiondetection.git",
				"added": 1562021952
			},
			{
				"comment_id": 7,
				"body": "#Keccak\nKeccak (pronunciado como \"ketchak\"), também conhecido como SHA-3, é uma função criptográfica, mais conhecida como uma função hash. Também pode ser usado para autenticação, criptografia (autenticada) e geração de números pseudo-aleatórios.\n- http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1635jevzJXTxnL9ACG5Ab1fN7DA1VY4hkE_0",
				"added": 1562022169
			},
			{
				"comment_id": 8,
				"body": "#RSA (sistema criptográfico)\n\nO RSA é um dos primeiros criptosistemas de chave pública e é amplamente utilizado para transmissão segura de dados. Em tal sistema de criptografia, a chave de criptografia é pública e é diferente da chave de descriptografia que é mantida em segredo. Na RSA, essa assimetria é baseada na dificuldade prática da fatorização do produto de dois grandes números primos, o \"problema de fatoração\". O acrônimo RSA é formado pelas letras iniciais dos sobrenomes de Ron Rivest, Adi Shamir e Leonard Adleman, que descreveram publicamente o algoritmo em 1978. Clifford Cocks, um matemático inglês que trabalhava para a Sede de Comunicações do Governo da agência de inteligência britânica, havia desenvolvido um sistema equivalente em 1973, mas isso não foi desclassificado até 1997.\n\n- http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1635jevzJXTxnL9ACG5Ab1fN7DA1VY4hkE_1",
				"added": 1562022647
			},
			{
				"comment_id": 9,
				"body": "#One-time pad\n\nOne-time pad, em português cifra de uso único ou chave de uso único, é uma técnica de criptografia que não pode ser quebrada se utilizada corretamente. Consiste num algoritmo em que o purotexto é combinado, caractere por caractere, a uma chave secreta aleatória que para isso deve ter, no mínimo, o mesmo número de caracteres do purotexto. Para garantir que a criptografia seja imperscrutável, a chave só deve ser usada uma única vez, sendo imediatamente destruída após o uso.\n\n- http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1635jevzJXTxnL9ACG5Ab1fN7DA1VY4hkE_3",
				"added": 1562023121
			},
			{
				"comment_id": 10,
				"body": "#Cifra de Vigenère\n\nA cifra de Vigenère é um método de criptografia que usa uma série de diferentes cifras de César baseadas em letras de uma senha. Trata-se de uma versão simplificada de uma mais geral cifra de substituição polialfabética, inventada por Leone Battista Alberti cerca de 1465.\n\n- http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1635jevzJXTxnL9ACG5Ab1fN7DA1VY4hkE_4",
				"added": 1562023338
			},
			{
				"comment_id": 11,
				"body": "#Cifra de César\nEm criptografia, a Cifra de César, também conhecida como cifra de troca, código de César ou troca de César, é uma das mais simples e conhecidas técnicas de criptografia. É um tipo de cifra de substituição na qual cada letra do texto é substituída por outra, que se apresenta no alfabeto abaixo dela um número fixo de vezes. Por exemplo, com uma troca de três posições, A seria substituído por D, B se tornaria E, e assim por diante. O nome do método é em homenagem a Júlio César, que o usou para se comunicar com os seus generais.\n- http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1635jevzJXTxnL9ACG5Ab1fN7DA1VY4hkE_5",
				"added": 1562023686
			},
			{
				"comment_id": 12,
				"body": "#Exponenciação modular\nA exponenciação modular é um tipo de exponenciação realizada sobre um módulo. É útil na ciência da computação, especialmente no campo da criptografia de chave pública.\n- http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1635jevzJXTxnL9ACG5Ab1fN7DA1VY4hkE_6",
				"added": 1562024374
			},
			{
				"comment_id": 14,
				"body": "#Hackers podem descobrir localização física de um celular\n\nNo teste de campo, os pesquisadores rastrearam a posição de um usuário dentro de uma área de 10 quarteirões, conforme ele caminhava a pé.\n\n\"Agentes de um regime opressor não vão mais precisar da cooperação das empresas de telefonia para determinar se os dissidentes estão no local de um protesto,\" escrevem os pesquisadores em seu artigo.\n\n\"Outro exemplo [do uso da fragilidade] é o de ladrões testando se o telefone celular de um usuário está fora de uma área específica, deduzindo o nível de risco associado com a invasão de sua residência,\" afirmam.\n\n- https://web.archive.org/web/20150907081926/http://www-users.cs.umn.edu/~kyd/doc/fookune_ndss_gsm.pdf",
				"added": 1562025365
			},
			{
				"comment_id": 15,
				"body": "#Senha gráfica é milhares de vezes mais segura\n\nOs pesquisadores descobriram que a colocação de uma imagem de background por trás do quadriculado não apenas facilita a lembrança da senha, mas também faz com que os usuários desenhem senhas menos previsíveis, maiores e mais complexas - logo, muito mais seguras.\n\nPor exemplo, se a pessoa escolhe a imagem de uma flor para background e desenha como senha uma borboleta sobre a flor, o que ele deverá se lembrar é onde começa e onde termina o desenho, que deverá estar contido na mesma porção do quadriculado - afinal, é virtualmente impossível fazer dois desenhos à mão livre exatamente iguais.\n\n- https://sci-hub.tw/10.1145/1315245.1315252",
				"added": 1562026478
			},
			{
				"comment_id": 17,
				"body": "As ferramentas on-line fornecem funções de codificação / decodificação md2, md5, sha1, sha2, sha512, bas64 e html\n- https://emn178.github.io/online-tools/index.html",
				"added": 1562030112
			},
			{
				"comment_id": 18,
				"body": "O i2pd (I2P Daemon) é uma implementação C ++ completa do cliente I2P\n\nO I2P (Invisible Internet Protocol) é uma camada de rede anônima universal. Todas as comunicações sobre o I2P são anônimas e end-to-end criptografadas, os participantes não revelam seus endereços IP reais.\n\nO cliente I2P é um software usado para construir e usar redes I2P anônimas. Essas redes são comumente usadas para aplicativos peer-to-peer anônimos (compartilhamento de arquivos, criptomoedas) e aplicativos cliente-servidor anônimos (sites, mensagens instantâneas, servidores de bate-papo).\n\nO I2P permite que pessoas de todo o mundo se comuniquem e compartilhem informações sem restrições.\n\n- https://github.com/PurpleI2P/i2pd.git",
				"added": 1562031687
			},
			{
				"comment_id": 19,
				"body": "#HashKiller\n\nO objetivo do HashKiller é servir como um ponto de encontro para entusiastas do computador, pesquisadores de segurança e testadores de penetração. Ele serve como um local central para promover maior segurança na Internet, demonstrando a fraqueza do uso de armazenamento / autenticação baseada em hash fraco.\n\nO HashKiller.co.uk é um serviço de pesquisa de hash. Isso permite que você insira um hash e procure por seu texto simples correspondente (\"encontrado\") em nosso banco de dados de hashes já quebrados.\n\nEm outras palavras, não estamos quebrando seu hash em tempo real - estamos apenas guardando o trabalho de muitos entusiastas do cracking ao longo dos anos.\n\n- https://hashkiller.co.uk/",
				"added": 1562033333
			}
		],
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": [
			{
				"comment_id": 13,
				"body": "#Validador de endereço Bitcoin\n- http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1635jevzJXTxnL9ACG5Ab1fN7DA1VY4hkE_2",
				"added": 1562024604
			}
		]
	},
	"comment_vote": {}
}