{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1JGsW6FQa6CRSGwBqrZoUWhw1SEjs2P88": 1,
		"2_1DSVWXJjaSa3wDMjDLhsAP8W3a9ZMV49Mj": 1
	},
	"next_comment_id": 10,
	"comment": {
		"4_1MEWJRMLgvofqG9Mbsb2Rc4hFFyv7HeRx7": [
			{
				"comment_id": 1,
				"body": "Moi ça me donne ceci : 4.64s\nC'est bien le Total qu'il faut prendre ?",
				"added": 1457804693
			}
		],
		"1_1KbaV4qD9rF6rXuT2aenytf2jhhD8UWqSR": [
			{
				"comment_id": 2,
				"body": " ghostdude : je te conseille aussi RetroShare, appli de partage sécurisée. Après faut trouver des \"amis\"",
				"added": 1458061051
			}
		],
		"1_1Ax5yj36bQDizcaeCMn9upKzVVyQ4wsm48": [
			{
				"comment_id": 3,
				"body": "Et ouais, encore des amateurs de football (activité débile qu'on dit être un sport) et qui rassemble un nombre étonnant de crétins... La preuve ici.",
				"added": 1458832058
			}
		],
		"1_1JGsW6FQa6CRSGwBqrZoUWhw1SEjs2P88": [
			{
				"comment_id": 4,
				"body": "De toute façon le français (pour la plupart) n'est qu'un mouton nourri à la propagande et aux conneries de TF1 et compagnies. On ne se bougera jamais le cul car nos connards de dirigeants savent trop bien comment calmer le jeu si la populace commence à s’énerver. Ils n'ont pas trop envie qu'on ressorte la guillotine :-)\nL'album de Pink Floyd \"Animals\" vous connaissez ? Le nom de trois des morceaux principaux résument bien les trois classes de gens existantes, sauf peut-être une 4ème classe : ceux qui commencent à se sortir la tête du cul pour voir ce qui se passe réellement. Donc : \n- n'allez plus voter pour ces connards de politiciens menteurs et voleurs que ne pensent qu'à ramasser de la thune, du pouvoir et tous les avantages à la con qu'ils ont avec leur fonction\n- sortez votre fric des banques histoire de bien faire chier ces dernières qui vous entubent bien, laissez le minimum utile\n- jetez votre TV par la fenêtre plutôt que de se faire ramollir le cerveau avec \"the voice\" et autres débilités dans le genre",
				"added": 1459687101
			}
		],
		"2_1DSVWXJjaSa3wDMjDLhsAP8W3a9ZMV49Mj": [
			{
				"comment_id": 5,
				"body": "Ouais moi avec connexion fibre optique",
				"added": 1499008996
			}
		],
		"1_12ieSrCzre9k5CCveXhcoC2fNV5Xmnx2NN": [
			{
				"comment_id": 6,
				"body": "Pourquoi pas faire aussi une chaine sur retroshare :)",
				"added": 1499010338
			}
		],
		"1_1CbWzhKQcoxwgB7z3ncTW5vdnvLM8xQDtV": [
			{
				"comment_id": 7,
				"body": "Y a que dalle, la liste est vide",
				"added": 1499014442
			},
			{
				"comment_id": 9,
				"body": "Ha si mais impossible à lire...",
				"added": 1499015167
			}
		],
		"1_1EMVG4bZxeXJFHf1oUQosLvGyV6dTQeJgs": [
			{
				"comment_id": 8,
				"body": "L'humain : quelle connerie :-)",
				"added": 1499015109
			}
		]
	},
	"comment_vote": {}
}