{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1,
			"title": "Подойдут ли торент трекеры для zeronet или нужны именно специальные для zeronet ?",
			"body": "",
			"added": 1549865418
		},
		{
			"topic_id": 2,
			"title": "Децентрализация сети позволит вернуть власть людям",
			"body": "С каждым днем контроль над интернетом и данными пользователей все больше переходит в руки нескольких больших корпораций. Исправить это призвана новая концепция децентрализации сети, которая нашла сторонников в том числе и среди создателей самого интернета.\n\nНедавно Google представила очередное приложение для видеозвонков. Hangouts оставили только для корпоративный пользователей, а новым игроком в сфере видеозвонков было призвано стать приложение Google Duo.\n\nТаким образом, теперь у Microsoft есть Skype, у Apple есть Facetime, а у Google – Duo. У каждой из компаний есть собственные сервисы с одинаковым набором функций. Они, может, и выполняют эти функции на отлично, но все равно не о таком будущем мы мечтали, когда интернет только начинал развиваться.\n\nЕсли немного покопаться в памяти, то можно вспомнить, что изначальным предназначением интернета было создание всеобщей сети, которой смог бы пользоваться каждый во благо человечества. К счастью, сейчас развивается тенденция к возвращению к истокам, и среди ее сторонников даже можно встретить несколько ключевых фигур из той эпохи. Эта идея носит название «Децентрализованная сеть», или Web 3.0, и подразумевает создание сервисов, работа которых не подчиняется некой «центральной» организации.\n\n\n\nС каждым днем контроль над интернетом и данными пользователей все больше переходит в руки нескольких больших корпораций. Исправить это призвана новая концепция децентрализации сети, которая нашла сторонников в том числе и среди создателей самого интернета.\n\nНедавно Google представила очередное приложение для видеозвонков. Hangouts оставили только для корпоративный пользователей, а новым игроком в сфере видеозвонков было призвано стать приложение Google Duo.\n\nТаким образом, теперь у Microsoft есть Skype, у Apple есть Facetime, а у Google – Duo. У каждой из компаний есть собственные сервисы с одинаковым набором функций. Они, может, и выполняют эти функции на отлично, но все равно не о таком будущем мы мечтали, когда интернет только начинал развиваться.\n\nЕсли немного покопаться в памяти, то можно вспомнить, что изначальным предназначением интернета было создание всеобщей сети, которой смог бы пользоваться каждый во благо человечества. К счастью, сейчас развивается тенденция к возвращению к истокам, и среди ее сторонников даже можно встретить несколько ключевых фигур из той эпохи. Эта идея носит название «Децентрализованная сеть», или Web 3.0, и подразумевает создание сервисов, работа которых не подчиняется некой «центральной» организации.\n\nИсточник: The Daily Dot\n\nЧто же случилось с изначальными принципами Всемирной паутины? В основном альтруизм иссяк в течение первого пузыря эры дот-ком, когда люди осознали, что можно легко создавать ценность на этой нейтральной основе, если строить централизованные сервисы, через которые можно собирать, хранить и продавать информацию.\n\nПоисковые сервисы, социальные сети и мессенджеры смогли достичь таких успехов благодаря централизации сервисов в интернете. К примеру, в будущем Facebook планирует предоставлять доступ только к определенному набору централизованных сервисов, которые контролирует компания (через инициативу Internet.org).\n\nЭто противоречит базовым свободам интернета, таким как возможность перейти к любому сайту по его адресу (что вынуждает вас публиковать контент только в Facebook) или возможность индексации содержимого соцсети поисковыми сервисами (а не внутренним поиском Facebook).\n\nКонцепция децентрализованной сети подразумевает будущее, в котором такие сервисы, как общение, финансы, публикации, социальные сети, поиск, архивация и т. д., не предоставляются централизованными платформами, которые контролирует та или иная организация, а управляются людьми, то есть сообществом пользователей.\n\nКлючевая идея децентрализации состоит в том, чтобы не доверять управление тем или иным сервисом отдельной всемогущей компании. Вместо этого ответственность за работу сервиса становится коллективным делом: возможно, путем запуска на нескольких интегрированных серверах или в приложениях со стороны клиентов в виде полностью «распределенной» пользовательской модели.\n\nДаже если сообщество будет сложным, а его члены не смогут доверять друг другу, правила этих децентрализованных сервисов продуманы таким образом, чтобы участники поступали справедливо по отношению друг к другу, иначе работа сервиса невозможна. Для того чтобы участники соблюдали правила, будут использоваться приемы криптографии, такие как деревья Меркла и цифровые подписи.\n\nДецентрализованная сеть точно выигрывает у традиционного подхода по трем фундаментальным параметрам: конфиденциальность, переносимость данных и безопасность.\n\n    Конфиденциальность. При децентрализации уделяется большее внимание неприкосновенности личных данных. Данные распределены по всей сети, а для ограничения доступа к ним применяются технологии оконечного шифрования. Доступ к данным контролируется исключительно алгоритмом сети, в отличие от более централизованных сетей, владелец которых обычно имеет доступ ко всем данным и может влиять на профили клиентов и таргетинг рекламы.\n    Переносимость данных. В децентрализованной системе пользователи остаются владельцами своих данных и могут сами решать, с кем ими делиться. Более того, пользователи сохраняют контроль над данными при переходе от одного провайдера услуг к другому (если в сервисе вообще есть понятие провайдера). Этот момент важен. Если сегодня я решу пересесть с автомобиля производства General Motors на BMW, то мои водительские права останутся при мне. То же самое относится к истории общения в чате и записях о состоянии здоровья.\n    Безопасность. Мы живем в мире, в котором количество угроз нашей безопасности только растет. В централизованной системе чем больше и ценнее информация, тем более она привлекательна для мошенников и преступников. Природа децентрализованных платформ делает их более устойчивыми к взлому, проникновению, краже и другим угрозам, так как они с самого начала созданы для работы под контролем общества.\n\nТочно так же, как само появление интернета в свое время привело к колоссальным изменениям, когда отдельные местные сети были объединены в единую нейтральную сеть, сейчас благодаря технологиям возникает новая общая платформа для сервисов более высокого уровня. И, как было при зарождении эры Web 2.0, первые признаки эры Web 3.0 уже несколько лет дают о себе знать.\n\nКрайне успешной системой контроля версий ПО стала полностью децентрализованная Git, которая практически полностью заменила централизованные системы вроде Subversion. Пример биткоина демонстрирует, что валюта легко может существовать без центрального выпускающего органа и успешно соперничает с централизованным PayPal. Децентрализованную альтернативу Facebook планирует предложить сеть Diaspora. Freenet стала первопроходцем в области децентрализованных веб-сайтов, электронной почты и обмена файлами.\n\nЧуть менее известная StatusNet (переименованная в GNU Social) предлагает децентрализованную альтернативу Twitter. Сервис XMPP является децентрализованной версией мессенджеров вроде AOL, ICQ, MSN других.\n\n\n0\n\nС каждым днем контроль над интернетом и данными пользователей все больше переходит в руки нескольких больших корпораций. Исправить это призвана новая концепция децентрализации сети, которая нашла сторонников в том числе и среди создателей самого интернета.\n\nНедавно Google представила очередное приложение для видеозвонков. Hangouts оставили только для корпоративный пользователей, а новым игроком в сфере видеозвонков было призвано стать приложение Google Duo.\n\nТаким образом, теперь у Microsoft есть Skype, у Apple есть Facetime, а у Google – Duo. У каждой из компаний есть собственные сервисы с одинаковым набором функций. Они, может, и выполняют эти функции на отлично, но все равно не о таком будущем мы мечтали, когда интернет только начинал развиваться.\n\nЕсли немного покопаться в памяти, то можно вспомнить, что изначальным предназначением интернета было создание всеобщей сети, которой смог бы пользоваться каждый во благо человечества. К счастью, сейчас развивается тенденция к возвращению к истокам, и среди ее сторонников даже можно встретить несколько ключевых фигур из той эпохи. Эта идея носит название «Децентрализованная сеть», или Web 3.0, и подразумевает создание сервисов, работа которых не подчиняется некой «центральной» организации.\n\nИсточник: The Daily Dot\n\nЧто же случилось с изначальными принципами Всемирной паутины? В основном альтруизм иссяк в течение первого пузыря эры дот-ком, когда люди осознали, что можно легко создавать ценность на этой нейтральной основе, если строить централизованные сервисы, через которые можно собирать, хранить и продавать информацию.\n\nПоисковые сервисы, социальные сети и мессенджеры смогли достичь таких успехов благодаря централизации сервисов в интернете. К примеру, в будущем Facebook планирует предоставлять доступ только к определенному набору централизованных сервисов, которые контролирует компания (через инициативу Internet.org).\n\nЭто противоречит базовым свободам интернета, таким как возможность перейти к любому сайту по его адресу (что вынуждает вас публиковать контент только в Facebook) или возможность индексации содержимого соцсети поисковыми сервисами (а не внутренним поиском Facebook).\n\nКонцепция децентрализованной сети подразумевает будущее, в котором такие сервисы, как общение, финансы, публикации, социальные сети, поиск, архивация и т. д., не предоставляются централизованными платформами, которые контролирует та или иная организация, а управляются людьми, то есть сообществом пользователей.\n\nКлючевая идея децентрализации состоит в том, чтобы не доверять управление тем или иным сервисом отдельной всемогущей компании. Вместо этого ответственность за работу сервиса становится коллективным делом: возможно, путем запуска на нескольких интегрированных серверах или в приложениях со стороны клиентов в виде полностью «распределенной» пользовательской модели.\n\nДаже если сообщество будет сложным, а его члены не смогут доверять друг другу, правила этих децентрализованных сервисов продуманы таким образом, чтобы участники поступали справедливо по отношению друг к другу, иначе работа сервиса невозможна. Для того чтобы участники соблюдали правила, будут использоваться приемы криптографии, такие как деревья Меркла и цифровые подписи.\n\nДецентрализованная сеть точно выигрывает у традиционного подхода по трем фундаментальным параметрам: конфиденциальность, переносимость данных и безопасность.\n\n    Конфиденциальность. При децентрализации уделяется большее внимание неприкосновенности личных данных. Данные распределены по всей сети, а для ограничения доступа к ним применяются технологии оконечного шифрования. Доступ к данным контролируется исключительно алгоритмом сети, в отличие от более централизованных сетей, владелец которых обычно имеет доступ ко всем данным и может влиять на профили клиентов и таргетинг рекламы.\n    Переносимость данных. В децентрализованной системе пользователи остаются владельцами своих данных и могут сами решать, с кем ими делиться. Более того, пользователи сохраняют контроль над данными при переходе от одного провайдера услуг к другому (если в сервисе вообще есть понятие провайдера). Этот момент важен. Если сегодня я решу пересесть с автомобиля производства General Motors на BMW, то мои водительские права останутся при мне. То же самое относится к истории общения в чате и записях о состоянии здоровья.\n    Безопасность. Мы живем в мире, в котором количество угроз нашей безопасности только растет. В централизованной системе чем больше и ценнее информация, тем более она привлекательна для мошенников и преступников. Природа децентрализованных платформ делает их более устойчивыми к взлому, проникновению, краже и другим угрозам, так как они с самого начала созданы для работы под контролем общества.\n\nТочно так же, как само появление интернета в свое время привело к колоссальным изменениям, когда отдельные местные сети были объединены в единую нейтральную сеть, сейчас благодаря технологиям возникает новая общая платформа для сервисов более высокого уровня. И, как было при зарождении эры Web 2.0, первые признаки эры Web 3.0 уже несколько лет дают о себе знать.\n\nКрайне успешной системой контроля версий ПО стала полностью децентрализованная Git, которая практически полностью заменила централизованные системы вроде Subversion. Пример биткоина демонстрирует, что валюта легко может существовать без центрального выпускающего органа и успешно соперничает с централизованным PayPal. Децентрализованную альтернативу Facebook планирует предложить сеть Diaspora. Freenet стала первопроходцем в области децентрализованных веб-сайтов, электронной почты и обмена файлами.\n\nЧуть менее известная StatusNet (переименованная в GNU Social) предлагает децентрализованную альтернативу Twitter. Сервис XMPP является децентрализованной версией мессенджеров вроде AOL, ICQ, MSN других.\nОператоры телефонного узла, 1914 год. Источник: Flickr/raynermedia\n\nТем не менее эти технологии всегда были где-то на краю – ими пользовались только придумавшие их гики, которые легко могли не замечать недостатков этих сервисов для массовой аудитории. Эта тенденция меняется. Общество наконец-то понимает, что быть полностью зависимым от огромной платформы – не лучший вариант.\nЗаявить о приходе новой эпохи всерьез призвано целое поколение стартапов, работающих над создание децентрализованных сервисов и уже привлекших внимание индустрии.\n\nBlockstack и Ethereum показывают, что блокчейн может стать чем-то гораздо большим, чем просто криптовалюта, выступая в роли универсальных инструментов для создания децентрализованных систем. IPFS и Dat Project создают полностью децентрализованные источники данных, которые не хранятся в каком-либо определенном месте, а принадлежат всем пользователям, имеющим к ним доступ.\n\nВажный этап был пройден в июне, когда прошел Саммит по децентрализованным сетям, организованный библиотекой Internet Archive. На мероприятии собрались многие «родоначальники Всемирной паутины», чтобы обсудить способы «заново открыть сеть» и переосмыслить ее так, чтобы сделать «более надежной, конфиденциальной и приятной для использования».\n\nБрюстер Кейл, основатель Internet Archive, одним из первых увидел развитие технологий децентрализации, в то время как искал пути сделать из централизованной библиотеки Internet Archive децентрализованную: управляемую и контролируемую пользователями, а не хрупкую и уязвимую.\n\nКроме того, присутствие на саммите Тима Бернерса-Ли (родоночальника интернета и изобретателя URL, HTTP, HTML — прим. ред.), Винта Серфа, самого Брюстера и многих других представителей «старой школы интернета» доказывает, что впервые идея децентрализации привлекла внимание и интерес истеблишмента.\n\nТим Бернерс-Ли сказал:\n\n    Сеть была задумана децентрализованной, чтобы каждый мог владеть собственным доменом и сервером, однако сейчас это не так. Вместо этого сейчас личные данные людей хранятся в огромных массивах вместе с другими. […] В этом случае мы предлагаем вернуться к идее децентрализованной сети.\n\n    Вернуть власть людям. Мы считаем, что сможем произвести социальную революцию путем небольших модификаций: мы продолжим использовать сеть, но будем делать это так, что приложения, которые вы используете, будут существовать отдельно от ваших данных.\n\nСтановится ясно, что главная задача сейчас – довести эти новые технологии до ума и вывести на массовый рынок. С коммерческой точки зрения децентрализация несет огромные перспективы: в то время как нынешние хранилища данных могут исчезнуть, новые будут всегда оставаться на поверхности новых платформ так, как это было при зарождении интернета.\n\nПионером в этом плане является GitHub: компания стоимостью в $2 млрд, которая является коммерческим сервисом, построенным на базе технологии Git. Его пользователи в любой момент могут извлечь свои данные и покинуть сервис.\n\nЧитайте по теме: Как фейсбук для компьютерщиков превратился в бизнес стоимостью в $2 млрд\n\nТочно так же должны появиться компании новой волны, создающие децентрализованную инфраструктуру и коммерчески жизнеспособные сервисы на базе существующих технологий.\n\nТрудно точно предсказать, куда в итоге приведет нас эпоха Web 3.0, однако в этом и состоит вся прелесть. Лишение нескольких главных игроков контроля над интернетом неминуемо приведет к импульсу инноваций и позволит процветать сервисам, ставящим превыше всего интересы пользователей.\n\nApple, Google, Microsoft и другие корпорации имеют свои интересы, что логично, но это означает, что часто пользователи становятся для них не более чем источником дохода.\n\nПока децентрализованная сеть привлекает интерес сообщества разработчиков, трудно сказать, какие новые бизнес-модели будут образованы и какие новые технологии будут изобретены. Совершенно точно можно говорить об одном: они будут естественным образом поддерживать сообщества собственных пользователей так же, как и заботиться об интересах создателей.",
			"added": 1549872346
		},
		{
			"topic_id": 3,
			"title": "jami Децентрализованный мессенджер",
			"body": "Приложение использует распределенные хеш-таблицы (DHT) для установления связи. Эта технология исключает использование централизованных регистров и сохранение личных данных. Jami основан на технологии распределенной сети, которая позволяет ему не использовать серверы, требующие зависимости и облегчающие массовое наблюдение.\n\nJami хранит ваши секреты (личные ключи для шифрования и идентификации) только на той машине, которая их выполняет, и принадлежит вам. Таким образом, ваше устройство является единственным владельцем вашей информации.\nБезопасный\n\nДжами предлагает цифровую идентификацию с учетными записями, которые не требуют, чтобы кто-либо раскрывал их личность. Все сообщения зашифрованы без исключения с использованием самых современных технологий. Как свободное программное обеспечение, Jami опирается на важную цель: быть распределенной системой связи, которая уважает конфиденциальность своих пользователей, благодаря своей конструкции без инфраструктуры или централизованных серверов.\nБесплатно программное обеспечение\n\nДжами гордится тем, что использует только свободное программное обеспечение. Jami находится под лицензией GPLv3 +. Этот основополагающий принцип позволяет привлечь как можно больше людей со всех горизонтов, сделать весь исполняемый код проверяемым и, следовательно, обеспечить здоровую модель развития сообщества.\n\nJami также официально является пакетом GNU и высокоприоритетным проектом в результате его интеграции в качестве проекта GNU Фонда свободного программного обеспечения.\nАдаптационные\n\nДжами имеет множество применений. Будь то отправка текстовых сообщений, безопасные и надежные аудио- и видеозвонки или обмен документами и файлами, Jami обеспечивает высококачественную связь и обмен данными.\n\nНезависимо от того, взаимодействуете ли вы с семьей на другом конце света или безопасно делитесь документами с вашими сотрудниками, Jami предлагает полный спектр возможностей для ваших коммуникационных потребностей.\n\nи так чем же он отличается от мессенджера Tox спросите вы перечисляю\n1-адекватная работа на android\n2-сообщения можно отправлять даже тогда когда собеседник в оффлайне они все равно придут в отличии от Tox\n3-короткие адреса\n4-хороший поиск собеседников\nвот что делает Jami лутьше Tox\n5-Пробивает NAT\n\nhttps://jami.net/",
			"added": 1549933322
		},
		{
			"topic_id": 4,
			"title": "Проверьте работает ли блог",
			"body": "http://127.0.0.1:43110/1P5Sybb44xTi6T6o5e2buZ8SR1zdsbX3Ae/",
			"added": 1550152506
		},
		{
			"topic_id": 5,
			"title": "OpenCV библиотека функций для распознавания лиц",
			"body": "\nв связки с ZoneMinder теперь это доступно даже для домашних камер как это отразится на анонимности ?\n\nhttps://ru.wikipedia.org/wiki/OpenCV",
			"added": 1550316576
		},
		{
			"topic_id": 6,
			"title": "Сделать из глобальной сети локальную – депутаты Госдумы приняли в первом чтении закон о «суверенном интернете»",
			"body": "Мечта властей РФ – интернет как гостелевиденье. Сегодня депутаты сделали еще один шаг к цензуре информационного пространства – в первом чтении принят законопроект об автономной работе Рунете. Вот антиутопия на глазах становится реальностью. Изоляция, усиление контроля и подавление инакомыслия в сети – основная цель репрессивного новшества скандально известного сенатора-часоносца Клишаса. Чтобы обезопасить себя от критики, а население оградить от достоверной информации, власти готовы поставит под угрозу само функционирование глобальной сети на территории РФ. Заодно – истратить на это дело миллиарды миллиардов рублей.\n\nАвторы проекта — сенаторы Андрей Клишас и Людмила Бокова, а также депутат Госдумы Андрей Луговой. Они предлагают поправки в закон «О связи» и «Об информации», разумеется, как меру защиты от внешних врагов, жаждущих нарушить работу глобальной сети именно в России.\n\nДля «целостности, устойчивости и безопасности функционирования» российского сегмента интернета власти планируют установить на сетях связи технических средств, определяющих источник передаваемого трафика. При этом «Технические средства должны будут обладать возможностью ограничить доступ к ресурсам с запрещенной информацией не только по сетевым адресам, но и путем запрета пропуска проходящего трафика».\n\nДругая мечта чиновников, порожденная их ниевежеством – единый центр управления и регулирования интернета. Как отмечали ранее эксперты из организации «Цифровая экономика», проект предлагает предоставить Роскомнадзору полную карту точек обмена трафиком, благодаря чему интернет-цензоры без труда смогут блокировать каналы доступа к любому сайту. Но эксперты опасаются, что попытка реализации этого проекта создаст в системе маршрутизации трафика критическую точку, которая вообще может привести к сбоям всей национальной системы связи.\n\nПри внесении законопроекта авторы утверждали, что на его реализацию не нужны дополнительные бюджетные деньги. Позднее Клишас заявил, что в рамках проекта «Информационная безопасность» на создание «железного занавеса» в интернете все-таки заложено более 20 млрд рублей. При этом эксперты оценивают возможные затраты на реализацию проекта сетевой цензуры в пределах сотни миллиардов рублей.\n\nТем временем, флагманы российской IT-отрасли - представители компаний «Яндекс» и «Mail Group», которой принадлежит «ВКонтакте», ранее поддержали скандальную инициативу о создании автономного интернета в РФ. Теперь операторы связи проведут учения, чтобы найти слабые места в проекте и понять, как их исправить.\n\nПлатить за новую порцию цензуры придется, конечно, жителям страны. Это признают даже чиновники Счетной палаты, в отзыве которой сказано, «реализация законопроекта приведёт к росту стоимости товаров и услуг на российском рынке, что содержит риск увеличения расходов бюджетов всех уровней бюджетной системы РФ на их оплату».\n\nЧем все это чревато для простых пользователей? В случае реализации законопроекта у Роскомнадзора будет возможность более эффективной блокировки неугодных ресурсов. Соответственно, тем же мессенджером Телеграм пользоваться станет невозможно. Еще есть вероятность, что в целом интернет станет работать медленнее. И, разумеется, вырастут цены на услуги связи и доступ в сеть. Вот только многие эксперты уверены, в том, что суверенный интернет — вещь в принципе «технически невозможная» и построить ее пытаться могут только «клинические идиоты».",
			"added": 1550422046
		}
	],
	"topic_vote": {
		"24_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"30_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"22_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"27_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"17_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"15_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"14_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"12_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"11_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"8_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"7_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"6_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"5_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"2_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"1_1Lr8RdHxBpY8EWZ6rwD8CvVAaMkg2yGtXf": 1,
		"32_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"16_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"28_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"33_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"31_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"25_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"1_1KqSnsduv8iRCWBaLGF8Cz3XszuwHvEr74": 1,
		"21_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"1_1L4c3c1p78xUx8DAxZvqCnj84WjLpcEECY": 1,
		"1_1HbEshxJFfPf1ZEqCxBDTbzWuLLhzxRgF8": 1,
		"20_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"19_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"9_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"4_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"10_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL": 1,
		"35_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"37_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"34_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"2_1DXxyNnRKTvzUcuvQhTu8uWSXSNYL4oVc6": 1,
		"1_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"2_1FqhDHg7XD7jCemGBNYVSPEWLERCjgmAJo": 1,
		"3_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": 1,
		"1_1KcPa74X88hPnyc64nnkXveXA8daeKpvcU": 1,
		"2_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": 1,
		"3_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": 1,
		"2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1,
		"1_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": 1,
		"4_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": 1,
		"1_14MeN6afdY8nQxnW2CzM61mVjtrSind1uY": 1,
		"5_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": 1,
		"6_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": 1
	},
	"next_comment_id": 15,
	"comment": {
		"32_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 1,
				"body": "самая стабильная версия по ка что это 1.1.1\nhttp://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1LGLe311PAqQm63B2A1MnFctPm8W25XC1i/Rats%20on%20The%20Boat%20linux%20windows.zip",
				"added": 1549825548
			}
		],
		"16_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 2,
				"body": "> [mistalero](#comment_26_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Создал профиль, добавляйтесь.@xly4FhqsYTS3UOYJFDFalLkRlQVbziwRBjICMTXtpwo=.ed25519\n\nа под сервер какой",
				"added": 1549826859
			},
			{
				"comment_id": 3,
				"body": "это будущее россии скоро в рф все диапазоны заблокируют",
				"added": 1549826912
			}
		],
		"3_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": [
			{
				"comment_id": 4,
				"body": "> [promusik](#comment_54_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): Это же бывший GNU Ring. Юзал я его около года назад. Был очень не стабилен и качество связи очень уныло. По факту по пол часа (я даже не утрирую) соединялся с другим пользователем и не показывал его актуальный статус: в сети / не в сети. Может сейчас и стало лучше, не тестил.\n> По юзабельности и качеству TOX оказался чуть более стабильным.\n\nТАК ВОТ СЕЙЧАС ЕГО ПЕРЕИМЕНОВАЛИ В Jami ВРОДЕ КАК НАМНОГО ЛУТЬШЕ СТАЛ",
				"added": 1549981949
			}
		],
		"10_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL": [
			{
				"comment_id": 5,
				"body": "Emule Amule там много порно",
				"added": 1550120216
			}
		],
		"37_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 6,
				"body": "идея не плохая",
				"added": 1550120260
			},
			{
				"comment_id": 8,
				"body": "> [mistalero](#comment_38_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Какая из них?\n\nхостить diaspora в Onion",
				"added": 1550209236
			},
			{
				"comment_id": 11,
				"body": "> [mistalero](#comment_39_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Да, действительно, а можно ещё в i2p.\n\nкстати можно а хуле нет то",
				"added": 1550427867
			}
		],
		"3_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy": [
			{
				"comment_id": 7,
				"body": "ZeroNet это цензура устойчивая сеть а не анонимная в ней нет шифрования а значит провайдер видит загружаемый контент",
				"added": 1550175531
			}
		],
		"1_14MeN6afdY8nQxnW2CzM61mVjtrSind1uY": [
			{
				"comment_id": 9,
				"body": "Светлая память вот его блог Мемуары Balancer'а http://127.0.0.1:43110/1BFvnf2QHmMsjZ8dnfT89WfW8mVX7FrQj7/?Home",
				"added": 1550254554
			}
		],
		"6_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": [
			{
				"comment_id": 10,
				"body": "> [battosai](#comment_2_1EEHPWzHXCE19GRjRe2T3HgypFjtZLcX8u): Походу у нас тут очаг сопротивления :)\n\n+5 я против а вы ?",
				"added": 1550427755
			},
			{
				"comment_id": 12,
				"body": "> [7heaven](#comment_2_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6): Иначе говоря, как я понял, в РФ хотят сделать фаервол с применением технологии DPI? И если да, то как это отразится на НЕ клирнетовских сервисах вроде RetroShare, FreeNet, ZeroNet, I2P?\n\nиностранные диапазоны ip адресов заблокируют и хрен нам а не тор I2P тоже перестанет работать а те годы что в россии будут разносить менты так что zeronet срочно нужна поддержка dht",
				"added": 1550485878
			},
			{
				"comment_id": 13,
				"body": "> [7heaven](#comment_3_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6): Зачем столько мороки? Зеронет же можно через Wi-Fi/Bluetooth передавать. А если учитывать, что он теперь поддерживает CDJNS то в принципе единственный вариант остановить это - физически людей пересадить за все это.\n> \n> DHT конечно тоже важен Зеронету, но даже сейчас он хоть и нуждается в трекерах, но скажем так трекером может стать изили любой человек, что уже как бы без 5 минут децентрализация в сборе пиров.\n\nхоть какой то просвет",
				"added": 1550508153
			}
		],
		"2_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy": [
			{
				"comment_id": 14,
				"body": "каждые сутки в соцсеть выходят около 200 тыс здесь дело пахнет большими деньгами а как мы знаем приложение давало доступ в контакт по сути парень зарабатывал по 200 к в сутки за счет сайта вконтакте владелец которого павел дуров который сосет хер у фсб короче паренек залез к павлу дурову в карман ну вот павел и спустил на него мусоров его конечно выпустят через 6 месяцев но исходники и серверная часть сайта теперь у ментов просрал паренек свой бизнес",
				"added": 1550510378
			}
		]
	},
	"comment_vote": {
		"26_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": 1,
		"14_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"23_1EoGNJ7g8DxDmhN1h3k6kGKb9TBmBJUmSV": 1,
		"16_1EoGNJ7g8DxDmhN1h3k6kGKb9TBmBJUmSV": 1,
		"6_19eXfGkykvbJgB7fb4TPYTkxWmuNTxeRMJ": 1,
		"3_1EEHPWzHXCE19GRjRe2T3HgypFjtZLcX8u": 1,
		"2_1EEHPWzHXCE19GRjRe2T3HgypFjtZLcX8u": 1,
		"3_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": 1,
		"9_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": 1
	}
}