{
	"title": "半日偷闲",
	"description": "初心不忘",
	"links": "# <font color=\"Red\">**互联世界**</font>\n\n# ZeroNet 指导\n\n[ZeroNet 中文文档](http://127.0.0.1:43110/docs.ysc3839.bit/)\n[0 网中文指导](http://127.0.0.1:43110/NewGFWTalk.bit/)\n\n# 友情链接\n\n[爱我中华](http://127.0.0.1:43110/1CNvGEzT1Mn8UFSJVR7Pm6CaL7thPcDXj6/)\n[浮生網志](http://127.0.0.1:43110/mosen.bit/)\n[ErrNoUser](http://127.0.0.1:43110/18zF2ymdm4kxgEQEC2os6vThAxSgLkgemL)\n[Freedom is unfree](http://127.0.0.1:43110/1MZPL4Wx5MkBKAf7b8Nu3RYxB97GcjF56o/)\n[Zeroalpha 中文博客](http://127.0.0.1:43110/1NYgLKpinyihB7NtnQkH9Z4jNQ3o9zC8BX/)\n[秘境](http://127.0.0.1:43110/nohup.bit/)\n[兼听则明](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/)",
	"next_post_id": 24,
	"demo": false,
	"modified": 1552124803,
	"post": [
		{
			"post_id": 23,
			"title": "beat掉推荐系统",
			"date_published": 1552123874.833,
			"body": "[@屠龙的胭脂井](https://weibo.com/1852299857/HjZ6w4PFh?from=page_1005051852299857_profile&wvr=6&mod=weibotime&type=comment)\n\n今天和清华几个老师聊天，说起“如何对抗推荐系统\"的问题。\n\n简单的说，现在的很多社交平台，都是存在推荐算法的。特别是抖音，头条等，你越喜欢什么内容，它就会推给你类似的内容。\n这样你对平台会更成瘾。但这样的推荐系统对个人的发展一定好吗？\n不一定。因为推荐系统会决定了你的视野。当你只看同质化的内容，文字，视频的时候，你就会不知道你不知道什么。\n推荐算法只能让你的视野越来越窄。而现在的互联网，已经不是曾经的互联网了，推荐算法已经占据了所有互联网平台。\n作为一个老的互联网用户，我感到曾经的互联网是一个小众的东西，曾经网上的人的智力密度比网下的人高，网上有很多开阔视野的东西。并且有很多好的网站存在于你的收藏夹里面。\n现在随着互联网的发展，推荐算法，和泛娱乐化，使得互联网越来越傻瓜化，同质化，肤浅化。优秀的独立网站经营不下去，肤浅化的变现快的推荐算法dominate所有入口。\n很多人为了寻找高质量，不一样，深度的东西，反而需要去线下寻找，反而需要去自己想办法beat掉推荐系统。\n\n## 那么我给大家推荐几个beat掉推荐系统的方法：\n\n* * *\n\n1\\. 有个chrome的应用叫stumble upon，装上以后，按它就会给你随机选择一些高质量网站，但是可能你从来没见过的东西。\n\n比如昨天我就看见一篇文章说，咖啡的滤纸可以用来做什么手工。如果我自己去搜索的话，我肯定不会看这种文章的，但看了我觉得非常有趣。\n\n2\\. 你可以把Wikipedia设成自己的默认页，Wikipedia有个random wiki，这样每次打开浏览器就可以随机弹出来一个wiki页面，也许有很多冷门的知识你不知道。\n\n3\\. 你可以去wolfram alpha点“surprise me”，这样它会弹出来一些有趣的量化的知识。\n\n4\\. 你还可以装一个应用叫100 million books （在chrome上），可以随机推荐一些书，直接链接到美国亚马逊，这样你可以看评论，非常有趣。\n\n从上面一些直觉的经验，要想系统产生beat掉推荐算法的算法，也就是anti-recommendation算法，需要两个因素：\n\n1\\. 高品质。有开阔视野的需求的人群，不能看非常low的内容。非常low的东西，即便他们没看过，也不想看。\n\n2\\. 随机性。随机sample人类知识各个领域。这可能就需要知识图谱。不能因为某些领域的感兴趣的人少（比如量子物理），就sample的少，也不能因为某些领域感兴趣的人巨多（比如猫的视频），就产生大量这样的内容。\n\n因为所有人都喜欢猫的视频，所以猫的视频大量充斥网络和推荐算法，就是exactly我们需要解决的问题"
		},
		{
			"post_id": 22,
			"title": "竟不知言何",
			"date_published": 1523542219.433,
			"body": "我没有下载内涵段子app，因为我也确实不习惯有部分把低俗当开放，把无知当天真，为博眼球无所不为，但其实我也是俗人一个，也有低俗甚至恶俗的一面，我甚至还有阴暗不为人知的一面。\n\n可是，我虽然有在叫好，但其实心里是深不见底的悲哀。叫好，只是因为终于少了一些转发的精神污染把自己恶心到了，悲哀，却是因为不管我的喜好如何，有些东西都不应该被强权如此肆意践踏。\n\n* * *\n\n我有不喜欢的选择，但这决不是我不允许别人喜欢的理由，因为我喜欢的也有很多人同样不喜欢，我阴暗的一面估计也有不少人觉得要呕吐，但我应该消失于世吗？并不。我努力以普适的道德待人，我把我的恶俗收在我的世界里即可。就像这个APP，虽然恶俗不少，但，越过法律界限的，我想并不是全部。\n\n如今，也有人在听到APP被关停后咆哮，是啊，虽然有人不喜欢，但上面毕竟有让人喜欢的东西，即便只是让人看过一笑，也是在如今压力之下稍作释放吧。然而，永久关停的大棒却这样一刀切掉了，不免，让人看到的是赤裸裸的强权和独裁，是对某些东西毫不遮掩的肆意践踏。\n\n让人不禁想到之前，同样全网封禁某些大V，如出一辙，我不否认有些大V为博关注为夺人眼球也是采用了令人发指的手段，可是，全网封杀，这种让人彻底消失的做法，却不敢苟同。曾经，披着维护稳定的外衣禁止各种报道，今天，打着的是净化网络的旗号封杀传媒，明天，就可以以任意理由让任意群体任意一个人永远消失。\n\n不得不问，这究竟是为民众好，还是，为某些人好？\n\n对了，不知道如今在哀嚎的经常在看内涵段子的人，是否有曾经也叫嚣着支持封掉这个封掉那个呢？\n\n不知何时，会实现人人声音统一呢？曾经我觉得是《1984》，现在却觉得是现世。\n\n​​​​![img alt](img/blog/20180412/01.jpg) ​​​​![img alt](img/blog/20180412/02.jpg)\n\n心里堵得狠，不知言为何事，先这样吧，煎熬。\n\n----------------------update-------------------\n\n刚好写完文，去ZeroMe 逛的时候看到 @[Mv00](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/1BphMmzmrPc3zawVj6ES9va18a6PxJqb47/mv0@zeroid.bit) 一段话，借用过来表达下心里的堵点：\n\n> 段子案還拿道德來開刀，而不管法律程序，愛封就封，就是獨裁行為。寫段子什麼的，如果根本沒有相對應的法律那就是合法行為，就算觸及法律限制，也要上庭打打看，是否有足夠證據定罪。那些還用道德來說打得好的，什麼化石腦袋。\n\n[http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/1BphMmzmrPc3zawVj6ES9va18a6PxJqb47/1523535911](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/1BphMmzmrPc3zawVj6ES9va18a6PxJqb47/1523535911)"
		},
		{
			"post_id": 21,
			"title": "李沉简：挺直脊梁 拒做犬儒",
			"date_published": 1522152158.014,
			"body": "# <font color=\"Red\"> 尚未找到可信来源，以下消息仅供参考</font>\n\n3 月 22 日，传闻北京大学元培学院常务副院长李沉简发送文章《挺直脊梁 拒做犬儒》后辞职，通识副院长张旭东、院长鄂维南一并辞职（知乎网友指出李沉简、张旭东早在二月底的内部会议上辞职）。3 月 22 日下午 6:00 公众号「大帅直通车」推送文章，6:40 公众号被要求关闭，院内老师以微信语音、打电话等方式要求学生删除转发文章。\n\n================ 原文如下 =================\n\n* * *\n\n戊戌变法、北大建校一百二十年，我们纪念蔡元培校长。在中国近代史上，元培先生当之无愧是现代教育之父。他留给我们的 \"兼容并包，思想自由\" 是北大的精神火炬，代代相传。蔡校长在人们的印象里总是一个谦谦君子式的思想领袖。其实蔡校长的另外一个侧面同样是万世师表，那就是一个挺直脊梁、拒绝做犬儒的男子汉。\n\n早年的元培先生为了反抗清朝，一介书生却豁出命来组织训练暗杀团，意图刺杀清朝的官员。在后面的几十年里，他只认真理，不畏强权，在北大校长的任上曾先后八次辞职以示抗议：1917 年抗议张勋复辟清朝而辞职；1919 年 5 月营救被捕学生而辞职；1919 年底和 1920 年 1 月支持北京市教职员为薪酬抗议政府而辞职；1922 年 8 月 / 9 月两次为政府侮辱校长 / 拖欠教育经费而辞职；1923 年抗议教育总长践踏人权和司法独立而辞职；1926 年抗议政府镇压学生而辞职。 从这个意义上看，元培先生的 \"兼容并包，思想自由\" 是付出了极大的个人牺牲才使得当时的北大空前活跃 --- 既有全盘西化的胡适、也有追求共产主义的陈独秀李大钊毛泽东、甚至还有天天嚷着复辟清朝的拖辫子的辜鸿铭。各种思想在这里产生和碰撞。\n\nFreedom is never free. 自由从来不是天上掉下来的，而是有骨气的人们付出沉重的代价换来的，其中北大的先人多有这样的典范：胡适一辈子敢于批评蒋介石和国民党专制；马寅初坚持自己的学术观点，在批判之下拒不认错；林昭在疯狂的文革年代毫不退缩，只身和反人类的罪恶斗争到底，直至被枪杀。北大之所以成为中国神圣的殿堂，不仅因为她有思想，更因为她有为了理念不惜付出一切的师生。\n\n可是我们也要清醒客观地看到，上下五千年的历史，有脊梁的毕竟是少数，更多的是软骨头甚至为虎作伥：抗日战争里，中国创了人类历史上 \"伪军比占领军多\" 的记录；在大跃进、文革中，究竟有多少人是 \"受蒙蔽\"，有多少人是精明地昧着良心、为自保而诬陷同事、为加官进爵而落井下石？\n\n不仅民间 \"人在屋檐下不得不低头\"，\"好死不如赖活着\" 之类犬儒的生活教条深入人心，高级知识分子里的无耻之徒丝毫不比普罗大众少。上古就有在 \"指鹿为马\" 的当口曲意奉承、吮痈舐痔的臣子；当代有郭沫若这样满腹诗书的墙头草；更可怕的是像经过加州理工学院最良好科学训练的钱学森也连篇累牍地在报纸上为 \"亩产十几万斤\" 这样尽人皆知、笑掉大牙的谎言摇旗呐喊，而且还舔着脸发 \"钱学森之问\"——殊不知我们没有科学、人文社科大师的第一原因就是我们的教育系统性地培养精明乖巧的撒谎者，而不是真理的捍卫者：这和知识无关，和人格有关。\n\n这样的犬儒和无耻何以盛行？除了人性中固有的懦弱和卑微，社会几千年来对敢言者的持续绞杀当属首要原因。从文字狱到株连十族，当敢于 \"一士之谔谔\" 的人被消灭的时候，负淘汰的结果自然剩下的是 \"千士之诺诺\"。在这种千年严酷的条件下，人们甚至被剥夺了保持沉默的权利，而被强迫加入谄媚奉承的大合唱。\n\n不过，在漫长的历史中总有火种还顽强地燃烧。在北大，蔡元培、马寅初、胡适、林昭 ······ 承载着北大人的傲骨，公民的尊严。我们即使做不到振臂一呼，以笔为旗与懦弱卑微做不妥协的抗争，也至少做到不出卖人的起码尊严和思想独立。北大人、元培人当共勉。\n\nWhere there is darkness，may we bring light\n\nWhere there is despair, may we bring hope\n\nWhere there is doubt, may we bring faith\n\nWhere there is hatred, may we bring love\n\n戊戌双甲子，诸君拒做犬儒，\n\n北大一二〇，师生挺直脊梁。\n\n李沉简\n\n2018.2.28"
		},
		{
			"post_id": 20,
			"title": "转载：《2009匿名网民宣言》",
			"date_published": 1521967977.156,
			"body": "快十年过去了，如今，一切有变得更好吗？没有。再转发一次，重新告诉自己，曾经的美好期待。\n\n# 《2009匿名网民宣言》\n\n你好，中国政府网络审查部门。我们是匿名网民。长久以来，我们目视了你对互联网的所作所为。你对互联网言论自由的无端封锁，你对互联网先进技术的敌视，你勾结宣传喉舌对事实真相的扭曲，你运用网络评论员对网络舆论的的毒化，这些都深深地刻印在我们的记忆中。随着最近你绿坝强制安装的通知和对谷歌的恶毒诽谤的出炉，你全面控制全面审查互联网的险恶用心已经明白无误地展现在人们面前。我们匿名网民于此决定，我们将从2009年7月1日开始在全球范围内对你所控制的网络审查体系发起全面袭击。\n\n* * *\n\n*   为了保卫互联网的自由，为了推动人类网络化的前进，同时也为了我们自己的网络权利，我们将对你的网络审查体系进行系统性破坏并展现你所谓网络审查体系在真正网络力量之前的渺小。我们将你视为网络头号公敌。我们对你发起的将是持久战。无论你如何利用宣传喉舌愚弄舆论，你终将湮没在人民战争的汪洋大海之中。你古板的宣传手段，你文革般陈旧口号式的叫嚣，你对互联网的无知，你“为了下一代”之类的虚伪说辞，这些都为你的彻底失败敲响了丧钟。你无处可逃，因为我们无处不在。国家暴力机器不能拯救你，因为我们每一个成员的倒下，都意味着另外十名新成员的加入。我们清楚地意识到你会运用你惯常的阶级斗争伎俩，在你的蛊惑宣传中赋予我们“不明真相群众”的标签在我们与普通民众之间划出界线，然后赋予我们“少数不法分子”的标签在我们内部划出界线，最终各个击破。对我们来说，这是可以接受的。事实上，这是我们所鼓励的。原因很简单，你越这样看待你的人民，你皇帝新装的美丽就越 不言自喻。\n\n*   随着人类网络文明的发展，处于优势地位的统治阶级敌视网络化的陈旧意识形态逐渐成为历史发展进步的阻碍。旧意识形态势力对新兴网络势力的诬蔑和压迫，对网络世界的敌视和封锁，这些都表明了他们对于历史潮流的恐惧，都将成为他们在退出历史舞台之前的最后挣扎。那些妄图在历史车轮面前螳臂挡车的，都将最终被扫进历史的垃圾堆。即使你的血液正在得到数字移民的缓慢补充，你在可见的未来将仍然无法理解网络。我们会欣赏你对于异己几十年不变的阴谋论观点和文革口号文风，因为我们也会有怀旧的心情；我们也将笑谈你试图在互联网上划出国界的举动，因为愚蠢行为从来都是史书中的笑点。不过我们可以真诚地告诉你：\n\n*   没有人想要更迭你的政权，我们对你陈旧的政权概念和意识形态烂腌菜毫不感兴趣。你无法理解在人类网络化的历史潮流之前宏大叙事为何而消解，你也无法理解国家和民族概念为何将分崩离析，你无法改变你对互联网的无知。你的政权无法成为我们真正的敌人。我们不是任何国家和组织的朋友，我们也不是任何国家和组织的敌人。只有你是你自己最大的敌人，你正在为你自己掘下腐烂和异化的坟墓。我们对即将进入历史垃圾堆的事物没有兴趣。网络化是你无法阻挡的历史潮流，是人类社会发展的未来方向。事实上，我们并不反对你通过切断太平洋海底光缆而获得对信息的绝对控制；你对历史前进越阻碍、你造成的矛盾越深化、社会运动就越剧烈，倒退只能加速你被异化、被取代的历史进程。明日的太阳不会照耀那些恐惧明天的人。\n\n*   我们是匿名网民。我们是全球网民的总和。我们行为一体。我们是主宰网络。我们不可计数。我们每个成员的倒下都意味着十名新成员的加入。我们无处不在。我们无所不能。我们不可阻挡。我们没有弱点。我们利用一切弱点。我们是隐藏在每一张面具之下的人性。我们是人性的镜子。我们生而平等。我们天然自由。我们是军团。我们不饶恕。我们不忘记。\n\n# 自由引导网络　　我们即将到来"
		},
		{
			"post_id": 19,
			"title": "给以后的作家们留点素材",
			"date_published": 1507803305.121,
			"body": "很久没更博了，因为，实在不知道这盛世，该如何赞美。\n\n而近来的消息，真是令人目不暇接，一浪接一浪，让人消化不过来，索性，先记录着，万一后世有作家想不到小说素材或是电影人找不到拍摄题材时，能借用一下也是极好。\n\n[​​​​​​​​对比上一篇一起看，感觉很好玩](http://127.0.0.1:43110/zeee.bit/?Post:18)\n\n![img alt](img/blog/20171012/2017101201.jpg)\n\n* * *\n\n​​​​![img alt](img/blog/20171012/2017101202.jpg)\n​​​​![img alt](img/blog/20171012/2017101203.jpg)\n​​​​![img alt](img/blog/20171012/2017101204.jpg)\n​​​​![img alt](img/blog/20171012/2017101205.jpg)\n​​​​![img alt](img/blog/20171012/2017101206.jpg)\n​​​​![img alt](img/blog/20171012/2017101207.jpg)\n​​​​![img alt](img/blog/20171012/2017101208.jpg)\n​​​​![img alt](img/blog/20171012/2017101209.jpg)\n​​​​![img alt](img/blog/20171012/2017101210.jpg)\n​​​​![img alt](img/blog/20171012/2017101211.jpg)\n​​​​![img alt](img/blog/20171012/2017101212.jpg)\n​​​​![img alt](img/blog/20171012/2017101213.jpg)\n​​​​![img alt](img/blog/20171012/2017101214.jpg)"
		},
		{
			"post_id": 18,
			"title": "《批评官员的尺度》摘录",
			"date_published": 1505659004.959,
			"body": "**——若批评不自由，则赞美无意义。**（中文版封面）\n\n在kindle上又重温了一遍《批评官员的尺度》，不得不说，kindle太方便了，读书过程中看到好的东西直接批注或标记一下，再导出来，那么方便。\n\n_介绍：《批评官员的尺度:〈纽约时报〉诉警察局长沙利文案》内容简介：1960年，因为一则批评性广告，警察局长沙利文以诽谤为由，将《纽约时报》告上法庭，并申请巨额赔偿。两审失利后，几乎被各地官员相继提起的索赔逼至绝境的《纽约时报》，奋起上诉至联邦法院。九位大法官在“《纽约时报》诉沙利文案”中力挽狂澜，宣布“对公共事务的讨论应当不受抑制、充满活力并广泛公开”，维护了媒体、公民批评官员的自由。《纽约时报》资深记者、两度普利策奖得主安东尼• 刘易斯以翔实史料、生动笔触，系统回顾了这起新闻自由史上的“里程碑”案件，并循此为线，串接起美国民众关于言论自由的司法抗争历史，完美展现了霍姆斯、布兰代斯、汉德、沃伦、布伦南、布莱克、韦克斯勒等伟大法官、律师的形象。_\n\n我们来看看那些经典的语句吧，相信，看完了对现在的社会会有所想法。\n\n*   1、杰弗逊在总统就职演说中表达的政治理念：“如果我们当中有任何人试图令联邦解体，或者改变共和政体，就让他们不受任何干扰地畅所欲言吧。容忍错误意见的存在，让不同观点辩驳交锋，正是我们得享安全的基石。”\n*   2、宪法禁止处罚任何思想、信仰的传播，无论在多数人眼中，这些思想或信仰有多么荒谬，多么危险。他写道：“在宪法第一修正案项下，没有什么错误思想之说。无论一种思想看起来多么有害，我们赖以校正它的，不是法官或陪审团的良心，而是其他思想的竞争。”\n*   3、不能把对政府的批评，等同于对官员的诽谤，\n*   4、霍姆斯大法官在异议意见中，提醒人们“应当对某种做法时刻保持警惕，那就是对那些我们深恶痛绝，甚至认为罪该万死的言论的不当遏制”。\n\n* * *\n\n*   5、在言论自由与宪政体制内的其他重要价值（如公民名誉权）之间保持平衡\n*   6、在言论自由与宪政体制内的其他重要价值（如公民名誉权）之间保持平衡。名誉，是人们自我认知的重要因素，损害名誉就是破坏一个人的完整性。\n*   7、判决不仅将言论自由视为公民的固有权利，还将之视为良好政治的必要条件。\n*   8、是人民，而不是政府，拥有绝对主权”，这是美国政制与英国制度的“本质区别”。以及麦迪逊稍早前在众议院说过的话：“如果我们留意共和政府的性质，我们不难发现：如果有检查言论的权力，那也应当是人民检查政府的言论，而不是政府检查人民的言论。”\n*   9、它不仅约束了人民自由检视公众人物和公共事务的权利，还限制了人民自由沟通的权利。\n*   10、全国有色人种协进会案”的判词：“在自由争论中，错误意见不可避免；如果自由表达要找到赖以生存的呼吸空间，就必须保护错误意见的表达。”\n*   11、援引自“全国有色人种协进会案”的判词：“在自由争论中，错误意见不可避免；如果自由表达要找到赖以生存的呼吸空间，就必须保护错误意见的表达。”\n*   12、自由的本质所在：容忍不受限制，甚至刻薄、尖锐的争论\n*   13、如果有检查言论的权力，那也应当是人民检查政府的言论，而不是政府检查人民的言论”。\n*   14、人民有权获知政府的日常作为，无论这些作为是否正当。充分的资讯是遏制恶政的最有效手段。\n*   15、严厉追惩的威胁，逼迫编辑、记者们不得不进行自我审查，这对表达自由的威慑程度，要远大于正式的法律限制。但是，多数人仍然认为，事前限制有时比事后追惩更具钳制力。对一个出版物申请事前禁令，法官一人即可作出决定，但若想对出版者进行刑事追诉，必领由陪审团定罪。况且，出版物出炉前，若想阻止其发行，申请人可以向法官渲染夸大出版后可能导致的严重后果。但是，当事人如果在出版后提起诉讼，\n*   16、这项自由，不仅属于那些我们所赞同的思想，也包括我们深恶痛绝的思想的自由。\n*   17、靠更多言论矫正异议，而非强制他人噤声沉默。\n*   18、禁锢思想、希望和想象会招致更多危险；恐惧会滋生更多压迫；压迫会引发更多仇恨；仇恨必将危及政府的稳定。保障安全的万全之策，在于保证人们能够自由讨论各种困境及解决方案。\n*   19、自由的最大威胁，是思维僵化、消极冷漠的民众。\n*   20、自由思考，畅所欲言，是探索和传播政治真理不可或缺的途径。\n*   21、国家的终极目的，是协助人们自由、全面地发展；在政府内部，民主协商的力量，应超过独裁专断的势力。\n*   22、言论自由的唯一含义，就是给予这一理念被传播的机会，使它有自己的发展空间。\n*   23、表达某种意见和狭义上的煽动行为的区别在于，演说者是不是热衷于实现自己所要表述的思想。\n*   24、任何思想都有煽动性，总想得到他人的认同，\n*   25、我们应当对某种做法时刻保持警惕，那就是对那些我们深恶痛绝，甚至认为罪该万死的言论的不当遏制\n*   26、达至心中至善的最好方式，是不同思想的自由交流。也就是说，如果我们想确定一种思想是否真理，就应让它在思想市场的竞争中接受检验。\n*   27、只有对可能立即引发现实危险，或者意图如此的行为，国会才能在未涉及个人权利的前提下，对言论自由施加限制。\n*   28、所有关于言论自由的争议中，最为关键的，是国家是否有权惩治任何具有某种倾向的言论，哪怕这种倾向有多么不明显。在我看来，只有直接煽动违法的言论，才应受到处罚。”\n*   29、我们假设自己永远正确。\n*   30、设置“煽动诽谤政府罪”，是“全世界封闭社会的共同特征，在这样的社会里，批评政府就是诽谤，并构成严重罪行。如果政府以强力逼迫批评者噤声，政治自由将荡然无存。在我看来，一个社会如果保留煽动诽谤政府罪，这个社会就算不上自由社会”。\n*   31、这是美国法官首次在判决书中阐释言论自由和出版自由的意义。 汉德法官说，《群众》杂志刊载的文章和漫画，“虽对战争充满敌意”，“\n*   32、“是人民，而不是政府，拥有绝对主权”\n*   33、“自由检视公众人物和公共事务的权利”\n*   34、这一时期的美国，政府对舆论的压制，完全受政党利益驱动。1798 年 6 月，参议院将相关法律草案交付审议，在联邦党议员的一致推动下，草案于 7 月 4 日正式通过。联邦党人刻意选择这个日子，旨在强化这部法律的爱国色彩。7 月 10 日，众议院审议通过此法。\n*   35、任何普遍意见，又或主流观点，却不可能囊括全部真理，只有让各种观点彼此辩驳印证，真理才会越辩越明。\n*   36、设置“煽动诽谤政府罪”，是“全世界封闭社会的共同特征，在这样的社会里，批评政府就是诽谤，并构成严重罪行。如果政府以强力逼迫批评者噤声，政治自由将荡然无存。在我看来，一个社会如果保留煽动诽谤政府罪，这个社会就算不上自由社会”。 既然今人如此批判“煽动诽谤政府罪”，17、18 世纪那些“热爱自由的英国人”，又怎么能容忍这类罪名的存在？\n*   37、出版许可制（the practice of licensing the press）。\n*   38、出版自由是自由的重要屏障之一，只有独裁政府，才会压制这一自由。”\n*   39、这是值得当街起舞的时刻”。\n*   40、依法禁止某种言论并不可怕，可怕的是禁止者不给出明确的认定标准，想查禁什么言论，就随意给某种言论贴上禁止“标签”。\n\n既然看到这里了，感觉应该要放个购买 链接了：[批评官员的尺度:《纽约时报》诉警察局长沙利文案](https://www.amazon.cn/%E6%89%B9%E8%AF%84%E5%AE%98%E5%91%98%E7%9A%84%E5%B0%BA%E5%BA%A6-%E7%BA%BD%E7%BA%A6%E6%97%B6%E6%8A%A5-%E8%AF%89%E8%AD%A6%E5%AF%9F%E5%B1%80%E9%95%BF%E6%B2%99%E5%88%A9%E6%96%87%E6%A1%88-%E5%AE%89%E4%B8%9C%E5%B0%BC%E5%88%98%E6%98%93%E6%96%AF/dp/B005C2YO8U/ref=sr_1_1?s=books&ie=UTF8&qid=1505660058&sr=1-1)\n\n[言论的边界: 美国宪法第一修正案简史](https://www.amazon.cn/图书/dp/B01IEZ3996/ref=sr_1_4?s=books&ie=UTF8&qid=1505660058&sr=1-4)\n\n第二本《言论的边界》还正在看，也是冲击很大啊。"
		},
		{
			"post_id": 17,
			"title": "[转】网信办两则规定",
			"date_published": 1505216629.534,
			"body": "**第一则 《互联网用户公众账号信息服务管理规定》**\n　　网信办印发《互联网用户公众账号信息服务管理规定》，要求互联网用户公众账号信息服务提供者和使用者（微信公众号、微博账号等），应坚持正确导向，弘扬社会主义核心价值观，应对用户公众账号留言、跟帖、评论等互动环节进行实时管理。该规定自 2017 年 10 月 8 日正式施行。\n\n　　《互联网用户公众账号信息服务管理规定》提出，互联网用户公众账号服务提供者应落实信息内容安全管理主体责任，加强对本平台公众账号发布内容的监测管理，发现有传播违法违规信息的，应立即采取相应处置措施等。\n\n　　在各类社交网站和客户端开设的用户公众账号，如腾讯微信公众号、新浪微博账号；百度的百家号、网易的网易号，今日头条的头条号、一点资讯的一点号；在知乎、分答等互动平台开设的对公众答复的用户公众账号等，均在本规定适用范围内。\n\n　　国家网信办有关负责人表示，互联网用户公众账号服务提供者应落实信息内容安全管理主体责任。要配备与服务规模相适应的专业人员和技术能力，设立总编辑等信息内容安全负责人岗位，建立健全管理制度；对违反法律法规、服务协议和平台公约的互联网用户公众账号依法依规立即处理等。\n\n　　对于公众号未经授权转载文章侵犯知识产权的行为，规定要求，互联网用户公众账号信息服务使用者应当遵守新闻信息管理、知识产权保护、网络安全保护等法律法规和有关规定，依法依规转载信息，保护著作权人合法权益。该规定自 2017 年 10 月 8 日正式施行。\n\n　　以下为规定全文：\n\n---\n\n> **互联网用户公众账号信息服务管理规定**\n> \n> **第一条** 为规范互联网用户公众账号信息服务，维护国家安全和公共利益，保护公民、法人和其他组织的合法权益，根据《中华人民共和国网络安全法》《国务院关于授权国家互联网信息办公室负责互联网信息内容管理工作的通知》，制定本规定。\n> \n> **第二条** 在中华人民共和国境内提供、使用互联网用户公众账号从事信息发布服务，应当遵守本规定。\n> \n> 　　本规定所称互联网用户公众账号信息服务，是指通过互联网站、应用程序等网络平台以注册用户公众账号形式，向社会公众发布文字、图片、音视频等信息的服务。\n> \n> 　　本规定所称互联网用户公众账号信息服务提供者，是指提供互联网用户公众账号注册使用服务的网络平台。本规定所称互联网用户公众账号信息服务使用者，是指注册使用或运营互联网用户公众账号提供信息发布服务的机构或个人。\n> \n> 　　**第三条** 国家互联网信息办公室负责全国互联网用户公众账号信息服务的监督管理执法工作，地方互联网信息办公室依据职责负责本行政区域内的互联网用户公众账号信息服务的监督管理执法工作。\n> \n> 　　**第四条** 互联网用户公众账号信息服务提供者和使用者，应当坚持正确导向，弘扬社会主义核心价值观，培育积极健康的网络文化，维护良好网络生态。\n> \n> 　　鼓励各级党政机关、企事业单位和人民团体注册使用互联网用户公众账号发布政务信息或公共服务信息，服务经济社会发展，满足公众信息需求。\n> \n> 　　互联网用户公众账号信息服务提供者应当配合党政机关、企事业单位和人民团体提升政务信息发布和公共服务水平，提供必要的技术支撑和信息安全保障。\n> \n> 　　**第五条** 互联网用户公众账号信息服务提供者应当落实信息内容安全管理主体责任，配备与服务规模相适应的专业人员和技术能力，设立总编辑等信息内容安全负责人岗位，建立健全用户注册、信息审核、应急处置、安全防护等管理制度。\n> \n> 　　互联网用户公众账号信息服务提供者应当制定和公开管理规则和平台公约，与使用者签订服务协议，明确双方权利义务。\n> \n> 　　**第六条** 互联网用户公众账号信息服务提供者应当按照 “后台实名、前台自愿” 的原则，对使用者进行基于组织机构代码、身份证件号码、移动电话号码等真实身份信息认证。使用者不提供真实身份信息的，不得为其提供信息发布服务。\n> \n> 　　互联网用户公众账号信息服务提供者应当建立互联网用户公众账号信息服务使用者信用等级管理体系，根据信用等级提供相应服务。\n> \n> 　　**第七条** 互联网用户公众账号信息服务提供者应当对使用者的账号信息、服务资质、服务范围等信息进行审核，分类加注标识，并向所在地省、自治区、直辖市互联网信息办公室分类备案。\n> \n> 　　互联网用户公众账号信息服务提供者应当根据用户公众账号的注册主体、发布内容、账号订阅数、文章阅读量等建立数据库，对互联网用户公众账号实行分级分类管理，制定具体管理制度并向国家或省、自治区、直辖市互联网信息办公室备案。\n> \n> 　　互联网用户公众账号信息服务提供者应当对同一主体在同一平台注册公众账号的数量合理设定上限；对同一主体在同一平台注册多个账号，或以集团、公司、联盟等形式运营多个账号的使用者，应要求其提供注册主体、业务范围、账号清单等基本信息，并向所在地省、自治区、直辖市互联网信息办公室备案。\n> \n> 　　**第八条** 依法取得互联网新闻信息采编发布资质的互联网新闻信息服务提供者，可以通过开设的用户公众账号采编发布新闻信息。\n> \n> 　　**第九条** 互联网用户公众账号信息服务提供者应当采取必要措施保护使用者个人信息安全，不得泄露、篡改、毁损，不得非法出售或者非法向他人提供。\n> \n> 　　互联网用户公众账号信息服务提供者在使用者终止使用服务后，应当为其提供注销账号的服务。\n> \n> 　　**第十条** 互联网用户公众账号信息服务使用者应当履行信息发布和运营安全管理责任，遵守新闻信息管理、知识产权保护、网络安全保护等法律法规和国家有关规定，维护网络传播秩序。\n> \n> 　　**第十一条** 互联网用户公众账号信息服务使用者不得通过公众账号发布法律法规和国家有关规定禁止的信息内容。\n> \n> 　　互联网用户公众账号信息服务提供者应加强对本平台公众账号的监测管理，发现有发布、传播违法信息的，应当立即采取消除等处置措施，防止传播扩散，保存有关记录，并向有关主管部门报告。\n> \n> 　　**第十二条** 互联网用户公众账号信息服务提供者开发上线公众账号留言、跟帖、评论等互动功能，应当按有关规定进行安全评估。\n> \n> 　　互联网用户公众账号信息服务提供者应当按照分级分类管理原则，对使用者开设的用户公众账号的留言、跟帖、评论等进行监督管理，并向使用者提供管理权限，为其对互动环节实施管理提供支持。\n> \n> 　　互联网用户公众账号信息服务使用者应当对用户公众账号留言、跟帖、评论等互动环节进行实时管理。对管理不力、出现法律法规和国家有关规定禁止的信息内容的，互联网用户公众账号信息服务提供者应当依据用户协议限制或取消其留言、跟帖、评论等互动功能。\n> \n> 　　**第十三条** 互联网用户公众账号信息服务提供者应当对违反法律法规、服务协议和平台公约的互联网用户公众账号，依法依约采取警示整改、限制功能、暂停更新、关闭账号等处置措施，保存有关记录，并向有关主管部门报告。\n> \n> 　　互联网用户公众账号信息服务提供者应当建立黑名单管理制度，对违法违约情节严重的公众账号及注册主体纳入黑名单，视情采取关闭账号、禁止重新注册等措施，保存有关记录，并向有关主管部门报告。\n> \n> 　　**第十四条** 鼓励互联网行业组织指导推动互联网用户公众账号信息服务提供者、使用者制定行业公约，加强行业自律，履行社会责任。\n> \n> 　　鼓励互联网行业组织建立多方参与的权威专业调解机制，协调解决行业纠纷。\n> \n> 　　**第十五条** 互联网用户公众账号信息服务提供者和使用者应当接受社会公众、行业组织监督。\n> \n> 　　互联网用户公众账号信息服务提供者应当设置便捷举报入口，健全投诉举报渠道，完善恶意举报甄别、举报受理反馈等机制，及时公正处理投诉举报。国家和地方互联网信息办公室依据职责，对举报受理落实情况进行监督检查。\n> \n> 　　**第十六条** 互联网用户公众账号信息服务提供者和使用者应当配合有关主管部门依法进行的监督检查，并提供必要的技术支持和协助。\n> \n> 　　互联网用户公众账号信息服务提供者应当记录互联网用户公众账号信息服务使用者发布内容和日志信息，并按规定留存不少于六个月。\n> \n> 　　**第十七条** 互联网用户公众账号信息服务提供者和使用者违反本规定的，由有关部门依照相关法律法规处理。\n> \n> 　　**第十八条** 本规定自 2017 年 10 月 8 日起施行。\n\n**第二则 《互联网群组信息服务管理规定》**\n\n　　据网信办发布《互联网群组信息服务管理规定》提出，互联网群组建立者、管理者应履行群组管理责任，群里有违法违规信息，谁建群谁负责，谁管理谁负责，该规定自 2017 年 10 月 8 日正式施行。\n\n　　《规定》强调，互联网群组信息服务提供者应当对互联网群组信息服务使用者进行真实身份信息认证，建立信用等级管理体系，合理设定群组规模，实施分级分类管理，并采取必要措施保护使用者个人信息安全。\n\n　　以下是《规定》全文。\n\n> **互联网群组信息服务管理规定**\n> \n> **第一条** 为规范互联网群组信息服务，维护国家安全和公共利益，保护公民、法人和其他组织的合法权益，根据《中华人民共和国网络安全法》《国务院关于授权国家互联网信息办公室负责互联网信息内容管理工作的通知》，制定本规定。\n> \n> 　　**第二条** 在中华人民共和国境内提供、使用互联网群组信息服务，应当遵守本规定。\n> \n> 　　本规定所称互联网群组，是指互联网用户通过互联网站、移动互联网应用程序等建立的，用于群体在线交流信息的网络空间。本规定所称互联网群组信息服务提供者，是指提供互联网群组信息服务的平台。本规定所称互联网群组信息服务使用者，包括群组建立者、管理者和成员。\n> \n> 　　**第三条** 国家互联网信息办公室负责全国互联网群组信息服务的监督管理执法工作。地方互联网信息办公室依据职责负责本行政区域内的互联网群组信息服务的监督管理执法工作。\n> \n> 　　**第四条** 互联网群组信息服务提供者和使用者，应当坚持正确导向，弘扬社会主义核心价值观，培育积极健康的网络文化，维护良好网络生态。\n> \n> 　　**第五条** 互联网群组信息服务提供者应当落实信息内容安全管理主体责任，配备与服务规模相适应的专业人员和技术能力，建立健全用户注册、信息审核、应急处置、安全防护等管理制度。\n> \n> 　　互联网群组信息服务提供者应当制定并公开管理规则和平台公约，与使用者签订服务协议，明确双方权利义务。\n> \n> 　　**第六条** 互联网群组信息服务提供者应当按照 “后台实名、前台自愿” 的原则，对互联网群组信息服务使用者进行真实身份信息认证，用户不提供真实身份信息的，不得为其提供信息发布服务。\n> \n> 　　互联网群组信息服务提供者应当采取必要措施保护使用者个人信息安全，不得泄露、篡改、毁损，不得非法出售或者非法向他人提供。\n> \n> 　　**第七条** 互联网群组信息服务提供者应当根据互联网群组的性质类别、成员规模、活跃程度等实行分级分类管理，制定具体管理制度并向国家或省、自治区、直辖市互联网信息办公室备案，依法规范群组信息传播秩序。\n> \n> 　　互联网群组信息服务提供者应当建立互联网群组信息服务使用者信用等级管理体系，根据信用等级提供相应服务。\n> \n> 　　**第八条** 互联网群组信息服务提供者应当根据自身服务规模和管理能力，合理设定群组成员人数和个人建立群数、参加群数上限。\n> \n> 　　互联网群组信息服务提供者应设置和显示唯一群组识别编码，对成员达到一定规模的群组要设置群信息页面，注明群组名称、人数、类别等基本信息。\n> \n> 　　互联网群组信息服务提供者应根据群组规模类别，分级审核群组建立者真实身份、信用等级等建群资质，完善建群、入群等审核验证功能，并标注群组建立者、管理者及成员群内身份信息。\n> \n> 　　**第九条** 互联网群组建立者、管理者应当履行群组管理责任，依据法律法规、用户协议和平台公约，规范群组网络行为和信息发布，构建文明有序的网络群体空间。\n> \n> 　　互联网群组成员在参与群组信息交流时，应当遵守法律法规，文明互动、理性表达。\n> \n> 　　互联网群组信息服务提供者应为群组建立者、管理者进行群组管理提供必要功能权限。\n> \n> 　　**第十条** 互联网群组信息服务提供者和使用者不得利用互联网群组传播法律法规和国家有关规定禁止的信息内容。\n> \n> 　　**第十一条** 互联网群组信息服务提供者应当对违反法律法规和国家有关规定的互联网群组，依法依约采取警示整改、暂停发布、关闭群组等处置措施，保存有关记录，并向有关主管部门报告。\n> \n> 　　互联网群组信息服务提供者应当对违反法律法规和国家有关规定的群组建立者、管理者等使用者，依法依约采取降低信用等级、暂停管理权限、取消建群资格等管理措施，保存有关记录，并向有关主管部门报告。\n> \n> 　　互联网群组信息服务提供者应当建立黑名单管理制度，对违法违约情节严重的群组及建立者、管理者和成员纳入黑名单，限制群组服务功能，保存有关记录，并向有关主管部门报告。\n> \n> 　　**第十二条** 互联网群组信息服务提供者和使用者应当接受社会公众和行业组织的监督，建立健全投诉举报渠道，设置便捷举报入口，及时处理投诉举报。国家和地方互联网信息办公室依据职责，对举报受理落实情况进行监督检查。\n> \n> 　　鼓励互联网行业组织指导推动互联网群组信息服务提供者制定行业公约，加强行业自律，履行社会责任。\n> \n> 　　**第十三条** 互联网群组信息服务提供者应当配合有关主管部门依法进行的监督检查，并提供必要的技术支持和协助。\n> \n> 　　互联网群组信息服务提供者应当按规定留存网络日志不少于六个月。\n> \n> 　　**第十四条** 互联网群组信息服务提供者和使用者违反本规定的，由有关部门依照相关法律法规处理。\n> \n> 　　**第十五条** 本规定自 2017 年 10 月 8 日起施行。"
		},
		{
			"post_id": 16,
			"title": "【网络有记忆】之“你们懂的”",
			"date_published": 1504448656.641,
			"body": "@江宁婆婆：[摊手]社会社会 (我打过码了，求放过)←(括弧里的可以随便删) ​​​​![img alt](img/blog/jn-deleted.jpg)\n\n@紫光阁：怕你再被删帖[微笑]//@共青团中央: 文章已恢复，可以正常阅读[微笑] ![img alt](img/blog/zgg.jpg)\n\n* * *\n\n@中央气象台：你们在微博上搜索不到我？那是没有使用正确的姿势。因为有些你们懂的原因，直接搜索我的微博名称很可能搜不到，所以这时候你就可以把着急词换成“萌台”，然后在下面的搜索结果里找“@中央气象台”的字样就可以啦。\n\n@GYang6116:糟糕，刚刚收到The China Quarterly《中国季刊》主编的通报，该刊收到一份禁单，上列300余篇发表在该刊上的文章，在国内被封。当代中国研究最重根据国际刊物，受到如此限制，情何以堪！闻所未闻啊。……\n@剑桥大学：《剑桥大学声明》：日前，根据中国进品商的一个要求，剑桥大学出版社不情愿地在它的中国境内网站上屏蔽了《中国季刊》的315篇文章……\n\n已经不知道@江宁婆婆 倒底发了什么被删除了，@江宁婆婆 作为一名公职人员（@江宁公安在线 的微博管理员），其发言已算很谨慎，然而期微博还是不知道触到了什么红线被删除。\n\n这让人想起 @共青团中央 被删微博一事，其发表了关于赵微的文章，然后新浪把它删除了，共青团中央的微博被删除，一时网络哗然，这背后是谁这么大的力量居然删除此账号的文章，直到后面共青团重发，网络看热闹的越来越多才重新给恢复，然后 @紫光阁 （中共中央国家机关工作委员会《紫光阁》杂志社 官方微博）即刻转发并直接点出：怕你再被删帖。此微博才得以一直存活至今。\n\n@中央气象台 的微博看着卖萌，其背后的故事却让人萌不起来，因为微博名称包括了“中央”两个字，便在某一时期无法被搜索到，无奈的说了“因为有些你们懂的原因”，可是，这原因，谁真正懂过？因为有些你们懂的原因，不，我们并不懂，我们想搞懂，但“搞懂”的此路不通。\n\n有网友吐槽 剑桥大学出版社 的一刊物屏蔽了300多篇文章，随后剑桥大学的声明表明了此事为真，真是国内已不足以让某些人丢脸，竟然把脸丢到了国际上，不过想想，他们也不在乎这点脸面了，因为，根本没有脸。剑桥大学的声明里提到了一个词，学术自由，真是让人悲哀又无奈。\n\n曾经觉得政治控制下的宣传可怕，后来发现，资本控制下的媒体同样可怕。中国媒体人，真是悲哀，在这种双重夹击下，还谈什么理想呢。\n\n滚滚潮流向前，希望有一天，历史的记忆会醒过来，告诉人们曾经的故事。"
		},
		{
			"post_id": 14,
			"title": "【转】网信办：网站不得向未实名认证用户提供跟帖评论服务",
			"date_published": 1503665496.473,
			"body": "来源：[http://tech.sina.com.cn/i/2017-08-25/doc-ifykiuaz0700282.shtml](http://tech.sina.com.cn/i/2017-08-25/doc-ifykiuaz0700282.shtml)\n\n人民日报客户端 - 张洋\n\n　　国家互联网信息办公室 8 月 25 日公布《互联网跟帖评论服务管理规定》（以下简称《规定》），自 2017 年 10 月 1 日起施行。国家互联网信息办公室有关负责人表示，出台《规定》旨在深入贯彻《网络安全法》精神，提高互联网跟帖评论服务管理的规范化、科学化水平，促进互联网跟帖评论服务健康有序发展。\n\n　　《规定》共计十三条。第一条至第三条，对目的依据、适用范围、监管主体作出规定。第四条，对跟帖评论新产品新应用新功能进行安全评估作出规定。第五条，对跟帖评论服务提供者主体责任作出规定。第六条，对跟帖评论服务提供者及其用户自律作出规定。第七条，对跟帖评论服务提供者及其从业人员不得干预舆论作出规定。第八条和第九条，对跟帖评论服务提供者加强用户管理作出规定。第十条，对建立公众投诉和举报制度作出规定。第十一条和第十二条，对违反《规定》的行为的法律责任作出规定。第十三条，对公布实施作出规定。\n\n　　国家互联网信息办公室有关负责人强调，《规定》的出台对于加强互联网跟帖评论服务管理、促进互联网跟帖评论服务发展，具有重要意义。各级互联网信息办公室要切实强化属地管理责任，依法开展互联网跟帖评论服务管理。互联网跟帖评论服务提供者要严格履行主体责任，健全各项规章制度，不断强化人员队伍建设，依法提供互联网跟帖评论服务。\n\n* * *\n\n　　国家互联网信息办公室有关负责人就《互联网跟帖评论服务管理规定》答记者问\n\n　　8 月 25 日，国家互联网信息办公室公布了《互联网跟帖评论服务管理规定》（以下简称《规定》），国家互联网信息办公室有关负责人就《规定》相关问题回答了记者的提问。\n\n　　问：请您介绍一下《规定》出台的背景？\n\n　　答：出台专门规范跟帖评论服务的管理规定，主要基于以下三个方面的考虑。一是适应深入推进依法行政的需要。今年正式实施的《网络安全法》，是网络安全的基本法，对网络信息安全提出了明确要求。跟帖评论作为网络信息的重要组成部分，需要严格依照《网络安全法》的规定，设定相关制度。二是适应跟帖评论服务管理规范化的需要。跟帖评论服务丰富了人民群众的网络生活，但同时也出现了传播网络谣言、散布污言秽语、发布违法违规信息等不良现象，扰乱信息传播秩序，破坏网络舆论生态，需要依法加强治理。三是适应促进跟帖评论服务健康发展的需要。跟帖评论服务已经成为各类传播平台的 “标配”，新形式新功能不断涌现，日益成为广大网民互动交流、表达意见、舆论监督的重要方式，需要依法促其健康有序发展。\n\n　　问：《规定》的主要依据有哪些？\n\n　　答：《规定》主要的上位法依据包括《网络安全法》《国务院关于授权国家互联网信息办公室负责互联网信息内容管理工作的通知》。起草过程中，依据适用于跟帖评论的上位法相关条款，对用户真实身份登记、个人信息保护、违法信息处置、用户行为规范、网站主体责任、属地管理责任、社会监督和法律责任等作了规定。\n\n　　问：《规定》的主要框架和内容是什么？\n\n　　答：《规定》共十三条。第一条至第三条，主要对目的、依据、原则、适用范围、监管主体作出规定。第四条，主要对跟帖评论新产品、新应用、新功能进行安全评估作出规定。第五条，主要对跟帖评论服务提供者落实主体责任作出规定。第六条，主要对跟帖评论服务提供者及跟帖评论服务使用者自律作出规定。第七条，主要对跟帖评论服务提供者及其从业人员不得为谋取不正当利益干预舆论作出规定。第八条和第九条，主要对跟帖评论服务提供者加强用户管理、开展信用评估作出规定。第十条，主要对建立公众投诉和举报制度作出规定。第十一条和第十二条，主要对违反《规定》的行为的法律责任作出规定。第十三条，对公布实施作出规定。\n\n　　问：《规定》对保护公民的权益方面作了哪些规定？\n\n　　答：《规定》把对公民合法权益的保护作为重点内容之一。一是规定了个人信息保护的要求，《规定》要求跟帖评论服务提供者要依法履行用户信息保护义务，建立健全用户信息保护制度。二是禁止跟帖评论服务提供者及其从业人员非法牟利，明确要求不得为谋取不正当利益或基于错误价值取向有选择地删除、推荐跟帖评论，不得利用软件、雇佣商业机构及人员等方式散布信息。三是强化信息安全保护，要求跟帖评论服务提供者加强技术保障，及时发现存在的安全缺陷、漏洞等风险，并采取补救措施。四是建立举报监督制度，要求跟帖评论服务提供者建立健全违法信息公众投诉举报制度，及时受理和处置公众投诉举报。同时，规定国家和省、自治区、直辖市互联网信息办公室建立互联网跟帖评论服务提供者的信用档案和失信黑名单管理制度，加强对互联网跟帖评论服务提供者的管理监督和失信惩戒。\n\n　　问：《规定》对网站落实主体责任作出了哪些要求？\n\n　　答：网上信息管理，网站应负主体责任，政府行政管理部门要加强监管。《规定》认真落实这一要求，对网站主体责任进行了明确规定，主要包括八个方面。一是落实实名制要求。《规定》明确网站要按照 “后台实名、前台自愿” 原则，对注册用户进行真实身份信息认证，不得向未认证真实身份信息的用户提供跟帖评论服务。二是建立用户信息保护制度。《网络安全法》第四十条、四十一条、四十二条、四十三条、四十四条、四十五条对用户信息保护制度作了规定，国家标准化部门正抓紧组织制定《个人信息安全规范》，因此本《规定》仅对此作了原则性表述。三是建立先审后发制度。《网络安全法》规定网络运营者应当加强对其用户发布信息的管理。建立先审后发制度，目的在于推动网站负起管理责任，当好跟帖评论的 “把关人”，维护跟帖评论良好生态。四是加强弹幕管理。弹幕日益成为网民尤其是年轻网民网上交流的重要方式，为维护弹幕正常秩序，防止在弹幕环节传播违法违规信息，《规定》要求提供弹幕服务的网站要在同一平台和页面同时提供与之对应的静态版信息内容。五是建立信息安全管理制度。《规定》明确网站要建立跟帖评论审核管理、实时巡查、应急处置等信息安全管理制度，及时发现和处置违法信息。需要说明的是，该条规定针对的是用户公开发布的信息，而不是个人通信信息，不会损害个人隐私；要求处置的是违法信息，也不存在妨碍言论自由问题。六是技术保障措施。《规定》明确网站要研发使用反垃圾信息管理系统，提升垃圾信息处理能力。七是加强队伍建设。《规定》要求网站审核编辑人员的数量和能力要与服务规模相适应，以解决审核人力不足和质量不高的问题。八是配合有关主管部门依法开展监督检查工作，提供必要的技术、资料和数据支持。\n\n　　总之，落实网站在跟帖评论管理方面的主体责任，关键是严格执行《网络安全法》第十二条第二款的规定：“任何个人和组织使用网络应当遵守宪法法律，遵守公共秩序，尊重社会公德，不得危害网络安全，不得利用网络从事危害国家安全、荣誉和利益，煽动颠覆国家政权、推翻社会主义制度，煽动分裂国家、破坏国家统一，宣扬恐怖主义、极端主义，宣扬民族仇恨、民族歧视，传播暴力、淫秽色情信息，编造、传播虚假信息扰乱经济秩序和社会秩序，以及侵害他人名誉、隐私、知识产权和其他合法权益等活动。”\n\n　　问：《规定》对落实属地管理责任作出了哪些要求？\n\n　　答：除强化网站主体责任外，《规定》还对属地管理责任提出了明确要求。一是加强监督管理执法工作。《规定》明确地方互联网信息办公室负责本行政区域的跟帖评论服务的监督管理执法工作，建立健全日常检查和定期检查相结合的监督管理制度，依法规范各类传播平台的跟帖评论服务行为。二是进行安全评估。《规定》明确国家或省、自治区、直辖市互联网信息办公室对属地传播平台提供互联网新闻信息服务相关的跟帖评论新产品、新应用、新功能进行安全评估。三是开展信用评估。《规定》明确国家和省、自治区、直辖市互联网信息办公室应当定期对跟帖评论服务提供者开展信用评估，建立信用档案和失信黑名单管理制度。四是安全管理责任追究。《规定》明确国家和省、自治区、直辖市互联网信息办公室对跟帖评论服务提供者信息安全管理责任落实不到位，存在较大安全风险或者发生安全事件的，应当及时约谈、要求整改。\n\n　　问：对于违反《规定》的行为，规定了哪些处理措施？\n\n　　答：《网络安全法》以及其他相关法律法规，对违反《规定》的法律责任进行了具体表述。《规定》秉持简便原则，在条文中明确了 “由有关部门依照相关法律法规处理” 的原则，对具体处理措施不再赘述。\n\n* * *\n\n以下为《规定》全文：\n\n<div style=\"font-align:left;background-color:#eee\">\n互联网跟帖评论服务管理规定\n\n　　第一条 为规范互联网跟帖评论服务，维护国家安全和公共利益，保护公民、法人和其他组织的合法权益，根据《中华人民共和国网络安全法》《国务院关于授权国家互联网信息办公室负责互联网信息内容管理工作的通知》，制定本规定。\n\n　　第二条 在中华人民共和国境内提供跟帖评论服务，应当遵守本规定。\n\n　　本规定所称跟帖评论服务，是指互联网站、应用程序、互动传播平台以及其他具有新闻舆论属性和社会动员功能的传播平台，以发帖、回复、留言、“弹幕” 等方式，为用户提供发表文字、符号、表情、图片、音视频等信息的服务。\n\n　　第三条 国家互联网信息办公室负责全国跟帖评论服务的监督管理执法工作。地方互联网信息办公室依据职责负责本行政区域的跟帖评论服务的监督管理执法工作。\n\n　　各级互联网信息办公室应当建立健全日常检查和定期检查相结合的监督管理制度，依法规范各类传播平台的跟帖评论服务行为。\n\n　　第四条 跟帖评论服务提供者提供互联网新闻信息服务相关的跟帖评论新产品、新应用、新功能的，应当报国家或者省、自治区、直辖市互联网信息办公室进行安全评估。\n\n　　第五条 跟帖评论服务提供者应当严格落实主体责任，依法履行以下义务：\n\n　　（一）按照 “后台实名、前台自愿” 原则，对注册用户进行真实身份信息认证，不得向未认证真实身份信息的用户提供跟帖评论服务。\n\n　　（二）建立健全用户信息保护制度，收集、使用用户个人信息应当遵循合法、正当、必要的原则，公开收集、使用规则，明示收集、使用信息的目的、方式和范围，并经被收集者同意。\n\n　　（三）对新闻信息提供跟帖评论服务的，应当建立先审后发制度。\n\n　　（四）提供 “弹幕” 方式跟帖评论服务的，应当在同一平台和页面同时提供与之对应的静态版信息内容。\n\n　　（五）建立健全跟帖评论审核管理、实时巡查、应急处置等信息安全管理制度，及时发现和处置违法信息，并向有关主管部门报告。\n\n　　（六）开发跟帖评论信息安全保护和管理技术，创新跟帖评论管理方式，研发使用反垃圾信息管理系统，提升垃圾信息处置能力；及时发现跟帖评论服务存在的安全缺陷、漏洞等风险，采取补救措施，并向有关主管部门报告。\n\n　　（七）配备与服务规模相适应的审核编辑队伍，提高审核编辑人员专业素养。\n\n　　（八）配合有关主管部门依法开展监督检查工作，提供必要的技术、资料和数据支持。\n\n　　第六条 跟帖评论服务提供者应当与注册用户签订服务协议，明确跟帖评论的服务与管理细则，履行互联网相关法律法规告知义务，有针对性地开展文明上网教育。\n\n　　跟帖评论服务使用者应当严格自律，承诺遵守法律法规、尊重公序良俗，不得发布法律法规和国家有关规定禁止的信息内容。\n\n　　第七条 跟帖评论服务提供者及其从业人员不得为谋取不正当利益或基于错误价值取向，采取有选择地删除、推荐跟帖评论等方式干预舆论。\n\n　　跟帖评论服务提供者和用户不得利用软件、雇佣商业机构及人员等方式散布信息，干扰跟帖评论正常秩序，误导公众舆论。\n\n　　第八条 跟帖评论服务提供者对发布违反法律法规和国家有关规定的信息内容的，应当及时采取警示、拒绝发布、删除信息、限制功能、暂停更新直至关闭账号等措施，并保存相关记录。\n\n　　第九条 跟帖评论服务提供者应当建立用户分级管理制度，对用户的跟帖评论行为开展信用评估，根据信用等级确定服务范围及功能，对严重失信的用户应列入黑名单，停止对列入黑名单的用户提供服务，并禁止其通过重新注册等方式使用跟帖评论服务。\n\n　　国家和省、自治区、直辖市互联网信息办公室应当建立跟帖评论服务提供者的信用档案和失信黑名单管理制度，并定期对跟帖评论服务提供者进行信用评估。\n\n　　第十条 跟帖评论服务提供者应当建立健全违法信息公众投诉举报制度，设置便捷投诉举报入口，及时受理和处置公众投诉举报。国家和地方互联网信息办公室依据职责，对举报受理落实情况进行监督检查。\n\n　　第十一条 跟帖评论服务提供者信息安全管理责任落实不到位，存在较大安全风险或者发生安全事件的，国家和省、自治区、直辖市互联网信息办公室应当及时约谈；跟帖管理服务提供者应当按照要求采取措施，进行整改，消除隐患。\n\n　　第十二条 互联网跟帖评论服务提供者违反本规定的，由有关部门依照相关法律法规处理。\n\n　　第十三条 本规定自 2017 年 10 月 1 日起施行。</div>"
		},
		{
			"post_id": 13,
			"title": "关于信息、思考、表达的一点思考",
			"date_published": 1502880932.156,
			"body": "曾经习惯写博，不管是自言自语还是和人讨论问题，都会写点东西，可是后来渐渐的，对着电脑发呆，打开文档又关闭，什么也没敲出来，甚至有时候连保存都不想点，这样多年，感觉在自己身上找到了目前我能想到的解释：信息的获取方式和表达习惯。\n\n# 1、信息的获取方式\n\n曾经，我所能接触到的内容并不多，但是优质内容占比却很高，那时候不管是书籍报刊，还是少有的几个加了收藏的博客论坛，打开后总能找到不少值得细细读完的文章，读完后合上，有些总还能回想一会，或是在评论处敲上一段和作者的交流。\n\n随着微博微信朋友圈等新的沟通工具出现，它们都在想方设法的融入我生活中的每分每秒，主动或被动接触到的信息也呈爆炸式的增长，在这些信息的轰炸中越来越习惯了阅读碎片化、简单化的信息，特别是这些工具碎片化的信息的呈现方式渐渐成为了主流，因而越来越多的工具都选择了这样的呈现方式，一个循环。目不暇接的信息，不仅是不给时间去思考，还常常在干扰我的思考，经常，我所能想到的，已经在我所看到的信息中只言片语的体现出来，所以，少有再继续去深究，而一旦失去对信息的探究，所有的信息都只看到它表面化的地方。\n\n* * *\n\n甚至很多时候不再去思考我接受到的信息，是否是我理解到的信息，或者，我理解到的，是否是看到的信息所本身要传递的意思，在这些又短又多的信息中，我已难以再去花时间去甄别接触到的内容是否有价值，更没有再去整理和梳理它们，去消化它们，没有消化的东西，永远是在信息洪水中不经意就消失了。也许这些阅读习惯让我已失去阅读的耐心，特别是对一篇长文章的阅读的耐心，阅读的时间，也被这些信息打碎了，在碎片的时间里接受碎片的信息。\n\n# 2、表达的习惯\n\n这些工具便利而即时的表达方式，也让我在享受随手扩散随时表达的便捷的时候，失去了码字的耐心和习惯，更多的也是简短而碎片的表达，甚至有时候，我已不需要自己写字了，需要做的只是，点转发，点个赞，点个表情，或是一张图片，而不是去表达我转发赞同的理由原因，或是让我 2333 的点在哪里；我的每条微博每个朋友圈看似都在表达，很多时候却没有真正把所想的内容表达出来，表达也碎片化了，表达方式影响着思维方式，渐渐的，千言万语，竟不知，如何说出。\n\n现在的习惯已变成刚想到点什么的时候，会因便捷而及时拿起手机，打上几句话，或是偶尔再配上几张图，便发送出去了。随手发完之后，所想到的东西，也就少有再继续去思考它，即使偶有想到它更多东西，也会因为已经发完了而不再继续把它记录下来，很多时候这些思考成了 “点到为止” 了，时间久了，便渐渐的不习惯再去沉思和深思，而拥有一个自己的私人时间，去思考自己的想法，并将之表达出来，是一件需要长期锻炼和坚持的事。\n\n**环境影响人，而人，亦构成环境。**\n\n> Reading makes a full man, conference a ready man, and writing an exact man.\n> 阅读使人充实，交谈使人机敏，写作使人……\n\n_未完待续_"
		},
		{
			"post_id": 12,
			"title": "何人说愁",
			"date_published": 1502457350.651,
			"body": "原名：消愁\n原词：毛不易\n改写：zeee\n一步一步在这世上\n藏起了曾经的梦与想\n涂满了脸上各色的妆\n没人记起原本的模样\n走过了繁华 ，仍最爱角落\n固执唱着没人和的歌\n任它在风雨里变沉默\n举起酒杯对着自己说\n一杯敬朝阳 ，一杯敬月光\n默数我的向往 ，秋风冷寒窗\n不敢再回头，逆风去飞翔\n最怕心里有尘，眼底结霜\n一杯敬故乡，一杯敬远方\n回不去的善良，带伤的成长\n南来北往的路，越走越漫长\n自己收起灵魂，无处安放\n一杯敬明天，一杯敬过往\n撑起空壳身体，厚重了肩膀\n虽然从不相信所谓山高水长\n人生苦短何必念念不忘\n一杯敬自由，一杯敬死亡\n生命本是平凡，莫强言迷惘\n天黑天亮之后戏换另一场\n清醒的人最荒唐\n天亮天黑以后谁人离场\n就像烛火灭了一样\n\n* * *\n\n下方原词，真是羡慕歌手还有留有这豁达的心境\n\n> 消愁 - 毛不易\n> 作词：毛不易\n> 作曲：毛不易\n> 当你走进这欢乐场\n> 背上所有的梦与想\n> 各色的脸上各色的妆\n> 没人记得你的模样\n> 三巡酒过你在角落\n> 固执的唱着苦涩的歌\n> 听他在喧嚣里被淹没\n> 你拿起酒杯对自己说\n> 一杯敬朝阳 一杯敬月光\n> 唤醒我的向往 温柔了寒窗\n> 于是可以不回头地逆风飞翔\n> 不怕心头有雨 眼底有霜\n> 一杯敬故乡 一杯敬远方\n> 守着我的善良 催着我成长\n> 所以南北的路从此不再漫长\n> 灵魂不再无处安放\n> 一杯敬明天 一杯敬过往\n> 支撑我的身体 厚重了肩膀\n> 虽然从不相信所谓山高水长\n> 人生苦短何必念念不忘\n> 一杯敬自由 一杯敬死亡\n> 宽恕我的平凡 驱散了迷惘\n> 好吧天亮之后总是潦草离场\n> 清醒的人最荒唐\n> 好吧天亮之后总是潦草离场\n> 清醒的人最荒唐"
		},
		{
			"post_id": 11,
			"title": "【网络有记忆】之 消息连连看",
			"date_published": 1501941525.753,
			"body": "有几个消息，连起来看特别有意思。\n\n> *   @第一财经日报：【网络治理不能一封了之】2016年4月19日，中共中央总书记、国家主席、中央军委主席、中央网络安全和信息化领导小组组长习近平在北京主持召开网络安全和信息化工作座谈会并发表重要讲话。习近平在讲话中指出，形成良好的网上舆论氛围，不是说只能有一个声音、一个调子，而是说不能搬弄是非、颠倒黑白、造谣重整、违法犯罪，不能超越了宪法法律界限。我多次强调，要把权力关进笼子里，一个重要的手段就是发挥舆论监督包括互联网监督作用。这一条，各级党政机关和领导干部特别要注意，首先要做好。现在，有一种观点认为，互联网很复杂、很难治理，不如一封了之、一关了之。这种说法是不正确的，也不是解决问题的办法。（新华网）\n\n* * *\n\n> *   @联合国：【人权事务】中国代表在人权理事会表示，中方不接受言论自由问题特别报告 员报告中关于中国政府对互联网进行限制的说法。这是基于不实信息得出的结论。中国互联网是自由、开放、有序的。希望言论自由问题特别报告员能公正、的履行职责，采取可靠信息，与各国开展建设性合作，摒弃点名施压的做法。\n\n> *   @微博管理员：为了切实履行主体责任，加强用户账号管理，积极传播社会主义核心价值观，营造健康向上主流舆论环境，采取有效措施遏制渲染演艺明星绯闻隐私、炒作明星炫富享乐、低俗媚俗之风等问题。微博根据《微博用户服务使用协议》、《微博社区公约》等法律文件和社区规则，对存在严重编造传播谣言、诋毁他人名誉的 19 个低俗追星账号予以关闭。……\n\n> *   @新浪科技：【苹果 CEO 回应在华下架 VPN: 政策执行力度增强 苹果守法】在苹果财报发布后的电话费上，苹果 CEO 库克回应了苹果应用商店中国区将 VPN 应用下架的事件：受到中国相关法律强大的执行力度影响。库克称，早在 2015 年，中国就已缩紧了围绕 VPN 的政策，要求相关运营者需取得政府所授予的牌照。\n\n> *   @Jazz-Prime：今天不知该哭还是该笑的一件事。今天我家附近派出所民警给我打电话，询问我是否买过一个“蝙蝠侠飞行器”。民警解释说，最近全运会，做一些检查，他们接到的“名单”上有我的名字。……挂了电话之后，原本想笑的，这辈子第一次因为买了个玩具要接受检查，太荒谬了；但是再琢磨一下，民警是怎么知道我买蝙蝠翼的？“名单”又是什么？我唯一能想到的可能，就是阿里巴巴将淘宝购买记录交给官方，官方经过初步筛选之后，锁定了可能购买过无人机的买家，再根据淘宝预留的电话地址分配任务到小区派出所。本应居于我个人隐私的交易记录，住址，电话等，轻易的就泄漏了。这件事虽然早就能想到，但今日又一次确认了：老大哥果然一直在看着我。\n\n> *   @Jazz-Prime：Batwing 的那条微博，昨天已经禁止转发了，也没有新评论了，算是被和谐了，我原本以为到此为止了。今天上午接到电话（就是之前找我登记的人），跟我说删掉微博，不删的话，还会继续给我打电话，口气听得出来，对方也是有点为难的... 我刚刚已经删掉了。我先说，我理解下面不容易，上面派下来的活，他们就得干，天天各种脏活累活挨骂的活都是他们的；注册和管控无人机，也是出于安全因素，是一个正当的理由，我理解我也支持；泄露我个人信息的也并非他们。\n\n讲真，互联网爆炸式的信息，让互联网也失去了记忆，本来，网络应该是一个信息不会消失的地方，可是，这些信息，如果不是因为有图片在，过些时候，读过也自然就忘记了，每天这么多事，最怕见多了变得麻木。第一次看到觉得震惊，第二次看到觉得可笑，第三次第四次第N次看到，觉得难道不是这样的吗？\n\n**不，本来并不应该是这样的。**\n\n网络啊网络，请帮忙记住，这些可笑的事，不管发生多少次，不正常就是不正常，恶始终是恶，不会因为发生多次而变成善。"
		},
		{
			"post_id": 10,
			"title": "resilio sync 这么好的东西果然被禁了",
			"date_published": 1501936602.633,
			"body": "resilio sync 无法使用了，有种想砍人的冲动，TMD我就只是用来把手机照片视频以及一些文件备份到电脑，电脑上的一些文件同步到手机和另一台电脑上，这么好用，这么高效的软件，就这样不能用了，尼玛真是全油门倒车啊！真是卧槽尼玛，心中的绝望和万马奔腾实在没有语言可以表达啊！"
		},
		{
			"post_id": 9,
			"title": "启用新域名zeee.bit",
			"date_published": 1501856212.99,
			"body": "通过 [0list Blog](http://127.0.0.1:43110/domains4free.bit)帮忙注册了dot bit 域名，各位帮忙看看 [http://127.0.0.1:43110/zeee.bit](http://127.0.0.1:43110/zeee.bit) 是否能直接访问呢\n\ndomains4free 的博主真是非常的友好，通过BT Message联系之后，就帮忙注册了这个域名，很喜欢的名字。\n\nWith the help of domains4free (His blog site: [0list Blog](http://127.0.0.1:43110/domains4free.bit))，my blog has a new site: zeee.bit, you can visit my blog at [http://127.0.0.1:43110/zeee.bit](http://127.0.0.1:43110/zeee.bit)\n\nWelcome !"
		},
		{
			"post_id": 8,
			"title": "博客改名，增加友链",
			"date_published": 1501685670.061,
			"body": "我相信，有一束光将会指引我们前行：\n\n>    **平等、自由、共享、互联**\n>    **Equality、Freedom、Share、Connection**"
		},
		{
			"post_id": 7,
			"title": "曾经那些烛光",
			"date_published": 1501500797.9,
			"body": "就在前几天吧，微博里再一次的，烛光的表情不可用了。\n\n每年总有那么一些时候，一些表情，或是一些词，总是会因你懂的无法使用，渐渐的，除了调侃几句，吐槽几句，竟然也习惯了，最可怕的就是这个习惯，因为习惯了，便不会去寻求为什么，便不会去问是否应该是这样。\n\n有东西搜索不到了，点开无法显示了，所有的都是那句根据相关法律法规，可是具体是什么法律法规，却是谁都只能苦笑，其实，谁都不知道是什么法律法规，却也只能任由它去依据永远无法知道是什么的律法。“依法禁止某种言论并不可怕，可怕的是禁止者不给出明确的认定标准，想查禁什么言论，就随意给某种言论贴上禁止的‘标签’ ”\n\n* * *\n\n据说当年，Google搜索退出中国，正是因为他们想知道究竟要根据什么法律法规，偏偏，这句话是个万能遮羞布，什么都可以扯过来用，根本不知道哪个字哪个词，就这样被消失在茫茫网络中，那时候，曾觉得这是不可思议之事，全球互联网搜索之首的Google，退出中国，那还有什么事情会比这个更恶劣吗？Gmail无法使用，Google全线产品基本都是全球顶尖的技术，都不可用了，那一定是中国互联网最黑暗，最不可思议之事了。那时候曾天真的认为，Google这一脚踹向中国互联网，一定会把它踹到触底反弹，所有下坡都一定会有一个最低点，之后，肯定会渐渐重升回来。可是，这么多年过去了，纵使某度已经从骨子里烂成了毒瘤，渣浪上的内容屏蔽到莫名其妙，Google依然无法回来，全球排行前十的Google、Twitter、Facebook、Wikipedia、Youtube等等，我们都只当它们是不存在的网站，在国内用着各种仿制品时，还觉得它们也可有可无，可是终究，用过的人一直会念念不忘。\n\n一切的一切，本该如此吗？不是的。理想中它应该是一只自由的鸟儿，任何鸟笼都无法将之关闭，因为它每一根羽毛都闪烁着自由的光芒。也正是因为这样的理想，曾有过一些人，通过各种方式各种渠道，呐喊着，高呼着我们本该拥有的权利，这些人，犹如执着烛光在夜里对抗黑暗的人，本以为，会有越来越多的烛光，能照亮这个黑夜，本以为，这些点点的烛光，会指引着黑暗中前行的人看清楚方向和前行的路，也许，一盏又一盏的烛光，能相互温暖，相互照亮，直到黎明来临，直到天亮。可是，这些烛光，不仅照亮了人们的方向，更引来了黑暗守护者的注意，这些守护者，向往的不是阳光下允许存在的多彩的世界，不是阳光下透明而清晰的社会，他们所希望的，是黑夜单纯的黑暗，是黑暗笼罩下无人可见的为所欲为，是黑暗中随意引导的方向。他们，这些黑暗守护者，是容不下这样照亮周围的烛光存在的，他们极尽全力的笼罩着这些自由散发的光，阻隔着这些烛光照亮他们，甚至要一点一点的将这些已燃起的蜡烛扑灭，让这个环境重归一片漆黑，宣扬着黑暗才是正常，光亮反是异象。\n\n终于啊，烛光传播被阻，人眼被难以取下的眼罩蒙上，终于啊，有人对黑暗习以为常，甚至有人歌颂黑暗。终于，烛光一盏一盏的不见了，有人没见过，有人渐渐遗忘，一群人在黑暗中，顺着黑暗前行，不再言语。\n\n念着曾经那些烛光，是否还会继续传播着温暖和光芒，而在黑暗中的人们，是否还能看到黎明的到来。"
		},
		{
			"post_id": 6,
			"title": "百花自放",
			"date_published": 1501388777.084,
			"body": "即使是与自己观点相斥的言论和想法，也应该存在。\n\n同一问题，同一事件，不同人看到的、想到的，并不会完全一样，有着不同的经历经验，理解同一件事，同一个物，也不尽相同，更不说不同的利益关系，不同的价值取向，会带来对同样的事物不同角度的理解。\n\n是非对错，从来就没有那么绝对。眼见为实这句话，往往，是眼见不为实，我们所看到的，即使是完整的事件，也在经我们从看到到理解这个加工过程，变得有所取舍。而更多时候，我们甚至连完整的事件都无法知晓，因此加工后的信息，就更变得因人而异。不同人站的角度不同，就有个词可说明，盲人摸象。我们所认为我们是正确的，正如盲人认定大象应该是什么样的一样。\n\n---\n\n有时候，有些事并不是非黑即白。不去倾听并尝试理解与我们想法不一样的言论，那我们所得到的就只有黑白，有人看到黑，有人看到白，实际上，是灰。我们都善于相信自己愿意相信的，也善于看到自己愿意相信的。更甚有时候，不仅我们只看到部分，而且还是别人希望我们看到的那部分，别人愿意让我们看到的那部分或是刻意让我们看到的那部分。不去倾听和理解别人的看法，就意味着我们假设自己永远正确，而这正是我们最不可能做到的地方。\n\n我不同意你的观点，但我捍卫你表达自己观点的权利。很多人都听过这句话，但并不是每个人都能理解，更难做到。每个人最初的观点中也许都包含了正确和错误，只有自由表达自己的观点，并在不同观点的相互辩驳中，修正自己错误的那部分，只有把不同人看到那部分整合到一起，才更接近事情的本身，也才能定位我们自己所在的位置和角度，才能从别人那知道不同的角度所看到的样子，在我们的角度上，我们认为正确的理解，在他人的角度上，也许正如我们认为别人是错误的一样被认为是错误的。不同的声音，一定是有他不同的理由，不同的意见，一定是有他所在的立场。\n\n而这一切的前提，则是建立在允许不同的声音都能存在的条件下。只有自由的发声，不同的观点才能得以表达，我们不能以自己的喜好去评判它是否应该存在，因为，我们并不能永远在一开始就是完全正确的，事物对立的两面，并不能因为对立而应该让某一面消失。因而，即使是一些别有用心的言论出现，我们也只有在识别到他所存在的立场，才能更好的甄别他要表达的意思和目的，也许，他的目的在我们看来并不为善，想想，是他的利益与我们所冲突，还是他所看到的事件与我们不同，还是，他所理解的世界和我们的经历相悖。\n\n是选择非黑即白，还是接受灰色地带的存在？听不同的声音，不要太相信自己，亦不要太相信他人；允许不同的声音存在，是能更好看清这个世界的基础和前提。"
		},
		{
			"post_id": 4,
			"title": "自由是最大的礼物",
			"date_published": 1500084816.857,
			"body": "昨天早上就看到了关于zeronet的介绍，不过由于在上班就暂时收藏了没细看，下班回来开了电脑第一件事就是下载它，模式很新奇，耐不住好奇心折腾了许久，终于困意来袭，趟在床上时随手翻到好友朋友圈，她的生日，惊，翻了日历看了下农历，果然，也是我的生日，只是全天都没注意到。\n\n这样想想，偶遇ZeroNet却不算是意外了，自由分享，畅言所想，也许正是上天默默为我准备好的最大的礼物。连自己生日都能忘记的人，却在这天遇到这样的网站模式，处处透露着可畅快呼吸的空气， 幸也。"
		},
		{
			"post_id": 2,
			"title": "my first blog at zeroNet",
			"date_published": 1500039594.207,
			"body": "Hello every anonymous !\n\n你好，网上自由荡漾的灵魂！\n\n> 登山\n> ——李涉（唐）\n> 终日昏昏醉梦间，\n> 忽闻春尽强登山。\n> 因过竹院逢僧话，\n> 偷得浮生半日闲。"
		}
	]
}