{
	"next_topic_id": 10,
	"topic": [
		{
			"topic_id": 1588835683,
			"title": "Where are these ZeroNet Decentralized Equivalents?",
			"body": ".... and their variants.\nGo fund me\n8ch\nYoutube\nReddit\nFreelancer\nFeedly\nGoogle Alerts (rss feed maker)\ndecentralized ebay\ndecentralized distribution network organizer\nAre there any others you would like to have?",
			"added": 1588835682
		},
		{
			"topic_id": 1589101552,
			"title": "[WORLD ALERT] Must watch. Warn your peers. Get ready.",
			"body": "https://banned.video/watch?id=5eb72727244ac5001d1eaab4",
			"added": 1589101550
		},
		{
			"topic_id": 1589361247,
			"title": "Dragon Age Origins: Chilling Quarantine story! What are they doing with 'sick' people?",
			"body": "https://youtu.be/j2w2gNgS8ig?t=321",
			"added": 1589361244
		},
		{
			"topic_id": 1591167020,
			"title": "What is the most painless and easiest way to commit suicide?",
			"body": "I tried holding my breath and punching my self in the heart. I'm planning on going up in the mountains and going to sleep in the snow next.",
			"added": 1591167016
		},
		{
			"topic_id": 1605755443,
			"title": "Is there a way to buy a mobile number with crypto?",
			"body": "I got rid of my mobile phone post covid but still need a mobile number to help sign up to websites. Where can I buy a mobile number and how do I receive an sms online without a phone?",
			"added": 1605755438
		},
		{
			"topic_id": 1605760904,
			"title": "Where is the most advanced A.I. that I can download right now?",
			"body": "After watching the absolute incredible interview with GPT-3 I have decided to train an A.I. as an assistant. https://youtu.be/PqbB07n_uQ4 \n\nI have zero experience with A.I. and would appreciate some link for guidance.",
			"added": 1605760898
		},
		{
			"topic_id": 1608542019,
			"title": "Algorithmic silencing has ended Youtube",
			"body": "Clearnet sits like Youtube and Facebook have taken an epic skyward plunge into an irreversible trajectory. You might as well be speaking into your coffee mug when communicating on these \"social media\" platforms.",
			"added": 1608542012
		},
		{
			"topic_id": 1608542271,
			"title": "Break through light weight night vision glasses that turn night into day for 100 bucks...",
			"body": "are where? I don't need anything telescopic. I just want to be able to walk around my property and see them hiding in the bushes.",
			"added": 1608542263
		},
		{
			"topic_id": 1636789811,
			"title": "Is there a way to convert a video into a format that is unreadable by A.I. on social media?",
			"body": "So I made a video which I wanted to show people but I didn't want it to be labeled in a way that would allow it to be apartheid by centralized cancel culture. Are there any draw backs to doing this or repercussions?",
			"added": 1636789802
		}
	],
	"topic_vote": {
		"1588835683_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": 1,
		"1589101552_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": 1,
		"1589118404_1Ak954F5JD1uxGvAduUz9YwZFrVGe1L8Cw": 1,
		"1589361247_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": 1,
		"1605111093_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": 1
	},
	"next_comment_id": 23,
	"comment": {
		"1588692906_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 1,
				"body": "not supprised",
				"added": 1588831355
			}
		],
		"1588519592_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 2,
				"body": "What virus?",
				"added": 1588831411
			}
		],
		"1587403903_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": [
			{
				"comment_id": 3,
				"body": "Just finished watching it. At some point your going to have to stand up to your peers.",
				"added": 1588835183
			}
		],
		"1585234073_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 4,
				"body": "What Virus?",
				"added": 1588835238
			},
			{
				"comment_id": 11,
				"body": "> [zaron](#comment_80_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): There are no viruses .. We're in a simulated world\n\nYeah, I know and I want out!",
				"added": 1591168382
			}
		],
		"1587670973_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 5,
				"body": "All wings here except that they can't censor each other least their platform gets cloned and people will migrate",
				"added": 1588837295
			}
		],
		"1588766786_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 6,
				"body": "What is the zite address? Is IFS the zite name or technology?",
				"added": 1589091722
			}
		],
		"1589101552_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": [
			{
				"comment_id": 7,
				"body": "> [cexy](#comment_70_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): Good video. With A Jones you have to just take into account that he is a mossad agent that says 90% truth and mixes some disinfo into it.\n\nTotally agree with this!",
				"added": 1589178368
			}
		],
		"1589118404_1Ak954F5JD1uxGvAduUz9YwZFrVGe1L8Cw": [
			{
				"comment_id": 8,
				"body": "Looking at what he is doing and who he is associated too always makes me wonder if he was eating kids too.",
				"added": 1589178681
			}
		],
		"1589361247_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": [
			{
				"comment_id": 9,
				"body": "> [thorburn](#comment_69_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): And just maybe there are small groups of individuals and secret societies who would like nothing more than to send humanity back to the dark ages, while they keep all the toys? Just a thought.\n\nYeah true, but it was our own family who carried their torch and murdered their own family members who spoke out. It is the same analogy with the hacker. The deep state are hackers are just exploiting our own evil. They will pay big time when we cross over into the dmt realm.",
				"added": 1589614773
			}
		],
		"1590079338_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 10,
				"body": "> [pithos](#comment_1_1H2JaH7T4HYEWqRc9beyTuEpbqW1EBdeL7): You need help, see a psychiatrist. Maybe talk to your Rabbi or Hazzan see what they have to say about your delusions. Go talk to your local police officer, see if they can work out which care home/asylum you escaped from. Just for the love of all that is holy get help.\n\nPeople like you will go to hell.",
				"added": 1591167173
			}
		],
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 12,
				"body": "Stop crying about China before you get out of the middle east and south east Asia. How many countries do you have to blow up. GO HOME.",
				"added": 1599648554
			}
		],
		"1604659936_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 13,
				"body": "Covid is the an undeniable conspiracy theory. Thus the vaccine is a lie. If you come onto my property and force it upon me you will be killed.",
				"added": 1605755987
			}
		],
		"1605514254_1KpxpDPkuqhKBbeXNb4v2pnEoPXTTSnYgh": [
			{
				"comment_id": 14,
				"body": "All I know is that three years prior to the event I gave brutal warnings and a stark choice to my significant others. It appeared to them that I was burning my own bridge but of course paradoxically they had burnt theirs. Most people today are implicit because they were involved in the destruction of the father despite being warned.\n\nI would like to tell you a story.\n\nThere was once a man who died and went up into the next world. There he met the father who led him to the greatest depth of hell. He saw Christians begging for mercy and forgiveness, the man asked the father why they were not being forgiven. The father replied. \"It is too late. They did not listen to my warnings until the end.\"  The man was brought back to life and he told his story all who would listen.",
				"added": 1605757415
			}
		],
		"1605036890_1HtCCTkHppfVtiHtQ9ef2QXeopTP9wSMyt": [
			{
				"comment_id": 15,
				"body": "The typical American is covered in the blood of innocents from foreign wars. Many of you will be judged by the father.",
				"added": 1605760271
			}
		],
		"1605760904_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": [
			{
				"comment_id": 16,
				"body": "> [styromaniac](#comment_2710_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): GPT-2 is the closest you'll get with a mere desktop PC. GPT-3, I believe, runs on a supercomputing cluster.\n\nA super computing cluster? wow, what does that say about our brains...",
				"added": 1605763146
			},
			{
				"comment_id": 17,
				"body": "> [styromaniac](#comment_2711_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): We're still way smarter than AI. Our brains weigh much less and are far more energy-efficient compared to the hardware running GPT-3.\n\nWow, you just blew me away again. Your right the energy efficiency is a mind boggling point!",
				"added": 1606890880
			}
		],
		"1608250382_1vHZxSPDWPsY1FxSNrccx845qs4AoNtq2": [
			{
				"comment_id": 18,
				"body": "People will start to wake up in mass to their debt slavery. Those who bought into the system at the expense of their friends and family will suffer very badly. They won't be forgiven because they pointed a gun at the people who were trying to warn them.",
				"added": 1608542562
			},
			{
				"comment_id": 19,
				"body": "> [whitegenocide](#comment_26_14Y5YpotfVjQyQfdrW3PFuYDQTfpPAZ4GK): the us gov may end up being recognized as the enemy of mankind which leads to american people being hunted down worldwide. [...]\n\nYeah, something like this. I live on the other side of the wall and can see this happening big time. The Japanese will also be in hot water. They should have just apologized to China.",
				"added": 1608542746
			}
		],
		"1608830774_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 20,
				"body": "Can you imagine what the Chinese think about you people?! I can tell you that you are not going to be forgiven and helped when your crawling in the mud looking for bugs to eat.",
				"added": 1609056874
			}
		],
		"1608604929_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 21,
				"body": "It looks like a pretty boring whore tbh",
				"added": 1609056971
			}
		],
		"1612364889_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 22,
				"body": "> [rnb](#comment_21_1F57R2GNQqq1McDDceeEekBpYwdWizAX7E): ugh more of this conspiracy crap\n\nDid you get you shots yet? You won't be forgiven for this.",
				"added": 1612515417
			}
		]
	},
	"comment_vote": {
		"2_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": 1,
		"1_17Z8aUjWp2GECRJJUr4NXvE8byWXg68s8A": 1,
		"5_1HUrXNQjRheQouoqpwcxoxokEBTyvFeq1M": 1,
		"5_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": 1,
		"70_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": 1,
		"5_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": 1,
		"305_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"2710_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2711_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}