{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1521905871,
			"title": "Millchan is down? Is that possible?",
			"body": "I have only white logo, empty [options] and white bg. Is millchan can be down?",
			"added": 1521905870
		},
		{
			"topic_id": 1522338314,
			"title": "Point in browsing ZeroNet with Tor Browser",
			"body": "What's the point? Like I put all conections trow Tor already, what can happen if I would use normal browser?",
			"added": 1522338312
		}
	],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1521905871_1CDsYvuQP8StQGAMEgWVZuztHTsXPhCZZn": [
			{
				"comment_id": 1,
				"body": "> [mcdev](#comment_14_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7): I can't reproduce.Is there an error being displayed in your console?\n\nnevermind, i hande it. Just some JS problems in browser :3",
				"added": 1521908436
			}
		],
		"1521965207_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF": [
			{
				"comment_id": 2,
				"body": "lol, So if not US spying you, it would be Russian goverment? As russian I would not recommend use Yandex, Mail.ru and other stuff like this. Tutanota or Protonmail is good for keeping your privacy",
				"added": 1521969047
			},
			{
				"comment_id": 3,
				"body": "> [azz](#comment_11_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF): It does not matter for not Russian resident\n\nAre you joking? I do not want any goverment to have any my private data. It's like choosing between two evils, it's easier to choose a 100% safe third side like Tutanota",
				"added": 1521979216
			},
			{
				"comment_id": 4,
				"body": "> [azz](#comment_16_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF): Do you fuck children or sell drugs? Maybe you are paranoid? May foreign government agents blackmail you with your home porn? I guess you don't use social networks...\n\nLol, I am use social networks. It's simple measure for protect your rights on freedom of speech and secret of correspondence. You do not appreciate your rights very much, it's a problem of modern generetion, btw i am part of this generation. My peers think this rights something self-evident in there lives, but our ancestors fought for them. At a time when our rights in danger, we need to protect them most.",
				"added": 1522055950
			},
			{
				"comment_id": 5,
				"body": "> [azz](#comment_23_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF): I did not say that I disagree with you in general. Based on information from social networks about you special services know enough to treat you as a threat or not.\n\nOf course, if you not smart enough to control data in your social profile. I have a lot of fakes in russian social network (Vkontakte), and my main page is not contain any of my photos or any suspicious data like provocative posts about goverment and other stuff. I have fake accounts and VPN for this kind of activity (and still I not doing anything like that)",
				"added": 1522062409
			}
		],
		"1522086313_1DgPkB13kMfTydPdqLVMAbKQBLRhr9Bdpr": [
			{
				"comment_id": 6,
				"body": "This shit already here. EVERYONE SAVE YOURSELF!",
				"added": 1522240562
			}
		],
		"1523451391_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 7,
				"body": "Lol he's not, haha.",
				"added": 1523453173
			}
		]
	},
	"comment_vote": {
		"4_18ewrh7YMwuSTBcYAqvsEgSAQp9DsBNhW6": 1
	}
}