{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1567168666,
			"title": "\"Include optional files too large\" error with ZeroUp",
			"body": "Have looked around without finding a good answer.\nGetting the above error with \"Content signing failed\" when trying to upload additional files on ZeroUp. Increased the optional files limit, but didn't help.\nIf possible, would like an explanation of how optional file work and how to fix this problem.\nAlso, what issue would there be if I simply cloned ZeroUp and ran our own version.\nAlso, also, what actually happens when you unpin a file.\nThanks!",
			"added": 1567168665
		},
		{
			"topic_id": 1567311787,
			"title": "Contents of DMD media packs now published",
			"body": "Media packs like books, magazines, music etc... that are uploaded to ZeroUp by DMD now have their contents (what's in each zipped pack) shown on DMDTalk\nhttp://127.0.0.1:43110/1LBUGxoE9kvLUNshAeTWWZUiofaHpT1nhR\nthanks!",
			"added": 1567311785
		},
		{
			"topic_id": 1567498932,
			"title": "Upload size limit for ZeroUp",
			"body": "It appears that the total upload size limit for ZeroUp is between 930mb - 959mb.\nFound this our through trial and error.\nAfter this you get an size error message, then a failure to publish message.\nYour upload stays on ZeroUp, looks normal, but no can download from it.",
			"added": 1567498929
		},
		{
			"topic_id": 1567728985,
			"title": "ZeroNet 352 Flash Drop (DMD media giveaway)",
			"body": "DMD was started because while almost every movie, TV show, book and album can be found somewhere on the internet, the large companies who control the rights to this media seem to have no interest in making all of this media available at any price. Hopefully our service and others like it will someday be enough of a flea on a thorn in their side to make them change their ways.\nBut, yeah, probably not - at least not anytime soon.\nSo, for now, let's at least make things a little funner for everyone who has to sign up for three different services to get movies, music, TV and still pays way too much for horrible cable. At the end of the month, the only thing that streaming service lets you keep is next month's bill.\n\nThe ZeroNet 352 Flash Drop\nWe are giving away 15 flash drives filled with your choice of media using our MASSmedia service.\n4 x 8 gig drives\n8 x 16 gig drives\n2 x 32 gig drives\n1 x 128 gig drive\n\nHow it works - \n1) Go to one of our sites (see below)\n2) Click on \"Catalog Media Order\" and follow instructions for a catalog order\n3) Be sure to say in your email that this is for the \"ZeroNet 352 Flash Drop\" so you are not charged\n4) Yes, we will need some sort of mailing address - we're sending you an actual flash drive\n5) We will check your order, and if everything is good we will email you back\n6) Within two days your free flash drive with media on it will be sent out via first class USPS mail\n\nOptional - if you tell us your ZeroNet nickname in your email we will mention it on ZeroNet\n\nAs each flash drive is claimed with a good order, we will immediately update on ZeroNet how many of which flash drives are still available.\n\nWe only use major brand, retail flash drives. All drives are brand new for this drop except the two 32gig and the 128gig drives which come from our ReFlashCycle program.\n\nThere are only 15 flash drives for this drop, so we apologize in advance if you go to the trouble of putting in an order and don't get a drive. Maybe go outside and walk it off, you'll feel better, we promise.\n\n\nDMD Sites - \nRegular Internet - www.dmd.delivery\nZeroNet - http://127.0.0.1:43110/1BVQqm21fV2K3yw5iaXvoZk23mho1vaqHv\n(warning, the ZeroNet site only has movie catalogs due to size limitations)\nBeaker Browser - dat://b5cd5bc575a2d9a55f13ace95deb65e8eb0447185d6a7cf38e12788ba84eb789\nOR\nYou can download the catalogs directly from us by going to the main page of our web site and clicking on \"Contact Info, Downloads and Other Ways to Find Us\"",
			"added": 1567728981
		},
		{
			"topic_id": 1567774655,
			"title": "Can't delete self created empty zombie sites? - try this",
			"body": "Playing around I created several empty ZeroNet sites that when trying to delete them a few days ago from ZeroHello I got the message (paraphrase) \"you cannot delete your own site\"\nThey were like zombies that I couldn't kill no matter what I did.\nAs of today, clicking on the same delete option you get (paraphrase) \"go to the sidebar to delete\"\nMore positive sounding, but when the new tab opens it is just the site with no option to delete.\nThe only sidebar type thing, the \"0\", doesn't give you any options to delete.\n\nFinally just went into the \"data\" directory and manually deleted the sites and now they are gone\n1) In the your ZeroNet directory go into the folder named \"data\"\n2) Find the folder named with the ZeroNet address you want to delete and delete that entire folder\n3) Then in the same \"data\" folder open the \"sites.json\" file with a text editor\n4) Delete the block of text associated with the ZeroNet address you want to delete\n5) Save the modified \"sites.json\" file\n6)  Update ZeroHello - Zombie site should be dead and gone\n\nHaven't see any bad side effects of this but would like to hear from someone if this is a good or bad idea or better yet, what is the correct way to do this.",
			"added": 1567774650
		}
	],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"1567013011_1JM6gfdXN5wnxLR2LmUuvx4216mtPzXmzB": [
			{
				"comment_id": 1,
				"body": "We (DMD) currently have about 500,000 ebooks in our catalogs.\nA lot of those can be downloaded for free using our File Cannon service.\nFor more info you can go to our Zeronet site at - \nhttp://127.0.0.1:43110/1BVQqm21fV2K3yw5iaXvoZk23mho1vaqHv\nThe books catalogs are too large for Zeronet, so please see our internet site at -\ndmd.delivery",
				"added": 1567067429
			}
		],
		"1567168666_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1": [
			{
				"comment_id": 2,
				"body": "Yes, below \"Content signing failed\" it said \"Include optional files too large 1040866215B>1000000000B\"",
				"added": 1567172033
			},
			{
				"comment_id": 3,
				"body": "No, I absolutely didn't want to upload a 1 GB file.\nAll the files were between 10mb and 200mb. Know this for certain as they all had to be zipped.\nAgain, there were no single large files.",
				"added": 1567172512
			},
			{
				"comment_id": 4,
				"body": "Also would still appreciate an explanation of what exactly happens to files that are unpinned.\nZeroNet is very well done and polished, but there is a real lack of searchable info about how to do things and what to do in the case of problems like this.",
				"added": 1567172653
			},
			{
				"comment_id": 5,
				"body": "> [gitcenter](#comment_828_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I meant that you uploaded more than 1 GB summed up.\n\nAh, yes, I figured there was a limit being reached somewhere.\nIs there somewhere under \"FILES\" that indicates this limit?\nIs there a way to increase it?",
				"added": 1567173076
			},
			{
				"comment_id": 6,
				"body": "> [gitcenter](#comment_829_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): You probably want to learn about pinning files, not unpinning then. Usually ZeroNet downloads big files on demand, and when you don't use them for a while, it deletes them. Pinning big files means that ZeroNet won't delete them. Basically, pinning big files means helping to share them.\n\nActually, every file I uploaded was automatically pinned so that is why I was asking about unpinning.\nBut yes, I had read that unpinning them makes them available for garbage collection so thank you for confirming that.",
				"added": 1567173201
			},
			{
				"comment_id": 7,
				"body": "Is it possible to lift the limits of 10mb - 200mb uploads on ZeroUp by cloning it and modifying?",
				"added": 1567173309
			},
			{
				"comment_id": 8,
				"body": "The reason I am asking is because we have a service called File Cannon that sends catalog requested files to people for free, but because it is via email there is a 25mb limit.\nIt would be nice to have a request service on ZeroNet for larger file sizes.\nHere is a ZeroNet copy of what we are doing on our clearnet site -\nhttp://127.0.0.1:43110/1BVQqm21fV2K3yw5iaXvoZk23mho1vaqHv",
				"added": 1567173676
			},
			{
				"comment_id": 9,
				"body": "> [gitcenter](#comment_837_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): To be honest, using ZeroUp as file storage is a bad idea because anyone will be able to upload a file, not only you. Anyways, if you're fine with that, you can do the following: [...]\n\ngitcenter, thank you very much for your detailed answers. We will look at a clone, but after what you said will continue to use nofish's ZeroUp for the time being.\nThanks again!",
				"added": 1567214907
			}
		],
		"1567613355_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf": [
			{
				"comment_id": 10,
				"body": "DMD is centralized, but the trade off means 700,000 songs are up and available all the time and most importantly they are browseable via catalogs. Anything under 25mb is free via File Cannon or if it is less than 200mb you can ask for it on our ZeroNet request zite - DMDTalk\nhttp://127.0.0.1:43110/1BVQqm21fV2K3yw5iaXvoZk23mho1vaqHv  (only movie catalogs fit due to limited space)\nhttp://127.0.0.1:43110/1LBUGxoE9kvLUNshAeTWWZUiofaHpT1nhR  (DMDTalk)\nwww.dmd.delivery  (clear net site with all catalogs)",
				"added": 1567661044
			}
		]
	},
	"comment_vote": {}
}