{
	"title": "七弦落笙",
	"description": "",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 10,
	"demo": false,
	"modified": 1497588416,
	"post": [
		{
			"post_id": 7,
			"title": "王尚一:大陸金融黑洞的數字分析 （外儲資產篇）",
			"date_published": 1497587225.099,
			"body": "中國給世界畫大餅，主要分為兩方式。首先，鼓吹中國經濟增長，吸引外資進入中國，從中國經濟增長和人民幣升值中獲利。其次，以中國外儲做宣傳，表麵中國有強大的實力，也就是有現成的大餅。尤其進入2015年後，世界都普遍擔心中國經濟增長速度，擔心中國衰退，進而影響世界經濟。而中國反複強調外儲，其用意很明顯，雖然中國經濟增長放緩，雖然人民幣停止升值；但是讓外資不用擔心，人民幣彙率不會貶值，中國還有強大的外彙儲備。外資即使呆在中國，也非常安全，不用擔心自己的資金出問題。\n\n在2014年中，中國外儲接近4萬億美元。總理李克強曾經說過，大陸外彙儲備太多了，對大陸是個負擔。隨著美聯儲QE3逐漸停止，外資開始外流，大陸外彙儲備開始減少。但是，在三個季度後的2014年3月，大陸外彙儲備仍然超過3.7萬億，總共僅減少2000多億美元。從數字上，中國外儲讓西方經濟和金融業感到震撼。因為如此龐大的外儲是世界上最大的蛋糕，西方金融機構也從來沒有見過。所以，雖然中國經濟放緩，但是金融機構仍然在做著美夢，希望自己能夠參與到大陸經濟中，分割蛋糕中的一塊。而且，金融業的特點是，越有錢的人，金融業越願意借錢。中國擁有如此龐大的外儲，雖然有一些企業債違約，但是金融業仍然積極幫助中國融資。尤其是看好互聯網在中國市場的發展，積極幫助中國互聯網公司進行各種融資，包括上市融資。\n\n實際上，中國外儲既是金融黑洞本身，同時也是黑洞遮羞布。因為，外儲表麵上是中國財富，實際上是中共政府的外彙債務。在早期，當外資很少進入中國時，中國的外儲來源主要是賤賣資源，以及本土血汗工廠的出口創彙。中共政府將外彙拿到自己手中，以人民幣給出口創彙的單位。因為中共政府擁有對整個國家的所有權，所以政府不存在對本國單位欠債的問題，外儲屬於政府。問題是，當外資進入中國時，通過中國的外儲製度，將美元給中國外管局，外企手中拿著人民幣。外企大多數以人民幣為單位，在中國國內進行經濟活動。同時，中國政府承諾，在外資離開中國時，外管局以美元換取外資手中的人民幣。這種投資活動屬於資本項目資金，對於中國政府來說，外儲就成為負債。在中國積極對外資實施招商引資的背景下，當外資進入中國的數額越大，換給中國政府的外彙越多，中國的外儲也規模越大，意味著中國政府對於外資的負債也越多。\n\n隨著債務持續增大，外儲出現所有權與經營權相分離的問題。首先，雖然外企對外儲擁有所有權，但是由中國政府進行經營。當外儲主要是本土血汗工廠出口創彙獲得的資金時，中國政府擁有外儲的所有權。由於本土血汗工廠出口創彙能力有限，因此外儲金額少，中國政府對外儲極為珍惜，盡可能節約外彙，減少外彙消耗。但是，隨著外企進入持續增加，外儲主要變成對外企的負債，中國政府的態度發生明顯轉變。隨著進入中國的外彙資金越多，中國政府的表麵實力也越大。而且，在花費外儲的時候，中國政府等於在花外企的錢，辦自己的事。所以，中國政府可以肆無忌憚，按照自己的意願在國際上花錢。而且在花錢的時候，中國政府顯得財大氣粗，在國際上形成很強的勢力。其次，外企手拿人民幣，在中國市場進行經營活動。對於外企來說，持有人民幣僅僅是中間手段。在外企經營和獲得利潤後，以人民幣彙率折合成美元，計算手裏的人民幣財富。而如果外企認為中國市場不理想，會將手中的人民幣換成美元離開中國。在中國市場中，外企的市場份額日益擴大，獲得的利潤持續增加，潛在兌換人民幣的數量數額也在持續增加。或者說，外企由於越來越多的人民幣，因此對於外儲的所有權數量也在持續增加。\n\n而中共政府拿著外資的外彙，開始在全世界撒錢，以達到自己的目的。撒錢的意思是，中共政府隻是考慮自己的生存，而不考慮外儲的收益，可以任由外儲實際虧損。從操作手段上，中國政府以下述幾個方式，進行外彙儲備運營。而在每個方式中，都意味著外儲的實際虧損。\n\n1、大量購買各種礦產資源，實施各種援建項目。由於中國經濟的特點是高能耗、高資源消耗、高汙染，因此隨著中國經濟增長，對於能源的資源日益渴求。隨著中國的采購胃口持續擴大，推動世界能源和資源的價格暴漲，扭曲整個世界經濟，削弱歐美國家的經濟基礎，加劇歐美金融和經濟危機的深度和廣度。而且，中國在落後國家進行大規模的資金投入，包括大量借錢給非洲國家的政府。而這些資金的作用是，支持中國企業在非洲擴張，瘋狂破壞性開采非洲資源，破壞非洲的自然環境。而中國在落後國家的進行援建項目，主要為國家政策銀行進行貸款，中國承包商施工。另外，在2015年春節後，亞投行和一帶一路大熱，中國更增大撒錢的規模。從經濟角度，援建項目本身就是扔錢的項目，不可能收回投資。但是，這些錢雖然收不回來，仍然掛在外儲賬上，顯示為外儲資產。\n\n2、購買歐美等各國政府債券，導致實際外儲大量虧損。中國外儲中有上萬億的美國政府債券，另有數千億美元的兩房債券，而且還有大量的歐洲政府債券。通過買債的方式，歐美各國政府緩解對中國的限製，甚至支持中國拯救世界的言論，烘托出中國經濟持續向好的輿論環境，吸引更多外資進入中國。其中，數千億的兩房債券的具體結果不明，沒人知道是否會違約，還是已經違約。另外，隨著歐洲經濟日益惡化，未透露金額的歐洲政府債券基本已經血本無歸。另外，雖然美國政府債券的價值有一定保證，但是如果中國持續拋售美債，必然導致債券價格下跌，進而影響其它資產價格，造成外儲的更多虧損。這些資產雖然已經嚴重損失，還有一部分事實上被美國凍結，但是仍然表現在中國外儲的賬上。\n\n3、中國外儲大量收購歐元和日元資產。在美元指數處於80以下的時候，中國外儲管理者認為美元還將下跌。所以，外儲將大量美元換為歐元和日元，進行所謂的分散化投資。根據當時業內的輿論鼓吹程度，以及不可靠消息，可能有相當於三分之一的資產被置換為歐日資產。當美元開始持續上漲，日元從最低75的水平貶值到120日元以上，而歐元也貶值20-30%。歐元日元貶值的結果是，中國持有歐洲日本的實際資產價值明顯縮水。而即使歐日元資產縮水，損失也不計算在外儲變動數字中。\n\n4、放貸給俄國和委內瑞拉等反西方的國家，並且高價簽訂石油天然氣的供貨合同，將大量利益輸送給這些國家。例如，中國對俄國的大量利益輸送，讓俄國入侵烏克蘭的行為可以堅持更久。這樣就形成一個利益機製，就是通過中國這個中轉站，來自西方國家的錢，被用來支持反西方國家的行動。而由於歐美等政府被中國收買，因此對這樣的行為采取視而不見的態度。僅僅對委內瑞拉這個小國，中國在過去十年就借給其500多億美元，讓其以石油做擔保。在石油暴跌，委內瑞拉陷入金融危機後，優先歸還華爾街債務。同時，委內瑞拉既不還中國錢，又不給中國石油。2015年1月，委內瑞拉繼續從中國借200億美元，中國再度借錢給委內瑞拉，不談歸還的事情。隨後，委內瑞拉經濟加速崩潰，所有的錢都不可能歸還。而這700億美元的資金，雖然已經成為壞賬，但是仍然掛在外儲賬上。\n\n5、支持中國企業亂投資，實際財產大量流失。隨著中國外儲快速增加，中國國企大規模到國外購買資產。一般來說，中國企業購買資產後，這些資產都發生嚴重的貶值，也就是投資嚴重虧損。在這些虧損中，既有企業的戰略錯誤，也有利益輸送的因素。例如，在福島核電站事故期間，就出現過新聞，中國外儲在之前不久剛大量購買日本東電股票。當核泄漏事故爆發後，東電股價大幅下跌。另外，利益輸送的意思是，某個權貴在海外以很小的代價購買某塊地，然後宣稱這塊地擁有豐富的資源，進而翻無數倍以極高的價格賣給國企，權貴獲得相應的利益。在這兩種方式的共同影響下，根據數據統計，中國有2萬多家企業在海外投資，90%以上虧損。\n\n所以，中國外儲規模在紙麵上規模龐大，但實際上嚴重虧空。首先，經過中共多年來的亂投資，外儲已經到處虧空，真實價值與賬麵價值嚴重不符。其次，中國可能在美國質押大量資金（購買美債）、沒有美國同意，中共無法變現。而且，將虧損和質押的資金曝光，人們會發現，中國的外儲不僅不像表麵上的那麼多，而且是相當少。第三，從現金和非現金資產配比角度分析，中國外儲也非常危險。從大量外儲局的操作思路角度分析，其現金和可以調動的接近現金資產可能僅僅隻有數千億美元。在其它資產中，在還沒有成為壞賬的部分資產中，中國外儲一旦拋售籌資，也必然經曆重大損失，甚至短期難以變現。\n\n在另一方麵，中國的資金主要集中在外資和權貴手中。一旦覺得中國再也賺不到錢，權貴和外資會大規模撤離。而且，從最近撤離的一些事件可以看出，一旦這些資金決定離開，態度非常堅決、行動非常果斷迅速。隨著撤離加速，實際可調用的外儲會很快被衝垮，中國金融黑洞完全曝光。"
		},
		{
			"post_id": 6,
			"title": "生於0715：最後的糧食",
			"date_published": 1497447077.966,
			"body": "來源：[http://www.iocecs.com/chinaeconomy/shownews.php?lang=cn&id=10](http://www.iocecs.com/chinaeconomy/shownews.php?lang=cn&id=10)\n\n轉基因、進口糧油、進口肉（尤其走私）、地溝油、化肥農藥激素、化學保鮮添加劑…… 當中國媒體大力鼓吹、支持轉基因農產品的種植和銷售時，說明中國的大饑荒已經迫在眉睫。\n\n中國官方鼓吹轉基因技術，反映糧食問題接近無法解決的程度。在過去數年，中國糧食供應日益緊張，促使中國官方采取更多的措施。最初，通過化肥農藥激素的農業化學技術應用，在農村勞動力日益減少、農田持續萎縮的情況下，保持中國糧食的自給自足能力。隨著供應減少，中國無法自給自足，最簡單的方式就是進口，用來增加中國的糧食供應。同時，在中國國內，地溝油和瘦肉精技術大麵積普及應用，進一步增加國內供應，填補糧食缺口。而且，大量轉基因種子在中國銷售，由於能夠顯著提高產量，獲得快速推廣。另外，進口肉（包括走私）等產品大幅增加，對肉類供應形成顯著的補充；大量化學保鮮添加劑占領市場，顯著減少食品在運輸儲存過程中的損耗。通過這樣的方式，中國仍然維持著糧食供應。不過，由於國內輿論對於轉基因的抵製，加上糧食供應日益緊缺，中國官方正式推廣鼓吹轉基因作物，也不再考慮轉基因的不安全因素，為保持短期的糧食供應而做最後的努力。可以說，全麵鼓吹和推廣轉基因已經說明，中國官方通過加速消耗地力、危害民眾健康、斷絕傳統種子存留的方式，對糧食的短期供應進行最後的刺激。\n\n糧食狀況決定社會形勢。當中國絕大多數人在追求房子、車子、購物旅遊等生活享受的時候，往往忽略中國的糧食基礎問題。當一個社會的糧食充足，而且能夠較為合理地分配到社會民眾手中，即使遭遇大規模經濟危機，也不會影響社會穩定。如果糧食缺口超過10%，糧價就會大幅上漲或者暴漲，進而導致社會經濟崩潰。如果缺口進一步擴大，而且社會結構分配有問題時，將可能爆發饑荒，導致社會大動蕩。在目前的中國，如果刨去進口的部分，從熱量值的角度進行衡量，中國糧食的實際缺口已經超過40%，匱乏程度遠超中國曆史各朝代大動蕩的水平。如果再考慮到西方的轉基因生活技術和各種化學對於中國糧食生產的作用，一旦失去西方的糧食技術，中國糧食缺口超過80%。這個缺口意味著，中國麵臨著前所未有的社會危機。\n\n官方數據與糧食危機有著直接關係。中國糧食生產的官方數據造假，民眾失去對真實糧食現狀的了解。所以，地方政府和民眾都對糧食問題極為麻木，大肆毀壞和汙染良田。根據中國官方統計數字，2007年，中國糧食達到5億噸，創出曆史新高。在這個時候，中國是糧食淨出口國，也就是中國糧食自給自足，還有一部分出口。到2013年，中國實現糧食生產十連增，包括穀物和大豆在內的全年糧食產量突破6億噸，再創曆史新高，但是中國變成世界上最大的糧食進口國。根據彭博社數據，2014年1月至10月，中國總共進口了7250萬噸糧食，包括大豆、大麥和高粱，相當於2013年全年進口總量。如果按照官方數據，僅僅從糧食總量的角度，中國糧食需求在短短6年間，從5億噸增長將近6.9億噸左右，增幅為將近20%。與此同時，中國人口增長急劇放緩，而且城市化基本達到頂點。這個情況意味著，中國的糧食需求和消耗應該已經基本停止增長。如果糧食生產連年增長，早應該已經超過消耗，實現大量的糧食出口。實際數字卻是，中國持續進口糧食，且數量巨大。\n\n從上述的對比可以推斷，中國糧食供應不僅沒有增產，而是應該減產。即使按照2014年的糧食進口預估，進口糧食總量達到8700萬噸，說明中國糧食缺口巨大。或者說，假設2007年的真實糧食產量為5億噸，到2014年，中國真實的情況是，不僅沒有達到6億噸，而且產量實際減少。而且，這還僅僅考慮到表麵的糧食進口數字，不能有效反映糧食進口的真實狀況。如果從這個數字出發，進行簡略的分析，就會對中國糧食的真實狀況形成一定認識，並且能夠理解為什麼中國官媒如此著急地鼓吹轉基因。\n\n從上述的對比可以推斷，中國糧食供應不僅沒有增產，而是應該減產。即使按照2014年的糧食進口預估，進口糧食總量達到8700萬噸，說明中國糧食缺口巨大。或者說，假設2007年的真實糧食產量為5億噸，到2014年，中國真實的情況是，不僅沒有達到6億噸，而且產量實際減少。而且，這還僅僅考慮到表麵的糧食進口數字，不能有效反映糧食進口的真實狀況。如果從這個數字出發，進行簡略的分析，就會對中國糧食的真實狀況形成一定認識，並且能夠理解為什麼中國官媒如此著急地鼓吹轉基因。\n\n首先，糧食進口的實際熱量值遠遠超過表麵數字。人們消費糧食，主要的目的是攝取熱量。由於糧食的品種不同，糧食的熱量值也明顯不同。所以，進口糧食考慮的不僅僅是進口數量，還需要計算熱量值。大致上，進口糧食的主要特點是，產量低、熱值高、性價比高。如果考慮到這樣的特點，進口糧食的作用更加重要。根據食物熱量表，每100克大豆所含熱量約為446大卡，每100克大米所含熱量約為346大卡，每100克小麥所含熱量約為339大卡，每100克[玉米](http://wenwen.sogou.com/s/?w=%E7%8E%89%E7%B1%B3&ch=w.search.intlink \"鏈接關鍵詞\")[含熱量](http://wenwen.sogou.com/s/?w=%E5%90%AB%E7%83%AD%E9%87%8F&ch=w.search.intlink \"鏈接關鍵詞\")365千卡。從上述數字可以看出，大豆的熱值是同等重量大米小麥玉米的1.3倍左右。基於不同的糧食熱量值，中國官方通過控製進口食物的種類，讓人們缺乏對於進口數量的警覺。尤其是中國持續增加高熱量值食物的進口，很多食物還不算在糧食進口數據中，能夠在很大程度上遮蓋中國麵臨的糧食缺口。例如，中國對於轉基因大豆的進口持續增加，中國官方毫無反應。但是，當中國缺乏玉米時，進口商從美國進口玉米，就以轉基因不合格的名義禁止進口。從這個行為可以看出，中國嚴格控製糧食進口數量，一方麵防止因為進口數量過大，引發中國更多民眾對糧食缺口的警覺；另一方麵弱化糧食市場對於中國進口數量的警覺，以免糧價被大幅炒高，耗費更多的外彙進口糧食。\n\n由於大豆的熱量值高、單產低，中國糧食進口集中在大豆上。傳統上，中國國內主要以非轉基因大豆種植為主，畝產往往隻有200-300斤。即使施用化肥等方法，畝產也才能增加到300-400斤。與之相對比，玉米畝產可以比較輕易地達到800斤以上，良田可以超過1200斤。由於轉基因玉米的推廣，有的土地玉米畝產甚至可以達到1800斤。由於大豆售價相對較低，農民種植大豆不合算，紛紛停止種植大豆，改種玉米，極大提高產量和經濟效益。所以，大豆因為具有上述突出特點，多數中國農民停止種植大豆，導致大豆進口占到糧食總進口數量的絕大部分。根據官方數字，2013年，中國的大豆產量隻有1200 萬噸左右。同時，根據海關公布的數據顯示，中國是世界主要的大豆購買國，2013年大豆進口量為6340萬噸，同比增長10%，再創曆史新高。而2014年前10個月，大豆進口為5684萬噸。同比繼續增長增加13.8%。再加上原先大麵積的大豆種植土地轉為玉米種植，大幅度提高玉米產量，讓中國實現顯著糧食總產量增長。\n\n大豆進口意味著，中國民眾糧食消費品質明顯下降。本來，在中國糧食生產中，有相當比例的大豆種植，讓中國成為大豆的主要生產國。問題在於，中國大豆作為轉基因大豆，產量低，無法顯著提高產量。隨著中國經濟增長，中國從1990年代中後期開始，從國際市場進口廉價大豆。進入2010年代，中國進口大豆規模達到天量，而且基本為轉基因大豆。由於中國市場混亂，中國產的非轉基因大豆難以賣出高價，被廉價的轉基因大豆全麵衝垮。在中國植物油消費市場中，各種豆油基本由廉價的轉基因大豆榨取，滿足市場對於廉價豆油的需求。農民基於市場因素，不再種植非轉基因大豆，而是轉而種植高產的轉基因玉米，獲得高一些的收益。\n\n**從市場的角度**，轉基因玉米成為劣質食料供應。雖然大部分轉基因玉米都用於飼料，間接由民眾消費；由於玉米澱粉廣泛用於食品工業，部分轉基因玉米也被民眾直接消費。但是，市場混亂，銷售者並不關心基本品質，隻是通過數量賺錢，獲得較高的收益。**從國家的角度**，不論轉基因大豆還是轉基因玉米，雖然質量低劣，而且對人身體的危害可能很嚴重；但是，大量低價大豆和玉米有效壓製糧食和飼料價格，進而相對降低肉類價格，維持經濟的穩定。所以，國家不必考慮民眾的健康，自然采取短期最為有利的轉基因農產品模式。當然，中國的優質玉米供應匱乏，還需要從國外進口一些優質玉米，滿足一些對於優質玉米的需求。\n\n所以，對大豆進口分析可以看出，**中國糧食增產和進口的實質是，通過種植和購買更劣質的糧食，滿足中國民眾對於糧食的數量需求。**這樣的結果是，短期能夠增加糧食供應、降低供應成本，但是長期對於中國民眾的潛在危害不可估量。\n\n植物油屬於熱量更高的食物。中國為了彌補植物油供應，加大植物油和油料作物進口。海關數據亦顯示，中國2013年進口810萬噸植物油。根據植物油的熱量值，100克植物油約為900大卡，是大豆的約2倍。如果按照熱量值計算，每年的進口植物油相當於1800萬噸以上的大豆。另外，植物油進口不僅包括植物油，還有除大豆之外的油料作物。例如，中國不僅大豆生產持續萎縮，油菜籽種植生產同樣在嚴重衰退。因為中國的非轉基因油菜籽畝產低、成本高，中國官方大規模進口低價的轉基因油菜籽，提高市場中的菜籽油供應量、降低供應成本。\n\n《中國經營報》2013年11月2日報道：“從中國開始托市收購菜籽油的5年間，中國的年進口菜籽油量從29萬噸上漲到159萬噸，這些菜籽油絕大多數是來自加拿大和澳大利亞的轉基因菜籽油。”根據美國農業部參讚稱，2013/14年度前9個月中國的油菜籽進口總量已達384萬噸，同比增長43.7%。而且，中國政府計劃2014/15年度收購500萬噸油[菜籽](http://finance.sina.com.cn/money/future/quote.html?code=RS0 \"鏈接關鍵詞\")，達到創紀錄的水平。油菜籽的出油率高，能夠達到40%左右，明顯高於大豆等油料作物。按照這個出油率，油菜籽500萬噸的進口量，也意味著200萬噸左右的菜籽油進口。**不論直接進口植物油，還是進口油菜籽，都是通過更不被人注意的方式進口食物，填補國內的糧食缺口**。\n\n其它品類的食品進口，同樣對填補中國糧食缺口起到重要作用。中國的食糖進口快速擴大，根據相關數據顯示，2004年-2013年我國食糖進口量由121.4萬噸激增至454.6萬噸，增長了2.7倍，遠高於194.5萬噸的年進口配額量。同期，食糖出口量在2004年8.5萬噸的基礎上2005年激增了3.2倍至35.8萬噸，此後規模逐年縮減，2013年我國食糖出口量僅4.8萬噸，當年貿易逆差449.8萬噸，進口食糖成為國內食糖供給市場的重要組成部分。\n\n從熱量值的角度，100克食糖的熱量值為389大卡。另外，中國已成為世界肉類生產、進口和消費大國。根據海關統計，2012年進口肉類207萬噸，金額40.9億美元，2013年1-7月，進口肉類146萬噸，33.1億美元，同比增長32.2%和54.2%。而且，肉類進口不僅僅通過海關，更大量以走私的形式進入中國。而且，走私進入中國的肉類不僅包括豬肉、牛肉和羊肉等，而且還有各種豬下水、牛雜、羊雜等產品。這些走私產品數量巨大，在持續進入中國，對於壓製中國的牛羊肉價格，已經相關產品的價格，起到重要作用。\n\n另外，中國作為最大的稻米生產和消費國，近年的大米進口劇增。根據海關總署統計數字，2012年以及2013年低價大米進口量驟增，創下近年 進口紀錄。其中，2012年為 207.3萬噸，2013年為176.6萬噸。需要說明的是，同肉類走私進口類似，中國進口的走私大米數量巨大，並沒有被統計在海關數字中。\n\n還有，中國大量進口熱量值較高的熱帶水果，成為中國熱量來源的一個部分。在中國乳業的三聚氰胺事件之後，民眾越來越積極購買外國奶粉。由於乳業接二連三出事，中國民眾大舉到外國購買奶粉，導致多國的嬰兒奶粉某些品種脫銷。而奶粉是高質量、高價格的熱量來源，尤其用於嬰幼兒和少年兒童成長的需要。\n\n簡言之，進口糧食已經占到中國糧食供應的相當比例。除了被嚴格控製的小麥和玉米之外，中國的各類糧食和油料作物進口規模巨大。而如此巨大的進口規模背後，是中國糧食生產的實質。中國糧食生產的統計數據，就像人民日報的報道。如果讀人民日報，每個主要消息似乎都言之鑿鑿，像是不容置疑的宇宙真理；但是，如果連續翻看數十年來的標題，就會發現其自相矛盾到荒謬的程度。同樣，當中國統計數字報出，糧食產量6億噸，進口量7000多萬噸時，絕大多數人並不覺得中國糧食有問題，因為進口量僅僅是糧食產量的10%多一些。但是，按照中國統計數字，中國糧食產量從2007年的5億噸增長到2014年的6億噸，再加上高熱量值的大豆、植物油、其它油料作物、肉類等等進口食物，大致相當於上億噸的高熱量值的糧食進口，加總為7億噸左右糧食總供應量。需要強調的是，中國在2007年時早已經擺脫了饑荒、飲食結構基本穩定；隨著城鎮化的深入，大多數人進入城市，運動和熱量消耗值相對減少；而且到2014年，中國人口沒有顯著增加，並且進入快速老齡化的階段。這三方麵的社會特點意味著，中國糧食消耗應該保持相對穩定、甚至產生一定的減少。但是，如果考慮到統計的自產糧食和海關進口糧食數據，中國僅僅用了短短7年時間，自產和進口糧食的熱量值消費最少增加40%（按照7億噸計算）。\n\n**從消費狀況和糧食增長的數字進行對比，就可以看出糧食增長的數字極為荒謬。在自產糧食和進口糧食的兩個數據中，必然有一個造假，誇大整個數據**。而進口糧油的海關數據不會造假，更因為走私的原因，導致真實的進口糧油數值被縮小。所以，中國自產糧食數據造假，而且造假的數值巨大。從中國糧食總消耗的角度，自產糧食和進口糧食的總量應該仍然保持在5億噸左右。即使消費大幅增長，也不可能超過6億噸。而差不多1億噸的進口糧油，占到中國糧食總銷量的16-20%左右。如果從熱量值的角度，進口糧油所占的糧食比重更大。從進口的分類上，近7000萬噸的大豆、近1000萬噸的植物油、近500萬噸的油菜籽、近500萬噸食糖、數百萬噸的肉類和其它食物等等，而這些都是具有很高和非常高熱量值的食物。同時，中國自產的糧食是熱值較低的小麥、玉米和稻米。如果按照熱值比計算，進口糧油的熱量值可以達到國產糧食的1.5倍以上，所以其占中國糧食供應的份額，估計可以達到25-30%。\n\n在國內，大量化學技術得到應用，同樣在填補國內的糧食缺口。其中，經常被人們提起的是地溝油，也就是廢食用油經過處理後重回餐桌。中國地溝油的產量很大，據估計，地溝油的量約占食用油總消費量的20-30%。按照中國年均消費食用油2100萬噸的總量計算，每年產生廢油400-800萬噸，其中大部分返回到餐桌上。比地溝油規模更大的是瘦肉精，瘦肉精與豬肉緊密相關。在被民眾知道後，經常在食品安全問題上被提及。根據定義，瘦肉精是一類藥物的統稱，主要是腎上腺類、β激動劑、β-興奮劑（β-agonist)，能顯著提高[胴體](http://baike.baidu.com/view/986093.htm \"鏈接關鍵詞\")的瘦肉率、增重和提高飼料轉化率的物質都可以叫做“瘦肉精”，被用作牛、羊、禽、豬等畜禽的促生長劑、飼料添加劑。除了瘦肉精外，中國生豬飼養還使用含有大量激素、安眠藥、高銅、砷等藥物的添加劑催肥催長。通過這樣的方式，生豬成長時間可以從10-12個月，減少到5-6個月，生長周期減少一半，相應的飼料消耗也減少一半。按照非激素飼料的飼養，飼養場裏6斤以上的飼料生成一斤豬肉，而散養豬可能達到10斤以上（按照熱值轉化）；加瘦肉精和各種激素後，大約3斤飼料就可以生成一斤豬肉，每斤豬肉最少節省3斤飼料。2013年，中國的豬肉消費量超過5200萬噸，占全球豬肉消費總量的50%左右。如果三分之一的豬肉使用瘦肉精和激素飼料，中國一年就能節約5000萬噸糧食；如果三分之二使用，就能節約1億噸糧食。按照中國養殖業的特點，豬肉平均能夠達到三分之二的使用程度，也就是節約1億噸糧食。\n\n同時，根據統計數據，2013年，中國養殖水產品總量達4542萬噸，占世界養殖水產品總量的65.3%。如果按照魚類的自然生長規律，魚類養殖需要大量的飼料。而中國水產品養殖則通過大量投放激素、抗生素等方式，加快水產品生長，顯著縮短生長周期，減少飼料的使用量。即使按照最保守的估計，養殖一斤魚能夠通過速成的方式，減少一斤飼料的使用。按照中國每年的水產品生產總量，最少節約飼料達到4000萬噸。\n\n同樣道理，雞肉的生產與豬肉和水產品類似，大部分依靠激素促進生長，降低飼料消耗量。散養土雞經常需要100-150天成長期，大約需要6斤穀物（稻穀、小麥、玉米、高粱等）、同時，而速成雞往往隻需要30-45天，速成雞的成長速度是散養土雞的3倍左右。一斤速成雞的消耗量大約為1.9-2斤飼料，比土雞的糧食消耗能夠減少三分之二。在2012年，中國年雞肉生產和消費量達到1370萬噸，其中絕大部分是速生雞。即使按照每斤雞肉節約3斤飼料，節約的糧食約為4000萬噸。另外，瘦肉精和其它激素抗生素還廣泛用於牛羊速成。\n\n綜上所述，僅僅從地溝油、速成豬、水產品養殖和速生雞等幾大類產品，中國一年就可以節約超過2億噸飼料/糧食。即使按照最低熱量值計算，通過各種激素的速成，以中國民眾的健康為代價，減少糧食的消耗能夠達到中國糧食供應的20-25%，甚至更多。\n\n   中國糧食生產也主要依賴各種化學和生物技術。中國通過糧油等食物進口，以及地溝油和各種激素抗生素等方式節約糧食消耗，已經占到中國糧食消耗的50%以上。在剔除上述部分後，中國糧食生產僅僅占中國糧食總消耗量的不到50%。而中國糧食生產也依賴化學和生物技術，包括轉基因種子、化肥、農藥和激素等多種化學及生物產品。經過多年的化學種植方式刺激農作物增產，中國的大多數農地都已經形成化學產品依賴。化學依賴指的是，傳統的自然耕作方法已經被廢棄，農民主要依靠化肥農藥激素和抽水灌溉等方式，減輕田間作業量，並且提高畝產。在傳統自然耕作條件下，一畝地小麥畝產往往200-300斤，經過精心照顧的良田，在風調雨順的時候可以達到300-400斤。與之相對比，使用化肥農藥激素後，輕易可以將畝產翻倍，良田可以達到600-800斤。而且，使用抽水灌溉，可以保持穩定的水源，為穩定糧食產量起到重要作用。\n\n    在1980年代後，中國耕地麵積持續減少，地表水大麵積減少或者枯竭，但是中國糧食生產仍然能夠保持增長，關鍵原因是使用化肥農業激素和抽水灌溉。在2008年之後，隨著更多農田被侵占，通脹加劇，同時糧價基本不漲，導致大多數農民種糧勉強持平，甚至經常虧損。在這樣的條件下，轉基因種子開始大舉進入中國，成為中國農業的新增長點。例如，非轉基因玉米需要大量的田間作業，以及化肥和農藥的投入，在良田中能夠達到800-1000斤的產量。而農民在使用轉基因種子後，能夠減少作業量和化肥農藥投入，降低生產成本，還可能增產數百斤產量。所以，當種子公司以減少投入和高產的賣點，吸引農民購買時，農民紛紛選擇轉基因產品。雖然農民並不關心什麼是轉基因或者非轉基因，甚至都不知道轉基因是什麼意思；但是，由於農民主要關心的是經濟利益，追求高一些的收益，轉基因種子在中國快速得到普及。\n\n從上述分類可以看出，中國糧食供應基本依靠進口，需要消耗大量外彙。從分類上，進口包括直接進口和技術進口。直接進口指的是直接的糧食進口，需要直接消耗外彙。技術進口主要指化肥農業激素和轉基因種子等，雖然表麵上是中國國內出產，但是主要依靠國外的技術實現產出和增產。在中國農民普遍放棄傳統的耕作方式，采取進口技術後，就等於進口技術在起著主導推動作用。當農民在使用化肥農藥激素和轉基因種子，往往不會注意到，這些產品基本靠國外技術。大多數高產種子都是直接進口，而相當一部分的化肥農業激素也依靠進口、或者引進國外技術在中國生產。在中國農業對進口技術產生依賴後，等於放棄了傳統農業的農田方式和種植方式。農民們不再爭搶水源，也不再進行稻田養魚、農作物間種等方式減少害蟲、提高農作物產量。當農民不再采用傳統方式種田，而是依賴輕鬆的化肥農藥激素轉基因種子種田後，下一代年輕農民就失去傳統耕田的技能。這樣的問題是，一旦失去進口技術的支持，中國糧食產量遭受毀滅性打擊。由於耕地已經適應了化肥農藥激素的施用，形成相應的土壤特點，一旦停止施用化肥和激素，大部分耕地的糧食產量將急劇減少；一旦再停止施用農藥，大多數耕地將麵臨絕收或者接近絕收的境況。而且，大部分農民購買的糧食和蔬菜的種子都是通過進口，種植一季之後無法留種。尤其是轉基因作物的種子，更因為自身轉基因特點，無法實現自我繁殖，留種更沒有意義。所以，農民如果想繼續生產農作物，就必須年年購買國外的種子，一旦停止購買種子，就等於無種可以用於播種，更不可能實現收獲。不論直接進口的糧油，還是間接技術進口的化肥農業激素種子，都需要消耗大量的外彙，才能保證糧食的基本供應。\n\n外彙成為中國農業的基礎，決定絕大部分的中國糧食供應。從上述的分析可以看出，中國農業雖然表麵上似乎還存在農業，但是基本已經由進口所決定，也就是由外彙所決定。一旦沒有外彙，就會出現兩方麵的狀況：一是進口糧油肉等產品全麵減少，甚至中斷，導致相當一部分食品供應中斷；二是進口化肥農藥激素種子等產品供應全麵減少，甚至中斷，導致整個農業生產全麵急劇減少，甚至產生大麵積絕種和絕收的情況。兩者相結合的結果是，中國糧食供應至少縮減70-80%的數量，進而因為糧食飼料短期，導致畜牧業全麵停頓。屆時，中國高熱量值的食物將全麵短缺，民眾將主要消費低熱量食品，也就是主要以小麥麵粉、大米和玉米為主。食用油、肉類和奶粉等產品將出現嚴重短缺。即使在較好的情況下，當食物的供應量減少到隻有30-40%左右的時候，即使不出現全國性大饑荒，民眾也退回到極為困乏的生活。這種情況如同60-70年代，人們的食物裏有很少的油，很少有肉。由於攝入的食物熱量值低，人們很容易消耗掉食物，快速陷入饑餓狀態中。如果在較惡劣的情況下，中國已經沒用外彙進口糧油和技術，大麵積的土地絕收或者接近絕收，食物供應量減少到隻有10-20%，人們即使隻攝入最基本的米麵玉米麵，也不夠所有人的消費。整個社會陷入大饑荒。不論是困乏的生活，還是大饑荒，都意味著社會中其它經濟單元急劇萎縮。連飯都不夠吃、甚至沒得吃的時候，其它的所謂買房買車旅遊消費等等，都是過眼雲煙。\n\n中國官方已經意識到相應的問題，並且試圖開始著手解決。從官方的態度上，開始強調幾個關鍵部分：1、強調供銷社係統，這個係統在改革開放後，因為其缺乏靈活性和效率，已經逐漸被廢棄。最近又開始強調建立供銷社係統，有可能意味著應對糧食問題，保持穩定平均的社會供應。\n\n2、強調糧庫建設，在糧食大量進口的情況下，農民種糧和售糧數量相對減少，中國官方糧庫的功能明顯萎縮。雖然糧食係統還在大量吃國家給的補貼，但是國家糧庫存糧大幅減少、地方糧庫基本被廢棄。所以，當國家準備考察糧庫的時候，立即出現糧庫大火，賬本上的數萬噸糧食可以很快燒光。當然，國家也知道，這些糧食隻是存在於賬本上，所以基本停止考察糧庫。問題是，大量糧庫實際上成為空庫，當沒有了外彙，難以大規模進口糧食時，中國直接陷入困境或者大饑荒，沒有任何緩衝的餘地。\n\n3、鼓吹轉基因技術發展，中國官方從早期的對轉基因持相對否定的態度，後來逐漸改為聽之任之的態度，到最近開始大力鼓吹和支持轉基因。從外彙的角度可以看出，如果中國沒有了外彙，而轉基因技術發展起來，能夠自己生產轉基因的種子，中國的糧食生產還能夠保持一定水平，不會直接陷入大饑荒。從官方鼓吹的角度也可以看出，中國官方對糧食的危機情況有了較為明顯的認知，希望盡快通過發展轉基因，實現一定程度的種子自給自足，以免以後無力購買國外的轉基因種子。\n\n從上述三方麵的內容進行一定的結合，可以看出，國家已經考慮在生存、運輸儲存和銷售等環節，建立起一定的能力，保障一定的糧食安排。而采取這些措施的狀況表示，中國的糧食安全就像堰塞湖，已經積重難返，隻能在某個突然的時間潰壩，造成社會的大動蕩和大饑荒。"
		},
		{
			"post_id": 5,
			"title": "王尚一：大陆金融黑洞的数字分析 （外资财产篇）",
			"date_published": 1497357196.863,
			"body": "來源：[http://www.iocecs.com/chinaeconomy/shownews.php?lang=cn&id=78](http://www.iocecs.com/chinaeconomy/shownews.php?lang=cn&id=78)\n\n<span data-cke-bookmark=\"1\" style=\"display: none;\"> </span>\n\n按照保守的數字估計，外資在中國擁有6萬億美元以上的現金，另外應當擁有超過10萬億美元以上的房地產，另外還有工廠等有形資產（按照2015年6月的價格計算），絕大部分的無形資產（包括品牌和技術等知識產權），還有上萬億美元對中國的貸款。 一旦外資大規模從中國撤離，中國大陸經濟瞬間被衝垮，重回小農經濟時代。\n\n外資財產是中國政府的真實外彙負債。雖然在表麵上，中國的外儲資產大餅無比巨大，令整個世界豔羨。但實際上，外儲又是中國中央政府的真實負債。根據規則，政府外管局承諾，當正規外資離開中國時，外資將手裏的人民幣給外管局，外管局按照彙率，將美元給外資。如果外管局違約怎麼樣？顯而易見，如果美國企業被違約，美國政府自然會凍結中國的外儲，強製將資金劃轉給美國企業。如果人民幣突然爆貶怎麼辦？很簡單，美國政府同樣會以中國是彙率操縱國的名義，全麵製裁中國，並且凍結中國在美國的所有外彙資產。\n\n在中國，外資財產已經積累到天文數字，也就是中國政府的負債已經是天文數字。從表麵上，中國有3.7萬億美元的外儲，似乎擁有巨大的大餅。但是，這個數字和外資在中國的財產相比，連外資財產在中國的零頭都不到。 因為，在中國內部，外資具有全麵超強的優勢，包括政策優勢、金融優勢、技術優勢、管理優勢等。經過20多年的經營，外資將這些優勢轉化為巨額資金和財產儲備。一旦外資大規模撤出中國，外儲將快速被衝垮歸零。而剩下的外資將麵對毫無價值的人民幣資產，被金融黑洞所吞噬。\n\n大致上，外資財產主要包括兩部分：\n\n1、現金儲備：外資擁有雄厚的現金儲備。按照非常保守的數字估算，外資擁有6萬億美元以上的現金。\n\n外資是人民幣發行總量M2的基礎。到2014年中之前，人民幣貨幣印刷以美元為基礎。在外資進入中國，中國外儲獲得外資美元後，人民幣進行相應的印鈔。隨後，人民幣再進行一定配套的額外印鈔，保持人民幣對美元的比例。通過主要的方式，人民幣既能夠與美元掛鉤，防止失去基礎信用；也能夠保持一定的印鈔速度，支持中共經濟體製的運營。在1999年末，中國的M2為12萬億元人民幣；到2014年中，M2達到121萬億，增長10倍。其中，一部分是外彙進入中國，進行人民幣配比印鈔；一部分是在外彙印鈔的基礎上，實現的膨脹式印鈔。\n\n外資是中國經濟的基本推動力量。到2015年2季度，中國的貨幣總量M2已經達到130萬億元人民幣，合21萬多億美元。在過去20年，外商對中國的直接投資超過1萬億美元，其中不包括大量從非統計渠道進入中國的更多資金。這些外資進入中國20年，在國內配套貸款的支持下，持續進行杠杆經營，實現複利式成長。根據商業部數據，２００２年末，中國剛剛加入WTO一年，在外商投資企業中，直接就業人員已經超過２３５０萬人，占中國城鎮勞動人口的比重約１１％。在中國經濟中，不論是實體經濟的出口生產還是國內市場生產與銷售，還是金融市場的運作，外資都在起著主導或者關鍵作用。經過持續運作，外資以自身超強的綜合優勢，獲得中國經濟中的關鍵收益和利潤。即使按照外資控製6萬億美元的規模計算，也隻占貨幣總量中的30%。而從外資的作用和財富收益的累積效應角度，30%的總量是最保守的數字。\n\n在出口生產創彙中，外資一直起到主導作用，占據出口的主要比例。在最初招商引資的時候，大陸出口廠商連運動鞋都生產不了，均為港台生產企業。隨著出口生產的變化，大陸人力成本持續提高，出口產品也在不斷轉型。其中，外資起到引領轉型，提高中國出口技術含量的主導力量。到2013年，中國出口達22100億美元，進口19500億美元，成為世界外貿第一大國。其中，外資企業出口達到10442億美元，占中國總出口的47.3%。 而且，機電產品出口達到12655億美元，高新技術出口6603億美元（兩者數據有重合）。從產業角度，在外資企業的出口中，大多數都是機電產品和高新技術出口。而這些產品出口價值高、技術含量高、規模大，是外企生產向中國轉移的主要部分。\n\n從外貿出口的實際收益的角度，外企所占比重更大。 尤其在加工貿易出口中，外資起到主導地位，占據絕對的銷售和利潤比例。根據2013年數據，加工貿易項目出口達到8608億美元，同時本項目進口為4969億美元，順差超過3600億美元。如果刨去這部分，中國進出口為逆差。而這個項目是典型利用中國廉價資源和勞動力，為國外產品進行組裝加工而實現。其中，絕大部分的大型組裝加工企業為外資，尤其是台資工廠。富士康作為其中的代表，在大陸的工人數上百萬，為蘋果產品進行組裝加工。而這部分的出口數額巨大，但是利潤較低。這些產品在運出中國的時候，按照成品總體進行出口額的計算。例如，據市場研究公司IHS拆機分析顯示，蘋果公司新推出的iPhone 6智能手機的部件和勞工成本在200美元到247美元之間。其中，每部手機的流水線勞工成本為4美元到4.5美元。除了勞工成本之外，在整個iPhone產品的價格中，絕大部分收入由進口產品或者在中國運營的外企獲得。除了一部分需要直接支付外彙之外，另外一部分在外企支付相關勞動成本後，以利潤的形式存在中國。\n\n外企基本控製中國的中高端市場，並且壟斷各種產品的關鍵零部件供應。世界大多數大型跨國公司進入中國市場，在中國進行大規模投資，並且獲得巨大的收益。早期，少數外企進入中國生產和銷售產品，從1990年代開始享受到快速擴張和高利潤率的甜頭。這些企業包括大眾汽車、摩托羅拉（BB機和手機）、另外還有寶潔日化等等。中國加入WTO之後，在中國政府的特殊優惠政策鼓勵下，絕大多數跨國公司快速進入中國，搶占中國市場。幾乎所有的中高端品牌產品，或者高價值複雜產品和設備，都由外資控股或者參股企業生產銷售。其中，各種工業設備，尤其是中高端設備，基本被外資壟斷。在中低端設備中，外資掌控各種關鍵零部件。在高鐵等設備中，中國主要是製造車殼等部件。汽車業大部分由外資品牌占領，而且外資企業的關鍵零部件占據整個市場。在鐵公基和房地產中，各種工程機械、中高檔建材、衛浴設備，相當部分屬於外資控股。在醫療健康相關市場，各種中高檔醫療器械和耗材、以及專利藥品，基本由外資壟斷。在其它民用產品領域，外資也全麵占領中高端市場，或者控製所有關鍵零部件供應，留下低收入、低利潤的市場給本土企業。關於外資在中國市場的市場份額、收入和利潤等數字，中國政府都不公布。可以說，如果公布，將導致整個市場的恐慌。\n\n在主導出口和國內市場的情況下，外資企業持續在積累利潤。有的分析人士認為，中國的GNP隻有GDP的一半到60%，剩下的收入基本為外資所有，而且外資利潤極為豐厚。出口數字說明這個數字真實可靠，不過國內市場仍然不透明。不論如何，外資在中國市場的地位舉足輕重。而且，經過十年的利潤積累後，加上企業初始本金，就形成極為可觀的數目。如果再考慮到金融資本所持現金，6萬億美元的數字已經非常保守。\n\n2、實物資產：外資在中國擁有大量的土地和房地產，對於中國資產價格具有決定的影響作用。如果按照2014年的價格，外資持有的房地產超過10萬億美元。如果外資看到形勢不對，以低價拋售地產，直接可以導致大陸地產在表麵上的崩盤。\n\n越早介入房地產、並且介入房地產開發的外資，獲利也越豐厚。在中國加入WTO之前，少數香港房地產開發商已經進入大陸，其中最為典型的例子是李嘉誠。香港資金從1990年代中後期開始進入內地，到2005年之前，以幾乎免費的價格在一二線城市拿地。在以上海為代表的一二線城市中，外資進入普遍較早。在大量囤地後，李嘉誠緩慢進行房地產開發，多數項目的開發周期超過10年。其開發的高檔房地產項目在銷售後，輕易可以獲得數百倍以上的利潤。在中國加入WTO之後，金融類外資開始規模化進入中國，注資中國金融資產領域。其中，不少資金進入房地產開發，從地價和房價很低的時候起步，獲得豐厚的收益。這些外資以低調的姿態，控製著大片的土地，擁有大量的房產。其中，以多個香港開發商為代表外資囤積大量，即使不進行開發，如果按照市價轉讓土地，也能夠獲得數十倍到數百倍的利潤。而且，外資在一二線城市擁有大量標誌性建築，尤其以積極吸引外資的上海為例，相當一部分中高檔寫字樓由外資所擁有，對市場心理形成重大影響。\n\n在金融投資領域，多個美資銀行和投行成為戰略投資者，成為中國大型國企的股東。等國企在香港上市後，這些銀行和投行逐漸退出，獲利數千億美元。2002-2003年，巴菲特在香港投資4.88億美元，投資中石油股票，曆時近5年，在中石油A股上市前大舉拋出，獲利36億美元，是初始投資的7倍多。當無數人看到外資金融機構在香港股市大規模獲利時，往往忽略進入中國的金融類資產，同時在悄悄獲得巨額利潤。在類似時間，有數千億美元的金融類遊資進入中國大陸。根據2006年之前一些消息估計，有超過3000億美元的國際遊資潛入中國、參與金融領域炒作。其中，一部分資金進入股市，在中國股市處於較低位置的時候入場。隨著中國出口和吸引外資的規模快速擴大，加上中國印鈔的同步放大，社會中資金急劇增加，引發和推動股市的巨大牛市。這些外資在股市較高的水平退出，輕易可以達到3-5倍。\n\n房地產是吸引遊資最主要的領域。一些外資在股市獲利後，同樣進入房地產市場。另外，在2006年之前，按照正規渠道進入中國，從事房地產開發和炒作的外資，達到1000億美元以上。在房地產方麵，以上海為代表的地方政府積極吸引外資，明確以投資保底的承諾，希望外資參與上海的房地產運作。在地方政府的政策支持下，一部分外資進入房地產開發領域，另一部分進行房地產炒作。不論房地產開發和炒作，都得到地方政府安排的開發貸款融資和房貸融資。在短短數年內，不論房地產開發還是炒作，都獲得翻倍的利潤。考慮到融資杠杆，外資參與房地產的收益，輕易可以達到5倍以上。而相當一部分資金對房地產的投資周期長，則輕易獲得3-5倍的價格上漲。加上融資杠杆，這些資金的收入可以輕易達到20倍以上。2006年後，數千億美元遊資持續進入中國，支持中國房地產價格上漲。2009年之後，中國房地產價格持續暴漲，更大規模的國際遊資進入中國，推動房地產加速上漲。\n\n外資在中國房地產的規模，僅僅從一些簡單數字就可以計算出來。從2002到2006年的5年間，進入房地產和股市的外資估計有超過4000億美元。這些資金進入中國，按照當時美元兌人民幣的平均彙率，大約為1:8，可以換購3.2萬億元人民幣。不論直接進入樓市，還是進入股市炒作後再進入樓市，都獲得極高的價格回報。如果按照保守的30%首付，按揭貸款70%。其買房資金總額達到10萬億左右。如果不考慮囤地或者開發房地產的極高額回報，隻考慮購買樓宇後的升值，按照保守估計，到2014年中，其投資的房地產價格達到5倍，其總額也乘以5倍，達到50萬億元人民幣。如果所有房產照此價格出售，償還15萬億元的按揭貸款和相關財務費用，炒作資金還能夠剩餘35萬億元人民幣。從2007-2008年，大量外資繼續進入中國，而且這些外資更多集中到房地產領域。即使按照極為保守的估計，進入房地產的外資為2500億美元，按照1:7.3的平均彙率，折合人民幣約為1.8萬億元。同樣按照30%的首付，70%的按揭貸款，買房資金總額達到6萬億元人民幣。按照保守估計，到2014年中，房價上漲為3倍，總金額達到18萬億元人民幣。 同樣道理，如果能夠賣掉房產，償還8億元房貸和相關融資成本，外資能夠剩餘10萬億元人民幣。2009年之後，大量遊資進入中國，即使中國外儲進行各種揮霍和撒錢，外儲總量還繼續增加2萬億美元。即使按照極為保守估計，1萬億美元（按照均價達到6.5萬億人民幣）進入房地產，按照30%的按揭，70%的按揭貸款，炒房資金達到20萬億元。即使按照一倍的升幅，房價總值也達到40萬億人民幣。如果能夠賣掉房子，償還掉20萬億的貸款和財務費用，外資仍然能夠剩20萬億元人民幣。 這些數字累積起來，大致超過10萬億美元。\n\n如果外資撤離中國，不論是將6萬億美元中的部分資金撤走，還是將超過10萬億美元的房地產中的一部分低價拋售，都將對大陸房地產市場造成毀滅性打擊，進而將外儲呆壞賬堆積如山的情曝光。一旦外儲黑洞被曝光，剩下的外資將奪路而逃，賬麵外儲隨時被換光。而且，在外資大量外逃之前，手握巨額現金的大陸權貴隨時在嚴密觀察局勢。隨著外資逃離的資金規模加大，達到較為危險的程度，權貴首先知道消息，提前兌換外彙，加速大陸金融黑洞的爆破。"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}