{
	"topic": [
		{
			"title": "Société de Cristal de Max Harms",
			"pubDate": "2017-12-17 10:44:18",
			"link": "https://linuxfr.org/users/nahoj/journaux/societe-de-cristal-de-max-harms",
			"author": "nahoj",
			"body": "\n<p>Un journal de pub éhontée pour un roman de SF qui cause d'intelligence artificielle : <em><a href=\"http://crystal.raelifin.com/\">Crystal Society</a></em>, de Max Harms.</p>\n\n<p>Ce roman imagine l'apparition des premières consciences artificielles dans un labo de l'université de Rome dans environ 20 ans, puis leurs interactions avec le reste du monde, tout cela raconté du point de vue d'une de ces IA. Le roman est en anglais mais j'en ai <a href=\"https://perso.crans.org/grande/trad/cristal/\">traduit le début</a> pour tenter ceux qui hésiteraient à se lancer.</p>\n\n<p>Ce roman, qui se revendique de la science-fiction dure, est intéressant car il fait réfléchir à des questions éthiques ainsi que de sûreté de l'intelligence artificielle, autrement dit des problèmes que pourrait poser l'apparition d'IA <em>générales</em> qui ne soient pas fondamentalement maléfiques mais rationnelles et avec des buts plutôt positifs.</p>\n\n<p>Le roman implique également des extraterrestres peu amènes, une organisation communiste révolutionnaire, et une sorte d'Elon Musk qui s'applique à coloniser Mars.</p>\n\n<p>L'auteur est un développeur qui se spécialise dans le machine learning, et fait partie de la communauté de la rationalité bayésienne, à laquelle on doit également <em><a href=\"http://www.hpmor.com/\">Harry Potter et les Méthodes de la Rationalité</a></em> (<a href=\"https://www.fanfiction.net/s/6910226/1/Harry-Potter-et-les-M%C3%A9thodes-de-la-Rationalit%C3%A9\">VF</a>) par exemple (que je recommande aussi, ou <a href=\"https://www.lesserwrong.com/\">leurs essais</a> pour ceux qui préfèrent la non-fiction).</p>\n\n<p>Crystal Society est le premier roman d'une trilogie dont le dernier tome devrait sortir en février 2018. Le premier tome est disponible en ligne sous licence CC-BY-NC.</p>\n<h3>Liens</h3>\n\n<ul>\n<li><a href=\"http://crystal.raelifin.com/\">Site officiel et tome 1 en VO</a></li>\n<li><a href=\"https://perso.crans.org/grande/trad/cristal/\">Premier chapitre en VF</a></li>\n<li><a href=\"https://fr.wikipedia.org/wiki/Intelligence%20artificielle%20amicale\" title=\"Définition Wikipédia\">Intelligence artificielle amicale</a></li>\n</ul>\n<div><a href=\"https://linuxfr.org/users/nahoj/journaux/societe-de-cristal-de-max-harms.epub\">Télécharger ce contenu au format Epub</a></div>    <p><a href=\"https://linuxfr.org/users/nahoj/journaux/societe-de-cristal-de-max-harms#comments\">Lire les commentaires</a></p>\n",
			"added": 1513509716,
			"topic_id": 1513509716,
			"doc": "journal"
		},
		{
			"title": "Coffre numérique.",
			"pubDate": "2017-12-16 20:23:15",
			"link": "https://linuxfr.org/users/kwiknclean/journaux/coffre-numerique",
			"author": "Kwiknclean",
			"body": "\n<p>Cher journal,</p>\n\n<p>Après le succès planétaire rencontré lors de l'ébauche de ma dernière causerie, tu m'as vraiment donné envie de continuer à échanger avec toi, cette fois de manière plus apaisée.</p>\n\n<p>Me sentant d'humeur loquasse, je souhaitais partager sur un sujet qui m'intéresse la sécurité, et notamment la gestion des mots de passe.</p>\n\n<p>Inutile de te présenter : <a href=\"https://haveibeenpwned.com/\">https://haveibeenpwned.com/</a></p>\n\n<p>De plus une rapide recherche dans google actu avec les mots clés \"leak password\" ferait transpirer n'importe quel RSSI, ça semble devenu le nouveau e-sport avec le mining de crypto-monnaie</p>\n\n<p>Initialement j'utilisais, KeepassX en dur sur mon PC de bureau.<br>\nHors vraiment peu pratique lorsque tu es à l'extérieur ou sur ton smartphone pour par exemple accéder à tes mails …</p>\n\n<p>Puis j'ai migré vers LastPass qui propose un coffre fort en ligne. <br>\nJ'en étais satisfait, ils ont l'air de proposer un service sérieux et de chiffrer les comptes sur leur serveur.<br>\nSeulement ça reste une solution propriétaire hébergée chez un tiers …</p>\n\n<p>En fouillant un peu il y a quelques jours j'ai découvert : <a href=\"https://bitwarden.com/\">\"Bitwarden\"</a>.</p>\n\n<p>Opensource (le core est sous AGPL-3.0, les outils de connexion sous GPL-3.0 ), authentification \"two-step\" disponible, ce dernier propose surtout la particularité de pouvoir héberger le service sur ta machine à la maison (ou ailleurs) : génial c'est ce que je recherchais, avoir la possibilité de mettre mes crédentials chez moi, mais disponible à travers le net.</p>\n\n<p>Toutefois, en grattant un peu on s'aperçoit qu'il faut utiliser des outils assez propriétaires (mais gratuit) pour l'héberger notamment : .NET Core 2.x SDK et SQL Server 2017 … et ça commence à faire lourd l'application quand même. Tu peux oublier sur ton Raspberry pi.</p>\n\n<p>Petite nuance toutefois ce dernier est gratuit jusqu’à 2 utilisateurs, il vous faudra passer en revanche passer à un \"plan\" pour l'utiliser en entreprise ou mode \"famille\", à des tarifs toutefois tout à fait raisonnable. Pour un usage personnel ça ne pose aucun soucis.</p>\n\n<p>Point de vue personnel : ça ne me choque pas d'aider un peu les développeurs du projet lorsqu'on monte un business avec des outils de cette qualité pour soutenir leur travail (on doit tous payer les factures).</p>\n\n<p>L'interface est sympathique, il manque encore quelques petites fonctionnalités comme la génération d'un password par l'interface web (mais ce ne sont pas les outils qui manquent pour faire ça), de plus les développeurs semblent être attentifs aux questions sur reddit.</p>\n\n<p>Le plugin Firefox et l'application Android sont quant à eux plutôt bien foutus, il y a également un mode cli que je n'ai pas encore testé.</p>\n\n<p>En attendant de rencontrer un service de cette qualité 100% Open-Source et 100% gratuit (encore que est-ce absolument nécessaire …?) je pense que je vais utiliser cette solution, pour l'instant j'suis le cul entre deux chaises, entre lastpass et bitwarden à défaut de mieux.</p>\n\n<p>La migration de LastPass ou KeePass(x) se fait très simplement par un import/export.</p>\n\n<p>Chose intéressante leur site m'a fait découvrir un nouveau navigateur <a href=\"https://brave.com/\">\"Brave\"</a>, le lion à l'air sympathique, j'vais m'empresser de le tester :0</p>\n\n<p>Et toi journal tu utilises quoi pour sécuriser tes pass ?</p>\n<div><a href=\"https://linuxfr.org/users/kwiknclean/journaux/coffre-numerique.epub\">Télécharger ce contenu au format Epub</a></div>    <p><a href=\"https://linuxfr.org/users/kwiknclean/journaux/coffre-numerique#comments\">Lire les commentaires</a></p>\n",
			"added": 1513509715,
			"topic_id": 1513509715,
			"doc": "journal"
		},
		{
			"title": "Retour d’expérience (et tuto) XMPP",
			"pubDate": "2017-12-16 17:00:08",
			"link": "https://linuxfr.org/users/quent57/journaux/retour-d-experience-et-tuto-xmpp",
			"author": "quent57",
			"body": "\n<p>Bonjour nal</p>\n\n<p>J'écris ce journal pour décrire mes manipulations pour utiliser XMPP. Cela pourra peut-être aider des personnes qui ont la même config que moi, et j'aimerai récupérer des remarques ou des conseils.</p>\n<h2>XMPP</h2>\n\n<p>XMPP, plein de journaux en parlent, il y a quelques polémiques (compliqué à cause des XEP) mais je suis plutôt convaincu.</p>\n\n<p>Aujourd’hui, j'ai décidé de sauter le pas, et de l’utiliser pour remplacer les SMS (avec les contacts \"compatibles\" bien entendu !).</p>\n\n<p>Je ne m'attendais pas à devoir écrire un tutoriel pour savoir utiliser ça…</p>\n<h3>L’environnement</h3>\n\n<p>Je souhaite dans un premier temps faire communiquer 2 personnes, avec des périphériques android, Ubuntu (LTS 16.04 et 17.10) et Windows. Plutôt banal donc.</p>\n\n<p>J’ai une brique internet avec Yunohost installé si besoin.</p>\n<h3>Hébergeur</h3>\n\n<p>Il faut d’abord choisir un hébergeur.</p>\n<h4>Auto hébergement</h4>\n\n<p>J’ai une brique internet, avec donc un petit processeur ARM, pourquoi pas installer un serveur XMPP dessus ?<br><a href=\"https://linuxfr.org/users/postroutine/journaux/pourquoi-jabber-n-a-pas-plus-de-succes-meme-chez-les-informaticiens\">Ce journal</a> m’indique 2 logiciels coté serveur : <a href=\"https://prosody.im/\">Prosody</a> et <a href=\"https://www.ejabberd.im/\">Ejabberd</a>. Le premier étant indiqué plus léger que le second.<br>\nMalheureusement, un commentaire dit que l’installation n’est pas <a href=\"https://linuxfr.org/nodes/112771/comments/1715448\">si simple</a> d’autant plus que l’appli n’est <a href=\"https://yunohost.org/#/apps_fr\">pas packagée pour yunohost</a>.</p>\n<h4>Hébergeur sur l’Internet</h4>\n\n<p>Je trouve dans <a href=\"https://linuxfr.org/news/chatsecure-4-0-ronronne-et-adopte-omemo\">ce journal</a> une liste de serveur conseillés (et une autre liste <a href=\"https://wiki.jabberfr.org/Serveurs\">ici</a>) et je tombe donc sur <a href=\"https://jabberfr.org/\">jabberfr.org</a>. Ce site fait partie des CHATONS de framasoft, c’est rassurant.<br>\nJ’ai un doute quand je vois <a href=\"https://wiki.jabberfr.org/JabberFR\">ici</a> que </p>\n\n<blockquote>\n<p>JabberFR n’est pas un serveur Jabber mais une fédération. </p>\n</blockquote>\n\n<p>Finalement, je mets quelques minutes à comprendre que c’est bien un serveur jabber pour les adresses @jabber.fr et que le formulaire d’inscription est ici : <a href=\"https://im.apinc.org/inscription/\">im.apinc.org/inscription</a> (pas évident tout ça !).</p>\n<h3>Client Android</h3>\n\n<p>J’installe <a href=\"https://conversations.im/\">Conversation</a>, indiqué par <a href=\"https://linuxfr.org/users/postroutine/journaux/pourquoi-jabber-n-a-pas-plus-de-succes-meme-chez-les-informaticiens\">ce journal</a>.</p>\n\n<p>Comme d’habitude, l’installation se passe bien sous Android (depuis F-Droid pour ma part). <br>\nConversation me permet de créer un compte depuis jabber.fr. Le message qui indique que le pseudo existe déjà est sans rapport avec le problème, mais ça fonctionne.<br>\nJe tombe alors sur 3 méthodes pour chiffrer les messages : OMEMO, OTR, et OpenPGP. <a href=\"https://conversations.im/omemo/\">Ce site</a> et <a href=\"https://linuxfr.org/news/xmpp-a-fond\">ce journal</a> me convainquent d’utiliser OMEMO (dommage qu’il n’y ai pas de \"Server side archive\").<br>\nJe galère un peu à comprendre comment l’utiliser sur Conversation. Je scan des qr code OMEMO d’un tel avec l’autre, j’importe la clé dans Conversation, mais ca ne fonctionne pas (message \"pas de clé pour le contact\").<br>\nJe passe donc avec OTR et la encore des scan de qr code à faire, mais ca fonctionne.</p>\n<h3>Client PC</h3>\n\n<p>Je choisi <a href=\"https://gajim.org/\">Gajim</a> (au design très vieillot) car il est souvent cité en référence (<a href=\"https://linuxfr.org/users/postroutine/journaux/pourquoi-jabber-n-a-pas-plus-de-succes-meme-chez-les-informaticiens\">ici</a> et <a href=\"https://linuxfr.org/news/chatsecure-4-0-ronronne-et-adopte-omemo\">la</a> par exemple).</p>\n\n<p>Alors pour installer un logiciel sous ubuntu, j’ai toujours 2 références : le <a href=\"https://doc.ubuntu-fr.org/gajim\">wiki ubuntu</a> et <a href=\"https://gajim.org/index.php\">le site de l’éditeur</a>. D’abord sur le PC Ubunut 17.04 <code>apt install gajim</code>, c’est facile comme d’hab ! </p>\n\n<p>Lancement, le compte est bien trouvé,… tentons avec OMEMO, …, il faut un plugin, mais pas de souci, il y a un gestionnaire de plugin dans Gajim. <br>\nPar contre je ne peux pas l’activer, et l’interface me dit d’installer les paquets suivants (1 par 1, et il faut redémarrer gajim entre chaque installe sinon c’est pas drôle) : <code>python-setuptools  python-axolotl python-qrcode  python-cryptography</code>. </p>\n\n<p>Bon, je fouille un peu les options, et ça fini par marcher en OMEMO. Et Conversation se met aussi à fonctionner avec OMEMO tout seul, bonne nouvelle ! </p>\n\n<p>Pour l’install sur le PC en Ubuntu 16.04, je laisse temporairement tomber :<br>\nJe vois que la version de Gajim <a href=\"https://packages.ubuntu.com/search?keywords=gajim&amp;searchon=names&amp;exact=1&amp;suite=all&amp;section=all\">des dépôts</a> (0.16.5) n’est pas compatible avec le plugin OMEMO … <code>Your Gajim version is too old, OMEMO needs 0.16.6 or higher.</code><br>\nBon, je chercherai un PPA plus tard…</p>\n<h3>Futur</h3>\n\n<p>Il me reste à tester <a href=\"https://linuxfr.org/news/movim-0-12-lovejoy\">Movim</a> pour android et <a href=\"https://linuxfr.org/users/bersace/journaux/dino-un-nouveau-client-jabber-gtk-facon-gnome-3\">Dino</a> pour Ubuntu.<br>\nAucune idée de la compatibilité des différentes fonctionnalités avec mes clients existants (soit j’essaie de comprendre ce qui signifient chaque XEP, soit je tente et je vois ou ca bloque…).</p>\n\n<p>Avant d'avoir trop de contactes, j'aimerai bien utiliser une adresse xmpp avec mon nom de domaine au lieu de @jabber.fr</p>\n\n<p>Voir ce qui fonctionne avec <a href=\"https://support.mozilla.org/fr/kb/messagerie-instantanee-et-tchat\">le client XMPP intégré de thunderbird</a></p>\n\n<p>Enfin, je jetterai un œil à <a href=\"https://matrix.org/\">Matrix</a>. Même s’il n’y a pas la compatibilité de XMPP, ils ont l’avantage (à mes yeux) d’avoir un partenariat avec Purism pour le smartphone <a href=\"https://puri.sm/shop/librem-5/\">Librem 5</a>.</p>\n\n<p>Une aprem pour ça, et ce n'est fini.<br>\nCe n'est pas encore une solution clé en main, XMPP !</p>\n\n<p>Alors, des conseils pour la suite ?</p>\n<div><a href=\"https://linuxfr.org/users/quent57/journaux/retour-d-experience-et-tuto-xmpp.epub\">Télécharger ce contenu au format Epub</a></div>    <p><a href=\"https://linuxfr.org/users/quent57/journaux/retour-d-experience-et-tuto-xmpp#comments\">Lire les commentaires</a></p>\n",
			"added": 1513509714,
			"topic_id": 1513509714,
			"doc": "journal"
		},
		{
			"title": "Parlons un peu de Star Wars VIII - Les derniers Jedi (Attention : SPOILERS)",
			"pubDate": "2017-12-16 15:36:07",
			"link": "https://linuxfr.org/users/madhatter/journaux/parlons-un-peu-de-star-wars-viii-les-derniers-jedi-attention-spoilers",
			"author": "MadHatter",
			"body": "\n<p>Bonjour,</p>\n\n<p>je previens d'emblée : que ceux qui n'ont pas encore vu le film passent leur chemin, nous allons ici en parler et donc en révéler tout ou partie.</p>\n\n<p>Je n'ai pas la prétention d'être critique ou expert en cinéma, je donne simplement mon avis pour lancer la discussion.</p>\n\n<p>Je suis donc allé voir Star Wars Episode VIII hier soir en V.O., et je suis mitigé.<br>\nJ'ai passé globalement un bon moment divertissant, donc le \"contrat\" est rempli.</p>\n\n<p>Il y a de bonnes choses, comme la mort de Snoke par exemple. Le personnage est mystérieux, on ne sait (toujours) pas qui il est, ni d'où il vient, mais semble avoir de l'importance de part son statut de \"grand méchant\" et… il meurt ! C'était assez inattendu (pour moi en tout cas), et donc appréciable.</p>\n\n<p>De la même manière, j'ai bien aimé le traitement de Kylo Ren et de son évolution, tiraillé entre le côté clair et le côté obscur. Il n'est pas tout blanc ou tout noir, là encore, ce n'est pas désagréable.<br>\nLe personnage de Rey est lui aussi bien écrit (et merveilleusement joué par Daisy Ridley), et l'idée qu'elle ne soit personne est très bonne. C'est même un soulagement, tellement je n'avais pas envie que l'on découvre qu'elle ait un lien de parenté avec des personnages connus. Ça donne plus de poids à cette bonne idée que l'affinité avec la Force peut apparaître chez n'importe qui (renforcée par la scène du petit gars à la fin, qui attire son balai avec la Force).</p>\n\n<p>Je trouve intéressant le traitement des plans foireux de Poe et le fait que certes c'est un très bon pilote/chef de guerre, mais que ses victoires sont malgré tout en demi-teinte car au prix de nombreuses vies.<br>\nDu coup, ça donne envie de le voir réussir et de croire à son plan pour désactiver le traceur du vaisseau du Nouvel Ordre. Le retournement de situation et l'échec si près du but n'en sont que plus savoureux.<br>\nSurtout compte tenu de l'ambiguïté du personnage de Laura Dern (vice-amirale Holdo) que l'on soupçonne (à tort) d'être une taupe du Nouvel Ordre du début à la fin.</p>\n\n<p>Certaines scènes sont très bien pensées et visuellement très réussies, en particulier celle de Rey face à elle-même dans la caverne du côté obscur sur l'île de Luke.<br>\nLe duel entre Luke et Kylo également. Les mouvements, sur le fond rouge et blanc du sol de la planète, c'est vraiment magnifique.</p>\n\n<p>Néanmoins, certaines choses m'ont un peu déplu.</p>\n\n<p>La fausse mort de Leia par exemple. C'est trop capillotracté. Suspension d'incrédulité toussa, je veux bien, mais là c'est un peu trop gros.<br>\nMais d'un autre côté, sachant que Carrie Fisher est décédée, et à la vue de la scène précédente avec Kylo qui hésite, les échanges de \"regards\" avec la connexion à travers la force entre Ben et Leia, on se dit que ça y est, c'est pour maintenant et en fait… non. Suprenant certes, mais tellement atténué par le fait que non, la Force ne permet pas de survivre à une explosion et au fait d'être en toge dans l'espace, par -273 °C et sans oxygène. Il y a des limites.</p>\n\n<p>Elle est d'ailleurs trop vite rétablie pour quelqu'un qui vient de subir tout ça.<br>\nPire, elle s'en sort à la fin !</p>\n\n<p>Je trouve également le passage dans la ville casino de Canto Bight un peu inutile. Benicio del Toro est toujours excellent, mais cette partie n'apporte pas grand chose au film.</p>\n\n<p>Le personnage de Rose, sans être désagréable, est plein de clichés. Tous ses échanges avec Finn, le sacrifice de sa sœur, puis le sien… mouais, sur ce coup là, ils m'ont un peu perdu.</p>\n\n<p>Le Capitaine Phasma est encore sous exploité et pire, on sent que les scénaristes ont essayé de la rendre plus présente et l'artificialité qui s'en dégage.</p>\n\n<p>Bref, un film pas désagréable et divertissant, mais avec quelques faiblesses…<br>\nEt vous, qu'en avez-vous pensé ?</p>\n<div><a href=\"https://linuxfr.org/users/madhatter/journaux/parlons-un-peu-de-star-wars-viii-les-derniers-jedi-attention-spoilers.epub\">Télécharger ce contenu au format Epub</a></div>    <p><a href=\"https://linuxfr.org/users/madhatter/journaux/parlons-un-peu-de-star-wars-viii-les-derniers-jedi-attention-spoilers#comments\">Lire les commentaires</a></p>\n",
			"added": 1513509713,
			"topic_id": 1513509713,
			"doc": "journal"
		},
		{
			"title": "Adieu, firefox ?",
			"pubDate": "2017-12-16 14:23:51",
			"link": "https://linuxfr.org/users/totof2000/journaux/adieu-firefox",
			"author": "totof2000",
			"body": "\n<p>Suite à une mise à jour de Firefox, je viens de découvrir que Google, ainsi que DuckDuckGo ne sont pas sûrs :</p>\n\n<p>The website tried to negotiate an inadequate level of security.</p>\n\n<p><a href=\"http://www.google.fr/\">www.google.fr</a> uses security technology that is outdated and vulnerable to attack. An attacker could easily reveal information which you thought to be safe. The website administrator will need to fix the server first before you can visit the site.</p>\n\n<p>Error code: NS_ERROR_NET_INADEQUATE_SECURITY</p>\n\n<p>Suis-je le seul à avoir ce genre de message ?</p>\n\n<p>Je pose la question avant de prendre une décision définitive : je suis sur FreeBSD ( firefox 56.0.2 (64-bit)), et il est possible que ça vienne des options de compilation de FreeBSD.</p>\n\n<p>Chromium quant à lui ne me fais pas ce genre de blague.</p>\n\n<p>Si c'est bien firefox qui me fait ça, je crois que je vais définitivement le laisser tomber. Entre ça et le fait que c'est devenu presque impossible d'ouvrir sereinement une connexion sur un wifi public, plus une accumulation d'autres trucs qui m'ont agacés dans les dernières versions, ce serait la goutte qui fait déborder le vase.</p>\n<div><a href=\"https://linuxfr.org/users/totof2000/journaux/adieu-firefox.epub\">Télécharger ce contenu au format Epub</a></div>    <p><a href=\"https://linuxfr.org/users/totof2000/journaux/adieu-firefox#comments\">Lire les commentaires</a></p>\n",
			"added": 1513509712,
			"topic_id": 1513509712,
			"doc": "journal"
		},
		{
			"title": "Un comparatif de banques en ligne sauvage apparaît !",
			"pubDate": "2017-12-15 21:20:48",
			"link": "https://linuxfr.org/users/spacefox/journaux/un-comparatif-de-banques-en-ligne-sauvage-apparait",
			"author": "SpaceFox",
			"body": "\n<p>Nextinpact aurait lu <a href=\"https://linuxfr.org/users/pamputt/journaux/la-banque-postale-bloque-l-achat-d-un-vpn\">les commentaires du journal sur la Banque Postal</a> ?</p>\n\n<p>Quoiqu'il en soit, ils ont publié <strong><a href=\"https://www.nextinpact.com/news/104388-nous-avons-compare-13-banques-en-ligne-laquelle-choisir.htm\">la première partie d'un dossier sur les différentes banques en ligne</a></strong>.</p>\n\n<p>À noter que c'est payant (pour l'instant, il me semble que leurs articles deviennent gratuits après environ un mois) et que d'après les commentaires de l'équipe, il y aura d'autres articles à venir sur le sujet.</p>\n\n<p>Quant au côté payant, le journal est sérieux et <a href=\"https://www.nextinpact.com/news/105761-open-data-par-defaut-next-inpact-traine-deux-ministeres-devant-conseil-detat.htm\">n'hésite pas à lancer des actions en justice pour faire avancer l'open-data</a>, en ce qui me concerne et puisque j'ai les moyens, je peux bien me permettre de les soutenir.</p>\n\n<hr>\n<p><em><a href=\"https://linuxfr.org/suivi/proposer-d-autres-licences-que-cc-by-sa\">Journal sous licence CC-BY 4.0</a></em></p>\n<div><a href=\"https://linuxfr.org/users/spacefox/journaux/un-comparatif-de-banques-en-ligne-sauvage-apparait.epub\">Télécharger ce contenu au format Epub</a></div>    <p><a href=\"https://linuxfr.org/users/spacefox/journaux/un-comparatif-de-banques-en-ligne-sauvage-apparait#comments\">Lire les commentaires</a></p>\n",
			"added": 1513509711,
			"topic_id": 1513509711,
			"doc": "journal"
		},
		{
			"title": "la neutralité du net bronsonisée",
			"pubDate": "2017-12-15 11:52:43",
			"link": "https://linuxfr.org/users/bassiste/journaux/la-neutralite-du-net-bronsonisee",
			"author": "Jean-Georges de La Blatte",
			"body": "\n<p>Donc <a href=\"http://www.numerama.com/politique/314881-le-regulateur-americain-acheve-la-neutralite-du-net.html\">la neutralité du net est morte aux USA</a> .<br>\nDans les faits, le Congrès peut toujours annuler la décision mais sa composition actuelle a peu de chances d'aller dans ce sens. <br>\nLe PDG d'Orange Stéphane Richard s'est déjà prononcé récemment contre la neutralité du net. Logique : les FAI auraient tout intérêt à facturer des accès à internet à la demande.<br>\nIl semblerait que des FAI alternatifs commencent à apparaître aux US. Et En France, que se passerait-il si a neutralité du Net venait à disparaître ?</p>\n<div><a href=\"https://linuxfr.org/users/bassiste/journaux/la-neutralite-du-net-bronsonisee.epub\">Télécharger ce contenu au format Epub</a></div>    <p><a href=\"https://linuxfr.org/users/bassiste/journaux/la-neutralite-du-net-bronsonisee#comments\">Lire les commentaires</a></p>\n",
			"added": 1513509710,
			"topic_id": 1513509710,
			"doc": "journal"
		},
		{
			"title": "Hutch, gestionnaire de mots de passe",
			"pubDate": "2017-12-15 01:22:46",
			"link": "https://linuxfr.org/users/superzen/journaux/hutch-gestionnaire-de-mots-de-passe",
			"author": "Babelouest",
			"body": "\n<p>Après avoir fini <a href=\"https://github.com/babelouest/glewlwyd\">Glewlwyd</a> et branché <a href=\"https://github.com/babelouest/angharad\">Angharad</a> dessus, il me fallait un autre projet pas trop gros pour utiliser l'authentification unique, parce que un seul service qui utilise ton authentification unique, c'est un peu trop overkill on va dire.</p>\n\n<p>Je ne voulais pas faire mon <a href=\"https://github.com/babelouest/taliesin\">serveur de streaming</a> tout de suite, parce que je savais que ca allait être long. Je voulais un projet moins gros, sur lequel je pouvais me faire la main coté serveur de ressource, mais utile, et puis j'avais envie d'essayer Angular2.</p>\n\n<p>Les services que j'utilise sur le net font que, comme beaucoup d'entre nous, j'ai une tétrachiée de mots de passes. Je me refuse à utiliser toujours le même, c'est dur à retenir ou alors ca le rend trop facile à deviner. Bref, c'est pas la joie.</p>\n\n<p>Il existe déjà des gestionnaires de mots de passes comme <a href=\"https://keepass.info/\">Keepass</a> ou des services Web qui proposent de faire ca dans les nuages comme <a href=\"https://1password.com/\">1password</a>, mais je n'avais pas vu de gesionnaire de mots de passes qui soit libre, dont on peut installer sa propre instance, disponible à distance, et si possible pas en Java ou NodeJS.<br>\nDe plus l'API <a href=\"https://developer.mozilla.org/fr/docs/Web/API/Web_Crypto_API\">Web Cryptography</a> est maintenant disponible dans la plupart des navigateurs modernes.</p>\n\n<p>C'était donc une bonne occasion de combiner tout ca pour faire mon gestionnaire de mot de passe qui ferait les choses suivantes:<br>\n- Encodage/Décodage uniquement coté client, le serveur ne stocke que des blobs chiffrés qu'il sera incapable de décoder<br>\n- Sous forme d'API Rest pour le serveur, et écrit en Angular2/TypeScript pour le client web<br>\n- Permet de stocker des données liées à plusieurs services différents: url, nom d'utilisateur, mot de passe, questions secrètes, fichiers (de clé privée par exemple), ou autres informations que tu jugeras utile pour le service<br>\n- Permet de copier le mot de passe ou autre info dans le presse-papier, sans que tu n'aies à le voir, en cliquant sur un bouton<br>\n- Permet de générer aléatoirement des mots de passe selon des critères que tu lui aura défini: caractères, chiffres, majuscule/minuscule, caractères spéciaux, etc.<br>\n- Permet de générer aléatoirement des réponses à des questions secrètes, pour éviter de deviner ces réponses par ingénierie sociale, la réponse aléatoire est composée de deux mots piochés dans un fichier de mots courant dans la langue que tu utilises dans l'application web<br>\n- Utilisable sur ordinateur, tablette, téléphone intelligent, parce que j'ai pas envie de faire 10000 clients différents (vive Bootstrap!)</p>\n\n<p>Je l'ai appelé Hutch, c'est un nom que j'ai trouvé qui permettait de nommer un coffre au moyen-âge, mais je me rappelle plus où j'ai vu ca. Puis si tu tapes \"Hutch\" dans Google images, tu vas voir des cages à lapin mais tant pis…</p>\n\n<p>On peut créer un ou plusieurs coffres qui contiendront des secrets. Chaque coffre a son propre mot de passe, et le mot de passe permet de débloquer tous les secrets du coffre. Comme ca tu peux avoir un coffre pour le boulot, un pour les trucs persos, un pour ton association, etc. Si tu te fais piquer le mot de passe d'un coffre, les autres ne sont pas impactés par les éventuelles fuites.</p>\n\n<p>Évidemment si tu perds un mot de passe de coffre, le serveur ne pourra rien pour toi, pas de mail pour réinitialiser son coffre ou quoi, que dalle, c'est perdu.<br>\nPour pallier ca, il y a plusieurs barrières de sécurité, mais qui peuvent ouvrir des brêches énormes:<br>\n- Exporter la clé principale de ton coffre, l'export peut être protégé par un mot de passe ou pas<br>\n- Exporter un secret ou tous les secrets d'un coffre dans un fichier, l'export peut être protégé par un mot de passe ou pas</p>\n\n<p>Enfin, pour que ce ne soit pas trop pénible à utiliser non plus, tu peux garder un coffre toujours ouvert sur une machine si tu le souhaites. Comme ca tu n'as pas à retaper ton mot de passe à chaque fois, mais faut faire ca sur une machine dont tu est sûr de chez sûr.</p>\n\n<p>Il est disponible sur GitHub à cette adresse: <a href=\"https://github.com/babelouest/hutch\">Hutch</a></p>\n\n<p>Il est en GPL V3 pour la partie serveur, écrite en C, et Affero GPL pour la partie client Web, écrite en Angular2.</p>\n\n<p>Épilogue, Angular2</p>\n\n<p>Avec le recul, Angular2 j'en suis revenu. C'est cool, moins fouilli que AngularJS, mais c'est pas non plus la panacée. Il se base sur TypeScript qui, malgré le fait que ce soit développé par Microsoft, est quand même assez chouette. Sauf que TypeScript souffre encore beaucoup d'être pas fini. En l'occurence, au moment où je programmais Hutch, Typescript n'intégrait pas l'API Web Crypto, ce qui fait que j'ai du faire des pirouettes pour que ca soit propre dans mon code…<br>\nPuis, entre le moment où j'ai commencé le projet, et le moment où je l'ai fini, Angular2 est devenu Angular3, puis 4. Maintenant, c'est <a href=\"https://angular.io/\">Angular.IO</a> tout court. En soi c'est pas grave, mais les plugins autour d'Angular, suivent mal la cadence, ou justement trop bien, et certains refusaient carrément de s'installer sur mon \"vieux\" Angular2…</p>\n<div><a href=\"https://linuxfr.org/users/superzen/journaux/hutch-gestionnaire-de-mots-de-passe.epub\">Télécharger ce contenu au format Epub</a></div>    <p><a href=\"https://linuxfr.org/users/superzen/journaux/hutch-gestionnaire-de-mots-de-passe#comments\">Lire les commentaires</a></p>\n",
			"added": 1513509709,
			"topic_id": 1513509709,
			"doc": "journal"
		},
		{
			"title": "Taliesin, serveur de streaming audio",
			"pubDate": "2017-12-15 01:20:38",
			"link": "https://linuxfr.org/users/superzen/journaux/taliesin-serveur-de-streaming-audio",
			"author": "Babelouest",
			"body": "\n<p>Dernier né de mon interface chaise-clavier, le besoin est de pouvoir écouter de n'importe où la musique que je stocke et classe amoureusement depuis longtemps. D'autant plus que je me refuse toujours à prendre des abonnements auprès des services payants comme Spotify ou [Google|Apple] Music. Également, je souhaite pouvoir déporter la lecture des flux audio sur des lecteurs externes comme VLC, ainsi que les différents Raspberry PI qui peuplent ma demeure et qui hébergent entre autres un service MPD.</p>\n\n<p>Depuis quelques années, je combinais l'utilisation de liquidsoap/icecast pour me faire une webradio de toute ma musique, et également subsonic pour écouter ma musique à la demande. Les deux ont rempli leur rôle avec plus ou moins de succès, mais avec le temps, j'ai eu envie d'avoir un système de webradio plus souple, et également de pouvoir jouer la musique que je veux dans chaque pièce de la maison.</p>\n\n<p>Voilà donc le fruit de mon labeur, un logiciel que j'ai appelé Taliesin, emprunté au nom d'un barde (entre autres choses) dans la mythologie celtique et la légende arthurienne.</p>\n\n<p>Il transcode en temps réel la musique qu'on lui demande de lire et balance tout ca dans un flux http au format qu'on lui aura demandé. Il se base sur <a href=\"https://libav.org/\">libav</a> pour la partie audio, le truc qu'on trouve sous ffmpeg notamment, ainsi que <a href=\"https://github.com/babelouest/ulfius\">Ulfius</a> dont j'avais <a href=\"https://linuxfr.org/users/superzen/journaux/ulfius-framework-pour-faire-des-api-web-en-c\">déjà parlé ici</a>, qui s'occupe de la partie serveur HTTP et <a href=\"https://github.com/babelouest/hoel/\">Hoel</a> qui s'occupe de l'accès à la base de données (MariaDB ou SQLite3).<br>\nIl ne s'occupe pas d'authentification parce qu'il préfère laisser ca à ceux qui savent le faire, et mange donc du token OAuth2 JWT qu'un <a href=\"https://github.com/babelouest/glewlwyd\">Glewlwyd</a> par exemple peut fournir pour s'assurer que l'utilisateur a bien le droit de lui parler. Il peut aussi fonctionner sans authentification si c'est vraiment ce que tu veux, mais gaffe.<br>\nSeuls les flux audio en tant que tels n'utilisent pas de token OAuth2 pour l'authentification. En effet, les divers lecteurs qui sont capables de lire des flux comme VLC, MPD ou même la balise  du HTML5 ne savent pas gérer des tokens dans le header HTTP à ma connaissance. Pour pallier ca, un flux audio possède une url générée aléatoirement sur une chaîne de 32 caractères alphanumériques, genre <code>http://localhost:8576/api/stream/abcdefghijkLMNOPQRSTUV0123456789/</code>. Je me dis qu'avec environ 2*10<sup>93</sup> urls à tester, ca va prendre du temps à une personne malintentionnée pour en deviner…</p>\n\n<p>Il sait lire tous les formats que connait libav, et il peut transcoder en mp3, ogg/vorbis ou flac, dans divers bitrates ou fréquences.</p>\n\n<p>Il propose deux types de flux audio:<br>\n- La webradio: Tu lui demandes de te lire un ensemble de fichiers, et il t'envoie ca dans un flux qui a une url unique et en continu, comme une webradio, ca gère plusieurs utilisateurs simultanés et ca envoie même le titre via les metadata ICY, mais pour des raisons techniques, ca ne peut t'envoyer que du mp3. Par contre, à la différence d'un Icecast, il se met en pause s'il n'y a aucun client qui écoute le flux.<br>\n- le jukebox: tu lui demandes de te lire un ensemble de fichiers, mais c'est toi qui dit ce que tu veux lire et quand, et donc chaque fichier a une url unique, de la forme <code>http://localhost:8576/api/stream/abcdefghijkLMNOPQRSTUV0123456789/?index=42</code>.</p>\n\n<p>Taliesin est capable de lire les metadonnées (artiste, album, etc.) dans les fichiers, sauf les ogg, pour une raison qui m'échappe encore. Il sait aussi lire et afficher les images des fichiers audio.</p>\n\n<p>Taliesin est multi-utilisateurs avec un niveau administrateur et un niveau utilisateur, l'idée derrière ca est de permettre de partager des bibliothèques de musique entre les utilisateurs mais en évitant qu'une mauvaise manipulation d'un utlisateur supprime des bibliothèques ou des playlists partagées par exemple.</p>\n\n<p>Il n'y a pas de contrôle de ressources utilisées, tous les utlisateurs peuvent lire autant de flux qu'ils veulent en même temps, créer autant de playlists qu'ils souhaitent, etc. Je pars du postulat de base que les utilisateurs sont amicaux avec le service et ne lui veulent pas du mal. Ca tourne plutôt bien sur une petite machine, j'ai fait quelques tests avec un Raspberry PI Zero et ca gérait ca assez bien ma foi. Il roulait avec une clé Wifi et les fichiers audio étaient accédés via NFS sur mon NAS dans le même réseau local, et je n'ai pas observé de problèmes pour un utilisateur unique.</p>\n\n<p>L'API est écrite en C, sous licence GPL V3, le client web est en ReactJS, sous licence MIT.</p>\n\n<p>Plus tard, Taliesin pourra peut-être aussi lire des videos, et même envoyer un flux sur un icecast, un vrai, avec lequel on pourra choisir son format de sortie pis toute. Pour l'instant je me concentre sur finir la version 1.0, il reste des bugs dans l'interface et dans l'API avant que ce soit fini.</p>\n\n<p>L'URL du projet sur GitHub: <a href=\"https://github.com/babelouest/taliesin\">https://github.com/babelouest/taliesin</a></p>\n<div><a href=\"https://linuxfr.org/users/superzen/journaux/taliesin-serveur-de-streaming-audio.epub\">Télécharger ce contenu au format Epub</a></div>    <p><a href=\"https://linuxfr.org/users/superzen/journaux/taliesin-serveur-de-streaming-audio#comments\">Lire les commentaires</a></p>\n",
			"added": 1513509708,
			"topic_id": 1513509708,
			"doc": "journal"
		},
		{
			"title": "Glewlwyd, Serveur d'authentification OAuth2",
			"pubDate": "2017-12-15 01:17:42",
			"link": "https://linuxfr.org/users/superzen/journaux/glewlwyd-serveur-d-authentification-oauth2",
			"author": "Babelouest",
			"body": "\n<h2 class=\"sommaire\">Sommaire</h2>\n<ul class=\"toc\">\n<li><ul>\n<li><a href=\"https://linuxfr.org/journaux#cest-quoi-oauth2\">C'est quoi OAuth2 ?</a></li>\n<li><a href=\"https://linuxfr.org/journaux#valider-un-token-oauth2\">Valider un token OAuth2</a></li>\n<li><a href=\"https://linuxfr.org/journaux#authentifier-un-utilisateur\">Authentifier un utilisateur</a></li>\n<li><a href=\"https://linuxfr.org/journaux#oui-mais-encore\">Oui, mais encore?</a></li>\n<li><a href=\"https://linuxfr.org/journaux#je-voudrais-bien-lessayer\">Je voudrais bien l'essayer</a></li>\n<li><a href=\"https://linuxfr.org/journaux#pourquoi-tas-choisi-dimpl%C3%A9menter-un-serveur-oauth2-plut%C3%B4t-que-xyz\">Pourquoi t'as choisi d'implémenter un serveur OAuth2 plutôt que XYZ?</a></li>\n<li><a href=\"https://linuxfr.org/journaux#tu-peux-rajouter-la-fonctionnalit%C3%A9-abc\">Tu peux rajouter la fonctionnalité ABC?</a></li>\n</ul></li>\n</ul>\n<p>Une fois que mon <a href=\"https://linuxfr.org/news/ma-domotique-avec-le-systeme-angharad-troisieme-generation\">serveur domotique</a> roulait tout seul, je cherchais comment occuper mon temps libre pendant les siestes de mon héritière.<br>\nJ'avais une TODO List assez longue de services web que je voulais faire (elle l'est encore, en fait, c'est comme <a href=\"https://fr.wikipedia.org/wiki/Sysiphe\" title=\"Définition Wikipédia\">Sysiphe</a>, ca ne se vide jamais…), un des problèmes que je voyais arriver c'est l'authentification.<br>\nAngharad gérait l'authentification lui-même avec user/mot de passe. Il se connectait soit à la base de données, soit à un serveur LDAP pour authentifier. C'est cool, mais je me disais que si je devais porter ce module d'authentification dans les prochains services, il fallait aussi que je porte les améliorations et corrections de bugs à chaque fois également, ca allait rendre la tâche pas drôle assez vite…</p>\n\n<p>J'ai donc regardé ce qui se fait du coté des technos <a href=\"https://fr.wikipedia.org/wiki/Authentification_unique\">SSO</a> et de délégation d'authentification, et j'ai choisi OAuth2.</p>\n\n<p>J'ai pas trouvé de serveur OAuth2 déjà tout fait et facile à installer. Il y a beaucoup de libraries ou de petits programmes disponibles selon le site <a href=\"https://oauth.net/code/\">OAuth.net</a>, mais rien qui me satisfasse. Donc je me suis lancé dans le projet d'en faire un. En langage C parce que j'aime ca. Je l'ai appelé Glewlwyd, du nom du chevalier de la table ronde qui était également le portier en chef de Camelot, celui qui laisse entrer ou non les gens.</p>\n<h3>C'est quoi OAuth2 ?</h3>\n\n<p>C'est un <a href=\"https://tools.ietf.org/html/rfc6749\">workflow de délégation d'authentification</a> pour permettre à des serveurs de ressources de s'assurer qu'un utilisateur a bien le droit de se connecter à son service, sans qu'il ait à demander à l'utilisateur de s'authentifier chez lui. C'est pas mal lié aux us et coutumes du Web mais c'est assez souple pour pouvoir être utlisé dans d'autres cas de figure qu'un navigateur.</p>\n\n<p>OAuth2 considère 4 rôles dans un flux d'authentification:<br>\n- Le propriétaire de la ressource: C'est l'utlisateur proprement dit qui veut accéder à ses ressources (photo, image, mails, etc.)<br>\n- Le serveur de ressource: C'est le service qui fournit lesdites ressources à son propriétaire s'il est bien sûr que c'est lui<br>\n- Le client: C'est l'application qui est utilisée par le propriétaire de la ressource pour accéder aux ressources, genre une application Web<br>\n- Le serveur d'autorisation: C'est le serveur OAuth2 proprement dit qui va vérifier l'identité de la personne qui veut se connecter ainsi que les droits qu'il réclame éventuellement</p>\n\n<p>Dans le cas d'utilisation principal, l'utilisateur va exécuter le programme client, le programme client va le rediriger vers le serveur OAuth2, puis, si l'utilisateur est autorisé, il sera redirigé sur le client avec un <code>access token</code> ou une clé qui permettra d'obtenir des <code>access token</code> que le client utilisera pour authentifier chaque appel aux APIs au serveur de ressource. Lorsqu'on se connecte aux gros services type Google ou Facebook, on a un workflow similaire. Un <code>access token</code> a volontairement une durée de vie courte, moi j'ai mis une heure, c'est pour éviter que si un token fuite, l'usurpation d'identité puisse se faire sur une longue durée. Mais il est possible d'obtenir un nouveau <code>access token</code> à chaque fois qu'on le souhaite, et ce de manière transparente pour l'utilisateur, via un <code>refresh token</code> obtenu lui aussi auprès du serveur OAuth2 et qui a lui une durée plus longue.</p>\n\n<p>Après, OAuth2 a plus de subtilités que ca, mais mon besoin principal est avant tout dans ce workflow.</p>\n<h3>Valider un token OAuth2</h3>\n\n<p>Comme toute bonne RFC, elle décrit une chose de amnière le plus complète possible, mais elle ne se permet pas de présupposer quelque chose qui n'est pas dans son scope. En l'occurence, la RFC OAuth2 te dit comment doit se passer la phase d'authentification ainsi que le format des données envoyées, mais comment fournir le token au serveur de ressource, elle s'en cogne. Heureusement la RFC suivante, la <a href=\"https://tools.ietf.org/html/rfc6750\">6750</a> définit un moyen de fournir le token au serveur de ressource. En gros, tu peux le passer dans l'url, le body ou un header. C'est souvent cette dernière méthode qui est employée.</p>\n\n<p>D'accord mais bon, comment le serveur de ressource il sait quele token est bon? Ben là aussi, la RFC Oauth2 dit explicitement que c'est pas son problème. Plusieurs solutions sont possibles, comme fournir une API supplémentaire sur le serveur OAuth2 qui permet au serveur de ressource de s'assurer qu'un token est valide, ou avoir des tokens signés qui permettraient de les valider juste en vérifiant la signature. C'est cette deuxième méthode que j'ai choisie pour valider un token, en utilisant des <a href=\"https://jwt.io/\">JWT</a>, d'autant que la librairie <a href=\"https://github.com/benmcollins/libjwt\">libjwt</a> fait ca super bien.</p>\n<h3>Authentifier un utilisateur</h3>\n\n<p>Pour authentifier un utilisateur, on lui demandera son nom et mot de passe, ainsi que la liste des scopes qu'il souhaite avoir. Un scope est un domaine d'autorisation que l'utlisateur souhaite avoir. Cela permet d'avoir une gestion plus fine des différents droits de l'utilisateur. Par exemple, les scopes qui existent sont: <code>mail</code>, <code>photo</code>, <code>file</code> et <code>admin</code>, et l'utilisateur <code>user1</code> a le droit d'avoir accès aux scopes <code>mail</code> et <code>photo</code>. Si le client demande l'accès à trous les scopes pour <code>user1</code>, le serveur OAuth2 lui répondra OK, mais juste pour <code>mail</code> et <code>photo</code>, le reste il a pas accès. Dans Glewlwyd, la liste des scopes accessibles sont également écrits dans le token, donc le serveur de ressource peut (et doit) aussi valider que le token qu'on lui fournit possède bien les droits pour le ou les scopes qu'il réclame.</p>\n<h3>Oui, mais encore?</h3>\n\n<p>L'utilisateur peut modifier son mot de passe, et peut se faire envoyer un e-mail pour réinitialiser le mot de passe s'il l'a oublié.</p>\n\n<p>Glewlwyd permet donc d'authentifier des utilisateurs qui proviennent soit de la base de données, soit d'un serveur LDAP distant.<br>\nPour fonctionner il a besoin d'une base de données (MariaDB ou SQlite3) et c'est à peu près tout.</p>\n<h3>Je voudrais bien l'essayer</h3>\n\n<p>L'url du projet sur GitHub est là: <a href=\"https://github.com/babelouest/glewlwyd\">Glewlwyd</a>, mais des gens sympas m'ont aidé, et il y a maintenant un <a href=\"https://github.com/rafaelhdr/glewlwyd-oauth2-server\">package Docker</a>, et il est aussi disponible sur <a href=\"https://packages.debian.org/testing/source/glewlwyd\">Debian testing</a> ou encore <a href=\"https://packages.ubuntu.com/source/artful/glewlwyd\">Ubuntu</a> maintenant, et j'en suis très content!</p>\n\n<p>C'est du GPL V3 pour la partie serveur, écrite en C, et du MIT pour la partie client web, écrite en React JS.</p>\n<h3>Pourquoi t'as choisi d'implémenter un serveur OAuth2 plutôt que XYZ?</h3>\n\n<p>Je ne suis pas expert dans ce domaine, mais je voulais m'y mettre tout seul et évidemment de façon libre. J'ai regardé quels étaient les défauts et les reproches qu'on peut faire à OAuth2 et j'ai pesé le pour et le contre. Au final, c'était le protocole le plus à ma portée et le plus fiable et sécurisé que j'ai pu trouver. Je sais que d'autres protocole existent et sont mille fois mieux sur plein d'aspects et pour plein de raisons, mais soit ca utilisait des mots que je comprenais pas, soit ca disait que <a href=\"https://github.com/hueniverse/hawk#where-is-the-protocol-specification\">y'a pas de specs</a>.</p>\n<h3>Tu peux rajouter la fonctionnalité ABC?</h3>\n\n<p>J'ai déjà eu plein de retours, proportionnelement au fait que c'est un projet personnel j'entends, des rapports de bugs et des pull request, et aussi plein de conversations super intéressantes avec des gens.<br>\nMon avis est que ca vaut la peine de rajouter des fonctionnalités comme <a href=\"https://en.wikipedia.org/wiki/Time-based_One-time_Password_Algorithm\">TOTP</a>, différents backends pour authentifier les utilisateurs, voire gérer des protocoles autres que OAuth2.</p>\n\n<p>Mais dans ce cas je partirai sur une architecture modulable, car pour l'instant c'est monolithique, et plus on rajoute de fonctionnalités comme ca, plus on risque des effets de bord.<br>\nJ'ai gouté aux libraries qui se <a href=\"https://github.com/babelouest/carleon/tree/master/service-modules\">chargent lors de l'exécution</a> et j'ai trouvé ca très bon, donc j'en referai. Ca sera pour la prochaine version!</p>\n<div><a href=\"https://linuxfr.org/users/superzen/journaux/glewlwyd-serveur-d-authentification-oauth2.epub\">Télécharger ce contenu au format Epub</a></div>    <p><a href=\"https://linuxfr.org/users/superzen/journaux/glewlwyd-serveur-d-authentification-oauth2#comments\">Lire les commentaires</a></p>\n",
			"added": 1513509707,
			"topic_id": 1513509707,
			"doc": "journal"
		},
		{
			"title": "Petites fuites",
			"pubDate": "2017-12-14 21:53:32",
			"link": "https://linuxfr.org/users/scoubidou--2/journaux/petites-fuites",
			"author": "NumOpen",
			"body": "\n<p>En cette fin d'année, pensez à changer vos mots de passe si vous avez des comptes chez :<br>\nLDLC : <a href=\"https://www.zataz.com/fuite-de-donnees-clients-ldlc/\">https://www.zataz.com/fuite-de-donnees-clients-ldlc/</a><br>\nCDISCOUNT (dans le doute) : <a href=\"https://www.francebleu.fr/infos/faits-divers-justice/des-dromois-soupconnes-d-avoir-pirate-des-centaines-de-comptes-clients-de-cdiscount-1513266750\">https://www.francebleu.fr/infos/faits-divers-justice/des-dromois-soupconnes-d-avoir-pirate-des-centaines-de-comptes-clients-de-cdiscount-1513266750</a></p>\n<div><a href=\"https://linuxfr.org/users/scoubidou--2/journaux/petites-fuites.epub\">Télécharger ce contenu au format Epub</a></div>    <p><a href=\"https://linuxfr.org/users/scoubidou--2/journaux/petites-fuites#comments\">Lire les commentaires</a></p>\n",
			"added": 1513509706,
			"topic_id": 1513509706,
			"doc": "journal"
		},
		{
			"title": "Debian sur mon serveur plus jamais, de chez jamais.",
			"pubDate": "2017-12-14 10:10:57",
			"link": "https://linuxfr.org/users/kwiknclean/journaux/debian-sur-mon-serveur-plus-jamais-de-chez-jamais",
			"author": "Kwiknclean",
			"body": "\n<h2 class=\"sommaire\">Sommaire</h2>\n<ul class=\"toc\">\n<li><ul>\n<li><a href=\"https://linuxfr.org/journaux#la-d%C3%A9couverte-\">La découverte :</a></li>\n<li><a href=\"https://linuxfr.org/journaux#dat-documentation-\">Dat Documentation :</a></li>\n<li><a href=\"https://linuxfr.org/journaux#la-base-nest-pas-m%C3%A9lang%C3%A9e-avec-les-paquets\">La base n'est pas mélangée avec les paquets.</a></li>\n<li><a href=\"https://linuxfr.org/journaux#packet-filter-encore-un-logiciel-qui-fait-passer-iptable-pour-un-firewall-windows\">Packet-Filter, encore un logiciel qui fait passer IPtable pour un firewall Windows.</a></li>\n<li><a href=\"https://linuxfr.org/journaux#la-configuration\">La configuration.</a></li>\n</ul></li>\n</ul>\n<p>Bonjour journal,</p>\n\n<p>J'aime bien lâcher des pavés sur Internet.<br>\nDéjà ça me sert d'exutoire pour extérioriser ma frustration, ensuite ça permet également d'échanger et d'avoir vos avis qui je dois le dire sont loin d'être toujours inintéressants.</p>\n\n<p>Depuis que j'ai découvert FreeBSD il y a maintenant 4 ou 5 ans, je ne me sers plus que ça en environnement serveur à la maison et je ne comprends même pas qu'on puisse installer des trucs de bricoleurs comme Debian, qui est tout sauf un truc à mettre en entreprise</p>\n\n<p>De façon subjective je vais tâcher d'expliquer pourquoi je trouve que FreeBSD c'est mieux que Debian lorsqu'on veut poser une machine pour des années (ou d'autres d'ailleurs), distribution de branleurs à réserver aux Facultés et autres associations pour bidouilleurs et certainement pas des informaticiens qui aiment les choses qui tournent longtemps. (J'écris comme je l'entends ici c'est mon journal).</p>\n\n<p>Je ne m'attarderais pas sur les détails de l'aspect licencing, GNU/BSD y a déjà eu moult journaux de spécialistes à ce sujet, et ce n'est pas mon propos.</p>\n\n<p>Honnêtement GNU/Linux je trouve que c'est le bordel d'une version à l'autre y a rien qui est pareil. </p>\n\n<p>Je dis Debian mais RedHat sérieusement c'est pas mieux.</p>\n\n<p>La gestion du multipathing pour utiliser un exemple d'une fonctionnalité \"pro\", d'une version à l'autre c'est un sketch tout change faut tout réimplémenter la grosse blague. Je ne parle pas de l'arborescence du système de paquets…</p>\n<h3>La découverte :</h3>\n\n<p>C'était il y a 4 ou 5 ans. Comme beaucoup j'utilisais fièrement une distribution GNU/Debian, une nouvelle stable veinaient de sortir, j'étais plein de motivations, je faisais mumuse à l'époque avec OpenVZ que je trouvais sympathique, j'avais bien rodé mon système de backup/resto (très important et très long à valider), comme quelqu'un qui aime la stabilité dans le temps et les choses bien huilées, j'aime bien poser des choses qui sont conçus pour durées des années sans devoir y faire des opérations trop lourdes. Et clairement j'ai pas l'impression que ça soit la philosophie des distributions GNU.</p>\n\n<p>Debian 8.0 vient d'arriver là niveau \"virtualisation\" (Note les guillemets je sais que LxC/KVM/OpenVz tout ça c'est pas du tout la même chose hein merci) c'est le bordel. LxC est encore version 0.x, Docker n'existe pas encore je crois,  se pointe et je n'ai plus l'explication technique détaillée mais en gros fallait downgrader son noyau &lt; 3.0 sur les nouvelles Debian pour pouvoir continuer à Utiliser OpenVz (Compatibilité Cgroups de mémoire). <br>\nPardooooooooon, tu te fous de ma gueule ? Donwgrader un noyau t'en as d'autres des comme ça ? C'est quoi cette bidouille ? En gros j'utilise quoi moi pour être tranquille pour 10 ans ?!!</p>\n\n<p>Bon on essaie Ubuntu Serveur pour rigoler LxC a l'air plus mature chez eux, je teste un peu … bon ça a l'air prometteur, hop je fais une p'tite mise à jour de mon OS et PAN : </p>\n\n<p>Allez hop au revoir toute cette merde !</p>\n<h3>Dat Documentation :</h3>\n\n<p>On commence par poser là l'argument qui a lui seul devrait vous convaincre que y a deux mondes.<br>\nLa documentation EST béton, d'entrée de jeu ça rassure, et moi j'aime les choses carrés fignolées et surtout documentées !</p>\n\n<p>Là on ne cherche pas sur des wordpress de blogueurs douteux, là on va ici : <br><a href=\"https://www.freebsd.org/doc/fr/books/handbook/\">https://www.freebsd.org/doc/fr/books/handbook/</a>  et ça couvre 90% de nos questions, pour le reste on s’inscrit sur le forum FreeBSD.</p>\n<h3>La base n'est pas mélangée avec les paquets.</h3>\n\n<p>Tu vois comment on met à jours sous Debian apt-get install et ça te met tout à jour logiciels tiers et noyaux + base système, quel truc de bourrin.</p>\n\n<p>Sous FreeBSD, ce sont deux choses différents.</p>\n\n<p>Le système de paquets pkg ne met à jour QUE les logiciels et ne touche pas à la base et au noyau, pas besoin de reboot ensuite (de toutes façons toutes tes applications tournent en Jails).</p>\n\n<p>Pour mettre à jour la base c'est une autre commande bien distincte. <br>\nfreebsd-update fetch<br>\nfreebsd-update install</p>\n\n<p>Un problème après la mise à jour système ? <br>\nfreebsd-update rollback , mon ami.</p>\n\n<p>Pour rassurer ceux qui j'imagine que les repositories FreeBSD sont un comptoir marchand Soviétique, je n'ai jamais été obligé d'installer quoique ce soit par les sources, j'ai toujours tout trouvé dans les packets, et souvent bien plus à jour que sous Debian (CentOs et Red Hat j'en parle même pas p'têt d'ici 2035 on aura PHP 7)</p>\n<h3>Packet-Filter, encore un logiciel qui fait passer IPtable pour un firewall Windows.</h3>\n\n<p>Quand t'as commencé à toucher à Packet Filter tu te demandes comment IPtable encore être autant plébiscité … <br>\nObligé de mettre des Fails2Ban et autres trucs de rigolos pour empêcher le brut Force SSH, obligé d'aller lire des logs quelle blague … Installé un module supplémentaire pour blacklister des plages d'IP … mais c'est quoi toutes ces verrues, des rustines partout … ça devient tellement fatiguant ..</p>\n\n<p>Moi je rajoute quelque chose comme ça : </p>\n\n<pre><code># Block SSH bruteforce\npass in on $ext_if proto tcp from !&lt;whitelist&gt; to $ext_if port 22 \\\n        flags S/SA keep state \\\n        (max-src-conn-rate 3/60, \\\n         overload &lt;blacklist&gt; flush global)\n</code></pre>\n\n<p>Et ça suffit largement, pas besoin de bidouilles partout, Note qu'ici nous seulement ça empêche le brut force (si plus 3 tentatives dans les 30 secondes), et en plus ça ne passe que si de toutes façons l'IP source fait partie d'une table whitelist, et ça remplit une autre table Blacklist lorsque l'IP déclenche la règle.</p>\n\n<p>Non laisse tomber IPtable sait pas faire ça.</p>\n<h3>La configuration.</h3>\n\n<p>Sous FreeBSD y a globalement un fichier à connaitre il s'agit de <strong>/etc/rc.conf</strong>  fin de discussion.</p>\n\n<p>Tu veux démarrer un service en auto, activer une fonctionnalité noyau, démarrer tes Jails au boot, ajouter ssh au boot, configurer ton réseau, ajouter des interfaces réseaux virtuelles ?</p>\n\n<pre><code>vi /etc/rc.conf\nifconfig_lcn0_alias0=\"192.168.1.5 netmask 255.255.255.255\" \nsshd_enable=\"YES\"\nhostname=\"MaMachine\"\npf_enable=\"YES\"\njail_enable=\"YES\"\n</code></pre>\n\n<p>Et ce depuis FreeBSD hum … le début non ?</p>\n\n<p>Comment on fait sous Debian ou Red Hat déjà ? <br>\nHa ouiiiiiiiii ça dépend de ta version évidemment .. un coup c'est avec sysv-rc-conf , l'autre c'est avec update-rc.d quand c'est pas /etc/rc.conf … ha merde j'suis sous RedHat c'est avec chkconfig </p>\n\n<p>Non mais t'appelle ça du boulot toi ? T'es sérieux là ?</p>\n<div><a href=\"https://linuxfr.org/users/kwiknclean/journaux/debian-sur-mon-serveur-plus-jamais-de-chez-jamais.epub\">Télécharger ce contenu au format Epub</a></div>    <p><a href=\"https://linuxfr.org/users/kwiknclean/journaux/debian-sur-mon-serveur-plus-jamais-de-chez-jamais#comments\">Lire les commentaires</a></p>\n",
			"added": 1513509705,
			"topic_id": 1513509705,
			"doc": "journal"
		},
		{
			"title": "Le LUKS, version 2",
			"pubDate": "2017-12-14 08:46:06",
			"link": "https://linuxfr.org/users/glandos/journaux/le-luks-version-2",
			"author": "Glandos",
			"body": "\n<p>Bon alors, les crypto-nerds, vous êtes plus flemmard que moi ?</p>\n<h4><a href=\"http://www.saout.de/pipermail/dm-crypt/2017-December/005771.html\">Cryptsetup 2 est sorti</a></h4>\n\n<p>Euh, bon, je met vite fait ce que j'ai vu :</p>\n\n<ul>\n<li>Nouveau format LUKS2, que l'on peut (la plupart du temps) mettre à jour depuis LUKS1</li>\n<li>LUKS1 sera supporté pour toujours</li>\n<li>LUKS2 sait faire de l'intégrité. Attention, c'est encore expérimental</li>\n<li>Support de chiffrement de mot passe plus résistant à la force brute (genre coûteux en mémoire) avec PBKDF et Argon2</li>\n<li>Options de montage persistantes dans les en-têtes. Comme tune2fs. Je crois que ça va être bien.</li>\n<li>Il est possible (si j'ai bien compris), de dire à cryptsetup de stocker un jeton pour dire de trouver le mot de passe tout seul dans un gestionnaire de clés. C'est pas clair pour moi non plus, parce que j'ai lu en diagonale.</li>\n</ul>\n<h5>Bonus</h5>\n\n<ul>\n<li>Y a du JSON dedans. C'est très hype (mais surtout extensible)</li>\n</ul>\n<p>Voilà, c'est très résumé. Parce que je suis tellement flemmard que je dois le répéter deux fois.</p>\n<div><a href=\"https://linuxfr.org/users/glandos/journaux/le-luks-version-2.epub\">Télécharger ce contenu au format Epub</a></div>    <p><a href=\"https://linuxfr.org/users/glandos/journaux/le-luks-version-2#comments\">Lire les commentaires</a></p>\n",
			"added": 1513509704,
			"topic_id": 1513509704,
			"doc": "journal"
		},
		{
			"title": "Bookmark : on parte le la neutralité du net sur Culture",
			"pubDate": "2017-12-14 08:03:03",
			"link": "https://linuxfr.org/users/purplepsycho/journaux/bookmark-on-parte-le-la-neutralite-du-net-sur-culture",
			"author": "purplepsycho",
			"body": "\n<p>Petit journal bookmark.</p>\n\n<p>En attendant <a href=\"https://www.laquadrature.net/fr/fcc_fin_net_neut\">la fin de la neutralité du net, peut être pour aujourd'hui</a>, Sébastien Soriano (ARCEP) et Benjamin Bayart (<a href=\"https://www.fdn.fr/\">FDN</a>/<a href=\"https://www.laquadrature.net/fr\">Quadrature</a>) ont été invités ce matin sur Culture.</p>\n\n<p>On peut les écouter:</p>\n\n<p><a href=\"https://www.franceculture.fr/emissions/les-matins/neutralite-du-net-hegemonie-des-gafa-la-democratie-prise-dans-la-toile-restituer-le-patrimoine\">ici (page de l'émission)</a></p>\n\n<p><a href=\"http://media.radiofrance-podcast.net/podcast09/13983-14.12.2017-ITEMA_21524121-2.mp3\">première partie (mp3)</a> </p>\n\n<p><a href=\"http://media.radiofrance-podcast.net/podcast09/13983-14.12.2017-ITEMA_21524121-3.mp3\">seconde partie (mp3)</a></p>\n\n<p>J'aime particulièrement l'image des villes <code>orange</code> et <code>facebook</code> qu'il faut connecter, c'est simple et ça parle à tout le monde.</p>\n\n<p>On entend aussi parler de comportement \"mafieux\", c'est la part des opérateurs, et je crois que c'est la première fois que j'entends la problème posé dans ce sens là…</p>\n<div><a href=\"https://linuxfr.org/users/purplepsycho/journaux/bookmark-on-parte-le-la-neutralite-du-net-sur-culture.epub\">Télécharger ce contenu au format Epub</a></div>    <p><a href=\"https://linuxfr.org/users/purplepsycho/journaux/bookmark-on-parte-le-la-neutralite-du-net-sur-culture#comments\">Lire les commentaires</a></p>\n",
			"added": 1513509703,
			"topic_id": 1513509703,
			"doc": "journal"
		},
		{
			"title": "Firefox : Looking Glass",
			"pubDate": "2017-12-14 02:36:07",
			"link": "https://linuxfr.org/users/faya/journaux/firefox-looking-glass",
			"author": "Faya",
			"body": "\n<p>Ce soir j'ai voulu rajouter l'addon <a href=\"https://addons.mozilla.org/en-US/firefox/addon/vim-vixen/?src=userprofile\">vim-vixen</a> sur mon Firefox et je découvre une extension que je n'ai jamais installée : \"Looking Glass\". Qu'est-ce !? La description n'aide pas :</p>\n\n<blockquote>\n<p>By PUG Experience Group<br>\nMY REALITY IS JUST DIFFERENT THAN YOURS.</p>\n</blockquote>\n\n<p>WTF!? Il y a une extension dont j'ignore totalement l'objectif qui s'est installée toute seule dans mon navigateur. Gardons notre calme, Google est mon <s>ami</s> moteur de recherche, voyons si qqun a rencontré le même soucis. La seule mention qui colle est sur Reddit : <a href=\"https://www.reddit.com/r/firefox/comments/7jh9rv/what_is_looking_glass/\">https://www.reddit.com/r/firefox/comments/7jh9rv/what_is_looking_glass/</a><br>\nL'OP est exactement dans la même situation que moi mais les commentaires pointent vers une manip de Mozilla :</p>\n\n<blockquote>\n<p>It's apparently a new <a href=\"https://wiki.mozilla.org/Firefox/Shield/Shield_Studies\">shield study</a> (<a href=\"mailto:pug.experience@shield.mozilla.org\">pug.experience@shield.mozilla.org</a>). Seems to just make some page modifications and send an extra header to partner websites if a particular pref is true (it was false for me).</p>\n</blockquote>\n\n<p>On retrouve également une référence sur <a href=\"https://github.com/gregglind/addon-wr/blob/master/TESTPLAN.md#tests\">github</a> et la clé mentionnée est bien présente dans mon about:config : <em>extensions.pug.lookingglass</em> </p>\n\n<p>Maintenant <a href=\"https://twitter.com/search?q=looking%20glass%20firefox\">Twitter</a> est en mode complot et tout le monde se pose les même questions :<br><img src=\"https://img.linuxfr.org/img/68747470733a2f2f692e696d6775722e636f6d2f506856346379612e706e67/PhV4cya.png\" alt=\"Twitter Looking Glass\" title=\"Source : https://i.imgur.com/PhV4cya.png\"></p>\n\n<p>Mais finalement la réponse se trouve dans le paramètres \"Allow Firefox to install and run studies\" et sur la page \"about:studies\" :</p>\n\n<blockquote>\n<p>What's this? Firefox may install and run studies from time to time.</p>\n</blockquote>\n\n<p>Après le succès du lancement de Quantum, ils devraient faire gaffe à ce genre de détails. Choisir une description plus claire et moins \"bizarre\" par exemple, ça éviterait les théories complotistes. Surtout que ce paramètre est activé par défaut donc les utilisateurs peuvent ne pas être au courant. Sur Reddit certains ont carrément préféré désinstaller FF…</p>\n<div><a href=\"https://linuxfr.org/users/faya/journaux/firefox-looking-glass.epub\">Télécharger ce contenu au format Epub</a></div>    <p><a href=\"https://linuxfr.org/users/faya/journaux/firefox-looking-glass#comments\">Lire les commentaires</a></p>\n",
			"added": 1513509702,
			"topic_id": 1513509702,
			"doc": "journal"
		},
		{
			"title": "[pub] trombilinux : un script python pour créer des trombinoscopes",
			"pubDate": "2017-12-13 21:48:42",
			"link": "https://linuxfr.org/users/yvanm/journaux/pub-trombilinux-un-script-python-pour-creer-des-trombinoscopes",
			"author": "YvanM",
			"body": "\n<p>Bonjour à tous,</p>\n\n<p>Un petit mot pour annoncer <a href=\"https://framagit.org/Yvan-Masson/trombilinux\">la publication de trombilinux</a>, un petit script python qui permet de créer des trombinoscopes, au cas où ça puisse être utile à quelqu'un.</p>\n<h2>Pourquoi ?</h2>\n\n<ul>\n<li>parce que je n'ai trouvé aucun logiciel sous Linux permettant de faire ce genre de document à peu prêt automatiquement (mais comme cela a été dit dans un autre journal, j'aurais certainement du vous demander avant de commencer à coder)</li>\n<li>parce que je me suis dit que c'était dans mes capacités (très restreintes) de programmation, et que c'était intéressant de pratiquer Python</li>\n</ul>\n<h2>Pourquoi ce nom ?</h2>\n\n<p>Parce que je n'avais vraiment aucune idée (n'hésitez pas, je suis preneur :-)).</p>\n<h2>Un exemple ?</h2>\n\n<p>Non désolé, il me faudrait pour cela des photos de gens que je puisse publier mais je n'ai pas le temps d'en chercher.</p>\n<h2>Comment ça s'utilise ?</h2>\n\n<p>Il faut lui donner à manger :</p>\n\n<ul>\n<li>un répertoire contenant une photo par personne, qui peut être automatiquement recadrée autour du visage</li>\n<li>le nom des personnes (soit dans le titre de la photo, soit dans un fichier CSV)</li>\n</ul>\n<p>trombilinux produit ensuite normalement un fichier PDF A4 avec 20 photos par page (5 lignes de 4).</p>\n<h2>Est-ce que ça marche bien ?</h2>\n\n<p>Le « normalement » de la dernière phrase est effectivement à détailler :</p>\n\n<ul>\n<li>il faut lui passer les bonnes choses à manger (je n'ai presque pas mis en place de gestion d'erreur, je ne sais pas faire « proprement »)</li>\n<li>la reconnaissance faciale ne marche bien que si les gens sont pris bien de face et que le fond est « simple »</li>\n<li>si on lui donne trop de photos (plus de ~30), ImageMagick peut se mettre à patauger sacrément, mais bon ça suffit à mon usage</li>\n<li>je n'ai pas testé sur autre chose que Debian testing</li>\n</ul>\n<h2>Et la technique ?</h2>\n\n<p>Mon bricolage permet de mettre bout à bout de superbes outils (quoique un peu capricieux parfois) :</p>\n\n<ul>\n<li>si on lui demande, Willow (une bibliothèque d'imagerie qui tente d'unifier Pillow et OpenCV) découpe les visages</li>\n<li>ImageMagick crée un trombinoscope au format JPEG (commande <code>montage</code>)</li>\n<li>ImageMagick convertit assembles ces « pages » et les convertit en PDF (commande <code>convert</code>)</li>\n<li>GhostScript réduit la taille du PDF en A4 (commande <code>gs</code>, c'est le seul moyen que j'ai trouvé pour garder une qualité d'image correcte)</li>\n</ul>\n<div><a href=\"https://linuxfr.org/users/yvanm/journaux/pub-trombilinux-un-script-python-pour-creer-des-trombinoscopes.epub\">Télécharger ce contenu au format Epub</a></div>    <p><a href=\"https://linuxfr.org/users/yvanm/journaux/pub-trombilinux-un-script-python-pour-creer-des-trombinoscopes#comments\">Lire les commentaires</a></p>\n",
			"added": 1513509701,
			"topic_id": 1513509701,
			"doc": "journal"
		},
		{
			"title": "L’écriture neutre",
			"pubDate": "2017-12-13 12:36:22",
			"link": "https://linuxfr.org/users/louizatakk/journaux/l-ecriture-neutre",
			"author": "louiz’",
			"body": "\n<h2>Les problèmes de l’écriture dite « inclusive »</h2>\n<h3>C’est laide</h3>\n\n<p>Très.</p>\n<h3>Cela n’inclut pas toute la monde</h3>\n\n<p>Très bien, ça donne de la visibilité aux femmes. Dans quelques années toutes les « non-binaires » et autres « agenres » risquent de venir râler parce qu’elles se sentent exclues, et on va se retrouver à faire comme les gens sur tumblr avec des pronoms idiotes telles que « xir, fær, … », qu’il faudra réussir à intégrer dans l’écriture « inclusive ».</p>\n<h3>L’accessibilité</h3>\n\n<p>C’est très complexe à lire et à écrire (par exemple, sous Windows, à part en installant manuellement la disposition bépo ou quelque chose de similaire, on ne peut pas faire la caractère « · »)</p>\n\n<p>Ça ne résout aucune problème à l’oral (comment prononcer « agriculteur·ice·s » ?)</p>\n\n<p>La point (.) possède déjà une sens (la fin d’une phrase), lui en ajouter une nouvelle est donc plutôt gênante.</p>\n<h2>L’écriture neutre</h2>\n\n<p>J’ai donc décidé de vous proposer la réforme suivante, que j’appelle « écriture neutre ».</p>\n\n<p>Les règles sont simples : les genres disparaissent.</p>\n\n<p>Je pars de la constat suivante : la genre n’a quasiment jamais d’intérêt:</p>\n\n<ul>\n<li>pour toutes les objets inanimées, ça ne sert strictement à rien (quelle est l’intérêt de savoir qu’on dit « une chaise » mais « un tabouret » ?)</li>\n<li>il est inutile de préciser la sexe d’une personne dans 99% des phrases que l’on faite.</li>\n</ul>\n<p>Il est donc possible de n’utiliser qu’une seule « genre », que l’on appellera « neutre ». Cette genre est extrêmement simple à apprendre puisqu’elle est composée exactement comme la genre féminine dans l’écriture « traditionnelle ».<br>\nAinsi, comme vous avez pu la remarquer jusqu’à maintenant en lisant cette journal, on ne dira plus « Je lis mon gros journal en regardant la télé en attendant que l’avocat m’appelle » mais « Je lis ma grosse journal en regardant la télé en attendant que l’avocate m’appelle ». Les mots comme « un », « le », « mon », « il » disparaissent complètement.</p>\n\n<p>Dans l’exemple précédente, il est à noter qu’on n’a aucune idée de la sexe (ou la genre) de la dite avocate. Cela peut très bien être une femme ou une homme, mais de toute façon on s’en fiche.</p>\n\n<p>Si vraiment on a besoin de signaler la sexe de quelqu’une, il suffit alors de la préciser à l’aide d’autres mots par exemple « la personne de sexe féminine », ou « la singe mâle est en colère » voire même « cette homme est grande ».</p>\n<h2>Quelques notes supplémentaires</h2>\n\n<p>La mot « monsieur » disparait : lorsqu’on salue une personne, elle est inutile de signaler sa sexe présumée (c’est encore une fois inutile, et de plus certaines personnes peuvent se vexer si l’on se trompe, ce qui peut créer de nombreuses problèmes). On utilisera donc uniquement « madame ». « Monsieur et Madame Dupond » deviendra donc « Mesdames Dupond ».</p>\n\n<p>Cette règles à de très nombreuses avantages :</p>\n\n<ul>\n<li>Malgré une petite période d’adaptation, ça devrait être assez simple à apprendre. C’est simplement une réflexe à acquérir, et non pas une toute nouvelle orthographe.</li>\n<li>toutes les personnes sont, cette fois, incluses (vu qu’elle n’est aucunement question de genre ou de sexe, même les non-binaires seront ravies)</li>\n<li>ça passe très bien à l’oral</li>\n<li>pas besoin de trouver une nouvelle caractère sur nos claviers, et toutes les lecteurs pour aveugles et autres s’en sortiront très bien</li>\n<li>ça facilite grandement l’apprentissage de la langue pour les étrangers. À l’instar de l’anglais, plus besoin d’apprendre les genres de chaque mots (et Jane Birkin n’aura plus d’excuse pour faire semblant d’inverser la genre des mots alors qu’elle pratique la français depuis des dizaines d’années)</li>\n</ul>\n<p>Vous vous demandez sûrement pourquoi j’ai choisi de baser cette genre neutre sur la genre féminine (de l’écriture traditionnelle) : tout simplement pour éviter toutes les remarques des pseudo-féministes qui vont venir râler parce que « si on ne garde que le masculin, c’est encore pire » ou « ça invisibilise les femmes, olala ». Personnellement, je trouve que se baser sur la genre masculine aurait été plus simple, vu qu’elle faisait déjà office de neutre dans l’écriture « traditionnelle ». Ceci étant dit, je ne suis absolument pas fixée, et on peut très bien choisir l’une ou l’autre, les deux me conviennent.</p>\n<div><a href=\"https://linuxfr.org/users/louizatakk/journaux/l-ecriture-neutre.epub\">Télécharger ce contenu au format Epub</a></div>    <p><a href=\"https://linuxfr.org/users/louizatakk/journaux/l-ecriture-neutre#comments\">Lire les commentaires</a></p>\n",
			"added": 1513509700,
			"topic_id": 1513509700,
			"doc": "journal"
		},
		{
			"title": "Conséquences sociales des cryptomonnaies - 2",
			"pubDate": "2017-12-11 22:14:18",
			"link": "https://linuxfr.org/users/scoubidou--2/journaux/consequences-sociales-des-cryptomonnaies-2",
			"author": "NumOpen",
			"body": "\n<p>Quelle sera le premier impact important de la généralisation de l'utilisation des crypto-monnaies ? Je pense que les investisseurs vont se détourner de l'épargne classique et que les cours en bourse de ces valeurs vont diminuer progressivement puis subitement s'effondrer. Ensuite, ce seront les monnaies traditionnelles (€, $, Yen…) qui vont perdre de leur valeur puis s'effondrer les unes après les autres. On pourra se chauffer en brûlant les billets.</p>\n<div><a href=\"https://linuxfr.org/users/scoubidou--2/journaux/consequences-sociales-des-cryptomonnaies-2.epub\">Télécharger ce contenu au format Epub</a></div>    <p><a href=\"https://linuxfr.org/users/scoubidou--2/journaux/consequences-sociales-des-cryptomonnaies-2#comments\">Lire les commentaires</a></p>\n",
			"added": 1513509699,
			"topic_id": 1513509699,
			"doc": "journal"
		},
		{
			"title": "La Banque Postale bloque l'achat d'un VPN",
			"pubDate": "2017-12-11 19:12:19",
			"link": "https://linuxfr.org/users/pamputt/journaux/la-banque-postale-bloque-l-achat-d-un-vpn",
			"author": "pamputt",
			"body": "\n<p>Bonjour,<br>\nje vais vous raconter une partie de ma vie des fois que certaines personnes seraient dans la même situation.<br>\nUne partie de mon argent se trouve à La Banque Postale. Je n'avais pas grand chose à lui reprocher jusqu'à présent.<br>\nIl y a quelques semaines, je décide de souscrire un abonnement à <a href=\"https://protonvpn.com/\">ProtonVPN</a>, un service VPN proposé par l'équipe derrière <a href=\"https://protonmail.com/\">protonmail</a>. Je m'apprête à souscrire à une offre payante, je saisis mes coordonnées bancaires et lorsque je valide, j'obtiens le message suivant</p>\n\n<blockquote>\n<p><em>Your card does not support this type of purchase. Please try a different card</em> (Votre carte ne prend pas en charge ce type d'achat. Veuillez essayer une autre carte)</p>\n</blockquote>\n\n<p>Je réessaie mais toujours le même message. Je suis assez surpris car je n'ai jamais eu aucun problème de paiement avec ma carte bancaire alors que je l'utilise régulièrement pour payer des choses en ligne ou lors de voyage sur les 5 continents.</p>\n<h5>Première étape</h5>\n\n<p>Je contacte le service support de ProtonVPN pour leur expliquer mon problème. Après plusieurs échange, il semble bien que le problème vienne de ma banque.</p>\n<h5>Deuxième étape</h5>\n\n<p>Je contacte un « conseiller » de la banque postale pour résoudre ce problème. Trois jours après mon message, j'obtiens une réponse « bateau » qui m'informe que ma carte fonctionne parfaitement et je suis invité à contacter 3D SECURE pour plus d'information. Je réessaie donc de payer mon offre VPN mais j'obtiens le même message que précédemment.</p>\n<h5>Troisième étape</h5>\n\n<p>J'appelle 3D SECURE qui m'informe que ma carte fonctionne parfaitement et que le problème se situe au niveau de la Banque Postale. Je commence à ne pas aimer d'être mener en bateau. D'une part, le numéro de 3D SECURE est payant (je me demande bien pourquoi je paie des frais bancaires qui me permettent normalement de pouvoir payer avec une carte bancaire et autres joyeusetés ; ici ce service n'est pas rendu et je dois encore payer). D'autre part, le « conseiller » de la banque postale semble bel et bien être un « robot » fournissant des réponses toutes faites.</p>\n<h5>Quatrième étape</h5>\n\n<p>Je renvoie un message au « conseiller » de la banque postale un peu sec pour leur signaler que 3D SECURE m'a indiqué que le problème vient de chez eux. Trois jours plus tard, j'obtiens la réponse suivante</p>\n\n<blockquote>\n<p><em>Dans votre message ci-dessous, vous souhaitez obtenir des précisions concernant des refus de paiement en ligne.</em></p>\n\n<p><em>Nous avons transféré votre demande au service concerné qui vous répondra dans les meilleurs délais.</em></p>\n</blockquote>\n\n<p>Je réessaie alors d'acheter le service VPN et là, ça fonctionne normalement ; j'ai mon abonnement VPN. À noter que 10 jours après avoir reçu ce message, je n'ai toujours pas été contacté par le « service concerné ».</p>\n\n<p>Je ne sais pas s'il s'agit d'un hasard, mais ProtonVPN et ProtonMail étant liés, je ne peux pas m'empêcher de me rappeler le <a href=\"http://www.lemonde.fr/banc-essai/breve/2014/07/01/paypal-gele-le-compte-du-projet-d-e-mail-securise-protonmail_4448703_4409046.html\">blocage par paypal des dons vers ProtonMail</a> il y a 3 ans.</p>\n\n<p>En résumé, la Banque postale m'a énormément déçu. Si j'avais un compte twitter ou facebook, j'aurais contacté directement la banque pour leur demander des explications. Il parait que les entreprises n'aiment pas la mauvaise pub sur les réseaux sociaux et que ça aide à résoudre les « problèmes » rapidement. Mais comme je ne suis pas sur les réseaux sociaux, j'en parle ici pour qu'il y ait au moins un peu de pub sur ce sujet …</p>\n<div><a href=\"https://linuxfr.org/users/pamputt/journaux/la-banque-postale-bloque-l-achat-d-un-vpn.epub\">Télécharger ce contenu au format Epub</a></div>    <p><a href=\"https://linuxfr.org/users/pamputt/journaux/la-banque-postale-bloque-l-achat-d-un-vpn#comments\">Lire les commentaires</a></p>\n",
			"added": 1513509698,
			"topic_id": 1513509698,
			"doc": "journal"
		},
		{
			"title": "Inventaire de matos",
			"pubDate": "2017-12-11 11:26:43",
			"link": "https://linuxfr.org/users/yekcim/journaux/inventaire-de-matos",
			"author": "yeKcim",
			"body": "\n<p>Bonjour</p>\n\n<p>Je suppose que je suis mauvais pour trouver des logiciels qui correspondent à mon besoin. Il y a quelques semaines j’avais besoin de retranscrire une interview, je ne trouvais pas de logiciel pour le faire sur le coup, or il existe le site <a href=\"http://otranscribe.com/\">otranscribe</a> ou le logiciel <a href=\"https://gkarsay.github.io/parlatype/\">Parlatype</a>, j’ai découvert ces deux possibilités quelques jours après avoir galéré avec mpv et gedit…</p>\n\n<p>Je travaille dans une UMR (un institut de recherche) et j’avais besoin d’inventorier notre matériel (lasers, photodiode, filtre, analyseur, lunettes de protection,…). Je ne trouvais rien qui réponde vraiment à mon besoin. J’ai fini par commettre <a href=\"https://github.com/yeKcim/inventaire/\">INVENTAIRE</a>.</p>\n\n<p>Mon besoin est le suivant : <br>\n- outil en ligne pour être accessible depuis n’importe quel poste (intranet, pour l’instant, tout le monde à tous les droits)<br>\n- associer directement différents documents (data-sheet, caractérisation,…)<br>\n- gérer les différents entretiens (nettoyage, calibration,…) avec des icônes en fonction du temps restant<br>\n- un journal disponible pour chaque composant listé (pour suivre les aventures de laser22 et la fabuleuse calibration d’analyseur_de_spectre12) <br>\n- plusieurs inventaires peuvent être créés (plusieurs équipes ou domaines par exemple…)<br>\n- des sections « administratif » et « technique » clairement différenciées pour permettre de remplir uniquement une partie si on le souhaite.<br>\n- Si on affiche une seule catégorie, il est possible de trier en fonction des caractéristiques spécifiques à celle-ci</p>\n\n<p>Ça donne un listing :<br><img src=\"https://img.linuxfr.org/img/68747470733a2f2f6769746875622e636f6d2f79654b63696d2f696e76656e74616972652f7261772f6d61737465722f524541444d455f73637265656e73686f745f6c697374696e672e706e67/README_screenshot_listing.png\" alt=\"listing\" title=\"Source : https://github.com/yeKcim/inventaire/raw/master/README_screenshot_listing.png\"></p>\n\n<p>Une page réussissant toutes les infos pour chaque composant :<br><img src=\"https://img.linuxfr.org/img/68747470733a2f2f6769746875622e636f6d2f79654b63696d2f696e76656e74616972652f7261772f6d61737465722f524541444d455f73637265656e73686f745f64657461696c2e706e67/README_screenshot_detail.png\" alt=\"detail\" title=\"Source : https://github.com/yeKcim/inventaire/raw/master/README_screenshot_detail.png\"></p>\n\n<p>D’autres captures d’écran sur <a href=\"https://github.com/yeKcim/inventaire/\">https://github.com/yeKcim/inventaire/</a></p>\n\n<p>Je ne suis pas développeur, le code (php, mysql) est donc très certainement crade, mais je me dis que cela peut<br>\n- soit rendre service à quelqu’un d’autre et avoir des avis<br>\n- soit avoir un commentaire m’expliquant que je viens d’inventer la roue octogonale alors que la roue circulaire existe depuis longtemps.</p>\n<div><a href=\"https://linuxfr.org/users/yekcim/journaux/inventaire-de-matos.epub\">Télécharger ce contenu au format Epub</a></div>    <p><a href=\"https://linuxfr.org/users/yekcim/journaux/inventaire-de-matos#comments\">Lire les commentaires</a></p>\n",
			"added": 1513509697,
			"topic_id": 1513509697,
			"doc": "journal"
		}
	],
	"next_topic_id": 21,
	"next_comment_id": 1
}
