{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1513698187,
			"title": "Z'est quoi ce zite ?",
			"body": "ZeroLinuxFr est un faux-miroir-collaboratif-non-officiel de [LinuxFr.org](https://linuxfr.org).\n\n* __Faux__ car il n'a pas vocation à être exhaustif et à contenir l'intégralité des dépêches et journaux originaux\n* __Collaboratif__  car la mise à jour des contenus dépend des utilisateurs (cf. [\"Comment ça marche ?](http://127.0.0.1:43110/1ADpUkLcvDuEqUJqJpLC52KyqoLnE7zd6/?Topic:1513698420_1FKLmdDYNDMgqNd9QFEgNCgSttaDF7KnTF/Comment+a+marche))\n* __Non-officiel__  car il n'émane pas, directement ou indirectement, de quelqu'un de chez LinuxFr.org\n\n[LinuxFr.org](https://linuxfr.org) est un site de publications collectives (dépêches) ou personnelles (journaux) fréquenté par des développeurs et/ou des utilisateurs avancés de logiciels libres qui ont souvent des discussions intéressantes sur de nombreux sujets de sociétés. Le site est géré par une association:\n\n> LinuxFr est une association régie par la loi de 1901, créée fin octobre 1998.\n>Elle a pour objectif de promouvoir les Logiciels Libres, en particulier Linux.\n\nLe contenu sur LinuxFr.org est __à priori__ sous licence libre et copyleft [CC by-sa](https://creativecommons.org/licenses/by-sa/4.0/deed.fr).\n\nZeroLinuxFr ne reproduit pas les commentaires originaux car cela serait difficile à mettre en place et coûteux en espace disque ... donc, si un sujet vous intéresse, vous êtes invité à vous rendre sur le site officiel via les nombreux liens.\n\nZeroLinuxFr est un clone modifié de [ZeroTalk](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/) dont il a gardé toutes les fonctionnalités. Ainsi il est possible, et encouragé, de créer des topics, commenter et voter, y compris sur les journaux et les dépêches.",
			"added": 1513698186
		},
		{
			"topic_id": 1513698420,
			"title": "Comment ça marche ?",
			"body": "à faire",
			"added": 1513698418
		},
		{
			"topic_id": 1513698561,
			"title": "Moi aussi je veux un zite comme ça",
			"body": "Il est possible théoriquement de cloner ZeroLinuxFr et de le relier à d'autres sources de contenu mais il faudra mettre les mains dans le cambouis et vous familiariser un peu avec les bases de données et les fichiers jsons. Et trouver une source qui fournit du RSS.\nExplications à venir.",
			"added": 1513698558
		},
		{
			"topic_id": 1513698595,
			"title": "Les licences",
			"body": "coming soon",
			"added": 1513698591
		},
		{
			"topic_id": 1513699192,
			"title": "Avertissements",
			"body": "Les journaux et les dépêches présents sur ce site comportent de nombreuses __redirections extérieures__. Il me paraissait inconcevable de les désactiver tant elle sont essentielles à l'expérience du lecteur. Si vous utilisez Tor sur Zeronet mais pas sur le reste de votre navigation, aillez conscience que ces liens vous font sortir du réseau Zeronet.\n\nIl en est de même des __images__ car celles-ci ne sont pas stocké sur ZeroLinuxFr. Par défaut elles ne sont ni affichées ni téléchargées mais il vous est laissé le choix de les faire apparaître.\n\nPar ailleurs quand vous décidez de peupler le site (\"__ loadNew TOPICS__\"), deux requêtes sont envoyées à https://rss2json.com/ pour recueillir les contenus sur __votre machine__ et les mettre à disposition des autres zeronautes. Vous n'êtes absolument pas obligés d'utiliser cette fonctionnalité. Seulement vous serez tributaires des autres lecteurs.",
			"added": 1513699187
		}
	],
	"topic_vote": {
		"1513698420_1FKLmdDYNDMgqNd9QFEgNCgSttaDF7KnTF": 1,
		"1513699192_1FKLmdDYNDMgqNd9QFEgNCgSttaDF7KnTF": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1513699192_1FKLmdDYNDMgqNd9QFEgNCgSttaDF7KnTF": []
	},
	"comment_vote": {}
}