{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1591733013,
			"title": "Traditional Recipe: Cooking a cat",
			"body": "Here is the original recipe, first translated into Italian and then into English to cook a good cat. I publish the recipe here because it is not well accepted on the web. I don't really understand the reason. If you know it, enlighten me!\n\nIf you have decided to make yourself a good cat alla vicentina, there must be a nice fat cat in the neighborhood, and not older than two years, but especially that his mistress has done a good spite time ago.\nOne good morning, take your rifle and go out early, tell the house you're going to get some air. It would be better if it had snowed the day before, the kind that stays on the ground for a fortnight.\nAs soon as you see the cat in question, pretend you don't see it; hide around a corner, load the rifle, and do what you have to do. Take it home in your shopping bag; greet everyone in the street, and if they ask you what you are doing with the rifle, tell them that you are going to shoot a mouse.\nWhen you get home, close the gate, go to the garden and hang the cat on a pole. Open its belly like a rabbit, and pull out all its guts, keeping its liver. Cut its head off and give it to the dog.\nDig a hole in the snow now, put the cat inside and then cover it again. Go in the house, put the cat's liver in a bowl in the fridge, and go to the toilet to wash your hands like Pontius Pilate; and then to the tavern to drink a glass. On Saturday go to confession, and on Sunday go get the Communion!\nLeave the cat under the snow for eight days, being always careful that it is well covered and that the dog remains tied to the chain. Twelve hours before putting it in the pan, take it out of the hole; and when it is tender, peel it and wash it well, leaving it hanging a little to drip.\nChop it up and put it in a pan with an onion, a carrot, a celery leg, an edge or two of garlic, all chopped. Also add two bay leaves, a few peppercorns and four, five juniper leaves, a pinch of spices and enough salt.\nDrown it in the rather dry white wine, and then put it in a fly in the cellar to marinate overnight.\nIn the morning, drain the pieces of meat from the wine, dry them well, and brown them in a pan with a little oil.\nWhen they've taken on color, take them out of the grease and drain what's left. Pound finely an onion, a dagger of parsley and an edge of garlic, then put everything in the pan with a little butter and oil, adding sage leaves and a sprig of rosemary. Let it fry and then put the pieces of the cat inside.\nAfter ten minutes, throw four or five freshly opened peeled tomatoes on top, or a little preserve. Mix with a wooden spoon, and add a glass of white wine and a glass of red wine. Put the lid on it and cook for an hour and a half or two, wetting with broth if it dries too much.\nFinally, add the chopped liver. Put the pieces of cat in the plate, with its sauce, and bring them to the table with hot polenta.\nSay it's local rabbit, raised on grass and flour, and you'll see what kind of figure you'll make of it.",
			"added": 1591733012
		},
		{
			"topic_id": 1592177248,
			"title": "Immortality and politics",
			"body": "Now, thanks also to the work done by Harold Katcher, an unimaginable lifespan is possible, even in the next 5 years. Right from the start, companies are running to patent everything. How do you think everything will be regulated? I had thought of a project like Four Thieves Vinegar(https://www.youtube.com/watch?v=LIYbz0ZdHUw and in detail.. https://www.youtube.com/watch?v=Py5TkirrO-U) to produce a possible drug to extend life in an anarchist way. Comments? I just can't get over thinking of a selfish way in which the whole thing could be regulated. masquerading as overpopulation or something.",
			"added": 1592177246
		},
		{
			"topic_id": 1592765143,
			"title": "A state-of-art and secure P2P crypto exchange on Zeronet",
			"body": "I'm working on a design to make a truly p2p trading crypto exchange, safe, here on zeronet. Comments?",
			"added": 1592765140
		},
		{
			"topic_id": 1593271955,
			"title": "Truly opensource technology",
			"body": "Open source software has become a must and continues to improve. GPLv3 hardware is starting to get serious. Clearly the main problem remains the CPU and other chips with a closed design. The RISC-V architecture is only an instruction set and its license allows manufacturers to avoid releasing the core source code. There are open source RISC-V designs around, but they are nothing special and only a small fraction of them are 64 bit. While serious designs like those made by alibaba, which could compete with intel CPUs, are closed.\n\nEven if there were sources available, they would be somewhat useless. Because the foundries print the chips, and they could easily do whatever they want. So there is a bigger problem to solve: to make the techniques and instrumentation for printing high-quality chips on a low scale open source. This also resolves the monopoly that large foundries have, which is not very good for consumers. Many people believe that making high quality lithography is very very expensive. This is true, but only for foundries, because they have to do things on a very large scale and have to resort to masks that cost millions of dollars. But there are very inexpensive techniques for printing small-scale chips that are different. As with drugs, there is a great deal of difference from large-scale and small-scale production. There is a boy, who is called Sem Zeloof, he has a Youtube channel. He uses some of these techniques to make his own chips. Nothing amazing, after all it does it only in free time. Like him, many academics resort to similar techniques. Scientific literature has shown us that quality similar to the current state of art, and greater, can be achieved.\n\nI have seen others like me around talking about this possibility, There are many presentations available on YouTube. However cheap these techniques are, they still require equipment, knowledge etc... Surely hobbyists will make their small foundry \"in the garage\" and the industries that now have intellectual property will think about making their own foundry or maybe they will continue to do as they do now, but it will not be the preferential choice of a journalist or a person who only wants free technology, therefore it is likely that there will be a sort of retail purchase between those who actually want to have fun with lithography and those who want simply serious stuff to work with, or there could be free hacklabs with such equipment as happened with 3D printers. Prices would go down and in the market there would no longer be the difference between a cpu like intel core 2 duo and one like an overclockable I9.\n\nTo start, there is to design such equipment and techniques, and documentation. Maybe under GNU, even if they have never dealt with open source in this respect, there are other organizations for this. But since all this in close contact with electronics and computer technology can also be there. Comments?",
			"added": 1593271951
		},
		{
			"topic_id": 1594250812,
			"title": "Storj + ipfs WAS a great thing",
			"body": "At the moment what should be done if you want to keep a file for a long time in a p2p network? You must make physical or cloud nodes and pray that they remain online, uncensored etc... even in difficult times, when there are no other peers to do seeding besides you. Very well, this is a standard in decentralized networks like bittorrent or IPFS and it is bad. STORJ had done an amazing thing that worked out EVERYTHING. Storj is a decentralized PAID cloud, based on blockchain, where tokens are offered based on the space and bandwidth that a node shares. This ensures that there is an interest in sharing your files that goes beyond intrinsic value, which is subjective. But it moves to the money you go to pay to make hosting, always guaranteeing the availability of peers, being all interested in having your money. And as it is decentralized. it's a really good thing. On its own, this can be not too exciting. But the storj team were doing a good thing, they were joining their network to IPFS, joining the two concepts of P2P. So, it ended, that, taking the initial example, the peers maintained by the uploader are provided by storj and remain 100% decentralized, without a single point of failure. And since you pay for the bandwidth consumed, when many peers seed your file, STORJ costs are negligible. In those worrying moments, where nobody wants to seed your file, there are people who occasionally request it and you still consider it very important, only the peers provided by STORJ remain, which go to consume the tokens deposited, but they are truly reliable and decentralized. This was a great idea, but unfortunately the STORJ team stopped developing it because of the little demand. I am sharing my sadness with you.\nhttps://storj.io/blog/2019/10/ipfs-now-on-storj-network/",
			"added": 1594250807
		}
	],
	"topic_vote": {
		"1591733013_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"1591894745_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"1591995772_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"1592307347_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji": 1,
		"1592362442_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": 1,
		"1592403341_12MBVCw8iNrKvgTrV5NMPtPf6Z5V2WRHYU": 1,
		"1592654547_1Lf5ghhXxuHpxkMXrFjc9G22e2XzpqJ6B4": 1,
		"1592765143_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"1592919739_1JKon8M8JL2TaW4XTg21gVMknUbvrLeXeN": 1,
		"1593289936_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG": 1,
		"1593271955_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"1594145192_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1594178844_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": 1,
		"1594250812_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1
	},
	"next_comment_id": 61,
	"comment": {
		"1591525925_14ADWoY886HnM8jPeipXarxAfyQANiMTQj": [
			{
				"comment_id": 1,
				"body": "Adventure time and rick and morty. But please, don't do seeding with tor, it is against tor etiquette since the traffic is donated by volunteers and tor isn't for high bandwidth applications. You risk to saturate the network, seriously.",
				"added": 1591732399
			},
			{
				"comment_id": 10,
				"body": "> [p0rtal](#comment_34_1A5NgDyiTqhcBgrm8SuSEhaygTXuc7ogt2): Thats not true and is even actively debunked by tor developers themselves on most conferences since a few years now. Also when two users use tor, it is only bridged, so no exit node is stressed at all.\n\nCan you give me some sources? Because in your comment there isn't an explanation that debunk my affermation. Also, as exit nodes can be stressed, even relays can be stressed.\n\nHowever, even the whonix guys agree with me. https://www.whonix.org/wiki/Why_is_Tor_slow#Misuse_of_the_Tor_Network",
				"added": 1591890166
			},
			{
				"comment_id": 14,
				"body": "> [geekosan](#comment_54_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4): I just hope they'd enable .mkv (matroska) containers. I've got many of those.\n\nRight, matroska is a fantastic file format.",
				"added": 1592002939
			}
		],
		"1591733013_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": [
			{
				"comment_id": 2,
				"body": "It was very fashionable in wartime!",
				"added": 1591733107
			},
			{
				"comment_id": 3,
				"body": "> [ransbits](#comment_78_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A): Is this a real recipe? I've seen documentaries where 'feline ranchers' would calculate the value of a cat by how large of a fish it can carry off.\n\nOf course it's a real recipe, it must have been written by some Venetian housewife in wartime.",
				"added": 1591782100
			}
		],
		"1591804075_12MBVCw8iNrKvgTrV5NMPtPf6Z5V2WRHYU": [
			{
				"comment_id": 4,
				"body": "Something like the size of Facebook would work very good. The problem is something that is not the size of Facebook. For peers, you know?",
				"added": 1591804458
			},
			{
				"comment_id": 5,
				"body": "> [consensus](#comment_1_12MBVCw8iNrKvgTrV5NMPtPf6Z5V2WRHYU): network \n\nExactly, then zeronet is scalable, so it's not that a peer downloads all Facebook. So in this case it would depend on profile to profile. As long as one has at least one friend / peer, then he will always have his profile available. Clearly Facebook without friends, or without peer is not facebook, so Facebook would even be the perfect application for Zeronet. \n\nI am then describing the ideal situation where a peer stays on 24 hours a day, but I will tell you, at the moment my zeronet installation resides on my ADSL router, with a USB SSD. Together with deluge, an nginx server, a dlna server and a samba server. To make p2p very little power is needed and above all any unix-based router, through a chroot, you can create your own installation of a Linux distro, keeping all the components, drivers, etc ... OEM, it is absolutely non-invasive. It takes 5 minutes and I have also made a guide. And if it was not understood it is universal. So I don't see anything surreal about implementing this thing in a default installation of zeronet or any p2p software and automating it. \n\nApart from this, even if on average the peers are not turned on 24 hours a day, obviously it remains a sustainable model, simply for a profile 3 friends / visitors are enough to tell you, if you want it to be available always, clearly this when you are not online, therefore you are you are your own peer and you don't need friends.",
				"added": 1591805522
			},
			{
				"comment_id": 7,
				"body": "> [mg0](#comment_322_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): You all are ignoring the overhead of the way zeronet does actually work, the amount of content.json files and databases it uses aren't that efficient, so unless everyone has their peers running on SSDs and good filesystems that won't fragment like crazy zeronet wouldn't scale to anything near as massive as facebook.\n\nEveryone has an SSD, and the file system problem is relative.",
				"added": 1591810785
			},
			{
				"comment_id": 8,
				"body": "> [mg0](#comment_323_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): I don't have an SSD, and the file system consideration is more as a way to better handle the database files of each zite as one can't use a different method for keeping databases.\n\n> [merithtk](#comment_44_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): Well that wouldnt be too much of an issue if the main page functioned somewhat like it does here, but tailored to your freinds and the algorith done on the computer,  [...]\n\nThank God a webmaster has the opportunity to design the site as he likes, going to solve these problems if he sees the reason. However, as I said, now everyone has an SSD.",
				"added": 1591812991
			},
			{
				"comment_id": 9,
				"body": "The main problem with zeronet, in my opinion, is that webmasters believe it is the web, as they left it in the centralized internet. But no, zeronet, as Wikipedia says, is a web-like, and requires completely different design choices from the normal web. Even as soon as a site far exceeds the default quota of 10 mb, it is very likely that the site was poorly designed. It is not uncommon to see mp4 stuck directly into the browser's <video> player which obviously gives problems, or pages that act as galleries full of images that all consume the quota of 10 mb by default. A website that takes full advantage of zeronet potential, which was designed FOR zeronet, can easily host millions of users.",
				"added": 1591813418
			}
		],
		"1591805618_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 6,
				"body": "If you install zeronet in your router, you can, from your devices, simply go there with the browser. And the zeronet interface is also optimized for mobile devices.",
				"added": 1591806183
			}
		],
		"1591900169_1NMBe5SUr5hbYNTzBMuvdBCAxQ81ivWzeL": [
			{
				"comment_id": 11,
				"body": "\"Does no one take this shit down?\" Try!",
				"added": 1591901761
			},
			{
				"comment_id": 12,
				"body": "> [savugez](#comment_3_1NMBe5SUr5hbYNTzBMuvdBCAxQ81ivWzeL): Some kinda stupid huh?\n\nIf you are not neutral and want the internet to work according to your rules then yes, zeronet is the stupidest thing in the world. The point is that if you want to make a neutral internet then you have to be with everything. If you don't like pedophilia, try to fight it on other fronts, and not on zeronet. And remember that one day, the guy who really needs a neutral internet, it could be you. In a future, humanity's \"universal\" thinking may become that all white-skinned people suck and are treated like pedophiles are now. You could be a white man, and if you are persecuted like pedophiles you will need Zeronet. Neutral things are a benevolence towards everyone. Know that this is a thought shared by the majority, things like the Red Cross, Tor (supported by the US government) and a thousand other examples, work the same way.",
				"added": 1591906787
			}
		],
		"1591924953_1gn57j2UokAkXvA1VyhkHvKZvg59RoXuW": [
			{
				"comment_id": 13,
				"body": "> [blurhy](#comment_529_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Who told you communism has failed\n\nIs there any scientific evidence about that?",
				"added": 1591980140
			}
		],
		"1591995772_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 15,
				"body": "We need a keygen music database on zeronet, like keygenmusic.net",
				"added": 1592003027
			}
		],
		"1592089664_1gn57j2UokAkXvA1VyhkHvKZvg59RoXuW": [
			{
				"comment_id": 16,
				"body": "> [marcellusfagoti](#comment_11_14VqoVEkT68vis7i7gsKUqkDzKgDnVRA5Q): what was coalfax.me?and why was the fbi interested?\n\nidk but I found this https://www.urbandictionary.com/define.php?term=coalfax",
				"added": 1592152717
			}
		],
		"1591821395_19ev8HmfPQ2VC8aWDA4Ck7E2vLYDYFgw9P": [
			{
				"comment_id": 17,
				"body": "> [anonymouslogin](#comment_206_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): A more sustainable approach is to promote p2p network like zeronet to more content producer. So their (quality) content will be seeded by peers.And the network will organically discard content that no one else care.\nP2P doesn't work for archiving. It's basically the opposite. A library archive all, not only what people like.",
				"added": 1592153939
			}
		],
		"1592177248_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": [
			{
				"comment_id": 18,
				"body": "This is a really important topic and maybe we, here on zeronet, can do something about it.",
				"added": 1592177570
			},
			{
				"comment_id": 19,
				"body": "> [eltheal](#comment_22_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf): interesting, so do i have the correct tldr. replacing older blood with younger blood makes you gain years back?\n\nNo, by using a solution of substances found in plasma, old age can be reversed, not young blood. They have not given the precise formula, but they will give it in the final research, because they are patenting it. \"Young\" blood is only a clue, however the same can be done with synthesized products. You won't have to kill children for the intent, because some on reddit believed so lol",
				"added": 1592225629
			},
			{
				"comment_id": 20,
				"body": "> [reichama](#comment_3_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe): If there was a way to gain immortality by continuously sacrificing and using the blood of children, do you think nobody would be willing to pay the price? Even if it was just a hoax, I'm willing to believe that there are people out there both capable and willing to test it out.\n\nWe are just machines, there are infinite alternative ways to do something. So, in a hypothetical world similar to ours, using children's blood to get young would not be the only way. Maybe the easiest, but only apparently, because it is enough to discover new things and then expand knowledge to find increasingly efficient solutions. So I would say that those who resort to slavery and the like to solve problems, not only do not have a moral, but are also ignorant.",
				"added": 1592243377
			},
			{
				"comment_id": 21,
				"body": "> [edgelordofdecent](#comment_563_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Yeah, this shit will be patented\n\nyeah, but this is not a problem for an individual, who synthesizes the pharmaceutical for himself.",
				"added": 1592247453
			},
			{
				"comment_id": 22,
				"body": "> [edgelordofdecent](#comment_565_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Wait for them to get the patent then take the details.\n\nThis is the plan, another thing is to make open source and distribute easy recipes and 3D models to make your own drugs for this therapy and be completely independent of any regulation. Like that project that I linked in the post.\n\n> [reichama](#comment_5_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe): Patents aren't things that actually work, unfortunately. They just describe things very broadly. I once tried to implement something based on a patent and the thing was full of equations that self-referenced each other in a way that circled around. At the end you were at the beginning without any result. I'm convinced patents are only used to be able to sue each other, they do not hold any knowledge.\n\nIt doesn't matter, in the research they will put details, because the research needs to be reproducible for peer review.",
				"added": 1592256341
			}
		],
		"1592362442_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": [
			{
				"comment_id": 23,
				"body": "Why not do the same thing with religion instead? There are a great many African peoples where the Catholic Church has not yet gone. You just go there and start saying things a little more fun than the Catholic Church. Like you're a prophet and instead of using vaccines you're working a miracle. Religion or region, I've always liked doing things like that, but you must have a lot of friends to do it with. The truth is that very few people want adventure. At least 10 that I told, only one of them said, \"that's cool.\" And you know, to do things like that, you need people you trust around you.",
				"added": 1592388967
			},
			{
				"comment_id": 27,
				"body": "> [eltheal](#comment_35_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf): sub-saharan africa is the region this post was about, looks like you got it somehow. there are multiple ways movement of people can happen. you are right, most people do not like adventures. for example now in the modern day, economic/easy life is clearly one of the biggest reason, if not the biggest reason. like the mass movement of people into europe. then you also have it where countries sends their own small group of people somewhere else, because population density reasons or security reasons. like uk sending their prisoners to australia. it is not for the adventure, fewer people will go because of a journey. the more things move forward, sub-saharan africa looks like it hits multiple points for people. [...]\n\n> [eltheal](#comment_35_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf): sub-saharan africa is the region this post was about, looks like you got it somehow. there are multiple ways movement of people can happen. you are right, most people do not like adventures. for example now in the modern day, economic/easy life is clearly one of the biggest reason, if not the biggest reason. like the mass movement of people into europe. then you also have it where countries sends their own small group of people somewhere else, because population density reasons or security reasons. like uk sending their prisoners to australia. it is not for the adventure, fewer people will go because of a journey. the more things move forward, sub-saharan africa looks like it hits multiple points for people. [...]\n\nYes, I agree, even in my opinion since the economy has become like today, people have gradually become lazy and do not even think about doing similar things, which in ancient times was normally. Which is fine, however, in recent times, many of these things seem crazy, and it seems exaggerated to me. That is, it has gone from a time when the state was only a tool (although I do not want to exaggerate, because they guillotined you easily enough), to now where is the core of a population and there is NOTHING more important and all choices have to go through this. The terminology you used in the first post is intriguing, that is, the last time I heard these things was in a TV series or a movie. Or in some biography of some 18th century pirate lol. Precisely because in those periods it was the norm, as it would naturally be.",
				"added": 1592575847
			},
			{
				"comment_id": 30,
				"body": "> [eltheal](#comment_37_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf): there are a few places that are not in the same standards as most countries in the world. papua new guinea, bhutan, and most of sub-saharan africa are the only major parts of the world i can think of the top of my head. sub-saharan africa is different than the others since it does commerce with the rest of the world while papua new guinea and bhutan is more isolated and introverted. [...]\n\nThe estimate I made before, 1/10, is a lot, keep in mind that my friends are among the new generations, all in their twenties. I have the impression that many are returning these feelings especially in the new generations. Also consider that it is also right that not everyone has them. Even in the past there were craftsmen who all they wanted to do was crafts. It is normal for only a minority (like 1/10) to consider such things as fun. However, the problem is another, today's society makes people feel very small, able to do nothing if alone, I don't know if you have heard around that on average people underestimate what they can do in 10 years. These feelings remain only dreams therefore. But what do you care? It is not necessary for others to have these feelings. As long as you have them. However if you are interested in a prediction here's what I think:\n\nI put as an axiom that a natural, free world, which allows human beings to express themselves, is set up in such a way that there are no more states, but only city-states. With its own form of government like the Greek polis. Since only 2% of the emerged lands are actually inhabited, these city-states will not have other neighboring cities and there will be a vast expanse of free lands, which everyone can exploit. Men will have the opportunity to choose between living in a city-state and submitting to the government or any political philosophy in use, taxes to be paid etc... or to live somewhere in \"international\" lands (such as international waters today and their rules), the same is true for small shopkeepers. Companies and industries will also reside in international lands, independent of everyone and everything as the large companies of today have always wanted and continue to want. For commercial exchanges, we will return to using currencies with the same principle as gold, such as bitcoin.\n\nNow after the axiom... One of these things can also be done in fractions of continents, the whole world is not necessary. Continuing to take the polis of Greece as an example, they were only in Attica. But we have always talked about the whole of humanity. So continuing along this path, know that in antiquity similar systems were very fashionable, not only in Greece. Almost all peoples set up city-states. I believe that to return to a similar but modern situation, such as that of the axiom, humanity must reset itself, as with a cataclysm or something. By now the people have formed, they are tied to their traditions, this is one of the main reasons why there are wars among other things. So if you want to do something like this you have to start humanity from scratch. Not so much for scientific knowledge, but for the traditions and ties of peoples as I said before. Colonization of other planets is becoming more and more reality. If a company or an individual gets there first rather than some government agency, it can force such a system and oppose the likely will of the current nations. As I said before, a \"reset\" of the traditions of the peoples is needed, using a new planet entails this. There is another modern aspect to calculate. Science is seriously coming to bring us an unimaginably long life, as I wrote in a post here on zeronet. All society, ancient and modern traditions, religions, have been modeled and have evolved according to death, considering death as foreseeable, thus limiting a very important resource, time. This important innovation will reduce interest in other resources, such as power and lead humans to devote themselves to other things. Reconnecting to what I said at the beginning of the post, the individual will be full of resources (time) because one type of resource is worth the other. Imagine an underpowered computer, but without time limit. It can crack any encryption, or do anything in general. In any case, this too can lead to resurfacing of these feelings we are talking about, and the individual will have relatively infinite resources, as much as a society made up of many individuals with each one relatively infinite resources.",
				"added": 1592667011
			}
		],
		"1592403341_12MBVCw8iNrKvgTrV5NMPtPf6Z5V2WRHYU": [
			{
				"comment_id": 24,
				"body": "Gaming in zeronet equals to normal gaming. Multiplayer on steam, online etc... is already almost P2P. Maybe you will have latency issues with \"always Tor\" peers, but this is normal even on normal internet.",
				"added": 1592403617
			},
			{
				"comment_id": 28,
				"body": "> [edgelordofdecent](#comment_570_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): There are zites for games like chess. Having decentralized gaming isn't really a good idea. There would be many latency issues with people in the game having different pings to each user. Gaming would have to work on a federated model.\n\nUsually multiplayer games work that a peer hosts the game and everyone else who wants to join this session connects to it. Obviously a similar design on zeronet is as possible as on the normal web. Regardless of the latency, also because if so far they have done so, it is not that all the problems come when you have to put on zeronet.",
				"added": 1592588743
			}
		],
		"1592435169_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 25,
				"body": "If it is 32 bit or 64 bit yes. Also 16 bit, but there is a very limited support.",
				"added": 1592492360
			}
		],
		"1592521813_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 26,
				"body": "> [merithtk](#comment_48_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): Depends, my sona is a dragon so looking for scale texture [...]\n\nthere is no strangeness in these issues between human beings, we are all strange and therefore we are all normal. However, if you feel the need to wear a mask so as not to be recognized, then it means that strangeness is generated by you, not considering you normal.",
				"added": 1592574631
			},
			{
				"comment_id": 29,
				"body": "> [merithtk](#comment_49_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): Still wondering where i can get stuff for this. I find i can be trueer to myself when people cant instantly associate that with me,\n\nidk",
				"added": 1592594978
			}
		],
		"1592765143_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": [
			{
				"comment_id": 31,
				"body": "> [edgelordofdecent](#comment_581_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Still no way to prevent scamming. You would need autonomous middleman wallets that would hold the coins and send them when both parties have deposited.\n\nI know, the way is obviously there. I'm working on it. I opened the thread to see if there was interest in the zeronet community.",
				"added": 1592770917
			},
			{
				"comment_id": 32,
				"body": "> [vcrovuep4lnye2b9](#comment_1_1JHhs98RB4734pGx6sL9i88ATF7GF2d1Ex): You would need to make a system where people register privately.   Zeronet is technically not a blockchain so ledgers would be impossible without worrying about someone messing with such.    If you create a Tor hidden server and host a web server you could perhaps create a registration then send via email their credentials for their Zeronet account..   You would need people to run something like a Python App that does all the encryption and processing of data...   But the ledger (Blockchain) is actually the really hard part.\n\nThis thread is not meant for discussions of this type.\n\n> [pharaon](#comment_3_1gn57j2UokAkXvA1VyhkHvKZvg59RoXuW): Useless, your firmware is unsafe.\n\n???",
				"added": 1592844160
			},
			{
				"comment_id": 35,
				"body": "> [vcrovuep4lnye2b9](#comment_2_1JHhs98RB4734pGx6sL9i88ATF7GF2d1Ex): There is NO way you an create a P2P crypto exchange on Zeronet...  You would need people to download a python app that you create for data processing and submission.   Creating something private on Zeronet is not possible as everything is in the open for all to see...    You can post encrypted data that you and the individual using your service could see and use Zeronet as a ledger of sorts, kind of like an XML feed...   The python app could update its data from the feed and submit changes to you via Zeronet. [...]\n\nI am tired of all these offtopics, if you want to discuss about It open another topic.",
				"added": 1593215290
			}
		],
		"1592950813_1PGtPmD5NAWpf4kaEB1qquveCN8S4LUqrq": [
			{
				"comment_id": 33,
				"body": "> [z0net](#comment_85_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS): Marianas web is a stale meme and does not real. [...]\n\nOpenbazaar Is very active, but you have to gather links (usually from tor, like from dread). Also the \"public tracker\" is active for pharmaceuticals and legal stuff.",
				"added": 1592964365
			}
		],
		"1593195001_13gz7jEayVZjubcAGS16kR3Ze4RJSgVFVw": [
			{
				"comment_id": 34,
				"body": "I read this meanwhile I was listening to 1984 (Orwell) audiobook",
				"added": 1593215183
			},
			{
				"comment_id": 40,
				"body": "> [adxenc73jd](#comment_17_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji): Don't just use Linux on your computer. Also use: 1. ME-Cleaner 2. Devuan 3. Librem 5.\n\nI prefer to buy a linux mainlined android device, and then install debian in the normal way, like it is a computer. So, I can install mobile optimized GUIs, like phosh, GNOME adapted for mobile. And honestly I don't know why smartphones like pine64 or librem 5 are so fashionable. When there are many devices, even very recent, with full linux mainline support. Much cheaper and well made like a nexus 5, or even nokia lumia. Unfortunately purism or pinephone produce real bullshit, but it's not their fault, anyone at their level would start making phones would do similar things,. Anyway, they have nothing special and the community has worked hard to make smartphones in common use with the same characteristics as these open source smartphones, immense reverse engineering works etc...",
				"added": 1593476879
			},
			{
				"comment_id": 44,
				"body": "> [1917](#comment_3_1GZpEfwLctYr3JvsD96qYGozQQPfqkagWP): Companies like Intel and AMD already have backdoors built into their systems via system management mode. They will never be able to crack Full Disk Encryption, though. Not with out unlocking quantum computing.\n\nWhy can't I do it? Having full privileged access to the cpu they can do everything, even a very simple keylogger. If you happened to see FBI in crisis seeing veracrypt, then they probably don't apply it. Quantum computers are unable to crack symmetric cryptography efficiently, however.",
				"added": 1593563530
			}
		],
		"1588505836_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 36,
				"body": "The difference between open source and communism is that the code can be cloned, the resources cannot.",
				"added": 1593272073
			},
			{
				"comment_id": 37,
				"body": "> [destroyer2](#comment_2_1NyQjj3DHz272iRXr7pQzesmNYQ7jgqjTJ): Anarcho-Communism is impossible. Once people learn to trade again it will become Anarcho-Capitalism. The way I see it is that technological progress will render the formation of a state impossible, but that will not happen for a long time.The four technologies needed for this to happen are as follows: [...]\n\nAs you cannot reach a speed greater than that of light you will not be able even in 100000 years. Over time new things are discovered, those already written are not corrected. But laws of physics such as that of gravity do not magically become invalid. Sure they are EXPANDED coming to further conclusions, maybe that depend on the planet etc..., but not contradicted. Same thing is for the speed limit of light. It is not that we have imposed it only because we have not been able to achieve it, but because theory prevents us from achieving it. The same goes for an intergalactic or even interplanetary internet, forcing us to immense latency. It might become possible if you find some alternative method that einstein hadn't considered or something, but it could very well be that Einstein considered everything, and at this point your views on superluminal speed become pure faith, like a religion. However, the slowness of the speed of light is relative, both for a physical matter, in fact for you who are traveling as fast as light will pass faster, but also for a neurological question. In short, absurdly you can \"speed up\" your brain millions of times, and make sure that the time to reach proxima centaurs at almost the speed of light, corresponds to your perception of a second now. But you should also make sure that all humanity has the same perception (otherwise they will forget about you as soon as you return) and that the whole environment is designed for you. To make me understand better, you could become a fossil in seconds that you stay on earth lol.\n\nCryptocurrencies are already doing well. There is no such thing as real world value. As it is for cryptocurrencies it is also for classic currencies. If for some reason the yen loses hit compared to other currencies, then the price of bread in yen will rise. it is simple supply and demand, it has nothing to do with cryptocurrencies.",
				"added": 1593299241
			},
			{
				"comment_id": 42,
				"body": "> [1917](#comment_2_1GZpEfwLctYr3JvsD96qYGozQQPfqkagWP): Open source is deff communistic. That's the point right? Putting the means of production into the hands of the workers themselves?\n\nOpen Source cannot be communism because code can be cloned, bread or equipment not.",
				"added": 1593563037
			}
		],
		"1593359750_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 38,
				"body": "> [scotcyguy2](#comment_41_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX): Bill Gates??   Lets ask other un-qualified random people about stuff...What does Belinda Carlisle think about quantum physics?\n\nBill Gates has been studying pandemics for many years, helped by experts in the field.",
				"added": 1593366913
			},
			{
				"comment_id": 39,
				"body": "> [edgelordofdecent](#comment_597_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): And has caused outbreaks in third world countries and sterilized people.\n\nWell then he is definitely qualified to evaluate the United States.",
				"added": 1593369653
			}
		],
		"1593271955_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": [
			{
				"comment_id": 41,
				"body": "> [reichama](#comment_7_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe): Somewhat along those lines: https://www.crowdsupply.com/eoma68/micro-desktop\n\nIt only has arm. The processor still remains closed, according to the agreements with arm, only they can use it and have it, because they bought it. But I just saw that they are working on an RISC-V opensource design with an apu for embedded. It could be very useful. But the big milestone is the foundry in the garage! Haha",
				"added": 1593512792
			}
		],
		"1593525780_12vUEi3fE9s7VKn8XtAaRfdEKtgfhuDTmJ": [
			{
				"comment_id": 43,
				"body": "> [reichama](#comment_8_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe): The underlying issue lies within the human brain. Being around people that are not like you causes stress to humans. As long as it's only few people that are unlike you it's unnoticeable, but as soon as you are outnumbered it kicks in. The safest way for everyone involved would be strict segregation.  [...]\n\nI talked to people who told me that when they see someone very different from them as an African or a Chinese, \"they see red and they want to kill them\", and they have no way of stopping, what can you do with these? Padding them with tranquilizers? It does not seem right. In any case, exaggerated in this way, it seems to me a real disease and I don't even know if it is among the list of ailments. So there is little to do, not even by campaigning and saying 24 hours a day that we are all the same, it resolves itself, or rather it gets worse.",
				"added": 1593563362
			}
		],
		"1593666130_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": [
			{
				"comment_id": 45,
				"body": "Seeding",
				"added": 1593787632
			},
			{
				"comment_id": 46,
				"body": "> [eltheal](#comment_46_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf): thanks, i plan to submit another post tomorrow. you have any site or blog on zeronet? i like reading a lot of the stuff on zeronet and other networks.\n\nAt the moment not, but possibly in the future I will do one about physics and biohacking.",
				"added": 1593868090
			}
		],
		"1593886909_1EQgeyAy9uQj8GCkPm7ha3jFdrj8Fz8pjL": [
			{
				"comment_id": 47,
				"body": "Are you serious?",
				"added": 1593944775
			}
		],
		"1593986652_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 48,
				"body": "> [styromaniac](#comment_2422_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): This site can’t be reachedarchive.vn’s server IP address could not be found.Try: [...]\n\nwtf shitty dns do you use?",
				"added": 1593991616
			},
			{
				"comment_id": 49,
				"body": "Anyway wikipedia is better:https://en.wikipedia.org/wiki/EncroChat",
				"added": 1593991750
			},
			{
				"comment_id": 50,
				"body": "> [styromaniac](#comment_2423_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): pl\n\nyou can use cloudflare (over https)",
				"added": 1593992344
			},
			{
				"comment_id": 51,
				"body": "> [styromaniac](#comment_2424_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I've been using that.\n\nMe too and it works good",
				"added": 1593994763
			},
			{
				"comment_id": 52,
				"body": "The info that there are for certain are 1) Datacenter hacked with a physical device 2) Hacked phones 3) The attacker necessarily needed the PINs or something. It seems clear to me that the terminals were hacked using a remote app vulnerability, exposed in the communication between client and server. Or even simpler: I understand that this company had the ability to remotely update the terminals. Well I wouldn't be surprised if the private keys to sign the code were on the same hardware as the common servers instead of completely separate. After all, we have seen this attitude in companies like Nordvpn where they saved the private keys of the CA in every vpn server among the 200 they had. In any case, this crap was very popular among the criminals and smartphones designated by them have seized hundreds of them, so the material on which to do pentesting was not lacking. And in any case, I continue to be amazed at the mess that Europol's have made with an exorbitant budget in 4 years. Shameful.",
				"added": 1593994780
			}
		],
		"1594178844_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 53,
				"body": "> [c2vjcmv0](#comment_10_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3): Piracy is an act of robbery or criminal violence by ship or boat-borne attackers upon another ship or a coastal area, typically with the goal of stealing cargo and other valuable items or properties.\n\nSeems fun.",
				"added": 1594208992
			},
			{
				"comment_id": 54,
				"body": "No, it is not piracy, often the sites that supply pirated software try to protect themselves by saying: \"Download these files only if you bought the original copy for backup purposes!!!\"",
				"added": 1594209148
			}
		],
		"1594225869_1FYnqRnNx4xbmec3dhwMaq1aE8WCqAVPHL": [
			{
				"comment_id": 55,
				"body": "If you don't like marketing, trading is something that works without it. If you like math, economics and maybe computer science, offcourse.",
				"added": 1594248793
			}
		],
		"1594185414_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 56,
				"body": "> [consensus](#comment_12_12MBVCw8iNrKvgTrV5NMPtPf6Z5V2WRHYU): Your brain can easily mold itself while the CPU only follows the instructions exactly as it is being told.\n\nYeah a brain is something hybrid between a single core cpu and a unparallelized ASIC. We should do something like that on the next CPUs.",
				"added": 1594283685
			}
		],
		"1594313562_1ETarTu7fyokpgRoBMiGZc8L3FwnDTGstL": [
			{
				"comment_id": 57,
				"body": "At 60 GHz, the oxygen molecule becomes highly absorbent of electromagnetic energy, which weakens the 60 GHz signals over distance, keeping them from overshooting their intended target. This oxygen absorption also reduces link radiation so a 60 GHz link will not interfere with other 60 GHz links operating in the same geographic vicinity, thus enabling higher frequency reuse.\n\nLess interference, less propagation = more MIMO, more antennas, less use of the spectrum per antenna = MORE SPEED!!!! But also higher costs to cover a certain area for operators. But who the fuck cares I want speed.",
				"added": 1594323301
			},
			{
				"comment_id": 58,
				"body": "> [ludeti](#comment_5_1ETarTu7fyokpgRoBMiGZc8L3FwnDTGstL): What about dioxygene we breath, does the body handle with dioxygene hit by 60Ghz ?\n\ndioxygene hit by 60 GHz is always dioxygene. Like a microwaved water, it is always water that you can drink. Maybe warmer.",
				"added": 1594329614
			}
		],
		"1589886834_16FFktck2XiA33aQcarrqPA8XzK3coaUBD": [
			{
				"comment_id": 59,
				"body": "> [fkdkuehilhf](#comment_1_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD): Cryptocurrencies don't need mainstream adoption. Their major use case is to escape capital controls. A wonderful protection against those giant parasites called governments.\n\nSeems good, but a mainstream adoption is better.",
				"added": 1594389826
			}
		],
		"1594440525_17WS8Y1keB3p8ELXFPbX1ZRLfeCESyojtF": [
			{
				"comment_id": 60,
				"body": "https://www.skytorrents.lol/ It merges all principal search engines. But if you can't find anything, duckduckgo is the best.",
				"added": 1594465964
			}
		]
	},
	"comment_vote": {
		"1_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"9_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"12_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"15_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"4_1B3YDm2AkrqwnXweEkq26T1MWV8Emvga9H": 1,
		"19_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"22_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"25_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"39_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"52_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"49_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"47_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"6_1PsYx6fCnYdvDMQrWpUVWdPNAWbJWs6mWJ": 1,
		"10_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3": 1,
		"58_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"1_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": 1
	}
}